{
	"title": "pp3的女人攻略",
	"description": "本博客专门研究如何追女人。40年生涯，感慨太多。成功了一些，失败太多。离了婚，又结婚。形形色色。人生乐趣颇多。",
	"links": "- [ggEnglish](http://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5)\n- [ggChinese](http://127.0.0.1:43110/14qBuhh5LCSe9CQ6uTwBmpmeGAe93Ut6ci)\n- [34 list](http://127.0.0.1:43110/12UZW9MXSJEAMRrPvm79smMbFr7kgN4R1x/)\n- [College 34](http://127.0.0.1:43110/1Mr11twqYfgYE8DGB6USc3QqvGwiqjmzqt/)\n- [Questions? Ask here](http://127.0.0.1:43110/1ERYCpoZ1pbP2snxJJJtq8vqrWykCV3Yhz/)\n- [华尔街](http://127.0.0.1:43110/1KtnLQynesLHw4QSc3kujrg5F67L2EH9Qh/)\n- [Fengshui](http://127.0.0.1:43110/1BzyFXKSi3ZcTD6HLWLxPHiQQkT8x6jaZe/)\n- [Fengshui 2](http://127.0.0.1:43110/1CH2gdZh6MoqVXryGXaxrJFG2gd6GDuJM1/)",
	"next_post_id": 239,
	"demo": false,
	"modified": 1516015319,
	"post": [
		{
			"post_id": 238,
			"title": "scene one is easy, there is nowhere else to start, this much we know.",
			"date_published": 1516014845.136,
			"body": "Scene one \n\nZoon in to her, she hangs there on the wall, all the beauty, all the time \n\nSchumman’s music rises\n\nAnd slowly, she comes out of the wall, come besides the child, take her hand, and start to draw\n\nthe scene one is done. Then comes the challenge: how we, the Quasimodo, can ever pick up this scene, not damaging the beauty in our mind already formed\n"
		},
		{
			"post_id": 236,
			"title": "could this be true and has been prove true as always - woman, it leads to life, and leads to new romantic ideal",
			"date_published": 1515917254.758,
			"body": "man comes from woman\nthen yearns woman for most of his early life\nwomen, with the disguise of a thing\npursue, hunt, exhaust\nthen come the moment of second coming\nthe new realization\nthen woman becomes mother again\nthe mother of the ultimate ideal, comes from woman\nshould man pursue?\ntowards the last romance\n"
		},
		{
			"post_id": 235,
			"title": "wenling called",
			"date_published": 1515807481.092,
			"body": "this woman.\n\nsurely she in connected, and solved the issue, as i believed she always could and would.\n\nshe mentioned more, and that is utmostly interesting and resounding in both mind and heart. \n\nlet's start some serious thinking, and here is a start. \n\nhttp://127.0.0.1:43110/1CBWqfSBo2XEzPDug4ydih9L8eAosSyW2g\n\n"
		},
		{
			"post_id": 234,
			"title": "called wenling today, she is as she is, always.",
			"date_published": 1515753054.514,
			"body": "i think among all the women i know, she is among the best, 20 years past, she means what she is. i am glad to speak to her. \n\nlet's see if her guanxi works. i am sure she will honestly trying her best. dosn't really matter the result."
		},
		{
			"post_id": 233,
			"title": "dreaming wenling",
			"date_published": 1514121017.117,
			"body": "the warmest night for so long a time. last night i dreamed of her, lying on our bed, not enticing but so calm, so warm, like mother like son. it has been almost 20 years. by the time of early morning she left, alone in a cart, besides a window looking out, maybe towards me, no smiling,  quiet, warm. \n\nshould i call her? in three's ago's email i found her phone number."
		},
		{
			"post_id": 232,
			"title": "where am i now",
			"date_published": 1514117056.88,
			"body": "for quite a few years by now, i am focusing on building up the family, it is the most fulfilling thing i undertook. i think we are on the way to something great.\n\nhow about women? they are around, i will get to them again once the condition is right....soon."
		},
		{
			"post_id": 231,
			"title": "maaileen review",
			"date_published": 1495853595.386,
			"body": "from time to time i need to visit back to her, and our relation has become a sort of perpetual and absolute mutual trust, although we have never met, likely forever we will never meet, in itself this is a unique adventure. but why? there are so many motivating factors. no doubt sex is the most enduring one, but also because of the absolute reality and truthful info she reveals about her life, a real woman s life in another corner of the world.\n\nso how is she?\n\nshe is busy, travelling many parts of the cock market.\nshe seems relax and fulfilled.\nshe seems not worried about anything, that is a true state of a beautiful woman in whatever kind of troubled fuking world. world goes on. whatever we need to do is just tactical maneuver."
		},
		{
			"post_id": 230,
			"title": "New blog post",
			"date_published": 1495789778.215,
			"body": "由江苏省属某文化单位纪委书记丁捷所著、中央党校出版社出版的《追问》一书，通过收录一批落马官员的口述实录，展现出他们由奋发有为到自甘堕落的人生轨迹，刻画出他们在贪腐面前复杂又矛盾的内心世界。\n\n　　在《追问》开篇第一章，作者写了一位因犯重婚罪，道德腐化，生活作风败坏而落马的副市长，相比于其他在囹圄中痛哭悔过的干部，这位仅仅判刑两年的赵副市长晚年安居山水田园之间，看起来日子过得悠然自得。\n\n　　然而追忆往事，赵副市长却借酒浇愁，他老泪纵横，一个劲的说：“我犯的不是罪恶，是罪孽。在我看来，比罪恶更恶”并且一直强调自己“被判轻了”。\n\n　　罪恶可以法律量刑来获得惩戒，然而罪孽却牵动因果，难以消解，后患无穷。\n\n　　文 | 丁捷\n\n　　本文由瞭望智库摘编自《追问》，中共中央党校出版社，2017年4月出版。转载请注明出处。\n\n　　1\n\n　　初恋失意，耿耿于怀\n\n　　我这个人，不是什么大贪污分子，也没有收受巨额贿赂。所以，你看，我就蹲两年，出来了，经济上就那点事，鸡零狗碎的，一点小钱吧。我犯的不是罪恶，是罪孽。在我看来，比罪恶更恶。罪恶可以现报，罪孽就不一样了，它会源源不断产生负面影响，它可能会长时间渗透、扩散、流传，贻害无穷啊。\n\n　　我犯事的基本情况，道德败坏，生活腐化，严重违纪，被双开；我犯有重婚罪，被判了两年，去年才出来。我记得当庭宣判的时候，法官问我，服从不服从，要不要申诉。我说，非常感谢法院的宽大处理，如果有什么申诉的话，就是，判得太轻了。当时，法庭上旁听的记者就笑了。后来有些小记者写文章，说我被从轻发落，掩抑不住心中的狂喜，竟然嫌法庭判得轻，庭上调侃起法官来。\n\n　　其实我不是耍那油腔滑调，更不是调侃法官，我是发自内心地希望判得重一点，当时死的心都有，只是缺少一根绳子罢了。判我无期、判我死刑，才符合我当时的心愿。当时我的结发妻子，我一直叫她小李，她就坐在庭下，我看到她一直绷着脸，端坐在那里，我说那句判轻了的话时，其他人笑了，她却流眼泪了。只有她懂我当时的心情，懂我这句话的心理缘由。您听我慢慢说完，就一定会像她那样，理解我说这话，不是矫情。也许你会发现，恨与理解，有时候也许是可以共存的。\n\n　　我18岁出去当兵，在此之前只出去过一次，是到县城去找我的一个女同学。她是当年在我们这里插队的知青的女儿，后来跟她爹回城了。我那次进城，去的时候搭乘了一辆拖拉机，回来的时候靠两腿，走了一天一夜，不知道迷了几次路，跌了多少个跟头，差点累死在路上，摔死在山里。但是，那一天一夜，我春风得意马蹄疾，我是吹着口哨迷路、唱着歌摔跟头的。\n\n　　我回到家鼻青脸肿，但是我心花怒放。您一定奇怪了，进城灌了什么迷魂汤了，吃了什么脑残药了？我恋爱了，真的，就那次进城，18岁的我，和她确定恋爱关系，对象就是我去看的那位女同学，知青的女儿，姓吴。她见到我，很高兴，领我到县城的一个国营饭店，吃了两个肉包，告诉我说，我喜欢你，心想你如果进城来找我，我将来就嫁给你。但是你要努力，要走出那个山旮旯儿，否则我的爹妈不会同意。\n\n　　然而这份感情没有什么结果，我当年没有考取大学，就出去参军了，跟她通了两年的信后，某一天她突然就不回信了。我不服气，请假回去找她，她已经跟别人定亲了。\n\n　　她当时在县百货大楼当营业员。找到她时，我站在柜台外面，她站在里面，两个人打了一个招呼，然后就窘在那里，无话可说。过了一会儿，她说，来不及了，这事只能这样了，你要原谅我，是我爹妈做的主，而且我们也没有那么确定，那个什么关系，是吧。我说好吧，那我走了，回部队了。她说好的，有空经常回来玩啊。我头也没有回，心里羞耻而愤懑，大步地走了。\n\n　　在那个时代那种情境下，我的内心震荡是很大的。看起来，我没有受到这件事多大的影响，甚至一度还化愤懑屈辱为力量，激发了我很强的上进心。后来我能在仕途上爬得那么高，也许跟这件事是有冥冥中的关系的。\n\n　　现在想想，这一件事实际上没有什么了不起的。如果境界高一些，就是一段美好的青涩的恋情，一段手都没有碰，只约过两次会写了几十封天马行空的信的所谓的初恋，完全可以成为一段天真、单纯的情感记忆，应该是人生的一种小动力啊。小吴喜欢过我，给了我少年时期的自信，给了我一种上进人生的发端。可我骨子里是个小农民，现在反思，我读书少，眼界心胸气量都是狭隘的。从那个柜台前离开的时候，表面看上去很平静，其实心中翻江倒海，恨不得炸了那个百货大楼，那个了不起的全县城最高的狗日的大楼。这几年看了很多书，静思的时候也很多，梳理自己的人生，发现自己其实那时候心里就埋着一粒狭隘的种子，或者叫市侩的种子。有了这颗种子，很容易长出某种扭曲的感情，某种有杀伤力的情绪，甚至在美好的树上，结下了怨仇的果子。这些果子随时会坠落，在心灵的土壤上腐烂发酵，产生负面的毒汁。\n\n　　说件事吧，最能说明我的这种内心扭曲。\n\n　　2010年我45岁，当选副市长已经是第二年，风华正茂，踌躇满志。我特意到老家县里视察，觉得那是荣归故里。我还毫无预告地临时提出，要去看看县里的百货公司大楼。县长告诉我，百货公司早就不存在了，改制了，但大楼还在，现在是一家民营的大超市。我就问原先的职工怎么安排的，他告诉我改制好多年了，愿意留下来的加入了民营超市，不愿意的分流或者退休了。我说那就看看这个超市吧。我有一种恶俗的快感，我要在前呼后拥中，出现在这座大楼里，甚至出现在她的面前。我的脑海中出现了很多设想的场景，无不是她的惊愕，她的揪心懊悔，她的狼狈什么的。我甚至设想了对话场景：\n\n　　“这位营业员同志，现在老百姓（603883，股吧）购买需求旺吗，对物价满意吗？”\n\n　　电视台的记者赶紧把镁光灯打在她尴尬的脸上，把话筒朝她嘴边靠过去。\n\n　　“谢谢首长关心，很旺很满意。”\n\n　　如果她没有认出我来，也许会这样回答。如果她认出我来，是掉头跑掉，还是落落大方地说，啊呀，你不是赵某某吗，当大官了呀，关心老家来了。\n\n　　然而当时我去视察了那家百货大楼改制后的超市，并没有看到吴。但我在超市展览室的员工榜上看到了她的照片。她看上去很胖，眼袋很重，脸上全是斑斑点点的，完全没有了少女时代的那种白净。我突然心里有些快感，觉得自己为这个女人纠结着，跑到这个臭烘烘的超市来视察，简直是滑稽可笑。\n\n　　2\n\n　　阴霾退去，爱情事业双丰收\n\n　　1989年我24岁，跟一位东北姑娘小李结婚了，她当时在军区医院当医生，业务水平公认的出色。小李虽然相貌平平，但脾气很好，很温厚，让我找到了港湾的感觉。关键是她虽然是大学毕业生，又是部队的干部子女，却让我一点感觉不到压力。她从来不轻视我是山区旮旯的人，不轻视我只有高中文凭，对我父母的态度比对她自己的父母还要好。日常生活中小李从不对我挑三拣四，在她眼里，我什么都出色，长相、谈吐、能力、为人处世，用今天的话说，她无不点赞。她不光给了我一个温暖的家，而且使我获得了无限的自信，老婆的欣赏对男人来说，真的非常有力量。\n\n　　1991年的抗洪救灾，我忘我投入，等回到家我的闺女都能在地上爬了。我立了大功。第二年，27岁的我因功被提拔，成为我所在部队最年轻的正营级军官。\n\n　　2000年我35岁时转业已经是正团级，转到地方上，当了市经贸委副主任。后来体制改革，经贸委撤并发改委，我被调到市开发区管委会当主任。两年后又兼任了党工委书记，党政一把抓。开发区是在我手上飞速发展起来的，它至今还是我们市里的经济发动机啊。\n\n　　也是因为这份功劳，组织上没有亏待我。2009年我44岁就当上副市长，依然主抓这一块工作。上任副市长多年一直到出事前，我都是兼着开发区党工委书记职务的。后面几年，有的人恨我霸道，背地里骂我是开发区的“独裁者”，他们给我取了一个外号叫“独裁赵”。\n\n　　3\n\n　　英雄不爱财，但可能爱美人\n\n　　大概是我当开发区主任的第二年春节后，我有一个老战友介绍一个姓庞的企业家来拜访我，说要过来投资一个高科技研发中心基地的项目。庞老板这人其实是个靠建筑起家的土老板，只有中专文化，素质并不高，但能吃苦，而且很有世俗精明劲儿。他完成了原始资本积累，想升格自己的事业了，手上筹措了一点钱，出来注册了一个名字看上去很高大上的科技公司，其实也就是名称显得高科技，他那人和他原先做的事，跟高科技一点也沾不上边。\n\n　　我为什么这么支持他？因为他是老战友介绍来的，我这人讲义气，讲感情，特别是听到“战友”两个字，我的心里就有一股暖流，甚至一股激情。当然，还有一个理由也坚挺，就是这件事，外人看起来像一座难移的大山，可对我来说，这不是愚公移山啊，移开这些政策的山，我办得到啊，至少在开发区这个地盘上，别人不能办到的，我能啊，嘿嘿。更重要的是，我没有什么好怕的啊，我不收他送来的钱啊，所以我不怕。\n\n　　庞老板想了很多办法，来变相地表达对我的报答。在他看来，只有我接受了他相当多的好处，他才会成为我真正的朋友，利益同盟啊。他隔三岔五请我吃个饭，打个高尔夫，我都去了。给我送几条香烟，几瓶红酒，我也都拿了。但只要是钱和贵重物品，我自始至终没有要他的。\n\n　　但庞老板这种人，如他自己说的，江湖中人，比鬼都精，他总是能想到办法瓦解我的。他终于有一天抓住了我的一根软肋，实现了他对我的突破。他窥到我的内心，是一次陪我在成都参观他朋友的一家化妆品企业，庞老板说他也是这个企业的第二大股东，所以请我过来指导一下，自己人的事，务必帮他这个忙。参观完厂区后，企业的老板在他自己的会所里请我吃饭。吃饭时，老板安排了五六个姑娘，说是他们化妆品品牌的平面模特儿，过来演示化妆品的效果。这些姑娘一个比一个靓丽，特别是脸蛋，确实漂亮，而且漂亮得有特点。\n\n　　这是一个让我彻底失眠的夜晚。我的心里失去了多年仅以权力支撑起来的平衡。这些姑娘多么年轻美丽，风韵十足，而这些土包子企业家，靠我们的帮助发财，然后用这些钱享受着葡萄美酒夜光杯，身边全是精挑细选的女孩子，而且招之即来挥之即去。第二天从成都回来的路上，我忽然有一种严重失落的沮丧。我的心理状态显然被陪着我的庞老板看穿了。他边开车边喋喋不休地向我讲这个服装老板的故事。\n\n　　“领导你看，这个死胖子跟你没法比，人丑，巨胖，初中文化，啧啧！”他摇头晃脑地咂着嘴说，“可是他过得比领导您潇洒多了，不光是因为有几个臭钱啊。”\n\n　　我说不是因为钱多，是什么？\n\n　　庞老板竟然脱口说了一句如诗词的话：为什么我们青春不再，因为我们正当的欲望，被禁锢的思想，愚蠢的道德打翻在地，我们人性从此矮小而萎靡。\n\n　　土包子说出这种文采飞扬却又意味深长的话，我着实吓了一跳。\n\n　　唉，现在想想有点荒唐。可那时似乎再正常不过了，我从山里出来，当兵，吃苦，被女人抛弃，颓废中重生，玩命抗洪，奋发上进，一步一步爬行，谋到这么个不大不小的位置，一眨眼，人到中年，我的人生算是尘埃落定了吗。也许，我自己没有看透自己的心思，人家看透了，人家把我心里的某种失衡检测出来了，人家开始“对症下药”了。在此后的日子，我乐此不疲地吃起了这味“药”。\n\n　　4\n\n　　一旦干顺手，就刹不住闸\n\n　　我第一次出轨就是姓庞的安排的。\n\n　　那一年我到成都的一个经济管理培训中心去学习了两个月。在成都期间，庞老板几乎每天都到培训中心接我出来吃饭。他在成都有一个专门用于接待的私人会所，会所的经理是一个32岁的女人，姓沈，成熟妖媚，激发了我身体里的熊性，是的，熊性，用雄性这个词似乎力量还不够。\n\n　　也不知道为什么，这个时候理应心理失衡病治好了，可是我却产生了一种更加空荡荡的感觉。直到那年春节前，我遇到了她，我叫她小乔。\n\n　　准确地说，好像小乔的出现，把我心里的那个空荡荡的缺口给填上了。我认为此前20多年，我没有谈过真正意义上的恋爱，更谈不上人生该有的轰轰烈烈爱一场。小乔有一米七几的个子，白皙，修长，纯真无邪。她在跟我交往的过程中，从来没有向我伸手要钱，而总是开玩笑说，我这是以身抵债呢，从现在起，我不叫“小乔”了，我是还卖身债的“喜儿”，你就是“黄世仁”。我从此就叫她“喜儿”，她就喊我“黄世仁”。\n\n　　“喜儿”的出现，经常让我彻夜难眠，思绪万千，我觉得这是上天冥冥中给我的补偿，我在事业上打拼了几十年，情感上却如同空白。“喜儿”让我如获至宝，情感上产生巨大的满足感，甚至内心偷偷地升起一种自豪感，一股骄傲感。\n\n　　我太风光了，我的风光掩盖了一切，甚至麻痹了自己。我与小乔的关系，并不是密不透风，没有半点跑漏。但是那些年太疯狂了。说实话，社会风气不太好，一个大权在握的官员，一个把企业做起来的企业家，一个有点名气的社会名流，好像在外面没有花花草草的事，都不正常了。所以，似乎都没有人过分在意男女绯闻。\n\n　　权力是最好的春药，除非从未拥有，一旦拥有，自觉减少与放弃，难上加难。这句话应该是基辛格说的吧。姓庞的老板把这句话经常挂在嘴边上。\n\n　　我结识了庞老板之后，最大的变化就是不断把良药变成春药。我也不是不知道，领导干部被党和人民授予的那点权力，本来是一味良药，主要用来造福众生，同时也可以医治自己的混沌。但是，不知道为什么到我这里，竟然成了真正的春药，而且那么催情，一发而不可收。我染上姓沈的少妇，后来就有了小乔；有了小乔，我并没有止步于小乔。就在我当上副市长的第二年，我通过庞老板的引荐，认识了一家广告公司的业务员小凡。\n\n　　小凡是那种看上去野野的女孩，性格火暴，私生活奔放，给了我完全不同于前面几个女人的刺激。我很快迷上了小凡。为了稳住她，我让她辞职出来，自己当老板，注册了一家广告公司，主要接开发区内的企业形象设计的活儿。一般我不亲自打电话帮她，而是让庞老板出面，跟商家说。这边的企业都知道庞是我的马仔，能给的项目就给了，一年三五个小项目，足够小凡维持公司和优裕生活了。而这些关照小凡的企业，也都认为小凡是庞老板的小蜜。他们觉得，关照了小凡，与庞老板近了，也就与我套上近乎了。至少，可以在庞老板组织的饭局上，与我同一个桌子。\n\n　　小凡很享受这种“关照”。她很快把企业做得像模像样，很快买了自己的房子。她按照新婚房的标准装修这套房子，生活用品都是成双成对配置的，有她一份就有我相应的一份。入住的那一天，她还在里面贴了“双喜”，我们算是搞了一个彼此见证的“婚礼”。从此，我又多了一个家，三天两头过来住住。\n\n　　2012年春天，小凡怀孕了。这一次跟对小乔不一样，我连一句反对的话都没有说，反而表现出渴望孩子早点出生，渴望她给我生一个健康的大胖小子——刚才忘记说了，2009年小乔给我生了一个私生子，我既不安又欣喜。毕竟是“婚外有婚”的第一个“结果”，总觉得不是名正言顺。但自己的孩子上大学了，又是个女儿，由于我顾家少，她跟我也不太亲近，所以中年得“子”，我内心还是得意的。然而在“儿子”成长的过程中，我们渐渐发现了异样。他跟其他孩子不一样，两岁的时候还不会说一句完整的话，一走路就摔倒，反应特别迟钝，不能准确表达任何一件事。自从发现这个孩子有问题之后，我开始有点心烦意乱，上班没有那么专心了，总是在研究怎么治好“儿子”的病。\n\n　　小凡怀孕的时候，我跟小乔的儿子两岁了，孩子的不正常已经表现得很明显。所以，当小凡把她怀孕的消息告诉我时，我脱口而出，好好，如果你愿意，就要了吧。我老了，喜欢孩子。\n\n　　说是喜欢孩子，潜意识里是喜欢健康的孩子，最好是一个健康的儿子。\n\n　　2013年初，我的第三个孩子出生，小凡为我生了一个健康的孩子。她是一个女儿。\n\n　　5\n\n　　十八大后不收敛，痛思己过\n\n　　我被“双规”的那一刻，绝对是如释重负，当天夜里我睡了9个多小时才醒。省纪委办案点上的同志告诉我，我呼噜打得震天响，害得他们在外间都没有睡好。\n\n　　此前我多次有过自首的冲动，我已经把自己拖进了一种无法消受的生活残局。\n\n　　我在三个女人、三个孩子、三个像模像样的家之间疲于奔命，在道德、舆论、党纪国法的夹层里东躲西藏，我自欺而欺人，自恋而自虐。党的十八大之后，也就是我在任的最后一年，我惶惶不安，经常夜不能寐，头发掉了一大把。我希望尽快结束这种噩梦。我也想到过自杀。但是，那么多女人和孩子在我身后，我除了做鸵鸟，缩着脖子等待猎人，其他什么勇气、什么力气都没有了。\n\n　　我的结发妻子小李在我最困难的时候嫁给我，给了我一蹶而后振的力量，给了我因为失去初恋寒心后的温暖，修复了我的心，带我进入了一个男人正常的生活轨道。在那些“老赵”“小李”互相呼唤着的岁月里，我曾是那样的感激她，敬重她。前面跟着我吃苦，后面我熬出来，位居要职的时候，她却没有享受到任何好处。我现在跟她们几乎联系不上，我希望早早获得她们的原谅。\n\n　　我特别愧对小乔。她认识我的时候，不谙世事，身心单纯。我设计把她罗入我的情网后，她也许由于我对她家人和朋友的帮助，由于我的信誓旦旦，有过短暂的满足和快乐。但是，她一生的悲剧从儿子出生，拉开了序幕。我无法想象，她是怎么独自面对这份假婚姻的，怎么独自接受这份孽情给她带来的这个智障儿子的，怎么惊悚地发现我在她之后又有了新的女人新的子女的，怎么在我落马时从虚幻中跌落到残酷现实里去的。\n\n　　小凡跟我的时间并不长，她的确是那种抱着大树好乘凉的女孩。我占有了她的青春，又不能直接给她财富，只能帮助她建立一份事业。后来她知道了我家外还有一个家，她的心理失衡了，无法平息。她砸烂过家具，也割过脉。为了安抚她，我每次都向她保证只爱她一个。当她把怀孕的事情告诉我的时候，我表现出来的坦然与积极姿态，让她对我增加了信任。我位高权重，她觉得在我的庇护下，安逸而又安全。她一度似乎就接受了做“三房”的现实。当然，很多事情可能是我的错觉，特别是对小凡，我真的了解她多少呢？我出事后，她就彻底消失了，带着孩子走了，没有跟任何人招呼一声。她带走的毕竟是我的骨肉，我的女儿啊。我还是挺想她们。\n\n　　我服刑期间，官场上、情场上那么多的朋友，那么多的“亲人”，亚“亲人”，伪亲人，来看我的寥寥无几。本来与我感情淡漠的大女儿，却每年寒暑假都来看望我。在情感上，我欠她的债最多。\n\n　　女儿去年去重庆参加工作了。从中学开始，她变得平庸，现在的工作也很普通。她本来可以卓越的，但她没有能如我们的期愿。这个虽然是一份遗憾，但我不怪别人，更不会怪她自己和她的母亲，责任在我。同时我也想通了，平安未尝不是福。女儿是最快原谅我的人，这也是我的欣慰。\n\n　　我天天祝福女儿，祈愿她遇到一个好男人，两人平平凡凡，相爱一生。\n\n　　6\n\n　　幡然悔悟，此恨绵绵\n\n　　权力和能力加身，若是运用不好，就是两个妖孽，我的命运就是这两个妖孽放纵坏的。\n\n　　我的能力是市里公认的。前面提到，我们市的开发区在我手上，迅猛发展，成为地方经济的发动机。我担任副市长之后，提出进一步加大发动机马力，带动全市经济、社会快跑，拉动属县区接力的思路，得到了市委书记和市长的认同。一个以现代产业为中心的扩展规划在我任上科学定位，并很快实施，成效显著。我们扩大了开发区为产业新城，核心区在原有基础上打造现代产业群，培育了新型汽车配件生产、环保节能家电生产、生物化学、新型材料等趋向未来型制造业，内侧规划配套服务业和流通业，以及高科技研发基地，周边开发建设生态幸福小镇群，建设宜居新城，吸引人气，留住人才，美化产业外围环境。我作为副市长主抓这项工作不过四年，一个生机勃勃的新型产业新城区初具规模。新城还用地理和产业衔接各县区，真正带动县区经济上了跑道。\n\n　　我的确太过居功自傲。每次当我面对前来考察的中央、省市各级领导，慷慨陈词，展示我的蓝图的时候，我从他们的频频颔首、赞赏微笑甚至激情鼓掌中，找到了新的自信，新的兴奋点。那些生活上的风流麻烦，内心的敬畏与羞耻，在这种激昂的情绪中，变得薄如纸片，在我心灵的灰暗夹缝中，消失了影踪。\n\n　　这算什么事呢？在我的贡献，我的能量面前，这不就是一点不值一提的风雅吗？\n\n　　当我的绯闻传得满地的时候，也是我马上“荣升”消息漫天飞的时候。但是，绯闻我不一定经常听到，马上荣升的祝福却是每天不绝于耳。有说我要升任市长的，有说省里器重我，要调任政府某核心厅局一把手的，也有说我已被中央看中，作为后备交流干部，到邻省任职的，等等各种版本。好消息想听就有，坏消息难得露面，我真的处在没有昼夜的亢奋之中。\n\n　　如此这般，一针一针新的鸡血，打进了我的身体........\n\n　　老赵的故事，我听了几乎整整一夜。\n\n　　老赵喝着讲着，讲着喝着，后来全然不顾我的存在了。到最后，语速极快，而且全部变成了方言，我听得非常吃力。而且，他开始思绪混乱，一会儿诅咒自己，一会儿又狂话连篇。他还开始重复自己所讲的内容，甚至肆无忌惮地描述小乔和小凡的魅力善良，表白自己跟她们是真心相爱。他也许是太疲劳，酒也喝太多了，说着说着，进卫生间去吐，回来歪在沙发上就睡着了。\n\n　　我这一夜听下来，觉得赵的优点不少，比如，坦率，血气方刚，肯吃苦，有能力，肯干事，情感丰富，精力充沛。但他的基本素养中没有健全的道德体系，人格不太稳定，价值观比较模糊，尊耻颠倒，缺少这个层次的领导干部应有的强大信念。这样的干部早晚要出事，晚出事不如早出事，早点出事，利国、利家、利他、利自己。"
		},
		{
			"post_id": 228,
			"title": "maaileen is half in love",
			"date_published": 1474184447.147,
			"body": "well, our dear maaileen is half in love, finally, with an abc, half successful a guy he is but enough to attract our maaileen. she asks my opinion, my answer: go ahead, embrace the love and life that you still have, nothing to lose except another time to go to bed. "
		},
		{
			"post_id": 227,
			"title": "继续抓紧种岛是一步妙手大杀技! 引用普京的一句话 - “没有实力的愤怒毫无意义”。领土问题没有谈判，只有战争!",
			"date_published": 1468899913.867,
			"body": "中国的现实已是如此，韬光养晦走到了历史的尽头，再软弱低调中国将永远丧失南海，种岛，亮剑是中国唯一之路!\n"
		},
		{
			"post_id": 226,
			"title": "日本避孕套遭国人抢购？都是傻逼",
			"date_published": 1468827462.451,
			"body": "Blog post body"
		},
		{
			"post_id": 225,
			"title": "偷偷摸摸20年，不如中国干1年，做事情要鸡巴讲效率",
			"date_published": 1468827246.822,
			"body": "\n　　\n\n珊瑚礁上怎么能起降飞机呢？\n　　\n\n要知道，在南海，别说是礁，就连很多称作岛的地方，在涨潮的时候，也仅仅是留下几平米的立锥之地，站几个人都嫌挤得慌。\n　　\n\n　　\n\n这个行动，其实周边的越南和菲律宾，都干了几十年了，现在还在做，那就是在上面修建基础设施。\n　　\n\n新加坡国立大学法学院副教授王江雨透露，从上世纪七十年代开始，菲律宾和越南，趁着中国国内在忙着搞革命，抢了咱们很多岛，然后就在上面搞建设妄图造成既定事实。\n　　\n\n不过，小国家就是小国家，他们的手段无外乎三种——建高脚屋，派兵驻守，修跑道，偷偷摸摸用船从陆地运输砂石建材填海，但忙活了几十年，也没忙活出啥名堂来。\n　　\n\n于是，中国出手了。\n　　\n\n中国出手最晚，但一出手，就用了疏浚能力亚洲第一、世界第三的天鲸号绞吸式挖泥船，就地取材，喷砂造陆，这直接就是碾压性的优势！\n　　\n\n王江雨教授的原话说：“中国在一两年内做的，人家几十年做的东西加起来再乘以几十倍也没有中国干得多，所以这就会引起其他国家的警惕”。\n　　\n\n南海生长出7艘不沉的航空母舰\n　　\n\n真有王教授说的这么夸张吗？\n　　\n\n事实是，比这还要夸张。\n\n　　\n\n永暑礁美济礁和渚碧礁等珊瑚礁，现在真的都可以改名字叫做岛了。\n　　\n\n永暑礁原本露出水面的面积只有0.0081平方公里，现在已经变成了接近3平方公里，成长了370倍！接近3平方公里是什么概念，马尔代夫的首都马累，就是那个度蜜月的爱去的“天堂”，面积才1.5平方公里，只有永暑礁的一半大。\n　　\n\n现在，永暑礁上不仅有了足球场，连网球场都有了，当然，还有一条长达3.3公里的飞机跑道，足以让包括轰炸机在内的所有飞机起降。今年年初的1月6日，永暑礁上就成功举行了起降飞机实验。\n　　\n\n而这一切，只用了9个多月的时间。\n"
		},
		{
			"post_id": 224,
			"title": "军事战略重点转移到南海地区，还可以带动中国一系列经济发展战略的调整，大大促进“十二五”新兴产业的发展。以争夺并控制南海为拉动，大力发展航空、航天、造船、信息产业，振兴现代战略产业和军工技术，锻造空海一体、攻防兼备的新型军队，构筑常规、远程火力打击体系，把威胁中国的外部军事力量，拦截、压制在4000公里之外，将南海地区纳入我国基本火力打击圈，为本土赢得安全纵深。\n",
			"date_published": 1468755477.483,
			"body": "Blog post body"
		},
		{
			"post_id": 223,
			"title": "当前南海危机，是菲律宾和越南主动向我国挑衅，我们应以此道义优势，抓住不放，炒热做大南海话题，对国人进行思想动员，然后进行战略转移。\n",
			"date_published": 1468755428.203,
			"body": "Blog post body"
		},
		{
			"post_id": 222,
			"title": "美国开出交出策划者的条件",
			"date_published": 1468752124.196,
			"body": "卧槽, 人命是可以讨价还价的. 你马勒隔壁."
		},
		{
			"post_id": 221,
			"title": "a turkey is a turkey",
			"date_published": 1468751820.629,
			"body": "it is unique in its own many ways. the people part i think it is understood. but the soldier part is just wierd."
		},
		{
			"post_id": 220,
			"title": "things in our life",
			"date_published": 1468383282.282,
			"body": "股市操盘手，爱一个人，不需要为她做什么生命攸关的大事，也不用为送鲜花。爱一个人，只需要经常她一些经常能赚到钱的股票，让她有自尊的在股市中赚到钱，然后用这份钱想做什么就做什么，不想做什么也可以不做什么，当然也你需要带她见一些她自己原来见不到的世面，你是一个有血有肉的情人，而不是一个赚钱机器；操盘手，爱一个人，请一辈子都为她做这些微不足道的小事。爱就是，把小小的关心，和自己的专长结合起来，延长到一生一世。我与许曦的爱情初始阶段就是这样的。\n\n自称“人家”的女生，基本上啥都不用做，有男生会替你做掉大半；自称“偶”或“藕”的，至少能省去一半的工作；自称“我”或“俺”的，全部工作都是自己的；自称“姐”或“爷”的，连男人的活都是你的；自称“老娘”的，是被股灾套住的；自称“公子”的，你猜一下？\n\n对了，自称公子的女生，喜欢与人幽默的斗嘴。\n\n  我与许曦经常周末一起去爬山，一边爬山，一边斗嘴。我对许曦说：“我喜欢你！”许曦回答：“神经病！”我认真的问：“那你喜欢谁？”许曦看了一眼，又说：“神经病！！！”我大声的欢呼：卧槽!这幸福来得太突然了！\n\n  许曦一次见我，她刚剪完刘海，问我咋样？我说：“说得好听点，像仙女一样。”她瞪着我问：“那说得难听呢？”“像。。仙。。女。。一。。样。”我捏着嗓子学鸭子的声音说道。\n\n  许曦：1+1等于几？我：等于二。许曦：你不关心我。我：？？？许曦：难道我问你的问题不无聊吗？我：有点。许曦：那你不关心我为什么无聊？你就是不关心我！我：你有点像江苏卫视《非诚勿扰》中的一个女嘉宾。\n\n  “打劫，把你的作业交出来！”不知什么时候，这句话成了她对他在微信上最常说的一句话。许曦说这话的时候，就是问他有没有可以买的股票。“打劫，把你的作业交出来！”她还在微信上跟个做鬼脸的图案。上次我没有像往常一样把作业交给她，而是打下一个股票名称代码加上一颗心的图案：“世金地产+心的图案”“哈？”她:“？”我用声音回答，缓缓地却吐字无比清晰：“你打劫了我的心！！！！！！！！”她：“32个赞！”\n\n  只从买进世金股份这只股后，晚上曾经做梦，幻想着这只股会成为一只敢上九天揽月的牛股，我也跟着这只股上了月亮，见到了嫦娥，嫦娥长的好像许曦啊！我与嫦娥拥抱接吻，最浪漫的法式接吻，是深情之吻，是舌头和舌头的接触之吻，情人之间用潮润的舌头投向对方的嘴。舌吻步骤，先轻柔地将爱人的脸庞吻过一遍。从眉头开始，向下探索至下巴与双颊，最后将定点落至双唇部位。利用两唇相接时……以舌将自己的唾液渡入对方口中，并吸食对方的唾液。适用于两情相悦且身体健康的爱侣，会觉入口之唾液为琼浆玉液般。接下来，唇与唇的嬉戏正式上场。伸出舌尖轻轻打开对方的唇片，转一圈，微微张开嘴唇，轻轻的压在对方的唇上，千万别憋气，用鼻子呼吸，这个时候可以微微想环状一般慢慢的移动嘴唇，也可以选择静止不动。吻到一半的时候，是重头戏，缓缓的张开嘴巴，用舌头轻推对方的嘴唇，诱使她，让她把嘴巴张开来，最后就大胆长驱直入!挑逗对方的感官，让湿润的舌头彼此交会，快乐至最高点!\n\n  股市真是无情，华尔街一位著名操盘手曾说：“股市中赚钱很快，但亏钱也很快，而且，每次亏钱大都是在赚了钱后洋洋得意之时发生的。很快，这种事情就在我身上发生了。世金地产不但没带我上九天揽月，反而带我下五洋见鳖，还被老鳖咬了一大口，我他妈的成了西游记里的猪八戒，一下子被贬到流沙河。\n\n  让许曦在世金股份这只股赔了钱，让我觉得好没有面子，只得硬的头皮让她卖掉了，还好，她回微信时说，“哪有百战不败的将军，再找一只股帮我赚回来啊。”我回答：“一定的，我爱你，如果不在股市中帮你把世金股份赔的钱赚回来，我就不理发不剃胡子，也不敢去见你了!”\n\n  炒股的时候，我最恨有人抢走属于我的东西，凡是我失去的，我都要亲手一件件夺回来，但是怎么夺回来啊，这真是一件让人焦虑的事情。头疼了好几天，我自己开导自己，焦虑是最没用的东西，它不只搅乱你的脑袋，偷走你的快乐，浪费你的时间，最后还什么都没改变。赶走焦虑的最好办法，就是笔录反思、重新判断，果敢行动！人都是被自己打败的，而且首先给自己的情绪打败。英雄人物越是在关键时刻，越是冷静、理智、抓主要矛盾、把握关键点、控制好细节，屌丝人物在平时也是可以神气一下的，但在关键是则只会惊慌失措、情绪失控、失去思考力、最后把事情弄砸。我不是一个屌丝，我不能做一个屌丝!\n\n  我发现了梅花科技这只股票，发现这只股票既然偶然，也有必然，你现在先别乱猜结果，结果肯定与你想象的不一样，无论是发现的过程和最后的盈亏结局，股市就是这样的神奇。\n\n  那天，有一个不认识的电话打通了我的手机，打电话的人说：“我是粤发证券的一个大户，我听过你的课，我们周五晚上有一个饭局，想请你来，你有没有时间？”我回答说：“谢谢你的邀请，我有事情，参加不了。”那个人赶紧接着说：“我们这个饭局，不是一般的饭局，参加的人都是有身份的，主人会给每个客人一块瑞士名表，你有兴趣吗？”我没有犹豫，说：“有兴趣，我可以参加。”\n\n  就这样，我认识了这个打电话的人，他叫钱诚儒，他是粤发证券的一个大户，开有一个私募基金，但是基金的规模不大，他的弟弟在粤发证券工作，因此他还是一个大户大宗交易、定向增发、股权质押的掮客，他想让我在周末的股市沙龙上为他推销他的私募基金和推销他的大宗交易和定向增发的业务。\n\n  与老钱的交往，使得我对大户间的大户大宗交易、定向增发、股权质押这些业务有了新的认识，一般的散户有可能一辈子都不会了解这些猫腻的，在股市中，低端食物链动物确实是无法了解高端食物链动物的的手段的。人不要怕被人利用，被利用的过程就是你的能力武功提高的过程。\n\n  见了钱诚儒之后，我开始恶补一些大户常用的交易手段，虽然自学的有些困难，但是我知道，你不会的东西，觉得难的东西，一定不要躲。先搞明白，后精湛，你就比别人优秀了。因为大部分人都不舍得花力气去钻研，自动淘汰，所以你执着的努力，就占了大便宜。\n\n  事实也确实是这样，恶补定向增发这块知识后，我发现定向增发这块业务知识熟悉后，对选股能力的提高帮助很大，属于盲点套利的范畴，不是一般的技术分析能比的，比如说我研究梅花科技这只股票时，发现大股东孟大海曾经在发行了2013年3月25日发行了明天投资 8 号 结构化集合资金信托计划，这个结构化信托全仓以定增方式买入了梅花科技，是固定收益产品，且即将到期。这只信托产品的规模是7亿。计算下，这只结构化信托的年化固定收益是12.5%，两年就是25%，根据信托产品进入前十大的时间推算，目前浮亏约10%。又查了下上市公司的资产负债表，发现上市公司在各金融机构的信用额度几乎用完，只有一个中期债券正在申请中。而这只中期债在年底信托到期时能不能拿到钱还不知道，即使拿到钱了也不能覆盖信托到期的兑付规模。那么推算下，信托产品至少要在涨到公司股价9元以上出货，才不会亏本 。当时的股价只有5.5附近，套利空间还不小，于是我就认定这只股有明显的潜力。\n\n同时，我在研究停牌重组的股票停牌前的市场特征时，发现国企股往往都是在停牌前两三天连续放量，而民企股则是停牌前尾市砸盘压低收盘价，这可能是由于国企股保不住密，而民企股保密好但大股东自己想多赚一些钱，停牌前砸尾市以便于多吸一些货。\n\n我发现梅花科技这几天就出现了无故砸尾盘的现象，于是就买了半仓，由于世金地产的教训，不敢再满仓买一只股了，我告诉许曦也买半仓，当时想，即使停牌爆题材，也会很快完成重组的，要不然信托的刚性兑付就成问题了，而且如果要完成庄家成本以上的出货，波动范围至少要到10元以上才可以。所以我跟许曦和同事们说梅花科技时，很坚决的告诉他们，这只股能涨到10元以上，果然，后来没过多久，梅花科技不出意料的重组停牌了。三个月后爆的题材是收购伊品生物，而且大名鼎鼎的中植系参与定增。\n\n这只股我在微信群中说过，我买了。这时钱诚儒也在这个群中了，可能他也买了不少，但是当他看到尾盘有人动用50万股砸低一毛钱时，说了句怪话，“这个股不会是我们再买，别人在出货吧？”我有点不高兴的回了一句，“有人砸盘是好事，这正说明有人活动，也正是我买它的主要原因之一。”\n\n在梅花科技停牌期间，我又做了一只股科兴集团。\n\n梅花科技复牌前的一天正好有一场股市沙龙，我告诉大家，尽管大盘下周初可能会调整，梅花科技最少也会有五个半涨停，如果第一个涨停打开，大家拿住了，千万别卖，还会涨的，这个价格距离大庄家的解套位置还远，胆子小的，干脆别看盘，等三天后再看。\n\n梅花科技复牌的复牌第一天，毫无意外的无量一字板，且开盘封板的是80万手 （8000万股），按封板价格6.11元计算，封板资金在5亿元（当时公司总市值也 有190亿，大股东占比27%，再除去别的股东质押的筹码和明显不能卖的筹码，真正流通的也就最多100亿市值）。当时心想这回发财了，真的要五个半涨停。\n\n第二天上午，我因为感冒起晚了，开车上班的路上股市已经开盘了，我放心不下梅花科技，一边在高速上开车，一边用手机看梅花科技的走势。\n\n风云突变，第二天大盘上午大跌，梅花科技涨停板开盘后随即被巨额抛盘砸开，这时我正在上班的高速路上，为了防止万一，我已经特地在手机上设置好了一键清仓。看到梅花科技涨停被打开，于是赶紧把车停在紧急带上，用手机把我控制的几个账户中梅花科技清仓卖掉了。可是刚卖掉之后，他又封板了，而且封板的资金30万手，按股价计算还有20亿元。真是后悔不已，如果不是事先设置好一键清仓，正常的情况下，想卖也卖不掉的，因为时间来不及，涨停又封死了。\n\n到了店里，同事都说，“吉淼，你真是神了，如果不是你告诉过我们，刚才我们就会被真出去的，庄家真坏，幸亏我们有料事如神的诸葛亮。”\n\n听见手机滴滴，我一看，许曦的微信，“哈哈，股神，我爱你！”\n\n后来，梅花科技那轮从5元多最高涨到了15元 翻了三倍，同事们都大赚了一把，至今许多人还记得这只股，但是我自己只赚了一个半涨停。\n\n"
		},
		{
			"post_id": 219,
			"title": "适逢南海仲裁即结果即将公布之际，大盘借此来扬我国威，可歌可泣。菲律宾提起南海仲裁，其目的在于巧取中华之海域领土。更深层次的原因，还是为了配合美国人抑制中国发展之策略。所以无论结果如何，都应当是我们坚决反对的。当今的中国，已不再是那个任人宰割的懦弱之夫，为了国家和人民的利益，中华民族仍然会发出最强劲的回击：犯强汉者，虽远必诛！\n",
			"date_published": 1468312026.37,
			"body": "http://blog.sina.com.cn/s/blog_4c7a5b270102yzlu.html?tj=1"
		},
		{
			"post_id": 218,
			"title": "有人就有事；由国家就有战争",
			"date_published": 1468310185.601,
			"body": " with people there are issues; with nations there are wars."
		},
		{
			"post_id": 217,
			"title": "data tells",
			"date_published": 1468285495.402,
			"body": "世界目前的许多宏观经济图形和一战前是相似的，不管是GDP增长，资产增长和工资的增长，失业率的状况。其核心是资产增长远超过了工资增长的速度，贫富差距越来越大；同时在高等教育和医疗系统上的成本远超过了一战前，这样的贫富差距和社会鸿沟的糟糕程度甚至远远超过了一战前."
		},
		{
			"post_id": 216,
			"title": "2008雷曼危机或重演 德银已经在将死之路上",
			"date_published": 1468283544.632,
			"body": "2015年10月29日，德意志银行在因为操控Libor利率被罚25亿美元之后宣布大规模重组计划。\n\n　　2015年11月5日，因为与美国制裁国家进行交易，德意志被罚2.57亿美元。\n\n　　2016年1月28日，德意志银行公布2015年公司亏损达到创纪录的68亿欧元.\n\n　　2016年2月8日，德意志银行新上任的联席首席执行官John Cryan向员工表示，公司状况非常稳定。\n\n　　2016年3月11日，德意志银行公布公司衍生品业务规模达到520亿美元。\n\n　　2016年5月16日，贝伦堡银行表示德意志银行的杠杆已经超过40倍，警告德意志银行的问题将是难以解决的。\n\n　　2016年6月2日：两名德意志银行前雇员因为操控Libor利率被美国监管机构提起诉讼。与此同时，英国监管机构表示至少29名德意志银行雇员牵涉操控Libor丑闻中。\n\n　　与此同时，德意志银行宣布裁员9000人，占到总员工数的9%，裁掉6000外部顾问并在10个国家停止业务。\n\n\n　　末日的开始\n\n　　雷曼倒闭曾经让世界震惊，点燃了2008年金融危机火线。德银或将成为下一个雷曼，如果说雷曼兄弟和贝尔斯登的死亡是快速且没有痛苦的话，那么德意志银行的死亡将会是漫长且痛苦的。\n\n　　过去与高盛，摩根大通，美国银行和花旗集团相比，德意志银行的投行部门是全球最大的投行部之一。但是与其他几家不同，德意志银行并没有从金融危机中完全复苏过来，公司一直存在着问题。\n\n　　讽刺的是，公司时任首席执行官Josef Ackermann居然大胆的宣称德意志银行拥有充足的资本，并且比别的竞争对手恢复的更好。\n\n　　但是最后发现，德意志银行为了避免政府的救助而瞒报了120亿美元的损失。与此同时，德意志银行在动荡时期赚得的大量利润都是通过操控Libor利率所得。这些“所得”最终都没成为利润，因为德意志银行最后因为操控Libor而被处以创纪录的25亿美元的罚款。\n\n　　德意志银行最后不得不承认公司实际需要更多的资金。\n\n　　2013年，德意志银行融资30亿欧元，并宣称不再需要额外的资金注入。但是之后，德意志银行在2014年先后再次融资15亿欧元和80亿欧元。近年中，德意志银行不断在对公司进行调整。\n\n　　金融危机后，德意志银行经历了多位首席执行官，公司在2015年10月宣布了新任联席首席执行官John Cryan的任命，并在公司内部经历了大规模的人员变动。目前，德意志银行正在进行裁员9000人和在10个国家终止业务的计划。这就是德意志银行近期灾难的开始，特别是在过去6个月中，情况正在快速恶化。\n\n　　德意志银行在今年年初宣布公司2015年的亏损达到创纪录的68亿美元。\n\n　　Cryan上任后开始大肆的公关运作，他宣称公司的情况非常“稳定”。德国财政部长沃尔夫冈-朔伊布勒也曾表示他不担心德意志银行的状况。这一切都说明：事情已经到了全面危机的地步。\n\n　　在未来的几周中发生了以下的事情：\n\n　　2016年5月16日：贝伦堡银行表示德意志银行的杠杆已经超过40倍，警告德意志银行的问题将是难以解决的。\n\n　　2016年6月23日：英国退出欧盟的公投结果重创德意志银行。德意志银行为在英国最大的欧洲银行，其19%的营收来自于英国。\n\n　　2016年6月29日：国际货币基金组织表示“德意志银行是全球金融系统中最大的系统性风险。”\n\n　　2016年6月30日：因为糟糕的风险管理和财务规划，德意志银行没有通过美联储的压力测试。\n\n　　这些事件听上去是不是“非常具有说服力”?\n\n　　现在摆在面前的问题：如果德意志银行破产，那么德意志银行价值520亿欧元的衍生品交易会带来什么样的问题和影响? "
		},
		{
			"post_id": 215,
			"title": "the drama of july 12",
			"date_published": 1468229717.535,
			"body": "full of expectation of many kinds, july 12 is a day to test your ability for strategy."
		},
		{
			"post_id": 212,
			"title": "monday, market is calm",
			"date_published": 1468203522.515,
			"body": "market goes up, not nervous at all. guys, if market is right (and it is always right), nothing is going to happen, go sleep."
		},
		{
			"post_id": 211,
			"title": "history is wise",
			"date_published": 1468198417.526,
			"body": "history i think has again and again shows his wisdom in making himself. xi i think is the right one for this ten years, and history probably will show us soon his anti-graft movement is only one small part of his contribution comparing to what is coming."
		},
		{
			"post_id": 210,
			"title": "People's daily has conducted a survey",
			"date_published": 1468198306.218,
			"body": "one question of the survey is - \n\nif war is coming, are you affraid or not?"
		},
		{
			"post_id": 209,
			"title": "Mao impression",
			"date_published": 1468197786.408,
			"body": "i clearly remember the day when he was announced dead, and i was in the classroom, and a few female things cried in a way that i can not tell real or not. i was only become very awared again when so many years later or just a few years ago, my very young gf who grew up in shangdong province a midium sized town that is famed for its chicken refers him as grandpa mao. that moment i realized how misallocated my mental judgment about this is. mao is mao."
		},
		{
			"post_id": 208,
			"title": "毛泽东讲，一切帝国主义都是纸老虎",
			"date_published": 1468197383.613,
			"body": "i will translate this sentence word by word - \n\nmao said, all imperialists are paper tigers.\n\nin all aspects, mao remains to be the most influencial, and most believed one among many, in china."
		},
		{
			"post_id": 207,
			"title": "the pro and con of competition",
			"date_published": 1468150493.633,
			"body": "two pros:\n\n- ir may enhance the overall human efficiencies;\n- it is one way to strengthen the human mind and body;\n\ntwo cons:\n\n- one winner, but many losers;\n- it induces race of all kinds, such as arm race, race to wealth, race to great sicentific discoveres and truth, and may well include the race to the human final destination, which may or may not be a simple triumph;\n"
		},
		{
			"post_id": 206,
			"title": "why i do not care about sport?",
			"date_published": 1468147711.248,
			"body": "well, i try to avoid use hate or do not like and so on, for man i have general respect. probably most men love sport. that i understand.\n\nbut what is sport? \n\nthe essence of sport is competition. a game is invented out of nothing or something, a rule set, then compete, winner wins out, and people cheers. i guess it is also a way of life. for most people, what else to do?\n\ni guess i am too busy for that, for example i would rather spend time writing something here, and that is my sport.\n\nthe truth is, i do not think competition is a good thing, the game to compete just to win. it is a spirit, but not mine. \n\nrather, i would much prefer things non-competitive in nature, for example, just learn, and do things, for no particular reason or result. to me, that is the best way to grow true wisdom. as chinese says, the big game is won not in the field, but in thousand miles away --- 运筹帷幄于千里之外。"
		},
		{
			"post_id": 205,
			"title": "on july 11th",
			"date_published": 1468128677.441,
			"body": "- 472 – After being besieged in Rome by his own generals, Western Roman Emperor Anthemius is captured in St. Peter's Basilica and put to death.\n- 1405 – Ming admiral Zheng He sets sail to explore the world for the first time.\n- 1789 – Jacques Necker is dismissed as France's Finance Minister sparking the Storming of the Bastille."
		},
		{
			"post_id": 204,
			"title": "more background info - South China Sea arbitration abuses international law, threatens world order",
			"date_published": 1468127538.807,
			"body": "http://www.chinadaily.com.cn/world/2016-06/29/content_25902989.htm"
		},
		{
			"post_id": 203,
			"title": "potential US China degree of conflict in the region",
			"date_published": 1468127131.969,
			"body": "some form of conflict is for sure, but at what level?\n\nhere are the likely scenarios - \n\n- serious conflic: it seems this is not possible \n- some show business: this is highly likely\n\nbased on the stock market reactions, it has assumed it will be a show business.\n\nif it is indeed a show business, then it proves one theme, which there is no need to elaborate further here, and the future is clear. let's wait till july 12th."
		},
		{
			"post_id": 202,
			"title": "South China Sea (SCS) arbitration - some background",
			"date_published": 1468126904.313,
			"body": "GRONINGEN, The Netherlands, June 14 (Xinhua) -- The arbitral tribunal in the Philippines' South China Sea (SCS) arbitration exceeded its competence by circumventing the real disputes and by degrading the role of States, such arbitral expansion is detrimental to the settlement of disputes, said Haibo Gou, legal advisor and counsellor at the Chinese embassy in the Netherlands.\n\nThe Philippines, which illegally occupied some of China's islands and reefs in the SCS in the 1970s, unilaterally filed the arbitration in 2013.\n\nThe Philippines raised 15 submissions, on China's U shaped line, on the entitlements of several maritime features, and on the legality of China's activities in the SCS.\n\nThe Philippines asserted that these submissions are irrelevant to the territorial and delimitation disputes. And the arbitral tribunal endorsed such assertion with a ruling in October 2015.\n\nUsing a graph indicating the relationship between relevant dispute settlement process and the Philippines' submissions, Gou remarked that the settlement of territorial and delimitation disputes is an integral process.\n\n\"Territorial dispute needs to be addressed first, to be followed by the settlement of delimitation dispute. Only with the territory and delimitation disputes settled, could the question of legality of activities in disputed area be answered. The Philippines' submissions are either part of or dependent on the territorial and delimitation disputes,\"he said at a lecture at Groningen University on Monday.\n\n\"Entitlements of maritime features are granted to coastal States. With the territory dispute in the SCS pending, who is the coastal State cannot be answered, the issues of entitlements cannot be addressed. Further, according to established jurisprudence, determinations on entitlements are the first step of any delimitation. Thus the submissions on entitlements are subsequent to the settlement of territorial dispute, and are part of delimitation,\" he explained.\n\n\"Territorial disputes are not the subject matter of the United Nations Convention on the Law of the Sea (UNCLOS), and China has declared under the Convention that it does not accept compulsory procedures with respect to disputes concerning delimitation. There is no compulsory jurisdiction over disputes in the SCS,\" the Chinese diplomat told scholars and students attending the lecture in the north of the Netherlands.\n\nIn his opinion, the arbitral tribunal exceeded its power because firstly, compulsory arbitration is \"subject to\" China's declaration made under the UNCLOS.\n\n\"With China's declaration, the establishment and functioning of the arbitral tribunal has no legal basis,\" he said.\n\n\"The tribunal has further exceeded the limits of arbitral power when it failed to fulfill the duty of isolating real disputes,\" he added.\n\nThe diplomat noted that States shall be alert about the ad hoc organ's performance, which is a typical example of arbitral expansion.\n\n\"According to the Convention, States have the right to exclude compulsory procedures with respect to delimitation disputes,\" he said.\n\n\"The five arbitrators understand delimitation in a very narrow way, thus restraint such right of States. Also, the tribunal restrictively interprets the agreement between China and the Philippines to exclude UNCLOS procedures, and degrades the role of negotiation and exchange of views. By degrading the right and role of States, the tribunal acts beyond its mandate,\" he said.\n\n\"The arbitral expansion cannot help settle the real disputes because an ultra vires award is null and void. What's worse, the arbitration is inconsistent with procedural justice,\" he said.\n\n\"We should never forget that States play a primary role in international justice and relevant judicial or arbitral organs are based on State consent as reflected in the UNCLOS. When an arbitration exceeds State consent, it breaks the balance inherent in the Convention,\" he stressed.\n\nTo avoid the harms of judicial/arbitral expansion, Gou suggested that States shall rebuild trust toward good faith negotiation, and provide necessary procedural guidance to judicial and arbitral organs, and the latter shall be self-restraint in keep the limits of State consent.\n\nCiting the \"Judgment of Solomon\" story, the Chinese diplomat emphasized that more wisdom is needed to safeguard the balance and integrity of the UNCLOS.\n\n\"When King Solomon ordered to split a baby and give each claiming 'mother' a half, we realize that the real mother will not let her baby hurt. Similarly, real owner of maritime features will not attempt to reduce the capacity of its features. With the arbitration, the Philippines endeavors to reduce the capacity of maritime features in the South China Sea, which tells that it is not the owner of these features,\" he explained.\n\nIn addition, \"in the Solomon Judgement story, the false mother insisted on proceedings to divide the baby. Thus we know that the party insisting on proceedings may not always be the one with truth. Therefore, we should refrain from an easy conclusion that he who undertakes an arbitration is always the one who is right.\"\n\nChina has said repeatedly that the right path forward regarding the disputes in the SCS is consultations and negotiations between directly concerned parties. \n"
		},
		{
			"post_id": 201,
			"title": "只想对.com说：草泥马",
			"date_published": 1467977473.914,
			"body": "Blog post body"
		},
		{
			"post_id": 200,
			"title": "对于大多数企业来说，.com已经没有意义。",
			"date_published": 1467966979.262,
			"body": "Blog post body"
		},
		{
			"post_id": 199,
			"title": "不错的一招",
			"date_published": 1467892895.825,
			"body": "有一天，一位其貌不扬的男士，身边带着一位漂亮的小姐，来到一家爱马仕店，他为小姐选了一款价值56万的全球限量包。付款时，男士掏出支票本，十分潇洒地签了一张支票，店员有些为难。\n\n男士看穿了店员的心思，十分冷静地对店员说:我感觉到，你们是担心这是一张空头支票，对吗？今天是周六，银行关门。\n\n我建议您把支票和包都留下。等到下周一支票兑现之后，再请你们把包送到这位小姐的家里，这是她家的地址。您看这样行不行？\n\n店员放下心来，欣然地接受了这个建议，并且大方的承诺，送包的费用由该店承担，他本人将亲自把这件事情给办妥。 \n\n星期一，店员拿着支票去银行入账，支票果真是张空头支票！愤怒的店员打电话给那位男士，男士对她说:“这没有什么要紧啊！你和我都没有损失。\n\n\n\n\n上星期六的晚上我已搞定那女孩！哦，多谢您的合作。\n"
		},
		{
			"post_id": 198,
			"title": "守住！守住！",
			"date_published": 1467794670.751,
			"body": "股市大涨是收复南沙岛礁第一枪;\n因此你就明白为甚么股市大涨；\n7月12日种菜；股市3000高枕无忧。"
		},
		{
			"post_id": 197,
			"title": "千万不要看得太远！",
			"date_published": 1467794150.703,
			"body": "到处都发大水，回避三五米之内的风险很容易，如果你认为三十米内都畅通无阻，第一个掉井下的就是你！"
		},
		{
			"post_id": 196,
			"title": "房地产税法最快2017年通过: 百万房产或每年缴税5000元 ",
			"date_published": 1467792804.745,
			"body": "我等傻逼要好好杂么杂么\n好在围棋还远"
		},
		{
			"post_id": 195,
			"title": "意大利也要举行全民公投",
			"date_published": 1467792568.334,
			"body": "意大利也要举行全民公投，银行业危机一触即发...\n\n意大利银行贷款坏账率高达17%，几乎为美国的10倍，而后者即便在金融危机时期的坏账率也仅为5%。在欧元区的上市银行中，意大利创造的坏账占一半。\n\n意大利Monte dei Paschi银行周一称，欧洲央行发函要求该行遵守银行业不良贷款规定，在3年内将不良贷款水平降至20%；并表示将在7月8日提交计划。\n\nMonte dei Paschi银行股价跌幅扩大至逾9%，刷新历史新低，随后暂停交易。该银行股价今年已累计下跌70%。\n"
		},
		{
			"post_id": 194,
			"title": "股市投资经典案例",
			"date_published": 1467680235.501,
			"body": "奥普集团（00477.HK），企业位于杭州，生产很多人家里卫生间都会用的浴霸，股本7亿。我当时是6元买的，股价在2008年金融风波中，价格下跌到0.4元。最后也没有什么信心，一直跌也不知道要跌到哪里去。这家公司当时没有负债，现金有3亿人民币，厂房在12万平方米，每年赚7千万，这样便宜的公司，在A股无法想象。我当时甚至渴望将整个公司收购下来，只要2.8亿港元，拿回现金就有3亿，这样的买卖哪里去找？即使公司没有成长，也没有关系。公司的产品是浴室里的浴霸，相信很多人用过，他是第一家做取暖灯泡的，当时还算是高科技，市场占有率比较高。这家公司在杭州，去调查非常方便。主要调查的内容：一是账上现金是不是真实，可以通过银行等关系去打听落实；二是这家公司的派息状况；三是通过询问企业运行情况，比如对供应商的付款 ，对建筑公司的付款，可以查看有没有官司来印证。另一个要考虑的问题是他们产品非常单一，看这个产品会不会被替代。因为我是建筑设计人员，对这个行业有一定的了解。我个人认为，到当时为止，只有地热这个产品对它有影响。如果用了地热就不用浴霸了。但是地热的运行很贵，而且去了一些人家，装了地热的，也照样装浴霸。原因是刚开始冷的时候，不开地热，开浴霸。买入这只股票后，2年后股价涨到2元，因为房地产开始打压，公司业务成长性不强，就卖出了。持股时间大约2年多，涨幅大约4倍。买入这个股票的另外好处是调研的时候认识了几个董秘，她介绍了2个在0.4元买入奥普股票，做的比较好的朋友，到现在还在联系，这是人生的另外一笔收获。其中一个用了五年时间从50万做到了几亿，另一个大概用400万赚了1600万。"
		},
		{
			"post_id": 193,
			"title": "很多人不理解为什么中国人和女人性交次数少",
			"date_published": 1467632608.107,
			"body": "看我下面的帖子你就明白了：因为我们要操的对象太多。"
		},
		{
			"post_id": 192,
			"title": "调查：每天你想说几次草泥马？ ",
			"date_published": 1467632197.679,
			"body": "- 你拉完屎虫不下去，你想不想跟马桶说草泥马？\n- 你裤子鸡巴拉链拉不上，你想不想对裤子说草泥马？\n- 你下楼上楼电梯又坏了，你想不想对电梯说草泥马？\n- 你做饭煤气炉点不起来，你想不想对生产煤气炉的傻逼说草泥马？\n- 你送孩子停车多停5分钟吃200罚单，你想不想对谁说草泥马？"
		},
		{
			"post_id": 191,
			"title": "需要进一步了解歌德学院",
			"date_published": 1467630778.773,
			"body": "你看歌德学院在中国推广德国形象的时候，它用的是歌德一个什么形象？手里拿一个手机，而且还是智能手机，膝盖上放了一个笔记本电脑，然后旁边是一些经典古籍。这么一个歌德，就是一个数码化的歌德，这是一个与时俱进的形象语言。\n\n歌德学院如何宣传德国文化，值得研究。"
		},
		{
			"post_id": 190,
			"title": "“英国脱欧”咋成日本经济最糟糕噩梦",
			"date_published": 1467629234.231,
			"body": "24日英国脱离欧盟的消息传来之后，日元汇率一度涨至1美元兑99日元左右，达2013年11月以来新高。同一天，日经指数暴跌近8%，下跌1266点，创近16年来最大跌幅。\n\n现在市场普遍认为，英国公投选择脱欧，进一步促使日元作为全球市场动荡时期普遍买入的避险货币，其价格也创下了近年来的新高，这使得安倍政府试图通过本国货币贬值来提振日本经济的希望成为泡影。于是日本官员们担心，日元的持续升值会给该国经济造成不利影响。\n\n自英国脱欧之后，英镑、欧元都蒙受冲击，那么日元为啥反而成为国际避险货币呢？笔者归纳为三点原因：其一，日元属于低息货币，在经济危机时，别国货币可能降息，但日元因为长期低利率没有多少下降空间，所以日元不太可能降息，日元的风险也就相对较小。\n\n其二，低利率也使得日元成为全球融资成本最低的货币，加之日元可以自由兑换，因此国外投资者可以较易获得大笔日元并兑换成他国货币。日本作为世界第三大经济体，其雄厚的经济实力为日元币值的稳定提供了基础，且日本还拥有仅次于中国的外汇储备。\n\n实际上，日本经济在过去的10年里，有5年处于衰退中，日本经济始终无法走出通缩阴霾。而在安倍上台后，在货币政策上采取了“竞争性贬值”的策略，使日元进入贬值通道。\n\n但此举对提振日本经济的真正效果如何，却频遭外界诟病。今年一季度日本经济增长率达到0.5%，显得“较为强劲”，并给了日本政府信心。不过，由于英国脱欧，日元持续升值，却给日本经济的复苏增加了更多的“不确定性”。\n\n首先，日元升值让日本产品出口、以美元为基准结算的海外日资企业愁眉不展。据日兴证券专家测算，日元汇率每升高1日元，在东京证券交易所上市的1800家企业经常利润就损失0.8%。按照今年以来已升值12日元的情况看，相当于这些企业的5万亿日元利润泡汤，对日本经济的冲击可想而知。\n\n日元飙升不仅与安倍经济学背道而驰，日本国内制造业、养老金投资等诸多方面都受到很大冲击。美国《华盛顿邮报》曾分析称，如果1美元兑换约100日元的汇率继续下去，日本国内制造业的税前利润将减少超过2万亿日元（约合人民币1300亿元）。\n\n再者，英国脱欧，会使日企进入欧洲市场的难度、成本大幅上升。截至2015年10月，在英国的日企高达875家，而这些企业几乎都负责统筹在欧洲的业务。在英国的日企大多把英国作为进出欧洲的据点，脱欧后，关税成本增加，对日企将产生巨大的负面影响。\n\n另据测算，日本车企中尤以三菱汽车和马自达受到的冲击最大，这两家公司在英国和其他欧洲市场都有深耕，受欧洲货币变动影响最大。”\n\n再者，英国脱欧，日元升值，对去日本旅游购物产生巨大影响。日本政府观光局的数据调查显示，截至2016年5月，中国游客赴日旅游仍然呈现明显的增长趋势，仅五个月就已经达到249.4万人次，增长率为45.3%，占据外国人赴日旅游总数的约四分之一。但是因为英国脱欧造成的汇率震动依然十分明显，必会对于日本旅游造成影响。\n\n笔者认为，日元的汇率波动对于旅行社来说不会有太大影响，旅行社的团队价格由市场决定，汇率只是一个很小的部分。但是对于那些赴日旅游主要是为了购物爆买的群体来说，日元升值意味着日本商品比原来贵了许多。如果日元汇率一直居高不下，会削弱全球赴日旅游群体的购买力和积极性。而现如今，日本经济在很大程度上依赖旅游消费来支撑。\n\n"
		},
		{
			"post_id": 189,
			"title": "ghost",
			"date_published": 1467541775.767,
			"body": "for anyone interested in ghost study, i suggest he come here: here you live with ghost day by day. here is a starter.\n\nhttp://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u/?Post:61\n\n"
		},
		{
			"post_id": 188,
			"title": "when man thinks about woman",
			"date_published": 1467539576.468,
			"body": "man thinks about woman only when he is in control of his life, his business, his family, things that are important to him. if he does not think about woman, something bothers him."
		},
		{
			"post_id": 187,
			"title": "理论决定实际",
			"date_published": 1467539473.535,
			"body": "这在所有领域都成立。\n举例：\nhttp://127.0.0.1:43110/1KtnLQynesLHw4QSc3kujrg5F67L2EH9Qh/"
		},
		{
			"post_id": 186,
			"title": "women will have more sex with robots than men by 2025 in 'robophilia' revolution ",
			"date_published": 1467475144.3,
			"body": "someone made this prediction. \n\nif 10% of the women have robo-mate, then here is how big the pie is -\n\n100 millions women x $10,000 = $1 trillion"
		},
		{
			"post_id": 185,
			"title": "how we want to live?",
			"date_published": 1467474063.34,
			"body": "- more qualified mother and father that are now lacking in at least half of the families based on my observation;\n- smart buddy: learning KI system that gives prioritized suggestions for action and enables the initiation of contacts according to individual interests and demands;\n- financial freedom for all: the society can potentially work based on purely volunteers;"
		},
		{
			"post_id": 183,
			"title": "1,000 People Working in Space by 2045 ",
			"date_published": 1467462534.324,
			"body": "interesting proposition. what would they be working on?"
		},
		{
			"post_id": 182,
			"title": "Disrupting Internet Access Is A Human Rights Violation, UN Says",
			"date_published": 1467459504.586,
			"body": "for how long the voice of un is unheard, ignored, useless? and who cares to make it more meaningful and accountable?"
		},
		{
			"post_id": 181,
			"title": "炒作的多种方法和逻辑 1 ",
			"date_published": 1467377181.258,
			"body": "题材是第一生产力，有机构看好是硬道理；\n\n新仓持股逻辑：此前空仓了一段时间，根据银行的资金松紧情况，每年的6月中下旬防范风险，6月底7月初适当操作，是我的一个操盘习惯，本周看到市场顶住英国脱欧、人民币贬值的压力依然表现稳健，就在今天选择了试探性的操作（this is the judgment about the overall market），买的下半年的第一只股是明星电力。这个股是我上周末为近期操作选股时注意到的，我选股翻到明星电力的时候，发现它历史上在目前的股价附近出现过两次较大幅的拉升，一次是2015年12月16日，以11.98元开盘，冲上涨停，后面再度有2个半的涨停，另一次是2015年11月13日以12.08元开盘，封死涨停，第二天又涨8个百分点(here he is looking for perfect timing)，经过分析发现，这两次涨升都与钒电池概念有关，其中12月下旬的这次炒作，不久就遇上股灾3.0，存在着机构被套的可能。今年上半年市场走势最强的板块当属锂电池板块和次新股板块，锂电池板块走强的逻辑是新能源汽车是强势行业(key)，次新股板块强的逻辑是流通市值小，如果大盘不出现意外的强势，我感觉下半年强势个股依然会在具有小市值强势行业的股票群体中出现，依照这个标准我发现明星电力符合逻辑，它具有钒电池概念，接近于上半年的锂电池概念，有号召力，目前它的流通市值不到40亿，属于基本面还可以的低价股，也是游资机构喜欢的股票类型(good target for spculative trading and short term gain)。我选股的理念是，题材是第一生产力，有机构看好是硬道理，进一步研究它的题材和持股机构，我又发现了新的注意点，一是，《四川国企改革方案》、《四川国企改革方案名单时间表》已出台，里面提到：支持产业相近、行业相关、主业相同的国有企业通过合并、划转、并购等多种方式进行重组。四川电力公司旗下的上市公司可能保留一个电力资产平台，其它的上市公司可能以市场化的运作等方式退出。东北证券的近年研究报告中也提到，“明星电力可能会以市场化运作等方式进行重大重组，改革预期看好”（可百度全文），我今年曾经关注过的另一个四川省电力公司旗下的股票岷江水电在股灾3.0后走势强劲，已经收复了股灾3.0的失地，这让我对于明星电力的下半年表现有所期待。二是，明星电力去年9月17日公告，截至2015年9月17日，前海人寿通过上海证券交易所集中交易方式，增持公司股份总数16259527股，买入均价9.9至12.25元/股，占公司股份总数的5.02%，首次超过公司总股本的5%。本次权益变动前，前海人寿未持有公司股份，前海人寿表示，本次权益变动是因为对上市公司未来发展前景的看好，不排除未来12个月内进一步增持上市公司股份的可能性。前海人寿是近期市场新闻热点“万科股权”争斗的机构之一，万科据复牌的时间应该会不远了，其同主力机构持股会不会在这时间前后活跃造势？研究明星电力的K线图会发现，该股股价此前的波动规律是每隔一段时间就异动一下(trading timing)。三、7月份进入中报公布期，明星电力的每股资本公积金14251元，每股未分配利润3.1551元，每股净资产5.9514元，有扩张股本的条件。基于此，题材、主力、概念、股性都符合我个人的偏好，就在周五下午买进了该股."
		},
		{
			"post_id": 180,
			"title": "股市是他妈个什么东西？",
			"date_published": 1467369883.948,
			"body": "- 股市不是投资；\n- 股市不是投机；\n- 要想赢，就一定不能怕输。不怕输，结果未必能赢。但是怕输，结果则一定是输；"
		},
		{
			"post_id": 179,
			"title": "why chinese stock small investors are commonly called chinese chive 韭菜?",
			"date_published": 1467293711.354,
			"body": "here is the story:\n\nhttp://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u/?Post:58"
		},
		{
			"post_id": 178,
			"title": "社会目前状态",
			"date_published": 1467288348.985,
			"body": "免谈。"
		},
		{
			"post_id": 177,
			"title": "股市目前状态",
			"date_published": 1467284985.788,
			"body": "- 中国大妈们担心股市有风险，我明确告诉你们，不入股市存银行，你们的钱损失的更多更快，尤其在目前股市相对低估的时期！\n- 盘中多头多次护盘，拉抬权重股，但是，跟风盘稀少；\n- 连续上涨三天后，周四仅微调，说明投资者对当前行情已经盲目，涨不冲动，跌不恐惧，其实质是一年熊市后，投资者已经心死，对股市涨跌任由它去了；\n- 从6月两次大跌，接着都迅速收复失地来看，A股抗跌能力已经非常强，底部特征已经出现，只是，这个底是个长期的箱型底；\n- 总理讲话内容中提到的，要防止井喷也要防止断崖，这说明，指数牛市目前是不可能的；\n- 大盘技术上还需要补掉缺口2913-2915，并需要回抽确认2880的突破是否有效，这个回抽也就是在近几天内发生，时间不长空间不大，之后大盘将突破2950，高点可看3100；\n- 大盘调整后震荡上行，7月将突破3000点，将摸高3100；"
		},
		{
			"post_id": 176,
			"title": "26年的中国股市，你见过新股连续几十个涨停的底部吗?",
			"date_published": 1467252130.966,
			"body": "one sentence tells you the truth about the stock market today."
		},
		{
			"post_id": 175,
			"title": "吃饭行情，谁吃谁",
			"date_published": 1467251464.29,
			"body": "here are some good chinese in real life and real market today, not things like those gorki type dry allusions jammed into poor students' mind and mouth. i was always wondering those words picken for the elementary and middle school textbooks, and why they have always funny and fony effects and nothing else. gorki's sea swallow, still remember it today, hehe.\n\n热衷于吃饭行情的人，睁开眼睛看看被恶炒的那些股都是什么东西。创业板的总体估值已经80倍估值了，再涨一点又到100倍的市盈率了。不错，那些被套的机构想办法内外勾结，制造概念，无非就是想出货，现在割韭菜也不容易，必先教育韭菜-----这是吃饭行情啊，而且主食是韭菜饺子，主菜是炒韭菜，配菜是韭菜沙拉，甜点是韭菜花酱。"
		},
		{
			"post_id": 174,
			"title": "bitcoin as a political-economical indicator",
			"date_published": 1467210982.288,
			"body": "bitcoin might well be a better indicator than other surveys.\n\nNew data from Coinbase, which offers the leading bitcoin wallet and a popular bitcoin exchange, proves that the prospect of Brexit had an impact on bitcoin even before the referendum vote. \n\nIn the week leading up to the vote (June 13-20), Coinbase saw a 55% increase in new account sign-ups from Great Britain, and a 350% increase in bitcoin purchases from UK customers. \n\nOn the day of the Brexit vote, Coinbase saw an 86% increase in Great Britain signups.\n\n\nIt's one of the largest spikes in activity Coinbase has ever seen from one region in one week.\n\nThe British bitcoin bump is a reminder, a Coinbase spokesperson says, that bitcoin \"has long been a hedge against turmoil in Greece, capital controls in China, and macro-economic issues.\" Indeed, many compare the coin to gold as an investment vehicle. The current market cap of all bitcoins is $10.1 billion.\n"
		},
		{
			"post_id": 173,
			"title": "股市经典战例： 一根长阳 vs 三根小阳",
			"date_published": 1467210029.73,
			"body": "- 一根长阳：5月30号\n- 三条小阳：6月27，28，29\n- 比较他们对市场的效果，截然不同"
		},
		{
			"post_id": 172,
			"title": "英国脱欧的风险仍然没有释放完成，新的黑天鹅随时会飞出来.",
			"date_published": 1467208541.308,
			"body": "game over? no."
		},
		{
			"post_id": 171,
			"title": "Millions of Americans who went to college are now crippled by their student loans.",
			"date_published": 1467207773.374,
			"body": "should college education be free for all?"
		},
		{
			"post_id": 170,
			"title": "普京对卡梅伦的评价，说他是个“肤浅轻浮的领导者”。这非常准确，卡梅伦让世界想起当年的戈尔巴乔夫.",
			"date_published": 1467113138.949,
			"body": "agree or disagree?"
		},
		{
			"post_id": 169,
			"title": "combined .com .bit architecture for small businesses",
			"date_published": 1467112590.496,
			"body": "assuming you are running a few business related websites x.com, y.com, z.com; consider change the architecture into the following - \n\n- maintain only one .com site, for example xyz.com; using the simplest and most reliable front end, for example only simple html static pages; \n- build x.bit, y.bit, z.bit - these are free and more reliable than .com online server things; generally even till today, .com is just not stable, not reliable;\n- prompt users to your xyz.com to download zeronet and visit .bit sites; \n- eventually drop the .com completely;"
		},
		{
			"post_id": 168,
			"title": ".com",
			"date_published": 1467102962.467,
			"body": ".com model has a very questionable value for most small businesses now. their .com presence seems serving a symbolic purpose only, and it is a cost center, the incremental sales generated for most small businesses are always smaller than the incurred cost. it is only a matter of time now for us small businesses to switch to a zero-cost model such as zeronet. \n\nif you run small businesses i would very much interested in learning how you think about .com and alternative models.  "
		},
		{
			"post_id": 167,
			"title": "人民币贬值对人民币国际化不是好消息，人们不会持有一个有贬值预期的货币，也不会长期使用",
			"date_published": 1467075298.847,
			"body": "在目前的情势之下，很显然，央行已经把人民币国际化放在一边，主要是要稳定人民币汇率预期。"
		},
		{
			"post_id": 166,
			"title": "post eu scenario one - PG",
			"date_published": 1467074085.08,
			"body": "the pan germany scenario - \n\n- germany\n- austria\n- bulgaria\n- croatia\n- cyprus\n- czech\n- denmark\n- estonia\n- finland\n- greece \n- hungary \n- ireland \n- latvia \n- lithuania \n- malta\n- poland\n- romania \n- slovakia\n- slovenia"
		},
		{
			"post_id": 165,
			"title": "法国明年将举行总统大选，高举脱欧大旗的国家阵线党魁勒彭（Marine Le Pen）遥遥领先",
			"date_published": 1467074031.495,
			"body": "first let's be clear, marine is a woman, not the marine the army, but marine who is shaping france and europe. \n\nand this serves as the start for the study of this influencial figure.\nhttps://en.wikipedia.org/wiki/Marine_Le_Pen\n\nThe president of the National Front (FN), a national-conservative political party in France and one of the main political forces. A lawyer by profession, she is the youngest daughter of longtime FN leader Jean-Marie Le Pen. She is the aunt of Marion Maréchal-Le Pen. (so politics can be a family business too)\n\nLe Pen joined the National Front in 1986 and has been elected as a regional councillor (1998–present), a Member of European Parliament (2004–present) and a municipal councillor in Hénin-Beaumont (2008-2011). She was a candidate for the leadership of the FN in 2011 and won with 67.65% (11,546 votes) of the vote, defeating her opponent Bruno Gollnisch and succeeding her father Jean-Marie Le Pen, president of the party for nearly forty years.[2][3][4][5] She then became the second president of the party.[6][7][8]\n\nThe next year, she placed third in the presidential election with 17.90% of the vote, behind François Hollande and Nicolas Sarkozy.[9][10][11][12] She later failed to get elected deputy in 2012 and president of the Nord-Pas-de-Calais-Picardy regional council in 2015.[13]\n\nDescribed as far more democratic and republican than her nationalist father, she has led a movement of \"de-demonization of the Front National\" to detoxify it and soften its image, based on renovated positions and renewed teams, also expelling controversial members accused of racism, antisemitism, neo-Nazism or pétainism. An important moment was when she said that the Holocaust was the \"summum of barbarism\" while her father famously said it has been \"a detail in the history of World War II\". She has also relaxed some political positions of the party, advocating for civil unions for same-sex couples instead of her party's previous opposition to legal recognition of same-sex partnerships.[14][15]\n\nLe Pen was ranked among the most influential people in 2011 and 2015 by the Time 100.\n\n \n"
		},
		{
			"post_id": 164,
			"title": "人民的意愿是必须执行的指令",
			"date_published": 1467044509.241,
			"body": "now this truly shows the greatness of the great britain - not the in or out, not the gain or loss in a thing called eco-no-me."
		},
		{
			"post_id": 163,
			"title": "IPO注册制是一条出路",
			"date_published": 1467042690.646,
			"body": "没有注册制，提高直接融资比重就是一句空话。通过银行贷款方式，民企、中小企业将仍然很难贷到款，银行融资的方式只能继续向地方政府、国企加杠杆。这样，经济低效、货币超发就成为必然，人民币贬值压力就将一直存在下去。"
		},
		{
			"post_id": 162,
			"title": "yuan",
			"date_published": 1467042663.552,
			"body": "- 央行宣布人民币对美元中间价贬值599个基点，报6.6375，创下2010年12月23日以来的最低点；人民币汇率接下来会怎样走，普通人要不要换点美元，股市又将如何？\n- 借助英国脱欧的机会，让人民币适度贬值，这是个好机会;"
		},
		{
			"post_id": 161,
			"title": "agree or disagree?",
			"date_published": 1467042592.068,
			"body": "在当前的全球金融环境下，没有一个资产是真正安全的，因为所有资产的表现都是相关的."
		},
		{
			"post_id": 160,
			"title": "how to design and build a new eu?",
			"date_published": 1467042496.299,
			"body": "an open question"
		},
		{
			"post_id": 159,
			"title": "the first domino",
			"date_published": 1467042322.407,
			"body": "目前另外其它8个国家——包括法国、荷兰、意大利、奥地利、芬兰、匈牙利、葡萄牙、斯洛伐克——也希望举行脱欧公投。"
		},
		{
			"post_id": 158,
			"title": "a few points about international trade",
			"date_published": 1467039513.864,
			"body": "- 贸易摩擦会越来越严重，贸易壁垒会越来越高;\n- 手握美国1.2万亿美元的债权。一旦打仗，美国很可能赖掉; 所以不会打仗；\n- 中短期来看，一二线楼市会有所降温。这种降温是收紧货币带来的结果，所以股市也不会好；"
		},
		{
			"post_id": 157,
			"title": "a few points about the stock market",
			"date_published": 1467034441.771,
			"body": "- 不管是暴跌还是阴跌，股市总体还将向下走一个台阶。个人估计是2500多点;\n- 应该对股市跌破2200点，有充分的思想准备;\n- 如果想做短线，一定要在大跌后买入;\n- 当前的股市，套牢的主要是机构和国家队，当然不愿意大幅下跌;\n- 如果大幅下跌，一些基金将被赎回，如此恶性循环，股市更要崩溃了。所以在2800点以上，基金们有一起扛住股市的意思;\n- 因此才会有不断的声音宣传所谓大行情；当真的就是傻逼；\n- 高位一定要卖出；\n- 对于股市底部的估计，还是要进一步降低估值。因此，我必须给大家一个忠告：你的经济决策，一定要充分考虑各种风险，要充分保证自己的现金流！"
		},
		{
			"post_id": 156,
			"title": "i havn't seen an earthquake without aftershock",
			"date_published": 1467030039.322,
			"body": "today the market amazingly went up, not just up but strongly up, strong enough to change the mood and expectations of most of the participants, like nothing has happened. going up is a good thing, and one should just keep selling, then buy back."
		},
		{
			"post_id": 155,
			"title": "now comes monday: it is raining, but not pouring yet",
			"date_published": 1466988085.267,
			"body": "here is one accurate prescription - Developments over the weekend in the UK did nothing to allay fears. What has been most shocking to me over the past 48 hours is that no one here knows what to do."
		},
		{
			"post_id": 154,
			"title": "we are all students again",
			"date_published": 1466950579.04,
			"body": "here is a book for our night study - good good study.\nhttp://127.0.0.1:43110/1LJ4iWh2Jp5shqmm8p8VSod6Y6JhahHZh/"
		},
		{
			"post_id": 153,
			"title": "the problem of gold",
			"date_published": 1466949481.587,
			"body": "if you think about it it is quite stupid for gold to become a place for people to stick their heads and hide. but remains to be true for at least 100 years. what's wrong? and what does this say about our current human situation? i think the answer is quite simple and clear."
		},
		{
			"post_id": 152,
			"title": "global equity market ",
			"date_published": 1466949364.263,
			"body": "only one way - down!"
		},
		{
			"post_id": 151,
			"title": "下一个公投的会是那个国家？",
			"date_published": 1466936578.266,
			"body": "germany itself?\n\nhow is the sentiment there? anybody lives in germany now? "
		},
		{
			"post_id": 150,
			"title": "当财富向少数人集中",
			"date_published": 1466922978.149,
			"body": "- 全球化导致资本和劳动力的迁徙；\n- 本地传统劳工甚至白领阶层失去就业机会，从中产阶级沦落为底层；\n- 资本游戏使得越来越多的人都想不劳而获；\n- 国家货币手段的依赖和运用使问题恶化；\n- 洞悉这一切的富人，在游戏中通过波段性操作，变得更加富有；\n- 在这个格局下，人们的目光聚焦在如何通过隔离他人的竞争，获得生存机会，那就是底层的博弈，劳工对抗劳工，屌丝对抗屌丝；\n- 贪婪带来财富，财富带来贫穷，贫穷带来愤怒，愤怒带来仇恨，对抗，和战争。\n"
		},
		{
			"post_id": 149,
			"title": "big division - , so what is wrong?",
			"date_published": 1466919921.079,
			"body": "let data speaks themselves:\n\nPerhaps the most obvious division is the one between the people and their elected representatives in parliament. While the nation voted 52-48% to leave the EU, the vast majority of Members of Parliament, the people elected to take such decisions in what has traditionally been a representative democracy, were declared supporters of \"Remain.\""
		},
		{
			"post_id": 148,
			"title": "(two words deleted here) economy!",
			"date_published": 1466900556.889,
			"body": "too many people are using the so-called language of economy to measure everything, including human values and life, including leave or remain, in or out. to some poeple, the economy is everything. what is their economy? it is basically numbers backed by money and money only. want some proof? when a people chooses to simply be alone, a big chunk of paper wealth vanishes. so what is the true worth of that kind of wealth? and economy?"
		},
		{
			"post_id": 147,
			"title": "regrexit or not, it is a great show",
			"date_published": 1466900098.575,
			"body": "show the power of the people and a true nation of the people. in or not is not that important, 只要她有权利去影响和决定，是真正莎士比亚的民族。是个今天世界上少有的热血民族。历史会证明这是工业革命民族给世界的一个新的贡献。"
		},
		{
			"post_id": 146,
			"title": "宇宙来自无限小的一个点，微观决定宏观",
			"date_published": 1466869642.757,
			"body": "每一个事件都是未来在今天的缩影。"
		},
		{
			"post_id": 145,
			"title": "7月1日，是值得期待的日子",
			"date_published": 1466830434.828,
			"body": "！"
		},
		{
			"post_id": 144,
			"title": "天意",
			"date_published": 1466829686.776,
			"body": "英国公投，登记的选民有4650万，登记参与投票率高达72%，这意味着英国人能登记的基本都登记了，可见英国上下对这次公投是多么的重视。但是，正所谓天有不测风云，登记选民4650万，但最终投票的选民却只有3355万，两者差距近1300万。这1300万人都去干嘛了？因为英国投票当天天气很差，这些选民没有出来投票。从这个视角上看，决定英国公投脱欧结果的不是别人，正是“老天爷”。因为，相比支持留欧者，支持脱欧者绝大多数是不管天气好坏都一定会投票，他们认为加入欧盟后损害了他们的利益，所以一定要投脱欧票。支持留欧者更多会因为天气而放弃投票。如此一来，在这近1300万放弃投票的选民中，支持留欧者绝对占更大的比例。根据投票结果，支持脱欧人数比支持留欧人数仅多不到127万，这意味着如果放弃投票的这近1300万选民都出来投票，大概率留欧派会获胜。"
		},
		{
			"post_id": 143,
			"title": "机遇",
			"date_published": 1466819617.947,
			"body": "这次英国退欧导致的欧洲经济和股市震荡，不是短期行为，它也会间接影响其他金融市场，有暴跌也会有反弹，总体上是世界金融格局重新划分的过程，股市和汇市只是过度反应。既然反应是过度的，那么套利的机会就会大批涌现。对于战略家，未来几个月是最幸福的时期。"
		},
		{
			"post_id": 142,
			"title": "为脱欧点赞",
			"date_published": 1466749974.988,
			"body": "为什么？因为世界上有个小岛上的人向世界说：你用钱算出来的所谓经济，对我们来说并不是最重要的。"
		},
		{
			"post_id": 141,
			"title": "需要一种新科学，新创新",
			"date_published": 1466749538.333,
			"body": "科技创新引领了世界的某种意义上的进步，但是今天我们看到：我们以前所崇尚的科学进步，有严重瑕疵。因为她没有能帮助解决人的一个根本缺陷：自私，贪婪，唯利是图。\n\n完全没有。不但没有，今天的人变得更加贪婪，更加自私，更加唯利是图。整个社会对利润的崇拜和逐鹿到了疯狂的程度。科学沦为唯利是图的工具。\n\n科学需要反思。\n\n你会问，是不是人应该反思？免了。人从来就不会认错。"
		},
		{
			"post_id": 140,
			"title": "未来世界的战略",
			"date_published": 1466749092.115,
			"body": "每个国家都有些人在策划这个问题，只不过大多数所谓战略家门都还远没有看到世界将要如何展开她的美丽花卷。有机会我会跟各位透露。"
		},
		{
			"post_id": 139,
			"title": "浪漫主义的又一次失败",
			"date_published": 1466748853.203,
			"body": "今天谁被历史又一次嘲弄？下面各位：\n- 贝多芬\n- 雪莱\n- 歌德\n- 比斯曼\n- 整个历史的德国"
		},
		{
			"post_id": 138,
			"title": "重新思考历史",
			"date_published": 1466742411.351,
			"body": "这是个需要重新思考历史的时刻。你因该想的包括：\n- 马克思理论；\n- 资本主义和社会主义的重新认识；\n- hegel 的哲学思想；\n- 中国，新欧洲，未来的亚洲；\n- 美国下100年还是美国；"
		},
		{
			"post_id": 137,
			"title": "脱欧",
			"date_published": 1466742220.061,
			"body": "如果你还没看到这个事件的意义，你还不知道下面该做什么，你注定是loser."
		},
		{
			"post_id": 136,
			"title": "play女人，累不累心？",
			"date_published": 1466729302.577,
			"body": "如果你感觉累心，那么你还需要重新认识女人，知道女人是什么货色。两个搞不定，一个你照样团团转。\n累，是因为你当真。你和她在一个水平线上看世界，想问题；大错特错。再打个比方吧，你是养猪的。你会应为应该养一头猪，还是两头猪纠结吗？"
		},
		{
			"post_id": 135,
			"title": "卖股票的原因",
			"date_published": 1466729128.69,
			"body": "- 缺钱用；\n- 不看好股票；\n\n不管是哪种原因，都不是好事。股市精灵在卖，你也必须卖。"
		},
		{
			"post_id": 134,
			"title": "股市里谁最聪明？",
			"date_published": 1466729036.866,
			"body": "6月13日以来，103家公司通过交易所监管信息栏披露了董、监、高本人买卖股份情况。其中，22家公司呈现净增持，净减持公司达81家。"
		},
		{
			"post_id": 133,
			"title": "世界上有人姓怂吗？",
			"date_published": 1466728134.986,
			"body": "今天没有。但是历史上据考证，有。从心在任何意义上都是好事。问题是，为什么这么好的东西，慢慢就消失了呢？只在民间口头流传。这就是我们文化操蛋的地方。这里头学问很大，以后有机会我慢慢跟你说。"
		},
		{
			"post_id": 132,
			"title": "怂，是好男人的核心",
			"date_published": 1466727660.668,
			"body": "什么是怂？语言实战中有几种用法：\n- 从心；\n- 让步，任命，但不一定是认输；\n- 射精；\n\n这三者的意思统合一起，就叫做怂。好男人，就是要怂。对家人要怂；对朋友要怂；对女人更要怂。\n\n\n"
		},
		{
			"post_id": 131,
			"title": "咱么哥们也学学新三板 - 边抄边学",
			"date_published": 1466684908.726,
			"body": "骗，已经成为一种普遍的行为，而且好像没人在乎，被骗活该。很感兴趣下面的社会动力学过程。\n\n还记得之前闹得沸沸扬扬的“中晋系”美女股票骗局吗？对，这个故事在新三板复制了。美女请求加微信，加了微信后，帮助你开户，推荐买新三板股票，再然后，钱就没了。美人计加上暴富梦，不少人就这样受了骗。\n\n“我会死的！”被美女骗的刘先生语无伦次。对于远在湖南的他来说，钱被套在新三板出不来，随时都有倾家荡产的可能：不仅负债，房子还抵押在银行，而他瞒着家人独自承受。\n\n1、开宝马、搭名牌包的美女操盘手怂恿垫资开户\n\n刘先生说，去年底，有美女加他微信，怂恿他垫资开户。“去年十一月底，对方通过微信摇到我。我保证我当时没有什么非分之想，一看是附近的美女要加我，就同意了。加了后也没有对人家进行言语上的轻薄，我甚至同意尊称她为‘师父。’”刘先生开头就反复强调，并说后来之所以经不住诱惑，是因为他想要赚更多的钱；叫对方一声“师父”，是因为对方愿意带着他赚钱。\n\n但是，刘先生缺钱吗？他懊悔回忆道，摊上这事之前，生活不说富足，却也比较滋润，一切运转正常。刘先生做些医疗器械的买卖，赚了些小钱，买了房买了车，还给妻子也配备了一台车。只是，父母的过世和家庭责任的担当，给了刘先生追求更多财富的压力。\n\n“我加上这个姑娘后，就在她的QQ空间、朋友圈里看到各种炫富的照片。开宝马、开跑车，到处聚会、旅游，还有各种名牌包包。一定花了不少钱吧？问她怎么来的钱，她说是自己靠做业务做出来的。”\n\n有那么好赚钱的事？刘先生很好奇。美女打蛇随棍上，向他说起暴富的秘密就藏在新三板上：原来美女是某资管公司的员工，美女说自己的公司曾购买合纵科技的股票，后来这个公司转板，在创业板IPO，因而获利颇丰。\n\n美女告诉刘先生：“我给你投几家公司，几个月就可以转板了。”\n\n刘先生一听，心动了。但是新三板开户要500万，美女说我们公司可以帮你垫资开户呀，刘先生一看赚大钱的机会来了，可还是不免心存犹疑，反问：“有这么好的事？”\n\n美女大概心说，就等你这一句，告诉刘先生自己公司掌握内幕，操盘稳妥。于是刘先生转给美女1.8万元，便风光开户。\n\n2、80万资金打过去，还一道寄了特产感谢美女师父\n\n当读懂君要刘先生回忆当时以什么价格买了多少股时，刘先生说不知道。\n\n“我什么都不知道，连她给我买的什么都不知道。我加了她QQ，她远程帮我下载了交易软件。我能用的资金就100万左右，开完户后我转入80万现金开始进行交易，我也不知道她在屏幕上点了什么，什么股票、K线图我都看不明白，只晓得一下子80万就买光了。”\n\n80万这样花出去了，刘先生真心觉得美女人很好，郑重其事地写了感谢信、寄了特产到美女的公司。\n\n听到这里，读懂君不禁插嘴问刘先生是否曾经炒过A股。令人震惊的是，刘先生两年前就进入A股了，但是在完全看不明白股市的情况下，跟了熟人操盘手买入一些A股，并且小赚一笔。\n\n“就是我隔壁的大哥认识的一个小伙子，是本地人，16岁就去了深圳闯荡，一直在股市里。跟他买就赚。”说到这里，刘先生言语间透露出一番争辩之意。\n\n但是，刘先生显然对这样的小赚头不满意，这才会轮到找网上的美女帮他换一个暴富的机会。\n\n3、追讨本金不成，疑是美女销售团队兴风作浪\n\n如果不是刘先生做生意出现资金周转不灵的情况，他一定还沉浸在暴富梦中。\n\n80万的财务漏洞怎么填？起初，刘先生想到去银行申请贷款，由于利息实在太高，刘先生将房产证抵押在了银行。此外，还托了一些私人关系，月息1.5%借了一些钱。\n\n但刘先生还是感觉到运转不过来，不得已，想到要赎回投到新三板的80万。\n\n几次交涉无果，原本热心的美女一下子变得冷冰冰，爱理不理，提出的回购条款是每股4.8元。但是刘先生不满意，美女甩下一句：“那我给你贴息，每股5元行不行？”在刘先生坚持要回本金的情况下，美女将刘先生屏蔽了，现在刘先生已经看不到美女的任何状态。\n\n今时今日，再登入交易软件，刘先生告诉读懂君，当时买的是两支股票，30万元买入艾芬达（832958.OC）3.1万股，另一只以50万元买入7.3万股。读懂君给他算了一笔账，两家公司股票的平均价格约为8.3元，对方所谓的回购无异于是以腰斩的价格买回。\n\n无法获得满意的结果，刘先生急了，网上一搜，才发现了一大片和他同病相怜、指责这个资管公司欺诈的个体散户。\n\n“一个机缘巧合，我加入了读懂新三板的群，发现读懂君的群里好多人都在骂这家公司。后来我们几个人加了朋友，拉了一个小群，所有事情一对，我们觉得这肯定是团伙作案！”\n\n我四五个朋友，都这样。我们核对了一下，就那么几家公司，高度重复、比较固定。钱给她们，买什么她们决定，远程帮我操作买了这些股票，都是线上买的。”\n\n套路都是美女加微信、QQ，然后炫富、推荐新三板股票，“我们确定了，就是‘美女股票’。”\n\n这些上当的个人投资人只有聚集在一起，相互交换信息的时候，才会发现一个问题：或许这是一个局。\n\n“我真的没有办法了，向您求助！这件事我不敢让家里人知道，万一知道了一定不得了。我老婆身体不太好，平日里有事我都让她，不敢和她争，生怕她病要发作，这是绝对、绝对不能和她说的。”刘先生把该资管公司高管的QQ给读懂君，希望读懂君能帮他。\n\n忽然想到前不久倒台的中晋系，一样是美女销售。当时一句话，在圈里很流行：“你看中的是人家的高利率，人家看中的是你的本金。”\n"
		},
		{
			"post_id": 130,
			"title": "女人和擦边球",
			"date_published": 1466684192.733,
			"body": "首先一个叫“骆英”的人加了我的微信。他自称第一代新媒体运营者。\n \n我约他吃饭。但他先应了另外两个人的约。于是，四个人凑到了一起。\n \n另外两个人中，一个是做视频的总裁李承道，一个人是做直播的CEO jason。\n \n聊了几句，我就明白今晚的饭局是jason发起的。他公司开发了一款叫“邻鸽”的直播平台，现已上线，正在寻求最有效率的推广形式。\n \n02\n说到直播，我就想起号称中国最大的娱乐直播平台—YY，一个以各种夸张表演、演唱、荤段子、搞笑等内容吸引观众的互动娱乐平台，主播以男靓女、草根明星为主。\n \n在直播生态里，有平台、主播和经纪人（发掘、培养主播，组织土豪送礼的人）和观众等，而前三者都从观众送礼中参与分成而获利。百万主播、千万主播的出现尤其搅动着无数渴望一夜暴富的草根们的神经。原本躁动的资本也纷纷追捧直播行业，2016年被称为“直播元年”。\n \njason说，他的公司最近在招聘女主播，应者纷纭。“全都像模特一样，过去那么多年，我从没见过这么多美女”。签约主播必须颜值高，有才艺，互动能力突出。\n \n晚上9点多钟，我们还在深圳岗厦附近的木屋烧烤二楼吃烧烤，jason打开手机中的“邻鸽”APP说，约好了一个女生现在面试。手机视频中，一个身高1米70、面容姣好、长发披肩的女生正在展示着自己。\n \n烧烤店里喝醉的食客们的高声叫喊和街上呼啸而过的汽车混合在一起，我听不清女孩在说什么。只听到大家异口同声地说，这个女孩漂亮，可以录用。\n \n03\njason约李承道和骆英吃饭，是想请他们给他提建议，如何快速推广这款APP。李、骆都认为事件营销是最好的推广形式。\n \n李承道是视频制作人，想法很多，他一连提了几个建议。\n \n他建议请两个长相相似的女主播，开一个“啪啪啪学堂”，副题是“双胞胎美女舌吻”，教男生如何舌吻，有“法式舌吻”、“美式舌吻”等等，并由两名美女现场演示。\n \n“好！好！这个好！立即执行！哈哈哈……”jason激动地捶胸顿足，又擂桌子，又拍大腿，“这个可操作，而且不犯法，人家男女公开场合接吻都可以，我们还是两个女生舌吻，更没事。而且我们穿长袖，不穿低胸！”\n \njason迅速把这个建议记录在手机里，又迫不及待地问：“还有什么好主意？”\n \n李承道想了一会儿说，还可以做一个“美女养成记”的直播节目，直播女生上厕所啊，洗内裤啊。他又突然顿悟一般地说，还可以在内裤上找到一根阴毛……\n \n“哈哈哈，这个不犯法，这个男生爱看，我要是看到这样的标题，一定会点进去。男生都喜欢看小内裤，恨不得去舔。” jason一边说，一边做出一个舔的动作。他很有法律意识。\n \n骆英提议做个“美女吹箫”直播栏目，“是真的箫，弹古筝啊，唱歌啊都太普通了”。\n \njason觉得这个建议也不错。他认为男生都爱看这样的直播，陆家嘴视频流出时，他在网上到处寻找视频，花了一个小时才找到。\n \n04\n我以为他们会做垂直细分领域的直播，没想到他们和YY相似。\n \njason解释说，“邻鸽”除了有唱歌等娱乐表演，也有主流能接受的民间新闻、互动游戏等等，相当于“视频版的微博”。另外，YY是PC端的，而邻鸽是移动端的。\n \n“可是现在的推广形式必然使邻鸽成为低俗的平台啊。”我说。\n \n“没办法，只有这些东西才能获得早期的十万用户。这和资本家一样，每个毛孔都滴着血和肮脏的东西。但等我们有钱了，再洗白嘛。腾讯不也是这样？”jason说。\n \n突然，骆英说：“你读了那么多书，还跑到美国读书，跑回来还是开妓院！”\n \njason和大家一起笑得前仰后合。\n \n骆英特意对我这个新人解释说，jason毕业于中国科技大学，后赴美国密苏里大学攻读电子工程系硕士学位，拿的是全额奖学金。毕业后在加州做了三年工程师。2014年回国，2015年1月份创业，开发图片社交平台，还没上线就自己扼杀了，他判断这个项目已经跟不上技术发展的速度，于是迅速转做直播平台。直播平台的开发又花掉150万元，都是家族支持的资金。\n \n最后，我对jason进行了一次简短的“专访”。\n \n记者：你读大学时，希望自己将来成为怎样的人？\n \njason：科学家。\n \n记者：从科学家到做直播，你的内心是否有挣扎？\n \njason：用科技实现全民娱乐没什么不好的。我也希望能改变现有的直播秀场模式，未来把电商、电视、媒体、微博都变成直播。\n \n05\n今晚所见所闻，触发我对近期的一些经历进行了一次整合和思考。\n \n我最近在几大新闻APP和门户网站开通了专栏，当我发表一篇时政类文章后，某平台编辑提醒我，严谨发布涉泛时政类的内容，机器对这些内容不做推荐。\n \n另一家门户网站的编委告诉我，机器推荐的都是美女图片、段子、奇闻等等，这才是更多网民感兴趣的内容。\n \n“你的读者喜欢什么样的内容，你就应该生产怎样的内容。你不能还像记者那样写作。”一个红了多年的写手善意地提醒我，我们是多年的文友，从未见面。\n \n这个朋友和上述几大新闻机构的主要内容运营者一样，都曾是中国最优秀的新闻人，在过去二十年间，他们单枪匹马，像间谍一样穿梭在中国广袤的大地，揭露黑幕，针砭时政，关怀弱者，用文字启蒙了几代年轻人。而YY的一名副总裁更是《孙志刚之死》的编发者。但如今他们不再启蒙，而是迎合，并用科技将人性阴暗面发挥到极致。\n \n世界已被颠覆！\n"
		},
		{
			"post_id": 129,
			"title": "亲爱的，想对你说：祝你成功。",
			"date_published": 1466654636.002,
			"body": "人有两个女人最好。"
		},
		{
			"post_id": 128,
			"title": "the start of a new project",
			"date_published": 1466654529.915,
			"body": "My second wife.\nhttp://127.0.0.1:43110/14VL6rzPBbqeJgvXTzjRKvdTuXNNSA88z7"
		},
		{
			"post_id": 127,
			"title": "用什么可以点亮世界？",
			"date_published": 1466654081.253,
			"body": "答案这里就有。"
		},
		{
			"post_id": 126,
			"title": "你几岁问这个问题：以后我上什么大学？",
			"date_published": 1466654030.155,
			"body": "从问问题看人生。"
		},
		{
			"post_id": 125,
			"title": "四方形是个字。三角形为什么不是字？",
			"date_published": 1466653911.108,
			"body": "中文里头的奥秘很多。"
		},
		{
			"post_id": 124,
			"title": "马Aileen问题",
			"date_published": 1466653772.078,
			"body": "她要辞职了。因为她零打碎敲的东西开始有起色。创业了。几天没有理会她，她开始询问：出差了？\n感觉还是慢慢有些真情。继续培养。"
		},
		{
			"post_id": 123,
			"title": "可不可能人类不再读和写，只用听和说，外加猴子一样的比比划划？",
			"date_published": 1466653641.35,
			"body": "答案未知。"
		},
		{
			"post_id": 122,
			"title": "假设人不再写，人还会不会读？",
			"date_published": 1466653575.521,
			"body": "答案不明。"
		},
		{
			"post_id": 121,
			"title": "人类未来还要不要知道如何写？",
			"date_published": 1466653482.969,
			"body": "趋势是人写的越来越少。\n未来的人还需要不需要写？"
		},
		{
			"post_id": 120,
			"title": "为什么要研究女人？",
			"date_published": 1466652049.318,
			"body": "据说马克思说，如果你要看一个人在社会的地位，就看女人怎么看他。女人的看法至关重要。女人是社会的真正风向标。男人看不看好社会，有各种原因，包括个人的野心。女人没有野心，她看的就是厨房，后院，感觉到的就是银行账号，深情的就是床。因此她才是真正看到社会的本质。女人看好的社会就有前途，不看好甚至抛弃的就没有前途。\n所以，看看你身边的女人怎么想，你就明白一切。"
		},
		{
			"post_id": 119,
			"title": "世界在搏傻",
			"date_published": 1466587109.062,
			"body": "- 如果你的软件还需要写，那就还不够傻；\n- 比划比说傻；说比读傻；读比写傻；\n- 所以才有了智能手机这种傻逼玩意；\n\n问题是：什么比比划还傻？\n"
		},
		{
			"post_id": 118,
			"title": "test for data",
			"date_published": 1463906009,
			"body": "replace data"
		},
		{
			"post_id": 117,
			"title": "数数你qq联系人群里有多少骗子",
			"date_published": 1466342535.674,
			"body": "我的qq上有50个左右的联系人；已经证实情况如下：\n- 48个骗子\n- 1个不是骗子，但是个自大狂\n- 1个未知\n\n我艹qq你妈，这种服务还能有几天活头？你到底花了多少钱，买通了谁，让你还开到今天？还是这个社会傻逼太多？"
		},
		{
			"post_id": 116,
			"title": "交友网站傻逼们的彻底失败",
			"date_published": 1466340023.458,
			"body": "无疑，传统交友网站和社交平台的彻底失败只是时间问题。注定他们失败的原因很简单 - 骗子太多。\n\n他们如何被替代是我们最关心的核心问题。"
		},
		{
			"post_id": 115,
			"title": ".bit makes sense given all its history and we love history. how about we make .free?",
			"date_published": 1465963776.267,
			"body": "- copy all the current namecoin over;\n- change only one keyword bit to free."
		},
		{
			"post_id": 114,
			"title": "towards a mechanism of trust for trade",
			"date_published": 1465963269.958,
			"body": "i was often asked this question - how do i trust you? the context is i want to do business such as selling products or sourcing for clients and so on and so off. that is constantly a big issue for chinese businesses. and there is no question the act of cheating is rampant in some parts of the world. \n\nhow we can design a credit system to solve this credit problem? for sure someday very soon there will be a smart mathematical solution similar to blockchain, or maybe one most ancient way, a ledger, may also work. this calls for a blog or booking system that is generated by algorithm, and once generated can not be changed or removed, including all inputs of all kinds on this ledger."
		},
		{
			"post_id": 113,
			"title": "Why .bit registration is not free?",
			"date_published": 1465892230.409,
			"body": "- zeronet is free;\n- can we make .bit registration free too? all are based on the open source softwares;\n- if it remains not free, should we make one that is free?\n- if it remains not free, then I will make one that is free."
		},
		{
			"post_id": 112,
			"title": "why chinese love zeronet?",
			"date_published": 1465530992.332,
			"body": "it took chinese much longer time than western people to fully endorse and embrace internet, probably partially because of the name, chinese have not much clue or feel about this word inter. if inter has to be translated into chinese and made corresponding to one particular word, that word is not much respected.\n\nnot zeronet. zero is big in chinese, it lies at the foundation of everything according to chinese philosophy, as explained here:\n\nhttp://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u/?Post:16\n\nnaming is big. starting from new borns, every parents spend significant time or even fortune on naming their child properly. businesses, real estate developers, officials of all kinds, all pay special attention to the naming of their organs and things. there are specialists who do nothing else but naming things. naming in chinese is never as simple as apple gives itself the name apple.\n\n"
		},
		{
			"post_id": 111,
			"title": "what would be a good language teacher?",
			"date_published": 1465398622.046,
			"body": "i ask this question because all of sudden i think i know, at least know one way to make and define a good language teacher.\n\nto a good language teacher every word to him or her is personal: each word has its own personal meaning, was once part of his life, helps him qualify and quantify his life, society, and world. \n\nif one could have lived through all these words, say 20,000 words, what kind of man he would be?\n\ni have so far lived only one word."
		},
		{
			"post_id": 110,
			"title": "try one new idea once in a while",
			"date_published": 1465359039.618,
			"body": "turn the gg english around and let's try gg chinese and see how it goes. on zero platform i think about 1/3 are chinese, and the rest come from all other language background. it seems the main interest of learning a little bit of chinese comes mostly from english speaking people, probably mostly americans. based on my observation, very very few foreigners are able to learn chinese well. \n\nso i set a different goal for learning chinese:\n\n- it is not designed for capable communication with non-english speaking chinese people;\n- it is for fun and fun only, treat it as an art or pure leisure; \n\nso here is the homepage of my way of learning some chinese:\n\nhttp://127.0.0.1:43110/14qBuhh5LCSe9CQ6uTwBmpmeGAe93Ut6ci/"
		},
		{
			"post_id": 108,
			"title": "economics of cheating - some initial thoughts",
			"date_published": 1465300287.036,
			"body": "cheating, and its various mutants, are rampant in some part of the world. i will not discuss it through traditional perspective. due to some reason that is unknown to myself even, i want to ask this question: is there anything good about cheating?\n\ni am not playing philosophical magic here. i myself is a regular victim of cheating. when i was cheated, my first reaction was not revenge. i did not try to recover my loss. i became spontaneously curious: what kind of species can so calmly carry out this calculated wrong? i today can recall vividly every facial muscle movement of that lady who set me up in the cafe, made perfect strike at the right moment, carried out her act so naturally even after she knew perfectly well that i knew her whole criminal design and play? in fact i never consider her a criminal, i only consider her a particular woman who has to make a living this way, i do not even need to find any justification. like our grand master has said, world is a stage, we all play.\n\nso my questions are:\n\n- what are the benefits of cheating? \n- in short term, there is no doubt it can benefit us economically, because looters tend to spend freely, and spending is good to economy;\n- but what is the economic influence over the long term? would an entity of looters and cheaters gain long term economic advantage over other entities?\n- how about victims? it is not uncommon to find in the news some victims ultimately perished, some commited suicide. but the survivors, could they learn so much from this and more likely to outperform in the future business competition? if this is true, then i have to thank that lady.\n"
		},
		{
			"post_id": 107,
			"title": "what kind of place i live in",
			"date_published": 1465290229.522,
			"body": "well i tell you what kind of place i live in. \n\nit is said rosemary has positive effect on human longevity, as currently studied by a group of scientists in a small town in italy where some 1/3 of men live beyond their 100 now. do not know why, but visitors found rosemary is part of their everyday diet. \n\nso i bought some rosemary seeds from online, actually from three separate online vendors; i am cautious so put some safty factor into this small effort. i grew them, sopposedly these seeds are among the most easiest to grow species. \n\nalmost none sprouts. a few sprouts, but they are not rosemary. \n\nso either i am stupid or i am cheated. either way, i am stupid. \n\nthat is what some people try to prove to me. now almost on daily basis. that is why i start to seriously study the art of cheating. i honestly think in short term, that absolutely boosts economy. the only thing i wonder is its long term effect. \n\nso let's assume there is a society, similar to the country of the beggers in classic greece, but country of the cheat. i can only tell you this project i just started. but i will report to you my academic study result from time to time."
		},
		{
			"post_id": 106,
			"title": "a note ---- what is the meaning of go gg in Chinese?",
			"date_published": 1465286060.346,
			"body": "go gg if you say it in Chinese, it means dog's penis.\n\nand if you actually say it, it feels just funny, nothing else. if you say that to a woman, she will not feel offensive in any way, just funny, might pick her curiosity. so give a try next time you see a chinese.\n\nso go in chinese means dog. that is why chinese know AlphaGo as AlphaDog."
		},
		{
			"post_id": 105,
			"title": "go gg",
			"date_published": 1465281524.864,
			"body": "http://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5/"
		},
		{
			"post_id": 104,
			"title": "男人学英语上gg: 狗鸡鸡",
			"date_published": 1465271532.911,
			"body": "a great place for men to learn English writing, designed for man's women interest:\nhttp://127.0.0.1:43110/1K6pAEUkroJyv8Le4MXhQ9iHZSkFNxkvn5/"
		},
		{
			"post_id": 103,
			"title": "三板斧搞定女人：巧克力，电影票，冰激凌",
			"date_published": 1465229374.622,
			"body": "Blog post body"
		},
		{
			"post_id": 102,
			"title": "女人貌似很难理解沟通",
			"date_published": 1465141047.288,
			"body": "其实就是钱。你试试下面几招，你会有惊喜 -\n- 给她礼物；\n- 给她红包，100以上都管用；\n- 请她旅游，这招最管用；不用问，不用事先见面，住一间房貌似是行规；\n- 总之，有了钱，一切自动到位；卧槽。\n"
		},
		{
			"post_id": 101,
			"title": "do you know anything about your grandfather's grandfather?",
			"date_published": 1465136182.691,
			"body": "i have so far over 500 students taught, many one on one. and this is the single question that i have never had a single yes. \n\nwhat is wrong?\n\nif a person does not know his grandfather's grandfather, how much a sense of history his family has? i guess certain things will pass down through genes, but not everything that we would consider important. for example, not a single story could pass on through genes, nor words, family secrets, formulars. \n\nmy mother died a year ago. for her whole life she has never mentioned a single time or word to me about my grandfather. what is wrong? \n\ni should not make too big a deal out of this. if i do, a whole nation and its history will be questioned even cursed. i will leave this to the future, not now."
		},
		{
			"post_id": 100,
			"title": "excuse me",
			"date_published": 1465129556.724,
			"body": "for my lack of control on the proper use of language. in my mother language i suppose to control it much better, but my wife constantly cursed me for the fact that the kindergarden teachers of our kids had several times commented on the improper use of language by our children. \n\nbut really i just used one cursing word no matter how carefully you examined over my diction. and i have improved so much. i remember when i first landed in that city with a great lake supposedly full of NaCl many years ago, i struggled on many words. in particular, i had trouble in pronunciation, certain short vowel sounds do not exist in my mother language. i would say sit down as seat down. this lasted until one day one mormon friend shouted to me in excitement: hey man you got that short thing right; i just said shit. i think from that moment on i felt very comfortable about english. it became part of me. \n\nthat is probably why we curse. yes because we need to do exactly that thing from time to time, but also because the special bonding power it has. when i freely curse with a man, he must be my friend. when we freely curse together, we become the best friends. so really, when i curse, i just want to become your friend."
		},
		{
			"post_id": 99,
			"title": "i was publically cheated once and here is the story for your entertainment",
			"date_published": 1465106742.67,
			"body": "woman, i love woman. i think for many men their dream is to have a family, sure. and part of that dream is also to have a lover, and incorporate his lover seamlessly into his family. so like i read from nytimes many years ago in some jewish family in brooklyne, in many of their families there are two women, one typically much younger than the offical one. \n\nhow i woo them? i do not have other venues really. it could be easy according to one of my great great student, who by 18 years old have over 50 women already, some in their 30s, quite a few dying to marry him. one woman of her 30s was a master degree student from france, majored in psycholoy. she believes in something called buddhism. she has one daughter from her previous marriage. she wants to marry him, my great great student.  \n\nhehe, but she does not know she has no chance at all of marrying him. all of his women i know well, because when we are having class of SAT, we do not study SAT we only study women, his women, all of them. so over the 5 years of study, i know his women from number 3 maybe to well over number 50th.\n\ni still remember that one raining day, we sat in my office on this street that has a grand name that suggests leading to the heavens,  trying to design a strategy for him to get rid of his current gf because he is tired of her somehow, and all the while this poor girl is sitting in a chain that has a big m letter as its logo name, waiting for him to finish his class.  world is large and zillion things happen.  while she is waiting, sure one thing she does not know is his man is designing with his grand master a way to dump her in an unassuming way. \n\nbut let's not talk about him, his women, and his way of getting women. those are a little too expensive for me, given i have a family and i give all my income, not much, to my wife. so my only way of wooing a woman is through badoo, or its local copycat. badoo works better. this local version proves to be a waterloo for me. by the way that is how i later decided to start a new economic field called economics of cheating.\n\nso this woman shows up one day, claiming she wants to find a good lover. she claims her sexual desire can not be met, husband far working in german and maybe even german girls, and she alone is lonely. we communicated online for a few days. the only thing that makes me feel a little wired is some of her messages are so apparently prepared beforehand, seems like she has to make it ready and convenient in order to talk to many. but i was so eager so we met. thinking now in retrospect that preparedness is her only mistake, but more than enough to overcome the great shortage of women and its incurred blindness in men.\n\nso we met on a street corner. she led me into a cafe, sitting down, talked about her prepared message of lonliness. a few minutes into the talking she became aware of my rising unease. immediately a bill came, over $600 worth of charge for one bottle of wine that i did not order but presented to us anyway. i paid the bill. she poured two glasses full, pushing one to me, i drank it down, thanked her, standed up and walked away. \n"
		},
		{
			"post_id": 98,
			"title": "so here it is, sat@34",
			"date_published": 1465105159.999,
			"body": "http://127.0.0.1:43110/1E8AUV7c4CtAY561SL3z9qcXL3GDPZx8v/"
		},
		{
			"post_id": 97,
			"title": "to collegeboard",
			"date_published": 1465100263.785,
			"body": "i write down this because i feel so strongly about this. \n\ni want to say, dear (this dear used here is dearer than i call my woman) collegeboard, do not fuk up on this one, i mean this one, SAT, the thing you have greatly fathered almost 100 years ago but allowed drifting with things i do not know how to name them. \n\ni have been teaching SAT prep for over 8 years now. English is not my mother language and SAT i have never taken before. comparing to your knowledge, i am truly nothing. \n\ni do not really enjoy teaching this, who really cares about these stupid kids, particularly these kids in my geographical location, who are so wrongheaded and treat a stupid exam like the way it is treated now. but i enjoy teaching it, not because of you students but because i am learning myself. i have been learning all my life this thing called english, but only after i start teaching sat prep i start to know a little about this language called english.\n\ntwo words you enforced through your exam impressed me. \n\none is magnanimity. \n\nthe other is wistfulness.\n\nyou so magnificently define the first word as something that comes only from the chest of man. man, that is really something, a great discovery of all time.\n\ntogether both words help define what is the thing called man. \n\nhere are the most basic fact - there is not a single other exam in the world that is taken more by kids than SAT. SAT exam prep is the most important early learning platform for particularly non-english speaking kids. let's not forget this basic truth and twist the exam and make it gear towards the will of college admission officers. who are those people? in my observation, they are mostly failures (sorry) but still pretend they are not because they are associated with these great human learning institutions. and by the way that i think is ok, great learning institutions are human too, men high and low come together build something great and that is great.\n\nbut, let's not let go and set loose this great learning platform. it is through this, me a so-called well-educated much learned man for the first time learned these two great words. it is through this that i have learned about a great culture, a great western way of human thinking, and so on and so on and yes this little something called freedom. these words are among our greatest tradition and value. let's enforce the learning of these words, and their writing. let's not lower the bar just because some fuking stupid kids do not want to waste time and effort away from their little fuking. getting this thing right will farm them much more great fuks in the future. we got to let them know this, and do the right thing.\n\nso, always increase the level of the bar, not lower it. or you show me why by lower it we all ultimately benefit.\n\nso you know what i am going to create next, a thing called sat@34. i am watching you.\n\n\n\n\n\n"
		},
		{
			"post_id": 96,
			"title": "how can technical schools like mit (more geeks and geekschools coming in the future for sure given microsof and googl all see ai and bot the future) solve the sex problem?",
			"date_published": 1465097857.122,
			"body": "my pick - the robot named dana and so on. that might well become the reality soon.\n\nbut there are problems. the problems are:\n\n- men in general do not like, even to think, to have sex with robot, no matter how real it is, or even more real than the real; men do not like that; why? i have no clue;\n- even man learns how to appreciate his own robotic inventions and sort of making love to himself, he creates more tasks for himself. for one, he needs to create now an artificial womb to seed and grow his baby, most likely another even more geeky thing for the future, and this is probably just the start of a whole troublesome enterprise; \n- the only thing i see good is, by doing all these, he is on the way of making a lot of money. then, the real one will come. talk about tribulation of big time, this is definitely a worthy one.\n\n"
		},
		{
			"post_id": 95,
			"title": "i talked to some mit folks, what is missing there?",
			"date_published": 1465097335.854,
			"body": "http://127.0.0.1:43110/18ikTZWayw6vDa96JmxWmkiPV3iH9i1vdT/?Post:11"
		},
		{
			"post_id": 93,
			"title": "cigar and a great nation",
			"date_published": 1465090947.605,
			"body": "certain things make one feel unsatisfied and question its future. when i worked and lived in the city named after a big fruit i felt very unsatisfied, in so many ways. for one thing i slept much less. then the next thing bothered me most was the way driving back home and many times if i had to drive through a part of that town called newsomething, i had to face those homeless. i had absolutely no clue, no confidence, no vote of confidence to a mechanism that deliver both richess and homeless on so grand a scale. to me that is weird to say the least. that is unsatisfactory, that is wrong, that should be changed.\n\nbut world is never that simple. never that simple you can make so easy and quick decision. long before you could think about quit, things zigzagged into its own course that you as an individual could not deter. the great cigar, the great president. fuk, that definitely fixed my view, forever. man, there is a such place in the universe, where you could light up the cigar that way; woman and head of the house could hook up so brilliantly and easily; and the president could still have done such a wonderful job no matter how you qualify and quantify it; man, that is a great place, that is a great nation.\n\nthat is my view. fixed. i will tell my kids the same story. "
		},
		{
			"post_id": 92,
			"title": "how i was doing in elementary school",
			"date_published": 1465086601.671,
			"body": "it is a good time to review my performance in elementary school, which claims to be one of the best in this country, no matter how the ranking was done. at my time one fuking nobodyknow (not even to us in the same school yard) 4th grade all of sudden shoot into national fame overnight because she wrote a letter to the national chairman and that unleashed certain literary revolution.\n\ni never remember i learned anything consciously, meaning sitting in the room, someone up there on the alter making certian utterance, and whatever she said, no matter which day and which who, i think i knew what she said long time ago already. but sitting there is not a torture, not at all, and even to the contrary. because almost all teachers are female, in their 20th 30th or 40th, i fully enjoyed them, their curves, from part to part, i know them so well i think more than anybody, including their husbands if they have one. all parts are so carefully examined, measured, matched somehow against mine. but unfortunately only mentally. fuk, so unfortunate, only mentally. so many years later in the state where i worked for a few years one female teacher of 40 were aquitted from charge related to her intercourse that supposedly should happen only on the mental level with her 13 years old student. i never had a caring teacher like that. \n\nand honestly if i evaluate my education in the elementary school, and middle school, the only use of my teachers are of this one value only, mental partner of a intercouse that i only experienced so many years later."
		},
		{
			"post_id": 91,
			"title": "a small social pedagogy experiment ",
			"date_published": 1465085662.943,
			"body": "2 days iuto this small experiment and the result coming - one is at least twice more effective than the other in terms of engaging users, not necessarily to learn but at least in terms of attention grabing and staying.\n\nboth set out to claim the same service but with different delivery method and promise.\n\nthe current champion is:\nVagina English - with 4 connected peers \nhttp://127.0.0.1:43110/1K8Rm7zCLVKiCPYcGy9RBm1AVLe7mQ8apN/\n\nand runner-up:\n\npd English - 1 connected peer\nhttp://127.0.0.1:43110/1HNDTKdNdAWRxqBFQQ53qk84HRmKsB7ZvB/\n\n"
		},
		{
			"post_id": 90,
			"title": "night is here, and here my dear is a beautiful read",
			"date_published": 1465045329.471,
			"body": "http://127.0.0.1:43110/1Cp4hRjbEq3GmTt74ooSTDNia2uvsKCUU/"
		},
		{
			"post_id": 89,
			"title": "so here it is, the pd English",
			"date_published": 1465039512.075,
			"body": "http://127.0.0.1:43110/1HNDTKdNdAWRxqBFQQ53qk84HRmKsB7ZvB"
		},
		{
			"post_id": 88,
			"title": "English learning",
			"date_published": 1465018635.432,
			"body": "native speakers do not feel the pain of learning english. both students and teachers feel it is like teaching pigs to swim. it is not exactly it is totally impossible, they see dogs with not longer legs but can move in water with ease.  it is just that you never know when and how and what exactly it means to be able to claim they know english. for most of these pigs, they learn for a whole life but they never are able to use it as a language of their native tongue. \n\ni teach some students english, but really, i can only tell them go read some books. they have to rely mostly on themselves. i do not have a clue how to make this process more effective or painless. i can only tell them imagine they are pigs, and then think from the pigs' eye to see those swimming dogs, and imagne what dog has done right to swim.\n\nmaybe i should just invent a new english teaching, call it Pig and Dog English, see how it works out for those piggy minds. "
		},
		{
			"post_id": 87,
			"title": "blog and block",
			"date_published": 1465010670.345,
			"body": "they share many similar qualities, in the context of block for bitchain, block for minecraft, and here blog for zero.\n\nshould we think more about this blog for zero. the parallel seems not exact. blog, the traditional blog as we know, should be improved, such that this parallel can start to take more shape and make more sense. \n\nnot just a blog, maybe call it zlog. and we now need to define its necessary behavior and qualities.\n\nhttp://127.0.0.1:43110/131VZPcByNnYuDqmvivd43bJ58GRSEMPJV"
		},
		{
			"post_id": 86,
			"title": "coffee and woman",
			"date_published": 1465009413.915,
			"body": "when i see coffee, i think of woman. both are equally important. some call this association. some call it mental tunneling. to me that is just what it is. i do not know what to make out of it. the fact is we can not live without both. \n\ncoffee you drink for a while you start to want more, not the same kind of coffee but more other kinds, things similar to it but not coffee. but who is inventing new coffees? that is a new poeject i am working on, or at least going to work on. same is true for woman. \n\ncan we, as the creative species, create a new kind of thing that can serve the same purpose but fresh and beyond? the new w, yes that is a new project i am working on too. new coffee can wait but not new w. so here it is, let's get started now.\n\nhttp://127.0.0.1:43110/1Jp2ygR68v8hc8L7AoVpWETEHg6N4kDJit"
		},
		{
			"post_id": 85,
			"title": "the great divide",
			"date_published": 1465006728.831,
			"body": "so this morning i am sitting here, my maaileen sent me her photos.....together with her platoon they are walking along a beautiful large river, picking up garbages, taking photos of rivers and themselves, i said to her - waht a beautiful thing you did.\n\nthe river is beautiful, the woman is beautiful, her smile is beautiful, what they are doing is beautiful. and i have all the desire boiling, i want to walk along the river too, i want to love her, i want to fuk her, all these promises are what make our lives worthwhile.\n\nand tomorrow this time she is going to sit together with their city's mayor, receiving some kind of awards and i think and she knows it is a beautiful thing in many ways, a promise of more opportunities in many ways.\n\nyet the other day she said if she were not married, she would never consider marry again. she would just do what she loves - picking up garbage, teaching kids proper manner (the other day when i say those leud things to her in the night she sent back a slide she is working on - showing her lesson plan: good boys and bad boys), and moving up in her bank.\n\nso what lies in the future? could we ever even to meet? i am not sure and she might not care. yet we talk, day and night. what the fuk is going on here? clueless, don't care. \n\noh i love you my dear, this to her i just sent. talk about suspense....i will never have no clue what she will think about what i said.\n"
		},
		{
			"post_id": 84,
			"title": "walk away",
			"date_published": 1465002274.801,
			"body": "in the past i have always chosen to walk away, from things i feel unease, disgusting, being cheated (really this is no big deal, i cheated some times as well), wrong, unjust. i say that is just news. constantly i only hope to be more and become much more careful, i tell my wife and children and old folks be very careful whenever they are walking out of the door. i pretend to be a strong and tough guy, with dark and ugly outlook. i feel guilty i can not walk out together with them every time they have to do.  i tell myself there is a fate for everyone anyway, so whatever i do will not make a difference.\n\nbut now no more. with zero i tell you, if anyone, i mean anyone, fuk me and my family, he and whatever regime behind him will face a cause.\n\nso zero is a good thing. "
		},
		{
			"post_id": 83,
			"title": "zeroers are good folks",
			"date_published": 1465001137.157,
			"body": "you walk into a place and a few minutes later you have a clear feel. zero is a place of much interest, in many ways. \n\nfolks here are very openminded, kind very in general. in particular i think people here are being helpful while very tolerant, tolerant to errors, different opinions, wild things, lunacies. there is no question i have been from time to time talking nonsense, many times offensive probably mostly to women, indented that way. but i have not seen any curse or anger. so for that i say thank you.\n\nthat is a good sign. this way people are more willing to express and brainstorm. all the possible scenarios will be shown. much relieved, better prepared. i know right now in certain geographical locations, people can not freely express themselves, they dare not. not sure what bone is for. so some people just went boneless. not really a new species, been that way 5000 years. to this i do not know what to say except leave it alone and walk away. \n\nzero is good."
		},
		{
			"post_id": 82,
			"title": "what we think in the morning ",
			"date_published": 1464999908.737,
			"body": "morning is distinctively different from evening. in the morning i think about more serious things, in the evening i think about women, things gone wrong, and all kinds of fuks. \n\nzero is an interesting place, comparing to places like linkedin which i have an account, hundreds of contacts, yet feel that place almost like a graveyard. yes, exactly, i feel many places, such as linkedin, a graveyard. things there are phoney, unreal, a show without a show. can one really say anything there? not a single word, not any word would be proper. it is hard to imagine and create something like that, and even more amazing is something like that is very successful. if this is not something wrong than tell me what could be more wrong.\n\nin the morning i think of future, evening past. man lives from morining to evening, day in day out. 100,000 rounds. thinking that makes me only want to say well, what the hell.\n\nmorning and evening one theme is a perpetual, the business creation, that is for me anyway. our lives seem all serve a purpose, me is business. reviewing business is like appreciation of a woman. \n\neach morning has its own little incident, something that you get to know and feel warm. this morning i heard the news of great storm coming in the gold coast, that makes me feel soothing, a lifelike thing is coming, kind of things that make you feel things are real. "
		},
		{
			"post_id": 81,
			"title": "comparing to men, why more women are willing to have sex with robot ",
			"date_published": 1464958635.865,
			"body": "that is a question i have no fuking clue. teach me if you know why."
		},
		{
			"post_id": 80,
			"title": "could man marry a robot",
			"date_published": 1464958585.058,
			"body": "it is an open source question and program."
		},
		{
			"post_id": 79,
			"title": "towards a systematic solution to man's marriage problem",
			"date_published": 1464957492.329,
			"body": "the challenge for most men is severe - the world is running out of suitable women for marriage. in some part of the world it is happening already. we need a solution, soon.\n\nguys, any suggestion? "
		},
		{
			"post_id": 78,
			"title": "what if you can not find a perfect woman to marry",
			"date_published": 1464957123.851,
			"body": "unfortunately for more and more men, they will have to more and more to face such a situition: they simply can not find a woman that they are willing to marry to. what you should do? \n\nthere is at least one solution. but i will leave this topic for later discussion. i will leave it for your homework. there are probably more than one solution. so think harder. can i prove i have such a solution? yes, i am happily married now, certainly not because i am lucky and run into this woman now called my wife.\n\ncheers. "
		},
		{
			"post_id": 77,
			"title": "to what kind of a woman a man should marry to",
			"date_published": 1464954909.463,
			"body": "my first marriage works out ok in fact, lasting 15 years. my second is perfect, i regret only for the fact that i might have to go too soon for her. simply observe and think over these two marriages, i think i am pretty sure what woman is most suitable for a good marriage, at least for me.\n\noverall apparently it is a complex issue, but here are a few starting points, and by the way i will ask my son do exactly the same:\n\n- never marry a woman who has a strong personal agenda; only marry a woman who has no clue about what she wants ( i guess this is what chinese say a little woman, a small birdish woman); \n- never marry a woman who has a strong will; one of my gf before is like that, she has so strong a will that even today, i could not think of a sweet moment we spent time together, all i see in my mind is when she become so upset (do not even remember why she became so upset) that she was about to hit something, maybe me and i tell you i am all ready and prepared to absorb that, but instead she slaped her own face; at that moment i was absolutely sure this is not the woman i want to spend my life with; btw she went on to get into harvard; that explains why harvard is harvard, producing all kinds of things; thinking the grandfather of that guy who spent two years and two months in a pond in concord, thinking of the guy who was call unisomething; thinking of the guy who was so brilliantly famous in math yet commented so fuking stupid things about his colleaque;\n- never even spent a single minute with a woman whom you do not love physically; that is a waste of time, for both of you, particularly for her. this is a world with severe lack of women. you should not waste her time. no matter what kind of physical condition she has, she has absolutely no trouble finding a man who is willing to marry her; so leave her alone; keep hunting;\n- never marry a woman who does not want a child; i do not know what to say about this kind of woman; i simply walk away quietly;\n- never marry a woman who is too experienced in sexual intercourse and has too fond a memory about her first or second love; that fond memory will stick between you two. woman seems not care too much about this, but man does; i don't think you want to outperform every single night another man in her past. you have no fuking chance of winning this game; \n- have a second thought about a woman who spend a little too much. i guess it is not that critical, but i personally do not want to marry such a woman. i would rather my son's mother has some sense of value and investment and has a sense of family history and tradition; it takes time to grow a family, it takes time to grow wealth;\n- it is perfectly ok to marry a woman who is here for your status and wealth; what else a woman should look for from a man anyway; so dear, come on in, all the diners are on me; i am happy, honored, and one day i am happy to cook for you as well;\n- it is perfectly ok for a woman to say unkind things about your mother. do not take that personal. a man who loves his mother more than his wife is not a mature man. grow up first, then marry;\n\n\n\n\n"
		},
		{
			"post_id": 76,
			"title": "what would be a better blind dating game",
			"date_published": 1464877448.224,
			"body": "a hole is a hole, why the fuk need to connect it with a face?\n\nman is stupid and way too visual. a better blind dating should be completely blind, i mean woman and man only speak to each other but not see each other. when they are ready they enter a darm room. \n\nfor so many women light is a sin. let go the light, it would be so much a better world and beautiful life.\n\nfor man, it actually is the same - if you never ever will be able to see her face, in a room of darkness only sound can be fuking heard, what difference it will make. you will just as much enjoy.\n\nso we can build such as dating site - \n\nno photos. not even age or other parameters.\n\nyou can communicate through sounds and words. \n\nif you like each other, a special hotel of no light is ready for you. go, get the fuk out of life."
		},
		{
			"post_id": 75,
			"title": "how is our world",
			"date_published": 1464875942.709,
			"body": "the wold is fine. very fine. \n\nmany people worries about our world. they mostly worry because of the thing called economy. that is a farce. \n\neconomy, i tell you, is not that great a thing human invents. man just follows his own intuition, like he wants to eat and fuk, yes he also wants to self-servingly makes money. he calls that economy.\n\nhe does his best making money that is fine. but when everyone is doing soly that, when the whole country and the whole world celebrate soly that, that is something worth some worry.\n\nnow you can find some place in this world where economy is its soly goal, people pursue this goal regardless of nothing and everything. that is something that is worth some worry.\n\nso how is our world? \n\neconomically it is fine, among the finest of all time. but otherwise, in many ways, we are in deep deep shit."
		},
		{
			"post_id": 74,
			"title": "by the way, my mother never knew who i am",
			"date_published": 1464875649.947,
			"body": "it is a strangely true fact probably for most men. their mother never knew who they are. that is just a fact. \n\nhow could she, ever. man thinks like a man and woman never understands. man as a result can only pretend. in english there is this one accurate word called condescending. yes that is how a stand we can stand."
		},
		{
			"post_id": 73,
			"title": "man and his mother",
			"date_published": 1464875203.384,
			"body": "we chinese will say - niangde. that is what we utter when we face inevitable realities, for example, when our mother died, when become powerless, when we realize certain things are beyond us. and when in these situation, we think of her, our mother, but in a rather musing and powerless way.\n\nmother is woman. we respect her although we know she is limited, so limited in so many ways. but what we could do, we can only say that same word, niangde.\n\nthere are not many situations where man say that word. but when she died, what else you could say. \n\nman i tell you, this situation i will change. soon it will be different, because truthfully, one day soon, we will live forever. you can count on me for that."
		},
		{
			"post_id": 72,
			"title": "so safely speaking, who will be the first one who knows who i am",
			"date_published": 1464873848.711,
			"body": "some kind or version of google's alphadogs. it will probably easily recognizing the writing styles and making the connections of dots. and it will not tell you. it will just use what it knows for its advantage. in terms of what advantage it could take of, that depends on how goog thing evolve. \n\nso guys, i have long told you, googl will be the most dangerous enemy of zero. "
		},
		{
			"post_id": 71,
			"title": "why anonymity is a good thing",
			"date_published": 1464873632.303,
			"body": "for one, i do not have to pretend how smart i am. in fact i am pretty stupid, but if no one knows who i am, then i can just freely talk stupid. being stupid is fine here on zero.\n\nlike said, remain stupid. that is a good thing."
		},
		{
			"post_id": 70,
			"title": "thinking maaileen - a novel",
			"date_published": 1464872627.143,
			"body": "that would be a great name for my book of love, let's make a note and save that for our future reference."
		},
		{
			"post_id": 69,
			"title": "thinking maaileen",
			"date_published": 1464872382.877,
			"body": "that thing starts to annoy me. \n\nfor one, her behavior makes me feel unease in picking works suit for the situation, words suit for her description, particularly given her seemingly simple simplicity. that is annoying, a sense of lack of control, lack of power. man does not like that.\n\nman puts himself into this kind of endless and many times senseless games. does it wotth it. that is a wrong question. that is his nature, the nature of hunting and pursuing, yes the truth. as our grand master has long taught us - truth is woman. we pursue truth. that is our life."
		},
		{
			"post_id": 68,
			"title": "a game",
			"date_published": 1464870459.682,
			"body": "so who do you think who i am? sure you do not care, but just for the argument's sake, who i am?\n\ni may well work for an institution of some kind, buttons up to the 9th and 10th, talk like man, walk like a man, teach like a man, invest like a man, but all under wiht a typical leud mind. whne i see a woman you sure know what i am thinking, when i walk behind one you sure know what i am thinking. so who i am? \n\nit would be great if you tell me who i am.\n\nif zero works, then you do not know who i am. \n\nbut still, i want you to find out who i am.\n\nthat is why zero is more interesting. it promises such a game."
		},
		{
			"post_id": 67,
			"title": "miaileen",
			"date_published": 1464792873.882,
			"body": "two months into the game i am sure about some things about her and very unsure about some others about her. she makes me think about philosophy all the time. in particular she makes me think of hegel all the time. \n\nshe seems simple, yet she is extremely tough to be categorized into any one type. \n\nshe replies only selectively, and being unmistakenly quiet on some other probes and inquiries. yet she keeps the communication flows flawlessly, as if everything is appropriate and be what it should be.\n\nshe may well be the mephisterpheles, but unmistakenly she is not because she is completely self centered and absorbed in her own little affairs. that makes one feel unease at times and even disgusting momentarily.\n\nshe may well be a man, any man, 's terminator. \n\nnow she starts to become an interesting subject: what should be a man's strategy for an intriguing woman like maaileen?"
		},
		{
			"post_id": 66,
			"title": "thinking Freud",
			"date_published": 1464788784.104,
			"body": "freud is brilliant in his understanding about the power and position of sexual desire in man's life. it is foundamental in everyway. it sits at the foundation of man's body, mind, and being.\n\nman deeply awares and thinks about sex when he is young, may well before 7 years old. he knows it dearly even before he can dream. by intuition he knows where he should exert his manhood before he sees one. all female bodies in his life serve him that purpose everyday in his mind. scince proves man thinks about sex about 80 times every day. so it is a strange thing that woman typically thinks a leud man bad, and teacher (mostly female in elementary and middle school, unfortuately in this case) punishes boys with leud mind, although she knows in fact every man is just as leud no matter how he pretends and says.\n\nthat is probably why play has such an important role in our lives. people have to learn play the pretending games. we make up poem and plays. we celebrate shakespeare and fraud. we make all those games a human tradition, carry them from generation to generation. by learning to say an saying thousands of times we behave accordingly, believe accordingly, and embed it in our genes. we become a race of romantic thinking and language. we become human being.\n\nso while our loins burning we say poetic things and utter poetic sounds. they sound all too funny to some but arousing to some others. the most beautiful music in fact is so easy to make - i love you, a three word song of game.\n \n"
		},
		{
			"post_id": 65,
			"title": "i think one day i-phone will be categorized something like junk-food for mind",
			"date_published": 1464699873.861,
			"body": "do not believe it? let's see in 10 years."
		},
		{
			"post_id": 63,
			"title": "is intelligent phone a good thing or bad?",
			"date_published": 1464699680.503,
			"body": "for one thing, i do not like these phones. i do not use one. i use computers ok.\n\nkids use it much more now. would usuing i-phone make kids more stupid?"
		},
		{
			"post_id": 62,
			"title": "how long the skill of writing will last?",
			"date_published": 1464699422.543,
			"body": "given all the current monkey fingering technologies, it is a concern for many about our writing skill, how students in 10 years will use his hand, will writing be relevant? \n\nsurely everyone will need to speak more, fingering and gesturing more probably. does it matter?"
		},
		{
			"post_id": 61,
			"title": "technologically, guys, i tell you the biggest enemy of zero is google. i will show you why.",
			"date_published": 1464685208.165,
			"body": "coming soon.\nno, coming not very soon."
		},
		{
			"post_id": 60,
			"title": "i hate to imply politics....but could zero become a nation?",
			"date_published": 1464685107.563,
			"body": "ignore me. \\\n\nbut a united zero is enticing."
		},
		{
			"post_id": 59,
			"title": "should we consider zero-computer?",
			"date_published": 1464685031.537,
			"body": "yes, i am talking about a hardware play."
		},
		{
			"post_id": 58,
			"title": "so, who will have the biggest to lose if zeronet becomes one?",
			"date_published": 1464684807.652,
			"body": "everytjing on .com. particularly the big .com \n\nhere are a list of them - \n\n- facebook (it is probably the biggest loser when facing zero)\n- google \n- let's ignore yahoo, died anyway\n- apple will be very negatively influenced too\n"
		},
		{
			"post_id": 57,
			"title": "my official woman manifesto",
			"date_published": 1464682677.357,
			"body": "- i love you, my woman\n- you are the blessing of god\n- you bring us sons, i thank you\n- i invent good technology to show your beauty and my appreciation\n- i live and fight for you, till the end of my day."
		},
		{
			"post_id": 56,
			"title": "so, fuk it.",
			"date_published": 1464682116.019,
			"body": "this brings my thought back to the three fuks, and now i will go to one's office.\n\nhttp://127.0.0.1:43110/1LBzvbE9uFVY8A68bYJoTpDEC5vS8zsmNo/\n"
		},
		{
			"post_id": 55,
			"title": "and finally, woman.",
			"date_published": 1464681978.675,
			"body": "now, let's imagine bring in a woman reviewing what i have just said in the past 10 minutes. what would she say? she does not know but we know what she is going to say.\n\nso you see what i mean. woman. hehe."
		},
		{
			"post_id": 54,
			"title": "and finally, this brings up one thing.",
			"date_published": 1464681916.371,
			"body": "i must have missed something. what is that?"
		},
		{
			"post_id": 53,
			"title": "and this brings up the question of zeronet...",
			"date_published": 1464681597.4,
			"body": "how it would evolve? into what? how big? \n\ni do not think the so called freer expression makes too much a din. because it has been proven and backed up for and by 5000 years history, it will not make a difference. you want to teach lion think and do like a duck? the lion would just choose to sleep, no worry of any kind as long as food is quaranteed for the second day. "
		},
		{
			"post_id": 52,
			"title": "and this brings up the question of facebook...",
			"date_published": 1464681381.973,
			"body": "till today i have no clue why facebook becomes facebook we know today, huge and popular....isn't it just a blog with some user commenting each other functions? and we live through ages before facebook and we all have used things like foretune city, global village, even more fancy things like second life.\n\nso what makes facebook facebook? \n\nand when the guy runs across tiannanmen square the other day and shaking hands with quite a few others, i could not figure out this same one question, why facebook is what it is."
		},
		{
			"post_id": 51,
			"title": "this brings up a more fundamental question - what technology is for?",
			"date_published": 1464681161.967,
			"body": "i believe technology serves people, sure. but more accurately, technology is invented by man first to serve his immidiate need - i pretty sure when Ford built his first car he shows off that to his girl.\n\nand probably true for the facebook guy who (i venture to suggest) to put his gf on his thing."
		},
		{
			"post_id": 50,
			"title": "and one thing i know is, beauty really drives the ture innovation. to see my girl online, real time,  i will fight to get this thing done. it is not a matter of love, it is a matter of let beauty be appreciated and witnessed by the world.",
			"date_published": 1464680107.91,
			"body": "now you see how man can burst into flame....."
		},
		{
			"post_id": 49,
			"title": "my girl, my girl",
			"date_published": 1464679517.975,
			"body": "now whenever and whereever she is, in beautiful weather or bad, but always in great and beautiful dress of the utmost fashion, whemever and whereever, she send me her photos, with everyone in her life, make me together venture with her in a wonderful world....\n\ni know for sure she will not be my woman no matter what day, she is way too smart for that and knows her value and i do not have that kind of money she is used to in her way of life.....but just knowing her and seeing her is ok and enough. life is fine, fun, and me just being her fan."
		},
		{
			"post_id": 48,
			"title": "thank you, every daxia, if you could show me the way....",
			"date_published": 1464679401.638,
			"body": "http://127.0.0.1:43110/1MphWLNavEiWJSTiLd4NMs3Z5yqccESL8t"
		},
		{
			"post_id": 47,
			"title": "Would like to learn more....have a girl on the hook, would like to invite her to talk real time, but who could help to get a p2p video chat on zeronet? thank you so much...",
			"date_published": 1464678964.203,
			"body": "and this might be a difficult project, so i have put it on a dedicated zite - \n\nhttp://127.0.0.1:43110/1MphWLNavEiWJSTiLd4NMs3Z5yqccESL8t"
		},
		{
			"post_id": 46,
			"title": "this brings up an important topic - the relation of field and woman's trait",
			"date_published": 1464654047.833,
			"body": "my personal experience is that chinese girls that major in english are basically all bitches. the only usable holes are the ones that major in science."
		},
		{
			"post_id": 45,
			"title": "medical woman",
			"date_published": 1464618671.787,
			"body": "i have always been wondering about a woman who majors in medicine - with all those medical studies, do they have any feel left?"
		},
		{
			"post_id": 44,
			"title": "medical english",
			"date_published": 1464618399.323,
			"body": "it is only in this fuking place there is such a major invented that is called medical english. well, that is her major while in college. interesting, so that woud mean she knows all the man's body and parts and have studied those in details, not just physically, not just in one language, but in two. \n\nwould this form of education informing prepares her for sensible thinking or feeling or the other way around? should be careful here. there is a possibility of another kind, an extreme kind....should find out more."
		},
		{
			"post_id": 43,
			"title": "english is for love",
			"date_published": 1464618076.789,
			"body": "so i swim between two modes now - chinese i say the typical to keep her comfortable; but english, the dear english language, i use to fuse her mind and body with mine.....\n\nall man should learn english. that is a must. "
		},
		{
			"post_id": 42,
			"title": "as we going into the night....",
			"date_published": 1464617717.386,
			"body": "quiet all day, and now, all of a sudden, she comes, showing up, with beautiful photos, each one arousing my lion to the ceiling of the roof....my dear, how lovely the world you ahve made for me in this rather boring place, this room with 10 stories above and another 20 below...\n\ndear, you make me feel good. bottom up. "
		},
		{
			"post_id": 41,
			"title": "a few good fuks that i think is good for you",
			"date_published": 1464616115.454,
			"body": "- my fuk experience \nhttp://127.0.0.1:43110/18heQUQn3qURXw2Pjsqd1nK2XeaXg8cVCm/\n\n- doctor fuk\nhttp://127.0.0.1:43110/1LBzvbE9uFVY8A68bYJoTpDEC5vS8zsmNo/\n\n- what the fuk\nhttp://127.0.0.1:43110/1PEFzc3fHLVDdGxHLSnAxeLwD3ERwR1VGr/"
		},
		{
			"post_id": 40,
			"title": "coming soon....hot",
			"date_published": 1464613551.833,
			"body": "Blog post body"
		},
		{
			"post_id": 39,
			"title": "新项目 - 智能避孕套",
			"date_published": 1464601168.858,
			"body": "设计思路 - \n- 自动记录进出次数，等等；\n- 加入语音功能，可以考虑加入纳米音响\n- wifi功能，可以考虑未来实况转播\n\n希望大家踢踢意见，可以报名加入设计团队。需要志愿者 - \n\n- 女性20-40若干名，体验初步设计效果；"
		},
		{
			"post_id": 38,
			"title": "一直想写一本书，就叫做情人",
			"date_published": 1464587981.223,
			"body": "有人愿意赞助吗？如果有人愿意赞助，我就开始写。不敢说是世纪之作，但是对一个人如何生活，如何看女人，看家庭，搞事业，有巨大帮助。所涉及的主题 - \n\n- man and woman \n- manhood, and womenhood\n- dating, sex\n- love\n- my women: case studies, my love to some of them, and their love to me??? (in fact their love to themselves, i am very sure)\n- woman in man's life\n- woman's role in man's startup and businesses\n- man vs nature\n- man vs society\n- man and other men\n- man vs man himself\n- philosophy: being a man means and feels like what\n- history: both China and US (I have studied in US for so long, so I know her very well)\n- right and wong, and related issues \n\n需要赞助金额 - 10 bitcoins. 大家可以一点点donate, 我就能开始写。计划大概10万字，我注册个新博客，专门为此写作用。本博客的地址应该就是合法的而比特币地址。（你将右上角的0左拉，就能出现“Donate”选项。）\n\n1CpQfwShA6D8kAc4o3tu46GK1i89UtGP2o\n\n\n\n\n\n"
		},
		{
			"post_id": 37,
			"title": "is this a good idea?",
			"date_published": 1464324829.178,
			"body": "http://127.0.0.1:43110/12BYDUaA1zjg13r7yfn4x4jg4DehqEBF8b"
		},
		{
			"post_id": 36,
			"title": "why it is called 阴茎 but not 阳茎？",
			"date_published": 1464324768.815,
			"body": "Blog post body"
		},
		{
			"post_id": 35,
			"title": "a good place to start",
			"date_published": 1464311803.273,
			"body": "http://127.0.0.1:43110/18fsya1a8MgXfN6wF2nsLo8fDiqZ3A3b1T"
		},
		{
			"post_id": 34,
			"title": "Strategy",
			"date_published": 1464311400.583,
			"body": "as for doing everything to do it well we need a strategy. for woman, for business, for everything that matters dearly in our life, we need a good strategy. in fact all of these are very similar in terms of stratgizing. it includes the following critical elements - \n1. the nature of your object (speak of object, yes we are object oriented here, too); meaning its qualities. no entity can change its inner quality. woman is woman, can never think like a man; to find the nature of a being is not that difficult, just listen and observe;\n2. be and not be - the key is let it be;\n3. with or without - the key is to assume without, and always live with; "
		},
		{
			"post_id": 33,
			"title": "中文需要进化，从阴道这个词开始",
			"date_published": 1464168051.299,
			"body": "本来是美的东西，为什么他妈的说胡来这么龌龊？语言的问题。\nhttp://127.0.0.1:43110/18fsya1a8MgXfN6wF2nsLo8fDiqZ3A3b1T"
		},
		{
			"post_id": 31,
			"title": "男人的自信从哪里来？",
			"date_published": 1464167888.049,
			"body": "阴道！"
		},
		{
			"post_id": 30,
			"title": "我的宝贝上电视了",
			"date_published": 1464167530.577,
			"body": "她醉了。我也假装醉了。她高兴的化妆都忘了，上去了。可爱的女人。哪一天走进她的卧室呢？"
		},
		{
			"post_id": 29,
			"title": "如何对付行骗的女人？",
			"date_published": 1464136679.418,
			"body": "不知道社会会变成什么样。但是今天骗人的人里头至少有一般是女人。把孩子从街上暴走挖肝卖肾的大多也是女人。\n\n看好你的孩子。这是我唯一能告诫的。"
		},
		{
			"post_id": 28,
			"title": "文字比阴茎更有力",
			"date_published": 1464136679.315,
			"body": "但是文字碰上钱就是傻逼。"
		},
		{
			"post_id": 27,
			"title": "最狡猾的女人",
			"date_published": 1464078074.027,
			"body": "1.她对你的猥琐并不介意；（这个信号及其危险！）\n2.她选择性的给你回复；\n3.她回复所说的都是关于她的业绩，牛逼成就；\n4.最危险的是她炫耀她的财富；\n\n碰上这种女人怎么办？\n"
		},
		{
			"post_id": 26,
			"title": "交友网站设计",
			"date_published": 1464078073.844,
			"body": "twoo/badoo一类是垃圾，主要是因为骗子太多，男人太多，女人太少。如何解决？bot行吗？\n\n需要一种新的交友逻辑。"
		},
		{
			"post_id": 25,
			"title": "很少有的感动 - 微暖半夏 ",
			"date_published": 1464077712.361,
			"body": "\"微暖半夏\"人在青岛，网上今天第一次聊天，问她怎么能帮我。可爱的女人。她又能帮我什么呢。她让我想起我的第一个爱我的女孩，也是青岛人。清清楚楚记得她家，她走过的路。但是已经记不清她的容貌了。\n "
		},
		{
			"post_id": 24,
			"title": "我被女人骗过吗？",
			"date_published": 1464077712.275,
			"body": "被骗过一次。"
		},
		{
			"post_id": 23,
			"title": "我信不信真爱？",
			"date_published": 1464076149.421,
			"body": "当然信。每个人都该信。"
		},
		{
			"post_id": 22,
			"title": "高手指导如何追你想要的女人",
			"date_published": 1464074578.985,
			"body": "支付方法-比特币；\n首付一半；成功后一半；\n概念定义 - 成功是指她愿意和你见面；能不能上床那要看你的人品；\n首付 - 10比特币；\n我可以替你追，以你的名义；\n\n我的座右铭 - 文字比阴茎更有力。\n我的方法 - 草拟吗的我白天追，晚上追，英语追，中文追，各种甜言蜜语没有我不精通的。\n说明 - 我为什么提供这个服务？因为： \n1）我实在看不下去太多的傻逼对女人束手无策，还有所谓单相思10年的；2）追女人是乐趣；上床？我没兴趣。女人太多。"
		},
		{
			"post_id": 21,
			"title": "this is a good topic site",
			"date_published": 1464074386.645,
			"body": "http://127.0.0.1:43110/1KFS9S1V5ekuUJK6kAFaU361W3oMECuAdc/"
		},
		{
			"post_id": 20,
			"title": "our conversation continues ",
			"date_published": 1463988591.072,
			"body": "now we engage day and night -- when she is in gym she sent me those sexy photos; in the morning right now she sent me photos of her breakfast; a girl with good tastes, a girl that would have made a wonderful wife.\n\noh i miss you my dear goddess"
		},
		{
			"post_id": 19,
			"title": "NewEnglish",
			"date_published": 1463982862.138,
			"body": "why not we set out to create a new english, that incoroprate Chinese. this will make world people easier to learn chinese. \n\nhttp://127.0.0.1:43110/1AK1Z2iQ2wtYtt62axV5X4ZUL2asoKKTtJ"
		},
		{
			"post_id": 18,
			"title": "NewChinese",
			"date_published": 1463982747.584,
			"body": "http://127.0.0.1:43110/14etvK6TXBcaapsDVcUDctX1W8DrEAHT8M/"
		},
		{
			"post_id": 17,
			"title": "有没有人感兴趣设计一个新的拼音体系？",
			"date_published": 1463975458.239,
			"body": "for this task i do not think chinese who do not speak english could think or do. got to be someone who has ventured beyond chinese. if you are interested, let's form a team, do it now, and save trouble for the zillions in the future."
		},
		{
			"post_id": 16,
			"title": "从我的蚊子你看到我的愤怒。是因为拼音吗？那你还太不了解我们的文化。",
			"date_published": 1463975458.153,
			"body": "Blog post body"
		},
		{
			"post_id": 15,
			"title": "一个连自己蚊子都不能改进的民族的前途",
			"date_published": 1463975350.948,
			"body": "傻逼，你自己香。"
		},
		{
			"post_id": 14,
			"title": "傻逼们，就没人说说如何改进拼音？中国人的品行一览无遗",
			"date_published": 1463975174.55,
			"body": ""
		},
		{
			"post_id": 13,
			"title": "胸的大小和星宇的关系（我曹拼音你码）",
			"date_published": 1463974652.348,
			"body": "胸小的女人星宇强。\n胸大的女人星宇小。"
		},
		{
			"post_id": 12,
			"title": "叫什么名字的女人最容易和你上床？",
			"date_published": 1463974652.218,
			"body": "据我的实际经验观察，叫Dana的女人最容易上床。\n\n叫Nancy的女孩最讨人喜欢，中等容易。\n\n叫Kathy的最傻逼，最不容以上床。\n\n"
		},
		{
			"post_id": 11,
			"title": "英语为甚么比中文更浪漫？",
			"date_published": 1463971919.74,
			"body": "这是我的发现。如果我对一个女人说我爱你，她会说我是傻逼。但是如果我说i love you，这傻逼马上不同。至少我简单用i love you上了5个陌生女人的床。\n\n我槽！生活就是这么简单精彩。"
		},
		{
			"post_id": 10,
			"title": "娶老婆 - 变成一对傻逼 ",
			"date_published": 1463971919.511,
			"body": "90%的男人老婆不合适，因为他没有选择，因此也不知道什么合适。到明白过来点，fucking too late. 一对傻逼。娶老婆的标准应该是什么？"
		},
		{
			"post_id": 9,
			"title": "Maaileen - 我的亲爱的宝贝",
			"date_published": 1463964711.024,
			"body": "now this is the woman whom i have been seducing, whom i have been knowning so far for about 1 month, whom i have never met (will we ever meet? probably yes, but really who cares). but she is real in every sense. she is in my life. she is more real than millions of others who fucking walking about me every day but do not really care who you are. she cares, at least to some degree.\n\nso the game is on, and will continue.\n\nthis morning, she talk about piano, which she plays.  that is a good direction, that is where we start to walk into one corner of her heart beneath her beautiful body. there, we will poke and find out more about her life. she talks about Richard Clayderman, hehe, the pianist who knows how to market himself with a pretty soso technique. the fact he is attractive to her, says a lot about her true quality - genuine, but shallow."
		},
		{
			"post_id": 8,
			"title": "你的人生如何构架？",
			"date_published": 1463963902.843,
			"body": "大多数人浑浑噩噩。不是他们想要这样，而是1）他们没意识到；2）他们不知如何设计人生。每个人生最终不同，你如何设计？女人在你人生中扮演什么样的角色？"
		},
		{
			"post_id": 7,
			"title": "pp3 的挣钱攻略",
			"date_published": 1463963733.389,
			"body": "http://127.0.0.1:43110/1kYJerxkcAGsmZmaXCydktVw4YciRK1NJ"
		},
		{
			"post_id": 6,
			"title": "New blog post - there is fucking no title for this one.",
			"date_published": 1463733186.792,
			"body": "有些东西，你心里和理智上不谢一股（我曹拼音你码，没几个能一次大对的；但这也是人工智能可以更多应用的机会哦），但是还是梦寐以求。女人就是一种。 \n\n你几岁想要女人？我6岁。你肯定也产不多。可你得到女人十几岁？我是22岁。所以我是苦逼啊。今天想起来，你喜欢你的初次对象吗？大多数人会一笑，呵呵。所以大概我们不只是哭比，也是傻逼啊。\n\n没错，男人女人就是一堆傻逼。\n\n"
		},
		{
			"post_id": 5,
			"title": "a note here for you",
			"date_published": 1463724953.871,
			"body": "目前本软件好像中文支持上有些问题，如果标题是中文，访问点击标题会报错，也无法留言。所以我不时会留几个英文标题的帖子，用于交流用。\n\n如果你有好的追女人的经验，请分享。男人太苦逼，需要互助。"
		},
		{
			"post_id": 3,
			"title": "一个总结，和现在我正在追的女人",
			"date_published": 1463705146.44,
			"body": "女人？呵呵。\n\n女人很聪明。女人很愚蠢。从古至今，没有一个哲学家喜欢过女人。尼采终生没有女人，不是没尝试过，他疯狂追过他的一个学生。他的名言就是 - 真理就是女人。\n\n女人算数都很好。她精准地知道她的身体的分量，值多少钱。你要明白这一点。这对于设计攻略很重要：什么你能得到，如何得到。那些该得到，那些不要妄想。\n\n大道理以后有机会慢慢说吧。说说我现在追的，她名字叫Maaileen. 经典的美女，40岁了，但是20岁的身材容貌。老公是地方上的官，自己在国企工作，社交激光。30-40的女人最有味道，这个你如果还不明白，那就问问身边有点经验的人。女人少的男人才会喜欢20岁的。味道当然不同，但是20岁的性情生涩，对男人没什么感觉。反过来男人的体验也就打折扣。\n\n白天就是简单的问候，像是普通的同事。但是晚上，在线，我就会慢慢加一些重口味，比方亲亲，抱抱，想你，夜色的美丽，你就像是漫天的群星一类，这些慢慢渗透在她的头脑里，会是洋洋的感觉。对女人，要有耐心，慢慢来。你演过泡菜吗？一个道理，发酵需要时间。欣赏她的美丽，真的是很美丽。她并不回应我的暧昧的蚊子。沉默。沉默。\n\n沉默有两种可能。一种是她不感兴趣，甚至心理很恼火，有这种傻逼女人。这种傻逼你最好别理。但是也有这样的女人，她们内心丰富渴望的多。沉默是一种认可。如何判断？简单。看事后。如果第二天，她回应你，还是像普通的同事，好像什么都没发生，那就ok楽。沉默就是默认。你就继续。\n\n女人，我亲爱的。\n\n"
		},
		{
			"post_id": 2,
			"title": "女人攻略思路",
			"date_published": 1463642279.272,
			"body": "本博客专门研究如何追女人。40年生涯，感慨太多。成功了一些，失败太多。离了婚，又结婚。形形色色。人生乐趣颇多。\n\n男人难。随着世界的演变，未来对大多数男人是灾难，除非你喜欢机器女人。（本人正在研制机器女人，希望组建团队，这是个不小的工程）。\n\n我争取每日更新。\n\n"
		}
	]
}