{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1534470841,
			"title": "Why Zeronet will succeed ...",
			"body": "The \"internet\" as we know it is a scam , every PC and phone since 2011 has a built in HARDWARE backdoor ... I have data deleted on my PC without my knolledge or permission regularly .. The internet\nis well policed and dissident voices are routinely kept quiet , even the TOR network was built with Govt money I hear .. So we backup data to offline drives and keep on speading dissident info , only Peer 2 Peer networks will survive and zeronet has a fighting chance of going mainstream , it's green now but as it's userbase increases so will it's utility . I for one will only consider IPFS and P2P networks as options for the future !",
			"added": 1534470840
		},
		{
			"topic_id": 1534536197,
			"title": "How do I \"Sticky\" a topic/ post ?",
			"body": "Just cloned the site , now idea how to get a sticky post going , anyone know ?",
			"added": 1534536195
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1534536197_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer": [
			{
				"comment_id": 1,
				"body": "and then bingo post something and it works ,,, sheesh",
				"added": 1534536233
			},
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_435_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @vaerospace hi, how does it appear when it is not working? Because it works for me.What about trying to open (0) menu on ZeroTalk and click \"Rebuild\" button, is it good idea? I remember it once fixed an issue i had with some zite.\n\nyea posted and arb post and it loaded (this post) just cloned the site and am trying to figure out how to \"sticky\" a topic ?",
				"added": 1534537761
			},
			{
				"comment_id": 4,
				"body": "> [vaerospace](#comment_3_1Kh3qLdTH2QKewUb6cWZa2dMveMT5EcVer): yea posted and arb post and it loaded (this post) just cloned the site and am trying to figure out how to \"sticky\" a topic ?\nVaerO talk\nyou can find my clone and reply here :\nhttp://127.0.0.1:43110/1JfC6xjYNkM4UdzJRMKbrywM5ugKdPAo8V/",
				"added": 1534537823
			}
		],
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 2,
				"body": "Jones is known CIA / stratfor operation and zionist protector ...",
				"added": 1534536321
			}
		]
	},
	"comment_vote": {}
}