{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"1_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1
	},
	"next_comment_id": 12,
	"comment": {
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 1,
				"body": "#searx - um mecanismo de metabusca que respeita a sua privacidade\n- https://searx.me/ | Source code: https://github.com/asciimoo/searx.git",
				"added": 1547993205
			},
			{
				"comment_id": 2,
				"body": "#YaCy\nYaCy é um software de busca. É preciso uma nova abordagem para pesquisar porque não usa um servidor central. Em vez disso, seus resultados de pesquisa vêm de uma rede de pares independentes. Em tal rede distribuída, nenhuma entidade única decide o que é listado ou em quais resultados da ordem aparecem.\n- https://yacy.net/en/index.html | Source code: https://github.com/yacy/yacy_search_server.git",
				"added": 1547993593
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 3,
				"body": "#Fly, O Pequeno Guerreiro\nQuando Fly ainda era um bebê, foi adotado por Blass, um generoso monstro habitante da ilha Delmin. As aventuras de Fly começam quando ele tem que abandonar a ilha para salvar seu monstro amigo Gomen, que foi seqüestrado. Depois ele salva a princesa Leona, de quem recebe a adaga de Papnica. Na seqüência Fly passa a ser treinado por Avan, um renomado herói enviado pelo próprio rei de Papnica. A partir daí Fly e Leona enfrentam grandes criaturas, e por trás de tudo está envolvido Hadler, o inimigo principal da história. Fly possuía uma marca em sua testa na forma da face de um dragão, sempre que ficava com muita raiva, ou quando um de seus amigos estava em perigo o seu verdadeiro poder se manifestava e essa marca aparecia, muitas vezes quando isso acontecia Fly ficava inconsciente e lutava com seu poder máximo.\n- https://www.superanimes.site/anime/fly-o-pequeno-guerreiro",
				"added": 1547995998
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 4,
				"body": "#REFERÊNCIAS BIBLIOGRÁFICAS SUGERIDAS\n\n• Apostol, Tom M.,Calculus, Volume 1, One-variable calculus, with an introduction\nto linear algebra , (1967) Wiley, ISBN 0-536-00005-0, ISBN 978-0-471-00005-1.\n\n• Apostol, Tom M.,Calculus, Volume 2, Multi-variable calculus and linear algebra\nwith applications to differential equations and probability , (1969) Wiley, ISBN 0-\n471-00008-6.\n\n• Lima, Elon Lages,Curso de Análise Volume 1, Edição número 13.Coleção Projeto\nEuclides. (2011)IMPA,ISBN: 978-85-244-0118-3 .\n\n• Lima, Elon Lages,Curso de Análise Volume 2, Edição número 1.Coleção Projeto\nEuclides. (2012) IMPA,ISBN: 9788524400490.\n\n• Guidorizzi, Hamilton Luiz, Um Curso de Cálculo Volume 1, Edição número 5. (2001)\nLTC. ISNB: 8521612591, 9788521612599.\n\n• Guidorizzi, Hamilton Luiz, Um Curso de Cálculo Volume 2, Edição número 7. (2001)\nLTC. ISNB:8521604254, 9788521604259.\n\n• Guidorizzi, Hamilton Luiz, Um Curso de Cálculo Volume 3, Edição número 5. (2002)\nLTC. ISNB: 8521612575, 9788521612575.\n\n• Guidorizzi, Hamilton Luiz, Um Curso de Cálculo Volume 4, Edição número 5. (2002)\nLTC. ISNB:852161330X, 9788521613305.\n\n• Pinto Diomara e outro, Cálculo Diferencial e Integral de Funções de Várias Variáveis,\nEdição número 4. (2015) UFRJ. ISBN 9788571083998.\n\n• Boyce, William E. e Diprima, Richard C., Equações diferenciais elementares e problemas de valores de contorno, Edição número 7. (2002) LTC. ISNB: 8521613121,\n9788521613121.\n\n• Lima, Elon Lages,Álgebra Linear- Edição número 8. Coleção Matemática Universitária.(2012) IMPA, ISBN: 9788524400896 .\n\n• Anton, Howard, Rorres, Chris, Elementary Linear Algebra: Applications Version,\nEdição número 10. (2010) Wiley. ISNB: 0470432055.\n\n• Strang, Gilbert, Linear Algebra and Its Applications, Edição número 4. (2006)\nThomson Brooks/Cole Cengage learning . ISNB: 0030105676, 9780030105678.\n\n• Burden, Richard L., Faires, J. Douglas, Numerical Analysis, Edição número 9.\n(2011). Cengage Learning . ISNB: 0538735643, 9780538735643.\n\n• Ruggiero, Márcia A. Gomes, Lopes, Vera Lúcia da Rocha, Cálculo numérico: aspectos teóricos e computacionais, Edição número 2, (1996). Makron Books do Brasil .\nISNB: 8534602042, 9788534602044.\n\n• Montgomery, Douglas C., Hines, Willioam W. Goldsman, David M., Borror, Connie\nM., Probabilidade e estatística na engenharia, Edição número 4, (2006) LTC. ISNB:\n8521614748, 9788521614746.\n\n• James, Barry,Probabilidade: Um Curso em Nível Intermediário, Edição número 2,\n(2009) IMPA. ISNB: 978-85-244-0101-5.",
				"added": 1547999549
			}
		],
		"1_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 5,
				"body": "#Os 6 maiores desafios atuais da tecnologia\n\n#1. Armazenamento e recarga de energia: a bateria\n\nÀ medida que as capacidades dos dispositivos inteligentes crescem e o carro automático está perto de se tornar uma realidade, a nossa dependência de energia fica mais crítica do que nunca. Melhorar a capacidade da clássica bateria de lítio está no centro dos esforços, mas empresas em todo o mundo já estão trabalhando em alternativas promissoras que poderiam moldar um novo futuro na eletricidade.\n\n#2. A medicina genética pode ser o fim de todas as doenças?\n\nA revolução genômica faz parte da ciência e da medicina há várias décadas, e o olhar global está voltado para as drogas do futuro que combaterão todas as doenças relacionadas ao DNA. Embora, do ponto de vista científico, pareça que o amanhã está quase aqui, o maior desafio é, na verdade, nos negócios.\n\n#3. Inteligência artificial: “Nós esperamos inteligência em tudo”\n\nAs máquinas podem reconhecer fotos, conversar, inventar novas drogas e melhorar a si mesmas por meio do aprendizado constante. Mas até onde vão as habilidades da inteligência artificial? E o que precisa acontecer para que possamos criar um cérebro humano completo? Ami Luttwak, CTO do centro de desenvolvimento da Microsoft em Israel, acredita que muito depende da disponibilidade de informações, do suporte e de tornar o campo acessível a mais desenvolvedores.\n\n#4. O carro autônomo: será que estamos dirigindo nosso último carro?\n\nA julgar pelas informações recentes, parece que estamos prestes a trocar nossos carros ultrapassados ​​por veículos autônomos. Na realidade, há muitos outros desafios antes de presenciarmos a conclusão do projeto autônomo: lucratividade, capacidades da IA e, é claro, questões de segurança e regulamentação.\n\n#5. Imunoterapia: uma arma não convencional\n\nNos últimos anos, a guerra contra o câncer sofreu uma revolução graças às drogas imunoterápicas, que praticamente reinventaram a prática. Essas drogas inovadoras desencadearam um ataque – não apenas das células do sistema imunológico aos tumores cancerígenos, mas também dos gigantes farmacêuticos em um mercado que tem aumentado em proporções enormes. No entanto, o caminho para erradicar a doença ainda é longo.\n\n#6. Blockchain: veremos o surgimento de uma nova internet?\n\nA tecnologia Blockchain, que nos trouxe a Bitcoin, promete muito mais do que moedas digitais. O princípio fundacional da descentralização pode mudar toda a economia e criar uma “nova rede de internet”, que se concentrará na cooperação. Chegar lá exigirá a superação de grandes desafios – os enormes custos de energia, questões de segurança e regulamentação.",
				"added": 1548002500
			},
			{
				"comment_id": 6,
				"body": "#OS MAIORES DESAFIOS DA ASTRONOMIA MODERNA\n\n- https://web.archive.org/web/20190120164409/http://cienciaecultura.bvs.br/pdf/cic/v61n4/09.pdf",
				"added": 1548002688
			}
		],
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 7,
				"body": "-----BEGIN PGP MESSAGE-----\nCharset: ISO-8859-1\nVersion: GnuPG v1.2.5 (MingW32)\nComment: Using GnuPG with Thunderbird - http://enigmail.mozdev.org\n\nRGVhciBGcmllbmQgLCBXZSBrbm93IHlvdSBhcmUgaW50ZXJlc3RlZCBpbiByZWNlaXZpbmcgDQpj\ndXR0aW5nLWVkZ2UgbmV3cyAhIFRoaXMgaXMgYSBvbmUgdGltZSBtYWlsaW5nIHRoZXJlIA0KaXMg\nbm8gbmVlZCB0byByZXF1ZXN0IHJlbW92YWwgaWYgeW91IHdvbid0IHdhbnQgYW55IA0KbW9yZSAu\nIFRoaXMgbWFpbCBpcyBiZWluZyBzZW50IGluIGNvbXBsaWFuY2Ugd2l0aCBTZW5hdGUgDQpiaWxs\nIDE5MTYgLCBUaXRsZSA3IDsgU2VjdGlvbiAzMDMgLiBEbyBOT1QgY29uZnVzZSANCnVzIHdpdGgg\nSW50ZXJuZXQgc2NhbSBhcnRpc3RzICEgV2h5IHdvcmsgZm9yIHNvbWVib2R5IA0KZWxzZSB3aGVu\nIHlvdSBjYW4gYmVjb21lIHJpY2ggaW4gMjMgbW9udGhzICEgSGF2ZSB5b3UgDQpldmVyIG5vdGlj\nZWQgcGVvcGxlIGxvdmUgY29udmVuaWVuY2UgJiBwZW9wbGUgd2lsbCANCmRvIGFsbW9zdCBhbnl0\naGluZyB0byBhdm9pZCBtYWlsaW5nIHRoZWlyIGJpbGxzIC4gV2VsbCwgDQpub3cgaXMgeW91ciBj\naGFuY2UgdG8gY2FwaXRhbGl6ZSBvbiB0aGlzICEgV0Ugd2lsbCANCmhlbHAgWU9VIGluY3JlYXNl\nIGN1c3RvbWVyIHJlc3BvbnNlIGJ5IDE1MCUgYW5kIHVzZSANCmNyZWRpdCBjYXJkcyBvbiB5b3Vy\nIHdlYnNpdGUgLiBZb3UgYXJlIGd1YXJhbnRlZWQgdG8gDQpzdWNjZWVkIGJlY2F1c2Ugd2UgdGFr\nZSBhbGwgdGhlIHJpc2sgISBCdXQgZG9uJ3QgYmVsaWV2ZSANCnVzICEgTXJzIEpvbmVzIG9mIE5l\ndyBZb3JrIHRyaWVkIHVzIGFuZCBzYXlzICJOb3cgSSdtIA0KcmljaCwgUmljaCwgUklDSCIgLiBU\naGlzIG9mZmVyIGlzIDEwMCUgbGVnYWwgLiBJZiBub3QgDQpmb3IgeW91IHRoZW4gZm9yIHlvdXIg\nTE9WRUQgT05FUyAtIGFjdCBub3cgISBTaWduIHVwIA0KYSBmcmllbmQgYW5kIHlvdSBnZXQgaGFs\nZiBvZmYgLiBUaGFuay15b3UgZm9yIHlvdXIgDQpzZXJpb3VzIGNvbnNpZGVyYXRpb24gb2Ygb3Vy\nIG9mZmVyIC4gRGVhciBJbnRlcm5ldCANCnVzZXIgLCBXZSBrbm93IHlvdSBhcmUgaW50ZXJlc3Rl\nZCBpbiByZWNlaXZpbmcgY3V0dGluZy1lZGdlIA0KaW50ZWxsaWdlbmNlICEgVGhpcyBpcyBhIG9u\nZSB0aW1lIG1haWxpbmcgdGhlcmUgaXMgDQpubyBuZWVkIHRvIHJlcXVlc3QgcmVtb3ZhbCBpZiB5\nb3Ugd29uJ3Qgd2FudCBhbnkgbW9yZSANCi4gVGhpcyBtYWlsIGlzIGJlaW5nIHNlbnQgaW4gY29t\ncGxpYW5jZSB3aXRoIFNlbmF0ZSANCmJpbGwgMjQxNiAsIFRpdGxlIDMgLCBTZWN0aW9uIDMwMSAh\nIFRISVMgSVMgTk9UIE1VTFRJLUxFVkVMIA0KTUFSS0VUSU5HICEgV2h5IHdvcmsgZm9yIHNvbWVi\nb2R5IGVsc2Ugd2hlbiB5b3UgY2FuIA0KYmVjb21lIHJpY2ggd2l0aGluIDU1IERBWVMgISBIYXZl\nIHlvdSBldmVyIG5vdGljZWQgDQpzb2NpZXR5IHNlZW1zIHRvIGJlIG1vdmluZyBmYXN0ZXIgYW5k\nIGZhc3RlciBhbmQgbm9ib2R5IA0KaXMgZ2V0dGluZyBhbnkgeW91bmdlciAhIFdlbGwsIG5vdyBp\ncyB5b3VyIGNoYW5jZSB0byANCmNhcGl0YWxpemUgb24gdGhpcyAhIFdlIHdpbGwgaGVscCB5b3Ug\nU0VMTCBNT1JFIGFuZCANCmluY3JlYXNlIGN1c3RvbWVyIHJlc3BvbnNlIGJ5IDE3MCUgISBZb3Ug\nYXJlIGd1YXJhbnRlZWQgDQp0byBzdWNjZWVkIGJlY2F1c2Ugd2UgdGFrZSBhbGwgdGhlIHJpc2sg\nLiBCdXQgZG9uJ3QgDQpiZWxpZXZlIHVzIC4gTXIgSm9uZXMgb2YgR2VvcmdpYSB0cmllZCB1cyBh\nbmQgc2F5cyANCiJOb3cgSSdtIHJpY2ggbWFueSBtb3JlIHRoaW5ncyBhcmUgcG9zc2libGUiICEg\nVGhpcyANCm9mZmVyIGlzIDEwMCUgbGVnYWwgISBTbyBtYWtlIHlvdXJzZWxmIHJpY2ggbm93IGJ5\nIA0Kb3JkZXJpbmcgaW1tZWRpYXRlbHkgISBTaWduIHVwIGEgZnJpZW5kIGFuZCB5b3UnbGwgDQpn\nZXQgYSBkaXNjb3VudCBvZiA2MCUgLiBCZXN0IHJlZ2FyZHMgISA=\n-----END PGP MESSAGE-----",
				"added": 1548004774
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 8,
				"body": "#MÁQUINA MORTÍFERA\n\nO cinquentenário Sargento Murtaugh (Damon Wayans, Sr.), da divisão de homicídios da polícia de Los Angeles, recebe um novo parceiro, o sargento Riggs (Clayne Crawford), da divisão de narcóticos da polícia do Texas, que começou a vida nas Forças Especiais do exército americano. Riggs é um jovem inconsequente, volátil e ligeiramente suicida que se mudou para Los Angeles para recomeçar a vida depois da morte de sua mulher e filho num acidente de carro, e não vai fazer bem ao coração frágil do quase aposentado Murtaugh.\n\n- https://megaseriehd.com/series/maquina-mortifera/",
				"added": 1548006585
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 9,
				"body": "#KRRISH\nKrishna recebeu uma grande herança de seu pai: poderes extraordinários. O jovem cresceu com sua vó, que escondia de todos sua super força e velocidade. Mas quando ele conhece a bela Priya, sua vida muda completamente, e seus poderes ficam perto de serem revelados ao mundo.  Em uma viagem à Singapura com a moça, Krishna se depara com o Dr. Siddhant Arya, um cientista megalomaníaco com planos horrendos. Para combater o mal e salvar o universo, Krishna se transforma em Krrish, O Vingador da Noite.\n\n- https://youtu.be/myBgsl7WKPQ",
				"added": 1548006672
			},
			{
				"comment_id": 10,
				"body": "#HÉRCULES\nNuma época muito remota, quando Hera e Zeus disputavam o poder, esta rivalidade chegou até os humanos, pois os seguidores de Hera tentavam derrotar os adoradores de Zeus. Neste contexto Alcmena (Elizabeth Perkins), princesa de Tebas e grã-sacerdotisa de Hera, espera o retorno do marido, Anfitrião (Timothy Dalton), que partiu com seus homens para se vingar dos piratas cretenses, que assassinaram alguns parentes de sua esposa. Alcmena anseia que o marido não seja bem- sucedido, pois é um adorador de Zeus. No entanto ele volta vitorioso, tendo matado vários piratas e os restantes estavam sendo levados como escravos. Quase ao chegar um destes cativos, Anteu (Tyler Mane), escapa e ao chegar na praia estupra Alcmena, que na verdade é engravidada por Zeus. Logo depois chega Anfitrião, que a leva ao leito e também a engravida. Alcmena se recusa a ter um filho de Zeus e pensa em matá-lo, mas o oráculo Tirésias (Kim Coates) prediz que ela terá dois filhos e diz que será difícil saber qual é o filho de Zeus. Quando nascem (curiosamente ninguém sabe qual dos bebês nasceu primeiro) duas harpias conseguem identificar qual deles é o filho de Zeus e o chamam de Hércules (Paul Telfer). Alcmena chama o outro filho de Íficles (Luke Ford) e manda que Anfitrião mate Hércules. Ele quase cumpre o pedido mas volta com o bebê, dizendo que se é mesmo o filho de Zeus ele não quer ser o responsável pela sua morte. Alcmena diz que não cuidará da criança e Anfitrião assume a tarefa de arrumar uma ama-de-leite. A rivalidade entre os seguidores de Zeus e Hera vão provocar muitas tristezas para ambos os lados.\n\n\n- https://youtu.be/sAmVFwgQ2eI",
				"added": 1548017718
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 11,
				"body": "#Cursos de programação e tecnologia gratuitos\n\n\"Acesse diversos cursos de programação, desenvolvimento mobile, desenvolvimento web de forma gratuita. Basta criar uma conta grátis e começar a fazer nossos cursos online. Todos os nossos cursos online são baseados em vídeos tutoriais.\"\n\n- https://www.schoolofnet.com/cursos/gratuitos",
				"added": 1548022052
			}
		]
	},
	"comment_vote": {
		"7_1PdVjHUwBaqfRPZMSQqu4zwkUUnBWmvpvN": 1
	}
}