{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1521962808,
			"title": "Bringing ZeroNet into the public eye",
			"body": "What can we do to make ZeroNet more popular with the general public? Right now seems like a great time to promote it, with the Cambridge Analytica scandal and Reddit enforcing their new rules with an iron fist. Does anyone have any ideas about how we can get some news about ZN to the front pages?",
			"added": 1521962807
		}
	],
	"topic_vote": {
		"1521950418_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": 1,
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1521750958_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 1,
				"body": "In what world does \"below $9000\" == \"butchered\"? Bitcoin is up 917% since one year ago.",
				"added": 1521837293
			}
		],
		"1521950418_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "I think a weapon that attacks vital infrastructure like StuxNet did is both more realistic and possibly more damaging than a virus that would affect nuclear weapon control systems. As elektrichka said, nuclear weapons still require human intervention to be launched, and these systems are extremely heavily guarded. A nuclear strike on a nuclear-equipped nation would likely prompt an automatic response attack, so it seems unlikely that a hacker would *want* to launch a nuclear weapon, even if they could figure out how to do so.\nA massive scale attack on infrastructure would essentially make a country implode. If suddenly your entire country had no electricity, no running water, no functional gas lines, no phone system, there would be pandemonium in the streets. People would be killing each other for vital resources within the day, and nobody would know who to retaliate against for weeks or months to come, at the very least. To me, my fellow countrymen are more scary than any nuclear weapon.",
				"added": 1521963201
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_181_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Similar topics:Ideas for promoting 0netLets make ZeroNet the most popular hosting service.How can we help spread ZeroNet?\n\nThanks for the links! Is there a search feature on ZeroTalk I'm not aware of? I looked briefly but didn't see any.",
				"added": 1521964690
			},
			{
				"comment_id": 4,
				"body": "Crime is what will bring people to ZeroNet. That seems to be the deciding factor in whether or not emerging distributed technologies make it into the public eye. Think back on the history of Tor - it wasn't some vague promise of privacy that brought it to peoples' attention, it was the fact that pedophiles were damn near untouchable when they were using it, and that was newsworthy. Think back on the history of BTC - it wasn't the promise of financial freedom or discussions about libertarian economics that brought people on board, it was the fact that a new generation of drug kingpins was emerging and BTC was their payment method of choice.\n\nIf you ever want ZN to hit the mainstream, it seems that the best thing you can do with it is flagrantly break the law. Once the news gets wind of new criminal undergrounds that *aren't even hosted in one central, attackable location* there will be a lot of eyes on it.",
				"added": 1566879541
			},
			{
				"comment_id": 5,
				"body": "> [bart101](#comment_1_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8): The general public will never use Zeronet because Zeronet doesn't  have the features that people want. Zeronet is a three year old project and I've tried to get people to use it for all those years but I've had no luck. The main reason I found that people won't use it is because the Zeroblog does not have some form of an admin panel so non-coders can create a their own nice website without getting into the CSS and other files to code. Most of the general public hate coding. The people I've tried to get to use Zeronet wanted to create a nice Zeroblog with an Image for the background instead of having the white background but to do that you have to get into the CSS file and code and they were unwilling to do that. The only way Zeronet will be more popular with the general public is to give them the features they want but I don't ever see that happening. Creating a admin panel for Zeroblog should be top priority to attract all the people who hate coding.\n\nEven if they did create a more easily usable admin panel, I still think people would be put off by having to download something new to use it. We need more in-proxies on the clearnet. Nobody wants to make a blog that nobody else can see.",
				"added": 1566879636
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 6,
				"body": "What's the URL for 08chan?",
				"added": 1566880571
			}
		],
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 7,
				"body": ">Historically, however, the tendency is for supposedly collective, democratic control to transmogrify into control by an elite group of central planners who, exulting in their power, will use all the means at their disposal to hold on to it and expand it -- and 'the people' be damned.\n\n>Historically, however, the tendency is for supposedly free, competitive markets to transmogrify into control by an elite group of central planners who, exulting in their power, will use all the means at their disposal to hold on to it and expand it -- and 'the people' be damned.",
				"added": 1567748954
			}
		]
	},
	"comment_vote": {
		"1_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": 1
	}
}