{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1634930059,
			"title": "Руские стают рабсиянами?",
			"body": "Мишустин утвердил правила идентификации пользователей мессенджеров\n22 октября 2021\nПо этому постановлению в России могут быть заблокированы все иностранные мессенджеры, которые не пойдут на сотрудничество.\nПремьер-министр Михаил Мишустин подписал постановление правительства, которым утвердил правила идентификации пользователей мессенджеров. Этот документ пришел на смену постановлению от 27 октября 2018 года №1279, которое теперь утратило силу.\nСогласно правилам, утвержденным кабмином и вступающими в силу 1 марта 2022 года, подтверждение достоверности номера телефона осуществляется оператором мобильной связи по запросу мессенджера (например, при помощи кода подтверждения, направленного абоненту по SMS).\nЕсли оператор не предоставит владельцу мессенджера информацию об абоненте в установленный срок или уведомит об отсутствии сведений об абоненте и его номере своей базе данных, идентификация будет считаться не пройденной. В этом случае мессенджер обязан не допускать дальнейший обмен сообщениями этого пользователя. Оператор в свою очередь должен в своей базе данных зафиксировать запись о том, к каким мессенджерам привязан каждый номер.\nТакже, по этому документу, каждому пользователю любого мессенджера будет назначаться уникальный код идентификации. В случае отказа пользователя от услуг оператора связи, мессенджер должен в течение суток отключить клиента и провести с ним новую идентификацию, если он перейдет к другому оператору.\nКак сообщает Telegram-канал «ЗаТелеком», именно по этому постановлению в России могут быть заблокированы все иностранные мессенджеры, которые не пойдут на сотрудничество. А те, которые останутся работать, будут фактически небезопасны для пользователей, так как должны будут проводить идентификацию своих пользователей путем достоверного установления сведений об абонентском номере подвижной радиотелефонной связи и заключать для этого договора с операторами связи.",
			"added": 1634930057
		},
		{
			"topic_id": 1635511512,
			"title": "Вирус бешенства",
			"body": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1635509040_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU\n\nНемного о том, почему нужно прививаться от бешенства как можно скорее, если вас укусило какое-нибудь бродячее животное.\nНа видео показано проявление одного из симптомов бешенства  – водобоязни. Мужчина просто не может пить, потому что при каждой попытке его горло сжимается.\n\nСрочная прививка от бешенства с последующим курсом ещё может спасти жизнь, но если её не сделать, то это фактически смерть. Инфекция будет необратимо распространяться по нервной системе.\nЧерез какое-то время начнутся головные боли, повысится температура.\nПотом начнутся галлюцинации, агрессия и, как показано на видео, водобоязнь.\nА дальше паралич частей тела, прекращение мыслительной деятельности и смерть. И ничто не поможет.\n\nМожно на 100% сказать, что мужчина на видео мёртв, потому что известны лишь единичные случаи, когда выживали после этого («протокол Милуоки»).\n\nИ если не попытаться сделать прививку сразу, то запустится процесс, ведущий к неминуемой смерти.",
			"added": 1635511509
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}