{
	"next_topic_id": 18,
	"topic": [
		{
			"topic_id": 1,
			"title": "Ненужно-блог, нет пиров и ZeroGate",
			"body": "Всем привет. Создал ненужно-блог. В общем - нет пиров. Это понятно. Попытался скормить его zerogate.tk, но он пишет Not Found Adding new sites disabled on this proxy.\nУ меня PORT: открыт, TRO: Ошибка. Не имел цели заходить через TOR или нынче это обязательное условие? Или я что-то делаю не так?\nВот собственно ненужно-блог: http://127.0.0.1:43110/13iZQVkc5TUZvm8hD6SjbciimqyrwV9gKW/",
			"added": 1512283414
		},
		{
			"topic_id": 2,
			"title": "У кого ZeroNet больше?",
			"body": "Шел 2048 год, пришлось купить себе новый 128 ТБ SSD, чтобы ZeroNet продолжал работать...\nСколько будет весить ZeroNet при его развитии? Я вот смотрю, посты тянутся с самого начала т.е. с самого появления контента и с самого первого поста блога за которым ты следишь, за форумы вообще молчу. Сейчас мой маленький ZeroNet занимает 250 мегабайт, но \"я только один раз попробовал\". Что будет через год/два/восемь? Конечно же я говорю про развитие, закопать всегда успеем.\nКаковы размеры вашего личного ZeroNet? У кого ZeroNet больше? =)",
			"added": 1513388241
		},
		{
			"topic_id": 3,
			"title": "ZeroMail - поделитесь опытом",
			"body": "В общем как-то пытался включить эту штуку, но она меня напугала долгим выкачиванием чего-то и я забил, подумав что не нужно. По факту у меня свой VPS с настроенной почтой, поэтому видимо и забил, но вопросы остались, поделитесь опытом:\n1. В чём заключается end-to-end? Это просто лежит в основе ZeroNet? Там же GPG никакого нет.\n2. Можно ли настроить на работу с Этим громоптицу к примеру?\n3. Можно ли, используя Это, писать из/в обычные Интернеты? Тогда где e2e будет?\n4. Почему оно так много всего синхронизирует? Оно что, всю почту всех юзеров хранить у меня будет? Или только гонять?\n5. Оно вообще работает?\n6. Скорость доставки мыла из пункта А в пункт Б?",
			"added": 1517399061
		},
		{
			"topic_id": 4,
			"title": "Нейроночка накладывающая лицо на видеоряд.",
			"body": "Я думаю никто не пропустил появление нейроночки, которая умеет накладывать произвольное лицо на произвольный видеоряд... В итоге теперь по ящику любой человек (президент) может сделать любое заявление И ВСЕ ПОВЕРЯТ! Особенно в сельской местности.\nКонечно теперь удобно и политоту вбрасывать, типа: вот смотрите, американский президент заявил что по утрам нужно всех лупить веником. А у нас все хорошо.\nНу и пользуясь случаем: есть ссылки на порнушку со звездами?\nДискас в общем. Кто что думает. Мы все умрем?",
			"added": 1517480109
		},
		{
			"topic_id": 5,
			"title": "Там говорят снаружи интернеты запрещают...",
			"body": "Всякие деятели в пиджаках говорят что РФ готова отключиться от интернетов. Сначала говорят, а потом призывают, изобретают законопроекты и подписывают...\nЯ про то что здесь-то хорошо, спокойно. Зачем нам интернеты? \nЯ так понимаю что рычагов блокировки Zeronet нет? По крайней мере количество китайцев здесь говорит именно об этом.",
			"added": 1520327165
		},
		{
			"topic_id": 6,
			"title": "Цукерберг признал ошибку Facebook в утечке данных 50 млн пользователей",
			"body": "Основатель Facebook Марк Цукерберг сделал официальное заявление по поводу скандала с утечкой данных более 50 млн пользователей соцсети, которые оказались в распоряжении британской Cambridge Analytica.\n\n\"Мы несём ответственность за защиту ваших данных, и если мы не сможем сделать этого, то мы не заслуживаем того, чтобы обслуживать вас. Я работаю над тем, чтобы понять, что произошло и как не допустить этого вновь.\" - Марк Цукерберг.\n\nА у нас в ZeroNet таких проблем нет. В общем как я понял Марк сам сказал что его мордокнига не нужна.",
			"added": 1521706972
		},
		{
			"topic_id": 7,
			"title": "Что делать если я не могу открыть порт 37567?",
			"body": "Настройки гребанного роутера от опсоса не позволяют открыть порт 37567. Как тогда публиковать контент? Что делать в таком случае?",
			"added": 1540123867
		},
		{
			"topic_id": 8,
			"title": "Не могу вставить изображение в пост блога",
			"body": "Пытаюсь добавить картинку в пост блога, но получается разорванный листочек и изображение не вставленно... В чём может быть проблема? Картинка - обычный jpeg 640x480",
			"added": 1540637066
		},
		{
			"topic_id": 9,
			"title": "Content.json write error: false",
			"body": "Что это за ошибка? Образовалась так: клонировал дефолтный ZeroBlog, нажимаю подписать и отправить и... Получаю указанную в оглавлении ошибку. В итоге пиров нет и т.п.",
			"added": 1540728793
		},
		{
			"topic_id": 10,
			"title": "Как удалить Zайт?",
			"body": "Создал пару блогов... Решил удалить... Из вебморды удалить понятно дело нельзя... Нахожу в папке data одноименную адресу зайта папку и удаляю его. Но в вебморде он не изчезает даже после перезапуска ZeroNet. Что я делаю не так?",
			"added": 1544335447
		},
		{
			"topic_id": 11,
			"title": "Мединский пообещал вход в интернет по паспорту",
			"body": "Министр культуры России Владимир Мединский заявил, что в будущем вход в интернет будет осуществляться по паспорту. Глава Минкульта подчеркнул, что он гарантирует это, передает ТАСС в понедельник, 21 января.\n\n«То, что мы в будущем будем входить в интернет по паспорту, — это я вам гарантирую. Не только в России, во всем мире. Этот вопрос решится еще при нашей с вами жизни», — пообещал министр.\n\nВот такой вот смешной дядька.\nА вот ссылка на какой-то порно-новостной сайт: https://lenta.ru/news/2019/01/21/nokino/",
			"added": 1548072757
		},
		{
			"topic_id": 12,
			"title": "Куда ходить в зеронетах?",
			"body": "Посоветуйте ресурсов! Как искать блоги? Поисковика ведь нет. Кто что здесь читает/пишет. После смерти балансера как-то грустно стало...",
			"added": 1548420190
		},
		{
			"topic_id": 13,
			"title": "Кто-нибудь использует в повседневной жизни Matrix?",
			"body": "Поделитесь опытом использования и клиентами мобильными/десктопными... А и ещё, какой сервер поднимали, как настраивали? +/-, подводные камни...?",
			"added": 1549717859
		},
		{
			"topic_id": 14,
			"title": "Как юзать Onion Search Engine?",
			"body": "Собственно сабж. Можно ли это пускать из браузера и как?",
			"added": 1550912862
		},
		{
			"topic_id": 15,
			"title": "Как банить пользаков, чтобы не видеть их постов в RuZeroTalk и ZeroNet в целом",
			"body": "Собственно сабж. Как банить по ID? А то понанесли сюда фигни всякой.",
			"added": 1556933207
		},
		{
			"topic_id": 16,
			"title": "Если отключат Интернет как в Иране",
			"body": "Что делать-то будем? Половина через ТОР сидит, он ляжет при хорошем отключении. Если не через ТОР то до трекера так же хер достучимся. Нужно поднимать больше трекеров вроде, но я так понимаю что такой задумки в ZeroNet нет, я имею ввиду свободное поднятие бесконечных нод.",
			"added": 1575022308
		},
		{
			"topic_id": 17,
			"title": "Плачу 500 рублей каждому",
			"body": "Всем привет. В общем я залью на карту 500 рублей, каждому кто оформит карту указанного мной банка. Подводных камней нет. Карта - обычная дебетовка, все условия я расскажу, да вы их и сами увидите на сайте банка. Карта полностью бесплатна. Можете оформить её, получить от меня 500 рублей и заблокировать/закрыть или спокойно пользоваться. Мне ваши персональные данные не нужны. Пишите мне в ZeroMail . За этой темой я послежу немного, если кто чего не умеет, а так - на все вопросы отвечу в ZeroMail.\nДа, ещё: необходимо быть гражданином РФ и иметь на руках паспорт РФ при общении с банком. Находиться нужно на территории РФ.",
			"added": 1578399511
		}
	],
	"topic_vote": {
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": 1,
		"13_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": 1,
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1
	},
	"next_comment_id": 82,
	"comment": {
		"1_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 1,
				"body": "О, спасибо за пиров, протолкнули. Теперь вижу что работает.",
				"added": 1512286708
			},
			{
				"comment_id": 2,
				"body": "> [uqe](#comment_1_1FgFH7wd14bmcDczVWaBp16hFWSRHUgVcD): zerogate.tk это и есть proxy. Ошибка говорит что добавление новых сайтов отключено настройками. :)\nТак а что делать чтобы ненужно-блог был доступен через прокси обычным смертным?",
				"added": 1512286745
			}
		],
		"2_1PQSdkCfwKLKT4pWEpf33BkjvYX78wj1kJ": [
			{
				"comment_id": 3,
				"body": "Некультурно, сэр! Вы портите облик культурного зеронетика.",
				"added": 1513388424
			}
		],
		"1_12TkPLvsD5FecF8Xbv331qjcvbY6Dt9DFa": [
			{
				"comment_id": 4,
				"body": "ZeroNet forever!",
				"added": 1513388475
			}
		],
		"1_1AnHAaYBr8QjiCxL3ZYnYHKxL9Wd18zgdH": [
			{
				"comment_id": 5,
				"body": "С Новым годом! Здоровья всем, семейного счастья и благополучия в новом году!",
				"added": 1514780947
			}
		],
		"10_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 6,
				"body": "А пронхаб с иксвидеос тебя чем не устраивают? Или ты хочешь чего-то этакого? Там вроде норм было с твоим запросом.",
				"added": 1515890314
			},
			{
				"comment_id": 58,
				"body": "> [p2ppaty](#comment_9_1B7vZg9H9cGkxSfWZYXkAadKnd3EX1EbGw): perfect dark 1.23 японская файлообменная сеть с шифрованием трафикаhttp://perfectdark.org/pd_clientshttps://perfectdark.benri-tool.net/node/ perfect dark nodes\n\nа там на каком языке искать-то? На японском?",
				"added": 1550401499
			},
			{
				"comment_id": 59,
				"body": "> [bvn13](#comment_11_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): xxnx.comxhamster\n\nне открывается даже через VPN в Европе.",
				"added": 1550401579
			}
		],
		"1_1MrESi8JYQqWEVbuRiGE8d41z29PmpT8GT": [
			{
				"comment_id": 7,
				"body": "Кошелек в каком-нибудь Electrum на флешке с Tails Linux и вперед! В чем проблема-то? В этом конечно есть определенные нюансы, но собирать в bitcoin это лучшее решение на сегодня. В остальных решениях минусов гораздо больше.",
				"added": 1515890458
			},
			{
				"comment_id": 8,
				"body": "Любое использование банковской системы не анонимно, но хомячкам удобнее с карточки конечно. Через обменник это самый простой вариант, да.",
				"added": 1516179506
			}
		],
		"7_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 9,
				"body": "Подними свой на VPS в чем проблема-то? Тебе для каких целей? Вон в Германии можешь, у них конечно тоже пол Интернета забанено, но это другие пол Интернета, не то что у тебя =)",
				"added": 1516179604
			}
		],
		"3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_273_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ну и каждый хранит почту всех.\n\nВот это жесть конечно. Даже внутри ZeroNet можно столько почты понапередавать. И что её потом 100500 лет хранить? Всем юзерам? Да это жесть! Мне кажется в ZeroMail это прямо слабое звено. Но логика конечно понятна... Просто я тогда (при всем этом) не понимаю зачем она нужна, когда можно обычную почту с GPG гонять по обычным интернетам... Но хорошо что Оно есть конечно.",
				"added": 1517473426
			},
			{
				"comment_id": 11,
				"body": "> [gobotheelephant](#comment_6_1DinguqcWEJd9T8FBJ9tMExfz6DHcZZYb9): Вообще, оно работает скорее как сервис публикации шифрованных заметок. \nКому шифрованных? Самому себе или одному человеку?",
				"added": 1517622799
			},
			{
				"comment_id": 14,
				"body": "> [tokyomewmew](#comment_47_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Начнем с того, что такое громптица ?\nMozilla Thunderbird",
				"added": 1517703918
			}
		],
		"1_17gmC3ZAJ8Fyu3DH8EHTuV1RNjiob6Fjb8": [
			{
				"comment_id": 12,
				"body": "Мне не повезло",
				"added": 1517644423
			}
		],
		"13_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 13,
				"body": "Блин, в Мире столько интересных дел, а ты тут страдаешь. Я понимаю что Мир сложная штука с кучей вещей, которые не приятны или их хочется изменить. Но пойми, только ты САМ можешь сделать себя счастливым! И правда можешь! Я тебя уверяю. Только начни. С чего начать?\nВот тебе немного простых путей:\n1. Займись спортом, бегом например. Поставь какое-нить приложение и бегай с телефоном десяток километров в день не зависимо от погоды. Спорт быстро выбьет из тебя негатив.\n2. Совсем не умеешь в спорт? Это плохо. Но можно начать даже не поднимая жопы: зайти на какой-нибудь https://adme.ru/ - очень вдохновляет, поверь! Потрись там пару месяцев, почитай статейки. Очень душевно там. На худой конец есть https://жить.рф/\n3. Найди себе увлечение... Фотография например или рисование, или конструирование, или просто моделестроение... Совсем туго с фантазией - поставь Gentoo и пересобирай мир. В последнем случае ты можешь сделать мир любым - как тебе понравится :) .\n4. Помоги кому-нибудь - сразу почувствуешь что ты важен. Просто сделай то что умеешь для нуждающегося.\n5. Да ё-моё, просто почисть двор от снега!\nЗанятий куча. Просто займись и ты поймешь что мир не без добрых людей и в нём много интересного.\nP. S. Ну и на последок... Ты слышал о медитации? Просто коснись этого направления.... Изучи... Может втянешься.",
				"added": 1517645040
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 15,
				"body": "И как ты предлагаешь это реализовать на примере ZeroNet? \nЗаблочить пользака по его ключу? Он без проблем за секунду войдет под новым.\nЗаблочить пользака по его логину? Он молниеносно сделает себе новый.\nЗаблочить пользака по IP? ЛОШТО?\nКакие методы ты предлагаешь применить? ZeroNet это свобода. Иначе сюда придут всякие Путины с Роскомнадзорами и ФСБ и скажут что нужно писать, а что не нужно. Помимо них, есть еще полно регуляторов в разных странах. Не важно кто будет регулировать. Регуляция здесь плоха сама по себе.\nОднако регуляция все же есть. Я виду блог, его распространяют пользователи и его доступность зависит как раз от интересующихся. Если он никому не интересен, то его не рапространяют и не видят. Даже в этом формуме есть циферка рядом с ником и ее можно нажать вверх, что скажет о том что этот комментарий распространят все мои пиры и я. Если этот комментарий не интересн, то его не распространят и не будут хранить у себя на хардах куча пользователей.\nМожет я не прав в каких-то деталях (поправьте), но это работает как-то так.",
				"added": 1519644053
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 16,
				"body": "Arch, Debian, Mint",
				"added": 1520326478
			}
		],
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 17,
				"body": "О! Я тут подумал... Как переселить всех из вражеского фэйсбука в православные одноклассники: на законодательном уровне обязываешь всех сдавать декларации о наличии аккаунтов в фэйсбуке в ФСБ или РКН каждый квартал, а если не сдал - штраф 1 тыр. И поступления в бюджет пойдут и никого не нужно будет соблазнять хранить данные в нашенских ЦОДах. Хотя да, ЦОДы, которых нет, развивать важнее.",
				"added": 1521717592
			},
			{
				"comment_id": 19,
				"body": "Твиттеряне теперь везде пишут #DeleteFacebook и выпиливаются оттуда. Конечно это делают далеко не все. Хомячки привыкли жрать что дают, хоть и ходят некоторые к одному психиатору о котором им как бы намекает иногда мордокнига и пытается их познакомить...\nВ общем Илон Маск удалил страницы  SpaceX и Tesla из мордокниги в рамках #DeleteFacebook . У каждой из страничек было по 2,5 миллиона подписчиков.",
				"added": 1521933148
			},
			{
				"comment_id": 20,
				"body": "> [anotherneko](#comment_24_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Представляю что будет когда он протечет.\nА он протечет!",
				"added": 1522011330
			},
			{
				"comment_id": 21,
				"body": "Для увеличения прозрачности своей работы Facebook добавил возможность загрузить архив всех накопленных сведений о пользователе. Пользователи мобильного приложения Facebook для Android обратили внимание, что в присутствующем в архиве файле contact_info.htm содержится информация, свидетельствующая о сборе данных, выходящих за рамки работы приложения. В частности, собиралась информация о звонках, которые совершал и принимал пользователь, а также об отправленных и принятых SMS/MMS.\n\nДля звонков сохранялось время, продолжительность, имя адресата и тип звонка (входящий, исходящий, пропущенный вызов, не принятый звонок). Для SMS/MMS собираемая информация ограничивалась временем, типом и адресатом (текст и номера телефонов не сохранялись в приложении Facebook). Информация собиралась только если пользователь соглашался предоставить мобильному приложению Facebook доступ к адресной книге для поиска новых друзей. До выпуска Android 4.1 прав доступа к адресной книге было достаточно для сбора сведений о звонках, но в более новых версиях Android было добавлено отдельное разрешение для доступа к логу звонков и SMS, соответствующий запрос полномочий был реализован в новых выпусках приложения Facebook и упоминался при установке программы. \n\nАрхив с накопленными в Facebook данными можно загрузить по ссылке \"Скачать копию ваших данных на Facebook\" в нижней части страницы \"Настройки / Общие\". Для анализа и вывода суммарных данных о звонках энтузиасты подготовили скрипт на языке Ruby.",
				"added": 1522011411
			}
		],
		"1_1J97bEwqapAhZf6vaTevvthB5awi7Fi9vS": [
			{
				"comment_id": 18,
				"body": "Там паспорт что-ли свой сливать нужно!?",
				"added": 1521773342
			}
		],
		"1_1dkd8ar9EaD5M6XLkxyQu1zwJhfhAd23H": [
			{
				"comment_id": 22,
				"body": "Что такое ЦП? Кто такой нульчик?",
				"added": 1522672259
			}
		],
		"1_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 23,
				"body": "Банки не нужны. Есть крипта. \nИ-и... Это... Android pay точно не нужен, так же как и ApplePay и все эти pay... Мне хватает что банки собирают инфу обо мне, а тут еще и Google с Apple туда же. PayPal - вообще лютое говно, куда нужно слать фото паспорта.",
				"added": 1523673778
			}
		],
		"14_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 24,
				"body": "А чего там одни азиаты? Где русский контент? =)",
				"added": 1528688036
			}
		],
		"2_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 25,
				"body": "А что тебе не понятно? Ты уже даже вот сюда дошел и создал тему. Тебе чем помогать-то?",
				"added": 1530423564
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 26,
				"body": "Я",
				"added": 1531529184
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 27,
				"body": "Революция - может быть везде и всегда. А смена власти была вчера, ты всё пропустил. Но ничего - она постоянно меняется через промежутки времени.",
				"added": 1533771459
			}
		],
		"3_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 28,
				"body": "Я вообще вопроса не понял. Во-первых я ничего не делаю бесплатно. IT нынче - это работа. Бесплатных стоматологов тоже нет. А если помочь советом, то тебе много кто поможет. В IT ты или платишь деньги за работу/обучение или познаёшь всё сам читая Интернеты и документацию. Информации валом. Другое дело, если ты всё перечитал, но тебя нужно немного направить...",
				"added": 1533771625
			}
		],
		"7_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 29,
				"body": "Про tor hidden service это интересно, но проще оказалось сменить роутер.",
				"added": 1540637119
			}
		],
		"8_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 30,
				"body": "> [balancer73](#comment_449_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Блог клонировал официальный? А то такое было в старых версиях ZeroBlog при вставке под Windows. Потом вставляться стало, но определение размеров картинки (и тоже только под Windows) не работало. Сейчас в официальном ZeroBlog и производных от него всё ок, но, может, ты чей-то блог со старой версией кода склонировал?\n\nи как теперь быть? Кого клонировать? А старый закрывать?! Я его только завел... Так зеронет превратится в тонну блогов у которых продолжения в других блогах. И это... Я все из под Linux делаю",
				"added": 1540645314
			},
			{
				"comment_id": 31,
				"body": "Сделал Upgrade code у блога, но результат тот же.",
				"added": 1540645518
			},
			{
				"comment_id": 32,
				"body": "> [balancer73](#comment_450_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Так клон был с официального или нет? Upgrade code просто делает у тебя код таким же, как у оригинального блога, что ты клонировал. Если клонировал не официальный, то на официальный можно переключиться, поменяв адрес \"cloned_from\": \"1FetDo9hbmSfdSmsTXXPusiLk3S5fgnWpq\" в content.json в корне твоего сайта.\n\nПоменял адрес, сделал \"обновить\", сделал \"Upgrade code\". Но проблема осталась...",
				"added": 1540722100
			},
			{
				"comment_id": 33,
				"body": "[balancer73]\nА если клонирую твой блог, то все нормальнПоменял адрес, сделал \"обновить\", сделал \"Upgrade code\". Но проблема осталась...то происходит... Какие варианты? Заводить новый? Или всё же можно свой починить?",
				"added": 1540722440
			},
			{
				"comment_id": 37,
				"body": "Завел новый блог в общем, клонированием дефолтного зероблога.",
				"added": 1540731333
			}
		],
		"5_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 34,
				"body": "У меня вот тоже с блогом какая-то хрень. Вроде клонировал официальный, нажимаю подписать и опубликовать и ничего не происходит. В консоль какая-то фигня лезет... В итоге у блога горит колокольчик (нет пиров). Нужно просто подождать? Или у меня проблемы с подписью этого клона?\nhttp://127.0.0.1:43110/1FA7LmD5bDhfGHe4kz8x2MJKMnqvegSUEf/",
				"added": 1540727633
			},
			{
				"comment_id": 36,
				"body": "> [promusik](#comment_34_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): У меня вот тоже с блогом какая-то хрень. Вроде клонировал официальный, нажимаю подписать и опубликовать и ничего не происходит. В консоль какая-то фигня лезет... В итоге у блога горит колокольчик (нет пиров). Нужно просто подождать? Или у меня проблемы с подписью этого клона?http://127.0.0.1:43110/1FA7LmD5bDhfGHe4kz8x2MJKMnqvegSUEf/\n\nВсё самоизлечилось, когда появились пиры.",
				"added": 1540731273
			}
		],
		"9_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 35,
				"body": "Проблема была связана просто с отсутствием пиров. Как пиры появились все стало работать как нужно.",
				"added": 1540731232
			}
		],
		"1_1FSr4KP1pQCjknEWexaNy89X3YZNL9ocgr": [
			{
				"comment_id": 38,
				"body": "Что сказать-то хотел?",
				"added": 1546138037
			}
		],
		"24_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 39,
				"body": "Бесперспективняк",
				"added": 1547977705
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 40,
				"body": "Идея очень хорошая! Я не располагаю гиганским количеством времени и не разработчик ПО, но с удовольствием учавствую в местной суете... Писать хочу всё больше и больше т.к. современный Интернет удручает... Постараюсь уделять больше времени Zeroнетику. Что касается групповых собраний... То конечно же лучше всего использовать какой-нибудь XMPP с OTR к примеру, TOX  или что-то не просящее номер телефона. Так всем будет спокойнее. Если могу чем-то помочь, то вписывайте меня в команду. Если нет, то продолжу понемногу постить... Конечно же я не писатель и не дофига-блоггер, но ZeroNet - штука определенно нужная! :)",
				"added": 1548751294
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 41,
				"body": "Клирнет уже давно не нужен т.к. полностью контролируется властями и Михалковыми... Я уже не говорю про коммерческие компании барыжащие персональными данными пользаков. Большая часть пользователей клирнета довольно не умны и юзают во всю месседжеры и пару популярных социалочек, думая что это и есть Интернет. А кто по-умнее и пройдёт дальше - сразу попадёт на информационные ресурсы, полностью контролируемые правительством т.к. оно выдаёт лицензии СМИ и интернет-торговые площадки, которые (на примере амазона) уже приспособились продавать одну и ту же вещь по разным ценам разным покупателям, в зависимости от активности пользователя.",
				"added": 1548760073
			}
		],
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 42,
				"body": "Так, давайте сразу определимся с терминологией:\n\nДаркнет (англ. DarkNet, с англ. — «скрытая сеть», «тёмная сеть», «теневая сеть») — скрытая сеть, соединения которой устанавливаются только между доверенными пирами, иногда именующимися как «друзья», с использованием нестандартных протоколов и портов. Анонимная «сеть» не связанных между собой виртуальных туннелей, предоставляющая передачу данных в зашифрованном виде. \n\nDeep Web - Глубокая сеть (также известна как «Невидимая сеть», «Глубокая паутина», «Глубокий интернет»; англ. Deep Web;) — множество веб-страниц Всемирной паутины, не индексируемых поисковыми системами. Термин произошёл от соотв. англ. invisible web. Наиболее значительной частью глубокой паутины является Глубинный веб (от англ. deep web, hidden web), состоящий из веб-страниц, динамически генерируемых по запросам к онлайн-базам данных. \n\nТак вот, социалочки вроде Mastodon к даркнету явно не относятся... Они просто децентрализованны, так же как XMPP к примеру.\n\nЯ использую TOR, когда не хватает или не настроен VPN. В зоне .onion ничего для себя не нашёл... А так, вот открыл для себя ZeroNet, его мне в принципе хватает.",
				"added": 1548760659
			},
			{
				"comment_id": 43,
				"body": "> [paulelms](#comment_2_1B2bJtwCjwokiJCzXSsDPRo8ghTG8YJutc): Если опустить терминологию, то я есть только в ZeroNet и Mastodon. В остальных местах я зарегистрирован, какие-то приложения даже установлены, но я почти ничего не читаю там и, тем более, не пишу.\nЧего там интересного в мастодоне происходит? Обычный твиттер?",
				"added": 1548762741
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 44,
				"body": "Как вариант можно держать ZeroNet на LUKS-разделе или в encryptfs... Смысл в том что при любой возне забыть пароль от контейнера и быть устойчивым к анальному криптоанализу. А вообще лучше ещё и маскировать контейнер...",
				"added": 1549369000
			},
			{
				"comment_id": 45,
				"body": "> [makho](#comment_1_1DYW49c7bJ5xAA5aHMEqWb92xBXtUkUazd): Не подскажешь, как?\n\nНе. Детали реализации не обдумывал...",
				"added": 1549450119
			}
		],
		"2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 46,
				"body": "> [mistalero](#comment_27_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Почему?\n\nВасян решил прикупить [coin_name] в 13:01:15. А в 13:01:14 Гера купила 100500 млн [coin_name], что вызвало скачек цены [coin_name] на 400 пунктов. По какой цене Васян будет покупать [coin_name]? Через какое время Васян узнает, что ему уже не хватает тех денег, которые ему дала мама на булочки, даже на 1 [coin_name]. А в 13:01:16 сидел Мифодий и думал продавать ли ему свои [coin_name] или нет по n-ной цене и считал на калькуляторе свою прибыль, но он ещё не знал что цена валюты уже изменилась 400 раз.\n\nТеперь умножай Васянов, Гер и Мифодиев на хотя бы 1000 пользователей + столько-же торговых ботов и подумай как каждый из них в реальном времени будет узнавать цену [coin_name] и следить за транзакциями, графиками, стаканами других участников.",
				"added": 1549536826
			},
			{
				"comment_id": 47,
				"body": "> [anotherneko](#comment_125_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): По той, цене, которую он установил, если найдутся продавцы, согласные на нее. Это же биржа.\n\nГрафики, стаканы, свечи ты с чего собрался рисовать? Пока это всё по зеронету пройдет - пройдет уйма времени, а на бирже важны секунды. Или биржа будет в текстовом редакторе с непонятно кем установленной ценой. В итоге у Васи в 18:35:40 будет одна цена, а у Жени в этот же момент времени крипта будет стоить в три раза дороже. Вот я о чём.",
				"added": 1549629142
			}
		],
		"2_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 48,
				"body": "И как туда зайты заносить?",
				"added": 1549630430
			}
		],
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 49,
				"body": "> [mistalero](#comment_26_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Создал профиль, добавляйтесь.@xly4FhqsYTS3UOYJFDFalLkRlQVbziwRBjICMTXtpwo=.ed25519\n\nЗачем?",
				"added": 1549669462
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 50,
				"body": "Блин как-же всё печально с ним...",
				"added": 1549765724
			},
			{
				"comment_id": 52,
				"body": "> [gluckman](#comment_41_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): А можно подробности, что за зверь а то у товарища тут одного исследование целое на тему анонимных IM\n\nПочитай здесь интервью с создателем. Там много интересного:\nhttp://127.0.0.1:43110/13iZQVkc5TUZvm8hD6SjbciimqyrwV9gKW/?Post:21:Riot+in+the+Matrix:+%D0%B8%D0%BD%D1%82%D0%B5%D1%80%D0%B2%D1%8C%D1%8E+%D1%81+%D1%81%D0%BE%D0%B7%D0%B4%D0%B0%D1%82%D0%B5%D0%BB%D0%B5%D0%BC+%D0%BC%D0%B5%D1%81%D1%81%D0%B5%D0%BD%D0%B4%D0%B6%D0%B5%D1%80%D0%B0+Riot.im+%D0%BE%D0%B4%D0%B5%D1%86%D0%B5%D0%BD%D1%82%D1%80%D0%B0%D0%BB%D0%B8%D0%B7%D0%B0%D1%86%D0%B8%D0%B8+%D0%B8+%D0%B2%D1%8B%D0%B7%D0%BE%D0%B2%D0%B0%D1%85,+%D1%81%D1%82%D0%BE%D1%8F%D1%89%D0%B8%D1%85+%D0%BF%D0%B5%D1%80%D0%B5%D0%B4+%D0%BA%D1%80%D0%B8%D0%BF%D1%82%D0%BE%D1%8D%D0%BD%D1%82%D1%83%D0%B7%D0%B8%D0%B0%D1%81%D1%82%D0%B0%D0%BC%D0%B8+%D1%81%D0%B5%D0%B3%D0%BE%D0%B4%D0%BD%D1%8F",
				"added": 1549966707
			},
			{
				"comment_id": 53,
				"body": "> [mistalero](#comment_32_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что за Matrix?\n\nТам суть в том что можно поднять свой сервак (федерацию), а можно просто на их официальном зарегиться введя лишь придуманный ник и пароль И БОЛЬШЕ Н И Ч Е Г О!",
				"added": 1549966825
			}
		],
		"2_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 51,
				"body": "Откуда эта слоупочная статья?",
				"added": 1549880631
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 54,
				"body": "Это же бывший GNU Ring. Юзал я его около года назад. Был очень не стабилен и качество связи очень уныло. По факту по пол часа (я даже не утрирую) соединялся с другим пользователем и не показывал его актуальный статус: в сети / не в сети. Может сейчас и стало лучше, не тестил.\n\nПо юзабельности и качеству TOX оказался чуть более стабильным.",
				"added": 1549967004
			},
			{
				"comment_id": 55,
				"body": "> [p2pnews](#comment_4_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): ТАК ВОТ СЕЙЧАС ЕГО ПЕРЕИМЕНОВАЛИ В Jami ВРОДЕ КАК НАМНОГО ЛУТЬШЕ СТАЛ\n\nСтиральные порошки тоже всё время переименовывают - стирают так же.",
				"added": 1550142508
			},
			{
				"comment_id": 68,
				"body": "> [p2pnews](#comment_4_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): ВРОДЕ КАК НАМНОГО ЛУТЬШЕ СТАЛ\n\nОт того что его переименовали?",
				"added": 1554030353
			}
		],
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 56,
				"body": "> [beeholder](#comment_1_1JZKKzmvBupAZGgJuWQzmNLo1MBs5N9rn): зато можно потренироваться в банинге\n\nА как это делать?",
				"added": 1550142674
			}
		],
		"1_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ": [
			{
				"comment_id": 57,
				"body": "Упорин-тема. У меня не было проблем с Землёй.",
				"added": 1550142768
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 60,
				"body": "Так ZeroNet же не плохо будет работать почтовыми голубями! Флешка в конверт или вообще как хочешь, синкаешь там, возвращаешь обратно - синкаются все остальные внутри страны. Тупо, долго, но должно работать.\n\nВариант 2: один из пользователей обладает спутниковым Инетом - так через него может весь российский сегмент синкаться, но долго.\n\nВариант 3: выходы во внешний мир по любому должны быть... Ну просто даже для работы SWIFT и прочей хрени... Как Нефте-газовая отрасль будет общаться с потребителями в Европе? Правильно. Находим заинтересованного админа и он всё это синкает через этот канал. Ну или как вариант - можно использовать автоматические средства без ведома хозяев оборудования и админов....\n\nПутей много. ZeroNet будет жить.",
				"added": 1550487857
			}
		],
		"1_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 61,
				"body": "Использовать ZeroNet без TOR сегодня впринципе не безопасно т.к. по сути весь контент у тебя и ты его распространяешь. Поэтому только с TOR.",
				"added": 1550748845
			}
		],
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 62,
				"body": "Как сабж работает кто-нибудь может объяснить? Я вот скачал его AppImage, запустил и... И оно ничего не ищет. Или должен быть постоянно запущен, тогда накеширует в себя некую базу и будет её постоянно обновлять т.е. он должен по сути стартовать вместе с системой, чтобы это было юзабельно. Ну и если так, то можно ли его поднять на своём VPS (подводные камни?)?",
				"added": 1550912780
			}
		],
		"2_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 63,
				"body": "Вот истории про проблемы с сетью и Briar вообще не возбуждают, т.к. они довольно прохладны. Briar нацелен на несколько другое общение. Если есть проблемы с сетью, то гаснет сота, wi-fi никто не поднял и не понятно как к нему подключиться, только если просто расшарить, а голубойзуб вообще не о чем. При реальных проблемах с сетью поможет лишь рация и/или телеграф. В остальном (при проблемах с Интернетом) поможет любой TOX-оподобный месседжер. \nЕдинственное чем интересен Briar, это их усилиями по снижению энергопотребления при обещающей оставаться стабильной связи. Вот эти разработки интересны. В остальном аудитория и предназначение месседжера понятны.",
				"added": 1552024559
			}
		],
		"1_1e2mHauMGG8GgSDvaaPrNanxvaxwpGQRV": [
			{
				"comment_id": 64,
				"body": "Используй через TOR.",
				"added": 1552742593
			}
		],
		"1_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": [
			{
				"comment_id": 65,
				"body": "> [murzazade4](#comment_28_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): нахера его блокировать?\n\nПотому что это окно во внешний мир.",
				"added": 1552743299
			}
		],
		"10_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 66,
				"body": ">> MMORPG на блокчейне\nЗачем?",
				"added": 1552900392
			}
		],
		"3_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 67,
				"body": "> [xrew](#comment_5_1Fhc5yWswf5Rqu6HoCJTesRHoniQLcx7aT): это не пугач роскомнадзор уже большую часть диапазона ip адресов заблокировали\n\n881260 на данную минуту. Пару месяцев назад было более 3 млн. Так что выдохни",
				"added": 1553227035
			}
		],
		"5_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 69,
				"body": "Что такое RT-ядро? Юзаем обычное Linux. 5.1 вроде в Arch завозили. Не помню какое там на ноуте, ноут на работе, но 5 точно.",
				"added": 1554119872
			}
		],
		"1_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": [
			{
				"comment_id": 70,
				"body": "Хрень. Из одной жопы в другую. От перемены мест слагаемых сумма не меняется.",
				"added": 1555195731
			}
		],
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 71,
				"body": "Кому нужно тот знает про ZeroNet. Остальных тащить сюда смысла нет. Просто нам здесь нужно сделать уютный уголок, создавая уникальный контент и поддерживая беседы.\nКак вариант меньше политоты. А то даже Ru-ZeroTalk уже засрали политотой. Прямо поговорить больше не о чем.",
				"added": 1556763884
			},
			{
				"comment_id": 72,
				"body": "> [ks7715](#comment_5_16NJNN8b3jUEAGtVWoPR1vkEPkXX6BQWAY): Зачем нужна вообще концепция ZeroNet и подобных сетей тогда?Без политоты они не нужны. Не хочу оскорблять, но и ты не нужен.\n\nДа блин, политоты и вне ZeroNet навалом. Причём какой хочешь. Но набрасывать её в RuZeroTalk это уже зашквар. Прямо обсудить больше нечего. Здесь есть специальные борды, помеченные как политические. А те темы которые набрасывают сюда, прямо становится похоже на сборище имбицилов. Прямо проблем больше нет для RuZeroTalk кроме ВВП.",
				"added": 1556933093
			}
		],
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 73,
				"body": "Нашел ответ на свой вопрос. В ZeroID находишь ID и нажимаешь Mute. И RuZeroTalk становится мягким и пушистым без всяких политических зашкваров.\n\nУже замутил:\nmurzazade4@zeroid.bit\n1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp\n\nzsaw@zeroid.bit\n1DESK8jcspe5Vm7YzVunRWbirYNLBtVPWF\n\nmlop@zeroid.bit\n1Jtas1e392Kx9sfvZKnCQR8HMH7gcJ1FpW\n\nkirayoshikage0@zeroid.bit\n1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A\n",
				"added": 1556933687
			},
			{
				"comment_id": 74,
				"body": "Как бы запретить ZeroNet ещё распространять эту дрянь, чтобы я не раздавал?",
				"added": 1556933728
			},
			{
				"comment_id": 76,
				"body": "> [anonymouslogin](#comment_9_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Есть готовые спам листы, форкайте и собирайте по тегу: полит_срач\n\nГде и как брать? И как подсунуть их ZeroNet?",
				"added": 1556933950
			}
		],
		"1_1DMpDMVvaeUTgC6WjCqav9CRGedc3opwkF": [
			{
				"comment_id": 77,
				"body": "Да пофиг вообще. Если он мне не будет показывать нужный мне видос с Ublock Origin, то я просто не буду его посещать. Да и вообще я просто запущу youtube-dl и выкачаю то что мне нужно. Если даже и это не прокатит, то я просто уйду в какой-нибудь peertube. В общем я думаю что мне пофиг.",
				"added": 1573894159
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 78,
				"body": "CQEGAcGcxsBNBF4NYrMBCADWpYHRjGyrcnQ6GrTXkpPgSzxNRYeyhmmOVCgndQaN\nq7K/3clmF7Wk/LflbqGfAgG7JQf7+UVKZr2c81vXERN9ilGyy44j7bz56lm2gTxH\n6gD3r8nbIWMyhjGoSAqjaRNfaCJxy3L3t+5JLT6P1HGiTxj8bdH1NP9siFwkmKxl\nGKMc/ywAxB1pBYtYGy8f3OboTYfO+3jnq+T9AGsv4jSthiuCtZ+qmudZluOG3Tkb\nYKDKM9UdtxSZ7AsPC4PV4a3cmNuIl0Pn9AGyqY1A3182YYXNRVDK4sz+JeGXbGp8\nLT8Vfm6zcoVNhRYm11S+TIVJ2JFWJBBNpLac9uShKtmdABEBAAHNKHNlcmdleTEy\nMTc0IChHZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAl4NYrMJ\nEHu35rQZ59BfAhkBAAD8Dwf8Dn05zrEVzFf3vAv8WkGilmTflb5xkN/6nIGhtKOE\noqK+8QCRMvoVU9z62tHwDlAVwQSGd4SKq+lNEWMEi6jvnBRf/BvSDQ97AAWNPbN0\nUWYzhPXBbNEcq+zccjUsrcVX3g8m8uUvZJvvD9AFCe3bfBN4DBS09HOIyJhiJdWt\nL/Ngd1K7/+/SW6IH6F3nNAug4rnII4vnm4NJ10YfaCYmVw7t+NJE3WMmYXNphiyP\na0UL4wSPfqvol1jRe+L2wuT0Nz3dCTyA4to1vUP/PYTDhQSr6JRUcv7vXCx1Oe/A\ncKKpd4u3N7gzXdOacPgO6FBOqXd0N0Gair6tusDW0TSteQgbdTI3dm9yb3dzeHJk\nNHNseC5vbmlvbjo5ODc4BgtNeSBjb21wdXRlcgUQggPmQsNF/pBZRrTPgfCzFgcD\nQrqE",
				"added": 1577936562
			}
		],
		"1_1arLQ9zeg1KzAQMJn8YVwtAX6LhXJkG2d": [
			{
				"comment_id": 79,
				"body": "Всё будет как завещал Ороуэл в романе \"1984\". Уже все собственно шагает к этому семимильными шагами. Что ещё обсуждать? Одно и то же пережевываем.",
				"added": 1578449383
			}
		],
		"17_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 80,
				"body": "Карту вы оформляете себе и оставляете, хоть закрывайте на следующий день. Мне она не нужна. Мне важен сам факт оформления и получения. Она только ваша, её реквизиты мне так же не нужны. Никаких подводных камней.\nАлкаши не подойдут т.к. они не адекватны и выглядят не прилично.\nКстати таким образом я могу и до 3000 перевести и больше, но тогда карт нужно будет оформить не одну. Опять же они только ваши. Вышли из банка, получили мой перевод, закрыли карту. Все просто.",
				"added": 1579353736
			}
		],
		"8_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 81,
				"body": "Паршивая угосрегулированная контора пихает свои зонды всё глубже и глубже. Теперь при выборе роутера нужно ходить и смотреть как там у конкретной модели в dd-wrt и open-wrt. Вообще хотел бы наклейку на роутерах в магазине, типа \"Open-WRT-ready\"",
				"added": 1582936531
			}
		]
	},
	"comment_vote": {
		"5_1HV141A2vZRjYcjAhoGhnmsdD9mfHAAr5e": 1,
		"250_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"10_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": 1,
		"7_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"108_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"22_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo": 1,
		"1_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u": 1,
		"2_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u": 1,
		"3_1EEHPWzHXCE19GRjRe2T3HgypFjtZLcX8u": 1,
		"5_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": 1,
		"144_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1
	}
}