{
	"message": [
		{
			"body": "Bonjoir",
			"date_added": 1554582405123
		},
		{
			"body": "bonsoir! oulà y'a de l'activité en ce moment lol",
			"date_added": 1554662476097
		},
		{
			"body": "salut à tous! Comment ça va? Il y'a eu de l'activité fin avril ^^",
			"date_added": 1557140888518
		},
		{
			"body": "J'essaierai de venir plus souvent ici mais je ne puis rien vous garantir ..",
			"date_added": 1557140916435
		},
		{
			"body": "salut! Les réseaux (sociaux) centralisés sont de plus en plus censurés. Il faut que les gens se retrouvent de manière sécurisée sur le net. On peut monter son instance mastodon, son serveur Peertube ou bien venir ici et au  pire, mettre son site web sur TOR ;) ",
			"date_added": 1562504463722
		},
		{
			"body": "Salut! La quadrature du net, qui défend la liberté sur l'internet et montre qu'il y'a de la censure en France, n'a toujours pas de zérosite ni de site sur i2p... c'est paradoxal quand même !",
			"date_added": 1563208089585
		},
		{
			"body": "Salut! Même à 23h il y'a quelqu'un sur ZN lol",
			"date_added": 1567977649844
		},
		{
			"body": "Les gens qui se rendent compte de la censure, en France, viennent sur des réseaux comme ZeroNet",
			"date_added": 1567977892118
		},
		{
			"body": "Nous sommes des gens qui avons un ras-le-bol général en nous.. C'est usant de voir que nos concitoyens ne comprennent rien à la vie quotidienne... ",
			"date_added": 1567978051868
		},
		{
			"body": "L'Internet est aujourd'hui essentiel pour tout le monde, mais pas grand monde ne se préoccupe de la vie privée / confidentialité dans leur vie digitale",
			"date_added": 1567978154405
		},
		{
			"body": "Les gens s'habitudent aux pubs envahissantes / commerciales / à tendance politique etc... ",
			"date_added": 1567978787306
		},
		{
			"body": "Salut à tous! Katian fait un bon boulot sur le zerowiki et améliore la partie francophone de ZN. Aidons-le en le félicitant !",
			"date_added": 1568236718439
		},
		{
			"body": "je t'en prie, tout travail mérite récompense",
			"date_added": 1568404341256
		},
		{
			"body": "Tu sais, j'ai monté le ZeroWiki FR avec un autre utilisateur il y a 4 ans, et ça a beaucoup aidé les autres",
			"date_added": 1568404385806
		},
		{
			"body": "ors je suis content que tu poursuives la lignée ;)",
			"date_added": 1568404413433
		},
		{
			"body": "Bonjour à tous et toutes mes excuses pour cette longue absence..",
			"date_added": 1569486837204
		},
		{
			"body": "Là où j'étais, la connexion Internet n'était pas fiable et refusait les vpn.. ",
			"date_added": 1569486909395
		},
		{
			"body": "Quelqu'un parmi vous a déjà entendu parler de Scuttlebutt, c'est un réseau décentralisé qui a l'air de fonctionner comme ZeroNet?",
			"date_added": 1569525144301
		},
		{
			"body": "Je suis entrain de DL le logiciel depuis Github et c'est lent...mais ça paraît bien",
			"date_added": 1569525184673
		},
		{
			"body": "https://www.scuttlebutt.nz/",
			"date_added": 1569525196250
		},
		{
			"body": "le github: https://github.com/ssbc/patchwork/releases/tag/v3.16.2",
			"date_added": 1569525445147
		},
		{
			"body": "Salut à tous ;) Super les histoires de radio, ça m'a toujours épaté l'échange d'informations sans fil !",
			"date_added": 1570485417942
		},
		{
			"body": "C'était la folie dans les années 80, avant la régulation des radios sur la FM",
			"date_added": 1570485451135
		},
		{
			"body": "Rappelons d'ailleurs que la Tour Eiffel a eu sa deuxième utilité grâce à la radio (militaire) au début des années 1900 (ce qui a empêché sa destruction)",
			"date_added": 1570485609981
		},
		{
			"body": "Bonjour bonjour les pirates :D",
			"date_added": 1570893102970
		},
		{
			"body": "le wiki d entraide est traduit ;) bonne journée",
			"date_added": 1570896541977
		},
		{
			"body": "Tout le plaisir est pour moi. N'hésite pas à me demander si tu as besoin",
			"date_added": 1570995892830
		},
		{
			"body": "Salutations! Beaucoup de sites internet parlent de censure sur l'Internet, de liberté d'expression etc..mais combien ont un Zerosite ou site TOR, en onion?? En France, la Quadrature du Net (LQDN) a un site en .onion, tout comme certains journaux (fdesouche). Mais sur ZeroNet??? Il y a Torrentfreak qui a un Zite: http://127.0.0.1:43110/1JNqdTGVATFWRLzzYwVu19CuWYus5VmoUS/",
			"date_added": 1572640103978
		},
		{
			"body": "TorrentFreak est américain mais c'est un des seuls géants du web qui a un Zite..",
			"date_added": 1572640148386
		},
		{
			"body": "bonsoir à tous! Vous êtes où les franchouillards?",
			"date_added": 1574701112426
		}
	]
}