{
	"title": "ThornRanger",
	"description": "My ZeroBlog.",
	"links": "*   [Source code](https://github.com/HelloZeroNet)\n*   [Chat Room](http://127.0.0.1:43110/1LXyUFYUPyVW6GBYnG8NzhEr2q9wLWjMnZ)\n*   [My IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh)\n    [My KopyKate](http://127.0.0.1:43110/big.kopykate.bit/index.html?Channel=thornranger@zeroid.bit)\n*   [My ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh/thornranger@zeroid.bit)\n    [Bless Yahowah](http://127.0.0.1:43110/1CvHaGzDnp6MuqPKDxF26YYeNv7kHb34kv/)",
	"next_post_id": 17,
	"demo": false,
	"modified": 1538962837,
	"post": [
		{
			"post_id": 16,
			"title": "New, highly stable catalyst may help turn water into fuel",
			"date_published": 1538235084.691,
			"body": "September 28, 2018 by Lois Yoksoulian, [University of Illinois at Urbana-Champaign](http://illinois.edu/)\n\n[![New, highly stable catalyst may help turn water into fuel](https://3c1703fe8d.site.internapcdn.net/newman/csz/news/800/2018/newhighlysta.jpg)](https://3c1703fe8d.site.internapcdn.net/newman/gfx/news/2018/newhighlysta.jpg)\n\nPostdoctoral researcher Jaemin Kim, professor of chemical and biomolecular engineering Hong Yang and graduate student Pei-Chieh (Jack) Shih are part of a team that developed a new material that helps split water molecules for hydrogen fuel production. Credit: L. Brian Stauffer\n\nBreaking the bonds between oxygen and hydrogen in water could be a key to the creation of hydrogen in a sustainable manner, but finding an economically viable technique for this has proved difficult. Researchers report a new hydrogen-generating catalyst that clears many of the obstacles—abundance, stability in acid conditions and efficiency.\n\nIn the journal _Angewandte Chemie_, researchers from the University of Illinois at Urbana-Champaign report on an electrocatalytic material made from mixing metal compounds with substance called perchloric [acid](https://phys.org/tags/acid/).\n\nElectrolyzers use electricity to break [water molecules](https://phys.org/tags/water+molecules/) into oxygen and hydrogen. The most efficient of these devices use corrosive acids and electrode [materials](https://phys.org/tags/materials/) made of the metal compounds [iridium oxide](https://phys.org/tags/iridium+oxide/) or ruthenium oxide. Iridium oxide is the more stable of the two, but iridium is one of the least abundant elements on Earth, so researchers are in search of an alternative material.\n\n\"Much of the previous work was performed with electrolyzers made from just two elements—one metal and oxygen,\" said Hong Yang, a co-author and professor of chemical and biomolecular engineering at Illinois. \"In a recent study, we found if a compound has two metal elements—yttrium and ruthenium—and oxygen, the rate of [water-splitting reaction](https://phys.org/tags/water-splitting+reaction/) increased.\"\n\nYao Qin, a co-author and former member of Yang's group, first experimented with the procedure for making this new material by using different acids and heating temperatures to increase the rate of the water-splitting reaction.\n\nThe researchers found that when they used perchloric acid as a catalyst and let the mixture react under heat, the physical nature of the yttrium ruthenate product changed.\n\n\"The material became more porous and also had a new crystalline structure, different from all the solid catalysts we made before,\" said Jaemin Kim, the lead author and a postdoctoral researcher. The new porous material the team developed—a pyrochlore oxide of yttrium ruthenate—can split water molecules at a higher rate than the current industry standard.\n\n\"Because of the increased activity it promotes, a porous structure is highly desirable when it comes electrocatalysts,\" Yang said. \"These pores can be produced synthetically with nanometer-sized templates and substances for making ceramics; however, those can't hold up under the high-temperature conditions needed for making high-quality solid catalysts.\"\n\nYang and his team looked at the structure of their new material with an electron microscope and found that it is four times more porous than the original yttrium ruthenate they developed in a previous study, and three times that of the iridium and ruthenium oxides used commercially.\n\n\"It was surprising to find that the acid we chose as a catalyst for this reaction turned out to improve the structure of the material used for the electrodes,\" Yang said. \"This realization was fortuitous and quite valuable for us.\"\n\nThe next steps for the group are to fabricate a laboratory-scale device for further testing and to continue to improve the porous electrode stability in acidic environments, Yang said.\n\n\"Stability of the electrodes in acid will always be a problem, but we feel that we have come up with something new and different when compared with other work in this area,\" Yang said. \"This type of research will be quite impactful regarding hydrogen generation for sustainable energy in the future.\"\n\nGraduate student Pei-Chieh Shih, Zaid Al-Bardanand and Argonne National Laboratory researcher Cheng-Jun Sun also contributed to this research.\n\n**More information:** Jaemin Kim et al, A Porous Pyrochlore Y2 [Ru1.6 Y0.4 ]O7-δ Electrocatalyst for Enhanced Performance towards the Oxygen Evolution Reaction in Acidic Media, _Angewandte Chemie International Edition_ (2018). [DOI: 10.1002/anie.201808825](http://dx.doi.org/10.1002/anie.201808825)\n\n**Provided by:** University of Illinois at Urbana-Champaign\n\n[](https://m.phys.org/news/2018-09-highly-stable-catalyst-fuel.html)"
		},
		{
			"post_id": 15,
			"title": "My Quadrifilar Antenna",
			"date_published": 1537647839.253,
			"body": "My first attempt at a quadrifilar antenna for receiving weather satellites and such. I have yet to get a good reception. I may make another attempt in the future. The thing is that i have seen many people make these and they seem fairly simple, but i'm missing something.\n\n![20170930_211842.jpg (767x1365)](data/img/post_15_20170930_211842.jpg)"
		},
		{
			"post_id": 14,
			"title": "Yowm Kippurym",
			"date_published": 1537647805.389,
			"body": "This Day of Reconciliations, is the official celebration of our adoption. It is our coming out party, our welcome to eternity. Now that we are properly prepared, the next and final step in our journey will be to camp out with God."
		},
		{
			"post_id": 12,
			"title": "Bless Yahowah",
			"date_published": 1537647500.845,
			"body": "[http://127.0.0.1:43110/1CvHaGzDnp6MuqPKDxF26YYeNv7kHb34kv/](http://127.0.0.1:43110/1CvHaGzDnp6MuqPKDxF26YYeNv7kHb34kv/)"
		},
		{
			"post_id": 11,
			"title": "My Video Channel",
			"date_published": 1537647446.805,
			"body": "[http://127.0.0.1:43110/big.kopykate.bit/?Channel=thornranger@zeroid.bit](http://127.0.0.1:43110/big.kopykate.bit/?Channel=thornranger@zeroid.bit)"
		},
		{
			"post_id": 10,
			"title": "My IFS",
			"date_published": 1537647405.59,
			"body": "http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:1Mz1_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh"
		},
		{
			"post_id": 6,
			"title": "Cheap Thermoelectric Generator",
			"date_published": 1535992844.863,
			"body": "Does this project spark your interest?\n\nBecome a member to follow this project and don't miss any updates\n\nBuilding a Thermoelectric generator as cheaply as possible, capable of charging a mobile phone, using the Seebeck Effect.\n\nHow to build a Thermoelectric generator cheaply for survival camps. Designed to be very efficient. (They are also known as Seebeck Generators).\nThe TEG I am building will be able to power/charge a 5V device through a standard USB \"Type A\" port.\n\n**Why and how it works:**\n\nThermoelectric generators (TEG) work in an extremely clever way. TEGs work using peltier devices which are essentially two ceramic plates with semiconductors in-between. These are normally used in fridges and kettles for camping; when a current is placed across the peltier, it can cause it to rapidly heat to boiling in just a few minutes, or simply by reversing the polarity it can quickly drop below freezing point.\n\nBy reverse engineering these small devices; rather than placing the current through them we give the device a temperature difference on each ceramic plate it will produce D.C. voltage (Emf-Electromotive force [battery voltage]). The higher the temperature difference the higher the voltage generated.\n\nThis works because rather than giving the peltiers electrical energy to create heat (or negative heat), we are providing the heat to get electricity from the device. (Diagram is in the project gallery).\n\nIt is known as the Seebeck effect (temperature difference to electricity), the opposite of the Peltier effect (electricity to heat/temperature difference).\n\n* * *\n\n**The Circuit Schematic: 3V, 1A to 5V, 600mA.**\n\n![8600261453658192512.png (556x393)](data/img/post_6_8600261453658192512.png)\n\n[![](Cheap%20Thermoelectric%20Generator_files/8600261453658192512.png)](https://cdn.hackaday.io/images/8600261453658192512.png)\n\nThis Schematic is a possible way to convert the output from the generator/s to the required Current and Voltage. The 3V battery can be replaced with the TEG. (Image: Adafruit - MintyBoost V2). For ease, the MintyBoost V3 can be used instead and can be bought as a kit through [adafruit.com](http://adafruit.com/), the battery connectors can then be attached the the correct leads on the TEG.\n\n[![8739441473258350216.jpg (886x1182)](data/img/post_6_8739441473258350216.jpg)](https://cdn.hackaday.io/images/8739441473258350216.jpg)\n\n**The Module Design.**\n\n[![](Cheap%20Thermoelectric%20Generator_files/2335771453566458225.jpg)![2335771453566458225.jpg (794x1123)](data/img/post_6_2335771453566458225.jpg)![6126451453569743411.jpg (886x1182)](data/img/post_6_6126451453569743411.jpg)​​​​​​​](https://cdn.hackaday.io/images/2335771453566458225.jpg)\n\n[![](Cheap%20Thermoelectric%20Generator_files/6126451453569743411.jpg)](https://cdn.hackaday.io/images/6126451453569743411.jpg)\n\nThe design of each of the modules of the circuit. (I have changed the design slightly, as to what is seen above, so that it has holes on one side of the bottom can, see below). Each can of the module were attached securely using duct tape (sellotape in the prototype - above, right).\n\n[![9768231473257362488.jpg (886x1182)](data/img/post_6_9768231473257362488.jpg)](https://cdn.hackaday.io/images/9768231473257362488.jpg)\n\n* * *\n\nThis device was a proof of concept, and performed brilliantly and fully worked, with only four modules and four tea light candles, it was able to charge a mobile phone to full charge. (I recommend not testing this on your own phone as it may break it if the wiring was not correct or a component was damaged).\n\nAt some point in the future I will try to make a more efficient version of this. Feel free to use this design or modify it as you wish.\n\n* * *\n\n[![9792051475697974872.jpeg (1024x576)](data/img/post_6_9792051475697974872.jpeg)](https://cdn.hackaday.io/images/9792051475697974872.jpeg)\n\nThis is an image of the TEG powering some LED lights.\n\n|\n\nAdobe Portable Document Format - 534.02 kB - 01/12/2016 at 09:48\n\n| [Preview](#) | [Download](https://cdn.hackaday.io/files/8364357845376/TEC1-12706_40,40,3.8.pdf) |\n\n### [lt1302.pdf](https://cdn.hackaday.io/files/8364357845376/lt1302.pdf)\n\nLT1302 - Micropower High Output Current Step-Up Adjustable and Fixed 5V DC/DC Converter (Linear Technology).\n\nAdobe Portable Document Format - 317.88 kB - 01/12/2016 at 09:46\n\n| [Preview](#) | [Download](https://cdn.hackaday.io/files/8364357845376/lt1302.pdf) |\n\n### [78xx.pdf](https://cdn.hackaday.io/files/8364357845376/78xx.pdf)\n\nVoltage Regulator Data Sheet for the 78xx series, use if you want to have the current at 1A rather than 600mA.\n\nAdobe Portable Document Format - 1.76 MB - 01/12/2016 at 09:55\n\n| [Preview](#) | [Download](https://cdn.hackaday.io/files/8364357845376/78xx.pdf) |\n\n[View all 3 files](https://hackaday.io/project/8364/files)\n\n*   8 × Aluminium Cans (diameter >5cm) 2 per module\n*   4 × Peltiers TEC1-12706 To generate the electricity\n*   1 × Thermal Paste 16g Used to attach the peltiers to the cans\n*   1 × Duct Tape or Aluminium Tape To hold the cans together\n*   1 × Candles or other form of heat (per module) To provide the required energy (spares may be needed)\n*   1 × LT1302CN8-5 IC For the Conversion Circuit\n*   2 × 220µF Capacitor For the Conversion Circuit\n*   2 × 0.1µF Capacitor For the Conversion Circuit\n*   2 × 100K Resistor For the Conversion Circuit\n*   1 × 1N5818 Schottky Diode For the Conversion CircuitDiscrete Semiconductors / Diodes and Rectifiers\n\n[View all 18 components](https://hackaday.io/project/8364/components)\n\n*   ### [Project Finished!](https://hackaday.io/project/8364/log/45251-project-finished)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 09/07/2016 at 17:51 • [0 comments](https://hackaday.io/project/8364/log/45251#discussion-list)</small>\n\n    I have finally got round to finishing this project page, I hope you like it. If you have any suggestions or find any errors please could you let me know. Thank You.\n\n    * * *\n\n    This Project was a proof of concept that you could charge a mobile phone using a cheap (<£30) thermoelectric generator (which is outside). I will possibly do another in the future to make it much more efficient and maybe even cheaper.\n\n    Feel free to use anything on this page as you wish, and to even contact me for any questions.\n\n*   ### [This will be updated soon, I promise...](https://hackaday.io/project/8364/log/37231-this-will-be-updated-soon-i-promise)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 04/30/2016 at 21:50 • [0 comments](https://hackaday.io/project/8364/log/37231#discussion-list)</small>\n\n    Sorry this project has not been updated for a while I have not yet abandoned or finished it, it is just that i currently do not have enough time to complete this page but I will hopefully finish it by the beginning of September. I promise... fingers crossed.\n\n*   ### [New Design & Schematic!](https://hackaday.io/project/8364/log/30719-new-design-schematic)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 01/23/2016 at 16:39 • [0 comments](https://hackaday.io/project/8364/log/30719#discussion-list)</small>\n\n    I have now uploaded the new version of the design for the modules and the schematic which i now much cheaper and smaller (see project details). The TEG now will only need 2 modules to charge a moblie phone (depending upon cirumstances, e.g. a hot day would make it less efficient). I will have four modules two to charge a phone and the other two, to power some LED lighting.\n\n    I am still waiting for the rest of the parts to arrive (8th Feb) so the build should start soon, and more updates will follow that date.\n\n*   ### [Prototype Module Made](https://hackaday.io/project/8364/log/29238-prototype-module-made)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 12/18/2015 at 22:17 • [0 comments](https://hackaday.io/project/8364/log/29238#discussion-list)</small>\n\n    Hi all, I have finally had the time to create a prototype module of the thermoelectric generator. I have gained some positive results however the schematic will be redesigned and the diagrams to accommodate what I have found through my time testing the module. It currently produces a maximum e.m.f. of 1V7 (1.7V) and a current of around 1A; this is being powered by two tea light candles.\n\n    There will be more to come in the new year, as I am currently bogged down with work and thus have no time (I also have to wait a long time for the components to be shipped from China - during Christmas time). I plan on making this project as detailed as I possibly can to benefit as many people as possible.\n\n    ps: Thanks to all those that are following or have skulled my project.\n\n    [![6673781450476456531.jpg (1177x889)](data/img/post_6_6673781450476456531.jpg)](https://cdn.hackaday.io/images/6673781450476456531.jpg)\n\n*   ### [How/why it works & Project image added](https://hackaday.io/project/8364/log/27659-howwhy-it-works-project-image-added)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 11/08/2015 at 16:26 • [0 comments](https://hackaday.io/project/8364/log/27659#discussion-list)</small>\n\n    I have created a new sub-section in the details area, about how and why peltiers work the way they do in case anyone is interested in that kind of thing.\n\n    I have also created an image showing off how the Seebeck effect works; which is currently being used as the project image until I actually make this thing.\n\n*   ### [Circuit Schematic V1](https://hackaday.io/project/8364/log/27657-circuit-schematic-v1)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 11/08/2015 at 13:14 • [0 comments](https://hackaday.io/project/8364/log/27657#discussion-list)</small>\n\n    I Have designed the circuit schematic for the Survival TEG.\n\n    The circuit allows the control of voltage (Emf) into the regulators to prevent over heating or to increase voltage if there is not enough. If a regulator is not being used, the current from that regulator can be redirected into the regulator above it if needed.\n\n    (The Schematic is in the Project Details section)\n\n*   ### [Module Design](https://hackaday.io/project/8364/log/27655-module-design)\n\n    <small>[Alex Vear](https://hackaday.io/hacker/62249-alex-vear) • 11/08/2015 at 13:00 • [0 comments](https://hackaday.io/project/8364/log/27655#discussion-list)</small>\n\n    I have designed the Modules, they will be arranged in a 5x2 formation. Since peltiers produce electricity when there is a temperature difference across them I have therefore designed the modules to have a heat absorption side which transfers the heat to one side of the peltier this heat is then removed and dissipated from the cool side which contains water to further enhance the heat removal.\n\n    The module designs are in the details section of the project.\n\n[View all 7 project logs](https://hackaday.io/project/8364/logs)"
		},
		{
			"post_id": 3,
			"title": "Install ZeroNet on Debian CLI",
			"date_published": 1535312380.643,
			"body": "[ZeroNet to Debian CLI install](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1535306529_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh)"
		}
	]
}