{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1600648926,
			"title": "Mainstream TRULY anarchist song wtf",
			"body": "I want to share with you De andré - Il pescatore (1970)\nhttps://www.youtube.com/watch?v=ijEHZufmKU8\n\nIt is a song that made an incredible success especially in Italy, the author was heavily influenced by anarcho-egoism by Max Stirner and all the songs practically speak of anarchy very explicitly, from here I cannot understand how he managed to have all this success seen not everyone likes anarchy. For example, this song is against revenge/judgment, against authority, against anything, it is about a fisherman who without thinking twice feeds a murderer who asks him for food and then the fisherman does not say anything to the police who passes after. Lately I've been seeing people trying to interpret and interpret songs of the genre, maybe that's how the mainstream liked it, giving it very abstract meanings far from the real ones. In any case it is an interesting thing, despite this author and his songs are practically in the first place of the things most loved by Italians, anarchy is still very far away, which is a counter sense. Definitely a good \"experiment\" to understand how humans work.\nHere is the lyrics of the song translated into English:\n\nIn the shadows of the last sunlight\na fisherman dozed off,\nand he had a deeply furrowed brow\nalmost like a kind of smile.\n\nTo the beach came an assassin,\ntwo eyes as big as a child’s,\ntwo eyes enormous with fear -\nthey were mirrors of some adventure.\n\nHe begged the old man gimme some bread\nI’ve little time and too much hunger, and\ndemanded of the old man gimme some wine\nI’m thirsty, and I’m an assassin.\n\nThe old man opened his eyes a peak to the day\nand didn’t even look around,\nbut he poured the wine and broke some bread\nfor whoever said he was thirsty and hungry.\n\nThere was a warmth in the moment, then\nthe assassin turned anew towards the wind\nand turned again towards the sun,\nbehind him was a fisherman.\n\nYes, behind him was a fisherman,\nand the memory is already painful,\nis already the regret of an April that\nplayed out in the shadows of some back yard.\n\nTwo gendarmes came on horseback,\nthey came armed in their saddles,\nthey asked the old man if anywhere nearby\nthere might have passed an assassin.\n\nBut in the shadows of the last sunlight\na fisherman dozed off,\nand he had a deeply furrowed brow\nalmost like a kind of smile.\nAnd he had a deeply furrowed brow\nalmost like a kind of smile.",
			"added": 1600648925
		}
	],
	"topic_vote": {
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1600266690_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"1601057533_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 1,
				"body": "> [scotcyguy2](#comment_46_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): You don't think there is anything wrong with making 11 year old girls grind around in small outfits like porn stars????   If you are a man, castrate yourself...if you are a women please never have kids [...]\n\nI saw the trailer and it didn't seem outrageous to me and it also has its reasons for existing. Nobody made this whole mess with Stanley Kubrick though, apart from the censorship, but I talk on a social level.",
				"added": 1600506028
			},
			{
				"comment_id": 10,
				"body": "> [blkdissident](#comment_9_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): Kubrick watered down Lolita from the book, and both book and movie had the same end message: this pedo shit ain't it. Cuties has no message\n\nThe plot is about a message though.",
				"added": 1600982603
			},
			{
				"comment_id": 12,
				"body": "> [thorburn](#comment_143_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Isn't the point of social engendering to send messages created to nudge and normalise dysfunctional/desired behavior in order to bring about social acceptance? Isn't the object to gently send a message in order to change social behavior, in small incremental stages, which aren't jarring enough to provoke a negative reaction en mass?\n\n> [reichama](#comment_30_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): This isn't the beginning of the end. For that you are a few hundred years too late. WWII was basically the end of any meaningful resistance already. Now we're just on a roadmap towards total destruction. Just like Rome was. Next up, the new dark ages.\n\nI think staying high all day is the best way to be happy regardless of everything.",
				"added": 1601038586
			}
		],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 2,
				"body": "> [krombopulusmike](#comment_25_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): VPN #1 -> TOR -> Anonymous VPN -> Anonymous and Elite SOCKS5 Proxy (if necessary for task at hand.) [...]\n\nthe vpn at the end is pretty useless, especially if you use a sock.",
				"added": 1600506336
			}
		],
		"1562405706_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 3,
				"body": "For an ID system the best is to give the possibility to use a decentralized domain (like namecoin) also for users. Zeronet should be in this way too, not some unelegant centralized ID system. There is a motivation if top decentralized projects use this stuff, even if it is less comfortable.",
				"added": 1600507375
			}
		],
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 4,
				"body": "I think he is a fed trying to censore zeronet or something. Another interpretation is that he wants to build a game for kids and for some motivations he wants it P2P, maybe he doesn't have money to maintain it, IDK.",
				"added": 1600541598
			},
			{
				"comment_id": 7,
				"body": "> [kapec](#comment_57_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): There is a simple difference between censorship and filtering.Censorship is imposed on you, filtering is not. [...]\n\nWhen it is enabled by default, it is indirect censorship.",
				"added": 1600764162
			}
		],
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 5,
				"body": "This requires further investigations, in any case I understand the difficulty of Tor Project in managing similar situations.",
				"added": 1600602582
			}
		],
		"1600648926_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": [
			{
				"comment_id": 6,
				"body": "> [krombopulusmike](#comment_36_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): Anarchy was popular in the pop punk culture of the 1980s. So, that probably has a lot to do with it I am sure.\n\nI was wrong, it's from 1970, anyway it's a ballad",
				"added": 1600710564
			}
		],
		"1600650663_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 8,
				"body": "Connect your phone to your linux server with a public IP or a vpn if you don't want exposures.",
				"added": 1600786124
			}
		],
		"1600774973_1Jxw16HD6aiTyRHnpwE7tupnLn8SCsKaEA": [
			{
				"comment_id": 9,
				"body": "> [insanecriminal](#comment_1_18SFer1zAMegr8LEtnFPWK8MnneWkYtZzr): indicative \n\nTLS 1.2 has some vulnerabilities",
				"added": 1600805040
			},
			{
				"comment_id": 18,
				"body": "> [gitcenter](#comment_1375_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That's unlikely. Perhaps they just don't want eSNI to be publically available.\n\nProbably",
				"added": 1602859354
			},
			{
				"comment_id": 19,
				"body": "> [kakalykyd](#comment_2_12Kp1EgVRD8d9URYbCXBxESmqC3UXy4TBS):     insanecriminal: How likely would you think that this is actually an indicative that they can break TLS <=1.2?\n\nhttps://calcomsoftware.com/leaving-tls1-2-using-tls1-3/ anyway probably the real problem for the gov is eSNI",
				"added": 1602859428
			}
		],
		"1601010152_1JzVFcSHTgVo7B3XWbznqCrooUdMsDgM94": [
			{
				"comment_id": 11,
				"body": "Are you sure this isn't fake? Like old leaks with find and replace?",
				"added": 1601029220
			},
			{
				"comment_id": 13,
				"body": "> [topnet](#comment_25_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd): the nt5src file is open you can download\n\nExactly, the is no need to crack the rar. You can compile the nt5src without too much trouble.",
				"added": 1601225479
			}
		],
		"1601666943_1DFditCMdpMNrzNxNrsfiHyyUD69dsHkBB": [
			{
				"comment_id": 14,
				"body": "Of course, yes if you want to help the network. Like any p2p software.",
				"added": 1601670997
			}
		],
		"1602348205_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 15,
				"body": "> [weatheralex1](#comment_1_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7): Why do you need bitcoin?\n\nfor drugs or food I think",
				"added": 1602427513
			}
		],
		"1602091740_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 16,
				"body": "You can exploit instagram",
				"added": 1602428600
			},
			{
				"comment_id": 17,
				"body": "> [leaks](#comment_2_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU): exploit how exactly?I did manage to decompile the truecaller apk to work with APIs inside, but they're rate limited per user. How would instagram help here?\n\nExploit to not be limited by instagram APIs and simply export the db like how someone did in the past.",
				"added": 1602830430
			}
		],
		"1604801704_1JFd5LoD35AWE1dTNRkbCm4Yyjonw5KAao": [
			{
				"comment_id": 20,
				"body": "What the fuck is wrong with Mozilla? It is completely unexpected. Shameful.",
				"added": 1605000899
			}
		]
	},
	"comment_vote": {
		"24_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"6_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"789_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"4_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD": 1,
		"4_1N2VV3mbu9KLbSxTpedj9JvaQ51v9vNEN3": 1
	}
}