{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1619248411,
			"title": "[MEGA POST] Holocene Extinction  - What is the latest specie to have gone extinct this week?",
			"body": "I guess the more dramatic question, is how many already this year? I don't know... 1000? more? that's interesting how it's all about CO2 (plant food) meanwhile some of those species have seen ice ages, etc, and have now come to their extinctions, and not due to CO2... \n\nbut if the hitlerian youth, excuse me, the autistic lead low iq , only censored information, only care about co2, demands, it is still not a reason to let those no iq let the extinction happen.\n\n\"The Holocene extinction, otherwise referred to as the sixth mass extinction or Anthropocene extinction, is an ongoing extinction event of species during the present Holocene epoch (with the more recent time sometimes called Anthropocene) as a result of human activity.[3][4][5] The included extinctions span numerous families of plants[6] and animals, including mammals, birds, reptiles, amphibians, fishes and invertebrates. With widespread degradation of highly biodiverse habitats such as coral reefs and rainforests, as well as other areas, the vast majority of these extinctions are thought to be undocumented, as the species are undiscovered at the time of their extinction, or no one has yet discovered their extinction. The current rate of extinction of species is estimated at 100 to 1,000 times higher than natural background extinction rates.[4][7][8][9][10][11]\"\n\nat least the next King of England and all possession thereoff is aware of this really serious issue... I hope everyone in the uk (and I mean all those who will never be subject of the king, from birds to roaches) will be able to make it... and no co2 isn't their problem at all...",
			"added": 1619248410
		}
	],
	"topic_vote": {},
	"next_comment_id": 115,
	"comment": {
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 1,
				"body": "> [neversurrender](#comment_37_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E): You can't imagine how I hate eli chouraki,. [...]\n\nI agree this man is a dangerous jewish supremacist. It's proven, in the sense that when Polanski raped a 13 yo girl drugging her with champaign and pills, for Eli Chouraki working for i24, it's almost an honor for the girl and her parent that she was raped by such a talented jew. \n\nI hate this thing sooo much.\n\nAnd however when it's saraha hamlimi, he has his uzi in hands, because no serfs (those whose daughters are even unvolontary serf sex toys to his ideology of \"chosen people of god\"), are allowed to kill them.\n\nI hate this guy beyond all men, I have ever saw on tv...\n\nThis is the reason, the source of the fall of france,... this mindset... I hate them so much (not all jews, but all jews who think they are bound to have rape rights on goyim children and have a special set of laws for them, a woman killed is a woman killed, unless they believe to be a superior race, like some germans).\n\nI hate this guy, and I am polite by using the word guy here.",
				"added": 1618913702
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 2,
				"body": "A question about Moskow, capital of the russian federation : is it safe to park a bike without a triple lock, removing the chair, and even the front wheel? I mean in china if I park a bike in a small village, it will be there, unless an emergency forced someone to rent it for free for said emergency. in major cities, it would only be a confusion, quickly realized by a drop in credit score :D.\n\nSecond, I have the impression that \n\nMoskow is a yuge city...\n\nI mean that the building may look small in size, but it's just that they are proportionnate, meaning that they are yuge, like a long time to walk a block.\n\nsecondly, I imagine that the soviet blocks apparements have big ceilings? and are well insulated from inner noise?\n\n3. I believe there are a lot of public space, park to walk, kids play ground, all over the city and around, all of this artifical, and untold expanse of wilderness not that far... (the last bus stop before the wild).\n\n4. I believe internet works fine, in term on bandweight and ping to moskow.\n\n5. I believe it's a tiered city, in the sense there is the oligarch world (whose kids maybe skating in the public skat park) but whose general cost of living is insance, aka the daily buffet, must cost a lot but for impecable food/service, however I am not sure that it's the funniest place of russia, then there is the world of putin and co, I mean, who knows, it's beyond the grasps of mere mortals (the blue lights incidents), and finally there is Russia... friendly, nice, educated, and not afraid to go to the bar to forget where to return... the whole in superbe food quality, even if prepared fast... I mean great !\n\n6. I think there is a surchage of above ground traffic, and the same in the public underground transport system.\n\n7. I believe the hospital and many things like police station / firework etc building may look old, a lot still didn't get the latest equipement but that all works perfectly, in normal time, and exceptionally during stress :).\n\n8. I am curious about the air quality, specially during a no movement air day in winter with everything burning :)\n\n9. is the river clean enough again to be swam again? fish eaten?\n\n10. I am still a little bit afraid of the cold winter dark months... at least there is functionning airport :).\n\n11. how hard is it from moskow to go see a rocket launch in kazakstan?\n\nwho knows, who knows... at least snowden seems happy, and the best of all there aren't many americans ! and that has no price :).",
				"added": 1618914300
			},
			{
				"comment_id": 3,
				"body": "10. I don't believe that the avg population is very fluent in the fallen language of the west (amerikansky), by the grace of God, which protects them from all the filth narratives constantly spewed by those whose objectives are too insane to even be mentioned here :).\n\n(should learn the chinese, arabic, spanish, or what ever like portugues or japanese... but the fallen west, thumb down).\n\n11. how noisy is moskow? I believe that the giga living soviet blocks are quite quiet... the surrounding I mean, but that near traffic lanes... it's... there is some traffic see below point :).\n\n12. one think I like is that I don't expect other people than russians to rule moskow for the forseeable future, not like many fallen western countries... \n\nin short : great putin !",
				"added": 1618914837
			},
			{
				"comment_id": 4,
				"body": "ah yes how far does the wild life goes in the city?",
				"added": 1618914858
			},
			{
				"comment_id": 5,
				"body": "when was the last time a bear got lost in the red square? 100 years? 200 ? maybe less?",
				"added": 1618914883
			},
			{
				"comment_id": 6,
				"body": "are there rats in moskow? I mean...",
				"added": 1618914965
			},
			{
				"comment_id": 7,
				"body": "and the cockroaches? I can't imagine how strong they are... and smart... those whose seen many winters, and know where and how to hide to pass it...",
				"added": 1618915022
			},
			{
				"comment_id": 13,
				"body": "a last ditch effort proposal regarding navalny... his wife doesn't to be that dumb, so convocation at the mythical lubianka... for a 2 hours non stop exposure of all the american believe we know about their plans to overthrow putin, throw russia into chaos, to loot it, ruin it, and rape everyone they could get. once it's done, non stop... constant flow, the file is closed, a new guy, better a female enter and explain to her, we can find an arragement, navalny, leaves for the poorest oblast, for the forseeable future doesn't interfer in any way shape of or form with the national or international policy of russia (aka he can try to find out what's not working in this region, and even try legally to correct it with 0 foreign support) and live happily until he dies old, or die quicker. I hope she will understand, maybe bring her to cimeterary to explain her this part... if she wants him there with the others... her wish will be executed. I hope she will understand the grand gesture there...",
				"added": 1618923903
			},
			{
				"comment_id": 16,
				"body": "I saw the show... omg... with the lie detector... I would love to so much to pass to the lie detector, ag barr, trump, haspel, our \"demon nudelman\", ehad, and the list goes on,... accosta, gwb... clintons... ohhh... the list is so long, so the machines :).\n\nimpressive show ! but I don't really know what was going on... but impressive...\n\nI hope navlany's wife will be able to bring him back to sanity...",
				"added": 1618938263
			},
			{
				"comment_id": 18,
				"body": "the real talent isn't the machine, but the way of asking question... and more importantly to be able to follow up...\n\nlike is your name barr? where you the former ag of the usa... then it's hard\n\nwhy did you get pedogate covered up (for that it's mind reading machine, and even soo)\n\nso maybe...\n\ndid you got money or advantages by letting pedogate go? \n\nit's complex... high iq/concentration... but I guess at the begining it's hard \"to crack the shell\" and as soon as a trail is found with good preparation it becomes an open book... impressive anyway :).",
				"added": 1618939883
			},
			{
				"comment_id": 19,
				"body": "have you got training to fake lie detector :) ahahha a funny question...",
				"added": 1618939967
			},
			{
				"comment_id": 20,
				"body": "that's the moment the mind reader active, retracte all memories, and even use quantic physics to recreate it all , and provide an answer and or the replay... gamed set and matched...what always said the defense of china is a no limit game... at one point foreigners must understand... this is not your country. I hope that's the same for russia and Russians.",
				"added": 1618940086
			},
			{
				"comment_id": 21,
				"body": "did they used lie detector in gitmo?\n\nare you an afghan : yes (true)\nare you a terrorists : no (true)\ndo you have goats : yes (true)\nare you a taliban : yes (true)\nso you are a terrorists : no (true)\nonly conclusion : do you want to go to the beach before taking of to afghanistan... not sure (true) \nnever been to the beach (true)...",
				"added": 1618940388
			},
			{
				"comment_id": 94,
				"body": "Soo... I couldn't watched the whole as muscle soreness onset was terrible !\n\nbut I reached the single mother part...\n\nmy problem, our problem :\n\n1. I am below the 80% hypergamist threshold (meaning 20% of the men get all the tinder whores).\na. financially (slut upkeep)\nb. spiritually (conspirationist trigger, and most are so low iq, interests, faith, dignity, honor, care... I mean tatoowhorelowiqlowinformationnoeqtrash)\nc. phsyically...\n\nokay... I live that well, and it's only my own fault.\n\nHowever...\n\nI DON'T WANT TO PAY FOR THE BIMBO WHORES WHO GOT FUCKED BY THIER HYPERGAMIST DREAM, NOW SUCCESSFUL ALPHAWIDOW.\n\nI understand the grandeur to want to pay for those poor neglected and abandonned single mother children (of course all of this doesn't apply to our war or working hero who died during their duties and or accidents)... this is specifically a post to a subset of the single mother population...\n\nSo at least I want counter parties from them, I mean those mothers must learn, not only to become productive, but be exposed at least once their children are adult to their fallacies and their failing in a systemic methodic scientific way...and that's the trick, as I wished the help stop when they don't rear, but it will incite them more... senseless...\n\nthe problem is that otherwise we end up in the greek trap, remastered to the modern time... in short the dindoo nuffin spawners... like the black woman in the usa with 10 children of 11 fathers... \n\nmeanwhile the other part of the greek heritage, is to condition so called \"wife material\" in those senseless professional carreer (and fake studies preceeding), and when we will need to fire them we will, and left alone will they be.\n\nmy point is that the whole fabric and mind conditionning of the greek, intented to cement an under farming class made to be raped, extracted and looted to sustain the so called democracy...\n\nGod blesses the farmer warriors of ROME who smashed this illusion and liberate greece from those clinging weak hands.\n\nseriously, watch out for the dindoo nuffin... remember it's not their skin color the problem, but their careless behaviors...\n\nps abms missile shields are such a joke if already a s200 can reach it :), I am curious how sorros, bloomberg, yellen and nudelman will think, glowy eretz? fine with me (it will be decontaminated later).\n\nedit : and exclusively for russian born females, otherwise you end up in the migrants trap, like in france where all the moonies go the hyperspawners population replacers...",
				"added": 1619075036
			},
			{
				"comment_id": 100,
				"body": "> [xealits](#comment_16_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6): the greatest and most muscular, of course\n\nWe don't ask putin anymore to be the muscle of Russia, However we now ask them (putin and those around him) to be beyond the brain of Russia, the coaches, to raise, help, coach and humble while promoting those who will come after them. \n\nConcerning the conventional Russian Forces, I guess, the little demonstration, which must always be reminded in the context of WMDs backing, was quite impressive, specially the tactical retreat... There is the saying in the USA of suicide by cops, facing the russian forces, conventional or not, is a one way street... I hope specifically that enemies of mankind, like nuland and co will be well advised to think... even if I believe that for her, it's already way too late... specially, later, when ukrainians will return to their senses...\n\n\n\n> [anonysan](#comment_29_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): ah, I see this thread has become a place to shill and dicksuck the Russian mafia state. Let me put this very simply to you: Russia is not anti NWO, they don't give a fuck about free speech, they don't give a fuck about freedom, and they don't give a fuck about the white race or ZOG or whatever nazi shit you care about. Russia censors websites all the time for abitrary reasons and as of now is building their own internet infrastructure so they can implement a great firewall just like in China, yet there are retards on here who have the audacity to defend these governments on a platform that was quite literally built for resisting censorship. Russia's corruption is worse than, if not just as bad as the corruption of oligarchs in the west. The grass is not greener on the other side just because they oppose your government, stop buying into this fallacy\n\nI think you don't understand Russians... I believe there are 3 ways. Power (force, strengh, warfare, etc), Logic (math, rationality, causes and effects) and sometimes, when it suits them, the great russian soul (altruistic, generous, the giving).\n\nLet's try... As you know russia has a sensible fiscal policy. A strong defense system, and everything for it for the future to belong to it. However, the plants of the creation. So let's try Logic :\n\n1 Netherland :\n\n\"The official legislative changes to introduce this policy took place in 1976. In 1980, the Dutch government finally announced it would discontinue prosecuting cannabis and hashish offenses under certain circumstances.\"\n\nLife expectancy : \n\n    The current life expectancy for Netherlands in 2021 is 82.49 years, a 0.17% increase from 2020.\n    The life expectancy for Netherlands in 2020 was 82.35 years, a 0.18% increase from 2019.\n    The life expectancy for Netherlands in 2019 was 82.20 years, a 0.18% increase from 2018.\n    The life expectancy for Netherlands in 2018 was 82.06 years, a 0.18% increase from 2017.\n\nIn 1976 it was 74.75 according to https://www.macrotrends.net/countries/NLD/netherlands/life-expectancy  \n\nMooniies :\n\nNetherlands GDP per capita \n\n    Netherlands gdp per capita for 2019 was $52,331, a 1.34% decline from 2018.\n    Netherlands gdp per capita for 2018 was $53,045, a 8.98% increase from 2017.\n    Netherlands gdp per capita for 2017 was $48,675, a 5.8% increase from 2016.\n    Netherlands gdp per capita for 2016 was $46,008, a 1.84% increase from 2015.\n\nIn 1976 it was $7,926 according to https://www.macrotrends.net/countries/NLD/netherlands/gdp-per-capita\n\nFor further discussion : https://www.macrotrends.net/countries/NLD/netherlands/economic-growth-rate\n\n2 Portugal \n\n\"In 1999, after the approval of a national strategy to combat drugs and drug addiction, the Portuguese government issued Law No. 30/2000, which decriminalized the acquisition, possession, and use of specified plants, substances, or preparations for a person's own consumption, and turned such conduct into misdemeanors.\"\n\n\n    The current life expectancy for Portugal in 2021 is 82.29 years, a 0.22% increase from 2020.\n    The life expectancy for Portugal in 2020 was 82.11 years, a 0.22% increase from 2019.\n    The life expectancy for Portugal in 2019 was 81.93 years, a 0.22% increase from 2018.\n    The life expectancy for Portugal in 2018 was 81.75 years, a 0.28% increase from 2017.\n\n\nin 2000 76.63\n\n    Portugal gdp per capita for 2019 was $23,252, a 1.32% decline from 2018.\n    Portugal gdp per capita for 2018 was $23,563, a 9.64% increase from 2017.\n    Portugal gdp per capita for 2017 was $21,490, a 7.57% increase from 2016.\n    Portugal gdp per capita for 2016 was $19,978, a 3.83% increase from 2015.\n\n\nin 2000 $11,725\n\n3 Uruguay :\n\n\"Cannabis is legal in Uruguay, and is one of the most widely used drugs in the nation. President Jose Mujica signed legislation to legalize recreational cannabis in December 2013, making Uruguay the first country in the modern era to legalize cannabis.\"\n\n\n    The current life expectancy for Uruguay in 2021 is 78.13 years, a 0.19% increase from 2020.\n    The life expectancy for Uruguay in 2020 was 77.99 years, a 0.19% increase from 2019.\n    The life expectancy for Uruguay in 2019 was 77.84 years, a 0.19% increase from 2018.\n    The life expectancy for Uruguay in 2018 was 77.69 years, a 0.17% increase from 2017.\n\nin 2013 it was 77.05\n\nGDP per capita.\n\n    Uruguay gdp per capita for 2019 was $16,190, a 6.3% decline from 2018.\n    Uruguay gdp per capita for 2018 was $17,278, a 0.26% decline from 2017.\n    Uruguay gdp per capita for 2017 was $17,322, a 12.58% increase from 2016.\n    Uruguay gdp per capita for 2016 was $15,387, a 1.45% decline from 2015.\n\nin 2013 it was $16,974\n\nSo we can see that there is no negative obvious impact in stopping criminalizing or legalizing this plant of the creation. \n\nIt's fundamentally a basic conception of civilized life, to whom belong the earth, what grows on it, and more importantly to whom belong your body. Is it the state and or religious / any form of power to decide what grows, and what do you use, or yourself?\n\nI don't want to ever live again in a state which believes to have a right to tell me what can I grow, what can I use from what I grow. I am not yours, nor theirs.",
				"added": 1619247034
			},
			{
				"comment_id": 103,
				"body": "wow : https://en.wikipedia.org/wiki/Voluntary_Human_Extinction_Movement",
				"added": 1619248274
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 8,
				"body": "kamalha harris wealth > SKYROCKETING !!!! congrats, fleecing some goyim, and they don't see it... they can't apprehend... gg on their biological and mental conditionning... great cattles ! I guess they are for the slauhgtering house or there is something left to milk? at least pedotrump gave some feed, hoping... maybe to have calves... hehehehe... \n\nthis is so fucking... this cia... pff. this all gang... the faster they are all killed , it can't be worst... in term human capital... low of the lows... even the castros didn't run child rape camps.",
				"added": 1618921178
			},
			{
				"comment_id": 9,
				"body": "the history of this country has ended.",
				"added": 1618921202
			},
			{
				"comment_id": 22,
				"body": "Will you support the jury what ever it is? me yes ! I like this american institution, with all it's flaws and co...",
				"added": 1618944032
			},
			{
				"comment_id": 24,
				"body": "And I didn't have the time to follow this trial... I mean... I am interested in the military trial of gislaine maxwell... military... trial... martial court... the beginning of the adventure...",
				"added": 1618944231
			},
			{
				"comment_id": 25,
				"body": "one sure thing the western msn played their hand well with this murder, in the sense that of all the people they could have chosen for martyrdom in their campaign to flush the ideals of the usa, and overthrow of trump, they took the case of one of the most worthless man on earth (flyod)... and how like cattles facing the corrals they all jumped, stupid, pathetic, putrid, brainless... anyway... \n\nat least everyone on earth knows what americans are made off and what the american real power structure is all about... \n\nit will only make the resolve of those not enslave, and or aware, readier than ever to not let themsleves be conquered by such filth.\n\nI still have this op, of a real 2nd independence war... ahhh... it will happen after all, all nations transitions... france is at it's 5th republic, at louis 18 (or maybe even 19) I mean, there was more dynasties in china that in egypt? things changed, but those crimes, will remain, as those who protected them (trump, barr, haspel, accosta, all the fbi, doj, ss, cia, dod)... \n\nlike even trees, they die too, but not the ideal of the forest, nor the idea of the tree...",
				"added": 1618944737
			},
			{
				"comment_id": 26,
				"body": "my real issue why the fuck let the guy on the road... okay he doesn't want to get into the car, taze him :D, moving on... or at least move him to the sidewalk... that's not possible, and as soon as he is arrested he is under the custody and care of the police, like chauvin now, or like epstein should have been... \n\nand in this regards, the \"sleepers\" data harvested? huu? pffff... sewerish...",
				"added": 1618944828
			},
			{
				"comment_id": 27,
				"body": "and staying on top of him... for so long so bad... but I wouldn't be surprised that flyod is a rapists too and that chauvin crew knew it... I mean even maybe with the judges and so called well thinking of the state...",
				"added": 1618944888
			},
			{
				"comment_id": 28,
				"body": "the state of decadance and impunity for real criminal in this former nation is beyond anything imaginable...",
				"added": 1618944909
			},
			{
				"comment_id": 29,
				"body": "and did floyd was handcuffed? I guess... so what's the problem...",
				"added": 1618945000
			},
			{
				"comment_id": 30,
				"body": "to press his corpse on the OPEN ROAD... madness...",
				"added": 1618945012
			},
			{
				"comment_id": 31,
				"body": "that he did OD, I don't say no... but what the cops squad did...  it's a collective responsibility... very bad...",
				"added": 1618945039
			},
			{
				"comment_id": 32,
				"body": "not a single one, with the public bringing awarness, to wake up, and say move away to the public, take the big guy and move him to the side walk to seat? I mean... but so much is fake / unknown in this story... pedogate cover up attempt + part of the establishement of the obiden ground forces to take over the street, to prevent maga people from meeting... full on take over... the clear guide book of the cia regime change...",
				"added": 1618945146
			},
			{
				"comment_id": 53,
				"body": "the new america can't emerge as long as the msn isn't flushed... I am even clement and friendly toward the owners... I prefer to kill the slaves... I find it funnier :) more batching, less mobility...",
				"added": 1618947495
			},
			{
				"comment_id": 60,
				"body": "the failure of the american intelligence was to become a feodal enforcing forces, and so they are in full cahoot with the msn... so sad...",
				"added": 1618949068
			},
			{
				"comment_id": 61,
				"body": "for what? this bet to take over the world? and now? what? exposed... so...",
				"added": 1618949159
			},
			{
				"comment_id": 62,
				"body": "ag barr is the cherry on the cake...",
				"added": 1618949170
			},
			{
				"comment_id": 63,
				"body": "personally, I still maintain that most american cops are victims in all this... specially because of the spice wars... however I would go defcon 0... leave... there is no hope :). I mean when the fbi/ cia / doj protects pedos.... you know, it's game over.",
				"added": 1618949267
			},
			{
				"comment_id": 64,
				"body": "what's the flag on top of the crossing in minneapolis?",
				"added": 1618949364
			},
			{
				"comment_id": 65,
				"body": "heheheheh....",
				"added": 1618949376
			},
			{
				"comment_id": 66,
				"body": "honestly, If I was an american cops, I would have organized to place all american cops family inside american military basis... you know... who knows what will happen...",
				"added": 1618949602
			},
			{
				"comment_id": 67,
				"body": "camping... you know some of those installations, are bigger than countries :)...",
				"added": 1618949645
			},
			{
				"comment_id": 68,
				"body": "and american cops didn't launch the war on drugs, not the pedos protection forces...",
				"added": 1618949702
			},
			{
				"comment_id": 69,
				"body": "that's congress...",
				"added": 1618949711
			},
			{
				"comment_id": 70,
				"body": "nor prohibition on alcohol...",
				"added": 1618949733
			},
			{
				"comment_id": 71,
				"body": "personally I have 0 idea... I don't know...",
				"added": 1618949825
			},
			{
				"comment_id": 72,
				"body": "hey hey... we don't give a shit about this shit... lol... no it's just funny....",
				"added": 1618950014
			},
			{
				"comment_id": 73,
				"body": "why care, those people fomenting narratives, all the time...",
				"added": 1618950034
			},
			{
				"comment_id": 74,
				"body": "american shit show...",
				"added": 1618950080
			},
			{
				"comment_id": 75,
				"body": "the crumbs entertainement, while kamala is setting up her bucks, the pedos are free... I mean... what the fuck... more pathetic that anything else.",
				"added": 1618950130
			},
			{
				"comment_id": 76,
				"body": "and me the most...",
				"added": 1618950138
			},
			{
				"comment_id": 77,
				"body": "the sadest is that this kind of psyplay or propaganda can work... like the conspriationist meme... you have to be fucking dumb to fall on that... conspiracy... life 101...",
				"added": 1618950573
			},
			{
				"comment_id": 78,
				"body": "without knowing anything , I would be so for innocent... what? afterall, a floyd less, is a good day ! yeaht the victim game, and the shot gun event, the fake bill, what the fuck... anyway... who knows, I don't have to :) sooo great !",
				"added": 1618950768
			},
			{
				"comment_id": 79,
				"body": "who knows... we are late...",
				"added": 1618950800
			},
			{
				"comment_id": 80,
				"body": "other people have other things to do...",
				"added": 1618950813
			},
			{
				"comment_id": 81,
				"body": "OD or not OD that's the question...",
				"added": 1618950826
			},
			{
				"comment_id": 82,
				"body": "if eats fentanyl of course he dies...",
				"added": 1618950839
			},
			{
				"comment_id": 83,
				"body": "all of this because of this drug war... that's so sad...",
				"added": 1618950860
			},
			{
				"comment_id": 84,
				"body": "but by design... that's the sadder...",
				"added": 1618950899
			},
			{
				"comment_id": 85,
				"body": "and the saddest is that most people felt in the trap of the drug war narrative...",
				"added": 1618950926
			},
			{
				"comment_id": 86,
				"body": "I said I wasn't there, nor near this charade... but if hte guy has OD because he has eaten one bags he couldn't throw, I would say that chauvin and co, because this harrassement on this guy is unjust to me, as he was part of a team, would be more failure to realize that he was \"killing\" him, in the sense of not readjusting and co...\n\nbut you know innocent or guilty, it will change nothing, it's drug war or not? pedo or not? a nation or not? basic question... messing with china or not? russia? same question... what is america, who are americans? hmmm",
				"added": 1618951172
			},
			{
				"comment_id": 87,
				"body": "a pedochildrapist criminalizing plants of the creation aristocracy cleptocratic based on narrative and colonialist... very bad, very very divergent from the text... occupying europe, asia, middle east... I mean... what's this?",
				"added": 1618951284
			},
			{
				"comment_id": 88,
				"body": "stupid question, but if one jury had said innocent, his/her name would have been known and he/she would have been killed by the mob? right?",
				"added": 1618953018
			},
			{
				"comment_id": 89,
				"body": "I mean, you can't wear a maga cap... so ...",
				"added": 1618953039
			},
			{
				"comment_id": 90,
				"body": "so cool appeal ! learned it on bloomberg :)",
				"added": 1618953478
			},
			{
				"comment_id": 91,
				"body": "and the squad of chauvin, all innocents?",
				"added": 1618953581
			},
			{
				"comment_id": 95,
				"body": "simple : \n\nattempting to save the \"international order\" = usa dies (and the nwo won't happen).\nor save america by saying fuck it to this world police impossible mission and MAGA !",
				"added": 1619076186
			},
			{
				"comment_id": 96,
				"body": "I love the tom cruise trigger, so well trained... did you know that 9 years after learning, turtle remember :)... at least, they say... they believe to say... their latest theory...",
				"added": 1619076259
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 10,
				"body": "personally, I am for executing an san suki... why? she like haspel... same trap... we say, ohh a girl, let's give her a chance, and then she fucks us (election fraud, full support for pedogate)... she got something in jail and died, boohooo...",
				"added": 1618922096
			},
			{
				"comment_id": 11,
				"body": "it will do a quick, I hope, flare up, to be tamed, and then maybe it's finally over, and ready for new election with the military / constitutional / independentists&sovereign COMMITTEE like in HK or IRAN to prevent the insertion of the agents of the nwo like trudeaux, obiden, macron etc...",
				"added": 1618922176
			},
			{
				"comment_id": 12,
				"body": "because I believe those filths of the western nwo, will attempt everything to take control of myanmar, until they are forced run, being hunted down to the 4 corners of the earth, and beyond...",
				"added": 1618922265
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 14,
				"body": "micah kubic, the... domestic enemy of the ACLU... huuu... DE.\nI like this anti looters, rioters laws... the carriage doctrine? the castle is nice, but be locked in... ehhhhh... the ship doctrine? I mean if pirates try to board another pirate ship, they better be well armed :) or wait the onset of the booze :).",
				"added": 1618925679
			},
			{
				"comment_id": 102,
				"body": "> [vitd](#comment_1_1K9573kaat62m4CzKCzGapVmWekXNReA2B): As VP Erin Olszewski? [...]\n\nThanks for sharing it, like it much... yeah, \"no treatment\" and still such survival rate... however i don't think there can ever be another real election in the usa, the cheating against trump was so massive, so obvious, that the obiden camp have absolutely all reasons to keep doing it. No one on earth will or can stop them. \n\nSo there could be the best candidates ever, they will just use their constant propaganda / disinformation campaign, backed by their total control of the fiat supply, the world leader support in the conquered west and of course the classical banana republic ballot stuffing... only next time, they will spread better during the counting their \"injections\".\n\nand if you dare to oppose them, you will be hunted down by the fbi... so it's nice to have dreams, however, sometimes, those dreams must include war, unless you prefer captivity and servitude, some do, I am not here to judge :).",
				"added": 1619248043
			}
		],
		"1618578079_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 15,
				"body": "the federalist seems nice, but it's still a gay pc version : we want the real deal  : https://nationalfile.com/author/tompappert/ or his buddy hawley... and did foxnews ever have the courage to bring the master, O'keife for a long segment, for example why did pedofoxnews supported for so long alan dershowitz? I mean... that would be courageous, but childrapists... what to expect from human filths, feeding their children, over the rapes of others... despicable. shameless, egoists, putrids , worthless scumbags... bahhhh...",
				"added": 1618925824
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 17,
				"body": "in my opinion, one of the problem of alex jones... \n\nis that he is american superiorists, he believes sincerly that the american system is the best in the world and most suitable for all people in the world. I fully disagree... totally...\n\nmy point is simple there is a bigger older world... with many ways of life, and organizations, and more and more...\n\nmy only point is don't infringe on others way of life...\n\nexample : you eat cats... fine for you (I mean you will have trouble, you can't imagine, but not from men, that would have been possible to win against), but what I mean, is your raise your cats, you eat your cats... poor people dooming themselves... but... however what I find INTOLERABLE is to tcapture the cats, catnapping, of others people and eat them !!!! ohhhhh the war crime. no civilized nation would steal the cats of others to eat them... war path for the cat janah...\n\nand that's just a little example, could be a cow, or sacred plant...\n\nso rather than whine all the time about china, china china... blah blah ccp, chicoms I don't know what, FOCUS ON YOUR COUNTRY and let us BE (we will anyway, with or without your consent... spare yourself the defeat).",
				"added": 1618938594
			},
			{
				"comment_id": 97,
				"body": "all employees of alexjones should wear China Flag T-shirts... it will trigger this sell out to the nwo so fast :).\n\n(if you were serious why don't you investitage the nwo personals (ivanka, sorros, murdoch etc, as before the sell out for the \"kiddies\"?).\n\nlosers & weaklets.",
				"added": 1619076393
			},
			{
				"comment_id": 98,
				"body": "so as the show is going nowhere..\n\n1. investigation on the ivanka, alexander sorros etc, their parties, where they laugh at us etc... not even a visit to pedoisland etc... losers, where is ag barr etc... \n\n2. comparison and progress tracking of the nwo plan (force vaxx, cashless, one world gov etc) specially in the five eyes and europe as they are the only low quality population to have surrendered so easily... (and fake jews occupying israel).\n\nthat would relaunch the show, in an extended end game...\n\nbut I get it, at least I believe, it was all a desenstivization, debuging session of this plan...\n\nsadly, for me it's clear :\n\nPLA4EVA !!!",
				"added": 1619076840
			},
			{
				"comment_id": 99,
				"body": "and you can spew your jaleousy, your anger of knowing to be defeated as much as you want, you can't ever even reach the outter rings of PLA, aka where the kill zones starts... you are too weak, in the mind, too servile, too doomed...\n\nyou want to oppose us, and like a trap beast you spin... which I shouldn't ... have fun ! and enjoy your defeat.",
				"added": 1619076923
			}
		],
		"1618878945_1FS7cWbFfDHBxfTJSWmko38NU2iSqoiob6": [
			{
				"comment_id": 23,
				"body": "welcome to zerotalkbiz: http://127.0.0.1:43110/1KpLYGMGkVSMyHjJzBhSFvN8qXK1xXExpN/",
				"added": 1618944079
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 33,
				"body": "I guess the fortune of mike pence has exploded following his treason? I hope he will see his daughter been executed.",
				"added": 1618945193
			},
			{
				"comment_id": 34,
				"body": "what's the hierarchical order of the feodal system\n\n1. chelsea or ivanka?\n2. pelosi\n3. pence?\n\nI guess? do they have titles? barronness ivanka? or that's too low for the young pale ?",
				"added": 1618945254
			},
			{
				"comment_id": 35,
				"body": "but attention, the black goddesses...",
				"added": 1618945276
			},
			{
				"comment_id": 36,
				"body": "that's the divine...",
				"added": 1618945283
			},
			{
				"comment_id": 37,
				"body": "/buffoons",
				"added": 1618945289
			},
			{
				"comment_id": 38,
				"body": "anyway the flush start with the bushes... unraveling of a tyranical regime...",
				"added": 1618945340
			},
			{
				"comment_id": 39,
				"body": "but I believe those americans will never have the courage, they are soooo weak... it's beyond anything...",
				"added": 1618945368
			},
			{
				"comment_id": 40,
				"body": "their only strengths is to find themselves excuses...",
				"added": 1618945392
			},
			{
				"comment_id": 41,
				"body": "I am not very familar with the \"Punic wars\" or the slave uprising... who knows... the barbarians (aka the real world) won... as it will... again... as always... :).",
				"added": 1618945486
			},
			{
				"comment_id": 42,
				"body": "mwhahahahaha.",
				"added": 1618945492
			},
			{
				"comment_id": 47,
				"body": "> [warfare](#comment_33_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv): Michael, Charlotte, and Audrey.\n\nahah ! I didn't knew that... greater ! more executionzzzz...",
				"added": 1618946182
			},
			{
				"comment_id": 48,
				"body": "you know it's one thing that those people enslaved and enserfs, raped and looted the american people, but they better accept that their feodal colonial model as reached it's limit, they better retrace... fast.",
				"added": 1618946294
			},
			{
				"comment_id": 49,
				"body": "because only because of the \"christians\" could they farm so fast and so much america, and I say christians, but that include all those atheists fake wannabe do gooders... remembers the old world is big fat fast wide and wild world... some ideologies have more war belly that all the western world combined...",
				"added": 1618946361
			},
			{
				"comment_id": 50,
				"body": "we don't play wars, we win them.",
				"added": 1618946373
			}
		],
		"1618945192_12vij5EwmiAG1R9wqX5VVkuqopsBKrBhTa": [
			{
				"comment_id": 43,
				"body": "i have...\n\nit's called :\n\nfree\n\nspeech",
				"added": 1618945541
			},
			{
				"comment_id": 44,
				"body": "I don't believe in the financialization of speech... then it's fear, it's restrain, it's trying to please, to conform, to lose free speech...",
				"added": 1618945630
			},
			{
				"comment_id": 45,
				"body": "but an excellent topic for zerotalkbiz : http://127.0.0.1:43110/1KpLYGMGkVSMyHjJzBhSFvN8qXK1xXExpN/",
				"added": 1618945679
			},
			{
				"comment_id": 46,
				"body": "some have \"oracles\" that's fun :), when they cheat specially... hehehe.",
				"added": 1618945708
			},
			{
				"comment_id": 92,
				"body": "> [deuxzaron](#comment_140_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Apparently freedom of speech involves roaring turtles\n\nWhile typically thought of as mute, turtles make various sounds when communicating. Various species of both freshwater and sea turtles emit numerous types of calls, often short and low frequency, from the time they are in the egg to when they are adults. These vocalizations may serve to create group cohesion when migrating...\n\nheheheheh...\n\nfurthermore : Based on body fossils, the first proto-turtles are believed to have existed in the late Triassic Period of the Mesozoic era, about 220 million years ago...\n\nso little rats on legs, behave, we roared and will roar well after you extinction...\n\nfyi : The most spectacular find of this kind to date occurred in 2009 in Shanshan County in Xinjiang, where over a thousand ancient freshwater turtles apparently died after the last water hole in an area dried out during a major drought.. ( at least the fresh water sharks died first. ahhaha, and why you couldn't find their remains? ahahahha).",
				"added": 1619073666
			},
			{
				"comment_id": 101,
				"body": "> [jpeer](#comment_1_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8): i like turtles\n\nAlligator snapping turtles have been around at least 20 million years, and their jaws and ridges are similar to the skin of an alligator. The interesting thing about them is that these turtles are one ferocious reptiles with strong beak-like jaw and large claws.\n\nWith the super strong jaws, these alligator snapping turtles have one of the strongest bites of any animals. Their jaws are capable of crushing our bones, and we should never handle them in the wild. That is why there have been reported cases where humans fingers have been cleanly bitten off by them. \n\nThis species is now threatened, and there are fewer than 900 of them in wild nowadays.\n\nhttps://whatdewhat.com/largest-reptiles-largest-turtles-world/",
				"added": 1619247725
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 51,
				"body": "if there is chaos it's the perfect moment to kill CNN personals... american wide at least... huuuuuu",
				"added": 1618947361
			},
			{
				"comment_id": 52,
				"body": "too weak... nation of pussies,...",
				"added": 1618947377
			},
			{
				"comment_id": 54,
				"body": "I see the feodalist drumb beaters trying their usual play... I have lost all , that could make me believe they were humans... they are standing in the way, in all ways... hehehehe.",
				"added": 1618947577
			},
			{
				"comment_id": 55,
				"body": "you know it would be too kind to kill them by american forces... those have become to gays, and don't understand why and what they fight for... sadly... or happilly... ahahah.",
				"added": 1618947622
			},
			{
				"comment_id": 56,
				"body": "it won't be even a though about blasting the whole atlanta core... pff. done , next...",
				"added": 1618947651
			},
			{
				"comment_id": 57,
				"body": "you let them drag you there... there will a price... we won't be defeated.",
				"added": 1618947685
			},
			{
				"comment_id": 58,
				"body": "and even more contrarian, the more american msn hated it self, the more we loved ourselves... like it's funny... but yeah... important to be selective in what is watched, and more importantly to know when it's eneny media...",
				"added": 1618947738
			},
			{
				"comment_id": 59,
				"body": "how can people become such sons and daughters of whores... those cnn workers are to be eliminated... it's so imperative... they can't live, they have to be off boarded...",
				"added": 1618948518
			}
		],
		"1619072865_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": [
			{
				"comment_id": 93,
				"body": "it's an idea, the problem is that you will burn id fast and worst they will instacensor your post as soon as one of their biobots report it.\n\nI would prefer a value extracting strategie ! for example create a chan on youtube, we launch auto play software, ip switcher and co, and take their moonnniiiesss away, less kids for eric schmidt to rape ! win - win.\n\nfor reddit, it's doomed, they are too low iq to be saved.\n\nhowever I was thinking that your post was about the rumored giant digital attack that the guidestone agenda prepare on the world to attempt to reduce the population, and others various objectives, like they did with covid to remove trump, take the bail outs, consolidate economic, legal and political power... but this time on a more digital infrastructure destroying mission...\n\nof course the cia is or to busy counting their loots or with them, hoping to have their digital enclave or what ever wicked plan of betrayal they have fostered since raping kids is part of their tactics.",
				"added": 1619073979
			}
		],
		"1619199374_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 104,
				"body": "You mean AMITT (Adversarial Misinformation and Influence Tactics and Techniques) ? \"roaring\", many ways...",
				"added": 1619248802
			}
		],
		"1618427843_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 105,
				"body": "don't forget to spit on any amerian corpses, those invaders, dishonest, honorless, occupiers, I hope will be killed and maimed to the last, until they finally leave the ground and sky.\n\nI hope that one day the world will realize that providing real sol air weapons to afghans, is a cheap and efficient way and step to one day kill the last american servant of this pedo feodalist aristocratic system... the last one.",
				"added": 1619945291
			},
			{
				"comment_id": 106,
				"body": "they aren't even worth spiting over... they are so worthless.",
				"added": 1619945320
			},
			{
				"comment_id": 107,
				"body": "kuffars, they haven't even gone ashtray, they have been born and raised ashtray... :).",
				"added": 1619945367
			},
			{
				"comment_id": 108,
				"body": "\"kuffar's spawns\".",
				"added": 1619945391
			},
			{
				"comment_id": 109,
				"body": "\"fallen\".",
				"added": 1619945399
			},
			{
				"comment_id": 110,
				"body": "dead flying and walking.",
				"added": 1619945407
			},
			{
				"comment_id": 111,
				"body": "for me the best of those to kill violently, beyond their \"press\" are the pilots... but never forget, fast... it's not an hollywood movie... ala khadaffi... fast life executions/postkill disecration...",
				"added": 1619945472
			},
			{
				"comment_id": 112,
				"body": "\"flying kuffars\"",
				"added": 1619945499
			},
			{
				"comment_id": 113,
				"body": "and frankly, if I could wipe 100% of the drone installation, florida etc... you have no idea how fast it would go, on the ahses of d.c. they would swim to the ocean to die... they would have seen, I don't think... they have to be treated like an invasion on mankind... it's not like a spider who gets in, which should be return to the wild, americans are just made to be killed, and that's how their leadership side sees them, and while they are sending them to be warring, they rape their daughters, children, wives, sisters, mothers, impunitly... it's perversion to innarrable level.",
				"added": 1619945620
			},
			{
				"comment_id": 114,
				"body": "> [roaringturtles](#comment_105_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd):  to one day kill the last american servant of this pedo feodalist aristocratic system... the last one.\n\nfedcoats have now cammo...",
				"added": 1619946217
			}
		]
	},
	"comment_vote": {}
}