{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "MESHENGER",
			"body": "Se qualcuno di voi usa meshenger può contattarmi qui\nLink per QRCode del mio profilo: https://mega.nz/file/ntQEmQAB#lWMB7Yovzq_HZkmCd875cEHTDqGyGhFMx1GsXr8nkmI",
			"added": 1598820242
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_17nEvSvj4DevhTAkNozSqveC6qxjFc6PR5": [
			{
				"comment_id": 1,
				"body": "io ho 2 profili. Qui su zerotalk italian la memoria è limitata.  Per cambiare account semplicemente sposto nella cartella di zeronet users.json (del profilo principale), Poi quando voglio cambiare profilo lo sposto in un'altra cartella e prendo l'altro users.json (quello di questo profilo)e lo metto nella cartella di zeronet. E' un metodo scomodo, ma meglio di niente",
				"added": 1598818889
			}
		],
		"2_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 2,
				"body": "ottimo lavoro! Prova a diffonderlo con un codice qr, magari non te lo bannano",
				"added": 1598818956
			}
		],
		"10_1NDdp5wQYRqdq2CeRVASnskd1EHkqS6RCQ": [
			{
				"comment_id": 3,
				"body": "be che dire, la particolarità dell'uomo è proprio quella di saper modificare l'ambiente a suo vantaggio. Torniamo a cacciare marmotte nudi e a dormire nel gelo della notte dentro qualche caverna umida e buia",
				"added": 1598819043
			}
		],
		"1_12HKV6wBYiPzwKePL558gczSEZsgAsdFVM": [
			{
				"comment_id": 4,
				"body": "a me piacerebbe crearne",
				"added": 1598819101
			}
		],
		"16_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 5,
				"body": "chikan non significa molestatore in giappo?",
				"added": 1598819141
			}
		],
		"3_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 6,
				"body": "> [potassio](#comment_3_1B6gdzykx5CeNEPWUsCGrsM5Gt34C8ZH2i): guarda ora in periodo di covid sicuramente OBBLIGARE I PROFESSORI a fare le STESSE ore che in classe visto che alcuni fanno i furbetti e non fanno nulla\n\nAlcuni. I miei professori invece si sono adattati perfettamente e svolgono il loro lavoro in maniera metodica e seria. Dal più anziano al più giovane",
				"added": 1598819271
			}
		]
	},
	"comment_vote": {
		"1_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1
	}
}