{
	"next_comment_id": 23,
	"comment": [
		{
			"comment_id": 1,
			"body": "Лог довольно активный, последние правки в этом месяце. Есть шанс, что автор смерджит апдейты, если [попросить](http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1M5dciFFSWt4wKs9Nnxa34BgGnt7os7h3v).",
			"post_id": 40,
			"date_added": 1518928291
		},
		{
			"comment_id": 2,
			"body": "Кстати, есть глюк. Если локально поредактировать файл, у меня ZN не хочет его обновлять даже по команде «Проверить файлы». Галка, что это мой сайт, снята, т.е. не  вней дело.",
			"post_id": 38,
			"date_added": 1518928477
		},
		{
			"comment_id": 3,
			"body": "> [balancer73](#comment_12_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): После локального редактирования нужно подписать и опубликовать :)\n\nЭто не мой сайт. :) Я экспериментировал с разными настройками сайта на чьем-то блоге, и потом эти изменения ZN отказался откатывать при помощи проверки файлов.",
			"post_id": 38,
			"date_added": 1518928894
		},
		{
			"comment_id": 4,
			"body": "Напомнило [интерфейс файлового менеджера в Mac OS](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/random-stuff/macosxdp1-1-1.png).",
			"post_id": 41,
			"date_added": 1518929872
		},
		{
			"comment_id": 5,
			"body": "> [stupidzeroid](#comment_1_1DX6GBJSVzFG33QkMzQEhDYBNsRE3hH9xj): Из тупых идей: Модерация как услуга, то есть шаринг стоплистов. И можно выбрать признаёшь пользователя модератором или нет.\n\nГениально!",
			"post_id": 40,
			"date_added": 1522408759
		},
		{
			"comment_id": 6,
			"body": "А как CoffeeScript собираешь? Встроенным в ZN компилятором собираешь или вручную?",
			"post_id": 43,
			"date_added": 1525248760
		},
		{
			"comment_id": 7,
			"body": "> [balancer73](#comment_16_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Встроенным механизмом ZeroNet по опции --debug.\n\nА он работает под Linux?",
			"post_id": 43,
			"date_added": 1525249446
		},
		{
			"comment_id": 8,
			"body": "Ох как у меня пригорает от этого чувомого workflow, в котором нельзя просто клонировать сайт и начать править код.",
			"post_id": 43,
			"date_added": 1525357090
		},
		{
			"comment_id": 9,
			"body": "> [balancer73](#comment_17_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Под Linux только и пользуюсь, в Windows не проверял :)\n\nТы в напрямую в реальной ОС запускаешь ZN? В докере эта штука точно не работает.",
			"post_id": 43,
			"date_added": 1525359862
		},
		{
			"comment_id": 13,
			"body": "В продолжение разговора с форума. IPFS классная штука, если надо пошарить картинку в клирнете.\n\nЕсли обычный хостинг картинок накрылся, то всё, с концами. А тут для пользователя остаётся возможность достучаться до картинки через IPFS напрямую (если ipfs.io упал), а для разместившего картинку — обеспечивать её доступность. Круто, что ID ресурса переживёт неисправность отдельных узлов инфраструктуры.\n\nНо в ZeroNet у нас уже всё это есть из коробки, а подключать еще и IPFS — плодить сущности. Не вижу преимуществ доступа к картинкам именно через IPFS, а недостатки в целом те же, что внутри самой ZeroNet + одна лишняя сущность.\n\nДумаю, надо средствами ZN вопрос решать.",
			"post_id": 46,
			"date_added": 1525611254
		},
		{
			"comment_id": 14,
			"body": "Условно свежий - 17.06.2017. Улыбнуло. ",
			"post_id": 47,
			"date_added": 1535435390
		},
		{
			"comment_id": 15,
			"body": "Кстати, насчёт этого:\n\n> Нигде его не светил, кроме двух своих домашних компов. Сейчас, два месяца спустя, этот блог раздают уже 19 узлов ZeroNet :)\n\nЕсли нода часто перезагружается, то все \"узлы\" могут быть старыми адресами этого самого узла. Но обычно таким образом получается 1-2 фантомных пира, не больше.\n\n> довольно интересно) как же они могли зайти на него? перебор всех возможных адресов?)\n\n> да, разумно, нодам нужно же знать к чему есть доступ у соседних нод..\n\nНет, это не PEX, это утечка через трекер. PEX работает только между узлами, которые уже раздают этот же сайт. А трекеру узел анонсирует все сайты. Может быть, это и не злой умысел даже, владелец трекера мог настроить автосидирование со своих машин из лучших побуждений, а БД трекера подключить как источник адресов.",
			"post_id": 47,
			"date_added": 1535473031
		},
		{
			"comment_id": 16,
			"body": "> [balancer73](#comment_21_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Гляжу в левом сайдбаре — у блога 6 пиров :D\n\nБгг.))\n\nХочу поднять свой трекер, и сделать сайт со статистикой сети, как она видится со стороны трекера.",
			"post_id": 47,
			"date_added": 1535536091
		},
		{
			"comment_id": 17,
			"body": "Бан на уровне фреймворка. Т.е. если топистартер забанен, движок видит посты в несуществующие темы. И не показывает их.",
			"post_id": 54,
			"date_added": 1541147791
		},
		{
			"comment_id": 18,
			"body": "> [balancer73](#comment_25_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Блин. Фигово. В этом случае получается, что мы после бана топикстартера не видим постов тех, кто занимается тем же самым. И помогаем эти посты распространять.\n\nID темы есть в постах отвечающих, значит можно собрать топик и без ОП. Придётся допиливать движок в этом направлении - чтобы такие безголовые темы были видны в ленте. Будет отображаться, в принципе, как обычно, но без заголовка и с постом первого (незабаненного) отвечающего вместо ОП.",
			"post_id": 54,
			"date_added": 1541148968
		},
		{
			"comment_id": 19,
			"body": "Подумал. Если форум собственный, не проще сразу на форуме забанить всех из своего блок-листа? Превентивно.",
			"post_id": 54,
			"date_added": 1541150512
		},
		{
			"comment_id": 20,
			"body": "> [balancer73](#comment_26_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n\nЕсли юзер забанен форумом, его тем никто не увидит. ZN их пересылать не будет.",
			"post_id": 54,
			"date_added": 1541151171
		},
		{
			"comment_id": 21,
			"body": "Бан же вручную осуществляется правкой правил сайта?",
			"post_id": 54,
			"date_added": 1541151266
		},
		{
			"comment_id": 22,
			"body": "> [balancer73](#comment_27_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Нет, я пишу про бан через блэклисты.\n\nДа, об этом шла речь исходно... Сейчас сображу, что хотел сказать. :D \n\nА, вот. То есть ты не хочешь воспользоваться силой админа и забанить их на форуме? Это точно проще, чем править код :)",
			"post_id": 54,
			"date_added": 1541158108
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"43": 1,
		"46": 1,
		"47": 1,
		"55": 1
	}
}