{
	"title": "Vive l'anarchie!",
	"description": "Blog sur les idées #anarchiste / #libertaire. N'hésiter pas non plus à consulter https://wlibertaire.net pour plus d'infos.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1568715218,
	"post": [
		{
			"post_id": 5,
			"title": "Il n'y a pas de gouvernements révolutionnaire",
			"date_published": 1568714792.178,
			"body": "<div class=\"entry-inner\">\n\n## Pourquoi vous ne pouvez pas utiliser l’État pour abolir la société de classe\n\n![Abolir la société de classe](https://i1.wp.com/wlibertaire.net/wp-content/uploads/2019/02/header-1.jpg?fit=1024%2C719&ssl=1)\n\n_Traduction d’un texte de_ [_Crimethinc_](https://crimethinc.com/2018/05/29/theres-no-such-thing-as-revolutionary-government-why-you-cant-use-the-state-to-abolish-class)_._\n\n_Version brochure en bas de page_\n\nEmma Goldman le savait. Mikhail Bakounine a prévenu tout le monde à ce sujet un demi-siècle avant la révolution russe. Les ancien.ne.s combattant.e.s du Black Panther Party et de la Black Liberation Army Ashanti Alston et Kuwasi Balagoon ont tiré la même conclusion. Le gouvernement révolutionnaire n’existe pas. Vous ne pouvez pas utiliser les instruments du gouvernement pour abolir l’oppression.\n\nDepuis le milieu du XIXe siècle, les anarchistes ont affirmé.e.s que la clé de la libération ne consistait pas à s’emparer de l’État, mais bien à l’abolir. Pourtant, de Paris à Saint-Pétersbourg, de Barcelone à Beijing, les générations de révolutionnaires les unes après les autre ont dû apprendre cette leçon à la dure. Changer les politicien.ne.s au pouvoir change peu. Ce qui compte, ce sont les instruments du_pouvoir_ – la police, l’armée, les tribunaux, le système pénitentiaire, la bureaucratie. Que ce soit un roi/une reine, un.e dicta.teur.trice ou un congrès qui dirige ces instruments, l’expérience des gouverné.e.s reste à peu près la même.\n\nCela explique pourquoi l’issue de la [révolution égyptienne](https://crimethinc.com/2012/01/25/egypts-ongoing-uprising) de 2011-2013 ressemble à celle de la [révolution russe](https://crimethinc.com/2017/11/07/one-hundred-years-after-the-bolshevik-counterrevolution-a-timeline-charting-the-destruction-of-popular-movements) de 1917-1921, qui ressemble à celle de la [révolution française](https://crimethinc.com/2016/06/23/the-democracy-of-the-reaction-1848-2011) de 1848-1851\\. Dans chaque cas, dès que les personnes qui ont fait la révolution ont cessé de tenter de réaliser d’une manière directe le changement social et ont tourné.e.s leurs espoirs vers des représentant.e.s politiques, le pouvoir s’est consolidé entre les mains d’une nouvelle autocratie. Que les nouv.eaux.elles tyran.ne.s soient issus de l’armée, de l’aristocratie ou de la classe ouvrière, qu’ils aient promis de _rétablir l’ordre_ ou de personnifier le pouvoir du prolétariat, le résultat final était à peu près le même.\n\n**Le gouvernement en lui-même est une relation de classe.** On ne peut pas abolir la société de classes sans abolir l’asymétrie entre _souverain.e_ et _gouverné.e._ L’économie n’est que l’un des nombreux domaines dans lesquels des différence de pouvoir codifiés sont imposés au moyen de constructions sociales; la politique en est un autre. La propriété privée du capital est à l’économie ce que le pouvoir d’État est à la politique.\n\n![Révolutionnaire](https://i2.wp.com/cloudfront.crimethinc.com/assets/articles/2018/05/29/4.jpg?ssl=1)Sans une critique de l’État, même les révolutionnaires qui réussissent sont condamné.e.s à devenir à leur tour des oppresseur.euse.s, prenant la place des dirigeant.e.s qu’iels ont renversés.\n\nMarx et Lénine ont créé une confusion énorme en promettant que l’État pourrait être utilisé pour _abolir_ la société de classes, pour après disparaître on ne sait comment . En d’autres termes, «les travailleur.euse.s» – c’est-à-dire un parti qui déclare les représenter, tout comme tout les autre partis au pouvoir l’ont fait – pourraient retenir les services de police, l’armée, les tribunaux, le système pénitentiaire, la bureaucratie, et tous les autres instruments de l’État, mais ceux-ci commenceraient magiquement à produire l’égalité plutôt que l’inégalité. Cela pose la question: qu’est ce que l’état? Il s’agit avant tout de la concentration de la légitimité politique dans des institutions spécifiques, par opposition aux peuples qu’elles dirigent. Telle est la définition même de l’inégalité, dans la mesure où elle privilégie ceux qui détiennent le pouvoir par le biais de ces institutions sur tou.te.s les autres. Alors même que les marxistes et les léninistes ont réussi.e.s à s’emparer du pouvoir au cours de dizaines de révolutions, aucune d’entre elles n’a réussi à abolir la société de classes. Au lieu de disparaître, l’État n’en est devenu que plus puissant et envahissant. Comme il est dit dans la [circulaire de Sonvilier](https://www.panarchy.org/jura/sonvilier.eng.html) : “Comment pouvons-nous espérer qu’une société égalitaire et libre émerge d’une organisation autoritaire?”\n\nLorsque les révolutionnaires tentent de réparer les inégalités de classe créées par la propriété privée du capital en donnant un contrôle total du capital à l’État, la classe détentrice du pouvoir politique devient tout simplement la nouvelle classe capitaliste. Le mot pour décrire cela est capitalisme d’État. Partout où vous voyez une représentation politique et une gestion bureaucratique, vous trouverez une société de classe. La seule _véritable_ solution aux inégalités économiques et politiques consiste à supprimer les mécanismes qui créent des différences de pouvoir, non pas en utilisant des structures étatiques, mais en organisant des réseaux horizontaux d’autodétermination et de défense collective rendant impossible l’application des privilèges de l’État ou de toute élite économique ou politique. C’est le contraire de la prise de pouvoir.\n\nLes gouvernements de toutes sortes s’opposent à ce projet. La première condition pour que tout gouvernement détienne le pouvoir est de parvenir à avoir le monopole la force coercitive. En luttant pour obtenir ce monopole, les despotismes fascistes, les dictatures communistes et les démocraties libérales se ressemblent. Et pour y parvenir, même le parti à l’apparence la plus radical finit généralement par s’entendre avec les autres ac.teur-trice.s du pouvoir. Cela explique pourquoi les bolcheviks ont employé des officiers tsaristes et des méthodes de contre-insurrection; cela explique pourquoi iels ont maintes fois pris le parti de la petite bourgeoisie contre les anarchistes, d’abord en Russie, puis en Espagne et ailleurs. L’histoire dément le vieil alibi selon lequel la répression bolchevique était nécessaire pour abolir le capitalisme. Le problème avec le bolchevisme n’était pas qu’il utilisait une force brutale pour pousser un agenda révolutionnaire, mais bien qu’il utilisait une force brutale pour l’écraser .\n\nCe n’est pas très populaire de reconnaître cela aujourd’hui, alors que le drapeau de l’Union soviétique est devenu un écran sombre et en retrait sur lequel les gens peuvent projeter ce qu’iels veulent. Une génération qui a grandi après la chute de l’Union soviétique a renoué avec le rêve selon lequel l’État pourrait résoudre tous nos problèmes si les bonnes personnes étaient aux commandes. Les apologistes de Lénine et de Staline ont exactement les mêmes excuses que celles des défenseur.euse.s du capitalisme, en soulignant les avantages dont bénéficient les consomma.teurs-trices sous leur règne ou en affirmant que les millions de gens qu’iels ont exploités, emprisonnés et tués ont fait réussir la révolution.\n\n![révolte 1956 Budapest](https://i0.wp.com/cloudfront.crimethinc.com/assets/articles/2018/05/29/1.jpg?ssl=1)Des chars russes roulant dans les rues de Budapest pour réprimer la [révolte de 1956](https://libcom.org/library/hungary-1956-reading-guide) .\n\nEn tout état de cause, un retour au socialisme d’État du XXe siècle est impossible. Comme le dit la vieille blague du bloc de l’Est, le socialisme est la douloureuse transition entre capitalisme et capitalisme. De ce point de vue, nous pouvons voir que l’ascension temporaire du socialisme au 20ème siècle n’était pas l’aboutissement de l’histoire mondiale prédite par Marx, mais bien une étape dans la propagation et le développement du capitalisme. Le «socialisme réel» a servi à industrialiser les économies post-féodales pour le marché mondial; il a stabilisé les travailleur.euse.s inquiet.e.s pendant cette transition, à l’instar du [compromis fordiste conclu](https://www.britannica.com/topic/Fordism) en Occident. Le socialisme d’État et le fordisme étaient tous deux l’expression d’une trêve temporaire entre le travail et le capital que la mondialisation néolibérale a rendue impossible.\n\nAujourd’hui, le capitalisme sans entrave du libre marché est sur le point d’engloutir les dernières îles de stabilité sociale-démocrate, y compris la Suède et la [France](https://crimethinc.com/2017/04/19/from-the-loi-travail-to-the-french-elections-a-retrospective-on-social-upheaval-in-france-2015-2017) . (NdT: C’est un texte provenant des états-unis, ne l’oublions pas) Partout où les partis de gauche ont pris le pouvoir avec la promesse de réformer le capitalisme, ils ont finalement été contraints d’appliquer un programme néolibéral comprenant des mesures d’austérité et de répression. En conséquence, leur ascension au pouvoir a épuisé les mouvements de base du moment, tout en permettant aux réactionnaires de droite de se faire passer pour des rebelles afin de tirer parti des inquiétudes populaires. Cette histoire s’est répétée au Brésil avec le [Parti des travailleurs](https://crimethinc.com/2018/03/12/brazil-2016-17-the-political-crisis-and-coup-detat-an-anarchist-analysis) , en Grèce avec [Syriza](https://crimethinc.com/2015/01/28/feature-syriza-cant-save-greece-why-theres-no-electoral-exit-from-the-crisis) , au Nicaragua avec l’ [administration Ortega](https://crimethinc.com/2018/05/06/the-april-19-uprising-in-nicaragua-an-interview-overview-of-events-and-analysis) .\n\nLe seul autre modèle de gouvernement «révolutionnaire» est le capitalisme d’État à visage découvert représenté par la Chine, dans laquelle les élites accumulent des richesses au détriment des travailleur.euse.s, tout aussi effrontément qu’aux États-Unis. Comme l’URSS avant elle, la Chine confirme que l’administration publique de l’économie n’est pas un pas vers l’égalitarisme.\n\nL’avenir sera peut être marqué par la misère néolibérale, par des enclaves nationalistes, par des économies totalitaires ou par l’abolition anarchiste de la propriété privé – il inclura probablement tout cela – mais il sera de plus en plus difficile de préserver l’illusion qu’un quelconque _gouvernement_ puisse résoudre les problèmes du capitalisme pour tou.te.s sauf pour quelques privilégié.e.s. Les fascistes et les autres nationalistes souhaitent ardemment tirer parti de cette désillusion pour promouvoir leurs propres labels de socialisme excluant; nous ne devrions pas leur faciliter la tâche en légitimant l’idée que l’État pourrait servir les travailleur.euse.s si seulement il était correctement _administré._\n\n![anti-autoritaire](https://i2.wp.com/cloudfront.crimethinc.com/assets/articles/2018/05/29/7.jpg?ssl=1)Vous pouvez imposer un schéma directeur à la société ou créer des espaces de liberté, mais vous ne pouvez pas faire les deux en même temps.\n\nCertain.e.s ont fait valoir que nous devrions suspendre les conflits avec les partisan.e.s du communisme autoritaire afin de nous concentrer sur des menaces plus immédiates, telles que le fascisme. Pourtant, la peur généralisée du totalitarisme de gauche a donné aux recruteurs fascistes leurs principaux sujets de discussion. Dans la course aux cœurs et aux esprits de celleux qui n’ont pas encore choisi de camp, cela ne pourrait que contribuer à distinguer nos propositions de changement social de celles avancées par les stalinien.e.s et autres autoritaire.\n\nDans les luttes populaires contre le capitalisme, la violence d’État et le fascisme, nous devrions accorder un poids égal à la lutte entre différentes visions de l’avenir. Ne pas le faire, c’est présumer à l’avance que nous serons vaincus avant qu’une de ces visions puisse porter ses fruits. Anarchistes, mencheviks, socialistes-révolutionnaires et autres ont appris à leurs dépens, après 1917, que ne pas se préparer à la victoire peut être encore plus désastreux que ne pas se préparer à la défaite.\n\nLa bonne nouvelle est que les mouvements révolutionnaires ne doivent pas nécessairement finir comme la révolution russe. Il y a une autre voie.\n\n![anticapitaliste](https://i1.wp.com/cloudfront.crimethinc.com/assets/articles/2018/05/29/3.jpg?ssl=1)Contre le capitalisme et l’Etat.\n\nPlutôt que de rechercher le pouvoir de l’État, nous pouvons ouvrir des espaces d’autonomie, en retirant toute légitimité à l’État et en développant la capacité de répondre directement à nos besoins. Au lieu de dictatures et d’armées, nous pouvons créer des réseaux rhizomatiques mondiaux pour nous défendre mutuellement contre quiconque voudrait exercer un pouvoir sur nous. Plutôt que de faire appel à de nouv.eaux-elles représentant.e.s pour résoudre nos problèmes, nous pouvons créer des associations basées sur la coopération volontaire et l’entraide. À la place des économies gérées par l’État, nous pouvons établir de nouveaux communs sur une base horizontale. C’est l’alternative anarchiste qui aurait pu réussir en Espagne dans les années 1930 si elle n’avait pas été piétinée par Franco d’une part et Staline de l’autre. Du [Chiapas](https://www.anarchismus.at/blog-anarchismus/7785-subcomandante-marcos-anarchists-welcome) et de la [Kabylie](https://crimethinc.com/2017/11/02/other-rojavas-echoes-of-the-free-commune-of-barbacha-an-autonomous-uprising-in-north-africa-2012-2014) à [Athènes](https://crimethinc.com/2008/12/25/how-to-organize-an-insurrection) et au [Rojava](https://crimethinc.com/2015/09/23/feature-understanding-the-kurdish-resistance-historical-overview-eyewitness-report) , tous les mouvements et soulèvements inspirants des trois dernières décennies ont incorporé des éléments du modèle anarchiste.\n\nLes partisans des solutions étatiques prétendent qu’iels sont plus efficaces, mais la question est de savoir en quoi sont-ils plus efficaces? Il n’y a pas de raccourci vers la libération; elle ne peut pas être imposé d’en haut. Si nous voulons créer une véritable égalité, nous devons nous [organiser](https://crimethinc.com/2017/02/06/how-to-form-an-affinity-group-the-essential-building-block-of-anarchist-organization) de manière à refléter cela, en décentralisant le pouvoir et en rejetant toutes formes de hiérarchie. En construisant des projets locaux capables de répondre aux besoins immédiats par [l’action directe](https://crimethinc.com/2017/03/14/direct-action-guide) et la solidarité, en les reliant à l’échelle mondiale, nous pouvons avancer sur la voie menant à un monde dans lequel personne ne peut _gouverner_ qui que ce soit. Le type de révolution que nous souhaitons ne peut se produire du jour au lendemain; c’est un processus continue de destruction de toutes les concentrations de pouvoir, de la sphère domestique à la Maison Blanche.\n\nÀ mesure que les crises de notre époque s’intensifient, de nouvelles luttes révolutionnaires vont forcément éclater. L’anarchisme est la seule proposition de changement révolutionnaire qui ne se soit pas ternie dans un océan de sang. C’est à nous de la mettre au jour pour le nouveau millénaire, de peur que nous ne soyons tou.te.s condamnés à répéter le passé.\n\n![Aucun gouvernement ne donne la liberté](https://i0.wp.com/cloudfront.crimethinc.com/assets/articles/2018/05/29/2.jpg?ssl=1)\n\n> Oui, la mort, — ou bien le renouveau ! Les États mis en pièces, et une nouvelle vie recommençant dans mille et mille centres, sur le principe de l’initiative vivace de l’individu et des groupes, sur la libre entente. Ou bien, toujours l’État écrasant la vie individuelle et locale, s’emparant de tous les domaines de l’activité humaine, amenant ses guerres et les luttes intestines pour la possession du pouvoir, ses révolutions de surface qui ne font que changer de tyrans et, inévitablement, au bout de cette évolution — la mort !\n> Choisissez !\n> \n> <cite>Kropotkine, L’état, son rôle historique</cite>\n\n* * *\n\n</div>"
		},
		{
			"post_id": 4,
			"title": "Qu'est-ce que l'anarchisme?",
			"date_published": 1568714204.363,
			"body": "_Tract des JL de Toulouse légerement remanié_\n\nDepuis longtemps les pouvoirs cherchent à modifier le langage à des fins politiques. C’est ce qui s’est passé avec le terme ” Anarchie ” qui a été utilisé comme synonyme de chaos d’une manière très efficace puisque cette définition est maintenant couramment admise.\n\nPourtant, ” Anarchie ” signifie étymologiquement ” absence d’autorité ” ce que les pouvoirs essaient d’associer à ” désordre ” pour justifier leur existence, pour légitimer le gouvernement. Les anarchistes ne sont évidemment pas des démons qui cherchent à répandre la terreur et le chaos. Simplement nous pensons que personne n’a le droit de diriger d’autres personnes. Nous pensons qu’il est nécessaire que chacun prenne sa vie en main sans remettre sa liberté entre les mains de professionnels de la politique.\n\nParce que nous plaçons la liberté individuelle et collective au-dessus de tout, nous luttons contre l’État et contre l’autoritarisme (aussi bien dans les familles, à l’école, au travail…). Adversaires de toute forme de domination, nous rejetons le système capitaliste basé sur l’exploitation et la soumission . De même nous rejetons le sexisme, le racisme et toutes formes de fascisme. Nous n’acceptons pas que des millions de personnes vivent dans la précarité pendant que quelques autres s’accaparent les richesses. Nous pensons au contraire que efforts et richesses devraient être répartis égalitairement selon les capacités, les envies, les besoins de chacun.\n\nEn définitive nous défendons un ordre social basé sur la liberté, l’égalité, et la solidarité dans lequel chacun puisse participer sans hiérarchie à la prise des décisions qui le concernent. Cela est présenté par le pouvoir comme irréalisable et utopique, cependant (et sans compter les moments historiques où cela a été mis en pratique) nous demandons :\n” Qu’est-ce qui est le plus logique et le plus juste ? “\n\nUn système basé sur la soumission et la contrainte ou un ordre basé sur la liberté, l’entraide et l’autogestion ?\nL’un se fonde sur une hiérarchisation oppressante, l’autre sur l’égalité entre les personnes et les peuples.\n\n**N’oublions pas que la société**\n**n’est que ce que les êtres humains en font**\n**et que le pouvoir ne se maintient que grâce à notre passivité.**"
		},
		{
			"post_id": 3,
			"title": "Bienvenue!\n",
			"date_published": 1568656548.281,
			"body": "Petit test de blog sur les idées anarchistes!"
		}
	]
}