{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1
	},
	"next_comment_id": 11,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test",
				"added": 1565204126
			},
			{
				"comment_id": 2,
				"body": "test",
				"added": 1565204184
			},
			{
				"comment_id": 5,
				"body": "> [fuhrer](#comment_1_17FPf2gMpv4fcnV5dRnKqj56JVagtkGNSF): breaker breaker\n\nreply function works like this\n\n> [gpsutps](#comment_1_13zJujgTGXKmoUHGGFazek97zrRwfXtv5g): Pepega \n\nhmmm \n\ninline reply> [jaytea](#comment_3_1EQNT6dAhq1cJPhZrHeSP6PSKNfVLt9Hje): bix nood\nyea\n\nyea",
				"added": 1565304942
			}
		],
		"1565140432_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": [
			{
				"comment_id": 3,
				"body": "Who the fuck cares? If the individual Jews support libertarian principles, yes, if not, no.",
				"added": 1565219894
			}
		],
		"1565211401_17Z4Nn5umMdKxmgypwHXfe34rqnPPAq6nP": [
			{
				"comment_id": 4,
				"body": "Nah, they don't. People who are emotional thinkers just use words like magic spells. They feel empathy for the illegals so they cast whatever chant that will get the result they want. Super surface level thinking, they only thing they really 'think' is 'x people bad'. That's why the insults change so often. Racist, sexist, bigot, nazi, misogynist, transphobe, islamophobe. You'll notice that no amount of reason will get them to admit you aren't one, you could be married to a black person and still be called a racist (milo), a jew and they call you a nazi (ben shapiro), etc. \n\nGet it through your head you aren't arguing facts, you're arguing feelings. I'm not sure myself how to deal with that irrationality. I've heard trying to out-crazy them works, and I've also heard to counter with lots of empathy. Let me know if you have any solutions. I just don't talk about anything substantial in public",
				"added": 1565304549
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 6,
				"body": "> [kaffie](#comment_898_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): How do you enforce the concept of ownership without coercion?\n\nOwnership is anything that you use first, got from voluntary transactions (includes gifts), or got from tort (compensation from criminals to victims). You can morally defend yourself, band together with neighbors, or hire someone who will defend your property for you. At least that's what I think, and I would live in an area where these were valid forms of ownership. \n\n> [kaffie](#comment_898_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): What will you do if I simply disagree you own the things you claim to own?\n\nIf you have a legitimate case then we can agree to a neutral third party to mediate. If I own it, and you try to take it, I can defend myself with lethal force. If you own it, you can take it back through force if necessary.  \n\nThese questions aren't specific to ancaps (true anarchists). How do YOU enforce the concept of no ownership? If I try to own something, will you take it by force. What will you do if I simply disagree I don't own the things I claim to own? Assault? Ancaps will let you have a commune if everyone agrees to it, would you say the same?\n\nRights are a reciprocal understanding. Once you no longer reciprocate, I no longer have to reciprocate.\n\n> [kaffie](#comment_898_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Why would you care to have some paper or some digital number increment arbitrarily?\n\nMoney isn't just paper, it's a reflection of the value you bring. It's very handy because resources are finite. There is no point to providing more value than you consume if you don't get compensated.\n\n\nUse to think everybody should be provided the basic amount to continue living no matter what. Really thought UBI was a good idea. The hardest red pill for me to swallow is that if you do not provide enough value to sustain your own life (and can't find someone/group of people to support you voluntary), you deserve to die. It is wholly immoral to force someone to provide you with food, home, electricity, all that stuff, because it makes them no more than a slave. You say you would be happy to provide, but when I was in your shoes hoping for UBI, that was an excuse. Really ask yourself if you are just hoping to be provided for or if you want to provide for others. Set yourself free, brother. At least we agree government sucks dick",
				"added": 1565309470
			},
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_910_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): What objective measure did you do to arrive at this conclusion? \n\nProperty ownership starts on the premise that you own your body. No one else can tell you what to do with your body, and even if they do they can't force your body to do what they want. You are the only entity capable of full control of your body, so you own it. I'm not sure if you agree or disagree with this premise but everything logically follows from there.\n\nIf you own your body, you also own the affects of your body. It is not someone else typing this response, it is MY response. If you do not own the affects of your action, you logically can not be criticized for the affects of your actions either, because they are not yours. I believe this is a contradictory stance to hold during a debate, seeing as how my opinion is like an affect of my body, kind of like talking to a rock. \n\nSince we own the affects of our body, if we use our body to produce something, we should naturally own that thing too. If I used my body to plant crops and then harvested those crops, no one else would be entitled to those crops. Since I own the labor of my body, and my owned labor produced crops, it would be a theft of the labor I expended creating that crops. Hence, it is my property. \n\nSo I have established you own yourself, your labor, and your property. First use is justified because anything is allowed as long as you are not infringing on other's property (which means includes their body, their most sacred property). Voluntary exchange is justified because to invalidate voluntary exchange would mean you have more right over what two people own than they do, and tort is justified because you are reclaiming damages done to your property from those who damaged it. They broke your right to property first, thereby forfeiting their right to non-aggression.\n\n\nI think this is our major disagreement and this is getting kind of long, so as for the rest of what you wrote\n>objective morality isn't a thing\nDebateable but whatever, doesn't matter. It is consistent with the non-agression principle, which is the basis of ancap society. \n>disagree with third party mediation\nThen i can tell you to fuck off. I own my shit. Just because you don't agree doesn't make your viewpoint valid. If I don't agree cutting off your arm is assault, it still is assault. I get you truly believe you are not stealing or doing anything wrong, but I also believe I am not assaulting you or doing anything wrong.\n>capitalism requires coercion\nopposite of capitalism. Boss + employee relationship is not coercive. It is a voluntary interaction that both can leave at any time. The boss has resources and a goal he needs done, and the employee needs resources and has labor to spare for that goal. Yes, the boss can tell the employee what to do, but the employee does not need to do it. Do not blame the facts of nature of requiring resources to survive. There are a billion options the employee can take, including becoming a boss themselves. \n>no ownership objectively exists\nawaiting your rebuttal \n>as long as you don't harm someone you're fine\nWhy? I thought morality was subjective? Are you going to violently assault someone for disagreeing with you?\n>capitalism steals from communities without ownership\nhuh? the default state of nature is definitely communties with ownership, and if you take their shit they are really mad. A few communistic communities have existed yeah, all I know of are small communities under a couple hundred and not very technologically advanced though. If anything, places with strong property rights grow big and when they are super wealthy then the poor want to eat the rich.\n\nI'll be back in the morning, good night",
				"added": 1565325116
			},
			{
				"comment_id": 8,
				"body": "> [kaffie](#comment_932_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I don't \"own\" my body. I inhabit my body. I am my body.\n\nGuess I should define my terms. When I say ownership I mean the right to exclude others from the use of that thing. Since in reality you are the only person who can exclude others from using your body however you want, then you own it. I really hope you aren't arguing that others have a right to override your right to excluding your body, or else others have a right to kill you, harvest your organs or whatever, rape you, enslave you, etc. Don't just say I disagree, explain why the premise - you don't own your body - would not logically follow people can override your consent.\n\n> [kaffie](#comment_932_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):By this logic you can \"sell ownership\" of your body and effectively be a slave?\n\nNo. Not in the ways being a slave matters. Slavery contracts are inherently impossible because you can't truly give your mind or body to someone else. Like making a contract with someone that includes you jumping over 500 m into the air.  Sure, if you are dumb enough you can sell doing whatever they tell you to do to someone, but at any time you can back out of the contract and suffer the penalties associated. Are you really a slave if at any point you can walk off the plantation? Also, good luck finding a neutral third party that agrees you owe your slaver anything in tort for breaking contract. \n\nBut, if some situation arises where some criminal has to pay tort for some horrible offense but are unable, I can see it being moral to force the person into a slavery of sorts. But only them and not any children the criminal has because they are not responsible for the sins of their parents. There is no reason to respect the rights of people who do not respect yours. They broke the NAP first.\n\nBut it's very ironic you are so concerned over slavery, which is exactly what you are advocating for. In your proposed system, they can't walk off the plantation, even if they are peaceful. All of their labor will be stolen by the community they reside in.\n\nAs for your many points of disagreement about property logically extending from self-ownership, I'll try a different approach.\n\nClearly, there is going to be conflict when two individuals try to use resources for different purposes. I think we can agree on that or else you live in a delusional world where there is infinite resources. Therefore, in order to resolve the resultant conflict, there must be an action-able principle to decide who gets to use that resource, if we live in a civilized society (we agree copyright is not a valid form of property, because a pattern is an infinite resource). When the principle is deployed, the winner of the conflict can be said to own that resource because he can exclude others from it. It is his property. We still don't know what that principle is, however. \n\nLogically, what is required to avoid all conflict is for all resources to be owned privately. This follows because if a resource is not owned, and it is desired by 2 or more people, it will be a source of conflict until it is owned. Say I want this unowned gold for computer parts and you want it for laboratory testing equipment. Only one of us will be able to use the resource. One of us gets to exclude the other, therefore one of us will end up owning it.\n\nSo now we have to uncover the principle from which private ownership is decided. It needs to unambiguously clear. One way that is logically consistent (and only way of first appropriation I know) is through first use. By definition, the person who uses it first is not acquiring property through conflict with others, as everyone else appeared on the scene only later.\n\nas for >do rocks, plants, and animals own themselves\nPlants and rocks no, rights are a reciprocal understanding and they have no capacity for that. This is because if they're not reciprocal, then you are being exploited. I am unsure about the animal question. The argument against is animals are not even potentially capable of respecting my rights, so i have no reason to respect theirs. The argument for is you should just kill the individual animals who harm you, not collectivize them.\n\n>marks on paper with pencil doesn't mean i own them\nit does if nobody owned them before (unlikely because they are a produced good). First use is only applicable if no one owns the thing before you.\n>handshake means i own you?\nsomeone owns the hand, therefore no\n\n>can you own a child (human)\nNo because rights are affordable to all who are or will become sentient. Every human life is sacred because we all will become sentient and capable of respecting other's rights. \n\n>can you own a child (chicken)\nIf sentient animals deserve the NAP, yes, if not, no.\n\n>can you own a child (human) mk. 2\nYou engaged in an act that you knew had a possibility to lead to a sentient life. By engaging in intercourse, you have agreed to the terms of conditions should you produce a life, and one of those means you do not get full authority over the fruits of your labor. Nothing inconsistent here. Just someone else's rights ending where someone else's begins.\n\n\nSeeing as how you hate property, would it be okay for me to use your toothbrush, eat off your plate, sleep with you in your bed, etc? If there is no such thing as ownership, do you have any privacy? Can I just follow you around and go into the bathroom with you all day if I want? Can I take your phone and use it myself? For anything? Can I use it to hammer nails in? Can I break anything you like? I would really like to hear your logical explanation why these things are not allowed or why they're not a problem, as well as why harming your body is wrong if you don't own it.",
				"added": 1565369034
			},
			{
				"comment_id": 10,
				"body": "> [kaffie](#comment_940_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Given you have several contradictions in your own retarded worldview, I'm not even going to bother addressing most of it. \n\nSuuuuuuuuure. \n\nWell than I'll do you the same courtesy. Not interested in talking with someone who just ignores most of what I say and insults me. Food for thought though, you believe in ownership too. You just believe you relinquish ownership of something the moment you stop using it.",
				"added": 1565444736
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 9,
				"body": "Do you glow in the dark, or do you need a vacuum discharge tube for that?",
				"added": 1565377598
			}
		]
	},
	"comment_vote": {
		"23_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1,
		"2_1A1iSrQ5HAds4kEYBNauMHgtDHFbe69hmy": 1,
		"25_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT": 1,
		"24_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT": 1,
		"16_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"23_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT": 1,
		"22_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT": 1,
		"4_1AARpJL8Wxtq6J3iwc5bHinsPxQFc1Z2z1": 1,
		"81_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"82_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"8_1AARpJL8Wxtq6J3iwc5bHinsPxQFc1Z2z1": 1,
		"1_18MDUdh92VJsG3QSLp26TJtvgbJ4KVL3UW": 1,
		"3_1N1dUmDRwutZqe9dm5MXLLbUGB6scNqKK": 1
	}
}