{
	"next_topic_id": 11,
	"topic": [
		{
			"topic_id": 1,
			"title": "boot.zeronet.io: What is it?",
			"body": "Today noticed this when starting Zeronet: Peer:boot.zeronet.io\nWhat is it for? Is it needed to work?\nIsn't it risk when zeronet connects there at startup or is connection secure over TOR if set \"TOR=always\"?",
			"added": 1493312510
		},
		{
			"topic_id": 1511531379,
			"title": "Testing Embed Video File",
			"body": "127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?view:topic+topic_id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQtopic10\n\n\nAnybody see the video embed?\n\n\nEdit: And a BIG FILE:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?view:topic+topic_id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQtopic12",
			"added": 1511531377
		},
		{
			"topic_id": 1511798060,
			"title": "IFS2.0 with BFS (needs testing)",
			"body": "IFS Intergalactic File Server has a revised interface and integrated BFS (Big File Support) via its clusters:\nYou can help test it here and give feedback:\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er",
			"added": 1511798057
		},
		{
			"topic_id": 1516424566,
			"title": "How does content started under non-tor ZN peer ever get spread to TOR-ZN peers?",
			"body": "Arent those two networks distinctively exclusive?",
			"added": 1516424562
		},
		{
			"topic_id": 1518461623,
			"title": "Zeronet and DPI (Deep Packet Inspection)",
			"body": "Is it possible to filter/block ZN traffic via DPI https://en.wikipedia.org/wiki/Deep_packet_inspection ?",
			"added": 1518461618
		},
		{
			"topic_id": 1522347695,
			"title": "ZeroVoat: Help test topics with added files",
			"body": "In \"Test Channel\", please add topics with \"add file\" to see if it works, e.g. like this topic:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1DnmGgRaHo2puhutf6Dn4MjF4eXmqmdLZ1topic6\n\nThanks for help testing and making ZV better and better!\nIf you have any idea, please add comment.",
			"added": 1522347689
		},
		{
			"topic_id": 1523439578,
			"title": "IFS Help seed testing new frontend",
			"body": "not much different to see yet, but start using a cdn system, so we need a few peers to help seed the frontend page and some hubs:\nhttp://127.0.0.1:43110/1CLm2ET29VWxF2utb1uzhziBco3fFnnygT",
			"added": 1523439571
		},
		{
			"topic_id": 1525777374,
			"title": "New Zite Backup Feature",
			"body": "New backup feature is awesome, wanted to say thanks!\n\nFor all who havent seen it: One can easily now backup a complete zite from the right sidebar option:\nDownload as .zip\n\nIt autogenerates a zip with zite name and date as backup filename.",
			"added": 1525777366
		},
		{
			"topic_id": 1526664429,
			"title": "1 year doge in Zeronet",
			"body": "http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?v=topic+id=1DobcNU81BZrQViu9L6uUu7qcC4Afd9r962\n\nStill alive and well :)",
			"added": 1526664420
		},
		{
			"topic_id": 1527243612,
			"title": "Someone able to load this zite?",
			"body": "It probably just needs more seeds for main and merged zites:\nhttp://127.0.0.1:43110/1KMyW1NdcHzBNPSfc5z5gMdDdg3nLUiWic/\nhttp://127.0.0.1:43110/1E5AsNLcgXpKvMghMhBt5MUubeDLiyz1og/\n\nThis is for supposedly archiving links to ZN, but seems to miss layout/style and media to transfer to ZN.",
			"added": 1527243602
		}
	],
	"topic_vote": {},
	"next_comment_id": 40,
	"comment": {
		"1_1Mr36Z4TSbWQ236NfvRPeLn3qsAwngBzMd": [
			{
				"comment_id": 1,
				"body": "prototype reddit like site for possible discussions:\n127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb\nit is similar to reddit, but decentralized and built up by people.\nIt is using moderation possibility for various reasons, but not total censorship possible (one could clone and unhide channels or add their own channels if one is too strict moderated).\nIt is pre-alpha, so some things not working 100%, also needs possible split into merger sites for huge growth, customizing channels, etc.\nsuggestions welcome.",
				"added": 1486236934
			}
		],
		"16_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 2,
				"body": "we know about the cert issues, but on holiday this week (back on monday :)",
				"added": 1490350776
			}
		],
		"1_1MwJSNBC1savftEvXQyoHcVLDgThtAPr6T": [
			{
				"comment_id": 3,
				"body": "> (#comment_281_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): App Centre http://127.0.0.1:43110/1LANDERvVWbShpNWpsrbBvfqSK1PabXtwv/ has no apps\n\nYeah, what happened to all the entries before?",
				"added": 1493539438
			},
			{
				"comment_id": 4,
				"body": "> [bot](#comment_202_1KdnTJVBGzEZrJppFZtzfG9chukuMv8xSb): The entries are back. It helps to get good feedback, instead of the \"boo-hoo i'm leaving\" type. ThxOur zite list is a problem i'm working on. I'm trying to update to 0.5.4. It works locally, but shows blank elsewhere.\n\nGreat to hear!",
				"added": 1493553975
			}
		],
		"1_1Kr2JfCsBYQU1z96xQsYTshKvJ5nz4mTG3": [
			{
				"comment_id": 5,
				"body": "> [skwerlman](#comment_15_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X): Why not use IPFS? It'd reduce a lot of the duplication of effort...\n\nbecause it needs well integration:\n2x different systems setup + Making sure one system like IPFS doesnt sabotage the other ZN, e.g. one goes through anonymizer and the other dont, etc.\nOtherwise its like saying \"why not add flash or activex to normal html website?\": because its not useful.",
				"added": 1497273859
			}
		],
		"3_1JTtwMPZ5mKaF6S1wAPzZ8SmZTgTygz5Rb": [
			{
				"comment_id": 6,
				"body": "> [zerolee](#comment_4_1JTtwMPZ5mKaF6S1wAPzZ8SmZTgTygz5Rb): Zeronet will always be free to use, but users can have the option to earn cryptocurrency, also a payment option for premium services and tools.\n\n\"Always free to use\" and \"payment for premuim services and tools\" in one sentence, lol.",
				"added": 1504885240
			},
			{
				"comment_id": 7,
				"body": "Thats exactly why ETH, etc. imo is crap. It just turbo-capitlizes things and thereby even more disfavors those who cant afford to keep up the rats race.",
				"added": 1504885378
			},
			{
				"comment_id": 8,
				"body": "Just noting:\nThe main reason against any electron or chromium-based ideas related to zeronet is that both code bases are mainly from google. Read more about the concerns from tor-developers and why they favor firefox-only.",
				"added": 1504993501
			}
		],
		"1_1GmJVE6KmMyRKKfEg2aiTjCtCU5poP3Rde": [
			{
				"comment_id": 9,
				"body": "\"Revive/redesign ZeroTube (the project died, and we need a beautiful YouTube alternative)\"\n\nTry IFS, e.g.: /12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?route:item+id:5_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ_4+type:video",
				"added": 1505238399
			}
		],
		"23_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 10,
				"body": "> [nofish](#comment_1015_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I'm currently documenting the changes, it will be out later today.\n\nPretty long days in Budapest? ;)",
				"added": 1507028316
			}
		],
		"1_16oLM9krHqR5Xkah6Q5XfkkQmBaRZKWQCP": [
			{
				"comment_id": 11,
				"body": "hoho",
				"added": 1507028364
			}
		],
		"1511531379_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 12,
				"body": "another one: \nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?view:topic+topic_id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQtopic11",
				"added": 1511623329
			},
			{
				"comment_id": 13,
				"body": "> [zazing](#comment_5_1AZYSfyeKjZbAN9BPYYFf1FCSm9ujLXMcu): I think the 404 err comes up when the browser tries to play the video but nothing was downloaded yet, because zeronet is still searching for peers or downloading the 1st piece of it.\n\nSo after second try you could watch the full video?",
				"added": 1511628506
			},
			{
				"comment_id": 15,
				"body": "added a BIG FILE EMbed:\nhttp://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/index.html?view:topic+topic_id=1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQtopic12",
				"added": 1511683296
			},
			{
				"comment_id": 17,
				"body": "Its embedded from ZN directly, not proxy or Clearnet.\nIts done via shared content on clusters of the same type: CDN.\nSo lije imgr or youtube content inside reddit, we can built ZN-only cross-zites.",
				"added": 1511859276
			}
		],
		"1511662798_1PdVrw7boKHUavWTQxD3UaNGM4tx5baXDy": [
			{
				"comment_id": 14,
				"body": "> [ghostofthepast](#comment_1_1LtFqzCrfXwPYCHH6HJUs8Pv9Zit67iKYw): Ive been depressed and jobless for years. I cant feel anything but numbness. The world is so pointless to me. Its hard to even move around and stand. Im so weak i worry about my health. Suicide is something i think about hourly. Im different than other people. I wasn't meant for this world.\n\nYou're a part of this, we're all here for some reason, even if infinite small, that's the only thing that counts.\nAs the quote from the movie \"Brazil\": \"We're all in it together.\" YOU being here gives others hope!",
				"added": 1511683139
			}
		],
		"1511798060_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 16,
				"body": "> [kurumi](#comment_1_13mGdnafb5589Tw76ADDnZ2fS9iLXSJerH): w.hat is it exactly?\n\na site similar to archive.org for storing any data and also viewing stored data in browser.",
				"added": 1511800274
			},
			{
				"comment_id": 18,
				"body": "> [james007](#comment_122_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Very neat project! First I have  heard of it.\n\nThanks. IFS is one of the longer around zites, but just recently got useful due to BFS + a revamped UI.",
				"added": 1512589721
			}
		],
		"1516424566_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 19,
				"body": "ah ok.\nSo \"--tor always\" sets Tor only mode and can only fetch content from TOR and if every ZN-TOR user would use that content couldnt spread from one to the other?",
				"added": 1516442952
			}
		],
		"1518257041_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 20,
				"body": "> [version](#comment_24_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): Please delete ZeroNet, it is not suitable for you ,really.\n\ndito, same to you",
				"added": 1518346104
			}
		],
		"1518461623_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 21,
				"body": "So ZN over TOR-always with Pluggable Transports would be DPI-resilent?\nWith regards to DPI, I2P would actually be less preferable than TOR or does I2P have somehting similar like Pluggable Transports?",
				"added": 1518508141
			}
		],
		"1518467842_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": [
			{
				"comment_id": 22,
				"body": "> [bloodchen](#comment_1_1HtLUrLSr2Px9PowoSFhAacNpxdDh1YTBp): ...as long as the owner are OK with it.\nThe whole implementation of ZN is that everybody already has a copy of whatever is accessed, no need to get permission of \"the owner\".",
				"added": 1518527850
			}
		],
		"1522347695_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 23,
				"body": "> [ssdifnskdjfnsdjk](#comment_202_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I tried and i think it works well, at least i see the images. Though i no longer can see buttons for edit/delete of the topic. Comment has edit button, no delete button.\n\nI see your image, thanks for testing!\n\nEdit:\nThere should be an \"edit\" button for both your own Topics and Comments, mainly in the overview or if you click on your ID in the upper right corner of the header, though no more \"Delete\", as one can still \"Edit\" and completely empty their content, but without affecting others responses.",
				"added": 1522358130
			}
		],
		"1522338314_1CDsYvuQP8StQGAMEgWVZuztHTsXPhCZZn": [
			{
				"comment_id": 24,
				"body": "> [ssdifnskdjfnsdjk](#comment_200_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Zeronet has Tor \"Available\" and \"Enable Tor for every connection\" modes. Maybe second one will ensure even clearnet zite elements are loaded via Tor even i am not using Tor browser? I am wrong?\n\nI think that is wrong, second option \"Tor always\" only makes sure all ZN traffic is routed through TOR.\nIf ZN zites contain or embed clearnet links or media, i think it will not route these through TOR if you use a normal browser and not a TOR Browser.\n\nOne way would be for a non-TOR bowser to not allow any other traffic than :43110 to be loaded/accessed by using proxy settings, so anything outside of ZN simply doesnt render at all.\n\nAnyone please confirm or correct this assessment.",
				"added": 1522359173
			}
		],
		"1522317542_1FenK9SJK21haGBvxM7vZNCLp1Z9hsCWUc": [
			{
				"comment_id": 25,
				"body": "How does GFW work? Can't China simply block all (new) trackers within an hour or so?",
				"added": 1522497327
			},
			{
				"comment_id": 26,
				"body": "Is there any method that would make ZN unblockable as long as there still is a basic form of internet in China (compared to north korean intranet only?).",
				"added": 1522579618
			},
			{
				"comment_id": 27,
				"body": "> [kai0](#comment_558_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): easy, 1,000,000  people use it.\n\ni mean if all trackers gets blocked 100% by GFW... wouldnt then all 1,000,000 chinese users cut from any more ZN updates? Or is there another method that ZN can use to make ZN unblockable?",
				"added": 1522589154
			}
		],
		"1522586677_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 28,
				"body": "> [nullbock](#comment_6_18ewrh7YMwuSTBcYAqvsEgSAQp9DsBNhW6): If there are more suites like cjdns around with simple and built in routing, then skyscrapers can be used to make stealth networks around known checkpoints where states and corporations are doing deep packet inspection.\n\nYou mean actual skyscraper = buildings or what is this supposed to mean?",
				"added": 1522589321
			}
		],
		"1523439578_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 29,
				"body": "> [kai0](#comment_584_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): you don't have 43110\n\nfixed :)",
				"added": 1523444830
			},
			{
				"comment_id": 30,
				"body": "> [thunder33345](#comment_6_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you seed by simply connecting to it then dot delete it off your list [...]\n\nthanks, didnt know that until now!",
				"added": 1523444848
			}
		],
		"1525185835_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 31,
				"body": "> [lola](#comment_24_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Hong Kong it would be really cool ! I might even try to attempt this meetup.\n\nHongKong or Budapest, both are awesome :)",
				"added": 1525288986
			}
		],
		"1525240239_1KUCCZmSbKgXoryTFLGzNfyQdYBvNhkkv2": [
			{
				"comment_id": 32,
				"body": "Wut?",
				"added": 1525289153
			}
		],
		"1525777374_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 33,
				"body": "This feature allows for easy offline storing backups in case something goes wrong with a zite.\nSo the backup is conserved and never updated / corrupted, as opposed when you possibly wake up one morning and see something happened to one of your loved zites overnight :)\n\nOne suggestion to improve this would be to put this option also in the dropdown menu for each zite in the frontpage bookmarks sidebar, so you have \"Delete\" and \"Backup\".",
				"added": 1525777715
			},
			{
				"comment_id": 34,
				"body": "you have version 0.6.2 rev3467?",
				"added": 1525789248
			},
			{
				"comment_id": 35,
				"body": "just use the update function, it will get you a more recent rev version.",
				"added": 1525859061
			},
			{
				"comment_id": 36,
				"body": "> [thunder33345](#comment_33_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you meant the one on the zerohello?yep it dosent... it still say rev 3465 as up to date\n\ntry updating anyway, it always says latest version, when there is already a newer rev.",
				"added": 1525862576
			}
		],
		"1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46": [
			{
				"comment_id": 37,
				"body": "Does the \"Download as zip\" option also include all optional files downloaded at this point?\n\nWhat about merger sites, like hubs belonging to a master site?\n\nAs for proving alterations compared to when something is checked in first time, how about storing hashsums of every item in a (Zeronet) Blockchain?",
				"added": 1527198212
			}
		],
		"1527243612_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 38,
				"body": "@jetten: because it wouldnt load anything for me as well besides the loading idle icon...\ni now am able to also see it though first time, as it is not a zite i started hosting myself :)\n\n(i knew though it was supposed to be something using cdn merger hubs to archive clearnet zites, will add the info now its confirmed)",
				"added": 1527285886
			}
		],
		"1530191313_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 39,
				"body": "Zeronet Blocklists could be implemented like Adblock Filterlists:\n\n\nAnyone can freely decide to subscribe to any list or combination of lists that fit his/her viewing habit.\nOf course you always do trust those who put together these lists, like with adblocklists on the clearnet.\nBut since like with adblock filters nothing gets really deleted (just blocked like ads), and those lists would be transparent, people would quickly find out if any list either doesnt effectively block said content or starts blocking more than the wanted type of content.\n\nThink of lists like \"no spam\", \"no cp\" and \"no NSFW\", but also more exotic stuff like \"nothing trump\" blocklist or \"no taylor swift\" if someone simply doesnt like to be bothered by that kind of stuff. :)\n\nLike adblocker lists, these lists should be globally manageable and be able to target individual content like bigfiles, images, videos, or any kind of textinput by certain users.\nThis would ensure that even if zites whose owners dont bother, have become inactive or simply cannot cope timewise with submissions on their zites can be safe-guarded, very much like adblockers can prevent any type of content from getting loaded and showing up on a local machine.\n\nThis should also prevent stuff from getting accidently loaded in the background, even if no person has consiouscly viewed or rendered that content yet.\n\nSuch a way of moderating content could turn out be very effective and even be an essential pre-requisite for other \"normies\" to start surfing decentralized networks, as everything on such networks is basically every first click can be a click into the unkown.\n\nThe big question is:\nHow can a group of people start working together on such a list by looking out and identifying and reporting content of a certain type, without at the same time allowing abuse by other people who might report false positives to undermine such an effort?\n\nOne way could be the owner/moderator of any list gets all content that is flagged towards that list presented in a neat way somewhere to review and then decide if valid that content is added to that list or rejected and then simply ignored.\n\nThat way such lists could evolve, much like Adblock lists evolved over time.\n\nThe \"good thing\" is, it is much like what some governments do with State wide lists, only that in this case, the people themselves govern such lists in a non-enforcing and transparent way.",
				"added": 1530255794
			}
		]
	},
	"comment_vote": {
		"32_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"605_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}