{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1523851480,
			"title": "Search function for blogs and files",
			"body": "Is it planned for future releases?",
			"added": 1523851479
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1523475161_1QKa66eEpXh6bTGPA1HAFGmNBnC53oCxZZ": [
			{
				"comment_id": 1,
				"body": "I wouldn't trust RT entirely, the only way to get an informed opinion is to listen to all outlets and official communications. I'm from Colombia and RT's coverage of the Venezuelan situation hasn't been honest. Despite some American and British journalist they are still run by Russians and they are going to favor Russian allies.",
				"added": 1523495805
			}
		],
		"1524280296_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 2,
				"body": "Actual paper family albums phone calls SMS and goo ol email.",
				"added": 1524287793
			}
		],
		"1525597646_1CT7RxDQNPEE8X78bDkUPhuaaUUixTmDhC": [
			{
				"comment_id": 3,
				"body": "I'm not a ZeroNet developer but not on iOS al least without Apple blessing",
				"added": 1525665947
			}
		],
		"1525696516_12TZwQoQXbFfSHgL8DqRg6izd8uHd7wN5w": [
			{
				"comment_id": 4,
				"body": "Works from here (not specified country outside USA)",
				"added": 1525713847
			}
		],
		"1527832154_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "I don't know about psychotic depression but I was under depression medication a few years ago and I hated the side effects (brain shivering, sexual disfunction), so I wanted to leave my medication ASAP, and my doctor was lowering my medication and my mood was down again, but one day one of my crazy aunts told me to take b-complex vitamins, my neurosurgeon uncle laugh and told the usual \"your body takes all the vitamins from food you don't need extra vitamins\", when I was about to leave my aunt gave me a bottle (sundown brand) and begged me to take even if I don't believe it, A few hours after taking it my improved a lot and I have been without medication for two years, I still take one or two pills a day.",
				"added": 1527909752
			},
			{
				"comment_id": 6,
				"body": "> [wanditoast](#comment_10_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): Stop all what you do here.its not a good plan\n\n> [styromaniac](#comment_58_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's not placebo. Diets might lack enough of the nutrients required. [...]\n\nYeah It's not always placebo, I have experience with that. My dad used to be in all that new age stuff, and I used to suffer a lot from allergies and I took everything he gave me from acupuncture to quartz and stones, none of that worked on me and I stop believing in that, the only thing that worked was a regular medical procedure with some vaccines.  Yes an unbalanced diet can create all kinds of deficiencies and in my case it looks like coffee actually depletes my body from vitamin-b.",
				"added": 1528137753
			}
		]
	},
	"comment_vote": {
		"395_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"214_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"70_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"21_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"58_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}