{
	"title": "Zero News",
	"description": "The first news sites in ZeroNet.",
	"links": "*   [Social profile](http://127.0.0.1:43110/peeper.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/136wmwLTBJoGTjXTAa7sWmXewn9P53EKML/znews@zeroid.bit)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1500222428,
	"post": [
		{
			"post_id": 5,
			"title": "Kaffiene and a lot of sites suffering about cross-site blocking from ZeroNet",
			"date_published": 1500221259.673,
			"body": "Recently, ZeroNet had implemented a security improvement: cross-site blocking. Basically, sites now can't do file requests to other sites.\nIsn't this that Kaffiene and other search engines does? Yes.\nThey can have problems with the new ZeroNet update? Sure.\n\n@Kaffie said [here](http://127.0.0.1:43110/peeper.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/1500184076):\n`Already not a fan of the new ZeroNet updates. Completely kills some Kaffiene features.`\n\n@Kaffie commented:\n\n`**@Musickiller**: There's more strict cross-origin blocking, which kills a method I use to fetch files from the same+other sites. So here's a list of things I worked on that have broke because of this new update:`\n\n*   `ZeroWiki support on Kaffiene`\n*   `Other site indexes on Kaffiene`\n*   `Every index besides basic searching on Kaffiene (though local indexes will come back soon)`\n*   `ZeroMovie's frame escape`\n*   `[http://zero/](http://zero/) protocol testing on Kaffie.bit`\n\n`Luckily, due to an issue submitted [here](https://github.com/April93/Kaffiene/issues/20) I went ahead and fixed it for the main Kaffiene search. So at least it's not _complete_ disaster. But I've got a lot of work put on my plate now. And some features (ZeroWiki info boxes, for instance) might not come back.`\n\n@jro commented:\n`Yah. Having \"big\" problems here with new rules for optional files patterns ([https://github.com/HelloZeroNet/ZeroNet/issues/989](https://github.com/HelloZeroNet/ZeroNet/issues/989)). 2 sites down here :-( Do not like updates that \"destroys\" old zites :-( Can be fixed but extra work`\n\n@Peeper (@Plasmmer) commented:\n\n`**@jro**: \"Do not like updates that \"destroys\" old zites\". Security improvements are welcome, also the updates that are for the future, so the old sites needs to be updated. But about the archiving/nostalgy, ZeroNet needs a GIT/blockchain system like IPFS have. About the cross-origin blocking, its a problem, since ZeroNet needs to be the Internet we know + better (security/privacy).`\n\n```\nWhy not simple use a API/wrapper/sandbox for the cross-site requests instead of blocking it? Following this logic, Windows would block apps instead of creating antivirus. Its sadly funny. Also I heard that Nofish plans to block javascript in future. I don't know how this will be done.\n@Kaffie: I'm very sad about this, since the ZeroWiki cards was my suggestion as @Plasmmer: and I plan to read infos about hubs from Peeper.\n```\n\nAs seen, ZeroNet's developers are facing problems with his sites that uses advanced features, in that exact case, the file access of other sites.\n\n<span style=\"font-family: Tinos; font-size: 21.5px; background-color: white; color: rgb(51, 51, 50);\">The developers are trying to circunvent this issue. In another post, @Kaffie said [here](http://127.0.0.1:43110/peeper.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/1500204302):</span>\n\n`'Fixed' Kaffiene after the disastrous result of cross-site requests being blocked. Had to remove ZeroName, CensoredSearch, and ZeroWiki stuff. Hopefully there'll be a way to access other sites' content in the future. Of course, changing your browser to ignore CORS will bring back the ZeroWiki cards. You can do that in chrome by launching with --args --disable-web-security --user-data-dir`\n\nWhat do you think? Is ZeroNet right or there can be another way to improve security without making ZeroNet worst than surface-web/clearnet? Don't forgot to comment.\n\nSource: [Peeper](http://127.0.0.1:43110/peeper.bit/)."
		},
		{
			"post_id": 4,
			"title": "Kaffiene is now open-source",
			"date_published": 1492988530.229,
			"body": "The leading search engine Kaffiene - developed by Kaffie - received suggestions to be open-source from Plasmmer.\n\n\"I try to contact you by email, but isn't working. I have some nice ideas for Kaffiene. Do you have a GitHub page for it?\" - said Plasmmer.\n\n\"No github just yet. And yes, I understand a reworked database would be nice. As I mentioned, my dev work has kinda grinded to a halt and I'm not sure when I'll be able to resume. I have some personal issues and I'm not sure how long it'll take me to work through them. Sorry >_<\" - replied Kaffie.\n\n\"If you open it in GitHub the work can be less slow with help of community.\" -replied Plasmmer.\n\nThis conversation was in April first, and can be found [here](http://me.plasmmer.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/15XeFY67fYKCKxQPfeo246ELto2Gff1hAe/1491016627).\n\nIn April 07, Plasmmer [posted](http://me.plasmmer.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/15XeFY67fYKCKxQPfeo246ELto2Gff1hAe/1491614121):\n\n\"**@Kaffie**:\nWhy do you can't reply emails on ZeroMail?\" - said Plasmmer.\n\n\"Lazy, mostly. I hardly ever check it, and when I do I just put off responding. Sorry. I'm kinda shitty like that.\" - replied Kaffie.\n\n\"Why do not create a GitHub repo for Kaffiene? The development will grow, and we can suggest indexing with issues/pull requests.\" - replied Plasmmer.\n\n\"I believe I answered that one already ;). Like the previous answer, mostly it's just because I haven't gotten around to it. I really don't have an answer besides that. That's literally the entire reason you haven't seen much of my development lately. I'd rather not go into the personal details of my life, but I've got some issues I need to work through before I can resume ZN development.\nAny sort of dev question almost certainly has the same answer; to save you some time. I haven't done much dev work in general, off and on ZN. And likely before that I need to get my actual income and living situations fixed.\nGithub is honestly on the to-do, but not for a while. The original plan was to get Kaffiene more or less automated and then move the code to github. But neither has happened yet.\" - replied Kaffie.\n\nThen, Plasmmer forked the Kaffiene search engine, modified the branding/design, added little functions, indexed more sites and turned it open-source. From this, was born the Snifferdog search engine. [See the announcement](http://me.plasmmer.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/15XeFY67fYKCKxQPfeo246ELto2Gff1hAe/1491819961).\n\nAfter this idea, mkg20001 (creator of ZeroMe Beta) begins his work in the [Zule](https://github.com/ZeroNerds/Zule) search engine, also open-source.\n\nThen - in April 23 - Kaffie posted:\n\"Kaffiene is finally on Github. Bear with me while I deal with this. I've got no idea what I'm doing haha.\n[https://github.com/April93/Kaffiene](https://github.com/April93/Kaffiene)\n\nAnd yes, my name is April.\" - said Kaffie.\n\nNow we have 2 open-source Kaffiene versions:\n![](img/posts/4/kaffienes-opensource.png)\nBut Plasmmer seems to have interest in contribute with Kaffiene, and also to merge Snifferdog for focus in one only project.\n\n\"**@Kaffie**: I think Snifferdog did a enough sound. Good to see now Kaffiene is open-source.\n**@mkg20001**: How will be Zule after this announcement? I'm fine with moving Snifferdog's ideas to Kaffiene.\" - said Plasmmer in the Kaffie's post.\n\nWill Kaffie accept the help of Plasmmer and mkg20001? Will mkg20001 merge Zule into Kaffiene?\n\n\"The original plan was to get Kaffiene more or less automated and then move the code to github.\" - quote for Kaffie.\n\nIs Kaffiene already \"more or less automated\" or it is now open-source because Zule and Snifferdog?\nVisit the comments section.\n\nSource: [Peeper](http://127.0.0.1:43110/peeper.bit/).\nLinks: [https://github.com/April93/Kaffiene](https://github.com/April93/Kaffiene), [https://github.com/Plasmmer/Snifferdog](https://github.com/Plasmmer/Snifferdog), [https://github.com/ZeroNerds/Zule](https://github.com/ZeroNerds/Zule)."
		}
	]
}