{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 28,
	"comment": {
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": [
			{
				"comment_id": 1,
				"body": "The moment You want to make the Albert Einsteins live in the same room with dumb idiots, You are either repressing the dumb ones by imposing smarter solutions on them or dumbing down the Einsteins. Please do not try to do that. In stead of uniting the world the solution might be allowing the Einsteins and the dumb ones live SEPARATELY by their different rules and facilitating the business between the 2 groups. The initial idea behind the European Union had that kind of a smart core: just let people do business and have them living at their own regions with different rules.\n\nYou are creating one hell of a mess, if You want to impose the same rules to both, the mad, gay-hating Crhistians from Texas and atheist engineers from the Northern U.S. states.",
				"added": 1594419419
			}
		],
		"1593886909_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 2,
				"body": "> [789hello](#comment_1_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL): It's freeware.\n\nSo You believe in free lunches? Have You ever thought, how does mass surveillance malware get to people's computers? Would people run an installer that says \"supermafia mass surveillance malware installer\" or \"installer of backdoored lure-ware that executes DoS-bots on demand and then deletes the bots and masks the whole DoS-attack participation as an innocent P2P-sharing activity.\"",
				"added": 1594421083
			}
		],
		"1593971855_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 3,
				"body": "> [consensus](#comment_11_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU): I am generally more curious of why it is being so shilled and what the hype is about.\n\nIn 2020 the reason for using FreeBSD at hosting companies might be just adherence to legacy systems and reuse of various administration scripts that have been created over some long time period. In the past the reason was that the FreeBSD operating system processes did not freeze while one of them was waiting for data to arrive from disk. Even the year 2020 Linux distributions still have that problem with the default process scheduler. Easy to test: start copying some huge ISO images from one non-SSD disk to another and the Linux system freezes till the copying operation is complete. Supposedly the modern Linux has an alternative process scheduler available that does not freeze the system in that occasion, but supposedly (I have not tested it) it is in average less efficient than the one that does freeze.\n\nInterestingly, many Linux distribution creators are not aware of various Linux related nuances. For example, the default Debian based Linux distribution for the Raspberry Pi comes with a default root partition (\"/\") file system that gets corrupted if the Pi is reset by pulling off the power cord sufficiently many times. The people building advertisement screens from TV-s and Raspberry Pi-s try to overcome that issue through various quirks, but given that in that particular situation, including the children's robotic applications, the Raspberry Pi is essentially used as a single user system anyway, the NilFS2 file system as a root partition file system would solve that issue without causing trouble with its security flaw, which is that at some specific conditions the NilFS2 file system allows one user to access the files of another user even, if the user is not supposed to have access to those files. The openSUSE Linux distribution creators threw the NilFS2 out of the list of built-in-kernel-modules, meaning, the NilFS2 file system can be used after the system has booted by loading the NilFS2 kernel module, but the system can not boot from NilFS2 file system, because in order to boot from the NilFS2 root partition the NilFS2 file system has to be built into the kernel binary. \n\nAll in all, in 2020 Linux can be used in may scenarios, where it did not suit in the past, but there are nuances, a need for customizations, and not everyone are aware of all of the nuances. Experienced network administrators have administration scripts that are BSD-specific, which is another reason, why they want to stick to the BSD. As of 2020 the Linux is the operating system for all-things-embedded, all new fancy embedded hardware (the Rasbperry Pi like computers, phones, etc.) and BSD-s, specially the OpenBSD, seems to be maintained by fancy high end server vendors as their default operating system offering.\n\nGiven the high computing power and very favorable power consumption characteristics of the Raspberry Pi, a Raspberry Pi cluster might be a viable replacement for a high end blade server, except that the Raspberry Pi has a horrible bottle neck at its \"south bridge\" IO. May be if the Pine computers are used in stead of the Raspberry Pi computers, then a huge Pine cluster might be a viable replacement for a high end blade server.\nhttps://www.youtube.com/watch?v=CeoNHGFN_30",
				"added": 1594423395
			}
		],
		"1594047986_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "> [anshorei](#comment_132_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): GitHub is owned by Microsoft and is verging towards a monopoly on open source code hosting. Free Source Code should be hosted on decentralized networks, not on a platform that Microsoft controls.\n\nIndeed, but regardless of, where the code is hosted, people should either thoroughly audit all code before use or there should be a way to use signatures of non-anonymous software developers. Keep in mind that malware creators, including the No-Such-Agency (NSA), also want to lure people to use their backdoored or malware-infested software.\n\nWhat regards to bug reports being hosted by Microsoft, then as long as the bug reports and forum threads are not part of project documentation like support mailing lists tend to be, it's OK for them to go offline even if it is the Microsoft that takes them offline, provided that there is no selective censorship. Probably the reason, why Microsoft paid literally billions of $ for the GitHub and quite a lot for the LinkedIn is that those two hosting services deliver Microsoft data about the majority of planet Earth IT-workforce and it also gives the Microsoft an objective, measurable, overview of technology trends, allowing the Microsoft to start working early on projects that will be in high demand in the future. It means that the Microsoft will have the exact right offerings at the right moment while its competitors start to build their products after Microsoft has already ceased the market niche and made its technology the de facto standard. Microsoft's main clients are huge American corporations. The gamers, home users, small businesses are irrelevant for Microsoft. Microsoft is interested in the education sector, because the pupils and students of today are the ones, who will choose, what Microsoft's main clients, huge corporations, of the future use in the future, after the students graduate. In a way by buying up GitHub and LinkedIn the Microsoft truly shoves it to all of its U.S. competitors, who see U.S. huge corporations as their main clients. The only reason, why Microsoft became \"open source friendly\" was that business applications of the main clients of the Microsoft, the huge U.S. corporations, started to use web technology, the \"cloud\", which tends to be built with open source tools and Microsoft could not offer anything to its main client segment. The main reason, why Microsoft created the Linux layer to Windows10, the Windows Subsystem for Linux, is that the Ruby developers did not bother to port newest versions of the mainstream Ruby to Windows, which in turn hindered Ruby-on-Rails-business-application-development on Windows, which in turn meant that business software developers moved to Linux and if the developers are using Linux, even the web applications do not get properly tested on Windows, which means that the end users will migrate to Linux just to make sure that the business software works, which in turn leaves the Microsoft without the Windows license revenue from the huge U.S. corporations. \n\nIt's like the Microsoft is the cat food producer, the owner of the cat pays for the cat food, id est the cat is not the client of the cat food producer, but if the cat does not like to eat the cat food, then the owner of the cat does not have a reason to buy the cat food, so in the end the cat food producer still needs to please the cat, even, if the cat does not pay a dime. The business software developers are the cats and the huge U.S. corporations that hire the software developers are the cat owners, who pay the bills. By buying up GitHub, the Microsoft as a cat food producer gets to understand, what the cats like to eat while its competing \"cat food producers\" lack that business knowledge in such a measurable form. \n\nObviously it is not wise to assume that Microsoft leadership is always rational, because if they were always rational, then Microsoft would have done many things very differently in the past. The executives live in their money-bubble and the Nokia executives lived in their money-bubble till the Nokia lost the market to its competitors. The pattern repeats over and over again: take over the market with really good products; once the market domination has been achieved, get dumb and comfortable and focus on \"corporate culture\" in stead of developing competitive new products; may be destroy some small, hardworking, companies by sending lawyers at them; get destroyed by some new global player from another part of the world, where the kill-squad-lawyers could not reach in time due to different \"juristiction\".",
				"added": 1594425665
			}
		],
		"1593039165_14LPVXnk22dMWhxm27AvKFuD2u679rNkCq": [
			{
				"comment_id": 5,
				"body": "Isn't it stupid to call something \"uncensorable\" if it is placed to the perfectly censorable web? The wiki software could be run as a Tor \"hidden\" service, but You put it on a public domain. \n\nI do not know how to tell this so that people would actually understand it, but the main problem with many P2P-freedom-fighting and \"anarchist\" groups and software projects and documentation projects is that THEIR MAIN AUTHORS ARE IGNORING BASIC OPERATIONAL SECURITY AND BASIC PRINCIPLES OF MAKING A SOUND PRODUCT. The main authors seem to have just a bunch of emotions and clearly no sound thinking and no sound planning. Often times the P2P-software is written by total amateurs or even worse, ARTISTS, not software developers. A prime example of horrible software, crap-ware, is the various P2P-social-networking applications that are listed at \nhttps://fediverse.party/\nMay be only corporate business-software, delivered for deadlines, not quality, might be worse and I am not talking about functionality, but the way the functionality has been implemented, including software architecture. An example test question: what happens to the software, after a dependency of a dependency of a dependency is not met any more for whatever reason and what happens to the data of that application in that situation? Another test question: can You build the software on future versions of some future operating system, if some of the build tools are not available from the standard package collection of the distribution and the build tools themselves require other build tools that might not be available?\n\nA bootstrapping hint: virtual appliances with year 2020 operating systems can be run on future computers, where the year 2020 operating systems can not be installed, but the standard package collection servers of year 2020 operating systems will not be online in the future, meaning, all needed packages have to be installed to the virtual appliance  in 2020.",
				"added": 1594429725
			}
		],
		"1594250812_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 6,
				"body": "The Economics of Censorship Resistance\nhttps://www.cl.cam.ac.uk/~rja14/Papers/redblue.pdf",
				"added": 1594430829
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_2435_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm in a genius minority, being autistic.\n\nMost people think that they are above average, which plain mathematically can not possibly be true. On the other hand, people do specialize and even Albert Einstein would make very stupid decisions if he were SUPERFICIAL. That is to say, the way I can avoid being a retarded idiot is to avoid being superficial and avoid voting on matters that I have not taken my time to study. With the exception of male neo-nazis and violent bikers the problem of being superficial is specially present with young women, who are mothers of a baby or a toddler. The superficiality related apparent decrease of IQ with such mothers is so bad that a person with a masters degree can look like some absolute dumb chick that has never been to a university. Obviously the drunk male bikers and beer-intoxicated male neo-Nazis are not that much better, except that they are more violent. \n\nOn the bright side, as the Einsteins are dumb on anything that they do not sufficiently study, the people with lower IQ can outperform the Einsteins in mental tasks that the person with lower IQ has been working on for a very long time and the Einstein has hardly ever even studied. You may think of it like a race between a turtle and a racing car. The turtle does not have a chance of beating the racing car if they start at the very same moment, but if the race track is 100km long, the racing car has been staying idle at the start of the track while the turtle has slowly crawled to a position, where the turtle is literally 1m from the finishing line, then the racing car can not possibly get to the finishing line before the turtle even if it drives at 400km/h. That is to say, the Einsteins can complete mental tasks faster than dumb people, but if the Einsteins do not work on the problem at all and the dumber ones do work on the mental task for quite some time, then date and wall clock wise the dumb person can come up with the proper solution sooner (SOONER, not quicker) than the Einsteins do. Once the Einstein notices the value of solving certain types of problems, the Einstein will outperform the dumb person in any possible way, but the Einsteins have so many different things to do in this world that the Einstein just does not have the time to work on everything.\n\nAnother line of thought is that an average human is intellectually and physically far more powerful than an insect in a forest, but the human will not always kill the insects not because it could not do that, but because the smart human has other, more important things, to do. The insect should just try to avoid a situation, where killing the insects becomes the priority of the human. A house battle between a human and cockroaches is usually won by a shingle human even if the cockroaches are a majority. The context is that truly smart aliens might see the modern humans as dumb insects that could be killed, but are left alive to save some time for the smart aliens. The same line of thought can be used, when comparing modern western armies with those of some jungle tribes: the war-painted violent tribesmen might be seen as \"cute insects in the nature\", just just don't get too close or it will give a nasty bite or other nasty injury, but apart from that, they're \"harmless creatures\". \n\nOr, there can be the comparison between those, who have nuclear bombs and those, who do not have them. The U.S. might have just nuked the Afghanistan tribes away without any problems, if the Pentagon wanted to do it. It certainly would have killed most of the potential terrorists. Not all, but a lot of them. May be there might have been a slight threat that the Europeans would have seen that as a potential threat to them and would have started to build nuclear weapons for themselves to make sure that this kind of a strategy is not a viable strategy against Europeans, so from that point of view the U.S. had limits, what it could do. After all, the Nazi Germany alone almost wiped off the whole U.S. and Britain alliance and Germany and Britain and France combined would be able to beat the U.S. militarily, at least after some war preparations. From that point of view the Trump made a mistake by backing off from the idea that the purpose of the NATO is to keep the Russians out and the Germans down. Paying for U.S. NATO troops in Europe might be a comparatively cheap price to pay if compared to a whole war against European continent, should the Europeans build up their own defenses against the Russia and then some neo-Nazis come to power again, as tends to be the tendency, just that this time it's not the Jews, who are seen as the villains, but the various Arabs, who have lent themselves as a perfect villain by conducting the various Islamic terrorist attacks.",
				"added": 1594434681
			},
			{
				"comment_id": 8,
				"body": "> [frankwalter](#comment_56_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): consensus: Your brain can easily mold itself while the CPU only follows the instructions exactly as it is being told.\n> Yeah a brain is something hybrid between a single core cpu and a unparallelized ASIC. We should do something like that on the next CPUs.\n\nYou could write yet another \"Java Virtual Machine\", byte-code interpreter, which can run a program that modifies a copy of the VM and then switches the execution flow from the old VM to the modified VM. What really matters is the number of logic operations per second, not so much how they are organized, provided that efficiency is not that important. Besides, with the exception of digital signal processing (DSP) algorithms like video and sound processing, the issue in 2020 is not that the existing CPU-s are slow, but rather that the software developers are sloppy and hardly anybody takes the time to implement some nice interpreters that are efficient and use the kind of data types that real life applications need. For example, Java, C++, Pascal, C# do not have built-in absolute precision integers and rational numbers, but luckily Ruby has them. Text processing in Java, C++, Pascal, C# is a nightmare from code succinctness point of view, if compared with Ruby. As of 2020 the best project for anything compiled seems to be the LLVM, the second best seems to be the GCC. The issue with universal virtual machines like the Java VM (JVM) and the C# \"common language infrastructure\" (CLI) is that they are corporate projects that are maintainable only with a huge amount of dumb manual labor. The moment the money flow is cut, those projects, despite being open source, will be dumped, unless the IcedTea can handle the JVM and someone, I do not know, who, picks up the C#-tailored \"general\" CLI.",
				"added": 1594435817
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_2479_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I do not have the patience to read a lengthy comment that somehow ends on Jews and terrorist attacks.\n\nThat is, how a retarded brain works: attention drifts before data gets analyzed. That's what the propaganda and advertisement industry feeds on.",
				"added": 1595005193
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 9,
				"body": "> [rededram](#comment_2_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t): I'm not sure, but I think Linux has way more than 2% of the market.\n\nThink of the Android as Linux. Think of the various embedded systems that display advertisements on TV-screens as Linux. Think of ATM-s and other \"teller machines\" as Linux.\n\n> [sesuok](#comment_1_1AhHE48SmiNsotcsD3mMrbZUTxePKDxmJm): With zeronet, one can get real substance in regards to questions asked unlike the others on which there are lots of jesters. Hope it maintains that.\n\nThe ZeroNet is not the same as the ZeroTalk main forum instance. ZeroNet is a technology, like HTTP, WWW, HTML, and it can be used for many things, including dumb sheep socializing, although if You want dumb sheep socializing in P2P-style, then there are P2P-social-network-applications that connect with each other by using some special common P2P-social-application-protocols.\nhttps://fediverse.party/\nA \"social network\" is a bubble for dumb people, who get high from the false impression that other people are admiring them. Hence the photos and videos and \"sharing\" and \"tweeting\" and no serious substance.\n\nThe censored net is like a public street that has become popular: there are gangs (\"Governments\") that try to impose their rules on others, there are pick-pockets, but there are also nice ice-cream sellers, taxis, nice cafeteria and above all, a public street is a passage for one's own car from one nice parking space to another nice parking space. The current ZeroNet is an overlay-network, \"a car that drives on the gang-ridden public street from one nice parking space to another nice parking space\",  an application that uses the centralized and censorable TCP/IP. \n\nA proper free network can only be a network that is PHYSICALLY DECENTRALIZED and CLANDESTINE. There is some more information on that at\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1576021462_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP/Can+ZeroNet+help+to+access+internet+during+blackout+internet\n",
				"added": 1594436091
			}
		],
		"1593724956_18FmpbxghV4UBgrjHpwgU1igoAt2gRzApL": [
			{
				"comment_id": 10,
				"body": "One form of a \"password manager\" is an ordinary book, preferably something that You refer often for publicly known reasons, so that when somebody asks, why are you using it so often, You can reply honestly about what You are working on, without mentioning that the book has a double purpose. The passwords can be written to that book by using Your own specific encoding that You know, how to read, so that even if all of Your markings in the book are discovered, they just do not know, how to read them.\n\nWhen You enter passwords, then make some sort of a \"tent\" above the keyboard, so that Your hands go under the tent and filming Your writing won't reveal the password. Obviously any kind of Windows use is out of the question. The more exotic Your system, the less likely it is that there exists \"standard law enforcement malware\" for it. For really secret things some very old computer with custom messaging software might be the thing to use. Desolder all built-in microphones from Your laptops, because those could be used for listening to Your key-strokes. Obviously do not keep web cameras with built-in microphones attached to Your computer. \n\nThe list goes on and on. Just, KNOW YOUR GEAR and FORGET ABOUT THE IDIOTIC IDEA THAT SOMEHOW SMARTPHONES MIGHT BE USED FOR SECURE COMMUNICATION. THEY CAN NOT!!! \n\nAlso, keep Your smartphone in a room different from the room, where You use Your computer. Your keystrokes could be listened to. You may want to leave Your smartphone at home, when visiting friends, because U.S. army is known to assassinate people by smartphone ID-s and if some of your friends happens to be dumb enough to have anything to do with murderous Islamists or otherwise people, whom the Pentagon does not like, then You might become an assassination target without having anything to do with terrorism.\n\nA few random links for newbies:\nhttps://www.bypasscensorship.org/\nhttps://vpnandgo.com/\nhttps://lbry.com/\nhttps://www.hathitrust.org/\nhttp://eng.anarchopedia.org/\nhttps://theanarchistlibrary.org/special/index\nhttp://infoanarchy.org/Trust\n\n\n\nA few random links for more advanced users:\nhttps://www.widernet.org/\nhttps://www.zx2c4.com/\nhttps://scuttlebutt.nz/\nhttps://prism-break.org/en/\nhttps://insecure.org/\nhttps://en.greatfire.org/\nhttps://openprivacy.ca/\nhttp://friend2friend.net/\n\n\n\n",
				"added": 1594440739
			}
		],
		"1594354789_1EAVeFYkSwZaUXFUhuKvsJ6kBHsZmZsG1T": [
			{
				"comment_id": 11,
				"body": "https://www.w3schools.com/\n\nI suggest You use the NetBeans IDE for writing HTML, CSS, JavaScript:\nhttps://netbeans.org/\n\nBut You also have the option to use just LibreOffice and save an ordinary document as HTML and upload it over FTP to Your censored web web server.",
				"added": 1594444156
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 13,
				"body": "The classical 2001 Space Odyssey that was once available at the archive.org, but was taken down due to \"copyright issues\", would be nice, including its sequel. Basically, old classic movies that have been taken down from places like archive.org by copyright-trolls. The movie was published to cinemas in 1968, so I guess it should have been able to earn its authors plenty of money by now and be freely available, if it just weren't for those pesky copyright trolls. \n\nBasically, anything that is at least 5 years old should be made freely downloadable from moral point of view. I do not see it to be a sin to distribute also new movies, but with newer material there might be the argument that the fools have not adopted the 21. century technology and hence one might give the movie industry a little bit of a slack as a form of compromise. Another truly awesome movie that is far superior than its title suggests, is the 1999 movie \"The Thirteenth Floor\"\nhttps://www.imdb.com/title/tt0139809/\n\nPeople do not actually go to cinemas to _see_the_movie_, because they might get it totally legally from Netflix or other similar channels, which can charge the same fee for their nice collection service even without any copyright restrictions on their content. Cinemas are like bars and restaurants, a social gathering place in their own right. Animals at the zoo are not covered by copyright, and yet the zoo can still charge for tickets and people go there despite having the possibility to watch the animals from YouTube or even from live webcams of the very same Zoo that they visit.",
				"added": 1595319119
			},
			{
				"comment_id": 14,
				"body": "> [bats](#comment_12_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): I've been getting into Tribler recently. Have you tried it? It might be better suited for piracy than ifs over tor.\n\nThe Tribler is an academic project that has the sole goal of having an excuse for requesting literally millions (over 3 million) of  € of grant money, NOT A PROJECT FOR DELIVERING PROPERLY WORKING SOFTWARE. Their excuse is that they run their research team with those millions. The ideas there are nice, but the implementation of the Tribler is so bad that I would dismiss their development team within one day. Those guys are not just cynical white-collar fraudsters, but TOTAL SLOPPY SLACKERS, who DO NOT TEST THEIR PUBLISHED BINARIES EVEN ONCE BEFORE PUBLISHING. Any decent development team would be truly embarrassed, if their project had such a sloppy implementation that the Tribler has, but hey, the fraudsters offer many fancy scientific papers, as if the PDF-files were doing the work at actual hardware, swapping files, encrypting and all. \n\nThe Tribler is a nice idea, but their developers are a total fraud.",
				"added": 1595320460
			}
		],
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 15,
				"body": "> For a while, I was seeing comments appearing on ZeroTalk every couple of minutes. Now, that has slowed to hours. Why is this happening?\n\nThe main ZeroTalk instance is not the same as ZeroNet. The classical WWW Internet is also not the same as one site on the classical WWW Internet. What regards to the content, then apart from the fact that during summer-time people seem to spend more time outside in stead of using computers, there's that paper:\n\n\"The Economics of Censorship Resistance\"\nhttps://www.cl.cam.ac.uk/~rja14/Papers/redblue.pdf\n\nOn top of that anything P2P is not suitable for those people, who want to get by with some slim laptop that has a very small capacity slim SSD hard-disk and that connects to the IPv4 network through some WiFi connection with relatively nasty connection start-up delays. That is to say, P2P-systems require a dedicated computer, which can be a laptop, that is connected to the IPv4 network through some wired/cabled connection. An average granny or a teenager is not going to set that up just like an average granny or a teenager or a chck-wife is not going to do  plumbing. That in turn means that they have to pay some money to some IT-guy to set that server up for them, but given the current economic situation not that many people are willing to spend money on anything that satisfies their INTELLECTUAL needs. Not that many people even have any intellectual needs for thinking about philosophy and technology and aloke or the classical TV-channels like the Fox News and CNN would be far worse off. Not that many people even care to get university level education even if they have the monetary means to do it. \n\nLet's just admit that intellectual endeavours like discussing about politics for the sake of analyzing and planning one's actions is something only for the small intellectual minority. The rest may even join political parties not for politics, but for social interaction, the low-level joy of staying in an echo-chamber with \"like-minded\" individuals without ever analyzing and actually discussing anything. \n\nWhat regards to content for the \"nerds\", then the ZeroNet is just fine: there are plenty of alternative literature zites and alike, if they just stayed online more, but that's where the \"nerds\" have to self step up the game and actually set up their servers that are dedicated to hosting zites and the content of other P2P-networks. So, yes, there are problems at scaling, but we just self have to be more rigorous at keeping content online. Think of scientific papers: how many people actually read even the famous ones like the Einstein's theory of relativity? I mean, percentage wise from all populations on the planet Earth? Those kind of works just have to be hosted by the \"nerds\" themselves and if the classical centralized networks are not good enough for that then the alternative P2P-overlay networks and even physical new networks, even if they function just locally and still depend on the IPv4 for connecting towns, are the means for hosting that content.\n\nThe initial reliance on the IPv4 is actually not that bad, if the copies are stored locally like they are with the ZeroNet. The IPv4 itself also started as a kind of overlay network on the existing phone network. Older people may remember a device called MODEM(MOdulator and DEModulator).\nhttp://www.nethistory.info/History%20of%20the%20Internet/netsnmods.html\n\n",
				"added": 1595405688
			}
		],
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 16,
				"body": "> [qarmy](#comment_11_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): You're late to the party, but thanks! :) [...]\n\nThe ones, who come late to the party,  are more sober than the ones, who have had more time to drink at the party. Think of the 2000 dot com bubble  versus modern giants, for better and for worse, Google, Facebook, Amazon, eBay, PayPal, AliBaba, ...",
				"added": 1602237130
			},
			{
				"comment_id": 17,
				"body": "> [reichama](#comment_35_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): Is this an alternative to cloud storage? Why not just save it on your own system with offsite backups in your friends or relatives houses?\n\nProbably the main target market for StorJ and BitDust and non-P2P-online-storage services are people, who are just plain awful at keeping their papers and files organized. \n\nBelieve it or not, some people lack the psychological capability to be systematic, but they might be capable of pushing one button once, a button that has the word \"backup\" written on it. The backup copy creation software would then do some dull copying and after those hopelessly unsystematic people literally loose their laptop or phone, because they are so unsystematic that they just loose their every-day objects, they can push a button labeled \"restore\" on their new device and keep on living their hopefully happy, unsystematic, messy life as if they had not lost their hardware. That's the target audience for those \"online storage\" services, P2P or not. Often times such people are Americans or artists or people, who drink a lot or do drugs. Women with babies also tend to qualify, because for some reason giving birth substantially lowers many women's IQ till their child becomes old enough to walk. It might have something to do with the thoughts of a mother being frequently interrupted by the baby and that frequent interruption lowers the quality of those thoughts and therefore the overall IQ of the mother. You sure do not want such a person to be Your secretary, book keeper, nurse, doctor, id est it makes perfect sense for such mothers to stay at home during that period of their life.\n\nAnother reason for using password+crypto-key \"cloud storage\" is to avoid physically carrying data carriers trough customs, where border guards can copy it for themselves. The password can be studied by heart and the small SD-card with the crypto-key can be easily hidden within other belongings. There can be even multiple crypto-keys, divided within different SD-cards, which can be distributed among multiple passengers in a RAID like manner. If one SD-card gets robbed, \"confiscated\", or just plain copied by the border guards, then there is still possible to access the \"cloud storage\" without worrying that the border-guards access it. The SD-cards might also be divided between multiple trips. That's even safer for the data owner. There might also be a less secure option of making the full crypto-key temporarily downloadable by sending a message home. The message might include a one-time password. \n\nYet another application for online storage is \"smokeless Mission Impossible briefing\". In stead of smoke and fire there is    deletion of encrypted files. Too boring for Hollywood.",
				"added": 1602237672
			}
		],
		"1601063471_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 18,
				"body": "If You are looking for forum and email style applications, then anything that depends on real-time communication is more vulnerable to network outages than applications that can downlaod/upload during the time window, when network is available, and operate from local copies during the time, when network is not available. ZeroNet over tor qualifies.",
				"added": 1602405859
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 19,
				"body": "> [xart1902](#comment_6_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY): Why does everything have to be fear based?\n\nMay be because it sells?",
				"added": 1602424802
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 20,
				"body": "On the ZeroNet You may want to visit the zite\nhttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/\n\nOn the censored net You may want to consider\nhttps://lbry.tv/\nwhich is a centralized frontend for a truly decentralized YouTube analogue, the \nhttps://lbry.com/get\nThe beauty of the LBRY is that it has gained some traction among some of the main-stream YouTube stars, like the\nhttps://lbry.tv/@eevblog:7\n\nAn old fashioned web ring style centralized video sharing web application is the\nhttps://joinpeertube.org/\nObvioursly the PeerTube nodes/web_application_instances are subject to censorship, but often times it is better than YouTube for some things.\n\nA search engine that uses video metadata and gives nonsense search results, but is really good for discovering less popular centralized video hosting sites, is\nhttps://www.peteyvid.com/\n\nSome political nonsense videos can be found from the following centralized/censored sites:\nhttps://bittube.tv/\nhttps://www.bitchute.com/\n\nInterestingly the Great FireWall of China and the rest of the Chinese censorship apparatus does not censor Chinese video hosting sites that are exclusively for music remixes. With their laxer approach to western copyrights, some really good remixes might be found from there and listened to even at the Western World censored-net. For example:\nhttps://www.bilibili.com/video/BV1VE411w7Do",
				"added": 1605877536
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 21,
				"body": "I suggest that You learn from the history of computer networks. One of the main lessons is that \nINTERFACES MUST STAY STABLE \nand then there are multiple implementations that work with those interfaces and different implementations introduce their own extensions, which, if \"good\", will be copied/adopted by other, competing, implementations. That is a general pattern, but to avoid being vague, I list some of the examples here:\n\n))) Email clients and e-mail servers.\n))) Web browsers and web servers.\n))) Web browser technologies like default WebM support, JavaScript, CSS, the JavaScript sub-set called WebAssembly, the web-browser built-in database, the various connection types of web browsers, including those that allow video conferencing, video streaming, etc.\n))) Physical network standards like token ring, twisted pair, WiFi, etc. Very different implementations by very different hardware manufacturers, but they all operate together and no single manufacturer has the monopoly on any of those.\n))) Facimiles/fax_machines were manufactured by different manufacturers that had different implementations/electronics/firmware, but one fax machine was able to send the document to another fax machine.\nhttps://en.wikipedia.org/wiki/Fax\n))) Pre-WWW-technologies, where computers connected \"P2P\" by calling to each other with phone line MODEMs(MODEM: MO-dulator-DEmodulator). Examples of such solutions include\nhttps://www.fidonet.org/\nhttps://en.wikipedia.org/wiki/Usenet\nhttps://web.archive.org/web/20190426013635/https://thenewstack.io/gopher-ruled-internet/\n))) The \"Fediverse\"\nhttps://fediverse.party/\nhttps://en.wikipedia.org/wiki/Fediverse\n))) BitTorrent with its multiple different client/node implementations.\n))) The various Gnutella and  ED2K file sharing protocol client/node implementations.\n\nThere is also the question, what are the new qualities that the new implementation brings to the market. In the open source world the new qualities do not have to be visible to the end user, end consumer. The new qualities could be a more organized source tree or an implementation in some programming language that hasn't been used for implementing the application. Think of Java implementations of database engines and 3D game engines. The new quality might also be some form of optimization, like smaller RAM consumption, smaller start-up time, less CPU-cycles (from PHP/Python/Ruby to something pre-compiled). In the case of the ZeroNet the protocol is, if not totally stable, then quite stable, but the default implementation is in Python, which is really difficult to use portably. \n\nA really high-quality C++ implementation that uses some old C++ standard, something from the late 90-ties, might be a very useful  thing, specially if it can be compiled with something as old as the Borland C++ compiler\nhttps://edn.embarcadero.com/article/20633\nNewer UNICODE tables and all of the operating system specific parts like network access could be wrapped to a special separation layer, which in turn uses plain C interfaces for communicating with whatever implementation happens to run on a given operating system (old Windows, old BSD-s, old Linux, old Solaris, etc.). If the new ZeroNet implementation is not done for money, then it is possible to take it \"slow\" and put quality first. The carefully crafted sub-components, for example, the network communication layer, could be crafted so that they can be used in other projects, so that if the ZeroNet project does not work out for whatever reason, the work/human_life_hours spent on its subcomponents are not \n wasted. If the sub-components have been properly done, they are not some dirty hack, then they have their own, independent, documentation, build scripts, tests, all the rest, so that they can be published independently of the new ZeroNet implementation. \n\nPeople, who just want to have fun, may try to create their new ZeroNet implementation in some programming language that they want to learn. I suggest ParaSail\nhttps://www.parasail-lang.org/\nhttps://groups.google.com/forum/#!forum/parasail-programming-language\n\nAs of 2020 it does not have arbitrary precision integers yet, but those are part of the original specification and supposedly have been temporarily implemented as 64b integers. Portability comes from translation from ParaSail to C++, probably to some very late version of C++, which is probably not supported by the default C++ compilers of older operating system distributions. I am not sure, but from documentation and forum posts it seems to me that the generated C++ code uses OpenMP for multithreading. ",
				"added": 1605882606
			}
		],
		"1605824826_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 22,
				"body": "> [kapec](#comment_78_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): they're going to ban mathematics? how?\n\nVery easily. Remember the concentration camps, where Jews were cremated? Modern crematories can be far more efficient and there aren't that many mathematicians and IT-people and physicists and other engineers in the population. The Nazis did not care that their economic elite, the \"rich Jews\", went to dust and their economy for the common \"ethnic\" Germans, the \"Aryan race\", plummeted. The Nazi leadership lived prosperously even, when other \"pure Aryan\" Germans starved, buy, hey, \"Heil Hitler!\" Just about 20 years after the collapse of the Nazi Germany that the once oppressed French did not mind using torture at their colonies.\nhttps://en.wikipedia.org/wiki/Torture_during_the_Algerian_War_of_Independence\nThat is to say, not much was learned. After all of that, the George Walker Bush administration had their Iraq war era torture program, the \"renditions\", etc.\n",
				"added": 1605956811
			},
			{
				"comment_id": 23,
				"body": "> [frankdank](#comment_3_18rBTXj2fkSLcnaumaafaidHTFEA6eu5kV):  As long as distributions of lynx exist and are open source (and they always will) they are helpless to stop us.\n\nAnd where are You going to get the source of that application, if You depend on some Internet Service Provider company that may \"adhere to a law\" that bans properly encrypted communication and blocks all \"illegal content\"? Even the ZeroNet depends on those IPv4 networks. One might try steganography, satellite phones, old school telephone MODEMs, but those can also be deemed \"illegal\" without \"proper\" government monitoring. Pirate cube-satellites that broadcast source code in stead of wikipedia content?\nhttps://othernet.is/\nThe World Trade Organization might demand that certain \"intellectual property laws\" be adhered to by all of its members and if even the Western governments like to limit free speech, then it is totally conceivable that certain \"general trade rules\" will include requirements to make thorough censorship technically possible and it IS possible, if all of the ISPs route their traffic trough government censorship datacenters and all other connections are \"illegal\", proper crypto is \"illegal\", steganography is \"illegal\". There will be some cat-and-mouse game, but the cat covers the whole area and the mouse runs only, where the cat is asleep.",
				"added": 1605958202
			},
			{
				"comment_id": 24,
				"body": "On the other hand, there is this document from year 2017:\nhttps://www.europarl.europa.eu/doceo/document/A-8-2017-0324_EN.pdf\nCitations:\n\n\"Metadata can also be processed\nand analysed much easier than content,\nas it is already brought into a structured\nand standardised format. The protection\nof confidentiality of communications is an\nessential condition for the respect of other\nconnected fundamental rights and\nfreedoms, such as the protection of\nfreedom of thought, conscience and\nreligion, freedom of assembly, freedom of\nexpression and information.\"\n\n\"Service providers who offer\nelectronic communications services should\nprocess electronic communications data\nin such a way as to prevent unauthorised\nprocessing, including access, or\nalteration. They should ensure that such\nunauthorised access or alteration can be\ndetected, and also ensure that electronic\ncommunications data are protected by\nusing state-of the art software and\ncryptographic methods including\nencryption technologies. Service providers\nshould also inform users of measures they\ncan take to protect the security of their\ncommunications for instance by using\nspecific types of software or encryption\ntechnologies. \"",
				"added": 1605959477
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 25,
				"body": "> [anshorei]: Zuckerberg should probably be turned off too while we're at it.\n> [bigbadbob] How can this be done?\n\nDelete his Facebook and Twitter accounts :-D\n... and his bank accounts, you know, the ones with billions of $ on them. \nLet him do some real work for a change, like the people, who actually have to writhe the code at places like Facebook and Twitter. Deletion of those bank accounts might help to fight the horrible inflation of the dollar a bit.\n\nIt's kind of funny that if the billionaires lost access to their billions in the U.S., then the deflation of the dollar will make the shoddy small \"minimum\" wages of the employees of those billionaires much bigger. I'm against communism, but the system is so rigged that at some point one may fight fire with fire, robbing with robbing (in Robin Hood style). At the same time I recognize that many of the \"minimum\" wage receivers should really not get their wage all in money, but in 2 parts: pocket-money for dumb wasting and products-and-services in the form of \"free\" housing, HEALTHY food (they can choose, which food, but the choice will be allowed only from healthy choices), proper health-care. If they want more choice, then they do have the option to run their own business, but if they can't handle even their own money matters, waste that little that they have on alcohol, drugs, casinos, then they are not the people, who are capable of running businesses. There should _not_ be any artificial limits for running one's own business, just some people are psychologically not capable of doing it.",
				"added": 1605963381
			},
			{
				"comment_id": 26,
				"body": "> [cathannaerra](#comment_3_1An8FiAnbsUrwMrfo33rsHAzk9xiH8BR8w):  Its the silicon watch valley.\n\nThe \"smart\" watches that have integrated cellphones in them are covered by this phrase really well, specially if the \"smart\" watches include a GPS receiver.",
				"added": 1605965346
			},
			{
				"comment_id": 27,
				"body": "> [cathannaerra](#comment_4_1An8FiAnbsUrwMrfo33rsHAzk9xiH8BR8w): fuck you Google you are a threat. Facebook too Insta... too, all partners too... You control the data, you control a society for the destruction. Make each person, a slave.\n\nWhy to bother, if an A.I. entity can do the job faster and cheaper and with higher quality? Just kill the useless bugs. Nuke the rioting useless \"worker class\". Matrix style. \n\nMay be the COVID19 is just a test for something more lethal. The core of the Tom Clancy \"Rainbow Six\" story is that environment fanatics develop a pandemic virus and a vaccine, the elite get the vaccine, the rest are left to die to reduce the human footprint on planet Earth and the elite would live happily ever after with the help of automation, if there weren't the gun slinging book-heroes to stop them. A spoiler: the environment fanatics get killed and everybody else get the vaccine.\n\n    https://en.wikipedia.org/wiki/Rainbow_Six_(novel)",
				"added": 1605965460
			}
		]
	},
	"comment_vote": {
		"13_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"35_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"183_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"18_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1430_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"12_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"2006_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr": 1,
		"35_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"40_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"66_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"157_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"53_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"785_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}