{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1,
			"title": "Pruebas",
			"body": "Vamos a ver que se puede hacer con esta apli de foros",
			"added": 1478117864
		},
		{
			"topic_id": 2,
			"title": "Prueba 2",
			"body": "segunda preuba",
			"added": 1478117926
		},
		{
			"topic_id": 3,
			"title": "“La revolución de una brizna de paja” de Masanobu Fukuoka",
			"body": "“La revolución de una brizna de paja” de Masanobu Fukuoka\nhttp://caminosostenible.org/wp-content/uploads/BIBLIOTECA/LA%20REVOLUCION%20DE%20UN%20RASTROJO%20-%20Masanobu%20Fukuoka.pdf",
			"added": 1478275763
		},
		{
			"topic_id": 4,
			"title": "Soy una lombriz, soy roja, soy californiana, soy una estafa",
			"body": "Me llamo Eisenia andrei, soy la vieja lombriz euroasiática junto a Eisenia fetida o lombriz rayada llevamos décadas siendo utilizadas de manera consciente por muchos agricultores para mejorar el compost y en el mejor de los casos para mejorar el suelo aunque en realidad llevábamos milenios haciendo el trabajo de manera callada, es decir, sin que el ser humano se entere.\n\nEn los años 50 del siglo pasado los humanos nos pusieron a trabajar de manera organizada, está claro estos extraños seres llevaban unas décadas de agricultura industrial, una agricultura que ya se estaba haciendo muy agresiva y estaba destrozando nuestro hábitat, entre abonos químicos y herbicidas el suelo se vuelve inerte y ya no tiene alimento para nosotras. Algunos de los humanos parecen no estar tan locos y esos son los que hace más de sesenta años reconocieron que si nosotras procesábamos su compost tenían mucho mejores nutrientes que con los abonos químicos y nos encerraron en cajones o nos pusieron sobre bancales de compost para que comamos nos reproduzcamos y caguemos, lo bueno es que ya se están dando cuenta de que lo mejor es regenerar el suelo y que podamos vivir en el.\n\nFue en california donde a mediados del siglo pasado se experimentó más con nuestras habilidades para producir nutrientes y mejorar el suelo pero ahora volvamos a los más locos entre los humanos por que lo que sucedió después de que los prehippies californianos comiencen a utilizarnos es de psiquiatra.\n\nUn tal Ferruzzi dijo que solo nosotras eramos aptas para el lumbricultivo y que éramos un híbrido creado en una universidad de california y ¡oh casualidad! El tenía muchas de nosotras para vender y resulta que: aunque nuca dijo de que universidad se trataba ni mostró documento alguno sobre esa hibridación otros muchos humanos le creyeron y hasta la actualidad aunque los análisis genéticos ya demostraron que somos la Eisenia andrei de siempre.\n\nEn síntesis: si soy útil para el lumbricultivo o para mejorar el suelo, si soy de las más utilizadas y si tu campo no está muy contaminado y tengo alimento puedes migrarme a el, lo colonizaré gustosamente y te verás beneficiado por mis actividades pero piensa que si hay unas lombrices locales tal vez se adapten mejor, que si pones distintas variedades de nosotras puede que aportemos diferentes cosas pero no olvides que cualquier lombriz es útil para producir compost lumbricultivado o para mejorar la tierra y que por si fuera poco si alguien te dice que te vende rojas californianas que somos híbridas creadas en una universidad y las únicas aptas o las mejores para el lumbricultivo, te miente y pretende estafarte.",
			"added": 1478283306
		},
		{
			"topic_id": 5,
			"title": "Convertir recursos en basura y comprar basura a la industria",
			"body": "Siempre me ha llamado la atención la cantidad de broza que se puede ver en los contenedores en zonas semi-rurales pero últimamente este tema me está llevando del asombro a la desesperación. Usaré como ejemplo nuestra huerta del Lagares (Vigo) Hace algo más de año y medio que estamos trabajando en esa huerta, cuando llegamos a ella eran 500m2 ocupados densamente por silvas de dos metros de altura incluidos gruesos troncos.\n\nLo primero que hicimos fue entrar con la guadaña, guadañando y dejando la broza en el lugar, una vez guadañanda la tercera parte de la parcela, mientras uno seguía con la guadaña otros nos dedicábamos con rastrillo y azada a por un lado marcar bancales de un metro de ancho de donde desplazábamos la cobertura dejada por la guadaña a pasillos de medio metro de ancho, otra parte de la broza fue usada para hacer un cerco natural rodeando la huerta. De esa manera hasta cubrir toda la parcela, todo esto ante el asombro de vecinos y algún paseante que no dejaban de darnos concejos de como deshacernos de la inútil y molesta broza, nos recomendaban desde quemar la parcela completa o quemar la broza una vez extraída hasta dejarla en los contenedores, otro día hablaremos sobre hacer quemas sobre el mismo suelo que usamos para cultivar por el momento lo dejo en una síntesis stalmanina: quemar y agregar cenizas al suelo es bueno, quemar sobre el suelo a cultivar es malo.\n\nPara hacer cultivable la parcela no nos hemos desecho ni de un gramo de la broza, es más, hemos importado grandes cantidades de broza y mierda de distintos animales de las parcelas de los vecinos y lo seguimos haciendo, poco a poco los vecinos pasaron de la incredulidad a decirnos frases tipo, “¿y donde está toda aquella broza? Cierto, cabrones, trabajáis menos que yo, no hace falta llevar la broza al contenedor, con dejarla en un rincón o ponerla por los caminos entre bancales se arregla el asunto y ahora ya ven que con los debidos procesos la broza no es basura es un valioso recurso que se convierte en fertilizantes más baratos y de mejor calidad en todo sentido que los fertilizantes y abonos químicos he incluso orgánicos comprados a la industria ya comienzan a preguntar el por que y el como del bocashi el lumbricompostado ya ven que la broza se puede compostar o usar para coberturas, que la broza gruesa, la fina, la espinosa, son todas aprovechables y que su aprovechamiento es rentable.\n\nHe descubierto que no se puede combatir con discursos y argumentos la ignorancia provocada por la mercadotecnia al servicio de la industria, en cambio el ejemplo azada en mano es la más efectiva forma de docencia.",
			"added": 1478283445
		},
		{
			"topic_id": 6,
			"title": "Soberanía alimentaria en Wallmapu: Las maravillas de la Kinwa Mapuche",
			"body": "La diversidad de hábitat en el mundo ha posibilitado el desarrollo de una gran variedad de culturas, las que han resuelto de diferentes maneras sus problemas de provisión de alimentos, abrigo, salud y bienestar. Este desarrollo es interdependiente con la creación de sistemas de conocimiento y se relaciona con las diferentes necesidades, costumbres y gustos de cada cultura. Esto hace, que también, el uso y la selección de plantas sean diversos, así como los criterios para incorporarlos en sus agroecosistemas, con lo cual, se corrobora que la diversidad cultural y la biodiversidad expresan una interacción, que, a través de la historia ha contribuido a enriquecer las diversas expresiones culturales de las sociedades.\nhttp://www.cetsur.org/wp-content/uploads/la-kinwa-mapuche-un-aporte-a-la-alimentacion.pdf",
			"added": 1478453735
		},
		{
			"topic_id": 7,
			"title": "Bolivia - Urge la eliminación gradual de transgénicos y el etiquetado",
			"body": "copia pega de: http://www.soberanialimentaria.org.bo/index.php?option=com_content&view=article&id=185:urge-la-eliminacion-gradual-de-transgenicos-y-el-etiquetado&catid=46:ogms&Itemid=759\n\nSonia Maldonado Poma Coordinadora ETL-FOBOMADE\n\nA cinco años de la Constitución Política del Estado, tres años de la Ley de Revolución Productiva Comunitaria Agropecuaria y dos años de la Ley Marco de la Madre Tierra y Desarrollo Integral para Vivir Bien, no existe normativa para el etiquetado de transgénicos y para la eliminación gradual del cultivo de soya transgénica, el único autorizado en Bolivia, el 2005.\n\nEl 26 de junio 2011 fue promulgada la Ley 144 denominada Ley de Revolución Productiva Comunitaria Agropecuaria que incluye varios artículos para la protección de Recursos Genéticos. En su Art. 15 menciona que “….. el Estado protegerá la biodiversidad como sustento de los sistemas de vida y sus procesos naturales, garantizando la seguridad con soberanía alimentaria y la salud de las personas para ello: …… 2. No se introducirán en el país paquetes tecnológicos agrícolas que involucren semillas genéticamente modificadas de especies de las que Bolivia es centro de origen y diversidad ni aquellos que atenten contra el patrimonio genético, la biodiversidad, la salud de los sistemas de vida y la salud humana. 3. Todo producto destinado al consumo humano de manera directa o indirecta, que sea, contenga o derive de organismos genéticamente modificados, obligatoriamente deberá estar debidamente identificado e indicar esta condición.” Asimismo en el Art. 19 parágrafo II numeral 5 indica que “Se establecerán disposiciones para el control de la producción, importación y comercialización de productos genéticamente modificados”.\n\nLa Ley Marco de la Madre Tierra y Desarrollo Integral Para Vivir Bien que fue promulgada el 15 de octubre de 2012 también hace mención en su Art. 24 numerales 7 y 8 a este tema: “Desarrollar acciones de protección del patrimonio genético de la agrobiodiversidad, prohibiendo la introduccion, producción, uso, liberación al medio y comercialización de semillas genéticametne modificadas en el territorio del Estado Plurinacional de Bolivia de las que Bolivia es centro de origen o diversidad y de aquellas que atenten contra el patrimonio genético, la biodiversidad, la salud d los sistemas de vida y la salud humana”. 8. “Desarrollar acciones que promuevan la eliminación gradual de cultivos de organismos genéticamente modificados autorizados en el país a ser determinada en norma especifica”.\n\nLa Constitución Política del Estado Plurinacional promulgada hace 5 años, la Ley de Revolucion Productiva Comunitaria Agropecuaria hace 3 años y la Ley Marco de la Madre Tierra y Desarrollo Integral Para Vivir Bien hace 2 años, prohiben el uso de organismos geneticamente modificados, pero esta última hace enfasis en la erradicación gradual de los cultivos de estos organismos geneticamente modificados autorizados y el único cultivo autorizado en nuestro país por Decreto Supremo es una variedad de soya transgénica resistente al glifosato, el mismo que debería ya estar en proceso de eliminación. Al mismo tiempo, la importación de productos industriales debería ya contar con el etiquetado correspondiente que señale claramente su origen transgénico.\n\nEl 01 de octubre el Instituto Boliviano de Comercio Exterior (IBCE) la Cámara Agropecuaria del Oriente (CAO) y Confeagro realizaron un foro denominado “Soberania Alimentaria, Sostenibilidad y Seguridad Jurídica”, donde se planteó que se autorice el uso de transgenicos de maíz y algodón, lo que transgrediría la normativa vigente en nuestro país. Asimismo dieron a conocer que los productos que ingresan al país son de producción transgénica por lo que se debe hacer también cumplir que esta producción que ingresa a nuestro país sea controlada y lleve el etiquetado correspondiente.\n\nLos representantes de las instituciones mencionadas dieron a conocer que existe una propuesta para el uso de semillas del maíz y algodón y que fue presentada ya al Órgano Ejecutivo, donde destacan el plan del uso de semillas transgénicas que solo serían utilizadas en los departamentos de Santa Cruz, en el Chaco Chuquisaqueño y Tarijeño, puesto que este plan contemplaría un “cinturón de seguridad” para evitar que las semillas pasen a los valles donde se produce maíz destinado al consumo humano, con estas determinaciones ellos afirman pretender garantizar la seguridad alimentaria del país hasta 2025.\n\nCon la internación de semillas genéticamente modificadas se estaría atentando con la producción del pequeño productor que cultiva maíz, pues la contaminación de sus cultivos sería inminente, sin hablar de la contaminación del centro de diversidad que es nuestro país. Según datos del INIAF la producción de maíz en Bolivia, es de 1,2 millones de toneladas, lo suficiente para abastecer el mercado interno. ¡De qué seguridad alimentaria hablan?\n\n“Bolivia no necesita transgenicos”",
			"added": 1478454416
		},
		{
			"topic_id": 8,
			"title": "Por qué debes dejar de comer aguacate ahora mismo ",
			"body": "Cpia pega de: https://actualidad.rt.com/actualidad/222930-aguacates-mexico-enfermedades-deforestacion\n\nExpertos advierten que el cultivo de aguacates en México causa una desforestación sin precedentes, mientras que los lugareños sufren por el uso de químicos.\n\nLos productores de aguacate talan vastas extensiones de bosque para dar cabida a más árboles frutales en el estado de Michoacán, la capital mundial del aguacate. Por otra parte, también hay preocupación por los efectos de la industria para los residentes locales, pues los químicos que se emplean en las plantaciones de aguacate podrían estar detrás de las enfermedades que padecen, publica 'The Independent'.\n\nLos bosques lo pagan caro\n\nAlrededor del 40% de los aguacates del mundo se cultivan en México, y la mayoría proviene del área de Jujucato y el lago de Zirahuén, en el estado de Michoacán. De acuerdo con datos oficiales, las plantaciones de aguacates ocupan cerca de 137.000 hectáreas del estado.\n\nLa mitad de esos huertos fueron plantados en bosques después de que la tierra fuera comprada \"a través de dudosos medios legales\", señaló Jaime Navia, jefe de una ONG de tecnología rural llamada Gira. Según él, la deforestación está creciendo a un ritmo del 2,5% anual.\n\nSi bien existe una fuerte demanda local, la producción se ha incrementado debido al creciente atractivo internacional del aguacate ―especialmente por parte de EE.UU. y de países como Japón― y los bosques han pagado el precio, resume 'The Independent'.\nUn hombre trabajando con un tractor durante la cosecha de aguacate en el municipio de Uruapan, estado de Michoacán (México), el 6 de abril de 2016\nUn hombre trabajando con un tractor durante la cosecha de aguacate en el municipio de Uruapan, estado de Michoacán (México), el 6 de abril de 2016Enrique CastroAFP\nLa gente también lo sufre\n\nSalvador Sales, un profesor local, indicó al diario que sus estudiantes sufren cada vez más problemas de respiración y de cuestiones relativas al estómago. \"Creemos que es causado por los productos utilizados para rociar los huertos de aguacate\", sostuvo y añadió que el viento podría arrastrar los vapores químicos hasta los hogares de sus alumnos.\n\nPor su parte, expertos advierten que los productos químicos utilizados en los huertos pueden derramarse hacia las aguas subterráneas, arroyos, ríos y lagos, y posteriormente causar enfermedades a la población. En ese sentido, el especialista local Alberto Gómez Tagle observa que muchas comunidades que dependen del agua del lago de Zirahuén ya están sufriendo los efectos del escurrimiento del químico.\n\n\nUna localidad de la zona incluso solicitó ayuda a los investigadores cuando distintos residentes comenzaron a padecer problemas hepáticos y renales que no existían hasta que \"se expandieron los huertos de aguacate y se aplicaron todo tipo de pesticidas\".\n\nEl llamado 'oro verde' es el principal ingreso de la economía de Michoacán. El secretario de Urbanismo y Medio Ambiente Ricardo Luna García afirma que el ingreso por esta actividad supone 17.000 millones de pesos anuales (unos 872 millones de dólares), mientras que cada año se exporta un millón de toneladas de esta fruta.",
			"added": 1478467174
		},
		{
			"topic_id": 9,
			"title": "La Vía Campesina denuncia la creciente criminalización y persecución contra el campesinado en Brasil",
			"body": "copia pega de: https://viacampesina.org/es/index.php/temas-principales-mainmenu-27/derechos-humanos-mainmenu-40/2826-la-via-campesina-denuncia-la-creciente-criminalizacion-y-persecucion-contra-el-campesinado-en-brasil\n\n    Publicado el Martes, 08 Noviembre 2016 22:01 \n\nComunicado de Prensa - La Vía Campesina\n\n(Harare, 8 de Noviembre de 2016) La Vía Campesina, movimiento campesino internacional, denuncia la triple alianza entre el gobierno  golpista de Temer, los intereses transnacionales y los medios de comunicación masiva, que buscan crear un escenario de la opinión pública para criminalizar  a los movimientos sociales en Brasil en su derecho legítimo a resistir y protestar.\n\nDesde su asunción al poder, el gobierno de Temer,  ha fortalecido su proyecto  neoliberal de reducir costos del trabajo, entregar recursos, privatizar y dar privilegios al agronegocio, en detrimento,  de los sectores populares, campesinos, indígenas y las poblaciones más pobres;  los recursos que antes estaban  destinados a sectores públicos como  la educación, salud y derechos de las y los trabajadores fueron pisoteados días después de su posesión.  Imponiendo una política del miedo, persecución y criminalización orquestadas por los medios de comunicación como Globo donde nuestros compañeros y compañeras son presentados como criminales violentando sus derechos civiles y su derecho a la organización.\n\nAnte los recientes hechos ocurridos contra el Movimiento de Trabajadores Rurales Sin Tierra, MST de Brasil, miembro de La Vía Campesina, expresamos que es preocupante que se den estos atentados a los derechos civiles y que se pretenda criminalizar a los movimientos sociales.\n\nEn ese sentido, como  La Vía Campesina Internacional hemos venido impulsando una Declaración de los Derechos Campesinos dentro de Naciones Unidas donde resaltamos que es urgente que se garantice el derecho de las campesinas  y  campesinos  a  la  libertad  de  asociación y organización,  así como el   derecho  a  no  ser  criminalizados  por  sus demandas  y  por  sus  luchas legitimas.\n\nComo movimiento internacional vemos con mucha preocupación este tipo de política de odio que se consolida con gobiernos de derecha en el poder; por lo que denunciamos y llamamos a nuestras organizaciones, amigos y aliados a mantenernos alertas para que estas acciones de persecución, de encarcelamiento y criminalización no se repitan, pues lo único que provocan es un debilitamiento grave de la democracia.\n\nLos pueblos del mundo tenemos derecho de a resistir y a protestar frente a políticas neoliberales  que reducen nuestros derechos y atentan contra la vida.  Es por eso que como La Vía Campesina nos sumamos a las voces de denuncia y resistencia  de  cientos de organizaciones, personalidades, académicos y artistas de  distintos continentes, a nivel mundial, que han manifestado su solidaridad  y apoyo con el MST y a los pueblos organizados en Brasil.\n\n¡El MST no está solo!\n\n¡Globalicemos la lucha, globalicemos la esperanza!\n\nCrédito Ilustración: Francisco Daniel",
			"added": 1478810561
		},
		{
			"topic_id": 10,
			"title": "Este jueves en Temuco se realizará jornada sobre “Conflictos Ambientales y Soberanías-Economías Locales”",
			"body": "copia pega de: http://www.mapuexpress.org/?p=12668\n\nEn el marco del Congreso Nacional de Psicología Comunitaria a realizarse en Temuco (del 09 al 11 de noviembre), se realizará una jornada denominada Feria – Conversatorio sobre “Conflictos Ambientales y Soberanías-Economías Locales”, el día jueves 10 de noviembre a las 15,30 horas, con la experiencia de redes y de acción colectiva, la que se desarrollará a las 15,30 horas en la Universidad de la Frontera, Aula Magna al lado del Gimnasio Olímpico (entrada por calle Uruguay).\n\n– En medio de una serie de conflictos ambientales, cada vez toma más fuerza la necesidad de contemplar experiencias locales y tradicionales que sostienen economías y soberanías de acuerdo a los intereses y necesidades de las poblaciones locales, con pertenencia e identidad.\n\n–\n\nPara este fin, se contempla una fase previa de Feria informativa y luego, la intervención de un Panel donde intervendrán: Claudia Mellado Ñancupil, vocera de la Red de Semillas Libres – Wallmapu e integrante de Anamuri; Gonzalo Silva, integrante de la Cooperativa Fën y de la Red de Ferias y Mercados con Identidad; Onésima Lienqueo, del área de educación y economía de la Red de defensa de los territorios; Simón Crisóstomo Loncopán, werken del Lof Trankura de Curarrehue, entre otros participantes, para luego un conversatorio que permita profundizar ciertos lineamientos.\n\n–\n\nVarias de las expresiones que asistirán a este encuentro, mantienen experiencias vivas en la perspectiva de la defensa de los territorios y el desarrollo de economías solidarias que apuntan a fortalecer la economía local y a la identidad, mediante la articulación de circuitos económicos territoriales a través de procesos de autonomía y gestión cooperativa.\n\n–\n\nAsimismo, se destaca el cuidado y protección de las semillas y las especies nativas con los conocimientos asociados a ellas que constituyen un derecho de los pueblos como fundamento del cuidado de la vida y del patrimonio cultural, base fundamental de la soberanía alimentaria.\n\n–\n\nOtro elemento de importancia a considerar, es el de generar propuestas desde el saber de los territorios, inspirados en el küme-mongen, en el vínculo respetuoso entre los procesos económicos y los ciclos de la naturaleza desde la cosmovisión mapuche y el saber campesino.",
			"added": 1478810808
		},
		{
			"topic_id": 11,
			"title": "Por que no hacemos un blog sobre soberanía alimentaria",
			"body": "Al iniciar el proyecto se soberanía alimentaria en ZeroNet, tenía clara dos cosas, la primera que como soy un hombre viejo trabajaría con el antiguo concepto de portal de portal de Internet, aunque en este caso restringido a esta red p2p, para los que no tengan canas recordemos que un portal era un sitio web que “facilitaba” el acceso a distintos servicios de la red: buscadores, correos, noticias, chats, foros y distintas formas de publicar contenidos. El 90% de los portales pertenecían a empresas que pretendían regalarte la puntita y venderte el resto, somos el 10% :). La segunda cosa que tenía clara es que el 0portal sería creado a base de zitios colaborativos, he aquí la cosa del título, por el momento los 0blogs son personales, no se puede dar permiso de publicación a terceras personas o al menos no se hacerlo. \n\nPor otro lado considero que no es estrictamente necesario, ya que podemos usar este foro a manera de blog sin problema alguno, con el tiempo agregares en una columna lateral detalles cmo ultias entradas últimos comentarios, herramientas de búsqueda etc.  \n\nPara la soberanía alimentaria, huertas colectivas, para las huertas colectivas, comunicaciones soberanas.",
			"added": 1478870044
		},
		{
			"topic_id": 12,
			"title": "Comunicado de Amigos de la Tierra por situación en Ecuador",
			"body": "Amigos de la Tierra Internacional y Amigos de la Tierra de América Latina y el Caribe lanzaron un comunicado en solidaridad con la organización ecuatoriana Acción Ecológica, luego de que el gobierno nacional solicitara su disolución a través de los ministerios del Interior y del Ambiente.\n\nEn solidaridad con Acción Ecológica ante la solicitud de extinción y disolución presentada por el ministerio del interior ecuatoriano\n\nDiciembre 21 de 2016\n\nAmigos de la Tierra Internacional -ATI- y Amigos de la Tierra de América Latina y el Caribe -ATALC- manifiestan su profunda preocupación por las noticias recibidas en las últimas horas desde el hermano país del Ecuador, en las que se señala la solicitud de procedimiento administrativo para la extinción y disolución (cierre) de la Organización Social Corporación Acción Ecológica, por parte del viceministro de seguridad interna Dr. Diego Torres Saldaña.\n\nA través de la presente comunicación, ATI y ATALC quieren manifestar su solidaridad con Acción Ecológica, a la que consideran una de las organizaciones que históricamente han luchado en América por la defensa de los derechos de la naturaleza, buscando la garantía de un ambiente sano y en pos del buen vivir y el respeto integral entre los seres humanos y de éstos con la naturaleza.\n\nComo Federación de organizaciones ambientalistas que trabajan desde la región de América Latina y el Caribe, y también desde diversas partes del mundo, hacemos un llamado a las organizaciones ecologistas y a todas aquellas que trabajan por la justicia social y ambiental en diferentes lugares del planeta para acompañar a Acción Ecológica en este difícil momento.\n\nAl gobierno del Ecuador solicitamos respetuosamente se entreguen todas las garantías para que a través del diálogo democrático se pueda llegar a la resolución adecuada de la situación que hoy se presenta con Acción Ecológica.\n\nhttp://radiomundoreal.fm/9513-ante-solicitud-de-extincion-y",
			"added": 1482345593
		},
		{
			"topic_id": 13,
			"title": "Se termina de caer la máscara del gobierno ecuatoriano: inicia proceso de cierre de Acción Ecológica: entrevistamos a una de sus integrantes",
			"body": "Se termina de caer la máscara del gobierno ecuatoriano: inicia proceso de cierre de Acción Ecológica: entrevistamos a una de sus integrantes\n\nAudio ogg mediante nijabeats:  http://127.0.0.1:43110/15F9LYs6c17NUXv3MxpJSGbpWxyHTEbzMk/stream/audio.html?ID=dbfb93f60fb43e8a50f9978105b949fad0e6dd37c4687a8653f7b90c8f79856e?\n\nAudio ogg magnet torrent: magnet:?xt=urn:btih:c74bb35b783eb341ddf9b8686795a3a675c94a06&dn=ecuador.ogg&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.fastcast.nz&tr=wss%3A%2F%2Ftracker.openwebtorrent.com\n\n\nCopia pega de: http://radiomundoreal.fm/9518-grave-y-urgente\n\n###  Gobierno de Ecuador inicia proceso de cierre de Acción Ecológica: entrevistamos a una de sus integrantes\n\nLa acción administrativa del gobierno ecuatoriano contra la organización Acción Ecológica pretende “silenciar una voz de defensa de la naturaleza y de los derechos humanos”, dijo este jueves a Radio Mundo Real la activista Ivonne Yánez, integrante de la agrupación.\n\nExiste una “política de amedrentamiento, hostigamiento y judicialización a las personas y organizaciones que de alguna manera hemos sido críticas y disidentes de las políticas destructivas del medio ambiente y de violaciones a los derechos humanos, que están produciéndose por parte de empresas mineras y petroleras en la Amazonía ecuatoriana y en otras partes del territorio nacional”.\n\nEl martes el Ministerio del Ambiente de Ecuador notificó a Acción Ecológica que se inició un proceso de disolución (cierre) en su contra, a pedido del Ministerio del Interior, y a consecuencia de una denuncia realizada por la minera de capitales chinos Exsa.\n\nAcción Ecológica alertó enseguida que se intenta responsabilizar a la organización por un conflicto en territorio indígena shuar, que incluyó enfrentamientos entre habitantes de la comunidad nankints, policías y militares, en instalaciones de la empresa china, en la parroquia Panantza, provincia de Morona Santiago.\nCientos de organizaciones y movimientos sociales de los cinco continentes han manifestado desde el martes su solidaridad y respaldo a Acción Ecológica, por su trabajo en defensa de la naturaleza y de los pueblos. Han solicitado además formalmente al gobierno de Ecuador que no avance en esta tentativa de cierre de la organización ecologista. También han apoyado al pueblo indígena shuar, en su rechazo a la avanzada extractiva sobre sus territorios.\n\nIvonne Yanez profundizó sobre el caso que enfrentan, el trabajo de Acción Ecológica en el país, la lucha del pueblo shuar, la solidaridad internacional, entre otros puntos.",
			"added": 1482617647
		},
		{
			"topic_id": 14,
			"title": "“Respirando bosque nativo”: En Curarrehue se realizará la 12ª Feria Walüng",
			"body": "Post original fuera de zeronet: http://www.mapuexpress.org/?p=15156\n\nEl próximo domingo 15 de enero a las 11.00 hrs. abrirá sus puertas la 12ª versión de la Feria Walüng en Curarrehue, sector de Pichi Curarrehue, organizada por la Comunidad Walüng. Este año la Feria tendrá como lema “Respirando bosque nativo”, con el objetivo de llamar la atención sobre la situación de los bosques nativos del territorio y tomar conciencia de la importancia de su cuidado.\n\nEn la Feria el visitante podrá encontrar productos tradicionales, artesanía y degustar la cocina mapuche y campesina de la zona. También podrá participar en diversas actividades culturales, recreativas y artísticas al aire libre en un espacio sombrío a la orilla del río Trancura.\n\nLa Comunidad Walüng  propone una forma de llevar adelante una economía basada en principios y valores que promueven la autonomía y el cuidado del medio ambiente, la soberanía alimenticia y la recuperación de saberes ancestrales, abriendo un camino hacia un sistema económico y social más inclusivo y justo.\n\nLa Feria de este año estará abierta hasta el domingo 26 de febrero.\n\nContacto: walung.mercadosdekurarewe@gmail.com",
			"added": 1484320716
		}
	],
	"topic_vote": {
		"1_1CZBKdjnNa1dDCtnujs7c1aQ1DSf5bqxV9": 1,
		"1_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_1CZBKdjnNa1dDCtnujs7c1aQ1DSf5bqxV9": [
			{
				"comment_id": 1,
				"body": "Buen material, gracias",
				"added": 1478212208
			}
		],
		"8_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 2,
				"body": "El título no me parece correcto, hay que ver de donde vienen los aguacates (paltas) que comemos",
				"added": 1478467365
			}
		],
		"11_1QFcL2PapA8NuvNWeHCafHaMPJcXgmb55i": [
			{
				"comment_id": 3,
				"body": "> [papafrita](#comment_1_1KEjxt5KCyWMSC6E5U5PrCorLskHogqE4): Muy interesado. Soy de Buenos Aires y estoy comenzando a trabajar en un proyecto de soberania alimentaria basado en contratos inteligentes ejecutándose en Ethereum.\n\n¿Donde se puede seguir ese proyecto? :)",
				"added": 1480612369
			},
			{
				"comment_id": 4,
				"body": "> [papafrita](#comment_2_1KEjxt5KCyWMSC6E5U5PrCorLskHogqE4): En Febrero comenzamos a trabajar. Será público y se convocará desde Ethereum\n\nNo te olvides de avisarnos!!",
				"added": 1482608678
			}
		]
	},
	"comment_vote": {}
}