{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "Agreed. A community managed blacklist would be nice.\n\nI would also propose having multiple levels of filtering.\n\n- Hide CP (on by default)\n- No Adult content (useful for video sites, but it would have to be supported by the site itself)\n- No Violence (useful for video sites, but it would have to be supported by the site itself)\n- Safe for work (useful for video sites, but it would have to be supported by the site itself)\n- Kid safe (basically a whitelist for websites, would only include user generated content websites that support the filter as well)\n\nThis puts the user in the driver seat. For those who are on a nofap quest, or just don't want to be stimulated it is useful to use the Safe fork work (or no erotica) filter on and more filters could be developed and it should be easy to add it to a site if the site is a plugin in ZN.\n\nI would also propose No copyright violation filter. It would help promote content that the authors themselves added to video or music sites. For those who already have a subscription to music streaming, it would also help to stay clean and overall improve our image as a community.",
			"post_id": 4,
			"date_added": 1516347602
		},
		{
			"comment_id": 2,
			"body": "School is a huge waste of time if you're even semi competent programmer. The big corporations will want a degree but you're a non-conformist so the place where you'll want to work will most likely not give a damn about a degree.\n\nNot earning money sucks and you're experiencing a whole lot of it. May I suggest looking for work that you would love while at school and ditching the school as soon as you become comfortable at your job?\n\nDon't settle for average jobs, find one where they're crazy like you. Maybe look for hackerspaces / crypto meetups in your areas or consider moving somwhere where the hacker / hacktivist community is strong.",
			"post_id": 10,
			"date_added": 1516780713
		},
		{
			"comment_id": 3,
			"body": "Glad you did Sylvaine, would be too bad to lose someone over school.",
			"post_id": 11,
			"date_added": 1516971671
		},
		{
			"comment_id": 4,
			"body": "> [d3m0](#comment_1_1LPYzdWWJfCnR8Rv61ccYFhLiEYKisneT3): congrats and honestly anyone whos dropped out of college couldnt agree more, its a soul sucking cesspit\n\nWhile I finished mine, I didn't end up using much from it at work (although there were some really cool subjects). If I had to pick if I could work for 5-6 more years and learn how to drive sooner and travel a bit, I'd go for no college.\n\nMost of the day to day work is really basic and comes down to making good design choices with the code and letting the code teach you, which isn't taught at college at all.\n\nWe're so young and unexperienced when we go there that we feel like we **have to** finish it no matter what, especially when we already put in some time.\n\nThe only real benefit I can think of is that when someone asks me, I can say I did it, or at a doctor when they find out you have a title they treat you better (I get that they had to study hard to get their degree, but treating people better after you find out they have a degree? what a joke).",
			"post_id": 11,
			"date_added": 1517017006
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"11": 1
	}
}