{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1565107716_152fY68b7kM9nj4ErMRzbP64dVtj21dngk": [
			{
				"comment_id": 1,
				"body": "Have you considered not being a virgin?",
				"added": 1565120800
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "Is there a way to host images here?",
				"added": 1565120855
			}
		],
		"1564655403_1EhJMLVMZUfhiFBYi9pkjzoaFzBNeauUxR": [
			{
				"comment_id": 3,
				"body": "> [xcape2net](#comment_167_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): It looks like Cloudflare may have already started working on their app.  See their announcement last year.  The most interesting part is this: \"Today we’re excited to introduce Cloudflare’s IPFS Gateway, an easy way to access content from the InterPlanetary File System (IPFS) that doesn’t require installing and running any special software on your computer. We hope that our gateway, hosted at cloudflare-ipfs.com, will serve as the platform for many new highly-reliable and security-enhanced web applications. The IPFS Gateway is the first product to be released as part of our Distributed Web Gateway project, which will eventually encompass all of our efforts to support new distributed web technologies.\" [...]\n\nCloudflare is trash...",
				"added": 1565127610
			}
		],
		"1564106401_1EsM7XQ7MNtL2M8e823PoNiZMy2SBmWKHi": [
			{
				"comment_id": 4,
				"body": "The idea is you have advantages because of your class. Focus on class, not race!",
				"added": 1565127695
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 5,
				"body": "I found a vulnerability, having to put up with posters like you.",
				"added": 1565128910
			}
		],
		"1561670029_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 6,
				"body": "the donald is a propaganda board on a propoganda site.",
				"added": 1565128988
			}
		],
		"1564963792_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz": [
			{
				"comment_id": 7,
				"body": "> [kequc](#comment_3_19YVJpFh7593WTUYtoewx6du3CmuCEdxbG): People who go barefoot in the city are subhuman. Sandals are pushing it, and I think similarly of shorts unless the climate is hot. Barefoot at home is ok as long as you keep your place clean and have no guests over.\n\nBarefoot is fine out in your yard. It feels nice.",
				"added": 1565129077
			}
		]
	},
	"comment_vote": {}
}