{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1631200414,
			"title": "The best public zeronet proxy is back!!",
			"body": "https://zeronet.now.im/",
			"added": 1631200413
		},
		{
			"topic_id": 1631205039,
			"title": "Some ZeroMe users you might like",
			"body": "* [Nofish](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/nofish@zeroid.bit)——ZeroNet dev.\n* [Lola](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u/lola@zeroid.bit)——Liberté. Egalité. Poulet. Please, share your music : [mixtape.bit](/mixtape.bit)\n* [Git Center](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/gitcenter@zeroid.bit)——A ZeroNet developer. [My blog](/1FwH89xyniDgy3t6fCWrggLs22MnGPZ5K5/)\n* [P2P](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/p2p@zeroid.bit)——P2P user from China\n* [ulrichard](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ/ulrichard@zeroid.bit)——paragliding, software, bitcoin [my blog](/ulrichard.bit)",
			"added": 1631205036
		},
		{
			"topic_id": 1633895520,
			"title": "Big Data Analyses of ZeroNet Sites for Exploring the New Generation DarkWeb",
			"body": "**Abstract:\nZeroNet is a new generation typical dark web, which uses the Bitcoin encryption algorithm and BitTorrent technology to build a distributed and censored-resistant communication network. Based on our cumulative studies on the onion router, we present a big data analyses framework for automated multi-categorization of ZeroNet websites to facilitate analyst situational awareness of new content that emerges from this dynamic landscape. Over the last two years, our team has developed a distributed crawling infrastructure called ZeroCrawler that automatically crawls and updates ZeroNet websites in realtime. It stores data into a research repository designed to help better understand ZeroNet's hidden service ecosystem. The analysis component of our framework is called Automated Multi-Categorization Labeling (AMCL), which introduces a three-stage thematic labeling strategy: (1) it learns descriptive and discriminative keywords for different categories, and (2) get a probability distribution of the keywords for different categories, and then (3) uses these terms to map ZeroNet website content to several labels. We also present empirical results of AMCL and our ongoing experimentation with it, as we have gained experience applying it to the entirety of our ZeroNet repository, now over 3000 indexed websites. The experimental results show that AMCL can discover categories on previously unlabeled websites, and we discuss applications of AMCL in supporting various analyses and investigations of the ZeroNet websites.**\n\n**Authors: Jianwei Ding; Xiaoyu Guo; Zhouguo Chen**\n\n**Published: 12 January 2020**\n\n**DOI: 10.1145/3378936.3378981**",
			"added": 1633895516
		},
		{
			"topic_id": 1633896629,
			"title": "Traffic Classification of User Behaviors in Tor, I2P, ZeroNet, Freenet",
			"body": "**Abstract:\nIn recent years, more and more anonymous network have been developed. Since user's identity is difficult to trace in anonymous networks, many illegal activities are carried out in darknet. In this paper, we propose a hierarchical classifier of darknet traffic which can distinguish four types of darknet(Tor, I2P, ZeroNet, Freenet) and 25 darknet users' behavior. Due to the lack of public datasets, we deployed a darknet data probe that can capture real darknet traffic in Tor, I2P, ZeroNet, Freenet. After collecting and labeling darknet traffic, we extract 26 time-based flow features that can represent the characteristics of darknet traffic and train a hierarchical classifier constructed by 6 local classifiers. Results show that the classifier can easily distinguish Tor, I2P, ZeroNet, Freenet four kinds of darknet clients with an accuracy of 96.9% and identify 8 kinds of user behaviors for each type of darknet with an accuracy of 91.6% on average. With the help of this hierarchical classification method, darknet user behaviors can be accurately distinguished at the traffic exit.**\n\n**Authors: Yuzong Hu; Futai Zou; Linsen Li; Ping Yi**\n\n**Published in: 2020 IEEE 19th International Conference on Trust, Security and Privacy in Computing and Communications (TrustCom)**\n\n**DOI: 10.1109/TrustCom50675.2020.00064**",
			"added": 1633896624
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1631205039_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": []
	},
	"comment_vote": {}
}