{
	"title": "Boozycat's blog",
	"description": "Ни о чём. Ни зачем.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"footer": "Powered by [ZeroNet](https://zeronet.io) [open, free, and uncensored]",
	"modified": 1540909941,
	"post": [
		{
			"post_id": 8,
			"title": "...а также в области балета мы впереди планеты всей!",
			"date_published": 1540908330.179,
			"body": "Нет, я всё-таки обожаю отечественное софтостроение. Особенно, если софт выпускается для государственных нужд. Вот уж действительно, любо–дорого посмотреть. Правда, больше дорого, чем любо — кто хоть раз работал на электронных площадках гос. закупок меня поймёт.\n\nТак уж сложилась моя, не знаю какая по счёту жизнь, но работаю я в одном очень государственном учреждении, и по роду деятельности сталкиваюсь с такими шедеврами софтостроения и сисадминства, что ни в сказке сказать, ни елдой почесать. Чего только стоит установка полноценного Oracle для управления базой данных отдела кадров размером аж в 500МиБ. При том, что рядом лежит основная БД, которая дохрена весит, ежедневно пополняется, к ней подключены одновременно десятки пользователей и всё это под управлением хлипенького Firebird. Но сейчас не об этом.\n\n* * *\n\nДавным-давно ~~в далёкой галактике~~ нашему государству понадобилось организовать всероссийскую защищённую сеть, чтобы можно было из одного города в другой гонять кучу бесполезной информации так, чтобы об этом никто не узнал, а если бы и узнал, то не смог бы перехватить, и чтобы всё было прозрачно для пользователей. Такая вот задачка: взять около 20 тысяч компов по всей стране и связать в локалку. Любой админ сразу скажет: и всего-то?.. Ставим на каждом подключаемом объекте VPN-шлюз, настраиваем маршрутизацию (да хоть «чесночную» — для стабильности и безопасности), пользователей подключаем прозрачно через проброс портов/NAT/псевдоинтерфейс/чёрта лысого, и дело в шляпе. Ну, для пущей безопасности, можно ежедневно менять ключи шифрования, годовой набор которых рассылать по объектам фельдъегерьской службой.\n\nНо хрен нам по губам и молотком по яйцам. Всё это слишком просто, а американские хакеры не дремлют! Поэтому сверху нам спустили свой VPN, с ~~блэкджеком~~ глюками и долбанутой адресацией. Разумеется, у узлов сети есть нормальные IP-адреса вида 10.0.0.0/8, но ведь удобнее пользоваться именами. Поднимем внутресетевой DNS и сделаем имена узлов вида `gw.dep1.main.msk.vpn` (или даже кириллицей: `шлюз.первый_отдел.главное_упр.москва.сеть`)?.. И снова хрен нам — это же длинно и неудобно! У нас узлы сети будут именоваться `Ш0$2`, `ХЗ$$`, или `JЫ$1` (ага, кириллица в перемешку с латиницей), а чтобы не запутаться, мы разошлём таблицу, — какому управлению какое имя соответствует.\n\n![pic0](img/post8-0.png)\n\nСпасибо, что хоть эту таблицу не надо изучать и запоминать, — этот «/etc/hosts» второго порядка обрабатывается, собственно, описанной выше системой обеспечения защищённой сети с гордым именем «Юпитер». Что ещё она делает?.. Например, предоставляет веб-интерфейс (показывать не буду, чтобы не вызвать рвотный рефлекс у тех, кто видел phpMyAdmin) к управлению некоторыми сервисами, вроде IIS на главной машине, или iptables на основном шлюзе (он на АльтЛинукс с ядром 2.4, или 2.6 в обновлённой версии — безопасность же), а так же почти обеспечивает пользователям прозрачную работу через всё тот же проброс портов.\n\n![pic1](img/post8-1.png)\n\nПочему почти? Да потому что, во-первых, для «прозрачной работы» у пользователя должна быть установлена клиентская часть «Юпитера», а во-вторых, при малейшем шорохе вся эта грёбаная дребедень падает, вопя в лог и засирая диск полсотней тысяч временных файлов; и её надо останавливать, подчищать за ней дерьмо, и запускать заново. Причём не только на серверной машине, но и на всех подключённых — они не смогут сами переподключиться при поднятии службы. Почистили, запустили, ввели логин/пароль, всё работает?.. Теперь ничего не трогать! Вообще ничего! И не разлогиниваться! Система работает только пока открыт сеанс под админом!\n\nБезопасность превыше всего!\n\n**P.S.:** Не знаю, зачем я раскатал эту простыню текста. Просто, после хрен знает какой за сегодня попытки заставить эту дрянь работать так, как мне надо, уж очень захотелось выговориться… и выпить. Ну а если кто-то из админов это прочтёт, то может запомнит название того, с чем ему точно не стоит связываться. =)"
		},
		{
			"post_id": 4,
			"title": "\"Большой брат\" грядёт?..",
			"date_published": 1540474534.744,
			"body": "Сёрфю тут себе клирнет в законный послеобеденный перерыв, и натыкаюсь на очередное «мы заботимся о вашей безопасности» от наших доблестных, извините за мат, депутатов: глава комитета Госдумы по вопросам семьи, женщин и детей выступила против сайтов и мобильных приложений для знакомств в интернете, а так же призвала блокировать их. Дескать, там аферистов много, и вообще подобные сервисы есть рассадник разврата и содомии. Мне-то на сайты знакомств глубоко пофиг, хотя в своё время сидел на одном, и даже нашёл там жену, с которой не так давно благополучно развёлся, но мне очень не пофиг на другое.\n\nА именно, на доставшие уже до последних нервов инициативы наших «законотворцев», чтоб их чайки засрали, заблокировать и запретить всё что можно, а что нельзя — обложить акцизами, налогами, и штрафами. Со всех «традиционных» (читай, одобренных партией) СМИ нам в уши льётся Соловьёвской песней какой Интернет плохой, как он развращает детей, доводит их до наркомании и суицида, да и взрослых не щадит — заражает компьютеры злыми вирусами, через мобильные приложения грабит банковские счета, а ещё там Навальный, а теперь вот и сайты знакомств с аферистами и развратниками. Ужас, что деется, граждане!\n\nНе удивлюсь, если пройдёт лишь пара-тройка лет, и Интернет-таки будет по талонам. Надежда остаётся лишь на децентрализованные сети.\n\nВыговорился!.. Пойду пить чай и перечитывать «1984» =)"
		},
		{
			"post_id": 3,
			"title": "О репостах",
			"date_published": 1537189952,
			"body": "Мне стало страшно в соцсетях каментить,\nот слов «репост» и «лайк» дрожат коленки,\nведь можно по́стом так накосовертить,\nчто увезут в тюремные застенки.\n\nЧто можно постить, чтоб не ошибиться?\nчто написать, чтоб не попасть в опалу,\nкогда кругом готовых оскорбиться\nвозвышенных натур буквально валом?\n\nЗапостишь девушку в прозрачном лёгком платье,\nс красивым взглядом, родинкой у носа,\nи тут же крики: «Он сексист, развратник», —\nи на тебя бегут строчить доносы.\n\nА вот картина — старая церквушка,\nвся заросла и купол покосился,\nа возле церкви дряхлая старушка,\nи пёс худой у двери приютился…\n\nИ снова крики: «Что ты этим постом,\nхотел сказать, отродье маргинала?\nТы против веры? Богохульник злостный?\nНе хочешь лет на пять присесть на нары?..»\n\nВот фото: оборона Сталинграда, —\nна заднем плане бой ведут фашисты.\nЗапостишь, и «гвардейцы» будут рады\nтебя отдать под суд как экстремиста.\n\nЗапостишь негра — оскорбление Уганды;\nребёнка — обвинят в педофилии;\nза радугу пришьют гей-пропаганду;\nсерп с молотом — призыв против России.\n\nНа каждый пост своя статья найдётся,\nи каждый лайк в составе преступленья.\nЧто делать, коль правительству неймётся\nдержать в контроле наше поведенье.\n\nСижу смурной, как ворон на погосте,\nпишу свой стих, буха́ю злого яду…\nНу, может быть, хоть котика запостить, —\nнадеюсь, за кота я не присяду.\n\n![hashcat](./img/hashcat.jpg)"
		},
		{
			"post_id": 2,
			"title": "Первый пост",
			"date_published": 1536830612.932,
			"body": "Трам-парам-парам, проверка!\n\nПишу просто так, чтобы посмотреть как тут что работает.\nКак я понял, здесь принято пользоваться **Markdown**-_разметкой_, что весьма удобно, Вообще, на первый взгляд тут всё довольно неплохо устроено, внешний аскетизм и интуитивно понятный интерфейс подкупают, по крайней мере по сравнению с тем же [blogger.com](http://blogger.com), в котором я пока даже не разобрался как встраивать `$ shell commands` непосредственно в текст,\n\n```c\n#include <stdio.h>\n\nint main (int argc, char **argv) // класс, тут ещё и подсветка есть\n{\n    printf (\"Или вставлять блоки кода, чтобы они не выглядели как кусок говна\\n\");\n    return 0\n}\n```\n\nХотя, может это проблема в моих кривых лапах. =)\n\nВ общем, первые впечатления довольно приятные. Даже не хочется уходить в «клирнет»."
		}
	]
}