{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565296763,
			"title": "WTF, this is not like Reddit at all!",
			"body": "How can i give people gold? Where is my karma? How can i hide in a safe space? How do i report people i disagree with? Change your homepage right now!",
			"added": 1565296762
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1565289153_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 1,
				"body": "looks like deleting users.json did it",
				"added": 1565296591
			}
		],
		"1565297074_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "I like KPOP\nEspecially TWICE, CLC and MOMOLAND",
				"added": 1565297173
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 3,
				"body": "> [tinktinktink](#comment_4_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): The difference is that on a normal board, the identification is my IP, and cycling those through proxies is fucking terrible, it breaks ReCaptcha, it breaks the board, and normally you have to pay unless you want to do it with shit proxy lists.\nCycling IDs, tho, is as easy as deleting a file.\nCycling proxies doesn't break ReCaptcha. In fact, ReCaptcha doesn't give a fuck about your IP, there are no checks based on that. You can let a captcha be solved in the Ukraine and use it's token on a proxy from france that you even activate later.\nIts a popular believe that getting past reCaptcha would take super much effort, but it really doesn't.\nThe one limiting thing that you have with ReCaptcha is that getting tokens takes 20 to 30s. And that basic hurdle of multithreading is already too much for some low-effort fun spamers. If you are interested, i did write a whole framework for tasks with recaptcha once and i was able to shut down 4chan /b/ for an hour and wipe out three other boards. You can easily do 10 threads per second with proxies and captchas. And those 15 bucks are affordable ;)\nI even have a userscript for the browser that just displays a single button and every click solves a captcha and it gets sent to the bot who runs a few hundred proxies with it.\n\nSpaming regular imageboards is so easy that multiple weebs did it and flooded multiple boards  just because they were bored. Some neet did it. Some other guy is able to scan the whole site for posts with specific content to automatically bot-spam the threads to death.\nThe reason why this never really happened to 4chan /pol/ is because their internet \"enemies\" are... not really the smartest people around....\nAnd some political campaign or glowniggers would rather surveilance the board or bot propaganda on it than flood it or shut it down..\n\nThe bot that you did run here is basically a macro, as i see it.\n\nbtw. you don't have to \"reverse engineer\" anything, the millchan code is available.",
				"added": 1565329230
			},
			{
				"comment_id": 4,
				"body": "You can always centralize a part of it. Just think about how something like confirmation of an online payment would work in zeronet.... it doesn't... the site for creating IDs can be centralized. Then it can do rate limiting or even captchas.\n\nBut that isn't really the option here (at least not right now).\nAgainst spam you can do basic manual filters. Allow users to filter posts by content, by regexp, by how new the ID is / how much it posted, length, etc.\nYou could even do Bayesian filters, like we do for mails for >20 years now.",
				"added": 1565330494
			},
			{
				"comment_id": 5,
				"body": "> [tinktinktink](#comment_8_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): Of course you can break captcha and use proxies... if you pay for it.Have you tried using free proxies for anything on 4chan? Captcha breaks because the proxy can't reach Google's servers, 4chan bans you instantly and it's slow as fuck.Like I said in 08chan, it's not just a macro because the script also does filesystem operations and controls multiple ZeroNet instances running, opening and closing in the background.And about the reverse engineering thing, that's why I put quotation marks in it, reverse engineering is not actual RE, it's just reading the code to see how it works, I was just too lazy to not do it so I used Selenium. If I had read it, though, I could just edit the user data and content JSON files and use ZeroNet to do a sitePublish on everything, it would be a lot faster and wouldn't need open Firefox instances.\n\nI think you don't know what i am talking about.\nI already told you about lots and lots of examples of when people made boards unusable just because they were board. And those people are neets, weebs and some My Little Pony obsessed guy. All those people can do that just fine and regularly with no problems whatsoever.\nAll those people REEEing about /pol/ somehow aren't able to do it, not even once for an hour.\n\n>Have you tried using free proxies\nYou need RESIDENTAL proxies, residental proxies can't be ASN banned without also range-banning a million legit users, it doesn't matter how shit their quality is, if they manage 200KB/s its still fine. In fact, shit residental proxies are always rotating once, which is actually what you want. Of course you will pay a few bucks for it, but are you telling me you can't afford those 10 bucks that some neets, weebs and obsesses schizos are perfectly able to afford? Why the fuck would you care if some 4chan mod manually bans you if your proxy is rotating the IPs anyway?\n\n>It's not ust a macro because the script also does filesystem operations and controls multiple ZeroNet instances running\nIt's still a macro, doesn't matter that you have a \"remove file\" and \"kill process\" command in it. You do all the major tasks basically by clicking on firefox, and that's the reason why it was slow.",
				"added": 1565366046
			},
			{
				"comment_id": 6,
				"body": "> [qf2ss4t5y3365](#comment_13_1Nvii56FXr3CYjLPscUya4UutDqnMKjK1B): Best practice would be to assume that you're always exposed anyway, is it not? A false sense of security is potentially more dangerous than none at all.\nTotally agree here.\nEspecially in the context of people wanting transparency, but somehow also privacy.\ni.e. the fact that everybody can just look into all transactions of every wallet with bitcoin got many people disappointed who thought that this would be super anonymous.\nThe situation here is not that much different. People were annoyed when they found out that you have to use IDs for posting and made a thread about how to change the IDs every single post, now theres macro spam.\nThinking that people aren't able to connect your posts and see that they are from the same person is a false sense of security, you see people getting exposed as samefags or getting called by some username they have somewhere else every day on the chans, because they are just so blantly obvious.",
				"added": 1565367361
			},
			{
				"comment_id": 8,
				"body": "> [tinktinktink](#comment_17_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): People don't seem to want to pay for it that often, though, else we would have spam every day on 4chan.\nI always assume that the only reason why 4chan isn't constantly spamed to death is because the people who would have interest in it are more interested in botting catchphrases or slide threads which is more effective than bluntly shouting out to everybody that this board is raided now and that they have to temporary meet somewhere else.\nKind of the same reason why feds mostly watch and rarely act. Just once they can't get any more informations out of it, they will bust it.\nAnd the people who wouldn't care about it and just want to raid it because >muh /pol/ bad, aren't exactly the smartest people around and rather waste their time in manual discord raid groups. They would totally pay those 10 bucks to shut /pol/ down for an hour and then pat each other on the back, or crowdfound to get it down for a long period. Some tranny on youtube who does nothing more than complain about incels gets 400k $ on patreon. Money is not the problem. They just don't really know how to do that or don't even try it because they have the misconsumption that a captcha would be a hurdle for a bot.\nMeanwhile some weeb or neet or pony obsessed guy are more dedicated and pay money for spaming cartoon ponies.\n>And the macro thing is just nomenclature autism\ntrue",
				"added": 1565369461
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 7,
				"body": ">819 IP addresses\nAnd it feels like the board has just 50 people posting max.\nGood job at catching the IPs of other fellow (((journalists))).\nAnd welcome to P2P, whats next? Copying the list of connected IPs when torrenting a movie and writing an article about it?",
				"added": 1565367984
			}
		]
	},
	"comment_vote": {}
}