{
	"title": "Dazeilad",
	"description": "Bienvenue sur mon blog ! Ici ça parle de l'effondrement et de ses solutions : permaculture, habitat passif et énergies (vraiment) renouvelables, low-tech, démocratie et intelligence collective, CNV, etc.",
	"links": "*   Source code\n*   Menu",
	"next_post_id": 3,
	"demo": false,
	"modified": 1551469519,
	"post": [
		{
			"post_id": 2,
			"title": "Proposition de democratie",
			"date_published": 1551567600,
			"body": "# 2 Pouvoir Législatif\n\n## <a data-cke-saved-name=\"__RefHeading___Toc474_2054602521\" name=\"__RefHeading___Toc474_2054602521\"></a>Démocratie directe et représentativité\n\nAbandonnons un moment notre époque pour remonter aux prémices grecques de la démocratie. Bien que celle-ci ne fût pas parfaite – notamment sur l’accès à la citoyenneté – elle fonctionnait avec des principes qu’il serait intéressant de reconsidérer aujourd’hui.\n\nLa démocratie directe : à l’époque, chaque citoyen s’exprimait directement pour toutes les décisions prises à l’agora, il n’y avait pas d’intermédiaire. Ainsi, chacun pouvait être satisfait de ce que son avis soit réellement pris en compte, même si le résultat du vote n’était pas en accord avec ses idées. C’est finalement le principe de base de la démocratie… Voyons voir aujourd’hui ce qu’il en est. A supposer que vous soyez allé voter (les records d’abstention sont un autre exemple de la fracture démocratique), votre député élu ne représentera réellement que 15 à 40 % de son électorat (scores du premier tour), il y a donc fort à parier qu’il ne vous représentera pas. Et même si c’était le cas, il est fort probable que certains de ses votes à l’Assemblée ne soient pas de votre goût. Quand bien même votre député voterait ! En moyenne, nos députés ne s’expriment que sur un quart des scrutins… Au final, cette « représentativité » est à la fois peu convaincante sur le fait qu’elle arrive à représenter justement les idées du peuple, et source de tension. Car en plaçant un intermédiaire entre le citoyen et le vote, on déresponsabilise le citoyen. Cela produit des effets pervers, car il peut alors se désintéresser de la politique, et émettre des opinions qui vont être plus que de raison guidées par ses émotions et par le peu de formules chocs captées par les médias. En négligeant ainsi la réflexion profonde sur un sujet, le citoyen émotif et désintéressé devient un argument pour le maintien du système-même qui l’a engendré !\n\n« Regardez ces gens incapables d’être raisonnable… Vous ne voulez quand même pas leur donner le pouvoir de voter les lois ?\n\n*   Mais vous-même vous acceptez qu’ils votent pour élire ? Où se trouve la légitimité des députés alors, s’ils ont été élus par des incapables ?»\n\nDéresponsabiliser, c’est infantiliser, c’est favoriser la conservation du pouvoir par des « parents » de la nation (les élites politiques), c’est rendre le peuple capricieux, attentiste, geignard. En le privant de pouvoir et en refusant de l’écouter, on accule le citoyen à son dernier moyen d’expression : la manifestation, parfois violente selon les convictions. C’est ce qui explique en partie l’apparition de la Manif Pour Tous et de Nuit Debout, à mon sens : ce manque de pouvoir et cette impression de ne pas être écouté.\n\n## <a data-cke-saved-name=\"__RefHeading___Toc476_2054602521\" name=\"__RefHeading___Toc476_2054602521\"></a>Casser les codes\n\nOn pourrait aujourd’hui objecter deux choses à la démocratie directe : le trop grand nombre de citoyens, et le trop grand nombre des décisions à prendre, ainsi que la complexité de certaines. Ceci rend en pratique impossible la mise en place d’une démocratie directe. Voici donc un système mixte que je propose.\n\nChaque citoyen serait représenté _à défaut_ par un député, mais pourrait lui retirer son mandat ponctuellement à chaque scrutin de l’Assemblée. Ainsi, la démocratie directe peut être appliquée à chaque fois que le citoyen souhaite exprimer son choix, mais s’il ne trouve pas le temps de s’intéresser à la loi en vote ou qu’il reconnaît ne pas saisir l’ensemble des intérêts en jeu, il peut laisser une personne en qui il a confiance voter à sa place. Cela implique quelques changements d’organisation : tout d’abord, un député ne pèse plus une seule voix, mais N voix, correspondant aux N personnes qu’il représente dont lui-même. Si k citoyens décident d’exprimer eux-mêmes leur choix, le député ne pèsera plus que N-k voix dans l’ensemble du scrutin. Il faudra veiller à l’égalité du nombre de mandats délégués aux députés, à savoir que chaque député représente chacun N citoyens, avec une éventuelle marge de manœuvre de quelques pourcents en fonction du mode d’élection du député. Nous y reviendrons plus tard.\n\nEn mettant donc en place un système de démocratie directe avec délégation par défaut, on règle ainsi le problème d’un nombre trop important de scrutins qui ne permettrait pas au citoyen de faire un choix éclairé. Dans ce cas de traitement des affaires courantes ou trop spécialisées, la représentativité peut prendre du sens, à supposer que l’on règle le problème de la représentativité réelle qui n’est pas atteinte aujourd’hui. L’avantage est que ce système peut totalement se superposer au système législatif actuel, et que la transition vers plus de démocratie directe se fait en douceur.\n\n## <a data-cke-saved-name=\"__RefHeading___Toc478_2054602521\" name=\"__RefHeading___Toc478_2054602521\"></a>Intelligence collective et éducation à la politique\n\n_« Qui sait presque tout, mais sur presque rien, qui sait presque rien, mais sur presque tout ! » - Hugues Aufray, La Gigue des Presque-Rien_\n\nOn pourrait craindre que la plupart des gens, dans le cas de votes passionnels comme le mariage pour tous ou la loi travail, votent n’importe quoi, par idéologie et sans s’intéresser aux détails de la loi. La démocratie est ainsi faite, certaines lois votées par le passé (je pense à l’autorisation de l’IVG, l’abolition de la peine de mort) étaient en avance sur leur temps, et il faut du temps et un débat au sein de la population – et pas seulement dans les médias – pour que les nouvelles idées soient acceptées. C’est là aussi où interviennent les députés, les partis politiques et les médias. Leur rôle est d’assister les citoyens dans leurs choix. De cerner les points importants, d’expliquer les rouages, de vulgariser le droit. Or c’est là quelque chose qu’ils ont tous failli à faire depuis toujours, alors que c’est à mon sens un de leur rôle principal. Ils doivent apprendre à faire plus de pédagogie, à décortiquer les textes de loi comme un professeur de français décortique un poème pour l’expliquer à ses élèves. Il faut élever l’idéal démocratique en élevant l’instruction des citoyens. En leur donnant la possibilité de s’intéresser aux problèmes de géopolitique, d’énergie, de droit, de santé, de sécurité, d’économie… Ce ne sera pas simple tout le temps, certaines personnes manqueront sûrement des bases nécessaires à une réelle compréhension de certains sujets. Mais je crois que c’est aller dans le bon sens que de tenter de leur expliquer les lois – avec des arguments contradictoires bien entendu, mais sans passion – plutôt que de les abandonner à leur ignorance en leur retirant sous ce prétexte leur droit démocratique le plus fondamental. J’ose espérer que dans quelques générations, tout le monde aura baigné depuis son enfance dans assez de savoir partagé pour que la question du vote éclairé ne se pose plus. Car c’est un argument que j’ai entendu trop souvent et qui me répugne : les citoyens les moins éduqués ne voteraient pas « bien ». Cet argument émane le plus souvent d’une élite dont je pense qu’elle n’arrive même pas à se rendre compte à quel point il est aussi valable pour elle... et sous-entend que certains seraient bon à prendre des décisions et d’autres non. Dans le cas d’une monarchie ou d’une dictature cet argument serait logique, mais ce n’est en aucun cas valable dans une démocratie où tout citoyen est l’égal de l’autre. Les femmes ont gagné le droit de vote en France il y a moins d’un siècle permettant ainsi un droit de vote réellement universel (à l’exception des enfants), et déjà on retomberait dans une tendance à retirer sa légitimité de vote à une frange de la population. Je dis à ceux qui adhèrent à cette thèse, que s’il y a un problème avec la capacité de réflexion de certains citoyens, ce n’est pas en leur enlevant le droit de vote qu’on le règle, mais bien en leur apprenant à réfléchir et en remettant soi-même en question ses convictions ! Car ce n’est qu’en entrant en empathie avec l’autre, en percevant réellement ses besoins et à la fois les nôtres, que l’on peut espérer réaliser le pas de côté et trouver la solution qui contentera tout le monde.\n\n## <a data-cke-saved-name=\"__RefHeading___Toc480_2054602521\" name=\"__RefHeading___Toc480_2054602521\"></a>Démocratie numérique\n\nComment régler maintenant la première objection concernant le trop grand nombre de citoyens ? Évidemment il est impensable de se faire se déplacer toutes les semaines la population française dans des bureaux de vote, quoique cela pourrait devenir un nouveau service public permanent en mairie. Mais nous vivons à une époque où le traitement de masses de données énormes est devenu simple comme bonjour grâce au numérique. Créer une application de vote, ou bien un boîtier personnel de vote électronique ne devrait pas poser de problèmes, même si l’État a pour réputation de créer plus de problèmes que de solutions. Comme dans tout vote électronique, la question de la sécurité du scrutin se pose. N’étant pas spécialiste du sujet, je le laisse ouvert au débat. Néanmoins, j’exposerai ici quelques arguments qui me font croire à la non-existence pratique du problème. Tout d’abord, les échanges bancaires relèvent selon moi du même degré de sécurité qu’un vote. Or aujourd’hui, les banques maîtrisent tout à fait la sécurité de leurs transactions, et il n’y a aucune raison pour que nous ne puissions pas mettre en place une sécurité aussi robuste. Ensuite, la technologie récente de la blockchain utilisée notamment dans l’économie du BitCoin et par de plus en plus de services en ligne, est réputée inviolable structurellement. Il existe donc des solutions aux problèmes de transmissions de données. Finalement, il me semble aussi que pirater des millions de boîtiers de vote personnels, utilisés de façon régulière, sera une tâche beaucoup plus difficile que de pirater quelques milliers de machines de vote à disposition du public dans les bureaux de vote, comme il a pu être envisagé par le passé. Des technologies d’identification biométrique se répandent, aujourd’hui de nombreux smartphones et ordinateurs professionnels disposent d’un lecteur d’empreinte digitale. Quitte à se faire ficher, autant que cela serve aussi les citoyens et pas seulement les services de surveillance. Là aussi, les problèmes d’authentification de l’identité ont déjà leurs solutions. Je me permettrai de rajouter une doléance personnelle : le système devra être conçu de la façon la plus simple possible, limité à ses fonctions primaires de vote, et en open-source : se débarrasser du superflu est la seule façon de garantir une sécurité maximale. Enfin, pour terminer sur la sécurité, il faudra que la reprise de mandat au député soit conditionnée à la certitude du bon déroulement du vote du citoyen. Tout doute de piratage devra profiter à l’expression du vote par défaut du député. Le député agit ainsi comme le dernier maillon de sécurité, celui-ci réputé inviolable… excepté en cas de corruption. Tiens, parlons-en de la corruption !\n\n## <a data-cke-saved-name=\"__RefHeading___Toc482_2054602521\" name=\"__RefHeading___Toc482_2054602521\"></a>Lobbying et corruption\n\nL’Assemblée représentative est un modèle où il suffit à des groupes de lobbying de ne convaincre/persuader qu’une poignée de personnes afin d’obtenir satisfaction. Je ne parle même pas de l’ensemble des députés et sénateurs, mais seulement de quelques-uns, ceux qui hésitent et ne sont pas clairement positionnés, mais qui permettent d’arracher la majorité absolue. Bien sûr cela n’est valable que sur les points chauds, ceux où les lois sont acceptées sur peu de voix. Mais ce sont justement ces sujets qui sont les plus intéressants car ils témoignent du passage d’une époque à une autre. Ce sont ceux-là aussi qui sont les plus concernés par la démocratie directe, car leur médiatisation les rend propice à être votés directement par les citoyens. Or, on voit qu’avec la représentativité, la balance penchera très souvent en faveur de ceux qui ont l’argent, du capital, et qui peuvent payer des campagnes de lobbying. Quand ce n’est pas carrément de la corruption ou du chantage. Il est si facile de mettre un individu sous pression lorsqu’on veut en obtenir quelque chose… Alors que faire chanter un peuple, c’est une autre histoire !\n\n## <a data-cke-saved-name=\"__RefHeading___Toc484_2054602521\" name=\"__RefHeading___Toc484_2054602521\"></a>Représentativité déterritorialisée\n\nUne contradiction majeure m’est apparue dans le rôle du député tel qu’imaginé de nos jours : un député est un représentant de la Nation, de la France entière, mais il est élu dans une circonscription – une partie du territoire. Comment peut-il alors voter pour l’intérêt général de tous les Français si l’approbation de son vote n’aura lieu que dans une partie de la population ? Encore pire, comment peut-il concilier honnêtement les intérêts de ses électeurs, dont le panel s’étale de l’extrême-droite à l’extrême-gauche ? Comment peut-on dire qu’un député élu avec 55 % (des voix _exprimées_...) est le représentant de 100 % (de la population) de sa circonscription ? De plus, il paraîtrait que ce système de circonscription permettrait la création d’un lien fort entre le député et ses électeurs… Je ne ferai pas de spéculation sur la réalité de ce lien, mais je constate qu’il a bon dos parmi les politiciens, alors que personnellement je n’ai jamais rencontré ma députée… Quand bien même je prendrai rendez-vous avec elle, au sujet d’une loi, serais-je en train d’exercer mon pouvoir de citoyen ? Non, bien sûr : il est d’une part physiquement impossible que ma députée rencontre tous ses électeurs pour chaque loi, ce qui affaiblit énormément l’utilité de ce lien que revendiquent les cadors de l’Assemblée. D’autre part, il n’est absolument pas acquis qu’elle votera suivant ma volonté – c’est un peu le principe de la représentativité…\n\nIl est amusant pour un scientifique comme moi de relier ce terme de « représentatif » au domaine des statistiques. Un échantillon « représentatif » est quelque chose d’assez contraint, en termes de taille, de présence de sous-groupes, etc. Les résultats issus de cet échantillon possèdent aussi un intervalle de confiance, ce qui fait que si cet échantillon votait pour une loi à 50,1 %, on ne pourrait pas forcément dire que la loi correspond à la volonté d’une majorité de français. Pourquoi l’Assemblée Nationale n’est-elle pas représentative des français ? D’abord pour une question de taille : là où on demande à un bête sondage d’avoir au moins 1000 éléments dans leur échantillon (auxquels s’ajoutent des corrections de biais), le nombre de députés a oscillé entre 500 et 600 depuis la Révolution. Alors même qu’entre 1789 et aujourd’hui, la population française a grosso modo doublé, le nombre de députés n’a pas suivi cette tendance. Je passe évidemment l’absence des femmes sur les rangs de l’assemblée (en voie de correction visiblement) et la non-représentativité des ouvriers (12 % parmi les électeurs ; 0,3 % parmi les députés 2017). Donc même si le terme de représentativité ne voulait pas, au début, désigner la représentativité scientifique mais plutôt l’idée d’une délégation de son vote, elle a fini par vouloir assurer la légitimité de l’Assemblée. Or il est très facile, et même intuitif de se rendre compte à quel point nos « représentants » ne sont pas « représentatifs », ni de leurs électeurs, ni de leurs territoires, ni de la France.\n\nUn député se veut également ancré dans un territoire, comme l’aiment si bien dire nos représentants ruraux de droite qui sentent bon le terroir, la charcuterie et le pinard (mais aussi le béton, le métro et le goudron car peu vivent réellement à la campagne). Franchement quand on observe le fonctionnement de l’Assemblée, un député se définit beaucoup plus par sa position sur l’échiquier politique que sur la carte de France…\n\n## <a data-cke-saved-name=\"__RefHeading___Toc486_2054602521\" name=\"__RefHeading___Toc486_2054602521\"></a>Désignation de nos représentants\n\nLe scrutin deviendra national. Cela signifie que les citoyens auront beaucoup plus de choix parmi les candidats, ce qui leur permettra d’affiner à qui accorder leur confiance plus aisément qu’avec la dizaine de candidats actuellement présents sur chaque circonscription. Cela peut avoir des inconvénients (trop de choix tue le choix) mais j’espère que les médias et les institutions sauront mettre en place des outils efficaces pour diffuser et comparer les programmes de chaque candidat. Chaque personne pourra alors rapidement identifier la poignée de candidats les plus proches de ses convictions et étudier plus finement les différences de leurs programmes. Car oui, les programmes devront être individuels ! Plus de logique de parti (même si des similitudes vont apparaître naturellement), chaque candidat se présente individuellement et peut présenter le programme qu’il souhaite. Finies les logiques de partis où il faut mentir pour soutenir le chef quand il a fait une boulette. L’affaire des enregistrements de Laurent Wauquiez en février 2018 illustre parfaitement ces propos. Invité dans une école de commerce pour faire cours à des étudiants, il fait certaines déclarations qu’il admet ne pas être le baratin qu’il sort d’habitude dans les médias. Toute personne attachée à sa liberté individuelle de pensée devrait refuser de venir faire le guignol sur les plateaux télé pour défendre un chef qui n’est manifestement digne d’aucune confiance. J’espère que cela donnera un échiquier politique plus nuancé, sans mâles alpha, où l’honnêteté intellectuelle ne sera plus assujettie à la conquête du pouvoir.\n\nAvec la fin de l’attachement géographique, le député est enfin libre d’assumer pleinement un attachement politique. Plus de calculs pour essayer de se rapprocher des convictions des gens du coin. Je propose que les députés, pour être élus, doivent rassembler un « panier de mandats » qui constituera l’ensemble des citoyens qui lui confieront leur vote par défaut. Un seuil de mandats sera défini au-delà duquel le député sera déclaré comme élu. Avec le nombre de députés actuel, cela représenterait environ 100 000 mandats à recueillir. Une fois ce seuil atteint, le député est élu et son poids législatif (le nombre de mandats dont il dispose au Parlement) sera égal au nombre de citoyens ayant voté pour lui. Bien sûr, pour éviter les abus, il y aura aussi un plafond (110 % du seuil ? Cela reste un détail à discuter).\n\nEt que deviendront les mandats récoltés en trop par un député ? Ou bien ceux attribués à un député qui n’a pas pu être élu ? Comment déterminer, dans le cas d’un surplus de mandats, lesquels sont attribués au député et lesquels seront déboutés ?\n\nIl est ici question de temporalité. Je serais d’avis que les premiers mandats exprimés soient les premiers retenus. Ainsi, les électeurs tardifs à voter risqueraient de ne pas pouvoir se faire représenter par leur premier choix. Peu-être cela incitera-t-il les électeurs à se déplacer aux bureaux de vote ? Sur la méthode à utiliser, ce serait parfait de pouvoir le faire numériquement. Si la vieille méthode des urnes reste de mise, on pourrait peut-être mettre en place plusieurs urnes, une par heure par exemple, pour ainsi déterminer qui aura voté avant qui. Pour les mandats qui seront remis en jeu à cause du dépassement du plafond ou de la non-atteinte du seuil, un second voire un troisième tour sera organisé jusqu’à ce que toutes les voix exprimées aient trouvées satisfaction.\n\nOn pourrait également imaginer un système de classement ou de notes comme pour le scrutin à jugement majoritaire. L’attribution des mandats aux députés serait réalisé suivant l’adéquation exprimée par les électeurs. Une fois qu’un député a atteint son plafond de mandats, les électeurs qui ne l’avaient pas noté aussi haut que les précédents, ou bien qui hésitaient fortement entre lui et un autre, se verront attribuer leur 2<sup>e</sup> choix, et ainsi de suite. Un seul tour pourrait alors être nécessaire.\n\nPour ce qui est de l’abstention, c’est plutôt simple : les députés ne représentant que les personnes leur ayant donné mandat, si l’abstention est élevée il est possible que tous les sièges ne soient pas pourvus. Charge alors aux abstentionnistes d’assumer eux-mêmes le vote de chacune des lois, ou bien de faire abstention également pour les scrutins législatifs. C’est en cela que l’idée de démocratie directe est aussi puissante : l’abstention à un moment M, à une élection E, ne délégitime pas du tout le reste de la vie politique puisque le pouvoir reste à tout moment dans les mains des citoyens. On ne pourra plus dire qu’un Président n’a pas été élu sans la majorité (enfin si, mais cela n’aura pas plus de conséquence sur la légitimité du processus législatif).\n\n## Et le Sénat ?\n\nLe système législatif français est bicaméral. Je n’ai jamais trouvé de justification qui me convienne à cela. On peut supposer qu’après la Révolution, la bourgeoisie craignant de donner un trop grand pouvoir au peuple, se soit octroyée une contre-chambre réservée à l’aristocratie ou à une technocratie étatique. En effet, le support des grands électeurs se fait essentiellement grâce au réseau que l’on se crée dans les rouages du pouvoir local, le Sénat ne peut donc pas être considéré comme participant directement au pouvoir du peuple.\n\nCette idée de contre-chambre est néanmoins intéressante, mais je la regarde d’un autre point de vue. Comme je l’ai expliqué précédemment, la notion de représentativité peut revêtir 2 sens principaux : celui d’un mandat qu’on donne à une personne de confiance, et celui d’un échantillon de la population qui en reproduit les tendances politiques. Dans ma proposition d’Assemblée Nationale, je n’utilise que le premier sens de la représentativité, en le modifiant pour y introduire de la démocratie directe et pour faire en sorte que le député représente tous ses électeurs, et non la majorité des votants non-nuls.\n\nC’est une solution qui marche, qui a ses avantages et ses inconvénients, mais qui favorise tout de même les aristocraties politiques et la cristallisation, le non-renouvellement et la non-mixité de celles-ci. A l’inverse, et comme le décrit très bien Etienne Chouard dans ses travaux, le tirage au sort est le mode de scrutin démocratique par excellence. Dans la pratique, je pense qu’il peut souffrir d’un manque d’efficacité – mais je n’en suis pas certain. Afin de pouvoir expérimenter ce mode de gouvernance sans risquer de paralyser l’État, afin d’habituer et de faire accepter à la population ce nouveau scrutin, afin d’effectuer une transition douce et de ne pas créer de tensions inutiles, je propose de faire cohabiter le tirage au sort et la démocratie directe avec délégation par défaut. Vous voyez où je veux en venir : l’Assemblée Nationale utiliserait le système de démocratie directe, et le Sénat utiliserait le tirage au sort. Les lois suivraient le même système actuel de navettes entre l’AN et le Sénat.\n\nLe Sénat serait également à mes yeux une sorte de porte d’entrée égalitaire au monde politique. Des gens qui n’auraient peut-être jamais pensé faire de la politique pourraient apprendre les codes, les usages, et se plaire dans leur rôle de sénateur, puis vouloir poursuivre en se présentant à la députation. Je pense que cela serait très positif au renouvellement des femmes et hommes politiques et donc à la bonne santé de notre démocratie.\n\n## <a data-cke-saved-name=\"__RefHeading___Toc488_2054602521\" name=\"__RefHeading___Toc488_2054602521\"></a>Vote des lois\n\nLe scrutin législatif sera un moment régulier de la vie citoyenne. Il pourra se faire via différents médias : un boîtier électronique dédié et sécurisé, un site internet ou une application smartphone, des bornes en mairie… Les sujets des scrutins seront annoncés à l’avance et le vote sera ouvert sur une longue période (un jour, une semaine ?) une fois le texte définitif de loi proposé. Celui-ci sera rédigé par les députés et sénateurs au cours du travail quotidien du Parlement. La proposition des amendements et leur acceptation/rejet se fera par les parlementaires. Charge à eux de se rapprocher de leurs mandataires pour recueillir leurs opinions et synthétiser le tout en un amendement correspondant à leurs attentes. Il sera plus facile d’obtenir quelque chose de cohérent, puisque les mandataires seront d’une idéologie proche.\n\nOn peut envisager la modification de la navette actuelle entre le Sénat et l’Assemblée en ces termes : l’Assemblée commencerait la rédaction et l’amendement de la proposition de loi, puis le Sénat y apporterait également ses modifications, et enfin la loi serait votée à l’Assemblée par les citoyens ou leurs représentants. Ainsi les Parlementaires élus qui, gageons-le, auront plus d’expérience de l’écriture des lois que les tirés au sort, dégrossiront le travail d’écriture. Puis ce sera aux « représentants statistiques » d’y apporter un regard afin de contrôler le travail des premiers vis-à-vis des intérêts du peuple. Après ce rééquilibrage par l’échantillon représentatif du peuple, ce sera enfin au peuple entier d’approuver ou non la proposition de loi.\n\nLes votes seront tenus secrets jusqu’à la fin du scrutin. Tous les votes exprimés directement par les électeurs seront déduits du poids législatif du député. Son vote ne comptera qu’à défaut, pour ceux de ses mandataires qui se seraient abstenus.\n\n# <a data-cke-saved-name=\"__RefHeading___Toc492_2054602521\" name=\"__RefHeading___Toc492_2054602521\"></a>3 Pouvoir Exécutif\n\n## <a data-cke-saved-name=\"__RefHeading___Toc494_2054602521\" name=\"__RefHeading___Toc494_2054602521\"></a>(Re)définition\n\nJ’ai longtemps eu du mal à comprendre le rôle de l’exécutif. Mon incompréhension venait de ce qu’aujourd’hui l’exécutif s’arroge deux rôles : il gouverne, c’est à dire fait appliquer les lois et organise le service public. Mais c’est également le premier législateur ! Montesquieu s’en retournerait dans sa tombe… En effet aujourd’hui c’est au Président qu’il incombe de présenter un programme de réformes législatives lors des campagnes électorales. Étonnant, ce n’est pas au Parlement pourtant de décider des lois ? Lorsqu’un scandale éclate, que des statistiques relèvent la mauvaise situation du pays, à qui demande-t-on des réformes ? A l’Assemblée ? Non bien sûr, au Président ou au ministre concerné… On pourrait à la limite concéder que l’exécutif fixe l’agenda du Parlement en lui demandant de travailler sur tel ou tel sujet, de proposer une réforme de ceci pour telle date – et encore cela me paraît déjà être un trop grand pouvoir d’ingérence sur le Parlement. Seulement on en est loin puisque le gouvernement propose des textes de lois complets – discutés et amendés par le Parlement certes, mais sur une base déjà complètement orientée.\n\n_Mais on voit bien que ce système ne tient pas par des règles constitutionnelles mais par un soi-disant rapport de forces : alors que les ordonnances et les procédures accélérées sont utilisées allègrement par le gouvernement Macron, ce qui empêche le parlement d’agir sereinement, comment peut-on encore parler de séparation des pouvoirs ?_\n\nAlors je sens bien que je risque de lancer une énooorme polémique, tant les françaises et français sont addicts au spectacle des campagnes présidentielles, mais ce que je propose n’est ni plus ni moins que la disparition de ces élections. Et… si on remettait même en question l’existence d’un chef au sommet du pouvoir (Président, Premier Ministre, Chancelier, PDG… appelez-le comme vous voulez) ?\n\nJe verrais plutôt à la place un Collège de Ministres, élus par le peuple (ici il est justifié d’avoir recours à l’élection, aristocratique par nature, car on cherche la personne la plus compétente dans son domaine). La liste des Ministères serait votée par le Parlement, puis des élections seraient organisées pour élire les Ministres tous en même temps. Ce collège de Ministres devra apprendre à beaucoup se parler et se comprendre afin de définir une politique nationale cohérente. Je propose également qu’un métier de facilitateur gouvernemental soit créé : leur travail consisterait à présider les réunions du Collège des Ministres afin de faire avancer le travail gouvernemental et de détricoter les éventuels obstacles idéologiques qui pourraient se poser. Ce seraient finalement des équivalents du Premier Ministre, mais sans aucun pouvoir. Les réunions _pourraient_ être diffusées (sauf celles de secret-défense) afin d’assurer une transparence absolue du pouvoir.\n\nEn cas de mécontentement concernant un Ministre, il sera plus simple de le révoquer sans jeter le bébé avec l’eau du bain et bouleverser le Gouvernement, puisque les autres Ministres resteraient en place. A l’inverse d’un Président, dont on ne peut pas seulement révoquer les idées économiques ou militaires ou écologiques, etc."
		}
	]
}