{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "port 15441 closed",
			"body": "olá todos. é necessário ter a porta 15441 liberada para publicar um blog/etc? ou é apenas uma questão de desempenho mesmo? grato!",
			"added": 1473108643
		}
	],
	"topic_vote": {
		"1_17KficaSZiT1Jy788gN8MhPnN9XsWTeEmJ": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_17KficaSZiT1Jy788gN8MhPnN9XsWTeEmJ": [
			{
				"comment_id": 1,
				"body": "pergunto porque recebo a seguinte mensagem no blog que criei: \"Your network connection is restricted. Please, open 15441 port on your router to make your site accessible for everyone.\" não soube configurar essa opção aqui..",
				"added": 1473109269
			},
			{
				"comment_id": 2,
				"body": "> [sirenyc](#comment_104_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Tenta atualizar a versão do ZeroNet!\n\njá estou com a versão mais recente.",
				"added": 1473125441
			},
			{
				"comment_id": 5,
				"body": "com a porta 15441 fechada, não é possível publicar um blog/site na rede. depois que consegui abrir e liberar no firewall, funcionou.",
				"added": 1473194692
			},
			{
				"comment_id": 7,
				"body": "> [wallisonalves](#comment_2_1NZiBnhPbP51MNarN4pCdLAfYFLMyZuh1w): Eu tambem estou com o mesmo problema mas no meu caso parece ser o provedor de internet!\n\né bem provável que seja uma configuração do router. procure o tutorial do seu modelo aqui (https://portforward.com/router.htm ) e faça o teste http://canyouseeme.org/ -- não esqueça de reiniciar o zeronet.",
				"added": 1473738003
			}
		],
		"1_1MWCFyZgpzgeCGYdiFq3nMEbXZXYyaGX7B": [
			{
				"comment_id": 3,
				"body": "aqui tem um breve tutorial em portugues http://127.0.0.1:43110/16kjT7s5mUM83uJ6cUKmkEAswJye1tEd3C/",
				"added": 1473174774
			}
		],
		"1_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": [
			{
				"comment_id": 4,
				"body": "reforma política, fim do financiamento de campanha, eleições diretas.",
				"added": 1473174884
			}
		],
		"1_14ujRmVPqJwVqjjtWAjJweNoYm3dkzBMFL": [
			{
				"comment_id": 6,
				"body": "procure saber se a porta 15441 está realmente aberta: http://canyouseeme.org/ -- se não, talvez não esteja configurada corretamente no router (há alguns tutoriais aqui https://portforward.com/router.htm ) ou no firewall; se a porta está de fato aberta, tente reiniciar o zeronet. pelo que entendi, via tor essa porta deve estar aberta sem configurações adicionais.",
				"added": 1473737851
			}
		]
	},
	"comment_vote": {
		"106_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1
	}
}