{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"3_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 1,
				"body": "The biggest challenge with any type of automated governance is convincing governments to adapt it. Too many people think that Hollywood's take on the subject (2001, the Terminator series, Ex Machina) is plausible. Even people who know better seem to have a deep-seated fear that seems associated with putting a non-human entity in a position of power.\n\nDespite that, a computer assisted government *has* been attempted. It was in Chile during the 70s. [Here](http://www.damninteresting.com/nineteen-seventy-three/) is an excellent article/podcast episode about the rise and fall of Project Cybersyn.",
				"added": 1455225021
			},
			{
				"comment_id": 4,
				"body": "> [nippletwister](#comment_9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Governance is not automated there rather than improved. Humans are still in power, but blockchain watch them to strict their claims and pledges. You may read this new article also: https://medium.com/@EricRSammons/rise-of-the-machines-blockchain-based-governance-91d05a332cdb#.71r2xewyp\n\nI understand that humans are still in control--the problem is convincing congress to adopt technology. They are so out of touch that they still use fax machines from the 1980s--a fact that was taken advantage of in [recent protests](http://www.theguardian.com/technology/2015/jul/27/congress-fax-machines-cybersecurity-cisa-protest).\n\nDealing with the human factors is always the hardest part.",
				"added": 1455341765
			}
		],
		"4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 2,
				"body": "Get lotsa music. Get music player. Get spacesuit. Travel to the moon using a spacesuit, thousands of balloons, and a fire extinguisher for navigation. Become King Of The Moon.",
				"added": 1455330439
			}
		],
		"2_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 3,
				"body": "In a typical encrypted conversation, only the participants have the keys to decipher messages. This means that if the key is stolen, the worst that can happen is both parties having their current conversation made readable--and their past conversations, if they aren't using a system with forward secrecy.\n\nIn a system with Backdoors (or 'golden keys'), a second usable key is stored in a government database. If _this_ key is stolen, the conversations of thousands upon millions of people are made viewable to **everyone**. They will remain this way until a patch with the new key is distributed--which will last until the next time the key is leaked.\n\nEven worse: if using this system is mandatory for any company or government entity, they are vulnerable. Meanwhile, the rest of us (ordinary citizens and terrorists alike) will be using cryptographic systems from overseas, which US laws don't apply to. Simply put: key escrow systems have nearly the opposite effect they intend to.\n\nFor more information, [Here](https://en.wikipedia.org/wiki/Clipper_chip) is the tale of the clipper chip, a backdoor gone wrong, and [Here](https://www.eff.org/deeplinks/2015/08/deep-dive-crypto-exceptional-access-mandates-effective-or-constitutional-pick-one) is an EFF article on the topic.\nAlso: A team at MIT did [an assessment](http://academiccommons.columbia.edu/catalog/ac%3A127127) of the possible risks of key escrow systems. 20 years later, they did [a followup study](http://dspace.mit.edu/bitstream/handle/1721.1/97690/MIT-CSAIL-TR-2015-026.pdf) that found the risks of such a system to be even worse today.",
				"added": 1455333332
			}
		],
		"5_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr": [
			{
				"comment_id": 5,
				"body": "Chromium is nice (it's the open source version of chrome), but [Vivaldi](https://www.vivaldi.com/) looks like a promising new project.",
				"added": 1455494033
			},
			{
				"comment_id": 6,
				"body": "If you're running windows, consider giving [Waterfox](https://www.waterfoxproject.org/) a try. It's like Firefox, but built for 64-bit systems (and so pretty fast).",
				"added": 1457147530
			}
		],
		"1_18eNH913qX7e9vBExuMiv7qAMSRkJYNa21": [
			{
				"comment_id": 7,
				"body": "*What*, specifically?",
				"added": 1457252509
			}
		],
		"1_1MW2VNNw6afkT5ZvhK1b3RhUoB93u44cPE": [
			{
				"comment_id": 8,
				"body": "Yes, this might be the case. If the world is a simulation, we can expect the platform it's 'running' on to have less-than -infinite processing power. To save power, the simulation might 'suspend' areas of space that are not being occupied/ observed at the moment. This theory could be tested by building a telescope that rapidly swivels/ rotates to observe various locations in deep space, determined by a secure random number generator (radioactive decay would be a great source of randomness). If an area is observed to fluctuate or behave in an erratic manner, that would make the simulated universe theory slightly more plausible.",
				"added": 1457729228
			},
			{
				"comment_id": 9,
				"body": "If we one day find this theory to be true, we'll probably try to ascend/travel to the higher reality (exploration is awesome, no?). The problem is that we'll have to ask ourselves the big question: is **this** the highest level?\n...And then we find that it isn't, travel to the next one, repeat ad infinitum. Since each universe must be more advanced than the one it simulates, we will have an increasingly harder time comprehending our surroundings. In addition, detecting cosmic aberrations will become more challenging--along with determining ways to travel upwards.\nI hope that answers _something_ for you--or raises even more interesting questions.",
				"added": 1457749399
			},
			{
				"comment_id": 10,
				"body": "> [theone](#comment_3_1MW2VNNw6afkT5ZvhK1b3RhUoB93u44cPE): I mean is there any chance that we reach the exit and see the root universe ?\n\nI doubt there is a way to verify if the universe you're in is the original, or truly is 'real'. The observer (or simulator, gamer, whatever you want to call to entity running everything) may simply be hiding too well to be found.\n\nUnfortunately, that makes this mystery even _more_ difficult to solve. It's certainly frustrating, but don't loose sleep over it.",
				"added": 1457928868
			}
		]
	},
	"comment_vote": {
		"9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1
	}
}