{
	"posts": [
		{
			"id": "3dff4219-b398-4998-a138-1389cd3e2de8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f9af075f-7555-4274-91e6-282390f63244",
			"body": "based board owner loves us",
			"time": 1565333365207,
			"files": "[]"
		},
		{
			"id": "fbbd19c0-48ba-46cc-83f6-ab2fdc280383",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6ba26aba-01e0-4749-8106-60df7f2e3b0b",
			"body": "They killed the motherfucker are you serious rn\n\nhttps://www.reddit.com/r/news/comments/cohqmr/jeffrey_epstein_accused_sex_trafficker_dies_by/",
			"time": 1565452912862,
			"files": "[]"
		},
		{
			"id": "a6b1df66-be2f-481b-9c89-886ea12494ae",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Up your security game niggas",
			"body": "/i/ is back\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV:i:0\n\nI haven't added any content yet, but feel free to add some of your own. Plan on fun shit to come. If you know your way around a keyboard and want to help teach some of the youngins, feel free. If you just wanna blow shit the fuck up, come on in. I figure a lot of it starting off will be total retards and skids, but the fact that we are here on zeronet should reduce some of that. Operations should be coordinated off board in my opinion, but who the fuck cares if you're VPN and TOR. \n\nYeeHaw motherfuckers",
			"time": 1565467132206,
			"files": "[{\"name\":\"Screen Shot 2019-08-10 at 12.58.41 PM.png\",\"thumb\":\"893462640ebf45c36b75090c0f96fc0adf73a46c-thumb.png\",\"size\":63438,\"type\":\"image/png\",\"original\":\"64c0a07c41c1383a8ec08c1416290b2da8747b80.png\",\"directory\":\"1GANgPFh4DqZLncNoDXj8oUwECqyY62DDm\"}]"
		},
		{
			"id": "76c39ee9-19ab-4645-8ba8-6cf0dd845500",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a6b1df66-be2f-481b-9c89-886ea12494ae",
			"body": "I plan on writing up some of the absolute basics and providing enough resources to get people up off the ground and then able to self organize their shit. /i/ did originally stand for raids and invasions, but has since branched out into all types of security activities. After /i/ was banned on most boards a lot of shit died out, especially after the lulzsec fiasco. Many of us are still around and active, yet scattered to the winds. Join up, make a thread on something that interests you and get hacking",
			"time": 1565484548096,
			"files": "[]"
		},
		{
			"id": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"subject": "What the fuck is sql injection?",
			"body": "SQL injection is basically where you laugh at a website and it tells you all it's secret private stories about how it was molested as a child. A common way to check for injection is to add a simple ' single quote to the end of a parameter in a url, like http://im.gay/fag.php?buttsex=please' and you get back an error from the server about an sql statement being invalid. Theres a few scanners for this, I plan on rewriting one of my secret sauce ones to actually work correctly here soon, but theres much better ways to scan for SQLi. On your favorite website, open up the developer tools, look for a POST method and right click and copy that into a curl statement. Paste that statement into a command prompt and then change the curl part to sqlmap -u, then remove the --compressed or --insecure tags at the end, and boom youre mapping the internals of a complex website. ANother way is to just give it the top of the site and add --crawl=2 and --forum and let it do it;s thing. If you're a fucking gangster, add some more --threads and turn on -o optimizations. You can even inject shit like websocket connections if you're into that kinda freaky kinky shit.\n\nSQLi is one of the first things to master in terms of web exploitation. Give it a goddamn shot you pussy faggots, get a fucking VPN or TOR and get busy.",
			"time": 1565485103412,
			"files": "[{\"name\":\"Screen Shot 2019-08-10 at 5.58.12 PM.png\",\"thumb\":\"dc13da5a973317efe15146669d14db33ce725cd1-thumb.png\",\"size\":13914,\"type\":\"image/png\",\"original\":\"3f6a42cce5d54195db4c1d3e4e7cda00ef3c6b04.png\",\"directory\":\"1GANgPFh4DqZLncNoDXj8oUwECqyY62DDm\"}]"
		},
		{
			"id": "2c43c3c5-91d1-4239-a694-b6607889f672",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>312e8942-91e3-4358-8221-6baf696df47f\nThanks friend, let me know any suggestions you have for some content or targets and we can just blast em away live in thread",
			"time": 1565496731569,
			"files": "[]"
		},
		{
			"id": "7ab5892b-fcf6-4559-83b0-1a9fd8218cf6",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>d3b17554-92d8-4649-bd32-6604d34287ba\nArachni is an excellent all purpose scanner, the OWASP list is also excellent. There's no silver bullet when it comes to security, but sqlmap is a great place to start for a newbie. For those curious, give the --wizard function a try.\n\nIf you would like to write up some suggestions please be my guest!",
			"time": 1565502470079,
			"files": "[]"
		},
		{
			"id": "15b249fa-091c-426c-8532-c552afc3eb72",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a6b1df66-be2f-481b-9c89-886ea12494ae",
			"body": ">>446e3683-881b-4bfb-a658-0c70d4f94219\nWho doesn't?\n\nHe never took HRT so I wouldn't exactly call him a tranny.",
			"time": 1565502548724,
			"files": "[]"
		},
		{
			"id": "6e91060f-44d0-44c5-bc2d-32e6d4aa2310",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>3536c38d-b136-4038-9fb6-2c8d4d8842cd\nRead man pages",
			"time": 1565531582540,
			"files": "[]"
		},
		{
			"id": "f45de07c-5f08-4c7a-bf48-d7075a873e12",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"subject": "Learn how to code you stupid NEETs",
			"body": "I find this cookbook fairly interesting to show basics on types of malware and attack utilities, consider it a build it yourself BB gun kit. Go through some of the recopies, figure out what it's supposed to do, up your python skills, then become a badass motherfucker and translate it into a new language using Rosetta Code. Rosetta Code is a wiki where people take many algorithms and implement them in different languages, so if you have a foundation in one you can use it to quickly learn the basics of another language. \n\nDo you know C#? Javascript? Python? Perl? Ruby? Learn the others and more with Rosetta Code and this cookbook. Most of the example tools implemented in this book are a fucking joke compared to truly optimized cyber weapons but they are a great foundation to start learning what kinds of tools and weapons exist and how to build them. \n\nFor the more advanced users of this board I recommend taking some of the slower shitty code and trying to make it faster. Thread shit, make shit async, optimize the code, use cython and such to compile it for more speed. \n\nEnjoy skiddies, and grow yourself into something better.",
			"time": 1565532926790,
			"files": "[{\"name\":\"Violent_Python_A_Cookbook_for_Hackers_Forensic_Ana.pdf\",\"size\":7228085,\"type\":\"application/pdf\",\"original\":\"1f20d2a7a02943a2d7daeca35a849cd9f988ca7c.pdf\",\"directory\":\"1GANgPFh4DqZLncNoDXj8oUwECqyY62DDm\"}]"
		},
		{
			"id": "5246e909-4f43-4039-a7e8-7044cf61c171",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>3536c38d-b136-4038-9fb6-2c8d4d8842cd\nOk more than a RTFM reply here, I felt like a dick but I had just woken up.\n\nBasically all the whitehat shit is going to be garbage. Certifications, how to blog posts, books, mostly all garbage. The real deal shit is all in house custom secret sauce modifications to already available services and utilities. \n\n\n\nThe problem with whitehat code is that its fuuuucking slow. They get wagecucked or hourly contracted, they write a decent poc, and then let it run single threaded for 5 hours and bill 900 bucks. \n\nClone their shit, and modify. Make it fast as fuck. Thats what makes it dangerous. Make friends who know cool people. \n\nAbsolutely critical for a good attack are some services and automated scanners. Get a shodan account. If you are cool, maybe you happen to meet somebody with an unlimited unmetered account who can give you an API key. Get a WeLeakInfo account. Same deal, maybe youre fucking leet and have an unlimited API key thrown your way. Get Spokeo and Intelius accounts. Again leet motherfuckers have dozens lying around. Get yourself a hunter.io account. Check out h8mail. \n\nThe cool shit about sqli is that yes, most people have started to harden their outer facing shit, but once you get auth to a site (like a law enforcement database login panel in ukraine or something for instance), they assume your ass is authenticated and youre no longer a threat. The authenticated parts of websites are VULN AS SHIT. Log in with a browser, copy out your session and stuff with the copy as curl function in web developer tools, and presto blamo youre dumping tables. \n\nData trade is VERY VERY VERY good money right now. Dump a table with 200k users/emails/passwords or whatever and thats a nice asf chunk of change for a data broker. \n\nThe reason SQLi is still so important today is credential stuffing. I'll make a thread on that later. Credential stuffing is a technique where you take all those juicy credentials you stole via SQLi and pump them through all the web services you can imagine. Want some free burritos and pizza? Run 200k emails through dominos and chipotle and you will be a fat slob in no time at all. \n\nAs always take proper precautions, make homegirls sister go pick the shit up, etc. But you can do a LOT with lets say a walmart same day pickup for a few laptops ;> \n\n\nEDIT: Oh yeah the scanners. Web scanners are lit, so are CVE scanners. Get yourself set up with the basics like arachni, acutenix, openvas, nmap with --script vulners, getsploit and searchsploit, grab a copy of autosploit even though its trash, fimap, etc. If you're leet use your remote root 0days to rootkit some boxes and scan like a motherfucker. ;>\n",
			"time": 1565538417623,
			"files": "[]",
			"last_edited": 1565538663861
		},
		{
			"id": "effd3b92-7ee7-4e37-8dfa-2375d6e796ba",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>5246e909-4f43-4039-a7e8-7044cf61c171\n\nAlso learn metasploit, theres a web vuln scanner in there too that can do some shit.\n\nMetasploit may be horse cock sucking cuck trash but it can be useful. Make your own payloads, that sort of thing.\n\np2p dht based decentralized backdoors with signature based authentication for command and control are the way to go. I can write up some suggestions or share some code with cool people if yall get with it and know how to write clean C",
			"time": 1565538809246,
			"files": "[]"
		},
		{
			"id": "ff922b0a-0e9b-4ffd-ad91-4ada22c5e394",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c461c664-86e1-4933-b221-861bb909957e",
			"body": "Maybe we can clone thunderchat and make a 08chat",
			"time": 1565539140628,
			"files": "[]"
		},
		{
			"id": "ffeed826-fe6e-4e23-8b8c-29ea11b94d1a",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "f45de07c-5f08-4c7a-bf48-d7075a873e12",
			"body": ">>b20890da-9fc1-4df6-b1d2-50baf56fb6c7\nI leave my laptop on all day, am i doing something wrong",
			"time": 1565603348598,
			"files": "[]"
		},
		{
			"id": "4f3039b7-4890-4b9f-971f-dc4179d81f24",
			"directory": "users/1PTWxzq6P8Fd1mSfk66ag3C5ESwC21DHiV",
			"uri": "i",
			"thread": "17a0bd45-2835-42a7-8e8f-f84492d91d16",
			"body": ">>50eaa916-8c37-4905-ab93-edb03f631f18\nGrab a free shodan account. find a CVE you want to play with. search port:337 vuln:cve-gay-number\n\nenjoy",
			"time": 1565603442661,
			"files": "[]"
		},
		{
			"id": "ec8376f0-6a82-4adc-a8fc-6ff5f242ea8c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "8fd34724-1136-4992-8b39-45434706b9bc",
			"body": "Personally I think 08chan is the bees knees. I prefer this format strongly for a more robust and stable future. I've been involved with imageboard administration since 7chan off and on for years, and this is where we are heading. \nThat said, I just threw up 88chan.co in about an hour earlier tonight at the request of some of the 8chan irc users. It's not OpenIB because I really don't want to host a massive open ended project, it's just regular old vichan with a shitty css I made in about 10 minutes. \nI would prefer to make it a clearnet launchpad to help people get here onto zeronet, or perhaps even a clearnet mirror and bridge.\nWould anyone be interested in helping me work on something like this?",
			"time": 1568275229400,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}