{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 2,
			"title": "La révolution numérique",
			"body": "Salut à tous!\nPour ceux que ça interpelle ou que ça intéresse, je vous proposer d'écouter une émission radio consacrée à \"la révolution numérique\".\n\nIl y a beaucoup de questions intéressantes qui y sont abordées, on pourra peut-être poursuivre la discussion sur le forum.\n\nVous pouvez télécharger les 5 émissions d'environ 50min chacune ici:\n\n(via Mega.nz) https://mega.nz/#F!xxd3lBqK!6RhRurtpz387soHPDtvg_w\n\n(via Dropbox) https://www.dropbox.com/s/29nm6o3yqu6s3gf/R%C3%A9volution%20Num%C3%A9rique%20%5BRadio%20-%20Histoire%20Vivante%5D.zip?dl=0\n",
			"added": 1463702800
		},
		{
			"topic_id": 3,
			"title": "[CENSURE] Salut bande de ...*** Bip ***... ",
			"body": "Salut à tous!\nQue diriez-vous de lancer un topic sur la place de la censure sur ZeroNet et plus particulièrement sur ZeroTalk.\nJe sais que c'est une question très large mais c'est  intéressant d'avoir différents avis et de confronter nos points de vue en la matière.\n\nSi vous ne savez pas par ou commencer, vous pouvez par exemple commencer par répondre à ces quelques questions ou en lancer de nouvelles auxquelles on pourra tous répondre.\n\n***1. Selon vous quelles-sont les règles qu'il faudrait adopter sur un forum francophone? ***\n***2. Il y a-t-il quelqu'un qui puisse être légitime pour administrer ce forum?***\n***3. Jusqu’où va la liberté d'expression sur le forum ?***\n\n",
			"added": 1464914092
		},
		{
			"topic_id": 4,
			"title": "Nouveau ZeroChat FR ?",
			"body": "Salut tout le monde!  \n\nJe ne sais pas si vous le savez mais le [ZeroChat FR](http://127.0.0.1:43110/1KzDGFWuVgniDVaKBdS1cY91FZBQeKbZMn) actuel est limité à 10k-15k pour les commentaires et n'accepte pas les ~~[ZeroVerseID](http://127.0.0.1:43110/zeroverse.bit)~~ ou les [KaffieID](http://127.0.0.1:43110/id.kaffie.bit). (voir: [ZeroChatrooms](http://127.0.0.1:43110/ZeroChatrooms.bit) )\nCe qui veut dire que si vous dépassez cette limite (ce qui m'est déjà arrivé), vous verrez le message **\"Content sign failed: invalid private key.\"** apparaitre et vous ne pourrez plus utiliser le tchat avec votre ID.\nJ'avais envoyé un ZeroMail à ** [@angristan](/Mail.ZeroNetwork.bit/?to=angristan)** et **[@nowhereman](/Mail.ZeroNetwork.bit/?to=nowhereman)** pour essayer de faire lever cette limite, mais je n'ai reçu aucune réponse à ce jour malheureusement.  \n\nMon idée était de refaire un nouveau ZeroChat FR, avec une toute nouvelle interface graphique, en levant la limite des commentaires et en ajoutant la connexion par ~~[ZeroVerseID](http://127.0.0.1:43110/zeroverse.bit)~~* et [KaffieID](http://127.0.0.1:43110/id.kaffie.bit)\n\nPour ma part, je peux m'occuper de la partie graphique en CSS3/HTML5 mais mes connaissances en JS sont vraiment pas terribles -_-'   \nDonc si quelqu'un s'y connait bien en Javascript et aimerait m'aider pour ce projet ce serait génial.\nOn peut se servir de ce topic pour en discuter mais également pour débattre des nouvelles fonctionnalités qu'on pourrait y ajouter etc..  \n\nBref, si un ou plusieurs d'entre-vous sont partants, manifestez vous :-) soyez pas timides!\n\n--\nCi-dessous les ZeroMails des participants:\n**Interface graphique: **\n[@openuser](/Mail.ZeroNetwork.bit/?to=openuser) - [ToxID](56C3EB23755F008304386E1114076031B81C22EE7D3D78A366E2A721C987B86B7B478A550872)\n\n**Beta-testeurs: **\n[@dgsi](/Mail.ZeroNetwork.bit/?to=dgsi)\n[@rambotito](/Mail.ZeroNetwork.bit/?to=rambotito)\n\n\n",
			"added": 1475406848
		}
	],
	"topic_vote": {
		"3_15xAFv6aHXqo5xdaSoTEi5pRNokskECJXU": 1,
		"4_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1,
		"5_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1,
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": 1,
		"10_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1,
		"7_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1,
		"1_15paAbCYCcgVQP4NWgVFc7WaN7psy2E6A7": 1,
		"11_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1,
		"4_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": 1,
		"1_1KrJgpJqJij8zdhJ4gFZg7gscskgtCgNmX": 1
	},
	"next_comment_id": 27,
	"comment": {
		"3_15xAFv6aHXqo5xdaSoTEi5pRNokskECJXU": [
			{
				"comment_id": 1,
				"body": "@elnormand: non ça ne supprime pas tes messages antérieurs :)\nMerci @nowhereman, merci @Angristan",
				"added": 1463596623
			},
			{
				"comment_id": 9,
				"body": "Je confirme ^_^\nJe me suis fait baiser 2x :D",
				"added": 1464206855
			},
			{
				"comment_id": 10,
				"body": "@elnormand : je commence à aimer ça! :D",
				"added": 1464210538
			}
		],
		"7_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 2,
				"body": "Merci :)",
				"added": 1463700687
			}
		],
		"1_13VMtfExpcV62CDDaexqbmCwLma6uxnprX": [
			{
				"comment_id": 3,
				"body": "C'est pas une mauvaise idée :)",
				"added": 1463700961
			}
		],
		"2_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 4,
				"body": "Oui c'est bien KimDotcom :)\nPourtant le lien marche bien chez moi... curieux!\n\nTu peux essayer ce lien Dropbox: https://www.dropbox.com/s/29nm6o3yqu6s3gf/R%C3%A9volution%20Num%C3%A9rique%20%5BRadio%20-%20Histoire%20Vivante%5D.zip?dl=0",
				"added": 1463740713
			},
			{
				"comment_id": 5,
				"body": "Merci pour le retour @vixa :)",
				"added": 1463740983
			}
		],
		"10_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 6,
				"body": "Merci, j'ai suivi ton post à la lettre :)\nJe ne sais pas si ça à marché car je ne peux pas me connecter moi-même sur mon blog :)\n\nSi quelqu'un a un ZeroVerseID, pouvez-vous essayer de vous connecter ici, svp! Gracias mutchatcho!\nhttp://127.0.0.1:43110/16g8mFUtLsQBM6bPMJ6xEEQWLWAufnzEXA/",
				"added": 1463754073
			},
			{
				"comment_id": 8,
				"body": "Pareil chez moi, j'ai le message \"Content publish failed\" quand j'essaye de commenter sur mon blog avec mon ID Zeroverse. Par contre je peux quand même voir le message que j'ai posté, mais je suis le seul à pouvoir le voir apparemment.",
				"added": 1464124732
			}
		],
		"2_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [
			{
				"comment_id": 7,
				"body": "Il est plus chiant qu'une course d’escargots ce mec! :D",
				"added": 1463949566
			}
		],
		"11_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 11,
				"body": "Super, merci :)",
				"added": 1464391306
			}
		],
		"12_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 12,
				"body": "Moi je suis pour :)\nCe serait top d'avoir une fonction de recherche intégré, comme ici: http://127.0.0.1:43110/1AWAXiVLbcuncGbpyiUmDbAUpBB4r6KPKL/",
				"added": 1464607678
			},
			{
				"comment_id": 13,
				"body": "oui mais les pull sa gratte!",
				"added": 1464635890
			},
			{
				"comment_id": 14,
				"body": "mdr :D moi non plus je ne me ferai pas confiance ^^ \n\nMais sinon, la question sur la neutralité est assez bonne. Que ce soit @elnormand ou n'importe qui d'autre d'ailleurs.\nN'y aurait-it pas un moyen de créer un site sans que personne ne possède de clef privée? Par exemple que l'utilisateur et sa clef privée s'auto-effacent dès la création du site c'est possible ? Comme ça il n'y aurait pas de problème de censure !",
				"added": 1464686902
			},
			{
				"comment_id": 15,
				"body": "ptdr... j'ai l'impression de faire partie d'un ZeroTalkLeaks :D",
				"added": 1464778105
			},
			{
				"comment_id": 16,
				"body": "@up4: Je voulais juste revenir sur ton printscreen du zerochatFR. Je pense qu'il y a une grosse mésentente. Je m'en rends compte un peu après coup en relisant ce topic.\n\nLorsque @elnormand dit: \"up est un bon dans son genre\" cela n'avait aucun rapport avec \"les pollueurs de contenu\".\nJe comprends qu'en relisant le chatFR tu aies pu croire qu'on t'associait à \"un pollueur de contenu\" mais ce n'est pas du tout le cas. Déjà... sur le chat le temps n'est pas pareil le même que celui de la réalité, quand on poste un msg celui qui suit ne fait pas toujours référence au précédent... car entre temps on peut s'envoyer un zeromail, faire un commentaire sur un blog etc.. donc si tu lis le chat d'une trêve je comprends que tu aies pu mal interpréter notre discussion.\n\nQuand @elnormand dit: \"up est un bon dans son genre\"... pour moi, il s'agit d'une expression Française du langage courant qui pourrait se traduire par: up est un bon type... ou un bon spécimen (dans le sens \"original\"). Moi c'est de cette manière que je l'ai compris en tout cas, et je pense que c'est ce que voulait dire @elnormand. (il me corrigera si j'ai tort)\nD'ailleurs moi je lui répond en disant: \"oui c'est un ronchon mais il est cool\"... rien de méchant en gros, ça veut juste dire que je t'apprécie.\n\nJe tenais simplement a m'expliquer j'ai le sentiment que tout cela à été mal compris et peut-être qu'au canada nos expressions ne sont pas interprétées de la même manière. En tout cas sache qu'il n'y avait rien d'insultant ou de péjoratif dans mes propos.\n\nPS: Déjà qu'on est une poignée d'actifs dans le ZeroNet FR si c'est pour se tirer dans les pattes je vois pas l’intérêt ^__^\n***\nDéfinition - tirer dans les pattes\ntirer dans les pattes (v.)\n1.(familier)causer des ennuis ou des difficultés à quelqu'un.\n\n",
				"added": 1464911092
			},
			{
				"comment_id": 17,
				"body": "@poubelle = @up4 ? ^_^\nj'y comprends plus rien moi :)\n\nConcernant un nouveau forum TalkFR, personnellement je trouve qu'il faudrait améliorer le TalkFR, si @elnormand veut s'en charger en ajoutant ZeroVerseID et plus de 100k de caractères autorisés je trouve que c'est une bonne chose, au pire sa nouvelle version pourra être clonée par n’importe qui voudrait lancer un Talk. \nCela ne voulait pas dire pour autant que j'étais d'accord pour qu'il administre ce nouveau TalkFR, l'idée du pull/request est une bonne idée, et c'est surement la meilleure façon de procéder comme tu l'as dit plus bas.\n\nLa question de la censure reste ouverte, peut-être qu'on devrait effectivement faire un NewTopic pour en parler.",
				"added": 1464913064
			}
		],
		"3_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 18,
				"body": "Aller.. ne soyez pas timides, j'ouvre le bal!! :)\n\n1) Pour ma part déjà parler Français me semble être une bonne règle. Ensuite le flood peut vite être énervant.\n\n2) Dans l'idéal j'ai envie de répondre \"personne\" ou \"tout le monde\". Même l'actuel instigateur du forum pourrait tout supprimer du jour au lendemain ou exercer une censure sans qu'on le sache. Dans l'absolu ce pourrait être bien d'avoir une sorte d'outil démocratique qui permettrai de donner ce pouvoir à tous les utilisateurs. Par exemple tout le monde pourrait lancer un véto sur un Topic ou sur un commentaire ou un utilisateur et si un gros pourcentage de gens voudraient le voir disparaitre bah... il serait supprimé de manière démocratique. Mais j'admets que mon idée est encore un peu floue Après je ne suis pas programmeur je ne sais pas si cela serai possible car cela pose beaucoup d'autres questions techniques notamment. \n\n3) Je peux volontiers parler de tout, je pense que si on vient sur des réseaux alternatifs c'est aussi pour avoir le moins de règles possible et se sentir plus libre que sur le ClearWeb. Il y a toutefois des sujets que j'aimerais à tout prix ne jamais voir sur ce forum, surtout des sujets liés à la pédophilie.\n\nVoilà! A vous de jouer ^_^\n\n",
				"added": 1464915579
			},
			{
				"comment_id": 19,
				"body": "@vincentolivier J'en conviens, ma phrase n'était pas très explicite mais elle sous-entendait que je ne voulais pas voir de sujets pro-pédophilie. Autrement dit des sujets incitant aux abus sexuels sur mineurs non-consentants ou au viol d'enfants. \n\nAprès, les questions que tu soulèves ont plus rapport avec la majorité sexuelle qui selon moi est un sujet comme un autre sauf qu'il ne me passionne pas plus que ça et que je suis loin d'avoir un avis sur tout d'ailleurs. \n\nEnsuite pour ma part je pense qu'une liberté d'expression totale est souhaitable et bienvenue si elle à pour but d'exposer un point de vue, une pensée, une réflexion, une idée. Mais il s'agit d'un outil comme un autre, selon comme on l'utilise on peut également attiser la haine, discriminer, injurier, agresser... dans ce cas je trouve cet outil moins salutaire.\n",
				"added": 1464918995
			},
			{
				"comment_id": 20,
				"body": ">Je réponds sur le forum à ton post sur mon blog car j'ai des problèmes à publier sur mon propre blog \"Content publish failed\" ... je ne sais pas d’où cela provient... peut-être car j'ai tenté d'implémenter le ZeroVerseID, je vais essayer de régler ça.\n\n\nJe ne vais pas me rabaisser à justifier des propos que je n'ai pas tenus, et il serait tout aussi facile pour moi d'injecter dans les tiens un sens tout aussi nauséabond ou farfelu.\n\nPour ma part j'utilise le sens commun des mots. Hors quand on parle de pédophilie, pour une écrasante majorité des gens ce terme désigne bien l'abus sexuel d'un adulte sur un enfant. \nSi le but de ton intervention était de dire que tout sujet, même un aussi controversé que celui-la, mérite sa place et mérite d'être débattu comme n'importe quel autre sujet, je te l'accorde si pour autant le but n'est pas d'en faire l’apologie.\n\nAprès, que tu considères que l'âge de la majorité sexuelle ou tout autre sujet lié mériterai d'être débattue, même s'il s'agit de sujets qui ne me passionnent pas, au nom de quoi voudrai-je ou pourrai-je les interdire...\n\nPour quelqu'un qui attache une grande importance aux sens des mots tu sembles prendre un malin plaisir à détourner le sens des miens. \nSi ta façon de débattre passe par le travestissement des pensées de ton interlocuteur alors je comprends mieux d’où provient ton sentiment de grandeur. ",
				"added": 1464952437
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 21,
				"body": "rutracker.org c'est un tracker de torrents. \n\"iTunes Russe\" c'est un peu ironique :-) de la part de @Troll ... on commence à le connaître :D",
				"added": 1475096077
			}
		],
		"1_1DdFL53pVKkKzPHVpakA5LWo8uw48LhjWj": [
			{
				"comment_id": 22,
				"body": "Moi j'ai un ZeroMe tout neuf tout beau ... c'est par ici ---> [openuser](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS/openuser@zeroid.bit)\n\nPostez les vôtres qu'on puisse vous follow!",
				"added": 1475096318
			}
		],
		"1_13KjVHdVXjiMLMcN1RMhaRPDFFXRotVzsK": [
			{
				"comment_id": 23,
				"body": "Tu peux les balancer sur le wiki FR aussi si tu veux : http://127.0.0.1:43110/135qYXdNpf5kTWYuTJ8uautsUi91Bhvcck/?Page:help\n\nCool le pastebin ^^",
				"added": 1475329174
			}
		],
		"4_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 24,
				"body": "Concernant les nouvelles fonctionnalités qu'on pourrait ajouter au ZeroChat, j'avais pensé:\n- le multi-rooms (pouvoir créer une room, ou avoir une liste de rooms déjà faites)\n- pouvoir ajouter un avatar\n- pouvoir envoyer des msg's privés\n- fonction de recherche dans les messages et messages archivés\n- générer un link pour chaque msg pour pouvoir par exemple linker un msg dans un autre site\n\nVoilà, en gros ce qui me vient à l'esprit pour le moment, avez-vous d'autres idées ?\n",
				"added": 1475411839
			},
			{
				"comment_id": 25,
				"body": "@rambotito @dgsi se sont manifestés et sont également intéressés par le projet. \nNous cherchons toujours des développeurs/programmeurs Javascript :)\n\nMoi de mon coté j'avance déjà sur l'aspect graphique de l'interface, je vous tiendrai au courant de l'avancement.",
				"added": 1475713054
			},
			{
				"comment_id": 26,
				"body": "Bon... ici c'est un peu le désert... c'est comme dans les western il y a des ballots de paille qui traversent les rues dessertes du ZeroTalk ^_^\nDe mon côté j'avance un peu l'interface graphique mais comme je ne peux pas en discuter avec un programmeur c'est pas facile d'avancer. \nFaudrait que je sache ce qui est possible d'être fait, s'il y a des restrictions etc... \nMais en gros, si vous êtes curieux, pour le moment ça donne ça: \n[ZeroChatFR - Interface](https://s14.postimg.org/kmwemsw8h/Zerochat_screen1.jpg)\nPour le moment, je mets juste un prinscreen. Bientôt je ferai un GItHub ou je placerai les fichiers source. Comme ca si ca intéresse quelqu'un,  il n'a qu'a les downloader) Je vais bien-sur faire en sorte que ce soit du responsive design.\n\n",
				"added": 1476543031
			}
		]
	},
	"comment_vote": {}
}