{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1565404728,
			"title": "Redpill me on the Balfour Declaration",
			"body": "Answers from the (((journalists))) who are lurking here are welcome.\nSo the UK was in the middle of WW1, their ally russia just left the war, so the central powers could now soley focus on the western front. The french were crumbling. And additionally you get internal problems with people getting tired of the war and monarchy.\n\nAnd in such a tense situation, where they fear for their own survival, for no reason at all, they decide to sign a paper promissing jews to build Israel in Palestine. \nWhat did they get in exchange?\nThats a very big gift that they make... with nothing in return?",
			"added": 1565404727
		},
		{
			"topic_id": 1565463702,
			"title": "Why do my Dolphins always die in minecraft?",
			"body": "Seriously, is so much hard work to transport them to my base and then they die because they just stay underwater and suffocate.\nHow do you catch dolphines in minecraft?",
			"added": 1565463700
		},
		{
			"topic_id": 1565538736,
			"title": "Holocaust threat",
			"body": "Lets talk about the holocaust. Example of questions that are discussed here are:\n\nWhy did they use wooden doors on gas chambers?\nWhere are the bodies / ashes?\nDid they make lampshades and soap out of jew skin?\nWhy does the death count of Auschwitz permanently get corrected down (initial claim: 4 million, current official numbers: 1.1 million), but the total number of dead jews always remains the same 6 million?\nWas it really possible to tell the difference if they burned a jew or a russian by the color of the smoke?\nHow did the masturbation machines work?\nHow did they hide it so well? Not a single official order or document could be found, the whole theory is based on what they made someone on the nurnberg trials sign under heavy torture.\nWhy are all death camps the once liberated by the USSR while the once liberated by the UK/USA were just labor camps?\n...",
			"added": 1565538733
		}
	],
	"topic_vote": {},
	"next_comment_id": 34,
	"comment": {
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 1,
				"body": "> [kaffie](#comment_934_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):\n>Where are the lines drawn?\nThere is no line that you can draw. The world isn't that simple. Taxonomic ranks transition between each other. There are multiple scientific definition of \"race\" but none of them is able to draw a line. Just like we aren't able to draw a clear line between species or even between the orders. Different definitions will tell you different things and every definition will have borderline cases where it isn't able to work.\ni.e. a horse and a donkey are two different species, but they can breed with each other and create a mule (which is then pretty much alwas sterile)\nSo we define a species as a group that can breed and added the requirement that the offspring is fertile too... but now we find some mules that actually can breed. And what was with their ancestors? The further back you go the higher the chance for interbreeding to also result in a fertible offspring. A mountain zebra and a plain zebra are considered different species, it's hard to get them to interbreed and they will have many miscarriages, but the offspring thats produced has a higher chance than a mule to be fertile. Now those species have different chromosome numbers, but luckily, chromosome number isn't part of the definition of \"species\".\n\nSo if we are not able to draw a line between species, with a definition that sounds pretty easy and obvious, how will you be able to draw the line between races, which is two levels further down?\nBut just because we can't draw an obvious line without border cases, it doesn't mean that it doesn't exist.\nAnd just because there are one-in-a-million border cases, doesn't mean that we suddenly arn't able to differenciate.\n\nSome native from sub-sahara africa is so obviously different that we can spot their ancestry from a mile away. And if they are obviously physically different (watch as some SJW will deny that), why should they suddenly be mentally the same? And by this i don't mean \"better\" or \"worse\", but just.... different.\nA different culture with different values and different goals will probably also need a different form of government.\nEast Asians always have very strict hierarchies. Just work in an international company with offices all over the globe and you will see that the same lose hierarchies that we have in the west just don't go very well in Asia. So most international corporations run different forms of hierarchies in Asia than they do in the West.\n\nSo if they can't even run under the same working environment efficiently, how the hell would someone think that you can just mash all cultures together under one country with one form of government and expect this to somehow work?\n\nThe USA is \"mixed\" for a few hundred years now, but somehow you still have majority white, majority hispanic and majority black areas. Different cultures naturally seggregate themselves from each other. No matter how much diversity ads you run, interbreeding is still a rare thing to happen. And if it happenes, they have an >50% higher chance of divorce.\n\nYou say that you ended up in the far-left because of social issues that you think needs government social problems.\nBut what exactly has that to do with FAR-left?\nSocial programs were the cornerstone of National Socialism, thats how they managed to get their country out of the mess that was the Weimar Republic, nobody would ever call that capitalism. NatSoc isn't economic right wing.\nAcknowledging the need for something doesn't make you left or right, it's the combination of where you think the problem lies and how to adress it that does it. \nIn capitalism you try to get out of such miseries by focusing on supporting the economy and generating wealth which then gives people more means to then privately deal with that and do cheritable contributions. \nIn communism you just think that every human is the same and that the only difference is the class that you are born or end up in. So you try to adress those problems by taking everything from everyone and give it equally to everyone, because you think that the people with more wealth just have it because they just got lucky with where they were born and how they were raised anyway.\nFar-left is not equality of opportunity, it's equality of outcome. Someone who works hard gets the same as someone who is lazy.\nbtw. according to early communists, LGBTQ is a capitalist construct and once capitalism is abandoned, there won't be any gay people anymore, because every human is the same, its just the uprising and the economic factors that matter\nAnd the communist got proven wrong with their theory, again and again, in every single country they tried, it failed and collapsed. 100 million deaths thanks to communism. 40 million alone in China because of one single communist reform.",
				"added": 1565380952
			},
			{
				"comment_id": 2,
				"body": "> [ntp](#comment_6_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD): \n>those ideas they die by themselves\nweird, afaik every single communist or far-left socialist country collapsed by itself, meanwhile NatSocs had to be taken down by everyone else combining forces against them, capitalists and communists had to work together in rage to stop the rising Reich.\n>Did you know that the nazis end up against each other when the resources run out?\nWeird, there were 11 plans to assassinate Hitler before the War started by his political opponents, 3 at the start of the war, 5 during the war and 3 at the end of the war.\n>the secret of success with our species is based on the capacity to absorb and assimilate other \"tribes\"\noh, so you are saying that the human races that stayed on their own and never had any contect to others, like subsahara africa, aborigines and native americans are inferior because they never had contact with someone else before collonialisation? Very interesting!\n>Why Romans became huge? Absorb the nearby tribes and gave them roman citizenship\nThose \"assimilated tribes\" were just some cottage villages and the romans would settle themselve down somewhere else, founding new cities. Here have a list of notable cities they founded from scratch:\nhttps://en.wikipedia.org/wiki/List_of_cities_founded_by_the_Romans\nBtw. thats interesting that you mention that, ever read about the Roman-Jewish wars? You know, the reason why Israel became Palestine? It even has it's own holocaust stories and according to the jewish Talmud the romans killed 40 million jews in one city alone. You should read about it, it's nice knowledge about jews and their holocausts, about how the romans dealt with foreign provinces and about how jews lost their whole country just because they thought that Romans would forbid them to mulilate babies.\n>Why Spanish became huge? Absorb the new world (Aztecs Mayas, etc) and\nExcept that they didn't, they didn't do it any different from the English or France in North America. The only spanish people who were in constant contact with the natives where the christian preachers who tried to stop those savages from doing cannibalism and ritual murders.\nYou don't mean the Spanish, you mean the Portuguese, they tried to support collonialisation by mixing with natives, especially in Brazil. Now tell me: Who are the countries of the New World who have the highest murder rates and the most favelas and drug cartels? Do you see some correlation? Highest homicide rate in the world and Favelas ftw.! Truly a sign of how successful diversity is!\n>Why USA is currently huge?\nBecause they ended up in a lucky position in the World Wars wich made the USD the world wide key currency (which means: you can export your inflation) and they basically inherited the British Empire and filled their power void.",
				"added": 1565382825
			},
			{
				"comment_id": 10,
				"body": "> [drgonzo](#comment_1_1GxfApQPkih2RjGcKrVWbHHarz3UUkwRJE): You nazis don't make any sense at all !\n>I get the hate against politicians but your whole way of life is bullshit !\nas i see, you have no arguments, what exactly is bullshit? Oh wait, you didn't write more than jus those two sentences in this whole thread.\n> [aspidochelone ](#comment_38_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  I think the next human species is already emerging, but you'll be disappointed to hear that like all the others it's emerging from Africa. They have all the genetic variation to work with. Homo apotelesmatis is what we might the future species that could cross interstellar space - man influenced by the stars...\nTrying to predict evolution? Won't work out so well. Especially if (((someone))) would start to promote interbreeding of your master race.\n> [redlibertyreal](#comment_53_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): No, you don't debate with people like this for the same reason why you don't debate why a woman shouldn't be raped.\n>Me though? I literally can't stop laughing reading this thread. So many of these people here it's like there's NO WAY they're serious but they are and it's actually hilarious. \nAgain someone with totally 0 arguments. It's sad to see how all those people who want to debate against NatSocs have to rely on logical fallacies and insults, while the people that they hate are all civil and able to debate without turning into screeching kids. Really tells you much.\n>Just a reminder, people like us built the censorship resistant networks and tools you people use. We the anarchists, hackers, cypherpunks. \nNow you think you can talk for everybody here? Remember the Anonymous movement? Who launched this? Remember LulSec? Remember GNAA? Now guess from where they are from.\nMeanwhile the movements that were kinda leftist, like Occupy Wall Street, all got undermined and used as the useful idiots to shill for the government. The people from those movements that were once against the current financial system are now rallying for such important questions like what toilette a tranny should use and they worship international corporations.",
				"added": 1565440812
			},
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_942_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): You've misunderstood my views quite a bit. I'm not a communist in the sense of taking everything and redistributing it. Instead I support anarchism\nThat's what this whole \"Withering away of the state\" in Marxist theorie is about. Thing is that most so-called communists, especially those from the USA who never had the pleasure of actually witnessing it, don't really know what their own ideology is about (not neccessarily talking about you, just hinting that there might be some misconseptions). If you don't have some magic wonderland with no state and no money as your endgoal, you aren't a communist. Even Stalinists and whatever Kim in Korea is doing have officially this goal.\nThe difference between Anarcho-Communism and Marxism-Leninism is about how they think they could achieve it. While Marxism-Leninism uses the state to take all productions away and redistribut it, in the hope that after x years the people whould be so used to it that you could just take the state away and they would continue by themselves (just how people in gulags were tortured so much that some political prisioners would rather torture others themselves than having to endure it - so they could run some gulags with ex-prisoners and it would end up being a self-sustainable system of torture). AnarchoCommunists want to just forcefully fuck everything and remove every government and every country immediately, because in their opinion it would be natural for people to then just share everything with each other.\nbtw. People with health issues need foremost social services. Just giving them things is not enough.\n>I support things like LGBT rights\nThis is totally contradicting any far-left communist believe. All those \"commies\" from the USA (now _really_ not talking about you, just my personal rant) who think that they could support special rights for some special snowflake groups and minorities should read a book. Dear self-declared Commies who might be lurking: Read Marx, god damnit!\n>This puts me at far left in terms of economics. But for social things I'm slight left. \n>I'm slipping on the race thing as well, as I'm starting to think that segregation is ideal, and only allow mixing in cases of assimilation.\nNow imagine a word to describe a group of people who are not just neccessarily defined by their race alone, but also a group with common culture, common values and common goals. People who are able to live under the same form of government/laws/rules.\nLets call that: Nation\nLets call countries that are based on governing such people: Nation states\nLets call people who think that a country can just efficiently work with such people with the same values and goal and similarities: Nationalists\nAs i see it based on what you write, you are a SocDem with some slight hints of nationalism (not conservatism). In that case you can read what i write above as just informational. Or as a starter for an even more in-depth debate.\n(now what do you think does National Socialism mean? You can barely call NatSocs economically right, but you can also never call them economically far-left)",
				"added": 1565443312
			},
			{
				"comment_id": 12,
				"body": "> [aspidochelone](#comment_40_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z):  It's funny - and not unexpected - to see the non-Nazis lose their temper first on this discussion. Understand that this does cost us points.\nWelcome to a free debate. This is always how it developes.\nThe people who are used to safe spaces and who are painting their \"enemies\" as super evil lose their temper when they see that their \"enemy\" actually is able to have reasons and well thought through arguments.\n>The key thing to understand here is that these neo-Nazis, like others I've encountered, don't sound like marching morons. See them IRL, and you'd think OMG Krauts get me the tommy-gun! \nJust like most lefties aren't like those retards shouting \"YOU ARE A WHITE MALE!\" and kicking trash bins. All sites have those problems. Even centrists have the problem of those \"I am a centrist because i have no opinion, and basically you are all stupid\" guys.\n\nThing is that in most political debates that i was part of or that i witnessed, it was always the far-left that had problems with acknowledging that their oponents could have actually some valid points.\nHell, this is on what all Ben Sharpio debates are basedon! The jew isn't good at debating at all. He gets all those free wins simply by finding one logical argument and then having his opponents going batshit insane becaue they can't believe it that their \"enemy\" was able to make one coherent argument. Ben Sharpios debates are all based on having lefties talk themselves into a corner in their hate.",
				"added": 1565444146
			},
			{
				"comment_id": 13,
				"body": "> [docgonzo](#comment_1_14oQjKyPP5KTBQioQgxj7MhHAEk1cJyS1k): Debating with you is like telling a muslim suicide bomber that there is no virgins waiting in heaven. He is brainwashed and won't listen.\nSays the one who didn't write a singel comment.\nI will ignore those lefties losing their temper in future posts, because i see how that harms those other people who are actually interested in debating and don't want to be associated with narrow minded angry logical fallacy posters.",
				"added": 1565444472
			},
			{
				"comment_id": 14,
				"body": "> [kaffie](#comment_970_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): So in that sense I support neither of those.\nWhich is very good. Don't put yourself into some arbitrary category, form your own opinion. It's very unlikely that there is a political ideology that matches someones opinion to 100%.\n>Instead I support a gradual reduction of reliance on state and capitalism by switching slowly over to decentralized means of production. Think off-grid preppers, mixed with p2p technology, solar po...\nDon't look at the things that you can automate today already just fine. Look at the things that you can't. Services. Who is a judge, who is a lawyer, who does all those shitty jobs that people just do because of money, how does prostitution work, farming, land ownership, etc.\nAnd if you automate everything, from nurse to plumber to prostitute, do you end up building the Matrix?\n>By LGBT rights I mean: don't kill people for being gay/trans, cover trans healthcare (HRT+SRS) the same as you would other forms of healthcare\nWell, then they have those rights already forever. Gender dysphoria is a recognized mental illness, so insurance companies or social healthcare has to pay for the treatment. No special rights needed.\nIn fact, putting trannies on a podest is unfair towards other mental illnessses like schizophrenia (maybe with multiple personality issue) that is way more common and has a way higher social stigma.\nIf being a tranny is not a mental illness, then SRS is just a cosmetical surgery and insurance companies or the society shouldn't have to pay for it. Just like i don't want to pay for some boob job of a thot.\n\nbtw. why do we even consider a surgery to change your physical body to be a treatment for a mental issue? This reminds me very strongly on how we used to cure schizophrenia with lobotomy and i personally think that in a few decades we will look back and we will be disgusted at about how we mutilated trannies. Spending hours per day dilating to keep your body from sealing the open wound that you call vagina.... for your whole life.... just because some political ideology was forcing it as progressive and tricked you into thinking that this would solve your mental issue.",
				"added": 1565445816
			},
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_975_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): While gender dysphoria is a recognized mental illness, transsexualism is not.\nIf you just want to be a girl because it's your fetish or just because you would rather be a girl.... without you having any issues with being a man whatsover... then i don't think that social healthcare or health insurance should pay for it. Definitelly not. Some girls rather have big boobs, i also don't want to pay for this.\nYou don't have to get this >right. Especially because it would be unfair towards all those people wanting other cosmetical surgeries.\nBut social healthcare and insurance companies should pay for fucking teeth! Somehow they rerely do that.\n>The needed treatments are basically hormone therapy\nThere is no treatment needed if its not an illness and if it doesn't cause health problems.\n>That's a lot of misinfo, and isn't what happens.\nIt's not. The misinfo is that in all those discussions about SRS, the pro-side rarely even mentions dilation.\nDilation is lifetime!\nYou shove a dildo into it every single day multiple times to keep it from healing close. You will spend around 500 hours dilating in the first year after surgery. And then you reach your final schedule of 30min delating per day IF you additionally have sex (which is not the case for pretty much all of them). Also you have to pick out a nice hairball once in a while from the thing that you call \"vagina\" and the constant fear of developing a fistula and leaking fecals out of your \"vagina\".\nRead some posts where people wrote about their dilation schedule.\n\nSRS as treatment for gender dysphoria is like lobotomy as treatment for schizophrenia.\nIt's inhuman and in a few years we will be looking back in disgust about how cruel we were.",
				"added": 1565449458
			},
			{
				"comment_id": 17,
				"body": "> [memesadler](#comment_10_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): It does happen with the normie/conservative kosher-right, too\n\nOh yes, the neocons and their successors, totally agree.\n>the democrats are the real racists\n>check out this based black guy with a trump hat\n>\"civic\" nationalism",
				"added": 1565457568
			},
			{
				"comment_id": 19,
				"body": "> Do you agree with such statement:\"Yellow race has the best intellectual potential but worst physical, white race is in the middle, and the black race has best physical potential but worst intellectual\".\nLet me also write something to that....\nThe average sub-sahara African is smaller than the average European. They dominate in running and maybe endurance sports, but not in athletics or when it's about strength.\nAnd with intellectual potantial its kind off the same. Asians have high IQ, but aren't creative and tend to strong hierarchies. High hierarchies in sub-sahara Africa never work, except if they get totally dominated.\n\nThe diversity supporters should try to make a African / Asian mixed country, would love to see how that works out! That would crash and burn so fast.",
				"added": 1565459118
			},
			{
				"comment_id": 29,
				"body": "> [aspidochelone](#comment_45_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): See https://en.wikipedia.org/wiki/Demographics_of_Mauritius#Ethnic_groups .  Apparently the country has free health care and free tertiary education and a PPP of $25,000 - not as good as the U.S. average but not bad for Africa.\n68% Indians + 25% mixed people who have also some African in their ancestry (just saying that the example Creoles here https://en.wikipedia.org/wiki/Mauritian_of_African_origin look closer to Indians than sub-sahara Africans).\nJust 3% with Chinese origin.\n\nI mean, i know that Indians are technically asians, but come on, it was obvious with that context that i meant East-Asians with it. Specifically, those East Asian countries where ant-like societies and strong hierarchies are a thing for thousands of years now. 3% is not nearly enough for them to even try.",
				"added": 1565498368
			},
			{
				"comment_id": 30,
				"body": "> [kaffie](#comment_985_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): \nBut what transsexuals experience is Gender Dysphoria?\nIn my book, gender dysphoria means that you experience serious mental problem because you think your sex should be different.\nJust quoting wikipedia now:\n>Gender dysphoria (GD) is the distress a person feels due to their birth-assigned sex and gender not matching their gender identity\nand for the difference to gender nonconformity:\n>gender nonconformity is not in itself a mental disorder. The critical element of gender dysphoria is the presence of clinically significant distress associated with the condition\nafaik there is just this one disorder and that can be experienced by transsexuals and other transgender people  (but doesn't neccessarily have to, according to wikipedia)\n\nBut god knows that those definitions change again and again.\nYou are yourself using GID, which is how it was called before 2013, it got renamed to GD gender dysphoria because, quote:\n>to remove the stigma associated with the term disorder\nGender dysphoria is the only mental disorder that you aren't allowed to call disorder, because that would be offensive and transphobic.\nBtw. also the people who identify as transgender because it's their fetish to be seen as a girl don't want to hear that word autogynephilia anymore, they prefer it to be simply called transgender, who just do it because they want to experience \"gender euphoria\" when they transition.\n\nYou might have to update your vocabulatory or you might be seen as transphobic ;)\n\n>And your bias is showing\nI don't want to comment on the surgery posts any longer, because it will end up with one word against another without having legit sources, because they are somehow hidden, just like the statistics about children/teens who considered themselves to be transgender and after puberty turned out to be just gay.\nhttps://www.youtube.com/watch?v=bZJorJ_W1QA\n(one hour just about that)\nI know that fisulas are the most common secondary effects, and from all the dilation schedules that i saw i picked the one with the least amount of time has a 2-3 times per week schedule past the second year for lifetime.\nhttp://www.chet-plasticsurgery.com/dr-chettawuts-vaginal-dilatation-instructions/\n\nAnd i am biased, yes, mainly because it's impossible to not be biased if some political movement wants to force the gloryfication of an mental illness for some weird reason that i do not know, and is constantly contradicting itself.\nHow can gender be a social construct if transgender exists? Does that mean that transgender is also just a social construct? Somehow sex and gender is totally different and unrelated, but the treatment for transGENDER is to try to change SEX. And why do those lefties suddenly love identitarian movements so much? LGBTQ movement is identitarian. Somehow you can be a whore, like sex and sleep around and like it and still identify as asexual.\nAnd all that newspeak! Renaming a mental disorder because the term disorder is stigmatized (but somehow perfectly fine for all other mental disorders). TransPHOBIA (phobia? being scared? fear?). Gender euphoria.\n\n\nBtw. i also think that the military is not a very good place for people from a high-risk >40% suicide rate group with a chronical mental illness. I also don't want someone with Paranoia or schizophrenia there. It should be natural for an army to require people to be healthy in order to sign.\nThat has nothing to do with hating trans people. If i say that a cripple in a wheelchair shouldn't be on the front line, that also doeasn't mean that i hate him.",
				"added": 1565501785
			}
		],
		"1565391114_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 3,
				"body": "FUCK DRUMPF AND FUCK WHITE PEOPLE!\nYou are all terrorists because a shooter posted a manifesto on instagram and someone else linked it on 8ch and it got removed within 15min!\nBut don't think about that radical lefty who tweeted about killing people 24/7 and then shot 37 people in Dayton, goyim!",
				"added": 1565403312
			}
		],
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": [
			{
				"comment_id": 4,
				"body": "It worked fine for me in the past day. \nIf nothing works for you, just consider starting with a fresh zeronet.",
				"added": 1565403711
			},
			{
				"comment_id": 18,
				"body": "At this point it might be better to just relaunch 08chan or migrate to millchan.\nIt's surprising that this change is causing so much problems for some, i can still post in 08chan and see things fine, but its obvious that there are many people who are not able to join back in for some reason.",
				"added": 1565458259
			},
			{
				"comment_id": 20,
				"body": "> [aim64c](#comment_28_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): I will give Acid some time. \nThats good. Immediately jumping ship because one thing doesn't work out for one day is too fast. But you can use millchan or just post here in the meantime. Being able to easily launch another site is kind off the thing about zeronet. And there was even another imagboard on zeronet afaik.\nThe ordinary clearnet sites have no real future, will always get shut down or get into financial problems (probably what happened to voat now) or are honeypots like halfchan.",
				"added": 1565459674
			},
			{
				"comment_id": 25,
				"body": "I tried it with a fresh zeronet instance now too, and the most recent posts i can see there are from before the zeroid switch.\nI think relaunching the site under a different id, with zeroid since the start, would be the best, i will suggest that in /tech/.",
				"added": 1565469434
			}
		],
		"1565403304_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 5,
				"body": "Are you on Windows or on Linux?\nOn windows it ships with an tor instance and it should work out of the box.\nOn Linux you have to setup your own Tor or use the Tor Browser instance by setting \ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150\nin zeronet.conf",
				"added": 1565403903
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 6,
				"body": "/leftypol/ is not modern left liberals, it's tankies and marxists, and they are just cringy.\nThey are just a boogeyman, can savelfy ignore them. They are busy enough with telling each other that the USSR was acutally super good and that those 100 million people actually died because of capitalism",
				"added": 1565404143
			}
		],
		"1565404786_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 7,
				"body": "what did he mean by this?",
				"added": 1565404874
			}
		],
		"1565407828_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N": [
			{
				"comment_id": 8,
				"body": "then how are you able to post?",
				"added": 1565407964
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 9,
				"body": "4chan is compromised since moot sold his users out in 2010.\nIf it wouldn't be, it would have been already shut down by now on one of those many occasions where some shit started there.\n\nThe outrage machine will come again to shut even more down soon... but it's definitelly not 4chan.",
				"added": 1565408597
			}
		],
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": [
			{
				"comment_id": 15,
				"body": "Jews shoad this other jew",
				"added": 1565447268
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 21,
				"body": "Just one more Clinton friend who suddenly dies.\nThe list is getting longer. The establishment and Deep State is not just a meme.",
				"added": 1565463782
			},
			{
				"comment_id": 23,
				"body": "> [myriri](#comment_27_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): So they couldn't just tell them to drop it or overtly influence the case without drawing attention.\nHe already got caught once because the parents of the girl he abused reported it and then 50 other victims went to the police. He got 13 months jail time with 12h day parole per day.\n\nThey were pretty good at shutting that down. Every other person whould rot in jail the rest of his live in an isolation cell.",
				"added": 1565464888
			}
		],
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 22,
				"body": "Dolphines have lungs, they have to get air from time to time, but they have to be in water or they would dry out and overheat and die. Just like whales.\nIn minecraft a dolphine starts to suffocate if he doesn't swim to the surface to get air for more than 4 min or so, and he will start to take damage and die on land if he isn't able to get into water for a few minutes.\n\nMy Dolphins die because they somehow decide to stay underwater and don't swim to the surface, even though that they could just swim up one block to the air.",
				"added": 1565464106
			},
			{
				"comment_id": 24,
				"body": "> [memesadler](#comment_12_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): I had just creative mode'd Dolphin eggs in because fuck that shit\nI will do that too, but just for testing. And then catch on legitimately when i figured out why they commit suicide.",
				"added": 1565465048
			},
			{
				"comment_id": 26,
				"body": "ok bros, i got a dolphin from 1500 blocks away and transported it back with a lead... again... i made the aquarium further away from other lakes now, maybe that was it and he wanted to somehow swim to the other lakes but couldn't, wish me luck.",
				"added": 1565481804
			}
		],
		"1565476547_14E1JL1vsL8CRFjwbrXsXfQ1FFvxp36c1Z": [
			{
				"comment_id": 27,
				"body": "hi Epstein",
				"added": 1565492998
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 28,
				"body": "Smart people tried that in 1939, didn't work out.\nThe side with the better morals, higher standards and most rapid development doesn't neccessarily win.\nEverything that you get for outclassing others is that all the savages get scared and join forces against you and 1000 rats will logically win against one human.\n\nIt took the NatSocs less time to develop and build the V2 from scrach than it took the USSR and the USA to manage to build a working 1:1 copy of it, even though that they had all blueprints and captured engineers.\nWIthout NatSocs we would probably still not have been in space.\nThe Wright Brothers built the firt plane 1903, the first rocket was 1942, the first sattelite was 1954.\nNow what major development did we have in the past 50 years, which is the same timeframe? Internet and smartphones?",
				"added": 1565494936
			}
		],
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 31,
				"body": ">Mr. Friedman has testified repeatedly to seeing thousands of boys herded toward the crematoria, and of seeing trainloads of people unloaded near the ominous buildings. He told of how he and other internees even thought they could tell whether fat or skinny people, Ukrainians or Poles, were being cremated by looking at the color of the smoke.\nDon't you believe the holocaust survivors, goyim?\nYou do know that denying the holocaust is illegal in a dozen countries, right?",
				"added": 1565540800
			},
			{
				"comment_id": 32,
				"body": "a) so they gas themselves just a bit but permanently for years, even thought that they could have easily built proper doors. Everything they needed was available at that time, especially because of the high use of chemical weapons and gas during WW1\nb) thats a list where the USSR claimed that people got murdered, not a list of where the bodies and ashes suddenly dissapeared to\nc) are you doubting the unquestionable truth that holocaust survivors tell us, goyim?\nd) if you are wrong by at least 75%, than that is not an \"estimate\", its a totally made up and fabricated number, the 6 million number was reported in the NYT before the USA even joined the war\ne-f) see c), stop questioning holocaust survivors\ng) 68 campls , ten thousands of people involved, 11 million people affected, but somehow no official order or document, just some paper that someone had to sign during torturement by the allies ... meanwhile we even got documents about the NatSoc nuclear program, about what hitler was saying about the V2 program and about the Madagascar plan\nh) why would you deport them to an area that you consider your own Lebensraum to kill them there, if you have the camps and facilities to kill them on the spot? Seems like a useless high effort of logistics for no benefit and no reason at all. Also everything that the USSR did was commiting the largest mass-rape in human history and make up totally retarded numbers to somehow get an \"we can do the cruelst crimes because those people were bad\" justification. Most so-called holocaust survivors somehow decided to emigrate to the USA or Israel, pretty much none of them decided to join the fun of USSR communism that jewish Bolsheviks established.",
				"added": 1565544557
			}
		],
		"1565542990_1CmgfFAZ5VHekkpKkKAfTX3EcjQjsaKmXR": [
			{
				"comment_id": 33,
				"body": "The admin is just fed up with it. It did not get taken down because of laws, that was just some excuse, there was never any letter of any law enforcement involved. \nSomeone else has to offer to host the site and take the burden off of that poor guy who just wants to retire.\nAll that outrage but nobody here who says:\n>hey bro, i can continue it if you want",
				"added": 1565545688
			}
		]
	},
	"comment_vote": {}
}