{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1577196707_12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe": 1,
		"1577184518_1LHvuxYZmnEjfamgn2jq7cRnp6MpQ5XzHt": 1,
		"1577276871_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1580538058_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1
	},
	"next_comment_id": 41,
	"comment": {
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "There are so many distributions of Linux. Some of these are quite user-friendly, possibly usable by even the most green-handed amateurs.",
				"added": 1577118840
			}
		],
		"1577196707_12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe": [
			{
				"comment_id": 2,
				"body": "Chinese here; just curious how censorship is in India...\nI don't seem to have ZeroNet peers in India though.",
				"added": 1577197982
			},
			{
				"comment_id": 3,
				"body": "> [hozero](#comment_3_12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe): Not much is censored in India. I'm talking about main stream india... not sure about certain conflict areas like kashmir and assam. [...]\n\nI guess it should not be hard to access ZeroNet from India then? Having more users there should also help...",
				"added": 1577202648
			}
		],
		"1576795013_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 4,
				"body": "> [falconixx](#comment_16_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu): maybe it would be a good idea to add a single bottom for every site or person so people can add or remove whoever they want\n\nDid you mean \"button\" by \"bottom\"? There seems to be one accessible at the top right corner of each post.",
				"added": 1577203279
			}
		],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 5,
				"body": "> [draugrdeathlord](#comment_28_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): I just checked and theres nothing there either for me [...]\n\n\"testuser3\" posts stuff on ZeroTalk (here); a search in ZeroHello will do if you have downloaded ZeroTalk. Mind the cases in case the search is case sensitive.",
				"added": 1577554980
			},
			{
				"comment_id": 6,
				"body": "> [draugrdeathlord](#comment_45_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It is true, our western school system is garbage especially since the late 1990s when the classes got to big and multicultural pressures began to necessitate changes to how teachers teach. We also moved more towards mixing boys and girls together in classes and boys in particular suffer during puberty with the distraction of girls around. [...]\n\nDo not get distracted. The post is about Hong Kong. Regardless of how Chinese government possibly works fantastically or miserably elsewhere, it does not do Hong Kong justice.",
				"added": 1577606941
			},
			{
				"comment_id": 7,
				"body": "> [luoyewuheng](#comment_9_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN): 总的来说，中国社会的每一次调控对中国人民来说都是利大于弊，这些制度规则的文字经过第三方过滤后，在西方国家的群众看到的东西就不一样了。在2010年以前，其实很多中国人都向往西方那种自由，其实就是盲目听信谣言；在2013年之后，习近平上任后，一带一路的政策使中国进入了全面开放，中国的发展比以前更快，中国几乎和世界大部分的国家经济发展上都接轨起来，走出国门的人越来越多，同时越来越多海外厉害的华侨愿意回来国内发展，这个时候那些听信谣言的人突然就清醒过来，因为有了对比，发现外面世界也不过如此。在一带一路以前，中国和其他国家的信息对于中国人民来说其实是很闭塞的，现在全面开放了，每年超过1亿的中国人走出了国门，也越来越多的国外游客和高素质的移民来到中国，这样信息也流通了，中国内陆的人也不像以前那样好骗了。香港的教育资源、媒体和法治权都掌握在英国和美国手上，香港的年轻人的结局早就被注定的了。香港事件、台湾事件只会让全体中国人更加团结。 [...]\n\nDo you acknowledge the fact that the police, under the influence of CCP, has been conducting violence against the protesters, some of which are actually peaceful? If you do not, then your argument would only possibly work in your own world. If you do acknowledge the fact, then you are not committed to the universal value, which invalidates your argument for people sharing the universal value.\n\nI respect your opinion though; in fact, I do hope you are enjoying your own life by adhering to your values.",
				"added": 1577610615
			},
			{
				"comment_id": 9,
				"body": "> [luoyewuheng](#comment_10_1F4XjDvKx9Btu5i1CDameaT9BAHQs4QJLN): 所以才说你们活在特朗普政府的虚影下，什么警察对抗议者行暴？你们是否搞清楚那些到底是抗议者还是暴徒/不法分子？那些全是暴徒，不法分子，打人根本需要看对方是谁，西方那边不是很多记者过来？只有被暴徒痛扁后才敢说真话，说真话后马上被美国政府封杀，你们真的有了解过状况？不了解状况就乱抹黑？facebook和推特上还有存在真相？中国用户大部分的账号全部被封杀你们清楚？美帝当初每天给不法分子每人每天提供超过400$怂恿他们游行示威搞破坏这事你们清楚？你们是不是也要睁一只眼闭一只眼？没有美帝后面大力的推动香港会乱成这样？\n\nNice speech. Go on :)",
				"added": 1577620372
			},
			{
				"comment_id": 10,
				"body": "> [draugrdeathlord](#comment_48_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): You can try to make excuses for police brutality, the protesters are trying to protect their way of life, you can call their way wrong all you want but thats what they want and china should respect that. [...]\n\nTake it with a grain of salt; after all it did take centuries for people to wake up from their medieval dreams. It is even possible to argue that Satan is beneficent just because it exists.",
				"added": 1577621815
			},
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1426_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): To all Hong Kongers:You have allowed for too long, bad actors like CIA, MOSSAD and the ZIONIST\" [...]\n\nDon't you worry; in before it becomes the illuminati and the sun people.",
				"added": 1577632303
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 8,
				"body": "North Korean nuclear missile launch site :P",
				"added": 1577614621
			}
		],
		"1577801669_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 12,
				"body": "happy new year and viva la revolucion",
				"added": 1577884380
			}
		],
		"1579972649_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 13,
				"body": "Usually people just adhere to a bare minimum set of values (perhaps the Universal Value) and tolerate whatever that does no real harm...",
				"added": 1580043301
			}
		],
		"1580070228_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 14,
				"body": "As far as I know, flax seeds are simply very healthy foods that would make one healthier in the long run. Unless one immediately needs ALA for immune system, I do not think that flax seed would be specifically beneficial for the coronavirus.",
				"added": 1580098784
			},
			{
				"comment_id": 15,
				"body": "> [lightingball](#comment_12_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK): My father believed that alcohol cures coronavirus and drinks more often. There's even some scientific evidence that alcohol can be used to kill virus.\n\nMedical grade alcohol works by denaturing the coronavirus... I think drinking additional alcohol does not help.",
				"added": 1580113832
			},
			{
				"comment_id": 17,
				"body": "> [orien3242](#comment_41_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): pro-tip: death can help prevent you from catching the new and improved coronavirus [...]\n\nand obviously you can offer the \"cure\" to other people in this way",
				"added": 1580294182
			}
		],
		"1580201314_14eUd5go4Khv6h8RzQaX7ofB2iXWPQwrg2": [
			{
				"comment_id": 16,
				"body": "> [somuchfood](#comment_78_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk): Also, do you think they deliberately created it for depopulation of elders?\n\nAlthough I am not fond of CCP myself (I am Chinese), I don't think the virus is of artificial origin.\nAlso, I don't think the real data is even remotely tractable, since the virus spreads too rapidly and sometimes causes few or no symptoms. I would compare this to some more severe variety of the common cold.",
				"added": 1580293850
			}
		],
		"1580432007_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi": [
			{
				"comment_id": 18,
				"body": "Given how easily the virus spreads, I am almost certain that it is way out of control. IMO the best we can do is to keep quarantining people with more severe symptoms, thereby forcing a natural selection to lower the severity of the virus.",
				"added": 1580458861
			}
		],
		"1580551763_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 19,
				"body": "Just checked the forum and it is still alive",
				"added": 1580553122
			}
		],
		"1580538058_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 20,
				"body": "Thanks for sharing these information!\nIMO this is still inconclusive; could it be that it infected some hosts (might be non-human) with HIV-1 and acquired the new insertions?",
				"added": 1580557230
			},
			{
				"comment_id": 21,
				"body": "> [testuser3](#comment_78_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): It is clearly designed, the possibility of acquired is too tiny.  Twitter @halliburton50\n\nI agree that the possibility is very small, but this does not constitute a solid proof without an evidence linking it with bio-engineering activities. Virologists should definitely research more on this though.\n\nI am much interested in this and more input is welcome.",
				"added": 1580621627
			},
			{
				"comment_id": 23,
				"body": "> [aspidochelone](#comment_349_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): invaded \n\nI am no virologist or biologist, but AFAIK the DNA of HIV-1 *is* transcribed back to RNA (by host's own cells) when replicating. Maybe some mishap occurred during that stage and the RNA of HIV-1 got inserted into the coronavirus... but then, if what you have said is true, the coronavirus would still be detached from the cells, thus, intuitively speaking, whatever happened should had extremely low likelihood.\n\nOn the contrary, it would be relatively easy to bio-engineer such insertions; furthermore, some Chinese researchers have released SARS-CoV from their lab back then, so it is highly likely that it is man-made. Though, given that nature itself had accomplished the improbable countless times, we do need some piece of evidence from the researchers allegedly responsible for the supposed release.",
				"added": 1580733600
			}
		],
		"1580721027_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 22,
				"body": "I would be against copyright and anti-plagiarism system if the profit factor is disregarded; that is, assuming that one does not plan to financially profit from his intellectual works. The evaluation of an intellectual work should not include the judgment of its authors, hence credits or acknowledgments are irrelevant or even detrimental for this purpose. Indeed, having a copyright system generally adds a considerable workload to content creators and hinders content creation.\n\nCurrent copyright systems on music, videos, et cetera seem to be for profit though. It somehow works but I speculate there are better systems.",
				"added": 1580732633
			},
			{
				"comment_id": 27,
				"body": "> [blurhy](#comment_344_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): I started IPZN project (i.e. next-gen zeronet) for anti-copyright since it's hard to do something in the real world, but it's definitely feasible in the cyber world [...]\n\nYour project seems to be a ZeroNet-like GUI for IPFS, which should be appealing to existing ZeroNet users. What other new functionalities are you trying to accomplish with IPZN? Is it possible to systematically integrate IPFS within ZeroNet?\n\n(This is getting off-topic honestly :P)",
				"added": 1580975352
			},
			{
				"comment_id": 28,
				"body": "> [blurhy](#comment_346_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): IPFS has enough functionalities to replace ZeroNet, but it's very hard to use so few people understand this point.However IPZN is aimed for anti-censorship which means it should be more resistant and robust.So I thought of integrating various protocols including IPFS, Zeronet, BT etc. into IPZN. As you know, the situation in China is serious.Integrating IPFS into ZeroNet is not good a idea because ZeroNet, compared to IPFS, is redundant and outdated but can be useful to make IPZN more robust.I'd keep IPFS as the main protocol used by IPZN. [...]\n\nFunctionality-wise, IPFS and ZeroNet are inter-reducible (at least for the core functionalities), since one could distribute files in form of ZeroSites and vice versa. Their utilities depend on the number of users, thus if your assessment is that your effort could assimilate a great number of users for IPFS, then by all means try it.",
				"added": 1580986786
			},
			{
				"comment_id": 29,
				"body": "> [fractalzoomer@kxoid.bit](#comment_13_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): take \n\nTechnically crediting is still possible through authentication methods like signatures... however, it seems impossible to provide economic incentive to independent creators. I am thinking of protocols such as commitments; while trust systems for cryptocurrency are well-developed, I cannot think of a way for content creators to ensure that their product is \"useful information\" for consumers.\n\nI am no expert in cryptography and protocols as for now, so please notify me where I am misinformed.",
				"added": 1581091245
			},
			{
				"comment_id": 30,
				"body": "> [blurhy](#comment_348_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): The principle of distribution in communist society is “from each according to his ability”and “to each according to his needs”.\n\nIt makes sense for traditional commodities and can be realized when production cost tends to zero. The same should apply to intellectual works if one is to profit from them, since the marginal cost of producing copies of the same piece of classical information is extremely low. Therefore, in the sense of average profit, selling truly valuable information would be undesirable (there is huge incentive for individuals to share the information if they have positive externality, which is often the case), and \"communism\" is automatically achieved.",
				"added": 1581143554
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 24,
				"body": "> [kaffie](#comment_1127_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): k\n\nThe fact that we can actually *see* all the bogus posted by Western media immediately proves that it is much more superior than the mainstream Chinese media.",
				"added": 1580741678
			},
			{
				"comment_id": 25,
				"body": "> [testuser3](#comment_76_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): The Chinese gov CCP's goal is to great reduce their population so that can resolve the Chinese social contradiction and save gov's power! And then full controlling all of their people even the world for ever!CCP wants to use climate war, biological war, and geographical war to recover Taiwan. When it kills half of the Taiwanese,it will belong to Beijing!\n\nTrying to pinpoint CCP's goal is futile; I doubt if they are even efficient or organized in any fully centralized way, and they would probably simple-mindedly deny all theories anyway. A simple strategy for us is to assume the worst and prepare for that...",
				"added": 1580745305
			},
			{
				"comment_id": 26,
				"body": "> [testuser3](#comment_83_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): yeah, but CCP always can organize and full centralize efficiently, you can search their history\n\nMy take is that most people in CCP find their position valuable for their personal gains, and will take whatever measure to maintain the status quo. Thus the efficiency we have observed should mostly come from the fear of losing their positions. This may explain their cover-up of truths about coronavirus and their ridiculous transition to being apparently very committed to contain the epidemic once awareness rises.\n\nOfficials in CCP would never want to be blamed upon, and when every single of them act this way, God knows what chaos it can cause.",
				"added": 1580807234
			}
		],
		"1581744611_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": [
			{
				"comment_id": 31,
				"body": "I would treat this poster as some promotion for these software, and their safety only increases now that more people are aware of them.",
				"added": 1581753155
			}
		],
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 32,
				"body": "One (joke) approach is to start a state-level internet censorship, like the one in China right now. Then people will start utilizing VPN and proxies for circumvention and privacy.\n\nAnother is to promote BitTorrent-based file-sharing and free libraries. However, this would be less appealing to gamers, since most high quality games are protected by DRM.",
				"added": 1581788696
			}
		],
		"1583235865_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 33,
				"body": "They just want to multiply and survive and that is all.",
				"added": 1583401012
			}
		],
		"1585399613_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 34,
				"body": "For pornography (and other video content in general), it might be possible to create them in a way without interfering other people at all utilizing advanced technologies (such as GAN and its variants). In other words, simulate the reality in some extent. We need researchers to bring such technologies into light, and that requires us to respect sex workers and stop regarding voluntary pornography production as taboo. Unfortunately this obviously demands a lot from the government (mostly law enforcement). I have yet to look into the literature to remotely grasp an idea what could be done in this regard, but this is certainly unlike dealing with drugs. (I do not think drugs can be easily counterfeited with any technological advancements coming soon; additionally, consents are not required from drugs themselves to be smoked by anyone)\n\nI do not believe there is a way that targets specific content in a sufficiently \"well-behaved\" decentralized network without compromising complete freedom or availability; given how changing one single bit could completely scramble the content upon encryption, once there is a method to take a particular content down, it could be abused against any other content. Hiding the content would also be futile if the demand is high enough.",
				"added": 1585586963
			},
			{
				"comment_id": 35,
				"body": "> [pepepanela](#comment_3_1Ab3JF91st5kW9WUgKdAcCNZp2E1vYALtT): I don't see anything wrong in having \"Nth Rooms\" flourishing all over decentralized networks like this. There is no real crime on that, they're just bits of data moving around computers. Transmitting controversial content doesn't harm people at all,  no victims are affected.The only problem in this world is bad parenting, those real people harming  little children and then exploiting them. The solution is not allowing idiots to procreate and bringing children to this rotten world, those people that don't take any responsibility of their heinous acts.  [...]\n\nThe problem with \"Nth rooms\" and \"Red rooms\" is that they allegedly harmed other real persons during production. I agree that, without this part, they are indeed merely data between terminals. When the production actually involved other real persons, ethical issues go completely haywire, as some ethics theories would actually blame the oppression upon the victims themselves (perhaps something related to the term \"idiot\" and such in your post).",
				"added": 1585625227
			},
			{
				"comment_id": 36,
				"body": "> [blurhy](#comment_376_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): It depends how many people and who are using the network mainly, so the such demand won't be a large portion\n\n\"Demand\" here refers to the demand to pornography as a whole, since it is reasonable to assume that users would first search for an index of pornography that is already well-maintained and comprehensive. By the time of writing I have not conducted a survey in the literature about estimates of pornography demands; however, judging how Pornhub flourishes, pornography demands are far from negligible.\n\nCurrently the vast majority use the clearnet. For generic users, they turn to decentralized networks when they find their demands hard to fulfill in clearnet. If you actually want to regulate some type of contents, it might be more effective to simply bring them into the clearnet where censorship is actually possible, though laws need to be rewritten to decriminalize the contents themselves.",
				"added": 1585626638
			},
			{
				"comment_id": 37,
				"body": "By the way, there should be complete freedom among any form of anime pornography (and any other anime contents), as long as drawing anime does not involve oppression (for example, rearranging other people's body parts so that they make a decent substitute for high-end drawing devices)",
				"added": 1585627350
			},
			{
				"comment_id": 38,
				"body": "> [blurhy](#comment_378_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): For example, there're a lot of Chinese users on ZeroNet, that is not only because of the demand of porn, but anti-censorship. As the dweb develops, it has much more features, and decentralized github or what can be anthoer reason why we use it, not just for porn. The influence of dweb increases, and illegal/unethical things should be reconsidered [...]\n\nThere is no unethical information or data (unlike the actions behind their production or consumption), and, since the very purpose of decentralized network is to defeat censorship which is usually alongside law enforcement, it is not sensible to pursue legality there. Therefore, if anyone wishes to exercise censorship, surveillance or regulation on a type of content, it must first be driven to the clear net, and it is definitely possible. For example, tobacco poses serious public health concerns, yet its usage is generally not criminalized (at least in personal spaces), hence the market remains relatively tractable (I am not aware of any user who enters dark web to specifically purchase tobacco) and regulation is possible.",
				"added": 1585636220
			}
		],
		"1585616782_1BpmfrtYDwDy6ERRr8jLb5mavzRuTrVcKv": [
			{
				"comment_id": 39,
				"body": "If only a fraction of bitcoin miners join this project...",
				"added": 1585638814
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 40,
				"body": "Apparently we have conspired with the UNSPEAKABLE",
				"added": 1590085235
			}
		]
	},
	"comment_vote": {
		"20_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"22_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"3_12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe": 1,
		"5_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"41_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"16_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh": 1,
		"43_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"35_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh": 1
	}
}