{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 1,
				"body": "xscape2net you're not welcome here in this thread, spread your nonsense on you own thread or on twitter, where people believe your lies.\n\nNo one should anymore even discuss about \"this study says\" and \"expert X says\".  It is all just distraction. The conclusion is it is all bullshit. It is just about control the people and put them into a dystopian nightmare. Made them into slaves or maybe even kill them outright if possible. There is no other reason.\n\nThe only question is how to stop it? How to organize something which is effective against the beast?\n\nDisclaimer: I'm talking about the Minecraft - Taliban expansion pack in the following:\n\nDemonstrations do not work.Voting does not work. According to the Minecraft-Taliban violence is a way. But I don't see things happen here in the Minecraft west and there are no Minecraft people willing to die for a cause.\n\nThe Minecraft government and the Minecraft media is the enemy of the player. Harm them and they will start to negotiate with you like they do with the Taliban. Take people hostage, destroy property and they finally will see you in the minecraft world. They will realize that you're an existing being which means something to them and they can not ignore you. \n\nBut stay on demonstrations,voting and etc. and they will just laugh at you because it does not cost them anything than peanuts to pay the goons enforcing their order.",
				"added": 1629492539
			},
			{
				"comment_id": 2,
				"body": "jeff: Very close. But it is more a matter about on mind your own business. \n\nYou take your vaxx and wear your mask? Ok, I'm fine with that. But I should do the same because you think it is good for me and I'm responsible for your health? I'm spreading a deadly disease? Can you prove that? Oh I have to take a test, so that you can prove I might make you ill. So you're making the test and then you say I'm ill and have to go into quarantine. \n\nHow about I make up a test which proofs that a vaccinated person is spreading an even more deadly disease then I supposed to do? \nNow take that fucking test because I say so and if my test says you're ill I demand that you have to be killed because there is no cure for this disease. How do you find that you moron(people like xcape2net)? Would you do that?\n\nOf course you would not. And why is that? Because you don't trust me and I'm not your master and you not my slave.\n\nAnd the same goes to the medical industrial complex and the media and the government. I just don't trust you guys. And I'm not your slave.",
				"added": 1629493642
			},
			{
				"comment_id": 3,
				"body": "we will see.Thanks for leaving.",
				"added": 1629495138
			},
			{
				"comment_id": 4,
				"body": "Who wants to live around people who accuse you of making them ill, if you don't do as they told?\n\nThey upheld no proof of their accusation other then speculation on statistics. If someone has a cough you may tell him to please not cough into your direction or cough into his hand or elbow. If he refuses you can leave. No one forces you to stay around other people.\n\nAnd if you are in a situation where you can't leave you have to accept that life has a risk every time and there is nothing you can do to stop another person from breathing unless you want to kill him. And that would make you the killer not based on speculation but on facts.",
				"added": 1629495778
			},
			{
				"comment_id": 5,
				"body": "> [elr23423nksdasd](#comment_9_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP): Name a person that took the vaccine and died from the virus.\n\nI know one and his name was Stupid Cunt.Out!\nIs there a way to discuss this without this trolls or vaxx shills?",
				"added": 1629529215
			},
			{
				"comment_id": 6,
				"body": "> [tamilan](#comment_30_1NRVBTxrbgEFdVBNLczx4Cc6NV3H4Pykzc): This guys calling others [...]\n\nWhy are you even here? Go back to your herd.",
				"added": 1629567534
			},
			{
				"comment_id": 7,
				"body": "> [jeff](#comment_141_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Israel is now experiencing Antibody Disease Enhancement. Those inoculated with the vaccine become hypersensitive to the virus. When exposed to it in the wild, their immune systems go crazy and start attacking their bodies. The outcome isn't pretty. I don't have any names for you now, but it shouldn't be long before they're plentiful.OTOH, we already have numerous deaths directly attributable to the vaccine.\n\nThank you jeff for pointing out. But you are wasting your time on these shills and NPCs. \nThe time for discussions is over they are not able or immune for rational thinking. They just cannot see what they are doing to this world day by day. They don't see how people suffer because of all this hysteria and tyranny going on.\nThis was my initial question: Why can't these people see the tyranny? \nObviously we have some answers here and elsewhere in the internet and IRL, but they do not convince them.And the powerful will not listen or help us with this. They are the enemy.\n\nThe only way they left us is force not conviction.But only highly organized force will do something.\nSo I should change my question to how can we organize to crush the establishment around the globe?\n\nHere is the only place to discuss this, because they cannot shut it down.But they are still able to spam every fruitful discussion, that maybe needs to be overcome first.\n\nI hope that someone smarter and more able reads through all this and is inspired to do something about it in case I fail on this. I can only pray and hope that we can get out of this dystopian nightmare and change the future to the better.\n\nPlease, if you know some smart and like minded people who are on our side invite them to this place to help the cause.",
				"added": 1629571853
			},
			{
				"comment_id": 8,
				"body": "> [leonarddurden](#comment_9_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): If your question is how do some see the truth and some are deceived it boils down to one thing and one thing only, having or not having a bull sht detector. I wrote this in another post also, \"How do you know which \"facts\" are real?\" Here is my response to come against it for YOU. Want to know how YOU could pick up YOUR very own BS detector? Well to protect your heart & mind from being deceived keep reading. \"How do you know which \"facts\" are real?\" It's simple (not easy for some). Old idiom, consider the source (connect the dots of the people disseminating the information). Discovering motives & agenda are key. QUESTION EVERYTHING! Also, follow the money/policies passed (and who writes/passes them). When you pay attention and look at all the sources/content OBJECTIVLY and DO NOT get sucked into taking a side then it's blaringly obvious what is fact and what is propaganda to know what is real. Do your own research and don't be lazy believing click bate headlines or clips. Their playbook is taking real and very personally issues and exploiting them by gaslighting and pandering to distract & divide through fear from what THEY are doing. When evaluating data you have to check your own echo chamber and past hurts at the door (or heal from them) to see through the fog. When you make it personal or allow your emotions to drive your analysis/discernment over logic than you become an activist placing your pronoun in your signature or saying f*k the world. Also, seeking popularity and trying to fit into a club/group only opens yourself to deception, but being a lone wolf is even worse. Being different means you are brave enough to be yourself. Also, I would recommend seeking what Jesus/God says about your identity.\n\nLook,this is what i meant with \"They can still spam us\". You cannot have a serious discussion if you get spammed all day. Has anyone an idea how to have a real discussion? I only mean people who agree with me on this nightmarish dystopian thing which is rolled out in front of our very eyes. Please only the people who can see it, not the other ones. Thank you.",
				"added": 1629578800
			},
			{
				"comment_id": 9,
				"body": "> [leonarddurden](#comment_11_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): I agree with YOU! (besides the force part that won't work but I have a way). [...]\n\nYou may agree with me. But all I get from you is gibberish that can only be seen as distraction thus sabotage of this thread. Have your own Fact checker - I believe in God - Do your own research - Follow the money - whatever bullshit thread.\nBefore you don't came up to the same conclusions I did - Go fuck yourself.\nNEXT",
				"added": 1629618771
			},
			{
				"comment_id": 10,
				"body": "> [n0tab0t](#comment_1_1MS5E2kZazXHa3Vj2DiKy5MYg5fL5qR3AY): By this same logic, if someone enters a conversation, having already been coughing before they join in, it should make sense that I can ask them to leave since \"no one forces you to stay around other people\", right? If they're allowed to stay, are they not infringing upon a conversation they were not originally part of? Furthermore, is there or isn't there a difference between \"breathing\" and coughing within close proximity of someone?\n\nI hope all like minded people can see it. This is not sustainable. It is the same reason Hitler needed the SA to throw out people who just wanted to disturb his speeches, so that nobody could hear what he wanted to say.\n\nFortunately on the internet you need no force to throw out people who sabotage everything you can just ban them.",
				"added": 1629622747
			},
			{
				"comment_id": 11,
				"body": "> [n0tab0t](#comment_2_1MS5E2kZazXHa3Vj2DiKy5MYg5fL5qR3AY): I'm sorry, how does suppression of speeches relate to this? Like, I understand that hypothetically, a person who happens to be coughing may be really adamant on talking to others in-person, but is wanting space from someone coughing the same as wishing to disregard their words? Couldn't a compromise be made, such as talking from a further distance, communicating via phone or internet, etc?\n\nNo. This is not how you can live in a stable society. In order to trust other people.But any way sometimes it happens that the society falls apart and it gets us vs them.Now we are here. So get the fuck out.",
				"added": 1629626704
			},
			{
				"comment_id": 12,
				"body": "Maybe I should say it again: I don't care what people think who bought into the hoax. You can talk all day long how the unvaxxed are responsible for all the evil is going on on earth and so on. I don't want to talk to you. You have your opinion and I have mine.\n\nInstead I hope to find people who are already aware what is going on. Maybe someone should launch a club or association for unvaxxed people and covid non-believers. They could form these associations regional and on a global and international scale to work together.\n\nAll people who are:\n-Not vaxxed, because the are not able or do not want to\n-regret being vaxxed and want to inform others\n-people who hate nanny states govern us every little thing which should be up to us\n-not security freaks\n\ncould join it.\nTogether these people could make discussions and demand what they want to the world. These are millions.If they get organized their voice will be heard, because together they can have a high influence on the society.\n\nThanks obrien1984 for your comment, it was very useful.\nleonarddurden stop writing so much gibberish.You said no one will read through what I have written but you yourself write a shit ton of defeatism.",
				"added": 1629829153
			},
			{
				"comment_id": 13,
				"body": "This thread is still here.Discuss if you want end the tyranny.",
				"added": 1629978063
			}
		],
		"1629992488_1DHdyMN6LWgXtjYbLb9PB5dqq2b75jdVs6": [
			{
				"comment_id": 14,
				"body": "There it is:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1629402955_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE/Why+can+t+people+see+the+tyranny+of+the+covid+hoax",
				"added": 1630101333
			}
		]
	},
	"comment_vote": {}
}