{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1559864058_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "> [tripko](#comment_4_12t8UU6dt2yKnziqQ5NwPSYPtdcdW3rcXW): he was a leader of the national socialist...socialism is a sick structure that leads to totalitarian statesbankers finance it because the elite loves to rule the lower class people\n\nthats not true, socialism dont work, marx was an satanist, the socialism was made to be failed, hitler invented the socialism again and made it work, \"youre know something, you are something\" - \"kannst du was - bist du was\" . Hitlers socialism worked and it was fantastic.",
				"added": 1560009690
			},
			{
				"comment_id": 2,
				"body": "> [whitewolf](#comment_1_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): what is this Holocaust you speak of?\n\nYes thats a good Question. Watch the Video \"6 Million\" on Youtube, it says that in American News Articles that Germans and other killed 6 Million jews during 1. world war.....1 World WAR..... so before Hitler Jews tried to lie on people. Jewish critics and antisocialist wich wanted a free america are all dead on the titanic wich exploded because the engine was a ticking bomb, the jews controlls media and the bank, the holcaust was a lie to give the jews more rights and prevent the german to start the 3rd war",
				"added": 1560010006
			},
			{
				"comment_id": 3,
				"body": "> [336](#comment_1_1EPJkJGMC18Hg48vMtqhd5ubnBEMz9vsQk): And to add to that ... we've all heard of the Holocaust by now. But I'm sure most people have never heard of the Holodomor in Ukraine (~10 million deaths by forced starvation from the Soviets; 1932-1933), the Armenian genocide (~1.5M by the Young Turks; 1915), rape of millions of German women and girls AFTER the war, death of ~2.5M million of German people AFTER the war,  and the ~100 millions of deaths by communist regimes.\n\nBut every American knows that European killed 6 Mio Jews during first World War. Every News Article was full with Lies that European kills jews in 1 World war, just watch the Articles, somebody made a Video called \"6 Million\" on youtube, it shows all know newsarticle with Jewish propaganda (New York Times, The Sun etc)",
				"added": 1560010172
			},
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_204_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): no socialism can't work and will never work. [...]\n\nYes, socialism dont work, but Hitlers type of socialism worked = Nationalsocialism. Like i said he invented it and made it work, would he win the war, Europe would be the strongest and richest State ever.",
				"added": 1560173499
			},
			{
				"comment_id": 8,
				"body": "> [tripko](#comment_5_12t8UU6dt2yKnziqQ5NwPSYPtdcdW3rcXW): Sorry, not right. Hitler was implemented by the Occult Secret Society Skull & Bones from Yale, they even boast about this fact:Quote: \"Die Bonesmen hatten sich mit Hitler einen netten Hurensohn herangezüchtet. Schon vor der Machtübernahme hatte die US-Botschaft Anfang der 30er Jahre nach Washington Fragen nach dem finanziellen Hintergrund von Hitlers aufwendigem Wahlkampf und der Bewaffnung seiner Privatarmee von 300.000 Braunhemden gekabelt. Den Mitarbeitern war aufgefallen, dass die SA mit Waffen aus amerikanischer Produktion ausgestattet war. Der deutsche Stahlmagnat Fritz Thyssen hat später zugegeben, in das Hitler-Projekt seit 1930 investiert zu haben - seine Vermögensverwalter und Banker in dieser Zeit: Bush und Harriman.\"Check it here: https://www.heise.de/tp/features/Skulls-Bones-Bush-3452704.html [...]\n\nYes, the Americans invested in Hitler, the goal was that germany start a war again, the americans wanted to steal all patents from germany, its the most inteligent country of this planet. The americans gave hitler all the money to rule germany, after he decited to ban all jews from germany america started a war to germany, hitler wrote 49 peace contracts to them but they wanted the jews back in germany. Hitler wrote the britain many peace contracts too but they were ignored. \n\nHitler lost the war, the amercans stole all the gold and all the patents from germany and the rest of the german solders they kill in the \"Reinwiesenlager\" they said it was jews who was killed by germans but it was german solders killed by americans and french. It was a mass of death, an holocausts of the germans. \nhttps://archive.org/details/OtherLosses_201608",
				"added": 1560175357
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "4,5,6",
				"added": 1560010245
			}
		],
		"1559759030_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 5,
				"body": "Julian Assange = payed agent\nEdward Snowden = payed agent\nsince 1950 we all know that ALL phone calls are recorded by us govourment, just inform urself",
				"added": 1560010519
			}
		],
		"1560035677_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 6,
				"body": "Here u can find Windows 8.1 till Windows 10 Releases\nhttps://tb.rg-adguard.net/public.php\nHere u can find all Software Microsoft ever released:\nhttp://the-eye.eu/public/MSDN/\nFor other O.S use WinworldPC or Torrents",
				"added": 1560088019
			}
		]
	},
	"comment_vote": {}
}