{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1577775629,
			"title": "Anyone here tried Fidonet?",
			"body": "It's actually more active than this shithole, lol (at least when not considering schizoposters)",
			"added": 1577775628
		},
		{
			"topic_id": 1577893728,
			"title": "Anyone else become a grumpy old man too early?",
			"body": "I'm low 20s. But I can't stand most things.\nI can't stand women doing their feigning surprise thing. I can't stand their enthusiasm about the most superficial things. I can't stand small children. I can't stand old women dressing like they were 30. I can't stand a lot of stupid shit people do and say. Anyone else?",
			"added": 1577893726
		},
		{
			"topic_id": 1578044704,
			"title": "I'm starting to believe in karma",
			"body": "First I hear somebody bitch to their family about not going to inherit a house. Literally the next day the owner of the place he's renting warns him he's going to sell the property and going to have to kick him out.\nThen I tell somebody online I hope he gets spied on through his smart TV camera. Literally next day my neighbor installs a security camera pointing directly at my backyard.\nIs it possible there's something more to existence than atoms and sheer luck?\nThe only reason I'm not fully sold is that in Mexico some cop speaks out against the cartel and next thing you know his 14 yo son is being flayed alive. That doesn't feel like something that would happen if karma was a thing, unless there's karma but also separately horribly bad things happen to random people who didn't do anything wrong? Or maybe the guy did do something horrible to someone or something we don't know about? How come vegans don't have ridiculously easy lives? Or do they? After all Hitler was a vegetarian and Germany alone almost won WWII. But then again other vegetarians have their children die and are sued for inducing malnutrition.",
			"added": 1578044701
		},
		{
			"topic_id": 1578154157,
			"title": "Is there a better alternative to ZeroNet?",
			"body": "Is there an alternative forum or board system to ZeroNet that actually is uncensorable by any site owners? I don't want nofish being able to nuke all my posts from existence whenever he feels like it.",
			"added": 1578154153
		},
		{
			"topic_id": 1578225013,
			"title": "Whatever happened to Gitcenter's ZN fork?",
			"body": "When is it coming out?",
			"added": 1578225008
		},
		{
			"topic_id": 1578229178,
			"title": "Finding active Usenet and Fidonet groups",
			"body": "Anyone knows how to find the most active Usenet and/or Fidonet groups? Even if it's just a static list ranked by last message date, total number of messages or something like that.",
			"added": 1578229172
		},
		{
			"topic_id": 1582104346,
			"title": "I want to be on the ZeroNet movie",
			"body": "Put me in the screencap",
			"added": 1582104339
		}
	],
	"topic_vote": {},
	"next_comment_id": 62,
	"comment": {
		"1577708242_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 1,
				"body": "Fuck off lol, I purposefully tried to get myself banned on 4chan and only managed to stop them from letting me post pictures.\nAlso, did Terry Davis fake his own death and become an atheist, or did you get posessed by his spirit?",
				"added": 1577735136
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "> [randomshits](#comment_359_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): But that's not what I mean. Take ZeroVoat which is what Zeronet has closest to Reddit. If a ZeroVoat troll gets muted or placed on a blocklist people subscribe to , their content will also vanish from ZeroTalk. [...]\n\nBut their content is only deleted from the machines of those who decide to block him... I see nothing wrong with that. Only improvement could be to add something to let us hide/de prioritize people while still seeding their content.",
				"added": 1577735581
			},
			{
				"comment_id": 3,
				"body": "> [quantumkitty](#comment_288_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): The culture war peaked in early 2019 with the Mosque shooting yeah. But it's now practically dead. I don't think any sane human being wants to side with the Left or the Right in 2020.\n\nMaybe we just became old.",
				"added": 1577735618
			},
			{
				"comment_id": 4,
				"body": "> [quantumkitty](#comment_290_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I knew the culture war was over the minute socialists on Reddit started to hate me and downvote me because I believe in giving people free money.\nDidn't Marx believe welfare only delayed the dictatorship of the proletariat from happening?",
				"added": 1577736243
			},
			{
				"comment_id": 5,
				"body": "> [randomshits](#comment_364_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Don't worry, their endless banter won't stop their receding economy, the drastic inflation of medical and living expenses, the stagnation of wages, and the overwhelming pileup of debt. A UBI would just show the world how bad the state of the American economy really is. They have to give money away because unhindered capitalism has reached the limits of inequality to an extent that the average American has lost their buying power.\n\nThe government prints money and gives it to the rich, though.",
				"added": 1577737204
			},
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1456_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): stop with thatYou know that's not true.things are much more complex than that.if you can't think for yourself, why throwing stupid things like that,that will help who?I've worked for very rich and powerful people and they, like us, are stuck in a reality 'they can't stand'.you don't own a society.\n\nI'm simplifying it so everybody can understand it. But the reality isn't much different than that.\nEssentially the government and private companies are ever more indebted with the Fed thanks to its money printing, and that money is spent on products from big corporations like Lockheed and subsidies to companies like Tesla.",
				"added": 1577738590
			}
		],
		"1577725951_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 7,
				"body": "> [draugrdeathlord](#comment_87_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): It automatically raises though ? In that case it won't prevent that. Text doesn't take up much space anyway.\n\nIt doesn't increase automatically. The admin regularly runs a script that increases it whenever it's running out.",
				"added": 1577738687
			}
		],
		"1576215313_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 8,
				"body": "> [thetruth](#comment_35_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): To all commenters, I would appreciate you staying on the topic, share your experience and not drifting away, subject to a new thread, thanks...\n\nkys",
				"added": 1577775394
			}
		],
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "> [fke13](#comment_81_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): That's a temporary phenomenon, just like the early clearnet was for the intelligent ones that seek new opportunities. The actual problem that ZeroNet will have and may be does not yet have that much is the lack of personalized search engines that actually work on the person's own computer and truly serve the person. Those will probably not be popular too soon, because those would need their own machine due to high CPU-load and high IO-traffic, unless someone sells those as separate appliances that can be attached to LAN or creates a special Linux distribution that installs some per-configured version of the personalized search engine. I believe that old laptops will make great personal search engine appliances. The main issue will be that almost all laptops are with an Intel or AMD CPU, which can self start to impose censorship through the \"trusted/secure zone\" mechanism, where the Intel CPU is actually running MINIX3 operating system at the \"secure zone\". [...]\n\ntake your meds",
				"added": 1577775739
			}
		],
		"1577775629_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 10,
				"body": "> [draugrdeathlord](#comment_106_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Fetch boy !If this is a shithole then wtf are you doing posting here ?\n\nI'm into scat / kink play",
				"added": 1577775874
			},
			{
				"comment_id": 11,
				"body": "> [draugrdeathlord](#comment_107_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): The day of the rope is coming for those who engage in such degeneration\n\nWhat a regressive shitlord lol",
				"added": 1577776059
			},
			{
				"comment_id": 12,
				"body": "> [draugrdeathlord](#comment_108_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Oh, sorry Il use something futuristic. You will be tossed into an uncharted wormhole\n\nPlz don't hurt me. I was just shitposting",
				"added": 1577776554
			},
			{
				"comment_id": 13,
				"body": "> [draugrdeathlord](#comment_109_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Reddit culture likely suit's anon05 better.\n\nYeah? How is it? You sure sound like you know a lot about it.",
				"added": 1577778582
			},
			{
				"comment_id": 14,
				"body": "> [draugrdeathlord](#comment_111_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Sounds like a splendid well managed project filled with lovely people\n\nYet it's older than the Internet and managed to keep running to this day while being volunteer run. I'd say it's quite remarkable.\nAnd it also could keep going even if the Internet goes down. Node operators can use the phone lines, radio or even physical delivery to share data between nodes. ZeroNet could kinda do that too but you would have to set up local trackers everywhere, it's probably not as bandwidth optimized, there's no pre-determined links between nodes or transfer schedules, it has never been tested that way, etc.",
				"added": 1577807725
			},
			{
				"comment_id": 15,
				"body": "> [quantumkitty](#comment_305_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Apples and oranges really. ZeroNet is not ZeroTalk anyway.\n\nThat's like saying horses and cars are apples and oranges. Sure, they're different, but they also kinda share the same purpose (personal transportation, or in this case world wide data communications).",
				"added": 1577807971
			},
			{
				"comment_id": 16,
				"body": "> [randomshits](#comment_376_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): See BootStrapper and AnnounceLocal plugins\n\nFair enough but let's be honest, if SHTF good luck finding people running ZeroNet in your city and regularly establishing a LAN with them and hoping he does the same with others. Whereas with Fido all you need to do is dial your local BBS's number and hope the sysadmin can phone other BBSs too.",
				"added": 1577811808
			}
		],
		"1577853034_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": [
			{
				"comment_id": 17,
				"body": "Guys, especially SV hipsters, stop this meme. Nothing scales until scales. Windows 3.1 wasn't designed to scale, yet now you can run supercomputers on Windows. Wait until it stops scaling and change it so it does.\nJust don't wait until the last day of not having any hardware update path before changing your software architecture, but don't worship \"scaling\" as a God up there with \"scrum\".",
				"added": 1577894112
			}
		],
		"1577893728_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 18,
				"body": "> [lianna](#comment_99_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): My family always calls me grumpy for not buying into the whole Marvel/Star Wars/Doctor Who spectacle shitshow. [...]\n\nYeah I don't give a shit about movies and stuff. Don't forget Game of Thrones.",
				"added": 1577898008
			},
			{
				"comment_id": 19,
				"body": "> [re4tsf9e](#comment_56_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): It's funny reading this. Could you just be having a bad day?\nYeah but it's like this most of the time.\n>Do you expect too much?\nNo I already accepted most things in life suck.\n>You'll be too busy to be bored\nI'm not bored, I'm angry and annoyed.\n>Find a gal you like and have some kids.\nI guess. I get the feeling I'll die childless though. I don't know if I can or want to put up with going out, socialization, not having free time and women's bullshit just to have children.",
				"added": 1577957127
			},
			{
				"comment_id": 24,
				"body": "> [robione](#comment_365_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Once you can approach these things as an unaffected observer with some zen, it will mostly be silly or funny. [...]\n\nWhy would I approach these things as an unaffected observer? I am not unaffected. Since we live in a democracy, people's stupidity affects me in multiple ways every day. From not having a decent job to being shot on the street in a robbery without any means of defending myself, dangerous vaccines being pushed on everyone and even legally required sometimes, fucking family members unintentionally spitting in my drink and food as they speak, being bombarded left and right with kike propaganda every time somebody turns on the TV, low IQ people being paid to reproduce, needing to use a spyware proprietary application from Facebook to communicaye with anyone I meet in real life, and the list goes on.",
				"added": 1577997925
			}
		],
		"1577943220_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 20,
				"body": "> [draugrdeathlord](#comment_149_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Il assume your low 20s [...]\n\nLike what?",
				"added": 1577995619
			},
			{
				"comment_id": 21,
				"body": "> [randomshits](#comment_389_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Just remember that no matter when or where you do it, someone, somewhere in this world, is fapping with you. :) Because that's the magic of probabilities.\n\nThey are jerking off at the same time I am, not with me.",
				"added": 1577995646
			}
		],
		"1577969522_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 22,
				"body": "It sickens me that the article repeatedly points out the risk to US companies without ever saying a word on how this law might affect individuals (citizens or foreigners) on China. They don't even explain that they don't know what the law is about because there just has been an announcement and the law hasn't been published yet.\nAnd then they have the audacity to show a message saying \"turn your phone into a beacon of freedom, download our app!\" when the reason they need you to install the app is so they can slurp more data from your phone and sell it.\nGoddammit I hate kikes so fucking much.",
				"added": 1577996901
			},
			{
				"comment_id": 23,
				"body": "> [randomshits](#comment_384_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Meh, I would rather have the CCP as world law rather than the US world law. At least with the CCP, there is a clear understanding as to what you are going to get unlike the US World law that gives financial protection to those who have the most wealth under a guise of fairness & democracy.\n\nLow IQ comment.\n\n> [fke13](#comment_91_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Guess what, the guns offer even more predictable results, if You place the barrel under Your chin and pull the trigger. After all, its the predictability that You are after, not Your personal benefits. You may also find it very predictable to go to Saudi Arabia and wave with a protest sign. They literally chop people's heads off on a public square with SWORDS, as protests against the sultan is \"illegal\" there. That way You'll get an audience to Your suicide and a \"free burial\". Probably even some U.S. media outlets have titles like: \"U.S. ally, Saudi Arabia, beheads a U.S. citizen for protesting the sultan.\"\n\nThis.",
				"added": 1577997021
			}
		],
		"1578136145_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": [
			{
				"comment_id": 25,
				"body": "> [1bfqutudhtexlka](#comment_144_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): ZeroNet is a literal nightmare for govs\n\nIf it becomes popular it'll be possible to ban it using statistical methods like Tor bridges are in China.",
				"added": 1578140432
			},
			{
				"comment_id": 26,
				"body": "> [gadfly](#comment_3_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8): Like you said, nothing scales until it scales. If meek bridges aren't enough, I imagine WireGuard hitting the 5.6 kernel may lead to some interesting developments with regard to approachable, self-hosted encryption technology.\n\nFuck, I hate pseudonimity.\nI don't know about Meek, but it's pretty easy to block WireGuard and similar p2p stuff. Just severely limit the amount of IP traffic between your victim and IPs that aren't known for being used to serve corporate content or websites. You'll break things like Mumble and Torrent connections to the outside world, but if you're China that's probably a good thing anyways.\nThe thing with Meek is nobody continuously uses, say, Azure hosted websites all the time. So if you only use Tor it'll be easy to know that's not regular https web browsing. You would need to limit your Tor usage to short bursts among otherwise normal web browsing. Maybe it's an idea for somebody to implement a human simulator script that fetches random websites to confuse the Chinese AI.",
				"added": 1578147051
			}
		],
		"1578154157_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 27,
				"body": "> [cupcake](#comment_1_1H4eK5ZTs4ZL3s486bQQPn71qdeQXqKXjK): Another uncensorable P2P net is Freenet. https://freenetproject.org/index.html\n\nI know there's some kind of board software for Freenet but never figured out how to use it.",
				"added": 1578155050
			},
			{
				"comment_id": 28,
				"body": "> [gadfly](#comment_5_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8): And depending on your lean towards free software may also be interested in GNUnet.\n\nCan you give me a QRD?",
				"added": 1578155089
			},
			{
				"comment_id": 29,
				"body": "> [randomshits](#comment_397_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Why not create and be the owner of your own board? That way you can tolerate all the spammers and child porn posters that you could want. =p\n\nBecause ZeroTalk barely gets enough traffic as it is for my tastes.\nAny other site on ZeroNet is basically dead except  for the pornposting on Millchan.",
				"added": 1578155444
			},
			{
				"comment_id": 30,
				"body": "> [randomshits](#comment_398_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): What are you even looking for in a decentralised darknet? Some single purpose popular social media site that doesn't include potentially illegal porn? If that's the case Fidonet may be for you.\n\nYes, and I don't care if it has porn. I care that it's active BESIDES the porn. The problem with Fido is\n1. It's not uncensorable, they can ban people and remove messages\n2. Commercial and encrypted traffic is prohibited",
				"added": 1578176595
			},
			{
				"comment_id": 31,
				"body": "Basically I just want an uncensorable discission board (besides actually blocking the IP packets, which is impossible to prevent).\nBlockchain based boards are kinda like that except they're pay to post. I don't know how active they are, I imagine not much.",
				"added": 1578176731
			},
			{
				"comment_id": 34,
				"body": "> [fke13](#comment_123_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): But then it is a social issue, not a technical issue\n\nNo, it's a technical issue. If I am technically able to censor users, like minded people won't flock to my site. If I'm not technically able to do so, they will.",
				"added": 1578200747
			},
			{
				"comment_id": 35,
				"body": "> [quantumkitty](#comment_321_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): The thing about Free Speech is that it doesn't always grant one the right to an audience.\nI'm not asking for an audience, I'm asking for a piece of software.\n>I personally had to learn that the hard way with my problematic social media use in the past.\nIf you thought \"Free Speech\" meant you had the right for an audience you're really dumb.",
				"added": 1578201001
			},
			{
				"comment_id": 36,
				"body": "> [vysnit](#comment_6_17Z3KGVcRKiXdU2zhiph9RmURzTDMnAKFb): Eh...Freenet is more or less not safe these days\n\nCan't it be used through Tor?",
				"added": 1578201049
			},
			{
				"comment_id": 37,
				"body": "> [filips](#comment_382_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Note that ZeroMe owner (nofish) could still be able to hide/block content from your Hub, but data in it will still exist, and other users will be able to access them directly.\n\nThat's not acceptable.\nWhere's the documentation for these \"hubs\" anyway?",
				"added": 1578201170
			},
			{
				"comment_id": 38,
				"body": "> [fke13](#comment_124_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Assuming that they will not delete their own posts from the forums that they themselves control, the solution might be a classical RSS reader. I'll improve my current answer in a moment.\n\nProblem with RSS is they need to be running a server 24/7 or people won't be able to see their content.\nUsenet and NNTP in general is more like it but then the problem becomes that there's no automated way to join the network and you need someone to supply you with peering access.",
				"added": 1578201667
			},
			{
				"comment_id": 39,
				"body": "> [fke13](#comment_125_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): I'm not sure that I fully understand, what You mean by this. In the case of ZeroNet forums, the ZeroNet forums are readable from a local machine even, when there is no internet connection. To get data from one computer to another there is a need for some kind of a data transfer anyway, be it phsyically IPv4 network or some USB-stick or DVD or even paper carrier. An RSS-reader that indexes ZeroNet forums actually indexes the URLs that point to the local machine, the 127.0.0.1:Foo . It's basically that in a way You are right: if a person wants to use a computer to read email, forums, chat-room content, then the person needs to switch the computer on and after reading it is OK to switch the computer off again, provided that the computer updated the data during the time, when a human was reading the email. [...]\n\nOh, you mean over ZeroNet? Then what's the advantage over using ZeroNet over the regular web interface?",
				"added": 1578203175
			},
			{
				"comment_id": 40,
				"body": "> [fke13](#comment_126_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): The very advantages, why the ZeroNet was created at first place: decentralization, data replication, data redundancy. The anti-censorship measures can be seen a lot like in military terms \"security\" can be seen in terms of multiple, individual tasks that jointly provide the proper security. For example, part of the anti-censorship measure is data redundancy: blow up a datacenter or \"confiscate\" the servers, but data is in many places, too many places to \"confiscate\" or to blow up. Switch off the Internet, but if the zites have been previously downloaded like podcasting MP3-files, then people can read the forums/blogs even, when there is no internet connection. Securing something against attackers should be seen as a modular task that has sub-tasks. The ZeroNet has its role and the Tor has its role and the 2 together make a nice whole. You seem to have a task at hand that has sub-tasks that the ZeroNet+Tor handles very well.\n\nYeah, but how does using RSS with it improve any of that?",
				"added": 1578203679
			},
			{
				"comment_id": 41,
				"body": "> [fke13](#comment_127_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): It does NOT and it is NOT even meant to improve any of that. It adds NEW FUNCTIONALITY by creating a forum thread from posts that only their authors can delete. I understand that You wanted a forum thread, where nobody can remove posts except the authors of the posts. That's what the RSS-reader creates, with the additional functionality of allowing the RSS-reader user to apply its own spam filters.\n\nOh, ok. I get what you mean. Then the main disadvantage is if the owner of the site deletes the post before me (or someone else) is able to connect.\nI wonder how mature and usable IPFS is.",
				"added": 1578204009
			},
			{
				"comment_id": 42,
				"body": "> [fke13](#comment_128_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): You have to get the data to Your computer before it is deleted from all nodes of the network! What do You expect?!\n\nThat nofish or whoever else wouldn't be able to delete the data from all nodes of the network.",
				"added": 1578205104
			},
			{
				"comment_id": 43,
				"body": "> [fke13](#comment_130_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): That assumes that people use multiple forks of the ZeroNet in stead of just all downloading from a single, centralized, source.\n\nNot really. If people had to manually install an update rather than potentially destructive changes being pulled automatically I wouldn't have any issues with it.",
				"added": 1578206699
			},
			{
				"comment_id": 44,
				"body": "> [fke13](#comment_132_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): What about initialization? If the malware is injected at the very first install, because it is known to the agency that people will be installing from location X, then my argumentation still stands. Also, if only the original authors are involved, then their thoughts are at the core of the project and they just can not spend that much time on analyzing, whether malware has been injected to their creations or not, specially if it takes place during the initial installation download and only with some of the downloads, not all of the downloads. There's the option that the initial installer hash is signed, like with Linux package collections, but do not expect ordinary end users to pay attention to those things. The Linux package installation system verifies the signatures and hashes automatically. I guess, if the original authors publish to some Linux package collection, then there might be a chance that things work out in favor of the end users, but that is NOT the case with source repository cloning.\n\nWell you can't do every a 100%. There is always a hole for a sufficiently sophisticated attacker.",
				"added": 1578207491
			},
			{
				"comment_id": 45,
				"body": "> [fke13](#comment_134_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Right, but I want to be AWARE of the hole and know the PARAMETERS of the hole and PLAN for fixing the hole, even if I lack the resources/time for applying the countermeasures immediately :-)\n\nI mean there probably are signed ZeroNet packages somewhere already, aren't there?",
				"added": 1578209540
			},
			{
				"comment_id": 46,
				"body": "> [filips](#comment_384_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): In most IPFS-based websites, you are relying on centralized IPFS provider (most commonly Infura or Cloudflare). This means that if provider goes down, that websites will also stopped working. And provider owner can also control the content. [...]\n\nWhat about not using websites but using local html files or desktop programs that communicate by modifying the raw files? How widespread is that?",
				"added": 1578219592
			},
			{
				"comment_id": 48,
				"body": "> [filips](#comment_385_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): How it is not acceptable?\nPersonal criteria.\n>And what exactly would you like?\nYou can see exact thoughts on the matter here.\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU/Lets+fix+ZeroNet\nBut basically the first thing that I would change is sites would need to require manual user intervention before their site's code is changed.\n>In any decentralized system, if you don't own both place where your data are stored and place where data are viewed, owner of that place can hide your data. Nothing else can be done.\nIn the current system, the data can be deleted or hidden by someone (the zite's admin) who owns neither the place where the the data is stored (the user's hard drive) nor the place where the data is viewed (the user's monitor).",
				"added": 1578220514
			},
			{
				"comment_id": 49,
				"body": "> [filips](#comment_386_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): What do you mean with \"their site's code\"?\nI mean the root content.json and any files referred thereof.\n>If you mean your own site, nobody except you can change it.\nI don't. \n>But if you mean public site like ZeroTalk, it is correct that site owner can control, the data. As a site owner, you should have rights to chose what is stored on your site.\nI disagree that there should be an \"owner\". Do torrents have owners? Maybe there should be cryptographically signed maintainers for sites, but  the Debian maintainers sure as heck can't change the packets on my Debian system without me clicking the \"Update\" button.\n>With place where data is stored I mean zite. And with place where data is viewed I mean zite UI.\nI know. My response was tongue in cheek.",
				"added": 1578221651
			},
			{
				"comment_id": 50,
				"body": "> [filips](#comment_389_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Sites are meant to be dynamic, so it is normal and correct that site owner can change them.\nIf I agreed with all the design decisions for ZeroNet I wouldn't have made this thread now would I? It seems to me that making it that way is shoehorning the model of the old web where the developers control the hardware and thus de facto have full control over the content, in a situation where the users control the hardware and thus should be the only ones having full control over the content. IMO for sites where users contribute to the optional data, there should be more separation of software and data, with the same content provided by users being accessible through different client software. So for instance if the ZeroTalk developer is hit by a bus, we should be able to fork ZeroTalk's code and continue tapping off the same database of posts as if nothing had happened. After all, unlike with a traditional site, we all have access to and help host the database, so the site's developer shouldn't have exclusive rights when it comes to using it.\nFor instance, if that functionality existed I'd already forked 08chan, since the developer is missing in action right now, and before that he was a massive fuckup anyway even though he had quite a decent number of users. So much that the users of his site had to modify the site's files and set them read only to get an usable experience since he was too much of a retard/pussy to install a more recent version of the Millchan imageboard engine.\nAgain, the reason clearnet sites die even with thousands of users when the owner goes away is that they physically own irreplaceable parts of the infrastructure -mainly the right to set what the root DNS servers return when queried for his domain, PHP or otherwise server side code, and database-. With ZeroNet the last two are in possession of the users by necessity already, and there's no DNS, only public key digests that should refer strictly to the software and not to the content. The content should probably be addressed by randomly generated UUIDs that are agreed to refer to a certain database (the collection of optional files which right now is associated to the same public key digest that the javascript code is).\nBut again, if I was in charge I'd begin by making sites not update automatically by default, and adding a requirement that all site updates provide a changelog of at least 10 characters every time they're updated or the update wouldn't be recognized as valid.\n>And you can already click \"Pause\" button on ZeroHello to disable site updates.\nOh, ok. I was under the impression that also stopped user generated content, is that not so?",
				"added": 1578224256
			},
			{
				"comment_id": 51,
				"body": "> [filips](#comment_390_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): This already exists and is already used in ZeroMe and other sites (merged sites / hubs). [...]\n\nOk, I'll have to check that out. I assume there's not any documentation about merger sites other than the documentation for the API calls related to it?",
				"added": 1578224844
			},
			{
				"comment_id": 52,
				"body": "> [filips](#comment_391_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): That's basically content-addressed data and that \"randomly generated UUIDs\" are often hashes of content.\n\nWell, the thing is, in this case the \"content\" would be the whole set of posts, so the hash for the \"content\" would be constantly changing.\nSo I don't see any other solution than the site's code just telling ZN \"save that buch of signed data I gave you to the distributed storage location addressable by this arbitrary string\" (or retrieve from). The act of retrieving or writing to that location would cause ZN to download the data stored in that location from other clients and begin seeding it and updating it just like a regular site.\nEdit: but content assessable content still would be very nice for deduplication purposes.",
				"added": 1578225515
			},
			{
				"comment_id": 53,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_31_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): So if I create new zeroid, clone zerotalk, disburden it, exterminate 50 K post limit, publish it, and then delete that zeroid user.json, it is uncensorable by any site owners, right?\n\nYou'd have becomed a site owner, so yes, it'd be censorable by a site owner. Unless you just happened to lose your private keys in a tragic boating accident.",
				"added": 1578225605
			}
		],
		"1578135775_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 32,
				"body": "> [happyhippo](#comment_3_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): That's impossible nowadays, too many vulnerabilities and backdoors are found every day you simply can't stop updating your PC if you care about security.\n\nThat's why upstream needs to make an effort too. But see Debian stable.",
				"added": 1578176840
			}
		],
		"1578136139_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 33,
				"body": "> [styromaniac](#comment_1541_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Sonic 3 & Knuckles has multiple great tracks.\n\nYeah, I like the Ice Cap song",
				"added": 1578177191
			}
		],
		"1570109199_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": [
			{
				"comment_id": 47,
				"body": "Bump",
				"added": 1578220202
			}
		],
		"1578034470_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 54,
				"body": "> [aspidochelone](#comment_305_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I was thinking about some lucky guy in Iran who has five pallets of American flags in his warehouse.  I mean, those things must be selling like hotcakes!  When it occurred to me, gee, where does he get them?  Probably somewhere in China, same as Americans.  It's funny to think that for every American flag you would buy at a Wal-Mart in the U.S., there's probably 100 sibling flags made on the same prison labor assembly line getting burnt up by mobs in Iran.\n\nLol. It is indeed a funny thought.",
				"added": 1578226765
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 55,
				"body": "Lol. It's pretty obvious you are him, thetruth.",
				"added": 1578582318
			}
		],
		"1579387320_1Ho88wZ1zroWjxVTXFNsQg256LJ2CK16Bd": [
			{
				"comment_id": 56,
				"body": "lol\nplease do slide in my DMs officer, I totally want that steamy federal prison buttsex",
				"added": 1579396433
			},
			{
				"comment_id": 57,
				"body": "and by DMs I mean ass cheeks",
				"added": 1579396599
			}
		],
		"1579445364_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 58,
				"body": "> [robione](#comment_435_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Take a look at https://textile.io/ and their JS IPFS-lite https://github.com/textileio/\n\nThat site wants me to give them my name and get on a waitlist or download phone apps before even seeing any content. Fuck that cancer.\nIsn't IPFS supposed to work over the browser?",
				"added": 1579745203
			}
		],
		"1579728135_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 59,
				"body": "Try eating more red meat and eggs.",
				"added": 1579745375
			}
		],
		"1581969527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 60,
				"body": "Lmao\nIs the footage already taken? Or would I be on it if I make and keep bumping a thread on here?",
				"added": 1582104073
			}
		],
		"1582104346_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 61,
				"body": "bump",
				"added": 1582179307
			}
		]
	},
	"comment_vote": {
		"1541_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}