{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1525154290,
			"title": "우울증, ALS의 이러한 사회적 질병의 기원.",
			"body": "우울증, ALS의 이러한 사회적 질병의 기원. 위층 아래층은 시청 옆에 누군가가 소리 또는 벽 전원 스위치를 두드리는 소리가없고,이 이상한 현상의 출현의 경우에 \"뭔가\", 당신은 당신의 잠을 조심해야하는 경우이어야합니다, 지금은 할 수 없습니다 그만해. 그들은 위층과 아래층 사이 것이기 때문에 하수도 및 배수 채널은 \"경로\"의료 수술 장치, 당신의 침대에 \"보내기\"를 열 사이에 당신이 잠 들어있는 동안 당신은 \"내시경을 \"수술. 즉, 과거에 식도에서 매우 얇은 송금으로 말하여 체강에 또는 항문에, 당신의 위장에 구멍을 만드는 것입니다, 대장을 통해 몸의 구멍에 구멍을 명중 이때 외모에 아무런 상처는 없지만 내부 장기는 지속적으로 손상됩니다. 당신이 에너지, 수면 전에 침대로 이동하지만, 몸 전체 후 며칠 동안 불편 경우 조심해야 상황이다. 이 사람들은 젊은 의사들과 정부가 키운 \"살인자\"입니다. 당신은 ALS를 가지고 그래서, 그들을 공격하는 당신을 치료하는 유일한 방법은 심한 우울증을 사용하지 않는 후자는 동안 누군가가보고해야합니다, 아무것도 먹고, 또는 당신이 \"사람\"을 식별 할 수있는 능력을 가지고있다. \" 질병. \"",
			"added": 1525154289
		},
		{
			"topic_id": 1525440676,
			"title": "삼성 NOTE7 휴대폰 배터리 발사의 진정한 이유는 CCP의 검은 손이다.",
			"body": "믿을만한 소식통에 따르면, 화재의 삼성 휴대 전화 배터리 주 7 원인은 배후 주범은 중국 정부에 의해입니다 출몰! 중국 정부는 삼성 리튬 배터리 폭발로 인한 화재가 쉽게 삼성을 시작하기위한 리튬 - 전원 제품의 스파이 기술을 사용하여, 결국 삼성 휴대폰의 리콜을 주도, 큰 손실을 입었다.\n\n그 이유는 대체로 중국 과학자가 긴 리튬 폴리머 전지에서 동소 리튬 산화물 미량 혼합 발견하도록하고, 리튬 폴리머는 에너지 변환 불안정성 같은 리튬 원인 배터리를 충전하는 시간과 기간을 토출 한 후, 전지에서 매우 작은 금속 입자를 생성하는 것, 금속 입자가 발생하는 배터리 또는 순간적인 가열을 야기 배터리 플러스, 마이너스 효과의 단락을 일으킬 수있다.\n\n\n \n\n\n이 고장 메커니즘은 엔지니어링 그의 연구 결과는 일급 비밀 국가 차원의 과학 기술로 분류 된 것을 발견의 중국 과학원의 리튬 학회 회원이며,이 기술의 유일한 사용은 적의 전자 제품을 파괴하는 것입니다 때문에, 발표를 할 수 없습니다.\n\n삼성 전자의 검은 손에서 중국 정부의 진짜 이유는, 한국은 \"사드\"미사일 방어 시스템의 구축과 중국이 불만, 중국은 한국 사드 \"미사일 방어, 북한의 표면 상 방어적인 핵 위협의 배포, 미국이 실제로 모니터링 명령에 복종하다고 생각합니다 한국에 대한 미국 러시아 시위와 경고를 반복 중국. 중국의 대부분의 지역에서 미사일과 로켓 발사기 행동 후, 한국 대통령 박근혜, 한국에 대한 신뢰가 슬픈 취소 잃고 중국을 설득하는 한국의 \"사드\"를 배포하기로 결정을 주장 중국 정부는 화를 냈고 보복하기로 결정했다.\n\n삼성은 한국에서 삼성에 칠 동일 한국의 주요 기둥 기업, 삼성 GalaxyNote7 폰 경쟁이 매우 치열와 휴대 전화입니다, 그리고 삼성 갤럭시 스마트 폰 디자인을 계속 강력한 중국 정부는 과학 기술 블랙 마스터하기 위해 사용하는, 독창적 인 설정, 삼성의 리튬 배터리에 손을했다.\n\n\n \n삼성 휴대폰 리튬 배터리는 주로 삼성 SDI의 삼성 자회사에 의해 제공됩니다, 삼성 SDI는 중국, 소주, 무석 (无锡), 서안, 천진, 허페이 (合肥), 작은 리튬 배터리의 주요 생산에 생산 설비를 갖추고있다. 중국 정부가 긴 레이아웃이 회사가 많은 중국 기술 직원을 고용에서, 삼성은 오랫동안 중국 정부의 아이 라이너, 삼성의 생산 공정, 원료 공급, 물류 접근과 생산 및 공급 과정의 연속이었다 긴만큼, 중국 정부를 지배 중국 정부는 언제든지 시작할 수 있습니다.\n중국 정부를 통해 또한, 중국 삼성에서 얻은 생산 공정 정보의 일부는 화웨이는 이제 삼성 스마트 폰과 대등 한 품질을 생산하고, 화웨이로 전송.\n\n삼성 GalaxyNote7 리튬 배터리 파괴가 국가 안보위원회가 이끄는 중국 KNB 내부자에 의해 제안되었다, 교육부, 공학 중국 과학원, 국방가 참여하고 구현하기위한 책임이 있습니다. 정부 부처, 국가 연구 기관, 대기업의 스파이 네트워크 파괴 거대한 동원과 참여 기관 간 조정의 시리즈는 단지 미국이 이행 할 수있는 능력을 가지고있다. 이 작업의 가장 중요한 부분은 삼성의 다른 모델, 거의 스프레드가 나타내는 동안 정밀도, 새로운 시장을 주 7은, 특정 모델에 대한 정확한 삼성 제품을 공격하는 것이입니다 삼성 제품의 생산 및 공급에 대한 중국 정부 체인은 모든 것을 알고 있습니다.\n\n리튬 배터리 기술은 리튬은 스마트 폰 초기에 나타난 전 세계에서 삼성 리튬 배터리의 품질이 두 가지의 속, 그리고 대규모 사용했던, 초기 성숙 삼성 리튬 배터리는 문제가 있다는 것입니다 경우 그것은 매우 이상합니다. 배터리 화재의 원인, 즉 중국의 보복 밖으로 소니의 리튬 유령에 일본 사실, 2006 년, 소니는 노트북 리튬 배터리 리콜 사건을 가로 질러왔다,하지만 다음과 같은 성숙한 기술 오늘 아니었다, 중국은 리튬의 파괴에 지금 용액 미묘한 더욱 영리 삼성 SDI의 중국어 원료 공급의 일부는 이동 삼성 SDI 있도록하는 잠재적 인 생산 신비 삼성 SDI 원료 공급 도핑 원료를 제공하는 문제의 배터리.\n\n아니나 다를까, 삼성 주 7의 출시 이후 년 8 월 2016 년, 소비자가 전 세계적으로 곧 불을 붙 잡았다 휴대 전화 배터리의 보고서를해야합니다, 사고는 전례 금지, 아래의 최종 항공 주 7로 이어지는 증가하는 것을 계속한다. 소비자가 교체 삼성 휴대 전화, 호출 할 필요가 있지만, 제품의 교체는 아직 분명히 배터리 삼성 화재의 근본 원인을 찾을 수 없습니다 화재에있을 것입니다. 마지막으로, 삼성 전자는 생산 주 7의 영구 폐쇄를 발표했다, 삼성 제품 이벤트의 직접 손실은 서른 넷 여전히 브랜드 이미지 수, 더 헤아릴 수없는, 어떻게 미래 삼성 조정에 미치는 영향으로 수십억 달러를 발생 도달 알 수 없다.\n\n\n \n삼성 휴대폰의 파괴, 하나의 돌을 계기로 두 마리를 죽이고 중국 정부는, 삼성, 한국의 보복 효과 경제적 손실을 초래하여 한국 경제를 파괴 할 수 있고, 둘째, 삼성 전자는 화웨이, 삼성의 주요 경쟁사 중 하나입니다 휴대 전화가 파괴되었습니다. 가장 큰 이득은 화웨이입니다.\n\n삼성 휴대폰이 사건에 의해 파괴되어, 중국 정부의 장기 외국 투자 기업이 공장을 설정을 보여줍니다 누구의 영토 정보 수집 활동, 외국 투자 기업 중국 직원에 의해 얻은 중국의 주요 해외 정보 데이터의 생산을, 그것의 모니터링, 제어 그래서에서 필요할 때 그것을 파괴하십시오조차. 조치가 중국에 공장을 설정 한 경우, 필연적으로 중국어 직원을 모집하는 데 사용할 때문에 만 중국에 공장을 설정하지 않도록,이 직원은 중국어 경제 스파이로 감소 할 수있다.\n\n삼성이 믿지 않으면 이러한 개선을 시도하십시오.\n\n1, 중국에서 리튬 배터리를 생산하지 않습니다\n2, 중국에서 원자재를 사용하지 마십시오.\n배터리 발사 문제는 사라질 것입니다. 삼성뿐만 아니라, 리튬 배터리의 전혀 다른 브랜드는 이러한 중국 정부가 제어 할 수 있으며, 화웨이 휴대폰 배터리가 발생하지 않습니다, 화재 것입니다.",
			"added": 1525440674
		},
		{
			"topic_id": 1528870279,
			"title": "http://127.0.0.1:43110/18fvHT5oGbS1KaeedGpQS4wr8eQ1QD36Dn/",
			"body": "http://127.0.0.1:43110/18fvHT5oGbS1KaeedGpQS4wr8eQ1QD36Dn/",
			"added": 1528870276
		}
	],
	"topic_vote": {
		"1525154290_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}