{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1559711646,
			"title": "How secure is ZeroNet against Quantum Computing?",
			"body": "If Quantum Computing is coming what happens with crypto/blockchains?",
			"added": 1559711645
		},
		{
			"topic_id": 1565427459,
			"title": "Lets talk about the BINANCE EXCHANGE KYC HACK",
			"body": "",
			"added": 1565427457
		}
	],
	"topic_vote": {
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"1559711646_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": 1,
		"1565443644_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1559424911_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 1,
				"body": "right :-)",
				"added": 1559452586
			}
		],
		"1560138110_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": [
			{
				"comment_id": 2,
				"body": "i use it for 3 month and for me zn is a very good idea/plattform.....but i also see a much of work for this project to reach more people.......",
				"added": 1560143820
			}
		],
		"1560368932_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 3,
				"body": "thats why zeronet and others are the best way to bypass..",
				"added": 1560399126
			}
		],
		"1565427459_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": [
			{
				"comment_id": 4,
				"body": "decentralized exchanges are the future of cryptotrading trust me....",
				"added": 1565442246
			},
			{
				"comment_id": 5,
				"body": "> [xcape2net](#comment_242_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I agree with you 100%.  It is now nearly impossible to buy cryptocurrency without identifying yourself.  The point of cryptocurrencies was for people to avoid government control, not to be tracked by them.\n\nthats why decentralized exchanges are the future without control of goverment and others just buy/sell p2p",
				"added": 1565444225
			},
			{
				"comment_id": 6,
				"body": "> [xcape2net](#comment_243_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I agree.  However, when I tried to buy bitcoin on Bisq, I found that there were two ways to do that: 1)buy with Zelle that links directly to your bank account (automatically identifying you), or 2)buying face-to-face.  With the face-to-face method, given the dearth of people using Bisq, you would most like have to travel hundreds of miles.  So, Bisq doesn't solve the problem unless many. many more people start using it.\n\nyou must use decentralized exchanges with ethereum blockchain protocol like www.tradex.one, ddex and others. authentication buy and sell only over metamask or nano ledger hardware wallet :-)",
				"added": 1565444861
			},
			{
				"comment_id": 7,
				"body": "with the app \"Mycelium Bitcoin Wallet\" android you can buy and sell cryptos in cash in every city. just open the app go to the market place and look if someone in your city or near your city are sell/buy cryptos for cash then contact him over the app",
				"added": 1565446236
			},
			{
				"comment_id": 8,
				"body": "> [xcape2net](#comment_245_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Are there enough people using the Mycelium Bitcoin Wallet that I don't have to travel hundreds of miles to buy Bitcoin with cash in a face-to-face meeting?\n\nive tried several times without any problems here in europe the farthest way was only 40miles",
				"added": 1565446729
			},
			{
				"comment_id": 9,
				"body": "> [xcape2net](#comment_246_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Alright, I look into the Mycelium Bitcoin Wallet.  Thanks.\n\nno problem",
				"added": 1565447125
			}
		]
	},
	"comment_vote": {
		"4_1w9czsVapAVmVVQzf7xzuSqvqGar6xd2C": 1
	}
}