{
	"next_post_id": 8,
	"next_comment_id": 2,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Igek",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Ru\n",
	"post": [
		{
			"post_id": 1,
			"date_added": 1521776632,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1521777006,
			"body": "Короче запутался я слегка с ZeroNet. И не могу теперь войти в свой прежний аккаунт. :( Пришлось заводить новый. Понятно,  что прежде надо бы почитать повнимательнее - как всем этим пользоваться. Но если честно мало пока информации. Если кто подскажет что почитать - огромное спасибо!",
			"date_added": 1521777004
		},
		{
			"post_id": 1521778804,
			"body": "А проблема была в следующем: я работал через Андроид и не мог найти файл users.json Который в итоге оказался по адресу  External Storage/Android/data/net.mkg20001.zeronet/files/zero/data  В общем если кому поможет - на здоровье!",
			"date_added": 1521778801
		},
		{
			"post_id": 1521790826,
			"body": "Ладно, едем дальше... хотим мы того или не хотим, а время на месте не стоит. Поговорить, дорогие друзья, стоит о понимании. Ясен же пень, что с общением человечество проблему решило - сейчас кто угодно может связаться и пообщаться с кем угодно... было бы желание. Даже с другими языками проблема решается (моя дочь... не очень (мягко говоря) владея английским, прекрасно общалась на нем через то ли Гугл, то ли Яндекс переводчик с китайцем на Алиэкспресс). И вот сейчас встаёт в полный рост проблема взаимопонимания. Не стоит отрицать, что наше миропонимание здорово может отличаться.",
			"date_added": 1521790822
		},
		{
			"post_id": 1521791154,
			"body": "Okay, let's move on... whether we like it or not, but time does not stand still. To talk, dear friends, is about understanding. Clear the stump, that communication of humanity solved the problem - now anyone can connect and chat with anyone... was would desire to. Even with other languages the problem is solved (my daughter... not very (to put it mildly) owning English, well communicated on it through whether Google, whether Yandex translator with the Chinese on Aliexpress). And now the problem of mutual understanding stands in full growth. Do not deny that our understanding of the world can vary greatly\nP.S. that was translated by Yandex Translator.",
			"date_added": 1521791149
		},
		{
			"post_id": 1521792078,
			"body": "Понимание... Само по себе это понятие не кажется особо сложным или таинственным. Ну, сказал тебе что-то человек, а ты понял его. Все просто. Однако, если подумать, то простота эта кажущаяся. Во первых: мы всегда общаемся (всегда! просто проследите за собой) в рамках ОБЩЕПРИНЯТЫХ договоренностей и умолчаний. То есть, сказав некоторую  фразу, мы исходим из предположения, что человек, который не услышал более-менее имеет представление о предмете разговора.",
			"date_added": 1521792072
		},
		{
			"post_id": 1521792320,
			"body": "Скажу честно, мне кажется весьма вероятным то, что сети подобные этой сыграют большую роль в нашей жизни. В самом ближайшем будущем. Просто потому, что именно сейчас наше будущее зависит от того, смогут ли простые люди, народ научиться самоорганизации. Если нет, то будущее будет очень печальным.",
			"date_added": 1521792313
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@caryoscelus: совершенно согласен. :) Я просто решил посмотреть на реакцию наших англоязычных друзей. Рассуждал не для них.",
			"post_uri": "1EQCjMVXfNqDypJNxr6n5W9oRimdFr3AWH_1521791154",
			"date_added": 1521869944
		}
	],
	"follow": []
}