{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Estou na merda",
			"body": "Não pensei em nenhum lugar para levar esta merda, por isso jogarei aqui. Não tenho amigos, emprego, etc, sou completamente sozinho. Pensei na época em me matar, porém me prometeram que \"na faculdade seria melhor\", então esperei. Após alguns anos na faculdade percebi que tudo só piorou e fiquei ainda mais sem esperança. Eu sei que isso é uma solução extremamente covarde, mas foda-se.  Vou tentar encontrar uma forma de não descobrirem meu corpo e desaparecer. Então, como foi seu dia hoje?",
			"added": 1553730776
		},
		{
			"topic_id": 3,
			"title": "O Fim da Democracia",
			"body": "Gostaria de falar da atitude do STF e sobre a censura que está sendo feita. O mesmo tribunal acusa, prova e julga, algo completamente inquisitório. Percebo que arrancaram a máscara sobre os ministros, todos nós sabemos que são um bando de comunistas. O pior é que não há a quem recorrer, pois eles estão no topo do sistema judiciário, os recursos são feitos para eles mesmos! A esquerda, obviamente fecha os olhos sobre, utilizam sempre os problemas alheios como instrumento de manobra quando lhe convém. Sempre quando estudamos Montesquieu, entendemos que deve haver um equilíbrio entre os poderes, deve haver fiscalização deles entre sí, porém o Poder Judiciário brasileiro parece estar em uma posição diferenciada. É como se existissem dois podere \"E\" o judiciário, hoje percebemos como a corte do STF pode fazer gato e sapato com qualquer cidadão de bem. Outro exemplo é o que está acontecendo com Danilo Gentili. Sabe o que é pior? Após a matéria da Globo sobre esse assunto, a próxima foi \"Por que os brasileiros estão tão intolerantes?\" POR QUE SERÁ SUA FILHA DA PUTA???? A esquerda conseguiu destruir a democracia com o politicamente correto, agora estamos vendo as consequências. Temos que revidar!",
			"added": 1555463942
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1CkgC7bFTCM1hW61V331Rnk1EVRpud6u87": [
			{
				"comment_id": 1,
				"body": "> [duende](#comment_1_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Leve a escória junto.\n\nVolte para o mar de mijo, de onde nunca deveria ter saído",
				"added": 1553817286
			},
			{
				"comment_id": 2,
				"body": "KKKKKK To vivão gente. Não pensei que isso iria subir, vlw pelo apoio. Acho que todo mundo é meio fodido, mas ta na luta. flw",
				"added": 1554744594
			}
		],
		"1_1FAjgFhx96FDLwnL2JCMYDjuT9QcGneETU": [
			{
				"comment_id": 3,
				"body": "Eu só tenho pesadelos bizarros. Esses dias sonhei que fui sequestrado por crianças em um carro, elas atropelaram pessoa. Entretanto, a juíza no julgamento não acreditava em mim, pois eu era a pessoa mais velha no carro.",
				"added": 1554744714
			}
		]
	},
	"comment_vote": {
		"9_1DG5Q2cfNZP7otYXypag5B1My32VQeHekm": 1,
		"4_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1,
		"3_1NhJGZ6PxfCbBJg7pEaCr5R9pc3WMicnVY": 1,
		"2_1GgbDa2qH6WGQms73hnTpkvG7L2Lm4CymK": 1,
		"1_16GExnedD1SuPZCvEBD1fNj9EWkFwGC9ff": 1,
		"1_1AcHjqFN4u61WXvFdrkWRfMQ1VBUJWU9gx": 1,
		"3_1FAjgFhx96FDLwnL2JCMYDjuT9QcGneETU": 1
	}
}