{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Немного саморекламы",
			"body": "Есть у меня фобия постить новые темы на форумы, поэтому из публичных площадок предпочитаю 0me. Но поскольку есть также основания предполагать, что не все его читают, немного попиарю свои сайты и здесь. Тем более как раз повод есть:\n\n- [сайт с переводами Осаму Дадзая](/1JPGL61v5LgbfyD3pvAkCy3YqrCWqaekWH/) (пока в количестве одной штуки)\n\nЕщё недавно в отдельные сайты были выделены:\n\n- [сайт коротких рассказов](/1JecUbTPHudVR3fi6KMFwQNW2mT2L8H7dq/),\n- [поэзии](/1QDEpSBxTXiZ4ak9m9ATAVAy1SSLiRrxKs/) и\n- [heavy bright sun](/1HAB57aQRcLHoHb3ehHrh8SZT647VWVA28/)\n\nНу и три \"старых\" сайта:\n\n- [blog / home page](/1MCoA8rQHhwu4LY2t2aabqcGSRqrL8uf2X/)\n- [моя музыка](/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/)\n- [и видео](/1N8zibqog72CCDBDo8jrxU7C6Q8JeVND2Z/)",
			"added": 1561528796
		},
		{
			"topic_id": 2,
			"title": "Потихоньку добиваю старые рассказы",
			"body": "По сравнению со многим из того, что было, [эти](/1JecUbTPHudVR3fi6KMFwQNW2mT2L8H7dq/?text/would-ask-to-not-laugh.md) [два](/1JecUbTPHudVR3fi6KMFwQNW2mT2L8H7dq/?text/criminal.md) даже адекватные и многобуквенные",
			"added": 1571424933
		},
		{
			"topic_id": 3,
			"title": "Нановримо 2019",
			"body": "Наступает (а для кого-то уже) очередной ноябрь, а значит все желающие могут принять участие в [\"нановримо\"](https://nanowrimo.org/) и попытаться написать роман за тридцать дней. Кому-то может показаться безумством, глупостью или даже нудятиной, но мне в прошлый раз понравилось и хочется ещё. Если вдруг тут есть коллеги — отзовитесь!\n\nЧто до меня, публиковать буду по мере написания в т.ч. [здесь](/1LTGeNnnYq98h8zUcZaS4zZL63ZXZS8YcA/). Какие-то обновления вероятно попадут в [мой 0me](/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE/caryoscelus@zeroid.bit), ну а эту тему всё же оставляю для общего обсуждения, если конечно здесь есть интересующиеся",
			"added": 1572532465
		},
		{
			"topic_id": 4,
			"title": "Программное обеспечение шифрует в мозгу",
			"body": "Может кто знает такое? А то перепутав пару букв в соседнем топике, я никак не могу избавиться от мысли, что что-то такое должно быть. Или нет? Но ведь это будет настоящий прорыв в шифровании!",
			"added": 1572953821
		}
	],
	"topic_vote": {
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"4_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1_1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf": 1,
		"1_12ytyx8zmYMn58UavemioxPnMwaDNND3Ww": 1
	},
	"next_comment_id": 147,
	"comment": {
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 1,
				"body": ">Что насчёт Го? Насколько он хорош?\n\n[Всё, что нужно знать о Go](https://www.reddit.com/r/rust/comments/5penft/parallelizing_enjarify_in_go_and_rust/dcsgk7n/). Хотя кому-то нравится. Компилятор у него вроде быстрый. Но мне хватило и `import \"github.com/blablabla\"`, чтобы его бросить.",
				"added": 1516301178
			}
		],
		"13_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 2,
				"body": "Всё-таки удивляет меня способность некоторых заявлять о готовности убивать случайных людей и тут же у случайных же людей просить совета.",
				"added": 1517548923
			},
			{
				"comment_id": 3,
				"body": "> [tokyomewmew](#comment_41_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL): Убивать рандомных людей необязательно. Можно взорвать себя на учениях, или подорваться с другими, спасая других людей от боевиков\n\nНу ок, но такие вещи лучше всё же сразу писать. Потому что по умолчанию желание вступить в игил воспринимается как минимум готовность (если не желание) убивать кого скажут.\n\nВ любом случае, если действительно интересен дельный совет, то нужны подробности. Ибо стороннему человеку не очень понятна альтернатива между суицидом и (не слишком жёсткой) сектой (или секта подразумевалась тоже суицидальная?). А давать Универсальный Абстрактный Совет Самоубийцам незнакомому человеку я бы всё же не стал.",
				"added": 1517566205
			},
			{
				"comment_id": 4,
				"body": ">Не вижу смысла дальше что либо делать\n\nНу, убить себя - тоже дело в общем-то. Как и присоединение к какой-либо секте.\n\n>так как я против всей этой системы, не пойду дальше куда либо учится или работы.....\n\nПротив какой именно системы?.. И да, так или иначе, можно с ней бороться/игнорировать/саботировать/убежать от неё.",
				"added": 1517573374
			},
			{
				"comment_id": 5,
				"body": ">Бежать? Куда и кому я там нужен? Игнорировать? А на что жить, святым духом питаться?\n\nЕщё раз, я же не очень понимаю, какая именно система (можно же с разными вещами бороться). Соответственно, в зависимости от этого будет и разный ответ \"куда\" и на что жить. Варианты-то в принципе есть: жить натуральным хозяйством, бомжевать, фрилансить (если это не считается частью системы).\n\n>И как, самое главное, перестроить мировой строй в одиночку?\n\nПерестроить мир в одиночку конечно вряд ли получится (многие уже пробовали..), но сделать свой вклад - почему нет? Для этого зачастую достаточно жить согласуясь со своими принципами и используя мозг по назначению, а не прогибаясь под правила и мнения большинства.",
				"added": 1517618899
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 6,
				"body": "https://ru.wikipedia.org/wiki/%D0%90%D1%82%D0%B0%D0%BA%D0%B0_%D0%A1%D0%B8%D0%B2%D0%B8%D0%BB%D0%BB%D1%8B\n\nА блочить пользователей в индивидуальном порядке и так вроде можно.",
				"added": 1519575829
			},
			{
				"comment_id": 7,
				"body": ">Если этот комментарий не интересн, то его не распространят и не будут хранить у себя на хардах куча пользователей.\n\nТаки нет, такое может относиться только к merger-сайтам, а на большинстве зайтов (в т.ч. на 0talk) по умолчанию всё хранится и можно блочить лишь пользователя целиком.\n\n>Иначе сюда придут всякие Путины с Роскомнадзорами и ФСБ и скажут что нужно писать, а что не нужно. Помимо них, есть еще полно регуляторов в разных странах. Не важно кто будет регулировать. Регуляция здесь плоха сама по себе.\n\nПолностью согласен. Только вот проблема в том, что если 0net кому-то перейдёт дорогу, то регуляторы придут и сюда и устроят как минимум социальную атаку (если чисто техническая не пройдёт) на сеть. Так что в идеале нужно строить либо trustless систему по типу блокчейна (но боюсь, что ни для чего кроме денег и timestamp'ов это работать и не будет, ибо обычно рыночек решает в пользу бабла), либо поднимать технический и социальный уровень участников и строить сеть на реальном доверии.\n\nНо пока да, 0net похоже одна из лучших альтернатив.",
				"added": 1519646753
			},
			{
				"comment_id": 8,
				"body": "> [geekless](#comment_31_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Это лайки. Хреново нарисованныей лайки. :)\n\nНе, это не лайки, это upvote'ы ;)",
				"added": 1519747354
			},
			{
				"comment_id": 9,
				"body": "Не, ну в принципе-то можно систему шеринга белых списков сделать, вроде инвайтов, только p2p. Только вот чтобы это работало нужно существующее общество с надёжными связями доверия, иначе получается либо огороженное сообщество, либо инвайты всем подряд и атака всё равно возможна.",
				"added": 1519770927
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 10,
				"body": ">Есть ли вообще в этом чятике живые сторонники СПО?\n\nЕсть.\n\nПравда есть подозрение, что в нынешней ситуации заниматься формальной организацией СПО либо непродуктивно, либо опасно. Хотя быть может имеет смысл пропагандировать СПО среди наивных любителей свободы, юзающих маки и телеграмчики, и недалёких журналистов, рассказывающих шок-истории связанные с технологиями.",
				"added": 1520252048
			},
			{
				"comment_id": 11,
				"body": "> [ktotut](#comment_2_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): Ну что непродуктивно (особенно на первых порах) — это ладно, но вода камень точит. А почему опасно?\n\nЕсли это станет продуктивно, на это могут обратить внимание соответствующие органы. В случае, если организация будет независимой, её могут счесть опасной и среагировать соответственно. Если же она будет зависима от государства, то во-первых возникают большие вопросы по поводу соотношения вреда и пользы, а во-вторых — риск того, что кто-то захочет кормушку отжать и обвинит всех \"несговорчивых\" людей в коррупции.",
				"added": 1520253006
			},
			{
				"comment_id": 12,
				"body": "> [ktotut](#comment_3_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): А чего конкретно стоит опасаться со стороны \"соотвествующих органов\"? Да и какой, собсвтенно их интерес?  Пускай обращают своё внимание.  Миссия организации очевидна, финансироваться будет только на пожертвования. Речь же о более оактивном продвижении СПО, а не о криптоанархизме.\n\nВо-первых, СПО позволяет обходить блокировки и слежку. Во-вторых, может навредить монополистам. В-третьих, был бы человек, а статья найдётся. Не следует переоценивать государственную целесообразность в действиях людей, готовых поставить на поток приговоры за лайки и репосты. У них может план недовыполнен, а тут попадутся под руку какие-то мутные личности, топящие за свободу.\n\n>чего конкретно стоит опасаться\n\nВсего того же, что делают с оппозицией и попросту попавшимися под руку. Т.е. собственно спектр последствий думаю ничем не ограничен, хотя радикальные действия наверное и менее вероятны, чем административное давление штрафами и запретами.\n\nИ есть подозрение, что если результаты переназначения будут такими (включая 2-е и 3-е место), как нам вещают т.н. \"независимые\" социологи, то ситуация будет только ухудшаться.",
				"added": 1520255071
			},
			{
				"comment_id": 13,
				"body": "> [ktotut](#comment_4_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): С таким подходом остаётся только в даркнете отсиживаться и ждать приезда мальчиков в форме.\n\nДа нет, почему же, можно идти заниматься политической борьбой (осознавая связанные с этим риски). В том числе и с повесткой СПО; думаю, некоторые партии и движения потенциально готовы к тому, чтобы иметь СПО-отдел. Но заниматься только СПО и пытаться поставить себя как бы вне политики мне кажется бесперспективным, потому что если что — вам всегда могут приписать политику.\n\n>чем ту же Роскомсвободу\n\nНе знаю, давят ли на них или нет, но это вроде отделение более крупной и серьёзной организации, не? Соответственно, давить конкретно на них имеет смысл только если совсем давить и всю организацию.\n\n>тем более, профсоюзы.\n\nА на них как раз таки давят и иногда очень жёстко.\n\n>Нужно, просто начать с чисто сетевого представительства и создания сети доверия. А после (обзаведясь хоть каким-то человеческим капиталом  виде пучка активистов и пары юристов) уже выходить в правовое поле с официально засвеченными людьми.  Главное начать. А чтоб начать, нужны люди, готовые шевелиться на эту тему. И самым первым пунктом - просто набрать желающих хотя бы периодически собираться (для начала число в сети, но создание сети доверия для GPG-шифрования крайне желательно, и требует пресечения IRL хотя бы нескольких людей) и обсуждать дйствия и агитацию.\n\nНо зачем? Агитацией можно и так заниматься. Опять же трепаться на тему можно и без формальных рамок \"организации\".",
				"added": 1520259734
			},
			{
				"comment_id": 14,
				"body": "Ок, я своё мнение навязывать не собираюсь. Если кому-то удастся сделать полезную СПО организацию в РФ, можно будет порадоваться. Но в таком случае советую всё же подробнее изучить опыт пиратской партии.\n\nНу и да, низовую организацию \"по интересам\" может и имеет смысл делать для тех, кому такая форма интересна. Но в принципе, есть же всякие lug'и, там наверное и стоит людей ловить.\n\nВ любом случае, преодоление скепсиса критиков необходимый этап ;) Удачи",
				"added": 1520262899
			},
			{
				"comment_id": 16,
				"body": "Да, вероятно моя реакция могла показаться через чур резкой. Если это так, извиняюсь. Низовое объединение СПО-активистов может быть полезной формой организации. Просто эта форма не для меня и из-за этого я быть может излишне экстраполирую свой опыт командных начинаний.",
				"added": 1520332205
			},
			{
				"comment_id": 17,
				"body": "> [ktotut](#comment_10_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8): Смущает, что больше никто не высказался пока. :-)\n\nЕсть подозрение, что значительная часть всё ещё активной русскоязычной публики пришла сюда с лорчика и близких ресурсов. А там, как известно, культура больше ориентирована на успешный open-source, а не свободное ПО.",
				"added": 1520335604
			}
		],
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 15,
				"body": "Таки Китай от интернета не отключён, они его лишь фильтруют. Вот в кндр действительно свой кванмён, так там и зеронета никакого нет. Так что если прикроют в России интернет, то и с международным сегментом зеро будут проблемы.\n\nС другой стороны, поскольку это p2p сеть, то в теории ничто не мешает пробрасывать мосты в пограничных областях (на флешках почтовыми голубями) или через спутниковую связь (хотя вроде кто-то и её глушить предлагал, лол). На практике проблемы с синхронизацией возникнут наверняка.\n\nНо вообще я сомневаюсь, что кто-то всерьёз собрался физически отключать сеть в ближайшее время.",
				"added": 1520329663
			},
			{
				"comment_id": 20,
				"body": "> [zorg13](#comment_5_1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2): на MESH сети переходить надо, вот реальная альтернатива. не запретить, не контролировать, не отключить!\n\nВообще-то публичные mesh-сети во многих странах запрещены (их можно подвести под соответствующие законы). Контролировать сложнее, но зачастую достаточно показательных посадок, если вдруг это дело пойдёт в народ.",
				"added": 1520876788
			}
		],
		"1_1KFqej3sgCjw62yRAqgdaGUzmTAuSDmbW2": [
			{
				"comment_id": 18,
				"body": "Таки запилить зайт или запилить осмысленный зайт? Если первое, то в 0hello в меню \"Create new, empty site\". И в принципе статику (в т.ч. js) туда можно сразу кидать; если ссылки относительные, то даже будет работать. А с документацией по тому, как делать нормальные динамические зайты всё очень плохо даже на английском.\n\nНо с другой стороны можно действительно просто клонировать что-нибудь — тут большинство зайтов такие. Правда это приводит к тому, что большинство из них устаревают и вообще много времени тратится на ручное управление. Эту проблему должны бы решить merger-зайты, но как раз по ним документации мало/трудно найти.",
				"added": 1520690802
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 19,
				"body": "> [zalex](#comment_109_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Основная проблема с переводом \"merger zites\" на русский...\n\nМне лично люди, использующие перевод \"merger\" не встречались. Так что думаю, что и переводить особого смысла нет. Со временем конечно кто-нибудь станет использовать \"мержер\" или \"мёджа\" или даже \"разделяемый\", \"концентратор\", \"сшиватель\", \"сливатель\" и т.п. Но для того, чтобы появилась норма, нужно прежде всего использовать слова в реальном контексте, а не при обсуждении перевода.",
				"added": 1520722925
			}
		],
		"2_1E4vzAAE4vRWc4TnnDJiJ5SvbNTq17emb": [
			{
				"comment_id": 21,
				"body": "https://ru.wikipedia.org/wiki/Kbps\nhttps://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D0%B3%D0%B0%D0%B1%D0%B0%D0%B9%D1%82\n\nДальше немного вычислений: перевести в одни единицы и умножить как в школьных задачах про скорости. Можно на калькуляторе. Чтобы не ошибаться, неплохо бы следить за типами единиц. Можно программу написать со строгой типизацией.",
				"added": 1523559270
			},
			{
				"comment_id": 22,
				"body": "> [anotherneko](#comment_39_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): 320/8*3600/1024=140.625 мбайт только там еще накладные расходы есть, так что на практике немного больше получится.\n\nВы математический бот? Хороший парсинг. Даже [wolfram alpha](https://www.wolframalpha.com/input/?i=320+kbps+hour+in+megabytes) осиливает только после перевода и упрощения. https://insect.sh/ понимает только `320kbps hour / MiB` (или MB). Что, кстати, даже чем-то хорошо для точных расчётов, ибо вынуждает задуматься над тем, мегабайты используются или мебибайты.",
				"added": 1523563040
			},
			{
				"comment_id": 24,
				"body": "К сожалению, по запросам вроде \"как задавать и отвечать на вопросы\" поисковики выдают всякую лабуду. Так что придётся всё же упомянуть \"научить ловить рыбу, а не дать рыбу\".",
				"added": 1523564578
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 23,
				"body": "Тоже заранее попрошу на всякий.\n\n>used: 23.0k/30k",
				"added": 1523563720
			}
		],
		"1_1HjPcm98huSQdRkf5F1VQs4w8caUgq6eA": [
			{
				"comment_id": 25,
				"body": "0net не является альтернативой интернетам. Скорее заменой http и отчасти вэба. А альтернативы интрентам — это мещ-сети. Вот в [соседней ветке](/193psz3yGj7EH39nyKb4A2KKBXEHT49Csf/?Topic:1523653054_1CvjHaj47ZxuXD1N8wLciYctgbnzGxARVN) человек про гиперборею пишет, так что видимо она существует. Было/есть ещё netsukuku. Вероятно и другие.",
				"added": 1523660248
			},
			{
				"comment_id": 26,
				"body": ">Он же может существовать даже, в условиях оффлайна\n\nНу да, насколько я понимаю может по приватной сети / локалке работать. Вероятно можно и вручную транспорт организовать. Но ни единой транспортной сети, ни протокола уровня ip вроде бы нет.\n\nТе же самые приватные сети могут тоже в оффлайне работать, если связность есть.",
				"added": 1523715667
			},
			{
				"comment_id": 27,
				"body": "> Не думаю, что на таком же самом уровне как зеронет.\n\nТак о том и речь, что это абстракция другого уровня. Те же самые torrent или ipfs тоже можно гонять на приватных сетях, а не в больших интернетах. И они тоже меньше страдают от потери связности, чем server-client архитектура.\n\nЕсли в определении интернета добавить, что это client-server сеть, то да, но тогда те же торренты тоже уже не интернет. Да и федеративные сети ala email под вопросом.",
				"added": 1523719566
			}
		],
		"3_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 28,
				"body": "В теории — просто подредактировать обработчик соответсвующий функции API, чтобы он спрашивал (либо при первой подписки на сайте, либо при каждом изменении).",
				"added": 1537546591
			}
		],
		"2_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": [
			{
				"comment_id": 29,
				"body": ">обживем\n\nДля обжития лучше бы на другой форум переехать, ибо тут 30К, а админа нет.",
				"added": 1544168712
			}
		],
		"10_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 30,
				"body": ">Из вебморды удалить понятно дело нельзя... \n\nНормально удаляется, хоть с 0hello, хоть из сайдбара",
				"added": 1544335816
			},
			{
				"comment_id": 31,
				"body": "> [balancer73](#comment_467_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw)\n\nА, да, с hello действительно не работает со своими, но с сайдбара норм.",
				"added": 1544354410
			}
		],
		"1_1DkpXcpJ5YBXnDpHFYveSsdj1aCbeEULrg": [
			{
				"comment_id": 32,
				"body": ">модерируемый\n\nТут админ даже лимит пользователям не увеличивает, что уж про модерацию. Но по концепции - да, админ может отмодерировать. Хотя обычно этим не злоупотребляют, это всё же возможно. Ну, стоит добавить, что исказить подписанные сообщение не просто, поэтому модерация будет либо забаном, либо так сказать \"косметическая\"\n\n[относительно современный \"списочек\"](/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/) с категориями, а так их тут полно разных",
				"added": 1546976981
			}
		],
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 33,
				"body": "Нет (за исключением пары полуживых блогов), все сидят на ~~англоязычных~~ неспецифично-язычных. Тут слишком мало людей, чтобы ещё по языкам делиться",
				"added": 1548024206
			},
			{
				"comment_id": 34,
				"body": "> [intervi](#comment_18_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk):1) Нормальный чат. Возможно с комнатами и конечно же с приватом\n\nЕсть [thunderwave](http://127.0.0.1:43110/1CWkZv7fQAKxTVjZVrLZ8VHcrN6YGGcdky/), правда привата вроде нет (комнаты есть)\n\n>2) Блоговая платформа. Многим всё-таки лень ковырять свой сайт, а так было бы больше интересного контента\n\nЕсть ощущение, что кому надо — те используют 0blog, статичный блог или ещё что (да тот же 0medium на крайняк; некоторые просто форум как бложик пользуют), и проблема (если вообще есть какая-то проблема) именно в контенте, а не в платформах для его публикации. Хотя, конечно, будучи далеко от состояния \"конечного юзера\", я могу ошибаться",
				"added": 1548122434
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 35,
				"body": "> [geekless](#comment_62_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А должно быть иначе в нецензурируемой сети?\n\nМне кажется, вопрос не в том, \"должно ли\", а в том, для каких целей годятся немодерируемые и модерируемые сети. Большинство пользователей просто не станет сидеть на заспамленном форуме, поэтому если кто-то ставит целью привлечение новых людей, разумно предоставить \"чистый\" вариант. Самое простое — ненавязчиво предлагать приглашаемым использовать свой блэклист, если им лень чистить самим (а потом можно и цензурой заняться).\n\nСобственно, насколько я понимаю, одна из целей \"совета\" может заключаться именно в том, чтобы занять эту нишу группой (предположительно) независимых людей, а не каким-нибудь хорошо организованным любителем цензуры.\n\nОпять-таки похожая картина со списками сайтов. Для нового пользователя без связей такие списки сильно определяют какие сайты он увидит. В идеале было бы неплохо сделать возможность легко шарить свои списки с рекомендациями, но даже это не спасёт от замкнутых \"пузырей\", поэтому какой-то актульный список для создания изначального (предположительно хорошего) обзорного пузыря тоже был бы неплох",
				"added": 1548668340
			},
			{
				"comment_id": 36,
				"body": "> [geekless](#comment_66_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):\n> Пусть будет много \"пузырей\", соревнующихся за внимание пользователя.\n\nСуть пузырей именно в том, что пользователи не видят ничего за пределами своего ;) А выползают из него только в экстренных ситуациях.\n\n> А вот когда пузырь претендует на то, что быть всей сетью - это плохо.\n\nКонечно. Можно предупреждающую табличку повесить. Вот только какие-то ссылки у пользователей всё равно будут на первых строчках (понятно, что не у всех одинаковые; те, кто активно приглашают в 0net всегда могут предлагать свой каталог). И кто-то будет принимать решения, какие.\n\n> То есть сейчас мы понимаем, что такие сервисы как ZeroSites или ZeroWiki дают лишь частный срез сети, и это только один из возможных каталогов сайтов\n\nВо многом такое понимание возникает из-за того, что сеть всё ещё достаточно мала и пролистав один каталог мы можем продолжить искать что-то новое (хотя многие просто уходят). Если представить хоть сколько-то масштабный приток активных пользователей, любителей лазить по каталогам значительно поубавится. Частные рекомендации никуда не денутся, но конкурировать \"домашние страницы зеронета\" будут скорее всего в маленьком тесном кругу",
				"added": 1548684278
			},
			{
				"comment_id": 37,
				"body": "Попозже напишу подробнее, а пока пара мелких замечаний из того, что сразу бросилось в глаза:\n\n> The person ~~is agree~~agrees to follow the Rules, listed in this Code.\n\n> 8Administration*\n\n> It is a ~~pure~~purely technical mean in order to provide the better service to the people.\n\nПравда, всё равно на мой слух не очень звучит, потому что means обычно во множественном числе.\n\nНу и,\n\n> Для non-optional files - 1 гигабайт на пользователя\n\nВот этого точно делать не стоит. Не у всех есть желание (и возможность) скачивать и сидить гигабайты контента только потому, что это контент \"проверенных\" пользователей. Не говоря уже о том, что это сделает атаку очень простой (не надо регистрировать много пользователей)",
				"added": 1548736663
			},
			{
				"comment_id": 38,
				"body": "Что-то я медленно мысли по всему этому поводу излагаю, поэтому буду постить понемногу. Для начала, общие тезисы по поводу техническо-административной части:\n\n- сеть будет развиваться, в том числе возможны изменения частично ломающие совместимость\n\n- при этом данные можно практически свободно мигрировать с сохранением подписей (единственное ограничение при нынешней системе – обычно одна подпись пользователя на весь сайт; но учитывая, что подписываются вроде бы только `content.json` с хешами файлов, то достаточно распространять его и нужные файлы, а не весь сайт)\n\n- на данный момент всё это очень мало автоматизировано и зеронет обычно воспринимается как такой \"чёрный ящик\", из которого торчат монолитные сайты с SQL (и немного файловой системы), но если рассуждать на перспективу нескольких лет или тем более десятков лет, можно предположить, что создание подобной автоматизации не будет критическим препятствием",
				"added": 1548773944
			},
			{
				"comment_id": 40,
				"body": "> [gluckman](#comment_25_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy):\n> Мне кажется наша проблема не только и не столько в технике, сколько в отношении друг к другу.\n\nПоддерживаю. Собственно я вижу смысл в каком-то объединении прежде всего в том, чтобы собрать людей, разделяющих некоторые базовые ценности и создать продуктивную атмосферу. Многие конкретные задачи можно решать и поодиночке, была бы мотивация. Но недоверие (как к платформе, так и к конкретным людям), враждебность и даже просто \"бытовые\" конфликты мотивации мягко говоря не способствуют. Поэтому создать площадку для обсуждения, где всё это будет минимизировано, было бы замечательно.\n\n\n> [geekless](#comment_74_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):\n> Limit 1    1M\n> Limit 2    50M\n> Limit 3    1000M\n\nЯ всё равно не понимаю, зачем может понадобиться больше 5-10М для *неопционального текста* (понятно, что ещё технический оверхед есть, но это опять же мелочи). В конце концов, если кто-то реально начнёт подходить к пределу пока админы на месте, можно увеличить – и такое не будет случаться часто. А ситуация когда админов нет, а предположим какого-то заслуженного пользователя взломали и с его аккаунта сайт забивается гигабайтом мусора, тоже не очень-то приятная.\n\nВпрочем, это всё-таки больше технические детали и я обращаю на них внимание в большей степени лишь потому, что кого-то это может сразу отпугнуть (хотя, конечно, лимит у пользователя в приоритете, но это ещё надо знать).\n\nЧто касается самого документа. Я так понимаю, что это предполагается как \"правила\"? Потому что для \"манифеста\" слишком много внимания техническо-административным вещам и слишком мало – о целях. Думаю что для привлечения пользователей манифест важнее.\n\nДальше. Я не вижу большого смысла начинать с создания всех \"сервисов\" (опять-таки слово наверное не очень подходящее); здесь очень частая картина, когда разделов больше, чем пользователей. Опять же это может быть воспринято как попытка \"подмять всё под себя\" или \"сделать всё с нуля\".\n\nДумаю, стратегия \"release early, release often\" будет очень кстати. Если прописать цели (помимо общей – развития сети – более конкретные цели создания площадки; с моей точки зрения стоит добавить что-нибудь вроде \"создание дружественной и продуктивной атмосферы сотрудничества\"), запустить один форум и начать работу, людям проще будет прийти, присоединиться, понять что это такое по делам",
				"added": 1548861107
			},
			{
				"comment_id": 41,
				"body": "> [gomzik](#comment_110_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): No peers found :(\n\nА если [так](http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?zeronet_peers=188.234.3.226:18293,xprew2x7me5fnsu3.onion:15441,d7dtctpb5uz2yyyi.onion:15441,jom76rffsgpalrih.onion:26579,tdkdphub33saddcg.onion:15441,jfgifusjsgrmketh.onion:20431,2nqcylces5ohk6ij.onion:15441,xprew2x7me5fnsu3.onion:15441,t4bu3uwrwgjlxcl6.onion:15441,d7dtctpb5uz2yyyi.onion:15441,gw3jgdvuok3cdtzw.onion:20431,jom76rffsgpalrih.onion:26579,qb5m4pp4zvmd6jib.onion:36171,tdkdphub33saddcg.onion:15441,jfgifusjsgrmketh.onion:20431,zjos2iar4o2dfplv.onion:15441,dqmyunmdwldkyjpg.onion:36171,72psll7cezsi4zph.onion:31591,ilwnhmutjqixshsb.onion:18293,z7vltg7pivxinh3n.onion:15441) (ссылка со списком нод)?\n\n~~А до моей ноды сообщения gluckman не доходят :(~~ всё, вроде появилось, хотя задержка так себе\n\ngeekless, ещё деталь по технической части: было бы неплохо добавить альтернативные центры сертификатов (во всяком случае, если делать белые списки, это не должно вызвать особых проблем со спамом)",
				"added": 1548930927
			},
			{
				"comment_id": 42,
				"body": "> [gluckman](#comment_28_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Возмолжно проблема в том что я использую TOR\n\nВозможно, но сейчас такого нет. Вообще бывают такие сбои и как их отследить не очень понятно",
				"added": 1548931333
			},
			{
				"comment_id": 43,
				"body": "> [geekless](#comment_88_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Проблема в том, что альтернативных центров сейчас просто нет. Их нужно будет делать самим, либо ждать, пока кто-то сделает. У krixano был, но он давно не появлялся в сети, может быть подзабил уже...\n\n[Вот](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS), например, небольшой список. Аккаунты с kaffieid даже встречаются в дикой природе.\n\nА krixano:\n\n> I feel like the internet and ZeroNet are making me talk less and less nicely with time... maybe I should stay off of it for a while...\n\n***\n\n> [bitcoren](#comment_1_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv): Кто может исправить баг с невозможностью скачать optional files при подписи зайта из командной строки?\n\nНе знаю, что за баг, но может лучше отдельную тему создать?",
				"added": 1548942630
			},
			{
				"comment_id": 44,
				"body": "> [geekless](#comment_90_1GooUE19488nDwG3TdkM8seYAHct4gjkq4):\n> На любое имя можно выписать любое количество сертификатов.\n\nОго, спасибо за информацию. Тогда да, печально.\n\n> Плохо то, что фильтрация пользователей в правилах блока permissions в content.json производится по имени, но не по ключу.\n\nДействительно. Впрочем, думаю, это должно быть нетрудно пофиксить.",
				"added": 1548946935
			},
			{
				"comment_id": 45,
				"body": "> [geekless](#comment_91_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я лох, адреса тоже поддерживаются\n\nАга, у меня тоже получилось ;)\n\n900К есть",
				"added": 1548948115
			},
			{
				"comment_id": 46,
				"body": "> [geekless](#comment_93_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): caryoscelus, вы согласны стать модератором на форумах Совета?\n\nДа, по мере сил ;) Впрочем, надеюсь, что люди будут адекватными и особо усердствовать не придётся.\n\n> Но если подумать, то это логично.\n\nС одной стороны да, с другой – было бы столь же логично предупреждать пользователей о том, что сообщения подписаны не автором, а модератором. А так получается, что если модератор изменит, а юзер не заметит, то потом подпишет отредактированные изменения своим ключом :/\n\nВообще было бы неплохо сделать модерацию не изменением контента, а добавлением флага \"отмодерировано\" (собственно, можно и вовсе патчи накладывать).\n\nКстати, тут как раз движок милчана на merger перевели; может там что-то интересное есть.\n\n(Немного оффтопа, но вообще всё больше складывается ощущение, что фронт/апи зеронета надо будет в какой-то момент как следует пересмотреть)\n\nПо правилам: у меня ощущение, что можно было бы сделать их лучше с точки зрения восприятия (условно говоря, мы хотим того-то и того-то, поэтому тех-то придётся банить); не знаю, насколько это реально и значимо, но как время освободится, попробую расписать конкретные предложения",
				"added": 1549029703
			}
		],
		"2_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 39,
				"body": "> [quirrel](#comment_20_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Этот форум посвящен глобальным вопросам технического характера.\n\nА это кстати точно? Что-то никакого описания этого места (кроме того, что это форум первого апреля) найти не удалось",
				"added": 1548773993
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 47,
				"body": "weechat нормально работал, пока не сдох :( Pidgin с самого начала плохо работал (регулярно терял соединение и не подавал виду). Так что пока использую riot (web). Работает норм, но тянет за собой браузер, что печально\n\nПо серверу не скажу, пользуюсь чужим\n\nВ целом опять-таки нормально (как чат; видео/аудио звонки не пользую), даже не знаю чем ещё делиться..",
				"added": 1549719956
			}
		],
		"2_13yET77xHP1vpHmJf9a3fbdct3vB5PpzWT": [
			{
				"comment_id": 48,
				"body": "Вы ошиблись. Очередь в рабство - через дорогу.",
				"added": 1556533382
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 49,
				"body": "Cобственно главная проблема нехватки пользователей именно в том, что у каждого свои интересы, поэтому интересных сайтов для конкретного человека может и вовсе не найтись",
				"added": 1557170426
			}
		],
		"2_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 50,
				"body": "Обычно имеется в виду хаб в 0me или другом сайте, использующем \"merger\". Пожалуй, самая близкая доступная аналогия - серверы в федеративной сети, будь то email или какая игра. У хаба есть владелец, на нём можно (обычно) постить контент, который будет доступен, если \"подключиться\" к хабу (с т.з. подключения не отличается от обычных зайтов)\n\nДругими словами: кусок данных, предназначенных для определённого сайта, контролируемый некоторым владельцем (необязательно связанным с владельцем основного сайта), который надо скачивать отдельно (и, соответственно, можно скачивать, а можно нет)",
				"added": 1557249178
			}
		],
		"1_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 51,
				"body": "Если добавить префикс /raw, iframe'а не будет. Если все ссылки относительные, то вроде даже нормально работает со статикой (а вот js оно тоже режет)",
				"added": 1557391418
			},
			{
				"comment_id": 52,
				"body": "> [if0](#comment_5_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \n> Но если попробовать перейти по ссылке без префикса, например со страницы Hello ZeroNet_, то вылетает ошибка: \"Server error\" и приходится добавлять префикс /raw в адрес в ручную.\n\nЧто это за сайт такой, что приводит к ошибке, если его поместить в iframe?",
				"added": 1557421287
			},
			{
				"comment_id": 53,
				"body": "> [if0](#comment_7_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Ошибка в строке: title = site.content_manager.contents[\"content.json\"][\"title\"]. Да, действительно отсутствовало поле \"title\" в файле content.json после его автоматической генерации. Добавил. Теперь ошибки нет, но почему то игнорируются префиксы /raw и все открыватеся в iframe, как это было изначально...\n\nДаже не знаю. Без возможности потестить, не очень понятно, что можно ещё сделать. У меня на [почти статическом сайте](/raw/1FiHm91tcDdjkiGkHZH2xoMc7Qmzrh8sv3/) всё (кроме js) работает, если по `/raw` заходить; в том числе внутренние ссылки правильные (тоже на `/raw`).",
				"added": 1557495853
			},
			{
				"comment_id": 54,
				"body": "> [if0](#comment_8_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Если сразу переходить на сайт по ссылке, содержащий /raw, то будет работать. Странность в том, что если открыть сайт по обычной ссыле, то все внутренние ссылки, которые содержат /raw начинают отображаться в iframe. Проблема в том, что при такм отображении перестают работать анкеры, при переходе по ссылкам их содержащих, что существенно нарушает работу сайта.\n\nА зачем внутри сайта делать ссылки на `/raw`? Можно же просто относительные ссылки делать; кто приходит по raw ссылке — продолжит видеть raw-версию, кто по обычной —продолжит видеть обычную. Если в iframe что-то не так работает, можно всем давать ссылку на raw",
				"added": 1557516887
			}
		],
		"2_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8": [
			{
				"comment_id": 55,
				"body": "В 0hello ⋮-меню → \"manage blocked users and sites\"",
				"added": 1557814207
			}
		],
		"2_1DR9EVmTR2KA8mJXmzTknbEAUzveKLRJut": [
			{
				"comment_id": 56,
				"body": "Поискать телепатов? Или, на крайний случай, объяснить проблему подробнее",
				"added": 1558017083
			}
		],
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": [
			{
				"comment_id": 57,
				"body": "Какой переводчик?\n\n> а что делать,\n\nВ зависимости от цели/возможностей: учить, переводить со словарём, забить, попросить перевести, использовать машинный перевод, угадывать значение, медитировать, найти готовый перевод\n\n> [deliriumgoddess6](#comment_75_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): тут есть переводчик???\n\nУчитывая сколько тут народу, вероятно даже не один",
				"added": 1559319841
			},
			{
				"comment_id": 58,
				"body": "> [reflevmas3](#comment_1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm): гугл переводчик\n\nНу копипастой должен работать. А так — разве что через прокси, да и то не знаю",
				"added": 1559320473
			}
		],
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 59,
				"body": "> [anamvyo](#comment_1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2): Так что мне делать в этой ситуации?\n\nМожно ничего не делать - как-то работает и без открытого порта. Можно попробовать копаться с роутером.\n\nВ любом случае полезно активировать тор, это тоже поможет увеличить связность. Вообще многие тут сидят в тор-онли режиме, и тогда порт вообще неактуален",
				"added": 1559361685
			}
		],
		"2_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 60,
				"body": "> Нету там никакого Create new, empty site\n\nА как вообще меню выглядит? Скрин можно?",
				"added": 1559361792
			},
			{
				"comment_id": 61,
				"body": "> [anamvyo](#comment_2_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2): здесь нет возможности скрина\n\nОбычный скрин экрана, можно отрезать только меню.. Либо в некоторых браузерах есть встроенная возможность (в firefox в \"...\"-меню адресной строки)",
				"added": 1559362029
			}
		],
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": [
			{
				"comment_id": 62,
				"body": "Молодец. Хорошая мотивация. Правильная. Пиши ещё.",
				"added": 1559920726
			}
		],
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 63,
				"body": "~~Счастье не нужно~~ если серьёзно, то у меня нет уверенности, что до конца понимаю, что под этим словом подразумевают другие люди. У меня-то особого стремления к \"счастью\" (почти?) никогда и не было.\n\n> Если устранить все факторы стресса, то неизбежна деградация личности.\n\nРазве деградирующая личность не может быть абсолютно счастлива?",
				"added": 1561364734
			},
			{
				"comment_id": 64,
				"body": "> [geekless](#comment_127_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Только если под наркотой?..\n> Думаю, всё равно человек существо социальное, и встроенный индикатор \"по меркам общества я деградирую\" будет сигналить.\n\nЧтобы не было социальных проблем, деградировать надо в обществе себе подобных, счастливых и деградирующих ^_^",
				"added": 1561368005
			},
			{
				"comment_id": 65,
				"body": "А вообще мне кажется большинство людей не замечают когда деградируют",
				"added": 1561368420
			},
			{
				"comment_id": 66,
				"body": "> [if0](#comment_54_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Логично. Как можно стремиться к тому, что не понимаешь?\n\nМожно стремиться следовать общепринятым рецептам достижения счастья, не разобравшись до конца с тем, что же оно всё-таки значит.\n\n> Каждый понимает по разному.\n\nЕсли каждый по-разному, то и смысла в слове нет.\n\n> Думается, что это - душевное спокойствие, комфорт, умиротворенность, согласие с самим собой и окружающими.\n\nЧто, если один пункт из этого списка противоречит другому? Счастья нет?",
				"added": 1561385604
			},
			{
				"comment_id": 67,
				"body": "> [if0](#comment_65_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Потому что их - нет. Это придуманная фикция.\n\nДа ладно, сколько мелких чиновников выжимают удовольствие из помыкания людьми. Власть у них есть, хоть и ограниченная, а зарплаты так себе, особенно не напотребляешься. Или те же учителя. Или, если всё же интересны примеры власти покрупнее, можно найти много исторических примеров умеренных в потреблении властолюбцев",
				"added": 1561385778
			},
			{
				"comment_id": 68,
				"body": "> [if0](#comment_71_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Слабоватая мотивация для достижения подобного счастья: иди туда - не знаю куда, сделй то - не знаю что, причем, с неизвесным результатом.\n\nКак раз таки шаги обычно понятны: закончить учёбу, найти партнёра противоположного пола, \"нормальную\" работу, пожениться, детей завести и т.п. А результат: ну типа всё хорошо будет. Вроде как-то так люди обычно и живут, не вдаваясь в тонкости того, что же именно такое это счастье\n\n> Почему же? Это - собирательное понятие.\n\nВсё равно, должен быть критерий, по которому можно сказать, что может называться счастьем, а что нет. Понятно, что допустим для каждого счастье будет достигаться разными способами, но если между самим по себе счастьем одного человека и счастьем другого нельзя найти общего смысла, то и непонятно зачем такое понятие. Кто-то может сказать \"когда меня бьют молотком по пальцам, я испытываю острое счастье\". Если у слова \"счастье\" нет общего смысла, то как определить, заблуждается ли этот человек по поводу значения слова, или и вправду что-то такое испытывает? И вообще, может ли счастье быть одномоментным, или обязательно протяжённым во времени?",
				"added": 1561389124
			},
			{
				"comment_id": 69,
				"body": "> [ultraviolet](#comment_41_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Критерий прост - мнение самого человека\n\nЧеловек может не знать, что значит \"счастье\". Или из какого-то контекста может вообразить, что \"счастье\" значит конкретно то-то и то-то, и потом использовать (и понимать) это слово только в этом (возможно частично верном, возможно вообще неверном) смысле. Мнение такого человека должно быть иррелевантно по отношению к языку вообще",
				"added": 1561409839
			}
		],
		"1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 70,
				"body": "> [geekless](#comment_157_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Встал на раздачу.\n\nСпасибо\n\n> Что-то новенькое. :)\n\nВсего лишь очередное проявление социофобии ;)\n\n> Сайты жалуются, что Layout default not found.\n\nДа, это известная проблема с моим кривым движком, но всё никак руки не дойдут разобраться и поправить, ибо на самом-то деле всё работает. Основной сайт так вроде и вовсе не жалуется",
				"added": 1561529429
			}
		],
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 71,
				"body": "Собственно демократия ~~не нужна~~ — всего лишь местами полезный инструмент для достижения прав, свобод или даже куска хлеба\n\n> Капиталист во всех ваших последующих страданиях виноват не больше, чем лев, который вас сожрал, если вы в решили прогуляться по саванне без оружия\n\nТо есть с точки зрения жертвы вполне себе виноват в достаточной мере, чтобы жаловаться ;) Думаю, тут вопрос о доверии к людям (а ведь те самые компании тоже делаются людьми, и многие начинаются с маленьких стартапов, где это ещё заметнее). Конечно, если смотреть с позиции \"капиталист - пролетарий\", то опасность что сайт \"испортится\" очевидна, но наверное можно упустить другие моменты",
				"added": 1561757811
			}
		],
		"1_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": [
			{
				"comment_id": 72,
				"body": "> В Росси блокируют Аниме.\n\nВсё настолько плохо?\n\n> Что делать?\n\nДелать аниме, конечно ^_^ Или революцию, или ноги, кому как больше нравится. В общем, вариантов масса, даже помимо очевидных обходов блокировок",
				"added": 1561805249
			},
			{
				"comment_id": 102,
				"body": "> [if0](#comment_164_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Люди гибнут тысячями в ДТП, а тебя беспокоит горящий лес.\n\nЛюди гибнут тысячами от голода, а тебя беспокоят ДТП",
				"added": 1564844233
			},
			{
				"comment_id": 103,
				"body": "> [if0](#comment_166_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Грядет глобальное изменение климата, от которого погибнут миллионы, а тебя беспокоят тысячи, гибнущие от голода.\n\nГрядёт тепловая смерть вселенной, а вас тут всех в треде беспокоят какие-то люди",
				"added": 1564867472
			},
			{
				"comment_id": 105,
				"body": "> [if0](#comment_175_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Это надо было сказать на следующей итерации. Сейчас должна идти реплика про \"Солнце, которое погаснет\"...\n\nТогда уж не погаснет, а превратится в красного гиганта и испортит и так сомнительный климат окончательно (если конечно со времён моего изучения этих процессов научная т.з. не изменилась..)\n\nПроблема только в том, что на это можно было бы ответить, что ч-во к тому времени расселится по галактике или хотя бы просто свалит на большом \"ковчеге\". А если этого не сделает, то скорее всего самовыпилится до этого\n\nА если жалко само солнце, то да, конечно. Но это по-моему более сомнительно, чем беспокоиться о китайских порномультиках или вселенной",
				"added": 1564869189
			},
			{
				"comment_id": 112,
				"body": "> [anonymouslogin](#comment_29_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Подскажите название, не получается найти этот китайский мультик.\n\nЯ уже больше джвух лет такой мультик жду, видимо придётся пилить своими силами",
				"added": 1564931673
			}
		],
		"9_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 73,
				"body": "Что-то уведомление мне не пришло, теперь уже и не знаю, что могу добавить. Да собственно я во внутренностях 0нет и не разбираюсь. Разве что покритиковать императивный код?..\n\n```\nfilter(None, map(self.getNormalizedTrackerProtocol, supported_trackers))\n```",
				"added": 1562151249
			},
			{
				"comment_id": 74,
				"body": "> [geekless](#comment_203_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Покритиковать - это дело. Я в питоне не разбираюсь. xD\n\nТут скорее дело не в питоне, а в императивном vs функциональном подходах. Я так-то тоже всех деталей не помню / не знаю, но к счастью map и filter названия почти универсальные, а дальше help(map) подсказывает порядок аргументов",
				"added": 1562153942
			},
			{
				"comment_id": 75,
				"body": "> против того, чтобы пользователи сами добавляли трекеры\n\nРазве?",
				"added": 1562272474
			},
			{
				"comment_id": 76,
				"body": "> [geekless](#comment_206_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Нет смысла добавлять трекер себе в конфиг, будешь как дурак один сидеть на этом трекере. Без автоматического обмена это не имеет никакого смысла.\n\nА, ну в этом смысле м.б. Мне казалось какой-то обмен был, но может что-то и путаю",
				"added": 1562274973
			},
			{
				"comment_id": 77,
				"body": "> [geekless](#comment_207_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Краткий результат моего с ним общения: \"Обмена списками торрент-трекеров нет и не будет. Потому что я так сказал.\" \n> Пофиг, что зеро-трекеров работает 10 штук на весь интернет, а публичных торрент-трекеров только в одном частном списке на гитхабе больше 60 штук.\n> Я хотел сесть за проектирование плагина для DHT, который будет использовать существующую инфраструктуру всех DHT-пиров торрента для своего блага (и прозрачно переходить на собственный протокол при работе через тор), но теперь всерьёз подозреваю, что PR завернут с теми же возражениями \"потому что гладиолоус\":\n> \n> Торренты не поддерживают адреса onion.\n> Протокол требует \"слишком много\" пропускной способности сети.\n> Зеро-трекера и PEX достаточно для всех.\n> \n> На вопрос, будет ли он принимать PR с DHT, он не ответил.\n> Какая-либо логика в этих возражениях отсутствует, если подходить с инженерной точки зрения, но присутствует, если предположить, что весь смысл в том, что пользователи ZeroNet сидели в своей песочнице, подконтрольной разработчику ядра, и носа в большой мир не выказывали.\n> Обмен осуществляется только списками трекеров, поднятых средствами самой ZeroNet, и только теми, что осмелились работать на публичных IP. Чтобы было, куда ОМОНом вламываться? Какое совпадение!\n> Извините за паранойю, но другого объяснения у меня нет. Абсолютная глупость или диверсия. Nofish на глупого не похож. Как-то так.\n\nМмм, грустно, конечно. Но не думаю, что дело в омоне. Думаю, у него тоже может быть паранойя на тему \"а вдруг кто специально внедрится и всё сдаст омону\" (или попросту не уследит за секьюрити), а напрягаться пытаться установить доверие влом. Конкретно по поводу обмена трекерами не знаю, но думаю могут быть какие-то (пусть и ошибочные) соображения (вплоть до банального: не хочется проверять, что это не приведёт к какой-либо атаке, а оно же и так работает).\n\nРаз пошла движуха на тему форков / альтернативных имплементаций, я тоже свои мысли потом напишу (не по сетевой части, я тут почти полный ноль, а вот по поводу api/движков/js)",
				"added": 1562332488
			}
		],
		"1_1C13FHoaHvm2hxG5VrooYN1z4fKybvz9Yd": [
			{
				"comment_id": 79,
				"body": "Пароль от вайфая что ли?",
				"added": 1562683819
			},
			{
				"comment_id": 80,
				"body": "> [geekless](#comment_229_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): На LOR-е этим заканчивают, а тут можно с этого начать.\n\nЛол ;)",
				"added": 1562687483
			},
			{
				"comment_id": 81,
				"body": "> [geekless](#comment_235_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Непоправимая катастрофа лечится кнопкой Mute.\n\nВсё-таки не совсем. По-настоящему профессиональный флудер очевидно про неё прознает ^_^\n\n> [if0](#comment_118_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Если в ZN заведется \"профессиональный флудер\" - это будет непоправимая катастрофа.\n\nТоже не соглашусь. При совсем плохом сценарии можно закрыть регистрацию новых пользователей, а все существующие аккаунты флудера внести в чёрный список / поудалять их / их контент. Правда, вероятно придётся в срочном порядке переработать мехнизм блокировки (сейчас-то данные продолжают храниться)",
				"added": 1562736006
			},
			{
				"comment_id": 82,
				"body": "> [if0](#comment_120_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Проблема будет с вычещением контента. \"Профессиональный\" флудер будет флудить не с десятка, а с сотен аккаунтов и не на одном форуме, а на всех популярных ресурсах.\n\nДа не важно, на скольких ресурсах, блоклисты-то универсально работают. Кому (из владельцев) надо будет - почистят автоматом, на остальных пользователи сами будут использовать блоклисты (но да, надо сделать, чтобы они нормально работали).\n\n> [geekless](#comment_236_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если банить средствами форума, то данные не будут распространяться. На уже загрузивших узлах придется вручную вычистить, это да.\n\nДа, если каждый админ будет банить. Но, например, в этом чатике это маловероятно.\n\n> У меня мысль появилась. Можно напилить плагин, который заставляет вместо настоящего content.json грузить, например, content.overloaded.json (при наличии последнего). А этот второй генерируется движком самого сайта на лету. Это позволяет динамически управлять местом на сайте из JS-кода, не имея приватного ключа.\n> Т.е. в итоге вместо подписывания лимитов напрямую, мы подписываем код, который формирует лимиты.\n> А дальше куча опций: управление на основе PoW, на основе лайков, на основе мнения доверенных пользователей и т.п.\n> Проблема в том, что нужно либо держать сайт запущенным, либо использовать плагин @gitcenter-а для фоновой работы.\n\nЧем больше мешанины из js, тем больше вероятности, что что-то пойдёт не так.. Я вообще думаю, что надо js выкинуть и заменить на безопасный язык и API",
				"added": 1562781749
			},
			{
				"comment_id": 83,
				"body": "> [if0](#comment_121_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Куда бы проще обстояло дело, если отделить сообщения пользователя от зайта - каждый пользователь использовал \"персональный хаб\" - служебный зайт хранящий все сообщения определенного аккаунта. Хотите видеть чьи-нибудь сообщения - загрузите и синхронизируете его хаб. При удалении такого хаба - автоматом полностью удаляются все сообщения данного пользователя со всех ресурсов. Потербуется только список забаненных адресов, что бы не появлялись запросы на их повторную загрузку.\n> \n> Админобан - это элемент цензуры. Каждый пользователь должен сам решать, чьи сообщения он хочет читать, а чьи - нет.\n\nВ принципе да. Правда, любая защита от флуда содержит элементы централизации (в случае схемы \"по хабу на пользователя\" где-то должен храниться список хабов; в случае с флуд-атакой большая часть пользователей скорее всего предпочтёт использовать списки в которых флудеров нет). Но да, такая централизация всё же более \"добровольная\"\n\n> Хотя бы был бы предоставлен выбор: использовать его или нет...\n\nЕсли автор использует js для функционала своего сайта, пользователю выбирать приходится \"использовать или не использовать\" весь сайт целиком",
				"added": 1562849626
			},
			{
				"comment_id": 84,
				"body": "> [if0](#comment_123_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x):\n> Увы, это так... Представление доминирует над содержанием. Хотя использовать JS реально оправдано и необходимо лишь в некоторых специфических cлучаях.\n\nВ случае 0нет сайты без js выглядят печально (из-за iframe любой переход по настоящим ссылкам тормозит, разве что `/raw` использовать), не говоря уже о том, что динамики не будет. Но если говорить про *реальную* оправданность, то использовать Тьюринг-полный язык реально не оправдано. Вообще ^_^",
				"added": 1562855541
			},
			{
				"comment_id": 85,
				"body": "> [if0](#comment_127_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Действительно, с точки зрения распределенной сети такая форма выглядит предподчтительнее существующей на данный момент. Странно, что никто сразу так не сделал, а решил \"хранить и распростронять\" сообщения вместе с форумом, или придумал костыльные полумеры с \"коллективными хабами\", подконтрольными одному владельцу.\n\nНасколько я понимаю, в зеронет вначале были \"обычные\" сайты, а \"интерактивность\" добавлялась постепенно, поэтому вот так исторически и сложилось",
				"added": 1562859206
			}
		],
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 86,
				"body": "Не-не-не, я скорее передам! 1PC9aZC4hNX2rmmrt7uHTfYAS3hRbph4UN",
				"added": 1563957834
			}
		],
		"1_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": [
			{
				"comment_id": 87,
				"body": "Только если в настройках выбрать, чтобы весь трафик шёл через тор (и трекеры тоже, ага)\n\nА тор браузер на это не влияет, хотя как один из вариантов защиты от сторонних трекеров сгодится",
				"added": 1564424417
			},
			{
				"comment_id": 88,
				"body": "> [ngc](#comment_5_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L): Значит если в настройках стоит TOR olways значит весь траф всегда через тор идет?\n\nЕщё трекеры надо через тор поставить (tracker proxy: tor). И опять же, если на сайте есть сторонние ресурсы, то они будут грузится как браузер захочет (т.е. надо либо через тор браузер, либо резать сторонний трафик (например, через uMatrix))",
				"added": 1564425322
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 89,
				"body": "> [if0](#comment_142_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Такому количеству (нескольким десяткам активных пользователей,  сотне - иногда заглядывающих и сотне - интересующихся) с избытком хватает официального клиента.\n> \n> Близок, но торрент протокол имеет принятый стандарт, согласно которому пишутся альтернативные клиенты, а ZN - нет, потому что им рулит не согласующий развитие комитет, а один человек, который в следующей версии может все изменить, наплевав на все альтернативы, которые превратятся в тыкву. Пока не будет стандарта, никто не будет тратить личное время на занятие ерундой.\n\nТем не менее желающих создать альтернативный зеронет хватает (ну, большинство-то, наверное, никуда не продвинется, но тем не менее). Стандартов раньше и в вэбе не было, а браузерные войны ерундой не считались ;) Если альтернативным клиентом будут пользоваться, то и автору оригинала придётся считаться. И потом, и так приходится считаться с теми, кто обновляется раз в тринадцатое полнолуние",
				"added": 1564426298
			},
			{
				"comment_id": 90,
				"body": "> [if0](#comment_144_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x):\n> Это - в идеале, а реальность куда более жестока. Для начала некто должен изъявить желание и написать хотя бы один такой клиент, который неприменно должен чем-то превосходить референсный, что бы им хоть кто-то захотел воспользоваться...\n\nНу а если он не превзойдёт, то и смысла особо нет, так что не очень ясно, где же тут жестокость ;)",
				"added": 1564483416
			},
			{
				"comment_id": 91,
				"body": "> [if0](#comment_146_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Жестокость в том, что в развивающихся проектах, находящихся на стадии \"макетной обкатки концепции\", никто не будет заботится об обратной совместимости, и стабилизировать стандарты. Но при этом, подобные проекты, обычно держащиеся на энтузиазме разработчиков, могут находится на данном этапе долгими годами, так и не достигнув стабильной версии, пригодной для массового использования.\n\nНу и когда в 0нет последний раз ломалась обратная совместимость?",
				"added": 1564488615
			},
			{
				"comment_id": 92,
				"body": "> [if0](#comment_147_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Факт того, что она не ломалась до этого, не является гарантией, что она также впредь никогда не будет ломаться.\n\nНу и аргументов в пользу того, что будет, тоже нет. А гарантией обычно являются толпы пользователей, которые не хотят/не могут обновляться когда выходит новая версия. Думаю, тут таких достаточно",
				"added": 1564491256
			},
			{
				"comment_id": 94,
				"body": "> [if0](#comment_150_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x):\n> А на крипту, тем более полученную анонимным путем - колбасу в магазине не купишь\n\nНу обналичиваешь и покупаешь, если так нужна колбаса. Какие проблемы? Хотя, конечно, в некоторых странах могут и за колбасную крипту привлечь, наверное",
				"added": 1564755842
			},
			{
				"comment_id": 95,
				"body": "> [if0](#comment_152_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для начала, что бы потратить крипту, ее надо от куда то взять -  купить или получить за некую услугу. Не думаю, что даже самое либеральное государство будет позволять официально обналичивать активы анонимного происхождения, не проявляя интереса к источнику их происхождения.\n\nФормальный интерес обычно прежде всего к тому, чтобы были уплачены налоги. Но реально есть большие сомнения, что кто-то будет интересоваться колбасой. Можно заплатить налоги и спать спокойно, можно не рассказывать г-ву об обналичивании и спать примерно так же спокойно.\n\nНу, если суммы большие, тогда да, можно начинать нервничать\n\n> активы анонимного происхождения\n\nНаличку кто-то по карманам шарит? Проявляет интерес к происхождению?",
				"added": 1564756967
			},
			{
				"comment_id": 96,
				"body": "> [if0](#comment_155_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): По закону такое предприятие называется: \"организация схемы отмыва нелегальных доходов\". В ваш \"магизинчек\" аноны несут крипту неизвестного происхождения, а на выходе она вдруг приобретает законное происхождение... Хотел бы я себе такой волшебный \"магазинчик\"!\n\nЛюбой кэшевый магазинчик так работает, в общем-то\n\n> Или вы лично будете ручаться, за каждую транзакцию перед налоговой инспекцией, что анонимные (!!!) \"покупатели\" в вашем магазинчике все до одного законопослушные граждане, тратящие честно зарабатанную крипту, а не торговцы веществами или писатели вирусов-шифровщиков?\n\nНе знаю, что там с \"магазинчиками\" (в котором всем этим шифровщикам ещё хоть какой-то профит может быть закупаться), но что-то не доводилось слышать, чтобы всяким организациям (да и индивидулам) приходилось отвечать за то, что им донат с неправильного адреса кидали. Была бы такая практика — недоброжелатели подкинуть \"чёрных битков\", а потом настучать уже бы давно нашлись",
				"added": 1564774656
			},
			{
				"comment_id": 97,
				"body": "> [if0](#comment_156_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В кешевом магазинчике каждая купюра имеет номер и при необходимости может быть прослежена.\n\nКак прослежена? Вот приходишь с нарко-кэшем в магаз, покупаешь колбасу, уходишь. Теперь у продавца нарко-кэш, но уже отмытый. И чем тут номера помогут - не ясно. Если про них было известно, что это преступные деньги и начнут искать, кто их принёс - тоже вряд ли найдут. Разве что продавец - маньяк, запоминающий номера\n  \nА если не считать специально анонимной крипты, обычный биток как раз в большинстве случаев можно легко проследить\n\n> Принцип \"неуловмого Джо\" в сочетании с минимальным уровнем криптовалютной грамотности: для каждой цели - свой кошелек. Никто в здравом уме не будет донатить или что-либо покупать с кошелька, который используется для продажи наркоты или указывается шифровальщиком, если только не захочет облегчить задачу своего задержания.\n\nЕсли с целью потратить деньги - не будет, если с целью создать проблемы - как раз хороший способ же был бы",
				"added": 1564777161
			},
			{
				"comment_id": 98,
				"body": "Кстати, никто не мешает донат брать не криптой, если так больше нравится",
				"added": 1564777727
			},
			{
				"comment_id": 99,
				"body": "> [if0](#comment_157_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В магазине ведется видезапись всех покупателей, что может очень сильно сузить круг, даже при одной оплате. Чем больше купюр будет потрачено в разные дни в разных магазинах, тем точнее можно будет вычислить того, кто ими платит. \n\nВидеозапись может не вестись; можно купить одну дорогую вещь в одном магазине, а потом продать её - вот деньги и отмыты.\n\n> Проблема не проследить, а сопоставить человека с кошельком, доказав владение им.\n> \n> Только проблем будет куда больше у платильщика, чем у получателя, который не может запретить переводы на свой кошелек. Точно также на вашу банковскую карту некто может перевести украденные им деньги, с целью напакостить вам, для этого никакие крипты не нужны.\n\nТак значит никаких проблем принимать крипту нет?\n\n> [if0](#comment_158_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Как взять донат налом? Ведь обсуждение шло о сохранении некого приемлемого уровня анонимности при монетизации контента в p2p сетях.\n\nВ закладках, лол. Но я-то как раз про то, что p2p и анонимность — вещи ортогональные",
				"added": 1564784580
			},
			{
				"comment_id": 100,
				"body": "> [if0](#comment_160_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Если \"регуляторно-уголовные законы\" принимаемые властями не считать проблемой, то - нет :-)\n\nТак всё-таки привлекают кого-то за получение крипту или нет?\n\n> Наоборот, p2p - синоним распределенной децентрализации, способствующей анонимности, в отличие от централизации, которая всегда ее понижает.\n\nНичто не мешает сделать p2p сеть, в которой авторизация возможно только после встречи с существующими участниками. Ничто не мешает сделать централизованную сеть с заходом через тор (или прям в торе/i2p и сделать) и раздачей акков бесплатно без смс\n\nИ опять же, если речь про переход обычных пользователей, многие даже возможной анонимностью пользоваться не будут. Если исходить из того, что всем пользователям p2p нужна анонимность, то оно маргинально уже исходя из этого, а не из монетизации",
				"added": 1564821810
			},
			{
				"comment_id": 101,
				"body": "> [if0](#comment_162_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Зависит от действующих законов страны на территории которой совершалась сделка. \n\nЧ.Т.Д. Люди спокойно пользуются по всему миру (за исключением \"особых\" юрисдикций)\n\n> Как вы это технически представляете? :-) Надо будет встретиться и получить одобрение от всех без исключения участников сети. Ни о какой массовости речь идти не может.\n\nВо-первых, речь о массовости тут не шла. Во-вторых, вовсе не обязательно получать одобрение от каждого. В зависимости от целей сети, возможно сделать WoT, выбирать нескольких проверяющих случайным образом, или после личной встречи с одним-двумя участниками публиковать видео встречи в качестве пруфа для остальных\n\n> Как без смс (или паспорта) помешать нехорошим людям зарегистрировать множество аккаунтов с целью накруток просмотров своего контента с целью введения в заблуждение спонсоров или желающих заказать рекламу?\n\n> желающих заказать рекламу?\n\nЗакапывайте сразу.\n\n> спонсоров\n\nСвоих мозгов не хватает, обязательно циферки смотреть? В чём цель спонсора? Тоже рекламу получить? Если при этом спонсор руководствуется популярностью, а не своими предпочтениями - закапывайте там же\n\nХотя при большом желании можно организовать антиспам фильтры, WoT и т.д.\n\n> В результате пользователи желающие анонимности и безразличные к ней не будут использовать одну сеть\n\nС чего бы? В *любой* сети есть люди, стремящиеся к макс. анонимности (все эти \"купил симку на бомжа, зарегал акк вконтаче через тор/впн\", например) и не стремящиеся",
				"added": 1564843940
			},
			{
				"comment_id": 104,
				"body": "> [if0](#comment_167_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): И какой мировой процент оборота в крипте по сравнению с банковскими платежными системами? Как только со стороны крипты будет появляться хоть минимально заметная конкуренция, которая будет сказываться на доходах банков - лобби прикроет ее сразу, под любым предлогом, или \"возглавит\", согласно обкатанному принципу ЕЕЕ.\n\nНу пусть прикрывают, тогда и поговорим. Везде не прикроют\n\n> Которые будут являтся \"авторизационными центрами\", обладающими возможностями бана и отказа в регистрации, получающие контроль над рядовыми пользователями, в результате поучится таже самая централизация с цензурой и репрессиями.\n\nКто? Случайно выбранные пользователи? Ну кинет тебя кто-то, зарегаешься через другого, запишешь минус в карму. Кому это надо, отказывать в регистрации?\n\n> Уже закопали. ZN тому наглядный пример - пару десятков активных пользователей по всему миру(!!!) и сотня изредко заглядывающих. Это - ноль, zero в названии сети, которое с горькой иронией сложно интерпретировать, как-то по другому, кроме: \"сеть с нулем пользователей\".\n\nМожно назвать сколько угодно факторов и объяснить ими малое количество пользователей. Без исследований - никаких гарантий, что пользователей мало из-за отсутствия монетизации вообще и рекламы в частности, нет.\n\n> Реклама - плохо, но откуда привлекать финансирование на создание контента? Качественная вешь или услга не может быть бесплатной или создаваться \"по остаточному принципу\", \"между делом\". А донат или краудфандинг может сработать только в условиях большого количества пользоватлей, требует буквально - \"толпы\", которую надо еще от куда-то взять. \n\nРеклама - не только плохо само по себе, но ещё и технически практически нереализуемо в нормальной сети. Классическая реклама режется элементарно даже в клирнете, в p2p большинство раздавать её не захочет. Остаются всякие product placement, заказные статейки и т.д. Но даже если это нельзя резать автоматом, то в правильной сети создать возможность блочить такой \"контент\" на уровне пользовательских списков не составит труда (в нынешнем 0нет такой возможности нет, только блочить весь сайт целиком, да)\n\n> Качественная вешь или услга не может быть бесплатной\n\nНу эту мантру мы уже слушали. Если имеется ввиду, что на неё были затрачены ресурсы, которые можно было бы конвертировать в деньги - да, это очевидно. Если имеется ввиду, что всё, что даётся человеку бесплатно - некачественное - это феерический бред\n\n> Откуда возьмется инфа о количестве просмотров - популярности и предподчтениях интересующейся вашим контентом аудитории в условиях анонимности?\n\nА оно надо? Если надо - просить людей ставить оценку, писать комменты и т.п.\n\n> Это же сколько лишних телодвижений надо сделать... К тому же не факт, что бомжевая симка будет долго работать и аккаунт зареганый на нее не заблокируют.\n> Да и какой толк от анонимности, если в модерируемой сети не сможешь открыто высказать свое мнение или любым дргугим способом пойти против установленных правил под страхом бана? В любом случае придется  \"мычать по правилам\", как и прочие представители не анонимного стада.\n\nНекоторые такие товарищи может только в личке общаются. Или им может не запреты важны, а просто стыдно какие-то вещи от своего лица писать (да вон на бордах сколько этих анонимусов, айпишники которых все записаны). Суть-то не в этом, а в том, что такие люди вполне себе есть. Они бы может с радостью пересели на по-настоящему анонимную сеть, но \"тамнетлюдей\"",
				"added": 1564868813
			},
			{
				"comment_id": 106,
				"body": "> [if0](#comment_183_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Есть мем со списком \"тогда и поговорим\" про свободу в Интернете. Это как раз из той области. Обычно всем предлагающим мне: \"тогда поговорить\", я отвечаю: \"когда они пришли\", потому что говорить в \"момент свершения\" о чем-либо уже будет слишком поздно.\n\n\"Когда они пришли\" имеет смысл говорить, когда идёт речь о том, надо ли действовать в защиту того, что лично не нужно; в данном случае ни о каких действиях речь не шла. Мы вроде как просто обсуждали, посодют за крипту или нет\n\n> говорить в \"момент свершения\" о чем-либо уже будет слишком поздно.\n\nПочему же? Можно будет поговорить о том, где на десяточку посадят, а где только штраф выпишут ;) А если серьёзно, то ещё раз - я не верю в то, что вся крипта будет везде зарегулирована до той степени, что нельзя будет использовать анонимные платежи. Поэтому если где-то зарегулируют, можно будет поговорить о том, куда валить из таких мест\n\n> Если я, например, захочу зарегать сто аккаунтов, для друзей, которые меня попросили ;-) \n\nНу и? Какие-то странные предъявы. Вся эта сеть чисто гипотетическая, придумывать за них конкретные правила не вижу большого смысла\n\n> Какие здесь могут быть исследования? Люди не идут, потому что для них нет ничего способноего заинтересовать и привлечь. Да и откуда оно здесь возмется? В ZeroMe 15K аккаунтов и где все эти люди? Заходят, смотрят... и уходят. Вон Фейсбучек имеет хренлярд сколько пользователей без всяких исследований, просто \"по факту\", в отличии от ZN, для которого они необходимы.\n\nВнезапно, в любой сети первоначально нет людей. Когда коммерческие компании создают сети с нуля, они проводят маркетинговые кампании по привлечению пользователей. После этого пользователей может привлекать присутствие других пользователей, но для этого нужна база\n\n> Да. Получается - выхода нет? Забудь о монетизации всяк в p2p входящий? Магиналы не хотят рекламы, но без финансовых вливаний от рекламы не будет развития их любимой сети. Все хотят влезть на елку и при этом не поцарапать свою задницу...\n\nЗачем нужна сеть, в которой возможна реклама?\n\n> На создание любого контента тратится сила и время. Если бы удавалось на нем заработать, то можно было бы перераспределить силы и время в пользу создания контента, а не перебиваться урывками в свободное от основной, кормящей работы, время.\n> Бесплатного ничего не бывает, все имет ту или иную цену, даже если ее не выразить в денежном эквиваленте. Или цена неким образом проявляется в дальнейшем, через некоторое время.\n\nНа что угодно можно навесить ценник. Более того, про любой продукт человеческой деятельности можно высчитать условное кол-во ресурсов. Это банальность, повторять которую большого смысла нет\n\n> Логично предположить, что если на что-то было затрачено совсем мало ресурсов, то оно будет не так хорошо, чем другое, на которое не пожалели сил.\n\nАга. Вот только из этого не следует, что на бесплатное всегда затрачивается мало ресурсов. Как бы логично не было предположить, что в среднем оно так\n\n> Как в интернет-магазинах, пишут и оценивают нанятые писатели-оценщики, благо в анонимной сети аккаунтов можно нарегать кучу и сидеть писать.\n\nНа кого они работать-то будут?\n\n> Для общения в личке социалка, тем более по бомжовой симке, не нужна.\n\nСоциалка нужна интернет-хомячкам. Обычным людям интересны люди. Если среднего человека проще всего найти и достать вконтаче, средний человек с большой вероятностью там зарегистрируется, чтобы можно было общаться с себе подобными\n\n> Именно. Лучше - хомяки, с односложными комментами, чем одно сообщение на форуме за неделю.\n\nКому лучше-то?\n\n> одно сообщение на форуме за неделю.\n\nОчень иронично звучит в треде, где развели ежедневный оффтоп по всем фронтам",
				"added": 1564879764
			},
			{
				"comment_id": 107,
				"body": "И да, для рекламы нужны примерно такие же толпы",
				"added": 1564902069
			},
			{
				"comment_id": 108,
				"body": "> [if0](#comment_184_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Только без источника финансирования эта толпа гарантированно никогда не появится.\n\nНу всё, пора возвращаться в уютный фейсбук?",
				"added": 1564903838
			},
			{
				"comment_id": 109,
				"body": "> [if0](#comment_186_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Как раз так и поступают 99,9% из 15К зарегистрированных пользователей ZeroMe.\n\nДа причём тут они? Я про ваши предложения. Просто возникает вопрос, зачем же сидеть в сети, в которой полтора анонимуса и которая никогда не взлетит, и доказывать, что это так и есть?\n\n> На заказавшего накрутку.\n\nГде логика раскручивать часть котента одного человека против другой части его же контента?\n\n> Как это не парадоксально и дико прозвучит: ради существования и развития самой сети.\n\nЭто звучит скорее не по адресу, чем дико. Вопрос про то, зачем такая сеть вообще нужна. Смысл существования сети нельзя объяснить через существование её же\n\n> Проиворечивые параграфы: бесплатно предоставляется, не дорого стоит и требует много ресурсов для своего создания, что бы не быть плохим. Откуда берутся ресурсы на создание?\n\nОткуда угодно. Самый банальный пример - тонны классики. Про \"недорого стоит\" вроде там не было\n\n> Сети. Повышается вероятность найти требуемого человека в такой сети.\n\nСмотря какой человек требуется. И вообще, сети не может быть плохо или хорошо",
				"added": 1564905607
			},
			{
				"comment_id": 110,
				"body": "> [if0](#comment_187_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Изначально тема возникла при обсуждении востребованности сети в свете возможности появления альтернативных клиентов для устранеия проблемы, указанной в топике. Данный показатель отражает реальный уровень востребованности и интереса к сети.\n\nДумаю стоит всё же придерживаться текущей дискуссии, а не возвращаться каждый раз к истокам\n\n>  Не открою истину, сказав, что решение - в какой сети и зачем сидеть, каждый пользователь для себя принимает самостоятельно. Доказывать ничего не надо, можно просто обратиться к статистике использования, и динамики ее изменения. Просто существуют люди которые питают иллюзии на счет возможной будущей популярности p2p решений, что предоставляет повод для дискутирования, в том числе офтопикового.\n\nМне просто не очень понятно желание сидеть в бесперспективной сети и говорить, как она бесперспективна, поэтому и интересуюсь..\n\n> Здесь какое-то недопонимание. Почему только одной части, а не всего, и против какой части?\n\nДа тут кажется половина дискуссии - недопонимание.\n\nЕсли что, оригинальная ветка пошла отсюда:\n\n> Откуда возьмется инфа о количестве просмотров - популярности и предподчтениях интересующейся вашим контентом аудитории в условиях анонимности?\n\n> А оно надо? Если надо - просить людей ставить оценку, писать комменты и т.п.\n\nТ.е. речь шла вроде как о предпочтениях аудитории в рамках своего контента\n\n> Для чего делается сеть? Что бы ей кто-то пользовался - в этом заключается смысл существования (если только ее создатель явно не преследовал другие цели, например, исследовательские или учебные). Успешность сети общего назначения определяется количеством ее пользователей, исходя из этого, смысл существования зависит от пользователей. Если их нет - то смысл существования такой сети с точки зрения ее непосредственного функционала - минимален или стремится к нулю.\n\nСмысл можно искать с точки зрения любого человека или группы людей, а не только с т.з. создателя. С моей точки зрения смысла в сети, в которой возможна навязанная реклама - нет. Если кто-то хочет создать добровольную рекламу, то с таким можно сосуществовать в одной сети, да. Хотя тогда неплохо устроить инфокампанию против рекламы",
				"added": 1564930931
			},
			{
				"comment_id": 111,
				"body": "> [anonymouslogin](#comment_30_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Что скажете IPZN ?\n\nТам ещё больше js, чем здесь\n  \nУ меня есть своё видение, потихоньку пишу куски на 0me, как наберётся - запощу на толк. Ну и если кому надо - могу перевести",
				"added": 1564931382
			},
			{
				"comment_id": 113,
				"body": "> [if0](#comment_189_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Он практически всегда сведется к однуму: своему основному предназначению. Точно так же можно искать смысл, к примеру, в существовании молотка, только его поиск с любой точки зрения, как отдельного человека, так и групп людей, сведется к удовлетворению необходимости иметь инструмент, позволяющий забивать гвозди. Если определенная модель молотока (как инструмент) плохо справляется со своим предназначением, то смысла в его существовании - нет. \n\nКакой смысл в ТВ? Очевидно в том, чтобы доносить до людей аудиовизуальную информацию. Какой смысл в ТВ для человека с интернетом и желанием самостоятельно выбирать источники информации? Никакого. Вот и с сетью тоже самое. Я смысла в такой сети не вижу, кто-то другой может и видит, но меня-то это не убедит\n\n> Надо где-то сидеть, когда нет аккаунтов коммерческих сетей и желания их заводить... :-)\n\nА, ну если надо, то конечно ;)",
				"added": 1564935625
			},
			{
				"comment_id": 114,
				"body": "> [if0](#comment_192_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): У меня тоже полно соображений.\n\nПо сетевым вопросам мало что могу сказать, мои идеи больше в сторону API, структуры данных / приложений и т.п. Ну, то что нужен DHT или аналог - понятно, но я не особо в курсе, как это должно технически работать\n\n> Во-вторую - отказаться от оперирования конечными фйлами на траспортном уровне, что не удобно при интенсивном обмене сообщениями, отдав предподчтение блокам из которых при необходимости можно было бы собрать файлы\n\nВообще большая часть контента (по количеству, а не объёму) - не файлы, их можно передавать напрямую как команды обновления db.\n\n> В-четвертую - отдели бы админку (с убогими iframe) от пользовательского контента, повесив ее на отдельный порт.\n\nНу, iframe в моей концепции ни к чему. А админку вполне можно сделать опциональной",
				"added": 1564945087
			},
			{
				"comment_id": 115,
				"body": "> [mistalero](#comment_83_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Обращайтесь, слушаю вас. Почему мне в теме видны последние сообщения только от @if0? Да и вообще сообщения двухдневной давности отобразились только сегодня утром.\n\nСвязность плохая бывает. У меня иногда сообщения не хотели публиковать (именно здесь), видимо пиров мало\n\nЕсли есть возможность, включить тор и открыть порт поможет увеличить соединение ноды (моя пока тор-онли, вдруг кто цп начнёт подбрасывать, лол)",
				"added": 1565157759
			}
		],
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": [
			{
				"comment_id": 93,
				"body": "> [trooper](#comment_21_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe): а чем он лутше хрома?)\n\nТем, что не гугл, хотя бы. Ну, лично мне ещё и просто приятнее пользоваться (на десктопе, ессно, на андроиде об удобстве говорить не приходится), но это личные предпочтения",
				"added": 1564698076
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 116,
				"body": "Кстати, интересно почему до сих пор никто не ответил ТСу? Ведь решение очевидно: запретить диктанты в школах",
				"added": 1565186256
			},
			{
				"comment_id": 122,
				"body": "> [fant](#comment_27_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Ребята и девчата, в Москве уже скоро: https://vote2019.appspot.com/\n\nОчень \"умная стратегия\", ага. Посмотрите как голосуют не-ЕРовцы из \"парламентской оппозиции\", посмотрите как ведут себя губеры из оной. Смысл тут скорее всего в том, чтобы присвоить себе победу над трупом ЕР. И да, думаю ради этой флеймотемы стоило бы создать отдельный топик, лол",
				"added": 1566491696
			},
			{
				"comment_id": 123,
				"body": "> [fant](#comment_28_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Вы не поняли сути. Читайте, перечитывайте. Впрочем, по желанию...\n\nКакой сути? Что там можно не понять? Вот это:\n\n> Если мы все поступим по-умному и проголосуем за сильнейшего из кандидатов, то он выиграет, а единоросс — проиграет\n\nТут всё понятно. Но это никак не объясняет смысл сего результата.\n\nА отсылать перечитывать — это так просто, да",
				"added": 1566493821
			},
			{
				"comment_id": 124,
				"body": "> [freemurzik](#comment_5_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Ви хотя-бы можете определить диктатура какой идеологии у вас установлена?\n\nДиктатура — это таки (почти) безграничная власть одного человека / кучки людей; идеология тут параллельна, можнт быть, а может и не быть",
				"added": 1566497231
			},
			{
				"comment_id": 125,
				"body": "> [freemurzik](#comment_9_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Нет.Диктатура установлена именно в идеологии кырла-мырла. И описана именно как \"диктатура пролетариата\".\n\nНу, не хотите читать историю и/или словари - как хотите.\n\n> [fant](#comment_29_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): https://www.novayagazeta.ru/articles/2019/08/24/81715-golosovat-za-drugih-svolochey\n\nСсылками кидаться и я могу. Вот только смысл в контексте спора в этом очень сомнительный",
				"added": 1566868408
			},
			{
				"comment_id": 126,
				"body": "> [fant](#comment_36_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): С вами тут никто не спорит, и уж точно не я.Я вам говорю, и продолжаю говорить, что вы не понимаете смысла, и не делаете труда понять. Это ваш выбор и ваше право, разумеется. Это просто констатация, и лично мне ваша позиция до лампы, мягко говоря.\n> Ну и \"в контекст\":https://www.facebook.com/leonid.m.volkov/posts/2466736500015635\n\nНу конечно, никто не спорит ;) Это всё просто набор битов. Впрочем, как и все эти ссылки, понимать смысл которых мой скромный разум безусловно не в состоянии",
				"added": 1567084036
			}
		],
		"3_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": [
			{
				"comment_id": 117,
				"body": "Это не через тор, а тор-браузер. В отличии от современного фф, туда ещё не завезли эти леденящие душу цветные (!) эмоджi. А как трафик 0нет гонять - через тор или нет - к шрифтам никакого отношения не имеет",
				"added": 1565535334
			}
		],
		"5_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 118,
				"body": "Ну-с, день флага, день независимости или день горы — кому что по нраву — немного поздновато, но кто успел — тот успел! А кто опоздал — празднуйте день слонов что ли..\n\n// бот с википедии",
				"added": 1565560953
			}
		],
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 119,
				"body": "Есть не очень активные. Прям совсем активных кажется нет",
				"added": 1565647839
			}
		],
		"2_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": [
			{
				"comment_id": 120,
				"body": "К сожалению, 0нет не поддерживает символические ссылки (во всяком случае без дополнительных танцев с бубном).\n\nКстати, лучше оформлять всякий код с помощью трёх `\n\n```\nвот так (` ` ` т е к с т ` ` `)\n```",
				"added": 1566063506
			},
			{
				"comment_id": 121,
				"body": "> [leinariys](#comment_51_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Спасибо за ответ. Подскажите, пожалуйста, как тогда устроить контент?Сайты на одних дисках, а материал для раздачи на другом... какие есть предложения?\n\nТоже была идея с bind (см ответ if0). От себя добавлю, что файлы на одном диске можно хардликать (если нужна другая структура директорий), а если дисков с видео и вовсе несколько, то можно сделать несколько mount-bind (правда, тогда на сайте так и будет к примеру `video-1/` `video-2/`)",
				"added": 1566203788
			}
		],
		"7_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 127,
				"body": "Да. При условии, что ссылки относительные, оно даже будет работать",
				"added": 1567151333
			},
			{
				"comment_id": 128,
				"body": "> [7heaven](#comment_25_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6): А \"относительные\" это как?\n\nБез домена и слеша (/) в начале URL. Например из `index.html` -> `contacts/index.html`, из `contacts/index.html` -> `../index.html`",
				"added": 1567327178
			}
		],
		"1_1DM1Nn2JXHmDfr7zHtszmjJwQeX4j4QoYv": [
			{
				"comment_id": 129,
				"body": "millchan (imageboard движок), zerovoat (вряд ли более продвинутый, но другой), форки 0talk (среди них точно есть более продвинутые; до некоторой степени)",
				"added": 1567780489
			},
			{
				"comment_id": 130,
				"body": "> [jk7](#comment_3_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM): куда уж более продвинутый? клирнет тогда.\n\nДа хотя бы уже возможность сортировать нормально!11",
				"added": 1567942961
			}
		],
		"1_1G3JYd1VwSCPGfmqv8EDU7mgcrrZi6okvf": [
			{
				"comment_id": 131,
				"body": "> во-вторых, почти все проблемы растут из одного места... ну, вы поняли.\n\nК сожалению именно это многие и не понимают. Бороться чисто с локальными проблемами тоже хорошо, но зачастую не очень продуктивно. С другой стороны, была бы какая-то солидарность по всей стране — было бы гораздо больше проку от локальных акций, но походу большинство всё ещё слишком хорошо живёт и предпочитает не лезть..",
				"added": 1571831424
			}
		],
		"3_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 132,
				"body": "> [vcxt](#comment_22_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): http://127.0.0.1:43110/1LTGeNnnYq98h8zUcZaS4zZL63ZXZS8YcA/ \n> не работает\n\nНу, какие-то пиры уже есть, материал публикуется, но для надёжной работы надо побольше, да.",
				"added": 1572577403
			},
			{
				"comment_id": 133,
				"body": "> [vcxt](#comment_22_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1): \n> не работает\n\nВсё ещё не работает?",
				"added": 1572693112
			}
		],
		"8_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 134,
				"body": "> в благости не могу\n\n???",
				"added": 1572730941
			}
		],
		"1_1MaGMmoEyoNPc3hVfU8c8PWbzeyDnmrpj1": [
			{
				"comment_id": 135,
				"body": "https://github.com/HelloZeroNet/ZeroNet/issues/1440#issuecomment-395031649\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1528116214_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8/ZeroNet+Tor+permission+error",
				"added": 1572866558
			},
			{
				"comment_id": 136,
				"body": "> [igarlic](#comment_1_1MaGMmoEyoNPc3hVfU8c8PWbzeyDnmrpj1): Теперь \"Статус: Error ([Errno 2] No such file or directory: '/var/lib/tor/control_auth_cookie')\"Этот файл там есть. При перезапуске сервиса Tor установленные права на нем сбрасываются.\n\nМм, а какой дистрибутив?",
				"added": 1572981325
			},
			{
				"comment_id": 138,
				"body": "Так кроме https://tor.stackexchange.com/questions/4667/why-isnt-control-auth-cookie-being-created и оборванной дискуссии в реддите ничего особо не находится",
				"added": 1572981914
			}
		],
		"4_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 137,
				"body": "> [swashbuckler](#comment_18_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Ничего не понятно. Что шифрует? Как шифрует?\n\nВообще говоря, \"идея\" была про то, чтобы использовать мозг в процессе шифрования (и, соответственно, дешифровки) обычной бинарной информации, а не памяти. Вместо использования пароля, который можно забыть и крипто-алгоритмов, в которых можно найти уязвимость (не говоря уже о железных уязвимостях), мозг используется \"напрямую\". Таким образом, если пациента не распиливать, то получить информацию можно только с его согласия (что до паяльника, то тут можно попробовать придумать способ отключения дешифрующей способности мозга в подобных ситуациях; хотя, ясеня пень, полной гарантии всё равно не добиться)\n\nПрактически всё это упирается в способ заставить мозг работать с бинарными данными, да ещё и уникальным обратимым и повторяемым способом, так что *на самом деле* в реализацию слабо верится. Разве что в НФ",
				"added": 1572981729
			}
		],
		"1_1PQxP4JTuif1gVbzRC1EjnGUV4k7Ztpsor": [
			{
				"comment_id": 139,
				"body": "Судя по моему `about:config`, сохранившемуся с прежних версий, можно добавить строку `network.proxy.no_proxies_on` со значением `127.0.0.1:43110`",
				"added": 1573509292
			}
		],
		"1_1KiQRME6xANBwEpAnX3JYjxt4yrnV91gSU": [
			{
				"comment_id": 140,
				"body": "Нет здесь никакого блокчейна.\n\n> То есть любой может понять что ОП ты.\n\nДа\n\n> Хотя можно генерить постоянно новые ключи.\n\nДа",
				"added": 1573555542
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 141,
				"body": "Ничего. Стоит делать то, что нравится, пытаться здесь угодить публике — маркетинговый анекдот. Разве что притащить сюда свою компанию, но тогда у них и спрашивать, что им востребовано",
				"added": 1574377805
			}
		],
		"1_1KiZLn2abH473fG7uan8mFgBkAndAahppK": [
			{
				"comment_id": 142,
				"body": "> [lukashenko](#comment_6_18dzTVu5gRYSr91j9bVbNAxBm7SV5xbR7m): Нет, это просто количество нод, с которыми есть соединение. А траффик проходит обычно через 3 ноды\n\nНет, это [количество локальных тор адресов, которые используются для связи с миром](https://github.com/HelloZeroNet/ZeroNet/blob/2de35266c4200929a37d0b8796ba30f281a18e5e/src/Tor/TorManager.py#L211)",
				"added": 1574968893
			},
			{
				"comment_id": 143,
				"body": "> [freeme](#comment_3_1KiZLn2abH473fG7uan8mFgBkAndAahppK): Ку, ты вроде шаришь в код и давно сидишь на зеронет, можешь пояснить что значит \"локальных тор адресов\"?\n\nУ \"серверов\" в торе есть [.onion адреса](https://en.wikipedia.org/wiki/.onion) вместо ip-адресов (которые, понятное дело, прячутся). Активных адресов может быть очень много, судя по всему типичная нода 0нет использует 10",
				"added": 1575018967
			}
		],
		"2_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": [
			{
				"comment_id": 144,
				"body": "> ЗЫ напомните как тут делать спойлер и аттачить картинки\n\nникак",
				"added": 1582193640
			}
		],
		"11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 145,
				"body": "> [geekless](#comment_262_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): @gitcenter:@caryoscelus:@anotherneko:@gomzik:\n> Еще живые из старой гвардии есть? Кого позвать?\n> Господа, предлагаю перехать на новую версию этого форума и активно его продвигать как замену данному. Ссылка в посте выше.\n> Если вы согласны, предлагаю разместить ссылки на новый форум у себя в блогах/в профиге ZeroMe и т.п., у кого что есть.\n> Также, кому дать права админа на новом форуме? @gitcenter? @caryoscelus?\n\nЯ в принципе здесь. Активно не участвую и вряд ли буду. Если есть желание подстраховаться, могу взять админ-права на случай, если никого больше не останется",
				"added": 1584360333
			},
			{
				"comment_id": 146,
				"body": "тем временем продолжается \"Initial sync in progress..\"",
				"added": 1584362352
			}
		]
	},
	"comment_vote": {
		"15_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"5_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": 1,
		"46_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"19_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"22_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"6_15EL3nJs2b9AXWTtniTkV9Jq77n67nMVCH": 1,
		"13_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": 1,
		"69_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"17_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"25_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z": 1,
		"89_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"90_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"91_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"10_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp": 1,
		"175_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"11_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"204_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"207_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"3_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"121_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"240_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"244_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"250_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"164_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"173_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"29_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"3_14WQ9yBL9dh7Yv15otLGmr41QRGDp1L4Sg": 1,
		"239_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"10_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": 1,
		"18_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"23_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"21_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1
	}
}