{
	"title": "Anti-PV",
	"description": "MacFly vous donne des astuces!",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1543754402,
	"post": [
		{
			"post_id": 6,
			"title": "Voiture radar mobile-mobile",
			"date_published": 1543754200.13,
			"body": "Selon le code de la route et les vérifications du contrôle technique pour tous les véhicules, la plaque d'immatriculation doit être fixée par des rivets. Hors, ici, on s'aperçoit qu'elle n'est pas rivetée mais simplement vissée. Cela constitue une faille juridique dans la contestation d'une amende.\n\n![serveimage__1_.jpeg (1200x696)](data/img/post_6_serveimage__1_.jpeg)"
		},
		{
			"post_id": 5,
			"title": "Le danger, il est là!",
			"date_published": 1506540399.582,
			"body": "L'arrêt sur la BAU est interdit, mais quand ce sont les policiers, c'est légal.. Des fois, il y'a jusqu'à 3 véhicules garés à cet endroit. Je précise que le poulet qui a les jumelles est dans le bois, sous un arbre. La vitesse est limitée à 90kmph et ce n'est pas une zone dangereuse, comme souvent.\n\n![21640814_1703047423098839_3320217676874439294_o.jpg (1080x1920)](data/img/post_5_21640814_1703047423098839_3320217676874439294_o.jpg)"
		},
		{
			"post_id": 4,
			"title": "Stationnement après un contrôle",
			"date_published": 1496365677.993,
			"body": "Vous êtes arrêté par un agent... Toujours prendre des photos!!\n\n=> Sur un rond-point ou dans un rond-point: Contestez le PV pour entrave à la circulation et mise en danger de la vie d'autrui par la faute d'un agent assermenté. Il faut reconnaître que c'est vraiment absurde de faire stationner un véhicule dans un rond point et de faire sortir les occupants du véhicule!!\n\n=> Sur un parking privé: On vous demande de vous garer sur un parking mais voilà, c'est le parking du supermarché.. C'est donc un parking privé et les agents n'ont pas le droit de vous arrêter sur une zone sur laquelle ils ne sont pas habilités... Demandez si possible une attestation au propriétaire du commerce ;)"
		},
		{
			"post_id": 3,
			"title": "Arrêté par les gendarmes",
			"date_published": 1496365175.103,
			"body": "Lors d'un contrôle routier, je filme toujours après m'être arrêté et coupé le moteur ( sinon, les agents peuvent vous emmerder... et oui ils sont assermentés..). Bien souvent, les gendarmes viennent à la fenêtre sans leur gants blancs et ,des fois, sans leur calot (comme la milice). Avec une vidéo ou des photos, c'est bien sûr contestable, ils ne sont pas en uniforme."
		},
		{
			"post_id": 2,
			"title": "PV pour alcoolémie",
			"date_published": 1496364625.514,
			"body": "Normalement, l'agent assermenté devrait vous faire souffler plusiseurs fois dans l'éthylomètre au cours du contrôle. C'est souvent le cas mais voilà... Sur la contravention, le nombre de test n'est jamais marqué et ceci est contestable. C'est comme si le test était faux la première fois et que l'agent n'avait pas fait de contre-expertise, donc ne prouve rien..."
		},
		{
			"post_id": 1,
			"title": "Félicitations à vous!",
			"date_published": 1433033779.604,
			"body": "Voici un blog pour vous indiquer les éventuelles failles juridiques concernant les PV souvent mis au hasard."
		}
	]
}