{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 1,
				"body": "wikipedia",
				"added": 1577695696
			}
		],
		"1583188389_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 2,
				"body": "When hyperinflation?? I'd like to see my stundent loan disappear",
				"added": 1583267520
			}
		],
		"1583559326_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 3,
				"body": "It's the matrix",
				"added": 1583700982
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 4,
				"body": "1) Buy stolen credit cards, paypals etc and stolen/fake ids in dark web\n2) Create crypto exchange account with fake ids and buy privacy crypto\n\nPossible problems might be that a) the name on credit card must match the name on id document and that b) you might need two id documents with same name to verify crypto exchange account.",
				"added": 1583701784
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 5,
				"body": "- I have so called more important stuff like all the bull shit thoughts i think i can some day solve in my own mind and thinking about life and universe and moving in forest and whatever\n- I must be satisfied to what I am to find truly balanced and good life, other people can only disturb what i'm trying to explore within myself\n- I have not enough interest in other people\n- Ok I have some interest in women, but I dont really have anything to say to them and women never do any concrete steps to start conversation or anything\n- My social skills in small talk are just shit so why bother. Just come to talk to me about this homework stuff.\n- Ok maybe some good relationship could improve my general feelings about life and actually do good\n- But still cant do that right now because i need to do x before\n- It's never good time to do anything because mystical x that has to be done first <<<<< ok this is the reason i've been stuck for a while in life. I dont really use much effort to initiate any meaningful change because i have this mental issue that something else must be taken care first, like forever, always some new bull shit stuff O_O",
				"added": 1584000021
			},
			{
				"comment_id": 6,
				"body": "I'm basically trying to control every aspect of something that is fundamentally chaotic (life) and have problems accepting some feelings or thoughts that exist, trying to overcome those feeling and thoughts with some rituals. This is the stuff that prevents me really living o.o. Inner voice: \"you cannot do this or scary stuff will happen\".",
				"added": 1584000556
			}
		],
		"1583931502_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN": [
			{
				"comment_id": 7,
				"body": "Altcoin market? You mean coin or exchange?",
				"added": 1584009941
			}
		]
	},
	"comment_vote": {}
}