{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Chaîne payante sur Molotov",
			"body": "Bonjour,\nconnaissez-vous un moyen pour avoir les chaînes payantes de Molotov gratuitement ? Merci pour vos suggestions.",
			"added": 1525022588
		},
		{
			"topic_id": 2,
			"title": "Les nombreux bénéfices du Cannabidiol, un autre cannabinoïde.",
			"body": "Je vous présente les bienfaits du Cbd (Cannabidiol) ,un cannabinoïde présent dans le cannabis et oui; il n'y a pas que le THC dans la vie ;). Si vous ne connaissez pas voici un lien: https://www.alchimiaweb.com/blogfr/proprietes-medicales-cbd/\nN' hésitez pas à faire d'autres recherches sur ses nombreuses applications médicinales.\nPS: Pour les intolérants au thc, le CBD ne possède aucun effet psychotrope\nEnjoy!",
			"added": 1525639423
		}
	],
	"topic_vote": {
		"1_197rheUT6rVQd82hwq8eLheJUyxTRu5bqU": 1,
		"2_197rheUT6rVQd82hwq8eLheJUyxTRu5bqU": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_197rheUT6rVQd82hwq8eLheJUyxTRu5bqU": [
			{
				"comment_id": 1,
				"body": "Je suppose que c'est au niveau de leurs serveurs, donc trop compliqué. Sinon connaissez-vous une adresse IPTV stable et fiable ?",
				"added": 1525440234
			},
			{
				"comment_id": 3,
				"body": "Merci, très bon kodi mais les IPTV que j'ai pu trouvé sur le web ne sont pas terribles. Soit ca marche pas ou se n'est pas stable, connais tu de bonnes adresses sucette ?",
				"added": 1527725084
			}
		],
		"2_197rheUT6rVQd82hwq8eLheJUyxTRu5bqU": [
			{
				"comment_id": 2,
				"body": "Voilà une vidéo montrant différentes applications du cannabis. Que ce soit textile, pour la fabrication des batiments en passant par la cosmétique, la production d'essence ou la dépollution des sols....ansi que le pourquoi de la prohibition de cette plante fantastique.\nVers la fin de la vidéo, le cas de Charlotte, petite fille qui a le syndrôme de dravet, une forme d'épilepsie très grave qui a été soigné avec du CBD.\nhttps://www.youtube.com/watch?v=_N4Vf5sJ5dM\nEnjoy!",
				"added": 1525719378
			}
		]
	},
	"comment_vote": {}
}