{
	"next_post_id": 17,
	"next_comment_id": 73,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Mg0",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Likely a human...\n\nZites:\n  [Rex Research (/rexresearch.zn)](/1D6QfsBSZHmYWbuCxKG5ya31BiTczoZiES)\n  [mg0's hub (gallery)](/1EPpJ2gcTgQ6NoNvGfSifTKuzbRhwcKnVU)\n\nContact:\n  [mg0@zeroid.bit](/Mail.ZeroNetwork.bit/?to=mg0)",
	"post": [
		{
			"post_id": 1,
			"date_added": 1554228058,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1554228134,
			"body": "Oh, so it automatically posts a \"Hello ZeroMe!\" ... now I get why all  new users were greeting always the same and even twice sometimes.",
			"date_added": 1554228132
		},
		{
			"post_id": 1554230672,
			"body": "So, @Kaffie, you sure don't know me (like, does someone here do?) but I've been reading a bit about your condition, the donation stuff and the 'what about ending it all?' thing. So I have a couple things in my mind about it and I'm thinking of posting them here no matter if I have any experience or professional degree to talk about the matter because, there are no cops here, supposedly. So:\n\nI have had lot of times when even the burning sunlight on my eyes couldn't deal with the gloomy view of the world and life I've had many times before, and really considered if life was worthwhile and why is it how it is and if god this and that... Gladly, even after agreeing how irrelevant being alive is I've never done anything to 'shutdown my inner operating system' because I'm not fond of pain (generally). The way I live my life shouldn't even hint depression to anyone but every now and then I get deeply disappointed on how things go on, but that doesn't matter much.\n\nSee, I've kind of geared my persona since I was a kid to not be affective nor social; pretty much whole primary school went through and I was always sitting alone to my liking, but I didn't just hate the world and all the people on it (didn't have too many reasons to do that, there were bully and gossiping girls but meh), I just loved loneliness and in all those days of silence I reflected deeply on my understanding of things, the world, others and myself. I've been forced to do things against my will (no shady stuff, but I didn't wanted to anyway) and that drained almost all of my will during a year or so. Man, I procrastinated so hard and unvoluntarily on those days and felt anxiety becoming a daily issue but that is over. After those days I wondered for a while why wasn't I feeling better/happier since the only issue with my life was supposedly solved, well after a while I found out that, after months of being slightly angry with pretty much any non-charming person around, I went to sleep some hours earlier one night and woke up almost loving how kind people can be to others sometimes.\n\nStill have to check out if someone vaporized sugar on my bedroom but what I mean is that, what others say may not be true but they care for you, what they suggest may not help at all but they try to help. If part of the reasons that make you feel so bad are feeling worthless and unimportant, then mind the efforts of people across the net that find you worthy enough to go try and help you deal with this. I don't know how you feel, I'm not you but I know how I've felt and only can suggest things hoping they make you find reasons worth of *stayin' alive* (pun intended).\n\nI love food, all those tastes make me happy; I like programming, small and sometimes silly pieces of code to amuse me or to learn is always interesting; I don't like going to sleep but I like sleeping a lot (mind the difference). I don't like being wet (as in taking a shower, no lewd stuff) but I really appreciate myself when taking a shower or a dump, dem ideas I get at such times are 1337; I like plants, it's like having a baby and going through parenthood over and over, while not being found liable by the fate of your offspring and having difficulty set at 'easy'; I like turtles (yeah, pun intended), haven't seen some in a while but they are kind of cute, like Yoda from Star Wars.\n\nWell, this is a start, I won't keep repeating sugary stuff to keep you from doing whatever you are to do. It wouldn't be any pleasant but it's yours truly life here. Your life, and you decide what to do with it. I don't have power over your life, you don't have to do what I say, and afaik same happens with everyone else here. I personally fear regret more than death (and pain more than both but don't mind this). Hope this aids your mood.\n\nPS: So, all that said.. I, uh ... sent you a zeromail like week ago or so and, well I'm pretty new here so I can't go complaining, right? but could you mail me back? or better, can you add my zite to kaffiene? no hurry tho, I get you are in no shape to attend this things now but was wondering if you ever received the mail. Wait, nvm. I should work on the zite a bit more, I'd request that later. ",
			"date_added": 1554230669
		},
		{
			"post_id": 1565290139,
			"body": "God, this place is surely becoming crowded! at least some folks will like it for testing zeronet's endurance with this many peers.",
			"date_added": 1565290135
		},
		{
			"post_id": 1567468357,
			"body": "Is it only me or [ZeroMe](/Me.ZeroNetwork.bit) isn't really working when entering by the namecoin address? It works properly using the zeronet zite address though.",
			"date_added": 1567468352
		},
		{
			"post_id": 1567553550,
			"body": "Ugh, [ZeroMe](/Me.ZeroNetwork.bit/) is not working again!! @gitcenter",
			"date_added": 1567553544,
			"meta": "{\"img\":\"900,165,dddeeecccfff,00100110012222222013\"}"
		},
		{
			"post_id": 1567807541,
			"body": "[Rex Research](rexresearch.zn) zeronet mirror now makes use of name.YO domain name, thanks @gitcenter ",
			"date_added": 1567807534
		},
		{
			"post_id": 1568577115,
			"body": "@gitcenter: [xkcd.yo](/xkcd.yo/) is behind by 4 or 5 comics now, is there a way to trigger a sync with the clearnet site from our end?",
			"date_added": 1568577107
		},
		{
			"post_id": 1573058612,
			"body": "@gitcenter:  there's a bug in Config.py for `--ip_local` argument, it says it expects an integer but neither `--ip_external` nor `--ui_host` expect them. Also, xkcd site is stalled as well.",
			"date_added": 1573058603
		},
		{
			"post_id": 1575000097,
			"body": "Am I awake on zeronet's primetime or what? My recently made gallery hub has 34 peers and rex research zite has 72! When did this happen? or is it thanks to syncronite trackers?",
			"date_added": 1575000087
		},
		{
			"post_id": 1575815492,
			"body": "@gitcenter: I don't want to be mean but your xkcd is behind many comics already.",
			"date_added": 1575815481
		},
		{
			"post_id": 1578327878,
			"body": "@gitcenter: I was dealing with blocklists just now and an idea came to my mind, I run a minimal node sharing just the necessary and ui is locked to a local address only, I may start using ui password but being a plugin I'm not sure if that's enough so I thought: Is there a locking switch that would treat any not already downloaded zite as blacklisted? \n\nI was trying to find my way with millchan but it's too hard to ensure you don't get nasty stuff by accident, and cleaning it afterwards isn't an easy task either, so I'd like to know if I could lock down a node like that, or if there's a better approach.\n\nPS: update xkcd.yo ffs!",
			"date_added": 1578327866
		},
		{
			"post_id": 1583112086,
			"body": "ZeroMe is becoming more vivid but, mostly is from chinese users. I can't read that. What if they are plotting our demise? I can't tell!",
			"date_added": 1583112073
		},
		{
			"post_id": 1606255603,
			"body": "@Undyingfirewall: I took a picture of it from a snapshot I had of zeronet, lucky you.",
			"date_added": 1606255589,
			"meta": "{\"img\":\"900,337,eeefffedd,0000001111020000000010000011110000011111\"}"
		},
		{
			"post_id": 1608088280,
			"body": "@mxh69420: look for this in the sidebar, try increasing it to 20MB or something and retry signing.",
			"date_added": 1608088265,
			"meta": "{\"img\":\"900,331,222333111553663443000aa4cc5442552332,00010000000020345100062078400002209AB000\"}"
		},
		{
			"post_id": 1617999746,
			"body": "@styromaniac: Just wanted to say thanks for posting the [Fantastic Fungi at KopyKate](/big.kopykate.bit/?Video=1615075435_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd) documental, it helped me understand the place of fungi in the whole nature ecosystem, and seeing some white button alike mushrooms growing at my front yard for probably the first time in my life is really exciting. Of course I won't go fry them outright, identification is quite difficult but so much fun too.\n\nWould like to know more details about the fungi you have used across years, you were praising some for medical benefits, right? which are those?",
			"date_added": 1617999730
		}
	],
	"post_like": {
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1555903246": 1555930485,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1557363308": 1557517510,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1558103307": 1558359994,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578404132": 1578420945,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583035996": 1583080932,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1583736292": 1583783670,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1597665490": 1597890129,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1598391380": 1598495603,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1601352984": 1601818841
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I've never worked with NVMe myself but I don't think it would incur into issues with the command you ran. Try running `fdisk -l <hard disk>` to see if it has a partition table, and if so, run `partprobe <hard disk>` to make the system re-read that partition table. Also, you mentioned encryption, probably it has to do with that.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1555081997",
			"date_added": 1555083618
		},
		{
			"comment_id": 2,
			"body": "@SSDifnskdjfnsdjk: I checked, nvmen1 is the first NVMe kind block device in the system, I too thought that it was the first partition but it's the whole device, and dd is known to make byte-by-byte copies of block devices, it should have worked nicely.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1555081997",
			"date_added": 1555096036
		},
		{
			"comment_id": 3,
			"body": "Even if smaller, the partition table is normally layed out at the the first sectors of the disk or really close, so your partition table should have been copied as well, but, I know that GPT does us a backup partition table at the end of the disk so maybe when you tried the HDD that partition table was checked against the (non existent) backup partition table and things happened.... if you haven't modified the HDD then I suggest using testdisk to see if it can find the partition table.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1555081997",
			"date_added": 1555335817
		},
		{
			"comment_id": 4,
			"body": "@ulrichard: if you could use gparted it may be easier for you since it's a graphical interface for parted. With it you may restore the partition table as well if fdisk is able to find it, and being overcautious is not a bad treat in this cases. I'd recommend using testdisk in favor of fdisk/parted though, since it really takes the trouble to find the partition table. Luck",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1555081997",
			"date_added": 1555597246
		},
		{
			"comment_id": 5,
			"body": "You don't have permission to die, but has clearance to use lethal force to overcome the former issue if neccessary. Also, what are the meds you are on? Can't you find an alternate source of the main ingredients of those meds? I've always wondered why people don't look out what makes a med effective and try to produce a close-enough alternative for it. Medicaments are always expensive, the less there are, the more they are needed and the fewer labs producing it.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556225486",
			"date_added": 1556225970
		},
		{
			"comment_id": 6,
			"body": "Ok, I was going through this [article](https://health.howstuffworks.com/medicine/medication/understanding-hormone-medications-ga.htm) to understand better but still got no clue what kind of hormone treatment you are on. For the diabetes cases diets should do most of the leveraging but for the sexual ones ... I'm clueless. Maybe some types of food well-known to arouse or stimulate in any other way the sexual parts of the body would hold a clue here. Not that I'm a doctor though, just wanted to check for possible solutions.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556225486",
			"date_added": 1556229491
		},
		{
			"comment_id": 7,
			"body": "Is it possible to at least have the name of those meds? I'd like to do a bit of googling on my own.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556225486",
			"date_added": 1556380655
		},
		{
			"comment_id": 8,
			"body": "Death ain't gonna help here, none knows what lies ahead. I've been reading [this](http://www.drdebe.com/articles/safe-alternatives-to-estrogen-replacement) but hasn't yet summarized it yet. It mentions a couple things like cholesterol in diet being important and other things that may help with your case if meds aren't affordable anymore. Please give it a read at least.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556589690",
			"date_added": 1556659437
		},
		{
			"comment_id": 9,
			"body": "Damn, but it could help a bit, right? right!? also, what did people (woman mainly) of ancient times to produce estrogen? have sex?. Go have sex! (please don't [unless necessary] ). I have this dream of going full off-grid one day and that requires a vast knowledge of the human body and a big arsenal of natural weeds so to keep me alive and going when diseases strike; cases like yours make me think I've been blessed with a neat inmuno-system and a balanced body overall, but also tells me there's no such thing as a big-pharma alternative anywhere ...",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556589690",
			"date_added": 1556742482
		},
		{
			"comment_id": 10,
			"body": "I like runit",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1556911825",
			"date_added": 1556920402
		},
		{
			"comment_id": 11,
			"body": "@Anonimouslogin: estradiol (patches, not pills), finasteride, spironolactone, and medroxyprogesterone acetate (though I'm considering switching to micronized progesterone). Kaffie posted that in another thread, dunno if she has changed any of those, neither the dosage.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1556589690",
			"date_added": 1557102244
		},
		{
			"comment_id": 12,
			"body": "Yeah, kind of reminds me of that episode of *My life as a teenage robot* where XJ9 required help from the skyway patrol but the paperwork. Oh the paperwork!",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1557790609",
			"date_added": 1557793549
		},
		{
			"comment_id": 13,
			"body": "You mean, games that emphasize appearance, glamour or vanity like dressing games, some that resemble housewifes everyday life like cooking? I don't play those but if I ever find the need I think I'd just wander thru clearnet flash minigames sites. There are a couple of those for handhelds, I remember many when I used to lurk for nintendo DS roms. Now that I think of it, I remember playing harvest moon a lot, I wouldn't label it as 'girls only' but it should very well fit in such category.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1558088151",
			"date_added": 1558098844
		},
		{
			"comment_id": 14,
			"body": "tl;dr / I don't code: Taiwan will prohibit homosexual marriage.\n\nEDIT: nvm, I got it all reversed. homo is legit now, it seems.",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1558103307",
			"date_added": 1558125516
		},
		{
			"comment_id": 15,
			"body": "@caryoscelus: Sorry, I don't know that syntax enough, does that '-' at the beginning of a line mean it's a comment? if so, the func declaration shouldn't be complete.",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1558103307",
			"date_added": 1558360038
		},
		{
			"comment_id": 16,
			"body": "@caryoscelus: OOHHHHH, so it's actually the whole way around!",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1558103307",
			"date_added": 1558366868
		},
		{
			"comment_id": 17,
			"body": "Can't you just arrange with them to make a direct transaction from your bank account to theirs? or, what about debit cards? (I think that's how they are called), which only have as much as the account backed by it",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1562329760",
			"date_added": 1562348992
		},
		{
			"comment_id": 18,
			"body": "Well then, try looking at other car repair shops then, if they won't even accept bank transfers and won't even tell you the reason then it's not worth it in my eyes. It'd be sad if it's like the best shop at town or some old friends with your parents or something else but credit card only as payment is quite shady imho, not accepting cash would keep their shops burglars and bank transfers would be bothersome but should work as well. Ditching those two and leaving only CC without a proper reason is lame.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1562329760",
			"date_added": 1562530778
		},
		{
			"comment_id": 19,
			"body": "It's good to see you active again",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565315616",
			"date_added": 1565319138
		},
		{
			"comment_id": 20,
			"body": "Just don't try harming others, whenever in doubt think what the other person would do to you after you do what you are thinking to them.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565364110",
			"date_added": 1565370894
		},
		{
			"comment_id": 21,
			"body": "Have to say, your description of your states sounds too much like being high, but in control as well.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565364110",
			"date_added": 1565451925
		},
		{
			"comment_id": 23,
			"body": "Again, not a sure fire thing but since you are seriously considering a $ sudo rm -rf / on you, might as well use your time wandering on alt science/medicine forums looking for compounds that may have some helpful effects on your situation and stuffing yourself with such things. Like, if you lack ascorbic acid (vit. C) you could use some capsules (big pharma solution) for that, or just eat oranges (alt. med solution). Of course, you may end not actually finding anything that could either help you or be readily available for you but what would you lose trying by now 🤷. As for possible countries to move to? south america ones have more criminality than the US afaik, temperatures are higher all year long and medical services might be worse than what you have, on the other side you could rather find fresh crops and since laws are distinct you may even find it easier to get a supply of meds that may help with your condition, or just pain-killers. idk really.\n\nAt last, I kind of make an idea of you not being able to fix your current life because of your sickness and at the same time having to keep a minimum of social skills, a.k.a not looking like a utterly rude person so... if you feel the urge to scream really nasty things to someone or something then do it if it promises to relieve you of some torment.\n\nIf anything else doesn't work, I'd recommend leaving a suicide note stating the way you want your belongings to be distributed, using a quick death method for avoiding much agony, and if possible, setting up your death place in a way that your body ends properly cremated (mind to make it so it won't start a big fire, #savetheplanet).\n\nAnyway, just try to have fun, whatever you end doing.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1565969688
		},
		{
			"comment_id": 24,
			"body": "Just look at that Gyarados!",
			"post_uri": "1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo_1566877420",
			"date_added": 1566924308
		},
		{
			"comment_id": 25,
			"body": "Hmm, just checked and now it works. Before there was an error about 'NoneType' and it mentioned NameYo plugin in it. I tried disabling Name.Yo plugin but it didn't help. Anyway, it's solved, yay!",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1567468357",
			"date_added": 1567512107
		},
		{
			"comment_id": 26,
			"body": "@gitcenter: Just tried to open zerotalk and it's broken, same message. What's wrong!?!?",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1567553550",
			"date_added": 1567606709
		},
		{
			"comment_id": 27,
			"body": "@gitcenter: it worked, thanks. Wasn't aware that plugins must be updated separately.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1567553550",
			"date_added": 1567609542
		},
		{
			"comment_id": 28,
			"body": "@katian, You have name.Yo plugin installed? if not it won't work with the name.yo domain name, try with the [zeronet address](1D6QfsBSZHmYWbuCxKG5ya31BiTczoZiES) of the zite instead. btw, if you don't know the site it's a compilation of patents and stuff about science and medicines that not always get highlighted, you could think of it as a repertoir of non popular or successful science, either by natural capitalistic selection or conspiratory suppression. Also, the zite is 200MB and the optional content sums up to almost 7GB, mind that.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1567807541",
			"date_added": 1567815509
		},
		{
			"comment_id": 29,
			"body": "@SSDifnskdjfnsdjk: Yeah, something like that, mainly limited to once every 6 hours to stop abuse. I think it would work if it's just a URL you have to make a request to and it does the job. I don't know if you can issue shell commands from within zeronet, hopefully not since that could lead to a whole world of vulnerabilities.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1568577115",
			"date_added": 1568634237
		},
		{
			"comment_id": 30,
			"body": "What do you mean by soul here? The extra-physic aspect of living beings or a minimal set of empathetic behaviors towards other fellow humans?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1572607692",
			"date_added": 1572608616
		},
		{
			"comment_id": 31,
			"body": "@Styromaniac: What do you mean by human? Do you mean compassive and socially benevolent or just homo sapiens sapiens genome derivated?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1572607692",
			"date_added": 1572651523
		},
		{
			"comment_id": 32,
			"body": "@Styromaniac: hmm, the versatility of a persona and its actions then. As of now only found in humans. Poor animals, they have been left behind long long ago, they only know of the primitive ways of kill for $reasons and mate for survival, if only they knew they can fall in love between species and follow intricate and overly complex social lives...",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1572607692",
			"date_added": 1572652272
		},
		{
			"comment_id": 33,
			"body": "Also, the newest version stair should have a lot more smaller steps as new versions appear at a bigger rate than old versions get outdated, and the oldest version is ok, it could work with even less steps if you think of them as strictly LTS versions",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1573205804",
			"date_added": 1573266416
		},
		{
			"comment_id": 34,
			"body": "It needs OVER 9000 !! km to break into the million",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1574090169",
			"date_added": 1574111599
		},
		{
			"comment_id": 35,
			"body": "Nice read, still LibreOffice kind of lacks in the overall UX. I do use it and I'm satisfied with it but the average modern age user won't drop MS Office in favor of it, given the support for MS formats and collaboration needs....",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1574697530",
			"date_added": 1574728908
		},
		{
			"comment_id": 36,
			"body": "Woah, your teamwork is a gambling at best. I don't do collab work at all but I'm sure it should be way more reliable than this. Also, how comes you dislike the MS Office UX? I'm not a fan but they truly keep their interface clean and appealing (imho). LibreOffice is just years behind in terms of aesthetic but that's not really a game breaker for me.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1574697530",
			"date_added": 1574787723
		},
		{
			"comment_id": 37,
			"body": "I know many MS products are bloated at best, but I find it interesting that what you do most is what MS Office deems not so common so to hide it deep within its settings. And yeah, if you ever expect privacy with MS you've been wrong for too long already. I thought Windows 10 made that clear to everyone.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1574697530",
			"date_added": 1574874102
		},
		{
			"comment_id": 38,
			"body": "I updated my zerome profile a few days ago listing rexresearch and my hub but I really didn't push for it. I'll try disabling syncronite to check. Also, as of now the 72 peers for rex fell to about 25, and my hub has 15 peers as listed by zerohello. the hub saw a huge increase in peers in no time.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1575000097",
			"date_added": 1575064655
		},
		{
			"comment_id": 39,
			"body": "If you don't need it to be as close to an average joe as possible, you could use something like tron script. it improves windows 10 performance a bit and I kind of remember it giving you better handling of windows updates. Also, I use qemu for my machines; if you can redirect writings to a file in ramdisk your disks will thank you when windows updates thrashes the shit out of them :)",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1575648342",
			"date_added": 1575652424
		},
		{
			"comment_id": 40,
			"body": "@SSDifnskdjfnsdjk: I learned to do those things while trying millchan but the issue is, there's no easy way to list all files with their respective belonging boards/users so I could quickly spot bad images that I forgot to downloaded either willingly or accidentally and forgot about them. Also, I think I saw that blacklisting boards would delete their files, but it still left references to files in zerohello's files tab.\nAnd about the node, it's not a public proxy but a normal device of mine, I keep it always on and I was a bit scared some nasty content could be put in it from a vulnerability allowing an attacker to add a given zite. I may be too paranoid though..",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1578327878",
			"date_added": 1578334229
		},
		{
			"comment_id": 41,
			"body": "@Git Center: I'll check it out, thank you.\n\nUpdate: Yeah, it works as expected, new sites are blocked in my node now. thanks again.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1578327878",
			"date_added": 1578346718
		},
		{
			"comment_id": 42,
			"body": "And here I am, sitting at in the shadows, doubting of everything and everyone, welcome to the internet.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578345905",
			"date_added": 1578421215
		},
		{
			"comment_id": 43,
			"body": "@draugrdeathlord@zeroid.bit: How to become a beast, please?",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578345905",
			"date_added": 1578425034
		},
		{
			"comment_id": 44,
			"body": "hmm, a god will be then.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578345905",
			"date_added": 1578426250
		},
		{
			"comment_id": 45,
			"body": "Digitize it and don't lose it.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1578561533",
			"date_added": 1578572545
		},
		{
			"comment_id": 46,
			"body": "systemd is an init system, with a device mapper and daemon supervising suite, and ton of other things under one single project. Most people (me among them) consider it too bloated to work properly, and the complexity of such thing may sure be quite high. normally linux follows the unix philosophy of systems composed of programs, each doing one thing, and doing it well. I don't know about userd.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578621241",
			"date_added": 1578624793
		},
		{
			"comment_id": 47,
			"body": "yeah, kinda. can't say it's their purpose but it looks like that.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1578621241",
			"date_added": 1578631123
		},
		{
			"comment_id": 48,
			"body": "That ain't a predator, plastic isn't even aggressive at the least. If fishies die from inert plastic bags then they are more dangerous to themselves instead. I mean, microplastics and extra solar exposure isn't dodge-able but  plastic bags? really?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1581118915",
			"date_added": 1581122585
		},
		{
			"comment_id": 49,
			"body": "Yeah, I'm aware. I like to play dumb for comedy sometimes.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1581118915",
			"date_added": 1581124591
		},
		{
			"comment_id": 50,
			"body": "Won't do such a thing, I mean, I can't understand but it has a message, meaningful to a whole lot of people and I can help by spreading it with my node by not muting it. Besides, it may feed the need in me for starting to learn a new language :)",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1583112086",
			"date_added": 1583120603
		},
		{
			"comment_id": 51,
			"body": "Yeah, I didn't really mean they were plotting something (it was more of a joke), but since we get income of users in swarms most of the time I just felt like mentioning it.\nFeel at home, China people!",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1583112086",
			"date_added": 1583156509
		},
		{
			"comment_id": 52,
			"body": "@Taarezameenpar: I don't have a particular interest in chinese, but japanese, but if the need for learning chinese arises then I'll consider it. Also, I think you meant 'hearing' instead of 'saying'. :)",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1583112086",
			"date_added": 1583166846
		},
		{
			"comment_id": 53,
			"body": "Windows NTFS tends to fragment a lot but since windows 7 I haven't really seen the need to manually defragment except in the worst cases (systems used for years with less than 15% of free space and paging). Although fragmentation isn't really a concern in Linux, there are certain filesystems that certainly do fragment. BTRFS is one of those.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583164542",
			"date_added": 1583183354
		},
		{
			"comment_id": 54,
			"body": "Superb.\n@Vargink: TCP is a packet transmission protocol oriented to connections, that is, it establishes a connection among both ends and keeps it alive for the time needed. The funny part is that the way it establishes a connection involves sending a message and receiving an acknowledgement package back, essentially a 'handshake'.\nLol, what now? wifi degrades back before whole WPA?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1583736292",
			"date_added": 1583764213
		},
		{
			"comment_id": 55,
			"body": "Uh, so you already understood the joke. Fucking unnumbered packets...",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1583736292",
			"date_added": 1583799037
		},
		{
			"comment_id": 56,
			"body": "Hands down someone else's weapon, I highly doubt such a virus would just happen on its own given that market must surely have been working like it was working for a long time already. I mean, why now? why like this? when was the last time such thing happened? if similar things did happen before why didn't governments use wartime/emergency states/curfew before? why did they wait so darning long to close airports and dockers?",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1584818390",
			"date_added": 1584825070
		},
		{
			"comment_id": 57,
			"body": "He may be the dude but I don't consider him a true man.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1585581540",
			"date_added": 1585623468
		},
		{
			"comment_id": 58,
			"body": "Still, I don't know exactly what is says so even if it's spam, it is spam I don't understand, and probably it reflects part of the perspective of chinese people in their country.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1583112086",
			"date_added": 1588781593
		},
		{
			"comment_id": 59,
			"body": "It happens, that's how most laptops killed themselves and weakened their hinges plastic support...",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1598391380",
			"date_added": 1598495631
		},
		{
			"comment_id": 60,
			"body": "My experience using linux tells me that your wifi card issue might just boil down to ubuntu having its drivers bundled while manjaro didn't. I think you can use `$ lspci` to get a list of the pci devices (your wifi card there as well) and based on the card name you can get the driver for different distros. broadcom b43 driver comes to mind...",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1600354435",
			"date_added": 1600552156
		},
		{
			"comment_id": 61,
			"body": "640kb should be enough for every one...",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1601352984",
			"date_added": 1601577871
		},
		{
			"comment_id": 62,
			"body": "@loligod is a nice human being (hopefully) who seems to like cute and young girls, notoriously lprefers those of 2 dimensions though.",
			"post_uri": "1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1603658350",
			"date_added": 1603662485
		},
		{
			"comment_id": 63,
			"body": "You mean above 10MB",
			"post_uri": "1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1603663723",
			"date_added": 1603678766
		},
		{
			"comment_id": 64,
			"body": "something something 10MB file size limit exceeded",
			"post_uri": "1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx_1607627739",
			"date_added": 1607663820
		},
		{
			"comment_id": 65,
			"body": "Not sure again if it was whole site or single file, is that site yours? if it is then try raising the site size limit in the zeronet sidebar to something greater than 10MB (if it is the default) and then try signing again.",
			"post_uri": "1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx_1607627739",
			"date_added": 1607736144
		},
		{
			"comment_id": 66,
			"body": "@mxh69420: It's in the sidebar, at the top right of a site in zeronet there's a 0 button, pull it to the left and it should show you the sidebar, there you'd find what I posted in the image. If you raise the size of your site then users will have to raise the size as well, but if it's only above 10MB then it will ask for it once, on the contrary there are other sites pretty heavy (+500MB) and when you download those they ask you several times to raise the size in steps (raise to 20MB, 50MB, 100MB, 200MB, ...)",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1608088280",
			"date_added": 1608168982
		},
		{
			"comment_id": 67,
			"body": "Go to /var/log and see if there's a log file for your distro's package manager, you could see there what packages were removed and attempt to reinstall those.",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1608230829",
			"date_added": 1608258208
		},
		{
			"comment_id": 68,
			"body": "no problem",
			"post_uri": "1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1608230829",
			"date_added": 1608401744
		},
		{
			"comment_id": 69,
			"body": "that zite doesn't have the optional files well seeded, I'm trying to download them but none comes my way :/\nEDIT:\nFully seeded now!",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1614148400",
			"date_added": 1614516289
		},
		{
			"comment_id": 70,
			"body": "biofuels could be made of poorer people too ;)\nbiofuels are made from many organic things, some are achieved through bacterial breakdown of matter so anything organic could lead to biofuels in a way or another, that said, how does it sounds being able to run your car out of cow poop?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1614617309",
			"date_added": 1614832649
		},
		{
			"comment_id": 71,
			"body": "@ulrichard: methane can be produced from cow manure easily, but I now see that's not helping much the pollution race. So, hydrogen cars should it be?",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1614617309",
			"date_added": 1614955181
		},
		{
			"comment_id": 72,
			"body": "@Styromaniac: I see, many thanks for the info.",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1617999746",
			"date_added": 1618009476
		}
	],
	"follow": []
}