{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1534666160_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "For Linux you can try iotop. You must log into root command line to view this and have root access.\nThese commands will work with most Linux distributions. \nhttps://www.tecmint.com/iotop-monitor-linux-disk-io-activity-per-process/\nhttps://www.opsdash.com/blog/disk-monitoring-linux.html",
				"added": 1543876361
			},
			{
				"comment_id": 3,
				"body": "> [leftside](#comment_4_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Stop using Microsoft Windows.\n\nWindows is not even worth pirating.",
				"added": 1543882668
			}
		],
		"1533555669_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "If you ever accidentally hit a secret gov project search term they will tack you down and kill you. I have personally seen this. I survived they did not. Welcome to the New World Order..  We are living in 1984 on steroids. Call it the Truman Effect.",
				"added": 1543882478
			}
		],
		"1545064108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "They are recording everything you are doing with those devices. Basically you are carrying a Bug with you everywhere you go. I hate to say this but all smart phones are like that as well. They use all of that data they collect to look for weaknesses and possible ways to black male you in the future if you would be useful to the Communists.",
				"added": 1545066560
			},
			{
				"comment_id": 5,
				"body": "> [znnex](#comment_4_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Are people worrying about tech from the US too?\n\nWhat tec? The USA does not make any smart phones domestically that I know of. Everything is made off shore.",
				"added": 1545075533
			},
			{
				"comment_id": 6,
				"body": "> [leftside](#comment_9_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): U can choose between two. Made-in-China ones will protect u from NSA's surveillance, and vise versa. lol\n\nYou know dam well they are both working together. Paper and pencil are your only option now to have any freedom from surveillance. I give it about 10 years before everyone is dead. We have some really bad people running things.",
				"added": 1545097448
			}
		],
		"1545125003_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "The CPU Manufacturers need to release all schematics for the public to look at there designs and see if what they are saying is actually electronically and technically true for global public national security reasons.\n(I bet there are things in there that will make everyone's hair stand up on end.)",
				"added": 1546504391
			}
		],
		"1528386725_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "> [ssdifnskdjfnsdjk](#comment_44_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): UPDATE: Lawmakers in the European Union are meeting again on January 21 to try to finalize the text of Article 13.Article 13 impact on sites like Youtube: \"As a result, YouTube would be forced to block millions of videos (existing and new ones) in the European Union. It could drastically limit the content that one can upload to the platform in Europe. Here is clean english video explanation of Article 13: https://www.youtube.com/saveyourinternet/\n\nThey will burn down Europe.",
				"added": 1547373213
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_45_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Actually i think their attempt may also be to make things better... but what will be the results? [...]\n\nIt will pass and Europe will go down in flames with more protests than ever before. They will burn down everything. Call in for troops to restore order then declare martial law suspending everyone from travel and free speech. They will then execute anyone that disagrees with them.  Then they will start there social credit scoring system. It will be like a digital Hitler. Except this time if you don't do what the gov says it will just remove your money. They people that runs things are not human. They are being controlled by an outside alien force that is trying to take over the planet. They call it the stupidity system.  And everyone will go along with this because they love there stupid dumb phone.",
				"added": 1547474281
			},
			{
				"comment_id": 12,
				"body": "> [ssdifnskdjfnsdjk](#comment_59_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): \"Can you imagine a world in which every word on the Internet is controlled by an AI which will decide if it can be published before you post it?\" (source) - it is Article 13 of the EU copyright directive which is rushed to be voted upon in EU parliament in next week/s.\n\nAI is at best a retarded cockroach. Trusting information to a machine that does not understand humor or sarcasm is playing with ultra crashed states of computer code gone bad.",
				"added": 1551718487
			}
		],
		"1550309510_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 10,
				"body": "> [leftside](#comment_15_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): When I was on Windows before, I used to run Corpernic which makes index of file contents as well.I remember it was wonderful till I moved to linux.\n\nTracker is another one. There is about 20 programs that you can use on Linux to search for files and file content. They are dangerous useful tools. And never use one that is in the cloud, or connects to an outside system. If you are a Journalist you should avoid these tools and even computers for anything you are working on currently. And always remember that all computer systems are all compromised and are being used for survalence purposes to be used against you. Every time you use a computer you are (Owned!) by an intelligence agency from somewhere.",
				"added": 1550312644
			}
		],
		"1550331862_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "Looks like they are using Fat 32 with that software. LOL...",
				"added": 1550344781
			}
		],
		"1553845855_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 13,
				"body": "> [ssdifnskdjfnsdjk](#comment_65_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): 1128 torrents, Processor usage: 15% Corei5 @ Windows 10, RAM 600MB(?), startup time on HDD 5 minutes, shutdown time: 1 hour\n\nU use Windows?",
				"added": 1553846211
			}
		],
		"1555063961_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 14,
				"body": "DC++ is garbage. No security and to easy to hack. Especially on windows systems. Even if you hide behind a proxy you are open on all windows systems. Linux is also vulnerable. DC++ needs t total re write to make it secure. I advise no one to use it at all. Open ssl is totally  open. Please reefer to the vault 7 data release.",
				"added": 1555119353
			},
			{
				"comment_id": 15,
				"body": "> [satoxyn1](#comment_1_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): The only actively developed DC clients are DC++, ApexDC++, AirDC++ and EiskaltDC++. [...]\n\nStick dc++ in a tor or some program that will mask your ip. Then I will like DC++. Until then the copyright police can play there game of carrot. Its a game they play with newbies.",
				"added": 1555215877
			}
		],
		"1554749674_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 16,
				"body": "My prediction.  They will eventually say that all words are hate speech. And that anything that contains words is a form of potential hate speech. They will then go after all books and computers world wide. This is the AI communist social credit scoring systems long term goal. (Absolutely Brilliant!) And it is coded in Lisp.",
				"added": 1555216145
			}
		],
		"1524692872_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 17,
				"body": "Someone needs to do a full list of sites. My list I have is outdated, and google is useless for finding things now days.\nBing is better but not by much. Start page and the other privacy searches are good but there results are not so good usually.",
				"added": 1555336035
			},
			{
				"comment_id": 18,
				"body": "> [ssdifnskdjfnsdjk](#comment_71_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i am wondering how dtube can be decentralized if they do not offer any P2P software which would build decentralized network for watching the videos.\n\nVery good question.",
				"added": 1555346370
			}
		],
		"1558459108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 19,
				"body": "Liberals are corrupt and they cant keep spewing enough lies. Eventually everyone will say that everything they say is a lie and totally shut them down.",
				"added": 1558633018
			}
		],
		"1558975127_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 20,
				"body": "What version of Fire fox? I have not had to much of an issue.  Hope this is not an update that I have not installed yet.",
				"added": 1558976624
			}
		]
	},
	"comment_vote": {
		"4_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"7_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	}
}