{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1598206333,
			"title": "Co z tą decentralizacją ?",
			"body": "Tak patrze na te projekty do decentralizacji internetu i przez dobre 3-4 lata nic szczególnego się niestety nie zmienia.\nZeronet obserwuje już od dłuższego czasu (3 lata) i tak dostrzegam, że projekt przestał się rozwijać. Peerów też raczej jak by ubyło. Czy komuś zależy by ten projekt zabić ?\nCo to programistów zeronet'a koronowirus dopadł czy co ? \nTak samo jest ze stronami, które są w zeronet niby są ale bardziej jako ciekawostka/wizytówka.\nAlbo youtube.pl(zeronet) dziś mam 27 peerów. Nikt więcej nie jest zainteresowany decentralizacją video a drugiej strony gada się, że yt wycina kanały.\n\nipfs - próbuje być podobnym tworem. Co prawda jest już klient jako worker w przeglądarce - i to bardzo fajnie. Na razie nie widziałem aplikacji, która naprawdę negatywnie korzysta ipfs( bez instalacji go-ipfs lub node). Co prawda jest projekt anytype.io, który zamierza korzystać z ipfs jednak jeszcze nie jest ukończony.\n\nTeż ciekawą projektem jest gunDB (https://gun.eco). Jest to baza danych p2p -  synchronizująca się miedzy przeglądarkami(peerami). Są projekty jakieś, które z tego korzystają np: https://notabug.io czyli taki reddit p2p. szkoda jedynie że nie można osadzać zdjęć i wideo, iris.to - chat p2p. Niestety drenuje baterie :)\n\nJak by ktoś wykorzystał te technologie z stworzył choć jedną aplikacje, (małą) ale zajebiście działającą, dopracowaną, wzglednie przetestowaną i która mogłaby rywalizować z rozwiazaniami komercyjnymi to oddwiek byłby globalny.\nZaś ja ze swojej strony widzę rozdrabnianie się, dodawanie nowych funkcji, niedopracowywująć nie dociagnieći tworząc kilka mały aplikacji, które są w chuj niedopracowane.",
			"added": 1598206332
		},
		{
			"topic_id": 1598206779,
			"title": "zeronet - archlinux",
			"body": "Jak przeglądam zeronet to co stronę zmienię na inną to mam 20 - sekundowe opóźnienie i dopiero strona się włączy - tak samo się dzieje przy stronie zerohello, pojawia się podział strony na panel i prawą stronę interfejsu i muszę czekać 20 sekund kiedy wszystkie strony na panelu po lewej stronie się pokarzą. wcześniej tak nie miałem ale na win10.",
			"added": 1598206777
		},
		{
			"topic_id": 1598383291,
			"title": "zeroLSTN",
			"body": "Działa wam ta strona : \nhttp://127.0.0.1:43110/ZeroLSTN.bit/\nU mnie ani jedna piosenka się nie otworzyła a przy wgraniu jakieś od siebie jeste cały czas uplading i nic. \n\nBrakuje mi właśnie globalnego odtwarzacza z muzyka gdzie mógł bym odtworzyć swoją playlistę. ZeroLSTN był by doskonały tylko nie wiem ale mi chyba to nie działa.\nCiekawy jestem jak u was to wygląda?",
			"added": 1598383288
		}
	],
	"topic_vote": {
		"1598022031_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1598188181_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "A masz jakieś konkretne informacje ? tj. Jaką konkretnie stronę orange zablokowało?\nTeż ubolewam, że sieć zeronet nie jest wystaczająco popularna. Sądzę, że jest tu problem z małą ilością programistów umiących okiełznać api zeronet. Mam nadzieje, że sytuacja się zmieni.",
				"added": 1598194296
			},
			{
				"comment_id": 3,
				"body": "Jeszcze zależy jaką gość ma umowę z isp. Jeśli chodzi o Orange to nie wykluczone, że ma wewnętrzne ip. Zazwyczaj z tymi usługami jest tak, że są filtrowane  jako firewall(safe protect), aby jakiś Janusz nie zaraził kompa wirusem. Do tych usług doczepione są właśnie jakiś system ochrony przed wirusami itd. Stąd mogą być utrudnienia z dostępem do jakieś strony. \nTrzeba się dowiedzieć u dostawcy i tyle, jak to jest. \nNatomiast jeżeli, ktoś wie, co robi i gdzie wchodzi, niech weźmie sobie stałe IP gdzie trzeba o to już samemu się zabezpieczyć. A dodatkowo można sobie postawić swoją stronę internetową lub inną aplikacje.\nJa osobiście jestem zwolennikiem stałego ip.",
				"added": 1598285779
			}
		],
		"1598206333_19ffx3PUJM1UJsgBRQR3j1nM2MR1ESdwcE": [
			{
				"comment_id": 2,
				"body": "freenet jest fajny chyba jedynie z jednej strony. Jak wyszlesz plik to on powinien być u innych peerów przez pewien czas. Jednak sieć ta jest masakrycznie wolna. Co czyni ją mało użyteczną. \nA w mojej ocenie aplikacja powinna działać na komputerze jak i na telefonie. A to jest już jest sztuka by to tak opracować.\nChociaż gdzieś widziałem zeronet mobilny ale jak on działa to nie wiem.",
				"added": 1598208666
			}
		]
	},
	"comment_vote": {}
}