{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1528086940,
			"title": "Categories",
			"body": "This is a good app and seems quite active, but could use some categories. At least general discussion and ZeroNet discussion :)",
			"added": 1528086939
		},
		{
			"topic_id": 1528117771,
			"title": "Hmm",
			"body": "I just realized how much better ZeroNet really is than WWW. Not just that it it decentralized, but one can simply clone a site and make improvements to it. Users will go to whichever site they see is best. This feature can potentially speed up development of popular sites so much one cannot even imagine. \n\nIt's like if Facebook was open source project on GitHub and it's database was public also.",
			"added": 1528117769
		}
	],
	"topic_vote": {
		"1528086940_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1528086940_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo": [
			{
				"comment_id": 1,
				"body": "Front page can still be feed from all categories.",
				"added": 1528088580
			}
		],
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 2,
				"body": "There could be subscribable filter lists from where one could choose. Zites could utilize some standard way of filtering content based on user's active filter lists. Though user filters should be applied carefully, as they might obfuscate the content. Filters should probably be applied only on link level and not hide partial page content. Also one way of doing it could be just to add some icon next to links which match user's filter criteria or show warning before navigation to such link.",
				"added": 1528609694
			},
			{
				"comment_id": 3,
				"body": "On site content should be moderated by all users or selected group of users (moderators) instead of filter lists. Even some deep learning algorithm could potentially moderate on site content. For example if site is rated SFW, a deep learn algorithm could potentially detect pornographic content and block it. Moderation with selected moderators or based on algorithms has benefit on following predefined rules, which could be written on a zite content rules page, while moderation by all users would follow just undefined \"general consensus\".",
				"added": 1528610052
			},
			{
				"comment_id": 5,
				"body": "Users can choose whichever site they like more. However without any kind on content filtering bad actor can break any site. If there is no any kind on content filtering on ZeroTalk, I can simply attack it and post it full of shit and no one can find anything worth reading anymore.\n\nDifferent people prefer different levels of content filtering. Spam filtering is first level of filtering, after which comes child porn, porn, gore etc.\n\nIt's zite owners decision to filter or not to filter, and in my opinion it is good to tell site visitor if such filters exist. Theres no other authority than zite owner to decide whether to apply filtering or not.",
				"added": 1528619909
			}
		],
		"1528582989_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": []
	},
	"comment_vote": {}
}