{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1566192600,
			"title": "Daniel Domscheit-Berg",
			"body": "Every time I hear some supposedly kkk anti-semite stereotype on tv or online reminds me of what info Daniel deleted.\n\nhttps://web.archive.org/web/20131020210919/http://www.bbc.co.uk/news/technology-14616899\n\n\"Wikileaks' statement went on to state that Mr Domscheit-Berg had also deleted 5 gigabytes of data relating to Bank of America, the internal communications of 20 neo-Nazi organisations\"\n\nmaybe that info is still out there... hmmm.",
			"added": 1566192599
		},
		{
			"topic_id": 1566448853,
			"title": "The obvious value of crypto currencies that is never spoken of in main stream",
			"body": "There is a reason the real Satoshi Nakamoto never took credit.\n\nCrypto is and always has been the vehicle to destroy central monetary systems by undermining Their capacity to restrict and or control transactions. The elimination of the use of economic warfare by nations, the concept of sanctions will, is obsolete. \n\nThe key to this is a apolitical monetary system that is owned by everyone and no one, so far has been achieved through crypto and will be enhanced as time goes on.\n\nThe silence of the development of the Petro by Venezuela has been deafening. The means of it entering the market is through Chinese exchanges which will have exposure to the greater crypto market and they also have facilitated access to nations such as Iran and North Korea.\n\nThis is the Shanghai Cooperation Organization protecting it's observers and assets. The deafening silence of the existence of the SCO in the main stream is also telling of the fear they have for this eastern block.   \n\nCrypto will explode in value, but makes me wonder what the West will do when they loose the ability to sanction any nation.\n\nTLDR; Satoshi ripped off cryptonomicon's darknet money and made it real, it was never about being rich.\n\nTo address some basics I present the following.\n\nWhy doesn't someone or anyone else make another TOR network? It's open source and organizations/nations could attempt to undermine it's trust and use by creating infinite copies of it.\n\nHowever this will only work if one/group truly develops a stronger network than TOR. This will only be detrimental to those who wish to harm TOR, same with crypto networks.\n\nIt's cryptography must be able to withstand attacks of 1st world intelligence agencies.\nIt must be owned by everyone and no one, open sourced p2p.\nIt must be apolitical and favor no nation, doesn't care about sanctions/embargo's.\nIt must have fungibility and protect the identity of it's users, no KYC bs.\n\nHas the capacity of replacing financial network systems like SWIFT.\n\nIf a crypto can perform these functions, one can clone the open source code but one can not clone the p2p network or even hope to reach consensus with users in that network. You would more than likely trigger an immune response and achieve a negative consensus to your interloping crypto.\n\nThis will also influence the value of the crypto since it's possession is granting you access to this network and it's capabilities.\n\n\n",
			"added": 1566448851
		},
		{
			"topic_id": 1567750015,
			"title": "Charging XMR/Tumbled crypto for ZeroID's",
			"body": "I feel this would be a good way of allowing the use of TOR exit nodes and VPN/IPs. \n\nMake the spammer(s) send the zite owner crypto each time they burn there IDs to get issued a new one.\n\nSo any campaign they engage in will just make their target zite owner gain a profit while they eat the cost.\n\nIf the attacker is determined, the zite owner can sell ID generation at a premium and force the attacker to either stop or send a lot of wealth to their target making an attack counterintuitive.",
			"added": 1567750012
		}
	],
	"topic_vote": {},
	"next_comment_id": 26,
	"comment": {
		"1566014746_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 1,
				"body": "So a clear net site where the admin can be subpoenaed and is subject to a warrant is some how better?\n\nSecurity is more important then user experience.\n\nEven if you connect to this site over clear net they have no central point to compel user ip logs so they \nwill have to dig for it.  A example of this is when they went after piratebay torrent users which \nwas and is a total failure then they went after the site admins and still failed to bring the site down. \nThe site is still up to this day and probably the torrent info could be hosted here.\n\nThe certificate system is a pretty good way to eliminate bots and imposters without needing user PII.\nIt would be worth a lot if someone could make it interoperable with clear net sites.\n\nWith tor enabled it's pretty much a p2p onion service to onion service network. Which is what seems \nto be happening from looking at the zeronet debug logs. The ideal scenario is that the zite admin \nhas no PII from the users and the users have none about the admin or each other as well, a trust \nless system. The methods used to harass bit torrent users won't work against tor onion services. \n\nThe whole fiasco that the chans will bring will provide zeronet developers with good data on how \nbest to enhance zeronet security.",
				"added": 1566051367
			}
		],
		"1566051166_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 2,
				"body": "So a clear net site where the admin can be subpoenaed and is subject to a warrant is some how better?\n\nSecurity is more important then user experience.\n\nEven if you connect to this site over clear net they have no central point to compel user ip logs so they\nwill have to dig for it. A example of this is when they went after piratebay torrent users which\nwas and is a total failure then they went after the site admins and still failed to bring the site down.\nThe site is still up to this day and probably the torrent info could be hosted here.\n\nThe certificate system is a pretty good way to eliminate bots and imposters without needing user PII.\nIt would be worth a lot if someone could make it interoperable with clear net sites.\n\nWith tor enabled it's pretty much a p2p onion service to onion service network. Which is what seems\nto be happening from looking at the zeronet debug logs. The ideal scenario is that the zite admin\nhas no PII from the users and the users have none about the admin or each other as well, a trust\nless system. The methods used to harass bit torrent users won't work against tor onion services.\n\nThe whole fiasco that the chans will bring will provide zeronet developers with good data on how\nbest to enhance zeronet security.",
				"added": 1566063489
			}
		],
		"1566152917_1Azwyo4W2zSSRbHECg7DBQEt19iwyPwcxf": [
			{
				"comment_id": 3,
				"body": "> [almostsoul](#comment_21_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): I was thinking about Seth Rich earlier today, and how sadly he died for nothing. The DNC leaks have affected absolutely nothing, and their party has not changed in the slightest even after the revelations. It's at least a lesson in the futility of political change.\n\nyes voting is pretty much pointless, but exposing them and getting them thrown in jail is much more effective so energy should not be wasted on anything else other than exposing them.",
				"added": 1566197736
			}
		],
		"1566153558_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 4,
				"body": "Don't have any docs but found this interesting article. Seems to be a plausible explanation for the \nodd circumstances surrounding him.\n\nhttps://nymag.com/intelligencer/2019/07/fraud-and-blackmail-jeffrey-epsteins-finances.html\n\nThat link to that zip seems dead",
				"added": 1566198262
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 5,
				"body": "> [numismatist](#comment_54_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Crypto is too fragile to destroy fiat. You’re looking at this the wrong way. What is the point of fiat? It’s to decouple the money creation, lending, and yes even destruction process from resources with value. [...]\n\nHow fragile is speech? When you open source code you turn it into speech. Why do you think the first thing nations attack is free speech? Due to it's power.",
				"added": 1566452699
			},
			{
				"comment_id": 6,
				"body": "> [numismatist](#comment_56_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Passing around complicated little mathematical messages which require a network consensus and a big block chain or whatever is too fragile. [...]\n\nlittle mathematical messages? you mean encryption? when nation state militaries abandon the use of it them then we can agree.",
				"added": 1566453107
			},
			{
				"comment_id": 7,
				"body": "> [numismatist](#comment_58_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Blockchain based crypto is inherently fragile and we’re on the cusp of everything but OTP being obsolete with quantum computing. Perhaps we’re already there.\n\nYou bring up quantum computing without even understanding it so obviously, you going down a list?",
				"added": 1566453393
			},
			{
				"comment_id": 8,
				"body": "One thing I do know that if any trick was possible the NSA would of saved face by capturing or assassinating the shadow brokers for selling there exploitation tools, but they are still selling them for crypto (XMR) to be exact.\n\nHey I'm just pointing out the writing on the wall, it's nothing personal.",
				"added": 1566453931
			},
			{
				"comment_id": 9,
				"body": "> [numismatist](#comment_60_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): You’re quick to accuse but I bet I know more than most people. I’ve been programming the IBM Q machine for a year now.\n\nIf you got it figured out then steal Satoshi Nakamoto's coins and become a billionaire. Until you do your words are meaningless and will not stop this advancement. \n\nWhat good is knowledge without action?",
				"added": 1566454540
			},
			{
				"comment_id": 10,
				"body": "> [numismatist](#comment_61_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): I don’t personally mind if you invest in crypto. I’m just not doing it myself. If you got in early and mines some Btc that’s great, otherwise it’s a very risky investment.\n\nThat's how this network works, if you fail in your design it get destroyed very quickly. However if it survives it will only get stronger. Theoretical knowledge has no power here until it can be applied practically.\n\nThen to the victor go the spoils, in this case it seems like the nations of the east are coming out on top.",
				"added": 1566455061
			},
			{
				"comment_id": 12,
				"body": "> [aim64c](#comment_34_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): The chief problem with cryptocurrencies is one of accepted value.  The reason gold or silver has an obvious value to it is that even if just considered a base metal - its purified form represents a proof of work.  Someone had to dig it out of the ground and then refine/coin it - and no one would reasonably part with their product of that work without a perceived equivalence of exchange.  IE - the miner didn't just give up his work for nothing, and so on and so forth. [...]\n\nGold and Silver is subject to export controls and can be easily seized, they can try with crypto but will have as much success as the do with enforcing copyright. \n\nThis is where the value is derived from.\n\nin practical terms on could purchase an amount of BTC/XMR then board an international flight then upon landing proceed to trade that crypto for the current amount in gold/silver/fiat if that individual has the network to establish liquidity. \n\nNow tell me how will one go about moving a few crates of gold bars through an international airport?",
				"added": 1566460780
			},
			{
				"comment_id": 13,
				"body": "> [90w8fuiosrhui](#comment_19_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F): Precious metals and crypto are both way better options than governments toilet paper money. [...]\n\nExactly, Crypto's are to Swift what Tor is to the Internet. The purpose of crypto is not to compete with gold or silver it is replacing wire transfer type transactions without relying on the Swift financial network.",
				"added": 1566462148
			},
			{
				"comment_id": 14,
				"body": "> [xcape2net](#comment_342_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The problem with cryptocurrencies that I'm sure the economists and bankers understand it that it is not a store of value.  When anyone can create their own cryptocurrency that is exactly the same as any other except for the name, there cannot be a limited supply.  This is why governments shut down any cryptocurrency backed by gold; they know it could succeed.  I never hear cryptocurrency enthusiasts discuss crypto's poor usefulness as a store of value.  I assume this is because they have no answer for it.\n\nWhat backs crypto is the level of trust that is gained by the network in completing it's designed function, which is to replace SWIFT.\n\nWhat value or assets is the SWIFT financial network backed by? Is it a peer to peer network? Can it be anonymized?\nIs it subject to political abuse?\n\nAny currency, fiat or crypto that claims to be supposedly back by something will always wind up being fractionally backed by whatever asset due to fraud. Which is the reason nation states are approaching crypto in this way, so in reality all they are creating is a token with crypto as a decentralized core.",
				"added": 1566481018
			},
			{
				"comment_id": 15,
				"body": "> [xcape2net](#comment_344_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): SWIFT is neither a currency nor a store of value.  It does not make sense to compare crytocurrency to SWIFT.  The fractional banking system is not a currency; it is a lending system by which more currency may be created.  You are comparing different things again.   [...]\n\nComparing crypo to SWIFT makes perfect sense since it is not a physical currency, it is not a paper legal tender or a coin and it's design makes systems like SWIFT obsolete since it also is a financial network. The p2p consensus network enforced by cryptographic standards not central authorities make it an apolitical system. Further increasing the value of it's network.\n\nA true crypto network is not subject to OFAC controls from the USA or any other nations similar department.\n\nThe fact that you compare crypto to physical assets shows you do not understand the purpose of why it was built.",
				"added": 1566529290
			},
			{
				"comment_id": 16,
				"body": "> [xcape2net](#comment_346_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Nothing you've said here makes sense.  But, why don't you tell me why you think crypto was created?  I thought is was to be a replacement for the fiat currencies we have now.  In other words, it was supposed to be a store of value, a medium of exchanges, and a unit of account.  I've shown that it can't be used as store of value, because an infinite quantity of it can be produced.  It's fine as a medium of exchange.  It's questionable as a unit of account, because the value of it fluctuates so wildly.  But it could possibly be stabilized somehow to make it a better unit of account.  So, while it could replace the SWIFT system, that doesn't mean it could replace our current currencies as a store of value.  We would need something else to act as a store of value.  We could use gold-backed crypto for that.  But, governments (who I'm sure are fully aware of the point I'm making) have already shown that they will shut down any real-asset-based cryptocurrency.  This brings up another problem with bitcoin that is off of our topic of discussion--it is not immune to regulation, and anything that can be regulated can be destroyed.  As the US Supreme Court said decades ago, \"the power to tax is the power to destroy\".\n\nThey have done a real bang up job enforcing and regulating copyright concerning digital content. Until they can do this right then they may have a shot at regulating crypto networks. \n\nAll they can do now is target and regulate exchanges but that is being addressed through the development of decentralized exchanges.",
				"added": 1566562727
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_356_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): They are doing more than just regulating centralized exchanges.  They are making it very difficult for anyone to buy cryptocurrency with fiat currency without identifying themselves first. The one exception is when the buyer and seller meet face-to-face (which almost never happens; see the sparsity of face-to-face sellers on Bisq).  This means that they can tax essentially all exchanges of cryptocurrency for fiat currency.  In fact, the US Internal Revenue Service is already mailing out notices of taxes due for exchanges taking place as far back as 2013 (meaning interest penalties apply).  Being able to tax something is a large part of the definition of being in controlling of it. [...]\n\nYes I know they are targeting liquidity of certain coins from example XMR is pretty much blacklisted but that in my opinion means that would make it perfect to replace Tether/USD/USDC for trading pairs on a decentralized exchange.\n\nA good decentralized exchange will focus on only trading crypto's. It would also leverage TOR for it's communication protocol and the use of any national currency would not be allowed in it's design. This would be intentional to cause jurisdictional uncertainty since every user is on TOR and no one is trading in state currencies.  \n\nBold whales could exchange some of their holdings using a crypto with good fungibility into XMR to open an account on a DEX exchange like this. \n\nAny decentralized exchange worth their salt would lock down the primary crypto to open an account with them to XMR or something better if it comes along.\n\nCash out will only work in crypto to force users to come up with there own method on converting the crypto into cash and this will encourage merchant's to accept crypto as payment expanding the economy around crypto cutting out state currencies.\n\nThe ideal scenario would be to limit the regulatory capabilities by governments of exchanges and traders down to business large and small plus there clients. This will be to insure they feel that arbitrary regulatory pressure.\n\nWhich would result in very interesting consequences.",
				"added": 1566612471
			},
			{
				"comment_id": 18,
				"body": " \" hurr: gonna laugh so fucking hard when cryptocucks are kicked onto their knees and shot in the back of the head like  the kike leeches they are. hopefully with an extensive torture session beforehand. you contribute NOTHING. you are no better than a central banker.\"\n> [90w8fuiosrhui](#comment_34_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F): Always keep your head held high! you were just too late to join the party ;)\n\nThey are just noise, best just to mute them. They contribute nothing and wish to prevent other from changing anything while complaining about everything at the same time. Pathetic individuals.",
				"added": 1566647008
			},
			{
				"comment_id": 19,
				"body": "> [aim64c](#comment_38_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): My counter to this is that we see nearly the exact opposite behavior from people/customers in practice.  While some businesses will always see some degree of activity by virtue of law of averages, the law of averages as it pertains to economics is not entropic, but generally  Gaussian - or standard distributions/deviations.  Sure, I could start up some variety of cryptocurrency, today, and maybe make a few thousand dollars of market cap.  Getting above that is going to be very difficult for the same reason that stealing market share from established businesses is difficult.  While some of this is down to anticompetitive market practices and the like - even in situations where there is low barrier to entry, the market is usually dominated (at least within a cultural boundary) by two to three main market competitors at any given time, with an upper bound of around five. [...]\n\nA simple way that I have come to explain this, one can ask. \n\nWhy doesn't someone or anyone else make another TOR network? It's open source and organizations/nations could attempt to undermine it's trust and use by creating infinite copies of it.\n\nHowever this will only work if one/group truly develops a stronger network than TOR. This will only be detrimental to those who wish to harm TOR, same with crypto networks.\n\nIt's cryptography must be able to withstand attacks of 1st world intelligence agencies.\nIt must be owned by everyone and no one, open sourced p2p.\nIt must be apolitical and favor no nation, doesn't care about sanctions/embargo's.\nIt must have fungibility and protect the identity of it's users, no KYC bs.\n\nHas the capacity of replacing financial network systems like SWIFT.\n\nIf a crypto can perform these functions, one can clone the open source code but one can not clone the p2p network or even hope to reach consensus with users in that network. You would more than likely trigger an immune response and achieve a negative consensus to your interloping crypto.\n\nThis will also influence the value of the crypto since it's possession is granting you access to this network and it's capabilities.",
				"added": 1566700740
			},
			{
				"comment_id": 20,
				"body": "> [xcape2net](#comment_361_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Here is an article that I happened to find today that talks about the lack of privacy in bitcoin and some approaches to using it more privately.  Bitcoin Anonymity Guide 2019: How to use BTC like a straight up G\n\nYour links broken from Tor, however I would just wash BTC by converting it into XMR then back into BTC between different exchanges using different wallets and leveraging XMR's mechanics to break any link between BTC wallets.\n\nWon't go into details which could ruin my method's, feel most you guys would figure out your own way.",
				"added": 1566784747
			},
			{
				"comment_id": 21,
				"body": "> [eyeballgummy](#comment_12_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): Aww Shit, even after 11 years this crap never gets old!\n\nYou know BTC in 2009 was less than 10 cents. Why even admit this, you laughing at yourself?",
				"added": 1566881492
			}
		],
		"1550241221_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "This is a pretty good idea that will work with networks that are fractured, segmented air-gaped networks. For example if the transatlantic cable's get severed.",
				"added": 1566456622
			}
		],
		"1566953714_17YLe3Jg9YRvVknLPRrtzuKcTs43TKkfhz": [
			{
				"comment_id": 22,
				"body": "So self assured to the point of being gratuitous, you are only fooling yourself.\nAsk yourself, if a tree falls in a forest and no one listens does it make a sound?\n[M]",
				"added": 1566970476
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 23,
				"body": "thou doth protest too much, but do keep on though it might make a difference.\n\nWaiting on thepiratebay.org to be taken down before a mirror of it gets adapted to the api and \nconverted into a zite here but pretty sure there are already zites hosting torrents.",
				"added": 1567661572
			}
		],
		"1567750015_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 24,
				"body": "> [aim64c](#comment_48_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h):  I retain a key that identifies me to the block chain. Rather than running file changes locally, file changes are authenticated through the block chain. IE - when a request to change a file or submit a file is made, it is authenticated against the block chain, which uses its cryptography to track file owners. Because cryptonight is generally double-blind, it allows for files to be managed, seemingly with random owners, that are tied to an owner based on the cryptography block they were posted under and the owned key a person then submits requests to change with. Thus - a zite and file owners can mutually verify each \n\nCrypto would only be involved in obtaining a ZeroID. Using the ID will function as it currently already is.",
				"added": 1567828265
			},
			{
				"comment_id": 25,
				"body": "> [gitcenter](#comment_957_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Sending crypto (I assume you mean coins here) means that ID registration becomes paid. That's... not what I expect from a system designed to be open to everyone.\n\nYes, I can see your point. The owner could implement this not in a default manner but as a counter to a spike in traffic from some adversary.\n\nThis solution would have a better chance of maintaining a participants anonymity since it allows the use of TOR Exit nodes and VPN gateways.\n\nAn clearnet IP assigned to an ISP with client billing information is far more difficult for someone to obfuscate than a crypto wallet address.\n\nThis would work for an individual who spends a fixed amount for booze, the ID will last them since they are not assholes with orders from some INC/CO/GOV.\n\nBut for an attacker burning through dozens of IDs then it will hurt them.",
				"added": 1567829857
			}
		]
	},
	"comment_vote": {
		"21_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"34_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"2_16wy1B4fK7XdsaZPBsQkxcnUzrcMyE55UG": 1,
		"903_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	}
}