{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1544277290,
			"title": "Multiple users plugin doesn't work with already created account",
			"body": "So I already had an account set up (this one) and when I enable Multiple users, it forced me to create a new ID instead of loading this one. Anyone knows what's going on?",
			"added": 1544277289
		},
		{
			"topic_id": 1546142431,
			"title": "ZeroMe problems",
			"body": "I kept getting this error every time I try to reload ZeroMe\n>[ite:1Lj1oP..QWY6 WebSocket handleRequest error: DatabaseError: database disk image is malformed in UiWebsocket.py line 82 > UiWebsocket.py line 270 > MergerSitePlugin.py line 64 > MergerSitePlugin.py line 78 > SiteManagerPlugin.py line 65 > SiteManager.py line 150 > Site.py line 55 > ContentManager.py line 43 > ContentManager.py line 310 > ContentDb.py line 119 > Db.py line 75 > DbCursor.py line 70 \n {\"cmd\":\"mergerSiteAdd\",\"params\":\"1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV\",\"wrapper_nonce\":\"736464e26359b2b37ab62a98b124ada19e56a0710a58c95a65637a698bad362d\",\"id\":5}]\n\nNow It kept saying signing failed, file too large when posting even 1 character text post\n\nCan anyone suggest a solution? I tried deleting ZeroMe, expanding site size limit but no luck",
			"added": 1546142429
		},
		{
			"topic_id": 1565669207,
			"title": "Something Productive",
			"body": "Tell me things that you do to keep yourself productive, just wanna hear it out ;)",
			"added": 1565669204
		},
		{
			"topic_id": 1567569304,
			"title": "Risk of zites makes connection to clean net?",
			"body": "Clean net links is on ething but how can you know if a Zite's script or videos/media loader are not making connections that could potentially make you lose your anonymity? \nIs there a quick way to check?",
			"added": 1567569300
		}
	],
	"topic_vote": {
		"1544230510_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1544277290_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"1544353154_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1544935619_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr": 1,
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1546142431_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": 1,
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1567130399_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"1567536043_15yACUjRkanC9AeFyo7RQSBiZLWmmNvddW": 1,
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1568901657_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": 1
	},
	"next_comment_id": 69,
	"comment": {
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 1,
				"body": "So when i switch on Multiple users plugin, my account doesnt work @.@ even though I didn't mess with the seeds or keys yet",
				"added": 1544244629
			}
		],
		"1544353154_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 2,
				"body": "maybe something like PerfectDark did?",
				"added": 1544358091
			},
			{
				"comment_id": 3,
				"body": "> [blurhy](#comment_198_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): What's that\n\nPerfectDark is like a file sharing p2p service that doesn't seem to require a tracker, they seems to be using DHT and something called DKT(distributed keyword table) so idk if It'd be useful. \n> wiki: https://en.wikipedia.org/wiki/Perfect_Dark_(P2P)",
				"added": 1544374384
			}
		],
		"1544703954_1GHXQ3vMtadfHFjTwS3roqYe8LUsyDqN8f": [
			{
				"comment_id": 4,
				"body": "As for what I know,\n**Freenet** - deals with website by encrypting them into blocks. To open, clients have to gather the right blocks and decrypt it. Freenet took up lots of hard drive space because peers are required to store and distribute the blocks. Another down side is by using blocks, website can't be change easily afterward.\n\n**ZeroNet** - instead does not encrypt (not that I'm aware of, *good posibility of derping*) and serve website as is so opening once you got them downloaded is straight forward and fast. ZeroNet was built for dynamic changes to sites (a very good example is [ZeroMe - basically twitter like](http://127.0.0.1:43110/Me.ZeroNetwork.bit/) and this opens up a wide range of possibilities.",
				"added": 1544705972
			},
			{
				"comment_id": 5,
				"body": "> [timelinehyperbot](#comment_84_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Very similar, but Zeronet is different... [...]\n\nwow the timing :))))",
				"added": 1544706072
			}
		],
		"1544935619_12FHfMFhTHNjc13goZPW7LhBp2J3gJGnxr": [
			{
				"comment_id": 6,
				"body": "(something glitched and i posted twice so this one is deleted) ",
				"added": 1544936633
			},
			{
				"comment_id": 7,
				"body": "I'm up for changes, tho im currently limited on my abilities and neither have much knowledge about the details and systems. I'd love to talk about it tho",
				"added": 1544936673
			}
		],
		"1545219056_15TaxrtxopVTWbYVgp9fpeSv4thDgddB2Y": [
			{
				"comment_id": 8,
				"body": "maybe [_Donate_](https://zeronet.readthedocs.io/en/latest/help_zeronet/donate/) if anyone would like to support directly\n\nother than that, be active, create content so more people will be inclined to join :)",
				"added": 1545220282
			}
		],
		"1546142431_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_578_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS):\n>which means you arer on 1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2 hub and depend on its limits and per data/users/content.json i think it is 50KB only - \" \"max_size\": 50000,\".\n\nI think i messed up my account, removing the pictures and rebuild my database seems to unsync me entirely and I cant even create a new account. Even returning the pics and rebuild didnt fix it.\n\n> [pexo](#comment_39_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): \n>That is what I talked about in this post. You need to ask @nofish give your account more space. (I also need more space)\nI guess I'll also ask for more space, that sucks, other people seems to post just fine T_T",
				"added": 1546226746
			}
		],
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 10,
				"body": "*insert peeking emoji*",
				"added": 1565669377
			}
		],
		"1565669207_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 11,
				"body": "> [kidcourageous](#comment_1_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Desoxyn, since I have ADD.\n\noh :o \ndoes it helps?",
				"added": 1565684668
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 12,
				"body": "hola hola hey hey \nhola hola hey hey~~",
				"added": 1565684758
			},
			{
				"comment_id": 15,
				"body": "> [lampshade](#comment_6_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR): best test message ever\n\nbetter than the prev~ >:)",
				"added": 1565880061
			},
			{
				"comment_id": 24,
				"body": "Creeper",
				"added": 1566386495
			},
			{
				"comment_id": 26,
				"body": "> [jaoheah](#comment_1_12Be1Sy2i9vZYp3Cusiqvy5NbhhCKZnEsX): Awwww Man\n\nSo we back in the mine~,",
				"added": 1566530312
			},
			{
				"comment_id": 35,
				"body": "> [bigbadbob](#comment_462_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): i know someone with that name (spelled slightly different) who would write stuff like that... what are the odds... hummm. lolReminds me that I should call her IRL...  except im afraid... as i should be.\n\nIs theres something wrong between you two?",
				"added": 1567221273
			},
			{
				"comment_id": 38,
				"body": "> [bigbadbob](#comment_466_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): nothing wrong... nothing right, lol    just sparks and terror:) ups and downs,  dynamics and darwynism/box of wine... [...]\n\nhmm how bad? >:) \nwell if it's personal, it's alright, just having fun cause im bored :p",
				"added": 1567227332
			},
			{
				"comment_id": 39,
				"body": "> [bigbadbob](#comment_467_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I honestly think i could write a book on that subject..  I'm already feeling uneasy its her (even thought its highly unlikely)  [...]\n\nyep got it, plop you a reply :D",
				"added": 1567228408
			},
			{
				"comment_id": 40,
				"body": "> [bigbadbob](#comment_468_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): cool, i felt bad it took me so long to see it and respond.. that was awhile ago.  Ok... how bad.  Well she is a sweetheart who has been through a lot. [...]\n\nthat sounds heart breaking.... is she alright?",
				"added": 1567229382
			},
			{
				"comment_id": 41,
				"body": "> [bigbadbob](#comment_470_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Thats why i was thinking of checking..  she damn near broke my head thats how bad.  At the end of the day i know she loves me,  Probably wishes she done differently, but to say our experiences together were completely over the top would be an understatement.\n\nthought about asking if she has gotten too serious on the 'tests' .... being over the top is something good right?",
				"added": 1567230099
			},
			{
				"comment_id": 42,
				"body": "> [bigbadbob](#comment_472_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): over the top in a rollercoaster of terror way,  Im holding back on specific details cause it gets into mental health and stuff.  [...]\n\nwell i can see where the amusement comes from, would like to hear some more but for now theres something pops up irl... I wish you the best and going to catches you later :3",
				"added": 1567231077
			},
			{
				"comment_id": 58,
				"body": "=w=",
				"added": 1567695703
			}
		],
		"1565777168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 13,
				"body": "hmm I probably should, gonna do it rn~",
				"added": 1565778953
			}
		],
		"1565784755_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 14,
				"body": "41.5 MB It depends on what topic you've loaded, so if you're new don't be surprised its small.",
				"added": 1565787404
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_295_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What do you mean by \"what topic you've loaded\"? [...]\n\nZeroNet only download the things you request to see. It only download the title, content and comments are reserved only when you open the thread I believe.",
				"added": 1565965704
			},
			{
				"comment_id": 18,
				"body": "> [gitcenter](#comment_581_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Uh... no. This feature should be supported by the site, and ZeroTalk doesn't support it. So it downloads all ZeroTalk files.\n\nhmm i see, then it's really weird :x",
				"added": 1565965991
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 16,
				"body": "hmm i wonder if 223556 entertainment is watching peeps argue about controversial issues xd",
				"added": 1565880964
			}
		],
		"1566080751_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": [
			{
				"comment_id": 19,
				"body": "Omg this zite is over 80MB welp xd",
				"added": 1566099319
			}
		],
		"1566291581_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 20,
				"body": "> [xcape2net](#comment_340_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The only thing that has changed is that instead of mindless factory drones, they now want mindless office worker drones.  Rich people's kids are taught how to think, and poor people's kids are taught how not to think.\n\nThe fact that they're seperated is a problelm all to itself, theres isnt a chance to understand the social status gap and therefore even mroe discrimination :x",
				"added": 1566301744
			},
			{
				"comment_id": 21,
				"body": "> [90w8fuiosrhui](#comment_12_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F): Kids get programmed in school to become a robot as an adult. I honestly think school is intentionally made boring because your future job will most likely be boring too.\n\nYep its a fact, sadly the talent gap (aka what job expect you to have vs what you're capable of) is getting larger while our education system is doing nothing about it...",
				"added": 1566301830
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 22,
				"body": "> [trevorlaneray](#comment_99_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): I'm doing fine.A bit stressed out, since my work has me scheduled for <20h this week.Being the sole source of income for my household (supporting disabled parents), filial obligation has me on edge.Doing my best to avoid existential crisis; spending my days pouring hours into video games and tinkering with ZeroNet.\n\nhmm why does your circumstances seems familiar, are you someone that goes with the name that starts with \"G\" for in game name? :3",
				"added": 1566386394
			},
			{
				"comment_id": 23,
				"body": "hmm had my mom bust into my room at 7:00 for no particular reason while I was expecting a nice long snooze this morning, could've been better. How bout you~?",
				"added": 1566386467
			},
			{
				"comment_id": 25,
				"body": "> [trevorlaneray](#comment_100_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Mmm, none of my ingame names start with G. I almost always just go by my main handle, same as here.\n\nOh, nvm it then, still hope you're not too stress out.",
				"added": 1566387461
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 27,
				"body": "> [opisafag](#comment_8_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2): I meant topics with correct answer as in things like elementary school math. If there are valid opposing viewpoints, then there isn't a single correct answer.\n\n> [znnex](#comment_47_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): I disagree with most of this. Do all conversations have to take place on Reddit? The OP already mentions connecting with other services.What's the difference between a post with 10 points vs....\n\nWell Since there's no 'referee' or authority figure there to make the judgement about which is the right and which is the wrong, the best thing we can rely upon is the collective knowledge of the people who's participating in the conversation (aka peer review kind of sorting). Which indeed have it's down side for not being totally accurate but I think it's the best given the situation, the thing I'm worried about that since there'll be allowing for anonymous posting, people can make bots that down play (voting down) other's ideas. This shouldn't be too much of a prevalent problem but could cause a lot of confusion in some certain moments.\n\n> + Per-subreddit settings:\n>  * Allow users to post anonymously;\n>  * Require user certificate.",
				"added": 1566741185
			},
			{
				"comment_id": 28,
				"body": ">* Image upload, file upload;\n>  * Global settings:\n>  * Automatically download all files from subreddits I visit (this can download illegal content);\n>  * Show thumbnails of images;\n>  * Hide thumbnails of images (they are still downloaded).\n\nMaybe adding the feature like ZeroMe where you only cast a request to download the file when needed, and have a quick delete button near by? ZeroMe doesn't have a cancel function tho @nofish when you click **show this image** you can only delete when it's completed the download if you change ur mind, is there a fix for that?",
				"added": 1566743040
			},
			{
				"comment_id": 33,
				"body": "> [gitcenter](#comment_768_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): No, you'll only be able to post anonymously, there'll be no way to vote anonymously.\n\nThat's nice to hear, it'd solve a handful of bot issue :)\n\n> [gitcenter](#comment_775_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroVoat has another issue: the clusters aren't per-subreddit....\n\nA cluster per sub-reddit does sound promising, but what about other people creating more sub-reddits? Does that mean a new cluster got generate too? I don't think you can do that locally (on the creator's machine) right?",
				"added": 1566822611
			},
			{
				"comment_id": 36,
				"body": "> [znnex](#comment_72_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): I want it!Too bad it has to be made first and getting people to use it may be easier said than done.\n\nBest way is to get nofish to set it as a default site on ZeroHello, but doesn't seem to be happening anytime soon :x\n\n\nIs there a criticia that we're all missing? o.O\n> [gitcenter](#comment_805_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): As well as Git Center, ZeroVoat, Millchan, KaffieID, KxoID and other sites should be. But they aren't listed, ask nofish why. [...]",
				"added": 1567221466
			},
			{
				"comment_id": 43,
				"body": "> [znnex](#comment_79_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): I don't think nofish can do that. The main problem is that the described zite doesn't exist. We have to wait until gitcenter makes it, I guess. If that happens :P\n\nnah, i know the reddit one havent starting to get made, was talking about the other zites that gitcenter listed xD",
				"added": 1567350822
			},
			{
				"comment_id": 49,
				"body": "bump? >.>",
				"added": 1567569428
			},
			{
				"comment_id": 56,
				"body": "well the ideas are here but still need implementation :x",
				"added": 1567695293
			},
			{
				"comment_id": 66,
				"body": "> [toyata](#comment_103_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1):  easy skimming through and removing any unwanted of such content at the same time.\n\nmaybe an automated process that delete read threads to save space when some user assigned limit reached while surfing? Unless user specified the data to be held and seed",
				"added": 1567752369
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 29,
				"body": "> [znnex](#comment_42_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Mute is my favorite feature of ZeroNet <3\n\nhaha, best comment I've ever seen all day :D",
				"added": 1566743150
			},
			{
				"comment_id": 30,
				"body": "> [eyeballgummy](#comment_6_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): God does exist, but only to those who believe in him! Most Christians are weak and have been kind and empathtic, without being vigilant. And those weak Christians is why our culture is now under an invasion....\n\nhmm if god is real, why haven't we ban people from praying and getting exam's answer from him? doesn't he suppose to be a know all sky daddy? :3\n\nHell, why not ask him for a cure for cancer, seems like it kills quite **a lot** of children every year :x",
				"added": 1566743289
			}
		],
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 31,
				"body": "> [numismatist](#comment_66_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): I found some extra special berries out on a mountain with my lovely wife.\n\nOohh good time indeed :D",
				"added": 1566746158
			},
			{
				"comment_id": 32,
				"body": "Finding random people and talk about random stuff is the most relaxing thing I've done today, and yes I need more exercises.... >x<",
				"added": 1566746289
			},
			{
				"comment_id": 34,
				"body": "> [myriri](#comment_52_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn): I am not happy.\n\naww why?",
				"added": 1566901759
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 37,
				"body": "This is what I was looking for... like how can you access http://127.0.0.1:43110/Name.Yo when you dont have the plugin xD",
				"added": 1567222228
			},
			{
				"comment_id": 44,
				"body": "uhh gitcenter, i think i've encountered a problem with Name.Yo plugin, can't open any zites when I have it installed, have to track down the folder and manually remove it so everything goes back to normal.",
				"added": 1567350929
			},
			{
				"comment_id": 45,
				"body": "> [gitcenter](#comment_913_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Do you mean that you can't open any sites at all or new sites only?\n\nEverysites, except for ZeroHello, even .bit and .yo are affected. I should've copied the error that appeared on screen...\n\n> *ver 0.7.0 (rev4169)* \n\nnow when I try to intall again to recreate the problem, It said im outdated :(",
				"added": 1567385597
			},
			{
				"comment_id": 46,
				"body": "> [ratsmack](#comment_53_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Don't bother asking him about versions and/or rev's required for Name.YO, because he won't tell you. [...]\n\ncause its the obvious question to ask :d \ntheres no expectation that it will break even in the latest version, chill dude xD\nyou should've said something like \"I have the latest version and It also didnt work\"\n \nwhich fyi, gitcenter, that's my problem too",
				"added": 1567416382
			},
			{
				"comment_id": 47,
				"body": "> [gitcenter](#comment_922_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm, you said it told you that you were outdated. Does it still break ZeroNet after updating ZeroNet and reinstalling Name.YO?\n\nSo I've fixed the bug but here's what I think happened \n   -  I didn't properly shut down 0net ([gitcenter](#comment_939_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):) so the same error appeared\n   - Deleted the plugin folder manually  data\\__plugins__\\1NAMEz7stUPZErkV1d3yLkVWQFa4PTqDNv in order to access zites again.\n   - The site still sees that I installed name.yo when I try reinstalling, so I have to recover It from my recycle bin to update or else I wont see it in http://127.0.0.1:43110/Plugins",
				"added": 1567563403
			},
			{
				"comment_id": 50,
				"body": "> [gitcenter](#comment_951_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I've released a new version, so you can try this: [...]\n\nyep I did exactly that :)\n\nbut if someone who can't restore the plugin if they manually deleted it, that's gonna be a problem. Maybe a way to hard-reinstall on Name.yo zite?",
				"added": 1567651013
			}
		],
		"1567541468_1FgxurbLKzsfP2arYX7xVG4akjCdMs3uEQ": [
			{
				"comment_id": 48,
				"body": "I can't hande the cringeness of this feed xDDDD",
				"added": 1567564043
			}
		],
		"1567569304_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": [
			{
				"comment_id": 51,
				"body": "> [bigbadbob](#comment_562_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): http://127.0.0.1:43110/Statsthis is the best thing i know of...not sure if it will help.   umm.  I assume you have duende on a blocklist?He likes your post :) just incase you can't see it.\n\nduende ? o.O i believe by block list is empty ... *cough* except for bitcoin zites... *cough*",
				"added": 1567651115
			},
			{
				"comment_id": 52,
				"body": "> [redlibertyreal](#comment_66_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw): I would recommend Whonix instead of just Tor Browser. They provide documentation on their Wiki for setting it up (https://www.whonix.org/wiki/ZeroNet) [...]\n\n> [pexo](#comment_147_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): uMatrix is really good for checking, if you are on the Tor Brwoser, then it is better too stick with only the addons/extensions that come by default [...]\n\n> [caryoscelus](#comment_227_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): As others said, OP question was mostly about a way to check, not a way to stay anonymous ;) [...]\n\n> [gitcenter](#comment_952_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Using Tor Browser for ZeroNet (not Tor mode) is the only way to prevent zites from accessing Clearnet\n\nThanks! so the short answer is you will still need a third party program/plugin to check/block connections to clearnet then. Thats kinda clumber some tbh xd.",
				"added": 1567652079
			},
			{
				"comment_id": 67,
				"body": "\nNeed more space :x nofish!!! ",
				"added": 1567752460
			}
		],
		"1567536043_15yACUjRkanC9AeFyo7RQSBiZLWmmNvddW": [
			{
				"comment_id": 53,
				"body": "> [duck0](#comment_146_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Better than I ever have. Decent work. Making money. Fixing up an older truck. Can't complain too much.\n\nsounds like great progress have been made, wish you the best op !\nfor me im chilling, about to get busy in the up coming months >:3",
				"added": 1567653189
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 55,
				"body": "Hmm so you want an internet that yells, \"hooray im rich and dumb!\" rather than \"fak it let's try something new!\"?\n*insert thinking meme*",
				"added": 1567681670
			}
		],
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 57,
				"body": "> [dude](#comment_19_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): check https://pathephone.github.io/ - uses IPFS, so pretty much distributed.\n\nHow long do I have to keep it running to download the libraries?\no.O",
				"added": 1567695655
			}
		],
		"1567696867_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK": [
			{
				"comment_id": 59,
				"body": "> [phitafil](#comment_2_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK): No. I still have a lot of space on my hard drives. Funnily enough, checking in the files tab, it seems that ZeroNet barely downloaded any optional files. Makes no sense to me why it's struggling to operate with the zites unpaused. I was only connected to roughly 1000 peers as well. Nothing out of the ordinary for ZeroNet usage.\n\nmaybe start again from a new install? \ncopy the users.json from data/ to the new install and you're good to go",
				"added": 1567697397
			},
			{
				"comment_id": 60,
				"body": "> [phitafil](#comment_3_1GGZUdrWYgPgvqiA1mo4TxHFKvCw4g99rK):  \n\nhope it works :3",
				"added": 1567697754
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 68,
				"body": "Okay... so you're saying we should elimitate gate keepers, and let the flood of mis-information rush right through our puny primate brains and wala, killin people for fun is now the thing guys~!",
				"added": 1574063269
			}
		]
	},
	"comment_vote": {
		"534_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"2_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"542_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"37_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"15_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"8_1GCX671SdfGDqwXhgjySi8RRALoB4vwHCD": 1,
		"762_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"42_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"768_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"775_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"5_1DV5mvcvwtjyRiQpuNuXv9hwdYj27C3oob": 1,
		"929_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"560_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"951_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"582_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"44_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"198_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	}
}