{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "以暴易暴：中共也许真的会改良",
			"body": "昨天看到一个说法，引发了我的深思，连做梦都梦到这件事情。\n\n有人提议，海外的反共力量武装起来，全球追杀中共高官的海外亲眷；有人还说督促大富翁郭文贵把他的钱投到这个方面。\n\n他们的目的是为了报复中共，为遭受中共迫害的人出一口气。\n\n我仔细思量之后认为，如果真有人着手做这样一件事，那绝非是出气那么简单，很可能带来中国和平民主化的契机。\n\n现状：中共高官联合窃国，搜刮民脂民膏所得的财富转移海外，亲眷尽数移民。\n\n中共高官个个急功近利，都只盯着经济效益，大肆破坏环境。他们之所以这么做，是因为他们不爱这片土地，他们所关心的人都在外国，而且他们自己也计划退休后移居外国，这里只是他们捞钱的地方。他们只是在这里捞钱，为了自己的亲眷和自己的将来捞钱。为了捞到钱，他们不惜杀鸡取卵。所以他们捞钱的同时，不断地祸害这片土地。\n\n假如存在一股武装力量，不问是非，只看身份，专杀中共高官的海外亲眷，那情况就有所不同。\n\n那绝不会是中共高官海外亲眷的灭顶之灾，他们不会被杀光，甚至可能只死掉几个或十几个人，但是，所有的亲眷都会被吓回国内，不敢踏出国门半步。\n\n从此，中共高官全家和中国百姓一起共享有毒空气、污染水源、洗脑教育……纵有特供也少有改善。\n\n那么，执政者也许就会顾惜这片土地，为将来考虑，不再杀鸡取卵……曾经的权贵，出于年龄等因素即将失去权柄之时，或许会考虑一下自己的子孙将来的处境，将中国往民主的方向推上一把……\n\n如果那样的话，中共政权无需垮掉，中国也有可能慢慢转型成为民主国家。\n\n唯一的问题是，假设中共高官海外亲眷刺杀团成立，他们的刺杀目标却是无辜者，杀掉无辜的人可不容易，他们会成为罪人，会遭受来自民主世界的谴责和严惩，他们做的事不能给自己带来荣耀，谁愿意做这样的事呢？",
			"added": 1521794740,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "手贱，点了屏蔽自己，大虾教的解封方法",
			"body": "原帖在  http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:3_1KzVbVbRqbSxr3VDCU2VbeAqhMUrL1EnRZ/\n\ngut412454 ━ 在 May 04, 2018   回复 ⋮\n在hello页面，点左栏的右上角的三个点，有目录中有一个管理已屏蔽用户。",
			"added": 1526350481,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "无法翻墙了",
			"body": "打倒共产党！！！",
			"added": 1559786226,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "越来越确信武汉肺炎新冠病毒是中共的生化武器，怀疑是和朝鲜共同开发的",
			"body": "截至1月底，美国已有3家不同的科研机构在新冠病毒DNA中找到不可思议的片段，这些科研机构相互之间并没有沟通和交流，分别发现了高度类似艾滋病、埃博拉等著名病毒的片段。生物学家表示，对于每家科研机构发现的片段，由萨斯病毒或其它冠状病毒自然变异而来的概率都是几百万亿分之一，已发现的3种奇特片段一起自然变异而成所需时间长于宇宙寿命。所以高度怀疑新冠是人工合成的病毒。再加上美国在为数不多的临床案例中使用原本为埃博拉研制的药物效果很好，还有传闻中国染病高官使用了艾滋病的药物也痊愈了，这些事实和传闻也佐证了有人将艾滋病毒和埃博拉病毒的片段插入了萨斯病毒这种猜想。\n武汉在2018年完成了法国援建的P4病毒实验室，之后迅速克隆了十几个病毒实验室，那些山寨版病毒实验室表面上看来和法国援建的病毒实验室差不多，细节上却差之毫厘失之千里，发生病毒泄漏也算是中国特色不难理解。\n以上证据已经很能让人相信新冠病毒是中共的生化武器泄露了。\n为什么会怀疑是和朝鲜共同开发的呢？因为朝鲜的表现过于奇特。首先是在其它国家仅发生1-2例确诊的时候朝鲜就发生6例确诊，中国人同朝鲜的旅游互动远远比不上东南亚旅游国家。然后是朝鲜在1月20日中国人都不知道有武汉肺炎的时候就宣布关闭国界，这个动作比其他国家最早关闭国界的美国早了十多天。朝鲜对中国经济毫无贡献，他们的国界仅用于接受中国的援助，他们主动关闭国界就是拒绝接受中国的免费物资，对他们的损失很大，然而他们却在中共尚在隐瞒疫情，还在大力辟谣，还没宣布病毒可以人传人的时候就早早地关闭了国界，只能说明他们对病毒的厉害程度知根知底。考虑到中共毫无必要在隐瞒中国人、隐瞒美国、隐瞒世卫组织的同时单独告知朝鲜实情，所以只能怀疑朝鲜是和中共一起搞生化武器的",
			"added": 1582100921,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "在朋友圈转发美国流感的都是弱智，这里是真相",
			"body": "一月下旬，武汉肺炎刚被中共官方不得不证实，中共外交部立刻就抛出一个烟幕弹，说美国爆发最致命流感，已经死亡6600人。\n意图自然是让大家去关注美国已经死亡数千人的大瘟疫，别来管中国当时官方公布仅死亡几十人的武汉肺炎小kiss了。\n果然有很多人中招，微信群里，朋友圈里转的到处都是美国流感，相比之下，关注武汉肺炎的人就少了很多。\n\n事实上美国真的有流感？真的死了那么多人了吗？\n答案是真的。\n这次中共没有编造数据，他们引用的完全是美国自己公布的数据，美国流感当时的确死了那么多人。\n而且，到了2月下旬，美国公布的因流感死亡人数已经接近2万人。\n天哪，美国这么惨！美国恐慌了吗？美国封城了吗？世卫组织宣布美国为疫区了吗？没有！\n\n为什么中国疫情死几十个人就被宣布为疫区，美国疫情死几万人都不是疫区，难道世卫组织真的是由美国把持的吗？\n错了！世卫组织不是由美国把持的，而是由中国把持的。\n\n如果世卫组织是由美国把持的，那么至少在1月初，中国就会被宣布为疫区，中国也不会发展到疫情失控，最后闹得全国封城。\n因为武汉肺炎，是11月中旬就发作出来的，12月初，中国专家在权威医学杂志英国《柳叶刀》上发论文讨论了这种病，论文里面提到了四十多个病例。后来这个发表论文的中国专家自己也染病了的。如果世卫组织不是受贿帮中共一起隐瞒疫情，那么武汉肺炎不会扩散得这么厉害。\n\n那么为啥美国那么大的流感疫情都不恐慌呢？原因是中共从来都不会对人民说实话。\n美国这次死了那么多人，他们说了。\n可是中共没说的是美国每年因流感死亡的人数都是两三万人，年年如此，今年并无特殊之处。\n部分的真相等同于谎言！中共深谙此道，忽悠得一大群脑残团团转。\n\n为了避免大家仅触及部分真相，我们把美国流感的这个问题彻底说清楚。\n\n美国流感死那么多人真的没事吗？当然没事，完全正常。\n\n相比美国每年因流感死亡人数两三万人，中国每年因流感仅死亡十个人左右。不是说中国人不得流感，而是两个国家的统计方法不同。\n\n流感病毒本身并不致命，但是患上流感会让人免疫力下降，如果患者本身还携带其它疾病，那些疾病就会因此发作出来，要了人命。\n\n美国的统计方法是，不管病人因为什么原因死亡，只要被确诊携带了流感病毒，都统计成因流感死亡。可是中国死于什么病就统计成什么病，流感病毒不致命所以几乎没有人因流感死亡，只有实在找不出死因又患有流感的才算成流感死亡。\n\n有人曾经测算过，如果把美国的统计方法应用到中国，那么中国每年因流感死亡的人数会达到9万，并且超过80%的人是65岁以上的老人。\n\n9万啊!?是不是很吓人？一点也不吓人。\n\n美国人口3亿多，每年因流感死亡人数 两三万，死亡率不足千分之一。中国人口十多亿，每年因流感死亡人数9万，死亡率不足千分之一。看出问题了吗？\n\n再看另一个死亡率。\n\n假设中国人的平均寿命70岁，那么每年就有 1/70 的人自然老死。美国人的平均年龄80岁，每年就有 1/80 的人自然老死。\n相对于 1/70 - 1/80 的自然死亡率，流感造成的不到 1/1000 的死亡率算什么？\n再加上死于流感的超过80%的人是65岁以上的老人这一因素，根本就可以认为流感就是自然减员的因素之一。\n\n中共这次抛出美国流感来和武汉肺炎做比较，简直就是一个笑话",
			"added": 1582183708,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "这段时间出什么事了，共匪为何加高墙了？",
			"body": "2020年6月15日开始，怎么也翻不了墙。\n新闻联播里中国的形势一片大好，除了北京疫情加剧。\n北朝鲜不断闹腾，小流氓别出心裁刷存在感。\n美国依然做什么都是错。\n台湾国民进党仍然不断推出各种政策导致民怨沸腾。\n欧洲各国还是不断颂扬伟光正。\n可是我们翻不了墙，不知真相。\n这段时间到底发生了什么？\n共匪到底要隐瞒什么？",
			"added": 1592380837,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "HK国安法",
			"body": "大家对国安法把香港变成臭港，让香港失去独立关税区地位有何看法？",
			"added": 1593575152,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 49,
	"comment": {
		"3_1DmGsXFPPexxcuTRgYZxDRHqGA7CbR3j14": [
			{
				"comment_id": 1,
				"body": "这应该属于概率问题。你看看你身边，几乎所有人玩手机游戏都没花过钱，为什么游戏公司还要乐此不疲地开发游戏给他们玩？那是因为大数据统计结果表明，存在着一定的比例，每一千个玩家中总会有那么3-5个人会掏钱买道具。所以游戏厂商不怕绝大多数人免费享用他们的劳动成果，拼命把自己的产品做好做精致，拼命地推广自己的游戏，拼命地做大用户群，然后就等着挣他们用户群中那3-5‰的人的钱。那些人花掉的钱的总数，足够养活游戏公司。同样的，大数据统计表明，存在着一个概率，就有那么一些人，看过影片之后就会设法照着影片里面做一下。面对成年人的侵犯，儿童是毫无逃避的可能性的，只能眼睁睁地受害。即便这种人的比例不大，甚至少得和愿意花钱玩游戏的人一样，如果儿童色情不加以控制，做大了观众的基数，那么那些侵害儿童的人的总量也足以毁掉这个国家的大多数儿童。幼年就受害的人，长大后心理不变态的情况确实不多。大量的儿童受害，就代表这个国家没有未来。所以即使在允许色情产业的文明国家，儿童色情都是必须严禁的。",
				"added": 1518599563
			}
		],
		"1_17yRitg3BzogUsUPa77AodAdappawzVqAE": [
			{
				"comment_id": 2,
				"body": "> [tim0net](#comment_25_1FzBvZNWDYzZ94e4UzvYDrnqB9TsfonS6v): 我对GFW反感,有的人却对它不反感\"全世界70亿人各取所需，能给出70亿种“正能量”的定义\"中国14亿人也能有各种反感/不反感的理由,所以\"如果政府的审查让人民反感，只能说明这个政府的存在是非正义的。\"是不存在确定的,因为有各种不同的定义.\n\n你提出的这个并不能成其为问题。\n\n事实上是这样的：如果你反感它你就希望它被推翻；如果你不反感它你就不会希望它被推翻；如果你的反感度较低觉得还能忍受，你就不会自己付出行动去推翻它，仅仅是乐于看到别人动手推翻它；如果你的反感度居中，你不会自己发动对它的攻击，但只要有人领头你一定会加入反抗队伍；如果你的反感度较高觉得不能忍受你就会自己付出行动去推翻它而不管别人的态度；反过来也一样，如果你喜欢它你就希望它得到保护；如果喜欢程度较低你就不会付出行动去保护它；如果特别喜欢你就会不惜代价代价去保护它。每个人都有这样的选择权。\n\n所以14亿种态度根本不是问题，问题是持各类态度的人的数量占比。\n\n如果强烈反感的人的人达到一定比例，就会带动普通反感度的人揭竿起义，他们还能通过蛊惑轻微反感的人并收买无所谓反感或喜欢的人来壮大队伍；同时，强烈喜欢的人也会带动普通喜欢的人蛊惑轻微喜欢的人并收买无所谓喜欢或反感的人来镇压起义。\n\n当这两股力量对消完毕之后，哪一方还有剩余力量哪一方就赢了。中国历史上的王朝更迭就是这样发生的。\n\n所以保障“正义”不过是保障大多数人的理想而已。当然，这个“理想”或“愿望”本身也不一定是正义的。",
				"added": 1519272618
			},
			{
				"comment_id": 3,
				"body": "> [leaflet](#comment_78_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT): 并没有“各取所需”好吗各取所需是喜欢GFW的用GFW，不喜欢的不用GFW强迫用GFW，哪里谈得上各取所需 [...]\n\n就是各取所需！有人需要自己用GFW，别人用不用无所谓；有人需要自己用GFW，别人也用GFW；有人需要自己不用GFW，别人用不用无所谓；有人需要自己不用GFW，别人也不用GFW；有人需要自己不用GFW，但别人必须用GFW……需求有各种各样，但是各人的需求是否取得到就看各人的本事……",
				"added": 1519281504
			}
		],
		"1_19RUZHcaNj247EGGxFXopJyaLwvcMPsYLZ": [
			{
				"comment_id": 4,
				"body": "建议不发帖指责别人，而是把自己看不顺眼的人全部屏蔽掉，那么不就只剩下不歪的楼了吗？",
				"added": 1519281925
			}
		],
		"1_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm": [
			{
				"comment_id": 5,
				"body": "> [borber](#comment_19_12hoUNhQQKj1qtjbqNt6JWpVBjWNok7k2c): 确实 我也觉得未来网络就是去中心化\n\n去中心化网络有一个很恐怖的前景，就是《魔鬼终结者》系列电影里将会毁灭人类的“天网”。人工智能一旦依托于去中心化网络存在，人类对它将无法制约。作为人类本不该发展这种东西的，可是各个独裁政权建造的墙逼迫着不屈的人们去不断探索各种有可能击败墙的技术。却导致了一种可能性，人们击败了墙的同时也击败了人类对付人工智能的防线。也许将来人类真的会因“天网”而毁灭，那就全是独裁者的罪过了。",
				"added": 1519811462
			}
		],
		"104_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 6,
				"body": "不同意楼主的看法。\n\n我认为取消任期限制就是为了称帝，而且称帝会给“保障共匪永久压迫人民”这个目标带来负面影响。\n\n邓挫子在毛腊肉的体制上稍作修正改出来的这个体制能够很好地保证共匪对人民的压迫，这个现行体制在相当大的程度上保证了共匪的内部的团结，形成共同力量，一致压迫人民。从某一个角度来说，邓矬子理论中甚至隐约可见到民主的影子，只不过是局限于统治阶层内部的小范围的民主，或称“精英民主”。\n\n然而包子为了个人一己之私，为了满足个人的权利欲望，破坏了统治集团内部的潜规则，一再突破陈云等共魔元老领受了血的教训之后设置的各种底线，对统治集团内部的红二代红三代等不遗余力地下死手，为了保障自己的地位不择手段。这样做导致了统治集团内部的团结和民主荡然无存，非当权者不再能够为统治集团贡献力量，使得体制由集团独裁变为个人独裁。\n\n所谓3个臭皮匠顶个诸葛亮，尽管两种独裁方式老百姓都无法参与政治，但是“精英民主”独裁集团产生的各种政策肯定大大优于初中生个人脑袋瓜里想出的各种政策。所以包子称帝后，相对于前30年来说，百姓的苦难肯定是大大增加的。",
				"added": 1520222465
			}
		],
		"6_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 7,
				"body": "谢谢",
				"added": 1520331464
			}
		],
		"3_1DXSGj6Fq7SuptyLTYGBpMpKRijL7Wf2kH": [
			{
				"comment_id": 8,
				"body": "可是远在3月1日，你那里刚刚通过的宪法就已经印刷完毕。并且在你那里进行表决之前的两个小时就在书店上架完毕正式开卖。对于这种有时间科技支持的强势集团，你能有啥办法？",
				"added": 1521509882
			}
		],
		"155_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 9,
				"body": "你还不如去要求猪自己抹脖子，然后自己烧开水烫自己的毛，自己把身上刮干净，再自己跳上你的案板……在做这些之前最好先帮你把刀磨快了，好让你给它分尸的时候少费点力。",
				"added": 1521510252
			},
			{
				"comment_id": 13,
				"body": "> [longzaowuzhu](#comment_298_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU): 多读历史，怨气才不会这么重。在政治上死的人，太多太多。别没事想不开，中国历史中，每一次起义都因为民不聊生。如果不是当初国民党和日本人给共产党创造机会，共产党估计也没戏。时局不利于激进的改革派，真的还不如安心写书，做好启蒙。多分享反洗脑好看的书籍。说真的我们到死也不一定等到那个机会，经济没有不利于独裁者，党内没有出现斗争，何必为难自己。民主国家帮不了中国，如果共产党一直强大，任何改变都不会有戏。最终大部分革命者都会像历史中的书一样，慢慢烟消云散。\n\n川普是个好总统，支持民主台湾，支持正义，正在积极给中共制造麻烦。如果老百姓能以此为契机，采取正确的方法，未必不会令中共的末日早些来临。",
				"added": 1521600802
			}
		],
		"10_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 10,
				"body": "白眼万岁！",
				"added": 1521510362
			},
			{
				"comment_id": 11,
				"body": "> [qinaa](#comment_3_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7): 包子登基尽然被两个女人抢尽风头，CCAV的记者，编辑，导播估计要被犯下重大政治错误而扫地出门。估计这个翻白眼的女人也没好果子吃。\n\n蓝红两女当场就被吊销了记者证（不明白遭人白眼的红女在此事件中自己无过为何也要被罚，虽说怎么样对她都不冤，不过这种处理问题的方法实在难以服众）。\n\n后来听说蓝女被单位开除（不过因为成了网红，影响力大增，愿意请她的单位多得很所以不担心工作问题）。",
				"added": 1521510806
			}
		],
		"6_145kg9WZryLeefr2FuGERptM7frEf7ySGH": [
			{
				"comment_id": 12,
				"body": "zeronet可以在vps上正常工作。但你不可以这样做。因为中国运营商对客户的数据是全知的，他们会把你的详细资料交给公安，然后你危险了。",
				"added": 1521598447
			}
		],
		"1_1DonHALGF9orFFoZ4cZiBHAx4Rgogojryx": [
			{
				"comment_id": 25,
				"body": "> [beidou](#comment_26_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2): 禁止搜狗输入法联网，怎么做？\n\n卸载掉搜狗输入法，它还怎么联网？谷歌输入法多好的，为啥要用搜狗。谷歌输入法想联网也是连接谷歌网络，那个GFW已经帮你封掉了，绝对连不上去。",
				"added": 1524900889
			}
		],
		"45_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 15,
				"body": "从“人民劣根性”入手解释中国政治不民主的人，请你们先看看台湾再说话吧！",
				"added": 1521797192
			}
		],
		"164_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 16,
				"body": "用来跑背景程序，跑政府规定国产手机必装的监控程序，让政府监控你的过程更为流畅。",
				"added": 1522048800
			}
		],
		"4_1CQAzBixetRWrEto8hLKTKcA7oCDBuNdu8": [
			{
				"comment_id": 17,
				"body": "好文章！",
				"added": 1524020679
			},
			{
				"comment_id": 18,
				"body": "> [aa00](#comment_1_14z9GwDksv6SnmR4EUnPFxFt8uTLiKfJS1): 利益的争夺罢了，把美帝吹成了天使，隔夜饭要吐出来了。懒得打字，转一篇别人的吧 [...]\n\n既然你认为美帝不是天使，沙俄不是魔鬼，那么你移民的目的地为啥是美国而不是俄国？\n你可能会说你根本没有移民的想法。\n那么也请你解释一下为什么中国主席习近平他女儿习明泽要选择成为美国人效忠美国，而不是选择成为俄国人效忠俄国？还有中国副主席王岐山一个大家族都在美国而不在俄国？",
				"added": 1524021242
			}
		],
		"1_1LPwskc6x2vRcWJquMzghZVdD2V823g9Tw": [
			{
				"comment_id": 19,
				"body": "我看你就是个五毛，混淆视听。\n习包子是 “取消连任限制”，使得自己可以无限连任下去，不是你乱说的“取消连任”\n\n网友们要擦亮眼睛，分辨五毛。",
				"added": 1524022361
			}
		],
		"12_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 20,
				"body": "> [7jk6646lkb0u46vf](#comment_1_1CQAzBixetRWrEto8hLKTKcA7oCDBuNdu8): 我南方电信，下载官网的软件一定要翻墙才能用这软件更新数据，如果这样的话，这软件没什么用了，\n\n不会啊，大天朝局域网内只要有少部分人翻墙了，多数人不用翻墙也能得到更新，所以你不喜欢的话可以不翻墙，等着享用别人翻墙的好处也行的。\n\n哪怕翻墙的人只有一个，在足够长的时间之后，墙外节点的内容也会出现你的电脑上，只要你有耐心等待并不断刷新",
				"added": 1524455187
			}
		],
		"217_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 21,
				"body": "> [mrc](#comment_130_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 后来看到她曾公派出国学习的消息，才明白为何她能走到与赵对立这一步来。\n\n中共不公派人员出国学习就属于闭关锁国，永远落后。\n中共只派无脑子的人出国学习跟不派人出国学习一个样。\n中共如果派遣有脑子的人出国学习就是自己找死。\n结论：中共要么落后要么死。",
				"added": 1524899353
			}
		],
		"223_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 22,
				"body": "捧楼主场，已前往投票。",
				"added": 1524899808
			}
		],
		"219_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 23,
				"body": "党内高官的子女也难保没有正义感的。万一碰到一个正义感爆棚的人，受到普世价值感召，又继承了祖辈的革命基因，又因为父母是高官的原因比较轻易地搞到各种资源。那共产党不就死得更快了？我看不如禁止所有人出国留学稳妥些。",
				"added": 1524900338
			}
		],
		"218_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 24,
				"body": "签名能打倒共产党的话，共产党早就倒台70亿次了。相反，签名只能让反共的人暴露，便于共产党抓捕。",
				"added": 1524900676
			}
		],
		"236_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 31,
				"body": "中国最大的问题还是共产党的邪恶统治，不解决这个核心问题，其他的努力都是白费。解决这个问题的捷径是反抗组织集中全部人力财力专一行刺中共高官。当然在处于邪恶统治下的国家行刺统治者是困难极大的。由于共产党特别邪恶，邪恶到了高官纷纷把家人送去民主国家，自己在国内掠夺。在这种特殊情况下可以用绑架勒索撕票中共高官的海外亲属这种比较容易的方法来代替刺杀中共高官这种极为困难的方法，达到曲线监督独裁政权的目的。",
				"added": 1525232350
			},
			{
				"comment_id": 33,
				"body": "> [360breakingwall](#comment_205_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV): 共产党在全世界都失去了市场，在中国能够风生水起，只能说是中国人的德性使然，无法产生自发秩序，只能接受外来统治。\n\n非也非也。共产党在全世界都失去了市场，在中国能够风生水起，并不能说明是中国人的德性使然，只能说明中共尤其邪恶。\n\n在共产党倒闭了的其它国家，他们的共产党都不如中共邪恶。\n\n然而中共并不是最邪恶的，最邪恶的是北朝鲜共产党，时至今日北朝鲜还有饿死的人就是明证。\n\n我知道你想说北朝鲜人的德性使然，无法产生自发秩序，只能接受外来统治。可是看看南朝鲜吧，地盘比北朝鲜小，人口比北朝鲜多两倍都不止，很多人和北朝鲜人是亲兄弟亲骨肉，拥有同一个父亲或同一个祖父。\n\n南朝鲜人为什么不像北朝鲜人那么德性使然，单独产生自发秩序，创建了一个世界排名属于第一梯队并且人民幸福的大韩民国？\n\n原因只有一个，两国政府不同。韩国政府首脑并非好人，个个总统退位都被清算，但是他们再坏也是人，是坚守人类底线的人。可北朝鲜政府首脑邪恶到丧失人性。\n\n两国人民并无差别，仅仅政府存在差别，造成了两个朝鲜天壤之别。\n\n中国和朝鲜一样，有台湾在那里作对照。在美国历年发布的人权报告里，台湾的民主指数高于美国，事实说明，中国人民并没有任何问题。中国的问题全在于政府。\n\n\n假如让中共去美国执政，在美国实行中国当前的政策，美国人民不论德性如何都只能沉默，受到不公只会下跪。假如让三胖去美国执政，美国人民同样会饿死。\n\n除了暴动和革命，人民永远不能同政府抗争。在和平状态下国家的一切问题都不能怪罪到人民头上，政府才是应该担责的。\n\n中共清楚地知道这些，他们很害怕人民认识到这一点，所以雇佣大量五毛们，拼命地宣传人民的劣根性，让中国人民自惭形秽，把本是政府的罪责，索源到自己身边人头上，不去责怪政府。\n\n若没有南韩和台湾做对照，中共这种卑鄙邪恶的策略真的会有效呢。",
				"added": 1525320260
			}
		],
		"505_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 32,
				"body": "萨格尔王大战维尼熊",
				"added": 1525249638
			}
		],
		"265_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 35,
				"body": "我是觉得为啥不用现成的比特币，非要自己辛辛苦苦开发一个出来？ ",
				"added": 1525662905
			}
		],
		"16_13H9eyCxTHQEtY1Jsq2nVyFLghqGcJSmGM": [
			{
				"comment_id": 36,
				"body": "零网人不活跃的难题怎么破？",
				"added": 1525922865
			}
		],
		"15_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 37,
				"body": "这篇文章说了这么多，一句话就能概括：中国人缺乏契约精神和维权意识。\n是共产党的独裁政权造成了这种现状，任何人休想在中国通过完全合法的途径挣到钱。\n除非打倒共产党，实现民主，才能还公正于大众。 ",
				"added": 1526350284
			}
		],
		"1_1Mqn1Xp52QURho5ASWVXTFmwza5eEyTLr7": [
			{
				"comment_id": 38,
				"body": "这种仁者见仁、智者见智的问题不需要得出共识，更没必要统一思想。\n谁要认为人性本善，就让他当天下人都是善人好了；\n认为人性本恶的家伙，就让他当天下人都是恶人也没什么问题。\n\n但是规章制度以及法律的制定就不同，性本善和性本恶根本上是两回事。\n\n【性本恶法律】基于人性本恶的思想制定的法律法规及制度，首先假设所有人都是恶的，把皇帝、法官、律师、原告、被告都当作是坏人来对待，认为这些角色中可能存在部分甚至全部都是恶人，这些恶人会不择手段地违反公平及公正的原则以谋求私利。于是在制定法律法规时，拼命地封堵一切可能被坏人利用的漏洞。\n美国法律就是这种性本恶法律。所有岗位上关键人物的权力都是受限的。\n比如刚刚发生的美国总统川普，为了和习主席搞好关系，公开指示商务部给中兴开绿灯、放中兴一马，结果国会议定川普总统的指示是违法的，维持了对中兴的制裁，坚决搞死中兴。因为美国法律早就防止了坏人被选成总统后对美国进行破坏。\n还比如美国的法官无权判决被告是否有罪，法官只能给被陪审团裁决有罪的人依法量刑。因为制定法律的人考虑到法官也可能是坏人，或者会被坏人收买，从而做出不公正的判决，所有把认定是否有罪的权力不交给法官，当然也不能交给法官以外的任何个人，应为所有人都可能是坏的，都可以被收买。美国把定罪权交给了公众，在公众中随机抽人组成陪审团，陪审团成员还要经过控辩双方的律师筛查，把可能对对方有利的人剔除。这种情况下，想要收买只能收买当地全体居民。\n所以性本恶法律能够维持国家政权稳定，人民安居乐业，至于是不是真正公平公正，那只有天知道了。\n\n【性本善法律】基于人性本善的思想制定的法律法规及制度，首先加假设绝大多数人都是善的，只有极少数的人在作奸犯科。更绝的是，法律的制定者假定皇帝、法官、司法机关、公诉律师的角色扮演者都是好的且不容置疑，其他角色中才可能有坏人。于是这种法律就给好人提供无限的权力，便于好人更加高效地打击坏人，以最快的速度实现最大程度的公正。\n中国法律就是这种性本善法律，所有的好人角色权力都是无限的。\n比如大好人习主席嫌宪法规定的主席任期太短，想当皇帝，就直接修改宪法，支持率100%。\n在穷人和富人打官司的案件中，好人法官可以收富人的钱，直接判穷人输掉官司。\n任何对习主席（习皇帝）和法官的行为表达了不赞成观点的，都是大恶人，必须动用举国之力坚决除掉以伸张正义……\n对这种法律的影响和评论请读者自己脑补。",
				"added": 1526875853
			}
		],
		"290_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 39,
				"body": "请把网站做成零网版本。",
				"added": 1527207086
			}
		],
		"296_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 40,
				"body": "去德国推翻独裁？德国现在还有独裁吗？",
				"added": 1529911870
			}
		],
		"97_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 41,
				"body": "> [zeronetimwulv](#comment_37_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ): youtube、Facebook、或者twitter看一看推送不就知道了。针对大陆IP定点推送反共\n\n这是睁着眼睛说瞎话啊！美国可是法制之地，如果 youtube、Facebook、或者twitter 等网站敢做针对大陆IP定点推送反共、暴动的宣传内容，根本无需封网，只要去美国法院起诉，他们会死得很惨。不敢和别人光明正大地打官司，只敢动用特权把别人一封了事的人，绝对是理亏的那一方。",
				"added": 1529913056
			}
		],
		"92_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 42,
				"body": "三战也许就是贸易战。",
				"added": 1529913569
			}
		],
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 43,
				"body": "一旦开放网络，真相就会进来，一旦得知真相，他就没法自信，为了能够自信，必须封锁网络。",
				"added": 1529913888
			}
		],
		"22_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 44,
				"body": "我不同意把中共对维族和藏族实施压迫看成是汉族对少数民族的压迫。中共就是一个邪教，并非所有汉人都是邪教成员。",
				"added": 1529914319
			}
		],
		"1_16cJi61bwoCCJAB6sYCYCvdHbdH8kM29aZ": [
			{
				"comment_id": 45,
				"body": "共匪想封都没法封的东西，西方各国更是没那技术封锁。\n可是儿童色情真的要不得，只能诅咒发儿童色情的家伙，他们家以后的儿童一定被色情！",
				"added": 1531292070
			}
		],
		"313_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 46,
				"body": "> [mrc](#comment_195_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 请问你认为他伟大在哪里？\n\n与邪共斗争，其乐无穷！",
				"added": 1533002551
			}
		],
		"5_14JRUax64emMFVVxN2ikjz5J74CjqoJtFr": [
			{
				"comment_id": 47,
				"body": "教大家屏蔽这位捣乱的仁兄：打开 ZeroID，点击“在数据库中搜索”，输入此仁兄的名字“yeahyi”，点击“Mute user”，就再也看不到这位仁兄的任何帖子了。",
				"added": 1554801290
			}
		],
		"1_19CAUZrhQtkzsCEUzWY8tK5RT3EnGheA6k": [
			{
				"comment_id": 48,
				"body": "tor",
				"added": 1554801419
			}
		]
	},
	"comment_vote": {}
}