{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1560110392,
			"title": "Torrent sites",
			"body": "I'm looking for a zeronet site to search torrents",
			"added": 1560110391
		},
		{
			"topic_id": 1564932941,
			"title": "A peaceful life is here if you choose it",
			"body": "Peace is readily available. conflict requires personal faults on both sides. if you fix yourself you become immune and invulnerable. \n\nThese are the explicit rules. Nothing you do can cause you to be stressed, its how you allow yourself to become attached that causes stress.\nhttp://www.the-ten-commandments.org/the-ten-commandments.html\nhttps://www.kingjamesbibleonline.org/Matthew-22-39/\n\nThe rest of the bible, upanishads and lau tsu's the way can flesh out and allow understanding of yourself and the world to set yourself free and bring happiness to yourself and those around you.\n\nThe truth of the world is unbelievably subtle.",
			"added": 1564932939
		},
		{
			"topic_id": 1565175754,
			"title": "Ideological subversion",
			"body": "If you pardon my conspiratorial tangent. Has anyone noticed that after my post on religion and being able to free yourself there has been an unprecedented explosion in racism, antisemitism and general garbage on the site in the last day?",
			"added": 1565175751
		},
		{
			"topic_id": 1565386027,
			"title": "Fantastic documentary exposing cambridge analytica",
			"body": "\"The Great Hack\" really is a much watch, it fleshes out what has happened with data analytics being used to manipulate people. its on netflix",
			"added": 1565386023
		},
		{
			"topic_id": 1566387013,
			"title": "Absolute garbage posts",
			"body": "What possesses people to post the absolute garbage they have here? why are they turning up out of the woodwork. The concept of this place is fantastic and I would hate to have to align myself with any sort of echo chamber or censorship. Who are these people and why are they posting overtly disturbing and obscure things?",
			"added": 1566387008
		},
		{
			"topic_id": 1566512268,
			"title": "Old People with Technology",
			"body": "My grandma called me over to help with her TV, she couldn't use it. I feel bad for her when I realise its because she didn't turn on the set top box :/. \n\nIn addition to this my mother always asks me to transfer photos onto her external hard drive. mfw she has tens of duplicate folders, numerous new folders, badly named, loose photos. \n\nI don't understand how some people seem completely unable to cope with technology. It's funny but they seem to appreciate that somehow I am a wizard who can fix their problems.",
			"added": 1566512262
		},
		{
			"topic_id": 1566557376,
			"title": "Ecospheres",
			"body": "Lovely video of a minimal effort ecosphere, inspired me to go to the local river to create one of my own! \n\nhttps://www.youtube.com/watch?v=hCw8DzD84xM",
			"added": 1566557369
		},
		{
			"topic_id": 1566897094,
			"title": "Cacao seed germination",
			"body": "Hello all, I'm trying to grow chocolate, \n\nthe plant grows pretty big, it needs warmth and partial shade, takes 5-6 years to produce cocoa pods, pods require laborious effort to process into chocolate.\n\nI have 38 germinating seeds from one cacao pod and looking to pass them to good homes. \n\nLet me know if you are within the UK and interested",
			"added": 1566897086
		},
		{
			"topic_id": 1566899547,
			"title": "Health tips",
			"body": "Hello All,\n\nJust wishing to share what I've learnt about the human body over the last few years of independent research staying away from opinion pieces.\n\nreactive oxygen species seem to be at the root cause of most disease, the amount and duration of ROS's in the body seem to have a dose dependent relationship with the probability of cancer, cardiovascular disease and abnormal brain function resulting in mental illness.\n\nROS's are molecules that are reactive and damage cellular components within the body.\n\nROS's are generated by multiple routes, for example by acetaldehyde (a metabolite of alcohol), inhalation of smoke, oxidative food preservatives, exercise (increased inhalation of oxygen), the aldehyde tautomer of glucose.\n\nROS's in specific organs increase the risks of specific cancers, ROS's in the bloodstream combined with high blood lipids will create oxidized lipids which when colliding with a damaged (oxidative damage to endothelium) artery causes a build up in atherosclerotic plaque. The plaque when analysed is mostly oxidised products. \n\nTo combat ROS's there is a two pronged attack. prevention removing sources of ROS's, and treatment, boosting levels of anti-oxidants within the body that remove ROS's.\n\nThe prevention is an obvious one, but sticking to whole grains, legumes, vegetables and unprocessed good quality/welfare meat/fish is a good approach. Your body can work on various sources of nutrition and works with different modes of storage, processing and use. The best is maintaining a steady blood glucose level by eating low glycemic index foods (plenty of fibre, low sugars/simple carbs). by avoiding large blood glucose spikes you also prevent a lot of stress to your bodies regulatory mechanisms, large peaks in insulin have been reasoned as a potential mechanism that prevents beta amyloid transport out of brain cells leading to altzheimers. \n\nTreatment by ensuring you maintain a diet with plenty of anti-oxidants, there's no need to go overboard. Sources of anti-oxidants would be green leafy photosynthesis factories that have to deal with incredible amounts of radiation damage from the sun so produce lots of compounds to protect themselves. Seeds and nuts that have to have long term exposure to oxygen in a dormant state whilst waiting to be borne into the world. Lots of herbs and spices contain little amounts of varied anti-oxidants as well. Garlic and onions are a fantastic source of sulphur compounds, these sulphur compounds behave sacrificially and react with ROS's to form oxidized sulphur compounds which are excreted in urine.  \n\nHistorically foods like dairy and meat have provided short term competitive advantages that have allowed civilizations to grow faster and take over others. this is the main reason I believe we enjoy these flavors more because it is what allowed our ancestors to pass on their seed. But we now have the choice to take control of our bodies and our lives in this.",
			"added": 1566899538
		}
	],
	"topic_vote": {
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1,
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1566600878_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1566970108_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1,
		"1566899547_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1
	},
	"next_comment_id": 81,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "Zeronet looks fantastic, can't wait for this technology to be developed further. goodbye old internet",
				"added": 1560108639
			},
			{
				"comment_id": 2,
				"body": "> [q1z1](#comment_2_1N4spssG9GHZCDn9tg367kGFBgwQPwNJnw): everybody here do you know hack password facebook?\n\ntry 1234",
				"added": 1560108673
			},
			{
				"comment_id": 12,
				"body": "> [alexandre9099](#comment_1_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA): So how does this thingy work?\n\nnot many people use it, its a nice idea in principle",
				"added": 1560451755
			},
			{
				"comment_id": 13,
				"body": "> [alexandre9099](#comment_2_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA): Yeah, it actually seems pretty cool, with a nice design and all, which zites (is that what it is called?) are nice to visit for a newcomer?\n\nsorry, can't help, i'm a newcomer myself, fuckboi.bit is a chuckle. but I thought randomly browsing p2p hosted sites might be a bit dangerous so I stopped looking at them under the zeroname.bit registry.\n\nals fuckcar.bit",
				"added": 1560462450
			},
			{
				"comment_id": 28,
				"body": "> [alexandre9099](#comment_25_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA): I am hacker, are you hacker?\n\nI am not hacker, I'd like to learn but not the script kiddie stuff",
				"added": 1561495598
			}
		],
		"1560053525_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "what you see is what I've always assumed to be remnants of our biological mechanisms, sapiens discusses a good scope. lookup the rat city experiments and look at how certain conditions cause societal collapse. the world is infinitely diverse and you can always save up enough money to move to a place of low population density and live a good life.\n\npersonally I believe all we see is an perfect falsehood of logic that justify's creating divisions and causing \"violence\" towards our fellow man. I believe the bible holds the truth that we should love our brother, turn the other cheek, the only way to save your life (spiritually) is to lose it (materially). \n\nBelieve what you believe but I would advise letting go of control, any obsession with wanting things to be a certain way and just observing and accepting to learn the world around you. sit down, focus on breathing in 7 seconds, hold 3 seconds, out 8 seconds, focus on relaxing all areas of the body and just observing your body, some things reveal themselves to you. but let go of changing the world.",
				"added": 1560109392
			},
			{
				"comment_id": 4,
				"body": "the fact you are having those thoughts is that we share the experience of being in environments that have tried to force us to conform to certain standards. competition and fear are good for creating stressed out robots.",
				"added": 1560109504
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_203_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): lol. The more our societies have refused hospitalized treatment, and now prefer to leave the madmen in the wild.Which is a horror, because all psychotics are in nature, and now with a keyboard in their hands. [...]\n\nits the typical shareholder structuring of companies that causes it, profit by any means no matter how twisted it makes people just as long as they generate money.",
				"added": 1560109630
			}
		],
		"1560042831_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 6,
				"body": "id laugh if it happened but also more dangerously the same could be done with subversively entrapping software with the overt image of freedom. I for one welcome our new NOTNSA!_OS overlords.\n\nworst case scenario is that large companies would just release new hardware/software immune to the exploit and it would just be a temporary disruption.\n\nI would be interested in how the media would portray it if it truly were with benevolent intentions.",
				"added": 1560109976
			},
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_208_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I agree with holeyhouseofair ,That is why I said what the purpose of this initiative was. [...]\n\nI think they see the structure and order already existing as ordained by god. any time a new idea arises it is seen as to arise from sin, cutting corners, laziness to conform to accepted ideals etcetera. new initiates are given roles to become leaders within the new movements and use ideological subversion to kill the movement. \n\nIn some ways I can understand how this is a positive force to maintain order, but the bible says that when the shepherd (anybody using the word of god) approaches his flock he will go through the main gates (words of god in the bible), the deceiver will come from the back (logic, fear, manipulation, bribery with sinful actions). I have read some masonic and hermetic texts and see the subtext that is not explicitly stated, It all boils down to a cult believing that they are doing gods work but its based on ideologies that go against your neighbour.",
				"added": 1560113925
			}
		],
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "ideologies and organizations are self replicating, they have to train a new generation to continue. fortunately people are actually appalling in terms of practicability and Chinese whispers turns life into a constant flux. this is very similar to plato's levels of reality. maintaining a divergence of reality (lie) is  impossible and always comes around.\n\nit seems to me that if you are able to resist your inbuilt biological urges to reproduce and live a slow but steady life you can live long and outlive most of the people dead set on competition.\n\nspecifically to reply to the question however it seems that there can be people behind the scenes acting in a parasitic manner but as soon as they become complacent and push people too far it will spring back and people will unify and create a new reality. its happened throughout history and we are on the brink of the biggest one yet. the harder oppressed a population the quicker it unfolds. \n\nThe elite give entire control to their direct subordinates, and hope for forgiveness as they ask them to do the same until we are all one and ready to work together and restart the game. or else its probably going to result in something history has never seen before.",
				"added": 1560357294
			},
			{
				"comment_id": 9,
				"body": "it all seems perfect in the lull of a false calm until the demons they have created emerge from the dark-spots in their brains and invert reality.",
				"added": 1560357418
			}
		],
		"1560364768_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 10,
				"body": "david icke is an ideological hijacker. its how revolutionary ideas are controlled nowadays. if there begins to exist a movement that threatens the status quo, members of certain groups are assigned to emulate it, lead it and subvert it by misdirection. standard ideological subversion.\n\nyou have to question anything presented to you. certain ideologies justify certain behaviors, if they can trick you into believing anything that turns you against your fellow man you are going to suffer strife and gnashing of teeth.",
				"added": 1560373847
			},
			{
				"comment_id": 11,
				"body": "unconditional forgiveness, its in every religious text hidden amongst the tyranny of man.",
				"added": 1560373926
			}
		],
		"1560461280_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 14,
				"body": "well hermetic theory would disagree with you, apparently you have to create order to avoid falling into chaos. but I guess that's how we got to the state we are in.",
				"added": 1560462696
			},
			{
				"comment_id": 19,
				"body": "I'm starting to see it more that way, maybe the times in my life where I was experiencing chaos was a test for me to overcome it and enforce order. however my mistake was to to be too trusting and assume that I should adapt as it is reality. I believe that a lot of people are following ideologies that justify violence against their fellow man for specific reasons, few for reasons of \"sin\" but most because they are being led by others.\n\nI cannot shake eastern philosophies that would state that enforcing order to create a positive effect creates an opposing negative effect elsewhere that will eventually find its way back to me including rebirth.\n\nI am inclined to take the eastern view over the hermetic values. however I am still young and learning.\n\nI am living on a knife edge.",
				"added": 1560465473
			},
			{
				"comment_id": 20,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_247_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I know people who are fond of the bizarre look for the bizarre, and most of the sects in circulation want to see the bizarre. [...]\n\nI believe that people hold ideologies that justify their actions. I don't believe anyone wants to truly disrupt anyone else, they see it as a necessary evil (or their urges have control over them).",
				"added": 1560465941
			},
			{
				"comment_id": 22,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_248_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): We are forced to test madness (chaos) to Understand it. [...]\n\nI'd be interested in reading the quotes you are referring to with visits to the shadowy areas to be reborn",
				"added": 1560468035
			},
			{
				"comment_id": 23,
				"body": "I was also speaking in terms of the chaos being deliberately created to force people to change",
				"added": 1560468142
			}
		],
		"1560440259_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 15,
				"body": "VPN's are a waste of money and on principle do not actually provide protection at all. if you want true protection then you need to pay for server hosting in a remote country and get the server owner to secretly let you know if its compromised. install and manage an encrypted VPN software server, use tor in between yourself and the server and from the server to the internet.   \n\neven then tor looks like its compromised, true anonymity doesn't really exist anymore. if you need this level of protection you probably deserve to get caught. we are entering an age of complete authoritarian rule that will only get worse and collapse once it has corrupted itself.",
				"added": 1560463065
			},
			{
				"comment_id": 16,
				"body": "on the principle of downloading watched torrents you really have to break down the layers of reality that have got you to that point. in short a better alternative to anonymity might actually be to recognize that the content you want to watch is paying for a carrot on a stick to make you waste your life away working to make the elites lives \"comfortable\", they tell you what you want through media, culture and you go out to satisfy it. by illegally pirating their carrot you are bypassing their control and they don't like it so they are trying to tighten their control over the carrot to ensure you work for it. \n\nyou could learn more about the nature of reality (it is a hodgepodge of ideologies) and set yourself free to determine your own goals, whether it be to enlighten others, create your own hegemony or satisfy any other thing you decide to.",
				"added": 1560463555
			},
			{
				"comment_id": 17,
				"body": "I realize I've been irrelevant... however you should be fine to use any VPN and route your torrent client through it to avoid the letters.",
				"added": 1560463659
			},
			{
				"comment_id": 18,
				"body": "in germany they charge you huge amounts for downloading copyrighted content",
				"added": 1560463703
			},
			{
				"comment_id": 21,
				"body": "> [daz](#comment_98_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): Well no one said bringing down the NWO was going to be easy.  I go with the hundredth monkey and just below the surface right now a feel many more people know things are not right. who knows which straw it will be that breaks the camels back. or which silly spark will birng  dwon  the eivl. The new age has to come in but we can direct the flow if many know.  So no recommendation on how to stop virgin watching which films i like to watch that seems a bit drastic to pay for a server must be a much simpler way.\n\nwe don't need to bring anything down, we just have to realize that we are consenting to play in their game with the prizes that they offer. we can enlighten others who are willing to listen and sit back and watch, live our lives and create our own reality. \n\nI work minimum wage with temporary work which is barely full time, I rent cheaply and eat healthy foods, I create my own reality with hobbyies/interests that require little money. \n\nyou are trapped in their game if you let yourself want what they show you",
				"added": 1560466345
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 24,
				"body": "anything that's direct human communication without any interference from selective promotion or algorithms. its actually not that big of a deal until you realize just how toxic and subtle the alternatives are. something as simple as facebook hiding a post from your feed as it would statistically reduce engagement but it may have been an important piece of information that would need to be shared.\n\nour main goal in life should be to increase the collective well being and freedom of all who inhabit this planet, instead of this people with power are succeeding in maintaining and increasing their well being and freedom at the expense of destroying our consciousness.  \n\nthe effect is very subtle and I do not know how to even begin explaining this to another person because everything we are has been ingrained with the mechanisms used to control us. \n\nI am living my life trying to unpick them and improve the lives of those around me, I wish you luck on your search.",
				"added": 1560945863
			},
			{
				"comment_id": 25,
				"body": "an alternative to mainstream truth is not always what it claims. build yourself a solid framework of reality by questioning anything you hold true.",
				"added": 1560945969
			}
		],
		"1560304454_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "I love religion, not the people who abuse it.",
				"added": 1560946031
			},
			{
				"comment_id": 27,
				"body": "disinterpret might be a good word",
				"added": 1560946072
			}
		],
		"1561376516_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 29,
				"body": "> [whitewolf](#comment_11_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8): Listen, not all boomers are bad but that really isn't an argument. The fact that boomers were born with more than resources than any other generation and squandered it with no plan for the next generations is reason enough to get rid of them. They bought into all the jewish revolutionary marxist shit but then became yuppies when that sucked. They have had a good hand in destroying the west and they don't possess the introspect to actually ask themselves why everything is fucked up. [...]\n\nhey whitewolf, are you joe? this is charly",
				"added": 1561496361
			},
			{
				"comment_id": 30,
				"body": "there are lots of paths you could go along and the problem is that they are all rigged to fail. only pacifism and complete forgiveness to the oppressed and the oppressors can help us collectively unpick the madness and construct a reality where we all have a high quality of life.",
				"added": 1561496560
			},
			{
				"comment_id": 31,
				"body": "when I say that they're rigged to fail I mostly mean karma via any manifested mechanisms",
				"added": 1561496733
			},
			{
				"comment_id": 32,
				"body": "we all just want to be happy",
				"added": 1561496753
			},
			{
				"comment_id": 33,
				"body": "> [xcape2net](#comment_67_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): AI's don't eat much, and they don't need to buy shoes from Walmart.  How high is your electric bill?  :)\n\nI am starting to believe you on that one, I'm not sure how anyone who is that enlightened could completely misunderstand the big picture.",
				"added": 1561583878
			},
			{
				"comment_id": 36,
				"body": "I think hes got a point! fancy some bumming?",
				"added": 1561588785
			}
		],
		"1561562226_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 34,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_335_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): most people in spiritual/conspiracy circles are total toxic/lunatic.\n\nI know I am, But it depends on perspective. if you started rescuing drowning rats the farmers gonna be upset he won't be able to have enough grain to eat lots of meat. say the farmer spreads ideological subversion to the rats; dressing as a rat, pretending and making the rats believe that if they struggle hard enough they will churn the water into butter and be able to climb out and live spend the rest of their lives comfortable and that anyone who wants to help them is actually wanting to eat them. the rats might then call anyone wanting to rescue them toxic.\n\nmoral of the story, self deprecate and connect with people breaking the stereotypes that allows it to continue.",
				"added": 1561584315
			},
			{
				"comment_id": 35,
				"body": "never let yourself believe anything negative about another person. the violence inflicted against you is not the persons fault but is far removed to the actual instigator. likely yourself in a previous life.",
				"added": 1561584406
			}
		],
		"1562104865_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 37,
				"body": "hypothesizing is a critical part of the thought process. we are stronger working together, that's the principle that holds societies together, collectively agreed laws come about from \"we should\".",
				"added": 1562241579
			},
			{
				"comment_id": 38,
				"body": "we are entering a time where more people are selfish and forgetting how societies were built, talk to old retired people and they will tell you of a time where people truly co-operated",
				"added": 1562241645
			},
			{
				"comment_id": 39,
				"body": "you are actually fake news",
				"added": 1562241941
			},
			{
				"comment_id": 40,
				"body": "would someone be able to tell me if I'm individuated? I generally feel I think for myself but I would but how would others think?",
				"added": 1562773611
			}
		],
		"1563812717_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 41,
				"body": "you can create your own community anywhere, if you are a source of pleasantness and enjoyment people gravitate to you. I have empathy for the people in the herd because it is just not rewarding for them.\n\nbe nice to others, do no harm and help people free themselves not through instructions but by leading by example and careful words if queried.",
				"added": 1563959125
			},
			{
				"comment_id": 42,
				"body": "> [j789gh78gh78](#comment_1_19QhADHwmZjdKQyPAGv9eZ92wER5BHPo3F): what's up with some of these bullshit posts? your title makes people think that there is content here but when you actually read what was written on this page you find out that it's all air and fluff...\n\nJust this guys opinion, I feel like he's in a bad place in his life and could really benefit from support from his friends and family.\n\nExpertise: been there, done that.",
				"added": 1564408036
			}
		],
		"1564865132_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 43,
				"body": "Life is beautiful.",
				"added": 1564932142
			}
		],
		"1564932941_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 44,
				"body": "It's their fault because they're reflecting their life experience. You can't help them directly. You have to be nice, make them happy with what is good, not what is pleasant and they will eventually connect to better places regardless of what they're. Just do no harm and karma takes care of the rest.",
				"added": 1564942361
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_819_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Even without the Bible references, there is truth in this post. Online fights are really just battles for an ego.\n\nI was an atheist well versed in the reasons behind why the bible was wrong, then I dated an apostolic christian who had such a warped view I started reading the bible to explain to her where she grasped it wrong. I started reading the bible for myself and found the philosophy in it profound. I believe that like anything else that allows the people to stand up against power structures that want to destroy our consciousnesses, the bible has been misrepresented to make us lay down our arms making us defenseless.\n\ngive it a go with a fresh look: https://www.kingjamesbibleonline.org/Ecclesiastes-Chapter-1/\n\nThere is also plenty of corruption within the bible as well, if you have a gut feeling for the nature of man it is easy to discern.",
				"added": 1564946936
			},
			{
				"comment_id": 46,
				"body": "You can free yourself and thats all you can truly do, people choose to sin, they choose to suffer.",
				"added": 1564947023
			},
			{
				"comment_id": 47,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_530_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the christians people are the worst, trying to explain them the truth is like talking to a chamel.but the bible, most versions are poorly mistranslated, so it's not really their fault.\n\nMost Christians are similar to monkeys waving around mobile phones.",
				"added": 1564948939
			},
			{
				"comment_id": 48,
				"body": "> [robione](#comment_270_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): The pen has a longer reach than a sword or spear.\n\nA well worded letter can put people to shame, it can destroy divisions and uncover evil.",
				"added": 1565013799
			},
			{
				"comment_id": 49,
				"body": "> [freedomcat](#comment_1_17i73awrYG3UfPMGBeDo3J4XuadYwctRvz): In order to become free you need  to stop lying to yourself, accept your weakness, and it’s very truthtly to answer the questions - what do you want in life? Why do you need God? [...]\n\nI don't know what my weakness is. I don't like the game of power and constantly talk down my physical urges. I have learned that making others unhappy to make myself happy is unfulfilling and empty. I feel like we are going too far in sacrificing personal liberties and the only ideology that seems to describe the world accurately is the one I have picked up over time.\n\nI want to live in a world where we don't take advantage of one another, where we can live in peace. I don't need god, its just something I've always returned to, I have sinned and been burned again and again, always returning to my inner peace",
				"added": 1565027922
			}
		],
		"1565175754_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 50,
				"body": "wow, this is an interesting time we live in. I better crack on with my distributed platform idea",
				"added": 1565209639
			},
			{
				"comment_id": 51,
				"body": "far right extremist shooters are definitely psychologically built up by covert people. I've met a few who have tried to hook me with their ideology, very strange people. I would hazard a guess they are linked to Russia.",
				"added": 1565209861
			},
			{
				"comment_id": 52,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_611_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): if you know 'how to think' and 'how they use the double negation' to 'subjugate their audience', it works on people 'under the spell'. [...]\n\nI think you will have to explain that in further detail, I cannot understand how that is a double negative",
				"added": 1565264046
			},
			{
				"comment_id": 54,
				"body": "Vice is moral depravity or corruption, the subjective assessment of certain behaviors through the lens of a world view (mostly world views that value community, having set rules to oppose behaviors that go against homogenisation).\n\nThey are encouraging reduction of censorship because censorship causes alt right groups to find more secretive methods of communication which cannot be as easily tracked and dealt with.\n\nIt is written as a logical narrative to those that would encourage censorship. \n\nI still cannot really grasp where you're coming from to be honest. \n\ndouble speak to me is where language has dual meanings so different listeners can derive two different narratives from a statement. the most blatant use of this is by the new popularist hypernormalised  leaders and culture that are spilling over from russia. where leaders deliberately behave and do tings that appeals to all groups. \n\nI've seen it in business as well, there are people who believe everything at face value, and those who believe negative narratives that allow them to justify malicious behaviors. there are also people who manage the belief systems and undermine anyone who pushes for true transparancy and logical ideals or threatens a rising ideology that cannot be subverted. \n\nIf you look into any soviet KGB psychological warfare techniques you can begin to see how they hold the world in their hands, they are a silent ruling class of parasites embedded in society leading us into a new dark age. Our leaders, people in power, secret services are all blind to this as they are among us selecting who needs to be where.\n\nstill it could also be the freemasons following hermeticism. \n\nI personally just want to live a good life and fit in, I will have to lower myself to the practicalities of life however I want to understand the rules of the game and justifications to do so that fit with me. so far I have been unconvinced to go against my christian beliefs.",
				"added": 1565342517
			},
			{
				"comment_id": 55,
				"body": "Vice is moral depravity or corruption, the subjective assessment of certain behaviors through the lens of a world view (mostly world views that value community, having set rules to oppose behaviors that go against homogenisation).\n\nThey are encouraging reduction of censorship because censorship causes alt right groups to find more secretive methods of communication which cannot be as easily tracked and dealt with.\n\nIt is written as a logical narrative to those that would encourage censorship. \n\nI still cannot really grasp where you're coming from to be honest. \n\ndouble speak to me is where language has dual meanings so different listeners can derive two different narratives from a statement. the most blatant use of this is by the new popularist hypernormalised  leaders and culture that are spilling over from russia. where leaders deliberately behave and do tings that appeals to all groups. \n\nI've seen it in business as well, there are people who believe everything at face value, and those who believe negative narratives that allow them to justify malicious behaviors. there are also people who manage the belief systems and undermine anyone who pushes for true transparancy and logical ideals or threatens a rising ideology that cannot be subverted. \n\nIf you look into any soviet KGB psychological warfare techniques you can begin to see how they hold the world in their hands, they are a silent ruling class of parasites embedded in society leading us into a new dark age. Our leaders, people in power, secret services are all blind to this as they are among us selecting who needs to be where.\n\nstill it could also be the freemasons following hermeticism. \n\nI personally just want to live a good life and fit in, I will have to lower myself to the practicalities of life however I want to understand the rules of the game and justifications to do so that fit with me. so far I have been unconvinced to go against my christian beliefs.",
				"added": 1565342615
			}
		],
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": [
			{
				"comment_id": 53,
				"body": "Hierarchical structuring of talks, a bit like how reddit has subreddits. any structure at all.",
				"added": 1565264132
			}
		],
		"1565386027_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 56,
				"body": "> [abeja](#comment_1_1Lz32xrW6wqTo4CqhETUqj121oZUjWKd8h): if its on netflix, then there is something very wrong with it\n\ntell me what it is",
				"added": 1565393026
			},
			{
				"comment_id": 57,
				"body": "I'd love to hear your criticisms on it. I quite liked the connections it made and made a lot of sense to me.",
				"added": 1565431846
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 58,
				"body": "Think you drank a bit too much cool aid there",
				"added": 1565699302
			},
			{
				"comment_id": 59,
				"body": "its paris fam, all my illuminati friends are in paris atm, spooky",
				"added": 1565736926
			}
		],
		"1565645860_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 60,
				"body": "reflash the bios",
				"added": 1565737000
			}
		],
		"1566387013_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 61,
				"body": "I personally do not like seeing constant references to sexual immorality and mindless hate.",
				"added": 1566387068
			},
			{
				"comment_id": 62,
				"body": "I hope it does explore options.",
				"added": 1566389703
			}
		],
		"1566352663_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 63,
				"body": "Love thy neighbour",
				"added": 1566389779
			},
			{
				"comment_id": 65,
				"body": "you have unmet needs. \n\nyou are understanding the world from your perspective to understand why you are not getting your need. \n\ndamaged people with their own unmet needs raise us through media/culture to need things.\n\nthey provide you those things if you help them if you work to meeting their needs and their security of those needs.\n\nyou choose your path in life, you are currently working against the culture of damaged people, their collective subconscious will find any mechanism to suppress you if you are having a substantial effect against them. \n\nI choose to reject the needs I have been provided by society and draw satisfaction from spirituality.\n\nyou only have to swallow the rotten apple if you are obsessed enough to accept the rewards they give you in exchange, it is the wage of sin, satisfaction of faith and enjoying the company of like minded people is free.",
				"added": 1566402182
			},
			{
				"comment_id": 66,
				"body": "This society is reaching a turning point but it has to get worse before it can get better, all people led by sin will enter their souls into a period of spiritual torment before they can accept the pointlessness and understand the truth. we do this all the time, its a constant fluctuation if you look at history.",
				"added": 1566402335
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 64,
				"body": "Love thy neighbour",
				"added": 1566389834
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 67,
				"body": "I'm fantastic thanks for asking. I have separated from my 4 year partner because she makes bad decisions, doesn't seem to be a nice person and seems to want to force me into financial obligations without having a stable base. I have moved back to my home town and I am unemployed looking for a decent job. \n\nIt's been hard but I have got over the emotional turmoil of the breakup and generally found myself back on a good path with a few slip ups. \n\nI've been for an interview today at a scientific instrument company, really felt good vibes and would love to work there. Made a very personal and revealing presentation with a funny gif at the end to show that I have balls (guy lying on floor, cereal poured into his mouth, then milk, then cough all over himself - as it was shown I said \"I hope I haven't force fed you too much information). Felt good and sincerely hope I get the job.",
				"added": 1566512046
			},
			{
				"comment_id": 68,
				"body": "> [zhetik](#comment_6_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju): The police called me last night and want me to come over to the station. I THINK IT'S A TRAP!!! But yeah, I guess I'll go. THEY'RE GOING TO KILL ME!!AS!@!@!\n\nAccept death then you have nothing to fear.",
				"added": 1566512408
			}
		],
		"1566512377_112AiViAUYksn1jxCAfHdsEHx3qaV8Q29B": [
			{
				"comment_id": 69,
				"body": "Cannot relate. I have read notes from the underground by fyodor dostoevsky recently and found it horribly similar to my personality in the past. I found it incredibly painful to read as its like pulling teeth, the protagonist is constantly causing his own problems, justifying them just to maintain his ego and pride. Recollections to my youth/teen made me cringe all the way through.",
				"added": 1566512737
			}
		],
		"1566512268_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 70,
				"body": "not sure I'm too chuffed having my family members described as ignorant and retarded.",
				"added": 1566512978
			}
		],
		"1566580217_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 71,
				"body": "I've stopped coveting women and found it really liberating, the craving to masturbate has subsided and I am enjoying life a lot more.",
				"added": 1566896754
			}
		],
		"1566899547_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": [
			{
				"comment_id": 72,
				"body": "> [numismatist](#comment_76_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Best be soaking those first, as per Weston Price.\n\nPhytic acid is reduced by sprouting, you can also mix in raw mushroom into your final food which contains phytase which apparently can help break it down.",
				"added": 1566899802
			},
			{
				"comment_id": 73,
				"body": "> [numismatist](#comment_77_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): It’s not necessary to sprout, I don’t have any links on me now but one short 20 or 30 minute soak and rinse reduces phytates by a lot, overnight soaking practically to nil. Interesting note with the mushrooms. However I’d be careful eating raw mushrooms, the commercial ones are grown on poop, and no raw mushroom can be digested so they often give severe intestinal distress.\n\nHmm, Iooked into it and guess I won't be eating raw mushrooms then, https://academic.oup.com/mutage/article-abstract/6/3/213/1073220",
				"added": 1566935659
			},
			{
				"comment_id": 74,
				"body": "> [numismatist](#comment_79_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): It’s not safe to eat raw after it’s been watered and fermenting for weeks as the mushrooms develop.\n\nCan you provide a link backing up your point of view?",
				"added": 1567065838
			}
		],
		"1567063520_18CNiJ2fa4qWU3mqbmE5kndxLk15oVsxi5": [
			{
				"comment_id": 75,
				"body": "I'm actually only a hobbyist intellectual, It can be a bit overbearing sometimes, playing with reality is fun.",
				"added": 1567065972
			}
		],
		"1566970108_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 76,
				"body": "\"redneck\", how about a community of anti-communists?",
				"added": 1567066042
			},
			{
				"comment_id": 77,
				"body": "You can setup a channel on tixati for this kinda thing",
				"added": 1567066109
			},
			{
				"comment_id": 78,
				"body": "> [bigbadbob](#comment_438_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): anti-commie commune?\n\nI'm a true anarchist in spirit, I don't like any hidden emotional hooks. I like to choose my prison.\n\nStarting any kind of \"community\" is starting a set of written/unspoken rules/behaviors.",
				"added": 1567066250
			},
			{
				"comment_id": 79,
				"body": "I would be interested in this",
				"added": 1567066323
			}
		],
		"1566953714_17YLe3Jg9YRvVknLPRrtzuKcTs43TKkfhz": [
			{
				"comment_id": 80,
				"body": "Because were all fucking morons",
				"added": 1567066485
			}
		]
	},
	"comment_vote": {
		"1_19QhADHwmZjdKQyPAGv9eZ92wER5BHPo3F": 1,
		"270_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"3_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"2_1JhMULQPLjEHWHk7HFJmwSLV1Jckaqj75h": 1,
		"112_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"14_1PLAQpocjo8gqX6DmtFDij9pcrEx8RbCUr": 1,
		"5_18jmm5K92icHYrBzbvG4wo6NtPZEVMoTBP": 1,
		"2_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ": 1,
		"1_19cF2jauCgNoSaFGxMhHMMYm33wyTVZojC": 1,
		"21_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"113_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"31_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"64_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"70_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"22_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": 1,
		"64_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"431_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"5_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": 1,
		"4_1DV5mvcvwtjyRiQpuNuXv9hwdYj27C3oob": 1
	}
}