{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1596458821,
			"title": "What if Q is actually Satashi Nakamoto?",
			"body": "I mean, think about it, Nakamoto's goal was to defeat the globalists and so is that of Q, correct?\n\nSo, just like with any other intelligence operation, one has to go about defeating their enemies in a systemic fashion. While I understand it is a bit of a stretch, there is the possibility that this may be the case. But, because both Q and Nakamoto are masters in anonymity and information security/cryptography, it makes it difficult to know for certain. \nRight now, our best intelligence on Q is that Q is a collective of individuals rather than a single person. So, perhaps Nakamoto is in fact among these individuals? If not, could Nakamoto have helped Q in some sense to gain his position in Military Intelligence operations? That is less far fetched and quite likely to be quite frank; maybe not Nakamoto's intended goal, but rather a side effect of his work.\n\nWhat does ZeroNet think?",
			"added": 1596458820
		},
		{
			"topic_id": 1596507535,
			"title": "Any Americans here?",
			"body": "I have been trying to get more Americans on ZeroNet now that the government has silenced the most educated and intelligent among us. Just wondering who all has made it here so far, and if you all would like to discuss what is going on in our country right now. This is beyond crazy at this point; people no longer willing to listen to the truth because the cover up by the government. I know at least some of you know what got leaked and why they are doing this, and how I am tied to what was leaked. Again, they can't touch me because doing so would destroy them. So, let's talk America! :)",
			"added": 1596507533
		},
		{
			"topic_id": 1596608855,
			"title": "Bill Gates forming his own NSA...",
			"body": "Uhm...\n\nWhy is Gates totally avoiding mentioning anything about actually changing the app's Mass Surveillance techniques if it comes under his control?\n\nHe says, \"I'm not sure what happened last Saturday that made Trump want to do this even; I've been more focused on the pandemic.\"\n\nHe essentially tells viewers he will not change the app's surveillance by saying, \"Your data will be safe with Microsoft since we are in the US.\"\n\nOh, and I love how the reporter makes the remark, \"Is Trump right to be doing this simply because this app is of Chinese origin?\" as if Trump is xenophobic instead of making it clear to her audience that Trump is doing it to prevent Mass Surveillance by the CCP. Why is the #MSM avoiding critical points on this matter when discussing it on the TV? Lol. Hmm..\n\nBullshit. Gates just wants a way to perform even more mass surveillance so he can spy on people on their cellphones and not just their Windows devices now. He can then profit by selling this information of course, and it is getting to a point where it appears he is running a wannabe NSA. His Windows 10 is spyware and should be illegal, but they let that slide and TikTok is essentially the equivalent in my eyes. Its horrible!",
			"added": 1596608852
		}
	],
	"topic_vote": {
		"1596284934_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"1596264833_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"1592950813_1PGtPmD5NAWpf4kaEB1qquveCN8S4LUqrq": 1,
		"1596269492_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": 1,
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1580253527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1596498919_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"1596649883_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1596874418_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": 1,
		"1596985537_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"1597083511_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": 1,
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1
	},
	"next_comment_id": 93,
	"comment": {
		"1596284934_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": [
			{
				"comment_id": 1,
				"body": "That is a new one to me as far as the acronym is concerned, but I do believe you are correct about this being a part of a conspiracy to get sheep to fall for being chipped. They have been systemically priming people for it for decades now. It is no longer a conspiracy theory really since certain companies are already incentiving their workers to be chipped in Europe. I learned about this back in college in 2014 during a business class.",
				"added": 1596289271
			},
			{
				"comment_id": 15,
				"body": "> [jeff](#comment_36_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): CoViD stands for Corona Virus Disease. All this hoopla is just fear mongering. There have been 4 million deaths worldwide, but there were 60 million from the swine flu epidemic of 2009. Dr. Fauxci is vested in Remdesivir and that's a conflict of interest.  Gates is vested in vaccine production so that's a problem, too. Democrats have hyped this whole crisis to serve their interests. I suspect the chipping thing is just a conspiracy theory, but who knows?\n\nJust like with any other conspiracy theory, as I said in my response, there is always some truth. \n\nAnyway, I agree with everything you said in your response as it is entirely factual. The chipping could also be tied to the whole them getting rid of cash \"conspiracy\" as well. The chips I mentioned that are ALREADY IN USE IN EUROPE, are for employees to get access to certain areas and can be used to spend money in the companies' cafeteria and such. So, Again, its not a conspiracy theory if it is literally already being done on a smaller scale; its a remote possibility. \n\nGet what I am saying? Again, its based on truth so it isn't a conspiracy theory. Its a \"remote possibility\" at worst anymore since we are literally WATCHING these things happen now... Gradually these things are happening whether we like it or not which is why there are progressives who are for them and conservatives who are against them... Its ALL pretty simple if you stop looking at it with suspicion and instead approach it with some logic and reasoning...",
				"added": 1596314609
			},
			{
				"comment_id": 16,
				"body": "https://futurism.com/british-companies-implanting-microchips\n\nAnd, wouldn't you know it! It's popularity has INCREASED since I was in college haha :P\n\nhttps://www.marketwatch.com/story/states-are-cracking-down-on-companies-microchipping-their-employees-how-common-is-it-and-why-does-it-happen-2020-02-03\n\nhttps://www.scmp.com/news/world/europe/article/2145896/thousands-people-sweden-get-microchip-implants-new-way-life",
				"added": 1596314909
			},
			{
				"comment_id": 17,
				"body": "Because... Money..\n\nThe problem is that of the fact that a chip is an easy way to invade privacy which is SUPPOSED to be protect by Article 12 of The Universal Declaration of Human Rights which is not taught to American citizens in school, but in some other countries it is well known... The US is actually gradually taking away privacy under the guise of national security even though we literally just watched a bunch of terrorists destroy our country even with the \"advanced surveillance\" which is illegal under UN Treaties as I mentioned...\n\nSoooo... Yeah... Anyway... What were you saying?\n\nhttps://www.independent.co.uk/news/world/europe/sweden-workers-microchip-implant-cash-card-id-pass-replace-employee-hand-epicenter-rice-grain-size-a7670551.html",
				"added": 1596315126
			},
			{
				"comment_id": 18,
				"body": "However, despite the fact that it should be people's choice to be chipped, the government in the US (as I mentioned) has been training its citizens to be subordinate to them during false flag operations such as that which occurred during 9/11 which was what allowed them to claim we needed the \"advanced surveillance\" in the first place. Then more false flags occurred which allowed them to further increase the surveillance and extend the patriot act under patriot act II which was signed into law.... Now a \"Plandemic\" would make it EXTREMELY easy to convince people they should be chipped for their own health or whatever... \n\nPeople tend to think the best of their elected officials even though the agendas are all essentially the same really... They are all just pawns being used by the Rothschilds of course.... So these officials bend to the whim of these financial elites... Which is why Bitcoin became so popular.... It erradicates the ability of the Illuminati, erm sorry, the Rothschilds to manipulate individuals... Of course they fought back and tried to make it illegal/highly regulated. . yada yada yada... Whatever... Just read a bit more if you care to learn... Heh...",
				"added": 1596315870
			},
			{
				"comment_id": 19,
				"body": "Also... For your reference...\n\nChart linking all the suspects together... Illuminati co-conspirators used to rule the world...\n\nhttps://tinyurl.com/y2z8pw4c\n\nCryptography and Anonymity allowed people such as myself to expose them though. .\n\nThus why most of them are being investigated extensively and many are actually on trial or will be soon enough... God wins... Every time..",
				"added": 1596316301
			},
			{
				"comment_id": 21,
				"body": "> [zaron](#comment_163_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Swine flu killed maybe 500k\n\nCan you elaborate on how this is at all relevant to the discussion instead of leaving it up to everyone to guess? Are you insinuating that it is obvious thay what is occurring in the US is obviously a part of a \"conspiracy\" against the American people since other diseases that actually threatened significant numbers of lives went without such fear mongering and manipulation of the truth by the Mainstream Media? If so, then I agree seeing as I have been banned from the majority of American Social Media Platforms now since this all started (not that I wasn't on a regular basis for speaking nothing but the whole truth before, but now the government wants to classify \"conspiracy theorists\" as \"domestic threats\" in the US which is a MAJOR VIOLATION OF HUMAN RIGHTS!)",
				"added": 1596341880
			},
			{
				"comment_id": 22,
				"body": "When a government attempts to convince their citizens that the logical and rational thinking of these citizens' peers that is RIGHTFULLY in opposition to what is being done to the citizens as a collective is reason enough for those who question the established authorities' ethics and morality to be put under greater surveillance and/or put into detainment, then you have immediately crossed the line from a free country into a dictatorship in my opinion. \n\nBut, hey... Who am I right?",
				"added": 1596342224
			},
			{
				"comment_id": 23,
				"body": "> [legends](#comment_2_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9): I have the main idea who expose the COVID as the conspiracy theory, this video used indonesian language, but inside this theory, of course it takes from the main sources https://youtu.be/vNe9p4EihXo\n\nVery good they have known how to prevent and treat this for 15 years at least without need for a \"vaccine\" anyway. It is not a conspiracy theory so much as fact that is being put down as a myth even though many medical doctors who are being censored in my country say otherwise.",
				"added": 1596342344
			},
			{
				"comment_id": 24,
				"body": "> [legends](#comment_3_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9): so the point is, everything you see about COVID just the DRAMA you know... and they want control us\n\nYES! EXACTLY MY POINT TO EVERYONE DOUBTING WHAT WE ARE SAYING! :)\n\nThank you!",
				"added": 1596342420
			},
			{
				"comment_id": 25,
				"body": "OTB-Technologies.com for more uncensored news and social networking opportunities.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596344789
			},
			{
				"comment_id": 26,
				"body": "> [175357192](#comment_2_1313wn64xgAbAnhWkHxP3bSi2S9cqofAXU): It's real name is Wuhan Flu!\n\nYou mean the Kung Flu? xD",
				"added": 1596347952
			},
			{
				"comment_id": 27,
				"body": "> [175357192](#comment_2_1313wn64xgAbAnhWkHxP3bSi2S9cqofAXU): It's real name is Wuhan Flu!\n\n> [otbtechnologies7](#comment_26_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): You mean the Kung Flu? xD\n\nFurthermore, all jokes aside, I am going to assume you are promoting the fact that its caused a communist and socialist uprising in the USA. Many people are saying the real virus is this false sense that the Democrats and Leftists have instilled in our country's unwitting citizens which is the thought that the only way to fix this situation is through communistic practices and systems of governance. Its based on their party's means of controlling people and its sick and twisted. That is (again) why the majority of their longtime proponents and their extremists are currently going through the legal system to some degree or another on a federal level. \nThe vast majority of the Democrats are criminals that have been being funded by international crime rings that harvest organs and sell children into sexual slavery. Whack yo...\n\nNow they got George Soros to rely on instead I guess lmfao! xD xD xD",
				"added": 1596348419
			},
			{
				"comment_id": 30,
				"body": "> [adrenochrome](#comment_23_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): There are Rockefeller Papers from 2011 that are describing our plandemic to it's tinest details... but of course, this is just coincidence :)\n\nRockefeller... Hmm...\nThose the same Rockefellers who created the General Board of Education which went on to standardize education as they saw fit? The same ones who are so closely affiliated with the people who write the school books which seem to leave out important historical facts which always seem to \"coincidentally\" not fit the narrative of the globalist? Those Rockefellers? No. No way... :P",
				"added": 1596368022
			},
			{
				"comment_id": 31,
				"body": "Another good one for you all:\n\n🔗 https://bittube.video/videos/watch/05f2cc56-c4b2-4910-9a11-13af10132351\n\nThese doctors are being silenced by the Mainstream Media (which, Again, is controlled by the left) and they are the ones we should be listening to about all of these matters. \n\nWhy are we listening to politicians and a SINGLE \"disease expert\" on these matters? \n\nHave we all absolutely lost our minds? \n\nDo we not understand the ramifications of policians being in charge of this response effort?!?!?\n\nPlease people, have some common sense now...",
				"added": 1596372905
			},
			{
				"comment_id": 32,
				"body": "> [pmme](#comment_1_1GmDHX8aPhRt7KMDerxHAAWY7JXeAw8RPy): For all who actually asked that question, expecting no conspiracy theories, It actually stand for Coronaviridae, which stand for ¨crown virus¨ due to its form cause by the lipoprotein envelope with his club-shaped projections. The classification number 19, is belonging to the year it started to have been reported.Here´s one scientific paper explaining the family of the coronaviridae (SciHub it if you want) : https://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/coronaviridaeAnd here´s the genome constitutions from other viridae of that family.https://www.ncbi.nlm.nih.gov/genomes/GenomesGroup.cgi?taxid=11118\n\nWhat in the absolute fuck does this actually have to do with the OP's intended topic of, \"are we being tricked by the powers that be?\"\n \nThat's right... It doesn't... \nSo, please, kindly fuck off Sir. Thanexpects\n(No offense intended. My target audience is the America public though who expects such speech from me being that I am one of their leaders... :(... Sigh)",
				"added": 1596378984
			},
			{
				"comment_id": 33,
				"body": "\"Thanexpects\" was supposed to be \"thank you,\" but autocorrect derped lol",
				"added": 1596379035
			},
			{
				"comment_id": 34,
				"body": "> [jklq](#comment_1_1HARVrgJ83KPXeQgxn2jvvTxmxt2yh7xT9): No, covid is real.\n\nNo one said it wasn't moron.",
				"added": 1596392054
			},
			{
				"comment_id": 35,
				"body": "> [jklq](#comment_1_1HARVrgJ83KPXeQgxn2jvvTxmxt2yh7xT9): No, covid is real.\n\nWhat was said is that there is a cure.\nThat the government is taking advantage of people, and that they don't actually care about their citizens.",
				"added": 1596392144
			},
			{
				"comment_id": 36,
				"body": "> [zaron](#comment_165_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Not true. Vaccines save lives. They're prolly why you're still alive\n\nVaccines in the classic sense can be immensely useful, yes. But, the COVID vaccine that Gates is invested in is technically illegal because it manipulates the human genetic structure which can lead to devistating side effects a few generations down the road. For all we know the geneticists are designing it to make us all retarded as a species so our children and every generation thereafter won't be able to think for themselves like we can since we are all here on ZeroNet. It takes leadership to stand up for ones rights too; maybe they'll secretly target those genes in some way too? We don't know what they are up to bud. But, we do know that Covid is easily treated with HCQ and has very mild symptoms in the majority of people. We also know that they are extending the lock downs and restrictions much more than necessary. This whole ordeal was only supposed to last a couple of months at most. They are being dramatic now. Why? For the fact that they enjoy the control it gives them. \n\"Power corrupts. And, absolute power corrupts absolutely. Most great men are bad men.\"\nThis all ties back to the Rothschilds.\n\nRead more pal; also check this out: https://tinyurl.com/y2z8pw4c\n\nThe criminals will be in prison soon enough.\nOr, maybe they will just end the world with some nukes and head to their fortified underground cities they've been quietly building since the second world war lol. Read. Read. Read.",
				"added": 1596432861
			},
			{
				"comment_id": 38,
				"body": "> [pmme](#comment_3_1GmDHX8aPhRt7KMDerxHAAWY7JXeAw8RPy): I´ve answered OP question, being the actual signification of the COVID-19 name signification, and if their exposed theory was true, which isn´t.\n\nOh, my apologies. I thought you might have just been a troll of sorts. I can tell there is a mild language barrier here now. Sorry again.\n\nYou read the post one way and I read it another due to differing viewpoints on the matter it would seem. I view the big picture whereas you see the details I think maybe. That's why I manage a business I founded instead of being a doctor like I originally wanted when I was 18 I guess haha\n\nAnyway, thanks for explaining! :)\nHave a good day!",
				"added": 1596446434
			},
			{
				"comment_id": 39,
				"body": "Please do note that citizens around the world are actively fighting against the globalists agenda though and many globalists are currently on trial in the United States or will be soon for their being linked to a huge international crime ring.\n\nThe media here says that is conspiracy too, but court documents indicate otherwise. And these same platforms are censoring many of our doctors now. So think of that as well.",
				"added": 1596446579
			},
			{
				"comment_id": 40,
				"body": "Censoring people like me who promote freedom and the country's medical professionals is a good indicator that communism is coming. There is a huge resistance to it though and many speculate civil war being likely which our government has been preparing for over the past 10 years. What did they know was going to happen that we did not prompting them to stock so much stuff in preparation?",
				"added": 1596446713
			},
			{
				"comment_id": 41,
				"body": "The CIA is pretty nifty. :P",
				"added": 1596446758
			},
			{
				"comment_id": 57,
				"body": "> [roadisroad](#comment_1_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh): WTF this is not true at all.I have lost 2 of my best friends because of COVID.People like you are fucking delusional.Jesus.\n\nWhat? Covid is real. No one said it isn't.",
				"added": 1596502541
			},
			{
				"comment_id": 58,
				"body": "Read more please friend.\nDo not be angry.\nAmerica is under attack right now by communists, and our media is censored.\n\nWhat country are you in?\nI will teach you what is going on from your perspective if you can tell me.\n\nOr join everyone else like me at https://OTB-Technologies.com",
				"added": 1596502643
			},
			{
				"comment_id": 59,
				"body": "I see many military planes now landing in strange places. So do many others but the media wont let us talk on US Servers anymore. It is bad.",
				"added": 1596502692
			},
			{
				"comment_id": 60,
				"body": "I always forget I have dedicated over a decade of my life to studying these things. What part doesn't make sense to you? Please help me understand.",
				"added": 1596503153
			},
			{
				"comment_id": 61,
				"body": "For example, this was literally emphasized by my history teacher in the beginning of high school the whole way through the course about the globalist. She had lived in countless countries and spoke 17 languages. How can you tell me I was lied to by my educator? It was never in the books which she made clear to us was because they set us all up to be brainwashed. She explained very well the truth. Then, the State took over that school and nothing was ever the same. Riots broke out and my family left the city. I am telling you man. I live here. Trust me.",
				"added": 1596503379
			},
			{
				"comment_id": 62,
				"body": "They completely altered the history lessons once the State took over from what I understand, but my family placed me in the beat schools in the country by choice. I have always had excellent grades and studied very well in college too. Why do you not believe this to be true? \n\nNow, in Chicago, they are trying to get the board of education to allow them to STOP TEACHING HISTORY. Why?... Heh. Silly that you cannot see.",
				"added": 1596503528
			},
			{
				"comment_id": 63,
				"body": "If you would like I can pull up the grades from mt history classes. But that only scratched the surface. I sat and watched history documentaries with my father and grandfather my whole life and read countless books outside of school too. I love history and know how government operates very well because of my family having been in it. \n\nPlease listen. :(",
				"added": 1596503657
			},
			{
				"comment_id": 68,
				"body": "> [roadisroad](#comment_5_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh): I didn't answer you.I know what you said.I answered the original post.\n\nOh ok. Sorry. My mind cannot think very well with all this stress anymore to be quite honest. I hate to admit; I normally do well under pressure, but this is a lot more pressure than usual. Thanks.",
				"added": 1596545532
			}
		],
		"1596264833_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 2,
				"body": "Expect rapid expansion soon as I have begun promoting it as a means of keeping history from being censored in the United States. My business sells products and promotes services that ensure freedom of speech and freedom of press for all human on Earth, not just those with large sums of money. This concept is welcomed by many and its popularity in and of itself is growing at a very rapid pace. \n\nHow rapid though? That I do not know; I am a entrepreneur, not a statistician lol :)",
				"added": 1596292356
			},
			{
				"comment_id": 9,
				"body": "Kapec I barely make money off of what I do; I pay myself less than minimum wage... Heh...",
				"added": 1596300197
			},
			{
				"comment_id": 10,
				"body": "I think maybe you are misunderstanding how American society works maybe... Just my 2 cents",
				"added": 1596300243
			},
			{
				"comment_id": 11,
				"body": "I have people tell me they feel like they are taking advantage of me because of how cheap my products and services are for common people and small businesses. I offer free information and free consulting. I am essentially a non-profit.",
				"added": 1596300324
			},
			{
				"comment_id": 12,
				"body": "So, you are telling me that you are against me utilizing my 10+ years of experience fighting Big Tech and Big Government corruption to make JUST enough money to feed myself?... Odd..",
				"added": 1596300552
			},
			{
				"comment_id": 13,
				"body": "Do you by chance live in a Socialist or Communist country?",
				"added": 1596301030
			},
			{
				"comment_id": 14,
				"body": "\"I think you've just answered yourself how american society \"works\".\nThat a man with 10+ years of skill and experience can barely feed himself.\"\n\nExactly my point! Thank you!\n\nAlso, I had a similar idea a little over a year ago, so i would love to see where this idea of your's goes as I feel it is brilliant!",
				"added": 1596310635
			},
			{
				"comment_id": 42,
				"body": "> [sub0dot](#comment_2_13WTgxm1m2GphnZETn1cpGhBJVCdNAKcxx): You pushed all my red political buttons but I don't have an argument against what you said.  :-)\n\nSo are you two insinuating socialism will save the world? 😮😮😮",
				"added": 1596496083
			},
			{
				"comment_id": 43,
				"body": "Lol - I am a libertarian; not really affiliated with either end of the spectrum. Just want people to wake up, do whatever they do, stop destroying the country, and fix the system. Its pretty fucking easy if people would just listen to each other lol!",
				"added": 1596496233
			},
			{
				"comment_id": 44,
				"body": "I do side more with the right with regard to their belief that constitutional rights need to be upheld. So... There's that... But, I am more of a libertarian technocrat for the record. Hehe ;-)",
				"added": 1596496303
			}
		],
		"1592950813_1PGtPmD5NAWpf4kaEB1qquveCN8S4LUqrq": [
			{
				"comment_id": 3,
				"body": "... Thanks for bumping my facts...\n\nWould you like to read a college level dissertation on the matter? Lol.... Mariana's Web is just a misnomer...\n\nBecause I have one them right in front of me... \nSo... Yeah....",
				"added": 1596293015
			},
			{
				"comment_id": 4,
				"body": "... Thanks for bumping my facts...\n\nWould you like to read a college level dissertation on the matter? Lol.... Mariana's Web is just a misnomer...\n\nBecause I have one them right in front of me... \nSo... Yeah....",
				"added": 1596293241
			},
			{
				"comment_id": 5,
				"body": "Further Eurocom has written in the matter...\n\nAlso the NIST is developing the technologies required for its existence as well...",
				"added": 1596293379
			},
			{
				"comment_id": 7,
				"body": "Lastly, don't call me a degenerate; I am a Patriot who believed in the Constitutional Rights of the American people and the Bill of Rights. Both of which I help protect through my business which promotes anonymity, information security, and decentralization.",
				"added": 1596294497
			},
			{
				"comment_id": 8,
				"body": "Believes* (present tense; autocorrect... Apologies...)",
				"added": 1596294543
			}
		],
		"1596269492_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 6,
				"body": "Very true!\n\n#Duality",
				"added": 1596293944
			},
			{
				"comment_id": 28,
				"body": "> [zaron](#comment_164_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): So basically trust no one. Not even yourself. Got it\n\nThat isn't at all what was said...\n\nNot sure why you are choosing to be a wise guy about what OP said...\n\nHis message is important: be careful who you trust and what you are doing because your actions may come back to bite you in the ass tomorrow even if it seems like a good idea today... I actually elaborated greatly on this topic in my book on Anonymity and Freedom of Press/Speech that I hold a copyright on... Its very relevant in these areas; its a mindset all of us should be in due to the nature of what we are doing... \n\nWe are political activists and should act with a sense of the fact that there are many adversaries on here as well as like minded peers...\n\nWell, maybe you are not based on the fact that you lack such an understanding, but many of us on here are and my point remains...\n\nThank you for your time child :)",
				"added": 1596349911
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 20,
				"body": "> [lovedarkness](#comment_1_1Lf5ghhXxuHpxkMXrFjc9G22e2XzpqJ6B4): I feel like all VPNs are bad in theory. You should rent out a VPS with bitcoin and use it as VPN privately\n\nOnly problem there is if an investigator uses Chainalysis to link you to the purchase or the VPS provider exposes your IP to your adversary then you are fk'd... However... Connecting to Tor via an obfs4 proxy prior to connecting the VPS provider and also utilizing monero mayyyyy help mitigate such risks... Idk much about much, but I do know much about InfoSec and Anonymity... Hm...\n\nNow you have me thinking....\n\nHmm.....",
				"added": 1596317353
			},
			{
				"comment_id": 29,
				"body": "> [jeancharlatan](#comment_2_17LwqmdXGhvTyRMvsjfogExmfqQaUrnSym): BTW. I agree with your way of combining tor with a good VPN!\n\nJust saw this; thank you for backing me on this sentiment! :)",
				"added": 1596356419
			}
		],
		"1596397002_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 37,
				"body": "Thank you.",
				"added": 1596436474
			}
		],
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 45,
				"body": "> [robione](#comment_577_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): We know who Q is..  or at least part of the team, Austin Steinbert & the DIA.\n\nDo you? Lmfao!\n\nhttp://wootva.com/2020/04/07/austin-steinbart-rejected-by-the-q-movement-now-arrested/",
				"added": 1596496479
			},
			{
				"comment_id": 46,
				"body": "Dude got arrested for impersonating Q haha",
				"added": 1596496504
			},
			{
				"comment_id": 47,
				"body": "Anyway... Military Intelligence has now replaced the CIA because... Well... To summarize... Trump :)",
				"added": 1596496550
			},
			{
				"comment_id": 48,
				"body": "> [robione](#comment_578_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): nah that was the FBI not liking him.. they have nothing on him. Just harassment.\n\nOh ok. Well when the FBI releases their Intel on me I hope you say the same! Because they really didn't know how to respond to me when I broke the entire Deep State down for them right to its core then asked for their names or at least badge numbers. Haha :)",
				"added": 1596496880
			},
			{
				"comment_id": 49,
				"body": "> [robione](#comment_578_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): nah that was the FBI not liking him.. they have nothing on him. Just harassment.\n\nP.S. they refused to answer me and left my house with a look of terror in their eyes :)",
				"added": 1596496917
			},
			{
				"comment_id": 50,
				"body": "Anyway.... Lalallalaa what was I doing? Hehe ;-)",
				"added": 1596496940
			},
			{
				"comment_id": 51,
				"body": "https://tinyurl.com/y2z8pw4c",
				"added": 1596497069
			},
			{
				"comment_id": 52,
				"body": "#HackThePlanet\n\n#Lulz ^_^",
				"added": 1596497455
			},
			{
				"comment_id": 53,
				"body": "Fucking... Scuuuuuum!\n\nhttps://dcdirtylaundry.com/hundreds-charged-worldwide-in-takedown-of-largest-child-pornography-website/",
				"added": 1596498271
			},
			{
				"comment_id": 54,
				"body": "Checkmate",
				"added": 1596498764
			}
		],
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 55,
				"body": "Not sure what you mean by this...\n\nYes communism fails in real life implementation, but can exist in theory true. Communism is dependent on outside capitalism, so communism \"out of a lab\" is impossible. True.",
				"added": 1596502153
			},
			{
				"comment_id": 56,
				"body": "Glad I have you thinking though. The US military appears to be readying themselves for a massive uprising. So how it is handled will depend on which side wins. Only two options really. Well... Three maybe... All bad though. :(",
				"added": 1596502484
			}
		],
		"1596498919_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 64,
				"body": "0list.bit and kaffeine.bit are search engines. \n\nHave you tried them yet?",
				"added": 1596506719
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 65,
				"body": "Panama Papers, Snowden Leak, and now exposing the Epstein criminal enterprise that links back to the Rothschilds. I would say more, but I do not know who exactly to trust now. It seems that the military is getting ready for something huge as far as civil unrest is concerned.",
				"added": 1596533837
			},
			{
				"comment_id": 66,
				"body": "Also the fact China is ready to declare war on the US is concerning which no one in the US was told about. Heard of it through a South American friend, and a month later read of it in the UK news back in April/May. Now, they have no one actually reporting in China so we do not know what they are doing anymore. No one believes me though except my friends in Europe because all of our social networking sites have been censored as of last week.",
				"added": 1596533968
			},
			{
				"comment_id": 67,
				"body": "So now no one can openly speak anymore.\n\nThere are many protests not being covered by the media about the exposed Epstein Network, but absolutely no one is covering it but me and a handful of other independent journalists.\n\nNow, the protests in Europe where slightly over a million people said \"no more unlawful lock down\" to their respective governments is being covered up by the media too. The media keeps suppressing the truth and trying to make the President appear to be worse than he actually is, but the President is the only one being truthful outside of those of us who have been banned from the social media sites. \n\nBut barely anyone will believe is; our own people saying this is all the President's fault will lead to a weakened nation that will easily subcumb to attack by a foreign nation such as China if war is initiated. Being that the US is a world power that has historically kept peace and order, the end result would be worldwide anarchy then take over by the Chinese Communist Party. Those who know what I am talking about say \"its a lost cause,\" but I have faith in God that something may save the world from this fate.",
				"added": 1596534302
			},
			{
				"comment_id": 69,
				"body": "> [styromaniac](#comment_2516_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You could trust me as a person, but with infosec I'm probably underprepared compared to you. [...]\n\nI trust you. I am here to protect the Constitutional Rights of Americans such as you. Not everyone was born into the same circumstances that I was which required me to acquire such knowledge. \n\nThank you for your response.",
				"added": 1596547964
			},
			{
				"comment_id": 70,
				"body": "> [eltheal](#comment_61_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): get on zerome, i want to follow people from latin america and other regions\n\nI may not be in Latin America, but I have two connections there. Add me on ZeroMe if interested. Thanks.",
				"added": 1596606328
			},
			{
				"comment_id": 76,
				"body": "> [0mega](#comment_4_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): most of us here are Americans. We also HATE that fat fuck trump\n\nThe only people I know that hate Trump as far left anarchists, communists, socialists, or just flat out morons who refuse to look at facts because they are biased against Trump as a person instead of looking at what he has done and continues to do for our Great Nation of America.\n\nI would not call him \"God-Emperor\" by any means though lmfao! 😂😂😂",
				"added": 1596970391
			},
			{
				"comment_id": 77,
				"body": "I mean, there is also the fact that the only other viable candidate is extremely racist and wants to turn the United States into a Communist Paradise. So, I mean, if you're into that then by all means vote for Biden. But, I and most other Americans, enjoy our Constitutional Rights and the police being able to protect us when we sleep at night. Just my 2 pence mate.",
				"added": 1596970579
			}
		],
		"1596608855_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 71,
				"body": "Link to video here: https://www.bloomberg.com/news/videos/2020-08-05/bill-gates-says-tiktok-s-u-s-data-safe-with-microsoft-video",
				"added": 1596608901
			},
			{
				"comment_id": 78,
				"body": "... Well... Yeah... Lol\n\nThat's why the government hasn't banned Windows yet or made Microsoft pay for its privacy law violations whatsoever.\n\nIts always worked like this and its why people like me who have run Linux since our adolescence are put on watch lists by the Intelligence Community.\n\nThe Intelligence Community has a love hate relationship with me specifically after our last conversation, so they leave me alone as long as I don't raise any hell. I make it next to impossible to gather intelligence on who I really am and what I am really doing, so I don't care what they do as long as they continue to leave me the fuck alone.\n\nThis was more to bring it to the forefront of people's minds that Gates will now be adding cellphones to the list of devices he gathers Intel on. Its significant because Windows Phones failed, but Tiktok is super popular. This is giving Gates double the power if not more in some senses that he had prior. Just a heads up is all. \nThanks for the input though!",
				"added": 1596970981
			}
		],
		"1596593236_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 72,
				"body": "Nitrous oxide is an inert gas produced as a side effect of the use of nitrogen based fertilizer. Kno3 is an ingredient in some fertilizer that is also a strong oxidizer used to make explosives. But, all reports indicating this was intentional from the information. I have gotten so far. MSM cover up...\n\nPay attention in chemistry class and stay in skewl kiddos :)\n\nElse you will become a sheep hehe :P\n\nhttps://pubchem.ncbi.nlm.nih.gov/compound/Potassium-nitrate",
				"added": 1596717949
			}
		],
		"1596649883_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 73,
				"body": "> [zaron](#comment_168_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Must be something fucky. Noscript keeps blocking all kinds of shit\n\nOpen in a Sandboxed VM then lol :)",
				"added": 1596728182
			},
			{
				"comment_id": 79,
				"body": "> [0mega](#comment_2_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): right wing trump tiny dick sucking content. Stick to fox news and infowars ya fucking piece of shit. When trump is assassinated don't cry too much, shit fly\n\nDude chill with the anti trump posts.\n\nThey are annoying and contribute absolutely nothing productive to any of the threads you have posted in. Did you even check the site he posted out?! There are plenty of people against Trump on there too dude. WTF is your major malfunction?",
				"added": 1596971163
			}
		],
		"1596795113_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": [
			{
				"comment_id": 74,
				"body": "Agreed adrenochrome. Thus the reason I am here now lol",
				"added": 1596839262
			}
		],
		"1596824289_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 75,
				"body": "Cool. Shoutr is like half of my idea. The other half is make it super popular and have it turned into a mesh network that becomes decentralized internet like ZeroNet. Came up with it last year at work when I was bored lol :)",
				"added": 1596853087
			}
		],
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 80,
				"body": "Just got a report from a gentleman in China that this is fake news... So yeah...? Lol\n\nAdding zdnet to my list of unreliable news outlets...",
				"added": 1597040433
			}
		],
		"1597034762_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 81,
				"body": "... Didn't the fake news make Trump out to have said something like what the OP said like... 4 months ago.... I mean funny is funny either way, but I am pretty sure Trump supposedly made this joke first...",
				"added": 1597040586
			},
			{
				"comment_id": 83,
				"body": "This is the equivalent of what we had back in the day for a meme going around, \"Go huff raid!\"",
				"added": 1597053353
			},
			{
				"comment_id": 84,
				"body": "Back before they censored the American internet lol",
				"added": 1597053368
			}
		],
		"1596985537_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": [
			{
				"comment_id": 82,
				"body": "PHP does not work with ZeroNet so not in the traditional sense, but as a tech savvy business person I can think of other ways to go about it.",
				"added": 1597040713
			},
			{
				"comment_id": 86,
				"body": "> [edgelordofdecent](#comment_624_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Maybe someone in the future will make one.\n\nSeems likely.",
				"added": 1597105504
			}
		],
		"1597067285_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 85,
				"body": "Well for starters, you are using Windows lol :P",
				"added": 1597070099
			}
		],
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 87,
				"body": "> [gomzik](#comment_8_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Hello from Belarus...\n\nGreetings from America!\n\nI have been trying ti reach out to someone from Belarus as I have just learned what is going on there and I specialize in circumventing such restrictions as those you all face right now!\n\nFeel free to email at otbtechnologies@protonmail.com or contact me here using ZeroMail perhaps. \n\nLet me know; I want to help! :)",
				"added": 1597180701
			},
			{
				"comment_id": 89,
				"body": "> [marcusfinch](#comment_8_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): Oh I thought of something else.  On the PC zeronet will use TOR to connect to some peers (you can also force it to use TOR for everything).  I don't know what is done on Android.  It may be the PC is working because it's using TOR to connect to peers. [...]\n\nThis is unlikely the root cause of this user's issues. Tor is not used by default on Android app. It is likely a block of the ZeroNet Network on the network layer rather than anyrhing else, and thus it would be wise to use Tor to connect to obfs4 proxy to p revent DPI by government then connect to ZeroNet. Though based on what I know is being down in Belarus, this maybe not possible even yet...\n\nhttps://www.wired.com/story/belarus-internet-outage-election/",
				"added": 1597188077
			},
			{
				"comment_id": 90,
				"body": "> [gomzik](#comment_11_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Thanks for ypur's help, will check some solutions, but for now goverment unlocked an Internet connection. For now at least\n  \nOther possible solutions: Use VPS or RDP connection to server outside of Belarus in privacy respecting jurisdiction and pay with cryptocurrency such as Monero for anonymity purposes. Or, perhaps using an Elite SOCKS5 Proxy for all of your computer's internet traffic. \n\nThese two alternatives may work, and also are more inconspicuous. Good luck!",
				"added": 1597243997
			},
			{
				"comment_id": 91,
				"body": "> [gomzik](#comment_12_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): In the moment of total blocking, ssh tunnels was not working :( Guess, that it will not help if it repeats\n\nHmm, I wonder if this was a specific block for all connections on port 22 or if there was some other mechanisms involved. Very curious.\n\nThe situation in Belarus is what I thought may be possible to happen in the United States the way things were heading here. I drew a blueprint for a decentralized internet that would use cellphones, routers, laptops, and other WiFi enabled devices last Summer and found a nice project in Germany known as Freifunk (German for Free Radio) that is similar and gaining much popularity. It also supports connection to the wider internet like my concept does, but they do not involve anything except routers. So, perhaps it would be something to look into for you as well. \n\nThere are many small groups that run the Freifunk Networks in various cities (primarily in Germany at this time,) but they have offered to help me establish similar networks here in the USA. They should be more than willing to help you all as well I am sure. The main website for them is here:\n\nhttps://freifunk.net/en/",
				"added": 1597329501
			},
			{
				"comment_id": 92,
				"body": "Hmm, I wonder if this was a specific block for all connections on port 22 or if there was some other mechanisms involved. Very curious.\n\nThe situation in Belarus is what I thought may be possible to happen in the United States the way things were heading here. I drew a blueprint for a decentralized internet that would use cellphones, routers, laptops, and other WiFi enabled devices last Summer and found a nice project in Germany known as Freifunk (German for Free Radio) that is similar and gaining much popularity. It also supports connection to the wider internet like my concept does, but they do not involve anything except routers. So, perhaps it would be something to look into for you as well.\n\nThere are many small groups that run the Freifunk Networks in various cities (primarily in Germany at this time,) but they have offered to help me establish similar networks here in the USA. They should be more than willing to help you all as well I am sure. The main website for them is here:\n\nhttps://freifunk.net/en/\n\n(sorry if this is a repeat post, but ZeroNet showed content was not published to peers last time.. Thanks.)",
				"added": 1597329632
			}
		],
		"1597175618_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 88,
				"body": "Well, in any case, there would have to be a server of sorts which would be you. I am not sure I understand the concept. Please elaborate. \n\nThanks!",
				"added": 1597180854
			}
		]
	},
	"comment_vote": {
		"36_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"2_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"3_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"4_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"8_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"25_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"9_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"24_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"21_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"19_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"18_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"17_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"16_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"15_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"23_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"22_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"27_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"10_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"11_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1_17LwqmdXGhvTyRMvsjfogExmfqQaUrnSym": 1,
		"23_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"17_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": 1,
		"2_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY": 1,
		"5_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"8_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"4_1BENL8PHjhjDfxRsN2CHW7kvrVnCF3DQpS": 1,
		"27_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"2_13WTgxm1m2GphnZETn1cpGhBJVCdNAKcxx": 1,
		"15_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"52_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"16_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"15_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"53_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"17_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"54_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"18_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"51_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"48_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"49_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"50_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"578_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"2_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"6_1J6U7uZyNHj7BJEDHY7QfJL1V1SFQhZ7pJ": 1,
		"4_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"7_1J6U7uZyNHj7BJEDHY7QfJL1V1SFQhZ7pJ": 1,
		"1_1NxRfyH3VwfShQUUgf2AmduwdNHJyH2QN1": 1,
		"5_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"2516_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"166_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"63_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"93_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"92_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"91_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"39_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"25_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"772_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_13UCwDiba2JF2vzHwGbCZzMQtu1PwYaTVP": 1,
		"1_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": 1,
		"169_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"3_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": 1,
		"623_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"2_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": 1,
		"21_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"14_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": 1,
		"89_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"624_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"8_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"12_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"22_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"11_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"11_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"13_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"23_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"14_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"12_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1
	}
}