{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565164789,
			"title": "This is very disruptive technology.  Heres to its continued development and growth.",
			"body": "As the topic states.  While certain parts of it can be better polished, the core idea behind this is brilliant.  This is the start of something big.  It is relatively unknown now because most people don't see a \"need\" for it at this point.  As that need becomes more apparent in the near future, this will take off.  I'm looking forward to watch ZN transform into a benevolent Skynet.",
			"added": 1565164788
		},
		{
			"topic_id": 1565321266,
			"title": "Spam has officially started on 08chan.... we need to start exploring countermeasures.",
			"body": "Check out qresearch and pol, they are currently being flooded.  Someone is posting jibberish, changing identities, and posting more random words.  Whats funny is this was posted on ZeroTalk a few hours ago as a potential vulnerability.\n\n08chan root link:\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/\n\nPersonally, I'm not mad at the person doing it.  I think he is doing a good thing.... he is forcing us devs to find a solution for this.  ZeroNet is some awesome technology, but the truth is there are few if any measures to stop against network/communication sabotage through bad actors.  What this individual is doing is exposing one of the weakest points of the system.",
			"added": 1565321264
		}
	],
	"topic_vote": {
		"1565137205_1EmXUHrKz9T4VmN3cSeSUqpymjN9ABXwzp": 1,
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1565164789_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1565188740_1JpWZr3hPmL8cYSKQCzuqUyhG25UuQsjPh": 1,
		"1565252472_1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": 1,
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": 1,
		"1565314153_1Cx3BTrQckf6v9Hm9KSAJxztGxqoTwAT4m": 1,
		"1565318502_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": 1,
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565321865_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": 1,
		"1565324173_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1,
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1565330984_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1562989255_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1565444879_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": 1,
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 66,
	"comment": {
		"1565137205_1EmXUHrKz9T4VmN3cSeSUqpymjN9ABXwzp": [
			{
				"comment_id": 1,
				"body": "Just got here myself.... never knew about Zeronet until today.  Very cool concept.",
				"added": 1565137414
			}
		],
		"1565148747_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 2,
				"body": "The technology is still being developed anon.",
				"added": 1565157193
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 3,
				"body": "My counter-offer:  lets all calm down and stop releasing cortisol, and retain the right to say nigger.  We're all on the same team here.",
				"added": 1565164340
			},
			{
				"comment_id": 4,
				"body": "> [nickwa](#comment_217_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): It died down significantly after all the 8chan people got freaked out that the site was \"make by FBI to lure people in\", and \"Q said not to go here\". So you have tweets of people literally formatting their HDD in fear(I dont blame them cause of the CP, but its not a FBI thing, just a chan thing in general)\n\nWhats funny is that if they read the documentation and read how ZN works, that would have never been an issue in the first place.... its not much different than people being scared away from TOR entirely because of some bad sites.",
				"added": 1565164425
			},
			{
				"comment_id": 8,
				"body": "> [sadloli](#comment_2_1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT): Pedos aren't even that bad, the ones I've seen here(and most I've came in contact with in general) seem to be pretty alright guys.Honestly, I would let my daughter go out with 10 pedos before I would even consider letting one of those retards anywhere within a 100 foot radius of her. Because even the most vile pedo in this universe wouldn't be able to make her as fucked as these guys would!\n\nSometimes I wonder if posts like this are serious, or meant to generate a reaction.",
				"added": 1565168450
			},
			{
				"comment_id": 18,
				"body": "Everyone say hi to Kelly Weill, this conversation was mentioned in a recent Daily Beast article:\n\nhttps://www.thedailybeast.com/8chan-refugees-worried-theyre-downloading-child-porn-on-peer-to-peer-site-zeronet",
				"added": 1565289220
			}
		],
		"1565145631_1CDMTFbMEyBmGDW8eWUSZXQkca2VuvyN2p": [
			{
				"comment_id": 5,
				"body": "The Python modules I looked at all looked good at least.  If a module is in this condition, its a good starter PR.",
				"added": 1565165107
			}
		],
		"1565148429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 6,
				"body": "> [nickwa](#comment_220_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): ...nobody using ZeroNet.\n\nThis is sortof a variant of that question of which came first... the chicken or the egg.  You need people to drive interest, and you need interest to drive people.  08Chan helps.  The lowest hanging fruit to get more people IMO would be to reform groups of people kicked off of traditional social media sites.  Websites with unique and valuable information are good as well.  Some people just have to take the leap in the beginning, and create content even if there is no one initially there to see it.",
				"added": 1565165708
			},
			{
				"comment_id": 7,
				"body": "> [bigbadbob](#comment_15_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): i hear ya,  most people dont even know what linux is.  They eat what they are fed.  I think this 8chin thing will help spread the word no doubt but these things are totally suppressed.   The concept of privacy is suppressed.  The corporations try to suppress open source projects until they can monopolize on them.   open source has no promo with the lack of budget.    When i try to spread the word its like people have some sort of cognitive dissonance and what i say does'nt line up with what the tv told them.\n\nI think the truth to that is this technology isn't meant for everyone.  There is a small demographic of people who this is targeted at.  Most if not all of us can see the trajectory of free speech on the normal internet, and as a result our infrastructure for communication must become more sophisticated.  As cool as the concept is right now, its still in its infancy.  A lot more functionality and systems will be added to it as time goes on.  We are the early adopters who see the potential in this.  What we want this to become is intrinsically part of its growth process as it matures as a project.  More people understanding and appreciating what ZeroNet is will come as it grows.",
				"added": 1565167876
			},
			{
				"comment_id": 10,
				"body": "> [bigbadbob](#comment_17_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I personally feel its a second chance for the internet.  I am very excited with zeronet and decentralization.   I just have a strong negativity bias when it come to the powers that be and the ways they try to keep things down until they can gain control of it.  I feel bad to think of all the people in the past who create something amazing just to get screwed by some big corporation.\n\nThe one thing the smaller entity always has an advantage over is speed.  There is little to no red tape or bureaucracy to slow you down, and there is no giant apparatus you need to redirect.  There are a lot of VERY intelligent people attracted to projects such as these.  When you get groups of people such as that to passionately focus on a central goal, the output can rival that of major corporations.  Things are heating up more and more where you'll see such collaborations occur more frequently.\n\nAdd to that the fact that decentralized projects like this are vastly more difficult to stop, despite how much governments/large entities may despise them.  BitTorrent has been going for what, 14-15 years now?  And its been public enemy #1 for several giant industries.\n\nI guess what I'm trying to say is that everything will be fine.  The genie is out of the bottle, and there are a lot of things in motion to make the internet (and by extension the globe) a better place.  We're in the middle of a holy war for the control of information, and despite what you may be believe, we have the advantage here.",
				"added": 1565169823
			},
			{
				"comment_id": 48,
				"body": "> [saturniankvlt](#comment_1_1E6mnC7F4VYH7Lu8D8orf5ADaY1ZUDMrVP): do not forget the reefer.. [...]\n\nI bet you most of these shooters breathed air too.",
				"added": 1565340770
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 9,
				"body": "yeet",
				"added": 1565168617
			},
			{
				"comment_id": 42,
				"body": "*test*",
				"added": 1565337370
			},
			{
				"comment_id": 55,
				"body": "*test*\n**test**\n=test=\n~test~",
				"added": 1565346180
			}
		],
		"1565197761_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 11,
				"body": "The fearmongering against the service is exactly why I'll have it running 24/7 into the future.  The more disruptive a technology is, the more you can expect this type of artificial reaction from shills.",
				"added": 1565201703
			},
			{
				"comment_id": 12,
				"body": "> [bigbadbob](#comment_24_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): The fear levels in the general population are at unseen heights.  Weaponized social media has people scared of their own shadows.  4chan had many threads saying this place is bad.   Mainstream media is like a psychological assault.What a time to be alive.  Ive never seen so many people scared who have done no wrong.\n\nDocumenting the shill's strategies and tactics over this would be an excellent case study for anyone wanting to learn more about modern day psyops.",
				"added": 1565205478
			},
			{
				"comment_id": 63,
				"body": "> [eightyfour](#comment_115_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): The amounts of disinformation coming from Qtards and antifa alike is incredible. So many posts saying \"ZN is malware\" and \"made by FBI/CIA/MOSSAD/etc. as honeypot\" or that \"everyone who installs ZN automatically downloads CP, so all 8ch soon vanned haha\" on social media. It's almost painful to see all of these tech illiterates think they know better. Honestly, I think that's a good thing. I don't want my precious ZN flooded with Qboomers and ecofascists. Also plz no leftypol, they're braindead morons too. [...]\n\nAnother point to that is they would probably play some influence on the direction of the project.  9/10 people here now seem to be quality.... best to have people like that as the userbase now as the key features and direction of the project are discussed.",
				"added": 1565404669
			}
		],
		"1565219322_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 13,
				"body": "Someone correct me if I'm wrong, but I believe we're merely using some of bitcoin's blockchain tech.  There are no transactions with bitcoins taking place during file transfer in the network; we are all volunteers doing it because we want to.",
				"added": 1565226240
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 14,
				"body": "Its also worth noting that creating a github alternative is on the ZN roadmap:\n\nhttps://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000#slide=id.g9a3b93883_1_32\n\nMaybe I just don't know enough about the API to create sites yet, but I REALLY wish server side languages such as Python could be used on backends.  It would vastly open up the capabilities and possibilities of sites hosted on here.",
				"added": 1565255753
			},
			{
				"comment_id": 64,
				"body": "Another worthwhile point to mention is we could always make our own fork of this, and update in parallel with it along with our own improvements.",
				"added": 1565430164
			}
		],
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 15,
				"body": "Can I be a non-hateful person and believe saying nigger is a great canary in the coalmine for free speech at the same time?",
				"added": 1565255873
			},
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_889_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): ... [...]\n\nGood post, and I agree with what you said.  I'm not here to have my current beliefs further validated by other people...  what I find interesting is academic/intelligent discussions about topics we aren't allowed to talk about (or at least not outside the parameters our 'leaders' enforce).... race, technology, alien life, the future, psyops, etc.  Partly because I find it very entertaining, and also because I'm seeking some \"missing pieces\" in my perspectives on the world, and I strongly believe that seeking esoteric knowledge on this topics give you the potential to gain a powerful unique perspective on the world, which you can benevolently impose on the world in powerful ways (inventions, creative writing, art... any medium that is created by your mind).  That is why I'm always drawn to the frontiers on the internet.... first on TOR, and now here.",
				"added": 1565257623
			}
		],
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": [
			{
				"comment_id": 16,
				"body": "Finer grain control over what parts of a website you want to seed.  Take 08chan for instance...  I have a lot of resources I'd like to dedicate to a select few boards, while at the same time not help host gay furry porn and whatever \"other\" stuff is posted.  I wish there was some simple automated way to support certain segments, while avoiding others.  There is an option to help seed the entire site with all future files, but it seems like you must blacklist every single board manually (out of hundreds) that you don't wish to help.\n\nThis seems like a no-brainer improvement to have.  Those with the ability to edit sites would have the power to break up the sites however and assign areas.  Conversely, on sites such as 08ch, a large checklist can be dynamically generated as available boards are created (or deleted).",
				"added": 1565257150
			},
			{
				"comment_id": 46,
				"body": "> [jamiedemon](#comment_8_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G): muting anyone who have joined zn after a specific date !\n\nAssuming there is some date created field for keys, implementing that would be trivial... although I don't know why you'd want to do that.",
				"added": 1565338907
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "> [nickwa](#comment_256_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): \"Even without the spotty reputation, Zeronet is harder to use than a conventional browser\"This is the funniest line I read. Like comon, ZeroNet is not that hard...\n\n\"They\" are using every millimeter they have to dissuade people from coming here.  All it takes is 5 minutes for someone to realize this new 08ch is in fact much more well-behaved and pleasant.  They did a decent job scaring some people away from ZeroNet, but how long do you think they can keep this up for?  If/when 8ch.net returns, there will be users from here who will participate there as well, and there will be threads from these people explaining and demonstrating not only is there nothing to worry about, but this is a superior option in many ways to protect against censorship and disruption.  Good luck stopping that, MSM and concernfag shills.",
				"added": 1565289527
			}
		],
		"1565287005_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": [
			{
				"comment_id": 20,
				"body": "> [filips](#comment_135_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): There are already file sharing sites on ZeroNet called ZeruUp and ZeroUp Unlimited.\n\nNice, but it badly needs functionality to separate and categorize content.  Some of the grosser stuff will go into the \"Adult\" folder, and on a service like this you shouldn't go near adult services with a 10ft stick.",
				"added": 1565289743
			}
		],
		"1565272923_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": [
			{
				"comment_id": 21,
				"body": "> [wejetheman](#comment_1_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U): It's not so much a technical problem with the software. It's an economics problem. There needs to be a way to pay for reliable long term hosting of content and people need to be willing to actually pay. Youtube wouldn't work either without money flowing through it in the form of advertisers and ads.\n\nDoes there?  I can't speak for others, but I'd gladly host accounts and content that I support and endorse, and would even go to the point of buying a dedicated hard drive for storing it.  I see it as \"giving back\" and wouldn't flinch at incurring small costs for doing so.  I just see the currency as something I'd never use.",
				"added": 1565290128
			}
		],
		"1565288635_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "You're assuming these people prioritize integrity over agenda.",
				"added": 1565292736
			}
		],
		"1565296763_1CJskzeMQsk8eHw8m4ZaF6bMhwxbPCwhNX": [
			{
				"comment_id": 23,
				"body": "y'all cant behave in here",
				"added": 1565299800
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 24,
				"body": "> [removeboomer](#comment_7_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): A user suggested something along the lines of \"we need a problem that's easy to solve for humans, hard to solve for computers, and easily verified by computers.\". Though the decentralized nature of it makes it pretty difficult.The fact that no one has solved the issue yet tells us that zeronets small userbase has insulated it from large spam issues. I saw the admin of 08chan talk time limiting ID creation, that would do the trick for now at least.\n\nPerhaps some kind of captcha/human verification?  I know AI is getting better at solving the hard to read letter/number ones, and there are services that automatically fill them out.  Perhaps something that asks random questions on things that require you to do light Googling to solve it.  For instance.... what date did ____ event occur (with dropdown menu for day/month/year), or the atomic weight of a certain element, or the CEO of a random large company, etc.  Adding another layer of complexity to it is something that requires some slight modification of the answer... ie, the day of ____ event minus 9 days, or the middle name of the main star of X movie, and now change the 2nd letter to the next letter on the alphabet.  Simple but slightly tedious tasks for humans that require a certain level of complexity that most/all captcha crackers (currently) cannot crack.",
				"added": 1565321972
			},
			{
				"comment_id": 25,
				"body": "> [zeronetanon4](#comment_24_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): [...]\n\nThis raises the barrier of entry for account validation.  It can be exploited through humans manually adding accounts, and having them lay dormant until a \"major event\" occurs in the world, and then all of the dormant accounts can be activated and begin spamming the boards.  Like you said removeboomer, rate limiting account creation could be one solution.  Accounts could require further validation every 1-2 weeks to prevent against a bad actor amassing a large amount of dormant accounts.\n\nSide thought- what would REALLY be nice for ZeroNet is to have a collaborative mindmapping program, or any kind of collaborative/teamwork software.  Planning and mapping things out would be much simpler, and this will be a major element of developing ZeroNet into the future.  Even though ZN is relatively quiet, I'm not going anywhere.  This will become huge as it continues to grow.",
				"added": 1565322349
			},
			{
				"comment_id": 26,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_675_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're afraid of the changes [...]\n\nThis is a fun challenge anon, I welcome it.  If you are the spammer, throw as much as you can at the sites.",
				"added": 1565322439
			},
			{
				"comment_id": 28,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_676_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're afraid of changes,but it's 'your deviance not mine' [...]\n\nConfronting things head on seems to be a strange way of demonstrating fear.  But by all means, continue what you're doing.  You're doing ZeroNet a huge favor.",
				"added": 1565323252
			},
			{
				"comment_id": 29,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_677_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): i told youtons of times'they would come' [...]\n\nlmao this guy",
				"added": 1565323856
			},
			{
				"comment_id": 30,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_678_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're a clown, and you even made some post for it. thanks for that, but don't worry 'plenty of yours will come' With Their Grandiose Socialist Ideals For Policing The Plateform'. You won't be the last for sure.\n\nYour attempts at communication degradation don't work when people know what you're doing lol.  Go open a Xanga ZeroTalk group and go be mysterious there.",
				"added": 1565324165
			},
			{
				"comment_id": 31,
				"body": "Whats transpiring below is also a good example of what can go wrong in a discussion.  It presents an interesting challenge to filter posts like that out and yet prevent such tools from interfering with relevant communication.",
				"added": 1565324495
			},
			{
				"comment_id": 33,
				"body": "> [tinktinktink](#comment_1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): [...]\n\nNah, you're doing us a favor even if it isn't your intention.  Its better seriously disruptive stuff such as this is confronted and fixed now than later down the road.  Decentralized technology is without a doubt the way of the future, and to make it work while still holding onto our ideas of information being freely transmitted is a great engineering challenge.  I don't know what the later iterations of this technology will become, but it will require some ingenious ways of functioning.  Thanks man, I'm enjoying solving this problem.",
				"added": 1565325489
			},
			{
				"comment_id": 34,
				"body": "> [zeronetanon4](#comment_33_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): PS- I thought the schizoposter was you at first.",
				"added": 1565325556
			},
			{
				"comment_id": 35,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_683_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): \"Decentralized technology is without a doubt the way of the future\" you can't be that dumb. [...]\n\nI'm sure you have some pretty good ideas then.  Here's your chance to share them and enlighten us.  :)",
				"added": 1565325650
			},
			{
				"comment_id": 36,
				"body": "> [tinktinktink](#comment_2_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): [...]\nThat's the crazy dude I was talking about lol.  As for your remarks on decentralization, all I can say on that is we probably can't rely on the decades old client-server model for system design.  My intuition tells me it can and will definitely work.  It will just need some fundamental changes to its approach vs traditional design.  Sometime this year I think I'm going to drop acid and think about this.",
				"added": 1565326085
			},
			{
				"comment_id": 37,
				"body": "> [removeboomer](#comment_12_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5): [...]\nI live for problems like this.  Its exciting to be on the bleeding edge of system/software design.",
				"added": 1565326169
			},
			{
				"comment_id": 38,
				"body": "> [tinktinktink](#comment_5_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): [...]\n/qresearch/ spam stopped at xx:37.  /pol/ spam stopped at xx:39.",
				"added": 1565326564
			},
			{
				"comment_id": 39,
				"body": "Its pretty impressive you were able to make something like that relatively quickly.  I started programming ~18 months ago with Python, I have a rough idea how you made some of it work.",
				"added": 1565326776
			},
			{
				"comment_id": 40,
				"body": "@tink",
				"added": 1565326786
			},
			{
				"comment_id": 41,
				"body": "> [tinktinktink](#comment_7_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): [...]\nCool, thanks for explaining.  I'll definitely toy with some of that soon.",
				"added": 1565327478
			}
		],
		"1565321865_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": [
			{
				"comment_id": 27,
				"body": "While limiting discussion to only text can be seen as limiting, in this context I think it is the best starting point to go with.  As others have said in previous threads, measures to block specific content can very much be a double-edged sword; those mechanisms could easily be turned around to limit other topics.\n\nAs for now, ZeroNet mostly requires programming knowledge to build and run communities.  With the exception of the blog creation page and ZeroTalk topics which are relatively primitive in capability, there isn't much out there.  With that said though, there is nothing stopping or preventing that from changing.... it simply hasn't been developed yet.  As cool as ZN is now, we can probably come up with a list of 20-50 additions and features that would increase its usability, convenience, and security by several orders of magnitude.  I don't mean to trash the devs working on this by saying that either, this is a massive undertaking.  Its going to be a longer term game growing this concept into its full potential.  The first thing we need IMO is a central base of operations on here to coordinate and plan continued development.  This includes an area for people to throw out suggestions (and possibly vote on them to determine priority), an area for devs to talk, a roadmap outlining features small and large, and more.  Sticking to simple applications to grow this will be a great impediment.  We'll need to either build this functionality in-house, use available Python libraries and build off of them to make web apps (if possible in this current ZN iteration), or use clearnet/tor sites and services.",
				"added": 1565323023
			},
			{
				"comment_id": 32,
				"body": "> [kaffie](#comment_929_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): [...]\n\nFor your first point, I was referring to CMS such as wordpress which would help with accessibility.  As for your subsequent posts, I think we're on the same page here and you just don't see that.  I know the work done so far was done by a small group of people and I completely respect that.  However, you can hold that thought along with ambitions to turn it into something even greater at the same time.  I'm happy to be here, and to help in its growth.  The powerpoint slides and Github repo issues obviously have some of what I'm talking about, I think I just wasn't clear enough in my post.  Ideally this would all be centralized in one place, and on ZN safe from potential censorship or otherwise sabotage.\n\nI don't have the answer to how this would be implemented, but it would be great if server side languages such as Python could be used on sites, which could open up the possibility of flask/django apps.",
				"added": 1565325003
			},
			{
				"comment_id": 58,
				"body": "Purely text based services is an easy starting point, things with images will need some system of whitelisting/validating users.  The truth is that even users who pass hurdles early on can resort to posting this stuff later on.  Lets face it.... unless we have some ML app that recognizes child pornography, stuff WILL inevitably get through.  This is where it becomes a tough challenge.  It would be easy to say \"just add some mechanisms where a moderator can delete the image/ban the user, and the changes occur globally on all peers.\"  But those exact mechanisms could be used on anyone or any subject.  Perhaps all images can be loaded into some sort of tier that requires some brave persons/mods to whitelist.  All of these actions will be logged to prevent abuse.  Once images are either whitelisted by a moderator or say 5-10+ users, they become \"public\" images.  Of course a group of users can whitelist bad images through.  When that occurs, implement a mod feature that not only bans the person who posted the image originally, but all users who voted it through.\n\nThoughts?",
				"added": 1565382896
			}
		],
		"1565337741_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 43,
				"body": "I don't know what sites you're seeding, but I've only saved 500MB or so of content over the past couple days.  It would be several times that, but I'm waiting for a few things to settle over on 08ch.  You can limit the total storage of all sites in an option.  If you can't afford to store much (or any) content, thats fine too.... theres a lot of people out there seeding stuff to accommodate people just like you.",
				"added": 1565338624
			},
			{
				"comment_id": 45,
				"body": "> [konidunul](#comment_1_1J6JfEeFfwmkogEHaMgs8MohbzpzMyQUqv): idk but after a few hours of browsing 08ch it easily grows to 2GB\n\nYou're simply saving and hosting all multimedia you've viewed.... if your browser saved your entire cache on the original clearnet 8ch, it would be the exact same size.",
				"added": 1565338801
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 44,
				"body": "$.10 has been deposited to your account",
				"added": 1565338684
			},
			{
				"comment_id": 51,
				"body": "> [dsfkjdhskfhds](#comment_3_1KzwNCqdRAhnPoKktNh4t8ZSgpbzWWvLGx): increased activity... yeeaah [...]\n\n\"I don't like some opinions..... better leave this groundbreaking platform.\"",
				"added": 1565344156
			},
			{
				"comment_id": 52,
				"body": "> [rusnoob1](#comment_4_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): Everything needs rules. Even if this is \"no rules\" rule.\n\nWe'll figure it out as time progresses.  It will be pretty challenging to balance all of the project's priorities in a decentralized environment.  I'm looking forward to be a part of it.",
				"added": 1565345487
			},
			{
				"comment_id": 53,
				"body": "> [rusnoob1](#comment_6_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): We shouldnt. It was right there from the very beginning of public internet and was called \"netiquette\" - boils down to simple \"dont be moron\". Sadly is dead now. The new norm is \"giva a man a mask, and he will show you his real face\"\n\nI agree with you, but this isn't a perfect world.  Things have changed.  There are troublemakers, saboteurs, shills, criminals, and people who just enjoy breaking stuff.... the spectrum ranges from relatively harmless to service threatening.  Short of hosting child porn or things of that nature, I think ZN should be a completely open frontier.... there just needs to be some minimal framework (perhaps optional on sites and not required) to protect its integrity and function.",
				"added": 1565345847
			},
			{
				"comment_id": 54,
				"body": "> [zeronetanon4](#comment_53_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v): [...]\nAdding to that, let it be up to the website operator and end user who is in control of this added functionality, who can use it if they want.  Don't force it on anyone.",
				"added": 1565346135
			},
			{
				"comment_id": 56,
				"body": "> [rusnoob1](#comment_7_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN): [...]\nI don't know man, I have to think about this issue more.  This isn't a solution to what you're saying, but one thing ZN has that other services don't is that this is decentralized.  At least in that regard, it is resistant to some level of external interference.  The problem with tools that kick some idiots off is that those tools can be used against \"good\" users just as easily.\n\nThe answer to solve these problems can branch off in different contrasting directions.  Here is one potential future:  Lets say in the future the decentralized web becomes orders of magnitude larger than it is now.  I could very well see it fracturing into different sub-networks, each with differing degrees of standards or functionality.  However, these networks can still communicate to each other and exchange data at certain points; imagine the digital equivalent of customs which essentially check that incoming data is meeting the network's standards prior to importation (this can be manually done or completely automatic, obviously this is future tech and I'm going off on a tangent).  This might be the best way to go about doing it.  One universal set of standards might be an impossible ideal, just like in the physical world with different countries/cultures.  Different networks can operate in their own way, but have some universal API to export and import data that adheres to the standards of others, whatever that may be.  And unlike the difficulty of physically moving across countries, individuals or communities who no longer like the standards of the network they are in could relatively easily move to another network, or to create a new one altogether.\n\nEdit- I have to go to bed, will read responses later on.",
				"added": 1565346907
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 47,
				"body": "Everything bad that happens contains within it the potential for growth and development.  It might not be easy, but its ultimately up to you as to how you choose to perceive it.",
				"added": 1565340344
			}
		],
		"1562399777_1AFtMdgzRba5guZq9adiRVacaRiFwkYe2F": [
			{
				"comment_id": 49,
				"body": "You'd probably be much better off asking a 3-D printing or modelling site.",
				"added": 1565342027
			}
		],
		"1565342542_16vtDQkRKY8atc9K3oCBTvMW1ojLLVxry5": [
			{
				"comment_id": 50,
				"body": "You already had a lot of good answers before deleting your first thread...",
				"added": 1565342820
			}
		],
		"1565358798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 57,
				"body": "> [bober](#comment_37_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6): man, your mental illness makes it really hard to read your posts\n\nIt jumps from mildly coherent to schizophrenic rambling.  The fact english doesn't seem like his native language amplifies that even more.",
				"added": 1565382464
			},
			{
				"comment_id": 60,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_731_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): great now i know 'you have something rejoicing for evening'.if you have nothing to say of adult, the best is 'not to intervene'. there is a 'big difference' 'between facebook and zeronet'. but I'm not sure 'you're equipped to understand the difference'. the best thing for 'you is to abstain'.\n\nMy intention isn't to be mean.  There is just a fundamental barrier in communication between us.  You do not speak proper english, regardless of the reason why.  Use Google translate if you have to.",
				"added": 1565383085
			},
			{
				"comment_id": 61,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_732_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): don't careit's not facebook here we don't deal 'with emotional disturbances'.\n\nThis has nothing to do with emotions.  This is much lower level.  People are failing to extract meaning from your words.  You should see that as a problem.",
				"added": 1565384003
			}
		],
		"1565382642_1MdYzyr3Q15o6GxLcfzEeFvNfoNPQajUWw": [
			{
				"comment_id": 59,
				"body": "It seems to be fine for me.  Start by restarting your computer and all networking hardware and trying again.  It might not fix the problem, but its a good starting point to get out of the way.",
				"added": 1565382966
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 62,
				"body": "> [aspidochelone](#comment_37_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): [...]\nI saw your name for the first time today, but I just want to say I enjoy reading your posts.  High quality.",
				"added": 1565384671
			}
		],
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 65,
				"body": "At the end of the day, you're jerking some guy off alone in a room.  Thats pretty gay.",
				"added": 1565515588
			}
		]
	},
	"comment_vote": {
		"8_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"2_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"218_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"219_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"866_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"2_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"1_1AFX5K2wbYcpCcvM2M9fGRMSWpoDnXqVnF": 1,
		"2_1AFX5K2wbYcpCcvM2M9fGRMSWpoDnXqVnF": 1,
		"1_19ZG8i1DSwiuRsvwUS8EsAgHXYK2tBtQKv": 1,
		"868_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"18_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": 1,
		"2_1PfGPyKkesp2sF6tmwj19A9Uk9aSgeBnLu": 1,
		"2_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"579_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1_14SVpYv1GjxQvyThD1rSPFRZxbGibj9aa1": 1,
		"231_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"24_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"17_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"3_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": 1,
		"878_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"244_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"174_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"10_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"889_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"25_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"16_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"17_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"896_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"258_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"182_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"19_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"5_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"18_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"10_1KZKeEyDG87Yz9dVn9q4GVaPp78YWtRxxn": 1,
		"9_1PBCaxayoEqvXFuayjxzGJvPub3BMUJUJT": 1,
		"27_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"17_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"16_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"8_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"19_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": 1,
		"927_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"928_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"24_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"31_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"10_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"12_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"32_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"13_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"7_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"8_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"7_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"1_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1,
		"2_1CyfmadHCsp89LZkVHpqSeKRJHBqwESrXC": 1,
		"14_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"1_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"32_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"1_1QGLB3N8RDWXaUSjvnZYjpU2X6t8NAgmtU": 1,
		"1_1HmE9NBVKZgaidhK26GKWppmafJkrHUvej": 1,
		"50_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"19_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"9_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"19_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"51_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"2_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"20_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": 1,
		"7_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf": 1,
		"45_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"35_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": 1,
		"37_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"36_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"58_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"24_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": 1,
		"61_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"28_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": 1,
		"37_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"2_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"4_1CcHo4q4s8nJwtjuoNQ8C2JeVFbL3mwdER": 1,
		"3_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"1_1JmzascVT1gUZZ5mLg8mg6pZKmTGdGNPXm": 1
	}
}