{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "留守儿童惨死成绝密　记者采访被扣村民发文遭威胁",
			"body": "2018-01-30 分类：时局 阅读(283)\t评论(0) \n四川省泸州市两位老人及两名留守儿童集体中气体毒死亡事件引起社会广泛关注。成都市一家媒体记者早前到事发的叙永县水尾镇采访时，遭村官强力阻挠，并一度被扣留；而当地一位村民因在网上转发有关消息，即接不明身份人士的死亡威胁。（黄小山 / 文宇晴　报道）\n受威胁的当事人、叙永县水尾镇钢铁村村民双武，周一（29日）向本台记者指出，本月10日，该村两位老人及两名留守儿童，因夜间使用炭火取暖，导致一家四口中毒身亡后。次日，成都一家媒体的两名记者前往采访，原本想给贫困山区募集一点资金购买回风炉，解决山区民众频发的取暖导致死亡的问题，但遭到村支书罗小中的拦阻和扣留。\n此后，记者将采访遇阻的过程发到了网上，引起了较大的关注。而他也转发了批评该村支书的相关文章，并转发了最近中共中央扫黑除恶的通报，但周六（27日）晚，不明身份的人通过微信威胁他，称要让他下半辈子都躺在床上。\n双武说︰前段时间罗记者到我们下边来采访，我们村上的村支书吧，就扣留了他们，收了他们的记者证。然后，罗老师回去以后就发布到那个网上了嘛，我就转发了这些个资讯，还有近段时间中央发布的打击微腐败、扫黑这个，然后那个不明势力嘛，让我三天之内给他道歉，然后让我的这些资讯全部给删除掉。不然的话，就要让我下半生在床上度过。昨天我去镇上派出所备的案嘛，然后镇长和那个党委书记也没有在，我今天上午才去的。\n双武指对自己和家人的安全非常担心，所以立即到派出所和镇政府去报警备案。但现在还不清楚出面威胁他的究竟是谁。\n他说︰在几年以前，他收那个集资公路款的时候，他就曾经动用社会上的人，来了十几个人，强迫收那个公路集资款。就是经济扶贫房，就说拨下来这个款不够，把人家经济特困户的猪都给拉走了，还有几个鸭子都给弄走了。就在我们钢铁村，这户人家姓何，我们都叫他何老三。\n当地村民冉先生亦向本台记者证实记者受威胁的事，但同时称他们只是老百姓，唯有忍气吞声。\n冉先生说︰我们听到起谈的嘛，威胁记者呀，扣押啊，挡车那些，我们都听到谈嘛。我们老百姓有些我们不要谈（不敢谈的意思）。\n据四川媒体人透露，记者到钢铁村采访遭阻拦甚至是暴力威胁的事情，当地媒体圈人人皆知。据当事记者的帖子显示，该镇群工部主任周勇也参与扣留记者，并拿走了他们的记者证。但因涉及敏感的留守儿童问题，很多帖子已经无法打开。\n本台记者亦联系上了曾遭村支书扣留的当事记者罗某，但其表示不方便接受采访。\n叙永县水尾镇镇长李长青向本台证实发生恐吓事件，称当事人双武已经报警，而他本人也正在了解情况。但他否认此前村支书扣押记者，称只是一次误会。\n李镇长说︰啊，正在核实这个事情，还没有见到这个人，等他下午到我办公室我问嘛。到派出所去报了案的。那个一氧化碳中毒公安机关做了通报的，那个没出示了记者证的时候，他说他只是问他是干啥子的，那是个误会。\n因大量青壮年外出务工，近6000万留守儿童的安全问题受到关注，面对死亡和被侵害。但面对此类悲剧，官方则全力封锁消息，禁止媒体介入报导。\n文章来源：RFA",
			"added": 1522078449,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "共党的气数尽了",
			"body": "以胡锦涛的那点“八耻八荣”“保鲜”的程度，如果是作为民间会社的一个首领，也是无可非议的。庄子说：“盗亦有道”。就是说，土匪们也知道自己的行径、勾当是不耻于人的，八耻都未必能概括得了。尽管说人生一世，草木一秋，但是为自己挣足了八耻的匪类们，也不是不想博得个人间的美名。于是帮规、家法、私刑配合着什么好听的杀富济贫，耕者有其田之类的口号就全出来了。这或许就属于八荣里面的内容。\n\n   \n\n   但是为了面子工程，而影响到了团伙内部的大碗酒、大块肉和大秤分金银的政纲，那么这个团伙的凝聚力就消失了。团伙成员作鸟兽散，各奔前程去了，所以还得保鲜。衡量先进的土匪的条件无非就是手段卑鄙、杀人多、抢劫多、贪腐多，于是匪类们分赃的钱多了，凝聚力就有了，匪类们就紧密地在匪首的周围了。\n\n   \n\n   中国大陆地区的问题是，土匪们阴谋投机篡了政，匪首们就成了国家的元首，人民的尊严、国家的体面全没了。匪类们当政，可想而知，那是一朝得志便猖狂。想当初井冈山、沂蒙山、大别山、延安都是穷乡僻壤，杀人再多、分赃却不多。哪里像现在，两三千万的匪类们是百万、千万、成亿的往口袋里装钱，这岂不就是共产天堂的生活吗？\n\n   \n\n   最让人闹不明白的是，因为他们杀百姓抢百姓，所以他们过上了曾经梦寐以求的天堂生活，那么谁该歌颂谁呢？是共党们该歌颂老百姓的大忍，还是老百姓去歌颂共党们的贪婪的匪性？文革开始两年以后，几千万中学生上山下乡，人手一本毛语录，其中有一条是“农民必须起来，同自己的愚昧迷信和不卫生的习惯作斗争”。\n\n   \n\n   农家出身的毛泽东是一朝得志，就背叛了农民，它自己过上了每晚两、三个女人陪它睡觉的生活，却反过来侮辱农民们愚昧、迷信、不卫生。又在他一手制造的大饥荒当中，活活饿死六千万人，其中80%以上就是农民。\n\n   \n\n   对付愚昧，唯一的办法就是教育。曾经提出普及九年全民义务教育的是毛泽东；可是不到十年，就降格为五年义务教育的还是毛泽东。直到他死，全国仍然保持着一个文盲与半文盲占国民总数50%以上的大比率。\n\n   而毛泽东又以大跃进亩产万斤粮的方式，造就出了一大批的农村赤脚医生。医生为什么要赤脚？毛的理论是农民的脚上有牛屎，但却是最干净。根据人类早期物质起源论的观点来看，服装的出现不是出于人的羞耻心和爱美心的需要，而是出于人类自我保护的需要而产生和发明的。对脚的保护物，比对身体其他任何部位的保护物的出现都要早的多。为什么农村的医务人员就要加上赤脚两个字呢？这还是对农民的侮辱，起码是对农民的不尊敬。\n\n   后来继任匪首的邓、江、胡们做得就更绝了，干脆就把原本是国民义务教育和免费医疗的国民福利待遇取消了。打着改革的旗号全都变成了产业化，让老百姓上不起学，更看不起病。共党说改革开放取得了多么巨大的成就，可是在本人的眼里，看到的却是对天地人的全面的大破坏和大毁灭。\n\n   众多的有识之士们都看到了这个大毁灭的结局，却被共党的喉舌们的歌功颂德的大合唱，掩盖了全部的事实真相。蒙骗了的部分民众，还信以为真，扭起了大秧歌参加了大合唱。\n\n   \n\n   被共党剥夺了人权、自由和知情权的中国人，被全世界的自由人所同情。而同情通常包括两个内容：一，那就是谴责、批评和制裁共党政权；二，那就是支持、鼓励和帮助中国人争取自由的艰苦卓绝的抗争。\n\n   中国大陆不幸沦为共产匪区六十年了。六十年来共党对国人民众的愚化、奴化、毒化和矮化的宣传，难免使得万般无奈的中国人当局者迷。\n\n   然而世界上的自由国家和自由人民却是旁观者清。他们研究透了、也看清楚了中国大陆地区的大破坏和大崩溃的结局；他们同情中国人民，那是因为他们清楚地知道，责任不在中国人民，而是完全由共党一手造成的。于是，共党就说他们是反华势力。其实，这就是共党的匪性。\n\n   历代的古书中都不难找到关于土匪大盗被绑缚刑场去砍头的描写：多数是一路高喊着：“二十年后又是一条好汉”；也有的一路上高唱地方戏，而且是专挑戏里的英雄末路、慷慨就义这种段子来唱；还有的呢，就对同伙说，我先走一步，阴曹地府见，奈何桥上见，鬼门关上见，或者是来生来世见。而对方还会回应他说，你先走一步，我随后就来；或者说你一路好走，我给你先送行了。\n\n这些个恶行累累、剪径劫道、杀人越货的草莽英雄、绿林好汉，致死都呼唤不出他们悔罪愧对天地良心，愧对祖宗父母的人性来，于是也就难怪两边看热闹的人是嬉笑怒骂、起哄喊好。\n\n   \n\n   毛泽东死后，毛太太江青在法庭上不也是如此的一副嘴脸吗？她公开说，“我就是和尚打伞，无法无天了。”与历代盗匪们的心理是完全如出一辙。权力和责任永远是一对双胞胎，掌权就要负责。毛泽东在上个世纪五十年代就说过，东南西北中，党是领导一切的。权力明确的很，那么责任，党就要全部地承担。\n\n   \n\n   一场十年半的文化大革命，共党把它定性为浩劫，并且强调是毛泽东亲自发动和领导的，于是党照旧伟光正。浩劫的罪魁祸首是毛泽东，这是共党学聪明了。从那以后，党就成了牌位。党要改革开放，结果的好与坏那是个未知数。所以邓小平就成了改革开放的总设计师，一切责任由邓小平承担。为了改革开放能稳定的进行，邓小平、李鹏拍板，领导了六四大屠杀；胡锦涛亲自指挥了拉萨的大屠杀。屠杀的罪魁祸首成了个人，党还是那么伟光正。\n\n   \n\n   这就要请问了，这三位元凶是不是共党团伙的成员呢？成员犯了罪，团伙不能说那是属于个人行为，而党不负责任。难道罪魁祸首仅仅就是个人吗？党全没有责任？胡锦涛的儿子在非洲拐骗了三千多万英镑，折合人民币三个亿。这是个人行为，还是党的行为？这种把团伙成员的行为和团伙分开的手法，共党自以为很聪明。但是经过了反思、觉醒了的中国人早就看透了，“打倒共党”“驱逐共匪”的吼声，已经响遍了东南西北中。\n\n   \n\n   先由本世纪初江泽民在美国公然在全世界人民面前污辱中国人的素质太差，后就有胡锦涛在今年八月提出的反低俗、庸俗、媚俗的反三俗运动。中国人在共党的眼里不但素质差，而且是俗气，这就是我在前面提到的。江胡们作为团伙的首领说什么都无所谓，但是作为国家的元首却用这种个人主观上的概念去评论一国之民众，不但是激起公愤的犯罪行为，更是凸现了江胡们的低素质和俗不可耐的人格。\n\n   \n\n   胡锦涛一定认为《卓娅和舒拉的故事》这部书是高雅的名著，同时还一定认为打小报告、告密的政治辅导员的工作是人类最高尚的工作。出于这种个人主观上的概念，当然那就要认为网民们在网上只要是涉及到共党和共党体制时，通常使用的歌功颂德的语言，那就是“草泥马”，那当然就是三俗了。\n\n   \n\n   有消息说反三俗指的是演艺界。可是共党早在篡政前的1942年就把演艺界给领导了。那么我们是否可以说，如果真的有三俗的话，也是共党领导出来的，或者说是共党给逼出来的。有人说这个反三俗的运动，实质上是冲着一位不依附于体制的相声艺人郭德刚先生而来的。如果真的是这样的话，胡锦涛的行市就做倒了。\n\n   \n\n   当共党团伙的头领是为了要吃饭，是为了要养家糊口；当相声艺人也是为了要吃饭，要养家糊口。同在一个起点上，只是工种不同，目的都是为了要活命。可有趣的是，任何人只要沾上了共党这个圈子，怎么就会变得人不人、鬼不鬼，自命不凡，还要代天立言，可全是胡说八道。\n\n   \n\n   9月3号，共党搞了个纪念抗日战争胜利六十五周年，把全国闹腾了个人仰马翻。胡锦涛也跑了出来为共党捞政治资本，捞合法性。它公然大言不惭地说什么，共党是抗战的中流砥柱。可是一句八年抗战的话就露了馅了。日本侵华十四年，我们要请问，这八年抗战应该是从哪年到哪年呢？打持久战的指导思想是蒋中正总统提出来的，并且实施的，怎么又变成了毛泽东的了呢？\n\n   \n\n   正当在胡锦涛亲自发动和领导的反三俗运动的风口浪尖上，这种拿着不是当理说的做法，已经大大的超出了三俗的底线，到了无耻的程度上了。中国的民众是不会忘记的，胡锦涛就更不应当忘记。当年毛泽东见日本首相田中角荣时竟然说：“我们应该感谢你们日本人。没有你们日本的侵华，我们还夺不下这个政权呢！”\n\n   \n\n   到了2008年的7月，胡锦涛跑去了日本，主动地默许了日本的要求，把三十万平方公里的东海海域让给了日本。从毛泽东对日本的感激，到胡锦涛对日本的割让领海，中国人又凭什么去相信共党曾经是抗战的中流砥柱呢？\n\n   \n\n   胡锦涛这次所谓反三俗，枪口对的是文艺界，实质上是对民族文化和传统的再次破坏和毁灭。那个怕死后被扒坟鞭尸的陈云，据说生前是喜欢苏州的评弹，常把评弹艺人叫到北京专门给他一个人唱。他过足了瘾以后就要表现一下他的高明，还要做不少的指示，强迫以歌颂人间真情、男女爱情的评弹去歌颂共党、歌颂大跃进、歌颂雷锋，搞得苏州人都不爱听评弹了。\n\n   \n\n   尤其是文革过后，那位雷锋先生也被揭发出来了，原来雷锋先生生前也有皮夹克上衣和大罗马牌的手表。而日记中的许多语句是出自于基督教的教义。\n\n    周恩来据说是喜欢起源于浙江嵊县的越剧。越剧演员都是女性，专门表现忠贞柔美的女性的悲欢离合的内容。周恩来也是过足了瘾就下指示，非要让男演员去唱越剧，把越剧搞得画虎不成反类犬，险些绝了种。\n\n   任何一种表演艺术都是起源于民间的风土习俗，有了观众的基础，逐渐成为一种地方的文化艺术。相声也是同样，原来是街头艺术。有了听众的基础，走进了剧场，逐渐就成为了一门专业的艺术。但是把相声艺人侯宝林封为北京大学的语言教授，那就有些个太离奇，也太过分了。\n\n   \n\n   先有侯宝林的被封教授，今有郭德刚的被封杀，原因就在于一个是为权力效力，一个是远离权力。一个有独立人格、独立意识的人，才能有独立的思考能力，这才是一个完整的人。想做一个完整的人，就必须远离权力、金钱和名誉。\n\n   六十年来，中国大陆是没有发明创造，没有名著，没有大师级的人物，没有能够得到世界共识的价值伦理。十六亿人口竟然出不来个人物和东西，就只能说明共党插手科学、学术、教育、文学、艺术的后果。共党只会破坏不会造就。\n\n    例如兴起于明朝的昆曲艺术，词曲的高雅程度足以表现出中华文化的深厚内涵，同时昆曲还是我们的汉学，流传了四百多年。到了共党的这六十年，这个剧种已经基本上绝种了。有人解释说，昆曲是属于阳春白雪之类的高雅艺术。所谓曲高和寡，大众接受不了，所以就不行了。可我的看法正好相反，正是因为共党没有素质和不学无术，所以才阳春白雪和者寡。在共党之前，则是阳春白雪和者众，所以昆曲艺术才能够承传了四百多年。\n\n   这正说明五千年文化是毁在共党的这六十年里。大家不妨回忆一下，前三十年共党是讲究出身成分的，凡是祖上八辈子要饭大字不识的大老粗们，都是共党的宠物和重用的人；而这后三十年共党是用金钱物欲，彻底地毁掉了中国人的人性和道德，从而降低和歪曲了人们的审美观念。\n凡是共党审批后可以播放的节目，连古人所说的下里巴人的程度都赶不上，共党却认为就是好。如同文革中唱了十年的“文化大革命就是好、就是好、就是好。”既然就是好，那就不妨让胡锦涛亲自再发动和领导第二次文化大革命，让我们看看结果会是什么？毛泽东最喜欢听的是“呼而嗨哟，他是人民的大灾星”，胡锦涛想必也喜欢听。\n近五、六年来，汉语中出现了一个新词汇，叫做“党文化”。本人曾经很是不以为然。共党是一个没有文化、所以才反文化的团伙，难道这也称得上是文化？后来翻阅了一些东西方的通史后才发现，共党把欧洲中古世纪的政教合一的极权主义的统治的文化，借着马克思主义的幽灵在中国大陆复辟。把这叫做党文化，还是合乎逻辑。中国本土是不出这些糟粕的。\n首先，中国历史中，皇权专制执行了两千多年，但却没有下作到实行极权主义统治的地步；第二，那就是说宽容与博大的中华文化，是不可能容纳马克思的歪理邪说的。无论是极权主义的统治、还是马克思列宁们，都是共党们从西方照搬到中国来的东西。中国的民众们几千年来，从事着士农工商四大行业，骨子里浸透的是儒、释、道的文化和精神。\n\n   五四时期，西方的民主和科学的价值观传入了中国。中国人民至今把它称作是新文化时期。共党却否认它。毛泽东说，“十月革命一声炮响，给中国人民送来了马列主义。”以马列和极权主义的垃圾为指导思想的共党，要在文艺界搞一场反三俗运动，其目的无非就是对中国大陆残存不多的中华文化和民间的正义道德，进行全面的毁灭。\n\n   所幸的是，历史给共党的时间太有限了。此时此刻的共党，无论再怎么折腾，也无法自救了。它一步一步地走向垮台、灭亡，那是大势所趋。\n\n   共党猖狂了六十年。大家想想，生态被全面破坏了：空气、土壤、水质被全面污染。农业在二十年前就已经破产了；而工业是产品库存积压严重；内需拉不动，外需需求量低；而商业被假冒伪劣毒搞得名声狼藉；金融破产资不抵债；遍地的豆腐渣工程；庞大的贫困人口和庞大的失业率。\n\n   在外交上，与文明发达国家永远结不成战略伙伴的关系。而在地缘的关系上，北边的俄罗斯那是共党惹不起的；东边的韩国和日本是被共党激怒了；东南亚十来个小国是让共党给得罪了；西边的印度那是共党得罪不起的。一幅四面楚歌的形势，整个中国大陆那就是国破山河碎，人心思变。\n\n   \n\n  此时此刻的共党们倒像是阿斗，乐不思蜀。真的是麻线拴豆腐，提不起来了。也只能走到被审判、被清算的那一天才算为止。\n09-08-2014 完稿\n\n(共党的气数尽了 全文完",
			"added": 1522078653,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "俄罗斯民众抗议普京将稳胜的“假选举”",
			"body": "2018-01-29 分类：时局\n成千上万抗议者冒着摄氏零下45度的低温抗议纳瓦尔尼及其支持者所说的假选举。\n\n俄罗斯反对党领袖纳瓦尔尼(Alexei Navalny)从莫斯科的警察拘留所获释。此前成千上万支持反对派的示威者抗议3月将举行的一次选举。据信选举将延长普京在克里姆林宫的任期。\n纳瓦尔尼在前往莫斯科市中心参加一个集会的途中被警察逮捕。\n早些时候，警察搜查纳瓦尔尼在莫斯科的总部，用电锯打开了纳瓦尔尼的办公室门。俄罗斯官员称，有人报告有炸弹威胁。\n成千上万抗议者冒着摄氏零下45度的低温抗议纳瓦尔尼及其支持者所说的假选举。\n纳瓦尔尼敦促俄罗斯选民抵制定于3月举行的总统选举。看来普京将在这场选举中获胜，再次连任总统。\n文章来源：VOA",
			"added": 1522078726,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "国际组织批公安拥大数据资料库 侵犯人权如虎添翼 2017-11-21 分类：民主 阅读(155)\t评论(0)",
			"body": "中国警方年中开始使用自行开发的大数据系统“警务云”搜集民众逾百项数据资料，国际人权组织呼吁停止使用，批评中国当局用此系统监控跟踪受针对的人士，严重侵犯隐私。有大陆维权人士指出，个人难以抗衡国家的侵权行为，希望国际社会继续关注。（海蓝　报道）\n\n \n\n总部设在美国的人权观察，研究员王松莲周一（20日）向本台表示，自大陆在各民生领域强制性推行实名制后，民众的身份证经常被要求在使用公共服务、甚至在私人公司服务上被查阅。此外，警方早已掌握民众的个人私隐的数据，包括节育方法，这些敏感私人信息，再加上各政府部门的信息，包括卫生部门的民众患病资料，都会收集在“警务云”内，该系统可以知道每个人很多的信息，包括你何时去过何处、住在哪里、跟谁关系密切等，该组织最关注是“警务云”其中一作用是监控7类重点人物，包括异见人士、访民及少数民族，以拦截其活动。\n\n \n\n王松莲说︰一个重要的功用是监控他们、跟踪他们去哪里或未来将去什么地方，去拦截他们未来可能会采取的维权行动。整个“警务云”不仅侵犯所有人的隠私权，亦包括尤其中国政府认为政治上威胁他们的这类人。\n\n \n\n她强调，大陆没有法例有效保护个人私隠不受政府侵犯，如果政府或警方要你的资料，你是没有任何保障，即使资料在私人机构，警方可以网络安全法向该企业取得，该组织觉得此举很危险，在缺乏完善个人隠私情况下，可以令中国在大数据系统下，严重侵犯个人隠私。\n\n \n\n江苏异见人士吴世民指出，他们去维权或上访时，警方什么数据都有，他们买车票时便被拦截，因为政府的电脑系统互相联系，他们一订旅馆便会知道，所以十九大之前，警方到他家找到他。他认为很难跟当局抗衡，只能掌握它的规律用方法避开。\n\n \n\n吴世民说︰下一次二十大比方说要来，你起码要早一个月潜伏，把手机号码换掉，最好身份证不要拿自己的，向亲戚或朋友借一个去买车票、租酒店，前题是亲戚朋友没有上访或异议纪録的人。\n\n \n\n他慨叹，大陆除了红二代、官二代享有人权自由外，老百姓没有隐私权利。\n\n \n\n山东维权人士张恩广则指，作为异见或维权人士，当局便会注视你，以前警方会知道你的家庭具体情况，以至上学时期的情况，他都掌握。他们可以以此作维穏手段，再加上现在的数据系统，当局不断加强系统，个人很难抗衡国家的机器，但可以由联合国及国际人权组织替他们作出抗议。\n\n \n\n张恩广说︰但是作为人权组织、作为公民也好，对于侵犯个人隠私这方面，我肯定有抗议。即使你抗议，他们也要收集，而且默默的收集，利用各种方式扣上一个帽子，就可以抓你。\n\n \n\n人权观察从大陆的招标文件、学术文件及研究，再配合之前在山东，江苏及天津的调查而作出分析，数据包括録像、照片及文字。该组织以山东威海巿的“警务云”为例，它聚集63项警方数据，以及来自各政府部门及私人企业共115种数据。",
			"added": 1522078822,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "江棋生：新极权，还是翘起尾巴的后极权？",
			"body": "2017-12-01\n关于习近平上位以来搞新极权的说法，我虽早有所闻且难于苟同，但直到写作《重读零八宪章》一文，我也只是点到为止，没有正面给出自己的明确见解。近日，相继读到冯崇义先生的断言：习近平“想把中国从邓小平的后极权主义带回极权主义社会”，和张博树先生的描述：宪政自由主义者将“习近平新时代”称之为“习近平新极权主义时代”，终于使我下决心公开言说自己思索良久的一些不同看法。\n \n应当说，自2012年11月中共十八大到2017年10月中共十九大，习近平所干的以下三件事，与邓（江胡）时代的路数是有显著区别的。一是外交上不再韬光养晦，而是一步步从锋芒外露到锋芒毕露。二是政治上从“要警惕右，但主要是防止‘左’”，到主要是防右反右。相应地，意识形态上不再取守势，而是搞“自卫反击”，重树马克思主义主旋律，重夺思想阵地话语权，公然下令“七不讲”。三是边撸起袖子加大选择性反腐力度，边让个人崇拜之风在中共党内死灰复燃，卷土重来。其中最为肉麻和令人恶心的颂圣谀词，乃出自北京市委书记蔡奇、天津市委书记李鸿忠和国防部长常万全等马屁精之口。\n \n然而，上述三大区别能表明习近平搞的是新极权吗？\n \n我的看法是，不能。\n \n我的理由是，习近平在言论和行动上都没有反对和告别邓（江胡）的改革开放政策：他没有反改革，试图从半吊子市场经济即“社会主义市场经济”返回计划经济；他也没有反开放，意图重新闭关锁国。而正是邓主张的改革开放，使中国从毛时代毫无政治、经济和社会多元化的极权主义社会，走向邓时代政治一元化、经济和社会呈现有限多元化的后极权社会。习近平既在所谓“旨在坚持和完善社会主义制度”的改开大计上沿袭邓（江胡），未敢造次而邓规习随，那么他上位以来所搞的，就显然不是新极权。\n事实上，习近平所搞的，还是后极权。更精准地说，他搞的是：在外部因素和其性格因素共同作用下，自鸣得意地翘起了尾巴的后极权。我的这一“翘尾后极权”说法，与沈大伟教授给出的“硬威权主义”概念，或可称异曲而同工。上世纪90年代初，邓小平提出“韬光养晦、有所作为”，是为了使冷战结束后处于弱势不利地位的中国能够站住脚跟，并通过“发展是硬道理”徐图将来。到了比胡锦涛明显强势的习近平任上，由于中国在经济总量上已成全球老二，加上发达国家总体上搞绥靖主义等因素，中国的后极权政体认为机不可失，可以适时冒泡、牛起来了，于是公开告别邓小平的“韬光养晦”谋略，对外毫不隐讳地宣示“大国崛起”，亮名片，搞推销，展拳脚，疾步趋近世界舞台中心；对内则更加宁“左”勿右，除了对民间觉醒者的维权和抗争之管控、打压更为严厉和凶狠外，还发明了让人尊严扫地的歧视性“低端人口”标签，将一部分温顺无助的国民悍然排除在人类命运共同体之外。\n那么，中共十九大之后拥有“领袖和统帅”头衔的习近平，会搞新极权吗？\n \n我的看法是，依然不会。\n \n我的理由是，习近平如果要搞新极权，那就要反邓小平改开路数而行之，把已有的经济、社会有限多元化一一抹掉。这对习来说，首先不是能否做成的问题，而是想不想干的问题。在我看来，习还不至于不明白，没有上述有限多元化，哪会有今天官媒上自夸不已的“辉煌中国”？哪会有他在一带一路上大撒币的底气和牛气？而没有上述有限多元化，中共又如何“决胜全面建成小康社会”？如何实现所谓“两个一百年的宏伟目标”？\n \n因此我认为，他不会搞。当然，如果他的确如冯胜平所企盼的是“浑人”一个，“虽千万人吾往矣”，愣是要搞新极权，那也是注定搞不成的（此处不赘）。\n \n中共十九大之后的习近平，还是会照搞后极权。对于这一点，从他在十九大报告中列出的“建设新时代”十四条基本方略，人们可以看得清清楚楚。有人误以为习近平要搞新极权，我觉得是多少看走眼了。而真正完全看走眼的，当数那些至今还对习近平会改旗易帜搞宪政抱有幻想的人。习近平上位以来的言论和行动，充分表明了他与宪政的势不两立，表明了他是铁了心要将宪政拒之门外的死磕派。而那些怀揣玫瑰梦的人，居然对这一朗若白昼的事实视而不见。\n \n质言之，毛泽东的社会主义，是极权主义。加上“中国特色”限定词的社会主义，则是后极权主义。而所谓“习近平新时代中国特色社会主义”，就是习近平新时代后极权主义，即翘起尾巴的后极权主义。\n \n作为极权主义变种的后极权主义，与极权主义一样有个内在的致命伤，那就是对人权的蔑视。这种政体不忘初心，坚持将国人视为只能听它话、跟它走的跟屁虫，不能具有独立人格和自由思想，更无资格当家作主。在这样的政体下，国人日益增长的权利意识和公民精神与被强行按上的臣民角色之间的矛盾，或国人日益增长的当家作主的意愿与被强制安排的跟屁虫角色之间的矛盾，迟早会成为社会的主要矛盾。而在这一主要矛盾的凸显、激化和加剧中，越来越多觉醒了的民众必将成为制度变革的伟大力量；这种伟力除了会使后极权政体翘起的尾巴抖落下来外，还必定会将后极权政体打包送进历史的博物馆。\n \n2017年11月29日 于\n江苏常熟\n（自由亚洲电台11月30日播出）",
			"added": 1522078871,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}