{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1551860529,
			"title": "The Resistance",
			"body": "If you are reading this, know that you are blessed. With your sight you are able to perceive and read the letters that are placed on the screen before you. With your mind you are able to understand and interpret what is being conveyed in such a manner that it is clear and concise that the message might be transmitted clearly.  I do not know how much time we have left. Events are being pushed into motion that we are not going to be able to stop. They are manufacturing a weather storm of untold proportions above my head as I type this. I was poisoned. My neck is cracking. My spine is cracking. \nI feel as if the cancer is crawling through my veins every single day. Whoever you are, wherever you are, you need to know that there are individuals out there who will absolutely attempt to destroy you. \nI walked on graveyard patrol for over 700 nights. I was involuntarily committed  to a hospital and left in solitary until i had lost all sense of time and space. They led me into a room and gang tackled me onto a bed whereupon they put needles into me until i blacked out and could not remember nearly anything. I sincerely thought i was going to die in that room. Whatever they put into my bloodstream has changed my body for the worse. I pray everyday that I might be able to sleep and rise at least once more to contribute what I can towards those who seek the Truth. This generation, those who are alive at this very moment in time, we are all going to be witness to events that will absolutely change the very foundation and nature of what has been deemed normal and the status quo. Most of you already know this. If you are on this zite than you are more than likely not the ordinary person. Do not be misled. Even with knowledge and even fortune there is still so much more to this reality than you could ever possibly understand and / or realize. I hope that whoever you are, wherever you are, that you make a difference in this world for the better. I hope that you realize that so much of this life, this reality is a test to see if we are deemed worthy for the world that is to come. Know that the fleshly body that you currently inhabit is not the end. Know that there is more to this moment and this timeline than you think. You must solidify within yourself where it is you stand now, so that when the time comes, no matter how dark it is around you, you know that your choice has already been made. \nThis world is growing darker. This plane of existence is changing for the worse. People are being blinded. People are augmenting themselves for the worse. Do not be lead into the deception that so many are going to be fooled by. Do not allow yourself to become apart of the system that they are attempting and will eventually implement. It is upon us. And for some of you out there, it came to you first. There is no escaping it. No matter where you run, they will be there. No matter where you attempt to hide, they will be there. This is more than a physical battle. This is more than a physical encounter. \nThis conflict has existed before the foundations of the world and nearly everything that you think you know about history is more than likely wrong. Question everything. Know that the answers are out there and that they are not hidden. I hope you all have the strength and endurance to survive what is coming upon the earth. Some countries are already flooded. Some areas are already devastated. Some people have already fallen. It is only going to get stranger from here on out. There is no going back. Know that you have the power to overcome. Know that you have the authority within you to resist this darkness. Know that You will give account one day. But most of all, know that grace is still here. Darkness will not prevail in the end. Their time is short and they know this. HOLD FAST AND PRAY FOR PROTECTION. I do not want your hearts to fail. I have corruption in my flesh and I do not know how long I have left, but with every breath I take I move forward knowing that I am not ashamed of who I am and what I have devoted myself to over the course of my life. They are coming from the depths of the earth, although they will say that it is from beyond the firmament. THEY CANNOT PENETRATE the seaofglass. It is impossible. They are coming from Sheol and everything that has been constructed in relation to it. My hands are failing me. My mind is tired. The dozens of drugs they pumped through my system nearly drove me insane. You must realize that they could do the same to you and your family. THEY DO NOT HAVE ANY REMORSE. They have absolutely no regard for you or I. They are bred for destruction. Choose life and stay the course. Time is appointed to end at a certain point and death will be no more. Resist with every fiber of your being and if you fall know that they do not power over the soul. Fear him who does. My connection is going to be shut off eventually. The power is going to be shut off. The grid is going to go down. I don't know when, but I know it is coming. Do absolutely everything you can to prepare, but know that your family might turn on you as they did me. What is about to happen in the next few days, weeks, months, and years is going to tear families apart. We are going to see war on an absolutely unparalleled scale. I don't have dates for any of you, but they have been planning this for centuries. We are out of time. I hope you find refuge.",
			"added": 1551860528
		}
	],
	"topic_vote": {
		"1551860529_1PfMSesJyDFWRTGAGqmbru27m44GkqjXfj": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1550754018_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 1,
				"body": "It is all about tracking the individual to the point where privacy has been eradicated. They want to know everything about you and and your family ; It is slavery.  If you are reading this, do what you can to support those around you and do not give your power or energy to their system in any way. You must resist.",
				"added": 1551858411
			}
		]
	},
	"comment_vote": {}
}