{
	"next_comment_id": 2,
	"comment": [
		{
			"comment_id": 1,
			"body": "gracias por la info; en mi opinión frente a la I.E(Inteligencia emocional) nos encontramos en la circunstancia de reconocer: **la IE es existente** y con ello abrir una nueva visión o acceso para contenidos y pesares, entonces dentro del mismo se reconocen nuevas fronteras de realidad y por ello nuevos mecanismos, ya sean positivos o negativos, cobra su existencia en la acción.\n\n**la IE es existente en la medida de los contenidos** este punto bien puede ser, **abre accesos y crea nuevos monstruos intelectuales**, y no por ello, menos reales, puesto que forman parte de nuestra vivencia mental. pero bien podrían parecer contenidos inútiles y fútiles dependiendo de la circunstancia de lo q queremos enfrentar(uso de sobre-dimensionar). En este sentido, podría decirse q, la IE es una herramienta artificial, q se desarrollo en nuestro mundo social; y cuando hablamos en ese sentido y en esa circunstancia, es algo q puede ser adquirido/desarrollado a la vez de manipulado como una nueva bolsa del sufrir q esta condicionada a llenarse y a resistir.\n\n**Lo que debemos observar es si esta IE no abre puertas inútiles abocadas única y exclusivamente al desgaste corporal/psique, en vez de, salvarnos de una crisis: que ganamos? que perdemos? existen otros métodos que no sean introducir conceptos nuevos? podría la IE ser otra cosa? pertenecer a otra parte? tener otra aplicación? quizás, doble aplicación?**\n\nEs un hecho que los 10 puntos son una realidad, pero las acciones físicas, la resistencia del cuerpo, la de la mente, la emocional son elementos condicionados a llenarse, y esa IE, bien podría pertenecer a cualquier cosa o parte, es positiva en la medida q identifica pesares, es negativa en la medida que existe como nuevo contenido de accesos de infección(en su forma de falta de aplicabilidad y de realidad[palabra-realidad- acción- economía corporal])... *en la medida en que es activa, en la medida en que es pasiva*\n\n**en resumen XD**: cuidado siempre con las construcciones racionales de este tipo, ya q en algunos casos, se asemeja a científicos q quieren ganar la subvención estatal para estudiar \"no se que tema superfluo e infinito\" fingiendo devoción cuando, en realidad, es otra cosa que no sabemos. ",
			"post_id": 8,
			"date_added": 1476173637
		}
	],
	"comment_vote": {},
	"post_vote": {
		"8": 1
	}
}