{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1555449613,
			"title": "Bitcoin Cash ABC and Bitcoin Cash SV",
			"body": "Are these people mad? The BSV people are panic selling their worthless shitcoin into BCH which is likely to be delisted like the former for similar false advertising. Don't they realize BCH value will be coming down too?",
			"added": 1555449612
		},
		{
			"topic_id": 1555920851,
			"title": "The New Zealand shooter's manifesto. Did anyone notice?",
			"body": "In the introductory pages, he said he made money off Bitconnect.\n\nI don't get it. How did he make money off Bitconnect?",
			"added": 1555920849
		},
		{
			"topic_id": 1557231045,
			"title": "15 ways to respect a left-handed person.",
			"body": "I recently listened to a podcast that went through 50 ways world can be less hostile to fat people. Since it was so interesting, I made my own list on how to communicate and respect left-handed people.\n\n1. Don't mention it:\n\"Oh you're a lefty\" is incredibly damaging, as it triggers PTSD for centuries of falling prey to right-handed oppression.\n2. If you are buttering a half slice of a loaf to give a left-handed person, remember to apply the spread to the correct side of the bread.\n3. Stop trying to teach a lefty that they can write, wash their teeth, or wipe their ass with the right hand if they just practiced enough. That's incredibly patronizing and offending.\n4. I am not ambidextrous, don't expect me to be able to use the knife while I am forking.\n5. Don't automatically assume left-handed people are artistic or smart. We most likely aren't. And that's ableist, and offending.\n6. Don't tie our left hand behind our back to \"teach us to use the right hand\". We had that for decades. It wasn't fun.\n7. A lefty isn't the Devil's spawn. Fairy-tales have nothing to do with a person being left-handed or not... If you belong to that other religion, please feel free to dis-regard this advice.\n8. Write in Arabic... Or, hell just convert to Islam and force everyone to write in Arabic. That way the world of left handed writers don't have to worry about getting their hands full of ink. Islam will do the heavy lifting in enforcing left handed writing for you.\n9. Learn to handshake with your left hand.\n10. Tell your lefty kid about left-handed heroes; musicians like Paul McCartney and Jimi Hendrix, actors like Whoopi Godlberg and Tom Cruise and other famous left-handers to build their confidence and self-esteem.\n11. Remeber the Left Handers' Day on 8/13, don't forget it. It would be demeaning to all the left-handed people around you.\n12. Left-handed people are a minority, and they are owed reparations for all the cruelty that's been done to them in the name of right-handedness.\n13. Give us room when we are eating, you keep elbowing us, that's Oppression. (courtesy of [quantumworld](#comment_413_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE))\n14. Left-handedness is a disability. Lefties should be eligible for social security benefits for it.\n15. Disagree with any of these points and you are an ableist bigot, probably even a sexist and a racist Nazi too.",
			"added": 1557231042
		},
		{
			"topic_id": 1557337953,
			"title": "\"I would not even rape you\" is not a rape threat! (rant)",
			"body": "MP Jess Philips is just salty because the UKIP candidate Carl Benjamin doesn't find her attractive.\n\nThe truth said she doesn't deserve rape. It would be too good for her.\n\n\"Benjamin 'might' rape Phillips\"... Bullshit! Hence his response that there'd not be enough beer to make him do it. That's how unappealing and ugly Phillips is. She's a total erection killer. That's what he said.",
			"added": 1557337949
		},
		{
			"topic_id": 1557351187,
			"title": "Binance got hacked!",
			"body": "Good! I hope Bitcoin dips. :)",
			"added": 1557351182
		},
		{
			"topic_id": 1581413099,
			"title": "Communism – Who in their right mind would want it?",
			"body": "I've been reading a lot of discussion about socialism and communism lately.\n\nI just can't figure out what's so great about it. I mean... We aren't all the same, we can't expect everyone to just fall in line and start donating their work and stuff for free for everyone else. We also can't expect everyone to work as hard as others.\n\nThere will always be groups and individuals who either don't care, or don't even want to participate in the group effort. Like there will always be those who want to exploit all that \"free\" effort.\n\nYou just can't straight out eliminate all of our differences and \"inequalities\". They are what make us human in the first place. We are not ants, or robots either.\n\nWhat's your take on this?",
			"added": 1581413093
		},
		{
			"topic_id": 1581518987,
			"title": "Islam is feminist",
			"body": "Mohammed said women are equal to men.\n\nDiscuss.",
			"added": 1581518980
		}
	],
	"topic_vote": {
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1555449613_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1556136561_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1556096165_18aVoqjXuLUuftUDoyhsawC3TLdWGW6tqh": 1,
		"1557079828_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1557191513_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1557231045_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1556958282_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1557337953_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": 1,
		"1557647082_14EdfbbdCHp18C276cTBHQ8mmG5n6U4b9S": 1,
		"1557610674_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1,
		"1557351187_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1557431373_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1557414212_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"1571450538_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1604801704_1JFd5LoD35AWE1dTNRkbCm4Yyjonw5KAao": 1,
		"1610348128_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ": 1,
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": 1,
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1
	},
	"next_comment_id": 65,
	"comment": {
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 1,
				"body": "KDE Neon",
				"added": 1542318589
			}
		],
		"1555389717_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": [
			{
				"comment_id": 2,
				"body": "Retroshare (https://retroshare.cc/) is Free and Open Source.",
				"added": 1555401629
			}
		],
		"1555302116_1FUAYb5srAuXuzNsKKtbd6cpNfQbES7UBm": [
			{
				"comment_id": 3,
				"body": "In addition to torrents, one can also share IPFS hashes, like this: QmTYhtrc9ctnR4Yj2JC9WA8nFcFD2Pi9FsEpppaKGCRqex (Just some random Youtube video I uploaded on IPFS.)",
				"added": 1555402056
			},
			{
				"comment_id": 5,
				"body": "> [adthx](#comment_3_1FUAYb5srAuXuzNsKKtbd6cpNfQbES7UBm): Can these torrents be downloaded using softwares like qbittorrent? I am somewhat new to the concept of decentralization, so..\n\nWhile distributed, torrents are not necessarily very safe.\n\nWith Tribler (https://tribler.org/) though, you can easily add a step or two between you and prying eyes.\n\nRetroshare (https://retroshare.cc/) enables you to create secure channels for media and pretty much anything between you and your friends.\n\nThere's also the Interplanetary Filesystem, IPFS (https://ipfs.io/) where you can dedicate some of your hard drive space for a global distributed and encrypted filesystem where you can fetch files with their hashes.",
				"added": 1555404570
			}
		],
		"1555383590_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 4,
				"body": "Good thing it was under renovation, so most of the stuff that really mattered was kept elsewhere during the constructions. Undoubtedly they'll build it again.",
				"added": 1555402245
			},
			{
				"comment_id": 10,
				"body": "> [gametangia](#comment_8_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW): Obvious arson attack. Anti-catholic attacks in France have shot up in recent years, and in 2019 we have already witnessed the burning of other churches-which firefighters have officially declared as arsons-the destruction of statues, altars, and the desecration of Eucharist items. For the government to call this an accident when it happened after work hours on top of a string of anti-Catholic church burnings and vandalism is ridiculous.\n\nI much doubt that, more inclined to think this was an accident.",
				"added": 1555500194
			},
			{
				"comment_id": 12,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_7_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Two videos in french of the former chief architect of Notre Dame who does not understand the 'nature of the fire':    https://invidio.us/watch?v=eh8BD9K2mWY    https://invidio.us/watch?v=Ov4vSigtfaU    In filigree he explains that he does not understand how a '800-year-old wood' could have burned 'so fast like matches'.\n\nHe doesn't understand much does he? I think in 800 years, wood might become very dry, thus faster to ignite.",
				"added": 1555503502
			},
			{
				"comment_id": 13,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_8_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): He's talking about density. An old wood is deprived from its water, thus becoming denser to burn. Like the woods that stay long in the water, the dense woods that stay long in the water, Become Like Stone.\n\nWhen wood dries up, it becomes less dense as it loses matter, that's just the nature of physics.",
				"added": 1555576427
			}
		],
		"1555441653_1KKyuMCpzQ3ZxrT8tpkrBaqodWLiyL8kZ7": [
			{
				"comment_id": 6,
				"body": "> [naster](#comment_1_13YSmU87abZ76qH9YFgJtWeGYwiRaCnUqz): Censorship from centralized services helps. But in encourages mostly nasty people to join decentralized services at first.\n\nSo you are one of those nasty people? Or are you just bragging?",
				"added": 1555444199
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 7,
				"body": "They will come for us when we are the least prepared, and garrotte our throats.",
				"added": 1555449781
			},
			{
				"comment_id": 11,
				"body": "> [shitnotworking](#comment_11_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Phones aren't stupid, the people using them to relay sensitive information are stupid.\n\nYou are right about that. Phones are not stupid, and they know where you live.",
				"added": 1555500310
			}
		],
		"1555449613_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 8,
				"body": "> [atomiserxenolith](#comment_41_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Why value of BCH coming down?\n\nBitcoin.com, that's why. They are hoaxing people who are interested in Bitcoin to invest in BCH instead. That's kind of like selling a Lada with a red paint-job as a Ferrari.",
				"added": 1555499820
			},
			{
				"comment_id": 9,
				"body": "> [anonymouslogin](#comment_212_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm curious about SV. I have quite a quantity of it because of the BCH split. Why didn't they develop any wallet software before the release? Even better, why not contract with a hardware wallet provider for service before the fork?\n\nI never invested into BSV, their claim that they are \"the true bitcoin\" immediately set off my hoax alarms. And since I noticed I had some BCH (because of the hardfork), I sold them all for Litecoin.",
				"added": 1555500017
			},
			{
				"comment_id": 20,
				"body": "> [atomiserxenolith](#comment_56_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): They must be good ar it since the value is going up...\n\nThe Bitcoiin (B2G) also went up, but it doesn't mean it's not a hoax.",
				"added": 1556011173
			}
		],
		"1555665471_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh": [
			{
				"comment_id": 14,
				"body": "> [dots](#comment_4_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh): But from the perspective of the client, the leecher it's easy to use, you just have to access the file through a IPFS gateway, am I getting something wrong?\n\nNetwork congestion. If you use a single point of entry (an IPFS gateway) to leech the file, and if thousands of others do the same, it will essentially be the same as making a DDOS on the gateway. Don't do it! Set up your own IPFS node instead, it's not rocket science.",
				"added": 1555831060
			},
			{
				"comment_id": 15,
				"body": "> [ssdifnskdjfnsdjk](#comment_794_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Is it enough easy to use? Is there any simple M$ Windows graphical user interface to add files, manage existing, search thru them? IPFS, like Torrent, DC will cause the IP address of the sharer be visible which means copyright protective agencies can easily see which IP is violating copyright.\n\nThe difference is, they don't know what you are sharing. The graphical interface to your IPFS node is essentially your browser pointed to localhost:5001/webui",
				"added": 1555831325
			}
		],
		"1555609581_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh": [
			{
				"comment_id": 16,
				"body": "> [dots](#comment_3_1BXdtJD8d5s813aPwKoxEjGWPaNGB8deNh): Thank you both for the replies.What if I were using Brave Browser for example? Would Brave Browser have any weakness?\n\nIt has the same weaknesses as do any other browsers. You can set all the traffic to go through Tor, though.",
				"added": 1555832002
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "Why not John McAfee? :)",
				"added": 1555869499
			},
			{
				"comment_id": 18,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_35_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): THINKING DOES NOT INTEREST ME.\n\nIt shows.",
				"added": 1555888003
			}
		],
		"1555920851_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 19,
				"body": "> [duende](#comment_9_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Don't be dumb, he lied for the gag.\n\nLaughed at it, sure it was a joke. Ever been asked a rhetorical question before?",
				"added": 1555969228
			}
		],
		"1556469439_1Jtas1e392Kx9sfvZKnCQR8HMH7gcJ1FpW": [
			{
				"comment_id": 21,
				"body": "2 things:\n\nHow exactly does Shadowsocks differ from socks5 over tor?\n\nDemonsaw hasn't been updated in 2 years. Retroshare (https://retroshare.cc/) does the same and is actively updated.",
				"added": 1556534589
			}
		],
		"1556845763_1AsV7xMgu5zcF66YxZFYUp1utR12MqaRBd": [
			{
				"comment_id": 22,
				"body": "zeroers?",
				"added": 1556893385
			}
		],
		"1556874220_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 23,
				"body": "Good luck copying all Youtube videos. LOL",
				"added": 1556893476
			}
		],
		"1556986926_15APSXZVkiBzo4HXmUkCmLkMeXV7yBJ2VL": [
			{
				"comment_id": 24,
				"body": "> [duende](#comment_25_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): What a fucking retard. Fuck off.\n\nManners, please.",
				"added": 1557008600
			}
		],
		"1557049303_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 25,
				"body": "Lulz.",
				"added": 1557059710
			}
		],
		"1557105138_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 26,
				"body": "Boring.",
				"added": 1557165652
			}
		],
		"1556898828_1EX1uMXdSHNRn9MybqnZz8zzWp79HYkGJJ": [
			{
				"comment_id": 27,
				"body": "I am so offended now. I'm going to report you!",
				"added": 1557231216
			}
		],
		"1557231045_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 28,
				"body": "> [quantumworld](#comment_417_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Hay what about an ambidextrous day!  I feel totally left out on this. That's right I am ambidextrous. I suffer from Emacs finger's syndrome. I love Emacs but the default keyboard layout is a hand killer.\n\nI wouldn't know. I use Vim. Maybe it's a privilege and that's another case of oppression?",
				"added": 1557291375
			},
			{
				"comment_id": 29,
				"body": "> [quantumworld](#comment_428_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Vi is a good text editor. Emacs is a better O.S. Its worth taking a look at Emacs it can emulate vi better than vi can. Just remember Emacs goes back to 1976. It is silly pudy of code. Emacs can do just about everything. I use Vi all the time for basic editing. Emacs Org mode is what makes it a winner.\n\nNot sure if I'm courageous enough to take on the challenge to learn Emacs. :D",
				"added": 1557322341
			}
		],
		"1557337953_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 30,
				"body": "> [spukkinfaceship](#comment_21_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): it's a pretty despicable thing to say in any case, and  reeks of mysogyny.  a person who says such things or agrees with them has no business representing people in a democracy.\n\nYou think Jess Philips didn't deserve that comment for laughing at male suicides. She's a misandrist and has no business representing people in a democracy.",
				"added": 1557350216
			},
			{
				"comment_id": 31,
				"body": "> [sinewave](#comment_17_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR): Sargon's trying to pull a Trump media maneuver. Leverage the media to platform him and promote his message even whilst they try to smear him. Using the, \"It's better to be talked about than not talked about at all\" mentality and all that.  [...]\n\nI sincerely hope you are wrong. Also, I think Sargon is not as stupid that you make it sound. Most people I personally know understand sarcasm. The mainstream media seems to be the only place where it goes right above their heads. Everyone knows the msm feels threatened by the Internet, and the louder they cry foul, the more obvious their plight.",
				"added": 1557350908
			},
			{
				"comment_id": 32,
				"body": "> [spukkinfaceship](#comment_27_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy): makes light of murdering refugees at a public rally\n\nCitation needed, obviously. This is like the \"Mexicans are murderers\" quote that turned out to be the urinalists taking a piss at Trump for saying something he didn't.",
				"added": 1557654891
			}
		],
		"1557616021_194xRv4qDg7Tax3pJ5EMN7MjLCs9T7KDoZ": [
			{
				"comment_id": 33,
				"body": "Retroshare has 'em.\n\nhttps://retroshare.cc/",
				"added": 1557655216
			}
		],
		"1557991095_12kqbnJ3QpaT6extMyBhPzaWvbi8xkPVbt": [
			{
				"comment_id": 34,
				"body": "Why do you want it you sick fuck?",
				"added": 1558070680
			}
		],
		"1568498469_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 35,
				"body": "I don't buy it. He has a right to his own opinions. I'm fed up on this outrage culture and public shaming on anyone who don't immediately buy into the \"listen and believe\" narrative.",
				"added": 1570011062
			},
			{
				"comment_id": 36,
				"body": "> The age of consent in the US Virgin Islands, where the incident took place, is eighteen.\n\nIt would be hard to find a 17 year old girl who hasn't had sexual relationships with older men.",
				"added": 1570011517
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 37,
				"body": "Anyone who's slightly politically right from the far-left is a racist. Didn't ya know that?",
				"added": 1570012204
			}
		],
		"1571450538_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": [
			{
				"comment_id": 38,
				"body": "Nice explanation for the plot. It's a damn shame people never get the real plots.",
				"added": 1571520291
			}
		],
		"1571214527_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 39,
				"body": "How about a cryptocurrency to reward seeders with?",
				"added": 1571520466
			}
		],
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 40,
				"body": "> [inforapenny](#comment_1_14qYZJxRR1B2DRR8spufYDBsj5RcNvdjfX): Spooky! Neat halloween theme fun time chat before bedtime, huh big guy?\n\nDefinitely going to dress as Lenin now.",
				"added": 1572389758
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 42,
				"body": "> [thorburn](#comment_35_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Now you need to read up on Technocracy, Transhumanism and Neo-fudalism and once you have a general understanding of those concepts read UN Agenda 21 and Agenda 2030 because that's where the world is headed right now. Socialism/Communism are merely elements of the new global social structure that being built around us.     [...]\n\nThanks for the links, I'll read up.\n\n> Watch the film Harrison Bergeron\n\nI've read the book. It's unnerving.",
				"added": 1581452504
			},
			{
				"comment_id": 43,
				"body": "> [suprnova](#comment_3_19vnNsGPgQ5LaGVDJRn6gZUaVFbV4c9Cbq): \"From each according to his ability, to each according to his needs\" --Marx\n\nThat quote... It neglects the people who either want to achieve and succeed, and those who don't even care. It also excludes criminals and sociopaths.\n\n> \"In a higher phase of communist society, after the enslaving subordination of the individual to the division of labor, and therewith also the antithesis between mental and physical labor, has vanished; after labor has become not only a means of life but life's prime want; after the productive forces have also increased with the all-around development of the individual, and all the springs of co-operative wealth flow more abundantly – only then can the narrow horizon of bourgeois right be crossed in its entirety and society inscribe on its banners: From each according to his ability, to each according to his needs!\"\n\nThat's just a load of wishful thinking. Pretty words and I'd guess a noble goal. If it were possible. But alas, it isn't. Too many different people, hard to oversee and control. You'd need a complete totalitarian state to keep people working, and silence anyone who would want to express their individuality, want or need to do whatever makes themselves happy.\n\nSeeking happiness would likely be strictly forbidden in such a state. It would be too counter-revolutionary.\n\n> Antisocial behaviour is a genuine concern, and easily resolved really.\n\nHow? By sending people to gulags? And how would you, in a communist system differentiate any differing behavior with \"anti-social\" behavior?\n\n> Marx proposed replacing money with labour certificates / vouchers that you get by working and you enter back into the system by spending them on anything, like groceries. These days, such an idea could be implemented by using a blockchain or similar technology that tracks what you 'enter' into the system by labour time and what you 'spend' by consuming.\n\nSounds a lot like forced servitude. Slavery. How would you preserve individual freedoms? Freedom of speech and expression? Freedom to leave the system if the system becomes too inhibitive?\n\n> The point being is that there's affluence for anyone participating or having gained exception (like pensioners, those being sick, pregnant women, etc).\n\nWhat about those who don't want to participate in the collective and want to create their own success by working for themselves, maybe become rich or famous by singing or some other shit that isn't considered \"labour\"?\n\nThe rest of what you wrote, about Marx and his fantasies sound pretty much something someone dreamed up high in weed. Yeah, humans aren't too bad, but don't make them do communism again. It didn't work then, and it won't work now.",
				"added": 1582238301
			},
			{
				"comment_id": 44,
				"body": "> [chernobyl](#comment_5_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE): Who in their right mind would want it? [...]\n\nWhy would the jews want communism? Israel isn't a communist state as far as I can tell.",
				"added": 1582238393
			},
			{
				"comment_id": 45,
				"body": "> [0435048ijg](#comment_1_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5): Yes. Who would possibly want freedom for themselves and everybody else? You know what sounds great? Being dominated and controlled by a small group of retards for half of your waking existence.\n\nWhat on earth are you talking about? Communism is not freedom. It's is an authoritarian view that no person must do better than others, but everyone must be equally miserable.\n\n> [0435048ijg](#comment_6_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5): I want communism\n\nWhy?",
				"added": 1583225387
			}
		],
		"1583235865_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 46,
				"body": "More likely it's just a flu with a slightly higher mortality rate.\n\nI'd say it'll probably just thin the herd a bit, taking out the elderly and the sick.",
				"added": 1583267723
			},
			{
				"comment_id": 47,
				"body": "> [fabcdefgwagon](#comment_13_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5): Covid-19 is from the melted icebergs. Since the powers that be didn't take global warming serious mother nature showing us how real it is! Unlike most illnesses and deformities and infections, Covid-19 wasn't created in a lab with a fail-safe vaccine. Hopefully this gets climate change into the political debates!\n\nI would seriously doubt your iceberg theory, as it originated far from them. Nice hook though, trying get the climate change into the discussion. But again, I don't find it plausible.",
				"added": 1583267929
			},
			{
				"comment_id": 48,
				"body": "> [mmmb](#comment_7_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy): what is your response? a chronic lack of oxygen in the brain? a severe form of schizopherenia?\n\nI can't see the comment you are replying to, is it deleted already?",
				"added": 1583268091
			},
			{
				"comment_id": 50,
				"body": "> [mmmb](#comment_8_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy): nope it isn't, perhaps he/she/it is on your mute list\n\nAh, I see.",
				"added": 1583342127
			}
		],
		"1583185944_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 49,
				"body": "A crisis can actually boost the economy for a while. A demand will rise and the producers will meet that demand and more products will be sold, stocks will rise and economy starts booming again. Until the crisis either dissipates or becomes untenable.",
				"added": 1583268296
			}
		],
		"1591525925_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 51,
				"body": "Blazing Saddles",
				"added": 1591787795
			},
			{
				"comment_id": 54,
				"body": "I just hope they'd enable .mkv (matroska) containers. I've got many of those.",
				"added": 1591997543
			}
		],
		"1591924953_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 52,
				"body": "> [blurhy](#comment_529_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Who told you communism has failed\n\nCommunism didn't fail. It never worked in the first place.",
				"added": 1591996682
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 53,
				"body": "Suicide? If you ask me... It's not worth it, completely overrated",
				"added": 1591997176
			}
		],
		"1594689481_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 55,
				"body": "Is Zeronet dying tho?",
				"added": 1594834437
			}
		],
		"1611726067_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [
			{
				"comment_id": 56,
				"body": "Am I the only one who thinks fascism died with Mussolini?\n\nMost of the guys who post \"fascism\" online are usually just teenage trolls.",
				"added": 1611737657
			},
			{
				"comment_id": 63,
				"body": "> [jager](#comment_52_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): OT: How do I follow people from here? Still getting up to speed. There's a few great commenters  I want to follow.\n\nMaybe not on ZeroTalk, but on ZeroMe you can follow people.",
				"added": 1611785076
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 57,
				"body": "> [6dus](#comment_2_12t1vW5XuyAByGyqGYwhiZsusmnyKKwqfM): Yes, exactly. If you research single-victim to multiple-offender, you'll find that niggers are closer to 80% - 90% perpetrators. It's the juden that defend niggers who will destroy White society.\n\nYou must be so proud! Bloody hell what an asshole.",
				"added": 1611738425
			}
		],
		"1611277411_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 58,
				"body": "> [deuxzaron](#comment_65_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Anyone who pays attention knows the Great Reset has to do with stakeholder capitalism. Returning capitalism to the customer, the employee. For decades it's become shareholder capitalism and favored the investor. This has caused planned obsolescence, loot boxes, and releases of AAA games unfinished like Cyberpunk. Take back capitalism for the people. Reset that shit\n\n\"You will own nothing, and you will be happy.\"\n\nTheir words, not mine.",
				"added": 1611738935
			}
		],
		"1610999130_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": [
			{
				"comment_id": 59,
				"body": "Why be an idiot?",
				"added": 1611739118
			}
		],
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 60,
				"body": "I don't know if I want to sweep racism under the rug by ignoring it.\n\nI have a better recourse. Make them a laughing stock. Where's the tar and feathers button?",
				"added": 1611739292
			}
		],
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 61,
				"body": "All of them are private, centralized services. Not very good for privacy, or freedom of speech.\n\nHow about something decentralized and immutable as in blockchain, like Bitcoin or Ethereum?",
				"added": 1611739754
			}
		],
		"1611356175_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 62,
				"body": "Hive is a blockchain for information and other stuff that matters.\n\nhttps://hive.io/",
				"added": 1611740047
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 64,
				"body": "Is it possible to host something like git on zeronet? That way it would probably be possible to continue keeping the project alive.",
				"added": 1625684373
			}
		]
	},
	"comment_vote": {
		"1_1MH6Mx8cxRRWFZEckKc8tztJGDyEBzri8H": 1,
		"1_148GxiUjfgdpS6U937hDxjAHqVQKyfGWCf": 1,
		"214_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"152_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"2_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"2_1KoFQ8qs1bvxJ3XNAuT1yJYcXiUgzTnFn9": 1,
		"1_19sGfAbotYrMuviW17oKksVHaZ8g7UcYEo": 1,
		"94_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"217_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"8_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"1_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C": 1,
		"821_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"4_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"1_1P7EzRpBkZmopxsxukTKQRrQkRwB2GxJaP": 1,
		"5_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": 1,
		"2_17FiRbZZvpgdkSUeVv3qbqKjTe9DDea1d8": 1,
		"1_114QMqF2DuSQDKc46cTS8iccz3k4onvKRy": 1,
		"17_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW": 1,
		"18_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"13_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"79_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"4_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": 1,
		"63_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"65_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"66_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"26_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"7_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"8_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR": 1,
		"4_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"159_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"19_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW": 1,
		"384_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"6_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": 1,
		"387_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"739_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"7_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"413_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"837_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"838_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"416_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"417_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"428_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"28_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"8_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"17_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"770_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"7_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi": 1,
		"134_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"2_1PXuHJpV6j4R9cfD9uHjKwoUtvFN3z3cd7": 1,
		"351_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"3_1HyfQZJewq333XifGc1UMiwEazYMyFosjX": 1,
		"4_1JELMpwdE941yFgHCCnTXfchb1Wxsiuuy4": 1,
		"4_1KEXLrCcQYabnbLngN1Vh3VnG3yD2h21Uj": 1,
		"2_13qtuJDbMg2qcQxczwAHf2H8Wc5n762J41": 1,
		"2_1PJfQpxEFVYhaJhA1wMQBhBaqwb5vBQit9": 1,
		"216_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_114QMqF2DuSQDKc46cTS8iccz3k4onvKRy": 1,
		"17_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"18_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"19_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"20_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": 1,
		"446_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"841_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"20_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"276_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"34_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"52_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"7_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"32_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"33_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"55_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"56_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": 1,
		"190_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"148_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"189_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"18_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX": 1,
		"763_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"765_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"195_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"44_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"770_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_1CAq9Lor26iBmSMSQpXiBJUL6b6Y5WU8UA": 1,
		"57_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"66_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"59_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"215_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"791_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"34_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"35_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"36_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"40_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"1_18hZmrTkwrqFu7bEWYmBJ1bKGXUm6GzQwG": 1,
		"8_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1_16Fu36vdXG8dynYf9XUqN9F1za5xa19gHK": 1,
		"35_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"962_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"2_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"7_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"11_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": 1,
		"965_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"44_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"43_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"10_1MLqjfXio3ZiogLZaoDaqsFxLBbhinzvPN": 1,
		"92_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"4_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX": 1,
		"23_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": 1,
		"12_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"473_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"87_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"3_1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG": 1,
		"131_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"73_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"82_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"1_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"2_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": 1,
		"8_15ebtdT12VepdkSH4fX5qkRdXkM5Kpf7t8": 1,
		"14_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"46_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"41_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"1_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": 1,
		"2_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z": 1,
		"68_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"95_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1_1Ks1WhJohpwzzWQvVdWzaWaV4BLXeGp9J2": 1,
		"3_1GhJcGjryaQ8s6CL5vraeUd15TiXCvY9m2": 1,
		"2_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"61_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"8_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": 1,
		"9_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg": 1,
		"4_1AmREURqCZmJEr8bH1zQgJd1kGrnqkeTiy": 1,
		"69_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"70_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"2_1BGkjiYVSWuenLNRJoghTFwdCKMgJCRZXL": 1,
		"71_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"48_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"898_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}