{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1604477660,
			"title": "child porn guide / Video soon under my username",
			"body": "http://127.0.0.1:43110/1Equ3Mp1jmUq7pK8RYS8F44UfgFF1uaJ1h/",
			"added": 1604477659
		},
		{
			"topic_id": 1604697444,
			"title": "Child porn community Under Work Zeronet",
			"body": "http://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/\n\nPlease if you like Seed we need more seeder to Grow (under work)",
			"added": 1604697442
		},
		{
			"topic_id": 1606619291,
			"title": "Zona (Child Lover community) - Pedo Join Us",
			"body": "http://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/\n\nor in the deepweb:\nhttp://szi2epuysetsljz6g2ft7al7izrwtzutapfreog6fasm5aisygo6vyyd.onion/topic-link-zona.html\nhttp://szi2epuysetsljz6g2ft7al7izrwtzutapfreog6fasm5aisygo6vyyd.onion/",
			"added": 1606619288
		},
		{
			"topic_id": 1608307048,
			"title": "Child Lover Community (Zeronet-Tor)  Pedo",
			"body": "You can join Us , and Seed Only if you can do securely over tor. like inside Whonix..\n\nhttp://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/\n\nstay safe and ... For all anti Pedo who see that and want to comment shit or insult us .. I don't care ..",
			"added": 1608307044
		},
		{
			"topic_id": 1610223531,
			"title": "Child Lover Community On Tor (deepweb) and - Zeronet (pedo)",
			"body": "hi all , we have changed our topic link of The Zona Url .. \nhttp://iqqa4ew73bsuxnapok3yqirp7xxvbfhzzjimci7vdg3km6r2pnd7lcqd.onion/topic-link-zona.html\n\n\nand for Zeronet our Community:\nhttp://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/",
			"added": 1610223526
		},
		{
			"topic_id": 1610391633,
			"title": "Tor Junuary 2021 DDOS All of the Network Shutdown per moment !",
			"body": "Tor Project wrote:\n\n    From: Roger Dingledine\n    Date: 2021-01-10 18:54:41 UTC\n    Subject: [network-health] v3 onion services unusable for a few hours today\n\n    Hi folks,\n\n    The overload bugs on the directory authorities are continuing, but they\n    also continue to be mostly manageable.\n\n    But today, we spent several consensus intervals in a row without making\n    a consensus -- which is supposed to be fine because Tor clients can do\n    fine so long as they have a consensus from within the last 24 hours,\n    but it exposed a bug in the v3 onion service implementation, where v3\n    onion clients and v3 onion services choose not to even attempt to fetch\n    or publish v3 onion descriptors:\n\n    Jan 10 11:32:24.364 [warn] No live consensus so we can't get the\n    responsible hidden service directories.\n\n    The fix imo is that we need to make v3 onion services work under the\n    same time assumptions as the other parts of Tor -- if you have a usable\n    consensus, then use it.\n\n    I've opened this ticket for the network team:\nhttps://gitlab.torproject.org/tpo/core/tor/-/issues/40237\n\n    --Roger\n\n\n\n--------------------------------------------------------------------------------------\nAn explanation of the attack from Paris, the co-admin of Dread.\n\n    The Tor network is not fully decentralized. When you first connect to the Tor network there is hard coded IPs that your Tor process uses to bootstrap your connection into the Tor network. These IPs allow your Tor process to load up the network’s consensus. This consensus tells the Tor process things like what relays are within the network, which are good relays, bad relays, which are guards, exit nodes, how much traffic a relay can handle, that kind of idea. Your Tor process gets all that information and validates it by signatures of these hard coded IPs. These hard coded IPs are called authority nodes. There is currently 10 of them on the Tor network. And they are why the Tor network cleared out V3 onions for a period of time.\n\n    The authority nodes “vote” on a majority consensus they all share with the Tor network. Generally a new vote happens every hour and the voting process takes 5 minutes. If there is no consensus for three times in a row (as in for three hours) the health the network goes massively down. You can check consensus health at this URL https://consensus-health.torproject.org/. The vote decides a lot of things in the network and when the consensus can’t be succeeded, there is a lot of issues that can occur. Things like V3 Directory variables not being included within a valid consensus so all V3 onions become unreachable.\n\n    The attack basically overloads the authority nodes by sucking up all their bandwidth so the authority nodes can’t communicate between themselves to vote and make a consensus.\n    This fundamentally breaks the network if it goes on too long.\n    This isn’t so new. Like a lot of the Tor attack issues which get exploited in this way there is a closed issue on it.",
			"added": 1610391627
		}
	],
	"topic_vote": {
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607077342_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": 1
	},
	"next_comment_id": 45,
	"comment": {
		"1604477660_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 1,
				"body": "thanks for your reply , is appreciated ... We are a Community of Child lover in the deepweb (tor) and we be there too.. if you dont want to see anything like that leave freedom place (zeronet) or block us You can add to black list.. Bye",
				"added": 1604507570
			},
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/",
				"added": 1604697363
			},
			{
				"comment_id": 4,
				"body": "simonbellamy Use The pedo hidden whonix guide is Tails + Hidden veracrypt Conteneir + hiddem vm (virtualbox) + Whonix .. at the end you have zeronet inside Whonix is possible to install on whonix .. After you are More secured than now probably .. Everything can be a Honeypot.. just secure your self ..\n\nI try to build a Bigger community on All network ..",
				"added": 1605059526
			},
			{
				"comment_id": 5,
				"body": "we have an onion link v3 too http://szi2epuysetsljz6g2ft7al7izrwtzutapfreog6fasm5aisygo6vyyd.onion/index.html",
				"added": 1605062158
			},
			{
				"comment_id": 9,
				"body": "goodafternoon la la la la la do you have say something i dont have ear anything .. Long life to all Child lover and fuck all Fat American cop and anti pedo .!",
				"added": 1605557001
			},
			{
				"comment_id": 10,
				"body": "technology i am only 1 guy over Million ... Good luck hahahahahahah.",
				"added": 1605557042
			},
			{
				"comment_id": 12,
				"body": "> [goodafternoon](#comment_108_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): goodafternoon\n\nif you want .. I am not scary.",
				"added": 1605632201
			}
		],
		"1604714899_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 3,
				"body": "<a href=\"localhost\"><img alt=\"the image is loaded\" src=\"http://127.0.0.1:43110/sasfafPqwbVP74eAat6BCD3xYzyLNxfhEX/Data/Files/1e9d617571c60fcb3dewce5ga785w8erq930b6s3_preview.jpg\" /></a>\n  </div> \n\n\nhi i can Show picture or gif on my html site with this line of code localhost where is write is the path to the file of you want a Click to the picture to download file Example. but the next is to show your picture or .gif to your page.",
				"added": 1604718878
			}
		],
		"1605144642_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 6,
				"body": "Youtube have a problem with her server maybe ddos or a bad update error , Do you know any other site Down at the moment ?",
				"added": 1605147882
			},
			{
				"comment_id": 7,
				"body": "Youtube have a problem with her server maybe ddos or a bad update error , Do you know any other site Down at the moment ?",
				"added": 1605147919
			}
		],
		"1605385048_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 8,
				"body": "The problem is They are Fat American Cop , They beat her Wife ,kid and they does not respect the laws and Abuse of her power to Beat ,kill ,rape.. I have ear in usa is take less of 2 years to Be in the police.. Stupid contries, Stupid people who kill poor innocent children and familly in irak ,afghan etc .. with her drone ,etc.. They are Friend with other poor contries and They sell Weapon to Certain contries and This contries Use the weapon to kill civilian and usa know that and continue ... \n\nPlease bomb the Usa and her friend !",
				"added": 1605385222
			}
		],
		"1605530541_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 11,
				"body": "use whonix and all pass by tor to use zeronet and whonix say No ip leak possible ... you can add Router vpn , and take out of your computer Wlan card to have wifi , Mic and camera .. use only cable network to multiple Device to pass your internet over vpn ,tor etc.",
				"added": 1605557147
			}
		],
		"1604697444_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 13,
				"body": "This message is for All stupid anti pedo if you dont know how to use Whonix and how to secure your self is not my problem .. Nothing will stop me .",
				"added": 1605672473
			},
			{
				"comment_id": 14,
				"body": "> [1snwargdtitor](#comment_5_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh): If you get off to children you belong shot on the side of the road. Illegal or legal doesn't matter, they're fucking kids.\n\nYou can think what you want. i am a child lover and i am in Alice in wonderland , and rindex Forum pedo I am a member and i am in another Board forum .. You dont need to reply to this topic Serve to nothing i share the link.",
				"added": 1605683262
			},
			{
				"comment_id": 16,
				"body": "> [mxh69420](#comment_18_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): yeah. you post your cp as you wish, we post our disgust as we wish. cp is wrong, its bad, its evil.\n\nYou are not obligated to seed or tor respond you can Just Block us on zeronet do you know is possible ? if you are not for Child lover community. To see child naked ,masturbation , and Take pleasure.",
				"added": 1605940516
			}
		],
		"1605755443_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 15,
				"body": "you can use a linux os and use anonsuft and probably or a vpn and use an Emulator Android and use textme or textnow application or other free app to received text message or Call .",
				"added": 1605770008
			}
		],
		"1605934602_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "i think to put her information on that for ''help to not have this arrived' is just give the  name and all information of probably futur pedo .. i dont speak well english but .. Even if is banned or not you can find it on A lot of network is just re enforce our community.",
				"added": 1605951890
			},
			{
				"comment_id": 18,
				"body": "> [slotmaster](#comment_6_1Fnmdj3aPDFfvY2zheejDVj7vMRbgoWPVF): How opened the source: http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/1550688635I only see \"User not found or muted\".\n\nif you are the admin you can do it in your Zeronet folder inside this folder /1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB i think ..",
				"added": 1606097241
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 19,
				"body": "Please stop cring and leave zeronet .. if you are not for freedom..",
				"added": 1606097491
			}
		],
		"1606619291_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2729_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This was earlier called the child porn community by the same user. Stay away.\n\nChild porn - Child Lover .. is a pedo Community link and Share .. If you are not for That Feel free to Ignore us ... Because we will continue to Distribute our File.. is the objective to have a Big Big Database of child porn.. (We use whonix and all pass by Tor To share the Child porn)..",
				"added": 1606659258
			},
			{
				"comment_id": 21,
				"body": "> [pornzero](#comment_3_1JUV6t4NFxuUQztyUWTNvyDhGz3bqWENmr): Just go fuck yourself you dipshit\n\nla la la la i dont Ear anything from Anti pedo Piece of shit .you are",
				"added": 1606670773
			},
			{
				"comment_id": 22,
				"body": "> [bigbadbob](#comment_1212_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): please neuter yourself at least.\n\nso you say something ? i dont see LOOOOOOOOOOOLL anti pedo .. of you are i continue my work to contribute.",
				"added": 1606672374
			},
			{
				"comment_id": 23,
				"body": "you can continue to cry like the bitch of you are here . anti pedo ..",
				"added": 1606673635
			},
			{
				"comment_id": 24,
				"body": "All muted Bye bye anti pedo .",
				"added": 1606679972
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 25,
				"body": "hey , why because we don't know how to Host a i2p Website securely inside whonix. we have already a zeronet site and a tor site.\n\nand yess Javascript can be Not a good thing .. but Zeronet allow to Share with a lot of people Without need server and pay something. ",
				"added": 1606986336
			}
		],
		"1607077342_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 26,
				"body": "hi we don't have  That but you can find The Zona ont Zeronet http://127.0.0.1:43110/1239UwPqUAbVP74eAa16BCDxYzyLNxfhEX/\n\nStay safe use Whonix for Zeronet .. hide your trace before. For the moment we have a Lot of work 2 Site to manage + rename video cp and Add it for our site (zeronet) section Download... be patiently",
				"added": 1607089303
			}
		],
		"1608288215_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 27,
				"body": "Fuck you all Anti pedo ..",
				"added": 1608306921
			}
		],
		"1608307048_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 28,
				"body": "> [tomer](#comment_40_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): nice empty comment\n\nhaha :)",
				"added": 1608420130
			},
			{
				"comment_id": 29,
				"body": "Free to all to Enter or not ( We recommended Whonix for using Zeronet) ..",
				"added": 1609404083
			}
		],
		"1609698977_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 30,
				"body": "i am , maybe wrong but : https://www.reddit.com/r/zeronet/comments/45xhfn/new_to_zeronet_how_do_i_backup_my_datausersjson/",
				"added": 1609737879
			}
		],
		"1609818109_16GjpPqXFJ8Vv9bXgBPCNswucvtTeDU4C5": [
			{
				"comment_id": 31,
				"body": "test Received :P",
				"added": 1609832697
			}
		],
		"1609818090_16GjpPqXFJ8Vv9bXgBPCNswucvtTeDU4C5": [
			{
				"comment_id": 32,
				"body": "hi",
				"added": 1609832709
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 33,
				"body": "> [uwnz](#comment_1_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8): wtf?? Must be hunter Biden on crack again\n\nlearn respect ..sons of bitch !",
				"added": 1610226591
			},
			{
				"comment_id": 35,
				"body": "if you don't like to see My post or whatever Ignore me :) because you are not the First to Try to Brain fuck me etc .. I don't care seriously. ! i will continue to promote Everywhere The Community ! ..",
				"added": 1610280567
			},
			{
				"comment_id": 36,
				"body": "> [mooncricket](#comment_2_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs): Hope to see you on a rekt thread soon faggot.\n\nbake bake bake You are an Anti pedo Piece of Shit .. i don't have time to loose with you ! you don't scare me ! ",
				"added": 1610285225
			},
			{
				"comment_id": 37,
				"body": "> [kekistancitizen](#comment_21_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp): I hope interpol finds you and sends you to Guantanamo bay, sicko.\n\nMiawww miawww miaww you bake like a cat .. More loud please ! ?",
				"added": 1610289446
			},
			{
				"comment_id": 38,
				"body": "> [biznizman](#comment_2_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): Post your community links if you must, but DON'T FOR THE LOVE OF JESUS TAPDANCING CHRIST DON'T LINK TO ANY CONTENT!!!! [...]\n\nIs Recommended to use The Whonix .. with whonix all pass over Tor.. and Zeronet you cannot download Cp by Accident .. you need to on the link if you see cp you can remove .. is possible to explain in case of arrest that . Remember zeronet say No ip to trace is use the same techno.. of Bitcoin wallet .. the public key.. \n\nI will build this community and i think i am not the only in zeronet who build this .. you dont see them because you dont have the link .. For information I write every time Child porn , pedo or Topic link (tag) to say is pedo . \n\ngood day !  Zeronet use javascript if people dont use whonix they use it at her own risk ..",
				"added": 1610390964
			},
			{
				"comment_id": 39,
				"body": "> [namvata55](#comment_18_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): yeah I'm gonna trust the pedophile's advice on how to not accidentally download child porn, suuuuuureeee.\n\nYou are paranoid is Crazy if you cannot secured your self fine leave zeronet and tor .\n\nYess all can be fucked today but in whonix is the SAFEST operating system in the world there inside we can use Sandbox (firetool - firejail) to block internet access and syscall. You are not obligated to Download cp but is Not More Safe of For who download child porn in the Deepweb tor .. !! now I mute you because i dont have time to loose with Troll !",
				"added": 1610393288
			},
			{
				"comment_id": 40,
				"body": "> [apely56](#comment_12_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG): This is the same tactic that they used the first time users flocked over here. Do not click the links. It's half propaganda and half honeypot. Or, on second thought, fucking click it, so they can disappear you.\n\nanti pedo No one care about your Tactic to scare people away ... we have a community on tor too.. bye bye dog.. We recommended Whonix to use Zeronet !",
				"added": 1610479340
			},
			{
				"comment_id": 41,
				"body": "> [risktolerance](#comment_2_1CZpqLp5gdPKoBD3XJEAfDLAj1bjt96Wqd): kill yourselves, pedo fucks\n\nis all of you can do ? 1 insult ? hahah.",
				"added": 1610479356
			},
			{
				"comment_id": 42,
				"body": "> [imblack](#comment_2_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY): These are the real \"domestic terrorists\" Fuck you, you sick fucks.\n\nTo be a child lover is to be a Terrorists ? hahah funny !",
				"added": 1610479394
			},
			{
				"comment_id": 43,
				"body": "> [quantumkitty](#comment_527_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I don't support the distribution of child pornography.\n\nfine for you .. no one are obligated to share !",
				"added": 1610479421
			}
		],
		"1610272179_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 34,
				"body": "Use Whonix (the operating system) and install zeronet there. Is pass over tor zeronet ! \nhttps://www.whonix.org/wiki/ZeroNet\n\nif you want a better Security fallow the pedo hidden whonix guide \nhttp://127.0.0.1:43110/1Equ3Mp1jmUq7pK8RYS8F44UfgFF1uaJ1h/\n\nThe pedo hidden whonix guide explain how to use Tails As Host + encrypt a New disk (encrypt luks ) and inside Create a Hidden volume Veracrypt (and put inside the hidden volume Hidden vm (virtual machine for tails) .. in the final you have Hidden vm hide inside the hidden volume .. no one can prove you have hidden vm or a hidden volume .. If you want you can import whonix in the hidden vm and Other os ..",
				"added": 1610280432
			}
		],
		"1610391633_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 44,
				"body": "Vpn No log + zeronet in whonix or Whonix + vpn no log inside , or All of that + a Vps Server pay anonymously ..",
				"added": 1610479536
			}
		]
	},
	"comment_vote": {
		"473_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"64_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"55_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"3_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1
	}
}