{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1562004913,
			"title": "ZeroNet крутится вокруг одного человека. И это нужно исправить",
			"body": "Не уверен, где лучше публиковать, на LOR'е или на Ru ZeroTalk, поэтому пусть пока будет и там, и там.\n\n---\n\n> Многие решили, что речь о том, чтобы отжать кое-что у кое-кого. Я имел в виду не это. Но если меня поняли так, и на меня со всех сторон гонят со словами \"ах ты ж негодяй\", я отступлюсь. Если все считают, что то, что сейчас представляет собой ZeroNet таким и должно остаться, я пойму.\n>\n> Значит, будем чинить централизацию по-другому. Напишем свой ZeroNet, на другом языке, с нуля. Тогда разработка не остановится.\n>\n> Спасибо за объективные обвинения.\n\n---\n\nВсем известно, что @nofish -- создатель ZeroNet. Чтобы не было недопониманий, сразу скажу, что я благодарен ему за созданную сеть.\n\nТем не менее, есть проблема: на данный момент @nofish -- единственный человек, у которого есть доступ к:\n\n- ZeroTalk'у, ZeroMe, и т.п., и к остальным сайтам\n- ZeroHello\n- Репозиторий GitHub и ZeroUpdate\n\nЧто приводит к парочке проблем.\n\n### Социальные сети\n\nВ ZeroNet любой сайт, который содержит пользовательский контент, не может работать без вмешательство его владельца. Чтобы можно было пользоваться ZeroTalk'ом, nofish должен следить за ограничениями размеров data.json. nofish поддерживает список хабов на ZeroMe. Не стоит и говорить, что есть nofish перестанет управлять всем, нам придется выкручиваться со старыми версиями зайтов без новых фич.\n\n### ZeroHello\n\nДомашняя страница ZeroNet'а приветствует нас каждый день. Однако, это не все, что она может делать -- ей даны права админа на ноде. То есть, если nofish'а взломают (честно говоря, я бы не удивился), код ZeroHello может быть изменен так, чтобы уничтожить всю сеть. Еще страшнее то, что изменения бы распространились по ZeroNet'у мгновенно, уничтожая все за пару минут.\n\n### Репозиторий GitHub и ZeroUpdate\n\nВ этих двух местах ZeroNet хранит свои исходники. И именно эти источники он использует для обновления. Из-за этого возникают сразу 2 проблемы:\n\n- Изменение кода. Это мы уже обсудили, поэтому пропустим\n- Остановка обновлений. Что может быть еще опаснее в долгосрочной перспективе\n\nZeroNet нацелен на децентрализацию. Все его сайты децентрализованы, поэтому в сети ничего не может отказать. В сети. Но вне ZeroNet'а все еще есть централизация. И это nofish.\n\nВ любой момент из-за проблем у nofish'а разработка ZeroNet'а может просто встать. Большинство пользователей получают обновления через GitHub и ZeroUpdate. Но если они перестанут обновляться, нельзя будет синхронизировать код пиров.\n\nКонечно, можно сказать: форкни сеть, репозиторий-то публичен. Сделай свою SuperNet. Ага. SuperNet. А не ZeroNet. Не все переключатся на *мой* форк. Или еще чей-нибудь форк. ZeroNet разделится на кучу маленьких кусочков, которые даже не смогут общаться друг с другом: какие-то форки перестанут обновляться, какие-то будут применять устревшие решения. Сообщество ZeroNet'а просто уничтожится. В одну секунду.\n\n---\n\nЕсть ли вообще решение?\n\nОдин из возможных вариантов -- помочь nofish'у работать над проектом. Один владелец -- это плохо. Несколько владельцев -- лучшее, что можно сделать сейчас.\n\nВот что нужно сделать *прямо сейчас*:\n\n- (возможно) Создать организацию на GitHub -- это поможет общению над ZeroNet'ом и работе над плагинами\n- Добавить других пользователей как collaborator'ов на GitHub\n- Поделиться ключами от ZeroHello, ZeroUpdate, ZeroMe, ZeroTalk и, возможно, каких-то других сайтов с доверенными пирами\n\nПосле этого, мы вместе сможем улучшить это решение:\n\n- Аккуратно настроить репозиторий на GitHub:\n  - Разрешать мержить pull request'ы, если есть хотя бы трое из пяти согласны (конечно, в случае, если добавятся 4 человека)\n  - Запретить изменения на ветках `py3` и `master` без pull request'ов -- это станет еще одной защитой от внесения вредоносного кода\n  - Разрешить изменение списка доверенных пользователей, если сообщество ZeroNet за это проголосует\n    - Это можно реализовать, сделав некоторых доверенных пользователей владельцами организации\n- Улучшить поддержку мультиподписи\n  - Если мы решим, что что-то нужно изменить, и мы достигнем консенсуса, сайты должны обновляться автоматически\n  - Если консенсуса достичь не получается, никаких изменения вносить нельзя\n\n---\n\nНаконец, стоит обсудить, кому, собственно, дадут права управлять сетью. Вот лучшее решение, которое я смог придумать:\n\n1. nofish'а добавляем автоматически\n2. Вы можете проголосовать за любого пользователя (включая) себя, прокомментировав [на английском ZeroTalk'е](/Talk.ZeroNetwork.bit/?Topic:1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di). Объясните, почему Вы решили проголосовать так (или почему нужно выбрать именно Вас), чтобы мы были уверены, что вы не бот и что мы понимаем, чем человек может быть полезен сети -- будет ли он разрабатывать ядро сети, плагины, зайти, или он \"генератор *хороших* идей\", или он силен в теории, и т.д.\n3. Если Вы кого-то поддерживаете, либо опубликуйте свой комментарий (на английском ZeroTalk), либо просто лайкните чей-то еще комментарий. (если A своим комментарием голосует за B, и Вы лайкаете этот комментарий, то голос уходит к B, а не к A)\n4. Голосовать можно за нескольких человек\n5. По прошествии какого-то времени, несколько пользователей с наибольшим количеством голосов будут избраны\n  - Период времени нужно обсудить. Я не уверен, как лучше сделать, поэтому буду рад предложениям\n  - Количество выбранных пользователей тоже нужно обсудить. Я бы выбрал лучших 4 человек, а если у\n  участвовать будет мало людей, то из них тех 4х, за кого больше 20% голосов\n  - Голоса тех, у кого нет *хороших* комментариев (т.е. ничего кроме спама) на ZeroTalk'е (ну или на русской версии) до 1 июля, не будут учитываться. Но если они прокомментируют (с каким-то объяснением, а не просто лайкнут), их голоса *будут* учитываться\n\n---\n\nЖдем ответа от @nofish.",
			"added": 1562004912
		}
	],
	"topic_vote": {
		"9_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": 1,
		"1525926189_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1540369286_1pjRF8UjyBfQLRZbSquP2Hu5EAKb2y1f2": 1,
		"1525877074_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": 1,
		"8_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1597473464_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": 1,
		"1546858418_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": 1,
		"1576816508_1Nfdg8N5XXZQaK8jxopdUHcb8fZNBqfVzA": 1
	},
	"next_comment_id": 32,
	"comment": {
		"1525877074_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 1,
				"body": "Хабр можно будет в теории сделать через CMS. Свою ZMS допилю - можно будет плагинчиками попробовать :)",
				"added": 1525880736
			}
		],
		"1527957713_1MLUqSEnxsRvThQEP2wqWeTFBAk9oTD4iB": [
			{
				"comment_id": 2,
				"body": "По сути, решения тут простого нет. Нужно либо менять ядро зеронета, чтобы запрещать редактирование файлов (но тогда надо будет создавать новый файл на каждый пост), либо делать блокчейн.",
				"added": 1527957986
			}
		],
		"1524945156_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_153_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да, кстати. Странно. Прошлой осенью кто-то реализовал поддержку i2p, но в апстрим этот код так и не пошел. Не знаю, почему, может дело было в качестве кода. Может быть, @gitcenter знает какие-то подробности, он больше в теме разработки ядра.\n\n> This currently does not work fully, because i2p.socket (which this uses) doesn't listen properly under gevent. This means that ZeroNet can connect to I2P torrent trackers, and it can connect to peers, but it can't successfully listen for peer connections.\n\nВ том-то и дело, что не до конца реализовал. Сам PR тоже висит в состоянии work in progress. Автор PR-а вроде на него забил. Поэтому нужно самим допиливать. Гляну пока, что уже сделано, может, допилю.",
				"added": 1561971600
			},
			{
				"comment_id": 4,
				"body": "> [blazingeye](#comment_21_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Кстати о блокировках и изоляции. Дано: только что созданная физически изолированная сеть без трекеров и машина, которая может время от времени ходить в общую сеть. Задача: завести zeronet. Для этого потребуется трекер поднять локально? Будет ли адрес того трекера передаваться в общую сеть? [...]\n\nВроде как zeronet уже умеет по LAN'у общаться, без трекеров. Поэтому, если просто локалка -- и так будет работать, если что-то сложнее -- ну да, нужно поднять локальный трекер. На счет того, будет ли он передаваться во внешнюю сеть -- не уверен, сейчас код гляну.",
				"added": 1561971923
			},
			{
				"comment_id": 5,
				"body": "Ага. Обмен трекерами происходит за счет плагина AnnounceShare. Если его просто вырубить, во внешнюю сеть трекер не вылезет.",
				"added": 1561972061
			},
			{
				"comment_id": 6,
				"body": "По-хорошему -- реализовать DHT, и готово. Трекеры не нужны будут, разве что как bootstrap-ноды. Но у DHT есть одна особенность, которая (вроде) не лечится -- анонимность. Зная IP, можно быстро узнать список сайтов, которые эта нода хранит, и до них достучаться. Если это какая-то dev версия/платный контент, не очень хорошо получается.",
				"added": 1561972331
			},
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_159_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Не понял.\n\nХранить в DHT что-то, кроме таблицы \"site address -- IP\" бессмысленно, иначе придется стучаться в кучу IP, пока не найдешь сида, что ужасно медленно.\n\nА если эта таблица публично доступна, то можно легко узнать, какие адреса вообще существуют и у кого они хранятся.",
				"added": 1561972709
			},
			{
				"comment_id": 8,
				"body": "> [blazingeye](#comment_23_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Проблема анонимности легко лечится тором. Кстати, я сейчас нагуглил вот такое: https://github.com/cretz/tor-dht-poc . Оно на js и go, но, думаю, если грабли там уже собраны, то можно на основе тамошнего алгоритма всё сделать.\n\nАга, а, на секундочку, откуда Tor берет список пиров?..",
				"added": 1561972774
			},
			{
				"comment_id": 9,
				"body": "> [geekless](#comment_160_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): То же самое решается поднятием трекера. Я вообще рассматриваю вариант поднятия трекера на белом IP с целью получения полного списка сайтов и запуска краулера по ним.\n\nРазница все же есть. Пожалуй, лучше открыть список сайтов нескольким трекерам, чем вообще всем.",
				"added": 1561972872
			},
			{
				"comment_id": 10,
				"body": "> [geekless](#comment_161_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): ??? А чем хуже хранить \"site address -- .onion address\" и \"site address -- .i2p address\"? [...]\n\nИмелось в виду \"site address -- peer address\", конечно же, т.е. любой способ подключения.",
				"added": 1561973005
			},
			{
				"comment_id": 11,
				"body": "> [geekless](#comment_162_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Но долгим наблюдением можно собрать много адресов, да.\n\nТут внезапно появляется вопрос про \"долгим\". По идее, можно быстро получить штук 1000 адресов точно.",
				"added": 1561973223
			},
			{
				"comment_id": 12,
				"body": "> [geekless](#comment_162_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Имхо, как раз запуск трекера более прямолинеен, т.к. все пиры, получившие анонс о существовании трекера, будут коннектиться к нему безусловно.\n\nАнонса о существовании трекера нет. Есть запрос на получение списка трекеров. И пока своих трекеров хватает, никто на новые не перейдет.",
				"added": 1561973304
			},
			{
				"comment_id": 13,
				"body": "> [blazingeye](#comment_25_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Если я правильно понимаю, там оперирование не IP идёт внутри Tor, а адресами узлов, до которых луковичная маршрутизация идёт и IP не выдаётся в итоге в списке.\n\nРечь о том, что для того, чтобы подключиться к сети Tor, нужен какой-то адрес. И, внезапно, мы возвращаемся к той же проблеме.",
				"added": 1561973364
			},
			{
				"comment_id": 14,
				"body": "> [geekless](#comment_163_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я потерял ход мысли. Можно краулить всю сеть, начиная от ZeroSites, и опрашивать трекер на предмет адресов.Рассматриваемая проблема касается только адресов, которые не были анонсированы как контент внутри сети, типа свежесозданных сайтов. Такие адреса известны только трекеру или, в будущем, DHT. Это большая проблема? В любом случае это публичная информация, а что требует скрытия, то в ZeroNet надо шифровать.\n\nДа, это проблема. У меня сейчас на клиенте висит куча недоделанных сайтов, которые так выпускать не очень бы хотелось, и пара сайтов с относительно приватной информацией. Да, аккуратно закрытой от ZeroNet, чтобы снаружи нельзя было достучаться, но кто знает. Было бы не хорошо, если б кому угодно эти адреса были доступны.\n\nИ не такая уж и публичная это информация. Сейчас ZeroNet этот список старательно от остальных пиров прячет.",
				"added": 1561973544
			}
		],
		"1562004913_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 15,
				"body": "> [if0](#comment_77_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для меня это - откровение. Не думал, что здесь все настолько запущено, потому что зависит от желания, недосмотра или ошибки одного единственного человека... Все зависит от его позиции. Он сам понимает риски? Если нет -  то только форк. Лично я - точно не буду использовать сеть с такой \"точкой отказа\".  [...]\n\nЦель -- не сказать, какая сеть плохая. Цель -- улучшить ZeroNet. И сейчас мы это обсуждаем в английской ветке.",
				"added": 1562010485
			},
			{
				"comment_id": 16,
				"body": "Речь не о том, чтобы отжать кое-что у кое-кого. Но если меня поняли так, и на меня со всех сторон гонят со словами \"ах ты ж негодяй\", я отступлюсь. Если все считают, что то, что сейчас представляет собой ZeroNet таким и должно остаться, я пойму.\n\nЗначит, будем чинить централизацию по-другому. Напишем свой ZeroNet, на другом языке, с нуля. Тогда разработка не остановится.\n\nСпасибо за объективные обвинения.",
				"added": 1562066446
			},
			{
				"comment_id": 17,
				"body": "> [geekless](#comment_171_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Зачем с нуля-то? Чем на питоне плох?\n\nТем, что \"решето\". По-хорошему, если написать с нуля, а потом добиваться совместимости, на ходу вылезут ошибки, которые есть в одной реализации, но которых нет в другой.",
				"added": 1562066678
			},
			{
				"comment_id": 18,
				"body": "> [geekless](#comment_172_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Тупиковый путь, если у тебя нет тонн нефти, чтобы наверстать существующую функциональность за 3-4 месяца. Зачем тебя так кидает из стороны в сторону: то у сообщества нет ресурсов, чтобы вести форк, то запилим всё с нуля?\n\nКогда я предлагаю сделать какие-то изменения в основной ветке -- на меня орут, что я отжимаю права у nofish'а.\n\nКогда я говорю -- ок, давайте сделаем *совсем* свое -- на меня орут, что я ничего не сделаю.\n\nЯ понимаю, что нужно постараться нагнать. Ну так я и стараюсь. ZeroNet в таком состоянии находится уже кучу времени, и никого это не смущает. Я хоть пытаюсь что-то делать, а не послушно брести на nofish'ом.",
				"added": 1562068422
			},
			{
				"comment_id": 19,
				"body": "> [geekless](#comment_173_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Да хрен с ним с nofish, го запилим форк с кучей фиксов и фич и попиарим его в ZeroMe.\n\nБыстренько ты меняешь свое мнение о nofish'е :)\n\nНо да, про эволюцию правда. Пошел писать получение пиров с трекеров :)",
				"added": 1562068695
			},
			{
				"comment_id": 20,
				"body": "> [geekless](#comment_174_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вгде? o_O [...]\n\nОх ты ж, перепутал, это if0 писал.",
				"added": 1562068843
			},
			{
				"comment_id": 21,
				"body": "> [if0](#comment_79_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Форк не поможет, когда архитектура не продумана. А две несовместимые ZN вряд ли будут нужны, при условии, что и одна не очень-то и популярна.\n\nПочему несовместимые-то?",
				"added": 1562068861
			},
			{
				"comment_id": 22,
				"body": "Кажется, что все же можно совместить. Грубо говоря, можно хостить не только файл, а еще и директорию с файлами. Тогда весь зайт превращается как раз в одну большую директорию. И тут внезапно оказывается, что нет разницы между пользовательскими директориями и хабами, если можно делать что-то типа symlink'ов.",
				"added": 1562069325
			},
			{
				"comment_id": 23,
				"body": "> [if0](#comment_82_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А где сам @nofish и какова его позиция по данному вопросу?\n\nАга. А сам nofish час назад прошелся по списку issues на GitHub'е, закрыл те, в которых я написал \"@HelloZeroNet This issue is resolved, could you close it please?\" и ушел.",
				"added": 1562070213
			},
			{
				"comment_id": 24,
				"body": "> [geekless](#comment_176_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ну может человека уже давно спецслужбы за жабры взяли, или просто в реале завал дел.\n\nВот это и страшно.\n\n> [if0](#comment_83_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): То есть - он сам своей разработкой не пользуется, и то, что там внурти происходит, его не интересует?\n\nНу дык, пользуется, но редко.",
				"added": 1562070986
			},
			{
				"comment_id": 25,
				"body": "> [if0](#comment_84_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Слишком уж сильно конспирологическая версия... Про жабры.\n\nЗвучит странно, но понемногу начинаешь верить, когда куча всего реализуется, а от твоих простых изменений аккуратно отказываются.",
				"added": 1562071039
			},
			{
				"comment_id": 26,
				"body": "> [if0](#comment_85_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В таком случае в коде может появиться что-нибудь нехорошее, например, какой-нибудь eval, как случилось с BitMessage.\n\nБлин, только что (на неделе) нашел дыру, ужасную, и теперь даже не знаю, что делать. Похожа, конечно, на случайность (ее легко допустить), но кто знает... Писать в спортлото?",
				"added": 1562071345
			},
			{
				"comment_id": 27,
				"body": "RCE никому не надо? :)",
				"added": 1562071428
			},
			{
				"comment_id": 28,
				"body": "> [if0](#comment_86_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): или зашифровать их\n\nНу собственно вот и ответ.\n\nНу и следить тоже можно. За интересными личностями.",
				"added": 1562071650
			},
			{
				"comment_id": 29,
				"body": "> [if0](#comment_87_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А они здесь точно есть? :-)\n\nПосмотри в зеркало :)",
				"added": 1562071774
			},
			{
				"comment_id": 31,
				"body": "> [swashbuckler](#comment_2_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Что-то поменялось за год с лишним?\n\nnofish заглох, обновлений ZeroNet давно не было. Админ все еще один.",
				"added": 1602947461
			}
		],
		"1597473464_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 30,
				"body": "Огромное спасибо. Есть какие-то планы по передаче/общественному модерированию форума, или вы в ZeroNet надолго?",
				"added": 1602944339
			}
		]
	},
	"comment_vote": {
		"203_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"5_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z": 1,
		"52_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}