{
	"posts": [
		{
			"id": "fe839066-37c8-4bce-844c-40c79e6e1605",
			"directory": "users/1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo",
			"uri": "tay",
			"thread": "042e881b-80d3-48b8-9d5c-9c074a8446e0",
			"body": ">>c1813b41-4bc8-46da-8050-2cb37605a343\nWhy would they add it to your repo? You shouldn't have control over other people's projects.",
			"time": 1566485860621,
			"files": "[]"
		},
		{
			"id": "827afefe-dc60-455f-a64b-17421df58d39",
			"directory": "users/1LkM33Rh7DP79wJFKKCYiFKv6tkgyXtnGC",
			"uri": "MT",
			"thread": "9f24c0a0-0abe-41eb-bed9-ab5e19bf9434",
			"body": ">>9f24c0a0-0abe-41eb-bed9-ab5e19bf9434\n>We've create a public github repo for these lists already, I recommend using that instead.\nYou and who else? Sounds like you're the only one who created and operates that repo.\nI think IDs shouldn't be blocked by default on the client distributed through 08chan. If you're going to give off the impression of being 08chan's official clearnet website, then you should stick to Acid's moderation policies. He can already blacklist people using the board's functionality. I don't see why you need to slap your own list on top of that.\nIf you do block people then I think you should add a disclaimer that yours isn't an official site and that you're blocking people according to your own criteria.\nAnd also I'd say remove the \"made with love by taylovedyou\" line from the poster. Right now you give off the impression of being a namefag trying to gain popularity and positions of power around the zite.\nI am (and Acid himself is) already uncomfortable with the power to completely destroy the board being held by one person. We don't need to add a second point of failure (you controlling an official looking distribution channel for the software AND the repos for all the software projects built around the zite).",
			"time": 1566486896573,
			"files": "[]"
		},
		{
			"id": "9101ade1-7dcb-44e3-b442-9b0b9d45cc6f",
			"directory": "users/1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo",
			"uri": "tay",
			"thread": "042e881b-80d3-48b8-9d5c-9c074a8446e0",
			"body": ">>66608c60-43f6-4230-8133-594feb39ae5f\nDoesn't sound like you only want people to add blacklists >>da91199a-66fa-4089-8e20-771d8a7c3902",
			"time": 1566487284985,
			"files": "[]"
		},
		{
			"id": "c2a6f2b3-631f-488f-88b7-5fef83e5dbf7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "71a8005f-ac75-40ed-a97b-80f29f31e3c2",
			"body": ">>ca4e30a0-6f64-42b3-8656-d50da3b6692c\nI suppose if you can change the DNA of the stem cells you can tell them to reproduce as much as you want.\n**>inb4 the first genetically engineered cancer**",
			"time": 1566488958990,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}