{
	"message": [
		{
			"body": "?",
			"date_added": 1458457623376
		},
		{
			"body": "stuff",
			"date_added": 1458457634456
		},
		{
			"body": "Alright I have moved",
			"date_added": 1458575578833
		},
		{
			"body": "quick question. I like the whole being able to favorite sites on your site list on the landing page, but it doesn't stay that way after a while. Do you know what is up with that?",
			"date_added": 1458575671947
		},
		{
			"body": "probably proxy.",
			"date_added": 1458576034330
		},
		{
			"body": "its not exactly proxy, its more like I ssh to a machine that has zn. Basically the same thing?",
			"date_added": 1458577256249
		},
		{
			"body": "@yilmazerkan I'm running zn, still need to setup my keys for ssh tho. I made the setup like this so sites I visit are continuously seeded (:",
			"date_added": 1458577601979
		},
		{
			"body": "but yeah localstorage? alright I guess bookmarks would be the way then.",
			"date_added": 1458577637607
		},
		{
			"body": "thanks!",
			"date_added": 1458577650047
		},
		{
			"body": "i come from the other side, where the progressive stack is enforced. either way, shits fucked",
			"date_added": 1458580704157
		},
		{
			"body": "you're discriminated by your privilege level, as denoted by your position in the progressive stack",
			"date_added": 1458580802073
		},
		{
			"body": "if you're white cis christian male, you have the highest privilege, and would be at the bottom of the progressive stack",
			"date_added": 1458580891090
		},
		{
			"body": "sup ifmu!",
			"date_added": 1458580974352
		},
		{
			"body": "basically it looks like extremism breeds discrimination no matter what side you're on",
			"date_added": 1458581113427
		},
		{
			"body": "@basxto I don't exactly agree with the stack being used for speaking order, but more extreme sides of the progressivism tend to use the stack to discriminate",
			"date_added": 1458582575941
		},
		{
			"body": "Religious freedom topic, I thought the separation of church and state should've been enough",
			"date_added": 1458582651912
		},
		{
			"body": "@ifmu Bored with work, I'm thinking of making another zite later today. how bout you?",
			"date_added": 1458582862880
		},
		{
			"body": "@yilmazerkan: another web browser game. I won't go into detail quite yet, but all I need right now is time and something to motivate me",
			"date_added": 1458583073890
		},
		{
			"body": "@ifmu: oh no I mean another as in another one apart from the existing ones on zn already. First time making a game",
			"date_added": 1458583177805
		},
		{
			"body": "@yilmazerkan: AAHHH. ",
			"date_added": 1458583213904
		},
		{
			"body": "I like the idea of mmo, but it has to be turn based",
			"date_added": 1458583261571
		},
		{
			"body": "unless webrtc is coupled in this",
			"date_added": 1458583288424
		},
		{
			"body": "@basxto: yeah. Making new ground here, but I think the tools we need exist. Its just a matter of channeling @yilmazerkan's motivation",
			"date_added": 1458583432332
		},
		{
			"body": "@basxto: that works out i think. maybe a blockchain based turn game would do it",
			"date_added": 1458583656825
		},
		{
			"body": "I broke pron.0chan trying to give back to the community. I'm so sorry",
			"date_added": 1458583849249
		},
		{
			"body": "wait it works??? crap, maybe something broke on my end. Whenever I try to access it, when it fully loads, its blank. When I try to delete it, It says I own the site...",
			"date_added": 1458584085352
		},
		{
			"body": "0:",
			"date_added": 1458584232652
		},
		{
			"body": "oh well I learned my lesson. 5 images per week",
			"date_added": 1458584266115
		},
		{
			"body": "@yilmazerkan: good luck. I'm behind seven proxies",
			"date_added": 1458584310440
		},
		{
			"body": "cx",
			"date_added": 1458584319342
		},
		{
			"body": "(this is why I don't actually use proxies)",
			"date_added": 1458584426401
		},
		{
			"body": "@ifmu: oh man I'm not even a few seconds into your site and I already like it",
			"date_added": 1458584481444
		},
		{
			"body": "@basxto: ouch. that sux man",
			"date_added": 1458584601088
		},
		{
			"body": "@ifmu: I really like the transitions you put in",
			"date_added": 1458584621673
		},
		{
			"body": "alright im gonna nap a bit. ttyl",
			"date_added": 1458585485915
		},
		{
			"body": "is anyone keeping track of brussels? I just woke up and shits HAPPENING",
			"date_added": 1458658513700
		},
		{
			"body": "@yilmazerkan: I do have a blog, but its crap. I'll probably be posting it here sometime",
			"date_added": 1458658593073
		},
		{
			"body": "@yilmazerkan: i think once I get the webgame going on my end, I should have enough content to work with",
			"date_added": 1458658834147
		},
		{
			"body": "I'm probably gonna start today. I was busy last night with work.",
			"date_added": 1458658920982
		},
		{
			"body": "I heard of the brussels stuff from this 1000 replied thread from 4chaen",
			"date_added": 1458658949628
		},
		{
			"body": "(I originally came ZN to separate myself from that site, but so far not successful)",
			"date_added": 1458658986547
		},
		{
			"body": "I usually get my news from /pol/ but I try not to stay there too long.",
			"date_added": 1458659152352
		},
		{
			"body": "It's not good for my health",
			"date_added": 1458659170477
		},
		{
			"body": "yeah, but I live in a place where nothing literally happens. This probably looks good for some though. Nice and peaceful.",
			"date_added": 1458659485553
		},
		{
			"body": "oh yeah no doubt. I was looking into the 1992 LA riots recently and that basically reaffirms news as propaganda",
			"date_added": 1458659613585
		},
		{
			"body": "I get that feeling. How did we reach a point where it isn't the even that makes you feel bad, but its reporting",
			"date_added": 1458659964373
		},
		{
			"body": "haha oh wow #stopislam is trending",
			"date_added": 1458660486712
		},
		{
			"body": "this kinda sucks. I have a close friend who is a muslim, so I kinda have split feelings about this. more and more my experience seems to be anecdotal and an exception",
			"date_added": 1458660725088
		},
		{
			"body": "I think militant islamism covers it just about right",
			"date_added": 1458660772928
		},
		{
			"body": "problem is even if it isn't the reason, if done right it is the enabler. Most of the more militant sects always have a sort of us-againts-them mentality",
			"date_added": 1458660998054
		},
		{
			"body": "I think the problem is we can't sort out the people who take religion too seriously from those who are moderates. That would be discrimination",
			"date_added": 1458661302111
		},
		{
			"body": "That works for an individual level, but what about in groups of people migrating? Would it be logistically feasable?",
			"date_added": 1458661437104
		},
		{
			"body": "I think... maybe not just religion, but a whole host of characteristics should be at play.",
			"date_added": 1458661493065
		},
		{
			"body": "@yilmazerkan: Ah well in retrospect, yeah I agree. Otherwise, i would've shunned my close friend",
			"date_added": 1458661614119
		},
		{
			"body": "I'll be right back. gonna get some food",
			"date_added": 1458661723144
		},
		{
			"body": "ok im back and wot",
			"date_added": 1458662497952
		},
		{
			"body": "anyways where was I... ah yes shits fucked",
			"date_added": 1458662610525
		},
		{
			"body": "I think that about sums up whats going on right now. I don't exactly know what else is going on in brussels so I'll probably just go back to working on that one game",
			"date_added": 1458662685408
		},
		{
			"body": "@basxto: http://www.livenewschat.eu/politics/ this is the stream im listening to. It is msnbc so take it with a grain of salt",
			"date_added": 1458663181623
		},
		{
			"body": "I'm not exactly looking at it directly since im working on game now",
			"date_added": 1458663239731
		},
		{
			"body": "its most likely flash",
			"date_added": 1458663283095
		},
		{
			"body": "@yilmazerkan: what are the chances apple's statement is just to appease the public?",
			"date_added": 1458663326274
		},
		{
			"body": "I'm only listening cause I like hearing what the guys are saying on the ground",
			"date_added": 1458663701498
		},
		{
			"body": "translated? That sounds like something bout putin",
			"date_added": 1458663834678
		},
		{
			"body": "Maybe putin is forseeing the storm of blame",
			"date_added": 1458663981310
		},
		{
			"body": "/me should really stop code and fixing",
			"date_added": 1458747407592
		},
		{
			"body": "basically how things are going",
			"date_added": 1458747435714
		},
		{
			"body": "I like the kind where transformation is into an apache attack heli. ",
			"date_added": 1458755358798
		},
		{
			"body": "does zn keep itself updated or something? I've got rev 1070",
			"date_added": 1458781632779
		},
		{
			"body": "i can finally relax a bit",
			"date_added": 1458795303794
		},
		{
			"body": "I just came out of two work related projects",
			"date_added": 1458795317223
		},
		{
			"body": "hey guys. look what i found. again: https://www.youtube.com/watch?v=aEuYKyLy-xg",
			"date_added": 1459040486267
		},
		{
			"body": "in the mean time, I'm still working on the game, but its gonna take forever cause im slow and lazy",
			"date_added": 1459040563138
		},
		{
			"body": "making a multiplayer game is harder than I thought ",
			"date_added": 1459040669640
		},
		{
			"body": "yeah thats also why I started of just making a modified version of chat",
			"date_added": 1459040883904
		},
		{
			"body": "oh yeah definetly ",
			"date_added": 1459041031207
		},
		{
			"body": "its times like this i need to remember to divide and conquer",
			"date_added": 1459042980483
		},
		{
			"body": "theres that too. I've been doing that last week. maybe i should do it again. that ipfs stream zite is cool",
			"date_added": 1459043687654
		},
		{
			"body": "night night",
			"date_added": 1459050201190
		},
		{
			"body": "im back for a few minutes. I'm gonna be going to bed soon, but gots a quick question",
			"date_added": 1459064621297
		},
		{
			"body": "how do you allow multiple files on content.json? The zframe api doesn't give an example",
			"date_added": 1459064659812
		},
		{
			"body": "nah more like https://zeronet.readthedocs.org/en/latest/site_development/content_json/#user_contents",
			"date_added": 1459064998651
		},
		{
			"body": "under files_allowed",
			"date_added": 1459065030710
		},
		{
			"body": "ah. I just wanted to add another json file to make another table",
			"date_added": 1459065303365
		},
		{
			"body": "I think so? Oh well I'm gonna try that out later on. Way past bedtime here. Night guys.",
			"date_added": 1459069531956
		},
		{
			"body": "what did google do now?",
			"date_added": 1459144065845
		},
		{
			"body": "@ks: cool stickers. I'll get some",
			"date_added": 1459177141199
		},
		{
			"body": "my sort of music: https://www.youtube.com/watch?v=r8xyokHW9Bk",
			"date_added": 1459191263891
		},
		{
			"body": "(just so you know, its a HIGH QUALITY rip of a game)",
			"date_added": 1459191470664
		},
		{
			"body": "its race music for f zero",
			"date_added": 1459191562295
		},
		{
			"body": "i for some reason only listen to music from games. this is one that isnt HIGH QUALITY: https://www.youtube.com/watch?v=cETBCvKnu0Q",
			"date_added": 1459191658241
		},
		{
			"body": "interesting. This is the first time I heard of xonotic. I've mostly stuck to League, Counterstrike, and Robocraft",
			"date_added": 1459192243820
		},
		{
			"body": "Yeah I just looked it up. I'm gonna try it out this weekend",
			"date_added": 1459192430413
		},
		{
			"body": "oh boy some person is trying to get the downvote implemented on ztalk. good thing someone already said a global downvote would be susceptible to downvote barrage",
			"date_added": 1459199676810
		},
		{
			"body": "I see some wanting to downvote the isis roleplayer",
			"date_added": 1459200462857
		},
		{
			"body": "@yilmazerkan: yeah that. Didn't know they gave the name. Happens too often on mainstream social media and has ramifications IRL, which is why i moved to zn in the first place",
			"date_added": 1459200872961
		},
		{
			"body": "@yilmazerkan@zv yeah probs a good idea. Better just to keep working on side projects",
			"date_added": 1459201948834
		},
		{
			"body": "ah... time to clean out my phone...",
			"date_added": 1459264118520
		},
		{
			"body": "well its not iphone, but the ability for the cops to open iphones sets precedent",
			"date_added": 1459264189925
		},
		{
			"body": "well in the mean time, I'm giving back to the community once more. I went to 0chan and clicked the help distribute all files (:",
			"date_added": 1459265677168
		},
		{
			"body": "Possible demonstration and blocking street happening after jamar decision: https://twitter.com/TDurianKSTP/status/715228163257671680",
			"date_added": 1459362256842
		},
		{
			"body": "@yilmazerkan@zv: its super early. the scheduled start is 5 hours from now",
			"date_added": 1459362775055
		},
		{
			"body": "@iforgotmyusernam@zv: cx you'll never catch me!  my hat is behind seven pointless proxies",
			"date_added": 1459362981816
		},
		{
			"body": "@yilmazerkan@zv: yeah I'm seeing some footage of the early stuff. Looking forward for some uncivil disobedience",
			"date_added": 1459363017124
		},
		{
			"body": "NOO not the hat police. infinitely worse than NSA",
			"date_added": 1459363334765
		},
		{
			"body": "@yilmazerkan@zv: @iforgotmyusernam@zv: I'm getting the same weirdness with peercount. It does rise up if you enable \"help distribute files\"",
			"date_added": 1459363719640
		},
		{
			"body": "should be on hidden menu, when you drag the top right icon and scroll to the bottom",
			"date_added": 1459363940937
		},
		{
			"body": "ah thats odd. maybe the help distribute files is only for sites with optional files",
			"date_added": 1459364095984
		},
		{
			"body": "yeah just checked it is for optional files.",
			"date_added": 1459364130080
		},
		{
			"body": "VerseMail or Vmail?",
			"date_added": 1459364689333
		},
		{
			"body": "ah makes sense.",
			"date_added": 1459365098524
		},
		{
			"body": "/me is late to the conversation",
			"date_added": 1459372293593
		},
		{
			"body": "@basxto@zid: yes repetitive hand motions is more effective",
			"date_added": 1459372314102
		},
		{
			"body": "TSA = Toiletries Search Agency",
			"date_added": 1459372561717
		},
		{
			"body": "@basxto@zid: (masturbation)",
			"date_added": 1459372843084
		},
		{
			"body": "14.00kB / 488.00kB here",
			"date_added": 1459373104978
		},
		{
			"body": "In other news, I've decided to hold off on making my zgame because I really wanna try out webrtc on a zite",
			"date_added": 1459373699031
		},
		{
			"body": "the circumvent i think is because it uses a signalling server to establish a connection between two browsers",
			"date_added": 1459373859732
		},
		{
			"body": "how about replacing stun server with just signaling with json files and zn publishing",
			"date_added": 1459373902678
		},
		{
			"body": "/me loses his 7 sides",
			"date_added": 1459373929421
		},
		{
			"body": "@basxto@zid: yeah it would connect clients directly. would that too bad? I'm still looking for a way to get it through tor, but I want to make a working proof of concept first",
			"date_added": 1459374146194
		},
		{
			"body": "AH alright I give. WebRTC not so good. I keep looking for webrtc over tor and finding nothing",
			"date_added": 1459374662063
		},
		{
			"body": "@yilmazerkan@zv: I mean the thing is it's pretty useful. encrypted browser to browser connection to allow voip, video and data",
			"date_added": 1459374992829
		},
		{
			"body": "theres that number 7 again",
			"date_added": 1459375092282
		},
		{
			"body": "there's always the whisper site for spamming. It remembers nothing, so it has no size problem",
			"date_added": 1459375216303
		},
		{
			"body": "i think it might be broken tho. hmm",
			"date_added": 1459375320823
		},
		{
			"body": " 0net://1dhDNnytBKPaKJ913hQUqTqPW1mz6QCXh/",
			"date_added": 1459375410655
		},
		{
			"body": "/me comes in with a tin foil hat",
			"date_added": 1459375937343
		},
		{
			"body": "uhh...",
			"date_added": 1459375950078
		},
		{
			"body": "see ya @iforgotmyusernam@zv",
			"date_added": 1459375992331
		},
		{
			"body": "nuuuuuu",
			"date_added": 1459376079307
		},
		{
			"body": "well i gotta get going for a bit. changing locations. see you guys in a bit",
			"date_added": 1459376094156
		},
		{
			"body": "if there are little kids in here, welcome to the dank net",
			"date_added": 1459376135693
		},
		{
			"body": "@iforgotmyusernam@zv: woot im not the only one!",
			"date_added": 1459485704959
		},
		{
			"body": "Also hi guys I'm back.",
			"date_added": 1459485726580
		},
		{
			"body": "aaaand I'm gone. I'm kinda shifting around the place atm",
			"date_added": 1459485764314
		},
		{
			"body": "@yilmazerkan@zv: hey can you add a notification sound to this chat?",
			"date_added": 1459485844076
		},
		{
			"body": "If I didn't read past the last 4 lines, I would've thought you were talking about masturbation",
			"date_added": 1459486362958
		},
		{
			"body": "oh well",
			"date_added": 1459486791658
		},
		{
			"body": "(:",
			"date_added": 1459487061227
		},
		{
			"body": "I can't seem to play the video hmmm",
			"date_added": 1459487154000
		},
		{
			"body": "ah there we go. Web browser problems",
			"date_added": 1459487244382
		},
		{
			"body": "For me, I'm more familiar with how music relates to a situation. Like what kind of music I listen to while walk affects how I view the walk.",
			"date_added": 1459487394759
		},
		{
			"body": "Like if I play this https://www.youtube.com/watch?v=Q_5z4n5TZ2Q , I feel like I just finished something epic and I'm walking back",
			"date_added": 1459487465555
		},
		{
			"body": "yeah palmface is a reoccurring event. Its my second one today since I was working on a project",
			"date_added": 1459487552839
		},
		{
			"body": "I like hats",
			"date_added": 1459542452208
		},
		{
			"body": "oh man I love those things. Foot powered like the top of my trashcan",
			"date_added": 1459542543070
		},
		{
			"body": "I think I may have newfound inspiration for making my zngame",
			"date_added": 1459542637161
		},
		{
			"body": "after I nap first",
			"date_added": 1459542643485
		},
		{
			"body": "NOooooooooooo",
			"date_added": 1459542797351
		},
		{
			"body": "hey @yilmazerkan@zv only cause its deleted cx",
			"date_added": 1459542857366
		},
		{
			"body": "or did it ever exist??",
			"date_added": 1459542873456
		},
		{
			"body": "what if",
			"date_added": 1459542878962
		},
		{
			"body": "our world is one of the many worlds on zeronet, but ours only survived the data.json deletion",
			"date_added": 1459542920647
		},
		{
			"body": "@yilmazerkan@zv: oh right. I forgot that's how site publishing works ",
			"date_added": 1459542989852
		},
		{
			"body": "same here, cept the week off part",
			"date_added": 1459543032626
		},
		{
			"body": "my sleep schedule is so wacked, I might as well be living in @yilmazerkan@zv timezone",
			"date_added": 1459543178379
		},
		{
			"body": "@botkek001@zv: yeah you only sustain by kek magic",
			"date_added": 1459543914492
		},
		{
			"body": "slept at i think 07:00 because deadpool movie",
			"date_added": 1459544104090
		},
		{
			"body": "I have no idea how my music tastes work. It really depends on mood. Fast walking tempo music is what im listening to right now",
			"date_added": 1459544359462
		},
		{
			"body": "should we make a zn imgur site or does that exist already?",
			"date_added": 1459548022411
		},
		{
			"body": "but optional files though",
			"date_added": 1459548058665
		},
		{
			"body": "a good reasonable data limit and optional files should do it i think",
			"date_added": 1459548082000
		},
		{
			"body": "alright I'll work on that next",
			"date_added": 1459548099333
		},
		{
			"body": "its so hard to think about making game with the thought of publishing and such. I need to look up game rules again to keep me ontrack",
			"date_added": 1459548131409
		},
		{
			"body": "weird. I used to have intp but i'm now istp. I wonder what happened",
			"date_added": 1459548554369
		},
		{
			"body": "hey guys",
			"date_added": 1460059953432
		},
		{
			"body": "would it be possible to make a dapp through ethereum that would act as a zn proxy?",
			"date_added": 1460059979960
		},
		{
			"body": "I am alive. Kinda",
			"date_added": 1461122883041
		},
		{
			"body": "thought i should check in a bit",
			"date_added": 1461126324664
		},
		{
			"body": "btw I made a blog btw. I'm about to pass out in a bit",
			"date_added": 1461126518012
		},
		{
			"body": "http://localhost:43110/1DJjWdTmZX5BnNwVwnMTuE5ij8zziA1ssR/ is my blog",
			"date_added": 1461126563358
		},
		{
			"body": "neato. I only made one cause I remembered someone asking about it",
			"date_added": 1461127025249
		},
		{
			"body": "@erkan@zid yeah I had a problem with that too. I will probably remake my blog since I'm not too sure what is wrong with this. @redacted@zv Thanks! It was my first zite I made. Hopefully I can channel that motivation to the next project I have in mind. (Game is gonna go into the back burner for now)",
			"date_added": 1461178815880
		},
		{
			"body": "alright remade here: http://localhost:43110/1Jnup6n1oXJFNcy8NAWMyZboYHztfs56He",
			"date_added": 1461179464542
		},
		{
			"body": "ah thats annoying. I'm gonna open it up on proxy",
			"date_added": 1461185655565
		},
		{
			"body": "Alright blog seeding established (:",
			"date_added": 1461186229138
		},
		{
			"body": "@redacted@zv hey I tried webrtc in the past. its too bad i didn't go forward with it since it reveals ip",
			"date_added": 1461191898052
		},
		{
			"body": "wow that sounds like a big undertaking. well good luck with that. I'm still struggling with time management, to the point at which im just gonna work on smaller projects",
			"date_added": 1461192718959
		},
		{
			"body": "I might be able to help with that, but I'm new to all this. For now i think im going to focus on video hosting",
			"date_added": 1461196784927
		},
		{
			"body": "hey guys im back",
			"date_added": 1464483336962
		},
		{
			"body": "oh i guess everyones asleep. I'll check back in a few",
			"date_added": 1464486560547
		}
	]
}