{
	"pages": [
		{
			"id": "0853b620-e9e3-11e5-adab-ebd38c69cb1e",
			"body": "Esperanto (/ˌɛspəˈræntoʊ/ or /-ˈrɑː-/;[4][5] [espeˈranto] About this sound listen (help·info)) is a constructed international auxiliary language. It is the most widely spoken constructed language in the world.[6] The Polish ophthalmologist L. L. Zamenhof published the first book detailing Esperanto, the Unua Libro, on 26 July 1887. The name of Esperanto derives from Doktoro Esperanto (\"Esperanto\" translates as \"one who hopes\"), the pseudonym under which Zamenhof published Unua Libro. Zamenhof's goal was to create an easy-to-learn, politically neutral language that would transcend nationality and foster peace and international understanding between people with different languages.\n\nUp to 2,000,000 people worldwide, to varying degrees, speak Esperanto, including perhaps 2,000[dubious – discuss] native speakers who learned Esperanto from birth. The World Esperanto Association has members in 120[7] countries. Its usage is highest in Europe, East Asia, and South America.[8] lernu!, the most popular online learning platform for Esperanto, reported 150,000 registered users in 2013, and sees between 150,000 and 200,000 visitors each month.[9] With about 227,000 articles, Esperanto Wikipedia is the 31st-largest Wikipedia as measured by the number of articles,[10] and the largest Wikipedia in a constructed language.[11] On 22 February 2012, Google Translate added Esperanto as its 64th language.[12] On 28 May 2015, the language learning platform Duolingo launched an Esperanto course for English speakers. As of 20 February 2016, over 300,000 users had signed up.[13][14]\n\nThe first World Congress of Esperanto was organized in France in 1905. Since then, congresses have been held in various countries every year, with the exceptions of years during the world wars. Although no country has adopted Esperanto officially, Esperanto was recommended by the French Academy of Sciences in 1921 and recognized by UNESCO in 1954, which recommended in 1985 that international non-governmental organizations use Esperanto. Esperanto was the 32nd language accepted as adhering to the \"Common European Framework of Reference for Languages\" in 2007.[15]\n\nEsperanto is currently the language of instruction of the International Academy of Sciences in San Marino.[16]\n\nEsperanto is seen by many of its speakers as an alternative or addition to the growing use of English throughout the world, offering a language that is easier to learn than English.",
			"date_added": 1457959701124,
			"slug": "esperanto"
		},
		{
			"id": "6835ae10-e9e1-11e5-ab36-99e3d1110029",
			"body": "# Welcome to ZeroWiki\n\nWelcome to ZeroWiki TEST, a new kind of **publishing platform for ZeroNet**, the distributed web we all love.\n\nZeroWiki is a public [[wiki]] software and most of the pages in this site are editable, anyone can modify it to add or improve the contents. See the [help page](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Help) to learn how it works.\n\nWikis can be used for taking notes and storing snippets, to create FAQs and documentation, to keep track of your goals or as a simple To-Do list. As it happens with most collaborative tools, it can be used in many different ways, even to build your own community.\n\nUse it however you want, ZeroWiki is free and cloneable from your [[ZeroNet]] connected sites.\n\n## ZeroWiki is beta software\n\nThis project is still in beta fase and it may have bugs or lack features.",
			"date_added": 1457959002994,
			"slug": "home"
		}
	]
}