{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1516750041,
			"title": "ZeroWiki improvements wishlist",
			"body": "List things you'd like to improve on ZeroMe one by one and vote for others' ideas.\n\nI'll start: Tables and syntax highlighting in code blocks would be awesome. Also being able to embed videos would be great.\n\nWhat do you want to see?",
			"added": 1516750040
		},
		{
			"topic_id": 1516750899,
			"title": "Change title of this site to ZeroDevTalk",
			"body": "Right now we still have 'ZeroTalk' and the other ZeroTalk forums listed at the top. You can edit these by going into this zite's index.html, searching for 'ZEROTALK', and changing it to whatever you desire.\n\nIt would help differentiate this forum from ZeroTalk itself :)",
			"added": 1516750897
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1516741613_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 1,
				"body": "Perhaps some UI elements that are consistent with the top ZeroNet zites could be published for use by other zite developers.\n\nZeroLSTN uses [MaterializeCSS](http://materializecss.com/) (clearnet) so anyone wanting to a create a zite in a similar style can check out and use that framework.",
				"added": 1516750211
			}
		],
		"1516742142_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 2,
				"body": "RSS is just XML, so yes, have the client generate it don't he fly given the current state of the database and what subscriptions you have.\n\nThe problem is updating, somehow it needs to be updated whenever you query/refresh your feed. That would be trickier, and require some JS to run, or have an RSS plugin made for the main news feed on ZeroHello, which runs every so often while the ZeroNet daemon is running. Then the site just exposes the feed through the homepage. That would probably be the most solid solution.",
				"added": 1516750398
			}
		],
		"1516741810_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 3,
				"body": "A handy zite would be one that just posts the latest crypto prices every few minutes that other zites could pull from to price items. The idea is analogous to ZeroName which watches the Namecoin block chain and provides all clients with metadata without them having the leave the ZeroNet network.",
				"added": 1516750566
			}
		],
		"1516748111_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE": [
			{
				"comment_id": 4,
				"body": "They should get rid of the rounded square around the mobile menu button, would be better if it was just a standalone, flat menu icon.",
				"added": 1516750613
			},
			{
				"comment_id": 5,
				"body": "> [mnemonic](#comment_4_1AnFGL613gYqFWm4Lhwdk6x5gCRe1tPFxE): @mentions, as a twitter user I miss them a lot\n\nWe have mentions of *some* form that people do get notifications on ZeroHello about, but I agree that they could be more well-defined with a preceding character (such as '@') required before the username. \n\nAt the moment it seems you only need to write their name, but putting a : afterwards bolds it. Does the @ even do anything?\n\nThere needs to be some hints about these things in the message box when you're writing a comment or post, such as a box of auto completing usernames appearing when an '@' is typed.",
				"added": 1516750736
			}
		]
	},
	"comment_vote": {}
}