{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "20!8",
			"body": "В НГ столько контента и новостей выкладывают, что даже лень приступать к ним. А ещё нужно по всяким закуолкам сети пробежаться, что ужс. Пожелайте тут местным что-нибудь за меня.",
			"added": 1514749044
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_1BDM4KFmK8sxadx5egLUYYcesV14exuGLc": [
			{
				"comment_id": 1,
				"body": "Нет. Ончейн масштабируемости нет. Шардинг - чушь. PoW - ненужный архаизм. Демократия  уязвима к манипуляциям. Заголовок не соответствует содержанию. Идеальность не нужна. Кефир - говно, но по лучше швейцарского ножа предложенного тобой.",
				"added": 1513495376
			}
		],
		"1_1K2BhJ6PeyraUiZQnFqvGz178oTKu9ACsi": [
			{
				"comment_id": 2,
				"body": "На заре битка вполне работало. Помню даже был сайт, где полбитка в сутки вполне можно было набить разбирая картинки. Сейчас уже практически всё развод.",
				"added": 1513495902
			}
		],
		"4_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 3,
				"body": "Бред несешь не разбираясь в технических аспектах.",
				"added": 1513635624
			}
		],
		"3_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 4,
				"body": "Если ты вытворишь с ними что-то такое, что тебя номинируют на премию дарвина, то будь уверен, бабахнет на всю Москву. По крайней мере в соцсетях.",
				"added": 1513635740
			}
		],
		"2_1LTTwoxKGsPenEPthTeU4wobeJXohv4o3t": [
			{
				"comment_id": 5,
				"body": "у akachan узнай.",
				"added": 1513635816
			}
		],
		"1_12TkPLvsD5FecF8Xbv331qjcvbY6Dt9DFa": [
			{
				"comment_id": 6,
				"body": "Принудительный сетевой нейтралитет не нужен. Такие вещи должны поддерживаться на уровне конкуренции между провайдерами. Кому-то просто нужен бесплатный доступ к соцсетям, обеспечиваемый за счет рекламы. Кому-то независимый интернет без рекламы, за непосредственную оплату провайдеру.",
				"added": 1513842870
			},
			{
				"comment_id": 7,
				"body": "> [anotherneko](#comment_7_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Далеко не у всех провайдеров есть конкуренты.\n\nДа, у единого национального провайдера конкурентов нет.",
				"added": 1515083421
			}
		],
		"2_1PQSdkCfwKLKT4pWEpf33BkjvYX78wj1kJ": [
			{
				"comment_id": 8,
				"body": "ой, свинота набежала с недоборд",
				"added": 1515253046
			}
		]
	},
	"comment_vote": {}
}