{"cards": [

{
 "card_id": 0,
 "title": "",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Incantato",
 "rule": "Wer glaubt, daß jemand verlieren muß, hat verloren.",
 "date": 0
},

{
 "card_id": 1,
 "title": "Mantra der Reinheit",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Entferne Mantra der Reinheit aus dem Spiel: Ziehe 4 Karten in deiner nächsten Zugphase.",
 "strength": "",
 "extra": "Was ist nicht Nichts, doch ohne Gestalt?",
 "rule_title": "Mantra der Reinheit",
 "rule": "Vor Beginn sucht jeder sein Mantra der Reinheit aus seiner Bibliothek und legt es offen vor sich. In der nullten Runde darf man das Mantra der Reinheit aus dem Spiel entfernen, um dessen Effekt zu aktivieren (siehe Regel 733,734).",
 "pic": true,
 "token": "H1ismCyDm3P6x5zjqoL9hmjQzrn1q8L4uemGSxDJxAk=",
 "taken": true,
 "date": 0
},

{
 "card_id": 2,
 "title": "Sonne",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... und es ward Licht.",
 "rule_title": "Himmelskörper",
 "rule": "Es gibt Zwei Kartenstapel: Die Bibliothek mit Zaubersprüchen und die Ekliptik. In der Ekliptik müssen 7 Himmelkörper Deiner Wahl sein, wobei auch für Himmelskörper gilt, daß nur 3 gleiche Karten enthalten sein dürfen. Zusätzlich sind noch Zeitraumgefügekarten in der Ekliptik. In der Himmelsphase wird eine Karte von der Ekliptik gezogen; diese wird nicht auf die Hand genommen sondern direkt in die Welt gelegt (Himmelskörper) oder direkt abgelegt (Zeitraumgefüge). Von Deiner Bibliothek musst Du stets eine Karte in Deiner Zugphase ziehen, außer ein Effekt (z.B. Mantra der Reinheit) schreibt etwas anderes vor.",
 "pic": true,
 "token": "lmt3oLIhNXtR1MS21mKOwlU4Jl4qFjKNjeOOzKWLuQs=",
 "taken": true,
 "date": 0
},

{
 "card_id": 3,
 "title": "Jupiter",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->, Zahle einen Lebenspunkt: Füge ein Mana beliebiger Farbe zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Für Geschenke von Göttern zahlt man immer einen Preis.",
 "rule_title": "Mana",
 "rule": "Himmelskörper spenden dem Magier kosmische Energie: Mana. Es gibt farbloses Mana und Mana mit einer bestimmten Farbe. Es gibt 5 Farben in Incanta: Rot, Blau, Grün, Weiß und Schwarz. Die meisten Zaubersprüche erfordern einen bestimmten Anteil an farbigem Mana und einen Anteil an unbestimmten Mana, welches mit Mana beliebiger Farbe, oder farblosem Mana bezahlt werden kann. Wenn eine Karte es Dir erlaubt, beliebiges Mana Deinem Manavorrat hinzuzufügen, darfst Du Dir aussuchen, welche Farbe (auch farblos) es hat.",
 "pic": true,
 "token": "tBYkQYZatAneign9Yc0ajQ3gBTNEvnOHtlfzJVhQ03Y=",
 "taken": true,
 "date": 0
},

{
 "card_id": 4,
 "title": "Venus",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Gibt es Raum, ...",
 "rule_title": "Himmelsphase",
 "rule": "Himmelskörper sind keine Zaubersprüche und werden in der Himmelsphase direkt (ohne sie auf die Hand zu nehmen) in die Welt gelegt. Auf das Auslegen von Himmelskörpern darf man nicht antworten. In der Himmelsphase können keine Zaubersprüche beschworen werden und keine Effekte angewendet werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 5,
 "title": "Mars",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... gibt es Ich und Du,",
 "rule_title": "Unzerstörbar",
 "rule": "Unzerstörbare Karten können nicht zerstört, nicht vernichtet und nicht aus der Welt entfernt werden. Allerdings kann man unzerstörbare Karten opfern. Wenn eine unzerstörbare Karte geopfert wird, wird sie aus der Welt entfernt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 6,
 "title": "Saturn",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "... und Zeit im Nu.",
 "rule_title": "Mana mit gutem Grund",
 "rule": "Ein Magier darf kein Mana zu seinem Manavorrat hinzufügen, ohne einen guten Grund zu haben. Wenn ein Magier Mana generiert hat mit einem guten Grund, kann es aber nicht verwenden, dann darf sein Gegner es verwenden (Restmana). Kann der Gegner es nicht verwenden, verfällt es. Wenn ein Magier ausversehen Mana generiert hat, ohne einen guten Grund gehabt zu haben, wird das Generieren einfach rückgängig gemacht, als wäre es nie geschehen.<br>Wenn nötig gründe einen Rat, der herausfindet was gute Gründe sind.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 7,
 "title": "Mond",
 "cost": "",
 "color": "sky",
 "type": "Himmelskörper, unzerstörbar",
 "body": "->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Wo es Licht gibt, gibt es Widerschein.",
 "rule_title": "Ekliptik",
 "rule": "In der Ekliptik werden nachdem die 7 Himmelskörper (HK.) gemischt wurden 6 Raumzeitgefügekarten (RZG.) einsortiert und zwar nach folgendem Muster:<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.<br>RZG<br>HK.<br>RZG.<br>HK.<br>RZG.<br>HK.",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 8,
 "title": "Raumzeitgefüge",
 "cost": "",
 "color": "sky",
 "type": "Zusammenhangserlebnis",
 "body": "",
 "strength": "",
 "extra": "Entweder alles auf einmal, oder gar nichts.",
 "rule_title":  "Bibliothek",
 "rule": "Eine Incantatabibliothek besteht aus genau 46 oder genau 47 Karten (inklusive Mantra der Reinheit und Schicksal). Jede Bibliothek muß das Mantra der Reinheit beinhalten. Wer die letzte Regel ignoriert ist selbst schuld!",
 "pic": true,
 "token": "i4Jp634MW+dwd4L/tM9ATSIDl5ejRNdcdpcISGH/dw8=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 9,
 "title": "Weite",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Il cammino",
 "rule_title": "Länder",
 "rule": "Länder sind keine Zaubersprüche. Sie werden einfach in die Welt gelegt, aber nur in der Hauptphase. Auf das Auslegen eines Landes kann allerdings reagiert werden, denn Länder kommen mit der Geschwindigkeit eines Materiezaubers in die Welt. Du kannst in Deiner Hauptphase soviele Länder auslegen, wie du willst.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 10,
 "title": "Wald",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Standardländer",
 "rule": "Es gibt folgende Standardländer: Weite, Wald, Gebirge, Ozean, Singularität. Alle Standardländer sind beliebig oft pro Bibliothek erlaubt. Alle Nichtstandardländer (die keine Legenden sind) sind 3 mal pro Bibliothek erlaubt.",
 "pic": true,
 "token": "eGa6OZnl4fKqlCLJW9LVoHu1rOJvjzwQW/95/SsYUc8=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 11,
 "title": "Gebirge",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Kaskaden Beginn/Ausklang",
 "rule": "Jeder Magier kann, unter Beachtung der Phasenbeschränkung, Kaskaden beginnen und ausklingen lassen. Eine Kaskade klingt aus, wenn kein Magier mehr etwas hinzufügen will. Jeder Magier kann dann stets in der selben Phase eine neue beginnen. Beginnen und ausklingen lassen kann beliebig oft wiederholt werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 12,
 "title": "Ozean",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Turnierincantata",
 "rule": "Die zugelassenen Karten, die für Turnierincantata verwendet werden, können je nach Turnier frei festgelegt werden, allerdings sollten die Karten 1-91 (gioiello d’arco) immer dabei sein. Auf einem Gipfelturnier sind stets alle offiziell veröffentlichen Karten erlaubt. (Turnierincantata)",
 "pic": true,
 "token": "TLAWiEl8Jo+jpPd4GYDuc53didPsXvJcH4Zim8D62N4=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 13,
 "title": "Singularität",
 "cost": "",
 "color": "land",
 "type": "Land, Vielheit",
 "body": "_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "Das Land, das nie jemand sah, doch vielleicht durchschritt.",
 "rule_title": "Geistincantata",
 "rule": "Geistincantata wird ohne Karten gespielt: Man macht alles in Gedanken. Jeder Zauberspruch ist nur einmal erlaubt, und zwar für beide Magier. Jeder Magier zieht in seiner Zugphase Zaubersprüche seiner Wahl aus seinen Gedanken. Falls ein Magier zum Beispiel einen Blitz beschwört, kann der andere Magier diesen Spruch nicht mehr benutzen in dieser Begegnung; er muß, falls er diesen Zauberspruch auf der (gedachten) Hand hat, diesen austauschen gegen einen, der noch nicht beschworen wurde. Himmelskörper, Raumzeitgefüge und Länder zählen nicht zu dieser Beschränkung, da sie keine Zaubersprüche sind; sie unterliegen aber der Regel „Kartenverhältnisse“.<br>",
 "pic": true,
 "token": "ow+1I7eSt0PitnYCK5HRbW0P1dA2GFb56n6cqh3jVnM=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 14,
 "title": "Saphirspiegel",
 "cost": "0",
 "color": "blue",
 "type": "Artefakt, Legende, Schicksal",
 "body": "Gilt als blaue Karte.<br>->: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>Opfere den Saphirspiegel: Kontert einen Spontan- oder Unterbrechungszauber, der nicht 0 kostet.",
 "strength": "",
 "extra": "",
 "rule_title": "Schicksalskarten",
 "rule": "Jeder Magier wählt sein Schicksal und die dazugehörige Schicksalskarte (blau, rot, grün, schwarz, weiß) und nimmt jene vor Beginn aus seiner Bibliothek in die Hand. Man darf nur eine Schicksalskarte wählen. Wenn man kein Schicksal wählt, würde die erste Schicksalskarte, die man von seiner Bibliothek ziehen würde, das Schicksal bestimmen.",
 "token": "7jWe1qMPmw+fU8oB5Hl92yFalT/BYtHjaDmsWGHERmg=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 15,
 "title": "Feueropal",
 "cost": "0",
 "color": "red",
 "type": "Artefakt, Legende, Schicksal",
 "body": "Gilt als rote Karte.<br>->: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>Opfere den Feueropal: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Schicksal",
 "rule": "Die Farbe des Schicksals eines Magiers ist durch die Farbe der ersten Schicksalskarte bestimmt, welche der Magier in die Hand nimmt. Wenn also zum Beispiel ein Magier mit dem Saphirspiegel in seiner Hand die Begegnung beginnt, so ist sein Schicksal blau. Wenn ein Magier ohne ein Schicksal beginnt, zieht aber zu einem späteren Zeitpunkt einen Feueropal, so ist sein Schicksal rot.",
 "token": "RWoAGEvadLkgvdxmo+Tbg3ZEr6PzIbZsqmazBjsPouc=",
 "minting_cost": "5.1",
 "date": 0
},

{
 "card_id": 16,
 "title": "Erwachen",
 "cost": "0",
 "color": "green",
 "type": "Gewaltzauber, Legende, Schicksal",
 "body": "Gilt als grüne Karte.<br>Nimm einen Wald aus Deiner Bibliothek und lege ihn in die Welt. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Nur ein Schicksal",
 "rule": "Wenn ein Magier bereits ein Schicksal gewählt hat und es taucht für ihn eine weitere Schicksalskarte auf, wird jene sofort aus der Welt entfernt.",
 "token": "ZQU+cB/IOVyNTVLy8vPEBy0mP4C6Ze/Ppq/Mng3UVic=",
 "minting_cost": "5.1",
 "date": 0
},

{
 "card_id": 17,
 "title": "Nachtpfauenauge",
 "cost": "0",
 "color": "black",
 "type": "Verzauberung, Legende, Schicksal",
 "body": "Gilt als schwarze Karte.<br>_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>Opfere das Nachtpfauenauge: Füge 3 schwarze Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Materiezauber",
 "rule": "Es gibt folgende Materiezauber: Kreaturenzauber, Verzauberungszauber (auch gezielte Verzauberungen), Entzauberungszauber und Artefaktzauber. Alle Materiezauber sind auch Bleibekarten. Gezielte Verzauberungen/Entzauberungen werden auf ein Ziel beschworen, z.B. Kreaturenverzauberung, Artefaktentzauberung, Verzauberungsverzauberung, Magierverzauberung, etc.",
 "token": "eyLIO/+BKRxOjV4hqBMPVxNzKzNMr7OF33vdzXEcd+E=",
 "minting_cost": "5.1",
 "date": 0
},

{
 "card_id": 18,
 "title": "Goldener Avatar",
 "cost": "0",
 "color": "white",
 "type": "Kreatur, Legende, Schicksal",
 "body": "Gilt als weiße Karte. _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>Opfere den goldenen Avatar: Kontert einen Zauberspruch der nicht 0 kostet.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Tiger",
 "rule": "Wenn man den ersten Tiger kontern kann, sollte man das tun, sonst wird man höchstwahrscheinlich seinen Gegner nicht mehr bezwingen können.",
 "pic": true,
 "token": "M6PFljgPS8Ovm93xbf1pMjqW7yXVS28tcCzebCEXN3I=",
 "minting_cost": "1.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 19,
 "title": "Tiger",
 "cost": "G",
 "color": "green",
 "type": "Kreatur",
 "body": "",
 "strength": "2/1",
 "extra": "Unbesiegbar!",
 "rule_title": "Kampfphase I",
 "rule": "Man kann mit Kreaturen angreifen, aber nur in der Kampfphase. Der Magier kann in seiner Hauptphase eine Angriffsphase deklarieren. Auf das Deklarieren der Angriffsphase darf geantwortet werden. Um zu verhindern, daß eine Kreatur angreifen kann, könnte man sie nun ankanten. Dann benennt der Magier seine Angriffskreaturen. Kreaturen greifen immer den gegnerischen Magier an, nicht Kreaturen direkt. Der Verteidiger benennt seine blockenden Kreaturen. Es können mehr als eine Kreatur eine Angreifende blocken. Nach Bennenung von Angreifern und Blockern können Schnelleffekte (schneller als Gewaltzauber) beschworen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 20,
 "title": "Feuerelementar",
 "cost": "R",
 "color": "red",
 "type": "Kreatur",
 "body": "Selbstvernichtung: Füge einem Ziel einen Schaden zu.",
 "strength": "1/1",
 "extra": "Ein Flämmchen nur, doch meins.",
 "rule_title": "Kampfphase II",
 "rule": "Bevor die Kampfphase endet werden alle Schnelleffekte abgewickelt. Wird durch einen Schnelleffekt eine Kreatur entfernt oder angekantet, so blockt sie trotzdem noch, macht allerdings keinen Schaden. Falls eine angreifende Kreatur entfernt wird, so kann die blockende Kreatur nicht eine andere Kreatur blocken. Das Ankanten eines Angreifers ändert nun nichts mehr. Dann wird der Kampfschaden verrechnet: Alle Blocker und Angreifen fügen sich gegenseitig jeweils die Stärke als Schaden zu. Am Ende der Kampfphase werden dann alle Kreaturen, die 0 oder weniger Widerstandskraft haben, zerstört (in die Unterwelt legen, Wiederbelebung aber noch möglich).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 21,
 "title": "Alessia",
 "cost": "SS3",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt. Lege ein +1/+1 Signum auf Alessia am Ende der Teilrunde, wenn sie einer Kreatur Schaden zugefügt hat.",
 "strength": "4/4",
 "extra": "Heuchelei zu behaupten ihr wäret etwas besseres.",
 "rule_title": "Ende der Teilrunde",
 "rule": "Die Phase „Ende der Teilrunde“ wird eröffnet mit der Ankündigung des Magiers, daß er seine Teilrunde beendet. Als Antwort darauf dürfen Magier mit Zaubersprüchen und Effekten antworten, die schneller sind als ein Gewaltzauber. Entsprechend darf darauf dann auch wieder geantwortet werden. Wenn alle Incantatakaskaden abgewickelt sind endet die Teilrunde. Erst dann werden alle Effekte, die sich auf das Ende der Teilrunde beziehen, abgewickelt. Wenn dann ein Magier, der auch schon von Anfang an dabei war, 0 oder weniger Lebenspunkte hat, endet die Incantatabegegnung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 22,
 "title": "Portugiesische Galeere",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "Unblockbar.",
 "strength": "0/1",
 "extra": "Was für ein Biest.",
 "rule_title": "Geist-Materie-Incantata",
 "rule": "Geist-Materie-Incantata ist eine Variante von Geistincantata: Jeder baut ganz normal eine Bibliothek, darf aber jedesmal bevor er eine Karte zieht, eine Karte seiner Wahl obenauf legen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 23,
 "title": "Fliegendes Pferd",
 "cost": "W",
 "color": "white",
 "type": "Kreatur",
 "body": "Fliegt. Kann nicht angreifen.",
 "strength": "0/3",
 "extra": "Den Gerechten zu Diensten.",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 24,
 "title": "Befriedung",
 "cost": "W",
 "color": "white",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur kann weder angreifen noch blocken.",
 "strength": "",
 "extra": "Wozu all der Ärger?",
 "rule_title": "Karge Zeiten",
 "rule": "Ein angekantetes Land kann kein Mana verwandeln.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 25,
 "title": "Stärke",
 "cost": "G",
 "color": "green",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur erhält +2/+1 oder +1/+2; lege dies bei der Beschwörung fest.",
 "strength": "",
 "extra": "",
 "rule_title": "Freiwillig",
 "rule": "Das zurückstellen der Karten in der Erneuerungsphase ist freiwillig, man kann darauf verzichten.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 26,
 "title": "Bestialisierung",
 "cost": "R",
 "color": "red",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur erhält +3/+3. In Deiner Versorgungsphase lege einen -1/-1 Signum auf die Kreatur.",
 "strength": "",
 "extra": "Immerhin stirbt es nun schneller.",
 "rule_title": "Signa",
 "rule": "Ein Signum (Mz. Signa) ist ein Spielstein/Markierungsstein, der auf Bleibekarten gelegt wird. Die Bedeutung eines Signums wird durch den Zauber festgelegt, durch den es in die Welt gekommen ist.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 27,
 "title": "Verhexung",
 "cost": "S",
 "color": "black",
 "type": "Kreaturenverzauberung",
 "body": "Der Beherrscher der Kreatur erhält einen Schaden in seiner Versorgungsphase.",
 "strength": "",
 "extra": "",
 "rule_title": "Schwergewichte",
 "rule": "Himmelskörper gelten zwar als Bleibekarten, können aber niemals auf die Hand genommen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 28,
 "title": "Astralschild",
 "cost": "B",
 "color": "blue",
 "type": "Kreaturenverzauberung, Wunder",
 "body": "Opfere das Astralschild: Kontert einen Zauberspruch, der die Kreatur als Ziel hat.",
 "strength": "",
 "extra": "",
 "rule_title": "Turniergroßmagier",
 "rule": "Turniergroßmagier ist, wer jemals ein Gipfelturnier gewonnen hat. Jeder Gipfelturniergewinner erhält eine Drachengemme vom Typ <b>SD(L)</b> oder <b>SD(H)</b> (Turnierincantata)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 29,
 "title": "Geisteskraft",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier werfen alle ihre Handkarten ab und ziehen ebensoviele neue.",
 "strength": "",
 "extra": "Sie fliegt dahin, wer kann sie fassen?",
 "rule_title": "Incantata Gipfelturnier",
 "rule": "Das Incantata Gipfelturnier kann nur einmal pro Jahr ausgetragen werden und die Endrunde wird mit 28 Teilnehmern im schweizer System ausgeführt (falls sich nicht 28 Teilnehmer finden, so kann das Gipfelturnier nicht stattfinden), so daß jeder Magier mindestens 21 Begegnungen hat (3 Begegnungen pro Paarung). Vor der ersten Begegnung je Paarung, werden die Bibliotheken (jene welche sie selbst konstruiert haben) an die Magier der Begegnung verlost und dann je Begegnung getauscht. Bei jeder Begenung muß ein regelsicherer Schiedsrichter anwesend sein. (Turnierincantata)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 30,
 "title": "Schwächeanfall",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält temporär -2/-2.",
 "strength": "",
 "extra": "",
 "rule_title": "Trugbilder",
 "rule": "Trugbilder sind nichtmaterielle Bleibekarten. Wenn nicht anders angegeben bleiben sie bis zum Ende der Teilrunde erhalten. Trugbilder kann man sich als Verzauberungen der Ideenwelt vorstellen. Der Effekt des Trugbildes gilt ab der Kaskade in der es beschworen wurde. Wird ein Trugbild gekontert oder vernichtet, so werden alle Effekte des Trugbildes (auch rückwirkend) zurückgenommen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 31,
 "title": "Rückhalt",
 "cost": "G",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Enferne eine Verzauberung aus der Welt; wirkt nicht auf Schicksale.",
 "strength": "",
 "extra": "",
 "rule_title": "Selbsterhalt",
 "rule": "Ein Magier kann sich nicht mutwillig selber schädigen, wenn es keinem Zweck dient. Dies gilt insbesondere auch, wenn er noch ein Platzwechsel plant. Auch kann ein Magier sich nicht selbstschädigen um die Begegnung zu beenden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 32,
 "title": "Rücknahme",
 "cost": "B",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Eine Bleibekarte wird von ihrem Besitzer zurück auf die Hand genommen.",
 "strength": "",
 "extra": "Als hätte es nie existiert.",
 "rule_title": "Leben zahlen",
 "rule": "Wenn zum Zahlen von Lebenspunkten aufgefordert wird, kann dieser Verlust weder verhindert noch umgeleitet werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 33,
 "title": "Lebenskraft",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Alle Magier erhalten 4 Lebenspunkte.",
 "strength": "",
 "extra": "Ein Funken Beginn.",
 "rule_title": "Ideenwelt",
 "rule": "Die Ideenwelt war schon immer da. Alle Zaubersprüche, die beschworen werden, und gegebenenfalls Kopien von Zaubersprüchen, tauchen in der Ideenwelt auf. Eine Unterideenwelt ist eine volle Incantatakaskade. Gekonterte Zaubersprüche verbleiben in der Ideenwelt, werden aber als gekontert markiert. Wenn die Incantatakaskade abgewickelt ist wird die Ideenwelt erneuert, das heißt, daß eine neue leere Unterideenwelt eröffnet wird. Alle vorherigen Unterideenwelten verbleiben entsprechend. Die Ideenwelt existiert immerfort.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 34,
 "title": "Agression",
 "cost": "G",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält temporär +3/+3.",
 "strength": "",
 "extra": "Wer hat denn angefangen?",
 "rule_title": "Zweigkaskaden",
 "rule": "Wenn man auf einen Zauberspruch einer Kaskade (Stammkaskade) antwortet, aber der Antwortspruch schneller ist, als der Zielspruch, entsteht eine Zweigkaskade. Wenn alle Magier mit dem Zaubern fertig sind und keine weitere Anwort mehr gezaubert wird, bilden alle Zweigkaskaden und die Stammkaskade eine Incantatakaskade (kurz Kaskade). Nun werden die Zweigkaskaden und die Stammkaskade (zuerst schnell, dann langsam) abgewickelt („zuletzt herein - zuerst hinaus“). Ein einzelner Zauberspruch oder Effekt ist auch eine Kaskade, allerdings nur mit einem Teil.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 35,
 "title": "Blitz",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel drei Schaden zu.",
 "strength": "",
 "extra": "Britzel!",
 "rule_title": "Verpuffen",
 "rule": "Falls das Ziel eines Zauberspruches verschwunden ist, verpufft dieser; er wird einfach abgelegt.",
 "pic": true,
 "minting_cost": "5.1",
 "token": "9OL6wi5FQavGbj/gBWmvIF0ubjDShrgB4H1HbEfpj1k=",
 "taken": true,
 "date": 0
},

{
 "card_id": 36,
 "title": "Loslassen",
 "cost": "B",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Eine Kreatur kann temporär fliegen. Ziehe eine Karte.",
 "strength": "",
 "extra": "Vergiß doch einfach, daß es die Schwerkraft gibt.",
 "rule_title": "Formeln",
 "rule": "Alle Zaubersprüche, die nicht den Typ Legende, Wunder, Vielheit, Einmaligkeit oder Einzigartigkeit haben, gelten und wirken als Formeln (lang: Zauberformel). Formeln sind je 3 mal pro Bibliothek erlaubt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 37,
 "title": "Glitzerstrahl",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber, Legende",
 "body": "Ein Magier erhält 6 Lebenspunkte, wenn er 0 oder weniger Lebenspunkte hat.",
 "strength": "",
 "extra": "In der dunkelsten Stunde werde ich für Dich da sein.",
 "rule_title": "Ende der Begegnung",
 "rule": "Eine Incantatabegegnung kann auf 2 Arten enden: 1. Ein oder beide Magier haben keine Lebenspunkte mehr am Ende einer Teilrunde. 2. Ein oder beide Magier können keine Karte mehr von ihre Bibliothek ziehen, wenn sie dies tun müssen. (Dies bezieht sich nur auf Magier, die von Anfang an dabei waren.)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 38,
 "title": "Persönliche Angelegenheit",
 "cost": "S",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Entferne eine Kreatur Deines Gegners aus der Welt; Erhalte soviel Schaden wie die Kreatur Stärke hatte.",
 "strength": "",
 "extra": "Richtig! Dich vernicht' ich.",
 "rule_title": "Manaschummelei",
 "rule": "Wer sich das passende Mana erschummelt und erwischt wird, soll sich schämen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 39,
 "title": "Tulpe",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _1_, Opfere die Tulpe: Füge ein schwarzes, rotes oder blaues Mana zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Universum",
 "rule": "Das Incantata-Universum besteht aus der Summe aller 7 Welten: Der Ideenwelt, Schriftwelt, Gedankenwelt, Unterwelt, Welt, Kosmos und Unwelt. „Deine Teilwelt“ ist synonym mit „Deine Welt“, sowie „Deine Teilunterwelt“ synonym ist mit „Deine Unterwelt“. „unter Deiner Kontrolle in der Welt“ ist synonym mit „in Deiner Teilwelt“ etc. Nachdem man das Mantra der Reinheit aus dem Spiel entfernt hat, wird das Incantata-Universum zum Universum. Diese Tranformation wird Rückgängig gemacht, nachdem die Begegnung geendet hat.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 40,
 "title": "Kontrolle",
 "cost": "W",
 "color": "white",
 "type": "Unterbrechungszauber",
 "body": "Übernehme die Kontrolle über einen Unterbrechungszauber.<br>_1_: Vergessen.",
 "strength": "",
 "extra": "Wie frei ihr euch doch gleich fühlt.",
 "rule_title": "Existenz",
 "rule": "Incantataregeln, die existieren, gelten, auch wenn sie nicht sichtbar sind.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 41,
 "title": "Seelengift",
 "cost": "S",
 "color": "black",
 "type": "Unterbrechungszauber",
 "body": "Ein Zauberspruch oder Effekt, der Lebenspunkte gibt oder die Widerstandskraft einer Kreatur erhöht, verursacht stattdessen Schaden oder verringert die Widerstandskraft der Kreatur.",
 "strength": "",
 "extra": "Ein Tröpfchen nur, und siehe wie du mir dienest.",
 "rule_title": "Incantata-Krypto-Universum",
 "rule": "Das Incantata-Krypto-Universum ist genauso strukturiert wie das Incantata-Universum. Logischerweise ist das Incantata-Krypto-Universum im Krypto-Universum und das Incantata-Universum in der Wirklichkeit. Je nach Art des Incantata-Krypto-Universums können Karten fehlen, die in der Wirklichkeit sind. Oder aber Karten, die in der Wirklichkeit nicht existieren, können in einem bestimmten Incantata-Krypto-Universum vorhanden sein.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 42,
 "title": "Naturgeist",
 "cost": "GGG4",
 "color": "green",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Verursacht Durchbruchsschaden.<br>Wenn der Naturgeist Ziel eines Zauberspruches wird, erhält sie +2/+1 bis zum Ende der Teilrunde.",
 "strength": "7/7",
 "extra": "Ich erkenn's, ihr wäret gern wie ich.",
 "rule_title": "Inkarnation",
 "rule": "Du darfst eine Inkarnation nur beschwören, wenn du das dazu passende Schicksal gewählt hast. Dabei ist nicht entscheidend, ob es noch in der Welt ist.",
 "pic": true,
 "token": "/KdR/HNwNWZnU5eDp02eVGfWUrz/PaGcb/UC3KCJ4Kw=",
 "taken": true,
 "date": 0
},

{
 "card_id": 43,
 "title": "Lebensgeist",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen blauen Zauberspruch.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Du gleichst dem Geist, den Du begreifst.",
 "rule_title": "Vergessen",
 "rule": "Eine Karte mit dem Effekt „Vergessen“ kann für die Aktivierungskosten abgelegt werden, um eine neue Karte zu ziehen.Beispiel: 2: Vergessen -> zahle 2 beliebige Mana, um die Karte aus der Hand abzulegen; ziehe eine neue Karte. Dieser Effekt wird mit der Geschwindigkeit der Ursprungskarte beschworen, und darf nur in der entsprechenden Phase aktiviert werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 44,
 "title": "Einwand",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Unterbrechungszauber.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Ein messerscharfer Verstand macht den Unterschied.",
 "rule_title": "Vollkommen",
 "rule": "Kündige an, welcher der entscheidende Zauber sein wird. Wenn dieser Zauber am Ende der Entscheidende ist, gilt diese Begegnung als vollkommen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 45,
 "title": "Erscheinung",
 "cost": "WWW4",
 "color": "white",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Fliegt.<br>->, _R__R_: Füge einem Ziel 2 Schaden zu.<br>_G_: Temporär +2/+0",
 "strength": "0/9",
 "extra": "Blasphemie... beizeiten verzeihlich.",
 "rule_title": "Zauberpause",
 "rule": "In der Erneuerungs-, Zug- und Himmelsphase dürfen keine Zaubersprüche beschworen und auch keine Effekte aktiviert werden. In der Ablegephase dürfen keine Zaubersprüche beschworen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 46,
 "title": "Lichtbringer",
 "cost": "SSS4",
 "color": "black",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Verursacht Durchbruchsschaden.<br>->: Entferne eine angekantete Kreatur aus der Welt.",
 "strength": "7/7",
 "extra": "Man hat mich stets falsch verstanden.",
 "rule_title": "Welt",
 "rule": "Es gibt Karten in der Welt (beschworene oder gelegte Bleibekarten), Karten außerhalb der Welt (in der Hand, Bibliothek oder Unterwelt) und Karten, die aus der Welt enfernt sind.",
 "pic": true,
 "token": "tSmAl/Wsus6jepcp3meh2ccd5lCYKfCNKOkBHPP4HiE=",
 "minting_cost": "1.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 47,
 "title": "Leviathan",
 "cost": "BBB4",
 "color": "blue",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Vernichte den Leviathan, wenn Du keinen Ozean kontrollierst. Verursacht Durchbruchsschaden. _B_, Vernichte einen Ozean: Kontert einen Zauberspruch, der den Leviathan als Ziel hat.",
 "strength": "7/7",
 "extra": "Er hat stets eine passende Antwort.",
 "rule_title": "Offizielle Version",
 "rule": "Die offiziell zulässige Incantataversion ist jene auf der offiziellen Incantata 0Net-Seite. Wenn eine ältere Karte benutzt wird, die sich spieltechnisch von der offiziellen Version unterscheidet, darf sie nur so benutzt werden, wie die offizielle Version.",
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 48,
 "title": "Drache",
 "cost": "RRR4",
 "color": "red",
 "type": "Kreatur, Legende, Inkarnation",
 "body": "Fliegt.<br>->, _R__R_: Füge einem Ziel 2 Schaden zu.",
 "strength": "8/8",
 "extra": "Entgegen den Gerüchten habe ich keine schwache Stelle.",
 "rule_title": "Effektantworten",
 "rule": "Auf Effekte von Bleibekarten kann geantwortet werden. Mit einem Zauberspruch kann geantwortet werden, wenn die Geschwindigkeit gleich oder höher der des Bleibekarteneffektes ist.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 49,
 "title": "Stärkeprinzip",
 "cost": "R",
 "color": "red",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen blauen Zauberspruch.<br>_2_: Vergessen.",
 "strength": "",
 "extra": "Am Ende besiegt der Geist das Schwert? Dass ich nicht lache!",
 "rule_title": "Hoffentlich Höflich",
 "rule": "Wenn in einer Incantatabegegung ein Magier angehalten wird einen Zauberspruch zu kontern, gilt es als besonders höflich dies in höfisch-höflicher Form zu tun. Also zum Beispiel: Majestät/ Durchlaucht/ Hochwohlgeboren! So kontert doch diesen Zauberspruch!",
 "pic": true,
 "token": "ZRkBR6KLJLQF5CZsJGzcwmhPj2yHz5dT5N6eoYs0mvE=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 50,
 "title": "Gluthammer",
 "cost": "RRX",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Kann nicht gekontert werden.<br>Füge einem Ziel X Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Quellenergien",
 "rule": "Es gibt 9 Quellenergien, die Dinge hervorbringen im Incantata-Universum: Erdenergie (bringt Länder hervor - gelten als farblos), Kosmische Energie (bringt Himmelskörper & RZG hervor - gelten als farblos), Blau, Grün, Weiß, Schwarz, Rot, Lichtschwarz, Lichtweiß (von jeder Farbe), Lichtgrau (von jeder Farbe und farblos) und Schattenweiß. Erd- und Kosmische Energie vereint bringt farblose Artefakte hervor. ",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 51,
 "title": "Racheengel",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur",
 "body": "Zählt auch als schwarze Karte.<br>Fliegt.<br>Wird für den Angriff nicht angekantet.",
 "strength": "4/4",
 "extra": "Nun ist es an dir.",
 "rule_title": "Briefe an Unbekannte",
 "rule": "Wenn Du/Dir groß geschrieben ist, so ist der Magier angesprochen.",
 "pic": true,
 "token": "bTAz9qAtBQ9bmKE4NtnFjGMmqEgZdXELKk0Xvv0LQMg=",
 "taken": true,
 "date": 0
},

{
 "card_id": 52,
 "title": "Goldkarpfen",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Immer wenn der Goldkarpfen Ziel eines Zauberspruches wird, ziehe eine Karte.",
 "strength": "1/1",
 "extra": "Freundschaft ist golden.",
 "rule_title": "Kartenverhältnisse",
 "rule": "Im Gegensatz zu Legenden sind alle anderen Karten 3 mal pro Bibliothek erlaubt - Auch Himmelskörper. Standardländer sind beliebig oft erlaubt. Raumzeitgefüge sind 6 mal erlaubt. Sehr ernsthafte Incantatamagier nehmen von Karten, die eine andere Farbe haben als ihr Schicksal, nur eine Karte je Zauberspruch in die Bibliothek.",
 "token": "fl8nebcmamXbj08u7Q8j8PUP/3bTcykR8jgR2/2XG2s=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 53,
 "title": "Wellenpferde",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Ein Ozean wird zu einer 3/3 Kreatur, bleibt aber auch weiterhin ein Ozean.",
 "strength": "",
 "extra": "Sie erhoben sich plötzlich und bäumten sich auf, wie gewaltige Schlachtrösser.",
 "rule_title": "Transzendentalmeister",
 "rule": "Wenn die Begegnung endet und der Märtyrer feststeht, wird geprüft ob die nächste Karte des Märtyrers die Begenung definitiv anderherum hätte ausgehen lassen (die Teilrunde wird bis ausschließlich der Kampfphase simuliert), so ist der Märtyrer der Begegnung transzendent, also untentschieden. Dies ist nur möglich, wenn die Begegnung am Ende der Teilrunde des Nichtmärtyrers endete. (optional)",
 "pic": true,
 "token": "QNT6q9xFGjaOn6r8iP4qKd7+nMBhs/SZ8n/p/9RKs0g=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 54,
 "title": "Apfelbaum",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur",
 "body": "",
 "strength": "3/4",
 "extra": "",
 "rule_title": "Legende",
 "rule": "Karten mit dem Typ „Legende“ sind nur einmal pro Bibliothek erlaubt.",
 "pic": true,
 "token": "SLH0j+5HTXhcOWB24r7yWrGGhTPrpcFP5Zru0IqhqyE=",
 "taken": true,
 "date": 0
},

{
 "card_id": 55,
 "title": "Sturmramme",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "Die Sturmramme muß angreifen.",
 "strength": "5/4",
 "extra": "Ein probates Mittel.",
 "rule_title": "Materiezauber",
 "rule": "Wenn ein Materiezauber gelungen ist (=verwirklicht ist), manifestiert sich der Zauber als Bleibekarte in der Welt und wird, so wie der Kartentyp das festlegt, zu eine(r/m) Kreatur, Artefakt, Verzauberung oder Entzauberung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 56,
 "title": "Unterbrechung",
 "cost": "WW",
 "color": "white",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch.",
 "strength": "",
 "extra": "Weisheit klingt in Narrenohren wie Wahnsinn.",
 "rule_title": "Antworten",
 "rule": "Es gibt 7 Zauberspruchgeschwindigkeiten bei Incantata (langsam->schnell):<br>- Materiezauber (Bleibekarten)<br>- Gewaltzauber<br>- Spontanzauber<br>- Unterbrechungszauber<br>- Energiezauber<br>- Traumzauber<br>- Gleichzeitigkeitszauber<br>Man kann auf einen Zauberspruch nur antworten, wenn der Antwortzauber so schnell, oder schneller ist. Alle Zaubersprüche, die als Antwort beschworen wurden und der erste bilden eine Incantatakaskade oder kurz Kaskade. Kaskaden werden „zuletzt herein - zuerst hinaus“ abgewickelt. Siehe auch: Zweigkaskaden",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 57,
 "title": "Jenseitsruf",
 "cost": "S1",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Vernichte eine nichtschwarze Kreatur.",
 "strength": "",
 "extra": "Keine Sorge, es wird dir dort gefallen.",
 "rule_title": "Vernichten",
 "rule": "Wird eine Kreatur vernichtet wird sie in die Unterwelt gelegt und kann nicht wiederbelebt werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 58,
 "title": "Tödlicher Funke",
 "cost": "RR1",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Zerstöre eine Kreatur.",
 "strength": "",
 "extra": "Manchmal reicht ein Funke.",
 "rule_title": "Zerstören",
 "rule": "Wird eine Kreatur zerstört so wird sie in die Unterwelt gelegt, sofern sie nicht wiederbelebt wird.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 59,
 "title": "Erschwernis",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch, wenn dessen Beherrscher nicht _3_ zahlt.",
 "strength": "",
 "extra": "Wie wird mir - das Denken wird mir lahm...",
 "rule_title": "Kontern",
 "rule": "Wenn ein Zauberspruch oder Effekt gekontert wird, wird verhindert, daß jener in die Welt kommt, beziehungsweise wirkt. Falls es ein Zauberspruch war, wird die betreffende Karte einfach abgelegt. Bereits aufgewendete Beschwörungskosten werden nicht zurückgenommen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 60,
 "title": "Talisman",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber, Legende",
 "body": "Wähle einen der folgenden Effekte * Du erhältst 3 Lebenspunkte * Eine Kreatur erhält temporär +2/+1 * Alle Deine Kreaturen erhalten temporär +0/+1. Ziehe eine Karte.",
 "strength": "",
 "extra": "Er wird Euch stets von Nutzen sein.",
 "rule_title": "Widerrechtlich",
 "rule": "Es ist nicht möglich, sich Incantatakarten widerrechtlich anzueignen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 61,
 "title": "Schamane",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Effekte von Bleibekarten",
 "rule": "Die Effekte von Bleibekarten werden mit Spontanzaubergeschwindigkeit aktiviert, das heißt, daß man nur mit Zaubersprüchen gleicher/höherer Geschwindigkeit, oder Effekten höherer Geschwindigkeit antworten kann.<br>Aber es gibt Ausnahmen:<br>- Karteneffekte die Mana produzieren oder verwandeln: Energiezaubergeschwindigkeit.<br>- Karteneffekte, die Effekte oder Zaubersprüche kontern können: Unterbrechungszauber= geschwindigkeit.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 62,
 "title": "Flaschengeist",
 "cost": "B2",
 "color": "blue",
 "type": "Kreatur",
 "body": "Fliegt.<br>Der Flaschengeist fügt Dir in Deiner Versorgungsphase einen Schaden zu.",
 "strength": "3/4",
 "extra": "Ich sagte: „Nun müssen wir beide sterben!“ Und er sagte: „Was soll ich machen, es ist meine Natur.“",
 "rule_title": "Phasen",
 "rule": "In jeder Teilrunde gibt es 7 mögliche Phasen:<br>- Erneuerungsphase<br>- Himmelsphase<br>- Versorgungsphase<br>- Zugphase<br>- Hauptphase<br>- Angriffsphase (innerhalb der Hauptphase)<br>- Ablegephase",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 63,
 "title": "Kriegstrommeln",
 "cost": "R2",
 "color": "red",
 "type": "Verzauberung",
 "body": "Alle Deine angreifenden Kreaturen erhalten +1/+0.",
 "strength": "",
 "extra": "Dong Do-Do Do-Do Dong Do-Do Do-Do...",
 "rule_title": "Temporär",
 "rule": "Ein Effekt der temporär ist hält nur bis zum Ende der Teilrunde an. Falls in einem Satz mehrere Effekte mit einem Vorangehenden „temporär“ attribuiert werden, so sind alle Effekte temporär.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 64,
 "title": "Fledermaus",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt.",
 "strength": "1/1",
 "extra": "Wie eine fliegende Ratte, bloß noch häßlicher.",
 "rule_title": "Beschwörungstaumel",
 "rule": "Wenn Kreaturen beschworen werden, leiden sie unter Beschwörungstaumel. Das heißt: Kreaturen, die nicht bereits vor Beginn Deiner Teilrunde in der Welt waren, können weder angreifen noch Effekte aktivieren, die ein Ankanten als Teil ihrer Aktivierungskosten haben. Allerdings sind Effekte die kein Ankanten erfordern sofort verfügbar.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 65,
 "title": "Schildwall",
 "cost": "W1",
 "color": "white",
 "type": "Verzauberung",
 "body": "Alle Deine Kreaturen mit der Stärke 0 erhalten +0/+2.",
 "strength": "",
 "extra": "Wie eine lebende Mauer.",
 "rule_title": "Die 7 Welten",
 "rule": "Es gibt 7 Welten: 1. Gedankenwelt (Summe aller Teilgedankenwelten=Handkarten eines Magiers) 2. Ideenwelt 3. Unterwelt (Summe aller Teilunterwelten) 4. Welt (Summe aller Teilwelten) 5. Schriftwelt (Summe aller Bibliotheken) 6. Unwelt (=Hölle) 7. Kosmos (Summe aller Ekliptiken, Himmelskörper in der Welt und aller Raumzeitgefüge)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 66,
 "title": "Heilgarten",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _2_: Füge Dir einen Lebenspunkt hinzu.",
 "strength": "",
 "extra": "An diesem Ort ist alles heilsam.",
 "rule_title": "Begegnung",
 "rule": "Eine Partie Incantata wird „Begegnung“ genannt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 67,
 "title": "Aufklärung",
 "cost": "W1",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Zerstöre ein Artefakt oder eine Verzauberung.",
 "strength": "",
 "extra": "Glaube mir, deine Unmündigkeit ist selbstverschuldet.",
 "rule_title": "Schicksalszerstörung",
 "rule": "Natürlich kann man Schicksale zerstören; es wird aber auf Dich zurückfallen, und zwar auf schicksalhafte Weise.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 68,
 "title": "Pesthauch",
 "cost": "S1",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Alle Magier und alle Kreaturen erhalten einen Schaden.",
 "strength": "",
 "extra": "Und das war nur der Vorgeschmack!",
 "rule_title": "Gewaltzauber",
 "rule": "Gewaltzauber sind mächtige Zaubersprüche, die ein Magier nur in seiner Hauptphase - außerhalb der Kampfphase - beschwören kann. Bedenke, daß Gewaltzauber in Incantata auch als Antwort beschworen werden können.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 69,
 "title": "Plasmastoß",
 "cost": "RX",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Füge einem Ziel X Schaden zu, dieser Schaden kann nicht verhindert oder umgelenkt werden.",
 "strength": "",
 "extra": "Der Geist ist ein Feuer, dessen Flamme der Gedanke ist.",
 "rule_title": "Phasenbeschränkung",
 "rule": "Gewaltzauber und Materiezauber (Kreaturen und Verzauberungen) können nur in Deiner Hauptphase - außerhalb der Kampfphase - beschworen werden. Das Auslegen von Ländern unterliegt auch dieser Phasenbeschränkung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 70,
 "title": "Lüge",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Kante eine Bleibekarte an oder stelle sie zurück; Ziehe eine Karte.",
 "strength": "",
 "extra": "Eine folgt der anderen.",
 "rule_title": "Valide",
 "rule": "Ein valides Ziel für Schaden ist ein Magier oder eine Kreatur.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 71,
 "title": "Lebensspende",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Zusätzliche Beschwörungskosten= Zahle einen Lebenspunkt.<br>Wiederbelebe eine Kreatur; Ziehe eine Karte.",
 "strength": "",
 "extra": "Dich lass ich nicht im Stich!",
 "rule_title": "Farbwechsel",
 "rule": "Die Änderung der Farbe einer Karte bleibt erhalten, auch wenn sie auf die Hand, in der Bibliothek oder in die Unterwelt kommt; nicht jedoch wenn sie aus der Welt entfernt wird oder in die Hölle kommt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 72,
 "title": "Giftpfeil",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Eine Kreatur erhält einen Schaden; Zerstöre diese Kreatur, wenn sie in dieser Teilrunde erneut Schaden erhält.",
 "strength": "",
 "extra": "Einer vermag ein Schwert zu schmieden, ein anderer vermag es zu nuzten.",
 "rule_title": "Ausfüllen",
 "rule": "Eine Karte mit einem Ausfüllfeld „______“ ist nur gültig, wenn es vor der Begegnung ausgefüllt wurde.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 73,
 "title": "Himmelsstürmer",
 "cost": "BB3",
 "color": "blue",
 "type": "Kreatur",
 "body": "Nachwirkung: Kante alle anderen fliegenden Kreaturen an.<br>Fliegt.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Effekte",
 "rule": "Effekte sind eine Aufzählung von Aussagen. Falls diese Aussagen kein Subjekt oder Objekt enthalten, ergänzt der Magier in Gedanken die Aussage zu einem Satz. Z.B. „<i>Der Himmelsstürmer</i>“ fliegt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 74,
 "title": "Kampfzwerg",
 "cost": "R1",
 "color": "red",
 "type": "Kreatur",
 "body": "Erstschlag.",
 "strength": "2/1",
 "extra": "Ein zäher Bastard.",
 "rule_title": "Erstschlag",
 "rule": "Eine Kreatur mit Erstschlag teilt im Kreaturenkampf ihren Kampfschaden zuerst aus. Alle Kreaturen, die dagegen kämpfen erhalten also bei der Schadensverrechnung diesen Schaden zuerst, falls sie tödlichen Schaden erhalten (0 oder <0), dann können sie nicht ihren Kampfschaden austeilen, es sei denn sie haben auch Erstschlag.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 75,
 "title": "Krähe",
 "cost": "S1",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt.",
 "strength": "2/1",
 "extra": "Krah!",
 "rule_title": "Fliegen",
 "rule": "Fliegende Kreaturen können sowohl fliegende als auch nicht fliegende Kreaturen blocken, während nicht fliegende Kreaturen, fliegende nicht blocken können.",
 "pic": true,
 "token": "90gfg11JPJjQgv9t+G6v1+qMhC9DL7QRi9z6n5BXoU0=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 76,
 "title": "Schwarze Perle",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "Zusäztliche Beschwörungskosten= Zweifache Himmelsmacht.<br>->: Füge ein farbloses Mana zu Deinem Manavorrat hinzu.<br>",
 "strength": "",
 "extra": "",
 "rule_title": "Seltenheit",
 "rule": "Du darfst eine Seltenheit nur einmal unter Deiner Kontrolle in der Welt haben. Fall die gleiche Seltenheit schon unter Deiner Kontrolle ist, darfst du eben diese Seltenheit nicht noch einmal beschwören, und auch nicht einen Zauberspruch oder Effekt zur Hilfe nehmen, der diese Seltenheit in die Welt bringen würde. Falls Dein Gegner einen Effekt oder Zauberspruch benutzt, der Dir eine Seltenheit beschert, die Du schon unter Deiner Kontrolle hast, mußt du alle Seltenheiten dieser Art, bis auf eine, entfernen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 77,
 "title": "Energiesenke",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->: Kante eine Bleibekarte an.",
 "strength": "",
 "extra": "Höllenapparillo - merkwürdig",
 "rule_title": "Verrechnung von Beschwörungskosten",
 "rule": "Beim Beschwören eines aktivierbaren Effektes oder Zauberspruches werden die Beschörungskosten (Ankanten, Opfern, Mana, etc.) vorgemerkt, und können somit nicht für etwas anderes mehr ausgegeben werden. Im Momente der Verwirklichung werden alle jene Kosten genau dann verrechnet. Bedenke: Eine zum Opfern vorgemerkte Kreatur ist nicht, eine zum Ankanten vorgemerkte Bleibekarte kann man nicht ankanten, Mana das für einen Zauberspruch reserviert ist, kann man nicht benuzten, usw.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 78,
 "title": "Opferschale",
 "cost": "3",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, Opfere ein Land: Ziehe eine Karte.<br>->, _2_, Opfere ein nichtkreatur Artefakt: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Bleibekarteneffektkaskaden",
 "rule": "Eine Incantatakaskade kann auch durch einen Effekt einer Bleibekarte begonnen werden (Effektkaskade).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 79,
 "title": "Weihrauch",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Verhindere einen Schadenspunkt bei allen Kreaturen, die die Stärke 0 haben. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Karten ziehen",
 "rule": "Wenn dazu aufgefordert wird eine Karte zu ziehen, so zieht man diese Karte von seiner Bibliothek, falls nichts anderes angegeben ist (z.B. Ekliptik).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 80,
 "title": "Helle Magie",
 "cost": "WS2",
 "color": "light_black",
 "type": "Unterbrechungßauber, Einmaligkeit",
 "body": "Gilt als lichtschwarze Karte. Entferne eine Aufforderung, etwas zu opfern von den Aktivierungskosten eines Effektes eines Materiezaubers; jener Materiezauber darf kein Schicksal sein.",
 "strength": "",
 "extra": "",
 "rule_title": "ẞ",
 "rule": "Unterbrechungszauber kann man auch Unterbrechungßauber schreiben",
 "pic": true,
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 81,
 "title": "Kugelblitz",
 "cost": "RR",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Füge einem Ziel 3 Schaden zu; Der Beherrscher dieses Zieles fügt dann 2 Schaden einem Ziel seiner Wahl zu; Dessen Beherrscher fügt dann einen Schaden einem Ziel seiner Wahl zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Selbstbeherrschung",
 "rule": "Falls ein Effekt oder ein Zauberpruch sich auf den Beherrscher eines Zieles bezieht, so rufe Dir in Erinnerung, daß jeder Magier stets selber der Beherrscher seiner selbst ist.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 82,
 "title": "Schöpfungsumkehr",
 "cost": "BB3",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Alle Kreaturen werden von ihren Besitzern zurück auf die Hand genommen.",
 "strength": "",
 "extra": "",
 "rule_title": "Kosmos",
 "rule": "Der Kosmos (Himmelswelt) besteht aus allen Ekliptiken und allen Himmelskörpern in der Welt und allen Raumzeitgefügen. Der Kosmos entfaltet sich innerhalb von 13 Runden (Äonen) und wenn er voll entfaltet ist, ist der Kosmos in der Welt und die Welt im Kosmos. Der Kosmos tranzendiert, weil auch die von der Welt entfernten Raumzeitgefüge dazugehören.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 83,
 "title": "Naturgesetz",
 "cost": "GG",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Vernichte ein Artefakt. Kann nicht gekontert werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Gedankenwelt",
 "rule": "Die Gedankenwelt ist die Summe aller Teilgedankenwelten der Magier (=Handkarten). Die Gedankenwelt ist eins, doch ist den Magiern nicht alles offenbar. Viele Gedanken (Handkarten) bleiben vorborgen - im besonderen Geheimnisse, die auf der Hand (und auch der Bibliothek) nicht enthüllt werden müssen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 84,
 "title": "Schutzengel",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Frage um Erlaubnis, um mit dem Schutzengel angreifen zu können.<br>0, Opfere den Schutzengel: Rette Deinen Gegner.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Wunder",
 "rule": "Wunder sind pro Bibliothek 2 mal erlaubt.",
 "token": "M+iL2dPNEcSwg1Xu9Q68GM6ZF8Fl9jkPOYgdECQHZXI=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 85,
 "title": "Ideenklau",
 "cost": "BB2",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch;<br>_1_: Wenn jener Zauberspruch ein Artefakt- oder Kreaturenzauber ist, lege es/sie direkt in Deine Welt.",
 "strength": "",
 "extra": "Komisch, das war eigentlich auch meine Idee.",
 "rule_title": "Zeichen",
 "rule": "Die Aktivierungskosten für Effekte können eine Liste von Aussagen sein, die mit einem Komma getrennt aufgezählt werden. Zur Verdeutlichung beginnt jede Aussage mit einem Großbuchstaben. Falls für eine Aussage ein Nebensatz notwendig ist (mit Komma abgetrennt) , beginnt jener mit einem Kleinbuchstaben. Die Effekte einer Karte sind Aussagen, die je mit einem Punkt enden. Taucht ein Semikolon auf, so beginnt danach eine Aussage (welche mit einem Großbuchstaben beginnt), die sich auf die Aussage davor bezieht. Die Aussage hinter dem Semikolon kann nur eintreten, wenn die vohergehende Effekt eingetreten ist. Wird nach einen Semikolon klein geschrieben, so handelt es sich nur um einen Nebensatz.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 86,
 "title": "Funkenknall",
 "cost": "R4",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Verteile 5 Schaden auf beliebig viele Ziele.",
 "strength": "",
 "extra": "Die Gestirne? Gewiss - doch schaut dieses Schauspiel!",
 "rule_title": "Gebrochene Zahlen",
 "rule": "Falls gebrochenen Zahlen auftauchen, werden sie grundsätzlich aufgerundet. Gründe ein Rat, der für Zweifelsfälle festlegt, ob für diese auf- oder abgerundet werden soll.",
 "token": "WnLwS27zPSRlhlzyoFN7PZdcU+BxYEXRQaZ0xC2G+zQ=",
 "minting_cost": "5.1",
 "date": 0
},

{
 "card_id": 87,
 "title": "Wiederkehr",
 "cost": "SS2",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Nimm eine Kreatur aus Deiner Unterwelt und lege sie direkt in die Welt.",
 "strength": "",
 "extra": "Offensichtlich hat es ihm doch nicht gefallen.",
 "rule_title": "Blockunfähig",
 "rule": "Falls eine Kreatur, die bereits als Blocker deklariert wurde durch einen Schnelleffekt blockunfähig gemacht wird (z.B. angekantet, verliert Flugfähigkeit), so fungiert sie immer noch als Blocker, allerdings erteilt sie keinen Kampfschaden mehr.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 88,
 "title": "Seelenheiler",
 "cost": "W",
 "color": "white",
 "type": "Kreatur",
 "body": "->: Verhindere bis zu 2 Schadenspunkte bei einer Kreatur.",
 "strength": "0/1",
 "extra": "Leib und Seele im Einklang, heilen je durch- und voneinander.",
 "rule_title": "Kartenaufbau",
 "rule": "Oben links auf der Karte ist der Zauberspruchname (kurz Name), oben rechts sind die Beschwörungskosten, darunter in der oberen Hälfte ist das Bild, darunter die Kartentypen, darunter der Wirktext und in „...“ darunter ist der Weisheitstext, der keine Wirkung auf die Incantatawelten hat. Bei Kreaturen ist unten rechts noch Stärke/Widerstandskraft zu finden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 89,
 "title": "Rückzugsort",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Erhalte einen Lebenspunkt, wenn Du in Deiner Versorgungsphase mindestens 4 Karten auf der Hand hast.",
 "strength": "",
 "extra": "",
 "rule_title": "Verschenken und Tauschen.",
 "rule": "Das Verschenken und Tauschen von Incantatakarten läßt den beteiligten Magiern die höchste Zauberkraft zufließen. Das Verkaufen ist auch erlaubt.",
 "pic": true,
 "token": "7BceyCx7AXXwArJwyQMVBigggxhm4dSnP1H65hALdzk=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 90,
 "title": "Dornenkrone",
 "cost": "WW1",
 "color": "white",
 "type": "Kreaturenverzauberung, Legende",
 "body": "Zusätzliche Beschwörungskosten= Zahle 2 Lebenpunkte. Die Kreatur erhält +4/+4.",
 "strength": "",
 "extra": "",
 "rule_title": "Krönung",
 "rule": "Karte 766 siehe auch Regel 90",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 91,
 "title": "Rose",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Wunder",
 "body": "->, _1_, Opfere die Rose: Füge ein weißes, grünes oder blaues Mana zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Symmetriebruch",
 "rule": "Der Incanta-Symmetriebruch beträgt mehr als 10E504 (zum Vergleich: Die Baryonenasymmetrie der Teichenphysik beträgt ca. 6,14E10).",
 "minting_cost": "5.1",
 "token": "EVh9T4xqPmyth2dwnflhp/gC6IjA8W5wAMp+xPQe3VM=",
 "date": 0
},

{
 "card_id": 92,
 "title": "Entscheidungsschlacht",
 "cost": "SW2",
 "color": "dark_white",
 "type": "Gewaltzauber",
 "body": "Gilt als schattenweiße Karte.<br>Zerstöre alle Länder.",
 "strength": "",
 "extra": "Ihr wußtet doch, daß es irgendwann passiert.",
 "rule_title": "Selbstantwort",
 "rule": "Du darfst auf einen Zauberspruch, den du selbst beschworen hast, antworten.",
 "pic": true,
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 93,
 "title": "Doppelblitz",
 "cost": "R1",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel zwei Schaden zu und einem anderen Ziel einen Schaden.",
 "strength": "",
 "extra": "Britzel - Bitzel",
 "rule_title": "Beschwörung",
 "rule": "Wenn ein Magier einen Zauberspruch spricht so nennt man dies Beschwörung. Die Beschwörungskosten müssen aufgewendet werden, als auch alle Phasen- und Geschwindigkeitsregeln beachtet werden. Falls dem so ist, erscheint der Zauberspruch in der Ideenwelt. Falls die Incantatakaskade abgeschlossen wird beginnt die Abwicklung (siehe Verwirklichung). Es gilt: „erfolgreich beschworen“ ist synonym zu „verwirklicht“.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 94,
 "title": "Verdropplung",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle 2 Kopien eines Spontan- oder Unterbrechungszaubers, den Du nicht kontrollierst; Dein Gegner erhält die Kontrolle über eine dieser Kopien.",
 "strength": "",
 "extra": "Ich warte nur noch auf die richtige Gelegenheit.",
 "rule_title": "Kopien von Zaubersprüchen",
 "rule": "Eine Kopie von einem Zauberspruch wird so behandelt, wie als ob dieser Zauberspruch neu beschworen wurde; so als wäre er auf Deiner Hand, ohne dessen Beschwörungskosten aufzuwenden. Die Geschwindigkeit des kopierten Zauberspruches ändert sich nicht und er wird an die entsprechende Zweigkaskade angefügt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 95,
 "title": "Apfel",
 "cost": "GG4",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Stimme mit Deinem Gegner ab, auf wieviel Lebenspunkte eure beider Seelen gesetzt werden; wenn ihr euch nicht einig werdet, so setzt sie auf 19.",
 "strength": "",
 "extra": "Take a bite of this apple.",
 "rule_title": "Lebenspunkte",
 "rule": "Jeder Magier beginnt die Incanatatabegegnung mit 21 Lebenspunkten. Auf einem Gipfelturnier gilt dies. Falls man nicht mit 21 Lebenspunkten beginnen will, so darf man vor Beginn einen Apfel beschwören.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 96,
 "title": "Ratte",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "Zusätzliche Beschwörungskosten= Zahle einen Lebenspunkt.<br>Leidet nicht unter Beschwörungstaumel.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Magierwille",
 "rule": "Wenn die Aktivierungskosten für einen Effekt 0 sind, so hängt die Aktivierung des Effektes ganz allein vom Willen des kontrollierenden Magiers ab.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 97,
 "title": "Materiespiegelung",
 "cost": "B3",
 "color": "blue",
 "type": "Kreatur",
 "body": "Kopiere eine Kreatur.",
 "strength": "?/?",
 "extra": "Zugegebenermassen eine Folge meines Neides.",
 "rule_title": "Verbergen",
 "rule": "Wenn Ein Effekt dazu auffordert, Karten in Deiner Bibliothek oder Hand zu zeigen, so kannst Du, falls es ein Geheimnis ist, die Ausführung des Effektes verweigern.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 98,
 "title": "Wikingerhorde",
 "cost": "RR3",
 "color": "red",
 "type": "Kreatur",
 "body": "Verursacht Durchbruchsschaden.",
 "strength": "5/4",
 "extra": "Sie waren wie von Sinnen, schwangen die Äxte und brüllten; wir konnten sie nicht aufhalten.",
 "rule_title": "Durchbruchsschaden",
 "rule": "Wenn eine Kreatur mit Durchbruchsschaden geblockt wird, entscheidet der Angreifer auf welche blockenden Kreaturen der Kampfschaden verteilt wird. Die Differenz zwischen dem erteilten Schaden, der angreifenden Kreatur und der Widerstandskraft der Blocker, wird als Durchbruchsschaden dem verteidigendem Magier zugefügt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 99,
 "title": "Hanf",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Füge ein schwarzes, rotes, blaues oder weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "Fixierung in der Ideenwelt",
 "rule": "Falls ein Zauberspruch erfolgreich in der Ideenwelt fixiert ist, kann er nicht mehr zurückgenommen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 100,
 "title": "Feuerwalze",
 "cost": "R4",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Vernichte alle Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 101,
 "title": "Reinigung",
 "cost": "W2",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle Artefakte. <br>_1_: Vernichte alle Artefakte, anstatt sie zu zerstören.",
 "strength": "",
 "extra": "",
 "rule_title": "Erschöpfung",
 "rule": "Eine Kreatur die wiederbelebt wird, verläßt die Welt nicht, wird aber angekantet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 102,
 "title": "Morgendämmerung",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle Verzauberungen.",
 "strength": "",
 "extra": "Ich erkenns nur wage, doch es ist ein Streif am Horizont.",
 "rule_title": "Vorsortierung",
 "rule": "Das Schichten (vorsortieren) der Bibliothek vor (und nach) der Begegnung ist nicht gestattet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 103,
 "title": "Höllensturz",
 "cost": "SSSSSS",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Zusäztliche Beschwörungskosten= Siebenfache Himmelsmacht.<br>Alle Magier müssen alle Karten ablegen und legen alle Himmelskörper auf ihre Ekliptik.<br>",
 "strength": "",
 "extra": "Der, der die Welt unter seine Knute zwingt, braucht sich um den Rest nicht zu scheren.",
 "rule_title": "Berührungen von Kreaturen",
 "rule": "Zwei Kreaturen kommen in Berührung beim Kreaturenkampf (eine der beiden greift an, die andere blockt).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 104,
 "title": "Gedankenfluß",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Alle Magier werfen soviele Karten ab, wie sie wünschen und ziehen ebenso viele neue.",
 "strength": "",
 "extra": "",
 "rule_title": "Kopien - Ideenwelt",
 "rule": "Wenn ein Zauberspruch oder Effekt es erlaubt Kopien von Zaubersprüchen zu erstellen, so ist dies auch möglich für Zaubersprüche die gekontert wurden, da jeder beschworenen Zauberspruch in der Ideenwelt erscheint.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 105,
 "title": "Göttlicher Segen",
 "cost": "WW3",
 "color": "white",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier erhalten 7 Lebenspunkte und dürfen 3 Karten ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "Gestaltwandler",
 "rule": "Gestaltwandler können vom beherrschenden Magier vor Beginn seiner Teilrunde (Zwischenphase), in eine Beliebige Kreatur in der Welt, oder aber auch in seine Urgestalt, verwandelt werden. Der Gestaltwandler behält stets die Fähigkeit des Gestaltwandelns.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 106,
 "title": "Fluch",
 "cost": "SS",
 "color": "black",
 "type": "Magierverzauberung",
 "body": "Jedes mal wenn der Magier einen Zauberspruch beschwört, müßt ihr beide einen Lebenspunkt zahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Glück",
 "rule": "Jede Incantatakarte ist ein Glückbringer.",
 "pic": true,
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 107,
 "title": "Erfrischung",
 "cost": "W",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Ein Magier erhält 2 Lebenspunkte. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Gute Gründe",
 "rule": "Zu den guten Gründen Mana zu erzeugen, sollte neben der Aufwendung für Beschwörungs- und Aktivierungskosten von Zaubersprüche und Effekten, unter anderem Folgendes zählen:<br>- Den Effekt der Tulpe/Rose/Narzisse zu benutzen, um eine Karte zu ziehen, falls man in Gefahr steht, diese Teilrunde, Märtyrer zu werden.<br>- Den Effekt der Magnolienblüte zu benutzen, um einen goldenen Avatar zu retten.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 108,
 "title": "Garde",
 "cost": "W1",
 "color": "white",
 "type": "Kreatur",
 "body": "->: Füge einer angreifenden Kreatur einen Schaden zu.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Erste Runde",
 "rule": "In der ersten Runde dürfen keine Schnellzauber beschworen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 109,
 "title": "Ansturm",
 "cost": "GG",
 "color": "green",
 "type": "Gewaltzauber, Wunder",
 "body": "Alle Deine Kreaturen erhalten temporär +1/+0 und verursachen Durchbruchsschaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Nullte Runde",
 "rule": "In der nullten Runde darf man sein Schicksal, welches man in der Hand hat, beschwören. Zudem darf man das Mantra der Reinheit welches vor einem liegt, aus dem Spiel entfernen, um dessen Effekt zu aktivieren. Sonst darf man keine weiteren Zaubersprüche oder Effekte anwenden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 110,
 "title": "Gerechtigkeit",
 "cost": "WW2",
 "color": "white",
 "type": "Gewaltzauber",
 "body": "Alle Magier vernichten soviele von ihren Kreaturen, so daß alle soviele haben wie der, der am wenigsten hat; allerdings muß je die letzte Kreatur nicht vernichtet werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Anwenden",
 "rule": "Wenn man einen Zauberspruch anwendet, so beschwört man ihn. Wenn man einen Effekt anwendet, so aktiviert man ihn.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 111,
 "title": "Astralvampirismus",
 "cost": "S1",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Zusätzliche Beschwörungskosten= X schwarze Mana.<br>Füge einem Ziel X Schaden zu; Du erhälts soviele Lebenspunkte, wie dem Ziel erfolgreich Schaden zugefügt wurden.",
 "strength": "",
 "extra": "",
 "rule_title": "Seele",
 "rule": "Der Lebenspunktespeicher eines Magier heißt auch Seele.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 112,
 "title": "Korrektur",
 "cost": "BB1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Alternative Beschwörungskosten= Nehme eine Deiner Kreaturen auf Deine Hand zurück und zahle 2 Lebenspunkte. Ein Magier Deiner Wahl nimmt einen Zauberspruch zurück.",
 "strength": "",
 "extra": "Den Heb' ich mir für später auf.",
 "rule_title": "Verteilung von Kopien",
 "rule": "Wenn ein Zauberspruch Kopien von einem Zauberspruch erstellt und diese an verschiedene Magier verteilt werden, so werden jene Zaubersprüche, beginnend beim Urzauberspruch, in Rundenreihenfolge beschworen. Sind mehr als eine Kopie an einen oder mehrere Magier verteilt worden, so wird pro Rundendurchgang nur je eine Zauberspruchkopie beschworen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 113,
 "title": "Gottesanbeterin",
 "cost": "GGG1",
 "color": "green",
 "type": "Kreatur",
 "body": "Kann fliegende Kreaturen blocken.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Eigenschaften",
 "rule": "Eigenschaften sind permanente Effekte, die weder bedingt noch aktivierbar sind.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 114,
 "title": "Abnormale Konstellation",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Alle Magier können in ihrer Erneuerungsphase je höchstens einen Himmelskörper zurückstellen, oder für jeden weiteren Himmelskörper je einen Lebenspunkt zahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Zeitrechnung",
 "rule": "Wir schreiben das Jahr 27791 des Menschen, und das Jahr 332791 des Kosmos.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 115,
 "title": "Untoter",
 "cost": "S1",
 "color": "black",
 "type": "Kreatur",
 "body": "_S_: Wiederbelebung.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Wiederbelebung",
 "rule": "Eine Kreatur, die tödlichen Schaden erlitten hat oder zerstört wurde, kann wiederbelebt werden, das heißt, das die Kreatur ihre volle Widerstandskraft zurückerhält. Falls sie erfolgreich wiederbelebt wurde, so hat sie die Welt auch nie verlassen. Bedenke, daß eine Wiederbelebung als Antwort in einer Kaskade nicht sinnvoll ist (bei der Verwirklichung als Antwort ist die Kreatur noch nicht ausgeschaltet). Man muß die Kaskade abklingen lassen und dann vor Ende der Phase wiederbeleben (in der Kampfphase sinnvollerweise vor der Schadensverrechung).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 116,
 "title": "Nordlicht",
 "cost": "W",
 "color": "white",
 "type": "Energiezauber, Legende",
 "body": "Füge drei weiße Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Restmana",
 "rule": "Mana welches ein Magier ausversehen erzeugt hat, welches er nicht verwenden kann, heißt Restmana.",
 "pic": true,
 "token": "UoSWAdfutSR8/2SxETN5rzHjJycAjmgJXlRRRTye9ms=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 117,
 "title": "Gehirnschmelze",
 "cost": "B2",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel 4 Schaden zu; Du erhältst 2 Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Alle sind zufrieden",
 "rule": "Vor der Begegnung entscheidet jeder, wie er/sie angesprochen werden will und verkündet dies. Im Incantata-Universum dürfen dann alle Magier diese Wahl benuzten, wenn von Magier/er/Gegner etc. die Rede ist. Beispiel: statt Magier/er/Gegner sage/denke: Hexe/Magierin/sie/Gegnerin. Übertrage diese Regel, wenn gewünscht, auch auf alle Karten (z.B. Lichtbringer -> Lichtbringerin)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 118,
 "title": "Narzisse",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _1_, Selbstvernichtung: Füge ein weißes, grünes, rotes oder schwarzes Mana zu Deinem Manavorrat hinzu; Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "Farbeigenschaft",
 "rule": "Die Farbe ist eine Eigenschaft einer Karte.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 119,
 "title": "Aufplatzen",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Eine Kreatur platzt auf und es entstehen X 1/1 Spinnen, wobei X die Beschwörungskosten der Kreatur waren.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 120,
 "title": "Verkarstung",
 "cost": "R2",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zerstöre ein Land.",
 "strength": "",
 "extra": "",
 "rule_title": "Zauberkarten",
 "rule": "Wenn ein Zauberspruch beschworen wird, so wird die betreffende Karte, vor allem anderem, in die Unterwelt abgelegt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 121,
 "title": "Kugelfisch",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "_B_ _B_: -0/+3",
 "strength": "1/1",
 "extra": "... FUMP ...",
 "rule_title": "Äonen",
 "rule": "Die Äonen haben folgende Tiere und Pflanzen als Symbole: 2.Tiger 3.Hanf 4.Gottesanbeterin 5.Schwan 6.Medusa 7.Schwalbe 8.Eiche 9.Delfin 10.Eule 11.Elefant 12.Bär 13. Pferd 1. Fisch.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 122,
 "title": "Dämon",
 "cost": "SS2",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Schutz vor Weiß.<br>Der Dämon fügt Dir in Deiner Versorgungsphase einen Schaden zu.",
 "strength": "5/5",
 "extra": "Ich besiege meinen inneren Dämon einfach in dem ich ihn auf dich hetze!",
 "rule_title": "Kampfphase III",
 "rule": "Kreaturen, die vor der Schadensverrechnung tödlichen Schaden erhalten haben (oder vernichtet/zerstört/entfernt), werden (wenn nicht wiederbelebt) ausgeschaltet und machen keinen Kampfschaden. Bedenke, daß sie trotzdem noch blocken (vrgl. 822). Bedenke weiterhin, daß Kreaturen erst am Ende der Phase sterben, also könnte eine ausgeschaltete Kreatur noch in den Schnellphasen vor Beginn der Schadensverrechnug und/oder vor Ende der Kampfphase wiederbelebt werden.<br><br>Eine Kreatur greift immer noch an, wenn: sie nach der Deklaration angekantet wird (z.B. Racheengel); wiederbelebt wird; zurückgestellt und wieder angekantet wird.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 123,
 "title": "Ablenkungsmaneuver",
 "cost": "R2",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Du bestimmst für jede blockende Kreatur neu, wen sie blocken soll.",
 "strength": "",
 "extra": "1... 2... 3... Du bist frei!",
 "rule_title": "Arten von Zaubern",
 "rule": "Ein Zauberspruch kann von folgender Art sein: Kreatur, Verzauberung, Artefakt, Gewaltzauber, Spontanzauber, Unterbrechungszauber, Energiezauber, Traumzauber, Gleichzeitigkeitszauber. Merke: Länder, Himmelskörper und Raumzeitgefüge sind keine Zauberprüche.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 124,
 "title": "Igel",
 "cost": "G",
 "color": "green",
 "type": "Kreatur",
 "body": "Kann nur blocken, falls keine weitere von Deinen Kreaturen dieselbe Kreatur mitblockt.",
 "strength": "1/3",
 "extra": "",
 "rule_title": "Runde",
 "rule": "Eine Runde bei Incantata ist die Abfolge der Teilrunden aller beteiligten Magier und wird auch Äon (Weltzeitalter) genannt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 125,
 "title": "Artefaktkopie",
 "cost": "BBB",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Wähle ein Artefakt und lege eine Kopie dieses Artefaktes (mit allen dessen Verzauberungen), als ein Ding temporär in die Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Schnellzauber",
 "rule": "Schnellzauber sind alle Zaubersprüche, die schneller sind als ein Gewaltzauber.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 126,
 "title": "Mentaler Sieg",
 "cost": "XB",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Kontert einen Zauberspruch mit den Beschwörungskosten von X.",
 "strength": "",
 "extra": "Ich weiß, daß Du weißt, daß ich weiß, was ich tun muß.",
 "rule_title": "Märtyrerquote",
 "rule": "Die Märtyrerquote ist der Prozentwert mit dem eine Magier/Bibliotheks-Einheit Begegnungen beendet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 127,
 "title": "Schwarze Witwe",
 "cost": "S2",
 "color": "black",
 "type": "Kreatur",
 "body": "Nach der Kampfphase entscheide, welche Kreaturen, die mit der schwarzen Witwe in Berührung gekommen sind, zerstört werden.",
 "strength": "1/3",
 "extra": "salon-issue-lesson-real-either-supply-until-struggle-fresh-powder-news-option ... vielleicht beim nächsten mal...",
 "rule_title": "Volljährig",
 "rule": "Incantata ist vor allem zum Schmunzeln, aber kann auch gruselig sein. Deswegen ist Incantata nur für Erwachsene geeignet (mündig/18+), und zwar sowohl in der Kryptowelt, als auch in der Wirklichkeit.",
 "pic": true,
 "token": "k6e/t/u2uhRv4Wau+OxYnarrLV60cQvESBt4aaDHA64=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 128,
 "title": "Hexenwäldchen",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Mondmacht, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>Venusmacht, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Magierberufung",
 "rule": "Incantatazauberei gilt als ehrliche und anerkannte Arbeit.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 129,
 "title": "Aufstand",
 "cost": "G2",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Alle Deine Kreaturen erhalten temporär +2/+0.",
 "strength": "",
 "extra": "Nun sieh, wie ein Meister solche Kräfte entfesselt.",
 "rule_title": "Nachwirkung",
 "rule": "Wenn ein Zauberspruch eine Nachwirkung hat, so wird der betreffende Effekt ausgelöst nachdem die Kaskade, in der der Zauberspruch erfolgreich verwirklicht wurde, vollständig abgewickelt wurde. Nachwirkungseffekte sind bedingte Effekte (nicht aktivierbar!)",
 "pic": true,
 "token": "aFBRiRHCjvZtsh4j/l3Rzv3ax0efHrkwXzg1H/mEZ3Q=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 130,
 "title": "Schutzzauber",
 "cost": "W3",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Alle Deine bleibenden Karten sind temporär unantastbar und unzerstörbar.",
 "strength": "",
 "extra": "Nichts Böses betritt diesen Kreis.",
 "rule_title": "Bleibende Karten",
 "rule": "Bleibende Karten (nicht Bleibekarten) sind alle Karten, die Du hast.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 131,
 "title": "Dunkle Magie",
 "cost": "SS2",
 "color": "light_white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Gilt als lichtweiße Karte. Kontert einen Zauberspruch. Ziehe eine Karte.",
 "strength": "",
 "extra": "Wer Böses will, macht manches gut.",
 "rule_title": "Legendär",
 "rule": "Eine Kreatur/Spontanzauber/usw. mit dem Typ „Legende“ wird auch als legendäre Kreatur/legendärer Spontanzauber/usw. bezeichnet.",
 "pic": true,
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 132,
 "title": "Metallmann",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "Dein Gegner darf einmal pro Runde in Deine Karten gucken.",
 "strength": "1/3",
 "extra": "Gut gemeint ist manchmal nicht gut genug.",
 "rule_title": "Regeln",
 "rule": "Alle Regeln sind nur für das Duell (Begegnung zweier Magier) ausgelegt. Wenn ihr eine Begegnung mit mehr als 2 Magiern habt, legt die Regeln entsprechend sinnvoll aus.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 133,
 "title": "Cherubino",
 "cost": "WW3",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "Fliegt. Greift nicht an. Kann nicht gekontert werden.",
 "strength": "5/6",
 "extra": "Und der Cherub steht vor Gott.",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 134,
 "title": "Changelog",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt",
 "body": "",
 "strength": "",
 "extra": "Wenn man eines ändert, so ändert sich doch alles.",
 "rule_title": "Eigengeschmiedet",
 "rule": "Wenn ein Magier mit Schicksal auf der Anfangshand beginnt, so darf er ein selbstgemachtes Schicksal verwenden, welches natürlich der offiziellen Version gleichen muß, sowohl inhaltlich, als auch die Größe betreffend.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 135,
 "title": "Flunder",
 "cost": "BB",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "->, _2_: Ziehe glücklicherweise eine nichtblaue Karte oder lege sie ab.",
 "strength": "1/1",
 "extra": "Wünsch Dir was!",
 "rule_title": "Offene Karten",
 "rule": "Im Duell darf jeder Magier stets seine Handkarten zeigen.",
 "pic": true,
 "token": "ZR0NVcZF1y/0g3wtvpO17/11wL4j01Pkf8be5SlahsI=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 136,
 "title": "Felsformation",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Marsmacht, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>Sonnenmacht, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Ende der Begegnung",
 "rule": "Der Magier der keine Lebenspunkte mehr hat und/oder keine Karte mehr von seiner Bibliothek mehr ziehen kann, wenn er aber muß, ist der Märtyrer der Begegnung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 137,
 "title": "Segelyacht",
 "cost": "W",
 "color": "white",
 "type": "Kreatur, Legende, unzerstörbar",
 "body": "Kann nicht das Ziel von Zaubersprüchen sein.<br>Überspringe Deine Angriffsphase.<br>Deklariere eine Angriffsphase: Opfere die Segelyacht.",
 "strength": "0/1",
 "extra": "Hochseetüchtig!",
 "rule_title": "Lichtgrau",
 "rule": "Zauberkarten, die kein Artefakt sind, und kein farbiges Mana in ihren Beschwörungskosten haben, sind lichtgraue Karten",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 138,
 "title": "Strand",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Sonnenmacht, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>Mondmacht, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Zufall",
 "rule": "Das Schichten (Vorsortieren) der Bibliothek vor und nach der Begegnung ist nicht gestattet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 139,
 "title": "Sjávareldfjall",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Saturnmacht, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>Marsmacht, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Unantastbar",
 "rule": "Unantastbar ist, über wen man keine Kontrolle erlangen kann, ohne das Einverständnis des beherrschenden Magiers",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 140,
 "title": "Mangroven",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "Venusmacht, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.<br>Saturnmacht, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Regel",
 "rule": "Wenn es kein Effekt oder Zauberspruch erlaubt, darf kein Magier seine Bibliothek mischen, oder hineinschauen. Wenn ein Effekt es einem Magier erlaubt in seine Bibliothek zu schauen, so muß er danach mischen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 141,
 "title": "Zusammenbruch",
 "cost": "R3",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zerstöre ein Artefakt; Der Beherrscher jenes Artefaktes erhält Schaden in Höhe der Beschwörungskosten jenes Artefaktes.",
 "strength": "",
 "extra": "",
 "rule_title": "Gezielt und ungezielt",
 "rule": "Es gibt Zaubersprüche die ungezielt sind: Artefakte, Kreaturen, ungezielte Verzauberungen, Zaubersprüche die auf alles einer Sorte zielen (z.b. Feuerwalze); und es gibt Zaubersprüche die auf etwas zielen: alle anderen (z.b. Unterbrechung, Funkenknall, Nordlicht, etc.).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 142,
 "title": "Schockwelle",
 "cost": "R",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Alle nichtfliegenden Kreaturen erhalten einen Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Bibliothekskeller",
 "rule": "Jeder Magier darf eine Bibliothekskeller haben. Jener besteht aus 13 Karten und der Magier darf zwischen den Begegnungen Karten zwischen der Bibliothek und dem Bibliothekskeller austauschen.(Turnierincantata)",
 "pic": true,
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 143,
 "title": "Todesengel",
 "cost": "SSS2",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Kann nicht blocken.<br>In Anwesenheit des Todesengels werden zerstörte Kreaturen vernichtet.",
 "strength": "5/5",
 "extra": "",
 "rule_title": "Platztausch",
 "rule": "Nachdem die Begegnung begonnen hat, darf man nicht einfach so Plätze tauschen; es braucht eine Karte oder Effekt, die/der das erlaubt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 144,
 "title": "Quartex",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Jupitermacht, ->: Füge 2 farblose Mana zu Deinem Manavorrat hinzu; Verwende jenes Mana nur für Artefakte.<br> 0: Speichere Restmana von Deinem Gegner im Quartex.<br>->: Füge alles gespeicherte Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "Quartex",
 "rule": "„Verwende jenes Mana nur für Artefakte“ heißt: Für Artefaktzauber und Artfefakteffektkosten.<br><br><i>Schon ein komisches Ding.</i>",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 145,
 "title": "Komet",
 "cost": "RR",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier ziehen eine Karte von ihrer Ekliptik.",
 "strength": "",
 "extra": "",
 "rule_title": "Räte",
 "rule": "Unter anderem sollten folgende Fragen von Räten beantwortet werden:<br>* Was ist ein guter Grund, um Mana generieren.<br>* Was ist das Gegenteil von welchen Zauberspruch. (Kreaturen haben kein Gegenteil)<br>* Wann soll ab- oder aufgerundet werden.<br>(vrgl. Regel 836,735,756)<br>* Welcher Sprachklon, je Sprache, ist der beste<br>* Welches Ziel hat welcher Zauberspruch",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 146,
 "title": "Hornissenschwarm",
 "cost": "GX",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Alle fliegenden Kreaturen erhalten X Schaden.",
 "strength": "",
 "extra": "",
 "rule_title": "Ein X",
 "rule": "Wenn ein X als Manakosten irgendwo auftauchen, so ist X eine Anzahl farbloses Mana, dessen Höhe vom Beschwörer des Zauberspruches oder Effektes bestimmt wird. Falls X nicht gewählt werden kann ist, so ist X=2.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 147,
 "title": "Totem",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "->, _2_: Kontert einen aktivierbaren Effekt einer Bleibekarte.",
 "strength": "",
 "extra": "",
 "rule_title": "Aktivierbare Effekte",
 "rule": "Aktivierbare Effekte sind Effekte, die die Aufwendung von Aktivierungskosten erfordern (Immer links von einem Doppelpunkt „:“). Auch Wiederbelebung und Verstärkung sind aktivierbare Effekte, dessen Ziel die Kreatur selber ist. Dagegen sind z.B. alternative Beschwörungskosten, Zusätzliche Beschwörungskosten und ähnliche keine aktivierbaren Effekte.",
 "pic": true,
 "token": "0ts8w3sJAylNtl3GYIljsNDxUKjC2I9ZZdV45A+9NxQ=",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 148,
 "title": "Irrgarten",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Seltenheit",
 "body": "Alle Magier erhalten je 2 Schaden für jede Karte, die sie von ihrer Bibliothek ziehen, welche nicht die erste ihrer Zugphase ist. Jeder Magier kann einen Lebenspunkt zahlen, um eine Karte nicht zu ziehen.",
 "strength": "",
 "extra": "",
 "rule_title": "Bedingte Effekte",
 "rule": "Bedingte Effekte von Bleibekarten sind Effekte, die nicht vom Beherrschenden Magier direkt aktiviert werden können, sondern durch etwas im Weltlauf ausgelöst werden. Auch Zaubersprüche können bedingte Effekte haben.",
 "minting_cost": "5.1",
 "date": 0
},

{
 "card_id": 149,
 "title": "Geist-Materie-Barriere",
 "cost": "B2",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kann nicht von Zaubersprüchen bezielt werden. Kontert einen Materiezauber.",
 "strength": "",
 "extra": "Unüberwindbar.",
 "rule_title": "Verwirklichung",
 "rule": "Wird eine Incantatakaskade abgewickelt, so werden die Zaubersprüche, die nicht gekontert sind und nicht aus der Ideenwelt entfernt sind, entsprechend den Regeln die Reihenfolge betreffend, dann <b>verwirklicht</b>. Das heißt sie enfalten ihre magische Wirkung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 150,
 "title": "Verödung",
 "cost": "S",
 "color": "black",
 "type": "Landverzauberung, Vielheit",
 "body": "Kraftaufwand: _S_.<br>Das Land kann kein Mana mehr verwandeln.",
 "strength": "",
 "extra": "Nun schauet das Ergebnis eurer eigenen Taten.",
 "rule_title": "Gezielte Verzauberungen",
 "rule": "Wenn der Typ einer Karte eine gezielte Verzauberung ist so wird der Kartentyp ein zusammengesetztes Wort, bestehend aus dem Wort Verzauberung und dem gültigen Ziel für diese Verzauberung. Zum Beispiel: Landverzauberung. Wenn im Anweisungsblock dann die Rede ist von „das Land“, ist selbsverständlich das verzauberte Land gemeint.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 151,
 "title": "Transzendente Meditation",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Ziehe eine Karte von Deiner Bibliothek und lege sie offen vor Dich; Beschwöre jene Karte als wäre sie in Deiner Hand. Wenn Du sie nicht bis zu Beginn Deiner nächsten Teilrunde beschworen hast, lege sie in Deine Unterwelt.",
 "strength": "",
 "extra": "",
 "rule_title": "Ursachen",
 "rule": "Die Ursachen sind von geistiger Substanz.",
 "pic": "true",
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 152,
 "title": "Windstoß",
 "cost": "G1",
 "color": "green",
 "type": "Spontanzauber",
 "body": "Vernichte eine fliegende Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Zugphase",
 "rule": "In der Zugphase zieht der Magier grundsätzlich eine Karte, außer ein Effekt oder Zauberspruch schreibt etwas anderes vor. In der Zugphase darf nicht gezauber werden, und keine Effekte angewendet werden. Wenn mehrere Karten gezogen werden sollen, so geschieht dies als eine Aktion. Wenn ein Magier angehalten wird in seiner Zugphase X Karten zu ziehen, so zieht er genau X Karten in seiner Zugphase.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 153,
 "title": "Verfaulen",
 "cost": "SS1",
 "color": "black",
 "type": "Kreaturenverzauberung",
 "body": "Lege ein -1/-1 Signum auf die Kreatur in der Versorgungsphase des Beherrschers. Wenn die Kreatur die Welt verläßt, wählt dessen Beherrscher ein neues Ziel für Verfaulen; falls keine valides Ziel in der Welt ist wird Verfaulen vernichtet.",
 "strength": "",
 "extra": "",
 "rule_title": "Taktische Aufstellung",
 "rule": "Jeder Magier ist verpflichtet alle seine Kreaturen in einer Reihe (von links nach rechts) in seine Welt zu legen, so daß stets erkenntlich ist, welche Kreatur neben welcher liegt und welche Kreatur ganz links und welche Kreatur ganz rechts ist. Diese Reihe sollte die Reihe sein, die dem Gegner am nächsten ist (die oberste). Die Reihe nennt man: taktische Aufstellung. Die taktische Aufstellung darf man in seiner Hauptphase, außerhalb der Kampfphase, mit Gewaltzaubergeschwindigkeit ändern.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 154,
 "title": "Luftelementar",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Fliegt. Leidet nicht unter Beschwörungstaumel. Nehme Luftelementar zurück auf Deine Hand am Ende Deiner Teilrunde.",
 "strength": "3/1",
 "extra": "",
 "rule_title": "Einmaligkeit",
 "rule": "Eine Einmaligkeit darf nur einmal pro Begegnung erfolgreich beschworen (verwirklicht) werden. Zudem ist eine Einmaligkeit nur einmal pro Bibliothek erlaubt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 155,
 "title": "Einschüchterung",
 "cost": "RR",
 "color": "red",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen Zauberspruch; Füge die Beschwörungskosten des gekonterten Zauberspruches zu Deinem Manavorrat hinzu; verbrauchst du jenes Mana nicht, erhälts du Schaden in Höhe der Restmanamenge.",
 "strength": "",
 "extra": "",
 "rule_title": "Gemischte Beschwörungskosten",
 "rule": "Die Farbe einer Karte ist, wenn nicht anders angegeben, durch die Farbe des Manas der Beschwörungskosten bestimmt. Falls die Beschwörungskosten aus verschiedenen Manasorten zusammengesetzt ist, so ist die Farbe der Karte bestimmt durch die erste Sorte Mana der Beschwörungskosten.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 156,
 "title": "Seepferdchen",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur, Wunder",
 "body": "->: Füge 2 blaue Mana zu Deinem Manavorrat hinzu; verwende jenes Mana nur für Schnellzauber.",
 "strength": "0/1",
 "extra": "Immerdar",
 "rule_title": "Letzte Chance",
 "rule": "Eine Bibliothek mit einem Bibliothekswert von <50:<50 ist eine Machtbibliothek, eine mit einem Bibliothekswert von >50:>50 ist eine Erlösungsbibliothek und eine mit einem Bibliothekswert von <50:>50 ist eine Magiebibliothek. Es gilt: Eine Magiebibliothek ist erstrebenswerter als eine Machtbibliothek; Eine Machtbibliothek ist erstrebenswerter als eine Erlösungsbibliothek.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 157,
 "title": "Opferlamm",
 "cost": "S2",
 "color": "black",
 "type": "Kreatur",
 "body": "->, Selbstvernichtung: Füge 3 schwarze Mana zu Deinem Manavorrat hinzu.",
 "strength": "2/2",
 "extra": "",
 "rule_title": "Effekte von Zaubersprüchen",
 "rule": "Oft haben Zaubersprüche nur einen Effekt. Es gibt aber auch Zaubersprüche die mehrere Effekte haben können. Sind die Effekte mit einem Punkt (.) getrennt, so werden jene Effekte nacheinander (vergl. Regel 642) verwirklicht, egal ob einer nicht verwirklicht wird. Sind die Effekte mit einem Semikolon (;) getrennt, so ist der Nachfolgende Effekt von der erfolgreichen Verwirklichung des voherigen Effektes abhängig (abhängige Effekt). Es gibt auch aktivierbare Effekte für Zaubersprüche (vergl. Karte 85) (vergl. Regel 757). Kann ein Zauberspruch nur einen Effekt von einem Zauberspruch kontern, es gibt aber noch mehr Effekte, so werden jene entsprechend abgewickelt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 158,
 "title": "Eiszeit",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Länder können nur noch ein Mana pro Runde verwandeln.",
 "strength": "",
 "extra": "",
 "rule_title": "Vertrauen",
 "rule": "Incantata wird vollendet durch die magische, wirkliche Begegnung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 159,
 "title": "Feenseele",
 "cost": "GG",
 "color": "green",
 "type": "Kreaturenverzauberung",
 "body": "Die Kreatur kann nun fliegen und muß von allen Kreaturen, die können, geblockt werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Kraftaufwand",
 "rule": "Die Beschwörungskosten eines Zauberspruches mit Kraftaufwand erhöhen sich um die angegebenen Kosten, jedes weitere mal, die der Zauberspruch beschworen wird.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 160,
 "title": "Meisterwerk",
 "cost": "RR2",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Erstelle eine Kopie eines Artefaktes.",
 "strength": "",
 "extra": "Die Gilde fordert nicht viel, es muß lediglich perfekt sein.",
 "rule_title": "Selbige",
 "rule": "Eine Bibliothek bleibt die selbe, wenn sie nicht verändert wird, oder wenn zwischen 2 Begegnungen nur höchstens eine Karte geändert wird.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 161,
 "title": "Sanftmut",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Eine Kreatur hat temporär die Stärke 0; Ziehe eine Karte.",
 "strength": "",
 "extra": "Jede Bestie kann von einem begabten Magier gezähmt werden.",
 "rule_title": "Erweiterung der Kaskade",
 "rule": "Durch Änderungen der Gedankenwelt (z.B. Kartenziehen) kann die Gesamtkaskade erweitert werden. Das heißt, die gezogenen Zauber können angefügt werden (Beschwörungsvormerkungen werden an die Energiekaskade angegehängt) bis keiner mehr zaubern will. Dann wird die Kaskadenerweiterung abgerechnet. In der Praxis sieht das ganz einfach aus: Magier A beschwört einen Blitz, Magier B beschwört Waldmeister und zieht eine Agression, die er beschwört - die Agression wird zuerst abgerechnet. Beachte, daß man nur Zaubersprüche anhängen kann, die nicht schneller sind als der Kartenziehzauber. Wenn man mit einem Spontanzauber einen Unterbrechungszauber zieht, kann man ihn nicht beschwören.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 162,
 "title": "Steinadler",
 "cost": "R2",
 "color": "red",
 "type": "Kreatur",
 "body": "Fliegt.<br>_R_: Temporär +0/+1",
 "strength": "2/2",
 "extra": "",
 "rule_title": "Kryptomagierstufe",
 "rule": "Die Kryptomagierstufe wird bestimmt durch: (842- niedrigste Kryptocard_id) + ((höchste Kryptocard_id der längsten, ununterbrochenen (derer die schon geprägt sind) Kryptokartenreihe von 1) -1)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 163,
 "title": "Zinnsoldat",
 "cost": "3",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "->, _1_: Füge einem Ziel einen Schaden zu.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Ausgeschaltet",
 "rule": "Wird in eine Kreatur innerhalb einer Kaskade zerstört, vernichtet oder tödlich beschädigt dann ist sie ausgeschaltet, das heißt, daß sie keinen Schaden macht und ihre Effekte nicht verwirklicht werden (ausgenommen Wiederbelebung). Zum Beispiel: Magier A will einen Schaden mit dem Zinnsoldaten machen, Magier B antwortet mit einem Blitz. Zuerst wird der Blitz verrechnet, der Zinnsoldat ist ausgeschaltet und Effekt wird nicht verwirklicht. Bedenke, daß ausgeschaltete Kreaturen erst am Ende der Phase entfernt werden und vorher wiederbelebt werden können. Bedenke, daß ausgeschaltetet Kreaturen zwar keinen Schaden machen, aber immer noch blocken. Dasselbe gilt für nichtkreaturen Bleibekarten.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 164,
 "title": "Oktopusmesserstecherei",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Zerstöre 2 blaue Kreaturen.",
 "strength": "",
 "extra": "Hauptsachen man ist weit genug entfernt.",
 "rule_title": "Wirkungsfestlegung",
 "rule": "Die Wirkung eines Zauberspruches wird durch den Zauberspruchnamen festgelegt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 165,
 "title": "Wirbelsturm",
 "cost": "B2",
 "color": "blue",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle fliegenden Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "Verwirrung I",
 "rule": "Die Beschwörungskosten des neuen Zauberspruches müssen vom Zielbeschwörer und auch vom Verwirrungsbeschwörer nicht erbracht werden. Alternative Beschwörungskosten können vom Zielbeschwörerer nicht genutzt werden. Optionale Beschwörungskosten (z.B. Reinigung, Ideenklau) können vom Zielbeschwörer nach belieben aktiviert werden. Zusätzliche Beschwörungskosten, und Erschwerniskosten, müssen vom Zielbeschwörer erbracht werden, falls das nicht möglich ist, kann Verwirrung nicht beschworen werden. Falls als Ziel ein Gegner genannt ist, so ist dann, falls der Verwirrungsbeschwörer ein Gegner ist, eben dieser gemeint (nur relevant im mehr als 2-Spieler-modus).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 166,
 "title": "Oger",
 "cost": "R5",
 "color": "red",
 "type": "Kreatur",
 "body": "Nachwirkung: Alle anderen Kreaturen erhalten 2 Schaden.",
 "strength": "5/5",
 "extra": "",
 "rule_title": "Verwirrung II",
 "rule": "Wenn ein Zauberpruch mehrere Effekte zur Auswahl hat (z.B Glückszauber, Talisman), so darf der Zielbeschwörer alle jene auswählen, die dem/den Ursprungsziel/-zielen entsprach. Bei Einschränkung des Zieles (z.B Kintsugi) muß das Ziel valide bleiben, sonst kann Verwirrung nicht beschworen werden. Falls ein X in den Beschwörungskosten auftritt so ist es 2 (ein X in alternativen Beschwörungskosten kann vom Zielbeschwörer frei gewählt werden). Falls eine allgemeine Zielkathegorie angegeben ist (z.B. Bleibekarte), so sind alle untergordneten Ziel erlaubt (in diesem Falle: Kreatur, Verzauberung, etc.).",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 167,
 "title": "El Capitan",
 "cost": "SS1",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Alle schwarzen Kreaturen erhalten +1/+1.",
 "strength": "1/1",
 "extra": "Schuft, Halunke, du Schwein!",
 "rule_title": "Verwirrung III",
 "rule": "Der Zieltyp der auszutauschenden Zaubersprüche muß passen (gezielt, ungezielt), wobei beim ungezielten egal ist, worum es sich handelt (z.B Feuerwalze und Reinigung sind austauschbar). Das Ziel eines Zauberspruches sollte aus dem Zusammenhang klarwerden. So ist das Ziel der Rücknahme eine Bleibekarte, das Ziel des Nebels ein Magier, das Ziel von Waldmeister eine Kreaturenkarte auf Deiner Hand, das Ziel von Blutiges Schlachtfest Dein Gegner, das Ziel des Apfels alle Magier, usw. Falls Zweifel bestehen gründe einen Rat der das Ziel für alle Zauberpsrüche festlegt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 168,
 "title": "Rebell",
 "cost": "WW1",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "_S_, Opfere eine weiße Kreatur: +4/+0 und Durchbruchsschaden; Wende diesen Effekt nur einmal pro Teilrunde an.",
 "strength": "0/4",
 "extra": "",
 "rule_title": "Vergessen, Erinnern",
 "rule": "Wenn die Effekte Vergessen und Erinnern eines Zauberspruches benutzt werden, so gilt dies nicht als Beschwörung des Zauberspruches.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 169,
 "title": "Feuerorakel",
 "cost": "RS",
 "color": "red",
 "type": "Verzauberung, Wunder",
 "body": "->, _1_: Zeige die Karte, die Du gerade gezogen hast; wenn es ein Land ist, kannst Du noch eine Karte ziehen.<br>->, _2_: Vernichte eine Deiner Verzauberungen: Du erhältst 2 Lebenspunkte.",
 "strength": "",
 "extra": "",
 "rule_title": "Manamangel",
 "rule": "Wird die Enegiekaskade so manipuliert, daß einem Magier Mana fehlt, so kann er innerhalb der Abwicklung der Kaskade entscheiden wo er dieses Mana sparen will. Bleibekarteneffekte werden durch Manamangel nicht verwirklicht, während Zaubersprüche zurück auf die Hand genommen werden. Jene Zauber und Effekte werden dann auch aus der Ideenwelt entfernt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 170,
 "title": "Haus",
 "cost": "1",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Du darfst stets mehr als 7 Karten auf Deiner Hand haben.<br>->: Lege eine Karte von Deiner Hand unter Deine Bibliothek.",
 "strength": "",
 "extra": "Das Studium der Zauberliteratur erfordert nicht nur Ruhe, sondern auch eine gewisse Gemütlichkeit.",
 "rule_title": "Kartenablegen",
 "rule": "Am Ende der Ablegephase muß der Aktive Spieler alle bis auf 7 Karten abgelegt haben.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 171,
 "title": "Schlammlawine",
 "cost": "GGG",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Zerstöre alle nichtfliegenden Kreaturen.",
 "strength": "",
 "extra": "",
 "rule_title": "Nicht vergessen",
 "rule": "Incantata wird erfolgreicher miteinander, als gegeneinander gespielt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 172,
 "title": "Killerbiene",
 "cost": "GG",
 "color": "green",
 "type": "Kreatur",
 "body": "Fliegt.<br>Leidet nicht unter Beschwörungstaumel.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Reinigung",
 "rule": "Ein Magier kann stets farbiges Mana träumend in farbloses Mana verwandeln.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 173,
 "title": "Axolotl",
 "cost": "WWW",
 "color": "white",
 "type": "Kreatur, Legende",
 "body": "_W_: Reduziere den Schaden aus einer Quelle auf Dich auf 1.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "Reduzierung von Schaden",
 "rule": "Die Reduzierung von Schaden gilt als Verhinderung von Schaden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 174,
 "title": "Regenbogen",
 "cost": "B1",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Ändere ein Farbwort eines Zauberspruches. Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 175,
 "title": "Wolkenpferde",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Alle fliegenden Kreaturen erhalten +1/+1.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Geschenke",
 "rule": "Eine Zauberspruch mit der Eigenschaft Geschenk, kann auch für einen gegnerischen oder befreundeten Magier beschworen werden (in seine jeweilige Welt), wenn jener es wünschet. ",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 176,
 "title": "Skorpionträne",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Wenn Du die Skorpionträne ziehst erhälts Du 2 Schaden; Falls Du es verheimlichts, aber es kommt heraus, erhälts du 7 Schaden.->: Mische Deine Unterwelt samt Skorpionträne in Deine Bibliothek.",
 "strength": "",
 "extra": "",
 "rule_title": "Gefängnis",
 "rule": "Jene, die ein Gefängnis bauen, kommen, wenn der Tag gekommen, in eben jenes.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 177,
 "title": "Maulwurfsmaschine",
 "cost": "5",
 "color": "artifact",
 "type": "Artefakt, Kreatur",
 "body": "Kann nicht von fliegenden Kreaturen geblockt werden.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Ziele",
 "rule": "Sowohl Zaubersprüche als auch aktivierbare Effekte können ein oder mehrere Ziele haben. Falls von einem Ziel die Rede ist, so handelt es sich um einen Magier, eine Bleibekarte, eine der Welten (Bibliothek,Hand etc.), eine der Karten/Zaubersprüche in einer der Welten oder einen Manavorrat. Die Ziele, die angegeben sind im Zusammenhang mit zusätzlichen/alternativen Beschwörungskosten, Nachwirkung, aktivierbare Effekte, etc. sind nicht die Ziele des Zauberspruches selbst.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 178,
 "title": "Kaiserkrone",
 "cost": "3",
 "color": "artifact",
 "type": "Artefakt, Einzigartigkeit",
 "body": "->, _5_: Dein Gegner gibt Dir eine Karte aus seiner Hand, aber recht höflich; Aktiviere diesen Effekt wie einen Gewaltzauber.",
 "strength": "",
 "extra": "Herrscher von Gottes Gnaden.",
 "rule_title": "Einzigartig",
 "rule": "Eine Einzigartigkeit kann nur einmal in der Welt sein. Wenn eine Einzigartigkeit in der Welt ist, so kann kein Effekt oder Zauberspruch angwendet werden, um eine weitere Einzigartigkeit dieser Art in die Welt zu bringen. Zudem ist eine Einzigartigkeit nur einmal pro Bibliothek erlaubt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 179,
 "title": "Lügenprophet",
 "cost": "S",
 "color": "black",
 "type": "Kreatur",
 "body": "_1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "Das Himmelslicht ward euch gegeben, und ihr verderbt es!.",
 "rule_title": "Licht und Schatten",
 "rule": "Alle Zaubersprüche und Effekte, die weiße Karten/Zaubersprüche betreffen, betreffen auch Schattenweiße. Alle Zaubersprüche die schwarze Karten/Zaubersprüche betreffen, betreffen auch lichtschwarze.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 180,
 "title": "Lotos",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _4_, Lege eine Karte ab, Übergebe die Kontrolle über den Lotos an Deinen Gegner: Beschwöre den letzten Zauberspruch Deines Gegners, welcher verwirklicht wurde, als der Lotos schon in Deiner Welt war.",
 "strength": "",
 "extra": "",
 "rule_title": "Incantata",
 "rule": "Im tiefsten Sumpf aber erblüht die Lotosblüte.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 181,
 "title": "Hund",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur, Wunder",
 "body": "Du kannst den Hund auch als Spontanzauber beschwören.",
 "strength": "0/4",
 "extra": "Stets bereit Dich zu schützen.",
 "rule_title": "Proaktiv",
 "rule": "Im Gegensatz zum Effekt der Wiederbelebung, die nicht als Antwort beschworen werden kann, weil die Wiederbelebung ein der Wiederbelebung benötigendes Ziel braucht, gibt es Zauber und Effekte die proaktiv sind, das heißt, daß man sie auf valide Ziele beschwören darf, die den Effekt nicht benötigen. Insbesondere können Zauber die Schaden verhindern auf noch nicht beschädigte Kreaturen zielen, die im Verlauf der Abwicklung der Kaskade dann Schaden erhalten, der dann verhindert wird. Der Effekt jener Zauber wird also vorgemerkt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 182,
 "title": "Nacktschnecke",
 "cost": "S3",
 "color": "black",
 "type": "Kreatur",
 "body": "->: Lege eine Kopie dieser Nacktschnecke in die Welt.<br>Dein Gegner darf soviele Nacktschnecken mit einer Kreatur blocken, wie er will.",
 "strength": "1/1",
 "extra": "Da ist ja noch eine!",
 "rule_title": "Selbstbezielung",
 "rule": "Zaubersprüche können sich nicht selbstbezielen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 183,
 "title": "Drachenschlachtung",
 "cost": "RR2",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Vernichte eine Kreatur: Du und Dein Gegner erhaltet je soviel farbloses Mana, wie die Beschörungskosten der Kreatur betragen haben; Wenn Dein Gegner seinen Anteil nicht zu seinem Manavorrat hinzufügen will, verfällt es.",
 "strength": "",
 "extra": "",
 "rule_title": "Ankündigung",
 "rule": "Nachdem du das Mantra der Reinheit enfernt hast, kann jeder Magier in seiner Hauptphase ankündigen, daß sein Gegener Märtyrer wird. Tue dies vorzugsweise mit den Worten: „お前はもう死んでいる (Omae wa mou shindeiru)“. Dadurch wird der Ankündigende der Verteidiger und sein Gegner wird der Angreifer. Der Verteidiger nennt die Anzahl an Runden (beginnend bei 0), die es dauern wird, bis der Angreifer Märtyrer wird. Ankündigen kann man nur in seiner Hauptphase. Der Angreifer erkennt seine Rolle an indem er (zeitlich-geistig vorversetzt) verkündet „Ich bin unüberwindbar!“.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 184,
 "title": "Durchsetzungskraft",
 "cost": "G",
 "color": "green",
 "type": "Unterbrechungszauber",
 "body": "Alternative Beschwörungskosten= Lege eine Karte ab, welche die Farbe _______ hat, Zahle einen Lebenspunkt.<br>Mache einen Zauberspruch unkonterbar.",
 "strength": "",
 "extra": "",
 "rule_title": "Verteidigungskunst",
 "rule": "Incantata ist höchste Verteidigungskunst.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 185,
 "title": "Titan",
 "cost": "BB4",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Zusätzliche Beschwörungskosten= Wähle eine fliegende Kreatur; der Besitzer muß jene Kreatur auf seine Hand nehmen.<br>Fliegt.",
 "strength": "5/6",
 "extra": "",
 "rule_title": "Gleichzeitigkeit",
 "rule": "Von kosmischer Gleichzeitigkeit können wir sprechen, wenn die Erkenntnis über etwas, im gesamten Kosmos zur selben Zeit erkannt werden kann.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 186,
 "title": "Erinnerungsmanipulation",
 "cost": "S3",
 "color": "black",
 "type": "Gewaltzauber",
 "body": "Nimm einen Zauberspruch aus Deiner letzten Teilrunde zurück.",
 "strength": "",
 "extra": "Wie soll man mich nun noch der Lüge überführen?",
 "rule_title": "Rücknahme von Zaubersprüchen.",
 "rule": "Wenn ein Zauberspruch zurückgenommen wird, so wird er wieder auf die Hand genommen und der Zauberspruch wird auch aus der Ideenwelt entfernt - Beschwörungskosten werden allerdings nicht zurückgenommen. Wenn nicht ausdrücklich ein Punkt im Weltenlauf genannt wird (z.B. „letzte Runde“), so kann nur ein Zauberspruch in der noch aktiven Incantatakaskade zurückgenommen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 187,
 "title": "Herausforderung",
 "cost": "R2",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Beschwöre die Herausforderung vor der Angriffsphase. Der aktive Magier greift mit allen Kreaturen, die können, an.",
 "strength": "",
 "extra": "",
 "rule_title": "Aktiv, Passiv",
 "rule": "Der Magier dessen Teilrunde gerade stattfindet ist der aktive Magier, alle anderen sind passive Magier.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 188,
 "title": "Glückszauber",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber, Legende",
 "body": "Wähle einen der folgenden Effekte * Verhindere bis zu 3 Schaden aus einer Quelle. * Erhalte einen Lebenspunkt je Quelle, die Dir diese Teilrunde Schaden zugefügt hat. * Kontert einen Zauberspruch oder aktivierbaren Effekt, wenn dessen Beherrscher nicht _1_ zahlt.",
 "strength": "",
 "extra": "",
 "rule_title": "Kreaturentod",
 "rule": "Stets am Ende jeder Phase sterben alle Kreaturen, die 0 oder weniger Widerstandskraft haben. Da vor dem Ende jeder Phase eine mögliche Schnelleffektphase ist, ist es sinnvoll Schadensverhinderungs- und Wiederbelebungseffekte an jener Stelle zu nutzen. Dies ist insbesondere in der Kampfphase wichtig, denn bedenke, daß nach der Kampfschadenverrechnung (vor dem Ende der Kampfphase), noch eine Schnelleffektphase möglich ist.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 189,
 "title": "Eiserne Jungfrau",
 "cost": "R",
 "color": "red",
 "type": "Magierverzauberung",
 "body": "Der Magier erhält einen Schaden, falls er in seiner Versorgungsphase 4 oder mehr Karten auf der Hand hat.",
 "strength": "",
 "extra": "Aber schön langsam.",
 "rule_title": "Das Antwortparadoxon",
 "rule": "Oft ist es nicht sinnvoll einen Zauberspruch als Antwort zu beschwören, weil er dann zuerst verrechnet werden würde. In solchen Fällen muß man die Abwicklung der Kaskade abwarten und eine neue beginnen. Beispiel: Windstoß als Antwort auf ein Loslassen zu beschwören ist nicht möglich, da die Kreatur noch nicht fliegt => man läßt die Verwirklichung des Loslassen zu und eröffnet eine neue Kaskade mit dem Windstoß.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 190,
 "title": "Kakadu",
 "cost": "G2",
 "color": "green",
 "type": "Kreatur",
 "body": "Fliegt.<br>_G_: Wiederbelebung.<br>->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "1/1",
 "extra": "Lora ist da! Lora ist da!",
 "rule_title": "Hinweise",
 "rule": "Wenn eine Kreatur erfolgreich beschworen ist und somit verwirklicht, hat sie keinen weltlichen Hinweis auf die Existenz von Magiern.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 191,
 "title": "Heitere Gelassenheit",
 "cost": "WW",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Du und Deine Kreaturen können in der nächsten Teilrunde nicht das Ziel von Zaubersprüchen sein; Ziehe eine Karte.",
 "strength": "",
 "extra": "Wenn du jemand verwirren willst, versuche ihm etwas zu schenken.",
 "rule_title": "Zu nichte",
 "rule": "Am Ende der Begegnung werden alle Bleibekarten (außer Länder, Raumzeitgefüge und Himmelskörper) zunichte gemacht. Das heißt, daß sie man sie so behandelt, als ob sie nie da gewesen wären (in der „Spielwelt“ d.h. die „Spielwelt“ wird vollendet/abgeschlossen). Länder, Raumzeitgefüge und Himmelkörper sind transzendent (genau so wie die Ideenwelt), das heißt, das sie schon immer da waren. Länder, Raumzeitgefüge und Himmelskörper erscheinen also in der Welt, als Bild ihrer natürlichen Entwicklung.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 192,
 "title": "Klosterbibliothek",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Wenn Du keine Karte auf Deiner Hand hast, darfst Du eine Karte ziehen.",
 "strength": "",
 "extra": "So manch geheime Schrift ist hier verborgen.",
 "rule_title": "Opfer",
 "rule": "Falls ein Zauberspruch ungezielt ist, so nennt man alle Kreaturen/Magier/Karten/etc. , die von jenem Zauberspruch betroffen sind, Opfer.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 193,
 "title": "Geträumtes Einhorn",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur, Vielheit",
 "body": "Wenn mehr als ein geträumtes Einhorn in der Welt ist, sind alle geträumten Einhörner grüne 2/3 Kreaturen.",
 "strength": "0/3",
 "extra": "Millionen...",
 "rule_title": "Erscheinen",
 "rule": "Einhörner erscheinen genau zur richtigen Zeit.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 194,
 "title": "Dunkle Aura",
 "cost": "S1",
 "color": "black",
 "type": "Kreaturenentzauberung",
 "body": "Kann wie ein Spontanzauber beschworen werden. Verzauberungen haben keine Wirkung auf die Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "Entzauberungen",
 "rule": "Für Entzauberungen gelten dieselben Regeln, wie für Verzauberungen, jedoch wirken Zaubersprüche, die sich auf Verzauberungen beziehen, nicht auf Entzauberungen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 195,
 "title": "Spiegelschild",
 "cost": "0",
 "color": "light_grey",
 "type": "Energiezauber, Legende",
 "body": "Zusätzliche Beschwörungskosten: Zahle einen Lebenspunkt.<br>Wähle ein neues Ziel für einen aktivierbaren Effekt.",
 "strength": "",
 "extra": "",
 "rule_title": "Energiekaskade I",
 "rule": "Beim Beschwören von Zaubersprüchen und Aktivierung von Effekten werden alle nötigen Beschwörungskosten (Ankanten, Opfern, etc.) nachvollziehbar erläutert und werden vorgemerkt an die Energiekaskade angehängt. Zaubersprüche mit Energiegeschwindigkeit können diese Vormerkungen manipulieren (z.B. nullifizieren). Man kann auf Manipulation vorgemerkter Beschwörungskosten stets antworten (noch ein Mana hinzufügen, eine andere Kreatur opfern), aber nur vor Abwicklung der Energiekaskade.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 196,
 "title": "Honigdachs",
 "cost": "GGG1",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Der Honigdachs greift immer an.<br>Verursacht Durchbruchsschaden.",
 "strength": "4/4",
 "extra": "Das schert den Honigdachs doch nicht.",
 "rule_title": "Energiekaskade II",
 "rule": "Wenn die Gesamtkaskade abgeschlossen ist und die Abwicklung der Energiekaskade beginnt, werden alle Effekte und Zaubersprüche, die Energiegeschwindigkeit haben, verwirklich (vor allem Manaeffekte)(letzter zuerst), alle anderen Vormerkungen werden noch nicht verrechnet - der Manapool füllt sich. Die Energiekaskade wird ganz abgewickelt und erst dann wird geprüft ob genug Mana (oder andere Beschwörungskosten) für alle Energieeffekte vorhanden ist (vergleiche Regel 645). Danach werden die langsameren Kaskaden abgewickelt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 197,
 "title": "Kampffortpflanzung",
 "cost": "GG",
 "color": "green",
 "type": "Verzauberung",
 "body": "Jeder Magier darf eine Kopie einer Kreatur in seine Welt legen; Vernichte jene Kreaturen, wenn die Kampffortpflanzung die Welt verlässt.",
 "strength": "",
 "extra": "",
 "rule_title": "Energiekaskade III",
 "rule": "Bedenke, daß die <u>Verrechnung</u> der Beschwörungskosten gleichzeitig mit dem (langsameren) Effekt bei verwirklichung gleichzeitig geschieht. Zum Beispiel: Falls ein Seelenheiler durch eine Energiesenke vorher angekantet wurde, und nun der Effekt des Seelenheilers drankommt, so kann das vorgemerkte Ankanten des Seelenheilers nicht mehr durchgeführt werden, und sein Effekt findet nicht statt. Genauso können Manipulationen der Energiekaskade vorgemerkte Beschwörungskosten entfernen (z.B. Mana) und der Effekt/Zauberspruch kann zur Zeit seiner Verwirklichung nicht geschehen. Im Falle von mangeldem Mana kann der Beschwörer selbst entscheiden, welches Mana er wo spart. Im Falle von anderen (Ankanten, Opfern) geht das nicht.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 198,
 "title": "Irrer Wissenschaftler",
 "cost": "RRR",
 "color": "red",
 "type": "Kreatur",
 "body": "Alle Artefaktkreaturen erhalten +1/+1.",
 "strength": "1/2",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 199,
 "title": "Zauberassistentin",
 "cost": "B2",
 "color": "blue",
 "type": "Kreatur",
 "body": "->: Tausche unterbrechend die Reihenfolge zweier Zaubersprüche aus.",
 "strength": "1/2",
 "extra": "Upsi!",
 "rule_title": "Nur eine Empfehlung",
 "rule": "Beschwöre die Zauberassistentin möglichst mit Blumenmana.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 200,
 "title": "Eröffnung",
 "cost": "R3",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Alle Magier vernichten nacheinander ein Drittel ihrer Länder, Kreaturen, Artefakte und Verzauberungen.",
 "strength": "",
 "extra": "Es wäre nun besser zu verstehen.",
 "rule_title": "Nacheinander",
 "rule": "Falls ein Zauberspruch mehrere Effekte nacheinander auslöst (oder mehrere Effekte mit . getrennt oder abhängige Effekte mit ; getrennt hat), so werden jene wie einzelne Zaubersprüche behandelt und entsprechend an die Kaskade angefügt - und zwar der letzte zuerst. Alle Effekte des Zauberspruches werden gleichzeitig an die Kaskade angefügt. Das heißt auch, daß der beschwörende Magier sich für alle Effekte, die eine Entscheidung oder Aktivierungskosten erforden, bei der Beschwörung festlegen muß. Die Erfüllungsbedingungen von abhängigen Effekten werden bei der Abwicklung der Kaskade überprüft. Der Gesamtzauberspruch ist als Klammer um die Menge der Effekte zu denken und wird, falls gekontert, insgesamt gekontert.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 201,
 "title": "Zeitecho",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle eine Kopie eines Zauberspruches Deines Gegners aus der letzten Teilrunde und übergebe die Kontrolle an Deinen Gegner.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 202,
 "title": "Verwilderung",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber",
 "body": "Verwandle ein Land in einen Wald.",
 "strength": "",
 "extra": "Die Natur nimmt sich alles zurück.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 203,
 "title": "Kintsugi",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Repariere eine Bleibekarte, die keine Kreatur ist.",
 "strength": "",
 "extra": "Jetzt ist es perfekt.",
 "rule_title": "Reparieren",
 "rule": "Reparieren ist ähnlich zu Wiederbeleben für Kreaturen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 204,
 "title": "Höllenbote",
 "cost": "SSS",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Fliegt. <br>Wenn der Höllenbote einen Magier Schaden zugefügt hat, legt jener eine Karte von seiner Hand ab.",
 "strength": "2/2",
 "extra": "Es gibt Sachen, die vergisst man besser.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 205,
 "title": "Feldverhandlungen",
 "cost": "W1",
 "color": "white",
 "type": "Verzauberung",
 "body": "Vor Beginn jeder Teilrunde stimme mit Deinem Gegner ab, wieviele Zaubersprüche höchstens von jedem Magier nächste Teilrunde beschworen werden können; Falls ihr euch nicht einig werdet, so dürfen höchsten 2 Zaubersprüche je Magier beschworen werden.",
 "strength": "",
 "extra": "",
 "rule_title": "Denkpause",
 "rule": "Das „-“ wird als Gedankenstrich verwendet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 206,
 "title": "A-Nerin-Daág",
 "cost": "W1",
 "color": "white",
 "type": "Unterbrechungszauber, Wunder",
 "body": "Kontert einen Zauberspruch, der Schadenspotential hat.",
 "strength": "",
 "extra": "Ein Zauber aus längst vergangenen Zeiten.",
 "rule_title": "Schadenspotential",
 "rule": "Eine Kreaturzauber, der eine Kreatur hervorbringen würde, die die 0 Stärke hat oder nicht angreifen kann, hat kein Schadenspotenial. Kreaturenzauber verstärkbarer Kreaturen haben Schadenspotential",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 207,
 "title": "Wahrer Krieger",
 "cost": "2SSWW",
 "color": "light_black",
 "type": "Kreatur, Legende",
 "body": "Gilt als lichtschwarze Karte. Entferne alle Kreaturen, die gegen den wahren Krieger gekämpft haben und tödlichen Schaden erhalten haben, nach dem Kampf aus der Welt.<br>_2__S__S__W__W_: Erinnern.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "Glückkartenwurf",
 "rule": "Falls eine Karte einen Glückskartenwurf anfordert, so werden die Regeln für Glückskartenwurf (Handhaltung, Höhe, ausgewogene Kunstoffkarte etc.) so gewählt, daß stets die beste Incantatakartenzufallswurfmaschine unter diesen Regeln keinen statistisch signifikanten Vorteil erwerfen kann.",
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 208,
 "title": "Magnolienblüte",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, Opfere die Magnolienblüte, Kante einen goldenen Avatar an: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>->, Opfere die Magnolienblüte, Opfere ein Land: Füge Dir 3 Lebenspunkte hinzu.",
 "strength": "",
 "extra": "Nicht jeder ist ihrer würdig.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 209,
 "title": "Amnesie",
 "cost": "SS",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Ein Magier wählt 2 Handkarten und legt jene ab.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 210,
 "title": "Schmerz",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Füge einem Ziel einen Schaden zu. _4_: Erinnern",
 "strength": "",
 "extra": "Beizeiten ist es lehrreich sich den Schmerz zumindest in Erinnerung zu rufen.",
 "rule_title": "Erinnern",
 "rule": "Ein Zauberspruch mit Erinnern kann, wenn er zumindest einmal verwirklicht wurde, aus der Unterwelt zurück auf die Hand genommen werden. Die Geschwindigkeit dafür ist Spontanzaubergeschwindigkeit.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 211,
 "title": "Kleeblatt",
 "cost": "0",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Gilt als weiße Karte. Dein Gegner wählt eine Karte aus Deiner Bibliothek. Nimm jene Karte in die Hand.",
 "strength": "",
 "extra": "Tugenden sind Belohungen, Belohungen sind Tugenden.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 212,
 "title": "Flugunfähiger Spatz",
 "cost": "G",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "Glückskartenwurf: Zu Deinen Gunsten => Temporär +1/+1 und Flugfähigkeit, Entgegen Deinen Gunsten => Wird zu einer 0/1 Kreatur ohne Flugfähigkeit und Du kannst diesen Effekt diese Runde nicht mehr aktivieren.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 213,
 "title": "Nachtsonnenblume",
 "cost": "S",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "->, _1_: Speichere ein Mondmana in der Nachtsonnenblume. ->: Füge beliebig viele zuvor gespeicherte Mana, als weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "0/1",
 "extra": "Ihre Schönheit wird erst durch die Nacht ganz sichtbar.",
 "rule_title": "Himmelsmana",
 "rule": "Die verschiedenen Himmelskörper spenden ja zumeist farbloses Mana, aber die Herkunft kann trotzdem wichtig sein. Zum Beispiel spendet der Mond „Mondmana“.",
 "pic": true,
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 214,
 "title": "Zeitmanipulation",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Setze die nächste Teilrunde aus: Habe nach Deiner nächsten Teilrunde eine weitere Teilrunde.",
 "strength": "",
 "extra": "Es sieht zunächst wie ein Zurückweichen aus...",
 "rule_title": "Heilung",
 "rule": "Nach einer Teilrunde werden bei allen Kreaturen die Stärke und Widerstandskraft wiederhergestellt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 215,
 "title": "Blutiges Schlachtfest",
 "cost": "SS3",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Zusätzliche Beschwörungskosten: Opfere eine Kreatur.<br>Dein Gegner opfert 2 Kreaturen.<br>Nachwirkung: Stelle 2 Himmelskörper zurück.",
 "strength": "",
 "extra": "Zuerst scheut man sich...",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 216,
 "title": "Waldmeister",
 "cost": "G2",
 "color": "green",
 "type": "Spontanzauber, Legende",
 "body": "Mische eine Kreatur von Deiner Hand in Deine Bibliothek; Ziehe 3 Karten.",
 "strength": "",
 "extra": "Ein besonderes Gewächs.",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 217,
 "title": "Duplikat",
 "cost": "B2",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kopiere einen Zauberspruch, den Du diese Teilrunde bereits beschworen hast, wobei Du dessen Beschwörungskosten bezahlen mußt.",
 "strength": "",
 "extra": "(δ)",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 218,
 "title": "Bluthimmelvollmond",
 "cost": "SS1",
 "color": "black",
 "type": "Verzauberung, Legende",
 "body": "Jeder Magier zahlt vor Beginn seiner Teilrunde einen Lebenspunkt für jeden seiner Himmelskörper, welcher nicht angekantet ist; dieser Effekt wird erst vor Beginn Deiner nächsten Teilrunde wirksam.",
 "strength": "",
 "extra": "",
 "rule_title": "Vertrauen",
 "rule": "Großmagier sind vollkommen vertrauenswürdig.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 219,
 "title": "Teuflischer Vertrag",
 "cost": "S",
 "color": "black",
 "type": "Gewaltzauber, Legende",
 "body": "Nimm eine Karte aus Deiner Bibliothek in Deine Hand. Nimm zufällig und verdeckt eine Karte aus Deiner Bibliothek und mische sie in die Bibliothek Deines Gegners; er darf die Beschwörungskosten dieser Karte mit farblosem Mana bezahlen.",
 "strength": "",
 "extra": "",
 "rule_title": "Retten",
 "rule": "Seinen Gegner zu retten heißt:- Seine Lebenspunkte werden auf 1 gesetzt werden, falls er 0 oder weniger hat<br>- Er muß keine Karte ziehen, falls er keine Karten mehr in seiner Bibliothek hat.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 220,
 "title": "Donnerschlag",
 "cost": "RR",
 "color": "red",
 "type": "Gewaltzauber, Wunder",
 "body": "Alle Kreaturen erhalten 2 Schaden.",
 "strength": "",
 "extra": "Wenn man den Donner hört, ist es schon längst zu spät.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 221,
 "title": "Ariadnefaden",
 "cost": "B2",
 "color": "blue",
 "type": "Verzauberung, Legende",
 "body": "->, _1_: Schaue Dir die obersten 3 Karten in Deiner Bibliothek an und lege sie offen oder verdeckt in beliebiger Reihenfolge zurück.<br>->: Mische gewaltig eine Karte von Deiner Hand in Deine Bibliothek.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 222,
 "title": "Bogenschütze",
 "cost": "GG",
 "color": "green",
 "type": "Kreatur",
 "body": "->: Füge einer angreifenden, fliegenden Kreatur 2 Schaden zu.",
 "strength": "1/2",
 "extra": "Mit den Augen des Adlers, mit der Seele des wahren Kriegers.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 223,
 "title": "Befreiung",
 "cost": "W",
 "color": "white",
 "type": "Spontanzauber",
 "body": "Vernichte alle Verzauberungen und Signa, die auf einer Kreatur sind.<br>_W__W__W__W__W_: Erinnern.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 224,
 "title": "Seelenaussaugung",
 "cost": "SS1",
 "color": "black",
 "type": "Unterbrechungszauber, Legende",
 "body": "Zusätzliche Beschwörungskosten: Opfere eine Kreatur.<br>Erhalte soviele Lebenspunkte wie die geopferte Kreatur Widerstandskraft hatte.",
 "strength": "",
 "extra": "Nun bist du dran!",
 "rule_title": "Konsequent",
 "rule": "Man muß stets mit Bestimmtheit zaubern; das heißt das Zurücknehmen von Zaubersprüchen, ohne passenden Karte ist nicht gestattet.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 225,
 "title": "Morgenstern",
 "cost": "B",
 "color": "blue",
 "type": "Spontanzauber, Legende",
 "body": "Teil einer 3er-Spontankaskade. Alle Magier dürfen bis zu 4 Karten ziehen, allerdings nur soviele, daß sie je höchstens 7 auf der Hand haben.",
 "strength": "",
 "extra": "Endlose Geduld ... das heißt doch den richtigen Zeitpunkt erkennen!",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 226,
 "title": "Neugier",
 "cost": "W1",
 "color": "white",
 "type": "Unterbrechungszauber, Legende",
 "body": "Schaue Dir die obersten 3 Karten Deiner Bibliothek an und lege sie in beliebiger Reihenfolge zurück; Ziehe eine Karte.",
 "strength": "",
 "extra": "Dir sei vergeben.",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 227,
 "title": "Zeitzwinkern",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Nehme eines Deiner Artefakte auf die Hand und lege es, ohne die Beschwörungskosten zu zahlen, später in dieser Teilrunde in Deine Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Belohungen",
 "rule": "Für redliches Bemühen wird man belohnt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 229,
 "title": "Lederrüstung",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Reduziere Schaden, je Quelle, um eins.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 230,
 "title": "Stark gehopftes Bier",
 "cost": "GG3",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Beschwöre diese Teilrunde nur diesen Zauberspruch; In Deiner nächsten Teilrunde produzieren Deine Himmelskörper je _1_ mehr.",
 "strength": "",
 "extra": "Es erfrischt enorm",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 231,
 "title": "Konzentration",
 "cost": "0",
 "color": "red",
 "type": "Gewaltzauber",
 "body": "Zusätzliche Beschwörungskosten: Zahle _2_ in Deiner nächsten Versorgungsphase. Gilt als rote Karte. Du darfst Konzentration auch in der Hauptphase Deines Gegners beschwören. Kontert einen Gewaltzauber. _2_: Vergessen.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "Die Katze gehört zum Haus.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 232,
 "title": "Flammenpferdreiter",
 "cost": "R3",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "Alle Magier müssen stets mit allen Kreaturen, die können, angreifen.",
 "strength": "1/2",
 "extra": "Wohl dem, der noch eine andere Profession hat.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 233,
 "title": "Schwarzer Reiter",
 "cost": "SSS3",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Jede Kreatur erhält ein -1/-1 Signum in jeder Versorgungsphase.",
 "strength": "6/6",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 234,
 "title": "Tabakspfeife",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Jeder Magier darf je nur einen Schnellzauber pro Runde beschwören.",
 "strength": "",
 "extra": "Eine gute Pfeife verwandelt eine Hütte in einen Palast.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 235,
 "title": "Erzwingen",
 "cost": "RR3",
 "color": "red",
 "type": "Gewaltzauber, Legende",
 "body": "Tausche Plätze mit einem Magier.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 236,
 "title": "Namenloser",
 "cost": "4",
 "color": "light_grey",
 "type": "Kreatur, Seltenheit",
 "body": "Schicksalslose Inkarnation.<br>->, _1_: Eine Kreatur kann temporär nicht das Ziel von Zaubersprüchen sein.<br>->: Füge ein Mana einer Farbe, das Dein Gegner auch erzeugen könnte, zu Deinem Manavorrat hinzu.",
 "strength": "4/4",
 "extra": "Genau zur rechten Zeit.",
 "rule_title": "Bestimmung",
 "rule": "Wenn man mit einem Schicksal beginnt, so hat man ein Schicksal. Wenn man ohne Schicksal beginnt, aber zieht eins, dann hat man ein Schicksal. Wenn man kein Schicksal hat, so ist man schicksalslos. Wenn man schicksalslos ist, kann man eine schicksalslose Inkarnation beschwören. Falls man eine schicksalslose Inkarnation unter seiner Kontrolle hat und ein Schicksal erhält, so wird die schicksalslose Inkarnation aus der Welt entfernt.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 237,
 "title": "Weltfrieden",
 "cost": "W",
 "color": "white",
 "type": "Verzauberung",
 "body": "Es können keine Gewaltzauber mehr beschworen werden.",
 "strength": "",
 "extra": "Die Spatzen pfeifen es von den Dächern.",
 "rule_title": "Unmündig",
 "rule": "Unmündigkeit ist das Unvermögen, sich seines Verstandes ohne Leitung eines anderen zu bedienen. Selbstverschuldet ist diese Unmündigkeit, wenn die Ursache derselben nicht am Mangel des Verstandes, sondern der Entschließung und des Mutes liegt, sich seiner ohne Leitung eines anderen zu bedienen.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 238,
 "title": "Vertrauen",
 "cost": "G",
 "color": "green",
 "type": "Verzauberung, unzerstörbar",
 "body": "Geschenk.<br>Wenn ein anderer Magier, der nicht Du bist, auch ein Vertrauen unter seiner Kontrolle hat, könnt ihr in eurer Zugphase je 2 Karten ziehen.",
 "strength": "",
 "extra": "Über magische Wirkung nicht wundern!",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 239,
 "title": "Großmagierdiplom",
 "cost": "0",
 "color": "artifact",
 "type": "Auszeichung",
 "body": "Gilt als lichtgraue Karte.",
 "strength": "",
 "extra": "Gültiges Dokument der Magiergilde",
 "rule_title": "",
 "rule": "(α)",
 "pic": true,
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 241,
 "title": "Großmagierdiplom",
 "cost": "0",
 "color": "artifact",
 "type": "Auszeichung",
 "body": "Gilt als lichtgraue Karte.",
 "strength": "",
 "extra": "Gültiges Dokument der Magiergilde",
 "rule_title": "Auszeichnung",
 "rule": "Eine Auszeichung ist: Artefakt, unzerstörbar",
 "pic": true,
 "minting_cost": "5.1",
 "taken": true,
 "date": 0
},

{
 "card_id": 248,
 "title": "Hügellandschaft",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 249,
 "title": "Lagune",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 250,
 "title": "Gehölz",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein weißes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein grünes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 251,
 "title": "Felsenschlucht",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein rotes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 252,
 "title": "Meerenge",
 "cost": "",
 "color": "land",
 "type": "Land, Legende",
 "body": "->, _1_: Füge ein schwarzes Mana zu Deinem Manavorrat hinzu.<br>->, _1_: Füge ein blaues Mana zu Deinem Manavorrat hinzu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 255,
 "title": "Gedankensprung",
 "cost": "BB1",
 "color": "blue",
 "type": "Unterbrechungszauber, Legende",
 "body": "Kontert einen Zauberspruch, der dann ganz aus der Welt entfernt wird, oder mache einen unkonterbaren Zauberspruch konterbar.<br>Nachwirkung: Entferne Gedankensprung aus der Welt.",
 "strength": "",
 "extra": "",
 "rule_title": "Entfernung",
 "rule": "Wenn etwas aus der Welt entfernt wird, so heißt das nicht, das der betreffende Zauberspruch aus der Ideenwelt entfernt wird.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 260,
 "title": "Todesmacht",
 "cost": "SSS",
 "color": "black",
 "type": "Verzauberung, Legende",
 "body": "Überspringe Deine Zugphase.<br>0: Ziehe eine Karte zu Beginn Deiner Ablegephase, falls Du weniger als 7 Karten auf der Hand hast; zahle einen Lebenspunkt wenn sie schwarz ist, aber 2 falls sie nicht schwarz ist.",
 "strength": "",
 "extra": "Wer nur einmal das Buch der Macht öffnet...",
 "rule_title": "Zwischenphasen",
 "rule": "Man kann eine Incantatakaskade stets auch zwischen Phasen auslösen (zum Beispiel: „vor der Angriffsphase“, „Nach der Ablegephase“). In diesen Zwischenphasen können nur Schnellzauber beschworen werden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 263,
 "title": "Traumengel",
 "cost": "BB3",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Gestaltwandler.",
 "strength": "3/3",
 "extra": "",
 "rule_title": "",
 "rule": "(δ)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 269,
 "title": "Dürre",
 "cost": "RR2",
 "color": "red",
 "type": "Verzauberung",
 "body": "Versorgung: _R_.<br> Alle Kreaturen erhalten -0/-1.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 271,
 "title": "Feuerdolch",
 "cost": "R",
 "color": "red",
 "type": "Spontanzauber",
 "body": "Füge einer Kreatur 4 Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 275,
 "title": "Moor",
 "cost": "",
 "color": "land",
 "type": "Land",
 "body": "->: Füge einer angreifenden Kreatur einen Schaden zu.",
 "strength": "",
 "extra": "",
 "rule_title": "Spuken",
 "rule": "Ein Magier kann die aktivierbaren Effekte einer Kreatur, die in der Unterwelt ist und die Eigenschaft „spukt“ hat, anwenden.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 278,
 "title": "Abnormale Aktivität",
 "cost": "S1",
 "color": "black",
 "type": "Spontanzauber",
 "body": "Beschwöre einen Spontanzauber aus jedweder Unterwelt.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 302,
 "title": "Gedankengemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 blaue Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 303,
 "title": "Lebensgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 grüne Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 304,
 "title": "Blutgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 rote Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 305,
 "title": "Lichtgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 weiße Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 316,
 "title": "Regenbogenpony",
 "cost": "R1",
 "color": "red",
 "type": "Kreatur",
 "body": "Fliegt.<br>Geschenk.<br>X entspricht der Anzahl der Magier, die mindestens ein Regenbogenpony unter ihrer Kontrolle haben.",
 "strength": "X/X",
 "extra": "Freundschaft ist Magie",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 306,
 "title": "Nachtgemme",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_: Füge 2 schwarze Mana zu Deinem Manavorrat hinzu.<br>->, _2_, Selbstvernichtung: Ziehe eine Karte.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 323,
 "title": "Blaumohn",
 "cost": "GBR",
 "color": "green",
 "type": "Kreatur, Wunder",
 "body": "->: Mache eine Kreatur temporär unblockbar.",
 "strength": "0/1",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 331,
 "title": "Zahlkarte",
 "cost": "",
 "color": "artifact",
 "type": "Artefakt",
 "body": "bitcoin:<br>13VDeMgRgGf73mHs<br>MrrorXkq4fhUKfBvPz",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 334,
 "title": "Nebel",
 "cost": "G2",
 "color": "green",
 "type": "Gewaltzauber, Legende",
 "body": "Beschwöre den Nebel vor Deiner Angriffsphase. Greife mit allen Kreaturen an, Dein Gegner mischt alle seine Kreaturen und verteilt sie verdeckt als Blocker - möglichst gleichmäßig verteilt.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 336,
 "title": "Scheingestalt",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Fliegt.<br>Zerstöre die Scheingestalt, wenn sie Ziel eines Zauberspruches wird.",
 "strength": "4/4",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 337,
 "title": "Gunst der Gestirne",
 "cost": "0",
 "color": "blue",
 "type": "Energiezauber, Legende",
 "body": "Gilt als blaue Karte.<br>Teil einer 3er-Kaskade.<br>Alle Magier dürfen je 2 farblose Mana zu ihrem Manavorrat hinzufügen.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 339,
 "title": "Buckliger",
 "cost": "R",
 "color": "red",
 "type": "Kreatur, Legende",
 "body": "->: Füge 2 farblose Mana zu Deinem Manavorrat hinzu, welches Du nur für Artefakte verwenden darfst.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 341,
 "title": "Todesstrahl",
 "cost": "R1",
 "color": "red",
 "type": "Spontanzauber, Legende",
 "body": "Füge einem Ziel 3 Schaden zu; Dieser Schaden kann nicht verhindert werden und falls das Ziel eine Kreatur ist, so kann sie diese Teilrunde nicht wiederbelebt werden.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 347,
 "title": "Kavallerist",
 "cost": "R2",
 "color": "red",
 "type": "Kreatur",
 "body": "->: Mache eine Kreatur mit der Stärke 2, oder weniger, temporär unblockbar.",
 "strength": "1/1",
 "extra": "Der beste Botschafter ist ein Mann des Krieges.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 348,
 "title": "Heilschirmling",
 "cost": "G1",
 "color": "green",
 "type": "Kreatur, Legende",
 "body": "->: Verhindere einen Schaden bei einem Magier oder gebe Dir einen Lebenspunkt.",
 "strength": "0/2",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 351,
 "title": "Amöbe",
 "cost": "B",
 "color": "blue",
 "type": "Kreatur",
 "body": "Erstelle eine Kopie einer Kreatur mit Beschwörungskosten in Höhe von 1.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 352,
 "title": "Ballista",
 "cost": "4",
 "color": "artifact",
 "type": "Artefakt",
 "body": "Neu beschworen hat die Ballista 3 Pfeile geladen. Vernichte die Ballista, wenn sie keine Pfeile mehr hat.<br>->, Entferne einen Pfeil: Lege ein -1/-1 Signum auf eine Kreatur.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 353,
 "title": "Materieillusionsaufhebung",
 "cost": "BB1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Der Besitzer einer Bleibekarte nimmt jene zurück auf die Hand.",
 "strength": "",
 "extra": "Raum und Zeit zu durchwirken ist des Großmagiers Kunst.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 360,
 "title": "Niedere Hexe",
 "cost": "SS1",
 "color": "black",
 "type": "Kreatur",
 "body": "Fliegt.<br>Schutz vor Schwarz.",
 "strength": "2/2",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 363,
 "title": "Karstland",
 "cost": "",
 "color": "land",
 "type": "Land, Wunder",
 "body": "->, Opfere das Karstland: Füge einer angreifenden oder blockenden Kreatur einen Schaden zu.<br>->, Opfere das Karstland: Zerstöre ein Nichtstandardland.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 364,
 "title": "Nullungsblase",
 "cost": "0",
 "color": "artifact",
 "type": "Artefakt",
 "body": "->, Opfere die Nullungsblase: Alle nichtaktivierbaren Effekte von Verzauberungen und Artefakten, die keine Eigenschaften sind, sind temporär nichtig.",
 "strength": "",
 "extra": "Ihr habt keine Macht hier.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 398,
 "title": "Dunkles Ritual",
 "cost": "SSS",
 "color": "black",
 "type": "Spontanzauber, Legende",
 "body": "Verschiebe die Seelenaushauchung eines Magier um eine Runde",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 399,
 "title": "Spaghettimonster",
 "cost": "BB1",
 "color": "blue",
 "type": "Kreatur, Legende",
 "body": "Nachwirkung: Stelle einen Himmelskörper zurück.<br>Fliegt.<br>->: Kante eine nichtblaue Kreatur an.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 417,
 "title": "Buch der Verwandlungen",
 "cost": "2",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "->, _2_, Lege eine Nichtlandkarte ab: Ziehe eine Karte.",
 "strength": "",
 "extra": "Wie wundersam wird mir, ich fühle neues Streben.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 420,
 "title": "Verwirrung",
 "cost": "1",
 "color": "light_grey",
 "type": "Unterbrechungszauber, Vielheit",
 "body": "Tausche einen Zauber Deines Gegners durch einen Zauber gleicher Art von Deiner Hand aus; Ziele können nicht neu gewählt werden und müssen valide sein.",
 "strength": "",
 "extra": "Verwirrung? Ich nenne es das Licht der Klarheit!",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 421,
 "title": "Andere Seite",
 "cost": "",
 "color": "artifact",
 "type": "Artefakt, Legende",
 "body": "Dies ist die Rückseite von der Rückseite.",
 "strength": "",
 "extra": "... oder auch die andere Seite.",
 "rule_title": "",
 "rule": "Ein Magier, der erkennt, daß er seinen Gegner nicht bezwingen kann, verkündet dies mit dem Satz: „Io sono incantata/o!“ („ich bin verzaubert/entzückt“). Falls ein Magier es bis zum Schluß nicht erkannt hat, kann er dies natürlich auch nachträglich tun. Bei Incantata kann man nicht verlieren; die Begegnung kann lediglich enden.",
 "pic": true,
 "minting_cost": "250000",
 "taken": true,
 "date": 0
},

{
 "card_id": 426,
 "title": "Uhr",
 "cost": "",
 "color": "artifact",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "Von allen menschlichen Werken, ist das Uhrwerk das teuflischste.",
 "rule_title": "",
 "rule": "Das Prinzip von Ursache und Wirkung ist stets gültig.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 428,
 "title": "Schwalbe",
 "cost": "WW",
 "color": "white",
 "type": "Kreatur",
 "body": "Fliegt. Durchsuche Deine Bibliothek nach einer Schwalbe und lege sie direkt in die Welt.",
 "strength": "0/1",
 "extra": "Die eine Seite gehört dazu, die andere nicht.",
 "rule_title": "Incantata 1-233",
 "rule": "Grundsätzlich ist jede Form von Incantata nur für Volljährige geeignet (18+). Falls aber Eltern ihren Kindern Incantata erlauben wollen (Eltern haften), so sollte nur die aktuelle Kartenspielversion (reale Spielkarten 1 bis 233) mit den offiziellen Skizzen (img_skizze*) verwendet werden. Empfehlung ist: mindestens 14 Jahre.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 608,
 "title": "Eule",
 "cost": "SS",
 "color": "black",
 "type": "Kreatur, Legende",
 "body": "Fliegt. <br>Mondmacht, ->: Zerstöre eine Kreatur mit einer Widerstandskraft, von nicht größer eins.",
 "strength": "1/1",
 "extra": "",
 "rule_title": "Vorsicht",
 "rule": "Man sollte stets aufpassen, welche Grenzen man übertritt, denn es gibt tödliche Geheimnisse.",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 741,
 "title": "",
 "cost": "0",
 "color": "none",
 "type": "Traumzauber, Legende",
 "body": "Gilt als lichtweiße Karte. Tausche Plätze mit einem Magier, wenn jener einverstanden ist. Ziehe eine Karte.",
 "strength": "",
 "extra": "741 ... mach eins zu zwei und zwei zu eins.",
 "rule_title": "",
 "rule": "",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 752,
 "title": "",
 "cost": "",
 "color": "light_white",
 "type": "Regel",
 "body": "Eine unzerstörbare Kreatur kennt ihren Schöpfer.",
 "strength": "",
 "extra": "",
 "rule_title": "Krönung",
 "rule": "(Titel Krönung) Karte 766 siehe auch Regel 752",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 788,
 "title": "Ursachenkopplung",
 "cost": "B1",
 "color": "blue",
 "type": "Spontanzauber",
 "body": "Aller Schaden, den ein Zauberspruch auf ein Opfer verusacht, wird auf den Beschwörer jenes Zauberspruches zurückgeworfen. Zahle _1_ um desgleichen für jedes weitere Opfer jenes Zauberspruches zu erwirken.",
 "strength": "",
 "extra": "Du kennst doch gewiß das Prinzip von Ursache und Wirkung.",
 "rule_title": "",
 "rule": "(α)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 813,
 "title": "",
 "cost": "B",
 "color": "blue",
 "type": "Unterbrechungszauber",
 "body": "Erstelle 3 Kopien eines Unterbrechungszaubers und teile die insgesamt 4 Zaubersprüche gerecht auf, wobei der Ursprungszauber unverändert bleibt.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(α)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 823,
 "title": "",
 "cost": "0",
 "color": "light_grey",
 "type": "Traumzauber, Legende",
 "body": "Teil einer Siebenkaskade. Beende die Begegnung. Freiheit ist von jeder Farbe als auch farblos.",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(α)",
 "minting_cost": "250000",
 "date": 0
},

{
 "card_id": 841,
 "title": "ICT-841",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "(α)",
 "pic": false,
 "minting_cost": "1000",
 "taken": true,
 "date": 0
},

{
 "card_id": 842,
 "title": "Visitenkarte",
 "cost": "",
 "color": "blank",
 "type": "",
 "body": "Ich bin nicht Incantato.<br><br> „Io sono incantato!“",
 "strength": "",
 "extra": "",
 "rule_title": "Visitenkarte",
 "rule": "Ich bin nicht Incantata.<br><br> „Io sono incantata!“",
 "pic": "true",
 "date": 0
},

{
 "card_id": 843,
 "title": "Rückseite standard",
 "cost": "",
 "color": "rueckseite",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "pic": "",
 "date": 0
},

{
 "card_id": 844,
 "title": "Rückseite RZG",
 "cost": "",
 "color": "rueckseite_rz",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "pic": "",
 "date": 0
},

{
 "card_id": 845,
 "title": "Rückseite EK",
 "cost": "",
 "color": "rueckseite_ek",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "pic": "",
 "date": 0
},

{
 "card_id": 846,
 "title": "Rückseite custom",
 "cost": "",
 "color": "rueckseite_custom",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "pic": "",
 "date": 0
},

{
 "card_id": 2000,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Io sono Incantato!",
 "rule": "Eccolo! Hier ist nun Incantata. 7... 4... 2... Zauberei!.<br><b>Io sono Incantata!</b><br><br><b>Lizenz</b>: Alle Bilder, alle Kartentexte und alles auf dieser Seite ist <b>CC-SA (Creative Common Share Alike) lizensiert</b>.<br><br><b>Verbesserungsvorschläge</b>: über Zero-talk-Deutsch:  <a href='http://localhost:43110/1E4XLtKC59YV8V9JQ4AkeqSvqECSvrUtnv/'>Zero Talk DE</a><br><br><b>Wallet:</b> https://obyte.org <br><br> <b>set asset names script:</b><br><a href='set_asset_names.sh'>set_asset_names.sh</a>",
 "date": 0
},

{
 "card_id": 2001,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Helfen",
 "rule": "- Hoste diese Seite mit im 0net.<br>- Male ein Bild.<br>- Finde Rechtschreibfehler.<br>- Schenke Deinem Freund einen <a href='einzel.html?ids=52'>Goldkarpfen</a>.<br>- <u>Verbringe ein Stunde in heiterer Gelassenheit mit Deinen Freunden!</u><br>- Tausche und verschenke Kryptokarten.",
 "date": 0
},

{
 "card_id": 2002,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Hinweise für Künstler",
 "rule": "<u>Es gibt keine Garantie, daß Dein Bild einfach so angenommen wird</u>.<br><br>- Pate/Künstler präsentieren ein fertiges Bild, welches noch nicht vergeben ist (im Zweifel nachfragen, Fotoqualität beachten!)<br>- Bedenke, daß ich mir das Recht vorbehalte das Bild abzulehnen.<br>- <u>Bitte beachten, daß ich mir vorbehalte den Auschnitt/Helligkeit/Konstrast zu wählen!</u><br> Nur Bilder mit der „Vergeben“-Markierung stehen fest, alle anderen können sich jederzeit ändern, der erste Künstler der akzeptiert wird erhält natürlich die Kryptokarten.",
 "date": 0
},

{
 "card_id": 2003,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Sprachklone & Klone",
 "rule": "- Natürlich kannst du jederzeit Incantata klonen (CC-SA) und verändern.<br>- Diese Seite ist sehr einfach zu klonen, alle Texte, die übersetzt werden müssen sind in der data.json<br>- Wenn du einen Sprachklon machen willst (nur übersetzen, Spielmechanik & Seitenstruktur verbleiben wie gehabt, dh. nur cards.db, data.json und content.json dürfen sich von der offiziellen Incantataversion unterscheiden) bist du sehr herzlich willkommen.<br>- Sprachklone sollen hinsichtlich der HTML-Formatierung identisch sein, insbesondere darf kein Script-Tag in der Datenbank enthalten sein.<br>- Für jede Sprache wird je der Sprachklon verlinkt, der in Text und Formatierung dem Original am nächsten ist und regelmäßig gepflegt wird.<br>- Sprachklone werden bevorzugt in der Kopfzeile von Incantata angezeigt.<br>- Andere Klone werden, wenn sie mir gefallen, auch zur Kopfzeile hinzugefügt.<br>",
 "date": 0
},

{
 "card_id": 2004,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Fragen und Antworten",
 "rule": "F: Was ist diese Zite?<br>A: Diese Seite soll die Incantatadatenbank sichtbar darstellen und Druckansichten bereitstellen, um Testkarten ausdrucken zu können; und das alles mit <u>möglichst einfachen technischen Mitteln</u>.<br><br>F: Was heißt Incantata?<br>A: Incantata ist italienisch und heißt soviel wie verzaubert. Sowohl im magischen Sinne, als auch im Sinne von „ich bin entzückt!“<br><br>F: Was ist die „gioiello d’arco“?<br>A: Die Incantatakarten 1-91 werden als <b>gioiello d’arco</b> bezeichnet.<br><br>F: Freier Programmquelltext?<br>A: Alle Programmwerkzeuge, die für Incantata benutzt werden sind frei im Sinne des GNU-Projektes und/oder im Sinne der FSF/FSFE.",
 "date": 0
},

{
 "card_id": 2005,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "",
 "rule": "",
 "date": 0
},

{
 "card_id": 2006,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckansichten",
 "rule": "(Chromium: 114%, borderless DIN-A4, borders minimum)<br>(Firefox/TorBrowser: 76%-77%, alle margins=0 (about:config->margin), Kopf/Fußzeile aus)",
 "date": 0
},

{
 "card_id": 2007,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 1",
 "rule": "<span class='status_ready'><center><b>Rückseiten</b><br></center></span><br><a href='druck.html?ids=843,843,843,843,843,843,843,843,843'>Rückseiten</a><br><a href='druck.html?ids=845,845,845,845,845,845,845,845,845'>Ekliptik</a><br><a href='druck.html?ids=844,844,844,844,844,844,844,844,844'>Raumzeitgefüge</a><br><span class='status_ready'><center><b>Materiedomäne (1-99)</b>>99,88%</center></span><br><a href='druck.html?ids=0,1,1,52,14,15,16,17,18'>Schicksale&Legenden</a><br><a href='druck.html?ids=0,02,03,04,05,06,07,39,91'>Himmelskörper+Rose+Tulpe</a><br><a href='druck.html?ids=0,08,08,08,09,10,11,12,13'>Länder+RZG</a><br><a href='druck.html?ids=35,37,45,46,47,48,42,60,77'>Inkarnationen+Legenden</a><br><a href='druck.html?ids=0,90,95,80,84,86,89,93,99'>Legenden</a><br><a href='druck.html?ids=19,20,21,22,23,24,25,26,27'>Basis 1</a><br><a href='druck.html?ids=0,28,29,30,31,32,33,34,36'>Basis 2</a><br><a href='druck.html?ids=0,38,44,40,41,49,43,51,53'>Basis 3</a><br><a href='druck.html?ids=54,55,56,57,58,59,61,62,63'>Basis 4</a><br><a href='druck.html?ids=64,65,66,67,68,69,70,71,72'>Basis 5</a><br><a href='druck.html?ids=73,74,75,76,78,79,81,82,83'>Basis 6</a><br><a href='druck.html?ids=85,87,88,92,94,50,96,97,98'>Basis 7</a><br><br>",
 "date": 0
},

{
 "card_id": 2008,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 2",
 "rule": "<span class='status_beta'><center><b>Gewaltdomäne (100-234)</b><br>Beta</center></span><br><a href='druck.html?ids=100,101,102,103,104,105,106,107,108'>100-108</a><br><a href='druck.html?ids=109,110,111,112,113,114,115,116,117'>109-117</a><br><a href='druck.html?ids=118,119,120,121,122,123,124,125,126'>118-126</a><br><a href='druck.html?ids=127,128,129,130,131,132,133,135,136'>127-136</a><br><a href='druck.html?ids=137,138,139,140,141,142,143,144,145'>137-145</a><br><a href='druck.html?ids=146,147,148,149,150,151,152,153,154'>146-154</a><br><a href='druck.html?ids=155,156,157,158,159,160,161,162,163'>155-163</a><br><a href='druck.html?ids=164,165,166,167,168,169,170,171,172'>164-172</a><br><a href='druck.html?ids=173,174,175,176,177,178,179,180,181'>173-181</a><br><a href='druck.html?ids=182,183,184,185,186,187,188,189,190'>182-190</a><br><a href='druck.html?ids=191,192,193,194,195,196,197,198,199'>191-199</a><br><a href='druck.html?ids=200,201,202,203,204,205,206,207,208'>200-208</a><br><a href='druck.html?ids=209,210,211,212,213,214,215,216,217'>209-217</a><br><a href='druck.html?ids=218,219,220,221,222,223,224,225,226'>218-226</a><br><a href='druck.html?ids=227,226,229,230,231,232,233,234'>227-234</a>",
 "date": 0
},

{
 "card_id": 2009,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 3",
 "rule": "<span class='status_prealpha'><center><b>Bewegungsdomäne (235-420)</b><br>Pre-Alpha</center></span>",
 "date": 0
},

{
 "card_id": 2010,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 4",
 "rule": "<span class='status_prealpha'><center><b>Vergeistigungsdomäne (421-607)</b><br>Pre-Alpha</center></span>",
 "date": 0
},

{
 "card_id": 2011,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 5",
 "rule": "<span class='status_prealpha'><center><b>Energiedomäne (608-741)</b><br>Pre-Alpha</center></span>",
 "date": 0
},

{
 "card_id": 2012,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Druckseiten: 6",
 "rule": "<span class='status_prealpha'><center><b>Traumdomäne (742-841)</b><br>Pre-Alpha</center></span>",
 "date": 0
},

{
 "card_id": 2013,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Neuigkeiten",
 "rule": "<a href='134.html'>134.html</a><br>",
 "date": 0
},

{
 "card_id": 2014,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Verteilung der Kryptokarten",
 "rule": "- Jeder Kartenpate und jeder Künstler erhält ein „Mantra der Reinheit“<br>- Der Kartenpate schlägt eine Karte vor oder übernimmt Patenschaft für eine Karte.<br>- Der Künstler erstellt ein Bild.<br>- Das Bild (RAW-Format) muss gut abfotografiert werden mit einer Mindestgrösse (Nach Beschnitt) von: 4000x3200 (40:32)<br>- Das abfotografierte Bild wird Creative-Common lizensiert (CC-SA)- Das Original behält der Künstler natürlich.<br>- Das Bild wird in einem Seitenverhältnis von 40:32 dargestellt - beachte dies!<br>- Der Kartenpate überweist >= 5,1 MB (genauer Wert wird von mir festgelegt).<br>- Keine Karte wird jemals erneut geprägt werden.<br>- Der Künstler bekommt 15%<br>- Der Kartenpate bekommt 15%<br>",
 "date": 0
},

{
 "card_id": 2015,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Prägungsmengen",
 "rule": "<table><tr><td><b>Typ</b></td><td><b>100%</b></td><td><b>15%</b></td><td><b>Set</b></td></tr><tr><td>Legende</td><td>819</td><td>123</td><td>1</td></tr><tr><td>Wunder</td><td>1638</td><td>246</td><td>2</td></tr><tr><td>Formel</td><td>2457</td><td>369</td><td>3</td></tr><tr><td>Raumzeitgefüge</td><td>4914</td><td>714</td><td>6</td></tr><tr><td>Vielheit</td><td>9828</td><td>1475</td><td>12</td></tr><tr><td>Mantra der Reinheit</td><td>11800</td><td>---</td><td>1</td></tr><tr><td>Nr. 841</td><td>???(>=2, <97,6 mio.)</td><td>---</td><td>???</td></tr><tr><td>Nr. 796</td><td>???</td><td>---</td><td>???</td></tr></table>",
 "date": 0
},

{
 "card_id": 2016,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Bitte Beachten!",
 "rule": "- Bitte beachten: ich überweise die Karten an den Kartenpaten; Jener übernimmt dann die Verantwortung, dass der Künstler sein Teil abbekommt.<br>- Ich werde von jeder Karte zwei Sets behalten.<br>- Der Rest wird vom „Rat der 5 weisen Magier“ verschenkt. Wobei den weisen Magiern vorbehalten ist jenes ganz nach ihrem Gutdünken auszulegen.<br>- Karte Nr. 796 wird in einer Menge geprägt, die von allen Ihnhabern von Incantatakryptokarten bestimmt wird (Summe 5*α*j, j=Kartenmenge, α (α>1) wird von allen sinnvoll abgeschätzt).<br>- Die letzte Karte (Nr. 841) wird in einer Menge geprägt, die von allen Inhabern von Incantatakryptokarten, entsprechend gewichtet, bestimmt wird (>=2, <97,6 mio.). Ich behalte mir vor jene zu veröffentlichen, oder nicht. Allerdings werden die Kryptokarten davon trotzdem verteilt.<br>",
 "date": 0
},

{
 "card_id": 2017,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Symbole",
 "rule": "<img src='data/img/icon_info.gif'> Dieses Bild ist nur eine Arbeitsskizze.<br><img src='data/img/icon_taken.gif'> Diese Karte ist schon vergeben.<br><img src='data/img/icon_crypto.gif'> Diese Karte ist als Kryptokarte erhältlich.<br><br>Manasymbole</b>:<br><img class='mana_img' valign='middle' class='mana_img' src='data/img/mana_white.gif'></img> - weiß<br><img class='mana_img' valign='middle' class='mana_img' src='data/img/mana_blue.gif'></img> - blau<br><img class='mana_img' valign='middle' class='mana_img' src='data/img/mana_red.gif'></img> - rot<br><img class='mana_img' valign='middle' class='mana_img' src='data/img/mana_green.gif'></img> - grün<br><img class='mana_img' valign='middle' class='mana_img' src='data/img/mana_black.gif'></img> - schwarz<br><br>Nachtrag: Wirkliche Incantatakarten erzielen eine Wirkung in der Wirklichkeit, ebenso wie Kryptokarten, jene jedoch im Krypto-Universum; Drachengemmen (Wirklichkeitskryptokarten) dann in beiden Sphären",
 "date": 0
},

{
 "card_id": 2018,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Weltbibliothek",
 "rule": "Eine Weltbibliothek besteht aus 841 Karten. Jede Karte ist einmal vorhanden, außer Nr. 819. Deshalb ist eine von den anderen Karten doppelt. Mit Karten sind hiermit sowohl wirkliche Karten, als auch Kryptokarten gemeint. Ein echte Weltbibliothek ist jenes nun, wenn von diesem Set eine Karte zufällig (das setzt voraus, das es sowohl in der Wirklichkeit, als auch im Krypto-Universum zuverlässige Zufallsgeneratoren und die entsprechende Infrastruktur herum gibt) entfernt wird, entweder im Zusammenhang mit wirklichen Karten, oder Kryptokarten. Als vollkommen gilt eine solche Weltbibliothek, wenn jede Karte nur einmal vorhanden ist.",
 "date": 0
},

{
 "card_id": 2019,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Kopfzeile",
 "rule": "<span class='headlang'>PL</span><a href='alle.html' class='headlink'><span style='margin-left:30px' class='headelement'>&nbsp;Alle&nbsp;</span></a> <a href='alle.html?filter=green' class='headlink'><span class='headelement'>&nbsp;<img src='data/img/mana_green.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=blue' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_blue.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=red' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_red.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=black' class='headlink'><span class='headelement'>&nbsp;<img src='data/img/mana_black.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=white' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_white.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=none' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_0.gif'></img>&nbsp;</span></a> <a href='../1JeCDXuDG7VLJbimZQ6nWmNbeij2UV6P92/' class='headlink' title='Sammlerstücke'><span class='headelement'>&nbsp;Drachengemmen&nbsp;</span></a> <a href='../1KYeh8RtfQViD9k7J2QeJMLgT9vKrANrX9/' class='headlink' title='Vorkonstruierte Bibliotheken und individuelle Rückseiten'><span class='headelement'>&nbsp;Bibliotheken&nbsp;</span></a>",
 "date": 0
},

{
 "card_id": 9999,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Geh doch einfach weiter.",
 "rule": "Wo so ein kleines Köpfchen keinen Ausweg sieht, stellt es sich gleich das Ende vor.",
 "date": 0
},

{
 "card_id": 27790,
 "title": "",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "",
 "strength": "",
 "extra": "",
 "rule_title": "Incantataland",
 "rule": "<img src='data/img/incantata_flagge.gif'><br>27789.51.5: Universumstag<br>27789.52.1: Kosmostag<br>27790.27.4: Gründungstag<br>27.6: Glückstag<br>27790.31.4: Verwirklichungstag<br><br>Anmerkung zur Incantatalandflagge: Die Incantatalandflagge dient ganz allein der inneren Anschauung. Von öffentlicher Zurschaustellung, oder gar Flaggenfuchtelei, ist Abstand zu nehmen!",
 "date": 0
},

{
 "card_id": 27791,
 "title": "Incantato",
 "cost": "",
 "color": "none",
 "type": "",
 "body": "Ein Geheimnis, von dem alle hoffen, und viele wissen wollen, daß es existiert; aber nur wenige wollen es wissen und nur einer darf und kann es wissen.",
 "strength": "",
 "extra": "",
 "rule_title": "Incantata",
 "rule": "Ein Geheimnis, von dem alle hoffen, und viele wissen wollen, daß es existiert; aber nur wenige wollen es wissen und nur eine darf und kann es wissen.",
 "date": 0
},

{
 "card_id": 27792,
 "title": "Freude",
 "cost": "",
 "color": "none",
 "type": "Belohnung",
 "body": "... schöner Götterfunken.",
 "strength": "",
 "extra": "Und nun freut euch!",
 "rule_title": "Noch ein Gedicht",
 "rule": "Drüben hallt sie wohl, hier tönt sie längst in Wirklichkeit, Vittoria.<br>Die gloriose 9., so wie in Weisheit vorgedacht,<br>wenn sich kurz nach Beginn des 3. Satzes, der Dirigent sich aus dem Staube macht.<br><br>Incantato - Incantata ... er war wirklich niemals da!",
 "date": 0
}

]}
