{"cards": [

{
    "card_id": 0,
    "title": "",
    "cost": "",
    "color": "blank",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Incantato",
    "rule": "Whoever believes that someone must lose, has lost.",
    "date": 0
},

{
    "card_id": 1,
    "title": "Mantra of Purity",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "Remove Mantra of Purity from game: Draw 4 cards in your next draw phase.",
    "strength": "",
    "extra": "What is not nothing, but without form?",
    "rule_title": "Mantra of Purity",
    "rule": "Before the beginning everyone looks for his Mantra of Purity from his library and places it open in front of him. In round zero, you may remove the Mantra of Purity from game to activate its effect (see rule 733,734).",
    "pic": true,
    "token": "H1ismCyDm3P6x5zjqoL9hmjQzrn1q8L4uemGSxDJxAk=",
    "taken": true,
    "date": 0
},

{
    "card_id": 2,
    "title": "The Sun",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->: Add one colorless mana to your mana pool.",
    "strength": "",
    "extra": "... and there was light.",
    "rule_title": "Celestial Bodies",
    "rule": "There are two piles of cards: the library of spells and the ecliptic. In the ecliptic there must be 7 celestial bodies of your choice, whereby also for celestial bodies it applies that only 3 identical cards may be contained. In addition, there are also space-time structures in the ecliptic. In the celestial phase, a card is drawn from the ecliptic; it is not taken into your hand but placed directly into the world (celestial bodies) or directly discarded (space-time structure). From your library you must always draw a card in your draw phase, unless an effect (e.g. Mantra of Purity) dictates otherwise.",
    "pic": true,
    "token": "lmt3oLIhNXtR1MS21mKOwlU4Jl4qFjKNjeOOzKWLuQs=",
    "taken": true,
    "date": 0
},

{
    "card_id": 3,
    "title": "Jupiter",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->, Pay one Health: Add one mana of any color to your mana pool.",
    "strength": "",
    "extra": "For gifts from gods you always pay a price.",
    "rule_title": "Mana",
    "rule": "Celestial bodies provide cosmic energy to the magician: Mana. There is colorless mana and mana with a certain color. There are 5 colors in Incanta: red, blue, green, white and black. Most spells require a certain amount of colored mana and a certain amount of indefinite mana, which can be paid with any color or colorless mana. If a card allows you to add indefinite mana to your mana pool, you may choose which color (even colorless) it has.",
    "pic": true,
    "token": "tBYkQYZatAneign9Yc0ajQ3gBTNEvnOHtlfzJVhQ03Y=",
    "taken": true,
    "date": 0
},

{
    "card_id": 4,
    "title": "Venus",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->: Add one colorless mana to your mana pool.",
    "strength": "",
    "extra": "Is there room ...",
    "rule_title": "Celestial Phase",
    "rule": "Celestial bodies are not spells and are placed in the world directly (without taking them by the hand) during the celestial phase. One may not answer to placing of celestial bodies. During the celestial phase, spells cannot be summoned and effects cannot be applied.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 5,
    "title": "Mars",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->: Add one colorless mana to your mana pool.",
    "strength": "",
    "extra": "... is there I and You,",
    "rule_title": "Indestructible",
    "rule": "Indestructible cards neither can be destroyed, nor annihilated nor removed from the world. But you can sacrifice indestructible cards. When an indestructible card is sacrificed, it is removed from the world.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 6,
    "title": "Saturn",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->: Add one colorless mana to your mana pool.",
    "strength": "",
    "extra": "... and time in a flash.",
    "rule_title": "Mana with good reason",
    "rule": "A magician may not add mana to his mana pool without a good reason. If a magician has generated mana with a good reason, but cannot use it, then his opponent may use it (excess mana). If the opponent cannot use it, it expires. If a magician has accidentally generated mana without having a good reason, the generation is simply reversed as if it had never happened. <br>If necessary, provide advice to find out what good reasons are.",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 7,
    "title": "The Moon",
    "cost": "",
    "color": "sky",
    "type": "Celestial Body, Indestructible",
    "body": "->: Add one colorless mana to your mana pool.",
    "strength": "",
    "extra": "Where there's light, there's reflection.",
    "rule_title": "Ecliptic",
    "rule": "In the ecliptic, after the 7 celestial bodies (CB.) have been mixed, 6 space-time structure cards (STS.) according to the following pattern:<br>CB.<br>STS.<br>CB.<br>STS.<br>CB.<br>STS.<br>CB.<br>STS.<br>CB.<br>STS.<br>CB.<br>STS.<br>CB.",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 8,
    "title": "Space-Time Structure",
    "cost": "",
    "color": "sky",
    "type": "Experience of Context",
    "body": "",
    "strength": "",
    "extra": "Either all at once, or nothing at all.",
    "rule_title": "Library",
    "rule": "An Incantata library consists of exactly 46 or exactly 47 cards (including Mantra of Purity and Destiny). Every library must contain the Mantra of Purity. If you ignore the last rule, it's your own fault!",
    "pic": true,
    "token": "i4Jp634MW+dwd4L\/tM9ATSIDl5ejRNdcdpcISGH\/dw8=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 9,
    "title": "Expanse",
    "cost": "",
    "color": "land",
    "type": "Land, Multiplicity",
    "body": "_1_: Add one white mana to your mana pool.",
    "strength": "",
    "extra": "Il cammino",
    "rule_title": "Lands",
    "rule": "Lands are not considered spells. They are simply put into the world, but only in the main phase. However, it is possible to react to the placing of a land, because lands come into the world at the speed of matter spells. In your main phase, you can place as many lands as you want.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 10,
    "title": "Forest",
    "cost": "",
    "color": "land",
    "type": "Land, Multiplicity",
    "body": "_1_: Add one green mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Standard Lands",
    "rule": "There are the following standard lands: expanse, forest, mountains, ocean, singularity. All standard lands are allowed as often as desired per library. All non-standard lands (which are not legends) are allowed 3 times per library.",
    "pic": true,
    "token": "eGa6OZnl4fKqlCLJW9LVoHu1rOJvjzwQW\/95\/SsYUc8=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 11,
    "title": "Mountains",
    "cost": "",
    "color": "land",
    "type": "Land, Multiplicity",
    "body": "_1_: Add one red mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Mana Misfortune (optional)",
    "rule": "If you believe that you are disadvantaged by fortuity more often and\/or more than others, you can optionally add the following rule (if everyone agrees): Before you start, you can take a standard land from your library and put it on top of your library. Since this rule changes the overall balance, such an encounter is no longer considered strict Incantata and is therefore not permitted for tournaments.<br>Tip: If you want to avoid coincidences, you should try Spiritual Incantata or Spirit-Matter-Incantata.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 12,
    "title": "Ocean",
    "cost": "",
    "color": "land",
    "type": "Land, Multiplicity",
    "body": "_1_: Add one blue mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Tournament Incantata",
    "rule": "The allowed cards used for Tournament Incantata can be freely chosen depending on the tournament, but cards 1-91 (gioiello d'arco) should always be included.",
    "pic": true,
    "token": "TLAWiEl8Jo+jpPd4GYDuc53didPsXvJcH4Zim8D62N4=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 13,
    "title": "Singularity",
    "cost": "",
    "color": "land",
    "type": "Land, Multiplicity",
    "body": "_1_: Add one black mana to your mana pool.",
    "strength": "",
    "extra": "The land that no one ever saw, but perhaps passed through.",
    "rule_title": "Spiritual Incantata",
    "rule": "Spiritual Incantata is played without cards: You do everything in your head. Each spell is allowed only once, for both magicians. Each magician draws spells of his choice from his mind during his draw phase. For example, if a magician summons a Lightning, the other magician can no longer use this spell in that encounter; if he has this spell on his (imagined) hand, he must exchange it for one that has not yet been summoned. Celestial bodies, space-time structures, and lands do not count towards this limitation, as they are not spells; they are, however, subject to the rule \"card ratios\".<br>",
    "token": "ow+1I7eSt0PitnYCK5HRbW0P1dA2GFb56n6cqh3jVnM=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 14,
    "title": "Sapphire Mirror",
    "cost": "0",
    "color": "blue",
    "type": "Artefact, Legend, Destiny",
    "body": "Counts as blue card.<br>->: Add one blue mana to your mana pool.<br>Sacrifice the Sapphire Mirror: Counters an instant or interrupt spell that does not cost 0.",
    "strength": "",
    "extra": "",
    "rule_title": "Cards of Destiny",
    "rule": "Each magician chooses his destiny and the corresponding destiny card (blue, red, green, black, white) and takes it from his library into his hand. You can only choose one destiny card. If one did not choose a destiny, the first destiny card one would draw from one's library would determine ones destiny.",
    "token": "7jWe1qMPmw+fU8oB5Hl92yFalT\/BYtHjaDmsWGHERmg=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 15,
    "title": "Fire Opal",
    "cost": "0",
    "color": "red",
    "type": "Artefact, Legend, Destiny",
    "body": "Counts as red card.<br>->: Add one red mana to your mana pool.<br>Sacrifice the Fire Opal: Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Destiny",
    "rule": "The color of a magician's destiny is determined by the color of the first destiny card the magician draws. For example, when a magician begins his encounter with the Sapphire Mirror in his hand, his destiny is blue. If a magician begins without a destiny, but later draws a Fire Opal, his destiny is red.",
    "token": "RWoAGEvadLkgvdxmo+Tbg3ZEr6PzIbZsqmazBjsPouc=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 16,
    "title": "Awakening",
    "cost": "0",
    "color": "green",
    "type": "Power Spell, Legend, Destiny",
    "body": "Counts as green card.<br> Take a forest from your library and place it in the world. Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Just one Destiny",
    "rule": "If a magician has already chosen a destiny and another destiny card appears for him, that card is immediately removed from the world.",
    "token": "ZQU+cB\/IOVyNTVLy8vPEBy0mP4C6Ze\/Ppq\/Mng3UVic=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 17,
    "title": "Peacock Butterfly",
    "cost": "0",
    "color": "black",
    "type": "Enchantment, Legend, Destiny",
    "body": "Counts as black card.<br>_1_: Add one black mana to your mana pool.<br>Sacrifice the Peacock Butterfly: Add 3 black mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Matter Spells",
    "rule": "There are the following matter spells: creature spells, enchantment spells (also targeted enchantments), disenchantment spells, and artifact spells. All matter spells are also permanent cards. Targeted Enchantments\/Disenchantments are summoned upon a target, e.g. Creature Enchantments, Artifact Disenchantments, Enchantments Enchantments, Magician Enchantments, etc.",
    "token": "eyLIO\/+BKRxOjV4hqBMPVxNzKzNMr7OF33vdzXEcd+E=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 18,
    "title": "Golden Avatar",
    "cost": "0",
    "color": "white",
    "type": "Creature, Legend, Destiny",
    "body": "Counts as white card. _1_: Add one white mana to your mana pool.<br>Sacrifice the Golden Avatar: Counters a spell that does not cost 0.",
    "strength": "0\/1",
    "extra": "",
    "rule_title": "Tiger",
    "rule": "If one can counter the first Tiger, one should do so, otherwise one will most probably not be able to defeat his opponent any more.",
    "pic": true,
    "token": "M6PFljgPS8Ovm93xbf1pMjqW7yXVS28tcCzebCEXN3I=",
    "minting_cost": "1.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 19,
    "title": "Tiger",
    "cost": "G",
    "color": "green",
    "type": "Creature",
    "body": "",
    "strength": "2\/1",
    "extra": "Invincible!",
    "rule_title": "Combat Phase I",
    "rule": "You can attack with creatures, but only in the combat phase. The magician can declare an attack phase in his main phase. You may reply to the declaration of the attack phase. To prevent a creature from attacking, you could now tap it. Then the magician announces his attacking creatures. Creatures always attack the enemy magician, not the creatures directly. The defender announces his blocking creatures. More than one creature can block one attacking creature. After announcing attackers and blockers, quick effects (faster than force spells) can be summoned.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 20,
    "title": "Fire Elemental",
    "cost": "R",
    "color": "red",
    "type": "Creature",
    "body": "Annihilate the Fire Elemental: Inflict one damage to one target.",
    "strength": "1\/1",
    "extra": "One little flame only, but mine.",
    "rule_title": "Combat Phase II",
    "rule": "Before the combat phase ends, all quick effects are handled. If a creature is removed or tapped by a quick effect, it still blocks, but does no damage. If an attacking creature is removed, the blocking creature cannot block another creature. The tapping of an attacker does not change anything anymore. Then the combat damage will be resolved: All blockers and attackers inflict damage of Strength to each other. At the end of the battle phase, all creatures that have 0 or less Resistance are destroyed (put into the underworld, but resurrection is still possible).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 21,
    "title": "Alessia",
    "cost": "3SS",
    "color": "black",
    "type": "Creature",
    "body": "Can fly. Place a +1\/+1 counter on Alessia at the end of the partial round if she inflicted damage to a creature.",
    "strength": "4\/4",
    "extra": "Hypocrisy to claim you'd be something better.",
    "rule_title": "End of the Partial Round",
    "rule": "The phase \"end of the partial round\" is opened with the announcement of the magician that he will end his partial round. In response, magicians may respond with spells and effects that are faster than a force spell. Accordingly, it may then be replied to again. When all Incantata cascades have been completed, the partial round ends. Only then will all effects relating to the end of the subround be settled. If a magician, who was there from the beginning, has 0 or less Health, the Incantata encounter ends.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 22,
    "title": "Portuguese Galley",
    "cost": "B",
    "color": "blue",
    "type": "Creature",
    "body": "Unblockable.",
    "strength": "0\/1",
    "extra": "What a beast.",
    "rule_title": "Spirit-Matter-Incantata",
    "rule": "Spirit-Matter-Incantata is a variant of Spiritual Incantata: Everyone builds a library in the normal way, but each time he draws a card he can put a card of his choice on top.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 23,
    "title": "Flying Horse",
    "cost": "W",
    "color": "white",
    "type": "Creature",
    "body": "Can fly. Can't attack.",
    "strength": "0\/3",
    "extra": "Serving the righteous.",
    "rule_title": "Purity",
    "rule": "After the first encounter, any magician can sacrifice his Mantra of Purity in round zero and name a non-standard-land card. All magicians will then remove all cards with that name from their library. The magician who named the card may then only draw 3 cards in his next draw phase. (Tournament Incantata, optional for Astral and Domination)",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 24,
    "title": "Pacification",
    "cost": "W",
    "color": "white",
    "type": "Creature Enchantment",
    "body": "The creature can neither attack nor block.",
    "strength": "",
    "extra": "Why all the trouble?",
    "rule_title": "Meagre Times",
    "rule": "A land that's tapped can't transform mana.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 25,
    "title": "Strength",
    "cost": "G",
    "color": "green",
    "type": "Creature Enchantment",
    "body": "Creature gets +2\/+1 or +1\/+2; choose this when summoned.",
    "strength": "",
    "extra": "",
    "rule_title": "Triumphal Library",
    "rule": "A library is called a triumphal library if it has a library value of 34:66 or better. (Tournament Incantata, Magician's Accord)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 26,
    "title": "Bestialization",
    "cost": "R",
    "color": "red",
    "type": "Creature Enchantment",
    "body": "The creature gets +3\/+3. During your Supply Phase, place a -1\/-1 counter on the creature.",
    "strength": "",
    "extra": "After all, it's dying faster now.",
    "rule_title": "Counter",
    "rule": "A counter (Mz. Signa) is a token that is placed on cards. The meaning of a signum is determined by the spell through which it came into the world.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 27,
    "title": "Bewitchment",
    "cost": "S",
    "color": "black",
    "type": "Creature Enchantment",
    "body": "The creature's controller takes one damage during her\/his Supply Phase.",
    "strength": "",
    "extra": "",
    "rule_title": "Heavyweights",
    "rule": "Celestial bodies are considered to be permanent cards, but can never be taken on the hand.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 28,
    "title": "Astral Shield",
    "cost": "B",
    "color": "blue",
    "type": "Creature Enchantment",
    "body": "Annihilate the Astral Shield: Counters a spell that has the creature as its target.",
    "strength": "",
    "extra": "",
    "rule_title": "Great Magician",
    "rule": "A tournament great magician is a magician who has a triumphal library. This title is only awarded at an Incantata summit tournament. (Tournament Incantata, Magician's Accord)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 29,
    "title": "Mental Power",
    "cost": "R",
    "color": "red",
    "type": "Power Spell, Legend",
    "body": "All magicians discard all the cards in their hands and draw that many cards.",
    "strength": "",
    "extra": "She flies away, who can take her?",
    "rule_title": "Incantata Summit Tournament",
    "rule": "The Incantata Summit Tournament can only be played once a year and the final round is played with 28 participants in the Swiss system (if there are not 28 participants, the Summit Tournament cannot take place), so that each magician has at least 21 matches (3 matches per pair). The following applies to the Magician's Accord to be performed in each case: Before each encounter, the participants offer each other to swap at libraries (after cards from the sideboard may have been worked in). Only the one with the worse library value may refuse the exchange. After the meeting, the libraries are exchanged back. (Tournament Incantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 30,
    "title": "Dizzy Spell",
    "cost": "S",
    "color": "black",
    "type": "Instant Spell",
    "body": "Target creature temporarily receives -2\/-2.",
    "strength": "",
    "extra": "",
    "rule_title": "Tournament Magician",
    "rule": "A Tournament Magician 1st to 14th level is a magician who, with his library, achieves a library value equal to or better than 49:51 to 35:65 in a tournament that follows the rules of the Summit Tournament. All rules concerning the Triumphal Library\/Great Magician must also be observed for the attainment of these titles. (Tournament Incantata, Magician's Accord)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 31,
    "title": "Fallback",
    "cost": "G",
    "color": "green",
    "type": "Power Spell",
    "body": "Remove an enchantment from the world; does not affect destinies.",
    "strength": "",
    "extra": "",
    "rule_title": "Summit Tournament Card Selection",
    "rule": "At a summit tournament all published cards are allowed, except one, which is determined in a fair trial. (Tournament Incantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 32,
    "title": "Withdrawal",
    "cost": "B",
    "color": "blue",
    "type": "Power Spell",
    "body": "The owner of a permanent card takes it back in his hand.",
    "strength": "",
    "extra": "As if it had never existed.",
    "rule_title": "Library Value",
    "rule": "The library value indicates the percentage by which a magician with his (the same) library becomes a martyr - others with that library become a martyr. For example 47:55 (47% martyr quota : 55% martyr quota). For such a library value to be valid, it must be asked before every encounter whether libraries are exchanged, whereby only the magician with the lower astral value of his library can deny this - after the encounter the libraries are exchanged back.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 33,
    "title": "Life Force",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell",
    "body": "All magicians gain 4 Health.",
    "strength": "",
    "extra": "A spark beginning.",
    "rule_title": "World of Ideas",
    "rule": "The world of ideas has always been there. All spells that are summoned and, if necessary, copies of spells appear in the world of ideas. A world of sub-ideas is a full Incantata-cascade. Countered spells remain in the world of ideas, but are marked as countered. Once the Incantata-cascade is over, the world of ideas will be renewed, that is, a new empty world of sub-ideas will be opened. All previous world of sub-ideas remain accordingly. The world of ideas exists all the time.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 34,
    "title": "Aggression",
    "cost": "G",
    "color": "green",
    "type": "Instant Spell",
    "body": "Target creature temporarily gets +3\/+3.",
    "strength": "",
    "extra": "Who started it?",
    "rule_title": "Branch cascades",
    "rule": "If you respond to a spell of a cascade (root cascade), but the response spell is faster than the target spell, a branch cascade is created. When all magicians have finished spellcasting and no further answer is cast, all branch cascades and the trunk cascade form an Incantatakaskade (short cascade). Now the branch cascades and the trunk cascade (first fast, then slow) are unwound (\"last in - first out\"). A single spell or effect is also a cascade, but with only one part.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 35,
    "title": "Lightning Bolt",
    "cost": "R",
    "color": "red",
    "type": "Instant Spell, Legend",
    "body": "Inflict 3 damage to any target.",
    "strength": "",
    "extra": "Frizzle!",
    "rule_title": "Fizzle",
    "rule": "If the target of a spell has disappeared, the spell will fizzle; it will simply be discarded.",
    "pic": true,
    "minting_cost": "5.1",
    "token": "9OL6wi5FQavGbj/gBWmvIF0ubjDShrgB4H1HbEfpj1k=",
    "date": 0
},

{
    "card_id": 36,
    "title": "Letting Go",
    "cost": "B",
    "color": "blue",
    "type": "Instant Spell",
    "body": "Target creature can fly temporarily. Draw a card.",
    "strength": "",
    "extra": "Just forget there's gravity.",
    "rule_title": "Formulas",
    "rule": "All spells that do not have the type legend, wonder, multiplicity, onceness or uniqueness are and act as formulas (long: magic formula). Formulas are allowed 3 times per library.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 37,
    "title": "Glitter Beam",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell, Legend",
    "body": "A magician gains 6 Health if she\/he has 0 or less Health.",
    "strength": "",
    "extra": "In the darkest hour I will be there for you.",
    "rule_title": "End of Encounter",
    "rule": "An Incantata encounter can end in 2 ways: 1. One or both magicians have no health at the end of a partial round. 2. one or both magicians can no longer draw a card from their library if they need to do so. (This refers only to magicians who were there from the beginning.)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 38,
    "title": "Personal Matter",
    "cost": "S",
    "color": "black",
    "type": "Instant Spell",
    "body": "Remove a creature from the world; get as much damage as the creature had Strength.",
    "strength": "",
    "extra": "Correct! I'll destroy you.",
    "rule_title": "Mana Cheating",
    "rule": "Anyone who cheats on the right mana and gets caught should be be called an Untrustworthy Witch.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 39,
    "title": "Tulip",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Wonder",
    "body": "->,_1_, Sacrifice the Tulip: Add one black, red or blue mana to your mana pool; Draw a card.",
    "strength": "",
    "extra": "And when I looked up, I saw millions...",
    "rule_title": "The Universe",
    "rule": "The Incantata universe consists of the sum of all 7 worlds: The world of ideas, the world of writing, the world of thoughts, the underworld, the world, the cosmos and the unworld. \"Your part world\" is synonymous with \"Your world\", as well as \"Your part underworld\" is synonymous with \"Your underworld\". \"under your control in the world\" is synonymous with \"in your part world\" etc. After removing the Mantra of Purity from the game, the Incantata universe becomes the universe. This transformation is undone after the encounter has ended.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 40,
    "title": "Controll",
    "cost": "W",
    "color": "white",
    "type": "Interrupt Spell",
    "body": "Take control of an interrupt spell.<br>_1_: Forget.",
    "strength": "",
    "extra": "How free you suddenly feel.",
    "rule_title": "Existence",
    "rule": "Incantata rules that exist apply even if they are not visible.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 41,
    "title": "Impurity",
    "cost": "S",
    "color": "black",
    "type": "Interrupt Spell",
    "body": "A spell or effect that gives Health or increases a creature's Resistance causes damage or reduces the creature's Resistance instead.",
    "strength": "",
    "extra": "Your greed for life is nothing but addiction.",
    "rule_title": "Incantata-Crypto-Universe",
    "rule": "The Incantata Crypto Universe is structured just like the Incantata Universe. Logically, the Incantata Crypto Universe is in the Crypto Universe and the Incantata Universe is in reality. Depending on the type of Incantata crypto universe, cards that are in reality may be missing. Or cards that do not exist in reality may exist in a certain Incantata Crypto Universe.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 42,
    "title": "Natural Spirit",
    "cost": "4GGG",
    "color": "green",
    "type": "Creature, Legend, Incarnation",
    "body": "Causes breakthrough damage.<br>When the Nature Spirit becomes the target of a spell, it gets +2\/+1 until the end of the partial round.",
    "strength": "7\/7",
    "extra": "I realize you'd like to be like me.",
    "rule_title": "Incarnation",
    "rule": "You may only summon an incarnation if you have chosen the appropriate fate. It is not decisive whether it is still in the world.",
    "pic": true,
    "token": "\/KdR\/HNwNWZnU5eDp02eVGfWUrz\/PaGcb\/UC3KCJ4Kw=",
    "taken": true,
    "date": 0
},

{
    "card_id": 43,
    "title": "Spirit of Life",
    "cost": "G",
    "color": "green",
    "type": "Interrupt Spell",
    "body": "Counters a blue spell.<br>_2_: Forget.",
    "strength": "",
    "extra": "You're like the spirit you understand.",
    "rule_title": "Oblivion",
    "rule": "A card with the \"Forget\" effect can be discarded for the activation cost to draw a new card, for example: 2: Forget -> pay any 2 mana to discard; draw a new card. This effect is invoked at the speed of the original card, and may only be activated in the corresponding phase.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 44,
    "title": "Objection",
    "cost": "B",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Counters an interrupt spell.<br>_2_: Forget.",
    "strength": "",
    "extra": "A razor-sharp mind makes all the difference.",
    "rule_title": "Perfect",
    "rule": "Announce which one will be the decisive spell. If this spell is the decisive one at the end, this encounter is considered perfect.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 45,
    "title": "Manifestation",
    "cost": "4WWW",
    "color": "white",
    "type": "Creature, Legend, Incarnation",
    "body": "Can fly.<br>->,_R__R_: Inflict 2 damage to any target.<br>_G_: Temporary +2\/+0",
    "strength": "0\/9",
    "extra": "If there's no other way.",
    "rule_title": "Spell Break",
    "rule": "You may not cast spells or activate effects during the renewal phase, draw phase, and celestial phase. No spells may be cast during the discard phase.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 46,
    "title": "Lightbringer",
    "cost": "4SSS",
    "color": "black",
    "type": "Creature, Legend, Incarnation",
    "body": "Causes breakthrough damage.<br>->: Remove a tapped creature from the world.",
    "strength": "7\/7",
    "extra": "I've always been misunderstood.",
    "rule_title": "The World",
    "rule": "There are cards in the world (summoned or laid cards), cards outside the world (in the hand, library or underworld) and cards that are removed from the world.",
    "pic": true,
    "token": "tSmAl\/Wsus6jepcp3meh2ccd5lCYKfCNKOkBHPP4HiE=",
    "minting_cost": "1.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 47,
    "title": "Leviathan",
    "cost": "4BBB",
    "color": "blue",
    "type": "Creature, Legend, Incarnation",
    "body": "Annihilate the Leviathan if you don't control any ocean. Causes breakthrough damage.<br>_B_, Annihilate an Ocean: Counters a spell that has the Leviathan as its target.",
    "strength": "7\/7",
    "extra": "He always has a suitable answer.",
    "rule_title": "Official Version",
    "rule": "The official Incantata version is the one on the official Incantata 0Net site. If an older card is used that is technically different from the official version, it may only be used in the same way as the official version.",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 48,
    "title": "Dragon",
    "cost": "4RRR",
    "color": "red",
    "type": "Creature, Legend, Incarnation",
    "body": "Can fly.<br>->,_R__R_: Inflict 2 damage to any target.",
    "strength": "8\/8",
    "extra": "Contrary to rumor, I have no weak spot.",
    "rule_title": "Effect Responses",
    "rule": "You can reply to the effects of lead cards. A spell can be used to respond if the speed is equal to or higher than the speed of the Permanent Card effect.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 49,
    "title": "Strength Principle",
    "cost": "R",
    "color": "red",
    "type": "Interrupt Spell",
    "body": "Counters a blue spell.<br>_2_: Forget.",
    "strength": "",
    "extra": "In the end, the spirit defeats the sword? Don't make me laugh!",
    "rule_title": "Hopefully Polite.",
    "rule": "When in an Incantatabgung a magician is stopped to counter a spell, it is considered particularly polite to do so in a polite manner. For example: Majesty\/ Durchlaucht\/ Hochwohlgeboren! Counter this spell!",
    "pic": true,
    "token": "ZRkBR6KLJLQF5CZsJGzcwmhPj2yHz5dT5N6eoYs0mvE=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 50,
    "title": "Glowing Hammer",
    "cost": "XRR",
    "color": "red",
    "type": "Power Spell",
    "body": "Cannot be countered.<br>Inflict X damage to any target X.",
    "strength": "",
    "extra": "",
    "rule_title": "Source Energies",
    "rule": "There are 9 energy sources that produce things in the Incantata universe: Earth Energy (produces lands - considered colorless), Cosmic Energy (produces celestial bodies & RZG - considered colorless), Blue, Green, White, Black, Red, Light-Black, Light-White (of any color), Light-Grey (of any color and colorless), and Shadow-White. Earth and cosmic energy combined produces colorless artifacts.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 51,
    "title": "Avenging Angel",
    "cost": "3WW",
    "color": "white",
    "type": "Creature",
    "body": "Also counts as black card.<br>Can fly.<br>Not tapped for attack.",
    "strength": "4\/4",
    "extra": "Now it's on you.",
    "rule_title": "Letters to Strangers",
    "rule": "If you are written in capital letters, then the magician is addressed.",
    "pic": true,
    "token": "bTAz9qAtBQ9bmKE4NtnFjGMmqEgZdXELKk0Xvv0LQMg=",
    "taken": true,
    "zite": "172nCFMgaVNEoWZAiKwHu8G1LXqA3gxMag",
    "date": 0
},

{
    "card_id": 52,
    "title": "Golden Carp",
    "cost": "2G",
    "color": "green",
    "type": "Creature, Legend",
    "body": "Whenever the Golden Carp becomes the target of a spell, draw a card.",
    "strength": "1\/1",
    "extra": "Friendship is Golden.",
    "rule_title": "Card Ratios",
    "rule": "In contrast to legends, all other cards are allowed 3 times per library - even celestial bodies. Standard lands are allowed as often as desired. Space-time structures are allowed 6 times. Very serious Incantatamages take only one card per spell into the library from cards that have a color other than their fate.",
    "token": "fl8nebcmamXbj08u7Q8j8PUP\/3bTcykR8jgR2\/2XG2s=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 53,
    "title": "Wave Horses",
    "cost": "1B",
    "color": "blue",
    "type": "Instant Spell",
    "body": "One ocean becomes a 3\/3 creature, but remains an ocean too.",
    "strength": "",
    "extra": "They suddenly rose and reared up like mighty war horses.",
    "rule_title": "Transcendental Master",
    "rule": "When the encounter ends and the martyr is determined, it is checked whether the next card of the martyr would have definitely let the encounter go the other way (the partial round is simulated until exclusively the fighting phase), then the martyr of the encounter is transcendent and both magicians are allowed to register the other as the martyr for their library statistics. This is only possible if the match ended at the end of the non-martyr's partial round.",
    "pic": true,
    "token": "QNT6q9xFGjaOn6r8iP4qKd7+nMBhs\/SZ8n\/p\/9RKs0g=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 54,
    "title": "Apple Tree",
    "cost": "2G",
    "color": "green",
    "type": "Creature",
    "body": "",
    "strength": "3\/4",
    "extra": "",
    "rule_title": "Legend",
    "rule": "Cards with the type \"Legend\" are only allowed once per library.",
    "pic": true,
    "token": "SLH0j+5HTXhcOWB24r7yWrGGhTPrpcFP5Zru0IqhqyE=",
    "taken": true,
    "date": 0
},

{
    "card_id": 55,
    "title": "Storm Pile Driver",
    "cost": "5",
    "color": "artifact",
    "type": "Artefact, Creature",
    "body": "The Storm Pile Driver must attack.",
    "strength": "5\/4",
    "extra": "An effective remedy.",
    "rule_title": "Magic of Matter",
    "rule": "When a matter spell has succeeded (=realized), the spell manifests itself as a card of the world and becomes, as the card type determines, a creature, artifact, enchantment, or disenchantment.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 56,
    "title": "Discontinuity",
    "cost": "WW",
    "color": "white",
    "type": "Interrupt Spell",
    "body": "Counters a spell.",
    "strength": "",
    "extra": "Wisdom sounds like madness in fool's ears.",
    "rule_title": "Replies",
    "rule": "There are 7 spell speeds at Incantata (slow->fast):<br>- Matter spells (Permanent Cards)<br>- Force spells<br>- Instant spells<br>- Effect spells<br>- Interrupt spells<br>- Energy spells<br>- Dream spells<br>You can only respond to a spell if the response spell is as fast or faster. All spells summoned in response and the first form an Incantatakaskade or short cascade. Cascades are processed \"last in - first out\". See also: Branch Cascades",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 57,
    "title": "Afterlife Call",
    "cost": "1S",
    "color": "black",
    "type": "Instant Spell",
    "body": "Annihilate a non-black creature.",
    "strength": "",
    "extra": "Don't worry, you'll like it there.",
    "rule_title": "Annihilation",
    "rule": "When a creature is annihilated, it is placed in the underworld and cannot be resurrected.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 58,
    "title": "Deadly Spark",
    "cost": "1RR",
    "color": "red",
    "type": "Instant Spell",
    "body": "Destroy a creature.",
    "strength": "",
    "extra": "Sometimes one spark is enough.",
    "rule_title": "Destroying",
    "rule": "If a creature is destroyed, it will be placed in the underworld unless it is resurrected.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 59,
    "title": "Complication",
    "cost": "1B",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Counters a spell if its controller does not pay _3_.",
    "strength": "",
    "extra": "How will I - my thinking will be lame...",
    "rule_title": "Counter",
    "rule": "When a spell or effect is countered, it is prevented from coming into the world or working. If it was a spell, the card is simply discarded. Summoning costs already incurred will not be taken back.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 60,
    "title": "Elven Bread",
    "cost": "1G",
    "color": "green",
    "type": "Instant Spell, Legend",
    "body": "Choose one of the following effects * You gain 3 Health * A creature gains +2\/+1 temporarily * All your creatures gain +0\/+1 temporarily. Draw a card.",
    "strength": "",
    "extra": "It will always be of use to you.",
    "rule_title": "Misappropriate Incantata Cards",
    "rule": "It is not possible to misappropriate Incantata cards.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 61,
    "title": "Shaman",
    "cost": "G",
    "color": "green",
    "type": "Creature, Wonder",
    "body": "->: Add one green mana to your mana pool.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Effects of Continuance Cards",
    "rule": "The effects of lead cards are activated with effect spell speed, which means that you can only respond with spells of equal\/higher speed, or effects of higher speed.<br>But there are exceptions:<br>- card effects that produce or transform mana: Energy spell speed.<br>- Card effects that can counter effects or spells: Interrupt spell= speed.<br>- Card effects that inflict damage: Instant spell speed.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 62,
    "title": "Genie In The Bottle",
    "cost": "2B",
    "color": "blue",
    "type": "Creature",
    "body": "Can fly.<br>The Genie In The Bottle inflicts one damage to you during your supply phase.",
    "strength": "3\/4",
    "extra": "I said, \"Now we must both die!\" And he said, \"What can I do? It's in my nature.\"",
    "rule_title": "Phases",
    "rule": "In each partial round there are 7 possible phases:<br>- renewal phase<br>- celestial phase<br>- supply phase<br>- draw phase<br>- main phase<br>- attack phase (within the main phase)<br>- discard phase",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 63,
    "title": "War Drums",
    "cost": "2R",
    "color": "red",
    "type": "Enchantment",
    "body": "All your attacking creatures get +1\/+0.",
    "strength": "",
    "extra": "Dong Do-Do Do-Do Dong Do-Do Do-Do Do-Do...",
    "rule_title": "Temporary",
    "rule": "An effect that is temporary only lasts until the end of the partial round. If several effects with a preceding \"temporary\" are attributed in a set, all effects are temporary.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 64,
    "title": "Bat",
    "cost": "S",
    "color": "black",
    "type": "Creature",
    "body": "Can fly.",
    "strength": "1\/1",
    "extra": "Like a flying rat, only even uglier.",
    "rule_title": "Summoning Dizzyness",
    "rule": "When creatures are summoned, they suffer from summoning dizziness. This means that creatures that weren't in the world before you started your partial round can neither attack nor activate effects that have tapping as part of their activation cost. However, effects that do not require tapping are immediately available.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 65,
    "title": "Rampart",
    "cost": "1W",
    "color": "white",
    "type": "Enchantment",
    "body": "All your creatures with Strength 0 get +0\/+2.",
    "strength": "",
    "extra": "Like a living wall.",
    "rule_title": "The 7 Worlds",
    "rule": "There are 7 worlds: 1. thought world (sum of all partial thought worlds = handcards of a magician) 2. world of ideas 3. underworld (sum of all partial underworlds) 4. world (sum of all partial worlds) 5. writing world (sum of all libraries) 6. environment (=hell) 7. cosmos (sum of all ecliptics, celestial bodies in the world and all space-time structures)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 66,
    "title": "Healing Garden",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Wonder",
    "body": "->,_2_: Add one Health to yourself.",
    "strength": "",
    "extra": "Everything in this place is salutary.",
    "rule_title": "Encounter",
    "rule": "A game of Incantata is called \"Encounter\".",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 67,
    "title": "Elucidation",
    "cost": "1W",
    "color": "white",
    "type": "Instant Spell",
    "body": "Destroy an artifact or an enchantment.",
    "strength": "",
    "extra": "Believe me, your immaturity is self-inflicted.",
    "rule_title": "Destiny Destruction",
    "rule": "Of course you can destroy destinies, but it will fall back on you in a fateful way.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 68,
    "title": "Blight of Plague",
    "cost": "1S",
    "color": "black",
    "type": "Power Spell",
    "body": "All magicians and all creatures receive one damage.",
    "strength": "",
    "extra": "And that was just a foretaste!",
    "rule_title": "Power Spells",
    "rule": "Force spells are powerful spells that a magician can only summon in his main phase - outside the combat phase. Remember that force spells in Incantata can also be invoked as a response.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 69,
    "title": "Plasma Shock",
    "cost": "XR",
    "color": "red",
    "type": "Power Spell",
    "body": "Inflict X damage to any target, this damage cannot be prevented or redirected.",
    "strength": "",
    "extra": "The spirit is a fire whose flame is thought.",
    "rule_title": "Phase Restriction",
    "rule": "Force spells and matter spells (creatures and enchantments) can only be summoned during your main phase, outside the combat phase. The design of lands is also subject to this phase limitation.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 70,
    "title": "Lie",
    "cost": "1B",
    "color": "blue",
    "type": "Instant Spell",
    "body": "Tap or untap a permanent card; Draw a card.",
    "strength": "",
    "extra": "One follows another.",
    "rule_title": "Tournament Title",
    "rule": "Several titles can be awarded in a tournament in modes of your choice. For example, Magician's Accord and Astral Mode. However, a magic mode title will be awarded at a Summit Tournament in any case. (Tournament Incantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 71,
    "title": "Life-Giver",
    "cost": "1G",
    "color": "green",
    "type": "Instant Spell",
    "body": "Additional sommoning costs= Pay one Health.<br>Resurrect a Creature; Draw a card.",
    "strength": "",
    "extra": "I won't let you down!",
    "rule_title": "Power&Title",
    "rule": "If a tournament is played in Lore mode (determining the best Lore library), the player with the best Lore library gets the title Lore Magician. (Tournament Incantata, Lore mode)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 72,
    "title": "Poison Arrow",
    "cost": "1G",
    "color": "green",
    "type": "Instant Spell",
    "body": "Target creature gets one damage; destroy this creature if it gets damage again during this partial round.",
    "strength": "",
    "extra": "One can forge a sword, another can use it.",
    "rule_title": "Power Mode",
    "rule": "When playing in Domination (see Magic Mode), the best power library is determined. Bilbliotheken are never exchanged before the game starts. The best power library is the one with the best library value (lowest martyr rate). (Tournament Incantata, Domination)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 73,
    "title": "Skystormer",
    "cost": "3BB",
    "color": "blue",
    "type": "Creature",
    "body": "Can fly.<br>Taps all other flying creatures when the Skystormer comes into the world.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Effects",
    "rule": "Effects are a list of statements. If these statements do not contain a subject or object, the magician adds the statement to a sentence in thought. Like, \"<i>the Skystormer<\/i>\" flies.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 74,
    "title": "Combat Dwarf",
    "cost": "1R",
    "color": "red",
    "type": "Creature",
    "body": "First strike.",
    "strength": "2\/1",
    "extra": "A tough bastard.",
    "rule_title": "Magic Mode",
    "rule": "When playing in Magician's Accord, the best magic library is determined. (Tournament Incantata, Magician's Accord)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 75,
    "title": "Crow",
    "cost": "1S",
    "color": "black",
    "type": "Creature",
    "body": "Can fly.",
    "strength": "2\/1",
    "extra": "Caw!",
    "rule_title": "Flying",
    "rule": "Flying creatures can block both flying and nonflying creatures, while nonflying creatures cannot block flying ones.",
    "pic": true,
    "token": "90gfg11JPJjQgv9t+G6v1+qMhC9DL7QRi9z6n5BXoU0=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 76,
    "title": "Black Pearl",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Rarity",
    "body": "Additional summoning costs= Double Celestial Power.<br>->: Add one colorless mana to your mana pool.<br>",
    "strength": "",
    "extra": "",
    "rule_title": "Rarity",
    "rule": "You may have a rarity only once under your control in the world. If the same rarity is already under your control, you must neither summone that rarity again, nor neither use any spell nor effect that would bring that rarity into the world. If your opponent uses an effect or spell that gives you a Rarity that you already have under your control, you must remove all Rarities of that kind except one.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 77,
    "title": "Energy Sink",
    "cost": "5",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->: Tap a permanent card.",
    "strength": "",
    "extra": "Infernal apparatus - strange",
    "rule_title": "Timing",
    "rule": "The activation cost\/ summoning cost of effects\/ spells will be charged at the exact time the effect\/spell happens. See realisation.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 78,
    "title": "Patera",
    "cost": "3",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, Sacrifice a land: draw a card.<br>->,_2_, Sacrifice a non-creature artifact: Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Continuance Card Effect Cascades",
    "rule": "An Incantata cascade can also be started by an effect of a lead card (effect cascade).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 79,
    "title": "Incense",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell",
    "body": "Prevent one damage from all creatures that have Strength 0. Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Drawing Cards",
    "rule": "If you are asked to draw a card, you draw this card from your library unless otherwise specified (e.g. ecliptic).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 80,
    "title": "Bright Magic",
    "cost": "2WS",
    "color": "light_black",
    "type": "Interrupt Spell II, Onceness",
    "body": "Counts as light-black card. Remove the request to sacrifice something from the activation cost of an effect of a matter spell; that matter spell must not be a destiny.",
    "strength": "",
    "extra": "",
    "rule_title": "ẞ",
    "rule": "Interrupt spells can also be written interrupt spells",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 81,
    "title": "Ball Lightning",
    "cost": "RR",
    "color": "red",
    "type": "Instant Spell",
    "body": "Inflict 3 damage to any target; the controller of that target then inflicts 2 damage to any target of his choice; the controller of that target then inflicts one damage to any target of his choice.",
    "strength": "",
    "extra": "",
    "rule_title": "Self-control",
    "rule": "If an effect or spell refers to the controller of a target, remind yourself that every magician is always the controller of himself.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 82,
    "title": "Creation Reversal",
    "cost": "3BB",
    "color": "blue",
    "type": "Power Spell",
    "body": "All creatures are taken back to the hands of their owners.",
    "strength": "",
    "extra": "",
    "rule_title": "The Cosmos",
    "rule": "The cosmos (celestial world) consists of all ecliptics and all celestial bodies in the world and all space-time structures. The cosmos unfolds within 13 rounds (eons) and when fully unfolded, the cosmos is in the world and the world is in the cosmos. The cosmos transcends because space-time structures distant from the world also belong to it.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 83,
    "title": "Law of Nature",
    "cost": "GG",
    "color": "green",
    "type": "Instant Spell",
    "body": "Annihilate an artifact. Can't be countered.",
    "strength": "",
    "extra": "",
    "rule_title": "World of Ideas",
    "rule": "The thought world is the sum of all partial thought worlds of the magicians (= cards in his hand). The world of thought is one, but not everything is obvious to the magicians. Many thoughts (cards in his hand) remain covert - in particular secrets that do not have to be revealed on the hand (and also in the library).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 84,
    "title": "Guardian Angel",
    "cost": "3WW",
    "color": "white",
    "type": "Creature, Legend",
    "body": "Can fly.<br>Ask for permission to attack with the Guardian Angel.<br>0, Sacrifice the Guardian Angel: Save your opponent.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Wonders",
    "rule": "Wonders are allowed 2 times per library.",
    "token": "M+iL2dPNEcSwg1Xu9Q68GM6ZF8Fl9jkPOYgdECQHZXI=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 85,
    "title": "Theft of Ideas",
    "cost": "2BB",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Counters a spell;<br>_1_: If that spell is an artifact or creature spell, put it directly into your world.",
    "strength": "",
    "extra": "Funny, that was actually my idea, too.",
    "rule_title": "Punctuation",
    "rule": "The activation costs for effects can be a list of statements separated by a comma. For clarification, each statement begins with a capital letter. If a subordinate clause is necessary for a statement (separated by a comma), it begins with a lower case letter. The effects of a card are statements that each end with a point. If a semicolon appears, then a statement (which begins with an upper case letter) begins, which refers to the statement before it. The statement behind the semicolon can only occur if the preceding effect has occurred. If a semicolon is followed by a lower case letter, the following sentence is only a subordinate clause.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 86,
    "title": "Sparking Fire",
    "cost": "4R",
    "color": "red",
    "type": "Power Spell, Legend",
    "body": "Spread 5 damage over any number of targets.",
    "strength": "",
    "extra": "The stars? Of course - but watch this spectacle!",
    "rule_title": "Fractional Numbers",
    "rule": "If broken numbers appear, they are always rounded up. Found a council, which determines for doubts cases whether for these rounding up should be.",
    "token": "WnLwS27zPSRlhlzyoFN7PZdcU+BxYEXRQaZ0xC2G+zQ=",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 87,
    "title": "Return",
    "cost": "2SS",
    "color": "black",
    "type": "Power Spell",
    "body": "Take a creature from your underworld and place it directly into the world.",
    "strength": "",
    "extra": "Obviously, he didn't like it after all.",
    "rule_title": "Block Incapacitated",
    "rule": "If a creature that has already been declared as a blocker is rendered block ineligible by a quick effect (e.g., tapped, loses flying ability), it still acts as a blocker, but no longer inflicts combat damage.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 88,
    "title": "Healer of Souls",
    "cost": "W",
    "color": "white",
    "type": "Creature",
    "body": "->: Prevent up to 2 damage to one creature.",
    "strength": "0\/1",
    "extra": "Body and soul heal in harmony ever through and from each other.",
    "rule_title": "Card Structure",
    "rule": "At the top left of the card is the spell name (short name), at the top right are the summoning costs, below in the upper half is the picture, below in the upper half are the card types, below is the spell text and in \"...\" below is the wisdom text, which has no effect on the Incantata worlds. Creatures still have Strength\/Resistance at the bottom right.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 89,
    "title": "Retreat",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "Get one Health if you have at least 4 cards in your hand during your Supply Phase.",
    "strength": "",
    "extra": "",
    "rule_title": "Offer and Trade.",
    "rule": "Giving away and exchanging Incantata cards gives the magicians involved the highest magic power. Selling is also allowed, but giving as a gift should be preferred. The Mantra of Purity should not be sold.",
    "pic": true,
    "token": "7BceyCx7AXXwArJwyQMVBigggxhm4dSnP1H65hALdzk=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 90,
    "title": "Crown of Thorns",
    "cost": "2W",
    "color": "white",
    "type": "Creature Enchantment, Legend",
    "body": "Additional summoning costs= Pay 2 Health. Creature gets +4\/+4.",
    "strength": "",
    "extra": "",
    "rule_title": "Culmination",
    "rule": "Card 766 see also Rule 90",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 91,
    "title": "Rose",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Wonder",
    "body": "->,_1_, Sacrifice the Rose: Add one white, green or blue mana to your mana pool; Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Symmetry Break",
    "rule": "The Incanta symmetry break is more than 10E504 (for comparison: the baryon asymmetry of pond physics is about 6.14E10).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 92,
    "title": "Decisive Battle",
    "cost": "2SW",
    "color": "dark_white",
    "type": "Power Spell",
    "body": "Counts as shadow-white card.<br>Destroy all lands.",
    "strength": "",
    "extra": "You knew it would happen eventually.",
    "rule_title": "Self-Answer",
    "rule": "You may respond to a spell you have summoned yourself.",
    "pic": true,
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 93,
    "title": "Double Flash",
    "cost": "1R",
    "color": "red",
    "type": "Instant Spell, Legend",
    "body": "Inflict two damage to any target and one damage to another target.",
    "strength": "",
    "extra": "Frizzle - Frizzle",
    "rule_title": "Incantation",
    "rule": "When a magician cast a spell, it is called a summon. The summoning costs must be spent as well as all phase and speed rules must be obeyed. If so, the spell will appear in the world of ideas. If the Incantatacascade is completed the completion begins (see Actualization). The following applies: \"successfully summoned\" is synonymous with \"realized\".",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 94,
    "title": "Threefolding",
    "cost": "B",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Create 2 copies of an instant or interrupt spell that you do not control; your opponent gains control of one of these copies.",
    "strength": "",
    "extra": "I'm just waiting for the right opportunity.",
    "rule_title": "Copies of Spells",
    "rule": "A copy of a spell is treated as if that spell had been recalled; as if it were on your hand without incurring the cost of recanting it. The speed of the copied spell will not change and it will be appended to the corresponding branch cascade.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 95,
    "title": "Apple",
    "cost": "4GG",
    "color": "green",
    "type": "Power Spell, Legend",
    "body": "Vote with your opponent on how many Health your two souls will be set on; if you do not agree, set them on 19.",
    "strength": "",
    "extra": "Prends une bouchée de cette pomme.",
    "rule_title": "Health",
    "rule": "Each magician begins the Incanata encounter with 21 Health. This applies to a summit tournament. If you don't want to start with 21 Health, you may summon an apple before you start.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 96,
    "title": "Rat",
    "cost": "S",
    "color": "black",
    "type": "Creature",
    "body": "Additional summoning costs= Pay one Health.<br>Don't suffer from summoning dizziness.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Magician's Will",
    "rule": "If the activation cost for an effect is 0, the activation of the effect depends entirely on the will of the controlling magician.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 97,
    "title": "Reflection of Matter",
    "cost": "3B",
    "color": "blue",
    "type": "Creature",
    "body": "Copy a creature.",
    "strength": "*\/*",
    "extra": "Admittedly a consequence of my envy.",
    "rule_title": "Concealment",
    "rule": "If an effect prompts you to show cards in your library or hand, you may, if it is a secret, refuse to execute the effect.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 98,
    "title": "Viking Horde",
    "cost": "3RR",
    "color": "red",
    "type": "Creature",
    "body": "Causes breakthrough damage.",
    "strength": "5\/4",
    "extra": "They were as if out of their senses, swinging axes and shouting; we could not stop them.",
    "rule_title": "Breakthrough Damage",
    "rule": "When a creature with breakthrough damage is blocked, the attacker decides which blocking creatures will receive the combat damage. The difference between the damage inflicted, the attacking creature, and the resistance of the blockers is inflicted as breakthrough damage on the defending magician.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 99,
    "title": "Hemp",
    "cost": "G",
    "color": "green",
    "type": "Creature, Wonder",
    "body": "->: Add one black, red, blue or white mana to your mana pool.",
    "strength": "0\/1",
    "extra": "",
    "rule_title": "Fixation in the World of Ideas",
    "rule": "If a spell is successfully fixed in the world of ideas, it cannot be revoked.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 100,
    "title": "Fire Roller",
    "cost": "4R",
    "color": "red",
    "type": "Power Spell",
    "body": "Annihilate all creatures.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 101,
    "title": "Cleaning",
    "cost": "2W",
    "color": "white",
    "type": "Power Spell",
    "body": "Annihilate all artifacts. <br>_1_: Anililate all artifacts instead of destroying them.",
    "strength": "",
    "extra": "",
    "rule_title": "Exhaustion",
    "rule": "A creature that is resurrected does not leave the world, but is tapped.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 102,
    "title": "Break of Dawn",
    "cost": "2G",
    "color": "green",
    "type": "Power Spell",
    "body": "Destroy all enchantments.",
    "strength": "",
    "extra": "I can only guess, but it's a stripe on the horizon.",
    "rule_title": "Presort",
    "rule": "It is not permitted to pre-sort the library before (and after) the meeting.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 103,
    "title": "Gloominess",
    "cost": "SSSSSS",
    "color": "black",
    "type": "Power Spell",
    "body": "You must sacrifice all celestial bodies. A magician of your choice discards all cards from his hand.",
    "strength": "",
    "extra": "There's nothing left in the end.",
    "rule_title": "Touching Creatures",
    "rule": "Two creatures come into contact in creature combat (one attacks, the other blocks).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 104,
    "title": "Flow of Thoughts",
    "cost": "2B",
    "color": "blue",
    "type": "Power Spell",
    "body": "All magicians discard as many cards as they wish and draw that many new ones.",
    "strength": "",
    "extra": "",
    "rule_title": "Copies - World of Ideas",
    "rule": "If a spell or effect allows you to make copies of spells, this is also possible for spells that have been countered, since every spell you summon will appear in the world of ideas.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 105,
    "title": "Divine Blessing",
    "cost": "3WW",
    "color": "white",
    "type": "Power Spell, Legend",
    "body": "All magicians gain 7 Health and may draw 3 cards.",
    "strength": "",
    "extra": "",
    "rule_title": "Shape-Shifter",
    "rule": "Shapeshifters can be transformed into any creature in the world by the dominating magician before the beginning of his partial round (intermediate phase), or into his primordial form. The shape-shifter always retains the ability of shape-shifting.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 106,
    "title": "Curse",
    "cost": "SS",
    "color": "black",
    "type": "Magician Enchantment",
    "body": "Each time the magician summons a spell, you both have to pay one Health.",
    "strength": "",
    "extra": "",
    "rule_title": "Fortune",
    "rule": "Every Incantata card is a bringer of happiness.",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 107,
    "title": "Refreshment",
    "cost": "W",
    "color": "white",
    "type": "Power Spell",
    "body": "You gain 2 Health. Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Good Reasons",
    "rule": "Among the good reasons for creating mana, besides spending money on summoning and activating spells and effects, are the following:<br>- Using the Tulip\/Rose\/Narcissus effect to draw a card if you're in danger of becoming a martyr this partial round.<br>- Using the Magnolia Flower effect to save a Golden Avatar.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 108,
    "title": "Guard",
    "cost": "1W",
    "color": "white",
    "type": "Creature",
    "body": "->: Inflict one damage to an attacking creature.",
    "strength": "0\/2",
    "extra": "",
    "rule_title": "First Round",
    "rule": "Quick spells may not be summoned in the first round.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 109,
    "title": "Onrush",
    "cost": "1GG",
    "color": "green",
    "type": "Instant Spell",
    "body": "All your creatures temporarily get +1\/+0 and cause breakthrough damage.",
    "strength": "",
    "extra": "",
    "rule_title": "Round Zero",
    "rule": "In the round zero, you may summon the fate you have in your hand. In addition, you may remove the Mantra of Purity in front of you from the game to activate its effect. Otherwise you may not use any other spells or effects.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 110,
    "title": "Justice",
    "cost": "2WW",
    "color": "white",
    "type": "Power Spell",
    "body": "All magicians annihilate so many of their creatures that they all have as many as the one who has the least; But the last creature of each magician does not have to be annihilated.",
    "strength": "",
    "extra": "",
    "rule_title": "Apply",
    "rule": "When you cast a spell, you summon it. When you apply an effect, you activate it.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 111,
    "title": "Astral Vampirism",
    "cost": "1S",
    "color": "black",
    "type": "Power Spell",
    "body": "Additional summoning costs= X Black Mana.<br>Inflict X damage to any target; You gain as many Health as there was damage successfully inflicted to the target.",
    "strength": "",
    "extra": "",
    "rule_title": "Soul",
    "rule": "The life point memory of a magician is also called soul.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 112,
    "title": "Correction",
    "cost": "1BB",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Alternative summoning costs= Return one of your creatures to your hand and pay two Health. A magician of your choice cancels a spell.",
    "strength": "",
    "extra": "I'll save that for later.",
    "rule_title": "Distribution of Copies",
    "rule": "When a spell is copied from a spell and distributed to different magicians, those spells are summoned in turn order, starting with the original spell. If more than one copy has been distributed to one or more magicians, only one spell copy will be summoned per turn.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 113,
    "title": "Praying Mantis",
    "cost": "1GGG",
    "color": "green",
    "type": "Creature",
    "body": "Can block flying creatures.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Attributes",
    "rule": "Properties are permanent effects that are neither conditional nor activatable.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 114,
    "title": "Abnormal Constellation",
    "cost": "1",
    "color": "artifact",
    "type": "Artefact",
    "body": "All magicians can untap at most one celestial body during their renewal phase, or pay one Health for each additional celestial body.",
    "strength": "",
    "extra": "",
    "rule_title": "Chronology",
    "rule": "We write the year 27790 of man, and the year 332790 of the cosmos.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 115,
    "title": "Undead",
    "cost": "1S",
    "color": "black",
    "type": "Creature",
    "body": "_S_: Resurrection.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Resurrection",
    "rule": "A creature that has suffered fatal damage or has been destroyed can be resurrected, that is, the creature regains its full Resistance. If it was successfully resurrected, it never left the world.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 116,
    "title": "Northern Lights",
    "cost": "W",
    "color": "white",
    "type": "Energy Spell, Legend",
    "body": "Add three white mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Excess Mana",
    "rule": "Mana which a magician has accidentally created, which he cannot use, is called Restmana.",
    "pic": true,
    "token": "UoSWAdfutSR8\/2SxETN5rzHjJycAjmgJXlRRRTye9ms=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 117,
    "title": "Cerebral Meltdown",
    "cost": "2B",
    "color": "blue",
    "type": "Instant Spell, Legend",
    "body": "Inflict 4 damage to any target; Inflict 2 damage to yourself.",
    "strength": "",
    "extra": "",
    "rule_title": "Everyone Is Satisfied",
    "rule": "Before the meeting everyone decides how he\/she wants to be addressed and announces this. In the Incantata universe, all magicians are allowed to use this choice when talking about magicians\/magics\/opponents, etc. Example: instead of magician\/opponent, say\/think: witch\/magician\/opponent. Transfer this rule, if desired, also to all cards (e.g. lightbringer -> lightbringer)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 118,
    "title": "Daffodil",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->,_1_, Annihilate the Daffodil: Add one white, green, red, or black mana to your mana pool; Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Color Property",
    "rule": "The color is a property of a card.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 119,
    "title": "Bursting",
    "cost": "2G",
    "color": "green",
    "type": "Power Spell",
    "body": "A creature bursts open, creating X 1\/1 spiders, where X was the creature's summoning cost.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 120,
    "title": "Karstification",
    "cost": "2R",
    "color": "red",
    "type": "Power Spell",
    "body": "Destroy a land.",
    "strength": "",
    "extra": "",
    "rule_title": "Astral Points",
    "rule": "Astral points (AP) are awarded as follows: The defender (see rule 659) cancels the rounds until the attacker becomes a martyr (R). If this is the case, the defender receives R AP. If the number of rounds is not predicted correctly, but the defender wins, the defender receives -1 AP. If the defender loses, he gets -2R AP. The attacker of the encounter receives -2 AP if he becomes a Martyr and +-0 AP if he does not. The attacker can reply to the announcement (temporally-spiritually pre-programmed): \"I am invincible\". In this case, all APs awarded will be doubled (Tournament Incantata, Astral mode).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 121,
    "title": "Blowfish",
    "cost": "B",
    "color": "blue",
    "type": "Creature",
    "body": "_B__B_: -0\/+3",
    "strength": "1\/1",
    "extra": "... FUMP ...",
    "rule_title": "Eons",
    "rule": "The eons have the following animals and plants as symbols: 2.Tiger 3.Hemp 4.Mantis 5.Swan 6.Medusa 7.Swallow 8.Oak 9.Dolphin 10.Owl 11.Elephant 12.Bear 13. Horse 1. Fish.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 122,
    "title": "Demon",
    "cost": "2SS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "Protection from white.<br>The Demon inflicts one damage to you during your supply phase.",
    "strength": "5\/5",
    "extra": "I'll defeat my inner demon just by sicing it on you!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 123,
    "title": "Diversionary Maneuver",
    "cost": "2R",
    "color": "red",
    "type": "Instant Spell",
    "body": "For each blocking creature, you reassign again who to block.",
    "strength": "",
    "extra": "1... 2... 3... You're free!",
    "rule_title": "Astral Value",
    "rule": "The astral value consists of the sum of the astral points that the magician has achieved with his library. (Tournament Incantata, Astral Mode)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 124,
    "title": "Hedgehog",
    "cost": "G",
    "color": "green",
    "type": "Creature",
    "body": "Can only block if none of your creatures blocks the same creature.",
    "strength": "1\/3",
    "extra": "",
    "rule_title": "Round",
    "rule": "A round at Incantata is the sequence of the partial rounds of all magicians involved and is also called Aeon (World Age).",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 125,
    "title": "Disorientation",
    "cost": "R",
    "color": "red",
    "type": "Interrupt Spell",
    "body": "Replace a quick spell with a quick spell from your hand; the target cannot be reselected.<br>_2_: Forgotten.",
    "strength": "",
    "extra": "",
    "rule_title": "Quick Spell",
    "rule": "Quick spells are all spells that are faster than a force spell.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 126,
    "title": "Mental Victory",
    "cost": "XB",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Counter a spell with the summoning cost of X.",
    "strength": "",
    "extra": "I know that you know that I know what I have to do.",
    "rule_title": "Martyr Quota",
    "rule": "The martyr quota is the percentage with which a magician\/library unit ends encounters.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 127,
    "title": "Black Widow",
    "cost": "2S",
    "color": "black",
    "type": "Creature",
    "body": "After the combat phase, decide which creatures that have come into contact with the Black Widow will be destroyed.",
    "strength": "1\/3",
    "extra": "salon-issue-lesson-real-either-supply-until-struggle-fresh-powder-news-option ... maybe next time...",
    "rule_title": "Of Full Age",
    "rule": "Incantata is primarily for smiles, but can also be creepy. That is why Incantata is only suitable for adults (aged\/18+), both in the crypto world and in reality.",
    "pic": true,
    "token": "k6e\/t\/u2uhRv4Wau+OxYnarrLV60cQvESBt4aaDHA64=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 128,
    "title": "Woods of Witches",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "Moon Force, _1_: Add one black mana to your mana pool. <br>Venus Force, _1_: Add one green mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Magician's Vocation",
    "rule": "Incantatazauberei is regarded as honest and recognized work.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 129,
    "title": "Uprising",
    "cost": "2G",
    "color": "green",
    "type": "Instant Spell",
    "body": "All your creatures temporarily get +2\/+0.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 130,
    "title": "Protective Spells",
    "cost": "3W",
    "color": "white",
    "type": "Instant Spell",
    "body": "All your permanent cards are temporarily untouchable and indestructible.",
    "strength": "",
    "extra": "Nothing evil enters this circle.",
    "rule_title": "All Your Cards",
    "rule": "All cards (not permanent cards) are all the cards you have.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 131,
    "title": "Dark Magic",
    "cost": "2SS",
    "color": "light_white",
    "type": "Interrupt Spell, Legend",
    "body": "Counts as light-white card. Counters a spell. Draw a card.",
    "strength": "",
    "extra": "Whoever wants evil does something good.",
    "rule_title": "Legendary",
    "rule": "A creature\/instant spell\/etc with Legend type is also referred to as a Legendary Creature\/legendary instant spell\/etc.",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 132,
    "title": "Metal Man",
    "cost": "1",
    "color": "artifact",
    "type": "Artefact, Creature",
    "body": "Your opponent may look into your cards once per partial round.",
    "strength": "1\/3",
    "extra": "Well meant is sometimes not good enough.",
    "rule_title": "Rules",
    "rule": "All rules are only designed for duels (encounters between two magicians). If you have an encounter with more than 2 magicians, the rules will be interpreted accordingly.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 133,
    "title": "Cherubino",
    "cost": "3WW",
    "color": "white",
    "type": "Creature, Legend",
    "body": "Can fly. Doesn't attack. Can't be countered.",
    "strength": "5\/6",
    "extra": "And the cherub stands before God.",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 134,
    "title": "Changelog",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact",
    "body": "",
    "strength": "",
    "extra": "If you change one thing, everything changes.",
    "rule_title": "Self-Forged",
    "rule": "If a magician begins with fate on the first hand, he may use a homemade fate, which of course must resemble the official version, both in terms of content and size.",
    "minting_cost": "5.1",
    "zite": "13VDeMgRgGf73mHsMrrorXkq4fhUKfBvPz\/134.html",
    "date": 0
},

{
    "card_id": 135,
    "title": "Flounder",
    "cost": "BB",
    "color": "blue",
    "type": "Creature, Wonder",
    "body": "->,_2_: Draw a card; if you are lucky, it is not blue, otherwise discard it.",
    "strength": "1\/1",
    "extra": "Make a wish!",
    "rule_title": "Open Hand",
    "rule": "In a duel, each magician may always show his hand.",
    "pic": true,
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 136,
    "title": "Rock Formation",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "Mars Force, _1_: Add one red mana to your mana pool. <br>Sun Force, _1_: Add one white mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "End of Encounter",
    "rule": "The magician who no longer has Health and\/or can no longer draw a card from his library, but if he must, is the martyr of the encounter.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 137,
    "title": "Sailing Yacht",
    "cost": "W",
    "color": "white",
    "type": "Creature, Legend, Indestructible",
    "body": "Can't be the target of spells.<br>Skip your Attack Phase.<br>Declare an Attack Phase: Sacrifice the Sailing Yacht.",
    "strength": "0\/1",
    "extra": "Seaworthy!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 138,
    "title": "Beach",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "Sun Force, _1_: Add one white mana to your mana pool. <br>Moon Force, _1_: Add one black mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Fortuity",
    "rule": "The pre-sorting of the library before and after the meeting is not permitted.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 139,
    "title": "Sjávareldfjall",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "Saturn Force, _1_: Add one blue mana to your mana pool. <br>Mars Force, _1_: Add one red mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Untouchable",
    "rule": "Who cannot be controlled without the consent of the controlling magician is untouchable.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 140,
    "title": "Mangroves",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "Venus Force, _1_: Add one green mana to your mana pool. <br>Saturn Force, _1_: Add one blue mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Rule",
    "rule": "If no effect or spell is allowed, no magician may shuffle or look into his library. If an effect allows a magician to look into his library, he has to shuffle afterwards.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 141,
    "title": "Collapse",
    "cost": "3R",
    "color": "red",
    "type": "Power Spell",
    "body": "Destroy an artifact; The controller of that artifact will receive damage equal to the summoning cost of that artifact.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 142,
    "title": "Shock Wave",
    "cost": "R",
    "color": "red",
    "type": "Power Spell",
    "body": "All nonflying creatures receive one damage.",
    "strength": "",
    "extra": "",
    "rule_title": "Sideboard",
    "rule": "Every magician can have a sideboard. This consists of 13 cards and the magician may exchange cards between the library and the sideboard between encounters. (Tournament Incantata)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 143,
    "title": "Angel of Death",
    "cost": "2SSS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "Can fly.<br>Cannot block.<br>->: Target creature cannot be resurrected temporarily.",
    "strength": "5\/5",
    "extra": "All you have to do to conquer death is die.",
    "rule_title": "Exchange of Places",
    "rule": "After the encounter has begun, you cannot just switch places; you need a card or effect that allows you to do so.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 144,
    "title": "Quartex",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "Jupiter Force, ->: Add 2 colorless mana to your mana pool; Use that mana only for artifacts.<br> 0: Save excess mana of your opponent in the Quartex.<br>->: Add all saved mana to your mana pool.",
    "strength": "",
    "extra": "",
    "rule_title": "Quartex",
    "rule": "\"Use that mana for artifacts only\" means: For artifact spells and species effect costs.<br><br><i>Again a funny thing.<\/i>",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 145,
    "title": "Comet",
    "cost": "RR",
    "color": "red",
    "type": "Power Spell, Legend",
    "body": "All magicians draw a card from their ecliptic.",
    "strength": "",
    "extra": "",
    "rule_title": "Councils",
    "rule": "Among other things, the following questions should be answered by councils:<br>* What is a good reason to generate mana.<br>* What is the opposite of what spell (creatures have no opposite)<br>* When should be rounded up or down.<br>(vrgl. Rule 836,735)<br>* Which language clone per language is the best",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 146,
    "title": "Hornet Swarm",
    "cost": "XG",
    "color": "green",
    "type": "Power Spell",
    "body": "All flying creatures take X damage.",
    "strength": "",
    "extra": "",
    "rule_title": "Tournament Modes",
    "rule": "There are 3 official tournament modes (all in the Swiss system), of which the Magician's Accord is always played on a summit tournament: 1. Domination (libraries are not swapped before, better library value wins) 2. Astral Mode (libraries are not swapped before, better astral value wins) 3. Magician's Accord (libraries are swapped before, better library value wins)",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 147,
    "title": "Totem",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact",
    "body": "->,_2_: Counters an activatable effect of a lead card.",
    "strength": "",
    "extra": "",
    "rule_title": "Activatable Effects",
    "rule": "Activatable effects are effects that require the expenditure of activation costs (Always to the left of a colon \":\"). Lead cards may also have properties and conditional effects.",
    "pic": true,
    "token": "0ts8w3sJAylNtl3GYIljsNDxUKjC2I9ZZdV45A+9NxQ=",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 148,
    "title": "Maze",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact, Rarity",
    "body": "All magicians receive 2 damage for each card they draw from their library, which is not the first of their draw phase. Each magician can pay one life point to not draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "Conditional Effects",
    "rule": "Conditional effects of Permanent Cards are effects that cannot be activated directly by the Dominating Magician, but are triggered by something in the course of the world. Spells can also have conditional effects.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 149,
    "title": "Spirit-Matter-Barrier",
    "cost": "2B",
    "color": "blue",
    "type": "Interrupt Spell, Legend",
    "body": "Can not be targeted by spells. Counters a matter spell.",
    "strength": "",
    "extra": "Insurmountable.",
    "rule_title": "Actualization",
    "rule": "If an Incantataka cascade is completed, then the spells, which are not countered and not removed from the world of ideas, will be executed according to the rules concerning the order, then <b>realized<\/b>. That means they unfold their magical effect.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 150,
    "title": "Desolation",
    "cost": "S",
    "color": "black",
    "type": "Land Enchantment, Multiplicity",
    "body": "Strain: _S_.<br>The land can't transform no mana anymore.",
    "strength": "",
    "extra": "Now look at the result of your own actions.",
    "rule_title": "Targeted Enchantments",
    "rule": "If the type of a card is a targeted enchantment, the card type becomes a composite word consisting of the word enchantment and the valid target for that enchantment. For example: land enchantment. If in the instruction block then the talk is of \"the country\", the enchanted country is naturally meant.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 151,
    "title": "Transcendental Meditation",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->,_2_: Draw a card from your library and place it face-up in front of you; Summon that card as if it were in your hand. If you have not summoned it by the beginning of your next partial round, place it in your underworld.",
    "strength": "",
    "extra": "",
    "rule_title": "Causes",
    "rule": "The causes are of spiritual substance.",
    "pic": "true",
    "minting_cost": "5.1",
    "taken": true,
    "date": 0
},

{
    "card_id": 152,
    "title": "Gust",
    "cost": "1G",
    "color": "green",
    "type": "Instant Spell",
    "body": "Annihilate a flying creature.",
    "strength": "",
    "extra": "",
    "rule_title": "Draw Phase",
    "rule": "During the draw phase, the Magician always draws a card, unless an effect or spell dictates otherwise. You may not cast spells or apply effects during the draw phase. If several cards are to be drawn, this is done as one action. If a magician is stopped drawing X cards in his draw phase, he draws exactly X cards in his draw phase.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 153,
    "title": "Rotting",
    "cost": "1SS",
    "color": "black",
    "type": "Creature Enchantment",
    "body": "Place a -1\/-1 counter on the creature in the controller's supply phase. When the creature leaves the world, its ruler chooses a new target for Rotting; if there is no valid target in the world, Rotting is annihilated.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 154,
    "title": "Air Elementary",
    "cost": "1BB",
    "color": "blue",
    "type": "Creature, Legend",
    "body": "Can fly. Do not suffer from summoning dizziness. Take Air Elementary back to your hand at the end of your partial round.",
    "strength": "3\/1",
    "extra": "",
    "rule_title": "Onceness",
    "rule": "A onceness may only be successfully summoned (realized) once per encounter. In addition, a onceness is only permitted once per library.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 155,
    "title": "Intimidation",
    "cost": "RR",
    "color": "red",
    "type": "Interrupt Spell, Legend",
    "body": "Counters a spell; Add the summoning cost of the countered spell to your mana pool; if you do not use that mana, you will receive damage equal to the excess mana amount.",
    "strength": "",
    "extra": "",
    "rule_title": "Mixed Summoning Costs",
    "rule": "The color of a card is determined by the color of the mana of summoning costs, unless otherwise stated. If the summoning cost is composed of different types of Mana, the color of the card is determined by the first type of Mana of the summoning cost.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 156,
    "title": "Seahorse",
    "cost": "B",
    "color": "blue",
    "type": "Creature, Wonder",
    "body": "->: Add 2 blue mana to your mana pool; use that mana for quick spells only.",
    "strength": "0\/1",
    "extra": "Evermore",
    "rule_title": "Last Chance",
    "rule": "A library with a library value of <50:<50 is a power library, one with a library value of >50:>50 is a redemption library, and one with a library value of <50:>50 is a magic library. It is true that a magic library is more desirable than a power library; a power library is more desirable than a salvation library.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 157,
    "title": "Sacrificial Lamb",
    "cost": "2S",
    "color": "black",
    "type": "Creature",
    "body": "->, Destroy the sacrificial lamb: Add 3 black mana to your mana pool.",
    "strength": "2\/2",
    "extra": "",
    "rule_title": "Effects Of Spells",
    "rule": "Often spells have only one effect. But there are also spells that can have multiple effects. If the effects are separated by a dot (.), those effects are realized one after the other (see rule 642), no matter if one is not realized or not. If the effects are separated by a semicolon (;), the following effect depends on the successful actualization of the previous effect (dependent effect). There are also activatable effects for spells (see card 85) (see rule 757). If a spell can only counter one effect of a spell, but there are more effects, those will be handled accordingly.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 158,
    "title": "Ice Age",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact",
    "body": "Lands can only transform one mana per round.",
    "strength": "",
    "extra": "",
    "rule_title": "Trust",
    "rule": "Incantata is perfected by the magical, real encounter.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 159,
    "title": "Fairy Soul",
    "cost": "GG",
    "color": "green",
    "type": "Creature Enchantment",
    "body": "The creature can now fly and must be blocked by all creatures that can.",
    "strength": "",
    "extra": "",
    "rule_title": "Strain",
    "rule": "The cost of summoning a spell with Strain increases by the initial cost of the card, each time the spell is summoned.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 160,
    "title": "Masterpiece",
    "cost": "2RR",
    "color": "red",
    "type": "Power Spell, Legend",
    "body": "Create a copy of an artifact.",
    "strength": "",
    "extra": "The guild doesn't demand much, it just has to be perfect.",
    "rule_title": "The same Library",
    "rule": "A library remains the same if it is not changed, or if only one card at most is changed between 2 encounters.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 161,
    "title": "Gentleness",
    "cost": "G",
    "color": "green",
    "type": "Interrupt Spell",
    "body": "A creature temporarily has Strength 0; Draw a card.",
    "strength": "",
    "extra": "Every beast can be tamed by a gifted magician.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "518",
    "date": 0
},

{
    "card_id": 162,
    "title": "Golden Eagles",
    "cost": "2R",
    "color": "red",
    "type": "Creature",
    "body": "Can fly.<br>_R_: Temporary +0\/+1",
    "strength": "2\/2",
    "extra": "",
    "rule_title": "Cryptomagician Stage",
    "rule": "The cryptomagician level is determined by: (842- lowest cryptocard_id) + ((highest cryptocard_id of the longest, uninterrupted (of those that have already been embossed) cryptocard series of 1) -1)",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 163,
    "title": "Tin Soldier",
    "cost": "3",
    "color": "artifact",
    "type": "Artefact, Creature",
    "body": "->,_1_: Inflict one damage to any target.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 164,
    "title": "Octopus Stabbing",
    "cost": "2B",
    "color": "blue",
    "type": "Power Spell",
    "body": "Destroy two blue creatures.",
    "strength": "",
    "extra": "The main thing is, you're far enough away.",
    "rule_title": "Impact Assessment",
    "rule": "The effect of a spell is determined by its spell name.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 165,
    "title": "Tornado",
    "cost": "2B",
    "color": "blue",
    "type": "Power Spell",
    "body": "Destroy all flying creatures.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 166,
    "title": "Ogre",
    "cost": "5R",
    "color": "red",
    "type": "Creature, Legend",
    "body": "When the Ogre comes into the world, all creatures take 2 damage.",
    "strength": "5\/5",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 167,
    "title": "El Capitan",
    "cost": "1SS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "All black creatures get +1\/+1.",
    "strength": "1\/1",
    "extra": "Scoundrel, you bastard!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 168,
    "title": "Rebel",
    "cost": "WWW",
    "color": "white",
    "type": "Creature, Legend",
    "body": "Additional summoning costs= Sacrifice your Golden Avatar.<br>Causes breakthrough damage.<br>_3_: Forget.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Forget, Remember",
    "rule": "When using the Forgotten and Remember spell effects, the spell is not summoned.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 169,
    "title": "Fire Oracle",
    "cost": "RS",
    "color": "red",
    "type": "Enchantment",
    "body": "->,_1_: Show the card you have just drawn; if it is a land, you can draw another card.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 170,
    "title": "House",
    "cost": "1",
    "color": "artifact",
    "type": "Artefact",
    "body": "You may always have more than 7 cards in your hand. <br>->: Place one card from your hand under your library.",
    "strength": "",
    "extra": "The study of magic literature requires not only calm, but also a certain cosiness.",
    "rule_title": "Discarding",
    "rule": "At the end of the discard phase, the active player must have discarded all but 7 cards.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 171,
    "title": "Mudslide",
    "cost": "GGG",
    "color": "green",
    "type": "Power Spell",
    "body": "Destroy all nonflying creatures.",
    "strength": "",
    "extra": "",
    "rule_title": "Don't forget",
    "rule": "Incantata becomes more successful with each other than against each other.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 172,
    "title": "Killer Bee",
    "cost": "GG",
    "color": "green",
    "type": "Creature",
    "body": "Can fly.<br>Does not suffer from summoning dizziness.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Cleansing",
    "rule": "A magician can always transform colored mana into a colorless mana with dreaming speed.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 173,
    "title": "Axolotl",
    "cost": "WWW",
    "color": "white",
    "type": "Creature, Legend",
    "body": "_W_: Reduce the damage from one source to you to 1.",
    "strength": "0\/2",
    "extra": "",
    "rule_title": "Damage Reduction",
    "rule": "The reduction of damage is considered as prevention of damage.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 174,
    "title": "Rainbow",
    "cost": "1B",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Change a color word of a spell. Draw a card.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 175,
    "title": "Cloud Horses",
    "cost": "1BB",
    "color": "blue",
    "type": "Creature, Legend",
    "body": "Can fly.<br>All flying creatures get +1\/+1.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Easter Egg",
    "rule": "172nCFMgaVNEoWZAi<br>KwHu8G1LXqA3gxMag",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 176,
    "title": "Scorpion Tear",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "If you draw the Scorpion Tear you get 2 damage; if you keep it secret it, but it comes out, you get 7 damage ->: Spontaneously mix your underworld with the Scorpion Tear into your library.",
    "strength": "",
    "extra": "",
    "rule_title": "Jail",
    "rule": "Those who build a prison, when the day comes, come into that very one.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 177,
    "title": "Mole Machine",
    "cost": "5",
    "color": "artifact",
    "type": "Artefact, Creature",
    "body": "Cannot be blocked by flying creatures.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Targets",
    "rule": "If a target is mentioned, it refers to a magician, a permanent card, one of the worlds (library, hand, etc.) or a mana pool. Spells that are not yet realized are targeted.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 178,
    "title": "Imperial Crown",
    "cost": "3",
    "color": "artifact",
    "type": "Artefact, Uniqueness",
    "body": "->,_5_: Your opponent gives you a card from his hand, but quite politely; Activate this effect like a force spell.",
    "strength": "",
    "extra": "Ruler by God's Grace.",
    "rule_title": "Unique",
    "rule": "A uniqueness can only be once in the world. If there is a uniqueness in the world, no effect or spell can be used to bring another uniqueness of this kind into the world. In addition, a uniqueness is only allowed once per library.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 179,
    "title": "Prophet of Lies",
    "cost": "S",
    "color": "black",
    "type": "Creature",
    "body": "_1_: Add one black mana to your mana pool.",
    "strength": "1\/1",
    "extra": "The light of heaven is given to you, and you corrupt it!",
    "rule_title": "Light And Shadow",
    "rule": "All spells and effects that affect white card\/spells also affect shadow-white ones. All spells that affect black cards\/spells also affect light-black ones.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 180,
    "title": "Lotus",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->,_4_, Discard a card, transfer control of the Lotus to your opponent: Summon your opponent's last spell, which was cast when the Lotus was already in your world.",
    "strength": "",
    "extra": "",
    "rule_title": "Incantata",
    "rule": "But in the deepest swamp the lotus blossom blossoms.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 181,
    "title": "Dog",
    "cost": "WW",
    "color": "white",
    "type": "Creature, Wonder",
    "body": "You can also summon the Dog as an instant spell.",
    "strength": "0\/4",
    "extra": "Always ready to protect you.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 182,
    "title": "Land Slug",
    "cost": "3S",
    "color": "black",
    "type": "Creature",
    "body": "->: Place a copy of this Land Slug in the world. <br>An enemy may block as many Land Slugs as he wants with one creature.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 183,
    "title": "Dragon Slaughter",
    "cost": "2RR",
    "color": "red",
    "type": "Instant Spell, Legend",
    "body": "Destroy a creature: You and your opponent each receive as much colorless mana as the creature's summon cost has been; If your opponent does not want to add his share to his mana pool, it expires.",
    "strength": "",
    "extra": "",
    "rule_title": "Announcement",
    "rule": "After you have removed the Mantra of Purity, any magician in his main phase can announce that his opponent will become a martyr. Do this preferably with the words: \"お前はもう死んでいる (Omae wa mou shindeiru)\". Thus the announcer becomes the defender and his opponent becomes the attacker. The defender states the number of rounds (starting at 0) it will take for the attacker to become a martyr. You can only announce in its main phase. The attacker acknowledges his role by proclaiming (temporally and spiritually pretransferred) \"I am insurmountable\".",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 184,
    "title": "Assertiveness",
    "cost": "G",
    "color": "green",
    "type": "Interrupt Spell",
    "body": "Alternative summoning costs= Choose a color, discard a card that has that color, Pay one Health.<br>Render a target spell uncounterable.",
    "strength": "",
    "extra": "",
    "rule_title": "Defense Art",
    "rule": "Incantata is the highest art of defense.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 185,
    "title": "Titanium",
    "cost": "4BB",
    "color": "blue",
    "type": "Creature, Legend",
    "body": "Additional summoning costs= Choose a flying creature; the owner must put that creature in his hand.<br>Can fly.",
    "strength": "5\/6",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 186,
    "title": "Memory Manipulation",
    "cost": "3S",
    "color": "black",
    "type": "Power Spell",
    "body": "Cancel a spell from your last partial round.",
    "strength": "",
    "extra": "How am I to be found guilty of lying this way?",
    "rule_title": "Withdrawal of Spells.",
    "rule": "If a spell is removed, it will be put back into the hand and the spell will be removed from the world of ideas, but summoning costs will not be removed. If a point is not explicitly mentioned in the world run (e.g. \"last round\"), only one spell in the still active Incantatacascade can be withdrawn.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 187,
    "title": "Challenge",
    "cost": "2R",
    "color": "red",
    "type": "Instant Spell",
    "body": "Summon the challenge before the attack phase. The active magician attacks with all creatures that can.",
    "strength": "",
    "extra": "",
    "rule_title": "Active, Passive",
    "rule": "The magician whose partial round is in progress is the active magician, all others are passive mages.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 188,
    "title": "Fortune Spell",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell, Legend",
    "body": "Choose one of the following effects * Prevent up to 3 damage from one source. * Receive one Health for each source that inflicts damage to you in this partial round. * Counters a spell or activatable effect if its controller does not pay _1_.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 189,
    "title": "Iron Maiden",
    "cost": "R",
    "color": "red",
    "type": "Magician Enchantment",
    "body": "The Magician gets one damage if he has 4 or more cards in his hand during his supply phase.",
    "strength": "",
    "extra": "But nice and slow.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 190,
    "title": "Cockatoo",
    "cost": "2G",
    "color": "green",
    "type": "Creature",
    "body": "Can fly.<br>_G_: Resurrection.<br>->,_1_: Add one green mana to your mana pool.",
    "strength": "1\/1",
    "extra": "Lora's here! Lora's here!",
    "rule_title": "Clues",
    "rule": "When a creature is successfully summoned and thus realized, it has no worldly evidence of the existence of magicians.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 191,
    "title": "Cheerful Serenity",
    "cost": "WW",
    "color": "white",
    "type": "Instant Spell",
    "body": "You and your creatures cannot be the target of spells in the next partial round; Draw a card.",
    "strength": "",
    "extra": "If you want to confuse someone, try to give them something for free.",
    "rule_title": "For Nothing",
    "rule": "At the end of the encounter, all permanent cards (except lands, space-time structures and celestial bodies) are nullified. This means that they are treated as if they had never been there (in the \"game world\" i.e. the \"game world\" is completed). Lands, space-time structures and celestial bodies are transcendent (just like the world of ideas), that is, they have always been there. Lands, space-time structures and celestial bodies thus appear in the world as images of their natural development.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 192,
    "title": "Monastery Library",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->,_2_: If you do not have any card in your hand, you may draw a card.",
    "strength": "",
    "extra": "Many a secret scripture is hidden here.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 193,
    "title": "Dreamed Unicorn",
    "cost": "WW",
    "color": "white",
    "type": "Creature, Multiplicity",
    "body": "Alternative summoning costs: _W__B_.<br>When there is more than one dreamed unicorn in the world, all dreamed unicorns are green 2\/3 creatures.",
    "strength": "0\/3",
    "extra": "Millions...",
    "rule_title": "Appearance",
    "rule": "Unicorns appear at exactly the right time.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 194,
    "title": "Dark Aura",
    "cost": "1S",
    "color": "black",
    "type": "Creature Disenchantment",
    "body": "Can be summoned like an instant spell. Enchantments have no effect on the creature.",
    "strength": "",
    "extra": "",
    "rule_title": "Disenchantments",
    "rule": "Disenchantments have the same rules as Enchantments, but enchantment related spells do not affect Disenchantments.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 195,
    "title": "Mirror Shield",
    "cost": "0",
    "color": "light_grey",
    "type": "Energy Spell, Legend",
    "body": "Counts as light-grey card. Select a new target for an activatable effect.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 196,
    "title": "Honey Badger",
    "cost": "1GGG",
    "color": "green",
    "type": "Creature, Legend",
    "body": "The Honey Badger always attacks.<br>Causes breakthrough damage.",
    "strength": "4\/4",
    "extra": "That doesn't matter to the honey badger.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 197,
    "title": "Combat Reproduction",
    "cost": "GG",
    "color": "green",
    "type": "Enchantment",
    "body": "Each magician may place one copy of one creature in his world; Annihilate those creatures when the Combat Reproduction leaves the world.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 198,
    "title": "Crazy Scientist",
    "cost": "RRR",
    "color": "red",
    "type": "Creature",
    "body": "All artifact creatures get +1\/+1.",
    "strength": "1\/2",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 199,
    "title": "Spell Assistant",
    "cost": "2B",
    "color": "blue",
    "type": "Creature",
    "body": "->: Swap by interrupting the order of two spells.",
    "strength": "1\/2",
    "extra": "Upsi!",
    "rule_title": "Only a Recommendation",
    "rule": "Summon the Spell Assistant with Blumenmana if possible.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 200,
    "title": "Opening",
    "cost": "3R",
    "color": "red",
    "type": "Power Spell, Legend",
    "body": "All magicians successively destroy one third of their lands, creatures, artifacts, and enchantments.",
    "strength": "",
    "extra": "It would be better now to understand.",
    "rule_title": "One After the Other",
    "rule": "If a spell triggers multiple effects one after the other (or has multiple effects separated with . or dependent effects separated with ;), they will be treated as single spells and added to the cascade accordingly - the last one first. All effects of the spell are added to the cascade at the same time. This also means that the summoning magician must commit himself to any effects that require a decision or activation cost when summoning. The settlement conditions for dependent securities (with ; separated) are checked during settlement of the cascade. The total spell is to be thought as a bracket around the set of effects and, if countered, is countered altogether.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 201,
    "title": "Time Echo",
    "cost": "B",
    "color": "blue",
    "type": "Interrupt Spell",
    "body": "Make a copy of your opponent's spell from the last partial round and transfer its control to your opponent.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 202,
    "title": "Overgrowing",
    "cost": "2G",
    "color": "green",
    "type": "Power Spell",
    "body": "Turn a land into a forest.",
    "strength": "",
    "extra": "Nature takes everything back.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 203,
    "title": "Kintsugi",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell",
    "body": "Repair a permanent card that is not a creature.",
    "strength": "",
    "extra": "Now it's perfect.",
    "rule_title": "Repair",
    "rule": "Repairing is similar to resurrecting creatures.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 204,
    "title": "Messenger of Hell",
    "cost": "SSS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "Can fly. <br>When the Messenger of Hell has inflicted damage to a magician, that magician discards a card from his hand.",
    "strength": "2\/2",
    "extra": "Some things are better forgotten.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 205,
    "title": "Field Negotiations",
    "cost": "1W",
    "color": "white",
    "type": "Enchantment",
    "body": "Before the start of each partial round, agree with your opponent the maximum number of spells that can be summoned by each magician in the next partial round; If you do not agree, you may summon a maximum of 2 spells per magician.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 206,
    "title": "A-Nerin-Daág",
    "cost": "1W",
    "color": "white",
    "type": "Interrupt Spell",
    "body": "Counters a spell that has damage potential.",
    "strength": "",
    "extra": "A spell from times long gone.",
    "rule_title": "Damage Potential",
    "rule": "A creature spell that would produce a creature that has 0 Strength or cannot attack has no damage potential. Creature spells of augmentable creatures have damage potential",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 207,
    "title": "True Warrior",
    "cost": "2SSWW",
    "color": "light_black",
    "type": "Creature, Legend",
    "body": "Counts as light-black card. Remove all creatures fighting the True Warrior from the world after the battle.<br>_2__S__S__W__W_: Summon the True Warrior from the underworld as if it were in your hand.",
    "strength": "4\/4",
    "extra": "",
    "rule_title": "Lucky Card Throw",
    "rule": "If a card requests a luck card throw, the rules for luck card throwing (hand position, height, balanced plastic card etc.) are chosen in such a way that always the best Incantata-random-card-throwing-machine cannot acquire a statistically significant advantage under these rules.",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 208,
    "title": "Magnolia Flower",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, Sacrifice the Magnolia Flower, Tap a Golden Avatar: Add one white mana to your mana pool.<br>->, Sacrifice the Magnolia Flower, Sacrifice a land: You gain 2 Health.",
    "strength": "",
    "extra": "Not everyone is worthy of her.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 209,
    "title": "Amnesia",
    "cost": "SS",
    "color": "black",
    "type": "Power Spell, Legend",
    "body": "A magician chooses 2 cards from his hand and discards them.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 210,
    "title": "Pain",
    "cost": "R",
    "color": "red",
    "type": "Instant Spell",
    "body": "Deal one damage to any target. _4_: Remembering",
    "strength": "",
    "extra": "Sometimes it is instructive to at least remember the pain.",
    "rule_title": "Remembering",
    "rule": "A recall spell can be taken back from the underworld if it has been cast at least once. The speed for this is instant spell speed.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 211,
    "title": "Shamrock",
    "cost": "0",
    "color": "white",
    "type": "Instant Spell, Legend",
    "body": "Counts as white card. Your opponent chooses a card from your library. Take that card in your hand.",
    "strength": "",
    "extra": "Virtues are rewards, rewards are virtues.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 212,
    "title": "Flightless Sparrow",
    "cost": "G",
    "color": "green",
    "type": "Creature, Legend",
    "body": "Luck Card Throw: In your favor => Temporary +1\/+1 and Flying, Against your favor => Becomes a 0\/1 creature without flying and you can no longer activate this effect this turn.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 213,
    "title": "Night Sunflower",
    "cost": "S",
    "color": "black",
    "type": "Creature, Legend",
    "body": "->,_1_: Save one moon-mana in the Night Sunflower. ->Add one previously saved mana as a white mana to your mana pool.",
    "strength": "0\/1",
    "extra": "Its beauty is only fully visible through the night.",
    "rule_title": "Celestial Mana",
    "rule": "The different celestial bodies provide mostly colourless mana, but the origin can still be important. For example, the moon provides „moon-mana“.",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 214,
    "title": "Time Manipulation",
    "cost": "1B",
    "color": "blue",
    "type": "Instant Spell, Legend",
    "body": "Skip the next partial round: Have another partial round after your next partial round.",
    "strength": "",
    "extra": "At first it looks like a retreat...",
    "rule_title": "Healing",
    "rule": "After a partial round, all creatures have their Strength and Resistance restored.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 215,
    "title": "Bloody Slaughter Festival",
    "cost": "3SS",
    "color": "black",
    "type": "Power Spell, Legend",
    "body": "Sacrifice a creature: Your opponent sacrifices 2 creatures; Untap 2 celestial bodies.",
    "strength": "",
    "extra": "At first one is afraid...",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 216,
    "title": "Woodruff",
    "cost": "2G",
    "color": "green",
    "type": "Instant Spell, Legend",
    "body": "Shuffle a creature from your hand into your library; Draw 3 cards.",
    "strength": "",
    "extra": "A Special Plant.",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 217,
    "title": "Duplicate",
    "cost": "2B",
    "color": "blue",
    "type": "Interrupt Spell, Legend",
    "body": "Copy a spell you have already summoned this partial round and pay its summoning cost.",
    "strength": "",
    "extra": "δ",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 218,
    "title": "Blood-Sky Full Moon",
    "cost": "1SS",
    "color": "black",
    "type": "Enchantment, Legend",
    "body": "Each magician pays one life point for each untapped celestial body before the start of his partial round; this effect only takes effect before the start of your next partial round.",
    "strength": "",
    "extra": "",
    "rule_title": "Faith",
    "rule": "Grand magicians are completely trustworthy.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 219,
    "title": "Devilish Contract",
    "cost": "S",
    "color": "black",
    "type": "Power Spell, Legend",
    "body": "Take a card from your library into your hand. Randomly take a card from your library and shuffle it into your opponent's library; he may pay the summoning cost of that card with colorless mana.",
    "strength": "",
    "extra": "",
    "rule_title": "Rescuing",
    "rule": "Saving his opponent means:- his Health will be set to 1 if he has 0 or less<br>- he does not have to draw a card in case he has no more cards in his library.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 220,
    "title": "Thunderclap",
    "cost": "RR",
    "color": "red",
    "type": "Power Spell, Wonder",
    "body": "All creatures take 2 damage.",
    "strength": "",
    "extra": "By the time you hear the thunder, it's already too late.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 221,
    "title": "Ariadne's Thread",
    "cost": "2B",
    "color": "blue",
    "type": "Enchantment, Legend",
    "body": "->,_1_: Look at the top 3 cards in your library and put them back face up or face down in any order. <br>->: Massively shuffle one card from your hand into your library.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 222,
    "title": "Archer",
    "cost": "1G",
    "color": "green",
    "type": "Creature, Legend",
    "body": "->: Inflict 2 damage to an attacking flying creature.",
    "strength": "1\/2",
    "extra": "With the eyes of the eagle, with the soul of the true warrior.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 223,
    "title": "Liberation",
    "cost": "W",
    "color": "white",
    "type": "Instant Spell",
    "body": "Destroy all Enchantments and Counters on a creature. _W__W__W__W__W_: Remember.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 224,
    "title": "Soul Aspiration",
    "cost": "1S",
    "color": "black",
    "type": "Interrupt Spell",
    "body": "Sacrifice a Creature: You lose all Health; Gain as many Health as the sacrificed creature had Resistance.",
    "strength": "",
    "extra": "Now it's your turn!",
    "rule_title": "Consistent",
    "rule": "One must always cast spells with certainty; that is to say, the withdrawal of spells without a suitable card is not permitted.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 225,
    "title": "Morning Star",
    "cost": "B",
    "color": "blue",
    "type": "Instant Spell, Legend",
    "body": "Part of a cascade of three instant spells. All magicians may draw up to 4 cards, but only up to a maximum of 7 in their hand.",
    "strength": "",
    "extra": "Endless patience ... that means recognizing the right time!",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 226,
    "title": "Inquisitiveness",
    "cost": "1W",
    "color": "white",
    "type": "Interrupt Spell, Legend",
    "body": "Look at the top 3 cards of your library and discard them in any order; Draw a card.",
    "strength": "",
    "extra": "Be forgiven.",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 227,
    "title": "Time Twinkle",
    "cost": "1B",
    "color": "blue",
    "type": "Instant Spell",
    "body": "Take one of your artifacts back to your hand and place it in your world later in this round without paying the summoning costs.",
    "strength": "",
    "extra": "",
    "rule_title": "Rewards",
    "rule": "You're rewarded for honest efforts.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 229,
    "title": "Leather Armor",
    "cost": "4",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "Reduce damage by one per source.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 230,
    "title": "Strongly Hopped Beer",
    "cost": "3GG",
    "color": "green",
    "type": "Power Spell, Legend",
    "body": "Summon this partial round only this spell; In your next partial round your celestial bodies produce _1_ more each.",
    "strength": "",
    "extra": "It refreshes enormously",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 231,
    "title": "Concentration",
    "cost": "0",
    "color": "red",
    "type": "Power Spell",
    "body": "Additional summoning costs: Pay _2_ in your next summoning phase. Counts as red card. You may also summon Concentration in the main phase of your opponent. Counter a force spell. _2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "The cat belongs to the house.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 232,
    "title": "Flaming Horse Rider",
    "cost": "2RR",
    "color": "red",
    "type": "Creature, Legend",
    "body": "All magicians must always attack with all creatures that can.",
    "strength": "1\/2",
    "extra": "Blessed is the one who has another profession.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 233,
    "title": "Black Rider",
    "cost": "3SSS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "Each creature receives a -1\/-1 counter at each Supply Phase.",
    "strength": "6\/6",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 234,
    "title": "Tobacco Pipe",
    "cost": "2",
    "color": "artifact",
    "type": "Artefact",
    "body": "Each magician may only summon one quick spell per partial round.",
    "strength": "",
    "extra": "A good pipe turns a cabin into a palace.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 235,
    "title": "Enforcement",
    "cost": "4RR",
    "color": "red",
    "type": "Power Spell",
    "body": "Swap places with a magician.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 236,
    "title": "Nameless Person",
    "cost": "4",
    "color": "artifact",
    "type": "Creature, Legend",
    "body": "Forseless Incarnation.<br>Can't be the target of spells.<br>All your spells cost _1_ less.<br>_6_: Unique Memory.",
    "strength": "4\/4",
    "extra": "Right on time.",
    "rule_title": "Determination",
    "rule": "If you start with a destiny, you have a destiny. If you start destinyless, but draw one, then you have a destiny. If you have no destiny, you are destinyless. If you're destinyless, you can summone a destinyless incarnation. If you have a destinyless incarnation under your control and receive a destiny, the destinyless incarnation will be removed from the world.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 237,
    "title": "World Peace",
    "cost": "W",
    "color": "white",
    "type": "Enchantment",
    "body": "Force spells can no longer be summoned.",
    "strength": "",
    "extra": "The sparrows whistle it off the roofs.",
    "rule_title": "Underage",
    "rule": "Immaturity is the inability to use one's mind without the guidance of another. This immaturity is self-inflicted if the cause of it lies not in the lack of understanding, but in the resolution and courage to make use of it without the guidance of another.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 238,
    "title": "Faith",
    "cost": "G",
    "color": "green",
    "type": "Enchantment, Wonder, Indestructible",
    "body": "If another magician who is not you also has a Faith under his control, you can draw 2 cards each during your draw phase.",
    "strength": "",
    "extra": "Don't be surprised about the magical effect!",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 248,
    "title": "Hilly Landscape",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "->,_1_: Add one red mana to your mana pool.<br>_1_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 249,
    "title": "Nourishment",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "->,_1_: Add one blue mana to your mana pool.<br>_1_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 250,
    "title": "Grove",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "->,_1_: Add one green mana to your mana pool.<br>_1_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 251,
    "title": "Ravine",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "->,_1_: Add one black mana to your mana pool.<br>_1_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 252,
    "title": "Steppe",
    "cost": "",
    "color": "land",
    "type": "Land, Legend",
    "body": "->,_1_: Add one white mana to your mana pool.<br>_1_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 260,
    "title": "Death Power",
    "cost": "SSS",
    "color": "black",
    "type": "Enchantment, Legend",
    "body": "Skip your draw phase.<br>0: Draw a card at the beginning of your discard phase if you have less than 7 cards in your hand; pay one life if it is black, but 2 if it is not black.",
    "strength": "",
    "extra": "",
    "rule_title": "Intermediate Stages",
    "rule": "You can always trigger an Incantatacascade between phases (for example: „before the attack phase“, „after the discard phase“). In these intermediate phases, only quick spells can be summoned.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 263,
    "title": "Dream Angel",
    "cost": "3BB",
    "color": "blue",
    "type": "Creature, Legend",
    "body": "Shape-shifter.",
    "strength": "3\/3",
    "extra": "",
    "rule_title": "",
    "rule": "δ",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 269,
    "title": "Aridity",
    "cost": "2RR",
    "color": "red",
    "type": "Enchantment",
    "body": "Supply: _R_.<br> All creatures get -0\/-1.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 271,
    "title": "Fire Dagger",
    "cost": "R",
    "color": "red",
    "type": "Instant Spell",
    "body": "Inflict 4 damage to a creature.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 275,
    "title": "Bog",
    "cost": "",
    "color": "land",
    "type": "Land",
    "body": "->: Inflict one damage to an attacking creature.",
    "strength": "",
    "extra": "",
    "rule_title": "Haunted",
    "rule": "A magician can apply the activatable effects of a creature that is in the underworld and has the attribute \"haunted\".",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 278,
    "title": "Abnormal Activity",
    "cost": "1S",
    "color": "black",
    "type": "Instant Spell",
    "body": "Summon an instant spell from any underworld.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 302,
    "title": "Mindgem",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, _2_: Add 2 blue mana to your mana pool.<br>_2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 303,
    "title": "Lifegem",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, _2_: Add 2 green mana to your mana pool.<br>_2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 304,
    "title": "Bloodgem",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, _2_: Add 2 red mana to your mana pool.<br>_2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 305,
    "title": "Lightgem",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, _2_: Add 2 white mana to your mana pool.<br>_2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 306,
    "title": "Nightgem",
    "cost": "0",
    "color": "artifact",
    "type": "Artefact, Legend",
    "body": "->, _2_: Add 2 black mana to your mana pool.<br>_2_: Forget.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 426,
    "title": "Clock",
    "cost": "",
    "color": "artifact",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "Of all human movements, the clockwork is the most devilish.",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 428,
    "title": "Swallow",
    "cost": "WW",
    "color": "white",
    "type": "Creature",
    "body": "Can fly. Search your library for a swallow and place it directly in the world.",
    "strength": "0\/1",
    "extra": "One side's part of it, the other ain't.",
    "rule_title": "Incantata 1-233",
    "rule": "In principle, any form of Incantata is only suitable for adults (18+). However, if parents want to allow their children to play Incantata (parents are liable), only the current card game version (real playing cards 1 to 233) with the official sketches (img_skizze*) should be used. Recommendation: at least 14 years.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 608,
    "title": "Owl",
    "cost": "SS",
    "color": "black",
    "type": "Creature, Legend",
    "body": "Can fly. <br>Moon Force, ->: Destroy a creature with Resistance no greater than one.",
    "strength": "1\/1",
    "extra": "",
    "rule_title": "Caution",
    "rule": "You should always pay attention to the limits you are crossing, because there are some deadly secrets out there.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 741,
    "title": "",
    "cost": "0",
    "color": "none",
    "type": "Dream Spell, Legend",
    "body": "Counts as light-white card. Swap places with a magician if the magician agrees. Draw a card.",
    "strength": "",
    "extra": "741 ... make it one to two and two to one.",
    "rule_title": "",
    "rule": "β",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 752,
    "title": "",
    "cost": "",
    "color": "light_white",
    "type": "Rule",
    "body": "An indestructible creature knows its creator.",
    "strength": "",
    "extra": "",
    "rule_title": "Culmination",
    "rule": "(Title Coronation) Card 766 see also Rule 752",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 767,
    "title": "",
    "cost": "",
    "color": "",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "The principle of cause and effect is always valid.",
    "minting_cost": "5.1",
    "date": 0
},

{
    "card_id": 813,
    "title": "",
    "cost": "B",
    "color": "blue",
    "type": "Energy Spell",
    "body": "Make 3 copies of an interrupt spell and divide the total of 4 spells fairly, leaving the original spell unchanged.",
    "strength": "",
    "extra": "",
    "rule_title": "",
    "rule": "",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 840,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Rule cards",
    "rule": "Rules are cards, too. Cards are rules, too.",
    "minting_cost": "409",
    "date": 0
},

{
    "card_id": 841,
    "title": "ICT-841",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Io Sono Incantata\/o!",
    "rule": "A magician who recognizes that he cannot defeat his opponent announces this with the sentence: \"Io sono incantata\/o! \"(\"I am enchanted\/raptured\"). If a magician hasn't recognized it by the end, he can of course do this afterwards. With Incantata one cannot lose; the encounter can only end.",
    "pic": true,
    "minting_cost": "409",
    "taken": true,
    "date": 0
},

{
    "card_id": 842,
    "title": "Business Card",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "I'm not Incantato. <br><br> \"Io sono incantato!\"",
    "strength": "",
    "extra": "",
    "rule_title": "Business Card",
    "rule": "I'm not Incantata.<br><br> \"Io sono incantata!\"",
    "minting_cost": "",
    "pic": "true",
    "date": 0
},

{
    "card_id": 2000,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Io Sono Incantato!",
    "rule": "Eccolo! This is Incantata. The year is 27790. Incantata is ready - 7... 4... 2... Magic!.<br><b>Io sono Incantata!<\/b><br><br><b>License<\/b>: All pictures, all card texts and everything on this site is <b>CC-SA (Creative Common Share Alike) licensed<\/b>.<br><br><b>Suggestions for improvement<\/b>: via Zero-talk-Deutsch:  <a href='http:\/\/localhost:43110\/1E4XLtKC59YV8V9JQ4AkeqSvqECSvrUtnv\/'>Zero Talk DE<\/a><br><br><b>Wallet:<\/b> https:\/\/byteball.org <br><br> <b>set asset names script:<\/b><br><a href='set_asset_names.sh'>set_asset_names.sh<\/a>",
    "date": 0
},

{
    "card_id": 2001,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Helping",
    "rule": "- Host this site in 0net.<br>- Paint a picture.<br>- Find spelling mistakes.<br>- Give away\/exchange crypto cards (except for 1 to 2 sets). <br>- Give your friend a <a href='einzel.html?ids=52'>Golden Carp<\/a>.<br>- <u>Spend an hour in serenity with your friends!<\/u><br>- Exchange and give away crypto cards.",
    "date": 0
},

{
    "card_id": 2002,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Hints For Artists",
    "rule": "<u>There is no guarantee that your picture will be accepted just like this<\/u>.<br><br>- Godfathers\/artists present a finished picture, which is not yet awarded (if in doubt, ask for it, pay attention to photo quality!)<br>- Remember that I reserve the right to reject the picture. <br>- <u>Please note that I reserve the right to choose the cutout\/brightness\/contrast!<\/u><br> Only images with the \"taken\" mark are fixed, all others can change at any time, the first artist who is accepted will of course receive the crypto cards.",
    "date": 0
},

{
    "card_id": 2003,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Language Clones & Clones",
    "rule": "- Of course you can always clone Incantata (CC-SA) and modify it.<br>- This page is very easy to clone, all texts that need to be translated are in the data.json<br>- If you want to make a language clone (just translate, game mechanics & page structure remain as before, i.e. only cards.db, data.json and content.json may differ from the official Incantata version) you are very welcome.<br>- Language clones should be identical in HTML formatting, and in particular, no script tag should be included in the database. <br>- For each language, the language clone that is closest in text and formatting to the original and maintained regularly is linked. <br>- Language clones are preferably displayed in the header of Incantata. <br>- Other clones become if I like them, also added to the header.<br>",
    "date": 0
},

{
    "card_id": 2004,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Questions And Answers",
    "rule": "Q: What is Incantata?<br>A: Incantata is Italian and means enchanted. Both in the magical sense, and in the sense of \"I am delighted!\"<br><br>Q: Isn't there already enough trading card games?<br>A: Incanta is more; Incantata is an art project, a magical library, a myth, a thinking system, a culture mirror, and much more.<br>Every Incantata card is magical through and through.<br><br>Q: Oh you fright, isn't magic also dangerous? <br>A: Don't worry, the Mantra of Purity will protect you as it marks the transition to the Incantata universe.<br><br>Q: Why all this with the crypto cards?<br>A: Incantata is completely non-commercial and will ultimately be freely copyable and printable by anyone; the idea with the crypto cards serves as an incentive for artists to participate - they receive certificates, so to speak, that prove that they have helped. So we can create a work of art without money - because such is not available.<br><br>Q: And why Byeteball to mint the cards.?<br>A: With Byteball you can easily mint digital objects. The Byteball Wallet is very advanced and it will certainly soon be possible to display the images in the Byetballwallet. Just read the Byteball Whitepaper (https:\/\/byteball.org).<br><br>Q: How many cards will there be?<br>A: 841<br><br>Q: How long will it take to get everyone ready?<br>A: As long as it takes to get it done - certainly longer than a year.<br><br>Q: Will there be rarer cards<br>A: In principle no. Only the legends (allowed only once per library) are logically minted only 1\/3 times.<br><br>Q: What is the „gioiello d’arco“?<br>A: The Incantata cards 1-91 are called <b>gioiello d’arco<\/b>.<br><br>Q: Who decides which cards belong to Incantata? <br>A: In the end I decide for myself, but in this process the net community, the card sponsors and the artists are highly involved.<br><br>Q: Isn't this somehow a kind of dictatorial central structure?<br>A: Basically, especially with regard to communication structures, I favor decentralized constructs. In this case, however, it is an art project whose literary direction I am in charge of. The whole thing is not as authoritarian as it looks, because everyone who participates changes Incantata!<br><br>Q: Open source code?<br>A: All program tools used for Incantata are free in the sense of the GNU Project and\/or in the sense of the FSF\/FSFE.",
    "date": 0
},

{
    "card_id": 2005,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Status of Incantata",
    "rule": "For the condition of the individual domains see \"print views\" (at the top): \"finished\" means the game-mechanics are finished; it is not meant cosmetics, picture, design of the frame etc.- this will follow later.<br><br>All card representations on this page are provisional and only intended for testing the game. Professional design of the cards will take place later.",
    "date": 0
},

{
    "card_id": 2006,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Views",
    "rule": "(works with chromium, 114%, borderless DIN-A4, borders minimum)<br>",
    "date": 0
},

{
    "card_id": 2007,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Printed Pages: 1",
    "rule": "<span class='status_ready'><center><b>Backs<\/b><br><\/center><\/span><br><a href='rueckseiten-druck.html'>Backs<\/a><br><a href='ekliptik-druck.html'>Ecliptic<\/a><br><a href='raumzeit-druck.html'>Space-time-structures<\/a><br><span class='status_ready'><center><b>Rules<\/center><\/span><br><a href='druck_r.html?ids=1,2,3,4,5,6,7,8,9'>Rules Page 1<\/a><br><a href='druck_r.html?ids=10,16,15,14,109,108'>Rules Page 2<\/a><br><a href='druck_r.html?ids=61,62,63,64,65,68,69,85'>Rules Page 3<\/a><br><span class='status_ready'><center><b>Matter Domain (1-99)<\/b>>99,88%<\/center><\/span><br><a href='druck.html?ids=0,1,1,1,52,14,15,16,17,18'>Destinies & Legends<\/a><br><a href='druck.html? ids=0,02,03,04,05,06,07,39,91'>Celestial bodies+Rose+Tulip<\/a><br><a href='druck.html?ids=0,08,08,08,09,10,11,12,13'>Lands+STS<\/a><br><a href='druck.html? ids=35,37,45,46,47,48,42,60,77'>Incarnations+Legends<\/a><br><a href='druck.html?ids=0,90,95,80,84,86,89,93,99'>Legends<\/a><br><a href='druck.html?ids=19,20,21,22,23,24,25,26,27'>Basic Cardset 1<\/a><br><a href='druck.html?ids=0,28,29,30,31,32,33,34,36'>Basic Cardset 2<\/a><br><a href='druck.html? ids=0,38,44,40,41,49,43,51,53'>Basic Cardset 3<\/a><br><a href='druck.html?ids=54,55,56,57,58,59,61,62,63'>Basic Cardset 4<\/a><br><a href='druck.html? ids=64,65,66,66,67,68,69,70,71,72'>Basic Cardset 5<\/a><br><a href='druck.html?ids=73,74,75,76,78,79,81,82,83'>Basic Cardset 6<\/a><br><a href='druck.html?ids=85,87,92,92,94,50,96,97,98'>Basic Cardset 7<\/a><br><br>",
    "date": 0
},

{
    "card_id": 2008,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Pages: 2",
    "rule": "<span class='status_beta'><center><b>Power domain (100-234)<\/b><br>Beta<\/center><\/span><br><a href='druck.html?ids=100,101,102,103,104,105,106,107,108'>Cards 100-108<\/a><br><a href='druck.html?ids=109,110,111,112,113,114,115,116,117'>Cards 109-117<\/a><br><a href='druck.html?ids=118,119,120,121,122,123,124,125,126'>Cards 118-126<\/a><br><a href='druck.html?ids=127,128,129,130,131,132,133,135,136'>Cards 127-136<\/a><br><a href='druck.html?ids=137,138,139,140,141,142,143,144,145'>Cards 137-145<\/a><br><a href='druck.html?ids=146,147,148,149,150,151,152,153,154'>Cards 146-154<\/a><br><a href='druck.html?ids=155,156,157,158,159,160,161,162,163'>Cards 155-163<\/a><br><a href='druck.html?ids=164,165,166,167,168,169,170,171,172'>Cards 164-172<\/a><br><a href='druck.html?ids=173,174,175,176,177,178,179,180,181'>Cards 173-181<\/a><br><a href='druck.html?ids=182,183,184,185,186,187,188,189,190'>Cards 182-190<\/a><br><a href='druck.html?ids=191,192,193,194,195,196,197,198,199'>Cards 191-199<\/a><br><a href='druck.html?ids=200,201,202,203,204,205,206,207,208'>Cards 200-208<\/a><br><a href='druck.html?ids=209,210,211,212,213,214,215,216,217'>Cards 209-217<\/a><br><a href='druck.html?ids=218,219,220,221,222,223,224,225,226'>Cards 218-226<\/a><br><a href='druck.html?ids=227,226,229,230,231,232,233,234'>Cards 227-234<\/a>",
    "date": 0
},

{
    "card_id": 2009,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Pages: 3",
    "rule": "<span class='status_prealpha'><center><b>Movement domain (235-420)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2010,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Pages: 4",
    "rule": "<span class='status_prealpha'><center><b>Spirit domain (421-607)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2011,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Pages: 5",
    "rule": "<span class='status_prealpha'><center><b>Energy domain (608-741)<\/b><br>pre-alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2012,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Print Pages: 6",
    "rule": "<span class='status_prealpha'><center><b>Dream domain (742-841)<\/b><br>Pre-Alpha<\/center><\/span>",
    "date": 0
},

{
    "card_id": 2013,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "News & Events",
    "rule": "<a href='134.html'>134.html<\/a><br>",
    "date": 0
},

{
    "card_id": 2014,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Distribution of Crypto Cards",
    "rule": "- Each card sponsor and each artist receives a \"Mantra of Purity\"<br>- The card sponsor suggests a card or adopts a card.<br>- The artist creates an image.<br>- The image (RAW format) must be well photographed with a minimum size (After Bleed) of: 4000x3200 (40:32)<br>- The photographed image will be Creative-Common licensed (CC-SA)- The original will be retained by the artist of course. <br>- The image is displayed in an aspect ratio of 40:32 - note this!<br>- The card sponsor transfers >= 5,1 MB (exact value will be set by me).<br>- No card will ever be minted a second time.<br>- The artist gets 15%<br>- The card godfather gets 15%<br>",
    "date": 0
},

{
    "card_id": 2015,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Quantities Minted",
    "rule": "<table><tr><td><b>Type<\/b><\/td><td><b>100%<\/b><\/td><td><b>15%<\/b><\/td><td><b>Set<\/b><\/td><\/tr><tr><td>Legend<\/td><td>819<\/td><td>123<\/td><td>1<\/td><\/tr><tr><td>Wonder<\/td><td>1638<\/td><td>246<\/td><td>2<\/td><\/tr><tr><td>Formula<\/td><td>2457<\/td><td>369<\/td><td>3<\/td><\/tr><tr><td>Space-Time Structure<\/td><td>4914<\/td><td>714<\/td><td>6<\/td><\/tr><tr><td>Multiplicity<\/td><td>9828<\/td><td>1475<\/td><td>12<\/td><\/tr><tr><td>Mantra of Purity<\/td><td>11800<\/td><td>---<\/td><td>1<\/td><\/tr><tr><td>Nr. 841<\/td><td>???(>=2, <97,6 mio.)<\/td><td>---<\/td><td>???<\/td><\/tr><tr><td>Nr. 796<\/td><td>???<\/td><td>---<\/td><td>???<\/td><\/tr><\/table>",
    "date": 0
},

{
    "card_id": 2016,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Please Note!",
    "rule": "- Please note: I transfer the cards to the card godfather; the godfather takes the responsibility that the artist gets his part.<br>- I will keep two sets of each card.<br>- The rest will be given away by the \"Council of 5 Wise Magicians\". The wise magicians have the right to interpret the card as they see fit.<br>- Card No. 796 is minted in a quantity determined by all holders of Incantatakrypto cards (sum 5*α*j, j=quantity of cards, α (α>1) is reasonably estimated by everyone). <br>- The last card (No. 841) is minted in an amount determined by all holders of incantate crypto cards, weighted accordingly (>=2, <97.6 millions.). I reserve the right to publish those or not. However, the crypto cards are still distributed by it.<br>",
    "date": 0
},

{
    "card_id": 2017,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Symbols",
    "rule": "<img src='data\/img\/icon_info.gif'> This picture is just a working sketch.<br><img src='data\/img\/icon_taken.gif'> This card is already taken.<br><img src='data\/img\/icon_crypto.gif'> This card is available as crypto card.<br><br>Manasymbol<\/b>:<br>White: <img class='mana_img' valign='middle' class='mana_img' src='data\/img\/mana_white.gif'><\/img><br>Blue: <img class='mana_img' valign='middle' class='mana_img' src='data\/img\/mana_blue.gif'><\/img><br>Red: <img class='mana_img' valign='middle' class='mana_img' src='data\/img\/mana_red.gif'><\/img><br>Green: <img class='mana_img' valign='middle' class='mana_img' src='data\/img\/mana_green.gif'><\/img><br>Black: <img class='mana_img' valign='middle' class='mana_img' src='data\/img\/mana_black.gif'><\/img><br><br>Addendum: Real Incanta cards have an effect in reality, as well as crypto cards, but those have an effect in the crypto-universe.",
    "date": 0
},

{
    "card_id": 2018,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "The World Library",
    "rule": "A world library consists of 841 cards. Each card is present once, except number 819, so one of the other cards is double. By cards we mean both real cards and crypto cards. A real world library is the one when one card from this set is randomly removed (assuming there are reliable random generators and the corresponding infrastructure around both in reality and in the crypto-universe), either in connection with real cards, or crypto cards. Such a world library is considered perfect if each card is only available once.",
    "date": 0
},

{
    "card_id": 2019,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Header",
    "rule": "<span class='headlang'>PL</span><a href='alle.html' class='headlink'><span style='margin-left:50px' class='headelement'>&nbsp;Alle&nbsp;</span></a> <a href='alle.html?filter=green' class='headlink'><span class='headelement'>&nbsp;<img src='data/img/mana_green.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=blue' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_blue.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=red' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_red.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=black' class='headlink'><span class='headelement'>&nbsp;<img src='data/img/mana_black.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=white' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_white.gif'></img>&nbsp;</span></a> <a href='alle.html?filter=none' class='headlink'><span class='headelement'>&nbsp;<img  src='data/img/mana_0.gif'></img>&nbsp;</span></a> <a href='../1JeCDXuDG7VLJbimZQ6nWmNbeij2UV6P92/' class='headlink'><span class='headelement'>&nbsp;Drachengemmen&nbsp;</span></a>",
    "date": 0
},

{
    "card_id": 9999,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Why Don't You Just Keep Walking?",
    "rule": "Where such a little mind sees no way out, it immediately imagines the end.",
    "date": 0
},

{
    "card_id": 27790,
    "title": "",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "",
    "strength": "",
    "extra": "",
    "rule_title": "Incantataland",
    "rule": "<img src='data\/img\/incantata_flagge.gif'><br>27789.51.5: Universe day<br>27789.52.1: Kosmostag<br>27790.27.4: Foundation day<br>27.6: Lucky day<br>27790.31.4: Realization day<br><br>Note on Incantatalandflagge: The Incantatalandflagge is used solely for internal purposes. You must refrain from public display, or even flag flirting!",
    "date": 0
},

{
    "card_id": 27791,
    "title": "Incantato",
    "cost": "",
    "color": "none",
    "type": "",
    "body": "A secret of which all hope and many want to know that it exists; but few want to know it and only one may and can know it.",
    "strength": "",
    "extra": "",
    "rule_title": "Incantata",
    "rule": "A mystery of which all hope and many want to know that it exists; but only few want to know it and only one may and can know it.",
    "date": 0
},

{
    "card_id": 27792,
    "title": "Joy",
    "cost": "",
    "color": "none",
    "type": "Reward",
    "body": "... beautiful spark of the gods",
    "strength": "",
    "extra": "And now rejoice!",
    "rule_title": "Another poem",
    "rule": "It echoes well over here, it sounds long ago in reality, Vittoria. <br> The gloriousness 9., as thought out in wisdom, <br> when shortly after the beginning of the third movement, the conductor takes off. < br> <br> Incantato - Incantata ... he really was never there!",
    "date": 0
},

{}
]}
