{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1570391956,
			"title": "who's seen joker?",
			"body": "any good? im thinking i'll go and see it.",
			"added": 1570391955
		},
		{
			"topic_id": 1587679731,
			"title": "whos got the link for the gates hack data?",
			"body": "post it here please",
			"added": 1587679729
		}
	],
	"topic_vote": {
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"1569844265_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570458113_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81": 1,
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1568652007_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 1,
				"body": "TV licence. I dont pay it cos theres not a lot they can really do to make you pay. the goons always come around when im at work or some shit, despite all the threatening letters saying theyll come in the evenings and stuff. even if they did they have no warrant or bullshit to come into you house and inspect your tv. \nIts almost worse that people will pay up for this extortion when the consequences of not paying are such a paper tiger...",
				"added": 1568710913
			},
			{
				"comment_id": 2,
				"body": "> [bigbadbob](#comment_751_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): TV inspection?  that sounds pretty invasive.  I have never heard of that one.  What excuse do they have for this or do they even give an excuse?\n\nWell the money they get from licence fees pays the bills for the state media. the BBC doesnt have advertising... so if your tv is connected to a tv ariel or dish or whatever, then its capable of reciving the state media... so theyll want to see if youre connected to that ariel to make sure youre not watching their crap without a licence. \nbasically extortion is the only way the state knows how to monetize, so thats the way they do it.",
				"added": 1568750454
			},
			{
				"comment_id": 3,
				"body": "> [kidcourageous](#comment_242_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): just get a gunthis kinda shit happens when you let your government disarm you\n\nand shoot the tv licence guy? im never in when he comes round...",
				"added": 1568808641
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 4,
				"body": "all the government is just another criminal gang fucking over people in general. democracy is particularly awful as it gives that illusion of consent and choice, and a way of changing government... while really all parties are united on most stuff, like they all agree that they get to lord over you and freedom is bad. \nlately it seems buying peoples votes with \"free\" shit is the way to get power... paying college debt, welfare, a wall... \ni think its highly unlikely id ever vote, and if i did i wouldnt expect anything in return.... cos thats not how it works. in democracy politicians can lie, and everyone knows it. thats essentially fraud. but there are no consequenes, because they are our rulers",
				"added": 1569443391
			},
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_7_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Democracy allows those who see through it to quietly option out. In that respect it is the best government there is, as those too stupid to see their way out continue to pay for the machine (insurance, medical, infrastructure, entertainment) which benefits everyone. People in the US in particular should be voting for Andrew Yang this coming presidential election. Not only does he want to restrict corporate greed, he wants to pay you $12,000 a year in tax free cash. There is no downside to that man's platform.\n\nyang is a perfect example of a politician bribing voters.",
				"added": 1569450794
			},
			{
				"comment_id": 6,
				"body": "> [anonymouslogin](#comment_8_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Inflation is there no matter what in a growing economy. Indexed basic income might solve that. You think that trillion dollar corporate capitalisations don't make your saving worthless?\n\nthats just not true. there have been delfationary growing economies.",
				"added": 1569450869
			},
			{
				"comment_id": 8,
				"body": "> [nyanasi](#comment_9_1GCX671SdfGDqwXhgjySi8RRALoB4vwHCD): That is human nature. The problem is not systemic. There is not a magic system that will make it go away. The best you can do is account for the nature of the people so the system built is suitable for them. The founders of the United States did this by realizing every authority will become corrupt and trying to plan around it. They were successful, but it wasn't perfect because humans aren't and won't last forever because nothing does.\n\nthe founders wherent successful. they created a government that eventually became the us government we know and hate today. in the long run it wouldnt work to go back to the founders vison, cos where does that lead you? right back to where we are.",
				"added": 1569456339
			},
			{
				"comment_id": 9,
				"body": "another thing about democracies is the package deal of polices each party has. you might like some of them, but theyre always lumped together with some crazy shit. which promises will they actually keep? always the bad ones.",
				"added": 1569456513
			}
		],
		"1569419442_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 7,
				"body": "i wouldnt go so far as to say theyre subhuman... its hilarious but not true imo. you have a point here tho. ive thought for a while now that zombies are a good metaphor for the left. the theory is dead but it keeps on going somehow... you cant reason with them. being the most persuasive motherfucker in the world isnt gonna help you. theyre going to try to eat you - to be a parasite to the point of killing the host - and the only way you can stop that from happening is by removing the head or destroying the brain.\nor by separating ourselves from the contagion.",
				"added": 1569451569
			},
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_1096_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): What really pisses me off is that they will take a Democrat's side on regime change when they condemned it under a Republican. They praised WikiLeaks and now condemn it. There is no principle, only tribalism.\n\nwell now theyll take a republicans side on regime change. the days of the anti war left are over. obama saw to that.",
				"added": 1569799239
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 10,
				"body": "theres no way hillary would be able to get away with the amount of gun control trump does.",
				"added": 1569577343
			}
		],
		"1569605502_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U": [
			{
				"comment_id": 11,
				"body": "the bigger these companies get the more retarded they become.",
				"added": 1569617521
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 12,
				"body": "> [xan](#comment_14_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Basically there are two categories to describe web users: gear and age. Then let's form typical groups of web users:1 desktop and old2 desktop and young3 mobile and old4 mobile and young [...]\n\nwell i dug out my laptop just to get on zeronet.",
				"added": 1569666727
			},
			{
				"comment_id": 13,
				"body": "> [xan](#comment_18_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY): Me too. So what?\n\nwell my point is that there are some people coming across from mobile",
				"added": 1569675707
			}
		],
		"1570391956_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 15,
				"body": "> [emmet](#comment_18_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU): EVERY hollyjew production is nonsense designed to psychologically manipulate you in some way, no matter what fake outrage bullshit the media says about it to get you to buy a ticket. Don't fall for the viral marketing on 4chan.If you must watch it then download it from The Pirate Bay, but then again, better not to because you know there will be some brainwashing going on designed to be especially effective on the target audience the movie was aimed to (you).\n\nwell i'll keep that in mind",
				"added": 1570444182
			},
			{
				"comment_id": 16,
				"body": "> [zenanon](#comment_30_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): I downloaded it, just got done watching. Verdict: pretty damn good movie. I was disheartened listening to some of the hot takes over the last few days; trying to pigeonhole the movie into some particular world view. It was a lot better than that. [...]\n\nthanks for the review! sounds great. i'll for sure see this movie.",
				"added": 1570444245
			}
		],
		"1570496389_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 17,
				"body": "whats wrong with keeping the fake id?",
				"added": 1570565501
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 18,
				"body": "liver",
				"added": 1570896639
			}
		],
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 19,
				"body": "lets boogie!",
				"added": 1571500271
			}
		],
		"1576862108_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 20,
				"body": "heard it mentioned several times on logos media podcast. (formerly gnostic media) they say there are maps showing the empires extent but i havnt seen them as i dont watch the video feed. they linked it to a re-writing of history in which the dark ages are a fiction dropped into the history books, perhaps with the intention of hiding the tartars. not sure i believe that myself as where i live there are a LOT of churches and castles built in the dark ages with historical records carved into the stone of these buildings. i would be more impressed if i could see and read and touch tartar structures the way i can with stuff from the dark ages.",
				"added": 1577112391
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [
			{
				"comment_id": 21,
				"body": "hell yeah. taxation is theft. i havnt paid council tax since 2013.",
				"added": 1579206600
			}
		],
		"1576215313_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 22,
				"body": "lol",
				"added": 1579206755
			}
		],
		"1579404185_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 23,
				"body": "yes. there is no moral tax. taxation is theft. extortion. government is different from mafia only in that it is more advanced and far more widespread. try talking about that with any tax collector and it really freaks them out. truth hurts.",
				"added": 1579434928
			},
			{
				"comment_id": 28,
				"body": "> [ranshit](#comment_56_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Taxation will only vanish in a state of anarchy. Otherwise there is going to be some entity being government or private taking a tax or a fee on some good or service. [...]\n\n \"the ones who accumulate the most wealth, also happen to contribute the least to any taxation.\" ---- no, theres just a lot less wealthy people. they get taxed up the arse, even if it doesnt make up a huge portion of the total revenue. thes just less of them. the middle class gets fucked the worst. theyre the highest priority targets cos theres lots of them and they have money for the taking.",
				"added": 1579455040
			}
		],
		"1579430150_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 24,
				"body": "you forgot pepperspray. also illegal. thank fuck we still have crossbows, even if we cant carry them... \ndeath to tyrants",
				"added": 1579436807
			}
		],
		"1581540627_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 29,
				"body": "love how the guardian reports this like its about helping people and not inevitably going to be used against political opponents. this is an outright socialist newspaper reporting the actions of the conservative government as if its all fine and dandy. people in the uk are such authoritarians. fuck the state.",
				"added": 1581541309
			},
			{
				"comment_id": 30,
				"body": "> [moor](#comment_392_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): >capitalists lobbyists use the government to increase their power [...]\n\nyeah, sure. the big social medias are gonna be loving this. any little social media is gonna be hit with all this bullshit, while the big social media companies will be allowed more leeway as they have power to influence people. to sway elections and propagandise support for whatever crap the state wants to fuck people with next. i wouldnt call regulating competition out of the market capitalism tho. its crony capitalism, and thats an important distinction.",
				"added": 1581542506
			},
			{
				"comment_id": 31,
				"body": "> [moor](#comment_393_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): crony capitalism, corporate capitalism, \"crapitalism\" as some free marketeers call it, is still capitalism, not socialism. and has ever \"capitalism\", that is, free markets, private property, little to no regulation and/or government ever existed? if so when? how well did it work?\n\nhong kong",
				"added": 1581543091
			},
			{
				"comment_id": 32,
				"body": "> [moor](#comment_395_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): that doesn't necessarily mean that he trusts TG on other issues. perhaps he chose TG for practical reasons.\n\nsnowden is an op",
				"added": 1581890387
			}
		],
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 33,
				"body": "why not get some part time work or something with your nym? that would be really taking the piss if you claim unemployment welfare. \nmy experience with welfare is... the people you meet are quite something. other people claiming, are not really the kind of people i want to be around. the bureaucrats you have to deal with are some of the most useless incompetent people you'll ever find. many of them are literal retards. not joking. this is particularly irksome when you claim your unemployment and find the retard who is \"helping you into work\" has never had a job.\nmaybe it could work for you, but for me... i find government nonsense too infuriating and so i have as little to do with them as possible. \nseems to me youve put a lot of work into your nym and its quite valuable now. you should keep it going, even if only with little freelancing jobs or whatnot. dont abandon it. \nive heard from someone whos played the welfare game a whole lot more than me that they dont much care what you do for money if not claiming. which is to say, if you tell them youve been doing nothing at all for many years, they may think it suspicious and think you must be a drug dealer or somthing, but thats not a problem. its not unusual. most claimants are fucking weird and/or criminals.",
				"added": 1582227440
			}
		],
		"1580821606_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 34,
				"body": "why wait for racists to adopt this? force it on them the same way the ok sign was forced on them. once the media starts reporting it the racists will jump right on board and make it a thing.",
				"added": 1582229915
			}
		],
		"1583188389_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 35,
				"body": "Pretty much agree, tho im not so pessimistic on the global market... I think the dollar could be abandoned relatively quickly.\nIts not just government leaders tho... look around. 99.6% of the western world are only interested in hearing (and basing their life choices on) comforting lies.",
				"added": 1583347170
			}
		],
		"1585269932_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 36,
				"body": "back then the technology was new and now it is old. perhaps the difference is that when it was new we had less faith in it... so in calculating how strong a bridge would need to be, i believe brunel would multiply the result by ten. now the tech has been around longer we trust it without a second thought. so we make things just strong enough, or even not strong enough... to keep costs low. look at the millennium bridge in london. right after opening it was closed again because it was twisting in the wind. \nwith newer tech like mobile phones the tech advances so quickly it doesnt make sense to make things to last as we like to upgrade so often.",
				"added": 1585434662
			}
		],
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": [
			{
				"comment_id": 37,
				"body": "painfully obvious that your only exposure to conspiracy analysis is thru COINTELPRO disinformation agents.",
				"added": 1587765447
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 38,
				"body": "> [cexy](#comment_27_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Looked at some if it. It's hard to believe this is real. [...]\n\noh i can believe they were hacked. theyve been doing a lot to make themselves targets, but if the data is just usernames and passwords then whoever dumped it really jumped the gun imo. if it was me id want to keep those credentials on the DL in super secret squirrel hacker circles- dont tell the target so they can change their passwords. \ni was hoping this would be more like the clinton emails.\ntheres a karen pandemic.",
				"added": 1587766050
			}
		]
	},
	"comment_vote": {
		"9_1BX5Fybb58kpdZGw2d9a5arCD3jJbi8DZz": 1,
		"245_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"216_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"220_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"785_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"788_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"790_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1096_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"37_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"72_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"422_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"436_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"30_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"20_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"41_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG": 1,
		"140_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1
	}
}