{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1615959214,
			"title": "How many cops were killed by Hitler?",
			"body": "This is an interesting topic, that curiously, no one talks about. We know the take over of the medias who were already censoring to protect the feodalists, we know the massacre of the jews etc. \n\nBut what happened to the cops? I mean, I hope they got killed a lot? otherwise, it would just mean that they followed the new orders without even an hesitation.\n\nI never heard of COPS resistance to HITLER... I guess they loved it?\n\nvery curious... interesting even.\n\nand bonus question, in \"liberated\" area? I mean cops polland and co? harvested?\n\nI like the word harvested...",
			"added": 1615959213
		},
		{
			"topic_id": 1615959787,
			"title": "Exposing a collectivist nazi cop : Kevin Hurley - former Head of Counter Terrorism at the City of London Police",
			"body": "He pen this article : https://www.rt.com/op-ed/518256-sarah-everard-police-vigil/\n\n>Should the police have used greater resources at the outset to stop any sort of gathering in the midst of the pandemic, or should they have just looked away and allowed those attending to break lockdown rules, placing all of us at more risk?...\n\n>Also, that the police asked them not to hold the ceremony on the basis that a large gathering would risk spreading coronavirus and break lockdown regulations....\n\n>How dare you risk more of us with your emotional outpouring and break lockdown rules?...\n\nconclusion : another fucking gretha ! It's not my problem if this cop is autistic ! \n\nto use a parable : I love to kill sheepdogs ! okay? You understand dirty fucking cops : we are free.\n\nwe can prove it to you... by killing all of you. WARFARE... killing your spawns, those who spawns you etc.\n\nwe aren't your sheep.\n\ndo you have the iq to understand what I am trying to express here?",
			"added": 1615959785
		},
		{
			"topic_id": 1615959890,
			"title": "RT launches own Covid-19 Freedom Index",
			"body": "https://www.rt.com/news/518107-covid-freedom-index-rt/",
			"added": 1615959887
		},
		{
			"topic_id": 1615964839,
			"title": "Is the CCP a nationalistic endaevor or international one?",
			"body": "that's the fundamental question.\n\nI fully support the nationalistic CCP ! 1 China - United - Harmony etc etc.\n\nI fully oppose the internationalistic CCP... wanting to rule the world even using UNO / global agenda as proxies will back fire so massively... the world will hate not ccp, but the chinese people.\n\nI am sure there is a war raging at the CCP, the UNO / global agenda must have china under their control or controlling them to achieve their one world gov project... \n\ndon't forget, dear chineses, the Book, the Holly Book, is the same, spoken in the same... don't forget... many have tried : you who fight to win, don't fight to die #shahadah",
			"added": 1615964835
		},
		{
			"topic_id": 1615966420,
			"title": "Projects : training CIA (and others) death squads with eurocops - and who is the cutest female cop of england ?",
			"body": "1. have you seen the cops charging with their horses and baton? ideal practice targets for CIA death squads... I have a lot of funny scenario to train to try those xm-1158 :).\n\n2. @nsa I know you follow her already... we just need a nice pic of her to dispatch to the gun range ! concrete ! those are the enemies !",
			"added": 1615966415
		}
	],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1615915604_1CodiaiQ88YtvgtWWSX7diY8rwGfHjB2Hx": [
			{
				"comment_id": 1,
				"body": "If I had to select an event leading to the fall of western civilization by the spread of corruption would be the war on plants of the creation. Rather than for millennial try to learn the benefits, risks and costs of each plant, the corrupt powers found it an excellent way to achieve many of their objectives:\n\n1. a way to control the mind (for some even with specific treatable disease by specific plants) + censorship.\n2. a way to increase the police state and distrust between the people and the LEOs and courts.\n3. a way to criminalize and reduce demographically a specific segment of the population.\n4. an infinite source of unaccounted profits, bribes, black mails and immunity rights.\n\nPersonally, I think it's bigger than GMOs, Nukes or FIAT banking. Making a plant of the earth, natural, illegal, is beyond anything a sentient being would ever do. However it makes prefect sense for the corrupts as I guess, they may feel that this life, is all they will ever know... \n\nThe silver-lining? All the corrupts died before being able to corrupt their own death :).",
				"added": 1615923775
			},
			{
				"comment_id": 8,
				"body": "A good example I like to cite is Rasheed...\n\nSo rasheed sells hash at school... and goes there under influence everyday. Rasheed doesn't like his history class (fucking muppets unable to tell the true history), biology sucks, chem is for suicidal muppets etc etc... but rasheed love is maff class!! he dreams to be able to take accounting... and even his teachers are really fan of him! great interests! \n\nRasheed is friend with Kareem... Kareem doesn't sell hash, he buys it from Rasheed ! and like him he goes under influence everyday to school ! but Kareem hates science, maff and all this shit... he loves to read french poesy... ahh he loves it... one day Kareem may publish his work... but you know... it's a big, step and he is still finish his masterpiece.\n\nNow we have Kalheed... Kahleed will be the first muslim on Mars. End of the discussion. Kahleed loves rasheed and kareem, they never do trouble in class... they \"chill out in the back\", of course, who can beat Kareem in french class... no one, but who cares, at least no trouble, and frankly if he had to do a space compagny he would wish Rasheed to take the business side of the operation!\n\nNow in reality. rasheed will go to jail soon for another shift, his credit score is bad, and he knows it, no financing... Kareem is writing gang lyrics in jail too... while kalheed was shot down in a shoot out.\n\nuseful... for demographic management. sheepdogs can only herd sheep...",
				"added": 1615964445
			},
			{
				"comment_id": 9,
				"body": "but what's interesting is that beyond the grethas in LEOs or politics and co...\nMost western nations were at their best before the war on plants ! \nbut again, by design. destroy the west to then UNO / global agenda...\npoor luck to the planners, they underestimated the Chineses !",
				"added": 1615964617
			},
			{
				"comment_id": 10,
				"body": "Hey look, who is going to school to today ! it's zyneedeen... ollaaa.. he seems in bad shape. and so zyneedeen arrives to the groups, and asks : guys I need your shit. everyone : lol. what is going on zyn? another incident at the soccer field? zyneedeen tense... how can I pay for your shit suckers? ahh asked tony... you wait there... and call :). okay... said zyn, I can't go far anyway :).",
				"added": 1615965199
			},
			{
				"comment_id": 11,
				"body": "meanwhile nicolas bought himself a karsher... but not for his sons...",
				"added": 1615965369
			}
		],
		"1615938789_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 2,
				"body": "Kill it > Aubrey Cottle, SSN? Home address? I guess, he is a \"proxy\" of Trudeau? We are this stage, the most violent win. Look at what they did to the one protesting \"puberty blockers for children\"? so kill those people faster than they can strike back. the cops are all stoned... like in Italy before Mussolini or Hitler's Germany. They don't have the IQ to track the ball, afterall, they just want to arrest users of plants of the creation... it's their ORDERS.",
				"added": 1615959036
			},
			{
				"comment_id": 6,
				"body": "ps gab is a corral run by the same people as in twitter...",
				"added": 1615963930
			}
		],
		"1615858060_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 3,
				"body": "And so they run with generators ! good of them. But where is the \"judge\" living? As he thinks he can take the \"living\" of others, reminding him and his goons (cops) that their lives can be taken too, even in a systemic methodical way, would remind them off : off, with, and by the people.\n\nsome cops and judges and co, have the belief we are their little cattles, they have to killed, to be reminded we are free, otherwise, they are proven right.",
				"added": 1615959364
			}
		],
		"1615959890_1CVe9cCruLHfk9DvG79pUbeLBqdMR9i4FZ": [
			{
				"comment_id": 4,
				"body": "How do you call russians going \"freedom cowboy\"? careful, the \"human right cowboys running pedoisland\" have some advance...",
				"added": 1615959945
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 5,
				"body": "Why love the LVS shooting event? It's one of the hardest to understand for aliens, from russia to new zealand to fake americans.\n\nThe theory is simple : with A2, there will be incidents. However with A2 it's a nice and realistic and pragmatic way to try to prevent a bolshevick take over, or at least to increase a lot the cost of it.\n\nOf course A2 alone isn't the panacea, still the regular cost of it : mass shooting, is a worthy long term price to pay.\n\nLet's look in numbers, since 1775 how many americans were killed by their gov vs in Russia in the same time period (ex draft for wars)?\n\nFurthermore, gunkiddies, are very used to guns, can be useful in wars...\n\nand that's the story of america.\n\nof course the pedo-uno-global agenda and others various depopulationist groups hate A2, as they do to A1.\n\nFor example if the canadian guy had his AR-15 displayed, I don't think the depopulationist would have dared.\n\nthere were no antifa in many places in the USA, including Cicero, Chirak :). Oh, they could go... it's getting out alive which is harder.\n\nand the jew point : If the jews had weapons... as we say even if it's a temporary front line ( I mean wehrmacht launched is hard to stop), it would have given more time to the slowest.\n\nand that explain the problems, I am not here saying the Russians have to go full Ak17, just saying that the UNO / global agendas and others various domestic groups, including pedogen honoré with his feinstein backers are terrorists... at least feinstein, and I guess soon honoré... will see.",
				"added": 1615963822
			}
		],
		"1615959787_1CVe9cCruLHfk9DvG79pUbeLBqdMR9i4FZ": [
			{
				"comment_id": 7,
				"body": "I am curious what the nazi social science had to say in regards to cops in occupied countries, like france, danemark, I am curious what was the level of collaboration? I guess, premise : very high ! like over 80% were even happy to follow new order, until they got that they couldn't grad above a certain level... first learn flawless german. no fucking muppet allowed. Who was the most fluent \"french\" cop in occupied france?",
				"added": 1615964064
			}
		]
	},
	"comment_vote": {}
}