{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Eric Zemmour vs Valls... Analyse et introduction de jean messhia",
			"body": "Alors... deja pour etre clair je pense que valls est un fils de pute ! \n\npourquoi?\n\nd'abord cet enculé n'avait aucune chance en catalogne. Ce mec c'est un batard authoritaire, con et arrogant.\n\nalors pour ceux qui comprennent la catalogne... on voit la divergence.\n\ndeuxièment ce petit pd, n'a rien fait pour \"egalité ou liberté\" c'est-à-dire qu'il a continué la tradition de mettre des gens en prison pour des plantes.\n\n3emement, ce que ce leecher aime c'est la republique francaise, c'est a dire de looter NOS TAXES pour les mettre dans sa poche ou dans celle de ces potes pour des kick backs.\n\n4emement son attaque sur sujet difficile contre zemmour regardant ww2, lache et avec intention destabilisante, que zemmour a géré comme un chef !\n\n5eme il denit donc et logiquement le concept de peuple francais... alors ca devient plus complexe.\n\nmoi contrairement a zemmour ou messiha, J'AI PAS CHOISI ! c'est pas ma faute ! C'est comme christine !!! \n\net la c'est marrant la difference, elle, elle est des tom doms... pas moi ! a mon grand malheur...\n\nalors la les deux zigotos, zemmour et meshia, ils sont presque plus francais que moi... y a qu'a voir le nombre d'année qu'ils y ont vécu. \n\net donc moi je les considere francais, et surtout comme ils veulent... dans le sens que je suis pas la a assimiler...\n\net c'est le 6eme point... valls c'est un nazi... dans le sens qu'il veut imposer la republicanization francaise aux étrangers qui ne le veulent pas, a travers des moyens diverse digne de l'homme nouveau.\n\n7eme il en a rien a foutre de la france valls, il travail au fond pour l'UE et pour sa poche (point avant).\n\nsi vous voulez pour comprendre je peux etre contre macron, veran, chriac ou jospin... mais je peux pas denier qu'ils sont doublement francais...\n\nc'est des gaulois... et c'est pas leur faute.\n\net ils sont aussi citoyens du systeme actuel, ils auraient été serfs du roi de france...\n\naprès moi je pense que c'est de la merde la 5eme republique ... mais pas la republique francaise... \n\naprès pour bien comprendre le probleme c'est un melange de zemmour et de messhia qu'il faut faire... messhia a voir sur i24 pour le spectacle :).\n\nen somme, demographie + way of life.\n\net le probleme c'est que beaucoup dans la republique francaise actuelle ont tendances a se comporter comme des vrais nazis...\n\nl exemple frappant c'est le cannabis...\n\nou la liberté d expression...\n\nun pays qui censure ces citoyens sur ce type de sujet, franchement c'est quoi mais une dictature?\n\nalors le plus drole dans cette dictature c'est de vouloir l'uniformiser au monde...\n\net le plus triste c'est cette fameuse déclaration des droits de l'homme, ou si tu lis, tu vois que c'est tjrs oui, mais... ou oui mais avec exceptions etc etc...\n\nle thc est un excellent vasodilatateur.\n\net la criminel...\n\nvalls est un fils de pute... again !\n\nc'est quoi ce bordel?\n\nje pense que quelque decapitations, genre la tete de valls calmerait definitvement ces petits connards de la licra et compagnie.\n\nrendre sa critique illegal... dictature totalitaire, ce que vous appellez l'universalisme.\n\npour conclure et que seulement zemmour \"le berbere :D, aka le zizou du servot\" et messiha a paris sur le nile... \n\nput1 l'egypte avant la criminalization du cannabis... omg... !!!\n\net pour tous les batards et les petites putes qui pensent que la censure c'est bon, et bien moi je trouve que vous buter comme des merde en chaine et systematiquement et methodiquement avec le blueprint 2.0 c'est cool fun et detentand (?)\n\nje suis presque pret a parier que meme sarko il support pas valls :).\n\nps moi je pense pas que cela puisse se regler pacifiquement, il a trop d'interet entranché et de batards qui ne peuvent pas voir leurs actes publiquement revelés... \n\nvoila ! a mort !\n\nbonne pacques.\n",
			"added": 1617541214
		},
		{
			"topic_id": 2,
			"title": "URGENT : ON DRAFT MAINTENANT LES INFIRMIERE ITALIENNES !!! URGENCE !!!",
			"body": "trop bon\n\nmario draghi c'est une pute low iq discipline de $GS... c'est un executeur. ca pense pas. ca fait et ca se tait.\n\noui c'est une chose.\n\n2. comme il fait le fascisti, on offre aux italiennes qui veulent pas se faire vaxxer de venir en france\n\n3. elles sont bien et gentilles et dynamique et ca fera du bien a tout le monde en france\n\n4. on espere que la mafia du sud peut tuer draghi, mais on pense, que c'est pas les cartels d'amerique latines...\n\n5. on draft pas dans le sud de l italie (sous rome)\n\n6. on espere que ca va faire reflechir draghi\n\n7. on hesite pas ca va les sauver\n\n8. et c'est europeen et des refugieés\n\n9. on offre meme de prendre leur malade (que du sud).\n\n10. on laise le nord crevé.\n\nvoila...\n\nfaut etre fort mr macron...\n\net devenir un hero italien... ca n a pas de prix :)\n\nsauver les !!!",
			"added": 1617608818
		},
		{
			"topic_id": 3,
			"title": "La polémique du jour !",
			"body": "Espace de discussion effaceable sur la polémique du jour, afin de libérer vos petits neurones, jusqu'au moment ou le tout sera effacé... ",
			"added": 1617649030
		},
		{
			"topic_id": 4,
			"title": "En tant que \"journaliste\", de ne jamais avoir parlé de la vitamine D et C ?",
			"body": "Je me demandais, vous etes tellement egoisite et egocentré, que j'imagine que vous ne vous sentez absolument pas coupable? coupable de ne pas avoir informé le bas peuple de l'opportunité que la vit. c, d et le zinc representait? J'imagine qu'o fon tant que vous avez votre salaire vous vous en foutez royalement des gens?\n\nje me demandais enfin ce qui vous a rendu comme ca? je ne connais aucun journaliste, juste un vrai correspondant de guerre \"free lance\" qui a dit que c't de la merde et hyper violent dur, aka nul.\n\nvoila voila... \n\npeut etre avez vous un avis?\n\npersonnellement, je ne sais pas si c'est du mépris, de la haine ou de la peine que je dois avoir pour votre classe...\n\nmais bon...\n\non s'en fout.",
			"added": 1618080551
		},
		{
			"topic_id": 5,
			"title": "Le micro-management de l'individu ne nuit-t'il pas à sa liberté?",
			"body": "L' excuse des operateurs d'état francais : c'est pour l'égalité, que je vais te reduire au rang d'esclave, pour qui je vais tout determiner à ta place et pour ton bien.\n\nokay merci, mais je suis pas ton enfant...\n\nenfin bon petite pensée.",
			"added": 1618118639
		},
		{
			"topic_id": 6,
			"title": "lol j t sur qu'on était lundi",
			"body": "et bin non...",
			"added": 1618122076
		},
		{
			"topic_id": 7,
			"title": "Cher monsieur Gérald Moussa Darmanin, avant de vous buter",
			"body": "vous serez torturez, cela sera avec la police francaise... eux comme nous victimes de votre system...\n\namusez vous bien et saluations a Rose-Marie... \n\n",
			"added": 1618500721
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 1,
				"body": "et kom ct pas clair : valls = pas francais. dehors, degage.",
				"added": 1617541460
			}
		],
		"2_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 2,
				"body": "apres y a tjrs moyen de faire la pute en utilisant les directeurs d hopitaux publics et privée pour eux qu'ils draftent... genre par proxy... comme ca on peut regarder le fils de pute de draghi et dire... ohhh on savait pas, on va regarder... aller fuck you.",
				"added": 1617609051
			}
		],
		"3_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 3,
				"body": "bienvenu @kazimir,\n\nOn peut ajouter la mosquée de Strasbourg et les subventions pour les aérodromes.\n\nUne opinion peut-être?",
				"added": 1617809759
			}
		],
		"4_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 4,
				"body": "Pour moi, l'idéal c't un peu April de tortue ninja ! Elle, elle allait partout, elle investigait, elle participait a l'action avec ses modestes moyens, et à la fin, elle faisit un petit reportage sur ce qui s'était passé... \n\ncomme quoi... ",
				"added": 1618085754
			}
		],
		"1_1HmG8hXdvaaMtgoxpkvNXBVfCoB44Yv3aG": [
			{
				"comment_id": 5,
				"body": "moi je note que tous ceux que tu qualifies de \"juif\", ils sont pas orthodox... je dis ca, je dis rien... le secularisme, ca me semble pas avoir que du bon...",
				"added": 1618085854
			},
			{
				"comment_id": 6,
				"body": "enfin, je pense, je suis trop individualiste pour tomber dans le racialisme ou ce genre de truc. De plus je ne comprend pas en quoi cela affecte ma question geostrategique ce que des petits bouffons du PAF font... \n\nle \"la plupart\" est choquant ! mais bon je crois en volaire ou plus exactement en la liberté expression...\n\naprès c'est naturel pour les criminels d'user de toutes les techniques possibles... ",
				"added": 1618087189
			},
			{
				"comment_id": 8,
				"body": "> [mrjack](#comment_4_1BsefYDX8Cvc8cN4ShdoAWBhfksfdg6mMH): Vous comprenez, ils ont réussi à faire ce qu'on osait pas.\n\nca je comprend pas... tu ne vois pas la difference entre le bien et le mal? dans le sens tu es attiré par les pratiques des individus que tu critiques?\n\naprès moi je deni pas que ces individus font parti d'un groupe seculaire à l'interieur de ceux nés d'une mere juive...\n\nmais la vraie question que aucun d'entre vous n'accepte de ce poser : \n\npourquoi ce groupe n'a pas reussi a s'imposer et a dominer la Chine?\n\nCa c'est la vrai question de la liberation.\n\nMais le probleme fondamental suivant,\n\nc'est qu en fait ce groupe d'origine de mere juive, n'est que l'epouvantail et le fusible utilisé par ceux qui comme eux sont \"seculaires\".\n\nEn gros si t avais une entreprise criminelle, et des \"faux juifs\" dans ton groupe, toi aussi tu les mettrais en avant, lorsque tu aurais des ennuis, afin d'empecher tes enemis d'avancer vers toi...\n\npersonnellement pour revenir a ton propos, je ne pense pas que cela soit la juiverie, mais bien au contraire \"le socialisme à la francaise\", dans le sens que pour etre un pedo violeur, il y a deja à la base un irrespect total de la volonté de l'autre...\n\nmaintenant voyons ta kill list :\n\n- dsk : je valide, pas de souci, il veut niquer le $, il est mort (encore des pds ces americains).\n- schwab : valide, il veut me \"reseter\" et me vaxxer comme sa propriété.\n- sarko? on met en stand bye.\n- hollande? on met en stanb bye (les 2 ont accepté un resultat d'une election)\n- rotschild? il a fait quoi? rien. et lequel? l'anglais avec ces chiens et son sequateur, c'est mon pote, pour l'instant.\n- jack lang? pourquoi? faut comprendre une kill liste ca va vite... on est pas la pour discuter, c'est du triage\n- fabius : je valide. avec toute sa famille (sang contaminé), il meurt. garanti\n- buzyn : je valide, elle meurt, avec ses enfants (vaccination forcé,) avec ses parents et leurs autres enfants et descandant... tu vois, chien, c'est ca la guerre... pas ce que tu fais.\n- levy : le marri, c'est qui? stand bye... ahh non, peut etre, ca depend s'il est content de vois agnes butter\n- cohn bendit : instakill\n- madzeff? c'est qui ca...\n- polanski : insta kill\n\nhanouna il est  né d'une mere juive? lol, je me demande qui dans les cité le sait?... ahhahaha...il fait bien \"le beurre\" de service... dans son emission de cons, ces chroniqueurs... olalala... ils sont... vivants.\n\nenfin bon... \n",
				"added": 1618119677
			},
			{
				"comment_id": 9,
				"body": "Ensuite : on peut donc dire que macmac c'est le vrai premier president francais depuis un moment?\n\nbon, donc sarko c t du fake son \"sapin de noel\" ou pas? \n\nfinalement a mon avis, le vrai probleme c'est des gens du type charlotte d'ornellas... pourquoi?\n\ncar au fond leur religion les empechent d'être un realiste et deux d'agir s'ils arrivent a percer leur mur des mensonges...\n\nmoi personnellement mon plus grand enemi : Pierre Mazeaud !!! lui il faudra tuer TOUS ces descendants sans aucune mesure d'exception... \n\ndonc pourquoi Mao & co ils ont reussi ? donc mon avis c'est a cause des gens comme d'ornellas : des neuneus...",
				"added": 1618122050
			}
		],
		"3_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 7,
				"body": "t es autiste !",
				"added": 1618118664
			}
		],
		"7_13QWCQKzDizk53GeB82izmVxzG2yocu1VS": [
			{
				"comment_id": 10,
				"body": "pour moi c'est vous les terroristes, soyons bien clairs, vous jouez dur, ca raise, vous callez, on raise... jusqu au moment, ou encore une fois, on gagne, pour nous c'est banal... un petit pay de merde... rien de plus... c'est plus pour le lulz et j'aime bien la bouffe :). rien de spé.",
				"added": 1618500807
			},
			{
				"comment_id": 11,
				"body": "au fait gégé, t as peut etre des neuves nieces cousins cousines /;)",
				"added": 1618500902
			},
			{
				"comment_id": 12,
				"body": "tu vois tu veux nous niquer, alors on te nique. c'est la vie.\n\nou tu redeviens un homme ou tu meurs en chien.\n\nrien de spé\n\nle lulz.",
				"added": 1618500935
			},
			{
				"comment_id": 13,
				"body": "si tu veux petit con, nous on veut la paix, mais on comprend que souvent pour la vivre il faut d'abord gagner la guerre et après ne pas relacher la vigilance, classique.",
				"added": 1618501001
			},
			{
				"comment_id": 14,
				"body": "sinon les nonhumans comme toi, et bien comme la pourriture, ils creepent... \"ca veut dire quoi creeper\"? demandes a tes neveux.",
				"added": 1618501043
			},
			{
				"comment_id": 15,
				"body": "I am definitely losing my time with those low iq, couldn't we please just import all the know how on how to make it all (just guides, I don't say to make it, just to have the know how) and foreclose this shit show :).",
				"added": 1618501098
			}
		]
	},
	"comment_vote": {}
}