{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"","body":"Multiple Shooters Reported in Odessa/Midland Shooting long before USPS Van hijacking (news)\n\nsubmitted 5 minutes ago by jackthebutholeripper\n\nIf this post seems disjointed, it's because I wrote it in a hurry.\n\nCops kill shooter (video): https://www.liveleak.com/view?t=k1U2a_1567294874\n\nThe official story is that there was only one shooter in Odessa/Midland today, who was killed by police and that earlier reports of multiple shooters were actually just the result of confusion caused by the shooter jacking a USPS Mail Van on I-20 before being shot down by police at a Cinergy movie theater in Odessa.\n\nThe articles are all over the place.\n\n3:42 PM update of News West 9 (KWES) timeline: https://archive.li/fPXSl\n\n4:45 PM update of News West 9 article reposted on 9 News (KUSA): http://archive.li/7bWIr\n\n    UPDATE:Midland police say one suspect is in custody as of 4:45 p.m.\n\n    ACTIVE SHOOTER REPORTED STAY INDOORS FOR BOTH cities\n\n    Police confirm a second shooter is in the areas driving a stolen mail van.\n\n    Officials are responding to active shooters in Odessa and Midland.\n\n    According to the Department of Public Safety, the shooter is in all Gold Passenger car armed with a rifle and headed from Odessa to Midland.\n\n    Midland police said one DPS trooper has been injured.\n\n    According to Midland police, the shooters were driving from Midland to Odessa on I-20 when they stopped and shot a DPS trooper, before traveling to Odessa.\n\n    MPD believes the suspects traveled to Home Depot and switched vehicles to a stolen mail van and a small white Toyota truck before traveling back to Midland.\n\nWe can clearly see that not only were multiple shooters reported before the Mail Van was hijacked, but that they were even reported as stealing the Mail Van together at one point.\n\nonly do we have of multiple shooters (explained away later as a simple misunderstanding) and archives showing that they were reported as such from the beginning:\n\nWe also have archives showing that thesun.co.uk and CNBC both reported at one point that police sources told News West 9 the shooting was \"planned by a group.\"\n\nthesun.co.uk:\n\n    Police sources told News West 9 the shooting was \"planned by a group\" - although the motive remains unclear.\n\nArchive of excerpt from CNBC article republished on michaelsavage.com: https://archive.li/QKUdm\n\n    One of the suspects is reportedly at a Home Depot in Odessa while another is believed to be at a Cinergy cinema in Midland.\n\n    [...]\n\n    The shooting was “planned by a group”, police sources told News West 9.\n\nOdessa Police Chief Michael Gerke Press Conference videoMP4\n\nVideo transcript here\n\nIn the video at about 2:30 he's asked about the Mail Van and states that the multiple shooter narrative was a result of confusion caused by the Mail Van hijacking, which is clearly not true.\n\nHe's also a fucking dope btw,,\n\nThere's also this CBS 7 Timeline which describes many key details much differently than pretty much every other article, most likely due to rushed reporting: http://archive.li/ulew3\n\nWhat's more, on August 15th local news sites reported on Facebook posts warning of a mass shooting being planned by multiple people in Lubbock, Odessa, and Midland, Texas; regarding them as \"fake news\" and a \"hoax.\"\n\nCBS 7:\n\n    The Midland and Odessa Police Departments are letting the public know that a post circulating on social media about an alleged shooting threat is a hoax.\n\n    The following comes from the Odessa Police Department:\n\n    The Odessa Police Department was recently made aware of information being shared on social media sites about potentially armed persons being detained by the Lubbock Police Department, prior to them heading to the Midland/Odessa area.\n\neverythinglubbock.com (KLBK):\n\n    On Tuesday, several audience members reached out to EverythingLubbock.com concerning a message going around social media about a potential mass shooting threat at Wal-Mart locations in the area.\n\n    EverythingLubbock.com reached out to Captain Ray Mendoza with the Lubbock Police Department. He said officers are aware of the message, but that it is false.\n\n    The message said, “Whatever you do this weekend do not go to Wal-Mart for nothing at all pass this on to family and friends. Got this info from a police officer that is a family member they arrested a man for gun threats and he told that he was not the only one and that his accomplices will be going to different Wal-Mart stores and shooting. Not a game this is real……”\n\nPolitifact also reported on the \"hoax\" as part of their partnership with facebook, linking to one of the posts, which was made August 13th and shared 1300+ times, on what looks like some teenage girl's fb page. Worth noting the text of the screenshot she posted suggests she is not OP. (I'd obviously prefer not to post links to some random teenagers fb btw, but it's the only example politifact provided)\n\nShe made another post about it three days later, on August 16th: https://archive.li/7nBUp\n\nNote that her posts only mentions Lubbock specifically, whereas other articles noted threats against Odessa and Midland as well, meaning that her posts do not represent the totality of the \"hoax.\"\n\nAnyone's guess what grapevine some idiot teenager could have heard that through; blame politifact for choosing her post as the only example, not me.\n\nI tried to reverse image search the screenshots on tineye but it returned 0 results for both of them, so the actual origins of the \"hoax\" remain unknown.\n","language":"text/plain","encrypted":false,"added":1567354699}],"comment":[]}