{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [insurgo](#comment_2_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Once having followed that, user can run once:git clone https://github.com/HelloZeroNet/ZeroNet.gitThen before launching ZeroNet from its qube:cd ~/ZeroNet/ && git pull origin && ./zeronet.py --tor always --fileserver_ip $(qubesdb-read /qubes-ip)\n\nDin't realize/forgot, that whonix had onion grater.\nBut it seems to kill pip communication. Are there any instructions for getting the py3 version of zeronet working?\nhttps://github.com/HelloZeroNet/ZeroNet/tree/py3",
			"post_id": 5,
			"date_added": 1557681740
		},
		{
			"comment_id": 2,
			"body": "> [insurgo](#comment_4_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Right. The py3 branch has some conflicts and cannot be merged into master as it is today.\n\nThat's not what I meant. The python3 version adds quite a bit more dependencies to ZeroNet which the python package manager(pip) needs to install(see README on the py3 branch). However (by the looks of it) whonix blocks any connection pip tries to make to the internet, so the packages can't be downloaded and for some there isn't a packaged version available in the OS repo `base58`(in requirements.txt) for example. One way around this would be to manually download the packages an then install the local download with pip, but that seems somewhat too hacky for me to be practical(updating those will be annoying).",
			"post_id": 5,
			"date_added": 1557768241
		},
		{
			"comment_id": 3,
			"body": "> [insurgo](#comment_6_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Templates don't permit direct communications to internet by default. You could temporarily permit internet access in the template settings if I recall, but that would leave you with unmaintained libraries, which is not desirable.  \n\nIt's not that, it works fine for normal templates. I already made a script that does an automated install on a freshly cloned fedora29 template. (I can send it to you, if you want to try it for yourself) It's something that Whonix does.\n\n>dependencies will make their way into Whonix repos\n\nHonestly, I don't think they'll do. They are like pretty python-pip exclusive. The fact that so many even are in the OS repo is surprising to me considering that you'd not typically expect npm, cargo or maven(or whatever that java things was called) packages to be there either.\n\n>Not a fan of unmaintained code running into whonix-ws template and template dependent qubes.\n\nIt isn't really unmaintained code, you'd just need to update it every once in a while.\n\nI also just realized the the Whonix wiki recommends installing ZeroNet to the appVM and not to the templateVM. I don't think that this is a good idea, an attacker exploiting a bug in ZeroNet shouldn't be able to permanently compromise your appVM(by adding some lines to a `.py` file in zeronets installation directory, for example)",
			"post_id": 5,
			"date_added": 1557770037
		},
		{
			"comment_id": 4,
			"body": "> [insurgo](#comment_7_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Can look into it. send it over ZeroMail :)\n\nDone!\n>Avoid Third Party Package Managers\n>There are many third party package managers besides APT, however they lack the security safeguards that are standard in Debian. Popular examples are pip and node.js.\n\nAll of my yes. Nevertheless py3 requires these dependencies.",
			"post_id": 5,
			"date_added": 1557773661
		},
		{
			"comment_id": 5,
			"body": "> [insurgo](#comment_9_18UFtLHDzWDN1um1NphCGuTW4QnTsBaNH2): Does this resolves the problematic?\n\nI haven't tried it. Nofish himself said, that you should not use the new updater zite to update from `0.6.x` to `0.7.x`. Probably because it doesn't update pip libs and will, thus fail to restart once its done updating. It's really only meant to update from `0.7.x` to `0.7.x+1`",
			"post_id": 5,
			"date_added": 1557945086
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}