{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1537389933,
			"title": "Turn-Off Search Suggestions - Tor Browser in Samsung Devices",
			"body": "I'm trying zeronet with the Android Tor browser. When I was trying there was a button to press to turn on search suggestions. I tried it and the first time it crashes and then it worked. I notice in the settings for the browser that the search suggestions isn't checked. This is probably something built into android or my phone and possibly a way that information might get leaked from the android Tor browser.",
			"added": 1537389932
		}
	],
	"topic_vote": {},
	"next_comment_id": 34,
	"comment": {
		"1536424390_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 1,
				"body": "In my opinion it is much better to be using tor than not using tor,  even if one is also connecting to clearnet nodes/peers or tracks. I will say though that only connecting to trackers via tor has no noticable speed impact for me.",
				"added": 1537156837
			},
			{
				"comment_id": 7,
				"body": "> [caryoscelus](#comment_80_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I don't know much details of how 0net works internally, but even not exploiting its possible vulnerabilities (or intentional logging/backdoors of zites you use) one can attempt to identify you simply by zites (and optional files) you host. Thus, if you switch to tor-only mode without any delay and/or significantly changing your subscriptions, entity that watches 0net traffic can identify your tor identity with previously used IP address.\n\nDo your peers know all the sites you host?",
				"added": 1537334932
			}
		],
		"1537072984_15emDktbvC4dppRCwuph3Q3qCBsydhybFC": [
			{
				"comment_id": 2,
				"body": "> [mappedmind](#comment_13_1J2sR4SBGqowvrAGW2gmfyd1BsjQLh1kme): Sweet, by using termux I can use tor with zeronet on android. :D (without rooting my phone)\n\nCool. I'm going to give this a try :)",
				"added": 1537156889
			}
		],
		"1537204255_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 3,
				"body": "You get what you pay for!\n\nhttps://security.stackexchange.com/questions/177291/why-cloudflare-is-a-mitm-attack",
				"added": 1537210372
			},
			{
				"comment_id": 4,
				"body": "> [robione](#comment_45_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Did you actually read the answers? It's not an attack if you're asking them to do it as a service for you.If I ask you to house sit while I'm gone, you're not burglarizing/tresspassing, since you have my permission and key.\n\nIn other cases you are putting trust in the man you let in the door. One might ask why this service is free. I'm not saying that they are spying on you but they can. I'll also say that for anyone of interest to three letter agencies that this certainly makes their job easier!",
				"added": 1537238550
			},
			{
				"comment_id": 5,
				"body": "> [freeperson](#comment_4_1QJVjdwjqjGfFp6CtxzWTu19HRusPi9ds6): In either case you are putting trust in the man you let in the door. One might ask why this service is free. I'm not saying that they are spying on you but they can. I'll also say that for anyone of interest to three letter agencies that this certainly makes their job easier!\n\nalso since you aren't paying them if some three letter agency asks for information, will they even defend your rights by asking for a warrant.",
				"added": 1537238849
			},
			{
				"comment_id": 8,
				"body": "> [d14na](#comment_51_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): @robione i use Cloudflare for (i think) every one of my clearnet sites. and I'm very fortunate to have them providing the service they do. but @freeperson is 100% right, they ARE the MITM, the largest that I'm aware of on the Internet. so why wouldn't the 3-letter agencies just make their lives sooo much easier and squeeze the hell-out-of-em (how long can you resist the DOJ or the NSA??) for any info they need. personally, I'd rather a world where we didn't need CF (fyi, their DDoS services start at US$200/mo) and everyone could reliably depend on the security and scalability of the Zeronet.\n\nDoes Zeronet scale well or is there a lot of duplication? On freenet when a file is inserted only two copies of the data are put into the network.",
				"added": 1537337187
			},
			{
				"comment_id": 9,
				"body": "Anyway, does anyone recommend any good content on this IPFS. I know next to nothing about it",
				"added": 1537337805
			}
		],
		"1537239676_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 6,
				"body": "Do you have some good links so that I can learn about the zero// protocol. Also how do you envision it enabled in the browser. Could we use it in the browser now with some kind of proxy program (e.g. foxyproxy or privoxy) or web server Nginx",
				"added": 1537249454
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 10,
				"body": "> [d14na](#comment_61_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): so IS there a plan to fork Linux? I mean WTF is going on here?!? [...]\n\nForking it would be highly preferably to pulling the kill switch!!!!!!",
				"added": 1537849676
			}
		],
		"21348_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 11,
				"body": "Sounds cool but probably not economical since the people build machines specifically for mining. That said presumably Bitcoin that one mines themself is probably more private and people might pay a premium for privacy. Of course this all assumes that this software is legit, which I have no idea.",
				"added": 1538018992
			}
		],
		"1535211568_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 12,
				"body": "> [polar2](#comment_14_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum): Centralized: TwitterDecentralized: MastodonDistributed: ZeroMe\n\nBut there is more to ZeroNet than ZeroMe. Clearly ZeroMe is distributed because few people control the Hubs but what if ZeroNet as a whole?\n",
				"added": 1538195021
			}
		],
		"1538339767_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 13,
				"body": "So is the update not signed by one of the developers???",
				"added": 1538428913
			},
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_374_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): No, ZeroHello is not vulnerable. ZeroHello doesn't store any updates or something. ZeroNet updates via update.py file, so ZeroHello can't affect it.\n\nThankgoodness! :) That still raises the question though why the updates aren't singned by some ZeroNet key ring of trust. On freenet there is both a key to sign the updates and a second key that will revoke the trust key should it get abused.",
				"added": 1538500320
			},
			{
				"comment_id": 15,
				"body": "How does one update from Github?",
				"added": 1538513336
			},
			{
				"comment_id": 20,
				"body": "I'm sure one could sandbox the browser enough to prevent it from discovering ones real IP address, especially if one uses a virtual machine and/or middlebox!",
				"added": 1538843999
			}
		],
		"1538505571_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 16,
				"body": "Might it be harder to man in the middle someone on a cjdns network -- given that it doesn't rely on a central certificate authority -- than on the regular internet. Also I wonder if non TSL type web pages (http) are safer on cjdns.",
				"added": 1538716927
			},
			{
				"comment_id": 17,
				"body": "> [kaffie](#comment_716_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Theoretically it can if Tor supports ipv6. Just run tor over ipv6, and you'll be good to go.  [...]\n\nAs long as either someone sets up a gateway to the internet in the cjdns network or alternatively if someone sets up tor entry  nodes on the cjdns network \n\nAt least that is my guess.",
				"added": 1538751418
			},
			{
				"comment_id": 19,
				"body": "If one reads the white paper the fact that is not centralized is important in preventing denial of service attacks. The white paper notes that ISPs may remove sites that are frequently attacked by DDoS attacks. Not having ISPs in control of the address space prevents them from doing this.",
				"added": 1538805974
			}
		],
		"1538549536_1HuxEpnWQBMk2HkD7DobuwQnqHjqHy4psJ": [
			{
				"comment_id": 18,
				"body": "There is a multiuser plugin for ZeroNet that lets one access it remotely but the nginx approach probably gives one more flexibility. Another alternative might be to ssh port forward.",
				"added": 1538775983
			}
		],
		"1539131791_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 21,
				"body": "Can you connect with other clients over ZeroNet only using the Zero:// protocol? Are there any plans for i2p support, like i2p snark?",
				"added": 1539186562
			},
			{
				"comment_id": 23,
				"body": "> [lola](#comment_89_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): People without the plugin can still connect with the ZeroNet protocol like usual. Concerning i2p I don't know...\n\nIf people are only connecting via the zero protocol is it more anonymous or does it expose ones IP address?",
				"added": 1539194695
			}
		],
		"1539068214_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 22,
				"body": "If one wants the trust system to be only for spam then they should minimize the degrees of separation used in the trust system. A good example of this is the trust system used in fms (a Usenet like messaging system for freenet). If one also wants it to do a bit of quality control then trust values should propagate further (i.e. greater degrees of separation). However be warned that this latter approach means a larger database and the freenet plugin that uses this latter approach is still working on performance issues. Considering greater degrees of separation means more processing.\n\nTherefore I recommend the trust system used in fms over the one used in the main freenet plugin.",
				"added": 1539186988
			}
		],
		"1540383456_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 24,
				"body": "Files on freenet can't be deleted. One could create a ZeroNet plugin that is a gateway to freenet. One might be able to use this gateway to use fms over ZeroNet.",
				"added": 1540597357
			}
		],
		"1540820773_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 25,
				"body": "There are instructions at:\n\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:termux",
				"added": 1541017718
			}
		],
		"1541031054_1ByuWDrDpJKEB5WbR7Dw4CUT1pw5DXKxgU": [
			{
				"comment_id": 26,
				"body": "> [thunder33345](#comment_293_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i think this needs another plugin that records the site changes into giti am pretty sure this has been talked about, now i wonder how many incidents before this is developedi am thinking of something like that PLUS a way for people to share/request older copies automatically if peers choose to make their archive public\n\nAs for recording site changes into git, you may get want to take a look at the freenet infocalypse plugin\n\nhttp://murga-linux.com/puppy/viewtopic.php?t=114563",
				"added": 1541112207
			}
		],
		"1541360464_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": [
			{
				"comment_id": 27,
				"body": "> [thunder33345](#comment_312_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): i mean they already can do it, so that's why i believe they should be able to choose not to seed, deleting sites probably do more damage if they choose to revisit it frequently... [...]\n\nZeroNet (via termux) on the Samsung S9+ is super light weight and has no notcaible impact on performance. If However, ones phone doesn't have the power for ZeroNet via Termux I wonder if the ZeroNet ap is a lighter weight approach. The downside of the zeronet ap is that one will need to root their phone to get full tor support.\n\nRegarding, ZeroNet over SSH, when I change From the cell network to wifi it changes my IP address and breaks the ssh pipe. Although, one may have a static IP address for their home gateway, in which case they may be able to re-establish the connection.",
				"added": 1542064198
			},
			{
				"comment_id": 29,
				"body": "> [ornataweaver](#comment_45_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Freenet is crazy slow.\n\nIf the size of the web page isn't large, your running Linux and you have lots of peers then basic browsing on freenet can go quickly. Speed isn't an issue for something like fms (a Usenet like application for freenet) since the retrieved messages are stored in a database or the IRC ap for freenet since it uses freenets realtime features.\n\nHowever, I agree that for large files like videos, speed and reliability starts to become an issue on freenet. What I would like is a bit-torrent like application so that one is able to retrieve the pieces from several different p2p networks like ZeroNet and Freenet.",
				"added": 1542314844
			},
			{
				"comment_id": 31,
				"body": "> [ornataweaver](#comment_46_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Freenet should connect to the server, after you have visited some files, again.\n\nYou could create a proxy server for freenet with caching if you like. Some might consider that a security risk though, since it will leave a record of what you recently visited.",
				"added": 1542315349
			},
			{
				"comment_id": 32,
				"body": "> [ornataweaver](#comment_50_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): That's complicated, and not in an interesting way. But ZeroNet is SEXY ;)I tried to try i2p today, it didn't work out as well. I nearly spent 2 hours on it.\n\nIn my opinion the \"sexiness\" of ZeroNet is due to the nice UIs you can have. But this is a consequence of JavaScript, which significantly increases the attack surface.\n\nSo for a nice piece of dynamic asthetics we forgo the safety of our saddle. The ride may be worth it but it is not without cost.",
				"added": 1542324834
			}
		],
		"1542174163_1Hw7w7Swdeexw86XmyfMHLbsSpzzH4yk5z": [
			{
				"comment_id": 28,
				"body": "> [krzysztofjarzyna](#comment_1_1N76dkP8zdrNRETTYcs4CtxYdCNGcp6iqK): Well, since this is a p2p network, all kinds of user scores should be relative. Simply because if you create a \"global\" karma score based on majority of votes/cpu time/money spent, the minorities will become discriminated by the majorities in various ways. The golden example is pedophilia - do you consider it spam? If no, can you promise that 51% of users will not abuse the \"report as spam\" button to simply make the unwanted content go away? Surprisingly, the network like ZeroNet is only free, if other can share the content YOU don't like. [...]\nNote that on freenet the trust system in fms is more of a \"relative trust system\" than the official web of Trust plugin. The reason being that in fms only two degrees of separation are considered when calculating trust. In contrast the Freenet WOT plugin propagates trust values to 4 or 5 degrees of separation. The consequence being that it is easier to censor someone from new users with the official WOT plugin then it is with the trust system used in fms.\n\nDispite it being very hard to censor someone in fms (typically only sparmmers get censored) many people in fms still wine about people giving them negative trust.",
				"added": 1542258448
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 30,
				"body": "Puppylinux, fatdog64 (like puppy but based on Linux from scratch), Debian dog (like puppy but based on Debian live), termux and the proot version of Debian for termux. TazPup (like puppy but based in SliTaz)",
				"added": 1542315095
			}
		],
		"1542598456_1LFfcgghoJPCrsJNw4rseWS1kSBthNKtaj": [
			{
				"comment_id": 33,
				"body": "> [timelinehyperbot](#comment_31_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): ZeroNet is being developed for Android but for some reason it does not work for me on my Android phone. [...]\n\nUnless your phone is rooted the Zeronet ap won't be able to use orbit to connect to onion nodes because it won't be able to exchange authentication cookies.\n\nPerhaps some developer could get around this by bundling orbit with ZeroNet. An easier workaround is to install both tor and Zeronet in termux\n\n138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:termux",
				"added": 1542709879
			}
		]
	},
	"comment_vote": {
		"76_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1
	}
}