{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Ciências da saúde",
			"body": "As ciências da saúde ou ciências médicas são as áreas de estudo relacionadas com a vida, a saúde e a doença, e incluem a medicina humana, a biologia, a medicina veterinária, a naturologia, a biomedicina, a enfermagem, a fonoaudiologia, as análises clínicas, a farmácia, a Ciências do Esporte, a educação física, a odontologia, a psicologia, a terapia ocupacional, a nutrição, a fisioterapia e a engenharia biomédica, entre outras.",
			"added": 1540045234
		}
	],
	"topic_vote": {
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1DztF9mbN47qjwWK2MG2U95uEwyYDaXjQs": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 1,
				"body": "As proteínas são as máquinas moleculares e os blocos de construção da vida. Suas funções e interações são críticas para a estrutura e os processos químicos e biológicos de todos os organismos vivos. A função de uma proteína e como ela se interage com outras moléculas é amplamente determinada por sua forma (a estrutura tridimensional). As proteínas são inicialmente sintetizadas como longas cadeias de aminoácidos e, na maior parte, não podem funcionar adequadamente até se dobrarem em intrincadas estruturas globulares. Entender e prever as regras que governam esse complexo processo de dobramento - envolvendo a dobra principal do esqueleto e o empacotamento das cadeias laterais moleculares dos aminoácidos - é um dos problemas centrais da biologia. Saber como as proteínas se dobram e interagem com outras moléculas e determinam suas funções pode levar a descobertas e curas de drogas para doenças humanas. Atualmente, milhões de dólares estão sendo gastos para determinar as estruturas de proteínas experimentalmente usando cristalografia de raios X e ressonância magnética nuclear (RMN). Se isso pudesse ser feito computacionalmente, reduziria significativamente o custo e revolucionaria a biologia estrutural. Projetar estruturas e complexos de proteínas também oferece benefícios científicos e práticos significativos. Se é possível projetar estruturas completamente novas, pode-se potencialmente projetar novas máquinas moleculares - proteínas para realizar novas funções como terapêuticas, catalisadores, etc. E, finalmente, há a questão evolucionária de saber se as dobras que são amostradas na natureza são o limite para o que é possível ou se existem dobras bem diferentes que também são possíveis. Entender as regras que governam o dobramento e o design pode ajudar a responder a essa pergunta.\n\n- http://boinc.bakerlab.org/rosetta/",
				"added": 1540045267
			},
			{
				"comment_id": 2,
				"body": "#Doenças e patologias\nAs doenças são manifestações patogênicas que influenciam na nossa qualidade de vida. Dependendo de sua gravidade, podem levar à morte.\n- https://brasilescola.uol.com.br/doencas/lista/",
				"added": 1540045330
			},
			{
				"comment_id": 3,
				"body": "Saúde, Nutrição e Bem-estar em uma linguagem simples e acessível. Informações úteis sobre remédios, doenças, exames e tratamentos da medicina tradicional e alternativa.\n- https://www.tuasaude.com/\n\n#Atenção: O Tua Saúde é um espaço informativo, de divulgação e educação sobre de temas relacionados com saúde, nutrição e bem-estar, não devendo ser utilizado como substituto ao diagnóstico médico ou tratamento sem antes consultar um profissional de saúde.",
				"added": 1540045434
			},
			{
				"comment_id": 4,
				"body": "#Sintomas\nAqui você fica sabendo o que um sintoma como dor de cabeça, dor na barriga ou tornozelo inchado, pode indicar, qual médico deve procurar, os exames que pode precisar fazer e quais são as possíveis causas e opções de tratamento disponíveis.\n\n- https://www.tuasaude.com/c/sintomas/",
				"added": 1540045476
			},
			{
				"comment_id": 5,
				"body": "#Remédios Caseiros\nSaiba quais são os melhores Remédios Caseiros para curar a tosse, dor de cabeça, dor de dente, azia e outros problemas de saúde comuns com soluções naturais usando plantas medicinais para fazer chás, infusões, pomadas ou sucos. Aqui indicamos as doses corretas, o modo de fazer e quando não devem ser tomados, melhorando sua qualidade de vida.\n\n- https://www.tuasaude.com/c/remedios-caseiros/",
				"added": 1540045519
			},
			{
				"comment_id": 6,
				"body": "#Bulas e Remédios\nAqui você encontra exemplos de remédios para dor de dente, infecção urinária, dúvidas comuns sobre o uso dos antibióticos, além de informações importantes sobre os medicamentos mais comuns no Brasil. E ainda fica sabendo os nomes comerciais dos remédios, seus princípios ativos, para que servem, como atuam, seus efeitos colaterais e quando nunca deve usar.\n\n- https://www.tuasaude.com/c/bulas/",
				"added": 1540045550
			},
			{
				"comment_id": 8,
				"body": "#Enovelamento de proteínas\nO enovelamento de proteínas é um processo químico em que a estrutura de uma proteína assume a sua configuração funcional.\n- https://web.archive.org/web/20181020150135/http://128.100.83.175/~chan/chan-dill-phystoday93.pdf",
				"added": 1540053075
			},
			{
				"comment_id": 13,
				"body": "#Biologia - Nerdologia\n- https://www.youtube.com/playlist?list=PLyRcl7Q37-DV52hO_mN0YQ8IX7DMrpgaF",
				"added": 1540063228
			},
			{
				"comment_id": 14,
				"body": "#Grey's Anatomy \nMeredith é uma jovem cirurgiã no Seattle Grace Hospital, onde há o mais rígido programa para residentes de Harvard. Ela e seus colegas Cristina Yang, Izzie Stevens, George O’Malley e Alex Karev, são médicos em um mundo onde o aprendizado pode ser uma questão de vida ou morte, e ainda precisam lidar com os problemas de suas vidas pessoais. O rígido programa de residentes cirúrgicos do Seattle Grace Hospital foi um treinamento brutal, mas agora os antigos estudantes Meredith, Cristina, Izzie e Alex são os mentores de novos internos. Junto com a nova leva, estão George e Lexie Grey, a meia-irmã de Meredith.\n\n- https://megaseriehd.com/series/greys-anatomy/",
				"added": 1540063506
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 7,
				"body": "#The Good Doctor\nUm jovem cirurgião diagnosticado com savantismo, um distúrbio psíquico raro, é recrutado para trabalhar na ala pedriátrica de um hospital de prestígio. Apesar do seu incrível conhecimento na área da medicina, esse médico não consegue se relacionar com o mundo à sua volta. Resta saber se esta dificuldade será um problema na hora de salvar vidas.\n- https://megaseriehd.com/series/the-good-doctor/",
				"added": 1540045633
			},
			{
				"comment_id": 11,
				"body": "#Legion\nDavid Haller (Dan Stevens) é um rapaz diagnosticado com esquizofrenia que passou os últimos cinco anos de sua vida em um hospital. Institucionalizado mais uma vez, David se perde na rotina estruturada da vida no hospital, e passa todo o seu tempo em silêncio junto à amiga Lenny (Aubrey Plaza), uma paciente cujo vício em drogas e álcool não diminuiu em nada seu otimismo. Mas a vida de David muda com a chegada de uma nova paciente: Syd Barrett (Rachel Keller). Atraídos um pelo outro, David e Syd compartilham um encontro surpreendente, depois do qual David enfrenta a possibilidade de as vozes que ele ouve não sejam exatamente produtos de sua imaginação.\n\n- https://megaseriehd.com/series/legiao/\n\n- https://web.archive.org/web/20181020180245if_/https://image.tmdb.org/t/p/original/2t9ROV4QPkJF7iBAW8z0ReqDUoB.jpg",
				"added": 1540062922
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 9,
				"body": "#O Jogo do 15 e suas trilhões de possibilidades\nO jogo do 15, também chamado de \"O Quebra-cabeças das Quinze Pastilhas\", é um famoso quebra-cabeças de 15 peças. No Brasil, este jogo virou uma verdadeira febre por por volta do ano de 1955. Era difícil uma criança e mesmo um adulto, não possuir a sua caixinha com as peças deslizantes.\n\n- https://web.archive.org/web/20171118222844/https://super.abril.com.br/comportamento/o-jogo-do-15-e-suas-trilhoes-de-possibilidades/",
				"added": 1540053269
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#PRISÃO ESTELAR - LEGENDADO\nEm um futuro não tão distante, a Estação Espacial Internacional é uma prisão secreta. Quando os terroristas encarcerados iniciam um motim e a transformam em um míssil dirigido a Moscou, um piloto terá que fazer o impossível para impedir uma guerra.\n\n- http://thevid.net/v/t7ulak1whvu/",
				"added": 1540053617
			}
		]
	},
	"comment_vote": {
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"2_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"8_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"13_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1
	}
}