{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1608116811,
			"title": "Клевета есть? А если найду?",
			"body": "В Госдуму внесли законопроект, который устанавливает уголовную ответственность за клевету в интернете. Наказанием по статье может быть штраф до миллиона рублей, принудительные работы на срок до двух лет, арест на срок до двух месяцев или лишение свободы на срок до двух лет.\n\nВ пояснительной записке указано, что сайты часто обладают большей аудиторий, чем СМИ, при этом не имеют регистрации. Законопроект должен устранить этот «пробел правового регулирования» и ввести ответственность за клевету в сети. Автором инициативы выступил депутат от «Единой России» Дмитрий Вяткин.",
			"added": 1608116810
		},
		{
			"topic_id": 1634849312,
			"title": "Мигранты штурмуют границу Польши из Беларуси",
			"body": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1634848528_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU\n\nМигранты штурмуют границу Польши из Беларуси\n\nНезаконные власти Беларуси наладили доставку мигрантов из Ирака к границам ЕС.\n\nПольские пограничники пытаются не допустить незаконных мигрантов, восстанавливая забор.\n\nТолько за один день польскую границу пытались пересечь 524 мигранта.",
			"added": 1634849310
		},
		{
			"topic_id": 1635512257,
			"title": "Вирус бешенства",
			"body": "http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?watch=1635509040_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU\n\nНемного о том, почему нужно прививаться от бешенства как можно скорее, если вас укусило какое-нибудь бродячее животное.\nНа видео показано проявление одного из симптомов бешенства  – водобоязни. Мужчина просто не может пить, потому что при каждой попытке его горло сжимается.\n\nСрочная прививка от бешенства с последующим курсом ещё может спасти жизнь, но если её не сделать, то это фактически смерть. Инфекция будет необратимо распространяться по нервной системе.\nЧерез какое-то время начнутся головные боли, повысится температура.\nПотом начнутся галлюцинации, агрессия и, как показано на видео, водобоязнь.\nА дальше паралич частей тела, прекращение мыслительной деятельности и смерть. И ничто не поможет.\n\nМожно на 100% сказать, что мужчина на видео мёртв, потому что известны лишь единичные случаи, когда выживали после этого («протокол Милуоки»).\n\nИ если не попытаться сделать прививку сразу, то запустится процесс, ведущий к неминуемой смерти.",
			"added": 1635512254
		}
	],
	"topic_vote": {
		"1634849312_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": 1,
		"1635512257_1AomR2Zxw55MStkSqbcCCT8L6xjak5WYhU": 1
	},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}