{
	"posts": [
		{
			"id": "8ea2c508-c716-425f-88e5-f169d9106168",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"body": "Imagine if this headline read\n>WHITE NON-PROFIT HELPING PREPARE\nCan you imagine the outrage and vitriol?\n>How DARE those white people take care of their own?!\nIt would be nice. Maybe we'll see that one of these days.",
			"time": 1567216854483,
			"files": "[{\"name\":\"Hispanic Non-Profit Helping Prepare.png\",\"thumb\":\"bdb7cc61ecf7b074b62974c58f873bdd7c05cb1a-thumb.png\",\"size\":2189582,\"type\":\"image/png\",\"original\":\"bdb7cc61ecf7b074b62974c58f873bdd7c05cb1a.png\",\"directory\":\"1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm\"}]"
		},
		{
			"id": "f32479d7-eb31-4e5e-9e5e-9fb2b60af0d2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62f3f571-cbd3-4b07-89f5-fe17303ca129",
			"body": ">>62f3f571-cbd3-4b07-89f5-fe17303ca129\nI'll believe the wall when I see it. Until then, it's psychological warfare.",
			"time": 1567703945393,
			"files": "[]"
		},
		{
			"id": "9d140845-4879-4bf4-b227-ecf6d9321e90",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a0dbe760-dc29-4805-a987-e80c3e1b4c29",
			"body": ">>a0dbe760-dc29-4805-a987-e80c3e1b4c29\n>Pay a fraction of a cent in decentralized money per post to eliminate spam\nThat shit's retarded. Glows and political shill interest groups have budgets that they could use for strategic spamming. Most anons aren't going to want to give money for this sort of thing, especially if they don't fully trust whoever they'd be giving money to. Whoever came up with this autism clearly hasn't ever organized and fund-raised for events before. If you paywall your participants even a little bit, participation will suffer and over time the majority of the people posting will trend toward people with the wrong motivations, thus killing the culture. It's not even a good money-making scheme because rewarding voluntary donations has a better payout than preventing free-riders for this sort of thing. I've tested that assertion repeatedly and get the same result every time. Nevermind the fact that Bitcoin is a pain in the ass to get ahold of in some areas without doxing yourself to some kike middleman company.",
			"time": 1568221641260,
			"files": "[]"
		},
		{
			"id": "9798e930-ae32-479e-bcf1-37b76da872a5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a4f93ff1-ef2c-4aa6-b14d-9586377be6b8",
			"body": ">>a4f93ff1-ef2c-4aa6-b14d-9586377be6b8\n>he declared on Sunday after an explosive-laden drone took out Hezbollah’s media center in Beirut.\nIt's funny how the kikes knew to target the media apparatus. It's almost like they understand the power of mass coordinated news or something, hmmm...\n\n>>f37553c1-7c1f-40c6-8b76-6397a0dc7f1a\n>Kamikaze drones are a new wrinkle for a state actor. \nI wonder what model drone they're using for this. If they're too expensive, wouldn't it be impractical? On the other hand, if they're too cheap that would prevent plausible deniability of the intent.",
			"time": 1568222305760,
			"files": "[]"
		},
		{
			"id": "56743b41-0585-4634-ae8e-62cb835ceeb4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a4f93ff1-ef2c-4aa6-b14d-9586377be6b8",
			"body": ">>651c0a48-6c92-4145-8e8f-116527afe445\n>What is the functional difference between a kamikaze drone and a missile, a bomb, or artillery shell?\nThe ability to claim that the drone was \"just there to observe.\" Otherwise nothing. I'm not sure how the cost of one of their drones compares to their missles though.",
			"time": 1568223426760,
			"files": "[]"
		},
		{
			"id": "59231a0b-353a-4a63-8a50-d3b440e91538",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>515f642c-c126-41af-b969-b0d4d157345c\n>This for example https://www.bitwage.com/\nThat's great, but where the hell do you find local work that pay in crypto? That's what we need the most right now, I think. We need a crypto-craigslist. There's all kinds of work I'd do if someone offered me Bitcoin or Ethereum or, hell, even Namecoin for it. Right now most of the crypto-work I've seen revolves around tech jobs like software development and database admin stuff. Don't miners ever just need someone to do blue collar work? Don't you have cars that need cleaning? House repairs or improvements? Lawn maintenance? Landscaping? Meal prep? Someone to drive you to your appointment in the city so that you don't have to find a place to park? Someone to pass out business flyers? If nobody is offering crypto for normal jobs, how the hell is it ever supposed to find its way into the hands of normal people?\n\n>>fd43142b-9528-4a2a-b0c5-54476021e0b5\n>they never thought that far ahead.\nWell he is a kike. A lot of them have that problem.",
			"time": 1568225157860,
			"files": "[]"
		},
		{
			"id": "ccc6ba1b-7e63-4f25-8e80-4199c7d355b4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "a0dbe760-dc29-4805-a987-e80c3e1b4c29",
			"body": ">>a0028c73-3a1a-4a55-b4b0-ef59e92732ca\n>They now have obnoxious kyc rules in place but that has just resulted in more anonymous alternatives springing up all over the place.\nWell shit, don't just end on a cliffhanger. What are some of them?",
			"time": 1568500970392,
			"files": "[]"
		},
		{
			"id": "fcbe5902-9237-4a37-a051-b755587fd522",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ca7ae61e-f2b7-4ef6-b2f5-ad16469498d2",
			"body": "Thanks for letting us know. I'll check it out.",
			"time": 1569189614370,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}