{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1568783263,
			"title": "ZeroNet Loader - A browser plugin to easily go to ZeroNet domains",
			"body": "I put it on https://github.com/sprite-1/zeronetloader\n\nIt redirects in 3 ways:\n1. Normal http:// links to ZeroNet domains are redirected\n2. Typing `zn` and a space and the address to the omnibar will directly navigate to ZeroNet address\n3. Typing `z.net/` prefix on the address bar followed by the ZeroNet address will also redirect.\n\nHere is demo https://i.imgur.com/978JnpS.gifv\n\nI'm fairly new to ZeroNet as a whole so I don't know if the TLDs I supported are the only ones there. If not, let me know\n\nFirefox - https://addons.mozilla.org/firefox/addon/zeronet-loader/\nOpera - https://addons.opera.com/en/extensions/details/zeronet-loader/",
			"added": 1568783262
		},
		{
			"topic_id": 1575994787,
			"title": "Persian board?",
			"body": "I noticed that there has been an influx of posts in Persian recently and thought it ought to be time to create a board for them? Since this is the English board for (obviously) English convos",
			"added": 1575994785
		}
	],
	"topic_vote": {
		"1570159543_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1575688284_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"1575755429_1DfbNohg1UZxEJXMGS4W46bSSh3AgzmJ4r": 1,
		"1577574820_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1580487512_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": 1,
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1591022032_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1568783263_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_1042_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Great, this extension looks awesome! I have a few ideas: [...]\n\nOkay I'll add those TLDs, I saw it before but I wasn't sure if the name.yo service was still being kept up to date because I tried registering a domain there and it has been stuck at \"Pending...\" status since yesterday\n\nI orignally wanted to tie it to the `z://` protocol but apparently the extenson API doesn't support custom protocols other than the typical ones (http:, ftp:, mail:, etc) if I wanted to add a custom protocol, it would need to be preceeded by `web+` so for example, `web+z://` which I feel is very unwieldy to type. I made the extension with the goal of making typing ZeroNet addresses on the addressbar easier/faster.\n\nThat's also th case for custom TLDs. If I type `talk.zeronetwork.bit.zeronet/something` in the address bar, it gets automatically converted to a search query, that's why I used a non-existentbut \"valid\" domain `z.net` as prefix because it ending in `.net` makes sure it isn't converted to a search.\n\n> [filips](#comment_204_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Great extension. However, there are still some popular ways (actually ideas) how to access ZeroNet domains that aren't included in this extension. It would be good to support them until ZeroNet has standard way for accessing domains. [...]\n\nSee my response to gitcenter above for the probems I can see from that but I'll add them either way\n\n> [kusoneko](#comment_16_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): There is a likely issue with using the .bit TLD as the gif shows, the .bit TLD is also usable in clearnet using Namecoin's blockchain as a DNS, instantly redirecting all .bit domains to zeronet's makes reaching the clearnet sites difficult, as in you need to manually go through the blockchain to find the associated IP to visit it as this extension instantly redirects you to the zeronet site if it exists?\n\nIs there an easy way of determining if a `*.bit` domain is in the ZeroNet or in the Namecoin side of things?",
				"added": 1568841433
			},
			{
				"comment_id": 2,
				"body": "> [filips](#comment_208_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): It is handled as URL in Firefox, so you should also support it.\n\nOh okay sweet, I didn't know that, I was developing the addon with Opera as my browser",
				"added": 1568841649
			},
			{
				"comment_id": 3,
				"body": "> [filips](#comment_208_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Also, is there any update about approval for Firefox?\n\n[6 of 23 in the queue](https://b.catgirlsare.sexy/i3dc.png)",
				"added": 1568841926
			},
			{
				"comment_id": 4,
				"body": "> [kusoneko](#comment_34_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): The issue as I see it for your extension is that it is possible for someone to have both a zeronet and a clearnet .bit site and your extension would forcefully pull you into the zeronet one even if you intended to see the clearnet one.\n\nAn easy alternative I could think of is to just disable `*.bit` to begin with since I've already added the `*.zero` and `*.zeronet` TLD detection. So instead of just typing `blog.zeronetwork.bit`, the user would have to type `blog.zeronetwork.bit.zero` or `blog.zeronetwork.bit.zeronet`. In both cases, the `*.zero` and `*.zeronet` part gets stripped on redirect. This way would give it clear distinction between ZeroNet and non-ZeroNet domains I guess.",
				"added": 1568856278
			}
		],
		"1570213999_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 5,
				"body": "Is there a desktop client? 🤔\n\nEdit:  \nThat isn't made in Electron *",
				"added": 1570281903
			}
		],
		"1575616132_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 6,
				"body": "> [nickwa](#comment_448_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Yes, I read that on a reddit post of the 8chan mirror's on the clearnet\n\nWhich reddit post? I checked out the 8chan subreddit but apparently it's banned now for some reason",
				"added": 1575698274
			},
			{
				"comment_id": 7,
				"body": "> [nickwa](#comment_455_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): You can take out the \"old\" part if you like the new layout of reddit\n\nI'm permanently on the old layout via the Preferences setting\n\nAnd thanks for the link!",
				"added": 1575700446
			}
		],
		"1575704355_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "> Even this post is just a waste of time and won't generate any useful replies, but I guess I'm just addicted to writing and would happily post for the sake of posting... and it's become a habit I'll never be able to ditch.\n\nHave you tried writing a novel?\n\n> Maybe we will finally get our privacy back... as your data and online presence will simply be drowned out by all the noise that is being flooded out there on a daily basis.... all the people out there trying to go viral and get noticed... etc.\n\nThinking like that is futile. It only seems like an overwhelming amount of data to you because you're one person. Big companies like Google, Facebook, etc have long started developing algorithms to sort all these big data in an easy-to-peruse state. So privacy will only get worse and worse as time goes on if things stay the way they are with regards to people's mindset about them.\n\nIt's true that the average person doesn't matter to the government but with everything moving to systems run by algorithms, it will only get easier and easier to track down a person they're looking for.",
				"added": 1575704887
			}
		],
		"1575994787_1Q5f5jQxn2duHpJCCdWhYCkeM8pGagUDdp": [
			{
				"comment_id": 9,
				"body": "> [mohammadk](#comment_2_1PDPPefGNqG8B7u98dMcDUc5gggHpRex6L): we are trying to find a decentralized way to communicate cuz we are facing Internet blackout soon in Iran :(\n\nDamn, that sucks, more power to you guys! Also I didn't make this thread to mean anything negative, I just thought it would help both parties find the content for their languages easier\n\nIn addition to ZeroNet, there's also Firechat as a means of communication that relies on meshnet to connect users with each other",
				"added": 1575996452
			},
			{
				"comment_id": 10,
				"body": "> [mmtech](#comment_2_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP): i think apps like firechat didn't work cuz IoT in iran dosn't develop so much...\n\nBut Firechat just uses WiFi, not the internet, so the more people who use it, the more access everyone will have because it connects to each other's phone",
				"added": 1576047523
			}
		],
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 11,
				"body": "Cookies and Cream",
				"added": 1576154942
			}
		],
		"1576592495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "The typical response to this would be\n\n\"Then just fork it\" or \"Then just make your own\"\n\nBut that can only go so far especially with how complex and massive certain kinds of applications have become (see:browsers). So it is indeed disappointing when pieces of tech which are hard to recreate end up going with the trend and dumbing down their user interface/features",
				"added": 1576616449
			}
		],
		"1577653744_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 13,
				"body": "> [randomshits](#comment_352_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I'm not a fan of PewDiePie, I really enjoyed Rosman's RewardYouTube Rewind 2019 - Rossmann Edition\n\nLouis is a great man",
				"added": 1577668560
			}
		],
		"1577612746_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 14,
				"body": "web.archive.org",
				"added": 1577698488
			}
		]
	},
	"comment_vote": {
		"19_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": 1,
		"40_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": 1,
		"21_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"316_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"305_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"51_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"53_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"322_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"303_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"455_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"457_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"284_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"3_1PDPPefGNqG8B7u98dMcDUc5gggHpRex6L": 1,
		"179_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"1305_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"363_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"352_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1513_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"1_1P6v3BNYRaf7aFrPDfDCwaPC2pEArCnk89": 1,
		"2_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"72_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"4_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7": 1,
		"36_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1
	}
}