{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_16UYTd5pL9rt4hhxQAmfX89QqmjJB58xDx": [
			{
				"comment_id": 1,
				"body": "oh how incredibly random, slightly odd but mainly awesome (!) to have stumbled across this.  I truly marvel at what the odds/the mathematical probability of me finding this, given that not only have I found zeronet itself within the past 48 hours - but then to have clicked on a link for 0list out of the massive crapshoot of randomness linked to on the zeroname page (whomever admins that needs to work on at least implementing an alphabetically-based group sort function) - but, all of this is made ever more strange given that for the past few weeks i've myself been hard at work developing a platform so similar it sounds like this exact (!!!) same thing.\n\nI'm about 2/3rds of the way complete - I've got the overwhelming majority of the UI/design elements finished and need to just make some further decisions based on the backend and security aspects of it.  Like you I'm heavily reliant on a lot of the same stuff - mainly that it's also utilizing webRTC - incorporating elements of bitchute/the webtorrent framework and i'm implementing the use of something to act as an automated altnerative - essentially what you mention with the webseed option, on a dedicated cloud cluster specifically used to spread around the hashes/seed info...and mostly because I wish to implement a livestreaming functionality because I see this as crucial to drawing any real traffic and gaining the userbase necessary to draw in other developers.\n\nAnyway, I don't intend to bore you with a book but I would obviously love to chat with you and collaborate if you are interested, I think a lot of good can come from this especially with the orwellian tactics being increasingly employed by youtube/google/facebook etc to de-platform anything remotely controversial giving a spotlight to this issue.  I've noticed many more people mentioning the need to develop alternative platforms dedicated to anonymity/decentralization/free speech lately, would love to potentially play a part in helping move things along as it looks like you've got a very good start going.  I'm still getting a handle on this whole zeronet thing, but I can be reached at n e t l u x e@protonmail(.)com  \n\nCheers :)",
				"added": 1502638135
			}
		],
		"1_1Matyuy7Bh8MLppq55cbyWaTjbC3rGFry7": [
			{
				"comment_id": 2,
				"body": "not working, homie",
				"added": 1503526023
			}
		]
	},
	"comment_vote": {}
}