{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Faut-il buter Daniel O'Day, le CEO et les big shareholders de Gilead ($GILD)?",
			"body": "Selon naturalnews (www.naturalnews.com/2020-09-15-gilead-death-threats-french-doctor-hydroxychloroquine-covid19-cure.html ou www.naturalnews.com), les violeurs et empoissoneurs d'enfants de l'etat le plus corrompu au monde, les usa, menacent de mort Didier Raoult.\n\nC'est hélas un classique de cet état servant une ideologie dite satanique, dont le but est de violer des enfants tout en les empoisonants (ogm, pesticides, pollutions intentionnels de l'eau, fluorides etc etc etc) afin d'en faire une classe d'esclaves mutants.\n\nOn l'a vus avec les menaces que la CIA et le departement d etat on fait contre la ministre de l'agriculture concernant l'invasion des ogms en france a travers les wikileaks exposant l'ensembles des messages diplomatiques americains.\n\nIl faut savoir dire non à ses fils de putes pour ne pas finir esclaves comme le peuple américain (ou les indiens d'amériques pour une reference plus ancienne).\n\nEt la seule manière que ces crétins comprennent, c'est la violence totale, cartelstyle.\n\nIl faut donc procéder de manière brutale pour que les enculés de wall street et tout ces fils de putes de lobbystes et parlementaires américains comprennent dans le sang et la chaire de leur so called élite qu on ne fait pas chier a la france.\n\nVous croyez que ces fils de putes menacent souvent des russes? ou des chinois, oui oui, ils ont capturés meng au canada... mais vous allez voir... \n\nDonc pour revenir a gilead...\n\nPremièrement Raoult ne comprend pas l'acharnement des medias qui protegent les violeurs d'enfants contre l'HCQ... tres simple... Il faut comprendre que ces enemies de l humanité aiment operer dans un cadre legal. c'est a dire que pour eviter les essais cliniques complets sur leur vaccins, avoir une immunité legale concernant leur produits, ils ont besoins que l'on soit dans une situation d'urgence, sans remede alternatif efficace. Donc logiquement si l'HCQ marche, ils ne peuvent pas avoir leurs derogations.\n\nDeuxièment Raoult a tendance a promovoir des medicaments efficaces mais anciens, les anciennes molecules, et ca ca les venerent pour leurs yachts (patentes).\n\nDonc le CEO de Gilead avec ces potes, menacent de mort Didier...\n\nC'est pas tolerable. Il faut donc les attaquer.\n\nPremière etape convoquer le CEO de Gilead a l'embassade de france a washington D.C. pour un talk. En clair l informer qu on va le buter, mais surtout pour avoir une headline dans le services de news financiers du genre : CEO OF GILEAD CONVOQUED AT FRENCH EMBASSY IN D.C.\n\nEnsuite, Il faudrait donc buter la famille de O'Day... c'est a dire prendre son ou sa fille mettre un flingue dans sa bouche et tirer avec la reproductrice dans la ligne... bammm... on bute d'un coup la mere et un fils... ensuite immediatement flinger le reste de la famille, ce genre de fils de pute on tendance a se reprodruite a outrance...\n\nEnsuite on attend la petite headline : \" GILEAD CEO FAMILY DEAD, INTERIMARY CEO NOMMINATED\"\n\ncomme ca les fils de putes comprennent, que c'est leur vie qu'ils jouent...\n\nla on attent quelque jours... le temps que cela se calme, on envoie chier pompeo avec des bruits de pets quand il appelle...\n\ns'il faut quelque petit \"surface\" des sous marins lanceurs d'ICBMs pret de la cote est (vivement que cela soit detruit aussi)\n\njuste histoire de calmer les enculer du pentagone... genre fermer vos gueules sales merde.\n\net ensuite... pour le fun, juste avant l enterrement de sa famille on but O'Day...\n\net comme ca les fils de putes auront compris... fuck with us, we fuck you back...by killing you.\n\nmais bon c'est ca la difference... entre le monde libre... et celui ou polanski est libre... \n\nmais c est ca la france, la vraie...\n\nmais rapeller vous les petites bites, putin, il le fera, et c'est pour ca qu on l aime... et avec le CCP... quand on touche la toile de l araignee, la partie ne fait que continuer... the silk webs of darkness... are thin, light even invisible for some, but there they were, are and will be... for as long as the heavens are above earth :).",
			"added": 1600237133
		},
		{
			"topic_id": 2,
			"title": "la meuf en voile...",
			"body": "au lieu de parler des 100'000+ individus qui se font arreter pour du shit chaque année... au lieu de parler des juges qui laissent des violeurs d'enfant perpetuer leur mefait continuellement... \n\nau lieu de se demander t arrives pas a mettre de tes tests en place? genre drive by? trop dur? tu fais quoi pour tes reformes structurelles (un jour on va venir, et la greece c'etait tout doux, on a pas retracer la population... a peine... (la russie c't un peu plus hard) mais un vrai? aahahha...\n\nau moins ca a un peu avancer sur les \"sqatters\"... quelle honte.\n\ndonc la meuf elle vient en voile ! mais power to her !\n\npourquoi? \n\nJ'en ai rien a taper comment elle s habille... par contre y a que du porc auj dans le non vegan... si t es pas contente c est la meme chose\n\nmoi c'est pas les violeurs MUSLMANS que je haie, mais les violeurs, blancs, jaunes, juifs, noir, je m en fou, a mort.\n\nmoi c'est pas les voleurs MUSULMANs que je haie, mais les voleurs, bulgares ou magrhebins.\n\nmoi c'est pas les agresseurs Musulmans que je haie, mais les agresseurs de tout bord...\n\npar contre les petites merdes qui veulent une loi a geometrie variable, je pense au petit nez crochu, pour qu ensuite leur pote monte des camps de viols d enfant sur des iles... la je dis stop.\n\net\n\nN\nI\nH\nA\nO\n\nü\n\non va pas se faire sodo par cette bande de sauvage, le jesuite dnas la salle d'attente puis a la maison... bak 2 physics, applied.\n\net si tu pense que taiwan c est notre spring board... t as vus les amibitions de la marche forward quand le take off s'opere...\n\nla vraie question, c est le wall... pas le notre :).\n\ndonc la petasse elle met ce qu'elle veut, bikini included, je m en tape....\n\napres un review du voile pour les incultes... selon ma modeste compréhension du system...\n\n1 submission before God... only... pas le pere, le frere ou le mari.\n2. pour afficher la modestie. dans le but de pas etre une pute qui use de sa sexualité feminine pour diverse goal. \n3. je comprends que ca gene les petits trainée qui se font des carouzels de bites jusqu a leur wall... ca vous affiche comme des merdes sans nom et ethique...\n\noui alors je sais c est brutal pour les petits chevaliers blancs qui souffront sous l oppression d'une bete usage et formaté dans le deuil de ces année \"liberée\" ahaha...\n\nouvre les yeux avant qu'elle te seche la moitié et plus de ce que t'as....\n\net pas la peine d entrer dans une petite crise... \n\nc est la realité, tu le sais, cope and advance. move. forward...\n\nallz \n\nhave fun.\n\n",
			"added": 1600415094
		},
		{
			"topic_id": 3,
			"title": "ah les guignols...",
			"body": "on veut pas d'incidents des terrorists vert pdt les 24 du mans... \n\net restez assure ces petits batards on leur roulerait dessus avec plaisir, mais c'est pas dans le reglement (carmagedon 2) et surtout ca va abimer les machines...\n\non veut juste notre circuit secure... safe and secure pour que la course soit.\n\npreparez vous...\n\nau pire c est un petit training...\n\nperso sniping et body recovery training :). brutal... who cares...\n\nimaginez le danger en fin de ligne droite quand ces pds pourrait faire leur coup c 'est dangereux pour la vie des pilote et staff, alors qu on a pas prévu ces conditions de course...\n\nsinon on se la fait a la sortie des mine de diamnad and afrique du sud et on prend le matos pour degommer ces pds la.... \n\ndonc safety first...\n\ny a deja assez de risque ineherent pour les bonhommes dans les bolides... mais ca c est la course... naturel...\n\npas de trafficage sur la voiture des autres (senna? ou l'autre?) et pas de niga sur la piste.\n\nmerci d avance.",
			"added": 1600415310
		}
	],
	"topic_vote": {
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": 1
	},
	"next_comment_id": 4,
	"comment": {
		"7_18QJHpnhj9ZPt6Un23MaZH8MGmzbt9ffaw": [
			{
				"comment_id": 1,
				"body": "1212",
				"added": 1600367984
			}
		],
		"2_14DD49E4i7XTVfi8WqSuV47Nuo1T66etmP": [
			{
				"comment_id": 2,
				"body": "moi mon probleme c est pas cette \"petasse\" en voile...\n\nmon probleme c est qu'il y a plus de bacon au mcdo parce que les reubeux ils ont peur.\n\nmon probleme c est que le the froid lipton il est ecrit en ARABE EN FRANCE !!! tout ca car ce fils de pute de sadiq khan avec ces autres potes violeurs ont pris le controle de londres car les pds du mi5/6 sont comme la cia entrain de sucer la bite des potes d esptein... \n\nca va me venere...\n\nensuite moi c'est l immigration massive... la france c est pas un fucking hotel, t as pas de droit d immigré car ton pays c est de la merde car t es pas capable d avoir un etat correct et en plus tu te reproduis comme des cafards de mauvaise foi.\n\nensuite moi je veux pas de call of prayer... le hasan tu vas le faire a djedha.\n\nensuite je veux tu putin de bacon a la cafete de l uni, bien gras qui gicle partout et si t es pas content avec tes potes semites tu te casses dans ton putain de desert et tu fermes ta gueule.\n\nmoi je veux un apero et si je veux de la weed avec un bien tu fermes ta gueule.\n\nkoi d autre, les sales loi dite raciste, tout ces connards qui ont soutenu la mort de la liberté expression, executé commee les geux de charlie hebdo de merde (sauf l economiste, il etait marrant). \n\npour le reste... simplement allez vous faire foutre...\n\net quoi d autres....\n\ny avait un truc...\n\nahhh oui...\n\nsucer les taxes pour que ta petasse il puisse produire 15 bastard pendant que moi je dois trimer entre 20 et 50% plus dur que dans d autre endroit tout aussi civilise ca me venere tellement.\n\ndonc ton pinard au sulfate tu te le fous dans le cul avec tes putins de glyphosate pour deserhber, de la meme manière tu me laisse bouffer mon saucission, ou franchement on va de donner a bouffer au cochons...\n\net ton histoire de blaspheme et tout ce bordel, same dans le cul ou alors on t envoie en express dans xinjang pour termier ton histoire net... ou alors on te butes et donne aussi a manger au cochon... ils vont etre pleins :).\n\nohhh putin le moment ou le nouveau tsar va officiellement entrer dans la salle du throne de la federation de russie... ca va deglinger... peut etre que c est pas la salle du throne ou de banquet, mais ca claque violent...\n\nmoi ce que je dis c est qui il faut y aller a la tchechen contre polanski et ses enculé de potes, sales pds, juifs etc on vous emmerdes, et par y  aller a la chechen, je veux dire comme vlad a grozny... on raze.\n\nbon.\n\nje bois peut etre pas assez d alcohol moi :).",
				"added": 1600447850
			},
			{
				"comment_id": 3,
				"body": "par contre ca me rassure le petit logo halal :).\n\nps parce que s'il ment on lui coupe la tete :).",
				"added": 1600448630
			}
		]
	},
	"comment_vote": {}
}