{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"1516525820_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1628034123_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 1,
				"body": "> [gamer](#comment_1_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): I agree.  Mobile devices are rather popular ;) Torrents on such devices are not a good idea.  There should be a solution that allows users on mobile to use the system without eating up all of their data. [...]\n\nI have an unlimited data plan. I'll torrent all month if I want to. All that I lose is prioritization after 22GB. The bigger issue is scheduling and bandwidth throttling ZeroNet to not interfere with other apps using bandwidth.",
				"added": 1528757920
			},
			{
				"comment_id": 2,
				"body": "> [gamer](#comment_4_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh): Bandwidth on mobile devices is generally more expensive than bandwidth at home, work, or on a dedicated server. [...]\n\nApparently ZeroNet doesn't seed bigfiles when the page isn't open, so is battery really an issue?\n\nAnyway, if you're not on an unlimited data plan, then that's a bigger issue on the users' own behalf than with ZeroNet.\n\nNot that I object to a data cap, but IMO it can be a last priority. Bandwidth throttling is more important and I think it can be as easy as setting what percent of time downloading and uploading take place, like a PWM fan, translating to what percent of bandwidth downloading and uploading take up.",
				"added": 1528820625
			},
			{
				"comment_id": 4,
				"body": "Another thing to add here is that these features can be obtained via rootless firewalls, but you sacrifice Tor availability, so I see the necessity in native support.",
				"added": 1528839278
			}
		]
	},
	"comment_vote": {
		"10_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"1_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1
	}
}