{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "¿Zeronet tiene un límite de capacidad?",
			"body": "Si somos los propios visitantes los que almacenamos los datos, ¿no existiría el riesgo de que al acumularse mucha información a lo largo del tiempo nos quedáramos sin capacidad? Dicho de otra manera, si somos 5000 usuarios y cada uno terminara subiendo 1 TB de información. ¿Dónde coño se guardaría?",
			"added": 1525793794
		},
		{
			"topic_id": 2,
			"title": "Aquí os dejo un modelo para expandirnos en otros foros",
			"body": "Hace dos años se inauguró ZeroNet. Un Internet alternativo que funciona a través de P2P al igual que Torrent y Bitcoin. ¿Qué consecuencias tiene esto respecto a la libertad de expresión?:\n- No hay servidor central. Por tanto, nadie puede tumbar nada.\n- Puedes tener anonimato absoluto fácilmente si lo combinas con Tor.\n\nEn el spoiler suelto un rollo en el que reflexiono acerca de la libertad de Internet y explico el origen de [b]ZeroCoches[/b]\n[spoiler]\nNo es ningún secreto que cada vez tenemos menos libertad en Internet: la Red de antaño era una especie de anarquía de información a la que sólo accedían frikis comedoritos con la mente perturbada de cara a la sociedad.  Es cierto que podría tener sus riesgos o usarse para actos poco éticos, pero en cierta manera allí residía su encanto. Con el acceso de Internet para todos, las autoridades se dieron cuenta del monstruo que se esconde bajo Internet.\n\nComo individuos racionales tendemos a buscar la verdad, huyendo de las censuras y de los prejuicios. Pero poniéndonos en la piel de los gobernantes nos interesa que el rebaño esté controlado, ya no solo por aprovecharnos de nuestra posición de privilegio como diría Marx, sino porque el objetivo de la sociedad es buscar la estabilidad. Aquí encontramos el origen de una lucha interna a la que seguramente muchas personas reflexivas hayan llegado: por una parte soy una persona racional y quiero ser libre para satisfacer mis curiosidades, pero por otra la libertad es peligrosa para la estabilidad social (Anarquía vs Sociedad, Anonymous vs NWO, Libertad vs Derechos...)\n\nEn cualquier caso, voy a dejarme el discurso iluminati de turno y voy a hablar de como surgió [b]ZeroCoches[/b]. Zerocoches es una reacción que se opone a la censura anteriormente mencionada y al borregismo de la sociedad, impulsados por los medios de comunicación y los políticos y patente en las redes sociales como Twitter.\n\nTodo estalló con el caso de la Manada: aunque para los medios de comunicación el caso se apagó hasta hace poco, en los foros se siguió el caso y se fue investigando, tal y como ocurrió también con otros casos polémicos como el de Juana Rivas (que dieron de lleno), y se dieron cuenta de que la cosa no estaba tan clara y de que había muchas dudas. Al salir la sentencia la borregada empezó a pedir las cabezas de los jueces por haber dado una sentencia que no les gustaba a pesar de no haber investigado ni haber leído la sentencia y miembros Gobierno y la oposición empezaron a usar falacias sentimentalistas para justificar \"los juicios populares\" frente a la justicia independiente actual. Como reacción a los foreros se les fue la olla y empezaron a abrir hilos defendiendo a los jueces (especialmente al del voto particular) y a hacer un CSI a la víctima (el cual es legal por usar fuentes públicas, sea o no ético). El dueño de FC (no se en otros foros) empezó a tirar cuentas, a tirar hilos y emitió una disculpa bajándose los pantalones para limpiarse las manos. Ayer se hizo otro CSI a un etarra y la censura golpeó de nuevo a hilos y cuentas (entre ellas la mía). Como respuesta, varios shurs crearon ZeroCoches tratando de buscar el Internet libre del pasado.\n[/spoiler]\n\nPara acceder a ZeroNet y, dentro de ella, a ZeroCoches, hay que seguir los siguientes pasos:\n\n1) Ir a [url]https://zeronet.io/[/url] y descargar\n2) Descomprimir la carpeta\n3) Abrir la carpeta y pinchar donde pone ZeroNet (ya estáis en Zeronet)\n4) Tenéis que pinchar en ZeroTalk y darle al idioma español\n5) Buscad un hilo donde se hable de ZeroCoches y pinchad la dirección\n6) Ya estáis en ZeroCoches",
			"added": 1525986199
		},
		{
			"topic_id": 3,
			"title": "¿Alguien tiene los vídeos del cirujano o enlace?",
			"body": "Quiero verlos para ver si definitivamente la justicia de este país es misándrica. Según comentan, están rulando por ahí y las participantes son conscientes de la cámara y no comprendo por qué la responsabilidad ha ido sólo para el hombre.",
			"added": 1552077685
		}
	],
	"topic_vote": {
		"1_16EJxMVkL1bSt42y3KwjCGFXMWRZ44mQr5": 1,
		"2_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": 1,
		"3_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": 1
	},
	"next_comment_id": 18,
	"comment": {
		"2_17mdQ1RaLCu1m2gqf4wosf15VWgccxuoUk": [
			{
				"comment_id": 1,
				"body": "Los que han compartido información pública o enlaces no han cometido ninguna ilegalidad, así que no os subrayeis.\n\nDe los periódicos no hay que fiarse, no hay más que ver la desinformación que metieron cuando se hizo el CSI con el objetivo de cagarnos a los shurs y que desde fuera nos pusieran a parir.",
				"added": 1525723148
			},
			{
				"comment_id": 2,
				"body": "> [yoksetioxd](#comment_4_17mdQ1RaLCu1m2gqf4wosf15VWgccxuoUk): Ya sabemos que no es ilegal, el tema es que le están dando bola a algo que es culpa de los medios, y todos sabemos que no les van a hacer nada porque si no ya lo hubieran hecho antes.\n\na ver, solo aclaraba por si algún shur se cagaba al abrir el hilo. Es culpa de los perioLISTOS que se han intentado lucrar a costa del caso amarilleando de más.",
				"added": 1525723344
			}
		],
		"3_1Jw2LsFMZ2tTJWc3ecjrHGdXpMscmxM1MP": [
			{
				"comment_id": 3,
				"body": "> [josu](#comment_7_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE): he creado un grupo de CSI en telegram\n\nsi lo pasas no estaría mal",
				"added": 1525724110
			}
		],
		"1_16EJxMVkL1bSt42y3KwjCGFXMWRZ44mQr5": [
			{
				"comment_id": 4,
				"body": "algún avance?",
				"added": 1525726589
			},
			{
				"comment_id": 5,
				"body": "por que me han baneado?",
				"added": 1525730895
			},
			{
				"comment_id": 6,
				"body": "soy hundirlaflota",
				"added": 1525730902
			},
			{
				"comment_id": 7,
				"body": "me cerraron el hilo del tutorial de la zeronet. me encendí y comparti el grupo de telegram, pero parece ser que la cagué",
				"added": 1525730954
			},
			{
				"comment_id": 8,
				"body": "principal",
				"added": 1525731014
			},
			{
				"comment_id": 9,
				"body": "bueno, es igual, me la suda",
				"added": 1525731113
			},
			{
				"comment_id": 10,
				"body": "tengo que estudiar, ya en verano conseguiré otra xD",
				"added": 1525731132
			},
			{
				"comment_id": 11,
				"body": "Al menos morí publicitando la Zeronet. A ver si creciera.",
				"added": 1525731350
			}
		],
		"1_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": [
			{
				"comment_id": 12,
				"body": "Muchas gracias por la aclaración. Entonces puedo deducir que ZeroCoches y ZeroTalk siempre funcionarán porque al ser solo caracteres \"donamos\" poco espacio y que los archivos más pesados funcionarán igual de bien que su popularidad (siendo más específicos, de las personas que lo comparten).",
				"added": 1525794414
			}
		],
		"1_14G2wv4cuxKPhE94pDN6ZEBtScjcm2uyGV": [
			{
				"comment_id": 13,
				"body": "resumen de lo del ataque DOSS?, información de los ejecutores?",
				"added": 1525983445
			}
		],
		"2_1H7QuXaGs9Qg4HQX99wJUU3Dh2sV2fk9Sr": [
			{
				"comment_id": 14,
				"body": "No veo práctico empezar el foro así. De primeras ya estamos dando nuestro correo electrónico y buscamos anonimidad plena.\n\nYo trabajaría por mejorar ZeroCoches. Seguro que hay alguna manera de mejorar la interfaz.",
				"added": 1525984914
			}
		],
		"2_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH": [
			{
				"comment_id": 15,
				"body": "Es un hilo que hice en ForoIngenieros, que sigue la misma mecánica que FC. Podeis colgarlo en FP y otros si eso.\n\nDe forocarros me banearon el dia del CSI al etarra :'(. Hay que reconocer que el foro está guay para determinadas cosas como para estar actualizado, pero me tiene mosca la falta de libertad de expresión y no me apetece estar pendiente de las RRSS para pillar una invi.",
				"added": 1525986919
			}
		],
		"2_1JWNCmquAPBEirtg5X5Nq61541iNDjTdqE": [
			{
				"comment_id": 16,
				"body": "¿Por que no cogemos un foro ya consolidado de la Deep Web?\n\nLo digo porque veo un esfuerzo inútil a día de hoy crear un foro en un servidor fijo. La gracia está en usar FC (a los que todavía conservéis la cuneta) y FP para todo y para temas chungos usar Zeronet. Si queréis un término medio pues algo habrá por la Deep Web en español o en inglés.",
				"added": 1526417528
			}
		],
		"3_12wH9Vw9gydwdHWQVRP1iZFpy9YyidBoHP": [
			{
				"comment_id": 17,
				"body": "+1",
				"added": 1552075790
			}
		]
	},
	"comment_vote": {}
}