{
	"title": "forever online的\n理想年代",
	"description": "leejarod's blog@zeronet",
	"links": "*   [This Site](http://127.0.0.1:43110/leejarod.bit)\n*   [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1544277198,
	"post": [
		{
			"post_id": 12,
			"title": "coding的page服务挂掉了",
			"date_published": 1544277092.172,
			"body": "本以来coding被腾讯收购应该会大幅度的提高稳定性，没想到还是不行呀，这么快就倒掉了，本打算把网站的导航页放在它上面的，这下麻烦了，国内基本没有可以免费使用的服务了。"
		},
		{
			"post_id": 11,
			"title": "其实大部分的服务可以放到git上来了",
			"date_published": 1542115827.969,
			"body": "作为一个不是科班出身的IT爱好者，编码其实远没有数据重要，git真是个好东西！\n\n要把所有的旧站点迁移到git hub上去了，数据量有点大，国内访问git hub还是不够稳定，暂时发现tencent与coding合作的功能不错，就是不知道以腾讯的德性会不会随时把服务给关掉。"
		},
		{
			"post_id": 10,
			"title": "云主机的价格能再便宜点吗？",
			"date_published": 1541899085.528,
			"body": "这两天发现google cloud赠送的300$已经只有50$了，也就是说每个月在云主机上的开支要50$才够，这价格对于老美来说真心不高，可对于在中国大陆的我来说还是有点受不了，只好想想办法使用网络的免费资源来解决了！\n\n我们有github，当然就可以放一个简单的主页了，好吧，我要把所有的网络资源再次都迁移回国内了，家中的主机要给力呀！\n\n为什么这些研究都不能得到经费保障呢，因为经费不是给一线人员用的呀，可怜的数据研究。\n\n11.11，大家节日快乐！单身狗的节日其实是每个人都应该享受的，毕竟也就那么一段时间可以享受。"
		},
		{
			"post_id": 9,
			"title": "机器慢，时间快",
			"date_published": 1540736139.396,
			"body": "还是睡不着，看着机器更新一下软件吧，\n\n刚好今天有《王者荣耀》的三周年晚会，看了一下，很不错，比CCAV的春晚好看多了，一个连游戏都不能包容的国度真是奇葩了一点。\n\n<div class=\"titlename c3\">安装[php-7.0]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时1267秒</span></span></span>\n</div>\n\n安装[phpmyadmin-4.4]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时12秒</span></span></span>安装\n\n[php-5.4]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时758秒</span></span></span>\n\n<div class=\"titlename c3\">安装[pure-ftpd-1.0.47]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时101秒</span></span></span>\n</div>\n\n安装[mysql-5.5]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时1118秒</span></span></span>安装\n\n[nginx-1.14]<span class=\"rs-status\">【已完成】<span><span class=\"rs-time\">耗时1466秒</span></span></span>"
		},
		{
			"post_id": 8,
			"title": "ubuntu使用记录（1）",
			"date_published": 1540731892.788,
			"body": "重新开始我的ubuntu学习记录，因为大量的时间浪费在了应用上，对ubuntu的基础还是很不熟悉，现在要好好重新练习一下了。\n\n今天在上面试着安装gitlab-ce版，结果一不小心安装了ee版，还没有安装成功，只好删除了，然后把bt面板也删除了重新安装一次，发现有个文件用root都无法删除，经过bing的搜索才知道要用chattr的-i属性的，文件用root不能删除时一般是可通知lsattr 来查看文件是不是被加上了i或a的属性。\n\n而同时发现被占用的80端口是一个之前bt中带的nginx占用了，lsof -i:80即可查看到占用情况。\n\niftop可以查看到当前的网络使用情况。\n\n现在的网络太慢了，我该睡觉了。"
		},
		{
			"post_id": 7,
			"title": "Google 云主机使用感受",
			"date_published": 1540723397.518,
			"body": "真快，也真贵，目前使用东亚的机房可以在中国大陆访问，如果会一些技术还可以把机器当成自己的梯子来用。\n\n不过使用起来的感觉真的很贵，这才几个月而已，赠送的$300费用已经用的快要没有了，数据放在外面的机房真的是不方便，又要想办法把机器迁移回国内的主机上来。"
		},
		{
			"post_id": 6,
			"title": "诡异的马云视频",
			"date_published": 1539847360.579,
			"body": "# 网上的一则央视03年采访马云的视频被全删除了，只找到了这个文章，网上很多人传言是96年的，其实认真看一下就会发现不可能，所以传言还是需要判断着看。\n\n# 令我好奇的是，目前马云与阿里都没有什么问题，为什么这么一个宣传的视频会被删除呢？\n\n# 为何马云总能五百块钱办成大事\n\n**五百块钱的软文鼻祖**\n\n　　马云第一次进京发展是1995年，这年马云仅用500元就制造出很大的动 静。95年秋，他带着中国黄页营销总监何一兵来到北京试水。为了在北京为中国黄页造势，马云首先想到的是，利用一家媒体来发表自己从杭州带过来的关于中国 黄页的资料。而这在当时是一件非常困难的事，因为当时政府对于互联网的态度还不明朗，因此北京媒体还不敢大张旗鼓地宣传互联网。对于网络高速公路的北京正 好有一场论战。一种观点认为，中国不能发展信息高速公路，否则将被西方发达国家所控制;另一种观点认为，中国必须加快发展互联网，否则中国将被数字鸿沟挡 在信息时代之外。\n\n　　钱锋是马云的朋友，在北京做BB机生意，得知马云想认识京城媒体后，他通过几个朋友的接力引荐将 《北京青年报》一个领导的司机介绍给了马云。怀着侥幸心理，马云将中国黄页宣传稿件交给了这位司机，同时塞给他500元钱。“不管什么媒体，发了就算你 的。”司机很有能耐，发了5个媒体，还上了《中国贸易报》头版。马云意识到了《中国贸易报》有眼光，马上找到了该报的总编，两人相见恨晚，连续谈了两天。 马云回忆起两人见面时的情形说道：“当时他和我一样不懂互联网，但是他觉得互联网肯定有戏，他说马云，我支持你。”这位总编带马云拜访了国家信息中心的有 关负责人。可对方显然不买账，顾左右而言他，话里话外的意思无非是堂堂国家信息中心怎会与一个个体户合作。\n\n　　之后这位总编又带马云拜访了 文化部、国家体委等，可同样没有实质进展。就在这个时候，马云认识了在中央电视台“东方时空”栏目工作的杭州老乡樊馨蔓。樊馨蔓非常仗义，虽然她听不懂马 云的网络模式，但却被他的热情打动了。樊馨蔓做了一件对中国互联网功德无量的事，她拍了一部名为《书生马云》的专题片，真实记录了马云在京的凄凉遭遇。如 今这部专题片弥足珍贵，片中可以看到当年马云在北京现场推销的画面，看到他到处碰壁到处吃闭门羹的画面。\n\n　　“在片子里，他就像一个坏人， 虽然滔滔不绝，但表情总有一点鬼鬼祟祟。他对人讲他要干什么什么，要干中国最大的国际信息库，但再看听者的表情就知道，人家根本不知道他说的是什么。”樊 馨蔓如此评说。这部片子是互联网早期在中国遭遇的真实写照。没多久，事情开始出现了转机。马云在《人民日报》信息部做了一次演讲，马云愤慨激昂地说：“对 于发展中国家来说，中国搭上的是末班车，错过了就很难再有机会了!。”时任《人民日报》总编辑的范敬宜，听完马云的演讲后深受启发，第二天就给中央打报 告，申请《人民日报》上网。报告很快就批下来了。《人民日报》上网工程启动了，《人民日报》上网之后所引起的轰动效应可想而知，马云也随之成了中央电视台 《东方时空》的采访对象。可就在这个成功的时刻，马云还是保持着清醒，在他看来，北京已经没有他们的机会了，因为大批的外资企业已经开始涌进，对于马云这 些既没有钱、又没有背景的人来说，若想在北京发展，何其艰难。于是思索再三的马云决定返回杭州，开始筹划他的下一步发展计划。\n\n**　　五百块钱请来顶尖高手**\n\n　 　4年以后，马云以月薪500元请来了阿里巴巴第一位世界级的合伙人，这位出身于台湾一个律师世家，同时拥有耶鲁大学法学院法学博士学位的高手就是蔡崇 信。他在纽约有过两年的律师工作经验，后又在瑞典银瑞达风险投资部任亚洲部总裁。对于蔡崇信能够在阿里巴巴这个未来电子商务的世界领袖还处在萌芽期就加入 进来，按照行为经济学的“锚定原理”有二种解释。\n\n　　第一种解释是，蔡崇信这粒闪闪发光的钻石主动要求同马云这个黑边牡蛎在一起，从此蔡崇信的定价体系就跟着马云走，就不是钻石价，而是黑边牡蛎的价格，尽管这种牡蛎非常罕见，但它卖不出钻石价。\n\n　 　第二种解释是，蔡崇信与马云因为工作的关系，相处一段时间以后，他发现马云具有杰出领袖的品格，而阿里巴巴则是一枚躺在黑边牡蛎里正在孕育的黑珍珠，如 果这个黑边牡蛎能有纯净的海水和深海的礁盘，这粒小小黑珍珠将会成为世界上最大最美最贵的黑珍珠。所以蔡崇信的胆识和眼光促使他行动起来，坚定地守护在阿 里巴巴这颗最耀眼明珠身边，这是上天对马云、蔡崇信及阿里巴巴公司的眷顾和呵护。\n\n　　蔡崇信之所以会加入阿里巴巴，源于美国《商业周刊》对 于马云的深度报道。在文章中美国记者是这么描述了马云事业的难度，他写到：进出口行业存在国界、关境、航运条件、专业知识、政策法规、语言、文化和风俗习 惯等各种各样的“壁垒”、“屏障”和“沟壑”，信息的流通极其不畅，由此派生出一个长得不能再长的“生产链”或曰“价值链”。从工厂完成产品或出口商收购 产品开始，到收妥货款为止，出口方这一端要经过报关、商检、船运、保险、议付等环节，涉及报关行、商检局、航运公司、保险公司、银行等各种专业服务机构， 进口方那一端照样也有一个类似的过程。这么多的环节将卖方和买方隔开了比地理上的十万八千里还远的距离。\n\n　　距离的远近可能还在其次，买卖 双方怎么互相找到对方，却是进出口贸易产生的先决条件。物理学上两点之间最近的距离是直线距离。互联网突破了这个物理局限。有这么一个网站，它让世界各地 的买方和卖方有了一个网上集市，买卖双方都不必远涉重洋，即可互相找到对方。美国人发现它了，以为它设在美国的硅谷，因为它最先的版本用的是地道的英语。 可是它却偏偏在中国，在中国原来更多地以风景闻名的杭州;创办这个名叫阿里巴巴网站的人，是杭州电子工学院英语教师出身的马云。\n\n　　为了阿 里巴巴网站的域名，马云费了不少心思。马云要的是一个全球讲各种语言的人都能熟记的名字。直到有一次在美国一家餐厅吃饭时，他突发奇想，找来了餐厅服务 员，问他是否知道阿里巴巴这个名字。服务员回答说知道，并且还跟马云说阿里巴巴打开宝藏的咒语是“芝麻开门”。之后马云又在各地反复地询问他人，经过这个 测试，马云发现阿里巴巴的故事被全世界的人所熟知，并且不论语种，发音也近乎一致。“从我外婆到我儿子，他们都读阿里巴巴。”就这样，一锤定音，马云将 “阿里巴巴”确定为公司的名字。\n\n　　1999年3月10日推出的阿里巴巴英文网站，不久就受到了风险投资的注目。蔡崇信一共二次到杭州探访 阿里巴巴。第一次，主要听马云谈自己的想法。第二次蔡崇信带着他的太太来了杭州，三人在西湖上划船，蔡崇信突然向马云提出要加盟阿里巴巴的意思。他突然对 马云说：“那边我不干了，我要加入阿里巴巴。”当时的马云大吃一惊，他的心突突突突后又突突了一阵，他心里明白人生最重要的选择来临，蔡崇信毫无疑问是马 云和阿里巴巴最需要的人，但马云深深吸了口气控制住内心的喜悦说：“你到我这儿来，我养得起你吗?我这每个月可就500元人民币的工资，你还是再考虑考虑 吧。”果然，蔡崇信的妻子也不同意他辞去高薪的工作，放下已经吃到嘴里的肉去阿里巴巴创业，可是在她和马云谈过之后，她也相信了阿里巴巴日后将大有前途。 蔡崇信的妻子说：“如果我不同意他加入阿里巴巴，他一辈子都不会原谅我。”在妻子的支持下，蔡崇信毅然放弃上百万美元的年薪加入阿里巴巴跟着马云干，每个 月的工资变成区区500元，1995年后就连珠三角地区的农民工都能轻松拿到这个数。在马云信看来，自己和蔡崇信同龄，而且性格完全不同，马“是往前冲 的”，而蔡是“看清楚才往前走”。以蔡崇信当时的收入，“可以买下几十个当时的阿里巴巴”。但他放弃了一切，加入了阿里巴巴，这买卖真是“赔了夫人又折 兵?”\n\n　　当然不是。在阿里巴巴上市之前有四个董事席位，雅虎一席、软银一席、马云一席、蔡崇信一席。上市之后，招股说明书里仍然写着，马 云和蔡崇信每人占有一席董事席位。在阿里巴巴合伙人制度中，有二个人是永久合伙人，一个是马云，另一个是蔡崇信。2014年(深圳)IT领袖峰会上，中国 工程院院士邬贺铨说，“阿里在美国上市后蔡崇信的财富将高达63亿美元”。蔡崇信1999年的果断放弃100万美元年薪，15年后却得到100亿美元的财 富，他才是真正的“打工皇帝”。\n\n　　后来，许多人问蔡崇信为什么要放弃百万美元年薪，而选择阿里巴巴时，他说：“阿里巴巴特别吸引我的第一 是马云的个人魅力;第二是阿里巴巴有一个很强的团队。1995年5月第一次见面在湖畔花园，当时他们有十几个人。第一感觉是马云的领导能力很强，团队相当 有凝聚力。如果把阿里巴巴这个团队和其他团队作比较，这个团队简直是个梦之队，这里有一些做事情的人，他们在做一件让我感觉很有意思的事情。做这个人生重 大抉择时，没有非常理智的依据，更多地来源于内心的强烈冲动，我喜欢和有激情的人一起合作，也喜欢冒险!所以我就决定来了，如此而已。”\n\n**　　那么，蔡崇信为何大加赞赏的马云团队?**\n\n　　首先，马云团队由一批干事的人组成，团队成员们各有短长、可以互相弥补，而且有相当强的凝聚力。\n\n　　马云是真诚地把每一个团队成员的情况和他们未来职业发展的思路向蔡崇信作了介绍。蔡崇信告诉马云：自己最欣赏的团队类型有二种：第一是足球型团队，第二是中国古代的戚家军作战模式。\n\n　 　马云曾在跟蔡崇信谈判时讲到过团队，他说：我们中国人认为最好的团队是“刘、关、张”的团队，再加上赵子龙和诸葛亮就更加十全十美，可这样的团队真是 “千年等一回”。再看看“唐僧团队”。唐僧是领导，也是最无为的一个，迂腐得只知道“获取真经”才是最后的目的;孙悟空脾气暴躁却有通天的本领，猪八戒好 吃懒做但情趣多多，沙和尚中中庸庸但是任劳任怨挑着担子，这样的团队无疑比“一个唐僧三个孙悟空”的团队更能够精诚合作、同舟共济。所以我们阿里巴巴人认 为这才是世界上最好的团队，在互联网低潮的时候，所有的人都外出跑业务，但阿里巴巴团队流失率是最低的。借用马云的话，一个人在黑暗中走，很恐怖，但是如 果是十几个人，200多个人一起在黑暗中手拉手往前冲就什么都不怕。马云还对蔡崇信说：“我不是让这帮人跟着我走，而是我跟着他们走。我每年向他们报告下 一年度目标，这些报告里面的内容很多来自他们的提议。”或许是马云的话深深打动了蔡博士。\n\n　　在蔡崇信来到马云家上班以后，马云对蔡崇信的 欢迎辞只有几个字——“就等你这样的人来帮我们成立公司。”蔡崇信就任CFO，并开始着手注册公司。他为18个创始人准备了一个完全符合国际惯例的英文合 同，上面明确了每个人的股权和义务，合同做得滴水不漏。蔡崇信的到来，使阿里巴巴开始真正规范化运作。另外，既精通法律又精通财务，且熟知国际惯例也为阿 里巴巴与国际化大公司的合作提供了方便，同时增强风险投资对阿里巴巴的信任。\n\n　　蔡崇信曾客观地对《福布斯》的记者说：“我以前是个律师， 懂得如何设立公司，并且能帮助公司筹集资本。我知道自己拥有其他人没有的知识，所以他们在那个方面很信任我。在我擅长的世界里，我感到非常自信、非常自 如。我没想过要大包大揽，我知道自己的角色是什么。”听了这些话，可以清楚明白地了解蔡崇信在公司的定位和职责分工。蔡崇信工作十分敬业，在湖畔花园炎热 不堪的夏夜里，满脸汗水的蔡崇信对着白板向第一批员工讲股份、讲权益，再让马云等 “十八罗汉”签字画押。马云无疑是幸运的，因为，若没有蔡崇信这样的人加盟，阿里巴巴或许注定会是一个家族企业，并以所谓“感情”、“理想”和“义气”来 维系团队。他也让阿里巴巴从一出生就逐渐正规化、国际化，并将“十八罗汉”的团队利益捆绑在一起，至少维系了8年的创业激情。\n\n　　蔡崇信的 加盟，还有一个重要意义——增加了阿里巴巴吸引国际投资(当时国内的创业投资尚属萌芽阶段)的说服力。毋庸置疑的是，在阿里巴巴早期的创业团队中，出类拔 萃、能够打动国际资本的，除了马云以外，可能找不出第二个。对于马云的妻子、同事、学生和朋友，非常了解他们的马云允诺的只是“连长”、“排长”这类头 衔，说明这些人的个人能力一般，相互配合起来以后就是一支打不死的铁军。"
		},
		{
			"post_id": 5,
			"title": "皖新数字书真是个好生意",
			"date_published": 1539757091.336,
			"body": "收到一个电子书的小盒子，简单看了一下，就是一块1T的硬盘加小型路由器的功能，收费是2999呢，真赚钱。盒子是[皖新传媒销售](http://www.ahxhyx.com)的，不过看技术说明好像是跟当当的那个[国文阅读器](http://obook.com.cn)有合作，不过也是两三年前的事了，现在看上去好像不行了。\n\n~~~~2018-10-18查询了皖新的400电话，打过去问了以后，发现是由于版权与电子出版物的管理问题给关闭了外网连接功能，也禁用了用户的管理，，，唉，就变成了个垃圾盒子用吧\n\n![896090822.jpg (683x900)](data/img/post_5_896090822.jpg)"
		},
		{
			"post_id": 4,
			"title": "NOIP的题库分析",
			"date_published": 1539570271.976,
			"body": "刚才查询了一下NOIP的题库，现在有2391题，如果一个学生每天做一题，大约需要6.5年的时间完成所有的题目，这就是说一个学生如果想要轻松的参加noip的竞赛，就需要提前6年进行编程训练，按照目前NOIP的章程，最低参赛年龄在11~12岁，所以说，小学生们应该从一年级开始进行编程练习了。\n\n当然，这是比较慢的学习方法，其实一个学生每天做两到三题是没问题的，也就是说最少应该从小学三四年级开始进行编程的训练。\n\n好吧，我们有多落后，现在看出来了吧。"
		},
		{
			"post_id": 3,
			"title": "leejarod.bit上线了！",
			"date_published": 1539324126.046,
			"body": "太酷了！这么优秀的永久在线博客终于搞定了！永久在线，想想都让人激动不已呀！当然，同样的，这里是不可以有任何隐私内容发布的，因为发布内容是不可控的，即使删除也不会是真正意义的删除，其实就算是普通的互联网，又哪有真正的删除呢！\n\n来个友链吧：http://127.0.0.1:43110/leejarod.bit"
		},
		{
			"post_id": 2,
			"title": "hello ,world",
			"date_published": 1539049918.306,
			"body": "一直以来，在博客上花费的时间与金钱都在令我烦燥不安，第三方托管的审查制度太烦人，自建服务器的管理与维护成本太高，好在现在有了zeronet，这才是真实的互联网世界！\n\n加油吧，科技达人们，让网络真正成为每个人享受。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}