{
	"next_comment_id": 44,
	"user_name": "Bigbadbob",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"post_like": {
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1579742141": 1579746954,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583477715": 1583553009,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1585317571": 1585340032,
		"1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1585615782": 1585616426,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1586304539": 1586312076,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1590986967": 1591210180,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1601352984": 1601779683,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1606044538": 1606105898,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1606648692": 1606700147,
		"12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1606648776": 1606700153
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I bet you would prefer Canada.  Its pretty chill and welcomes anyone seeking asylum for any reason.  ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566025736
		},
		{
			"comment_id": 2,
			"body": "@Znnex: Our prime minister is on a virtue signalling rampage and  has specifically said Canadians would be more than happy to take the people who were unhappy with trump.  I dont think he gives a shit about peoples well being or jobs.. but it might be the communist paradise kaffie dreams of:)  And im sure her skills would be valued:)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566026770
		},
		{
			"comment_id": 3,
			"body": "@Kaffie: We literally have people walk across the border from U.S. and welcomed by the rcmp who give a place to stay and food.  ill research further.   But I doubt you would have a hard time getting in doing it the proper way.  I know its not strict right now.  We have an election coming soon. I would consider Canada to be a globalist country.   so yea.  Its not ideal but its chill and you might prefer it.  We are not on the verge of civil war or anything like that.  A work visa would be easy i would think.  Visiting shouldnt be a problem.   We bringing in many people from everywhere to immigrate with no skills.   its truly insane:)  look into it.  Ill find better answers too.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566029614
		},
		{
			"comment_id": 4,
			"body": "@Kaffie: I believe we have way better social services than the states.   I know the doors are wide open for new people right now.  Worth looking into.  I don't like the globalist capitalistic aspect but that shit is everywhere.   I believe Canada and US have the best freedoms in the world.  Canada might have silly laws but lotsa places to hide lol.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566030431
		},
		{
			"comment_id": 5,
			"body": "@Znnex: Trudeau is the opposite extreme of trump.  I personally have no problem with newcomers because we have the room and resources to share.  I think our leader is insane and question his motives (cheap labor more slaves) but we have nothing but space compared to other places so its bound to happen.  im ok with this.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566030874
		},
		{
			"comment_id": 6,
			"body": "@~Publicality~: I Honestly don't care about normal or even truly believe in politics (aka. bullshit).  I was not aware of an argument.   I certainly don't believe in arguing on politicians behalf or fighting other peoples wars.  To think i am not normal is something i can be proud of because that means I'm moderate when many seem extreme:)  I didn't say anything as fact or offer references because i would most likely be perpetuating a lie anyways:)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566033014
		},
		{
			"comment_id": 7,
			"body": "@~Publicality~: lol, yeah, Thats pretty good, that was a pretty funny show.  Older tv shows and movies are like a history lesson in culture.   pretty fascinating. ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1565956065",
			"date_added": 1566071499
		},
		{
			"comment_id": 8,
			"body": "I would say yes,  make a blog. ",
			"post_uri": "1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo_1566386209",
			"date_added": 1566423348
		},
		{
			"comment_id": 9,
			"body": "But what about James Brown?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1572607692",
			"date_added": 1572931657
		},
		{
			"comment_id": 10,
			"body": "A natural person?  Not sure what that means but sounds kinda hairy.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1579742141",
			"date_added": 1579747566
		},
		{
			"comment_id": 11,
			"body": "@Lianna: Thanks for clearing that up for me:)",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1579742141",
			"date_added": 1579751102
		},
		{
			"comment_id": 12,
			"body": "Election drama is strictly entertainment.  They are all the same.  Voting is like trying to decide which testicle you would prefer crushed...    ",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1580802381",
			"date_added": 1580871805
		},
		{
			"comment_id": 13,
			"body": "Whoever causes the most salt to flow will win.\npolitics and politicians are a joke.  People can vote and feel like they have a say,  but they are all shit and do not represent the people.  IMO",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1581544292",
			"date_added": 1581965882
		},
		{
			"comment_id": 14,
			"body": "I'm pretty sure that I would still stay lesbian.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1582363652",
			"date_added": 1582518109
		},
		{
			"comment_id": 15,
			"body": "Darth Vapper ",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1582549322",
			"date_added": 1582599533
		},
		{
			"comment_id": 16,
			"body": "The stupidity of people who believe their vote is somehow relevant knows no bounds.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1582976567",
			"date_added": 1583010087
		},
		{
			"comment_id": 17,
			"body": "Why bother?  Whats the purpose?\n",
			"post_uri": "1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1583285469",
			"date_added": 1583375385
		},
		{
			"comment_id": 18,
			"body": "Sounds grim.  Glad I live in the middle of nowhere and away from the masses I suppose.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583168851",
			"date_added": 1583375719
		},
		{
			"comment_id": 19,
			"body": "Fuck em.  Nothing you can do.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583447984",
			"date_added": 1583465549
		},
		{
			"comment_id": 20,
			"body": "They do not call them helpless without reason:)  There are far more fun things to do.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583447984",
			"date_added": 1583472538
		},
		{
			"comment_id": 21,
			"body": "That's rich.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1583477715",
			"date_added": 1583553035
		},
		{
			"comment_id": 22,
			"body": "No need to be afraid... As we all probably have the virus already.  ;)",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1584598947",
			"date_added": 1584648674
		},
		{
			"comment_id": 23,
			"body": "The world is changing so fast atm,  the unknown possibilities can be scary to think about.  But what can be done?  Hope for the best, try to stay safe, live in the present, and ride it like a roller coaster.  Every day we survive is a good day I figure.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1584598947",
			"date_added": 1584678774
		},
		{
			"comment_id": 24,
			"body": "It's a scary thing especially when there is little to no trust for ones government.  I don't trust mine with those powers even a little. I feel Canada and US fumbled this situation 100%(possibly on purpose)  But I have some faith in humanity.  If they took it seriously a month ago it could be over by now with the harsh war measures.   For as grim\n as things can look, they can still always turn out ok.   All we can do is make the best out of any situation and laughter is the best medicine.  Why not try to make memes?  It's a good distraction from the contagious hysteria in media and social media.  Don't let fear win sister.   The humans/people will win.  We always do.  Just do your part and stay safe.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1584598947",
			"date_added": 1584715757
		},
		{
			"comment_id": 25,
			"body": "I think we may never really know for sure and truth is stranger than fiction.  The US went to war with Iraq based on beliefs... So all bets are off.  We have the authority of truth, not the truth as authority.  I can't imagine anyone admitting to it at this point.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1584818390",
			"date_added": 1584897480
		},
		{
			"comment_id": 26,
			"body": "Cool site!",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1585317571",
			"date_added": 1585340049
		},
		{
			"comment_id": 27,
			"body": "Where I am from...  We are required to have licenses to own \"fire arms\".  These licenses expire every five years.   I applied to have mine renewed back in December, they took my money and I have not heard anything since.  My license has since expired and I have no idea what is happening, I cannot even get in contact with them to find out.  I gave my guns to a friend to hold until I get answers as I could be thrown in jail for 10 years for having guns without a license.\nGun grabbers will never let a good crisis go to waste.  I hope these tyrannical world leaders all get air-born aids.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1585371092",
			"date_added": 1585411288
		},
		{
			"comment_id": 28,
			"body": "@draugrdeathlord@zeroid.bit:  Unfortunately I do not have the 2nd amendment as I am not American : / .  However the people here still have allot of guns for now.   I still have access to mine.  The government here are undoubtedly aspiring  tyrants. ",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1585371092",
			"date_added": 1585427532
		},
		{
			"comment_id": 29,
			"body": "Nice!  Do some retro computing. lol",
			"post_uri": "1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1585615782",
			"date_added": 1585616461
		},
		{
			"comment_id": 30,
			"body": "@draugrdeathlord@zeroid.bit: Who is the Zionist?",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1586335044",
			"date_added": 1586649955
		},
		{
			"comment_id": 31,
			"body": "@styromaniac@zeroid.bit: My personal favorite Alex Jones conspiracy is that he is actually Bill Hicks.  That one is rich and pisses Alex off.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1586335044",
			"date_added": 1586657226
		},
		{
			"comment_id": 32,
			"body": "But are you a massive thot?   I would assume you are not.  I also  cannot imagine it would be easy being a massive thot during a pandemic.\nOnly you can know foresure.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1586744372",
			"date_added": 1586753960
		},
		{
			"comment_id": 33,
			"body": "The most important opinion is your own I would think.  The feminazi and incel movements are born from hasty generalizations.  All women are horrible or all men are horrible.   They are mostly just angry and hurt \"people\" suffering from rejection.  Sad for them if they can't figure it out before it's too late to reproduce, because at the end of the day... It's all just lies and an effective form of population control IMO.  My heart goes out to feminazis and incels need love too, lol  Can't actually give them any without being punished though.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1586744372",
			"date_added": 1586789949
		},
		{
			"comment_id": 34,
			"body": "Hope all is well :)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661",
			"date_added": 1598233375
		},
		{
			"comment_id": 35,
			"body": "What else ya got? lol",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1600145249",
			"date_added": 1600229680
		},
		{
			"comment_id": 36,
			"body": "@Realjohndoe: Is that why it's quiet around here?  No one got any thing good to say? Or do people just run out of kbbs.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1600145249",
			"date_added": 1600230304
		},
		{
			"comment_id": 37,
			"body": "@Kaffie: I have been pretty bored with the clear web lately, everything seems so politicized, dramatic and extreme. zn is the closest thing to social media I've ever felt comfortable using, and i've been working so very much this last year, I don't have alot of screen time.  I spend more time on zn,  It's low drama,  I like it.  It's even better when you are around, glad you are back.\nKinda inspired me to post some of my content, but I've been on the fence about posting stuff that could potentially reveal my identity.  It's the battle within.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1600145249",
			"date_added": 1600234426
		},
		{
			"comment_id": 38,
			"body": "Let the distro hopping begin :)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1601352984",
			"date_added": 1601779678
		},
		{
			"comment_id": 39,
			"body": "@Kaffie: I am not the most tech savy person, far from it.  I eventually settled in with Debian 10, I mostly use that, however I have a parition with Mint just in case I have any trouble with Debian, everything just works.  I have another laptop with MX and I really like it too.  There are way too many distros and it's not easy to decide.  But it's nice to have all the options and be able to find something for the older computers too.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1601352984",
			"date_added": 1601833080
		},
		{
			"comment_id": 40,
			"body": "was it fun? lol",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1606044538",
			"date_added": 1606105922
		},
		{
			"comment_id": 41,
			"body": "Nice. Good for you.  Must be nice  to get away from the masses in the midst of all this covid non sense.  Glad your back.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1606044538",
			"date_added": 1606532083
		},
		{
			"comment_id": 42,
			"body": "Do it... Join us!   :D",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1607336200",
			"date_added": 1607488606
		},
		{
			"comment_id": 43,
			"body": "Not sure if I would request that of the interweb.",
			"post_uri": "12BRJSQrTETJVZzt2jHdqPywv3SdugSywC_1607245737",
			"date_added": 1607488736
		}
	]
}