{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565407828,
			"title": "0 trackers all day",
			"body": "I have 0 trackers all day,  tor doesn't work, none of my VPNs work, my bare ip doesn't work either. It ran fine yesterday.",
			"added": 1565407827
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1565407828_1ApEqpmoN3SPA4Ja4Fh5YRdatk6gRrda7N": [
			{
				"comment_id": 1,
				"body": "> [ayylmaolol](#comment_8_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14): then how are you able to post?\nRight now, I have only one tracker, but all day I had 0 trackers",
				"added": 1565408070
			},
			{
				"comment_id": 2,
				"body": "> [nickwa](#comment_286_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Put this in trackers in your configuration page(Top tree dots top left home page > Configuration) after the default trackers(I get 38/58 tracker usually) [...]\n\nPort: ClosedTor: AvailableTrackers: 0/41\nI don't know how I am still posting.",
				"added": 1565409010
			},
			{
				"comment_id": 3,
				"body": "> [nickwa](#comment_287_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): If your still posting, its probably working the seeding, just isnt reading it right. My ZeroNet Android has that problem with not reading my port being opened or closed right. Also, when I add all the new trackers, it usually takes a little bit till it ramps up. If you want to refresh the # of trackers ZeroNet sees is there, on the homepage, just on click the # of trackers. Otherwise, try putting it as a issue on the ZeroNet github. Im not sure, otherwise.\n\nWhenever I click the # of trackers, all of the trackers say error(0 % success).",
				"added": 1565409747
			},
			{
				"comment_id": 4,
				"body": "http://nanochanqwrwtmamtnhkfwbbcducc4i62ciss4byo6f3an5qdkhjngid.onion, works for me guess, I'll stay their for now. \n> [nickwa](#comment_290_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Yeah, im not sure. It again sounds like ZeroNet is working fine, just isn't detecting the # of trackers your actually connected to. ZeroNet Github: https://github.com/HelloZeroNet/ZeroNet/issues\nAlready made a thread there",
				"added": 1565448426
			},
			{
				"comment_id": 5,
				"body": "never mind, I found endchans onion page, I really don't know where else to go to.",
				"added": 1565449096
			}
		]
	},
	"comment_vote": {}
}