{
	"title": "bano's blog",
	"description": "My personal blog. I mostly post about free speech and online censorship.\n\nI've been on Rizon for years, under the nick bano, feel free to talk to me there.",
	"links": "*   [<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>My blog on Tumblr](http://web.archive.org/web/20180219152634/http://bano-2d.tumblr.com/)\n\n*   [Source code](https://github.com/HelloZeroNet)\n\n*   [Rizon — IRC network that supports free speech](https://rizon.net/)",
	"next_post_id": 31,
	"demo": false,
	"modified": 1520958633,
	"post": [
		{
			"post_id": 30,
			"title": "People with right-wing beliefs are getting banned from UK",
			"date_published": 1520958614.205,
			"body": "These events are pretty bad in my opinion, and I think they're a good reason to stay away from UK (not that it was a pretty bad place to be in already.)\n\nThree people were detained and denied entry to the UK recently. All of them are conservative.\n\nThe first two were Martin Sellner and Brittany Pettibone, both of whom were detained for three days (which sounds like a lot of time) before being released. They intended to give a speech in Hyde park. Pettibone claims she was banned, because she wanted to interview a right-wing activist Tommy Robinson.\n\nThe last person was Lauren Southern, who was banned for \"racism\". The event that got her in trouble was a stand she had in Luton, where she gave out \"Allah is gay\" posters. This is the part where I'm really outraged, as Islam is not a race, therefore this act can't possibly be racist. It was provocative, but definitely not to the point where people should get offended by it at all.\n\nI'm worried that UK is heading in a wrong direction, and these bans definitely show that they don't want freedom of speech. I hope other governments won't try doing the same thing in the future, as it effectively tells people to either avoid speaking, or only say things that are accepted in places where they want to go."
		},
		{
			"post_id": 29,
			"title": "I just took down my Tumblr blog",
			"date_published": 1519318918.901,
			"body": "I set this blog up with an intent to post here rather than on Tumblr, because I'm not certain that centralized web is viable nowadays, and I wanted to give a reason to people reading my blog to try it out.\n\nEven though I don't think ZeroNet is perfect, I stuck with it. I'm thinking about trying out other decentralized networks, and possibly mirroring my posts there.\n\nConsidering that I moved away from social media in general, I don't see any reason to keep my Tumblr account up, as I effectively abandoned it. Because of these reasons, I decided to delete my account.\n\nThis doesn't mean that my posts are lost forever — I manually went through all pages of my Tumblr blog and archived them with [Wayback Machine](http://web.archive.org/). The link to my old blog will be updated to use that archive. If you happen to have any links to my old blog, you might want to update them to point to the archived version. I hope this won't break many things, but on the other hand, I don't want to have social media accounts.\n\n---\n\nThere's one topic that I've been wanting to write about for a couple of weeks, but I've been too lazy to read up on it and post my thoughts on it. Maybe writing this here will be a good way to motivate myself to actually do it."
		},
		{
			"post_id": 28,
			"title": "YouTube wants to remove dissidents' videos from recommendations",
			"date_published": 1518623494.885,
			"body": "[https://youtube-creators.googleblog.com/2018/02/preventing-harm-to-broader-youtube.html](https://youtube-creators.googleblog.com/2018/02/preventing-harm-to-broader-youtube.html)\n\nIt seems YouTube **really** wants to ruin itself as fast as it can, and this is one of their attempts to speed the process up. I've been saying for a couple of months that YouTube has around 2 years before it becomes a place to watch new Neistat videos. I might as well put this estimate here, and see what goes down, but with how much YouTube wants to see it happen, it might take even less time.\n\nThey're planning to punish people in more ways than before, revoking privilege to be a partner, get monetized and have your videos recommended. They intend to do this \"when channels upload videos that result in widespread harm to our community of creators, viewers and advertisers.\"\n\nIt's an attempt to appeal to advertisers by playing along with the ongoing moral panic. This time they're trying to choke people guilty of wrongthink, or force them to comply and be careful if they want to still get money from YouTube, and have a chance to expand. Without recommendations, growth of channels will be stunned significantly. I wonder if channels that are on their way to get monetized will be excluded from a chance to get recommended as well. If that is the case, someone running a channel that got shadowbanned might be better off just starting a new one.\n\nThe way this article is worded suggests that people uploading to YouTube should feel like a collective responsible for each other's well being. I don't think this is a good idea — not everyone makes money off it, and everyone has their own goals and intentions. In general, the idea of having a collective with coherent ideas is unrealistic, as people aren't drones that all think the same way. Even worse, this idea could be used as motivation for someone with ill motives, or as a way of persuading other people to cause harm.\n\nFor me, this looks like a step towards a walled garden with big and approved content creators I've described before. If my worries about recommendations are true, it would also put newcomers (who are likely willing to comply with rules) at a disadvantage, meaning YouTube would end up becoming stale, and not having new people who could bring something fresh to the table."
		},
		{
			"post_id": 27,
			"title": "Activision Blizzard proactively sanctions \"toxic\" players",
			"date_published": 1517154702.402,
			"body": "This is interesting. Activision Blizzard is proactively looking for \"toxic\" players on social media to sanction them.\n\n[Here's a relevant video about Overwatch.](https://hooktube.com/watch?v%3D5P1Md792fF8)\n\nIn this case, it's just been confirmed for Overwatch, but I wouldn't be surprised if it applies to their other games, and other publishers might try doing the same thing. The social media site mentioned by Jeff Kaplan, developer talking in linked video is YouTube, but he mentioned they're keeping ways people are monitored hidden, so it likely takes place on other sites as well. (Why is YouTube always the site where things go bad?)\n\nI think this is a horrible idea, the exact opposite of what should be happening. I don't know why there's a push to unify every presence one has into a single image that would be used to judge them. It's worrying me, and it makes me glad I avoid social media.\n\nThe big example of this happening that I can recall right away is [Mozilla's CEO, Brendan Eich being pressured to step down because of his opinions on same-sex marriage](https://en.wikipedia.org/wiki/Brendan_Eich#Mozilla) years before he was promoted to be the chair.\n\nIn my opinion, personal and professional life should be separated. People shouldn't be put at risk of losing their jobs based on what they think and do personally. Of course, there's a point where this becomes unreasonable. I don't think this rule applies to someone who's a murderer in their \"personal\" life. When it comes to politics, however, they're something that should be protected. Google is an perfect example of this going wrong on a bigger scale.\n\nWhen it comes to Activision Blizzard, my opinion of them took a nosedive. Before I thought of them lowly, because I don't like any of their games and don't see appeal of them. Now, with them admitting to doing this, I'm going to tell people they should avoid them altogether and boycott them. I'm glad I never bought any of their games (I've only played Heroes of the Storm for a little bit, even that game couldn't get me into MOBA genre, and I think it was a horrible game in general.)\n\nI see potential for abuse with this as well. I have no idea how Activision Blizzard is going to check whether a social media account belongs to a certain battle.net user. Certain platforms make it easy to change nickname, YouTube being one of them. It's possible someone will want to get certain player in trouble by changing their nickname to impersonate them and making a fuss that will catch attention.\n\nThis sounds like a step in [this direction](https://www.bitchute.com/video/hsGO1bI9q_U/). It's not a future I'm looking forward to."
		},
		{
			"post_id": 26,
			"title": "Update to my chart for 2018",
			"date_published": 1516453051.802,
			"body": "> Don't know why you're wasting time, just know what I do with mine\n> How to do impossible things\n> How to do impossible things\n> What does happiness really mean?\n> Where to go when abrupt woken up from the dream\n> \n> — hook from [\"Face Melter (How to do impossible things)\"](https://hooktube.com/watch?v%3DRhYwLDkxJYA)\n\nI've just turned 20 today, and I've updated my chart that I've made and decided to update around my birthday every year to see how things change. Here's a [link to my post about the last update to my chart](http://bano-2d.tumblr.com/post/156369336053/i-might-as-well-post-this-here-maybe-i-should), and [here's the chart itself in full quality](http://78.media.tumblr.com/6fec513d70b7baf3b54c07a929e840f5/tumblr_okcugjmf5u1uecmi1o1_1280.png) (the theme I use doesn't link to full quality picture, and I'm not maintaining my old blog anymore.)\n\nWithout further ado, here's the updated chart: [(full quality PNG here)](https://kek.gg/i/7cqwyx.png)![2018.jpg (608x900)](data/img/post_26_2018.jpg)\n\nThe biggest change is that I've filled in the \"gender identity\" field rather than avoiding the topic by putting a meme arrow inside. I went from being an egg (looking and dressing like a girl in my wonderland and dreaming of doing the same thing IRL) to facing my problems and admitting something's wrong. Consider this as me coming out as trans, I think I can call it that by now, the last time I mentioned this on blog was when I was scared of letting people know what was my problem, even though I felt confident-ish about it. By now I'm trying to act accordingly to what I feel I am at school, because I managed to get into a position where I'm safe doing that, and it feels amazing. For the first time in my life I feel like I'm myself and not pretending to be pretty much someone else. I'm not saying being like this is purely good, because I still feel bad at times, and my lows can be pretty bad. I'd still say I feel better right now, because I have an idea why I feel so bad. (I don't want to talk about this topic too much on my blog, at least now.)\n\nAs for other changes:\n\n*   I've drawn characters this time and put a tiny bit of effort into them. I wish I kept the brush I've made to draw hair, because I feel like I drew it too short. I haven't redrawn the old character which I've copied to another field. It sticks out a little bit, but I didn't want to change it, at least this year.\n*   I've moved [/home/gligar13](https://hooktube.com/channel/UCzozMcF1kcR9dzsdEkRHdaw)'s picture to the field with my favorite comedian, which is where it belongs. The \"one thing you can't live without\" field hasn't really changed, I just replaced it with text about my use of post-irony, which to some extent is pretty much the same thing.\n*   I've made minor tweaks to other fields with favorites (and other places) and put Japan as my favorite country.\n*   I've finally filled my list of top albums (I still haven't listened through entire No Love Deep Web, though, but it has some great songs that I've listened to already) and filled in the field for my favorite musician rather than putting RMS there as a joke.\n*   I've clarified why I don't have a list of favorite books.\n*   I've updated the political compass. I took the test multiple times over the course of a couple of weeks, and it seems my results depend on my mood. I managed to go to the left side once, but I think it was just me interpreting certain questions wrong.\n\nI hope I'll keep updating this chart, because it's a great way to have a record of what I was like in previous years. I also hope my personal life will keep improving."
		},
		{
			"post_id": 25,
			"title": "YouTube changes requirements for monetization",
			"date_published": 1516311627.113,
			"body": "[https://youtube-creators.googleblog.com/2018/01/additional-changes-to-youtube-partner.html](https://youtube-creators.googleblog.com/2018/01/additional-changes-to-youtube-partner.html)\n\nYouTube is making significant changes to monetization, which will affect content creators. Conditions they have to meet in order to be eligible for it will be raised, and they'll have to be re-evaluated when they meet them.\n\nThese requirements raise the bar to being able to make any money from videos, and the need to be evaluated again might cause a period of no profit to people. This might be intentional, and I wouldn't be surprised if YouTube doesn't want small-time uploaders on their site.\n\nThis looks like the adpocalypse hitting YouTube even harder to me, and I don't like it. Google probably isn't the only company that's responsible for things getting this bad, and lamestream media stirring up drama to drive advertisers off are definitely contributing.\n\nI wish good luck to people who make money off YouTube, and I hope things will go back to being acceptable some day, just like with Google in general. Uploading content to multiple sites is one way to improve chances of it staying up should it get taken down somewhere, and possibly a way to have multiple sources of income in places where it's possible. Unfortunately a chance of situation getting to an acceptable state doesn't sound so plausible. By this point it's not unusual to see people censor out (or avoid) bad words in their videos to reduce the chance of getting demonetized.\n\nLinked blog post also has this one sentence that caught my attention:\n\n> Despite those issues more creators than ever are earning a living on YouTube, with the **number of channels making over six figures** up over 40% year-over-year.\n> Putting emphasis on people who are big doesn't help much, as it makes more obvious that YouTube cares only about people who bring lots of revenue.\n\nThis, along with other things going on at YouTube, such as protecting certain content creators (which caught mainstream attention with Logan Paul's suicide forest video trending, and then [videos criticizing him for uploading it getting striked](https://hooktube.com/watch?v%3D1LHXB6MzLfo)) as well as existence of [YouTube TV](https://tv.youtube.com/welcome/) makes it seem to me that they want to turn YouTube into something like \"normal\" TV, a walled garden with only approved family friendly content that won't offend advertisers (or people who would make a fuss about it, causing them to pull out to control damage.)\n\nI don't know how things are financially at YouTube, and considering that vid.me had to go down, these choices might not be as radical as they might seem at first. Even if YouTube becomes a place where only a selected group of people can upload content, I hope it won't affect content that's already there, because there's a lot of it, and having it go down would be a huge loss."
		},
		{
			"post_id": 24,
			"title": "Events worth mentioning",
			"date_published": 1515857705.921,
			"body": "Since my last post about NetzDG was pretty tough for me to write, as I don't know much about law, (especially in Germany) I've decided to just write one post where I mention recent events that are interesting. I'll try to provide relevant links related to them.\n\n# Twitter employees confirm they're shadowbanning\n\nProject Veritas has interviewed people working at Twitter, and they have confirmed shadowbanning is used to silence certain people. It's been suspected by some users for quite some time, and now there's proof that it's a thing. There's also confirmation of political bias at Twitter.\n\nThe video contains an interview with one software engineer who's working on a project that would automatically ban \"aggressive\" and \"negative\" content. This could turn Twitter into an even bigger echo chamber than it is right now.\n\nI don't think this is surprising at all, but I think it's worth watching, and it can make for a nice piece of evidence if someone wants to argue about this particular site (or censorship on social media in general.)\n\n[https://www.hooktube.com/watch?v=64gTjdUrDFQ](https://www.hooktube.com/watch?v=64gTjdUrDFQ)\n\n# James Damore sues Google\n\nDamore has filed a class action lawsuit against Google for discriminating against people who are white, male and conservative. It also mentions hiring quotas. The lawsuit is publicly accessible and contains plenty of interesting information about things going on at Google.\n\nIt mentions shaming teams that don't have enough females in them, a summit where hiring policies designed with getting certain minorities hired in mind were presented, diversity trainings, threats received by Damore after his memo was released, how he was fired without being informed which policy he's violated, bonuses awarded for arguing against him.\n\nDavid Gudeman, another person who filed this lawsuit has his section with information about documents describing how to silence white males, being punished for defending his conservative views, defending Caucasian males, and getting terminated for arguing with other employees.\n\nThere are mentions of other people getting in trouble for their opinions, no protection against harassment for conservatives, hostility against conservative parenting techniques and relationships (by having mailing groups for people with different lifestyles) and workers who set Antifa insignias as their profile pictures.\n\nThere's a lot more mentioned, and I might end up writing more about this, because many interesting things listed. Even skimming through a part of this document (like I just did) is enough to find plenty of new info about how things are at Google.\n\nI hope this lawsuit will be the beginning of fight against companies that turn into places which push their ideologies and agendas on others, as well as affirmative action, with both things being harmful.\n\n[https://www.scribd.com/document/368689407/Damore-vs-Google-Class-Action-Lawsuit](https://www.scribd.com/document/368689407/Damore-vs-Google-Class-Action-Lawsuit)"
		},
		{
			"post_id": 23,
			"title": "NetzDG",
			"date_published": 1515771830.868,
			"body": "I guess this is the kind of thing I should've talked about a long time ago, but I've missed it.\n\nNetzDG was passed in June 2017, a long time ago (actually a little bit before I started really paying attention to this sort of stuff.) I wonder if things happening in Germany such as Styxhexenhammer666's YouTube channel being blocked there (and in Poland as well, I hope that's unrelated.) It could've been the reason behind that boom of German users on vid.me back in the day.\n\nThese laws require websites with more than 2 million users to remove content considered illegal by German law, and websites which delay removal of offending content are at risk of getting fined up to 50 million Euro. Any provider that gets more than 100 complaints in a year [has to publish two reports](https://cdt.org/insight/overview-of-the-netzdg-network-enforcement-law/) about how and with what criteria it evaluates these requests as well as how it handles them, and failing to do so puts them at risk of a fine as well. Sites with their own editorial content (which sounds like news sites to me) and sites \"intended for individual communication\" are exempt from this law. One thing that really interests me is how Germany is supposed to enforce these laws on owners of websites which aren't hosted in their country, and are just available there. I'm not a lawyer, so I have no clue about these things.\n\nI wonder what happens when someone doesn't host their site in Germany and doesn't want to follow these laws. Will German government ask ISPs to block these sites? Will anyone willingly block users from Germany just to be safe?\n\nIt seems that a lot of content can be eligible for removal with German laws. Their defamation laws are quite broad, and according to [this post](https://law.yale.edu/mfia/case-disclosed/germanys-netzdg-and-threat-online-free-speech) even true statements that can be damaging to someone's reputation can fall under defamation. Insults which harm one's honor are offenses according to this law as well, and there were cases about use of them.\n\nFrom what I've heard, people can get in trouble for speaking their mind about immigration policies in Germany, which would mean this is used as a tool to keep up a narrative and silence dissenting views."
		},
		{
			"post_id": 22,
			"title": "My thoughts about 2017",
			"date_published": 1514134828.127,
			"body": "2017 is almost over, and I think it's a good time to summarize it. Quite a lot has happened, both in my personal life, and when it comes to things going around the world.\n\nTrump's presidency has caused some on the left to lose it and make fools out of themselves. There was the inauguration (which happened on my birthday) where one kid was crying and shouting \"no.\" On one year anniversary of Trump's winning, a bunch of people decided to go to one building and yell, because that seems to be the only thing they're capable of. It's just unironically acting out the autistic screeching meme IRL. Lamestream media were self-deprecating as well, by pushing false narratives. Also, [Obama has compared Trump to Hitler, even though he wanted to do same things as him](https://www.bitchute.com/video/RX-cbrj7pEE/).\n\nThe biggest event (for me) this year, was the whole fiasco with Google and Damore. His memo, and how Google reacted to it felt like an official declaration of war for me. Because of it, I dropped my apolitical attitude and started voicing my thoughts about things and started avoiding Google as well.\n\nGoogle's willingness to participate in moral panics (as well as lamestream being lame) started the adpocalypse, which has turned YouTube into a mess. Because of how little was enough to get demonetized, some channels (Pyrocynical) have started to stoop so low as to filter language they're using. YouTube started turning into another TV. The adpocalypse also made it harder for people to live off their pages and channels, which isn't a good thing at all.\n\nDiscord has banned people over politics after events in Charlottesville. This encouraged me go through support to shut down my account, because it has pushed me past being fine with just not using Discord. Not only is it a dataminer, people running it also have to make sure only opinions they agree with can be voiced.\n\nDaily Stormer was taken down by Cloudfare, which shows that even service providers have to take part in the ongoing moral panic and make sure free speech isn't a thing. Similar thing (although it ended up being a threat that forced owners to take down a post) has happened to gab.ai, and strangely it also revolved around Andrew Anglin. In fact, I can recall at least one of his replacement domains for Daily Stormer, dailystormer.hk getting taken down. This pushed me to move over my blog to ZeroNet, to feel safer and (hopefully) get these few people who read my posts to try it out.\n\n* * *\n\nMy personal life was full of important events as well.\n\nIn May, I've seen people pushing affirmative action before my eyes. Giving an award to someone for being just female is sexist, and treats them as someone inferior. It made me really angry for multiple reasons, and possibly pushed me to discovering one (very important and sad) thing about me. Even worse, poor organization (planning awards event on exam days) of the whole competition ended up forcing me to not go to the awards event, and I missed my chance to get an internship at IBM or other huge corporation of this sort.\n\nI wrote plenty of code this year, and I definitely improved my skills. I've finished a couple of projects, which were fun to work on. Recently, I've toyed around with Haskell for a bit, mostly to try out a functional programming language, but that's not the only language that I've tried out this year.\n\nI fell for the ThinkPad meme, and bought one this summer. I've wanted one for a while, and I don't regret spending money on it. It definitely makes for a nice machine to carry around and use on the go. I've been using it at school to program, and to remote into other machines.\n\nI had experience with hardware as well. I got my hands on a CRT monitor which I've overclocked. That required looking around to learn how to do it with X. I also got an old machine that I've turned into a NAS. It was a fun project, especially considering that I've used spare parts to build the whole thing, and it was my first experience with setting up a headless machine.\n\nI managed to get a scholarship this year, and it's the first time I had one.\n\nI've made certain discoveries about myself, which have essentially flipped my whole life upside down. It seems that there were hints about it my entire life, (and very obvious ones since I was 16) which I have managed to ignore for a long time. I hinted at what that is before, and I don't feel comfortable putting it out there yet, even though I have been very open about it IRL.\n\n* * *\n\nAs for next year, I hope things will get better, both when it comes to the ongoing moral panic and to my personal life.\n\nI think I should focus on improving my writing skills, and I hope I'll manage to make progress.\n\nNext year, I'll be applying to uni and starting my first year. Unlike the last time when I had to pick a school to go to, I have a tough choice to make. At least it's not related to the degree I'll pick, because I don't see the point of considering anything other than CS."
		},
		{
			"post_id": 21,
			"title": "My opinion about Trespasser",
			"date_published": 1513527121.991,
			"body": "A couple of days ago I've finished Trespasser, (but I was too lazy to write about it right away) and as promised, I'll write what I think about it.\n\nI don't think much has changed. I still think this game is great, even with all of its problems.\n\nThe whole game isn't that long, and it's not that surprising considering how entire levels got cut (and merged with others.) I managed to get through entirety of it in a couple of afternoons without rushing it. That's how I normally play games — I prefer to go slower and explore a bit more than others would do.\n\nThe only place where I got stuck was InGen Town — the puzzle with that control panel puzzle was iffy, and I had to look it up in a walkthrough. I haven't figured out that button labeled with \"A\" was used to open Wu's gate. Size of the area I had to walk through (at a slow pace) made me give up before coming up with that solution.\n\nCombat gets more interesting towards the end of the game. With more open areas, it's possible to just run past some dinosaurs, or trick them to fall down a cliff to neutralize them. I was able to lure dinosaurs off a cliff on the last level, which made conserving ammo easier (and that seems to become a problem in late game.)\n\nOpen nature of later levels allows to just walk around some areas and avoid certain paths or puzzles. I think this game would be slightly better if earlier levels were designed in this manner as well, but they felt more like corridors instead. All of that might be caused by rushed development and an idea to have the whole island freely explorable, which got scrapped. Maybe early levels had more work put into to polish them, especially because they were the ones that players would learn how to play on.\n\nWhen it comes to stability and crashes, I haven't ran into any issues since my last post. I think it's impressive that I had such a smooth experience with a game that had such a rough development cycle. All of this applies to 1.1 patch, which makes tiny changes to levels and tries to make experience a bit more enjoyable (this patch supposedly fixes problems with keypads.)\n\nIn general, I've enjoyed the game, and I think it's worth checking out. Controls might be frustrating to some, (and I know I'm the weird person here, because I unironically enjoyed controls in Surgeon Simulator games) but they're manageable, and it's possible to get comfortable with them. This game is unique and ahead of its time. I wish this game had a digital release, (for instance on GOG) because it sold poorly and ended up being rare. Having a relatively small number of physical releases on the market is a bad thing, because they can get damaged while shipping, and I don't want to see this game disappear for good.\n\nPicking up this game from not-so-legitimate sources might be the right thing to do, because it's out of sale already, (so the only people who make a profit are ones who own copies of this game) and shipping copies of this game might destroy them in the process, making it even rarer.\n\n* * *\n\nWhen it comes to things community has made for this game, I've only played around with the [ATX patch](http://atx.trescom.org/), which adds some new cheats, (including a framerate counter) support for better view distances for objects, higher resolutions and different aspect ratios. There's plenty of features that can be only configured through the ini file this patch uses, so it's worth having a look over it. I had to go there to fix aspect ratio, but I messed around with things such as a HUD for the game. It's a great way to see how the engine can handle this game running with settings high enough to stress modern CPUs. My i5-2520m can run this game maxed out at 1600x900 (with a software renderer) with dips to 17 FPS in worst case scenarios, which is playable and comparable to what people would get back in the day with accelerators at much lower resolutions and settings. High resolutions seem to trigger more cases where this game tries to lower quality of terrain textures when it seems occluded, so that's worth mentioning. All of this runs on a single processor, because this game has no SMP support.\n\nI wonder if modern high-end CPUs could handle this game at 4k (of course in software mode.) That could be an interesting benchmark for single threaded legacy software.\n\nAnother patch worth mentioning is [Trespasser CE](http://www.trescomforum.org/viewtopic.php?f%3D6&t%3D10674), which adds a DirectX 9 renderer, which can handle all effects this game uses and even add new ones. Since I'm playing in a vm that doesn't have hardware to handle this, I didn't bother with this patch. This might be the best patch to play this game nowadays if someone wants to run it at a native resolution (as mentioned above, software rendering is taxing on the CPU.) It's possible to turn off texture filtering to match how this game looks in software mode closer.\n\nThere are also custom levels for this game, but I haven't checked any of them out. I wouldn't be surprised if there are really good levels made by fans. In fact, one of them was made for [this Halloween](http://www.trescom.org/2017/11/11/fall-lodge-and-other-misc-news/), so people are still interested in this game.\n\nSome prototype versions of this game were released as well, and it's not that hard to find them. I tried getting the oldest prototypes (including E3 demos) to work, but I couldn't get past the installer, but that's possibly because I were trying to get past it in wrong ways. I might try getting these to work in the future, because they seem to have things I'm interested in, especially with how much of this game was cut for release.\n\nSource code of this game was leaked as well, and I haven't found that yet (people aren't really spreading links around, because they don't want it to get taken down.) Unfortunately, it wasn't released to community officially, which would make things much better. Having source code of this game (and maybe assets) of this game released under a free license would make things much better. Just look at what [fans have done to Colobot](https://colobot.info/) (which is a game I really like and I'm nostalgic about, because I had Ceebot (a cut down educational version of it) back in the day.) If anyone is interested in internals of this game, [here's a post about that](http://fabiensanglard.net/trespasser/).\n\nI think fanbase of this game would be able to pull of incredible things with this game, considering how they have managed to reverse engineer formats for assets and levels, and then write their own level editors. It's a shame this game won't end up the way Colobot did."
		},
		{
			"post_id": 20,
			"title": "My initial experiences with Trespasser",
			"date_published": 1512925550.342,
			"body": "Today I've finally had a chance to play a game I've wanted to play for years. I think I recall wanting to play it at least when I was in middle school.\n\nI remember getting my hands on this game a year or two ago, thinking I could get it to work with wine(-staging), which made sense considering game was listed with [platinum and silver statuses, depending on the version](https://appdb.winehq.org/objectManager.php?sClass%3Dapplication&iId%3D2745). Unfortunately, I couldn't get it to work, and there could've been a regression which broke compatibility with this game.\n\nThe other way to play this game is to just run it in a virtual machine. Considering how ahead of it's time it was, accelerated graphics were considerably worse compared to what could be done in software (accelerators from these days couldn't handle textures this large, and they couldn't handle things such as bump mapping.) This means running this game in software mode isn't such a bad idea. Unfortunately, my hardware wasn't really capable of doing that, [because I didn't have a processor with support for hardware virtualization](https://ark.intel.com/products/36750/Intel-Core2-Duo-Processor-P7350-3M-Cache-2_00-GHz-1066-MHz-FSB).\n\nAll of that meant I had to set this game aside and wait for another chance to play it. When I got a new(er) laptop, which had a CPU with vt-x, I decided to have another go with that game. It took me relatively little effort to get it running. Even something as basic as VirtualBox is good enough to play this game.\n\nBecause of how old Trespasser is, (it requires at least Windows 95) I had to pick the right operating system to run it on, which requires striking a balance. Non-NT versions of windows work really bad on VirtualBox, needing third-party drivers to get a video mode that isn't 4 bit, a parking utility to not hog down the CPU even when idle (which is related to an intentional design choice to make the system more stable on cheap hardware from old days.) Even with all of that effort, performance is bad, and hardware virtualization is out of the question.\n\nWindows NT can work quite well, even without hardware virtualization. It's a night and day difference. I've played with an old release of NT 4, but it was a little bit too old, and I couldn't get sound to work, and it seemed to have the same issue with CPU parking. I could've tried an updated version, but I decided to go with 2000 (NT 5) instead. It worked quite well out of the box, and I only needed to install guest extensions, which is a standard procedure for these virtual machines.\n\nI made a really beefy VM to play this game, 2 processors (with execution cap at 100%) and 4 GiBs of RAM, which is a lot for this game, even if the operating system is way newer and bloated than what it was designed for. It's enough to run the game smoothly at highest quality settings and resolution (which is capped at 800x600 if the game isn't patched.)\n\nInstalling the game itself was a smooth ride, I experienced no problems whatsoever.\n\nAt first I tried with a demo, which ran just fine. It was enough to blow me away, but it was pretty short.\n\nA couple of weeks later, I got my hands on a full version of the game, and I started playing through it as well. I've decided to just install the official 1.1 patch, and consider trying out community improvements later, after I get a feel for what the game actually was.\n\nPlaying through the full game is even better than the demo, which is relatively tame. Even though the area in the demo is somewhat large and open, it's nowhere close to what's visible at the beginning of the game. There's this area in the first (I think) level, with a valley, where two (or maybe more) brachiosauri are walking around. They're so heavy, their walking causes everything to vibrate, and they cast massive shadows on the ground. It looks amazing, especially when you're actually playing the game, and not just watching footage of it.\n\nMaps in the full game are more massive than in demo, and seem to be littered with more objects. The scale of them is impressive.\n\nGraphics blow me away even today, but that's possibly just me being weird. Things look amazing, especially in motion, when dinosaurs react to their environments, trip over things, limp when injured. This game had reverse kinematics, which started becoming viable in other games around the PlayStation 3 era. physics just add to it, and they're more profound than in other games, because they affect how you interact with objects. A gun has weight to it, and Anne's arm moves accordingly when she jumps. Things can fall out of her hand.\n\nIn order to run at acceptable framerates on hardware from 90s, the game uses a lot of tricks. It replaces objects in the distance with textures, which have these objects rendered onto them. This is a visible thing, and it can cause some artifacts, but seeing how clever game can get with this trick is amazing, for instance when a building is split into multiple objects of this kind and things manage to look coherent even when looking at a mix of flat textures and properly rendered 3D models. In fact, game is clever enough to handle objects which are moved in the distance, for instance when they're shot. One crate can bump another one, which gets replaced with a 3D model as well.\n\nIn general, playing this game makes me feel like a child who has incredible dreams, which weren't checked by reality yet. Even though this game is flawed, playing it is fun. I assume this reflects how this game was developed, because it had to be delayed (and even then it ended up being rushed, with cut features, such as emotions in dinosaurs' AI.)\n\nEven though this game can get frustrating in multiple ways, it's enjoyable to play. Having to walk back and try jumping across a gap multiple times, just to get stuck inside a monorail track (and having to fiddle around to get out of it) is tedious, but having an encounter with another dinosaur balances it out. The pace at which Anne moves around can make exploration boring, and it gets even worse when you bump into an invisible wall in a spot that seemed like a nice way to bypass something can be annoying as well (especially when your gun bumps against that wall and falls out of your hand, forcing you to pick it up again.)\n\nEven when patched, the game can be unstable. Sometimes reloading a level (be it due to death or just reloading for whatever other reason) can cause textures to get scaled down to a much worse quality, where another reload has a chance of fixing the problem. The game can crash as well, so saving often is a good idea. Too bad saving is a chore, because opening the pause menu is finicky.\n\n* * *\n\nThese are my experiences after having played through 3 or so levels of the full game. I could write them down much clearer, but I wanted to keep that in the moment aspect to them.\n\nEven though I've been hyping myself to play this game for years, I still think it's one of the best games of all time, because of what it manages to accomplish, which says a lot about it. There's definitely no nostalgia involved, because I have never played this game before, but I might have a bias for older games.\n\nI can't stop comparing this game to Half-life 2, which is somewhat similar in some aspects, such as having physics play a large role in the game (which was smaller in case of HL2.) Even though I like HL2 as well, this game feels more impressive, and it manages to be a bit more immersive because of it's lack of a HUD, and because of how physics affects even things that you're holding in your hand. A protagonist that speaks isn't taking away much from this, which is an interesting thing, because HL2 had a silent protagonist for the sake of immersion.\n\n* * *\n\nIf I play through the entire game, I'll try to write about it again, in a more thought out way, but that will take a bit of time."
		},
		{
			"post_id": 19,
			"title": "vid.me is about to be shut down",
			"date_published": 1512251685.172,
			"body": "I just found out that [vid.me](https://vid.me/) will be shut down on December 15th (2017.) Uploading new content is disabled already. It's a shame, because I hoped this platform would stay around. (Especially considering how bad YouTube is nowadays, [this channel](https://www.youtube.com/user/Styxhexenhammer666) is blocked in multiple countries.)\n\n[Official article about planned takedown.](https://medium.com/vidme/goodbye-for-now-120b40becafa)\n\nIt seems so sudden, and I just found out because of a banner put on top of every page on vid.me. The story on medium that it links to is about the whole thing, and It seems that running and sustaining a video sharing platform is pretty hard.\n\nThis impacts me quite a bit, because vid.me was my primary platform for watching videos. It's a hard push for me to go somewhere else (and hope people who I want to watch will upload there.) I hope other video sharing platforms won't end up the same way vid.me is about to.\n\nIf there's any exclusive content you want to watch, do so (and possibly download it if you can.)\n\nI don't have much else to say about this topic right now, but writing about it is quite urgent. I'm looking at [Dtube](https://d.tube/) right now, but I didn't have enough time to properly evaluate it."
		},
		{
			"post_id": 18,
			"title": "A little update about me",
			"date_published": 1511197188.398,
			"body": "> Too much time spent in the maze will drive you mad, I feel so bad\n> Been there so long I can't remember who I am, or where I stand\n> But in the end I guess I just don't give a damn\n> Twist a gram and keep on sticking with the original plan\n> Fuck it man\n\n(I got into Death Grips lately, I wish I tried out their music earler, because I were aware of them for a long time. I assume it's expected from someone who isn't big into music.)\n\n* * *\n\nI haven't been posting as much as I've been before, and I don't really think it's a matter of me being too busy. Some of it is just one of my IRC channels getting bigger (and full of quality discussion.) There's also the issue of being unable come up with topics worth writing about (but that tends to happen from time to time.) However, the most important reason I'm not here are my problems.\n\nI don't really want to name what's going on right now (both because I don't feel like writing it on this blog right now, and because I think it's too early to label it.) It seems like I'm pretty good at lying to myself and pretending things are fine when they're really not. There were pretty obvious signs of what's going on, but my mind managed to ignore them for a couple of years. Before these obvious clues, there have been other hints that were more subtle, and now I'm capable of seeing them as what they really are. In hindsight, I might've been better off, if I were aware of this earlier.\n\nIt seems that I've subconsciously developed some coping mechanisms, and now I can see them as what they are. Some of them seem to be failing as I notice them, and I generally feel like I'm falling apart on a very deep level. I know of at least one coping mechanism (which I developed intentionally for other reasons, but it's useful for this as well) that I want to keep, because I consider it to be a good thing.\n\nEven though these realizations are pretty scary, I see something positive in them, as it seems that I might be onto what's wrong with me. All of it results in this weird feeling that's the best and worst one I've ever felt.\n\nI guess my post on this blog about pronouns hints at what my problem is, and I've been struggling to accept it as a possibility.\n\nIt's not my first time when I'm feeling down, and I hope I'll have the courage to ask for help this time. Considering I'd have to get it anyway if I choose (and it seems I'm just waiting for a chance to make sure I really want it, which is a matter of getting some money to spend) to pursue this path in life, it's more likely.\n\nBecause of things I have to consider, my life got pretty stressful lately, and my mood is all over the place. It's gotten harder for me to spend my free time being “productive” (whatever that really means.) I spend time writing code to keep my mind off these problems, (it's a great way to do so, because programming requires staying focused and thinking a lot) but I do that at school, so I don't really feel like working on something else when I get home. At least some things that need to be done are getting done, and my skills are improving…\n\n* * *\n\nI've had this post written for weeks, and I felt it needed more work before I would post it. Now that I look at it, I think it's good enough, I just ended up adding more things."
		},
		{
			"post_id": 17,
			"title": "Google fights against Canada's ruling to censor global search results",
			"date_published": 1510070980.076,
			"body": "As much as I dislike Google, I have to give them credit for what they did. Of course, that doesn't mean that I changed my mind about them, and that I think their services should be used.\n\nEquustek wanted to have some pages removed from search results, because they were apparently related to other company misusing their trademarks. They managed to gen an injunction that requires Google to remove results in question, with the problem being that it's supposed to do this globally, not just in Canada. This is a huge issue, because if this were allowed to happen, the most restrictive government would be able to affect search results everywhere.\n\nGoogle decided to fight against this by applying in the US, (where it's based) stating that it violates the First Amendment and Section 230, which ensures that online platforms aren't liable for content from others they host.\n\n[Archived article about this topic](http://archive.is/r4loy).\n\n* * *\n\nIn my opinion, this is the thing any company with modicum of common sense would do — enforce rights of the country they're based in rather than be ruled around by someone who has different laws that aren't compatible. In this case, this revolves around censorship, so it's even more relevant to me. (If laws somewhere are bad, it's still possible to start a company in a place where they aren't.)\n\nI wish handling things like this was more common. The best example of a company that does the opposite is Facebook. With little effort, I managed to find reports about them complying to requests from [Russia](http://archive.is/AY7iY), [Turkey](http://archive.is/Y4dFQ) and willing to do so for [China](http://archive.is/1wCVo). (Thanks, [rms](https://stallman.org/).)\n\nThreats to have access to your service blocked in some country shouldn't be scary to these companies, as people willing to use them would make enough noise to make these governments reconsider their choices, and if they don't change their mind, it's possible to bypass these restrictions.\n\n* * *\n\nI'm kind of late with this (even considering how I prefer to take time before posting something.) I've been to lazy to post this on ZeroNet, and I have some other problems I have to deal with. I don't know if I should change a little bit how I use ZeroNet and move the client to my home server and access it from any machine I happen to be using at the moment."
		},
		{
			"post_id": 16,
			"title": "The Great Firewall of China is blocking ZeroNet",
			"date_published": 1508276316.785,
			"body": "This won't be a long post, but it's about something important. It took me a couple of days to get to it, because I don't visit ZeroNet every day (and when things like this happen, I regret it.)\n\nA couple of days ago, an [issue on ZeroNet's GitHub](https://github.com/HelloZeroNet/ZeroNet/issues/1145) was opened. It's about [zeronet.io](https://zeronet.io/) being inaccessible from China.\n\n[Bru](http://127.0.0.1:43110/ZeroMedium.bit/?/1QKALTkDmKyTC5L7mZZu6R8ARLmrRfiAhL/ok-now-we-are-in-war-with-china) posted a story about it on [ZeroMedium](http://127.0.0.1:43110/ZeroMedium.bit/?/) (which is a relatively new zite I didn't write anything about yet, but it's worth checking out.)\n\nThis just shows that ZeroNet isn't that tiny, and the Chinese firewall is blocking it already. I've seen plenty of Chinese users around before, and ZeroNet might be important to them as means to post without being subject to censorship. It's nice to see that this network is used to fight with it by people in need. It also shows how good I have it compared to people in the other parts of this planet.\n\nI don't really know how I can help people from China, because I don't know Chinese myself. Some people are thinking about ways to sneak the bundle past the firewall so people on the other side of it can get started, which might become a problem if downloading it from GitHub stops being a viable solution. The issue on GitHub has some discussion about obfuscating the traffic so it can't be blocked, which is a problem as well."
		},
		{
			"post_id": 15,
			"title": "YouTube's news carousel",
			"date_published": 1508002836.936,
			"body": "Before continuing, I recommend watching [Project Veritas' report on NYT employee using connections at YT to manipulate search results in their favor](https://hooktube.com/watch?v%3Dr0c1Bph1jrQ).\n\nIt turns out YouTube has a \"news carousel\" in some search results for queries that deem \"newsy.\" Personally, I haven't heard of it before, because I avoid using YouTube directly, (I only do so when I want to watch 60 FPS VP9 video) and most of the time when I **need** to use it, (which isn't too often nowadays, because [vid.me](https://vid.me/) is the place I go to most of the time) because [HookTube](https://hooktube.com/) is a thing. Even if I directly used YouTube on a daily basis, I wouldn't have noticed it anyway, because I'm not searching for topics that would be eligible for such carousels anyway. Considering my stance on Alphabet and worries about their search results being manipulated, I wouldn't trust them.\n\nMy attempts to see the mentioned feature failed. Even when I try to look up topics that seem to be \"newsy,\" I can't find any special carousels, either I'm not making the right queries, the feature isn't rolled out to me, (which is a thing, YouTube rolls out some new features to random users) or it's only a thing in certain regions (I don't live in the US.)\n\nThe video I linked above is about one New York Times employee, Nick Dudich, who has connections in the Silicon Valley, including ones at YouTube. He's using them to help video content from NYT to get on the front page.\n\nThis video shows some interesting things, for instance how mainstream media is connected with YouTube by people like Dudich and how they have people who curate search results. Both of these things are bad.\n\nThe former is something I haven't talked about before, but it's been a thing for some time. YouTube seems to have a preference for mainstream channels, and is fine with them covering controversial topics, which would get independent people in trouble it they were to cover it. They have YouTube TV, which is a direct competitor to cable, a paid service where people can watch TV channels, including some mainstream news channels like Fox.\n\nYouTube has some \"priority\" channels that aren't checked by the automated flagging system. [It's been confirmed.](https://twitter.com/GamesAttorney/status/916667604495773697)\n\nThe latter is just evidence that my worries regarding YouTube aren't unjustified. Not only is it showing bias by standing behind certain people and organizations, it also has people who take care of what people find in their search results. [Considering that Alphabet clearly has a political bias](http://www.opensecrets.org/members-of-congress/contributors?cid%3DN00000019&cycle%3DCAREER), it sounds scary. [ComputingForever made another video pointing that out recently](https://vid.me/LuD5i), talking about topic of the Veritas report as well.\n\nIt's sad that YouTube is trying to become the new TV, with all of it's bad things. I stopped watching television years ago, and moved to YouTube, because there are lots of independent people there making content about things I'm interested in (which most of the time isn't even remotely political.)\n\n* * *\n\nIf anyone who's uploading something to YouTube is reading this, **make sure you mirror it to other video sharing sites as well**. YouTube has been a pretty unstable place recently, and ad revenue from videos is pretty low because of demonetization. It's not likely you've signed any paperwork to make your videos exclusive to YouTube, so having your content mirrored to other sites might make people check these sites out, it might make your revenue (especially on \"controversial\" videos) more stable if you decide to monetize on these sites.\n\nI'd like to see more interesting content on vid.me as well, because most of it is political, with the exclusion of [Anthony Fantano](https://vid.me/vidmelon), who hasn't been uploading to his vid.me channel for months. My attempts to find new people to watch haven't been that great, and I wish some people I watched on YouTube mirrored to vid.me."
		},
		{
			"post_id": 14,
			"title": "Overclocking monitors in X11",
			"date_published": 1506859220.408,
			"body": "I haven't posted anything on this blog in a while, because I don't see the point in posting about the same topics over and over, it gets tiring after a while, and I don't want to just spend my time looking for things to get angry over.\n\nSo, I recently got my hands on a CRT display, and I experimented for a while to get it to work at higher refresh rates.\n\nIt took me a little bit of troubleshooting and looking around for solutions, but I managed to get it all down.\n\nIn my case, the highest refresh rate I could set on my display was around 86 Hz. Surprisingly, that wasn't for the lowest resolution that could be set on it. It was way lower than what I was trying to get out of it, and I've found people claiming that the specific monitor I'm using can display 800x600 at 120 Hz. They were right, it's just a matter of adding a custom mode to the display.\n\nOn Windows (especially with Nvidia's drivers) it's a matter of going into their control panel and adding custom modes from there. Unfortunately, on GNU/Linux (in my case Arch) it isn't that easy, but it's doable. I think this guide should apply to pretty much anything that uses X11.\n\nSince this blogpost contains a guide on a topic that isn't easy to find, (it took me some searching and trial and error to get this down) I'm considering posting this outside of ZeroNet, but that's just something to consider for me. If someone wants to reuse knowledge from this post to write a guide or whatever, feel free to do so.\n\nI'll write down how I achieved this below, but first I should just add an obvious disclaimer that this can be risky and should be done with caution, as there's a chance things might go wrong. I've heard that older CRT displays didn't have any protection circuits that would prevent them from trying to display signals they can't handle, potentially causing damage to them. In my case, my monitor has said circuits, and it flashes the power light when it gets a signal it can't display.\n\nI've seen people trying to do the same thing to LCD displays, and sometimes it's possible to squeeze out a better refresh rate out of them with this trick. It can also be risky, so be careful.\n\nSo, the first thing to do is to find out the name of the relevant output. It's a matter of running\n\n```\nxrandr\n```\n\nits output will contain lists of supported modes for each display connected to an output. In case of CRT displays, they're likely to be connected over VGA, in my case, the name of the output I was looking for was `VGA-0`, but from what I understand this depends on the drivers used for the GPU.\n\nNow, in order to add a custom mode, it's necessary to get relevant modeline numbers. These can be generated with the `cvt` utility, which is pretty easy to use.\n\n```\ncvt 800 600 120\n```\n\nParameters passed to this utility are (obviously) in following order — width, height and (optionally) refresh rate. It's output will be needed for following steps, and it should look like this:\n\n```\n# 800x600 119.85 Hz (CVT) hsync: 77.43 kHz; pclk: 83.00 MHz\nModeline \"800x600_120.00\"   83.00  800 856 936 1072  600 603 607 646 -hsync +vsync\n```\n\nThe next step is to add the new mode.\n\n```\nxrandr --newmode \"800x600_120.00\" 83.00  800 856 936 1072  600 603 607 646 -hsync +vsync\n```\n\nIf done right, it shouldn't output anything. Of course, replace modeline numbers with your ones, which should come from the second line of <font color=\"#444444\" face=\"monospace\"><span style=\"font-size: 13px; background-color: rgb(245, 245, 245);\">cvt</span></font>'s output sans the first word.\n\nWhen that's done, the next step is to add the new mode to the desired output.\n\n```\nxrandr --addmode VGA-0 \"800x600_120.00\"\n```\n\nAgain, replace the mode with the one you're trying to set.\n\nWith all of that out of the way, it's just a matter of setting the mode. It can be done with `xrandr`, but I like to use `lxrandr`, which is a GUI to it that makes working with multi-monitor setups easy. It also provides a way to make settings persistent. If the display is working, then everything went right. In case of CRTs, it might be necessary to re-adjust them to make sure no part of the picture is outside of the visible zone.\n\nTo make the new mode persistent, the easiest way is to put lines that configure it into your `.xinitrc` file or something like that. A different file might be the one you're looking for if you happen to use a login manager.\n\nI've also messed around with `nvidia-settings` to add the new mode into my `xorg.conf` inside of the section for the monitor, but I don't think that's necessary to get it to work. In fact, letting it write the custom config file messed up my DPI settings and I had to resolve that issue manually, but that's irrelevant to the topic.\n\nA jump from 60 Hz displays to 120 Hz is noticeable, and moving the cursor around the screen is enough to see the difference. It also makes a difference when playing games, but getting them to run at framerates this high requires hardware that's capable of it (which shouldn't be a problem when playing older games like me) and possibly some tweaking to disable framerate caps if there are any.\n\nI think it was fun to figure out how to pull this off, and the effects are worth it.\n\nA high refresh rate combined with the way CRT displays show colors (deeper blacks compared to LCDs along with more vibrant colors (at least when compared to crappy TN panels I have in my laptops)) makes them look pretty nice, and playing games with them is a pleasant experience. Being able to run these displays at different refresh rates might have other benefits than just running them as fast as they can go. One possible use is to set them to a multiple of a desired framerate to watch something like anime without frame pacing issues. It's also possible to set them to match older displays to play DOS games with proper frame pacing (DOS prompt ran at 70Hz, and games like Doom were capped at 35 FPS, which won't be perfect on a 60Hz display.)\n\nGetting the CRT display to work the way I wanted it to gave me another challenge to fight with — setting the working area of my graphic tablet to map to a single display in a multi-display setup and match it to the aspect ratio. It's something I need to do in order to play osu! on my CRT display. The higher refresh rates seem to help some with higher ARs, and I want to check if it will make it easier to play AR 11 for me."
		},
		{
			"post_id": 13,
			"title": "I reformatted posts to look right",
			"date_published": 1505769182.282,
			"body": "Since I wasn't happy with line breaks added all over the place, which were caused by my setup and the org-mode exporter I use to translate my posts from org-mode to something I can use on this blog, I decided to take care of that.\n\nIt wasn't that bad, as there aren't that many posts on this blog, and it was just a matter of copying markdown source from the blog. spamming `M-^` in Emacs and replacing old source with fixed versions.\n\nI don't like the approach to newlines that's used by code that translates markdown to HTML in this blog software, as it enforces a bad practice of having entire paragraphs on a single line."
		},
		{
			"post_id": 12,
			"title": "Things I want to look into",
			"date_published": 1505766705.437,
			"body": "There are two interesting things I want to look at and possibly write about. Both of them are interesting in their ways, and even if it turns out I don't have much to say about them, sharing them with others seems to be the right thing to do.\n\n1.  [YaCy — a decentralized search engine](https://yacy.net/en/index.html).\n    It looks like a proper alternative to old-school search engines, which should make it impossible to tamper with search results, and that's my biggest concern. Crawling websites and storing all data from them requires a lot of storage, bandwith and computing power, meaning that search engines aren't just algorithms someone can write in their bedroom. Metasearch is a way to fight with tampering, but it's not perfect. I don't know if this engine is usable as of now, and I haven't tried it yet, everything I wrote before is just my thoughts on the idea.\n2.  [Coinhive — client-side cryptocurrency mining as a replacement for ads](https://coin-hive.com/).\n    This idea is interesting, and I think it's weird I haven't seen any attempts to pull this off before. I'm on the fence with this, because even though it could be an interesting way to support what I like, I can see potential abuse for this. I don't like the idea of being used without consent of users, and it could make browsing on mobile devices nasty if there's no way to block it (sluggish experience and higher battery drain.) I have to think about this before picking my side on the topic.\n\nI have plenty of other things to look into and try out as well, and I feel constrained by the amount of time I can put into this. One of these things is checking if I can run [ZeroNet](https://zeronet.io/) on [Termux](https://termux.com/), but that requires setting up Android in a vm, as I don't have any device running it at the moment.\n\nAlso, my formatting seems iffy in some older posts. I wonder if it's a problem with `ox-md`, which I normally use to convert my posts from [org-mode](http://orgmode.org/) to markdown. I'm actually directly in my browser using the visual editor to see how it's markdown output looks like, and it seems that wrapping lines causes my problems. Fixing this might require some elisp hacking, and I wonder if I should try to develop my own sites for ZeroNet. Improving ZeroBlog might be one interesting thing to try out."
		},
		{
			"post_id": 11,
			"title": "SJWbian",
			"date_published": 1505143507,
			"body": "I thought it would be a good idea to write a post about something different. I think writing why I don't like Debian is a good idea.\n\nFirst of all, `apt` is a piece of crap. There's no other way to put it — the commands are way too verbose and it takes too many of them to accomplish something. I don't like the idea of having sub-commands either, and I prefer standard *nix switches (possibly with GNU-style long versions.) I can stomach `git` and it's verbosity, because it's a decent version control system (although poorly named, I think `vc` would be a better name, sticking to two letter command names from the early days.) However, `apt` has clearly superior alternatives like `pacman` (which I think should've been named `pm`, which is my alias to `yaourt`.)\n\nWith `apt`, to do a full system upgrade and install a package `foo`, three verbose commands are needed:\n\n```\nsudo apt update\nsudo apt upgrade\nsudo apt install foo\n```\n\nWith a superior package manager, it can be all accomplished with a single command:\n\n```\nsudo pacman -Syu foo\n```\n\nAUR wrappers can make it even terser, with my setup I can update Arch repos as well as AUR and install `foo` with just:\n\n```\npm -Syua foo\n```\n\nI don't even need to bother with privileges, because it takes care of that for me.\n\nThere's also confirming prompts, which add to more effort required to use `apt`, unless flags to suppress them are used.\n\nDebian has also other problems. Its installer is garbage, and I got used to chrooting after an installation to change passwords, because it sets ones it wants when it deems my passwords inadequate. This problem carries over to derived distros as well, I had to put up with the same problem when installing Lubuntu on a vm (where I don't care about security of passwords, I want them to be easy to remember, my scheme of setting the password to be the user name works perfectly for that.)\n\nI wouldn't mind if they didn't bother with an installer, because a good guide is enough. Installing Arch is a pleasant experience.\n\n* * *\n\nAll previous problems were purely technical, next ones are going to get political, but I'm going to start with the one that fits in both categories — approach to licenses.\n\nDebian team made a retarded choice to not use [Stallman's freedoms (section \"The four essential freedoms\")](https://www.gnu.org/philosophy/free-sw.html), but rather roll own their own over-complicated set of rules called [The Debian Free Software Guidelines](https://www.debian.org/social_contract#guidelines).\n\nThe biggest problem with their guidelines is the fifth one:\n\n> 5​. No Discrimination Against Persons or Groups\n> The license must not discriminate against any person or group of persons.\n\nIt serves no purpose besides pandering to snowflakes. Along with the sixth guideline it's just a long-winded way of rewriting the zeroth freedom (any purpose) in a poorly worded way.\n\nTheir freedoms aren't compatible with the GNU FDL, which means that they're putting [documentation for parts of the GNU project in non-free repos](https://packages.debian.org/sid/emacs25-common-non-dfsg). (What a great way to waste time of users and split off something as basic as Emacs's documentation into another package, put in the same repo as non-free software like TeamSpeak and unrar.)\n\nThere are better distros that are 100% free software, like [Parabola GNU/linux-libre](https://www.parabola.nu/). [There's a list of these on the GNU project's page](https://www.gnu.org/distros/free-distros.html).\n\nEach of the problems I mentioned before are good enough reasons to not use Debian on their own, and I think they're pretty serious. There are other problems, though.\n\nA perfect example of what's wrong with them is the [anti-harassment page on their wiki](https://wiki.debian.org/AntiHarassment). It features links to GeekFeminism wiki and [this wonderful list](http://lafalafu.com/krc/privilege.html).\n\nThey also have a [Code of Conduct](https://www.debian.org/code_of_conduct), which is the kind of thing that belongs in containment forks like [ayo.js](https://github.com/ayojs/ayo) (which is a good idea in my opinion — people who care more about committees and [making drama out of eggplant Emojis](https://github.com/nodejs/TSC/issues/8) moving to their own project takes their burden off the upstream.)\n\nIf people who act inappropriately are a problem, a list of bannable offenses is enough. It pisses me off when GitHub nags me to add a CoC (I like that way to shorten it — it's phallic) to my repos.\n\nTheir [diversity statement](https://www.debian.org/intro/diversity) is **almost** good, but they had to ruin it with the last paragraph, which is just pandering.\n\nIn my opinion the best approach to diversity is to not force it — if the group is diverse, then that's good, but forcing it is wrong, just like quotas. I can't stand people who try to force even splits of races and sexes, because it isn't helping anyone.\n\nOf course, they have to have a project to [encourage women to work on Debian](https://www.debian.org/women/). Projects of these kind are just a poor attempt to achieve that pipe dream of even distribution of sexes or whatever. I don't see a reason why a woman couldn't join the Debian project without this project. If someone is actually sexist, it's just a matter of reporting them. At least this project is better than offering programs for only certain \"minorities,\" which is what James Damore accused Google of in his memo.\n\n* * *\n\nTL;DR:\n\n1.  `apt` is a bad package manager\n2.  installers for it are bad\n3.  DFSG is a mess that isn't compatible with GNU FDL, meaning docs from GNU software are shoved into non-free repos\n4.  DFSG panders to SJWs\n5.  the project has an anti-harassment page, which is full of links to GeekFeminism wiki\n6.  they fell for the CoC meme\n7.  their diversity statement is ruined by a paragraph that tries too hard to pander\n8.  they have programs encouraging women, implying they can't stand for themselves and that they need support"
		},
		{
			"post_id": 10,
			"title": "Pronouns",
			"date_published": 1504816485.946,
			"body": "There's one concept that is present in many languages that makes little sense in my opinion — pronouns.\n\nI still don't get the reason why they're a thing, and why they differ depending on the gender of the person they're supposed to refer to. Because of this, being able to use multiple sets of them to differentiate between people depends on their genders. It's a quite arbitrary aspect of people to pick different sets of pronouns.\n\nWhat's the point of adding this complexity to the language for no benefit? Wouldn't it be better to just have a single set of them meant to be used regardless of the person referred to?\n\nThere's a problem with people who want others to use their sets of made up pronouns, especially considering the [bill C-16](https://openparliament.ca/bills/42-1/C-16/) in Canada and [SB-219](https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201720180SB219) in California. (The latter bill is scarier, especially if these laws will be applied outside of these \"long-term care facilities.\") I don't think that legally enforcing use of preferred pronouns should be a thing, especially if they're made up by snowflakes. It's a way to control the way others speak, and these laws don't seem to do much besides pandering to certain kinds of people.\n\nJust take a look [this site](http://pronoun.is/). There are people who [make fun of this](https://github.com/witch-house/pronoun.is/pull/61), and there's a point when it's hard to see the line between jokes and someone's real preferences. In fact, the whole thing with identity politics is like that. [This wikia is a perfect example](http://gender.wikia.com/wiki/Gender_Wiki).\n\nPronouns suck even when no people who identify as attack helicopters or whatever are involved. Talking with someone over the Internet via means where it's not apparent can be awkward when one wants to stay neutral. Writing things like \"his/her\" makes text look like an eyesore. I think this should be enough of a reason to move towards neutral ones as a standard.\n\nI should mention that English is a way better language in this regard than Polish. It's way easier to avoid pronouns in it than it is in Polish, where words change depending on who they're addressed to. Even something as basic as \"I've done something\" requires changing words depending on the gender of the person speaking.\n\n* * *\n\nAs a disclaimer — I just think that made up pronouns aren't a good idea, and they serve no purpose. There is a difference between struggling with gender identity and acting like a special snowflake."
		},
		{
			"post_id": 9,
			"title": "Testing",
			"date_published": 1504672796.274,
			"body": "It seems that I have some peers now. It's interesting, because yesterday I didn't have any and I were getting errors every time I tried to publish.\n\nI guess that's just me being new to this shining through.\n\nI'm just posting this to see if I can publish without errors now."
		},
		{
			"post_id": 8,
			"title": "I'm done with moving posts",
			"date_published": 1504644587.892,
			"body": "Well, I think I've copied all relevant posts that had any substance from my Tumblr blog. If everything goes right, this will be my main place for blogging from now on. I'll just post a little bit about ZeroNet and how to use it once I figure things out.\n\nAlso, when I'm talking about Tumblr: I have to appreciate their web editor, as it allows to move posts between different formats. I was capable to retrieve my posts that I've written in org and exported to HTML as markdown, which made it trivial to move them over to ZeroBlog."
		},
		{
			"post_id": 7,
			"title": " ",
			"date_published": 1504641296,
			"body": "My worries regarding usage of service providers as a way to shut down websites weren't unjustified. [Gab.ai was asked to take down a post](https://medium.com/@getongab/we-are-at-war-for-a-free-and-open-internet-426629fba4bf) or lose its domain. The mentioned post was by [Andrew Anglin](https://encyclopediadramatica.rs/Andrew_Anglin), the founder of the Daily Stormer [(guess which site was taken down by Cloudfare before.)](https://gizmodo.com/cloudflare-ceo-on-terminating-service-to-neo-nazi-site-1797915295)\n\nThe request to take down a post was related to a formal complaint. I wonder who made that request, and why other sites, like Twitter aren't held to such high standards. [Take a look at this.](https://hooktube.com/watch?v=0UndDXkoEGs) (A site worth mentioning — it tries to anonymize YT searches and acts like a proxy between the viewer and YT servers.) Posts from porn bots on Twitter aren't marked as NSFW, just like the post mentioned. It's not the only case where there's questionable (or worse) content on it. Remember when [LionMaker Studios](https://encyclopediadramatica.rs/LionMaker_Studios) posted CP on Twitter? I don't remember Twitter being threatened to have their domain name revoked.\n\nThe post was taken down, as not doing so would cause huge problems for gab. Apparently, the post wasn't marked as NSFW when it should've been, and that's the reason why it got removed. I can't tell what I think about the post myself, as I haven't seen it. Still — free speech is free speech, regardless if people agree with it.\n\nI guess this just shows that moving away from centralized Internet is important. It's just a way to buy some time for gab, and another attacks at it on this level are just a matter of time.\n\nI should actually start blogging on [ZeroNet](https://zeronet.io/), and it's my fault that I didn't look into it more since I last mentioned it. I'll try to actually set up a blog there in the near future.\n\n* * *\n\nAnother thing — I haven't linked to Wikipedia, but to Encyclopedia Dramatica. [Wikipedia has clear biases](https://en.wikipedia.org/wiki/Gamergate_controversy), and I recommend taking articles from there with a grain of salt, and looking for information on other sources as well, especially when it's political or controversial in other ways."
		},
		{
			"post_id": 6,
			"title": "YouTube alternatives",
			"date_published": 1504641242.271,
			"body": "Well, since I posted yesterday about how YouTube is getting worse and worse, I think it makes sense to write about alternatives to it. Of course, I'm not going to write about **every** video sharing site out there, but I'll try to write about two I have tried out.\n\nFirst one is [vid.me](https://vid.me/) — a site that has been around for a couple of years. It has a subscribe and follow system like Twitch — subscriptions are a way to support with money. There is also a way to tip people just once directly from the site. Video quality isn't as good as YT, and vid.me uses more bandwidth for the same resolution (but still manages to look worse.) The website is nice, but obviously it's not as polished as YT is. If you want to upload to it, you will have limits to quantity of content you can upload before you get verified, as well as being unable to put your content in your categories before you do so. I haven't seen a way to stream to vid.me, so it's lacking that feature as well.\n\nIn general, vid.me is usable and somewhat similar to YouTube. It's definitely not as good, but it has some interesting features that other sites should consider copying. Direct support of content creators is a nice feature that is an alternative to sites like Patreon.\n\nOne more thing about vid.me — watch out for mobile apps, as you might accidentally send your phonebook to their servers. Here's the relevant part of their privacy policy:\n\n> Certain features of the Services require access to your device's native phonebook and image storage applications (e.g., to find friends or to store a message in your photo gallery). If you choose to find friends, the phone numbers in your device's native phonebook will be transmitted to our servers.\n\nIt's always possible to use vid.me through a website, (if their site is responsive, I don't have any mobile device to check it out on at the moment) or lock the app's access to your phonebook if you don't like this.\n\nAnother site that I find interesting is [BitChute](https://www.bitchute.com/), which uses WebTorrent to seed video you're watching to others, meaning users become the infrastructure that delivers content. Since it's very new, it's rough. The website isn't the most pleasant to navigate. There's also no way to control the quality of video you're watching, and that quality isn't particularly high.\n\nIt seems like [people behind this site don't like the adpocalypse and YT trying to get rid of people who they don't agree with](https://www.bitchute.com/faq), which means it's a good place to move to from YT.\n\nBitChute doesn't seem to have any mobile apps yet, and I don't know if that's going to change.\n\nI think BitChute is a move in a good direction, and I hope the idea will be taken further. It is definitely a move towards a decentralized way of video sharing, but it still has weak points, like their servers, which could get taken down by for example their hosting service.\n\nBitChute is worth trying out in my opinion, as you're able to see how many peers are you connected to and how much you're uploading and downloading. It's interesting to see how accessible P2P video sharing can become if done right.\n\nThere are also sites like [DailyMotion](http://www.dailymotion.com) and [Vimeo](https://vimeo.com/), which aren't new. In fact, Vimeo is older than YouTube. I didn't write about them, as they're better known, and I didn't check them out. Since they're older and bigger, they're more prone to being targeted for copyright violations. Maybe it's not as bad as YouTube, where their DMCA-style takedowns are used as a way to censor people. Jim Sterling made multiple videos where he talked about this, and he was affected by it himself. I won't even link to his channel on YouTube, as I'm trying to keep linking to that site to the absolute minimum. You can look it up yourself.\n\nThere's also [Minds](https://www.minds.com/), which can be used for video sharing among other things. I'm not interested in it, as it's trying to compete with sites like Facebook, and I'm don't want to be on social media sites of that kind. Still, I think it's worth mentioning that it exists, and some might be interested in it.\n\nI hope that decentralized networks like [ZeroNet](https://zeronet.io/) will gain the capability to handle video sharing in the future, as these should be more resistant to censorship. As a reminder, [Cloudfare took down the Daily Stormer](https://gizmodo.com/cloudflare-ceo-on-terminating-service-to-neo-nazi-site-1797915295). They changed their approach from being hands-off about [who they provide their services for](https://torrentfreak.com/cloudflare-we-cant-stop-pirate-sites-160927/) to taking down sites on their whim. It seems like that was an arbitrary choice, but it can be a beginning of service providers refusing to host sites they don't like. There's also a chance that enough people complaining will be enough to take down a site. That's why I'm looking for decentralized solutions that won't have these problems.\n\nIf you're going on one of these sites, there is a chance people who you watch are already on these platforms — try searching for them or looking for links to these sites in their profiles on other sites. Some search engines aren't very good, and it takes multiple queries to find what you're looking for (in case of vid.me it's hard to find a channel when you're not searching for it's exact name.) Some people will use different names on these sites, for instance [Anthony Fantano named his profile \"vidmelon\"](https://vid.me/vidmelon) on vid.me."
		},
		{
			"post_id": 5,
			"title": " ",
			"date_published": 1504641084.126,
			"body": "Well, limited state on YouTube is now a thing. Here's a video that's in said limited state: [https://www.youtube.com/watch?v=6SJNVb0GnPI](https://www.youtube.com/watch?v=6SJNVb0GnPI)\n\nThis is a great way to experience how limited state works and how it affects watching content on YouTube. You get a warning screen before going to the video, and the page you're watching it on lacks some features, such as recommendations, rating and comments. You can't visit the channel the video you're watching belongs to directly.\n\nIt's still possible to:\n\n*   search for the video (which from what I understand wasn't supposed to happen)\n*   see the video on the channel it belongs to\n\nI don't know if that's intended, and it might change in the future.\n\nApparently the video can't be viewed in an embedded player, and it just shows a warning and forces you to watch it on YouTube directly.\n\nIt seems that links to these videos aren't marked in any special way, and the first sign that they're in limited state is the warning screen you have to go through.\n\nAll of this shows that Google and YouTube are serious with their plans, and that they're making them real. I wouldn't be surprised when they start replacing search results (both on Google and YouTube) with things that match their agenda. That's why I avoid search engines like [startpage](https://www.ixquick.com/), which merely try to anonymize your searches through Google. Consider using something like [searx](https://github.com/asciimoo/searx), which will mix results from many engines.\n\n* * *\n\nBy the way: I don't care about the content of the video I've linked to. I didn't watch it, and the post isn't about that. It's the video I could find without much effort, and it shows that limited state is a thing now, and how it works.\n\nAlso, I'm not trying to be the very first one to post about something, so don't expect me to rush posts as soon as I find out about something. I prefer to spend some time and think about things before writing about them. I even spent some time planning and considering avoiding Google.\n\n* * *\n\nUpdate: [censoredlist.com](http://www.censoredlist.com/) tries to list videos that are in limited state."
		},
		{
			"post_id": 4,
			"title": " ",
			"date_published": 1504641024.371,
			"body": "Well, this activates my almonds pretty hard.\n\nI just can't stand people who make bullshit claims about the Google memo without actually reading it. Look at this moron:\n\n> James Damore's memo was anti-diversity.\n> — [comzeradd on HN](https://news.ycombinator.com/item?id=15088501)\n\nDid this person even bother to read the memo in question? It's very unlikely, considering that this claim is the opposite of truth.\n\nI guess bothering to read a short 10 page memo is too much for some people, and they'd rather get a condensed version of it from a \"credible\" news source without doubting it in the slightest.\n\nWell, I might as well write about [this \"masterpiece\"](http://www.slate.com/articles/health_and_science/science/2017/08/evolutionary_psychology_is_the_most_obvious_example_of_how_science_is_flawed.html) as well.\n\n> Google bro would argue that we ought to consider the possibility that white women and racial minorities simply produce lower-quality work, which is why we struggle to be recognized as competent knowledge producers.\n\nThis claim is flawed, as it doesn't get that the memo was talking about average (which affects how many people will apply for a job, since they have to be interested in things related to tech industry and learn them in the first place.) There is a difference between saying that women are inferior and that **on average** they aren't as good at something as men. Not only that, but it tries to make it about race as well, which makes it even more flawed. Do people actively check what race author of something is? I guess people who do aren't that common, and they might be actually racist.\n\nThere's also another sentence in this mess that sticks out:\n\n> It’s 2017, and to some extent scientific literature still supports a patriarchal view that ranks a man’s intellect above a woman’s.\n\nNot does it only use the current year argument, which is weak and flawed, (try making a claim **why** something is relevant rather than saying what year it is at the moment) but it also implies that the author considers only claims that confirm their beliefs correct.\n\nI didn't bother to point out every fallacy in that article, because that's outside of the scope of this post.\n\n* * *\n\nJust as an aside, I don't like HN personally. I think that page doesn't have much content worth reading, and I can find more relevant links to news articles on `/g/` of all places, since threads there links there tend to link to more relevant articles."
		},
		{
			"post_id": 3,
			"title": " ",
			"date_published": 1504640814.903,
			"body": "I'm deeply worried about what happened at Google. The whole fiasco with James Damore and the [“Google’s Ideological Echo Chamber”](https://my.mixtape.moe/giqlzd.pdf) [(another link)](https://www.scribd.com/document/355817414/Googles-Ideological-Echo-Chamber) memo was the point where I think Google went too far. I knew that they were biased before, for instance when it comes to [demonetizing political videos that supported Donald Trump.](https://vid.me/YK2K#4m20s)\n\nI linked to [vid.me](https://vid.me/) because I'm worried this guy won't last long on YouTube after they implement their [limited state (described in paragraph starting with “tougher standards.\")](https://youtube.googleblog.com/2017/08/an-update-on-our-commitment-to-fight.html) Even if vid.me has a chance of becoming as bad as YouTube is, it's likely that that will take time. ~~Why are there so many sites that don't care about making it easy to link to a particular paragraph?~~\n\nWhen it comes to the reason why Damore got fired, the reason just makes his point even more relevant. Apparently pointing out that there are differences between sexes is [“perpetuating gender stereotypes.”](https://www.wired.com/story/james-damore-author-google-memo-might-sue/) He wasn't doing that, just read through the memo.\n\nBy doing this, Google pretty much declared a war against anyone with opinions differing to theirs, and they went too far in my opinion. What makes it scary is that they own a search engine used by many people, and by controlling search results they can influence opinions of users of their search engine. For instance, the [“jigsaw redirect method”](https://redirectmethod.org/) that they're rolling out on YouTube tries to replace content they don't like with curated content in search results. I wouldn't be surprised if they tried to do something similar with Google search results.\n\nI've been lenient towards them, because I knew how much I relied on their services, but now I'm considering boycotting them. I don't think their search engine would be the biggest problem for me.YouTube would be the biggest problem. I haven't seen a video sharing site that can compete, not only when it comes to content available on it, but also how it's delivered. I haven't seen any competitor that uses newer and superior video formats like vp9, delivers 60 FPS content, and has an interface that can compete with YouTube.\n\nOne of the ways I can show my disdain for Google is to block their ads. There's an extension called [AdNauseam](https://adnauseam.io/) which tries to click on ads to fight against tracking. It didn't seem to work for me, so I'm using plain old [uBlock Origin](https://github.com/gorhill/uBlock/) instead. Even though I don't like using ad blockers in general, (because I want to support people responsible for content I consume that way) I've decided to start doing that now.\n\nThere's also a problem with web browsers — [FireFox has it's problems](https://www.ghacks.net/2017/07/13/privacy-blunder-firefox-getaddons-page-google-analytics/) and Chromium has issues as well, such as being bundled with support for Google services and having binary blobs inside. Chromium is so bad that [Parabola GNU/Linux-libre blacklisted it.](https://www.parabola.nu/news/chromium-blacklisted-to-respect-your-freedom/) There are alternatives such as [GNU IceCat](https://www.gnu.org/software/gnuzilla/) and [ungoogled-chromium,](https://github.com/Eloston/ungoogled-chromium) but both of them lag behind when it comes to releases. This matters to me, because I like messing around with bleeding-edge ECMAScript as it's being supported in browsers.\n\n* * *\n\nThe problem isn't just Google, though. It seems like a lot of tech companies have a left leaning bias and sometimes try to shut down people with differing opinions. For instance, [Parteon shut down Lauren Southern's account.](https://patreonsucks.com/)\n\nThis makes me sad, because software development is the industry I'd want to work in."
		},
		{
			"post_id": 2,
			"title": "First post",
			"date_published": 1504640485.895,
			"body": "This post is here just to make sure my blog isn't completely empty before the first publish.\n\nI might add here some of my posts from my [Tumblr blog](http://bano-2d.tumblr.com/), but I'm still planning how I want to run this blog."
		}
	]
}