{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1581976802_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 1,
				"body": "add Big Kopy Kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/ thank you",
				"added": 1582004255
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1814_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This site isn't moderated. I would not seed it. 0net.io, I believe was taken down by authorities because of sites dedicated to CP on there. [...]\n\nI DO NOT DEFEND PEDOPHILY OR ANY SHIT, I DO NOT DEFEND ANYONE, I DEFEND MY FREEDOM, because now you want to ban cp, then you want to ban music, then you want to ban film x or y, because company x or y, or government x or y NO LIKES IT.\n\nYoutube started EXACTLY like that, banning something silly here and there and look what has become, neither I nor anyone will ban ANY content from big kopy kate 2, users who must block what they don't like or use the lists we have on zeronet, from people who keep posting shit, pedophilia and fucking for four.\n\nBUT the site itself WILL NOT DO ANYTHING, besides adding the option of the USER individually to be able to ban the content FOR HIM and only him.\n\nTHERE IS NO HALF FREEDOM.\n\nEither you have TOTAL freedom or you don't, and big kopy kate 2, has TOTAL access to ALL zeronet tools, the guy who is NOT liking a channel / video, can BLOCK the user in question, simple.\n\n===========================================================================\ntradução pt-br\n\nNÃO DEFENDO PEDOFILIA OU QUALQUER MERDA, eu não defendo NINGUÉM, eu defendo a MINHA LIBERDADE, pois agora tu quer banir cp, depois quer banir musica, depois quer banir filme x ou y , porque empresa x ou y , ou governo x ou y NÃO GOSTA.\n\nYoutube começou EXATAMENTE assim, banindo algo bobinho aqui e acolá e olha o que virou, eu , nem ninguém vai banir QUALQUER conteudo do big kopy kate 2, os usuários que devem bloquear o que não gostarem ou usar as listas que temos na zeronet, de pessoas que ficam postando merda, pedofilia e o caralho a quatro.\n\nMAs o site em si NÃO VAI FAZER NADA , alem de adicionar opção do USUÁRIO individualmente poder banir o conteudo PARA ELE  e somente ele.\n\nNÃO EXISTE MEIA LIBERDADE.\n\nOu  tu tem TOTAL liberdade ou não tem, e o big kopy kate 2 , tem TOTAL acesso a TODAS as ferramentas da zeronet, o cara que NÃO ESTIVER gostando de um canal/video, pode BLOQUEAR o usuário em questão, simples.",
				"added": 1582084907
			},
			{
				"comment_id": 3,
				"body": "> [filips](#comment_430_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I think that 0net.io went down just because they stopped maintaining it :) [...]\n\nthat cp you have on big kopy kate 2, you are drunk, I don’t see anything here, only if it’s from people I’ve ALREADY BLOCKED on my account and then go back to what I said I WILL NOT block anyone on the site, people who should watch and block the content they DO NOT LIKE.\n\nWhat I have on the site as far as I can see is a series, films, documentary anime and cartoons.\n\nAlias send me 1 cp link that you have on this site, because I haven't seen one, I just block anything I don't like, simple, but I'm NOT wanting to control what others may or may not see, if I refuse to post shit THEM problem, they get along with the authorities, I do not command anything and I only block on channels I don't like or people on zeronet, simple, easy and practical\n\n\n============================================================\n\ntradução pt-br\n\nque cp  que tem no big kopy kate 2 , vocês estão bêbados, não vejo nada aqui, só se for de gente que JÁ BLOQUEI na minha conta e dai de novo entra no que disse EU NÃO VOU bloquear ninguém no site, as pessoas que devem vigiar e bloquear os conteudos que NÃO GOSTAM.\n\nO que tem no site até onde vejo é seriado, filmes, animes documentários e desenhos.\n\nAlias me manda 1 link de cp que tenha neste site, pois eu não vi nem um, eu simplesmente dou block em qualquer coisa que não goste, simples, mas NÃO fico querendo controlar o que os outros podem ou não ver, se nego quer postar merda problema DELES, eles que se entendam com as autoridades, eu não mando em nada e só dou block em canais que não gosto ou pessoas na zeronet, simples , facil e pratico",
				"added": 1582085244
			}
		],
		"1575616298_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 4,
				"body": "The Last Samurai (O Último Samurai) 2003 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582092652_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582093101
			},
			{
				"comment_id": 5,
				"body": "Planet of the Apes (O Planeta dos Macacos) 2001 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582345769_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582345913
			},
			{
				"comment_id": 6,
				"body": "The Godfather Part III (O Poderoso Chefão 3) 1990 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582460619_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582460762
			},
			{
				"comment_id": 7,
				"body": "The Return of the Pink Panther (O Retorno da Pantera Cor de Rosa) 1975 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1582616376_168gJn3wXqtecLDyNwjSqWecjpwp9R96hm",
				"added": 1582616484
			}
		]
	},
	"comment_vote": {}
}