{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1619803098,
			"title": "Sailors, sailing, crossing oceans with the winds...",
			"body": "Anyone here has ever crossed an ocean on boat? I heard some stories... amazing !",
			"added": 1619803097
		},
		{
			"topic_id": 1619964755,
			"title": "[MEGA POST] the united nations armed forces so called bluehelmet...",
			"body": "there is no expression than I hate more than to describe those as peacekeepers... as when they attempted to attack china through Korea?\n\nI wish them death, and no, Islam won't wear \"blue helmet\", is a flag, with the shahada on it, and none from this world will change that so if you wish to die as kuffars, please, proceed.",
			"added": 1619964753
		}
	],
	"topic_vote": {},
	"next_comment_id": 53,
	"comment": {
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "Today I am really disappointed and it comes from that :  \n\n>In a draft resolution tabled on Wednesday “on Russia, the case of Alexei Navalny, the military build-up on Ukraine’s border and Russian attacks in the Czech Republic,” the group of mostly Eastern European lawmakers suggested that if the current tensions over Ukraine turn into an outright Russian invasion, imports of “oil and gas from Russia to the EU [must] be immediately stopped, while Russia should be excluded from the SWIFT payment system, and all assets in the EU of oligarchs close to the Russian authorities and their families in the EU need to be frozen and their visas cancelled.\n\nhttps://thedailycoin.org/2021/04/29/brussels-wants-swift-shut-off-halt-to-russian-energy-use-if-ukraine-aggression-continues/\n\nHow the fuck is Russia still vulnerable to those people? That's the problem to me... \n\nIt's a WAR ! they want it to remain invisible, but it's a full on war on mankind.\n\nand so babbling around, pretending that all will return to order is a pure disillusion.\n\nat least see the positive side, they have still not launched reasons for russian terminal retaliation, that's where we are...\n\na question did stalin read mein kampf before allying with hitler? (I don't know if there is a part about soviets etc, but I guess it wouldn't have been too hard to understand what was going on... I mean?!?).\n\nand so this guidestone agenda? disregarded as stupid rocks nowhere?\n\nand what about this russian girl fucking on a sacred mountain somewhere? what is going on?\n\nI have the impression that some, always being in the \"international arena, palaces, petit fours, best etc) forget... or don't see... or don't read the reports... \n\nbest example in france is bordeaux... you go to the city center for a receptions, galas, speech etc, everything is splendid... go a little further... ahhh... datchas are better.\n\nand I read some commentary about pervasive corruption in russia, at all level, docs, nurses etc... \n\nit's the trap of the extensive global plan, leaving a weak core...\n\nwhile rome is being looted, the legions are strong in the outskirts, most don't know, don't understand, and don't want to believe... \n\nat least you still have a country in russia... dont't lose it.\n\n\"they\" are coming for it.",
				"added": 1619801195
			},
			{
				"comment_id": 2,
				"body": "China may not have \"won ww2\", but I am very confident, that now, those who seek to take over china, are in for the hell ride of their whole lives... I don't have the same confidence toward russia... show me a kill a list... executed, and continuously updated... yeah yeah... empire... and i am speaking inward. first front is the domestic enemies... I understand the weather is cold in winter etc... it's not a reason to betray the motherland ! and wha ever the reason, treason is execution.",
				"added": 1619801367
			},
			{
				"comment_id": 3,
				"body": "and fundamentally I guess, there is still a belief about a peaceful, prosperous harmonious international order based on law... \n\nso why not let the ukrainians decide those laws? ahh. they are not legitimate? that's the argument... it's a little weak...\n\nI remain convinced that trump speech writer nailed it : a constallation of nations... free, independent, sovereign, not trying to rule, influence, undermine, control, etc others... and there we can move forward...\n\nthe all narrative of covert great nation \"competition\"... it ends in front line, nuked armed, for those surviving the shadows war... \n\nit's a mindset... who is the fuck to tell the saudis how to live? what the fuck? who in this fucking world to go somewhere, foreign, and impose \"international law\" on an other people? madness... like criminalizing a plant of planet... \n\nback to earth... \n\nin my modest opinion it's a fundamental problem of management, specially of public entity : how to fire public workers, who didn't nothing wrong, but simply their program is terminated. retooling, shifting line of work etc... internal dynamism, rather to losing oneself in a total war for the control of medina... \n\nit is so easy to see for france... but a dream, ideals, etc, hiding lies, for the self enrichement, engrandizement of certain individual profiting from it, sometimes at the direct expanse of the native people, and most of the time indirectly affecting them negatively...\n\nthe lion pride... so it's a lion who waste is all days trying to conquer the land of another tribe, to not see what is going on in his own pack.\n\nfocus on the nest !",
				"added": 1619802094
			},
			{
				"comment_id": 4,
				"body": "basic example why the fuck is russia inside the european court of human rights? what is this crazynes? who had such an idea? in china, supreme court of china end. we won't let the sovereignty in regards of china to anyone, what so ever... aliens included. there will be ups, there will downs, but forward !",
				"added": 1619802228
			},
			{
				"comment_id": 5,
				"body": "pipelines are another good example... they pay, they get. they don't pay, they don't get. end. transactional. not trans national.... transactions... al... wysiwyg. china.",
				"added": 1619802336
			},
			{
				"comment_id": 6,
				"body": "all this influence / value is not only fucking the mind of the enemies... adversaries, competittors... again what the fuck : you want to learn kung fu, go to kung fu school. (yes it can super hard, what, you want to learn kung fu or not?) you see? simplicity. for harmony... no bullshit on lie, on plans, on variations... everyone is lost at the end.",
				"added": 1619802472
			},
			{
				"comment_id": 7,
				"body": "and the final issue and the most important : IN THE CHINESE SPACE PROGRAMS WE SPEAK THE OFFICIAL LANGUAGE OF THE OFFICIALS. it's very simple, even it's looks complicated. there is a language, among the many thousand in china, that is the language of the officials. this is the language used. you can use what you want in your daily lives, but in and with the officials, it's the official language. this language has more tradition, history, etc, that all the other languages in the world, it's not about exterminating your identities and culture and what ever, translate the concepts that may still be foreign to the official language, openess, always, and moving on. otherwise it's chaos.",
				"added": 1619802720
			},
			{
				"comment_id": 8,
				"body": "and don't enter this superiority, inferiority complex... the fucking Khan... you know... the great one? fucking learned it. it's like this. so think about all of this... thank you very much, have a nice week end, and I am not linda kinkade :).",
				"added": 1619802989
			}
		],
		"1619803098_1NJcfEP5FK4bJrR2Kfb4t5hNP9ox4bpcVJ": [
			{
				"comment_id": 9,
				"body": "Oceanic sNailing? \n\n\"Whelk (also known as scungilli) is a common name that is applied to various kinds of sea snail. True whelks are carnivorous, feeding on worms, crustaceans, mussels and other molluscs, drilling holes through shells to gain access to the soft tissues. Whelks use chemoreceptors to locate their prey.\n\nIts adaptations include a modified radula (a toothed chitinous structure) to bore holes in the shells of prey, complemented by an organ on the foot which secretes a shell-softening chemical. When a hole has been formed paralyzing chemicals and digestive enzymes are secreted inside the shell to break the soft body down into a 'soup' which can be sucked out with the proboscis. The plates of barnacles can be pushed apart with the proboscis, and the entire individual is eaten in about a day, although larger animals such as mussels may take up to a week to digest.\n\nMussels have developed a defensive strategy of tethering and immobilising with byssus threads any dog whelks invading their beds, leading to the whelks' starvation.\n\nDog whelks were used in antiquity to make a rich red dye that improves in color as it ages.\"",
				"added": 1619856651
			}
		],
		"1619820771_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 10,
				"body": "ah, someone is over flack...\n\nhowever I don't think that this houtje has the iq necessary to understand what is gonna fall on his clan :)... \n\nremember disinformation agent, skyscrappers don't fall from the sky in Shanghai...\n\nand if they did, investigated may lead to the annihilation of your nation...",
				"added": 1619869593
			}
		],
		"1619964755_1NJcfEP5FK4bJrR2Kfb4t5hNP9ox4bpcVJ": [
			{
				"comment_id": 11,
				"body": "but don't believe a second that your semantics touches me... never has, never will, and your westphalian order is grinded by the sand, will... you will see...\n\nand what remain of the goal of those who sought to enslave mankind, make plants of the creation illegal... \n\nyou have no idea\n\nneither the true yahoodiz will ever surrender, and if you think Islam will, it's that the tragedy of the divides fouls you...\n\none god, one last prophet... sand in the way, and get blasted to hell ! you will never impose your charter over the quaran , you will never modify the quaran nor rule makah, you won't...\n\nand if you fear already the little yahooizes with their mini coast, it's because you don't understand what Islam means, and represents... \n\nfallen.",
				"added": 1619964899
			},
			{
				"comment_id": 12,
				"body": "smashing those things... an EMPEROR can't build a mosk... an emir at best... those people don't understand...  \n\nanyway said, I am not interested by the cities, the sands belong to islam, and i don't give a shit at what you call \"your borders\"...\n\nit's like for eretz, but on scale beyond practical imagination... I am not there to put little stone, to mark where exactly, keep out... move back... that's it... \n\nyou don't want, cool... fleeced you will be.\n\nthe only difference with eretz, is that the terrain is so small, that it's effectively possible to determine to whom each rock side is on... it's serious matter this eretz...  people... I mean goyim don't understand... how many rocks are there in eretz, and importantly, which are one are missing, where did they went.... we have some ideas...",
				"added": 1619966841
			},
			{
				"comment_id": 13,
				"body": "in short it's the fake religion of the humanist, the relativists always changing construct, with the first and the last monotheism... so you know... again the jews alone, you are already defeated, against islam, wait for it... both? suicide by semiths :).",
				"added": 1619966920
			},
			{
				"comment_id": 14,
				"body": "I can't wait for the obliteration of both of your capital cities uners... I can't wait, to put a terminal end to your obsession, to establish your one world order...  and even if islam and yahoodiscism didn't existed, I would be against you...\n\ni hate your ideas, it doesn't make sense financially...",
				"added": 1619967009
			},
			{
				"comment_id": 15,
				"body": "but don't get wrong for you it does... not for me...",
				"added": 1619967032
			},
			{
				"comment_id": 16,
				"body": "i am really curious if hindooistan will surrender to your ways...",
				"added": 1619967059
			},
			{
				"comment_id": 17,
				"body": "peacekeepers... those people, they are afraid of nothing, in semantics...",
				"added": 1619967148
			},
			{
				"comment_id": 18,
				"body": "then I am curious if they would fight payless... I have no doubt about islam (the defense of medina, isn't about money, kingdom, or what ever... ) the yahoodiz? the great shekels is just a currency, the currency of the holly land... and in hindooistan, money for brahma? where are we, only kuffars americans and blue helmets fight for a pay... or salary... what a shame...",
				"added": 1619967230
			},
			{
				"comment_id": 19,
				"body": "how to make money in the death of bluehelmet? who does provide life insurances to those filths? what's the rate? I guess americans value their lives more? lol... attached to the dunyah... stuck...",
				"added": 1619967367
			},
			{
				"comment_id": 20,
				"body": "and personally I think the fundamental problem that the un faces is that their personals are too uncompetitive for the market...",
				"added": 1619967480
			},
			{
				"comment_id": 21,
				"body": "so what can they do? they are stupid enough to engage for the sand... wait for the moment it will be said enough Islam wide... you will run, you will run back to where you came from...",
				"added": 1619967526
			},
			{
				"comment_id": 22,
				"body": "and many forget that muslims too have up and downs... when back to the \"golden ages\" as they say... ahh you will not be so proud and arrogant in your quest to eradicate the book... oh you fear and see your both cities in ashes... ahahahah !  that's life. and frankly the more I undersand the Heart of Islam... yayay... the renaissance has already happened... of course, like in your movie, you believe all will be taken back to the sand, you dream, they are born over it...",
				"added": 1619967675
			},
			{
				"comment_id": 23,
				"body": "my dream is from markoko to indonesia, all people and nations, including those with the turbans, enough, to uno. enough.",
				"added": 1619967743
			},
			{
				"comment_id": 24,
				"body": "and that if in their blindess, arrogance and deafness that as said in the book, their only outcome is death.",
				"added": 1619967765
			},
			{
				"comment_id": 25,
				"body": "so that it happen swiftly.",
				"added": 1619967779
			},
			{
				"comment_id": 26,
				"body": "so that it can be told, that once upon a time raised by the kuffars an organization which attempted to take over the world, wipe islam and destroy the book, and that for once and for a brief time the whole ummah, enemies and foes, united and wiped them.\n\nit's a nice story, and a nice warning to the world... get out , stay away... we understand, you don't want the revelation, so stay out, it's already a lot to let live such filths.",
				"added": 1619967902
			},
			{
				"comment_id": 27,
				"body": "i start to understand the plan... so the usa, to save themselves from my spacecraft destrutive power, are trying to lead me to target first the un/bluehelmet... fine fine... no problem with it... you better surrender when I will be finished with them, but this delivery lags... or who knows where it is... \n\ni can't stand this un idea... the unidea... the humannightmare... and paved in good intentons... \n\namerican modern troops are such suckers, never those with the founders would have gone so low... and they would have been executed for a such a treason.",
				"added": 1619968140
			},
			{
				"comment_id": 28,
				"body": "treason. 1 flag, 1 nation...",
				"added": 1619968149
			},
			{
				"comment_id": 29,
				"body": "not united nations to serve rockfeller oil ambitions... pathetic.",
				"added": 1619968165
			},
			{
				"comment_id": 30,
				"body": "then one currency?",
				"added": 1619968172
			},
			{
				"comment_id": 31,
				"body": "one court?",
				"added": 1619968177
			},
			{
				"comment_id": 32,
				"body": "one chairman?",
				"added": 1619968182
			},
			{
				"comment_id": 33,
				"body": "one jail system?",
				"added": 1619968187
			},
			{
				"comment_id": 34,
				"body": "one epstein?",
				"added": 1619968199
			},
			{
				"comment_id": 35,
				"body": "you are trying to create hell...",
				"added": 1619968219
			},
			{
				"comment_id": 36,
				"body": "I am for psy scan of all american troops, living vets included and all that fall in the un gig, executed, it would lower the upkeep and restore the ranks...",
				"added": 1619968260
			},
			{
				"comment_id": 37,
				"body": "*/ \\- I hope this flag won't be betrayed.",
				"added": 1619968330
			},
			{
				"comment_id": 38,
				"body": "and it is ! here :)...",
				"added": 1619968359
			},
			{
				"comment_id": 39,
				"body": "in this world of deceit... * / L -",
				"added": 1619968384
			},
			{
				"comment_id": 40,
				"body": "\\",
				"added": 1619968399
			},
			{
				"comment_id": 41,
				"body": "* / \\ -",
				"added": 1619968416
			},
			{
				"comment_id": 42,
				"body": "again ! scandaleous... who cares anyway... I consider ccp supremacy over china as important as islam one over the sand.",
				"added": 1619968454
			},
			{
				"comment_id": 43,
				"body": "those sands... not the chinese sands :).",
				"added": 1619968464
			},
			{
				"comment_id": 44,
				"body": "we all know that... one day the blue helmet they will try too to take over the chinese sands...",
				"added": 1619968484
			},
			{
				"comment_id": 45,
				"body": "it's sure... unless they have been destroyed before.",
				"added": 1619968503
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 46,
				"body": "you know why they did such research on syphilis? pedos...",
				"added": 1619970902
			},
			{
				"comment_id": 47,
				"body": "once you unframe your belief system, all their actions become clears... apes on legs... nothing more, ah yes, shaved...",
				"added": 1619970931
			},
			{
				"comment_id": 48,
				"body": "the real problem with modeling is that sometimes, you try everything... and at one point you find one that works... it works... what's anoying is when you start to dig in the premises of it... devastating. the weakness, the corruption... fallen...",
				"added": 1619971012
			},
			{
				"comment_id": 49,
				"body": "it's so barbaric, so uncivilized, and of course as your from born and raised, you bathed in it all your life, so you don't understand what I write... you can't... and if you do, it's such pain... terrible... everything you believed was a lie.",
				"added": 1619971078
			},
			{
				"comment_id": 50,
				"body": "and worst compounded generation lies... leaving the matrix... terrible.",
				"added": 1619971103
			},
			{
				"comment_id": 51,
				"body": "but is there another way to live? a life of lies? or the truth? what is ... of course it's just modeling, there are often too outliers... but if the model is really good, it's just that the outlier wasn't yet really understood...",
				"added": 1619971160
			}
		],
		"1619906359_1HGKXBnrJs6kTo2QqTUMYEicDsSwrYqwKN": [
			{
				"comment_id": 52,
				"body": "> [carnival](#comment_1_1BbSjXHZXjp9gtTvn3FQLkTx2kzwJPkf9C): That's sort of advert. Ways of contacting you would be also recommened.http://127.0.0.1:43333/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/\n\nyou are really desperate at the hoover building? one ask, the other answer, and both work overtime over it? if it's not money laundering I don't know what it is... go see nancy, ask for moar... leeches.",
				"added": 1619975025
			}
		]
	},
	"comment_vote": {}
}