{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1,
			"title": "Насколько плох TiddlyWiki в качестве Wiki-движка?",
			"body": "Кривые примеры тут:\nhttp://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa\nhttp://127.0.0.1:43110/1DwJMuuV8rzbktXrN1j8oimJWHN6kDywZL",
			"added": 1455285306
		},
		{
			"topic_id": 2,
			"title": "Чем глобально ведение ЗероБлогов отличается от Твиттера?",
			"body": "Ведь на блоги и комменты в них можно подписываться. Твиттером не пользуюсь, так что не обессудьте.",
			"added": 1455286051
		},
		{
			"topic_id": 3,
			"title": "Proof of individuality (доказательство индивидуальности)",
			"body": "Можно ли такую штуку замутить здесь? Например, всем юзерам из ZeroID предлагается раз в неделю в строго определенное время играть всем одновременно в какую-то игру внутри сети. Исходя из того, что живому человеку будет сложно играть в игру одновременно за нескольких ZeroID, можно начислять некий рейтинг индивидуальности каждому ZeroID, основываясь на его успехах в играх. Таким образом, у ID, которые используются как маски (клоны) рейтинг будет низкий, и их можно будет не учитывать при голосованиях.",
			"added": 1455293134
		},
		{
			"topic_id": 4,
			"title": "Может пригласить сюда автора сети Пандора?",
			"body": "Статья на Хабре: https://habrahabr.ru/post/245111/\nGitHub страница: https://github.com/Novator/Pandora\n\nДля начала, автор может копии своих статей увековечить здесь в личном блоге. А затем может вообще захочет переписать свой код под Web-интерфейс и запилить это тут. Все-таки народ здешний уже подготовлен морально к подобным инновационным идеям).",
			"added": 1455407675
		},
		{
			"topic_id": 5,
			"title": "Подходящий поисковой движок",
			"body": "Внезапно объявился автор сайта ZeroSearch. Я помню, где-то уже была тема с обсуждением подходящих для Зеронета поисковых движков (на английском), но вот найти её без поиска не могу). Есть у кого-нибудь конструктивные предложения/идеи? Yacy вроде бы не очень походит.",
			"added": 1455497566
		},
		{
			"topic_id": 6,
			"title": "Что можно добавить в FAQ (Русский язык)",
			"body": "Стараемся сообщения оформлять в стиле вопрос - ответ. Голосуем за понравившиеся. Английская ветка тут: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:21_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/What+could+be+added+in+FAQ",
			"added": 1455649598
		},
		{
			"topic_id": 7,
			"title": "Добавить в качестве Issue на GitHub",
			"body": "Пишем кратко свои предложения тут, чтобы потом не забыть. Если тема не взлетит - удалю.",
			"added": 1455654723
		},
		{
			"topic_id": 9,
			"title": "Софт для автоматических пожертвований на Open source",
			"body": "А вот действительно, знает ли кто-нибудь сервис для автоматических донатов на разные проекты? К примеру, я решил тратить 1% своего месячного дохода в качестве пожертвования на разработку своих любимых Open source проектов (в т.ч. ZeroNet). Но таких проектов несколько, и я просто выставляют процентное соотношение на каждый из них. Раз в месяц мне на почту приходит напоминалка о том, что пора бы перечислить очередной платеж. Сервис должен вести статистику: сколько всего денег было пожертвовано на тот или иной проект за определенное время. Желательно, чтобы это все работало через криптовалюты.",
			"added": 1455998507
		}
	],
	"topic_vote": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"9_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_1DjxkUHNWyzVrESngih4CZy9D844FvrKwM": 1,
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": 1
	},
	"next_comment_id": 335,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [manrus](#comment_3_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Спасибо) Забыл совсем\n\nЗабавно, что ответ на вопрос у меня отображается ниже чем сам вопрос.",
				"added": 1455281329
			},
			{
				"comment_id": 2,
				"body": "> [shift](#comment_3_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): не вижу кстати его\n\nОн только у своего сообщения появляется. При наведении мышкой на него.",
				"added": 1455281364
			},
			{
				"comment_id": 3,
				"body": "С одной стороны мы английскую ветку засирали, а с другой стороны вновьприбывшим англосаксам видно было, что беседа идет, т.е. проект живой. Тем более, что использовали мы только несколько тем на русском языке. Но я не прочь и тут общаться, разницы особой нету)",
				"added": 1455281917
			},
			{
				"comment_id": 4,
				"body": "> [manrus](#comment_8_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): У меня оказывается часы отстают на 23 сек. Из-за чего собственно мой сообщение оказывалось отправлено в \"прошлом\" времени\n\nСтоит об это сообщать разрабам, или это не поправить никак?",
				"added": 1455282018
			},
			{
				"comment_id": 5,
				"body": "> [shift](#comment_15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): PS Всё еще не нашел это ваше редактирование\nГлянь тут:\nhttp://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/?Topic:2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/",
				"added": 1455282490
			},
			{
				"comment_id": 6,
				"body": "> [shift](#comment_16_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): может баг сафари но у меня этого нет\n> PS Вижу на том ресурсе сделали возможность картинки вставлять, а чего в оригинал не впилили?\n\nВот тут не в курсе, разраб просто ответил, что не планировал эту возможность добавлять на основной форум. Может, за свободное место переживает.",
				"added": 1455282788
			},
			{
				"comment_id": 15,
				"body": "> [gomzik](#comment_12_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ребятушки, коль уж я решил в блоге прямо пошаговый гитхаб выкладывать свой, мне нужно, чтобы мой pet-project имел цель. Скажите, мне нужно что-то в районе чатика по объемам работ, но что-то более оригинальное и, желательно, полезное. Может предложите что?\n\nЧатик с кнопкой 'NewsFeed')) ?",
				"added": 1455289844
			},
			{
				"comment_id": 18,
				"body": "Тяпница же.",
				"added": 1455304776
			},
			{
				"comment_id": 19,
				"body": "Разработчики там сейчас пилят TWедерацию так называемую, где будет возможность оставлять комменты друг у друга в TiddlyWiki",
				"added": 1455307653
			},
			{
				"comment_id": 20,
				"body": "В тонкостях я не силен, но вроде идея в том, что каждая тиддливики будет опрашивать своих \"друзей\" на предмет новых тиддлеров (т.е. сообщений), и если таковые найдет - скопирует их в свой код. По-другому нельзя, т.к. каждая такая вики - однопользовательская, т.е. разрешение на запись есть только у автора.",
				"added": 1455309357
			},
			{
				"comment_id": 21,
				"body": "Вот тут уже можно оставлять комменты, но они пока сделаны через аккаунты Google\nhttp://twaddle.tiddlyspot.com/#Different%20worlds:[[Different%20worlds]]",
				"added": 1455309540
			},
			{
				"comment_id": 22,
				"body": "А кто знает хорошо приспособленную для Зеронета вики?)",
				"added": 1455309799
			},
			{
				"comment_id": 23,
				"body": "> [wrewolf](#comment_12_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): как опрашивать она же файл\n\nНу возможно, при вызове (просмотре) определенных тиддлеров (постов), будут выполняться скрипты (макросы), которые будут формировать запросы к другим тиддливикам с целью изъятия комментариев. Сама ТиддлиВики не так просто устроена, как кажется на первый взгляд - там есть и скрипты и макросы, и черти чего только нет) Вот как пример:\nhttp://tiddlymap.org/\nЕсли вы из браузера сохраните эту вики себе на комп, она все равно будет работать.",
				"added": 1455311248
			},
			{
				"comment_id": 24,
				"body": "> [wrewolf](#comment_12_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): как опрашивать она же файл\nНапример так можно обратиться к отдельному тиддлеру в пределах моей тиддливики (одного html-файла):\nhttp://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa#ПоискТиддлера\nТаким же макаром можно делать фильтрованные запросы и т.п.\nUpdate: Сорри, это работает, только если сначала зайти на основную страницу, а затем уже в строке браузера вводить запросы. Но в обычном интернете или просто на своем компе должно работать и так.",
				"added": 1455314464
			},
			{
				"comment_id": 25,
				"body": "> [wrewolf](#comment_13_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): А можно редактировать?\n\nРедактировать можно, но вроде только после установки расширения к браузеру. И только если редактирующий - это автор/хозяин данной вики.",
				"added": 1455320545
			},
			{
				"comment_id": 26,
				"body": "Непонял, какой еще коин прикрутят? Это кто такое говорит?)",
				"added": 1455393926
			},
			{
				"comment_id": 34,
				"body": "У меня кстати место заканчивается под комменты на этом форуме. Сообщение появляется, чтобы я обратился к nofish, но что-то мне подсказывает, что это не поможет))",
				"added": 1455533466
			},
			{
				"comment_id": 35,
				"body": "> [shift](#comment_37_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Пойду курить маны как повысить лимит =)\nТут вот [был вопрос](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:3_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ/Why+I+can+t+enlarge+users+data+maximum+size) про это, правда для блога:\n",
				"added": 1455533726
			},
			{
				"comment_id": 36,
				"body": "Кстати, как здесь ссылки вставлять в компактном виде? В смысле без тела самой ссылки.",
				"added": 1455533794
			},
			{
				"comment_id": 37,
				"body": "> [shift](#comment_40_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): http://pastebin.com/7xLDi1vx\n\nПолучилось, спасибо.",
				"added": 1455533963
			},
			{
				"comment_id": 38,
				"body": "Что такое DO?",
				"added": 1455534394
			},
			{
				"comment_id": 40,
				"body": "Да, у меня пока лимит - 20K, хотя вместо nofish уже советует обращаться к shift",
				"added": 1455535031
			},
			{
				"comment_id": 41,
				"body": "> [wrewolf](#comment_31_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Я пока не вижу ничего, где смотреть?\n\nКогда новый комментарий печатешь снизу справа показывается лимит и текущее значение.",
				"added": 1455537167
			},
			{
				"comment_id": 42,
				"body": "Экономим кажд. слово)",
				"added": 1455538909
			},
			{
				"comment_id": 43,
				"body": "Дык они же у всех посетителей дублируются. Я на всякий случай копирнул твой сайт в отдельную папку на винте.",
				"added": 1455540177
			},
			{
				"comment_id": 44,
				"body": "А не пробовали зеронет отключать насовсем, когда изменения делаете? Затем запускать из командной строки на подпись и публикацию. А затем только снова его запускать. Мне когда-то помог такой вариант. После перезапуска, количество отображаемых сидеров у сайтов падает оч. существенно, кстати.",
				"added": 1455545957
			},
			{
				"comment_id": 45,
				"body": "Да, теперь место появилось, аж 100Кб! В чем дело-то было?",
				"added": 1455549894
			},
			{
				"comment_id": 46,
				"body": "> [gomzik](#comment_58_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Короче счетчки комментариев остался, сам комментарии потерялись и ничего не могу с этим сделать. Бог с ним\n\nПрикольно, я когда захожу на этот блог, у меня все комментарии грузятся, правда [ошибка вылезает](http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/?Topic:2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/)",
				"added": 1455552846
			},
			{
				"comment_id": 47,
				"body": "> [gomzik](#comment_62_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ну-ка отдай мне свой бэкап\n\nhttp://rghost.ru/6KZJLMynW",
				"added": 1455553107
			},
			{
				"comment_id": 49,
				"body": "> [wrewolf](#comment_41_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): В ZeroMail самый крутой момент, это после отправки, \"Content published to N peer\"\n\nНу он же тело письма шифрует, так что враги прочитать не должны.",
				"added": 1455553622
			},
			{
				"comment_id": 50,
				"body": "Кто-то видео выложил: http://127.0.0.1:43110/1Gn9DgEuDZVKeaq449oiMZQnE9uPLziyCm",
				"added": 1455553825
			},
			{
				"comment_id": 51,
				"body": "Интересный [ролик](http://127.0.0.1:43110/12ye7c7efq7FGvfML6c8u4ZcfNZDk9mjw1/?Topic:4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/Windows+10+takes+screenshots+of+your+desktop+automatically+and+send+it+to+MS) про Windows 10.",
				"added": 1455555812
			},
			{
				"comment_id": 52,
				"body": "А такая вот [ссылка](http://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa/index2.html) работает, кстати?",
				"added": 1455560855
			},
			{
				"comment_id": 53,
				"body": "Все работает. Единственное, сообщение что 1 FILE UPDATE FAILED так и весит. Но это не только на этом сайте у меня. PS: а мои ссылки работают?",
				"added": 1455564569
			},
			{
				"comment_id": 54,
				"body": "Тоже самое, мне кажется, что это на моей стороне косяк. Потому что такая фигня у меня не только с твоим сайтом.",
				"added": 1455565383
			},
			{
				"comment_id": 55,
				"body": "Исправил кстати. Не знаю, может кому поможет. Но я нажимал кнопку меню рядом с сайтом, выбирал паузу, затем делал апдейт, затем резюм.",
				"added": 1455565533
			},
			{
				"comment_id": 56,
				"body": "> [wrewolf](#comment_44_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): 404\n\nНе работает ссылка моя?",
				"added": 1455608219
			},
			{
				"comment_id": 57,
				"body": "> [gomzik](#comment_70_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А ну вот и славно. Фуух. Хз, наберусь ли я сил еще на статью...\n\nСтатью новую увидел, но почему-то не могу оставить комментарий в ней. Вернее оставить могу, и он у меня даже отображается, но вот дальше в сеть не распространяется. Ошибка такая:Content sign failed: ivalid private key",
				"added": 1455611581
			},
			{
				"comment_id": 58,
				"body": "Ограничения нормально - 100K",
				"added": 1455611734
			},
			{
				"comment_id": 59,
				"body": "Сейчас исчез коммент уже). Возможно, из сети апдейт подгрузился без моего коммента.",
				"added": 1455611871
			},
			{
				"comment_id": 60,
				"body": "А это с чьим ключом проблема, с моим или с твоим? По идее, если бы было с моим, то я бы нигде не мог комментарии оставлять...",
				"added": 1455612014
			},
			{
				"comment_id": 61,
				"body": "Да нет, я просто хотел написать, что ссылку на блог выложил на [Bitcointalk](https://bitcointalk.org/index.php?topic=1237458.20)",
				"added": 1455612906
			},
			{
				"comment_id": 62,
				"body": "> [wrewolf](#comment_45_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): да, там нет файла\n\nТам нужно лимит для сайта 20 Мб поставить. А то в 10 уже не умещается все.",
				"added": 1455615884
			},
			{
				"comment_id": 63,
				"body": "У меня 12:46",
				"added": 1455616007
			},
			{
				"comment_id": 64,
				"body": "> [wrewolf](#comment_54_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): тоже\n\nТвой коммент раньше моего отобразился в истории беседы, а увидел я его позже. Хотя, может быть, это нормально.",
				"added": 1455616062
			},
			{
				"comment_id": 65,
				"body": "Там вчера был товарищ на ЗероТолке, у кого было время на 4 часа вперед, его комменты всегда были сверху с подписью 'just now'. Это, конечно, портило удобство отслеживания новых комментов.",
				"added": 1455616177
			},
			{
				"comment_id": 66,
				"body": "[Вот](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:2_1PPqTMbH8Uwrk496grUVuBk57dSoeU9hig/Make+a+Zeronet+file+hosting+service) этот топик",
				"added": 1455616319
			},
			{
				"comment_id": 67,
				"body": "> [wrewolf](#comment_48_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Not Found\n> \n> index2.html\n\nМожно еще попробовать Update сделать для сайта принудительный.",
				"added": 1455616438
			},
			{
				"comment_id": 68,
				"body": "> [wrewolf](#comment_56_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): сделал, все равно Not Found\n\nСтранно. Еще можно в другом браузере попробовать открыть. А через гейтвей [работает](http://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa/index2.html)?",
				"added": 1455616793
			},
			{
				"comment_id": 69,
				"body": "> [gomzik](#comment_94_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Зацените каhttp://free.userboard.net/t36-topicтам есть мой блог и наш толк. Кто-то еще усердно нас пиарит\n\nМне кажется, это Винни Пух) http://127.0.0.1:43110/16unhVWi9eLuZ4tosVtBd9eDqDTYzbgMSL",
				"added": 1455620593
			},
			{
				"comment_id": 70,
				"body": "А кто-нибудь знает как логотип сменить в блоге?",
				"added": 1455621484
			},
			{
				"comment_id": 71,
				"body": "Я в html коде встретил такую вот запись:   \n<li>![image alt](img/logo.png)</li>\nПодумал, что если я в папку img logo.png положу, то оно отобразится, но не вышло.",
				"added": 1455622176
			},
			{
				"comment_id": 72,
				"body": "А если я создаю блог, нажимая кнопку clone, то как мне узнать затем свой Private Key для этого блога? Ведь когда обычным способом сайт создаешь, то Зеронет тебе его сообщает.",
				"added": 1455623013
			},
			{
				"comment_id": 73,
				"body": "> [gomzik](#comment_99_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Он записывается в data/users.json и автоматом используется при подписке\n\nСпасибо, нашел.",
				"added": 1455623232
			},
			{
				"comment_id": 74,
				"body": "> [wrewolf](#comment_65_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): блог иконкаУдалить упоминание avatar из all.js, прописать стиль иконки в all.css или в index.htmlПолучится так.\n\nУра! Получилось. А как часть поста убрать под кат?",
				"added": 1455624177
			},
			{
				"comment_id": 75,
				"body": "А покупать этот  рейтинг можно будет? Так может в итоге получиться криптовалюта с мастернодами.",
				"added": 1455630349
			},
			{
				"comment_id": 76,
				"body": "> [gomzik](#comment_106_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Не, я намекал на банальный пользовательский рейтинг. Как часто он туда ходит, на сколько фидов подписан и т.п.\n\nНу, кстати да. Добавить функцию в настройках, что автоматически удалять сайты из списка пользователя спустя несколько месяцев, если за это время он туда ни разу не ходил.",
				"added": 1455630638
			},
			{
				"comment_id": 77,
				"body": "> [gomzik](#comment_107_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Эта плата явно должна быть крайне символическая. Держать на раздаче сайт как мне кажется не особо востребована.\n\nЭто смотря что держать)) Может там ~~детское~~ порно. Или еще хуже - RuTracker.",
				"added": 1455631983
			},
			{
				"comment_id": 78,
				"body": "> [gomzik](#comment_109_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Да какая разница, оно ж в целом уже не так сильно от тебя зависит\n\nПочему? Оно зависит от тех, кто его сидирует. Они и есть под атакой. За это им и денюжку можно платить. А те кто просто поглазеть заходят, на тех полагаться нельзя, т.к. они подозрительный контент будут сразу удалять.",
				"added": 1455632413
			},
			{
				"comment_id": 79,
				"body": "Если получится развести народ из DASH, может быть они рекламку сделают, мол DASH - первая валюта со своим [p2p блогом](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99).",
				"added": 1455632577
			},
			{
				"comment_id": 80,
				"body": "> [gomzik](#comment_111_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Рановато, как мне кажется, усердно пиарить зеронет\n\nОни не прямо сейчас, нужно, чтобы еще несколько статей хотя бы вышло.",
				"added": 1455632726
			},
			{
				"comment_id": 81,
				"body": "> [shift](#comment_58_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А где оно сделано в оригинале?\n\n[тут](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:5_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i/ZeroSearch+sub+topic)",
				"added": 1455633215
			},
			{
				"comment_id": 82,
				"body": "А сколько стоит здешний домен в переводе на доллары? Мне кстати без домена даже удобнее, т.к. я могу адреса сайтов копировать по двойному клику на абракадабру, а вот с xxxx.bit уже так не получается.",
				"added": 1455633844
			},
			{
				"comment_id": 83,
				"body": "> [gomzik](#comment_118_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Перепутал. 0.02 за регу и 0.005 за апдейт\n\nНу [1 неймкоин = 0,41$](http://coinmarketcap.com/currencies/namecoin/), т.е. 0,82 цента за регу 0,21 цента за продление. В российских рублях это 62 и 16 копеек соответственно. Терпимо).",
				"added": 1455634222
			},
			{
				"comment_id": 84,
				"body": "> [manrus](#comment_26_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Значит у nippletwister спешат\n\n\"Компьютер настроен на автоматическую синхронизацию с time.windows.com\"",
				"added": 1455634723
			},
			{
				"comment_id": 85,
				"body": "Обновил. 18:00:48",
				"added": 1455634851
			},
			{
				"comment_id": 86,
				"body": "> [gomzik](#comment_126_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ого. +24 секунды о_О\n\n))",
				"added": 1455634958
			},
			{
				"comment_id": 87,
				"body": "Ну у меня визуально максимум на секунду спешат.",
				"added": 1455635057
			},
			{
				"comment_id": 88,
				"body": "Это да. А вы не в курсе, автор блога/форума может удалять неугодные ему комменты? Иначе ведь спама будет море, рано или поздно...",
				"added": 1455635998
			},
			{
				"comment_id": 89,
				"body": "Кстати, мне тут подумалось, что теоретически любой обычный интернет-ресурс может при желании запилить свой гейтвей в Зеронет и иметь здесь сайт. Обычные пользователи могут заходить через гейтвей (слабая безопасность), не видя вообще разницы между обычным интернетом, а продвинутые могут заходить напрямую.",
				"added": 1455637135
			},
			{
				"comment_id": 90,
				"body": "> [shift](#comment_61_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): И каким же образом ты предлагаешь динамику конвертить в статику?\nНу я ж сказал \"теоретически\")) Имелись в виду простенькие сайты.",
				"added": 1455637303
			},
			{
				"comment_id": 91,
				"body": "Мне тут написали что якобы у криптовалюты Qora есть свой децентрализованный блог на основе блокчейна. Я пока у них на сайте нашел вот это: http://qora.co.in:9090/qoraholic\nХотя пихать в блокчейн блог, это, имхо, неумно. Ладно бы еще хеши от IPFS.",
				"added": 1455638652
			},
			{
				"comment_id": 92,
				"body": "> [shift](#comment_63_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Как обычно нигде не написано как это сделать...\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1L8UURA9tgSn2XcRxtpCRJYCQm5S9ELh2Y/How+do+you+create+sticky+posts+and+news+flows",
				"added": 1455642021
			},
			{
				"comment_id": 93,
				"body": "> [gomzik](#comment_141_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А рядом и про топики-папки или как их назвать\n\nРодительские",
				"added": 1455642205
			},
			{
				"comment_id": 94,
				"body": "> [shift](#comment_64_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): По идее прилепил, ждем обновления файлов...\n\nРаботает)",
				"added": 1455642920
			},
			{
				"comment_id": 95,
				"body": "> [gomzik](#comment_140_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ааа кодярник менять надо... Тут же тюнить так, чтобы ui был не долго.\n\nДа, нам бы сюда еще картинки запилить. Небольшие можно для начала.",
				"added": 1455643175
			},
			{
				"comment_id": 96,
				"body": "> [gomzik](#comment_145_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Да вроде ж хотели просто перенести обсуждение в чуть более удобный толк. Такие топики можно несколько делать, так что можешь отдельно сделать что-то более широкое\n\nА чем в блоге обсуждение неудобно? Имхо, очень даже ничего там.",
				"added": 1455646754
			},
			{
				"comment_id": 97,
				"body": "Разница только в том, что там нельзя лайки ставить над комментариями. Интересно, кстати, можно ли это поправить..",
				"added": 1455647147
			},
			{
				"comment_id": 98,
				"body": "@Shift, а не в курсе, можно ли тебе как админу темы закрывать или блокировать/удалять? Или только лимиты выставлять? Я вот на своем клоне Зеротока не смог тему удалить (специально для попробовать сделал клон)\nUPD: опередил меня)",
				"added": 1455647244
			},
			{
				"comment_id": 99,
				"body": "Может спросить у nofish как лучше банить и удалять неугодных?)",
				"added": 1455647766
			},
			{
				"comment_id": 100,
				"body": "> [shift](#comment_71_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Мне кажется его мы уже задолбали =)\n\nНу он не обязан сразу отвечать, пусть вопрос повисит, проветрится). Щас провентиллирую, может уже было.",
				"added": 1455647890
			},
			{
				"comment_id": 101,
				"body": "А подскажите нубу как можно у Зеронета [FAQ](http://zeronet.readthedocs.org/en/latest/faq/) дополнить? Мне nofish говорил, мол, все на гитхабе лежит. Но я гитхабом пользоваться ваще не умею. Просто щас много вопросов уже у нас прояснилось, можно бы это все туда добавить, чтобы другие велосипед не изобретали в случае чего.",
				"added": 1455648602
			},
			{
				"comment_id": 102,
				"body": "Толк 2.0 или Толк эволюшн)\nДля FAQ тут отдельную тему заведу, не жалко?",
				"added": 1455649080
			},
			{
				"comment_id": 103,
				"body": "Надо еще поизучать [конкурента](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:15_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/Potential+ZeroNet+competitors+alternatives) будет. На форуме сказали, что их система [не берет много денег](https://bitcointalk.org/index.php?topic=1358722.msg13906211#msg13906211) за постинг в блокчейн.",
				"added": 1455649529
			},
			{
				"comment_id": 104,
				"body": "> [gomzik](#comment_163_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А как постинг в блокчейн и зеронет связаны? Тут от биткойна ж криптография только\n\nВопчем никак не связаны. Я тоже думаю, что в блокчейн глупо записывать такую инфу. У нее же объем потенциально огромный. Но может я чего-то не понимаю. В любом случае, надо разобраться в системе, чтобы прикинуть, взлетит или нет. Я тут где-то на BlockchainDB давал ссылку, вот это видится более реальным.",
				"added": 1455649726
			},
			{
				"comment_id": 110,
				"body": "Кстати, у меня ZeroBoard не работает. Может она тоже лимит по размеру исчерпала? Или я там свой лимит выбрал...",
				"added": 1455656625
			},
			{
				"comment_id": 111,
				"body": "> [shiftmobile](#comment_3_1KaUm726fZRejccvnvcJdhjgnrbYStadCq): Вспомнил что мне больше всего зеронэт напоминает - maidsafe\n\nТолько там тоже валюта своя, и насколько я понял, его еще не запустили. Плюс, мне он не очень нравится на вид, уж слишком коммерческий и уж слижком \"для тупых\", судя по интерфейсу. Хотя своя монета, имхо, очень нужна, т.к. она позволяет проекту самофинансироваться и самоуправляться.",
				"added": 1455660817
			},
			{
				"comment_id": 122,
				"body": "Я создал две темы про FAQ: одну тут, на русском языке, и другую на ZeroTalk, на английском. Пока пишу туда все, что приходит в голову. За понравившиеся вопросы-ответы можно голосовать. Можно, конечно, добавлять свои. В русской ветке неплохо было бы перевести оригинальный фак...",
				"added": 1455691303
			},
			{
				"comment_id": 123,
				"body": "> [manrus](#comment_37_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Нашел свой самый первый сайт http://127.0.0.1:43110/1L8Xq8deSCTRiBrfgyZ5nPKucEmAWHWs6GПоследние изменение от 21 января 2015 года ))\n\nДостояние истории).",
				"added": 1455702201
			},
			{
				"comment_id": 124,
				"body": "Кстати, какие у нас приоритеты? Какой FAQ важнее/срочнее, наш или буржуйский? Нашего пока [нет вообще](http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/+FAQ), буржуйский существует в [базовом варианте](http://zeronet.readthedocs.org/en/latest/faq/).",
				"added": 1455703109
			},
			{
				"comment_id": 128,
				"body": "Насчет защиты от спама: а что если реализовать сортировку комментов в соответствии с рейтингом? Тогда спаммерские комменты будут автоматом в конце списка, и переделывать сильно ничего не надо. В ZeroQuotes уже реализована сортировка.",
				"added": 1455722919
			},
			{
				"comment_id": 129,
				"body": "> [manrus](#comment_39_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Тогда порвется нить беседы. Сортировку лучше делать для топиков\n\nНу в общем да, без сокрытия комментов с отрицательным рейтингом никуда.",
				"added": 1455723130
			},
			{
				"comment_id": 130,
				"body": "Пока что решил сосредоточиться на русском [ФАКе](http://bit.no.com:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa). Уже переведено около 60% (22 из 37).",
				"added": 1455736690
			},
			{
				"comment_id": 131,
				"body": "Мучился, мучился. Короче пока доступно в таком вот странном виде: http://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa\nХотя у меня есть исходник в формате md, потому можно будет с лету сделать как в оригинале.",
				"added": 1455739995
			},
			{
				"comment_id": 135,
				"body": "Наткнулся случайно на русское подобие трекера/флудилки: http://127.0.0.1:43110/13zWcviPiQWhyy8Yprou2pfvcfGcaNW3MF",
				"added": 1455775796
			},
			{
				"comment_id": 137,
				"body": "> [wrewolfbitnocom](#comment_2_1GZZ3VLPQgTXkyud3aoBzXbpcSnpnLGnZT): Как такое обнаружить можно?\n\nКогда заходишь на bit.no.com и другие гейтвеи, то есть вероятность, что кто-то уже заходил на свой новый сайт через гейтвей. Т.е. на гейтвеях, обычно, самый полный список сайтов в Зеронете. Я про это написал в ФАКе тоже, см. вопрос \"Как обнаружить новые сайты?\".",
				"added": 1455788823
			},
			{
				"comment_id": 138,
				"body": "> [wrewolf](#comment_80_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): ну в общем оставлю это здесь\n\nКлассно, а можешь описать в FAQ как создать свой гейтвей? Если это умещается в пределах одного вопрос-ответа, конечно.",
				"added": 1455788953
			},
			{
				"comment_id": 139,
				"body": "> [gomzik](#comment_168_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Для TW есть плагин, позволяющий писать контент в md\n\nПусть пока так повесИт: http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke\nПроверьте кстати, закачивается ли у вас **md** вариант, сделать рабочую ссылку на него внутри html у меня не получилось).\n\nКак допереведу, обновлю там, и напишу об этом здесь.",
				"added": 1455792074
			},
			{
				"comment_id": 140,
				"body": "Вот еще ресурсы по нахождению новых сайтов:\nhttp://127.0.0.1:43110/1Dt7FR5aNLkqAjmosWh8cMWzJu633GYN6u\nhttp://127.0.0.1:43110/14LPKMNiDdgvSyhcboimzaALEeVYDvZ7qe\n\nПравда, работают они пока с ошипками.",
				"added": 1455793379
			},
			{
				"comment_id": 141,
				"body": "Ну они хотят сортировку сделать по голосам, как на ZeroQuote. \nА так согласен, каталогов куча стала. Возможно это разные версии одного и того же. И как автор запилит то, что хотел, то остальное все удалит. Интересно, кстати, как удалить свой сайт насовсем?",
				"added": 1455797016
			},
			{
				"comment_id": 142,
				"body": "> [gomzik](#comment_171_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): никак, пока он кем-то сидируется :)\n\nПлохо, сеть засоряется, получается.",
				"added": 1455797228
			},
			{
				"comment_id": 143,
				"body": "Ага, уже есть такие сайты-брошенки: http://127.0.0.1:43110/1Nbhkp97DviiyTFEZnBDAk7WhksKNui2hD",
				"added": 1455797580
			},
			{
				"comment_id": 144,
				"body": "Можно какую-нить фишку придумать, которая будет давать сигнал сидерам, что автор данного сайта не хочет больше его поддерживать. Например, в заголовке писать [deleted by author].",
				"added": 1455802459
			},
			{
				"comment_id": 145,
				"body": "90% ФАКа переведено.",
				"added": 1455806465
			},
			{
				"comment_id": 146,
				"body": "Так я не понял, показался кто-нибудь живой с Русской свежатинки? Или там всё не так уж и свежо?)",
				"added": 1455822444
			},
			{
				"comment_id": 147,
				"body": "> [gomzik](#comment_177_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Вроде как сделал большую часть элементов интерфейса, думаю сейчас буду логикой заниматься\n> http://i.imgur.com/VeMfn0t.png\n\nняшненько) А зачем две кнопки \"войти\"?",
				"added": 1455827958
			},
			{
				"comment_id": 148,
				"body": "> [gomzik](#comment_176_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): shift, давай объясню на эту тему по русски. Никто не может модифицировать пользовательский файл на любом сайте, кроме самого пользователя. Ты не можешь выпелить часть json из пользовательского json так как ты не сможешь его подписать. А не сможешь его подписать - не сможешь его распространять. Т.е. данные в этом json навсегда. Тебе только остается решить на своем сайте, будешь ли ты это выводить в ui или нет.\n\nА можно решить у себя на сайте не хранить это? Чувствую, надо презентацию будет переводить, чтобы разобраться в общих чертах как тут все работает.",
				"added": 1455828141
			},
			{
				"comment_id": 149,
				"body": "> [ww](#comment_1_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): Не понимаю как перевести zeroid.bit логин...\nhttp://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke\nПоследние два вопроса.",
				"added": 1455829204
			},
			{
				"comment_id": 150,
				"body": "> [gomzik](#comment_179_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Нельзя. Ты только разрешаешь или запрещаешь кому-то добавлять контент. Модерировать ты это дело не можешь\n\nА что произойдет, если владелец RU-ZeroTalk удалит папку `\\data\\users\\1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf` с моими комментариями, а затем подпишет и опубликует весь сайт?",
				"added": 1455830939
			},
			{
				"comment_id": 151,
				"body": "А вот такой еще вопрос: мои Ru-ZeroTalk-комментарии хранятся только у посетителей данного сайта или у всех пользователей Зеронета? Пропадут ли они у человека, удалившего у себя Ru-ZeroTalk целиком?",
				"added": 1455871350
			},
			{
				"comment_id": 152,
				"body": "А как мне добавить сюда комментарий без использования браузера? Могу я вручную изменить свой местный форумный `data.json`, а затем подписать его через командную строку? Как будет выглядеть такая команда?",
				"added": 1455873367
			},
			{
				"comment_id": 153,
				"body": "> [gomzik](#comment_182_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): потенциально - можешь, единственное что возможно для этого используются другие команды. Да и то не факт, что они есть в CL\n\nПрикольно, надо будет разузнать про это. Кстати автору Пандоры, могла бы такая возможность понравиться)\nНу и вообще общаться на форуме без браузера - это интересно.",
				"added": 1455874073
			},
			{
				"comment_id": 154,
				"body": "> [shift](#comment_80_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Зачем?\n\nНу может кто-то не переваривает веб-интерфейс. Или просто стороннему приложению нужно будет как-то взаимодействовать с ZeroNet.",
				"added": 1455876888
			},
			{
				"comment_id": 155,
				"body": "А у меня почему-то видео не работает на [GIF-time](http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h) в последнем chromium",
				"added": 1455899409
			},
			{
				"comment_id": 156,
				"body": "> [manrus](#comment_43_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): 49.0.2615.0 ?\n\n50.0.2652.0",
				"added": 1455904450
			},
			{
				"comment_id": 157,
				"body": "> [manrus](#comment_44_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik): Откатись на 49. Смысл сидеть на dev версии. Она забагованна\n\nМысль здравая, но не так-то это легко сделать).",
				"added": 1455911848
			},
			{
				"comment_id": 158,
				"body": "Докладываю, что [ФАК теперь переведен на 100%](http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke). Осталось обличить его в нормальную форму и/или хотя бы добавить на GitHub. На html-странице указано, где лежит фак в формате **md**. Перевод кривой (что является моим фирменным знаком), но он легко правится и редактируется. Также можно подумать над порядком вопросов: более популярные поднять наверх. Можно добавить новые вопросы, если у кого-то появятся идеи.",
				"added": 1456080975
			},
			{
				"comment_id": 159,
				"body": "Повторяется сценарий Русской Свежатины. Спираль истории, так сказать)).",
				"added": 1456217043
			},
			{
				"comment_id": 160,
				"body": "Как будет ZeroTalk+ надо будет звать народ с Хабры, чтобы они там пофлудили на месяц вперед.",
				"added": 1456220582
			},
			{
				"comment_id": 161,
				"body": "> [wrewolf](#comment_85_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): а кто там был?\n\n[Кто-то был](http://127.0.0.1:43110/13zWcviPiQWhyy8Yprou2pfvcfGcaNW3MF). Причем немало народа, походу. Но я никого из них не знаю. Чутка разминулись мы в пространстве-времени Зеронета :)",
				"added": 1456221207
			},
			{
				"comment_id": 162,
				"body": "Кстати, можно написать для непонятливых, гденить в видном месте ZeroTalk+, что это де распределенный форум, который сидируется в данный момент N пирами, и что его не заблокировать как RuTracker).",
				"added": 1456221945
			},
			{
				"comment_id": 163,
				"body": "> [wrewolf](#comment_90_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Ну для народа с хабра как раз и понадобятся прокси, там много желающих пощупать просто кликнув на ссылку.\n\nА напомни адрес твоей прокси, я её в FAQ добавлю.",
				"added": 1456222332
			},
			{
				"comment_id": 164,
				"body": "Вижу, кто-то пытается [доску объявлений](http://bit.no.com:43110/1LL9X9yHFSHqC2HBWjTkDoZRqJpR1Cd55A) замутить.",
				"added": 1456223497
			},
			{
				"comment_id": 165,
				"body": "> [zalex](#comment_13_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Просветите меня - что за ZeroTalk+?\n\nhttps://github.com/GomZik/ZeroTalk-Plus\nhttp://i.imgur.com/VeMfn0t.png",
				"added": 1456223731
			},
			{
				"comment_id": 166,
				"body": "> [gomzik](#comment_187_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Я к слову подумал, что смогу запилить что-то вроде админки и даже подниму руку на назначение модераторов\n\nА точно нам нужны модераторы? Может, просто сворачивать (не скрывать!) темы/комментарии, у которых более 10 минусов? А минуса могут ставить пользователи только с определенной юкой (кармой), как, к примеру [сделано на ЯПлакал](http://www.yaplakal.com/forum5/topic298674.html).",
				"added": 1456228922
			},
			{
				"comment_id": 167,
				"body": "ИМХО, весь лютый негатив, который у меня сейчас есть к ЯПу связан с его админами и модераторами, которые удаляют неугодные им темы, несмотря на то, что простым посетителям они нравятся. Это можно заметить по оценкам, которые вначале медленно ползут вверх, а как только тему замечает модератор, он тут же скручивает ей оценки в -20, и тема автоматически скатывается в утиль. Вопчем, никакой свободы слова! Плохо, если Зеронет скатится туда же).",
				"added": 1456229648
			},
			{
				"comment_id": 168,
				"body": "> [gomzik](#comment_190_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): хм... Ну мы же там ниже по треду говорили о том, что было бы хорошо чистить форум от спама, хотябы визуально\n\nДумаю, что если флуд (темы/комменты с сильно негативным рейтингом) будет отображаться в очень компактном свернутом виде, то он не помешает восприяютию. Можно добавить опциональную галочку, чтобы он вообще никак не отображался.",
				"added": 1456229862
			},
			{
				"comment_id": 169,
				"body": "Частоту/возможность написания комментов/тем можно тоже привязать к карме. Таким образом, чтобы флудить эффективно нужно будет иметь приличную карму. Да и админы/модераторы, наверное, от ботов также не спасут.",
				"added": 1456230503
			},
			{
				"comment_id": 170,
				"body": "> [gomzik](#comment_192_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): убедительно :) Но небольшую админку(может просто контролы на этапе создания поста) по созданию стики постов, сабтопиков я точно прикручу. Может быть даже смогу вынести настройки банов в веб гуй, но тут уже не уверен\n\nДа, это полезно будет в т.ч. для буржуйского ZeroTalk. Там постоянно на эту тему вопросы задают.",
				"added": 1456230718
			},
			{
				"comment_id": 171,
				"body": "Как может проявиться наплыв ботов с учетом существования кармы и ограничения на количество места под комментарии? Для новых пользователей можно вообще ограничение сделать на несколько килобайт.",
				"added": 1456231541
			},
			{
				"comment_id": 172,
				"body": "А вообще, против спама и ботов логичной кажется [идея @zalex](http://127.0.0.1:43110/Shiza.ZAlex.bit/?Post:4:%D0%9A%D0%B8%D0%B1%D0%B5%D1%80%D0%A3%D1%82%D0%BE%D0%BF%D0%B8%D1%8F+[%D0%BF%D0%BE%D0%BB%D0%B8%D1%82%D0%BE%D1%82%D0%B0+%D1%81%D0%B2%D0%BE%D0%B1%D0%BE%D0%B4%D0%B0]#Comments): \"...было-бы очень интересно сделать что-то наподобие Namecoin’a для ID. Но это уже на крайний случай.\" Это, получаются уже, платные, VIP-ID. Может, запилить issue на GitHub?",
				"added": 1456232228
			},
			{
				"comment_id": 173,
				"body": "> [ww](#comment_6_1JRhKktZtD2C4K6p5PtBchrxb5pCM3pBmL): Прокся\n\nДобавил.",
				"added": 1456237721
			},
			{
				"comment_id": 174,
				"body": "> [gomzik](#comment_198_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Автор пообещал социалочки ZeroBlog\nЭх, скорее бы).",
				"added": 1456327986
			},
			{
				"comment_id": 175,
				"body": "Второй коммент [в этой теме](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:26_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf) интересен. Действительно, можно добавить к кнопкам 'UpVote' и 'DownVote' еще и кнопку 'Report about spam'. Все сообщения от ZeroID, который будет помечен как спаммерский хотя бы 10+ пользователями, автоматически становятся невидимыми.",
				"added": 1456380757
			},
			{
				"comment_id": 176,
				"body": "Пришла еще одна бредовая мысль в голову. А что, если за любое сообщение  на Ru-ZeroTalk брать небольшое чисто символическое) количество криптовалюты? Это может быть отличной защитой от спама. Понятно, что это несколько сужает пользовательскую базу, но зато какие открываются возможности! В начале пользователь пополняет личный кошелек на сайте, а затем начинает общение. Система рейтингов и сворачивания заминусованных комментов при этом остается. Таким образом, самые популярные сайты ZeroNet будут иметь механизм защиты от спама и даже какое-то подобие финансирования. Позже можно будет прикрутить внутренний механизм перераспределения этой валюты для поощрения новых добротных постов/комментариев. Чтобы избежать спама,  для новичков каждое сообщение должно быть относительно дорогим, для уважаемых юзеров, с высокой кармой - дешевле.",
				"added": 1456386222
			},
			{
				"comment_id": 177,
				"body": "Ну ХЗ, мне идея с криптовалютой больше нравится как раз в силу того, что майнить её без денег уже невозможно, т.к. простой процессор или даже GPU там не подойдет. POW без валюты - это просто прожигание ресурсов в пустую, т.е. трата тех же денег без пользы для автора сайта и остальных его посетителей (не спамеров). Хотя в качестве защиты от спама на первом этапе может сработать и просто HashCash из первого комментария. Но, в итоге, я считаю , все равно это придет к криптовалюте.",
				"added": 1456388125
			},
			{
				"comment_id": 178,
				"body": "В конце концов, ценный ресурс в интернете - это своего рода услуга, почему вам кажется дикой идея за это дело платить? Со старыми фиатными деньгами это еще можно было понять, т.к. в них невозможны микроплатежи без огромных (непропорциональных) комиссий. Но сейчас, в эпоху криптоденег это перестало быть проблемой. Я, например, был бы готов платить небольшие (!) деньги за возможность написания комментов и постов на ЯПе, с условием, что они были бы неприкосновенны для модераторов. У ZeroNet есть преимущества перед обычными сайтами в псевдоанонимности (потенциально), нецензурируемости (уже?) и отсутствии рекламы, соответственно, почему бы за такие услуги не доплачивать?",
				"added": 1456388500
			},
			{
				"comment_id": 179,
				"body": "> [gomzik](#comment_203_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Как по мне, это тема не для обычного форума как минимум. Платить можно за нормальный контент, не за чатик какой-нибудь\n\n> [wrewolf](#comment_95_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Ну вот datagor.ru стал платным и я ушел от туда...\n\nПредставьте, что за каждое сообщение на этом форуме юзер с обычным рейтингом платит 0,025 цента USD, а юзер-новичок - 1 цент USD. Таким образом, плата за сообщения скорее перетекает в плату за первичную \"регистрацию/одобрение\" на форуме. Однако, если обычный пользователь начнет \"шалить\", то его коллеги опустят ему рейтинг, повышая стоимость сообщений для него.",
				"added": 1456392409
			},
			{
				"comment_id": 180,
				"body": "> [zalex](#comment_15_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Ага, чтоб отпугивать и без того маленькое количество народу.\n> [wrewolf](#comment_94_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): А я вот не готов платить, хотя и трачу деньги на куда более глупые вещи.\n\nЯ же не говорю вводить это прям щас). Должен быть общий стимул для этого. Например, если набегут толпы спаммеров сюда. Пока это все гипотетические растекания по древу. Спугнуть пользователей будет маловероятно. Представьте, что Ru-ZeroTalk вводит непосильную плату за сообщения. Что произойдет через некоторое время? Правильно, кто-то его полностью клонирует, но с более низкой ценой, или вообще бесплатный. В общем плата должна быть такой, чтобы она устраивала большинство посетителей. Если для большинства  спам не будет казаться проблемой, тогда нулевая цена вполне оправдана.",
				"added": 1456392872
			},
			{
				"comment_id": 181,
				"body": "> [01](#comment_1_17xNDBFf3d8f8zJnJVcJcuUVxxFuRJ6Tqb): И начнется черный рынок кармодрочеров для спамботов, аля \"получи 0.000001 BTC за + к сообщению %username%\"\n\n- Во-первых, если чье-то %username% будет уличено в подобных предложениях, то его сообщения будут с большей вероятностью заминусованы обычными пользователями, которые не хотят быть \"в доле\", а хотят спокойно общаться без спама.\n\n- Во-вторых, будет ли кто-нибудь заморачиваться, ставя плюсы спамеру за 0.000001 BTC = 0,04 цента USD? Не уверен.\n\n- В-третьих, если такой рынок действительно появится, можно подумать над более изящной системой. Например, в добавок к уже описанной схеме, следует премировать людей, которые плюсую и минусуют посты/комменты в соответствии с оценкой большинства (линией партии) и штрафовать, когда оценка расходится с большинством. Понятно, что это похоже на некий совковский вариант, но с другой стороны любое сообщество так устроено, и недовольные рано или поздно уходят и создают свои сообщества со своими единомышленниками. Зеронет скорее будет иметь федеративное устройство нежели унитарное, ведь таким он и задумывался изначально.",
				"added": 1456467936
			},
			{
				"comment_id": 182,
				"body": "Вообщем все мои последние мыслительные потуги были направлены на одну цель: с одной стороны привлечь в сообщество как можно больше людей посредством удобства общения и качества контента, а с другой стороны максимально ограничить централизацию власти в руках модераторов/админа. Хотя я согласен, что на данный момент, в приоритете должно быть привлечение новых пользователей и удобство их общения даже с ущербом для децентрализации.",
				"added": 1456469501
			},
			{
				"comment_id": 183,
				"body": "> [gomzik](#comment_205_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): двух человек к слову подсадил :) Первая была ekaterina@zeroid.bit со своим ZeroTodos\nА вот [этот сайтик](http://127.0.0.1:43110/1Dt7FR5aNLkqAjmosWh8cMWzJu633GYN6u) кто-то клонировал с её [ZeroQuotes](http://127.0.0.1:43110/1NJyPoPpL8At17T6G7A1qHVQdqZDBmXcLT). Список сайтов ZeroNet, который можно отсортировать по дате добавления, имени и рейтингу.",
				"added": 1456477997
			},
			{
				"comment_id": 184,
				"body": "Да, я тоже сначала подумал на русскую).",
				"added": 1456484224
			},
			{
				"comment_id": 185,
				"body": "Косяк-с. Скорее всего новые комменты не будут появляться, т.е. это временное явление.",
				"added": 1456560914
			},
			{
				"comment_id": 186,
				"body": "Походу прикол в том, что нужно не просто на главной странице отписываться, но и во всех темах, на которые успел подписаться.",
				"added": 1456564045
			},
			{
				"comment_id": 188,
				"body": "Это не попкорн-тайм [тут появился](http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp)?",
				"added": 1456733421
			},
			{
				"comment_id": 189,
				"body": "И поиск по фильмам тоже работает, насколько я понял.",
				"added": 1456734984
			},
			{
				"comment_id": 190,
				"body": "> [gomzik](#comment_209_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Искать по своему сайту не так уж и сложно\n\nЭто да), однако на ZeroTalk так и не сделали поиск. А он бы там реально пригодился с учетом количества тем и комментов.",
				"added": 1456737244
			},
			{
				"comment_id": 191,
				"body": "Ура, теперь и у меня в блоге есть [интересная русскоязычная статья](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99/?Post:3:Money+that+everybody+can+issue+is+the+best+money+%28Russian+article+by+nik443+from+dashtalk.org%29). Авторство, как всегда не мое. Но разрешение получено. Так что никакого контрафакта)",
				"added": 1456765672
			},
			{
				"comment_id": 193,
				"body": "Если тут есть владельцы мастернод DASH (а вдруг ;), то прошу [поучаствовать в голосовании](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99/?Post:4:New+blog+post) по смене алгоритма майнинга X11 в виду появления АСИКов и возникшей угрозы централизации сети.",
				"added": 1456785751
			},
			{
				"comment_id": 194,
				"body": "> [nippletwister](#comment_193_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Если тут есть владельцы мастернод DASH (а вдруг ;), то прошу поучаствовать в голосовании по смене алгоритма майнинга X11 в виду появления АСИКов и возникшей угрозы централизации сети.\n\nВот я недалекий. Ссылку на запись в блоге поставил, а вот опубликовать саму запись забыл. Интересно, что видели пользователи, если пытались по этой ссылке зайти? Сейчас-то уже все должно работь.",
				"added": 1456839306
			},
			{
				"comment_id": 197,
				"body": "Запостили, на торрентфрике статью про здешний сайт Play, мол это - прорыв (что в общем-то правда).\n\nВот этот пост меня веселит: https://habrahabr.ru/post/278325/\nНеужели ребята на Хабре настолько умные и исключительные, что не могут понять почему это у них трафик падает аж с 2012-2013 года? ППЦ, более закрытого для общества сайта я еще не встречал. Посты только по приглашениям, комменты только по карме. Короче бред полнейший, сообщество их вначале росло, а потом неизбежно выродилось. Стал таким илитным клубом, до которого всем вообще нет дела. Если не исправятся то так и сгинут в туман. Любое сообщество с высоким барьером для вступления новых членов рано или поздно вырождается. Се ля ви. А когда-то хороший был ресурс.",
				"added": 1456926779
			},
			{
				"comment_id": 198,
				"body": "@dude \nИнтересное дело, когда писал коммент, то не видел твоего комментария, который перед моим сейчас отображается, а именно:\n> Здаров, народ. А есть способ развернуть комментарии - старые сначала, новые снизу? По человечески чтобы\n\nУ тебя точно правильное время выставлено на компьютере?",
				"added": 1456938902
			},
			{
				"comment_id": 199,
				"body": "> [shift](#comment_83_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): имхо там проблема не в закрытости\n\nА в чем тогда?",
				"added": 1457023101
			},
			{
				"comment_id": 201,
				"body": "> [zeroatom](#comment_1_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Всем привет :) в общем много вопросов и страшно в открытом инете задавать их...\n\nТы можешь их задать лично, через ZeroMail. Там переписька шифруется. Правда пока нет уведомлений о пришедшей почте, поэтому адресат может не сразу ответить. Все зависит от того, как часто он в свой почтовый ящик заглядывает.",
				"added": 1457193877
			},
			{
				"comment_id": 202,
				"body": "Ну по IP тебя вычислят, но вот сайт твой прикрыть сложно, если его куча народа сидирует. Плюс, когда здесь контроль версий запилят, то в теории, даже если сам автор, после деанона будет заставлен свой сайт удалить, то будет возможность легкого его отзеркаливания из репозитория. А вообще критиковать всегда легко, попробуй сам что-нибудь толковое сделать для начала.  Я считаю, что такую тему за один год запилить - это большое достижение.",
				"added": 1457206554
			},
			{
				"comment_id": 203,
				"body": "> [82456783](#comment_18_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): чото ржуа тебе не похуй будет как поживает твой сайт если тебя на зоне пидарасить будут?\n\nНу дак я и не собираюсь тут ниче нелегального выкладывать. Сеть не про то. Не про анонимность, а про распределенность и нецензурируемость. Анонимности вообще нет, если ты это не понял, то я тебе тебе сочувствую. Уже по паре твоих постов на этом форуме нормальная система будет в состоянии вычислить тебя по стилистике с большой долей вероятности. Еще пару сотен сообщений и вуаля, у тебя дома уже гости.",
				"added": 1457207020
			},
			{
				"comment_id": 204,
				"body": "Ну все правильно. Зеронет размазывает ответственность. Если один написал некое некорректное сообщение, то нелья выпилить его сообщение, не отключив и не пересажав всех пользователей, у кого оно хранится. А если сообщение оказалось достаточно популярным, то придется попотеть.",
				"added": 1457207507
			},
			{
				"comment_id": 205,
				"body": "> [82456783](#comment_21_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): и да, вот ещё цитата, ты похоже совсем юн и не в курсе как работает мир\n> Существует также самоцензура — сознательное самоограничение автора в обнародовании информации на основе неких собственных соображений (например морально-нравственных ограничений, внутреннего конформизма), либо из боязни наказания за нарушение цензурных правил[12][13][14]. Самоцензура из соображений конформизма или страха является одним из характерных проявлений деформации гражданского общества[15].\n\nНу никто тебя не лишает права пытаться анонимизировать себя, находясь в Зеронете. Хочешь - шифруйся. Я к тому, что по дефолту сеть не обеспечивает анонимность, что прямо и открыто везде написано. Не понимаю, с чего от тебя такой эмоциональный накал идет. Не нравится - сделай лучше. Поливать говном, извини, много ума не надо.",
				"added": 1457207892
			},
			{
				"comment_id": 206,
				"body": "> [82456783](#comment_20_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): и опять ты про одно и то же\n> \n> а ты готов сесть за какую-нибудь хуйню? ЗАТО ТВОЙ ПОСТ ОСТАНЕТСЯ ЖЕ!готов?\n\nЯ не готов, как раз по этому, применяю к себе самоцензуру.",
				"added": 1457207938
			},
			{
				"comment_id": 207,
				"body": "> [82456783](#comment_23_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): ты на вопрос так и не ответил\n> \n> иначе признай что это цензурируемая сеть\n\nНу наверное нужно дождаться первых дел. После этого уже будем говорить. Пока лично меня никто не цензурировал кроме меня же самого.",
				"added": 1457208056
			},
			{
				"comment_id": 208,
				"body": "> [82456783](#comment_24_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): умницаты понял какое говно этот ваш зеронет\n\nПредложи что-нибудь лучше. I2P - не надо, там ни один сайт не работает больше 3 часов подряд. FreeNet уже лет десять находится в версии 0.7.5",
				"added": 1457208114
			},
			{
				"comment_id": 209,
				"body": "Связанных конкретно с Зеронетом.",
				"added": 1457208217
			},
			{
				"comment_id": 210,
				"body": "@824456783\nНазови лучшее средство для анонимности.",
				"added": 1457208341
			},
			{
				"comment_id": 211,
				"body": "> [82456783](#comment_27_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): сначала с прошлой темой разберёмся. нефиг переводить темы\n> \n> эта сеть ТОЛЬКО про распределённость.так?\n\nППц, и после этого меня называют школьником. Ок, анонимность в Зеронете неидеальна (хотя ТОР она уже поддерживает), следовательно есть угрозы и для нецензурируемости. Обещают поддержку I2P в скором времени.",
				"added": 1457208551
			},
			{
				"comment_id": 212,
				"body": "> [82456783](#comment_28_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): любая информация распространяется и хранится столько сколько нужно и без п2пбыдлу просто похуй\nА Зеронет тут причем?",
				"added": 1457208884
			},
			{
				"comment_id": 213,
				"body": "> [82456783](#comment_29_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): вопрос дискуссии стоит так:нахуй нужен зеронет?мы пришли к выводу:каждый пользователь берёт ответственность за информацию, которую он смотрит, так как он раздаёт еёзеронет не обеспечивает анонимность, без неё никто не будет подставлять себя сидируя опасный контент, в том числе и создатель сайта\n> вывод:всё что нужно есть в обычном интернетеа зеронет со своим п2п нахуй не нужен, его п2п фича не реализуется никак\n\nОк, обосрать обосрали, предлагать будем?",
				"added": 1457209159
			},
			{
				"comment_id": 214,
				"body": "> [82456783](#comment_30_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): \"критикуя - предлагай\" - бред просто по определениюпочему для того чтобы вскрыть и показать вам недостатки зеронета - я должен создать что-то своё?как это связано вообще? никак. не вздумайте отвечать на этот вопрос.\n\nНу тоесть, можно подвести черту под этим прелестным диалогом так: Зеронет обеспечивает p2p-хранение сайтов, усложняя их принудительное закрытие по требованию разных структур, но не обеспечивает (пока?) полной анонимости своих пользователей, что, общем-то не делает ни одна другая сеть.",
				"added": 1457209484
			},
			{
				"comment_id": 215,
				"body": "Теоретически инфа, которая незаконна в одной юрисдикции может хоститься в другой стране. Ну и как закрывать ее будешь? Можно, конечно, но сложнее. А автор сайта мне лично нафик не сдался, если сайт его работает и приносит мне пользу.",
				"added": 1457209876
			},
			{
				"comment_id": 216,
				"body": "> [82456783](#comment_34_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): да господи, и ты за nippletwister повторяешьНЕ НУЖНО НИЧЕГО БЛОКИРОВАТЬлюди сами свалят из зеронета после показательной порки пары ХАКИРОВникто не будет рисковать жопой ради раздачи какого-то контента\nНу ты можешь просматривать сайти и автоматом удалять их, если печешься так.",
				"added": 1457209982
			},
			{
				"comment_id": 217,
				"body": "А вообще с таким подходом, можно долго спорить. Назови мне любую анонимную, на твой взгляд, сеть, а я тебе в ответ скажу, что ее запретят и будут сажать каждого, кто ею воспользуется или просто скачает ее себе на комп. И дальше что?",
				"added": 1457210047
			},
			{
				"comment_id": 218,
				"body": "> [nippletwister](#comment_216_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Ну ты можешь просматривать сайти и автоматом удалять их, если печешься так.",
				"added": 1457210281
			},
			{
				"comment_id": 219,
				"body": "Имхо, наиболее подрывная технология щас - это криптовалюты, они наделяют техно-гиков деньгами, а постепенно и реальной властью. А без реальной власти ничего нельзя исправить, в независимость от того есть ли свобода слова, или ее нету.",
				"added": 1457210523
			},
			{
				"comment_id": 220,
				"body": "> [82456783](#comment_39_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): то есть ты зашёл на сайт - и тебе загружается 500гб содержимого?тебе норм такое развитие событий?\n\nдедупликацию контента в будущем запилят. Нет смысла у каждого хранить сайт целиком. 3-10 копий на всю сеть уже с избытком.",
				"added": 1457210757
			},
			{
				"comment_id": 221,
				"body": "> [zeroatom](#comment_25_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): в уме крутится ответ в стиле: Отвлекают внимание разработчиков от по настоящему эффективных и сверхполезных, сверхпотенциальных проектов на подобие mesh сети.Где появится инет беспроводной,высокоскоростной,бесплатный,анонимный и всё в такой ключе :)\n\nЗеронет сможет работать поверх такой сети. В чем проблема? Создавайте.",
				"added": 1457211156
			},
			{
				"comment_id": 222,
				"body": "Вот кстати еще одно из возможных применений ЗероНета (после появления фишки private sites) - социальные сети, где твоя личная инфа принадлежит только тебе. Меня бесит что мой фконтактик находится на серверах, которые мне не принадлежат в незашифрованном для их владельцев виде.",
				"added": 1457211270
			},
			{
				"comment_id": 223,
				"body": "> [82456783](#comment_43_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): p2p?на ноль делишь\n\nОно ж зашифровано.",
				"added": 1457211386
			},
			{
				"comment_id": 224,
				"body": "Имхо. Mesh-сеть слижком сложна сейчас для реализации. Не думаю, что её запилят до того, как значительно разовьются такие направления как OpenHardware, 3Д принтеры и криптовалюты.",
				"added": 1457211644
			},
			{
				"comment_id": 225,
				"body": "> [82456783](#comment_44_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): што? а как пользователи увидят это если оно зашифровано?\n\nУвидят, читайте документацию по Зеронету. Где-то это было описано. Сейчас фишка еще не реализована - только в ZeroMail. Чужую почту прочитать уже не выйдет.",
				"added": 1457211704
			},
			{
				"comment_id": 226,
				"body": "> [zeroatom](#comment_28_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Может просто мало человек видят в этом огромный потенциал и не охотно объясняют всем остальным. Вот как мне например: в картинках, с толком с расстановкой, с логикой...каждый поймет уже пол дела :)\n\nПомимо схем нужно физическое железо, т.е. капиталовложения, т.е. бапки. Зеронет и похожие технологии стоят значительно дешевле. Я тоже думаю, что за меш сетями будущее, но ИМХО, до них еще далеко.",
				"added": 1457211873
			},
			{
				"comment_id": 227,
				"body": "Кстати, видел тут кто [мой блог про DASH](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99)? А то смотрю, тут вроде народ новый собрался.\n> [zeroatom](#comment_29_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Ру сообщества нету, ресурса для дискуссий нету. Совпадение? :)\nА это что?\nhttp://cjdroute.net/forum/index.php",
				"added": 1457212357
			},
			{
				"comment_id": 229,
				"body": "> [82456783](#comment_46_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): открыл рандомную статью\n> \n> закрыл страницу\n\nНе будет значит флуда у меня в блоге.",
				"added": 1457212923
			},
			{
				"comment_id": 230,
				"body": "> [zeroatom](#comment_30_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): И какой итог: Не ясный потенциал ZeroNet и ясный как день - минус в анонимности. Сеть развивается, но какое будущее у неё?\n\nСветлое, узбагойтесь уже)\nИначе я бы сюда не пришел. Также с биткоином было, иначе бы я не стал покупать его по 7$ в свое время.",
				"added": 1457213071
			},
			{
				"comment_id": 231,
				"body": "И кстати, на заметку, любую новую технологию вначале мешают с говном. Это даже, наоборот, должно радовать. Значит разрабы идут верной дорогой.",
				"added": 1457213423
			},
			{
				"comment_id": 232,
				"body": "> [zeroatom](#comment_32_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Но всё таки , есть ли хоть малейшие основания полагать что это \"многоходовочка\" для реализации куда более глубокого смысла (задумки) сети? :) Или всё таки не пытаться влезать в головы разработчиков,ну или кто там планированием (форсайтом) занимается :)\n\nПланы у разработчиков - p2p соц сети, p2p Github, p2p рынок, деление файлов, приватные сайты, поддержка I2p \nhttps://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000#slide=id.g9a3b93883_1_32",
				"added": 1457213834
			},
			{
				"comment_id": 233,
				"body": "> [82456783](#comment_49_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): статистику плиссколько технологий, смешанных с говном, сдохли, а сколько выросли?без этой статистики такие слова - пустой трёп\n\nТы мне сначала ответь на вопрос, какая сеть обеспечивает полную анонимность. Мы ж договорились стрелки не переводить.",
				"added": 1457213956
			},
			{
				"comment_id": 234,
				"body": "> [82456783](#comment_51_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): сорян поцоныкурить тут у вас нечего, играть в интернет 2.1 желания нет, зочем нужен зиронет и чем он лучше инторента - непонятнов презентации пишут про скорость, юзабилитину хуй знает, у меня 99% сайтов открываются отлично, кино качается, игры играются\n> а серьёзный сайт вы всё равно не построите на зеронетепосетите вашу имиджборду - скорость загрузки как у говна, хотя пиров вагонытакие дела\n\nНу мы так и поняли, что ты пообсирать пришел). Людей, которые с конструктивом, их сразу видно.",
				"added": 1457214158
			},
			{
				"comment_id": 235,
				"body": "> [82456783](#comment_11_1CS6dkzPWZumKPWuQj4U4pT7KDHufDETHW): в факе ссылка на создание сайта протухладоставьте плис\n\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit\n\nТут вот есть.",
				"added": 1457214639
			},
			{
				"comment_id": 236,
				"body": "> [zeroatom](#comment_33_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): без английского и поверхностных знаний о технологии даже пытаться не стану, потому что ясно понимаю: Нет анонимности.А всё остальное в инете есть.Даже технология раздачи сайта? :)\n\nТак а в чем проблема, что трафик через ТОР гоняется, чем вам мало такой анонимности? Запускайте Зеронет еще через ТорБраузер, если хотите. Правда там надо будет разрешить JavaScriptы, иначе работать не будет.",
				"added": 1457214688
			},
			{
				"comment_id": 237,
				"body": "Кстати Зеронет через VPN тоже работает.",
				"added": 1457214909
			},
			{
				"comment_id": 238,
				"body": "А хопы - это что такое, прыжки от узла к узлу?",
				"added": 1457216738
			},
			{
				"comment_id": 239,
				"body": "> [shift](#comment_131_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): PS Решил что в меню справ будем коллекционировать полезные ресурсы по возможности отечественного производства, кто что думает?\n\nЯ думаю, что меню - слева). А так да, прикольненько.",
				"added": 1457217178
			},
			{
				"comment_id": 240,
				"body": "Ссылку на [ZeroFaq на русском](http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke) тож можно добавить.",
				"added": 1457217397
			},
			{
				"comment_id": 241,
				"body": "> [zeroatom](#comment_38_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Удобно, но вот зашел в сеть и сразу хочется почитать или понять зачем я тут.Какие возможности открываются не понятно :)как с нуля сделать блог? нужно ли изучать английский и привыкать к нему как к родному? :)\n\nСоздать с нуля блог - элементарно. Находишь на ЗероХелло любой блог, жмешь на кнопку с тремя точечками. Выбираешь пункт \"Clone\" - все.",
				"added": 1457217790
			},
			{
				"comment_id": 242,
				"body": "> [shift](#comment_133_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7):  \n> Чей сайт?\n\nМой)",
				"added": 1457217822
			},
			{
				"comment_id": 243,
				"body": "> [shift](#comment_134_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Договорились, обновлять будешь?\n\nНе факт, что оперативно, т.к. я с сайтостроением вообще не знаком, но там написано, что внутри директории с сайтом есть ФАК в формате md, т.е. его можно хоть в гитхаб залить при желании.",
				"added": 1457217949
			},
			{
				"comment_id": 244,
				"body": "> [shift](#comment_135_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Добавил\n\nХорошо, если буду недоступен, имеете полное право сайт скопировать/изменить/доработать/выложить под другим адресом и в общем все что угодно с ним сделать.",
				"added": 1457218263
			},
			{
				"comment_id": 245,
				"body": "> [zeroatom](#comment_39_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): а вы все через тор запускаете? А то не получается как в faq написанно делаю...не виходит на винде...что не так делаю? :)\n\nНа винде он уже автоматом через Тор работает, ниче делать не надо.",
				"added": 1457218828
			},
			{
				"comment_id": 246,
				"body": "> [zeroatom](#comment_40_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): открывает через хром в торе пишет \"Попытка соединения не удалась\"...\n\nЦитата из моего перевода FAQ:\nКак просматривать зеросайты через Tor браузер?\n\nДля этого наберите в Tor браузере строку “about:preferences#advanced”, нажамите на кнопку “Settings” (“Настройки”), затем выберите пункт “Manual proxy configuration” и добавьте адрес “127.0.0.1” в поле “No Proxy for”.",
				"added": 1457219021
			},
			{
				"comment_id": 247,
				"body": "Остается только моя ненавистная всеми тема - платные сообщения и рейтинги)",
				"added": 1457219165
			},
			{
				"comment_id": 248,
				"body": "Ну тут говорят, что это отпугнет пользователей у ресурса. Я считаю, что не отпугнет. Т.к. для всех новорегов цена будет приличной, а для людей с рейтингом - дешево. Репутацией никто рисковать не будет ради рекламы, иначе схватит минусов и самому станет дорого писать потом. Реализовать, правда, это может быть сложно.",
				"added": 1457219446
			},
			{
				"comment_id": 249,
				"body": "> [shift](#comment_139_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Если только proof of burn но это имхо не надо\n> Я по другому хочу - разобратся как работает ZeroID и сделать возможность вязать ZeroID к соц-сетям, это позволит повысить авторитетность (да да знаю сейчас меня анонимусы закидают) но тем не менее это позволит индекс доверия учетки повышать автоматически предоставляя больше места или другие плюшки\n\nК каким соц сетям, местным или из обычного интернета? Если из обычного, тогда я пас). Перейду на 0chan)).",
				"added": 1457219895
			},
			{
				"comment_id": 250,
				"body": "А никто не вникал, этот сайт работает или это просто картинка?\nhttp://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe\nУ меня показывает пустоту, но может это из-за включенного TOR?",
				"added": 1457220092
			},
			{
				"comment_id": 251,
				"body": "Прикольно, у меня из обычного FireFox (не ТОР) пустота, но может это от того, что я там WebRTC отключал когда-то.",
				"added": 1457220298
			},
			{
				"comment_id": 254,
				"body": "> [shift](#comment_145_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): пункт Какие есть гейтвеи (gateways) / прокси в ZeroNet? в FAQ\n\nесть.",
				"added": 1457220977
			},
			{
				"comment_id": 255,
				"body": "> [shift](#comment_146_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Я знаю что есть =) это я его туда отправил. Ты бы их сделал анкорами что бы можно было ссылки дават, вообще шик был бы\n\nЯ не знаю как)",
				"added": 1457221051
			},
			{
				"comment_id": 256,
				"body": "Гейтвеи нужны для доступа к  Зеронет-сайтам из обычного интернета. А по совместительству это обычные узлы Зеронета, на которые может зайти каждый. Т.е. после создания своего сайта, автор может зайти на несколько гейтвеев и загрузить свой сайт на них - т.е. просто посетить свой сайт из под этих гейтвеев. Все! После этого сайт уже хостится на нескольких компах, и поэтому можно спать спокойно.",
				"added": 1457221295
			},
			{
				"comment_id": 257,
				"body": "Надо еще ZeroBoard переплюнуть))",
				"added": 1457221638
			},
			{
				"comment_id": 258,
				"body": "Да, там просто народу больше всех флудит, вот даже прямо щас.",
				"added": 1457221776
			},
			{
				"comment_id": 259,
				"body": "А что не так там?",
				"added": 1457222039
			},
			{
				"comment_id": 260,
				"body": "> [shift](#comment_151_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Да я первый раз увидел этот сайт (Чат?) он давно? от куда он? и народу там много\n\nНе знаю, вот еще один:  http://127.0.0.1:43110/1CjR14fofbRJ54oj8A7rAfWpzpLawdP5uc",
				"added": 1457222491
			},
			{
				"comment_id": 261,
				"body": "Вот еще блог свеженький: http://127.0.0.1:43110/1NfVz57ebbUae6DiksXR88ZgwY9VY1jQiH",
				"added": 1457222609
			},
			{
				"comment_id": 263,
				"body": "Кстати, в последнее время зачастила у меня ошибка: Connection with UiServer Websocket was lost. Reconnecting...\nМинутку нужно ждать, затем сайт сам загружается нормально.",
				"added": 1457223353
			},
			{
				"comment_id": 264,
				"body": "@shift, а куда ты дел ссылки, которые слева были? Вроде прикольно смотрелось.",
				"added": 1457264084
			},
			{
				"comment_id": 265,
				"body": "> [mew](#comment_1_1H22VTT4T8bWNfuoScxocWnfHL4eiYCF5Q): Спасибо за русский FAQ, полезно.\n\nРад, что кому-то пригодилась моя писанина.",
				"added": 1457264172
			},
			{
				"comment_id": 267,
				"body": "УШЕЛ СЧИТАТЬ ПРОТЕИНЫ, ВЕРНУСЬ НЕСКОРО",
				"added": 1457283831
			},
			{
				"comment_id": 268,
				"body": "Финансирование проекта буксует, имхо. Я несколько раз предлагал разрабам запилить какую-нить монету для финансирования проекта, но они отказываются, говорят, мол, хочешь помочь - делай донат.",
				"added": 1457291404
			},
			{
				"comment_id": 269,
				"body": "> [splitfire](#comment_71_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): ну по сути они правы, у них и так работы много, а еще пилить велосипед для своей валюты\n\nЭто не должно быть мегасложно. Единственная причина, которая приходит мне на ум, это то, что разрабы делают Зеронет из любви к искусству, и деньги на разработку на самом деле у них есть. Т.е. донаты для них - так, чтоб было.",
				"added": 1457291739
			},
			{
				"comment_id": 270,
				"body": "Вот, а я предлагал платные сообщения сделать. Прикиньте, сколько бы щас уже денех наварили на сообщениях authhh?))) При этом, если бы можно было их минусить, сообщения были бы все скрыты.",
				"added": 1457293890
			},
			{
				"comment_id": 271,
				"body": "Уж если на то пошло, \"Хозяева денег\" по прикольней фильмец будет.",
				"added": 1457294061
			},
			{
				"comment_id": 272,
				"body": "Ну ОК, зачем писать-то это 10й раз и большими буквами?!\nЯ понял, что в этой жизни главное не попасть под сокращение населения.\nКстати, стал бы ты продолжать это писать, если бы с тебя за каждое сообщение по 10 рублей брали?",
				"added": 1457294525
			},
			{
				"comment_id": 273,
				"body": "> [authhh](#comment_25_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): НАС НА ДВАЧЕ И ВК, ЗАБЛОКИРОВАЛИ, БЛОКНУЛИ УДАЛИЛИ1 МОНПОЛЬНЫЕ ФЕОДАЛЬНЫЕ ПИДОРЫ!\n\nНу ответь на вопрос прямо. Сколько тебе за одно сообщение недорого будет? Мы тут бизнес-идею выращиваем. С одной стороны нужно тебя не спугнуть (как источник прибыли), а с другой стороны не продешевить, иначе наша тема не окупится.\n\nUPD: Кстати, можно же плавающий курс установить! Эврика!",
				"added": 1457294711
			},
			{
				"comment_id": 274,
				"body": "> [mangust](#comment_12_1NxrvhVZwz4YsrYp3ZSCs4aDvw2gFud47M): С деньгами - имхо утопия. Не знаю ни одного сайта в обычном интернете, где платят за сообщения.Хотя не, на tjournal вроде нельзя писать и читать комменты без платного доступа, но в любом случае - надо сначала иметь очень популярный сайт, чтобы потом что-то вводить. Да и вообще, по моему это противоречит самой идее свободного интернета.\n\nА все дело в том, что Зеронет - это не обычный интернет ;)\nТо, что не работает там может легко взлететь здесь, и наоборот (например, сайты вообще без модератов).\nИдее свободного интернета это не противоречит. Наряду с платными сайтами могут быть и бесплатные, правда, с кучей спама.",
				"added": 1457295804
			},
			{
				"comment_id": 275,
				"body": "> [authhh](#comment_27_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): ТЫ ХОТЬ ЗНАЕШЬ КТО МЫ?\n\nВЫЧЕСЛИТЕЛИ ПРОТЕИНОВ?)",
				"added": 1457296218
			},
			{
				"comment_id": 276,
				"body": "Поздравляю, господа, более 1000 сообщений у нас.",
				"added": 1457296944
			},
			{
				"comment_id": 279,
				"body": "> [gomzik](#comment_253_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ого, екатерина новый проект выпустила... Когда она успевает?\n> http://127.0.0.1:43110/1Kp5xdjQyrPth5mEJsn6NDBKZxcaeYz86N/?Post:10#Comments\n\nОфигенская штука) Создал там опрос.",
				"added": 1457384140
			},
			{
				"comment_id": 280,
				"body": "Тут вот пилят чаты: http://127.0.0.1:43110/ZeroChatRooms.bit",
				"added": 1457387686
			},
			{
				"comment_id": 281,
				"body": "Вышла новая версия, ребята - 957",
				"added": 1457507502
			},
			{
				"comment_id": 282,
				"body": "> [netchaser](#comment_1_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): Привет всем... зеронет конечно оригинальный, но я так и не понимаю зачем он нужен простому смертному пользователю? Вся эта поделка очень напоминает FIDONet только на веб-технологиях.\n\nВо имя децентрализации.",
				"added": 1457507532
			},
			{
				"comment_id": 283,
				"body": "Все комменты **requrequ** исчезли? А как это реализовано? Просто лимит ему выставили нулевой, или просто сообщения скрываются от его имени?",
				"added": 1457508184
			},
			{
				"comment_id": 284,
				"body": "Кстати, можете поучавствовать в опросе: http://127.0.0.1:43110/ZeroPolls.bit/?Poll:1-1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf",
				"added": 1457508595
			},
			{
				"comment_id": 285,
				"body": "> [netchaser](#comment_3_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): на форуме нужна уведомлялка что кто то написал ответ )\n\nЕсть кнопка 'Follow in Newsfeed' слева от 'ПРИКРЕПЛЕНО'",
				"added": 1457509134
			},
			{
				"comment_id": 286,
				"body": "Ого, про Зеронет на Битновостях написали. Это уже почти известность): http://bitnovosti.com/2016/03/09/p2p-distributed-torrent-site/",
				"added": 1457538918
			},
			{
				"comment_id": 288,
				"body": "Я тоже фринет пользовал. Хорошая была штука лет 5 назад. Просто с тех пор, проект почти не развивается. Первая соц. сеть распределенная там была, называлась **Sone** и работала как плагин.",
				"added": 1457540156
			},
			{
				"comment_id": 289,
				"body": "Кто-то решил денег срубить и занял кучу доменов на ZeroName, начинающихся со слова Zero))",
				"added": 1457544808
			},
			{
				"comment_id": 290,
				"body": "На битновостях еще один проект указали: http://base.network/\nВроде бы нечто похожее на Зеронет, только это сделано одним человеком на коленке и чисто в качестве прототипа для демонстрации возможностей.",
				"added": 1457549000
			},
			{
				"comment_id": 291,
				"body": "[Екатерина говорит](http://127.0.0.1:43110/1Kp5xdjQyrPth5mEJsn6NDBKZxcaeYz86N/?Post:15#Comments), что кто-то сейчас пилит [аналог ZeroID](http://127.0.0.1:43110/16KzwuSAjFnivNimSHuRdPrYd1pNPhuHqN).",
				"added": 1457550177
			},
			{
				"comment_id": 292,
				"body": "Кстати, спам от requrequ, все еще виден на ZeroHello при включенной кнопке 'Follow in Newsfeed'. А внутри самого форума сообщения не видны. Этот товарищ решил спамить всюду, даже Екатерининому блогу досталось.",
				"added": 1457558324
			},
			{
				"comment_id": 293,
				"body": "> [kostanew](#comment_30_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Как в блоге сделать плашку \"Читать далее\" и есть ли вообще что-нибудь про оформление текстов?\n\nтри дефиса подряд (---) и пустая строка перед ними",
				"added": 1457565682
			},
			{
				"comment_id": 298,
				"body": "Ну вот и [ZeroWiki](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:home) подоспела)",
				"added": 1457957130
			},
			{
				"comment_id": 299,
				"body": "Предлагаю обновить ссылку наш русский FAQ:\nhttp://127.0.0.1:43110/13HMY3PTAF7zABaS7wR1Qr4evfMFqqPspf/?Page:home\n\nТеперь можно работать сообща. Так как мне уж очень лень одному). Ну или если кто всерьез хочет менять сам движок wiki под FAQ, то может просто склонировать себе свой FAQ, потом все равно ссылку будут давать на лучший вариант. Просто я точно ничего внутри логики сайта менять не буду, т.к. не представляю вообще как это делается.",
				"added": 1457962366
			},
			{
				"comment_id": 300,
				"body": "А как там добавить внутрь русский фак, чтобы ее не захламлять? Я не догадался.\nUPD: Хм.., хотя наверное, можно.",
				"added": 1457962895
			},
			{
				"comment_id": 301,
				"body": "> [shift](#comment_249_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Про захломление это я о ZeroTalk, а новую страницу делать там просто\n\nНу кстати да, хорошая идея.",
				"added": 1457963202
			},
			{
				"comment_id": 302,
				"body": "> [shift](#comment_251_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Перенесешь часть? я присоединюсь чуть позже =)\n> Только не на каждый вопрос по отдельной странице ...\n\nЕсли все вместе запихивать, то длинная портянка слишком выйдет.",
				"added": 1457963502
			},
			{
				"comment_id": 303,
				"body": "Там в моем клоне, интересная штука кстати. Есть некоторые вопросы с буквами латинского алфавита в начале. Так вот, если их убрать из названия вопроса, то ссылка на него почему-то не создается. Я не могу понять почему.",
				"added": 1457963577
			},
			{
				"comment_id": 304,
				"body": "> [shift](#comment_252_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): В старом FAQ именно так, никто не мешает сделать анкоры внутри которые будут к нужному ответу вести\n\n[Тогда готово)](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:faqru)\nСсылку на FAQ можно заменять. 122 килобайта уже израсходовал.",
				"added": 1457963893
			},
			{
				"comment_id": 306,
				"body": "@vlad20012, ты там поменял что-то в FAQ. А что? Давайте тут писать, а то я пытался разглядеть отличия, но не смог)",
				"added": 1457985876
			},
			{
				"comment_id": 307,
				"body": "> [vlad20012](#comment_182_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Java Scrypt на JavaScript заменил\n\nХорошо, а я только что список гейтвеев обновил.",
				"added": 1457986194
			},
			{
				"comment_id": 309,
				"body": "> [vlad20012](#comment_183_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Дебильная вики. Патчами бы изменения делали. Наверняка есть либа для JS. А так каждый целиком статью копирует при любой правке. Ладно, хотяб изменения чтоб показывались патчами. Нихрена же непонятно, кто что меняет\n\nНе все сразу, мож обновят попозже. А кто знает где смотреть what's new для каждой ревизии? На гитхабе только релизы вижу, а их всего два, тогда как ревизии выходят чуть ли не каждый день. Сейчас уже аж 1015-я.",
				"added": 1457987797
			},
			{
				"comment_id": 314,
				"body": "Бугага",
				"added": 1459759511
			},
			{
				"comment_id": 318,
				"body": "Соц сети тут нужны и приватные сайты",
				"added": 1460477840
			},
			{
				"comment_id": 319,
				"body": "Nofish писал, что это у него в приоритетах стоит. Сначала соц сети, затем приватные сайты вроде.",
				"added": 1460661818
			},
			{
				"comment_id": 320,
				"body": "Ну да, по Ru-ZeroTalk вроде тоже не ищет.",
				"added": 1460987258
			},
			{
				"comment_id": 321,
				"body": "А видели, что начали [ZeroBazaar](http://themerkle.com/zerobazaar-combines-zeronet-with-openbazaar/) разрабатывать?\nГде кстати, китайский большой форум увидеть можно?",
				"added": 1461178566
			},
			{
				"comment_id": 322,
				"body": "Чето не работает этот ютуб у меня.",
				"added": 1462386384
			},
			{
				"comment_id": 332,
				"body": "Что я заметил в ZeroNet, это то, что со временем все больше времени нужно на загрузку текущего состояния сети. Просто бываю я тут набегами, и между этими набегами я обычно удаляю все скачанное из ZeroNet.",
				"added": 1503816529
			},
			{
				"comment_id": 333,
				"body": "И кстати, отчего-то почта вся потерлась на ZeroMail.",
				"added": 1503816632
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 7,
				"body": "Биржа криптовалют (можно пока без ввода/вывода в фиат).",
				"added": 1455284267
			},
			{
				"comment_id": 8,
				"body": "Аналог Reddit, т.к. в оригинале банят целые сообщества (https://www.reddit.com/r/nzb). Не знаю, правда, что это за сообщество было))\n\nТакже ЯПлакал или Пикабу.",
				"added": 1455284671
			},
			{
				"comment_id": 9,
				"body": "Facebook/Vk аналог.",
				"added": 1455284767
			},
			{
				"comment_id": 10,
				"body": "Поисковой движок.",
				"added": 1455284797
			},
			{
				"comment_id": 11,
				"body": "GitHub аналог.",
				"added": 1455284889
			},
			{
				"comment_id": 12,
				"body": "OpenBazaar или его аналог (децентрализованный Авито).",
				"added": 1455284923
			},
			{
				"comment_id": 31,
				"body": "LocalBitcoins.com аналог",
				"added": 1455478410
			}
		],
		"1_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 13,
				"body": "Нет, не сам)). У меня руки не оттуда. Его пилят уже лет 10 наверное, если не больше.",
				"added": 1455285627
			},
			{
				"comment_id": 14,
				"body": "> [shift](#comment_22_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): по второй ссылке js error\nЭто потому что я данный сайт банально скопипастил. Вообще ошибки должны исчезнуть, если запускать его напрямую с жесткого диска, т.е. не через Зеронет (iFrame).",
				"added": 1455285908
			}
		],
		"3_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 16,
				"body": "> [gomzik](#comment_16_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Во завернул как. Сам придумал или откопал где? Если откопал, то давай ссылки\n\nhttp://proofofindividuality.weebly.com/\nhttps://github.com/d11e9/poi",
				"added": 1455295342
			},
			{
				"comment_id": 17,
				"body": "> [shift](#comment_28_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А смысл? ботов можно наплодить и умных, а если как метод борьбы со спамом - не поможет есть же отряды ольгино, или 50 cent army\n\nЭто метод для создания голосований по типу один человек - один голос.",
				"added": 1455295437
			},
			{
				"comment_id": 29,
				"body": "В оригинальной идее предлагалось не в игры играть, а проводить живые встречи или видеоконференции. На видеоконференции человека отличить от робота пока что не составляет труда. Также по видеоконференции легко увидеть не общается ли данный конкретный человек одновременно и в другой видеоконференции.",
				"added": 1455455030
			},
			{
				"comment_id": 30,
				"body": "Вполне возможно. Но никто же никого не заставляет. Все добровольно. Для начала пойдут и обычные голосувалки. Это потом уже, если кому-то непременно нужны будут сложнонакручиваемые голосования. Это не агитация, а просто идея.",
				"added": 1455455824
			},
			{
				"comment_id": 317,
				"body": "Нашел whitepaper кстати по теме:\nhttp://www.brynosaurus.com/log/2007/0327-PseudonymParties.pdf",
				"added": 1460397125
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 27,
				"body": "Да там контакты есть и в гитхабе вроде. А на хабре, я позвать никого не могу, и вообще ничего не могу))\nЛадно хоть до самих Хабровцев начинает по-тихоньку доходить мысль почему у них популярность падает:\nhttps://habrahabr.ru/hub/habrahabr_api/",
				"added": 1455437767
			},
			{
				"comment_id": 28,
				"body": "Пригласил: https://github.com/Novator/Pandora/issues/18",
				"added": 1455442728
			},
			{
				"comment_id": 132,
				"body": "> [robux](#comment_1_195q5MTNhdC1Bu38ANoaASrzH42KvcHree):  Web must die!\nСурово!)",
				"added": 1455740068
			},
			{
				"comment_id": 133,
				"body": "Я думал, что веб страница или отдельная программа - это всего лишь разные представления одного и того же, т.е. оболочки для социальной сети. И если она работает в виде отдельного приложения, то для нее можно запилить и web-интерфейс, который, ИМХО, наоборот сейчас все больше входит в моду.",
				"added": 1455740525
			}
		],
		"5_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 32,
				"body": "Автор ZeroSearch [обещал подумать](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:19_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/What+about+searching+inside+websites) над реализацией поиска внутри ZeroTalk.\n",
				"added": 1455532746
			},
			{
				"comment_id": 33,
				"body": "Он работает только по названием торрентов. Но не по описанию и не по комментам.",
				"added": 1455533384
			},
			{
				"comment_id": 39,
				"body": "> [shift](#comment_43_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): что за ресурс?\n\n[Вот](http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3)",
				"added": 1455534679
			},
			{
				"comment_id": 48,
				"body": "В англоветке такую сцылку выкладывали: http://searchengineland.com/tested-googlebot-crawls-javascript-heres-learned-220157",
				"added": 1455553525
			}
		],
		"6_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 105,
				"body": "**Есть ли в ZeroNet поиск?**\nНа данный момент (февраль 2016) в сети работает поисковик сайтов по ключевым словам http://127.0.0.1:43110/zerosearch.bit\nПолнотекстовый поиск внутри сайтов пока не реализован. Частичная реализация тут: http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3\n\n**Как мне узнать какие сайты есть в ZeroNet? Как обнаружить новые сайты?**\n\nВоспользоваться поиском сайтов по ключевым словам: http://127.0.0.1:43110/zerosearch.bit\nЗайти в спецраздел на ZeroTalk: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:3_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar/NEW+WEBSITE+share+it+here\nЗайти на специальный сайт: http://127.0.0.1:43110/0list.bit\nЗайти в ZeroNet через один из гейтвеев (например http://bit.no.com:43110). Обычно, они уже знают много сайтов внутри ZeroNet, причем там их можно отсортировать по количеству пиров или дате обновления.\n\n**Как просматривать зеросайты через Tor браузер?**\n\nДля этого наберите в Tor браузере строку \"about:preferences#advanced\", нажамите на кнопку \"Settings\" (\"Настройки\"), затем выберите пункт \"Manual proxy configuration\" и добавьте адрес \"127.0.0.1\" в поле \"No Proxy for\".\n\n**Почему свежие комментарии появлются ниже (после) уже существующих? Неправильный порядок комментариев.**\n\nВожможно, у одного или нескольких участников беседы выставлено неправильное системное время. Они должны переставить его правильно. Сверить время можно тут:  http://time.is/\n\n**Как форматировать текст на форумах и блогах ZeroNet?**\nВам сюда: http://127.0.0.1:43110/16unhVWi9eLuZ4tosVtBd9eDqDTYzbgMSL/?Post:2:%D0%92%D0%BE%D0%B7%D0%BC%D0%BE%D0%B6%D0%BD%D0%BE%D1%81%D1%82%D0%B8+%D0%B1%D0%BB%D0%BE%D0%B3-%D0%BF%D0%BB%D0%B0%D1%82%D1%84%D0%BE%D1%80%D0%BC%D1%8B\nЗаписи в блоге убираются под кат при помощи трех дефисов `---`\n\n**Где мне взять Namecoin'ы для оплаты домена?**\nНа любой бирже криптовалют (например https://btc-e.com/exchange/nmc_usd) их или в обменнике (например: https://shapeshift.io/#). Можно также вежливо (на английском языке) попросить монеты здесь: http://127.0.0.1:43110/blog.0list.bit/?Post:2:Free+.bit+Domains+for+ZeroNet+Sites",
				"added": 1455654493
			},
			{
				"comment_id": 112,
				"body": "**Как создать подфорум или групповой топик на ZeroTalk-клоне?**\nОтредактируйте ваш файл `data/users/youruserid/data.json` и добавьте туда `\"type\": \"group\"` в настройках топика, который вы хотите превратить в групповой. Пример: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/data/users/1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG/data.json\"topic\": \n  {\n     \"body\": \"Articles about Bitcoin, Torrent and Peer To Peer networks\", \n     \"added\": 1436262090, \n     \"type\": \"group\", \n     \"topic_id\": 1, \n     \"title\": \"P2P news flow\"\n   }, ...",
				"added": 1455662341
			},
			{
				"comment_id": 113,
				"body": "**Чем различаются Project Milestorm и ZeroNet?**\nПервый имеет закрытый исходный код, работает только со своим браузером \"из коробки\", не поддерживает динамический контент. По состоянию на февраль 2016.",
				"added": 1455663095
			},
			{
				"comment_id": 114,
				"body": "**Чем различаются Freenet и ZeroNet?**\n\nFreenet\n- Сайты не могут быть удалены\n- Не используется Java Scrypt\n- Необходимо несколько минут для синхронизации\n- Работает быстрее, если подержать некоторое время запущенным\n- Сложнее в освоении для пользователя\n- Наибольшая безопасность при использовании только в доверенном кругу\n- Подходит для тех, кто живет в странах с жесткой цензурой\n- Написан на Java\n\nZeronet\n- Сайты можно удалять\n- В основном используется Java Scrypt\n- Мгновенная синхронизация\n- Приятный интерфейс\n- Чем популярнее сайт, тем быстрее он загружается\n- Поддержка работы через сеть Tor \n- Написан на Python",
				"added": 1455663504
			},
			{
				"comment_id": 115,
				"body": "**Чем различаются IPFS и ZeroNet?**\nIPFS не работает на смартфонах, не работает через Tor, предназначен для хранения и передачи файлов. ZeroNet заточен под P2P-хостинг динамических вебсайтов.",
				"added": 1455664274
			},
			{
				"comment_id": 116,
				"body": "**Какие есть плюсы и минусы у ZeroNet в сравнении с другими подобными проектами?**\nПлюсы:\n- легкость установки\n- легкость использования\n- легкость создания и наполнения сайтов\n- доступность из обычного интернета через гейтвей (в т.ч. со смартфонов)\n\nМинусы:\n- меньшая анонимность чем у Freenet или i2p, даже при использовании Tor\n- необходимость Java Scrypt для работы",
				"added": 1455664670
			},
			{
				"comment_id": 117,
				"body": "**Какие есть гейтвеи (gateways) / прокси в ZeroNet?**\nhttp://bit.no.com:43110\nhttp://wrewolf.com:43110\nhttp://zero.pags.to:43110\nhttp://45.63.123.191:43110\nhttps://zeronet.classcoder.com/",
				"added": 1455665363
			},
			{
				"comment_id": 118,
				"body": "**При попытке отправить письмо через ZeroMail выскакивает ошибка. В чем может быть причина?**\nВозможно, Вы превысили лимит выделенного под письма места. Обратитесь к **nofish** на форуме ZeroTalk: http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr/Invalid+private+key+for+ZeroMail\nВ будущем будет реализована функция автоматического удаления старых писем при достижении лимита.",
				"added": 1455666056
			},
			{
				"comment_id": 119,
				"body": "**Какого объема файлы/сайты можно выкладывать в ZeroNet?**\nНе рекомендуется выкладывать файлы/сайты объемом свыше 1 Мб в силу того, что сейчас в ZeroNet установлен лимит времени скачивания около 1 минуты. Т.е. для успешного распространения в сети файлы должны пересылаться пирами в течение указанного времени. Лимит установлен потому что 40% узлов пользуются подключением через сеть Tor, которая чувствительна к объему трафика.",
				"added": 1455666694
			},
			{
				"comment_id": 125,
				"body": "**Как закрепить топик/тему наверху в ZeroTalk-клоне?**\nДобавить `URI` топика в раздел `settings.topic_sticky_uris` файла `content.json`.",
				"added": 1455717055
			},
			{
				"comment_id": 126,
				"body": "**Как включить плагин многопользовательского режима (Multiuser plugin)?**\nПереименуйте внутреннюю папку `plugins/Disabled-Multiuser` как `plugins/Multiuser` и перезапустите ZeroNet. Теперь, на сайте ZeroHello у Вас должна появиться возможность смены отдельных ZeroID. Для повторного входа в Ваш прежний ZeroID понадобится ввод ключа `master_seed` из файла `data/users.json`.",
				"added": 1455717626
			},
			{
				"comment_id": 127,
				"body": "**Как сменить (создать несколько) ZeroID?**\n- Включите многопользовательский режим (метод описан в данном документе), запишите `master_seed` текущего пользователя.\n- Зайдите на ZeroHello, нажмите `User` -> `Logout` -> `Login to another account` для выхода из текущего ID\n- Зайдите на ZeroID, нажмите `Get auth cert`, введите новый `username`, нажмите `send request` и подождите, пока будет создаваться новый сертификат\n- Зайдите на ZeroHello и сохраните `master_seed` нового пользователя, нажав `User` -> `Show  your master_seed`\n- При возврате к предыдущему ID потребуется снова ввести его `master_seed`.",
				"added": 1455719029
			},
			{
				"comment_id": 136,
				"body": "> [wrewolfbitnocom](#comment_3_1GZZ3VLPQgTXkyud3aoBzXbpcSnpnLGnZT): Нужно на русском. Как создать подгруппу в форуме. На инглише было где то. Добавить в users/content.json вроде для  топика вписаит \"type\": \" group\".Или это концепт был?\n\nВторое сообщение глянь в этом топике.",
				"added": 1455788656
			},
			{
				"comment_id": 278,
				"body": "> [kostanew](#comment_16_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): vlad20012 хорошо расписал про zeroID тут: http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:1_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC/+ZeroID \n> Мне кажется надо обязательно добавить.\n\nСейчас неохото мне заниматься правкой FAQ'а. НО, [на странице FAQ'а](http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke) написано, что его не возбраняется редактировать (исправлять ляпы) и дополнять! Поэтому, если горите желанием, можете сей сайт склонировать и поправить. Если клон будет хороший, то можно и мне его копирнуть, чтобы не было проблем с обновлением ссылок у тех, кто привых ходить по старому адресу.",
				"added": 1457383795
			}
		],
		"7_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 106,
				"body": "Автоматические предупреждения о некорректном системном времени.",
				"added": 1455654919
			},
			{
				"comment_id": 121,
				"body": "Добавить теги в блоги?",
				"added": 1455667630
			},
			{
				"comment_id": 134,
				"body": "Уведомления в виде изменения иконки/заголовка вкадки ZeroHello в случае нового события на ресурсах, на которые подписан пользователь.",
				"added": 1455747347
			},
			{
				"comment_id": 195,
				"body": "Добавить выбор родного языка на сайтах.",
				"added": 1456839785
			}
		],
		"8_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 109,
				"body": "**Is there a search engine in ZeroNet?**\n\nAt the moment (february 2016) there is search for sites on keywords: http://127.0.0.1:43110/zerosearch.bit\nFull text search inside websites isn't working yet. Partitialy implemented here: http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3\n\n**Why do new comments appear below (after) already existing ones? Comments order is wrong.**\n\nProbably one or more users in your discussion have incorrect system time. They should set it correctly. It could be checked here: http://time.is/",
				"added": 1455656108
			}
		],
		"1_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz": [
			{
				"comment_id": 187,
				"body": "Их есть у меня:\n\nhttp://wrewolf.com:43110\nhttp://zero.pags.to:43110\nhttp://45.63.123.191:43110\nhttps://zeronet.classcoder.com/\n\nЭто я из нашего [русского FAQ'а](http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke) взял.",
				"added": 1456592254
			},
			{
				"comment_id": 308,
				"body": "> [kostanew](#comment_98_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): http://127.0.0.1:43110/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/?Post:19 - более полный и, наверное, обовляемый список.\n\nСпасибо, внес в наш [FAQ](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:faqru)",
				"added": 1457986300
			}
		],
		"1_1DjxkUHNWyzVrESngih4CZy9D844FvrKwM": [
			{
				"comment_id": 192,
				"body": "Кто-то новенький к нам подключился?",
				"added": 1456780401
			},
			{
				"comment_id": 196,
				"body": "Зато в эфире нету продвинутой системы самоуправления и самофинансирования как в DASH! Правда у меня самого в нем лежит в два раза больше денег, чем в Дашке, но это уже другая история ;)",
				"added": 1456874445
			},
			{
				"comment_id": 253,
				"body": "> [eosphor](#comment_1_1789XcRxNBxCsCTWFhhGsbmjrmg4XX4QPL): Так что перспективней, DASH или ETH?\nОбе. Сначала больше нравился Эфир, теперь Даш. Но это мои личные предпочтения. В эфире много всего обещают, но мало чего делают. Хотя цена ныне больше завист от обещаний, чем от реальных дел. Если в ДАШе разберутся с АСИКами и подумают о будущей децентрализации власти (читайте в [моем блоге здешнем](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99)), то у них вообще прекрасное будущее. У Эфира будущее прекрасно только с точки зрения технологий, по деньгам же я думаю, что их скупят (или уже скупили) большие дяди, а, следовательно, на выходе будет красиво упакованное, но никому не нужное УГ.",
				"added": 1457220871
			},
			{
				"comment_id": 262,
				"body": "Может быть. Про эфир ничего не скажу. Как спекуляция - отличная вещь. Как полезная вещь - увидим. Задумка, однозначно, гениальная. Реализация может, как всегда, подкачать. Единственное, что радует, так это многочисленные конкуренты, которые обязательно появятся в будущем.\nКстати, если тут есть кто с BitcoinTalk - можете поддержать словесными интервенциям тамошнюю тему про Зеронет: https://bitcointalk.org/index.php?topic=1237458.0",
				"added": 1457223235
			}
		],
		"1_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 200,
				"body": "> [esteban](#comment_23_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Zeronet  - это как торренты, только для сайтиков. Вот и делай выводы, для чего оно лучше.\n\nДля сайтиков? )))",
				"added": 1457193415
			}
		],
		"5_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 252,
				"body": "> [krlf](#comment_1_18RfVGME7R14BmGRcbVbZ1RaHoaeBEKtZ3): что-то с версткой нехорошееhttps://www.dropbox.com/s/vnojc3k2by2wug9/%D0%A1%D0%BA%D1%80%D0%B8%D0%BD%D1%88%D0%BE%D1%82%202016-03-06%2002.24.12.png?dl=0\n\nКартинки кстати тут можно выкладывать, не покидая зеронета: http://127.0.0.1:43110/1C2JhCunGLtvyX56nQ88tcb87WnXspjWN/?Topic:2_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf/",
				"added": 1457220546
			},
			{
				"comment_id": 266,
				"body": "Ну кстати да, в Зеронете, имхо, нету прям такой необходимости все держать на одном сайте. Скорее наоборот. Максимум - можно оставить раздельчик под общую флудилку. Если что, подписаться на интересные сайты (типа отдельные подразделы сайта - родителя) всегда можно.",
				"added": 1457264500
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 277,
				"body": "[ZeroNet FAQ на русском](http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLke)\n[Dash = digital cash](http://127.0.0.1:43110/1G8ABSZT7A7JXDEyneiaZM45GyuoWbzi99) - блог частично на русском\n[Русская свежатина](http://127.0.0.1:43110/13zWcviPiQWhyy8Yprou2pfvcfGcaNW3MF) - еще один русскоязычный форум\n[Блог на TiddlyWiki](http://127.0.0.1:43110/1G9s2eptrshvMmXaR1egEnGcbL9WdeQFAa)\n[Блог Шизофреника](http://127.0.0.1:43110/Shiza.ZAlex.bit)\n[Блог Винни-Пуха](http://127.0.0.1:43110/16unhVWi9eLuZ4tosVtBd9eDqDTYzbgMSL)\n[Русская живопись](http://127.0.0.1:43110/13MRyYzXdjCpz7b1WgSdvvPfyGx66z3RJY)",
				"added": 1457303753
			}
		],
		"2_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 287,
				"body": "> [redfish](#comment_2_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f): lol, iframe\n\nНо выглядит эффектно)). И почему я такой доверчивый)",
				"added": 1457539967
			}
		],
		"6_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 294,
				"body": "Уже [вбрасывал](https://www.reddit.com/r/OpenBazaar/comments/43ue9p/could_openbazaar_be_available_in_zeronet/) я где-то на реддите. Реакция тогда была слабенькой. Можно еще попробовать.",
				"added": 1457725043
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 295,
				"body": "> [shift](#comment_237_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): vlad20012, На тему передачи только изменений, вот тут nofish сказал что таки ждите патча совсем скоро http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1_1MahZJTzjoEMMCv2jBReDWhyNGRhN5tvDq/Bitnation+on+ZeroNet\nОго, Битнейшен до Зеронета добрались... Надо им этот вопросик показать: http://ethereum.stackexchange.com/questions/1076/is-it-possible-to-make-zeronet-p2p-websites-as-client-of-ethereum-dapps",
				"added": 1457826166
			}
		],
		"6_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 296,
				"body": "Вот тут вот есть тема на BitcoinTalk: https://bitcointalk.org/index.php?topic=1237458.0",
				"added": 1457867628
			}
		],
		"1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": [
			{
				"comment_id": 297,
				"body": "А ethereum не хотите попробовать? Вроде он сейчас в моде.\nБыл там у них вопрос и по поводу ZeroNet, правда никто пока не ответил: http://ethereum.stackexchange.com/questions/1076/is-it-possible-to-make-zeronet-p2p-websites-as-client-of-ethereum-dapps",
				"added": 1457942666
			}
		],
		"1_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": [
			{
				"comment_id": 310,
				"body": "Подскажите, есть где-нибудь сайтик, где собрана вся инфа по пресейлу или цене токенов на основе Эфира?",
				"added": 1458032255
			},
			{
				"comment_id": 311,
				"body": "@esteban, а что насчет Tau Chain скажете?",
				"added": 1458043065
			},
			{
				"comment_id": 312,
				"body": "> [shift](#comment_260_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А где можно вообще по эфир почитать и почему такой хайп пошел в сети?\n\nДа их роликами весь YouTube забит)\nДаже на русском есть: https://www.youtube.com/watch?v=a-Azm3nEuUI",
				"added": 1458043135
			},
			{
				"comment_id": 313,
				"body": "> [esteban](#comment_81_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Даже не знаю, либо первый раз слышу, либо не обращал внимания. Насколько предлагаемый там язык интересен не знаю, не знаком с такими языками. Вот что мне уже не нравится это по распределению токенов. Ну везде одно из двух зол, либо премайн, либо затухающая эмиссия биткоина.\n\nРанних инвесторов надо как-то награждать. Я считаю это правильным.",
				"added": 1458047641
			},
			{
				"comment_id": 315,
				"body": "Вот интересная монетка POSTcoin. Сделали под нее специальный форум о криптовалютах, и за каждый адекватный пост на форуме платят этой валютой. Вроде тут кто-то думал, как бы монетизировать сей форум. Так вот вам пример. Форум, к сожалению, только на английском пока.\nhttps://bitcointalk.org/index.php?topic=1410913.0\nhttps://bitcointalk.org/index.php?topic=1402308.0\nhttps://thealtcoinboard.com/",
				"added": 1459759899
			},
			{
				"comment_id": 316,
				"body": "Попробуйте)",
				"added": 1459925385
			},
			{
				"comment_id": 323,
				"body": "[TheDAO](https://daohub.org/) собрало более 35 млн $ в виде краудфандинга. На данный момент - это 2-й самый большой краудфандинговый проект за всю историю. Осталось 3 дня до увеличения цены сейла.",
				"added": 1462909068
			},
			{
				"comment_id": 324,
				"body": "$105M. Еще немного и это будет самый масштабный краудфандинговый проект [в истории ](https://en.wikipedia.org/wiki/List_of_highest_funded_crowdfunding_projects)",
				"added": 1463287831
			},
			{
				"comment_id": 325,
				"body": "Надо будет запилить пропосал по возможности использования ZeroNet в качестве форума  для The DAO. Ну, или если не для The DAO, то хотя бы для [BackFeed](http://backfeed.cc/), которая, кстати будет делать [свой пропосал](https://magazine.backfeed.cc/dao-alive-now-let-evolution-begin/) для The DAO.",
				"added": 1463325971
			},
			{
				"comment_id": 327,
				"body": "Видали как взлетел Steemit? В общем, зову всех в русскую группу:\nhttps://steemit.com/created/ru\nХорошо было б Steemit.com перенести в ZeroNet.",
				"added": 1468768493
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 326,
				"body": "Я бываю иногда",
				"added": 1468768292
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 328,
				"body": "Я тоже тут иногда, хотя сейчас больше на Steemit.com зависаю. Тут финансирование (свою монету-репутацию) так и не прикрутили, а там распределенности нету)) В общем, ждем Synereo.",
				"added": 1474184127
			},
			{
				"comment_id": 329,
				"body": "> [zalex](#comment_28_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): А я Yours Network жду :D\n\nА смысл ее ждать? Имеется в виду, с точки зрения инвестиции. Туда влошиться не получится. Своей монеты-то не будет.",
				"added": 1474307405
			}
		],
		"1_1AmvBauncC7rZyisrSf4a56tbJCNtdrxN5": [
			{
				"comment_id": 330,
				"body": "> [gnome](#comment_26_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): А оно кому-то надо - ваши файлы хранить?\n\nНнадо, только не просто так, а за криптовалюту. Смотри Storj, Sia и MaidSafe.",
				"added": 1495405079
			}
		],
		"13_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 331,
				"body": "Ethereum должен уже обогнать Биток, а то сколько можно...",
				"added": 1497770419
			}
		],
		"1_1H9R6W9QWUpYiJkLyAsFXmXhAV7HEqoHtN": [
			{
				"comment_id": 334,
				"body": "Был компутер ZX-Spectrum Duet. Прикольная была машинка. Помню, пролили на неё чай как-то случайно. Там стали буквы одна за одной исчезать с экрана: сначала \"Duet\", затем \"uet\", затем \"et\", затем \"t\", а дальше мы его погасить успели) Не думал, что подобное в жизни бывает.",
				"added": 1503855400
			}
		]
	},
	"comment_vote": {
		"3_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik": 1,
		"8_1NHZ2FfVkeCBzr2iS1cVnzf5xZfN4ZWEik": 1,
		"20_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"19_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"9_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"37_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"40_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"39_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"38_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"10_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"44_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"167_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"14_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"193_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"172_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"167_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"168_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1,
		"1_1H22VTT4T8bWNfuoScxocWnfHL4eiYCF5Q": 1,
		"253_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"1_1L6t5QZahvCGf2DaYQC4R2zk76GgSAFha2": 1,
		"328_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": 1
	}
}