{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "Parler seemed shady as fuck, from the start. Love the fact, that they call these skids \"researchers\" Meanwhile the one's who leaked Antifa's whole network are probably domestic terrorists (the irony)",
				"added": 1610404288
			},
			{
				"comment_id": 7,
				"body": "> [baduser](#comment_9_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): How is that? These troons don't even try to pass and they're ugly. Their little \"fight for equality\" only makes it harder for real (biological) women to achieve anything be it sports or IT. Look, we have \"\"\"women\"\"\" in our team, we're fucking diverse! No, you have fags and troons and maybe a woman secretary or a janny.\n\nThe CIA has also started to prefer diversity over competence. Check out their new logo and you'll see what I mean.",
				"added": 1610407309
			},
			{
				"comment_id": 11,
				"body": "> [namvata55](#comment_25_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): MORE clap FEMALE clap DRONE clap PILOTS!\n\nIt's honestly shocking (yet, not surprising) to witness; how even the CIA is infested with the Frankfurt pseudoscience.",
				"added": 1610409834
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 2,
				"body": "These are the real \"domestic terrorists\" Fuck you, you sick fucks.",
				"added": 1610404447
			}
		],
		"1610356743_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 3,
				"body": "Dark mode would be nice.",
				"added": 1610405046
			}
		],
		"1610193120_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": [
			{
				"comment_id": 4,
				"body": "Oh my gawd guys! He wants to read books about nazis. That's illegal!",
				"added": 1610405364
			},
			{
				"comment_id": 5,
				"body": "> [barbados](#comment_8_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): Fascism promises a 'thousand-year Reich', yet the current record for a fascist government is 36 years. And was developed by an 'inferior' southern European as well. What other evidence do you need that your ideology is cucked?\n\nSo you read about fascism and OP wants to do the same.",
				"added": 1610406141
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 6,
				"body": "> [mfs](#comment_78_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): To be fair, GAB did the same thing but fought back.\n\nI wonder if the founders of Google received the same treatment as Gab, when they started. Threats towards the CEO and his family, smeared as a Neo-nazi for years (check out the wiki, it's absurd) just because he allowed the right to speak as well (the left is equally as vulgar, so the justification for censorship is purely based on political reasons)",
				"added": 1610406900
			},
			{
				"comment_id": 8,
				"body": "> [namvata55](#comment_24_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk): Google was not targeted and smeared as neo nazis or anything of that sort obviously but when they were starting out they did have some beefs with the dinosaur media of that era, like when Viacom sued youtube in 2007 and lost\n\n  A legal matter vs personal assaults and threats. Which one seems more reasonable?",
				"added": 1610407511
			}
		],
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 9,
				"body": "Arch with dwm, atm. Going to swap to Debian for a while, just for the sake of it.",
				"added": 1610408125
			},
			{
				"comment_id": 13,
				"body": "> [luky]\nArcoLinux is great. The team has put some serious effort in breaking down every step to guide you through the installation process (their work on optimizing the desktop environments is also fantastic) Really recommend it to those who are interested in trying Arch. ArcoLinux was a great learning experience (a great distro too, ofc) for me personally.",
				"added": 1610432098
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 10,
				"body": "> [unsnapgreedless](#comment_4_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh): I'm absolutely sick of people jumping platforms like this. Remember when the Internet used to be tiny little blogs with blogrolls on the side? Not much censorship going on back then... Parler will go down, too, they're already being pressured and I don't think they can handle it.\n\nI agree. Feel like people's fear of missing out, stops them from exploring the internet. Personally, I'd like to experience every single one of these new platforms. It's pretty remarkable to witness, how people come up with their own solutions to combat the barriers, put down by our big tech overlords.",
				"added": 1610409292
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "Elon Musk makes fun of pronouns. Just for that reason alone, I shall gladly insert his AI chip in my brain.",
				"added": 1610428811
			},
			{
				"comment_id": 14,
				"body": "> [driud](#comment_199_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): You do not need; You already have it done.\n\nI take that as a compliment.",
				"added": 1610435913
			}
		]
	},
	"comment_vote": {
		"25_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"3_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem": 1
	}
}