{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1519506902_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "Also there's http://surge.sh",
				"added": 1527713984
			}
		],
		"1532691444_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "Usually when ISP:s make peering agreements with an upstream provider, the sender pays per amount of data transferred, while the receiver does not have to pay extra for any data received. This means that when you upload data to the internet, your ISP have to pay it's upstream provider for the amount of data transferred. However, when you download, it doesn't cost your ISP anything extra because the sender already have paid for the data transfer.\n\nThis could be one reason why your ISP wants to limit upload speeds, other reasons might be that large upload volumes usually are caused by P2P file sharing, which they don't want to encourage as it causes additional stress on the network. ISP:s such as Comcast, that also sells TV subscriptions, sees content creators that stream to Youtube/Twitch as direct competitors to their TV subscriptions, and wants to discourage such behaviour by capping upload speeds.",
				"added": 1534455068
			}
		],
		"1544289028_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "Personally I am self-hosting both Email and Calendar.\n\nFor Email I use a (manually configured) Postfix/Dovecot setup, but for easy setup there are scripts and pre-configured builds available. For example see here: https://github.com/Kickball/awesome-selfhosted#email\nMain danger with hosting email yourself is that some of the big providers (Google but especially Outlook) have a very low threshold to reject the emails you send (or flag them as spam) if you do not have your SPF and DKIM configuration in order, or use a SMTP server that is not having good reputation.\n\nFor Calendar I use self-hosted Nextcloud, which is primarily for file storage (like Dropbox/Google Drive), but includes Calendar features through a plugin. You can access your calendars both through the web-interface and import them to apps using Caldav.",
				"added": 1544659743
			}
		],
		"1550135195_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_49_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): From [this](https://github.com/HelloZeroNet/ZeroNet/issues/830) post, it seems ZN is using TLS encryption which seem to me like rather an obfuscation that real unbreakable encryption.\nAs is explained in the last post on the Github issue, Zeronet will use the highest TLS version that is supported by your system. In most cases TLSv1.2 which is afaik not considered to be breakable. The screenshot showing plain text transmissions is from some older version of ZN that did not support encryption I think.\n\nTor is only useful for hiding your IP address, and without Tor you'll connect directly with other peers who can see your IP. It does not really matter that ZN is vulnerable to MITM attacks, because the adversary will always have the opportunity to participate in the Zeronet network normally and can gather exactly the same information as when using a MITM attack.",
				"added": 1550187197
			}
		],
		"1572014442_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "Personally I use [LXC containers](https://wiki.archlinux.org/index.php/Linux_Containers) in Linux to separate my P2P traffic. LXC works in many ways the same as Virtualbox, but the host and guest share the same kernel which has the benefit that it only requires a minimal amount of extra RAM.",
				"added": 1572468599
			},
			{
				"comment_id": 6,
				"body": "An IDEA No. 4 would be to use separate _**network namespaces**_ for P2P and regular traffic. This would give you two virtual network interfaces—one for your normal traffic and the other for P2P—and you can decide which of these interfaces should be visible individually for each application you use. However, finding beginner-friendly documentation on this seems hard, neither do I have any personal experience of setting this up.",
				"added": 1572469155
			},
			{
				"comment_id": 7,
				"body": "> [1PxcBxgyJi62G1h](#comment_2_1PxcBxgyJi62G1hY8twZ8JHEeZJM5aacBb): ...or just to use Qubes OS with different Proxy VMs.\nIt's just that you would have to replace your everyday operating system for QubesOS, am I right? While any other of the proposed solutions allows you to continue using the same Linux distro you are already using.",
				"added": 1572559044
			}
		],
		"1572558637_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "But more often than not, you are paying for VPN service as well? Just look at the controversy of NordVPN recently when it came to public knowledge that they've had a data leak. They are undoubtedly going to loose customers because of this incident.\n\nPersonally I am more concerned of the free \"privacy DNS\" options, like Cloudflare 1.1.1.1, that people are recommending for general use without any consideration.",
				"added": 1572559419
			}
		]
	},
	"comment_vote": {
		"1_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1
	}
}