{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Русское сообщество",
			"body": "Так, я пробую как-то созвать русскоязычное сообщество зеронета. Прекрасный проект, жду с нетерпением ZeroMe, который по идее скоро должен выйти. В связи с этим пробую призвать всех старичков и новичков обратно. Лампово же сидели раньше.\n\nПодумываю, коль уж новую версию толка не написал, может хоть блог подолжать",
			"added": 1469746101
		}
	],
	"topic_vote": {
		"2_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": 1,
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 132,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Видели? Поиск по подключенным сайтам появился. Но судя по всему нужно обновлять сайты на тему нового апи или что-то вроде того",
				"added": 1460971400
			},
			{
				"comment_id": 2,
				"body": "подозреваю что нужен апдейт самого толка. ZeroHome наверное нужно как-то сказать, какм запросом искать или что-то вроде того.",
				"added": 1461066337
			},
			{
				"comment_id": 3,
				"body": "> [zerro](#comment_9_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Вот есть такоей внешний поисковик ещё. http://zeroexpose.com/\n\nне трушный",
				"added": 1461078249
			},
			{
				"comment_id": 4,
				"body": "> [shift](#comment_271_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): А мне поиск не завезли\n\nстранно http://i.imgur.com/ABjqPz3.png",
				"added": 1461078273
			},
			{
				"comment_id": 5,
				"body": "> [zerro](#comment_10_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Но видимо индексацию зеросайтом делать почти невозможно.\n\nАвтоматически? Вряд ли. Можно конечно тупо все данные из базы данных вытянуть да использовать полнотекстный поиск, но учитывая то, что зеронет весь в себе, самостоятельный, без дополнительных зависимостей, то писать подобный велосипед как-то не рационально. Поэтому скорее всего сам сайт должен сообщить, как именно по нему искать.",
				"added": 1461138029
			},
			{
				"comment_id": 7,
				"body": "> [splitfire](#comment_160_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): попробовал поискать, видимо полнотекстовый поиск по всей локальной базе\n\nмы сейчас о чем именно говорим? о внутреннем поиске или внешнем?",
				"added": 1461226405
			},
			{
				"comment_id": 8,
				"body": "> [zerro](#comment_17_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F):\n> Внешнем относительно чего. Я так понял, это поиск среди уведомлений только. Во всяком случае, у меня пока только так ищет.\n\nНу помоему ты ж и скидывал ссылку на поиск по зеронету в клирнете",
				"added": 1461232640
			},
			{
				"comment_id": 9,
				"body": "Вообще внутренней кухни я не разбирал, но помоему не обязательно по уведомлениям, потому что там отдельный параметр в конфиге, который говорит зеронету, какой запрос использовать для поиска.",
				"added": 1461232725
			},
			{
				"comment_id": 10,
				"body": "Хотя возможно я не прав",
				"added": 1461232949
			},
			{
				"comment_id": 11,
				"body": "абракадабра тест",
				"added": 1461232992
			},
			{
				"comment_id": 12,
				"body": "Хаха! работает!\n\nСейчас отписался от всего зеротолка, вбил \"абракадабра\" в поиск и оно нашло мое сообщение. Вобщем если сидируешь, то поиск работает. Как-то так.",
				"added": 1461233059
			},
			{
				"comment_id": 13,
				"body": "> [splitfire](#comment_163_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): именно про это и говорится в пресс-релизе в блоге офф разработчика\n\nКак видишь, это было не для всех очевидно, вот я эксперементально и проверил",
				"added": 1461319576
			},
			{
				"comment_id": 42,
				"body": "> [johnbyte11](#comment_3_1KoY1ipDRSFtKQ7w5sj1SYBb3yodjLpdeP): Просто тут в основном страницы состоят из одного текста и картинок. Да и еще структура сети напоминает ФИДО\n\nда ладно, оно ж наоборот тут все такое вебдванольненько. Анимации, риалтайм апдейты и все такое",
				"added": 1479478255
			},
			{
				"comment_id": 47,
				"body": "Подвыпал я на полгода так из зеронета. Что тут нового у нас?",
				"added": 1494500589
			},
			{
				"comment_id": 48,
				"body": "В ZeroMe видел упоминание 0Git, но так и не смог достучаться до зайта, пиров не находит. В целом сейчас как-то трудности у меня с пирами, ничего нового открыть не могу.",
				"added": 1494500752
			},
			{
				"comment_id": 50,
				"body": "> [balancer73](#comment_104_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Если речь о http://127.0.0.1:43110/1xxooZ7s8iDz3u56i5mNQ1XGmwF8Zvnw9/ — то я так и не пощупал.\n\nА, тоесть это именно гит репозиторий, это еще не что-то уровня гитхаба?",
				"added": 1494940806
			},
			{
				"comment_id": 51,
				"body": "> [balancer73](#comment_105_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Можешь заглянуть на:\n> \n> http://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/\n> http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/\n> http://127.0.0.1:43110/1NbzP9dgYhuY71bde9G1LuVGaCE69venzR/\n> \n> Активность слабенькая, но есть :)\n\nЗа ссылочки спасибо",
				"added": 1494940876
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 6,
				"body": "Тут есть пост о том, как подключить поиск к себе http://localhost:43110/Blog.ZeroNetwork.bit/?Post:81#Comments и насколько я понял, в dbschema есть новое поле feeds (исключительно эксперементально нашел путем сравнения двух файлов), который и говорит, откуда выбирать текст для поиска. Судя по всему имеет конкретную схему ответа. Ждет таблицу с колонками title, body, date_added, url, type, event_uri",
				"added": 1461138803
			},
			{
				"comment_id": 71,
				"body": "Привет",
				"added": 1497286938
			},
			{
				"comment_id": 83,
				"body": "> [balancer73](#comment_148_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Починил. Но теперь кто-то может оставлять комментарии, а авторы блогов об этом и знать не будут :) Придётся делать и систему извещения о комментариях.\n\nв смысле синхронизация односторонняя? Впрочем я и не удивлен)",
				"added": 1503926172
			},
			{
				"comment_id": 84,
				"body": "> [balancer73](#comment_149_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Пока это всё делалось элементарно для индексации поисковиками, которые не дружат с ZeroNet через прокси :) А двусторонний синк блогов в ZeroNet возможен только по инициативе их авторов. Никто же не будет светить свои приватные ключи на постороннем ресурсе :) Т.е. для себя я сделаю двухсторонний синк, но будут ли это делать другие...\n> Вот с комментами немного проще. Можно оставлять комментарии от бота. Типа, «там-то такой-то написал Вам это: ...»\n\nя не уверен на 100% (нигде не была показана эта возможность), но помоем данный параметр разрешает нескольких подписчиков для одного зайта. К тому же можно сделать разные требования к подписке, как я понял. Например хотя бы один подписчик или несколько из списка вплоть до всех.",
				"added": 1503954770
			},
			{
				"comment_id": 85,
				"body": "> [ukraine](#comment_12_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5): Полагаю можно создать свой ZeroID, зарегистрировав домен в NameCoin и запустив соответсвующий сервис?\n\n\nК сожалению да, ZeroID на текущий момент единственная централизованная система, но надо отметить, что в целом - не является точкой отказа. Хотя конечно правки на многих зайтах могут потребоваться",
				"added": 1503954874
			}
		],
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": [
			{
				"comment_id": 14,
				"body": "merged sites в этом деле действительно очень помогут как по мне. Пока не имею представления, как именно это будет работать. Ждем конца июня.",
				"added": 1465069846
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 15,
				"body": "заглядываю иногда",
				"added": 1469104199
			},
			{
				"comment_id": 16,
				"body": "> [splitfire](#comment_184_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): чет раньше активнее был, вообще раньше здесь веселее было\n\nЯ хочу вернуть те времена!",
				"added": 1470065949
			},
			{
				"comment_id": 18,
				"body": "> [freedombelarus](#comment_2_1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3): Беларусь с вами!\n\nо, земляки подтягиваются",
				"added": 1470128713
			},
			{
				"comment_id": 23,
				"body": "> [splitfire](#comment_191_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): нужна реклама и/или контент\n\nрано для рекламы пока. Вот ZeroMe появится - вполне может быть инфоповодом. Мол твиттер для всех, никто не забанит и т.п.",
				"added": 1470759650
			},
			{
				"comment_id": 33,
				"body": "Смотрите, нас тут много, причем много тех, о ком мы раньше не знали",
				"added": 1471932027
			}
		],
		"1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 17,
				"body": "> [splitfire](#comment_185_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): GET OVER HERE!!! :)что за косяк с 1 file update failed?\n\nгде?",
				"added": 1470065958
			},
			{
				"comment_id": 19,
				"body": "Он вроде сначала в отпуске был, а сейчас по-идее должен заниматься ZeroMe. Может в глубокий дев ушёл?",
				"added": 1470305650
			},
			{
				"comment_id": 20,
				"body": "> [splitfire](#comment_186_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): Ну у меня отображается \"1 file update failed\" и уже давно\n\nэто я понял. А где? :)",
				"added": 1470732924
			},
			{
				"comment_id": 21,
				"body": "> [splitfire](#comment_187_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): вообще автор видимо допилил, ждем обнов :)https://github.com/HelloZeroNet/ZeroNet/issues/232\n\nв ишью написал, что если не найдет багов, то завтра будет анонс. Написал он это 13 часов назад на текущий момент. Ждем-с.",
				"added": 1470733088
			},
			{
				"comment_id": 22,
				"body": "> [splitfire](#comment_188_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): https://ipfs.pics/QmaPiP9G7cSBBUUNwMvPtyvyYr8rcTMrzb3amw3PxmA2g8 - вот, еще понятнее уже никак :D\n\nА, ну так не я ж держатель этого форума :)",
				"added": 1470759597
			},
			{
				"comment_id": 24,
				"body": "Блин, ZeroMe вообще отличным вышел для старта, как мне кажется. Прям вау!",
				"added": 1470915066
			},
			{
				"comment_id": 26,
				"body": "> [zerro](#comment_51_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Я тоже. А красные с голубыми могут взаимодействовать? Или зачем это все.\n\nсудя по всему это и есть основная фишка",
				"added": 1470993071
			},
			{
				"comment_id": 27,
				"body": "Кто знает прокси с 0.4 версией?",
				"added": 1471000837
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 25,
				"body": "Опять?",
				"added": 1470950082
			},
			{
				"comment_id": 37,
				"body": "Как вам, вновьприбывшие?",
				"added": 1472406489
			},
			{
				"comment_id": 79,
				"body": "Начал замечать, что люди пишут тут время от времени что-то вроде \"привет\" и на этом все общение заканчивается, видимо есть мысли, что никто не читает. На самом деле это не так, я регулярно тут нахожусь, подписан на все топики RU-ZeroTalk, каждый день заглядываю в ZeroMe. В общем - смело создавайте топики, заходите на блог, подписывайтесь в ZeroMe, я рад буду помочь и быть участником комьюнити.",
				"added": 1500980680
			},
			{
				"comment_id": 80,
				"body": "> [shift](#comment_379_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Да приложения имхо для мобильных не хватает... это бы подняло интерес\n\nОно таки есть (https://github.com/HelloZeroNet/ZeroNet-kivy/releases)",
				"added": 1501270862
			},
			{
				"comment_id": 102,
				"body": "Ничего удивительного в спиральной истории, не так ли?",
				"added": 1508282110
			}
		],
		"9_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 28,
				"body": "Как по мне - супер вещь вышла. Надо познать merger api и может своего чего попробовать навоять. Сейчас со временем крайне плохо, так что как-то не выходит...",
				"added": 1471210791
			},
			{
				"comment_id": 29,
				"body": "> [shift](#comment_281_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): хотеть функции ретвита и атача разного контента... ну и технических спецификаций как это работает (если кто найдет - кидайте)\n\nвидимо только в код смотреть",
				"added": 1471258292
			},
			{
				"comment_id": 30,
				"body": "> [zerro](#comment_55_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Хотя я кажется понял. Если у пользователя достаточно подписчиков, он может держать свой профиль полностью на отдельном хабе, и при этом его профиль будет оставаться доступен, даже когда он не в сети.\n\nв самую дырочку",
				"added": 1471276021
			},
			{
				"comment_id": 31,
				"body": "> [wrewolf](#comment_140_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): я не бекаплю его)\n\nсам себе злостный буратино)",
				"added": 1471358374
			},
			{
				"comment_id": 32,
				"body": "> [wrewolf](#comment_141_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): главное что рабочие вещи забекаплены и всякие фотки и пр)\n\nутерянный здесь аккаунт утерян навсегда, разве нет? :)",
				"added": 1471381776
			}
		],
		"1_1EeMB9Y46ra4a3ZDRMqvPVZ3WmP2Dgferj": [
			{
				"comment_id": 34,
				"body": "Но зачем? Каждый посетитель сайта и есть его личный архив. Нет контроля версий, но и это возможно временно.",
				"added": 1471945994
			},
			{
				"comment_id": 35,
				"body": "> [shift](#comment_283_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Как я понял топикстарттер предлагает сделать wayback machine\n\nтак и нужно ее делать на уровне зеронета, а не зайтом. Зайт вероятнее всего будет носить централизованный характер:\nБудет запущенно какое-то ПО, которое будет сохранять копии сайтов на текущий момент времени и публиковать их в качестве зайта(-ов).\n\nДумаю, что использование опционального плагина гораздо более хороший выбор для этих целей.",
				"added": 1471947029
			},
			{
				"comment_id": 36,
				"body": "> [shift](#comment_285_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): плагином? обьем данных будет большой\n\nопциональным. Возможно создание  снапшотов сделать по запросу, возможно более гибкие варианты шедула, может даже размазать это все дело по сети. Места в любом случае где-то убудет.",
				"added": 1472043636
			}
		],
		"1_1MvThPTkB38SGq4MbaJC6yJP7HTFX1PGx": [
			{
				"comment_id": 38,
				"body": "Попробуй сформулировать свой вопрос еще раз, а то я как-то не уловил",
				"added": 1472413603
			},
			{
				"comment_id": 39,
				"body": "Или точнее даже так, какую именно проблему ты пытаешься решить?",
				"added": 1472414215
			},
			{
				"comment_id": 40,
				"body": "Запустить zeronet.py --tor always --tor_proxy 127.0.0.1:9150 --tor_controller 127.0.0.1:9151",
				"added": 1472466018
			},
			{
				"comment_id": 41,
				"body": "> [anonguests](#comment_3_1MvThPTkB38SGq4MbaJC6yJP7HTFX1PGx): запустил и всё равно error нужно ещё где-то что-то сделать может в gateway?\n\nЯ никогда не работал с Whonix просто. Tor browser запущен то был?",
				"added": 1472506133
			}
		],
		"10_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 43,
				"body": "Да, ваши тут на всех фронтах на наших накинулись. СМИ \"типа\" серьезные передачи, юмористические, даже военные. Ой напрягает меня это немного все.",
				"added": 1480619282
			}
		],
		"1_1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3": [
			{
				"comment_id": 44,
				"body": "> [zxmaster](#comment_3_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j): Ну так начинай глаголить.Как ты предлагаешь в Беларуси хорошо сделать?Понятно что усатый как бы напрягает, но кем его заменить?Оппозиция как бы не совсем адекватна, по крайней мере та, что я замечал. \n> З.Ы. Самый большой вопрос который у меня есть это как белорусы отнесутся к Коле в случае чего? Будут таки терпеть или взорвутся?\n\nОтвечу чтоли я, как беларус. Бомбит меня уже давно от всего этого беспредела, что устраивает наша власть. Бомбит меня и от попозиции. Всех повыгонять нахрен надо бы, но как?",
				"added": 1480619557
			},
			{
				"comment_id": 45,
				"body": "> [wrewolf](#comment_149_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Был я у вас осенью в Жлобине, мирный тихий городок. Да и вообще все страна пока ехал напомнила скорее вымерший заповедник. Людей почти нет. Едешь чистые деревни стоят, редкие люди на улицах. Машин тоже почти нет. Странно в общем для меня)\n\nдеревни почти мертвые, это да.",
				"added": 1480671552
			},
			{
				"comment_id": 46,
				"body": "> [shift](#comment_311_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Интересно а какая реальная поддержка власти у народа? реально всех всё устраивает?\n\nкак мне кажется, очень много тех, кого не устраивает. Но объективно, альтернатив и нет особо, потому что все давят на корню. Лично я просто хочу, чтобы появилась сменяемость власти, т.е. уже пофиг кто, лишь бы другой. Может это хотябы как-то раскочало бы это болото",
				"added": 1480671702
			}
		],
		"1_1JXr7HXJit5v32121p1bfa9ezhurhc2ZPG": [
			{
				"comment_id": 49,
				"body": "Какая-никакая, но есть",
				"added": 1494940625
			}
		],
		"1_1AmvBauncC7rZyisrSf4a56tbJCNtdrxN5": [
			{
				"comment_id": 52,
				"body": "Технически - можно, вопрос в том, кто будет вашими пирами",
				"added": 1495204001
			}
		],
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 53,
				"body": "Да вот не понятно, чем людей заманивать. Нет же ничего, что обычный человек не найдет в привычной сети. А тут еще заморачиваться надо, да еще и адреса какие-то не понятные, какой локалхост, какой 1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE",
				"added": 1495798630
			},
			{
				"comment_id": 54,
				"body": "> [gnome](#comment_29_1HfDNkzdG4ce6CtGJu8yzrUCHjwCUQkkDu): Справедливости ради, тут вообще кроме этого форума пока ничего нет. Конечно, можно зайти в ZeroName и удивиться изобилию. Но на самом деле, кроме пары блогов, на раз прочитать, среди этого \"изобилия\" ничего не найдешь. Тут делать особо нечего, поэтому только одни энтузиасты и сидят. Положительная сторона в том, что тут пока нет или мало маркетологов, которые буквально засрали верхний интернет.\n\nДобавлю пожалуй, что ZeroMe все же довольно крутая штука",
				"added": 1495807436
			},
			{
				"comment_id": 55,
				"body": "> [akachan](#comment_34_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw): Простите за грубость, но может вы проявите зеронету больше внимания нежели внешней сети? В разумных приделах. За всякими \"chanами\" нам не угнаться, но в английском зероталке посты идут каждые несколько часов, а тут, походу,я самый активный комментатор\n\nс такими мнениями желаю большой удачи в завлечении людей =\\",
				"added": 1495817847
			},
			{
				"comment_id": 57,
				"body": "> [devl547](#comment_5_198HAqccKTyRjZpPxPRTum3MAuDAbLxm8C): А что активность? Если в tor/i2p можно сделать какой-никакой стриминговый сервис, то zeronet - это платформа для статики.\n\nПротестую, вы же сейчас общаетесь на динамическом форуме, разве нет?",
				"added": 1495822268
			},
			{
				"comment_id": 59,
				"body": "Сегодня накатал новый пост [в своем блоге](/blog.gomzik.bit/?Post:14:%D0%9F%D0%B8%D1%88%D0%B5%D0%BC+%D1%81%D0%B2%D0%BE%D0%B9+%D0%B7%D0%B0%D0%B9%D1%82+%D1%81+%D0%BD%D1%83%D0%BB%D1%8F:+%D0%9E%D0%BA%D1%80%D1%83%D0%B6%D0%B5%D0%BD%D0%B8%D0%B5), все же не хочу останавливаться на одной-двух статьях, планирую все же доделать до конца свою работу",
				"added": 1495841263
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 56,
				"body": "https://play.google.com/store/apps/details?id=org.disrupted.rumble",
				"added": 1495817958
			}
		],
		"1_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 58,
				"body": "> [voland](#comment_36_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): вот я лопух... перепробовал самые разнообразные варианты ката, а простых \"- - -\" ни разу..\n\nнекропост конечно, но там же подсказка есть",
				"added": 1495839560
			}
		],
		"1_175A4pxQi9MxM3im5oWZGqZPTyVWXQA6Bw": [
			{
				"comment_id": 60,
				"body": "Постараюсь связаться с админом через сеть, но как способ обхода на текущий момент - удалять старые сообщения",
				"added": 1496008116
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 61,
				"body": "Пытался связаться с админом форума, пока не удалось",
				"added": 1496059491
			},
			{
				"comment_id": 68,
				"body": "> [zalex](#comment_83_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Мне удалось. Цитирую ответ:\n\nКрутяк, ждем",
				"added": 1496244622
			},
			{
				"comment_id": 72,
				"body": "> [shift](#comment_375_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Добавил всем =)\n\nО, объявился)",
				"added": 1498491456
			}
		],
		"1_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9": [
			{
				"comment_id": 62,
				"body": "Если заходите через TorBrowser то слева сверху нужно нажать на расширение NoScript и разрешить JavaScript для этого сайта",
				"added": 1496059562
			},
			{
				"comment_id": 63,
				"body": "> [qwz](#comment_3_185aoaDe51MBawYF4nxx3nAKZWKinUqks2): нужно ВЫКЛЮЧИТЬ тор браузер\n\nЯ не понимаю вопроса. Не используйте TorBrowser да и все, зачем он вам?",
				"added": 1496069594
			},
			{
				"comment_id": 64,
				"body": "ZeroNet в стандартной поставке для Windows включает в себя Tor Browser? я просто действительно не в курсе, вроде как стандартный пакет не должен был включать его в себя. Или в из другого места скачивали?",
				"added": 1496077998
			},
			{
				"comment_id": 65,
				"body": "Скачал дистрибутив для Windows. Не вижу внутри TorBrowser",
				"added": 1496078050
			},
			{
				"comment_id": 66,
				"body": "> [azriel](#comment_15_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv): а ты по папкам пройдись, тор есть\n\nTor и Tor Browser не одно и тоже, nofish включил в поставку ZeroBundle и Tor, это да.\n\n> [azriel](#comment_16_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv): стоп, а сидел ты через что???\n\nЯ использую Linux в качестве основной ОС, а сам zeronet выкачан с github",
				"added": 1496082800
			},
			{
				"comment_id": 67,
				"body": "> [kodomoneko](#comment_10_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9): А как от этого тора безопасно избавиться?\n\nА почему вы вообще хотите от него избавиться?",
				"added": 1496136899
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 69,
				"body": "Пользую активно и всех туда тяну. Секретные чаты действительно безопасны, но и обычные в целом можно пользовать, дуров похоже не собирается уступать правительствам, хотя это уже никто не может гарантировать. Серверная сторона нам не доступна, нельзя понять, как именно там все происходит, но по словам дурова, достать данные тоже не самая легкая задача, потому что они распределены территориально. В общем пока есть вера + секретные чаты. Пользуюсь только стандартными клиентами и вам советую.",
				"added": 1496306099
			},
			{
				"comment_id": 73,
				"body": "> [rumka](#comment_5_17SJE1VkGz1JN4gBfo5oBhgrt4zbBYY12F): Призыв юзать телегу из принципа? Интересно, сколько вообще отвалится пользователей после блокировки?\n> Вообще я разочарован в телеге, пару лет никаких полезных улучшений в плане безопасности и неблокируемости. Посмотрим, как теперь поведет себя. Впилили звонки, лучше бы впилии регу по e-mail, все равно там ники.\n\nДык хотели же, что б контакт лист сразу был актуальным, потому и рега по номерам",
				"added": 1498491515
			},
			{
				"comment_id": 74,
				"body": "> [rumka](#comment_6_17SJE1VkGz1JN4gBfo5oBhgrt4zbBYY12F): контактлист там с контактов на устройстве берется.\n\nНу так а как они по вашему матчатся на аккаунты в телеграме? Конечно же по телефонному номеру",
				"added": 1498515726
			}
		],
		"15_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 70,
				"body": "Так ZeroNet же позволяет делать опциональные файлы, это конечно не клиент решает, а разработчик зайта, но мне кажется, что это и решает проблему тяжелых сайтов",
				"added": 1497269098
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 75,
				"body": "Python + JS, остальные языки тоже немного известны, но такое, в названных прямо свободно себя чувствую",
				"added": 1499424665
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 76,
				"body": "> [trava](#comment_6_1EHrBqNZLu3He8t98otjqezt5jRE8euGSA): Хочу поделиться реально рабочим и относительно удобным способом запуска ZeroNet на Android.Для начала необходимо установить termux, он позволит запускать многие linux приложения без рута и прочих плясок с бубном. В termux нам достаточно выполнить скрипт zn.sh с этого репозитория https://github.com/WillyPillow/Termux-ZeroNetСкрипт сам установит ZeroNet и все зависимости. Установится все в ~/ZeroNet/\n\nЯ тоже так пользуюсь, только не чужой скрипт брал, а сам ручками и поставил.",
				"added": 1499782151
			}
		],
		"1_1Cyyr76U2n1mNR7ctgzgH8BoDzVXoRc6UY": [
			{
				"comment_id": 77,
				"body": "Скорее всего потому что надо писать\n```\n<script>\n// ...\nvar zeroFrame = new ZeroFrame()\n//...\n</script>\n```",
				"added": 1499947642
			}
		],
		"1_131EvTsxkEMjSV2S2oghQGk1zisHAZ2GXG": [
			{
				"comment_id": 78,
				"body": "Ну а чего вы хотели, весь фронтенд ZeroNet работает на JavaScript, после отключения всех скриптов остается лишь наблюдать серую страницу.",
				"added": 1500889069
			}
		],
		"1_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": [
			{
				"comment_id": 81,
				"body": "А может кто-нибудь знает, где хранятся ключи от своих сайтов? Перенес `users.json` на другую машину - не могу с нее писать например в своем блоге и работать над своими зайтами.",
				"added": 1502805162
			},
			{
				"comment_id": 82,
				"body": "> [balancer73](#comment_136_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): В том же data/users.json. У каждого своего сайта параметр:\n> \"privatekey\": \"5Kxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxvyr9\"\n> Собственно, его только достаточно и копировать, чтобы работать с зайтом на новой машине. У меня почти все  зайты настроены на работу с 3-5 машин.\n\nХм. Вот разве что не пробовал, так это в нуль-меню поставить свитчер This is my site",
				"added": 1502809599
			}
		],
		"2_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 86,
				"body": "ZeroNet можно заставить работать только поверх сети Tor, например",
				"added": 1504033282
			}
		],
		"3_19q4JXMEuevDD1iPSEtic5fjB7LD3Bt9C5": [
			{
				"comment_id": 87,
				"body": "Был проект бывалого зеротчанина (http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:4:Анонс+плагина+EasyMetrics)\n\nДалеко не тоже самое, но он к этому стремился, может быть имеет смысл продолжить его наработки\n\nКонечно же все это работает с точки зрения пользователя, а не центрального хранилища. Т.е. до чего твои ~~руки~~ пиры дотянулись, то, вероятно и будет видно",
				"added": 1504083823
			}
		],
		"1_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky": [
			{
				"comment_id": 88,
				"body": "http://localhost:43110/1JMNrd9FD19AhWVukYJ2gdxAiK2ohczwk5/\n\nЯ в процессе разработки что-то похожего Google Play Music для зеронета. Это еще совсем совсем начало, но я планирую допилить",
				"added": 1504872693
			},
			{
				"comment_id": 89,
				"body": "> [towarisch](#comment_4_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Оно доступно? У меня выдает Not Found\n\nМоя статистика показывает 26 пиров. Попробую переподписать и опубликовать",
				"added": 1504873237
			},
			{
				"comment_id": 90,
				"body": "> [towarisch](#comment_5_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Уже работает. Ну, то бишь, открывается. Как только будет более-менее юзабельно -- дай знать, поместим в шапку\n\nНу я в свободное время этим занимаюсь, поэтому медленно это все пока\n\nДолжно проигрывать вшитый трек, а так же переходить между вкладками",
				"added": 1504873399
			},
			{
				"comment_id": 91,
				"body": "> [towarisch](#comment_6_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Вшитый трек не играет, ругается на неподдерживаемый формат. А вкладки переходит, да\n\nбраузер и ось?",
				"added": 1504873475
			},
			{
				"comment_id": 92,
				"body": "> [towarisch](#comment_7_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Firefox 55, Win7 64x\n\nхм. На линухах мне нужно было доставить дополнительные кодеки для фаерфокса. Однако все работало в хроме из коробки. Сейчас пересел на мак и в сафари тоже не работает из коробки. Возможно дело именно в формате дорожки, я так понимаю придется конвертировать музыку так, чтобы она работала в разных браузерах. Так как в зеронет у нас нет бекенда, я пока не представляю, как это сделать.",
				"added": 1504875278
			},
			{
				"comment_id": 93,
				"body": "> [towarisch](#comment_8_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): А что за формат такой?\n\nСейчас там два формата, обычный mp3 и какой-то ogg (не успел хорошенько познать этот формат, есть различия и видимо не каждый браузер поддерживает тот, который у меня вышел), пробует воспроизводить первый из тех, какой подходит",
				"added": 1504876572
			},
			{
				"comment_id": 94,
				"body": "> [towarisch](#comment_9_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): По идее ogg открытый формат и должен спокойно везде проигрываться. MP3 закрытый, но распространенный, тоже должен проигрываться. Хм.\n\nтем не менее, не так",
				"added": 1504896297
			},
			{
				"comment_id": 95,
				"body": "> [towarisch](#comment_10_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Гм. А как ты проигрываешь аудио? Может дело в этом?\n\nHTML5 Audio API",
				"added": 1504989518
			},
			{
				"comment_id": 96,
				"body": "> [towarisch](#comment_16_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Я тут кое-что нашел. И там аудио проигрывается. Может поможетhttp://127.0.0.1:43110/1Lod6THUt6v6ebZdBF2voYMk2QfvLvPm4q/\n\nтам типа с полифилом с флеш проигрывателем. ну вообще взгляну, спасибо",
				"added": 1505000037
			},
			{
				"comment_id": 97,
				"body": "> [towarisch](#comment_23_1Bi9V3bX9yBXhd36w6dehiJa3Fy4fPsHky): Эм, разве поддеживается создание сайтов на питоне? Один жс же можно было\n\nсам ZeroNet написан на питоне и там есть еще много того, что можно было бы доделать. Это и имеется ввиду",
				"added": 1505148046
			},
			{
				"comment_id": 98,
				"body": "Тут система такая, весь бекенд который есть - апи самого зеронета, запускать код вне браузерной песочницы никто не даст по соображениям безопасности. Разве что остается делать какие-нибудь скрипты, которые генерят статический html и публикуют в зеронет, что такое себе конечно, но если очень хочется, то можно :) Ну и очевидно, скрипты запускать будете вы сами",
				"added": 1505149766
			}
		],
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 99,
				"body": "Фу-фу-фу таким быть",
				"added": 1505341678
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 100,
				"body": "Будь контентмейкером, не будь потреблятелем :)",
				"added": 1508019983
			},
			{
				"comment_id": 101,
				"body": "Любой, ибо его категарически мало в принципе",
				"added": 1508275467
			}
		],
		"1_1PEBR3TeTAu1rNL3EuGZtymbvMVKXZyqFK": [
			{
				"comment_id": 103,
				"body": "> [geekless](#comment_8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я делаю port forwarding средствами ssh и просто хожу браузером по локальному адресу. Правда приходится еще htop в сеансе ssh запускать, т.к. если долго нет обмена данными, сеанс подвисает. А с htop в качестве пинга он может висеть открытым днями.\n\nТоже так делаю, но без htop, никогда не испытывал проблем с этим просто",
				"added": 1509462092
			}
		],
		"1_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS": [
			{
				"comment_id": 104,
				"body": "Веб-дев, по большей части. Ну и поболтать с разными людьми рад",
				"added": 1510689624
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 105,
				"body": "Вот это я неожиданно вовремя заглянул. Да, balancer делал многое и не только для zeronet, но и для любых децентрализованных штук в частности. Rest In Peace...\n\nЯ давно уже не заходил себя, но это скорее проблемы временного характера, zeronet навсегда в моем сердечке. Это я к тому, что с удовольствием поучаствую в любой активности в популяризации проекта, сети, чего угодно, но на текущем этапе жизни я не готов гарантировать какую-либо регулярность.\n\nОчень много апдейтов пропустил, далеко еще не со всеми аспектами зайтостроения разобрался, но все еще хочется как-то помочь зеронетушке любимой.\n\nКороче говоря, я, судя по статистике ниже, олд еще аж 16го года, готов помогать по мере возможностей, если конечно возьмете",
				"added": 1548866290
			},
			{
				"comment_id": 106,
				"body": "> Убрать ссылки на давным-давно устаревшего Гомзика\n\nХех, справедливо",
				"added": 1548866929
			},
			{
				"comment_id": 107,
				"body": "Обратил внимание, что появилась куча девелоперских блогов, которые возможно разъяснят все недостающие части, посижу, покурю, может все таки подкину наконец что-то интересное и, что мне кажется важно для чего-то в контексте меня, законченное.",
				"added": 1548870574
			},
			{
				"comment_id": 108,
				"body": "> [quirrel](#comment_45_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y): Первая просьба: поделитесь, пожалуйста, админкой на этом сайте с Geekless'ом. Он здесь находится постоянно и уже очень много сделал для сети. Потому что если вы исчезнете, это будет очень неудобно.А сделать тут еще очень много надо. Воспользуясь случаем, выдвину запросы:\n> \n> Закрепить ссылочку на FAQ http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet+Ru+FAQ+ZeroNet чтобы она всегда висела наверху.\n> Убрать из предложенных блогов kostanew, он здесь уже давно не появлялся и заменить его блогом Geekless, там сейчас самая актуальная информация по разработке на данный момент.\n> Создать подраздел на форуме \"Совет по развитию\" куда и перекинуть эту тему.\n> \n> Вот мой скромный набор предложений, кампанию за реализацию которых я, собственно, и развернул всей этой темой.\n\nТак форум хостит shift, меня вроде не добавляли к тем, кто может подписывать контент",
				"added": 1548924955
			},
			{
				"comment_id": 109,
				"body": "Проверил content.json этого форума - да, там только shift подписывать может",
				"added": 1548926058
			},
			{
				"comment_id": 110,
				"body": "> [geekless](#comment_85_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): http://127.0.0.1:43110/1fzncZRMPGPBdyUBm2ATVSkRAsnvMq5VN/?Post:2\n\nNo peers found :(",
				"added": 1548930764
			},
			{
				"comment_id": 111,
				"body": "Да, похоже дело в tor, пойду поднимать",
				"added": 1548932942
			},
			{
				"comment_id": 112,
				"body": "Давно не запускал тор, оказывается у меня в стране это теперь проблема, даже обфускаторы не особо помогают, люблпытно очень",
				"added": 1548937021
			},
			{
				"comment_id": 113,
				"body": "> [x86128](#comment_7_1Mh1PrkbBvVvZaLiGnFr89GaUyZDScMZ1z): Еще пробуют запустить работу через cjdns. В ZeroMe Kaffie:1) http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/15484768042) http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh/1548924540\n> Поскольку ZeroNet наконец-то работает через IPv6 теперь работа через cjdns стала возможным. Это конечно не убийца Tor, но тем не менее еще одна альтернатива которая работает параллельно Тор.\n\nСпасибо, но первоцель достигнута, ссылка открылась :)",
				"added": 1548938473
			},
			{
				"comment_id": 114,
				"body": "Надо бы набрасать роадмэп какой-то, я бы в свободное время может и подпиливал бы чего, а сейчас просто в РО сижу, слежу. Как-то тяжело мне на идеи, видимо больше исполнитель",
				"added": 1549444749
			},
			{
				"comment_id": 115,
				"body": "А во, заметил активность по ZeroTalk++, жду в GitCenter",
				"added": 1549444867
			},
			{
				"comment_id": 116,
				"body": "> [geekless](#comment_111_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Залил: http://127.0.0.1:43110/1H3qtUJRrghDHpY89CBeueVAZw8xbHuDLr/\n> Пока еще без каких-либо инструкций по развертыванию и разработке.\n\nФоркнул, буду смотреть на досуге",
				"added": 1549540296
			},
			{
				"comment_id": 117,
				"body": "Мдауж, неплохо так проштормило зеронет спамом. А еще ругаются на модерацию, как потом иначе все же в этом шуме найти хоть что-то полезное. Хотя конечно согласен, где есть ниточки контроля, там всегда будет злоупотребление полномочиями",
				"added": 1549540943
			},
			{
				"comment_id": 118,
				"body": "> [gomzik](#comment_116_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Форкнул, буду смотреть на досуге\n\nАх, чорт, форки тут как-то иначе работают, не сохранилось ссылок на оригинал никаких.",
				"added": 1549541006
			},
			{
				"comment_id": 121,
				"body": "> [akiiro](#comment_7_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): Окей, представим у меня есть папка с набором всех страниц, всё сделано на css+html (как понял можно и js или то что мне написали ниже coffeescript) \n> Что я должен сделать дальше чтобы это появилось в zeronet \n> Спасибо что помогаете разобраться.\n\nЕсли у вас есть статический сайт, то можно создать пустой сайт\nhttps://i.imgur.com/a0ucLP9.png\nОткроется страница, где будет базовая нашлепка\n\nЗапоминаем адрес https://i.imgur.com/G2u3IGJ.png\n\nОткрываем папку, где установлен ZeroNet, идем в папку data/<address>/\nhttps://i.imgur.com/plZVYRA.png\n\nТам можно удалить все кроме файла `content.json` и скопировать свои файлы. После чего обновляем страницу, убеждаемся что наш сайт виден и готов, попутно видим сообщение о том, что файлы изменились, их надо подписать и опубликовать: https://i.imgur.com/ng1q4cP.png\n\nЖамкаем на эту кнопку, скорее всего будет сообщение об ошибке, но оно лишь означает, что ваш сайт еще пока никто не скачал, поэтому опубликовать не удалось. Это нормально, пока у сайта нет пиров.\n\nДальше можно делится ссылкой. Для тех, у кого установлен zeronet это будет http://127.0.0.1:43110/<address>\nДля тех у кого не установлен - через любой прокси сервис, например https://0net.io/<address>\n\nЕсли у вас провайдер закрывает порты и нет соединения через tor, сайт может не сразу скачаться, там уже можно сильно углубиться в технические особенности, но обычно со временем все таки начинает работать. Советую самому зайти на свой сайт через прокси сервис и посмотреть, как все работает\n\nВсе ссылки ведут в клирнет, на imgur, за это сорян :)",
				"added": 1550829259
			},
			{
				"comment_id": 123,
				"body": "Существующие движки далеки от функциональности вордпресса, никаких плагинов и других кастомизаций кроме как пойти и что-то сделать руками. К слову не упомянул, что каждое изменение на сайте нужно подписывать и публиковать.\n\nСамый распространненый сейчас конечно же ZeroBlog и его модификации, там есть редактор с базовыми функциями форматирования, не более, что либо вордпресовое искать не стоит. Итого у нас сейчас можно считать только два варианта - ZeroBlog, где есть UI для написания постов, сразу запилены комментарии и лайки, либо статические сайты через ручную верстку или генераторы. Второй вариант абсолютно лишен какой либо интерактивности со стороны посетителей.\n\nОбычные движки само собой работать не будут, так как в ZeroNet нет понятия серверного кода, будь то python или php или куча еще вариантов, которые работают в обычном интернете.",
				"added": 1551095594
			},
			{
				"comment_id": 124,
				"body": "Сайт открывается, картинки видны.\n\nЗапуск на прокси просто еще один способ улучшить раздачу сайта, прокси запущен скорее всего круглосуточно или почти, ваш локальный компьютер вероятно нет. Доступность сайта напрямую зависит от колчества скаченых копий",
				"added": 1551095707
			},
			{
				"comment_id": 125,
				"body": "> [akiiro](#comment_16_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): Если искать разработчиков для1) Cоздания сайтов с функционалом\\дизайном как у DTF и D32) CMS для более простого создания сайтов \n> Людей с какими языками\\знаниями нужно искать?\n> По тем ссылкам что скинул на всякий случай всё равно пройдусь и попробую разобраться смогу ли я со своими навыками что-то использовать, мне это в любом случае даст больше представления о том как что работает.\n> Спасибо большое за ответы, это упрощает.\n\nдостаточно только JavaScript и все что в него трансформируется. ZeroNet имеет много особенностей по работе с user-generated контентом, в том числе придется строить SQLite базы данных и запросы к ней, а так же для меня в принципе было сюрпризом как работает API, но я не настоящий JavaScript программист, вполне возможно, что есть еще где-то такие практики.",
				"added": 1551099162
			},
			{
				"comment_id": 126,
				"body": "Могу порекомендовать этот мануал - https://daniellmesquita.gitbook.io/the-truth-about-zeronet/\nОн охватывает большую часть особенностей строения так называемых зайтов, конечно самому читать вам может быть и не имеет смысла, как я понял, технический бэкграунд не самый сильный, но действующему JS программисту даст понять, с чем он имеет дело и как это отличается от обычных сайтов",
				"added": 1551099290
			},
			{
				"comment_id": 127,
				"body": "Каждый зайт работает в iframe созданый самим зеронетом, что позволяет сделать эдакий сэндбокс. Вместо ajax запросов у зайта в распоряжении есть возможность общаться с родитительским окном и выполнять запросы на чтение\\запись файлов или выполнить запросы на базе данных. Все это ограничено самим zeronet'ом в целях безопасности.\n\nСильно в двух словах :)",
				"added": 1551105352
			}
		],
		"3_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 119,
				"body": "Я может не до конца понимаю сути, но разве для каждого зайта не генерится новый идентификатор?",
				"added": 1550139412
			},
			{
				"comment_id": 120,
				"body": "> [bvn13](#comment_15_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): Генерится. Но тут это при чем? @gluckman говорит, что форум будет заранее известен провайдерам/зло-сайту.\n\nтак при входе на новый зайт у тебя непохожий на другие ключи, нужно явное подтверждение авторизованного zero id пользователем, в итоге как-то не очень получается задеанонить",
				"added": 1550220011
			}
		],
		"4_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 128,
				"body": "* Result:\n - Total: 31 tests\n - Success: 0 tests\n - Failed: 0 tests\n - Average speed factor: 1.54x (Fine)\n - Total time: 12.400s",
				"added": 1580902304
			}
		],
		"11_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 129,
				"body": "Принято :)",
				"added": 1584354524
			}
		],
		"16_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 130,
				"body": "Тем не менее, старая установка зеронет помнит пиров и поэтому я вот могу вам писать сейчас",
				"added": 1597158932
			},
			{
				"comment_id": 131,
				"body": "Свежую установку правда завести не удалось :(",
				"added": 1597158966
			}
		]
	},
	"comment_vote": {
		"2_19arYgVKguUamTqtYGu6T9FSUsr19CyEcG": 1,
		"2_1DB5vzATvqvQykj1zjL2xdMtYSqXc8cmP3": 1,
		"1_1JLvbi5na8gGR7B5ciEw3X69NzzBb21kBz": 1,
		"83_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"20_1369mox3kHxHXHNGi12QXxbtpXi78ZZqnD": 1,
		"91_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"110_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}