{
	"title": "À (pas) faire",
	"description": "Tous mes actes manqués",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 4,
	"demo": false,
	"modified": 1484172917,
	"post": [
		{
			"post_id": 3,
			"title": "Dérider les boudeuses",
			"date_published": 1484170263.949,
			"body": "Elles sont particulièrement répandues dans les transports en commun, mais on en connaît tous. Les boudeuses. Des femmes, souvent jolies, mais qui semblent affligées d'une irréductible incapacité à sourire en public.\n\nQue dis-je, à sourire. Simplement à ne pas tirer la tronche. Comme si la position \"repos\" de leur physionomie était de tirer les commissures vers le bas. Alors même que la science a reconnu depuis longtemps que sourire demandait moins d'effort que de faire la grimace. Et que c'était meilleur pour la santé.\n\nAussi, pour elles, pour leur santé, et parce que nous aussi on préfère croiser des gens souriants le matin, je propose le remède suivant : chatouilles _ad nauseam_. Ligotée comme il faut, et qu'on leur fasse rattraper des années de non-sourire en quelques longues minutes de fou-rire."
		},
		{
			"post_id": 2,
			"title": "Suivre ce type",
			"date_published": 1481840726.536,
			"body": "On en a tous eu envie. On est en voiture, on suit un mec. Genre route de campagne, jolie nature, forêt peut-être même. Et là, le mec de devant balance un truc par la fenêtre. On a même le temps d'entrevoir le logo d'une marque de fast-food dessus.\nEt ça démange, de ramasser précautionneusement le tout. De suivre le malappris jusque chez lui, et de lui remettre le colis en bonne et due forme.\nIl y a un risque de se faire défoncer la tronche à l'arrivée, aussi, et c'est sûrement pour ça qu'on ne le fait pas.\nMais on devrait."
		},
		{
			"post_id": 1,
			"title": "Ouverture (de la chasse)",
			"date_published": 1477166779,
			"body": "À l'attention du piéton urbain occidental. Oui, toi, là-bas. Qui vit à Lyon, Paris, Dublin ou Bruxelles. Ou une autre de ces villes qui ont la bonne idée de prévoir des espaces dédiés aux cyclistes.\nTu les as forcément déjà remarqué, ces espaces : ils sont souvent sur les trottoirs, ou juste au bord, et arborent de magnifiques dessins qui - sous le bon angle - ressemblent à ... des vélos.\nEt pourtant, c'est plus fort que toi, tu ne peux t'empêcher de trouver ça bien pratique : il y a moins de monde que sur les trottoirs, et tu peux y marcher à ton rythme. Bien entendu, rien n'étant parfait en ce bas monde, tu dois parfois subir les sonnettes insistantes de ces pisse-froids de cyclistes. Il t'arrive même de devoir te pousser - non sans un petit mot aimable pour ces ...nnards.\nBref, piéton qui abuse des pistes cyclables, je voulais ton attention. Non pour te dépasser sans me prendre une portière, cette fois, mais juste pour te prévenir. \nParce que, oui, c'est l'automne dans l'hémisphère nord. Qu'il y a des feuilles par terre - notamment sur les pistes cyclables, et qu'il pleut. Chimiquement, le résultat est sans appel : ça fait des feuilles mouillées. Le truc le plus glissant après l'huile et le verglas. Et que je veux bien être ton obligé, mais pas au point de me foutre au tas - au risque d'un _gros_ bobo - pour tes beaux yeux.\n\nAlors prudence, parce que je sens que je serais loin d'être le seul cycliste dans ce cas. Je vais continuer à prévenir, mais si tu persiste à remonter le boulevard en regardant d'un air niais le mec qui descend à pas loin de cinquante en sonnant frénétiquement, tu risques d'avoir un peu de casse. Parce que moi, parce que nous, on n'évite plus. Passées les somations d'usage, on tient le cap. Tu risques d'avoir à te jeter de côté. Tu comprendras un peu mieux ce qu'on vit quotidiennement. J'espère.\n\nBisous quand même."
		}
	]
}