{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1567341551,
			"title": "this is how nofish really looks like",
			"body": "https://gofile.io/?c=3LfrO9",
			"added": 1567341550
		},
		{
			"topic_id": 1567411647,
			"title": "Do you believe that extraterrestrial life exists in the observable universe?",
			"body": "Due to its insane size and number of galaxies, stars, planets i have no doubts that extraterrestrial life exist in our observable universe.",
			"added": 1567411645
		}
	],
	"topic_vote": {
		"1567341551_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": 1,
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 1,
				"body": "He's the Vitalik Buterin of ZeroNet",
				"added": 1567324526
			},
			{
				"comment_id": 3,
				"body": "there are only two infinite things in this world\n\n1) the universe\n2) gitcenters iq",
				"added": 1567325238
			},
			{
				"comment_id": 4,
				"body": "Joke aside !!! I don't know how ZeroNet and Python really work in detail and usually only understand a third of his technical posts but i'm convinced that he is always right.",
				"added": 1567326288
			},
			{
				"comment_id": 5,
				"body": "> [bigbadbob](#comment_508_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): you forgot stupidity...  stupidity is infinte..   i can prove it ;)\n\nGitCenters IQ - Stupidity = ?",
				"added": 1567326785
			},
			{
				"comment_id": 7,
				"body": "this is gitcenter: https://gofile.io/?c=fkfVtw",
				"added": 1567414254
			}
		],
		"1567252251_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": [
			{
				"comment_id": 2,
				"body": "Let's hope duende hasn't convinced him to commit suicide",
				"added": 1567324788
			},
			{
				"comment_id": 14,
				"body": "> [xcape2net](#comment_370_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Do you mean h3bhkj5gqz4n3pjm ? His last post was 6 days ago.  I'm more worried about quantumkitty, who hasn't posted in about 5 weeks.\n\nshe posted her latest video 19 hours ago",
				"added": 1567496987
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_507_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): would be funny for him to see a thread about his absence if he does come back. lol\n\nit looks like duende has been discharged from psychiatry\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1567353817_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU",
				"added": 1567497653
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 6,
				"body": "i somehow knew that this attempt would going to be a successful one",
				"added": 1567329160
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 8,
				"body": "> [defconzero](#comment_8_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE): Look in the mirror, dipshit.  You think you belong here?  You'd die in 3 days without civilization keeping you alive.\n\ni think you belong to the mute list, bye :-P",
				"added": 1567422346
			},
			{
				"comment_id": 9,
				"body": "> [thricewizened](#comment_4_16Q4zo3owDu3kfxGXKBd2qbMsShLhNg3gu): You don't follow CIA leaks? \n\nnope",
				"added": 1567422414
			},
			{
				"comment_id": 10,
				"body": "> [kidcourageous](#comment_89_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): I mean obviously it has to but chances are they don't give a shit about us. I mean look at our species, man. We can't even get along.\n\ncould be indeed the case",
				"added": 1567422509
			},
			{
				"comment_id": 11,
				"body": "some scientists believe that a Bootes Void is caused by a Type3 civilization",
				"added": 1567422817
			},
			{
				"comment_id": 12,
				"body": "> [lumenwood119](#comment_4_1Hywym67BRyWThexTcfYNEPVMCkXFP4CwN): Sure why not? If there is life somewhere out there in the void, it's going to be 1 of 3 types IMHO.1) Some kind of Lovecraftian entity straight outta the Warp2)Hyper-advanced spacefaring civilization with planet-leveling capabilities, and when they discover us, they with either immediately annihilate us or pass us over saying \"Oh, they aren't capable of sustained space travel and interplanetary conquest? They haven't passed through their Great Filter. Let's leave them be for a couple of centuries to see if they catch up and join us in JOLLY COOPERATION!!!3)Some kind of fungus or early bacterial life form swimming in Primordial Ooze.\n\nPerhaps caused by self replicating spaceships invented billions of years ago by a civilization that no longer exists",
				"added": 1567425897
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 13,
				"body": "self righteous pricks will probably misuse it to report people they don't like",
				"added": 1567451724
			}
		],
		"1567100668_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 16,
				"body": "> [theecollector](#comment_45_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): Black people must be sociopaths then... you cant have even a remotely reasonable conversation with them\n\nhttps://www.youtube.com/watch?v=bg41b_l6NNM",
				"added": 1567502003
			},
			{
				"comment_id": 17,
				"body": "> [bigbadbob](#comment_545_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): wow.  That's pretty bad.  lol.  Smoking is bad, but I'm surprised he didn't get shot or something.\n\nmaybe it's staged. however it's funny and the cigarette slapping sound is hilarious",
				"added": 1567552049
			}
		]
	},
	"comment_vote": {
		"3_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": 1,
		"509_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"508_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"7_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": 1
	}
}