{
	"next_post_id": 9,
	"next_comment_id": 2,
	"next_follow_id": 2,
	"avatar": "generate",
	"user_name": "Atdandotnet",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1612466266,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1612466361,
			"body": "Testing this zeronet thingy. ",
			"date_added": 1612466359
		},
		{
			"post_id": 1612680861,
			"body": "[ABSOLUTE PROOF OF ELECTION FRAUD ENGLISH WITH FRENCH SUBTITLES. Documentaire Censuré. Preuve Absolue de la Fraude Electorale USA 2020](https://open.lbry.com/@MKWhiteRabbit:3/🛑ABSOLUTE-PROOF-OF-ELECTION-FRAUD-VOSTFR-🇫🇷Google-🛑:b) \n \nMike Lindell released a new documentary today where he lists the material instances of fraud in the 2020 Presidential election.\n\nThis effort was a culmination of the work of many individuals who wanted to expose the fraud in the 2020 election for President of the United States.\n\nMike Lindell, famous for his life story and passion for his company “My Pillow” and a good friend of President Trump, released a documentary today surrounding the 2020 election. In the documentary, Lindell spent millions in an effort to get out the truth about the 2020 election.",
			"date_added": 1612680858
		},
		{
			"post_id": 1612763310,
			"body": "[Talk at FOSDEM '21 - I2P, blockchain and the application - an Introduction: Diva.Exchange](https://odysee.com/@diva.exchange:d/diva-exchange-fosdem-21:c)\n\n[diva.exchange](https://www.diva.exchange/en/)\n\nImagine: I2P (aka \"Darknet\"), a highly energy-efficient, new and fully distributed storage engine, some basic banking business logic and a fresh user interface.\n\nResult: a highly privacy-respecting, in theory secure, yet very slow, personal bank. Meet diva.exchange - the first non-profit, non-corporate, very-small-tech and research-driven association developing \"Free Banking Technology - For Everyone\". All licensed under AGPLv3+.\n\nThe presentation is about the technology stack of the truly distributed free banking technology \"DIVA\". It's also about the fact that \"distributed technology\" does not offer anything like a \"business model\" in the old-fashioned-cloudy way. It's about the overlay network \"I2P\". It's about the distributed storage engine \"Iroha\" and the challenges with a very slow network. It's about banking business logic, the user interface and its challenges being fully distributed. And it's about the research co-operations in Switzerland.\nDIVA is small and local tech for everyone.",
			"date_added": 1612763306
		},
		{
			"post_id": 1612926285,
			"body": "[NEW: eepHttpd - easy-to-use tool for setting up P2P I2P Sites (eepsites)](https://github.com/eyedeekay/eephttpd)\n\nNow available: P2P multi-share I2P Sites. Users can now download and seed eepsites. (Both ends needs to run eepHttpd ) \n\nThis serves simple static sites directly to i2p via the SAM API.\neepHttpd is the easiest tool for hosting new sites on the I2P network from your own computer(As long as they are mostly static sites, for now).\n You start the application and it sets up a directory in a logical place on your system. It has some neat features to make your sites available to people who want it even when you aren't available to host it.\n Probably the most cool thing that it can do is that it can mirror most github pages as long as they are statically pre-generated. The I2P Site itself is actually just a clone of the github repository, making the act of mirroring the site also the act of mirroring the source code. If you have an account at i2pgit.org or git.idk.i2p then you should use this to self-host your gitlab pages.\n\n Use this for things You want to SHARE ANONYMOUSLY with a large audience, not for things you want to keep secret. This allows people to clone the site in order to mirror it.",
			"date_added": 1612926280
		},
		{
			"post_id": 1612927207,
			"body": "[By referring to COVID-19 vaccines as “vaccines” rather than gene therapies, the U.S. government is violating its 15 U.S. Code Section 41, which regulates deceptive practices in medicine.](http://tapnewswire.com/2021/02/by-referring-to-covid-19-vaccines-as-vaccines-rather-than-gene-therapies-the-u-s-government-is-violating-its-15-u-s-code-section-41-which-regulates-deceptive-practices-in-medicin/)\n\nBy referring to COVID-19 vaccines as “vaccines” rather than gene therapies, the U.S. government is violating its 15 U.S. Code Section 41, which regulates deceptive practices in medical claims\n\nThe mRNA injections are gene therapies that do not fulfill a single criteria or definition of a vaccine\nCOVID-19 “vaccines” do not impart immunity or inhibit transmissibility of the disease. They only are designed to lessen your infection symptoms if or when you get infected. As such, these products do not meet the legal or medical definition of a vaccine",
			"date_added": 1612927201
		},
		{
			"post_id": 1613128609,
			"body": "[The Great Firewall of...America? WTZ!](https://invidious.tube/watch?v=38za1LYj2XQ)\n\nThis past week on Feb 2 - Feb 7, 2021 a massive attack was conducted on encrypted services, particular VPN's. VPN traffic was throttled to near unusability.\n\nBasically in 2021, the Great Firewall of the USA was turned on. And then abrubtly turned off.",
			"date_added": 1613128602
		},
		{
			"post_id": 1613196897,
			"body": "[What Do You Actually Agree To When You Accept All Cookies](http://www.conradakunga.com/blog/what-do-you-actually-agree-to-when-you-accept-all-cookies/)\n\nYou almost certainly haven’t read the Windows EULA. You haven’t read the iTunes EULA. You haven’t read the Linux GPL, or the licenses of any software.\n\nDon’t worry. This is normal. You are not alone.",
			"date_added": 1613196889
		}
	],
	"post_like": {
		"1Dtg9doZmBFr7m4PQbNrFm9aCxk8KMU9xL_1612046813": 1612688605,
		"1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN_1613626367": 1613774656
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "hi :)",
			"post_uri": "18FN9H4bP3VgzFaffw1ZGb82LtwWE4fyA4_1612472042",
			"date_added": 1612504137
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1HvtaEP4h88QTu4Pv1a7SDuq1H6v7TDgsN",
			"user_name": "I2plus",
			"date_added": 1613774687
		}
	]
}