{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1543487465,
			"title": "In files menu Stop/Resume button and resume files download with browser request",
			"body": "In Android/PC/Laptops and seeding files it would be easier in a files menu Stop/Resume button and resume files download with browser request.With browser request if the user close the browser the file download are discontinue.The +SEED button in KopyKate or ZeroUp It is difficult to react.And the users often do not know how this thing works. It would be much simpler from browser request default all files download will resume like the +SEED button do it.And the user in Files menu can Stop/Resume or delete the file if not want to download it completely.Like download managers,torrent clients do it. This is a long time working setup in all other programs (U torrent, qBittorrent,Vuze,Deluge,FlasGet,IDM,Free Download Manager,etc.)",
			"added": 1543487464
		},
		{
			"topic_id": 1559424911,
			"title": "Non stop 24/7 ZeroNet free seed server download system idea",
			"body": "#Why\n\n-MORE ZERONET USERS AND ZITE ADMINISTRATORS.AND MORE QUALITY ZITES!\n\n-ZeroNet and similar platforms have a big problem.Especially large files and contents are many times are not avaiable.Or not immediately available. Users can't wait for this.And website owners goes elsewhere.\n\n-We can make a NON STOP FREE auto seed system.We have the techology.\n\n-ZeroNet have problems with large file sharing. Lot of large files are dead or low seeded.\n\n-The sytem will be more resistence for censorship.The site and file owners get more protection.Users get more  bandwidth.\n\n-Site and file owners can reducte the server costs. The are no case it goes unnecessarily the server. Only whaste electricity without useful uploading.\n\n-Countries where ZeroNet are blocked there would be more chance this way to get the files.\n\n#The idea \n\nIf the site or file owner can upload the content automaticaly to another user without waiting for a downloader.If the file have only one seeder.Site or file owner can save electricity cost. And we can make a guarantated 24/7 seed for every file.\n\nExample we make a storage in a seperated folder in every ZeroNet client  where the site or file owners can upload files to another users compjuter.Users who allow this option are get extra bandwidht from this storage.From every uploaded amount of data the user get the same Byte,MB,GB back wehen the user want download a single file.This option the site or file ownwrs are free.From another users are get extra bandwith and save time. If the user allow bigger disk space. She get faster more amount of data access from uploaded files.\n\n#How its works\n\n#The users\n\nThis is an allowable feature!\n\nThe zites and files are downloaded the same way from the uploader machine interaction automatically but seperated place (folder and in the client) from the another user (seed server) copjuter.\n\nExample credit minnig zites in seperated. Everything looks the same whay if the user download a file or zite. Only this is get a distinctive sign.And the files and zites are downloaded a seperated folder.\n\nThe user get from every uploaded data extra Byte,MB,GB (coins) from this storage.What he get back from this storage when he download files.\n\nIf the user allow too to daily automatic way upload files too she get more faster extra Byte,MB,GB (coins).\n\nFrom users the are two single button (Allow credit minning).And another button what allow auto upload If the file have only one seeder.Or not have 2.0 ratio.For much more extra and faster (file coins).\n\n#The site and file owners\n\n\nThis is an allowable feature to site and file owners too!\n\nFrom the site or file owners in ZeroHello files menu/Files where are the ratio and zite name.And seperated the optional files we make a simple option.If the file have only one seeder.Or not have 2.0 ratio.The file are start autamatic way upload in the system.\nIf the file owner (not the zite owner) upload a file from another user zite.She can enable this function with the current file.\n\nIf a site owner have a veary large zite where another users upload large data.Optional large files can uploaded to another users. Example ZeroUp.So zites what allow from another users and not just the zite owner to upload files.It is possible to set up a limit.\n\nWhat are you think about this? \nA similar idea, or plan?",
			"added": 1559424909
		},
		{
			"topic_id": 1564409306,
			"title": "Keeping files online forewer using the Safe Network (chunk+copy) file storage technology. What do you think?",
			"body": "I was thinking, we have a techology. Which we can keep all files online 24/7 cheap and easy way using unlimited high bandwidth even forever. And we can give more security and resistence for  censorship and observing. Then why we not integrate it in platforms like ZeroNet or IPFS? You see the chance (or have a plan) that in the near future the ZeroNet a much more effective one file storage mechanism will be use?\n\nIs your feature request related to a problem? Please describe.\n\nFile Storage Problem:\n\n  - I'ts not possible to keep online the files 24/7 without non stop running the compjuter.\n  -  Large (Optional Files) goes fast offline. But the system are indexed them forewer in the system.\n  -  If the file are not popular and have periodic downloads the bandwidth are limited.\n  -  Must wait all File/Zite owner to a downloader too keep the file online. Without this not possible to upload the files in the system. And reduce minimal the server electrocity costs.\n  - Users must wait sometimes too long to get a file. Or the file are newer get downloaded\n  -  In clearnet all files 24/7 avaible. With high download speed.\n  - Playing problems with streamable HTML5 media files. Wheare users need to get the files directly, high download speed, with stable download process.\n  -  If a user have low upload speed. And sharing lot of files. Another users can download the files from other sources. So the bandwidth will be high an unlimited.\n\nSecurity issue\n\n- Tourgh VPN, TOR ALWAYS MODE, or PROXY with test downloads i'ts possible to monitor the current user tracing back the download/upload traffic if only one people seed the current file. If tourgh 1 tunnel this data collected to serval users I'ts not so easy to track back the site or file owner.\n\n- Less visited optional files not resistence for censorship. If the owner are shooted down the file are dead. So with the current setup its possible to shoot down large sites. Wheare the zite have many visitors. But incude many optional files what have variable seeder. And wheare wee need minimum 1 seeder who have all files. If wee need too keep all files online. If we talk about large services the chance is getting bigger only the site owner have all files.\n\nDescribe the solution you'd like\n\nDescription of the technology: https://www.youtube.com/watch?v=U1ffmf6z50E\nAnd\nhttps://www.youtube.com/watch?v=RdGH40oUVDY\n\nA storage system where stored all files in chunks in a encrypted data storage. And multiple copies of the files. In the ZeroNet usrers compjuters. Distributed among themselves the data. And when a user need a file collect the pieces from another ZeroNet users. The users are store only chunks and not the full file. So their does not have to wory the are storing illegal content. And file owners can upload to this storage and does not have to wait a users who download the current file or zite and help to seed it. This is a secondary storage what helping and fix the issues with the current storage system.\n\nDescribe alternatives you've considered\n\nhttps://safenetwork.org/\n\nSimilar techology\n\nhttps://freenetproject.org/",
			"added": 1564409303
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1519472222_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "Its works like torrent. The problem is if have 1 seeder (you) and the file want do download few usres at different times.\n\n-1.The +Seed buton in Zites like ZeroUp or KopyKate they are difficult to react.Average user does not know what is it.\n-2. From browser request the file download not resume if you close the browser.\n-3. In files menu you can not controll this process.You can delete or pin files, but there are no other features.\n\nThis point the game is ower.You will see only 1 seeder you.And the downloaders does not get your file.The avarage downloader only see she want download a file what never finished.\n\nSee  [In files menu Stop/Resume button and resume files download with browser request](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1543487465_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/In+files+menu+Stop+Resume+button+and+resume+files+download+with+browser+request)",
				"added": 1544031065
			}
		],
		"1543487465_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_527_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Auto-resume of all partial files (including optional, and big) seems good, except the case you watch some big video (optional file) which you do not like and do not want to be completely downloaded.Moreover the site sometimes do not offer button to delete the file + manual delete via ZeroHello/Files for each unwanted file is waste of time.\n\nAuto-resume of big files only work in zites  using the +Seed button (KopyKate,Zero Up).Without the +Seed botton the download will not resume.Or special zites like IFS Intergalactic File Server and ZeroNet central forum.Zites what have special integrated javascript coded download  system. IFS Intergalactic File Server and ZeroNet central forum always resume download all files from browser request and works perfectly.KopyKate,Zero Up file download resume only works with the +Seed button.Without seed button if you close the browser the download will not resume.With selfmade Zites default the files download are not resume.And avarage users and amateur site administrators can not fix this.If a user want download a video or etc from a zite.And the file does not have seeder from browser request the user never get the file. IFS Intergalactic File Server and forum working perfectly with lot of seeder.Zero Up,KopyKate and selfmade zites have very few seeders and lot of files without seeders.In the 0Net software files menu you can not controll it to stop/resume file download.The file will added in the menu but its will never downloaded.There is no option in the software to finish it.The are a pin and delete button.The pin file button practically nothing help.This problem should be resolved in the ZeroNet software.And not separate from websites.Important basic functions are missing.For average users and server administrators,seeders It's not good this way.",
				"added": 1544119481
			},
			{
				"comment_id": 3,
				"body": "In the Files menu we need to seperate the downloading and not finished files.And in the right 0Net icon we can make a easy window what show the downloading not finished files if the user do not want to finish it can easily delete it to save his download speed and disk space (in mobile devices,laptop,PC) with pause and dele button too.Or when downloading something a icon in taskbar what open the Files menu etc.Withot the user need closing the current page to access the file menu.And showing easy if not finished downloading in progress.And forget +seed button,javascript codes and and other difficult used,and integrated scripts in zites.Make Zero Up,KopyKate and self made zites more easyer for awarage users and amateur zite developers.And forget half finished files from browser request too, and always finish it if the uset not delete or pause the file.",
				"added": 1545099874
			}
		],
		"1559424911_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA": [
			{
				"comment_id": 4,
				"body": "If the file or site owner  user „A” can upload files and zites to user B,C,D,E.This can give high download speed to all files.Even if the seeder have poor upload speed.And its possible to keep the files online without waiting for a downloader if the PC are turn OFF.In the current system the user must wait someone who download the file.And there's no solution to upload the file in a decentralized shared storage without waiting for a downloader.And keep it online,give this way more download speed from another users.Similar working setup use Freenet,Safe Network, so the idea are currently use existing setups.Many copy of the files the only way to keep it online 24/7 and give the users high download speed.Keep it decentralizated and free,resistence for censorship.And give more health all files.Keep the file online cheap and easy if the user turn off his PC without waiting for a downloader.Another thing If „A” upload the same copy the file to B,C,D,E.After a long time If only „E” have the file.He can restart the process untill the site owner it doesn't delete the content at all.So files will be available over years later.\n\nThe problem a simple idea for many people is difficult to understand.And the existing setup are not finished.The large file download system have critical bugs and deficiency.And this make sometimes impossible to download files and keep alive with the existing setup.From this ZeroNet for years not fixed.So I don't see a chance in the near future to integrate one more advanced file storage system.Because even the current setup file sharing major issues are not fixed about long time.\n\nIn the clearnet the file or website owner upload the file or website.And the users non stop 24/7 can download the content and files with high download speed.A simple user why would he come here suffer with slow download,dead unseeded files.When the clearnet he get this non stop 24/7 with high download speed?\n\nThe file owners are see that there are few visitors.Those who want to download files many time are failed.ZeroNet half finished the downloads or simple failed.And downloading files are complicated!All files even popular optional files are low seeded.So it's not worth it setup poular webpages what use large optional files.\n\nZeroHello and all most popular zites with 1000 seeder/current time.It is very few user for a complete network.And it won't change without stable large UNCENSORED services where the users get fast high download speed all content.",
				"added": 1561785728
			}
		],
		"1564755065_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 5,
				"body": "With IPFS and ZeroNet have a big problem.The users can not upload files in the system. And the are no way to setup what keep the files in a minimal guaranteed bandwidth untill the owner are delete it.And especially with IPFS the sites and files 98% are dead.\n\nWe must use a hybrid file storage system what keep the files online to solve this.\n\n1.strorage what keep online the file whit a fix badwidth.Using and keeping fix copies of the files.Example fix 4 copies of all files.\n[Storing the same file multiple chunks like MaidSafe](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1564409306_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA/Keeping+files+online+forewer+using+the+Safe+Network+chunk+copy+file+storage+technology+What+do+you+think)\n\nor\n\n[Storing the full file with serval copies](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1559424911_17ig1FpuxY5dVESXxUpYN88oxLzZNTLpJA)\n\nWith the first storage we can operate 24/7 clearnet sites free and forever what can index google too.This would be a deal for all users who looking a shared hosting service for free.And we would get a lot more users.Because it would be a free one anonymous and easy setup third party free censor resistence service.What a real alternative for the  untrusted third party and paid services which has a problems everywhere.\n\nBut this is not easy we must integrate a working one.This  is not a good thing to all users must wait too long time using low download speed.Or try to download lot of dead files.And the file and site owners see the files goes fast offline.Its not the way currently for setup professional sites.\n\n2.Storage the existing IPFS or ZeroNet storage when more users want the files can serve all lot of unlimited users.This is ready.",
				"added": 1564828426
			},
			{
				"comment_id": 6,
				"body": "https://safenetforum.org/t/maidsafe-vs-freenet-i2p-ipfs/9409/24\n\nFrom ZeroNet or IPFS the users can not upload files or data in the system.So when nobody download the file or the file are less popular.If the user turn off his PC the file goes offline.ZeroNet store only the link forewer even if the file has been unavailable for years.This way the users can't operate stable sites.I does not know in IPFS are this issue are solved.\n\nMaidSafe or Freenet store serval copies of the chuncked file.MaidSafe make shure 4 copies are 24/7 are exit frorever.MaidSafe still alpha but mutch more looks like behinde the team are more better than Freenet.So the file exit in the system forever with a guaranteed bandwidth until the owner are delete it.Here are upload the file the user in the system.And the system keep online the files.\n\nAnother 3. way we can store the full file.Similar to the second setup.But there is no existing protocol for this yet.And maid one for ZeroNet without using a working integration it would be too complicated.",
				"added": 1564830095
			}
		],
		"1588331503_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 7,
				"body": "Whose hobby to make homemade fireworks a useful pages for them.If they had been created with malicious intent the sites would not have been talking about fireworks.They were created to help those who have this hobby.Most of it is a collection of professional sites and files.",
				"added": 1588366178
			}
		]
	},
	"comment_vote": {}
}