{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"19_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 1,
				"body": "香港学生的抗议是活生生的具有最高价值的借鉴案例：\n如何真正超脱各方洗脑，尤其是表面非常有道理，很有善意，很长远的，\n最后上升到牺牲生命的高度的洗脑，人的头脑非常的幼稚，\n特别容易被群体或者幼年小学中学大学的群体思潮洗脑控制。\n所有想控制下一代社会走向的重大势力对这些教育的灌输都投入巨大。\n\n不能具备数学反证法逻辑思维能力的人都容易被情感，价值，群体裹挟而洗脑。\n\n1. 台湾是如何做到送中而独立的，为什么香港就做不到？\n在香港没有相关法规法律的时候，一样发生送中，或者送英国\n（前期案例是按照英国惯例，只需要通知香港警方合作，\n大陆或者英国当年可以直接到香港抓捕有关嫌疑人，\n这些都是早就多次发生过的案例，\n根本不需要画蛇添足加一个法律争议。）\n闹了这么久的反送中，在历史案例面前根本就毫无意义。\n泰国1994年早就法律禁止性产业了，\n实际落地如何？\n表面的法律没有执行的成本，根本就执行不下去才是求实精神，\n被表面文字法律僵化宣传的人群，充分表明了他们的弱智智商。\n\n2. 各种民主自由的空洞名词都是主流洗脑宣传，很难落地，\n看看现实中鼓吹民主自由法治的美国，\n性大亨一样被监狱里面自杀掉还无法用法律伸冤，\n有钱人脱罪的案例数不胜数，\n底层被冤枉进入私人监狱满足监狱入住率合约，\n哪里来的法治？\n民主的美国，印度，都是合法腐败遍地，\n官员合法游说牟利。\n再看历史上：\n比利时国王利奥波德二世，同时是民主典范\n（先于美国给妇女选举权，禁止童工，普及义务教育），\n同时是非洲刚果的独裁暴君。\n这个真实的历史案例证明：\n民主根本就不是单个的领导人的因素，\n也就和个人的品德，\n邪恶善良这些概念毫无关系。\n而是被所在的地区中层的利益阶层权力架构分布具体形态所根本决定。\n要争取民主，应该去加强那个地区的中层权力才能实现。\n在中国历史上，汉朝早期的无为而治就是类似君主立宪的民主形态。\n可是，既然民主是中层的特权，\n中层发展到后期会壮大到垄断形成新的高层独裁的时候，\n就会发生九龙治水，多个中层为了争夺最高力量而恶性竞争，\n在竞争中对底层杀鸡取卵。恶化到最后，逼迫贫富极端分化产生的赤贫造反。\n明朝的东林党人中层民主就是这样把明朝给灭亡了的。\n各个朝代大都如此，康熙末期也是差点出现这样的情况。\n\n这个时候，民主就不再是对底层最友好的制度，对国家最有利的结构。\n如同古罗马选举独裁的凯撒也要抛弃民主的元老院，\n德国选举希特勒抛弃民主一样。\n\n民主在一定初期可以放松管制激发社会活力发展经济，\n但是到后期就不会起到这样的作用，\n利益的博弈会推动制度变化，\n这是历史的必然。\n不能顺应社会利益格局变化，\n僵化被洗脑只能被利用来作为炮灰。\n\n自由在美国的有选票的底层就是个笑话：\n无家可归，无钱看病哪里来自由。\n大街上被抢劫的人自由何来？\n\n2. 无知的大众并不必然掌握真理：\n一夫当关万夫莫开，\n万头愚昧的羊不可能胜过一只占据关口的雄狮。\n很多人在以为群体里面无需负罪责而发泄暴力怨气，\n都是愚蠢的贪婪，\n在香港有各个国家代表组成的监警会，\n这个监警会就在为香港警察的正当执法提供最后的证明。\n如果香港警察真的哪里过度了，违规了，早就发声了。\n想暴力破坏公共财物抢劫商铺后脱罪，还要合法化，\n还要得到荣耀，通过这种形式逼迫得到事务的控制权，\n等于是夺取香港实际治理权力，\n做梦吧，有此一例开头，只要能欺骗大多数无知底层，\n就能实现控制力？\n那才会不停的变动，永无止境的动荡，永远不得安宁。\n为什么新加坡专制而成功安宁，就是这样的原理。\n\n3. 所有的事件背后都是大国利益博弈：\n因为没有足够的经济利益支持，\n实施这些抗议的成本就无法继续。\n而数学里面，利益的博弈本身的最佳长期策略就是一报还一报；\n破坏了法律的罪行一定会在一报还一报中实现。\n一报还一报的策略和道德完全无关，\n而可以从利益博弈规律中产生道德的观念。\n先后顺序至关重要。\n不少的邪教都用空洞的道德来鼓动他人牺牲卖命，\n而其自身却离得远远的收获果实，\n这些人冷酷无情，玩弄道德教义习以为常。\n中国主权的香港地带，\n大陆人去了居然不安全，还算有主权吗？\n这样的现状可能长久吗？\n\n4. 国际力量的实际博弈证明，依靠美国都靠不住：\n证据：2016年南海仲裁案就是起点：\n菲律宾都看明白美国靠不住，转向了中国，\n香港算什么？\n美国错误的历史决策到今天很难支撑和中国大战，\n美国会为了不相关的遥远的外国人的利益\n而与中国发动生死攸关的核大战？\n正如中国和印度俄罗斯绝对不会为了寒冷的偏僻无人区争端而发动\n破坏自身核心利益的生死核大战一样。\n中国对于积累了70年发展成果的核心地区：\n珠三角地区与沿海一带心脏核心利益区，\n绝对不可能让任何威胁存在：\n香港与台湾正处于此位置。\n不能换位思考认识到对方的核心利益，\n只提自身要求，逼迫对方顺从自身，\n可能吗？政治是互相妥协，互相照顾对方的核心利益。\n这些鼓动破坏妥协推动牺牲的宣传全部都是最坏的家伙。\n应该推这些家伙去第一线，不蒙面。\n连基本的政治利益都不懂的大众，智商多高可见一斑。\n\n5. 香港驻军一直在，无需从外地调军队，\n早就有试图冲击军区的人，\n已经见到可以立即开枪的警告，至今不敢靠近。\n这都已经确证了香港事件最终的走向，\n三鼓而泄气，最终逃不过罪责。",
				"added": 1569772542
			}
		],
		"1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 2,
				"body": "up to remark my access",
				"added": 1572799239
			}
		]
	},
	"comment_vote": {}
}