{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1561983082_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v": [
			{
				"comment_id": 1,
				"body": "> [filips](#comment_37_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): I don't know if SegWit is supported, but there is PR for multiple cryptographies:https://github.com/HelloZeroNet/ZeroNet/pull/2053 [...]\n\nWhich elliptic curves will be supported, those that OpenSSL supports?",
				"added": 1561985831
			},
			{
				"comment_id": 2,
				"body": "> [gitcentermobile](#comment_11_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo): All that computers can implement. I've updated the FAQ just in case.\n\nHow will the ZeroNet client know which elliptic curve or other crypto an address is using?",
				"added": 1561986886
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_482_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It just tries different cryptographies until it founds one that works.\n\nThat's not a good solution ... here are some numbers one could use in the addresses:\n\nhttps://github.com/openssl/openssl/blob/8bbeaaa4fc12f8b00fbea4dc649ef74b59f73b17/crypto/objects/obj_mac.num\n\nOr use your own numbering system. For example secp256k1 = 0,  curve25519 = 1, and on.",
				"added": 1561989210
			},
			{
				"comment_id": 4,
				"body": "In general I'm not sure what the benefit would be of supporting multiple asymmetric ciphers and its implementation should not be rushed.",
				"added": 1561989550
			},
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_483_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Why is it not good?\n\nIt's just much better idea to have a byte dedicated to the cipher that's being used so you don't have to try all the ciphers that are implemented.\n\nBut again, I'm not sure what the benefit is here.",
				"added": 1561990155
			},
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_484_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): The problem is compatibility with the current version. The Bitcoin addresses & privatekeys should be supported without any modification. And then... how is Bitcoin different from anything else?\n\nAre people really using their Bitcoin addresses for ZeroNet sites? I thought we only used secp256k1 for its use in Bitcoin not to be compatible with Bitcoin addresses.",
				"added": 1561990350
			},
			{
				"comment_id": 7,
				"body": "> [ict21](#comment_17_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v): not really as a wallet, but you can recieve donation via your zite-address, so a sewit address for a zite would be nice. [...]\n\nThis could also be fixed using a donation address in the content.json file. No need to support different crypto in ZeroNet",
				"added": 1561991149
			},
			{
				"comment_id": 8,
				"body": "> [ict21](#comment_18_1EBYmm4sYxPoUVKAYFLfmYR6opizGGmM8v): i would appreciate it , so it is \"one address to rule them\" (import to bitcoin-wallet, signing, verify, encrypt) etc.but if not... so shall it be :)\n\nWe'll see, but I think it's better to not implement something like this unless there's a security risk with secp256k1 but then we should carefully pick a possibly better curve or other assymetric cipher, else we're just making ZeroNet harder to maintain and more bloated for no good reason.",
				"added": 1561991622
			}
		]
	},
	"comment_vote": {}
}