{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1524997617_1CcoRvm8AhLxYLtYoXwwzobh74Kzc2UcBb": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1522450733_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": [
			{
				"comment_id": 1,
				"body": "Well... \nWhat do you want?: Privacy + Anonymity\nHow much do you want to pay? \nNice VPN and why? : ProtonVPN\n\nThose are the questions you should do.",
				"added": 1525357272
			}
		],
		"1525405825_1Jt6aamh4UWpSRG421JivqanL5SQc7xLAX": [
			{
				"comment_id": 2,
				"body": "> [apapapp](#comment_5_1BHcv5eMFiza4gCBXmPXwxMLhF9oodThhD): The Chinese government definitely knows about Zeronet. Not long ago they began to block Zeronet's default port (I think its 15441), and even earlier they blocked the zeronet.io website. IPFS got a similar treatment, and I believe that its restrictions on zeronet is more of a preventive procedure than an act out of fear. Zeronet never had a big impact in China.  Those who still use it and regularly visit the Chinese forum are mostly spammers, conspiracy believers, and followers of the Fa Lun Gong cult.\n\nCan't they use Tor? Doesn't it circumvent gov. censorship?¿",
				"added": 1525433624
			}
		],
		"1525698971_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": [
			{
				"comment_id": 3,
				"body": "Isn't it just right to send a password protected file??\nYou are looking for a shared \"ZeroDropbox\" folder where each authorized user has the same private key (or something like that. dont take me too serious guys..im a n00bo)",
				"added": 1525715221
			}
		],
		"1525800997_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 4,
				"body": "Tea is better. My life went super good once I left sodas (sugar in general) and coffee.\nNow I take 2 or 3 teas /day, ... but its great. Better than shit. Im ok :>",
				"added": 1525808092
			}
		],
		"1525902420_1Dy3DRM8GHWFbNg3JmBmGX1GNGyCPvQ18a": [
			{
				"comment_id": 5,
				"body": "No, multitasking is not ok for humans... \nAdvice: Try to read some time each day. I usually try to read 2 or 3h a day. This helps me to gain focus on whatever I want. Read in the morning and work in the afternoon for example. \nHope I helped you  :)",
				"added": 1525904519
			}
		],
		"1526239496_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 6,
				"body": "> [thunder33345](#comment_54_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): Why not explain why is the 1gb of json data needed?\n\nyeah, more information so we can fully understand your problem :)",
				"added": 1526246311
			}
		],
		"1526319410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "PGP IS FUCKING OK.\nSTOP BULLSHIT",
				"added": 1526567330
			}
		]
	},
	"comment_vote": {}
}