{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1525110299,
			"title": "Clown World: Joy Reid",
			"body": "What they've done with Joy Reid isn't exactly \"new\". The Women's March on Washington was hosted by a non-white woman who had previously murdered and sodomized a homosexual man with a steel pipe, so an MSNBC host carrying out an online witch-hunt of homosexuals and slandering political enemies as homosexuals is a pretty minor offense for the left. But Christ, her response was abysmal. Naturally their kneejerk reaction is to say they were \"hacked\" into saying those things, just like DNC was \"hacked\", not an internal leak by a whistle blower, but a \"hack\"! Of course when it was found that there was no hacking she just started blubbering about how she \"sincerely didn't believe she wrote\" the posts. So this is our justice system now--if you just sincerely don't believe you did something, then you're innocent. The so-called \"Heroine of the Resistance\" as NYT said is just completely infallible. \"Blog posts written in the mid 2000s? Oh she's learned since then, she's different now! Trump said some women gold-diggers like thirty years ago? Let's riot, let's protest every year until the end of time, he's not on our team, he hasn't been baptized in money from the Saudi royal family!\" It's so ridiculous, it could only happen in a world run by clowns.",
			"added": 1525110298
		}
	],
	"topic_vote": {
		"17972_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": 1,
		"1521116095_1Djbcr8T8odfqjXg3PWgKPsEBrSiRnwdDz": 1,
		"1525103644_1KhyYzD37jfRrvr5p5biqc3ccjfQeiafEP": 1,
		"1523804682_1FkxDSUsa4ex8zTQcrmdtm7oaGCUNjBh9F": 1
	},
	"next_comment_id": 8,
	"comment": {
		"17890_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG": [
			{
				"comment_id": 1,
				"body": "What a joke that article was. The majority of the text is an attempt to explain Bitcoin in terms so simple they are useless and ought to be replaced with \"It's a currency.\" Beyond that, well:\n\n>it is essentially a currency not overseen by a financial institution or government body. This makes it unstable.\nThis one actually did make me laugh out loud. Government backed currencies are stable? Since when? Since the last depression? How on Earth does letting a body of reclusive legislators print infinite money make a currency stable?\n\n>Until recently, Bitcoin had relatively low transaction fees for users. This has, however, changed with the transaction fee increased to $25.\nFor reference, earlier in the article they point out that altcoins exist, so it seems almost misleading that they would talk about the high transaction fee without pointing readers to a currency with lower fees that would be more applicable to people interested in using Bitcoin in the first place. So, like I was saying: the article is useless.\n\n>Like all things online, there is always the possibility a user’s bitcoin wallet could be hacked and their bitcoins stolen.\nAnd they're saying this makes it less secure than all the other things businesses and customers get scammed out of. One minute the media says \"Oh your identity and personal information is being sold online, nothing is secure!\" and then the next \"Everything is perfectly secure and much safer than those Bitcoins!\"",
				"added": 1520228155
			}
		],
		"1520480628_19k3r2zgWTUszFvHSBBrxDWzEt83VqY7BA": [
			{
				"comment_id": 2,
				"body": "At risk of sounding like a post-modernist, but like caryoscelus implied: you have to define additional terms. We can say that a war is a conflict between two nations, but then there are civil wars, colonial wars for independence, and so on. There are political maneuvers far worse than wars enacted upon one nation by another: economic sanctions like the American oil embargo upon Japan which preceded actual violence between the two nations, could potentially cause massive damages to the blockaded population.\nGovernments in the 20th century managed to commit massive amounts of violence upon their populations, especially in the Communist bloc, through planned starvation, death camps, and so on. These acts caused more death and destruction than most wars. So it is not a relative quantity of violence which makes a war, rather the act of retaliation.\nIn third generation warfare one side may take virtually no losses while inflicting hundreds of casualties, but the retaliation of the other side make sit a war. To say war is necessarily wrong is to say retaliation is wrong. And if we were to then say \"Well STARTING wars is wrong then.\" well, if Stalin is starving the Ukrainians, has he started a war? If he starves the Ukrainians and the Ukrainians then start an uprising and kill Soviet troops in retaliation, is there now a war? In most senses I would say the retaliation is what would have kicked off a war. Even if you say they were provoked: if the people do nothing and the starvation continues, then there is no war, therefor the act of starvation is not war.  But the people are RIGHT in retaliating, if they can. Therefor we can't say that starting a war is wrong either.\nFrankly I don't think you can make a blanket statement about it. There ARE objective right and wrong actions, and wrong actions can provoke war, but war is more conceptual, and I don't think logically we can condemn it. And I think it's good that we don't, because when we refuse to throw blanket judgments over complex events, then we are forced to look at them more carefully.",
				"added": 1520630607
			}
		],
		"1523147173_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 3,
				"body": "I wouldn't say no to donations. They are given voluntarily, I see nothing morally objectionable to it. Socrates used it: went to the public square, gave people advice on how to solve their problems, accepted donations in return.",
				"added": 1523153420
			}
		],
		"1523193334_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": [
			{
				"comment_id": 4,
				"body": "La goblina is just a fraud like the rest of those kids. You don't need me to tell you that she and her goons are putting forth ZERO arguments. According to recent polls, the 18-24 demographic is the the most pro-gun age group out there, so the entire narrative that \"kids want the evil adults to give up their guns\" is ridiculous and pathetic. Boomers and Jews are the most pro-gun demographics: it's a hook-nosed, 70 year old Jewess that wants gun control, not some starry-eyed, bleeding heart high schooler. If you asked me, he killed the wrong students at that school. ZOG-drones and bull-dyke mutts make better targets, as we've since learned.",
				"added": 1523233241
			}
		],
		"1524849053_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 5,
				"body": "To paraphrase Sam Hyde: Can you even imagine what the world will be like if the Chinese government creates AI first? Google \"Bile Bears\"--that's what we'll be looking forward too.\nI'm split on it. On the one hand I think things like gene control (which the Chinese have already embraced, while the West rejects it on moral grounds) are a sign of the times, and we're heading towards dystopia; I want to go back and undo things. But on the other hand we don't really have a choice besides racing ahead and hoping things turn out right. It's like a gun on a table that everyone is reaching for. It's not like we can walk away from the table and expect to not be shot in the back.",
				"added": 1524861519
			}
		],
		"1525258130_18NrbxMytZcJcDcsUadLeSAfZ2f49jzPXK": [
			{
				"comment_id": 6,
				"body": "> [sylviecloud](#comment_20_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac): Anyhow. I fully agree with the Venus Project, as well as the whole idea behind Technocracy. It's gonna come sooner or later.. \n\nWhat is technocracy in this context? Do you mean a society lead by the experts of certain fields, like the brightest engineers and scientists? Or are we still talking about the venus-project-style of being ruled by a piece of technology? At least in the former case, you must remember: the most qualified individuals are not necessarily the morally just and good ones. People respond to incentives, and scientists are people; they aren't some separate species that are immune to this basic fact. I daresay any ruler will present you with the same problem.\n\nRegarding the AI-ruler approach, well.. There is an important distinction to be made between technology which allows humans to realize themselves better (like a carpenter's tool) and the amorphous technosphere--technology which we live within. The Greek \"Techne\" pertains not just to skill but to craftiness as well. Notice how children at a young age talk and talk with no filter on them, but soon begin to speak less, and keep more to themselves: they begin to see themselves as an entity separate from their environment, and one which can manipulate their environment to their advantage (like by keeping secrets). In The Odyssey, on the island of the cyclops, Odysseus uses his techne to escape the monster's womb-like cave, emerging onto the beach and declaring his true name to the cyclops. Technology in this sense is only an expression of human craftiness and skill, enabling us to become individuals distinct from our surroundings. The technosphere and the Venus project in general are merely cocoons that halt the development of human beings. it does not unlock human potential and give us all the time and resources we want to pursue out individual interests. It robs us of individual interests entirely. Just look at the fads and trends that dictate social media (which many now realize was a great mistake).",
				"added": 1526258227
			}
		],
		"1526227608_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 7,
				"body": "My girlfriend plays a game called HackMUD a lot, I think it's a really cool kinda programming oriented game.",
				"added": 1526258301
			}
		]
	},
	"comment_vote": {
		"8_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": 1,
		"1_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"22_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1
	}
}