{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Подобие Play",
			"body": "Народу все еще мало, но не могу не спросить.\nДавайте составим список магнет библиотек, естественно желательно и на языках отличных от оригинала.\nPlay попробовал, весьма годно. Сам могу смотреть и с сабами и на туземском, правда мой туземский слабенький, родные совсем не хотят напрягаться, а потому и такая тема.",
			"added": 1510040987
		},
		{
			"topic_id": 2,
			"title": "ссылки на ревизии svn в dokuwiki",
			"body": "Собственно поделитесь каг, если кто-то имел такой опыт. Пятой точкой чую, что webdav, но жутко не хочется ибо сейчас все ходят svn:\n\nПредложения перейти на гит или меркуриал в данный момент не принимаются ни в каком виде, работает у людей и трогать не собираюсь.",
			"added": 1516255472
		},
		{
			"topic_id": 1532674879,
			"title": "cname в dns гугла и яндекса",
			"body": "собственно вопрос, как пнуть этих товарищей? сайт переехал к другому хостеру по причине \"слияния и поглощения\" и всплыли жалобы, что пользователи не могут попасть на сайт. При разборе полетов выяснилось, у гугла и яндекса А запись для example.com обновилась, а вот cname www.example.com нет Оо Сижу ломаю голову как так? и что с этим делать, кеш собственных днс и днс моего провайдера тоже обновились и в них cname указывает на верный адресс, а тут такое",
			"added": 1532674876
		}
	],
	"topic_vote": {},
	"next_comment_id": 59,
	"comment": {
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 1,
				"body": "Хм, занятно, но хочется больше, поисковики трэш на данный момент",
				"added": 1475492127
			},
			{
				"comment_id": 2,
				"body": "> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Думаю, надо тупо сделать публичный прокси и натравить на него Гугл :)\n\nБудет знатная каша, гугл дропнет всю эту муть тут-же, если конечно не решиться подобрать и обогреть :)",
				"added": 1475500363
			},
			{
				"comment_id": 3,
				"body": "Хы, берем за круглобатн в правом верхнем углу и тянем влево, ждем, ждем, ждемм ..... бугуртим :)",
				"added": 1475506130
			},
			{
				"comment_id": 4,
				"body": "Ленту по времени перевернуть бы и будет торт. Хотя это на вкус и цвет",
				"added": 1475662782
			},
			{
				"comment_id": 5,
				"body": "> [ajwrk78b8fb47731](#comment_1_1EBhoAVnat8KH6dezimDFHDMyhcxP6fgMh): Не могу пробросить порт 15441, видимо через нат провайдера не проходит. Зачем он нужен, смогу ли а создавать сайты с закрытым портом?\n\nчто-то странное UPnP провайдеры никогда не глушат, кривой собственный роутер?",
				"added": 1475744434
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_15_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А ещё ZeroNet работает исключительно на 15441. И если в сети уже одна нода соединилась, то вторая обломается.\n\nZeroBundle\\ZeroNet\\src\\Config.py\naction.add_argument('peer_port', help='Peer port to publish (default: random peer port from tracker)', default=15442, nargs='?')\nself.parser.add_argument('--fileserver_port', help='FileServer bind port', default=15442, type=int, metavar='port')",
				"added": 1475746408
			},
			{
				"comment_id": 7,
				"body": "собственно в консоль радосно выплюнул, что на нужном мне порту, хз что будет если по этому файлу пройдется апдейтер, думаю заменит к чертям :)",
				"added": 1475746542
			},
			{
				"comment_id": 8,
				"body": "та, шаблон правки своего сообщения вырвиглазный, очепятки жесть исправлять, все белым бело",
				"added": 1475746592
			},
			{
				"comment_id": 9,
				"body": "> [balancer73](#comment_17_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ага. Показ картинок в Markdown вырублен. Наверное, надо врубить. Ну, пока так: https://ipfs.io/ipfs/QmV5AWVkbTfMbi9seSowxvNVwLLtLivMcvfLNUJChpR2NM\n\nне то, попробуй отредактировать существующий пост, естественно свой",
				"added": 1475749222
			},
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_18_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ага, понял. Хотя у меня оно было вполне читабельным серым на белом :) Немного подкрутил.\n\nПлохо подкрутил\n\nall.css\n\n.editbg {\n\tdisplay: none; width: 100%; height: 100%; position: fixed; opacity: 0; background-color: white; -webkit-transition: opacity 0.1s; -moz-transition: opacity 0.1s; -o-transition: opacity 0.1s; -ms-transition: opacity 0.1s; transition: opacity 0.1s ; \n\tleft: 0px; top: 0px; z-index: 500; -webkit-backface-visibility: hidden; -moz-backface-visibility: hidden; -o-backface-visibility: hidden; -ms-backface-visibility: hidden; backface-visibility: hidden ;\n}\n\nэто слой бэкграунда редактора, цвет можно оставить белым, а вот прозрачность явно можно поменять на поменьше, при 0,1 страница светлеет",
				"added": 1475761518
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_19_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Хм. У тебя точно all.css обновился? Я при правке CSS его форматирую. У меня так:\n> .editbg {\n>     display: none;\n>     width: 100%;\n>     height: 100%;\n>     position: fixed;\n>     opacity: 0;\n>     background-color: #333;\n>     -webkit-transition: opacity 0.5s;\n>     -moz-transition: opacity 0.5s;\n>     -o-transition: opacity 0.5s;\n>     -ms-transition: opacity 0.5s;\n>     transition: opacity 0.5s; \n>     left: 0px;\n>     top: 0px;\n>     z-index: 500;\n>     -webkit-backface-visibility: hidden;\n>     -moz-backface-visibility: hidden;\n>     -o-backface-visibility: hidden;\n>     -ms-backface-visibility: hidden;\n>     backface-visibility: hidden;\n> }\n\nхм, а не обновился, с чего вдруг?",
				"added": 1475764624
			},
			{
				"comment_id": 12,
				"body": "Да, но в подвале менюха стала черной Оо, а бэкграунд как был кривой так и остался, альфа канал половинка всеж много, сильно бить по глазам будет\n\nзы , кнопки тож разноцветные, мда, плохой синк, не годный, чек тоже не помог :)\n\nпосмотрим что завтра будет",
				"added": 1475764884
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_20_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Контент и код расходятся отдельно. И как я понимаю, у контента приоритет :)\n\nПля, вроде подгрузилось, но когда блин? По идее на главной проверка целостности должна перекачать все",
				"added": 1475765145
			},
			{
				"comment_id": 14,
				"body": "Крон, заводи wiki по css ;)",
				"added": 1475765220
			},
			{
				"comment_id": 39,
				"body": "отмечусь, думал не обновлюсь, а брат все же жив :) и даже шустрей все стало",
				"added": 1509959027
			}
		],
		"2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 15,
				"body": "> [zerro](#comment_18_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Вообще, как это бы не звучало неприятно, но концепция бана работает хорошо только в случае тюрем и расстрелов. То есть когда это действительно имеет под собой правовые нормы. А вебсервисы безответственно к этому относятся, так как тут юридической защиты у пользователей нет. И эту проблему уже демонстрируют случаи, например когда фейсбук удалял контент официальных СМИ.\n\nКонцепция банов работает хорошо, когда пользователи читают то самое джентльменское соглашение при регистрации и придерживаются принятых правил и норм на ресурсе. Отдельно стоит выделить, что этим правилам должны следовать владельцы банхамера. Остальное софизмы.\nЕсли говорить об обществе как системе, то выбивающийся из нее должен сдохнуть, так будет лучше обществу, как бы паршиво это не звучало. Осталось только выбрать нормы правила и табу, без них никакая система работать не будет.  Общество анархистов это миф, подобные течения приводят только к хаосу.",
				"added": 1476082395
			},
			{
				"comment_id": 16,
				"body": "> [zerro](#comment_20_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F)\nстолько текста и опять вечный спор, видимо разница между табу и правилами не входу (а ведь я не случайно их указал в предыдущем посте). Доказывать ничего не буду, это бесполезно.\n\nЗЫ: общество без табу и правил - ХАОС.\nЗЫЗЫ: Нет никакого альтернативного понимания анархии, передаю пламенный привет Ленинградским анархистам, душой давно не с вами :)",
				"added": 1476176198
			},
			{
				"comment_id": 17,
				"body": "> [zerro](#comment_21_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Жаль конечно, что не читаешь. Я ведь тоже далеко не анархист, ты бы понял это.\n\nТоньше надо, тоньше :) Обвинить собеседника, что он не прочел с пустого места, гы что-то это мне напоминает.",
				"added": 1476251853
			},
			{
				"comment_id": 18,
				"body": "> [balancer73](#comment_53_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): \n> А это уже только твоя личная трактовка. Не ты единственный такой придерживаешься, но это не значит, что все обязаны придерживаться такой трактовки. Семантика термина «анархия» намного шире. \n\nИ там по тексту отсутствие суверена. А следом власть закона, простите закон гарантирован кем? Сейчас мне скажут обществом и тут мы вдруг возвращаемся к формации под названием государство, а соблюдение закона должно быть гарантировано \"народом\" и как следствие \"народ\" переизобретет механизм угнетения.\nКонечно это вопрос семантики, конечно вы имеете право, как и я в том числе, трактовать \"анархию\" и \"движение анархистов\" в своем понимание. Увы прожитый опыт мне указывает на другое. И чаще всего настоящий анархист это ультрас уж простите за факт, к счастью с годами такие люди изрядно познают \"дзен\" и становятся весьма милыми людьми с очень интересной философией и вполне мирным и правильным общением с любыми проявлениями государства.",
				"added": 1476252680
			},
			{
				"comment_id": 19,
				"body": "Ответь на вопрос, правительство над кем? Попробуй описать ту абстракцию для которой нужно правительство. Загляни в корень слово правительство, упс - ПРАВИТЬ. Совершать насилие в речах тех, кто почему то считает государство органом именно того самого насилия, а не просто группой людей в границе территории с общими жизненными ценностями. Пусть так, я не против.",
				"added": 1476254734
			},
			{
				"comment_id": 20,
				"body": "Правят, то что неправильно, в контексте людей править нужно несогласных, согласные и так все делают как надо. У меня ощущение, что просто необходимо разграничить утопические общества и реальные. Зыж анархическое общество - утопия",
				"added": 1476259833
			},
			{
				"comment_id": 21,
				"body": "Чистое самоуправление, какая прелесть, кто станет инструментом исполнения решений? Где гарантия? кто гарантия? что этот инструмент не имеет своего мнения? А если имеет, то оно не отличимо от общественного решения.\n\n Проблема растворения личности в общественном сознании. Как и рождение законченного мнения из общественного сознания так никем нормально и не изучено.\n\n В управление толпой, путем манипулирования сознанием индивидов, это сколько угодно, а вот обратно никак. Да и манипулирование на уровне индивидов путем статистических изысканий точек давления, но никак не общественное сознание",
				"added": 1476262088
			},
			{
				"comment_id": 22,
				"body": "Частности не нужны, инструмент исполнения - абстракция, а армия, полиция, etc... это частности. Кто сказал что этот инструмент, не имеет своего мнения?\n\nЛичность исчезает с появлением полноценного общественного сознания. Хотя думаю сложновато обсуждать, увы это аксиома.",
				"added": 1476263119
			}
		],
		"3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 23,
				"body": "> [balancer73](#comment_65_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Блин. Пытался вручную перенести сообщения из одного топика в другой, запорол оба. Еле восстановил систему :)\n\nid=\"comment_65_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw\" \n\n100% совпадение в вставленный в движок цитаты и id в сгенеренной странице, нумирация походу сквозная и не привязана к конкретному топику, может в этом направлении глянуть?",
				"added": 1476267368
			},
			{
				"comment_id": 38,
				"body": "Напишу сюда, шаблон редактирования поста, тоже белый с серыми буквами. было бы не плохо прилепить разметку, а то я вот уже подзабыл, а искать жутко лень",
				"added": 1499420737
			}
		],
		"4_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 25,
				"body": "[morin](?Topic:2_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/#comment_22_1GkRidai8zywUN1oeqjoSWQcLNDPHY2eHF): Частности не нужны, инструмент исполнения - абстракция, а армия, полиция, etc... это частности. Кто сказал что этот инструмент, не имеет своего мнения?\nЛичность исчезает с появлением полноценного общественного сознания. Хотя думаю сложновато обсуждать, увы это аксиома.",
				"added": 1476272633
			},
			{
				"comment_id": 26,
				"body": "В теле моего предыдущего сообщения ткнись в никнейм. Как-то через задницу, но можно переносить, увы походу нужны ключи для подписи от каждого юзверя",
				"added": 1476280200
			}
		],
		"5_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 27,
				"body": "Эм, ссыль живая, а в посте только текст\n![image шьфпу](http://ipfs.pics/ipfs/QmXm2J5YqE9j4R8uMeC1hvX9LYnF43iPqTeYYETuaovihN)",
				"added": 1477287722
			},
			{
				"comment_id": 28,
				"body": "А показывалась поди на тачке с которой был пост",
				"added": 1477292896
			},
			{
				"comment_id": 29,
				"body": "У меня она никогда не работала",
				"added": 1477297818
			}
		],
		"1_1Nyv5sTPtqCPQmK81bgx3iHWYDQDwLMNZX": [
			{
				"comment_id": 30,
				"body": "+",
				"added": 1482214315
			},
			{
				"comment_id": 32,
				"body": "А решил апнуть не только пласиком. Крон, а накидай мне названий технологий по распределенному хранению и публикации в вэбе. Пока из интересного только зеро и ипфс, что еще водится, на почитать, может посмотреть\nМожно вообще отдельным топиком, интересно будет",
				"added": 1482214819
			},
			{
				"comment_id": 33,
				"body": "> [balancer73](#comment_82_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Для коллективного хранения данных интересна Tahoe-LAFS.\n\nВыглядит очень привлекательно, увы установка под вынь жестяк, а разработка у нас именно там. Мда, ну буду велосипедить, раз за столько лет скрипт для развертывания никто не написал. Ну и список проблем конечно включает моего параноика, с другой стороны, эти проблемы маловероятны в  моих гигабайтах данных",
				"added": 1482303244
			},
			{
				"comment_id": 34,
				"body": "а с чего там не быть, уюное, вечное доставляет. Поколения меняются, а вот средний уровень по больнице в головах по наклонной и учиться не собирается. пиво, рыбка, кресло - смотрим на закат человечества :))  гыгыгыгы",
				"added": 1484805902
			}
		],
		"1_129XgHbFnQQGgBbzVQaKQuusn5s6JsogYe": [
			{
				"comment_id": 31,
				"body": "zeronet не анонимная сеть :)",
				"added": 1482214525
			}
		],
		"6_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 35,
				"body": "о да, поддерживаю",
				"added": 1485777086
			}
		],
		"2_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT": [
			{
				"comment_id": 36,
				"body": "Как мило, вместо стабилизации и поддержки совместимости сверху вниз предложили контейнер.  Что поделать иного в зоопарке не дано.\n\nНадо сказать ,что такое на винде было давно, называлось режим совместимости. Да и сейчас есть и виртуализацию завезли. Про хаки не от майков, но от сборщиков ПО надеюсь тоже слышали, большинство standalone нелегальщины, ни что иное как собранное в контейнере. А то что таскает все с собой, так это только доказательство, что парадигма разделяемых библиотек говно, но это уже ИМХО",
				"added": 1499412437
			}
		],
		"7_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 37,
				"body": "что-то надо делать с шаблоном цитат, реально серые буквы на мутно белом фоне (:",
				"added": 1499419958
			}
		],
		"1_1GkRidai8zywUN1oeqjoSWQcLNDPHY2eHF": [
			{
				"comment_id": 40,
				"body": "zeronet сам dht :)\nпараноики используют шифрование, и выпиливают трекеры из раздачи\nа возвращаться в RS жутко лень, может конечно все и поменялось со временем, но лень же",
				"added": 1510121234
			},
			{
				"comment_id": 41,
				"body": "Да я и сейчас не в восторге, качнул свежий, перекинулся ключами с ботами и все как раньше - тишина и мертвые с косами стоят.\nНу нет у меня знакомых анонимов там, все? сеть закрыта? Нафига оно такое и на нынешний момент хз",
				"added": 1510129156
			},
			{
				"comment_id": 42,
				"body": "Лови, будем собирать лортусу :)\n\nCQEGAcGXxsBNBFoCoe4BCADByqohSjmfxMJQO+f51du3SCqKEvO/8aRKrqqosyha\nMJzWspyzKIXliIfProOeL4HUqfxQ/pqYZxk+1ZKm5fO0JELl4BKWqsQ1sDsz5r60\noFrSNC+i9QF/E1VKRrocUdDgdgG3XicqhmrN8SBeYsCFj/pD1m8LbTPwJoRz0IXy\nmXP5kulBQ6GIAJLSXezyULCqT1QxcYAGkMNs6jHfhvvmbzqPQ7VtbJKk/G06+qjW\nNmGkDAIa53QnA39q0znRgzs32aY23/L0/Kog0Y5mnaqnBDqs7pbTMSW/5qMFX26L\nl+dppGtCrmMF0naMkcNnWV4g63CL0kYTH1UDT4u1WuJFABEBAAHNI3pvb21lciAo\nR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJaAqHuCRAgi4iC\n0U14LwIZAQAAmTQH/RLbBh64PKAjf6ZSvrevQJMqj8ZK1fLJ2nfreDj6j6CI7lKT\nQJLz16ksw43Pys1bmRzoTszCnsTCt9xhbfcrA1zxu6U5jY/WsHbp1nWNunJx89tB\nLlWL4IAFZye3sIFXBWI4pG/IDUB/eqFeIun92a4ADoNoYGipwRPrfzaYWOIDrP8d\nSuKT3mPyF5qL8ArCEg6p34fhr6bMEJQP9p7ckF+hyNOPd6JoYcS+SI4/7Q1P0gVx\nNhiwwnz9LR7lQyyXnK90Q2Q8VLNnKKgfe/hkyLtmdRtQ7+qyVY9mjmR8sGqJawC1\noth8nNMr8xrzeipvQaRcPBHtBFh331pk8dhPNSgCBl4TI08e3wMGCgEDBR7fBAAG\nC015IGNvbXB1dGVyBRCT5kcDtQm1mBDeADvLxkUyBwOCdeM=",
				"added": 1510206094
			},
			{
				"comment_id": 43,
				"body": "> [gomzik](#comment_1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): @balancer73Можно ли зафрендится в ретрошаре? Интересно попробовать, как это вообще работает\n\nУ крона есть ветка тут http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC\nтам он оставлял ключ",
				"added": 1510206147
			},
			{
				"comment_id": 44,
				"body": "> [balancer73](#comment_128_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Даже конкретно: http://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHC/?Topic:14_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/RetroShare [...]\n\nна работе под хп, полет нормальный, только нет никого :)",
				"added": 1510237477
			},
			{
				"comment_id": 45,
				"body": "> [balancer73](#comment_127_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Как шифрование совместимо с магнитами? Там же не трафик перехватывается, а индикация о наличии контента по магнету. Ты или светишь всем, что у тебя есть нужный магнет, или ты недоступен в сети и обмена контентом нет.\n\nIP серенький и вперед. Вы все еще думаете что в6 для вашего удобства? :)",
				"added": 1510237554
			},
			{
				"comment_id": 46,
				"body": "Balancer\nСоединение отклонено удаленным пиром.\n\n ММММ, чтоб это значило?",
				"added": 1510237770
			},
			{
				"comment_id": 47,
				"body": "play anime http://127.0.0.1:43110/1AnimePihDhcbVdK1nvnbSEtH4oKU8RAYG/\nzeroTV mirror http://127.0.0.1:43110/1HwH4hfRhohJGVtZMBYprYKyHcuJNwL4sZ/\nplay+ http://127.0.0.1:43110/1J3JSAxiM3uhpkp2dymY59yud8r2RGW6MA/\n\nПродолжаем посмотреть, интересно, что зайт не клонируется, однако это все братья",
				"added": 1510651556
			}
		],
		"2_1GkRidai8zywUN1oeqjoSWQcLNDPHY2eHF": [
			{
				"comment_id": 48,
				"body": "Имею ввиду вообще интеграцию ссылок на svn\nПока вида svn://host/path Конечно просит распарсить чем открывать, черепашка открывает свой проводник, но к сожалению не выделяет нужный файл, если допустим в тегах валяются несколько точек\nЕстественно хотелось бы не только ссылку на тег, но и возможность указать номер комита и выкачать искомый, даже если тег на него не создавался. Понимаю что хотелка жирная, но хотя бы выкачивать указанный файл лежащий в тэгах",
				"added": 1516265863
			}
		],
		"1_1GhRGdwcLxac8Kij8SeRoJzjrEyuj6Qy1G": [
			{
				"comment_id": 49,
				"body": "криптопанк и почитав \nВедь, судя по остальному тексту, язык для вас родной. Не в качестве придирки, чисто ради эстетики.",
				"added": 1518587679
			}
		],
		"1_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 50,
				"body": "> [coolplay](#comment_2_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): what's it meaning?\n\nit means that you're fucking bot",
				"added": 1519884721
			}
		],
		"1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": [
			{
				"comment_id": 51,
				"body": "> [promusik](#comment_8_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): ЛОРовцы жопу вообще редко отрывают. Одни орут социалочки не нужны, а другие жрут все в подряд. Ни тем ни другим ZeroNet не нужен. Вот в этом вся и проблема.\n\nПроблема исключительно в инертности \"сарафанного радио\" в свое время и шкайп был у трех с половиной гиков, довольно долго был в таком состоянии. Все нынешние социалочки продвигаются маркетологами, а те свою работу знают. Денег на этом окучивают хорошо, формат форума не предполагает вменяемого механизма монетизации, а потому не сильно интересен маркетологам",
				"added": 1521785606
			},
			{
				"comment_id": 52,
				"body": "> [pozya](#comment_14_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): Как человек с довольно развитым \"чувством прекрасного\" скажу честно - пока у зерошечки такой гуй в основных приложениях (ZeroHello, ZeroMe и подобных) - все печально. Какой смысл пытаться даже кого-то сюда звать, если по моей статистике 95% сразу говорят \"фи, как неудобно\"? [...]\n\nМммм, машина не того цвета (: Ну если ты видишь и оцениваешь только гуй, то тогда да, тебе тут явно не место, приходи через пару лет, когда те кому не лень напишут и нарисуют чтоб твои глаза не вытекали. А то понимаешь зарплаты захотел.",
				"added": 1522047371
			}
		],
		"1528492059_1Lv4vYseYJV4dom5f3ooyJTsiazC4mrsBC": [
			{
				"comment_id": 53,
				"body": "> [balancer73](#comment_208_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Пока нет. Поменять порядок сортировки легко, но тогда для больших топиков получается кривь, нужно листать в конец через AJAX каждый раз. То есть нужно делать привычную разбивку на страницы. А это надо ковыряться чуть больше. Тоже не сложно, но задача на самом дне приоритетов, потому как пишут в ZN всё равно очень мало. Если раз в день заглядывать, почти нет топиков, где добавляется больше нескольких сообщений. А их и так отследить не сложно, даже в обратном порядке :)\n\nЯ за фичу :) В смысле за допил",
				"added": 1528877607
			}
		],
		"1524945156_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 54,
				"body": "> [balancer73](#comment_211_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): http://127.0.0.1:43110/1videomkrGfLUNe2RaQJqbumb4nTgbp2J/?Video=1532106583_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw [...]\n\nформат видео или тип mime не поддерживается\n\nа ведь пару недель назад работало, мде что-то мне совсем не нравится современный вэб",
				"added": 1532330883
			},
			{
				"comment_id": 55,
				"body": "> [balancer73](#comment_213_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): С браузером что-то? У меня всё ок в Хроме/Опере под Win/Linux. В Firefox не проверял.\n\nтак понятно что с браузером лиса еср. Вопрос в другом, ведь работало же, вот нахрена сломали?",
				"added": 1532354373
			}
		],
		"1532674879_1GkRidai8zywUN1oeqjoSWQcLNDPHY2eHF": [
			{
				"comment_id": 56,
				"body": "нет возможности с проксей увы, техпо какой-то бред прислало, придется самому курить, что они там на переносили.",
				"added": 1532931950
			},
			{
				"comment_id": 57,
				"body": "хы, это просто феноменально, эти олухи сожрали хостинг, перетащили сайты на свою площадку, но не делегировали домены на свои днс, вместо этого на старых они что-то криво поправили и оно как-то работало через жопу, а с учетом, что они старые сервера выводят потихоньку из эксплуатации, то это могло закончится просто отвалом намертво с беганьем и горящим пердаком.",
				"added": 1532958862
			}
		],
		"1597473464_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 58,
				"body": "отмечусь\nхорошая новость",
				"added": 1598533989
			}
		]
	},
	"comment_vote": {}
}