{
	"next_comment_id": 14,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [zerro](#comment_1_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Да, читать можно и локальный контент, те же блоги. Главное чтобы он тут был.\n\nА еще очень волнует вопрос критической массы... то что каждый сам себе интернет, это конечно здорово, но в какой-то момент контента станет больше, чем места у меня на диске...",
			"post_id": 4,
			"date_added": 1475143979
		},
		{
			"comment_id": 2,
			"body": "> [johnnydoe](#comment_1_1DdSeXzdRowHaPdiwC4TrMk6Mna4ZTw8JG): Так я не понял, зачем третий питон?\nкак я уже [отвечал](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i/1NHR4Gdv1dVLZS5HRwY6aJWfngk9jCLF87/1475147498) второй питон больше не поддерживается ",
			"post_id": 8,
			"date_added": 1475179785
		},
		{
			"comment_id": 3,
			"body": "> [zerro](#comment_6_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Подскажи пожалуйста, где нужно подредактировать CSS, чтобы код не вылазил за ширину поста. А то я уже методом тыка все перепробовал, но так и не смог решить до конца в своем блоге. Или у тебя просто максимальная ширина указана. Смотрю при изменении размеров окна, поле кода не масштабируется.\nУ меня так:\n.post .body pre code {\n    padding: 10px 20px;\n    white-space: pre;\n    max-width: 625px;\n}",
			"post_id": 6,
			"date_added": 1475521035
		},
		{
			"comment_id": 4,
			"body": "> [zerro](#comment_5_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): ZeroNet не решает сейчас проблемы синхронизации, насколько я понимаю. То есть сейчаст вполне можно создать разное состояние одних и тех же сайтов на разных узлах. Есть фича, запрещающая рассылать данные чаще чем раз в 30 секунд, но это все на совести пользователей, как и время постинга, так я понял. Исследования атак такого рода и меры их предотвращения тут никто не проводил. \n> Насчет сопоставления с другими сетями. Ну интересно это почитать. Сетей подобного рода впринципе не знаю даже. Можно притятуть к торрентам, можно к Bitmessage, и возможно к Syncthing и BTSync.\n\nпод синхронизацией я имел ввиду синхронизацию данных ( читай контента). Атака скорее будет не на ZeroNet, а с помощью ZeroNet-а",
			"post_id": 12,
			"date_added": 1475521289
		},
		{
			"comment_id": 5,
			"body": "> [zalex](#comment_1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Да ладно, я своё поделие уже почти как год пишу: то времени нет, то забываю на пару месяцев :D\n\nЯ понаоставлял в коде уже кучу артефактов и, кажется зашел в тупик. Надо немного переключиться",
			"post_id": 11,
			"date_added": 1475743426
		},
		{
			"comment_id": 6,
			"body": "> [lifo14](#comment_2_1Pd8oZNMabCtHcSZZpuytq3gdNAd1Lk2Uy): Пул реквесты в ветку мастер принимаются?\n\nеще как",
			"post_id": 18,
			"date_added": 1476979064
		},
		{
			"comment_id": 7,
			"body": "> [spacer](#comment_1_1PWUDXXoRnY6W54qovBrxGwo98Ed6ZHmkt): А куда взяли то?\n\nфриланс по ставке 400 час ))))",
			"post_id": 21,
			"date_added": 1480436569
		},
		{
			"comment_id": 8,
			"body": "> [voland](#comment_7_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): много философии...\n\nСейчас вообще модно развозить мысли по бумаге)",
			"post_id": 25,
			"date_added": 1483815505
		},
		{
			"comment_id": 9,
			"body": "> [voland](#comment_8_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): что-то не работает\n\nпоясни",
			"post_id": 26,
			"date_added": 1484000371
		},
		{
			"comment_id": 10,
			"body": "> [voland](#comment_9_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Так в твоем блоге и не работает. Ее нет. Открываю блог. Листаю вниз. И ничего не происходит... \n> Chromium 55.0.2883.75\n\nслева внизу нет кнопки? ![](https://lh3.googleusercontent.com/NK9nYkVCo4uGLNTYHiO123hp7lsCp9PLP8WytibLD8eqjG7tHAqRB6U0vmWZlAE7wE0BNBJwgQ=w386-h467-no)",
			"post_id": 26,
			"date_added": 1484120741
		},
		{
			"comment_id": 11,
			"body": "> [voland](#comment_9_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Так в твоем блоге и не работает. Ее нет. Открываю блог. Листаю вниз. И ничего не происходит... \n> Chromium 55.0.2883.75\n\nтоже хромиум. попробуй обновить со сбросом кеша",
			"post_id": 26,
			"date_added": 1484121060
		},
		{
			"comment_id": 12,
			"body": "еще у кого-то есть такая проблема?",
			"post_id": 26,
			"date_added": 1484228985
		},
		{
			"comment_id": 13,
			"body": "`P.S. По слухам, за блокировку Telegram в РКН лично отвечает Олег Анатольевич Иванов, а непосредственно блокировкой в круглосуточном режиме занимаются два инженера (их фамилии пока не сообщают), которым выделили отдельное помещение и снабдили необходимой техникой, в том числе выдали 4 USB-модема для подключения к разным операторам. По информации источника, инженеров на выходных не выпускали из помещения и не давали поспать — этим объясняются «неадекватные» блокировки подсетей /32, входящих в /22, которые мы наблюдали в воскресенье`\n\nПрям улыбнуло :D\n",
			"post_id": 31,
			"date_added": 1524557506
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}