{"cert_user_id": "Shydoo@github", "next_topic_id": 2, "topic": [{"topic_id": 1604066561, "title": "Questions ZeroNet", "body": "Hello, \r\n\r\nI would like to create a marketplace platform like Openbazaar.org so I have a lot of questions. :)\r\n\r\n1 - Why hasn't OpenBazaar installed on Zeronet?\r\n2 - In the same example (Creating a market), is it necessary to implement the ZeroID authentication system to make market user accounts work or is there another equivalent solution?\r\n3 - A site system with a user account with a private message, the publication of a message on a forum or to write a product notice, the publication of an image on the forum or for the image of a product sold, the publication of an article by users, the management of their stock, the creation and customization of their shop as part of a marketplace on ZERONET?\r\n4 - Should I use ZeroID to implement features like these before?\r\n5 - What ZeroID equivalent is used to create similar features?\r\n6 - Possibility of status data for some members as \"Moderator\" or \"Administrator\" as well as features such as banning members, closing some stores that will not comply with laws, deleting an item without closing the shop entirely, the alert system? With ZeroID or equivalent? Why? Why? Why? Why?\r\n7 - To have the possibility of implanting other cryptomonnaie than the Bitcoin to leave to the sellers and buyers a broad choice of type of payment?\r\n8 - Possibility of setting up a so-called \"Escrow*\" system? Is there a function to deposit his money on the portfolio on the site or on the contrary, if the customer can use his own portfolio synchronized possibly to his ZeroID account?\r\n9 - For the creator of the site is it possible that it is a panel with modifiable parameters like the percentage of commission, to be able to add or remove categories of products, to put a filtering system to avoid putting an article online if there are certain non-compliant words?\r\n10 - Is a market technically stable and feasible? If so, how to create a market? What are the tools, modules or functions to use to create a market site on ZERONET (ZeroID? ...)?\r\n11 - How does an escrow system work?\r\n12 - How to implement it in a zite?\r\n\r\nZeroNet Security... :\r\n13 - Is it possible that a zite is closed by the government?\r\n14 - It seems to me that the Chinese firewall had blocked the p2p client's communication port, but according to the new ZeroNet update, the port changes randomly (one of the solutions was to use a fixed port (15441) that the client listens to on a random port (10000-4000000)), but does this risk still have value?\r\n15 - Can a user account be hacked? Knowing that he uses cryptography similar to Bitcoin.\r\n16 - Are there large security holes that could occur on a Zeronet site (roughly if user accounts could be hacked, if spying is possible and data recovery, if one or more people could close the site) despite the p2p system.\r\n17 - Is there an interest in making zite updates? Because it's very secure with block string and file cryptography.\r\n18 - What happens when someone hosts malicious content?\r\n19 - Advantages and disadvantages of ZeroNet?\r\nThank you very much if you could answer me. ;-)\r\nSee you soon !\r\n\r\nRegards,\r\nShydoo", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1528542526, "modified": 1566311423, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1449", "source_type": "github"}], "next_comment_id": 2, "comment": {"1604066561_mirrored_Shydoo_github": [{"comment_id": 1, "body": "Thank you very much ! :wink: \r\n\r\nI have got another questions :smiley: : \r\n\r\n1- How to be as anonymous as possible? Should I2p be used?\r\n2- Can I really use I2P with Zeronet?\r\n3- I2P encrypts communications?\r\n4- Does PGP encrypt communications?\r\n5- ZeroID contains a short centralized server it is all except in the line of decentralization?\r\n6- What is zeroframe? What's the point?\r\n6.1- Can user names be created directly on the site using zeroframe?\r\n7- What is clearweb and clearnet?\r\n8- Whether it is ZeroID PolarID PeakID KaffieID I imagine it all works the same way as ZeroID with a centralized server that will do data checks on the clearweb?\r\n9- How to make the site as anonymous, secure and encrypted as possible? What should be used (currently functional)? Whether it's for the id?  For network overlay (Tor, I2P)?\r\n10- Let's imagine users who protect themselves as much as possible, doing manipulation on the site side, we can make it really safe ?\r\n\r\nThank you in advance ! :smile: ", "added": 1529258862, "modified": 1529258862, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/1449#issuecomment-397906683", "source_type": "github"}]}}