{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1535451536,
			"title": "Zeronet Explorer — First Mobile Browser",
			"body": "We'd like to share our Proof-of-Concept #3 release of the NEW Zeronet Explorer mobile application.\n\nGrab it on GitHub\nhttps://github.com/d14na/zeronet-explorer/releases\n\nGrab it on the Play Store\nhttps://play.google.com/store/apps/details?id=com.zer0net\n\nScreenshots\nhttps://imgur.com/a/ug4rI3C\n\nFYI - Working on F-Droid and Torrent seeding the APK now\n----------\n\nPLEASE NOTE: \nWe are having an issue with serving local (downloaded) files on Android (almost certain its a React Native bug), so this app currently \"cheats\" by using one of our EU proxy servers. It works as expected on iOS (NO ZeroFrame support yet -- will be in the MVP release next month), and hopefully our recent submission gets approved (fingers crossed) by the Gods of Cupertino. \n\nWhile we address this Android issue, please send us your feedback (no matter how critical) and let us know what features you'd like to see in addition to just the zite browser. eg. Crypto (btc, eth) wallets are coming next and BitMessage support is on the way.\n\nMORE SOCIAL LINKS:\nReddit: https://www.reddit.com/r/ZeronetExplorer\nTwitter: https://twitter.com/ZeronetExplorer\n\nCheers!\nD14na",
			"added": 1535451535
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1534891163_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": [
			{
				"comment_id": 1,
				"body": "> When i create zeroid thru your proxy, other users will be able to use it too?\n@ssdifnskdjfnsdjk yeah, so you were right, it looks like the ids are stored on the server in users.json, so its probably not a good idea to signin to the proxy. \n\nperhaps we'll figure out a way to deal with that. moving the key client-side would seem the most obvious solution, but I'm sure there were reasons for storing it on the server.",
				"added": 1534972755
			},
			{
				"comment_id": 2,
				"body": "@styromaniac I just removed the 0 button. wasn't using it anyway on the proxy.",
				"added": 1534972811
			},
			{
				"comment_id": 3,
				"body": "@pad just updated the proxy to 0.6.3.\n\nplease tell me more about the \"tracker/super peer\" feature. very interested in this for our https://github.com/d14na/supeer project.",
				"added": 1534972920
			},
			{
				"comment_id": 4,
				"body": "@pexo added a size limit of 200MB for PomfPomfMoe, but its still not loading. not sure exactly what the issue is, but I'll give it a few more goes. if that doesn't work, then I'll dig into the logs and sort it out.\n\nOur storage capacity is pretty beastly, so no worries on the 6.3GB. Our issue is bandwidth and DDoS protection. Once we solve the DDoS issue with our new host, then we'll scale to also support the necessary bandwidth.\n\nAs mentioned early, we are developing a project now to handle filtering of illegal content. As long as its NOT illegal we will happily seed it. Keep in mind some content is illegal in certain jurisdictions (think GFW), in which case our Geo-Filters will ONLY apply when Zeronet Explorer is used WITHIN those jurisdictions.",
				"added": 1534973928
			},
			{
				"comment_id": 5,
				"body": "@styromaniac what's your site. i'll sort it out",
				"added": 1534974016
			},
			{
				"comment_id": 6,
				"body": "@styromaniac please forgive me if I seemed critical. not at all. i GREATLY appreciate your effort.",
				"added": 1534974112
			},
			{
				"comment_id": 7,
				"body": "@pexo seems to be working now.. how do I configure the site to seed the FULL 7GB?",
				"added": 1535018291
			},
			{
				"comment_id": 8,
				"body": "@styromaniac again, I appreciate your efforts as it at the very least shows some responsibility to deal with the illegal content. as I see @daniell pointed out, this needs to be a new issue. once our ZeroFilters is up and running (again this will become a part of Zeronet Explorer by the MVP -- couple of weeks), I am happy to write a PR for the official ZeroNet client.",
				"added": 1535018622
			},
			{
				"comment_id": 9,
				"body": "@daniell yes, my jurisdiction is a problem for me (i've accepted that as it is what it is), but I know enough to make sure it doesn't affect the rest of my team and certainly NOT the hard work we're all doing. since the megaupload take-down I've kept a substational section of my infrastructure off-shore, which is where these services will operate. the only remaining piece to be addressed for these new projects is Cloudflare, who provides our DDoS protection; once we've made the migration to our new host network (no ETA quite yet), this should not be an issue anymore. keep in mind, DDoS ONLY affects the open proxy and the very few .COM (clearnet) sites we publish, the rest of our services are being migrated to run exclusively on the Zeronet.\n\nmy history, I have a certain level in influence in the crypto dev world. d14na's first objective will be to help all of the new Decentralized Apps (DApps and now LApps), make the migration to the Zeronet. I won't get into the technical details right here, but its absolutely a WIN-WIN for everyone. All that's missing are the right TOOLS to help them make the migration. With the new \"quality\" content that DApps can bring to the Zeronet, I'm very confident you'll see a significant boost in overall users/seeders.",
				"added": 1535019529
			},
			{
				"comment_id": 10,
				"body": "> Creating a Terms of Use and require its acception (with cookies remembering what user choose) on startup.\n\n@daniell we'll certainly put TOS on our service pages, but that's more for cosmetic reasons. we're planning to rely on ZeroFilters to actually do the enforcement of our content policies. \"asking\" people to behave on the Zeronet, almost seems like an anti-pattern lol.\n\nthanks for the suggestions. keep em comin'",
				"added": 1535019748
			},
			{
				"comment_id": 11,
				"body": "@pad yes, we're happy to offer tracker services. the current ip is fixed, but it is NOT permanent. and the current proxy server is in NO WAY ready for heavy usage (performance already kinda sucks, but that's the limit for this current host). i only put it out there to help with all the \"NO PEERS\", but we knew it was never meant to be a permanent solution.\n\nright now, we're hosting from part of our shared network in Panama. we are in the process of setting up a permanent home for the open proxy, but we're still evaluating and testing various solutions with several off-shore, DDoS, crypto-friendly ISPs. once this is done, we won't need Cloudflare anymore and can publicly list all of the fixed IPs in the network. There is currently NO ETA, as we have a few other priorities that need to happen first. As soon as we have a final roadmap to launch, I'll post an update.",
				"added": 1535020295
			},
			{
				"comment_id": 12,
				"body": "@ssdifnskdjfnsdjk thanks for all that, I'll review when I get back to the office",
				"added": 1535045375
			},
			{
				"comment_id": 13,
				"body": "@daniell we really haven't changed anything other than some hard-coded redirects in wrapper.html for the serious content offenders. we are working on a project (https://github.com/d14na/supeer) that will probably replace the open proxy once its done. nothing to see there yet.",
				"added": 1535045494
			}
		],
		"1535486435_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 14,
				"body": "@gardenparty if it helps, this is the command we use to the 0net.io gateway\n\n`cd ZeroBundle/ && pm2 start ./ZeroNet.sh -- --debug --ui_ip \"*\"`\n\npm2 is a really amazing package manager\nhttps://www.npmjs.com/package/pm2\n\nquick step-by-step\n1. install node (super easy node version manager -- https://github.com/creationix/nvm)\n2. install pm2 `npm install -g pm2`\n3. run the command above",
				"added": 1535509390
			}
		],
		"1535451536_1EoqbSwvxRuRKj7vpeK79wuGXdpq2wbqfM": [
			{
				"comment_id": 15,
				"body": "@styromaniac its currently hard-coded to one of our proxy servers, so if its not already being seeded by that server, then it won't load. i added roughly the top100 zites as listed on `1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D`, so it \"should\" be better now. obviously, we need to do PEX (peer exchange) for it to be truly decentralized, but we're still taking our baby steps during POC phase.",
				"added": 1535509763
			},
			{
				"comment_id": 16,
				"body": "@pad this is our last \"Early Preview\" before the MVP (minimum viable product), but we thought it was eh, \"good enough\" to start getting community feedback. \n\nThe recommended way to load a zite will be to:\n1. scan QR Codes (click that little icon to the left of the address bar).\n2. type in a \"Zitetag\" aka (.bit) namecoin address\n3. or we will also support clickable hyperlinks like:\n    - http://127.0.0.1:43110\n    - zero://\n    - 0net://\n(no one should have to type in a bitcoin address)\n\nRight now, we are looking for feature requests from the community, so we can start planning our development roadmap. Please be as critical with your feedback as you wish (we know its super buggy right now, but it will get better FAST); as well as suggesting literally anything that you can imagine that would be beneficial for the zeronet community (particularly for mobile users).",
				"added": 1535510308
			},
			{
				"comment_id": 17,
				"body": "@styromaniac it IS the client. once we add in PEX, this will function exactly the same as the current desktop client, but for mobile users.",
				"added": 1535510466
			},
			{
				"comment_id": 18,
				"body": "@styromaniac yeah, that's 100% intentional. we need to get this through Apple's approval process. I'm terribly afraid of adding too much content (at the startup screen), cause we know where that could lead; and it could result in a permanent ban from apple.",
				"added": 1535510587
			},
			{
				"comment_id": 19,
				"body": "@pad just confirmed that the ZeroSites was not in this release, so zitetags/namecoin addresses are still not loading (will have to use the full address, preferably by scanning qr code). it will work in the next update -- thu or fri",
				"added": 1535510883
			},
			{
				"comment_id": 20,
				"body": "QUESTIONS: What is the best practice in the Zeronet for notifications (its something we absolutely NEED in 0Explorer)? Although I'm using the @mentions here, how does everyone actually receive the notifications when mentioned? Thanks!",
				"added": 1535511116
			}
		]
	},
	"comment_vote": {}
}