{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1567130399,
			"title": "ZeroNet traffic explanation",
			"body": "Where is there an explanation of what traffic is run over clearnet when 'Tor Always' is *not* selected.",
			"added": 1567130398
		},
		{
			"topic_id": 1567228436,
			"title": "ZeroID error: List index out of range",
			"body": "Does anyone know what that error means?",
			"added": 1567228434
		},
		{
			"topic_id": 1568607154,
			"title": "How do you rate limit ZeroNet?",
			"body": "I don't want my ISP to put me on a watch list for pushing the limit on bandwidth. Just today I seeded about 7Gb of data. My system is headless and runs 24/7, so it is easy for me to have considerable data flow rates.\n\nI didn't see any options that I could uses to limit the throughput, so what are other people using to rate limit?",
			"added": 1568607151
		},
		{
			"topic_id": 1570072681,
			"title": "Just a heads-up on Python 2.7",
			"body": "Python 2.7 will not be maintained past 2020... that is all.\n\nhttps://pythonclock.org/",
			"added": 1570072677
		},
		{
			"topic_id": 1570159543,
			"title": "If you're not using relative links on your ZeroNet site, then you're doing it wrong.",
			"body": "Please don't hard code \"http://127.0.0.1...\" into links, because not everyone runs ZeroNet on the local machine. It seems that sites like ZeroTalk does It right, but many others don't.",
			"added": 1570159538
		}
	],
	"topic_vote": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565430707_16joHUdKRd7Qfjp6fjTfHkaqwkrUhj7svk": 1,
		"1565449551_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565614209_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565708858_1BP1yj9evars2xjLc1Hw6icEg3BKJaLUyk": 1,
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": 1,
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1566475780_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566667015_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"1566858736_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"1567109265_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": 1,
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1567999355_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": 1,
		"1568442422_1CULW1fmGcWRuzieU9rKarUGHa2ngwqTEH": 1,
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1569200371_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1571718258_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm": 1,
		"1571820482_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1572513197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 111,
	"comment": {
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 1,
				"body": "> [tinktinktink](#comment_1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4): Hello there faggots. Thanks for not hating me so much.The antifa shit was kinda just a LARP, I don't really care about nazi autists, I just wanted to have some fun shitting things up because that's what I do. Breaking things is fun.The spam will probably stop when I get too bored, or my script breaks, or someone implements a security measure, or my computer gets too slow from multiple instances eating up the RAM.Either way, decentralized shit almost never works, I will be really impressed if this network survives without using any centralized service like the ID providers.btw, the ID provider idea is pretty good, I don't think I can generate IDs fast enough to do any real harm, but using them is kinda against the decentralization thing right? :^)\n\nI guess somebody had to do it. it may as well have been you.",
				"added": 1565325223
			}
		],
		"1565132888_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "Sugar is the biggest factor in obesity... the other name for sugar is White Death.",
				"added": 1565365141
			},
			{
				"comment_id": 3,
				"body": "This is interesting: https://www.theguardian.com/society/2016/apr/07/the-sugar-conspiracy-robert-lustig-john-yudkin",
				"added": 1565365596
			}
		],
		"1565430707_16joHUdKRd7Qfjp6fjTfHkaqwkrUhj7svk": [
			{
				"comment_id": 4,
				"body": "> [r6uysrgw4g4tg](#comment_7_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): What does that have to do with anything...? Gab is full on Zionist and is happy to host literal ADL drones that hunt down, harass, attempt to dox, and attempt to deplatform so-called antisemites. \"The Catcher\" comes to mind. They also deplatformed Patrick Little after shadow-banning proved futile.\n\nI've been on Gab from the beginning and have seen this same bullshit lie plastered on Voat, Reddit and other sites. Patrick Little was banned for doxing which is against Gab rules. He was given many chances to redeem himself but continued anyway. Stop spreading bullshit lies about other sites unless you can provide definitive proof... otherwise you're just the Jew shill trying to undermine sites that support free speech.",
				"added": 1565448756
			},
			{
				"comment_id": 6,
				"body": "> [r6uysrgw4g4tg](#comment_9_1DJDoGruBajCdDVznWRKd2MBLZZUYpM8EJ): It's been over five hours.  Cough up the proof of dox if he's really guilty. Every time this stupid subject gets brought up, no one can ever produce the proof of the accusation... [...]\n\nThere have been several high profile banns on Gab. I believe the first was Weev because he made a post about killing Jew children which approached the call to action line.\n\nThen there was Paul Nehlen who was banned for doxing (https://forward.com/fast-forward/398249/even-the-alt-right-is-sick-of-paul-nehlen).\n\nThen there was Patrick Little who pushed the envelope with posts against Jews, where some were very close to the call to action line. The post on doxing was removed before anyone saw it, and while many requested to see it, it was never released... because that would be doxxing.\n\nMany of the posts are posted on Patrick Little's site (https://littlerevolution.us/2018/11/20/banned-from-gab/).\n\nIt's kinda funny that you demand proof from me, yet you have no proof of the ban otherwise.",
				"added": 1565482006
			}
		],
		"1565420146_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 5,
				"body": ">another gaming talk site\n\nsmh",
				"added": 1565450214
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 7,
				"body": "It's all a test to see how strong you are.",
				"added": 1565487581
			}
		],
		"1565494134_1Cv5b38VHaK8XGixrtufnKWqZJiHqAne5v": [
			{
				"comment_id": 8,
				"body": "> [542vg3](#comment_2_1Fi6FbNTzE6kZNEbR23FzcndyJh3RE9Nhx): this post glows harder than 08chan. [...]\n\nfyi... I sell tinfoil hats.",
				"added": 1565501534
			}
		],
		"1565667891_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 9,
				"body": "Preaching to the choir... for whatever good it will do.",
				"added": 1565668143
			},
			{
				"comment_id": 10,
				"body": "> [gannarchism](#comment_3_1GKvSWUo9g1J3RscxqQJBrHm7ge8Pdcdb3): can't you just like, not hate people based on things they can't control?\n\nI can't see the hate here... would you mind pointing it out to me?",
				"added": 1565670060
			}
		],
		"1565832419_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 11,
				"body": "Hard times create change... pray for hard times.",
				"added": 1565836521
			}
		],
		"1565806779_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 12,
				"body": "> [12345679](#comment_11_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): It is kind of a buggy platform, especially over TOR. Don't assume there is censorship by some big group considering it is all decentralized.\n\nPeople with Alzheimer's disease tend to repeat thenselves.",
				"added": 1565844482
			},
			{
				"comment_id": 13,
				"body": "> [wejehteman2](#comment_12_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P): Thanks for clarifying. Nate Higgers thread is pretty good too though.\n\nNigger hating threads are always fun... unless you're a nigger.",
				"added": 1565844603
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 14,
				"body": "Day before girl reaches age of consent... you're a Pedo. Day after girl reaches age of consent... you're golden.\n\nSeems kinds weird.",
				"added": 1565845050
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 15,
				"body": "I could care less: https://youtu.be/om7O0MFkmpw",
				"added": 1565920269
			},
			{
				"comment_id": 16,
				"body": "> [fodase](#comment_31_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Zeronet is a honeypot, just like TOR.\n\nThe internet is a honeypot... burn your computer and triple the thickness of your tinfoil hat.",
				"added": 1565935367
			}
		],
		"1565968613_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 17,
				"body": "There was a time here in the US that we never locked our doors and never worried about anyone breaking in to steal our property or kill us. All you have to ask yourself is, what changed.",
				"added": 1566138065
			}
		],
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 18,
				"body": "For people that have quit smoking, it is always easier to restart if you've been drinking... drinking must truly make you stupid.",
				"added": 1566147867
			}
		],
		"1566056701_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 19,
				"body": "What's this hall of cost you're talking about?",
				"added": 1566147914
			}
		],
		"1566352663_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 20,
				"body": "Edgy retard trying to be edgy... did your baby sitter leave her computer unattended or something.",
				"added": 1566365669
			},
			{
				"comment_id": 21,
				"body": "> [trotski](#comment_14_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV): this is the saddest thread in ZeroNet history\n\nThis is why no forum should be without a down vote button.",
				"added": 1566365733
			},
			{
				"comment_id": 28,
				"body": "> [duck0](#comment_113_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): That's one way to get people talking about this place.\n\nIt would make things more interesting to have a few glowniggers running around here.",
				"added": 1566439353
			}
		],
		"1566241934_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": [
			{
				"comment_id": 22,
				"body": "It's funny how *Security Concerned* people willingly trust a VPN service: https://gist.github.com/joepie91/5a9909939e6ce7d09e29\n\nKinda weird, don't you think?",
				"added": 1566366300
			},
			{
				"comment_id": 31,
				"body": "> [r3naam3r](#comment_25_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): So find me a better alternative for system-wide secure connection. VPNs at least protect me from ISP spying, protect me from copyright scareletters, and allow me to bypass geoblock. They are definitely better than using clear connection. I'd rather some privacy-friendly country VPN have my logs who may not sell them to admakers than my ISP who will DEFINITELY sell them and keep them forever.\n\nI don't have a problem with VPN's as long as people understand that they are not a security utopia.",
				"added": 1566483477
			}
		],
		"1566400778_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 23,
				"body": "And... what is the point of this?",
				"added": 1566400901
			}
		],
		"1566395604_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 24,
				"body": ">  \"I Dalton Barnhart vow to bring my fathers m15 to school and kill 7 people at a minimum.\"\n\nLooks like a credible threat to me... this statement is against US law and the police are justified in pursuing the person making said statement.",
				"added": 1566408198
			},
			{
				"comment_id": 27,
				"body": "> [indooroutdoor0](#comment_5_1BQsUwSERp4xHXMqkPDBKx1LHUtvnA4cEV): Jokes are constitutionally protected free speech in the US.  Satire and parody are protected.   [...]\n\nI agree that context is ultimately important, and responsibility to your well being is important also... which means \"don't say stupid shit on public forums that can come back to haunt you\". So many people say things that they would never say in person, probably because they feel safe and secure communicating through an inanimate object like a computer.",
				"added": 1566436506
			}
		],
		"1566425767_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 25,
				"body": "> [kusoneko](#comment_2_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): what's dat?\n\n(R)eally (S)imple (S)yndication.",
				"added": 1566429203
			},
			{
				"comment_id": 26,
				"body": "> [kusoneko](#comment_4_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I wasn't asking about RSS but about dat project\n\nLooks interesting: https://dat.foundation/",
				"added": 1566429406
			}
		],
		"1566447039_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 29,
				"body": "I wonder when we see the first banker go to jail for years of fraudulent and predatory lending.",
				"added": 1566450056
			}
		],
		"1566475780_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 30,
				"body": "Just like other requirements, such as libs and frameworks, the best browsers should be required for ZeroNet... no compromise.",
				"added": 1566483242
			}
		],
		"1566538598_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 32,
				"body": "> [xcape2net](#comment_354_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):   Seems like they were correctly pointing out many of the problems with capitalism.  Certainly capitalism doesn't do away with corruption.\n\nThis is the big problem... Neither Capitalism or Democracy will work with an immoral society and the affects are even more so with socialism. The problem is not with these systems in general, but with the moral breakdown of society they become corrupted.\n\nIt has been said that money is the root of all evil, but money is not really the problem... it is really greed and the lust for power.",
				"added": 1566570152
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 33,
				"body": "Religion can be a good thing, as it forms a moral basis for society. The problem is that over time it breaks down and becomes corrupted. We are witnessing this exact thing in western societies today as people move away from Christianity.",
				"added": 1566571259
			},
			{
				"comment_id": 36,
				"body": "> [eyeballgummy](#comment_6_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): ... Judeo-Christian majority!\n\nSeriously... the only people that refer to *Judeo-Christians* are cuckservatives and woke boomers.\n\nIt's just Christian.",
				"added": 1566743641
			}
		],
		"1566565720_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 34,
				"body": "South Africa will become another 3rd world shithole as the low IQ niggers take over and destroy everything that Europeans built... sad, but it is just inevitable.",
				"added": 1566571424
			}
		],
		"1566591029_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 35,
				"body": "Artificial Intelligence is a misnomer, it is actually Simulated Intelligence... too bad the AI terminology is too ingrained into our vernacular to change at this point.",
				"added": 1566594948
			}
		],
		"1566752054_1CgQ84JRbPsRt4RCi5mkUHBj4oNoSDgWaZ": [
			{
				"comment_id": 37,
				"body": "And your point is?",
				"added": 1566791375
			}
		],
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": [
			{
				"comment_id": 38,
				"body": "> [gitcenter](#comment_769_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Nope, the recommended way is to wait for nofish. This usually takes little time.\n\nThe only reason I can come up with for this hard limit is that it's an anti-spam tactic.",
				"added": 1566915615
			}
		],
		"1566954654_17YLe3Jg9YRvVknLPRrtzuKcTs43TKkfhz": [
			{
				"comment_id": 39,
				"body": "Where did everybody go?",
				"added": 1566966586
			}
		],
		"1567001589_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 40,
				"body": "Let's not and say we did.",
				"added": 1567003164
			}
		],
		"1567109265_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 41,
				"body": "When you steal shekels from the Jew, expect to get a sentence equivalent to mass murder.",
				"added": 1567130599
			}
		],
		"1567130399_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 42,
				"body": "> [gitcenter](#comment_817_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Well, uh, all traffic is run over clearnet in this case. Namely: [...]\n\nI am running ZeroNet on A headless Debian box in \"Tor:Available\" mode (I browse on a windows machine). My understanding was that Tor is used for some of the traffic in this case, but I couldn't find an explanation of how ZeroNet determined when to use Tor and when not to.\n\nMy assumption was that in \"Tor: Available\" mode, file downloads are done through Tor and stuff like tracker communication is done outside Tor.",
				"added": 1567175397
			}
		],
		"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 43,
				"body": "What version of ZeroNet is required to install the plugin?\n\nEdit: some comments here indicate that you need to be running a py3 version of ZeroNet... it might be a good idea to put that requirement next to the install button where everyone can see it.",
				"added": 1567228707
			},
			{
				"comment_id": 44,
				"body": "> [gitcenter](#comment_839_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It tells you that you have too old ZeroNet version when you try installing.\n\nWhy answer with something that is obvious, instead of telling people *what version is required* ????",
				"added": 1567231912
			},
			{
				"comment_id": 45,
				"body": "> [gitcenter](#comment_842_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Hm, there's no button to \"update to this version\", there's only \"update to latest version\", so my answer is both straightforward and easy to follow.\n\nI didn't ask about a button... why even bring that up. I only asked about the *minimum required version to use name.YO*.",
				"added": 1567259818
			},
			{
				"comment_id": 46,
				"body": "> [gitcenter](#comment_848_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): When you press \"Install\", it either works or doesn't work. If it installs successfully, you shouldn't even care about the version because you're running the correct one. And if it doesn't work, there isn't anything you can do except updating to the latest version.\n\nThis tells me that you don't know. If you did, you would just answer with a version number.",
				"added": 1567260123
			},
			{
				"comment_id": 47,
				"body": "> [gitcenter](#comment_843_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I've updated the message to either \"Your ZeroNet is outdated, please reinstall from zeronet.io\" or \"Please update ZeroNet to (at least) v0.7.0, rev4191\" if you think that's required.\n\nThis answer is at least close because it does have a version number.\n\n>\"Your ZeroNet is outdated, please reinstall from zeronet.io\"\n\nYes, I know that, it's obvious from the error elicited when trying to install the plugin.",
				"added": 1567260321
			},
			{
				"comment_id": 53,
				"body": "> [publicality](#comment_45_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo): Everysites, except for ZeroHello, even .bit and .yo are affected. I should've copied the error that appeared on screen... [...]\n\nDon't bother asking him about versions and/or rev's required for Name.YO, because he won't tell you.\n\n(read our exchange below for an example)",
				"added": 1567396224
			},
			{
				"comment_id": 54,
				"body": "> [gitcenter](#comment_923_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I told you the correct version and a rev, so I'm pretty sure that I answered your question\n\nI was being facetious because I knew you would see this... you will have to admit that it would have been a lot easier if you had just told me the version/rev from the beginning. Name.YO must do some kind of check to see if ZeroNet is the correct version and if not it elicits the error to update ZeroNet. I could have looked at the code myself if I knew where it was, but I figured it would have been just as easy to ask.",
				"added": 1567431610
			},
			{
				"comment_id": 55,
				"body": "> [filips](#comment_179_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): @gitcenter @nofish I would also recommend to update ZeroUpdate zite with better text description. [...]\n\nWhy would you want to do proper version control?   /s",
				"added": 1567526904
			}
		],
		"1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 48,
				"body": "> [unicornninja](#comment_7_1N2oRUnvobrYC1LQPEeVujC7oucRX7AG7X): Call me a script kitty, but why not just fork zeronet into an organization repo yourself, i'd think most contributors given the choice would push there instead of a centralized, one-owner repo\n\nIt is always best to not fracture development by forking... of course it is always an option when there's no other path.",
				"added": 1567292273
			},
			{
				"comment_id": 49,
				"body": "> [mfs](#comment_44_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W): Glownigger all day long... [...]\n\nAnd your point is...?",
				"added": 1567296900
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 50,
				"body": "> [kidcourageous](#comment_78_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): What the fuck kind of cult ass term is \"glownigger\"?\n\nIt's a chan thing... it came from a statement that Terry A Davis made about the CIA. He had severe schizophrenia and would ramble on about the CIA spooks being \"glow in the dark niggers\".",
				"added": 1567299435
			},
			{
				"comment_id": 51,
				"body": "Don't throw unsubstantiated accusations around... as far as I can tell from here, you glow just as much as everyone else.",
				"added": 1567299522
			},
			{
				"comment_id": 52,
				"body": "> [kidcourageous](#comment_79_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): The Temple OS guy?\n\nYes, that's the one... to bad he's gone, I kinda liked listening to him.",
				"added": 1567303262
			}
		],
		"1567541468_1FgxurbLKzsfP2arYX7xVG4akjCdMs3uEQ": [
			{
				"comment_id": 56,
				"body": "> [bigbadbob](#comment_554_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): victimless crime\n\n>... victimless crime ...\n\nIs there such a thing?",
				"added": 1567557322
			},
			{
				"comment_id": 57,
				"body": "> [bigbadbob](#comment_558_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I gave a bad example but by definition yeshttps://en.wikipedia.org/wiki/Victimless_crime\n\nI don't think that can apply to any form of theft, unless it is thieves stealing from thieves.",
				"added": 1567558000
			}
		],
		"1568002955_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 58,
				"body": "Define hate.",
				"added": 1568005756
			},
			{
				"comment_id": 60,
				"body": "I guess some people are too weak to face real life and need to medicate themselves with mind altering drugs... this is just part of the degenerate breakdown of western society.\n\nI pray for hard times so the strong can rise.",
				"added": 1568171174
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 59,
				"body": "> [xcape2net](#comment_372_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): That's an idea, but there are a lot of idiots to block.  And, I sort of have a problem limiting free speech on a platform that is designed not to limit free speech.  Maybe I should get over that.  I'm also afraid that I might block people like Kidcourageous for one of his many obnoxious comments and miss all of his other good comments.\n\nI have a problem with people looking for a safe space. This is life... deal with it.",
				"added": 1568041004
			}
		],
		"1568139498_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 61,
				"body": "Looks like it's recovered.",
				"added": 1568171724
			}
		],
		"1568199205_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g": [
			{
				"comment_id": 62,
				"body": "> [deunde](#comment_1_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g): ... hate speech ...\n\nI keep looking for this \"hate speech\" that everyone keeps talking about, but I never seem to find it... please define it for me so I have a better understanding of what to look for.",
				"added": 1568217029
			},
			{
				"comment_id": 63,
				"body": "> [bigbadbob](#comment_666_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Hate speech is a bull shit concept tyrannical governments use to silence any and all opposition with loosely worded hate laws.  Never give up free speech if you have that right.\n\nI was being cynical, but that is a good definition anyway.",
				"added": 1568260676
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 64,
				"body": "No need for math... observation is all you need.",
				"added": 1568390056
			}
		],
		"1568417535_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 65,
				"body": "> [alternedleanings](#comment_14_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy): \"smart liberal\"\n\nYou are over estimating their intelligence.",
				"added": 1568426352
			}
		],
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 66,
				"body": "I have ZeroNet run 24/7 on a headless Debian machine and browse on a different computer running windows... let me know if you have any questions on how to set this configuration up.",
				"added": 1568556822
			}
		],
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 67,
				"body": "Lifehack for the lazy: McDonalds, Burger King, KFC, pizza du jour... etc.\n\nOtherwise, learn to cook efficiently. I held a full time job and always found time to cook proper meals for my family. If you take more then 30 minutes for most meals, your doing it wrong. There's plenty of information on reducing meal preparation,  all you have to do is read.",
				"added": 1568557974
			},
			{
				"comment_id": 68,
				"body": "> [leftside](#comment_853_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Junk food = nitrite = carcinogenic = cancer = early death\n\nYes, and obesity.",
				"added": 1568558130
			},
			{
				"comment_id": 70,
				"body": "> [brianhanson2nd](#comment_41_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): ... canned veggies ...\n\nFrozen veggies are much better for you and are usually less expensive. Certain things like canned tomato's make sense though.",
				"added": 1568677950
			}
		],
		"1568607154_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 69,
				"body": "> [undisputed](#comment_1_19MNueeefmtMbBKPCdqtB8UnQmZC8QwLJX): QoS\n\nQuality of Service... maybe some context would help explain whatever you are trying to convey here.",
				"added": 1568652318
			},
			{
				"comment_id": 71,
				"body": "> [randomshits](#comment_114_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): My ISP charges me an additional 20 on my bill if I go over 1 TB, so I just use 5 of that and put zeronet on a vps that comes with 100gb of bandwidth a month.\n\nI actually have a business class account and have exceeded 2TB per month many times. I'm just a little concerned about Zeronet being open ended as far as bandwidth goes. It seems that the usage isn't consistent like Freenet is and I may get dog piled if the leachers proliferate suddenly.\n\nOn Freenet I can set an upper limit and not worry about it. QoS is not the best because it doesn't understand the protocol to the degree that it can optimize bursting on small packets and limiting where the larger data lies... this can only be done in the application.",
				"added": 1568682487
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 72,
				"body": "The motion has been seconded... all in favor say aye, those opposed say nay",
				"added": 1568775528
			}
		],
		"1568987984_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 73,
				"body": "But there is no dark theme and it makes my eyes hurt... one would believe that a dark theme would be a number one priority.",
				"added": 1568989754
			}
		],
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 74,
				"body": "How about a game of Global Thermonuclear War?",
				"added": 1569167392
			},
			{
				"comment_id": 76,
				"body": "Chess is the best.",
				"added": 1569202617
			}
		],
		"1569200371_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": [
			{
				"comment_id": 75,
				"body": "I think it's an indication that you talk too much. :)",
				"added": 1569202305
			},
			{
				"comment_id": 77,
				"body": "> [randomshits](#comment_156_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): But until then the only other option is to make a new ID, make your own forum, use a different forum, or go back and edit any irrelevant bullshit out of your previous posts to reclaim some of that quota. \n\nA person should be able to set an expiration time for older comments so that space is reclaimed after a set time.",
				"added": 1569204037
			}
		],
		"1569278789_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 78,
				"body": "Context for those interested: https://puri.sm/products/librem-5/",
				"added": 1569291845
			}
		],
		"1569297597_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 79,
				"body": "Your link is bogus.",
				"added": 1569299890
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 80,
				"body": ">Instead of the government being our representatives, they become our oppressors and masters.\n\nThat is because the general population becomes apathetic toward their civic duty of choosing good people for the positions. Many people choose representatives by throwing a dart at a dart board instead of actually becoming an informed voter. Then you have the voter that is a team member that would rather choose a corrupt member of \"their\" favorite team instead of choosing someone with a little moral fiber.\n\nIt really is the fault of the voters.",
				"added": 1569514502
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 81,
				"body": "You're retarded, there is no similarity between the two... keep on trolling.",
				"added": 1569559668
			},
			{
				"comment_id": 82,
				"body": "> [hotwheels](#comment_26_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu): both are servant to the jew\n\nI'll agree to a point... Trump 10% Jew pawn... Hillary 100% Jew owned.",
				"added": 1569562182
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 83,
				"body": "It's because no one wants to contribute to the network, because it takes resources such as hardware and bandwidth. Also, people fear that illicit content may cause them to be subject to scrutiny. The majority just wants to be a leach and there is no incentive to do otherwise.",
				"added": 1569600411
			}
		],
		"1569605502_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U": [
			{
				"comment_id": 84,
				"body": "(((They))) will do anything to prevent Brexit.",
				"added": 1569613322
			}
		],
		"1569889210_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 85,
				"body": "And your point is?",
				"added": 1569893755
			},
			{
				"comment_id": 86,
				"body": "> [zaron](#comment_13_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): There's some hot Brazilian bitches tho.\n\nThey're at least 50% nigger though.",
				"added": 1569900456
			}
		],
		"1570070514_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 87,
				"body": "Fed posting with flair.",
				"added": 1570072821
			}
		],
		"1570159543_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 88,
				"body": "> [filips](#comment_236_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Use Markdown for links. Here are some details about this. [...]\n\nDoes ZeroNet use a modified markdown implementation?..... I haven't seen an official syntax page anywhere yet.",
				"added": 1570245050
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 89,
				"body": "I can only see the government getting involved to the same degree the FDA does on food. There needs to be standards set on vaping equipment and supplies, so that dangerous crap from China is not sold to unsuspecting customers.",
				"added": 1570302612
			}
		],
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 90,
				"body": "> [robione](#comment_318_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): surprising the \"build your own\" mantra of arch is locked into systemd. [...]\n\n[Devuan](https://devuan.org/) is a Debian fork that was created specifically to move away from systemd.",
				"added": 1570423351
			}
		],
		"1571103290_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu": [
			{
				"comment_id": 91,
				"body": "Each user is a node... the more users there are, the more nodes are available.",
				"added": 1571114259
			}
		],
		"1571190639_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 92,
				"body": "The war is already here... it's the information war.",
				"added": 1571245413
			}
		],
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 93,
				"body": "> [styromaniac](#comment_1145_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's nobody anti-white here. Have fun being edgy, as you always are.\n\nIt's just a \"feel good\" thing when you can holler into the echo chamber. :)",
				"added": 1571638012
			}
		],
		"1572281710_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 94,
				"body": "Which zites are those?",
				"added": 1572282370
			}
		],
		"1572513197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 95,
				"body": "Helicopter rides are a sure cure for pedos and faggots, and they're fairly cost effective and readily available.",
				"added": 1572634390
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 96,
				"body": "When it was 99.8% faggot free 30 years ago.",
				"added": 1572742983
			}
		],
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 97,
				"body": "Okay, glownigger... I'm on it.",
				"added": 1572803086
			}
		],
		"1573590783_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 98,
				"body": "> [styromaniac](#comment_1238_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Is that only on Py3? I can't pull it down.\n\nYes, only on v0.7.1 and later.",
				"added": 1573610938
			}
		],
		"1574115241_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 99,
				"body": "kys... it is about the Nigger and Jews.",
				"added": 1574120483
			}
		],
		"1574292051_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 100,
				"body": "Furries are degenerate faggots... prove me wrong.",
				"added": 1574301664
			}
		],
		"1574717925_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 101,
				"body": "I hate all of this stupid \"sudo\" shit... just login as root and do the work. I've administered Unix systems from the late 70's and never trashed a system. Telling someone to edit using 'sed' is a sure way to totally trash a system with one typo on the command line.\n\nMost Debian based systems provide 'nano' for a simple text editor... just learn to use it.",
				"added": 1574718589
			}
		],
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": [
			{
				"comment_id": 102,
				"body": "> [goodafternoon](#comment_54_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): I wish Zites here had auto content deletion after a set date.\n\nThat's kinda the way Freenet works. If content isn't accessed for a period of time, it will cease to exist on the network. That prevents stale crap from accumulating and eating up disk space.",
				"added": 1574877320
			},
			{
				"comment_id": 105,
				"body": "> [goodafternoon](#comment_56_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3): there was some things I need to buy to use the network?\n\nYou don't have to buy anything, you just download it and run it: [Freenet](https://freenetproject.org/)",
				"added": 1574914602
			}
		],
		"1574730236_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 103,
				"body": "> [edgelordofdecent](#comment_277_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Fediverse is infested with sjws\n\nThat's why the Gab folks decided not to use that system and just rolled their own.",
				"added": 1574877459
			},
			{
				"comment_id": 106,
				"body": "> [edgelordofdecent](#comment_286_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Gab is a honeypot though.\n\nThe internet is a honeypot... don't be an idiot.",
				"added": 1575007070
			}
		],
		"1574877477_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": [
			{
				"comment_id": 104,
				"body": "I'm all for people like you just killing yourself, because it has become apparent that you have nothing left to live for... how about that for a philosophical statement.",
				"added": 1574878278
			}
		],
		"1575532867_1ApA2iB2ZgqnbhHWsG7XH5QZQkPDqHNKzZ": [
			{
				"comment_id": 107,
				"body": "Drugs make you stupid, and from the looks of this post, you already have all the stupid you need.",
				"added": 1575562039
			}
		],
		"1575912544_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 108,
				"body": "Translation:\n\n\"Connect with others from this group to avoid confusion with other languages\"",
				"added": 1575939072
			}
		],
		"1576643812_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 109,
				"body": "Pump and dump... that's what I always say.",
				"added": 1576647230
			}
		],
		"1577105495_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 110,
				"body": "Just because you're too retarded to figure it out doesn't mean other people wont be able to use it.",
				"added": 1577250083
			}
		]
	},
	"comment_vote": {
		"1_15QMtSMe3Ckgr3m3bajRgDbNsChibX6sK4": 1,
		"1_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": 1,
		"50_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"2_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81": 1,
		"833_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"10_1BP5GrM5EDw9SVGmRJan1kvQ2DB2Xm1Rgo": 1,
		"19_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"72_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"28_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"31_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r": 1,
		"14_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"113_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"5_1BQsUwSERp4xHXMqkPDBKx1LHUtvnA4cEV": 1,
		"49_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"1_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw": 1,
		"7_1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw": 1,
		"1020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"149_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"112_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"158_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"559_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"120_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"86_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"64_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK": 1,
		"2_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g": 1,
		"656_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"689_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"12_12fWKDf6FpQhpQua3g1UkA1z6AxHSF1d2p": 1,
		"13_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm": 1,
		"25_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": 1,
		"46_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"116_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"52_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"24_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": 1,
		"73_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"3_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": 1,
		"22_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"7_1JmzascVT1gUZZ5mLg8mg6pZKmTGdGNPXm": 1,
		"1114_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"875_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"169_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"38_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"67_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"909_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"71_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1_1MrLyY93aje7NYUxBoxsA9dxMHtePMmVBh": 1,
		"236_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"5_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1,
		"1_1Gvs3AKBY5YjUMPchHuoQuAYnWApBm1myY": 1,
		"569_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"55_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"277_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"1345_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}