{"cert_user_id": "Codes4Fun@github", "next_topic_id": 2, "topic": [{"topic_id": 1604065275, "title": "Bundle sites", "body": "_This is just to formalize what was said on reddit._\n\nThe idea is that users can create a site that is a bundle of other sites, with the intention of distributed those sites and reducing the number of connections. I don't think the concept is the same as [Merger sites](https://github.com/HelloZeroNet/ZeroNet/issues/232), but it takes the hub concept presented there and tries to generalize it for all sites instead of just merger sites. In that way also it provides a solution to the con of having _one user per site_ possibly resulting in lots of connections.\n\nSo an example would be to look at the six default/sample sites: ZeroBoard, ZeroBlog, ZeroTalk, ZeroMail, ZeroChat, Reaction GIFs. Those sites end up needing 30 connections (5 \\* 6). So in this case someone can create the first bundle site that has those sites and let other users know its available. When users connect they will only need 5 connections to the bundle site, and if they are helping sync they would maybe have 5 extra connections for each site they are helping sync. Additionally if a user doesn't want to seed all those sites they can delete the bundle site and simply seed the sites they want instead (an advantage over hubs).\n\nA bundle site can also provide an interface like ZeroPoll that allows users to request and vote on sites to be added or removed, the site owner can then add new sites to the bundle or remove sites.\n\nSyncing could possibly be helped by having it that when a user connects and seeds a bundle, zeronet will automatically connect and seed to a random site in the bundle, that node will then help keep the bundle and site in sync with each other. If a user is already seeding many sites in a bundle those sites can then be deleted except maybe one which will be used to sync.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1461261301, "modified": 1583331078, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/429", "source_type": "github"}], "next_comment_id": 3, "comment": {"1604065275_mirrored_Codes4Fun_github": [{"comment_id": 1, "body": "It could have a cap of 20 sites or something like that, at least in that way it could potentially reduce connections by 10 times or more. The cap would force people to create bundles and pick bundles that make sense for them.\n\nBundles would also help seed sites, those who seed a bundle would technically also be seeding the sites in the bundle. So someone who wants to go to a site can either connect to those directly seeding the site or those seeding a bundle that has the site, and they wouldn't (I would think) need to seed the bundle itself.\n\nThis might be something particularly useful for proxies as well, since they end up seeding lots of sites, they could reduce their connections by a lot.\n\n> And if the bundle owner decides to remove your site it will also make it unaccessible for the users, because they seeding the bundle site.\n\nIt could be too that a user could specify which sites they like in the bundle and if the owner removes the site, ZeroNet will automatically seed the site separately from the bundle. But this will also create another problem where a bundle could remove all sites, and then user ends up now with 10 times more connections. But it could also be that If a bundle only contains one of their sites the bundle is no longer seeded and the last site is seeded independent of it.\n\nOf course another possibility (which maybe harder) is if bundling were automatically handled in zeronet and there is no owner of a bundle, rather zeronet looks for common sites between nodes and creates and matches bundles. When a user adds or removes sites, zeronet will see if there are better matching bundles available.\n\nActually the whole concept of a bundle may be unnecessary when thinking about zeronet automating this (and maybe zeronet already works this way and I just don't know) but a node could just find another node who seeds a lot of the same sites they seed and that could replace having to have a lot of connections (two or more nodes could split the load of connections).\n", "added": 1461340728, "modified": 1461340793, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/429#issuecomment-213553014", "source_type": "github"}, {"comment_id": 2, "body": "> And for privacy reasons the connection sharing is totally disabled on Tor. (new .onion generated for every site you seed)\n\nThat would be a benefit to user controlled bundle site over connection sharing, they could get some privacy, much in the same way hubs kind of hide who you are following.\n\n> So think this would require many changes and I think the normal (multiuser), hub sites could work equally well.\n\nHubs probably allow for a more controlled experiment as well, see how things work.\n\nThis issue can probably be closed, unless you want to keep it open for some reason.\n", "added": 1461344384, "modified": 1461344384, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/429#issuecomment-213569935", "source_type": "github"}]}}