{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1555245602_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": 1,
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1555332575_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1555245602_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 1,
				"body": "if you search for keyword \"facebook\" in your favorite search engine, you might get news about why it is down.\n\nBtw, Google works for me. facebook doesn't.",
				"added": 1555246095
			},
			{
				"comment_id": 2,
				"body": "> [franc](#comment_4_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4): google worsks now too for me (not that I use it... I use only duckduckgo.com/lite )\n\nWell, hopefully people start using it less and less everyday. Keep it up!",
				"added": 1555246958
			}
		],
		"1555102211_1DneKe6JjGR26ykd5DWaMJoNyNTnHRHb2q": [
			{
				"comment_id": 3,
				"body": "> [quantumworld](#comment_376_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): All computers are compromised. It is at the hardware level, and it cant be fixed other than an off switch. Nearly all electrical devices can be effected by this.\n\nI agree.\n\nSpectre + Meltdown + Intel inner Operative system (minix) that can read all that is in your HDD.\n^ enough proof.\n\nI heard ARM (atleast old ARM) are the only hope of non-backdoored CPU.",
				"added": 1555267430
			}
		],
		"1554110095_18n7wVi3xtKGEp4a4BYPuhEdfMsztpCnK5": [
			{
				"comment_id": 4,
				"body": "Does russia have any type of censorship like this? Do they ban facebook twitter  youtube like china?\n\nI remember people uploading and watching movies on vkontatke (the russian social network facebook knockoff) and they seemed ok uploading hollywood movies there and hosting them, I wonder if that changed.\n\nI am asking if russia have any type of censorship because if they don't, might aswell host and upload all important services over russia instead of EU/USA",
				"added": 1555399684
			}
		]
	},
	"comment_vote": {
		"364_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"4_1KEXLrCcQYabnbLngN1Vh3VnG3yD2h21Uj": 1
	}
}