{
	"next_topic_id": 16,
	"topic": [
		{
			"topic_id": 1545616567,
			"title": "Filmy - po Polsku.",
			"body": "Witam; Od pewnego czasu są dostępne filmy po polsku; dotyczą one różnych tematów. W zasadzie to jest tam wszystko możliwe do spotkania. Filmy są sprawdzone, i zawierają pewne przekazy, które mogą się przydać nam i nie tylko nam. Jest humor, opowiadany, pokazywany,  i śmieszne filmiki, Muzyka, typu miła dla ucha, Taniec, czyli ciekawe pokazy artystów z całego świata, Polityka w miarę sprawdzona, o ile można politykę sprawdzić. Polityka historyczna, czyli sprawy które były dawniej, i nie wyciągnięto z tego żadnej nauki - na przyszłość. Technika historyczna i technika dzisiaj. Fantazja , która w pewnym momencie przestaje być fantazją, Wiedza paranormalna, coś co istnieje, ale fizycznie jest trudno udowodnić, Fizyka ta ze szkoły i fizyka faktyczna która istnieje w przyrodzie, Kościół, który nas okłamuje dla zysku, kościół który i jest fałszywy i pełen pogardy dla swoich wierzących, Biblia która jest pełna przeinaczeń, kłamstw, fałszerstw, której zadaniem jest podporządkowanie wiernych Watykanowi, nie zapominajmy że jest to \"Państwo\" w państwie. Kosmos i nie tylko, oraz związki z nim, Astronomia która się kłóci z fizyką i zdrowym rozsądkiem, Miary, systemy, pomiary, liczby, które są jednym wielkim kłamstwem, Każdy uparty - zawzięty człowiek może to sprawdzić, Zdrowie, nasze i naszych dzieci, które zależy tylko od nas, i naszego zdrowego rozsądku, Zapobieganie, Leczenie, Szkodzenie,  Farmacja, czyli, Big-Farma, która nas ewidentnie posyła do piachu, która jest niebotycznie droga, Podam przykład, ile kosztuje w aptece jedna tona węgla drzewnego, 1-tona, to duża liczba, ale cena, też jest OK. Tak dobrze czytacie - węgiel drzewny , który służy jako absorbent trucizny, no nie pospadajcie z krzeseł, - 200,000-zł. tak dobrze czytacie , węgiel drzewny na grylla za 200,000zł. I jedziemy dalej,  Dziwne sprawy, nie spotykane nigdzie, albo raczej nigdzie nie publikowane do tej pory, Wolna energia, która nas otacza, która jest za darmo dostępna, Wiedza, która nas otacza, każdy może z niej skorzystać, jeden warunek, to musi być - służyć dobremu celowi, Informatyka, i związane z nią sprawy, śledzenie, inwigilacja, trojany, dobre i złe systemy, Matrix, i nasze w tym miejsce, nasz udział, który został zaplanowany, Odżywianie, czyli nasze codzienne jedzenie, które jest zatrute, pytanie? Przez kogo? Te i inne pytania, które macie - możecie uzyskać odpowiedź, w tych 'FILMACH' . Są one wyselekcjonowane, sprawdzone, zweryfikowane, z wiedzą dostępną na dzień dzisiejszy. W związku z pytaniami, dotyczącymi tych filmów można zadawać pod adresem, \" tomasz21@zeroid.bit \". Jak rozpoznać te materiały? Zawsze maja taki numer, na przykład - 2018.12.23.03.Technika-,   2012.01.17.01.Polityka-, Na You-Tubie, maja gifa- wirujący sześcian,. Brak strony powoduje ze te materiały są umieszczane na, You-Tuba, KOPY-CAT, i były umieszczane na Zero-UP-ie. \nMateriał jest troszkę po rozrzucany, ale to siła wyższa. Jeśli możecie - Sedujcie- teraz na starcie,\njak przybędzie ludzi, to sprawa będzie łatwiejsza. Najgorszy jest początek. Dodawajcie uwagi pod filmami, oraz na blogu. Sprawi to łatwiejszą koordynację. Ja osobiście wasze filmy będę sedował. \nTo tyle wprowadzenia, pozdrawiam i życzę wesołych i pogodnych świąt. Do usłyszenia, Pozdrawiam.",
			"added": 1545616566
		},
		{
			"topic_id": 1546155194,
			"title": "BEZPIECZEŃSTWO  w  INTERNECIE.",
			"body": "BEZPIECZEŃSTWO   w   INTERNECIE.\nWitam; Temat ciekawy i chyba wszystkim dobrze znany, jak dobrze poznany? Na pierwszy rzut oka, wydaje się że wszystko wiemy na ten  temat. Spróbuję ten temat na nowo przybliżyć, ale z innego punktu widzenia. To ważne. Jest takie powiedzenie - „punkt widzenia zależy od punktu siedzenia”. Od czego by tu zacząć? Zacznijmy od początku. Idziemy kupić Pc-ta, względnie laptopa do sklepu; Jest drogi , kupujemy na raty, tu jest pierwszy punkt kontrolny. Biorąc na raty, podajemy wszystkie nasze dane osobowe, + bankowe, konto, stan zadłużenia, itp. Ktoś powie, a co to ma do rzeczy? Nasz Pc-et ma numer osobisty, który zostaje powiązany z naszym kontem. Może tak być, kupujemy za gotówkę, i płacimy kartą. Sytuacja jest podobna, Nr. Pc-tu, + karta + konto + nasze wszystkie dane. Jakby nie patrzeć nasz Pc-et, ma udokumentowanego właściciela, Serwis już o tym wie, i przekaże dalej. Dostajemy w sklepie gwarancję, + nasze wszystkie dane wędrują dalej, czy chcemy czy też nie chcemy. To jest początek tej zabawnej historii. Przebrnęliśmy  przez zakupy, to nie jest koniec naszej przygody. Jak zbudowany jest nasz Pc-et? Też wszyscy wiemy, przynajmniej większość tak uważa. A więc jest w nim procesor, który dzisiaj może być, wielo  rdzeniowy i  wielo wątkowy. A to tylko oznacza że w naszym procesorze jest kilka mniejszych , niezależnych procesorów. Dodam że każdy procesor ma numer  identyfikacyjny, jedyny na świecie. Taki procesor + program który posiada, to jest taki  mini  komputer. Dla nas potrzebny jest jeden, no góra dwa, - A mamy dziesięć, albo i więcej. Co one robią? Tego nikt dokładnie nie wie. Ścisłą tajemnicą jest wgrany do niego program. Fabryka która produkuje, sama nie wie co tam jest? Od tego jest inny zakład produkcyjny. I tu taka ciekawostka, procesor „Intela” jest produkowany w Izraelu. Niby drobiazg. Ale jeśli weźmiemy pod uwagę, że parę milionów obywateli próbuje kontrolować – siedem miliardów? To nie mam więcej pytań. Tak przebrnęliśmy  przez procesor, mamy teraz  - Płyta główna, Też ma jedyny na świecie  numer. Idziemy dalej, ostatnio zamontowane, tak zwane „UEFI”. Super szpieg, którego już dzisiaj nie można wyłączyć. Kiedyś było można to zrobić, czy faktycznie można było? Trudno sprawdzić. Następny rodzynek dla naszego dobra i bezpieczeństwa, Ipfv-4.  Oraz nowsza wersja Ipfv-6. Co ono robi? Na skróty  przelecieliśmy, przez pokład naszego flagowego okrętu. \nDotarliśmy do domu z nowo zakupionym sprzętem, teraz potrzebny jest „Internet”. Mamy go od dostawcy, gdzie wcześniej żeśmy go zarejestrowali.  Znowu wszystkie dane zostały uruchomione, w zamian otrzymaliśmy nr  Ipf.\nJedyny numer, nie powtarzalny na świecie, służy do łączności w internecie, nie wspomnę o bramkach, ruterach, modemach, swiczach, Numery, numery, i tak bez końca. Szczęśliwie  przebrnęliśmy przez to wszystko. Naszego ukochanego Pc-ta, włączamy do prądu; i zaczynamy jazdę bez trzymanki. Wtyczka do gniazdka, kabelki podpięte, internet włączony i zapłacony. Przycisk „Start” naciśnięty, Chwilę to trwa, kiedyś mówiło się że lampy muszą się rozgrzać. \nDzisiaj lamp, już niestety nie ma, mamy tranzystory i procesory. One działają od zaraz. Pytanie? Z skąd się bierze ta przerwa? Odpowiadam, Za nim zaświeci ekran, nasz Pc-et, zostaje sprawdzony, prześwietlony, na osiemnaście sposobów. Tyle osobiście  naliczyłem, mogłem czegoś nie dopatrzeć. Pc-et, pomyślnie zweryfikowany, ekran się zapala, i mamy jeszcze tylko, hasło, i login, i już możemy używać. No tak, znowu całkiem nie do końca, Jeśli mamy windowsa? To w każdym tam zainstalowanym programie mamy szpiega, ot tak na wszelki wypadek. Przecież ludzie są pomysłowi, i niektóre sprytne zabezpieczenia zdołali ominąć. Jeśli mamy Linuxa, trzeba wyłączyć z tego „Ubuntu”, zostało sprzedane, firmie „Canonikal”. I w zasadzie jest pozamiatane. Ubuntu = windows. Debian-9. Też ma duży znak zapytania.\nDebian-8. Jeszcze jest chyba OK. Umiejętnie używając Linuxa, jako tako możemy utrudnić zadanie naszym przeciwnikom. Ale to jest osobny temat, jeśli będzie zainteresowanie, to mogę napisać co nieco. Wróćmy do bezpieczeństwa,\nOd momentu „START”  zostaliśmy wielokrotnie zweryfikowani, Pozytywnie, że „my” to na pewno jesteśmy „my”. Gdyby było inaczej, wyświetliło by się”ERROR” dużymi literami. I poproszono nas by o kontakt z serwisem. Ja tak miałem. Ale to nie jest koniec tej bajki. Chcemy wysłać list, mejla do znajomego, mamy przecież pośrednika – pocztę- która mocno zadba o nasze bezpieczeństwo. Chcemy przesłać duży plik, też musimy skorzystać z pośrednika, który dla naszego dobra, i tak dalej, i tak dalej. Chcemy ściągnąć\nfilm, znowu jest pośrednik, i tak jest ze wszystkim. Wiecie z czym mnie się kojarzy słowo „pośrednik” sprzed wojennym, handele, handele. Wracamy do bezpieczeństwa, ktoś powie można zainstalować „TORA” szyfrowanie,i jeszcze nie wiadomo co? Cofnijmy się na moment do procesora wielo-wątkowego. \nPYTANIE? Co robią pozostałe części procesora? Czym one się zajmują cały czas?Czy w tym, uczestniczy,  pomaga szybki internet?Jeśli dotrwaliście do tego momentu?  To chyba zaczynacie Jarzyć, że bezpieczeństwo to jest lipa. Jego nigdy nie było, i nigdy nie będzie. Co nie oznacza, że mamy być, stać, bezczynnie. Są sposoby żeby nasypać piachu między zębatki, z wiadomym skutkiem. Ja nie jestem informatykiem, ja jestem hobbystą, który lubi te klimaty, jestem ciekaw świata, jestem oportunistą, nie lubię od dziecka być kontrolowany, taki już się urodziłem i nic nie poradzę. To wszystko jest mocno na  skróty, tak trochę po łebkach. Na ten temat można napisać książkę, i to nie jedną. Zresztą są takie książki. Są szkolenia, dla pen-testera, oni szukają jak się włamać? Ja tylko odwracam pytanie. I wychodzą takie ciekawostki. Polecam wszystkim zainteresowanym, dużo można się nauczyć. A w życiu to nigdy nie jest wiadomo, co się może w przyszłości przydać. Jeśli macie pytania? Pytajcie? Ja spróbuję znaleźć odpowiedź, niestety nie wszystko wiem, ale jest tego całkiem sporo. Miłej lektury, Szczęśliwego nowego roku, bez cenzury, czego wam życzę i pozdrawiam.",
			"added": 1546155192
		},
		{
			"topic_id": 1546977497,
			"title": "'SEEDOWANIE' - po naszemu.",
			"body": "„SEEDOWANIE”-po-naszemu.\nWitam; wszystkie filmy, wyraźnie oznaczone w naszym języku,zobowiązuję się trzykrotnie seedować. To pozwoli  na przetrwanie na tym świecie. Do nich należą; You-Tube, oraz Kopy-Kat. Jeśli macie jeszcze dodatkowo inne miejsca?\nTo zgłoście je do mnie, to też będą seedowane. Musimy się wspierać. Pozdrawiam.",
			"added": 1546977494
		},
		{
			"topic_id": 1548433003,
			"title": "\"YOU - TUBE PL\" - TYLKO PO POLSKU.",
			"body": "http://127.0.0.1:43110/15Lr9YZ4DC9ZF2BSwZc7S1wDr9hTDx9w5h/\nWitam wszystkich; Od dziś wszystkie filmy po Polsku w jednym miejscu. Powinno to ułatwić wyszukiwanie filmów, które są przetłumaczone; tak jak -  napisy,  i lektor.\nOraz filmy typowo Polskie. Zamiast szukać po całym ZeroNecie, to wszystko niech będzie w jednym miejscu. Wielu osobom to ułatwi życie, jak i dostęp do tych pozycji, \nniektóre z nich są już zdjęte przez cenzurę, która ostatnimi czasy się mocno nasiliła. Inne wkrótce też zostaną unieszkodliwione. Niepowetowana strata dla oglądających.\nNie zapominajcie również o seedowaniu, to umożliwi przetrwanie tych filmów w czasie. Każdy z nich zawiera jakieś przesłanie do ludzkości, mniejsze albo większe. Nie żałujcie miejsca na swoim dysku. Jeśli  macie jakieś wartościowe pozycje,  zainstalujcie je tutaj, aby przetrwały dla potomności. Niech inni też na tym skorzystają. Miłego oglądania; Pozdrawiam.",
			"added": 1548432999
		},
		{
			"topic_id": 1549170023,
			"title": "\"APEL\" do  korzystających z tej strony.",
			"body": "Witam wszystkich użytkowników tej strony; Niestety statystyki nie są powalające z nóg.\nAle jak to mówią, nie ma tak źle, aby nie mogło być gorzej. No właśnie jeden z kompów zakończył swój żywot.  Miał do tego pełne prawo, był wysłużony. W najbliższych dniach zastąpię jego, jakimś innym na chodzie. Ale nie  o tym chciałem napisać. Statystyki mówią że w porywach nawet dwadzieścia pięć osób odwiedza tą stronę. Czy to dużo, czy mało. To zależy jak na to patrzeć. Z stąd jest ten apel, może moglibyście kogoś ze znajomych namówić do odwiedzenia, zainstalowania  tej aplikacji, chodzi o „ZeroNet” a co zatem idzie, również tej strony. A co filmów. Parę filmów jest, na poziomie, pięciu równorzędnych oglądających, jest to mała liczba na tym etapie rozwoju. Parę dalej , to liczba -cztery, i  liczba -trzy, no i reszta to liczba -dwa, Liczba dwa jest wynikiem tego, że mój trzeci Pc-et zakończył swój żywot. To pokazuje słabość tego systemu. Sam system jest dobry, ale przy małej liczbie oglądających, no to już jest kicha. I cały projekt może upaść. Z stąd prośba; o namówienie, znajomych do wzięcia udziału w tym przedsięwzięciu. O  zwiększenie liczby użytkowników. Ewentualne, chwilowe wsparcie wrzucanych filmów. Chodzi o to żeby one się zachowały, Wszystkie te filmy są sprawdzone, i zawierają do 90 – 95% - Prawdy. Pełne 100% jest trudno utrafić. Ja tych filmów nie produkuję, więc staram się wybierać tylko takie, które zawierają wysoki stopień prawdopodobieństwa. Jeśli was interesuje inna tematyka, to da się załatwić. Wystarczy napisać, poniżej w komentarzu. Serdecznie wszystkich pozdrawiam, i dziękuje za wsparcie.",
			"added": 1549170018
		},
		{
			"topic_id": 1549577465,
			"title": "INTERNET-JAKI-ZNAMY.",
			"body": "INTERNET-JAKI-ZNAMY.\nWitam;Chciałbym dzisiaj poruszyć temat internetu, takiego jaki używamy na co dzień. Jak wszystkim wiadomo, parę monopolistów trzyma wszystko krzepko w garści. Chodzi też o zasięg, jak i cenę za 1-GB. To że ktoś reklamuje internet bez ograniczeń, ( bez limitu ), to chyba wszyscy wiemy że to jest bajka, ( jedna z wielu ). Oczywiście limit jest, my jesteśmy wyznacznikiem limitu. Na przykład; ile możesz obejrzeć filmów w ciągu dnia? Odliczając spanie, jedzenie, pracę, dojazd do pracy, ( szkoły ). Itp. To się okaże w tym momencie,\nże ta ;liczba nie jest aż taka wielka. Jak jeszcze weźmiemy w ustawieniach , zmienimy rozdzielczość, to jeszcze bardziej poleci ta liczba w dół. Teraz proszę pomnożyć tą liczbę przez 30-dni, i mamy limit, który możemy przyswoić. Można też te liczby zwiększyć do absurdu. Pytanie? Tylko po co. Tak więc reklama „ Internet bez limitu” , to jeden wielki pic na wodę. Więc śmiało możemy korzystać z limitu. Jeśli wiemy ile tego zużyjemy. Wtedy okaże się że cena za internet od dostawcy molocha jest strasznie wysoka. Cena jednostkowa 1-GB. Więc to jest tylko trik marketingowy. „Jak w tym kabarecie”. Teraz mamy paru dostawców internetu mobilnego, oni razem współpracują. Jak to mówią , są od jednej „MATKI”. Jak im się przyjrzymy, to zauważymy pewne różnice. Powiedziałbym, czysta kosmetyka. Średnia wychodzi prawie jednakowa. A  bym zapomniał u nich też jest, tak zwany „ lejek”, który powoduje mocne przyhamowanie szybkiego internetu. Czyli mamy limit, jak go przekroczymy, to jest lejek. Należy do tego dodać zasięg. W mieście to może być albo dobrze, albo kiepsko. Ale w terenie , ( ja tak mieszkam ), To jest DUPA. Żadnego pola manewru nie ma. I trzeba bulić jak za zboże. Jest jeden w okolicy, co ma jako taki mocny sygnał, i kompletny klops. A co z kablem? Światłowód? To zależy gdzie mieszkasz. Kraj mamy dosyć duży. Cena za światłowód też jest brana z księżyca. Nie wiem jak wy, ale ja milionerem nie jestem. Liczy się każda złotówka. Nie wspomnę o satelitarnym, jest nie na naszą kieszeń. Są jeszcze maleńkie firmy które próbują coś na tym ukręcić. \nCeny są zaporowe, co jest oczywiście pojęciem względnym, tak jak wszystko co nas otacza. Ja wynalazłem internet w cenie około, 1,20-zł za 1-GB. To jest cena przybliżona, i może się wahać od czasu na ile jest wykupiona karta. Zależy to też od dostawcy internetu, PLAY  i T-MOBILE , są najtańsze. PLUS – jest najdroższy. Nie przeprowadzałem zbyt dokładnego rekonesansu, bo mogę korzystać tylko z Plusa.  Różnice są poważne; T-Mobile-500-GB=100-zł.\nPlus-100-GB= 100-zł.  Dostawcą jest prywatna firma. Z Alegro. Jestem wolny, nic nie muszę. Żadnych umów, zobowiązań. Karta może być ważna od 3-miesiące, 6- miesięcy, do 1-rok-u. Na strychu mam zainstalowany ruter na kartę,+ 2 anteny, +  kabel, + swicz, i  podłączony sprzęt. LTE- chodzi,  od 20- do 40- a w porywach  czasami się zdarza że i jest więcej. Ostatnio jest jakby lepiej, może to zasługa pogody. Jeśli macie jakieś pomysły, uwagi, proszę napisać i podzielić się z innymi. Jest nas mała grupa, i powinniśmy się wspierać. Jeszcze jedna ważna uwaga,dla tych co dotrwali do końca. Można polepszyć „ZeroNeta”. Trzeba podpiąć się pod inną opcję językową, która ma dużo peerów, czyli dużo ludzi. Zaznaczamy, na przykład, Polska-PL. I dodatkowo, Niemcy-D. Może to być inna opcja, chyba \"NAJLEPIEJ\"  żeby do tego kraju, było bliżej, Północ-Południe-Wschód-Zachód, to tak tylko sugestia. A  na wschodzie, Rosja-RU. W efekcie tego posunięcia wszystko się błyskawicznie seeduje. Ilość, ludzi ma na to wpływ.\nI tak już całkiem przy okazji; proponuję obejrzeć film, który dotyczy internetu,5-G. Autorstwa-E.Pawela. Wie co mówi, zna temat.\n2019.02.03.02.[PL]-Nauka-Zdrowie-Technologia 5G Jako broń technotroniczna. Na tutejszym YouTubie PL\nPozdr.",
			"added": 1549577459
		},
		{
			"topic_id": 1550374869,
			"title": "Polityczne-Zamach na Adamowicza.",
			"body": "Zamach na Adamowicza – część II.     Jest to przedruk;\n\n Dziękuję za komentarze; informacje, źródła, przemyślenia, wnioski dowodowe oraz linki umieszczone pod częścią pierwszą. Przeczytałem wszystkie. Umożliwiły one rozwiązanie zagadki zamachu na Pawła Adamowicza. Oto wniosek końcowy: Zamach na Adamowicza był widowiskową szopką, czyli zamachem fałszywej flagi. Uff… możemy odetchnąć – i jak po każdym mundialu – powiedzieć sobie z czystym sumieniem: Jest dobrze Polacy, nic się nie stało. Wierzę, że Paweł Adamowicz żyje i kiedyś do nas powróci jako skruszony mafiozo lub świadek koronny. Uważam, że nie warto się nad nim użalać. Sprawa zamachu jednak nie przyschła. Nadal toczą pianę ludzie oszołomieni, których mózgi jeszcze poprawnie nie przetworzyły tego, co dwa tygodnie temu widziały ich oczy: że Adamowicza nie „zabiła” mowa nienawiści ale sprawna akcja z nożem desantowym. Zabiła na niby, bowiem to wszystko było tylko niskobudżetowym spektaklem. Zniczodawcy muszą jednak najpierw dobrze się odszołomić z oparów kadzidełek aby to prawidłowo zrozumieć. Nadal więc nie wolno wysnuwać „bezspornych twierdzeń”, „nienawistnych opinii”, ponieważ mogłyby urazić czyjeś uczucia. Proszę zatem w dalszym ciągu traktować moje spostrzeżenia jako teorie spiskowe i nic więcej. Nie będą one posępne, ponieważ omawiamy tu casus kobiety publicznie przeciętej na pół przez magika. Ona umarła – no tak, wszyscy widzieli ale… żałoba po niej, nawet udawana – to dopiero byłaby niedorzeczność, no bo czyż nie? „Bezkrwawy zamach na Adamowicza” niech zatem dla uspokojenia wszystkich nadal będzie tylko hipotezą, którą postaram się poniżej ostatecznie udowodnić z użyciem rozumu oraz logiki. Ale po kolei. Najpierw wyciągnijmy…Wnioski pokontrolne z I części. Na wstępie omówić należy wszystkie kontrowersje, jakie pojawiły się w pierwszym tekście i opatrzyć je szybką analizą pod kątem prawdziwości.Niewidzialna plakietka „Media”. Potwierdzone. Stefan po to aby wejść na scenę nigdy takiej plakietki nie miał i nie podrabiał. Już na drugi dzień po opublikowaniu tej informacji aresztowany został szef agencji ochrony Tajfun – jakiś karany były milicjant od lat współpracujący z gdańską mafią. Usłyszał nawet zarzuty za wprowadzenie w błąd organów. Wymyślił sobie tę plakietkę i nawet usiłował jakąś podrzucić w charakterze fałszywego dowodu, ale nie wyszło. To samo co ja, zauważyli bowiem także inni świadkowie widowiska – czyli że zamachowiec takiej plakietki w ogóle nie posiadał – i sprawa się rypła. Kwestia plakietki zamknięta ale o dziwo plakietko-we kuriozum trwa i żeby tę oczywistość, że plakietki nie było jakoś przyklepać ze strony oficjalnych czynników, nagle badania laboratoryjne, (DNA + odciski palców) „potwierdziły brak na plakietce śladów biologicznych Stefana”. Tej, której… nie posiadał. Logiki w tym nie dostrzegam, no ale tak podano do wiadomości. Być może badali plakietkę, którą szef ochrony podrzucił – nie ogarniam tak do końca policyjnych działań odkąd pogrążyły się w obszarach logiki ujemnej. Nie powinni żadnej plakietki badać w sytuacji kiedy żadnej plakietki u Stefana nie było ale badali idąc każdym tropem wiodącym donikąd.Komenda „Paweł, Paweł!”, na którą Paweł Adamowicz automatycznie się ożywił. Tej komendy mimo starań nie udało się wyciąć ze wszystkich źródeł i ona jest. Jest i mimo to, jest w ogóle nie badana. W międzyczasie pojawiło się przyzwoite nagranie z zamachu, a więc dla odświeżenia posłuchajmy jej jeszcze raz, a zobaczymy, że na jej dźwięk Paweł Adamowicz reaguje jak foka w delfinarium.\nhttps://twitter.com/malyy5/status/1087128362089414657\noraz dłuższa wersja:\nhttps://video.wp.pl/i,pawel-adamowicz-dzgniety-nozem-na-scenie-wosp,mid,2031379,cid,4051,klip.html?ticaid=11cc95\nOficjalne czynniki kompletnie nic już nie mogą z tym fantem począć. Tak więc kompletnie nic nie robią. A co powinni zrobić gdyby ten zamach nie był sfingowany? Oczywiście, natychmiast aresztować wszystkich specjalistów od dźwięku ze wszystkich stacji TV, którzy zapis dźwiękowy zmodyfikowali zanim go wypuścili do ludzi. Nie robi się tego jednak z bardzo ważnego powodu – aby się nie skompromitowano. Nie można bowiem prowadzić prawdziwego śledztwa w sprawie, która jest zainscenizowana. Nikt nie zginął – vide przepiłowana na pół kobieta u magika – nie można więc w tego typu sytuacjach robić dochodzenia, bo jeszcze nasze prawnuki by się z organów ścigania śmiały. Oni wiedzą doskonale, że to była lipa – i że, jedynym efektem tego dochodzenia mogłoby być ośmieszenie. Niczego, nikomu nie udałoby się udowodnić poza wprowadzeniem organów w błąd, a to jest nie warte świeczki w sytuacji, kiedy to nie było poważnym czynem zabronionym. Twórcy tego zamachu mogliby jedynie symbolicznie odpowiedzieć za tego typu numer – co najwyżej jakąś grzywną – jak dajmy na to pijany dzieciak, który dla kawału zadzwonił na policję informując że w jego szkole podłożono bombę. To tyle jeśli chodzi o „odpowiedzialność” – czyli to co organy mają do wygrania. Przegrać zaś mogą wszystko – czyli dożywotnią reputację. A zatem wystarczy ich dyskretnie powiadomić, że Adamowicz żyje, aby zaniechali działań. I tak właśnie ja to widzę śledząc poczynania organów dwa tygodnie po zamachu. Autorzy sfingowanego zamachu osiągnęli dokładnie to co chcieli – nie musząc nikogo mordować. Więc po co mordować i się narażać, skoro to samo daje lipny zamach? Proste. Brak krwi – jako pierwszy zauważony przez Sandżaja. Potwierdzone. Reanimacja. Również Sandżaja i również potwierdzone. Była ona bezsensowna i mimo iż powinna nie jest ścigana. Nikt nie został nią dobity, a więc nie ma nawet znamion czynów zabronionych, jako że zrobienie z ludzi głupków to nie to samo co zamordowanie. Organom nie kalkuluje się szukać tej ratowniczki, stawiać jej zarzuty i wydobywać zeznania po to tylko żeby się publicznie skompromitować. Jej nic nie grozi i nigdy nie groziło – podpisała zapewne jakąś umowę z jakąś agencją aktorów kryzysowych i wykonała swoją pracę, a jako że za wykonywanie legalnej pracy jeszcze nikt nigdy nie został skazany… To tak samo jakby stawiać zarzuty Czterem Pancernym za narażanie na niebezpieczeństwo Szarika Gdyby zamach był prawdziwy, już dawno wszystkie redakcje naszą ratowniczkę by nam przedstawiły i w zakresie ratownictwa solidnie przeegzaminowały. Dzięki źródłom w komentarzach z zapartym tchem zapoznałem się z filmem Etera (w którym jest film Ole Dammegarda), który z kolei jest specjalistą od zamachów fałszywej flagi i rozpoznaje je bezbłędnie po bardzo charakterystycznych śladach:\n     https://www.youtube.com/watch?v=PnKBKUI0S9M&bpctr=1548450359\nI stąd wiadomo niezależnie od Sandżaja, że masaż serca to rutynowa procedura przy fikcyjnych zamachach realizowanych przez aktorów kryzysowych. Nieważne czy ktoś zamachnął się samolotem, czy chodzi o postrzał z granatnika, czy maczetę tkwiącą w plecach, czy urwaną nogę – absolutnie zawsze robi się masaż serca przy fałszywej fladze, po to tylko, aby w miarę przekonywająco dla laików, scenę zagrać aktorami. Nawet jak po zamachowcu zostanie tylko paszport to się chwyta kogoś z ulicy i robi mu masaż serca, bo masaż musi być obowiązkowo. Zamach na Adamowicza, oczywiście to potwierdza. Reanimacja była – ale nie podpada pod żaden paragraf – bo nie jest czynem zabronionym masowanie zdrowego człowieka, np. dublera. Stefan Miłosz. Kwestia nazwiska Stefana nadal jest niewyjaśniona, ponieważ Stefan jak to się mówi nie przerywa milczenia. Ze wszystkich informacji na ten temat najbardziej prawdopodobna wydaje mi się ta niszowa – że Stefan ma po prostu dwa imiona i jego pełne dane brzmią: Stefan Miłosz Wilmont. Następna w kolejności prawdopodobieństwa jest u mnie taka ewentualność, że zamachowiec ze sceny i prawdziwy Stefan Wilmont to są dwie różne osoby: wrobiony zawczasu człowiek – już trzymany w lochu – plus aktor kryzysowy grający go na scenie – który podczas premiery tego widowiska popieprzył coś czego popieprzyć nie powinien. Stefan Wilmont nigdy by się nie pomylił przedstawiając się publiczności. Natomiast aktor kryzysowy… owszem. Człowiek obcy, któremu powiedziano tylko jak ma się przedstawić podczas widowiska – mógłby to zrobić nie wiedząc, że w Polsce mówi się np. Róża Thun a nie jak w Niemczech Róża von Thun. Gdyby obcemu dano do nauczenia się tego typu kwestię, jest bardzo prawdopodobne, że by się na tym jak dziecko wyłożył. Za tą hipotezą przemawia także zupełnie inny wizerunek zamachowca i prawdziwego Stefana. Stefan Wilmont przypomina zamachowca ze sceny WOŚP wyłącznie na zdjęciach sprzed więzienia, kiedy był silnym napakowanym młodzieńcem. Obecnie Stefan wygląda zupełnie inaczej. Sprawa jest nadal nie wyjaśniona do końca i taka pozostanie dopóki nie usłyszymy głosu Stefana i nie obejrzymy go w dobrej jakości nagraniu. Ale mimo to i tak już są przesłanki wskazujące na to, że zamachowiec był aktorem. Dlaczego? Ponieważ zarówno on, jak i konferansjer widowiska byli prawdopodobnie nie polskiego pochodzenia. Wyraźnie słychać u obydwu trudność w wymawianiu litery „r” – co jest typowe dla etnicznych Niemców, folksdojczów i innych mniejszości. Ten sam problem posiada przecież Gronkiewicz Waltz, Tusk, Rokita i plejada innych cudzoziemców. Konferansjer i zamachowiec nie potrafią wymawiać tej litery prawidłowo – nie wiem czy ktoś jeszcze na to zwrócił uwagę ale ja tak. Chciałbym po prostu usłyszeć w końcu głos aresztowanego Stefana, aby porównać go z głosem zamachowca z Gdańska. Poza tym nawet na dobrych filmach jego twarz jest dziwnie niewyraźna – jest więc trudno określić z całkowitą pewnością czy jest on Stefanem. Na to ostatnie zwróciło uwagę mnóstwo ludzi. Brak krwi. Jest to kolejna potwierdzona sprawa, którą można odfajkować. Kolejna rutynowa kwestia przy zamachach fałszywej flagi. Gdyby była krew scena WOŚP do dziś pełna byłaby techników zbierających ślady. Nic takiego nie ma jednak miejsca. Błyskawicznie scenę rozebrano i zatarto ślady. Jest morderstwo nie ma sprawcy. To również zdążyło się już „wyjaśnić” – obecnie jest sprawca – nie ma ciała. Zostawiamy to, bo nie będziemy nurkować za policją w obszarach logicznie ujemnych. Mają kozła i nic więcej. I dlatego zacierają ślady wmawiając sobie, że Polacy to stado tępych baranów. Ciało spalone, scena zlikwidowana, świadkowie odprawieni do domów. Brak realnego i poważnego śledztwa zamyka temat. Brak prawidłowej reakcji u setek ludzi. To oczywiste przy braku prawdziwego zamachu. Oficjalnie nikt się tą kwestią nie zajmuje, bo ona jest logiczna i bezsporna w samym założeniu. Oficjalne starania robi się tylko w tym kierunku, aby tę kwestię jak najdalej w czasie odsunąć, po to aby jak najdłużej powstrzymać ludzi od logicznego myślenia. Robi się to poprzez podgrzewanie emocji w kierunku mowy nienawiści. Emocje jeszcze nie opadły – a dopiero jak się to stanie każdy tę kwestię prawidłowo zrozumie. Masońska karetka. Potwierdzone. Należy do masońskiej organizacji Adiutare o międzynarodowym zasięgu:                   https://www.youtube.com/watch?v=PnKBKUI0S9M&bpctr=1548453323\nŻenujący pokaz akcji ratowniczej w wykonaniu Adiutare, jest dowodem na to, że ratownictwo nie jest głównym celem jakim te stowarzyszenie się zajmuje. Gdańsk to europejska stolica nie tylko mafii ale też masonerii więc prawdopodobnie głównym zadaniem stowarzyszenia Adiutare jest po prostu handel organami. Tylko po to myślę służą im karetki – które jak było widać pozbawione są wewnątrz typowego ekwipunku ratowniczego. Medyczny profesjonalizm Adiutare można porównać jedynie do nieporadnej ochrony firmy Tajfun. Oficjalnie ktoś chce pozbawić ich koncesji dla pozorów że coś się dzieje ze strony organów. No więc dzieje się – koncesje się odbiera – a jak się koncesje już odbierze to ten sam cieciu zarejestruje agencję ochrony Tornado – żeby nikomu włos nie spadł i było po staremu. To takie żałosne… szkoda gadać. Brak wyraźnych zdjęć z zamachu. Kolejna bardzo charakterystyczna cecha sfingowanych zamachów. W epoce monitoringu wszystkiego i wszystkich a zwłaszcza centrów miast i rynków oraz wszechobecnych kamer HD, każdy zamach fałszywej flagi cierpi na dotkliwy brak zbliżeń, ostrości, dobrych ujęć, etc. Kolejne dowody No i to na tyle remanentu. A teraz sprawy nowe. Z nieukrywaną satysfakcją przedstawiam najpierw kolejne dowody na zamach fałszywej flagi, nie poruszane jeszcze przez nikogo nigdzie. Markery. Na filmie Olego mówi on już kilka lat temu, że aktorzy kryzysowi stosują tak zwane markery. Są to położone gdzieś na przykład na ulicy „przypadkowe” przedmioty, (buty, puszki, gazety) określające miejsce gdzie toczy się akcja. Po co? Ponieważ nawet profesjonalni aktorzy muszą niektóre sceny kilkanaście razy powtarzać, aby zadowolić reżysera. Aktorzy kryzysowi oczywiście również. Oni jednakże grają tylko raz. Dlatego muszą ustaloną scenę ćwiczyć gdzieś na boku tyle razy, aby podczas jedynego występu na żywo odegrać wszystko jak trzeba, bo powtórek już nie będzie. Każdy z aktorów kryzysowych musi precyzyjnie pokonać drogę od punktu A do punktu B, wykonać każdy umówiony gest w określonym czasie, zachować się właściwie w odpowiednim momencie, etc. To trudne do wykonania dla amatorów ale nie niemożliwe. Aby uniknąć wpadek np. że samochód biorący udział w zamachu raz podjeżdża bliżej a raz dalej od ustalonego miejsca, (i ten przeskok może być później widoczny na montażu) stosuje się markery, aby kierowca za każdym razem wiedział gdzie dokładnie ma się zatrzymać podczas tej konkretnej sceny. To samo jest z aktorami kryzysowymi biegającymi rzekomo chaotycznie po ekranie. Pamiętajmy, że nie jest to łatwe dla nich, bo na prawdziwej scenie oni grają tylko raz. A do tej jakże ważnej premiery oni mogą się przygotowywać tylko i wyłącznie w zupełnie innych miejscach. Ćwiczą wiec na odludziu, w jakichś halach, pustych placach lub podziemiach. W scenografiach, gdzie kontury budynków są tylko narysowane na ziemi. W realu, czyli na prawdziwej ulicy, wśród prawdziwych ludzi odgrywają swoje przedstawienie tylko raz. I dlatego muszą mieć rozmieszczone te markery, aby wiedzieć gdzie stać, gdzie iść i dokąd będzie się toczyła „prawdziwa” akcja, którą trenowali zupełnie gdzie indziej. Czy podczas zamachu na Adamowicza były takie markery? Oto one. Naszymi markerami są te trzy leżące na scenie białe kartki papieru. Nie są zapisane, bo nie muszą – i tak by nikt z nich nie odczytał żadnego tekstu. W ich wyglądzie jest zapisane to co aktor odczyta z każdej odległości, ponieważ każda z nich posiada inny kształt. Pierwsza z prawej mówi: „w tym miejscu się Stefan przyczajasz i na komendę – i już – startujesz do ataku”. Środkowa kartka zawiera przekaz: „tutaj się Stefan poddajesz”. (I w tą właśnie kartkę ochroniarze potem wcisnęli Stefanowi twarz). Ostatnia kartka od prawej przekazuje natomiast: „tam będzie stał target i tam popychasz go i wyciągasz nóż”. Jest jeszcze czwarta kartka, niewidoczna na tym ujęciu ale widoczna na innym. Ona oznacza polecenie dla Pawła Adamowicza: „dokładnie w tym miejscu upadasz Paweł, aby skryć się przed wzrokiem publiczności za…. Parawanem. Ten parawan, bowiem to kolejny istotny rekwizyt inscenizacji niezbędnej do odegrania sceny zamachu. Na pierwszym niewyraźnym filmie z zamachu nie mogłem pojąć jak ten parawan się pojawił. On jest bardzo ważny, bo to właśnie za nim odprawiana była lipa o nazwie „reanimacja”. Ten fragment obrazu był tak mocno wyblurowany i tak wolno pojawiała się w nim ostrość, że wydawało się, że parawan z niczego materializuje się w miejscu, gdzie upadł Adamowicz. Proszę to zobaczyć.\n       https://www.youtube.com/watch?v=petniBsyx90\nWidzieliście? Nie było parawanu i nagle olbrzymi parawan jest. W pierwszej chwili myślałem, że zastosowano stary iluzjonistyczny trick, aby pod osłoną dymu z rac „wyczarować” go, czyli wysunąć i rozłożyć niczym parasolkę jakiś mechanizm z podłogi, ale nie pisałem o tym, bo nie był to twardy dowód tylko luźne domysły. Dopiero później udało mi się znaleźć lepszy film – już po opublikowaniu I części. I z niego właśnie wynika jednak, że zastosowano jeszcze prostszy trick. Otóż jak się okazuje ten gigantyczny parawan przez cały czas tam był. Był tylko kompletnie niewidoczny. Efekt ten osiągnięto kierując spod sufitu bardzo silny snop ciemnoniebieskiego światła dokładnie na… plandekę w identycznym kolorze, którą nakryto stos jakichś rekwizytów. Niebieskie światło plus niebieska plandeka. Na tle stojących tam ludzi – wyłącznie w czarnych kurtkach – plandeka jest zupełnie niewidoczna. Tylko ten jeden reflektor jest „niesymetryczny”, ponieważ świeci nie do końca tam gdzie wypadałoby aby był skierowany, żeby równomiernie skąpać w niebieskim świetle całą scenę. Przyniosło to dokładnie ten sam efekt jak słynny zielony ekran stosowany w każdej telewizji, aby wycinać lub wklejać tło. Dziś stosuje się zielony ekran w przemyśle filmowym ale jeszcze parę lat temu był to… niebieski ekran, ot co. Efekt końcowy jest więcej niż zadowalający – z pola widzenia całkowicie znika spora sterta gratów nakryta plandeką, która tworzy tak zwany parawan – ona jest w ogóle niewidoczna nawet na bardzo dobrej jakości nagraniu. Coś tak fenomenalnie zrobionego absolutnie nie może być przypadkowe. Parawan jak zaczarowany „materializuje się” dopiero po zmianie oświetlenia i zgaszeniu ciemnoniebieskiego światła. Proszę sprawdzić samodzielnie czy moje wnioski są prawidłowe.\n       https://video.wp.pl/i,pawel-adamowicz-dzgniety-nozem-na-scenie-wosp,mid,2031379,cid,4051,klip.html?ticaid=11cc98\nI precyzyjnie za tę plandekę upada Adamowicz. Dokładnie tam, gdzie leży czwarta kartka. I tu powraca słynne „drastyczne” ujęcie zamachu z TVN. Ono nie jest drastyczne, proszę ja was, albowiem Stefan miał filmowy nóż – taki z ostrzem chowającym się w rękojeści – które oczywiście nie brudzi się krwią z nieistniejących ran. TVN wyciął te ujęcie, aby nie zdemaskować lipnego zamachu, bowiem siłą rzeczy ono zawiera obraz ataku w jakości HD oraz to, co znajduje się za plandeką. Nie tak dawno wszyscy mogliśmy do woli oglądać sobie scenę odcinania zgwałconym turystkom ze Skandynawii blond głowy nożem dwa razy większym od Stefan-owego. TO było drastyczne ale mimo tego nikt nie postradał zmysłów i nie potrzebował pomocy psychologa, albowiem to był jeden z tysiąca tego typu „incydentów” jakie od trzech lat zalewają media w Europie. Zamach na Adamowicza natomiast tylko tym różnił się od podobnych „epizodów”, że nie był prawdziwy. I to jest rzeczywista przyczyna tego, że został wycięty przez TVN. Poza tym abstrahując od wszystkiego co powyższe, gdyby zamach naprawdę miał miejsce, tę wyciętą scenę już dawno analizowaliby publicznie na konferencjach prasowych prokuratorzy i dziennikarze domagając się jej ujawnienia w interesie społecznym. Tak powinno być, a co jest? Jest cisza o tym „drastycznym” ujęciu i nie tylko żadna komisja śledcza się go nie domaga ale nawet żaden brukowiec lub pies z kulawą nogą. A przecież zakładając, że zamach był autentyczny ten zapis jest cenniejszy niż film Zaprudera z zamachu na Kennediego. Te nasze rzekomo „drastyczne” ujęcie, przy rozlatującej się jak arbuz głowie amerykańskiego prezydenta, to jest nic drastycznego. Poza tym to największy dowód w sprawie i…? I najmniejsze zainteresowanie on wzbudza w organach. Zerowe w zasadzie. Te ujęcie pokazuje nóż desantowy z chowającym się ostrzem – a coś takiego nawet nie jest czynem zabronionym – resztę znamy…Zamach udał się organizatorom. Wszystko wyszło znakomicie. Idealna synchronizacja najważniejszych aktorów. Wszystko zagrano doskonale, a „drugoplanowi aktorzy” – nieświadome matołki z ochrony, nawet nie za mocno dali ciała, bo mogli się dużo bardziej zaszamotać, gdyby tylko zamachowiec Stefan nie rzucił się w końcu trzeźwo sam w ich ramiona. Zadowolona mina reżysera jest dowodem pełnego sukcesu. Stoi z tyłu z założonymi rękami i skromnie obserwuje swoje dzieło. Schizofrenia paranoidalna – czyli choroba psychiczna Stefana. O tym że jego schizofrenia to jest lipa wiedziałem od chwili, kiedy przeczytałem to co już zamieściłem w I części: „Początkowo Stefan W. przebywał w Areszcie Śledczym w Gdańsku, gdzie otrzymał status niebezpiecznego więźnia. Pobyt w więzieniu przebiegał bez większych problemów. Niedługo później trafił do Zakładu Karnego w Malborku. I tam właśnie zaczęły się jego problemy z psychiką. Był leczony psychiatrycznie z powodu zaburzeń zachowania i emocji oraz specyficznych zaburzeń rozwoju. Przebywał na obserwacji sądowo – psychiatrycznej. Skierowano go do Oddziału Psychiatrii Sądowej w Areszcie Śledczym w Szczecinie. Przebywał tam w okresie luty – kwiecień 2016 r. W trakcie pobytu w Ośrodku w Szczecinie rozpoznano schizofrenię paranoidalną, zastosowano leczenie farmakologiczne oraz terapię. Po uzyskaniu poprawy Stefan W. został skierowany do leczenia ambulatoryjnego. Po kilku miesiącach odmówił przyjmowania leków, ale według lekarzy, był w dobrym stanie psychicznym. W grudniu 2018 roku wyszedł na wolność” Kluczem do rozwiązania zagadki jest ten niepozorny zlepek słów: „Oddział Psychiatrii Sądowej w Areszcie Śledczym w Szczecinie.” Co w tym podejrzanego? To, że Stefan dorastał, napadał, odsiadywał, resocjalizował się, żył wolno i się mścił w… okolicach Gdańska. Czy podczas pobytu Stefana w więzieniu nie było psychiatrów w pobliżu? Ano nie było. Nie było TAKICH psychiatrów. TACY psychiatrzy jakich „potrzeba było” dla Stefana są tylko w Szczecinie. Gdańsk posiada wszystko, jeśli chodzi o masonerię i przestępczość zorganizowaną. Każda możliwa loża i każda możliwa forma bandytyzmu. Nawet się go nazywa Palermo lub Małą Sycylią ale to nieadekwatne nazwy, bo mafia sycylijska w porównaniu do gdańskiej to dosłownie harcerstwo. Mafia włoska ma kodeksy, ślubowania i honor bandycki. Ta z Gdańska nie ma żadnych zasad – to najgorsze antypolskie bydło, jakie kiedykolwiek chodziło po Ziemi – wylęgarnia czystego zła… Bolków, zdrajców, zbrodniarzy wojennych. To przecież tam groteskowo absurdalnie torturowano Pocztę Gdańską i masakrowano niedorzecznymi siłami obrońców Westerplatte. To tam rozstrzelano stoczniowców, tam było gniazdo prusactwa oraz krzyżactwa i tam najbardziej jest zbroczona niewinną krwią ziemia Polska. To tamten Niemiec przecież od zawsze finansował każdą formę antypolskiego bandytyzmu z dywizjami SS pełnych Łotyszy i Ukraińców, włącznie. Ale mimo tego, ci opłacani przez Niemcy zbrodniarze z Gdańska nie mają takich jak Szczecin psychopatycznych psychiatrów. Swoją drogą Szczecin też ma nieliche zasługi dla okupantów – tamtejsze sądy i areszty mieszczą się przecież w budynkach dawnego Gestapo i dawnej partii żydobolszewickiej i absolutnie nic pod kątem wyniszczania Narodu Polskiego, w tych budynkach się nie zmieniło w ostatnim wieku. To co się dzieje w szczecińskim areszcie śledczym – dawnym Gestapo – przechodzi ludzkie pojęcie i nawet najgorszym zbirom z Gdańska musiało to zaimponować, bo właśnie na żer tych psychiatrów rzucono torturowanego Stefana. Zmiękczano go wstępnie ot taką tam dwuletnią izolacją, aby odpadła mu któraś klepka. Podtruwano go także i prawdopodobnie robiono kontrolę umysłu, bowiem skarżył się, że słyszy głosy w głowie i tym podobne. Głosy w głowie „robi się” już od lat osiemdziesiątych wstawiając ofierze chipa IBM. Głośny już był przypadek Polki, której po zabiegu dentystycznym dokuczać zaczęły tego typu dolegliwości. Kupa lekarzy nie mogła jej pomóc ale to się zmieniło po wyjeździe do Francji. Tamtejszy lekarz nie tylko zlokalizował chipa ale wydobył go i po stwierdzeniu, że nadaje on na częstotliwości fal mózgowych spytał ją ze zdumieniem: „Co pani robiła w Guantanamo?” Ona nic nie robiła w Guantanamo – ona zęby robiła w Polsce. Więcej o programowaniu zabójców w zakładach karnych przy pomocy kontroli umysłu jest w źródle”:                                                                                      https://www.youtube.com/watch?v=Lny5ToTEvqU\nZałoga psychiatrów z aresztu w Szczecinie to elita pseudomedycznych wykolejeńców. Żeby mieć jakiekolwiek o tym pojęcie proszę sobie wyobrazić doktora Mengele i pomnożyć go przez kilkanaście. Areszt Śledczy w Szczecinie to fabryka wariatów. Masowo z normalnych ludzi robi się tam „wariatów” aby ich w coś wrobić lub obrabować z majątku, a z bandytów „wariatów”, aby mogli uniknąć karnej odpowiedzialności. Totalne dno wszelkiej możliwej patologii. Nie będę wymieniał nielicznych przyzwoitych psychiatrów, o których wiem że uciekli stamtąd, bo mieli już dość tego co powyżej i nie chcieli przykładać do tego ręki. Nigdy nie byłem w tym areszcie ale to nic nie znaczy, bo „lekarze” stamtąd jak się uprą to dopadną każdego, nawet człowieka nigdy nie karanego, przebywającego oczywiście na wolności, aby go ubogacić potajemnie swoją „diagnozą”. Szczecińska specjalizuje się, Ale to w metodzie na wariata. Mają do pomocy prokuratorów, prawników, urzędasów, policję i inne służby oraz oczywiście stada uczynnych psychiatrów gotowych z każdego zrobić debila za parę złotych. Kradnąc Polskę, kawałek po kawałku, mieszkanie po mieszkaniu, firmę po firmie, spodziewają się przecież oporu ze strony okradanego człowieka, a zatem zawczasu robią mu papiery psychiatryczne – żeby tak jak w przypadku naszego Stefana – jego desperacką obronę swoich podstawowych praw człowieka lub wartości, natychmiast przerobić w „atak wariata” lub „zamach szaleńca”, który odstawił leki psychiatryczne. To rutynowe działanie w całej Europie, nękanej zamachami fałszywej flagi. Jak już musi być kozioł – to się wystawia przygotowanego wcześniej „wariata”. Z ofiary robi się w ten sposób sprawcę, a ze zdegenerowanego sprawcy anioła lub męczennika. I to właśnie zrobiono ze Stefanem z Gdańska. Przerabianie Stefana w wariata trwało niemal sześć tygodni – od 23 lutego do 13 kwietnia 2016 roku. Jego wynik jest jednoznaczny: „Schizofrenia paranoidalna”. Oto dostępny w sieci fragment jego opinii psychiatrycznej: „… słyszał głosy, które komentowały jego zachowanie, wydawały mu polecenia, miał wrażenie, że funkcjonariusze cofają czas, wyznaczają mu zadania do wykonania, za które obiecywano mu wynagrodzenie, miał być świadkiem koronnym, wyznaczono mu „różne życia”, wydawało mu się, że jest aktorem w filmie, ktoś odczytuje jego myśli.” To wszystko co jest tam napisane jest bardzo charakterystyczne dla kontroli umysłu. Wręcz podręcznikowo zgodne. To co mrozi krew w żyłach to prawdziwe do bólu stwierdzenie Stefana, że jest aktorem w filmie, bowiem oczywiście my już wiemy, że był aktorem – kryzysowym, szkolonym do symulacji zamachu na Pawła Adamowicza.  Źródło:\n      https://wpolityce.pl/spoleczenstwo/430967-stefan-w-slyszal-glosy-ktore-wydawaly-mu-polecenia\nKwestią bezsporną jest w tym świetle nie przyznanie się Stefana do winy – on był przecież tylko aktorem ze składanym nożem a nie mordercą. Takim samym jak ta dziwna pani z objazdowego salonu masażu. Być może to nawet nie on wystąpił na scenie w Gdańsku. Raczej pewne, że nikt go nie uprzedził, że będzie odpowiadał za morderstwo kiedy ta szopka była planowana. Osobiście – jak zresztą pół Polski – boję się żeby mu nie zrobili samobójstwa aby go uciszyć. Biedny chłopak. Ten jego wyrok za napady na banki też jest nieprzekonywujący. Stefan przecież rzekomo był tak sprytny, że zaplanował udany zamach na Adamowicza. Tak sprytny, że z sukcesem obrabował banki i nie dał się schwytać. I taki głupi jednocześnie, że się tym chwalił na lewo i prawo? Przecież to co się mówi oficjalnie nie trzyma się kupy. Przypuszczam, że w naszych realiach ktoś go po prostu pomówił o tamte napady, bo w naszych realiach sądy odrzucają nagrania audio wideo jako niewiarygodne albo jakieś odciski palców, a za wiarygodne uznają donosy ze strony szumowin.  Stefan na scenie oznajmił, że był więziony niewinnie – chciałbym aby tę okoliczność on sam rozwinął zamiast słuchać w nieskończoność wszystkich innych źródeł a zwłaszcza opinii psychiatrów z tego więziennego domu wariatów w Szczecinie. Przecież gdyby on był naprawdę winny tamtych napadów na banki, to powinien cieszyć się z niezwykle niskiego wyroku, a nie latami planować za niego zemstę. Zemstę to się planuje jeśli się pięć lat siedziało niewinnie – tak ja to widzę. Chciałbym usłyszeć jego swobodną wypowiedź na tamte tematy zamiast czytać treści ze zmodyfikowanych zeznań u sądowego protokolanta, policji lub prokuratury. . Chciałbym poznać w końcu całą opinię psychiatryczną Stefana z Gdańska, zamiast dostępnych w sieci fragmentów, a zwłaszcza nazwiska tych pseudolekarzy, którzy się pod nieistniejącą u niego schizofrenią podpisali. Fałsz i nieważność opinii sądowych robionych na zamówienie polega na tym, że są one preparowane po prostu w sposób skandalicznie oszukańczy od początku do końca. Prawo wymaga aby opinia psychiatryczna biegłych dla celów sądowych była z dwóch źródeł dla większej pewności. Badany powinien zatem udać się do jednego psychiatry, udzielić mu wywiadu, bo tym jest przecież tak zwane „badanie”, po czym psychiatra powinien sporządzić opinię w zamkniętej kopercie i badany wówczas udać się może po drugą taką opinię do innego psychiatry. Gdyby po otwarciu kopert obie opinie były zgodne, to wtedy można by mówić że są one prawdopodobne. Oszuści sądowi jednak nigdy tak nie robią, bowiem wiedzą, że ta pseudonauka czyli psychiatria to tylko wróżbiarstwo. Gdyby rzetelnie ludzi badali, ich opinie zawsze byłyby rażąco odmienne, bo są oparte tylko na zgadywance lipniejszej niż tarot. W psychiatrii nie ma przecież bezspornych testów jak w prawdziwych dziedzinach medycznych tylko wróżbiarstwo. Oszukują system wymagań sądowych od początku do końca, razem badając pacjenta, razem go wypytując, razem zadając tendencyjne pytanie, razem wyciągając naciągane lub nieprawdziwe wnioski i razem uzgadniając końcową opinię – co jest oczywiście nonsensowne z samego założenia.  Psychiatria sądowa w Polsce to są po prostu stalinowskie psychuszki, nic więcej. A psychiatria w szczecińskim areszcie to nawet nie Stalin tylko Beria.  Poniższe źródła to nie tylko kolejny wysyp dowodów, że zamach był zaplanowany wcześniej ale też jasna odpowiedź kto za nim stoi, jako że nie istnieją w przyrodzie jasnowidze i wróżki. Godziny tych postów są tutaj istotne.                                       https://twitter.com/ForumFZP/status/1084585908500942848\njeszcze więcej tego typu dowodów jest pod linkiem:\n    https://rafzen.wordpress.com/2019/01/16/czy-zamach-na-adamowicza-byl-sfingowany/\nWięcej dowodów na zamach fałszywej flagi przytaczać już nie ma sensu w tym momencie. Jest ich co prawda mnóstwo tylko… po co?  Kompletnie inne imiona prawdziwych sprawców napadów na banki, za które skazano na pięć lat więzienia, Stefana Wilmonta z Gdańska, dokańczają sprawę dowodów na zamach fałszywej flagi:\n   https://dziennikbaltycki.pl/seria-napadow-na-placowki-skok-w-gdansku-jest-akt-oskarzenia-przeciwko-podejrzanym/ar/1028703#aktualnosci  Zdemaskować lipny zamach nie jest jak widać trudno. O wiele trudniej zlikwidować jego następstwa, bo wieści już poszły w świat, ogary zagryzają „nienawistników” i nikogo już nie obchodzi sam zamach ale…  Mowa nienawiści Niemcy, folksdojcze oraz sam Paweł Adamowicz, którzy najwięcej na spektaklu „Zamach Na Adamowicza” skorzystali, nie muszą płacić odszkodowania za wojnę Polakom, to raz. Temat umarł któryś już raz. Nie muszą się tłumaczyć z przekrętów prokuratorom, to dwa. Po trzecie, dalej mogą Polskę okradać – tak przynajmniej im się wydaje, bo aż dyszą żądzą wykończenia reszty Polaków po trzech latach wymuszonej przerwy. Po czwarte, Adamowicz przez cały grudzień krążył nerwowo po Santa Monica, gdzie jak każdy szanujący się kolekcjoner mieszkań, nabywał nerwowo kolejne domy budując królestwo boże dla siebie, żony i dzieci. Tak bardzo zalatany był przy załatwianiu doczesnych spraw, że ledwo się wyrobił na swoją śmierć. Adamowicz zapytany kiedyś skąd ma pieniądze na te wszystkie nieruchomości odparł z rozbrajająca szczerością, że jego dziadkowie wracając z przymusowych robót po wojnie, po prostu przywieźli dwie torby zarobionych pieniędzy. A potem je dali Adamowiczowi w spadku. Hm… większość przymusowych robotników przywiozło tylko zniszczone zdrowie i trochę gruźlicy ale kto wie, może pan Hitler przymusił dziadków Adamowicza do wyrywania żydom złotych zębów albo jeszcze lepiej płatnego zajęcia? Hitler, który również jest po paru zamachach, już nam nie opowie niestety jak to było z tymi workami pieniędzy. Ziobro zamiast te domy w USA objąć dyskretną obserwacją, aby złapać Adamowicza za kark jak przyjdzie odwiedzić córeczkę, chce w Polsce gdzie nic się nie stało, znowu zaostrzać jakieś kodeksy. Totalna targowica linczuje ostatnią polską telewizję, wdowa po Adamowiczu wybacza rodzinie Stefana. Matka Stefana przeprasza wdowę po Adamowiczu, a córka Adamowicza zwija się ze śmiechu na pogrzebie ojca. Owsiaka chcą odznaczyć orderem Nobla i modlą się aby powrócił na stanowisko naczelnego pajaca. Cyrk na gumowych kółkach. Nie za bardzo lubię być posłańcem przynoszącym złe wieści ale skoro nie ma innych ochotników ujmę to tak: to, że Owsiak nie żebrał na dzieci, ale dzieci żebrały na Owsiaka jakoś z trudem do świadomości Polaków już dotarło na fali krytyki. Nie dotarł jeszcze tylko do Polaków taki drobny szczegół że: chińskie dzieci pracujące uczciwie po 16 godzin na dobę, od 4 roku życia na przyzwoitą umowę o pracę, za godziwego dolara miesięcznie – te same, które tak zręcznie szyją nam te wszystkie ładne adidasy, najki i pumy – mają dzięki naszej szczodrości pełne ubezpieczenie społeczne, służbę zdrowia i zabezpieczoną godziwą emeryturę na Karaibach. Polskie dzieci natomiast nie, bo nie tylko pracują dla Owsiaka w zimnie, deszczu i mrozie bez nawet śmieciowej umowy, to jeszcze zamiast godziwej dziesięciogroszowej dniówki otrzymują tylko: „siema”. No tak czy nie? Jak w świetle tej oczywistości mają się prawa człowieka, kodeksy pracy lub prawa obywatela, hę? Gdzie jest opinia rzecznika praw dziecka? Czy te pierdyliony roboczogodzin przepracowane przez dziesiątki tysięcy dzieci w ciągu 27 lat na rzecz Jerzego Owsiaka i jego żony i ich Mrówki i ich Melona, mają jakąś wartość, czy nie mają żadnej wartości? To skąd Jurek który nawet minuty nie przepracował to wszystko ma? TO jest PRACA dzieci – cholernie dochodowa. Nielegalna, haniebna, nigdy nie opodatkowana i nigdy nie wynagradzana. Dlaczego ten człowiek nie siedzi w Guantanamo za nielegalne zatrudnianie w swojej sekcie dzieci na czarno, a haniebny proceder jaki uprawia wyniesiono do rangi instytucji? Jeśli nic nie zostanie z tym pajacem zrobione, za rok lub dwa Owsiak będzie te swoje puszki wtykał niemowlakom na porodówkach i szantażował je dostępem do inkubatora albo że im zaklei serduszkiem usta. Mówiło się kiedyś że żadna praca nie hańbi ale to jest nieprawda – żebractwo jest hańbą bo ryje psychikę i wytwarza postawy roszczeniowe, a żebractwo dzieci na sekciarskiego darmozjada, hańbą do kwadratu. O kilkunastu już dzieciach, które się zapiły lub zaćpały na śmierć, na imprezach Owsiaka nawet nie wspomnę. Widzicie jak nisko upadła godność Polaka. „Dobry Polak to żebrający Polak” – zapewne myśli sobie nasz stary dobry Jurek napychając kolejną skarpetę kolejnym złotym melonem. Polak w Polsce ma najmniej praw na całym globie. Więcej od niego praw ma kornik z Puszczy Białowieskiej, piesek ze schroniska w Kolbuszowej, miś z Zakopanego, Ukrainiec, Pakistańczyk, Czeczen, Cygan, pederasta lub Żyd. Polak jest obywatelem ostatniej kategorii w swojej ojczyźnie. Indianie z Puszczy Amazońskiej mają więcej praw od Polaka. Polak ma prawo od maleńkości żebrać za darmo na darmozjadów, modlić się za swoich ciemiężców, płacić odszkodowania swoim oprawcom i emigrować myć dupy starym hitlerowcom. A jak Polak protestuje to się go knebluje „mową nienawiści” – co właśnie możemy zaobserwować na własne oczy ze strony niemieckiego bandytyzmu. I co bardzo dziwne, mowa nienawiści to cecha wyłącznie Polaka – oprócz Polaków nie został aresztowany za nią dosłownie nikt. Żaden Żyd, Ukrainiec, szwab lub folksdojcz. Dlaczego to tak? Ponieważ obecna sytuacja w Polsce wygląda tak, że jest PO i jest PIS a obie partie to dwie strony tego samego szekla. Jest jeszcze gdzieś w tym systemie przezacny minister Ziobro ale gdzie, tego nikt nie wie, bo nikt z pokrzywdzonych go jeszcze nie widział na własne oczy. Pozostają domysły. Niektórzy podejrzewają, że minister Ziobro to tylko symulacja komputerowa ewentualnie sztuczna inteligencja, ale ja myślę że minister Ziobro istnieje i jest żywym człowiekiem. Jedyny problem z nim jest taki, że ministrowi Ziobro dali bardzo ładny apartament na najwyższym piętrze prokuratury krajowej. Przytulny, cieplutki, z widokiem na kraj. Co on tam robi tego nikt nie wie, więc domyślam się że gra w Mortal Kombat lub kopie bitcoiny. W czasie kiedy nasz przezacny minister Ziobro pilnował porządku w Polsce, w ogóle nie zauważył że ktoś ukradł ten kraj. Wszystkie fabryki, stocznie i huty. Jak do tego doszło? Podejrzewam, że kiedy minister Ziobro spał, ktoś niedobry podmienił mu wszystkie okna w tym apartamencie na takie wielkie wyświetlacze cztery kilo ultra HD. On by oczywiście natychmiast pomógł wszystkim pokrzywdzonym Polakom ale jest odcięty kompletnie od ich problemów i reszty rzeczywistości. Kiedy bowiem ulicami idzie Marsz Przeciwko Szczepieniom albo Bezprawiu, oni mu tam wyświetlają na tych ekranach delegacje kółek rolniczych i spółdzielni mleczarskich składające wieńce pod pomnikiem Zbigniewa Ziobro Który Nakopał Dla Kraju Najwięcej Bitcoinów. Nasz przezacny minister Ziobro został uwięziony w prokuraturze krajowej, podstępnie niczym Jimm Carrey w filmie Truman Show. Taka jest moja teoria. Miliony Polaków usiłowało wyprosić pomoc u ministra Ziobro,  a nawet sam Stefan Wilmont kiedy go wrobiono w cudze napady na banki. Niestety, minister Ziobro nikomu nie pomógł, bo odizolowano go także od spodu i nikt z ulicy nie może się do niego przedostać albo wysłać jakiś nieautoryzowany list. Spiskowcy, którzy uwięzili naszego ministra i zrobili z niego Zbigniew Show, mają opracowaną technikę na listy do ministra Ziobro. Uruchamiają spychologię: listy te kierują spychaczem do prokuratury krajowej, ta sortuje to do prokuratur okręgowych, tamte do końca segregują te śmieci i potem rozwożą do prokuratur rejonowych, te do lokalnej policji lub urzędu i na koniec ten sam folksdojcz, który okradł lub zniszczył Polaka – on tę skargę sobie rozpatruje we własnym zakresie. Oczywiście nie dopatrując się w swoim zachowaniu niczego nagannego, co jak na ironię jest prawdziwe, jako że pracuje na rzecz Republiki Federalnej Niemiec. Każda taka sprawa lub skarga z automatu jest umarzana a delikwent, który ją wysłał jest niszczony podwójnie przez kolekcjonerów mieszkań z Platformy Obywatelskiej. Ziobro ogląda kolejną spółdzielnię mleczarską znoszącą kolejne wieńce pod jego pomnik, cieszy się że Naród go kocha i docenia jego zasługi w kopaniu bitcoinów i szanuje postępy na levelach Mortal Kombat.On biedny nie wie nawet, że już 10 milionów Polaków okradziono z mieszkań i firm, bo oni mu zamiast tego ciągle tylko te kółka rolnicze puszczają i spółdzielnie mleczarskie. Można oczywiście zrobić zrzutkę na tramwaj i przeprowadzić na prokuraturę krajową szturm, aby uwolnić z niewoli naszego zacnego ministra Ziobro ale nie wiem czy warto. Po tylu latach on być może nie wytrzymałby wiadomości, że zamiast kółek rolniczych Polska jest pełna folksdojczów, banderowców i niemieckich bandytów z PO. Niby kuriozum, ale ten kto widział jugosłowiańską tragikomedię Underground ten wie, że nie zawsze warto jest przynosić tego typu wieści. Ten genialny film jest o zaradnym kolesiu, który pozwolił jugosłowiańskim partyzantom w czasie II wojny schronić się przed niemieckim nalotem w piwnicy, a potem ich przez kilkadziesiąt lat zapewniał że wojna nadal trwa. W tym czasie oni tam pracowali na niego, wytwarzali broń do walki z okupantem, brali śluby, prowadzili normalne życie, a jak sprawa się rypła… po zobaczeniu na zewnątrz nalotów NATO… powrócili do swojej „okupacyjnej” piwnicy. Podejrzewam, że nasz przezacny minister Ziobro jakby się wreszcie dowiedział, że to nie Stefan Wilmont  wysadził World Trade Center, że to nie Owsiak żebra na dzieci tylko dzieci na Owsiaka . Kluczową sprawą jest tutaj czas. Jeśli bowiem tej wojny z mową nienawiści we własnym zakresie nie wygramy, oni wezmą Polaków za mordę. Jak wezmą za mordę, wyłudzą 300 miliardów dolarów. Jak wyłudzą ten haracz, Polski nie będzie. Będzie już jawne mordowanie resztek naszego Narodu. Zamiast otrzymać należne nam reperacje ze strony Żydów i Niemców, oni nas ręka w rękę wymordują aby wykpić się z tej oczywistej należności. Nastroje w kraju bardzo się radykalizują w miarę jak opadają Polakom łuski z oczu i szczęki. Niektórzy stracili już jakąkolwiek nadzieję na sukces bez walki zbrojnej. Proszę to uważnie przeczytać, szanowni Państwo.\n        https://gloria.tv/article/kyzfgB2C6CEN2QmLzkrREwGZg\nMedia narodowe – np. NTV, Mecenas Joanna Modzelewska, Poseł Robert Majka – alarmują o nadchodzącym rozbiorze Polski, a mainstream sączy ten sam syf co zawsze – rozważają kto jakie ma szanse w nadchodzących wyborach do euro-koryta. Odpalono starą dobrą nowomowę militarną aby, „zewrzeć szeregi”, zwerbować „mięso armatnie” i czas antenowy pocisnąć na „kampanię”, przy której ta wrześniowa wymięka. Idzie przecież „pobór” do koryta w Brukseli a ilość miejsc w chlewiku mocno ograniczona. „Walka” trwa, ryk, kwik, „sojusze” i „zdrady”, nękają „ogniem zaporowym” wszystkie „sztaby”. A „teatr wojenny” jest znacznie większy niż front wschodni, bo chodzi o to aby ogarnąć stado w okupowanej Warszawie, wyrwać je z rąk głodnych ludzi, a potem przegnać je aż do Belgii. Kociokwik w mediach zupełnie jak podczas tej hecy pod Stalingradem. . Obóz zaprzaństwa, kundlizmu i powszechnej zdrady – ten sam, który rozwścieczył się gdy upadł pod taśmami prawdy Zbigniewa Stonogi (Polska to państwo teoretyczne), ten sam który przygotował przeciwko wybranemu przez Polaków rządowi Beaty Szydło pucz (ciamajdan) – ten, sam który zgnoił PIS z jego reformami sądownictwa i ustawami o IPN, – ten sam który w celu przechwycenia władzy zaprojektował operację „Smoleńsk” i „Adamowicz” – on teraz wykończy spektakularnie tych, którzy ośmielili się ich odsunąć od władzy. Prezes I Spółka po haniebnej kapitulacji w sprawie sądownictwa, IPN oraz „polskich obozów zagłady” dali sygnał dla społeczeństwa że mając do wyboru wojnę i hańbę wybierają to drugie. Zgodnie więc z najstarszą zasadą real-polityki będą mieli jedno i drugie. Pogarda za kundlizm u zdradzonych i zawiedzionych Polaków już jest. Brakuje jeszcze tylko dorzynania watahy obiecanej im przez Platformę Obywatelską – Obywateli RFN. A ponieważ te obietnice to nie puste pogróżki tylko poważne postanowienia – jakie zapadają u Bildenbergów, w Londynach, Watykanach i Dystrykcie Waszyngton – nie ulega wątpliwości, że pies z kulawą nogą nie zapłacze po Prezesie I Spółce, kiedy się na nich rzucą opłacani przez Niemca seryjni samobójcy. Dla Polaków to fatalna wiadomość, bo po którymś już zdradzeniu przez rząd – ten naród albo się wyhartuje na nierdzewną stal albo po prostu wyginie – a to ostatnie to niestety jest plan. Nas Polaków ma nie być. W nasze miejsce chcą sprowadzić Filipiny albo inny ciapastan, któremu wcisną swoje rzekome lechickie pochodzenie i lechicką historię. Oni wszyscy już zresztą od dawna mają na imię….  Lech, Lechosław, Leszek, itp… Nie wiem czy to zauważyliście ale ja tak. Mają bardziej polskie imiona niż Polacy – i proszę uwierzyć – to nie jest przypadek. I kiedy Polacy określają się w ślad za kolejnymi serialami jako Adamowie, Brajany, Dżesiki, Alany, itp., oni nie. Oni mają słowiańskie imiona – są to Bartosze, Bronisławy, Macieje, Jarosławy, Radosławy o z reguły szlacheckich nazwiskach kończących się na „ski”. Podmiana Polaków na naszych oczach trwa. Wojnę o prawdę okupant z POPIS już „dla nas” przegrał. Teraz przegrywa wojnę o wolność słowa. A jak ona się zakończy nastąpi likwidacja Państwa Polskiego. Pisałem rok temu, że nie wiadomo czy Polsce pozostało chociaż 1000 dni. Inni nie są tak optymistyczni i spodziewają się najgorszego w ciągu najwyżej 150 dni.\n        https://www.youtube.com/watch?v=-vsmUU6AxTo\nI kiedy my marnujemy czas na nieistniejące problemy, mowy nienawiści, afrykańskie dziki albo zamachy na Adamowiczów, ten czas ucieka. Wojnę o prawdę można było wygrać od ręki jeszcze w tamtym roku przy pomocy wykrywacza kłamstw o którym pisałem:\n   https://innemedium.pl/wiadomosc/rzeczpospolita-mafijna-czesc-iv-skuteczny-sposob-na-bandytyzm\nNie jestem megalomanem, prorokiem lub coś ale jak widać choćby po tym fikcyjnym zamachu posiadam wrodzoną zdolność do szybkiego i poprawnego kojarzenia faktów, które innym umykają dosłownie sprzed oczu. Tamtej wojny nikt nawet nie raczył z Polaków podjąć obarczając tym niepolski rząd. Efekt przewidywalny. Oszkalowano nas o jakieś obozy zagłady i zgnojono przed całym światem. A potem przyklepano bez nas jakiś haracz żeby ostatecznie rozwiązać kwestię polską. Teraz to samo dzieje się z „mową nienawiści” – i skończy się tak samo, bo ciągle jest ten sam niepolski rząd, który nas reprezentuje. On nie ściga przecież bandytów odpowiedzialnych za tę wojnę – on ściga… Polaków! My sami musimy tę wojnę wygrać i możemy to zrobić od ręki. Jak? Bez jednego słowa można wygrać wojnę z mową nienawiści, oraz oczywiście tamtą wojnę o prawdę również.  Z kłamcami nie wolno się wdawać w pyskówki, bo nas zakraczą jako że mają kilka tysięcy lat doświadczenia w okłamywaniu całego świata. Mają lepsze wytwórnie filmowe, więcej wydawnictw, prasy i mediów i nigdy nie uda się nam tej wojny wygrać mając śladowe środki. Nie napiszemy tylu książek co oni, nie wydamy więcej filmów, nie opublikujemy więcej artykułów, bo jest to niemożliwe. Oni o tym doskonale wiedzą i dlatego tak właśnie pragną to rozegrać. Aby tę wojnę wygrać musimy całkowicie zmienić reguły gry, bo te które oni ustalili oznaczają pewną przegraną. Inaczej nawet by nie ryzykowali wojny. Jak zatem wygrać ustawioną partię szachów, z góry skazaną na porażkę? Trzeba rozwalić wszystkie pionki na szachownicy i wyciągnąć asa z rękawa, ot co. Są gotowi na szachy więc trzeba zastosować pokera, w którym mamy tylko asy. Bez jednego słowa o „mowie nienawiści” w miesiąc można wygrać tę i poprzednią wojnę i uwolnić nasz kraj. Trzeba po prostu olać ten skowyt bandyckiego planktonu, jaki się przewala przez wszystkie media i podjąć czyn. Gram czynu zawsze więcej ważył niż kilogram gadania. To po pierwsze. Po drugie ten czyn jak czarodziejska różdżka otworzy wszystkie zahipnotyzowane propagandą oczy i zamknie pokryte pianą usta. Trzeba migiem zbudować pomnik, to wszystko. Jedyny pomnik jakiego w tym kraju brakuje. Pomnik Polaków Pomordowanych Przez Żydostwo. Wielki może być jak Pałac Kultury lub Kopiec Kraka i charakterystyczny jak wieża Eiffela. Coś co na zawsze będzie się z naszą historią kojarzyć. Coś czego nie da się z czymś innym pomylić. Nie mam pomysłu na jego kształt ale mam pomysł na wykonanie. Powinien być pokryty czarnym marmurem na którym złotymi zgłoskami będą imiona wszystkich Polaków pomordowanych przez żydostwo od czasów Mieszka I – czyli od chwili kiedy na naszej ziemi postawił racicę pierwszy żydowski szpieg i handlarz słowiańskich niewolników – Ibrahim ibn Jakub. To nie koniec, ten pomnik powinien mieć swoją stronę w Internecie w paru najbardziej popularnych językach i ona powinna zawierać zwięzłe odnośniki do każdego nazwiska. Na przykład: Rotmistrz Witold Pilecki – zamordowany w 1948 roku – fałszywie oskarżony przez żydowskiego prokuratora Czesława Łapińskiego, skazany na śmierć przez żydowskich sędziów: Jan Hryckowian, Józef Badecki, Stefan Nowacki, protokolant żydowski Ryszard Czarnkowski. Prokurator Łapiński zmarł w szpitalu przy ulicy Rotmistrza Pileckiego i jak reszta zbrodniarzy nigdy nie został pociągnięty do odpowiedzialności za mord sądowy. Takie zwięzłe informacje muszą w bazie danych być podane w stosunku do każdej z kilkudziesięciu tysięcy ofiar katyńskich, na temat każdej z półtora tysiąca ofiar żydowskiego oprawcy Morella, oraz każdego Polaka zamordowanego lub wydanego na pewną śmierć przez żydostwo. To będą miliony nazwisk. Dziesiątki milionów dlatego pomnik musi wyglądać w formie zbliżonej do tej jaką ma pomnik upamiętniający w Ameryce ofiary wojny w Wietnamie. Nazwiska. Jedno przy drugim. A jego bryła musi mieć jakiś niepowtarzalny kształt, kojarzący się tylko z naszą ojczyzną. Gdzie go zlokalizować? Oczywiście w stolicy. W dobrym reprezentacyjnym miejscu, dostępnym i widocznym zewsząd, którego nie będzie w stanie przegapić żaden turysta. Na postawienie w Polsce polskiego pomnika nie musi być niczyjej zgody. My sami możemy temat ogarnąć i szybko go wykonać aby zamknąć w końcu raz na zawsze te oszczercze, bandyckie, antypolskie mordy. Aby uniknąć drętwego gadania z gatunku antysemityzmu, jednocześnie z naszym pomnikiem należy wznieść obok Pomnik Polaków Uratowanych Przez Żydostwo. Na ten pomnik mam już pełną koncepcję. Otóż może to być wysokie na cztery piętra, takie ładne, odlane z brązu wielkie „zero”, czyli litera O. Za zerem należy wymurować przecinek, bo chociaż przez ostatnie tysiąc lat nie było takiego Polaka to według matematycznego rachunku prawdopodobieństwa w kolejnym tysiącleciu być może znajdzie się pierwszy wyjątek. Wówczas to, aby nie przebudowywać w kosztowny sposób całego pomnika, za przecinkiem postawi się niedrogą jedynkę z dykty, aby jak by co łatwo ją można było wymienić na dwójkę, trójkę, itp. I taki właśnie pomnik bez jednego słowa powie więcej niż wszystkie filmy świata razem wzięte, książki lub stacje telewizyjne. I to w temacie „mowy nienawiści” wszystko. Jak jakiś Gross napisze jeszcze coś szkalującego Polaków to się mu na łbie przyklei odblaskową strzałkę wskazującą pomnik żeby wiedział gdzie iść potrzepać jęzorem i gdzie może do śmierci nieszkodliwie toczyć pianę z pyska. Polemika nigdy nic nie da – pomnik bez słowa załatwia wszystko. I absolutnie nikt nie może nam czegoś takiego zabronić. Ba, ja myślę że wszystkie inne kraje nie tylko będą nam pomysłu zazdrościć ale sami go błyskawicznie skopiują – ponieważ milczące upamiętnianie swoich ofiar nigdzie nie uraża niczyich uczuć i nie stanowi żadnej mowy, włącznie z tą nienawiści. Myślę, że taki pomnik będzie tonął w kwiatach przez 24 godziny na dobę, bo nie ma u nas ani jednej rodziny, która nie straciłaby kogoś z powodu żydostwa. Nie dajmy się sprowokować w jakieś debilne zrywy zbrojne, ale rozważmy pokojowe metody osiągnięcia tego samego najpierw. Wyciągnijmy rozumne wnioski z historii prze-pełnej pustych obietnic a potem haniebnych zdrad naszego Narodu przez inne kraje i zastosujmy strategię o jakiej jeszcze nikt nie słyszał na Ziemi, bo każdą inną oni już dawno przewidzieli i mają na nią opracowane plany – inaczej w ogóle nie wszczynaliby tej wojny. My w ich oczach robimy po prostu za silne, dobroduszne i poczciwe psy. Takie sympatyczne z baryłką rumu na piersi. Jak więc zachowa się taki piesek na widok wilka przybyłego w owczej skórze? No właśnie. Sobie odejmie od ust żeby odrestaurować biedną pokrwawioną owieczkę, która skamle że tak marnie wygląda, bo ledwie uszła z holokaustu. Trzeba w końcu pozrywać z nich te owcze skóry, żeby nasi rodacy przestali się któryś już z kolei wiek nabierać na ciągle te same lipne dramaty – równie naciągane jak „Zamach Na Adamowicza”, który jest wręcz ich idealnym przykładem. Tylko wówczas, kiedy się wywali kawę na ławę, bez najmniejszego trudu obronimy wszystkie bezbronne owieczki – te prawdziwe. Zawsze to robiliśmy i już wiele razy uratowaliśmy dzięki temu Europę. Gdyby nie Polacy już dawno ten kontynent zalany zostałby islamem lub bolszewikami – co na jedno i to samo wychodzi, bo to są przecież dokładnie te same wilki. Sprawa jest prosta. Zamiast pisać miliony publikacji i marnować na to mnóstwo czasu, postawmy jeden pomnik. Publikacje żyją swoim życiem kilka dni a potem giną w zalewie niepamięci i fałszywych informacji. Pomnik natomiast zostanie na zawsze. Zawsze da świadectwo prawdy i to milcząco! Nikt pomnika nie oskarży o cokolwiek, bowiem będzie on podparty prawdą historyczną. Weźmy się po prostu w garść i wznieśmy Pomnik Polaków Pomordowanych Przez Żydostwo. Takiego pomnika jeszcze nie było co zadziwia, albowiem to jedyny którego brakuje w Polsce. Weźmy się i zróbmy ten pomnik. Nie z zemsty. Nie z odwetu. Nie aby jątrzyć. Po prostu w imię sprawiedliwości. W imię prawdy. Mamy obowiązek pamiętać o naszych przodkach, których wymordowano tylko dlatego, że byli Polakami. Jak tego nie zrobimy po raz kolejny wymordują nas i wypędzą precz z naszego kraju. Doskonale wiedzą ile zbrodni nam wyrządzili ile nam są za to winni i właśnie dlatego grają tak ostro, żeby nas całkowicie unicestwić. Na razie robią nam miękką eksterminację: szczepionki, komornicy, mafie mieszkaniowe, kredyty, emigracja, sądy, urzędy, prokuratura oraz policja, ale jak zaczną rabować z nas ten 300 – miliardowy haracz, skończą się tego typu „sentymenty” i zacznie druga Palestyna. Za „mowę nienawiści” 15 lat, za „antysemityzm” 20 lat, a za rzucenie kamieniem dożywocie. A niemieccy bandyci z Platformy Obywatelskiej w tym właśnie celu zorganizują z radością jeszcze milion zamachów fałszywej flagi.          autor: baca (2019-01-29 08:33)\n\nCzęść I na linku: Zamach na Adamowicza – część I\nOpublikowano za: https://zmianynaziemi.pl/wiadomosc/zamach-na-adamowicza-czesc-ii\n  Czy to Izrael dokonał zamachu na Adamowicza?\nCzytaj na:     https://gazetawarszawska.com/index.php/okupacja-zydowska-w-polsce/2912-czy-to-izrael-dokonal-zamachu-na-adamowicza\n„",
			"added": 1550374862
		},
		{
			"topic_id": 1550690083,
			"title": "Zero Polska.",
			"body": "Witam; Czy jest jakaś instrukcja do obsługi, Zero Polska ? Próbny tekst udało mnie się wrzucić.  Drugi, też jakoś poszedł. A przy trzecim już się coś tam popsuło, Tytuł artykułu zainstalował się tam gdzie jest mój adres, za żadne skarby świata, nie mogę tego usunąć, Nie mogę też całości skasować, Ani uruchomić. Kto coś wie, na ten temat, i ewentualnie mógłby pomóc? Patrzałem na Angliku, tam się otwiera, i można dodawać i wysłać. Co robić? Najlepiej to wszystko by było usunąć, ale jak? Kto może pomóc? Bardzo proszę.Pozdr.",
			"added": 1550690075
		},
		{
			"topic_id": 1553289965,
			"title": "Cenzura na ZeroVoat",
			"body": "Witam; do wiadomości, artykuły na ZeroVot są blokowane wraz z komentarzami.Pozdr.",
			"added": 1553289956
		},
		{
			"topic_id": 1553622843,
			"title": "Pomoc dla Nowych użytkowników.",
			"body": "Pomoc dla Nowych użytkowników.\nWitam; Mam pewien pomysł, aby stworzyć kanał – stronę – blog – o tytule, Pomoc techniczna, informacyjna, dla nowych użytkowników. Chodzi  o to aby w jednym miejscu, zostały zawarte różne informacje, które dotyczą fizycznej obsługi ZeroNeta.\nCzyli gdzie co nacisnąć, co do czego służy, jak wykorzystać statystyki, oraz wszelkie inne możliwości tej aplikacji. Ta strona powinna być umieszczona w ZeroSites, dlatego żeby każdy mógł łatwo tam trafić. A nawet pokusił bym się , żeby ta strona instalowała się automatycznie, w menu – ZeroNeta. Chodzi o to żeby ją łatwo było znaleźć na samym początku. Żeby każdy nowy mógł tam zapytać, i dopytać się co z tym problemem zrobić. Żeby można było tam wrzucić krótki artykuł, instrukcję, poradę, jak postępować w danej sytuacji, oraz wszelkiego typu porady dla nowicjuszy; zapewniam, będą bardzo wdzięczni. Nie każdy jest osobą,która zaraz pyta się innych? Próbuje rozwiązać problem samodzielnie, a jak nie mogą? TO SIĘ ZNIECHĘCAJĄ – i mogą po prostu odejść od nas. A to by była, nie powetowana strata. Nas ma przybywać, a nie ubywać z powodów bliżej nie znanych. Popatrzcie na statystyki , inne narody są w czołówce; a my Polacy? Często nawet ta najmniejsza liczba nie jest pokazana. Podam przykład; Strajki w latach 70-tych, Stocznia stanęła, która liczyła -12,000-tys ludzi. I był szum na całą Polskę. Mała spółdzielnia zastrajkowała, - 70-ludzi. I nikt nie wiedział że coś się tam dzieje. Że taki zakład istnieje. To samo dotyczy to -ZeroNeta-. 20 – 30 – osób, to jest mało; do tego trzeba dodać jedno zero na końcu, albo lepiej dwa zera. Wtedy tutaj zrobi się ciekawie, będą ciekawe filmy, ciekawe artykuły, ciekawi ludzie. Oczywiście dostaniemy „opiekunów”, ale niewiele oni będą mogli zrobić? Jedynie będą mogli nas obserwować, i próbować przeszkadzać, tak jak to robią w Cenzurowanym -Internecie. Akta-została podpisana, co będzie dalej? Można się domyślić. Ludzie zaczną szukać alternatywy dla swoich wypowiedzi. My tutaj musimy się przygotować na ich przyjście. Musimy im pomóc się zaaklimatyzować tutaj. Mają przyjść, ma się im spodobać, mają zostać. Rzucanie im pod nogi  utrudnień w postaci – trudność obsługi ZeroNeta- musi  zostać  wyeliminowane. Więc proszę zaakceptujcie ten  pomysł czynnie. To się zwróci nam z nawiązką. W postaci wielu użytkowników  tego wolnościowego segmentu – informacji. Jeszcze jedna prośba; Czas zacząć na poważnie reklamować – ZeroNeta-.\nTrzeba to robić, nieustannie cały czas, bez przerwy na odpoczynek. Jak to ktoś kiedyś powiedział „W kupie siła”. Proszę wypowiedzcie się, co  myślicie o tym- Pomyśle? Wszystkie uwagi są cenne, bez wyjątku. Każdy inny pomysł też jest ważny.\nPozdrawiam wszystkich.",
			"added": 1553622833
		},
		{
			"topic_id": 1554150988,
			"title": "Dołączyć do spisu – ZeroSites.",
			"body": "Dołączyć do spisu – ZeroSites.\nWitam; Mam pewien pomysł, aby do spisu – Zero Sites – dołączyć strony których tam nie ma. A są to „POLSKICHAT”  -  „ZEROPOLSKA” - ZEROWIKIPOLSKA” - To będzie skutkować, tym że nowi którzy tu zajrzą będą mieli możliwość od razu zainstalować te strony i korzystać z nich. Prawdopodobnie nawet nie wiedzą że coś takiego jest tutaj. Piszę to dlatego w formie apelu, bo nie umiem tego zrobić; a zapewne znajdzie się ktoś ,dla kogo to nie stanowi problemu. Dzięki temu będzie można podnieść rangę tej małej społeczności. I jednocześnie zachęcić do działania na rzecz ZeroNeta. \nMam jeszcze jeden pomysł na usprawnienie.\nChodzi o to żeby zrobić ,taki  spis tytułów, dla JouTube PL. Żeby ten spis był zawsze pierwszą pozycją na J-T-PL. Żeby każdy  mógł przejrzeć jakie tam są pozycje do oglądania. Tytułów przybywa, i zaczyna się robić taki trochę bałagan, w tym co już tam jest zainstalowane. Ja wymyśliłem, te dato-numery.\nW tym systemie nie ma dwóch takich samych numerów. Jeśli ktoś zrobi taką tabelkę; to ja te wszystkie filmy posegreguję i w niej umieszczę. Taką segregację widzę w ten sposób zrobioną; Jest główny spis, który dzieli się jak drzewo na poszczególne dyscypliny, ułożone alfabetycznie; Mogło by tam być na przykład; Takie tematy jak. Historia, Polityka, Zdrowie, Technika, Humor,\nRozwój człowieka, i tym podobne; tak żeby można było dodać następne rozdziały. I żeby bez problemu umieścić dany film w odpowiedniej przegrodzie. Coś takiego by mocno usprawniło i zachęciło do oglądania. Tego co tam już się znajduje. Ja mogę instalować, ale tego nie umiem zrobić. Mam braki w tej materii. A i mój wiek jest już taki trochę , jak dinozaur. Jestem najstarszym użytkownikiem ZeroNeta. Z góry dziękuję i pozdrawiam wszystkich zapaleńców wolnego internetu.",
			"added": 1554150977
		},
		{
			"topic_id": 1554297078,
			"title": "ZeroWiki.",
			"body": "Już jest dodana w - do ZeroSites, Wiec można ją zainstalować na pulpicie, oraz nacisnąć gwiazdkę dla dodania wsparcia dla tej strony. Proszę o tym nie zapominać, Jest to wsparcie tak oczywiste, ze każdy to powinien zrobić. Zresztą będąc przy tym temacie, proponuję żeby każdy tam zajrzał, i dodał gwiazdki, jest to sygnał naszego wsparcia. Pamiętajmy , nie jesteśmy tutaj sami. Pozdrawiam i dzięki za zainstalowanie ZeroWiki, I poproszę o resztę stron, które są w obiegu . Z góry dzięki.",
			"added": 1554297066
		},
		{
			"topic_id": 1554830412,
			"title": "ROZWÓJ - DUCHOWY - CZŁOWIEKA.",
			"body": "Rozwój – Duchowy – Człowieka. \nJest to temat, który powinien zainteresować każdego człowieka. Własny rozwój i awans na społecznej drabinie ludzkości. Mam na myśli, raczej wewnętrzny rozwój. Ale to powoduje, jakby nie patrzeć wejście – wspinanie się na szczyt piramidy – wiedzy. Niestety bez wiedzy nie ma rozwoju. To idzie w parze razem  trzymając się za rękę. Czyli mamy ”WIEDZA + ROZWÓJ”. Jest to nierozłączny tandem. Po przeciwnej stronie mamy „GŁUPOTA + BRAK WIEDZY”. To odnosi się do całych społeczeństw. Na ten przykład szkoła do której chodziliśmy, nauka którą poznaliśmy. Czy ktoś z was próbował  zweryfikować to co was uczyli w szkole? Mogę się założyć ,że takich ludzi jest bardzo mało. Zostało przyjęte na wiarę, to wszystko co nam nauczyciel – profesor powiedział. Pytanie? Bardzo delikatne, czy nie mógł się nauczyciel mylić? Następne pytanie? Do czego zmierzam? A no właśnie chcę wam uzmysłowić, że jesteśmy nafaszerowani różnymi kłamstwami, i nie zdajemy sobie z tego sprawy. A to hamuje nasz rozwój wewnętrzny. Zresztą jest to celowo zrobione. W jakim celu? Mamy być „ BIO-ROBOTAMI”. Tania  siła robocza, i tak jest w rzeczywistości. Człowiek który samodzielnie myśli staje się niewygodny. Trochę długi wstęp, dotyczący rozwoju człowieka. Ale to są naczynia połączone, i jedno bez drugiego nie może istnieć. Właśnie została wrzucona seria filmów – Zrozumieć Matrix-a. Jest tego aż 10-filmów, albo tylko 10-filmów. Jest to z serii – Wiedza – autorem jest – Jacek Sokala. Te filmy są zweryfikowane, i są prawdziwe na stan dzisiejszej wiedzy. W tych odcinkach jest mowa o otaczającym nas Świecie, o postrzeganiu go przez nas.\nTrochę to odbiega od, tego co uczyli nas w szkole. To wszystko jest małym wycinkiem wiedzy. Następne filmy z serii – Wiedza-Zdrowie-Edukacja-Ezoteryka-Energia-Rozwój człowieka. Już wkrótce będę umieszczał na YouTubiePL. A stosowne komentarze, będą tutaj rozważane i dyskutowane. Wszelkie uwagi, oraz pytania, mogą być ( najbardziej dziwne ), na które będę starał się odpowiedzieć. Jest takie powiedzenie „ Kto pyta, nie błądzi „\nWięc śmiało pytajcie. Tak więc -2-odcinek porusza temat wody. Jest to tam opowiedziane bardzo na skróty, bo sam temat zajął by nie jedną książkę. I takie książki są oczywiście napisane. Problemem jest, które książki czytać? Te wprowadzenie przez autora pomoże wybrać właściwe, jeśli temat zainteresuje.\nOdcinek-3-mówi o stanie bezmyślności, o odwracaniu uwagi od ważnych spraw, o kierowaniu na inne tory myślenia, o braku komunikacji między ludzkiej, stajemy się zamknięci w sobie, jest też mowa o drganiach energetycznych, wibracjach, częstotliwościach. To nas otacza, tym się posługujemy, za pomocą tego się komunikujemy, tego my wszyscy używamy, \nCzęsto nie zdając sobie z tego sprawy. To jest wstęp, i pierwsze trzy odcinki z tematu – MATRIX - .Następne tematy i odcinki są w opracowaniu,i będą w kolejności  publikowane.  Miłego oglądania, czekam na pytania, jeśli jakieś będą.\nPozdr.",
			"added": 1554830399
		},
		{
			"topic_id": 1554849416,
			"title": "Ciekawostka-informatyka.",
			"body": "Nowy pomysł UE bliski finalizacji. Usuń niebezpieczną treść ze swojego serwisu w 1h od zgłoszenia – inaczej możesz dostać potężną karę\nTym razem jest to akcja o kryptonimie #TERREG, czyli konieczność usuwania treści o charakterze terrorystycznym. ( wszystko może pod to podejść ). Zaliczyć.\nNajnowszy, zatwierdzony (choć jeszcze nie finalnie) projekt zakłada konieczność usunięcia takiej treści w okresie do godziny od zgłoszenia (jeśli zgłoszenie tego typu jest realizowane po raz pierwszy – mamy 12h).\nPlanowana kara dla firm to maksymalnie 4% globalnego obrotu (dla prywatnych też zapewne nie będzie mała). Tak  – Julia Reda pisze, że na razie nie są spod obowiązku wyłączone prywatne osoby czy serwisy niekomercyjne. Jeśli nie mamy technicznej możliwości usunięcia w szybkim czasie niebezpiecznej treści, to wiecie, rozumiecie – możecie dać nam specjalne API do zarządzania treścią Waszego serwisu i z resztą już damy radę! Na tym rozwiązaniu – w czarnym scenariuszu – może się właśnie skończyć.\nNa koniec jeszcze retoryczne pytanie – co z terrorystami tego typu: powrzucają anonimowo „treści terrorystyczne” na niewygodne portale (komentarze!) – i zgłoszą to później, obserwując czy pechowcy wyrobią się z usunięciem contentu w jedną godzinę…?\nI jeszcze pytanie numer dwa – co z treścią hostowaną poza EU? Nagle ona staje się OK? A może będzie wycięty hurtem dostęp do tego typu serwisów na Wielkim Europejskim Firewallu…?",
			"added": 1554849402
		},
		{
			"topic_id": 1556361225,
			"title": "Wyjaśnienie; dotyczy wrzuconych artykułów.",
			"body": "anonymouslogin › Dlaczego skopiowałeś zawartość z pewnego forum tutaj?\nWitam; i odpowiadam.  Po raz kolejny. Kolega nie czyta uważnie, tylko po-łebkach. Zanim  ukazał się ten wpis , kilka krotnie wyjaśniałem o co chodzi. \nA chodzi o to, że te artykuły są moje. Zostały napisane prze moją osobę. Seria tych artykułów , dała pewnemu forum ; 12,000- wejść - oglądających. Nie jest to liczba wzięta z księżyca. To jest niezbity fakt. ( można sprawdzić ). Na tym forum nie były to jedyne artykuły, było tego trochę więcej materiału. W sumie było ponad – 250-sztuk. Tematyka – różna. Od -  Historii, Archeologi, Techniki,\nAstronomii, Fizyki.  - Najważniejsza grupa to Zdrowie, i pochodne od niej; takie jak, Szkodzenie, Zapobieganie, Leczenie, Rozwój człowieka wewnętrzny. Więc spektrum dosyć szerokie; Była też – Polityka- ale w wydaniu historycznym. I pre historycznym. Do dzisiejszej polityki się nie mieszam, że względu na słaby stan nerwowy, i mógłbym dostać zawału serca na samą myśl, co tam się wyprawia. Każdy z tych działów; to po parę tysięcy wejść, czyli oglądalność spora i spora popularność. Po czasie zrozumiałem, że przyznany dla mnie limit, to magiczna liczba – 12,000-. Jaki jest na to dowód? \nA no taki, że inni którzy zdobyli podobną liczbowo popularność; To już ich tam nie ma. Wtedy nie zdawałem sobie z tego sprawy. A dzisiaj to już wiem. \nWracając do sprawy, - Napisany tekst, należy zawsze do autora tego tekstu. \nWyjątek stanowi : pisanie na zamówienie i zapłata za ten tekst. W mim przypadku, nikt mnie nie zapłacił – więc zatem jest to moja własność, ( dalej ).\nMogę go upubliczniać gdzie tylko zechcę.  - Po za możliwością zabronienia, przez właściciela strony. Jego podwórko, i jego zabawki. A ponieważ, ten zakątek internetu; jest rzekomo wolny, to i pozwoliłem sobie zademonstrować moje bazgroły. Dla mnie negatywne opinie jak i pozytywne, są mile widziane. \nA w szczególności – merytoryczna  dyskusja na powyższe tematy, jak i dowolne. Podam przykład; dzisiaj został opublikowany post pod tytułem - \n„Voat, the ‘Censorship-Free’ Reddit, Begs Users to Stop Making Death Threats”\nPrzetłumaczyłem go dla tych co nie wstydzą się swojego języka. ( taka dygresja na temat używanych języków , od 70-lat. Był obowiązkowy – język Rosyjski.\nKtóry został zmieniony na obowiązkowy – Angielski. W niedalekiej przyszłości \nczeka nas jeszcze jedna zmiana języka. ). Jeszcze dwa słowa na temat języków.\nJeśli chcesz pogadać z Chińczykiem? Musisz się nauczyć jego języka. A my? \nZawsze na kolanach, bez jednego mrugnięcia okiem, czołgamy się.\nWracam do przykładu; w tym artykule – poemacie, jest na temat wyzwisk rzucanych pod adresem , człekopodobnych. Jeśli ktoś chce mnie wyzywać? To proszę bardzo. - Ale to to tylko świadczy o tej osobie, która to czyni. To nie ja zostaję poniżony. To ta osoba, się sama poniża. To taki przykład jak działa cenzura. Mogą to być, wyzwiska, przekleństwo, albo ostatnio modna, mowa  nienawiści. Wracam do meritum; Pytanie? Za co mnie usunięto – zawieszono?\nOficjalna wersja, to źle postawione przecinki, spacje. Wyrok brzmiał,- 6-miesięcy  banicji na tyn forum.  Stało się to 10-miesięcy temu. Ja już tam nie wróciłem, i nie wrócę. A to co ja napisałem jest moje, i mogę gdzie chcę udostępniać. Tyle w kwestii – wyjaśnienia tej sprawy.\nPozdrawiam.",
			"added": 1556361210
		}
	],
	"topic_vote": {},
	"next_comment_id": 134,
	"comment": {
		"1545344448_12Mvq5uNp3DouDNDHAvph1Uoovja7iAvz4": [
			{
				"comment_id": 1,
				"body": "Witam; Jak dla mnie ta instytucja niema racji bytu, chodzi o szpiegowanie, jestem na tym punkcie mocno uczulony. Bezpieczeństwo ponad wszystko, a tłumaczenie ludzi, że \" ja nie mam przecież nic do ukrycia\" należy włożyć między bajki. Chodzi oczywiście o face-zbuka.  A krypto waluta to tak jak mieć wirtualną dziewczynę. Dziewczyna musi być realna, i pieniądze też. Pieniądz powinien być srebrny, ( przynajmniej ). Tak jak kiedyś dawniej bywało. Papierowa waluta to jest żydowski wynalazek, sami mają złoto i srebro. A wirtualna jest tyle warta, jak długo prąd jest w sieci. Jak zabraknie prądu? To co wtedy robić, czy jest ktoś mądry, albo ma jakiś patent? Przy okazji ,ciekawe ilu nas jest Polaków tutaj?Bo coś mnie się zdaje że jesteśmy na szarym końcu. ( jak zwykle ) Jak macie jakieś pomysły, to można tutaj pisać. Bo tam na głównym , to tylko chyba same angole. Musimy się jakoś zorganizować.\nPrzynajmniej mnie się tak wydaje. Pozdrawiam.",
				"added": 1545490496
			},
			{
				"comment_id": 3,
				"body": "Wymieniając srebro, to miałem na myśli stabilność, i gwarancję, zabezpieczenie. Uzbierane monety, to i za 100-lat będą miały wartość, nie do podważenia. A papierem można napalić w piecu, i nic po za tym.Pzdr.",
				"added": 1545498364
			},
			{
				"comment_id": 4,
				"body": "Tak masz rację; Wiedza jest kapitałem na przeżycie, co do tego to nie ma wątpliwości. Z tym że różne słowa znaczą to samo, albo całkiem co innego. Dla mnie słowo wiedza, to znaczy to wszystko co ja sam samodzielnie się nauczyłem i to niekoniecznie z książki. A słowo „nauka” dotyczy tylko szkoły i nie posiada większej wartości,  no poza „papierkiem” (  dokument-świadectwo ). Jest to potrzebne do zatrudnienia się jako niewolnik – pracownik. Co do „WIEDZY” - to akurat jest wszystko na odwrót. Na przykład , masz wiedzę, możesz leczyć ziołami i nie tylko. To wiedza powoduje że zdrowo się odżywiasz, co w dzisiejszych czasach jest wprost nie do zrealizowania, ( wszystko jest zatrute ). Dzisiaj zdobyć pożywienie nie zatrute jest  wielką sztuką, i wielkim wyzwaniem. Wtedy nie jest potrzebny tobie lekarz, ani „Big-Farma”. KRYPTO – WALUTA, to jest przekręt stulecia. Jest to żydowski wynalazek ,żeby zapanować nad pracownik – niewolnik. Wszyscy którzy biorą w tym udział , to gorzko zapłaczą. Tak to się skończy. A co do zdobywania srebra z asteroid , To tylko jest czysta fantazja, już tłumaczę dlaczego. Spektrum promieniowania kosmicznego jest tak szerokie, że puki co dla człowieka jest ono śmiertelne. Niema żadnych osłon które by mogły człowieka fizycznie przed nim ochronić. To jest podstawą tego rozważania. Wiec jeśli posiadasz „WIEDZĘ” to zapewne wiesz o tym że żadnego lotu na księżyc nie było, człowieka w kosmosie nie było, a stacja orbitalna znajduje się w basenie \nwypełnionym wodą. Ci co to wszystko piszą ,to mają olbrzymią -FANTAZJĘ-  Reasumując, Prawdy – mało, Bardzo Dużo – kłamstwa. Wystarczy do tego troszkę wiedzy, a zobaczymy kłamstwo szyte grubymi nićmi. Na sam koniec, słowo „Ziemia” mam na myśli rolna, Dalej jest majątkiem, do którego ty już nie masz dostępu. Prawo zostało tak skonstruowane że teraz już ty nie kupisz ziemi. Nie mówię o ogródku przy domowym. Którego i tak nie możesz kupić, nazywa się teraz , ( wieczysta dzierżawa ). A tak naprawdę, to ziemię możesz tylko dostać na – 100-lat. I ponownie musisz ją kupić. Tematy które zostały tutaj poruszone, to malutki wycinek rzeczywistości, która nas otacza. Człowieka - Niewolnika.\nPozdrawiam.",
				"added": 1545527284
			}
		],
		"1545469324_12Mvq5uNp3DouDNDHAvph1Uoovja7iAvz4": [
			{
				"comment_id": 2,
				"body": "Witam; Film jak to film, trudno ocenić. Od takie mydło i powidło. Pytanie czy mówi prawdę? I na ile jest to prawda. Nic konkretnego, jak obejrzę więcej odcinków, to może coś się z tego wyłoni. Pozdr.",
				"added": 1545498026
			}
		],
		"1545594088_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 5,
				"body": "Witam; Miło że ktoś się tym zajmie, ja technicznie niestety takich umiejętności nie posiadam. Mój wiek, i późno zaczęta przygoda z informatyką, oraz braki w angielskim. Ale cały czas jestem \"ZA\" .Mam trzy kompy które są włączone i wspierają , Zmienny adres, jest trochę utrudnieniem w tej sprawie. Co jakiś czas się zmienia. Jeśli widzę jakieś nasze wpisy czy filmy, to je seduję. Moje logo zawiera cyfry, 21- i 12-. Wyłączyli mnie podpis, wiec nie mogłem wrzucać filmów. Naprawić nie umiałem, Założyłem nowe konto. Tam już nie wrzucam. Myślałem o swojej stronie, ale braki uwierają. Mam trochę filmów, imam trochę wiedzy, na różne tematy. Mam też trochę czasu,\nktóry mogę poświęcić.",
				"added": 1545610393
			},
			{
				"comment_id": 6,
				"body": "Witam; możesz trochę jaśniej? Nie rozumie, ziteów i drugie słowo - Sia.\nNajtańsze gb. kupuje w internecie. Karta, która ma 118-gb. kosztuje - 120zł. na 1-rok. Krótszy termin, jest tańszy. Problemem jest miejsce zamieszkania. LTE - mam tylko od Plusa. Inni dostawcy są, mają słaby zasięg.\nA na kablu, to szkoda gadać, cena z kosmosu. Kiedyś to się może zmieni? ale kiedy?",
				"added": 1545648722
			},
			{
				"comment_id": 7,
				"body": "Witam; Z tego co wiem, to wygląda to mniej więcej tak; Ja wrzucam film, Ten film jest tak długo jak ja mam włączonego  Pc-ta. Jeśli wyłączę, to jest brak dostępu do tego filmu. Jeśli Kowalski - , ten film z Seduje, to kopia jest u niego, ( całego filmu ). Wtedy jest dwóch Sederów, Ja i Kowalski, czyli dwie kopie jednocześnie. Jeśli film Kowalski  tylko  obejrzy; to jest – zostaje  nagrane 5-MB. Jeśli  film ma 25 – MB- , to musi  być pięciu Kowalskich, 5x5-MB = 25-MB. Wtedy jest znowu jeden komplet. Dlatego ja mam trzy Pc-ty, które są włączone cały czas. I dany film Seduję na wszystkich trzech. Jest wtedy trzy kopie – pełne. Ci co tylko oglądają , to dorzucają się,  zawsze  po tym kawałku 5-GB. Aż zbiorą te 25-GB. I powstanie pełny komplet.\nJeśli jest 100 – 200 osób, każda po 5-GB. To nie jest źle, zawsze jest jakaś kopia dostępna dla ludzi. Problemem jest mała liczba oglądających – mała liczba Sedujących. Wszystko jest super w momencie, jak jest wielu oglądających, wielu – sedujących.  To jest pięta Achillesa. Tego wytworu. \nW założeniu ma być wielu odbiorców . Wtedy koło fortuny się kręci. Jest OK.\nJeśli jest chmura, to jest serwer, to jest pośrednik, to jest kontrola, czyli można manipulować. Więc każdy powinien mieć włączony na stałe, Laptopa czy Pc-ta. Przynajmniej starać się to zrobić, na początek. Ja to robię, i moje filmy są na wierzchu, tak mnie się wydaje. Ja je przynajmniej widzę że są. Potwierdzić musi druga nie zależna osoba. Dlatego jak ty wrzucasz film, to ja go Seduję,\nJak ja wrzucam to ty go Sedujesz. Czyli się uzupełniamy, To dotyczy wszystkich zainteresowanych. Dobre twoje – dobre moje. Tak to działa.\nCzyli dużo – dużo ludzi. Którzy się wspierają. Jeśli ktoś musi wyłączyć Pc-ta,\nto kto inny go zastępuje – uzupełnia. Komunizm w pełnej krasie.\nPozdrawiam.",
				"added": 1545685147
			},
			{
				"comment_id": 8,
				"body": "Jeszcze jedno, w ustawieniach można ustawić , nie 5GB, a na przykład, 10,- 15,- 20.- i więcej. To zależy od dobrej woli oglądającego.To jest ważne, aby na początku było więcej ustawione. Nie dotyczy Sedowania.",
				"added": 1545685502
			},
			{
				"comment_id": 9,
				"body": "Pierwsza strona.ZeroNeta, Z prawej strony u góry , jest niebieski sześcian; logo. Myszką naciskasz ,lewy klawisz, i przeciągasz w lewo, otwiera się pod strona, na której masz sporo ustawień. Oraz sporo danych. \nTrochę to zakamuflowane, ale jest. Pzdr.",
				"added": 1545867098
			},
			{
				"comment_id": 11,
				"body": "Przy okazji wspomnę dla pozostałych, może się przyda. Z lewej strony są kropki, i po naciśnięciu otwiera się pod menu, i tam jest \"WAŻNE\" aktualizacja do najnowszej wersji. Trzeba ją nacisnąć, i zatwierdzić prawa ,u góry strona. A reszta według uznania.Pzdr.",
				"added": 1545867935
			},
			{
				"comment_id": 12,
				"body": "Skleroza nie boli: \"TE USTAWIENIA\" - dotyczą , do każdej strony którą macie otwartą, ( obsługujecie ). Czyli każda otwierana strona ma takie ustawienia, i one dotyczą tylko wyłącznie tej strony.",
				"added": 1545877616
			}
		],
		"1545866999_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G": [
			{
				"comment_id": 10,
				"body": "Również wszystkiego dobrego, dla wszystkich, Tylko żeby nie było gorzej, niech zostanie tak jak jest. Już się przyzwyczaiłem do tego. I potrafię z tym sobie poradzić. Pozdrawiam.",
				"added": 1545867307
			}
		],
		"1546155194_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 13,
				"body": "Witam; Mam oryginalną płytę instal. Pochodzi z Niemiec. Strasznie dużo jest plików na tej płycie, ja to nazywam \"wesołe-miasteczko\". Nazwa się bierze z stąd, że wszystko tam jest już zainstalowane. Dużo jest tego. Na mój gust, dużo za dużo. Podam taki przykład; Jest pusty pokój, czy w nim może się ukryć szczur? I jest obok pokój pełen klamotów, rupieci, gratów przeróżnych. Pytanie? Który pokój wybierze szczur, aby w nim zamieszkać? Zaawansowani hakerzy używają od zawsze \"Arch-a Linux-a\" . Dlaczego? Bo tam nic niema, żadnych wodotrysków, wesołych miasteczek. Od pierwszego dnia powstania tej dystrybucji, niewiele się w niej zmieniło, dlaczego? Bo jest prosta i jednocześnie doskonała. Tak jak siekiera, od dnia powstania, niewiele się zmieniła. Była dobra, i jest dobra. Jedynym problemem \"Arch-a\" jest Terminal. Ale to już jest pojęcie względne.\nPozdrawiam i życzę Szczęśliwego Nowego Roku.",
				"added": 1546295173
			},
			{
				"comment_id": 14,
				"body": "Witam; dodatek specjalny, dotyczy tematu, znaleziony przed chwilą.Aktualna sprawa.\nNie zapomnij o rosnącej bazie danych identyfikacyjnych „głosowych”. Możesz zadzwonić z dowolnego miejsca w Stanach Zjednoczonych (na całym świecie, jeśli o to chodzi), a twój głos jest (nagrany i) dopasowany do TWOJEGO „pliku elektronicznego” przez potężne superkomputery. Podobnie jak odcisk palca i dopasowanie DNA.   \"TO TAK DLA OSŁODY NA NOWY ROK.\"",
				"added": 1546295880
			},
			{
				"comment_id": 33,
				"body": "Witam; Wszystko się zgadza, przepraszam. To jest temat na napisanie książki, w paru zdaniach jest trudno wyszczególnić wszystkie niuanse szarej rzeczywistości. Jest to temat rzeka. Chodzi tylko o zwrócenie uwagi na problem, który istnieje. A ludzie ogólnie, nie mają bladego pojęcia na te tematy. Tych punktów kontrolnych jest bardzo dużo, chodzi o to żebyśmy się w tym pogubili.Zlikwidujemy, jeden dziesięć, a jest ich dwadzieścia. I one dalej działają. Rzeczą ważną jest utrudnić, a nie ułatwiać. Jeśli każdy to będzie robił, to będą musieli zatrudnić dodatkowych ludzi, postawić nowe maszyny, jeśli chcą? To dlaczego nie? Wystarczy że my zachowujemy się tylko inaczej, nie tak jak oni oczekują.Pozdr.",
				"added": 1549384384
			},
			{
				"comment_id": 102,
				"body": "Witam; dalszy ciąg tematu, bezpieczeństwo; pod postacią filmu: 2019.04.12.03.[PL]-Internet-Kontrola-Prywatność w internecie. A.Berdowicz-[61min]-.mp4\nPraktyczny wykład o prywatności w internecie, ( podstawy ). Czyli zbieranie informacji o ludziach na całym świecie. Zabezpieczenie się przed tym, utrudnienie. To wszystko, to jest przedszkole, od jakiegoś momentu trzeba zacząć naukę. Dobrze jest z tym się zapoznać, i  o tym wiedzieć. Oraz trzeba umieć to zastosować, i korzystać z tego. Nadchodzące czasy, zmuszają nas do tego. Ostatnie dni, wyraźnie to pokazują. Pozdr.",
				"added": 1555210779
			},
			{
				"comment_id": 125,
				"body": "Witam; Pegasus nie jest modny, on ma już dwa lata. Nie chodzi o modny wygląd, ale o bezpieczny dla nas. Poruszyłem go przy okazji, innych tematów. Większość ludzi niema pojęcia ,że takie coś istnieje. A jeśli już się dowie, to i tak nie wieży, bo po co mieli by coś takiego robić? Nie chodzi tutaj o bałwanów, ale o przytomnych ludzi. Laboratorium Citizenlab.ca z Toronto; brzmi jakoś mało wiarygodnie w tym przypadku. To nie jest żebym się czepiał. Ale tamtemu końcu świata to ja już nie wierzę. Tak za nic. Ja też polecam przeczytać,  ja wiem czym to grozi. Dobre pytanie? Jak monitorować Pegasusa? Jest jedna opcja, ( przynajmniej ja tak to widzę ). Cały program napisać na nowo samodzielnie; Kto się tego podejmie? Raczej chyba nikt. Gdzie te czasy kiedy programy były malutkie i przejrzyste? Każdy mógł sprawdzić, zapoznać się, poprawić. To jest już historia; zostaliśmy zasypani bzdetami, nikomu nie potrzebnymi, i niemożliwymi do sprawdzenia. Pytanie? Dlaczego? Bardziej inteligentni niech odpowiedzą sobie sami. A reszta to śmieci, czyli wysypisko. Pewnie, Arch-Linux, jest jeszcze bezpieczny. Ilu jeszcze go używa? Internet był protegą; ale indolencja ludzka i głupota go zniszczyła. Nie chodzi tylko o łączność, ale o pozostałe właściwości, takie jak strony, portale, fora, pocztę, prywatność, itd. \nJak coś wiecie? jak coś znajdziecie? dajcie znać, podzielcie się dobrą wiadomością. \nPozdrawiam.",
				"added": 1568660881
			},
			{
				"comment_id": 128,
				"body": "Witam; Dzięki za SZCZEGÓŁOWY-opis. Może to być pomocne, jak i uzupełniające wiedzę. Jasna sprawa, są różne poziomy bezpieczeństwa. W zależności co robimy? i do czego to ma służyć? Ta wyliczanka na pewno się przyda, sama świadomość, że można coś zmienić, zamienić, podmienić, wyrzucić, czyli pozbyć się nie potrzebnego. Pierwsza zasada, pusty i czysty sprzęt; ale my mamy taką przywarę, że lubimy zbierać, bo może się kiedyś przydać. No i większość z nas ma totalny bałagan, w którym sami się gubimy. \nPrzy okazji dodał bym do spisu pożytecznych rzeczy; \"Arch-Linux\". Dla bardziej wymagających. \nByć może taki instruktarz się przyda komuś, kto zechce walczyć z tym system. Mało już czasu nam zostało na wymianę swobodnych danych. Internet został totalnie przetrzepany z wartościowych pozycji. I wnioskuję, ze to jeszcze nie jest koniec. Jeśli będą jakieś nowe uwagi? To proszę napisać, i pisać, dla potomności.\nPozdrawiam.",
				"added": 1569444027
			}
		],
		"1546977497_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 15,
				"body": "Witam; Najlepiej-[PL]- bo to jest tylko cztery znaki. A -J.polski- to już osiem znaków. + do tego długi tytuł; i mamy troszkę problem. Dobre bo minimalistyczne. Ale jak cały tytuł jest po polsku, przetłumaczony , to też się wyróżnia. Pzdr.",
				"added": 1547313671
			},
			{
				"comment_id": 19,
				"body": "Witam;Ja wrzucałem na zeroupa, ale zablokowali. następnie na joutube, tam powinno być około 80 filmów.\nNa kopykate, jest tylko parę filmów moich. Teraz będzie więcej, brak strony po naszemu, jest mankamentem.\nJakby ktoś sklonował kopykate, albo joutube, dał naszą nazwę, To wtedy można by było wszystko w jednym miejscu zebrać do kupy. Ja nie założę strony , bo nie umiem. Umiem inne rzeczy robić, i inne posiadam wiadomości.Pzdr.",
				"added": 1547968023
			},
			{
				"comment_id": 21,
				"body": "Witam; Niema sprawy, ale próba połączenia z tym adresem spełzła na niczym. Będę próbował ponownie.\npozdr.",
				"added": 1548294188
			},
			{
				"comment_id": 22,
				"body": "Witam; Teraz o 14-godz. Wyświetliło, nie wrzucono jeszcze plików. To znaczy że działa. Jak coś będzie to daj znać.Rozumiem że to jest odrębna strona.Czy to ma jakąś nazwę? Do wszystkich plików dodawaj - [PL]- to ludzie będą mogli Łatwiej znaleźć.Pzdr.",
				"added": 1548334676
			},
			{
				"comment_id": 23,
				"body": "No dobra; ale jak to zrobić?",
				"added": 1548336951
			},
			{
				"comment_id": 24,
				"body": "Wrzuciłem krótki film o zdrowiu. Zobacz czy działa.",
				"added": 1548337456
			},
			{
				"comment_id": 25,
				"body": "Wszystko działa, to chyba mamy problem rozwiązany. Teraz potrzeba tylko widzów, którzy będą oglądać. Pzdr.",
				"added": 1548342016
			},
			{
				"comment_id": 26,
				"body": "Ja wrzuciłem na trzy różne, Pc-ty i jest łączność między nimi; tak mnie się wydaje.Może napisz na pocztę, to będzie prywatnie. tomasz21@zeroid.bit   Wrzuć cokolwiek, ja spróbuję seedować.",
				"added": 1548347240
			},
			{
				"comment_id": 73,
				"body": "Witam; \"kasiarzyna\"- Prawdę mówiąc nie słyszałem o -\"optional files\". To wszystko zależy od mocy internetu, przesyłu, i ilości peer-ów. Po mojemu, pojedyncze seedowanie jest pewniejsze. Od razu widać wynik. Czy jest dobrze  czy źle. Żeby Automatycznie pobierać, można w ustawieniach zwiększyć ilość do seedowania. Na stronie której chcesz to zrobić,z prawej strony u góry jest logo; najeżdżasz myszką, przeciągasz w lewo, i otwiera się zakładka. Tam w niej znajdziesz ustawienia aby zwiększyć limit seedowania. To spowoduje, że wszystko do tego limitu będzie się pobierało automatycznie. Jednocześnie przyspieszy pobieranie, jak i wsparcie dla tej strony i na niej znajdujących się filmów. Przy okazji dzięki za wsparcie w seedowaniu dla -JouTubePL. Przy pewnym poziomie wsparcia powinno zacząć wszystko działać poprawnie; Taką mam nadzieję. Wszelkie informacje są mile widziane, bo mogą tylko poprawić cały system.",
				"added": 1553470692
			},
			{
				"comment_id": 75,
				"body": "Witam;@kasiarzyna - Cieszę się że mogłem pomóc.A przy okazji i inni się czegoś dowiedzą na ten temat. Pozostaje temat ; a użytkownik, który wrzucił filmy szybko uciekł ...-Tak to też może być przyczyna, którą należy wziąć pod uwagę. Czyli wrzucił, i za moment wyłączył. Tutaj trzeba dać sobie na wstrzymanie i trochę odczekać. Ja myślę że to też ,może zależeć od internetu + WiFi - oraz internet radiowy, który ma czasami dziwne tendencje w swoim zachowaniu. I wtedy może zostać plik uszkodzony w czasie transmisji. Wtedy radą jest na 100%- zrobienie dubla; czyli wszystko dosłownie to samo. Żadnych zmian, kropka, przecinek, litera, słowo,- Wtedy kopia nałoży się na oryginał i uzupełni wszystko brakujące, wtedy nie będzie dwóch wersji tylko dalej jedna. Druga możliwość, to skasować i ponownie spróbować wgrać. Dlatego ja mam wszystkiego kopię, to co wrzucam na J-T-PL. Pytanie do ciebie? Jaka tematyka, filmów ciebie interesuje, co chciałaś- byś obejrzeć, przeczytać. Mam spore archiwum, i wszystko zweryfikowane. Taka moja cenzura, na kłamstwo i pomówienie, oszczerstwa.  Staram się nie wrzucać, kłamstwa i głupoty. W sumie wysoki procent prawdy w tych filmach. W tych sprawach Możesz pisać prywatnie. Pocztę sprawdzam często. I nic nie stoi na przeszkodzie aby jakimiś ciekawostkami uzupełnić. Pozdrawiam.",
				"added": 1553529245
			}
		],
		"1547400112_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 16,
				"body": "Witam; Ja stosuję najprostszy; Drzewo: PUBLICZNY – PRYWATNY.\nPUBLICZNY-dzieli się na pod rozdziały. 1.FILMY – 2. MUZYKA.- 3.TECHNIKA. - 4.POLITYKA.- 5.SPORT.-  6. ZDROWIE. - 7.KOŚCIÓŁ.-\ni tak dalej, tyle ile potrzeba. Te od-1- do -7- dzielą się dalej.  Na przykład-\n-6.ZDROWIE. Dzieli się na  - A -ZAPOBIEGANIE-  B.- LECZENIE.\nC.- SZKODZENIE. D.- POLITYKA-ZDROWOTNA.  Itd.\nIlość jest dowolna jak i podział. Chodzi o to żebyśmy my mogli znaleźć nasze depozyty.  Do tego proponuję dodać numer – datę, który będzie jedyny w swoim rodzaju niepowtarzalny. W zasadzie to wszystko. PUBLICZNY- to\njest to wszystko co udostępniamy publicznie. \nPRYWATNY – to jest to wszystko nasze osobiste. Podział podobny.\nPozdrawiam.",
				"added": 1547493623
			},
			{
				"comment_id": 17,
				"body": "Witam; Chyba trochę nieporozumienie zaszło. Słowo archiwizacja, to jest jak przechowywać jakieś, utwory, publikacje, filmy, w zorganizowany sposób łatwy do późniejszego odszukania. Dla mnie archiwum, to miejsce, magazyn na jakieś przedmioty, dokumenty. To tyle wyjaśnienia. Jak przenosić dokumenty? Filmy, Muzykę?  Ja to robię tak, prosto; mam Debiana8- . Ściągam  film, czyli nagrywam do folderu eksport, i tam czeka na \nwrzucenie na ; Kopy-Cate, You-Tube, itp. Kopia ląduje w archiwum pod stosownym hasłem. W międzyczasie nanoszę poprawki, zmiana tytułu, numer archiwum, data, opis, czas emisji. Żadnych do tego nie używam programów, ani pośredników.   Tekst , podobna sytuacja, Używam do tego Writera- gdzie zmiana czcionki, wielkość, kolor, zaznaczenia, wycinka niepotrzebnego tekstu, dopisywanie tekstu, tłumaczenie, itp. To wszystko. Prosto bez zbędnych czynności, dodatkowych. \nDomyślam się że chodzi tobie o to gdzie te teksty umieszczam na ZeroNecie?\nNajlepiej jest mieć swoją stronę, dobrze opisaną, można sklonować, taką stronę. Umieszczanie u kogoś, swoich tekstów wiąże się z ryzykiem ich zablokowania. Z czym się osobiście spotkałem. Tyle w tym temacie. Jak masz pytanie to pytaj, zawsze ktoś może doradzić, jak nie ja to ktoś inny. Pzdr.",
				"added": 1547850358
			},
			{
				"comment_id": 18,
				"body": "I to jest właśnie to, co można zrobić w ZeroNecie. Należy pamiętać o seedowaniu. Żeby stało się nieśmiertelne; potrzeba kilka seedowań kompletnych. Pojedyncze oglądanie seeduje mała cząstkę. Dopiero kilka kompletów daje efekt. Albo najlepiej własna strona, i 24godz 7dni włączony\nPc-et. Cały czas jest mało nas, i to się mści słabym przebiciem. Ludzie zaglądają,  i  odchodzą. Co zrobić? Taki my naród. Pzdr.",
				"added": 1547856360
			},
			{
				"comment_id": 119,
				"body": "A adresu nadawcy i numeru telefonu nie potrzeba? Może jeszcze zdjęcie do akt. Przecież mamy Acta-2. Czy już wam to umknęło. Dlaczego to nie ma być anonimowe? Przecież ZeroNecie jest anonimowe. Pomysł jest kapitalny dla służb na trzy litery. Ja się nie piszę na taką propozycję, istotnie, pomysł jest szatański. Pozdrawiam.",
				"added": 1566330158
			}
		],
		"1545616567_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 20,
				"body": "Witam; Próba ogarnięcia , ( uporządkowania ) materiału filmowego. Do każdego filmu zostały dodane w nawiasach duże literki [PL]. Będzie chyba łatwiej coś znaleźć po naszemu, dla nas. Niestety do  niektórych pozycji, już nie mam dostępu. Siła wyższa, skasowane konta. Postaram się uzupełnić braki.Trochę to jest syzyfowa praca, ale co zrobić, jak się chce coś przekazać dla potomności. Pierwsze materiały są takie trochę do sprawdzenia, systemu jak i odbiorców. Dalsze powinny być ciekawsze. To zależy co kto lubi? I na co czeka. Jest tego 100-sztuk, właśnie policzyłem. Są one rozrzucone po trzech stronach. To znaczy w trzech miejscach. Pierwsze były na ZeroUpie, i tam jest już definitywnie sprawa zakończona. Są bo są , i  następnych   już tam nie będzie. Następne miejsce, to You-Tube. Jest ich tam dosyć sporo. Oraz na Kopy-Kat. Tam jest reszta. W archiwum jest jeszcze spory zapas. Jeśli będzie zainteresowanie? To będę wrzucał następne. Są to sprawdzone materiały, oczywiście na ile można sprawdzić. Staram się uniknąć wrzucania BADZIEWIA- W zasadzie każdy z tych filmów ma jakiś przekaz wartościowy dla ludzkości. Kwestią jest czy umiemy czytać między wierszami? Filmy nie są cięte prze zemnie, są w całości. Co najwyżej tytuł może być  trochę zmieniony, względy ekonomiczne.  Tematyka jest różna. Jak będę miał swoją stronę to posegreguję tematycznie. Na ten moment jest wymieszane. Ale warto to obejrzeć, wysłuchać i przeczytać . Materiał jest sprawdzony. Staram się nie serwować lipy. Pozdr.",
				"added": 1548093253
			}
		],
		"1548433003_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 27,
				"body": "Witam; Wielkie dzięki, będzie ludziom łatwiej znaleźć.Twój film na J-T-PL; na jednym Pc-cie obejrzałem, i mogłem seedować. Na pozostałych dwóch; nie dało rady obejrzeć, ani seedować. A na kopykate, działa wszystko. OK. Nie wiem co się dzieje, i co jest tego przyczyną.",
				"added": 1548523987
			},
			{
				"comment_id": 28,
				"body": "Witam; Ponownie sprawdziłem. Fałszywy alarm, wszystko ruszyło, 3x odtwarza. 3x seeduje. oczywiście na obydwu stronach. Przepraszam, jestem trochę w gorącej wodzie kąpany. Wszystko jest OK. Pozdr.",
				"added": 1548525647
			},
			{
				"comment_id": 29,
				"body": "Witam; ey2xjpdx - Drugi dzień nie mogę twojego filmu seedować, ani otworzyć? Chodzi o program naprawczy-S.Michalk. Myślałem że coś z internetem, zapchany? Ale dzisiaj drugi dzień i dalej nic niemożna nic zrobić. Twój film stoi. Czy to jest jakaś awaria? Pzdr.",
				"added": 1548679326
			},
			{
				"comment_id": 30,
				"body": "Witam; Mam parę pytań. W związku z działaniem ZeroNeta. Może ktoś odpowie. Mam nie odparte uczucie,że tutaj się dzieją dziwne rzeczy. Z początku zwalałem to na karb, nieumiejętności w posługiwaniu się tym wynalazkiem. Następnie wziąłem pod uwagę zachodzące zmiany w nim. Wiadomo jak się coś grzebie i udoskonala to wychodzą jakieś błędy, które trzeba poprawić. Nie miałem jak tego sprawdzić, ani kogo zapytać. Więc zainstalowałem drugiego kompa, taki z demobilu, ale działający. To nie jest gierka, której liczą się osiągi. Jakie było moje zdziwienie, on ten drugi zaczął pokazywać co innego. Takie rzeczy dzieją się tylko w światach równoległych. Więc dołożyłem trzeciego kompa. Dalsza rozbieżność, od tych dwóch. Do tej pory nie potrafię znaleźć sensownej odpowiedzi. Na przykład; Zero Talk Polska; jest na jednym cały czas opóźniony o ileś tam postów, dlaczego? Następny przykład; Aktualizacje które przedtem dosyć sprawnie się robiły, teraz stanęło w miejscu, liczba na każdym jest inna, i tak przez cały dzień albo i dłużej. Internet jest jaki jest, jest radiowy i na speed teście pokazuje przyzwoite wyniki. Więc ta przypadłość odpada. Na początku jak seedowałem jakiś film to miałem trzy razy seedowanie, następnie spadło do dwa i pół, a teraz jest tylko półtora, jak to wytłumaczyć? Pomijam nieporozumienie na ZeroUpie, ja to rozumiem jest to czyjeś, i ktoś ma tam jakieś swoje plany na przyszłość. Niema sprawy, wystarczyło by dwa słowa powiedzieć, na ten temat. Ja nie zamierzam się komuś wcinać w jego podwórko. Następnie zauważyłem że pewne filmy, pomimo potrójnego seedowania przechodzą w niebyt? Założyłem kartotekę, w której mam spisane wszystkie moje filmy, które zostały zainstalowane. Też się nie bardzo zgadza, ze stanem rzeczywistym. To tak na skróty, co się wydarzyło do dzisiaj. Ja rozumiem że to jest jeszcze w fazie organizacji, i mogą się zdarzać błędy. Ale właściwa komunikacja między ludzka przyspiesza usuwanie tych niedogodności. Zastanawiam się ilu jest nas na tym tworze? Na każdym jest inna liczba. Mogę zrozumieć, że nie każdy chce się ujawnić, albo nie każdy coś tam wrzuca. Wszystko rozumiem, ale ten system polega na ilości odbiorców i seedowaniu przez nich tych treści. To też było powodem dodania następnych  comp. Jest to walka o przetrwanie. Jeśli będą ciekawe pozycje do obejrzenia? To będą i  gapie, oglądacze. Więc każda uwaga typu; na temat instalowanych pozycji może się przyczynić do poprawy sytuacji, przybędzie oglądających. Ja się polityką nie zajmuję w myśl zasady; Trzech dyskutujących = 9 partii politycznych. Jestem za stary by brać w tym udział. Interesuje mnie zdrowie, technika, filmy o podłożu politycznym, bo one niosą jakiś przekaz dla ludzi. Jednocześnie chciałbym by pozycje, które są wrzucane były dostępne dla wszystkich ciekawych tego świata. Liczy się każda pomoc, która zmierza w tym kierunku. Jak również uwagi wszelkiego typu. Ja się nie obrażam. Po za tym ciekawi mnie czy to co wrzucam można oglądać, czy nie ma jakiś technicznych problemów. Ostatnio poprawiony – program naprawczy-Michal. Zatrzymał się na wysokości, 170-MB.  A całość liczy 176-MB. Druga sprawa, jak sądzę poprawiony 2012.12.28.01.Religia- Nie otwiera się i nie można oglądać. Niema problemu żebym to drugi  raz wrzucił. Mam archiwum i nie ma problemu. Wystarczy tylko zgłosić, że coś fiksuje; to wgramy od nowa. Co do innych filmów u mnie się otwierają i można je oglądać. No chyba że wielki brat  patrzy i nie pozwala? Tak długo jak nas będzie mało – to nie ma wielkiej nadziei na poprawne działanie tego systemu. Ktoś kiedyś powiedział; W  kupie jest siła, „PANOWIE”. Pozdrawiam.",
				"added": 1548813878
			},
			{
				"comment_id": 31,
				"body": "Dzięki za odpowiedź. Ja mam włączone trzy sztuki. Praktycznie cały czas. czasami jeden jest wyłączany, Przenoszenie go ; i z stąd - wyłączony. Więc połączenie jakieś tam powinno być. Tylko że wszystkie trzy pokazują co innego. Tak jakby trzy różne sieci obsługiwały? Z czego to wynika. Stoją obok siebie. a wyniki mają, są różne. Ilość połączeń, ilość ludzi, ilość trackerów. Aktualizacje robię cały czas,tą wersji i stron.Pzdr.",
				"added": 1548881152
			}
		],
		"1549170023_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 32,
				"body": "Dzięki; znam ten problem, nazywa się lenistwo, tutaj może być tylko pomocna informacja, na przykład ; jak interesują się teoriami spiskowymi, albo naukowymi, że można znaleźć takie filmy. Ogólnie to jest trudna sprawa, wiem coś na ten temat. Ja też próbuję namawiać, skutek mizerny. Nie na darmo wynaleziono mobilny internet. Wszystko ma swoje przeznaczenie. Pozdr.",
				"added": 1549200123
			}
		],
		"1549370605_1Aj37nbAyjeUsYPh6jd3NFn17B7uLkbN5r": [
			{
				"comment_id": 34,
				"body": "Witam; Bardzo dobrze napisane. Do tego ja bym jeszcze dodał; \"GŁUPOTA\" która ogarnęła wszystkich ludzi. No nie, przepraszam, nie wszystkich. Autor pisze do rzeczy, czyli są pojedyncze przypadki, normalności. Pytanie? Ilu nas zostało? Kto tutaj jest jeszcze normalny? Smutno robi się na duszy, jak widzę, jak Świat stacza się po równi pochyłej. Dodać można jeszcze słowo \"MODA\". I tutaj odgrywają rolę różnej maści \"CELEBRYCI\"....Którzy wiodą prym, w tym przedstawieniu. Jeśli mamy telefon, który służy do rozmowy. To jest OK. Ale dodatkowe wodotryski, ozdoby, zbędne instalacje? To jest tylko po to zrobione, abyś nie miał czasu na nic więcej. Żebyś przestał samodzielnie myśleć,  czyli pełna kontrola nad twoją osobą. Taki \"Bio-robot\" w ludzkiej postaci.Pozdr.",
				"added": 1549385751
			},
			{
				"comment_id": 35,
				"body": "Nie sadzę, żeby zginął. Pewnie ewoluuje w coś innego. Problemem jest że ludzie są samotni, i szukają znajomości za wszelką cenę.Niektórzy szukają popularności, sławy za wszelką cenę.I oni zawsze tam wrócą i będą.Dla nich to jest jak narkotyk. Muszą zażyć, żeby żyć.Żeby stamtąd dać dyla, to trzeba mieć świadomość, przynajmniej na poziomie, [ Tutaj proszę sobie wpisać dowolne słowo ]. Oczywiście ten problem nie dotyczy wszystkich. A wyciekające dane, znam ten problem; tutaj winą bym obarczył system który jest dziurawy jak sito.Zgłaszanych błędów, nikt nie naprawia.Myślę że to jest celowo robione.Zmiana dystrybucji, może poprawić sytuację, ze system stanie się bardziej szczelny. Ale trzeba wiedzieć o tym. I tutaj wchodzi do użytku słowo, \"WIEDZA\". Nie mylić z nauką, która często i gęsto jest oparta na fikcji, literackiej.Drugą sprawą jest, że ludzie tam wypisują straszne głupoty, czyli bardzo niski poziom elokwencji. Właśnie dotarliśmy do sedna problemu; To wszystko ktoś sprytny wykorzystał przeciwko ludziom, a oni jak te barany maszerują do rzeźni, albo do odstrzału jak kto woli.Kto wynalazł ten wynalazek? Pejsaty. On widział i wiedział  więcej niż inni, i skorzystał na tym.Trudno się jemu dziwić, mówią że pieniądze leżą na ulicy, [ faktycznie tak jest ]. Ale jak my o tym wiemy, to możemy nie dać się zmanipulować.I tak wróciliśmy do słowa \"WIEDZA\". Co możemy zrobić? Możemy propagować - wiedzę.I to wszystko, i to aż tyle.Pzdr.",
				"added": 1549403863
			}
		],
		"1549660645_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 36,
				"body": "Witam; Żebyś mógł zrobić kopię, tego co tam jest, ( upload ). To nadawca musi mieć włączonego swojego Pc-ta. Jak jest jedna wrzutka, i ten co wrzucił wyłączy, to skąd chcesz pobrać?żeby zadziałało to muszą być dodatkowo pobrane, i włączone Pc-ty. Podam przykład. Ja 1- Pc-et, wrzucam film 185-MB. Ja drugi Pc-et, Seeduję, iwtedy jest +89,94-MB.  Ja trzeci seeduję to znowu jest + malutka ilość. itd. - itd. Każdy następny jest mała ilość. Ale w moim przypadku; 3xPc-ty, = Cały film+ połowa. Jak ty chcesz pobrać to masz do dyspozycji, 1,5-filmu do pobrania, i zawsze możesz pobrać. Jeśli ty, pojedyncza osoba, Wrzucisz film, i masz włączonego Pc-ta. To jest do pobrania 100% tego filmu, Kopia jest tylko u ciebie. Dopiero następne dwie -trzy osoby sprawią że powstanie duplikat w 100%. I jak ktoś wtedy wyłączy swojego Pc-ta, to go zastąpi ktoś inny. W twoim przypadku ktoś wrzucił , i po 5-godzinach wyłączył. Ty masz tylko tytuł tego filmu, + dojście do niego. Wejdź na statystyki, np. JouTubePL. To zobaczysz tam jak to wygląda, Tytuł filmu - Ile procent weszło - Jaki duży jest ten film, 185-MB. Żółtego człowieczka + liczba 3.- Ile jest dodatkowo wgrane, 89.94-MB. I dalej zielona kropka, która może być cała, pół, albo pięć. To jest te dodatkowe zabezpieczenie. Jeśli jest dużo osób, to ludzik zmieni kolor na zielony. Wtedy praktycznie jest już na stałe ten film. Dlatego powtarzam cały czas, że seedowanie jest ważne. W twoim przypadku, to musisz złapać ten moment, jak gościu będzie miał włączonego Pc-ta. i wtedy pobierzesz. To tak na skróty. Są wątpliwości to pytaj. Jak to mówią. Koniec języka jest za przewodnika. Pozdr.",
				"added": 1549665760
			},
			{
				"comment_id": 37,
				"body": "Mozilla Firefox, Iceweasel. Tora nie używam, dla mnie to niema sensu. Oczywiście na tym etapie. Jak zajdzie potrzeba, to zacznę używać. Z tych wszystkich przeglądarek, to stary Iceweasel, mnie się \"podoba\". Wyższy poziom, to bez przeglądarki. Tylko po adresach, z terminala. Dystrybucja-Arch Linux. To co znam na dzisiaj. Do wszelkich nowości podchodzę ostrożnie. Nie wiadomo co tam siedzi?To jest pewnik. Dlatego stare wycofują, a na ich miejsce wchodzą spreparowane. Niby są ulepszone, ale to jest pojęcie względne. Pytanie? dla kogo są ulepszone? Tych powyżej linków, też nie mogę otworzyć, ani seedować.Pzdr.",
				"added": 1549736909
			},
			{
				"comment_id": 44,
				"body": "Zbyt mało wiem o Torze; Wiem tylko że mocno spowalnia, nie testowałem go pod tym kontem jeszcze. Mam na myśli ZeroNeta.",
				"added": 1549808139
			},
			{
				"comment_id": 46,
				"body": "Tutaj są potrzebne wnikliwe obserwacje. Jaki Firefoxs jest to chyba wszyscy wiemy, zresztą to wszystko ma tylne wejścia otwarte. To nie jest żadna tajemnica, dla tych co interesują się tematem. Dlatego niektóre dystrybucje mogą być celowo sabotowane; Nie każdy jest informatykiem, na takim poziomie aby to ocenić.W sumie chodzi o to abyś poszedł tą drogą, która została dla ciebie wybrana, przez firmę która ma w nagłówku trzy litery. \"CYTAT\"- Mowa jest srebrem, a milczenie złotem. Postaram się napisać więcej na ten temat. Co do J-T-PL to była awaria prądu. Napisałem o tym. Co do innych; to jest trudno to ocenić. Tylko komunikacja w czasie rzeczywistym może to trochę wyjaśnić. Nie bójmy się komunikować ze sobą. Pzdr.",
				"added": 1549813137
			},
			{
				"comment_id": 47,
				"body": "Ja też jestem kiepski w tych sprawach. Posługuje się tłumaczem, który mam zainstalowany równolegle. Jest to kiepskie rozwiązanie, ale zawsze to coś. Jak będziesz czytał i tłumaczył; to zaczniesz pomału rozumieć o co chodzi. W moim przypadku nauka anglika nie wchodzi w rachubę. Postawiłem na innego konia w tej gonitwie. Ale póki co to muszę korzystać z tłumaczenia. Czy używasz Linuxa? Jakiego? Ja używam Debian-8. KDE. Dlaczego? Bo jest optymalnie niezależny. Wszystkie dystrybucje przejrzałem, i ten - ta wypadła najlepiej ze wszystkich. Nie chodzi o wygląd. A o predyspozycje. Pzdr.",
				"added": 1549813816
			},
			{
				"comment_id": 49,
				"body": "Trzy filmy, tu i tu są wrzucone. Do tego + dwa Pc-ty, które seedują. Razem trzy sztuki. Każdy z filmów powinien mieć zrobione trzy razy, jakby nie liczyć. Jeśli jest inaczej to zgłoście. Pzdr.",
				"added": 1549820893
			},
			{
				"comment_id": 50,
				"body": "Pierwszy wynalazłem na Rosyjskiej stronie; Co do Rosjan to są to pomysłowi ludzie.Zaintrygowało mnie to blokowanie i przekierowanie sygnału. Tak więc , jak długo nie udowodnię że to nie działa, to jest dla mnie możliwe. Jest to jeden z nurtów zainteresowania mojego, tego typu sprawami. Uznałem więc że warto zapytać większej grupy ludzi co o tym sadzi? Co ciekawe, zajmują się tym biedne kraję gospodarczo. Myślę że nie jest im w głowie prima aprilis. Z tego co już obejrzałem, to jest powiedziane, że na karcie musi być co najmniej jeden MG-transferu. Także ostrzegają przed przegrzaniem w czasie lutowania.Oraz blokowanie niektórych pinów od kontaktu i przewodzenia prądu.Jak sprawdzę, to będę wiedział, czy to jest możliwe czy nie. Biorę jeszcze pod uwagę  niezrozumienie niektórych słów. Oni mogą myśleć o czym innym, a ja myślę też o czym innym.Potraktujcie to jako ciekawostkę, którą warto by było sprawdzić. Najwyżej będziecie mogli się śmiać ze mnie. Jak to mówią \"śmiech to zdrowie\" .Oraz drugie powiedzenie- \"kto ryzykuje ten w kozie nie siedzi\".Pozdr.",
				"added": 1549828905
			},
			{
				"comment_id": 52,
				"body": "Filmy są działają, otwierają się, są seedowane, tym razem bez problemu.  jest 2,00-godz. Aby usunąć film; To musisz wejść na \"Mój kanał\" przy tytule jest ołówek.naciskasz, i otwiera się zapisz, delete, anuluj. A mój kanał jest tam gdzie , główna, na czasie, zobacz nowe, mój kanał. Dobrze jest jeszcze jak, skasujesz w statystykach, na początku jest kwadracik, można tam przyczepić, odczepić, usunąć. Wtedy jest komplet. Czy wiesz co było przyczyną tej awarii? Pzdr.",
				"added": 1549846712
			}
		],
		"1549577465_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 38,
				"body": "Więc korzystajmy, dopóki się da. Czasu pozostało mało. Szykują się do wojny 100%. Przybliżony czas zaczęcia Kwiecień. A przy okazji szukajmy nowych rozwiązań. Na Rosji znalazłem pomysłowego Dobromira? Do karty mobilnego internetu; przylutował kabeki. I internet śmiga. Trzeba rozgryźć o co tam chodzi? Czy to jest żart? Chociaż ja nie sądzę.Karta na kabelkach, + wtyczka USB. Pc-et chodzi, laptop też.\nWrzucę ten filmik na J-T-PL. Pzdr.",
				"added": 1549737331
			},
			{
				"comment_id": 40,
				"body": "Przypomniałem sobie o pewnej ciekawostce; Dotyczy naszego internetu. A tutaj link do tego.\nhttps://sekurak.pl/szwedzka-policja-zada-konca-anonimowego-internetu-kazdy-obywatel-mialby-miec-cyfrowe-id/?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+Sekurak+%28Sekurak%29\nTo jest Szwecja, a do nas to jak kamieniem rzucić. Pzdr.",
				"added": 1549738496
			},
			{
				"comment_id": 41,
				"body": "Filmik; Kabelki do karty SIM- \n2019.02.08.02.[PL]-Technika-Internet-Jak uzyskać darmowy Internet.karta SIM-[12min]-.mp4",
				"added": 1549740461
			},
			{
				"comment_id": 43,
				"body": "Spróbuj ponownie, miałem awarię prądu. UPS- nie wytrzymał tyle czasu, pomimo że dwa duże akumulatory ma zainstalowane. To były godziny.Awaria trwała jakieś 8godz. Film nie był przez nikogo seedowany. Więc prawdopodobnie dlatego nie mogłeś pobrać .Teraz już wszystko działa. Pzdr.",
				"added": 1549807943
			},
			{
				"comment_id": 45,
				"body": "Daj znać czy już działa, a jak nie to zrobię reset.",
				"added": 1549808481
			},
			{
				"comment_id": 48,
				"body": "2019.02.08.01.[PL]-Technika-\n2019.02.08.02.[PL]-Technika-\n2019.02.08.03.[PL]-Technika-\nJest trzy, mam do opracowania następne, które muszę zweryfikować i opisać. A co do strony i sieci  to trzeba to w końcu rozpracować. Najwyższy czas zrobić z tym porządek. Pzdr.",
				"added": 1549818589
			},
			{
				"comment_id": 51,
				"body": "Zapisano; obejrzymy, osądzimy, napiszemy recenzję. A tak w ogóle, To stare wino jest lepsze od najnowszego wina. Tak jest również z pomysłami, pierwszym samochodem; był samochód elektryczny. W czasie pierwszej wojny światowej, tych elektrycznych było więcej niż na benzynę. To amerykanie zwietrzyli interes na ropie, i wykupili niektóre firmy elektryczne, tramwaje, samochody a następnie je skasowali. To taka ciekawostka historyczna. Elektryczny Tesla, \" auto\" też już bankrutuje. Z jakich przyczyn? Na to pytanie należy sobie samemu odpowiedzieć. I tak jest z wieloma wynalazkami. Ludzkość to stado baranów idące do rzeźni, pod dyktando zarządzających. Pozdr.",
				"added": 1549829663
			},
			{
				"comment_id": 53,
				"body": "Nie zwariowałeś. Informacji w zasadzie to nigdzie niema. I nie będzie. Tą wiedzę to trzeba wypracować samemu. Jak masz znajomego co bierze w tym udział? to on przy piwie tobie wytłumaczy. O tym nikt nie chce rozmawiać, względy bezpieczeństwa. A siedem poziomów, to trochę, gruba przesada. Fantazja. Chyba że działy zaliczasz do poziomów. Działów to jest na pewno siedem.A górny internet też się dzieli. Jest góra przedszkole.To co na powierzchni. Powierzchnie też można podzielić, szukanie z wyszukiwarką. I dotarcie po adresach, które masz, posiadasz. Na dole niema wyszukiwarki. Tylko adresy. A adresy zdobywasz od znajomych. Krótka jazda. I na dole obowiązuje poręczenie.  Znajomy znajomego. Inaczej nikt z tobą nie będzie gadał.Nie odkrywam tutaj ameryki, o tym wszyscy wiedzą. Chcesz się dostać tam. To szukaj znajomego, on ciebie wprowadzi na salony. A zeroNet - pozwala tylko wrzucać jakieś filmy, które cenzura gdzie indziej usunęła. Więcej do niczego się nie nadaje. Jest to rozgłośnia radia ameryka na chiny. Zobacz kto tam urzęduje, i jakie są tematy. Pzdr.",
				"added": 1549848104
			}
		],
		"1549713517_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": [
			{
				"comment_id": 39,
				"body": "Wiem tylko tyle że trzeba ręcznie to zrobić. Instrukcja jest opisie, ZeroNetu. Czytałem, i tylko tyle na ten temat mogę w tej chwili powiedzieć.",
				"added": 1549737484
			},
			{
				"comment_id": 42,
				"body": "Zaszło nieporozumienie; Zapytałeś jak usunąć swoją stronę?Ja to rozumiem że stworzyłeś swoją stronę, i chcesz ją usunąć. Ja też coś takiego zrobiłem,w ZeroSites, utworzyłem nową prywatną stronę i dodałem do panelu. Usunięcie tej nowej strony wymaga ingerencji , i ręcznej likwidacji. To jest jedno.\nA usunięcie ze spisu stron to drugie. Ze spisu nie likwidujesz strony tylko ją , jakby przerzucasz na magazyn z powrotem, gdzie ona dalej istnieje.Tylko jej nie masz w tym spisie. Ja źle zrozumiałem zapytanie. I tak wyszło całe nieporozumienie.Pzdr.",
				"added": 1549807628
			}
		],
		"1545931437_1CcKmMy8KEvx5xebrTsNCiTRggND1MYF1G": [
			{
				"comment_id": 54,
				"body": "Witam; Wszystko działa ( chyba ), otworzyłem i jest. A teraz poczytam wszystko po kolei. Trochę tekstu jest, a że to jest instrukcja, to muszę się skupić. A głowa moja dzisiaj jest lekko na urlopie. Jak się zapoznam, to dam znać.Najważniejsze ze jest i działa. Pzdr.",
				"added": 1550356468
			}
		],
		"1550374869_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 55,
				"body": "Słuszna racja; Nie chciałem robić poprawek.Jak już wrzuciłem, to się zreflektowałem, ale już poszło. Zbyt wiele nie potrzebnych słów. W tym tekście . Pozdr.",
				"added": 1550489179
			},
			{
				"comment_id": 56,
				"body": "Dzięki za informację, podpowiedź. Prawdę mówiąc; nie próbowałem jeszcze tego robić, + pośpiech = głupota. Ale teraz zobaczę jak to funkcjonuje. I nie jest wykluczona poprawka. Kiedyś trzeba byka wziąć  za rogi. Jestem trochę zagoniony i przemęczony, mało snu od dwóch miesięcy. Padam na ryj, dosłownie. Popzdr.",
				"added": 1550514561
			}
		],
		"1550690083_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 57,
				"body": "Witam; w tym miejscu zamiast mojego adresu, ( nie jest anonimowy ). Wyświetla się tytuł artykułu , który zamierzałem opublikować. Zmiana adresu switch-em też nic nie daje.  skąd się wziął ten tytuł, to nie mam pojęcia. On sam się zainstalował. Po prostu nastąpiła zamiana, mój adres na tytuł art. Sprawdzę czy nie mam go zapisanego.Dzięki na razie.",
				"added": 1550710502
			},
			{
				"comment_id": 58,
				"body": "Witam; Jak można usunąć, \"Zero Polska\". W komunikacie pokazuje że trzeba to zrobić ręcznie. Chcę usunąć, i ponownie zainstalować. Tam gdzie jest mój adres, pokazuje cały czas że szuka. Kręcące się kółeczko. Brak dostępu. Wszystko zablokowane. Dziękuję.",
				"added": 1550827577
			},
			{
				"comment_id": 59,
				"body": "Witam; Znalazłem, usunąłem,ZeroPolska -  dodatkowo PLNcluster, też usunąłem. Wszystko znikło. Ale po ponownej instalacji, poprzedni stan powrócił; Czyli zamiast mojego adresu, jest kręcące się kółeczko; Które szuka adresu, i nie może go znaleźć. Jakieś pomysły, na rozwiązanie tego problemu. Żeby przywrócić poprzedni stan. Żeby odblokować, i było można używać - ZeroPolska-. Usunięcie, i wgranie nic nie dało. Żadnych rezultatów. Za tą poradę wielkie dzięki, na przyszłość będę już wiedział, jak to zrobić.",
				"added": 1550875025
			},
			{
				"comment_id": 60,
				"body": "Dzięki;  Będę próbował, tak zrobić. Przecież to nic nie kosztuje. A przy okazji czegoś się nauczę. Jeszcze raz dzięki. Dam znać jak poszła instalacja. Pozdr.",
				"added": 1550886829
			},
			{
				"comment_id": 61,
				"body": "Witam; Wielkie dzięki. Mam zapisane, mam wydrukowane, będę próbował to zrobić. Dam znać co z tego wynikło. Jeszcze raz dzięki i pozdr.",
				"added": 1551044741
			},
			{
				"comment_id": 62,
				"body": "Witam; Niestety, to nie jest mój poziom. Chętnie bym pomógł, czas i chęci są. Ale jest brak umiejętności. I tego od tak nie przeskoczę. Moja wiedza jest wybiórcza, uczyłem się tylko tego, co było mnie w tej chwili potrzebne. Niestety. Przykro mi. Pozdr.",
				"added": 1551643717
			}
		],
		"1551813352_17UY7McN5WAMD6dqnxLCFBwHYLXY9HmDuV": [
			{
				"comment_id": 63,
				"body": "Witam; na czym polega ten test?",
				"added": 1551820775
			},
			{
				"comment_id": 65,
				"body": "Bardzo słuszne rozwiązanie, jestem \"ZA\".",
				"added": 1551882585
			}
		],
		"1551113397_1At298vUijuhjA2GtqXEydC8csRnhETzdH": [
			{
				"comment_id": 64,
				"body": "Witam; Niestety ale chyba każdy to ma. Skasowałem i są z powrotem. To jest chyba, ta zła strona, tego niezatapialnego lotniskowca. Pzdr.",
				"added": 1551882499
			}
		],
		"1552779363_19mLKVaQ1tZmZcKnmfPhrAHXK5aqeTDzg1": [
			{
				"comment_id": 66,
				"body": "Witam; Cześć pierwsza się nie otwiera.    Część trzecia się nie otwiera.\n Część druga działa poprawnie. Pozdr.",
				"added": 1552780514
			}
		],
		"1552737596_1Gr9aFEWAUK46TMkEQ8diA7BmnTcWL4MXK": [
			{
				"comment_id": 67,
				"body": "Normalni ludzie to chyba nie dadzą rady wejść do -0net-u. Dlaczego? próbowałem reklamować, i dla niektórych to są za wysokie progi. Albo mają za niski poziom inteligencji. Oni umieją obsługiwać tylko pejs-zbuka. Na tym poziomie kończą się ich możliwości, obsługi Pc-ta.",
				"added": 1553193633
			},
			{
				"comment_id": 68,
				"body": "Nigdy się nie uważałem za boga; zależy mnie żeby 0net był popularny, żeby było tutaj dużo ludzi. Jest to miejsce gdzie każdy powinien móc wyrazić swoją opinie, pomijając przy tym- CENZURĘ- jaka ona by nie była. A odpisuję bo tak mnie nauczono. Na dzień dobry, zawsze odpowiadam - dzień dobry. Pozdrawiam, i nie przeszkadzam.",
				"added": 1553209896
			},
			{
				"comment_id": 69,
				"body": "Dzięki; przekażę znajomemu, żeby sprawdził czy u niego zadziała? On ma problemy z obsługą- 0neta.",
				"added": 1553287089
			}
		],
		"1553264555_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 70,
				"body": "Witam; I zarazem popieram, bardzo dobry pomysł. Dobrze by było, żeby się przyjął. Pozdr.",
				"added": 1553288194
			}
		],
		"1553289965_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 71,
				"body": "Witam; Jest pytanie jest odpowiedź. Może tak po kolei. Zostało założone coś takiego jak, ZeroPolska po Polsku. Myślę sobie jest wspaniale, można publikować teksty, bez większych ograniczeń. Wrzuciłem jeden artykuł,  drugi.\nPrzy trzecim system się zawiesił. Ot taki sobie przypadek. Próba obejścia tego skończyła się unieruchomieniem całości. Też przypadek, albo brak mojej umiejętności obsługi . Wszelkie próby spełzły na niczym, skończyło się tym , że tytuł artykułu zainstalował się tam gdzie powinien być autor. Oczywiście artykuł się nie zainstalował. Myślę sobie , zacznę od nowa. Czyli wszedłem na Voat i  zrobiłem nowy pod rozdział, - Zero po Polsku. Jeden artykuł, drugi , trzeci, i stop orkiestra szwagra biją. Jest tytuł, a nie ma treści. Następny był taki byle jaki, i został przyjęty. Idąc za ciosem , próbowałem już normalny porządny i konkretny artykuł wrzucić; I znowu tytuł jest reszty nie ma. A dzisiaj sprawdzam; to nawet nie ma tego już podrozdziału. Pozostały tylko tytuły bez treści. Co zresztą nikomu nic z tego nie przyjdzie. Ale artykuły były ciekawe. Podaję tytuły. Jak długo ten text się utrzyma, to tego nie wiem?\n2019.03.22.01.[PL]-Polityka-13-RODZIN-rządzi światem.      Brak-tekstu\n2019.02.20.01.[PL]-text-Historia-Gestapo-NKWD-                  brak -tekstu\n2019.03.14.05.[PL]-text-Kościół-Judaizm,globalizm.\n2019.03.13.01.[Pl]-text-Polityka-Amerykański przemyt broni do Wenezueli.\n2019.03.09.01.[PL]-Polityczne-Agenci-SB-na stanowiskach publicznych.  -text-umieśiłem w komentarzach, pierwsza próba obejścia. Tej dziwnej sytuacji. Czyli jest tytuł, brak tekstu. A ja ten tekst wkleiłem do komentarza, no i poszło. \n2019.03.04.01.[PL]-Polityka-Człowiek-Cywilizacja jako hodowla ludzi cz.02.\n2019.03.02.01.[PL]-Polityka-Człowiek-Cywilizacja jako hodowla ludzi.cz-01\n2019.02.26.01.[PL]- Kurewski Kościół katolicki.\n\nCałość została przerzucona głęboko do tyłu. Udało mnie się właśnie odszukać. Ale ktoś kto jest pierwszy raz , to nie ma szans. Ale co tam. Pytanie? Jeden text idzie? A już inny , który próbuję wrzucić za pięć minut, zostaje wycięty.\nA przy pierwszym, jest napis,-404-FILE NOT FOUND.\nJak to wszystko mam rozumieć? Dla mnie to jest cenzura, albo mowa nienawiści.\nPozdrawiam; Przeczytajcie, i dajcie znać na ten temat.",
				"added": 1553447838
			},
			{
				"comment_id": 72,
				"body": "Witam; dzięki za ponowne wyjaśnienie. To może być bardzo prawdopodobne. Właściciel jest po angielsku; A język polski jest - zbędny. Jak dla mnie chiński. Przeprowadzę test, i spróbuję coś wrzucić po angielsku? Czy przyjmie, czy też odrzuci. \nA co do YouTube PL. To niema tam żadnej blokady. Przynajmniej ja nie wiem nic na ten temat. Filmy wrzucam bez problemu. U mnie są i otwierają się. A co do komunikatu.- Po wrzuceniu filmu pojawia mi się komunikat \"Content published to 0/5 peers\" a za chwile \"Content publish failed.\" Spotkałem się z tym gdzie indziej, i skutkuje to tym że nie wgrywa się. Musi być 4/4 albo 5/5. Wtedy jest OK. Takie coś się zdarza w różnych dziwnych godzinach, Kiedy jest mało peer-ów. Ja sobie radziłem z tym w ten sposób, że w innych godzinach powtórnie wrzucałem kopię tych materiałów. Zazwyczaj skutkowało pozytywnie, i wgrywało się. Ogólną bolączką jest mała ilość włączonych komputerów na stałe, przez cały czas. To one zapewniają seedowanie. Ja mam cały czas włączone dwa kompy, a w godzinach szczytu włączam trzeci. Są one włączone 24-godz na dobę i 7-dni w tygodniu. To powinno zapewnić odpowiednią ilość peer-ów. Jeśli coś można zobaczyć, - sprawdzić w ustawieniach; To proszę o podpowiedź na ten temat. Ja jestem noga w tych sprawach. Druga sprawa, zauważyłem że niektóre filmy wrzucane przez kogoś, ja nie mogę seedować, i nie mogę oglądać. Próba poinformowania o tym wrzucającego, jakoś nie wypaliła. Chodziło o to żeby powtórnie zrobił duplikat, wtedy jeden film nakłada się na drugi. I zostaje uzupełniony. Ten patent działał do tej pory dobrze. Jeśli ktoś coś wie w tym temacie, to proszę o podpowiedź. A ja spróbuję poprawić. Mam pytanie? Czy moje filmy, można oglądać? Czy też są z nimi jakieś kłopoty? U mnie wszystko działa.Dzięki za uwagi;Pozdrawiam.",
				"added": 1553469437
			},
			{
				"comment_id": 74,
				"body": "\"Jeszcze tego nie sprawdzałem, ale powinno się upublicznić samoczynnie, gdy oba komputery będą online. Jeśli nie, można zrobić to ręcznie.\"Sprawdzałem; Tak się robi, ale bardzo słabo,( brak użytkowników ) przypuszczalnie,ale trzeba zainicjować seedowanie. Bez zainicjowania samo nie startuje.  Trwa to bardzo długo, wychodzi-1% -3%- i tak dalej. Najlepiej robić to w godzinach szczytu; kiedy jest więcej użytkowników, ( taka moja uwaga ). Jedno mnie zastanawia, mam włączone dwie sztuki, ale nie pracuję na nich, czy one obsługują, czy się usypiają i nie obsługują a są tylko włączone?   Jakaś wiedza w tym temacie? Ktoś coś wie? Druga sprawa to co jest wrzucone, to ja nie mogę seedować, sprawdzałem o różnych porach dnia i nocy. Ale to jest prawdopodobnie brak połączenia pomiędzy nami. Jedyna rada być upartym. Pozdrawiam.",
				"added": 1553526300
			},
			{
				"comment_id": 78,
				"body": "Ja nie mam Tora, ani ustawionego portu. U mnie działa. Może winę ponosi za to Tor-? Co na to inni znawcy tematu? Tor- chodzi swoimi ścieżkami, ja podejrzewam, że to ma związek. Brak peer-ów, jest na pewno przyczyną , czyli giną gdzieś po drodze. A na innych stronach próbowałaś, czy można wgrać?Czy to tylko przypadłość -YouTube PL- A może spróbuj na ZeroUp-ie. Albo na Kopykat. Wrzuć coś małego i sprawdź, czy przyjmie.\n\"Rozumiem, że nie działa to w czasie rzeczywistym,\" - Raczej działa w czasie rzeczywistym; Jak robię upload -to pokazuje się licznik szybkości,w prawym rogu zaraz wyświetla się ile na ile peer-ów. [ 5/5 ]. A pod spodem Finisz. Naciskam i jest akcja zakończona, całość zajmuje jedną minutę. Ale jest coś takiego jak trudne godziny, i wtedy peer-y , pokazują - 2/5- . Wtedy niestety muszę ponownie wgrać. Pytanie? Co inni wiedzą na ten temat? Prosimy o wypowiedź, podpowiedź, sam jestem ciekawy co jest tego przyczyną.Pozdr.",
				"added": 1553644345
			},
			{
				"comment_id": 79,
				"body": "Zapomniałem zapytać; Na jakim poziomie masz? Trackers-y. Ja w tej chwili mam - 13/15 -\nTo jest tam gdzie - Port: - - Tor: - - Trackers:",
				"added": 1553645279
			},
			{
				"comment_id": 80,
				"body": "Witam; Z tego co widzę to masz dużo lepsze wyniki od moich. 16/18- to ja nigdy nie miałem. No dobra; o co by tu się jeszcze można by było przyczepić? Synchronizacja zegara? Ale zapewne jest dobra, bo by wyrzuciło komunikat, żeby zsynchronizować zegar. Czyli odpada. Jeszcze przychodzi mnie do głowy, aby na próbę wyłączyć Tora; I zobaczyć co się będzie działo? Jeśli za działa, to winien Tor. Jeśli nie, to trzeba szukać dalej. Szkoda że nikt nie chce zabrać głosu na ten temat. Zawsze to, jak jest parę głów to nie jedna. Z ostatniej chwili, pytanie: Czy działa poczta?,ZeroMail.albo czat – ZeroChatIRC.\nCzy była próba ; test na wrzucenie czegoś na inną stronę? Na przykład – ZeroUp.\nAlbo , KopyKate. Spróbuj, Jeśli tam pójdzie, To wtedy jest wina gdzieś tutaj. A jeśli nie, to jest gdzie indziej trzeba szukać. Chwilowo ,to wszystko co wymyśliłem . Przeprowadź test; A następnie odłącz Tora. Daj znać jakie są efekty. Pozdrawiam.",
				"added": 1553698404
			},
			{
				"comment_id": 82,
				"body": "Uff; To bardzo dobrze, że udało się problem rozwiązać. A swoją drogą dlaczego wystąpił problem z adresem???\nDlaczego był niewłaściwy, Co poszło nie tak i dlaczego. Wiele pytań. A odpowiedzi brak, tak na przyszłość. Pozdrawiam.",
				"added": 1553699543
			},
			{
				"comment_id": 83,
				"body": "Hip-Hip hura.",
				"added": 1553700355
			}
		],
		"1553622843_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 76,
				"body": "Bardzo słuszna uwaga; Ale żeby to osiągnąć, to jest potrzebny spory zbiór właściwych ludzi. Czyli tacy hobbyści, którzy czymś się interesują profesjonalnie. Te osoby stworzą bazę właściwych tematów. Dopiero wtedy przyjdą tłumy. I wszystko zacznie się kręcić samoistnie. Według mnie też może to być \"Wiki\". Co na to inni uczestnicy?Jakie mają zdanie?A może inne propozycję, konkurs został otwarty. A nagrodą będzie zaszczytne miejsce - wynalazcy. Prekursora rozwoju - ZeroNetu -. Czekamy na dalsze propozycje - śmiało. Pozdrawiam.",
				"added": 1553641818
			},
			{
				"comment_id": 88,
				"body": "Słuszna uwaga; Fałszywe tożsamości, co one dają? Tak naprawdę to jest taka ułuda, że jestem nie rozpoznany. Trzeba zacząć wcześniej, Od momentu włączenia -  Pc-ta. W tym momencie następuje weryfikacja delikwenta na 18- sposobów, tyle się doliczyłem. Być może że jest tego więcej. Więc zmiana tożsamości jest w tym momencie bardzo śmieszna. Jak zapali się ekran, to zostałeś zweryfikowany na 18-sposobów. Możesz napisać , że jesteś z marsa; a oni i tak wiedzą że jesteś; Jasio Kowalski, O tym mówi twój komputer. Twoja poczta, a konkretnie pośrednik-poczta. Twoje loginy, twoje tajne hasła, twój sposób pisania, twój sposób wyrażania myśli. Są to programy które cały czas weryfikują sytuację. Dołóż do tego twój magazyn, na którym przechowujesz różne śmieci, w nadziei, że się kiedyś to przyda do czegoś. Jesteś jak przystawka podana, podany, na talerzu. Piszesz o nawykach; i bardzo słusznie, to też jest kluczowy problem. Złe nawyki, nie jednego zgubiły. Na ten temat można napisać książkę.Zapamiętajcie raz na zawsze; ani cebula, ani tor, ani mocne hasło, ani cokolwiek innego nic wam nie pomoże, jeśli na samym początku leży wasza wizytówka z waszą tożsamością. Jest to wszystko na samym początku , jak włączacie komputer. Do tego dodaj pośrednik internetu, to też jest droga do ciebie. Jest tego tak wiele, ze głowa jest mała. Trochę znam temat, jeśli jest zainteresowanie tym tematem? To mogę coś niecoś napisać w tym temacie, prawdopodobnie nie będzie to wszystko co nas może spotkać na tym podłym świecie. Ale zawsze to będzie dobry początek, zresztą bardzo ważny, w tym momencie, i na dzień dzisiejszy, totalnej inwigilacji. Pozdr.",
				"added": 1554296344
			},
			{
				"comment_id": 90,
				"body": "Wszystko się zgadza co piszesz. Ja bym dodał do tego jeszcze, utrudnić maksymalnie jak się da. Po prostu niech zarobią na swoją wypłatę. Czyli jesteśmy znowu na początku naszej wyprawy w dalekie kraje, wolne i niezależne. Zadam pytanie; ile kosztuje używany laptop - Pc-et.? Naprawdę niewiele, ( 200 - 300zł ), on ma służyć do komunikacji, w przestworzach. Wymieniamy twardy dysk, na jakiś bardzo mały. Używany mały dysk kosztuje 50zł. Lepiej jak jest SSD, - jest szybszy, ( jest to zaleta ). Dodatkowo zwiększamy pamięć Ram. Maksymalnie ile się da. Dlaczego? Bo będziemy na niej pracowali, musi ona pomieścić na przykład cały film w całości. Na twardym dysku instalujemy jakąś bezpieczna dystrybucję, na przykład; Arch Linux. Jest to produkt, który od dnia powstania, ( dawno to temu było ), nie zmienił swojej substancji. Dlaczego? Bo jest ona doskonała, i niema co tam zmieniać. Można użyć też innej dystrybucji, tylko musi być ogołocona z zbędnego balastu. Wszystko to co jest nie potrzebne idzie precz. Nie mamy tutaj poczty, ani innych fiki-miki. Dobrze jest wybrać Pc-ta, takiego który ma starą płytę, chodzi o to żeby nie było , \"UEFI\". Jeśli już jest to wyłączamy to gówno, ( pod warunkiem że można to zrobić ), oczywiście niema żadnej gwarancji, że wyłączenie zadziała. Dlatego staramy się, żeby tego nie było. Twardy dysk zostaje zablokowany, jest potrzebny tylko do startu, ewentualnie, dodatkowy jakiś program wspomagający. Realnie pracujemy tylko na Ram-ie. Ma to tą zaletę, że w chwili wyłączenia wszystko się kasuje. Mały twardy dysk ma tą zaletę, że łatwo można go i szybko nadpisać. tak w razie czego, dopiero nadpisanie likwiduje zaległości. Zaleta, nie do pogardzenia. Pc-et, zawsze musi być czysty, czyli pusty, dosłownie i w przenośni. Wymuszone hasła to jest , jedna jedynka albo dwie. Jak umiemy to też te badziewie można wykluczyć. Hasło jest artykułem, który służy do sprawdzenia tożsamości.( twojej ). Sprzęt używany kupiony na Alegro, kto go kiedyś miał? Dobre pytanie, na które niema odpowiedzi. W tym momencie, można już w zasadzie zacząć używać, w miarę bezpiecznie. Ale pozostają jeszcze takie detale jak, szyfrowanie, oraz decentralizacja, która powoduje pewną niezależność. Tutaj są już potrzebne troszkę umiejętności, oczywiście można ich się nauczyć. W myśl zasady; dla chcącego nic trudnego. Ważne - Terminal, jest dobrze mieć go opanowany, zakładam, ze każdy coś tam na nim wystuka. Zapomniałem, wróć do samego początku, Patrycje; One powodują ograniczenie dostępu , do dysku..\nOczywiście może być cebula, tor, i co tam jeszcze chcecie. Znowu mnie z pamięci uciekło; \"przeglądarka\", musi być bezpieczna, jeżeli jej używacie? Terminal eliminuje tą przypadłość. Jest coś takiego jak - konqueror. Jest sprawdzony, i jest bez wodotrysków. Może być też co innego. Aby tylko nie od mikrosoftu. Wszystko z stamtąd jest nastawione na inwigilację. Można zacząć podróż. Jest to spore utrudnienie dla przeciwnika. Ale nie nie do złamania. Dokładamy do tego dobre nawyki, ZAWSZE- sprzątamy zaraz po sobie, nie odkładamy do jutra. Być może o czymś zapomniałem, jak ktoś wie to niech dołoży swoją cegiełkę, w rozwój niezależności na tym padole łez. Pozdr.\nNo tak internet; ale to jest już osobny temat, może przy okazji?",
				"added": 1554329946
			},
			{
				"comment_id": 91,
				"body": "Witam; To co napisałem to jest przedszkole, albo jeszcze wcześniej. Jest nauka, która pochodzi ze szkoły, i jest wiedza praktyczna. Obie bardzo się różnią, jak bardzo? Dobre pytanie, na które trudno jest znaleźć odpowiedź. To praktyka i czas i chęć poznania nowego, czyni z człowieka mistrza. Całe życie się uczymy, pytanie? A czy mądrzejsi umieramy? Chyba nie. Jak przyciągnąć nowych? Każdy sposób jest dobry, ciekawe opowiadanie, ciekawy interesujący temat, ciekawa dyskusja, pomoc w instalacji nowej dystrybucji, porada jak pokonać jakąś przeszkodę, życzliwość, której dzisiaj jest mało. Jeśli ktoś to przeczytał do końca, to już jest jakiś malutki sukces. Czy to co napisałem jest prawdą, czy to tylko takie bajdurzenie? Człowiek po studiach informatycznych; wie to co go nauczyli inni. Na pewno jest to nie mało. Ale nie każdy kończy informatykę. Są tacy co mają tylko podstawówkę, a co z nimi? a ci po zawodówce? Często są to ludzie inteligentni, którzy chętnie czegoś się nauczą. Czy mamy im zaserwować papkę z cenzurowanego internetu? Niech poznają dwie strony tego medalu. Bo ten medal ma dwie strony. W naszym zdobywaniu wiedzy, słowo \"wiara\"- powinno zostać raz na zawsze wykreślone. Po prostu przeprowadzamy eksperyment, sprawdzamy, i wtedy \"WIEMY\"- i to w tym momencie jest już naszą wiedzą, podpartą faktami. Nie chciałbym namawiać do jakiś eksperymentów na drogim sprzęcie, ale już na takim starym złomie? Możemy go ujeżdżać do woli. Możemy instalować wszystko i nic, to tylko zależy od naszej wyłącznie fantazji. Możemy testować do woli i bez ograniczeń. A jeżeli pójdzie z dymem? to przecież, jest nie tak wielka strata. Łatwiej ją przeżyć. A teraz opowiem taki przypadek, filmik, z You-Tube. Autentyk; Chłopak lat 12 - 15. trudno określić. Dostał od rodziców nowy telefon odporny na upuszczenie, uderzenie. Bo swój stary zdewastował wcześniej. Telefon nowiutki - widać to. Wiec wziął włączył kamerę, do ręki pół kilowy młotek, i nagrywa; Demonstracja odporności telefonu na uderzenie. Nawet nie powiem, dwa uderzenia wytrzymał, ale trzeciego już nie. Trzeba było widzieć minę tego chłopaka. Sama myśl co powie rodzicom, że nowy telefon już nie działa. Od taki przerywnik z humorem, ( czarnym ). Wracając do tematu; ja się uczyłem, i mam tylko używany sprzęt. Co prawda jest on kupiony nie w tym kraju. Jest dobry, markowy, jest tani. Co ja z nim wyprawiałem? to głowa mała. A skutek, coś się nauczyłem. Autentycznie.\nPoprzednio wspomniałem o internecie; trochę przemyślałem, niestety nie udzielę wskazówek co do niego. Powód, to nie jest temat do publicznej rozmowy. Musicie płacić i korzystać z monopolu. Takie czasy. Mowa jest srebrem a milczenie złotem. Jak macie jakieś pytania, uwagi, chętnie odpowiem, pod jednym warunkiem, że będę wiedział. Pozdr.",
				"added": 1554408883
			},
			{
				"comment_id": 93,
				"body": "I to jest to, co się może przydać innym. Jeśli wszyscy zaczną się wymieniać wiedzą; Każdy coś tam dorzuci od siebie. To wszyscy wejdziemy na sam szczyt wiedzy. Będziemy mądrzejsi, będziemy lepsi. Pozdr.",
				"added": 1554421428
			},
			{
				"comment_id": 106,
				"body": "Witam; do  -  @moris  - Nie można twoich filmów sedować na YouTubePL.  Pytanie? Czy masz wyłączonego kompa? i dlatego nie można? Czy pliki są uszkodzone? taki komunikat się pokazuje, ale to może być zmyłka.\nnapisz na pocztę:  tomasz21@zeroid.bit",
				"added": 1556438176
			},
			{
				"comment_id": 120,
				"body": "Witam; Trochę upłynęło czasu, trochę zmieniło się w naszym życiu. Niektórzy już odeszli na zawsze. To nie jest przypadek. \"YouTubePL\" - jakoś tam trwa. Lepiej albo gorzej. Mam takie nieodparte wrażenie, że coś przeszkadza nam się rozwijać. Przez parę miesięcy brak było wpisów po polsku; Dlaczego? Wiecie co, śmiesznie to wygląda jak dwóch polaków rozmawia po angielsku. Zapamiętajcie, nasz język jest trudny dla okupanta. Zawsze tak było, i tak będzie; Dlatego próbuje nas się przestawić na angielski. To oni muszą się nauczyć polskiego. Jeśli chcą wiedzieć o czym rozmawiamy? Ja mogę zrozumieć: jakaś instrukcja została napisana po angielsku, i my musimy ją przeczytać, bo to jest nam potrzebne. To wszystko, i aż wszystko. Między sobą rozmawiajmy po polsku. Taka moja uwaga do tego tematu, ( nasz język porozumiewania się ).\nSeedowanie, to tylko jeden z problemów, o którym trzeba pamiętać. Spróbujmy zwrócić uwagę na śmieci które są tutaj wrzucane? Co mam na myśli? Chciałbym, aby tutaj można było znaleźć artykuły, i filmy wartościowe dla naszych następców, żeby to była taka wartość dodana, która wnosi coś w nasze życie. Coś nas uczy, jakąś myśl przekazuje, coś co nie można znaleźć w tamtym zafajdanym internecie. Ktoś może powiedzieć; wielkie słowa.\nCzy one są wielkie? czy też nie, ale chodzi o zrozumienie tego przekazu, \"Jesteśmy niszczeni z premedytacją\"\nWprowadzono, Acta-2; Jaki jest tego efekt? Mnóstwo stron zniknęło, wiele ciekawych artykułów poszło w niepamięć. Założone blokady na kopiowanie, śledzenie na każdym kroku, kto z kim rozmawia i o czym?\nTo się nasila, i będzie jeszcze gorzej; Ja uprzedzałem, ostrzegałem, i nic to nie dało. Ludzie którzy pisali ciekawe rzeczy, - dzisiaj już niemożna do nich , w żaden sposób dotrzeć. Zniknęli, zginęli, zaginęli bezpowrotnie.\nNie czas płakać nad rozlanym mlekiem, ale czas pomyśleć co jeszcze można dzisiaj zrobić? Jak temu zaradzić? Chodzi też o wartościowe przekazy z internetu, żeby je móc powielić skopiować, przekazać innym.\nTamten internet, robi się wysypiskiem śmieci; już dzisiaj jest cokolwiek wartościowego i ciekawego trudno znaleźć.A tak już całkiem przy okazji, do @kasiarzyna. Dzięki za właściwe numerowanie swoich filmów. Mam taki zamiar zrobić, jeden spójny system spisu wszystkich filmów. Dlatego wymyśliłem taki system numeracji.\nPozwoli on w przyszłości odnaleźć poszukiwane tematy. Ten system pozwala nam, pozwoli nam w przyszłości, na zlokalizowanie, poszukiwanej treści.Jedną tylko mam uwagę, prośbę; Zamiast myślnika; stawiać kropkę, i na końcu dołożyć dwa zera. Czyli upraszczając chodzi ,żeby zapis tak wyglądał: \nRok; Miesiąc; dzień; dwa zera; nawias a w nim PL, jeśli tekst jest polski, jeśli jest inny, to podać inny symbol, na przykład RU , albo \"D\" ; można dodać też, opis tematu, polityka; wiedza; technika; zdrowie; internet; muzyka; kościół; religia; kontrola inwigilacja; itp. To pozwoli potem zaszeregować do grupy tematów. I na koniec czas filmu. żeby osoba oglądająca wiedziała co ją czeka. To jest sekret tego systemu, Jak wszyscy będą tak robić, to potem będzie to łatwiej, bez błędów, razem umieścić, zespolić w jedną całość. Tak żeby to miało ręce i nogi.\nTo jest taki projekt, a co wyjdzie to zobaczymy. A na koniec takie powiedzenie.\nCzłowiek jest tyle wart, ile sam stworzy i służy drugim ludziom. Nie tym którym mu każą, ale tym którym powinien pomóc.\nPozdrawiam.",
				"added": 1568246382
			},
			{
				"comment_id": 121,
				"body": "Witam; ale żeby obejrzeć przedstawienie, ktoś czyli aktorzy muszą to przedstawienie dać, wykonać. Każdy chce oglądać ciekawe przedstawienia, a niema nikogo chętnego aby to ciekawe dostarczyć publiczności. Jedna osoba, samotnie niewiele może zrobić. Potrzeba więcej zapaleńców, chętnych do poprowadzenia tego zakątka, Polskości. Można tutaj, w miarę swobodnie ( jeszcze ) się wypowiadać na różne tematy tabu, gdzie w innym miejscu nawet niemożna wspomnieć; bo zostaje się zbanowanym na zawsze. \nPozdrawiam.",
				"added": 1568317204
			},
			{
				"comment_id": 122,
				"body": "ostatni twój film, komunikat brzmi.\n2019-09-10-[PL]-Tak śledzi Google i Facebook! | Dawid Radomski - [60min]\n\nhttps://www.youtube.com/watch?v=RvUaNIZDlJo\n\nNie można odtworzyć wideo, ponieważ plik jest uszkodzony.\nSprawdziłem na innym przypadkowym Pc-cie. To jest tylko obraz, a niema głosu. \nCiekawe dlaczego?   -  Kto zawinił? A kogo powiesili?  Spróbuj, może nadpisać; jeszcze raz to samo identycznie wgrać. To powinno się uzupełnić. Przy okazji ciekawe jak moje filmy się zachowują? Jakaś opinia? \nPozdr.",
				"added": 1568318212
			},
			{
				"comment_id": 123,
				"body": "Tylko wgrany na YouIubePL, - nie odbiera? Wszędzie gdzie indziej, wszystko jest Ok.\nFirefox - służy do tych spraw, jego e tym celu używam.  Wszystkie inne odbiera; i tu i tam. Link dałem na normalnego YouTube, i obejrzałem bez problemu. To tak wygląda, jakbym nie miał dostępu, do filmu. Albo zablokowany. pozdr.",
				"added": 1568323860
			},
			{
				"comment_id": 127,
				"body": "Witam; *Cytuję; \"2019-09-10-[PL]-Tak śledzi Google.- \nTen film już chodzi poprawnie. Ale jest jeszcze wcześniejszy, który nie działa, sprawdzałem na innym niezależnym laptopie u znajomego. Podaję namiary; 2019.09.17.[PL]-Skasowanie gotówki w Polsce. \nTeż jest zablokowany. Dobrze by było go poprawić. Pozdrawiam.",
				"added": 1568913822
			},
			{
				"comment_id": 129,
				"body": "Dzięki; wszystko już działa. Niech inni mogą obejrzeć. Czasami jest dobrze przeprowadzić taką kontrolę, czy wszystko jest Ok. Pozdrawiam.",
				"added": 1569444316
			}
		],
		"1553627501_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": [
			{
				"comment_id": 77,
				"body": "Witam; Co masz na myśli mówiąc,\"Teraz jestem ciekaw czy nasz rząd będzie na tyle miał oleju w głowie i nie zgodzi się z dyrektywą.\" - Przecież ten co rządzi, to nie jest nasz. ( olbrzymia część tych ludzi ma zmienione nazwiska. dlaczego? ). To są ludzie na usługach, kogo? A to co robią to tylko świadczy dobitnie przeciw nim. Nikłe szanse na zawetowanie tej ustawy. Być może że oni sami o tą ustawę poprosili. A szanse - ZeroNet- będzie miał wtedy dopiero jak to my potrafimy go zareklamować wśród znajomych i rodziny. Zapraszam do akcji; każdy werbuje nowego uczestnika. Pozdr.",
				"added": 1553642677
			},
			{
				"comment_id": 81,
				"body": "Problem jest świadomość; to nie ulega wątpliwości. oraz brak odwagi i podstawowej wiedzy na tematy obsługi internetu i Pc-ta. Teraz każdy biega z telefonem przy nosie. A na efekty nie trzeba długo czekać. Potrzebna jest jakaś zachęta? Być może dupę ruszą wtedy jak \"ocenzurowany internet\" całkiem wyłączą. Wtedy na wczoraj zaczną szukać pomocy. Typowo po naszemu.Pozdr.",
				"added": 1553699220
			},
			{
				"comment_id": 86,
				"body": "Witam; Zadajmy sobie pytanie? Jak jest zbudowany smartfon. Chodzi o programy, które w nim są, jak również fizyczną konstrukcję budowy procesora;\nkto buduje te procesory? I co one zawierają? Jest to mocno rozwinięta technologia inwigilacji. Większość nawet nie kojarzy o co tam chodzi. Przekierowanie ludzi na smartfony jest celowo robione. To tak jak bydło do rzeźni, zostaje wprowadzone między barierki ograniczające swobodę poruszania się. To bydło może iść tylko w kierunku ubojni. Jak weszło to nie może się cofnąć. A na końcu czeka rzeźnik, z toporem i nożem. Smartfon + człowiek = takie bydło zdalnie sterowane. Nowe programy tutaj nic już nie mogą pomóc. Ten element jest do usunięcia. A że się nie-da go usunąć, to już inna sprawa. Wszyscy , prawie wszyscy jesteśmy skazani do odstrzału. ( nazewnictwo myśliwych ); A co do – Acta-2. To rząd nic nie zrobi w tym kierunku, dlatego że to nie on ma cokolwiek do powiedzenia. Tutaj karty rozdaje kto inny. Będą mydlić oczy, bo są krótko przed wyborami. Ale to jest tylko mydło, przyjdzie woda. I z mydła nie pozostanie najmniejszy ślad. Zresztą robili to już wiele razy. Tylko ludzka pamięć jest krótka. Ludziska szybko zapominają. Jedynie internet bez cenzury, może coś tam zaradzić. ( dlatego z nim tak mocno walczą ). Pod warunkiem że dotrze pod strzechy naszych domów. A to żeby tam dotarł, to już zależy tylko od nas samych. Reasumując – im więcej ludzi w ZeroNecie – To jest większa  szansa na przebudzenie, i wszelkie zmiany na lepsze. Pozdr.",
				"added": 1554222829
			},
			{
				"comment_id": 87,
				"body": "Dlatego mamy ostatnie pięć minut, aby coś zrobić; w takim sensie żeby znaleźć sposób na dalsze porozumiewanie się. To jest ostatni dzwonek. Można próbować kopać się z koniem, ale nie wróże sukcesu w tej materii. Pozdr.",
				"added": 1554237189
			},
			{
				"comment_id": 95,
				"body": "Procesor; to jest furtka przez którą mogą wejść, ci co znają hasło. Gdzie są produkowane procesory Intela?\nSą produkowane w izraelu. Mając dostęp do procesora ; mamy dostęp do całej maszyny, jak i procesów zachodzących tam. Czyli mamy kontrolę na Pc-tem. Ciekawostka , Rosjanie w urzędach zmienili dystrybucję windy, na dystrybucję Astra-Linux. Pochodna Debiana. + wojsko + policja. Jakby mało tego było, zaczęli produkcję swoich procesorów, jest ich cała gama. I mają dobre parametry. Plus dodatkowo płyta główna, ona też zawiera komponenty współpracujące , umożliwiające wejście od tyłu. Bardzo to się nie spodobało, ale nie wszystko musi się podobać. Jak to mówią; Jeden woli, teściową a drugi córkę. Druga sprawa Chiny i Huawei. Pytanie? O co tam poszło? Wiecie? Poszło o kontrolę telefonu; Usmany nie mogą kontrolować procesora w tym telefonie. Kropka. Znowu jest procesor i kontrola. Tak myślę sobie musi coś w tym być. To taki żart. Pozdr.",
				"added": 1554424868
			},
			{
				"comment_id": 96,
				"body": "Witam; „Powiedz mnie, kto jest twoim właścicielem> A powiem tobie kim jesteś”. Podam przykład - „UBUNTU”-Linux-a. Został sprzedany, już dawno temu. Kupiła go firma Canonikal; dlaczego został sprzedany - kupiony? Zdobył zbyt dużą popularność. I w tym momencie musi być kontrolowany, oraz sterowany zdalnie. Po mimo, że ma otwarty kod źródłowy; jest pełna inwigilacja tej dystrybucji. Ma w sobie programy, które są zamknięte, i nie wiadomo co one robią? Jest przyczyna i jest skutek. Dzisiaj Ubuntu może również dobrze zastąpić windę. I jest tyle samo warty co winda.  Są jak brat i siostra. Jest to jedna rodzina. Jest jeden właściciel, który swoją duszę sprzedał diabłu. Ludzie którzy wspierają te parszywe firmy, są tyle samo warci co te firmy. Co jest warty człowiek? Nad którym bierze przewagę „LENISTWO”. A tłumaczenie się, że mnie to nie dotyczy ; to jest dobre w przedszkolu.\nCzłowieka wyróżnia mózg, który jest dość duży. Powinien on działać prawidłowo i dobrze. Ale działa kiepsko i źle. Ci ludzie są pod kontrolą, i są sterowani zdalnie. To nie jest teoria, ( spiskowa ) - ostatnio modne słowo, często używane. Jest takie powiedzenie; „nie ma dymu bez ognia”. Jeśli jest dużo różnych teorii, to  musi w tym coś  być. Troszkę odbiegłem od tematu, ale przypomnienie wszystkim , że nie jest tak różowo, jak na pierwszy rzut oka wygląda. Proszę nie zapominajmy, że chcą nas kontrolować, i sterować nami. Pozdr.",
				"added": 1554826315
			},
			{
				"comment_id": 100,
				"body": "Witam; Wynalazcą ZeroNet-u, jest Węgier, on wpadł na pomysł, i zrealizował -  który zaczerpnął , ( tak jak wszystkie pomysły ), od swojej drugiej połowy, od swojego anioła stróża, z biblioteki wszechświata; to tylko trzy określenia tego samego słowa – znaczenia. To tak gwoli wyjaśnienia skąd się biorą wynalazki? \nW przypadku ZeroNet-a, praktycznie nie ma żadnego finansowania. Niema serwerów, nie ma obsługi, Są natomiast tacy zapaleńcy, na przykład jak „Ja”, którzy udostępniają swój Pc-et, swoją pamięć,  swój internet, dla dobra ludzkości. Chodzi o to aby wściekła cenzura nie zlikwidowała wartościowych materiałów. Tutaj mieszkają – zamieszkują, pasjonaci, i hobbyści. Tutaj wartością nadrzędną, jest dobro ludzkie. \nZakłamany i ocenzurowany internet, który próbuje zapanować nad Światem i człowiekiem,  rozwojem  i przekazem  pożytecznych wartości. Tutaj jest pełna demokracja, tutaj może dołączyć każdy; tutaj nie ma cenzury, na przykład; możesz pisać i wyzywać na kogoś, Pytanie? Co ci to da? Mądry człowiek pokiwa z politowaniem głową, to wszystko. I nie będzie seedował twoich materiałów. Brak seedowania spowoduje, że przeniesiesz się w niebyt. I w tym momencie będzie to twój koniec. Tutaj może przetrwać tylko to co jest dobre i pożyteczne dla ludzi. To jest ta różnica między tymi internetami i cenzurą.  To ludzie tutaj określają, co jest dobre, a co jest złe. To ta społeczność decyduje o wszystkim. Tutaj „TROL” nie ma racji bytu. Nikt go nie poprze, to jest jego koniec. Tutaj nie ma pieniędzy, którymi można by było kogoś przekupić. To jest właśnie ta  zaleta, zdecentralizowanego internetu. A co do „AL-a” to on może tylko tutaj sobie poczytać, może coś napisać,  ale to czytający określą przydatność tych artykułów. Zaakceptują, albo odrzucą. Tutaj są ludzie co myślą, i w tym jest cała nadzieja. Pozdr.",
				"added": 1555096688
			},
			{
				"comment_id": 105,
				"body": "Przetłumaczony ostatni wpis; dla tych co mówią normalnie. Dwa słowa: PO PROSTU SKANDAL!\n\nJak donosi jego założyciel, Justin Chastain, klon Reddit Voat, jak donosi jego założyciel Justin Chastain, skontaktował się z „amerykańską agencją” w sprawie zagrożeń na wolnej stronie cenzury.\n\nW środę post Chastain (który idzie przez PuttItOut na Voat) powiedział użytkownikom, że muszą „ochłodzić się na„ zagrożeniach ”, ponieważ platforma została oficjalnie zwrócona przez nienazwaną agencję na część jej zawartości. Chastain powiedział, że nie chce procesować wolności słowa, ale Voat będzie współpracował z organami ścigania i usunie posty „szarej strefy”, jeśli zostanie o to poproszony.\n\nUżytkownicy Voat obrażali się na postrzegane ograniczenie ich zdolności do publikowania obelg rasowych i aprobowania przemocy.\n\nPierwszy komentarz do postu Chastaina został otwarty z antysemickim obelgą i wezwaniem do eksterminacji Żydów. Użytkownik Voat powołał się na sprawę Sądu Najwyższego z 1969 r. Dotyczącą poprawki z udziałem przywódcy Ku Klux Klan, który wygłosił telewizyjne przemówienie skierowane do określonych ras, twierdząc, że sąd orzekł, że zagrożenie musi być konkretne, aby było nielegalne. Użytkownik podał następnie przykład konkretnego wezwania do przemocy wobec konkretnej synagogi w konkretnym dniu. Ten komentarz był wciąż aktualny w momencie pisania.\n\nFirma Voat została założona w 2014 roku jako darmowa rozmowa Reddit i stała się enklawą dla skrajnie prawicowych tematów. Wielu użytkowników przeskoczyło statek z Reddit, który zaczynał blokować złośliwe społeczności, takie jak r / FatPeopleHate, r / CoonTown i jeden subreddit Qanon, r / GreatAwakening - zbiegając się również z pojawieniem się deplatformingu, które z powodzeniem zmniejszyło zasięg ludzi takich jak Alex Jones i Milo Yiannopoulos oraz ich ekstremistyczne ideologie.\n\n„Znowu, kto się z tobą skontaktował? Agencja amerykańska? Finansista Voat? ”Napisał jeden z użytkowników, na co Chastain odpowiedział:„ Tak ”, określając, że agencja się z tym skontaktowała.\n\nPłyta główna nie mogła dotrzeć do Chastaina i nie jest również jasne, które komentarze zostały rzekomo oznaczone jako zagrożenia.\n\nAle w przeszłości FBI interesowało się publikacjami online przez skrajnie prawicowe społeczności i użytkowników. W ubiegłym roku urzędnicy FBI przeniknęli do Gab, innej „społecznej sieci wolnej mowy”, aby zbadać online znajomego Roberta Bowersa, który jest oskarżony o zamordowanie 11 osób w synagodze Tree of Life w Pittsburghu.\n\nFBI nie zareagowało natychmiast na pytania płyty głównej dotyczące tego, czy zwróciło się do Voata lub Chastaina.\n\n„Zawsze popełniamy błąd, nie usuwając żadnych treści (nawet nie pamiętam, kiedy ostatnio to zrobiłem), ale sprawy stają się gorące i ważne jest, abyśmy zrozumieli to jako społeczność”, odpowiedział Chastain innemu użytkownikowi.\n\nPrzyszłość Voat od kilku lat utrzymuje się na hakach. W 2017 r. Chastain powiedział członkom, że koszty licencjonowania i hostingu były nie do utrzymania bez zewnętrznego finansowania, które strona starała się zabezpieczyć; nie polegamy już na darowiznach PayPal, ponieważ platforma płatności obcięła powiązania z Voatem w związku z „nieprzyzwoitością”\n\nCo więcej dodać? Jakiś komentarz?",
				"added": 1556344672
			},
			{
				"comment_id": 107,
				"body": "Witam; namiaru na taki sprzęt na razie nie mam.Sam jestem zainteresowany. Żadnych źródeł nie podaję, z przyczyn oczywistych; to tylko informacja jedna z wielu, jeśli temat interesuje trzeba go drążyć samodzielnie. Ja tylko udzielam wskazówek ,że coś takiego jest już w produkcji masowej. Co mogę polecić? Rosyjskie strony. Tam niema cenzury. \n \"Jeśli procesor jest \"be\" to po kiego zmieniać system operacyjny?!\"\nOdpowiadam; aby nie ułatwiać, -  ale aby utrudniać. Ci co to - tym się zajmują, niech zapracują na swój łatwy, zarobek i duży. Jeśli baran wierzga, to trudno go ostrzyc. Zajmuje dużo czasu, na każdego barana. Jak będzie coś nowego, to opisze okólnikami  znowu. Pozdr.\nA linkowanie i przekierowywanie to jest zły patent.",
				"added": 1556707228
			},
			{
				"comment_id": 108,
				"body": "Bez komentarza. Jeśli interesujesz się informatyką, a zapewne tak. To twój wpis jest co najmniej trochę dziwny. Odpowiedzi szukaj samemu. Pozdrawiam.",
				"added": 1556728235
			}
		],
		"1551516098_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": [
			{
				"comment_id": 84,
				"body": "Witam; ładnie wytłumaczone i zrozumiale.Pozdr.",
				"added": 1553955464
			}
		],
		"1554150988_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 85,
				"body": "Witam; \"Tyle jest tych stron (list),że w rzeczywistości ciężko znaleźć odpowiednią stronę\"  \nNa stronie ZeroSites - u góry jest pozycja. - Filter - i tam można po naciśnięciu \"PL\" - otrzymać tylko strony polskie, Inny symbol powoduje, wybranie innego kraju. Wtedy gościu ma wszystko ( absolutnie ) ,to co dotyczy tego kraju. Może wybrać dwa symbole, i wtedy ma dwa kraje. Dlatego też jest ważna instrukcja obsługi , ( do zrobienia ) - ZeroNeta. Oczywiście, że może być ZeroWiki. Tylko pacjent musi umieć tam dotrzeć, do tej strony. A - ZeroSites - jest w tym głównym menu, i musi się na niego napatoczyć, Ciekawość może go zachęcić do przeszukania tej strony; a wnikliwość, może spowodować że znajdzie ten - filtr - i naciśnie - PL -. Wtedy nasz geniusz ma wszystko przed sobą jak na dłoni; najechanie myszką, i kliknięcie powoduje zainstalowanie tej pozycji na stałe. Obecnie jest tam 10 pozycji; ale ZeroWiki tam niema? trzeba ją gdzie indziej znaleźć, i trzeba to umieć zrobić. Właśnie na próbę uruchomiłem dodatkowy komputer; i nowa instalacja - ZeroNeta - Jest tylko podstawa menu, i to jest wszystko. Resztę trzeba doszukać samemu. Jeśli ktoś jest pierwszy raz? To co on może zrobić? Co on wie na temat -ZeroNetu? Raczej absolutnie nic. Właśnie zrozumiałem co miał na myśli , ten co pytał na PolskiChat; On po prostu nie wiedział i nie widział żadnych możliwości, co zrobić dalej? Dla nowych jest ten pierwszy moment najważniejszy, kiedy nic nie mogą znaleźć. To wszystko co jest po polsku, to jest praktycznie gdzieś ukryte pod linkami. I nie jest na widoku. Nowy nic o tym nie wie. Jeszcze raz - ZeroWiki - nigdzie niema, i niemożna jej normalnie znaleźć. To tylko my wiemy że to istnieje.To jest jednak chyba trochę szerszy problem. Pozdrawiam.",
				"added": 1554170219
			},
			{
				"comment_id": 89,
				"body": "Witam; Dzięki, za dobre chęci. Być może ktoś to zrobi? być może ty to będziesz mógł zrobić kiedy indziej. Ja nie posiadam na ten temat ( niestety ) potrzebnej wiedzy. Problem jest zgłoszony, to jest ważne. Teraz tylko czeka na naprawę, poprawę, udoskonalenie. - ZeroWiki- już została zrobiona, i udoskonalona. Teraz jest do szybkiego znalezienia, odnalezienia, przez nowicjuszy.  Jeszcze raz dzięki i pozdr.",
				"added": 1554305463
			},
			{
				"comment_id": 94,
				"body": "Przede-wszystkim, według mnie, to łatwość znalezienia potrzebnej informacji. To mogą zrobić tylko starzy bywalcy, którzy mają rozeznanie w sytuacji. A młodzi powinni pytać o wszystko, nieważne czy to jest proste pytanie, czy skomplikowane. Dzięki temu dowiemy się co w trawie piszczy? Jakiej natury są problemy. Mam nadzieję że zawsze się znajdzie ktoś życzliwy, kto udzieli odpowiedzi. Dopiero rozwijamy skrzydła, i najgorszym momentem jest ten próg, ilości użytkowników. Wraz z wzrostem, przybędzie chętnych. Posłużę się przykładem, zbiegowisko na ulicy; wszyscy się zatrzymuj aby zobaczyć co się stało? A teraz odwrotna sytuacja; starsza osoba zasłabła, i przewróciła się. Brak żywego ducha, i jest następujący komentarz; nachlał się i leży. A nikt nie sprawdzi faktycznego stanu. Zapraszam wszystkich chętnych do współpracy, każdego chętnego, każdego kto ma coś do powiedzenia, Nie jest ważne na jaki temat, w zasadzie każdy temat jest dobry. A może ktoś poprowadzi bloga? Na jakie tematy? Na wszystkie tematy przyzwoite, na wszystko co może zainteresować.\nNie wstydźmy się że mówimy po polsku. Jest to bardzo stary język, który dzisiaj próbuje się wymazać z historii. Pamiętajmy, dla przeciwników jest to bardzo trudny język. Proszę popatrzeć na; Japonia, Korea, Chiny, oni się nie płaszczą przed nikim, są dumni że są tym kim są. Ja gdybym był politykiem, to obiecał bym wszystkim nowym po milionie. No ale nie jestem , i nie obiecam, mogę prosić tylko o wytrwałość i samozaparcie w przetrwaniu tych najsłabszych dni. Ja wierzę że przyjdą te lepsze, i będzie nas dużo.\nBrak nam wiedzy kto tutaj zagląda? Muszą zacząć zadawać pytania? Na tej podstawie będzie można przygotować ; dla każdego coś miłego. Można dodać reklamę na innych stronach, ale nie zawsze jest to mile widziane. Jesteśmy traktowani przez opinię społeczną, jako ci gorsi. Trzeba to zmienić, trzeba wiercić dziurę w brzuchu, tak długo aż będzie pozytywny skutek. Powtarzać, powtarzać, powtarzać. Pozdr.",
				"added": 1554423761
			}
		],
		"1554297078_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 92,
				"body": "Sprostowanie; to nie ja dodałem tą stronę. Ja tego nie umiem zrobić. Za to sporo wiem na temat bezpieczeństwa w internecie. Chodzi o to jak uniknąć kłopotów. To jest temat który zawsze mnie interesował, takie moje hobby. A w dziedzinie strony i takie tam, to mam braki, których już nigdy nie dogonię. W tym miejscu wszyscy są lepsi. Pozdrawiam.",
				"added": 1554421099
			}
		],
		"1554849416_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 97,
				"body": "To są tylko marionetki; umiejące ledwie czytać, bo z pisaniem to już mają ogromne problemy. To ktoś nimi steruje, i ten ktoś jest odpowiedzialny za wszystko co się tutaj zdarza. Ma plan, który realizuje. Ten plan zakłada zerwanie wszystkich kontaktów, międzyludzkich. Dlatego to ma ogromne znaczenie; nawiązywać kontakty międzyludzkie!!!\nNie można pozwolić na zerwanie, łączności po między ludźmi. Pozdr.",
				"added": 1554926652
			},
			{
				"comment_id": 99,
				"body": "Witam; wytłumaczyć, raczej się nie da. Ale, osoba która wie jak to działa, ( osoba z boku ). Może spróbować przestawić na boczny tor, tę osobę zahipnotyzowaną, ( sterowaną ),  jest to zadanie bardzo trudne; ale nie niemożliwe. System robi to bardzo perfekcyjnie. Posłużę się medycznym sformułowaniem; Najpierw należy zapobiegać, a dopiero potem leczyć. Wyjaśniam co mam na myśli; \"zapobiegać\" - maksymalnie utrudnić rozmowę przez telefon, można to próbować zrobić na parę sposobów. Fizyczne utrudnienie, na przykład - brak zasięgu. Oraz drugi sposób trudniejszy, zabranie czasu, który jest potrzebny do rozmowy. Bardziej po ludzku, dać tyle zajęć , aby nie było czasu na dzwonienie i rozmowę. Zaznaczam nie chodzi o jakieś wymuszenie; raczej o zajęcia typu sport, hobby, pomoc w jakiś pracach, społecznych. To tak na szybko, ale można to rozwiązać też bardziej perfidnie . Jest to brzydkie słowo, ale zdeterminowany rodzic, ma moralne prawo użyć takiej sztuczki, która przyniesie wymierną korzyść dla jego dziecka. Można też użyć psychologicznego triku, ty nie dasz rady obejść się bez telefonu przez pół dnia. Jest to raczej skierowane do chłopaka. W tej wojnie pokoleń, wszystkie chwyty są dozwolone. Ceną jest nasze dziecko. A konkretnie zdrowie psychiczne. Bez zrozumienia tego, to jest walka z wiatrakami, ( don Kichot ). Dodać do tego można na początek, dzień bez telewizji, służy ona do programowania ludzi, jeden dzień, dwa dni, stopniowo i pomału; tym sposobem można nagiąć każdą osobę. [ ja od dwóch lat nie używam telewizora, i żyję ].\nTrzeba odwrócić uwagę; i przekierować na inny kierunek, ma to być kierunek komunikacji, typu spotkanie, rozmowa, twarzą w twarz, powinno to obniżyć poziom uzależnienia. Najważniejszy jest pierwszy krok, następne przyjdą łatwiej. A może pokazać film który mówi o tym co przeciwnik robi z nami?Trzeba spróbować wszystkiego. Mała kropla drąży skałę. Życzę sukcesu i pozdr.",
				"added": 1555015723
			}
		],
		"1554830412_1DNH5keUZtST9ACf8Hdre5QzmSGKZh8FRw": [
			{
				"comment_id": 98,
				"body": "ROZWÓJ - DUCHOWY – CZŁOWIEKA.-2-\nDalszy ciąg tego tematu; krótkie streszczenie, następnych trzech odcinków. Tresura społeczeństwa, cz.-1-. jak manipulujący wpływa na społeczeństwo? Metody i technika. To wszystko jest mocno na skróty, tylko po to aby zasygnalizować istniejący problem. Jest mowa o związkach chemicznych, jak i o wibracjach energetycznych. To wszystko łączy się razem, tego nie można rozdzielić. Mleko które znamy na co dzień; to jest dobro, czy może zło?Czy ono nam służy? Czy może szkodzi? Tresura, cz.-2-. W tym odcinku, brakuje kawałek materiału; Jest to kwestią przypadku, czy ingerencja cenzury? To tylko mógłby wyjaśnić autor. Tutaj jest mowa o przekierowaniu uwagi – słuchacza – widza – na boczny tor.. O tak żeby zajął się czymś innym, a nie drążył niewygodny temat. Zmiana częstotliwości w muzyce; z prawidłowej częstotliwości -432-Hz. Na inną wyższą, która działa destrukcyjnie na człowieka. Informacja – ciekawostka : w filharmonii – muzycy odmówili wykonania tego zalecenia. Więc zagrożono im, że filharmonia zostanie rozwiązana i zlikwidowana. Taki muzyk , w zasadzie nic więcej nie potrafi, jak tylko grać na instrumencie. Wiec położyli uszy po sobie, i na tym się zakończył strajk. Zostali złamani...Dalej mamy o budowie mózgu; Lewa półkula – Prawa półkula. Do czego służy? Czym się zajmuje? Zasady - „WŁADZY”= czyli mieć więcej.\nMatrix-6-. Strach ma Jaszczurze oczy. Jest tu mowa o utracie pamięci wielowymiarowej. Co to jest i do czego służy? Kolejne wymiary – wyższe. Komunikacja, czyli świadomy wybór; to jest to o czym ja mówiłem, i ciągle powtarzam. Zaśmiecony nasz umysł, przez zbędne bzdety. Czyli ograniczyć do minimum, śmieci medialne. Życie z uwagą na otoczenie. - Zmysł – intuicja, która może nam pomóc. To tak mocno na skróty streszczenie trzech następnych odcinków. Żeby człowiek mógł się rozwinąć duchowo, potrzebna jest pewna doza Wiedzy. Może wyjaśnimy na początek co to jest wiedza? Wiedza jest to coś takiego, które zdobyliśmy samodzielnie, ( jest to ogromnie ważne ). Proszę nie mylić wiedzy z nauką. Nauka to jest coś takiego, przyjętego na wiarę, bez sprawdzenia. Przykład; szkoła – historia, bitwa pod Grunwaldem – 1410-rok. Nie mamy szansy sprawdzić. Wierzymy na słowo , że tak było. Ale być może znajdą się dociekliwi , i zadadzą dodatkowe pytanie typu; Jak te lata były liczone? Czy z latami przestępnymi? Czy może nie. Według jakiego kalendarza było to liczone? Kto to liczył i kiedy? W tym momencie może powstać błąd, rzędu paru dni? - miesiąca? Niema to wielkiego znaczenia dla nas, ale dla historyka? To już może być inaczej. Tak więc widzimy że wiedza i nauka to są dwa różne przedmioty. Bardzo łatwo jest nami manipulować, w zależności od potrzeby, i zapotrzebowania na taką manipulację. Ciekawość, jest drogą do wynalazku. A z stąd już krótka droga do samodzielności, i niezależności. W tym momencie zaczyna się robić niebezpiecznie dla rządzących nami. Nikt na to nie  pozwoli, To jest utrata władzy i panowania nad pracowniko-niewolnikiem. Więc następuje,- jest próba, ogłupienia  pracownika. I to jest ogromnym sukcesem tego systemu władzy. Jeśli do tego dołożymy telewizję z przekazem podprogowym, ( jest to już normą dzisiaj ). To wtedy mamy obraz człowieka całkowicie zniewolonego przez system. Pytanie? Co można zrobić? Można wyłączyć telewizor, ograniczyć oglądanie podprogowe. Co w zamian? Czym zastąpić ten narkotyk? Może być internet bez cenzury, może być książka, ( ale ludzie mają problem z czytaniem ), tak to jest fakt, ludzie mają problem z czytaniem i pisaniem. Niemożliwie długi tekst - to jedno zdanie. Zobaczcie na pejsbuka, albo na inne publiczne miejsca. Zatoczyliśmy koło, i znowu jesteśmy przy komunikacji między ludzkiej. Jest to bardzo ważny aspekt naszej tożsamości, ROZMOWA Z DRUGIM CZŁOWIEKIEM. Próbują nam to odebrać, jeśli to się uda, to jest koniec homo sapiens. Tym mało optymistycznym akcentem kończę i pozdrawiam wszystkich czytelników tego tekstu. Miłego oglądania filmów, a wnioski są do przedyskutowania. Pozdr.",
				"added": 1554946858
			}
		],
		"1555178290_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 101,
				"body": "Witam; Czyli taka trochę dobra wiadomość - i trochę zła. Pytanie? Co zrobić aby było dobrze? Ja u siebie nie zrobię poprawek, bo nie umiem; Chętnie bym się nauczył. Ale to nie jest takie proste dla mnie. Gdyby , ktoś mnie pokazał jak to się robi? Jestem wzrokowcem, muszę zobaczyć, tak jest dla mnie najlepiej. Ale niema nikogo takiego w okolicy, przynajmniej ja nie znam. Gdyby taka poprawka była napisana ; punkt po punkcie , każda czynność. To bym się podjął poprawić według takiej instrukcji. Co mogę zrobić? Mogę skasować - wykasować, i na nowo zainstalować. Chyba to dam radę zrobić. A reszta towarzystwa,użytkowników? Jaki poziom przedstawiają? To jest tajemnica. IRC - teraz działa bardzo dobrze, tam naniosłem poprawkę dzięki\n-@kasiarzyna. która napisała punkt po punkcie co zrobić. Wielkie dzięki jej za to. A coś takiego jak - ZeroPolska - w takim zestawie jak piszesz; to by było właśnie to, strzał w dziesiątkę. Ja jestem za. Jeśli coś będę mógł pomóc, to jestem gotów to zrobić. To na co pozwalają moje umiejętności. Pozdr.",
				"added": 1555183178
			},
			{
				"comment_id": 103,
				"body": "Witam; Mam pytanie? Czy nie podjął by się ktoś, zainstalować - \"Zero Polska\" - w spisie - Zero Sites- . Pytam dlatego, że ostatnio instalowałem , znajomemu - ZeroNeta - i chciałem mu zainstalować z automatu tą pozycję -( Zero Polska ) i nie mogłem; brak jej w spisie Zero Sites. Pozdr.",
				"added": 1555803021
			},
			{
				"comment_id": 104,
				"body": "Witam; A zrobienie na nowo tej - ( takiej podobnej )-strony?; tak aby ona była poprawna i dobra?  Pojąłem próbę zainstalowania, ale nie przyjęło?  Coś tam jest nie tak, w sumie jest to proste; ale i tak nie działa. Dzięki i pozdrawiam, za dokładne wskazówki.",
				"added": 1555925464
			}
		],
		"1557338480_1NiSPKqgQ9Sgqv5pDbWs7aQzj36hWcGAqc": [
			{
				"comment_id": 109,
				"body": "Witam;Nie do końca jest to prawdą; Skąd się wzięła ludzkość? Co niektórzy wiedzą, ale milczą. Tak samo, trochę wiemy o świecie, jak i o nas samych. \nJeśli podzielimy ludzkość, na ludzi – są to osoby myślące. Oraz na Bio-Roboty,\nsą to osoby zaprogramowane. To w tym momencie wiele zaczyna się wyjaśniać.\nWcześniej to wygląda na chaos,  taki misz-masz , bez ładu i składu. Po podziale na dwie grupy, sytuacja zaczyna się normować. Jeszcze do tego jak dołożymy piramidę, taką konstrukcję hierarchii dowodzenia. To wszystko staje się klarowne i jasne. Wojny i mordowanie, jest wpisane w nasze życiorysy. I zostaje wykorzystane przeciwko nam. Błędna hierarchia jest zaprogramowana;\nŁatwiej nami jest wtedy sterować, - zarządzać. \nZbyt często ludzka podłość staje się czymś normalnym, na tyle że nie zauważamy że zabijamy kogoś obok nas, Jest to wykorzystywane przeciwko nam, z dobrym skutkiem.\nTo powinno być fundamentalne prawo – Dla człowieka nie jest potrzebne żadne prawo. Ono jest potrzebne dla bio-robotów. Co to jest bio-robot?  Jest to istota podobna do człowieka, ale zaprogramowana na swój sposób. Na samym początku, moment urodzenia – nie ma żadnej różnicy. To się dopiero zmienia z czasem. Dwoje braci; jeden zostaje człowiekiem, a drugi bio-robotem. Ten drugi ma wgrany program; ( przenośnia ). Ten pierwszy myśli i zachowuje się jak człowiek, w całym tego słowa znaczeniu. A ten drugi zostaje zaprogramowany i ma ograniczenia, typu samodzielne myślenie. Do tego może służyć, ingerencja duchowa, ( poza zmysłowa ). Albo ingerencja fizyczno – chemiczna, typu szczepionki, które powodują przymulenie umysłu. ( na zawsze ). \nWszyscy ludzie mogą być wolni niezależnie od różnic kulturowych, poglądów, wyglądu etc.\nŚwięte słowa, ale jest tam jeden myk; Ludźmi wolnymi nie da się sterować. Więc są mało przydatni, do wyznaczonych celi. Są potrzebni tylko tacy, którzy bez większej dyskusji, będą wykonywać polecenia. Proszę po obserwować swoje otoczenie i swoich znajomych. Wynik będzie naprawdę zadziwiający. Co można zrobić w tej sprawie? Wybudzić – obudzić, ale uprzedzam, jest to trudna sprawa. Jeśli zostali dobrze zaprogramowani, to praktycznie jest to niemożliwe. \nNie wiem, czy zauważyliście, że ludzie po wypadku, albo po traumatycznych przejściach – stają się wybudzeni. Coś tam w ich programie przeskoczyło, i zaczynają inaczej myśleć i inaczej się zachowywać. W całym tego słowa znaczeniu. Oni stają się ludźmi. Przestają być bio-robotami. Słowo pasożyt nie dotyczy człowieka; To słowo dotyczy tylko bio-robota. Często mylimy to pojęcie, dlatego, że trudno odróżnić jednego od drugiego. Odróżnić „bio” od człowieka.  Ten podział tłumaczy nasze zachowanie. Dlatego często obwiniamy ludzi o coś co jest przynależne dla bio-robota. Zrozumienie tego, ułatwi podział na dwie grupy. I w tym momencie wszystko staje się jasne, i przejrzyste. Jak się programuje? Człowieka? Ten - Pierwszy krok robi kościół; on potrzebuje posłusznych. I ma na to pozwolenie od góry. Państwo to popiera. Bo na tym korzysta. Jest to obrządek taki jak; chrzest, bierzmowanie, komunia, ślub kościelny. Brzmi to niedorzecznie, ale niestety jest to prawdziwy rytuał. I do tego dość skuteczny. Chyba że ksiądz był pijany. To jest pierwsza podstawowa część, dalej idzie nasza ukochana szkoła. Ona nas programuje na wiele sposobów. I wkłada nam do głowy mnóstwo kłamstwa. Nawet w naukach ścisłych takich jak matematyka, fizyka, chemia. Nie wspomnę o astronomii. \nJest całkiem ciekawie. Praktycznie ze szkoły potrzebujemy tylko czytanie, pisanie, oraz liczenie. No to jest trochę trudno połapać się w tym przekręcie.\nZresztą każdy chce jak najszybciej to wszystko zapomnieć. A wyjątki ,które się trafiają? To na nich nikt nie zwraca uwagi. Życie toczy się dalej. Dopiero jak przystaniemy i zastanowimy się? To zaczynają nam wychodzić cuda na kiju. \nTo tylko jest sygnał, jesteśmy ludźmi, a nie robotami. Myślimy samodzielnie, a nie pod jakąś linijkę – wzorzec. Jest to bajka mocno na skróty, tak to traktujcie.\nA jeśli ktoś ma wątpliwości, to proszę o pytania. To postaram się odpowiedzieć, jest tutaj wiele wątków tematycznych, i trudno znaleźć odpowiedź na wszystko. \nPozdr.\nPs. Brak możliwości, zmiany pisma jak i koloru nie pozwala na czytelne pisanie. Co utrudnia późniejsze czytanie.",
				"added": 1557344850
			},
			{
				"comment_id": 110,
				"body": "Witam; Dzięki za informację, sprawdzę jak działa. Niestety aby czytelnie napisać, to przydało by się parę dodatków; A chodzi ,przede wszystkim o czytających te bazgroły. Żeby im było łatwiej, się odnaleźć. Pozdr.",
				"added": 1557395980
			},
			{
				"comment_id": 111,
				"body": "Witam; wszystkich, spróbuję odpowiedzieć zbiorowo.\n*Dlaczego myślisz, że nie wiemy skąd się wzięła ludzkość? Szukałeś informacji na ten temat?*\nOdpowiedź: Wiadomo i nie wiadomo. Zależy gdzie zajrzysz. Kościół, mocno ściemnia, i w zasadzie można te opowieści , włożyć między bajki. Jest to potrzebne dla wierzących  inaczej. Temat kościoła jest dosyć delikatny. Strach jest ten temat poruszać. ( jeszcze teraz ). Przejdźmy do nauki , niezależnej. Tam jest znacznie lepiej, można rozmawiać na wszystkie tematy; jeden warunek, te grupy nie mogą być za duże. Tam można się sporo dowiedzieć na wszystkie tematy. W konfrontacji kościoła i nauki, to kościół wychodzi bardzo blado. Do tego przyznaje się Watykan. Podam przykład; X lat temu , Watykan zlecił przetłumaczenie biblii. Tym zajął się znany profesor, tłumacz, znawca językowy. Dostał on uprawnienia do wszystkich kościelnych archiwów.  Jego praca trwała parę lat, zakończona sukcesem. Koszta tej pracy bardzo wysokie. Po zakończeniu, pracy duchowni Watykanu wraz z panującym papieżem, zaznajomili się z tą pracą. Zapłacono, sumę którą zażądał autor, bez żadnego zbędnego szemrania. Dano mu tylko klauzulę do podpisania; że wszystko musi pozostać w największej tajemnicy. Oraz że nie jest mu wolno zrobić kopi , w żadnym z wymienionych punktach. Wymieniono, książki, prace naukowe, telewizję, radio, itp. czyli wszystko możliwe. Ale popełnili gafę; byli to leciwi Watykaniści, i zapomnieli o internecie. W tej umowie nie było internetu. Po roku czasu, i skonsultowaniu z prawnikami; ukazała się pierwsza część tłumaczenia w internecie. Ja ją czytałem; jest ciekawa. Dalsze części są w drodze. A teraz, biblia, którą znamy; bardzo się różni od tej przetłumaczonej. Kropka. To tylko jeden z wielu przykładów. Szperając w archiwach można sporo ciekawych spraw znaleźć.\n*Nic nie wiemy o tym świecie?? Co masz na myśli? Ja uważam, że wiemy bardzo dużo. *\nJeśli mówisz o oficjalnych sprawach, to tak naprawdę nic nie wiesz. Owszem można coś niecoś znaleźć na te tematy. Nie jest , łatwo. Wszystko , albo większość jest kłamstwem. Jest to dość szokujące stwierdzenie. Do tego trzeba dojść samemu. Potrzebne jest zacięcie, i sporo czasu. Aby to zgłębić. Ale jest to realne. Ważna – Uwaga-. Nie można rozpatrywać spraw, wąsko tematycznie. Tutaj trzeba patrzeć – 360-stopni, dookoła głowy. To są klocki  lego, które się zazębiają, razem ze sobą. Tutaj nie ma specjalizacji. Im więcej wiesz na różne tematy, tym lepiej. Tym łatwiej jest tobie szukać.\n*Podzieliłeś ludzi na dwie kategorie, a Ty jesteś bio-robotem czy wybudzonym człowiekiem? Jak rozróżnić te dwa stany? *\nLudzie rodzą się równi; I zostają zaprogramowani wszyscy; Zmiana następuje po wstrząsie, albo po przebytych traumatycznych przejściach. Wybudzenie, następuje po wypadku samochodowym, po  śmierci kochanej osoby, śmierć kliniczna, itp. Coś tam w naszych głowach się otwiera. Przebadane sprawy, to jest 100%- prawda. Tylko nie wszyscy się do tego przyznają. Niektórzy głęboko skrywają , wstydzą się, albo boją być posądzonym o nienormalność. A prawda jest całkiem inna. To reszta jest nienormalna. Jak rozróżnić? Jest to bardzo proste. Robot niczym się nie interesuje, nic go nie obchodzi, jest mu wszystko jedno; Czyli praca, jedzenie, + jakieś piwo do tego, serial TV. Spać, bo jutro do pracy. Jak go zapytać o coś co wymaga podjęcia jego decyzji, to ma problemy, nie potrafi kierować grupą ludzi, zawsze oczekuje od kogoś polecenia. Bo tak jest mu wygodnie i prosto zarazem. Próba namówienia takiej osoby na jakieś samodzielne przedsięwzięcie, zawsze spełznie na niczym. A człowiek jest tego przeciwieństwem.\n* Jest jakiś test na sprawdzenie czy się jest \"myślącym samodzielnie\" czy \"zaprogramowanym\"? Kto ma to oceniać? *\nJeśli pytasz o to, to już nie jest źle. Robot, nigdy nie zapyta. To nie jest jego sfera wpływów. Podam przykład; Zachodni uniwerek; grupa studentów. Dostała za zadanie , podłączyć do bateryjki elektrycznej żaróweczkę,  do pomocy dostali jeden kabelek. Bateryjka, to paluszek, żaróweczka-1,5V, kabelek. \nNo i zaczyna się jazda bez trzymanki; cześć z nich stwierdziła,że jest potrzebny jeszcze jeden kabelek. Jeden zażądał włącznika. A tylko dwie osoby rozwiązały to zadanie. Jeden koniec żaróweczki oparli na bateryjce, a drugi koniec połączyli  przewodem, żaróweczka się zapaliła. Na osiemnaście osób, biorących w eksperymencie, tylko dwie rozwiązały zadanie. Prawdziwy szok. \nKto tam był Bio-Robotem? \n* Co rozumiesz przez \"błędną hierarchię\"? Masz na myśli, że jest jakaś prawidłowa? Jeśli tak to jaka? *\nPrawidłowej , to chyba nie ma. Każda hierarchia służy podporządkowaniu sobie. Wykorzystuje ns jak i  całą resztę. Traktują nas jako środek do celu. Mamy pracować, nie zadawać pytań, ( bo z nich może coś wyniknąć ). Nieprzyjemnego. Tych ogarniętych posyła się na wojnę, celem eksterminacji. \nWiększość wojen to są ustawki, pomiędzy tym i tam na górze. To tak jak gra w szachy. Stawką są pieniądze, zdobyte tereny, kopaliny, i redukcja ludności. Po przebytej wojnie siadają do stołu, ( nazywa się stołem rokowań ).W tym temacie warto zapoznać się z niezależną historią. Jest taka. W szkole jej nie uczą. Na podstawie historii można się wiele nauczyć i zrozumieć. Jest jeden warunek, trzeba mieć sporo czasu aby móc to zrealizować. Zapomniałem i pieniędzy  na życie, albo przeżycie. Najważniejsze, chęć to zrobić.\n* Jak rozumiesz słowo wolność? *\nTo akurat jest bardzo proste pytanie? Nie masz nikogo nad sobą, dosłownie i w przenośni. Niema, urzędników, policji, finansamtu, kościoła, sołtysa, straży miejskiej, banków, służby zdrowia, ( na przykład szczepionki ). \nJesteś „TY” i jest przyroda, z którą żyjesz w zgodzie, nie zabijasz zwierząt, i ich nie jesz. To też są żywe i myślące istoty, pokochaj je; a one się tobie odwdzięczą. \n* Ciekawa teoria o  bio-robotach, *\nTo nie jest teoria, to jest rzeczywistość; ale nie dla każdego dostępna, nie każdy może to zrozumieć. Jeśli się pytasz, to nie jest źle. Do tematu; Programowanie to jest coś tymczasowego. Można z tego wyjść. A zabijanie, to już tutaj nie ma odwołania. Zabity, uśmiercony, zatruty, - jeden objaw cechuje tych ludzi. Są oni wykasowani na stałe. Niema powrotu. A program jak, skasujesz to masz z powrotem  żywą i  zdolną istotę, która się nazywa dumnie człowiekiem. \nJaki powinien być  Świat? To jest pobożne życzenie. Co niewiele ma z bogiem wspólnego. Czubek góry lodowej, który stara się nie dopuścić do tego. My jesteśmy na samym dole, często nie douczeni. Nie mylić z stanem posiadanej szkoły. Wkrótce zrozumiecie że wasza szkoła, to jedna wielka mistyfikacja. Bez tego daleko nie ujedziecie. Trzeba rozdzielić „WIEDZĘ” od szkoły. Wiedza to jest to, co samemu zdobyłeś, doświadczyłeś, poznałeś. Niema tutaj miejsca na wiarę, typu profesor coś nam powiedział, i my mu wierzymy dozgonnie. Wiara obowiązuje tylko w kościele, i służy ogłupieniu wiernych, ( z powodzeniem to się udaje ). Wiedza to jest eksperyment zrobiony prze ciebie, i w efekcie już wiesz czy to działa czy nie. Powtarzam to jest wiedza. Nikt tobie jej nie może zniweczyć, usunąć, wymazać, ty od tego momentu już wiesz. \n* Zaufać oficjalnej nauce? YouTubowym filmikom? *\nAbsolutnie,”NIE”. Do tego musisz samemu dotrzeć, nie da rady inaczej. Ważna jest twoja „INTUICJA”- naprawdę ona bardzo pomaga w życiu. Chcesz poznać prawdę? Musisz się jej nauczyć szukać. To są postawy. Pomocne w tym mogą być, „kroniki Akaszy”. Są też inne nazwy, To jest odrębny temat, na który aby odpowiedzieć potrzeba sporo czasu. Może w następnym artykule. \n*  Nie ważne jak bardzo otwarte mamy oczy  *\nBardzo to jest ważne, jak chcesz  iść – udać się, w daleką podróż, z zamkniętymi oczami? Najpierw trzeba je otworzyć, zobaczyć jak naprawdę wygląda nasz świat. Jesteśmy okłamywani od małego dziecka. Nic nie jest proste, tak jak nam się wydaje. Trzeba usunąć kłamstwo, a na to miejsce wprowadzić prawdę. To jest ogromne i trudne zadanie. Trzeba wiele wytrwałości, i samo zaparcia. Ale można to zrobić, zapewniam was. Nasze życie to jest wspinaczka po drabinie, w przerwach są egzaminy z dojrzałości.\nEgzaminatorem jesteś ty sam, nie ma tutaj bubli ani, po znajomości. To jest realny świat. Parę szczebli do góry, a jaki wspaniały jest widok; To co kiedyś było problemem, to tutaj wyżej jest nic nie wartą drobnostką.  Jak wejdziesz to zrozumiesz, wcześniej nie da rady. Tu wyżej jest inna perspektywa widzenia, inne są możliwości. Możesz być zdrowy, możesz nie chorować, możesz zacząć leczyć ludzi, To jest bardzo malutki wycinek możliwości człowieka. Dla robota, nie ma tutaj miejsca. Dlatego ludzie są tacy groźni, dosłownie. No chyba na razie wystarczy, w tym temacie. Pozdrawiam.\nPS. Proszę jedno, dwa pytania maximum; wtedy będę mógł bardziej szczegółowo odpowiedzieć. Bardziej rozwinąć temat, z korzyścią dla czytających.",
				"added": 1557438242
			}
		],
		"1557820868_15C1QHgbZtqgBQm8DY9MLkftgND9CZbbNY": [
			{
				"comment_id": 112,
				"body": "Jedno słowo'; Makabryczne.Oglądałem inną wersję, tego filmu. Inaczej trochę poukładane. Ale materiał jest ten sam. Powinni wieszać za jaja. Zresztą, bóg z betlejem, i jego wyznawcy zrobili wiele zła na ziemi. A dzisiejsi nauczyciele, dalej czynią zło i krzywdzą ludzi i dzieci. To jest wpisane w ich rytuał. Pod tym kontem tam się dobiera ludzi. Kiedyś spotkałem takiego księdza. Dopiero po czasie zrozumiałem o co tam biegało, po lekcji religii, poprosił paru chłopaków aby coś tam mu pomóc . Poszliśmy całą paczką, to był jego błąd; a nasze wybawienie. To nie są pojedyncze przypadki. Większość spraw nigdy nie ujrzała światła dziennego.",
				"added": 1557836036
			},
			{
				"comment_id": 113,
				"body": "Jest jeszcze jedna opcja; można ograniczyć, korzystanie z ich usług. Ale ludzie, niestety jak ćma do świeczki. Wleci i zostanie spalona. Może kiedyś zrozumieją? Albo nie zrozumieją. Watykan pomału się kończy. Jego dni są policzone. A u nas to , jeszcze będzie długo kultywowane.Pozdr.",
				"added": 1557844034
			},
			{
				"comment_id": 114,
				"body": "Witam; końcówka filmu wszystko tłumaczy. Wszyscy są umoczeni, wszyscy czerpią korzyści z tego procederu. Czy ktoś ma jakieś wątpliwości? Od samej góry, aż po sam dół. Urzędnicy , to prostytutki które dają bez pieniędzy. Wystarczy pogłaskać po główce. Wszyscy o tym wiemy, mniej albo więcej. A to już zależy od inteligencji, albo spostrzegawczości. Reasumując; upadek ludzkości. Czyli zbliża się koniec.",
				"added": 1558603584
			}
		],
		"1559842378_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 115,
				"body": "Witam; Te chmury, od dawna się zbierały. Nikt nie chciał – nie chce słuchać. \nTo że dopiero teraz, ruszy lawina; to jest znak ,że trwały przygotowania. Do tej akcji szczepionkowej; czyli dla naszego dobra. Mówienie, że Chiny i Korea; coś blokuje, czyli ocenzurowała. To brzmi jak chichot  pre - historii. Czyli w końcu , kto jest więźniem politycznym? Oni, czy my? A mówienie frazesów, do tłumu przytępionych Bio-robotów. Jest pustym  sloganem. Całkowicie bez pokrycia. Jestem niezmiernie ciekaw, jak zareaguje społeczeństwo wychowane na okularach i tubie? Czy wreszcie dotrze to do nich, że rękę trzymają w nocniku? \nA może wcale nie zauważą tego; jest to dosyć prawdopodobne. Właśnie dlatego zrobiłem archiwum na JouTubie-PL. Czy to się zachowa? To tylko zależy, od was. Ilość seedowań i kopii. Tam właśnie, jest taki przekrój, Filmów. Wszystkie wyselekcjonowane, i sprawdzone. A tak, w ogóle, co im przeszkadza płaska ziemia??? Ja bym to olał. No, że chyba jest inaczej? A my o tym nie wiemy. \nDla mnie każdy ma rozum, to niech go używa, według swoich potrzeb. A tak przy okazji, to mam film o płaskiej ziemi, no to go cyknę na ten kanał, po oglądajcie go sobie. Bo jak skasują to już go nigdy, nie zobaczycie. Pozdrawiam.",
				"added": 1559847537
			},
			{
				"comment_id": 116,
				"body": "Witam;Opisz ten JDownloader 2. Co to za ustrojstwo. Gdzie tego szukać. Ja mam zablokowane nagrywanie z Tuby. Jakiś pomysł?",
				"added": 1566125030
			},
			{
				"comment_id": 117,
				"body": "Witam; Cyba zaszło małe nieporozumienie; Ja nie chce ściągać plików, filmu, do chmury u pośrednika. Taką opcję oferuje również Tuba. Oni chcą wiedzieć komu ja dany film przesyłam, kto to ogląda?; Chcą śledzić całą drogę jak i moje powiązania z innymi osobami. Ja to chcę mieć anonimowo. Ja chcę ściągnąć do siebie na Pc-et. Dodatkowo chciałbym to mieć, indywidualnie, dyskretnie, bez jakiejkolwiek ciągłości śledzenia mojej osoby; Tak po prostu, leci jakiś film, ja go sobie kopiuje do jakiegoś, folderu, pliku, itp.\nA w tym przypadku, jest to dalej u kogoś, a nie u mnie w Pc-cie. Oni widzą co ja z tym robię. A ja się na to nie zgadzam. I nie mogę skorzystać z tej opcji przesyłu. Mało przydatne i głupie; inaczej, dla naiwnych.",
				"added": 1566130473
			},
			{
				"comment_id": 118,
				"body": "Dzięki; Trochę się zaplątałem w sprawdzaniu tego ustrojstwa.Jeszcze raz na spokojnie posprawdzam.Dzięki.",
				"added": 1566132863
			},
			{
				"comment_id": 124,
				"body": "Witam; może coś więcej na ten temat napiszesz? Miło jest usłyszeć o konkurencji, o ile ona jest faktyczna a nie wymyślona przez czarnogłowych. Ostatnio jest dużo nowości, ale jak się przyjrzymy, to jest dużo gorzej niż było. Pozdr.",
				"added": 1568659414
			},
			{
				"comment_id": 126,
				"body": "A to jest ciekawe spostrzeżenie. Czyli takie stare odgrzewane kotlety w nowym opakowaniu? A czy przypadkiem nam nie chodzi o to żeby to coś było nie śmiertelne? Bo może ja się mylę, i sam o tym nie wiem?\nJeśli jeden pstryk, ma spowodować wyłączenie? To chyba to nie jest dla mnie. Nie ten przedział wiekowy. Ja już to w swoim życiu przerabiałem. Druga sprawa, jeśli jest to oficjalne, to chyba cenzura obowiązuje? oraz poprawność polityczna. Czyli znowu czarna dziura, albo czarna dupa, jak kto woli. Pozdrawiam.",
				"added": 1568665820
			}
		],
		"1573663590_1BoazbM5hxwjz51eQ8PYHwSTFNFe2a81ec": [
			{
				"comment_id": 130,
				"body": "Witam; a nie jest czasem prościej, nie wpłacać tam swoich pieniędzy? Bierzcie przykład z eskimosów, oni mają banki na całym świecie, ( są właścicielami ). Ale swoje własne pieniądze, trzymają w skarpecie. To tylko świadczy o ich przebiegłości i zaradności. Bierzcie przykład, z lepszych magików cyrkowych, spróbuj oszukać  - eskimosa? Czy się to tobie uda? To powinno dać dużo do myślenia, \"TOBIE\". \n*Pytanie Nr.2- Na jakich zasadach działa, tutanota? Czy ty mu zgłaszasz gdzie są pieniądze i on się włamuje???\nI więcej go nie widzisz? Czy najpierw odzyskujesz pieniądze; a potem dopiero robisz mu przelew? To jest ważne. Jaka jest kolejność? A nie przyszło ci czasem do głowy? Że to on może być sprawcą twojej głupoty?\nNie nazywam tego nieszczęściem - tylko głupotą. Dać komuś do przetrzymania, swoje własne, ciężko zarobione pieniądze pieniądze. No chyba że , te pieniądze też zostały ukradzione, ale tym razem przez \"CIEBIE\". To wtedy jest, nazywa się, ( ręka sprawiedliwość ).\nZa głupotę trzeba zapłacić, jest to najlepsza nauka życiowa, tak się zdobywa \"wiedzę\".\nPozdrawiam.",
				"added": 1573696858
			}
		],
		"1573781939_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 131,
				"body": "Witam; Bardzo ciekawie opisałeś całą sytuację, ja też mam wątpliwości co do całości sytuacji. Na samym początku, było jakoś inaczej; lepiej, normalnie, bezproblemowo, potem zaczęło się piąć pod górkę. Zamiast lepiej, było tylko gorzej. Coraz gorzej. Jestem uważnym obserwatorem. Widzę nie widzialne rzeczy. \nTakie są moje odczucia. Naraz wszystko przestawało funkcjonować, tłumaczyłem sobie to zbyt małą ilością użytkowników. Werbowanie nowych ludzi, powodowało jeszcze gorsze działanie. Na pytanie dlaczego tak się dzieje? Brak było wyjaśnienia. Dość długo tutaj jestem, i widzę zachodzące zmiany; są one robione perfekcyjnie. *Cytuję;  wadliwe, bezużyteczne oszustwa (żart / oszukiwanie). W tym momencie dochodzimy do podobnej analizy. Moja teoria jest, zgoła trochę inna; \"ZeroNet\" - nie został zrobiony dla nas! On został zrobiony dla chińczyków, taka dawna polska \"Wolna Europa\" tylko w nowocześniejszym wydaniu. Przy użyciu internetu. Nasza obecność jest tylko tłem, dekoracją, taką jak w teatrze. Mamy być, ale już coś robić, działać, to nie za bardzo. Ja osobiście ściągnąłem tutaj ponad trzydzieści osób; Dzisiaj ich już niema. Odeszli z nieznanych powodów. Znowu jesteśmy na pozycji, \"pozostali\" , w tej chwili Hiszpania jest ostatnia i liczy, 17-peers. A my jesteśmy w tej reszcie po za kolejnością. Moim zdaniem, dlatego są te utrudnienia robione. Zadaniem ZaroNeta, jest wyglądać naturalnie, spontanicznie, oddolnie jakby kiedyś towarzysz Gierek powiedział, taka oddolna inicjatywa. Nasuwa się jeden wniosek; ZeroNet jest pod kontrolą, służb specjalnych. To nie jest wolne miejsce. Pokusiłem się o sprawdzenie innych narodowości? I mam ciekawe spostrzeżenia. Zbyt wielu jest przeszkadzających, pytanie? DLACZEGO? To pytanie pozostawiam bez odpowiedzi:\nMam pytanie takie przy okazji? Jak ty widzisz polskie strony, jak działają, tematyka, różnorodność, ciekawość.\n*Zero Talk Polska.    -jest to tylko odnoga, Zero Talk.\n*ZeroPolska.    -jest tam około 23- pozycje tematyczne.\n*Tablice.  -jest tam 22- pozycje, które zawierają jakieś artykuły. Różne tematy.\n*YouTube PL.  -jest ponad 350- filmów wrzuconych.\n*ZeroChatIRC.    - od dłuższego czasu brak tam wpisów.",
				"added": 1573788452
			},
			{
				"comment_id": 132,
				"body": "Odpowiedź jest prosta; przykład, oszust chce coś sprzedać; w tym przypadku chodzi o informację. Do niego pochodzi jakiś kupujący, czytaj chętny; On musi stworzyć wrażenie prawdziwego, wiarygodnego. W tym momencie podchodzi podstawiony drugi kupujący, który udaje zakup tego towary; Tylko po to aby zachęcić, do zakupów pozostałych niezdecydowanych, żeby uwiarygodnić tą transakcję. Oczywiście te zakupy to fikcja. To jeleń ma dokonać właściwego zakupu. My jesteśmy takimi jeleniami , całkiem przypadkowo. Całość jest skierowana na inną część świata. A myśmy zajęli miejsce w tej kolejce  donikąd. Jaka rada? Trzeba samemu stworzyć innego, własnego- Zero Neta. Bez pomocy osób trzecich. Musi to być, \"open source\", ale ktoś musi tą dystrybucje kontrolować, i nie pozwalać na niekontrolowane zmiany. Duża społeczność mogła by temu podołać. Kiedyś eskimosi wprowadzili taki program; \"Nowoczesność w domu i zagrodzie\". Parę lat minęło, i nie została już ani jedna zagroda wiejska, wszystko uległo likwidacji. Teraz mleko importujemy z Holandii. A węgiel z Ukrainy. Taka platforma jak, Z_N , mogła by być bardzo przydatna. Można by było wymieniać się poglądami, nie zwracając uwagi na cenzurę, i jej przeszkadzanie. To co na \"sercu\" to i na \"języku\". Trzeba stworzyć coś nowego, ale na innych zasadach zarządzania. Sama konstrukcja, Z_N , jest dobra; Tylko jest brak odporności na brużdżenie. \nPozdrawiam.",
				"added": 1573868012
			},
			{
				"comment_id": 133,
				"body": "Wszystko się zgadza; Teksty mają porąbane, mówiąc krótko. Jak i swoje problemy. Odnoszę wrażenie czasami, że to są dzieciaki z podstawówki; ewentualnie pierwsza klasa liceum. Bo dorosły człowiek coś by napisał, albo jakoś by się odniósł do tego materiału; filmu?  Nie jest wykluczone, że jest to boot zatrudniony w tym procederze. Dlaczego??? Bo na poważne materiały, niema żadnej odpowiedzi? Czyli są cztery możliwości, mało ciekawy temat? niski poziom czytających? brak tych co czytają? brak dostępu do tych materiałów? Nikt ich nie widzi; Te materiały, tylko \"Ja\" je widzę!!! Jedna ważna sprawa; angielski to język niewolników, ma on być prosty, tak jak proste jest niewolnictwo na świecie. Nasz język, jest mocno rozbudowany, i posiada wiele możliwości; fonetycznych, gramatycznych, skrótów myślowych, zwrotów myślowych, składnia wyrazów użyta do budowy zdania, nasz język jest stary, i posiada bogate słownictwo;  Jego podrobić w naturalny sposób jest trochę trudno. Dlatego komunikacja w tym języku jest gwarancją na pewien poziom oryginalności, trudny do podrobienia. Tak tylko można zbudować zdania, w żywej głowie. Dlatego ja, zawsze nalegałem; piszemy w naszym języku. To jest trudny język dla reszty świata i nie zrozumiały ( trudno zrozumiały ). To my mamy do pogadania, na nasze własne tematy, a inni jak chcą brać w tym udział, niech nauczą się naszego języka. \nKiedyś pytałem ; jakie masz zdanie do polskich stron? Chodzi o tematy, i treści tam zawarte?\nPozdr.",
				"added": 1574051220
			}
		]
	},
	"comment_vote": {}
}