{
	"next_post_id": 8,
	"next_comment_id": 14,
	"next_follow_id": 7,
	"avatar": "jpg",
	"user_name": "Astringent",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1540240842,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1540240895,
			"body": "I'm a pedophile.\n\nI'm exclusively sexually attracted to prepubescent girls, generally between the ages of 5 - 11. \"Exclusively\" means I am not attracted to anyone else, male or female, in any age group, and cannot view them as potential romantic partners.\n\nI might occasionally talk about stuff here. I am not always very good at expressing myself, so please bear with me.",
			"date_added": 1540240893
		},
		{
			"post_id": 1540256837,
			"body": "The default response often looks like what @Colkurtz: had to say. Kill yourself, or expect someone to show up and do it for you. The most difficult part of having a conversation about pedophilia is this initial hump:\n\nI've got to prove to someone that I have a right to exist; that I'm a human being.",
			"date_added": 1540256834
		},
		{
			"post_id": 1540414940,
			"body": "Discord a few months back banned a pedophile peer support group from its servers. The group had strict policies on its members as far as code of conduct and abiding the law. When the group made attempts to reestablish itself, they were banned again and again.\n\nIts purpose was to reach out and talk to folks who were struggling and needed moral support. Most of its members were seriously depressed or suicidal: they needed someone to talk to.",
			"date_added": 1540414936
		},
		{
			"post_id": 1540850786,
			"body": "If it was possible to undergo some kind of procedure which would make me no longer a pedophile, I would not be willing to do it.\n\nIf it existed, I expect there would  be a huge push by western society to make having this procedure mandatory. Forcing people to go through with this hypothetical procedure would be rather unethical.\n\nWith that said, I have spoken with individuals who would not hesitate to go through such a procedure if it existed, even if there was a risk of nasty side effects.",
			"date_added": 1540850781
		},
		{
			"post_id": 1540858853,
			"body": "There's a \"Pedophile/Rapist Hitlist\" zeronet site which sounds like something designed to exacerbate hysteria and encourage vigilante action against people while circumventing the criminal justice system that society has established to judge and punish wrongdoers.\n\nI tried visiting the site out of morbid curiosity. It doesn't load fully yet for me. However, according to the content.json file, there is a js/coinhive.min.js file that is deployed on the site. Visiting the site will begin generating some kind of cryptocurrency for whoever operates it. It seems they hope to profit off of the hysteria they are encouraging while they hamper the efforts of law enforcement and their justice system.\n\nLoading the site might be a bad idea for many reasons. I've deleted it and will no longer attempt to access it.",
			"date_added": 1540858847
		},
		{
			"post_id": 1542057925,
			"body": "When people tell me to \"get help\" I don't think there's any sincerity behind the literal meaning of that phrase (ie: they don't actually want me to receive help), but if they are sincere, I would be curious to know what they think getting help entails, or what kind of help is out there for waiting for me, or what it's supposed to help me with.",
			"date_added": 1542057918
		}
	],
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Thunder33345: I believe that the feelings of love will not just disappear simply because they are no longer a child. The feelings of love might wane in intensity, but I want to believe that I would still love them once they grow up. My physical attraction to their bodies would almost have to vanish completely, but I want to believe I would still feel a strong emotional connection to them as a person.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540240895",
			"date_added": 1540327503
		},
		{
			"comment_id": 2,
			"body": "@Thunder33345: The question is quite hypothetical, however. I don't anticipate ever finding myself in a position to test this out.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540240895",
			"date_added": 1540327594
		},
		{
			"comment_id": 3,
			"body": "@公共: That does not sound realistic, and I have not heard of it before. I would double check your sources. Also, marijuana is illegal in the United States on the federal level. Trump has made no move to legalize it, and I don't anticipate he will anytime soon.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540256837",
			"date_added": 1540327867
		},
		{
			"comment_id": 4,
			"body": "I think it is important to highlight the vitriol, whether it is displayed by trolls or by people with genuinely malicious attitudes. The people who express this hate are significantly hampering the ability to have difficult conversations in public. If we can't have public conversations, we can't reach any new conclusions or make any kind of social progress.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540256837",
			"date_added": 1540328190
		},
		{
			"comment_id": 5,
			"body": "@Styromaniac: I'm not worried about this type of procedure ever being possible, especially if theories regarding pedophiles having fundamentally different brain structures is true. I don't think such a procedure will be feasible in this century. However, I do worry about psychologists and law enforcers developing the ability to reliably identify someone with pedophilia using something as simple as facial tracking software, which might actually be very feasible. If society has this capability, I fear for how it might be used.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540850786",
			"date_added": 1540852215
		},
		{
			"comment_id": 6,
			"body": "@Styromaniac: False positives are innocent men or women who are not pedophiles, while true positives would still be innocent men or women who are pedophiles. Taking action against either group is equally wrong.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540850786",
			"date_added": 1540853779
		},
		{
			"comment_id": 7,
			"body": "@Astringent: Although \"innocent\" just means you have not violated a law, where an unjust legislative system can impose any number of laws to make someone who is innocent in 2018 a criminal in 2025.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540850786",
			"date_added": 1540853859
		},
		{
			"comment_id": 8,
			"body": "@Styromaniac: There appears to be two urls for it now. The second one says \"(Updated!)\" I found them both as recently listed in the \"Services\" tab on ZeroSites. The urls are /1PXUne5szFdu4di5EV4gy9Qo7p8tP5p1VX and /1KjLxJ6TfeRvrPX1LkUtkFLfTp4en7j9uf",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540858853",
			"date_added": 1541023122
		},
		{
			"comment_id": 9,
			"body": "@Realjohndoe: I believe that's what most of them really mean, but are just too afraid of saying it, so they substitute the words with something that they believe sounds more civil and polite. For others, I think they sincerely believe there is some kind of \"treatment\" which \"fixes\" people, and they do not like it when you challenge this assumption, because it does not make sense to them that such a procedure doesn't exist.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1542057925",
			"date_added": 1542062671
		},
		{
			"comment_id": 10,
			"body": "@Piloth: There isn't a specific thing about children that I find attractive. I could throw out various traits that capture my attention (physical beauty, the awkward carefree childlike way they carry themselves, their curiosity, the way that they smile). I think that the traits children have which register as \"cute\" to people, which we are meant to respond to with a parental style of affection, cause me to respond with parental affection as well as the romantic or sexual desires a normal man would feel for a sexually attractive woman.",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1542057925",
			"date_added": 1542077715
		},
		{
			"comment_id": 11,
			"body": "@Piloth: I strongly abhor violence and manipulation. Not everyone does, unfortunately. I don't think I'd be capable of doing something if i thought it was going to hurt someone...",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1542057925",
			"date_added": 1542078770
		},
		{
			"comment_id": 12,
			"body": "@Thunder33345: @Pexo: Their sincerity betrays their lack of awareness of how things actually work. Perhaps if they understood the state of psychology and the risks of seeing a therapist, they would not be so quick to tell someone to go get help. Besides that, I doubt any therapist has anything to offer. Also, it is almost always assumed that help is needed, but it is always phrased in a way that implies if one doesn't go get help they are going to harm a child. Help doesn't seem to be suggested as a course of action for a person's own sake. They want a pedo to get help so they don't hurt others, not so the pedo can achieve internal peace and become better as a person",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1542057925",
			"date_added": 1542152144
		},
		{
			"comment_id": 13,
			"body": "@Styromaniac: I'm not so certain. I know someone who had every one of his articles removed by Medium. Some perspectives are not allowed there.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1542119726",
			"date_added": 1542152391
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC",
			"user_name": "Pexo",
			"date_added": 1540240909
		},
		{
			"follow_id": 2,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX",
			"user_name": "Human Bean",
			"date_added": 1540240912
		},
		{
			"follow_id": 3,
			"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
			"auth_address": "1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj",
			"user_name": "Nofish",
			"date_added": 1540240916
		},
		{
			"follow_id": 4,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K",
			"user_name": "Thunder",
			"date_added": 1540242679
		},
		{
			"follow_id": 5,
			"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
			"auth_address": "1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB",
			"user_name": "Nekololi",
			"date_added": 1540242700
		},
		{
			"follow_id": 6,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1540242702
		}
	]
}