{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1615519854,
			"title": "Oh Noes, my ar15s and aks were just stolen !!!",
			"body": "it's really bad luck :).",
			"added": 1615519853
		},
		{
			"topic_id": 1615520898,
			"title": "Will there be a \"Putin\" in America?",
			"body": "I don't think so... There is a sense of nation in Russia that is beyond the Kremlin's control, call it the Russian soul... Russia has more than 245 years of history. For example the tale of Igor's Campaign was written almost 600 years before the creation of the usa :). (aka 3rd rome narrative (or reality^^) :D).\n\nWhat is the most surprising is the immorality of the american military and intelligence personals regarding pedogate. How are they tolerating this, is to me, really the clearest sign of a doomed nation. some said, feeding gmo was already pretty evil, following a depopulation agenda etc. anyway, you know the point.\n\nWhat I am curious about is when will so called global investors ( the muppets ) understand? I guess someone understood it way earlier, there is no hope from change from someone whose job/income stream depends on what is.\n\nThen I think there are many people in russia with various customs and co, but I don't think the relation between groups went ever as bad as in the usa. After all all russians are natives ! Truely, in the same sense as american indians were once upon a time.\n\nThen I am curious how many, or how few people in the world see the treason going on in the usa? I understand you could be afraid of words you don't control (dad, momy) or guns in the people hands, or elected representative or direct democracy or dry towns.\n\nI just despise those who raid occupied or taken over countries. be it those who attacked china, looted and raided russia post SU or lybia and co. I hope there will one day be a real true counter strike.\n\nBut maybe it's myself that I despise the most in all of this, to have fallen to the american so called patriot narrative. I am so dumb. And that's what's make me angry. To have been soo fooled. I would not even say that I had even a proof of intelligence.\n\nFacts, not narrative.",
			"added": 1615520896
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1615515631_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc": [
			{
				"comment_id": 1,
				"body": "the spread, my friend, the spread, cultural, economical, even legal... in my book, there are no americans no more. we are back into independence day war status... aka for the \"pedocoat\" we are rebels or terrorists (as they say themselves) but I guess we have now morphed to an alqueeda type of structure. Why have a leader they could pick to disarm or disorganize the resistance? hehehehe.\n\ntoo much sand boxing with the masters of insurgencies (afghans, sunnis...) to fall like fbi patsies wishes :)\n\ngood luck :).\n\nand even if you win, boy, what can you do? SOVIET ANTHEM :) // a problem at the chinese border? no... yet, at least !\n\nbye bye !",
				"added": 1615521103
			},
			{
				"comment_id": 2,
				"body": "I am just saying that the black \"elites\" are exactly like their white partners in crime... or maybe it's the whites who are like the blacks... aka bad people. ehehehe. but sadly, and true part, never saw a single black american of african descent to ever say a word about pedogate, poor, rich etc. never. none.\n\nI truely believe they find great that white girls were raped and relieved there were no black involved, be it on both side of the rapes. \n\nmaybe they fear the whites, maybe enjoyed it, but I am sure however, and that I respect and love much that if as many black kids were raped by whites in pedoislands, america would have burned to the ground, and rightly so, with my full support.\n\nmy hope was that some black would have extended their antislavery/domestication mindset to whites... but maybe the whites are too far gone in the corrals to turn around anymore.",
				"added": 1615521629
			},
			{
				"comment_id": 3,
				"body": "and don't forget for me there was a very strong difference between a SSN card vs the american founders ideals...",
				"added": 1615521792
			},
			{
				"comment_id": 4,
				"body": "ssn card = risk of being drafted for vietnam, to be clear.",
				"added": 1615521858
			},
			{
				"comment_id": 5,
				"body": "ohhh kanada! ohh kanada ! release meng!",
				"added": 1615521898
			}
		],
		"1615520898_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 6,
				"body": "For example, when a Soviet spy was arrested in the usa, never, american counter intelligence asked him/her where he was from... yes, from a specific part of russia. But that's it. Only God knows since a child of the motherland :). With american spies you can retrace... it's a nicer conversation warmer than \"you are raycist\" :D.",
				"added": 1615523486
			}
		]
	},
	"comment_vote": {}
}