{
	"next_avatar_id": 1,
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"topic_uri": "?Topic:1_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n/",
			"title": "Serious topics ...",
			"body": "There're very fine posts launched by very fine gentlemen, which deserve careful attention. \nThey'd be organized together step by step.\n\n[Can we get a regular userdata size limit increase? And true decentralization? ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di)",
			"image": "",
			"added": 1616063249
		},
		{
			"topic_id": 2,
			"topic_uri": "?Topic:2_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n/",
			"title": "An Incredible Legend! 不可思议的传奇! ",
			"body": "不可思议的传奇!\nAn Incredible Legend!\n\n沃尔夫•梅辛：能预知未来的斯大林私人魔法师\nhttps://new.qq.com/omn/20210306/20210306A0D25U00.html \n汉语的故事细节可适当看看，一些地方可能显得不可思议。\n\n汉语故事的最后一段话，值得留意。拥有超能力的人，往往有自知之明，不敢滥用超能力，非法谋利，否则会遭到神的惩罚！\n\n梅辛说：「我的任何能力都不能当作获取物质利益的一种超越手段。当然拥有这些能力的人──诚实的人，不会利用自己特别的能力大发横财，进行欺骗或犯罪。假如这样干了，他就不会取得成功。因为这样做的结局，最终……会遭到惩罚的报应……一定是这样！所以大家也不要羡慕！」\n\n汉语的故事有很多是真假难辨，让人难以相信的。\n\n但是，英文的故事就显得很严肃，结尾那一句，他的众多传奇故事还保留在克格勃档案里，而且克格勃特工也无法破解那些近乎神话般的谜团。\nWolf Messing: Stalin’s personal wizard \nhttps://www.rbth.com/arts/2014/04/16/wolf_messing_stalins_personal_wizard_34557 \n\n对于超级罕见的超能力，开头一句，把神话传奇和现实世界切割开来几乎不可能(separating legends and myths from reality is almost impossible)，因为太罕见了，用世俗的科学很难完全解释得清楚！\n再结合20世纪曾经出现过的另外一位科学界尼古拉•特斯拉的真实历史来看，沃尔夫•梅辛的故事应该是真的。他们可能不是一般的人类。一些人甚至认为尼古拉•特斯拉可能来自金星，因为特斯拉人工制造闪电、遥控闪电的超能力，是所有其他科学家都无法做到的，也是他们无法理解的，只能解释为近乎神灵般的能力。\n可是历史文件里的记述，当年观众经常看到特斯拉表演闪电、以及无线电传输表演，还以为制造闪电是很容易的事情。奇特的世界本身说明：科学和神学，很难完全切割开来。\nhttps://www.amazon.com/Wolf-Messing-Russia%60s-Greatest-Psychic-ebook/dp/B00KVII9GS \n亚马逊上关于梅辛的传奇故事的书籍，带有很多五星级好评，是梅辛生前的好友出版的著名书籍，证实沃尔夫•梅辛的传奇是真的！\n\nMagician, hypnotist, seer, psychic, Wolf Messing was a sort of Count Cagliostro, in terms of the mystery that surrounded him. Hitler was afraid of him, and Stalin and Beria took his words seriously. However, separating legends and myths from reality is almost impossible.\n\nWolf Messing was born in a Jewish shtetl in Poland in 1874, when it was still part of the Russian Empire. His parents wanted him to become a rabbi, and they sent him to a seminary. But Wolf was not as fond of the idea. He felt that he has another mission in life, and decided to escape. He ran off to the first train he could find and boarded. He didn’t have money for a ticket, so he hid underneath a bench to avoid the ticket inspector. But the inspector eventually found him, yanked him out from under the bench by his collar, and demanded a ticket. Wolf then handed him a piece of old newspaper. The inspector punched the paper and said: “You’re an odd duck, you know? Why are you hiding when you have a ticket?” This was the moment when Wolf realized he could manipulate people and alter their behaviour through the power of suggestion.\n\nThat train brought him to Berlin. At first he lived in poverty, washing dishes, shining shoes; starved to the point of fainting. Then he managed to get a gig at the circus. The acts he performed blew away his audiences and he quickly became popular. Only Messing could find hidden things, read minds, predict the future, and use the power of suggestion. And he did all of it without any trickery or the help of assistants. It wasn’t just magic tricks, but real miracle working and clairvoyance.\n\nOne day the circus stopped in Vienna while on tour. Two great scientists in attendance were interested in meeting the phenomenon Messing - Sigmund Freud and Albert Einstein. And so the three of them met up to do some experiments. Messing said to Freud: “Make a wish, and your wish is my command.” Then he came to Einstein, and pulled three hairs out of his mustache. “Is this what you wished for?” he asked, turning to Freud. “Yes,” Freud replied.\n\nMessing was a frequent traveler. His experiments attracted the interest of a variety of people. Those who visited him include Mahatma Gandhi, Marilyn Monroe, and Polish President Piłsudski. When Hitler came to power, Messing returned to Poland. There, in one of Warsaw’s theatres, he made his famous prophecy. Messing said: “If Hitler goes to war against the East, his death awaits him.” When the Fuhrer learned of Messing’s prophecy, he became infuriated. He announced a 200,000 Reichsmarks bounty on Messing’s head. The hunt was on. After the Nazis seized Warsaw, Messing was arrested by the Gestapo. The street patrol stopped him:\n\n- Who are you?\n\n- An artist.\n\n- You’re lying. You’re Messing. Let’s say hello to the Jewish magician! They’ve been waiting for you in Berlin.\n\nAnd then the patrol punched Messing in the mouth. He lost consciousness and woke up at the station. Thankfully, his gift saved him. He was able to mentally order the Gestapo to go into the cell. They obeyed and went inside, not understanding what they were doing. Then Messing locked them inside and escaped, running off towards the Soviet border.\nRead section: History\n\nThey were well aware of him in the Soviet Union. Stalin sent him a private jet and ordered him to be delivered to the Kremlin. Accompanying Messing, were NKVD men in uniform.\n\n— Show me what you can do, — said Stalin. — Come visit me tomorrow out at my country-house. It’s simple. Judging by your reputation, you won’t even need a permit.\n\nThe next day, Messing passed unabatedly through all the security checks to Stalin's country-house. He convinced the guards that he was Commissioner General of State Security Beria, and thus he was able to pass through all the cordons.\n\nThe next test was more difficult. Stalin ordered Messing to go the state bank and take out one hundred thousand roubles, just like that, without a single document. When the day came, Messing drove to the central bank, entered the room, showed the cashier a blank sheet of paper and asked him to give him one hundred thousand roubles. The cashier did everything he asked. The magician put the money in the briefcase and returned to the Kremlin.\n\nIt is not known whether Mikhail Bulgakov had heard about Messing; it is likely though. However, in general, all these tricks were very similar to the ones Voland performs in ‘The Master and Margarita.’\n\nWhile in Russia, Messing did not cease to engage in prophecy. First, he predicted the impending outbreak of war, missing the mark by just one week. He also said that the war would start in the last decade of June 1941. Then, before the war, he said he had visions of Soviet tanks entering Berlin.\n\nHe and Stalin had a complicated relationship. Of course, Messing was not his personal magician, as is commonly believed. Stalin had no need for a court magician. Yes, it’s true that Messing could read minds, but Stalin himself already knew the thoughts of his entourage; and he kept his own thoughts carefully concealed from the rest. Therefore he had no need for a telepath and psychic. It is also unlikely that Stalin would have liked that someone could read his thoughts. They met, but just a few times.\n\nNevertheless, Messing had an impact on Stalin. They say that Stalin was even afraid of him. The legend goes that when Messing secretly made his way out to Stalin’s country-house in March 1953, Stalin asked him:\n\n- So you can predict the future, right? Well do you know when you are going to die?\n\n- After you, Comrade Stalin, – Messing responded.\n\n- That means you know when I am going to die?\n\n- Very soon.\n\nFrom the horror of this prophecy, Stalin’s eyes rolled back, his mouth fell agape, and his eyelids became heavy, just before collapsing onto the carpet.\n\nSurely this is legend. But it’s hard not to like the story of a wicked king dying at the hands of a good magician…\n\nOn the other hand, Messing couldn’t save himself with his spells. The last years of his life he spent seriously ill and terrified of death. When he was taken from his home to have an operation, he said, looking at his very portrait, “It’s over, Wolf. You’re never going to see this place again.”\n\nMessing died and his mystery has remained unsolved. Some say, classified documents related to Messing are still kept in the KGB archives. But none of the documents could surely explain his miracles.",
			"image": "",
			"added": 1616127794
		},
		{
			"topic_id": 3,
			"topic_uri": "?Topic:3_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n/",
			"title": "Pakistan Becomes Worse … after massive Vaccination",
			"body": "巴基斯坦总理以身试法，亲自接种中国疫苗，几天后确诊；叙利亚总统也一样，同时，智利和匈牙利在接种中国疫苗后确诊不降反升。\n柬埔寨总理洪森表示，柬埔寨不当试验场、疫苗垃圾桶！洪森暂时幸免于难。",
			"image": "",
			"added": 1616423440
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"4_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf": [
			{
				"comment_id": 1,
				"body": "Interesting message ...",
				"image": "",
				"added": 1613024195
			}
		]
	},
	"comment_vote": {}
}