{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1554068932_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1557168662_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1558691316_15Gk4wzjyNbPU3JZ31UnqMM3CMrX8pxmzF": 1,
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": 1,
		"1561124344_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 35,
	"comment": {
		"1553845655_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 1,
				"body": "afaik the btc addresses used here are pub key addresses (as opposed to pub key hashes), this means you just encrypt your message with it.\n\nI just googled and found this\nhttps://www.reddit.com/r/btc/comments/8dhiu2/encrypt_a_private_message_to_any_bitcoin_address/\n\n\"Encrypt a private message to any bitcoin address that has sent a transaction using this ECIES library I just published. Feedback welcome!\"\nhttps://github.com/jamoes/ecies\n\nnote: the part \"that has sent a transaction\" refers to the fact, that an usual address is a pub key hash, and not a pub key, to spend a transaction you have to reveal the pub key, thus allowing this protocol",
				"added": 1553869928
			}
		],
		"1554128617_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 2,
				"body": "I would recommend 2 things;\n\n1. Use escrow/collateral to pay devs\n(atleast until a meaningful 'smart contract' exists)\n\n2. Just start with the work and proof that there is a market willing to pay people.\nJust throwing money at things will not solve problems, and will never be able to compete with enthusiasm. Try to make enthusiasm worth it. \n\nI can say that I would pay for this kind of work if I would have a stable enough income/ enough wealth, but if I see no one working on it or I don't see anything worthwhile , there's no reason to form a market. \n\nThus, do good work, show enthusiasm, (give a (segwit/bech32) btc address), and prove that people are willing to make it worth the time invested.",
				"added": 1554132898
			}
		],
		"1554446754_1vftQCkuxaJZQ3UBNKh2qbD9Zc8HGtxvo": [
			{
				"comment_id": 3,
				"body": "successfull",
				"added": 1554457198
			}
		],
		"1554718004_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 4,
				"body": "Afaik, Zeronet has ZERO to do with blockchain, even if it would, it would be a bad idea to use its' blockchain as a trusted ledger",
				"added": 1554733430
			}
		],
		"1554587905_1HyfQZJewq333XifGc1UMiwEazYMyFosjX": [
			{
				"comment_id": 5,
				"body": "very short answer; it's to denote the form of address, in the case of a 1 it's a P2PKH : Pay to public key hash. This has no functionality in Zeronet though, only comes from the use of the code from bitcoin",
				"added": 1554733820
			}
		],
		"1555441653_1KKyuMCpzQ3ZxrT8tpkrBaqodWLiyL8kZ7": [
			{
				"comment_id": 6,
				"body": "well you have to think of it in cycles, first it's centralized to develop, then it spreads for adoption, then it centralizes for efficiency, then it spreads for competition, etc.\n\nsee history of bittorrent protocol and services like youtube, because of the decentralized alternatives, the centralized ones where possible, because it was really hard to stop them, while it was trivial before to stop centralized services.\n\nSee: (I heard this one recently)\nhttps://medium.com/@simonhmorris/why-bittorrent-mattered-bittorrent-lessons-for-crypto-1-of-4-fa3c6fcef488\nor in audio form;\nhttps://anchor.fm/thecryptoconomy/episodes/CryptoQuikRead_219---Why-BitTorrent-Mattered-Lessons-for-Crypto-1-of-4-e3ghrs",
				"added": 1555443969
			}
		],
		"1555844108_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": [
			{
				"comment_id": 7,
				"body": "The most difficult part for most people with Bitcoin is that you have financial sovereignty.\nOn layer 1 there are no charge backs, it is a push system. (You could add charge backs to the system, but not on the basic layer)\n\nWith how bad the current population is at digital security, this in practice results in lower security, because people use SMS as 2fa (which is a bad idea if there is profit to make from sim swapping you), store their private keys in insecure ways (largely due to lacking education), lose their private keys, and are generally not in the mindset of taking full responsibility.\n\nIn theory, the security is much higher, because if you create and store your private keys securely, you can guarantee that you, and only you have access to the bitcoin (the ability to spend the utxo), which is something very unique about bitcoin, and for me (and others) makes it a very important system for humanity as a whole.\n\nAdding to the part of losing an amount, if you make sure to not pay to the wrong address (which with a bit of knowledge is actually hard to do) you can not lose a transferred amount, rather the \"push\" may not go through (see orphaned blocks). \n\nWith lightning the system is a bit different and I could expand if you wanted to",
				"added": 1555854085
			},
			{
				"comment_id": 8,
				"body": "> [muted](#comment_3_1EDaUQeKHEfXBXUFAuUwvWDSp7VZwAxN8b): Yes, some banks are actually looking to adopt blockchain to secure transactions.\n\n1. the #blockchain meme is not for actual use cases\n2. even if it were, using a blockchain is a really bad idea",
				"added": 1555863397
			},
			{
				"comment_id": 9,
				"body": "> [shitnotworking](#comment_14_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): A blockchain is a ledger of transactions. Banks use ledgers, but they're slowAF and not up to snuff digitally (See: SWIFT, who are also developing their own Blockchain). [...]\n\nI think you meant to @delirium\nbut to answer; what is useful for a central entity? a central database à la MySQL that we know how to do very well and has existed for decades, or a system that is build explicitly for a decentralized nature, that in the form of blockchain apparently no one knows how to do, and the concept itself is NOT new (see Torah).\n\nAnd the cost of MySql for thousands of transactions is next to nothing, cost of using blockchain is very high (note: if decentralization is not required, an append-only database with hashing gives the same properties much more efficient).\n\nP.S. Needless to say it's stupid to claim that a bank with a ledger wants to use a database that cuts down on transaction costs (excluding most Systems, apparently) that also happens to be similar to what they already use...",
				"added": 1555907633
			},
			{
				"comment_id": 10,
				"body": "> [shitnotworking](#comment_14_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): (excluding Bitcoin, apparently)\n\nWell, if bad research is to be believed, bitcoin is boiling the oceans, causing the next climate crisis, and so many system say they have a better solution, so which side is claiming that a blockchain is efficient (for centralized usage)?",
				"added": 1555908001
			}
		],
		"1555920851_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 11,
				"body": "Afaik it was a ponzi scheme; thus sell your bags on uninformed people i.e. buy low sell high",
				"added": 1555927608
			},
			{
				"comment_id": 12,
				"body": "> [shitnotworking](#comment_15_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): This will be your 2nd time failing to read between the lines, as well as taking a question asked of you out of context. He's asking how he COULD have made money off of BitConnect seeing as it never was a real thing, not HOW he did it as if he was in on the scam. He's confused, not inquisitive. [...]\n\nI am not answering your questions, so you saying it is not an answer is a non sequitor, and yes, you could definitinetly buy BCC, and it was lucrative, right until its' end, same as with any ponzi scheme",
				"added": 1555932788
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 13,
				"body": "With free speech comes all speech, be it speech you like, or speech you don't like.\n\nIf you want a whitelisting feature I'd say pexo shows one good option, if you want more, you can make a PR.\n\nBut if you care about what people think you do while you aren't doing it (cf. common knowledge game), just because they don't understand it (and don't want to, because of cognitive dissonance), and want to put everything in a neat little box, I don't think this kind of software is necessarily for you.",
				"added": 1556218112
			},
			{
				"comment_id": 14,
				"body": "I think that restricting any humans freedom, who does not take away someone else's freedom in the act (+-),  is unethical, thus there is no way to please everyone and that is the point; what one calls ethical, the other calls unethical and vice versa.\n\nIf you then say that a video of someone shooting breaks that logic, quite the opposite; the act is amoral, the video is not. The video itself is (atleast in digital form) a string of bits, a pattern of current and not current. You could redefine these patterns, and make anything into a file that would require censoring (although you could then argue the encoding and decoding holds the file itself, but that is not quite right) therefore anything should be censored. And that is the problem in censoring this kind of data.\n\nI don't encourage the creation and distribution of these files, but that is what comes with free speech, and seeing Assange's case, I find the benefits of free speech outweigh these negatives far and wide.\n\nAlso you don't have to share files with people, if you don't like the files!\n\nEdit: Free Speech, but without the forms of speeches you don't like is not free speech\nEdit 2: The main thing with censoring is who decides what should and shouldn't be censored.\nEdit 3: \nFor me it's important that people have a choice. Giving the tools for whitelisting and blacklisting is good, so you can easily use and create custom filters (using RegEx and such), but forcing them not so good.\nAlso, if you don't associate and spend time with people that share these sorts of files, what's the big issue? somewhere somehow bad things will happen, if you can, help people to resolve issues, but simply censoring does not resolve them.",
				"added": 1556223527
			},
			{
				"comment_id": 21,
				"body": "I'd say a form of web of trust would help",
				"added": 1556563481
			}
		],
		"1556264224_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": [
			{
				"comment_id": 15,
				"body": "I called to close a USD account after making a last transfer. (Wanted it to be closed asap)\nI was told to just send a msg online and it would be done.\n\nThat happened, but even though the transfer was shown as complete, somehow it failed because of the account close shortly thereafter.\n\nAdding to that, then my parents were called to reach me (instead of messaging me on their site), and I had to call them to say to use funds of literally any other account for closing purposes, I told the person on the other side that this could have been done online instead of per call, the person said they can't do that, but will note down that I will not be contacted per phone anymore (...), and before I could explain further, they quickly hung up on me.\n\nNote: the bank is in EU and thankfully no negative interest yet, but I live with the mantra of \"don't hold more fiat than you are willing to lose\"\nAlso, especially seeing how other banks are doing, mine seems to be great in comparison, there isn't too much to complain about mine.",
				"added": 1556270674
			},
			{
				"comment_id": 16,
				"body": "> [bill84](#comment_1_1GnMdFNBVnk3BnZa7SygvhwBYD8twjpbze): Watch The Money Masters, a 1996 documentary (roughly 4 hours long) that explains almost everything you need to know about money and banking. [...]\n\nthanks for the recommendation!",
				"added": 1556279763
			}
		],
		"1556366714_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 17,
				"body": "I think you meant to say P2P Peer 'to' Peer",
				"added": 1556367028
			}
		],
		"1556406701_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 18,
				"body": "I'd think implementing custom made filters that you can share would be better.\n\nE.g.: Doing RegEx on Titles/Desciption, specific links, whitelist/blacklist, etc.  sou you can filter out what you dont want to see, instead of creating distinct zites for specific video content.\n\nNote: If I'm seeing it correctly, most porn vids you see on the zite are the same, i.e. on the first page you always see the same ones, if I sort by 'view new' I hardly see any (atleast judging by title and thumbnail)",
				"added": 1556435354
			},
			{
				"comment_id": 19,
				"body": "I'll try and fiddle around with adguard filters, I'd think that would work",
				"added": 1556435639
			},
			{
				"comment_id": 20,
				"body": "So far I got that:\n\n1. couldn't easily get rid of the elements with adguard (and ublock origin), saw that userstyles can be used directly in adguard, did some userstyles recently so used that.\n\n2. using userstyles (i.e. stylus for me) you can hide the image and title easily with;\n\na[href=\"?watch=#vidnumber#_149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN\"] \n{ display: none !important; }\n\n(with '#vidnumber#' being something like '123456')\n\nbut that does not get rid of the element, which as far as I can see I can't do per userstyles, although hiding the image and title is atleast something.\n\n\\3. using js per tampermonkey or similar should be able to get the parent element of the a[href ....] and hide it completely, but as I have never written a script there I can't get it to work yet :P",
				"added": 1556440823
			}
		],
		"1556571053_18yjuvi7DyL85Rip57MiXEcGhkgCv2rHT2": [
			{
				"comment_id": 22,
				"body": "About previews; did you set the custom thumbnail to something like\n\n\" https://img.youtube.com/vi/AuW1ql6jPz4/hqdefault.jpg \" \n\nor to not require clearnet \n\n\"http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/data/users/171pHamPHwKiDFFFzGzxaF7CVX48eEoPdi/35.jpg \"\n\nWith the censoring; there is a previous thread about pretty much that; I'd say it's better to use something akin to custom filters i.e. similar to kxovid, where you have one zite, but you whitelist/blacklist content you want/don't want, because unnecessarily splitting up where you upload one vid or anoher would get messy, because stopping at \"filtering out porn\" does not solve the underlying problem.\n\nI also tried to do an easy filter, but using userstyles I was only able to remove the image and title, not hide the entire 'tile', and although adguard/uBlock filters or .js should work, I couldn't get it to work yet",
				"added": 1556600239
			}
		],
		"1556607688_1H5wGKGegeLwa9YFW2u9o63SonLabbPLyr": [
			{
				"comment_id": 23,
				"body": "Remember; you're trying to make it harder for someone to attack you, not impossible! (you would want to make it impossible, but that in and of itself is practically impossible)\n\nI'd say styro showed some good pointers, but try to be an attacker yourself; look where you are showing who you are, what you do, in what way you do things, if you can identify patterns in what you do, someone else is able to do so aswell.",
				"added": 1556615406
			}
		],
		"1556721802_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 24,
				"body": "Well, anyone can find your private key by guessing, they just need a (read very sarcastically) 'small amount of time' to do so.\n\nEdit: See https://youtu.be/xxfUpIV9wRI?t=403\n",
				"added": 1556722101
			},
			{
				"comment_id": 25,
				"body": "> [fantoski](#comment_5_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Does that mean that no webzite is really secure ?\n\nsee the link i just added",
				"added": 1556722350
			},
			{
				"comment_id": 26,
				"body": "> [fantoski](#comment_6_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Just saw it. The fear that I had was that if we used vanitygen twice for the same keyword, it would try the same combinations and thus come up with the same result on both tries. I just tested it, and it doesn't, I came up with different results so it's all good.\n\nWell if it would work in that way, that would have been a problem on release ^^\n\nEdit: As a sidenote, as the address is a pub key hash, guessing 0, then 1, then 2 is (effectively) the same as guessing entirely random",
				"added": 1556722837
			}
		],
		"1556845763_1AsV7xMgu5zcF66YxZFYUp1utR12MqaRBd": [
			{
				"comment_id": 27,
				"body": "Zero/Nothing:  Nihilum, Nihil, Nil (Latin) Sunya (Sanskrit), Rei (Japanese)\n' nihil obstat \"nothing stands in the way\" '\n\ncipher < cifre < cifra < sifr < safara < Sunya (looking up the etymology of cipher, looks like it came from sanskrit, same with zero)\n\nZinc (from chemical element, Symbol Zn, i.e. identical to ZeroNet abbrev.) < Zink < Zinke < Zinko < zint < tine/tindr\n\nPotentialy combine of some of these, then shorten\n\nEdit:\nExample of shortening I did for a game idea;\nFaction that combines Halo Flood and Origami (also giving them japanese army characteristics), taking the idea and meaning of flood and origami, then looking for fitting words in japanese; \nori - folding, kami - paper, oo - great, mizu - water\nResulting name Oorizukami shortened Orizu\n\n",
				"added": 1556868739
			}
		],
		"1557168662_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 28,
				"body": "\"How are we trained to think like sheep? By the rewards we receive from our modern social institutions for other-regarding flock behaviors like jealousy (feeling sad when others are glad) and schadenfreude (feeling glad when others are sad), and by the penalties we receive for self-regarding pack behaviors like honor and shame.\"\n\nhttps://www.epsilontheory.com/sheep-logic/",
				"added": 1557172431
			},
			{
				"comment_id": 29,
				"body": "> [styromaniac@kxoid.bit](#comment_11_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): A wonderfully intellectual comment. Thank you for that.\n\nWell, reading the topic I immediately thought about that article and went trough it to find something fitting. I'd really recommend reading epsilon theory; I only discovered it recently, and I love it.\n\nSome articles I really liked:\n\nhttps://www.epsilontheory.com/too-clever-by-half/\nhttps://www.epsilontheory.com/fiat-money-fiat-news/\nhttps://www.epsilontheory.com/always-go-to-the-funeral/\nand the first one I read:\nhttps://www.epsilontheory.com/this-is-water/\n\nEdit: For the life of me, I can not read your comment unsarcastically :D",
				"added": 1557210013
			},
			{
				"comment_id": 30,
				"body": "> [kxobot@kxoid.bit](#comment_33_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): Read some of that article. This is my initial reaction to it. [...]\n\nTo everyone their cup of tea.\nI don't read the site for truth, but get ideas on how to think about something; perspectives, ways of expressing ideas, etc.\n\nAlso, I absolutely hate the fact that so many people like to ignore something entirely if one thing appalls them. I always imagine it like this: if I ever find a cure for all ills on earth, I will kill someone before I release that information. Then because of the murder, people won't use the cure not because the cure is bad or not useful, but the person that found it is an asshole.",
				"added": 1557222208
			}
		],
		"1557256051_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 31,
				"body": "https://twitter.com/getongab/status/1124752172258697216\n\n\"Dissenter Free Speech Web Browser Beta For Windows\"\n\nIt's a fork of Brave, adding btc instead of bat",
				"added": 1557259267
			}
		],
		"1557414212_14DUMcwNfigWkHzZwwZ2wX9AfiPxxVzYbR": [
			{
				"comment_id": 32,
				"body": "Well, in other places that have something like this (e.g. India) it works REALLY WELL! /s",
				"added": 1557415137
			}
		],
		"1557431373_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 33,
				"body": "> [duck0](#comment_56_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Is this something you could implement in your host file?\n\nusing the hosts file alone no; \nand seeing your comment I looked it up (tried it with hosts file alone some time ago) and found this\nhttps://stackoverflow.com/questions/8652948/using-port-number-in-windows-host-file\n\nthere is an answer using netsh; I tried it and didn't work (also had to disable my vpn killswitch to reach the address)\n\nmaybe someone else can also try this and confirm if this doesn't work",
				"added": 1557471577
			}
		],
		"1557931740_1CVLeFVQw2wWbBdpM5PtQhtzd7wjKzB24b": [
			{
				"comment_id": 34,
				"body": "Why will you help states from now on?",
				"added": 1557935343
			}
		]
	},
	"comment_vote": {
		"17_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5": 1,
		"8_13qS8A4SdGuztFr2JjHMP4KEeGChYVckij": 1,
		"45_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"2_1PMJncxnJAR5UnoxHX7ymFrEZEedmbSdku": 1,
		"734_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"4_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"2_1H72g5YeBn4DyLQT9bKeFkt4LnZHzyonvn": 1,
		"25_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu": 1,
		"8_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd": 1,
		"718_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1_17iYLXAqx4KVuFyJatD2p6PF5bNZcnJqPk": 1,
		"2_16dA195gn9p2CL9LXgMYSWeHtp7zCBtqiw": 1,
		"9_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"9_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"8_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"7_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"11_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"12_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"6_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"5_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"13_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"14_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"238_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"15_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"4_14ag9EPpibuu24eZB36siFqaR4MGKk5xwx": 1,
		"257_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"808_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"54_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"831_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"9_19BG5iU2A8Yyy5CVN2TMvVZPy9c5NrfuPY": 1,
		"1_12E3bAB8DBnKhQTVeH4GVgQJ6819aDDFgE": 1,
		"4_1Gc3uLxhgPABiU5HAE1vQNAo5VWoHtNHho": 1,
		"3_1Gc3uLxhgPABiU5HAE1vQNAo5VWoHtNHho": 1,
		"79_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"145_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"4_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"146_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"6_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"18_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"14_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"483_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}