{
	"title": "Bad Programming",
	"description": "This blog shows the absolute best practices for doing programming.\n\nIn all seriousness, this is a cringe compilation of my bad code.",
	"links": "*   [The Author](/gauched.badprogramming.bit)\n*   [Source Code](https://github.com/HelloZeroNet)",
	"next_post_id": 7,
	"demo": false,
	"modified": 1499813812,
	"post": [
		{
			"post_id": 5,
			"title": "PSA: Backup content.db!",
			"date_published": 1499734482.941,
			"body": "Alright, so I got this message a few days ago when messing around with ZeroNet (a lot).\n\n![unknown.png (676x106)](data/img/screenshot_1.png)\n\nWell, that doesn't look too good. I messed up content.db somehow. I tried to fix it with no success, and in the end I gave up and setup ZeroNet again. I backed up my data folder and let ZeroNet run again. (I kept the important files like the keys and users.json) Then, I went back to the websites I commonly look at so I can seed them again, went onto WhiteHub, and made a long post complaining about losing my sites.\n\nIt gets worse. After going through the effort of updating the NameCoin domain, and setting everything up on the new sites, I remembered the private keys to the sites are in users.json. I didn't lose my sites... I was just a moron.\n\nThe moral of this ~~rant~~ story is to back up content.db, especially if you like to mess with ZeroNet as much as I do. ;-)"
		},
		{
			"post_id": 4,
			"title": "Registered the Domain!",
			"date_published": 1499181189.497,
			"body": "Finally, I have a ZeroNet URL that a regular human being can actually remember! The new URL is [badprogramming.bit](/badprogramming.bit). So, i'm quite happy.\n\nA good friend of mine also started his blog. _(Mainly because I forced him to.)_ Anyways, [here it is](/mocha.badprogramming.bit). I also made a [quick page for myself](/gauched.badprogramming.bit), so yeah.\n\nAlright, I guess I should actually start posting now."
		},
		{
			"post_id": 2,
			"title": "Finally, I started my blog!",
			"date_published": 1498428603.898,
			"body": "Alright, i'm still new to this, so I have some things to get used to.\n\nHowever, I plan on blogging _very_ soon.\n\nStay tuned!"
		}
	]
}