{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Manifesto da Guerrilha do Livre Acesso - Aaron Swartz",
			"body": "Informação é poder. Mas, como todo o poder, há aqueles que querem mantê-lo para\nsi mesmos. O patrimônio científico e cultural do mundo, publicado ao longo dos\nséculos em livros e revistas, é cada vez mais digitalizado e trancado por um\npunhado de corporações privadas. Quer ler as revistas científicas apresentando\nos resultados mais famosos das ciências? Você vai precisar enviar enormes\nquantias para editoras como a Reed Elsevier.\n\nHá aqueles que lutam para mudar esta situação. O Movimento pelo Acesso Aberto\ntem lutado bravamente para garantir que os cientistas não assinem seus direitos\nautorais por aí, mas, em vez disso, assegura que o seu trabalho seja publicado\nna Internet, sob termos que permitem o acesso a qualquer um. Mas mesmo nos\nmelhores cenários, o trabalho deles só será aplicado a coisas publicadas no\nfuturo. Tudo até agora terá sido perdido.\n\nEsse é um preço muito alto a pagar. Obrigar pesquisadores a pagar para ler o\ntrabalho dos seus colegas? Digitalizar bibliotecas inteiras mas apenas\npermitindo que o pessoal da Google possa lê-las? Fornecer artigos científicos\npara aqueles em universidades de elite do primeiro mundo, mas não para as\ncrianças no sul global? Isso é escandaloso e inaceitável.\n\n“Eu concordo”, muitos dizem, “mas o que podemos fazer? As empresas que detêm os\ndireitos autorais fazem uma enorme quantidade de dinheiro com a cobrança pelo\nacesso, e é perfeitamente legal – não há nada que possamos fazer para detê-los.”\nMas há algo que podemos, algo que já está sendo feito: podemos contra-atacar.\n\nAqueles com acesso a esses recursos – estudantes, bibliotecários, cientistas – a\nvocês foi dado um privilégio. Vocês começam a se alimentar nesse banquete de\nconhecimento, enquanto o resto do mundo está bloqueado. Mas vocês não precisam –\nna verdade, moralmente, não podem – manter este privilégio para vocês mesmos.\nVocês têm um dever de compartilhar isso com o mundo.  E vocês têm que negociar\nsenhas com colegas, preencher pedidos de download para amigos.\n\n\nEnquanto isso, aqueles que foram bloqueados não estão em pé de braços cruzados.\nVocês vêm se esgueirando através de buracos e pulando cercas, libertando as\ninformações trancadas pelos editores e as compartilhando com seus amigos.\n\nMas toda essa ação se passa no escuro, num escondido subsolo. É chamada de roubo\nou pirataria, como se compartilhar uma riqueza de conhecimentos fosse o\nequivalente moral a saquear um navio e assassinar sua tripulação. Mas\ncompartilhar não é imoral – é um imperativo moral. Apenas aqueles cegos pela\nganância iriam negar a deixar um amigo fazer uma cópia.\n\nGrandes corporações, é claro, estão cegas pela ganância. As leis sob as quais\nelas operam exigem isso – seus acionistas iriam se revoltar por qualquer\ncoisinha. E os políticos que eles têm comprado por trás aprovam leis dando-lhes\no poder exclusivo de decidir quem pode fazer cópias.\n\nNão há justiça em seguir leis injustas. É hora de vir para a luz e, na grande\ntradição da desobediência civil, declarar nossa oposição a este roubo privado da\ncultura pública.\n\nPrecisamos levar informação, onde quer que ela esteja armazenada, fazer nossas\ncópias e compartilhá-la com o mundo. Precisamos levar material que está\nprotegido por direitos autorais e adicioná-lo ao arquivo. Precisamos comprar\nbancos de dados secretos e colocá-los na Web. Precisamos baixar revistas\ncientíficas e subí-las para redes de compartilhamento de arquivos. Precisamos\nlutar pela Guerrilha pelo Acesso Aberto.\n\nSe somarmos muitos de nós, não vamos apenas enviar uma forte mensagem de oposição\nà privatização do conhecimento – vamos transformar essa privatização em algo do\npassado. Você vai se juntar a nós?\n\nAaron Swartz \n\nJuly 2008, Eremo, Italy ",
			"added": 1544019231
		}
	],
	"topic_vote": {
		"1_1AoYtY3DgkmAEdWKfR64TFL4fH6fctwrrM": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_1MVFLCBADF6YVCHtnbWN9vBTjQQQQKma9R": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1
	},
	"next_comment_id": 21,
	"comment": {
		"1_1AoYtY3DgkmAEdWKfR64TFL4fH6fctwrrM": [
			{
				"comment_id": 1,
				"body": "#Declaração de Berlim sobre Acesso Livre ao Conhecimento nas Ciências e Humanidades \n- https://web.archive.org/web/20170816063640/https://openaccess.mpg.de/67693/BerlinDeclaration_pt.pdf",
				"added": 1544019587
			},
			{
				"comment_id": 2,
				"body": "# Manifesto Brasileiro de apoio ao Acesso Livre à Informação Científica \n- https://web.archive.org/web/20180114074058/https://kuramoto.files.wordpress.com/2008/09/manifesto-sobre-o-acesso-livre-a-informacao-cientifica.pdf",
				"added": 1544019635
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "#Robin Hood A Origem 2018 Dublado\n- https://vcstream.to/embed/5c0685186ddc6/",
				"added": 1544025051
			},
			{
				"comment_id": 17,
				"body": "#O Apocalipse de João\nSINOPSE: 90 d.C. O Imperador Romano Domitian lançou uma campanha bárbara contra os cristãos. Mantido como refém pelos romanos na ilha de Patmos, o velho apóstolo João luta para salvar a Cristandade da extinção, enviando cartas às comunidades cristãs. Determinada pela vontade de conhecer a última testemunha viva da paixão de Cristo, a jovem cristã Irene consegue ter acesso à cela de João. Confiando-lhe suas anotações escritas de suas visões, João implora a Irene para que espalhe a mensagem entre os cristãos. Estas visões formam o conteúdo do Livro das Revelações. Para alguns, elas evocam o fim do mundo, para outros, apontam para as dificuldades espirituais que os cristãos enfrentam em todas as épocas.\n\n\n- https://youtu.be/8Z7XBIQNEyc",
				"added": 1544051524
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 4,
				"body": "#Determinando a Constante de Mills e uma Nota sobre o Problema de Honaker\n- https://web.archive.org/web/20181205161808/https://cs.uwaterloo.ca/journals/JIS/VOL8/Caldwell/caldwell78.pdf",
				"added": 1544026853
			},
			{
				"comment_id": 5,
				"body": "#Conjecturas\n- https://www.primepuzzles.net/problems/",
				"added": 1544027707
			},
			{
				"comment_id": 6,
				"body": "#Conjecturas e problemas abertos\nUma pequena lista de conjecturas e problemas em aberto relacionados a primos.\n- https://primes.utm.edu/notes/conjectures/",
				"added": 1544027790
			},
			{
				"comment_id": 7,
				"body": "#Calculadora de fatoração inteira\n- https://www.alpertron.com.ar/ECM.HTM",
				"added": 1544028216
			},
			{
				"comment_id": 8,
				"body": "#O novo livro de registros numéricos primos - Paulo Ribenboim\n\n\n- https://sci-hub.tw/10.1007/978-1-4612-0759-7",
				"added": 1544028823
			},
			{
				"comment_id": 9,
				"body": "#Selling Primes - Paulo Ribenboim\n- https://sci-hub.tw/10.2307/2691412",
				"added": 1544030127
			},
			{
				"comment_id": 10,
				"body": "#Em constelações admissíveis de primos consecutivos\nConstelações admissíveis de primos são padrões que, como os primos gêmeos, nenhuma relação de divisibilidade simples impediria de ser repetida indefinidamente na série de primos. Todas as constelações admissíveis, formadas de primos consecutivos, começando com um primo <1000, são estabelecidas, e algumas propriedades de tais constelações em geral são conjeturadas.\n- https://sci-hub.tw/10.1007/BF01941122",
				"added": 1544030370
			},
			{
				"comment_id": 11,
				"body": "#DEZ NÚMEROS PRIMOS CONSECUTIVOS EM PROGRESSÃO ARITMÉTICA\n- https://web.archive.org/web/20181205172511/http://www.ams.org/journals/mcom/2002-71-239/S0025-5718-01-01374-6/S0025-5718-01-01374-6.pdf",
				"added": 1544030787
			},
			{
				"comment_id": 12,
				"body": "#Algoritmo probabilístico para teste de primalidade\n\n- https://sci-hub.tw/10.1016/0022-314X(80)90084-0",
				"added": 1544030934
			},
			{
				"comment_id": 20,
				"body": "#Uma Introdução à Metafísica Matemática - Christopher Langan\n\n- https://web.archive.org/web/20181206005125/https://cosmosandhistory.org/index.php/journal/article/viewFile/618/1040",
				"added": 1544057562
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 13,
				"body": "#Fringe\nOs agentes do FBI Olivia Dunham e John Scott são chamados para investigar o caso de um avião que pousou no aeroporto de Boston com todos os seus passageiros e tripulação mortos de forma terrível. John quase morre durante a investigação e Olivia, desesperada, procura alguém que possa ajudá-la a resolver o caso. Parece que o brilhante Dr. Walter Bishop seria a pessoa certa para recorrer. Mas ele esteve numa instituição psiquiátrica durante os últimos 20 anos e a única maneira de interrogá-lo é através do seu filho, Peter Bishop, quem ele não vê há muito tempo. A investigação de Olivia acaba envolvendo diversos outros agentes do FBI e todos estão prestes a descobrir que o que aconteceu no vôo 627 é apenas a pequena parte de uma verdade muito mais chocante.\n\n- https://megaseriehd.com/series/fringe/",
				"added": 1544041562
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 14,
				"body": "#Teoria inovadora pode ter explicado a matéria escura\n- https://sci-hub.tw/10.1051/0004-6361/201832898",
				"added": 1544047243
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 15,
				"body": "#Conheça o local onde estavam as 7 igrejas citadas no Apocalipse\n- https://youtu.be/kdAtJZ2A2Y4",
				"added": 1544051106
			},
			{
				"comment_id": 16,
				"body": "#O Apocalipse de João\nSINOPSE: 90 d.C. O Imperador Romano Domitian lançou uma campanha bárbara contra os cristãos. Mantido como refém pelos romanos na ilha de Patmos, o velho apóstolo João luta para salvar a Cristandade da extinção, enviando cartas às comunidades cristãs. Determinada pela vontade de conhecer a última testemunha viva da paixão de Cristo, a jovem cristã Irene consegue ter acesso à cela de João. Confiando-lhe suas anotações escritas de suas visões, João implora a Irene para que espalhe a mensagem entre os cristãos. Estas visões formam o conteúdo do Livro das Revelações. Para alguns, elas evocam o fim do mundo, para outros, apontam para as dificuldades espirituais que os cristãos enfrentam em todas as épocas.\n\n\n- https://youtu.be/8Z7XBIQNEyc",
				"added": 1544051511
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 18,
				"body": "#Toriko\nA história de Toriko acontece num mundo imaginário aonde a comida é muito importante e está presente com abundância, desde a saborosa grama de uma ilha até o mais raro animal, cuja localização é de dificílimo acesso e que poucos conseguem encontrá-los, devido a exigência de enorme força física. O enredo se foca no Toriko, Bishokuya que pretende encontrar os mais raros alimentos para fazer o seu \"menu perfeito\". Bishokuya são expert em caçar os mais difíceis alimentos, são conhecidos mundialmente e admirados por todos, demonstram um grande respeito pelos alimentos encontrados em seu planeta. Em oposição aos Bishokuya, e consequentemente ao Toriko, estão os Bishokukai, uma organização criminosa que visa conseguir os melhores ingredientes da maneira mais ilícita possível e com total desrespeito para com a natureza e sua fauna e flora, dando origem a grandes batalhas entre Toriko e seus amigos contra esses malfeitores.\n- https://www.superanimes.site/anime/toriko",
				"added": 1544055390
			},
			{
				"comment_id": 19,
				"body": "#Saiki Kusuo No Psi-nan\nSaiki Kusuo tem uma grande variedade de poderes sob seu comando, incluindo telepatia e telecinese. Isso pode parecer incrível, mas na experiência de Kusuo, superpoderes não são tudo que deviam ser. Ele tenta ter uma vida normal, apesar de suas habilidades irritantes.\n\n- https://www.superanimes.site/anime/saiki-kusuo-no-psi-nan",
				"added": 1544055415
			}
		]
	},
	"comment_vote": {}
}