{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1594225869_1FYnqRnNx4xbmec3dhwMaq1aE8WCqAVPHL": [
			{
				"comment_id": 1,
				"body": "In short: find a job.\nThis can be \"legal\" things like doing freelancing on something like Fiverr (idk if there's a similar thing here on ZeroNet), creating software (like I do) and making videos or \"less legal\" things like others have already mentioned (like well... selling drugs...), which involved more risk.\n\nHonestly, if we all had this \"one simple trick to make money easy\", nobody would have financial problems (or maybe everyone would have them... cus you know... inflation...)",
				"added": 1594335667
			}
		],
		"1594178844_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 2,
				"body": "This really depends on local law though.  \nIn most places (like The Netherlands), it is technically speaking illegal to rip a DVD as you are breaking the \"protection\" that is in place that was meant to prevent copying.\nSure, it was horrible and court will probably laugh pretty badly at it as well but legally speaking, ripping DVDs is illegal *if* it is illegal to break protections on the content, how bad the protection may be.",
				"added": 1594336091
			}
		],
		"1594345782_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Idk, They all load pretty fast here actually.\nMaybe there is something going on at your site? (do you use TOR for all connection?)",
				"added": 1594378789
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2464_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Sites are stored locally, so TOR can't be the issue. I think the bottleneck is complex JavaScript. Sorry I didn't clear up what I meant sooner.\n\nOh, I didn't read the title properly (idk if you changed it?) but yea... after it's already downloaded, it's likely the complex JS as well as the speed of the storage.\nThough I do think there is more to it than _just_ the JS (think about the underlying cryptography n such).\nIdk, I think there are a lot of variables at play.",
				"added": 1594382350
			}
		],
		"1598284608_1BLVwi9JNkkMYG2udnf6jSH6V5St8iTY6Q": [
			{
				"comment_id": 5,
				"body": "If you could, it'd be patched in a day cus everyone would use it.",
				"added": 1598627242
			}
		],
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": [
			{
				"comment_id": 6,
				"body": "I mean, it's something :)",
				"added": 1598627696
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 7,
				"body": "Ah yes, for \"hate speech\", because Twitter and Facebook have _none_ of that of course.",
				"added": 1598783116
			}
		]
	},
	"comment_vote": {
		"54_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"53_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": 1
	}
}