{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1528170453_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 1,
				"body": "There must be also set ControlPort which is 9051 by default",
				"added": 1528365321
			},
			{
				"comment_id": 2,
				"body": "Also I had to set owner for /opt/zeronet and /etc/zeronet.conf in order to start zeronet as a systemd service like this:\n#chown -R zeronet:zeronet /opt/zeronet\n#chown zeronet:zeronet /etc/zeronet.conf",
				"added": 1528365462
			},
			{
				"comment_id": 4,
				"body": "If you still have trouble with it you can authenticate to a tor with a password\nTo do so you should run\n#tor --hash-password <your super secret password>\nto recieve hash\nthen in /etc/torrc you can set\n#HashedControlPassword <your_hash>\nand then set password in your /etc/zeronet.conf like this\n#tor_password = <your super secret password>\nthen restart tor and then restart zeronet.",
				"added": 1528373339
			},
			{
				"comment_id": 5,
				"body": "> [chandelier](#comment_33_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8): I have just asked this question several days before\n\nI am exactly two days in zeronet so I did not see your question before",
				"added": 1528376116
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "Test",
				"added": 1528366630
			}
		],
		"1528352699_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "If you do not value your life - why should I?\nIf you want to finish it because of \"stress, depression and anxiety\" - why anything around matter?\nWhy do you wnat to finish something before you die if your life does not matter any more?\nYou either coward and your words of death is bullshit or a lier and an attentionwhore.\nHomophobia is a reason to kill yourself? Not for me.\nThe war on drugs? Do not make me laugh.\nThe violence in gaza? I am the violent son of a bitch and I know the value of violence. I cannot deny it is necessity sometimes.\nTeleevangelists? Fuck them with their private jets. I do not care.\nI have my work to do and my own space. If I cannot find a way to fill my own space with something I like then I just did not tried all the possibilities.\n\nAnyway. I live in ex-USSR republic and I had seen some sht in my life. I am a programmer or coder or sysadmin and I am sure there is no god except my own will. There is no language of the Universe just the one I speak with and there is no drama in my life if I do not create it with my own thoughts and actions.\n\nIf you decided to die - fuck you. I do not care if another religious idiot dies. No matter if he is also code.\n\nIf you think programming makes me consider you smart - think again.\n\nI do not care if you die or live. The only thing I care about you is can you become a descent (not another narcissic drama queen) person to chat with. And I think you just have no guts do make it.",
				"added": 1528388484
			}
		],
		"1528353432_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "You are naive.\nThere is no cure for homosexuality or pedophilia.\nIt is not some kind of psychic disorder.\nYou should learn mor on human sexuality before trying to cure something like this.",
				"added": 1528403795
			},
			{
				"comment_id": 8,
				"body": "> [thebigman](#comment_1_1Jhso1pp8VNBQJBFuU7AjKC6NYdxsYLTHx): krak, you sir are an idiot.  Pedophilia is where wires in your brain get crossed.  It is a literal Mental Disorder, whereas homosexuality is due to inferior genes.\nIf it is a mental disorder then why it persistent whole life like other sexual orientations and starts in pubertal age like other sexual orientation development? Why there is more-less stable percent of paedophiles just like homosexuals?\nIt is debatable what padophilia is and what should zeronet members do with it.\nAnd no need to label others idiots unless you have a medical degree and are able to fundamentally proove your words (inb4: you don't)",
				"added": 1528871236
			}
		],
		"1528776246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "1. Drugs is still bad for you as well as a participation in any war. Do not do drugs. That's all.\n2. Corporate greed cannot be fought without destroying and re-creating whole capitalism concept. As well as the monopolies. Capitalism is not kind to people but still it is more effective than any version of communistic bullshit. Capitalism is based on greed and humans are greedy. You cannot make a cow fly.\n3. Fuck off. Most of so called evangelists and enterpreneurs are just failed specialists that try to teach others something they cannot do themselves.\n4. The only thing to agree with. It is good for your to understand how software works inside. Still it is not necessary.\n5. Do not mix hackers with linux. And do not presume hackers do have some common culture. They don't. \n6. Fuck gender studies. They are used to pervert psychology into leftist propaganda. And fuck leftists too.\n7. Go learn psychology basics instead. Partial knowledge is worse than no knowledge at all.\n8. Agree. Especially in case if leftists will abanon usage of identity politics. And they will not.\n9. Fuck silent thankless heroism. It is fictional and does not exists in human society.\n10. Shut up unless you are able to understand the basics of artificial intelligence\n11. Same with automation\n12. Basic income is doubtful and poorly developed concept\n13. My gender is none of your business. As well as what I should do with my walks and talks.\n14. Self respect is not just clean body and teeth. It is also a clean mind. Do not let any propaganda to infect your thoughts. Check facts before embracing anything based on them.\n\nSomehow important:\n\nIf you cannot get a job it means you had not try hard enough. If you are ok when somebody else pays for your food and other basic needs - good for you. But you are still worthless scum unless you do create something worthy.\n\nLast one is the only one I agree with completely.",
				"added": 1528873247
			}
		],
		"1529033869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "For me the whole thing looks like you better like to talk about one fictional shit than another.\n\n\"Fighting oppression\" is like fighting any other abstract idea. Do it if you are out of real things to do but do not expect me to respect you or your friends or your thoughts based purely on nonesence.\n\"Empowering yourself with knowledge\" is another way to do nothing real.",
				"added": 1529405343
			}
		],
		"1529288071_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 11,
				"body": "I am to lazy to read through your reddit https://www.reddit.com/user/GreyTI",
				"added": 1529405714
			}
		],
		"1529472127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": ">eliminate suffering, enhance our feelings of pleasure and happiness\nWhy?\nHad you ever read about rats neurostimulation research?\nEliminating suffering means elimination reasons to develop and focusing on getting pleasure only.\nThis works same as drugs and drugs have not yet proved to be a path to singularity or consciousness inprovement.\n\nSuffering is a powerful stimulus for development and progress. If you purge it will lead humanity to degradation and extinction",
				"added": 1529652484
			}
		],
		"1533155696_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 13,
				"body": "exisistencialism is a poisonous",
				"added": 1533206982
			}
		],
		"1534274094_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": ">we all heal\nImposing we all sick?",
				"added": 1534324174
			},
			{
				"comment_id": 15,
				"body": "Still I do not see how men are sick through all of this and how they are should heal.\nAnd I think your article is pretty bad. You may consider writing another one with less links and more words. And with better grammar. And with less pictures and better pictures placing.",
				"added": 1534327384
			}
		],
		"1534333715_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 16,
				"body": "Did Mike Naya filmed some true facts of someone's illegal actions? Yes he did.\nDid he reported them to a police **before** making video of them? I do not know.\nIf police was unaware of these facts - shame on Mike.\nIf police was aware and was able to do something about it but did nothing - shame on police.\nIf police was aware but was unable to do something about it legally - shame on lynching mob.",
				"added": 1534340115
			}
		],
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 17,
				"body": "> [sub01](#comment_1_1MC71KUzeWiA7NK7SogCzd4SivZdLYRYaj): There's no such thing as \"illegal speech\".  Speech \"...neither picks my pocket nor breaks my leg\" so there can't be any secular laws prohibiting it.  The only form of speech which might fall under secular purview is to falsely accuse someone as in a court of law. [...]\n\nAgree. There is no such thing as illegal speech.\nBut there is no good reasons to keep someone's speech available on your server if you think it is crap. Youtube owners decided that they had enough of this crap and banned this idiot from their service.\nStill Alex Jones benefits from this ban more than google so now he can tell his \"I told you!\".",
				"added": 1534341886
			}
		],
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 18,
				"body": "It looks as a bullshit\nVersion control systems like gitlab are already here as well as databases with snapshot systems and this one feels like salesmen shitting in your ears",
				"added": 1539116213
			}
		],
		"1538552691_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": [
			{
				"comment_id": 19,
				"body": ">you rather not be associated or\nassociate the libertarian movement with him\nExactly.\nHe is a drug dealer and drugs are opposite to freedom",
				"added": 1539116478
			}
		]
	},
	"comment_vote": {}
}