{
	"message": [
		{
			"body": " bladesofsorrow: you talk like a spoilt child. networks like zeronet, Tor, i2p, Freenet & others are not an amusement park, they endeavor to provide the technical infrastructure to enable netizens to have a online voice/presence & the freedom to express themselves when to do so in their own country will get them totured/dead/imprisoned/imprisoned indefintely & totured/disappeared. If you miss the 'excitement' then run back to the clear net & it will welcome you with open arms :) ",
			"date_added": 1550406235900
		},
		{
			"body": "so many people visit zeronet/Tor/i2p/freenet etc already brainwashed with childish expectations of what they think they should be able to find here. \"Show me the guns\" \"Show me the drugs\" \"Show me something I can't find on the clear net.\" \"Entertain me with links to abnormal human behaviour\", etc",
			"date_added": 1550406652400
		},
		{
			"body": "Social conditioning by the media & politicians etc is designed to make censorship resistant networks appear to be only for the purposes of illegal activities. Meanwhile, the right to freedom of speech is being crushed & now also in many European countries too! However, the rapid momentum to crush freedom of speech & also freedom of movement is equally present in the meat space. ",
			"date_added": 1550406964400
		},
		{
			"body": "It must be understood that in many countries in Europe & beyond, we're entering the last days of freedom of movement & freedom of protest in the meat space, with the proliferation of military hardware & mass surveillance technology that will be utilised by police forces internationally. The surveillance grid will be excelerated by the advent of 5G & AI-Based computer systems & surveillance drones with vastly improved camera technology & this will almost completely end free movement & therefore free mass protest within the next 5-10 years. ",
			"date_added": 1550407325400
		},
		{
			"body": "When free movement & mass street protests have been shut-down by the technolgy-led police forces of Europe & beyond the only available option for protest of any length of time will be Internet-based protest. Zeronet, i2p, Tor & Freenet & possibly other networks will be available for the people to gather to safely & securely share our thoughts & feelings & strategies for Internet-based protest in all it's myriad forms. ",
			"date_added": 1550407600700
		},
		{
			"body": "At the present time many people are waking up to the reality that they would prefer to have a safe place to meet & socialise online that doesn't expose them to corporate data-rape & the wholesale collection of their meta-data et al to be scrutinzed at a later date by the emerging AI technologies. Those peoples are also very welcome in this place. ",
			"date_added": 1550407789800
		},
		{
			"body": "It's feasible history will show that the development of cenosrship resistant internet networks in the early 21 century laid the crucial foundations for the subsequent Internet-based resistance to the theft of our indvivdual liberties & sovereignty as individual citizens & entire nations.",
			"date_added": 1550408139900
		},
		{
			"body": "Rather than visiting networks like zeronet & making statements like it's 'boring' or 'sucks' try instead to educate yourself to understand that many of these networks are *still in developement* & even Tor/i2p/Freenet are also *still in development* 15 years +",
			"date_added": 1550408306200
		},
		{
			"body": "Instead: educate yourself on why these networks have become necessary, how you could contribute in some way to help the networks evolve & grow. Time will tell the precious & critical role censorship resistant networks will play in the facilitating free (indpendent) speech & action as the 21 century progresses.",
			"date_added": 1550408567200
		},
		{
			"body": "May The F0rce be with You",
			"date_added": 1550408753700
		}
	]
}