{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565251237_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 1,
				"body": "> [nickwa](#comment_326_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): https://www.kron4.com/news/bay-area/pedestrian-struck-killed-in-san-francisco-3/ I know this happened.\n\nfucking EU laws...",
				"added": 1565592624
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 2,
				"body": "Descriptive terms which people use are often quite misleading. In talking about modern captains of industry and leaders of big business, for instance, they call a man a \"chocolate king\" or a \"cotton king\" or an \"automobile king.\" Their use of such terminology implies that they see practically no difference between the modern heads of industry and those feudal kings, dukes or lords of earlier days. But the difference is in fact very great, for a chocolate king does not rule at all; he serves. He does not reign over conquered territory, independent of the market, independent of his customers. The chocolate king — or the steel king or the automobile king or any other king of modern industry — depends on the industry he operates and on the customers he serves. This \"king\" must stay in the good graces of his subjects, the consumers; he loses his \"kingdom\" as soon as he is no longer in a position to give his customers better service and provide it at lower cost than others with whom he must compete.\n\nTwo hundred years ago, before the advent of capitalism, a man's social status was fixed from the beginning to the end of his life; he inherited it from his ancestors, and it never changed. If he was born poor, he always remained poor, and if he was born rich — a lord or a duke — he kept his dukedom and the property that went with it for the rest of his life.\n\nAs for manufacturing, the primitive processing industries of those days existed almost exclusively for the benefit of the wealthy. Most of the people (90 percent or more of the European population) worked the land and did not come in contact with the city-oriented processing industries. This rigid system of feudal society prevailed in the most developed areas of Europe for many hundreds of years.\n\nHowever, as the rural population expanded, there developed a surplus of people on the land. For this surplus of population without inherited land or estates, there was not enough to do, nor was it possible for them to work in the processing industries; the kings of the cities denied them access. The numbers of these \"outcasts\" continued to grow, and still no one knew what to do with them. They were, in the full sense of the word, \"proletarians,\" outcasts whom the government could only put into the workhouse or the poorhouse. In some sections of Europe, especially in the Netherlands and in England, they became so numerous that, by the 18th century, they were a real menace to the preservation of the prevailing social system.\n\nToday, in discussing similar conditions in places like India or other developing countries, we must not forget that, in 18th-century England, conditions were much worse. At that time, England had a population of 6 or 7 million people, but of those 6 or 7 million people, more than 1 million, probably 2 million, were simply poor outcasts for whom the existing social system made no provision. What to do with these outcasts was one of the great problems of 18th-century England.\n\nAnother great problem was the lack of raw materials. The British, very seriously, had to ask themselves this question: What are we going to do in the future, when our forests will no longer give us the wood we need for our industries and for heating our houses? For the ruling classes it was a desperate situation. The statesmen did not know what to do, and the ruling gentry were absolutely without any ideas on how to improve conditions.\n\nOut of this serious social situation emerged the beginnings of modern capitalism. There were some persons among those outcasts, among those poor people, who tried to organize others to set up small shops which could produce something. This was an innovation. These innovators did not produce expensive goods suitable only for the upper classes; they produced cheaper products for everyone's needs. And this was the origin of capitalism as it operates today. It was the beginning of mass production, the fundamental principle of capitalistic industry. Whereas the old processing industries serving the rich people in the cities had existed almost exclusively for the demands of the upper classes, the new capitalist industries began to produce things that could be purchased by the general population. It was mass production to satisfy the needs of the masses.\n\nThis is the fundamental principle of capitalism as it exists today in all of those countries in which there is a highly developed system of mass production: Big business, the target of the most fanatic attacks by the so-called leftists, produces almost exclusively to satisfy the wants of the masses. Enterprises producing luxury goods solely for the well-to-do can never attain the magnitude of big businesses. And today, it is the people who work in large factories who are the main consumers of the products made in those factories. This is the fundamental difference between the capitalistic principles of production and the feudalistic principles of the preceding ages.\n\nWhen people assume, or claim, that there is a difference between the producers and the consumers of the products of big businesses, they are badly mistaken. In American department stores you hear the slogan, \"the customer is always right.\" And this customer is the same man who produces in the factory those things which are sold in the department stores. The people who think that the power of big business is enormous are mistaken also, since big business depends entirely on the patronage of those who buy its products: the biggest enterprise loses its power and its influence when it loses its customers.\n\nFifty or 60 years ago it was said in almost all capitalist countries that the railroad companies were too big and too powerful; they had a monopoly; it was impossible to compete with them. It was alleged that, in the field of transportation, capitalism had already reached a stage at which it had destroyed itself, for it had eliminated competition. What people overlooked was the fact that the power of the railroads depended on their ability to serve people better than any other method of transportation. Of course it would have been ridiculous to compete with one of these big railroad companies by building another railroad parallel to the old line, since the old line was sufficient to serve existing needs. But very soon there came other competitors. Freedom of competition does not mean that you can succeed simply by imitating or copying precisely what someone else has done. Freedom of the press does not mean that you have the right to copy what another man has written and thus to acquire the success which this other man has duly merited on account of his achievements. It means that you have the right to write something different. Freedom of competition concerning railroads, for example, means that you are free to invent something, to do something, which will challenge the railroads and place them in a very precarious competitive situation.\n\nIn the United States the competition to the railroads — in the form of buses, automobiles, trucks, and airplanes — has caused the railroads to suffer and to be almost completely defeated, as far as passenger transportation is concerned.\n\nThe development of capitalism consists in everyone's having the right to serve the customer better and/or more cheaply. And this method, this principle, has, within a comparatively short time, transformed the whole world. It has made possible an unprecedented increase in world population.\n\nIn 18th-century England, the land could support only 6 million people at a very low standard of living. Today more than 50 million people enjoy a much higher standard of living than even the rich enjoyed during the 18th-century. And today's standard of living in England would probably be still higher, had not a great deal of the energy of the British been wasted in what were, from various points of view, avoidable political and military \"adventures.\"\n\nThese are the facts about capitalism. Thus, if an Englishman — or, for that matter, any other man in any country of the world — says today to his friends that he is opposed to capitalism, there is a wonderful way to answer him: \"You know that the population of this planet is now ten times greater than it was in the ages preceding capitalism; you know that all men today enjoy a higher standard of living than your ancestors did before the age of capitalism. But how do you know that you are the one out of ten who would have lived in the absence of capitalism? The mere fact that you are living today is proof that capitalism has succeeded, whether or not you consider your own life very valuable.\"\n\nIn spite of all its benefits, capitalism has been furiously attacked and criticized. It is necessary that we understand the origin of this antipathy. It is a fact that the hatred of capitalism originated not with the masses, not among the workers themselves, but among the landed aristocracy — the gentry, the nobility, of England and the European continent. They blamed capitalism for something that was not very pleasant for them: at the beginning of the 19th century, the higher wages paid by industry to its workers forced the landed gentry to pay equally higher wages to their agricultural workers. The aristocracy attacked the industries by criticizing the standard of living of the masses of the workers.\n\nOf course, from our viewpoint, the workers' standard of living was extremely low; conditions under early capitalism were absolutely shocking, but not because the newly developed capitalistic industries had harmed the workers. The people hired to work in factories had already been existing at a virtually subhuman level.\n\nThe famous old story, repeated hundreds of times, that the factories employed women and children and that these women and children, before they were working in factories, had lived under satisfactory conditions, is one of the greatest falsehoods of history. The mothers who worked in the factories had nothing to cook with; they did not leave their homes and their kitchens to go into the factories, they went into factories because they had no kitchens, and if they had a kitchen they had no food to cook in those kitchens. And the children did not come from comfortable nurseries. They were starving and dying. And all the talk about the so-called unspeakable horror of early capitalism can be refuted by a single statistic: precisely in these years in which British capitalism developed, precisely in the age called the Industrial Revolution in England, in the years from 1760 to 1830, precisely in those years the population of England doubled, which means that hundreds or thousands of children — who would have died in preceding times — survived and grew to become men and women.\n\nThere is no doubt that the conditions of the preceding times were very unsatisfactory. It was capitalist business that improved them. It was precisely those early factories that provided for the needs of their workers, either directly or indirectly by exporting products and importing food and raw materials from other countries. Again and again, the early historians of capitalism have — one can hardly use a milder word — falsified history.\n\nOne anecdote they used to tell, quite possibly invented, involved Benjamin Franklin. According to the story, Ben Franklin visited a cotton mill in England, and the owner of the mill told him, full of pride: \"Look, here are cotton goods for Hungary.\" Benjamin Franklin, looking around, seeing that the workers were shabbily dressed, said: \"Why don't you produce also for your own workers?\"\n\nBut those exports of which the owner of the mill spoke really meant that he did produce for his own workers, because England had to import all its raw materials. There was no cotton either in England or in continental Europe. There was a shortage of food in England, and food had to be imported from Poland, from Russia, from Hungary. These exports were the payment for the imports of the food which made the survival of the British population possible. Many examples from the history of those ages will show the attitude of the gentry and aristocracy toward the workers. I want to cite only two examples. One is the famous British \"Speenhamland\" system. By this system, the British government paid all workers who did not get the minimum wage (determined by the government) the difference between the wages they received and this minimum wage. This saved the landed aristocracy the trouble of paying higher wages. The gentry would pay the traditionally low agricultural wage, and the government would supplement it, thus keeping workers from leaving rural occupations to seek urban factory employment.\n\nEighty years later, after capitalism's expansion from England to continental Europe, the landed aristocracy again reacted against the new production system. In Germany the Prussian Junkers, having lost many workers to the higher-paying capitalistic industries, invented a special term for the problem: \"flight from the countryside\" — Landflucht. And in the German Parliament, they discussed what might be done against this evil, as it was seen from the point of view of the landed aristocracy.\n\nPrince Bismarck, the famous chancellor of the German Reich, in a speech one day said, \"I met a man in Berlin who once had worked on my estate, and I asked this man, 'Why did you leave the estate; why did you go away from the country; why are you now living in Berlin?'\" And according to Bismarck, this man answered, \"You don't have such a nice Biergarten in the village as we have here in Berlin, where you can sit, drink beer, and listen to music.\" This is, of course, a story told from the point of view of Prince Bismarck, the employer. It was not the point of view of all his employees. They went into industry because industry paid them higher wages and raised their standard of living to an unprecedented degree.\n\nToday, in the capitalist countries, there is relatively little difference between the basic life of the so-called higher and lower classes; both have food, clothing, and shelter. But in the 18th century and earlier, the difference between the man of the middle class and the man of the lower class was that the man of the middle class had shoes and the man of the lower class did not have shoes. In the United States today the difference between a rich man and a poor man means very often only the difference between a Cadillac and a Chevrolet. The Chevrolet may be bought secondhand, but basically it renders the same services to its owner: he, too, can drive from one point to another. More than 50 percent of the people in the United States are living in houses and apartments they own themselves.\n\nThe attacks against capitalism — especially with respect to the higher wage rates — start from the false assumption that wages are ultimately paid by people who are different from those who are employed in the factories. Now it is all right for economists and for students of economic theories to distinguish between the worker and the consumer and to make a distinction between them. But the fact is that every consumer must, in some way or the other, earn the money he spends, and the immense majority of the consumers are precisely the same people who work as employees in the enterprises that produce the things which they consume. Wage rates under capitalism are not set by a class of people different from the class of people who earn the wages; they are the same people. It is not the Hollywood film corporation that pays the wages of a movie star; it is the people who pay admission to the movies. And it is not the entrepreneur of a boxing match who pays the enormous demands of the prize fighters; it is the people who pay admission to the fight. Through the distinction between the employer and the employee, a distinction is drawn in economic theory, but it is not a distinction in real life; here, the employer and the employee ultimately are one and the same person.\n\nThere are people in many countries who consider it very unjust that a man who has to support a family with several children will receive the same salary as a man who has only himself to take care of. But the question is not whether the employer should bear greater responsibility for the size of a worker's family.\n\nThe question we must ask in this case is, Are you, as an individual, prepared to pay more for something, let us say, a loaf of bread, if you are told that the man who produced this loaf of bread has six children? The honest man will certainly answer in the negative and say, \"In principle I would, but in fact if it costs less I would rather buy the bread produced by a man without any children.\" The fact is that, if the buyers do not pay the employer enough to enable him to pay his workers, it becomes impossible for the employer to remain in business.\n\nThe capitalist system was termed \"capitalism\" not by a friend of the system, but by an individual who considered it to be the worst of all historical systems, the greatest evil that had ever befallen mankind. That man was Karl Marx. Nevertheless, there is no reason to reject Marx's term, because it describes clearly the source of the great social improvements brought about by capitalism. Those improvements are the result of capital accumulation; they are based on the fact that people, as a rule, do not consume everything they have produced, that they save — and invest — a part of it. There is a great deal of misunderstanding about this problem and — in the course of these lectures — I will have the opportunity to deal with the most fundamental misapprehensions which people have concerning the accumulation of capital, the use of capital, and the universal advantages to be gained from such use. I will deal with capitalism particularly in my lectures about foreign investment and about that most critical problem of present-day politics, inflation. You know, of course, that inflation exists not only in this country. It is a problem all over the world today.\n\nAn often-unrealized fact about capitalism is this: savings mean benefits for all those who are anxious to produce or to earn wages. When a man has accrued a certain amount of money — let us say, $1,000 — and, instead of spending it, entrusts these dollars to a savings bank or an insurance company, the money goes into the hands of an entrepreneur, a businessman, enabling him to go out and embark on a project which could not have been embarked on yesterday, because the required capital was unavailable.\n\nWhat will the businessman do now with the additional capital? The first thing he must do, the first use he will make of this additional capital, is to go out and hire workers and buy raw materials — in turn causing a further demand for workers and raw materials to develop, as well as a tendency toward higher wages and higher prices for raw materials. Long before the saver or the entrepreneur obtains any profit from all of this, the unemployed worker, the producer of raw materials, the farmer, and the wage earner are all sharing in the benefits of the additional savings.\n\nWhen the entrepreneur will get something out of the project depends on the future state of the market and on his ability to anticipate correctly the future state of the market. But the workers as well as the producers of raw materials get the benefits immediately. Much was said, 30 or 40 years ago, about the \"wage policy,\" as they called it, of Henry Ford. One of Mr. Ford's great accomplishments was that he paid higher wages than did other industrialists or factories. His wage policy was described as an \"invention,\" yet it is not enough to say that this new \"invented\" policy was the result of the liberality of Mr. Ford. A new branch of business, or a new factory in an already existing branch of business, has to attract workers from other employments, from other parts of the country, even from other countries. And the only way to do this is to offer the workers higher wages for their work. This is what took place in the early days of capitalism, and it is still taking place today.\n\nWhen the manufacturers in Great Britain first began to produce cotton goods, they paid their workers more than they had earned before. Of course, a great percentage of these new workers had earned nothing at all before that and were prepared to take anything they were offered. But after a short time — when more and more capital was accumulated and more and more new enterprises were developed — wage rates went up, and the result was the unprecedented increase in British population which I spoke of earlier.\n\nThe scornful depiction of capitalism by some people as a system designed to make the rich become richer and the poor become poorer is wrong from beginning to end. Marx's thesis regarding the coming of socialism was based on the assumption that workers were getting poorer, that the masses were becoming more destitute, and that finally all the wealth of a country would be concentrated in a few hands or in the hands of one man only. And then the masses of impoverished workers would finally rebel and expropriate the riches of the wealthy proprietors. According to this doctrine of Karl Marx, there can be no opportunity, no possibility within the capitalistic system for any improvement of the conditions of the workers.\n\nIn 1864, speaking before the International Workingmen's Association in England, Marx said the belief that labor unions could improve conditions for the working population was \"absolutely in error.\" The union policy of asking for higher wage rates and shorter work hours he called conservative — conservatism being, of course, the most condemnatory term which Karl Marx could use. He suggested that the unions set themselves a new, revolutionary goal: that they \"do away with the wage system altogether,\" that they substitute \"socialism\" — government ownership of the means of production — for the system of private ownership.\n\nIf we look upon the history of the world, and especially upon the history of England since 1865, we realize that Marx was wrong in every respect. There is no Western, capitalistic country in which the conditions of the masses have not improved in an unprecedented way. All these improvements of the last 80 or 90 years were made in spite of the prognostications of Karl Marx. For the Marxian socialists believed that the conditions of the workers could never be ameliorated. They followed a false theory, the famous \"iron law of wages\" — the law which stated that a worker's wages, under capitalism, would not exceed the amount he needed to sustain his life for service to the enterprise.\n\nThe Marxians formulated their theory in this way: if the workers' wage rates go up, raising wages above the subsistence level, they will have more children; and these children, when they enter the labor force, will increase the number of workers to the point where the wage rates will drop, bringing the workers once more down to the subsistence level — to that minimal sustenance level which will just barely prevent the working population from dying out. But this idea of Marx, and of many other socialists, is a concept of the working man precisely like that which biologists use — and rightly so — in studying the life of animals. Of mice, for instance.\n\nIf you increase the quantity of food available for animal organisms or for microbes, then more of them will survive. And if you restrict their food, then you will restrict their numbers. But man is different. Even the worker — in spite of the fact that Marxists do not acknowledge it — has human wants other than food and reproduction of his species. An increase in real wages results not only in an increase in population; it results also, and first of all, in an improvement in the average standard of living. That is why today we have a higher standard of living in Western Europe and in the United States than in the developing nations of, say, Africa.\n\nWe must realize, however, that this higher standard of living depends on the supply of capital. This explains the difference between conditions in the United States and conditions in India; modern methods of fighting contagious diseases have been introduced in India — at least, to some extent — and the effect has been an unprecedented increase in population, but, since this increase in population has not been accompanied by a corresponding increase in the amount of capital invested, the result has been an increase in poverty. A country becomes more prosperous in proportion to the rise in the invested capital per unit of its population.\n\nI hope that in my other lectures I will have the opportunity to deal in greater detail with these problems and will be able to clarify them, because some terms — such as \"the capital invested per capita\" — require a rather detailed explanation.\n\nBut you have to remember that, in economic policies, there are no miracles. You have read in many newspapers and speeches, about the so-called German economic miracle — the recovery of Germany after its defeat and destruction in the Second World War. But this was no miracle. It was the application of the principles of the free market economy, of the methods of capitalism, even though they were not applied completely in all respects. Every country can experience the same \"miracle\" of economic recovery, although I must insist that economic recovery does not come from a miracle; it comes from the adoption of — and is the result of — sound economic policies.",
				"added": 1565616706
			}
		]
	},
	"comment_vote": {
		"68_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"338_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"10_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1
	}
}