{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Сторонники Мальцева и движения \"Артподготовка\" объединяются тут.",
			"body": "#Революция05112017",
			"added": 1484345073
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr": [
			{
				"comment_id": 1,
				"body": "> [oo7o6y](#comment_4_1AdwBQjEYfBQhVGaAjF5X3y2UfvBxS4BCr): http://127.0.0.1:43110/1327368UDgT2VBMTv46L42qJs7vspSU6dF/\n\nПипл, что за хрень, когда вы вставляете видео с ютуба. Дайте ссылку, кому надо, тот  поспотрит. А по уму могли бы выложить видео у себя и позволить его скачать. На кой черт мне зеронет, если вы через ютуб работаете? Совесть поимейте. Предложили бы еще через вк авторизоваться или скан паспорта прислать.",
				"added": 1484316740
			}
		],
		"1_1JeUyPX532qTAZaZXQfbPETTWTzCNvf2dM": [
			{
				"comment_id": 2,
				"body": "> [shift](#comment_347_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): вангую что тупо ничего не будет\n\nМы по крайней мере своим маленьким региональным сообществом готовимся. Кто бы там что не говорил и не делал, у нас есть ячейка человек на 50-60. А там как выйдет. Не хочется заранее сдаваться.",
				"added": 1484346627
			},
			{
				"comment_id": 3,
				"body": "И хотим тут запасной аэродром, чтобы не доверять вконтакту полностью. Если будет небольшой набег, просим прощения у коренных обитателей. Но у нас народ мирный, пока его физически не трогают.",
				"added": 1484346816
			},
			{
				"comment_id": 4,
				"body": "> [antignu](#comment_3_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N):\n> Всегда если наберется достаточное количество, сможете выделиться в отдельный форум, который тут делается парой кликов.\nЯ не знаю как наш народ возьмется штурмовать зеронет. При условии, что все максимально просто, должно зайти всем. И тогда в действительности выделимся, форумы клонировать умею. Но опять же люди, которые привыкли к удобству соцсетей, могут просто проигнорировать.",
				"added": 1484348471
			},
			{
				"comment_id": 5,
				"body": "> [antignu](#comment_3_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N):\nради показухи для своих подписчиков\nНу у нас отдельная региональная группа, если вдруг дядя Слава начнет темнить, всегда найдем к кому примкнуть. Благо идей сейчас гораздо больше чем людей. :)",
				"added": 1484348595
			},
			{
				"comment_id": 6,
				"body": "Ну мы не нарушаем законов. Все наши действия полностью законны. Просто клуб по интересам. Общаемся в вк и раз в неделю бывают сходочки на несколько человек. Обсуждаем по большей части плохие новости. Ну и как управляется область и государство в целом. Оружия нет. У меня тян лучше вооружена чем я сам. ФСБшников не боимся просто. Если хотят пусть приходят. Никаких волнений у нас нет, мы лично в настоящий момент никого насильно свергать не хотим и подготовку не ведем. Большинство считает, что власть должна перейти в руки правительства избранного народом законно. В результате законного протеста с требованием отставки не исполняющего своих обязанностей правительства. Встречи как митинги не позиционируем, плакатов не выносим. Но количество единомышленников благодаря пропаганде растет. Из действий пока агитация. Есть и сотрудники правоохранительных органов, которые с нашими идеями согласны и с которыми можно водки выпить.\nНа тему специальной ФСБшной группы - да за пару встреч будет все ясно. Если это провокация, будут провоцировать. При том и подставлять. Типа на незаконный митинг или на террористические действия агитировать. Если группа не заботится о безопасности своих участников или провоцирует их на действия, которые могут преследоваться, но не принесут результатов, считай это подстава. И да, у нас так называемая социальная атомизация очень сильна, многие не верят, что мы хотим перемен, а не власти. Но к примеру если мне или знакомым кто-то предложит сжечь флаг перед зданием администрации или кричать \"Слава Украине\", будет послан на три буквы. Потому что это не принесет результатов. А если кто-то предложит пойти агитировать за опозиционных кандидатов или поучаствовать в законном митинге (собирались за закон о защите животных), объяснит, зачем и представит программу - мы поможем.\nЕсли придется нарушать закон, это будет сделано одномоментно с одобрения большинства. Ну и надо какие-то каналы связи помимо контролируемых государством иметь. Вот сейчас работаем на то, чтобы приучить сообщество к распределенному интернету и радиосвязи. На случай, что если что-то отрубят, то мы не потеряемся",
				"added": 1484389248
			},
			{
				"comment_id": 7,
				"body": "> [vlad20012](#comment_237_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): По поводу связи, мне кажется, зеронет вам не особо подходит. Как-то это больше исследовательский гиковый проект, все тут недопиленное. Например, на мобилках как-то с трудом работает (и работает ли вообще?). А пробовали какие-нибудь скрытые форумы в Tor? Mesh-чаты (fireChat?)? Ммм, что-то одна хрень в голову приходит, где все остальные децентрализованные сети-то... @shift, тут что, правда зеронет в прод пошел? В народ, так сказать. Любопытно...\n\nfirechat - штука с регистрацией. Пробовали, плавали, знаем. Во-первых нужно рутованное устройство, чтобы эта штука нормально заработала без интернета. Уже неприменимо, потому что участники гиками не являются и каждому объяснять как mesh сеть работает и зачем рут нужен на мобилке будет сложно. Во-вторых опенгарден много чего пытается сделать, да только не для пользователя.\n> [blackcat](#comment_3_159SQm48sNsqPd9DJZvjpt7Z4ykVwZDaH8): Как подорвать машину с оллигархом дроном и обыкновенной гранатой с чекой?Привязываете леску от квадрокоптера к кольцу  гранаты которая в свою очередь привязана к леске на которой крючек .дрон летит в полете крючком цепляется за кабину машины потом резко уходит в сторону отрывается чека от закрепленной гранаты крючком и все-оллигарху разносит голову в говно осколками гранаты минус один орел запутинец гомосек и тд\n\nНужна граната же. Дрон достать можно, а вот гранату вряд ли просто так. Ну и у олигарха есть наследники и управляющие. Нужна система, которая просто не допустит разграбления государства в пользу олигарха.",
				"added": 1484547299
			},
			{
				"comment_id": 8,
				"body": "> [vlad20012](#comment_237_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): По поводу связи, мне кажется, зеронет вам не особо подходит. Как-то это больше исследовательский гиковый проект, все тут недопиленное. Например, на мобилках как-то с трудом работает (и работает ли вообще?). А пробовали какие-нибудь скрытые форумы в Tor? Mesh-чаты (fireChat?)? Ммм, что-то одна хрень в голову приходит, где все остальные децентрализованные сети-то... @shift, тут что, правда зеронет в прод пошел? В народ, так сказать. Любопытно...\n\nКстати еще момент: мадам, которая зеронет рекомендовала утверждала именно о доступности. Хочешь блог? Клонируешь движок и пиши. Как и форум. Ну и сайт с файлами под скачивание достаточно просто сделать. Основная проблема тора в том, что это просто программный маршрутизатор, придется сервер поднимать и искать движок сайта, который ничего никуда не льет. Ну и если я еще гипотетически смогу это развернуть, больше половины участников не смогут. А основная фишка, по заверениям той тян - легко клонировать. Забрали тебя? К тебе зашла подруга, забрала у родных флешку, вставила, включила - весь контент опять существует",
				"added": 1484547641
			},
			{
				"comment_id": 9,
				"body": "> [vlad20012](#comment_236_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Вообще, кроме шуток, это довольно круто. Я бы даже сказал, зрело. А то люди разрозненны, у каждого хата с краю, никакого взаимопонимания. И такое чувство, что в россии всегда так было. Может, что-то постепенно меняется. Поговаривают, что дальнобойщики вертикальную структуру выстроили - понятно, на чьей они будут стороне, если что.\n\nДальнобойщикам сейчас деваться некуда. Поэтому и протестуют. Если крупные корпорации имеют свои транспортные компании и смогут компенсировать убытки от Платона тем, что поднимут цены, для частных перевозчиков это только риски и убытки. При том ладно бы деньги напрямую в дорожный фонд шли. У дальнобойщика деньги обычно есть и за качественные дороги он бы заплатил. Но деньги собирают Ротенберги, а дороги как были, так и остались. А для них плохие дороги - это износ машины. Это дорогостоящий ремонт, по сравнению с которым платон это как пивка по выходным попить с друзьями. Сравните сколько фура работает в Европе и в каком состоянии потом продается сюда. И сколько она работает тут даже с нови. О том, что продать ее потом речи быть не может: каждый эксплуатирует пока движок на дорогу не выпадет. :-)",
				"added": 1484547950
			}
		]
	},
	"comment_vote": {}
}