{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "Interesting writing. You have a lot of good views, but also some I do not agree with, which promotes thinking of these things. For example I keep privacy kind of core principle, but I'm not yet sure whether or not I have given enough thought on it. Life is one of the most important things, and thats what we share as a common core principle. \n\nHowever aging is something we actually should not prevent. Attachment to things is bad and so attachment to life itself is bad. Fundamental property of life is its flow from birth to death. Being a human is just something we happen to be right now, and we should try to make our best out of it while it lasts. Still, I believe, the reality has a lot more to offer than this one life. From atoms of this universe I have born, and once this body comes to its end, it will become atoms of this universe. But wait, there are no atoms really, they are just a concept. Maybe there are vibrating strings as string theory suggests? Or maybe just information that makes everything that exists?\n\nPhysics have'n really come to any conclusion of anything concrete that really exists, which makes one think is physics really anything fundamental, or are there really just collective ideas of the way things are?",
			"post_id": 47,
			"date_added": 1528008417
		},
		{
			"comment_id": 2,
			"body": "Given more thought on it: Right to privacy is a basic human right.",
			"post_id": 47,
			"date_added": 1528010879
		},
		{
			"comment_id": 3,
			"body": "> [thecuriousnerd](#comment_5_16esmH5mTmsJL4S5DW4dup5883xJh6GdDS): I don't think that is correct, we could support far more simply by avoiding waste, and changing infrastructure. The issue is that the benefits of helping others in this way are not obvious to the public. For example if there are more people who are living well, they could do science and more research to solve more problems.\n> Then you could have even more people thanks to the advances you would get.I recommend this video:A Selfish Argument for Making the World a Better Place – Egoistic Altruism https://www.youtube.com/watch?v=rvskMHn0sqQ\n> \n> One thing to consider is can you truly keep anything secret? Encryption can get dated and broken. Even if you destroy the data, there are hypothetical ways it could be retrieved. In my mind information tries to escape and spread kinda like entropy. So privacy can only be a temporary thing at least from my perspective at the moment.\n\nEverything is temporary. Universe is temporary, but that doesn't mean it should disappear now. \n\nI can keep as much secrets as I need to. Privacy starts from ones own behaviour. I can choose to write and publish this text or not to write it and just keep my thoughts in my head. Then there is digital privacy where I can choose whether I keep this text only locally on my computer or publish it to the internet. Then there is privacy on the internet, where I should be able to choose to which group I want to share certain information with.\n\nMoney is just one example where privacy is necessary. Let's assume I have a bitcoin wallet with 10 bitcoins in it; I wouldn't want anyone else to know how to access that wallet. ",
			"post_id": 47,
			"date_added": 1528120575
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}