{
	"next_topic_id": 15,
	"topic": [
		{
			"topic_id": 1611842332,
			"title": "Torrentz.eu Torrent Meta-search",
			"body": "It was the best meta-search engine. I know it, you know it, everyone knows it. Now it's gone. I have tried this clone https://torrentz.unblockit.ltd but it fails to show seeds/leeches. So does Torrentz still exist anywhere? On the Tor network perhaps? Or is there another torrent meta-search engine you can recommend?",
			"added": 1611842331
		},
		{
			"topic_id": 1611861018,
			"title": "Faggots will find this place sooner rather than later. It's the only serious unhosted solution",
			"body": "They can't be deplatformed, but they can be ignored. They certainly consume copious amounts of main stream media, and have names like \"penishelpfinger\". What's the best option for dealing with them on public zerosites? zites?",
			"added": 1611861016
		},
		{
			"topic_id": 1612091787,
			"title": "I bought Cheap Flavorless Cheese. What now?",
			"body": "I bought a bulk 2 pounds Cheap Flavorless Cheese, and I've tried incorporating it into my normal dishes and recipes, but it's just a flavorless blob of fat and protein. It actually makes my omlet less delicious.\n\nI'm never buying it again, but how can I avoid throwing all this cheese in the trash? Do you have some recipe I can make with this thing?\n\nEdit:\nMaybe there is some recipe that calls for bland cheese, or maybe I can spike the flavor somehow...",
			"added": 1612091782
		},
		{
			"topic_id": 1612410452,
			"title": "Hurry To Get Your Vaccination Good Little Boys And Girls (And Gender Non-Binaries)",
			"body": "Those under age 50 have survival rate of 9,999 in 10,000 according to CDC data (and that's with their pumped up car crash fatality data). Basically, if you're not morbidly obese and don't have asthma, then the act of getting the vaccine is actually a greater risk of danger. A vaccine is considered \"Acceptable\" if 1 in 10,000 Healthy People suffer long term side effects. Yes, if you're a non-obese, non-asthmatic, healthy person, then you may suffer vaccine side effects. Personally, I'd rather take my chances with the virus.\n\nSource:\nhttps://www.cdc.gov/coronavirus/2019-ncov/hcp/planning-scenarios.html\n0-19 years: 0.00002\n20-49 years: 0.00007\n50-69 years: 0.0025\n70+ years: 0.028",
			"added": 1612410445
		},
		{
			"topic_id": 1614861650,
			"title": "Texas Announces COVID Lockdown Is OVER Triggering Prominent Liberals, Biden Says Not Until NEXT YEAR",
			"body": "https://odysee.com/@timcast:c9/texas-announces-covid-lockdown-is-over",
			"added": 1614861642
		},
		{
			"topic_id": 1615876649,
			"title": "Video: The Virus Scare [Why People World Wide Reject Covid Vaccine]",
			"body": "Why are people world wide rejecting the Covid-19 vaccination? Even many first responders say \"No!\". What went wrong?\n\nOff-Youtube Exclusive, Full Video\nhttps://odysee.com/@vidarreturns/the_virus_scare",
			"added": 1615876640
		},
		{
			"topic_id": 1616012868,
			"title": "Deleted Bill Gates Documentary- Project Veritas",
			"body": "A DELETED BILL GATES DOCUMENTARY HAS BEEN REVIVED.mp4\n\nBill Gates vaccinating the world and making his next fortune\n\nhttps://odysee.com/@Veritas/A-DELETED-BILL-GATES-DOCUMENTARY-HAS-BEEN-REVIVED?r=H32vHuhbGGqxpQkgAYiLsKxbEh8FyJco",
			"added": 1616012858
		},
		{
			"topic_id": 1617087949,
			"title": "video: \"Believe Science\" The Deception Of Blue Pill Zombies",
			"body": "What does it mean when Blue Pill Zombies say, \"Believe Science\", and what is implied? Who is really against science? On the projection and manipulation tactics used to bend the minds of the weak\n\nhttps://odysee.com/@vidarreturns/believe-science-the-deception-of-blue?r=H32vHuhbGGqxpQkgAYiLsKxbEh8FyJco",
			"added": 1617087938
		},
		{
			"topic_id": 1622474302,
			"title": "100 Years Beyond Covid-19 (A Sick Future To Come)",
			"body": "Predicting what is to come for future generations, and how who will be able to survive\n\nhttps://odysee.com/@vidarreturns/100_years_beyond_covid-19",
			"added": 1622474290
		},
		{
			"topic_id": 1623149386,
			"title": "Encrochat 60,000 Member Encrypted Chat Network Infiltrated By EU Police",
			"body": "> \"As the second major encrypted phone network to be shut down by police in Europe, Sky ECC's seeming downfall has parallels with the Encrochat story, where French and Dutch police man-in-the-middle'd the encrypted phone network on suspicion it was being used mainly by organised criminals\"\n\n> \"French police infiltrated the EncroChat encrypted phone network in April 2020, in an operation that has led to hundreds of arrests in the UK and Europe\"\n\n> \"EncroChat encrypt their messages with the Signal Protocol. This is a commonly used encryption protocol that is freely available\"\n\nIt appears they may have inserted a corrupt encryption library into a package update. Such a simple method of attack is extremely effective because all messages pass through a Central server. Compare this to P2P networks which are far more resilient- P2P messages can go directly from the sender to the receiver, with no Central point of failure, no middle man\n\nIf you're interested in more secure communications, Popular P2P messaging networks are: Session, Briar, Tox, and Jami.\n\nSoftware Links:\nhttps://getsession.org (muli-platform)\nhttps://briarproject.org (Android only)\nhttps://tox.chat (muli-platform)\nhttps://jami.net\n\n.\n\nNews Sources:\nhttps://www.theregister.com/2021/03/10/sky_ecc_encrypted_phones_belgium_police_raids/\nhttps://www.computerweekly.com/news/252501921/Secrecy-around-EncroChat-cryptophone-hack-breaches-French-constitution-court-hears\nhttps://www.vice.com/en/article/pkdjab/encrochat-signal-protocol-encryption",
			"added": 1623149373
		},
		{
			"topic_id": 1627870482,
			"title": "cock.li Invite Request",
			"body": "For anyone with a cock.li email address, I kindly ask for an invite",
			"added": 1627870468
		}
	],
	"topic_vote": {
		"1611998949_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": 1,
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1612458385_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1614365249_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1615902626_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1615938789_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1615820872_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1,
		"1615599959_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1622474302_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1622433900_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"1622828057_1BVj9Z33CpeFjZejQWc7VV9E4sjYeg9eDt": 1,
		"1622800126_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": 1,
		"1622708750_1CfqeXAEhkGtTyDurpVFQA1UQMsWYi2nSR": 1,
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1621945542_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": 1
	},
	"next_comment_id": 69,
	"comment": {
		"1611606727_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": [
			{
				"comment_id": 1,
				"body": "> [2024](#comment_16_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg): Someone that knows how to program, make a racist decentralized site here, and it will flourish.\n\nI'm pretty sure Facebook has got that Flourishing Racism covered already. Shall I give you links to Black Only Dating, Loving Black, or Nation Wide Black Pride?",
				"added": 1611660849
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 2,
				"body": "> [deuxzaron](#comment_70_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): That's only single victim/single offender, find better data and come back\n\nYes, exactly. If you research single-victim to multiple-offender, you'll find that Blacks are closer to 80% - 90% perpetrators. It's the Non-Blacks that defend criminals who will destroy society.",
				"added": 1611661483
			}
		],
		"1610991839_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 3,
				"body": "So wait. If you delete your private key, then who is to say this will be a \"legal\" zite?",
				"added": 1611861548
			},
			{
				"comment_id": 5,
				"body": "But what if we want illegal content?",
				"added": 1611893078
			}
		],
		"1611787253_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 4,
				"body": "If you download a zite you don't want anymore, you can go into the Zeronet menu and delete it from your system.",
				"added": 1611891830
			}
		],
		"1611929920_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [],
		"1611861018_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 7,
				"body": "At least the Racists stay in Clearnet. Black Only Dating anyone?\nhttps://apps.apple.com/us/app/blk-dating-for-black-singles/id1253586891\n\nOr have some Black Supremacy?\nhttps://podcasts.apple.com/us/podcast/black-nationalism/id1497795565",
				"added": 1611933152
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "Sophistry. This post is so wrong as to be embarrassing. Didn't even get first premises correct.\n\n1) A Fact is statement which can be verified True or False. (A fact can even be false, and it is still a fact) https://www.rd.com/list/false-facts-everyone-believes\n\nExample Fact: \"The cavalry is coming\" It is possible to observe and verify whether or not the cavalry actually is coming. It is True or False.\n\n2) An Opinion is a statement that cannot be verified as True or False.\n\nExample Opinion: \"We just need Faith to win\" It is impossible to verify that Faith actually makes any difference to win. Another person may believe it is Determination that is needed to win. There is no way to verify, which makes this statement an Opinion.\n\nGo back to Philosophy 101. Study some Epistemology, and logical fallacies. Then come back in a couple months and try again.",
				"added": 1612094122
			}
		],
		"1612091787_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 14,
				"body": "> [styromaniac](#comment_2938_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Chesse sticks to steel really well, so use it where welding would come in handy.\n\nI don't know about welding, But you did give me another idea. Cheese sticks!",
				"added": 1612106160
			},
			{
				"comment_id": 15,
				"body": "@driud\nI tried frying some in a pan and yeah, it didn't turn out great. I mean, add a little salt and it wasn't too bad, but whatever.\n\nUsing it with Pizza and Pasta sounds great. Maybe I can make some Spanish style dish with it. Recommendations?",
				"added": 1612106507
			}
		],
		"1612036757_1LPWdVJ1GNU738u2VUkoZdw9B7u4VPmfNZ": [
			{
				"comment_id": 16,
				"body": "If you're hosting them all from the same internet IP location, then it won't make a big difference if you're running 1 or 100 devices, because the bottle neck is mostly going to be your internet speed. So hosting just 1 device/server is fine.",
				"added": 1612110911
			}
		],
		"1612171639_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 17,
				"body": "Minnesota",
				"added": 1612178124
			}
		],
		"1612184585_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [],
		"1611842332_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 19,
				"body": ".",
				"added": 1612246821
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 20,
				"body": "> [mxh69420](#comment_4_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): vaccinations dont touch our dna. vaccinations are doses of the virus..\n\nSomeone has not done their research on mRNA, and still thinks wikipedia is a valid source of knowledge. The saddest kind of fool is one that thinks he is smart",
				"added": 1612355789
			}
		],
		"1612364889_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 21,
				"body": "@asdf111 You can't look at an entire platform and say \"bad information there\". There is bad information on the internet, so never use the internet, only go talk to scientists and professionals directly... The position isn't sound. There are trustworthy and untrustworthy content creators, and it is up to us to decide which ones are which.",
				"added": 1612412621
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 23,
				"body": "@jager According to this source, the top 2 comorbidities associated with Covid Death are: Respiratory Disease (Asthma/COPD), and Circulatory Disease. Young people need to go outdoors, run, and be physically active. Diabetes and Obesity are both symptoms of an inactive lifestyle. Covid attacks a persons ability to Breath\nhttps://blog.definitivehc.com/conditions-associated-with-the-highest-covid-19-mortality-rates",
				"added": 1612516502
			},
			{
				"comment_id": 26,
				"body": "@jager I agree with using good sources, but your sources don't seem to support what you claim. I've seen these links before, it's like the first page on Google search. Where does it claim to list comorbidities in statistical order?\n\nI'm not trying to win internet points here, because if you can find a better source, then I'd love to see it.\n\nMy source lists them in statistical order AND related to an outcome of death. Comorbidities of people who survive is not relevant information. (IMO, such information is currently being used as political scare tactics)",
				"added": 1612546091
			}
		],
		"1612516347_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [],
		"1612664212_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 27,
				"body": "What in the Psyop Bullshit? I voted for Trump, but he is no prophet of God, and he isn't going to save the Republic. Get your head out of your ass. Read some history. The USA is meeting every criteria for the collapse of an empire. A massive public debt is one of those criteria, and Trump helped contribute to it, massively. It's just a matter of time now. God has no blessings for the ignorant",
				"added": 1612673789
			},
			{
				"comment_id": 28,
				"body": "An additional criteria for empire collapse that you will unlikely read about (due to political censorship) is the proliferation of homosexuality. You can find information on this if your specifically search it. Homosexuality became rampant near the end of the Roman empire",
				"added": 1612673976
			}
		],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 29,
				"body": "Who would have thought that an Income Tax in 1913 meant exclusively for the Rich, would actually be used today to destroy the Middle class? In 1913, they would have asked \"Where's the Proof?\"\n\nWho would have thought that Obama, a President that promised Peace and won a Nobel Peace Prize, would start 2 New Wars and execute more drone strikes than W Bush? In 2008, they would have asked \"Where's the Proof?\"\n\nThe Proof is that you can Never trust the Government to do what they promise. An election is not a Contract",
				"added": 1612676047
			}
		],
		"1612700256_12yaDiCxvgRDRn3xUVdxM2PDUwJhKZ7GGB": [
			{
				"comment_id": 30,
				"body": "Looks good, but unfortunately they chose an non-GPL software license. So that if it ever did gain traction, some company like Google or Apple would just copy their code and dominate the userspace, just like they did with KHTML, creating Chrome and Safari",
				"added": 1612703470
			}
		],
		"1612720158_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 32,
				"body": "This is a problem with the right-wing. They think that 20th century technology (guns) will help them win a 21st century technology war. The right-wing has grown weak, complacent, and stupid. Most on the right know that Social Media stole the election, yet they still stay on Social Media. Feeding the beast that will destroy them. It's unfortunate",
				"added": 1612727514
			},
			{
				"comment_id": 33,
				"body": "> [grouch0](#comment_38_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): The right has never been stronger, and it's gaining strength by the day. [...]\nUnironically said, as people stuff their children's faces DAILY with Coke, Doritos, and MacNCheese...\n\nPersonally, I exercise and fast every other day. I only eat food 3 or 4 days each Week! When's the last time you ever went without food? Many of the right-wing are too mentally weak. Not enough discipline. And not enough study. Wasting time and money, on 1,754 TV channels. Voluntary self-brain destruction. Why is technology dominated by approximately 80% left-wing? You do know that technology and AI is being used to manipulate the minds of average people, don't you? People who have no political position, are being programmed to be against the \"Fascist Right-wing\"\n\nDon't take what I say as an insult. It's a warning. I agree with you that there will be very dire consequences from this election outcome. Let others know, we need to form communities, and up our game, and learn technology. You don't fight a tank with stones.\n\nHere's a video that explains it better than me\nVidarReturns https://bitchute.com/video/PDqBIM3j9CZZ",
				"added": 1612763565
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [],
		"1612779139_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 37,
				"body": "Ebay has stopped all selling of these Dr Suess books by independent individuals based on the pretence of \"hate\"\n\nhttps://youtu.be/amAHRY2neAg",
				"added": 1615551247
			},
			{
				"comment_id": 48,
				"body": "GalacticChan isn't flagged by CP blockers. Try posting there instead\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q",
				"added": 1615911999
			}
		],
		"1615515631_19482XG7NpQFrmCoWBcW4LypTKXhoh4qZc": [
			{
				"comment_id": 38,
				"body": "Go to http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/\n\nType in akmluser1. Select Mute",
				"added": 1615551623
			}
		],
		"1612976844_16E25Tu9jf8GTS2S1W5mZs6Ayc9vQkC8SN": [
			{
				"comment_id": 39,
				"body": "> [vinegarlover](#comment_7_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP): fake and gay. just like op\n\nTrue. Bill Gates is a evil psychopath, but this video is a psy-op spread by idiots",
				"added": 1615555995
			}
		],
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 40,
				"body": "Great story link",
				"added": 1615556977
			}
		],
		"1615373710_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 41,
				"body": "I think the obvious question becomes, \"Why not just use Syncthing?\". So are you looking for some functionality that Syncthing doesn't offer?",
				"added": 1615558605
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 42,
				"body": "The idea of kill lists for Social Marxists certainly has merit. They ended the possibility for civil discussion long ago. Though, I don't believe it will be effective at changing our current course. There are too many degenerate, fat, and brainwashed people sloshing around in the masses. Unfortunately, a \"Great Reset\" is needed, and a lot of these worthless/spineless people need to die. Self hating Whites. Self hating men. Children without fathers, being chemically castrated by their single mother. Society cheering as violent Blacks have \"Mostly Peaceful\" arson and destruction of private property, theft and looting during a \"pandemic\"?\n\nDon't throw away your life invain to try to save a crumbling civilization. Instead, be prepared. Exercise. Eat right. Study and learn something new everyday. Get your health and mind in 100% condition! Encourage everyone you love to do the same, and be an example to them. All empires collapse, and the sooner it does, the sooner we can rebuild. The stuff will eventually \"hit the fan\", and when it does, it's going to be the Armageddon of our nightmares. Those who are prepared will survive.\n\nhttps://odysee.com/@vidarreturns religion philosophy",
				"added": 1615561111
			}
		],
		"1606832263_1CrmAngYJFsq57QkHf2gC1deKeye8crBAv": [
			{
				"comment_id": 44,
				"body": "@hgbugcr Solid Truth!",
				"added": 1615570919
			}
		],
		"1615858060_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 52,
				"body": "I've got to admit, I have little sympathy for anyone living in Commiefornia. In fact, when I go to the grocery store or other outlets, I specifically avoid buying anything from Commie States, and I'm willing to pay a few cents more for oranges from Florida. I encourage others to do the same",
				"added": 1615996271
			}
		],
		"1615902626_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": [
			{
				"comment_id": 47,
				"body": "Good compilation of info. This should be saved for reference",
				"added": 1615906858
			}
		],
		"1615820872_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": [
			{
				"comment_id": 49,
				"body": "I notice these Antifa comrades are very light skin, and non-jewie. To Whites who love your race, I just wish to highlight, as terrible as the Average Elite Jew may be, there are still a giant number of Woke Social Marxist White scum. Don't think it's a war of Whites vs Jews, because many White's will gladly knife you as quickly as a Black Supremacist",
				"added": 1615913862
			}
		],
		"1615850687_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 50,
				"body": "GalacticChan\n\nhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q",
				"added": 1615914051
			}
		],
		"1615876649_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 51,
				"body": "This isn't about Biden or any other political actor. It's Global",
				"added": 1615995846
			}
		],
		"1527230895_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 53,
				"body": "Is it okay for Whites to be allowed human rights? May Whites form White Pride groups just as any other group of people? Love their own kind? May Whites organize public groups, private groups, and charities together without harassment? Will you call them Supremacists or Nazi's? Whites are humans too",
				"added": 1616006249
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 54,
				"body": "The establishment hated DeSantis all throughout 2020. Now in 2021, turns out he was right, and a lot of people love him",
				"added": 1616316555
			}
		],
		"1616239441_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 55,
				"body": "@jeff A small bit of justice in the world",
				"added": 1616316636
			}
		],
		"1614402994_168Diza6QrAArkHB5AFJESWpNAkKgUWvtw": [
			{
				"comment_id": 56,
				"body": "I've been meaning to test this out on Android. The apk is about 3 years old and only supports chat, anyone know if it works?",
				"added": 1616316948
			}
		],
		"1617039004_1EDgrafDZQ8H6WLq6jHin6NKfQ8qZKzA1C": [
			{
				"comment_id": 57,
				"body": "There is no Plan B. There is only those that Plan, and those that don't. Build, support, and use privacy respecting platforms.\n\nIf you're not already using a private chat client like Session with your close contacts, then you don't know what's at stake to be lost.",
				"added": 1617088642
			}
		],
		"1622433900_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": [
			{
				"comment_id": 58,
				"body": "@calmdownholden Very good. Spoken just like a religious cult follower that didn't read the first word of the article linked.\n\nVideo explaining why \"Believe Science\" regurgitators are basically brainless zombies.\nhttps://odysee.com/@vidarreturns/believe-science-the-deception-of-blue",
				"added": 1622901485
			}
		],
		"1622708750_1CfqeXAEhkGtTyDurpVFQA1UQMsWYi2nSR": [
			{
				"comment_id": 59,
				"body": "American's are deathly afraid of being thought of as a pedophile, and afraid of the \"innocence of a child\". Meanwhile, 15 year olds are having sex with each other daily after school.",
				"added": 1622910052
			}
		],
		"1622800126_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 60,
				"body": "Interesting news. Do you have a source?",
				"added": 1623035080
			}
		],
		"1622984567_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 61,
				"body": "deadsovereignty or hipsterhater or cnnterrorist or whatever other thousand fake IDs you use- You will never have a voice, because your posts are nothing more than Noise. This sentence of yours isn't even comprehensible with context, \"make the war on plants...\"\n\nYour posts are easily recognizable, because\n\n1. You post nonsense sentences with ... at the end.\n2. You write a stupid question, and then answer it yourself.\n3. You always reply to your own posts.\n4. You post nonsensically long rants.\n\nUltimately, you know yourself that you will get banned/muted for the idiot that you are, and that is demonstrated by your use of multiple accounts.",
				"added": 1623035997
			}
		],
		"1621945542_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 62,
				"body": "I haven't tested BTRFS in years. Sounds like I may need to check it out again. Thanks for the update",
				"added": 1623048436
			}
		],
		"1623112333_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": [
			{
				"comment_id": 63,
				"body": "Go to [ZeroID](http://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz). Search user zonateam4622. Choose Mute.",
				"added": 1623162331
			}
		],
		"1627088496_1KBwZSVraeR2NNiesYRovgcmZHTftfH9Ci": [
			{
				"comment_id": 64,
				"body": "There isn't enough pr0n already on Zeronet for you? You need to see nipples in that Ultra4K resolution? Look up the definition of Coomer",
				"added": 1627142303
			}
		],
		"1625793981_1PoimK7hZWHqrhWBZAVe8bi9g7sv4cj87R": [
			{
				"comment_id": 65,
				"body": "There is a lot of crazy uncensored chat going on Session. Just install Session, and join any of the Open Groups listed here\nhttp://lokilocker.com/Mods/Session-OpenGroups/wiki/Session-Open-Groups",
				"added": 1627147047
			}
		],
		"1625348483_1LKatdJrXVLYHewYYmPfDioZxM3kAsYLPp": [
			{
				"comment_id": 66,
				"body": "50K limit that never increases. So either people delete their old posts, or create a new account, or just stop posting. It's a good system for discouraging people from participating\n\nI'm on my second account now, and I rarely post anymore",
				"added": 1627147656
			}
		],
		"1626371556_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 67,
				"body": "Go for it!",
				"added": 1627147954
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 68,
				"body": "Search for a market on Tor or I2P. You can buy all kinds of things.\n\nThese are some of the wisest words I've ever read on Znet:\n\n> Stay on course and don't listen to the naysayers. you can do nothing for those who are are eager to stuff as many untested, emergency-approved vaccines into their bodies and their children's bodies as possible. you can't convince them. no-one can, and this is why it's a self-correcting problem. let the herd cull itself",
				"added": 1627871262
			}
		]
	},
	"comment_vote": {
		"1_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"56_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1,
		"4_1AmREURqCZmJEr8bH1zQgJd1kGrnqkeTiy": 1,
		"71_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"48_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"51_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"18_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"4_14S5V96JR2e3vNSa6L9LiJMXoSGRbKDmKq": 1,
		"68_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"69_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"50_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"223_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"26_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"3_1MW2ZSiMdJJTdhHUbV3ddi7NMdsiqKghX3": 1,
		"791_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"17_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"1_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"3_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z": 1,
		"9_1LS3ur69MC9WP8UMjAHCWYdfopv39kEfaJ": 1,
		"4_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"13_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"9_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"2946_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2947_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5": 1,
		"1_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": 1,
		"68_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"115_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"2941_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"53_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"48_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"1_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": 1,
		"55_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"56_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"19_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"8_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1,
		"66_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"2_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": 1,
		"15_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"67_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"3_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"5_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"12_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"31_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"34_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"35_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"10_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"3_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"61_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"11_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"68_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"2771_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"61_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"83_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"16_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"104_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"89_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"9_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"31_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"118_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"63_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"3106_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"144_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"149_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2": 1,
		"1_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"11_139GxzZpmsFVAWStAGMgwWwgpSKC3qkAAG": 1,
		"2_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1
	}
}