{
	"title": "Marginal Games",
	"description": "Странные рецензии на не менее странные игры",
	"links": "Привет. Молодец, что зашел. Ставь лайк, колокольчик, подписывайся на канал, комментируй. Тебя ждет много непонятной и странной фигни. :-D",
	"next_post_id": 9,
	"demo": false,
	"modified": 1528103188,
	"post": [
		{
			"post_id": 8,
			"title": "Панк is dead?",
			"date_published": 1528102616,
			"body": "![punksnotdead_2.png (1213x225)](data/img/post_8_punksnotdead_2.png)\n\nЭТО ПАНК БЛЯДЬ НАХУЙ!!! Орать маты в микрофон за 500 рублей под 2 аккорда, лабая их в гараже на старенькой гитаре, взятой в долг у соседа. А потом с гордым видом и презрением говорить, что это искусство. ИСКУСТВО БЛЯДЬ! ЭТО ИСКУССТВО!!!\n\n* * *\n\n![punksnotdead_4.png (1212x226)](data/img/post_8_punksnotdead_4.png)\n\nКучка разлетающихся пикселей в виде линий на моем мониторе тужится быть больше, чем просто очередной индюшкой, нарытой в куче говна с геймджолта. Сделанная в 2013 году за 12 часов она орет благим американским матом, рвя связки и истирая в кровь пальцы о металлические струны, которые дребезжат как груда металла под названием ВАЗ. Где здесь искусство я не знаю, но думаю, что разработчик Zak Ayles (mooosh) вряд ли задавался такими высокими философскими вопросами. Эти вопросы он оставляет критикам и снобам-интеллектуалам, которые любят поспорить после игры, рассуждая о скрытых бунтарских желаниях автора, который без возможности выплеснуть их в реальности, сублимировал в виде игры.\n\n![punksnotdead_7.png (1211x224)](data/img/post_8_punksnotdead_7.png)\n\nЗамените в английском слове punk всего лишь одну букву, и получите pink — цвет, который основной в игре. Хуй знает зачем я это написал, все равно никто не прочитает, а видимость серьезной статьи о высоких материях с рассуждениями и какой-никакой аналитикой вперемежку с отсылками и аналогиями создать хочется. Больше для своего успокоения. Да и к тому же лишний абзац появился, что позволяет без всяких обиняков назвать эту мешанину из слов гордым словом «Рецензия», не выдумывая дурацких рубрик для твиттеробзоров. Краешками своего разума я всё же чувствую, что панк и розовый как-то связаны, но гугление не дает плоды. А тратить больше времени, чем я выделил для написания поста, погружаясь в бездну поисковых запросов, мне откровенно лень. Здесь ещё можно указать, что панк пустил свои корни в конце 70-ых и бла-бла-бла. Но это ведь не важно, главное - сама игра.\n\n![punksnotdead_5.png (1210x226)](data/img/post_8_punksnotdead_5.png)\n\n**PUNKSNOTDEAD** начинается с подъезжающей машины, которая выплевывает из своего чрева нарисованного розовым силуэтом человечка — гордого одинокого правдоруба, который накажет всякую тварь, дрожащую в этом городе. Тварь долго не заставит нас ждать и чуть погодя валится сверху пачками для последующей кары. Карать мы будем ударом рукой на z, после чего противники отправляются в долгий полет через весь экран. Тела гнут фонарные столбы и взрывают автомобили, задевая попутно других обитателей «розового» мира. Всюду всплывают непотребности на английском, которые культурно можно перевести, как «давайте сношаться» и «не изволите ли отведать фекалий». В какофонии розовых линий порой тяжело ориентироваться, но если жать постоянно на прыжок и атаку, то становится легче.\n\n![punksnotdead_1.png (1210x226)](data/img/post_8_punksnotdead_1.png)\n\nПримитивная механика обрезанного битемапа идеально подходит на роль гимна нонконформизма. Удар за ударом, против всех, потому что ты не такой. Ты - особенный! Тоже розовый, но не такой. После избиения определенного количества противников табличка GO как в старых избей-их-всех играх пригласит сменить прописку на соседнюю локацию. А в ней всё тоже самое. Улица, фонарь, машина. Иногда зеленые человечки с оружием, символизирующие, наверное, блюстителей правопорядка.\n\n![punksnotdead_3.png (1211x225)](data/img/post_8_punksnotdead_3.png)\n\nГде-то я вычитал, что эта индюшка имеет параллели с **Hotline Miami**. Наверное, всё там же где пытался найти параллели панка и розового. Неоновые кричащие цвета, кровожадность главного героя, бунтарские 80-ые — пожалуй это всё, что хоть как-то дает связать эти игры. В остальном примитивный платформер с грязным саундтреком и эстетикой анархии. Всё то, за что любит панк молодое поколение, не признающее старых устоев и готовое вести свою священную войну. Но стоит только немного подрасти и куда-то улетучивается былой запал. И вот уже они становятся типичными ячейками общества, покорно-идущими за вождем, даже если им не по пути.\n\n![punksnotdead_6.png (1211x226)](data/img/post_8_punksnotdead_6.png)\n\nФинальный скрин с временем, количеством убийств и суммой ущерба подводит черту всей этой вакханалии, которая творилась на 4-ех экранах. Любители необузданного насилия наиграли 23,5 тысяч раз на геймджолте, а про игру успели написать [PC Gamer](http://www.pcgamer.com/punksnotdead-free-low-fi-brawler-that-doubles-as-a-rude-wake-up-call/) и [Rock, Paper, Shotgun](http://www.rockpapershotgun.com/2013/04/05/punksnotdead/). В общем-то, это и есть истинный уровень тру инди — удел молодого разработчика поднимать флаг будущего мейнстрима. Сегодня он делает кучу шмапов и кривых, но необычных игрушек, а на завтра Хотлайн Майями становится массовым продуктом и вся мятежность заканчивается, захлебываясь в океане таких же бывших революционеров. А он послушно в угоду масс штампует сиквелы протухшего знамени перемен.\n\n![punksnotdead.png (1210x224)](data/img/post_8_punksnotdead.png)\n\nНо в конечном итоге всё это хуйня и не имеет никакого значения. Для меня самое главное, что я получил ответ на невольно-заданный вопрос, который проклевывается сквозь розовую мешанину - А собственно панк жив или мертв?\n\n[Страница игры на gamejolt](http://gamejolt.com/games/punksnotdead/13721)"
		},
		{
			"post_id": 7,
			"title": "Real Baku 2015",
			"date_published": 1528007427.263,
			"body": "![real-baku-2015.png (832x478)](data/img/post_7_real-baku-2015.png)\n\nВ то время, как дети заигрывают с различными механиками, стараясь сделать максимально аддиктивную игру, приносящую много удовольствия, взрослые дяди в лице **Pippin Barr** играют в политику, обличая несовершенство других стран, полные коррупции, диктаторов и несправедливости. Его-то страна - венец развития человечества, где равные права имеют все, но которых при этом имеет система.\n\n* * *\n\n![real-baku-2015_2.png (479x477)](data/img/post_7_real-baku-2015_2.png)\n\nВ июне 2015-ого года в Баку, столице Азербайджана, прошли первые Европейские игры. Это аналог Олимпийских, только континентального значения. В преддверии открытия власти Азербайджана с дуру пересажали местных активировавшихся борцунов за гражданские свободы и других неравнодушных к этим делам товарищей. Одни источники указывают порядка 20-ти политзаключенных, другие — сотни. И как подобает, закрывающим глаза на вторжение в другие страны и спонсирование выгодных им в настоящее время экстремистских групп, истинные западные борцуны за азербайджанские свободы не могли пройти мимо такого беспредела против человечности. Сотня бедных азербайджанских крестьян томится в темнице в то время, как какие-то жалкие тысячи умирали и умирают на Ближнем Востоке, благодаря геополитическим игрищам мирового жандарма. \"Непорядок!\" - сказали представители Международной федерации за права человека (сокращенно FIDH) и наняли Пипина, чтобы он сделал игру в своем минималистическом стиле с минимум геймплея, но максимум месседжа. Она получилась больше похожей на дешевую агитку в духе распиаренной книги \"Атлант расправил крылья\", восхваляющей разудалый капитализм с его жрачкой конкурентов и жесткой сегрегацией общества, деля его на патрициев и плебеев, чем на искусство, которое вне времени и не зависит от виляний хвоста собакой. Мне твердят, что политика не должна и не влияет на искусство, а я делаю три ха, смеясь в лицо и читаю про абстракционистов, которые вставали на рельсы пропаганды, гоняя составы агитматериалов. Такие независимые и в авангарде живописи продавались за 30 сребреников, искренне веря в правое дело. Чего уж взять с какого-то инди-разработчика?!\n\n![real-baku-2015_5.png (484x479)](data/img/post_7_real-baku-2015_5.png)\n\nВыбирая из трех мучеников ~~путинских~~алиевских репрессий - журналиста, активиста и адвоката — игрок в **Real Baku 2015** участвует в разных спортивных состязаниях, проведение которых ограниченно тюремной камерой. На выбор пять издевательский дисциплин - бег по комнатушке 2 на 2 метра, прыжки в высоту на нарах, бокс с воздухом, толкание бумажного комочка, которое парадирует ядро, и финальный аккорд - апогей авторского сарказма в виде плескания в толчке с вечным нулевым рекордом. Возможностью в конце игровой сессии поделиться результатами в соц сетях и адаптацией под мобильные платформы разработчик пытался увеличить хоть немного аудиторию, но аскетичное исполнение самой игры практически сводит на нет все старания. Графика, как и в остальных играх автора, льет крокодильи слезы при взгляде не то что на современные игры, но даже на игры 20-летней давности. Только тот, кто застал Атари и Спектрум, а возможно также равнодушные к графике игроки смогут не обращать внимание на громадные пиксели. Примитивная в своей ипостаси игры, она тем не менее очень хороша в идеологическом плане, являясь ярким элементов западной пропаганды в красивой обертки для SJW.\n\n![real-baku-2015_4.png (479x479)](data/img/post_7_real-baku-2015_4.png) ![real-baku-2015_3.png (482x477)](data/img/post_7_real-baku-2015_3.png)\n\nИспользование произведений искусства для привлечения внимания к проблеме не новый прием. Но игры пока ещё массово не стали той новой формой, с помощью которой пытаются достучаться до равнодушной безликой части общества, при попустительстве которой и происходит большинство бесчинств властей. Здесь также есть ещё один момент, связанный с качеством и актуальностью самого произведения. Мало его создать. Оно обязано дойти до конечного потребителя. Кричать в поле про беспредел и коррупцию властей можно хоть сколько, реальный электорат вас не услышит. С этой игрой также. Не взирая на попытку хайпа с пиаром игры и поднимаемой ей проблемой на многих зарубежных игровых сайтах, существенного отклика она не может получить априори из-за своего чересчур своеобразного исполнения. Кто знает Пипин Бара и следит за его творчеством и так скорее всего читает новости и в курсе околополитических событий. Для остальных же, игра скорее отпугнет от темы, чем привлечет внимание. Изъясняясь проще, баннер в какой-нибудь **GTA 5** и **World of Warcraft** имел бы более ощутимый эффект. Другое дело, что там совсем другая публика, которой откровенно до лампочки какие-то там азербайджанцы. Большинство из них скорее всего даже не знает, где эта страна находится. И в этом есть, конечно же, главная загвоздка всех подобных произведений. Не соответствие целевой аудитории. Как правило арт-хаус в кинематографе или книги с серьезными темами, с которыми напрашивается сравнивать подобные инди-игры — удел очень маленькой части общества. В то время как задача ставится глобальная - охват максимально возможной аудитории и донесение до неё своей точки зрения на заданную тему. Вот и имеем по итогу индюшку для маргинальной группы, которая и так все прекрасно знает и понимает, а массы, как утоляли свои животные потребности, так и утоляют, продолжая хавать жвачку для тела.\n\n![real-baku-2015_1.png (854x477)](data/img/post_7_real-baku-2015_1.png)[Пост про игру в блоге разработчика](http://www.pippinbarr.com/2015/06/16/real-baku-2015/)\n[Press kit](http://www.pippinbarr.com/games/press/sheet.php?p=REAL_BAKU_2015)\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span><span data-cke-bookmark=\"1\" style=\"display: none;\"> </span> <span data-cke-bookmark=\"1\" style=\"display: none;\"></span> \n\n* * *\n\n***\n\nНа 2018 год игра в интернете больше не доступна."
		},
		{
			"post_id": 6,
			"title": "Broke Down",
			"date_published": 1527930127.721,
			"body": "![broke_dowm_title.png (850x321)](data/img/post_6_broke_dowm_title.png)\n\nОчередная попытка написать хотя бы строчку в зеленой тетрадочке, которая выступает черновиком для моих заметок, умирает в жутких предсмертных конвульсиях, чтобы возродиться в новой жизни на странице бложика. В таких же конвульсиях умирал герой игры **Broke Down**, настигнутый своими преследователями в самом конце истории. Сцена развязки изобилует неприглядным описанием происходящего, что собственно свойственно всему произведению. Поэтому логично поставив плашку 18+ или даже 21+, предупредить беременных и нежных созданий, что данный текстовый квест не для них. Правда, оглянувшись на современные нравы, царящие не только в реале, а даже скорее больше в интернете, где принцип, высказанный ещё в Древнем Риме \"Ничто не истинно, всё дозволено\" раскрылся наиболее полно, можно смело отбросить все возрастные ограничения.\n\n* * *\n\n* * *\n\n\"I wonder if there are any Twine games that don’t have fucking in them.\"(перевод - Мне интересно есть ли игры на движке Twine, которые не содержать в своей истории еблю) - уместно вопрошает один из игроков в комментариях на искрящемся некогда жизнью [инди-сайте](http://www.freeindiegam.es/2013/04/broke-down-saguaro/) с печальной судьбою, уготованной большинству виртуальных ресурсов и, не лукавля нисколько, творчеству тоже. Его искренний вопрос немного гиперболизирован, но постельные сцены и подробное описание насилия - неотъемлемые атрибуты всех этих многочисленных квестов, сделанных на платформе Twine. Так уж повелось, что юные писатели, а возможно и не совсем юные по возрасту, обращают на себя не столь интересными историями с неожиданными поворотами сюжета, сколь пошлостью, которая местами умело маневрирует между полной похабщиной и дозволенной безвкусицей. Впрочем в данной истории всё достаточно сдержанно, кроме пары мест, где можно было бы автору описать события более прилично, не переходя грань дешевого эпатажа. Да и всё равно при всей своей шаблонности истории, следить за сюжетом интересно, даже не взирая на эти похабные места.\n\n![broke_down.png (899x829)](data/img/post_6_broke_down.png)\n\nПрочитав данный обзор, завышенные ожидания игрока-читателя от игры, которая сделана в сжатые сроки на Ludum Dare, могут не совсем оправдаться. Отличная техническая часть очень ярко контрастирует на фоне литературной, которая проигрывает бой за боем по всей линии фронта геймдизайна. Но при этом проект обратил на себя внимание в большей степени благодаря как раз технической реализации, главная идея которой заключается в возможности последовательно раскрывать описание событий. Когда игрок только попадает на очередную локацию, перед ним предстает несколько короткий строчек, передающих самую суть действа, а по форме напоминающих белый стих. Кнопкой \"+\" есть возможность с каждым нажатием увеличивать количество информации, превращая таким способом пяток мало понятных строчек в цельный рассказ. При этом избавиться полностью от \"рваного\" повествования разработчик всё же не смог. Сделав более-менее ровные переходы между сценами, некая топорность всё же чувствуется. К тому же обильное использование сленга вносит свои коррективы, не давая насладится в полной мере игроку, не знающему углубленно английский язык. Но это уже, наверное, скорее проблемы игрока, а не создателя.\n\nОграниченная по времени рамками джема разработка так же не уберегла проект от недоработок. Так и осталась висеть незаконченное ветка сюжета, вываливая error на экран при попытке кликнуть на безобидное слово out. Увидите это слово - лучше пропустите.\n\nВ чём-то нуарная атмосфера с налетом киберпанка затмевает незамысловатый сюжет и плоских героев, которых при всем желании вряд ли возможно прописать за такой короткий срок. Типичное начало про безымянного героя раскрывается в концовке, давая повод для интерпретаций. Откуда он пришёл, куда идет? Ответы на эти вопросы остались за рамками игры, давая только намеки, раскиданные разработчиком. В большей степени эта игра приключение, чем текстовый квест, так как пазлов нет, и прокликать всю игру можно за какие-то десять секунд. \"Визуальная новелла\" в тегах смотрелась бы лучше, но отсутствие картинок, заставило меня написать более уместное \"Интерактивная литература\".\n\n* * *\n\nЕщё одна интересная задумка покоится в недрах лудум даре среди тысяч погребенных индюшек. Они, как главный герой **Broke Down**, приходят из ниоткуда и уходят в небытие, не удосуживаясь задать вопрос \"зачем?\".\n\n[Сайт разработчика (web.archive.org)](https://web.archive.org/web/20150623174332/https://luckyspecialgames.com)\n\n[Страница игры на Ludum Dare](http://ludumdare.com/compo/ludum-dare-26/?action=preview&uid=14557)\n\n[Играть на web.archive.org](https://web.archive.org/web/20150602132636/http://luckyspecialgames.com/ludum_dare/LD26/)"
		},
		{
			"post_id": 2,
			"title": "Дзинь-дин-дон",
			"date_published": 1527855873,
			"body": "<div style=\"text-align:center\">![](data/img/post_2_gay-cats_title.png)</div>\n\nДзинь-дин-дон разносится над пиксельным лугом, окруженным не более высокого разрешения лесом. Это милая мордочка котика задела цветочек и тот, бодро звякнув, распустился на радость и умиление игрока. Игра с длинным и трудно-произносимым названием **GAY CATS GO TO THE WEIRD WEIRD WOODS** призвана вызывать в первую очередь подобные чувства, так как больше в ней ничего нет. В ней нет пазлов, которых было ждешь при беглом взгляде на игру, но уже на втором экране понимаешь тщетность надежд. Нет здесь и кооперативной игры, на которую намекает два героя кота, к сведению нетрадиционной ориентации, но управление происходит ими одновременно, а в блоге разработчика можно узнать почему было принято решение отказаться от игры на двоих.\n\n* * *\n\nАвтор, достаточно известная и неоднозначная личность в той части инди-геймдева, которая находится в не менее глухом и странном лесу, как представленном в игре. Не являясь большим поклонником творчества тетки Пикселянте, тем не менее всегда с любопытством знакомлюсь с её новыми играми. Наверное, женский род по отношению к этому разработчику более уместен, так как он проходил курс гормональной терапии и в одной из своих игр поднималась проблема идентификации гендера другими людьми, когда на улице прохожие продолжали видеть в нем «его», в то время как он применял к себе слово «её».\n\n![gay-cats.png (766x384)](data/img/post_2_gay-cats.png)\n\nЕсли на заре творчества от **Dessgeega** можно было ожидать проработанных более массовых игр (смотреть отличную флешку [Redder](http://www.newgrounds.com/portal/view/529992) или [When Pigs Fly](http://www.newgrounds.com/portal/view/505307)), то в последнее время игры от этого разработчика становятся всё неказистей и артхаусней. Поэтому-то после знакомства с «GAY CATS...», она оставила приятные впечатления на уровне щенячьего восторга. И в голове пролетела мысль: \"Анна Энтропи вернулась\". Та самая, которая пленила пользователей Гамина несколько лет назад. Та самая, про которую рассказывал Фухтер в одном из своих [видео](https://www.youtube.com/watch?v=VTjettWmo44). Та самая, игры которой были на ступень выше по проработке левел и геймдизайна, если мы рассматриваем прежде всего любителей-разработчиков и тех, кто не поступился (как бы это было не тяжело) своими внутренними принципами, выбрав особый путь на дороге инди под пристальными взглядами более успешных коллег по цеху, которые не стали гнушаться откровенным копирование чужих идей в угоду финансовой независимости, но что нас заставляет усомниться в честности и откровенности автора как творца, а не как купца, который гонит барахлишко на паровой базар. И наконец, та самая, магия игр которой была утрачена непосредственно для меня. Например, одна из последних игр, отмеченная многими и много где засветившаяся, сугубо личная [**Dys4ia**](https://en.wikipedia.org/wiki/Dys4ia) выливала на игрока ушат внутренних противоречий и проблем разработчика, что как игра, это произведение не доставляло удовольствия. Игрока грузили по полной и он ещё долго мог думать об игре, если, конечно, он предрасположен к анализу произведения. Это безусловно не плохо, но от игр помимо некого месседжа ждешь также интересного геймплея, вокруг которого и должна строиться сама игра, как вокруг красиво-написанного предложения строится книга, а вокруг красивой последовательности звуков — музыка.\n\n![gay-cats_3.png (766x383)](data/img/post_2_gay-cats_3.png)\n\nНяшная же игра про котиков, даже не смотря на скудное исполнение, предлагает отвлечься от повседневных забот и насладиться легким интерактивом, дарующим умиротворение и спокойствие, так нужное в наше нервное время больших городов, от суеты которых хочется спрятаться в виртуальную реальность или в тихую глушь вдали от цивилизации. Но каждый раз свой дауншифтинг ты откладываешь на следующие выходные, а съездив на дачу на пару дней сполна утоляешь жажду дикаря и возвращаешься в пучину рутины со скукой, которая в водовороте дней крутит твои проблемы вместе с переживаниями, мимолетными радостями и ещё черт знает чем. Тыкаться мокрыми носами главных героев по закоулкам локации подобно слепому котенку, выискивая выход с уровня, местами забавно, местами увлекательно, но всё равно в конечном итоге приходит сожаление, что это милая вещица не стала чем-то большим, чем очередной маленькой жемчужиной на одно прохождение. Короткое приключение котиков заканчивается так быстро, что с удовольствием тут же запускаешь AUTUMN версию, а следом и WINTER, которые к сожалению могут предложить только разукрашенные в другую палитру спрайты и бэки.\n\nГемплейно «GAY CATS...» повторяет одну из предыдущих игр Auntie Pixelante под названием [Emotica](http://auntiepixelante.com/emotica/). Только вместо статичных иконок здесь используются минималистические анимированные спрайты при сохранении общего концепта — игра без сложности с простеньким исследованием небольших локаций.\n\n![gay-cats_2.png (766x383)](data/img/post_2_gay-cats_2.png)\n\nВ игре особое место уделено мелким деталям, которые оживляет этот мертвенно-цифровой мир. Звуковой ли это эффект колокольчика или анимация распускания цветка, а может быть грибочек, при касании которого он превращается в улитку. Всё это создаёт расслабляющую атмосферу, которая подстегивает игрока исследовать каждый тайл локации, что пятимянутное прохождение неожиданно трансформируется в 15-ти, а то и в 30-ти минутное. Удивительно здесь то, как разработчик заставляет поверить игрока в живость мира, который пускай и виртуально, но живет. При этом я не имею ввиду некую живость, как развитие мира. Мир статичен. Это всего лишь пачка уровней, которые сменяют друг друга по триггеру-выходу, когда его касаются один из героев. Но все эти незначительные на первый взгляд моменты, как-то описанные выше, вдыхают жизнь и игра воспринимается совсем по другому, если бы этих моментов не было. Не про это ли говорил сначала Кактус в своей [лекции](http://www.youtube.com/watch?v=ascLRP12P2Q), а затем, подхватив тренд, Нупр в своей [статье](https://andtheblackwindhowls.wordpress.com/2015/03/10/%D0%BF%D1%80%D0%BE-%D1%81%D0%BE%D0%BA/)?\n\nЦелью всей игры, а следовательно и мотивацией главных героев является желание попасть на пляж на пати к своим друзьям. В конечном итоге все мы хотим обрести покой в кругу интересных нам, разделяющих наши взгляды и понимающих конкретно нас людей. Их стремление понятно и близко большинству людей, а возможно является скрытым стремлением разработчика, которого, если читать её твиттер и посты, раздирают внутреннее беспокойство и поиски своего места в этом безусловно красивом, но чужом мире. Игра, как аллюзия на жизнь разработчика. Хотя прототипами послужили домашние животные, но мне кажется, что **Anna Anthropy** не до конца искренна. Эта игра не про их с партнером кошек, а про самих них и их мечту — найти место, где они будут поняты.\n\n![anna-anthropy.jpg (714x335)](data/img/post_2_anna-anthropy.jpg)\n\nИгра полностью проспонсирована донатерами с сайта [patreon.com](https://www.patreon.com/queenofspace/overview), что в последнее время становится чуть ли не единственным оплотом тру инди, где такие разработчики могут собрать хоть какие-то деньги, помогающие сводить концы с концами и дарующие шанс продолжить творить так, как хочется сердцу, а не разуму, который понимает, что прогнуться под этот изменчивый мир намного легче, чем стоять вопреки всем на своем, отстаивая свой маленький кусочек пляжа под солнцем.\n\n[Страница игры](https://w.itch.io/gay-cats-go-to-the-weird-weird-woods)\n[Страница автора в вики](https://en.wikipedia.org/wiki/Anna_Anthropy)"
		}
	]
}