{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1560245103_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1560245103_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 1,
				"body": "The data is scraped from the JSON files (`data.json` in most cases) and put in a local read-only SQLite database, you can't update or delete rows and expect the changes to be delivered to your peers, you can only change the data for your peers if you or your users change the JSON files.\n\nThe JSON files are scraped according to the `dbschema.json` file, how it works in detail you have to dig the code base.\n\nMore info here:\n\nhttp://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/site_development/dbschema_json/\n\nPull request to improve the ZeroNet documentation can be made here:\n\nhttps://github.com/HelloZeroNet/Documentation",
				"added": 1560286815
			}
		],
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 2,
				"body": ">free yourself from this all-masonic-desire to change the world.\n\nWhat would be the goal of instilling the desire to \"change the world\" in others?",
				"added": 1560288011
			},
			{
				"comment_id": 4,
				"body": "I think the core of the problem lies in the word itself, it is implied that change == good, and not changing == bad.",
				"added": 1560288600
			}
		],
		"1560265752_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 3,
				"body": "Don't think, democracy == good, everything else == bad. I agree, people should understand the words they're using.\n\n---\n\n>    The conscious and intelligent manipulation of the organized habits and opinions of the masses is an important element in democratic society. Those who manipulate this unseen mechanism of society constitute an invisible government which is the true ruling power of our country. We are governed, our minds are molded, our tastes formed, and our ideas suggested, largely by men we have never heard of…. It is they who pull the wires that control the public mind.\n\nEdward Bernays, in his book Propaganda (1928)\n\n\n",
				"added": 1560288422
			},
			{
				"comment_id": 6,
				"body": "> \"a necessity\", yes for them, \n\nSorry I copied a bit from that article for context, not my opinion.",
				"added": 1560289592
			}
		],
		"1560146219_159A9mgy8Rj1VR6hVoen597LKFZYuvU722": [
			{
				"comment_id": 5,
				"body": "> [anonymouslogin](#comment_343_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Firstly, God does not exist (at least from our perspective). Placing or attempting to place something above it makes absolutely no sense.  [...]\n\nIt's hard to deny the existence of something you haven't defined. What is God?\n\n>In the beginning was Logos, and Logos was with God, and Logos was God.\n\nLogos was God? What is Logos, no idea ... it is translated as \"the Word\" but how vague is that.\n\nhttps://en.wiktionary.org/wiki/λόγος#Ancient_Greek\n\nhttps://en.wikipedia.org/wiki/Logos",
				"added": 1560289067
			}
		]
	},
	"comment_vote": {}
}