{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "有害还是无害，这并不是关键，关键是选择决定的权利!!",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/",
			"added": 1503408625
		},
		{
			"topic_id": 2,
			"title": "郭文贵爆料—中南海穷途末路，陷入最后的疯狂！！",
			"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/  \n曹长青痛批美联社和胡舒立关于郭文贵所谓强奸女助理的报导\n\n美联社关于郭文贵涉嫌强奸女助理的报道完全不专业。有关“强奸”只有二百多字，没有见到“受害者“，简短【电话】采访，对“她”的引言只有13个英文字，还没敢提“她”的名字等等。美联社为什么会犯如此低级错误？是不是上面下指令要求写的呢？看看其社长跟中共喉舌的关系，你怎么判断？很多人同意：美联社部分人士丧失良心，是中了伪共匿产帮的“蓝金黄”病毒。\n\n郭文贵爆料引起巨大轰动，中南海已经阵脚全乱，才会公开打出各种疯狂的下三滥招式。\n种种迹象说明：中南海穷途末路，陷入最后的疯狂！！只有小规模金钱腐败、没有参与太多杀人罪孽的贪官们应该准备反戈一击了，以求自保。五毛党们、黑客们可以考虑以零网的新技术比较难对付为理由，多搞一些维稳经费，也随时留意机会反戈一击吧。",
			"added": 1505047202
		},
		{
			"topic_id": 3,
			"title": "支那黑客的“死法”",
			"body": "关于普通中国百姓的死法，在雾霾天朝的“伟光正”统治下，吃地沟油、吸雾霾而光荣离世的人，比例必然越来越高。地沟油、雾霾、三聚氰胺等“伟光正”现象，无论多么“伟光正”， 对于中国普通百姓而言，多数百姓还是默默地生在支那国，然后又默默地离开“支那专政国”。 他们无论怎么辛勤地折腾，始终无法像“八宝山”的那些匿产帮蛆虫们死得那么“伟光正”， 死去时每个人身上还要披一件“血腥红”专政特权的标志 —— 耀眼夺目的“伟光正”旗帜！ \n\n与普通百姓比起来，还是有一些支那人的死法是特别惹人注目的。那些支那式的“死法”虽然不一定达到“伟光正”的血腥红级别，但是仍然有很多粉红色的、炫目光彩，值得普通人予以特别关注。 \n\nhttp://127.0.0.1:43110/NewGFWTalk.bit/?Topic:2_12pu2MFpjqWpNd4TqLC6edzMtEczQ2vLti/+rvier+rwxy+zerome  \n对于一些帮“伪共”支那蛆到零网来钓鱼的支那黑客，愤怒的网友们诅咒它们早日被支那粪坑淹死。但是它们不一定死在暗无天日的网络柏林墙内，而是更有可能比雷洋死在“伟光正”的大海里。\n\n它们做的间谍工作越来越多，它们离坟墓也就越近。不一定是觉醒起来的广大群众非要弄死它们不可，而是为支那蛆虫帮效力、替江家干活的人通常是不得好死的。像雷洋那样被嫖娼死，死得不够“伟光正”；像马航飞机上的支那人那样死去，无论体制内的间谍特工、高级黑客，还是体制外拯救江家性命的医生，或者对支那蛆认识不够的普通过客，它们的死法，无非就是比“雷洋被嫖娼死”更加“伟光正”一些，是支那人遥控飞机，导致“飞机不小心失事”，以致于那些支那人比雷锋更加勇敢地跳到大海里喂鱼去了！\n如此“伟光正”的死法，也许比“雷洋”家属的荣誉感更高一些，因为它们的死法，虽然无法达到“八宝山”级别的、“血腥红”的“伟光正”，但毕竟还是带有那么一些”支那太监“级别的、带有“粉红色”傲慢的“伟光正”。马航死难者的家属们，无论是来自中南海的体制内，还是来自类似泸州抗暴群体的最基层草根，如果他们拥有“申纪兰级别的”、支那太监式的“粉红色”觉悟，是否应该像申纪兰一样，热烈庆祝毛泽东迫害邓小平的“伟大胜利”，或者热烈庆祝邓小平转过来迫害毛远新的“伟大胜利”，或者更加兴奋地庆祝新时代的支那特色高度自信，终于把邓小平的孙女婿吴小辉送进地狱了？!! \n无论情况多么糟糕，泸州群体抗暴的事实都以最简单的逻辑告诉人们，中国最底层的百姓已经普遍觉醒，“申纪兰级别的”支那人渣会越来越少！\n网友们共同努力，让泸州群体抗暴的运动在多个地区同时发生，以拥护“千年太祖”习仲勋，或者“千年圣君”习近平为名义，废除辱习反华的网络柏林墙，让体制内外的申纪兰人渣发挥不出来捣乱作用，是完全有可能的策略—俗称“郭七条”运动。\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
			"added": 1510714777
		},
		{
			"topic_id": 4,
			"title": "零网用户拥有准管理员的权限",
			"body": "一些资料给新手参考，具体细节见以下页面，有截图。\nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:3_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/",
			"added": 1596087020
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"6_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 1,
				"body": "不喜欢零网的可以向中南海的伪共匿产帮举报零网，让他们派出更多黑客攻击零网的公网页面，这也是经常出现的“新常态”；当然，在公网不正常的情况下，零网的本机页面也一直工作正常，这也是新出现的“新常态”！！黑客们经常浪费功夫，可以省点劲，不如花心思多搞点经费，然后尽快离开支那专政国，移民到海外去。为支那蛆虫效力，知道太多黑幕，反而随时面临被灭口的危险。被支那蛆虫党颐指气使地做坏事，不是可以长久干的。被派去香港的支那警察特务因为参与太多特务黑幕活动，很多人比维权律师们还更要担惊受怕。  \n对于盘踞在中南海的那一群披着“共产党”外衣，实际上连官僚财产都不敢公开的伪共匿产帮，有人认为他们代表“伟光正”的“中共”，也有人认为他们是支那蛆虫帮、粪坑党。伪共匿产帮真的是一贯地代表伟大、光荣、正确的“伟光正”吗？这不是最重要的逻辑，最重要的是，认为伪共匿产帮是代表宇宙真理的那些人，如果他们是真心地拥护伪共匿产帮的”伟光正“，就应该坚决支持以持枪权捍卫真理的原则。1949年前曾经有过比较广泛的持枪权，这也是1949年前没有出现大饥荒、浮夸风等人间灾难的原因，而黄豆选举等民主自由只是辅助性的因素！如果有人有更好的逻辑，请将细节逻辑展示出来。",
				"added": 1502421115
			}
		],
		"9_19DbcsQyB2YM8zQJCiyB8jPB7JxvuwnxYh": [
			{
				"comment_id": 2,
				"body": "其实网友已经说得很清楚了，这根本不是什么以“淫秽”的话题去攻击某人，而是借题发挥，展开探讨。须要特别指明，是否涉及“淫乱”不是最重要的问题，最重要的问题是，假装为“伟光正”、“真善美”之类的清高，实际上连信息都不敢让人们“共享”。信息“共享”主义都不敢实行，还瞎扯一些“共产共妻”之类的“共产主义”理想，简直是太无法无天了！！ \n看到网友对于各种真假难辨的“淫乱”传闻展开探讨。“共产共妻”是否合理也不是最重要的，最重要的是，认为“共产主义”是代表“宇宙真理”的那些人，他们需要有起码的勇气，敢于恢复1949年前曾经有过的以持枪权捍卫真理的红军精神，而不是与连官员财产都不敢公开的“伪共匿产帮”们狼狈为奸，还口口声声自以为是代表“伟光正”的“中国”的“共产党”。一些匿产帮爪牙们甚至一边为“伪共匿产帮”辩护，一边还自称支那匿产帮是代表的“中华”的、人民的“共和国”，还要求其他人一起把支那蛆虫当成宇宙真理，同时又不敢推行以持枪权捍卫真理。这种自相矛盾的乱象，有一定阅历的网友们都容易看懂。\n退一万步说吧，某些人即使仍然认为中南海的“伪共匿产帮”仍然代表“伟光正”的宇宙真理，就为了一起维护这么伟大的“宇宙真理”，也仍然需要推行持枪权捍卫真理的原则。1949年后，毛泽东悄悄背叛宪政民主，一些人明知支那专政有问题，仍然高呼老毛万岁。毛泽东固然虚伪，拥护毛泽东的那些支那伪类比毛泽东更加虚伪。类似申纪兰那样的支那伪类，迫害刘少奇、彭德怀等人，申纪兰热烈赞成；平反刘少奇、彭德怀等人，申纪兰仍然热烈赞成。 类似申纪兰这样的支那伪类，到底应该称为支那人，还是支那蛆虫、支那孽障？或者说，申纪兰等人只是比王瑞林等人级别低很多的支那苍蝇？那些虚伪的支那伪类，看到毛泽东迫害邓小平，他们个个兴高采烈；等邓小平得势了，反过来迫害毛泽东的侄子毛远新，支那伪类们个个仍然是兴高采烈。\n如何以更好的词语来描述支那伪类，这是个值得深入探讨的问题。\n希望更多网友们一起觉醒。让反蛆除孽的爱国运动，伴随着零封锁的网络不断传播开来！",
				"added": 1502422097
			},
			{
				"comment_id": 4,
				"body": "在乌鸦掌控的世界里，洁白的羽毛是有罪的； 甚至谈论是否该追求洁白的羽毛也是禁忌话题，是反革命，这就是支那蛆的荒唐暴政。 针对五毛党发布的其它帖子，不须予以过多的评论。有闲工夫的时候，多去谈论更有意义的话题，包括就真假难辨的“淫乱”传闻展开真理标准的探讨，以及如何推行以持枪权捍卫真理的问题。这才是更重要的事情。所以不必天天上零网，但有闲工夫时，要让更多人使用零网。",
				"added": 1502702959
			}
		],
		"1_1EEBZ23ns3i3gBpeZV6HcYDe9tQ3zsydZk": [
			{
				"comment_id": 3,
				"body": "> [ajkhuw](#comment_2_18LtMTFdyyGXJkePz1HB2twWhcXho7uDf8): 而且现在也不是自由不自由的问题，大家是要真相的，虽然有人发楼主贴的那些东西出来扰乱视听，但那些大爷干的那些事，甚至因为违反其它国家的法律被公之于世，怎么可以不让老百姓知道\n\n顶！但是这个所谓“垃圾”评判的帖子，似乎的确非常像是五毛党、七毛党来发帖。 五毛党、七毛党一般都水平太差，往往自相矛盾。假如相关话题真的是“垃圾”，自然就不值得批评；既然引来了五毛党的火力，说明这种话题比较有力量，需要更多网友进一步跟进，进行更广泛的探讨，探讨越多，意义越大！\n无论毛泽东、邓小平、习近平哪一个人代表“宇宙真理”，还是他们全部代表“宇宙真理”，如同法轮功代表“宇宙真理”一样，那么，只需简单地顺着他们的逻辑，既然是“宇宙真理”了，就非常有必要推行持枪权来捍卫“宇宙真理”。如果他们不敢推行持枪权来捍卫“宇宙真理”,那么，他们就没有谈论“真理”的资格。五毛党、七毛党的逻辑混乱还在于，既然把毛泽东捧上了“万岁”神坛，却不敢坚定地要求推行持枪权去捍卫“万岁不朽”的毛伟人， 以致于五毛党们其实一直都是拖累支那蛆虫帮的毒瘤而已。毛泽东在世时，五毛党们像申纪兰一样不断地举手拍马屁，让老毛在自欺欺人的狂热暴政中跌入深渊；毛泽东去世后，五毛党们又像申纪兰一样不断地拍邓小平的马屁，个个兴高采烈地看着江青、毛远新等被送进支那蛆的人间地狱。\n虽然薄熙来、毛远新等人没有像雷洋那样被人间蒸发，但是支那蛆的大粪坑暴政已经维持不下去了。\n\n针对五毛党的帖子，不须予以过多的评论。有闲工夫的时候，多去谈论更有意义的话题，包括就真假难辨的“淫乱”传闻展开真理标准的探讨，以及如何推行以持枪权捍卫真理的问题。这才是更重要的事情。所以不必天天上零网，但有闲工夫时，要让更多人使用零网。",
				"added": 1502702726
			}
		],
		"1_1KjXPsZvqH75qqrdinTA5dYmX18tcTLihj": [
			{
				"comment_id": 5,
				"body": "这种信息疑似钓鱼，放QQ太假了。应该放个Gmail或支那专政国之外的其他联系方式。看来自由论坛等零网站点引起了复杂人群的关注。",
				"added": 1502940994
			},
			{
				"comment_id": 6,
				"body": "骂追求民主自由的人为“畜生”？可是“畜生”也有不少是通灵性的，与那些毫无灵性的支那蛆虫比起来，“畜生”比支那蛆虫还是更高尚一些。所以还有网友说得更彻底，在这个特殊的历史阶段，\n香港人斥责伪共“匿产帮”“粪坑党”为支那人和支那国，实际上是抬举他们了。为了避免特务们混淆是非，制造大规模的摩擦冲突，大家一起明确地将反对的目标界定为不敢公开官僚财产的伪共“匿产帮”，而不是有数千万党员的“中共”，可以公开痛斥伪共“匿产帮”匪徒们是支那蛆虫、支那孽障。扫帚不到，灰尘不去；全民行动，反蛆除孽。反蛆除孽和反华反共没有一点关系。 港澳台信息和人员组织更自由，可以在香港公开发起爱国运动，以拥护千古“圣君”的名义，公开敦促香港政府支持习近平翻墙救国，公开要求废除辱习反华的网络柏林墙。香港小圈子选举出来的伪特首林郑月娥刚好要不断地展示效忠党国的诚意，经常强调爱党爱国，这种方式，将让林郑月娥、五毛党和七毛党们也找不到反对的理由。被欺骗去维稳的警察们也在不断觉醒，运动一旦发起，大陆军民都会积极响应。\n零网、零封锁，自由无国界！零网比推特或者/Facebook等更自由，不需要绑定邮箱或手机。请港澳台同胞多使用零网，探讨交流非暴力爱国运动。\n华夏同胞，行动起来！睁开眼吧，放声吼吧：习核心雄起、习核心不龟缩！中国梦不是狗的梦！废除法西斯围墙、洗雪当代国耻！全民行动，反蛆除孽；清除伪共匿产帮，恢复宪政共和；清除蛆虫党，恢复中华。 \n**[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)**\n** [转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)**",
				"added": 1503198827
			}
		],
		"4_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 7,
				"body": "> [666666666666](#comment_3_14YVZ2ZtM9nPHP5KTnRThVDBAeb2juw829): 五毛党，sb\n\n不用浪费太多时间跟五毛党争论。五毛党增加只是说明零网的影响力在增强，但是还需要更多人看到零网。有空闲时间多传播零网，传播文贵爆料，也总比跟五毛蛆争论更有益。\n\n伪共“支那蛆”不只是中华民族的毒瘤，也是全人类的公敌。支那丛林暴政是中国大陆众多苦难的根源，随着文贵爆料的影响力不断往纵深扩展，伴随着地产浮夸风崩溃和社会危机的爆发，越来越多人会像泸州群体抗争那样，主动发起跨地区、跨行业、跨种族的民众大联合。\n\n**[汉族和穆斯林联合起来，推翻支那暴政!!](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:12_14DohZaXnmVFKeqjygMwh9KfygmhzXFa8e/ )** \n链接分享：\nhttps://iteoedugr0-my.sharepoint.com/personal/0_xxxo_ga/_layouts/15/guestaccess.aspx?folderid=1a9ac9411acbd40d6be0541eb927a90fa&authkey=AapYrABjsLc5PkF9nj8WDVc \n**[传播“习氏”真理、全民上街、分房分钱!!!](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1GvFma4ejwEgao2GjFZ8SjwZw4YzPHuFg9/)**",
				"added": 1509719594
			}
		],
		"1_1E4SooJUJ2FzgosQQaDw2ukLHpDrwfCrrh": [
			{
				"comment_id": 8,
				"body": "可能受到伪共黑客攻击，新开站点的节点通讯有问题。但是，在很多网站瘫痪的情况下，零网的用户通过本机页面进行交流，这个功能一直运作。耐心等一段时间，观察看看。\n如何更好地保护节点通讯？技术高手们有空时可以进一步探讨。",
				"added": 1510642990
			}
		],
		"3_1QTvrYLi7ekjuhgDSJ3yzLY6R2KE5GnGf": [
			{
				"comment_id": 9,
				"body": "福建一商人被抓5天后企业倒闭，两亿财产被法院拍卖偿债，看守所关押456天，取保后确认肺癌晚期，死后法院裁定其无罪，国家赔偿14万元……\n\n——可见，郭文贵现象不是孤立的，爆料不虚！\n郭文贵爆料已经产生蝴蝶效应，越来越多人受到激励，加入抗争队伍。网友们共同努力，文明变革，必然爆发。群体运动变革爆发的时间点由上帝决定，现在该做的就是不断地向更多群体传递蝴蝶效应！",
				"added": 1510663889
			},
			{
				"comment_id": 10,
				"body": "原美国总统川普总战略顾问班农将在第十二届族群青年领袖研习营上演讲 http://yibaochina.com/FileView.aspx?FileIdq=7452 研习营将聚集约60位来自世界各地（包括中国国内）的代表上述群体的人权人士，聆听演讲、参与研讨、接受训练。 嘉宾演讲和研讨会将围绕着三个题目进行。",
				"added": 1510663944
			}
		],
		"3_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx": [
			{
				"comment_id": 11,
				"body": "在民运长者中，部分人士年纪有点大，所以需要一定的时间去了解、熟悉这种基于比特币技术搭建的全新技术。也不怕网友们笑话，鄙人以及身边的其他网友们早前也不知道零网的先进功能，最初也觉得不可思议，经过一小段时间的尝试，确实看到了零网的先进之处：各种传统的网络都可以被瘫痪，包括零网的公网页面也可以被瘫痪，但是零网的本机页面一直都工作正常。 这种技术确实太不可思议了！\n目前在探讨的全民共振，绝对不是习呆呆那样的“三个自信”瞎吹牛，而是有广泛的群众需求，有广泛的群众觉悟为基础！这是一项顺应天意、符合民心的世纪伟业。哪怕网络封锁有多么荒唐，全球各地的志愿者们都不畏艰险、源源不断地加入这个天然的正义进程！\n \n**[新手须知:零网实际上的节点和人数远远超过表面上显示的数字 ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:1_1DbrSfnbumfV45oVXiprzK6N9qSHCsWGx/)**\n**[怎么打开端口15441? ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PgYTFxzZnRteZTPSF3WWS93tPGk7CfnoW/+15441)**",
				"added": 1520828314
			},
			{
				"comment_id": 12,
				"body": "有人害怕了吗？全民共振，顺应天意、符合民心。多数人欢迎，但也有人害怕。那是自然。具体结果，由上天决定，网友们该做的，就是尽最大努力推广、传播，让更多人看到历史新潮流！",
				"added": 1520832852
			},
			{
				"comment_id": 13,
				"body": "都已经这个关头了，如果还把“全民共振”当成娱乐话题，那就不叫“中国人”，而是支那猪。一些人嘲笑“全民共振”，却又不去搞武装革命，那与支那猪也类似。用下三滥话语攻击议题，那不叫讨论，是纯粹的浪费时间。 就此打住，一些下三滥话语比较多的信息，建议网友们予以屏蔽。",
				"added": 1520856618
			}
		]
	},
	"comment_vote": {}
}