{
	"file": {
		"undefined": {
			"title": "Kenji Kawai - Making of Cyborg",
			"type": "video",
			"description": "Write description here!",
			"is_featured": 0,
			"image_link": "img/video_empty.png",
			"size": 15042588,
			"date_added": 1511051276
		},
		"Kenji Kawai - Making of Cyborg.mp4": {
			"title": "Kenji Kawai - Making of Cyborg",
			"type": "video",
			"description": "Ghost in the Shell\nFrom Wikipedia, the free encyclopedia\nThis article is about the media franchise in general. For specific works and entries in that franchise, see Ghost in the Shell (disambiguation).\nAdd to Google CalendarGhost in the Shell\nGhost in the Shell 1995 logo.png\nLogo used in the 1995 film adaptation of the series. A modified version of this logo is used in the 2004 film Ghost in the Shell 2: Innocence without the pyramid in the center.\nCreated by\tMasamune Shirow\nOriginal work\tThe Ghost in the Shell\nPrint publications\nBook(s)\t\nThe Ghost in the Shell\nGhost in the Shell 2: Man-Machine Interface\nGhost in the Shell 1.5: Human-Error Processor\nFilms and television\nFilm(s)\t\nAnimated:\n\nGhost in the Shell\nGhost in the Shell 2: Innocence\nGhost in the Shell: Stand Alone Complex - Solid State Society\nGhost in the Shell: The New Movie\nLive-action:\n\nGhost in the Shell\nAnimated series\t\nGhost in the Shell: Stand Alone Complex\nGhost in the Shell: S.A.C. 2nd GIG\nGhost in the Shell: Arise - Alternative Architecture\nGames\nVideo game(s)\t\nGhost in the Shell\nGhost in the Shell: Stand Alone Complex (2004 video game)\nGhost in the Shell: Stand Alone Complex (2005 video game)\nGhost in the Shell: Stand Alone Complex - First Assault Online\nMiscellaneous\nOVA\t\nGhost in the Shell: Stand Alone Complex - The Laughing Man\nGhost in the Shell: S.A.C. 2nd GIG - Individual Eleven\nGhost in the Shell: Arise\nGhost in the Shell (Japanese: 攻殻機動隊 Hepburn: Kōkaku Kidōtai, \"Mobile Armored Riot Police\") is a Japanese media franchise originally published as a seinen manga series of the same name written and illustrated by Masamune Shirow. The manga, first serialized in 1989 under the subtitle of The Ghost in the Shell, and later published as its own tankōbon volumes by Kodansha, told the story of the fictional counter-cyberterrorist organization Public Security Section 9, led by protagonist Major Motoko Kusanagi, in the mid-21st century of Japan.",
			"is_featured": 0,
			"image_link": "https://i.pinimg.com/736x/bb/35/5c/bb355ce7567f1ce17362c4d7edf91877--kenji-kawai-ghost-in-the-shell.jpg",
			"size": 15042588,
			"date_added": 1511051875
		},
		"1511139243-Best of G.I. Joe PSAs.mp4": {
			"title": "Best of G.I. Joe PSAs",
			"type": "video",
			"description": "G.I. Joe is a line of action figures produced and owned by the toy company Hasbro.[3][4] The initial product offering represented four of the branches of the U.S. armed forces with the Action Soldier (U.S. Army), Action Sailor (U.S. Navy), Action Pilot (Air Force), Action Marine (Marine Corps) and later on, the Action Nurse. The name derived from the usage of \"G.I. Joe\" for the generic U.S. soldier, itself derived from the more general term \"G.I.\".[5][6][7] The development of G.I. Joe led to the coining of the term \"action figure\". G.I. Joe's appeal to children has made it an American icon among toys.[8]",
			"is_featured": 0,
			"image_link": "http://i.ytimg.com/vi/ogEtfIdgjpY/hqdefault.jpg",
			"size": 26705580,
			"date_added": 1511139244
		},
		"Juno Reactor - God Is God [HQ High Quality].mp4": {
			"title": "Juno Reactor - God Is God [HQ High Quality]",
			"type": "video",
			"description": "God is God – siódmy singel oraz utwór brytyjskiego zespołu Juno Reactor wydany 25 maja 1997 roku w Wielkiej Brytanii przez wytwórnię Blue Room Released (wydanie CD i 12\"). Singel pochodzi z czwartego albumu Juno Reactor – Bible of Dreams, składają się na niego 4 utwory: tytułowy \"God is God\" w trzech remiksach oraz b-side \"Biot Messiah\". Utwory te, podobnie jak większość produkcji zespołu, należą do nurtu muzyki psychedelic trance oraz goa trance.\nPoza podstawową brytyjską wersją singla wydano również na CD wersję amerykańską, na której znajduje się 7 remiksów \"God is God\". Poza singlami na nośniku CD wydano również wersje na płytach winylowych (Wielka Brytania, USA i Włochy) oraz specjalną brytyjską edycję singla \"God is God (Front 242 Mixes)\" (21 grudnia 1997) z dwoma remiksami.",
			"is_featured": 0,
			"image_link": "https://i.ytimg.com/vi/nUQk-gZwmpI/maxresdefault.jpg",
			"size": 24536388,
			"date_added": 1511139569
		}
	}
}