{
	"pages": [
		{
			"id": "08f38100-0bf1-11e8-8612-ed4f1e8aa1cf",
			"body": "# Lisp\n\nLisp (historically, LISP) is a family of computer programming languages with a long history and a distinctive, fully parenthesized prefix notation.Originally specified in 1958, Lisp is the second-oldest high-level programming language in widespread use today. Only Fortran is older, by one year. Lisp has changed since its early days, and many dialects have existed over its history. Today, the best known general-purpose Lisp dialects are Common Lisp and Scheme.\n\nLisp was originally created as a practical mathematical notation for computer programs, influenced by the notation of Alonzo Church's lambda calculus. It quickly became the favored programming language for artificial intelligence (AI) research. As one of the earliest programming languages, Lisp pioneered many ideas in computer science, including tree data structures, automatic storage management, dynamic typing, conditionals, higher-order functions, recursion, the self-hosting compiler, and the read–eval–print loop.\n\nThe name LISP derives from \"LISt Processor\". Linked lists are one of Lisp's major data structures, and Lisp source code is made of lists. Thus, Lisp programs can manipulate source code as a data structure, giving rise to the macro systems that allow programmers to create new syntax or new domain-specific languages embedded in Lisp.",
			"date_added": 1517999050000,
			"slug": "lisp"
		},
		{
			"id": "f3e6b5c0-0bf0-11e8-b155-e908e183cf42",
			"body": "# Programming Languages | [[Programming]]\n\n* [[Python]]\n* [[JavaScript]]\n* [[SQL]]\n* [[Java]]\n* [[C]]\n* [[C++]]\n* [[C#]]\n* [[Rust]]\n* [[Haskell]]\n* [[Fortran]]\n* [[Pascal]]\n* [[F#]]\n* [[PHP]]\n* [[Lua]]\n* [[Go]]\n* [[Lisp]]",
			"date_added": 1517999014684,
			"slug": "programming-languages"
		},
		{
			"id": "e91368a0-0bf0-11e8-b155-e908e183cf42",
			"body": "# Programming Languages | [[Programming]]\n\n* [[Python]]\n* [[JavaScript]]\n* [[SQL]]\n* [[Java]]\n* [[C]]\n* [[C++]]\n* [[C#]]\n* [[Rust]]\n* [[Haskell]]\n* [[Fortran]]\n* [[Pascal]]\n* [[F#]]\n* [[PHP]]\n* [[Lua]]\n* [[Go]]\n* [[Scheme]]",
			"date_added": 1517998996522,
			"slug": "programming-languages"
		}
	]
}