{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1571663302_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "10minutemail.com updates their domains all the time. They are going to ask you for a phone number, search for a disposable sms number online. It may take some time to find an working number.",
				"added": 1571783246
			},
			{
				"comment_id": 2,
				"body": "> [ssdifnskdjfnsdjk](#comment_100_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Thank you 😍. Facebook accepted this mail. But i bet i will have problem when i will need to access same 10minutemail.com mailbox in future since there seem not to be any permalink to access same address again.\n\nIt only lasts 10 minutes. You should disable all facebook email notifications or they will complain in the future.\nDon't find it weird if they ask for you ID, they have been doing that for a while, normies seem to think this is completely acceptable.\nFake ids used to work but I haven't tested in a while.\n\nThere is a firefox extension, \"Bloody Vikings\", that automatically generates a disposable mail from many services and opens it in a background tab for you. You just have to right click a text box and choose the provider.",
				"added": 1571856436
			}
		],
		"1544691845_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "> [ssdifnskdjfnsdjk](#comment_47_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I just setup this extension (it is open source and has many interesting options to increase privacy) and using \"Random profile (Desktop)\", i am similarly unique (uniquenes per https://amiunique.org) as without using the extension. While i am keeping same IPv4 address (no one else is using - 100% uniqueness), i am wondering why it should be important to mix my browser fingerprint like user agent, OS, language and such while the uniqueness is similar while not doing so? ❓Maybe the tracking companies, ISPs can not guarantee visits i am doing are from single person (even it is one IPv4), because some IPs are being used by many people (example mobile network shared IPs).\n\nThe idea of those extensions is that you change the unique fingerprint all the time. To the trackers you will look like many different unique users.",
				"added": 1571856822
			}
		]
	},
	"comment_vote": {}
}