{"next_topic_id":6,"topic":[{"topic_id":1553103471,"title":"What happened to ZeroBoard?","body":"[ZeroBoard](/Board.ZeroNetwork.bit/) does not show any messages and doesn't seem to contain user data. Is it broken?","added":1553103470},{"topic_id":1553166302,"title":"Norwegian Police child porn honeypot in Direct Connect network","body":"Norwegian Police set up a honeypot with fake files with child porn names using police IP address range in Direct Connect network (DC/DC++).\n\n[/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1EtunFAaE5bnDSjWSSsCkxAu7EYikL56Um/src/2cdf1127c1e0d987e7d9805c5bdc87fc5d53b31c.png](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1EtunFAaE5bnDSjWSSsCkxAu7EYikL56Um/src/2cdf1127c1e0d987e7d9805c5bdc87fc5d53b31c.png)\n\nThis is what you get when you download any file:\n\n[/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1EtunFAaE5bnDSjWSSsCkxAu7EYikL56Um/src/a15c42a3831bce8c5ba92d21bd6ef5e8d66cbeeb.jpg](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/data/users/1EtunFAaE5bnDSjWSSsCkxAu7EYikL56Um/src/a15c42a3831bce8c5ba92d21bd6ef5e8d66cbeeb.jpg)","added":1553166300},{"topic_id":1555253500,"title":"ZeroNet bug: incorrect language variable expansion in GET request","body":"@nofish\n\nSeveral Zites, including ZeroHello and ZeroTalk, perform the following GET request (or similar, the problem is the same):\n\n`http://127.0.0.1:43110/Talk.ZeroNetwork.bit/js/all.js?lang={lang}`\n\nThat is, with `lang={lang}`.\nModern web browsers send curly brackets in GET parameter value unquoted, while some parsers (Java) do not expect that.\n\nIs that non-expanded variable a bug or a feature? Could it be fixed?","added":1555253497},{"topic_id":1555652637,"title":"Live video streaming zite example","body":"Here's an example of live video streaming in ZeroNet:\n\n[/1GVnY2gwrqXRsnYcpNtQQtri6ezqCKY2im/](/1GVnY2gwrqXRsnYcpNtQQtri6ezqCKY2im/)\n\nThis zite uses [clappr](http://clappr.io/) video player library which loads HLS video stream, which is pushed to ZeroNet (signed & published) every 30 seconds.\nVideo files are marked as optional, while playlist is not.","added":1555652633},{"topic_id":1566230571,"title":"TiddlyWiki ZeroNet support: compatibility fix and a saver plugin","body":"[TiddlyWiki](https://tiddlywiki.com/) is an in-browser wiki engine written in JavaScript which runs entirely in your browser and does not require a server. I made ZeroNet compatibility plugin which allows saving wiki data on ZeroNet using only your browser, without re-uploading TiddlyWiki file manually.\n\nIf you're not familiar with TiddlyWiki, read [interactive introduction to TiddlyWiki](https://tiddlywiki.com/editions/introduction/) or check out [the presentation](https://tiddlywiki.com/talkytalky/). Also visit [its homepage](https://tiddlywiki.com/) for more information.\n\nNow you can use TiddlyWiki for your ZeroNet zites.\n\n[TiddlyWiki on ZeroNet](/1MVyVRFfQ8nSR3dMxisz1pZBwrd8jJRezy/)","added":1566230566}],"topic_vote":{"1552575038_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P":1,"1552823531_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu":1,"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":1,"1569094102_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":1},"next_comment_id":130,"comment":{"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp":[{"comment_id":1,"body":"http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq/Livestreamed%20Video%20of%20Deadly%20Shooting%20Attack%20on%20Mosque%20in%20Christchurch,%20New%20Zealand.mp4\n\nBy self censoring yourself to the content, you are censoring your self to the truth. In any situation, if you feel like you can’t, won’t, shouldn’t or are not allowed to look at something, you open the door to allowing someone else to tell you what happened.\n\nBy not seeing things for yourself, you are opening the door to being lied to and persuaded in one direction or the other. No matter how brutal, hard, sad, offensive, immoral, obscene or [fill in the blank] something is to look at, only by seeing it with your own eyes can you make up your own opinion on the matter and see truth.\n\nWhen you bring yourself to look at the real violence in the world, it kicks your ass into realty because referring back to what I said earlier, everything I just said could be a lie.","added":1552737599},{"comment_id":3,"body":"Manifesto: http://127.0.0.1:43110/19k9BZR4VYfY2p2roqKDnJxtVpo8kM6HvV/","added":1552739111}],"1552676118_1FnQQkQ4AwjwBhbz61RmqPazDrvdBGy79K":[{"comment_id":2,"body":"http://127.0.0.1:43110/19k9BZR4VYfY2p2roqKDnJxtVpo8kM6HvV/","added":1552738728}],"1552725050_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":4,"body":"Absolutely anything actually, but it's aimed for programmers, to work with program source code. This is a distributed git system.\nTo learn more about git, visit: https://git-scm.com/ and https://github.com/","added":1552766092},{"comment_id":5,"body":"> [quantumkitty](#comment_203_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I was thinking more about GitCenter on ZeroNet. I need to include .stl files along with arduino/c and python.\n\nYou can do that, GitCenter _is_ a git repository storage. Read beginner's guide: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/guide/","added":1552767942},{"comment_id":8,"body":"> [kjhrktudtr](#comment_2_1MxmJ75jvC6LYVarK7JM1KxUq6dsGYm4Rb): can use gitcenter from CLI?\n\nYes.","added":1552806037}],"1552767554_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS":[{"comment_id":6,"body":"If firewall blocks this port, or if you're behind NAT, no peers would be able to connect to you. This greatly reduces connectivity, thus zite availability.","added":1552770261}],"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":7,"body":"This is beyond my comprehension.","added":1552805839},{"comment_id":9,"body":"Can anyone explain like i'm an autist, why they do this? Why shouldn't the video be shared, why people better not to watch that, why should people be prosecuted for possessing and sharing it?\nIt looks like the reason is quite clear for anyone, and it really puzzles me.","added":1552806722},{"comment_id":10,"body":"> [quantumkitty](#comment_207_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I'm guessing it might trigger some people who are sensitive to that content. Which is understandable. Then again, the sheer nature of the content is such that it tempts people to watch it, because the human mind is morbidly curious. Still. The punishment doesn't fit the crime.\n\nDo you mean that watching the video may provoke others to do the same? TV channels show car accidents, and it is unlikely they provoke someone IMO.\n\nI don't understand why this _should_ be punishable in the first place. How can this be illegal? I showed this video to my patents and friends right after I downloaded it, and explained that it's not only about terrorism, it's also 100% media-aware: the shooter had a portable speaker with meme songs only chan visitors would understand, with timed playlist; funny manifesto which also full of copypaste and memes.\n\nWhy 9/11 video was played on all major channels and TV programs from different angles, yet THIS video should be banned?","added":1552807290}],"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX":[{"comment_id":11,"body":"There's no \"server side\" (=php) code in ZeroNet, all user code is executed in browser and contain in .js files. The databases are user readable.","added":1552808954},{"comment_id":12,"body":"> [eighty4](#comment_1_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): So things like private chats and such are impossible?\n\nIt's possible but with additional protection measures. For example, you can use client-side message encryption. All the data will be still available for everyone, but it's all encrypted and can't be read by third-party.","added":1552814830},{"comment_id":35,"body":"> [malladis](#comment_1_18bPiPS2hgoc8pbS8Ku8aoWQ748jfC6vkV): Right, so basically it's impossible to run a site like Reddit/Facebook/Twitter etc. [...]\n\nIt's possible. It's implemented by so-called merger plugin which can connect (join) remote zites into current zite. Merger zites are usually created per-user, per-account or in a similar way, so you download and seed only data you are interested in.\n\nTake a look at [ZeroMe](/Me.ZeroNetwork.bit/) (Twitter alternative) or [ZeroMedium](/ZeroMedium.bit/) (medium.com alternative).","added":1553845248}],"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":13,"body":">The fact that it's based on an overly hyped technology that seemed very promising and revolutionary in the beginning (blockchain), but ultimately fell short of people's expectations and disappointed the world in 2018.\n\nBut ZeroNet is not based on Blockchain.","added":1552861005},{"comment_id":14,"body":">The fact that you have to download a zip file to be able to access it.\n\nGo and set up inproxy (Internet → ZeroNet proxy).\nActually, I'm puzzled on why there are so many IPFS proxies (even by huge companies like Cloudflare), yet there's only one open ZeroNet proxy I know: 0net.io.","added":1552861069},{"comment_id":15,"body":"Automatic video encoding may be possible in modern browsers with webassembly. It was possible long before webassembly with EmScripten+asm.js (see [ffmpeg.js](https://github.com/Kagami/ffmpeg.js/)), but it's relatively slow.","added":1552861325},{"comment_id":16,"body":"> [toyata](#comment_55_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Maybe one idea is to link to allow and only one specific zite without the \"0\" at top corner? So people then only see e.g. ZeroTalk linked to e.g. clearnet talk.zeroportal.io?And on startpage zeroportal introduce those pages linked.\n\nI thought about that and proposed to implement special DNS record, see https://github.com/HelloZeroNet/ZeroNet/issues/391#issuecomment-435372284","added":1552909562}],"1552916412_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde":[{"comment_id":17,"body":"The principle is somewhat similar to Tor onion routing. Yes, it's considered to be secure at current time.","added":1552919256},{"comment_id":18,"body":"> [i2pxmr](#comment_3_1PQQRjVa9rQXnDrWxPPqwroBRroz5F6DFh): Tor was not designed to run with bittorrent. By using bittorent over Tor, you are hurting the Tor network.\n\nThis is hoax. When Tor developers say that Tor should not be used with Bittorrent, they refer to usual Bittorrent clients which will connect only to clearnet nodes, hurting Exit Node bandwidth.","added":1552933148}],"1552994065_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg":[{"comment_id":19,"body":"https://zeronet.io/docs/site_development/content_json/#signers_sign","added":1552994864},{"comment_id":21,"body":"> [ssdifnskdjfnsdjk](#comment_732_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): where to get \"signer address\" mentioned on that page? Is it user's public key? in my case 1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS (when you hover over my username near my post)? [...]\n\nSigner address is a random bitcoin key, as far as I understand.\nAnother person need to generate additional bitcoin address, open the zite, pull \"0\" to the left, set a tick on \"this is my website\", press \"Add saved private key\", copy-paste bitcoin private address.\nThis person gives to you (the zite owner) public bitcoin address, you add it into signers_sign/signs_required and public changes.\nAfter this, both persons are zite owners.","added":1553023781}],"1552994800_1Gn3VCPeEdJaKUhFQKaJzS8DmdqnC4F7uB":[{"comment_id":20,"body":"You can use Tor.","added":1552994883}],"1553103471_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq":[{"comment_id":22,"body":"> [pexo](#comment_70_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): ZeroBoard was(is) an really old proof of concept zite to showcase how dynamic content could work on ZeroNet. It heavily relied on a backend server, that would receive the posts and sign and publish them. Nofish said a few months(I think) back, that he was planning to pull the plug at some point.So I think that's just what happened.\n\nI had a feeling that ZeroBoard used client-server architecture but didn't dive into the code to check that.\nNoFish could at least leave a message that the board is now longer works.","added":1553104287}],"1553079752_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1":[{"comment_id":23,"body":"Try to set the following before running ZeroNet, it may help on OpenVZ:\nulimit -s 1024","added":1553125439},{"comment_id":28,"body":"@60, how are you going to handle abuse messages? There were several ZeroNet gateways but they didn't last long generally because of CP and such.\n\nThere is https://proxy.zeronet.a0z.ru/ by Balancer, but he died several months ago, and I'm not sure what's going to happen with this proxy.","added":1553625334},{"comment_id":29,"body":"> [60](#comment_50_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): did you mean he died physically or he stopped getting online anymore? [...]\n\nHe died physically.\n[/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45](/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:45)","added":1553638218},{"comment_id":30,"body":"> [60](#comment_50_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): and for the cp metter, they don't really care about zn\n\nWhat I wanted to say is that if you allow every zite on your gateway, sooner or later somebody will open child pornography zites and report links for the images/videos/pages/etc to your hoster. You hoster most probably will suspend or terminate your gateway.\n\nBalancer avoided it by blocking new zites. Only known zites added by him are allowed on proxy.zeronet.a0z.ru.","added":1553638454},{"comment_id":31,"body":"> [ssdifnskdjfnsdjk](#comment_760_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think many hosters first notice client and you have to take down content in 24 hours. True that i do not have experience with child p0rn, that content is rare. For peace of mind, you may ask your hoster what they do in case of report. If the risk is too big, you can disable adding new sites and remove ones that can host user submitted content like millchan, kopykate..\n\nI don't have any public gateways, but I do have a VPN service, which may be compared with a lite version of Tor exit node. Most abuse messages I get are DMCA copyright violations which require little to no action in most jurisdictions. Sometimes I get more serious messages, like someone used VPN to scan RDP servers, hacked into one of them and uploaded a ransomware cryptolocker which encrypted files on the server.\n\nAnyway, by running public gateway, you're not only host the files (let's say child porn here) but also freely distribute it. I would recommend @60 to make a zite which will briefly describe how ZeroNet works, what this site (=gateway) work exactly, leave an abuse contact and set it as a ZeroNet homepage for it to open as a main page.","added":1553642568},{"comment_id":32,"body":"> [60](#comment_52_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): i'm gonna do this by modding the uipassword plugin\n\nYou can just set the homepage, use `--homepage` CLI flag or set it in `zeronet.conf`.","added":1553642865},{"comment_id":33,"body":"> [60](#comment_53_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): by doing so, zerohello wont be able to list sites\n\nHuh, why? It works for me.","added":1553665878},{"comment_id":34,"body":"> [60](#comment_54_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): idk, and do you have something like a porn list?it's quite complicated to manually pick them out and block them\n\nNo, I don't have it. Remember that new porn sites may appear any time.","added":1553767627},{"comment_id":38,"body":"The proxy is broken, 502.","added":1554101758}],"1553166302_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq":[{"comment_id":24,"body":"> [pexo](#comment_72_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): [...]\n\nI was interested in what kind of IP ranges/internet connections people with CP in DC++ use, and the first IP address I tried to whois was Norwegian Police. That heighten my interest, I captured lots of IP addresses for lots of queries, and it turns out that overwhelming majority are usual home users with home internet connection. I found only two servers (in datacenter) and Norwegian police which are not home users.","added":1553191825}],"1553193009_1KHWybGXJ9cwqzANezSfXbrEq9sgSsFwgD":[{"comment_id":25,"body":"> [gabew](#comment_4_1PZnbAYUg4AzDgJU4gtTupekoaNp1Mwizi): Does ZeroNet work on I2P?\n\nNot really yet. It can't utilize I2P connectivity, but it can be set up as a gate (and there is one, http://zeronet.i2p)","added":1553195379},{"comment_id":26,"body":"Tor has several types of censorship circumvention. Meek that uses Amazon infrastructure as a proxy, Snowflake which uses other users browser(!) connection, etc. It's rather hard to block Tor for a generic European country which is not known for censorship, although such countries as China and Turkmenistan block Tor and almost all Tor bridges, Tor is very unreliable there.\n\nI can write some insides about Russia and Turkmenistan censorship methods if anyone is interested in that.","added":1553195555}],"1553545993_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":27,"body":">🕓 is for April\nWhat?","added":1553548519}],"1553958946_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde":[{"comment_id":36,"body":"Yes, it works.\nWhat reply did you expect?","added":1553965532}],"1554025779_193rzuH9AAHfvHKwSFS5oq6jRpXwDJ2rEW":[{"comment_id":37,"body":"https://www.tahoe-lafs.org/\n\nTahoe-LAFS is a Free and Open decentralized cloud storage system. It distributes your data across multiple servers. Even if some of the servers fail or are taken over by an attacker, the entire file store continues to function correctly, preserving your privacy and security.","added":1554054728}],"1554133768_1NYxK9cC899pvxFuCt6eE53APoueDrhmS5":[{"comment_id":39,"body":"GPS spoofing is used near Kremlin since July 2016 I believe. https://lenta.ru/articles/2016/11/07/gpsoff/ (Russian).","added":1554151217}],"1554143647_1Cj5g289VvLkA7tsv7ewLKLpUYSnz3Ut4C":[{"comment_id":40,"body":"How did you discover ZeroNet anyway?","added":1554153542}],"1554160326_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs":[{"comment_id":41,"body":"Works fine for me in Firefox 66.0.1 and Chromium 71.0.3578.98.\nDo you run ZeroNet on Windows?\nRun:\n`curl -I http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882551-stig.revealed.webp`\nAnd post here execution result.\n\nIf you use Windows, I suppose the problem is in MIME type (`Content-Type` header). I get `image/webp` on Linux.","added":1554201302},{"comment_id":42,"body":"> [klu9](#comment_138_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I downloaded & unzipped cURL for Windows, and eventually worked out how to do it.curl -I http://127.0.0.1:4 [...]\n\nSo yes, the problem is with MIME type on Windows. `application/octet-stream` is not a proper MIME type for webp. I'll file an issue in ZeroNet.","added":1554228645},{"comment_id":43,"body":"> [klu9](#comment_140_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Maybe content type is an issue with mhtml being treated as a download rather than a type of web page to open.curl -I http://127.0.0.1:4 [...]\n\nTry renaming .mhtml to .mht","added":1554230075},{"comment_id":44,"body":"https://github.com/HelloZeroNet/ZeroNet/pull/1950","added":1554236134}],"1554322767_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG":[{"comment_id":45,"body":"ZeroNet mirrors of clearnet websites are usually done by downloading the website and hosting static downloaded html pages inside ZeroNet.","added":1554324482}],"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X":[{"comment_id":46,"body":"https://scholarship.law.gwu.edu/cgi/viewcontent.cgi?article=1159&context=faculty_publications","added":1554483228}],"1555148481_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS":[{"comment_id":47,"body":"As for 13.04.2019, Russia does not block Tor, I2P, ShadowSocks or VPN (either providers or protocols), however it block web proxies (also known as anonymizers) and some usual public and private proxies which are known for being used for proxying Telegram. The latter is done with some sort of automatic system, probably by dumping [netflow](https://en.wikipedia.org/wiki/NetFlow) or the traffic itself of one or several ISPs, and testing each remote host if it's HTTP/Socks/MTPROTO proxy.\n\nThere's no global or unified DPI system in Russia, different ISP use different methods of blocking. Some use commercial solutions from vendors, some make their own DPI, some use open source systems, some just block by IP address using routing tables on routers.\n\nThe list of blocked websites and IP addresses is available on https://reestr.rublacklist.net/, more information in English in available on https://usher2.club/en/, but it's a bit outdated and biased.","added":1555151208},{"comment_id":48,"body":"> [deliriumgoddess6](#comment_24_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): where can i get GoodByeDPI?\n\nhttps://bitbucket.org/ValdikSS/goodbyedpi/src/master/\n\nhttps://bitbucket.org/ValdikSS/goodbyedpi/downloads/","added":1555231864}],"1555253500_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq":[{"comment_id":49,"body":"> [nofish](#comment_1267_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): It was an optimization (skipped the variable replace when the language is en), but thanks for reporting I have removed it in Rev4068 (Py3 version)\n\nThanks, backported this modification to Python2 version, works as expected. Should I make a pull request?","added":1555416797}],"1555484698_1FPWnVYRbYfj96dvxSPx5hwtt2C8XwpvLC":[{"comment_id":50,"body":"> [caryoscelus](#comment_124_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I don't believe media streaming is currently possible, unless maybe some plugin supports it (but i've never seen anyone advertising such a plugin)\n\nI'm pretty sure you can do HLS live streaming using any media server (nginx with nginx-rtmp plugin as an example). You need to call Zeronet's SignAndPublish on every playlist update.","added":1555498285},{"comment_id":52,"body":"@blackmoon, @caryoscelus, @gitcenter, @leftside\n[/Talk.ZeroNetwork.bit/?Topic:1555652637_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq/Live+video+streaming+zite+example](/Talk.ZeroNetwork.bit/?Topic:1555652637_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq/Live+video+streaming+zite+example)","added":1555652698}],"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w":[{"comment_id":51,"body":"There's [ZeroUp Unlimited](/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/), which allows to upload small files as well.","added":1555521825}],"1555652637_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq":[{"comment_id":53,"body":"> [robione](#comment_220_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): So it's not live? It's a video already on disk.\n\nIt's live. It's streamed and re-encoded realtime, then cut into chunks and pushed into ZeroNet.","added":1555658152},{"comment_id":54,"body":"> [caryoscelus](#comment_130_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): So yeah, sometimes it starts working, but then goes down again. I don't think i got any \"streaming\" behaviour past one chunk.\n\nI've increased chunks amount, try it in 3 minutes. But yeah, it works fine as long as it can push data directly to peers, but if you don't have direct connectivity, of it there's just more than 5 peers, other peers does not push content as fast as I expected.","added":1555658237},{"comment_id":55,"body":"All right, let's try with video chunks as optional files.","added":1555659732},{"comment_id":56,"body":"> [gluek](#comment_18_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): It's work for few seconds, than don't load more. And it's always same video fragment after reloading page.\n\nffmpeg crashed, try again.","added":1555681019},{"comment_id":57,"body":"> [caryoscelus](#comment_131_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Seems to work now. Good job ;) [...]\n\nIt doesn't. Video pieces are optional files.","added":1555681613},{"comment_id":58,"body":"> [robione](#comment_222_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): So it's streaming from the files, not from another video source or device (phone, camera, pc)?? [...]\n\nYou can stream from any video source. This is not a video on demand, this is live streaming, but with 1-2 minutes delay. It doesn't matter if it's from files or web camera.\n\nVideo streaming itself is out of ZeroNet scope, you need some external software to encode video and save it into HLS-compliant format into ZeroNet folder.\n\nI'm using ffmpeg to stream to HLS. The command is as follows:\n`ffmpeg -re -fflags genpts -f concat -safe 0 -r 24000/1001 -i ~/zeronet-streaming/playlist_random.txt -map v:0 -map a:0 -f hls -hls_time 30 -hls_list_size 3 -hls_delete_threshold 3 -hls_flags delete_segments -c:v libx264 -vf scale=960x540 -preset fast -crf 25 -g 72 -c:a libmp3lame -b:a 192k -ac 44100 -r 24000/1001 video.m3u8`\n\nAnd then publish changes to ZeroNet every 30 seconds in browser.\nYou can supply RTMP stream, to re-stream something into ZeroNet, or configure to stream your screen, or you can use OBS.","added":1555709326},{"comment_id":64,"body":"> [leftside](#comment_724_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): How did u sign&publish every 30 seconds??\n\nI made a timer on the page. If you're the site owner, there will be a prompt to supply private key for the site. See index.html source.","added":1555769065},{"comment_id":65,"body":"@leftside, delay is from 30 seconds to 2 minutes, it depends on HLS configuration. ZeroNet by default will publish zite not faster than every 30 seconds, so it's not possible to publish HLS playlist and pieces faster than every 30 seconds without ZeroNet source hacking.\n\nAnyway, this was a proof of concept for @blackmoon, it has proven to work pretty fine. The stream is now offline.","added":1555889187},{"comment_id":66,"body":"> [robione](#comment_223_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Very cool, with one minor squibble on the 'live' aspect in which delay is tolerated in seconds, but not minutes. [...]\n\nCheck [StreamZ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/StreamZ), it has much less delay.","added":1555889554},{"comment_id":67,"body":"> [nickwa](#comment_113_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Looks interesting. I always wanted a live streaming zite. Hope that you get success.\n\nYou can clone it, run ffmpeg command which generates HLS stream (look at example below) and it will work.","added":1556322925}],"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":[{"comment_id":59,"body":"Does not seem to load your test stream with Python 3 ZeroNet and PeerMessage plugin 3.0.2 from http://127.0.0.1:43110/kxonet.bit/?/plugin/gitcenter/1554637508475\n\nWhat did I do wrong?","added":1555762975},{"comment_id":60,"body":"> [gitcenter](#comment_409_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Are there any errors in ZeroNet console, or in StreamZ console?\n\nNo, nothing. No errors (or any other messages except hideProgress from ZeroNet) in browser console, no errors in ZeroNet console. I've downloaded Python 3 ZeroNet from git master, the plugin v 3.0.2. Always \"buffering, please wait\". I have both IPv4 and IPv6 port opened, with Tor.","added":1555763962},{"comment_id":61,"body":"> [gitcenter](#comment_411_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Do you have the gitcenter@zeroid.bit hub downloaded?\n\nYes I do.","added":1555764112},{"comment_id":62,"body":"> [gitcenter](#comment_412_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This may happen if you don't have any peers on the hub. Try to post a message in the stream chat, it will automatically find peers and probably fix the problem.\n\nNothing happened. My comment did not appear, other comments too, there wasn't even publishing progress bar (Should it appear? Are comments also handled with PeerMessage plugin?).\n\nBy the way, you seems to have missing p2p.js in gitcenter@zeroid.bit","added":1555764334},{"comment_id":63,"body":"Yep, it works, cool!","added":1555764470}],"1559028625_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW":[{"comment_id":68,"body":"For HTML5 video in browser you'll need to either use WebM with VP8/VP9 video and Vorbis/Opus audio, or MP4 H.264, with MOOV atom in the beginning of the file (so-called \"fast start\").\n\nUse: `ffmpeg -i input.avi -map v:0 -map a:0 -c:v libx264 -crf 22 -c:a aac -b:a 192k -movflags faststart -pix_fmt yuv420p output.mp4`","added":1559240482}],"1566230571_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq":[{"comment_id":69,"body":"> [gitcenter](#comment_620_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Is it like cloning ZeroWiki and not sharing it?\n\nSorry, I don't get the question. TiddlyWiki is a stand-alone wiki engine, it's not a fork of ZeroWiki. It could be used for public or private \"installations\" even on ZeroNet, there's build in encryption with password protection.\n\nAlso, TiddlyWiki is a very flexible engine. [This](https://tiddlywiki.com/talkytalky/) presentation is running on TiddlyWiki! People also use it [as a blog engine](https://jermolene.com/) or even as [GTD](http://cardo.wiki/)","added":1566231477},{"comment_id":70,"body":"> [gitcenter](#comment_621_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di)\n\nUnfortunately, I'm not familiar with ZeroWiki, but TiddlyWiki is more than just a wiki. It contains a very flexible wikitext parser, you can write your own code inside it. There's plugins and themes support, you can download it right from the wiki itself.\n\nOf course you can use it as your personal wiki or for notes/blog, as well as you can use it for public wiki/website.\n\nYou can export TiddlyWiki pages as .html or generate a full static site, too. Take a look at https://teclast-m89.neocities.org/","added":1566231784},{"comment_id":71,"body":"> [gitcenter](#comment_622_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Huh, that looks like a more powerful tool than I expected. Thanks for porting it to ZeroNet!\n\nThere are some plugins for third-party comment systems already available. I'll try re-use them to implement similar comment system using ZeroNet only, as another plugin, or maybe even make wiki editing functionality by other ZeroNet users like it's implemented in ZeroWiki. But for now, only owner can edit TiddlyWiki.\n\nThere are some compatibility issues still present, I'll try to fix them or ask Tamas for ZeroNet code fix.","added":1566232354},{"comment_id":82,"body":"> [kaffie](#comment_1048_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The site says to clone it to have a personal copy, but the cloning option is not enabled.\n\nIndeed. Fixed it, thanks.\nUPD: reverted it back to prevent users from rewriting their wikis with \"upgrade code\" button.","added":1566481356},{"comment_id":83,"body":"> [aspidochelone](#comment_114_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Is it possible to use TiddlyWiki to compile a \"Best of ZeroTalk\" page …\n\nDo you want to make this page manually or to generate one? You can use Tiddlywiki to do that manually, that's for sure, but it would require some programming skills to make it generate itself.","added":1566481441},{"comment_id":85,"body":"> [kaffie](#comment_1066_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm not quite sure what the solution is. look at zeroblog for how to make the upgrade code button not overwrite data.\n\nTiddlyWiki is a single HTML (index.html) file, it doesn't store data in different files, it re-generates itself on every save.\n\nI've tested several methods to enable cloning but not to rewrite index.html, and all of them failed. Do you have an idea how to implement that?","added":1566547244},{"comment_id":86,"body":"> [aspidochelone](#comment_125_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I was assuming it would be manual or semi-automated (like dragging links or something).  I have no idea, I scarcely know ZeroNet let alone the other.\n\nYou can do that manually, it's just a wiki. It also supports scripting in it's own scripting language and in JavaScript.","added":1566547360},{"comment_id":87,"body":"> [kaffie](#comment_1071_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Content should be separated from the platform that's loading it. If all of it is in the index.html, how would you update it without rewriting the index.html file?\n\nYou can't, and you don't need to. TiddlyWiki is a self-contained document, even the pictures are embedded into this single html by default. To update it, you [open a special upgrading TiddlyWiki](https://tiddlywiki.com/upgrade.html), drag your current HTML file into it and it generates updated version of the HTML.\n\nThis concept was invented by TiddlyWiki authors, not by me.","added":1566651295}],"1566397383_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":[{"comment_id":72,"body":"Are you referring to gitlab.com SaaS-hosted repository or a self-hosted Gitlab instance on your own server?","added":1566399414},{"comment_id":73,"body":">GitLab can be self-hosted if we abandon gitlab.com;\n\nI see, you're proposing to use SaaS version for now. It doesn't solve centralization issue though.\n\nSome months ago Github hid my account from public, and people recommended me the following alternatives:\n\n* https://gitgud.io/ (basically a gitlab instance with all features and more)\n* https://codeberg.org/ (gitea instance)\n* https://notabug.org/\n\nJust found the following page which may be helpful: https://wiki.softwareheritage.org/wiki/Suggestion_box:_source_code_to_add","added":1566400145},{"comment_id":74,"body":"> [blurhy](#comment_290_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): When ipfs's  pubsub is done, we can devvelop a really decentralized github\n\nCan't we do that in, well, GitCenter?","added":1566400631},{"comment_id":75,"body":"> [blurhy](#comment_291_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): gitcenter uses zeronet, which is very easy to ban\n\nAre you referring to ZeroNet unavailability in China? That's not a ZeroNet problem per se, and it's unrelated.","added":1566400833},{"comment_id":76,"body":"> [gitcenter](#comment_644_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Git Center is outdated. Fullstop. Vanilla JS, slow code, bugs. It's impossible to make it any better without replacing it from scratch.\n\nI think he meant that your new Git engine should still be named \"Git Center\" and share the same address.","added":1566400985},{"comment_id":77,"body":"> [gitcenter](#comment_646_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Aw, too many developers here to answer fast enough, please keep calm\n\nShould somebody from the core developers open a new developers forum, Zero Developers Talk? Or is there such a place already exists? I have several contributions which require discussion but I find git issues an inappropriate place (because it's not an issue) and also don't want to turn Zero Talk into developers' talk.","added":1566401124},{"comment_id":78,"body":"> [blurhy](#comment_299_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): trust me, it's awesome. [...]\n\nNothing awesome actually. I'm a heavy IPFS user and probably the most cloudflare-ipfs gateway traffic generator, and I'd say it's slow and unstable.","added":1566401285},{"comment_id":79,"body":"> [gitcenter](#comment_653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): http://127.0.0.1:43110/1KmgpXc9BLFxw1ccGANYVzvDh3YG95tSe3/\n\n>ZeroNet Zite Development Discussions\n\nNo, I mean a forum for ZeroNet development itself.","added":1566401338},{"comment_id":80,"body":"> [gitcenter](#comment_674_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Please also tell if you support this movement. I've only received [weird] cons so far.\n\nSure, if you think that GitLab is more suitable and handles developers' workflow better, go for it.\nP.S. please check ZeroMain in your free time.","added":1566404103}],"1566479582_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z":[{"comment_id":81,"body":">I feel what we need is something more like (a) \"some guy who has a dictionary file you can edit\", (b) times 1000\n\nCheck out how I2P domain name system is implemented. Basically, every node has it's own \"hosts\" file which merges records from different sources (other different hosts files).\n\nThere are \"domain registrars\": a services which add your record to their hosts file, which other node can use for merging into their own file.","added":1566480434}],"1566475780_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":[{"comment_id":84,"body":"Will it work in Safari?","added":1566481697}],"1566642594_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di":[{"comment_id":88,"body":"Wait-wait-wait, you shouldn't use existence TLDs! Please do not use .it, .me, .to, .info, .net, .sh, domains! This creates collision with real DNS domains and records!","added":1566651593},{"comment_id":89,"body":"> [kaffie](#comment_1085_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): That's what I said lol. fortunately zn addresses are still prefixed with localhost:port, and/or /zero/\n\nI'm planning to contribute the plugin which gets ZeroNet address from a real DNS record, just like it's implemented in IPFS, and it won't work with Name.IT plugin installed since it would create a collision.\nUsing existing domain zones is a bad idea by all means.","added":1566652137},{"comment_id":90,"body":"> [gitcenter](#comment_739_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): The point is that clearnet services shouldn't be the only way to create domains.\n\nThat's totally OK if you use your own domain zones which are not used and registered. Something unique and very unlikely to be registered officially in the future, like .zeronet (.zn is probably fine too).","added":1566652451},{"comment_id":91,"body":"> [gitcenter](#comment_739_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): The point is that clearnet services shouldn't be the only way to create domains.\n\nTake a look what NameCoin, EmerDNS, I2P, Tor did: they made their own domain zones. That is a proper way to run your own domain zones.","added":1566652551},{"comment_id":92,"body":"> [gitcenter](#comment_741_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Would you, like, replace name.it with name.it.zn then?\n\nYes. I'd prefer `.name.it.zeronet` since `.zeronet` is a searchable word and you can just publish such domain in clearnet without additional information and people would understand where they should open it.","added":1566652679},{"comment_id":93,"body":"Additionally, I think you should check that the website is exist, up and running before adding it to the database. At least check if it's a valid Bitcoin address.","added":1566652768},{"comment_id":94,"body":"> [gitcenter](#comment_742_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Looks like you're missing the point. .bit domains aren't for ZeroNet only, as well as Bitcoin addresses aren't for ZeroNet only. So ZeroNet should use use domainname.bit.zeronet and addr.zeronet. But then, why doesn't domainname.it.zeronet work?\n\nNo, unfortunately you're missing the point here.\n\n`.bit` domains could be used in ZeroNet because they __may__ contain a special record with ZeroNet address inside the domain information, just like with regular domains. They __may__ contain real IPv4/IPv6 addresses, MX records etc as well. `.bit` domains are consistent: once you registered `.bit` domain, you control it in both clearnet and in ZeroNet (since ZeroNet does not \"implement\" `.bit` domains but sync it with a real NameCoin database). In your plugin, the owner of `name.it` DNS name can't control `name.it` inside ZeroNet with your plugin.\n\nImagine if ZeroNet could query such records for a real DNS domains, so you can open e.g. `127.0.0.1:43110/zeronet.io/` and it would open. ZeroNet queries real `zeronet.io` domain over DNS, gets a TXT record which contains ZeroNet address and opens the website.\nBy using real DNS zones, your plugin creates conflict with real existing DNS records and prevents implementing this functionality in the future.","added":1566653086},{"comment_id":95,"body":"I'd propose using `.zeronet` zone. Just wipe all existing data, this is a test anyway.","added":1566654219},{"comment_id":96,"body":"Hrm, you have a correct point. `.nameit`, then?","added":1566654320},{"comment_id":97,"body":"`.zname`, `.znet`. I personally like `.nameit` because it's clear that you need \"Name.IT plugin\" for `.nameit` domain.","added":1566654619},{"comment_id":98,"body":"That's fine I guess. New two-character domain zone is unlikely to be registered in the future.","added":1566654971},{"comment_id":99,"body":"Definitely better than it used to be.\n\nFYI, this is the list of the third-party domain zones I'm aware of:\n`'bbs.', 'chan.', 'cyb.', 'dyn.', 'geek.', 'gopher.', 'indy.', 'libre.', 'neo.', 'null.', 'o.', 'oss.', 'oz.', 'parody.', 'pirate.', 'free.', 'bazar.', 'coin.', 'emc.', 'lib.', 'fur.', 'bit.', 'ku.', 'te.', 'ti.', 'uu.'`\n\nIt's NameCoin + EmerDNS + OpenNIC + New Nations\nMore information: https://en.wikipedia.org/wiki/Alternative_DNS_root","added":1566657083},{"comment_id":100,"body":"I don't see problems with current domains.","added":1566657852}],"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ":[{"comment_id":101,"body":"Open `data/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/js/all.js`\n\nLine 1071\nFind:\n`      return btoa(unescape(encodeURIComponent(JSON.stringify(obj, void 0, '\\t'))));`\nReplace with:\n`      return btoa(unescape(encodeURIComponent(JSON.stringify(obj, void 0, false))));`\n\nThis will re-format your .json file without spaces, which will save some kilobytes of space.","added":1566921737}],"1567130399_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5":[{"comment_id":102,"body":"> [ratsmack](#comment_42_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): but I couldn't find an explanation of how ZeroNet determined when to use Tor and when not to.\n\nAs far as I understand, the peer publishes different addresses to the tracker. In case of \"Tor: available\", ZeroNet would first use IPv4 and IPv6 addresses and if that fails, an onion address.","added":1567329662}],"1567460587_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy":[{"comment_id":103,"body":"[Millchan](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/)","added":1567463202}],"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf":[{"comment_id":104,"body":"All music is generally transferred over Bittorrent, on private music trackers like https://redacted.ch/ and https://orpheus.network/. You still can find lots of music on Direct Connect, eDonkey2000 and Soulseek.","added":1567615002},{"comment_id":105,"body":"Also check https://rutracker.org/, there are a lot of high quality music releases.","added":1567615044},{"comment_id":106,"body":"Also: [How to search and download unpopular and old files on the internet](https://medium.com/@ValdikSS/how-to-search-and-download-unpopular-and-old-files-on-the-internet-e5947ef507ba)","added":1567615128},{"comment_id":107,"body":"> [redneck](#comment_37_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): It seems to no longer want to connect to the network.\n\nWorks fine for me, tried it right now. Make sure you've downloaded the latest version from http://www.slsknet.org/news/node/1","added":1567616524},{"comment_id":108,"body":"> [redneck](#comment_38_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): Ah! Different program. I have tried this one before but it wanted to loging and i could not find out where to register.\n\nThe registration is automatic, just type the username and the password you want. If there's no such username, it will automatically register you with the password you typed. If that fails, you'll need to choose another username.","added":1567617346},{"comment_id":109,"body":"> [redneck](#comment_40_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): By the way if anyone here is interested in creating a small group p2p network let me know.\n\nWhat do you mean?","added":1567617566},{"comment_id":110,"body":"> [redneck](#comment_41_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): \n\nMaybe what are you looking for is a f2f (friend-to-friend) network. Try [RetroShare](https://retroshare.cc/). I always want to spread my data as much as possible, so I'm not really interested in f2f networks.","added":1567618108},{"comment_id":111,"body":"> [redneck](#comment_43_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf): No. I agree with you. I also want to spread my data as far as possible. But it is getting a little too difficult anymore with all the censorship. I want to create my own network from the ground up using currently available networks or protocols.\n\nIf you live in the USA or in some European country where DMCA and EUCD applies, and for seeding over BitTorrent you get notification from IP-Echelon, Irdeto or some local monitoring company, I can assure you you can safely use eDonkey2000 or Direct Connect, as these companies monitor only the most popular network — BitTorrent.","added":1567618486},{"comment_id":112,"body":"If you want Bittorrent, you can try special client called Tribler\nhttps://www.tribler.org/","added":1567633588}],"1569015162_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J":[{"comment_id":113,"body":"If you're referring to official Zites, check https://github.com/HelloZeroNet?tab=repositories","added":1569016671}],"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP":[{"comment_id":114,"body":"Systemd is the best what has happened with Linux in last 10 years. I'm absolutely serious.\n\nIt was so exhausting to write shitty shell init scripts, which were a little bit different in any major distro (you couldn't reuse Debian init script in Fedora of that time for example). They didn't support run order, they didn't support isolation, log redirection, nothing. If you want to slightly modify the script, you had to copy it, edit and support your own init script copy!\n\nWith systemd everything mentioned above is super easy. With systemd we finally have daemon filesystem, syscall and capability isolation, at least for the most important daemons. You can apply CPU and memory limits. You can configure the daemon to restart if it crashes. With journald you can finally read the daemon's output right in `systemctl status`, you don't have to `tail /var/log/something/where/is/that/log/file/dammit.txt` to see what's wrong and why it doesn't start.\n\nI just don't get it when randomly complain about systemd, like your post, @kanade. systemd has it's own problems and drawbacks, sure, but it's much better than anything which was before it.","added":1570571508}],"1571610384_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":[{"comment_id":115,"body":"What does it say in I2P console ( http://127.0.0.1:7657 )? Does it say \"Accepting tunnels\"?","added":1571626777}],"1571457668_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z":[{"comment_id":116,"body":"https://zooqle.com/search?q=joker+2019","added":1571626925}],"1570901775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS":[{"comment_id":117,"body":"The original website is http://spyware.neocities.org/\nI think that the author's definition of spyware is nonsense and most of his classification methods are not how you would really analyze the program to make a definitive verdict.\n\nI tried to contact the author to add something about Thunderbird but got no reply, and there's no changes on the page.\n\nThere's another somewhat similar project, from digdeeper: https://digdeeper.neocities.org/. I argued digdeeper's spyware definition too; he believes that if the software performs **any** unsolicited request to the internet then it's a privacy threat and should be classified as a spyware.\n\nThe community of digdeeper seems actually nice, but they use public XMPP chat with OMEMO encryption enabled, which is not supported and just doesn't work as expected. It's explicitly unsupported on some clients (Conversations for example) and is also unsupported in Gajim, digdeeper's recommended client, due to bug in software. To read the messages and to be able to post, you need to add every chat participant to XMPP roster manually, and do that every time new participant connects. Moreover, due to another bug in Gajim, you don't see content not encrypted for you, and you don't even know there are messages you can't see. I laughed at them all at first, tried to hang in a chat group for several days and have a chat, but then had to leave because they are using technologies in an unsupported way to create artificial barrier for something as simple as a public chat.","added":1571627907}],"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm":[{"comment_id":118,"body":"> So WHY does Russia have so many openly illegal websites!? \n\nCan you name a few? I don't remember seeing CP on Russian websites like in a 10 years. Russia now have pretty strict laws regarding information on the internet, especially pornography, which is prohibited for creation and distribution.\n\nGenerally CP in Russia became a kind of subculture/meme thing, but it's meme popularity is on the wane.\n\nIn the 90s and early 00s there were several CP studios in Ukraine and Russia. Some of them worked with waifs/orphans because many orphanages were poor at that time and children were seeking for a better life/money. Some of them were building trust between children, which is the case of single-person 1st studio of Novosibirsk, where arguably the most recognisable CP \"star\" was born: Masha Babko, whos photos and videos have been uploaded to the internet, presumably by someone involved in the arrest or investigation process.\nSomewhere around 5 years ago you could spot a meme macrosses like \"that feeling when you stump your feet\" with cropped face of Masha, and \"ЦП в ЛС\" ([send] CP to PM) was a catchphrase which you could spot even written on a construction site fence.\nMasha was on a talk show on the TV a year ago where told that nobody forced her to undress or pose. https://www.youtube.com/watch?v=EkiEQF1pB9w","added":1590066041},{"comment_id":119,"body":"> [tnytuqsgqnywmecj](#comment_23_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): But you can go to what appears to be a 18+ website thinking such is legal but get nothing but blind links.\n\nWell, that's just a satellite/doorway website without real pornography, but with lots of small thumbnails which redirect you to another website, and then to another, then to another. SEO spam and exploit execution chain.","added":1590113594},{"comment_id":120,"body":"> [tnytuqsgqnywmecj](#comment_27_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm): Very little goes on within Russia without the governments knowledge so if content is posted and not pulled when needed it is the Russian government say!\n\nHa, you're thinking way better of Russian government than it really is. These guys can't handle fake malls/universities mining messages for years. They even tried to bury their heads in the send by blocking email services like protonmail, tutanota and such.\n\nhttps://meduza.io/en/feature/2019/12/23/for-almost-a-month-russian-urban-centers-have-been-brought-to-a-standstill-by-fake-bomb-threats-police-say-there-s-not-much-they-can-do-about-it","added":1590114122}],"1590169333_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU":[{"comment_id":121,"body":"What do you mean by streaming? It looks like a movie for me, not a live broadcast. You should also move MOOV atom to the beginning of the file (so called \"fast start\")\n\n`ffmpeg … -movflags faststart`","added":1590179580},{"comment_id":123,"body":"> [bwcolor](#comment_6_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU): is not real time. is a movie. i want to see if the network can manage it in real time without lag\n\nYes, it plays pretty fine. Had to wait for about 40 seconds before it started, but it's watchable.","added":1590188393}],"1587547948_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1":[{"comment_id":122,"body":"The gate is down.","added":1590179694}],"1592964791_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji":[{"comment_id":124,"body":"You video file needs to be prepared specifically for web. It has to be H.264 in mp4 container, with MOOV atom in the beginning of the file (so-called 'fast start'). Audio should be either mp3 or aac.\n\nYou can produce such files with ffmpeg: `ffmpeg -i input.mkv -map v:0 -map a:0 -c:v libx264 -c:a libmp3lame -crf 25 -b:a 192k -movflags faststart output.mp4`","added":1593017754},{"comment_id":125,"body":"webm with vp8/vp9 video and vorbis/opus audio is fine too.","added":1593017800}],"1593159226_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji":[{"comment_id":126,"body":"Conversations should be your main choice if you don't need contact grouping and statuses. It's the leader in stability and feature-wise. It supports Jingle audio/video calls.","added":1593202171},{"comment_id":127,"body":"> [adxenc73jd](#comment_16_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji): Conversations only goes back to Android 4. aTalk supports back to Android 5. I need something that supports Android version 2!\n\nGot it now, I thought \"v2\" in your topic means TOPIC version, like if there's another topic with the same question but you created it once again for some reason.\n\nI don't think there are any _modern_ XMPP client with Android 2.3 support. What phone do you have? Many old phones had custom firmware with newer Android versions. Maybe it would be better to install newer firmware and use modern software? Or, you know, buy a new phone for as low as $70?","added":1593257005}],"1593220425_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji":[{"comment_id":128,"body":"Download any common torrent client, like µTorrent, qBittorrent, Vuze etc. Get trackers from [here](https://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_best.txt). Choose files you want to add into torrent and generate the torrent file.","added":1593257125},{"comment_id":129,"body":"> [adxenc73jd](#comment_20_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji): Doesn't work. Just says downloading metadata forever.\n\nI guess you're trying to add a torrent, not to generate one. This is wrong.","added":1593525371}]},"comment_vote":{"1265_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj":1,"3_1EWfVBr3cRiXcK8iS9Ytwky7VCVTSbv4Fs":1,"1055_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1}}