{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1634264493_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A": [
			{
				"comment_id": 1,
				"body": "We are in the mirror dude, if a fact checker checks it... you know the truth is the opposite of what ever the fact checker said.\n\nIt is actually VERY handy as they only \"fact check\" true data and they say it is a lie so it is like a sign post saying \"PLEASE DON\"T LOOK AT THIS IT IS REAL DATA!\"",
				"added": 1634511643
			},
			{
				"comment_id": 4,
				"body": "77ha01 - nothing strange at all about it.\n\nFirst rule of Psycohistory \"all sentient life is expansive and opportunistic by nature, rendering extinct breeds who are not\". If you wont use the exploit, someone else will... To Your Detriment...\n\nTake bread... the people who ate it lived and had more kids, the ones who didn't, didn't - this is not a good or bad rule, merely what must be applied to EVERYTHING. Then everything makes sense regardless of the spin they put on a thing.",
				"added": 1634634608
			}
		],
		"1634306647_1CN7STVMU29Rme1tgVRRPj3ZA3H7m99Rei": [
			{
				"comment_id": 2,
				"body": "I got $10,000 (I would say cash... But figure you would prefer it in bit coin)  for this project, you guys already built most of what I was going to spend a hundred k to build.\n\nIf I can talk to the dev team I can hire you to finish this project, I got the wire frame and everything laid out I just need a response from the people who will do the work.\n\nTalk to me people, lets get this done, should take maybe a month or 2 to finish everything with what you already have.",
				"added": 1634585428
			},
			{
				"comment_id": 3,
				"body": "=.=\n\nStep 1. Each user has a unique ID (see block chain) and can have what ever username they want that isn't taken (tied to block chain).\n\nStep 2. Each users app has its own private list (total decentralization) which tracks each known user and the last know IP or Phone number the user could be reached at. (yes we are talking stone age simple by directly pinging a users IP).\n\nStep 3. When users interact app to app, their apps trade their private user lists. If anything is found different, they update (add new users / test last known IP's/Phones to see which is current and update).\n\nLike, guys I got this all worked out, was about to drop 100K to make this but here you all are with most of it done, I can fund the completion of ZeroNet. \n\nHow do I reach the devs or people active on this project (I am not going to give you money and say \"have fun\" I know what needs to be done and will pay for it)",
				"added": 1634611165
			}
		],
		"1634841000_1AGna8VjUcx7PVvhZLhMbyshkYXBu8hBVi": [
			{
				"comment_id": 5,
				"body": "UK? Try the Nuremberg code, In the USA we have the civil rights act titles III and VII as well as the ADA titles II and III if mem servs but you had all that hitler shit happen so for you its the Nuremberg Code (keep in mind the approved vax is not on the market, it is just the experimental stuff you already beat in a court)",
				"added": 1634857940
			}
		],
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "Your solutions are kinda funny, but all busted.\n\n1.) their is no \"Common sense censorship\" censorship at any level is TREASON in the United States of America as it is a violation of the First Amendment.\n\nSolution, have the user base deal with all reports and bans over 2 points - stolen content, and criminal content.\n\n2.) See solution in 1.)\n\n3.) not sure how a delay is going to do anything, but preventing them from editing their posts/comments sure as hell will.\n\n4.) YA, cuz elections are soooooooo good at getting the will of the people done, you clearly missed out on the 2020 election, the recall in California, the list goes on.\nSolution, NO MODERATORS, let the people do all the work.\n\n5.) Oh, so instead of trying to fix the problem, go back to the people who ARE the problem and wont listen to us... I think this OP is a Fed, or has been brainwashed by them...\n\n6.) You don't need to hid online if you are using it for lawful reasons, as such, why do proxies matter? Does your country prevent you from using this app? Is this a criminal charge associated with its use?\n\nSolution, go deal with your tyrannical government, if they are not coming for you yet, they will be soon, that is how all tyrants work.\n\nNow if you will excuse me, I am going to get off my soap box.",
				"added": 1636343161
			}
		],
		"1635050930_143N4eNqa9axJbroSdZfz8RLtPkJeS2HcE": [
			{
				"comment_id": 7,
				"body": "You have to talk to Biden for that sort of stuff, you are in the wrong place.",
				"added": 1636343298
			}
		],
		"1634952441_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8": [
			{
				"comment_id": 8,
				"body": "Wow, a t1 warp drive, Didn't know this sorta tech was just out there. Any one have a device that harvests more electrons (electricity) out of the air at a rate greater then what is uses - to power say a house?",
				"added": 1636343748
			}
		]
	},
	"comment_vote": {}
}