{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1573624455,
			"title": "Zero Host! Affordable Zite Hosting Solution",
			"body": "Hi I work for zero host and we well host your zites. Drop any questions here. About our hosting solutions.",
			"added": 1573624454
		}
	],
	"topic_vote": {
		"1573616487_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": [
			{
				"comment_id": 1,
				"body": "> [zenanon](#comment_45_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): much\n\nExactly the point. Plus it helps you jump start your seeds you to remove yourself as a seeder earlier on.",
				"added": 1573785441
			},
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1251_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're not actually believing the guy will be legitimate, are you? [...]\n\nNope I'm being dead serious.",
				"added": 1573785499
			},
			{
				"comment_id": 3,
				"body": "> [edgelordofdecent](#comment_228_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Lol, you should at least read the purpose of ZeroNet before making ideas like this.\n\n I did. There's so many dead Zites that could have some life if they even 1 peer/seeder. And I believe that's one opportunity to offer a way to host them let the owner let the site be.",
				"added": 1573785663
			},
			{
				"comment_id": 4,
				"body": "> [zenanon](#comment_47_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): Sounds interesting. Is there a Zite yet? With price, features, etc.\n\nNo not as of now. We're working on getting our clearnet site up and running then we will be porting it zeronet.",
				"added": 1573869999
			},
			{
				"comment_id": 5,
				"body": "> [onlinemovies](#comment_20_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): Make it: [...]\n\nWe will definitely keep this in mind! I know there's a big file plugin zeronet has on their docs. We will find a solution though since I understand where you're coming from. Plus free might be an option [shared hosting?] But from a website owners perspective I wouldn't want Porn on my server used for my personal blog. :/",
				"added": 1573870248
			},
			{
				"comment_id": 6,
				"body": "> [onlinemovies](#comment_21_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp): I'm seeding lot of large files. Very few people download large files. And not because the content is crappy. Users who download this files, does not keep them online.  A centralized 24/7  seed server in the meantime, it will help when i’ts running. But as it becomes inaccessible,  the downloaders who seed the file will be gone fast. Too much  the Hit And Run people. Those who do not seed back that they downloaded. And another downloaders are does not come in time to keep this files online. By the time the next downloader comes, with a good chance again he will be the umpteenth first downloader, from whom no one will download in the future anything. [...]\n\nDefinetely! Also whats the total size of the files youre hosting? We may be able to work something out with you. I recently signed up for a ZeroMail. Go ahead and Email me :D",
				"added": 1573910789
			}
		]
	},
	"comment_vote": {
		"1270_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}