{
	"title": "XikuZero",
	"description": "Otro blog indiferente.\nhttps://bobinas.p4g.club",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1474513433,
	"post": [
		{
			"post_id": 14,
			"title": "de la lista de distribuciones gnu/linux mas votadas...",
			"date_published": 1474513352.89,
			"body": "Repasando la lista que ofrece Distrowatch dejo un par de líneas.\n\nMint 2942\nDebian 1738\nUbuntu 1607\nopenSUSE 1130\nManjaro 1073\nFedora 1057\nelementary 907\nZorin 812\nCentOS 802\nArch 772\n\nPoco que decir en donde los tres primeros son del imbatible .deb.\nAlgo que todavía muchos les cuesta aceptar. Por otro lado mucho me alegro de ver a openSUSE tan arriba cuando algunos perdimos en los años a Mandrake y Mandriva después.\nEn tercer punto un enorme honor para Manjaro poder copar realmente el tercer puesto, más cuando lo hace superando a freidora, digo Fedora.\nLos demás ya son pues \"refritos\" de otras y otros.\n\nMint hace algo sencillo, buscar la magia en algo que está en manos de todos, y al parecer desde hace ya varios años lo está consiguiendo, ojalá funcione así por mucho mas tiempo.\nDebian poco mas que decir, la gran distro que con el enorme repositorio disponible es la sana envidia, punto.\nUbuntu sigue ahí, ya con cierta mas publicidad y estrategia para muchos niveles, pero como vive de la mama Debian pues se lo permite con cierto lujo.\nopenSUSE es otra que tampoco nunca nunca debería decaer ni perder ambiciones, pasan años y ahí sigue.\nManjaro está para dando evidencias y maneras llanas de tener un sistema al día."
		},
		{
			"post_id": 13,
			"title": "Utopía informática de Internet.",
			"date_published": 1472269640.612,
			"body": "\n\nDescentralizar internet significa no otra cosa mas que mantener y ocuparse personalmente que esto suceda tanto de manera particular como de manera grupal, y para que esto suceda significa que se debe disponer de una infraestructura de alguna forma más distribuida, todavía más horizontal, más interconectada, más difundida pero en un contexto mas plano, siendo así que puede quedar de forma más autónoma como más difícil de suplantar o violar por parte de otras personas ajenas tanto de la información como de localización.\n\nEl ejemplo mas sencillo y elemental consiste en tener una wikipedia siempre básica en casa, porque el primer paso para consultar algo no tengo ni debo porque salir de mi propios medios y recursos, es obvio que no tendré siempre el último detalle o novedad pero si siempre un mínimo de información directa y disponible, ya que los medios y los recursos de hoy en día de cualquier sistema es suficiente para conservar, aparte y mientras existe una tarea en donde toda información se estará renovando y actualizando contenido.\n\nSi no nos ocupamos de difundir siempre mas el contenido en muchos puntos, entonces muy pronto y muy fácil vamos a perder todo, todo lo construido y todo lo desarrollado. Es lo mismo que las enciclopedias y es lo mismo a los escasos recursos.\n\nLlama mucho la atención que nada ni nadie a pensado todavía en como hacer esto, considero es muy grave que solo se defina la informática como dos conceptos básicos : servidor o cliente, y la informática es mucho mas que no solo eso. Cualquier persona del mundo debe poder ser no solo cliente sino incluso servidor de infinidad de información, aportación y construcción. La jerarquía o dependencia piramidal de lo que se está construyendo ahora es simplemente ilusorio e infantil. Pasado un tiempo comenzará a manifestarse que ni lo escrito es lo que debería estar escrito, ni lo que se consulta es lo que queremos consultar. De la misma manera que cualquier consulta no tiene porque ir ni tan lejos ni tan subjetivo a otras entidades o corporaciones, lo lógico es siempre que toda información que se consulta debe ser primero buscada y averiguada en los puntos mas cercanos, y si esta no se encuentra entonces si ir siempre ampliando el círculo de contactos hasta tener nueva referencia o nuevos datos mas recientes y mas actualizados.\n\nEs muy crítico incluso para una información distribuida no abusar de las telecomunicaciones, otro dato importante que hoy en día deja muy desprotegido del usuario a nivel mundial es su total y ausente privacidad, cualquier persona del mundo puede saber donde, como, cuando y para que estuvo quien sea en donde sea. Cuando solo debería ser así a un nivel local, o mejor dicho en un circunscrito moderado y bien administrado.\n\nPor otro lado es indiscutible que desarrolla más el consumo interno, identifica más la sociedad propia y local, retrasa la invasión de modas o costumbres que solo son siempre comerciales. Motiva y fomenta a un desarrollo local que siempre puede obtener mayores y mejores beneficios que no solo mundiales, y sobre todo muy ajeno a la necesidad primaria. Si de principio toda la sociedad tiene al alcance de la información que siempre sucede fuera de su propia localidad, por que siempre pierde o llega tarde a cualquier acto o proceso que sucede en tan corto espacio.\n\nObvio aquí he intentado mencionar muchos métodos que ya existen actualmente, que de alguna forma ya se están practicando o llevando a cabo pero de forma siempre muy particular o privada, sin alcanzar nunca ni la verdadera difusión ni la mínima práctica entre dos o tres personas comunes. El reto ahora es por partida doble, por un lado evitar las grandes facilidades con las grandes corporaciones mundiales, que lo ofrecen todo y mas al gratis y comodísimo, y por otro lado canalizarse en la búsqueda del propio beneficio que al fin y al cabo las cosas de interés de uno mismo las tiene que ver siempre uno mismo, y no otros de forma ajena, ni aliena a nuestros propios propósitos.  (Menciono a modo de ejemplo algunas de las técnicas ya disponibles : compartir carpetas, ftp publico, torrent, p2p, s2s, retroshare, sync, vpn, correo electrónico, tor, redes federadas, redes centralizadas, certificados, anonimato...)"
		},
		{
			"post_id": 12,
			"title": "Escribir con retales.",
			"date_published": 1464559293.514,
			"body": "\n\nHay una cosa que se llama improvisar, crear de cero o desarrollar algo siempre nuevo.\nEn gnu/linux creo que eso no sucede mucho, pues es un poco difícil improvisar nada cuando todos son puros detalles técnicos que debes aprender, dominar, configurar, ajustar y finalmente disfrutar.\nEn los que estamos en sistemas o máquinas que hacen cosas varias como sistemas pues sabemos lo que eso implica. Hay poco margen de improvisación. De aquí saltamos a las publicaciones o mejor dicho artículos varios que salen periódicamente en varios sitios a la vez. Muchos de ellos únicamente y exclusicamente para informar nuevas novedades, cambios de decisiones, promesas, sorpresas y alguna que otra cosa que llame la atención y no nos hallamos percatado antes.\nDe eso hay muchos u otros blogs que se dedican a llenar palabras, versiones y sobre todo “ilusiones” de que una cosa es mejor que la otra. Mejor librería, mas futuro, nuevo estilo y quien sabe que cosas mas.\n\nA mi lo que mas me llama la atención es la individualidad, o como decir de ello, la magia por lo que una persona en cualquier sitio del mundo puede o no puede hacer, deja o no dejar de hacer con cualquier cacharro mínimamente informático.\nEs indiscutible que si se para a pensar o plantear la cantidad de tareas, rutinas, funciones o actividades que puede hacer y sobre todo entregar una simple máquina digital sorprende, o mejor dicho abruma.\nPor otro lado son muchos mas los que sin mucho que decir ni hacer se conforman con que haga bien lo que necesita hacer, es algo tan pero tan simple que no entiende porque incluso se le actualiza el sistema de forma autonoma, sistemática, innegociable y sobre todo en contra de su propia decisión si no lo ha podido prevenir a tiempo y con suficiente información.\n\nEntonces nos encotramos y nos hallamos con un mero mundo de temas, artículos y sobre todo opciones casi incombustibles para disfrutar y transmitir de forma constante y perenne. No cabe simplificar mas ni cabe considerar que unos hacen un trabajo mejor o mucho mejor que otros, las novedades siempre son interesantes claro pero las otras novedades lo pueden ser mucho mas y sobre todo pasar sigilosamente o mejor dicho invisiblemente porque su proposito no es precisamente llamar la atención en ningún momento.\n\nSe supone que siempre, siempre, pero siempre de los de siempre la última consecuencia y actos de una máquina tiene que ver con el usuario, dueño o función que está realizando. No se hasta que cierto punto esta perspectiva o necesidad de dominar las cosas de una forma tan “cómoda” o sobre todo tan destacable está haciendo cambiar de una forma si y siempre así todos los medios tecnológicos, a un paso mas por delante de lo que por propio peso o mejor dicho por propia dicha y capacidad propia puede o debe hacer.\n\nAntes que se me olvide respecto el reclamo de las improvisaciones y sobre todo creaciones es muy cierto que llevamos varios años en tinta seca sobre ello, se reclama ya mucho que desde los años 90 del siglo pasado la informática ha evolucionado poco, muy poco si nos paramos a mirar bien. Esto si es un “grave” problema si nos atendemos a las estadísticas, lógica, y sobre todo consecuencias de los medios por delante de las personas. Pensar que todas ellas se rinden o se vanaglorian de lo ya alcanzado es un tremendo error que solo aun nos da mas reclamo, mas autoría y sobre todo mas importancia a los que comenzamos, vivimos y experimentamos de una forma curiosa su inicio. O sea sobre los años 80. Que los recién nacidos de ahora o incluso de hace quince años todavía no vean, no improvisen o sobre todo no crean nada nuevo es de miedo, es de órdago y es de saber que puede pasar o suceder cuando esta generación realmente avance.\n\nMe recuerda y me hace ver que al fin y al cabo la informática es algo mas como el resto de las cosas, la bicicleta aun por mucho que se haya avanzado hoy en día sigue siendo exactamente igual y lo mismo que lo hicieron los primeros modelos, dos ruedas, un manillar y un asiento, de esto no hay nadie que lo cambie, nadie. Nada mas que para nosotros el cuadro, el material, la forma y posición de manillar, el asiento obviamente inconfundible e intransferible para nadie, pero es nuestra bici, nuestro camino y sobre todo nuestro excelente paseo y avance respecto el lugar y como del tiempo. Algunos de nosotros hacemos eso mismo pero con la informática, hacer cosas tan peculiares como intransferibles a los demás pero disfrutamos mil.\n\n¡Buen fin de semana! XikuFrancesc\n"
		},
		{
			"post_id": 11,
			"title": "La película o no de American History X.",
			"date_published": 1463503228.972,
			"body": "\n\nAyer noche me quedé a contemplar la película “American History X” de la que tiene muchos o varios ángulos interesantes que tratarse.\n\nCabe destacar que el argumento de plano y de pronto no transmite ni gratitud, ni interés ni motivación alguna. Conociendo todos las polémicas, problemas y manifestaciones raciales diarias que se desarrollan o se producen en cualquier parte del mundo, todavía así no cabe olvidar nunca que en el peor de los casos todavía queda (o cabe un buen hueco) para la sorpresa, para las manifestaciones sorprendentemente mas claras y sobre todo para un avance cuando todo está colapsado o sin sentido, a nivel personal, particular y sobre todo muy íntimo.\nEl hilo, el argumento y sobre todo la forma en que poco a poco la película nos explica la historia ayuda (quizás demasiado) en entender y adelantar los hechos y las situaciones que se alcanzan (y por otro lado lo deja justo por encima o sin profundizar mucho mas de lo necesario).\n\nTan interesante es la forma o hilo metafórico que se sostiene de manera superficial pero mas que suficiente para cualquier espectador, que llegaba a tal punto en que me planteé incluso que esta misma película debería ser de visión obligatoria en ciertos ámbitos, en cierta edad y sobre todo cierto espacio con total dedicación al argumento. Generando así a la vez un debate después de la película en donde varios chicos jóvenes puedan analizar sus impresiones, sus conclusiones y sobre todo lo mas importante sus experiencias de como unos leves minutos con la familia cambia todo el sentido la vida de varias personas, queriendo o sin querer. No hablo ya de reaccionar ni despertar gracias a una hora y media de pura película, pero si quizás un toque de atención en algo que curiosamente puede pasar y suceder en cualquiera.\nRevelar el argumento, del que casi ya he hecho bastante no tiene mucho caso, lo que si hace muy bien en aspectos generales es comenzar por la parte mas evidente de la crisis, o sea en máximo tono violencia. si vamos a hablar o hacer de esto pues vamos a lo que vamos, planteemos pues la situación real en unos minutos mas que suficientes de introducción.\n\nAmerican History X puede considerarse un tema y argumento de nivel medio o bajo para representar ciertas realidades cotidianas, pero como película que trata de poner algunos claros ejemplos de la sociedad es fácil pues interpretar, asumir o sentirse en la piel en algunos de ellos. Los entornos, la crisis económica, la inmigración, la historia, los barrios, las canchas, las pandillas, las salidas laborales, las amistades no deseadas, todo son parte del círculo que quieras o no estás incluido.\n¿El final? El final de la película no augura nada, absolutamente nada, de ahí que luego se revele o se manifieste todavía con mayores intenciones los actos violentos, algo así como un efecto retardado que sale de una forma u otra. Difícil de evaluar y mucho menos de madurar. ¿Que se veía venir? Si claro todo se ve venir, pero precisamente si lo ves venir… ¿como es posible que no canalices otra opción? Pregunta bastante inoportuna e incluso ofendible a cualquier individuo/”paciente” cuando se haya en una situación tan “descontrolada” particularmente como personalmente.\n\nAl final de todo hasta puedes darte cuenta que el real protagonista de la película es otro y no quien te pusieron en frente pantalla constantemente, es algo que no siempre estamos tan ni tan acostumbrados en reaccionar ni tener en cuenta con previo tiempo. Y todo tiene una semilla, ¿adivinas quien, donde y cuando surge? Pues de la forma mas sencilla, natural, neutral y curiosa del mundo. Lo cual por propia experiencia cabría incluso sopesar, sospechar y prevenir que podría suceder siempre así, pero es otro tema, otro debate y otra complejidad que dejaremos por ahora aquí.\nEs muy muy discutible que un neonazi interprete las cosas de otra forma mas que las que ya tiene asumida. Pero aquí viene lo que a muchos en términos de psicología nos interesa mucho mas, que para no gastar mas palabras ni espacio lo podemos resumir en : “ser víctima de su propia medicina“. Cuando uno pues es víctima de ciertas condiciones es pues cuando cambia de valores bajo un juicio bastante imparcial pero simplemente víctima de una forma visión de la que sin querer queriendo entras a formar parte y juicio sin suficiente preparación ni visión amplia necesaria, sin hablar de perspectiva de vida, lo mismo que dijimos en anterior párrafo respecto a la semilla. Y aunque la película acaba con un lema muy claro y clarividente en todo el hilo y argumento, hay que entender por que, bajo que circunstancia y como se llega a él, cuando a priori todo parece “tan simple y sencillo“. La vida da muchas pero muchas vueltas, y tú… ¿estás preparado?.\n\nXikuFrancesc\n"
		},
		{
			"post_id": 10,
			"title": "Escritorios modernos y las tareas mas sencillas.",
			"date_published": 1462024781.706,
			"body": "\n\nEs un eterno debate que acompaña a todo usuario de cualquier herramienta informática desde inicio de sus operaciones como actividades rutinaria o diarias.\n\nSe sabe muy bien quien emplea un simple ordenador que las actividades son muchas veces muy sencillas. Tanto en copiar, mover, buscar, insertar, crear, borrar y desplazarse en sus diferentes carpetas.\nPero todavía a día de hoy estas tareas a veces se nos convierte en la mas complicada, tediosa, lenta, aburrida y luego finalmente incluso compleja. Todo es muy fácil y bonito cuando se comienza, el problema viene poco después cuando se comienza a acumular y a multiplicar la cantidad de ficheros, documentos, imágenes, tipos de documentos diferentes, historia, cronología, enviados, recibidos y muchos otros formatos que sería un no acabar nunca de mencionar.\n\nCasi todos los días descubrimos nuevas formas, nuevos decorados, nuevas organizaciones, nuevas motivaciones pero en el fondo y mucho más en el fondo de siempre sigue siendo exactamente igual y lo mismo que el primer día. Moverse, copiar, buscar, crear, eliminar y navegar. Solo que quizás con la práctica o costumbre de todos los días no nos damos cuenta pero debemos organizar un poco mejor todo, ordenar y saber donde, como, cuando o de que forma esta o es todo.\n\n¿Que sucede pues? ¿Que tanto significa que nos perdemos con tanta facilidad? ¿Por que aun con todas esas herramientas no encontramos lo que con tanta prisa o necesidad necesitamos, y luego con toda calma o curiosidad navegando encontramos todo? ¿Que sucede cuando vemos o nos enfrentamos a algo tan simple o sencillo que deberíamos saber que esta ahí en su sitio pero luego es imposible encontrar?. ¿Que significa tanto avance de un escritorio ultramoderno y super decorativo con las herramientas mas optimizadas y todavía ni así sirve o nos es verdaderamente útil?.\n\nSe me presenta alguna que otra solución quizás ya muy debatida pero pocas veces aplicada, he visto varios intentos e incluso buenos casos prácticos que han funcionado levemente en su momento y en sus buenas intenciones, pero luego claramente por otras razones se ha olvidado, se ha prescindido o en el mejor de los casos se ha omitido como si nunca hubiera pasado nada absolutamente nada de nada.\n\nUna es el método de los metadatos, es como una forma de poner nombre, etiqueta, rasgo, referencia para luego buscar mas y mejor, y obviamente encontrar. A veces incluso se da la paradoja de que sus datos metadatos son mas grandes que el propio contenido, supongamos como ejemplo la propia contraseña de nuestro correo. Pero asociamos con ella varias palabras claves, cuentas, nombres y que al final sabemos donde está y como la encontraremos siempre sin problema.\nLos metadatos ayudan a situar de forma mágica y genial para cualquier sistema que en su propia tabla de contenido y sobre todo de indice, o búsqueda sabe muy bien donde está de plano y sin perder tanto tiempo.\nFinalmente la opción más clara, usar el medio mas rudo, betusto y simple para que siempre veamos como, donde y de que forma almacenamos todos nuestros documentos, pero eso si ordenador de una forma muy clara como solo nosotros podemos ver y saber, no un modo general para todo el mundo. Sino crear y adaptarse al propio pero digamos así como en “texto puro y duro”. O sea en otras palabras sin adornos, sin escritorio super elegante, ni extra lleno de funciones y habilidades ni nada similar. Sino letra clara y sencilla, que siempre “por los ojos entra”.\n\nSon dos opciones trabajosas, y obviamente nadie lo va a hacer así, o más que nadie es que solo un círculo de personas muy reducidas lo entienden, lo pueden entender y lo mejor de todo es que aparte de entender lo llevan y lo asumirán como asimilarán perfectamente.\n\nQuizás como dicen el viejo dicho, las cosas con puño o con sangre entra. Lo demás no sirve.\n\nXikuFrancesc\n"
		},
		{
			"post_id": 9,
			"title": "Música y músicos, historias que se terminan.",
			"date_published": 1461794047.889,
			"body": "\n\nMe está causando cierta sorpresa las manifestaciones que descubro están manifestando ahora tras el fallecimiento de The Prince, son ya varios los artistas que en pleno concierto dedican unas canciones, unas palabras, unas notas, una imagen y sobre todo un enorme respeto al músico.\n\nAnte la sorpresa de que hasta ayer era casi uno mas en la larga colección de artistas que tiene su aquel icono, su imagen, su sello, sus formas y sus manías fácilmente reconocibles, porque no decirlo, se consideraba como no prescindible o imprescindible según como llegara a sentir o interpretar su música o entretenimiento.\n\nSi hace unos meses fue David Bowie que también nos dejaba en seco, que por cierto tampoco se ha esperado mucho después del otro malogrado nombre llamado mas a temas de oscuridad Lou Reed, estamos llegando quizás a una etapa que cuesta aceptar, cuesta entender y sobre todo cuesta asumir de una forma u otra que esto se va “plegando”, se va cerrando o consumando y se van dando por terminadas los ciclos, los autores, las canciones y las temporadas famosas de sus estilos musicales.\n\nEs indudable que músicos y cantantes que han sido de larga batalla están ahora dando claras muestras que a todos hay que dar el respeto necesario, pues saben muy bien que el día de mañana pueden ser ellos mismos los que no puedan levantar ni reproducir una nota mas. Claro siempre que sus respectivos egos lo permita, o tristemente hasta las casa discográficas lo exigen mutuamente, deben cuidar y manifestar que esta sección y este selectivo club de personas que viven de, con y por la música va llegando a otros fines, otras metas y sobre todo otras realidades irrefutables.\n\nOtros detalles u otro debate que me genera estos días con la composición musical es comprobar la calidad y generación que estamos convalidando. Si bien son muchos los que lloran, han llorado y pronto llorarán por figuras que han representado tanto incluso por tantos temas, incluidos los de protesta, los tantos diferentes estilos de rock, los géneros tan variados en sus posibles acústicas y los estilos tan creativos como han podido improvisar o estudiar en sus diferentes estudios, que incluso los músicos nuevos actuales (si es que se pueden llamar así) lo van a tener bastante difícil conseguir resultados similares. Ni se presenta ni se valora ni se otorga la misma facilidad como la misma valoración, con el imperativo de ser o mejor dicho comprobar el beneficio o mejor dicho el reclamo y la reacción positiva por aquello se expresa o se siente por la música.\n\nNada que ver con los éxitos comerciales, nada que ver con los medios publicitarios, nada que ver con las oportunidades creadas antes de saltar al estrellato, ni nada que ver por el reclamo de la buena autenticidad como la buena calidad, y sobre todo talento que de verdad ofrecer una y otra vez sin perder ni un ápice de ilusión, entusiasmo y entrega a todo público en todos los días de la semana y bajo cualquier circunstancia o influencia de entorno. No hablemos pues lo que es la pasión por el sonido, por la melodía y por la composición, sobre todo por la manifestación aquella que con sanas palabras no se puede alcanzar ni manifestar, pero con instrumentos u otras herramientas si se puede vislumbrar o imaginar en modo real lo que se trata alcanzar.\n\nPor otro lado no hay que olvidar como eternos guerreros de la guitarra aun con todo el historial, beneficio y riqueza acumulada en sus años gloriosos siguen dando batalla, siguen subiendo en escenarios y siguen dando sus versiones, reciclando melodías y ofreciendo espectáculo, animaciones y sobre todo experiencias nunca prescindibles, mas al contrario muchas veces imprescindibles para cualquier público, cualquier espectador interesado en sentir, vivir y experimentar que en otro modo y medio no podría alcanzar ni imaginar.\n\n¿La generación de los 70, 80? Que importa su nombre, lo que importa es que se nos va, se nos escapa, ¡¡puta madre!!\nBruce Springsteen, David Gilmour, Mark Knopfler, Eric Clapton, Phil Collins… ¿cuantos más nombres vamos a copiar y poner aquí?\n\nXikuFrancesc\n"
		},
		{
			"post_id": 7,
			"title": "¡¡Capitán : soy su servidor!!",
			"date_published": 1457384130.301,
			"body": "\n\nLamento aguarte la fiesta pero los servidores están para caerse.\n\nLamento romper mitos y lamento faltar el respeto, pero hasta el mas mejor servidor del mundo se cae por “cualquier” detalle. Y la culpa es nuestra obviamente por pensar que máquinas así o diseño extravagantes son y estás para soportar todo y mas, cualquier cosa y lo que venga.\nLuego la realidad nos asienta sobre el suelo y basta que sea una de las tantas “capas de cebolla” que necesitamos para que todo marche muy bien, o bien como mínimo, pero no se puede y nunca será posible que sea ni autónomo ni automático.\n\nLa idea de servidores es tentadora, realmente un sueño tener máquinas en predisposición a cualquier momento, cualquier hora, cualquier circunstancia y sobre todo cualquier capricho personal o no. Desde un niño quiere tener siempre su juguete a su predisposición para jugar en cualquier momento, ya sea incluso comiendo o estando en baño, o viajando en coche con sus papis.\nPero todavía hay que recordar una y otra vez así que todo falla, todo es muy vulnerable y todo puede pasar en cualquier momento. Ni el mejor sistema operativo, ni el mejor cortafuegos, ni el mejor servicio en marcha o desactivado, ni el mejor cable, ni la mejor conexión a redes, ni la mejor difusión entre redes te asegura nada, absolutamente nada.\n\n¿Por que? Porque vivimos en un mundo de sueño, un sueño que se ha llevado a la realidad como si fuera o fuese verdad siempre lo que soñamos. Los sueños son una cosa y las máquinas son otras. Pero la comodidad, calidad y quizás el peor factor de todo que es el desconocimiento de como son las cosas de verdad hace que de nuevo soñemos por encima de nuestras propias probabilidades y capacidades.\n\nSon miles de ingenieros, técnicos, programadores y administradores de sistemas que viven y se vuelcan todos los días por quien sabe que detalles mejorar. No se si todos ellos juntos luchan por todavía el mismo sueño de que si es posible siempre tener unas máquinas al cien por cien entregadas por y para nosotros. De que lo ven como el mejor juguete hecho y construido por el ser humano ya queda muy poca duda, incluso capaz de hacerlo tener vida propia y que así el juego/juguete sea inabarcable, incombustible e inacabable.\n\nEn cambio otros no nos hace falta esa premisa, no podemos ni debemos pedir algo que ni nunca la naturaleza ni la física ni mucho menos la energía lo hace o lo ha hecho nunca : constancia. Las máquinas se apagan, las conexiones se caen, los servicios se colapsan, los tiempos se añaden, los discos se llenan, y en algún momento hay que volver a comenzar. Volver a comenzar como si un nuevo ser vivo fuera o fuese, que tome una nueva vida, un nuevo ciclo y una nueva ilusión.\n\nY si en algún momento yo veo que mis máquinas, mis servicios, mis conexiones, o sobre todo mi vida se cae o tiene una pausa pues lo veo, lo reconozco, lo identifico, lo reparo y comienzo de nuevo. Cada día sale el sol, cada día es nuevo amanecer y cada día es diferente al día anterior. Y los servidores no van a ser nada diferentes.\n\nXikuFrancesc"
		},
		{
			"post_id": 5,
			"title": "Las eternas metáforas desde la terminal hasta el entorno gráfico.",
			"date_published": 1457032173.876,
			"body": "Muchas veces cuando encuentro problemas con el cliente que no puede hacer algo tengo que comenzar por exponer pequeños detalles, leves ejemplos para que sepa exactamente en donde se quedó. Cuando ya pues los dos nos entendemos entonces lo demás viene casi rodado, pero hay que poner bases o antecedentes para dar toda la importancia necesaria al contexto.\n\nWYSIWYG es el acrónimo de What You See Is What You Get (en español, “lo que ves es lo que obtienes”) es lo primero que me acordé cuando quise comenzar este texto en comentario sobre el debate abierto durante unas semanas por su odio/amor a los nuevos usuarios, sobretodo o básicamente.\n\nLa terminal, o ese cursor parpadeante que desespera a mas de uno porque no se ve nada ni se sabe que hacer, tiene no solo otro proceso y otro complejo que cubrir mas importante sobre el sistema operativo, sino que es incluso un de los tantos otros medios posibles para interactuar.\nRecuerdo cuando estas en MS-DOS todo era por “terminal” (por así llamar y salvando las distancias), tenías que editar mil veces el autoexec.bat para dejarlo como te gustaba o necesitabas, luego cuando entrabas a OS/2 tenias una terminal todavía mas potente, multiplicada por dos o por tres, pues ya la multitarea y los mismos procesos se encargaban de mas cosas armoniosamente.\nAntes que se me olvide incluso los juego en el vetusto ms-dos ampliaron y mejoraron con DOS/4GW para poder disfrutar algunas novedades como el Wolfestein o el incombustible Doom. Y remato con el 4Dos, era una recarga mucho mas potente de comandos que dejaba el placer máximo a los últimos tiempos antes de la invasión por Pc del entorno gráfico.\n\nEl DR-DOS aplicaba por primera vez la multitarea real en la propia “terminal” DOS, tener un “msdos” con varias terminales era algo rompedor, pero claro ya en ese tiempo llegaban los primeros escritorios y Windows estaba comenzando precisamente  a enseñar los dientes con todo su poder. Tanto así que si Windows detectaba que estaba instalado encima de un drdos ni arrancaba, todo un ingenioso truco de Microsoft y nadie sabía ni quería.\n\nLas primeras computadoras, no ya de 16 o 32 bits, sino los de 8 bits realmente no eran precisamente gráfico, todo todo era por texto, pasos elementales y ordenes claras. Y todavía así ya había empresas, secretaria y departamentos que con ese poder nuevo de procesar tan rápido lo querían y lo tenían implementado para mejorar sus resultados, aprendieron pues a defenderse del cursor o “la terminal” como llaman hoy en día. La historia hay que conocerla y respetarla un poco, pues sino vamos a cometer el mismo error como se ha cometido en tantos otros ámbitos siempre.\n\nEl entorno gráfico debe cargar, necesita arrancar nuevos servicios, espera y procede con el triple de procesos, dependencias, rutas y confirmaciones para realizar la misma tarea, pero esto tiene una clara ventaja al informar mas o mejor al usuario final que esta sucediendo y que parte se esta procediendo,\n\nEs indiscutible que gracias a toda esta información y capacidad de wysiwyg el usuario o cliente final se encuentra prácticamente al final del resultado que requiere. Aquí es otro problema de la informática, las prisas, la velocidad, la urgencia, los resultados, mientras que hacer un documento en vim, nano, edit, en wordstar, en wordperfect del clásico te concentrabas mas en el contenido que no en las formas.\n\nParadójicamente LaTeX es todo otro medio y aplicación para lo dice mejor la diferencia de terminal a escritorio. Metafóricamente hablando LaTeX es a mi juicio lo mejor después de wordperfect clásico, tu mismo programas el documento y el resultado sale perfectamente visible, Y lo mas importante, vayas donde vayan y sea la maquina que sea sigues usando las mismas opciones, protocolo y formas para terminar de completar tu documento LaTeX, no necesitas ni una aplicación en especial, ni entorno gráfico ni metadatos especiales, es puro texto plano, documento transparente y calidad final mas que profesional.\n\nAhora, ¿quieres perder el tiempo en aprender, practicar, comprender y mejorar el código parpadeante para tus acciones? Definitivamente no, no, no, no y no y siempre nunca mas no. Nadie quiere aprender, es tedioso, es aburrido, es cansino, es tardío, es pesado, es costoso, pero pues la terminal queda ahí, potente, impasible, incombustible e infatigable. Sobre todo muy muy infatigable.\n\nLlegado al momento que pues, unos aprenden ciertos trucos, otros aprovechan cierta rutinas y otros encuentran cierto relajo, cierta seguridad y sobre todo bastante profesionalidad en proceder independientemente de tantos recursos ni tanta complejidad ni dependencia de nada. Internet es la prueba mas clara de como un comunicado, un mensaje o un documento es enviado de un lado a otro con solo entrar a la consola y escribir scp o mail, y en meros segundos tienes el valor e información en otra persona con cero segundos y sobre todo cero errores.\n\n¿Hay personas que no pueden, no tienen, y no les cabe mas remedio que usar la interfaz mas amigable y cómoda? Claro que si, y están en ello perfectamente miles de personas ayudando, mejorando y corrigiendo todos los meros detalles. El beneficio siempre es mutuo tanto para los que si usan como los que no usan pantallas negras. Pero siempre el gráfico dependerá del monitor negro, aquí no se discute quien fue primero si el huevo o la gallina.\n\nSteve Jobs se encargó mucho de eliminar la consola o mejor dicho la pantalla negra, pues su atractivo estaba completamente en exportar su tipografía, algo que aprendió mientras estaba en la biblioteca y tuvo que escribir mil veces para valorar y aprender lo que implicaba y significaba.\nEl Amiga de Commodore, es tan brutal maquina que no se entiende sino es empleando incluso su “terminal”, de hecho es un cli majestuoso y potentísimo que ha sido padre de muchos diseños y acciones que todavía hoy en día se reclama, por ejemplo programando una demo y que coordinando los cuatro diferentes chips obtienes una animación envidiable. Y quien dice animación dice productividad, coordinación y multitarea real (con terminal y entorno gráfico al mismo tiempo).\n\nY como no para terminar pues usaremos otra metáfora que como bien dijo muchas veces Stallman tiene que ver con las recetas y el cocinar. El usuario final no tiene que aprender la terminal, mas cuando pasa un tiempo descubre por activa y pasiva que le conviene, que le favorece y le mejora su dominio sobre su herramienta o medio. Hasta el mas elemental chef de cocina tiene que ir al mercado, a buscar los componentes mas frescos, mas seguros y mas recientes, su labor no está en salir a la calle sino que está en la cocina, y ahí vemos como los mejores deben dar el primer paso que es precisamente salir a la calle, ir al mercado, documentarse, aprender, oler, y comprobar que todo es lo mas limpio posible para que el trabajo final sea el mejor. Y después cuando ya tienes todo el trabajo elaborado y completado entonces te facilita la receta, pero los componentes los tienes que poner tú, siendo casi igual en gramos, textura y frescura necesaria.\n\nXikuFrancesc"
		},
		{
			"post_id": 4,
			"title": "\"El año del escritorio Linux.\"",
			"date_published": 1456951896.955,
			"body": "\n\nUn debate muy interesante que me pareció ver el otro día fue sobre el escritorio de linux, que si estamos en el año del escritorio de Linux.\n\nQuizás muchos y muchas no tienen ni la mas remota idea de lo que estamos hablando y con razón, muchísima razón por que hasta parece vergonzoso lo que se esconde detrás.\n\nY como no puedo evitar en formular metáforas para explicar algunos detalles lo aplico aquí únicamente con las damas, como si no tuviéramos ya suficiente. Basta con hacerse cuenta cuando a una dama le/se pregunta que se va a poner. Que si le queda bien si o no, que si se ve así o asá, que si no hace mas o menos efecto del que pretende y mucho mas que vamos a dejar en plano.\n\nEntonces cuando entramos en un terreno en que se permite tal lujo de cambiar, añadir, combinar y sobre todo personalizar tanto tu propio escritorio tanto de trabajo como de entretenimiento pues pasa lo que tiene que pasar, resulta muy pero muy difícil ponerse de acuerdo. Que es mejor, cuando es mejor, que dura mas, que resulta mas práctico, que forma es mas amena, que combinación es correcta, que tono se aplica en general.\n\nSe dice que desde hace tiempo en gnu/linux se reparte el pastel entre dos estilos o dos escritorios de forma clara, que si Gnome y que si KDE. Pero ahora la cosa se complicó un poco mas, o digamos como bastante mas. Habiendo dicho eso de dos clásicos pues se está cometiendo de plano un pecado pecadísimo prescindir de muchos otros menores que tampoco han sido nada de este mundo, sino precisamente mucho, openstep/gnustep, fluxbox, enlightenment y un mar mas sin nombrar.\nY si esto es poco todavía podemos confirmar que han salido nuevos actores en los últimos años, que si Mate, que si Cinnamon, que si Unity, y el siempre disimulado pero omnipotente XFCE.\n\nPero no es esto lo que define como importante, no. Lo importante ahora es lo que aun dentro de cada uno de ellos puedes aun mejorar, hacer, incrementar, cambiar y definitivamente personalizar. Lo tienes en modo básico y elemental cuando termina instalación, pero conforme pasa las horas o instantes donde ves ciertas reacciones entonces sabes como manejar, buscar y encontrar lo que necesitas., como lo necesitas y donde.\n\nEl extremo es tal que resulta muchas veces casi imposible copiar, ni transferir ni conseguir exactamente lo mismo de un estilo de una máquina a otra, sino es porque lo instala y lo deja todo copiado y configurado como tal desde inicio y tú casi ni tocas nada.\nLa abrumada cantidad de detalles, minucias, rasgos, lineas y características que casi ni creías que estaban ahí, están y si que están. De alguna forma es bastante lógico y entendible que sea así, pues todo el código está a la vista, y no es para que lo aprenda el usuario ni nada de nada, ni yo mismo entiendo ni llego a leer código ninguno, lo que se aquí se pretende hacer y decir con el código accesible es que nada se limita, poco o nada te extralimita, mucho se puede hacer y mas se puede pedir.\n\n¿Es el año del escritorio en Linux? Si, desde el primer momento y del primer año que se gestó, hay en viejas capturas las maravillas de como eran esas sistemas aun con los kernels mas primitivos, escritorios mas básicos, rutinas mas simples pero, pero siempre pero muy muy particular, muy característico y muy inconfundible, intransferible, reconocible como identificable.\nTanto es así que incluso muchas características que ahora presumen tanto en Windows como en Mac OSX ya estaban ahí siempre en gnu/linux en sus diversos escritorios. La animación, los accesos, las herramientas polivalentes, las vistas previas, los multi escritorios, los múltiples efectos que aun se añaden.\n\nAhora dime tú, si estás por ejemplo en Windows o en Mac OSX, ¿te dice algo que existen muchas opciones, o escritorios alternativos? ¿Dependes muy mucho de tu aplicación “producción”? ¿Puedes, quieres o te hace ilusión probar algo diferente? Queda muy claro que poder puedes, y metas hay muchas que se puedan alcanzar. Caminos ya ni mencionamos, pero ¿escritorios linux, que sea ya el año del “escritorio linux”? ¿Que es eso, una moda?.\n\n\nXikuFrancesc\n"
		},
		{
			"post_id": 3,
			"title": "Practicando pruebas.",
			"date_published": 1455473977.321,
			"body": "Siendo el concepto nuevo del que todavía tengo que revisar muchas cosas, necesito practicar y descubrir como se procede en las mayorías de operaciones de esta plataforma.\nCon la idea siempre que hace falta tener una modalidad \"servidor\" para que puedas ver, consultar y sobre todo ser consultado por los demás de forma estable."
		},
		{
			"post_id": 2,
			"title": "Primer escrito...",
			"date_published": 1451788943.456,
			"body": "Primera entrada del blog, mas nervioso que un flan encima de una gelatina."
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}