{
	"posts": [
		{
			"id": "2d828e42-9de3-4820-adf9-a8c52cd7e2f8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "\"It's OK to Be White\" Flyers Lead to Promise of \"Severest Disciplinary Action\" by Western Conn. State U.",
			"body": "When you overreact, the kids will do it more and more AND take pictures.",
			"time": 1573078924929,
			"files": "[{\"name\":\"“It’s OK to Be White” Flyers Lead to Promise of “Severest Disciplinary Action” by Western Conn. State U. – Reason.com 2019-11-06.png\",\"thumb\":\"a73270497f8fb24ce28023e7b08f8c132ed61786-thumb.png\",\"size\":3896694,\"type\":\"image/png\",\"original\":\"a73270497f8fb24ce28023e7b08f8c132ed61786.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "28442e94-e9cd-406a-9132-55761ad1be0c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Maybe just noise, but France may have finally had enough.",
			"body": "No country can accept unlimited migrants.",
			"time": 1573079376504,
			"files": "[{\"name\":\"France to impose migrant quotas to 'take back control'  Fox News 2019-11-06.png\",\"thumb\":\"9a13a7c386a3a7393ff7949438afa3a110c3616e-thumb.png\",\"size\":2349079,\"type\":\"image/png\",\"original\":\"9a13a7c386a3a7393ff7949438afa3a110c3616e.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "96815709-6191-444d-aa0c-06f05db5568d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "We must free ourselves from federal parasites - just pink slip them all.",
			"body": "The only interest of the state SHOULD be:\n\n1. Stopping theft\n2. Stopping murder\n3. Collecting taxes\n\nAll other activities are bullshit. We've now seen multiple cases of FBI agents being involved in Bitcoin theft, and now the DEA sells \"indulgences\"? Ever wonder who else is on the take?\n\nShould not surprise anyone how the Dems routed Republicans in VA. Those people want their gravy train to continue. And Trump STILL doesn't \"get\" the resentment out here. Otherwise he would have acted quickly to shrink the government. It's TIME.\n\nJust how many CIA/FBI/NSA blunders can this country afford? Those fuckers write checks against our bank account. They are high maintenance.",
			"time": 1573079979694,
			"files": "[{\"name\":\"First On 7- Corrupt DEA agent took bribes to help Buffalo Mafia friends evade scrutiny, feds say 2019-11-06.png\",\"thumb\":\"6350c036db626dc81117b97fb0f673f89ce9de2e-thumb.png\",\"size\":409675,\"type\":\"image/png\",\"original\":\"6350c036db626dc81117b97fb0f673f89ce9de2e.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "e2b0a6ca-9671-4990-878c-19b1556d09c1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "End times must be near - more Catholic Immaculate Conception",
			"body": "SJWs might be right too if the baby is colored :)",
			"time": 1573081211800,
			"files": "[{\"name\":\"Roman Catholic Church opens investigation after two nuns became pregnant  Fox News 2019-11-06.png\",\"thumb\":\"657106199cc74e52e7dada0a57363e4153ba5a97-thumb.png\",\"size\":1180107,\"type\":\"image/png\",\"original\":\"657106199cc74e52e7dada0a57363e4153ba5a97.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "218427b7-dcea-412f-bfa0-cf59aaf2176c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Neo Nazis - you just can't make stories like this up...",
			"time": 1573081454748,
			"files": "[{\"name\":\"James Stern, black activist who took over neo-Nazi group with plans to destroy it, has died - CNN 2019-11-06.png\",\"thumb\":\"64c2e6006b8363509aa19c35916fee0109632c4f-thumb.png\",\"size\":1081331,\"type\":\"image/png\",\"original\":\"64c2e6006b8363509aa19c35916fee0109632c4f.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "77adbbf3-c67c-4571-b101-61123729bc06",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>dbc07b4b-0971-40cc-85d8-b1c7730627cf\nCan't blame him. The Journos and lawyers are on jihad against image boards right now. All of the world's problems are caused by imageboards and right wing terrorists :)\n\nVice News was 'deplatformed\" off HBO last month. Their last published story was about 8chan.\n\nTwo days ago, they published a new story from the edge of their grave.\n\nNot difficult to see that those journos have a real hard on for any alt-right watering hole - since they're doing this from the edge of their grave.\n\nWhat board owner has the resources to deal with something like this? The queers funding these pogroms aren't held down by having to care for children. Perhaps loss of their journo jobs might dampen things a bit :)",
			"time": 1573082275107,
			"files": "[]"
		},
		{
			"id": "92039875-915d-4b46-bd53-59e711f1c77e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "States Want to Use Identity-Theft Laws to Go After Undocumented Immigrants",
			"body": "Have often wondered why states failed to prosecute...Employers too.\n\nVice \"news\" sees things differently.\n\nMany of the roughly 8 million undocumented immigrants who work in the U.S. use fake Social Security numbers. But the vast majority of those cases go unprosecuted. The federal government only has so much time and resources, after all.\n\nNow, the Supreme Court will decide whether states have the authority to go after immigrants who use Social Security numbers that don’t belong to them. Only the federal government can prosecute those crimes right now because of a 1986 immigration law, and because, broadly speaking, immigration enforcement is a federal problem.\n\nIf the justices side with Kansas, states across the country could begin using identity theft laws to prosecute immigrants for using fake or stolen Social Security numbers. Experts say that would put more immigrants in the prison-to-deportation pipeline — and give employers another way of exploiting an already vulnerable workforce.\n\n\"We often find that the very same employers who are willing to hire unauthorized migrants are also willing to use their unauthorized status as a weapon,” said César Cuauhtémoc García Hernández, an associate professor at the University of Denver Sturm College of Law, told VICE News. He added that undocumented immigrants are “inherently in a more easily exploited status because they are always at risk of ICE showing up.”\n\nIn 2011, ICE agents and local police officers in Kansas went to the apartment of a man they were trying to get in touch with, only to find that it was leased to someone else: a woman named Guadalupe Ochoa-Lara. According to a brief filed in the case, the officers then discovered that Ochoa-Lara used a Social Security number belonging to a woman named Tiffany McFarland to rent the apartment.\n\nOchoa-Lara was one of at least three immigrants Kansas prosecuted for identity theft between 2011 and 2012 after police discovered they were using Social Security numbers that didn’t belong to them to live and work in the U.S. All three argued that the state couldn’t prosecute them because Congress left immigration enforcement to the federal government.\n\nBut Kansas claims that it should be able to prosecute non-citizens for identity theft in the same way it prosecutes U.S. citizens. Seventeen states have filed briefs in support of Kansas, arguing they should be able to enforce state laws against identity theft as well.\n\nAn estimated 3.2 million undocumented immigrants live in those states — which include Georgia, Texas, and Colorado — or roughly 30% of the undocumented population in the U.S., according to a 2016 estimate by the Pew Research Center.\n\nIn a brief filed in support of Garcia and the other immigrants, the Southern Poverty Law Center and 29 other organizations argued that the Kansas law could also incentivize employers to retaliate against immigrant workers by threatening to report them for identity theft. According to the brief, between 40% and 80% of immigrants have reported being victims of wage theft, a problem the organizations say could get worse if the law is allowed to go into effect.\n\n“Not only do we believe that that's extremely unfair to immigrant workers who are protected by workplace laws like minimum wage and overtime laws,” Julia Solorzano, an attorney with the SPLC, told VICE News, “but it drives down wages and working conditions for all workers in this country when you allow unscrupulous employers to get away with that kind of workplace abuse.”",
			"time": 1573083726106,
			"files": "[{\"name\":\"States Want to Use Identity-Theft Laws to Go After Undocumented Immigrants - VICE 2019-11-06.png\",\"thumb\":\"22dc9f3bf7446a3a46a77baa424a296ad2d75a21-thumb.png\",\"size\":4148520,\"type\":\"image/png\",\"original\":\"22dc9f3bf7446a3a46a77baa424a296ad2d75a21.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "347b3210-52a1-4719-936b-34a55d32902e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e2b0a6ca-9671-4990-878c-19b1556d09c1",
			"body": ">>02be0aff-9a24-461e-8d42-b26bf2a8a95b\n\n\"toilet seat\"\n\n:)",
			"time": 1573086487206,
			"files": "[]"
		},
		{
			"id": "20204486-9015-434b-a290-4f0ff4f39d93",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "e82ca06c-c77a-48b1-94cd-8e8d049448be",
			"body": ">>e82ca06c-c77a-48b1-94cd-8e8d049448be\nJust an observation. \"Decentralized\" means nothing to most people. It's not a worthy goal. \n\nMaking yourself impossible to censor or track down IS a worthy goal.\n\nie \"learn this difficult stuff so you can show your finger - and \"THEY\" can't do anything about it.\"",
			"time": 1573087052006,
			"files": "[]"
		},
		{
			"id": "2043ba38-dd57-4cce-ac65-a2725bacf2f8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "A Bunch of Racists Are Holding a Barbecue Outside a Migrant Camp in Greece",
			"body": "A Greek nationalist group has caused an uproar with its plans to protest immigration by grilling pork and drinking beer outside a camp full of Muslim asylum seekers.\n\nThe group, United Macedonians, is calling on supporters to join in a \"barbecue protest\" Sunday outside a refugee camp Diavata, near the city of Thessaloniki, to demonstrate against rising numbers of undocumented immigrants in Greece, a frontline state for migration into the European Union.\n\nThe stunt, which called for “plenty of pork and alcohol,” is a calculated provocation against the camp’s occupants, most of whom are Muslim.\n\nThe plans prompted fierce debate in Greece’s Parliament Tuesday, as lawmakers clashed over how to respond to the protest. Christos Giannoulis, of the left-wing opposition Syriza party, called the demonstration a “disgrace” and called for the protest’s organizers to be held accountable for their “provocation against people of other beliefs.”\n\nBut Kostantinos Kyranakis, a deputy for the governing center-right New Democracy party, said Greeks shouldn’t have to adapt their way of life to accommodate immigrants. He later doubled-down by posting a picture on Facebook showing him and his friends eating pork souvlaki and drinking beer.\n\nThe planned protest comes amid rising tensions over immigration in Greece as it faces a surge of arrivals through Turkey, the majority of whom come from wartorn countries like Afghanistan and Syria. About 55,000 people arrived between the start of 2019 and the end of October, more than the 50,000 who arrived in all of 2018.\n\nThe rising numbers have worsened conditions in already overcrowded migrant camps, and last week the European Union’s human rights watchdog warned that the camps were \"on the edge of catastrophe.” In September, a deadly fire tore through the Moria camp on the island of Lesbos, where more than 13,000 asylum seekers are housed in a facility equipped for just 3,000.\n\n Greece’s government also passed tough new asylum laws last week, narrowing the criteria for eligibility for refugee status and streamlining the process for deportations.\n\nThe Islamic prohibition against eating pork is a common flashpoint in far-right campaigns against Muslim immigration, which typically present any concession to Islamic dietary requirements as a symptom of “creeping sharia.” In the German city of Leipzig in July, far-right extremists sent death and arson threats to kindergartens that announced they were removing pork from the menu.",
			"time": 1573088539242,
			"files": "[]"
		},
		{
			"id": "7c425a85-02a7-493b-8494-0919b71bc4a6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "20191105 The Trump Administration Dumped Thousands of Migrants on the Streets with No Support",
			"body": "Should we have provided cookies?\n\nHundreds of thousands of migrants — including families with very young children — were released into cities across the Southwest with little to no resources after the Trump administration ended a longstanding policy last fall, according to a new report from UC San Diego.\n\nPreviously, under the Safe Release policy, the Department of Homeland Security had coordinated migrants’ release from immigration custody and helped them arrange travel plans to get to their sponsors. But when the administration ended the policy in October 2018, citing an increase in families asking for asylum at the U.S.-Mexico border, Customs and Border Protection then started releasing thousands of people into cities near the border each week.\n\nMore than 250,000 asylum-seekers and other migrants were released between December 2018 and June 2019, forcing local communities to make a difficult decision: Spend money and resources on migrants who are just passing through, or let them fend for themselves.\n\nSeveral cities in New Mexico, California, Arizona, and Texas decided to help. In San Antonio, for example, a city agency converted a former Quiznos into a temporary resource center for migrants and set up a shelter in partnership with a local church. Volunteers at San Antonio’s migrant resource center helped people book flights and bus tickets.\n\n“The alternative was to have 25,000 people dropped off in the heart of San Antonio with no help, no food, and two or three nights ahead of them,” Colleen Bridger, the assistant city manager, told VICE News in July. “These are all families, most of whom have children. That’s not how you want families and kids spending a couple nights in your city.”\n\nThe end of the Safe Release program transferred the responsibility of helping migrants from the federal government to local governments, often at a high cost: San Diego County spent more than $1.3 million on caring for migrants after the policy ended and sued the Trump administration over it in April. Deming, New Mexico, declared a state of emergency due to the influx of migrants in May.\n\nBesides shifting responsibilities to cities, the end of the Safe Release policy also created additional hurdles for asylum-seekers, according to the UC San Diego report.\n\nSome organizations told researchers that families were released without notices to appear in court — meaning they had no idea when or where their court hearings would be held. Other migrants were given notices to appear even though DHS didn’t have addresses on file for them and wouldn’t be able to update them on changes to their hearings ahead of time. Asylum-seekers and other migrants who miss their immigration hearings are almost always ordered deported in absentia.\n\nThe number of families being released by Border Patrol has dropped drastically in the past few months, and the shelters that once took in hundreds of migrants each day began seeing fewer arrivals, the report shows. But this change is due to the Trump administration expanding its Remain in Mexico policy (forcing people to stay in Mexico while their asylum cases proceed) to additional ports of entry, not because of an actual drop in asylum-seeking families.   Vice News",
			"time": 1573088767542,
			"files": "[]"
		},
		{
			"id": "807fd627-6d95-4700-a25c-d89c35f60ee5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Proud Boys Leader and Roger Stone Fanboy Is Running for Congress",
			"body": "He’s already the leader of the Proud Boys, a far-right street fighting club, and now Enrique Tarrio is setting his sights on Congress.\n\nLocal Florida news outlets reported over the weekend that Tarrio — who has zero political experience — has filed election paperwork for the Sunshine State’s 27th Congressional District, in a bid to unseat Democratic Rep. Donna Shalala in the purple district next November.\n\nHis credentials are, shall we say, unusual. The Proud Boys, who describe themselves as “Western chauvinists,” are considered a hate group by the Southern Poverty Law Center on account of their Islamophobia, white nationalism, and misogyny. Tarrio, 35, was named chairman of “Proud Boys International” in November of last year, taking over from the organization’s founder, Gavin McInnes. McInnes’ resignation came after nine of his members were arrested for violently brawling with protesters in New York City, following his speaking appearance at the Metropolitan Republican Club. The violence was caught on camera, and showed Proud Boys hurling racist and homophobic slurs at passersby, as well as repeatedly kicking protesters. The arrestees’ sentences ranged from community service to four years in prison. Tarrio insisted that the Proud Boys were acting “in self-defense.”\n\nTarrio has done some time himself: He spent 16 months in federal prison for participating in a scheme to sell stolen medical equipment. Currently, he runs an online store selling Proud Boys and patriotic swag, like T-shirts and caps.\n\nHe'll first have to use his credentials to secure the GOP nomination, going up against another Republican challenger, former Spanish-language broadcast journalist Maria Elvira Salazar. In the swing district, created in 2012, constituents voted for both Barack Obama and Hillary Clinton in the last two national elections. Shalala, who took office in January, replaced a moderate, pro-LGBTQ Republican congresswoman.\n\nThe fact that Tarrio, who attended the violent Unite the Right rally in Charlottesville two years ago, is running at all, is yet another example of how emboldened right-wing extremists are smelling political opportunity in the deep partisan divisions of the Trump era. In 2018, far-right extremists in at least 13 states ran for positions in state or federal government.\n\nIn a statement to Miami New Times, a spokesperson for Tarrio called Shalala “Hillary Clinton’s puppet” who was trying to move America “towards a Communist police state.”\n\nSince his coronation as leader of the Proud Boys in 2018, Tarrio has become somewhat of a local Florida celebrity through his ardent support of former Trump adviser Roger Stone, who’s been frequently photographed with the group and is currently facing charges linked to the Mueller investigation. Tarrio and others have routinely shown up at Stone’s court appearances or Trump events wearing T-shirts saying “Roger Stone Did Nothing Wrong.”\n\nMore recently, Tarrio made national headlines when he helped organize a rally in Portland, Oregon, which has become a hotbed of political violence between Proud Boys and antifascist protesters since the 2016 election. Tarrio and his supporters claimed that the point of the rally, which cost was to exercise their First Amendment rights, but he was later caught on camera bragging about how they wasted “all their [Portland]’s fucking resources to make this rally.”",
			"time": 1573089294842,
			"files": "[]"
		},
		{
			"id": "05bcf84e-6857-47c7-83bc-4d014c15d361",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "(2hrs ago) Anon describes Hotwheels. Jim sued him today.",
			"time": 1573101540584,
			"files": "[{\"name\":\"Hotwheels5nyih6hqa6x31.png\",\"thumb\":\"8dd9d212d773c868c6058dc859517bbd033cca01-thumb.png\",\"size\":953274,\"type\":\"image/png\",\"original\":\"8dd9d212d773c868c6058dc859517bbd033cca01.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "fbc3da63-90ef-4152-9afb-89458f1be7b2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "US: Saudis recruited Twitter workers to spy on critics",
			"body": "Shoulda glassified SA .....\n\nBribing workers is becoming common within cellular networks. they steal your sim - then empty your bank account. Well worn path now....\n\nTwitter does it too. Just a matter of time before Google and Fuckface get caught.",
			"time": 1573102232584,
			"files": "[{\"name\":\"US- Saudis recruited Twitter workers to spy on critics 2019-11-06.png\",\"thumb\":\"5f8266a803976902e3b896978f5e5c618b5a24d6-thumb.png\",\"size\":1431506,\"type\":\"image/png\",\"original\":\"5f8266a803976902e3b896978f5e5c618b5a24d6.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "eca3a717-3cbb-482b-a901-94f04d4d4f9c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "US: Saudis recruited Twitter workers to spy on critics",
			"body": "Shoulda glassified SA .....\n\nBribing workers is becoming common within cellular networks. they steal your sim - then empty your bank account. Well worn path now....\n\nTwitter does it too. Just a matter of time before Google and Fuckface get caught.",
			"time": 1573102246284,
			"files": "[{\"name\":\"US- Saudis recruited Twitter workers to spy on critics 2019-11-06.png\",\"thumb\":\"2e0295265dc43175e6e6c3c5e8b475ac33424727-thumb.png\",\"size\":1431506,\"type\":\"image/png\",\"original\":\"2e0295265dc43175e6e6c3c5e8b475ac33424727.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "172acc8d-1249-4a7d-824a-48526e5e65bf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "PayPal To Cut Off Donations to Right-Wing YouTuber Stefan Molyneux Following Social Media Divestment Campaign",
			"body": "https://www.newsweek.com/alt-right-youtuber-cut-off-paypal-donations-1469936\n\nYou can control anything via the flow of money.\n\nAnd Bitcoin is a very poor tool - since it's traceable.",
			"time": 1573149737158,
			"files": "[{\"name\":\"PayPal To Cut Off Donations to Right-Wing YouTuber Stefan Molyneux Following Social Media Divestment Campaign 2019-11-07.png\",\"thumb\":\"5e32115688da111037290d31b2323301b8ba82dc-thumb.png\",\"size\":3305556,\"type\":\"image/png\",\"original\":\"5e32115688da111037290d31b2323301b8ba82dc.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "3516606f-cbd9-4db6-a0c1-15f15261e9dd",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Epstein Story-Killer Won 2019 Protection of Free Speech Award",
			"time": 1573149818258,
			"files": "[{\"name\":\"1inu27.png\",\"thumb\":\"c91484b03dea3939533d6ab5c35ecac41373b199-thumb.png\",\"size\":365698,\"type\":\"image/png\",\"original\":\"c91484b03dea3939533d6ab5c35ecac41373b199.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "0ed164a5-a01c-4c5c-9148-959bab402908",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "This new generation of gender-identity justice advocates wants people to feel obligated to affirm their identity—they want privileges for their difference.",
			"body": "https://humanevents.com/2019/11/05/contrapoints-vs-non-binary-nonsense/\n\nHopefully will become synonymous with \"short life\". These defectives will be expensive to all of us. They constantly grub for our money.",
			"time": 1573150345937,
			"files": "[{\"name\":\"Contrapoints vs. Non-Binary Nonsense.  Human Events 2019-11-07.png\",\"thumb\":\"a4d1e6f396c45e00af6389047ce8e548dbe6ba89-thumb.png\",\"size\":12596063,\"type\":\"image/png\",\"original\":\"a4d1e6f396c45e00af6389047ce8e548dbe6ba89.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "afe71e74-2337-47c5-ac34-c5c4e1fdae7a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Congressman Shames Blizzard for Letting Nazis Run Wild in 'World of Warcraft'",
			"body": "It's all about control",
			"time": 1573150847737,
			"files": "[{\"name\":\"FreezePage- Congressman Shames Blizzard 2019-11-07.png\",\"thumb\":\"314eb555ffd31386bbb140a70669ca6df6a97e20-thumb.png\",\"size\":460343,\"type\":\"image/png\",\"original\":\"314eb555ffd31386bbb140a70669ca6df6a97e20.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "b71232da-c7ef-45aa-a32a-f121fc766052",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Hooray for toxic masculinity :)",
			"body": "1 in 200 men direct descendants of Genghis Khan\n\nhttp://blogs.discovermagazine.com/gnxp/2010/08/1-in-200-men-direct-descendants-of-genghis-khan/\n\nFuck you Hollywood and your female directors lacking daughters we can rape :)",
			"time": 1573151345637,
			"files": "[{\"name\":\"Why This Year’s Awards Season Is All About Toxic Masculinity  IndieWire 2019-11-07.png\",\"thumb\":\"efd07834d622ceb83780dd9401de8c2b8fc3a908-thumb.png\",\"size\":2695372,\"type\":\"image/png\",\"original\":\"efd07834d622ceb83780dd9401de8c2b8fc3a908.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "b0058b13-62c8-4968-a89f-8718b3579747",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Disinformation ‘works better than censorship,’ warns internet freedom report",
			"body": "A rise in social media surveillance, warrantless searches of travelers’ devices at the border, and the continued spread of disinformation are among the reasons why the U.S. has declined in internet freedom rankings, according to a leading non-profit watchdog.\n\nAlthough Freedom House said that the U.S. enjoys some of the greatest internet freedoms in the world, its placement in the worldwide rankings declined for the third year in a row. Last year’s single-point drop was blamed on the repeal of net neutrality.\n\nIceland and Estonia remained at the top of the charts, according to the rankings, with China and Iran ranking with the least free internet.\n\nThe report said that digital platforms, including social media, have emerged as the “new battleground” for democracy, where governments would traditionally use censorship and site-blocking technologies. State and partisan actors have used disinformation and propaganda to distort facts and opinions during elections in dozens of countries over the past year, including the 2018 U.S. midterm elections and the 2019 European Parliament elections.\n\n“Many governments are finding that on social media, propaganda works better than censorship,” said Mike Abramowitz, president of Freedom House.\n\nFreedom House’s 2019 internet freedom rankings. (Image: Freedom House)\n\nDisinformation — or “fake news” as described by some — has become a major headache for both governments and private industry. As the spread of deliberately misleading and false information has become more prevalent, lawmakers have threatened to step in to legislate against the problem.\n\nBut as some governments — including the U.S. — have tried to stop the spread of disinformation, Freedom House accused some global leaders — including the U.S. — of “co-opting” social media platforms for their own benefit. Both the U.S. and China are among the 40 countries that have expanded their monitoring of social media platforms, the report said.\n\n“Law enforcement and immigration agencies expanded their surveillance of the public, eschewing oversight, transparency, and accountability mechanisms that might restrain their actions,” the report said.\n\nThe encroachment on personal privacy, such as the warrantless searching of travelers’ phones without court-approved warrants, also contributed to the U.S.’ decline.\n\nSeveral stories in the last year revealed how border authorities would deny entry to travelers for the content of social media posts made by other people, following changes to rules that compelled visa holders to disclose their social media handles at the border.\n\n“The future of internet freedom rests on our ability to fix social media,” said Adrian Shahbaz, the non-profit’s research director for technology and democracy.\n\nGiven that most social media platforms are based in the U.S., Shahbaz said the U.S. has to be a “leader” in promoting transparency and accountability.\n\n“This is the only way to stop the internet from becoming a Trojan horse for tyranny and oppression,” he said.\n\nSource\nTechCrunch.com\n\n\nHat tip to Zeronet. NO ONE gets special consideration here. A 12 year old kid is on equal footing with any powerful government, and could in fact take down their carefully constructed and expensive narrative. Zeronet is a 'fuck you\" place. Even the least restrictive boards can't make that absolute claim.",
			"time": 1573152718537,
			"files": "[]"
		},
		{
			"id": "dd32406e-6007-47ee-8f7d-c71567f17ac0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "One in five Russians wants children or grandkids to become intelligence officers — poll ",
			"body": "https://tass.com/society/1086883\n\nHow sad if true. Means the world will struggle to rid itself of these parasites.\n\nEver wonder what your personal contribution to the US security state amounts to each year?\n\nMust be good to be STASI......\n\n5 Nov, 04:55\n\nOne in five Russians wants children or grandkids to become intelligence officers — poll\nThe survey’s results indicate that Russians think highly of this profession\n© Evgeniy Kurskov/TASS\n\nMOSCOW, November 5. /TASS/. About 20% of Russians surveyed have said they would like their children or grandchildren to embrace the profession of an intelligence officer, a poll conducted by the Russian Public Opinion Research Center has shown.\n\nMilitary Intelligence Officers’ Day established by presidential decree on May 31, 2006, is celebrated by the Russian armed forces on November 5.\nRead also\nMost Russians are not afraid of losing jobs to robots — survey\n\nThe survey’s results indicate that Russians think highly of the profession. They rated the respect enjoyed by people in that occupation at 4.32 points out of 5 possible, the profitability and wage levels at 4.10 points and influence at 4.02 points.\n\nThe respondents named Richard Sorge (15%), Maxim Isayev (8%) and Nikolai Kuznetsov (5%) among the best-known intelligence officers. Russian President Vladimir Putin ranked fourth (named by 4% of the those polled). Russians also recalled Anna Chapman (1%) and Sergei Skripal (1%). About 69% of those polled could not recall a single intelligence officer.\n\nThe survey was conducted on October 31, 2019, with 1,600 Russians aged over 18 interviewed over the phone. The margin of error does not exceed 2.5% with a probability of 95%.",
			"time": 1573153037037,
			"files": "[]"
		},
		{
			"id": "2e567a45-e46b-47ae-b12e-1e4ba7c3550f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "CIA staff complained about Obama White House, new book claims",
			"body": "Not a reliable news source, but could still be true. While I don't like micro management - also don't want such vipers unleashed. Three letter agencies have cost Americans much freedom and treasure. Not a difficult argument to make - that we would be better of without any of them. \n\nThey screw up - we pay.\n\n\nCIA staff complained about Obama White House, new book claims\nBy Sam Dorman | Fox News  Nov 6, 2019\n\nEDITOR'S NOTE: An earlier version of this story accurately quoted the book as describing \"PC\" as standing for \"politically correct\" in characterizing certain Obama administration meetings. The author has since informed Fox News this was due to a misunderstanding between him and his source and that the initials referred to \"Principals Committee.\"\n\nA new book claims that top CIA employees have compared President Trump favorably to his predecessor, airing concerns that former President Barack Obama's administration micromanaged intelligence matters.\n\nThe revelation comes in commentator Doug Wead's new book  \"Inside Trump's White House: The Real Story of His Presidency,\" which is set for release on Nov. 26. Wead cites an unnamed White House source who claims CIA officials leveled complaints against the Obama administration during a meeting with then-CIA director Mike Pompeo.\n\n\"They met with the agency’s top five staff members. Someone from the White House asked about the major differences between the Trump administration and that of its predecessor,\" Wead wrote. \"Was there something the Trump folks could be doing better? One answer given was that in the last administration, everything was being run from the White House.\n\nThe president’s staff was very operationally involved. If the CIA wanted to buy furniture in one of its foreign stations, it might require the White House to sign off on the purchase.\"\n\nAccording to Wead's source, Trump decentralized control and gave more freedom to agencies.\n\n\"The new Trump theory was to let them make choices. If they’re not making those decisions themselves, then we can always pull it back up. So that was the first thing,\" Wead's White House source said, according to the excerpt.\n\nThe book also referred to \"political correctness\" meetings, but the author has since walked back the characterization.\n\n“Next thing they said was that, in the previous administration, they spent a lot of time in the White House doing nonstop PC [political correctness] meetings. They would have a meeting every week, and at the conclusion of the meeting there was always the suggestion, ‘Let’s meet again in two weeks.’ Nothing was ever resolved. Nothing was ever good enough,\" the book said, quoting the White House source.\n\nTwo Obama administration officials, though, pushed back at the description, telling Fox News they had never heard of such “political correctness” meetings and saying the complaint was likely a reference to Principals Committee meetings. Those National Security Council meetings include key members of the Cabinet.\n\nWead later confirmed that the source was indeed referring to the \"Principals Committee.\"",
			"time": 1573154845837,
			"files": "[]"
		},
		{
			"id": "702c91b7-a80c-494a-9263-0fc65d94a422",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Imagine how strong Zeronet could be under Musk's protection",
			"body": "https://www.teslarati.com/spacex-starlink-satellite-internet-us-air-force-testing/\n\nIf he could prevent all government assholes from installing spy shit on his network.",
			"time": 1573155691637,
			"files": "[{\"name\":\"SpaceX's Starlink satellite internet was tested by the US Air Force and the results are in 2019-11-07.png\",\"thumb\":\"b269504757f576a16b7037b2af43c09260cacf40-thumb.png\",\"size\":8847097,\"type\":\"image/png\",\"original\":\"b269504757f576a16b7037b2af43c09260cacf40.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "7e8c46e7-950f-46d6-bb80-61c3f9f7848c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>5eee2b9d-06ff-4619-b810-f9bb87784b15\nWow. Tracked that package down and tested it. You can install all with apt-get.\n\nAppears to be an extension of exiftool, but the Gui is much easier to use.",
			"time": 1573164392334,
			"files": "[]"
		},
		{
			"id": "85ff1ed5-bb65-4982-b0ca-69ed8793c099",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>5c4dfe4b-25a0-4d8c-864f-c50cd8934ea9\n\nThere is a small sliver of the medical profession which now believes that just about every human malady can only be explained by \"an infection we cannot yet identify\". They claim even heart attacks are really just infections triggering other failures.\n\nThis idea gets ridicule. When the first researcher announced that stomach ulcers were really an infection - they almost drove that researcher from his profession. Yet now, killing that infection IS the standard treatment.\n\nMeanwhile, the US spends millions of dollars every year to stop the spread of HIV in Africa. Unfortunately, that bug has now apparently mutated...so those treatments may become inffective as early as next year. Victim to a culture where 200 + sexual partners is not unusual.\n\nhttps://en.wikipedia.org/wiki/HIV/AIDS_in_Africa\n\nSo this fellow who dislikes /pol is just talkin' his book. He's selling a \"liberation\" religion which demonstrably does not work.\n\nBugs don't care about your fweelings or shame. They could care less about your liberation - except that it brings them more hosts. \n\nRiddle me this - how many imagined that the human papilloma virus was responsible for a virulent cancer 40 yrs ago? Yet it's now so devastating doctors routinely recommend vaccination KNOWING that other research demonstrates that vaccine might make women infertile?\n\nHow many hundreds/thousands of infections does our medical science NOT know about?\n\nOur ancestors were no dummies. Widespread promiscuity was tried millenia ago. It left behind death and parentless kids.\n\nBugs don't care about your liberation. Bugs are the ultimate killer...At the end - all of us succumb to bugs. Everyone plays those odds.\n\n\"Progress\" sometimes is just an evil conceit. \n\nWidespread antibiotic resistance, changes in social norms and hygiene (lack of) may be setting us up for a perfect storm.\n\nEngland, heart of \"woke\" culture, was the petri dish for a new strain of gonorrhea. Only a single antibiotic remains...and it's fading fast. You get that bug - it will no longer wash off. There is nothing they can do for you.\n\nhttps://www.cdc.gov/std/gonorrhea/arg/default.htm\n\nOther bugs will follow. Even the cautious will be lucky if they get out alive and achieve a normal life span....\n\nSome will claim this was just an \"act of god\". Others will mutter it was only an act of stupid :(\n\nOur ancestors were no dummies.",
			"time": 1573167212344,
			"files": "[]"
		},
		{
			"id": "8750f855-1463-4791-aadf-a96616c5a040",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "The Criminal Indictment against Fredrick Brennan ",
			"body": "https://www.neonrevolt.com/2019/11/06/breaking-exclusive-the-criminal-indictment-against-fredrick-brennan-hw_beat_that-qanon-8kun-greatawakening-neonrevolt/\n\nI'm no lawyer and would have a hard time with the free speech/libel line....And have no idea which party could/should win this argument.\n\nMay not matter - since the Philippians seems like such a lawless place.....\n\n\nBreaking Exclusive: The Criminal Indictment against Fredrick Brennan (@HW_BEAT_THAT). #QAnon #8kun #GreatAwakening #NEONREVOLT\nNovember 6, 2019 by Neon Revolt\n\nWell folks, it seems like the Watkins have finally hit back at Fredrick Brennan, after Brennan’s relentless efforts to repeatedly deplatform their new websites across multiple vendors have come to a head.\n\nFor earlier today, the Watkins served Brennan with a subpoena earlier, and Brennan almost immediately took to Twitter to talk about it:",
			"time": 1573168422937,
			"files": "[{\"name\":\"Breaking Exclusive- The Criminal Indictment against Fredrick Brennan (@HW_BEAT_THAT). #QAnon #8kun #GreatAwakening #NEONREVOLT – Neon Revolt 2019-11-07.png\",\"thumb\":\"1459ecadda16546c3d6e36d318bbe899fa57021b-thumb.png\",\"size\":4146528,\"type\":\"image/png\",\"original\":\"1459ecadda16546c3d6e36d318bbe899fa57021b.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "647ce12e-a477-43ea-af88-2b2123893d51",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "606fcc2b-6c42-4213-99e0-fcb7dde7ff11",
			"body": ">>606fcc2b-6c42-4213-99e0-fcb7dde7ff11\nI've been scanning hotwheel's twitter account for insights after he was sued:\n\nhttps://twitter.com/HW_BEAT_THAT\n\nIt reads like a facebook squabble between two teenaged girls :(\n\nBut strip away the bullshit - all of this stuff goes back to where it usually does. \"Ends with a whimper\". \n\nSure there are parties here who are actively fighting 8chan (the conspiracy)...but most of the players of consequence are just fraidy cats seeking to avoid high maintenance customers and public scorn. They want no part of that free speech lightning (the whimper).\n\nThese parties just wish to collect tolls/rents without doing much for them. Ideology is not part of their vocabulary.\n\nSo it's probably safe to say. ANY free speech advocate/user is/will eventually gravitate into decentralized systems like onions, Zeronet or Loki. It's just a matter of time.\n\nYou are already here. \"Everyone\" is still chasing the past.....\n\nWatkins does has something running on Russian hardware. So how long will it be before that option is removed? Maybe - just a matter of time?\n\nIf users don't come here, their speech will be silenced. And perhaps that's all right. For them AND 8chan's foes. \n\nOnly militant people count. Has always been that way.",
			"time": 1573174581216,
			"files": "[]"
		},
		{
			"id": "27327efa-a0b9-4532-8545-1a70ea9212b0",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "3dd950ff-f640-4e91-bc7b-ef754a8d0764",
			"body": ">>3dd950ff-f640-4e91-bc7b-ef754a8d0764\n\nAre you in contact with Zeronet's founder in any way. Perhaps advising him of various problems with your deployment?\n\nIf so, might he be interested in a broader feedback from his user base?\n\nI've seen Zeronet sniglets myself, and would like to help anyway I can. Just don't see my current workarounds as adequate. If you or Mr.  Kocsis can suggest better strategies - it would be good information for many of us to have.\n\nI'm particularly concerned about the need to restart Zeronet periodically to restore the tracker count. Can't imagine what is causing this.\n\nWould also like to know the source of swap file growth. With lots of memory this should not be happening?",
			"time": 1573175150256,
			"files": "[]",
			"last_edited": 1573175185556,
			"subject": null,
			"capcode": null
		},
		{
			"id": "98b0bc9d-2fbf-4bbd-a2ae-0c1084425bb2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Australia's 'man drought' is real — especially if you're a Christian woman looking for love",
			"body": "https://www.abc.net.au/news/2019-11-08/australia-talks-man-drought-real-especially-for-christian-women/11682002\n\nCaution. Once they pass 32yrs - all will have trouble conceiving.",
			"time": 1573261717479,
			"files": "[{\"name\":\"Australia's 'man drought' is real — especially if you're a Christian woman looking for love - ABC News (Australian Broadcasting Corporation) 2019-11-08.png\",\"thumb\":\"cb2abf8d7a876c2f8e6c4adac390eecb77705ab7-thumb.png\",\"size\":9469154,\"type\":\"image/png\",\"original\":\"cb2abf8d7a876c2f8e6c4adac390eecb77705ab7.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "1b515f7d-db9c-4fe4-98a8-0c1ec46f4650",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>97866dcc-4dea-414d-b402-7d00f887f4c3\nYou whine like a little bitch.",
			"time": 1573262982192,
			"files": "[{\"name\":\"middlefinger.jpg\",\"thumb\":\"1d20718df0b320ea79e9fe1c9ba619809989c3ba-thumb.jpg\",\"size\":100083,\"type\":\"image/jpeg\",\"original\":\"1d20718df0b320ea79e9fe1c9ba619809989c3ba.jpg\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "8f15079d-0c05-4fe5-8665-22641ba55790",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "PBS Frontline Nov 5, 2019 In the Age of AI",
			"body": "https://www.pbs.org/wgbh/frontline/film/in-the-age-of-ai/\n\nWorth a watch. A problem which remains to be solved.",
			"time": 1573264950195,
			"files": "[{\"name\":\"The American Dream Is Killing Us.pdf\",\"size\":772039,\"type\":\"application/pdf\",\"original\":\"ec85538f2e3b9acf0961fa61c415e4b8a4e55a00.pdf\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "d180189f-7e46-4d22-9f04-3690add2a5ad",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "New Report Documents Unchecked FBI Surveillance of U.S. Progressive Groups",
			"body": "https://btlonline.org/new-report-documents-unchecked-fbi-surveillance-of-u-s-progressive-groups-2/\n\nIdiots haven't yet figured out that when you allow a corrupt government agency to exist - you put yourself also in peril. I call it Karma.",
			"time": 1573265239094,
			"files": "[]"
		},
		{
			"id": "ff7142ad-d3af-4204-ba17-38e0986adbbc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Youtube's ball and bat...not surprised they went for the money.",
			"body": "https://twitter.com/RageGoldenEagle/status/1192514804130271232\n\nhttps://www.youtube.com/watch?v=KVuGwOz-lAs\n\nThis whole internet \"faux pay\" - around for decades is beginning to crumble. Any advertiser dumping money on these people was always a fool....\n\nHoping now that something will come along which scares the bejesus out of Google and forces them to earn their living. Like an attack from the mighty mite decentralized search :) I'd pay for that to be rid of Google.",
			"time": 1573269473089,
			"files": "[]"
		},
		{
			"id": "0de5bd77-01f7-4f69-81a9-2424e98fa1e0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Why? Nearly 100 LGBTQ candidates claim victory in Tuesday's elections",
			"body": "https://www.nbcnews.com/feature/nbc-out/rainbow-wave-2-0-nearly-100-lgbtq-candidates-claim-victory-n1077886\n\nIt's like an invasion of super rats into the political mainstream. These people crowd out any attention to families and children - replacing it with a freak rights agenda,",
			"time": 1573270968831,
			"files": "[]"
		},
		{
			"id": "dabb31a7-36d5-4382-bdc3-c87b2c47cf0c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Losing Anon can ruin your life.",
			"body": "Something which should be taught to every young person at an early age.\n\nThat school \"permanent record\"? It's real now.\n\nEdit: Journos already on them.\n\nEXCLUSIVE: A U.S. Marine Used the Neo-Nazi Site Iron March to Recruit for a ‘Race War’\n\nhttps://www.vice.com/en_us/article/d3aq8a/exclusive-a-us-marine-used-the-neo-nazi-site-iron-march-to-recruit-for-a-race-war",
			"time": 1573273284831,
			"files": "[{\"name\":\"Mysterious hacker dumps database of infamous IronMarch neo-nazi forum.pdf\",\"size\":195820,\"type\":\"application/pdf\",\"original\":\"74819b74822ff033562fa019bc2a11a15503b1b1.pdf\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]",
			"last_edited": 1573276230065,
			"capcode": null
		},
		{
			"id": "2cf6eb34-2081-4a07-b09b-3bf27a51470a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Funny. Gues some people will need to bleach their eyes",
			"body": "Turtles With Swastikas on Their Shells Are Crawling Around a Park in Washington(of course they can't capture them)\n\nhttps://www.vice.com/en_us/article/qvg94d/turtles-with-swastikas-on-their-shells-are-crawling-around-a-park-in-washington\n\nhttps://tinyurl.com/yxq3yz5x",
			"time": 1573276817445,
			"files": "[]"
		},
		{
			"id": "bf5d9798-4395-44d9-af9a-d0b3efefacce",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>056d4cce-a364-4bc1-85a4-132e2edccdf7\n\nThanks for this update. Has the source of these attacks been identified? Even if distributed denial - someone owns the botnet. Who could be paying for this?",
			"time": 1573312982252,
			"files": "[]"
		},
		{
			"id": "0f03f94e-9083-4681-b798-456c1f5efc2f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Spacex launch of 60 Starlink satellites Nov 11",
			"body": "https://twitter.com/SpaceX/status/1193687615528042496?s=09\n\nNov. 11Falcon 9 • Starlink 1\nLaunch window: 1451-1502 GMT (9:51-10:02 a.m. EST)\nLaunch site: SLC-40, Cape Canaveral Air Force Station, Florida\nA SpaceX Falcon 9 rocket is expected to launch the second batch of approximately 60 satellites for SpaceX’s Starlink broadband network, a mission designated Starlink 1. Delayed from Oct. 17. [Nov. 5]https://www.spacex.com/webcast",
			"time": 1573447867768,
			"files": "[]",
			"last_edited": 1573478394786,
			"capcode": null
		},
		{
			"id": "a1829b0f-fb0d-46fd-a5b1-681ade071372",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": ":) They go to attack you.’ ",
			"body": "Aggressive group of turkeys reportedly terrorizing N.J. community\nUpdated Nov 08, 2019;Posted Nov 08, 2019\nBy Jessica Mazzola | NJ Advance Media for NJ.com\n\nThey are finally trying to get back at us for Thanksgiving.\n\nWild turkeys have reportedly been terrorizing a 55-and-older housing community in Ocean County.\n\nAccording to a News 12 report, residents of Toms River say the group of 40-60 turkeys is aggressive. They have broken windows and try to bite people, the report says.\n\n    #njmornings It’s no joke! Wild Turkeys 🦃 taking over sections of Holiday City in #TomsRiver, Ocean County. My live reports this morning @News12NJ @RudyBode pic.twitter.com/eY2Z8Dwtcy\n    — Tony Caputo (@TonyCaputo) November 8, 2019\n\nWild turkeys, which were once extinct in New Jersey, have made a resurgence all across the state since 22 of the birds were transplanted here in 1977. Now, populations of the animal can be found across the state.\n\nThe New Jersey Division of Fish and Wildlife estimates there are between 20,000 and 23,000 wild turkeys living in the state. About 3,000 are hunted annually, the division says.\n\nhttps://www.nj.com/ocean/2019/11/aggressive-group-of-turkeys-reportedly-terrorizing-nj-community.html",
			"time": 1573477494881,
			"files": "[]"
		},
		{
			"id": "5e1d1330-9c8a-4ee3-b497-dc313e6c498c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "How an Occupy ICE Activist and DACA Recipient Was Deported for Tweeting",
			"body": "https://theintercept.com/2019/11/02/deportation-occupy-ice-daca/\n\nThese Dacas must be the first to go.",
			"time": 1573482958938,
			"files": "[{\"name\":\"Travis Mannon – The Intercept 2019-11-11.png\",\"thumb\":\"e289565a32c84ecb821a07551f24a2dfbcb93a56-thumb.png\",\"size\":181826,\"type\":\"image/png\",\"original\":\"e289565a32c84ecb821a07551f24a2dfbcb93a56.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"Verónica G. Cárdenas – The Intercept 2019-11-11.png\",\"thumb\":\"004f35161d573b803a7cd5775c606b0e6e358088-thumb.png\",\"size\":107563,\"type\":\"image/png\",\"original\":\"004f35161d573b803a7cd5775c606b0e6e358088.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "5d81b035-25d7-415f-b4df-d27d1765eccb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Death Throes of a Party James Howard Kunstler",
			"body": "Is it possible that Rep. Adam Schiff was hung out to dry by the devious Ms. Pelosi, feeding his vanity to be a one-man impeachment wrecking crew, knowing that the congressman from Hollywood would utterly blow it? Hmmmmm. Begins to look that way as Mr. Schiff’s House Intel Committee goes public this Wednesday with its soviet-style format on full display.\n\nWell, first, why? Why allow this nitwit to stage an ersatz impeachment only to see it fail? Perhaps to cancel the Jacobin menace metastasizing in the Democratic Party and get on with the business of winning the 2020 elections — with old-school candidates hand-picked to end-run the gang of fantasists currently on display. The House Speaker must sniff the odor of failure in the wind. Joe Biden, smiling cretinously, blunders through the primary venues with a big red “L” plastered on his forehead, often uncertain of what state he’s landed in, or what direction to face the camera. Everybody over twelve in this land knows that his kid Hunter was on the grift in Ukraine, plain and simple, and that Joe assisted in the operation. Color him toast.\n\nElizabeth Warren has been caught lying very publicly twice now, first as a phony Cherokee Indian (for career advancement in academia), and lately claiming falsely that she was canned from a teaching job years ago for being pregnant (with a 2007 tape of her out telling a contradictory story). Of course, that’s just the cherry-on-top of her dazzlingly unsound policy proposals to bankrupt the nation. Doesn’t look like she can reel it all back in and pretend to be a credible person in time for a full-on campaign.\n\nBernie Sanders has not completely lost his appeal for the collectivist demographic. The heart attack barely broke his stride. His line of bullshit remains consistent: 20th century nanny-state “solutions” for the problem of a sunsetting industrial economy. The perception out there remains that the unearned riches of the rentier class can be rationally harvested to support the floundering multitudes. There is scant recognition that a Bernie program would only hasten that setting sun and vaporize all those figmentatious rentier riches lodged in the janky financial markets, leaving everybody equally high, dry, and bankrupt. Note: Bernie raised his hand along with everybody else on the debate platform to give free medical care to border jumpers, and it’s all on tape, too, like the Liz Warren vapor trail. Guess how that will play in the reddish states. Finally, how many of us really want a president that looks and acts like your ninth-grade math teacher?\n\nThe rest of the field comprises just so many horses that ain’t gonna finish, not even the saintly Mayor Pete of South bend, IN. The other mayor, Michael Bloomberg stepped up to the plate last week and has already racked up an 0-and-2 count. (Only in France do mayors get to be president.) So, guess who that leaves? Self-style gutsy woman Hillary Rodham Clinton, ready and willing to saddle up and reclaim her lost entitlement to rule the land. What has she been actually doing up in her Chappaqua fortress-of-solitude lo these 36 months of defeat and exile besides pretending to write that gutsy woman book? Exactly how much influence does she still exert in the party, and throughout the multitudinous worm-holes of the Deep State? How much more — more than the three-year RussiaGate hoax — is she behind in the effort to drive the US population toward psychosis and submission?\n\nMy own sense of things is that she still influences quite a bit — though that might come to a screeching halt when indictments rain down against a large cast of characters associated with the previous governing regime, herself included. After all, she did pay for foreign interference in the 2016 election. For starters think: Christopher Steele, British national, former MI6 employee, before you even start sorting through the sundry Ukrainians recently revealed as “meddlers” via the awkward “whistleblower” affair.\n\nWhich brings us back to Rep. Adam Schiff and his monkeyshines in the star chamber of his personal devising. Now that the show goes public, will he haul many of the same characters back into the witness chair to spin out his engineered narrative, without any cross examination allowed, or other felicities of due process? Someone ought to advise him that playing the Robespierre role tends toward an unhappy ending for the player. Especially when Mr. Jordan of Ohio, newly-seated on the Intel Committee, starts barking out points-of-order. I’m even half-wondering if Mr. Durham, the federal attorney, has not already measured up bills of indictment for Mr. Schiff himself, for the phony CIA agent “whistleblower” Eric Ciaramella, the pre-wired IC Inspector General Michael Atkinson, US chargé d’affaires for Ukraine Bill Taylor, and the spectacularly seditious Colonel Vindman, whose antics stand out in this latest coup attempt against the elected president. What kind of bag does that leave Ms. Pelosi holding?",
			"time": 1573487960787,
			"files": "[]"
		},
		{
			"id": "6c6dfb33-cb86-4caa-9acb-ad0f7b62c7fc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Ice Age Scare 1979 Leonard Nimoy  :)",
			"body": "No hidden meanings. Just fun.\n\nhttps://www.youtube.com/watch?v=mOC7ePWCHGk\n\nTheir forecasters were as good as ours. Listen carefully for the howls this week.....",
			"time": 1573507908300,
			"files": "[]"
		},
		{
			"id": "ca38466a-5db6-422c-952e-e311039aa7d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Paris police demolish massive migrant camps as officials vow to stop them from reappearing",
			"time": 1573510980194,
			"files": "[{\"name\":\"Paris police demolish massive migrant camps as officials vow to stop them from reappearing  Fox News 2019-11-11.png\",\"thumb\":\"dbd86979b8b6e4c1ef32203b4c1f43c1576be79a-thumb.png\",\"size\":4489243,\"type\":\"image/png\",\"original\":\"dbd86979b8b6e4c1ef32203b4c1f43c1576be79a.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "bf46011b-8ffe-4896-b6d3-175b9d818a7b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"subject": "I've spent the last two days tearing ZeroNet builds up, then throwing back online.",
			"body": "Really the only way to learn anything....the REAL envelope of the product.\n\nMy three takeaways?\n\n1. This is really a well engineered portable app. You can do all sorts of Frankenstein things with it - and it will still continue working.\n\n2. It's too easy to lock up your machine with heavy CPU loads with Zeronet. Zeronet tries too hard, and that's why users hate it. Needs to be re-engineered to resist seeding unless the user explicitly tells it to. And there should be a seeding suppression switch. Those of us who can, should make real efforts to seed EVERYTHING. Ten good seeders would be an excellent start. Seeder CPUs should be used for nothing else.  Their CPU load will make such machines unusable for additional duties. New users should always be warned to avoid seeding and to maximize their tracker count with add on tracker lists.\n\n3. ZeroID needs to go. It's poorly maintained. Has cryptic  error messages. And is a reason BY ITSELF to avoid 08chan. Not sayin this is the wrong method, just that the execution is poor.\n\nA footnote: Those of us still here remain only for the potential - as the current \"offering\" is really a turd compared to all other options. The public has spoken concerning 08chan. Now, will anyone listen?",
			"time": 1574457206189,
			"files": "[]"
		},
		{
			"id": "69f9fdf2-03f5-4fb3-bb86-4b1f7bb63f6d",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "d999436f-f942-4341-a1f2-87963aa1e7e3",
			"body": ">>eb9c5e31-7691-4800-b123-99fb09c9c333\n\nHaven't specifically tried the Raspberry (and that's really the only way to know), but am no stranger to low power builds and what I've seen suggests the Raspberry just won't have the required horsepower.\n\nHashing and torrenting are CPU hogs. So is the  elliptic curve encryption Tor uses.",
			"time": 1574531906044,
			"files": "[]"
		},
		{
			"id": "84229f91-b070-4520-8312-604803ac5611",
			"directory": "users/1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W",
			"uri": "funny_sfw",
			"thread": "8a5585f3-4580-4088-a890-d01de6c89703",
			"body": ">>8a5585f3-4580-4088-a890-d01de6c89703\nKinda reminds you of Mom responding to a dramatic kid fight \"All of you go play in the street\"!\n\n:)\n\nWonder what Shit's mom would say about him?",
			"time": 1574532351814,
			"files": "[]"
		},
		{
			"id": "bcc3ba55-f155-4a13-8eef-149a1ff5d256",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerattack",
			"subject": "Start",
			"body": "Start",
			"time": 1591320325123,
			"files": "[]"
		},
		{
			"id": "dd077ff5-a9c2-4f25-89d9-c5cd566bb204",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggercruelty",
			"subject": "Start",
			"body": "Start",
			"time": 1591320417623,
			"files": "[]"
		},
		{
			"id": "0c1549a5-109c-4966-b2ab-bba3054c0dc8",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerenvy",
			"subject": "Start",
			"body": "Start",
			"time": 1591320435723,
			"files": "[]"
		},
		{
			"id": "dd4d1e6d-379e-430a-87f3-6b70e8fa18a0",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerfag",
			"subject": "Start",
			"body": "Start",
			"time": 1591320462423,
			"files": "[]"
		},
		{
			"id": "92138d8a-9a89-40b8-8861-c4fdabac59e5",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggergluttony",
			"subject": "Start",
			"body": "Start",
			"time": 1591320486223,
			"files": "[]"
		},
		{
			"id": "8c96b524-c850-4401-b922-0526e549b52a",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggergreed",
			"subject": "Start",
			"body": "Start",
			"time": 1591320509223,
			"files": "[]"
		},
		{
			"id": "32e06eeb-ff24-4599-8488-57c4bf598955",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "Start",
			"body": "Start",
			"time": 1591320534423,
			"files": "[]"
		},
		{
			"id": "6b2c0961-6b63-4b7a-adaf-0fe9f7587760",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerlie",
			"subject": "Start",
			"body": "Start",
			"time": 1591320564223,
			"files": "[]"
		},
		{
			"id": "a017d68d-100a-44d3-8a79-e21ec4ddb938",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerlust",
			"subject": "Start",
			"body": "Start",
			"time": 1591320587423,
			"files": "[]"
		},
		{
			"id": "0b2e69e2-2980-4222-8f46-55af24c38ce7",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggermurder",
			"subject": "Start",
			"body": "Start",
			"time": 1591320609623,
			"files": "[]"
		},
		{
			"id": "261cdbf9-b73d-45ce-b359-d05fed19bf59",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerpride",
			"subject": "Start",
			"body": "Start",
			"time": 1591320638123,
			"files": "[]"
		},
		{
			"id": "6eeac854-f357-4087-a015-eb6ce9a791c8",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerracism",
			"subject": "Start",
			"body": "Start",
			"time": 1591320665023,
			"files": "[]"
		},
		{
			"id": "aab79414-d339-4306-833f-f2e86e3151f9",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersloth",
			"subject": "Start",
			"body": "Start",
			"time": 1591320691523,
			"files": "[]"
		},
		{
			"id": "d5cdddaf-18d4-429a-bba4-1386fee45d60",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"subject": "Start",
			"body": "Start",
			"time": 1591320716323,
			"files": "[]"
		},
		{
			"id": "c4d45db3-1b61-4d51-947a-2339c4d6a905",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerstupid",
			"subject": "Start",
			"body": "Start",
			"time": 1591320737123,
			"files": "[]"
		},
		{
			"id": "5583de6b-8c2c-4597-a2d5-4a0a17f3b937",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Whitetrash",
			"subject": "Start",
			"body": "Start",
			"time": 1591320760523,
			"files": "[]"
		},
		{
			"id": "89628537-3648-4f96-9192-dabda080ab00",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Whitetrash",
			"subject": "Her mom is proud",
			"time": 1591321465562,
			"files": "[{\"name\":\"975310168e9b421a945c141809b6c189(1).mp4\",\"thumb\":\"9cea98a72a752b3055f68a62a088b1ab7f7ee44c-thumb.jpg\",\"size\":1509785,\"type\":\"video/mp4\",\"original\":\"9cea98a72a752b3055f68a62a088b1ab7f7ee44c.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "0e48659a-c454-4b0d-aa26-f0db73a81448",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerattack",
			"time": 1591321648462,
			"files": "[{\"name\":\"1590628927613.webm\",\"thumb\":\"7dc0716a88b889c6a669962b203d089dd63131d6-thumb.jpg\",\"size\":3104555,\"type\":\"video/webm\",\"original\":\"7dc0716a88b889c6a669962b203d089dd63131d6.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1590928387835.webm\",\"thumb\":\"fc584cad805e3b21001ec0fdef8c8e2f2386fa5d-thumb.jpg\",\"size\":2050704,\"type\":\"video/webm\",\"original\":\"fc584cad805e3b21001ec0fdef8c8e2f2386fa5d.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1590928637555.webm\",\"thumb\":\"d14757d65da46225efbbf477a4548446489019d5-thumb.jpg\",\"size\":3086114,\"type\":\"video/webm\",\"original\":\"d14757d65da46225efbbf477a4548446489019d5.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"0_e124rgf7_0_13qn9hd9.mp4\",\"thumb\":\"e78bf01fd609e22b727e9b9773b422d12b419ba6-thumb.jpg\",\"size\":14450208,\"type\":\"video/mp4\",\"original\":\"e78bf01fd609e22b727e9b9773b422d12b419ba6.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"432vgw.mp4\",\"thumb\":\"48eeda4eb3f75f5e55394fa2550706fb09af4e6c-thumb.jpg\",\"size\":437256,\"type\":\"video/mp4\",\"original\":\"48eeda4eb3f75f5e55394fa2550706fb09af4e6c.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1024x576_MP4_2176416882977518908.mp4\",\"thumb\":\"c31628a36277279bd74444917f41ac54e5f843ba-thumb.jpg\",\"size\":3621417,\"type\":\"video/mp4\",\"original\":\"c31628a36277279bd74444917f41ac54e5f843ba.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1024x576_MP4_2401718058172526984.mp4\",\"thumb\":\"a7039752b8d274909ed225ae569cfa4510a35980-thumb.jpg\",\"size\":19071758,\"type\":\"video/mp4\",\"original\":\"a7039752b8d274909ed225ae569cfa4510a35980.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1024x576_MP4_2743989450009526012.mp4\",\"thumb\":\"8a889e9f9db34d318ca897a0b1c1a46285407bc8-thumb.jpg\",\"size\":2235247,\"type\":\"video/mp4\",\"original\":\"8a889e9f9db34d318ca897a0b1c1a46285407bc8.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "f6b81e30-1905-4f5d-8612-70569f359326",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "Yeah,yeah",
			"time": 1591321748378,
			"files": "[{\"name\":\"0c419d87c49148fda91180ddb0657935(1).mp4\",\"thumb\":\"c2ec92f1ae95bc9a84e682651f61cb71618f3b1a-thumb.jpg\",\"size\":3098247,\"type\":\"video/mp4\",\"original\":\"c2ec92f1ae95bc9a84e682651f61cb71618f3b1a.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "2f2477bc-4ad9-46e7-b92e-6c75c2f5226f",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerlie",
			"subject": "Enablers lie, lie, lie",
			"time": 1591322084778,
			"files": "[{\"name\":\"4f91c78008c344e09632996f465ed8e9(1).mp4\",\"thumb\":\"b4f37d8ece73b427c456fb6a918a03562a45a3c7-thumb.jpg\",\"size\":8971988,\"type\":\"video/mp4\",\"original\":\"b4f37d8ece73b427c456fb6a918a03562a45a3c7.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "7d0d4978-5224-42e7-a7a4-a80eda07cd86",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "Poor Floyd",
			"time": 1591322155478,
			"files": "[{\"name\":\"a1afc470e3184abe8cae3d7146b93e8c(1).mp4\",\"thumb\":\"0f07c3e1da22f56a5d24dd213c46bc6074a789b4-thumb.jpg\",\"size\":2896617,\"type\":\"video/mp4\",\"original\":\"0f07c3e1da22f56a5d24dd213c46bc6074a789b4.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "41aaa640-ce80-443e-b620-f437edb4c9e4",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerstupid",
			"time": 1591322255278,
			"files": "[{\"name\":\"aed7a873f85d4d748ed839e035b3d4cf(1).mp4\",\"thumb\":\"b83a69991bcd348d184ae6ee5911149192335f35-thumb.jpg\",\"size\":3847223,\"type\":\"video/mp4\",\"original\":\"b83a69991bcd348d184ae6ee5911149192335f35.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"d90e7debac354433bb7371995bd4d0fc(1).mp4\",\"thumb\":\"ba6d3b31717fc90ab3cc88c972db0333d7c1b0ba-thumb.jpg\",\"size\":1758773,\"type\":\"video/mp4\",\"original\":\"ba6d3b31717fc90ab3cc88c972db0333d7c1b0ba.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "168fe0c9-0491-43d1-ae2b-cf2bacfc0f58",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"time": 1591322343878,
			"files": "[{\"name\":\"6d07ff8f502b41569028a3ca925d1644(1).mp4\",\"thumb\":\"5cc4072049c8dd684c1d7188cf1f0491cbd7d23e-thumb.jpg\",\"size\":9827364,\"type\":\"video/mp4\",\"original\":\"5cc4072049c8dd684c1d7188cf1f0491cbd7d23e.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"25ab1d49042845b286a3d5fd9ef8f320(1).mp4\",\"thumb\":\"ce90d6dd0d795dbb6083e00b6a4c1725c2319940-thumb.jpg\",\"size\":4196488,\"type\":\"video/mp4\",\"original\":\"ce90d6dd0d795dbb6083e00b6a4c1725c2319940.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1024x576_MP4_8762365960088670099.mp4\",\"thumb\":\"1db213d4e6f62c90830db9d114e065290bedf3a0-thumb.jpg\",\"size\":180374139,\"type\":\"video/mp4\",\"original\":\"1db213d4e6f62c90830db9d114e065290bedf3a0.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "3db46964-c158-416a-abd0-7a436a0a8e87",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"subject": "Too bad they failed to enter",
			"time": 1591322515178,
			"files": "[{\"name\":\"e728f8e9961f464c8214bd8efdb288e7(1).mp4\",\"thumb\":\"283ca8dcd63a36da0907f924e60a17a3d1065413-thumb.jpg\",\"size\":11727957,\"type\":\"video/mp4\",\"original\":\"283ca8dcd63a36da0907f924e60a17a3d1065413.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "8d1ad832-7137-4180-acf4-ff8b1c17aa4b",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "This bitch is a compulsive liar",
			"time": 1591323410978,
			"files": "[{\"name\":\"Waters Classifies 'Rioting' as 'Negative Language ... Against Black People' 2020-06-04.png\",\"thumb\":\"00a68b17574ddaaadec62d35aaf7eee7ebe02110-thumb.png\",\"size\":8159379,\"type\":\"image/png\",\"original\":\"00a68b17574ddaaadec62d35aaf7eee7ebe02110.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "d3fec995-d798-4293-9538-1946919f00ca",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "Niggers are cannibal rats",
			"body": "Looting is innate",
			"time": 1591323442989,
			"files": "[{\"name\":\"George Floyd protests- Looting isn’t the story. The widespread social unrest is. - Vox 2020-06-04.png\",\"thumb\":\"50dc523c38aa3915ecd3efa8a0d3fad0cdf5ba3f-thumb.png\",\"size\":6820679,\"type\":\"image/png\",\"original\":\"50dc523c38aa3915ecd3efa8a0d3fad0cdf5ba3f.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "3611bb1b-e515-46d7-a85e-1d8dc292aea4",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerattack",
			"thread": "0e48659a-c454-4b0d-aa26-f0db73a81448",
			"body": ">>0e48659a-c454-4b0d-aa26-f0db73a81448",
			"time": 1591323607752,
			"files": "[{\"name\":\"1e99a02e1c736d32447f8b666e5891ce24ceb6b37324c5ee3a19510d2741621a.mp4\",\"thumb\":\"b4525f00e0a385d10988cf230cb116453ea8ca24-thumb.jpg\",\"size\":915729,\"type\":\"video/mp4\",\"original\":\"b4525f00e0a385d10988cf230cb116453ea8ca24.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1590646485866.webm\",\"thumb\":\"67453bcd067a9883cbdce8d6470d6210ead23812-thumb.jpg\",\"size\":1731415,\"type\":\"video/webm\",\"original\":\"67453bcd067a9883cbdce8d6470d6210ead23812.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"1590929431145.webm\",\"thumb\":\"7a09cd3a38eba5414fdf0579a51ca17370af17af-thumb.jpg\",\"size\":3086270,\"type\":\"video/webm\",\"original\":\"7a09cd3a38eba5414fdf0579a51ca17370af17af.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"Brandon Darby - Warning graphic video - Protesters_rioters in Dallas beat store owner to possible death after he tried to defend his business-1266931208275013633.mp4\",\"thumb\":\"4bee78d9f0d1b3c96dd42e29e24ce9fdf56afacb-thumb.jpg\",\"size\":6575967,\"type\":\"video/mp4\",\"original\":\"4bee78d9f0d1b3c96dd42e29e24ce9fdf56afacb.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"lnBcF11.mp4\",\"thumb\":\"4757af1b94ff5d24ae2577f40054c94a00fa1c2d-thumb.jpg\",\"size\":4006683,\"type\":\"video/mp4\",\"original\":\"4757af1b94ff5d24ae2577f40054c94a00fa1c2d.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"nxu9ev.mp4\",\"thumb\":\"688aa1265dd8f5729c806f9c7278838454e8e73b-thumb.jpg\",\"size\":3034074,\"type\":\"video/mp4\",\"original\":\"688aa1265dd8f5729c806f9c7278838454e8e73b.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"oHXoqRk.mp4\",\"thumb\":\"bf8ed772a31bda7514c3d16d99edd856a6c6031d-thumb.jpg\",\"size\":12325418,\"type\":\"video/mp4\",\"original\":\"bf8ed772a31bda7514c3d16d99edd856a6c6031d.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"ONydefA.mp4\",\"thumb\":\"e0676999e63d6d7b95908d1b1fc4d6f622ec848c-thumb.jpg\",\"size\":6783190,\"type\":\"video/mp4\",\"original\":\"e0676999e63d6d7b95908d1b1fc4d6f622ec848c.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"RDmuuWG.mp4\",\"thumb\":\"22fa7b9a2d38d6bc0a47cfce6f577be07a349d99-thumb.jpg\",\"size\":10865647,\"type\":\"video/mp4\",\"original\":\"22fa7b9a2d38d6bc0a47cfce6f577be07a349d99.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"ugdyCwR.mp4\",\"thumb\":\"622e2ad79e12b9888154f8279926599d5af67e17-thumb.jpg\",\"size\":8124693,\"type\":\"video/mp4\",\"original\":\"622e2ad79e12b9888154f8279926599d5af67e17.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"VxXGMHZ.mp4\",\"thumb\":\"97cea2f10a4952e505486d88de49344e8e8001de-thumb.jpg\",\"size\":7052561,\"type\":\"video/mp4\",\"original\":\"97cea2f10a4952e505486d88de49344e8e8001de.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"whcmt8.mp4\",\"thumb\":\"59c1db9d756b5cbb32f7a3384ec2ddba97200bfd-thumb.jpg\",\"size\":43243313,\"type\":\"video/mp4\",\"original\":\"59c1db9d756b5cbb32f7a3384ec2ddba97200bfd.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "4ea21003-d52e-4a62-87a6-9ac2ad299347",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"thread": "168fe0c9-0491-43d1-ae2b-cf2bacfc0f58",
			"body": ">>168fe0c9-0491-43d1-ae2b-cf2bacfc0f58",
			"time": 1591323706225,
			"files": "[{\"name\":\"0qck4b.mp4\",\"thumb\":\"188693e9f5edfd6387e8cb805f7882670f287c03-thumb.jpg\",\"size\":3602366,\"type\":\"video/mp4\",\"original\":\"188693e9f5edfd6387e8cb805f7882670f287c03.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"EZh_VsaXsAYz7g7.mp4\",\"thumb\":\"e7d60128e30f5e76bfd3cb731440c3df949e8e9b-thumb.jpg\",\"size\":227807,\"type\":\"video/mp4\",\"original\":\"e7d60128e30f5e76bfd3cb731440c3df949e8e9b.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"hmekog.mp4\",\"thumb\":\"8c9785cfcfb29ca1a9ab2f2b643469f8ca121968-thumb.jpg\",\"size\":3132573,\"type\":\"video/mp4\",\"original\":\"8c9785cfcfb29ca1a9ab2f2b643469f8ca121968.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"iobrv1.mp4\",\"thumb\":\"7779dd8043f31457d749b536907141057fe9ae07-thumb.jpg\",\"size\":42388563,\"type\":\"video/mp4\",\"original\":\"7779dd8043f31457d749b536907141057fe9ae07.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"meKJPLW.mp4\",\"thumb\":\"82f942ede5663369101b44d566e161515fbcf05f-thumb.jpg\",\"size\":2885269,\"type\":\"video/mp4\",\"original\":\"82f942ede5663369101b44d566e161515fbcf05f.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"rwzafa.mp4\",\"thumb\":\"ac24b9724b8429b34c2ea72dd583945b62e1243e-thumb.jpg\",\"size\":15822978,\"type\":\"video/mp4\",\"original\":\"ac24b9724b8429b34c2ea72dd583945b62e1243e.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"tzp96s.mp4\",\"thumb\":\"704a594f03de5440b8ab7a9b582651eb29901a51-thumb.jpg\",\"size\":69725344,\"type\":\"video/mp4\",\"original\":\"704a594f03de5440b8ab7a9b582651eb29901a51.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"u9AGIaL.mp4\",\"thumb\":\"f724e75711303afea9f67bcdc53248399a04f13e-thumb.jpg\",\"size\":6941236,\"type\":\"video/mp4\",\"original\":\"f724e75711303afea9f67bcdc53248399a04f13e.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "79292585-43a8-4626-840c-f51b7c23165d",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerattack",
			"thread": "0e48659a-c454-4b0d-aa26-f0db73a81448",
			"body": ">>0e48659a-c454-4b0d-aa26-f0db73a81448",
			"time": 1591323890225,
			"files": "[{\"name\":\"9qdOWqfVLGX7ET-W.mp4\",\"thumb\":\"029090d109a2b0d8bfec81fabab8a47a8c7d4fda-thumb.jpg\",\"size\":6870258,\"type\":\"video/mp4\",\"original\":\"029090d109a2b0d8bfec81fabab8a47a8c7d4fda.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"b7fc5bd9caa84d69.mp4\",\"thumb\":\"2a55628f2c87b63f4853ba61f5c118e558183b3c-thumb.jpg\",\"size\":9308518,\"type\":\"video/mp4\",\"original\":\"2a55628f2c87b63f4853ba61f5c118e558183b3c.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"cCZ4wXyDhLgIBnDk.mp4\",\"thumb\":\"040c2966e2f7a5369a8b56b5bd13df36ff171a57-thumb.jpg\",\"size\":50898427,\"type\":\"video/mp4\",\"original\":\"040c2966e2f7a5369a8b56b5bd13df36ff171a57.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"IHrhc4W45ldwaAF1.mp4\",\"thumb\":\"0abeab6a0e63eb080465b104703483aca4a2b9af-thumb.jpg\",\"size\":1617414,\"type\":\"video/mp4\",\"original\":\"0abeab6a0e63eb080465b104703483aca4a2b9af.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"iNuknQ2jf7f4uce_.mp4\",\"thumb\":\"d406759d855900e38a7b6b59af920a128f58e805-thumb.jpg\",\"size\":15492252,\"type\":\"video/mp4\",\"original\":\"d406759d855900e38a7b6b59af920a128f58e805.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"lxK0XCWBumLFM0hP.mp4\",\"thumb\":\"debdde9d51e5a796ce1165f07901abbc6c2a70d7-thumb.jpg\",\"size\":1836581,\"type\":\"video/mp4\",\"original\":\"debdde9d51e5a796ce1165f07901abbc6c2a70d7.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"W7-bT_MJaLv9sclJ.mp4\",\"thumb\":\"b72138b5fee472343f79159d81014fc8fbabc522-thumb.jpg\",\"size\":34532901,\"type\":\"video/mp4\",\"original\":\"b72138b5fee472343f79159d81014fc8fbabc522.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "861d9bf4-7d4e-4dcd-a21c-c6f567125a0b",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"thread": "168fe0c9-0491-43d1-ae2b-cf2bacfc0f58",
			"body": ">>168fe0c9-0491-43d1-ae2b-cf2bacfc0f58",
			"time": 1591323965925,
			"files": "[{\"name\":\"30e6731924107ab1019a39ea648895fd9b37215fc83bcd489a79131722635f0f.png\",\"thumb\":\"85cfa8ba1ea5ef0bc3f06d23ca8958de85ad9509-thumb.png\",\"size\":1019908,\"type\":\"image/png\",\"original\":\"85cfa8ba1ea5ef0bc3f06d23ca8958de85ad9509.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"x7MBugw38PxpAJlx.mp4\",\"thumb\":\"7056922396efffbe80808349b2224420324b1c50-thumb.jpg\",\"size\":1815815,\"type\":\"video/mp4\",\"original\":\"7056922396efffbe80808349b2224420324b1c50.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "fde35fc7-99be-4d26-b8b4-a78ebb28d29a",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerattack",
			"thread": "0e48659a-c454-4b0d-aa26-f0db73a81448",
			"subject": "Bring a gun!",
			"body": ">>0e48659a-c454-4b0d-aa26-f0db73a81448",
			"time": 1591324019325,
			"files": "[{\"name\":\"Z0YyKMFy_0uDjq5R.mp4\",\"thumb\":\"e8f3dc40202d1319a635634d30248dafedcc0ee6-thumb.jpg\",\"size\":10978261,\"type\":\"video/mp4\",\"original\":\"e8f3dc40202d1319a635634d30248dafedcc0ee6.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "a65f9f27-cd34-4aa0-9d4b-d91f88afc55e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"subject": "08chan closing down after the riots?",
			"body": ">>9ba27438-fe1b-498e-813b-8197307cbea9\nI'm assuming you have decided to bring your free speech experiment to a close. \n\nZeroID no longer functions. So there is simply no way any new users can post here. That's fact.\n\nSince you've tied your fortunes to this single point of failure, I can only conclude this current situation is/was by design.\n\nYour ball, your bat, your prerogative.  But it would have been courteous to let everyone know.",
			"time": 1591463719047,
			"files": "[{\"name\":\"Screenshot from 2020-06-06 11-42-17.png\",\"thumb\":\"650c3007e0f32c288b20f455e81a0272c3873e0f-thumb.png\",\"size\":223888,\"type\":\"image/png\",\"original\":\"650c3007e0f32c288b20f455e81a0272c3873e0f.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "9e7c4499-a74f-460d-8b4b-8f33c9033048",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>1548a6de-fe77-4e84-8d8a-ad46f41b64b8\n>Why are you assuming this is a permanent situation?\n\nBecause it's not getting fixed.\n\nUsers don't expect perfection with experimental software, but they do expect some effort to reduce the number of spinning plates. When that effort seems absent - occam's razor - someone lost interest. And every user has a threshold....where the benefit becomes \"not worth the squeeze\". There was a newfaq on reddit this week....having problems getting his 08chan ZeroID certificate. Seemed to be well motivated - but when the bar is so remote? He's likely a walkaway.\n\nHad believed I was immune to such considerations...having survived many other gotchas. But I too am beginning to doubt.\n\nIt's gotta work. Just work - and no excuses. Otherwise many will walk. Have walked.\n\nZeroID shows my username as already assigned now - only that rewrite with the certificate never happened. That user.json file is still original.\n\nEven when it worked (months), ZeroID never was easy. And now this?\n\nMaybe it's time for people to doubt themselves a little?",
			"time": 1591493845393,
			"files": "[]"
		},
		{
			"id": "5e51ab2d-1ea1-4238-b63b-72b4ef59816b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>aa0f7ca1-d577-47bc-8853-3dc1ddda6303\n\nI know this is a difficult problem. Still must be fixed.\n\nWhat we have now just isn't adequate. And letting this problem fester helps no one.\n\nPerhaps part of the reason so many seem to \"check back\" every quarter here? Then leave? \"Arrgh, still the same.....\".",
			"time": 1591494054493,
			"files": "[]",
			"last_edited": 1591494237893,
			"subject": null,
			"capcode": null
		},
		{
			"id": "d201c282-37e2-445c-b569-49d294a4ee44",
			"directory": "users/19FZAbmJEWXKzwHgNfBbE1aDVenpjpN3og",
			"uri": "images",
			"thread": "6ad9441d-45c9-40be-8593-a4104056b435",
			"body": ">>6ad9441d-45c9-40be-8593-a4104056b435\nHubris and self selection.\n\nHopefully most BLM protesters.",
			"time": 1591651711036,
			"files": "[{\"name\":\"bi4gXPF.png\",\"thumb\":\"f16aa0e21f11f2adca37ebabf04c7f9974b133d0-thumb.png\",\"size\":2514788,\"type\":\"image/png\",\"original\":\"f16aa0e21f11f2adca37ebabf04c7f9974b133d0.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "95a7821c-7ce4-402c-ae20-13dba469d1e3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Not normally a fan of police - but they serve a function.",
			"body": "Be careful what you ask for....\n\nThen again, problems are settled more quickly when there are no rules.",
			"time": 1591652099455,
			"files": "[{\"name\":\"5F8DyJ2U.png\",\"thumb\":\"bfc1bbf86fb7478fffb6b7f710c0bbcee60b622a-thumb.png\",\"size\":132188,\"type\":\"image/png\",\"original\":\"bfc1bbf86fb7478fffb6b7f710c0bbcee60b622a.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"nnqm0mwy.png\",\"thumb\":\"c500141018010ae39d06e7f9eb7af2eb6e35299b-thumb.png\",\"size\":2719852,\"type\":\"image/png\",\"original\":\"c500141018010ae39d06e7f9eb7af2eb6e35299b.png\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "d7424d9f-f85a-4435-aa74-89baab6e0da7",
			"directory": "users/1FqGsAbu3WLN8iwZv6GWLSPFcBeQg1jQj7",
			"uri": "sudo",
			"thread": "4d2ca0b9-54db-41dd-a895-155f4832f0e3",
			"body": ">>1c62a606-77e2-4178-bc0f-65f64c2b277e\n\nDoes anyone have backchannel contact with Kocsis? Believe he runs ZeroID?\n\nMay have isolated the registration problem, then verified with a temporary Windows install (same issue).\n\nZeroID is failing to write to the users.json - even when the user is approved.\n\nIt's in this section of the users.json file:\n\n\"zeroid.bit\":\n\n\nA week ago, ZeroID was working. Now it does not. Anyone new attempting to post here will never get past ZeroID.",
			"time": 1591652927185,
			"files": "[]"
		},
		{
			"id": "a9c26aaa-3fc6-4441-b4e3-5f33c52f18ae",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggersteal",
			"thread": "b9f8a8ff-03be-4217-86c9-4470930c8494",
			"body": ">>b9f8a8ff-03be-4217-86c9-4470930c8494",
			"time": 1591653366885,
			"files": "[{\"name\":\"eb8cacf0f8b06ad1b4bf5ad93999aa6bbbaa83f8289d307e3acca67edd613671.mp4\",\"thumb\":\"77eab105cca54756a8bafaf9975f3103c1c3d036-thumb.jpg\",\"size\":2818155,\"type\":\"video/mp4\",\"original\":\"77eab105cca54756a8bafaf9975f3103c1c3d036.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"},{\"name\":\"jyxe5k.mp4\",\"thumb\":\"adbb30f5ab1af734ba3a4b6abaeaad1b805d05b6-thumb.jpg\",\"size\":8735324,\"type\":\"video/mp4\",\"original\":\"adbb30f5ab1af734ba3a4b6abaeaad1b805d05b6.mp4\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		},
		{
			"id": "a87a7f68-b7f8-4e41-9fcb-679c9a979bc5",
			"directory": "users/1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN",
			"uri": "Niggerhypocrisy",
			"subject": "Say what you mean",
			"time": 1591661254357,
			"files": "[{\"name\":\"'I'm Not For Abolishing The Entire Police Department' - Mayor Frey Addresses Crowd At Mpls. Protest.webm\",\"thumb\":\"a429b5beecc90d920172b3d0c85ec32a66f140c4-thumb.jpg\",\"size\":7616853,\"type\":\"video/webm\",\"original\":\"a429b5beecc90d920172b3d0c85ec32a66f140c4.webm\",\"directory\":\"1D4zKDtrBRovBgCQNeCXQ9MzcFdguUDfZN\"}]"
		}
	],
	"boards": [
		{
			"uri": "niggersteal",
			"title": "Delete Duplicate",
			"config": null,
			"description": "Delete Duplicate"
		},
		{
			"uri": "Niggerattack",
			"title": "Niggerattack"
		},
		{
			"uri": "Niggerracism",
			"title": "Niggerracism - trash talk whitey"
		},
		{
			"uri": "Niggerlie",
			"title": "Niggerlie"
		},
		{
			"uri": "Niggergluttony",
			"title": "Niggergluttony"
		},
		{
			"uri": "Niggermurder",
			"title": "Niggermurder"
		},
		{
			"uri": "Niggergreed",
			"title": "Niggergreed"
		},
		{
			"uri": "Niggerlust",
			"title": "Niggerlust"
		},
		{
			"uri": "Niggersloth",
			"title": "Niggersloth"
		},
		{
			"uri": "Niggerenvy",
			"title": "Niggerenvy"
		},
		{
			"uri": "Niggerpride",
			"title": "Niggerpride"
		},
		{
			"uri": "Niggercruelty",
			"title": "Niggercruelty"
		},
		{
			"uri": "Niggerhypocrisy",
			"title": "Niggerhypocrisy"
		},
		{
			"uri": "Niggerstupid",
			"title": "Niggerstupid"
		},
		{
			"uri": "Niggerfag",
			"title": "Niggerfag"
		},
		{
			"uri": "Whitetrash",
			"title": "Whitetrash"
		},
		{
			"uri": "Niggersteal",
			"title": "Niggersteal"
		}
	],
	"modlogs": []
}