{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1565907502,
			"title": "Kill",
			"body": "Kill disabled people.\nKill foreign people.\nKill poor people.\nKill foxes.\nKill democracy.\nKill socialism.\nKill communism.\nKill parasites.",
			"added": 1565907501
		},
		{
			"topic_id": 1566766301,
			"title": "You have the right to put a bullet in the head of any Aggressor",
			"body": "Defend yourself. Kill them. Do it.",
			"added": 1566766299
		},
		{
			"topic_id": 1567109265,
			"title": "Eight Defendants Charged with Running Two of the Largest Illegal Television Show and Movie Streaming Services in the United States",
			"body": "**The Two Services Allegedly Offered More Television Programs and Movies than Legitimate Streaming Services such as Netflix, Hulu, Vudu and Amazon Prime Video**\n\nA federal grand jury returned an indictment today charging eight individuals with conspiring to violate federal criminal copyright law by running two of the largest unauthorized streaming services in the United States, resulting in the loss of millions of dollars by television program and motion picture copyright owners.\n\nAssistant Attorney General Brian A. Benczkowski of the Justice Department's Criminal Division, U.S. Attorney G. Zachary Terwilliger of the Eastern District of Virginia and Assistant Director in Charge Timothy R. Slater of the FBI's Washington Field Office made the announcement today.\n\nAccording to the indictment, Kristopher Lee Dallmann, 36; Darryl Julius Polo, aka djppimp, 36; Douglas M. Courson, 59; Felipe Garcia, 37; Jared Edward Jaurequi, aka Jared Edwards, 38; Peter H. Huber, 61; Yoany Vaillant, aka Yoany Vaillant Fajardo, 38; and Luis Angel Villarino, 40, allegedly ran an entity called Jetflicks, an online subscription-based service headquartered in Las Vegas, Nevada, that permitted users to stream and, at times, download copyrighted television programs without the permission of the relevant copyright owners.\n\nThe defendants reproduced tens of thousands of copyrighted television episodes without authorization, and distributed the infringing programs to tens of thousands of paid subscribers located throughout the U.S. At one point, Jetflicks claimed to have more than 183,200 different television episodes. One of the defendants, Polo, left Jetflicks and created a competing site based in Las Vegas called iStreamItAll (ISIA) that at one point claimed to have 115,849 different television episodes and 10,511 individual movies. Like Jetflicks, ISIA offered content for a regular subscription fee to viewers around the United States, and ISIA publicly asserted that it had more content than Netflix, Hulu, Vudu and Amazon Prime. The two services were not only available to subscribers over the internet but specifically designed to work on many different types of devices, platforms and software including numerous varieties of computer operating systems, smartphones, tablets, smart televisions, video game consoles, digital media players, set-top boxes and web browsers.\n\nIn addition, the grand jury charged Dallmann with two counts of criminal copyright infringement by reproduction or distribution, two counts of criminal copyright by public performance and four counts of money laundering, and charged Polo with two counts of criminal copyright infringement by distributing a copyrighted work being prepared for commercial distribution, two counts of criminal copyright infringement by reproduction or distribution, two counts of criminal copyright infringement by public performance and four counts of money laundering.\n\nAccording to the indictment, Jetflicks allegedly obtained infringing television programs from pirate websites around the world—including some of the globe's biggest torrent and Usenet sites specializing in infringing content such as The Pirate Bay, RARBG and Torrentz—using various automated computer scripts, often providing episodes to subscribers the day after the shows originally aired on television. Specifically, the defendants allegedly used sophisticated computer code to scour global pirate sites for new illegal content to download, process and store the shows, and then make those episodes available on servers in the United States and Canada to Jetflicks subscribers for streaming and/or downloading.\n\nAccording to the indictment, Polo was allegedly part of the computer programming team that built Jetflicks but later left and started ISIA, a competing service based in Las Vegas that offered not only television programs but movies. Polo allegedly used many of the same automated tools that Jetflicks employed to locate, download, process and store illegal content, and then quickly make those television programs and movies available on servers in Canada to ISIA subscribers for streaming and/or downloading. In fact, some of the movies offered by ISIA were not yet available for authorized sale, download, or viewing outside a movie theater.\n\nThe charges and allegations contained in the indictment are merely accusations. The defendants are presumed innocent until and unless proven guilty.\n\nThe FBI conducted the investigation. Senior Counsel Matthew A. Lamberti of the Criminal Division's Computer Crime and Intellectual Property Section and Assistant U.S. Attorney Alexander P. Berrang of the Eastern District of Virginia and are prosecuting the case.",
			"added": 1567109262
		},
		{
			"topic_id": 1567657210,
			"title": "There's no excuse for violations of the law",
			"body": "You can't talk your way out of the justice that is coming to you.",
			"added": 1567657206
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1565877012_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "Can't wait to see all the criminals here slaughtered.\nDon't try to shield them.",
				"added": 1565881206
			}
		],
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 2,
				"body": "Good.",
				"added": 1565887169
			},
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_278_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): weak bait.   i would hope.\n\nNo, I am deadly serious.",
				"added": 1565892645
			},
			{
				"comment_id": 5,
				"body": "> [fodase](#comment_28_16cMkqz45EzZSjYqk37UTVXaYqLLtrXf3r): Long live Aaron Schwartz\n\nThank God he is dead. You will die too, just wait.",
				"added": 1565907345
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 4,
				"body": "I agree, better a dead body than a pirate.",
				"added": 1565898555
			}
		],
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 6,
				"body": "I hope your neighbors snitch on all of you.",
				"added": 1567454948
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 7,
				"body": "Try asking your local police department or the county jail.",
				"added": 1572643830
			}
		],
		"1574000003_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "Corporations are people too.",
				"added": 1574019694
			}
		]
	},
	"comment_vote": {}
}