{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565330250,
			"title": "Why is 08chan stuck updating at 2755?",
			"body": "Why is 08chan stuck updating at 2755? I increased the download limit to 10 gigs. That certainly isn't the problem. I changed my cert to a ZeroID cert so that isn't it. Out of ideas. Frustrating.",
			"added": 1565330249
		}
	],
	"topic_vote": {
		"1565330250_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1565272923_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9": [
			{
				"comment_id": 1,
				"body": "It's not so much a technical problem with the software. It's an economics problem. There needs to be a way to pay for reliable long term hosting of content and people need to be willing to actually pay. Youtube wouldn't work either without money flowing through it in the form of advertisers and ads.",
				"added": 1565283784
			}
		],
		"1565163816_1JwnMobAn82kxrY5FXnjwMBFbLyziYijwa": [
			{
				"comment_id": 2,
				"body": "We wouldn't need to lash out like that on the internet if we were just allowed to speak truth in our lives. Some people care about truth. It's in our nature, its in our soul. Not everyone, but some of us. And we are forced to lie and lie and lie all day every day. We can't point out the real causes of problems. We cant tell people when they are being disgusting. We can't tell people when they are being unvirtuousness. We can't hold them to any standards.\n\nSo yea, of course people are going to vent a little and take things a little too far in the one space they have some freedom left. Its like a dog thats been penned up for 8 hours. Hes going to be a little wild when hes finally let out of his little cage for a couple hours in the afternoon.",
				"added": 1565284158
			},
			{
				"comment_id": 3,
				"body": "> [tamamshud](#comment_8_13wBVRbx9AW7LaCUpcwgtoqN7wS7wEGR9Z): what justifies Hitler's rampage across Europe, and the wholesale slaughter of dozens of millions of White Europeans?\n\nNothing. Hitler was a faggot. Most of the people on here are alt right and very few of them are Hitler fans. We don't fit into your contrived little boxes Kelly. We just love our people and our culture just like everyone else, even though they have made mistakes, just like everyone else. We want everyones cultures to survive, that means chinese and indians and, yes, white culture. Attacking whites will destroy our culture, so we oppose that naturally, but so will dissolving borders and homogenizing everyone into some global corporate monoculture and mono race.",
				"added": 1565303969
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_83_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): what about the jews and blacks?  and eskimos?\n\nI'm not personally interested in the culture in black countries, but w/e, they are welcome to it in their countries in their continent. As for the black diaspora and its \"gangster\" culture. If we can just quarantine it, then they can have at it. Jews, well I wish they would stop meddling in my culture, but other than that, yea they should be able to have and preserve their culture in israel. Eskimos? Don't know very much about them.",
				"added": 1565307938
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 5,
				"body": "seems that people are going to need to start expending resources to get ID's and then other people are going to need to be able to block those ID's. It's basically the only countermeasure that exists without a centralized authority. It could be something of a HashCash type system, no need to pay with cryptocurrency or anything so onerous as that.",
				"added": 1565329827
			}
		]
	},
	"comment_vote": {
		"1_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"2_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"3_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1,
		"4_18h7dSc5vXQNRA1sjyUmX7zaUTsFARHa5U": 1
	}
}