{
	"next_topic_id": 2,
	"topic": [],
	"topic_vote": {
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": 1,
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610256866_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 1,
				"body": "Win 10 with a Manjaro vm",
				"added": 1610666376
			}
		],
		"1610666851_1DWYNPAmxeKc5Brcs1Yi6oyjndj53kPeLP": [
			{
				"comment_id": 2,
				"body": "> [neuroticfish](#comment_10_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N): Depending on what level you want to reach (CEFR) and which disciplines (ie. good at reading, bad at speaking) there are different methodologies. [...]\n\nYeah, I think ultimately I'll need to live in Russia for a while to get a thorough understanding of the language.",
				"added": 1610668841
			},
			{
				"comment_id": 3,
				"body": "> [driud](#comment_205_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): simple reliable method of learning a foreign language.You take the newspaper, and you read it aloud.You take the movie, turn on the subtitles, and read it aloud.After a month, you will understand half the movie and after two you will understand almost the entire movie. These are supposed to be normal movies, from everyday life.How will you start to understand? Then you can try to learn to write.It works 100%.As for the Russian language, first you have to learn the letters, then read them.\n\nI really do need to write more to get my reps up.",
				"added": 1610669050
			}
		],
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 4,
				"body": "With all due respect, fuck GAB. It is still censored in some aspects. Let's bring people to Zeronet. I am going to donate bitcoin to new users and current users at random.",
				"added": 1610838040
			}
		],
		"1610256866_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 5,
				"body": "Look at it's full price history. It's on a gradual upward trajectory, even though it's still volatile. The price swings will reduce as the user base grows. If you buy now you are still getting in early. If you want to make a profit you must have strong hands and don't try to gamble on it. It's a long term investment. A day will come when you don't need to change it to fiat.",
				"added": 1610843034
			},
			{
				"comment_id": 6,
				"body": "> [351321](#comment_2_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP): Bitcoin: great invention in 2009, shitty overvalued trash in 2021\n\nTypical no-coiner comment.",
				"added": 1610857070
			}
		],
		"1611260804_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": [
			{
				"comment_id": 7,
				"body": "Puppy Linux is another option, it's more user friendly than tails.",
				"added": 1611367951
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 8,
				"body": "> [sword000000](#comment_95_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Let's be honest, blacks are the most racist demographic in the USA. Find me a video of a group (3+) of Whites brutally attacking 1 lone Black person. If you can find it, I can give you 1000 videos of the race inverse. Of course, not all Blacks, but compared to other races, they are bred to hate like no other.\n\nSystemic oppression is to blame /s \n",
				"added": 1611522100
			}
		]
	},
	"comment_vote": {
		"2_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem": 1,
		"205_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"10_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1,
		"36_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"36_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"3_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": 1,
		"95_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"4_1AmREURqCZmJEr8bH1zQgJd1kGrnqkeTiy": 1,
		"67_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1
	}
}