{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "CIberSocialBlockchainNetwork\nСоциальная сеть принадлежащая всем, расширяемая и управляемая всеми пользователями - это реально .",
			"body": "Идея создание социальной сети способной дать возможность каждому пользователю создать собственную уникальную страницу, добавить недостающую ему функцию  и предложить всё это в качестве оптимального апгрейда остальным пользователям. Таким образом мы получим универсальную сверхпрогрессивную платформу разработкой которой занимается миллионное сообщество исходя из своих желаний интересов и возможностей. С чего начать ? Мнения экспертов :",
			"added": 1506804553
		},
		{
			"topic_id": 2,
			"title": "Децентрализованая P2P биржа криптовалют с открытым изходным кодом в ZeroNet",
			"body": "Обсуждаем Code.\nС чего бы начать?",
			"added": 1506858129
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "ururu",
				"added": 1506806642
			}
		],
		"1_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 2,
				"body": "> [mewmewpower](#comment_60_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): В саму основу модема в начале разработок следует вписать все что потом могут запросить юзеры, это и скрытый сервис тор, и торренты, да и i2p который тут так открыто ненавидят в конце концов. Главное это совместимость с другими сетями, например, музыку, видео и фото хранить в ipfs. Проблем сразу меньше станет. В современной ситуации следует не забывать про мобильные платформы, а там и Bluetooth с NFC и прочее чего в компах обычно не бывает. Разработку лучше вести на С подобных языках, иначе скорость рискует быть как в i2p а интерфейс как во всеми любимом зеронете\n\nты поклонник С? я представляю себе какой то небольшой дополняемый скрипт который сможет положить начало этому собираемому всеми пазлу, каким ты себе представляешь на С ( этот первый пазл)",
				"added": 1506856408
			},
			{
				"comment_id": 3,
				"body": "> [cilician](#comment_2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy): ты поклонник С? я представляю себе какой то небольшой дополняемый скрипт который сможет положить начало этому собираемому всеми пазлу, каким ты себе представляешь на С ( этот первый пазл)\n\nи ещё в конце концов это код будет разноязычным и это тоже надо учесть при заложении первого пазла",
				"added": 1506856511
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_187_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Э... Это в каком терминологическом поле?\n> \n> «А теперь, господа, пристегнитесь. Сейчас со всей этой фигнёй мы попробуем взлететь» ©\n\nимеются в виду концепции лежащии в основе этих технологий, думаю технологии которая выйдет в конце развития этой темы будет уникальна и автономна",
				"added": 1506856830
			},
			{
				"comment_id": 5,
				"body": "> [balancer73](#comment_186_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Да пусть из соцсети делается что угодно ещё. Жалко, что ли :)\n> \n> Не отвечает ряду критериев соцсети. Нет на уровне системы социальных отношений. В Интернете нету френдов, френдлент, лайков и т.п. :)\n\nсоциальные сети сегодня имею крайне примитивный вид мы в начале освоения интернет среды.\nИНТЕРНЕТ КАК И ОКЕАН - ИЗУЧЕН МАКСИМУМ НА 5%",
				"added": 1506856940
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_185_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Я знаю такую. ZeroNet называется.\n> \n> \n> Установить: http://www.balancer.ru/g/p5321961\n> Потом зайти на: http://127.0.0.1:43110/\n> \n> :)\n\nСОГЛАСЕН НОГОЕ РЕШЕНО В ТУТ НО НЕ ВСЁ ДАЛЕКО",
				"added": 1506857127
			},
			{
				"comment_id": 7,
				"body": "> [zerostorm](#comment_19_1D8ocho4MuNfkrbP5VdDLG7YwEThzg67Ni): Нужно так оформить понимание расширяемости, чтобы это не делало из соцсети что-то ещё. Иначе же, интернет вцелом и есть именно такая соцсеть.\n\nуверяю вас это будет достаточно универсальный и удобный инструмент использующий максимально эффективно возможности современных компьютеров и сетей",
				"added": 1506857373
			},
			{
				"comment_id": 8,
				"body": "> [mewmewpower](#comment_61_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): С хорош тем что хрет меньше ресурсов при большей эффективности\n\nC так C , а как там с дополняемостью и совместимость с другими языками?",
				"added": 1506882171
			},
			{
				"comment_id": 9,
				"body": "> [dude](#comment_31_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): retroshare. чаты есть, форумы, voip какойто, файлообмен. расширяемость плагинами, стена ака фейсбуг вполне реализуема в перспективеКод на c/qt т.е. вполне портабельный и настраиваемый. а интерфейс - дело наживное.\n> [mewmewpower](#comment_60_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): В саму основу модема в начале разработок следует вписать все что потом могут запросить юзеры, это и скрытый сервис тор, и торренты, да и i2p который тут так открыто ненавидят в конце концов. Главное это совместимость с другими сетями, например, музыку, видео и фото хранить в ipfs. Проблем сразу меньше станет. В современной ситуации следует не забывать про мобильные платформы, а там и Bluetooth с NFC и прочее чего в компах обычно не бывает. Разработку лучше вести на С подобных языках, иначе скорость рискует быть как в i2p а интерфейс как во всеми любимом зеронете\n\nИ так подведём итог друзья как насчёт заняться делом или хотя бы приступить к планированию",
				"added": 1506882496
			},
			{
				"comment_id": 10,
				"body": "> [sigma7](#comment_3_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn): которая превратится в распределенную систему наблюдения\nс этим легко справится сквозное шифрование и возможность зашивровать что угодно.\nИсходники будут открыты но личные данные и прочее будут зашифрованы собственноручному узерами ,",
				"added": 1506948548
			},
			{
				"comment_id": 11,
				"body": "если есть тут те кто ужуе желает присоединиться к работе отпишитесь.",
				"added": 1506971070
			},
			{
				"comment_id": 12,
				"body": "> [mewmewpower](#comment_71_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm): С удовольствием! Но мы только проходим c++ в 12 классе, гимназия, второй год\n\nи как успехи?",
				"added": 1506979790
			}
		]
	},
	"comment_vote": {
		"60_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"186_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"185_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"31_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1
	}
}