{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1549027708,
			"title": "if you find some zsites that have something wrong!",
			"body": "If you find a site on this network that contains at least one of the following issues, send me an email: oncatcoaster using zeromail.\n\nmining, fraud, sale of illegal or other things.\n\nalso please visit my blog to stay up to date on sites that should not exist.\n\nhttp://127.0.0.1:43110/1Q6a561JeaKFMi5TsmYW5NrBhAMwAei6ik",
			"added": 1549027707
		}
	],
	"topic_vote": {
		"1549306180_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN": 1,
		"1549491562_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC": 1,
		"1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 52,
	"comment": {
		"1549027708_155V1pDJWxxohR8eNgocGarkipstcSEARJ": [
			{
				"comment_id": 1,
				"body": "> [jaljah](#comment_7_1L4yxgH1aSH8S6qG4QsoV4xpSDDNssQSz1): I can't open your blog http://127.0.0.1:43110/1Q6a561JeaKFMi5TsmYW5NrBhAMwAei6ik\n\nyeah... currently online users are missing.",
				"added": 1549045021
			},
			{
				"comment_id": 3,
				"body": "> [randomshit](#comment_22_18wj1JzTXc2gNiG4MnUvToPyJkB4e6P79r): One simply has to gather a collection of blocklists to compile a naughty site list.\n\ndespite the fact that zeronet has no limitations, I would still like to make zeronet safe enough for normal people.",
				"added": 1549046759
			},
			{
				"comment_id": 4,
				"body": "uhm.... what the fuck is happened here?! xD",
				"added": 1549240098
			},
			{
				"comment_id": 5,
				"body": "just to explain better, I do not want to block porn sites, or sites that simply suck or do not have users.\nmy goal is to limit access to sites deemed dangerous due to scam, viruses, mining, and other things.\n\nin fact I would also agree to pirate games, music and more, simply because some things have a price too high.\n\nI do not want to restrict anyone's freedom, I just want to make zeronet a place where even normal people can stay",
				"added": 1549280291
			},
			{
				"comment_id": 7,
				"body": "> [itsnice](#comment_3_179SNiLpYySTQmRJzJS3vCWJNCgEK7c1JM): Well. That's because you CAN'T restrict anything and just looking for porn sites, so fuck off.\n\nthe global blocklist exist for that, but the user can choose if apply the blocklist or not.",
				"added": 1549372038
			},
			{
				"comment_id": 8,
				"body": "the block list don't block you to visit the site, but warns you in the main page, \"oh.. you are currently seeding a blocked site\", and hide blocked user posts and comments",
				"added": 1549372242
			}
		],
		"1548083742_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 6,
				"body": "> [ssdifnskdjfnsdjk](#comment_655_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I tried it on my newly setup zeronet computer. It appear to work like this: [...]\n\nhttp://127.0.0.1:43110/1Q6a561JeaKFMi5TsmYW5NrBhAMwAei6ik/?Post:11:do+you+want+block+porn+",
				"added": 1549323623
			}
		],
		"1549491562_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC": [
			{
				"comment_id": 9,
				"body": "already doing that, im waiting some reports.",
				"added": 1549496621
			},
			{
				"comment_id": 10,
				"body": "> [aloha3](#comment_1_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC): can u give me a link?\n\nhttp://127.0.0.1:43110/12qMBf8fJikRuAQ4wwCQHuBY7FeQBSwskH/ <--here go everything you report to me\n\nhttp://127.0.0.1:43110/1Q6a561JeaKFMi5TsmYW5NrBhAMwAei6ik/ <-- is, the blog of my blocklist",
				"added": 1549498236
			},
			{
				"comment_id": 11,
				"body": "> [oncatcoaster](#comment_10_155V1pDJWxxohR8eNgocGarkipstcSEARJ): http://127.0.0.1:43110/12qMBf8fJikRuAQ4wwCQHuBY7FeQBSwskH/ <--here go everything you report to me [...]\n\nI'm looking for people to increase this list",
				"added": 1549498861
			},
			{
				"comment_id": 12,
				"body": "> [quantumworld](#comment_219_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Actually I will save some time and move this block list site site on my ban and block list site. 80% blocks are not accurate on this list.\n\nI can simply tell you to do what you feel, the list is made to help users, to increase the accuracy of the list the user can write me what they want to add or remove.\n\nI simply can not search for sites and report them above I can not do.",
				"added": 1549552405
			},
			{
				"comment_id": 15,
				"body": "> [aloha3](#comment_2_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC): I have the idea of make a list of surface sites too, not only here in zeronet.\n\ncurrently the creation of an \"active\" site with database is not the easiest thing here on zeronet, so the important thing when starting something is to be able to start it, collect the skills to do it and then be able to dedicate time and not give up.",
				"added": 1549686062
			},
			{
				"comment_id": 16,
				"body": "> [ssdifnskdjfnsdjk](#comment_668_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I do not remember any fraud or scam site out there. usually there is nothing for sale so no fraud, right..\n\ncurrently, there are few of them almost nothing, but it is better to always be ready to collect reports.",
				"added": 1549686123
			},
			{
				"comment_id": 17,
				"body": "> [quantumworld](#comment_247_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): That would be millions of sites. And what is you criteria of scam's. You need to define that a lot better than just scam. That way it would be easier to track what kinds of scam's are out there and how they will be technically dealt with. Its not an easy job to do and it is risky if you use winblows.   (Linux/Bsd ) is best.\n\ncurrently, everything that the user passes to me as a report and I can check the list, after if my list can be used to improve a search engine to exclude malicious content I'm happy.\n\nsimply a user can also send a fake report anyway even if it falls within some specifications I should check it. - that's why I left it for free interpretation",
				"added": 1549686400
			},
			{
				"comment_id": 18,
				"body": "I would not mind if you wrote to me from my forum or even in the blog, because I like someone to question what I do, even if I would prefer to have more help in this work. @quantumworld @ssdifnskdjfnsdjk",
				"added": 1549686544
			},
			{
				"comment_id": 38,
				"body": "> [anonymouslogin](#comment_192_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): This is a big scam! This „blocking\" projects behind the goverments of USA,China,Europe,Russia try to controll zeronet. Many of people  who working on this projects. The same time spamming users, and try to force the developers and website administrators, community to their interests.\n\nthere are only sites that are reported by users and seeing that you prefer to remain anonymous, this project most likely creates some inconvenience to you.",
				"added": 1549759423
			},
			{
				"comment_id": 40,
				"body": "> [anonymouslogin](#comment_194_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): This lists and the publishers on purpose ignore some zites with the same problems. Its contains later maximum the 1% of the real malicious sites.Its a simple scam,and clickbait. The publisher often says something else what he wants. The lists are blocking useful sites. And does not care many other malicious sites.\n\nwhen we make a list of sites / users to be blocked we do it because we find some problems that could annoy a user.\n(Malware, Mining, Porn in some cases, Spam, and some illegal contents).\n\nin fact in the lists are not all sites that should be there, but in fact it is because who puts sites in the list is a single person, who goes in search of sites and check site by site, it is no conspiracy is ineffective, in fact if you see all the lists put together taken every single list you would get a good number of harmful or illegal elements or in some cases unwanted.\n\nobviously the mistake can be there, and I think I speak for the others when I say that it is enough to contact us for a reverification. @ssdifnskdjfnsdjk , @kaffie, @Balancer, @styromaniac",
				"added": 1549799736
			},
			{
				"comment_id": 41,
				"body": "> [progi](#comment_11_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): Be careful with this blocklists! [...]\n\nobviously you can check if in our blocklist this exploit is present, or signal us if it is present in some sites. oh... there is nothing? in addition, knowing which file or site you accessed is not of interest to me.\n\nalso because the blocklist works simply through an inclusion of our blocklist in yours, we do not read absolutely anything from the user.\n\n1 to find the ip needs pages with an extraordinarily low number of peers, or a large number of sites to compare, in addition obviously they will work on a fix if you communicate it, and you should not make public the procedure of the expilot to the public , now if someone wants to use it can also directly copy your code and integrate it into its page (and you dont help the situation) (also this expilot would seem more usable to do the facts of others).\n\nmoreover .. if I can just say it, the easiest way to find an IP is to trigger the loading of a page of Znet a redirect (in the meantime adds a log in the db of the user who did this thing) that throws you on a page in the normal network where the ip and date logs are made.\n\nin this way you know: ZnetID, data, public ip.",
				"added": 1549804204
			},
			{
				"comment_id": 42,
				"body": "there is this system of publication to prevent idiots who believe they are doing the right thing by showing the public a vulnerability thinking that users can control and avoid them on hundreds of sites, while malicious people who did not know the expilot can now use it simply by copying that you wrote and modified it so that it works.\nthat's before publishing an exploit without waiting it to be solved by developers.\n\nhowever, it can be communicated to the public, without showing the code or clues as to how it works, simply saying \"See that there is a usable exploit to find your IP, use a ZeroFramework vulnerability that allows you to search for files within other pages and lets you understand which pages / files you have visited \".\n\n\n\nthis method of publication is designed to avoid the spread of malicious code, of course you instead of following the mantra of the vulnerability seeker you did your own, and if we find ourselves with people who use your expilot and will use it to do something wrong the user will know who to look for.\n\nhow to manage a vulnerability publication.\n0- the problem is communicated to the developers\n1- communicate with the public without publishing the malicious code or the method.\n2- make sure that it is solved by the developers (if the developer does not activate to fix it, he has 1 month time in case of small vulnerabilities and 6 months in case of extended vulnerabilities)\n3- you publish that the problem solved by publishing all the resources.",
				"added": 1549806337
			},
			{
				"comment_id": 43,
				"body": "> [styromaniac](#comment_516_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The admin actually admitted to them but said you get notified of the miner now. You might not have seen them all.\n\ni will check.",
				"added": 1549806357
			},
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_517_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): On only one site do you mention that all the other sites have a miner. I think people might miss that notification on that one site and lose trust when they find out a different way. [...]\n\n\n\n> [zeropyro](#comment_29_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): In the C&P services  FAQ everything are correctly written. The services source code are open source. Everybody can read it the code  if there was any problem with it.Oncatcoaster he came serval times and spammed in the C&P forum from the miner, and in C&P zite index he offered his own page. 4X deleted his violent spam attacker comments. In the forum services are everything are correctly written. The miner too! Nothing was ever hidden from the users. She clearly can see many another zite use coin miner to. That's why they aren't in his list? I said clearly,my configuration are tested with mobile,PC,and laptop too. All site software,script made by professional programmers.Insaide the coinhive project working paid professional programmers too. This services are runs between with multiple devices tested parameters. The user better to believes in himself. The are a delete button, no one forced anyone to use a service. We don't have to deal with every stranger idiot who is visit the page. And he thinks a few minutes later, we most reform the page because he doesn't like something.\n\nalthough, I would prefer that you make it optional [obviously default enabled], at least with my list you'd be fine (and deleted), however in other lists not managed by me you're present.\n\nobviously the most important thing for me is the fact that the user can accept or deny mining or at least see the policies at the site access in a beautiful box with written generic details of your policies\n",
				"added": 1549814031
			},
			{
				"comment_id": 46,
				"body": "@styromaniac can you check if my forum now allows to write to any users?",
				"added": 1549814278
			},
			{
				"comment_id": 48,
				"body": "> [styromaniac](#comment_518_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Your forum?\n\ntry to make a new discussion or new comment\nyep seems not working http://127.0.0.1:43110/1Myrhz23jnZNJiRZmK3ZzRju7XCuR4QPS7",
				"added": 1549814777
			},
			{
				"comment_id": 49,
				"body": "> [styromaniac](#comment_519_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Content.json download failed.\n\nuhm.... 15peers",
				"added": 1549815045
			},
			{
				"comment_id": 50,
				"body": "> [styromaniac](#comment_520_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I have no peers. Tor?\n\nidk what is the problem i see 15 peers",
				"added": 1549815165
			},
			{
				"comment_id": 51,
				"body": "> [styromaniac](#comment_521_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You said that.\n\ncheck my zero.me",
				"added": 1549815231
			}
		],
		"1549585526_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 13,
				"body": "a ddos attack on a p2p network can actually be done, the problem is more people are doing seeding the less the impact of DDOS will be.\n\nabout garbage is manageable, all user data except UUId (User Unic Identity) are manageable.\n\ncurrently not a problem to make data purge is not useful, counting how much data are created, and those that only their position remains of their existence (in fact the data that ZeroNet forgets remains only the position and the information that distinguishes it , even if the file in question no longer exists)\n\nhowever, garbage handling is possible, only that it is not currently useful.\n\n\nAbout spammers:\n\nevery site you visit has space limit for every user... almost 50k some 20k other 100k this amount of used storage still a 0,000005% of 1TB  -- 0,005% of 1GB -- 5% of 1MB to fill 1 HDD of 1 TB you will need a lot of time spamming in a forum.\ncurrently, zerotalk should occupy 4 mb for all conversations of all the users on this platform, also some are forgotten due to lack of peer from this network.",
				"added": 1549685144
			},
			{
				"comment_id": 14,
				"body": "even on 64gb still nothing 0,000078125%, if you come to talk about files with high weight ... zeronet also provides you with a tool to delete data and optional files. the only problem of zeronet is the fragmentation, the volatility of the data and the redundancy of the data present in hundreds of computers and this is the problem of the P2P (like torrent),\nthis would have been a serious problem about 17 years ago, but even a floppy would have managed to contain spam in zerotalk",
				"added": 1549685766
			},
			{
				"comment_id": 20,
				"body": "> [leftside](#comment_551_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Imagine 1M of ghost IDs add garbage data all at once.If they upload a piece of lyrics of Bohemian Rhapsody, 1.9 kilobytes times 1M = 1.9 gigabytes in a second.  [...]\n\nwhen I was referring to the problem of data consistency I was referring to this is a problem of the p2p network and you can not do anything.\n\nin addition, zeronet does not allow you to download beyond the scalable limits that warn you and ask GIMME MORE SPACE! from 10mb to 20mb to 30mb or 40mb.\nhowever, if a person notices something strange, takes and stops giving space to that site, the problem does not exist once that user has gone offline, is the only peer that  create problems just put it in the ban and will not keep the his role as a malevolent seed, there are also multiple solutions that would work without alarming anyone.\nmeanwhile it would be enough to limit the space that each file can occupy and control the digest before publishing and compare it with a digest db present in the P2P network (all you can do in JS should also create an anti-JS code modification system)",
				"added": 1549688804
			},
			{
				"comment_id": 24,
				"body": "if u want do a DDOS attack on this network you will encounter that problem.\nMore ppl = stronger network to attack, the problem of a DDOS attack on a P2P network is that the problem has a duration even after the attack is over, but it remains always difficult to throw on the ground. however, a ddos attack on a p2p network is always mitigated",
				"added": 1549689589
			}
		],
		"1549554952_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 19,
				"body": "just to fix things and make clear an automatic anti-spam system would not be bad, but still it is quite useless on the limit of data on the ZeroTalk & others.\n\nintroducing the CAPTCHA to new users even for the first 15 posts would be over annoying, already the user struggles to stay on zeronet add the CAPTCHA would be a loss of users on many platforms.\n\nbesides, I am currently about to make a non-constructive criticism:\n\nYour anti-spam system would require something that requests a forum text and calculates a spam score.\n\n1st point: if the users of zeronet should increase, there would be a slowdown in controls.\nall this because not being able to use a server-side language on zeronet also putting an anti spam in JS would be alterable therefore that of an external program that does all the work in post publication is obligatory.\n\n2nd point: an anti-spam that is simply based on repetitions or similiarity is bound to fail, there are so many different types of spam and in any case you could also get a non-spam comment that looks like a spam comment, which puts machine needs permanent human help in the machine that controls spam.... so you need a recursive learning AI (called also neural network).\n\n3rd point: your system would need an active 24/24h 7/7d 12/12m  server so it would become a paid service for every ZeroTalk clone (i dont love the idea behind that).\n\nso.. we should find a solution together for these problems.",
				"added": 1549688055
			},
			{
				"comment_id": 21,
				"body": "> [leftside](#comment_552_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Thank u for ur constructive criticism. But I recommend u to check my previous suggestion for that matter in which I introduced trustful volunteers concept in this discussion. [...]\nI currently have the solutions and 3/4 of the skills necessary to solve the problem, so.. i want to talk to you and others, about how to solve that problem.",
				"added": 1549689138
			},
			{
				"comment_id": 22,
				"body": "I'll ask you a few questions to get you to my thought, so that you can understand how I got there.",
				"added": 1549689294
			},
			{
				"comment_id": 23,
				"body": "what is the biggest problem of something decentralized?",
				"added": 1549689350
			},
			{
				"comment_id": 25,
				"body": "what's the problem of not having a server-side language and having only that client side?\n\nhow do you think when you only have that language to program?",
				"added": 1549689834
			},
			{
				"comment_id": 26,
				"body": "> [leftside](#comment_555_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Running the centralized websites has its own benefit.They can hide the valuable big data of the activities of their users anyway. [...]\n\nNO! this require to you resource like VPS and you need to maintain that.",
				"added": 1549690239
			},
			{
				"comment_id": 27,
				"body": "the simplest answer is start to  read the database looking for spam. (slow, requires an external machine, and requires periodic database updates). <-- this is the bot solution.\n\nthe exact answer is to do a p2p control, that is, the control algorithm will be in the client's JS, and every time a new post arrives it will be enough to apply an acknowledgment algorithm (after it is to be seen whether an AI or an algorithm comparison) so that every time a standard line is exceeded by means of the values in the db a score is applied.\n\n// EXAMPLE //\n\n/ total N of checks / positive checks / negative checks /\n1000 / 997 / 3\nwhen there is a majority, the post is deleted.\n\nwith this system you can kill spam without having a server and without risking alterations related to malicious users with modified JS being a distributed network each user has a role, and his computer does not exist a leader who manages the data, the whole network must help.",
				"added": 1549690493
			},
			{
				"comment_id": 28,
				"body": "Meanwhile, zeronet and internet are a great meal to give to an artificial intelligence, but no. what I'm talking about is managed automatically\n\ntriggerofthenewerpostontheJS -> CHECK IF IT IS SPAM -> yes? REPORT! add 1 to report total and to POSITIVE.\nno? add 1 to report total and to NEGATIVE.\n\nafter the total and the positive negative ratio has reached a total limit or automatically add the user to the list of users to be blocked or modify the JS that takes care of showing the contents making it skip the contents related to the spam",
				"added": 1549691396
			},
			{
				"comment_id": 29,
				"body": "> [geekless](#comment_45_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): That's not necessary, since ZeroNet doesn't require such level of connectivity as conventional server applications do. [...]\n\n> [geekless](#comment_45_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): That's not necessary, since ZeroNet doesn't require such level of connectivity as conventional server applications do. [...]\n\nthe problem remains that doing the work of control to a single computer can become heavy as the user increases, so it is not possible to evaluate a situation in a p2p network that requires a single machine",
				"added": 1549691517
			},
			{
				"comment_id": 30,
				"body": "actually i havent sleep 7:00am, you are in a P2P network, think like a SHARED MACHINE RESOURCE",
				"added": 1549691612
			},
			{
				"comment_id": 31,
				"body": "15.8k/50k",
				"added": 1549691636
			},
			{
				"comment_id": 32,
				"body": "> [leftside](#comment_559_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Considering my command interpreter bot concept, it will not become heavy at all because all the decisions will be made by every single volunteer and the bot will just commit the rules based on it.\n\neverything that use a \"server, bot or other\" needs money to get up.\n\nif the amount of data increases working with a bot can be complicated, remember that if it is directly the software of the forum people can clone the work and all have a system protected from spam.",
				"added": 1549691919
			},
			{
				"comment_id": 33,
				"body": "> [geekless](#comment_47_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): leftside, please also read my reply here. [...]\n\nthe fact is that goes to complicate the work of developers of zeronet, and give him something already ready and that he learns how to behave alone would be a simple integration. instead modify tons of code",
				"added": 1549692217
			},
			{
				"comment_id": 34,
				"body": "> [leftside](#comment_561_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): If there's an existing jobs using the existing network bandwidth, adding a bot for Zeronet is negligible.  [...]\nimagine that we use your bot, the bot should be linked to the page? quite right? now the bot has to listen to the various pages several times a minute, check if the site contains a spam and delete it. now imagine having to connect your bot to every forum in zeronet, you need to process more data, add multithread support, increase the requests for the bot, your machine no longer holds the memory used if not at the process level to check the posts and comments of about 1000 or 1500 sites you get to 2000 sites and you need a ram memory to read the data of the sites, and since the bot needs to be online 24/24, in addition we do not talk about ghost sites or dead sites that will remain in your bot for life",
				"added": 1549692865
			},
			{
				"comment_id": 35,
				"body": "creating a bot requires resources to increase sites and posts and comments",
				"added": 1549692934
			},
			{
				"comment_id": 36,
				"body": "in my own way, as the user increases, the accuracy of the algorithm increases, in addition the speed of control increases, and since everything is processed at the time of receiving users connected at the time and verified by all the users is dead proof. this is the power of the P2P systems we need to use that power!",
				"added": 1549693149
			},
			{
				"comment_id": 37,
				"body": "now i go sleep 7:20am ç_ç",
				"added": 1549693178
			},
			{
				"comment_id": 39,
				"body": "> [anonymouslogin](#comment_191_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): This spams and blocklists part of a project to controll zeronet. European and USA governments do the same what China do. Who make this blocklists,some people from them try to force the users, and developers to make this project more censored,controlled by the government.And make  the users more trackable.Some of this people make the spams and come to us as the same time as a good guy who try to solve this problems.\n\nyou are free to visit every site you want, but we works to make that networks secure",
				"added": 1549799156
			}
		],
		"1548210080_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 44,
				"body": "i cant even check my m.2 Lifespan LOL",
				"added": 1549810616
			}
		],
		"1549791989_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 47,
				"body": "because user profile is not part of the DB",
				"added": 1549814426
			}
		]
	},
	"comment_vote": {
		"218_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"2_16Mk2RBcyMkuWKqULM9C95UEef4oNyagSC": 1,
		"668_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"247_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"517_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}