{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 1,
				"body": "> [edgelordofdecent](#comment_39_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): This is the same logic that muzzies have that causes them to start grooming gangs.\n\nYou're incredibly close to grasping an important concept, niggertits! \n\nIn goatfucker society, thanks to polygamy, 90% of the women go to the upper 2% of the men, leaving a huge broiling underclass of angsty virgin faggots who desperately dick down each other and even the local fauna, in heated fits of dune coon coitus. It's the only outlet, and eventually, even that isn't enough, so they start BLOWING SHIT UP, because they're horny and pissed off and some other faggot told them there's nubile pussy waiting for them in goatfucker heaven. PUSSY, HELL YEAH! BOOM! \n\nYou see this in every society where a sexual underclass of men develops: they get pissed off and REVOLT. It happened in China over and god damn ching chong over, it's continuously happening in the middle east, and - wait, doesn't this story sound familiar? Don't we have a word for this? YES, RETARD! Welcome to the INCEL QUESTION! \n\nMONOGAMY is social technology that HARNESSES the autistic fury and potential output of the average male, by trading him GUARANTEED PUSSY for productivity and civility. Holy fuck, state mandated gfs! Essentially, yes. Western civilization was built on the implicit social contract of patriarchal monogamy. That shit is a societal super power, as clearly evidenced by wciv fucking everyone else harder than ever before, such that they all still moan about it today! What bitchy little cunts! So WHAT HAPPENED?\n\nWell, monogamy is clearly OUT THE WINDOW. Look around. Sexual liberation and its consequences have been a disaster for the western race. Just like in shitfuckistan, most of the women STILL go to the top percentage of chads, as is their biological imperative. (\"Social\" \"scientists\": DURR?? WUHH?? HOW DIS HAPN???) Social dysfunction is at an all-time high, relations between the sexes are trashed, suicides and drugs are spiking. How did it get this bad? And why is the beta uprising, which is historically inevitable, taking so long?\n\nTODAY, we're DROWNING in a sea of readily available SOPORIFICS: netflix, weed, and ubiquitous free internet porn. The average incel is too blown the fuck out to give a damn. Instead of agitating in beer halls and getting together to investigate how to rapidly disassemble power stations, the underclasses have been able to escape into vidya and animu, dulling their dendrites with dopamine over TCP/IP. Combine this with a united mass media messaging machine with a 24/7 agenda of suppression, and your underclass is NERFED. Doh! Gay! (Don't even get me started.)  \n\nSo HERE WE ARE, at the first moment in history where the underclass of angsty, horny, pissed off men has festered and blistered and swollen larger than ever before, inflated by the hubris of the elite, pump after pump, believing that they can put a cork in the biological fever that's about to be unleashed to purge the virus. We're seeing the first spots of sweat appear: MASS SHOOTINGS! Sure, tons of them have sketchy glownigger involvement, but there's also genuine social unrest at work, and the copycats are coming, baby! BOOM BOOM! We're trapped in the belly of this hellish machine, and the machine is bleeding to death! The only way out is through!\n\nIn conclusion, get ready for the big igloo, vote for brown hillary, carry a sharpie around town and cross out the spanish translations on things. Four feet on the gas pedal! Five feet on the gas pedal! Remember to lift, and keep that creepy grin going. Drinking game: every time you want to jerk off, print another gun instead. It's way more fun this way... if you have the willpo.\n\nSome of us might make it.\n\nt. upstanding global citizen",
				"added": 1565522945
			}
		],
		"1565484642_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": [
			{
				"comment_id": 2,
				"body": "> [542vg3](#comment_7_1Fi6FbNTzE6kZNEbR23FzcndyJh3RE9Nhx): sure post your guns too, make sure we can read the serial\n\nWow, you added serial numbers to your guns?",
				"added": 1565523342
			}
		],
		"1565523603_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 3,
				"body": "Because \"Crime,\" categorically, is not what you're describing. You are perhaps elaborating the principle that people will pay you to do what they want, and their incentive will be higher the less they want to do it themselves, which is very much the case with crime. If I run into 7/11 and shit on the cash register, it's certainly a crime, but I'm not rewarded (aside from any personal feelings of triumph I may generate after my conquest of the counter.)\n\nAlso threadly reminder to stop eating shit, lift, and print guns erryday. BOOM BOOM",
				"added": 1565524061
			}
		],
		"1565562243_1LqBmfU8v7MjQWdX8veLtbXuqmDvACw4vM": [
			{
				"comment_id": 4,
				"body": "I could do it but I won't",
				"added": 1565567678
			}
		],
		"1565855060_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 5,
				"body": "Lokinet links to discord in the footer. That's my opinion.",
				"added": 1565857751
			}
		]
	},
	"comment_vote": {
		"2_1JmzascVT1gUZZ5mLg8mg6pZKmTGdGNPXm": 1,
		"65_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": 1,
		"49_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": 1,
		"1_1JmzascVT1gUZZ5mLg8mg6pZKmTGdGNPXm": 1
	}
}