{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1630296649,
			"title": "It is sad there isn't an earthquake in new orleans now, leading to a break in california and the caldera taking off...",
			"body": "however it's cool to see the carabean sea moist drained by the typhoon :). \nin short too little to wound mortally the usa... sadly.\nmaybe an asteroid hit?",
			"added": 1630296648
		},
		{
			"topic_id": 1630300883,
			"title": "Why alex jones doesn't want \"accountability\" of phaze 3 of kris the canadian?",
			"body": "very remarkable... but why?",
			"added": 1630300881
		},
		{
			"topic_id": 1630302539,
			"title": "dear shit bags from \"intelligence agency and so called cops\"",
			"body": "I don't ask you to become immunologist or biowarfare specialists... just to investigate the vaxx scam, not from a medical & science pov, but simply from a classical scam, money flows, communication (all in the wef in davos spread over years) etc... it's just investigation... how to put a poison in to people arms, ivermectine works...\nyou get what I am saying? nooo... you can't ...\n\nyou believe your children will be the \"chosen few\"... okay... you will learn.\nif you fail with them, you will all die\nit's too late for you now.\neven with your agents of persuation like jonesy and co...\ngl&hf\nwar is raw",
			"added": 1630302536
		},
		{
			"topic_id": 1630314029,
			"title": "Will the first covid die off happen this winter?",
			"body": "curious to see... time horizon this winter next 2 (for the 3 year window) then the 7 year mark and will see from there to the 7 generations :) before having an intermediary opinion on the safety of those injection, certainly not designed with nefarious intentions, who would do that? ;). \n\nwhat I don't get is their planned end game? Africa take over europe? then what? as if africa wasn't big enough... and then their is the upkeep cost... so... \n\nchina not fooled, sinovac is below natural immunity (Asympto or recovered) but I believe is a positive one, in the sense that at infection it will not hinder natural immune response...\n\nanywaaaaaaayyyyyyy...\n\nsome had fun on earth  - at the expense of others, maybe, they will regret it later... I don't know what's happen once dead... maybe nothing , but the universe has it's way... I mean it would be too easy if the price of a good life was known... who would be tempted and fall? anyway.\n\neach one his life, why shall I care if muppet drop dead left and rights? I mean technically it's cool with me, I don't care, they made their choices, they will live with it. and I didn't forced nor coerced anyone to anything. of course I said mean things, thought bad thought, cheerleaded in more wars and liberation than most... maybe if I had taken part we wouldn't be in this shit show...\n\npoor yankees to afraid to say shit show, using clown world... \n\nso who is exctracting real wealh now?",
			"added": 1630314025
		},
		{
			"topic_id": 1630344696,
			"title": "So what's next?",
			"body": "I am a little bit lost of the next phaze of the projects? and easy choke points :\nisrael and the iranian nukes (and mega gaz) + the backers?\ntaiwan?\nI am curious in what is so appealing in neofeodalism neopharaonism etc? wannabe the Louis 16th? \nanyway... it's your days on earth, do what you want, enjoy them, the bill will come due...",
			"added": 1630344691
		},
		{
			"topic_id": 1630349248,
			"title": "What did they pay the western sec services for the cooperation and collaboration on the pLandemic?",
			"body": "child rape rights? money? black mailed silence? I am curious, a place in the elyseum? or they are just too dumb? it's a legit question for the history books... or maybe they believe in the \"cause\" what is the cause? which cause? I don't the iranian shia and the jewish supremacists can really find common ground or that CPC will surrender china to the bilderberg what ever round eye group? so what is going on? how did it fall that low?",
			"added": 1630349242
		}
	],
	"topic_vote": {
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": 1
	},
	"next_comment_id": 147,
	"comment": {
		"1629863121_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 1,
				"body": "remember everything is possible in the spirit, but only the deeds count... who knows, better be at the best on both !\n\nthen the talibans recommended restaurant list of afghanistan, alahal, not toxic food, non gmo, clean, organic, grown nearby, good service, fair price, safe !",
				"added": 1630243376
			},
			{
				"comment_id": 2,
				"body": "Now you agree I was quite friendly until now... I have of good will and for free, and didn't ask for anything in return, shared my own personal humble uneducated foreign opinions...\n\nHOWEVER...",
				"added": 1630243422
			},
			{
				"comment_id": 3,
				"body": "IF you enter the vaxx nazis axis, expect destruction.",
				"added": 1630243444
			},
			{
				"comment_id": 4,
				"body": "I mean annihilation. 400k afghans at best left alive and dying. \nand I am not kidding.",
				"added": 1630243468
			},
			{
				"comment_id": 5,
				"body": "sorry to break the postive mood like this... all and this UNO UNESCO WHO IMF crap... forget it !\n\nI won't be so harsh regarding those, but I will be very dissapointed, same for this islamic organization, all this crap... forget it !\n\nyou enter negociation with each country you want INDIVIDUALLY ! respect YOUR SOVEREIGNTY, YOUR INDEPENDENCE, YOUR LIBERTY, YOUR WAY OF LIFE !\n\nthey will all offer you perks, and gifts and bribes, to black mails or to lure you, to enslave you and reduce you to only their executives, little dwarfs with only one say : YES.\n\nunderstood?",
				"added": 1630243632
			},
			{
				"comment_id": 6,
				"body": "there are always strings attached, even if very hard to tell now, they always start to drag you down, sooner or later...",
				"added": 1630243666
			},
			{
				"comment_id": 7,
				"body": "because we a real economic developpement supported by the talibies, regulated  by the talibies, and secured by the talibies, AFG can easily be a 1 trillion yearly economy... not tomorow, but on 20 year plan? would be hard to fail... the question is what's left once you die? is it an industrial / extractive toxic waste land? or something you would be proud to show the Prophet of Islam (PBUH) at his expected return? the answer is up to you, I just ask...\n\nbut would be sad, to lose another great country and potential to the NWO / rockfeller way of life, and I am not very hot on the migration wave to be fully honest...",
				"added": 1630243793
			},
			{
				"comment_id": 8,
				"body": "I hope those words aren't too hard for those who fought facing NATO and more importantly the USA, but I understand that the real struggle is in front... the one before was against... it was easy... this one is within, and within onceself, yourselves...\n\ngood luck and have fun !",
				"added": 1630243858
			},
			{
				"comment_id": 9,
				"body": "it would be great if you succeeded !",
				"added": 1630243869
			},
			{
				"comment_id": 10,
				"body": "and don't forget those americans the 2000+ died for 40m+ afghans to live... could have dropped all life from this square to 0.",
				"added": 1630243933
			},
			{
				"comment_id": 11,
				"body": "(and that includes goats and scorpions).",
				"added": 1630243963
			},
			{
				"comment_id": 12,
				"body": "it wasn't a question of means, but of wills...",
				"added": 1630244017
			},
			{
				"comment_id": 13,
				"body": "#theempire #thedarkside #theforce #unifed :) to lighten the mood...",
				"added": 1630244054
			},
			{
				"comment_id": 14,
				"body": "#noblackraininafghanistantoopristineandbeautifultobewastedagainonthealtarofwar",
				"added": 1630244105
			},
			{
				"comment_id": 15,
				"body": "(but I don't say that there wasn't bad behaviors, on both side)... but as said, holding grudges won't spare or save anyone from the Judgment of God...",
				"added": 1630244179
			},
			{
				"comment_id": 16,
				"body": "so may the islamc emirate prosper and live in peace (and harmony).",
				"added": 1630244206
			},
			{
				"comment_id": 17,
				"body": "for the lulz... would be cool to be able to one day find in america, afghan pop corn... ! legendary... the highest quality, home grown, non gmo, non toxic... I mean the premium exceptional...",
				"added": 1630244413
			},
			{
				"comment_id": 18,
				"body": "and now the organization of the great departure... I would like from bagrhram perceeded by walk from the soon to be old airport to bahgram, and the take off filmed by 2 drones... historic !\n\nbtw... a leasing on the base would be possible? small footprint... just to stay to see the progress and how it goes... could have some benefits...\n\nbut again it's up to you talibies, if you don't want... \n\nit will be a good bye...\n\nyeah  from bahgram... sunset... it will be splendid... the last plane...",
				"added": 1630245052
			},
			{
				"comment_id": 19,
				"body": "and if it was possible to put a little memorial at the air drop spot of the first who came, it would be nice...",
				"added": 1630245092
			},
			{
				"comment_id": 20,
				"body": "to usher the military touring touristic attraction ! from tora bora... to sohk valley... we heard of tales of great battles... I am sure there would be visitors...",
				"added": 1630245138
			},
			{
				"comment_id": 21,
				"body": "some would come to see where their family members died...",
				"added": 1630245156
			},
			{
				"comment_id": 22,
				"body": "but please dear talibies, don't become UNO stooges... please... I won't evoke god's name... but please...",
				"added": 1630245211
			},
			{
				"comment_id": 23,
				"body": "and two remarks : \n\n1. concerning the war tourism, some people (that I hate) will come to you, and ask if they could build a church there : kill them. (I know it's brutal, but in reality those people will try to use the fallen warriors for their prozelitism).\n\n2.  before splashing the former minister of defense, who I believe conspire... telling the young massoud to go out of the building isn't an inappropriate idea... I am sure due that due to his young age he is maybe under the spell of the one... we seek to kill...",
				"added": 1630247757
			},
			{
				"comment_id": 24,
				"body": "he can hide but he won't survive...",
				"added": 1630247776
			},
			{
				"comment_id": 27,
				"body": "my whole point... hmm what is this former minister trafficking? He has load of cash... weapons... knowledge... the motive... the means... the will.... \n\ntime for Space Based DEW testing?",
				"added": 1630247991
			},
			{
				"comment_id": 28,
				"body": "and worst nothing to lose and cornered...",
				"added": 1630248051
			},
			{
				"comment_id": 29,
				"body": "something I want illegal is the amphetamines... the syntheics... go away with that... I guess that's ISIS thing? and I add the slavery , capture of females, organ harvesting... but why would they bomb the airport?",
				"added": 1630248118
			},
			{
				"comment_id": 30,
				"body": "and it's not really isis... it's more a criminal gang proliferating in war zone.... they could be mossad for all I know.. I say that but it could be clinton fundation.... or themselves... I mean : WIPE.",
				"added": 1630248194
			},
			{
				"comment_id": 31,
				"body": "and concerning this lease of baghram... for example no fly outside normal human tolerable hours... but it's a small presence... more an outpost in giant facilities... it's not war making or occupation... think germany or italy... just to tour...  it's not a bad idea... $100m/year? I say for the noise, because those poor neighbor in their green paradise... when it was roaring non stop, I can't imagine their annoyance...",
				"added": 1630248435
			},
			{
				"comment_id": 32,
				"body": "then you could collateralize and leverage this early income stream easily...",
				"added": 1630248479
			},
			{
				"comment_id": 33,
				"body": "you don't want, too bad for you...",
				"added": 1630248520
			},
			{
				"comment_id": 34,
				"body": "but for this price you provide security :)",
				"added": 1630248569
			},
			{
				"comment_id": 35,
				"body": "my problem with the city old airport, it's way too close to the growth potential of the city... and bahgram still a little bit too far...",
				"added": 1630248640
			},
			{
				"comment_id": 36,
				"body": "I would bet a space shuttle could have landed in baghram... I mean the run way was okay for it.",
				"added": 1630248720
			},
			{
				"comment_id": 37,
				"body": "but \"she\" would have been stuck, until being put on top of a jumbo jet :)",
				"added": 1630248764
			},
			{
				"comment_id": 38,
				"body": "would it have been long enough?",
				"added": 1630248781
			},
			{
				"comment_id": 39,
				"body": "and as always numbers may lie...",
				"added": 1630248791
			},
			{
				"comment_id": 42,
				"body": "and the baghram \"base\" could even host the foreign embassies and their staff... \nit would free great real estate in the heart of kabul (but pull the us one, it's tainted... and irrecoverable).\nand if they are embassies they wouldn't intermingle with the pious and clairvoyant population of kabul...\nand there will be a lot of free real estate...\nso then the lease could be paid by the others :)\nahahah",
				"added": 1630251541
			},
			{
				"comment_id": 43,
				"body": "win win win",
				"added": 1630251550
			},
			{
				"comment_id": 44,
				"body": "but the more I read about the current vaxx nazism in the usa, the more I want them out forever, or at least as long as they are fucking moronic infidels !",
				"added": 1630252118
			},
			{
				"comment_id": 45,
				"body": "for me it's insane for a state to believe to own the bodies of the people living within it's border... it's pure idolatery, slavery and shirksm... or what ever the word is...\n\ninjecting healthy people with an experimental treatment, coercing them etc etc... no no no no... \n\nthe big problem for me is the right to bear arms... it's fundamental ! everyone adult male should be able to open carry anywhere in afghanistan if he may wishes so... some travel from far away to visit kabul, and can't let their arms idle anywhere, who knows how long they will stay in the Captal City of the Islamic emirate of Afghanistan? \n\nmaybe the are just travelling from mazar e sharif to khandar... where to depose the arms? no way... \n\nit's trust base... and trust is build on strong armed fundation, not empty hypotethical promises...",
				"added": 1630252329
			},
			{
				"comment_id": 46,
				"body": "at least on the public domain... I mean, you want a gun free farm... good luck.",
				"added": 1630252391
			},
			{
				"comment_id": 57,
				"body": "would be nice if everything IT was on open sourced software. I propose debian as starting base... to build upon... everything. and don't forget p2p... from torrent to markets to what ever... resilient !",
				"added": 1630254791
			},
			{
				"comment_id": 58,
				"body": "dEbIAn... heheeh",
				"added": 1630254821
			},
			{
				"comment_id": 60,
				"body": "forget this shit about americans, they are killing all my friends with their coerced injection... take off in less than 2 days... bye bye and never come back\nthen find the money buy yourself some S400 or even better allow PLA to operate massive air defense system and the threat from the sky is gone, air sovereignty restored, we together wipe ISIS in a bloodfull war... and you are set.",
				"added": 1630260796
			},
			{
				"comment_id": 61,
				"body": "countdown to final evac.\ncountdown to sky seal.\n/on",
				"added": 1630264093
			},
			{
				"comment_id": 62,
				"body": "why not a joint sino russian free lease on bagrham non interference on local issues?",
				"added": 1630264124
			},
			{
				"comment_id": 63,
				"body": "if they us want to pass they will have to nuke, and so it's the end of time :)",
				"added": 1630264149
			},
			{
				"comment_id": 64,
				"body": "south of kadhar for some serious sky lockers and it's done... it move the ARC...  then you join the shanghai security cooperation... you are safe or end of the world.",
				"added": 1630264235
			},
			{
				"comment_id": 65,
				"body": "and don't forget we don't, and for real, give a shit how you live. it's not a joke, your side, our side... but we will kill on our side without hesitation if you threspass, you, your pregnant wife your infants, raze your cities, destroy everything and salt the land... I am not kidding... kindness is not weakness.",
				"added": 1630264351
			},
			{
				"comment_id": 66,
				"body": "we can , and I don't joke put 10 soldiers for any human being you have.",
				"added": 1630264407
			},
			{
				"comment_id": 67,
				"body": "and fielded like you have never seen...",
				"added": 1630264425
			},
			{
				"comment_id": 68,
				"body": "biggest industrial and manufacturing base the world has ever seen... a 2000 years old tradition of centralized managed state, morphed to WE THE PEOPLE... or we the peasants, but things have evolved pretty dramatially... say hello to the boy in space, he can't wave back, he has a schedule... very very thight... later maybe :)",
				"added": 1630264489
			},
			{
				"comment_id": 69,
				"body": "and you may have read about the fandom... a few minutes, and war spririt takes over...",
				"added": 1630264541
			},
			{
				"comment_id": 70,
				"body": "kindness toward taiwan isn't weakness... the guy from globaltimes doesn't exagerate... peaceful is better for both, time we have...",
				"added": 1630264606
			},
			{
				"comment_id": 71,
				"body": "to be simple it's china post invasion... in 200---500 years it may get softer...",
				"added": 1630264637
			},
			{
				"comment_id": 72,
				"body": "steel? soft, diamond we make them... so steel was the most comprehensible and available for the 1.4+ billion... but the flesh and bones...",
				"added": 1630264698
			},
			{
				"comment_id": 73,
				"body": "isis, 25k? with your support : 3 weeks. gone. (maybe more, and problably less) depending on the engagement...",
				"added": 1630264771
			},
			{
				"comment_id": 74,
				"body": "house 2 house whole afghanistan... no worry.",
				"added": 1630264783
			},
			{
				"comment_id": 75,
				"body": "you never saw a modern uncorrupt state at the scale of china in motion, isn't it?",
				"added": 1630264872
			},
			{
				"comment_id": 76,
				"body": "the dragon...\n\nhate us\nlove us\n\nwho cares, it's your land. there.",
				"added": 1630264904
			},
			{
				"comment_id": 77,
				"body": "but fight us\ndie.",
				"added": 1630264934
			},
			{
				"comment_id": 79,
				"body": "children in the car? americans love to kill children, but generally they rape and torture them to extract their adenochrone...",
				"added": 1630296707
			},
			{
				"comment_id": 95,
				"body": "Liberty to die as a slave of God... \nhmmm I may reach your expands end of spring, or earlier if the vaxxnazi strike force seek to make me a slave of theirs... \nor elsewhere\nanyway, I wish you a nice death, preceeeded by a sin free life..\nrmember the plants it's not a jke.",
				"added": 1630301458
			},
			{
				"comment_id": 108,
				"body": "you have everything here to make it ! it's your country, you lives, your deaths etc... suprise me, I will be as I am most always dissapointed...\nPRC didn't btw :) one of the only one... hoping there will be more one day\nwhatÅ greetings of leaving?\nI wish you the peace again? or simply : god will know ! ;)",
				"added": 1630314640
			},
			{
				"comment_id": 109,
				"body": "but I may return elsewhere.. or not :).",
				"added": 1630314656
			}
		],
		"1630132032_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 25,
				"body": "nice shot :)",
				"added": 1630247851
			},
			{
				"comment_id": 26,
				"body": "it's way more easier when as guest as as enemy... (double ases?",
				"added": 1630247908
			}
		],
		"1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 40,
				"body": ">I genuinely do not understand the Muslim point of view.\n\nDid you read the quran?",
				"added": 1630250887
			},
			{
				"comment_id": 78,
				"body": "> [gy0ugwaosrzohfmf](#comment_1_15fT5qViKSdrrocTyvmC9xdRQrgxeFtV9d):MO, a bigger issue is why so many foreigners wish to come over to the US and change it into what they left. Also, why are tiny native American groups helping them? Would like to know this before I start killing people. Always in the back of one's mind \"did I miss something\". Right now I'm pretty much certain this minority needs to die. So if you ever see news reports of Catholic or Lutheran charity workers impaled ala Vlad the impaler.....you'll know I finally cracked. Somalians belong in Somalia...... [...]\n\nA republic, if you can keep...\n\nWe kill them before they do damages in china :), they don't like it, but as they are dead, and those left behind neither, but if they trespass they die, so WDGAF :)",
				"added": 1630268675
			},
			{
				"comment_id": 111,
				"body": "> [hephaestus1](#comment_1_1AJz3WbiyB4117M2xzYUtVMpew9Xbgs2nf): You're underestimating the power of ideology. It makes people tie bombs to themselves and make suicide attacks. It makes people even starve to death. And when your mind works with the fuel of an extreme ideology, you will proceed to destroy every single thing that is trying to oppose it. Currently, the opposing ideology against this, is liberalism of the west. As someone who is living under a religious totalitarian dictatorship, I  can tell you a true believer will do anything to defend this mindset, from backstabbing its best friend, to killing its own people, even applying something cruel like scorched earth policy.Another thing is that an extremist ideology doesn't die off and decay over time, unless with the light of wisdom. Because of the poor education, bad infrastructure, and horrible economy, it's a very unlikely thing to happen. something like renaissance should happen in the middle east in order to eradicate the extremist mindset, just exactly like something that happened at the end of the medieval ages in Europe.But there's a problem. Due to geopolitical reasons, the world doesn't really want this renaissance to happen. It's good to have a poor middle east, drowning in war and economic crisis. It brings them cheap oil, arms sales and it also makes China's development programs harder.Don't underestimate strong ideology and geopolitics.\n\nthere are no poor in the liberal west and the education is of such high quality that ivermectine is a dangerous product like the mortal HCQ, or the even more dangerous zinc, vit c or d. of course, I don't defend anything nor anyone. have fun in your utopia, it's gonna be great. and btw poor doesn't mean uneducated, or uncertifited educated.... common sense, a thing you can't teach, like kindmess, humility, modesty, careing, sharing, or even loving. but me me me... have fun.",
				"added": 1630344305
			},
			{
				"comment_id": 112,
				"body": "or my favorite western ideology : epstein gang = 2 arrests.",
				"added": 1630344326
			}
		],
		"1630131159_1MFpx4Ys7jSiERD3T5Fpiv45MpNB4gAo3i": [
			{
				"comment_id": 41,
				"body": "dune the movie? again? it can't beat the book :) dune 2 the game was great :).\n\nbut is the fandom really irrational? I don't know... it's maybe an escape? but yeah completely stupid... \n\nfanclubs wars? china china...",
				"added": 1630251101
			},
			{
				"comment_id": 50,
				"body": "btw... this story of embassy in kabul made me think about Beijing... wouldn't it be great to move them closer to the airport access way to \n1. liberate precious real estate\n2. guarantee better their safety\n3 and ours :)\n\nhehehehe",
				"added": 1630254396
			},
			{
				"comment_id": 51,
				"body": "there will always be many unhappy, but in the whole scheme... I would find it super cool !",
				"added": 1630254422
			},
			{
				"comment_id": 52,
				"body": "not an eviction for them, but a transfer... imposed... move. there. end. unhappy leave.",
				"added": 1630254471
			},
			{
				"comment_id": 53,
				"body": "that would be a great occasion to improve the whole urban traffic in this area of town...not my stupidest idea...",
				"added": 1630254520
			},
			{
				"comment_id": 81,
				"body": "the editorial... \namericans ruling class rape children... some they just brutally rape and then murder, others they manipulate, condition, pay and then rape and even some murder again (no proof).\nso against such a nation, who does it in a systematic way... \nthere is imhpo no way for a peaceful coexistence and mutually beneficial cooperation.\nfundamentally child rape is a mindset, a way of thinking and behaving... \nwe see it with the covid injection (not a vaccine in the west, but a mrna injection + unknown substance (japan)) coercion. \nrepresentative democracy has been captured.\nmedias are complicit, in the rapes and financial extraction.\narmed men and \"intelligence\" are coward morons drugged on fluoride with courage weaker than mine... or simply on the take too.\nsocial cohesion / community harmony is wholly gone, bots droiding next to each others.\napart sweden and a few states inside the usa, most of the west is a single captured entity, ex england due to their throne thingy.\nthe real issue faced is Israel vs Iran... the israeli intelligence and co, are really afraid of nuclear shia... specially splinter groups, end of timers, and others on the explosive path to janah.\nthis is the core issue to address in the expansion.\nthey goyims, white europeans, are way too low iq to move forward... they are as worthless as their idols...\nthe queen of england, let thousands of british girls be drugged, raped and murdererd by foreigners in her own kingdowm... it's a state of decay...\nthe marble walls of rome hiding bricks didn't collpased, they were just removed by new builders, so surpirse of their thinnesss... \nillusion is the stronger with the one who has the less... or as the arabs may say :\nthe mirage will be more vivid the thirstier you are :)\nwhat can be done?\n\n1. a putin... aka kill team feed up and ready to execute a kodorvsky, drinking/siping a \"coke\"... but the decay hasn't reach them, furthermore contrary to putin teams, who all are BORN AND RAISED RUSSIANS... the americans rulers can just shift immigrants or second generations dumb enough (like the indian fbi girl during the take over / regime change of trump)... \n\n2. war and invasion...\n\nor this kind of things...\n\nthey are super well entrenched, the muppets are so dumb, they would even be happy to get one of their children raped by an \"elite\" as a chance, like a sports ball runner... to tell you the decay... and worst they will even forget the next day... \n\nbut believing they are doing mistakes, is maybe the gravest of them all...\n\nAs said as long as the enemy is alive, even in what will reveal to not only appears as a trap of their own making, they remain to be killed... and the trap that got them, could be even more problematic or render it specially difficult...\n\nhe who jumps in the viper next, is in a sense protected from his old enemies, by making for himself new ones, stronger than his older ones... if you get the idea.\n\nand the worst thing is that men like alex jones (the evangelist crowd, aka fake, hyprocrites, greed and money seeking imperialists ready to kill anyone but pretending the contrary) will have to experience the annihilation... of everything they knew to revert to a cooperative mindset..\n\nnuking austin for example may wake him, but seeing then houston and dallas gone may do it...\n\nit's their non violence that allows what they call the \"devil\" to flourish in their midst and then annoy us, like a small fly... as long as they don't bite, and it should be possible to capture the fly with enough care to release it to the outdoors with the proper training...",
				"added": 1630298060
			},
			{
				"comment_id": 82,
				"body": "seriously, I surrender... \"black market breast milk\"... they better have a great explanation to not get all killed...",
				"added": 1630298128
			},
			{
				"comment_id": 83,
				"body": "the virus is spreading again to china...",
				"added": 1630298138
			},
			{
				"comment_id": 84,
				"body": "there is no election in germany, as speech is censored, it's impossible for the voters to make their own minds hearing arguments from different sides and chose a path...\n\nremember \"refugees welcomed, germans kicked from their appartment, girls raped\" say anything > censored, jailed, or psychiatrized... why? no opposition is tolerable to the will of the party, the WEFp... and UNOp... and then a wolf female fat and old would of course be a good dummie to show the fools, to make them believe... that germany has changed... have you been fooled?",
				"added": 1630298280
			},
			{
				"comment_id": 85,
				"body": "I don't give a f with nuclear mullahs going MAD... but some very powerful entities really fear for their own lives...",
				"added": 1630298316
			},
			{
				"comment_id": 86,
				"body": "what are they using the australian lockdowns for? I found a funny picture : us school board girl, imposes masks on others, goes to party with out... consequences? none.",
				"added": 1630298371
			},
			{
				"comment_id": 87,
				"body": "us foreign policy failed in afghanistan because it became a reflection of their own beings.\nquran stronger than us corruption for some, 3% enough to defeat king of england.",
				"added": 1630298425
			},
			{
				"comment_id": 102,
				"body": "on the other hand their army is made of trannies, they won't be able to withstand daily 100k death, they have lost all wars they have entered... with a good FS / NR program it won't be so hard to wipe them :). what's your opinion on the jewish state? I mean factually, historically, and militarily they own israel, however as said once uncle sam is or exploded or imploded they won't be able to withstand the alliance... curious to see how it will play out. but it's sure that once 4 time us real gdp is overmatched and then doubled again and again, they will be dwarfes... and I mean usa... and their so called alliance... who will really fight for pedos, scammers and corrupts leeches of D.C. if already they can't arrest more than 2 pedos, or release ivermectine... what are they. at least japan has broken ranks... important. I hope this last island problem can be resolved too peacefully, to really usher a new era of peace... it's yuge to forgive them while not forgetting, what they did... I a m not sure I could.",
				"added": 1630312496
			},
			{
				"comment_id": 126,
				"body": "what really perturbates me : one side : they can go to the moon, on the other they can't arrest more than 2 pedos in epstein file... I mean... How to prevent that downfall to happen to china.\n\nthat's it... IDK.\n\nbut it's dramatic. or maybe it's me who has been brainwashed for years with usa usa usa and can't realize yet how an illusion all it was all along and since columbus... bringing sex slave children? true or false? I guess it's true... so it tells the wickedness of the whole civilization, which as such must perish.",
				"added": 1630349642
			},
			{
				"comment_id": 127,
				"body": "free the world men! but don't occupy it ! let it be, but cleanse the filth.",
				"added": 1630349666
			},
			{
				"comment_id": 132,
				"body": "the real question, if there is no more gaming...\n\n : the dating scene of china !\n\nwe are the midst of the turmoil...\n\nat least, safe dating environemnet, not like in the west where if you don't have teh money to isolate, the world has become a small place...\n\nand the IT is totally occupied by the LEOs who farm and use and abuse... \n\nneofeudal small bourgeoisie... even worst, their goons...",
				"added": 1630350045
			},
			{
				"comment_id": 133,
				"body": "vermin itself.",
				"added": 1630350052
			},
			{
				"comment_id": 134,
				"body": "I have the big regret that CPC didn't already crushed and obliterate western forces, wordwide...  0 left alive. beyond total victory, just : the world has been liberated at great sacrifices, now be free, you little morons round eyes stupidos...",
				"added": 1630350140
			},
			{
				"comment_id": 135,
				"body": "make us proud or we will pass again :)\n\nwhere does this pharaonic non performance unmeritocratic come from? abuse by a few astute?\n\nsad...\n\nso lame...\n\nso weak.... \n\nso unresilient, reliable, unperforming...",
				"added": 1630350209
			},
			{
				"comment_id": 136,
				"body": "the outer worlds (tm).",
				"added": 1630350219
			}
		],
		"1629964430_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 47,
				"body": "congrats for finding it and using ivermectine !!! what is the west doing !?!",
				"added": 1630252840
			},
			{
				"comment_id": 48,
				"body": "the daoyhu and you are setup for the future...",
				"added": 1630252876
			},
			{
				"comment_id": 49,
				"body": "it will annoys the rogue province... ahh they will be surprised...",
				"added": 1630252917
			},
			{
				"comment_id": 59,
				"body": "how much would it cost to bribe all national politicians across the west if you have 10% of 30 billions dollars to do so + a lot of media propaganda for the low iq...",
				"added": 1630255542
			}
		],
		"1629910533_18sXfWjdTFrNQW8wAV1bdwJ5evxCZciveV": [
			{
				"comment_id": 54,
				"body": "trump allowed fauchi and the one no one talk about : brix...\nand when a mic drop in the earlier days, a joke would have been made, why so serious?",
				"added": 1630254703
			},
			{
				"comment_id": 55,
				"body": "deborah...",
				"added": 1630254725
			},
			{
				"comment_id": 56,
				"body": "debie...",
				"added": 1630254729
			},
			{
				"comment_id": 110,
				"body": "you just have the country you deserve, mr alex jones.",
				"added": 1630344186
			},
			{
				"comment_id": 123,
				"body": "I wouldn't have said it, but who this taiwanese bitch is? and before I could click here, she was already spewing her BS... nuke this island, and a warning to those who want to live to leave...",
				"added": 1630349397
			},
			{
				"comment_id": 124,
				"body": "the infowars think thank... stratford,... guys... you are the laughing stock of the world, and later you will understand why we laugh at you...",
				"added": 1630349432
			},
			{
				"comment_id": 125,
				"body": "your big boys, at the cia, fbi, dia, nsa, can't arrest more than 2 pedos... what else? you can buy yourself 14 billion aircraft carriers, if that already, arresting more than 2 pedos, is beyond your \"strategic thinking\".... yeah.... you lost. and you are lost.",
				"added": 1630349494
			}
		],
		"1630267315_19GAZbMhpKZtzLDL86SgaiHQbRNdahgoUj": [
			{
				"comment_id": 80,
				"body": "don't listen to this fool, if you want to learn something about coding, you can do it where ever you wish, he is just afraid that you will see him in fbi/state department job, and not as the imaginary fairy tell he is selling himself...",
				"added": 1630296848
			}
		],
		"1630296649_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 88,
				"body": "> [styromaniac@kxoid.bit](#comment_46_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Why do you keep creating new IDs?\n\nhow much do you earn per minute? it's funny that my taxes pay you :) it's not worth it, you should be eliminated.",
				"added": 1630300937
			},
			{
				"comment_id": 89,
				"body": "and if we can't do it the legal way, it will be the market way...",
				"added": 1630301007
			}
		],
		"1630085187_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 90,
				"body": "woot woot love rocket attacks on american forces... they have portable missile defense still? i hope there was some farming... \nso c-ram are lighter than I though... \nit's sad this nwo\nto have to kill so many to reach their layers sought...\nbut as the layers are the shells of those\nthe shell must perish for the hearth to die.\nfree men are a dying breed, they all prefer to serve in the creation rather than the creator, \nand even fight for such privilege, to end in graves soon to be forgotten...",
				"added": 1630301212
			}
		],
		"1630300883_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 91,
				"body": "alex is with the wef/uno...",
				"added": 1630301271
			},
			{
				"comment_id": 92,
				"body": "he loves money...",
				"added": 1630301280
			},
			{
				"comment_id": 93,
				"body": "american",
				"added": 1630301287
			},
			{
				"comment_id": 94,
				"body": "anyway who cares... have fun drones...",
				"added": 1630301352
			},
			{
				"comment_id": 96,
				"body": "maybe to not get angry? as psychological reaction self defense reaction? I mean who like to have others dictate what they do with their own body? \n\nordered to be \"jabbed\" lol...",
				"added": 1630301738
			},
			{
				"comment_id": 97,
				"body": "wear your collar...",
				"added": 1630301751
			},
			{
				"comment_id": 98,
				"body": "but for example for years he attacked btc...",
				"added": 1630301765
			},
			{
				"comment_id": 99,
				"body": "years",
				"added": 1630301771
			},
			{
				"comment_id": 100,
				"body": "anything he could to foster usa... attempted hegemony in reality... who knows... to be nuked.",
				"added": 1630301793
			},
			{
				"comment_id": 101,
				"body": "when you can't find the nail in the hay stag, burn in and blow the hashes...",
				"added": 1630301826
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 103,
				"body": "priviet ! thanks a lot !\nfor me it's really important to check vit d specially soon, increase vit c, see what alcohol depletes (from terrain theory in the sense that toxic (alcohol, nicotines, coffeine, etc) to be metabolized deplete part of the \"stock\" of micro nutrients, as such to have a well nourish population is key to increase resistance...).\nIvermectine, I think the debate is close, be it india or japan, what's cool is that it offers an easy pathway to natural immunity, same as hcq pushing zinc into cells...\nmaybe I will reach the russian border, maybe not... not that easy anymore :(.\ngl&hf !",
				"added": 1630312740
			},
			{
				"comment_id": 104,
				"body": "sadly it contradicts with facts on the ground...",
				"added": 1630312925
			},
			{
				"comment_id": 105,
				"body": "do you have at least non mrna vaccine? without mercury or aluminium not grown on peanuts cells (lol, this one... it's terrible, I knew someone who has allergic... it's not spetznaz ready :)...",
				"added": 1630313134
			},
			{
				"comment_id": 114,
				"body": "I am sorry but there need to a clarification. Or those suckers can do their facistic coercition, I guess, they want to be good behaving members of the Davos club, or Putin is lying and back them, or there will need to be a refresh of some who forgot who rules the former soviet union... \nthere is a good concept I like in mgmt it's peter syndrome.. guys getting a job to difficult for them (knowledge or personal) and who rather than go a step lower, to climb back later, prefer to cling, and as such compromise the whole organization... it can be a ceo, or a micro chief.\nwhat we seem to see... those corporate \"bosses\" go against Putin common sense, and the clever science I proposed there, which is logical biologically.\nwho is the fucked in this story? me.\neasy answer.\nI would be the CEO of russia (aka putin), omg those suckers whould be visiting and breaking rocks already over the ice, and thanking me every day that their families still live modestly, it would have been so grandeur of me, that I even would have impressed myself :)",
				"added": 1630344944
			},
			{
				"comment_id": 119,
				"body": "time for a restructuring... my guess is that they intermingled in the vakay with the davos crowd, and just want to be in... I am trendy, I coerce vaxx my workers, like you.. heheheeh hehehehe... putin can't go there... ahhaha.",
				"added": 1630346357
			},
			{
				"comment_id": 120,
				"body": "funny tass doesn't report putin anti coercition (nuremberg spirit violation > aka medical fascism used by tyrannical wannabe pharaonic rulers...), we saw what \"international law\" meanings in practice : no ivermectine, zinc denied, c? what's that and vit d, toxic of course... laughable",
				"added": 1630346535
			},
			{
				"comment_id": 137,
				"body": "I didn't realize, but in short, if Putin decides the whole WEF is murdered in some clean warfare without them even realizing...\n\nSo here is my theory\n\nwe don't like vicky\n\nbut vicky is clean.\n\nshe did the classical > color revolution on a corrupt autocrat seeking wealth and money and power (see is palace)...\n\nhowever it's too be understood in the integration in the kissinger / brezinski plan...\n\nwhich is I am sure part of VTB... aka a corporato fascist world order, where VTB board goes to private islands while good russian girl working at retail small shop get the shaft.\n\nI believe a 100 people kristal night in russia and it's solved.\n\nwould be ironic for fascist to die in a krystal night isn't it? call it the silencer night... \n\nwhy they did this? \n\nappartenance... we are \"corporate over lord\" we go to \"davos\" and vakay \"with our jets to our yachts\" (poor putin can't) and ideologically there is something wicked with most CEO, they forget to respect their shareholders, and that's part of the blackrock mentality, who neither own the shares, aka they both (pension and ceo + boards) loot their shareholders and the workers... \n\n\"elitism facism cloaked in \"grethaism\"... of course the cia is too \"keeping up with the jones\" to get it... and I mean for those not hunting ben laden, while the FBI is only hateful little morons (not those tracking trailer trash criminals accross state line), while the NSA is only obsessed with neuroprograming female to please them (snowden)... while I guess \"geostar\" is panicking each minute, seeing that one minute in usa is at least 3 in china + 1 att least in productivity :) so they are living the time distortion...\n\nso what putin to do?\n\nsave the world again, what else?",
				"added": 1630381006
			},
			{
				"comment_id": 138,
				"body": "but let's start humbly... russian clean up.. and it's no small task...",
				"added": 1630381031
			},
			{
				"comment_id": 139,
				"body": "good news it's mostly those \"consummer facing business\", curiously the type where blackrock is allowed to invest...",
				"added": 1630381056
			},
			{
				"comment_id": 140,
				"body": "and we have circled back...",
				"added": 1630381073
			},
			{
				"comment_id": 141,
				"body": "I propose to throw them from tower... it will be funny :)",
				"added": 1630381089
			},
			{
				"comment_id": 142,
				"body": "the wanted to fly, they will",
				"added": 1630381110
			},
			{
				"comment_id": 143,
				"body": "what's funny is that my whole theory makes sense...",
				"added": 1630381146
			},
			{
				"comment_id": 144,
				"body": "I like the \"social\" component of it...\nand how it's humiliating for them, as in it they are just little children who saw \"nike\" shoe and wanted the same, but this time it's \"jet\" or \"yacht\" in the carabeans or where ever they hide this time...",
				"added": 1630381224
			},
			{
				"comment_id": 145,
				"body": "I said vtb but it's maybe the clean guy, or the one appearing clean to provide cover to his merry band below... the plot tickens? they better, because if Kremlin get the conspiration, life expectancy can become shorter than the duration of a snowflake on a summer day on the south facing roof of the kremlin...\n\nso rather than waste time : is nudelman involved in this gmo poison experiment? I would say no... she is though girl... she doesn't poison, she wages war ! clean wars.",
				"added": 1630381389
			},
			{
				"comment_id": 146,
				"body": "clean war in the sense that even without letting the corpses for example in dombass decompose it's possible to rebuild... no nukes, clean front lines, no ABC... I mean a great girl !",
				"added": 1630381463
			}
		],
		"1630314029_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 106,
				"body": "reminder : some create, other by extracting reallocate to allow new creation... and the cycle goes...",
				"added": 1630314261
			},
			{
				"comment_id": 107,
				"body": "So I think I have said everything I wanted to say... I wish you all the best... ! and to those I may see on the other side, it was I hope for you informative to read some of my opinions, I regret to have waste so much of your time and not being able to have syntezied it all. the others you won't be missed... to be protected from them by God, what ever they are (ended) or (jailed, hell etc), what a relief... only God can really \"wall\" them... that we be safe again. safe to be free, safe to love again.\n\ngreetings of leaving.",
				"added": 1630314514
			}
		],
		"1630302539_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 113,
				"body": "> [papull](#comment_47_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): There is no scam. Get your jab.\n\nof course thake the 3rd, and 4th and die ! it's sad but... yeah. what's fun is that cops and leos and intells and military let their own family die or suffer from \"covid19\" when there was treatment available, ahh yeah what EUA? something too complex, certainly. How many cops / former intel have 400m yachts? ahhh yeah too small to land their private jets :) you are dumb... what's cool is that sooner or later there maybe a true preatorian guard... maybe a few real humiliating defeat, you know men of honor and war... but better I guess to beat unarmed peaceful people aware of what is going on, isn't it? for a meal... at least it's not selling \"the Christ\", but who knows what the judgment of God will be... \n\nyou did your call , made your deeds... enjoy them",
				"added": 1630344537
			}
		],
		"1630344696_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 115,
				"body": "my big regret, is that I agree there are many many (in billions) useless eaters. secondly, they are irrecoverable. but I wouldn't kill them, I prefer to let them die by themselves. because I believe that it's not because their parents are morons uselss braindead muppet dependent aberhation state whoreshippers nazis watching ball games, that their children are the same. and so it's condemnation to the promise of mankind... I don't believe hereditary \"performance\" but on REAL meritocratic one\n\nand so the real question\n\nwhat do with all those western cops, intell, military? I mean they are useless... completly, structurally, morally, ethically, they are useless eaters with batons (when they are in a good mood)... terrible.. not capable of arresting more than 2 pedos... I mean... it's lame... performance wise. that must be eliminated. I am sorry for them, but that level of malfesance is really big, yuge... \n\nanyway...\n\nGod is Real... such power :)",
				"added": 1630345595
			},
			{
				"comment_id": 116,
				"body": "trust in God\nnot in gov",
				"added": 1630345688
			},
			{
				"comment_id": 117,
				"body": "ahh and vicky nuland? still want her kaghnagat?",
				"added": 1630346205
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 118,
				"body": "so 4th? yeahhhhh.... so stupid :).... no 3rd no certificate? hooo too bad... I udnerstand idea... it's comical... for a state at war specially... tragic--- vaxx will make you free... booohhh boooohhhh say the wisest :)",
				"added": 1630346285
			}
		],
		"1630349248_1Avop7FK7FLVvKV3jyxwyR57ib9d4NSZbF": [
			{
				"comment_id": 121,
				"body": "just up your vit D level, how many could have been given a few more years to live? and for a cost, so cheap....",
				"added": 1630349304
			},
			{
				"comment_id": 122,
				"body": "a micro pile of zinc... nothing fancy, how much prolonged?",
				"added": 1630349336
			}
		],
		"1630084537_1BTNSTXS2TJ9kadazhS8Nb2tNRoxQZm4Pv": [
			{
				"comment_id": 128,
				"body": "trooodot troooodot... one day... vengeance will be so harsh on your kind, that happy, you will be, to die.",
				"added": 1630349729
			},
			{
				"comment_id": 129,
				"body": "and frankly, please hide, it will make it even more interesting... where is the beast...",
				"added": 1630349805
			},
			{
				"comment_id": 130,
				"body": "and just for the lulz you plug the \" le dominion\" to usa or france to get result wanted backed by fascist collaborating medias? hahaha.,,  we know your kind... worthless...\n\nmarket needs regulation from market authorities, not politicians, like in china...\n3h... \n\nweek,...\n\npla better open recruting centers :)",
				"added": 1630349917
			},
			{
				"comment_id": 131,
				"body": "it's gonna be so tense...\nand mothers of china thank... ah sorry. wrong post who cares... white trash.",
				"added": 1630349950
			}
		]
	},
	"comment_vote": {}
}