{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "KopyKate BIG v0.2.0 RELEASED - Video sharing platform for ZeroNet",
			"body": "KopyKate BIG v0.2.0 Released\n&nbsp;\nhttp://127.0.0.1:43110/big.kopykate.bit\nhttps://github.com/misses-robot/kopy-kate-big\n&nbsp;\n- Added video manager (videoBox)\n- Added video editor\n- Improved, fully-dynamic navigation and searching\n- Improved mobile CSS\n- Site written from scratch using easy-to-read coffeescript (it is not a clone of ZeroUp, but both use big files.)\n\n\n**Beware of clones of this zite claiming to be the creators and asking for donations.** \nKopyKate BIG will never ask you for donations. If you want to throw money away, please donate to the creators of ZeroNet at https://ZeroNet.io/\n&nbsp;\n\nIf you like the site, please remember to star KopyKate BIG at ZeroSites under the Video/Image category (not the WebTorrent version in Services!).\nhttp://127.0.0.1:43110/sites.zeronetwork.bit\n&nbsp;\n\nMore renovation work to come. In the meantime, Merry Christmas!",
			"added": 1514076756
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"2_1Hv2SAkcMHkNRHTsdLZ6jg8neGtCZrTEr2": [
			{
				"comment_id": 1,
				"body": "It is wrong. It's like letting a 3-year-old use alcohol and drugs. Alcohol and drugs aren't wrong perse, but are known to cause harm in minors.\n&nbsp;\nKids having sex with adults is child abuse, as is letting kids (and I mean actual kids, not 17 year olds) use drugs and alcohol.",
				"added": 1514076613
			},
			{
				"comment_id": 2,
				"body": "> [nekololi](#comment_6_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): like i stated, the author does not seem to know what he's talking about. he states things like \"Pedophilia as explaind in the definitions section of this page is sexual attraction to prepubescents. This is defiened as a mental disorder.\" and then goes on to say \"Pedophilia in my eyes can be either illegal or legal.\"\n> In a first world nation with any semblance of human rights, having a mental disorder, or having a sexual attraction to something simply can't be illegal, so if pedophilia can be \"legal or illegal\" then it's very difficult to understand what the author thinks pedophilia is.\n> is it a sexual attraction to children?is it expressing to other individuals one's sexual attraction to children?is it the act of an adult having sexual contact with children?is it the act of viewing possessing child pornography?\n> without a clear, consistent definition, you can't say whether something is moral or immoral, legal or illegal, right or wrong. without that definition, it's not really possible to have a conversation or a debate about anything.\n\nIt shouldn't be illegal to be a pedophile. It should remain illegal for adults to engage in sexual acts with children under 16.",
				"added": 1514082684
			}
		]
	},
	"comment_vote": {
		"7_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}