{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Videos e rede social?",
			"body": "Pessoal, existe (ou é possível criar) redes como o YouTube ou Facebook aqui?",
			"added": 1469306408
		},
		{
			"topic_id": 2,
			"title": "Pro pessoal que usa Linux/Ubuntu",
			"body": "Pessoal, como faço um backup das minhas informações do ZeroNet? No ZeroMail diz \"PS: To keep your identity safe don't forget to backup your data/users.json file!\", mas não consegui achar esse arquivo. Caso eu alterar o sistema essas informações ficam salvas? O método de montar site aqui roda em qualquer sistema?\n\nObrigado",
			"added": 1469402125
		},
		{
			"topic_id": 3,
			"title": "Problema no ZeroTube",
			"body": "Pessoal, tentei adicionar um video clip no ZeroTube semeando pelo WebTorrent, mas sempre que saio da página e volto acaba falando \"0 Peers\". Como faço aparecer que tem peer mesmo que não esteja conectado no ZeroNet?\n\nhttp://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/?/watch/131/53dd0f7429418b67ad271236e1a23c7dc1e583c9\n\nhttps://instant.io/#53dd0f7429418b67ad271236e1a23c7dc1e583c9",
			"added": 1474325988
		},
		{
			"topic_id": 4,
			"title": "Coloquem links do WebTorrent",
			"body": "Imagino que vocês já conheçam a tecnologia do Webtorrent (www.webtorrent.io), então estou criando esse tópico para que vocês possam postar seus links.\n\nSpace Oddity - Chris Hadfield:  https://instant.io/#53dd0f7429418b67ad271236e1a23c7dc1e583c9\n\nMr. President - Kim Dotcom (Internet Archive):  https://instant.io/#cfb319474645bb02dd277d80c9acc0680e364561",
			"added": 1474393266
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1_1GBFNqaegBHBeWJ5u2erKu3795Q47nzEZz": [
			{
				"comment_id": 1,
				"body": "Desde que descobri a possibilidade de existir uma internet p2p (com o projeto Maelstrom) eu gostei da ideia na hora. Agora uso o ZeroNet porquê roda no linux. Acho que falta um equivalente ao Facebook e Youtube aqui.",
				"added": 1469308429
			}
		],
		"1_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": [
			{
				"comment_id": 2,
				"body": "> [sirenyc](#comment_41_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Alguma coisa ta vindo ai! =D\n> http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:85:ZeroMe:+Status+report\n\n:)",
				"added": 1469366726
			}
		],
		"1_1FeNBiaUNUNJpVSCF1HMdy6mJdQvuPzoLt": [
			{
				"comment_id": 3,
				"body": "Desde que o pessoal continue acessando, os sites torrents daqui são basicamente imortais.",
				"added": 1469401926
			}
		],
		"2_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": [
			{
				"comment_id": 4,
				"body": "Alguém me explica como abrir a porta 15441? Estou seguindo as instruções para fazer manualmente mas não tem jeito.",
				"added": 1469411234
			},
			{
				"comment_id": 5,
				"body": "> [ggmoreira](#comment_1_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh): O arquivo irá estar dentro da sua pasta pessoal no linux, e lá terá a pasta ZeroNet-master, o arquivo data/users.json fica solto na pasta. O pessoal do reddit tá aconselhando guardar esse arquivo em um pendrive encriptado, ou encriptando(sendo altamente recomendado encriptar) o arquivo com o truecript ou com o veracript e upar em alguma nuvem. Outros usuários aconselharam a guardar em mais de um lugar. Qualquer coisa to ai.\n\nProcurei (em todas as pastas do programa) e não achei esse arquivo em lugar nenhum.\nPode me ajudar no negocio de abrir porta? Quero colocar um blog aqui. Já entrei nas configurações do roteador, o UpNP está aberto mas não consegui arrumar a porta que o ZeroNet pede.\nTem alguma forma de colocar um arquivo \"zimaa\" na wiki daqui? É que tenho o Kiwix \"Wikipédia Off\" e gostaria de publicar aqui.",
				"added": 1469496192
			},
			{
				"comment_id": 6,
				"body": "> [ggmoreira](#comment_2_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh): Vou olhar no reddit e ver se acho alguma resposta.\n\nOk :)",
				"added": 1469620303
			},
			{
				"comment_id": 7,
				"body": "> [brkaka](#comment_21_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Quando você baixou a zeronet, veio uma pasta (ZeroNet/). Todos os sites que você visitou estão em ZeroNet/data/ e a sua identidade, ericksoares3, está em users.json. A lista que você vê no Zero Hello está em sites.json.\n> Então você só precisa salvar ZeroNet/data/users.json e ZeroNet/data/sites.json. O restante estará salvo nos computadores das outras pessoas da ZeroNet também.\n> A ZeroNet vai funcionar em qualquer sistema (Linux, Windows, OSX) mas só vai precisar de uma ou outra alteração. Se você quiser usar em outro SO, é melhor baixar o ZeroBundle e substituir a pasta data/ pela sua.\n\nAchei, obrigado. :)",
				"added": 1469722814
			},
			{
				"comment_id": 8,
				"body": "> [ggmoreira](#comment_3_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh): Seguinte eu fiz o seguinte para publicar meu site, eu abri a porta 15441 usando o IPtables. O comando para abrir a porta foi este: iptables -I INPUT -p tcp --dport 587 -j ACCEPT\n> Em seguida segui os passos para criação de site da própria ZeroNet:\n> \n> python zeronet.py siteCreate (Nesta etapa você salva o endereço do site e sua chave privada geradas pela ZeroNet)\n> \n> coloca o seu site dentro da pasta com o nome do endereço gerado pela ZeroNet (conforme passo acima), o local de colocar os arquivos html, css, js e demais estará na seguinte pasta 'usuário do linux/ZeroNet-master/data/endereço gerado pela ZeroNet'\n> \n> Em seguida é só assinar o site com o comando python zeronet.py siteSign, colocando o endereço do seu site afrente do comando separado por espaço, e em seguida ele irá pedir sua chave privada, pronto.\n> \n> Só acessar seu site com o endereço http://127.0.0.1:43110/ seguido pelo endereço do site gerado no passo 1.\n> \n> \n> Mals pela extensão da resposta mas não conheço seu nivel de conhecimento em informática. Qualquer coisa posta ae.\n\nColoquei esse comando no terminal e deu: \n\"iptables v1.6.0: can't initialize iptables table `filter': Permission denied (you must be root)\nPerhaps iptables or your kernel needs to be upgraded.\"\n\nDepois coloquei esse comando \"/usr/bin/sudo /bin/su -\" e quando deu root coloquei o do iptables novamente. Não apareceu nenhum aviso de alerta, mas mesmo depois de reiniciar o ZeroNet e o pc a porta não abriu.\n\nNão tenho conhecimentos altos de informática, mas posso aprender e a ZeroNet me é muito interessante.",
				"added": 1469724681
			},
			{
				"comment_id": 9,
				"body": "> [ggmoreira](#comment_4_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh): Primeiro de tudo roda a atualização do seu terminal: sudo apt-get update\n> Após, copie e cole esse comando no terminal: sudo iptables -I INPUT -p tcp --dport 15441 --syn -j ACCEPT\n> E em seguida esse: sudo iptables -I INPUT -p udp --dport 15441 -j ACCEPT\n> Esse 15441 representa a porta que você quer abrir, esqueci de colocá-lo na última explicação. Testa os comandos acima e me diz o que deu.\n> Pra saber se a porta 15441 foi realmente aberta você tem que rodar o comando: sudo iptables -L\n> Se aparecer esta mensagem:\n> Chain INPUT (policy ACCEPT)target     prot opt source               destinationACCEPT     udp  --  anywhere             anywhere             udp dpt:15441ACCEPT     tcp  --  anywhere             anywhere             tcp dpt:15441 flag\n> A porta foi aberta e você conseguirá publicar seu site. Lembrando que para seu site ser publicado você tem que assinar os arquivos html, css, js que você colocou na pasta ericksoares3/ZeroNet/data/seu site, com o comando:\n> python.py siteSign e o endereço do seu site. Pra rodar este comando você tem que acessar pelo terminal a pasta do zeronet conforme o brkaka ensinou abaixo.\n> Assim você poderá acessá-lo tanto por proxy's externos, como o proxy https://bit.no.com:43110/seu site, como pela própria zeronet pelo endereço, http://127.0.0.1:43110/seu site. Qualquer erro posta ae.\n\nFiz o update, coloquei o comenado e foi isso:\n\nerick@erick:~$ sudo iptables -I INPUT -p tcp --dport 15441 --syn -j ACCEPT\n\nerick@erick:~$ -I INPUT -p udp --dport 15441 -j ACCEPT\n-I: comando não encontrado",
				"added": 1469734629
			},
			{
				"comment_id": 10,
				"body": "> [ggmoreira](#comment_5_1DSoqCXNkqv7yJNXiF6YoaeK2bW8BFt2gh): Tem como repetir esses passos tirando print? Põe as imagens no imgur para que eu possa ver se esqueci de mencionar algo ou qual o possível motivo de estar dando erro.\n\nAqui: http://imgur.com/a/s6sVE",
				"added": 1469923463
			},
			{
				"comment_id": 11,
				"body": "> [gu5t4v0hm5i1v4](#comment_6_1PAo8TcX1nQGNtFRAKirp1uAoTt3btNdti): minha recomendação é você salvar sempre os arquivos soltos que ficam dentro de ZeroBundle/ZeroNet/Data para poder restaurar seu usuário único. Os arquivos que você tem que salvar são estes/home/jerry/ZeroBundle/ZeroNet/data/cert-rsa.pem/home/jerry/ZeroBundle/ZeroNet/data/GeoLite2-City.mmdb/home/jerry/ZeroBundle/ZeroNet/data/key-rsa.pem/home/jerry/ZeroBundle/ZeroNet/data/sites.json/home/jerry/ZeroBundle/ZeroNet/data/users.json\n\nFeito",
				"added": 1474325858
			}
		],
		"1_1CpD9pJGi6NgHTJvp9ag9HtmvXow5XHebE": [
			{
				"comment_id": 12,
				"body": "Uma parte do futuro imagino que seja essa tecnologia: webtorrent.io",
				"added": 1474326707
			}
		],
		"3_19a377ARxUgjzrFjWAN2JPDEEnEZzDShSK": [
			{
				"comment_id": 13,
				"body": "> [greatagain](#comment_10_1GMhZGJsYFtB9DDF1DzBvYiGu6bGiYeiDx): Você não pode sair da página, esse é o único meio de semear o que você upou. Quantos aos peers, eu acredito que deva ser algum bug - pois isso também acontece comigo.\n\nÉ que a página fala que se deixar semeando no WebTorrent você pode sair. Eu faço isso, mas só o instant.io continua. \"If you add one please think of adding it to your webtorrent desktop and keep it open. You can then seed the videos even if your zeronet app is not running and you can check how many people is viewing/seeding your video.\"",
				"added": 1474379584
			},
			{
				"comment_id": 14,
				"body": "> [greatagain](#comment_12_1GMhZGJsYFtB9DDF1DzBvYiGu6bGiYeiDx): As pessoas que estão de seed no instant.io (Space Oddity) estão usando outros clientes bittorrent:http://s12.postimg.org/t7rmi0hwd/image.png\n> Eu havia tido um problema similar anteriormente, tanto que comentei com o sirenyc@zeroid.bit sobre isso. Reporte esse problema ao lola@zeroid.bit (dev do zerotube), pois talvez ele possa te ajudar.\n\nOk, obrigado.",
				"added": 1474473475
			}
		]
	},
	"comment_vote": {}
}