{
	"title": "ExR-eport",
	"description": "Informationsseite der ExRaucher (IG)",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1501961188,
	"post": [
		{
			"post_id": 7,
			"title": "VapeAttack Faktencheck – Es wird aufgeklärt und Lügen werden aufgedeckt",
			"date_published": 1501961022.694,
			"body": "Immer wieder überlegen wir, wie wir zu einer besseren Aufklärung der Öffentlichkeit über das E-Dampfen beitragen können. Die Dampfer, die sich in verschiedenen Communitys im Internet bewegen, sind leicht zu erreichen, aber sie sind nicht das eigentliche Ziel. Unsere Intention ist es, Menschen, die nichts über das Dampfen wissen (oder durch die Medien falsch informiert oder manipuliert wurden) und vor allem auch Raucher zu erreichen, um ihnen die Möglichkeiten des E-Dampfens näherzubringen und sie darüber aufzuklären.\n\n---\nMit den ExRaucher-Storys gelingt uns das schon recht gut. Gut 22% der Besucher kommen nicht von Seiten, die eindeutig der Dampfer-Szene zuzuweisen sind. Sicherlich mögen sich unter diesem Anteil noch etliche E-Dampfer befinden, aber es zeigt, dass die Storys auch zahlreiche „Unbeteiligte“ erreichen.\n\n\nDie Storys sind hervorragende Beispiele dafür, wie das Dampfen das Leben von Menschen positiv verändern kann. Sie zielen vor allem auf die emotionale Ebene und machen deutlich, dass es sich um authentische Geschichten handelt. Wer verunsichert ist, dem kann durch die Storys vermittelt werden, dass das E-Dampfen eine Sache ist, die funktioniert und zahlreiche Vorteile bietet.\n\nWegen der Authentizität wurden die Storys auf der Seite auch schon des öfteren dafür benutzt, den Politikern klarzumachen, dass sie über das Schicksal realer Menschen mit ganz persönlichen Lebensgeschichten bestimmen.\n\nTrotzdem ist die Reichweite noch ausgesprochen begrenzt und die emotionale Schiene nur eine Möglichkeit, die Öffentlichkeit aufzuklären. Mit der Aktion Kontra! haben wir einen ersten Versuch unternommen, unwahre und manipulative Aussagen in der Öffentlichkeit mit Fakten zu kontern. Das hatte sogar einmal Erfolg (Polizei Mittelhessen), findet aber deutlich weniger Verbreitung, als die Storys.\nDas liegt sicher auch daran, dass die Plattform ExR-eport eher als Informationsportal für die Dampfer-Szene über unsere Aktivitäten ist. Eine etwas höhere Verbreitung erleben wir, wenn wir über Dinge schreiben, die mit interessanten Schlagworten versehen sind, wie z. B. die Informationen über die Tabaksteuer-Konsultation, weil da die „Steuern“ auftauchten. Allerdings tragen diese Beiträge nicht wirklich zur Aufklärung der Öffentlichkeit bei. Auch die Kontra! Beiträge finden keine Verbreitung, die mit der unserer ExRaucher-Storys vergleichbar wäre.\n\nNun sind wir vor kurzem über einen Artikel gestolpert, der uns auf eine neue Idee gebracht hat. In dem Artikel wurde über den „Google Faktencheck“ berichtet, bzw. darüber, dass es möglich ist, Faktenchecks deutlich erkennbar und an relativ „prominenter“ Stelle in Google-Suchergebnissen zu platzieren. Dies funktioniert über eine Auszeichnung mit dem „ClaimReview-Markup“ nach schema.org. Diese Auszeichnung wurde aus aktuellem Anlass von Google zur Indizierung von Webseiten aufgenommen. International wird diese Funktion schon recht häufig benutzt, in Deutschland bislang – nach unserem Kenntnisstand – nur durch Correctiv (das ist die vermeintliche Faktencheck-Organisation, die künftig auch für Facebook nach „Fakenews“ suchen und diese als solche markieren soll). Der Faktenfinder der Tagesschau (auch kein Stück besser als Correctiv) verwendet die Funktion noch nicht, es wird aber wohl geprüft, ob es auch übernommen werden soll. Bei Zeit Online, FAZ.net und Spiegel Online gibt es ebenfalls konkrete Überlegungen, als Faktenfinder bei Google aufzutreten.\n\nIm Zeitalter der „Fakenews“ (die es immer schon gab und die derzeit vermutlich nur so stark in die Öffentlichkeit getragen werden, weil die Menschen beginnen, sich aus unabhängigen Quellen zu informieren und ein eigenes Bild zu machen, das nicht immer in das Weltbild der Herrschenden passt) ist ein Auftritt als „Faktencheck“ ein Punkt, der für größere Aufmerksamkeit sorgt.\n\nDiese Tendenz wollen wir nun ausnutzen, um eine breitere Öffentlichkeit zu erreichen.\nWas Correctiv kann, das können wir schon lange. Und wir planen damit nicht, Propaganda in irgendeiner Form zu generieren, wie es die „wohltätigen Faktenchecker“ dieser Organisation tun (im Vorfeld der Bundestagswahlen haben sie sich offenbar auf die Fahne geschrieben, bestimmte Parteien in Misskredit zu bringen… ob aus eigenem Antrieb oder im Auftrag… um das zu erahnen, muss man die Alukappe aufbehalten oder abnehmen, je nach Gusto).\n\nSucht man aber nun (selbst mit einem frischen, bereinigten Browser und unüblicher IP, um die Filterblase zu vermeiden) z. B. nach den Schlagworten „Wohnungseinbrüche“ und „NRW“, so erscheint ziemlich weit oben in der Suchergebnisliste folgender Eintrag:\n\n![FC Lindner](img/Fc_Lindner.png)\n\nUnd genau so sollen auch unsere Artikel bei Google erscheinen. Wir wollen offensichtliche Lügen aufgreifen und „faktenchecken“. Diese Faktencheck-Artikel werden wir dann so auszeichnen, dass sie vom Google-Faktencheck aufgenommen werden und damit deutlich prominenter bei entsprechenden Websuchen auftauchen. Das macht zwar eine Menge Arbeit, weil man sehr sorgfältig arbeiten muss und bestimmte Formalien zu beachten sind, um bei Google nicht in Ungnade zu fallen, aber wir denken, es ist einen Versuch wert.\n\nAls ersten Artikel haben wir uns eine etwas ältere Geschichte vorgenommen. Es geht dabei um die Aussage von Herrn Christian Schmidt (BMEL) in der 145. Bundestagssitzung, wo er behauptet, das Trinken eines kleinen Liquidfläschchens führe unweigerlich zu Tod. Das ist eine Behauptung, die sich sehr gut komplett widerlegen lässt. Weil die Sache halt schon ein wenig älter ist (Dezember 2015), bringen wir die Sache im Aufhänger in aktuellen Kontext (Fristablauf zum 20.05.2017).\n\nSo oder so ähnlich werden wir versuchen, verbreiteten und immer wieder auftauchenden Lügen und Mythen entgegenzuwirken und hoffen, dass diese Informationen als „Faktencheck“ mehr Aufmerksamkeit erlangen. Es folgen also in nächster Zeit noch ein paar weiter Leichen aus dem Keller. Sofern aber aktuelle „Fakenews“ zum Dampfen auftauchen, werden wir uns darum selbstverständlich auch zeitnah kümmern.\n\nDoch ein Faktencheck, wie er z. B. durch Correctiv durchgeführt wird, kann auch unglaubwürdig wirken. Bei denen werden nämlich ständig nur „Lügen“ aufgedeckt. Ein Faktencheck kann hingegen auch unklare Behauptungen als solche kennzeichnen (und dabei trotzdem viele Fakten liefern) oder aber wirklich wahre Informationen auch als „Wahrheit“ kennzeichnen (und damit den Leser aufklären und informieren). Deshalb werden wir auch Informationen aufgreifen und „faktenchecken“, die der Wahrheit entsprechen.\n\nAuf jeden Fall ist das eine Möglichkeit, die Wahrheiten über bestimmte Aspekte der E-Dampferei öffentlichkeitswirksamer zu streuen, denn auf „Faktenchecks“ steht man derzeit einfach. ￼\n\nFür unsere Faktenchecks haben wir eine weiter Plattform aufgesetzt, weil wir auf bestimmte Formen achten müssen und weil es sinnvoll ist, dies von ExR-eport getrennt zu machen. Die Faktenchecks findet Ihr unter\n\n[VapeAttack Faktencheck](http://vapeattack.xraucher.org/)\n\nWir werden auf die Checks aber jeweils auch hier bei ExR-eport, in der Nebelkrähe und auch auf unseren Blogs verlinken. Je mehr die jeweiligen Faktencheck-Artikel an verschiedensten Stellen verlinkt werden, um so weiter steigt der Beitrag in den Suchergebnissen. Wenn Ihr also helfen wollt, die Sache eventuell (es ist ja nur ein Versuch) erfolgreich zu machen, zögert nicht, die Links zu den jeweiligen Artikeln (nicht zur eigentlichen Webseite) nach Herzenslust zu streuen und zu teilen. Auch dieses Projekt ist wieder völlig werbefrei und nicht kommerziell. Wir verdienen nicht einen Cent am Klick und finanzieren es aus eigener Tasche. Dahingehend gibt es also keinen Grund, mit dem Teilen zurückhaltend zu sein.\n\nIhr könnt uns aber auch helfen, indem Ihr uns auf Beiträge hinweist, die „faktengecheckt“ werden sollten… seien es Lügen, schwer überprüfbare Sachverhalte oder gerne auch wahre Informationen. Ihr könnt dies auf der Webseite VapeAttack Faktencheck mit dem Kontaktformular tun. Dort könnt Ihr uns die Informationen zukommen lassen, URLs mitteilen oder auch Beiträge als Dateien anfügen.\nDas Kontaktformular darf aber auch gerne für Feedback und Kritik (und Lob… da haben wir auch nix gegen) genutzt werden.\n\nDie eigentlichen Faktencheck-Artikel bieten keine Kommentarfunktion, damit diese „steril“ bleiben (was oftmals „seriöser“ erscheint). Wenn jedoch Bedarf an einer Diskussion zu den Beiträgen besteht, werden wir ein kleines Kommunikations- und Feedback-Forum in die Seite einbauen, das unabhängig von den einzelnen Artikeln ist, in dem aber gerne zu den Artikeln diskutiert werden darf."
		},
		{
			"post_id": 6,
			"title": "﻿2. ÄnderungsV zur TabakerzV – Ein Schritt vor und 7/8. Schritt zurück",
			"date_published": 1501960877.71,
			"body": "Es gibt nun ein [Dokument](https://archive.org/download/221117/221_1_17.pdf) mit Empfehlungen der Ausschüsse zur zweiten Änderungsverordnung zur Tabakerzeugnisverordnung.\n\nKurz zur Erläuterung: Gesetze und Verordnungen werden häufig aktualisiert und angepasst. Dies geschieht durch Änderungsgesetze und Änderungsverordnungen. Bei der TabakerzV steht nun eine zweite Aktualisierung an, bei der es – was uns E-Dampfer anbelangt – vornehmlich um Übergangsfristen und Aromenverbote (für fertige Liquids – Aromen als solche werden hier weder eingeschränkt noch irgendwie reguliert) geht.\n\n---\nZunächst sollte Menthol in allen Varianten komplett und SOFORT (ohne Übergangsfrist – im Gegensatz zu „normalen echten“ Tabakprodukten, wo eine Frist bis 20.05.2020 gewährt wurde) aus den Liquids verbannt werden.\nDies wurde nochmals überarbeitet und zumindest eine Übergangsfrist bis zum 20.05.2020 auch für Menthol in Liquids eingeräumt.\n\nUnd nun wurde dieser Entwurf in den Ausschüssen beraten und es wurde auch eine Empfehlung ausgesprochen, die das Mentholverbot betrifft:\n\nGemäß Nr. 3 der Empfehlung, soll Nummer 4 der Anlage 2 (hier steht das Mentholverbot im Entwurf) gestrichen werden. Als Begründung wurde – was wirklich ein positives Zeichen ist – den Ausführungen von Prof. Dr. B. Mayer gefolgt, der klarmachte, dass Menthol bei der Inhalation von einem Flüssigaerosol bei einem Nikotingehalt von nicht mehr als 20 mg/ml keine demaskierende, sondern eher eine entgegengesetzte Wirkung habe. Weiteres Argument für die Streichung ist die Tatsache, dass das Verbot „maksierender“ Zusatzstoffe in der TPD2 nur und ausschließlich für Rauchtabak vorgesehen ist, was sich darin zeigt, dass Menthol im Liquid in keinem anderen Mitgliedsland der EU ausgeschlossen werden soll. Dies wird in Nr. 4 und 5 der Empfehlung ausgeführt.\n\nAllerdings gibt es auch noch eine Nr. 8, die dann greifen könnte, würde das Mentholverbot fallen: Es wird eine Höchstmengenbegrenzung empfohlen. Als „Argument“ wird angeführt, dass höhere Konzentrationen (wie z. B. bei „Pfefferminz-Liquid“), um „RISIKEN ZU MINIMIEREN“, als Hauptaroma verboten werden sollten (das „Risiko“ durch Menthol wird jedoch weder genannt, noch irgendwie belegt). Es gäbe „Informationen aus der Wirtschaft“, dass Menthol als „Hintergrundaroma“ mit 0.1 % eingesetzt würde – und das wäre eine „harmlose“ Menge, die man nicht verbieten müsste.\n\nDas bedeutet, dass sie bezüglich des Mentholverbots in der Empfehlung einen Schritt vorangegangen sind, aber mit Nr. 8 wieder einen Sieben-Achtel-Schritt zurück.\n\nPositiv daran ist, dass so vielleicht etliche Geschmacksrichtungen durchaus auch über 2020 hinaus angeboten werden können. Negativ ist, dass sie die Finger nicht vom Menthol im Liquid lassen können, obwohl es keine logische Begründung für eine Einschränkung gibt. Worin das „Risiko“ durch Menthol im Aroma bestehen soll, darüber wird kein Wort verloren."
		},
		{
			"post_id": 5,
			"title": "Die Tabaksteuer-Konsultation ist „ausgewertet“",
			"date_published": 1501960584.101,
			"body": "16. März 2017\n\nSchon am 06. März 2017 waren die Daten der Konsultation ausgewertet und können nun auf den Seiten der EU abgerufen werden. Die erfassten Daten sind [dort aufbereitet](https://circabc.europa.eu/w/browse/bf54d405-2b10-4720-9f36-10bed4e4e85a). Man findet in verschiedenen Unterverzeichnissen die zusätzlich hochgeladenen Statements der Teilnehmer (die einer Veröffentlichung zugestimmt haben), sowie eine Zusammenfassung der erhobenen Daten: Statistics Export of Tobacco excise final\n\n---\nDiese Daten haben zunächst für uns erst einmal keine besondere Bedeutung, denn die Entscheidung, ob das E-Dampfen nun in die [Richtlinie über Tabak-Verbrauchssteuer[(http://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=OJ:L:2011:176:0024:0036:DE:PDF) aufgenommen wird, steht auf einem anderen Blatt.\n\nTrotzdem sind die Daten recht interessant.\n\nZunächst dürfen wir festhalten, dass die Beteiligung der Privatpersonen bei 95.2 % lag. Handel und Industrie liegen bei gerade mal nicht ganz 3 %. Das verwundert aber auch nicht, denn es gibt schlicht viel mehr Konsumenten, als es Hersteller und Händler gibt. Der Wert von gerade mal 1.05 % von teilnehmenden Organisationen (NGO) lässt sich ebenfalls damit erklären. Denn klar, es gibt sicher noch weniger NGO, die sich um Tabaksteuern kümmern, als Hersteller und Händler in diesem Bereich.\nDie Zahlen waren also so zu erwarten, haben aber letztlich keinen praktischen Nutzen (für uns).\n\nAuf die Frage, ob man Raucher oder E-Dampfer sei, haben 72.6 % mit „Ja“ geantwortet, nur 2.88 % gaben an, weder zu dampfen, noch zu rauchen. Die verbliebenen knapp 25 %, die keine Aussage getroffen haben, mögen aus der etwas schwer nachvollziehbaren Fragestellung resultieren oder schlicht daraus, dass diese Teilnehmer einfach keine Aussage dazu treffen wollten.\n\nNun kommen wir aber zur ersten wirklich aussagekräftigen Zahl: die Anzahl der E-Dampfer. Insgesamt haben 67.69 % derjenigen, die die Frage, ob sie Raucher oder E-Dampfer seien, damit beantwortet, dass sie angaben, sie würden überwiegend dampfen. Aus diesem Blickwinkel sollte man dann auch die folgenden Daten betrachten. An der Konsultation haben überproportional viele E-Dampfer teilgenommen. Damit sollte den Fragestellern klar sein, dass dieses Thema viele Dampfer beschäftigt und sich diese auch zu Wort melden, wenn sie gefragt werden. Kein übles Signal.\n\nInteressant ist auch die Verteilung nach den Herkunftsländern der Teilnehmer. Obwohl die Konsultation ausschließlich in englischer Sprache vorlag, ist der Anteil der Teilnehmer aus Großbritannien mit 8.44 % recht gering. Gut, das mag auch dem bevorstehenden BREXIT geschuldet sein. Möglich, dass sich aus diesem Grund viele nicht mehr wirklich für kommende Regelungen der EU interessieren.\n\nDen Gipfel haben die Teilnehmer aus Deutschland mit 40.48 % erklommen. Und das trotz der „Sprachschwierigkeiten“. Mag sein, dass doch mehr Deutsche halbwegs vernünftiges Englisch sprechen und verstehen. Wir sind jetzt aber einfach mal so frech und behaupten, dass die hohe Teilnehmerzahl in den Serviceleistungen der [IG-ED e.V.](http://ig-ed.org/2017/01/ein-europa-24-sprachen-teil2/) und der [ExRaucher (IG)](http://127.0.0.1:43110/16UBJvAKNgJS3Ewfmg7VmHXGb3pz9puNuU/?Post:2:%EF%BB%BFExRaucher+(IG)+und+die+Frage+nach+den+Steuern) begründet sind, die den Fragebogen ordentlich übersetzt in Deutsch angeboten haben. ￼\n\nPolen, ein traditionelles „E-Dampf-Land“ liegt mit 23.8 % auf Platz zwei. Überrascht hat uns die Tatsache, dass Italien nur auf eine Teilnehmerquote von 5.15 % kommt, obwohl doch gerade die italienischen Dampfer ausgesprochen gebeutelt von den immer neuen Steuerideen ihrer Regierung sind. Da hätten wir mit mehr Engagement gerechnet.\n\nFrankreich (auch ein traditionelles und sehr engagiertes „Dampfer-Land“) landet mit gerade mal 2.86 % auf den hinteren Rängen und wird sogar noch von Österreich (das nur 1/7 der Einwohner von Frankreich hat) mit 3.34 % übertroffen.\n\nJetzt aber mal zum Kern der Befragung:\n\n89.88 % der Befragten lehnen eine Besteuerung von Liquids ab. Von denen, die sich für eine Besteuerung ausgesprochen haben (7.96 %) waren allein 6.18 % für eine ausschließliche Besteuerung von nikotinhaltigen Liquids. Die Aussage ist also mehr als deutlich: Eine Besteuerung von Liquids wird mehrheitlich nicht gewünscht.\n\nBei der Frage, wie hoch denn eine Besteuerung im Vergleich zur Tabaksteuer auf Zigaretten ausfallen solle, wenn es dennoch zu einer Besteuerung von E-Liquids käme, sprachen sich gut 85 % für eine geringere Besteuerung (davon 80.34 % für eine deutlich geringere) aus. Knapp 10 % haben keine Antwort auf diese Frage gegeben. Das mag teilweise daran gelegen haben, dass diejenigen, die keine Angaben gemacht haben, verhindern wollten, mit ihrer Aussage eventuell doch indirekt eine Zustimmung zu Besteuerung zu geben. Der Gedanke könnte einem auch kommen, er scheint aber nicht so weit verbreitet zu sein.\n\nDie Fragen zum Vergleich der Steueransetzung mit anderen Tabakprodukten ergab ein ähnliches Bild.\n\nAuf die Fragen zur Auswirkung bereits in einzelnen EU-Mitgliedsländern erhobenen Steuern wurde mit Zurückhaltung reagiert. Hier wurden sehr oft keine Angaben gemacht. 27.4% meinten es würde nicht zu sichereren Produkten führen und gut 23% meinten, diese bereits erhobenen Steuern gingen stark zulasten kleiner Händler/Hersteller.\n\nZu den Fragen der möglichen Auswirkungen einer hypothetischen Steuer in unterschiedlichen Höhen gab es erwartungsgemäß die wenigsten Antworten (die Zahl der Enthaltungen lag im Bereich um die 50 %). Das lag mit Sicherheit daran, dass die Frage von vielen falsch verstanden wurde. Es ging ja nicht darum, ob man sich solch eine Besteuerung wünscht, sondern vielmehr darum, was die Auswirkungen wären, gäbe es solche Steuern.\n\nImmerhin gaben gut 38 % aber an, dass sie für den Fall einer hohen Steuererhebung befürchten, dass viele wieder zum Tabak greifen würden.\n\nInsgesamt bildet die Erhebung ziemlich genau die Einstellung ab, die man auch so beobachten kann. Erfreulich fanden wir das Engagement der Dampfer. Was nun aber aus den gewonnenen Daten gemacht wird, wird die Zeit zeigen.\n\nEs ist auch schwierig, sich da etwas Spezielles zu wünschen, weil eine Regelung durch die EU sowohl Vor- als auch Nachteile bergen kann. Würden „vernünftige“ Ober- und Untergrenzen einheitlich festgelegt, könnte kein Land ausscheren und durch überzogene Steuern das Dampfen quasi durch die Hintertür doch beseitigen. Hohe Steuern in Verbindung mit einem Einfuhr- und Versandhandelsverbot wären dann quasi der Dolchstoß für das E-Dampfen im betreffenden Land. Es besteht aber auch die Gefahr, dass von der EU so hohe Sätze festgelegt werden, dass es zum Nachteil aller Konsumenten in der EU wäre.\n\nIm Endeffekt hatten wir alle also eh nur die Wahl zwischen Pest und Cholera.\n\nAber trotzdem… wir haben zumindest von einem Recht, dass uns eingeräumt wurde, Gebrauch gemacht und wir haben unsere Meinung zu Ausdruck gebracht. Der Rest liegt nicht mehr wirklich in unseren Händen."
		},
		{
			"post_id": 4,
			"title": "Speakers‘ Corner – Dampfer sprechen frei!",
			"date_published": 1501960368.772,
			"body": "Wir alle (wir Dampfer) kennen es:\nEs erscheint mal wieder ein Artikel übers Dampfen und wir lesen ihn gierig und finden mal wieder eine falsche Darstellung, sei es nun eine falsche Annahme zur Community, und handfeste Lügen.\n\nNatürlich wollen und sollten wir das richtigstellen, und zwar öffentlich, also nutzen wir die Kommentarfunktion und hier wird‘s meistens tricky.\n\n---\nEntweder das Medium bietet gar keine Kommentarfunktion oder der Kommentar wird nicht freigeschaltet oder es sind keine Links erlaubt oder aber es wird dafür ein Abo verlangt (kostenlos oder kostenpflichtig) und jede Menge Daten, die wir einfach nicht hergeben wollen.\n\nDafür gibt es jetzt den [Speakers‘ Corner von ExRaucher](http://speakerscorner.xraucher.org/).\n\nDort solltet ihr den Artikel mit der [Waybackmachine](https://archive.org/web/) (archive.org) verlinken und euren Kommentar posten. Ein so erstelltes Thema kann dann jeder Dampfer kommentieren bzw. seinen eigenen nicht erschienenen Kommentar dort öffentlich machen.\n\nWir sind also nicht länger von der Zensur der Medien betroffen, die uns in ein schlechtes Licht rücken wollen.\n\nWer nach einem Artikel mit dem Titel sucht, wird auch den Speakers‘ Corner dazu finden.\n\nDie Anleitung zu Speakers‘ Corner findet ihr auf [http://speakerscorner.xraucher.org/wie-speakers-corner-funktioniert/](http://speakerscorner.xraucher.org/wie-speakers-corner-funktioniert/).\n\nBieten wir den Medien die Stirn mit einer großen unabhängigen Diskussionsplattform."
		},
		{
			"post_id": 3,
			"title": "﻿ExRaucher (IG) und die Frage nach den Steuern *** U P D A T E ***",
			"date_published": 1501960245.138,
			"body": "20. Januar 2017\n\nNoch sind vier Wochen Zeit, an der [Umfrage](https://ec.europa.eu/taxation_customs/consultations-get-involved/tax-consultations/public-consultation-excise-duties-applied-manufactured-tobacco_de) teilzunehmen. Wir sind nach wie vor davon überzeugt, dass es wichtig und sinnvoll ist, die gebotene Möglichkeit zur Meinungsäußerung zu nutzen, wie wir es im ersten Artikel ja ausgeführt haben.\n\nFür alle, die sich vielleicht vom Verfahren der Teilnahme haben abschrecken lassen, ist es eine gute Idee, sich diesen Artikel der IG-ED durchzulesen, in dem wirklich Schritt für Schritt erklärt wird, wie man vorgehen muss und der ebenfalls mit deutschen Übersetzungen daherkommt, die sprachliche Hürden zu überwinden helfen:\n\n[Ein Europa 24 Sprachen Teil 2](http://ig-ed.org/2017/01/ein-europa-24-sprachen-teil2/)"
		},
		{
			"post_id": 2,
			"title": "﻿ExRaucher (IG) und die Frage nach den Steuern",
			"date_published": 1501959808.001,
			"body": "15. Dezember 2016\n\nMitte November wurden wir auf die [Consultation on excise duties applied to manufactured tobacco for revision of Directive 2011/64/EU](https://ec.europa.eu/taxation_customs/consultations-get-involved/tax-consultations/public-consultation-excise-duties-applied-manufactured-tobacco_de) aufmerksam. Es geht dabei darum, dass die bestehende Richtlinie über die Besteuerung von Tabakprodukten überarbeitet werden soll. Notwendig wurde dies unter anderem dadurch, dass es zahlreiche „neue“ Tabakprodukte gibt, die sich nicht in die bestehende Direktive einordnen lassen, sowie die Überlegungen, auch E-Dampf-Produkte eventuell dort aufzunehmen.\n\n---\nSolche Konsultationen gibt es immer wieder einmal zu verschiedenen Themen und aus verschiedenen Anlässen, nur bekommt man davon oft nichts mit, weil es in der Öffentlichkeit nicht groß verbreitet wird. Über die Wirksamkeit einer Teilnahme kann man nur spekulieren, doch eine gewissenhafte und sorgfältige Beantwortung der Fragen und ggf. eine gut argumentierte Stellungnahme wird nicht schaden. Wer an solch einer Konsultation teilgenommen hat, hat es zumindest nicht unversucht gelassen, an einer Entscheidung mitzuwirken bzw. seinen Standpunkt klar zu machen.\n\nDie Umfrage zu den Tabaksteuern ist in der Dampfer-Szene teilweise ziemlich umstritten. Das fängt damit an, dass die Befragung (zumindest bei derzeitigem Stand) nur in englischer Sprache möglich ist. Das ist schon ziemlich fragwürdig und es gibt wohl bereits Initiativen, die versuchen, diesen Umstand zu verändern und ggf. auch eine Fristverlängerung zu erwirken.\nObwohl wir selbst keine Muttersprachler sind, war es für uns aber kein wirkliches Problem, den Text korrekt zu verstehen, um guten Gewissens daran teilnehmen zu können.\n\nDie „Sprachbarriere“ ist sicher auch ein Grund dafür, dass die Fragestellungen von einigen als suggestiv oder fragwürdig angesehen werden. Wird der Text jedoch korrekt verstanden, so darf man sich auch nicht durch übertriebenes Misstrauen dazu verleiten lassen, die Logik hinter den Fragen falsch zu interpretieren und zu meinen, der Befragte würde in eine bestimmte Richtung gedrängt. Genau solche Vermutungen oder Behauptungen waren in den letzten Wochen auch häufiger in der Szene aufzuschnappen. Betrachtet man die Fragen hingegen objektiv, so findet man plötzlich keine „versteckte Einverständniserklärung“ zu 25 oder 50 % Steuern. Lediglich die optionale(!) Frage, ob man Raucher oder E-Dampfer ist, ist aufgrund des „exklusiven Oder“ nicht sauber gestellt, da damit „Dual-User“ nicht erfasst werden können. Nun kann man die Frage einfach unbeantwortet lassen (ist so vorgesehen) oder man entschließt sich, die Option zu wählen, die für einen selbst und insbesondere in Hinblick auf die Beantwortung der weiteren Fragen besonderes Gewicht hat.\n\nDie Fragen zu „20 bzw. 50 %“ wurden von vielen Skeptikern offensichtlich falsch verstanden (so weit haben sie unser Gehirn schon gewaschen, dass wir hinter jedem Busch eine Verschwörung wittern). Es geht bei den Fragen nicht darum, ob wir lieber 20 oder eher 50 % Steuern auf das Dampfen haben „wollen“. Die Frage, ob wir für oder gegen eine Besteuerung sind, wird bereits vorher gestellt und die Auswahlmöglichkeiten sind ausreichend. Die kritisierten Fragen sind quasi eine logische Folgerung aus der Frage nach dem „ob“. Hat man nämlich zum Ausdruck gebracht, dass man KEINE Besteuerung wünscht (die Antwort ist ja möglich), dann bestünde ja die Möglichkeit, dass man sich an der Schaltstelle einen Dreck um diese Meinung schert und trotzdem die E-Dampfgeräte und Liquid in die Richtlinie aufnimmt und Steuersätze (Mindest- und/oder Höchststeuersätze) festlegt. Deshalb wird nun gefragt, welche Auswirkungen man befürchtet, sollte es zu 20 oder gar 50 % Preiserhöhung durch eine Besteuerung kommen. Es geht beileibe nicht darum, dass man für oder gegen solche Steuersätze wäre, sondern ausschließlich um die zu erwarteten Auswirkungen auf den Konsum und den Binnenmarkt. Ebenso wird erfragt, wie hoch eine Besteuerung, im Falle einer Aufnahme in die Direktive, im Vergleich zu anderen Tabakprodukten ausfallen sollte. Also auch hier werden nur die Folgen einer möglichen Festlegung von Steuersätzen abgefragt. Diese Fragen muss man nicht beantworten, wenn man sich nicht sicher ist oder wenn man dazu nichts sagen will.\n\nNun können wir es ja verraten… wir haben uns an der Konsultation beteiligt. Und wir haben es uns nicht leicht gemacht. Wir haben sehr intensiv und kontrovers (gerade auch zu den letztgenannten Punkten) diskutiert und uns als Team auf eine Beantwortung geeinigt, von der wir annehmen, dass es – so es denn überhaupt Beachtung erfährt – einen möglichst positiven Einfluss auf eine zu befürchtende Festlegung haben würde. Bis wir uns auf die Beantwortung der relevanten Fragen und auf eine zusätzliche Stellungnahme geeinigt hatten, haben wir uns intensiv mit der Thematik befasst und über unseren Weg debattiert.\n\nBereits in der Einleitung zum Fragebogen wird erläutert, dass es für eine Teilnahme nicht zwingend erforderlich ist, sämtliche Fragen zu beantworten:\n\n>„Sie können entscheiden, nur den ersten Teil der einzelnen Abschnitte auszufüllen, oder Sie beantworten beide Teile.\n>Sie können wählen, alle Abschnitte zu beantworten, die verschiedene Tabakprodukte und Probleme abdecken, oder nur zu einem einzigen Abschnitt antworten.“\n\nDas ermöglichte uns, dass wir uns ausschließlich zu den Produkten äußern konnten, die in unserem Interesse liegen, nämlich\n„elektronische Zigaretten und Nachfüllbehälter“, sowie „Liquids“. Zu den Fragen bezüglich Heat-not-Burn (HnB) Produkten, sowie zu den „klassischen“ aber auch „neuen“ Tabakprodukten haben wir uns bewusst nicht geäußert. Einer der Gründe war: „Das geht uns schlicht nichts an, weil wir E-Dampfer sind.“ Zu Tabakprodukten äußern wir uns nicht, weil wir keinen Einfluss auf die Ausgestaltung nehmen wollen. Raucher liegen uns überdies eh am Herzen, denn wir wollen sie ja informieren (u. a. durch EURE Storys, aber auch durch Aufklärungsarbeit), damit sie sich SELBST von den Möglichkeiten des E-Dampfens überzeugen. Es liegt absolut nicht in unserem Interesse, sie vielleicht durch noch überzogenere Tabaksteuern quasi „in die Arme des Dampfens“ zu treiben… die Entscheidung, es mit dem Dampfen zu versuchen, muss eine eigene und freiwillige sein. So konnten wir uns auf die relevanten Fragen beschränken.\n\nDie Frage, die sich uns recht früh stellte, war außerdem, wie wir teilnehmen sollten. Sollten wir alle als Einzelpersonen mitmachen oder als „Organisation“ ExRaucher? Fünf einzelne Stimmen sind zwar mehr als eine von einer Gruppe, aber als Team bzw. „Organisation“ (was wir ja letztlich sind), könnte man vielleicht vermuten, dass die Aussagen etwas mehr Gewicht besitzen. Zumal ExRaucher ja auch schon seit 1 1/2 Jahren auf dem Gebiet „Aufklärung“, aber auch politisch aktiv ist (in nächster Zeit werden wir auch wieder ein wenig mehr „Gas geben“… haben einiges auf dem Schirm).\nSo haben wir uns entschieden, die Fragen als ExRaucher-„Organisation“ zu beantworten und auch eine gemeinsame Stellungnahme abzugeben. Im Zuge dieses Prozesses haben wir uns auch als NGO „Interessengemeinschaft ExRaucher“ in das EU-Transparenzregister (Registriernummer: 307636025013-27) eingetragen. Das hat für uns einige Vorteile. Wir werden über Vorhaben auf EU-Ebene und mögliche Mitgestaltungsmöglichkeiten informiert, haben die Möglichkeit zu einer Akkreditierung für den Zugang zu den Räumlichkeiten des Europäischen Parlaments und definieren uns auch nach Außen als „Organisation“. Schöner Nebeneffekt ist, dass unsere Tätigkeiten, aber auch unsere Wirtschaftsverbindungen bzw. -interessen (nämlich absolut keine) für jeden und besonders auch für die EU-Institutionen einsehbar und nachprüfbar sind.\n\nHier nun unsere Stellungnahme, die wir als Anhang zum Fragebogen eingereicht haben:\n\n[Stellungnahme / Positionspapier](http://127.0.0.1:43110/16UBJvAKNgJS3Ewfmg7VmHXGb3pz9puNuU/files/StellungnahmePositionspapier.pdf)\n\nIm Zuge der Diskussion und Beantwortung der für uns relevanten Fragen, haben wir eine deutsche Version des Fragebogens (in Auszügen) erstellt. Wer Interesse daran hat, kann sich diesen für eigene Zwecke hier herunterladen, ihn dann „ausfüllen“ (PDF-Formular) und schließlich die Antworten in den Original-Fragebogen (Englisch) übertragen. Das Formular ist kein „professionelles“ Formular, sondern echt nur eine Arbeitshilfe für uns selbst gewesen… also „schnell genäht“ (nur in „technischer Hinsicht“), erfüllt aber seinen Zweck: [EU-Survey – Formular – de](http://127.0.0.1:43110/16UBJvAKNgJS3Ewfmg7VmHXGb3pz9puNuU/files/EUSurveyFormular.pdf)\n\nDurch unsere Teilnahme haben wir – unabhängig davon, ob unsere Position die Verantwortlichen letztlich interessiert – von einem uns angebotenen Instrument der Beteiligung Gebrauch gemacht. Wir können dadurch auch weiterhin in den Spiegel schauen und wissen, dass wir diesbezüglich das getan haben, was in unserer Macht steht."
		},
		{
			"post_id": 1,
			"title": "ExRaucher (IG)",
			"date_published": 1433033779.604,
			"body": "**Die Interessengemeinschaft ExRaucher / ExRaucher (IG) ist eine nichtkommerzielle Nichtregierungsorganisation zur Förderung des E-Dampfens.**\n\n---\n\n# Manifest / Vereinbarung\n\n# Interessengemeinschaft ExRaucher\n\n \n\n## ART 1\n\n**Name und Sitz**\n\nDie Interessengemeinschaft ExRaucher, kurz ExRaucher (IG), ist eine nichtkommerzielle, multinationale Organisation. Die Interessengemeinschaft ExRaucher hat ihren Sitz in 6522 Gara, Ungarn.\n\n## ART 2\n\n**Zweck**\n\nDie Interessengemeinschaft hat den Zweck der Förderung der Allgemeinheit durch Aufklärung über das E-Dampfen (Konsum von elektronischen Zigaretten).\n\nDie Ziele werden verwirklicht durch\n\n- Aufklärung der Allgemeinheit, sowie die Aufdeckung und Richtigstellung falscher Informationen über das E-Dampfen;\n- die Information von Politikern und Entscheidungsträgern über faktische Gegebenheiten, sowie neueste wissenschaftliche Erkenntnisse über das E-Dampfen;\n- das Bereitstellen von Informationsmaterial, sowie das Angebot einer frei verfügbaren Sammlung von persönlichen Geschichten über den erfolgreichen Umstieg vom Tabakrauchen auf das E-Dampfen;\n- Zusammenarbeit, Austausch und Kontakt zu Organisationen mit ähnlichen Zielen.\n\n## ART 3\n\n**Mitglieder**\n\nVita Porfido, Schweiz\nDaniel Hagemeister-Biernath, Ungarn\nBarbara Gericke, Deutschland\nRainer Tielo, Deutschland\nElisabeth Eder, Österreich\n\n## ART 4\n\n**Beendigung der Mitgliedschaft**\n\nDie Beendigung der Mitgliedschaft ist jederzeit durch Erklärung ohne besondere Fristen möglich.\n\n## ART 5\n\n**Mittel**\n\nDie für die Arbeit der IG erforderlichen Mittel werden von den Mitgliedern aufgebracht.\n\n## ART 6\n\n**Beschlussfassungen**\n\nBeschlussfassungen erfolgen in demokratischer Abstimmung. Jedes Mitglied besitzt überdies ein Vetorecht, welches im Einzelfall begründet werden muss.\n\n## ART 7\n\n**Auflösung der Organisation**\n\nDie Organisation kann in einer Mitgliederversammlung mit einer Mehrheit von 4 von 5 Stimmen aufgelöst werden.\n\nDie Organisation gilt außerdem als aufgelöst, wenn die Mitgliederzahl auf eine Person sinkt.\n\n## ART 8\n\n**Eintragung in das Transparenzregister der Europäischen Union**\n\nDie Interessengemeinschaft ExRaucher ist in das Transparenzregister der Europäischen Union eingetragen. Kennnummer: **307636025013-27**"
		}
	],
	"tag": [
		{
			"value": "ExRaucher(IG)",
			"post_id": 1
		},
		{
			"value": "Organisation",
			"post_id": 1
		},
		{
			"value": "EU-Transparenzregister",
			"post_id": 1
		},
		{
			"value": "Steuern",
			"post_id": 2
		},
		{
			"value": "EU",
			"post_id": 2
		},
		{
			"value": "Survey",
			"post_id": 2
		},
		{
			"value": "Steuern",
			"post_id": 3
		},
		{
			"value": "EU",
			"post_id": 3
		},
		{
			"value": "Survey",
			"post_id": 3
		},
		{
			"value": "SpeakersCorner",
			"post_id": 4
		},
		{
			"value": "Kommentare",
			"post_id": 4
		},
		{
			"value": "Zensur",
			"post_id": 4
		},
		{
			"value": "EU",
			"post_id": 5
		},
		{
			"value": "Steuern",
			"post_id": 5
		},
		{
			"value": "Survey",
			"post_id": 5
		},
		{
			"value": "TabakerzV",
			"post_id": 6
		},
		{
			"value": "Menthol",
			"post_id": 6
		},
		{
			"value": "VapeAttack",
			"post_id": 7
		},
		{
			"value": "Faktencheck",
			"post_id": 7
		}
	]
}