{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Kxoid (decentralized identity based on PeerMessage plugin)\n\nIt's not actually decentralized, but it's hosted somewhere on Krixano's computer.\nHaven't seen Krixano online for long time. Is the certificate provider alive now? I'm too lazy to install PeerMessage again.",
			"post_id": 2,
			"date_added": 1549464484
		},
		{
			"comment_id": 2,
			"body": "> [quantumworld](#comment_2_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I think we need to create a Zeronet user group. Similar function to what you are proposing but will deal with help questions about zeronet. Group volunteers can be anyone who has the time to participate in making Zeronet a better community for everyone.\n\nBy the way, I read the same idea on the Russian ZeroNet forum yesterday.\n\nWhat platform do you want to run it on?",
			"post_id": 1,
			"date_added": 1549514735
		},
		{
			"comment_id": 3,
			"body": "> [quantumworld](#comment_3_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Not sure what you mean by what platform. There are lots of platforms.. lol..\n\nShould it be placed here on ZeroNet? Should it run on the basis of ZeroTalk, ZeroWiki etc?\n\nI have not much time to actually help newbees, however I run [a newbee-orinted zite in Russian](http://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/). If you organize some kind of user group, I'll participate it whenever possible.\nI have plans for some articles, but haven't find any time yet. Looks like my only contribution in English is [this short article](http://127.0.0.1:43110/1BLoGBTid3NhGu8ts3fAfHJprnbrH3wfTV/?Post:42).\n\nIn fact, the need of the tightly-themed collections of information is exactly the reason (one of the reasons), why I run this set of forums. ZeroTalk is a big mess of topics, where you are theoretically able to find anything, but practically that's barely possible.\n\nIf you have or will have some articles for newbees, FAQs, etc, feel free to repost it at [this forum](http://127.0.0.1:43110/1fznc4VQbbrQAf4UzHrWS6W2mpGFqXSeD/), so there will be a collection of helpful stuff there. That is exactly this forum is for.",
			"post_id": 1,
			"date_added": 1549517060
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}