{
	"title": "营销夜话",
	"description": "ZeroNet上第一个中文营销博客",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 18,
	"demo": false,
	"modified": 1572314112,
	"post": [
		{
			"post_id": 17,
			"title": "《间谍之桥》：一部堪称谈判经典案例的电影",
			"date_published": 1572313893.958,
			"body": "商务谈判课上播放了汤姆·汉克斯主演的《间谍之桥》，这是一部掩盖在历史、剧情片类型外衣下的的谈判实战案例素材。观影前大致说了下从什么视角去观影，并且做了一些情节的点评和解析，结束后布置的作业待收起批改时觉得部分学生力有不及，大多问题在于两个方面。一个方面是把案例分析写成了影评，当然，有个别的写的还不错，可惜尚未达到能给高分的程度；另一个方面是虽然写到了跟谈判有关的内容，但只限于事件和情节的表面描述和重现，而没有理论层面的探讨、归纳和总结。\n\n---\n谈判分析一般应当强调三个要素[1]，分别是背景、人与物（也称“标的”），即谈判方在什么样的环境下、与什么人进行何种利益的分割与交易。环境对于谈判的影响很大，其中之一在于不同的环境因素会影响谈判手对于局面的判断，从而带来利益视角和分析的不同，进而影响到利益分割，利益的不同分割方案又会导致标的变化，令谈判手选择可变的谈判策略或应对策略。\n\n谈判人分为自然人和法人两种类型，但无论是哪个类型，代表谈判方去谈判的总是活生生的自然人，因而无法避免人性中的劣性和弱性。直白的说，但凡是个还喘着气儿的人，就一定有他的薄弱环节可加以利用。\n\n谈判标的可以指实物，比如在进出口销售合同中写明的外销商品，但是标的物也可能是虚拟而非实物形态存在，归根到底，这是谈判双方自身的利益。因此若能够影响对手方对同一个标的的看法和价值判断，产生有利于己方的利益变化趋势，那么这样的策略就是谈判中的优选方案。\n\n知晓了这三点，在对电影中各个谈判情节的理解和分析上就容易把握了——汉克斯饰演的美国律师多诺万如何分割利益且与谈判对手进行交易以获取己方所欲？他的具体步骤是什么？是否有更好的途径？\n\n以多诺万与东德情报部门的负责人的最后会面为例，分析和思考的要点包括：\n\n1. 各方的利益是什么(core benefits)；\n2. 各方如何看待自己及对方的利益(perceived benefits)；\n3. 各方将如何出让己方可供交换的利益以及能从对方获取什么样的利益(exchanged benefits)；\n4. 各方如何设计和规划这个交易进程(plans to secure the benefits)。\n\n在与东德情报部门头子（公开身份是东德检察长）会面时[2]，多诺万仍然要求将美国学生一起换回，表面上的利益交换是一个苏联间谍换回一个被苏联扣押的美国飞行员和一个被东德拘捕的美籍学生。对双方利益的分析若更进一层，则可知美军飞机的机密已销毁，苏联情报部门因担心间谍招供与泄密，更希望能够抓紧时间完成交换，因此东德方面若强行扣押美籍学生带来的损失不是表面上人员交换的延迟或取消，而是苏联情报部门自认为可能带来的机密外泄威胁（虽然实际上苏联间谍尚未招供）。美军方认为自己的利益就是飞行员身上的机密信息和人员生命安全，多诺万认为自己和自己所代表的这一方的利益是美国的价值观和自己的行事准则，苏联方面认为自己这方的利益是情报的安全，东德方面认为自己的利益却不是手中攥着的美国学生，而是在东西方冷战中的独立和自尊。在这个环节中谈判的有三方：多诺万、苏联军方和东德情报机构，但由于二战后东德实际受制于苏联方面，谈判中就只有两方，也就是说，若存在东德和苏联之间的利益冲突，东德的利益要让位于苏联的利益。基于这样的判断，多诺万选择通过检察长秘书把己方的意图和打算告知给东德情报机构，即你们的独立和自尊现实已然不存在，因而你们手里的美国学生对于你方没有实质的作用，但如果扣押学生导致我方利益受损，那么我所代表的美国也会在人质问题上给苏联造成可预见的损失，苏联情报工作的失败将由东德情报机构来承担后果，届时你方的自尊更成问题。考虑到东德情报机构头子的面子，这个信息并未当面传递[3]，而是通过一名年青的秘书，某种意义上说，这有效的维护了东德检察长的自尊，不至于逼得狗急跳墙。\n\n影片中的其它几处谈判情节也是相当出彩，比如美国法院法官开始铁定了心要判苏联间谍阿贝尔死刑，甚至当着控辩双方律师的面称“…he’ll be convicted…let’s not play games of this, not in my courtroom. We had a date, and we are going to trial.” 显然，在法官眼中，苏联间谍损害了美国公民和国家的利益，罪不容诛，且他认识到这是美国政府机构的命令和美国社会舆论的共同要求，做出死刑判决是政治正确、法律正确的唯一选择。然而多诺万并未放弃，而是改换了一个谈判场合，从办公室这个公开场合转战到法官家中的私人环境下，进一步游说法官，从国家利益层面解释改判阿贝尔的必要性，并以自己所在保险行业来类比。全片中，这场谈判是最短的最不引人注目的，但又是全片剧情和阿贝尔命运的转折点。电影中并未过多渲染或描写法官改变心意的过程，但饰演法官的演员在眼神、动作上却相当细腻的表现出了心态的改变，特别是对镜子打领结时眼睛一瞥、抿住了嘴，说了句“nice speech”——就这一个镜头的特写所展现出来的微妙面部表情，恐怕整了容的某些中国演员们一辈子也难以企及。多诺万显然是了解私人场合下的谈判气氛与工作场合下不同，公事公办的氛围使得法官的思维只能囿于政治正确的轨道上，但在私人场合，思维打开便可容纳更多的框架和可能性，于是才有了把改判阿贝尔与为美国购买未来的保险这两个看似风马牛不相及的事绑到一起说事儿的机会(要知道法官对多诺万之前的“正常”言论也扣了顶kidding的帽子)。这场戏的精彩不止在于谈判地点的选择，也在于通过以保险业思维来劝说正统的大法官，巧妙的在心理上形成对法官的压力——法律上的问题，你我都懂，但保险这一行，我比你懂得多，因此既然死刑改活期是个保险范畴的话题，那么如何处理间谍案由我来定最符合国家的利益。法官在镜子前的微妙表情变化被多诺万看在眼中，于是他端着酒杯走近一步，给法官已经松动了的神经上再踹上了一脚：“Oh, sir, there is also the humanitarian argument(法官大人，这事还涉及到人道主义……)”，于是把这位曾经铁了心要判人死刑的法官彻底弄得没脾气投了降。这时法官的心理已经完全崩塌，只得拿过酒杯喝了一口以掩饰自己无话可说无理可辩的处境，说我得走了。\n\n此外，阿贝尔的三次谈话[4]是如何打动和影响多诺万，使其一往无前的与国家机器和社会舆论对抗？美国律师事务所的老板又是如何说服多诺万接手这个为苏联间谍辩护的烫手山芋的？仔细去思考的话，会发现精彩至极。\n\n总之，从这部影片中能够看到一名美国律师与同行为了客户的利益谈判、与公司老板为了自己的利益谈判（但谈判失败只得接手苏联间谍案）、为了苏联间谍一案与美国中央情报局、法院等组织进行谈判、为了美国国家利益和普通公民的利益与敌对国家政府及首脑谈判。在不同类型、不同层次规模的谈判中，这位美国律师是如何界定利益、如何划分利益、如何交换利益、如何最终完成自己的使命的？这是一部值得认真品味的电影，也堪称谈判的经典教科书。\n\n---\n1. 见人大出版社出版、丁建忠编著的《商务谈判（第二版）》2006年12月第2版第7页“商务谈判的构成”一节 ↩︎\n\n2. 多诺万与东德检察长会面时，检察长在接到那通关键电话前的一段劝说讲话也是在界定和划分对方的利益。在东德看来，美军飞行员对美国已无作用，东德手中扣押的美国留学生才值得多诺万去交换，如果多诺万放弃了飞行员而换留学生，就等于美国把东德从苏联的附属政权提升到与苏联一样的高度，从而间接的使东德获得了独立和自尊。 ↩︎\n\n3. 影片中东德检察长接到重要电话离开，多诺万苦等一个小时后只能在办公室外的走廊上通过检察长秘书传话，这样的沟通方式在谈判中也有最后通牒的效果 ↩︎\n\n4. 饰演苏联间谍阿贝尔的马克·里朗斯在片中的功力基本上就体现在与汉克斯的几次谈话中了，也因这几个场景中的谈判影响力所展现出的高超演技，里朗斯获得了第88届奥斯卡最佳男配角奖、第73届金球奖、第81届纽约影评人协会奖等重要奖项。\n\n原文链接：https://blog.bizedu.net/2018/05/15/Bridge-of-Spies-A-Classic-Negotiation-Textbook/"
		},
		{
			"post_id": 16,
			"title": "坐在宝马车后哭还是坐在自行车后笑——四类客户的选择问题",
			"date_published": 1570587761.595,
			"body": "人们期盼美好，因而在公开场合，大多数人会选择表示愿意坐在自行车后笑，而少有人愿意象当年《非诚勿扰》的马诺那样直言宁可坐在宝马车后哭的。我们的老祖宗几千年下来也留给我们“夫妻贫贱百事哀”的智慧古训，这不仅仅是婚姻方面的选择问题，很多时候也适用到更广泛的价值选择上。\n\n---\n商业界里经常遇到的一个选择就是，当面对许多且不同的客户时，在资源（运营、人力、财务、CEO的价值观、心情等等）有限的条件下，公司选择或放弃什么样的客户？\n\n谈到这个话题，首先涉及到的是客户的分类，也即公司的客户可分为哪几类、各自有什么样的特征。用两个指标把客户群体分为四类，这两个指标是客户与公司交易的时间长短和客户每次与公司交易所带来的利润（率），分得的四类客户分别是：\n\n1.交易时间/年限长、带来利润/回报高的黄金客户\n2.交易时间短、带来利润高的流星客户\n3.交易时间长、带来利润低的小溪客户\n4.交易时间短、带来利润低的负担客户\n\n看这四类客户的特征，公司不难得出结论，黄金客户是重中之重，而负担客户（如不能转化）应尽早放弃。然而，难决策的却是剩下的两类客户——开着宝马车的流星客户和骑着自行车的小溪客户，尤其当高学历、长得帅、出身豪门的黄金客户分分钟被一大堆市场竞争者们盯得死死的你挤足了乳沟也难以一览芳泽的情形下。\n\n马诺及一批粉丝们理直气壮的选择让很多传统捍卫者们无言以对，毕竟现实中的婚姻大多也就那样——过日子嘛，但对于在市场中厮杀的公司决策者们，感性的谈感情不如理性的讲收益。\n\n不少人眼光停留在流星客户带来的高利润回报上而放弃小溪客户，但衡量一名客户对企业的真正价值更应当纳入时间因素，与公司交易时间越长的客户，带给公司的隐性利益回报就越高。如果把客户给公司带来的全部收益分割开来，那么总的收益可以包括以下六部分。\n\n一是客户初次与公司交易带来的利润，二是多次交易带来的利润，三是客户进行交叉购买带来的利润[1]。这些均属于财务收益，也就是说，这些收益可以通过统计会计账目计算准确的数额。另外三部分属于隐性利益，包括客户因长期与公司交易，愿意容忍公司部分失误；因喜爱公司产品而自愿的向周围潜在客户宣传公司产品形成的口碑效应；以及客户不会因为产品打折而购买的低价格敏感性。这后三类之所以是隐性的，是因为它们难以通过统计财务报表来计算，也容易被忽视掉，但这三类利益回报却正是小溪客户不同与流星客户的重要特征。流星客户能为公司带来的回报往往集中在前两种，甚至仅与公司交易一次便离去。\n\n小溪客户的重要性还可以从以下角度理解。由于小溪客户与公司交易的时间长，在不断的企客接触交往中，公司收集到诸多的客户信息，有利于公司绘制出更为精准的客户画像，从而公司能够在了解客户需求的基础上为其提供更具定制化的产品和服务。这样的服务由于更贴近客户需求，并且难以为竞争对手所模仿[2]，因而能令公司有较高的竞争力和定价自由。从长期来看，小溪客户对公司的回报是越来越大且会带来稳定的、可预期的现金流，而流星客户却因为交易时间短，与公司无法形成关系性交易，令公司失去为他们精准画像的能力，不利于公司面向这类客户展开定制化营销，而当流星客户离开后，为满足同样的需求与其它公司达成交易时，又是在为公司的竞争对手“添砖加瓦”，削弱了公司的市场地位。如果考虑到初期为吸引客户所投入的成本，可以说公司在流星客户身上恐怕赚不了多少。\n\n如果马诺是个有经验的公司决策者，不知她会与客户一起去看流星雨，还是陪客户坐在溪边静看细水长流？\n\n---\n1.例如顾客购买了华为的手机后觉得品质不错，后又购买了华为的家用路由器、平板电脑等产品 ↩︎\n\n2.在短期内难以被对手模仿也是企业核心竞争力的重要特征，因而可说小溪客户有利于企业核心竞争力建设"
		},
		{
			"post_id": 15,
			"title": "未来的教育模式将向哪里去：中国的企业能抓住这个机会吗？",
			"date_published": 1497448942.234,
			"body": "记得在做MITOCW项目志愿者之前，自己就对承载于互联网的教育产生了兴趣，认为其将颠覆当时的教育模式。那个时候，周围的人还不会或不习惯于用PPT授课，而我就已经将课件和学生作业搬上了网络。要说当时这样的做法纯粹是源于对未来教育模式的追求或远见，不如说是自己那时有着一腔共享的精神和对互联网自由的追求。\n\n---\n接触到MITOCW项目并与相关的组织合作了较长的时间后，我慢慢的觉得中国大陆在引入西方的教育方式的同时却很少能够将真正的共享精神一并吸收入髓，具体表现在两个方面：一是仍旧采用自上而下的管控方式指挥着学习者的学习，而勿论这些满怀希望而来的学习者们是否属于自己的管辖；二是仅上传下载电子材料而不太在意对知识和学习过程的分享。须知，真正的共享其实应当是将自己的体验和智慧平等平行的迁移，那种借着高一级权威管理机构自上而下的行政指令式灌输破坏了共享先天的平等性，而表面上平等的传播学习资源的行为实则却是传播盗版、肆意的践踏版权，这破坏了智慧与经验的可持续传播的可能。从2004年至今整十个年头，以上的两个方面成为了一个曾在开放教育领域很有希望的组织无奈关门停转的原因之一。CORE停止前行，我虽早有预判，但在2013年下半年某日接到MIT官方的确认消息时却也有些突然感，我想，协会主席可能心有余而力不足、教育部相关专家人士和官僚或并不在意这样的教育传播模式，但其中的重要原因可能是它并没有一套完善有效的运作机制吧。\n\n在经历了自己搭建诺联教学平台的无果和目睹了众多教学类网站的惨淡后，我意识到也许在中国，只有上世纪80年代的电视大学才是最合适的模式，想要做这么大规模的项目，雄厚的资源投入不是一般人、一般的组织玩得起的。不过，好在中国的官僚教育机构们不感兴趣的事儿，能烧钱的互联网大佬们却看到了其中的吸引力， 一拨拨的钱随着搜狐视频、新浪公开课、网易公开课等铺天盖地的砸了下来，一时间，似乎连我也觉得形势一片大好，而不是小好了。只是这些烧钱的行为所看中的只是广告利益，传播教育对他们而言，无非是找到了一块可以放置广告的宣传栏，本质上和在新闻页面上挖一块空间加一段广告代码无二致。最近，一些网络新闻又告诉我，网络大佬们又开始在这一领域烧钱了，比如BAT所建设的新网站云云。可在我访问了这些网站之后，无一例外的就是觉得它们要么就是利用技术（如100.com采用的视频播发优势）、要么就是利用新的商业模式（如马云的淘宝同学）、要么就是利用既有的资源平台（如百度的学堂），综观之，这次看到的不再是广告利益，而是钱多的没地方花，必须要为企业成长寻找一个新的触发点而不得不随着西方企业的潮流找到新的投资领域而已。网易的另一篇有关腾讯试水在线教育的文章倒是在纵深方面前进了一步，它发现新平台“试图解放教师生产力”、在线教育“对于以考试为目的的内容并不具优势”，以及“技能、知识类的主动教育需求或转移到线上”，不过也仅是从商业的视角分析在线教育市场，而并没有从教育本身的视角去回答在线教育究竟应当是什么样子的这样一个实际的问题。\n\n回答不了这个实际的问题，在线教育对于目前的互联网大佬们就只能是一块令人垂涎的市场蛋糕，和其它的商业投资项目没有区别。这些互联网企业有了商业运作的能力、有了充足的金钱等资源，却仍然失去了焦点——究竟教育的未来方向在哪里、如何认识教育才能挖掘到它最大的潜力？最近Google、斯坦福都在与一个平台合作，这个平台叫Edx。本质上说，它与Udacity、可汗学院等没什么不同，但我认为，它应是当前中国国情下教育模式改革的最佳样板。简单的体验过之后，归纳以下几条明显强于国内同行的优势吧。\n\n只与名校合作，确保了一定的权威性，同时又有效的利用了名校的品牌效应和教师资源；\n\n其课程不仅仅提供视频资料，还包括配套的字幕文本、教材、学习辅助材料和练习题，尽一切可能的向传统学校靠齐；\n\n每门课均提供了讨论区，有助于营造接近现实的学校教与学的氛围，我想这是它注意到学习更深层来讲是一种“切磋”吧；\n\n学习进度的安排比较合理，充分考虑到在线学习人群的时间有限性，每门课的时间只有几周，并且单节课的时长也只有普通课程的几分之一，这样不仅让学习者更易集中精力，也更易于安排学习时间段；\n\n课程是通过考试来检验学习质量的，这就可以进行教学和学习的评估和反馈。\n\n曾记得有人写过一篇文章，其中提到了“一万小时天才定律”的话题，作者认为，天才不是天生，是通过后期持续不断的练习掌握了比寻常人更优的技能运用能力，而要在持续不断的练习中达到这一目标，作为教师或教练的一方（哪怕是自己）就要能够通过观察发现学习者的偏差并及时有效的进行纠正。这其实正是中国古代“学而时习之”、“因材施教”的理念，不过可惜的是，当前正在投资在线教育的大多数企业根本没有能理解和看透，它们要么没有与权威的学校机构进行真正的合作，要么仅在意于提供视频课程并依此来吸引人气，要么不考虑教学的进度安排与资源分配……说到底，在线教育最终要满足这些条件，还得回归人的因素，那就是教师本身，必须依靠教师才能在既有的平台上完成教育的任务。\n\nPS：好了，现在回到本文开头，我还在用PPT吗？是的，但我厌恶它，就象一些国际会议中的物理学家们一样，因为我早前已经认识到，如果命令教师必须用PPT的方式来证明自己授课的合法性，那么无异于当前投资于中国在线教育领域的烧钱企业的思维逻辑，这只会让真正的教育离教师越来越远，而离失败的商业投资越来越近。"
		},
		{
			"post_id": 14,
			"title": "Getting more rather than getting all: 《沃顿最受欢迎的谈判课》",
			"date_published": 1497062693.029,
			"body": "去年圣诞前在京东订购了此书，由于工作一直繁杂琐碎，断续的花了将近半年的时间，直到最近才凑了时间读完它。无论是作者戴蒙德还是各类宣传此书的媒体都将《沃顿最受欢迎的谈判课》定位于一本透过实践案例来介绍谈判技巧和方法的书籍，书中穿插着极多的实例，有作者本人的经历，也有作者班上学生的亲历，这些无疑都证明了本书的价值，它告诉读者谈判不能纸上谈兵，而需要在练习与实践中摸索规律、总结经验、提炼技巧。\n\n---\n我上过几届商务谈判的模拟课，一年前还为校谈判协会做过比赛辅导讲座。无论在什么情形下，我告诉学生的一条最重要原则就是实力为王，谈判的重点不在谈上，而在通过双方实力的对比进行利益的分割。然而在读完了戴蒙德的这部书之后，我意识到实力为王的思维仍然是冷战时期的遗留物，这种旧式的意识形态可能无法让学生形成真正的谈判思维定势。谈判的真正含义在于无论强弱，都可以获得更多。要获得更多，就必须将谈判视为一个连续的长期的活动过程（相当于建立起一种基于关系的合作模式），而非基于单次的交易模式，但是，高校目前既有的谈判课程的设置，尤其是模拟和实训环节却无法完成真正意义上谈判训练所希望的能力的培养，也就是说，模拟谈判这种训练形式并不能够真正有效的锻炼学生的谈判能力和谈判思维。\n\n原因之一在于这种形式的模拟并不涉及参加模拟选手自身的或所代表的利益。谈判是要为己方或委托人争取利益，这个利益的表现形式就是谈判中涉及的双方的权利与义务，以及权责的分配方式，但在模拟过程中，通常学生可以模拟的只是一些外在的东西，例如谈判桌前的举止、谈判过程的管理与主持等等，利益本身则无法被模拟出来。因而参加模拟的学生只能间接的去猜想、去感受虚拟出来的利益，以及在这种虚拟情节下参谈当事人可能的情绪反应与决策可能性，从而令模拟的谈判缺少了某种直接性。\n\n原因之二在于选手们无法在谈判桌前充分了解所有的细节，包括真实谈判环节中的技术细节、产品细节和相关法律政策条款。在过去某篇文章中，我曾经抱怨过谈判并不应当被视为仅存于写字楼谈判桌边的交锋以及签署合同时的觥筹交错，如果谈判只在模拟与谈判对手面对面的“切磋”合同范本上的数据，或者在于对具体报价的讨价还价，那么显然这种模拟只是模仿了谈判的某个狭窄的环节的活动；如果谈判模拟者只感受和享受了合同签署的快意，那么显然这种模拟只是低劣的肤浅的模仿，它令模拟者忽视了谈判前期辛苦的准备工作和整个谈判过程中实施保障的后勤人员。实际发生的谈判，如果将之视为一个完整的过程，将也包括事前了解所有的细节的准备活动，而这恰恰是实验室环境下的模拟所无法提供的。既然如此，现有的谈判模拟训练方案又如何能够利用模拟来帮助学生达到预期的效果呢？如书中所介绍的那样，利用对方的准则进行施压的原则至少需要谈判者事先清楚的了解准则的具体内容，可当这些细节都无法获知时，我们焉能期盼谈判成功后的那杯香槟？\n\n原因之三在于真实的谈判是一个系列过程，而非单一、一次性的交锋。单一的交锋中的获胜可能导致未来对方的消极合作或不合作、甚至是报复，引发真正的失败。戴蒙德在《沃顿商学院最受欢迎的谈判课》一书中反复强调的一点是谈判应当循序渐进，己方应当换位思考，在与对方不断的沟通中扩大双方共同的利益。然而在普通的模拟谈判和谈判比赛中，这种长期性策略和长期视角所体现的素养却根本无法体现，因为比赛和短期的模拟看重的是单场的表现和结果，心怀长远眼光的选手假使考虑未来的利益就会放弃掉部分的眼下的得利，从而在谈判比赛和模拟中只能得到所谓的“最佳风度奖”。\n\n原因之四在于基于教科书的谈判模拟并不教导人进行情绪控制。虽然谈判中最重要的是利益，但实施谈判的却是人，对谈判利益进行分配的也是人，谈判中人的情绪会影响到多个方面：谈判过程中信息的收集与处理、对谈判所涉及的利益的认识、谈判形势与谈判场合的气氛等等，良好的情绪控制能力也能增进双方的信任感从而在一定程度上起到降低双方交易的成本的作用。在真实的谈判场合，情绪的波动是常见的，但在模拟和比赛的情形下，选手们往往要顾忌表演的效果从而无法将这种情绪反应展现出来，甚至会有意掩饰起来，从而令情绪控制和针对情绪的应对策略的教育无从谈起。\n\n综合来看，要真正有效的训练学生在商务环境下的谈判能力，有几点值得考虑。一是将商务谈判中的商务因素淡化，着重培养学生在谈判各个环节中的能力，这包括人际沟通能力、非语言的交流能力等。要让学生意识到，商务谈判只是谈判所有形式中的一种，但掌握了谈判的实质就可在将来的真实的工作环境下根据工作内容和需要有效的应用。基于这一点，在实际模拟用的案例选择上，可挑选更贴近学生生活学习中的例子，以使其利益更具有代表性。二是尽量将模拟用案例分割化和系列化，这是指将哪怕文字表述相对简短的案例根据其内容和情节延展开来，分成不同段的子谈判情节，其目的在于让学生不但注意单一一次的利益争取，更要关注所代表谈判方的长期利益，以及这种利益的分配和互换。三是要学生理解谈判的成功在于对规则的把握和遵守，以及谈判过程中对情绪的控制。理性的处理谈判整个过程中的各个环节——包括对手的情绪，才能更好的协同彼此的力量达到真正的双赢。"
		},
		{
			"post_id": 13,
			"title": "大数据时代的客户关系管理与维系",
			"date_published": 1497062532.087,
			"body": "企业与客户之间的关系可划分为三个阶段。\n\n---\n早期，当企业处于小作坊生产与销售时期时，其商业活动覆盖的范围小，通常就是店家走街窜巷叫卖过程中脚程所能及的范围。在这个阶段，企业的关注点在客户身上，能够根据客户的需求提供相应的产品。其后，随着生产力水平的提高、运输及物流的发展，企业逐渐将其活动的重心转移至生产和产品上来。在这个阶段，为了更好的满足客户的需求，企业需要利用市场细分方面的理论与工具、通过采集市场信息进行对不同产品生产、销售方面的活动的组织管理。在这方面所需收集的有关客户方面的信息涵盖了地理、人口等用于细分的不同变量，但这些常用的细分变量往往只反应短时间内的市场特征，这使得企业对客户的关注无法具备随时间变化的特点。在电脑、互联网等IT技术发展起来以后，企业在数据收集方面的能力极大的增强，营销方面的基本理论也随之有了改变，如“极度细分”在过去被认为是不可行、不经济的，但在生产技术改变、客户数据更详尽等的背景下，对市场的细分已经进步到了以单个客户为细分单元的阶段，企业的关注点又一次转回到客户身上。在这个阶段，企业认识到传统、常用的市场细分变量无法反映其目标客户的真实需求和变化，而能够帮助其更深的了解客户的信息来源是基于时间因素的——这也是大数据可被应用的主要方面，即通过企业与客户的交易活动历史数据来预测客户未来的购买倾向，并对其需求（水平）发展进行管理和控制，进而建立企业在市场中的竞争优势和市场地位。\n\n在大数据的背景下，传统市场营销的一些手段所依托的理论也发生了改变。了解客户需求一般通过市场调研、访谈的方式进行，基于成本的考量下，往往需要选取一个较小但足够反应整体市场特征的样本，这样做的不足之处是其数据的分析结果很难真正的反映目标分析市场的真实面，误差所带来的决策失败往往令企业难以承受。大数据理论则认为，样本越来越接近于整体，因而收集到的大数据用于分析整体市场所产生的结果离真实更近。对企业来说，除了能够收集和分析历史交易数据，还可通过增加与客户的接触点来获取更多的有关客户特征的信息，例如银行业增设ATM等无人服务终端、举办金融服务讲座等，这些由接触点所生成的信息和数据也可用于传统的市场细分。\n\n传统上，市场细分往往止于对客户需求的分类划分，随后进入到目标市场的选择阶段，但基于客户关系管理的理论，企业对通过大数据分析形成的客户认知可将其目标市场上的客户做进一步分类。通过企业与客户关系维系的时长、交易频率， 以及客户单次为企业带来的利益这两个维度，客户可被进一步分为四种类型。第一种类型的客户与企业交易持续时间长、单次交易产生的利润大，被称为黄金客户，但这类客户往往数量极少，甚至有些企业并不拥有这类客户。第二种类型的客户与企业交易历史较短、单次交易的利润比较大，被称为流星客户，易吸引企业关注，但相对而言难以获得长期的交易关系，维系的成本较大。第三种客户被称为小溪客户，虽然与企业有着长期的交易和接触，但每次交易为企业带来的利润却较少，因而易被企业忽视，尤其是在企业发展势头强劲或面对的竞争较少的情况下。第四种客户被称为负担型客户，此类客户一般只与企业维持短暂的交易关系，且单次交易带给企业的利润极少，甚至可能为负。企业应将客户关系的维系关注点转向第一类与第三类客户身上，而不能过于关注单次交易所带来的利润因素。对单次交易利润的关注可能导致企业忽视第三类客户，即那些与企业有着长期稳定交易接触的客户，从而忽视了这个群体可能为企业带来的以下潜在利益，如长期交易的客户可能为企业形成良好的口碑传播效应、长期交易所带来的企客之间的默契及由此默契进一步形成的在合作方面的低成本效应， 另外长期交易的客户更易于接受企业多元化过程中的产品、推动企业交叉销售。\n\n将企业的客户进行分类，能更好的基于客户与企业之间的关系采取不同的维系策略，并在此基础上开发客户忠诚方案和项目，以形成基于客户关系的企业核心竞争力。普通的维系策略易从经济利益，即诸如折扣、优惠等因素着眼，这类策略与手段可形成一定的客户忠诚，但较难长久与持续，也易为竞争对手模仿，对于具有较高价格敏感性的行业和客户来说更是如此。客户不断的转换企业并追求优惠条件会使企业负担增加。企业可发展的高一级维系策略着眼于企客之间的社会性利益上，也即通常所说的交情。经由长期接触所形成的客户关系能够在一定层面上抵御市场波动带来的风险，这类关系中所蕴含的企客之间的默契与情感纽带往往不易为竞争对手所模仿，也有利于建立一种超越单纯经济利益的约束因素。很多情况下，企业的老客户即属于此类，但这类老客户并不永远与企业绑定在一起，当他们因某种原因切断与企业的关系时，往往会对企业的运营造成极大的影响。获取最有价值的客户关系必须超越简单的经济与社会利益的视角，当企业能够从基于企客关系的历史数据中深入了解客户的价值链、成本结构、运作模式，并将企业自身的价值链与客户的价值链整合起来以形成某种结构性联系时，深层次的结构利益就出现了，基于这样的结构利益的客户维系策略极难为竞争对手所模仿，同时也有利于客户形成超值忠诚，逐渐向黄金客户转化。"
		},
		{
			"post_id": 12,
			"title": "TESLA为什么要在中国建充电网——深处的战略考量",
			"date_published": 1497062444.804,
			"body": "汽车之家新近报导了TESLA（特斯拉）在中国规划建设汽车充电设施网络的消息，这条消息所引发的并非是赞美与期待，大量的疑问集中在了成本方面：一是建造充电站网络的地皮费（用地成本），一是充电站的充电费用与设备维护费用。造成这些疑问的原因除了它的汽车产品尚未引入大陆市场外，主要是特斯拉是否对中国市场垄断的国情有了解。\n\n---\n特斯拉是一家具有前瞻性眼光的伟大企业，在美国早已进行了该类项目的开发和建设，有报道称它的充电网络有望在近年覆盖全美。在美国能这样玩，那是因为成熟的自由市场环境会保护甚至鼓励创新的企业，但中国大陆存在这样的市场机制吗？从这一点思考下去，现实中的两桶油和电老虎自然会给这样的想法当头一槌，更别提高昂的商业和经营性用地成本了。但是，一家经营得如此成功的企业难道会一时冲动就来到中国市场淘金或者做雷锋免费为车主们提供充电服务？如果仅仅如此，即便两桶油愿意，电老虎和地产商的收费也会令特斯拉望而却步的。很显然，特斯拉的这个举动还有其背后的战略考虑，在华建设充电设施网络是它企业战略布署中的一步棋。\n\n特斯拉的背后，还有两家企业，一家是商业火箭发射公司SpaceX，另一家是SolarCity，专门利用太阳能提供清洁能源服务的企业。从对能源的利用上看，新能源将逐步取代传统能源，但由于能源的储存、传输和转换的成本很大，旧有的能源服务企业如电力公司仍掌控了绝大部分的市场。支撑着电力公司的竞争优势并非是发电环节，而是电力网络的建设和传输网络。当电力这个产品被生产出来以后，如果不能被立即销售和消费掉，那么这部分电力就消失了，同时，为生产这部分电力而进行的生产投入也完全耗费并无法弥补。因此，电力公司面对市场上不同的能源消费需求和不同地区的消费需求，必须建立和完善能够储存和传输电力能源的网络，并在此基础上形成根据不同消费需求提供合适电力能源的协调能力，这才是它的竞争力所在。\n\n明白了以上的道理，很容易想清楚特斯拉在中国布署汽车充电设施网络的真正目的，它并不是纯粹为了替旗下的汽车产品充电，而是以此为入口建设一个早期的民商两用能源配送网络，当电力被生产出来以后，一方面可为汽车免费充电，另一方面行驶于各个充电节点之间的汽车天然的就承担起了平衡和调节各地区电力资源的作用。今后，当SolarCity的业务拓展入华时，对太阳能的利用技术与现有的充电设施网络无缝整合，特斯拉就不再需要考虑中国的电老虎和两桶油的威胁，可直接控制中国主要的能源生产和配送业务了。届时的”特斯拉“，经由SpaceX提升和保卫自己的太空能源获取技术，利用SolarCity完成民商两用的能源提供服务，而电动汽车则很可能是诸多技术领域外形成的副产品了，只不过它仍有利于公司在家庭这个封闭空间外形成一个新的社会私有环境从而制造新的产品需求（比如车载娱乐系统和通信系统）。"
		},
		{
			"post_id": 11,
			"title": "北美独立战争是如何引爆的——《引爆点》的弱关系理论视角",
			"date_published": 1497062357.036,
			"body": "历史书说，北美独立战争的第一枪是在美国列克星敦打响的，是反英国殖民统治、争取独立的开始，它奠定了北美民族解放战争胜利的基础。与此宏观层面的解释不同，格拉德威尔在其畅销著作《引爆点》一书中，将北美独立战争的发生、打响第一枪归因为基于个体因素的三个角色：联系员、内行和推销员。这三个角色构成了将一个要素或事件在相当短的时间内引爆为流行的全部内容。\n\n---\n营销理论和实践中，经常可以看到一些难以捉摸、不循常规的事件，如某个产品一夜之间变得极为流行。这似乎很难理解，格拉德威尔在《引爆点》中用三条法则解释了这种现象：第一是个别人物法则，第二是附着力因素，第三是环境威力。在这三条法则中，作者用个别人物法则来解释暇步士鞋在极短时间内直步流行巅峰的奥秘，但我认为，对这条法则佐证最精妙的一例是书中所援引的北美独立战争起源。\n\n书中认为北美独立战争的打响是由于保罗・里维尔从波士顿到列克星敦的骑马夜行——在两个小时十三英里的行进中，他将英军即将突袭殖民地民兵武器军火库的消息散布开来，使沿途各地的民兵团体得以抓住集结机会、迅速组织起来抵抗英军部队。殖民地民兵组织在康科德成功狙击英军并使战争扩大，进而形成美国历史上的独立战争。\n\n作者将里维尔的信息传播过程和效果与威廉・戴维斯的做了比对，指出两个人在同样的时间、相似的路线传播了同样的讯息，但结果却全然不同：戴维斯所传播的英军突袭讯息未能得到沿途民众的重视甚至是觉察。结果的截然不同被归结为两个人在此次事件中具备的不同角色（部分历史学家认为戴维斯所经过的市镇居民较为亲英因此不愿抵抗），具体来说，里维尔是一位“联系员”，非常善于社交。他是马萨诸塞州火灾保险公司创办人、市卫生官、规范市场管理员、萨克福县验尸官、马萨诸塞州福利协会会长， 同时他还是波士顿地区同属于五个辉格党小组仅有两个人中的一个，这使得里维尔相较戴维斯而言成为一名绝佳的“联络员”式人选。作为联络员，里维尔能够：1）方便的得到由马童送来的有关英军突袭计划的消息，2）能够明白如何最大限度的把消息扩散出去，3）更能准确的从大群人中找到与消息反应直接相关的关键人物。\n\n以上三点概念化之，就是SWT[1]理论中所阐述的内容。在Granovetter发表于1973年的这篇经典文献[2]中，他指出：（关系）结构的趋向性使弱关系具备更好的信息通达能力。网络理论认为，同质群体内因高频率的沟通而存在信息与个体特征的趋同性，异质群体则相反。那么Granovetter所指示的结构趋向性使弱关系上可依附更高的信息流动性，促使信息透过群体内部传向弱关系者，因而当马童意外获知英军情报时，最可能传给里维尔（这类人），而非他人。\n\nGranovetter引述Pool于1980年文献中对弱关系的研究（\"whether one uses weak or strong ties for various purposes depends not only on the number of ties one has or various levels of tie strength but also on the utility of ties of different strength\" 和 \"the utility of weak links is a function of the security of the individual\"），其中将弱连接规定为个体安全度的函数，即将弱关系与个体的安全保障关联起来。在低安全条件下，个体倾向于依赖强关系而非弱关系。获知英军突袭各地民兵武器军火库计划的情报后，里维尔很清楚的知道，要在极短时间里依靠农民和民兵团体组织起反抗和防御的军事活动，那么：1）情报信息必须准确传递和传达，这要求组织动员令以一种易于理解的方式被传达下去，就只能在强关系构成的组织中发生；2）动员信息能够在强关系下传播散布，因英军成功突袭与摧毁武器军火库将使殖民地民兵团体失去生存保障。基于以上两点原因，里维尔选择了与民兵武装、革命团体有关的群体散布信息，以达到短时间内的扩散效果最大化。\n\n若要弱关系在信息传播中奏效，根据该文献中所引述的Lin和同事们研究的结论看，弱关系必须与高势个体（high status individual）或节点相连。里维尔由于常骑马南下费城、纽约，北上新罕布什尔州，在各个革命小组间传达讯息与情报，必然熟识或至少认识这些小组的关键领导人物，这些小组间虽“无正式联络手段”，但里维尔却能很快定位英军突袭情报的关键反应人物，使他们组织起及时且有效的防御及反抗行动。\n\n1. Granovetter, M. 1983. The strength of weak ties: A network theory revisited. Sociological theory, 1(1), 201-233.\n\n2. Granovetter, M. S. 1973. The strength of weak ties. American Journal of Sociology,78(6): 1360-1380. "
		},
		{
			"post_id": 10,
			"title": "FBI教你读心术——写给商务谈判者的指导书",
			"date_published": 1497062290.113,
			"body": "最初听说这本书以至于搜索了它的电子版本来看只是因为它的宣传，换句话说，我被它的神秘感“色诱”了，甚至连它的目录都没浏览一下。但在读过部分之后，突然就觉得可以把此书介绍给学习谈判的人，因为谈判过程需要己方不断的搜集和分析对方的隐藏信息，而这些在谈判场合中的信息大多隐藏在对方的行为举止中——更别提老练的对方可能采用狡猾的手段来遮掩真实想法、欺骗误导你。如果说阅读这本书有什么重要意义的话，那就是可将书中的技巧和经验分析应用于（商务）谈判中对谈判对手的心理分析、把握谈判方向，以及通过在与谈判各方的非语言沟通中的姿态调整对谈判过程施加正面或有利的影响（例如通过调整自己的肢体举止营造友好互信的氛围）。\n\n---\n该书所涉及到的内容除了介绍所谓的读心术对人的分析的重要性外，还按人体各部分来详细讲解肢体的不同变化、摆放位置等所可能代表的意义，最后部分则是提醒读者读心术的非万能性，即哪怕是读心高手也只有百分之五十的正确率。作者对肢体部分的讲解是按从下到上、从隐蔽到明显的顺序进行的，分别是：腿脚、臀腹胸肩、手臂、手、脸。读后将会发现，平时自认为是表露真相的脸部却是最容易伪装的，而被桌面遮挡住的腿脚部分却恰恰最不懂骗人。\n\n说它是读心术，这个术字似乎带有一些非科学原则的巫术感，但两位作者却是从科学角度带领读者入门的。作者对读心的理解是从生物进化角度展开的，也即在人类的漫长进化中，个体已经形成了一种反应机制，这种反应机制透过生物的肌体展现出其内在的真正动机与欲求。通俗的说，即相由心生。作者指出，人希望处于一种自然舒适的状态，因而某些姿态、举止或肢体的变化和调整意味着这样的变化会令其更安全更舒服，从这样的认识着手来分辨被观察者是否说谎、是否愿意亲近你或你的话题、是否对环境中的某些要素感到不适等等。全书重要的章节也正是基于这样的认识来分别把人体分成不同的部分讲解与分析。以腿部姿势为例，若双腿交叉站立，这样的肢体行为会大大降低你的平衡性，在远古时代，这样的站姿不利于警戒和逃跑，因此大脑如果允许腿部呈现这样的姿态，那就很可能意味着这样站立者比较自信和随意，在与对方的交谈中表现出这样的站姿意味着谈话双方的亲密度较高、关系较好。\n\n该书用于培训指导有一定的权威性，基于一位心理学博士和FBI探员多年的实践经验验证而写成，在编排上也使用了不少穿插实例和图片来佐证，但是从写作技巧上看似乎仍显得有些杂乱，读过之后很难回忆清楚某个肢体行为到底意味着什么、可作如何判定。这一方面可能缘于所举的例子较多，其中不少肢体行为平时并未得到普通人的关注甚至是被忽视掉（虽然这些细支末节在FBI探员眼里都应当是破案侦察的至宝信息）。另一方面，作者在书中文末也特意提点到，通过这些行为举止来给人做定论似乎也并不一定精准，因为某特定的行为在不同的人、不同的场合、不同的心态、不同的文化背景下可能有不同的意味，且熟练的人还可能让行为举止具有欺骗性，因此读者初读此书需要综合应用加自身的实践配合以形成对全书的清晰理解就不太可能了。为解决这样一个难题，作者在最后提出了一个12条清单的指导意见以帮助读者按步实践——只是，似乎普通读者并不需要在每次谈话和交流时都假设对方是个欺骗者。"
		},
		{
			"post_id": 9,
			"title": "校园谣言生成与传播中的网络理论",
			"date_published": 1497061982.39,
			"body": "江南某高校发生的一起学生自杀事件在极短的时间内发酵并迅速流传开来。故事最后被传成了短时间内连续发生了四起死亡事件，其中最严重的一起是女学生夜归宿舍时被校园内民工劫持强奸。随后，在百度贴吧中出现了学校官方名义发布的通知，一是对真实发生的学生自杀事件做了通报，并介绍了事件过程和处理结果，二是澄清有关女学生被强奸属于谣传，称学校将与当地警方配合追查造谣者。这个事件从发生到校方发布通告大约一周时间，应当说，校方的处理有进步，也有效率，但是这样的事件本可以处理的更专业一些。这里站在一个偏学术探讨的角度写一点自己的看法。\n\n---\n自杀事件发生在校园内，尸体被发现的还算及时，校方随后的反应也比较快，虽然最终未能挽救回这条生命，但紧急处理流程包括送医、通知家长、配合警方调查等等，这些都相当的娴熟，显示出校方在应对这样事件时已有一套固定可行的框架。但是这套框架在实施时仍然显得保守和陈旧了，在通知家长后，家长及亲友到校堵了校门，并在校门放置了花圈（早期家属与校方的谈判并不顺利），校方对此的即时反应就是不得不在校门加强保卫，调派了比平时多几倍的保安力量守在校门口。这一措施未能显出更多的柔性思维，但却增加了热点（在维稳管理领域，这大概叫兴奋点）效应，给正校门附近的公交终点站乘客和进出校门的学生平添了不少想像空间。\n\n信息的传播如果不受限，沟通如果顺畅，那么当信息从双方非对等状态经由流动变化为对等状态时，是能够起到减轻因信息不对等而产生的压力和焦虑的作用的，位于信息流动两端的双方也能因而形成一致的意见和保持一致的行动理念。当自杀事件发生时，校方和学生群体这两方获得的信息是不对等的，校方并未在第一时间向学生公布案情，也并没有将调查过程随时向学生通报，在校门口增派保安人员和学生家属的行为在这个档口起到了将传播热点升级的效果。\n\n站在传统的思维范围考虑，学生群体是校方的下级，校方无须在每一事件中都向学生解释自己的行为和政策，但在现代营销理念下，学生群体被视为学校方的利益相关者或者公众，学校一方有必要考虑更专业的事件处理手法，也即与自己的利益相关者保持频繁的互动沟通，消除由于信息不对等而形成的压力和地位不均等性。很多教育界人士称，教师要把学生当作消费者，我并不赞同这样的话，因为教育如果是一种产品，那么学生除了有权利消费这样的产品，他们同时也有消费的义务，而现实中的消费者是没有所谓的消费义务的。我更倾向于认为，学生群体应当被校方视为利益相关者，因为学校的行为、政策等会影响到学生的利益，同时校方自身利益也会受到学生群体的影响。在该高校处理这起自杀事件的前期，可能并没有过多关注来自学生群体的焦虑，到了中期，当学生群体有了较明显的反应时，如在百度贴吧、微信空间、微信群等场所发布消息，校方（或疑似校方人员）的处理也仅仅是在贴吧删贴封号，一些要求学生不得传谣的话也来自于未能公开身份的ID，换句话说，即使是到了该事件的中期，校方也没有真正的和学生进行沟通，反而令学生对于那些站在校方立场上的ID产生了明显的厌恶，有些学生称这些ID为五毛。在这期间，校方本可以以官方身份发布通告以稳定学生群体的情绪，至少是把事件说清，但它又一次错过了时机。我并不太相信有关女生被强奸的传闻是与学生自杀事件同时发生，从某种意义上说，正是由于这样的信息不透明提供了更骇人听闻的传闻及谣言的产生和传播。\n\n从理论上来解释，在一个组织内部通常有两种信息传播途径，正常的官方途径或者称为正式渠道，和非正式的非官方传播途径，后一种非正式的传播途径往往传播效率更高，因为它没有固定的通道，不象官方正式的传播方式那样必须按组织架构一级一级来走，而是利用一切正式或私人的传播途径发散出去，这也导致了平常我们所说的“小道消息”传播的更迅捷更广泛的结果。自然的，当校方作为官方渠道的发声源并没有及时通报和公布相关信息，信息自然就以不受限的方式从非正式渠道传播开去，并且在这样的路径上自行演变，最终变成短时间内死了四名学生，其中一名女学生被校园里的民工强奸的谣言。谣言一旦形成，若不加制止，就会在非正式渠道中反复传播，进而三人成虎、孟母三迁（好在家长们还比较理智，未因传播中的消息叫学生转学）。\n\n事件发生约一周后，校方的通报终于出现在百度贴吧，虽然没有公章，也未见到校方新闻网站发布这则通报，但至少官方通报的本身就给了学生们一个喘息的机会。我对之前在微信群里认为校方无须发布申明和通告的同事说，现在才是尘埃落定了。事件的处理基本到了这儿就算结束，在我看来，结局还不算差，至多是引发了学生的恐慌和抱怨，有心的校方管理层人士也许在将来类似的事件处理上手段会更“顺滑”，也更专业。不过，若更进一步想一想此类事件的根源，也许还可以看到更多。\n\n前面讲了信息的传播模式是从不对等到对等以减轻非对称信息带来的压力，但这种处于不同类型群体间的不对等又是如何影响和作用到群体的呢？在一个组织中，特别是那类流动性并不算高的组织内部，不同特征的、类型的群体共存。由于这些群体因自身的不同掌握有不同的信息，信息在群体内部具有一致性，或者趋于一致，而不同群体之间的信息则具有相异性，这种相异会推动信息从一端传播到另一端的群体。如果把整个组织视作为一个网络，那么当上述的传播流动发生时，处于两个群体间的节点必然不会很多（否则这两个群体经由频繁的信息流动慢慢趋同就会近似为同一个群体了），信息的流动只能通过网络中群体间的桥接点（network bridge）到达另一端，这种情况下，信息传播的有效性和准确性无疑在很大程度上受到这些桥接点的影响。当这些桥接点出现故障或带有桥接点自身加工过的信息因素时，信息的传播和反馈就会出现错误或误差，对整个组织产生不利的影响。在现实的这次事件中，从上述网络理论得到的启示是，校方与学生群体之间的距离比较大，也就是存在明显的结构洞（structural holes），特征差距明显（因而信息不对称性高），而桥接点过少，因而当信息流动不畅或官方未能及时通报有效信息时，信息只能经由效率更高的非正式途径，也就是那些极可能产生误差甚至错误元素的桥接点传送到学生群体，这样的情况下，学生群体中的不解、抱怨和焦虑也就自然产生了，也就是说，学生群体中的“谣”并非源自事件本身，而是事件传播不畅导致。\n\n在现实中，高校的管理体制和组织架构可能限制了学校管理层走近学生群体，也就是说，这两个不同的群体始终是处于整个学校组织网络的两端，虽然目前全国的高校不少会采用班主任制、学生信息员制等制度保障双向信息的流动，但这始终还是一种天然的自上而下的体系。要拉近这两个群体的距离，从以上分析看，增加日常信息通报、积极处理影响来自学生群体的回馈，让信息自由流畅的传播，从整体看会是一个可行的解决途径。"
		},
		{
			"post_id": 8,
			"title": "三种业务层面的一般战略",
			"date_published": 1490143643.579,
			"body": "在BCG分析过程中，企业只是在公司层面解决了一个资源分配与优化配置的问题，单个的业务单元中的产品该如何投向市场，以及与竞争者产品如何竞争的问题却仍然没有确定下来。在这一层次，也即业务层面，决策者需要用迈克尔·波特提出的三种一般性战略来找出这个问题的答案。\n\n原文转自：http://www.bizedu.net/mktg/\n\n---\n企业在业务层面可为自己的产品选定的第一种战略是基于成本考量的，主要目标是建立相比于竞争者更低的成本优势。从经济学理论可知，当企业产品可批量生产时，在一定规模范围内，产量越大，则单位平均成本就越低。因此，为了能够进行批量生产，从企业角度看，向市场提供的产品必然是同质化的，而非定制类的产品，同质化意味着企业产品的功能或主要满足的需求是一致或相似的。在市场需求类似、顾客对价格也比较敏感的情况下，企业通过以较低的价格进入市场的方式来赢得较大市场份额，继而扩大生产量（销量）、降低成本，以比竞争者更有利的成本优势占领或维持市场地位，这样的战略称为成本领先战略。不过，在实践中，成本领先战略却很容易被操作成“低价”战略，一些实业界人士误以为占领市场靠的就是低价，从而在市场竞争和博弈中一味强调价格低廉，打起价格战来。波特曾专门著文澄清，成本领先并不等同于低成本，低成本可能意味着成本足够低，但却并不一定代表了企业的成本结构更优于竞争对手；成本领先战略强调的是成本的优，而不是低，也就是说，当一家企业做到了低成本，那么这仅仅表明它的生产线运营能力和效率较高，而真正的成本领先更关注的是整体的成本结构。\n\n企业可采用的第二种战略是差异化战略，可以说，这种战略的思维与前述的成本领先走在相反的方向上，它认为市场的需求是相异的，也就是各个不同。为了满足市场上顾客的不同需求，企业就必须向市场投放满足不同需求的产品，而为了生产这些产品，企业必然只能以小规模（定制）而非大规模批量生产，这样一来，产品的单位平均成本就会比较高，它所适用的是那些消费需求多样化、对价格并不十分敏感的市场群体。这里有两点需要说明：一是目前已经出现规模定制化生产的技术，在一定的较低的成本范围内，企业可以向用户提供大批量高定制的产品，但这样的应用仍不广泛；二是差异化并不总是意味着可感知的价格敏感，有些产品单价很低，生产成本也并不高，但并不意味着这样的产品不是定制化方式生产的，如不同颜色和图案风格的圆珠笔。实施这样战略方案的企业，其利润回报和市场表现有赖于它对市场相异需求的把握，它必须了解差异化的差在哪里、异在何处。异质型需求的市场往往比较复杂，企业需要洞察表面差异后的深层次的顾客需求差异，因为推动顾客购买、实现企业与顾客之间利益交换的是顾客的需求（差异）而非产品表面的不同。只有当企业真正把握住顾客的需求差异，了解不同差异因素的重要性，才能为这些不同的差异因素配置生产资源，生产出真正满足顾客需求的产品来。例如，宝马、奔驰和奥迪都是豪华型轿车，表面上宝马的操控强、奔驰乘坐感舒适、奥迪科技感高，但宝马车主真正的需求可能是通过拥有宝马汽车凸显自己爱冒险的个性风格，奔驰车主则希望籍对奔驰车的拥有展现自己的贵族品味，而奥迪车主所看重的其实是车所代表的官气与威严感。\n\n成本领先战略在多数情况下是以牺牲（部分）顾客需求的满足为前提的，因为实际生活中，几乎不存在完全同质需求的市场，即使这样的市场短期内存在，随着环境的变化、市场的开放，也会有竞争者加入，从新的角度和方向来重构市场需求，从而使这样的市场存在变为异质型市场的可能。异质型市场是常见的形式，理论上说，企业总是可以在这样的市场上实施差异化战略，但是，由于多种因素的影响，特别是企业资源的限制，同时在多个差异化领域去满足顾客的需求并非最优选择，因此，当企业面对一个异质需求的市场，但同时资源和能力不足以在多个领域（或称为细分市场）实施差异化时，它就会在其中一个领域内聚焦资源，专门为单一领域的顾客提供产品或服务。不过，这样的战略带来的风险也是明显的，把所有鸡蛋都摆在一只篮子里，远不如把鸡蛋放在多个篮子里来得安全。在外界环境因素较为复杂、变化和竞争较为激烈的市场中，企业的业务构成单一，且专注于特定不变的战略类型，则很有可能一夜之间陷入危机。2016年4月中国政府部门突然推出跨境电商税改政策，那些专门经营境外海淘奶粉的公司遭受巨大损失，但综合产品电商如京东，则不但可以用其它部门的盈利来平衡其全球购业务下部分产品项目带来的损失，而且由于不依赖于全球购这单一的利润来源，整体业绩波动几乎没有影响。当外部环境稳定且企业资源有限时，实施聚焦战略的效果就相对明显，这种战略由于把企业全部资源倾注在单一的领域内，术业有专攻，因而会比较容易的形成顾客口碑，建立品牌声誉，令顾客感知到的专业化程度更深，顾客对于该领域产品品牌的联想和关联也更强。例如，在众泰汽车被收购前，网民们传言，众泰专为屌丝人士复刻世界级豪车而从不生产自己的汽车，这样的传言的效果就是在汽车“高仿”界，众泰拥有独一无二的知名度。\n\n虽然以上三种战略（成本领先战略、差异化战略、聚焦战略）各不相同，但聚焦战略与另外两种战略之间还是存在着一些联系的。如前所述，聚焦战略用于企业资源有限的情况下，在异质需求市场中实施于某一领域。从整个市场范围来看，聚焦战略与差异化战略一样，都是基于对市场需求存在差异的认识下，所不同的，只是差异化战略相当于在市场的多个部分同时实施聚焦战略，企业通过这样的战略同时还可以达到分散经营风险的目的。但以聚焦战略实施的单一市场部分而言，聚焦战略又很类似于成本领先战略。首先，实施这两种战略的企业可能都存在可用资源不充裕的情况；其次，在聚焦战略实施的市场区域内，需求具有某种意义上的同质性，因为如果这些需求是异质的，则聚焦战略就变成了差异化战略，即它是在不同的领域实施，为不同的顾客需求在服务了。因此，对小公司或初创企业来说，往往因资源有限而从市场的某一个较小的领域切入，通过先期占领这一小块市场建立声誉、培养客户基础，再经由良性的市场回报，不断以市场或产品两个方向拓展自己的成长空间，从聚焦走向差异化，并在不同的市场领域里根据自己的资源情况动态调整资源配置和进行优化操作，以达到可持续发展的目标。"
		},
		{
			"post_id": 7,
			"title": "把梳子卖给和尚？宝洁做得到！",
			"date_published": 1479261181.586,
			"body": "许多年前，网上有个段子，称最好的销售员能够把梳子卖给和尚，于是很多网友就不断的想，这销售员该用什么招才能让没头发的和尚（同时也可能是清心寡欲没有太多消费需求的群体）掏钱买一把几乎只能用来梳理头发的工具？这里插段片外话，我根本不认为这个题目是个跟营销有关的好题目，它过于重于术，而非道。对于这个话题，我想我实在是想不出有什么好招妙招，但是我的确知道一个相关问题的答案，而且在我看来，它堪称营销和战略领域里的经典！\n\n---\n上个世纪70年代末（实际上我觉得，这个时间往后移十年差不多）中国大陆改革开放，陆陆续续吸引进来几批外资，其中有一家在营销和广告圈里相当厉害的，叫宝洁（也就是P&G，香港那边似译为宝碱）。宝洁进大陆的时候，中国人收入相当低，产品也并不丰富，人们平时很少洗头，用的也就是普通的肥皂（民间似称为臭肥皂，差不多就是今天商场里卖的洗衣的透明皂），高档一点的好象就是装在一个小塑料袋里的海鸥洗发膏（那基本上就是今天沙宣的地位了）。宝洁是洋人的企业，这时候进中国，要是按洋人的生活品质和生产成本，那推出的洗发产品在整个大陆估计是没什么人用得起了。那么宝洁怎么办？以下为戏说（当然，你叫它短篇评话或者脱口秀也行）时间——因为我不清楚宝洁内部是否真的如我所想的规划设计，但事实是如此。\n\n根据中国普通群众当年的收入水平，是不肯在一款用于洗发的普通产品上掏钱的，可如果这款产品的作用和效用不止在洗干净头发呢？这里涉及到营销学里的一个名词“负需求”，一般来说，生病的时候，人就有负需求了，因为人会愿意为避免生病的不良感受而掏钱买药。宝洁此时向市场推出的第一款产品不是今天的沙宣、不是潘婷，也不是今天改过头换过面的海飞丝，而是一款专门用于去头屑的海飞丝。在广告中，宝洁设计了一个场景，令它看起来像是高档医院，一名穿着白褂的理发师将顾客的头发分成两边，一边用海飞丝洗发水，另一边作为对比，来展示海飞丝的去屑效果。从今天的“艺术”或“道德”角度看，这个广告实在是low的够了，可在上世纪那个年代，这招相当管用。人们普遍醒悟过来——原来我脑袋上、肩膀上的小屑小粒是病的征兆。既然是病，得治！于是，买洗发水或多或少就有了买药的意思，人们便不会太在意于海飞丝的价格了。在海飞丝横扫大陆洗发水市场的阶段，能和宝洁抗衡的不多，但依着宝洁一贯的风格，它还是强势前行，推出了不同版本的广告，比如请到女明星宁静拍的一则广告告诉观众，用了海飞丝，头上和肩上都没头屑，可以和爱人靠很近都不尴尬。又比如以年青人想进外企面试为故事背景，让广告片中的主人公在匆匆出门前也要回洗漱间用海飞丝把头屑清除掉。宁静和那个年代想进外企的年青人所代表的形象，无疑是社会上主流消费群体所关注和仰慕的，这样便从原先第一版的功能型广告进化了，与市场上同类的去头屑洗发水之间建立起了一种差异性。随后，潘婷的时代来临，这时，洗水发这一种类型的产品已然为中国大陆家庭接受，同时各大洗化类厂商也逐渐在市场上站稳脚根——虽然市场份额远不及宝洁。如果说，在海飞丝时代，宝洁几乎只有这一款产品独霸市场的话，那么潘婷时代则开启了宝洁多样化的大幕（实际上海飞丝也并不真的只有一款产品，但真正的多样化是由潘婷开始），消费者在商场中可以很容易的看到白色、蓝色、桔色、黑色等不同颜色包装、不同容量包装的潘婷洗发水，针对的是不同的功效和不同的购买角色，比如蓝色包装的主打去屑、桔色包装的主打焗油、白色包装的主打滋润效果。这样的差异化做法对宝洁的营收和市场份额是有利的，但是宝洁接下去的做法却更进一步，在它推出的广告中，女主人公一律以长发飘逸的形象出现，并突出了女性自立能顶半边天的风貌。比如它一支广告中的女主人公抛弃世俗看法，当了一名自信的飞机引擎工程师，另一支广告中的女主人公在失恋后勇敢的走自己的路，独自离开，坚信自己接下去的人生会更精彩。当伴随着中国大陆改革开放在工作岗位上成长起来的新一代女性消费者从这样的广告中寻找到了自己内心的欲望、产生了共鸣，无疑她们将很容易成为宝洁的用户，因为这时，无论是价格还是产品本身的功能都是次要的吸引要素，购买宝洁的洗发水已经带有展现自我、自信的追求的行动意义了。\n\n当广大群众对宝洁洗护产品的喜好看似已经到达顶峰不可逾越时，它又向新的领土拓进，这次是一款叫沙宣的洗发水产品。与前几款产品不同的是，沙宣的形象、广告以及价格都刻意的营造了一种高档感，特别是沙宣的广告主题总是与城市高档美容美发厅相关，这样的宣传与推广策略建立了沙宣在大陆洗发水产品中的高端地位，从而将那些收入丰厚却又不常去高档美容厅的消费群体收揽进自己的版图中来。至此，各款不同功效、适于不同收入群体的洗发水产品均已经占据了市场，在常人看来，宝洁帝位已成，疆域的扩张也许只能依靠投产其它洗护类产品了。然而，宝洁的营销战略构想还远未停留在常人的层面，它继而推出了一系列以爱护头发健康为主题的广告，其中包括这样一些故事情节，比如某女子逛商场挑选帽子时禁不住打了个喷嚏，口水鼻涕甚至病菌沾在了帽子上，当下一个顾客前来挑选这顶帽子试戴时，广告画面打出字幕——今天你洗头了吗？\n\n当一些广告界人士为这样的广告拍案叫绝时，宝洁又拍摄了同样主题的另一则广告，在我看来，这也许是宝洁洗发水的终极广告了，因为我实在想不出在这支广告之后，还能有什么样的绝佳创意。广告中，一名光头男子乘坐打开了窗户的公交车从闹市回家，回家后满身烟尘汗迹，于是他用洗漱间一块雪白的毛巾匆忙擦了一下头就准备洗澡去。这时，镜头移向那块灰蒙蒙的还在架子上晃动的毛巾，打出一条字幕——今天你洗头了吗？在我看到这条广告时，第一感觉就是想笑，因为那个光头实在太有陈佩斯或徐峥风格了，但当笑感过去，我突然想到了梳子的故事——如果宝洁能让没头发的光头买洗发水洗头，那么它是否也可以把梳子卖给和尚？"
		},
		{
			"post_id": 6,
			"title": "AlfaGo是否暴露了谷歌业务的战略走向？",
			"date_published": 1461855648.73,
			"body": "网上有争论，是否AlfaGo（以下简称“阿狗”）的技术会被应用到军事目的中去，未来可见的几年内，国家间的战争是否会交给类似阿狗这样的机器型决策系统。这使我想到，如果真有这么一天，那么谷歌在面对复杂情势的局势判定和抉择方面所掌握的技术已然超过了常人能够想像的地步，因为阿狗在这段时间和韩国围棋高手李世石的对战中展现的正是这种能力（IBM当年的深蓝在进行国际像棋对弈时基本上还靠的是穷举手段，但在围棋领域，穷举路线已经不可能了，谷歌所“培养”的是阿狗类似人类的评估现状和预测选择能力）。可是这种能力在实际应用中的发挥又有赖于对所判别情境的数据收集和筛选，那么问题来了，即谷歌经营这些年，一直在做的究竟是什么业务？当听到谷歌在研发地图、卫星、无人汽车、海底测绘等相关技术时，总有人认为，这是一家钱多的没地方烧的公司，但当我们仔细深入的想一想之后，会发现这些业务都是围绕着信息采集和数据分析这个核心的，其后，更深入一层的思考，也许会发现它的终极目的是学习和模拟人类的真实生活，并在数字和网络层面复刻。\n\n---\n世界的存在是为了人的生存和生活以及未来的发展，因此任何商业必然也是围绕着这个过程经营才有可持续发展的空间。阿狗的研发成功，恰是谷歌这些年在这个方向上努力的成果的展现（虽然下棋只是个副产品），当谷歌拥有了地球上最强大的信息采集和数据分析能力——源于用太空中的卫星、天上的Wifi热气球、地面下的光纤高速网络、海底的测绘图，以及奔跑在各处的无人驾驶汽车摄入的动态地理数据所形成的对任何角落的数据描述，再加上面对如围棋棋局这样的复杂局面的评估判断能力之后，一个类似人类的智能体系不就形成了吗？\n\n模仿或复刻人类的活动，并将之搬上网络，似乎是各大成功企业的秘诀。马云将人的商业活动搬上了网，对应于普通消费者的有淘宝、对应于企业贸易的有阿里巴巴、对应于银行信贷的有支付宝、对应于企业广告的有口碑网……直至形成了网上的经济金融帝国；扎克伯格将普通的同学关系搬上了网，继而突破了校友圈，形成了脸书今天的如日中天；张小龙在马化腾的支持下，把亲友熟人间的关系搬上了网，形成了不同与手机QQ的微信以及生态圈，在短短时间内称霸大陆社交工具领域；刘强东把人们线下购物的最重要的体验（一手交钱，一手交货，也就是迅速获取货物）搬上了网，京东送货速度之快，曾令我的同事咋舌，也同时使之从一众网商中脱颖而出，成功的在美国上市。\n\n看来，对人类生物终极的模仿得靠谷歌了。"
		},
		{
			"post_id": 5,
			"title": "市场定位流程为什么要从细分开始",
			"date_published": 1461639898.973,
			"body": "最近与Coursera上沃顿商学院市场营销概论中文版课程的学习者有一些互动，讨论市场细分在STP中顺序的话题。虽然之前写过个把博文，但专就此话题似乎还没有动过笔，于是在课程讨论区回过贴之后，也把这段尚不成熟的文字发一条博文于此。\n\n---\n一般谈战略的话，分为三个层次，其中两个层次是业务层和职能层。业务层的战略一般讨论的是三种和企业产品有关的内容，即成本领先、差异化、聚焦战略三种；职能层则是围绕企业内各部门的职能展开，如财务方面的战略、人力资源方面的战略、营销部门的战略，其中营销职能的战略就是指STP——细分、目标市场选择、定位。\n\n在业务层面上，通常涉及到要进行市场细分的话，往往是差异化和聚焦战略这两种，基本上不涉及到成本领先（至少传统上是这样）。这和对市场的划分有关，如果一个市场被认为是同质的，那么市场中的客户需求就没有差异，现实中的例子近似的有大米、普通瓶装水，而如果一个市场被认为是异质的，那么其中展现出来的就是各个不同的客户需求，现实中的例子比如汽车、服装等等。企业为客户服务，需要在成本和盈利之间找到平衡，从经济学角度说，规模化可以（在一定范围、数量内）降低单位成本，因而如果市场是同质的或可近似认为是同质的，那么企业就倾向于采用无差异的手段，可能最终形成成本领先的战略，因为传统上说，规模化的生产要求产品之间没有差异。\n\n反过来想，在应对不同的客户（群体）需求时，企业若要较好满足这些不同的需求而采用定制化的方式生产，就不能仍将市场视为同质的，而应当视之为异质型的。在异质型的市场中，企业通过生产不同的产品来满足客户不同的需求，或者说不同的客户的需求。在市场中的这些既有的已经形成的不同的客户需求群中，若一个需求被某个产品满足了，那么必定这个产品无法恰好的满足另一个需求。一个现实中常见的例子就是，在冬天保暖需求下的羽绒服产品无法在夏天满足消费者需要凉爽的需求。从生产角度来看，用于生产羽绒服的企业资源无法适配给生产比基尼的生产流程中去（供应商关系、采购、服装打样、技术人员配备、销售渠道等均不可能完全一样），那么这种定制化的生产必然无法获得如无差异化生产下的规模效应，从而会抬高单位成本。为保证企业的利润空间，资源就会为市场服务，即将其适配到应对不同的市场需求中去，而这种考量实际上就会在企业内部形成一种划分标准，用教科书上的话讲，这个标准就是细分变量，比如用性别这个细分变量来划分服装市场，可能得到男装与女装（当然也可能还包括中性服装）的细分市场，用年龄作为细分变量，就会形成童装、成人装和老年装这三个不同的细分市场。\n\n在细分完成之后，企业可能还需要进一步验证细分的有效性，比如分好的子市场是否可进入、子市场的盈利前景如何……等等，那么这就涉及到了企业将会选择哪一个或哪几个子市场进入，于是形成STP战略的第二步，即目标市场选择。通过一定的程序和标准选妥了目标市场，这个目标市场就是企业将要为之服务的客户群（需求），企业必须集中资源投入以尽可能使目标客户满意，只有客户满意，才能获得高于普通行情下的利润回报。然而，采用同样标准进行市场划分的企业很可能不止一家，当多家企业同时进入同一个细分市场时，企业能做的之一就是令消费者主观的认为其产品是不同的——哪怕其实他们没有实质上的区别，这就是定位的作用。以实例来说明，比如对豪华汽车的划分，通常是以价格作为细分变量，比如50万以上的为C级豪华车，但市场上这个价格以上的豪华车至少有三个品牌——奔驰、宝马和奥迪，于是我们看到，奔驰给人的感觉是贵族气、宝马给人的感觉是操控强、奥迪给人的感觉是官气（现在公车改革后，它突出科技感）。\n\n从上面所述综合来看，如果将战略视为企业的长期运营指导方针，那么战略的实质应当落在客户这个点上，即企业长期来看是服务于什么样的客户（需求）的。为了更好的规划实施企业的战略，企业的定位一定要准确且稳定，因而产生了对目标市场选择的要求。而目标市场的选择前提又是“百里挑一”，只有先列出百，方可挑一，因此市场细分就成为市场营销战略中的第一项工作。"
		},
		{
			"post_id": 4,
			"title": "来自慕课的挑战——一个Coursera助教的视角",
			"date_published": 1461639772.518,
			"body": "慕课是什么\n\n慕课这个词是MOOC的汉译，全称是Massive Open Online Courses，即大规模在线开放课程，目前全球有三家主要的课程提供机构，分别是Coursera、Udacity和edX，其中，edX还与中国清华大学合作协助后者建立了国内较早的慕课平台“学堂在线”，向公众提供许多大学层次的免费课程。\n\n---\n慕课助教的经历\n\n七月时收到Coursera官方发来的邀请电邮，称基于过去沃顿商学院英文版营销课的成绩记录以及对Coursera社区的贡献（我参与了一些课程中文字幕的翻译与审核）考虑，询问我是否有意成为在暑假期间向中国大陆学生开设的沃顿中文版营销课的助教。虽然我知道Coursera的学习者中大陆的学生占比不小，也提供过个别中文课程，但将热门的国际课程中文化并专向中国大陆学习者开放，似乎还是头一次，尤其是作为重要的商务基础课程系列中的第一门，市场营销中文版在沃顿商学院和Coursera眼中一定是担着相当重的角色。考虑片刻后我回复了电邮表示同意，并且附带填写了一份简单的个人信息表单。\n\n一段时间之后，该课程正式开放。登录进课程页面，我才发现中文版的课程与早先我学过的国际版有了明显的改变，课程时长从九周缩减为四周，不过仔细浏览了一下课程大纲和目录，原先的主要内容仍然保留，整个课程还是围绕着顾客中心化、品牌建设和渠道三个部分。这样的改变也许是面向顾客，也就是课程学习者的需求吧。\n\n作为课程的助教，职责主要包括在课程讨论区组织讨论、回复学习者的问题，营造良好的学习氛围；将学习者在授课期间的问题和建言等反馈给Coursera官方；与Coursera合作以完善学习社区的功能等等。这些职责虽然看上去比较“宏观”，但在操作层面却比较简单，只需每周利用数个小时的空余时间查看课程讨论区里学习者的贴子，并给予回复和解答，另外针对中国学生不爱提问的习惯提一点问题以引发讨论。相比以前在美国担任助教的工作职责，这些工作量并不大，其中一个原因也与语言障碍有关，即授课的美方教授无法参与到课程讨论区来与中国学生“面对面”的直接接触，这在一定程度上弱化了助教作为师生之间桥梁的工作角色和工作负担。在这样的情况下，也许参加课程学习的中国学生就更不愿意深入讨论问题了。\n\n慕课与传统教学的区别\n\n国外开放式课程进入中国已有十个年头，早先麻省理工学院的MITOCW项目得到教育部协作在一些高校推广，但也许命运不济，最终负责该项目的团队解散，项目也不知所终。近年，慕课作为新一代的开放式课程项目再次敲响了国内大门，依然是依托网络教学的形式，这次它能成功吗？\n\n与之前的MITOCW项目不同，慕课并未仅仅将课程资料的传播作为教学的主要手段，而是更注重对传统教与学互动的模拟方面。从技术上说，互联网带宽的发展使在线观看视频成为可能，这样教师录制好的授课视频便可随时观看，模仿了课堂讲授的模式；在有些视频中，还利用技术手段插入了互动问答与练习题以便学习者掌握学习进程和巩固所学知识。在课程网站建设上，慕课的每一门课程都配置了学习讨论区，并且授课教师、助教和慕课官方工作人员还亲自参与问题解答和反馈。在课程设计上，一改过去传统的灌输式教学模式，将每一次的授课编排的有如一场表演，大多课程的录制由专业技术人员负责，力求从各个角度完善课程内容的展示以利于知识的传播与吸收。在课程的投放与发布上，新课程的开发与发布是相当严谨的，Coursera采取了一种类似软件开发的模式，即先将课程录制完成，然后根据课程性质与专业方向挑选一些Beta测试者进行模拟学习，并根据这些Beta测试者的反馈再进行课程的修改和完善，直到可以正式向学习者公开发布。在学业的考核与评估上，慕课很重视测验，它提供了尽可能多的考核形式，比如单项及多项选择题、问答题、实验操作与模拟、小组讨论等等，这些相较于传统上的在线课程学习给了学习者们更接近于现实中的学习体验。\n\n然而，慕课带来的最大的不同，可能在于它对整个教育教学体系的变革。在传统的课堂教学方式下，授课教师在教室或实验室里给十几到几十个学生讲课，教室是授课者的主战场，在学生的学习过程中，基本上主要的时间和精力都花在了教室教学中，而在慕课的教学模式下，授课教师们则是事先录制完所有的课程视频或课件，相当于完成一整件商品的制作和包装，再整体向“客户”，也就是学习者投放出来。这些学习者遍布全球，可以按照自己的时间安排和节奏进行学习，所用的学习工具就是互联网，他们可以用台式电脑、笔记本电脑、平板电脑甚至是手机应用来访问慕课上的课程。由于每个时间段（通常是一周）内的课程视频不会很多，因而学习者在看完视频之后，更多的时间是用来进行“课后”复习的，这包括重新观看课程视频、复习课程对应的讲义、阅读课后的指定文献、完成每个阶段的作业和测试，以及参加学生论坛的讨论与互动（特别是对那些将论坛讨论表现计入综合成绩的课程来说更是如此）。\n\n从某种意义上说，慕课模式是迄今为止最接近于理想型教育的高等教育知识传授模式，它采用了现代化的技术去模仿和完善旧有的课堂式教学。从教师端看，它利用了全球最好的高校教师资源，在一定程度上保证了授课和所传授知识的质量；从课程制造方来看，它借助于成熟的商业模式和平台高效的完成了课程产品的原料采购、商品概念定型、产品制造及品控、市场测试与投放等一系列企业活动，并基于互联网技术获取遍布全球的学习者的学习层面的大数据以进行后期相关课程的开发；从学习者角度看，每节课程视频时长与传统课堂的教学时长相比大大缩短，能够保证更有效的完成基本知识的学习，而课后作业与练习则可按照自身实际情况完成，并在学习论坛的讨论与助教的辅导等互动环节中进一步巩固既有的习得知识，这也算是一种因材施教了。\n\n我们应当如何改变教育与学习观念\n\n不管是Coursera还是edX，慕课都积极的利用大数据和现代网络媒体与自己的“客户”们紧密接触、多层次沟通，这种将市场营销和客户关系管理的理念渗透到知识传播和共享行动中去的做法至少目前还是传统的大陆高校所无法比拟的。当学生从80后过渡到90后甚至00后时，他们的行为与偏好也在不断的发生着变化，比如一项研究表明，互联网时代的年青人的注意力集中时间正在不断缩短，那么高校课堂式教学仍然实施50分钟一节课的标准将必然面对学生上课爱玩手机、教师不得不在讲课中经常穿插笑料段子以维系学生课堂注意力的困境；又比如年青的学生群体更偏好网络沟通与交流，那么慕课所采用的学习者论坛、微博、微信等平台显然要比某些高校规定的课后老师在教室或办公室给学生集体答疑的策略更能吸引学生提问。\n\n慕课平台除了自建推广平台以及增加和学习者们的接触点以外，还积极的与相关的群体或机构组织合作，例如社交网络果壳网、慕课平台学堂在线、门户网站网易、翻译平台译言网等，通过这样的广泛合作，一有利于吸引各个领域和层次的学习者，二有利于将慕课自身的知识产品更有效的推广到市场中去。这种亲近草根、建立广泛的统一战线的理念早期为中国共产党所用并取得了积极有效的成果，现在也正以燎原之势铺开，相比之下，从知识传播角度看，高校对知识的传播与对社会的服务也许还达不到如此高效。\n\n慕课同样也引起了中国教育部的关注，在今年四月出台的《关于加强高等学校在线开放课程建设应用与管理的意见》中，教育部明确表示将积极推动大规模在线开放课程与高等教育教学改革的大讨论，以开放、包容、务实的态度，鼓励高校和社会参与者兴利避害，共同构建具有中国特色的在线开放课程体系和课程平台，促进其在更新教育观念、优化教学方式、提高教育质量、推动教育改革等方面发挥更积极的作用。这与十年前教育部在麻省理工开放式课程项目中的推动不可同日而语。因而，教育界人士应当认识到慕课带来的这种倒逼效应，主动拥抱并改变僵化死板的教育理念，主动引导学生们适应新形势下的学习模式。\n\n慕课的困境\n\n在当前的两大慕课平台上，Coursera是一家营利型公司，edX则是一家非营利机构，组织性质的不同使前者的营利压力相当大。对利润的追求一方面推动着慕课平台组织花心思研究课程产品的精益求精和对学习者的完善服务，但另一方面这种逐利本性或多或少的也令Coursera有资金回报的压力从而影响到了所谓的客户体验，比如近期Coursera社区中出现了一些贴子曝料学习者无法获取免费证书，一些课程和学院开始向edX迁移的现象。此外，有关慕课的研究数据也表明，与传统课堂式教学相比，参加慕课的学习者的退课率较高、课程完成率较低。学习者不能完成课程学习的原因固然有很多，但不得不说目前慕课还不能完全替代正规的高校学历教育，从社会和国家的层面上讲，高校仍然有它传统的教育学生和服务社会的责任，只是，越早从慕课吸收优点，我们的高校就能越早越好的发挥其应有的积极作用。\n"
		},
		{
			"post_id": 3,
			"title": "从市场营销定义的变化看企业的市场营销趋势",
			"date_published": 1461598100.09,
			"body": "由高等教育出版社出版、吴健安先生主编的《市场营销学》所引用的美国市场营销协会（AMA）对市场营销的定义和随后的解释，可看出营销概念在这五十年来的演变，也可从一个侧面来理解市场营销的内涵。\n\n---\n以下分别是AMA在1960年、1985年和2004年公布的定义：\n\n市场营销是引导货物和劳务从生产者流转到消费者或用户所进行的一切企业活动——1960年；\n市场营销是（个人和组织）对理念（或主意、计策）、货物和劳务的构想、定价、促销和分销的计划与执行过程，以创造达到个人和组织的目标的交换——1985年；\n营销既是一种组织职能，也是为了组织自身及利益相关者的利益而创造、传播、传递客户价值，管理客户关系的一系列过程——2004年。\n从营销理论的发展历史来看，AMA于上个世纪60年代提出营销定义时，正是市场营销的革命时期，从观念上说，是由以企业为中心的营销观念（生产观念、产品观念和推销观念）转向以消费者为中心的营销观念的时期。在这个时期，企业所面临的问题多集中在利用现有资源高效率的将手中的产品和劳务等增值品转移至消费者一端，因而营销的定义也体现了这一内在需求，即企业内营销的功能就是那些与在企业和消费者之间进行产品转移相关的活动。\n\n八十年代，当AMA进一步更新营销定义时，服务营销、社会营销等概念已经出现并为人所接受。这时的营销概念与1960版不同的主要体现在两个方面，一是增加了对个人和组织的关注，即市场营销所涉及的包括个人间、组织间，以及个人和组织之间的关系，并且在此关系之上要达到双方的目标交换；二是将产品的内涵拓展到了除货物和劳务以外的理念、主意，这为对产品的完备范畴的研究奠定了基础，也使人更好的理解了企业与客户之间的交换，实体产品（甚至服务）仅是载体，客户真正从企业方获得的、并且企业奠定竞争基础的是与客户之间的理念的共享（在绿色营销以及企业社会责任的研究中，往往认为企业的目标市场客户正是那些与企业有着共同社会责任感或者对社会责任有着认同感的群体）。\n\nAMA提出的最新的营销定义相比于1985版则更进了一步：在1985版将营销视为一个过程的基础上，进一步将这个过程定义为组织职能，以及价值传递的过程。将营销视为组织职能，是因为营销的理念必须在企业、甚至是合作企业的整个价值链中被认可和认同，它不可避免的融入到企业的组织职能中去。将该过程从产品的传递进化至客户价值的传递，体现了以客户为中心、企业价值产生于客户价值的思想。而为了追求永续的发展和可持续的竞争力，就必须将这种客户价值的传递有效化和持久化，即对客户关系进行有效的管理，而不仅仅是对需求水平的管理。与此相关的企业行为和职能，将会有助于企业综合的考虑其社会责任和自身利益，不但关注“小我”，也平衡关联企业、周边机构的利益，从生态和谐的角度达到一种共存。\n（墙内）原文地址：https://blog.bizedu.net/2008/10/01/从市场营销定义的变化看企业的市场营销趋势/"
		},
		{
			"post_id": 2,
			"title": "零网博客建成",
			"date_published": 1461596208.716,
			"body": "折腾几回，终于还是依靠官方的克隆模式生成了ZeroNet上的博客。"
		}
	]
}