{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Forças armadas",
			"body": "As forças armadas de uma nação constituem o conjunto das suas organizações e forças de combate e de defesa. Dependendo do país, as forças armadas podem adotar designações oficiais alternativas como \"forças de autodefesa\", \"forças militares\" ou \"exércitos\".",
			"added": 1548283222
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 47,
	"comment": {
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": [
			{
				"comment_id": 1,
				"body": "#Hoje no Mundo Militar \nCanal especializado em temas militares contemporâneos.\n\nNotícias relevantes e vídeos apresentando em detalhes as armas que compõem o arsenal moderno dos principais exércitos do mundo.\n- https://www.youtube.com/channel/UCxDFRhF3Y1A_Gd0-cF8gbqQ",
				"added": 1548283390
			},
			{
				"comment_id": 2,
				"body": "#Hoje na Segunda Guerra Mundial\nOs principais eventos que marcaram a Segunda Guerra Mundial, discutidos e analisados dia-a-dia.\n\n- https://www.youtube.com/channel/UCqu41vk3fi-DpuRQ8Y3ViYA",
				"added": 1548283429
			},
			{
				"comment_id": 3,
				"body": "#O que é mais importante para a Marinha do Brasil: submarinos ou um porta-aviões?\n\n- https://youtu.be/lPZeNX47WCE",
				"added": 1548283649
			},
			{
				"comment_id": 5,
				"body": "#O estado do nosso Exército: https://youtu.be/GAGl0wf4cN8\n#O estado da nossa Marinha: https://youtu.be/1TMNunx1JX4\n#O estado da nossa Força Aérea: https://youtu.be/eJsx-LYxGXU",
				"added": 1548284931
			},
			{
				"comment_id": 6,
				"body": "#A triste situação da nossa Marinha\n- https://youtu.be/UNlsO6NcC6c\n\n#O que a Marinha do Brasil precisa comprar?\n- https://youtu.be/5kPr6QbZqJw",
				"added": 1548285079
			},
			{
				"comment_id": 7,
				"body": "#Submarino porta-aviões - Ficção ou uma possibilidade real?\n\n- https://youtu.be/PsJ6FiQuDGs",
				"added": 1548285112
			},
			{
				"comment_id": 8,
				"body": "#O aeroporta-aviões da SHIELD | Nerdologia\n- https://youtu.be/GVCKPbTXtDM\n\nA história dos gigantescos aeroporta-aviões americanos dos anos 20, baseado neste nerdologia sobre o aeroporta-aviões da Marvel: https://youtu.be/SoDoekwDVtE",
				"added": 1548285340
			},
			{
				"comment_id": 9,
				"body": "#Os países sem costa tem marinha?\n- https://youtu.be/xQLRv-GVqao",
				"added": 1548285389
			},
			{
				"comment_id": 11,
				"body": "#O que foi o Projeto Guerra nas Estrelas?\nFoi um programa militar lançado pelo ex-presidente norte-americano Ronald Reagan, em 1983. Oficialmente chamado de SDI (sigla em inglês para Iniciativa de Defesa Estratégica), ele pretendia criar um sistema de satélites equipados com canhões a laser para destruir mísseis enviados contra o país. Em plena Guerra Fria, tanto os EUA quanto a União Soviética possuíam armas capazes de liquidar o rival, mas não se arriscavam, porque temiam a aniquilação mútua. Com a SDI, a balança penderia a favor dos ianques. A ideia tinha tanto jeitão de ficção científica que ganhou esse “apelido cinematográfico” – e, de fato, nunca saiu do papel.\n\n- https://youtu.be/ab0wNqa20jk",
				"added": 1548286217
			},
			{
				"comment_id": 12,
				"body": "#A militarização do espaço\n- https://youtu.be/Rp28lZVWey4",
				"added": 1548286388
			},
			{
				"comment_id": 13,
				"body": "#A Guerra Biológica\nA guerra biológica ocorre quando são usadas toxinas biológicas ou agentes infecciosos, como bactérias, vírus ou fungos, com o intuito de incapacitar ou matar seres humanos, animais ou plantas. Armas biológicas (ou bio-armas) são organismos vivos ou replicados, à partir de vírus que se reproduzem, ou se replicam, dentro das vítimas hospedeiras. O uso de insetos também é considerado um ato de guerra biológica.\n\n\n- https://youtu.be/Gwbf2W-zTi0",
				"added": 1548286552
			},
			{
				"comment_id": 14,
				"body": "#O que é a guerra assimétrica?\n- https://youtu.be/CCtljosbPwA",
				"added": 1548286856
			},
			{
				"comment_id": 15,
				"body": "#A bomba de nêutrons\n\nA bomba de nêutrons é a última categoria da bomba atômica. Geralmente é um dispositivo termonuclear pequeno, com corpo composto por níquel ou cromo, no qual os nêutrons gerados na reação de fusão nuclear intencionalmente não são absorvidos pelo interior da bomba.\n\nAs emanações de raios-X e de nêutrons de alta energia são o principal mecanismo destrutivo do equipamento. Os nêutrons são mais penetrantes que outros tipos de radiação, de tal maneira que muitos materiais de proteção que bloqueiam raios gama são pouco eficientes contra eles. A bomba de nêutrons tem ação destrutiva apenas sobre organismos vivos, mantendo, por exemplo, a estrutura de uma cidade intacta. Isso pode representar uma vantagem militar, visto que existe a possibilidade de eliminar os inimigos e apoderar-se de seus recursos.\n\n\n- https://youtu.be/4CXBt0J-GCY",
				"added": 1548286973
			},
			{
				"comment_id": 16,
				"body": "#Guerra Cibernética, o novo campo de batalha no século 21\n- https://youtu.be/YqO55dXk-oo",
				"added": 1548287126
			},
			{
				"comment_id": 17,
				"body": "#O que aconteceria se a China afundasse um porta-aviões dos EUA?\n- https://youtu.be/U98xG16hTVE",
				"added": 1548287170
			},
			{
				"comment_id": 36,
				"body": "#Armas anti-aéreas\n- https://www.youtube.com/playlist?list=PLHU9D8D3exmWywwY1O5n9luTvGUVnWMcA",
				"added": 1548306183
			},
			{
				"comment_id": 37,
				"body": "#Como detectar um avião invisível\nAvião furtivo, ou stealth, são aqueles que possuem um RCS (Radar Cross Section) baixíssimo. Tal aeronave é capaz de fazer essa proeza refletindo Ondas eletromagnéticas ou as absorvendo. O Stealth não quer dizer necessariamente que a aeronave não será mais detectada pelo radar. As aeronaves continuam sendo detectadas, mas agora com o RCS muito baixo. Dependendo do poder do radar as aeronaves stealth seriam detectadas, mas seriam confundidas com pequenos animais voadores que apresentam um RCS de uma águia, por exemplo. Em conjunto de táticas de voo, com a capacidade furtiva das aeronaves, um piloto de um avião Stealth é virtualmente invisivel.\n- https://youtu.be/TVlyVGH_m_A",
				"added": 1548306514
			},
			{
				"comment_id": 38,
				"body": "#Arma antissatélite\n\nArmas antissatélite são armas espaciais projetadas para destruir satélites para propósitos estratégicos militares.\n\n- https://youtu.be/46fPQ6ZUsCU",
				"added": 1548307256
			},
			{
				"comment_id": 39,
				"body": "#Bombas de Pulso Eletromagnético (EMP), ficção ou realidade?\n- https://youtu.be/yJAkHiJ7hFQ",
				"added": 1548307720
			},
			{
				"comment_id": 40,
				"body": "#O \"escudo de força\" alemão\n- https://youtu.be/qt8oPtSL9RE",
				"added": 1548307816
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 4,
				"body": "#Playlist Ensinamentos de Jesus Cristo:\n- https://www.youtube.com/playlist?list=PL4my5FaeoOb2prJkcJyqgJ6nCPEIYVI9A",
				"added": 1548283689
			},
			{
				"comment_id": 28,
				"body": "\"Mas vocês não devem ser chamados ‘rabis’; um só é o mestre de vocês, e todos vocês são irmãos.\nA ninguém na terra chamem ‘pai’, porque vocês só têm um Pai, aquele que está nos céus.\nTampouco vocês devem ser chamados ‘chefes’, porquanto vocês têm um só Chefe, o Cristo.\nO maior entre vocês deverá ser servo.\nPois todo aquele que a si mesmo se exaltar será humilhado, e todo aquele que a si mesmo se humilhar será exaltado.\n\n- Mateus 23:8-12",
				"added": 1548301945
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 10,
				"body": "#CERT.br: Você tem backup?\n\nProteja-se de ransomware e preserve seus dados!\n- https://youtu.be/2baxFZuRWzA",
				"added": 1548285834
			},
			{
				"comment_id": 18,
				"body": "#Curso Hacker (By: Café com Código - Hacker)\n- https://www.youtube.com/playlist?list=PLrOP2EWVw1jtgZtdCBkKRGRIKmjBggoJp\n\n#Curso de Hacker (By: Koshimaru Kisara)\n- https://www.youtube.com/playlist?list=PLE0B1AD8DFA4DCE36\n\n#Curso HACKER (By: Procurados do FBI)\n- https://www.youtube.com/playlist?list=PLGcprBTtrIx5lVExH_6bukxVKoWoSFVwW",
				"added": 1548289709
			},
			{
				"comment_id": 19,
				"body": "#Pentest | técnicas de invasão\n- https://www.youtube.com/playlist?list=PLVAn-tW9RgrjH6odrp6E8D_8SAfh1bWk5",
				"added": 1548294176
			},
			{
				"comment_id": 20,
				"body": "#Brasil perde até US$ 8 bilhões com crime cibernético\n\nO Brasil perdeu entre US$ 7 bilhões e US$ 8 bilhões em 2013 com ataque de hacker, roubos de senha, clonagem de cartões, pirataria virtual, além de espionagem industrial e governamental, entre outros crimes cibernéticos.\n\nTrata-se de 0,32% do PIB brasileiro e o equivalente a quase dois terços do lucro da Petrobras em 2013.\n\n- https://web.archive.org/web/20160205210220/http://www1.folha.uol.com.br/mercado/2014/06/1467110-brasil-perde-ate-us-8-bilhoes-com-crime-cibernetico.shtml",
				"added": 1548294469
			},
			{
				"comment_id": 22,
				"body": "#Stuxnet\nO Stuxnet foi um worm projetado para atacar o sistema industrial SCADA, desenvolvido pela Siemens, mais especificamente o sistema de controle das centrífugas de enriquecimento de urânio do Irã, em 2010, fazendo-as girar mais rapidamente do que o normal e causando rachaduras em seu interior sem que os funcionários percebessem o ocorrido. Como a usina não tem acesso à Internet, o vírus só pode ter se infiltrado por algum dispositivo com saída USB, como pendrives. O maior número de computadores infectado ocorreu no Irã, com o objetivo de infectar um dispositivo que fosse levado para dentro da fábrica. Esse vírus é considerado um dos mais complexos já feitos, por isso não pode ter sido produzido por um usuário doméstico, também eram necessárias informações privilegiadas sobre o funcionamento do sistema da usina, acha-se que tenha sido produzido a mando de algum governo interessado no adiamento da produção da bomba atômica iraniana. Para computadores com sistemas operacionais comuns como o Windows ou Mac OS X, o Stuxnet não causa danos, sendo fácil removê-lo. Creditam-se a ele o estopim de ciberguerra, porém, antes dele, outros ataques a outros países já haviam acontecido.\n\n- https://github.com/Laurelai/decompile-dump.git",
				"added": 1548296808
			},
			{
				"comment_id": 23,
				"body": "#Hidden Tear - criando ransomware simples\n- https://www.limontec.com/2017/05/hidden-tear-criando-ransomware-simples.html",
				"added": 1548297438
			},
			{
				"comment_id": 26,
				"body": "#Duplicati\nArmazene backups criptografados com segurança na nuvem!\n- https://www.duplicati.com/\n- https://github.com/duplicati/duplicati.git",
				"added": 1548299054
			},
			{
				"comment_id": 27,
				"body": "#Como usar o DNSCrypt para criptografar o tráfego DNS no Linux\n- https://www.addictivetips.com/ubuntu-linux-tips/dnscrypt-to-encrypt-dns-traffic-linux/",
				"added": 1548300732
			},
			{
				"comment_id": 32,
				"body": "#Metasploit\nMetasploit é um projeto de segurança de informação com o objetivo de análise de vulnerabilidades de segurança e facilitar testes de penetração e no desenvolvimento de assinaturas para sistemas de detecção de intrusos. Está inteiramente integrado ao backtrack e kali linux, distribuições linux atualizadas e modificadas, de acordo com os requisitos de pentest.\n- https://github.com/rapid7/metasploit-framework\n- Metasploit Wiki: https://github.com/rapid7/metasploit-framework/wiki",
				"added": 1548304440
			},
			{
				"comment_id": 33,
				"body": "#BackBox\nBackBox é uma distribuição GNU/Linux derivada do Ubuntu, voltada para executar testes de penetração e de vulnerabilidade, o sistema dispõe de várias ferramentas para análise de sistemas e de redes.\n\n- https://www.backbox.org/",
				"added": 1548305020
			},
			{
				"comment_id": 34,
				"body": "#Distribuições GNU/Linux livres\nEsta página lista as distribuições GNU/Linux que são completamente livres\n- https://www.gnu.org/distros/free-distros.en.html",
				"added": 1548305402
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 21,
				"body": "#Salvation\nA narrativa é centrada em um estudante do MIT (o Instituto de Tecnologia de Massachusetts) e um superstar de tecnologia que levam a um oficial de baixa patente do Pentágono uma descoberta surpreendente: um asteroide está a seis meses de colidir com a Terra.\n\n- https://megaseriehd.com/series/salvation/",
				"added": 1548296412
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 24,
				"body": "#Trustery\nTrustery é uma infra-estrutura de chave pública (PKI) e sistema de gerenciamento de identidade na blockchain Ethereum.\n- https://github.com/musalbas/trustery",
				"added": 1548298225
			},
			{
				"comment_id": 25,
				"body": "#Blockchain e identidade\n- https://github.com/peacekeeper/blockchain-identity.git",
				"added": 1548298336
			},
			{
				"comment_id": 29,
				"body": "#Empreendendo com Bitcoin: 5 ideias e oportunidades de negócios com a moeda digital\nNeste artigo você encontrará uma seleta lista das melhores oportunidades de negócios Bitcoin, bem como algumas idéias simples, no intuito​ de estimular a criatividade e iluminar o leitores dentre aqueles que preferem trilhar seus próprios​ caminhos​ com negócios independentes.\n\n\n- https://guiadobitcoin.com.br/empreendendo-com-bitcoin-5-ideias-e-oportunidades-de-negocios-com-a-moeda-digital/\n- http://archive.today/glDts",
				"added": 1548302994
			},
			{
				"comment_id": 31,
				"body": "#LocalBitcoins\n#No LocalBitcoins.com, pessoas de diferentes países podem trocar sua moeda local por bitcoins. Os usuários do site postam anúncios onde eles determinam a taxa de câmbio e formas de pagamento para comprar ou vender bitcoins. Você pode responder a estes anúncios e concordar em conhecer a pessoa para comprar bitcoins com dinheiro, ou via transferência ou depósito online. Bitcoins são colocados na carteira do LocalBitcoins.com de onde você pode pagar suas compras em bitcoin diretamente.\n- https://localbitcoins.com/pt-br/",
				"added": 1548303140
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 41,
				"body": "#Brasileiro cria novo design radical de computador quântico\nA inovação permite a fabricação de processadores quânticos em larga escala de forma muito mais barata - e mais fácil - do que se pensava ser possível.\n\n- https://sci-hub.tw/10.1038/s41467-017-00378-x",
				"added": 1548308421
			},
			{
				"comment_id": 42,
				"body": "#Curso - Computação Quântica\nComputação Quântica é a ciência que estuda o uso da Mecânica Quântica para realização de processamento computacional.\n- https://www.youtube.com/playlist?list=PLUFcRbu9t-v4peHdmDy4rtG3EnbZNS86R",
				"added": 1548308657
			},
			{
				"comment_id": 43,
				"body": "#Física 3 - Aplicada para Ciências da Computação\n- https://www.youtube.com/playlist?list=PLUFcRbu9t-v7tHA9GkvU_FgUkn8_Z4fdp",
				"added": 1548308686
			},
			{
				"comment_id": 44,
				"body": "#Física III - Eletromagnetismo - USP\nEletromagnetismo é o ramo da física que estuda a relação entre as forças da eletricidade e do magnetismo como um fenômeno único. \n- https://www.youtube.com/playlist?list=PL1Dg4Oxxk_RJQoqMxNTzKELOPFsi2i_Tk",
				"added": 1548309398
			},
			{
				"comment_id": 45,
				"body": "Se fosse fácil produzir um computador quântico, eles já estariam em todos os cantos. Há uma série de desafios tecnológicos em torno dessas máquinas e um dos mais impressionantes tem a ver com a temperatura. Para funcionar, o D-Wave 2000Q precisa ser mantido a -273º Celsius, temperatura que é poucas frações acima do zero absoluto e 180 vezes mais fria do que o espaço interestelar.\n\nAlém de demandar temperaturas muito baixas, computadores quânticos precisam ser montados em espaços diferenciados. O motivo é que vibrações na estrutura do computador podem desalinhar átomos, criando um fenômeno chamado de decoerência.\n\n- Fonte: https://www.techtudo.com.br/noticias/2018/03/computador-e-processador-quantico-sete-coisas-que-voce-precisa-saber.ghtml",
				"added": 1548309592
			},
			{
				"comment_id": 46,
				"body": "#Física Computacional: A Física do Presente (e do Futuro)\nFísica Computacional (FC) é uma área multidisciplinar que combina Física, Matemática Aplicada e Ciência da Computação, com o objetivo de resolver problemas nas ciências naturais – sobretudo na Física.\n\n- https://universoracionalista.org/fisica-computacional-a-fisica-do-presente-e-do-futuro/\n\n#Física Computacional - Professor da USP Explica #3\n\n- https://youtu.be/OQwzI3YAvHo",
				"added": 1548310622
			}
		]
	},
	"comment_vote": {
		"23_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"31_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"29_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"33_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"36_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"38_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1
	}
}