{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565141688,
			"title": "Has ZeroNet been exposed to DDOS attack in the last hour or two?",
			"body": "A few hours ago speed seemed to accelerate with the amount of peers, but when my ZeroNet \"dashboard\" peer counter hit 3000, \"Updating\" requests seemed to no longer be able to keep up.\nThe 50-150 requests were flying out before this, in a few seconds, but suddenly 5-600 got clogged up, and the system was unable to clear the queue. \nThe peers increased to 4000 anyway, and the requests seemed to slowly decrease to manageable levels again, until another 500 requests was piled on top... I let it tick away... slow as molasses, peers still slowly increasing.... and boom, another 1000 requests / updating is stubbornly refusing to be served...\n\nThat made me suspicious, the numbers were so \"round\" 500 + 500 + 1000 + what is probably actual requests from actual peers...\n\nIs there any way to block or ban the peers generating garbage requests ? If that is indeed what they are...\nShouldn't the load speed for peers get quicker the more peers hooked up ?",
			"added": 1565141687
		}
	],
	"topic_vote": {
		"1566591029_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1565552295_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 1,
				"body": "Hmmmm...\nI had 33 of 99 trackers active before trying this...\nNow it's been saying Trackers waiting for about 35 minutes....",
				"added": 1565556920
			},
			{
				"comment_id": 2,
				"body": "These were the trackers that were connected successfully before...\nhttps://tracker.fastdownload.xyz:443/announce\nzero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\nzero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441\nhttps://tracker.nanoha.org:443/announce\nhttp://tracker.yoshi210.com:6969/announce\nhttp://open.trackerlist.xyz:80/announce\nhttp://tracker01.loveapp.com:6789/announce\nhttp://tracker2.itzmx.com:6961/announce\nhttps://opentracker.co:443/announce\nhttp://explodie.org:6969/announce\nhttp://tracker.gbitt.info:80/announce\nhttp://retracker.sevstar.net:2710/announce\nudp://tracker.coppersurfer.tk:6969\nhttp://tracker.files.fm:6969/announce\nhttp://tracker.bt4g.com:2095/announce\nzero://boot3rdez4rzn36x.onion:15441\nhttp://tracker1.itzmx.com:8080/announce\nudp://104.238.198.186:8000\nhttp://tracker.torrentyorg.pl:80/announce\nhttp://tracker.opentrackr.org:1337/announce\nhttp://tracker.internetwarriors.net:1337/announce\nhttp://t.nyaatracker.com:80/announce\nhttp://tracker.tvunderground.org.ru:3218/announce\nzero://2602:ffc5::c5b2:5360:26312\nhttps://t.quic.ws:443/announce\nzero://116.203.143.118\nzero://216.189.144.82\nzero://51.15.54.182\nzero://100.36.141.97\nzero://144.34.215.231\nhttps://tracker.publictorrent.net:443/announce\nhttps://opentracker.xyz:443/announce\nhttp://tracker3.itzmx.com:6961/announce\nhttp://retracker.goodline.info:80/announce\nhttp://share.camoe.cn:8080/announce\nhttps://tracker.vectahosting.eu:2053/announce\n\nI will try some other stuff ...",
				"added": 1565559095
			},
			{
				"comment_id": 3,
				"body": "I followed the instructions to the letter... but did not restart my browsers, only my ZeroNet program ...\nNow after restarting my Tor browser I got 82/114, and the same in my WaterFox clearnet browser...\nPeachy ... thanks for your efforts...",
				"added": 1565560480
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "!(https://www.chinasmack.com/wp-content/uploads/chinasmack/2014/04/big-bang-theory-sheldon-loser-sign.jpg)\nAwww... itta-no-workie....\n",
				"added": 1565630373
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 5,
				"body": "Somehow let off the hook, Facebook, and Twitter, the known home of multiple mass shooters, including the somewhat glowy, Tarrant, who live-streamed his New Zealand killings on their platform, the recent Elisabeth Warren supporter / shooter, and extremists such as ISIS and AntiFa, Jordan Hill and his 3 friends in Chicago, livestreaming the beating of a mentally disabled teenager, Stephen Craig Paddock, (?) and other individuals from all over the world , while alleged \"hate-crime\" site 8chan is roasted.",
				"added": 1565714659
			},
			{
				"comment_id": 6,
				"body": "> [wkuvqb5egq](#comment_16_1BogRKz3GcSLVPYJbcFW2EfbDEoinbUFsf): Journalists have private message groups where they coordinate with each other and PAC's to push a narrative. look up JournoList\n\nThis seems to me to be a place worth infiltrating for Project Veritas or some such initiative.\nOr maybe even an initiative mirroring what (((someone))) did with looking for IPs of people moving to ZeroNet looking for their next place to engage in perfectly legal banter, laughs, and giggles.\nIf \"they\" do it, it should be perfectly ethical to use the same methods against them right?\nLevel playing field and all that ... (yeah right...)",
				"added": 1565728101
			}
		],
		"1566155811_12wsdvQbd5L9bTBKXGgYazbFcHNegJUNfG": [
			{
				"comment_id": 7,
				"body": "Probably not enough users / seeds... What's the link?",
				"added": 1566160811
			}
		],
		"1566086206_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 8,
				"body": "The program probably use speech recognition on Petersons extensive collection of YouTube videos and podcasts, so any word he has used are catalogued and split up into individual sound-snippets that will be patched together kinda like a ransom letter ... some transition filtering is probably included, to level out any pitch differences and such...\nUnless he has used a lot of juicy profanities ( I kinda doubt that he has...) it's not going to be either available, or very good/real sounding...",
				"added": 1566161145
			},
			{
				"comment_id": 9,
				"body": "I suppose we all need to get smarter when dealing with certificates and watermarking / owning everything we create or communicate digitally / online. The technology exists. Isn't that how YouTube identifies songs that show up in the wrong places ? Rambalac has high-res videos of him walking around different places in Japan, and if he walks past some place playing copyrighted music on the street, YouTube algorithms detect it and mutes the sound, until it is no longer audible.\n\nPhotoshop has Digimarc capabilities, a way to digitally and invisibly watermark images.\nIt turns out they have solutions for audio too.\n\"Protect Your Rights with Instant, Accurate Audio Identification\nInstantly and accurately identify your content anywhere with Digimarc Barcode, an inaudible identifier that links to metadata and other information. Digimarc Barcode powers track-and-trace solutions that help content providers guard assets, measure usage and get paid.\"\n[https://www.digimarc.com/products/digimarc-barcode/audio]\n\nI'm sure there are other ways and solutions of how to verify and authenticate the veracity with some PGP key or something too.",
				"added": 1566171833
			},
			{
				"comment_id": 10,
				"body": "> [a7eec](#comment_12_19nmLTEGX8iQPtCSwQ9TnSDVJRxCBgFpSy): Fuck outa here with your ads\nThe first ad on ZeroNet... awesome ... where do I collect my shekels ?",
				"added": 1566172300
			},
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_823_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you're lost?\nI am? What gives you this idea ? Information about digital fingerprinting of audio? Deflating the needless paranoia of people abusing our voices without our consent? \nMy point is merely that unless audio does not have your digital watermark, it's inadmissible, inauthentic, harmless.\nWhat company makes the technology, or if there is a free open source GitHub alternative is a moot point, since people in the thread seemed oblivious to its existence.",
				"added": 1566172881
			},
			{
				"comment_id": 12,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_824_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): the point is to destroy centralization(fingerprinting-watermark)you're lost?\nHow is it centralized, if you need a public, and more importantly, your private key, known / wielded only by you...?\nLike PGP... and others...\nMaybe like ZeroID (I dunno... yet...)\nPlease explain to us plebs, oh great and severely word rationing, keeping us guessing wizard...",
				"added": 1566174168
			}
		],
		"1566191569_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 13,
				"body": "/pol/books is awesome...\nhttp://127.0.0.1:43110/1BGYb8Qyq5ApUG6ZNkASczzePf8c87Li82/?6",
				"added": 1566229039
			}
		],
		"1566591029_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "I'll patiently wait for a clip of \"Mona Lisa meets Captain Stabbin\", I have a preliminary simulation running in my neural network rn. What a time to be alive!",
				"added": 1566638731
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 15,
				"body": "> [watteau](#comment_45_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): When a painting is framed it is perfect and there is no more to be done. Once the executable is compiled it should be exquisitely sealed forever.\n\nAs a person intimately familiar with the painting process and forensic restorations of centuries old paintings, I can tell you that this is not the best example of perfection. X-rays show that paintings sometimes have a myriad of revisions hidden underneath the current framed version, separated sometimes by years before the final version was grudgingly \"released\" and delivered.\n\nAs a perfectionist I can also say that very few if any of my projects have not been scrutinized over and over after completion, where I came close to tearing it all down and making it perfect this time around...",
				"added": 1566667993
			}
		]
	},
	"comment_vote": {
		"851_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"185_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"266_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"11_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"22_15eZANwRXZ5hbXJN4fAngLXrSwF7s1CJ4n": 1,
		"19_13CzgwZUSqr5FsFwgwjes7i6JY1TskoTbw": 1
	}
}