{
	"posts": [
		{
			"id": "0d71bdeb-d4d0-4a64-b9c0-f3491fac78db",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "7c3e556a-b898-4a96-b9c8-1dcbf3462139",
			"body": ">>30b802d1-4a19-4059-b7be-e165483efdce\nHoly christ, why is it that every single one of your replies you're such a massive asshole?\n\nNaturally the sticky was the first place I checked and I'm downloading the torrent.\n\nJust because there's ONE option stickied, does not mean that there isn't another avenue open that someone might have knowledge of.\n\nTake a fucking chill pill.",
			"time": 1573072014360,
			"files": "[]"
		},
		{
			"id": "d108ca56-8100-4c63-a973-08e7a53d6286",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "7c3e556a-b898-4a96-b9c8-1dcbf3462139",
			"body": ">>d0148970-e0df-4b2b-b063-76261720ee0e\n\n>Im sorry that nearly FORTY GIGABYTES isnt enough for you to start over with being seeded by MULTIPLE PEOPLE at over TEN MEGABYTES PER SECOND. Im truly and honestly sorry we cannot ACCOMMODATE your PERSONAL needs any better.\n\nSure, there's near 40GB worth of content, but a good chunk of what's in there is either incomplete, less than stellar quality, or outdated compared to some of the Gumroad equivalents that are now available. While the torrent is definitely a decent starting point, it is by no means the be all end all solution to archiving a collection based on what's out there today. And it has nothing to do with accommodating my needs personally, any question that is answered will help anyone in the future that happens by here.\n\n\n>You have her old archive with that magnet link and a full year worth of content on 0net. Everything you're asking for is available for you right here and you're bitching that it isn't enough and bitching at me for not giving you a single link that unlocks every possible set/video she has done in an instant 1 second download and asking you to do your own research.\n\nIf everything I was LOOKING for was available, I wouldn't have even posted the question in the first place? I'm not bitching at you or even complaining that what's here isn't enough, I posted a query that was directed at everyone that visits. The internet is a big, big place and there are tons of places that I'm sure both you and I do not know about that exist, that someone else potentially might know of. The fact that you think I'm addressing you personally is totally incorrect and just suggests that you're just looking to gaslight and start some shit. Again, take a chill pill.\n\n>\"HEY GUYS DO YOU HAVE ANY SETS HAHAHHAHA LOLOLOl\"\n>Instead of\n>\"Hey do you have X Y Z sets or any sets from MONTH YEAR? that you could point me too?\"\n\nNot once did I mention or request sets to be linked to me. I asked because, again, the only sticky that is readily available is a large, but somewhat outdated torrent. Not sure why the idea of someone knowing of an avenue that you don't is such an improbability.\n\n\nThere is definitely a decent amount of content here to build the collection back up and I appreciate the work you've done as the board owner to have so much readily available, but your responses are unnecessarily aggressive and hostile and just make you look like a jackass. I was asking a question directed towards the board as a whole, not you specifically, so there's no reason for you to go off on a tangent when someone is asking an honest question.",
			"time": 1573073578015,
			"files": "[]",
			"last_edited": 1573073921377,
			"subject": null,
			"capcode": null
		},
		{
			"id": "802e531a-149e-43c6-948c-2b78f69af862",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "7c3e556a-b898-4a96-b9c8-1dcbf3462139",
			"body": ">>ada0b331-2154-42d0-a7b3-d8b7572f71d3\nI can see you make a habit of missing the point, so I'll do us both a favor and stop wasting our time by writing replies you aren't capable of reading.\n\nAt the end of the day it's pictures, dude.\n\nGet some air, shit isn't that serious.",
			"time": 1573075174935,
			"files": "[]"
		},
		{
			"id": "ac5fbf58-bcc9-49fa-b338-5a14c5b0f508",
			"directory": "users/1G1JtVmmo9SqQ3Qxtiq8QWbpTsSZvzaR2B",
			"uri": "nigri",
			"thread": "cb910e9b-d5c0-49fd-a0f9-d58589080469",
			"body": ">>cb910e9b-d5c0-49fd-a0f9-d58589080469\nDefinitely interested, keep us posted!",
			"time": 1573491843322,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}