{
	"next_comment_id": 12,
	"comment": [
		{
			"comment_id": 1,
			"body": "Так а чем не устраивает постгресовая репликация?\nА остальное рсинком.\nРешает 98% проблем.\n\nОстальные 2% готовности решает Xen+DRBD, только там серваки надо брать железные и в одном ДЦ, типа хецнера. Но это и для задач более других.",
			"post_id": 31,
			"date_added": 1487108329
		},
		{
			"comment_id": 2,
			"body": "Ну, по идее, если на каждый топик, например, автоматом создавать зайт, а на \"центральном\" зайте это все только мержить, то по объему и по продвижению наиболее интересного контента будет достаточно оптимально.\nТолько надо еще присобачить механизм типа лайка, что если флажок выставил, то сайт/сегмент не удалится. А остальное чистить время от времени по плохому настроению.\n\nТаблицы трекера будут адового размера кстати. Но тут не деться никуда.\n\nВторой момент - это апдейты. Вообще говоря, сидам, которые уже имеют копию, надо не полное обновление гнать, а git diff. По быдляцки это решается гитом. Достаточно запросить у приемника текущую версию и выдать ему дифф до последнего состояния.\nЗа одно и версионность из коробки - даже если ты все потрешь, у меня останется гит.\n\nТретий момент - это бинарники большого объема надо форсить в опциональные.\nЭто, кстати, и сейчас можно делать, только не по размеру, а по маске. Где-то в config.json задается, если я правильно понял... у них английский какой-то сложный :)",
			"post_id": 25,
			"date_added": 1487109957
		},
		{
			"comment_id": 3,
			"body": "Наблюдаю тут две задачи. Одна - продвижение зайтов, вторая - поиск контента.\nZN имеет тут один интересный плюс: мы автоматом видим рейтинг сайта из количества его сидеров. А если будет достаточно разумно дробиться контент - то и рейтинг отдельного контента.\nЕсли в дополнение к этому иметь просто один огромный линейный каталог, в котором ты регистрируешь свой сайт и указываешь для него тематики, и по этому каталогу кто-то время от времени будет накладывать рейтинг, то можно селектить и сортить.\n\nВторая задача интереснее. Тут руки чешутся тоже воспользоваться распределенностью кэшей по сидам. Но чета не очень понятно, как навязать узлам добросовестное поведение :)",
			"post_id": 27,
			"date_added": 1487112027
		},
		{
			"comment_id": 4,
			"body": "Тогда опиши подробнее задачу.\nВроде как в посте про частный случай речь идет, а сейчас универсальное решение обсуждать начали.",
			"post_id": 31,
			"date_added": 1487112536
		},
		{
			"comment_id": 5,
			"body": "Если случай совсем общий, но гвоздями прибита реляционка, то репликация БД, плюс готовность к перенакату дампа. Чудес-то не бывает.\n\nС синком файлов - вешай демона на событие записи в fs, который будет журналировать изменение файлов и второго, который будет по этому журналу по возможности синкать. \nВозможно даже чегоньть такое уже есть без рукоделия, но я не интересовался плотно.\nНочью профилатический проход либо rsync либо Unison.\n\nНу а про мастер-мастер - забыть, это все томление духа :) Там где от него реально что-то зависит, уже можно нормальные деньги вложить в нормальные технологии и не городить костыли.\n\nА если брать совсем-совсем общий случай, то надо признать суровую действительность:\nмоно-сайты не распределяются.\nСамый дешевый по трудозатратам способ поднять их надежность - это реплицируемый сторадж. Вариантов масса, начиная от канонического Амазона, продолжая аппаратными полками с репликацией и заканчивая Xen+DRBD (ссылка н готовый дистр ниже).\n\nЛибо отбрасывать исторически сложившийся код и сразу строить по принципам распределенной архитектуры.\nТогда это, опять же, или Амазон, который дает и надежный сторадж и неубиваемую СУБД и шины данных и чего хочешь. Или это микросервисы, которые можно консолидировать из виртуалок с разных частей света и которые умирая не останавливают всю систему, и любые прочие костыли, но предусмотренные изначальным техническим дизайном.\n\nPS.\n\n>> только там серваки надо брать железные и в одном ДЦ, типа хецнера\n> Вот. А речь идёт не только о свободной георепликации но и о выпадении узлов на произвольное время с последующим нагоном разницы. А приличные распределённые ФС очень плохо переносят даже георепликацию, не говоря уже о рассинхронизации :)\n\nDRBD.  Синхронная репликация. Любая БД ее нормально переносит и не разваливается. Плюс бит-карта для нагона. Работает как часы - мы на этой штуке https://sci.skycover.ru/projects/sci-cd/ не только MySQL, но и Оракл гоняем :) Но в пределах ДЦ или серверной.",
			"post_id": 31,
			"date_added": 1487146097
		},
		{
			"comment_id": 6,
			"body": "> [voland](#comment_5_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): а эта штуковина может PostgreSQL?\n\nЕй все равно. Она уровнем ниже работает, как дисковый драйвер. А в связке с Xen, или в дистре SCI - это пара серверов виртуальных машин, под каждую виртуалку выделяется диск на одном узле и на другом и они всегда в синке.\nЗапускается виртуалка на одном, и, если на нем что-то сломалось - просто запускается на другом. Эффект - как будто сервер упал и его перезагрузили: диск, даже удаленный находится в полностью консистентном состоянии.\n\nЕсли диски потеряли синк, то после того, как они его восстановят, будет передача только накопленной разности, потому что там внутри битовая карта измененных блоков записывается.",
			"post_id": 31,
			"date_added": 1487178494
		},
		{
			"comment_id": 7,
			"body": "> [voland](#comment_6_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): интересная мысль.\n\nУгу. Только вот тут https://github.com/HelloZeroNet/ZeroNet/issues/232 еще когда планировали архитектуру ZeroMe, и выясняли, хранить ли бложеки у авторов или агрегировать их на ZeroMe-хабе, автор ZN пространно ныл о том, что подписка на одного юзера типа тянет 5 коннектов и если мы в один сайт смержим дофига юзеров, то число конкурентных коннектов для обновления упятерится и все это не протолкнется в канал:\n\nOne use per site is less scalable, because you need 5+ connection per site, so if you follow 200 users it means minimum 1000 concurrent connections which is not really sustainable. If the hub owner delete/censorship your posts you are free to switch to an another one, so its not really an issue.\n\nИ поэтому продвигал гнилую идею того, что на ZM надо делать хаб, хранящий данные.\nПроблема только в том, что хаб ломает всю идею свободного распространения, потому что его владельца всегда можно воспитать паяльником. Ну или долларом.\n\nВ общем, надо мат часть учить. Ну или автора доставать :)\nА еще надо выяснить, как ZM все-таки реализовали.",
			"post_id": 25,
			"date_added": 1487182776
		},
		{
			"comment_id": 8,
			"body": "А почему не довести до ума опциональные файлы?\nт.е., чтобы, например, на файле в момент его показа был рычажок \"запинить/отпинить\".\nдля закачки в блог таких файлов сделать отдельную кнопку.\nа по обычной кнопке в редакторе не давать толстые файлы качать.\n...ну и баг выловить, который ты в ZMe ловишь :)\n\nА с IPFS - логично впилить его в питонский движок ZN - чтобы он нативно выкачивал и подсовывал.",
			"post_id": 35,
			"date_added": 1487810136
		},
		{
			"comment_id": 9,
			"body": "Механизм ZN (как идея) хорош тем, что\n1. пользователи голосуют \"ногами\" - выживает тот контент, который много кому интересен.\n2. если мне интересен чей-то контент, я имею его целиком. я могу быть оффлайн, его могут запретить, могут заблокировать протокол, но у меня он останется.\n\nна практике, насколько я понимаю, все немного не так радужно на сейчас, и опциональные файлы пока нормально не шагают по планете, но это реально здравая мысль.\n\nКто держит малопопулярный контент, должны использовать арендованные серверы, которые будут он-лайн в тот момент, когда контент востребуют. Это абсолютно аналогично нынешней аренде веб-сайтиков, а потому нормально.",
			"post_id": 35,
			"date_added": 1487885947
		},
		{
			"comment_id": 10,
			"body": "Если в спектре объекта есть хоть капелька красной составляющей, то, когда мы будем на него смотреть в красном диапазоне, то мы увидим засветку. Значит этот объект хоть чуть-чуть, но красный. И красные точки на RGB экране там будут по определению. И значение красного там не маленькое (~130/256 по калориметру).\nМожет они на бумаге, в CMYK тестили, но тогда про \"пиксели\" зачем писали?\nВ общем эффект интересный, но объяснение по оригнальной ссылке странноватое.",
			"post_id": 41,
			"date_added": 1489830863
		},
		{
			"comment_id": 11,
			"body": "Википедия> По чувствительности к свету с различными длинами волн различают три вида колбочек. Колбочки S-типа чувствительны в фиолетово-синей (S от англ. Short — коротковолновый спектр), M-типа — в зелено-желтой (M от англ. Medium — средневолновый), и L-типа — в желто-красной (L от англ. Long — длинноволновый) частях спектра. Наличие этих трёх видов колбочек (и палочек, чувствительных в изумрудно-зелёной части спектра) даёт человеку цветное зрение.\n\nНе удивительно, что если в глазу есть отдельные \"красные\" колбочки, то человек может выделять красный изолированно от остального спектра. Хотя и забавно.",
			"post_id": 41,
			"date_added": 1489831095
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}