{
	"pages": [
		{
			"id": "e4e122e0-4b0c-11e7-a972-0bcf6aa2e0ab",
			"body": "# Código aberto\n\nCódigo aberto, ou open source em inglês, é um modelo de desenvolvimento que promove um licenciamento livre para o design ou esquematização de um produto, e a redistribuição universal desse design ou esquema, dando a possibilidade para que qualquer um consulte, examine ou modifique o produto.\n\nO termo \"código aberto\" foi popularizado pela Open Source Initiative (OSI)[carece de fontes] e se difere de um software livre por não respeitar as quatro liberdades essenciais definidas pela Free Software Foundation (FSF), que são também compartilhadas pelo projeto Debian. Qualquer licença de software livre é também uma licença de código aberto (Open Source), mas o contrário não é necessariamente verdade.\n\nEnquanto a FSF usa o termo \"Software Livre\" envolta de um discurso baseado em questões éticas, direitos e liberdade, a OSI usa o termo \"Código Aberto\" sob um ponto de vista puramente técnico, evitando (propositadamente) questões éticas. Esta nomenclatura e este discurso foram cunhados por Eric Raymond e outros fundadores da OSI com o objetivo de apresentar o software livre a empresas de uma forma mais comercial evitando o discurso ético.\n\n# História\n\nA história do movimento Open Source confunde-se com as origens do UNIX, da Internet e da cultura \"hacker\".\n\n# Termo\n\nO rótulo \"Open Source\" surgiu em uma reunião em fevereiro de 1998. Tal debate juntou personalidades que se tornaram verdadeiras referências no que diz respeito ao Open Source, como Todd Anderson, Chris Peterson (Foresight Institute), Jon \"Maddog\" Hall e Larry Augustin (Linux International), Sam Ockman (Silicon Valley Linux User's Group) e Eric Raymond.\n\nComo a diferença entre os movimentos \"Software Livre\" e \"Código Aberto\" está apenas na argumentação em prol dos mesmos softwares, é comum que esses grupos se unam em diversas situações ou que sejam citados de uma forma agregadora através da sigla \"FLOSS\" (Free/Libre and Open Source Software).\n\nOs defensores do movimento Open Source sustentam que não se trata de algo anticapitalista ou anarquista, mas de uma alternativa ao modelo de negócio para a indústria de software. O modelo colaborativo de produção intelectual oferece um novo paradigma para o direito autoral. Algumas grandes empresas como IBM, HP, Intel e Dell também têm investido no software de código aberto, juntando esforços para a criação do Open Source Development Lab (OSDL), instituição destinada à criação de tecnologias de código aberto.\n\n# Definição\nA definição do Open Source foi criada pela Open Source Iniciative (OSI) a partir do texto original da Debian Free Software Guidelines e determina que um programa de código aberto deve garantir:\n\nDistribuição livre\nA licença não deve restringir de nenhuma maneira a venda ou distribuição do programa gratuitamente, como componente de outro programa ou não.\nCódigo fonte\nO programa deve incluir seu código fonte e deve permitir a sua distribuição também na forma compilada. Se o programa não for distribuído com seu código fonte, deve haver algum meio de se obter o mesmo seja via rede ou com custo apenas de reprodução. O código deve ser legível e inteligível por qualquer programador.\nTrabalhos Derivados\nA licença deve permitir modificações e trabalhos derivados, e deve permitir que eles sejam distribuídos sobre os mesmos termos da licença original.\nIntegridade do autor do código fonte\nA licença pode restringir o código fonte de ser distribuído em uma forma modificada apenas se a licença permitir a distribuição de arquivos patch (de atualização) com o código fonte para o propósito de modificar o programa no momento de sua construção. A licença deve explicitamente permitir a distribuição do programa construído a partir do código fonte modificado. Contudo, a licença pode ainda requerer que programas derivados tenham um nome ou número de versão diferentes do programa original.\nNão discriminação contra pessoas ou grupos\nA licença não pode ser discriminatória contra qualquer pessoa ou grupo de pessoas.\nNão discriminação contra áreas de atuação\nA licença não deve restringir qualquer pessoa de usar o programa em um ramo específico de atuação. Por exemplo, ela não deve proibir que o programa seja usado em um empresa, ou de ser usado para pesquisa genética.\nDistribuição da Licença\nOs direitos associados ao programa devem ser aplicáveis para todos aqueles cujo programa é redistribuído, sem a necessidade da execução de uma licença adicional para estas partes.\nLicença não específica a um produto\nOs direitos associados ao programa não devem depender que o programa seja parte de uma distribuição específica de programas. Se o programa é extraído desta distribuição e usado ou distribuído dentro dos termos da licença do programa, todas as partes para quem o programa é redistribuído devem ter os mesmos direitos que aqueles que são garantidos em conjunção com a distribuição de programas original.\nLicença não restrinja outros programas\nA licença não pode colocar restrições em outros programas que são distribuídos juntos com o programa licenciado. Isto é, a licença não pode especificar que todos os programas distribuídos na mesma mídia de armazenamento sejam programas de código aberto.\nLicença neutra em relação a tecnologia\nNenhuma cláusula da licença pode estabelecer uma tecnologia individual, estilo ou interface a ser aplicada no programa.",
			"date_added": 1496790440975,
			"slug": "open-source"
		},
		{
			"id": "263f68b0-4b0c-11e7-98ae-8930cabbc2b3",
			"body": "# Litecoin\n\n\nLitecoin (símbolo: Ł; abrev: LTC) é uma cripto moeda sustentada por uma rede peer-to-peer e um projeto de software livre lançado sob a licença MIT. Inspirada e quase tecnicamente semelhante a Bitcoin (BTC). A criação e transferência de Litecoin está baseada num protocolo de criptografia de código aberto e não é gerida por uma autoridade central. Os desenvolvedores de Litecoin pretendem tentar melhorar Bitcoin  e oferecem três diferenças fundamentais.\n\nEm primeiro lugar, a rede Litecoin processa um bloco cada 2,5 minutos, em vez de cada 10 minutos como é o caso do bitcoin.\n\nSegundo, a rede Litecoin irá produzir 84 milhões de litecoins, o que representa quatro vezes mais unidades do que a rede Bitcoin.\n\nPor último, Litecoin utiliza a função scrypt no seu algoritmo de provas de trabalho: uma função sequencial de memória rígida que foi pensada inicialmente por Colin Percival. Esta função tem como objetivo prevenir que a mineração em GPU, FPGA e ASIC tenha uma vantagem significativa sobre a mineração com CPU, embora atualmente a mineração em GPU seja 10 vezes mais eficiente do que a mineração em CPU. Cada litecoin é subdivisível em 100.000.000 unidades menores, definidas por oito casas decimais.\n\n# Transações\nAs transações, saldos, e emissões são geridas por uma rede peer-to-peer muito semelhante à de Bitcoin através de scrypt e seu esquema de provas de trabalho (as Litecoins são emitidas quando é encontrado um valor hash suficientemente pequeno, neste ponto é criado um bloco, o processo de criação dos blocos é chamado de mineração). A taxa de emissão forma uma série geométrica, e esta taxa divide-se em dois a cada 4 anos (cada 840.000 blocos) atingindo um total de 84 milhões de LTC. A natureza intensiva da memória scrypt significa que Litecoin é mais adequada do que Bitcoin, para a mineração em GPU. As implementações FPGA e ASIC são mais custosas para criar scrypt do que para SHA 1 como o usado por Bitcoin.\n\nPresentemente, as Litecoins são comercializadas para ambas as moedas fiduciárias e as bitcoins, geralmente nas transações online. As transações reversíveis (bem como as realizadas com cartão de crédito) não são utilizadas normalmente para comprar Litecoins, pois as transações com Litecoin são irreversíveis, portanto, existe o perigo de estorno. A partir de 28 de abril de 2013, 1 LTC vale aproximadamente 4,11 USD ou 0,032 BTC. Isto faz com que Litecoin seja a segunda maior criptomoeda pela capitalização de mercado com um limite de 70.000.000 USD. \n\n# História\n\nLitecoin foi lançada através de um cliente de código aberto em Github no dia 7 de outubro de 2011. Foi uma confluência do cliente Bitcoin-Qt, diferenciando-se apenas por ter um tempo modificado de geração de blocos, um algoritmo de hash diverso, e um GUI ligeiramente alterado.A versão atual deste cliente (a partir de 19 de abril 2013) é a v0.6.3c.\n\nForam lançados clientes alternativos, incluindo umo oficial Android, bem como um cliente oficial Electrum.\n\nA maior bolsa de Bitcoin, Mt.Gox, anunciou em 25 abril de 2013 que a comercialização de Litecoin foi demorada devido aos ataques dos DDoS no seu sítio web. \n\nDe modo recente, Litecoin foi anunciada nas notícias como uma alternativa de Bitcoin.\n\n# Desenvolvimento\n\nOs desenvolvedores de Litecoin tem um novo lançamento em processo, a versão 0.8.1, que ajudará na modernização e melhora da rede. Esta importante atualização incluirá todas as melhoras realizadas no recente lançamento de 0.8.1 Bitcoin.\n\n# Mercados Principais\n\n'Atlantis' (atlantisrky4es5q.onion via Tor), o segundo maior mercado livre utiliza Litecoin e Bitcoin para realizar pagamentos entre os compradores e vendedores.\n\n\nOrigem: Wikipédia, a enciclopédia livre.",
			"date_added": 1496790121148,
			"slug": "litecoin"
		},
		{
			"id": "13eed740-4b0c-11e7-98ae-8930cabbc2b3",
			"body": "#Litecoin\n\n\nLitecoin (símbolo: Ł; abrev: LTC) é uma cripto moeda sustentada por uma rede peer-to-peer e um projeto de software livre lançado sob a licença MIT. Inspirada e quase tecnicamente semelhante a Bitcoin (BTC). A criação e transferência de Litecoin está baseada num protocolo de criptografia de código aberto e não é gerida por uma autoridade central. Os desenvolvedores de Litecoin pretendem tentar melhorar Bitcoin  e oferecem três diferenças fundamentais.\n\nEm primeiro lugar, a rede Litecoin processa um bloco cada 2,5 minutos, em vez de cada 10 minutos como é o caso do bitcoin.\n\nSegundo, a rede Litecoin irá produzir 84 milhões de litecoins, o que representa quatro vezes mais unidades do que a rede Bitcoin.\n\nPor último, Litecoin utiliza a função scrypt no seu algoritmo de provas de trabalho: uma função sequencial de memória rígida que foi pensada inicialmente por Colin Percival. Esta função tem como objetivo prevenir que a mineração em GPU, FPGA e ASIC tenha uma vantagem significativa sobre a mineração com CPU, embora atualmente a mineração em GPU seja 10 vezes mais eficiente do que a mineração em CPU. Cada litecoin é subdivisível em 100.000.000 unidades menores, definidas por oito casas decimais.\n\n#Transações\nAs transações, saldos, e emissões são geridas por uma rede peer-to-peer muito semelhante à de Bitcoin através de scrypt e seu esquema de provas de trabalho (as Litecoins são emitidas quando é encontrado um valor hash suficientemente pequeno, neste ponto é criado um bloco, o processo de criação dos blocos é chamado de mineração). A taxa de emissão forma uma série geométrica, e esta taxa divide-se em dois a cada 4 anos (cada 840.000 blocos) atingindo um total de 84 milhões de LTC. A natureza intensiva da memória scrypt significa que Litecoin é mais adequada do que Bitcoin, para a mineração em GPU. As implementações FPGA e ASIC são mais custosas para criar scrypt do que para SHA 1 como o usado por Bitcoin.\n\nPresentemente, as Litecoins são comercializadas para ambas as moedas fiduciárias e as bitcoins, geralmente nas transações online. As transações reversíveis (bem como as realizadas com cartão de crédito) não são utilizadas normalmente para comprar Litecoins, pois as transações com Litecoin são irreversíveis, portanto, existe o perigo de estorno. A partir de 28 de abril de 2013, 1 LTC vale aproximadamente 4,11 USD ou 0,032 BTC. Isto faz com que Litecoin seja a segunda maior criptomoeda pela capitalização de mercado com um limite de 70.000.000 USD. \n\n#História\n\nLitecoin foi lançada através de um cliente de código aberto em Github no dia 7 de outubro de 2011. Foi uma confluência do cliente Bitcoin-Qt, diferenciando-se apenas por ter um tempo modificado de geração de blocos, um algoritmo de hash diverso, e um GUI ligeiramente alterado.A versão atual deste cliente (a partir de 19 de abril 2013) é a v0.6.3c.\n\nForam lançados clientes alternativos, incluindo umo oficial Android, bem como um cliente oficial Electrum.\n\nA maior bolsa de Bitcoin, Mt.Gox, anunciou em 25 abril de 2013 que a comercialização de Litecoin foi demorada devido aos ataques dos DDoS no seu sítio web. \n\nDe modo recente, Litecoin foi anunciada nas notícias como uma alternativa de Bitcoin.\n\n#Desenvolvimento\n\nOs desenvolvedores de Litecoin tem um novo lançamento em processo, a versão 0.8.1, que ajudará na modernização e melhora da rede. Esta importante atualização incluirá todas as melhoras realizadas no recente lançamento de 0.8.1 Bitcoin.\n\n# Mercados Principais\n\n'Atlantis' (atlantisrky4es5q.onion via Tor), o segundo maior mercado livre utiliza Litecoin e Bitcoin para realizar pagamentos entre os compradores e vendedores.\n\n\nOrigem: Wikipédia, a enciclopédia livre.",
			"date_added": 1496790090421,
			"slug": "litecoin"
		},
		{
			"id": "f2ccc900-4b0b-11e7-ba7b-df98c23ab555",
			"body": "",
			"date_added": 1496790034833,
			"slug": "open-source"
		},
		{
			"id": "e9952a80-4b0b-11e7-ba7b-df98c23ab555",
			"body": "{{mais notas|ciência=sim|data=abril de 2013| arte=| Brasil=| ciência=| geografia=| música=| Portugal=| sociedade=|1=|2=|3=|4=|5=|6=}}\n\n'''Código aberto''', ou ''open source'' em inglês, é um modelo de desenvolvimento que promove um [[licença livre|licenciamento livre]] para o design ou esquematização de um produto, e a redistribuição universal desse design ou esquema, dando a possibilidade para que qualquer um consulte, examine ou modifique o produto<ref>{{citar web |url=https://www.vivaolinux.com.br/artigo/O-movimento-do-codigo-aberto|título=O movimento do código aberto|acessodata=26 de dezembro de 2015 |autor=Luiz Antonio da Silva Junior|coautores= |data=23 de Outubro de 2003|formato= |obra= |publicado= |páginas= |língua= |citação= }}</ref>.\n\nO termo \"código aberto\" foi popularizado pela [[Open Source Initiative]] (OSI){{carece de fontes|data=abril de 2017}} e se difere de um [[software livre]] por não respeitar as quatro liberdades essenciais definidas pela [[Free Software Foundation]] (FSF)<ref>{{Citar web| url=http://www.gnu.org/philosophy/open-source-misses-the-point.pt-br.html|titulo=Por que o Código Aberto não compartilha dos objetivos do Software Livre|publicado=FSF|data=25 de Abril de 2014|acessodata=2 de Junho de 2014}}</ref>, que são também compartilhadas pelo projeto [[Debian]]. Qualquer licença de software livre é também uma licença de código aberto (Open Source), mas o contrário não é necessariamente verdade<ref>{{Citar web| url=http://www.gnu.org/philosophy/open-source-misses-the-point.pt-br.html|titulo=Por que o Código Aberto não compartilha dos objetivos do Software Livre|publicado=FSF|data=25 de Abril de 2014|acessodata=2 de Junho de 0214}}</ref>.\n\nEnquanto a FSF usa o termo \"Software Livre\" envolta de um discurso baseado em questões éticas, direitos e liberdade, a OSI usa o termo \"Código Aberto\" sob um ponto de vista puramente técnico, evitando (propositadamente) questões éticas. Esta nomenclatura e este discurso foram cunhados por Eric Raymond e outros fundadores da OSI com o objetivo de apresentar o ''software'' livre a empresas de uma forma mais comercial evitando o discurso ético.\n\n==História==\n\nA história do movimento '''''Open Source''''' confunde-se com as origens do [[UNIX]], da [[Internet]] e da cultura \"''[[hacker]]''\".\n\n===Termo===\nO rótulo \"Open Source\" surgiu em uma reunião em fevereiro de [[1998]]. Tal debate juntou personalidades que se tornaram verdadeiras referências no que diz respeito ao '''''Open Source''''', como [[Todd Anderson]], [[Chris Peterson]] (''Foresight Institute''), [[Jon Hall|Jon \"Maddog\" Hall]] e [[Larry Augustin]] ([[Linux International]]), [[Sam Ockman]] (''Silicon Valley Linux User's Group'') e [[Eric Raymond]].<ref>{{Citar web| url=http://wiki.softwarelivre.org/CoberturaWiki/Pol%EDticaELinguagemNosDebatesSobreOSoftwareLivre |titulo=linguagem nos debates sobre software livre|primeiro=Rafael|ultimo=Evangelista|data=2 Dez 2008|publicado=Palestra   fisl7.0|acessodata=25 de setembro de 2012|}}</ref>\n\nComo a diferença entre os movimentos \"''Software Livre''\" e \"Código Aberto\" está apenas na argumentação em prol dos mesmos ''softwares'', é comum que esses grupos se unam em diversas situações ou que sejam citados de uma forma agregadora através da sigla ''\"FLOSS\" (Free/Libre and Open Source Software)''.\n\nOs defensores do movimento Open Source sustentam que não se trata de algo [[anticapitalista]] ou [[anarquista]], mas de uma alternativa ao modelo de negócio para a indústria de ''[[software]]''. O modelo colaborativo de produção intelectual oferece um novo [[paradigma]] para o [[direito autoral]]. Algumas grandes empresas como [[IBM]], [[Hewlett-Packard|HP]], [[Intel]] e [[Dell]] também têm investido no ''software'' de código aberto, juntando esforços para a criação do ''Open Source Development Lab'' ([[OSDL]]), instituição destinada à criação de tecnologias de '''código aberto'''.\n\n==Definição==\nA definição do Open Source foi criada pela Open Source Iniciative (OSI) a partir do texto original da [[Debian Free Software Guidelines]]<ref>{{Citar web|url=http://www.debian.org/social_contract.html#guidelines|titulo=The Debian Free Software Guidelines (DFSG)|acessodata=26 de Dezembro de 2015}}</ref> e determina que um programa de código aberto deve garantir:\n\n*;Distribuição livre\n:A licença não deve restringir de nenhuma maneira a venda ou distribuição do programa gratuitamente, como componente de outro programa ou não.\n\n*;Código fonte\n:O programa deve incluir seu código fonte e deve permitir a sua distribuição também na forma compilada. Se o programa não for distribuído com seu código fonte, deve haver algum meio de se obter o mesmo seja via rede ou com custo apenas de reprodução. O código deve ser legível e inteligível por qualquer programador.\n\n*;Trabalhos Derivados\n:A licença deve permitir modificações e trabalhos derivados, e deve permitir que eles sejam distribuídos sobre os mesmos termos da licença original.\n\n*;Integridade do autor do código fonte\n:A licença pode restringir o código fonte de ser distribuído em uma forma modificada apenas se a licença permitir a distribuição de arquivos ''patch'' (de atualização) com o código fonte para o propósito de modificar o programa no momento de sua construção. A licença deve explicitamente permitir a distribuição do programa construído a partir do código fonte modificado. Contudo, a licença pode ainda requerer que programas derivados tenham um nome ou número de versão diferentes do programa original.\n\n*;Não discriminação contra pessoas ou grupos\n:A licença não pode ser discriminatória contra qualquer pessoa ou grupo de pessoas.\n\n*;Não discriminação contra áreas de atuação\n:A licença não deve restringir qualquer pessoa de usar o programa em um ramo específico de atuação. Por exemplo, ela não deve proibir que o programa seja usado em um empresa, ou de ser usado para pesquisa genética.\n\n*;Distribuição da Licença\n:Os direitos associados ao programa devem ser aplicáveis para todos aqueles cujo programa é redistribuído, sem a necessidade da execução de uma licença adicional para estas partes.\n\n*;Licença não específica a um produto\n:Os direitos associados ao programa não devem depender que o programa seja parte de uma distribuição específica de programas. Se o programa é extraído desta distribuição e usado ou distribuído dentro dos termos da licença do programa, todas as partes para quem o programa é redistribuído devem ter os mesmos direitos que aqueles que são garantidos em conjunção com a distribuição de programas original.\n\n*;Licença não restrinja outros programas\n:A licença não pode colocar restrições em outros programas que são distribuídos juntos com o programa licenciado. Isto é, a licença não pode especificar que todos os programas distribuídos na mesma mídia de armazenamento sejam programas de código aberto.\n\n*;Licença neutra em relação a tecnologia\n:Nenhuma cláusula da licença pode estabelecer uma tecnologia individual, estilo ou interface a ser aplicada no programa.\n\n{{Referências}}\n\n== Ligações externas ==\n* {{Link||2=http://wiki.softwarelivre.org/CoberturaWiki/Pol%EDticaELinguagemNosDebatesSobreOSoftwareLivre |3=A identificação da ideologia através da análise do discurso (sobre Software Livre x Código Aberto)}}\n* {{Link||2=http://webyes.com.br/2007/10/23/caracteristicas-dos-lideres-open-source |3=Características dos Líderes Open Source}}\n* {{Link|en|2=http://www.sourceforge.net |3=SourceForge |4=- banco de dados de projetos ''open source''}}\n* {{Link|en|2=http://www.mozilla.com/firefox/ |3=Firefox |4=- página oficial do projeto}}\n* {{Link|en|2=http://httpd.apache.org/ |3=Apache HTTP Server |4=- página oficial do projeto}}\n* {{Link|en|2=http://www.perl.com/ |3=Perl.com |4=- página oficial do projeto}}\n* {{Link|en|2=http://www.webi.org/ |3=Open Source Software List}}\n* {{Link|en|2=http://www.maarch.org/ |3=GED - Open Source Software List}}\n* {{Link||2=http://iscte-iul.pt/cursos/mestrados/10702/apresentacao.aspx |3=Mestrado em Software de Código Aberto}}\n\n{{Distribuição Programas}}\n{{Software Livre}}\n{{Ativismo de propriedade intelectual}}\n\n{{Portal3|Tecnologias de informação}}\n\n{{DEFAULTSORT:Codigo Aberto}}\n[[Categoria:Software livre|Software Livre]]\n[[Categoria:Direito da informática]]\n[[Categoria:Licenças de direitos autorais]]\n[[Categoria:Cultura e documentos do software livre]]\n[[Categoria:Conhecimento livre]]\n[[Categoria:Vídeos do YouTube]]\n",
			"date_added": 1496790019369,
			"slug": "open-source"
		},
		{
			"id": "bd045270-4b0b-11e7-bddc-cd90a5d46c67",
			"body": "#Litecoin\n\n\nLitecoin (símbolo: Ł; abrev: LTC) é uma cripto moeda sustentada por uma rede peer-to-peer e um projeto de software livre lançado sob a licença MIT. Inspirada e quase tecnicamente semelhante a Bitcoin (BTC). A criação e transferência de Litecoin está baseada num protocolo de criptografia de código aberto e não é gerida por uma autoridade central. Os desenvolvedores de Litecoin pretendem tentar melhorar Bitcoin  e oferecem três diferenças fundamentais.\n\nEm primeiro lugar, a rede Litecoin processa um bloco cada 2,5 minutos, em vez de cada 10 minutos como é o caso do bitcoin.\n\nSegundo, a rede Litecoin irá produzir 84 milhões de litecoins, o que representa quatro vezes mais unidades do que a rede Bitcoin.\n\nPor último, Litecoin utiliza a função scrypt no seu algoritmo de provas de trabalho: uma função sequencial de memória rígida que foi pensada inicialmente por Colin Percival. Esta função tem como objetivo prevenir que a mineração em GPU, FPGA e ASIC tenha uma vantagem significativa sobre a mineração com CPU, embora atualmente a mineração em GPU seja 10 vezes mais eficiente do que a mineração em CPU. Cada litecoin é subdivisível em 100.000.000 unidades menores, definidas por oito casas decimais.\n\n#Transações\nAs transações, saldos, e emissões são geridas por uma rede peer-to-peer muito semelhante à de Bitcoin através de scrypt e seu esquema de provas de trabalho (as Litecoins são emitidas quando é encontrado um valor hash suficientemente pequeno, neste ponto é criado um bloco, o processo de criação dos blocos é chamado de mineração). A taxa de emissão forma uma série geométrica, e esta taxa divide-se em dois a cada 4 anos (cada 840.000 blocos) atingindo um total de 84 milhões de LTC. A natureza intensiva da memória scrypt significa que Litecoin é mais adequada do que Bitcoin, para a mineração em GPU. As implementações FPGA e ASIC são mais custosas para criar scrypt do que para SHA 1 como o usado por Bitcoin.\n\nPresentemente, as Litecoins são comercializadas para ambas as moedas fiduciárias e as bitcoins, geralmente nas transações online. As transações reversíveis (bem como as realizadas com cartão de crédito) não são utilizadas normalmente para comprar Litecoins, pois as transações com Litecoin são irreversíveis, portanto, existe o perigo de estorno. A partir de 28 de abril de 2013, 1 LTC vale aproximadamente 4,11 USD ou 0,032 BTC. Isto faz com que Litecoin seja a segunda maior criptomoeda pela capitalização de mercado com um limite de 70.000.000 USD. \n\n#História\n\nLitecoin foi lançada através de um cliente de código aberto em Github no dia 7 de outubro de 2011. Foi uma confluência do cliente Bitcoin-Qt, diferenciando-se apenas por ter um tempo modificado de geração de blocos, um algoritmo de hash diverso, e um GUI ligeiramente alterado.A versão atual deste cliente (a partir de 19 de abril 2013) é a v0.6.3c.\n\nForam lançados clientes alternativos, incluindo umo oficial Android, bem como um cliente oficial Electrum.\n\nA maior bolsa de Bitcoin, Mt.Gox, anunciou em 25 abril de 2013 que a comercialização de Litecoin foi demorada devido aos ataques dos DDoS no seu sítio web. \n\nDe modo recente, Litecoin foi anunciada nas notícias como uma alternativa de Bitcoin.\n\n#Desenvolvimento\n\nOs desenvolvedores de Litecoin tem um novo lançamento em processo, a versão 0.8.1, que ajudará na modernização e melhora da rede. Esta importante atualização incluirá todas as melhoras realizadas no recente lançamento de 0.8.1 Bitcoin.\n\n#Mercados Principais\n\n'Atlantis' (atlantisrky4es5q.onion via Tor), o segundo maior mercado livre utiliza Litecoin e Bitcoin para realizar pagamentos entre os compradores e vendedores.\n\n\nOrigem: Wikipédia, a enciclopédia livre.",
			"date_added": 1496789944600,
			"slug": "litecoin"
		},
		{
			"id": "04307ee0-4b0b-11e7-b97c-930186088085",
			"body": "Litecoin\n\n\nLitecoin (símbolo: Ł; abrev: LTC) é uma cripto moeda sustentada por uma rede peer-to-peer e um projeto de software livre lançado sob a licença MIT. Inspirada e quase tecnicamente semelhante a Bitcoin (BTC). A criação e transferência de Litecoin está baseada num protocolo de criptografia de código aberto e não é gerida por uma autoridade central. Os desenvolvedores de Litecoin pretendem tentar melhorar Bitcoin  e oferecem três diferenças fundamentais.\n\nEm primeiro lugar, a rede Litecoin processa um bloco cada 2,5 minutos, em vez de cada 10 minutos como é o caso do bitcoin.\n\nSegundo, a rede Litecoin irá produzir 84 milhões de litecoins, o que representa quatro vezes mais unidades do que a rede Bitcoin.\n\nPor último, Litecoin utiliza a função scrypt no seu algoritmo de provas de trabalho: uma função sequencial de memória rígida que foi pensada inicialmente por Colin Percival. Esta função tem como objetivo prevenir que a mineração em GPU, FPGA e ASIC tenha uma vantagem significativa sobre a mineração com CPU, embora atualmente a mineração em GPU seja 10 vezes mais eficiente do que a mineração em CPU. Cada litecoin é subdivisível em 100.000.000 unidades menores, definidas por oito casas decimais.\n\nTransações\nAs transações, saldos, e emissões são geridas por uma rede peer-to-peer muito semelhante à de Bitcoin através de scrypt e seu esquema de provas de trabalho (as Litecoins são emitidas quando é encontrado um valor hash suficientemente pequeno, neste ponto é criado um bloco, o processo de criação dos blocos é chamado de mineração). A taxa de emissão forma uma série geométrica, e esta taxa divide-se em dois a cada 4 anos (cada 840.000 blocos) atingindo um total de 84 milhões de LTC. A natureza intensiva da memória scrypt significa que Litecoin é mais adequada do que Bitcoin, para a mineração em GPU. As implementações FPGA e ASIC são mais custosas para criar scrypt do que para SHA 1 como o usado por Bitcoin.\n\nPresentemente, as Litecoins são comercializadas para ambas as moedas fiduciárias e as bitcoins, geralmente nas transações online. As transações reversíveis (bem como as realizadas com cartão de crédito) não são utilizadas normalmente para comprar Litecoins, pois as transações com Litecoin são irreversíveis, portanto, existe o perigo de estorno. A partir de 28 de abril de 2013, 1 LTC vale aproximadamente 4,11 USD ou 0,032 BTC. Isto faz com que Litecoin seja a segunda maior criptomoeda pela capitalização de mercado com um limite de 70.000.000 USD. \n\nHistória\nLitecoin foi lançada através de um cliente de código aberto em Github no dia 7 de outubro de 2011. Foi uma confluência do cliente Bitcoin-Qt, diferenciando-se apenas por ter um tempo modificado de geração de blocos, um algoritmo de hash diverso, e um GUI ligeiramente alterado.A versão atual deste cliente (a partir de 19 de abril 2013) é a v0.6.3c.\n\nForam lançados clientes alternativos, incluindo umo oficial Android, bem como um cliente oficial Electrum.\n\nA maior bolsa de Bitcoin, Mt.Gox, anunciou em 25 abril de 2013 que a comercialização de Litecoin foi demorada devido aos ataques dos DDoS no seu sítio web. \n\nDe modo recente, Litecoin foi anunciada nas notícias como uma alternativa de Bitcoin.\n\nDesenvolvimento\n\nOs desenvolvedores de Litecoin tem um novo lançamento em processo, a versão 0.8.1, que ajudará na modernização e melhora da rede. Esta importante atualização incluirá todas as melhoras realizadas no recente lançamento de 0.8.1 Bitcoin.\n\nMercados Principais\n\n'Atlantis' (atlantisrky4es5q.onion via Tor), o segundo maior mercado livre utiliza Litecoin e Bitcoin para realizar pagamentos entre os compradores e vendedores.\n\n\nOrigem: Wikipédia, a enciclopédia livre.",
			"date_added": 1496789634512,
			"slug": "litecoin"
		}
	]
}