{
	"title": "Le bobby blog",
	"description": "Voici ma bouteille à la mer, elle est destinée à tous les bobbinautes ",
	"links": "*   [ZeroLSTN](http://127.0.0.1:43110/1MusicKyJsw3CoEA6g1puwAPQGaeLAV3TM/?)",
	"next_post_id": 13,
	"demo": false,
	"modified": 1527709102,
	"post": [
		{
			"post_id": 12,
			"title": "Template de blog",
			"date_published": 1526063644.126,
			"body": "Si toi aussi, tu veux lancer ta bouteille à la mer.\nJe te conseille d'aller faire un tour sur ces blogs, leur template est d'enfer!\n 1. [BinChan's ZeroNotes](http://127.0.0.1:43110/1EiMAqhd6sMjPG2tznkkGXxhdwFBDdeqT9/)\n 2. [Poster](http://127.0.0.1:43110/1J2ZJjs97wEcW36x5d9f1QnPVPVDv8wbJ/)\n\nPS: Je mettrais à jour ce billet, si je tombe sur d'autres trucs cools. \nSi vous avez des bonnes adresses à partager, les commentaires sont là pour ça ;-)"
		},
		{
			"post_id": 11,
			"title": "Le bobby serveur : Premier Bilan",
			"date_published": 1526059544.044,
			"body": "#Hardware\n\nAprès 2 mois depuis lancement du projet \"Bobby serveur\", il temps de faire un premier bilan.Sur la carte la LIME 2, je n'ai pas grand chose à dire, elle juste fonctionne. Quoique, j'ai un soucis avec les 4Go de EMMC, mais je n'ai pas encore diagnostiqué la cause de du problème. Je vous en parlais plus en détails dans le bilan software.   \n\nPar contre le boitier fournis par Olimex est un peu pourris...\nPremièrement, il est fournis avec une seul entretoise pour faire tenir la carte sur le boitier:\n\n ![Le bobby-serveur ](img/Hardware-1.png)\n\nC'est triste à dire, mais même la Freebox révolution repose sur 3 points :-/\nDeuxièmement, le capot supérieur ne peut se monter qu'en forçant (Position du trous de passage de la vis). \n\n![Pb de fixation](img/Hardware-2.png)\n\nCe qui a pour conséquences d'appuyer sur le bouton reboot de la carte. J'ai signalé le soucis au support, il ont même pas daigné me répondre. Je suis d'autant plus déçu que la solution est facile à mettre en œuvre. \n\n![Pb de montage](img/Hardware-3.png)\n_Cf dessus mon trou obloné comme un bourrin_\nSi le boitier avait été un projet open-hardware, j'aurais même pu leur faire une proposition de plan, dommage..."
		},
		{
			"post_id": 10,
			"title": "No futur ? ",
			"date_published": 1520197665.786,
			"body": "Je ne c'est pas vous,  mais quand je regarde autour de moi. \nJe pense souvent à [ça](https://www.youtube.com/watch?v=lvvkeYubL28&feature=youtu.be&t=47s):\n\nSi ce genre de réflexion, vous intéresse. Je vous invite à suivre cette [interview](https://www.youtube.com/watch?v=5xziAeW7l6w). On y parle du [club de Rome](https://www.clubofrome.org/) de son rapport de 1972 [\"The Limits to Growth\"](https://fr.wikipedia.org/wiki/Halte_%C3%A0_la_croissance_%3F) et de plein d'autres trucs. Je vous conseille de laisser le truc ce digérer tranquillement. \n\nPour que vous tombiez pas en pleine dépression, je vous conseil de jetez  également un œil à [ça](https://www.clubofrome.org/wp-content/uploads/2016/08/A-finer-future.pdf) aussi ;-) "
		},
		{
			"post_id": 9,
			"title": "My first bobby server",
			"date_published": 1518982189.603,
			"body": "Avant de commencer et après voir fait votre choix parmi le merveilleux des carte électroniques, vous allez devoir explorer le vaste mondes des distributions linux.\n###Le choix de la distribution\nPour ma pars j'ai décider de partir sur une [Armbian](https://www.armbian.com/) au lieu de celle livrée par [Olimex](https://www.olimex.com/). J'ai fais ce choix pour 3 raisons principales: \n- La + grande communauté  ->  meilleur support \n- Sa + grande facilité de prise en main\n- La possibilité d'installer le système sur la mémoire MMC embarquée\n\nArmbian propose une Debian ou une Ubuntu allégée: ![image alt](img/Armbian-1.png)\nJe vous conseille de pas faire comme moi et de choisir l'Ubuntu si vous êtes un débutant. A moins de pas avoir la place d'installer un gestionnaire de bureau ou  adorer gérer un système entièrement en ligne de commande =p. Si vous choisissiez cette voie, je ne peux vous conseillez la lecture cette [bible](https://debian-handbook.info/). Elle m’ait d'un grand secours. \n\nPour ce qui est de l'installation d'Armbian pour les question je vous renvois au [Manuel](https://docs.armbian.com/User-Guide_Getting-Started/) ;-)\n\n\n###Installation de Pi-hole\nCe qui est cool avec Armbian c'est qu'elle a un petit gestionnaire  de configuration intégrée. Il est accessible via `armbian-config` (loggé en root)\n\n![image alt](img/armbian-config-2.png)\n\nOn peut gérer le système mais également installée quelques soft classiques.\n\n![image alt](img/armbian-config-7.png) \n\n**L'astuce du noob**:\nPour sélectionner un item dans ce type de menu, il faut appuyer sur **espace**. Le savoir m'aurait éviter de perdre ~30 min de ma vie =)\n\nVous n'avez plus qu'a sélectionner Pi-hole et suivre la procédure. \n\n**Nota benne:**\n[Pi-hole](https://pi-hole.net/) est installable également directement en tapant\n`curl -sSL https://install.pi-hole.net `\n\n\nA la fin de la procédure d'installation, on va vous donnez un mot de passe.\n**Noter le!*** Il vous permettra de vous connecter  sur la page web d'admin du pi-hole. Il évidement que vous conseil fortement de le changer et mettre un mp un peu plus costaux que 1234 ;)\n\n###Pi-hole configuration\nIl n'y a rien de plus simple...\n\nUne fois connecté à l'interface d'administration:\n\n![image alt](img/pihole.png) \n\nIl suffit d'aller faire une tour dans l'onglet \"setting\" pour gérer votre Pi-hole:\n\n![image alt](img/pihole-config.png) \nPar exemple vous pouvez modifier les serveurs dns sources. Pour moi, ça sera le combo Quad9 / Mullvad / FDN. \n\nPour ceux qui voudrait faire de votre Pi-hole, le serveur DNS de votre maison, 3 solutions s'offrent à vous:\n1. Paramétrer chaque appareils clients (Smartphone/PC/Tablettes/Console)\n2. Modifier le serveur DNS sur votre box (Pas possible chez tous les FAI) \n3. Activer le serveur DHCP du Pi-hole + le déclarer comme tel sur votre box\n\nVoilà pour ma config!\nJe laisse tester le bouzin,  à votre convenance .\n\n"
		},
		{
			"post_id": 8,
			"title": "Le bobby serveur : La genèse",
			"date_published": 1517257662.449,
			"body": "###La genèse###\nIl y a 2 ou 3 ans, en pleine prise de [conscience post-snowden](https://www.youtube.com/watch?v=mqUInAOfBWI), me laissant finalement  assez démuni. Je suis tombé sur un projet un peu atypique intitulé:\n [la brique internet](https://labriqueinter.net/).\nJe suis en train de comprendre que pour me sentir mieux, il va falloir m’approprier, me réapproprier ma façon de penser/comprendre et utiliser internet.\n\nAprès avoir flashé sur la brique internet, je me suis laissé le temps de murir le truc: \n1.\tIl va falloir mettre les mains sous le capot.\n2.\tJe suis noob linux motivé, mais je ne suis pas admin-sys. \n3.\tD’après les retours de la liste de diffusion, ce n’est pas si fiable que ça.\n4.\tUn internet non fiable, je n’en veux pas\n\n###Conclusion###\nPour moi,  l'internet cube c'est pas encore pour tout de suite.  \nPar contre, il y a clairement moyen de commencer un peu plus doucement. \nEt c'est là que le Pi-Hole rentre scène. \n\n###Le [Pi-Hole](https://pi-hole.net/) qu'est-ce que c'est ?###\nC’est tout simplement serveur DNS bloqueur de pub à monter, soit même, sur Rasberry-Pi ou équivalent =). Commencer par gérer ses requêtes DNS pour se réapproprier l’internet, c’est assez logique finalement ;-)\n\n\n###Le choix du hardware###\nN’ayant pas spécialement envie de me lancer dans une étude de marché avant de faire mon choix. Je suis basé sur celui de la [brique internet](https://labriqueinter.net/), la [Lime2](https://www.olimex.com/Products/OLinuXino/A20/A20-OLinuXino-LIME2/open-source-hardware) de chez Olimex:\n•\tUn processeur A20\n•\tUn Ethernet 1Gb\n•\t1Gb de RAM\n•\t2 ou 3 autres trucs\n\nJ’ai pris la version avec 4Gb de mémoire [eMMC](https://groups.google.com/forum/m/#!topic/beagleboard/PUjlYzFZHk4), histoire de moins dépendre de la fiabilité de la carte SD. Pour ceux qui ne connaitrais pas, Olimex fait des cartes (mais pas que ;) en open hardware plutôt en orienté  usage pro/industriel.\n\nIl existe sûrement des cartes moins chères ou plus adaptées à mon besoin.\nMais de toute façon, un serveur DNS ne consomme presque rien, mon application n’est pas du tout limitante. Et vue que mes projets pour le Bobby serveur sont encore à définir, pas besoin de se lancer dans un comparatif détaillé. La seule chose, que je m’étais fixée : un peu de mémoire eMMC et des perfs comparables. \n\nLa prochaine fois, je ferais peut être un petit unboxing du bousin, car il y a quelques petits trucs à revoir =)"
		},
		{
			"post_id": 6,
			"title": "Et maintenant",
			"date_published": 1516738237.523,
			"body": "Bon maintenant que les présentations sont faites, réfléchissons un peu à la suite.... \nJe pensais vous parler un peu du nano-ordinateur que je me suis pris récemment.\nLe but du projet était de commencer par se monter [Pi-hole](https://pi-hole.net/) avant de passer peut-être à des choses un peu plus sérieuses. Vu que l'informatique c'est pas mon job, je vais surement galérer un peu. Mais ça serait pas drôle sinon ;-)\n\nMais on verra ça plus tard, pour l'instant mettez vous bien et écoutez un peu de musiques sur [ZeroLSTN](http://127.0.0.1:43110/ZeroLSTN.bit/?/)"
		},
		{
			"post_id": 2,
			"title": "Une bouteille à la mer!",
			"date_published": 1515965580,
			"body": "Pour commencer, je ne sais pas quoi vous dire!\n\nJe commence ce blog/cette aventure sans savoir où ça nous mènera. Je me lance dans le ZeroNet alors que tous les blogs francophones que j’ai croisé se sont Chronoruptés en 2016\\. Peut-être que j’ai découvert ZeroNet trop tard, qui sait…\n\nMais j’ai cependant l’intuition que le futur du web est quelque-part par ici.\nEt puis l’idée de se lancer dans un blog avec rien à dire et une audience très incertaine, mais en même temps le côté impérissable qu’offre le réseau,\npour moi c’est la bouteille à la mer moderne. Et c’est pas pour me déplaire =)\n\n[Il me reste plus qu'a te souhaiter la bienvenue !](https://www.youtube.com/watch?v=1NrkSs5wHFw)"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	],
	"tag": [
		{
			"value": "Zeronet,",
			"post_id": 2
		},
		{
			"value": "1erplouf",
			"post_id": 2
		},
		{
			"value": "1erplouf",
			"post_id": 6
		},
		{
			"value": "1erplouf",
			"post_id": 1
		},
		{
			"value": "Internetcube",
			"post_id": 8
		},
		{
			"value": "Pi-hole",
			"post_id": 8
		},
		{
			"value": "rasberry",
			"post_id": 8
		},
		{
			"value": "privacy",
			"post_id": 8
		},
		{
			"value": "Pi-hole",
			"post_id": 9
		},
		{
			"value": "rasberry",
			"post_id": 9
		},
		{
			"value": "Armbian",
			"post_id": 9
		},
		{
			"value": "Ressources,",
			"post_id": 10
		},
		{
			"value": "Energies,",
			"post_id": 10
		},
		{
			"value": "Earth,",
			"post_id": 10
		},
		{
			"value": "effondrement?!",
			"post_id": 10
		},
		{
			"value": "Pi-hole",
			"post_id": 11
		},
		{
			"value": "rasberry",
			"post_id": 11
		},
		{
			"value": "Armbian",
			"post_id": 11
		},
		{
			"value": "Zeroblog",
			"post_id": 12
		}
	]
}