{
	"title": "中共惊人的腐败",
	"description": "中国人普遍认为毛泽东时代没有腐败，其实制度性腐败就是毛泽东在延安建立的，中共的腐败是从一开始就存在的。认为毛泽东时代没有腐败的人，只能说明自己社会地位太低，不了解事实真相，或者是自己根本就不读书，不知道别人揭露的毛泽东时代的腐败。",
	"links": "[股市带路党](http://127.0.0.1:43110/12i7CYxN2UxAEMiFarqeBCSegk8sLpmb2R/)\n\n[kai0油管频道](http://127.0.0.1:43110/149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN/?Channel=1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv)\n\n[kai0的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kai0@zeroid.bit)\n\n[kaishen的视频频道](http://127.0.0.1:43110/big.kopykate.bit/?Channel=kaishen@zeroid.bit)\n\n[吴越独立](http://127.0.0.1:43110/1JfzWXHBzELkVF12km6ZdnKSZFUAs8mZBw/)\n\n[零网使用方法](http://127.0.0.1:43110/14qzPjqXiZV5PokSbX1EnkKZtpUASNxnfZ/)\n\n[颠覆国家政权群](http://127.0.0.1:43110/16EwXiGi4Dn9EZFSeEuKc2HNZYRD3RcVDs/)\n\n[吴越独立大论坛](http://127.0.0.1:43110/1F1AHWYc7Mt3GBV9ZgphyyG2Go7uodmBtL/)\n\n[自由曙光](http://127.0.0.1:43110/18GBsUZexWB8BcnGUtxFz4qbFiEeXVgB5B/)\n\n[非洲人的生活](http://127.0.0.1:43110/15zvMb12PZ5XMc6yJBWUEmn2dQvV3TyuQU/)\n\n[上海街头](http://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt/)\n\n[今日新疆西藏](http://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/)\n\n[自由西藏运动](http://127.0.0.1:43110/1HNZuUMURNtRPdfzBDxrNonPD2EBN6TKfV/)\n\n[东突厥斯坦运动](http://127.0.0.1:43110/1BHs4zibfUpXbJV7RRVDvMRCiqBgPkeM5y/)\n\n[中国发展模式](http://127.0.0.1:43110/1HNYEHtg6BPAW1jmWfBGPrRMxsPjd6nVA2/)\n\n[中国故事](http://127.0.0.1:43110/1PhcqYWiQHAiasQkcpsHp6btASom2tMGQK/)\n\n[共产党的故事](http://127.0.0.1:43110/17DwzkEgpqtCWK9i1CGdioXojBpN1uaJ2N/)\n\n[天安门大屠杀](http://127.0.0.1:43110/1NT2LeRWQs3zCFCRwuPWbKwcamXVEu1hbU/)\n\n[郭文贵揭露的腐败](http://127.0.0.1:43110/1JWBMmJtHs7uDK1pm6wEJjrZFn3uk1FG6V/)\n\n[地狱 中国](http://127.0.0.1:43110/1P9MwRTBWUdbyRgrytY7jg191trnZTomu9/)\n\n[加拿大风情](http://127.0.0.1:43110/1JCehSb5nREM7EivyQDXXkTsGpbKikDiaw/)\n\n[台湾建国运动](http://127.0.0.1:43110/1M27epbWFHg17bXcuNNmXaD9QmpeqhaV6N/)\n\n[中国各地的抗争](http://127.0.0.1:43110/1KXgv2wg6UdzoCqusaS5cCuXzkPsy7f1wm/)\n\n[美中贸易大战](http://127.0.0.1:43110/1LXgC6GXAc535zw8gLQbZpXnfoXNGkQDjh)\n\n[爆料台](http://127.0.0.1:43110/18eb8HAMQnS8SLJRxMekSGjskNXEtNZZzw/)\n\n[墙内消息](http://127.0.0.1:43110/17PC9PwGFg1rzXnnr6uZe9uQKj7QyED5P6/)\n\n[谈革命](http://127.0.0.1:43110/13LzMTjYM5xGMfnXq6hqAARra5UpmCYt12/)\n\n[自由人聊天室](http://127.0.0.1:43110/1LaXzrgAtsXwdQQdkzFwbLPozoWgTVUQnv/)\n\n[Zer0 Up Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/)\n\n[ZeroUp@anotherneko](http://127.0.0.1:43110/1A6kYPexXbPRLfDD1DK1oiqsBmWdBwun8f/)\n\n[1024记录](http://127.0.0.1:43110/1CuGFe64XH3XLCiEPkSkwRprrfqZzdAjpp/)\n\n[公义行动](http://127.0.0.1:43110/19bL8w6dqoU6vc4d7gnVmDAbDmpBvdVoxz/)\n\n[幻想未知](http://127.0.0.1:43110/19vi7xKAZsuMrfpp4z4zAMmhY8QNvXN3Sm/)\n\n[大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/)\n\n[朝花夕拾](http://127.0.0.1:43110/lastone.bit/)\n\n[历史中的404](http://127.0.0.1:43110/1PGxGwpMtEJ22FPDiyXAiQFBrhiFXEtGF5/)\n\n[卡拉卡拉的博客](http://127.0.0.1:43110/12YPedbiK2S74s5Fjgcvjv21JYAjL1zaCC/)",
	"next_post_id": 63,
	"demo": false,
	"modified": 1597214314,
	"post": [
		{
			"post_id": 62,
			"title": "第一批中共官员财产公示：",
			"date_published": 1597214228.185,
			"body": "1、茂名副市长杨光亮：房产14套，现金12亿;\n2、楚雄州长杨红卫：房产23套，现金17亿;\n3、杭州副市长许迈永：房产25套，现金14亿;\n4、山西蒲县煤炭局长郝鹏俊：房产35套，现金30亿;\n5、山东副省长黄胜：房产46套，现金90亿美元。"
		},
		{
			"post_id": 61,
			"title": "中共领导人为何长寿？以百姓生命为代价",
			"date_published": 1570420466.084,
			"body": "中共领导人超过百岁的不少\n\n据中共国家卫生健康委员会公布的数据，目前中国人均预期寿命为77岁。而中共党政军领导人明显长寿很多，活到90岁成“基本”，超过百岁的为数不少。\n\n例如，今年7月22日病逝的中共前总理李鹏，享年91岁。今年2月16日辞世的毛泽东前秘书李锐，享寿102岁。宋平的夫人、北京清华大学前副书记陈舜瑶，同样以102岁的高龄于今年逝世。\n\n活过百岁的还包括：军方将领吕正操、全国人大前副委员长雷洁琼更活到106岁；军方将领陈锐霆、吴西都活到105岁。中央书记处前书记邓力群（100岁）、中央前副主席汪东兴（100岁）、前国务委员张劲夫（101岁）、中央军委前副主席张震（101岁）。至于年过90的领导更多数不胜数。\n\n---\n\n**特供：食品、空气、医疗等**\n\n中共从延安时期开始就有针对中共高官的特供制度。\n\n其实养生之道人人皆知，有益无害，香港亲共港媒东网有评论文章指，“但能否长寿，则要打上一个大问号。其实张震之所以活到100多岁，决不是因为他有什么养生秘诀，真正的养生法宝是他的高官身份，党和人民‘不惜任何代价’把他养着。”\n\n《苹果日报》去年5月报导，中共有特供制度，专门向中南海供应由“秘密基地”提供的食物。中共国务院属下有一个“中央国家机关食品特供中心”，专为各个部委高官提供优质有机食品。\n\n报导称，特供食品来自于“国务院后勤基地、中央警卫局农场、武警边防后勤基地和遍布全国13个省市、直辖市、自治区的生产基地”。\n\n更令人吃惊的是，中南海的空气也是“特供”的。2011年11月，中国远大公司曾发文称，该公司的空气净化机进驻中南海，为国家领导人净化空气。\n\n东网文章说，副部级以上高干，可以成年累月住在专门医院或高干病房里，享受无微不至的医护，用世界上最先进、最贵的药，每天花个几千上万元不在话下。\n\n离退休后，他们仍享受着各种优厚生活待遇和医疗待遇，形成一个规模庞大的特权阶层。港媒曾报导，中共2014年退休高官包括医疗保健等在内的年开支逾675亿元。\n\n**长寿工程：以150岁为目标**\n\n上个月，微信圈疯传一条“981首长健康工程”广告，介绍这个为中共最高领导层而设的医疗服务，在过去60年中“成效显着”，并把寿命延长至150岁作为目标。\n\n该广告引用数据说，中共国家领导人的平均寿命远远高于同期发达西方领导人的的平均寿命。据2008年统计，中国领导人的平均寿命达到88岁高龄。\n\n百度公开资料显示，“981健康工程”课题组是2005年成立，并于5月正式启动，是一项旨为“社会精英”健康服务的“重大工程”。\n\n981模式共有三大工程：“健康促进工程（不老）；青春再现工程（不老）；150岁长寿工程（长寿）”。\n\n该健康工程透露数据，2000年时中共领导人的平均寿命同美国相比只多出2～3年，但在之后中共领导人的平均寿命呈现出非直线的飙升，到2010年，中共领导人的平均寿命已经高出美国领导人平均寿命逾10年。\n\n**为了长寿 “杀人换器官”**\n\n不止是养生、特供、医疗等条件最优越，更恐怖的是，为了长寿，中共系统性的移植百姓的器官，供高官续命。\n\n逃亡美国的中国富商郭文贵曾曝光，中共高官为何得了癌症还活着的？因为他们可以任意换器官。\n\n例如，中共前党魁江泽民长子江绵恒2004年到2008年在南京医院几次换肾，都由孟建柱、上海政法委领导和军队几个领导在背后组织、选人、为肾配对。\n\n郭文贵还爆料，前政法委书记孟建柱的妈妈也曾换肝又换肾，孟建柱的妻子也换过两次肾。为寻找活肾，孟的心腹孙力军等人从狱中找囚犯配对，杀人取器官，并一度为此杀错了人。为掩盖真相，他们又将为孟母做手术者和知情者都灭口。\n\n与高官平均寿命飙升同步的是，中共自1999年打压法轮功后，中国的器官移植数量呈现蘑菇云般的飙升。\n\n国际上已有多人和机构调查中共是否活摘法轮功学员及良心犯器官，并在“按需杀人”。\n\n最早的调查，加拿大前亚太国务卿、七届资深国会议员大卫·乔高和国际人权律师大卫·麦塔斯于2006年7月发表的独立调查报告表示，“对法轮功学员进行大量器官摘取”的事情做出“曾经发生，且至今仍然继续存在”的结论，并指这是“这星球上前所未有的邪恶”。\n\n二十年来，美国、加拿大、欧盟等政府和国际机构多次给予谴责，要求中共调查并制止活摘器官，停止迫害法轮功。但是中共对法轮功的迫害还在继续。"
		},
		{
			"post_id": 60,
			"title": "彭博社：习近平家族财富过亿，权贵精英身家几何",
			"date_published": 1546332068.128,
			"body": "_核心提示：彭博社的这篇报道让彭博财经网站在中国被屏蔽。这篇报道的信息均来自于公开资料，也十分谨慎地说明了巨额财富并不能追踪到习近平、彭丽媛、习明泽，而是主要由他的姐姐齐桥桥一家和妹夫吴龙以及习远平所有。_\n\n习近平，这位\"内定\"的中国下届主席在2004年的反腐电话会议上警告说：\"管好你的配偶、子女、亲属、朋友和下级，发誓不用权力来谋私利。\"\n\n彭博社收集的公开资料表明，在习近平在党内逐步攀升时候，他的亲属们将商业利益扩展到了矿业、房地产、手机设备等领域。\n\n这些利益包括在总资产达$3.76亿的众多公司中的投资，包括在一家资产达到$17.3亿的稀土公司的18%的间接股权；还有在一家公开上市的科技公司价值$2020万的股票。这些数字没有计入负债的部分，因此也不反映习氏家族的净资产。\n\n---\n\n根据这些资料，这些资产不能追踪到习近平本人、他的妻子或他们的女儿，习近平本月就59岁了；他的妻子彭丽媛49岁，是中国人民解放军的一名歌手。没有证据显示习近平插手推动他的亲属们的商业交易，也未发现习近平和他的家族成员有什么不法行为。\n\n多家控股公司经营，政府对查看相关企业资料设限，以及某些情况下的网络审查，都使得这些投资处于公共视线之外。然而在数千页的监管文件中，人们依旧可以找到这些投资的影子。\n\n根据这些资料，可以查到习家在可以俯瞰南中国海的香港的山顶，有一座价值$3150万元的别墅。连接着电线的门铃摇摇晃晃，邻居们说这幢房子已经空了多年。习家在香港至少还有六处房产，总价值据估计有 $2410万元。\n\n**常委**\n\n过去三十年来，习近平在党内稳步上升，在好几个省都当过一把手，在2007年进入了政治局常委。这一路上，他因主政清廉而获得好评。\n\n根据《人民日报》的报道，他在富裕的沿海省份浙江领头抓过一次反腐运动，2004年也是在那，他发表了那通要官员们\"自我约束\"的警告。而后，在一起高达37亿人民币的丑闻后他接任了上海的党委书记。\n\n2009年的一份美国外交电报引用习近平的一位熟人的说法说，他不腐败，他的动力也不是钱。习近平对\"无所不在的中国社会的商业化，包括与之伴随的新富，官员腐败，价值、尊严和自尊的沦丧等等感到厌恶。\"这份由维基泄密透露出来的电报引述朋友的话这么说。\n\n美国政府的发言人拒绝就这份文件置评。\n\n**分一杯羹**\n\n人们对中国最有权势的家族在经济增长中谋取财富越来越厌恶，这已经形成了对中共的挑战。根据国际货币基金组织的报告，过去20年来，中国城市中的收入差距已经成为亚洲之最。\n\n位于圣地亚哥的加州大学中国经济方面的教授劳福顿（Barry Naughton）说：\"普通中国人在听到有些人利用政治影响力能赚数亿，甚至几十亿美元的时候感到愤怒。\"他并没有特指习氏家族。\n\n在十年一度的权力交接即将在今年下半年开始时，对官员财富的审查也加强了。习近平和下一代领导人将在本次交接后接班。三月，薄熙来，这位中国最大的城市重庆的党委书记遭到清洗，他被控卷入腐败和谋杀丑闻，让公众对任人唯亲和权钱交易深恶痛绝。中国的两家财经刊物和微博上都呼吁高层官员要公开财产。四月，彭博社曾报道，薄家积累了至少$1.36亿的资产。（相关译文可以查看《译者合集 薄王败局》）\n\n**革命领袖**\n\n习近平及其手足是已故的革命家习仲勋的孩子，他帮助毛泽东在1949年后控制了中国，他们曾誓言要结束数个世纪来的不平等和以权谋私。习的出身让他成为\"太子党\"中的一员，他们都是高层党领导的孩子，在政治和商业上获得了很大的影响力。\n\n据彭博社的研究，习家的大部分资产都可以追踪到习的姐姐，63岁的齐桥桥；她的丈夫邓家贵61岁；他们的女儿张燕南，33岁。\n\n截止6月8日的时候，邓家贵还拥有江西稀土和稀有金属钨业有限公司18%的间接股份。这种可以用于风力涡轮和美国的智能炸弹中的金属因为中国收紧了供应而价格飙升。\n\n**远为集团**\n\n2011年12月的记录显示，齐和邓在深圳远为投资有限公司持股共值18.3亿元（2亿8800万美元），这是深圳市一家经营房地产的多元化控股公司。远为旗下有其他几家公司完全由这对夫妇所拥有，总价值至少有5.393亿元（8480万美元）。\n\n张燕南在北京合康亿盛变频科技有限公司（Hiconics Drive Technology Co 300048）投资了317万元，从2009年至今增值了40倍，按照深圳股市昨日的收盘价，已经达到1.284亿万元（2020万美元）。\n\n彭博社联系到邓家贵的手机，邓称他已经退休了。当问及他的妻子，女儿和全国各地的生意时，他说：\"不方便跟你就此说太多。\"彭博社试图通过电话和传真到齐和张的公司找到他们，但无果，我们试图按照注册的地址去找，也不成功。\n\n**新邮通信**\n\n习近平的妹夫吴龙开了一家名叫\"新邮通信设备有限公司\"的通信公司。根据公开资料和对该公司的一名注册所有人的采访，到5月28日时，这家公司仍由吴的亲戚——他弟弟的妻子所有。\n\n根据北京咨询公司\"博达克（BDA）（中国）有限公司\"的说法，\"新邮通信设备有限公司\"从国营的中国移动通信公司赢得了数亿元的合同。按用户人数计算的话，中移动是全球最大的电话公司。BDA为多家技术公司提供咨询服务。\n\n因为这一话题的敏感性，彭博社在过去两个月中联络的数十人都不愿就习家置评。我们在联络了习近平的侄女和她的英国丈夫之后，介绍这两人的网页随即被删掉。\n\n习近平亲属所拥有公司的总资产可以看出他们商业运作的广度，但不代表其盈利程度。香港房产价值是根据与其可比房产最近的交易价格来估算的。\n\n**身份证**\n\n彭博社只计算了在文件中是由习家家人拥有的可以被明确计算的资产、房产和持股。根据公开商业记录、采访熟人、香港和中国的身份证可以追踪到的资产。\n\n如果习家人用的是不同于在大陆和香港的名字的话，彭博社是与那些见过他们的人谈话，并通过不同的公司文件上所显示的相同的名字和住址来查证。\n\n彭博社提供了一张列有习家资产的单子给中国的外交部。政府方面没有回应。\n\n2000年10月，习仲勋的家人在他87岁生日时，在深圳的一个国宾馆聚会，这位开国元勋在两年后去世。深圳毗邻香港，现已成为中国最富的城市之一，这应部分归功于习仲勋，是他说服邓小平将这个渔村变成了开放市场的试验田。\n\n**家族照片**\n\n在这张照片中，习仲勋穿一件红色毛衣，拄着拐杖，坐在轮椅中。他的左边是女儿齐桥桥，右边是孙子，他旁边挨着齐心，习仲勋的妻子。后面是齐桥桥的丈夫邓家贵；她的哥哥习远平及习近平，旁边是齐安安和她的丈夫吴龙。\n\n官方媒体把习仲勋描绘成有原则、有道德的领袖，根据报道习仲勋常向自己的孩子灌输革命精神。家人们在采访中回忆说他让孩子们都穿打补丁的哥哥姐姐传下来的衣服。\n\n根据一本习仲勋的传记所说，习仲勋还拒绝让桥桥在北京上最好的中学，那时她的考分不够但是学校还是愿意招收她。后来，她以母姓上了另一所学校，这样同学们都不知道她的背景。桥桥和安安有时也用父姓。\n\n**党校**\n\n在今年三月一日，北京的中央党校，习近平对2200名干部说有些人入党因为认为这是通往财富的快捷之路。\"要保持党的纯洁性更困难了，但也比以往更重要了。\"一本官方的杂志这样记录了他的演讲。\n\n他的女儿习明泽则避免曝光。她在麻省剑桥的哈佛大学读书，用的是化名。\n\n习近平将被提升到接替胡锦涛成为中国的最高领导人还没有最终确定。他必须在18大上成为中共的总书记，然后才能在明年三月的人大会议上成为国家主席。\n\n**邓小平**\n\n对执政精英们利用政治权力来获取个人财富的不满，从30年前邓小平的经济改革开始时就已经存在了，当时他说\"要让一部分人先富起来，然后带动其他人共同富裕\"。\n\n其他高层领导的亲属们也有商业活动，温家宝的儿子与他人共同成立了一家私募基金。温家宝的前任朱镕基的儿子则是中国的一家投资银行的老总。\n\n亚洲开发银行的首席经济学家万广华说：\"我真正担心的是金权挂钩，使贪污腐败和不平等愈演愈烈，持久不消。\"\n\n政府官员炫富引起日益激烈的公开批评。前海关总署署长去年被发现配戴劳力士金表，网民们表示不齿。前总理李鹏的女儿李小琳今年3月出席政协会议，也有人讥嘲她身穿的一套国际名牌，价值12000元，足以让200个贫困儿童穿上暖和的衣服。\n\n**\"不平等\"**\n\n加州大学河滨分校中国学者林培瑞（Perry Link）说：\"民众很愤怒，因为赚钱途径不平等，成果被少数人掠夺，大众利益照顾得不够。\"\n\n温家宝在3月26日的国务院会议上说权力必须\"在阳光下运行\"，以打击腐败。虽然中国官员必须向有关当局申报收入和财产，以及直系亲属的私人资料，可是这些资料并不公开。\n\n由于缺乏透明，更加助长在中国要发财得靠\"关系\"的想法。这种情况说明了没有正式职务的太子党何以势力这么大，或者像中国俗语说的：一人得道，鸡犬升天。\n\n**\"上面有人\"**\n\n研究中国精英政治的哈佛大学教授马若德（Roderick MacFarquhar）说，\"如果你是中国某个要人的手足，人家会认为你可能是潜在的权力代理人，拼命巴结你，希望与权贵搭上关系。\"\n\n政治权力和财富之间的结盟并非中国独有。根据总统图书馆的介绍，1927年，约翰逊（Lyndon B Johnson）早年很穷，他是靠借来的$75元上了西南德州师范学校。但1964年（他的第一届总统任期期满时）生活杂志上的数据显示，就在竞选成功后的30年，到了1964年，他和他的家族在媒体和房地产的控股价值达到$1400万。\n\n纽约亚洲协会美中关系中心主任夏伟（Orville Schell）说，在任何国家都可能发现金权勾结，可是以中国为最，只要属于这些家族成员，就占很大的便宜。\n\n**对习不公平**\n\n退休的政府研究学者姚坚复呼吁领导人更多地公开财产，但这样把习近平和他的家族的生意联系起来不一定是正确的。\n\n姚在电话访谈中说：\"如果家族的其他成员是独立的商业代表，我认为这样把习家的财富算作是习近平的就不公平了。\"\n\n习氏家族的关系并非总是优势。习仲勋在1962年被毛泽东清洗。和许多其他的\"太子党\"一样，在文革中，习家的孩子被赶到了农村。齐桥桥和其他500名年轻人在内蒙古种田，有5元钱就感觉象发财了，她在接受清华大学的访谈时这么说。\n\n1976年毛死后，习家重新兴旺，习近平的姐姐齐桥桥到军队开始工作，成为了武警的一名指导员。1990年父亲退休，她便辞职在家照顾父亲，她在上述的访谈中这样说到。\n\n**购置房产**\n\n一年后，她在当时的英属地香港以300万港币的价格买了一套公寓——当时这一价格相当于普通中国工人年收入的900倍。地产登记记录显示，这一位于香港宝马山的宝马山花园的一套物业仍在她的名下。\n\n根据文件记录，1997年，齐和邓在后来成为深圳市远为实业公司的企业中投资1530万元。这家公司的资产不能公开交易。但是其中的一个子公司深圳亚伟投资名下的资产到2010年底时为18.5亿元。根据一家股票公司2011年的文件显示，这对夫妇拥有这家公司的99%股份。\n\n在那次清华访谈中，到了2002年，习仲勋去世后，齐桥桥才决定进入商界。2006年，她获得清华经管学院的MBA学位，并成立了一家民间鼓乐队，这是习仲勋的老家陕西省的民乐。\n\n**文件追踪**\n\n过去20年，齐桥桥、邓家贵、张燕南的名字，以股东、董事或法人代表（也就是董事长等公司负责人）的名义，出现在中国和香港至少25家公司申报的文件中。\n\n在一些文件中，齐还使用了Chai Lin-hing的名字。可以确认这是她因为中国公司的一份文件中的生日等特征信息和其他以齐桥桥的名义公开访谈一致。Chai Lin-hing 在香港和邓家贵还拥有数家公司和一处物业。\n\n2005年，张燕南开始在香港的文件中出现，那时齐桥桥和邓家贵把一家物业控股公司的99.98%转移给了她。这家公司名下有一处物业，位于Park的Regent的一个单元，估值有5400万港元。\n\n**浅水湾别墅**\n\n土地登记纪录显示，张燕南2009年以1.5亿港元在香港浅水湾丽景道购买一幢别墅，而自那时以来当地房价上涨大约六成。\n\n她的香港身份证号码出现在一份销售文件上，与在她和母亲、邓家贵所拥有的Special Joy投资有限公司上所用的身份证号码一致。五月十二日的登记文件显示，三个人共享了同一个香港地址。\n\n张在香港会景阁拥有另外四户豪华单位，该处房产毗邻君悦酒店，可以看到港岛全景。\n\n自从1997年从英国回归中国治下，香港一直实行自治，拥有自己的立法和银行系统。据中原地产统计，大约1/3的新豪宅的购买来自中国大陆的买家。\n\n在中国大陆，齐桥桥和邓家贵的开发项目是一个名为\"观缘\"的豪华复式住宅，靠近北京的金融区，广告号称其拥有精心修整的花园以及重现北京城历史宅院风貌的灰砖外墙。因为北京限制了对公司的查询，开发商的融资细节难以获知。\n\n**北京项目**\n\n在2006年的一次采访中，他们告诉《成功营销》杂志，为了给开发提供融资，夫妻俩从朋友和银行那里借款，目标是吸引国有公司的官员和管理人员。官方数据显示，首都的房价在随后的四年中上涨了79%。\n\n根据北京市土地资源局的数据，该项目的开发商——齐和邓的远为公司拥有70%的份额——在2004年以9560万元获得了超过1万平方米的土地，用于开发观缘。\n\n6月，观缘一套189平方米（2034平方英尺）的三室公寓在网上的挂牌价格是1500万元。每平方米售价79365元，比中国的年度人均GDP的两倍还要多。\n\n公众对飙升的住宅成本非常恼怒，使得房地产对于中国领导人而言成了一个特别敏感的问题。温家宝总理3月份表示，房价\"远远超过了合理水平\"。\n\n**\"竞争环境\"**\n\n缺少一个公平竞争的环境，难以承受的房价，意味着\"你只能远离中国梦\"，专注于中国政治研究的波士顿大学亚洲研究中心主任傅士卓（Joseph Fewsmith）如是表示\"如果靠此类不公平的机会来取得发展，中国的崛起能够持续吗？\"\n\n国立新加坡大学东亚研究所高级研究员薄智跃表示，那些找对了人脉的人能够获得政府控制的资产。\n\n他说：\"他们所需要的一切只不过是比其他人更先一步加入游戏，然后他们就能够获得巨大的收益。\"薄并不是特指习氏家族成员的投资。\n\n邓家贵另外一起投资的时机也把握得非常好，是在一家国有公司中投资稀土金属。\n\n**稀土**\n\n一份债券说明书显示，2008年，邓家贵的上海王朝投资公司以4.5亿元（7100万美元）购买了江西稀土30%的股权。\n\n邓在上海王朝中持股60%。在公司的登记文件中，有一张邓的中国身份证的复印件，与在原位分支机构文件中发现的身份证相同。文件显示，原位集团相关的管理层同时担任江西稀土的副董事长和首席财务官之职。\n\n中国在稀土金属的生产上近乎拥有垄断地位，而这笔投资恰发生在中国正在收紧控制稀土的生产和出口之时。该政策导致部分稀土金属的价格在2011年飙升了4倍。\n\n在位于南昌的江西稀土，总裁办公室的一位女性接听了电话，说她无法提供财务信息，因为公司并没有在交易所上市。她拒绝谈论上海王朝的投资，说这太敏感了。\n\n**合康亿盛变频**\n\n齐桥桥的女儿张燕南在合康亿盛投资317万元，三年后这家总部位于北京的电气设备制造商于2010年公开上市。根据合康亿盛的创始人刘锦成在清华网站上的资料，他和齐桥桥曾就读于同一个EMBA班。\n\n公司董事会秘书王东没有对传真的问题和要求评论的电话作出回复。\n\n齐和邓的商业利益可能更为广泛：他们的名字是位于北京和深圳至少11家公司的法人代表，两个城市都对获取公司的文件信息都设限，很难判断公司的所有权或者资产的价值。\n\n**大连万达**\n\n例如，邓家贵是一家总部位于北京的公司的法人代表，在2009年的一次私人配售中，该公司以3000万元购买了中国最大的开发商之一大连万达商业地产集团0.8%的股权。大连万达商业去年的销售额是953亿元（150亿美元）。\n\n大连万达商业在一份电子邮件声明中表示\"不就私人交易进行评论\"。\n\n一家官方网站和公司记录显示，邓也是一家获得政府10亿元（1.57亿美元）桥梁建设合同的公司的法人代表，该项目位于中国中部的湖北省。\n\n研究中国金融和政治的史宗翰（Victor Shih）是位于伊利诺斯州埃文斯顿市的西北大学的一名教授，他说复杂的所有权结构在中国很常见。史宗翰表示，太子党任用他们信任的人，通常是远系家族的成员，代表他们开设公司、从国有企业竞标合同。他并非特指习氏家族。\n\n**新邮通信**\n\n拿习近平的妹夫吴龙来说，广州开发区网站的两份报告（一份2009年，一份2010年）可以证实他是新邮通信的董事长。\n\n新邮通信在网站上没有提供管理层名单。在中国的搜索引擎百度上用\"吴龙\"和\"新邮通信\"搜索，会引发一个中文的警告：\"搜索结果可能不符合相关法律法规和政策，未予显示。\"\n\n资料显示，新邮通信由两位名为耿敏华（音）和华丰（音）的人拥有。在公司的文件中，他们的地址指向北京一座数十年楼龄的9层混凝土建筑物，耿年老的母亲住在那里，在她的客厅墙上钉着她女儿的手机号码。\n\n6月6日通过电话联系，耿证实她和儿子华丰拥有新邮通信，她的女儿嫁给了吴龙的弟弟吴明（音）。耿说吴龙负责公司，她不参与公司管理。\n\n**另外的所有者**\n\n在6月27日一份6页的声明中，新邮通信证实另外两个人洪英（音）和马文彪（音）为公司所有人，并表示公司的头是一个叫刘然（音）的人。公司没有对我们再一次提出解释所有人不同的要求作出回复。我们未能联系到吴龙和他的妻子齐安安进行评论。\n\n新邮通信是一家从国家合同中受益的初创公司。它的专业领域是政府强制的、由中国移动部署的家用3G移动电话标准。据BDA的消息，2007年它击败了摩托罗拉等众多的资深竞争者，获得一份手提终端的供货合同。\n\nBDA董事长邓肯·克拉克（Duncan Clark）说：\"他们原本籍籍无名，突然一下子冒了出来。人们本来认为摩托罗拉在设备合同中会获得很大份额，然后一家无名的公司就一下出现在了榜首。\"\n\n新邮通信在声明中说，2007年，国内的移动标准仍在发展中，很多大竞争者在袖手旁观，让公司获得了很大的市场份额。\n\n**习远平**\n\n去年从摩托罗拉分拆出来的摩托罗拉移动被谷歌有限公司收购，其在北京的发言人威廉·莫斯（William Moss）拒绝对任何单独竞标的细节发表评论。中国移动公司的发言人张璇（音）在电子邮件中表示，中国移动\"一贯坚持公开、公平、公正和可信的竞标原则\"。\n\n习近平的弟弟习远平创建了一家名为国际节能环保协会的能源咨询机构，并任主席。据一位拒绝透露身份的雇员说，他在该机构中并未充当积极角色。\n\n习近平的一位侄女拥有丰富资历。去年，齐安安与吴龙的女儿吴雅凝（Hiu Ng）及其35岁的丈夫Daniel Foa被列为一个网络座谈会的发言人，与英国亿万富翁理查德·布兰森（Richard Branson）和女演员达里尔·汉娜（Daryl Hannah）一起代言马尔代夫的可持续旅游。\n\n**哈德森清洁能源**\n\n吴雅凝最近开始与哈德森清洁能源合伙公司合作，帮助其在中国寻找投资机会，该公司在美国管理着一个超过10亿美元的基金。\n\n在彭博社记者联系这对夫妻之后，他们的细节被从互联网资料中删除。Foa在电话中说不能就他们2007年建立的清洁能源公司FairKlima资本发表评论。吴雅凝没有对要求采访的电子邮件作出回应。\n\n在FairKlima的网站上，两人都不再被提及。6月3日一个\"联系我们\"的缓存页面上，在\"高管团队\"的标题下还包括有吴和Foa的简历。\n\n6月8日在吴的Linkedln资料中提及她曾在新邮通信工作过，此后被删除，同时被删的还有她的\"哈德森清洁能源合伙中国公司副董事长\"的头衔。\n\n总部位于新泽西的私人股权投资公司Teaneck创始欧尼尔（Neil Auerbach）说他曾与吴雅凝共事，因为吴对可持续性长期以来都有兴趣。\n\n在6月13日的采访中，欧尼尔说：\"我们了解她的政治关系，但她的关注点是可持续投资，那就是目的。我们很乐于与她共事。\"\n\n关于本文，请联系彭博新闻社：北京，Michael Forsythe，atmforsythe@bloomberg.net;  香港，Shai Oster，soster@bloomberg.net; 香港，Natasha Khan，nkhan51@bloomberg.net; 纽约，Dune Lawrence，atdlawrence6@bloomberg.net\n\n本文版权属于原出版公司及作者所有。©译者遵守知识共享署名-非商业性使用-相同方式共享 3.0许可协议。\nPOSTED BY 译者 AT 下午10:37 43 COMMENTS\nLABELS: PRINCELING, XJP\n\n原文：Xi Jinping Millionaire Relations Reveal Fortunes Of Elite\n来源：彭博社\n发表：2012年6月29日\n本文由\"译者\"志愿者翻译并校对，参考了其他\"同来源节译\"，此为全网首发完整译文。"
		},
		{
			"post_id": 59,
			"title": "王健林道破天机：习近平家族万达持股真相",
			"date_published": 1546176181.871,
			"body": "中国财新传媒旗下财经网10月30日报道，中国首富、万达集团董事长王健林头一天在美国哈佛大学公开演讲时，回应主持人就中国最高领导人习近平姐姐、姐夫控股的公司曾入股万达旗下的万达商业地产提出的问题，一语道破天机，直接证实了美国之音和纽约时报等媒体先前报道的习近平家族万达持股真相。\n\n---\n\n经过多年深入调查并首先揭示习近平家族财富的纽约时报记者傅才德，星期五接受美国之音采访时指出，王健林星期四关于习近平家族财富的公开讲话可能犯了一个错误，以至于给了外界一个窗口，让人们看到在中国有权有势的人可以把股权在名义上转让给别人，让自己变成一隐藏在幕后的实际股东。\n\n财新网星期五报道，中国地产大亨王健林星期四在哈佛大学主讲“公开课”，在回应有关纽约时报报道时，他说，齐桥桥和邓家贵在万达上市前两个月就已经把万达的股票全部转让，并说 “这件事邓家贵先生是牺牲了巨大利益的”。齐桥桥和邓家贵是中国国家主席、中共总书记习近平的姐姐和姐夫。\n\n但是，财新这篇报道王健林赞扬习近平“治国严，治家更严”的文章几个小时后就从财新网上被撤下。\n\n**习家族仍是股权主人**\n\n傅才德告诉美国之音说：“奇怪的是，邓家贵和齐桥桥那个时候（2014年12月）已经没有万达的股票了，因为根据工商局的材料，2013年10月份，他们已经把他们万达的股权转让给他们的一个长期职工徐再生。”\n\n傅才德说，王健林在哈佛演讲中可能无意中说出了邓家贵和齐桥桥实际上仍然是股权主人的事实， “虽然那个时候齐桥桥和邓家贵已经没有万达的股票，但实际上他们有。王健林有可能犯了个错误，但这给了我们一个窗户，看到中国很有权力的人有办法把他们的股权名义上让给别人，这就是所谓的‘白手套’现象。”\n\n星期五，傅才德就此在纽约时报发表报道说：“在为他（王健林）的公司与习近平家族的关系辩护时，王健林先生可能无意中在提醒大家有关中国权贵之间的通常做法：为掩盖商业利益，有时要把股份转让给亲戚或商业伙伴。”\n\n傅才德说，截止星期五，秦川大地投资有限公司现在仍只有一个股东，就是徐再生。\n\n今年4月28日，傅才德在纽约时报发表《万达帝国王健林：游刃于商业与权贵之间》后告诉美国之音：“2013年10月8日，齐桥桥把她在秦川大地公司的股权转让给一个人，徐再生，这个人是他们的职员，公司副经理。”\n\n他说，从工商局内部档案查获的信息显示，“徐再生从2000年开始就在齐桥桥和邓家贵持股的深圳远为投资有限公司工作，到2013年他已经跟齐桥桥、邓家贵工作了13年了。所以，我们虽然不能说这些股份还是齐桥桥的，但是应该有一点怀疑。”\n\n**怀疑被王健林证实**\n\n显然，半年前傅才德的怀疑，半年后让王健林在哈佛证实了。这也许是当局立刻撤下这篇文章的主要原因之一。傅才德在报道中说，“中国商人对最高领导人的股权持有作出评论是极为罕见的”。\n\n**公共记录无法证实已经卖掉万达股份**\n\n傅才德在星期五的报道中说，万达上市前的文件显示，秦川大地投资有限公司在2014年8月中旬仍是万达股权持有公司。\n\n报道说，从公共记录看不到秦川大地是不是已经卖掉了万达的股份。他还说，2013年底秦川大地持有3家公司股份，其中包括万达。而在该公司2014年的年度报告中，没有列出任何投资。\n\n财新网的报道说，王健林是首位在美国哈佛大学“公开课”上演讲的中国企业家，王健林在演讲中还说，万达“没有背景”，“公司发展靠的是商业模式和企业管理”。\n\n**万达的高层背景已被证明**\n\n傅才德说，纽约时报的调查已经证明了王健林不仅有背景，而且有很大的背景。傅才德说：“当然，很多人说王健林很有能力，很聪明，是个非常好的商人，但是，我们已经证明了他有背景，他有这么多强有力的领导人跟他有金融方面的关系。”\n\n傅才德说，万达上市前的20个最大股东中有4个是中共政治局委员以上领导人的亲戚和商业伙伴。\n\n傅才德说，王健林星期四的演讲已经公开承认了万达与习近平家族的关系。傅才德说：“还有贾庆林、温家宝家族，第四个，最大的是王兆国家族。这是我们已经证明了的，有可能还有一些人，但是我们没有证明，所以只能说这4个。他们4个家庭的股票价格现在一共是12亿美金。而王兆国的亲属，他们最初花了50万美金，现在的价格大概是5亿美金，增加了1000倍。”"
		},
		{
			"post_id": 58,
			"title": "孟晚舟溫哥華豪宅內景曝光 內部裝修十分奢華",
			"date_published": 1544351332.386,
			"body": "劉曉棕名下登記的兩處物業都位於溫哥華豪宅地段，分別為桑拿斯區（Shaughnessy）的1603馬修斯大道（Matthews Avenue），以及登巴區（Dunbar）的西28號大道（West28th Avenue）。兩間大屋均屬兩層高大宅，記者現場可見，大宅的全部窗戶拉上窗帘和百葉簾，花園修葺得十分整齊，看似有人打理。而西28號大道的大宅外則安裝有監控鏡頭。\n\n孟晚舟的1603馬修斯大道豪宅擁有7間房、8間浴室，內部裝修十分奢華\n\n![1.jpg (0x0)](data/img/post_58_1.jpg)\n\n![2.jpg (0x0)](data/img/post_58_2.jpg)\n\n![3.jpg (0x0)](data/img/post_58_3.jpg)\n\n![4.jpg (0x0)](data/img/post_58_4.jpg)\n\n![5.jpg (0x0)](data/img/post_58_5.jpg)\n\n![6.jpg (0x0)](data/img/post_58_6.jpg)\n\n![7.jpg (0x0)](data/img/post_58_7.jpg)\n\n---\n\n華為副董事長兼財務總監孟晚舟的保釋申請聆訊，將於溫哥華時間12月10日早上，在加拿大卑詩省高級法院開庭續審。孟晚舟透過代表律師提出，願意交出中國護照和香港特區護照、戴上電子腳鐐，以及抵押丈夫劉曉棕（Xiaozong Liu）在溫哥華持有的2間豪宅，作為保釋條件。《蘋果》記者前往兩幢豪宅實地視察，但見大門緊鎖，沒有人應門。\n\n劉曉棕名下登記的兩處物業都位於溫哥華豪宅地段，分別為桑拿斯區（Shaughnessy）的1603馬修斯大道（Matthews Avenue），以及登巴區（Dunbar）的西28號大道（West28th Avenue）。兩間大屋均屬兩層高大宅，記者現場可見，大宅的全部窗戶拉上窗帘和百葉簾，花園修葺得十分整齊，看似有人打理。而西28號大道的大宅外則安裝有監控鏡頭。\n\n<span data-cke-bookmark=\"1\" style=\"display: none;\"> </span>"
		},
		{
			"post_id": 57,
			"title": "共产党员家里的钱真多",
			"date_published": 1536472226.312,
			"body": "![8.jpg (24x24)](data/img/post_57_8.jpg)"
		},
		{
			"post_id": 56,
			"title": "副省长",
			"date_published": 1536470832.29,
			"body": "![9.jpg (24x24)](data/img/post_56_9.jpg)"
		},
		{
			"post_id": 55,
			"title": "嘆為觀止 中共華融董事長私藏現金約3噸 2.7億",
			"date_published": 1533922551.535,
			"body": "中國華融資產管理股份有限公司（簡稱：華融）前董事長賴小民案再曝驚人案情，其家中藏有贓款現金達2.7億，重達3噸。 8月10日，《財新》報導，辦案人員在賴小民的幾處房產里，搜出的外幣現金以人民幣計算，共計2.7億，重達3噸。\n\n![9.jpg (24x24)](data/img/post_55_9.jpg)"
		},
		{
			"post_id": 54,
			"title": "中国国家主席习近平送给了我一个礼物，他给了20亿元人民币。",
			"date_published": 1533123757.048,
			"body": "斯里兰卡总统西里塞纳7月21日在中国援建的一个医院开工典礼上说： “中国大使来我家确定开工典礼日期的时候对我说，中国国家主席习近平送给了我一个礼物。他给了20亿元人民币，用于任何我所希望的项目”。\n\n![2.jpg (699x395)](data/img/post_54_2.jpg)\n\n据路透社消息：2017年巴基斯坦最高法院宣布，取消总理纳瓦兹•谢里夫的任职资格。调查小组表示，谢里夫家庭无法解释巨额资产来源。谢里夫已经接受法院裁决！谢里夫总理表示；我没贪污巴基斯坦人民一分钱，这些都是中国政府白送的。"
		},
		{
			"post_id": 53,
			"title": "王岐山就在摩根大通涉案的25名中国部级官员名单中",
			"date_published": 1528373141.295,
			"body": "今天瑞信向美国司法部认罚4700万美元，起因瑞信在中国通过高官裙带关系进行不正当经营。\n\n之前摩根大通以同样原因被罚2.64亿美元。这些有真凭实据的腐败案件的主角们——涉案中共高官却在中共“反腐”大旗庇护下，毫发无伤，甚至至今身居要职。最可笑的是王岐山就在摩根大通涉案的25名中国部级官员名单中。\n\n![9.jpg (24x24)](data/img/post_53_9.jpg)"
		},
		{
			"post_id": 52,
			"title": "一带一路 一路腐败",
			"date_published": 1527743822.399,
			"body": "![9.jpg (24x24)](data/img/post_52_9.jpg)"
		},
		{
			"post_id": 51,
			"title": "习近平的一路一带计划卷入世界上最大的腐败案",
			"date_published": 1527476344.256,
			"body": "马来西亚首相马哈蒂尔形容，耗资550亿令吉的东海岸铁路出现「奇怪」安排，大马政府借贷的相关款项却存放海外，他怀疑针对东铁贷款是否用来缴付一个马来西亚发展有限公司（1MDB）债务及收购公司。\n\n马哈蒂尔批评这条铁路非常奇怪：建筑商必须来自中国，贷款也必须来自中国。他认为超200亿美元的贷款本息超出了大马承受力，有害无益。这条铁路长约800公里，造价约1000亿人民币，被认为是习近平一带一路重要组成部分。\n\n//LifeTime 视界‏ ：习近平的一路一带计划卷入世界上最大的腐败案。马来西亚“东铁”是采用中国高铁推销成功的一条半中的一条。中共在“东铁”项目上很诡异：合同价奇高，中方贷款不入马来西亚银行，付款不按工程进度付款。马新政府高度怀疑是纳吉布与中共联手，用“高铁款”在海外支付一马基金亏空。"
		},
		{
			"post_id": 50,
			"title": "实名举报：北京经信委原副主任王颖光 17处房产、资产过亿",
			"date_published": 1526817119.917,
			"body": "求助人：张方。\n\n王颖光(平谷人，副局级，现已退休)之子王超的妻子。王颖光系原北京市经济和信息化委员会副主任。张方与王超是经王颖光介绍相识并相恋，与2012年6月登记结婚，婚后育有一女。\n\n![1.jpg (0x0)](data/img/post_50_1.jpg)​​​​​​​\n\n　　我这里举报厅官王颖光巨额财产来源不明，亿万财产。现将王颖光的亿万家产公布如下，包括但不限于以下：\n\n　　其中对王颖光名下多处银行存款、现金未做列举\n\n　　(一)房产：17处，价值过亿\n　　1、双井富力城C区12楼，2102室、160平 (1800万元)\n　　2、双井富力城D区7楼，103室、160平 (2000万元)\n　　3、双井富力城E区27楼，505室、180平 (2000万元)\n　　4、双井富力城E区27楼，202室，120平 (1500万元)\n　　5、望京西园西区，415楼，1608号\n　　6、海南观澜公寓1栋B单元，102室，100平\n　　7、海南观海台壹号别墅16栋，夏荷居16B，500平(1500万元)\n　　8、平谷温泉别墅A12，500平\n　　9、平谷温泉别墅102，300平\n　　10、丰台政馨园一区一期5楼\n　　11、通州自由筑，3230\n　　12、燕郊黄金SOHO，0333\n　　13、燕郊黄金SOHO，0327\n　　14、富力城C区1602\n　　15、富力城C区1603\n　　16、富力城D区2243\n　　17、富力城E区100\n　　(二)车辆：2辆，价值百万\n　　18、奥迪A4\n　　19、宝马双门轿跑车\n　　(三)其他消费：2380万元\n　　20、象牙制品300万\n　　21、留学费用500万\n　　22、海南别墅装修250万\n　　23、名包名表、首饰100万\n　　24、股票投资200万\n　　25、滑雪娱乐30万\n　　26、饭店投资200万\n　　27、股票投资300万\n　　28、海南黄花梨500万\n　　以上所述句句属实，望广大网友查证求实!\n　　希望今天的无奈之举，可以得到广大热心群众的理解与支持!!!\n　　谢谢各位!!!\n　　求助人：张方"
		},
		{
			"post_id": 49,
			"title": "习包子与吉利汽车的老总李书福的关系--习包子的白手套",
			"date_published": 1524746206.466,
			"body": "《纽约时报》在吹捧习包子的时候报道：“习近平在2002年末上任（中共浙江省委书记）不久后，就参观了当时浙江省唯一的汽车制造商吉利公司(Geely)。该公司不屈不挠的创始人李书福刚开始从国有银行获得一些资金。习近平评论道，‘像吉利这样的企业，如果我们不加以大力扶持，那我们还去扶持谁呢？’”\n\n不过习包子为什么要大力扶持李书福？\n\n所以，习近平与吉利汽车的老总李书福的关系眼下成为中国国内外众多人关注的焦点，因为吉利汽车的快速发展跟习近平官职升迁有明显的连带关系。\n\n如果你不是绝对的傻逼，一定会注意到，李书福的公司从一开始就获得雄厚的国有资金支持，最近更是在中国当局大力收紧中国公司海外并购政策之际逆势而上，从国有公司得到92亿美元的融资，投资德国著名汽车制造厂商戴姆勒集团，成为其最大股东之一。中国媒体也对李书福及其公司给予了大量的正面报道。\n\n李书福到底是谁？\n\n---\n\n有好事的网民发现，李书福妻子的名字与习近平的妻子彭丽媛的妹妹彭丽娟的名字居然是一样的。于是，在许多中国网民看来，李书福为什么能得到习近平本人大力加持的谜底一下揭开。\n\n面对中国国内外的纷纷议论，习近平及其宣传班子，采取和王岐山同样的做法，一直保持着沉默，沉默，再沉默。\n\n习包子和李书福是不是连襟？\n\n一，从来没见彭丽媛出来说话，即使她知道这传言对习多么不利；\n\n二，从来没见李书福出来说话，即使他知道（假充习近平妻妹的丈夫）是伟大领袖习包子的侮辱。\n\n三，从来没见彭丽娟出来说话，即使她知道只要简单露个脸就是对姐夫的莫大支持。奇怪的是这都没有。有的只是沉默，装聋作哑，最有动机最有证据出来说话的人都不出来说话，吃瓜群众还敢说什么呢？”\n\n当然习包子与李书福的关系也引起说话国际主流媒体的注意，其中包括美国《纽约时报》记者傅才德的注意。3月5日，傅才德发表推特贴说：\n\n“这么说，我们如今也知道了李书福的妻子的名字了吗？这有文件证据吗？假如真的，必定是二婚，因为为什么这婚姻关系的结成发生在习近平到浙江任职的2002年之前？”\n\n李书福妻子之迷\n\n德国之声是这样说李书福的妻子：\n\n作为中国民营车企的领头羊，吉利集团频繁见诸报端，李书福也不避讳媒体采访。其儿子李星星和女儿李艺，甚至弟弟李书通也都不是\"秘密\"，唯独妻子的名字无从查证。\n\n在外界公开消息中，也仅在汇丰银行旗下杂志\"Week in China\"去年7月的一份报道中找到相关字眼。文章写道：\"眼尖的网民发现李书福妻子的名字和习近平妻子彭丽媛妹妹的名字重名（编者注：彭丽娟）。这种巧合听上去无关紧要，但是对一些人而言，这正支撑了吉利得到高层支持的说法。\"\n\n不过，如果我们在GOOGLE上查一下，就可以知道：\n\n彭丽媛的妹妹彭丽娟，曾经是彭丽媛的经纪人；吉利汽车董事长李书福现任妻子。当然如果GOOGLE上面的东西可以相信的话我们就知道， 原来李书福就是习包子的白手套。\n\n天天在中国梦的习包子，家里也同样有白手套，他的屁股上面也有屎，而且没有擦掉。"
		},
		{
			"post_id": 48,
			"title": "习近平二姐夫吴龙发家被媒体查的一清二楚",
			"date_published": 1524735998.864,
			"body": "通过代理三大国企电信公司3G设备进口，毫不费力拿下30亿合同。这是习近平“理直气壮做强国企”的真正动力。\n\n![8.jpg (0x0)](data/img/post_48_8.jpg)​​​​​​​"
		},
		{
			"post_id": 47,
			"title": "作为习的“妹夫”，李书福真牛！",
			"date_published": 1523247009.216,
			"body": "就在中国富豪被停止海外投资收购之际，吉利老板李书福，却以90亿美元收购戴姆勒近10%股权而成为最大股东，傲视群雄。目前李麾下已拥有奔驰、沃尔沃、Polestar、领克、伦敦电动、远程商用等多个国际汽车品牌，吉利还对宝腾、路特斯汽车及太力飞行汽车进行了战略性投资。"
		},
		{
			"post_id": 46,
			"title": "朱鎔基女儿朱燕来的巨额财富",
			"date_published": 1523186692.786,
			"body": "![7.jpg (0x0)](data/img/post_46_7.jpg)​​​​​​​"
		},
		{
			"post_id": 45,
			"title": "习近平外甥女在香港持有物业价值3亿",
			"date_published": 1523174082.213,
			"body": "香港苹果日报曝光了习近平家族在港6亿的物业。仅浅水湾的一套住宅，09年1,5亿购入，目前市值此3亿。海外已多次曝光习家的财富，习近平以贪反贪，反贪完全是个笑话，不过是清除政敌，欺世盗名而已。\n![8.jpg (0x0)](data/img/post_45_8.jpg)​​​​​​​"
		},
		{
			"post_id": 44,
			"title": "新常委家族部分在港资产",
			"date_published": 1523156240.1,
			"body": "![8.jpg (0x0)](data/img/post_44_8.jpg)​​​​​​​"
		},
		{
			"post_id": 43,
			"title": "习近平家族与晓建华的关联",
			"date_published": 1523105695.268,
			"body": "![9.jpg (0x0)](data/img/post_43_9.jpg)​​​​​​​"
		},
		{
			"post_id": 42,
			"title": "中共高层与王健林的关系",
			"date_published": 1523092950.37,
			"body": "![1.jpg (0x0)](data/img/post_42_1.jpg)​​​​​​​"
		},
		{
			"post_id": 41,
			"title": "被遗忘在阳台的现金",
			"date_published": 1520495290.873,
			"body": "![9.jpg (0x0)](data/img/post_41_9.jpg)​​​​​​​"
		},
		{
			"post_id": 40,
			"title": "孙政才家的现金",
			"date_published": 1520481423.16,
			"body": "![7.jpg (0x0)](data/img/post_40_7.jpg)​​​​​​​"
		},
		{
			"post_id": 39,
			"title": "New blog post",
			"date_published": 1520470219.304,
			"body": "![8.jpg (0x0)](data/img/post_39_8.jpg)​​​​​​​"
		},
		{
			"post_id": 38,
			"title": "国家能源局煤炭司司长家里的巨额现金",
			"date_published": 1520440239.55,
			"body": "![8.jpg (0x0)](data/img/post_38_8.jpg)\n\n![9.jpg (0x0)](data/img/post_38_9.jpg)​​​​​​​"
		},
		{
			"post_id": 37,
			"title": "贵阳市长助理家的人民币现金",
			"date_published": 1520429362.697,
			"body": "![8.jpg (0x0)](data/img/post_37_8.jpg)​​​​​​​"
		},
		{
			"post_id": 36,
			"title": "这是某地级市城管局长家里搜出来的",
			"date_published": 1520418677.068,
			"body": "![8.jpg (0x0)](data/img/post_36_8.jpg)​​​​​​​"
		},
		{
			"post_id": 35,
			"title": "最高法院副院长的儿子家里居然有21吨人民币现金",
			"date_published": 1520406169.114,
			"body": "![8.jpg (0x0)](data/img/post_35_8.jpg)​​​​​​​"
		},
		{
			"post_id": 34,
			"title": "20亿美元现金",
			"date_published": 1520394934.636,
			"body": "![9.jpg (0x0)](data/img/post_34_9.jpg)\n\n![10.jpg (0x0)](data/img/post_34_10.jpg)​​​​​​​"
		},
		{
			"post_id": 33,
			"title": "New blog post",
			"date_published": 1520224893.431,
			"body": "![9.jpg (0x0)](data/img/post_33_9.jpg)​​​​​​​"
		},
		{
			"post_id": 32,
			"title": "猜猜文件柜里是啥？是美元哦",
			"date_published": 1520083887.461,
			"body": "![9.jpg (0x0)](data/img/post_32_9.jpg)​​​​​​​"
		},
		{
			"post_id": 31,
			"title": "猜猜文件柜里是啥？是美元",
			"date_published": 1520074049.178,
			"body": "![8.jpg (0x0)](data/img/post_31_8.jpg)\n\n![9.jpg (0x0)](data/img/post_31_9.jpg)​​​​​​​"
		},
		{
			"post_id": 30,
			"title": "好疯狂",
			"date_published": 1520062961.213,
			"body": "![8.jpg (0x0)](data/img/post_30_8.jpg)\n\n![9.jpg (0x0)](data/img/post_30_9.jpg)​​​​​​​"
		},
		{
			"post_id": 29,
			"title": "全世界这种疯子都一样的毛病，用黄金做枪",
			"date_published": 1520045919.438,
			"body": "![8.jpg (0x0)](data/img/post_29_8.jpg)\n\n![9.jpg (0x0)](data/img/post_29_9.jpg)​​​​​​​"
		},
		{
			"post_id": 28,
			"title": "哪家的红三代红四代？",
			"date_published": 1520002285.752,
			"body": "24岁，4000万全款买了栋豪宅 登上澳洲头条\n\n![8.jpg (0x0)](data/img/post_28_8.jpg)​​​​​​​"
		},
		{
			"post_id": 27,
			"title": "中共官员们在美国的一个二奶村是这样的",
			"date_published": 1519956004.824,
			"body": "![8.jpg (0x0)](data/img/post_27_8.jpg)\n\n![9.jpg (0x0)](data/img/post_27_9.jpg)​​​​​​​"
		},
		{
			"post_id": 26,
			"title": "共产党徒们的家业",
			"date_published": 1519922111.405,
			"body": "![8.jpg (0x0)](data/img/post_26_8.jpg)​​​​​​​"
		},
		{
			"post_id": 25,
			"title": "共产党徒们的家业",
			"date_published": 1519912338.236,
			"body": "![8.jpg (0x0)](data/img/post_25_8.jpg)\n\n![9.jpg (0x0)](data/img/post_25_9.jpg)​​​​​​​"
		},
		{
			"post_id": 24,
			"title": "共产党徒们的家业",
			"date_published": 1519900187.43,
			"body": "![8.jpg (0x0)](data/img/post_24_8.jpg)​​​​​​​"
		},
		{
			"post_id": 23,
			"title": "共产党们的这份家业 他们确实不肯丢",
			"date_published": 1519890101.463,
			"body": "![8.jpg (0x0)](data/img/post_23_8.jpg)\n\n![9.jpg (0x0)](data/img/post_23_9.jpg)​​​​​​​"
		},
		{
			"post_id": 22,
			"title": "共产党的官员能奢侈到这样的程度",
			"date_published": 1519866120.19,
			"body": "![8.jpg (0x0)](data/img/post_22_8.jpg)\n\n![9.jpg (0x0)](data/img/post_22_9.jpg)​​​​​​​"
		},
		{
			"post_id": 21,
			"title": "共产党离奇的等级制度",
			"date_published": 1519804094.865,
			"body": "![8.jpg (0x0)](data/img/post_21_8.jpg)​​​​​​​"
		},
		{
			"post_id": 20,
			"title": "毛泽东的供给制延续下来的制度性腐败",
			"date_published": 1519784571.883,
			"body": "![8.jpg (0x0)](data/img/post_20_8.jpg)​​​​​​​"
		},
		{
			"post_id": 19,
			"title": "从延安延续至今的取暖等级制度",
			"date_published": 1519746961.246,
			"body": "![9.jpg (0x0)](data/img/post_19_9.jpg)​​​​​​​"
		},
		{
			"post_id": 18,
			"title": "毛泽东时代延续至今的特权",
			"date_published": 1519737457.264,
			"body": "![9.jpg (0x0)](data/img/post_18_9.jpg)\n\n![8.jpg (0x0)](data/img/post_18_8.jpg)​​​​​​​"
		},
		{
			"post_id": 17,
			"title": "毛泽东时代延续至今的高干病房",
			"date_published": 1519725728.978,
			"body": "![6.jpg (0x0)](data/img/post_17_6.jpg)​​​​​​​"
		},
		{
			"post_id": 16,
			"title": "毛泽东时代延续至今的制度性腐败",
			"date_published": 1519712627.215,
			"body": "干部病房的大同装修\n\n![8.jpg (0x0)](data/img/post_16_8.jpg)\n\n干部病房的病房内部装修\n\n![9.jpg (0x0)](data/img/post_16_9.jpg)​​​​​​​"
		},
		{
			"post_id": 15,
			"title": "高干病房",
			"date_published": 1519699387.248,
			"body": "毛泽东时代的高干医院变成了现在的高干病房。毛泽东时代的高干医院在上海叫华东医院，社会地位很低的人根本就不知道是一个特权医院。现在的高干病房是公开挂牌的，社会地位很低的人也能知道这种特权的存在。\n\n![9.jpg (0x0)](data/img/post_15_9.jpg)​​​​​​​"
		},
		{
			"post_id": 14,
			"title": "毛泽东时代的高干医院变成了现在的高干病房",
			"date_published": 1519643919.483,
			"body": "毛泽东时代的高干医院是不公开的，社会地位很低的人是不知道的。现在的高干病房是公开挂牌的，而且普遍设立在各大医院，所以即使社会地位很低的人也能知道。\n\n![9.jpg (0x0)](data/img/post_14_9.jpg)​​​​​​​"
		},
		{
			"post_id": 13,
			"title": "毛泽东时代叫高干医院，现在叫高干病房",
			"date_published": 1519632763.094,
			"body": "毛泽东时代叫高干医院，普通人不能进，但是数量没那么多，如北京的301医院，上海的华东医院。现在叫高干病房，铺天盖地，到处都是。\n\n![9.jpg (0x0)](data/img/post_13_9.jpg)​​​​​​​"
		},
		{
			"post_id": 12,
			"title": "毛泽东时代延续至今的制度性腐败 高干医院",
			"date_published": 1519617762.861,
			"body": "![9.jpg (0x0)](data/img/post_12_9.jpg)​​​​​​​"
		},
		{
			"post_id": 11,
			"title": "中共腐败的源头",
			"date_published": 1519605009.11,
			"body": "![7.jpg (0x0)](data/img/post_11_7.jpg)​​​​​​​"
		},
		{
			"post_id": 10,
			"title": "毛泽东时代建立一直延续至今的制度性腐败",
			"date_published": 1519575851.331,
			"body": "![5.jpg (0x0)](data/img/post_10_5.jpg)​​​​​​​"
		},
		{
			"post_id": 9,
			"title": "毛泽东时代人民不可以进入公仆才可以进入的商店",
			"date_published": 1519532383.984,
			"body": "![7.jpg (0x0)](data/img/post_9_7.jpg)\n\n![8.jpg (0x0)](data/img/post_9_8.jpg)​​​​​​​"
		},
		{
			"post_id": 8,
			"title": "毛泽东时代的腐败 中央机关的特供商店",
			"date_published": 1519521785.575,
			"body": "![9.jpg (0x0)](data/img/post_8_9.jpg)​​​​​​​"
		},
		{
			"post_id": 7,
			"title": "毛泽东时代的腐败特权",
			"date_published": 1519486808.302,
			"body": "![9.jpg (0x0)](data/img/post_7_9.jpg)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "毛泽东时代的腐败",
			"date_published": 1519475478.391,
			"body": "![9.jpg (0x0)](data/img/post_6_9.jpg)​​​​​​​"
		},
		{
			"post_id": 5,
			"title": "省部级官员退休以后的级别待遇与福利",
			"date_published": 1519461585.773,
			"body": "![9.jpg (0x0)](data/img/post_5_9.jpg)​​​​​​​"
		},
		{
			"post_id": 4,
			"title": "周恩来1938年在汉口豪华奢侈宴请惊同窗",
			"date_published": 1519450331.819,
			"body": "　　吴国桢与周恩来在南开中学时同窗，1938年两人在汉口重逢。(周恩来与吴国桢，对于中国20世纪的这样两个人物，用吴国桢夫人黄卓群女士的话来说是“同窗不同路”。“同窗”指周、吴两位是当年南开极要好的中学同学。“不同路”是指他们两人在政治上的分道扬镳。)\n\n　　当时任汉口市长的吴国桢为了不让共产党人误以为自己贪污，就在吴家叫了一桌十六元的普通宴席。周恩来回请时叫的则是汉口最豪华酒店最好的酒席。\n\n　　也是毕业于南开、当时做外交部秘书的段观海问：“恩来，你这酒席是汉口最好的，我知道它是三十六元一桌。加上这样好的花雕，今夜你破费约在五十元，那么你的薪金是多少呢？ ”\n\n　　周简单地说：“五块钱。”\n\n　　大家都很吃惊：“那么，你怎么付得起这顿昂贵的饭钱呢？ ”\n\n　　周笑着说：“这顿饭钱由组织出，是组织允许我可以用这笔钱请你们的。 ”\n\n　　段观海因为正坐在周恩来身旁，看到他穿的是缎子狐皮袍：“难道也是组织供给你的？”\n\n　　周回答“是的”后解释道：“你们知道，我们是共产党人，我们共享一切，我什么也不占有，组织提供我所需要的一切。”\n\n　　坐在旁边的段观海再也忍不住了，他哈哈大笑：“这样我也可以做共产党员了！”"
		},
		{
			"post_id": 3,
			"title": "中共早期的腐败",
			"date_published": 1519363608.212,
			"body": "在逮捕向忠发时,尚捕到一个和他同居的妇女,她年在二十五岁左右,装饰极时髦, 容貌及身段也够得上美丽的标准,问她关于共产党方面的一切问题,竟全无所知,不久, 我们完全明白,她确与共产党无关,她只是一个普通的舞女,她是被共产党弄来陪伴向忠发的,她只知道和自己同居的男人是个珠宝商人,不知是共产党,更不知是坐共产党第一把交椅的人物。\n\n至于共产党何以要个女人去陪向忠发呢?目的就在使向忠发的全部心情和精力,消耗在温柔乡里,不要过问党内的事情。后来,我们从另一个共产党的口中,又知道共产党为了这个舞女曾出了八千元的巨大代价,为了此事,共产党内部还引起许多牢骚: “下级同志穷得连饭都吃不起, 为什么上级能拿出这许多钱来替向忠发娶姨太太呢?”\n\n-----徐恩曾:共产党员们是怎样叛变的?"
		},
		{
			"post_id": 2,
			"title": "李鹏的私人火车--专列",
			"date_published": 1519354005.577,
			"body": "![8.jpg (0x0)](data/img/post_2_8.jpg)\n\n这是李鹏的级别待遇，在中共的制度范围内，这不是腐败，是应该享受的级别待遇。中共有很多这样那样的级别待遇，不过如果一个人的社会地位很低，他根本就不可能知道中共的级别待遇有哪些。\n\n所以，绝大部分的中国人都以为毛泽东时代没有腐败，其实中共这种制度性腐败就是毛泽东在延安建立的。王实味就是因为批判中共的这种制度性腐败，“衣分三色，食分五等。”被砍死的。\n\n但是毛泽东不是中共腐败最早的创立者，中共从一开始就是一个腐败的政党。"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}