{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Админ зеркала Check you решил подзаработать бабок",
			"body": "...и теперь каждый линк с сайта ведет на сайты с рекламой.\nУ кого осталось зеркало сайта где-то месячной давности для перезалива?",
			"added": 1577907680
		}
	],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1_14KCmHnYKHscRd3tsRZTnohv1WaofKAGUM": [
			{
				"comment_id": 1,
				"body": "> [spacepunk](#comment_1_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X):  оно пытается остановить необратимое, а именно стремление человека к равенству и свободе.\nНе хочу разочаровывать, но это не совсем верно. Если убрать государство и правоохранительные органы, то очень быстро власть захватят обладающие силой и не стесняющиеся ее применять. Разброс между слоями \"человечества\" только увеличится.",
				"added": 1573136674
			},
			{
				"comment_id": 2,
				"body": "> [awpav4knuc](#comment_2_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk): зачем нужно такое человечество.\n\nА другого нет",
				"added": 1573303515
			},
			{
				"comment_id": 3,
				"body": "> [awpav4knuc](#comment_3_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk): Собственно, в частности, либертарианский подход в том, что люди добровольно отказываются творить дичь друг с другом. А кто не согласен - того изгнать силой.\n\nА кто решает что является дичью, а что нет? И откуда уверенность что сил будет на стороне противников \"дичи\"?",
				"added": 1573303620
			},
			{
				"comment_id": 4,
				"body": "> [spacepunk](#comment_6_1N7ozinXUWETvJKAfmTTdKzYp2pVtY3p7X): А вы попробуйте централизовать самые популярные сервисы взаимодействия - Bitcoin или Tor. Скоро к этим сервисам еще ZeroNet прибавится.\n\nЗачем пробовать? Они уже централизованы.",
				"added": 1573303895
			},
			{
				"comment_id": 5,
				"body": "> [awpav4knuc](#comment_4_17BiztV4FPbkq1EgrLMgcVD1hXSsw8gQtk): Лично я уверен в том, что люди могут защитить самих себя, когда их большинство.\n\nДа? Тогда же каким образом на протяжении сотен лет существовали рабовладельческие и крепостные строи? Большинство были рабами и подчинялись силе и решениям меньшинства.",
				"added": 1573328072
			},
			{
				"comment_id": 6,
				"body": "Для кого-то тюрьма это наказание и лишение свободы, а для кого-то крыша над головой и питание. Ты предлагаешь вести борьбу, не не объясняешь за что. За абстрактную \"свободу\" и лозунги о ней большинство бороться не пожелает ибо не видит смысла и не видит что они этим выиграют.",
				"added": 1573665139
			},
			{
				"comment_id": 7,
				"body": "> [if0](#comment_264_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Нужно разжавать, в рот положить, а потом еще попросить проглотить? Нет. Увольте. Борьба изначально бесперспективна, когда \"борцунам\" требуется объяснять \"за что им бороться\", потому что они сами настолько тупые, что этого своим умом понять не могут, да еще, к тому же, \"их все устаивает\".\nЕсли ты хочешь повести за собой народ, то да, нужно.",
				"added": 1573711703
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 8,
				"body": "+1 за порно",
				"added": 1574876062
			}
		]
	},
	"comment_vote": {
		"3_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": 1
	}
}