{
    "article": [
        {
            "title": "Peer-to-peer",
            "text": "{{short description|Type of decentralized and distributed network architecture}}\n{{Distinguish|Point-to-point (telecommunications)}}\n{{About|peer-to-peer computer networks}}\n[[Image:P2P-network.svg|thumb|200px|A''' peer-to-peer (P2P) network''' in which interconnected nodes (\"peers\") share resources amongst each other without the use of a centralized administrative system]]\n[[Image:Server-based-network.svg|thumb|200px|A network based on the '''[[client-server model]]''', where individual [[Client (computing)|''clients'']] request services and resources from centralized [[server (computing)|servers]]]]\n\n'''Peer-to-peer''' ('''P2P''') computing or networking is a [[distributed application]] architecture that partitions tasks or workloads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes.\n\nPeers make a portion of their resources, such as processing power, disk storage or network bandwidth, directly available to other network participants, without the need for central coordination by servers or stable hosts.<ref>Rüdiger Schollmeier, ''A Definition of Peer-to-Peer Networking for the Classification of Peer-to-Peer Architectures and Applications'', Proceedings of the First International Conference on Peer-to-Peer Computing, IEEE (2002).</ref> Peers are both suppliers and consumers of resources, in contrast to the traditional [[client-server]] model in which the consumption and supply of resources is divided. Emerging collaborative P2P systems are going beyond the era of peers doing similar things while sharing resources, and are looking for diverse peers that can bring in unique resources and capabilities to a [[virtual community]] thereby empowering it to engage in greater tasks beyond those that can be accomplished by individual peers, yet that are beneficial to all the peers.<ref name=CP2P>{{cite journal|last=Bandara|first=H. M. N. D|author2=A. P. Jayasumana|title=Collaborative Applications over Peer-to-Peer Systems – Challenges and Solutions|journal=Peer-to-Peer Networking and Applications|volume=6|issue=3|pages=257–276|year=2012|doi=10.1007/s12083-012-0157-3|arxiv=1207.0790|bibcode=2012arXiv1207.0790D}}</ref>\n\nWhile P2P systems had previously been used in many application domains,<ref name=\"D. Barkai, 2002\">{{Cite book|title=Peer-to-peer computing : technologies for sharing and collaborating on the net|last=Barkai|first=David|date=2001|publisher=Intel Press|isbn=978-0970284679|location=Hillsboro, OR|oclc=49354877}}</ref> the architecture was popularized by the file sharing system [[Napster]], originally released in 1999. The concept has inspired new structures and philosophies in many areas of human interaction. In such social contexts, [[peer-to-peer (meme)|peer-to-peer as a meme]] refers to the [[egalitarianism|egalitarian]] [[social network]]ing that has emerged throughout society, enabled by [[Internet]] technologies in general.\n\n==Historical development==\n[[File:SETI@home Multi-Beam screensaver.png|thumb|[[SETI@home]] was established in 1999]]\nWhile P2P systems had previously been used in many application domains,<ref name=\"D. Barkai, 2002\"/> the concept was popularized by [[file sharing]] systems such as the music-sharing application [[Napster]] (originally released in 1999). The peer-to-peer movement allowed millions of Internet users to connect \"directly, forming groups and collaborating to become user-created search engines, virtual supercomputers, and filesystems.\" <ref name=\"Oram, A. 2001\">{{Cite book|title=Peer-to-peer: harnessing the benefits of a disruptive technologies|date=2001|publisher=O'Reilly|isbn=9780596001100|editor-last=Oram|editor-first=Andrew|location=[[Sebastopol, California]]|language=English|oclc = 123103147}}</ref> The basic concept of peer-to-peer computing was envisioned in earlier software systems and networking discussions, reaching back to principles stated in the first [[Request for Comments]], RFC 1.<ref>RFC 1, ''Host Software'', S. Crocker, IETF Working Group (April 7, 1969)</ref>\n\n[[Tim Berners-Lee]]'s vision for the [[World Wide Web]] was close to a P2P network in that it assumed each user of the web would be an active editor and contributor, creating and linking content to form an interlinked \"web\" of links. The early Internet was more open than present day, where two machines connected to the Internet could send packets to each other without firewalls and other security measures.<ref name=\"Oram, A. 2001\" />{{Page needed|date=March 2018}} This contrasts to the [[broadcasting]]-like structure of the web as it has developed over the years.<ref>{{cite web |url=http://www.w3.org/People/Berners-Lee/1996/ppf.html |title=The World Wide Web: Past, Present and Future |first=Tim |last=Berners-Lee |date=August 1996 |accessdate=5 November 2011}}</ref><ref name=\"Steinmetz, R. 2005 pp. 9-16\" /> As a precursor to the Internet, [[Arpanet|ARPANET]] was a successful client-server network where \"every participating node could request and serve content.\" However, [[Arpanet|ARPANET]] was not self-organized, and it lacked the ability to \"provide any means for context or content-based routing beyond 'simple' address-based routing.\"<ref name=\"Steinmetz, R. 2005 pp. 9-16\">{{Cite book|title=Peer-to-Peer Systems and Applications|last=Steinmetz|first=Ralf|last2=Wehrle|first2=Klaus|date=2005|publisher=Springer, Berlin, Heidelberg|isbn=9783540291923|series=Lecture Notes in Computer Science|pages=9–16|language=en|chapter=2. What Is This “Peer-to-Peer” About?|doi=10.1007/11530657_2}}</ref>\n\nTherefore, [[Usenet|USENET]], a distributed messaging system that is often described as an early peer-to-peer architecture, was established. It was developed in 1979 as a system that enforces a [[Decentralized computing|decentralized model]] of control. The basic model is a client-server model from the user or client perspective that offers a self-organizing approach to newsgroup servers. However, [[news server]]s communicate with one another as peers to propagate [[Usenet|Usenet news]] articles over the entire group of network servers. The same consideration applies to [[Simple Mail Transfer Protocol|SMTP]] email in the sense that the core email-relaying network of [[mail transfer agent]]s has a peer-to-peer character, while the periphery of [[e-mail client]]s and their direct connections is strictly a client-server relationship.{{citation needed|date=July 2013}}\n\nIn May 1999, with millions more people on the Internet, [[Shawn Fanning]] introduced the music and file-sharing application called Napster.<ref name=\"Steinmetz, R. 2005 pp. 9-16\"/> Napster was the beginning of peer-to-peer networks, as we know them today, where \"participating users establish a virtual network, entirely independent from the physical network, without having to obey any administrative authorities or restrictions.\"<ref name=\"Steinmetz, R. 2005 pp. 9-16\" />\n\n==Architecture==\nA peer-to-peer network is designed around the notion of equal ''[[Peer group (computer networking)|peer]]'' nodes simultaneously functioning as both \"clients\" and \"servers\" to the other nodes on the network. This model of network arrangement differs from the [[client–server]] model where communication is usually to and from a central server. A typical example of a file transfer that uses the client-server model is the [[File Transfer Protocol]] (FTP) service in which the client and server programs are distinct: the clients initiate the transfer, and the servers satisfy these requests.\n\n===Routing and resource discovery===\nPeer-to-peer networks generally implement some form of virtual [[overlay network]] on top of the physical network topology, where the nodes in the overlay form a [[subset]] of the nodes in the physical network. Data is still exchanged directly over the underlying [[TCP/IP]] network, but at the [[application layer]] peers are able to communicate with each other directly, via the logical overlay links (each of which corresponds to a path through the underlying physical network). Overlays are used for indexing and peer discovery, and make the P2P system independent from the physical network topology. Based on how the nodes are linked to each other within the overlay network, and how resources are indexed and located, we can classify networks as ''unstructured'' or ''structured'' (or as a hybrid between the two).<ref>{{cite book |editor-last=Ahson |editor-first=Syed A. |editor2-last=Ilyas |editor2-first=Mohammad |title=SIP Handbook: Services, Technologies, and Security of Session Initiation Protocol |publisher=Taylor & Francis |year=2008 |isbn=9781420066043 |page=204 |url=https://books.google.com/books?id=CKzPq3-wVdcC&pg=PA204}}</ref><ref>{{cite book |editor-last=Zhu |editor-first=Ce |title=Streaming Media Architectures: Techniques and Applications: Recent Advances |publisher=IGI Global |year=2010 |isbn=9781616928339 |page=265 |url=https://books.google.com/books?id=Cb4dWYVJ_8AC&pg=PA265 |display-editors=etal}}</ref><ref>{{cite book |last=Kamel |first=Mina |chapter=Optimal Topology Design for Overlay Networks |editor-last=Akyildiz |editor-first=Ian F. |title=Networking 2007: Ad Hoc and Sensor Networks, Wireless Networks, Next Generation Internet: 6th International IFIP-TC6 Networking Conference, Atlanta, GA, USA, May 14-18, 2007 Proceedings|publisher=Springer |year=2007 |isbn=9783540726050 |page=714 |chapter-url=https://books.google.com/books?id=r4V2G7yPLIAC&pg=PA714 |display-authors=etal}}</ref>\n\n====Unstructured networks====\n[[File:Unstructured peer-to-peer network diagram.png|thumb|right|300px|Overlay network diagram for an '''unstructured P2P network''', illustrating the ad hoc nature of the connections between nodes]]\n''Unstructured peer-to-peer networks'' do not impose a particular structure on the overlay network by design, but rather are formed by nodes that randomly form connections to each other.<ref>{{cite book |last=Filali |first=Imen |chapter=A Survey of Structured P2P Systems for RDF Data Storage and Retrieval |editor-last=Hameurlain |editor-first=Abdelkader |title=Transactions on Large-Scale Data- and Knowledge-Centered Systems III: Special Issue on Data and Knowledge Management in Grid and PSP Systems |publisher=Springer |year=2011 |isbn=9783642230738|page=21 |chapter-url=https://books.google.com/books?id=pjQr7BHtbCoC&pg=PA21 |display-authors=etal|display-editors=etal}}</ref> ([[Gnutella]], [[Gossip protocol|Gossip]], and [[Kazaa]] are examples of unstructured P2P protocols).<ref>{{cite book |last=Zulhasnine |first=Mohammed |chapter=P2P Streaming Over Cellular Networks: Issues, Challenges, and Opportunities |editor=Pathan |title=Building Next-Generation Converged Networks: Theory and Practice |publisher=CRC Press |year=2013 |isbn=9781466507616 |page=99 |chapter-url=https://books.google.com/books?id=tr5PGJk-swIC&pg=PA99 |display-authors=etal|display-editors=etal}}</ref>\n\nBecause there is no structure globally imposed upon them, unstructured networks are easy to build and allow for localized optimizations to different regions of the overlay.<ref>{{cite book |last=Chervenak |first=Ann |last2=Bharathi |first2=Shishir |chapter=Peer-to-peer Approaches to Grid Resource Discovery |editor-last=Danelutto |editor-first=Marco |title=Making Grids Work: Proceedings of the CoreGRID Workshop on Programming Models Grid and P2P System Architecture Grid Systems, Tools and Environments 12-13 June 2007, Heraklion, Crete, Greece|publisher=Springer |year=2008 |isbn=9780387784489 |page=67 |chapter-url=https://books.google.com/books?id=adN0pm_BBuYC&pg=PA67 |display-editors=etal}}</ref> Also, because the role of all peers in the network is the same, unstructured networks are highly robust in the face of high rates of \"churn\"—that is, when large numbers of peers are frequently joining and leaving the network.<ref name=\"Jin-Unstructured-2010\">{{cite book |last=Jin |first=Xing |last2=Chan |first2=S.-H. Gary |chapter=Unstructured Peer-to-Peer Network Architectures |editor=Shen |title=Handbook of Peer-to-Peer Networking |publisher=Springer |year=2010 |isbn=978-0-387-09750-3 |page=119 |display-editors=etal}}</ref><ref name=\"lv-2002\">{{cite book |last=Lv |first=Qin |chapter=Can Heterogeneity Make Gnutella Stable? |editor-last=Druschel |editor-first=Peter |title=Peer-to-Peer Systems: First International Workshop, IPTPS 2002, Cambridge, MA, USA, March 7-8, 2002, Revised Papers |publisher=Springer |year=2002 |isbn=9783540441793 |page=94 |chapter-url=https://books.google.com/books?id=f57AwpUIctcC&pg=PA94 |display-authors=etal|display-editors=etal}}</ref>\n\nHowever, the primary limitations of unstructured networks also arise from this lack of structure. In particular, when a peer wants to find a desired piece of data in the network, the search query must be flooded through the network to find as many peers as possible that share the data. Flooding causes a very high amount of signaling traffic in the network, uses more [[Cpu|CPU]]/memory (by requiring every peer to process all search queries), and does not ensure that search queries will always be resolved. Furthermore, since there is no [[correlation]] between a peer and the content managed by it, there is no guarantee that flooding will find a peer that has the desired data. Popular content is likely to be available at several peers and any peer searching for it is likely to find the same thing. But if a peer is looking for rare data shared by only a few other peers, then it is highly unlikely that search will be successful.<ref>{{cite book |last=Shen |first=Xuemin |last2=Yu |first2=Heather |last3=Buford |first3=John |last4=Akon |first4=Mursalin |title=Handbook of Peer-to-Peer Networking |publisher=Springer|edition=1st |year=2009 |location=New York |page=118 |isbn=978-0-387-09750-3}}</ref>\n\n====Structured networks====\n[[File:Structured (DHT) peer-to-peer network diagram.png|thumb|right|300px|Overlay network diagram for a '''structured P2P network''', using a [[distributed hash table]] (DHT) to identify and locate nodes/resources]]\n\nIn ''structured peer-to-peer networks'' the overlay is organized into a specific topology, and the protocol ensures that any node can efficiently<ref>Typically approximating [[Big O notation|O(log N)]], where N is the number of nodes in the P2P system{{citation needed|date=July 2013}}</ref> search the network for a file/resource, even if the resource is extremely rare.\n\nThe most common type of structured P2P networks implement a [[distributed hash table]] (DHT),<ref>Other design choices include overlay rings and d-Torus. See for example {{cite journal |last=Bandara |first=H. M. N. D. |first2=A. P. |last2=Jayasumana |title=Collaborative Applications over Peer-to-Peer Systems – Challenges and Solutions |journal=Peer-to-Peer Networking and Applications |volume=6 |issue=3 |pages=257 |year=2012 |doi=10.1007/s12083-012-0157-3 |arxiv=1207.0790 |bibcode=2012arXiv1207.0790D }}</ref><ref>R. Ranjan, A. Harwood, and R. Buyya, \"Peer-to-peer based resource discovery in global grids: a tutorial,\" ''IEEE Commun. Surv.'', vol. 10, no. 2. and P. Trunfio, \"Peer-to-Peer resource discovery in Grids: Models and systems,\" ''Future Generation Computer Systems'' archive, vol. 23, no. 7, Aug. 2007.</ref> in which a variant of [[consistent hashing]] is used to assign ownership of each file to a particular peer.<ref>{{cite book |last1=Kelaskar |first1=M. |last2=Matossian |first2=V. |last3=Mehra |first3=P. |last4=Paul |first4=D. |last5=Parashar |first5=M. |year=2002 |url=http://portal.acm.org/citation.cfm?id=873218 |title=A Study of Discovery Mechanisms for Peer-to-Peer Application |pages=444– |postscript=<!-- Bot inserted parameter. Either remove it; or change its value to \".\" for the cite to end in a \".\", as necessary. -->&#123;&#123;inconsistent citations&#125;&#125;|isbn=9780769515823 }}</ref><ref name=\"P2P_API\">{{cite book |last=Dabek |first=Frank |first2=Ben |last2=Zhao |first3=Peter |last3=Druschel |first4=John |last4=Kubiatowicz |first5=Ion |last5=Stoica |title=Towards a Common API for Structured Peer-to-Peer Overlays |journal=Peer-to-Peer Systems II |year=2003 |volume=2735 |series=Lecture Notes in Computer Science |pages=33–44 |doi=10.1007/978-3-540-45172-3_3 |isbn=978-3-540-40724-9 |citeseerx=10.1.1.12.5548 }}</ref> This enables peers to search for resources on the network using a [[hash table]]: that is, (''key'', ''value'') pairs are stored in the DHT, and any participating node can efficiently retrieve the value associated with a given key.<ref>Moni Naor and Udi Wieder. [http://www.wisdom.weizmann.ac.il/~naor/PAPERS/dh.pdf Novel Architectures for P2P Applications: the Continuous-Discrete Approach]. Proc. SPAA, 2003.</ref><ref>Gurmeet Singh Manku. [http://www-db.stanford.edu/~manku/phd/index.html Dipsea: A Modular Distributed Hash Table] {{webarchive|url=https://web.archive.org/web/20040910154927/http://www-db.stanford.edu/~manku/phd/index.html |date=2004-09-10 }}. Ph. D. Thesis (Stanford University), August 2004.</ref>\n[[File:DHT en.svg|thumb|left|250px|Distributed hash tables]]\n\nHowever, in order to route traffic efficiently through the network, nodes in a structured overlay must maintain lists of neighbors that satisfy specific criteria. This makes them less robust in networks with a high rate of ''churn'' (i.e. with large numbers of nodes frequently joining and leaving the network).<ref name=\"lv-2002\" /><ref>{{cite book|last=Li |first=Deng |title=An Efficient, Scalable, and Robust P2P Overlay for Autonomic Communication |editor-last=Vasilakos |editor-first=A.V. |publisher=Springer |year=2009 |isbn=978-0-387-09752-7 |page=329 |url=https://books.google.com/books?id=c02mTcXW_U4C&pg=PA329 |display-authors=etal|display-editors=etal}}</ref>\nMore recent evaluation of P2P resource discovery solutions under real workloads have pointed out several issues in DHT-based solutions such as high cost of advertising/discovering resources and static and dynamic load imbalance.<ref>{{cite journal |last=Bandara |first=H. M. N. Dilum |first2=Anura P. |last2=Jayasumana |title=Evaluation of P2P Resource Discovery Architectures Using Real-Life Multi-Attribute Resource and Query Characteristics |journal=IEEE Consumer Communications and Networking Conf. (CCNC '12) |date=January 2012}}</ref>\n\nNotable distributed networks that use DHTs include [[Tixati]], an alternative to [[BitTorrent (protocol)|BitTorrent's]] distributed tracker, the [[Kad network]], the [[Storm botnet]], [[YaCy]], and the [[Coral Content Distribution Network]]. Some prominent research projects include the [[Chord (peer-to-peer)|Chord project]], [[Kademlia]], [[PAST storage utility]], [[P-Grid]], a self-organized and emerging overlay network, and [[CoopNet content distribution system]].<ref>{{cite book | last=Korzun | first=Dmitry| last2=Gurtov| first2 = Andrei| title= Structured P2P Systems: Fundamentals of Hierarchical Organization, Routing, Scaling, and Security|publisher=Springer | isbn = 978-1-4614-5482-3 |date= November 2012 | url=https://www.springer.com/gp/book/9781461454823}}</ref> DHT-based networks have also been widely utilized for accomplishing efficient resource discovery<ref>{{cite web |last1=Ranjan |first1=Rajiv |last2=Harwood|first2=Aaron |last3=Buyya |first3=Rajkumar |date=1 December 2006 |url=http://www.cs.mu.oz.au/%7Erranjan/pgrid.pdf |title=A Study on Peer-to-Peer Based Discovery of Grid Resource Information|postscript=<!-- Bot inserted parameter. Either remove it; or change its value to \".\" for the cite to end in a \".\", as necessary. -->&#123;&#123;inconsistent citations&#125;&#125;}}</ref><ref>{{cite web |url=http://gridbus.org/papers/DecentralisedDiscoveryGridFed-eScience2007.pdf |first=Rajiv |last=Ranjan |first2=Lipo |last2=Chan |first3=Aaron |last3=Harwood |first4=Shanika |last4=Karunasekera |first5=Rajkumar |last5=Buyya |title=Decentralised Resource Discovery Service for Large Scale Federated Grids |deadurl=yes |archiveurl=https://web.archive.org/web/20080910170417/http://gridbus.org/papers/DecentralisedDiscoveryGridFed-eScience2007.pdf |archivedate=2008-09-10 |df= }}</ref> for [[grid computing]] systems, as it aids in resource management and scheduling of applications.\n\n====Hybrid models====\nHybrid models are a combination of peer-to-peer and client-server models.<ref>{{cite book |last=Darlagiannis |first=Vasilios |chapter=Hybrid Peer-to-Peer Systems|editor-last1=Steinmetz |editor-first1=Ralf |editor-last2=Wehrle |editor-first2=Klaus |title=Peer-to-Peer Systems and Applications |publisher=Springer |year=2005 |isbn=9783540291923 |chapter-url=https://books.google.com/books?id=A8CLZ1FB4qoC&pg=PA353 }}</ref> A common hybrid model is to have a central server that helps peers find each other. [[Spotify]] was an example of a hybrid model [until 2014]. There are a variety of hybrid models, all of which make trade-offs between the centralized functionality provided by a structured server/client network and the node equality afforded by the pure peer-to-peer unstructured networks. Currently, hybrid models have better performance than either pure unstructured networks or pure structured networks because certain functions, such as searching, do require a centralized functionality but benefit from the decentralized aggregation of nodes provided by unstructured networks.<ref>{{cite journal |last1=Yang |first1=Beverly |last2=Garcia-Molina |first2=Hector |year=2001 |title=Comparing Hybrid Peer-to-Peer Systems |journal=Very Large Data Bases |volume= |issue= |pages= |publisher= |doi= |url=http://infolab.stanford.edu/~byang/pubs/hybridp2p_long.pdf |accessdate=8 October 2013}}</ref>\n\n====CoopNet content distribution system====\n'''CoopNet (Cooperative Networking)''' was a proposed system for off-loading serving to [[Peer-to-peer|peers]] who have recently [[download]]ed content, proposed by computer scientists Venkata N. Padmanabhan and Kunwadee Sripanidkulchai, working at [[Microsoft Research]] and [[Carnegie Mellon University]].<ref>{{Cite book| last = Padmanabhan| first = Venkata N.[http://research.microsoft.com/~padmanab/]| last2 = Sripanidkulchai| first2 = Kunwadee [http://www.andrew.cmu.edu/~kunwadee/]| author2-link = | publication-date = March 2002| year = 2002| title = The Case for Cooperative Networking (PostScript with addendum)| volume = Proceedings of the First International Workshop on Peer-to-Peer Systems| series = Lecture Notes in Computer Science| location = Cambridge, MA| publisher = Springer| pages = 178| isbn = 978-3-540-44179-3| doi = 10.1007/3-540-45748-8_17| url = http://research.microsoft.com/projects/CoopNet/papers/iptps02-with-addendum.ps| archive-url = https://web.archive.org/web/20030701090204/http://research.microsoft.com/projects/coopnet/papers/iptps02-with-addendum.ps| dead-url = yes| archive-date = 2003-07-01| format = &ndash; <sup>[https://scholar.google.co.uk/scholar?hl=en&lr=&q=author%3APadmanabhan+intitle%3AThe+Case+for+Cooperative+Networking+%28PostScript+with+addendum%29&as_publication=&as_ylo=2002&as_yhi=2002&btnG=Search Scholar search]</sup>}}  [http://research.microsoft.com/projects/CoopNet/papers/iptps02-with-addendum.pdf PDF (Microsoft, with addendum)] [http://www.springerlink.com/index/BP5A2RHBH7QP55D6.pdf PDF (Springer, original, fee may be required)]</ref><ref>{{Cite web|url=http://research.microsoft.com/projects/CoopNet/|title=CoopNet: Cooperative Networking|publisher=Microsoft Research}}  Project home page.</ref> Basically when a [[Server (computing)|server]] experiences an increase in load it redirects incoming peers to other peers who have agreed to [[mirror]] the content, thus off-loading balance from the server.  All of the information is retained at the server.  This system makes use of the fact that the bottle-neck is most likely in the outgoing bandwidth than the [[CPU]], hence its server-centric design.  It assigns peers to other peers who are 'close in [[IP Address|IP]]' to its neighbors [same prefix range] in an attempt to use locality.  If multiple peers are found with the same [[Computer file|file]] it designates that the node choose the fastest of its neighbors. [[Streaming media]] is transmitted by having clients [[web cache|cache]] the previous stream, and then transmit it piece-wise to new nodes.\n\n===Security and trust===\nPeer-to-peer systems pose unique challenges from a [[computer security]] perspective.\n\nLike any other form of [[software]], P2P applications can contain [[vulnerability (computing)|vulnerabilities]]. What makes this particularly dangerous for P2P software, however, is that peer-to-peer applications act as servers as well as clients, meaning that they can be more vulnerable to [[Exploit (computer security)|remote exploits]].<ref name=\"vu-p2p-principles-p8\">{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |page=8 |url= |display-authors=etal}}</ref>\n\n====Routing attacks====\nAlso, since each node plays a role in routing traffic through the network, malicious users can perform a variety of \"routing attacks\", or [[denial of service]] attacks. Examples of common routing attacks include \"incorrect lookup routing\" whereby malicious nodes deliberately forward requests incorrectly or return false results, \"incorrect routing updates\" where malicious nodes corrupt the routing tables of neighboring nodes by sending them false information, and \"incorrect routing network partition\" where when new nodes are joining they bootstrap via a malicious node, which places the new node in a partition of the network that is populated by other malicious nodes.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |pages=157–159 |url= |display-authors=etal}}</ref>\n\n====Corrupted data and malware====\n{{See also|Data validation|Malware}}\nThe prevalence of [[malware]] varies between different peer-to-peer protocols. Studies analyzing the spread of malware on P2P networks found, for example, that 63% of the answered download requests on the [[gnutella]] network contained some form of malware, whereas only 3% of the content on [[OpenFT]] contained malware. In both cases, the top three most common types of malware accounted for the large majority of cases (99% in gnutella, and 65% in OpenFT). Another study analyzing traffic on the [[Kazaa]] network found that 15% of the 500,000 file sample taken were infected by one or more of the 365 different [[computer viruses]] that were tested for.<ref>{{cite book |last=Goebel |first=Jan |chapter=Measurement and Analysis of Autonomous Spreading Malware in a University Environment |editor-last=Hämmerli |editor-first=Bernhard Markus |editor2-last=Sommer |editor2-first=Robin |title=Detection of Intrusions and Malware, and Vulnerability Assessment: 4th International Conference, DIMVA 2007 Lucerne, Switzerland, July 12-13, 2007 Proceedings |publisher=Springer |year=2007 |isbn=9783540736134 |page=112 |chapter-url=https://books.google.com/books?id=M0PfEaVa9QIC&pg=PA112 |display-authors=etal}}</ref>\n\nCorrupted data can also be distributed on P2P networks by modifying files that are already being shared on the network. For example, on the [[FastTrack]] network, the [[RIAA]] managed to introduce faked chunks into downloads and downloaded files (mostly [[MP3]] files). Files infected with the RIAA virus were unusable afterwards and contained malicious code. The RIAA is also known to have uploaded fake music and movies to P2P networks in order to deter illegal file sharing.<ref>{{cite news |url=https://www.nytimes.com/2003/05/04/business/04MUSI.html |title=Software Bullet Is Sought to Kill Musical Piracy |last=Sorkin |first=Andrew Ross |date=4 May 2003 |newspaper=New York Times |accessdate=5 November 2011}}</ref> Consequently, the P2P networks of today have seen an enormous increase of their security and file verification mechanisms. Modern [[hash chain|hashing]], [[File verification|chunk verification]] and different encryption methods have made most networks resistant to almost any type of attack, even when major parts of the respective network have been replaced by faked or nonfunctional hosts.<ref>{{cite techreport |first=Vivek |last=Singh |first2=Himani |last2=Gupta |title= Anonymous File Sharing in Peer to Peer System by Random Walks |number=123456789/9306 |institution=SRM University |year=2012 }}</ref>\n\n===Resilient and scalable computer networks===\n{{See also|Wireless mesh network|Distributed computing}}\nThe decentralized nature of P2P networks increases robustness because it removes the [[Reliability engineering|single point of failure]] that can be inherent in a client-server based system.<ref name=\"ms-overlay-survey\">{{cite web |url=http://academic.research.microsoft.com/Publication/2633870/a-survey-and-comparison-of-peer-to-peer-overlay-network-schemes |title=A survey and comparison of peer-to-peer overlay network schemes |last=Lua |first=Eng Keong |last2=Crowcroft |first2=Jon |last3=Pias |first3=Marcelo |last4=Sharma |first4=Ravi |last5=Lim |first5=Steven |year=2005 |deadurl=yes |archiveurl=https://web.archive.org/web/20120724222234/http://academic.research.microsoft.com/Publication/2633870/a-survey-and-comparison-of-peer-to-peer-overlay-network-schemes |archivedate=2012-07-24 |df= }}</ref> As nodes arrive and demand on the system increases, the total capacity of the system also increases, and the likelihood of failure decreases. If one peer on the network fails to function properly, the whole network is not compromised or damaged. In contrast, in a typical client–server architecture, clients share only their demands with the system, but not their resources. In this case, as more clients join the system, fewer resources are available to serve each client, and if the central server fails, the entire network is taken down.\n\n===Distributed storage and search===\n[[File:Yacy-resultados.png|thumb|right|300px|Search results for the query \"[[software libre]]\", using [[YaCy]] a free [[distributed search engine]] that runs on a peer-to-peer network instead making requests to centralized index servers (like [[Google]], [[Yahoo]], and other corporate search engines)]]\nThere are both advantages and disadvantages in P2P networks related to the topic of data [[backup]], recovery, and availability. In a centralized network, the system administrators are the only forces controlling the availability of files being shared. If the administrators decide to no longer distribute a file, they simply have to remove it from their servers, and it will no longer be available to users. Along with leaving the users powerless in deciding what is distributed throughout the community, this makes the entire system vulnerable to threats and requests from the government and other large forces. For example, [[YouTube]] has been pressured by the RIAA, MPAA, and entertainment industry to filter out copyrighted content. Although server-client networks are able to monitor and manage content availability, they can have more stability in the availability of the content they choose to host. A client should not have trouble accessing obscure content that is being shared on a stable centralized network. P2P networks, however, are more unreliable in sharing unpopular files because sharing files in a P2P network requires that at least one node in the network has the requested data, and that node must be able to connect to the node requesting the data. This requirement is occasionally hard to meet because users may delete or stop sharing data at any point.<ref>{{cite journal |year=2003 |title=Looking up data in P2P systems |journal=Communications of the ACM |volume=46 |issue=2 |pages=43–48 |publisher= |doi=10.1145/606272.606299 |pmid= |pmc= |url=http://www.nms.lcs.mit.edu/papers/p43-balakrishnan.pdf |accessdate=8 October 2013|last1=Balakrishnan |first1=Hari |last2=Kaashoek |first2=M. Frans |last3=Karger |first3=David |last4=Morris |first4=Robert |last5=Stoica |first5=Ion |citeseerx=10.1.1.5.3597 }}</ref>\n\nIn this sense, the community of users in a P2P network is completely responsible for deciding what content is available. Unpopular files will eventually disappear and become unavailable as more people stop sharing them. Popular files, however, will be highly and easily distributed. Popular files on a P2P network actually have more stability and availability than files on central networks. In a centralized network, a simple loss of connection between the server and clients is enough to cause a failure, but in P2P networks, the connections between every node must be lost in order to cause a data sharing failure. In a centralized system, the administrators are responsible for all data recovery and backups, while in P2P systems, each node requires its own backup system. Because of the lack of central authority in P2P networks, forces such as the recording industry, RIAA, MPAA, and the government are unable to delete or stop the sharing of content on P2P systems.<ref>{{cite web |url=http://www.p2pnews.net/2012/06/14/art-thou-a-peer/ |title=Art thou a Peer? |author=<!--Staff writer(s); no by-line.--> |date=14 June 2012 |website=www.p2pnews.net |publisher= |accessdate=10 October 2013 |deadurl=yes |archiveurl=https://web.archive.org/web/20131006022409/http://www.p2pnews.net/2012/06/14/art-thou-a-peer/ |archivedate=6 October 2013 |df= }}</ref>\n\n==Applications==\n{{Prose|date=September 2014}}\n\n===Content delivery===\nIn P2P networks, clients both provide and use resources. This means that unlike client-server systems, the content-serving capacity of peer-to-peer networks can actually ''increase'' as more users begin to access the content (especially with protocols such as [[Bittorrent]] that require users to share, refer a performance measurement study<ref>Sharma P., Bhakuni A. & Kaushal R.[http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=6488040&url=http%3A%2F%2Fieeexplore.ieee.org%2Fxpls%2Fabs_all.jsp%3Farnumber%3D6488040  \"Performance Analysis of BitTorrent Protocol]. National Conference on Communications, 2013 {{DOI|10.1109/NCC.2013.6488040}}</ref>). This property is one of the major advantages of using P2P networks because it makes the setup and running costs very small for the original content distributor.<ref>{{cite journal |last=Li |first=Jin |title=On peer-to-peer (P2P) content delivery |journal=Peer-to-Peer Networking and Applications |volume=1 |issue=1 |doi=10.1007/s12083-007-0003-1 |pages=45–63 ≤≥|url=http://www.land.ufrj.br/~classes/coppe-redes-2008/biblio/P2P-content-delivery.pdf |year=2008 }}</ref><ref>{{cite book |last=Stutzbach |first=Daniel |chapter=The scalability of swarming peer-to-peer content delivery |editor-last=Boutaba |editor-first=Raouf |title=NETWORKING 2005 -- Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; Mobile and Wireless Communications Systems |publisher=Springer |year=2005 |isbn=978-3-540-25809-4 |pages=15–26 |chapter-url=http://ix.cs.uoregon.edu/~reza/PUB/networking05.pdf |display-authors=etal|display-editors=etal}}</ref>\n\n===File-sharing networks===\nMany file [[peer-to-peer file sharing]] networks, such as [[Gnutella]], [[Gnutella2|G2]], and the [[eDonkey network]] popularized peer-to-peer technologies.\n* [[Content delivery network|Peer-to-peer content delivery networks]].\n* Peer-to-peer content services, e.g. caches for improved performance such as Correli Caches<ref>Gareth Tyson, Andreas Mauthe, Sebastian Kaune, Mu Mu and Thomas Plagemann. Corelli: A Dynamic Replication Service for Supporting Latency-Dependent Content in Community Networks. In Proc. 16th ACM/SPIE Multimedia Computing and Networking Conference (MMCN), San Jose, CA (2009).{{cite web |url=http://www.dcs.kcl.ac.uk/staff/tysong/files/MMCN09.pdf |title=Archived copy |accessdate=2011-03-12 |deadurl=yes |archiveurl=https://web.archive.org/web/20110429181811/http://www.dcs.kcl.ac.uk/staff/tysong/files/MMCN09.pdf |archivedate=2011-04-29 |df= }}</ref>\n* Software publication and distribution ([[Linux distribution]], several games); via [[file sharing]] networks.\n\n====Copyright infringements====\nPeer-to-peer networking involves data transfer from one user to another without using an intermediate server. Companies developing P2P applications have been involved in numerous legal cases, primarily in the United States, over conflicts with [[copyright]] law.<ref name=\"Springer\">{{cite book |last=Glorioso |first=Andrea |chapter=The Social Impact of P2P Systems |editor=Shen |title=Handbook of Peer-to-Peer Networking|publisher=Springer |year=2010 |isbn=978-0-387-09750-3 |page=48 |display-authors=etal|display-editors=etal}}</ref> Two major cases are ''[[Grokster]] vs RIAA'' and ''[[MGM Studios, Inc. v. Grokster, Ltd.]]''.<ref name=\"news.cnet.com\">{{cite web |author=John Borland |title=Judge: File-Swapping Tools are Legal |url=http://news.cnet.com/Judge-File-swapping-tools-are-legal/2100-1027_3-998363.html/ |date=April 25, 2003 |archive-url=https://web.archive.org/web/20120310165410/http://news.cnet.com/Judge-File-swapping-tools-are-legal/2100-1027_3-998363.html |archive-date=2012-03-10 |website=news.cnet.com |dead-url=yes}}</ref> In the last case, the Court unanimously held that defendant peer-to-peer file sharing companies Grokster and Streamcast could be sued for inducing copyright infringement.\n\n===Multimedia===\n* The [[P2PTV]] and [[Peer Distributed Transfer Protocol|PDTP]] protocols.\n* Some [[Proprietary software|proprietary]] multimedia applications use a peer-to-peer network along with streaming servers to stream audio and video to their clients.\n* [[Peercasting]] for multicasting streams.\n* [[Pennsylvania State University]], MIT and [[Simon Fraser University]] are carrying on a project called [[LionShare]] designed for facilitating file sharing among educational institutions globally.\n* [[Osiris (Serverless Portal System)|Osiris]] is a program that allows its users to create anonymous and autonomous web portals distributed via P2P network.\n\n===Energy trading===\nCompanies such as [[Power Ledger]] and [[Bovlabs]] employ peer-to-peer energy trading platforms.<ref>[https://coincentral.com/power-ledger-beginner-guide/ Power Ledger The Complete Guide: Future Projects and Roadmap]</ref><ref>[https://www.euronews.com/living/2019/07/04/nine-sustainable-economy-startups-aiming-to-clean-up-our-future 9 sustainable economy startups aiming to clean up our future ]</ref>\n\n===Other P2P applications===\n[[File:Torrent peers.png|thumb|[[Torrent file]] connect peers]]\n* [[Bitcoin]] and alternatives such as [[Ether (cryptocurrency)|Ether]], [[Nxt]] and [[Peercoin]] are peer-to-peer-based [[digital currency|digital]] [[Cryptocurrency|cryptocurrencies]].\n* [[Dalesa]], a peer-to-peer [[web cache]] for [[Local area network|LANs]] (based on IP [[multicast]]ing).\n* [[FAROO]], a peer-to-peer web search engine\n* [[Filecoin]] is an [[Open-source software|open source]], public, [[cryptocurrency]] and digital [[payment system]] intended to be a [[blockchain]]-based [[Cooperative storage cloud|cooperative digital storage]] and data retrieval method.\n* [[I2P]], an [[overlay network]] used to browse the Internet [[Internet anonymity|anonymously]].\n* [[Infinit (file system)|Infinit]] is an unlimited and encrypted peer to peer file sharing application for digital artists written in [[C++]].\n* The [[InterPlanetary File System]] (IPFS) is a [[Communications protocol|protocol]] and network designed to create a [[content-addressable storage|content-addressable]], [[peer-to-peer]] method of storing and sharing [[hypermedia]] distribution protocol. Nodes in the IPFS network form a [[distributed file system]].\n* [[JXTA]], a peer-to-peer protocol designed for the [[Java platform]].\n* [[Netsukuku]], a [[Wireless community network]] designed to be independent from the Internet.\n* [[Open Garden]], connection sharing application that shares Internet access with other devices using Wi-Fi or Bluetooth.\n* Research like the [[Chord (peer-to-peer)|Chord project]], the [[PAST storage utility]], the [[P-Grid]], and the [[CoopNet content distribution system]].\n* [[Tradepal]] and [[M-commerce]] applications that power real-time marketplaces.\n* The [[U.S. Department of Defense]] is conducting research on P2P networks as part of its modern network warfare strategy.<ref>{{cite news |url=https://www.washingtonpost.com/ac2/wp-dyn?pagename=article&node=washtech/techthursday/columns/dotcom&contentId=A59099-2001Nov7 |last=Walker |first=Leslie |title=Uncle Sam Wants Napster! |work=The Washington Post |date=2001-11-08 |accessdate=2010-05-22 }}</ref> In May, 2003, [[Anthony Tether]], then director of [[DARPA]], testified that the United States military uses P2P networks.\n* [[WebTorrent]] is a P2P [[Stream (computing)|streaming]] [[torrent client]] in [[JavaScript]] for use in [[web browser]]s, as well as in the [[WebTorrent Desktop]] stand alone version that bridges WebTorrent and [[BitTorrent]] serverless networks.\n*[[Tor (anonymity network)]]\n* [[Microsoft]] in [[Windows 10]] uses a proprietary peer to peer technology called \"\"Delivery Optimization\" to deploy operating system updates using end-users PCs either on the local network or other PCs. According to Microsoft's Channel 9 it led to a 3%-50% reduction in Internet bandwidth usage.<ref>Hammerksjold Andreas; Engler, Narkis, [https://channel9.msdn.com/Events/Ignite/Microsoft-Ignite-Orlando-2017/BRK2048 \"Delivery Optimization - a deep dive\"], ''[[Channel 9 (Microsoft)|Channel 9]]'', 11 October 2017, Retrieved on 4 February 2019.</ref>\n* Artisoft's [[LANtastic]] was built as a peer-to-peer operating system. Machines can be servers and workstations at the same time.\n\n==Social implications==\n{{See also|Social peer-to-peer processes}}\n\n===Incentivizing resource sharing and cooperation===\n{{further information|Uberisation}}\n[[File:Torrentcomp small.gif|thumb|right|300px|'''The [[BitTorrent]] protocol''': In this animation, the colored bars beneath all of the 7 clients in the upper region above represent the file being shared, with each color representing an individual piece of the file. After the initial pieces transfer from the [[seed (BitTorrent)|seed]] (large system at the bottom), the pieces are individually transferred from client to client. The original seeder only needs to send out one copy of the file for all the clients to receive a copy.]]\nCooperation among a community of participants is key to the continued success of P2P systems aimed at casual human users; these reach their full potential only when large numbers of nodes contribute resources. But in current practice, P2P networks often contain large numbers of users who utilize resources shared by other nodes, but who do not share anything themselves (often referred to as the \"freeloader problem\"). Freeloading can have a profound impact on the network and in some cases can cause the community to collapse.<ref>Krishnan, R., Smith, M. D., Tang, Z., & Telang, R. (2004, January). The impact of free-riding on peer-to-peer networks. In System Sciences, 2004. Proceedings of the 37th Annual Hawaii International Conference on (pp. 10-pp). IEEE.</ref> In these types of networks \"users have natural disincentives to cooperate because cooperation consumes their own resources and may degrade their own performance.\" <ref name=\"Feldman, M. 2004, pp. 102-111\">Feldman, M., Lai, K., Stoica, I., & Chuang, J. (2004, May). Robust incentive techniques for peer-to-peer networks. In Proceedings of the 5th ACM conference on Electronic commerce (pp. 102-111). ACM.</ref> Studying the social attributes of P2P networks is challenging due to large populations of turnover, asymmetry of interest and zero-cost identity.<ref name=\"Feldman, M. 2004, pp. 102-111\"/> A variety of incentive mechanisms have been implemented to encourage or even force nodes to contribute resources.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |page=172 |url= |display-authors=etal}}</ref>\n\nSome researchers have explored the benefits of enabling virtual communities to self-organize and introduce incentives for resource sharing and cooperation, arguing that the social aspect missing from today's P2P systems should be seen both as a goal and a means for self-organized virtual communities to be built and fostered.<ref>P. Antoniadis and B. Le Grand, \"Incentives for resource sharing in self-organized communities: From economics to social psychology,\" Digital Information Management (ICDIM '07), 2007</ref> Ongoing research efforts for designing effective incentive mechanisms in P2P systems, based on principles from game theory, are beginning to take on a more psychological and information-processing direction.\n\n====Privacy and anonymity====\nSome peer-to-peer networks (e.g. [[Freenet]]) place a heavy emphasis on [[privacy]] and [[anonymity]]—that is, ensuring that the contents of communications are hidden from eavesdroppers, and that the identities/locations of the participants are concealed. [[Public key cryptography]] can be used to provide [[encryption]], [[data validation]], authorization, and authentication for data/messages. [[Onion routing]] and other [[mix network]] protocols (e.g. Tarzan) can be used to provide anonymity.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |pages=179–181 |url= |display-authors=etal}}</ref>\n\n==Political implications==\n\n===Intellectual property law and illegal sharing===\nAlthough peer-to-peer networks can be used for legitimate purposes, rights holders have targeted peer-to-peer over the involvement with sharing copyrighted material. Peer-to-peer networking involves data transfer from one user to another without using an intermediate server. Companies developing P2P applications have been involved in numerous legal cases, primarily in the United States, primarily over issues surrounding [[copyright]] law.<ref name=\"Springer\"/> Two major cases are ''[[Grokster]] vs RIAA'' and ''[[MGM Studios, Inc. v. Grokster, Ltd.]]''<ref name=\"news.cnet.com\"/> In both of the cases the file sharing technology was ruled to be legal as long as the developers had no ability to prevent the sharing of the copyrighted material. To establish criminal liability for the copyright infringement on peer-to-peer systems, the government must prove that the defendant infringed a copyright willingly for the purpose of personal financial gain or commercial advantage.<ref>Majoras, D. B. (2005). Peer-to-peer file-sharing technology consumer protection and competition issues. Federal Trade Commission, Retrieved from http://www.ftc.gov/reports/p2p05/050623p2prpt.pdf</ref> [[Fair use]] exceptions allow limited use of copyrighted material to be downloaded without acquiring permission from the rights holders. These documents are usually news reporting or under the lines of research and scholarly work. Controversies have developed over the concern of illegitimate use of peer-to-peer networks regarding public safety and national security. When a file is downloaded through a peer-to-peer network, it is impossible to know who created the file or what users are connected to the network at a given time. Trustworthiness of sources is a potential security threat that can be seen with peer-to-peer systems.<ref>The Government of the Hong Kong Special Administrative Region, (2008). Peer-to-peer network. Retrieved from website: http://www.infosec.gov.hk/english/technical/files/peer.pdf</ref>\n\nA study ordered by the [[European Union]] found that illegal downloading ''may'' lead to an increase in overall video game sales because newer games charge for extra features or levels. The paper concluded that piracy had a negative financial impact on movies, music, and literature. The study relied on self-reported data about game purchases and use of illegal download sites. Pains were taken to remove effects of false and misremembered responses.<ref>{{Cite news|url=http://www.newsweek.com/secret-piracy-study-european-union-669436|title=Illegal downloads may not actually harm sales, but the European Union doesn't want you to know that|last=Sanders|first=Linley|date=2017-09-22|work=Newsweek|access-date=2018-03-29|language=en}}</ref><ref>{{Cite news|url=http://bigthink.com/david-ryan-polgar/video-game-piracy-may-actually-result-in-more-sales|title=Does Video Game Piracy Actually Result in More Sales?|last=Polgar|first=David Ryan|date=October 15, 2017|work=Big Think|access-date=2018-03-29}}</ref><ref>{{Cite news|url=https://arstechnica.com/gaming/2017/09/eu-study-finds-piracy-doesnt-hurt-game-sales-may-actually-help/|title=EU study finds piracy doesn't hurt game sales, may actually help|last=Orland|first=Kyle|date=September 26, 2017|work=Ars Technica|access-date=2018-03-29|language=en-us}}</ref>\n\n===Network neutrality===\nPeer-to-peer applications present one of the core issues in the [[network neutrality]] controversy. Internet service providers ([[Internet service provider|ISPs]]) have been known to throttle P2P file-sharing traffic due to its high-[[Bandwidth (computing)|bandwidth]] usage.<ref name=\"newteevee.com\">Janko Roettgers, 5 Ways to Test Whether your ISP throttles P2P, http://newteevee.com/2008/04/02/5-ways-to-test-if-your-isp-throttles-p2p/</ref> Compared to Web browsing, e-mail or many other uses of the internet, where data is only transferred in short intervals and relative small quantities, P2P file-sharing often consists of relatively heavy bandwidth usage due to ongoing file transfers and swarm/network coordination packets. In October 2007, [[Comcast]], one of the largest broadband Internet providers in the United States, started blocking P2P applications such as [[BitTorrent (protocol)|BitTorrent]]. Their rationale was that P2P is mostly used to share illegal content, and their infrastructure is not designed for continuous, high-bandwidth traffic. Critics point out that P2P networking has legitimate legal uses, and that this is another way that large providers are trying to control use and content on the Internet, and direct people towards a [[client-server]]-based application architecture. The client-server model provides financial barriers-to-entry to small publishers and individuals, and can be less efficient for sharing large files. As a reaction to this [[bandwidth throttling]], several P2P applications started implementing protocol obfuscation, such as the [[BitTorrent protocol encryption]]. Techniques for achieving \"protocol obfuscation\" involves removing otherwise easily identifiable properties of protocols, such as deterministic byte sequences and packet sizes, by making the data look as if it were random.<ref name=\"breaking\">{{cite web |url=http://www.iis.se/docs/hjelmvik_breaking.pdf |title=Breaking and Improving Protocol Obfuscation |last1=Hjelmvik |first1=Erik |last2=John |first2=Wolfgang |date=2010-07-27 |issn=1652-926X }}</ref> The ISP's solution to the high bandwidth is [[P2P caching]], where an ISP stores the part of files most accessed by P2P clients in order to save access to the Internet.\n\n==Current research==\nResearchers have used computer simulations to aid in understanding and evaluating the complex behaviors of individuals within the network. \"Networking research often relies on simulation in order to test and evaluate new ideas. An important requirement of this process is that results must be reproducible so that other researchers can replicate, validate, and extend existing work.\" <ref name=\"Basu, A. 2013\">Basu, A., Fleming, S., Stanier, J., Naicken, S., Wakeman, I., & Gurbani, V. K. (2013). The state of peer-to-peer network simulators. ACM Computing Surveys, 45(4), 46.</ref> If the research cannot be reproduced, then the opportunity for further research is hindered. \"Even though new simulators continue to be released, the research community tends towards only a handful of open-source simulators. The demand for features in simulators, as shown by our criteria and survey, is high. Therefore, the community should work together to get these features in open-source software. This would reduce the need for custom simulators, and hence increase repeatability and reputability of experiments.\" <ref name=\"Basu, A. 2013\"/>\n\nBesides all the above stated facts, there have been work done on ns-2 open source network simulator. One research issue related to free rider detection and punishment has been explored using ns-2 simulator here.<ref>A Bhakuni, P Sharma, R Kaushal [http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=6779311&tag=1 \"Free-rider detection and punishment in BitTorrent based P2P networks\"], International Advanced Computing Conference, 2014. {{DOI|10.1109/IAdCC.2014.6779311}}</ref>\n\n==See also==\n{{Portal|Internet}}\n{{columns-list|colwidth=30em|\n* [[Client–queue–client]]\n* [[Cultural-Historical Activity Theory (CHAT)]]\n* [[End-to-end principle]]\n* [[Distributed Data Management Architecture]]\n* [[List of P2P protocols]]\n* [[Friend-to-friend]]\n* [[Segmented downloading]]\n* [[Semantic P2P networks]]\n* [[Sharing economy]]\n* [[Wireless ad hoc network]]\n* [[USB dead drop]]\n}}\n\n==References==\n{{Reflist|30em}}\n\n==External links==\n{{Commons category|Peer-to-peer}}\n{{refbegin|2}}\n* Ghosh Debjani, Rajan Payas, Pandey Mayank [https://link.springer.com/chapter/10.1007%2F978-3-319-07350-7_19 P2P-VoD Streaming: Design Issues & User Experience Challenges] Springer Proceedings, June 2014\n* [https://web.archive.org/web/20090922214835/http://www.p2pna.com/glossary.html Glossary] of P2P terminology\n* [https://web.archive.org/web/20090217141525/http://www.sciencedirect.com/science/issue/5624-2008-999689997-678759 Foundation of Peer-to-Peer Computing], Special Issue, Elsevier Journal of Computer Communication, (Ed) Javed I. Khan and Adam Wierzbicki, Volume 31, Issue 2, February 2008\n* {{cite journal | last1 = Anderson | first1 = Ross J. | year = | title = The eternity service | url = http://www.cl.cam.ac.uk/users/rja14/eternity/eternity.html| journal = Pragocrypt | volume = 1996 | issue = | page = }}\n* Marling Engle & J. I. Khan. [http://www.medianet.kent.edu/techreports/TR2006-11-01-p2pvuln-EK.pdf Vulnerabilities of P2P systems and a critical look at their solutions], May 2006\n* Stephanos Androutsellis-Theotokis and Diomidis Spinellis. [http://www.spinellis.gr/pubs/jrnl/2004-ACMCS-p2p/html/AS04.html A survey of peer-to-peer content distribution technologies]. ACM Computing Surveys, 36(4):335–371, December 2004.\n* Biddle, Peter, Paul England, Marcus Peinado, and Bryan Willman, [http://crypto.stanford.edu/DRM2002/darknet5.doc The Darknet and the Future of Content Distribution]. In ''2002 ACM Workshop on Digital Rights Management'', November 2002.\n* John F. Buford, Heather Yu, Eng Keong Lua [https://web.archive.org/web/20090211135759/http://p2pna.com/ P2P Networking and Applications]. {{ISBN|0123742145}}, Morgan Kaufmann, December 2008\n* Djamal-Eddine Meddour, Mubashar Mushtaq, and Toufik Ahmed, \"[http://multicomm.polito.it/proc_multicomm06_8.pdf Open Issues in P2P Multimedia Streaming]\", in the proceedings of the 1st Multimedia Communications Workshop MULTICOMM 2006 held in conjunction with IEEE ICC 2006 pp 43–48, June 2006, Istanbul, Turkey.\n* Detlef Schoder and Kai Fischbach, \"[http://www.econbiz.de/archiv1/2008/42151_concepts_peer-to-peer_networking.pdf Core Concepts in Peer-to-Peer (P2P) Networking]\". In: Subramanian, R.; Goodman, B. (eds.): ''P2P Computing: The Evolution of a Disruptive Technology'', Idea Group Inc, Hershey. 2005\n* Ramesh Subramanian and Brian Goodman (eds), ''[https://web.archive.org/web/20070928224509/http://www.igi-pub.com/books/details.asp?ID=4635 Peer-to-Peer Computing: Evolution of a Disruptive Technology]'', {{ISBN|1-59140-429-0}}, Idea Group Inc., Hershey, PA, United States, 2005.\n* [[Shuman Ghosemajumder]]. [http://dspace.mit.edu/handle/1721.1/8438 Advanced Peer-Based Technology Business Models]''. [[MIT Sloan School of Management]], 2002.\n* Silverthorne, Sean. ''[http://hbswk.hbs.edu/item.jhtml?id=4206&t=innovation Music Downloads: Pirates- or Customers?]''. [[Harvard Business School|Harvard Business School Working Knowledge]], 2004.\n* [https://broadband.mpi-sws.org/transparency/bttest.php Glasnost] test P2P [[traffic shaping]] ([[Max Planck Institute for Software Systems]])\n{{refend}}\n\n{{Bitcoin}}\n{{Tor hidden services}}\n{{Cryptographic software}}\n{{File sharing}}\n\n{{DEFAULTSORT:Peer-To-Peer}}\n[[Category:Peer-to-peer computing| ]]\n[[Category:File sharing networks]]\n[[Category:File sharing]]",
            "slug": "peer-to-peer",
            "date_updated": 1565240937100,
            "imported": "https://en.wikipedia.org/wiki/Peer-to-peer"
        },
        {
            "title": "Peer-to-peer",
            "text": "{{short description|Type of decentralized and distributed network architecture}}\n{{Distinguish|Point-to-point (telecommunications)}}\n{{About|peer-to-peer computer networks}}\n[[Image:P2P-network.svg|thumb|200px|A''' peer-to-peer (P2P) network''' in which interconnected nodes (\"peers\") share resources amongst each other without the use of a centralized administrative system]]\n[[Image:Server-based-network.svg|thumb|200px|A network based on the '''[[client-server model]]''', where individual [[Client (computing)|''clients'']] request services and resources from centralized [[server (computing)|servers]]]]\n\n'''Peer-to-peer''' ('''P2P''') computing or networking is a [[distributed application]] architecture that partitions tasks or workloads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes.\n\nPeers make a portion of their resources, such as processing power, disk storage or network bandwidth, directly available to other network participants, without the need for central coordination by servers or stable hosts.<ref>Rüdiger Schollmeier, ''A Definition of Peer-to-Peer Networking for the Classification of Peer-to-Peer Architectures and Applications'', Proceedings of the First International Conference on Peer-to-Peer Computing, IEEE (2002).</ref> Peers are both suppliers and consumers of resources, in contrast to the traditional [[client-server]] model in which the consumption and supply of resources is divided. Emerging collaborative P2P systems are going beyond the era of peers doing similar things while sharing resources, and are looking for diverse peers that can bring in unique resources and capabilities to a [[virtual community]] thereby empowering it to engage in greater tasks beyond those that can be accomplished by individual peers, yet that are beneficial to all the peers.<ref name=CP2P>{{cite journal|last=Bandara|first=H. M. N. D|author2=A. P. Jayasumana|title=Collaborative Applications over Peer-to-Peer Systems – Challenges and Solutions|journal=Peer-to-Peer Networking and Applications|volume=6|issue=3|pages=257–276|year=2012|doi=10.1007/s12083-012-0157-3|arxiv=1207.0790|bibcode=2012arXiv1207.0790D}}</ref>\n\nWhile P2P systems had previously been used in many application domains,<ref name=\"D. Barkai, 2002\">{{Cite book|title=Peer-to-peer computing : technologies for sharing and collaborating on the net|last=Barkai|first=David|date=2001|publisher=Intel Press|isbn=978-0970284679|location=Hillsboro, OR|oclc=49354877}}</ref> the architecture was popularized by the file sharing system [[Napster]], originally released in 1999. The concept has inspired new structures and philosophies in many areas of human interaction. In such social contexts, [[peer-to-peer (meme)|peer-to-peer as a meme]] refers to the [[egalitarianism|egalitarian]] [[social network]]ing that has emerged throughout society, enabled by [[Internet]] technologies in general.\n\n==Historical development==\n[[File:SETI@home Multi-Beam screensaver.png|thumb|[[SETI@home]] was established in 1999]]\nWhile P2P systems had previously been used in many application domains,<ref name=\"D. Barkai, 2002\"/> the concept was popularized by [[file sharing]] systems such as the music-sharing application [[Napster]] (originally released in 1999). The peer-to-peer movement allowed millions of Internet users to connect \"directly, forming groups and collaborating to become user-created search engines, virtual supercomputers, and filesystems.\" <ref name=\"Oram, A. 2001\">{{Cite book|title=Peer-to-peer: harnessing the benefits of a disruptive technologies|date=2001|publisher=O'Reilly|isbn=9780596001100|editor-last=Oram|editor-first=Andrew|location=[[Sebastopol, California]]|language=English|oclc = 123103147}}</ref> The basic concept of peer-to-peer computing was envisioned in earlier software systems and networking discussions, reaching back to principles stated in the first [[Request for Comments]], RFC 1.<ref>RFC 1, ''Host Software'', S. Crocker, IETF Working Group (April 7, 1969)</ref>\n\n[[Tim Berners-Lee]]'s vision for the [[World Wide Web]] was close to a P2P network in that it assumed each user of the web would be an active editor and contributor, creating and linking content to form an interlinked \"web\" of links. The early Internet was more open than present day, where two machines connected to the Internet could send packets to each other without firewalls and other security measures.<ref name=\"Oram, A. 2001\" />{{Page needed|date=March 2018}} This contrasts to the [[broadcasting]]-like structure of the web as it has developed over the years.<ref>{{cite web |url=http://www.w3.org/People/Berners-Lee/1996/ppf.html |title=The World Wide Web: Past, Present and Future |first=Tim |last=Berners-Lee |date=August 1996 |accessdate=5 November 2011}}</ref><ref name=\"Steinmetz, R. 2005 pp. 9-16\" /> As a precursor to the Internet, [[Arpanet|ARPANET]] was a successful client-server network where \"every participating node could request and serve content.\" However, [[Arpanet|ARPANET]] was not self-organized, and it lacked the ability to \"provide any means for context or content-based routing beyond 'simple' address-based routing.\"<ref name=\"Steinmetz, R. 2005 pp. 9-16\">{{Cite book|title=Peer-to-Peer Systems and Applications|last=Steinmetz|first=Ralf|last2=Wehrle|first2=Klaus|date=2005|publisher=Springer, Berlin, Heidelberg|isbn=9783540291923|series=Lecture Notes in Computer Science|pages=9–16|language=en|chapter=2. What Is This “Peer-to-Peer” About?|doi=10.1007/11530657_2}}</ref>\n\nTherefore, [[Usenet|USENET]], a distributed messaging system that is often described as an early peer-to-peer architecture, was established. It was developed in 1979 as a system that enforces a [[Decentralized computing|decentralized model]] of control. The basic model is a client-server model from the user or client perspective that offers a self-organizing approach to newsgroup servers. However, [[news server]]s communicate with one another as peers to propagate [[Usenet|Usenet news]] articles over the entire group of network servers. The same consideration applies to [[Simple Mail Transfer Protocol|SMTP]] email in the sense that the core email-relaying network of [[mail transfer agent]]s has a peer-to-peer character, while the periphery of [[e-mail client]]s and their direct connections is strictly a client-server relationship.{{citation needed|date=July 2013}}\n\nIn May 1999, with millions more people on the Internet, [[Shawn Fanning]] introduced the music and file-sharing application called Napster.<ref name=\"Steinmetz, R. 2005 pp. 9-16\"/> Napster was the beginning of peer-to-peer networks, as we know them today, where \"participating users establish a virtual network, entirely independent from the physical network, without having to obey any administrative authorities or restrictions.\"<ref name=\"Steinmetz, R. 2005 pp. 9-16\" />\n\n==Architecture==\nA peer-to-peer network is designed around the notion of equal ''[[Peer group (computer networking)|peer]]'' nodes simultaneously functioning as both \"clients\" and \"servers\" to the other nodes on the network. This model of network arrangement differs from the [[client–server]] model where communication is usually to and from a central server. A typical example of a file transfer that uses the client-server model is the [[File Transfer Protocol]] (FTP) service in which the client and server programs are distinct: the clients initiate the transfer, and the servers satisfy these requests.\n\n===Routing and resource discovery===\nPeer-to-peer networks generally implement some form of virtual [[overlay network]] on top of the physical network topology, where the nodes in the overlay form a [[subset]] of the nodes in the physical network. Data is still exchanged directly over the underlying [[TCP/IP]] network, but at the [[application layer]] peers are able to communicate with each other directly, via the logical overlay links (each of which corresponds to a path through the underlying physical network). Overlays are used for indexing and peer discovery, and make the P2P system independent from the physical network topology. Based on how the nodes are linked to each other within the overlay network, and how resources are indexed and located, we can classify networks as ''unstructured'' or ''structured'' (or as a hybrid between the two).<ref>{{cite book |editor-last=Ahson |editor-first=Syed A. |editor2-last=Ilyas |editor2-first=Mohammad |title=SIP Handbook: Services, Technologies, and Security of Session Initiation Protocol |publisher=Taylor & Francis |year=2008 |isbn=9781420066043 |page=204 |url=https://books.google.com/books?id=CKzPq3-wVdcC&pg=PA204}}</ref><ref>{{cite book |editor-last=Zhu |editor-first=Ce |title=Streaming Media Architectures: Techniques and Applications: Recent Advances |publisher=IGI Global |year=2010 |isbn=9781616928339 |page=265 |url=https://books.google.com/books?id=Cb4dWYVJ_8AC&pg=PA265 |display-editors=etal}}</ref><ref>{{cite book |last=Kamel |first=Mina |chapter=Optimal Topology Design for Overlay Networks |editor-last=Akyildiz |editor-first=Ian F. |title=Networking 2007: Ad Hoc and Sensor Networks, Wireless Networks, Next Generation Internet: 6th International IFIP-TC6 Networking Conference, Atlanta, GA, USA, May 14-18, 2007 Proceedings|publisher=Springer |year=2007 |isbn=9783540726050 |page=714 |chapter-url=https://books.google.com/books?id=r4V2G7yPLIAC&pg=PA714 |display-authors=etal}}</ref>\n\n====Unstructured networks====\n[[File:Unstructured peer-to-peer network diagram.png|thumb|right|300px|Overlay network diagram for an '''unstructured P2P network''', illustrating the ad hoc nature of the connections between nodes]]\n''Unstructured peer-to-peer networks'' do not impose a particular structure on the overlay network by design, but rather are formed by nodes that randomly form connections to each other.<ref>{{cite book |last=Filali |first=Imen |chapter=A Survey of Structured P2P Systems for RDF Data Storage and Retrieval |editor-last=Hameurlain |editor-first=Abdelkader |title=Transactions on Large-Scale Data- and Knowledge-Centered Systems III: Special Issue on Data and Knowledge Management in Grid and PSP Systems |publisher=Springer |year=2011 |isbn=9783642230738|page=21 |chapter-url=https://books.google.com/books?id=pjQr7BHtbCoC&pg=PA21 |display-authors=etal|display-editors=etal}}</ref> ([[Gnutella]], [[Gossip protocol|Gossip]], and [[Kazaa]] are examples of unstructured P2P protocols).<ref>{{cite book |last=Zulhasnine |first=Mohammed |chapter=P2P Streaming Over Cellular Networks: Issues, Challenges, and Opportunities |editor=Pathan |title=Building Next-Generation Converged Networks: Theory and Practice |publisher=CRC Press |year=2013 |isbn=9781466507616 |page=99 |chapter-url=https://books.google.com/books?id=tr5PGJk-swIC&pg=PA99 |display-authors=etal|display-editors=etal}}</ref>\n\nBecause there is no structure globally imposed upon them, unstructured networks are easy to build and allow for localized optimizations to different regions of the overlay.<ref>{{cite book |last=Chervenak |first=Ann |last2=Bharathi |first2=Shishir |chapter=Peer-to-peer Approaches to Grid Resource Discovery |editor-last=Danelutto |editor-first=Marco |title=Making Grids Work: Proceedings of the CoreGRID Workshop on Programming Models Grid and P2P System Architecture Grid Systems, Tools and Environments 12-13 June 2007, Heraklion, Crete, Greece|publisher=Springer |year=2008 |isbn=9780387784489 |page=67 |chapter-url=https://books.google.com/books?id=adN0pm_BBuYC&pg=PA67 |display-editors=etal}}</ref> Also, because the role of all peers in the network is the same, unstructured networks are highly robust in the face of high rates of \"churn\"—that is, when large numbers of peers are frequently joining and leaving the network.<ref name=\"Jin-Unstructured-2010\">{{cite book |last=Jin |first=Xing |last2=Chan |first2=S.-H. Gary |chapter=Unstructured Peer-to-Peer Network Architectures |editor=Shen |title=Handbook of Peer-to-Peer Networking |publisher=Springer |year=2010 |isbn=978-0-387-09750-3 |page=119 |display-editors=etal}}</ref><ref name=\"lv-2002\">{{cite book |last=Lv |first=Qin |chapter=Can Heterogeneity Make Gnutella Stable? |editor-last=Druschel |editor-first=Peter |title=Peer-to-Peer Systems: First International Workshop, IPTPS 2002, Cambridge, MA, USA, March 7-8, 2002, Revised Papers |publisher=Springer |year=2002 |isbn=9783540441793 |page=94 |chapter-url=https://books.google.com/books?id=f57AwpUIctcC&pg=PA94 |display-authors=etal|display-editors=etal}}</ref>\n\nHowever, the primary limitations of unstructured networks also arise from this lack of structure. In particular, when a peer wants to find a desired piece of data in the network, the search query must be flooded through the network to find as many peers as possible that share the data. Flooding causes a very high amount of signaling traffic in the network, uses more [[Cpu|CPU]]/memory (by requiring every peer to process all search queries), and does not ensure that search queries will always be resolved. Furthermore, since there is no [[correlation]] between a peer and the content managed by it, there is no guarantee that flooding will find a peer that has the desired data. Popular content is likely to be available at several peers and any peer searching for it is likely to find the same thing. But if a peer is looking for rare data shared by only a few other peers, then it is highly unlikely that search will be successful.<ref>{{cite book |last=Shen |first=Xuemin |last2=Yu |first2=Heather |last3=Buford |first3=John |last4=Akon |first4=Mursalin |title=Handbook of Peer-to-Peer Networking |publisher=Springer|edition=1st |year=2009 |location=New York |page=118 |isbn=978-0-387-09750-3}}</ref>\n\n====Structured networks====\n[[File:Structured (DHT) peer-to-peer network diagram.png|thumb|right|300px|Overlay network diagram for a '''structured P2P network''', using a [[distributed hash table]] (DHT) to identify and locate nodes/resources]]\n\nIn ''structured peer-to-peer networks'' the overlay is organized into a specific topology, and the protocol ensures that any node can efficiently<ref>Typically approximating [[Big O notation|O(log N)]], where N is the number of nodes in the P2P system{{citation needed|date=July 2013}}</ref> search the network for a file/resource, even if the resource is extremely rare.\n\nThe most common type of structured P2P networks implement a [[distributed hash table]] (DHT),<ref>Other design choices include overlay rings and d-Torus. See for example {{cite journal |last=Bandara |first=H. M. N. D. |first2=A. P. |last2=Jayasumana |title=Collaborative Applications over Peer-to-Peer Systems – Challenges and Solutions |journal=Peer-to-Peer Networking and Applications |volume=6 |issue=3 |pages=257 |year=2012 |doi=10.1007/s12083-012-0157-3 |arxiv=1207.0790 |bibcode=2012arXiv1207.0790D }}</ref><ref>R. Ranjan, A. Harwood, and R. Buyya, \"Peer-to-peer based resource discovery in global grids: a tutorial,\" ''IEEE Commun. Surv.'', vol. 10, no. 2. and P. Trunfio, \"Peer-to-Peer resource discovery in Grids: Models and systems,\" ''Future Generation Computer Systems'' archive, vol. 23, no. 7, Aug. 2007.</ref> in which a variant of [[consistent hashing]] is used to assign ownership of each file to a particular peer.<ref>{{cite book |last1=Kelaskar |first1=M. |last2=Matossian |first2=V. |last3=Mehra |first3=P. |last4=Paul |first4=D. |last5=Parashar |first5=M. |year=2002 |url=http://portal.acm.org/citation.cfm?id=873218 |title=A Study of Discovery Mechanisms for Peer-to-Peer Application |pages=444– |postscript=<!-- Bot inserted parameter. Either remove it; or change its value to \".\" for the cite to end in a \".\", as necessary. -->&#123;&#123;inconsistent citations&#125;&#125;|isbn=9780769515823 }}</ref><ref name=\"P2P_API\">{{cite book |last=Dabek |first=Frank |first2=Ben |last2=Zhao |first3=Peter |last3=Druschel |first4=John |last4=Kubiatowicz |first5=Ion |last5=Stoica |title=Towards a Common API for Structured Peer-to-Peer Overlays |journal=Peer-to-Peer Systems II |year=2003 |volume=2735 |series=Lecture Notes in Computer Science |pages=33–44 |doi=10.1007/978-3-540-45172-3_3 |isbn=978-3-540-40724-9 |citeseerx=10.1.1.12.5548 }}</ref> This enables peers to search for resources on the network using a [[hash table]]: that is, (''key'', ''value'') pairs are stored in the DHT, and any participating node can efficiently retrieve the value associated with a given key.<ref>Moni Naor and Udi Wieder. [http://www.wisdom.weizmann.ac.il/~naor/PAPERS/dh.pdf Novel Architectures for P2P Applications: the Continuous-Discrete Approach]. Proc. SPAA, 2003.</ref><ref>Gurmeet Singh Manku. [http://www-db.stanford.edu/~manku/phd/index.html Dipsea: A Modular Distributed Hash Table] {{webarchive|url=https://web.archive.org/web/20040910154927/http://www-db.stanford.edu/~manku/phd/index.html |date=2004-09-10 }}. Ph. D. Thesis (Stanford University), August 2004.</ref>\n[[File:DHT en.svg|thumb|left|250px|Distributed hash tables]]\n\nHowever, in order to route traffic efficiently through the network, nodes in a structured overlay must maintain lists of neighbors that satisfy specific criteria. This makes them less robust in networks with a high rate of ''churn'' (i.e. with large numbers of nodes frequently joining and leaving the network).<ref name=\"lv-2002\" /><ref>{{cite book|last=Li |first=Deng |title=An Efficient, Scalable, and Robust P2P Overlay for Autonomic Communication |editor-last=Vasilakos |editor-first=A.V. |publisher=Springer |year=2009 |isbn=978-0-387-09752-7 |page=329 |url=https://books.google.com/books?id=c02mTcXW_U4C&pg=PA329 |display-authors=etal|display-editors=etal}}</ref>\nMore recent evaluation of P2P resource discovery solutions under real workloads have pointed out several issues in DHT-based solutions such as high cost of advertising/discovering resources and static and dynamic load imbalance.<ref>{{cite journal |last=Bandara |first=H. M. N. Dilum |first2=Anura P. |last2=Jayasumana |title=Evaluation of P2P Resource Discovery Architectures Using Real-Life Multi-Attribute Resource and Query Characteristics |journal=IEEE Consumer Communications and Networking Conf. (CCNC '12) |date=January 2012}}</ref>\n\nNotable distributed networks that use DHTs include [[Tixati]], an alternative to [[BitTorrent (protocol)|BitTorrent's]] distributed tracker, the [[Kad network]], the [[Storm botnet]], [[YaCy]], and the [[Coral Content Distribution Network]]. Some prominent research projects include the [[Chord (peer-to-peer)|Chord project]], [[Kademlia]], [[PAST storage utility]], [[P-Grid]], a self-organized and emerging overlay network, and [[CoopNet content distribution system]].<ref>{{cite book | last=Korzun | first=Dmitry| last2=Gurtov| first2 = Andrei| title= Structured P2P Systems: Fundamentals of Hierarchical Organization, Routing, Scaling, and Security|publisher=Springer | isbn = 978-1-4614-5482-3 |date= November 2012 | url=https://www.springer.com/gp/book/9781461454823}}</ref> DHT-based networks have also been widely utilized for accomplishing efficient resource discovery<ref>{{cite web |last1=Ranjan |first1=Rajiv |last2=Harwood|first2=Aaron |last3=Buyya |first3=Rajkumar |date=1 December 2006 |url=http://www.cs.mu.oz.au/%7Erranjan/pgrid.pdf |title=A Study on Peer-to-Peer Based Discovery of Grid Resource Information|postscript=<!-- Bot inserted parameter. Either remove it; or change its value to \".\" for the cite to end in a \".\", as necessary. -->&#123;&#123;inconsistent citations&#125;&#125;}}</ref><ref>{{cite web |url=http://gridbus.org/papers/DecentralisedDiscoveryGridFed-eScience2007.pdf |first=Rajiv |last=Ranjan |first2=Lipo |last2=Chan |first3=Aaron |last3=Harwood |first4=Shanika |last4=Karunasekera |first5=Rajkumar |last5=Buyya |title=Decentralised Resource Discovery Service for Large Scale Federated Grids |deadurl=yes |archiveurl=https://web.archive.org/web/20080910170417/http://gridbus.org/papers/DecentralisedDiscoveryGridFed-eScience2007.pdf |archivedate=2008-09-10 |df= }}</ref> for [[grid computing]] systems, as it aids in resource management and scheduling of applications.\n\n====Hybrid models====\nHybrid models are a combination of peer-to-peer and client-server models.<ref>{{cite book |last=Darlagiannis |first=Vasilios |chapter=Hybrid Peer-to-Peer Systems|editor-last1=Steinmetz |editor-first1=Ralf |editor-last2=Wehrle |editor-first2=Klaus |title=Peer-to-Peer Systems and Applications |publisher=Springer |year=2005 |isbn=9783540291923 |chapter-url=https://books.google.com/books?id=A8CLZ1FB4qoC&pg=PA353 }}</ref> A common hybrid model is to have a central server that helps peers find each other. [[Spotify]] was an example of a hybrid model [until 2014]. There are a variety of hybrid models, all of which make trade-offs between the centralized functionality provided by a structured server/client network and the node equality afforded by the pure peer-to-peer unstructured networks. Currently, hybrid models have better performance than either pure unstructured networks or pure structured networks because certain functions, such as searching, do require a centralized functionality but benefit from the decentralized aggregation of nodes provided by unstructured networks.<ref>{{cite journal |last1=Yang |first1=Beverly |last2=Garcia-Molina |first2=Hector |year=2001 |title=Comparing Hybrid Peer-to-Peer Systems |journal=Very Large Data Bases |volume= |issue= |pages= |publisher= |doi= |url=http://infolab.stanford.edu/~byang/pubs/hybridp2p_long.pdf |accessdate=8 October 2013}}</ref>\n\n====CoopNet content distribution system====\n'''CoopNet (Cooperative Networking)''' was a proposed system for off-loading serving to [[Peer-to-peer|peers]] who have recently [[download]]ed content, proposed by computer scientists Venkata N. Padmanabhan and Kunwadee Sripanidkulchai, working at [[Microsoft Research]] and [[Carnegie Mellon University]].<ref>{{Cite book| last = Padmanabhan| first = Venkata N.[http://research.microsoft.com/~padmanab/]| last2 = Sripanidkulchai| first2 = Kunwadee [http://www.andrew.cmu.edu/~kunwadee/]| author2-link = | publication-date = March 2002| year = 2002| title = The Case for Cooperative Networking (PostScript with addendum)| volume = Proceedings of the First International Workshop on Peer-to-Peer Systems| series = Lecture Notes in Computer Science| location = Cambridge, MA| publisher = Springer| pages = 178| isbn = 978-3-540-44179-3| doi = 10.1007/3-540-45748-8_17| url = http://research.microsoft.com/projects/CoopNet/papers/iptps02-with-addendum.ps| archive-url = https://web.archive.org/web/20030701090204/http://research.microsoft.com/projects/coopnet/papers/iptps02-with-addendum.ps| dead-url = yes| archive-date = 2003-07-01| format = &ndash; <sup>[https://scholar.google.co.uk/scholar?hl=en&lr=&q=author%3APadmanabhan+intitle%3AThe+Case+for+Cooperative+Networking+%28PostScript+with+addendum%29&as_publication=&as_ylo=2002&as_yhi=2002&btnG=Search Scholar search]</sup>}}  [http://research.microsoft.com/projects/CoopNet/papers/iptps02-with-addendum.pdf PDF (Microsoft, with addendum)] [http://www.springerlink.com/index/BP5A2RHBH7QP55D6.pdf PDF (Springer, original, fee may be required)]</ref><ref>{{Cite web|url=http://research.microsoft.com/projects/CoopNet/|title=CoopNet: Cooperative Networking|publisher=Microsoft Research}}  Project home page.</ref> Basically when a [[Server (computing)|server]] experiences an increase in load it redirects incoming peers to other peers who have agreed to [[mirror]] the content, thus off-loading balance from the server.  All of the information is retained at the server.  This system makes use of the fact that the bottle-neck is most likely in the outgoing bandwidth than the [[CPU]], hence its server-centric design.  It assigns peers to other peers who are 'close in [[IP Address|IP]]' to its neighbors [same prefix range] in an attempt to use locality.  If multiple peers are found with the same [[Computer file|file]] it designates that the node choose the fastest of its neighbors. [[Streaming media]] is transmitted by having clients [[web cache|cache]] the previous stream, and then transmit it piece-wise to new nodes.\n\n===Security and trust===\nPeer-to-peer systems pose unique challenges from a [[computer security]] perspective.\n\nLike any other form of [[software]], P2P applications can contain [[vulnerability (computing)|vulnerabilities]]. What makes this particularly dangerous for P2P software, however, is that peer-to-peer applications act as servers as well as clients, meaning that they can be more vulnerable to [[Exploit (computer security)|remote exploits]].<ref name=\"vu-p2p-principles-p8\">{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |page=8 |url= |display-authors=etal}}</ref>\n\n====Routing attacks====\nAlso, since each node plays a role in routing traffic through the network, malicious users can perform a variety of \"routing attacks\", or [[denial of service]] attacks. Examples of common routing attacks include \"incorrect lookup routing\" whereby malicious nodes deliberately forward requests incorrectly or return false results, \"incorrect routing updates\" where malicious nodes corrupt the routing tables of neighboring nodes by sending them false information, and \"incorrect routing network partition\" where when new nodes are joining they bootstrap via a malicious node, which places the new node in a partition of the network that is populated by other malicious nodes.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |pages=157–159 |url= |display-authors=etal}}</ref>\n\n====Corrupted data and malware====\n{{See also|Data validation|Malware}}\nThe prevalence of [[malware]] varies between different peer-to-peer protocols. Studies analyzing the spread of malware on P2P networks found, for example, that 63% of the answered download requests on the [[gnutella]] network contained some form of malware, whereas only 3% of the content on [[OpenFT]] contained malware. In both cases, the top three most common types of malware accounted for the large majority of cases (99% in gnutella, and 65% in OpenFT). Another study analyzing traffic on the [[Kazaa]] network found that 15% of the 500,000 file sample taken were infected by one or more of the 365 different [[computer viruses]] that were tested for.<ref>{{cite book |last=Goebel |first=Jan |chapter=Measurement and Analysis of Autonomous Spreading Malware in a University Environment |editor-last=Hämmerli |editor-first=Bernhard Markus |editor2-last=Sommer |editor2-first=Robin |title=Detection of Intrusions and Malware, and Vulnerability Assessment: 4th International Conference, DIMVA 2007 Lucerne, Switzerland, July 12-13, 2007 Proceedings |publisher=Springer |year=2007 |isbn=9783540736134 |page=112 |chapter-url=https://books.google.com/books?id=M0PfEaVa9QIC&pg=PA112 |display-authors=etal}}</ref>\n\nCorrupted data can also be distributed on P2P networks by modifying files that are already being shared on the network. For example, on the [[FastTrack]] network, the [[RIAA]] managed to introduce faked chunks into downloads and downloaded files (mostly [[MP3]] files). Files infected with the RIAA virus were unusable afterwards and contained malicious code. The RIAA is also known to have uploaded fake music and movies to P2P networks in order to deter illegal file sharing.<ref>{{cite news |url=https://www.nytimes.com/2003/05/04/business/04MUSI.html |title=Software Bullet Is Sought to Kill Musical Piracy |last=Sorkin |first=Andrew Ross |date=4 May 2003 |newspaper=New York Times |accessdate=5 November 2011}}</ref> Consequently, the P2P networks of today have seen an enormous increase of their security and file verification mechanisms. Modern [[hash chain|hashing]], [[File verification|chunk verification]] and different encryption methods have made most networks resistant to almost any type of attack, even when major parts of the respective network have been replaced by faked or nonfunctional hosts.<ref>{{cite techreport |first=Vivek |last=Singh |first2=Himani |last2=Gupta |title= Anonymous File Sharing in Peer to Peer System by Random Walks |number=123456789/9306 |institution=SRM University |year=2012 }}</ref>\n\n===Resilient and scalable computer networks===\n{{See also|Wireless mesh network|Distributed computing}}\nThe decentralized nature of P2P networks increases robustness because it removes the [[Reliability engineering|single point of failure]] that can be inherent in a client-server based system.<ref name=\"ms-overlay-survey\">{{cite web |url=http://academic.research.microsoft.com/Publication/2633870/a-survey-and-comparison-of-peer-to-peer-overlay-network-schemes |title=A survey and comparison of peer-to-peer overlay network schemes |last=Lua |first=Eng Keong |last2=Crowcroft |first2=Jon |last3=Pias |first3=Marcelo |last4=Sharma |first4=Ravi |last5=Lim |first5=Steven |year=2005 |deadurl=yes |archiveurl=https://web.archive.org/web/20120724222234/http://academic.research.microsoft.com/Publication/2633870/a-survey-and-comparison-of-peer-to-peer-overlay-network-schemes |archivedate=2012-07-24 |df= }}</ref> As nodes arrive and demand on the system increases, the total capacity of the system also increases, and the likelihood of failure decreases. If one peer on the network fails to function properly, the whole network is not compromised or damaged. In contrast, in a typical client–server architecture, clients share only their demands with the system, but not their resources. In this case, as more clients join the system, fewer resources are available to serve each client, and if the central server fails, the entire network is taken down.\n\n===Distributed storage and search===\n[[File:Yacy-resultados.png|thumb|right|300px|Search results for the query \"[[software libre]]\", using [[YaCy]] a free [[distributed search engine]] that runs on a peer-to-peer network instead making requests to centralized index servers (like [[Google]], [[Yahoo]], and other corporate search engines)]]\nThere are both advantages and disadvantages in P2P networks related to the topic of data [[backup]], recovery, and availability. In a centralized network, the system administrators are the only forces controlling the availability of files being shared. If the administrators decide to no longer distribute a file, they simply have to remove it from their servers, and it will no longer be available to users. Along with leaving the users powerless in deciding what is distributed throughout the community, this makes the entire system vulnerable to threats and requests from the government and other large forces. For example, [[YouTube]] has been pressured by the RIAA, MPAA, and entertainment industry to filter out copyrighted content. Although server-client networks are able to monitor and manage content availability, they can have more stability in the availability of the content they choose to host. A client should not have trouble accessing obscure content that is being shared on a stable centralized network. P2P networks, however, are more unreliable in sharing unpopular files because sharing files in a P2P network requires that at least one node in the network has the requested data, and that node must be able to connect to the node requesting the data. This requirement is occasionally hard to meet because users may delete or stop sharing data at any point.<ref>{{cite journal |year=2003 |title=Looking up data in P2P systems |journal=Communications of the ACM |volume=46 |issue=2 |pages=43–48 |publisher= |doi=10.1145/606272.606299 |pmid= |pmc= |url=http://www.nms.lcs.mit.edu/papers/p43-balakrishnan.pdf |accessdate=8 October 2013|last1=Balakrishnan |first1=Hari |last2=Kaashoek |first2=M. Frans |last3=Karger |first3=David |last4=Morris |first4=Robert |last5=Stoica |first5=Ion |citeseerx=10.1.1.5.3597 }}</ref>\n\nIn this sense, the community of users in a P2P network is completely responsible for deciding what content is available. Unpopular files will eventually disappear and become unavailable as more people stop sharing them. Popular files, however, will be highly and easily distributed. Popular files on a P2P network actually have more stability and availability than files on central networks. In a centralized network, a simple loss of connection between the server and clients is enough to cause a failure, but in P2P networks, the connections between every node must be lost in order to cause a data sharing failure. In a centralized system, the administrators are responsible for all data recovery and backups, while in P2P systems, each node requires its own backup system. Because of the lack of central authority in P2P networks, forces such as the recording industry, RIAA, MPAA, and the government are unable to delete or stop the sharing of content on P2P systems.<ref>{{cite web |url=http://www.p2pnews.net/2012/06/14/art-thou-a-peer/ |title=Art thou a Peer? |author=<!--Staff writer(s); no by-line.--> |date=14 June 2012 |website=www.p2pnews.net |publisher= |accessdate=10 October 2013 |deadurl=yes |archiveurl=https://web.archive.org/web/20131006022409/http://www.p2pnews.net/2012/06/14/art-thou-a-peer/ |archivedate=6 October 2013 |df= }}</ref>\n\n==Applications==\n{{Prose|date=September 2014}}\n\n===Content delivery===\nIn P2P networks, clients both provide and use resources. This means that unlike client-server systems, the content-serving capacity of peer-to-peer networks can actually ''increase'' as more users begin to access the content (especially with protocols such as [[Bittorrent]] that require users to share, refer a performance measurement study<ref>Sharma P., Bhakuni A. & Kaushal R.[http://ieeexplore.ieee.org/xpl/login.jsp?tp=&arnumber=6488040&url=http%3A%2F%2Fieeexplore.ieee.org%2Fxpls%2Fabs_all.jsp%3Farnumber%3D6488040  \"Performance Analysis of BitTorrent Protocol]. National Conference on Communications, 2013 {{DOI|10.1109/NCC.2013.6488040}}</ref>). This property is one of the major advantages of using P2P networks because it makes the setup and running costs very small for the original content distributor.<ref>{{cite journal |last=Li |first=Jin |title=On peer-to-peer (P2P) content delivery |journal=Peer-to-Peer Networking and Applications |volume=1 |issue=1 |doi=10.1007/s12083-007-0003-1 |pages=45–63 ≤≥|url=http://www.land.ufrj.br/~classes/coppe-redes-2008/biblio/P2P-content-delivery.pdf |year=2008 }}</ref><ref>{{cite book |last=Stutzbach |first=Daniel |chapter=The scalability of swarming peer-to-peer content delivery |editor-last=Boutaba |editor-first=Raouf |title=NETWORKING 2005 -- Networking Technologies, Services, and Protocols; Performance of Computer and Communication Networks; Mobile and Wireless Communications Systems |publisher=Springer |year=2005 |isbn=978-3-540-25809-4 |pages=15–26 |chapter-url=http://ix.cs.uoregon.edu/~reza/PUB/networking05.pdf |display-authors=etal|display-editors=etal}}</ref>\n\n===File-sharing networks===\nMany file [[peer-to-peer file sharing]] networks, such as [[Gnutella]], [[Gnutella2|G2]], and the [[eDonkey network]] popularized peer-to-peer technologies.\n* [[Content delivery network|Peer-to-peer content delivery networks]].\n* Peer-to-peer content services, e.g. caches for improved performance such as Correli Caches<ref>Gareth Tyson, Andreas Mauthe, Sebastian Kaune, Mu Mu and Thomas Plagemann. Corelli: A Dynamic Replication Service for Supporting Latency-Dependent Content in Community Networks. In Proc. 16th ACM/SPIE Multimedia Computing and Networking Conference (MMCN), San Jose, CA (2009).{{cite web |url=http://www.dcs.kcl.ac.uk/staff/tysong/files/MMCN09.pdf |title=Archived copy |accessdate=2011-03-12 |deadurl=yes |archiveurl=https://web.archive.org/web/20110429181811/http://www.dcs.kcl.ac.uk/staff/tysong/files/MMCN09.pdf |archivedate=2011-04-29 |df= }}</ref>\n* Software publication and distribution ([[Linux distribution]], several games); via [[file sharing]] networks.\n\n====Copyright infringements====\nPeer-to-peer networking involves data transfer from one user to another without using an intermediate server. Companies developing P2P applications have been involved in numerous legal cases, primarily in the United States, over conflicts with [[copyright]] law.<ref name=\"Springer\">{{cite book |last=Glorioso |first=Andrea |chapter=The Social Impact of P2P Systems |editor=Shen |title=Handbook of Peer-to-Peer Networking|publisher=Springer |year=2010 |isbn=978-0-387-09750-3 |page=48 |display-authors=etal|display-editors=etal}}</ref> Two major cases are ''[[Grokster]] vs RIAA'' and ''[[MGM Studios, Inc. v. Grokster, Ltd.]]''.<ref name=\"news.cnet.com\">{{cite web |author=John Borland |title=Judge: File-Swapping Tools are Legal |url=http://news.cnet.com/Judge-File-swapping-tools-are-legal/2100-1027_3-998363.html/ |date=April 25, 2003 |archive-url=https://web.archive.org/web/20120310165410/http://news.cnet.com/Judge-File-swapping-tools-are-legal/2100-1027_3-998363.html |archive-date=2012-03-10 |website=news.cnet.com |dead-url=yes}}</ref> In the last case, the Court unanimously held that defendant peer-to-peer file sharing companies Grokster and Streamcast could be sued for inducing copyright infringement.\n\n===Multimedia===\n* The [[P2PTV]] and [[Peer Distributed Transfer Protocol|PDTP]] protocols.\n* Some [[Proprietary software|proprietary]] multimedia applications use a peer-to-peer network along with streaming servers to stream audio and video to their clients.\n* [[Peercasting]] for multicasting streams.\n* [[Pennsylvania State University]], MIT and [[Simon Fraser University]] are carrying on a project called [[LionShare]] designed for facilitating file sharing among educational institutions globally.\n* [[Osiris (Serverless Portal System)|Osiris]] is a program that allows its users to create anonymous and autonomous web portals distributed via P2P network.\n\n===Energy trading===\nCompanies such as [[Power Ledger]] and [[Bovlabs]] employ peer-to-peer energy trading platforms.<ref>[https://coincentral.com/power-ledger-beginner-guide/ Power Ledger The Complete Guide: Future Projects and Roadmap]</ref><ref>[https://www.euronews.com/living/2019/07/04/nine-sustainable-economy-startups-aiming-to-clean-up-our-future 9 sustainable economy startups aiming to clean up our future ]</ref>\n\n===Other P2P applications===\n[[File:Torrent peers.png|thumb|[[Torrent file]] connect peers]]\n* [[Bitcoin]] and alternatives such as [[Ether (cryptocurrency)|Ether]], [[Nxt]] and [[Peercoin]] are peer-to-peer-based [[digital currency|digital]] [[Cryptocurrency|cryptocurrencies]].\n* [[Dalesa]], a peer-to-peer [[web cache]] for [[Local area network|LANs]] (based on IP [[multicast]]ing).\n* [[FAROO]], a peer-to-peer web search engine\n* [[Filecoin]] is an [[Open-source software|open source]], public, [[cryptocurrency]] and digital [[payment system]] intended to be a [[blockchain]]-based [[Cooperative storage cloud|cooperative digital storage]] and data retrieval method.\n* [[I2P]], an [[overlay network]] used to browse the Internet [[Internet anonymity|anonymously]].\n* [[Infinit (file system)|Infinit]] is an unlimited and encrypted peer to peer file sharing application for digital artists written in [[C++]].\n* The [[InterPlanetary File System]] (IPFS) is a [[Communications protocol|protocol]] and network designed to create a [[content-addressable storage|content-addressable]], [[peer-to-peer]] method of storing and sharing [[hypermedia]] distribution protocol. Nodes in the IPFS network form a [[distributed file system]].\n* [[JXTA]], a peer-to-peer protocol designed for the [[Java platform]].\n* [[Netsukuku]], a [[Wireless community network]] designed to be independent from the Internet.\n* [[Open Garden]], connection sharing application that shares Internet access with other devices using Wi-Fi or Bluetooth.\n* Research like the [[Chord (peer-to-peer)|Chord project]], the [[PAST storage utility]], the [[P-Grid]], and the [[CoopNet content distribution system]].\n* [[Tradepal]] and [[M-commerce]] applications that power real-time marketplaces.\n* The [[U.S. Department of Defense]] is conducting research on P2P networks as part of its modern network warfare strategy.<ref>{{cite news |url=https://www.washingtonpost.com/ac2/wp-dyn?pagename=article&node=washtech/techthursday/columns/dotcom&contentId=A59099-2001Nov7 |last=Walker |first=Leslie |title=Uncle Sam Wants Napster! |work=The Washington Post |date=2001-11-08 |accessdate=2010-05-22 }}</ref> In May, 2003, [[Anthony Tether]], then director of [[DARPA]], testified that the United States military uses P2P networks.\n* [[WebTorrent]] is a P2P [[Stream (computing)|streaming]] [[torrent client]] in [[JavaScript]] for use in [[web browser]]s, as well as in the [[WebTorrent Desktop]] stand alone version that bridges WebTorrent and [[BitTorrent]] serverless networks.\n*[[Tor (anonymity network)]]\n* [[Microsoft]] in [[Windows 10]] uses a proprietary peer to peer technology called \"\"Delivery Optimization\" to deploy operating system updates using end-users PCs either on the local network or other PCs. According to Microsoft's Channel 9 it led to a 3%-50% reduction in Internet bandwidth usage.<ref>Hammerksjold Andreas; Engler, Narkis, [https://channel9.msdn.com/Events/Ignite/Microsoft-Ignite-Orlando-2017/BRK2048 \"Delivery Optimization - a deep dive\"], ''[[Channel 9 (Microsoft)|Channel 9]]'', 11 October 2017, Retrieved on 4 February 2019.</ref>\n* Artisoft's [[LANtastic]] was built as a peer-to-peer operating system. Machines can be servers and workstations at the same time.\n\n==Social implications==\n{{See also|Social peer-to-peer processes}}\n\n===Incentivizing resource sharing and cooperation===\n{{further information|Uberisation}}\n[[File:Torrentcomp small.gif|thumb|right|300px|'''The [[BitTorrent]] protocol''': In this animation, the colored bars beneath all of the 7 clients in the upper region above represent the file being shared, with each color representing an individual piece of the file. After the initial pieces transfer from the [[seed (BitTorrent)|seed]] (large system at the bottom), the pieces are individually transferred from client to client. The original seeder only needs to send out one copy of the file for all the clients to receive a copy.]]\nCooperation among a community of participants is key to the continued success of P2P systems aimed at casual human users; these reach their full potential only when large numbers of nodes contribute resources. But in current practice, P2P networks often contain large numbers of users who utilize resources shared by other nodes, but who do not share anything themselves (often referred to as the \"freeloader problem\"). Freeloading can have a profound impact on the network and in some cases can cause the community to collapse.<ref>Krishnan, R., Smith, M. D., Tang, Z., & Telang, R. (2004, January). The impact of free-riding on peer-to-peer networks. In System Sciences, 2004. Proceedings of the 37th Annual Hawaii International Conference on (pp. 10-pp). IEEE.</ref> In these types of networks \"users have natural disincentives to cooperate because cooperation consumes their own resources and may degrade their own performance.\" <ref name=\"Feldman, M. 2004, pp. 102-111\">Feldman, M., Lai, K., Stoica, I., & Chuang, J. (2004, May). Robust incentive techniques for peer-to-peer networks. In Proceedings of the 5th ACM conference on Electronic commerce (pp. 102-111). ACM.</ref> Studying the social attributes of P2P networks is challenging due to large populations of turnover, asymmetry of interest and zero-cost identity.<ref name=\"Feldman, M. 2004, pp. 102-111\"/> A variety of incentive mechanisms have been implemented to encourage or even force nodes to contribute resources.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |page=172 |url= |display-authors=etal}}</ref>\n\nSome researchers have explored the benefits of enabling virtual communities to self-organize and introduce incentives for resource sharing and cooperation, arguing that the social aspect missing from today's P2P systems should be seen both as a goal and a means for self-organized virtual communities to be built and fostered.<ref>P. Antoniadis and B. Le Grand, \"Incentives for resource sharing in self-organized communities: From economics to social psychology,\" Digital Information Management (ICDIM '07), 2007</ref> Ongoing research efforts for designing effective incentive mechanisms in P2P systems, based on principles from game theory, are beginning to take on a more psychological and information-processing direction.\n\n====Privacy and anonymity====\nSome peer-to-peer networks (e.g. [[Freenet]]) place a heavy emphasis on [[privacy]] and [[anonymity]]—that is, ensuring that the contents of communications are hidden from eavesdroppers, and that the identities/locations of the participants are concealed. [[Public key cryptography]] can be used to provide [[encryption]], [[data validation]], authorization, and authentication for data/messages. [[Onion routing]] and other [[mix network]] protocols (e.g. Tarzan) can be used to provide anonymity.<ref>{{cite book |last=Vu |first=Quang H. |title=Peer-to-Peer Computing: Principles and Applications |publisher=Springer |year=2010 |isbn=978-3-642-03513-5 |pages=179–181 |url= |display-authors=etal}}</ref>\n\n==Political implications==\n\n===Intellectual property law and illegal sharing===\nAlthough peer-to-peer networks can be used for legitimate purposes, rights holders have targeted peer-to-peer over the involvement with sharing copyrighted material. Peer-to-peer networking involves data transfer from one user to another without using an intermediate server. Companies developing P2P applications have been involved in numerous legal cases, primarily in the United States, primarily over issues surrounding [[copyright]] law.<ref name=\"Springer\"/> Two major cases are ''[[Grokster]] vs RIAA'' and ''[[MGM Studios, Inc. v. Grokster, Ltd.]]''<ref name=\"news.cnet.com\"/> In both of the cases the file sharing technology was ruled to be legal as long as the developers had no ability to prevent the sharing of the copyrighted material. To establish criminal liability for the copyright infringement on peer-to-peer systems, the government must prove that the defendant infringed a copyright willingly for the purpose of personal financial gain or commercial advantage.<ref>Majoras, D. B. (2005). Peer-to-peer file-sharing technology consumer protection and competition issues. Federal Trade Commission, Retrieved from http://www.ftc.gov/reports/p2p05/050623p2prpt.pdf</ref> [[Fair use]] exceptions allow limited use of copyrighted material to be downloaded without acquiring permission from the rights holders. These documents are usually news reporting or under the lines of research and scholarly work. Controversies have developed over the concern of illegitimate use of peer-to-peer networks regarding public safety and national security. When a file is downloaded through a peer-to-peer network, it is impossible to know who created the file or what users are connected to the network at a given time. Trustworthiness of sources is a potential security threat that can be seen with peer-to-peer systems.<ref>The Government of the Hong Kong Special Administrative Region, (2008). Peer-to-peer network. Retrieved from website: http://www.infosec.gov.hk/english/technical/files/peer.pdf</ref>\n\nA study ordered by the [[European Union]] found that illegal downloading ''may'' lead to an increase in overall video game sales because newer games charge for extra features or levels. The paper concluded that piracy had a negative financial impact on movies, music, and literature. The study relied on self-reported data about game purchases and use of illegal download sites. Pains were taken to remove effects of false and misremembered responses.<ref>{{Cite news|url=http://www.newsweek.com/secret-piracy-study-european-union-669436|title=Illegal downloads may not actually harm sales, but the European Union doesn't want you to know that|last=Sanders|first=Linley|date=2017-09-22|work=Newsweek|access-date=2018-03-29|language=en}}</ref><ref>{{Cite news|url=http://bigthink.com/david-ryan-polgar/video-game-piracy-may-actually-result-in-more-sales|title=Does Video Game Piracy Actually Result in More Sales?|last=Polgar|first=David Ryan|date=October 15, 2017|work=Big Think|access-date=2018-03-29}}</ref><ref>{{Cite news|url=https://arstechnica.com/gaming/2017/09/eu-study-finds-piracy-doesnt-hurt-game-sales-may-actually-help/|title=EU study finds piracy doesn't hurt game sales, may actually help|last=Orland|first=Kyle|date=September 26, 2017|work=Ars Technica|access-date=2018-03-29|language=en-us}}</ref>\n\n===Network neutrality===\nPeer-to-peer applications present one of the core issues in the [[network neutrality]] controversy. Internet service providers ([[Internet service provider|ISPs]]) have been known to throttle P2P file-sharing traffic due to its high-[[Bandwidth (computing)|bandwidth]] usage.<ref name=\"newteevee.com\">Janko Roettgers, 5 Ways to Test Whether your ISP throttles P2P, http://newteevee.com/2008/04/02/5-ways-to-test-if-your-isp-throttles-p2p/</ref> Compared to Web browsing, e-mail or many other uses of the internet, where data is only transferred in short intervals and relative small quantities, P2P file-sharing often consists of relatively heavy bandwidth usage due to ongoing file transfers and swarm/network coordination packets. In October 2007, [[Comcast]], one of the largest broadband Internet providers in the United States, started blocking P2P applications such as [[BitTorrent (protocol)|BitTorrent]]. Their rationale was that P2P is mostly used to share illegal content, and their infrastructure is not designed for continuous, high-bandwidth traffic. Critics point out that P2P networking has legitimate legal uses, and that this is another way that large providers are trying to control use and content on the Internet, and direct people towards a [[client-server]]-based application architecture. The client-server model provides financial barriers-to-entry to small publishers and individuals, and can be less efficient for sharing large files. As a reaction to this [[bandwidth throttling]], several P2P applications started implementing protocol obfuscation, such as the [[BitTorrent protocol encryption]]. Techniques for achieving \"protocol obfuscation\" involves removing otherwise easily identifiable properties of protocols, such as deterministic byte sequences and packet sizes, by making the data look as if it were random.<ref name=\"breaking\">{{cite web |url=http://www.iis.se/docs/hjelmvik_breaking.pdf |title=Breaking and Improving Protocol Obfuscation |last1=Hjelmvik |first1=Erik |last2=John |first2=Wolfgang |date=2010-07-27 |issn=1652-926X }}</ref> The ISP's solution to the high bandwidth is [[P2P caching]], where an ISP stores the part of files most accessed by P2P clients in order to save access to the Internet.\n\n==Current research==\nResearchers have used computer simulations to aid in understanding and evaluating the complex behaviors of individuals within the network. \"Networking research often relies on simulation in order to test and evaluate new ideas. An important requirement of this process is that results must be reproducible so that other researchers can replicate, validate, and extend existing work.\" <ref name=\"Basu, A. 2013\">Basu, A., Fleming, S., Stanier, J., Naicken, S., Wakeman, I., & Gurbani, V. K. (2013). The state of peer-to-peer network simulators. ACM Computing Surveys, 45(4), 46.</ref> If the research cannot be reproduced, then the opportunity for further research is hindered. \"Even though new simulators continue to be released, the research community tends towards only a handful of open-source simulators. The demand for features in simulators, as shown by our criteria and survey, is high. Therefore, the community should work together to get these features in open-source software. This would reduce the need for custom simulators, and hence increase repeatability and reputability of experiments.\" <ref name=\"Basu, A. 2013\"/>\n\nBesides all the above stated facts, there have been work done on ns-2 open source network simulator. One research issue related to free rider detection and punishment has been explored using ns-2 simulator here.<ref>A Bhakuni, P Sharma, R Kaushal [http://ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=6779311&tag=1 \"Free-rider detection and punishment in BitTorrent based P2P networks\"], International Advanced Computing Conference, 2014. {{DOI|10.1109/IAdCC.2014.6779311}}</ref>\n\n==See also==\n{{Portal|Internet}}\n{{columns-list|colwidth=30em|\n* [[Client–queue–client]]\n* [[Cultural-Historical Activity Theory (CHAT)]]\n* [[End-to-end principle]]\n* [[Distributed Data Management Architecture]]\n* [[List of P2P protocols]]\n* [[Friend-to-friend]]\n* [[Segmented downloading]]\n* [[Semantic P2P networks]]\n* [[Sharing economy]]\n* [[Wireless ad hoc network]]\n* [[USB dead drop]]\n}}\n\n==References==\n{{Reflist|30em}}\n\n==External links==\n{{Commons category|Peer-to-peer}}\n{{refbegin|2}}\n* Ghosh Debjani, Rajan Payas, Pandey Mayank [https://link.springer.com/chapter/10.1007%2F978-3-319-07350-7_19 P2P-VoD Streaming: Design Issues & User Experience Challenges] Springer Proceedings, June 2014\n* [https://web.archive.org/web/20090922214835/http://www.p2pna.com/glossary.html Glossary] of P2P terminology\n* [https://web.archive.org/web/20090217141525/http://www.sciencedirect.com/science/issue/5624-2008-999689997-678759 Foundation of Peer-to-Peer Computing], Special Issue, Elsevier Journal of Computer Communication, (Ed) Javed I. Khan and Adam Wierzbicki, Volume 31, Issue 2, February 2008\n* {{cite journal | last1 = Anderson | first1 = Ross J. | year = | title = The eternity service | url = http://www.cl.cam.ac.uk/users/rja14/eternity/eternity.html| journal = Pragocrypt | volume = 1996 | issue = | page = }}\n* Marling Engle & J. I. Khan. [http://www.medianet.kent.edu/techreports/TR2006-11-01-p2pvuln-EK.pdf Vulnerabilities of P2P systems and a critical look at their solutions], May 2006\n* Stephanos Androutsellis-Theotokis and Diomidis Spinellis. [http://www.spinellis.gr/pubs/jrnl/2004-ACMCS-p2p/html/AS04.html A survey of peer-to-peer content distribution technologies]. ACM Computing Surveys, 36(4):335–371, December 2004.\n* Biddle, Peter, Paul England, Marcus Peinado, and Bryan Willman, [http://crypto.stanford.edu/DRM2002/darknet5.doc The Darknet and the Future of Content Distribution]. In ''2002 ACM Workshop on Digital Rights Management'', November 2002.\n* John F. Buford, Heather Yu, Eng Keong Lua [https://web.archive.org/web/20090211135759/http://p2pna.com/ P2P Networking and Applications]. {{ISBN|0123742145}}, Morgan Kaufmann, December 2008\n* Djamal-Eddine Meddour, Mubashar Mushtaq, and Toufik Ahmed, \"[http://multicomm.polito.it/proc_multicomm06_8.pdf Open Issues in P2P Multimedia Streaming]\", in the proceedings of the 1st Multimedia Communications Workshop MULTICOMM 2006 held in conjunction with IEEE ICC 2006 pp 43–48, June 2006, Istanbul, Turkey.\n* Detlef Schoder and Kai Fischbach, \"[http://www.econbiz.de/archiv1/2008/42151_concepts_peer-to-peer_networking.pdf Core Concepts in Peer-to-Peer (P2P) Networking]\". In: Subramanian, R.; Goodman, B. (eds.): ''P2P Computing: The Evolution of a Disruptive Technology'', Idea Group Inc, Hershey. 2005\n* Ramesh Subramanian and Brian Goodman (eds), ''[https://web.archive.org/web/20070928224509/http://www.igi-pub.com/books/details.asp?ID=4635 Peer-to-Peer Computing: Evolution of a Disruptive Technology]'', {{ISBN|1-59140-429-0}}, Idea Group Inc., Hershey, PA, United States, 2005.\n* [[Shuman Ghosemajumder]]. [http://dspace.mit.edu/handle/1721.1/8438 Advanced Peer-Based Technology Business Models]''. [[MIT Sloan School of Management]], 2002.\n* Silverthorne, Sean. ''[http://hbswk.hbs.edu/item.jhtml?id=4206&t=innovation Music Downloads: Pirates- or Customers?]''. [[Harvard Business School|Harvard Business School Working Knowledge]], 2004.\n* [https://broadband.mpi-sws.org/transparency/bttest.php Glasnost] test P2P [[traffic shaping]] ([[Max Planck Institute for Software Systems]])\n{{refend}}\n\n{{Bitcoin}}\n{{Tor hidden services}}\n{{Cryptographic software}}\n{{File sharing}}\n\n{{DEFAULTSORT:Peer-To-Peer}}\n[[Category:Peer-to-peer computing| ]]\n[[Category:File sharing networks]]\n[[Category:File sharing]]",
            "slug": "peer-to-peer",
            "date_updated": 1565240938800,
            "imported": "https://en.wikipedia.org/wiki/Peer-to-peer"
        }
    ]
}