{
	"title": "Witner Shore\n冬岸",
	"description": "我知道，冬天是最好的\n纯色的树木纤细，硬朗，不再多说\n人们变得聪明\n晴和，警觉，像一块玉\n深深的刻痕\n慢下来的眼睛\n\n当消消停停的雪\n落到我脸上时\n一个小声音尖叫起来\n在我心中，一只一只\n脱缰的蝴蝶\n\n此时微光粼粼，深冻的土地\n握铲子的人不久就会前来\n每次翻转\n都降落在\n一颗不再多说\n厚重的心\n\n2008\n——《冬》，包慧怡",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1499177213,
	"post": [
		{
			"post_id": 2,
			"title": "年轮",
			"date_published": 1498917944.175,
			"body": "_<font color=\"gray\"><font size=\"5\">#</font></font>写于2017.2.28_\n\n<font size=\"5\"><font>大年初三那天，我和爸妈去爬山。人很多，我们开到山脚，兜转一圈又折返，在旁边一个停车场里找到空位。和春节里的任何活动一样，爬山没有真正的必要，但为了营造出一种节日特有的气氛，即便是在拥挤的人群里，也要甘之如饴。然后拍照，发朋友圈定位，祝所有人安康。</font></font> <font size=\"5\"><font>爸爸走在最前，妈妈时而走在我后面，时而当我停下脚步拍照时，她又走到前面。不知什么时候起，沉默成为我们家的基本属性。我们从不走在一排，而是像严肃的军队队列，前中后，各走各的。</font></font>\n\n* * *\n\n<font size=\"5\"><font>走了一个多小时，爬到近山顶处的平地，许多人坐在草地上休息。一块很大的黄色宣传牌出现在眼前，是一个画展，达利和毕加索的真迹。我没有说想看，也不确定自己是否想看。你去看吧，我们在门口等你，爸爸说着，递给我一张红色纸钞。</font></font>\n\n<font size=\"5\"><font>美术馆有两个展厅，一号展厅是达利的作品。我对达利的所有印象，只有他那副流动的时钟，以及他本人那对上扬的小胡子。展厅空间一分为三，刚好展出了他的三个时期的作品。我仔细地看，好像能从那些流畅的线条和跳跃的颜色里看到一些什么。看完一半时，美术馆里的寒气让我发冷，于是匆匆浏览完剩余的，离开那些空无的白色空间，回到外面世界。</font></font>\n\n<font size=\"5\"><font>美术馆门口停着几张电瓶车，可以直接开到最高点的龙门处。妈妈认为既然是爬山，就不应该坐车，于是我们继续徒步往上走，终于接近龙门。</font></font>\n\n<font size=\"5\"><font>龙门前有一段狭窄的路，身穿黑色制服的保安站在门前，旁边一个中年男人在大声指挥秩序，不要挤，一家人一家人的走。来，让小姑娘先走，你们跟后。快轮到我们时，男人目光转向站在我们前面的一位老人，你家人在哪里。老人摆摆手。男人轻“哦”了一声，一个人来的啊，那您过去吧。</font></font> <font size=\"5\"><font>老人缓慢抬脚，跨过门槛。</font></font>\n\n<font size=\"5\"><font>他穿着一双有些黑色污渍的阿迪达斯网面运动鞋，深色运动裤，草绿色防风衣的衣领边沿磨损成两层，斜跨着一个不太干净的鼓囊囊的电脑包似的黑灰色包。他左手扶着木质栏杆，中指和无名指上带着两个和衣服打扮截然不符的镶玉金戒指。</font></font>\n\n<font size=\"5\"><font>我暗自揣度，也许这是他的儿女们送的。他们在外地工作，太忙，过年没办法回家，老人于是决定一个人在春节里爬山。好像登到山顶，他才算真正开启新的一年，美好的愿景将如山脚的万顷碧水展开。</font></font><font size=\"5\"><font>然而我是一向在许愿时脑袋空白的人。在高大庄严的佛像面前思虑半分钟，最后磕头时心里想到的，也不过是日日年年重复不变的，希望家里人身体健康。</font></font>\n\n<font size=\"5\"><font>去年年初，爸爸做了阑尾手术，虽然是小手术，没什么大不了的，但那段时间爸爸因为工作上的事以及我休学的事，操心了很多，整体的健康情况大概下坡得更快了些。年中我放假回去以后，又和爸爸争吵过几次，但说是争吵，其实更多是在无论如何都无法打破我沉默的壁垒的漫长过程之后，爸爸不得不采取激烈的沟通方式——提高音量，以一种拥有权力的高位迫令式语气开口。尽管事实上，爸爸不可能再控制什么，我们站在剧烈碰撞的板块之间。</font></font>\n\n<font size=\"5\"><font>十月中旬的某一天，我和爸爸因为一件微不足道的小事在饭桌上再次闹矛盾。然而之后没几天，却发生了一种难以置信的转变。爸爸变得温和，过往的暴躁脾气突然之间消散，像是经历了某种释然，终于放弃试图做改变的努力。而当有时候我忍不住再次发脾气，说话口气很差劲时，爸爸竟也默默承受住了这些莫名的情绪，偶尔会委屈似地为自己辩解一两句。</font></font>\n\n<font size=\"5\"><font>我想起那会儿高考完选专业，一开始听到我想读建筑，爸爸虽然没有坚决地反对，却也明确地说出了不同意，觉得女孩子读这个太累。当时下午，我们在街上闲逛，听完爸爸的话，我以惯常的沉默相对。爸爸没再说什么。快到六点，街道两旁的饭馆开始热闹起来，我们在夏日余晖里继续闲散地走路。后来第二天还是第三天，爸爸突然对我说，你要是真喜欢的话就选吧。</font></font>\n\n<font size=\"5\"><font>在爸爸身上发生的这种转瞬之间的接纳和理解，总是令我无限讶异，无限愧疚。他是如何做到的，我不得而知，能确定的是，为了放下长期以来因环境及各种复杂因素而不得不作成的高姿态，他大概，一定，付出了与之同等密度的努力，甚至更多，更多。</font></font>\n\n<font size=\"5\"><font>上个星期我回到学校，收拾完东西出门吃晚饭。吃的是麻辣烫，加了豆芽、娃娃菜、番茄、豆腐，最后在小盆里放进一个完整的红壳鸡蛋。端上来的时候鸡蛋一整个地泡在汤里，筷子夹起，一口咬破蛋白，汤水混合蛋黄一起进入嘴中。</font></font>\n\n<font size=\"5\"><font>很熟悉的感觉，我愣了一下，想起是以前初中时候，每天早上爸爸六点起床，打开收音机，一边听着晨间新闻，一边给我做早餐煮面。没什么特殊的做法，两饼超市里买的袋装圆团面、一根火腿肠、一个鸡蛋、一些时蔬，加上几滴芝麻油。</font></font>\n\n<font size=\"5\"><font>面快做好时，爸爸敲门，叫我起床。记忆里几乎是这样一成不变地吃了四年，也就是说，</font></font> <font size=\"5\"><font>六点起床，打开收音机。在锅里加水，下面，把作料一一加入。叫我起床，等我吃完，开车送我去学校。然后调头，去上班工作。</font></font> <font size=\"5\"><font>他也一成不变地保持了这个作息四年。</font></font>"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}