{
	"next_topic_id": 60,
	"topic": [
		{
			"topic_id": 1584777006,
			"title": "UP主是什么意思？",
			"body": "向上、正能量",
			"added": 1584777005,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584791259,
			"title": "没有人分享就没有资源",
			"body": "",
			"added": 1584791255,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584796537,
			"title": "虚拟机生态",
			"body": "有的软件是某种操作系统特有的，可以使用虚拟机运行这个软件",
			"added": 1584796532,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584850144,
			"title": "有一个医生女朋友会导致什么后果？",
			"body": "",
			"added": 1584850138,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584937086,
			"title": "道德经直译",
			"body": "http://127.0.0.1:43110/1ES5nNwjhHnWxbCDXcun2jKu8RQgBniyYF/",
			"added": 1584937079,
			"parent_topic_uri": "1517730511_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584939138,
			"title": "Kindle Ebook",
			"body": "http://127.0.0.1:43110/1KHCBG6dmbKXTZNenfwhWZ5x3oDyYyHSD4/",
			"added": 1584939130,
			"parent_topic_uri": "1517730511_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584941550,
			"title": "知乎崩了，网友表示，可以众筹升级一下服务器",
			"body": "3月23日电\n\n\n\n23日午间，多名网友反映“无法打开知乎网页”、“知乎APP内加载失败”，对此知乎官方回应称，“要不，大家先去吃个饭？”，证实网友反映问题。知乎APP显示加载失败\n\n截至发稿，话题#知乎崩了#已进入微博热搜榜第23名。据悉，这并不是知乎近期第一次出现崩溃。在知乎官方微博下，有网友表示，“你最近咋崩的这么勤快 ”“崩乎”“你上次崩了我退出了，今天打开又是崩着。我还以为一直崩到现在”。\n\n有网友表示，“为什么又崩了，要是没钱升级服务器，可以众筹的，我出一块！”",
			"added": 1584941617,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584941742,
			"title": "B站和知乎谁会成为社交媒体的新网红？",
			"body": "就在前两天，B站刚刚发布了最新一季的财报，月活用户达到了1.3亿，其中移动端用户为1.16亿，分别同比增长了40%和46%；日活用户达到3790万，同比增长41%，日均用户使用时长则达到77分钟。\n\n如此增长下的数据令人想到不久前一个有意思的讨论：两微一抖后，谁会成为社交媒体新的另一极？备选项之中就有B站。事实上，在社交媒体领域，增长良好的备选者并不止B站，还有知乎。\n\n知乎的用户数据在2019年就停止对外披露了，目前停留在2.2亿(Questmobile去年9月的数据现显示月活是4865万)，虽然离第一阵营的日活三四亿还有段距离，但这个量级的用户，的确是时候可以猜一波接下来的走向了。\n\n社交媒体的含义可以拆成两部分来理解：用户之间分享意见和经验，形成社交链条；并基于这种传播信息的能力，成为新的媒体。\n\n从媒体能力来说，上面这两家都很强。\n\n以最近的疫情为例，知乎很早就创建出了疫情的专题页面，实时更新国内外确诊，国内治愈、死亡病例的数量，目前热榜第一是全球新冠肺炎的情况，热度高点时超过11132万。B站也在2月28日发布了《宅家抗疫大数据报告》，数据显示，1月18至2月18日之间，B站用户观看疫情相关视频19亿次，UP主创作相关视频总时长61218小时，疫情科普类视频获得3.6亿次播放。\n\n但剥离掉媒体能力，从社交本身来说，个人更看好知乎的未来量级：因为知乎的社区状态更原子化、分散化，符合我们当下的社交习惯。在这种背景下，它创造了“原子们”之间的更多链接。\n\n这是因为知乎内信息的流动相对是同海拔的，且限制不大。知乎盐值的高低虽然限制了一些福利和别的(比如发图和用户权重)，但普通用户还是可以无障碍地使用基本功能。这种低限制一是取决于问答社区本身的形态，只有任何人都可以浏览、提问或者回答才能创作出源源不断的UGC；二是知乎主动降低了自己的门槛，例如最开始只有某些知乎用户可以创作专栏，但现在只要达到一定条件就可以申请创作者中心。但凡知乎的老用户应该都知道黄继新上《非诚勿扰》相亲事件，从这个节点开始，知乎的站内流量开始有了迅猛增长。\n\n在“知乎创作者中心的门槛是否过低？”问题下，甚至有常年潜水，回答问题没有超过5个的用户表示自己也收到了开通邀请。\n\n再说上面的知乎盐值，这是知乎在2018年6月推出的功能，从基础信用、内容创作、友善互动、遵守公约、社区建设给用户建立一套评分机制，分值在0-1000之间浮动，官方说法是“高盐值能够忠实地体现社区对于专业友善可信赖知友的认可。”但放到今天来看，其实这就是典型的增强用户活跃度的玩法。\n\n不仅如此，知乎还在“海盐计划”二期里引入了众裁制度，针对一些争议性内容，知乎将引入用户参与其中，判断对错。成为众裁官的关键门槛是盐值高于500，且最近30天无违规行为。在知乎，编辑问题的盐值要求是620，加权反对的要求是650，所以500算得上是非常低门槛了。而且知乎明显对积极参与的用户有盐值奖励，一位初始盐值500+的用户在参与众裁一周后迅速提升到接近700。\n\n相较之下，B站作为一个社区，更像是类“KOC”式的(圈层让它的生态比KOL会更分散一点)，也就是说站内每个用户在实际拥有话语权的大小上并不一样。因为B站是一个依赖PUGV的平台，这就决定了有优质内容生产能力的UP主会比一般人拥有更大的影响力，头部效应突出。\n\n以B站知名UP主翔翔大作战为例，他是一个分享美食和生活的UP主，在今年2月12日，他发布了一则自己喜提二胎的投稿，同样获得380万播放量和超过68万点赞。从留言和转发的数量来看，这则投稿比他的“正经”投稿数据还要好。这自然是注意力资源的某种集中。\n\n头部效应的另一个体现是想进入顶级流量池更困难。以B站的新星计划为例，虽然这个标准对于内容生产者来说已经放低了身段，但是对于普通用户来说，拥有超过一万粉丝也依然是个门槛。最终入选这个计划的100名UP主来自一个超过65000名用户的大池子，可见筛选程度之高。B站这两年推进的百大UP活动也足以证明一点——对于一个PUGV社区来说，社交“平等”可能不是最重要的。\n\n红沙发创始人金叶宸在他的文章里揭示了可能形成上述景象的成因：社交货币和社交资产并不总是分配公平。这两个概念起源于社会学，母概念可以称之为社会资本(social capital)，有学者指出它可以分为连接型和粘合型，前代表着人际关系的弱连接，后者则代表着强连接。而Facebook这一类社交媒体就有助于保持连接型社会资本的形成。就像现实社会一样，在网络社区，这种资产分布当然也不绝对公平。\n\n在知乎上社交货币可以是专业知识，也可以是常识，但在B站，社交货币一定要是制作视频的能力，并且仅仅是起点。这导致了每个用户在B站拥有的初始社交货币一定程度上会低于知乎，因为制作视频的难度一定高于分享某些“常识”。\n\n另外，原始社交货币也导致了用户后续获得社交资产容易多寡不均：同样的激励制度下，你会发现有视频制作能力的人总是更容易脱颖而出。\n\n但社交媒体除了链接之外另一个关键点是创造意义，显然B站的意义感会更特殊一些。它是脱胎自ACGN的社区，因此整体上它的用户仍然是有某些公约数的：比如泛二次元、年轻、包容度高、消解式吐槽。这是因为B站承载了很大一部分Z世代的共同记忆：无论今天的B站走向何方，它的基本盘日式动漫番剧是不可能改的，因为这是它的底层文化基因。正如豆瓣的meme是文艺青年的精神角落、虎扑是直男天堂。\n\n这些公约数既是B站的护城河，也是B站对于中文互联网独特之意义所在。在纸媒衰亡的今天，提炼出年度关键词的不再是杂志，而变成了B站。B站2019年的年度弹幕是AWSL(啊我死了，意指被某些可爱的事物戳中)，在全年的14亿条弹幕里，它共计出现320万次。除B站之外，还从未有哪个中文站点能够给我们提供研究当下流行文化这么清晰可见的窗口。\n\n并且，随着B站和共青团、央媒等走近，它的价值观开始日趋主流。截至今年1月，根据B站用户不完全统计，仅各地共青团在B站开通账号的就有10个，与央视相关的账户达到14个，各地大学相关账户超过1000个。去年中科院还和B站合作，在线上开通三次元办事处，真正将严肃与B站的年轻力量结合在一起。知乎过去标榜的是中产社区，在可能被稀释的中产和主流之间，谁会更占优势？\n\n另外，虽然上面提到知乎为了提高用户的参与度，大幅度地降低了门槛，但这也让它丧失掉了一部分意义感。早些时候，知乎大V的地位是非常高的，他们和普通用户之间的海拔差距大，生态甚至可以归类于“膜拜”，这也是金叶宸提到的社区内阶层流动性小，社区基尼系数高(话语权越不平均，基尼系数越高)。但知乎为了吸纳更多用户，这几年一直在主动降低这种社区的基尼系数，比如知乎热榜的出现，以及这个榜单上常年有不消失的情感类话题。\n\n好处是显然的，有大批的常识类用户在这个阶层流动中成为了新的大V，增加了社区的活跃；但坏处也显而易见，社区的问答质量被不少老用户说降低。本来知乎的属性就没有搭载任何文化类型，大量用户涌入之后更难以描绘出一个典型用户画像。\n\nB站有一部分人常常说陈睿为了赚钱在洗用户，但其实知乎老用户的怨言更多。陈睿在公开发言里还是说B站的导向是为用户服务，增加内容是因为年轻用户需要，周源的口径则是知乎并没有“以赚钱为耻”的文化，这两个创始人的发言风格可以揣摩出一些微妙的不同。\n\n除了链接和意义之争，这种第四极的竞争还是动态的，因为社交媒体的定义出现在Web2.0时代，而现在早已经发展到了新的阶段。在这个阶段，表达自己意见的方式已经开始渐渐从图文演变成了视频。对普通人来说，用视频表达自己的意见还是有难度，所以知乎可能更符合我们第四极的想象，因为人总是倾向于选择熟悉的事物。\n\n但如果在未来，制作视频的难度再降低，比如出现了比剪映这种更简易的全平台工具，也许B站就更有可能变成那个新一极。因为B站的业务一开始就站在未来。知乎当然也想参与未来，从三年前开始它就增加了“视频”专区，但因为和其他短视频同质性较强，这项业务作用并不明显。去年4月，知乎旗下即影项目也宣布解散，虽然官方的说辞是这是个内测项目，但不管怎么说，在讲究三维想象的Web 3.0时代，显然知乎目前还欠缺一点点。\n\n知乎“即影”\n\n当然，另一种声音是无论是B站还是知乎，离成为头部社交媒体的距离都还太远，因为它们的优缺点都同样突出，还没能让人看到一骑绝尘的可能性。也许就在我们探讨的过程中，又会突然出现另一个从未想到的第四极，就像抖音突然的野蛮生长一样。到那时，我们想知道的所有讯息都会藏身于这个媒介之中。毕竟，互联网的国界里，什么都有可能发生。\n\n参考资料：\n\n1、关于社交媒体和社区创作生态“头部化”的一些探讨，金叶宸，圆首金老汉\n\n2、社交媒体的使用效果_社会资本的视角，赵曙光，《网络传播研究》",
			"added": 1584941732,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584941798,
			"title": "从B站审核变慢现象，聊聊内容社区产品的内容风控要点",
			"body": "B站是中国年轻世代高度聚集的文化社区和视频平台，近年来更是财报喜人。不过它最近却受到UP主对审核速度以及审核机制的吐槽。这背后有什么深层原因呢？本文从产品和商业角度对此追根溯源，同时也试着分析一下内容社区产品在内容风控策略上的一些要点。\n\n3月18日，B站公布了截至2019年12月31日的第四季度和全年未经审计的财务报告。2019财年总营收达67.8亿元人民币，同比增长64%，其中第四季度营收同比增长74%，达20.1亿元人民币，连续七个季度超市场预期。\n\nUP主们一方面欣喜于“小破站”规模越来越大，另一方面也越来越对B站孱弱的变现能力、混乱的MCN生态和越来越长的稿件审核时间、越来越严苛的内容审核标准表示不满，尤其进入3月以来，B站UP主投递一篇稿件，审核时间少则五六小时，多则竟然超过24小时，很多稿件错过了最佳的发布时间。\n\n我前不久投递的一个稿件，审核了超过20小时，作为一名产品经理，我认为有必要从产品和商业角度，找一找B站审核变慢的原因，同时也可以试着分析一下内容社区产品在内容风控策略上的一些要点。\n\n一、B站审核为什么这么慢？\n\n一个内容社区的用户角色，大致可分为内容生产者（创作型用户）和内容消费者（浏览型用户），既有内容的生产创作，又有观众能够消化掉创作产能，形成良好的社区内容生态。\n\n对于B站来说，UP主们为爱发电是B站快速增长的重要基础，也是B站拿下国内最大视频UGC社区地位的重要基石。如何服务好这一波内容生产者，是B站一个很关键的命题。\n\nB站的社区氛围和观众品味，都导致了社区用户对于作品的要求极为苛刻，UP主们费尽心机，要讨好“观众老爷”，那UP主受的委屈，当然要在小破站上找回来，平台要是伺候不好UP主，那UP主就要炸毛了。\n\n因此，3月以来，审核时间大幅变长，引发了UP主大面积的抱怨，很多追热点的稿件，等审核发布出来，热点都过去了。近日B站审核为什么这么慢？其实正如近几日美股屡次熔断一样，B站审核变慢也是多重原因共同作用的结果。\n\n1. 稿件量激增，创作者作品成倍增长\n\n从2019年开始，B站“破圈”的迹象就越来越明显，如今，B站已经从一个小众的亚文化社区，变成多元的大众化平台，随便一个用户，都能明显地感受到，来B站做UP主的人变多了。\n\n数据也支撑了这一点。根据B站2019年第四季度财报，B 站月均活跃UP主数量突破100万，同比增长80%；其月均投稿量同比增长66％达280万。与数量增长相辅相成的，还有稿件类型的多样化，例如在这段时间入驻并快速大火的“巫师财经”“半佛仙人”、入驻但没火的“宇宙维修队亨哼”等UP主，都在印证着B站内容创作在各个领域的破圈。\n\n在进入2020年以来，受疫情隔离影响，B站用户数再次大规模激增，同时受到实体经济不景气影响，开始兼职UP主的专业人士也相应增多。我根据av号（B站视频唯一编码）做了一个保守的大致估算，2018年12月，B站日审核视频量大约为6万个，而今年3月，达到了13万个。\n\n如此快的稿件增长，B站的审核系统很难快速响应扩容，原有的审核资源再继续啃翻倍的工作量，自然压力很大。\n\n同时还有一点，大量作品新增，原有的服务器资源也压力倍增，视频转码和压制时间也相应变长，这可以从视频投稿后的转码时间看出。\n\n2. 受疫情影响，B站审核力量难以全量支持\n\n疫情隔离对于用户来说，是空闲在家有时间创作更多的视频，但对于平台来说，意味着大量员工难以正常返岗。\n\n2018年7月，B站在国家多部门约谈并要求后整改后，投入运营了位于武汉的新审核中心，扩增一倍以上审核人力。\n\n之后，B站大量的稿件审核都由武汉审核中心完成审核，此次受疫情影响，其他城市陆续返工，但武汉恢复正常工作秩序尚需时日。\n\n上海总部的审核力量本身不足，而且内容审核这个工作的离职率相当高，年前离职的空缺，年后因为疫情，一时也不能快速补充新的人进来。\n\n一面是入水口变粗，一面是出水口变窄，自然泡在审核池子里的稿件就越积越多。\n\n3. 新规定带来新的审核标准\n\n去年12月，国家网信办针对互联网内容乱象，出台了《网络信息内容生态治理规定》，明确了网络信息内容服务平台的责任，从2020年3月起正式开始实行。\n\n在刚刚开始正式施行的这一关头，谁都不敢松懈，B站也相应地调整了审核尺度的把关，同时，由于新规定需要更多的培训向基层审核人员普及，也需要时间适应。\n\n4.B站的内容风控审核机制\n\n相较于其他平台，B站的审核属于比较慢的那一种。这当然是由于国情使然，不过也反映出了平台审核机制的效率问题。如何利用机器审核和人工相配合，如何权衡效率和成本，是B站亟需想明白的问题。\n\n插一句，不存在思考“效率和标准松紧”的问题，内容风控不容半点马虎，必须以最严苛标准为准绳，一条违规信息，都可能导致整个平台万劫不复。\n\n二、内容风控策略的核心要点是什么？\n\n对于一款产品来说，其基本业务框架的抽象模型可以总结为“业务”、辅助业务的“增长”、保障业务的“风控”和支撑以上三点的“数据”。\n\n“业务”自然是产品最关键的地方，“增长”“风控”和“数据”都是辅助业务良态运行。对B站的内容业务来说，协调内容生产者和内容消费者，形成良好的内容生态是关键的核心，辅以用户增长（包括用户增长和创作者增长两个方面），并且对社区进行风控。\n\n通过业务的发展和增长、风控的积累，形成用户基础数据、注册信息、浏览行为、视觉偏好、用户标签等数据，然后通过这些数据，再反向支撑业务发展，形成产品内的数据打通。\n\n本文所要着重分析的，就是风控这一环节。 金融产品、信贷产品有风控非常好理解，但其实，所有类型的产品都需要有风控。电商产品要防薅羊毛，社交产品要防欺诈，而内容产品，则是要对平台内容的质量和合规性进行风险控制。\n\n对于内容社区等UGC产品来说，风控线就是生死线。内容和社区产品的风控压力来源于监管侧，风控对象是用户在平台发布的内容。\n\n1. 内容风控要“控”什么？\n\n来自内容侧的风险主要有三类。\n\n政策层面的内容合规，要符合监管的要求。\n\n监管要求的内容可参考最新实行的《网络信息内容生态治理规定》，对于各项违规内容都做了详细规定，大致概括可分为涉政、违禁、暴恐、色情等四类，这部分是政策红线，一旦触及，轻则约谈，重则下架、封禁。\n\n社区氛围的良性导向，如谩骂、隐私等。\n\n这一类型的内容虽然不会触及监管红线，但倘若内容社区充斥各种负能量，对于社区氛围是非常严重的损害，伤及用户体验，导致用户流失，影响产品商业利益。\n\n这一类型内容风控还包括对于产品运营主体的保护，例如对吐槽公司工作人员的内容进行限流处理、对平台和产品的诅咒进行删除等，属于商誉和公关层面的维护，同时也是对产品官方公信力的维护。\n\n社区用户安全的保证。\n\n对于内容和社区产品而言，平台内一定会存在导流、灰产、诈骗等不法手段，如何保护平台内用户的财产安全和产品体验，是非常关键的，互联网发展至今，导流、诈骗等行为往往是成熟的灰黑产产业链所为，他们拥有丰富的反监查和防过滤经验，揪出他们并进行处理，需要平台与其斗智斗勇。\n\n2. 内容风控的方法和手段\n\n在最早期的阶段，对内容进行风险控制，只能通过编辑人工进行审核。这种方式需要大量的人力物力，而且稿件审核需要时间长，时效性也被大大削弱。一般的公司，很难负担起庞大的内容审核团队。\n\n之后，诞生了关键词过滤等手段，成为成本较低，并且使用最为广泛的内容风控措施。对于命中预设的违禁关键词的内容，直接阻止发出或者转交人工审核。这种方式性价比极高，耗费成本小，但基本可以过滤掉大多数的违规内容。\n\n关键词过滤存在的问题也很明显，准确率较低，经常出现误伤和漏网的情况，对于内容和社区平台来说，这是不能容忍的，前文已经讲过，哪怕一篇违规内容被放出来，产品都有可能被封禁。\n\n再加上网络的普及，越来越多的人学会了通过拼音、乱码、谐音等方式绕开关键词，关键词过滤逐渐不再能胜任内容风控的工作任务。\n\n以上基本还属于规则的范畴，之后内容风控的发展，就进入了AI+策略的时代。\n\nAI方面，其实叫机器学习更加准确，这是一套组合拳。举个例子，对于一个视频稿件的审核，就需要对整个视频进行逐一拆帧，然后通过OCR文字识别检查字幕，此时对于字幕的检查和文字内容的检查基本一致，文字识别涉及到NLP分词、语义理解等AI技术；\n\n对于画面，则是图片识别，识别图片中可能出现的违禁内容，这里涉及到一个准确率的问题，暴恐视频不能够通过，但游戏视频也存在战斗画面，如何保证不误伤；对于音频，则需要两个方面的审查，一方面是视频当中的语句，将语音转文本，再通过文字的审核策略来审核，另一方面是音调识别，例如识别音频当中的娇喘等无语句的声音。\n\n机器学习还是就稿件论稿件，而一个优秀的内容风控平台，是需要配合策略的。策略产品经理是近几年一个特别火的岗位，提供更精细化的、动态的、效率的产品解决方案。对于策略来说，内容的风控不能只在单个内容上，还需要结合更高的维度，给与更加精细化的识别判断。\n\n策略要从单个内容出发，延伸到发布该内容的用户基础信息、关系链、过往内容、实名可信度等等诸多维度进行调参和计算，以判断这名用户的这条内容是否需要更细致的识别。\n\n这里要特别强调一点，即使平台的机器算法再先进，所有的内容还都需要过人审核。所有内容过人，所有内容过人，所有内容过人，重要的事情说三遍，至于原因，还是上面那一条，内容和社区平台不容有半点闪失。\n\n不过机器平台越先进，能够为人工审核提供的辅助也就越全面准确，人工审核的效率自然也就变高，审核人员的压力也相应减弱。\n\n另外，对于内容风控，又会有前置风控（先审后发）和后置风控（先发后审）等不同的方式，关于这一点，以后有机会再详细分析优劣和适用场景。\n\n对于B站来说，随着内容量越来越大，单纯的对审核人工进行扩容，恐难以解决问题。相比抖音、今日头条、西瓜视频等头条系产品、背靠百度AI的爱奇艺、腾讯视频、阿里大文娱旗下的优酷视频，B站崛起晚、资源少、技术储备弱，在机器辅助审核上还比较弱势，今后加强内容风控技术，优化内容审核策略，改善审核后台的体验，不失为一个好方法，毕竟工欲善其事，必先利其器。",
			"added": 1584941787,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584942193,
			"title": "哔哩哔哩(bilibili),请问为何要答题才能转正?",
			"body": "",
			"added": 1584942180,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584942874,
			"title": "为什么知乎必须登录才可以浏览全部答案?",
			"body": "",
			"added": 1584942860,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584943014,
			"title": "码云 为什么现在 不登录 都没法查看 项目了？",
			"body": "",
			"added": 1584942999,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584943077,
			"title": "在贴吧里必须登录才可以查看帖子的完整内容的原因是什么?",
			"body": "",
			"added": 1584943061,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584943116,
			"title": "发的贴子为什么只有自己登陆才能看到,别人都看不见？",
			"body": "",
			"added": 1584943098,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584943135,
			"title": "为什么现在用浏览器进贴吧提示必须下APP才能看评论?!",
			"body": "",
			"added": 1584943116,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584943151,
			"title": "现在贴吧登录怎么总是让安全验证?",
			"body": "",
			"added": 1584943131,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584944335,
			"title": "如何评价 win 10 强占BIOS不让换系统的行为？",
			"body": "",
			"added": 1584944494,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584944370,
			"title": "如何评价后宫动漫吧？",
			"body": "",
			"added": 1584944348,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584944408,
			"title": "如何评价手机偷拍、偷听用户谈话的行为？",
			"body": "",
			"added": 1584944385,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584944490,
			"title": "有钱能买时间 研究发现有钱人寿命比穷人长10年",
			"body": "我们平时总把“有钱买不到健康”挂在嘴边，可随着全球普遍性的贫富差距放大，财富和健康，以及寿命的挂钩越来越明显。之前美国和加拿大已经公布的研究结果都显示，有钱人的平均寿命和健康状况都要优于穷人。当财富不均加重的同时，“寿命不均”也越来越明显。\n\n美国科学家研究认为，人的富裕程度会对其寿命长短产生影响，富人会比穷人多活大约10年。美国东田纳西州立大学的科学家收集了50个州的人口统计数据，通过比较人们的生活水平证实了这一结论。他们将全美3141个县划分为50个“州”，发现住在最富裕县的女性有83岁寿命，住在最贫穷县的女性平均短命6年，可活到76岁；男性差距更大，相差近9年半，平均活不到70岁。\n\n研究人员发在《美国医学会杂志》发表的研究报告中写道：“这个国家的贫困状态非常严重，令人深感不安。世界上一半以上的国家人口寿命，比美国最贫穷县的人要长。”研究根据美国人口调查局的数据，计算每个县的家庭入息中位数，最富有的“州”家庭入息中位数为89723美元。至于最贫困的“州”，一个四口之家的入息中位数是24960美元。研究者强调，丰厚的经济来源并不是生命长短的唯一因素，因此仅仅增加人们的收入并不能够延长他们的寿命。生命的长度与以下这些因素可能呈现正相关，例如富人和穷人之间不同的教育水平、生活的习惯。\n\n最近几年美国的贫富差距不断拉大。美国前5%富人的寿命在2001年至2014年之间增加大约3年，但是美国前5%穷人的寿命并没有延长。不仅收入，所居住的地区对寿命的影响也非常显著。如果他们居住的地方人们的习惯都比较健康，他们的寿命就会延长。他们的寿命长度与医疗寿命的质量高低关系并不是很大。另外，穷人寿命的长度与收入是否平等，失业率高低的关系也不大。位于收入底部25%的人群，预期寿命最长和最短地区之间的差异大约为4.5年。在比较富裕，居民受教育水平高，政府福利好的城市，例如纽约和旧金山，收入较低但是拥有健康生活习惯的美国人寿命是最长的。但是哪个地方的穷人寿命最短呢？对于男性来讲，印第安纳州Gary男性的寿命只有74.2，对于女性来讲，拉斯维加斯女性寿命只有80岁。\n\n不只在美国，同样存在巨大贫富差距的英国在寿命差别的问题上也很严重。据英国《电讯报》报道，今年英国国家统计局的数据显示，最贫穷的10%的男性平均预期寿命只有73.4岁，比最富有的10%的男性少活9.3岁，后者的预期寿命可达82.7岁。健康寿命方面差距更大，生活在英国贫困地区女性的预期健康寿命为52.4岁，而生活在该国富裕地区的女性则可以比这多活19年。男性的寿命差别为18年。\n\n无论你穷也罢富也罢，活着的每一天都快乐才是最重要的！（科幻星系 康斯坦丁/文）",
			"added": 1584944466,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584944773,
			"title": "有哪些互联网之外的通信方法？",
			"body": "说出来就不灵了",
			"added": 1584944747,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584945208,
			"title": "5G＋物联网时代将至，移动支付迎体系化升级",
			"body": "手机在手，支付我有。如今越来越多的消费者出门已经不喜欢带现金了，而是喜欢打开手机支付软件进行扫码支付。不得不说，移动支付已经在多个城市得到推广应用，成为展示城市形象的一张靓丽“名片”。\n\n2020年3月17日，中国人民银行发布的《2019年支付体系运行总体情况》和《2019年第四季度支付体系运行总体情况》显示，2019年全年及四季度，移动支付业务量保持快速增长，银行卡笔均消费金额却下降超过两成。其中，移动支付业务1014.31亿笔，金额347.11万亿元，同比分别增长67.57%和25.13%。\n\n从以上数据我们可以看出，2019年移动支付业务蓬勃发展。移动支付业务的增长，从一个侧面体现出其在实际应用中具有巨大的潜力。移动支付全民普及，持续拓展“两头”年龄层用户。在支付宝、苏宁支付、微信支付等行业领头平台的推广下，移动支付的普及程度继续提升，加速覆盖各类人群。\n\n此外，随着各种线上线下服务加快融合，移动互联网业务创新加速拓展，带动移动出行、移动支付、移动视频直播、餐饮外卖等等应用加快普及，刺激移动互联网接入流量消费保持高速增长。为了更好地满足移动用户优质、个性化的需求，各运营商正不断提高网络覆盖面积和覆盖效果，对网络优化覆盖业务保持持续、稳定的投资。\n\n2019年初，“交备付”、“强监管”、“断直连”等政策相继落地，行业灰色地带被逐一击破，非银支付进入了转型发展的新阶段，银行与支付机构的合作模式及话语权也发生了许多新变化。为进一步提升移动支付的用户体验，非银支付机构和科技企业之间的合作也变得更加深入和频繁。\n\n在5G、物联网技术快速发展的大环境下，移动支付产业也迎来了新一轮升级的契机。无感交互也成为移动支付行业向前推进的一大方向。总体来看，支付包括身份识别与资金转移。物联网、人工智能驱动结合的系统，将加速支付的数字化进程，交互或不再依托具体载体，而是通过ID-Mapping等弱信用验证技术将用户的强弱ID关联，更高效地完成用户识别和资金转移。换言之，从支付前端体验来看，用户在各场景的交互将从主动交互变为无感交互。\n\n5G的大容量、高速率和低延时性，为AR/VR、物联网、云计算、大数据等相关应用做了很好的铺垫，移动支付的发展也因此具有了更为广阔的想象空间。有业内人士指出，未来，基于复杂生物识别，包括人脸、语音、指纹、语音等在内的整体支付解决方案将进入人们的视野。\n\n尽管技术和标准上都已经准备充分，但这并不意味着移动支付的推广畅通无阻。其实，移动支付在推广过程中还面临许多问题。如何培养用户的使用习惯，保密性、安全性、操作便捷性等。其中，安全性问题尤其惹人注目。对于许多用户来说，使用移动支付比较担心的就是身份证、电话号码、家庭住址等各类隐私数据的安全性。\n\n毋庸置疑的是，未来移动支付行业的商业化路径将更趋多元化，包括交互模式、支付场景、支付效率、商业化探索将实现全面升级。平台、技术、法规等将成为移动支付能在多大程度上得到推广应用的关键因素。\n\n而要想使移动支付得到良性发展，必须解决好用户需求和行业平台之间的关系。通过支付积累的海量用户，将成为继社交平台后另一重要流量入口，成为综合型互联网平台提振业绩的生力军。在移动支付应用场景更广泛的情况下，对于消费行为的大数据挖掘价值将变得更加珍贵。而那些能抓住用户需求的企业，也有望在激烈的市场竞争中斩获机遇，再造辉煌。",
			"added": 1584945181,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584946343,
			"title": "如何评价不同手机淘宝价格不同的行为？",
			"body": "",
			"added": 1584946315,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584947046,
			"title": "如何评价中国移动不能取消手机流量套餐的行为？",
			"body": "",
			"added": 1584947017,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584947391,
			"title": "听歌也要vip了,还得几个平台都买,没意思",
			"body": "要是版权都在一个平台肯定不是问题\n呵呵，，，你看视频试试\n主流网站优酷腾讯爱奇艺我都是年会员，各家资源不同又有啥办法\n都在一个平台，一个月怕是要收你500块\n主要是要么开会员就一次性听全很多歌，都要各个软件来回切才能听到真是特麻烦\n关键就是资源很分散，跟视频网站一样，这事很难解决，都在一起就会垄断，不在一起就需要买很多会员",
			"added": 1584947361,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584947950,
			"title": "Switch模拟器“Yuzu”最新版本已开放免费下载！",
			"body": "目前最好的Switch模拟器“Yuzu”最近发布了全新的版本，增加了“Vulkan API”的支持，这个版本原为出资者独享的版本，现在已经向所有人免费开放。\n\n　　Yuzu的后台支持Vulkan是一项重大进步。因为Switch的GPU是基于Nvidia架构，所以如果用户的电脑搭载的是AMD GPU，那么模拟运行的表现会非常差。\n\n　　根据Yuzu官方这次公开的公告来看，Vulkan API一直都是OpenGL的竞品，Vulkan版的模拟器在多核处理器上的运行效果更好，代码编辑更符合直觉。这将让复杂3D游戏的模拟变得更加轻松。\n\n　　此前Yuzu模拟器的开发者一直都在攻克Vulkan API这一难关，现在他们终于迎来了现在的结果，目前已经有许多Switch游戏在更新后的模拟器上看到了优化，不仅图像bug变少，而且在非Nvidia GPU上看得到巨大帧数提升。\n\n　　感兴趣的玩家点击此下载Switch模拟器“Yuzu”最新版本，有条件的玩家可以选择支持开发组。",
			"added": 1584947919,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584948305,
			"title": "拒绝游戏本？选择GPD WIN 2的七个重要理由",
			"body": "有人说，打电脑游戏要么配台式主机，要么买游戏本，我是赞同的。然而凡事不可太绝对，游戏本再轻薄，也装不到手包里，做为一款随身娱乐工具，笔记本的沉重负担依然是个令人头疼的难题，有些人甚至因此放弃PC，全身心投入安卓系统的怀抱。可是，他同时也要放弃好多经典游戏，岂不可惜！\n\n存在即合理，相比累赘的笔记本，小巧便携的掌机产品成了那些追求“一身轻”的用户刚需，UMPC的新时代也重新开启。GPD WIN 2就是这样一款可以轻松携带的6英寸游戏掌机产品。那么，相比游戏本，它到底有哪些优势？\n\n1，轻量便携，毫不累赘：GPD WIN 2的体型比任天堂Switch NS更小，即使与智能手机如iPhone 6s相比也不甚庞大，简直是“减负一族”的标配小电脑。\n\n2，性能优秀，游戏流畅：intel酷睿M3+8GB内存+128GB SSD，处理器性能接近酷睿 i7-3770K，GTA5满血38帧、DOTA2满血70帧，守望先锋稳定50-70帧，FF12、战舰世界、英雄联盟、上古卷轴5在GPD WIN 2上也能达到53-70帧的流畅运行效果。\n\n3，续航强大，散热给力：两块4900mAh大锂电支持！相比于三星Q1、华硕R2H等同类产品，GPD WIN 2可以完成连续8小时办公，或者连续玩大型游戏4-6小时，续航能力大幅提升。PC级智能静音风扇散热好，能效比和散热效果更均衡。\n\n4，多种操控，两项全能：1280像素x720像素6英寸屏幕支持多点触控，全键盘和ALPS原厂双3D摇杆按键兼备，内置双震动马达，逼真游戏效果更沉浸。\n\n5，办公能力不俗：差旅随行带上GPD WIN 2不压身，搭配扩展坞实力大秀，配合充电宝实现更长的续航能力，必要之时紧急变身工作利器，移动商务真刚需！\n\n6，支持PD 2.0快充，可以从零电量45分钟充满50%，让那些耗电量巨大、充满更慢的游戏本相形见绌。Type-C、USB-A、MicroSD、MicroHDMI、3.5mm耳机接口齐备，网游单机模拟器游戏都可以轻松驾驭，办公娱乐两不误。\n\n7，升级支持：支持 M.2 2242规格SSD，固态硬盘带来拔群的读写速度，游戏载入时间也加快25%，并留有后续SSD硬盘扩展升级余地。总之，如果你是不喜累赘的游戏咖，GPD WIN 2将是你的便携游戏利器，而商务差旅人士的刚需，也会由它满足。\n\n当然，GPD WIN 2也有和其他mini掌机类似的弱点，例如，既然是迷你款，就要舍弃大屏的需求，既然要兼顾移动便携，PC键盘也要牺牲一定的舒适度，非全尺寸的键盘，用起来总不如传统尺寸笔记本舒服。总之，GPD WIN 2更偏向于差旅便携和随时娱乐的用法，至于是否拒绝同样4、5千却无法轻松随身的游戏本，看你怎么想喽！",
			"added": 1584948273,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584949305,
			"title": "怎么下载抖音、快手、火山小视频里的视频？",
			"body": "有的歌曲很好听",
			"added": 1584949272,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584960393,
			"title": "告别 IT行业后有什么感受？",
			"body": "",
			"added": 1584960359,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1584964218,
			"title": "压力太大了，怎么解压？",
			"body": "",
			"added": 1584964183,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585128535,
			"title": "Windows 软件推荐",
			"body": "Brave 浏览器：看小说无广告，适合手机使用",
			"added": 1585128497,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585128692,
			"title": "比女孩都瘦是什么样的体验？",
			"body": "",
			"added": 1585128653,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585128723,
			"title": "小说流派有哪些？",
			"body": "",
			"added": 1585128683,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585180186,
			"title": "魔改全世界（作    者:燃冷光）",
			"body": "“您是本游戏在无尽位面中唯一玩家，祝您游戏愉快。”\n\n手机里多出了一款号称游戏，实则为简易改图的PS软件。\n\n颜安青用它修改了一下毕业照之后，现实中的自己突然成了修改后的模样!\n\n沉吟片刻，他把手机摄像头对准了月亮……\n\n这是一个魔改地球的故事！\n\n\n评价：这个挺好的，改造世界上的多个场所，看世界会产生什么反应\n如在古代创造火车、游乐园、网吧，突破传统套路，要有多种元素，单一的网吧题材很容易写崩\n&nbsp;  \n网吧小说标准流程：\n开局自带保镖或无敌  -  网吧有神奇的力量  -  被大人物盯上，想要抢夺  -  抢夺失败  -  \n被更大的人物盯上 -  *** --- 被全世界的大人物盯上  -  崩了",
			"added": 1585181253,
			"parent_topic_uri": "1571843265_1Fcvuso49sa7PXuYqxBBnSAnSdF6U7p5Ta"
		},
		{
			"topic_id": 1585181426,
			"title": "小说常用套路有哪些？",
			"body": "",
			"added": 1585181384,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585217428,
			"title": "游戏推荐：掘地求升 - 蝙蝠侠",
			"body": "《和班尼特福迪一起攻克难关/掘地求升（Getting Over It with Bennett Foddy）》是一个惩罚性的攀岩游戏，对Jazzuo的2002推出的B类游戏经典《迷人远足》表示敬意。你用鼠标移动锤子可可以了。通过练习，你可以跳跃，摇摆，爬升和飞跃。伟大的奥秘和美秒的回报等待着登顶的远足者。\n&nbsp;  \n 引用Jazzuo的话：“游戏中的徒步和现实生活中的非常相似，记住这一点，你会做得很好”。",
			"added": 1585451814,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585221760,
			"title": "零和博弈 （社会学概念）",
			"body": "零和博弈（zero-sum game），又称零和游戏，与非零和博弈相对，是博弈论的一个概念，属非合作博弈。它是指参与博弈的各方，在严格竞争下，一方的收益必然意味着另一方的损失，博弈各方的收益和损失相加总和永远为“零”，双方不存在合作的可能。",
			"added": 1585221716,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585223317,
			"title": "罗斯柴尔德家族 （欧洲金融家族）",
			"body": "罗斯柴尔德家族（Rothschild Family）是欧洲乃至世界久负盛名的金融家族。它发迹于19世纪初，其创始人是梅耶·罗斯柴尔德（Mayer Amschel Rothschild）。他和他的5个儿子即“罗氏五虎”先后在英国伦敦、法国巴黎、奥地利维也纳、德国法兰克福、意大利那不勒斯等欧洲著名城市开设银行 [1]  。\n如今的罗斯柴尔德家族只是一家在全球排名前20的投资银行。据Paris Orléans（罗斯柴尔德集团母公司）2010至2011年年报数据，罗斯柴尔德家族总资产为96.5亿欧元（这一数据在传播中被广为误传）。中国人对罗斯柴尔德的追捧，很大程度上都要归功于宋鸿兵的《货币战争》。而在此之前，许多新闻、网帖已经不厌其烦解释过很多次，《货币战争》说的罗斯柴尔德都是错的--罗斯柴尔德既没有控制美联储，也没有坐拥50万亿美元资产。",
			"added": 1585223272,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585384736,
			"title": "资源之家",
			"body": "想要什么资源都说出来吧\n文档之家",
			"added": 1585384747,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585451742,
			"title": "怎么面对生活中那么多真假难辨的信息？",
			"body": "",
			"added": 1585451695,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585451818,
			"title": "老司机成长之路",
			"body": "",
			"added": 1585451770,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585527927,
			"title": "老板让财务做假账",
			"body": "之后老板发现财务做了假账，开除了财务（不能做假账要财务干嘛）\n&nbsp;  \n相关文章：\n[如何评价华为回应李洪元被羁押 251天：支持其运用法律武器维权？](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:1_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv)（文章 404了）",
			"added": 1585536685,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585527998,
			"title": "我这个人比较害羞=羞涩=囊中羞涩",
			"body": "",
			"added": 1585527948,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585528821,
			"title": "世界上最流行的操作系统不是Linux或者Windows,而是MINIX",
			"body": "> ** 运行在“Ring -3” 的 MINIX **\n你可能不知道，但是在你的英特尔系统里，除了你的主操作系统之外，还有一个操作系统在运行，这就是 MINIX。\n\n早在今年 5月，EFF 就发布了一篇文章，介绍了自 2008 年以来，这十年间英特尔发布的所有处理器都运行了一个修改版的 MINIX 3，它被称之为“管理引擎（ME）”。这个由计算机科学教授 Andrew Tanenbaum （对，就是那位早期曾经和 Linus Torvalds 论战过的教授）作为一个教育工具开发的类 Unix 操作系统内置于每一款新英特尔处理器内。\n\nMINIX 运行在你的 CPU 的 “Ring -3”（负数 3） 层上，虽然是你的 CPU，但是你无权访问它。你能够实际访问的最低的 “Ring” 是 “Ring 0”，你的操作系统（比如 Linux）内核就运行在这一层，而大多数用户程序则运行在 “Ring 3”（正数 3）上。\n\n这个运行在 “Ring -3” 的 MINIX 包括如下功能：\n\n完整网络堆栈、文件系统、许多驱动程序 (包括 USB、网络等)，以及一个 Web 服务器！\n\n没错，Web 服务器。在你的 CPU 里面有一个秘密的 Web 服务器，您是不允许访问的，而且，显然，英特尔并不希望你知道。我们不知道这个 Web 服务器究竟有什么用途，也许是 CPU 厂商会用它来访问一些数据或者进行一些控制。但是这一切，你都不知道。\n\n据称，Google 正在积极从其内部服务器上移除这个管理引擎，显然 Google 对其安全风险感到忧虑。\n\n这个事情有两个有趣或者说疯狂的地方：\n\n首先，由于英特尔 CPU 的流行，所以，世界上最流行的操作系统恐怕不是 Windows，也不是 Linux，而是这个 MINIX——我们都是 MINIX 用户！\n\n其次，由于你根本没权限访问到“Ring -3”，而这个 MINIX 却能够完全访问你的整个系统——这就是一个巨大的安全风险，运行权限极大，但是从不更新。\n\nMINIX 作者表态\n在过去几天多家媒体报道了这一消息，以至于惊动了 Andrew 本人。他在个人网站上发表了公开信，强调自己并没有直接参与这个项目，如果这个系统有后门的话，这与他无关（他对此并没有明说只是暗示）。\n\nAndrew Tanenbaum 称，MINIX 3 在 2000 年决定采用 BSD 授权，原因是企业不喜欢 GPL 许可证，认为 GPL 会让他们花费许多时间精力金钱去修改代码，然后免费提供给竞争对手。他说，英特尔的工程团队在几年前接触了他，询问了 MINIX 3 大量的技术问题，要求他对 MINIX 3 进行大量改变，减少内存占用，选择性的关闭不需要的功能。\n\n在短暂的活跃之后双方进入了静默，直到现在媒体报道英特尔处理器都运行了 MINIX 3 他才知道。他对此感到吃惊，但并不在意，因为该操作系统是 BSD 授权，英特尔不需要付钱给他。他只是希望英特尔在部署了 MINIX 3 之后能通知他一下，这只是礼貌问题。",
			"added": 1585528893,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585529040,
			"title": "CPU 的 ring0，ring1,ring2,ring3",
			"body": "Intel的CPU将特权级别分为4个级别：RING0,RING1,RING2,RING3。Windows只使用其中的两个级别RING0和RING3，RING0只给操作系统用，RING3谁都能用。如果普通应用程序企图执行RING0指令，则Windows会显示“非法指令”错误信息。\n\n   ring0是指CPU的运行级别，ring0是最高级别，ring1次之，ring2更次之……  拿Linux+x86来说，  操作系统（内核）的代码运行在最高运行级别ring0上，可以使用特权指令，控制中断、修改页表、访问设备等等。  应用程序的代码运行在最低运行级别上ring3上，不能做受控操作。如果要做，比如要访问磁盘，写文件，那就要通过执行系统调用（函数），执行系统调用的时候，CPU的运行级别会发生从ring3到ring0的切换，并跳转到系统调用对应的内核代码位置执行，这样内核就为你完成了设备访问，完成之后再从ring0返回ring3。这个过程也称作用户态和内核态的切换。   \n\n  RING设计的初衷是将系统权限与程序分离出来，使之能够让OS更好的管理当前系统资源，也使得系统更加稳定。举个RING权限的最简单的例子：一个停止响应的应用程式，它运行在比RING0更低的指令环上，你不必大费周章的想着如何使系统回复运作，这期间，只需要启动任务管理器便能轻松终止它，因为它运行在比程式更低的RING0指令环中，拥有更高的权限，可以直接影响到RING0以上运行的程序，当然有利就有弊，RING保证了系统稳定运行的同时，也产生了一些十分麻烦的问题。比如一些OS虚拟化技术，在处理RING指令环时便遇到了麻烦，系统是运行在RING0指令环上的，但是虚拟的OS毕竟也是一个系统，也需要与系统相匹配的权限。而RING0不允许出现多个OS同时运行在上面，最早的解决办法便是使用虚拟机，把OS当成一个程序来运行。",
			"added": 1585528988,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585529250,
			"title": "没有操作系统，计算机能工作吗？",
			"body": "",
			"added": 1585529197,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585537221,
			"title": "武汉精灵云被爆希望利用合同漏洞等拒绝赔偿开除赔款",
			"body": "「网友 @寒星晓月重返微博 爆料了这样一件事：武汉的一家叫精灵云的公司，由于业务调整需要裁掉整个研发团队，于是在武汉高新的 HR 群里问如何操作，群里有 384 名武汉高新区的 hr。爆料人称公司许多人还剩下 2 年合同，需要赔 0.5+1，但这家公司一分也不想赔，就从薪资结构、绩效、合同细节抠把柄。被人截图发微博后，hr 群又在要报警，把内鬼抓走」",
			"added": 1585547163,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585538146,
			"title": "如果我有本事像刘慈欣科幻小说《赡养人类》所表现的那样",
			"body": "全球的空气都算成是我个人的私有财产，并且能够豢养一支强大的军队来维护我的这种私有财产权，你就会知道我的“本事”会有多大！那时候，我一定能够让全地球的人类都立刻变成我服服帖帖的奴隶！！包括比尔盖茨！那时候，你家辛辛苦苦剥削劳动人民所得到的一点点私人财产，还不够塞我的牙缝！！",
			"added": 1585538091,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585539670,
			"title": "知乎更新隐私条款，用户没法“不同意”",
			"body": "中国流行的问答社区知乎更新了隐私政策。然而知乎的用户发现，如果点击“不同意”它会弹出一则声明“我们将按业界成熟的安全标准，采取相应的安全措施来保护你的个人信息”。用户点击“知道了”后它会继续问你同意不同意，实际上这是强制要求用户选择同意。按照业界的标准，不同意意味着用户可以选择注销账号，而不是让用户陷入一个“不同意”“知道了”的无限循环。知乎还在知乎上删除了（快照）相关问题的讨论。在中国，社交类网站都要严格审查内容，但很多时候内容审查与政府或敏感信息无关，而是出于网站本身的利益。",
			"added": 1585539614,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585539772,
			"title": "用户隐私早沦陷了（二）",
			"body": "《用户隐私早沦陷了》在我的微信里首发后，后来我转到我的知乎专栏（点这），昨天被知乎推了一把，引来许多讨论，我摘录一些评论如下：\n\n「受教了 确实没有被黑价值不用担心」\n「……我还没有被黑的价值」\n「没啥事，没什么隐私好泄漏」\n「我属于坚信自己没有被黑价值的那类(¯(∞)¯)」\n「我也一直觉得我不会被黑因为我没有被黑的价值～～～不做亏心事那点说得太赞」\n「太可怕了……但愿作为一直没有价值的存在吧～」\n「有什么隐私啊，没有被黑只是没有被黑的价值。」\n「没价值这点是真理啊」\n「还好我一老百姓也没黑的必要嘛」\n\n这些评论的共性是：确实都觉得自己没什么好被黑的，没什么隐私可以泄露的。\n\n有黑客朋友建议我给出一些干货，这样对普通网民来说会更具备震撼力。其实没必要去证明什么，下面两个公开地址，大家自己玩去吧：\n\n----------------------\n下面这个是QQ群关系库，输入你的QQ号可以查询出你所在的群关系及群里的每个QQ用户，据说是8700万条QQ群记录，搜下10000试试：\nhttps://s3.amazonaws.com/qqqun/index.html\n\n下面这个是查开房记录的，汉庭、如家、七天等，据说是2000万条记录：\nhttp://www.zhaokaifang.com/\n----------------------\n\n回到刚刚说的那些评论上。\n\n虽然我文章里说：“所以我经常说，这个互联网非常不安全，你没被黑很可能是你还没被黑的价值。”\n\n但是，不代表我们可以忽视/冷漠隐私/被黑这个问题，我这里说“你还没被黑的价值”是基于我对“被黑”的理解。\n\n我说下“被黑”的理解，有两种形式：\n黑客针对你，对你进行针对性攻击；\n黑客并非针对你，而是针对某类群体，而你正好在这个群体中，你是被殃及的；\n\n我那句“你还没被黑的价值”是针对第一种形式的，即你还没达到黑客要针对你的程度。那么针对性攻击一般会有哪些对象呢？如下：\n得罪黑客的人，无论是直接还是间接，反正得罪了，大家去百度搜个案例“月光博客被黑事件”，这里举这个例子，没想怎样，因为这个在当时是一件不热门也得热门的事件，所以在黑客圈关注度很高，把月光博客黑了一个遍的那个匿名黑客，我由衷欣赏；\n利益之争，这个在黑色产业链中最容易发生，我之前说过黑色产业链规模庞大到令人窒息；\n你是某些敏感领域的知名对象，所谓枪打出头鸟；\n\n如上这些对象才有被黑价值，确实我们大部分人都还没达到被针对性黑的价值。\n\n而，对于被黑的第二种形式，我们所有人都是躺枪的，我在《用户隐私早沦陷了》里提到沦陷的3种方式，其实我们所有人都是受害者。比如上面给出的两个在线查询隐私的网站，有的人一定会很郁闷……\n\n据说，有人去查自己另一半的开房记录，然后发现了亮点……\n\n对于第二种形式，黑客还可以用我们的隐私去诈骗我们的亲友，可以用我们的隐私去“借刀杀人”，这时由于你的忽视/冷漠，才导致了这个互联网的黑色奇葩。\n\n关于防御，我简单列下吧（都是血的心得啊）：\n重要网站/APP的密码一定要独立，猜测不到，普通网站为了记忆方便可以简单有规律，如果你记忆好，那可以都不一样，或者用1Password这样的软件来帮你记忆；\n电脑勤打补丁，腾讯管家、百度卫士都可以（不推荐360是因为我不信任）；\n能不用IE浏览器就不要用（网银登录这类必须是IE的情况那再用），用Firefox或Chrome浏览器，如果想和我一样变态安全的话，可以考虑给Firefox装个安全扩展：NoScript；\n支持正版，包括Windows，Office等，淘宝注册码没几个钱（相比激活软件要靠谱，虽然也非正版方式，但对国内来说要求大家都正版不现实），因为盗版的、破解的总是各种猫腻，后门存在的可能性很大，当然有的破解者是友好的，到时你自己判断，只是我强烈建议：支持正版。（补充：其实应该把“正版”改为“从正规渠道下载的软件” 会更实际些，大家理解就行了）；\n不那么可信的软件，如果你玩虚拟机的话，可以安装到虚拟机里；\n手机建议用安全的iPhone，别越狱，如果用安卓就安卓吧，别root，同样强烈建议购买正版APP，哪天我有心情我给你们证明下哪些破解APP的猫腻，iPhone用户尽量不用什么快用苹果助手、同步推、iTools、PP助手之类的，尊重苹果的原生态吧；\n不要在公共场合（如咖啡厅、机场等）使用公共无线，自己包月3G/4G，不差钱，当然你可以用公共无线做点无隐私的事，如下载部电影之类的；\n自己的无线AP，用安全的加密方式（如WPA2），密码复杂些；\n在任何地方输入密码时，注意周围，包括角落的摄像头；\n不要在陌生的电脑上输入密码等，如果实在需要，输入后，清除好记录；\n离开电脑时，记得按下Win（Windows图标那个键）+L键，锁屏，这个习惯非常非常关键；\n如果你是重要人物，记得给你的BIOS加个密、硬盘加个密、关键文件放到TrueCrypt里，发邮件用PGP加密；\n接上条，住酒店时，离开房间时，记得关机，锁好电脑到保险柜去；\n涉及到QQ、微信等的朋友、亲人向你借钱、充值之类事宜，电话过去确认，要记住互联网那头不一定是一个人或你以为的那个人；\n即使是官方短信也不一定可信，因为基站可伪造，百度“伪基站”看看就知道了；\n不用相信“天下掉馅饼”的传说；\n手机锁屏时要密码（数字、字母或指纹都行），千万不要图形密码，随便都可以被瞄到！！\n不轻易把自己的姓名、电话、邮箱等给陌生人（包括名片），很多场合是可以写假名字的，该低调就低调；\n相信我，如果你成为目标的话，黑客要黑你的方式太多了。还是那句：不做亏心事不怕鬼叫门，这是终极防御了；\n最后，意识为先，让更多人意识到吧，来个俗套的请求：把我的这篇文章转发出去，转发时附上：文章给出了很多非常好的防黑建议（blabla~，剩下你自由发挥），谢谢。\n\n大家发现没，以上我给出的建议都是基于“信任”这个核心给出的，安全的本质是信任。“除了你自己没谁是真的可信的。”记住这句终极心法，不过这个太残忍了，你自己把控下度。\n\n最后，大家可以看我去年的一篇文章《不懂安全的你，不好》，相信会给你更进一步启示的。",
			"added": 1585539715,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585548045,
			"title": "视觉中国新增租房业务 两次整改股东减持市值腰斩",
			"body": "原标题：视觉中国(15.420, -0.63, -3.93%)新增租房业务 两次整改股东减持市值腰斩\n\n被按下暂停键的国内“视觉之王”重新启动，视觉（中国）文化发展股份有限公司（以下简称“视觉中国”；000681.SZ）的网站终于恢复正常运营。\n\n3月20日早间，视觉中国公告称，公司的主网站在经过了2020年2月4日的试运营后，自即日起恢复正常运营。公告表示，“试运营期间，公司持续加强管理，巩固整改成果，截至目前整体运营平稳”，并强调，“欢迎社会各界继续监督”。\n\n> 此前，因“黑洞”风波以及网址域名等事件，视觉中国两次次被监管部门勒令整改。整改期间视觉中国股东减持、市值近乎腰斩，同时，营收下滑的视觉中国增加了“非居住房地产租赁”新业务，企图以扩大经营范围为企业增添新动能，然而在“版权门”事件中泥足深陷的视觉中国能否走出一条新的健康可持续的发展路径还有待观察。\n\n两次被勒令整改\n\n视觉中国是一家以“视觉内容”为核心的互联网科技文创公司，凭借在中国市场代理世界图库巨头Getty的图片产品，并在2014年借壳远东股份登陆A股，逐渐成长为国内“视觉之王”。2019年，一路成长顺风顺水的视觉中国却开始流年不顺。\n\n> 2019年4月11日，视觉中国因标注人类历史上首张黑洞照片的版权，从而引发“视觉中国版权门”事件，视觉中国也因“黑洞风波”被责令整改。\n\n2019年4月12日，视觉中国发致歉信并披露了《关于公司网站暂停服务的公告》，称公司正在根据相关法律法规并配合监管部门的要求进行彻底整改，加强管理制度建设，提升内容审核的质量，坚决避免类似情况再次发生。\n\n经过一个月的整改，2019年5月11日，视觉中国发布官网恢复上线运营声明。\n\n此后，正常运营刚满半年的视觉中国，又再次陷入危机。2019年12月10日，视觉中国因网站违规从事互联网新闻服务等问题被国家网信办，并被责令立即停止违法违规行为，进行全面整改。经过1个多月整改，2020年1月23日视觉中国网站恢复试运营，持续加强管理，2020年3月20日网站恢复正式运营。\n\n国信证券(11.240, -0.07, -0.62%)的研报认为，本次整改是行业层面监管，对视觉中国业绩的影响主要分成短期和长期两个部分。短期影响主要是停站期间部分客户无法正常登录网站对视觉中国造成的收入损失，长期影响主要是停止采编社会公共事务类新闻图片，不足图片数量和收入的5％，未来可能通过合作等方式进行该类图片业务。\n\n视觉中国在整改后的发展走向与上述研判不谋而合。由人民网(18.340, -0.47, -2.50%)主办、视觉中国独家战略合作的“人民视觉网”于3月25日正式上线。据了解，新上线的人民视觉网，聚合了海量高品质新闻图片、漫画图表和视频素材，是集视觉内容聚合分发及交易管理运营为一体的视觉内容在线智能服务平台。这意味着，视觉中国通过合作进行了社会公共事务类新闻图片业务，在一定程度上降低了该项业务对业绩的负面影响。\n\n版权业务引争议\n\n以合作谋求发展或许也是视觉中国在整改后拯救内容业务的无奈之举。因受到“411事件”影响，视觉中国2019年三季报业绩自上市以来首次出现下滑。2019年前三季度，视觉中国实现营业收入5.86亿元，归母净利润2.15亿元，分别同比下降16.50%和2.40%。若不积极采取应对之策，整改事件将会使视觉中国业绩继续承压。\n\n视觉中国两次被整改，落入“人人喊打”的境地，与其商业模式和销售手段不无关系。\n\n视觉中国核心主营业务为视觉内容与服务，其中包括倍受争议的版权图片授权使用业务。2019年前三季度视觉中国“视觉内容与服务”实现营业收入5.83亿元，占其前三季度营业总收入的99.48%，构成最主要的营收来源。\n\n而最为外界诟病的，是视觉中国常以维权诉讼的方式来获取客户。首先视觉中国使用各种手段注册图片版权，甚至一度连国旗和国徽的版权都被其注册过。然后利用自己手中的海量图片版权，大肆发起诉讼，不少被诉讼对象在压力之下不得不与之签订合作协议。因此在自媒体界才有“天下苦视觉中国久矣”之说。\n\n例如，此前视觉中国与煎蛋网发生纠纷，煎蛋网在翻译外稿时使用了Getty的图造成侵权。视觉中国先是提出侵权与索赔，但最终双方以签署正版图片授权合作协议告终，每张图片的单价为60元至80元。而如果按诉讼赔偿，每张单价可高达5000元。相关资料显示，仅2018年至2019年期间，视觉中国就提起了3000余项诉讼，其中90%以上均为知识产权类诉讼。然而，大多客户会在诉讼判决前与其达成和解，成为视觉中国的长期合作客户。\n\n新增“租房”业务\n\n近年来，视觉中国先是收购国际摄影社区——500px、世界第三大图库——Corbis，后又陆续剥离了亿迅资产组等非核心业务主体，表明过去视觉中国持续聚焦核心主业。但近日发生的一些变化引起了外界猜测。\n\n今年2月4日视觉中国网站恢复试运营之后，视觉中国召开了一次股东大会，新增了经营范围，增加了“非居住房地产租赁”业务。根据概念，非居住房地产具体指写字楼、商铺、工业用房等。\n\n意欲涉足租房业务的视觉中国，或许与其主营业务拓展不顺有关。据了解，视觉中国针对500px、Corbis的两项国际并购，实际已落入丧失商业独立性、未尽真正国际化、有损长远成长空间的危险之中。500px的直接销售平台Marketplace遭完全关闭，商业伙伴Getty全权掌握500px的国际销售权并拿走近半分成；视觉中国于2016年收购的Getty老牌对手、具有近30年独立运营经验的国际第三大图库——Corbis更是下场凄凉，Corbis的上下游两端资源被斩断，网站被关闭，签约摄影师被遣散并转送至Getty阵营，一夜之间Corbis在国际上由Getty对手沦为Getty附庸。视觉中国在全球并购获得资源，同时客观上帮助Getty消除竞争对手、补充新鲜血液，被市场认为这是视觉中国对“老大哥”Getty的“进贡”。\n\n值得注意的是，视觉中国在经历两次整改的同时，也面临着股东们频繁减持。根据Wind数据，2019年9月，公司实控人中柴继军、吴玉瑞、吴春红三人分别减持400万股、200万股、400万股，合计减持金额2亿元。2020年2月，同为实控人、持有视觉中国0.07%股份的梁世平以集中竞价方式减持本公司股份7.12万股（占公司总股本比例0.01%）。\n\n截至3月26日，视觉中国股价为16.27元/股，总市值113亿元，相较去年4月11日因“黑洞风波”被责令整改前的196亿元市值蒸发超83亿元，市值缩水约42%，近乎腰斩。视觉中国通过整改是否建立了健康可持续发展的路径，以帮助公司重回巅峰？漫漫复兴路，还需视觉中国艰难求索。（投资壹线出品）",
			"added": 1585547987,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1585549415,
			"title": "使用QUIC",
			"body": "QUIC是Google新开发的一个基于UDP的协议，它提供了像TCP一样的传输可靠性保证，可以实现数据传输的0-RTT延迟，灵活的设计使我们可以对它的拥塞控制及流量控制做更多的定制，它还提供了传输的安全性保障，以及像HTTP/2一样的应用数据二进制分帧传输。",
			"added": 1585549356,
			"parent_topic_uri": "1517728087_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {},
	"next_comment_id": 36,
	"comment": {
		"1581034304_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 1,
				"body": "> [gamer@kaffie.bit](#comment_5_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 小黃文網站是哪個？某家有很多資源可以貢 [...]\n\n[BDSM资源小说](http://127.0.0.1:43110/1N7GGo4WtYaxwQ9hmmr4mieL3TcafwsbRK/)",
				"added": 1584851508
			},
			{
				"comment_id": 2,
				"body": "> [gamer@kaffie.bit](#comment_6_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 連不上呢。 [...]\n\n自己想办法",
				"added": 1584865650
			}
		],
		"1584937086_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 3,
				"body": "这个说明零网是可以做小说站的",
				"added": 1584937120
			}
		],
		"1520077183_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 4,
				"body": "把零网和网站打包起来分享给他人",
				"added": 1584941090
			},
			{
				"comment_id": 5,
				"body": "> [tangdou@zeroid.bit](#comment_134_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz): 零网，P2P网络，是否让你感到焕然一新 [...]\n\n一个一个的找支持可选文件的网站太麻烦了",
				"added": 1584941282
			}
		],
		"1584941970_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [],
		"1584945208_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 7,
				"body": "使用物联网设备等于监控自己",
				"added": 1584946206
			},
			{
				"comment_id": 8,
				"body": "科技关键词：携号转网、提速降费、IPV6、公网IP、USB4、Type-C、快速充电、无线充电、高分屏、SSD、UEFI\n苹果技术：雷电3、Retina 屏幕",
				"added": 1584948851
			}
		],
		"1555337199_1MhCdLnT4dyAk3HGiY6p9bJxhDvF3Spamd": [
			{
				"comment_id": 9,
				"body": "微勃、抖阴",
				"added": 1584949142
			}
		],
		"1584958561_13W2cW8ZhgjC9KJXzvPXyCkafHsiegKvyu": [
			{
				"comment_id": 10,
				"body": "这个帖子不属于资源",
				"added": 1584964143
			}
		],
		"1580951395_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 11,
				"body": "无限流",
				"added": 1584964244
			}
		],
		"1580949338_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 12,
				"body": "幕后流",
				"added": 1584964297
			},
			{
				"comment_id": 14,
				"body": "全是套路\n无脑瞎吹，不可能拟真了就所有人都喜欢这种类型的游戏",
				"added": 1584968209
			},
			{
				"comment_id": 15,
				"body": "逻辑严密性",
				"added": 1584966820
			},
			{
				"comment_id": 16,
				"body": "保命开局",
				"added": 1584967239
			}
		],
		"1580948554_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 13,
				"body": "逗逼流",
				"added": 1584964324
			}
		],
		"1585128723_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 17,
				"body": "> [gamer@kaffie.bit](#comment_12_18CqJW5h4Rj2uiBuTx1SxYXPFiLQWW4zLt): 正常\n\n正常的",
				"added": 1585177868
			}
		],
		"1580952252_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": [
			{
				"comment_id": 18,
				"body": "开局无敌流",
				"added": 1585181313
			}
		],
		"1552358570_1kxQtmReuqmehdArtoNidfMzpvvjw2sJM": [
			{
				"comment_id": 20,
				"body": "人都是自私的，不可能有共产社会",
				"added": 1585369389
			}
		],
		"1585217428_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 21,
				"body": "还在玩绝掘地求升?这个游戏连蝙蝠侠看到了也要也有点个赞啊\n《Hang Line》是一款刺激的物理攀爬游戏，你可以用勾爪攀爬危险的雪山，躲避愤怒的山羊、雪崩、炸药等各种威胁。你能从这款游戏中感受到超级食肉男孩和蜘蛛侠在雪山上冒险的感觉。",
				"added": 1585452348
			},
			{
				"comment_id": 22,
				"body": "《Noita》是一款采用像素图形画面，轻度Rogue-like的魔法动作独立游戏，游戏中的场景包括从煤矿到寒冷废土，需要深入探索以寻求未知的神秘。\n\n在《Noita》的世界中，每个像素都有物理模拟：得益于其采用的Falling Everything引擎，游戏世界中的万物都可以燃烧、爆炸或熔毁。\n\n玩家可使用自己创造的法术，利用焚烧、熔毁、冰冻和蒸发等物理现象，结合环境打开自己的前路，在程序生成的世界上一路探索和战斗。",
				"added": 1585454190
			}
		],
		"1585181426_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 23,
				"body": "主角一路修炼，战力无敌，在最顶层世界见到了幕后黑手 --- 作者大神",
				"added": 1585528424
			},
			{
				"comment_id": 25,
				"body": "逗宗强者，恐怖如斯",
				"added": 1585529387
			}
		],
		"1585529250_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 24,
				"body": "你可以买一块51单片机, 然后写个流水灯程序, 然后完美回答你的问题, 计算机没有操作系统, 也能工作",
				"added": 1585529216
			}
		],
		"1585527927_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [],
		"1585538146_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 28,
				"body": "在第一地球的世界里，这项法则由一个叫社会机器的系统维持。社会机器是一种强有力的执法系统，它的执法单元遍布世界的每一个角落，有的执法单元只有蚊子大小，但足以在瞬间同时击毙上百人。它们的法则不是你们那个阿西莫夫的三定律，而是第一地球的宪法基本原则：私有财产不可侵犯。它们带来的并不是专制，它们的执法是绝对公正的，并非倾向于有产阶层，如果穷人那点儿可怜的财产受到威胁，他们也会根据宪法去保护的。”\n\n　　“在社会机器强有力的保护下，第一地球的财富不断地向少数人集中。而技术发展导致了另一件事，有产阶层不再需要无产阶层了。在你们的世界，富人还是需要穷人的，工厂里总得有工人。但在第一地球，机器已经不需要人来操作了，高效率的机器人可以做一切事情，无产阶层连出卖劳动力的机会都没有了，他们真的一贫如洗。这种情况的出现，完全改变了第一地球的经济实质，大大加快了社会财富向少数人集中的速度。”\n\n　　“财富集中的过程十分复杂，我跟你说不清楚，但其实质与你们世界的资本运作是相同的。在我曾祖父的时代，第一地球60%的财富掌握在1000万人手中；在爷爷的时代，世界财富的80%掌握在1万人手中；在爸爸的时代，财富的90%掌握在42人手中。”\n\n　　“在我出生时，第一地球的资本主义达到了顶峰上的顶峰，创造了令人难以置信的资本奇迹：99%的世界财富掌握在一个人的手中！这个人被称做终产者。?\n\n　　“这个世界的其余20多亿人虽然也有贫富差距，但他们总体拥有的财富只是世界财富总量的1%。也就是说，第一地球变成了由1个富人和20亿个穷人组成的世界，穷人是20亿，不是我刚才告诉你的10亿，而富人只有一个。这时，私有财产不可侵犯的宪法仍然有效，社会机器仍在忠实地履行着它的职责，保护着那一个富人的私有财产。”\n\n　　“想知道终产者拥有什么吗？他拥有整个第一地球！这个行星上所有的大陆和海洋都是他家的客厅和庭院，甚至第一地球的大气层都是他私人的财产。”\n\n　　“剩下的20亿穷人，他们的家庭都住在全封闭的住宅中，这些住宅本身就是一个自给自足的微型生态循环系统，他们用自己拥有的那可怜的一点点水、空气和土壤等资源在这全封闭的小世界中生活着，能从外界索取的，只有不属于终产者的太阳能了。”\n\n　　“我的家坐落在一条小河边，周围是绿色的草地，一直延伸到河沿，再延伸到河对岸翠绿的群山脚下，在家里就能听到群鸟鸣叫和鱼儿跃出水面的声音，能看到悠然的鹿群在河边饮水，特别是草地被和风吹起的波纹最让我陶醉。但这一切不属于我们，我们的家与外界严格隔绝，我们的窗是密封舷窗，永远都不能开的。要想外出，必须经过一段过渡舱，就像从飞船进入太空一样，事实上，我们的家就像一艘宇宙飞船，不同的是，恶劣的环境不是在外面而是在里面！我们只能呼吸家庭生态循环系统提供的污浊的空气，喝经千万次循环过滤的水，吃以我们的排泄物为原料合成再生的难以下咽的食物。而与我们仅一墙之隔的，就是广阔而富饶的大自然，我们外出时，穿着像一名宇航员，食物和水要自带，甚至自带氧气瓶，因为外面的空气不属于我们，是终产者的财产。”\n\n　　“当然，有时也可以奢侈一下，比如在婚礼或节日什么的，这时我们走出自己全封闭的家，来到第一地球的大自然中，最令人陶醉的是呼吸第一口大自然的空气时，那空气是微甜的，甜得让你流泪。但这是要花钱的，外出之前我们都得吞下一粒药丸大小的空气售货机，这种装置能够监测和统计我们吸入空气的量，我们每呼吸一次，银行账户上的钱就被扣除一点。对于穷人，这真的是一种奢侈，每年也只能有一两次。我们来到外面时，也不敢剧烈活动，甚至不动只是坐着，以控制自己的呼吸量。回家前还要仔细地刮刮鞋底，因为外面的土壤也不属于我们。”\n\n　　“现在告诉你我母亲是怎么死的。为了节省开支，她那时已经有3年没有到户外去过一次了，节日也舍不得出去。这天深夜，她竟在梦游中通过过渡门到了户外！?当时做的一定是一个置身于大自然中的梦。当执法单元发现她时，她已经离家有很远的距离了，执法单元也发现了她没有吞下空气售货机，就把她朝家里拖，同时用一只机械手卡住她的脖子，它并没想掐死她，只是不让她呼吸，以保护另一个公民不可侵犯的私有财产——空气。但到家时她已经被掐死了，执法单元放下她的尸体对我们说：她犯了盗窃罪。我们要被罚款，但我们已经没有钱了，于是母亲的遗体就被没收抵账。要知道，对一个穷人家庭来说，一个人的遗体是很宝贵的，占它重量70%的是水啊，还有其他有用的资源。但遗体的价值还不够交纳罚款，社会机器便从我们家抽走了相当数量的空气。”\n\n　　“我们家生态循环系统中的空气本来已经严重不足，一直没钱补充，在被抽走一部分后，已经威胁到了内部成员的生存。为了补充失去的空气，生态系统不得不电解一部分水，这个操作使得整个系统的状况急剧恶化。主控电脑发出了警报：如果我们不向系统中及时补充15升水的话，系统将在30小时后崩溃。警报灯的红色光芒弥漫在每个房间。我们曾打算到外面的河里偷些水，但旋即放弃了，因为我们打到水后还来不及走回家，就会被无所不在的执法单元击毙。父亲沉思了一会儿，让我不要担心，先睡觉。虽然处于巨大的恐惧中，但在缺氧的状态下，我还是睡着了。不知过了多长时间，一个机器人推醒了我，它是从与我家对接的一辆资源转换车上进来的，它指着旁边一桶清澈晶莹的水说：这就是你父亲。资源转换车是一种将人体转换成能为家庭生态循环系统所用资源的流动装置，父亲就是在那里将自己体内的水全部提取出来，而这时，就在离我家不到100米处，那条美丽的河在月光下哗哗地流着。资源转换车从他的身体中还提取了其他一些对生态循环系统有用的东西：一盒有机油脂、一瓶钙片，甚至还有硬币那么大的一小片铁。”\n\n　　“父亲的水拯救了我家的生态循环系统，我?个人活了下来，一天天长大，5年过去了。在一个秋天的黄昏，我从舷窗望出去，突然发现河边有一个人在跑步，我惊奇是谁这么奢侈，竟舍得在户外这样呼吸？！仔细一看，天啊，竟是终产者！他慢下来，放松地散着步，然后坐在河边的一块石头上，将一只赤脚伸进清澈的河水里。他看上去是一个健壮的中年男人，但实际已经两千多岁了，基因工程技术还可以保证他再活这么长时间，甚至永远活下去。不过在我看来，他真的是一个很普通的人。”\n\n　　“又过了两年，我家的生态循环系统的运行状况再次恶化，这样小规模的生态系统，它的寿命肯定是有限的。终于，它完全崩溃了。空气中的含氧量在不断减少，在缺氧昏迷之前，我吞下了一枚空气售货机，走出了家门。像每一个家庭生态循环系统崩溃的人一样，我坦然地面对着自己的命运：呼吸完我在银行那可怜的存款，然后被执法机器掐死或击毙。”\n\n　　“这时我发现外面的人很多，家庭生态循环系统开始大批量地崩溃了。一个巨大的执法机器悬浮在我们上空，播放着最后的警告：‘公民们，你们闯入了别人的家里，你们犯了私闯民宅罪，请尽快离开！不然……’离开？我们能到哪里去？自己的家中已经没有可供呼吸的空气了。”\n\n　　“我与其他人一起，在河边碧绿的草地上尽情地奔跑，让清甜的春风吹过我们苍白的面庞，让生命疯狂地燃烧……”\n\n　　“不知过了多长时间，我们突然发现自己银行里的存款早就呼吸完了，但执法单元们并没有采取行动。这时，从悬浮在空中的那个巨型执法单元中传出了终产者的声音。\n\n　　‘各位好，欢迎光临寒舍！有这么多的客人我很高兴，也希望你们在我的院子里玩得愉快，但还是请大家体谅我，你们来的人实在是太多了。现在。全球已有近10亿人因生态循环系统崩溃?走出了自己的家，来到我家，另外那10多亿可能也快来了。你们是擅自闯入，侵犯了我这个公民的居住权和隐私权，社会机器采取行动终止你们的生命是完全合理合法的。如果不是我劝止了它们那么做，你们早就全部被激光蒸发了。但我确实劝止了他们，我是个受过多次超等教育的有教养的人，对家里的客人，哪怕是违法闯入者，都是讲礼貌的。但请你们设身处地地为我想想，家里来了20亿客人，毕竟是稍微多了些，我是个喜欢安静和独处的人，所以还是请你们离开寒舍。我当然知道大家在地球上无处可去，但我为你们，为20亿人准备了两万艘巨型宇宙飞船，每艘?有一座中等城市大小，能以光速的百分之一航行。上面虽没有完善的生态循环系统，但有足够容纳所有人的生命冷藏舱，足够支持5万年。我们的星系中只有地球这一颗行星，所以你们只好在恒星际间寻找自己新的家园，但相信一定能找到的。宇宙之大，何必非要挤在我这间小小的陋室中呢？你们没有理由恨我，得到这幢住所，我是完全合理合法的，我从一个经营妇女卫生用品的小公司起家，一直做到今天的规模，完全是凭借自己的商业才能，没有做过任何违法的事，所以，社会机器在以前保护了我，以后也会继续保护我，保护我这个守法?民的私有财产，它不会容?你们的违法行径，所以，还是请大家尽快动身吧，看在同一进化渊源的份上，我会记住你们的，也希望你们记住我，保重吧。’”\n\n　　“我们就是这样来到了第四地球，航程延续了3万年，在漫长的星际流浪中，损失了近一半的飞船，有的淹没于星际尘埃中，有的被黑洞吞食……但，总算有10000艘飞船，10亿人到达了这个世界。好了，这就是第一地球的故事，20亿个穷人和1个富人的故事。”\n\n　　“如果没有你们的干涉，我们的世界也会重复这个故事吗？”听完了第一地球人的讲述，滑膛问道。\n\n　　“不知道，也许会也许不会，文明的进程像一个人的命运，变幻莫测的……好，我该走了，我只是一名普通的社会调查员，也在为生计奔忙。”\n\n　　“我也有事要办。”滑膛说。\n\n　　“保重，弟弟。”\n\n　　“保重，哥哥。”\n\n　在星环的光芒下，两个世界的两个男人分别向两个方向走去。",
				"added": 1585538450
			}
		],
		"1585539772_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 29,
				"body": "一个人知道了，就等于无数人知道了",
				"added": 1585541313
			},
			{
				"comment_id": 30,
				"body": "不要在朋友圈里晒孩子",
				"added": 1585541360
			},
			{
				"comment_id": 31,
				"body": "“连接”是这一波移动互联渗透时最常被人提起的词汇，而“分离”呢？分离就是隐私。不管你愿不愿意承认，隐私都逐渐在成为一种假象：社交软件记录个人行为模式，征信系统记录理财倾向，具体到每一天在哪里都会储存在lbs。\n\n然而我真正值得玩味的，是隐私本身会变成一种阶级壁垒。如果“隐私时间”可以出售，势必会发生的是，穷人的一切皆透明，而富人愿意为自己的隐私埋单，做的任何事情都是神秘的。但只有你的过去定义了你是你，当一个人的一切皆暴露于阳光下，人人皆可读，那么他本身存在的意义又是什么呢？他做的工作还会有不可替代性吗？他还有价值吗？\n\n所以我朝着这个方向写了这篇科幻小说，《全数据时代》，原刊登于《科幻世界》2017年8月刊。\n\n\n\n一\n\n\n\n和往常一样，梅子在一连串的数据中醒来：\n\n“您的体温36.2摄氏度，血压112/73毫米汞柱，健康状况良好。昨晚您睡了七个小时四十九分钟，其中深度睡眠时间是……”\n\n这声音是从她大脑里“生长”出来的。脑机接口技术成熟后，电子秘书就通过刺激大脑颞叶皮层，模仿听觉冲动，来制造只有一个人能“听”到的声音。\n\n“现在几点了？”梅子问道。\n\n“9点55分。”电子秘书回答。\n\n“糟了！今天有黄兆京的演讲！……是几点开始？”\n\n“10点20分开始。”\n\n“那我得抓紧了！”梅子噌地一下掀开被子，冷空气顺势灌进她的大脑。\n\n“已经赶不上了，演讲开场之后就进不去了。现在即使用最快的速度，梳洗加路上的时间也需要三十五分钟，你最快也要10点30分才能到达。”\n\n“你不明白！能拿到他演讲的入场证是多幸运的一件事！现在我抓紧时间，路上再快一点儿，搞不好还能赶得上……”\n\n“这是不可能的。根据以往的数据和今天您的各项指标，计算后得出，您从起床到出门需要十五分钟，从家到学校的路线已经规划好，二十分钟后到达。所以，最快10点30分您将出现在学校礼堂门口，这是不会出错的。”\n\n“一台电脑懂什么！这次无论如何我是不能迟到的！”梅子边刷牙边含混不清地说道。\n\n此时洗手台的镜子显示出一个笑脸Emoji，电子秘书的声音又响起来：“首先，您最快到达学校礼堂的时间是10点30分，这是综合了所有参数后的结果，不存在提前到达的可能。其次，要提醒您我并不是电脑，我是ZealFinance公司开发出的全数据服务系统。虽然我通过脑机接口释放声音信号来与您沟通，但是事实上，我可以与您生活中所有的含有ZealFinance芯片的物品联网，收集您一天产生的所有数据，连接个人数据与社会数据库，从而为您提供最全面的生活服务。我们ZealFinance的愿景是优化生活，服务社会。我们的价值观是……”\n\n梅子没有再理会电子秘书，接下来的一系列连贯性行为里，她再也没有耽误任何时间——家门识别指纹后自动解锁；她小跑到电梯前，电梯门正好打开；乘电梯到一楼走出公寓大门，一辆车刚好就在她面前停稳，她侧身坐定的那一瞬间，车辆发动。\n\n从出门到上车，梅子出行后的每一步之间都没有余留哪怕是一秒钟的空隙，这是因为电子秘书调取云端数据库的信息，结合住宅电梯使用情况、城市交通，经过统筹计算后，向电梯、车辆内嵌的Zealfinance芯片传送了精确的运行指令。整个出行规划系统就如同精密咬合的齿轮，充满了整齐划一的美感。\n\n梅子坐的车没有驾驶员，她一个人在静谧中被加速到每小时二百四十公里。梅子向车窗外望去，环城高速路上全是车——飞驰的车，每辆车之间的距离不过二十厘米。如此高的车速，如此近的车距，让这条车河变成了真正的液体。\n\n这液体是会呼吸的。如果有车辆需要变道或转弯，从远到近，四周几十辆车便会渐进腾挪出空间，为它让路，就像训练有素的罗马三线阵，不需要指挥官协调，方阵里的每一个士兵都知道下一步该做什么。\n\n汽车开过巨大的广告标语：“智慧城市—— 一座有心跳的城市”。\n\n不一会儿，学校礼堂到了。梅子匆忙走下车，双脚踩在礼堂前的第一级台阶上，她抬头望了一眼头上悬挂的硕大电子钟——10点29。\n\n两秒后，数字轻轻跳闪了一下。\n\n10点30，分秒不差。\n\n\n\n二\n\n\n\n梅子因为迟到，没能进入礼堂，只好托校办的同学在后台找到一个位子，即使这样，她也感受到了现场热烈的氛围。\n\n“最后我想对在座的年轻人说，能够生活在这个井然有序的时代，你们是幸运的！人类体验着从未有过的安定和便捷。这是你们父辈奋斗的成果，也是你们继续肩负的使命！”\n\n话音落下，礼堂里掌声雷动。毫无疑问，这场演讲是成功的，校办的工作人员到这个时候终于才舒了一口气——今年还未过半，已经有三个学生从宿舍楼顶跳下轻生了。这十年来，世界范围内的高校自杀、枪击、酗酒和吸毒案件都在缓慢攀升。各种猜测甚嚣尘上，莫衷一是。\n\n黄兆京儒雅低调，鲜少参与公开演讲，这次校办动用了诸多关系，请他做一场励志演讲，为的就是扭转弥漫在大学生间越来越浓重的颓然气息。\n\n主持人接过麦克风，朗声说道：“感谢黄总的精彩演讲。下面进入提问环节，问题方向不限。那一位……蓝色外套戴眼镜的同学，我看你是第一个举手。”\n\n“黄总，您好，刚刚您说，我们生活在一个井然有序的时代……我想您指的就是全数据时代。您作为新时代的缔造者，能不能跟我们讲讲时代变迁最直观的感受？最大的变化是什么？”\n\n黄兆京听完，稍稍思考了一下，说道：“如果要用一个词形容过去的时代，我会选择‘混乱’。这些年世界变化很快，你们没有经历过我小时候的世界，真的很难想象。\n\n“从前，坐车从城南到城北得提前两个半小时出门。为什么？交通太糟糕，时间就全堵在路上了；谁如果生了大病，想要去医院排队看名医，那就必须排长队，搞不好还要提前很多天预约，然后慢慢等待。如果看不好，就得去另一家医院重新排队，等待看另一个医生。如果还是看不好，只能这么一个医生一个医生地试下去……很多人的病就这样耽误了。而且那个时代还骗子横行，金融诈骗、电信诈骗、互联网诈骗……每天都有无数骗子卷走了别人一生的积蓄，然后消失得无影无踪，警方拿他们也没辙。\n\n“全数据时代之前，这就是人们所面对的混乱不堪的世界。全数据时代，顾名思义，每个人每天产生的数据都会被收集，再上传到中枢数据库内，用这些数据以及数据处理后所产生的结果，来为人们提供更好的生活方式！\n\n“然而这也不是一蹴而就的，无数工程师、科学家都为全数据时代的到来贡献过自己的智慧。\n\n“21世纪初，IBM公司率先把大数据技术应用到了医疗上，他们研发的认知计算系统Watson能够在几十分钟内读完千余份医学期刊，比对数据库内的海量病例，并从中找出最好的治疗方案。由此，大数据医疗开始流行，人类逐渐告别了仅依靠医生经验的诊疗方式。‘名医’不再是稀缺资源，依托于计算机系统的云端诊疗对每一个人开放，更准确、更透明，这为患者争取到的不只是时间，还有生的希望。\n\n“随后是无人驾驶领域。原本无人驾驶的技术门槛非常高，因为公路上随机事件很多。从前，我们希望汽车能够在感应到突发情况的瞬间采取应对措施，让每辆车配备一个对路况敏感的激光雷达，以及一个能快速应变的中枢，但这也意味着高昂的造价和误判的可能。反观我们现在大规模生产使用的无人驾驶汽车，它们根本没装雷达，控制系统用的也是个人电脑级别的芯片。这是因为Google公司切换了研发思路——虽然研制一辆车无人驾驶很难，但如果让全城的汽车都无人驾驶，把车流想象成一个整体，那又是另一回事了。通过网络相连，收集分析每辆车的位置和速度信息，网联车技术使每辆车子都变成了巨大有机体的一个细胞，由更高级别的中枢下达行驶指令，它们之间就不再会发生碰撞。这不仅仅解决了行驶安全问题，由于云端数据库内有全城的车辆的位置和路线，还可以读取车辆的历史记录、每个人的出行习惯、行车模式。通过宏观运筹的算法，规划城市的整体交通，错开车辆出行路线，这能使道路利用率最大化，让城市从此告别拥堵。\n\n“当然，我国企业家和工程师也在探索大数据应用的潮流里不甘落后。21世纪电子商务兴起，中国，一个十几亿人口的大国，物流就成了大问题。比方说，所有人都挤在‘双十一’折扣日那一天买东西，如何在订单爆发的情况下把每件货最快地送到买家的手中？解决办法也简单：读取过往所有的用户数据，预测今年商家每种货品的购买状况，从而在大促销前就做出仓储配送方案。‘双十一’还没到，卖家就在华南、华北、华东不同的仓里按照预测数据配置好了货物；物流公司的配送员和车辆也按照预测的数据就位。这么一来，平均配送时间从一周降到三天，全国物流网实现了大提速。\n\n“就这样，大数据应用慢慢渗透到了社会每一个角落：电梯系统收集住户上下班出门记录，优化运行，可以让住户避免长时间等待；分析个人搜索词条和观看视频的类型，测出用户兴趣爱好之后，精准投放广告；智能马桶每天检测排泄物、记录个人身体状况，除了兼职私人医生还可以为政府预警流行病……\n\n“我这么总结——记录下个体的精准数据，能够改善个人生活；记录下群体的庞大数据，可以优化资源配置。利用大数据技术‘算’出我们想要的生活，就这样，我们终于告别了混乱，这就是我这些年来看到的改变。”\n\n台下掌声如雷。\n\n“谢谢兆京师兄带我们详细回顾了全数据时代开启的过程。”主持人继续向台下问道，“那么，下一个问题……好，这位穿红毛衣的同学，话筒麻烦递给他一下。”\n\n“兆京哥，您好，作为一名即将踏出校门的大学生，我很好奇当初您为什么决定进入征信行业？我读过很多关于您的文章，那个时候您坚决地放弃了藤校的研究生录取通知书和顶级投资机构的高薪offer，而选择在一个冷门行业里办一家新公司。您那时是怎么考虑的？有百分之一百的信心会成功吗？”\n\n“还没开始做，怎么可能有百分之一百的信心呢？”黄兆京笑道，他推了推眼镜，梅子从屏幕上看见了他眼角智慧的鱼尾纹，“但那时确实看到了趋势。我们都知道，如果企业或个人需要借贷，金融机构会对他进行信用评级，以此决定借贷的数额、利率和周期。过去，信用评级通常由征信公司完成，方法是分析其过往大额贷款记录、收入水平和资产大小，再刻板地带入公式，最后给一个评定出来的级别，这不仅需要人工统计，也无法避免系统误差。而我创办的Zealfinance公司，则借助互联网将征信过程碎片化，融入了借贷者的日常工作和生活。每个人的每一笔日常消费、每个月的信用卡记录、工资转入记录、每个公司的所有转账流水，都会变成信用评估依据。\n\n“但如果仅仅这样，还远远算不上卓越，zealfinance开创性地将基因检测、性格测试、在校成绩、婚恋史、犯罪记录、业绩评估等这些原本与金融无关的概念融入了征信系统。因为诸多学术研究都已证实，一个人在借贷上的诚信水平，和他的基因、性格、智力水平，甚至谈恋爱时的忠诚程度都有关系。我们调取个人的一切财务和非财务信息，通过算法自动生成信用评级。相比于传统征信，这是一个更加真实通用的评级，不仅更好地反映了金融风险，也适用于其他非金融场景，可以说，它是万能的。”\n\n“比如……谈恋爱也可以用？”红毛衣学生追问道。\n\n“哈哈……果然是年轻人，关注点都在恋爱上。对，女孩儿答应你的表白前，可以先调取你的恋爱信用记录，如果你有出轨前科或是前任都觉得你不体贴，那么她当然要给你发好人卡。除此之外，学校录取、公司雇佣、商业合作，都可以用到这一套综合性的信用体系。zealfinance首次实现了人类社会的信用体系大一统。从此之后，每个人、每个公司，都必须对自己做出的每个决定负责，这对于社会文明的进步是有划时代意义的。\n\n“但全数据征信的前提是庞大的数据收集工作，显然一家企业不可能独立完成。于是我向政界提出了倡议，在中国政府的推动下，《国际数据合作法案》在纽约联合国总部被通过。法案由序言与二十六条正文组成，确立了基本的四个原则：\n\n一、公平：无论职业与背景，每个人每天的行为所产生的所有数据均将被采集；\n\n二、共享：个体的数据被采集后，将共享至云端数据库，以便全球范围内的所有企业和机构使用；\n\n三、匿名：个人数据加密后才可被用作分析处理，任何企业和个人都无权调取有针对性的原始个人数据；\n\n四、自由：在不违背法律、不侵害他人利益的前提下，个体可以购买自己特定时间段内的数据，使其不被采集入库。”\n\n主持人接道：“《国际数据合作法案》具有的里程碑意义，不言而喻！自它诞生之后，世界变得透明了，我们用数据精准描述和服务每一个人，用它来提升生活水平，甚至预测未来、防止‘黑天鹅事件’出现。稳定和谐的全数据时代，终于来临。”\n\n黄兆京微微点头，表示认同：“我想，我个人的成绩也并不是创建了一家多大的企业，而是推动社会进入了全数据时代。Zealfiance公司研发的芯片植入了冰箱、鞋底、电饭煲、路灯等生活必备物品，以此来收集我们无时无刻不在产生的数据，同时设备也通过互联网相连，无时无刻不在为我们提供最有针对性的服务。这大约也是今天我能够被邀请，回到母校做这一场演讲的原因……希望这个答案，大家能够满意。那么，下一个问题？”\n\n台上的提问环节仍在进行，梅子却被后台的一个黑影的骚动吸引了注意力。\n\n她站的地方是后台化妆间旁的走廊，只见那个身着黑色帽衫的身影蹑手蹑脚走进了黄兆京的化妆间，梅子便从门缝向内一瞥，房内没有其他人，而黑影在一件男士外套里翻腾着。 这是遇到了贼！\n\n梅子赶忙冲进化妆间厉声质问道：“你在干什么？”\n\n黑影一怔，旋即答道：“别出声。”紧接着，他从黄兆京的上衣口袋里掏出橡皮擦大小的扁平配件。这个人的帽檐被压得很低，仿佛一整张脸埋进黑翳里。黑翳里迅速伸出一只手，一把抓住梅子的手腕，不顾她的反抗，把她拽到户外，再拽进了一辆车里。\n\n在这个过程中，梅子听见喧闹伴随着校办人员的喊叫声从后台传来：\n\n“怎么回事？！”\n\n“学生入场之前都是做了记录筛查的啊！”\n\n“快先把他控制起来！”\n\n梅子转向这个黑影，喝问道：“你刚刚拿了什么？”\n\n黑影一边发动汽车，一边干脆地回答道：“黄兆京的移动数据库，也是他擅自侵入公用数据库的罪证。”\n\n\n\n三\n\n\n\n车子开出校门，黑影才把自己的帽子摘下。\n\n刚刚从惊吓中缓过神的梅子马上认出，这个人是她同级数学系的林正载。发现是自己的校内同学，梅子心里略微放宽。虽说她和他没打过交道，但林正载可是个人物，梅子早有所耳闻。林正载的名声，与“富二代”“数学天才”“行为怪诞”捆绑在一起。梅子心下盘算着逃脱方法，自己身上的Zealfinance芯片是语音控制的。该如何在不被林正载发现的情况下，让芯片向云端发送定位信息呢？\n\n“你是林正载？数学系的，对吗？……你到底想干什么？！”梅子问道。\n\n“问题还挺多……我是林正载，数学系的。第三个问题待会儿再说，先把你的名字告诉我。”\n\n“我叫梅子……”\n\n林正载将从黄兆京那里盗取的移动配件连接上移动电脑，设好的程序就自动运行起来。车内安静得令人尴尬。梅子此时发现自己的手机信号变成了零格，企图低声呼唤电子秘书也得不到任何回应。她惊慌地抬起头，得到了一个意料之中的回答。\n\n“不用试了，我屏蔽了你的手机和电子秘书，另外，我也买断了一百小时内你我的数据轨迹。这段时间内，你产生的所有信息，都不会被上传云端。”\n\n买断了一百小时内的数据轨迹？梅子心中一惊，虽然《国际数据合作法案》明确规定，支付一定的费用可以保留自己数据不被录入云端库中，但这一权限的价格这些年一直居高不下，一小时的全方位数据隔离大约需要花掉一个普通白领一周的薪水。当“连接一切”变成了时代的大趋势，“分断隔离”就变成了一种价值不菲的奢侈品。梅子出生于普通工薪家庭，长这么大，只有去年参加富二代闺蜜生日会的时候，被闺蜜的爸爸送过两个半小时的隐私隔离。那算是沾了闺蜜的光。不过，梅子一直丝毫不理解富人对自己隐私的执着——又不做坏事，为什么怕人知道呢？\n\n而如今一下子被送了一百个小时的隐私隔离，她更是摸不着头脑了。\n\n窗外开始下雨了，瓢泼大雨喷泉一般洒在前挡风玻璃上，雨刷来回折腾，试图从雨幕里辟出一片清晰的视野。\n\n林正载就盯着这片玻璃，双手把握着方向盘。\n\n这个时候梅子才注意到，他们坐的车居然配备的是人工驾驶系统！\n\n“这辆车……是人工驾驶？！”梅子感到震惊。\n\n“嗯，这是老车了。听点儿音乐？你左手边的匣子有CD光盘，塞到播放器里就行了。”\n\n梅子摇头，说道：“不了，我也不会用播放器。你到底要带我去哪里？”\n\n林正载直视前方开车，没有回答她，而是单手打开匣子，将CD碟放进播放器里。\n\n梅子不明白林正载到底是怎么做到的，驾驶一辆时速二百四十公里的老车，在步调整齐划一的自动驾驶车辆里穿行，见缝插针，横冲直撞，同时还能腾出手来放音乐。他就像一首钢琴曲里最刺耳的杂音，灰色的暴雨迎面扑来，窗外的水花被轮胎溅得有一人高。\n\n“你这是危险驾驶。”她的掌心因为紧张而渐渐濡湿。\n\n“不，周围这些被算法控制的车，有它们特定的轨迹，只要掌握好规律就不危险了。另外……我没有要绑架你的意思，是实在没办法了，想请你帮一个忙。”\n\n“所有绑匪都是对受害者这样说的。你刚才到底在礼堂干了什么？我不是傻子，如果你真的什么坏事都没干，是不会有兴致开车出来带我兜风的。”\n\n\n\n四\n\n\n\n林正载并没有把车子开远，绕着学校附近转了几圈后，在学校门口的咖啡厅停了下来。他示意梅子下车，寻了张桌子，两人对坐下来。\n\n林正载点好了饮料，又从钱包里抽出几张钞票付了账，然后拿起书架上的一本书，一边摆弄着，一边对梅子说道：“我很喜欢这家咖啡店，因为店里还有这种纸质书。”\n\n“现在读纸质书的人可不多了。我的书都是电子版的。”\n\n“所以……你爱看什么书？”林正载把目光从书页移到梅子的脸上。\n\n“最近那本走红的《深宫穿越之八个王爷爱上我》特别棒！还有《千金小姐的三生三世2》和《特工太子妃的复仇》，写了很浪漫的爱情故事，男主角又帅又迷人。这几本书简直霸屏了，广告做得到处都是……而且IP已经被买下来，很快就要搬上大银幕。”\n\n“如果我说，我从来没有听过这些书的名字，你相信吗？”\n\n“不可能，这些书年轻人里面流传得特别火！”梅子不假思索地回答道，“我的好几个同学都在看。”\n\n“三俗的文学作品总会吸引眼球，但当你看了几本类似的电子书后，Zealfinance就会判定你是一个脑残电影的受众，你的电脑、手机、你能看见的智能广告牌，就会按照你的‘胃口’向你推送类似的作品，接着你就被动地成为一个沉溺于文化垃圾的人。千千万万年轻人都像你一样，这些信息被反馈到出版公司和影视制作公司，结果就是越来越多的三俗书籍、影视剧被制作出来，很快，文化市场上就会充斥着垃圾。所以——数据的高度即时反馈就会产生这样的信息黑匣子，让人单调又愚昧。而我从来没有让他们提取我的数据，所以自然不会被这种玩意儿荼毒。”\n\n梅子不屑地哼了一声，“这有啥了不起……看本书放松一下而已，用得着上纲上线吗？”\n\n“如果我告诉你，除了书和电影外，新闻、知识、信息，甚至你的职业和人生选择，都被塞入了可以被预知的黑匣子，黄兆京和他的Zealfinance 公司将要成为人类社会衰败的罪魁祸首，你会相信吗？”\n\n梅子困惑地看着林正载，半晌才反应过来，“……原来你是一个反全数据化分子！我刚才就注意到了，你人工驾驶轿车、买单付账用实体钞票、看实体书，这都是为了不让自己的数据轨迹被记录下来。我听新闻说，近年来你们这股保守势力在抬头。但恕我直言，每一次技术革命，都会伴随着反对的声音。你们和19世纪到处破坏纺织机的卢德工人一样，工业革命是他们能够停止的吗？几台纺织机对于整个时代来说，和几粒沙子一样。你们的声音在全数据化时代里，连沙子都不如。”\n\n林正载无可奈何地摇摇头。这时服务员走来端上一杯咖啡，林正载将杯子轻轻推到梅子面前，说：“喏，espresso，给你点的。 ”\n\n梅子见了咖啡，精神微微一振，“嗯，谢谢。我正想喝这个……”\n\n“你的手机闹铃记录了平时的作息时间，你有早起和午睡的习惯；智能马桶检测到你的血糖水平；运动手环记录了你的心跳和体温；你的电子钱包告诉我们，你今天早上吃了一份饱腹感十足的大餐，平时又有喝espresso提神的习惯。所以通过你各项身体指标，可以得出结论：你现在正犯困呢，想来一杯咖啡提提神……这杯咖啡点得可符合你的心意？”\n\n“是的……但你怎么会取得定向的个人信息？根据《国际数据合作法》，个人产生的数据加密之后才可被用作算法分析，任何企业和个人都没有权利调取有针对性的个人数据。难道说……你黑进了云端数据库？！”\n\n面对梅子的质疑，林正载不置可否，“每天都会有大约一百三十个跟你一样对咖啡因有依赖的人来店里点espresso。有了这些数据，店铺可以调整进货量和人手，提前备下足够的原材料；lbs定位系统在更宏观的尺度上也有它的分析——大多数学生来这儿喝咖啡一坐就是一天。有那么多学生来这儿，说明了这里有商机。所以周边区域配套地开起了奶茶店、复印店和阅览室，每一家都有着相当的客流，无一亏损。学生找到了自习的地方，店员赚了工资，店铺有了利润，学校收了房租，周遭地段变得更具有商业价值……而你，梅子小姐，在这个下午也因为一杯咖啡不再昏昏欲睡了。这个故事里，全数据让资源最优配置，每个人都得到了好处。”\n\n梅子点了点头，困惑地看着林正载，问道：“所以，你为什么还要反对全数据时代呢？为什么还要反对黄兆京呢？”\n\n“因为我们永远也不会知道，黄兆京想不想喝咖啡。《国际信息合作法》里的‘自由原则’，这一条出了问题。在福布斯排行榜上居前列的人，当然可以买下自己和家人所有时间段的数据不被人获取，而普通人呢？工薪族呢？一家五口蜗居在四十平方米里的人呢？隐私？他们恐怕不会买这种虚无缥缈的东西吧？”\n\n“那又如何？我就是这样的普通人，数据都上传了那又怎么样？我没觉得哪里不好了……”\n\n林正载打断她的话，“梅子同学，你想过吗？究竟是什么决定了有的人到了金字塔顶端，有的人只能日复一日领着薪水过得入不敷出？”\n\n梅子一愣，没想到他会问这个俗套的问题，犹豫地说道：“……成功的人有百分之九十九的勤奋，和百分之一的天才？”\n\n“这种鬼话你真的相信？我们考入相当顶尖的大学，于是都成了黄兆京的学弟学妹，不勤奋吗？不天才吗？可是等我们毕业之后，其中百分之九十九的人会庸庸碌碌地过完一生。要知道，这个比例在黄兆京读书的那个时代，可绝对没有这么高。”\n\n“你认为……这一切都是Zealfinance公司导致的？”梅子好奇地问。\n\n“全数据时代导致的。”林正载纠正道，“如今，计算机能代替人类大多数的工作，无论是靠脑力的工作还是手艺活，无一幸免。一旦算法被破解，再天才的交易员也无法和计算机系统相比；只要图纸被读取，多资深的匠人做出的手工产品也不及机器做的精细。那么，人的价值还剩下什么？——只有那些不为人知的秘密，曾经走过的路、遇见过的人、经历过的事才构成了一个人核心的价值。一个人想要脱颖而出的关键，不是勤奋和天才，而是隐私。这个时代，能否掌握隐私和数据，才是精英和庸人的区别，也是富人和穷人的区别。”他停顿了一下，“但大多数人不会去思考这些了，隐私被上传，就意味着被全数据时代剥夺了创造性和反思能力……而我，多亏了我的父亲，他还有几个钱，除了给我买车之外，还为我购买了最高的隐私保护级别。不然，我肯定也跟着你们一起傻乎乎地追小说和电视剧，不会觉得这个荒谬的时代有任何不妥之处。”\n\n“难怪刚才在礼堂里，他们没有筛查出你的反全数据倾向，因为所有的数据……根本没有入库！”梅子恍然大悟。\n\n“这不是重点……真正的关键是，长时间的隐私保护，让我有了独立思考的能力。如果一个人的好恶都是透明的，那么只要调动城市中枢电脑里的几个设定，再通过大脑里的电子秘书传达给个人，就可以神不知鬼不觉地利用其好恶来引导让他们出现在任何地方、去做任何事……他们的工作经验和个人能力被记录在数据库中，随时可以被电脑或者他人替代掉，生产不出任何独特的价值。于是他们只能在整个城市的生态系统里，做着最低级的重复工作，赚着刚好够生活的工资。生活就像一眼能够望到尽头的道路，机遇和挑战不复存在，所有人还未出校门就隐隐感觉到了天花板，这也是世界范围内年轻人自杀率上升的原因！”\n\n倾听着林正载的疯狂理论，梅子的理智将她拉了回来，“你这些都是猜测，证据呢？”\n\n林正载思索了一阵子，说道：“证据……我有。你刚刚问我是不是黑进了云端数据库？你实在太高看我了。这类数据库常年被顶级网络安全高手维护，就算我有三头六臂也很难找到漏洞。”\n\n“那你是怎么取得我个人数据的？无论是电子秘书，还是其他服务终端，应该收到的都是数据云计算后的指令结果，中间的过程应该是黑箱才对！”梅子追问道。\n\n“刚才那个移动硬盘里，有黄兆京每天产生的所有数据，我用它伪造了黄兆京的身份，云端数据库识别之后，我就成功调取了你的资料。”\n\n“就是你刚才在后台偷的东西？” 林正载点了点头，继续说：“黄兆京买断了自己的数据，被阻断在云端数据库之外，但他也想了解自己的身体、资产、公司运作的情况。如何把自己源源不断产生的数据安全地收集起来，仅供一个人使用呢？解决方式也很简单——凡是黄兆京产生的数据，都从终端汇集到那个小匣子里，它不与外界相连，独立存在，用最原始的隔离方式确保数据安全。然而，这也可以说是最不安全的，我只需要盗取它的实体……不会有警报，发现被盗后也不能通过远程操作进行它的格式化……它只要在我手上，我就牢牢掌握住了黄兆京的秘密。”\n\n“太讽刺了……在信息安全被高度重视的今天，盗取顶级机密居然是用这样简单粗暴的低级办法。”梅子瞠目结舌。\n\n林正载再次点了点头，“这件事如果曝光，他下半辈子就要承受牢狱之灾了。不仅如此，只要以此向政府申请对Zealfinance的全面调查，政府的专家只要分析足够多的样本后，也能够证明整个数据收集、分析的体系是不利于人类社会发展的。只是……这件事恐怕需要麻烦你了。”\n\n“为什么？”梅子瞪大了眼睛。\n\n“因为来不及了，我的脸出现在后台的那一瞬间，恐怕他们就定位到我个人了。”\n\n“那我现在该怎么办？”\n\n“喝完这杯咖啡。然后到我车里——手动驾驶的车是分离于数据库的，你放心，他们不会那么快找到——用车里的笔记本和这个小黑匣子进入云数据库，将有用的资料下载下来，分别交给五家不同的媒体，名单都在电脑里。”\n\n“还有呢？”\n\n“……你也可以看看云端数据库里关于你的资料，也许会很精彩呢！”\n\n他站起身，走出咖啡馆的门。他的背影在雨幕中渐行渐远，就像一个被雨水缓缓晕开的惊叹号。\n\n\n\n五\n\n\n\n等梅子回过神来，追到咖啡店门口，林正载的踪影已经消失了，只有那辆手动驾驶的车子还在。\n\n“‘连接一切’变成必然，那么‘从系统中分离’就变成了最脆弱的奢侈品……”她默念道。\n\n梅子进入林正载的车子，在被人发现之前取走了电脑。\n\n然而当她抱着电脑往家走的时候，一阵陌生的寂静袭来，刚刚过去一个小时，此时距离一百小时隐私隔断结束还剩很久。\n\n手机信号已经恢复，但缺少了广告推送、行程规划等功能，变成了一个纯粹的通信工具，清静了不少。没有声音告诉她该在哪个路口左拐，红灯并没有因为她的到来而变成绿色。她从来没有淋过雨，因为从前电子秘书会根据气象预测来规划行程，避免她雨天里暴露在室外。但今天她淋成了一个落汤鸡，一个在街头迷路的落汤鸡。\n\n但她竟然感到了些许兴奋，耳边没有电子秘书聒噪的提醒，她第一次学会了独处，也是第一次能够听到自己思考的声音。如今她做什么事、说什么话，都是属于她自己的秘密，人生第一次完完全全属于自己，不容别人置喙。但等雨停了呢？等一百个小时过去了呢？\n\n她是否要回到那个被预订好的轨道上？\n\n梅子回到家里，打开那个便携式电脑，伪造了黄兆京的身份，登入了记录自己全部数据的页面。\n\n“精彩在哪里了？都是些枯燥的数字罢了。”她一边回想着林正载的话，一边自言自语道。这个时候一个灵感闪过，她检索了电脑的隐藏文件夹。发现林正载在电脑里留下一个复杂的算法，她下意识地将自己的全部数据上载到该算法中。\n\n屏幕上竟然出现了图像——正是梅子自己，不过是十年后上了些年纪的样子。\n\n她马上意识到，这是根据自己过往数据模拟出的自己未来的景象。\n\n场景是在一幢别墅里，她打扮得雍容华贵，正在和几个同样衣装体面的女性一起端着骨瓷杯享用下午茶。她的一双儿女坐在一边乖巧地画画，女儿的眼睛像她，儿子的鼻子像她。午后的阳光从窗外照射进来，让家和人物都散发着一层柔和的、不真实的光芒。\n\n“这是你的未来，梅子小姐。”电脑屏幕上显示出一行字。\n\n“……看起来还不差。不过那么早就知道未来是怎么样的，那可就太没意思了！”她打开邮箱，准备将有着黄兆京罪证的数据包作为附件上传好。\n\n就在她准备点击“发送邮件”的那一刹那，屏幕上的别墅门被轻轻推开，有个男人站在门外，只能看清推门的手上戴着一只婚戒。\n\n“不想看看你的未来丈夫是谁吗？”电子秘书问道。\n\n“算了，反正是没缘分遇到他了。”梅子点下了“发送按钮”，记录自己行为的数据也迅速滚动更新了几行，屏幕上美好的未来景象瞬间消失了，取而代之的是长久沉默的黑屏。\n\n“全数据时代……再见。”梅子自言自语道。\n\n\n\n六\n\n\n\n《关于罢免黄兆京董事长职务通知》\n\n“黄兆京任Zealfinance首席执行官期间（2028年8月-2039年11月），非法侵入国际云端数据库，调取他人信息数据，严重违反了《国际数据合作法案》，对公司形象造成了不良影响。现黄兆京已接受法院提审，Zealfinance将全力配合相关调查。同时，为了尽量缩小该事件对公众生活造成的影响，董事会决定，从即日起免除黄兆京Zealfinance首席执行官一职，由原首席技术官代为管理公司运营事宜。”\n\n\n\n没想到Zealfinance的反应那么快，在新闻发出后的几个小时就有了如此反应。梅子继续向下拖动鼠标，但却发现除了对黄兆京个人的惩罚外，并没有看到政府将对Zealfinance数据处理模式进行调查的消息。\n\n网站上这篇通知的配图是一张照片，下面注明了“Zealfinance前首席执行官配合调查”。虽然穿着一样风格的西服，戴着一样的眼镜，但定睛一看，图里的人根本不是黄兆京！\n\n“这怎么可能呢……”梅子喃喃说道，“这人明明就不是黄兆京，我见过他的脸呀。”\n\n她立刻上网搜索黄兆京的图片，所有官方照片中的黄兆京的长相，居然都和她记忆中的不同，如果梅子从未见过林正载，也许她真的会怀疑自己是不是记错了。\n\n“见鬼了……”梅子迅速用手机对林正载发出视频通话邀请，新闻发布出来后，他应该也摆脱危险了。\n\n她手机屏幕亮起，一个穿着黑色帽衫的男人向她打招呼，一样的亲切，一样的帅气。只是……那是一张完全陌生的脸。\n\n梅子惊出了一身冷汗，迅速地将电话挂断。\n\n这个时候，梅子渐渐明白当初林正载说的话的真正含义了——一个人之所以能够称为人，核心价值就是那些不为人知的隐私。一旦所有数据都被提取，就能描绘出一个人格，机器能够模仿出他所有的行为，进入他所有的账户，模拟出他可能有的未来。\n\n这个时候，谁是谁，谁的肉体是否存在，还重要吗？\n\n黄兆京也许从未存在过，只是Zealfinance拿出来做公关的一个形象工具，又或者，也许他曾经存在过，但随时都可以顶上一个黑锅，消失成为历史里的一缕轻烟。\n\n而她也是如此，如果说一个开人工驾驶的轿车、不看电子书、只用纸币完成支付的数学系学生会被定义成林正载，那么，一个看浪漫爱情小说、去听演讲会迟到的女生，就能够被定义成梅子。\n\n至于在全数据时代的浪潮里，她会被什么人以什么样的方式进行替代，那就无从知晓了。数据秘书可以用任意的方式掌握她的去向，引导她生存或者死亡，因为她是透明的，而天平的另一端，她却一无所知。曾经，她以为数据是带来便利的工具，遇到林正载以后，她以为数据是一部分人的捷径，而现在，她终于知道，数据本身，就是权力。\n\n而这些顿悟，她是再也没有机会告诉别人了。\n\n因为一百个小时的隐私覆盖时间过去了，电子秘书的声音在脑海里响起：“梅子小姐，您好，咱们又见面了。”\n\n梅子第一次感觉到了孤独。\n\n\n\nend",
				"added": 1585547193
			},
			{
				"comment_id": 32,
				"body": "> [1EZRyvL5YUN6N@cryptoid.bit](#comment_31_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4): “连接”是这一波移动互联渗透时最常被人 [...]\n\n过于自动化的东西不太靠谱，容易失去自己动手的能力",
				"added": 1585548253
			}
		],
		"1585549415_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": [
			{
				"comment_id": 33,
				"body": "而QUIC协议最最吸引人的特性有两点，一是对队首阻塞问题的解决更为彻底。基于TCP的HTTP/2，尽管从逻辑上来说，不同的流之间相互独立，不会相互影响，但在实际传输方面，数据还是要一帧一帧的发送和接收，一旦某一个流的数据有丢包，则同样会阻塞在它之后传输的其它与它毫不相干的流的数据的传输。而基于UDP的QUIC协议则可以更为彻底地解决这样的问题，让不同的流之间真正的实现相互独立传输，互不干扰。\n\n` 另一个特性切换网络时的连接保持。当前移动端的应用环境，用户的网络可能会经常切换，比如从办公室或家里出门，WiFi断开，网络切换为3G或4G。基于TCP的协议，由于切换网络之后，IP会改变，因而之前的连接不可能继续保持。而基于UDP的QUIC协议，则可以内建与TCP中不同的连接标识方法，从而在网络完成切换之后，恢复之前与服务器的连接。`",
				"added": 1585549405
			}
		],
		"1585548045_1EZRyvL5YUN6N7LamTHXJrEyeq97yCw1t4": []
	},
	"comment_vote": {
		"10_12RgeEDbGjdU852T97tqnXFmRQVkNB6rLs": 1,
		"27_1CqNrgtYzPRgpMfeuC1sprqTwPxhDTmqY4": 1
	},
	"file": {
		"1585553121-437989-Screenshot20200330152503.png": {
			"title": "Screenshot_20200330_152503",
			"size": 175911,
			"date_added": 1585553121
		}
	}
}