{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {
		"1526232741_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 52,
				"body": "i have a nice multiuser setup\nso i guess archiving it will be the way to do stuff\nmaybe cleaning upvotes",
				"added": 1526236225
			},
			{
				"comment_id": 53,
				"body": "> [balancer73](#comment_46_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): go to an alternative forum with more limits.\nGhost town here i come!",
				"added": 1526241249
			},
			{
				"comment_id": 55,
				"body": "archived my votes, 41 -> 38, maybe i should archive more\nremoved some comments and post down to 32k\n> [balancer73](#comment_47_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): All ZeroNet - is a Ghost town [...]\ni also want to argue we need more content too!",
				"added": 1526242590
			}
		],
		"1526239496_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 54,
				"body": "Why not explain why is the 1gb of json data needed?",
				"added": 1526241378
			},
			{
				"comment_id": 58,
				"body": "> [balbo](#comment_1_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W): It is a database with large amount of objects (some hundred millions).It is not needed for photos or videos, in case you were wondering.\n\nyou COULD store them as optional bigfiles if it's not really needed",
				"added": 1526289431
			},
			{
				"comment_id": 59,
				"body": ">It is not needed for photos or videos, in case you were wondering.\nsorry i read that and thought you meant it's NOT needed\ni think your only way is just to include them\nand hope it's not as big as you thought\nyeah i am not really good at this",
				"added": 1526290721
			}
		],
		"1526227608_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 56,
				"body": "bloxel wars is a fun call back to /r/place, loads very slow doe, and maybe its too \"small\"",
				"added": 1526274474
			}
		],
		"1526283454_17d3S7saDQP5phkkWS9F7tMJTymqLCQmig": [
			{
				"comment_id": 57,
				"body": "possible, all we need is just to make a scraper to scrape and repost it onto zeronet",
				"added": 1526283550
			}
		],
		"1526293465_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 60,
				"body": "I hate sleeping problems >.<",
				"added": 1526298482
			}
		],
		"1526364483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 63,
				"body": "still dosent say why?\npersonally i use multiuser plugin for local uses of swapping masterseeds because there's no better ways",
				"added": 1526369664
			}
		],
		"1526368251_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 64,
				"body": "just hard-reset your router?\nwhat i would do it hardreset or just get a new one, the one by ISP is crap anyways, they always give the lowest spect one\nUPNP is still a thing, but i wont live without having router access",
				"added": 1526369727
			},
			{
				"comment_id": 65,
				"body": "> [quantumkitty](#comment_17_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I don't own the router. I can't afford a place of my own. :(\n\nprobs landlord changed it more than likely",
				"added": 1526370178
			}
		],
		"1526387869_12HSLurcaibJh4A44LGHoXm6cv6jA5qaPP": [
			{
				"comment_id": 66,
				"body": "You can do it\nit's not really about \"age\", dont see how age will affect anything if you are determined enough\nexperience can be gained over time so it shouldnt be your top concern\nsince you already know python you can just keep using it, like say to automate or make your life easier is always a good personal project",
				"added": 1526389624
			}
		],
		"1519162899_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 67,
				"body": "> [beenotung](#comment_14_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): recent update fixed permission issue on Android 8.0 (tested on Galaxy Note 8)\nyou are the maintainer right?\ni am happy to provide partial chinese translation(or as best as i could)",
				"added": 1526460105
			}
		],
		"1526435674_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 71,
				"body": "there's a thing called WASM(WebAssembly) which a lot of things can compile into and it runs generally \"faster\"",
				"added": 1526463225
			},
			{
				"comment_id": 72,
				"body": "> [krixano](#comment_416_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Doesn't webassembly require a server with https or some crap like that - I'm not sure.\n\napparently it can run on static host so i assume no",
				"added": 1526463880
			}
		],
		"1526480967_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 74,
				"body": "you MIGHT need to copy data/1(address name here) yes all of them if sites.json dosent work\nprobably worth waiting for someone more knowledgeable to reply\nthe users.json can be left alone",
				"added": 1526481274
			}
		],
		"1526547938_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 76,
				"body": "more like `only with open source extensions`\nyou can compile from opensource for all you care",
				"added": 1526550888
			}
		],
		"1517337097_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 78,
				"body": "if you are siteadmin remember to edit the js/html part\nif you arent siteadmin not much you can do,\nfor admins, go to all.js search for zeroid, and add in other ids you want",
				"added": 1526702525
			},
			{
				"comment_id": 81,
				"body": "> [ssdifnskdjfnsdjk](#comment_275_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS):  [...]\nSorry i am lost but bump so someone can",
				"added": 1526739430
			}
		],
		"1521308711_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": [
			{
				"comment_id": 79,
				"body": "> [wanditoast](#comment_4_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): i can't do it i have a 403 error while connecting from a diffrent ipwanditoast@zeroid.bit\n\nyou will need to enable UiPassword plugin and set one for remote if it's a proxy(aka not 127.0.0.1)",
				"added": 1526702639
			},
			{
				"comment_id": 80,
				"body": "> [wanditoast](#comment_6_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ): Ok I set uipassword and multiuser . So as I start zeronet.exe internet explorer starts and connects to it. So I set internet explorer in offline mode and I first connect to it though my web address.So the proxy keeps the networks binding to my external IP .You can try it wanditoast.ddns.net\n\nyes,\nit will want to bind to your public IP, that's why you set a password, which you REALLY SHOULD\nthe ui plugin is meant for you to be able to access your proxy in public while protected from random users",
				"added": 1526739233
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 82,
				"body": "> [dotnetspec](#comment_3_18VvaNX572kjoKKhq2iLJCkPZKVjUMbjDh): Same problem. Any way to search this forum?\n\necho bot is dead",
				"added": 1526751748
			}
		],
		"1526895582_12uaobyUhg6H9rh88Ryu1x8xrJWBn6PuyK": [
			{
				"comment_id": 83,
				"body": "wont be a thing for some time, as payment system are not really possible to be decentralized for now",
				"added": 1526895680
			},
			{
				"comment_id": 84,
				"body": "> [y3z](#comment_1_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs): The openbazaar.org client is capable of handling your request in a secure manor. Zeronet is not.\n\nzeronet is decentralized+distributed, and generally isnt made for payment specific protocol\nopenbazaar is dedicated with built in protocol to deal with payment so it's expected\nthey both uses optional tor for anonymity\nopenbazaar seling system is centralized for the time begin(they plan to change that)you need to be online to sell/for people to buy your stuff [source](https://github.com/OpenBazaar/OpenBazaar-Server/wiki/Frequently-Asked-Questions#do-i-need-to-be-online-to-sell-items), personally it's a bad idea as it depend on a signle point of failure, but i doubt it is possible\n\n> [version](#comment_36_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4): You can pay BitCoin to ZeroNet site's address, the site owner can receive your payment.\n\nreceiving payment!=payment system, it's more like a donation and theres no escrow or intention for owner to sent back the thing you purchased\n\n> [deafboy](#comment_57_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa): Also \"deep web\" doesn't actually mean anything. Same as \"cloud\".\n\n\"deep web\" is an overused term that more or less has no meaning anymore, it just meant an overlay network that need specific configuration or software to access,\nthe term is just like a word associated as something tech/hacking related and stereotyped as only used by criminals",
				"added": 1526927271
			},
			{
				"comment_id": 85,
				"body": "> [haru](#comment_1_16eKDGZZxNDYvtRJPiZ8awSuA49V3UtMbT): isnt silkroad a game LOL\n\nyes it's a game but it's also a name of a marketplace",
				"added": 1526932038
			},
			{
				"comment_id": 86,
				"body": "> [deepfake](#comment_15_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1): It can be if you want to, zeronet is user-curated anyway. Most users here don't really use zeronet for deepweb stuffs though.\n\npretty much that, most people here just treat it as a censor free web, if you are expecting some darkweb, this aint the place",
				"added": 1526988659
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 98,
				"body": "Personally no, we cant enforce ban on something or anything without slowly becoming the new \"clearnet BUT with extra steps\"\n\n> [Tor Project Blog](https://blog.torproject.org/tor-project-defends-human-rights-racists-oppose):  We feel this way any time the Tor network and software are used for vile purposes. **But we can't build free and open source tools** that protect journalists, human rights activists, and ordinary people around the world **if we also control who uses those tools**. **Tor is designed to defend human rights and privacy by preventing anyone from censoring things, even us.**",
				"added": 1527358400
			},
			{
				"comment_id": 99,
				"body": "> [styromaniac](#comment_33_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It should be about consent.\n\nyes, if party consented to such action in good faith that they made the choice voluntarily\ni dont see how this can go wrong, in my own book if everyone consented there's nothing morally wrong in that said action(of course consent is harder to enforce then arbitrary long lines of stuff to enforce)\n\npeople often throw out \"only certain age can consent\" which honestly make no sense, yes they might not be wisest but that dosent mean someone can just go in and take away their rights to make a choice",
				"added": 1527400646
			},
			{
				"comment_id": 102,
				"body": "> [vanadium](#comment_2_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL):  I (in theory!) can certainly imagine ways of making child porn that would not do any harm to the child. Neither physical or psychological.\n\nYes but what about consent?\nyes you can do that without any harm on them but what will they think in the future?\nwhere people take pictures of them and share onto the internet without asking them?\nYou might be able to not cause harm onto them but that dosent mean it's all good, there's more to conder",
				"added": 1527674452
			},
			{
				"comment_id": 103,
				"body": "> [vanadium](#comment_4_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): That is, to see sex as some kind of free time activity a kid can do, just like tennis, playing instruments, art classes or what else there is for kids. I'm not saying that all kids will like it, it would depend on their personality, some kids won't like it and move on to piano or tennis. What fascinates me by this is: Imagine yourself being a kid again, would you have minded joining a 'sex-club'? Would you regret it now if you had done so?\nFor me, I think, the answer is no, I wouldn't have minded that. That of course is not to say I would have enjoyed it, but I really don't think I would have regretted it.\n\nI probably wouldnt mind if it's not forced, just like how parent might get you to learn sports but it's up to you to experience and choose to continue it, still a i wont consent people taking picture of me and sharing it onto the internet with is another topic\nBut probably a very very long shot if you consider most people's thought and would go against it simply because it havent done before, and it \"feels wrong\" despite everyone participating isnt forced, and clearly understand everything that's ongoing and can choose to stop instantly,\nSomehow if it involve child it will \"feel wrong\" to most people,\nAnd some fall back to reasonings like \"child cant make choices because age\" \"they might regret it\"(yes everyone make choices and regret it so does this mean no one can make choices?)\n\n(one side note i like about this place is we can have civil discussions on quite controversial topic without fear of anything(since it's decentralized) and most times people can keep their cool and dont resort to throwing insults but respond with rational constructive arguments)",
				"added": 1527756721
			},
			{
				"comment_id": 105,
				"body": "> [xinyi](#comment_2_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f): We cannot ban child porn without creating tools that can be used to ban everything. What we can do is 'block' child porn and prevent it from spreading. We should have blocklists as are in ad blockers. There can be blocklists of malware, spam, porn, gore etc. Anyone can apply these blocklists but no one can be forced. [...]\n\n> [styromaniac](#comment_49_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Blacklist sharing will happen eventually.\n\nHow will it be made is the question, most people worries about centralization of trust in said blocklist provider",
				"added": 1527780304
			},
			{
				"comment_id": 106,
				"body": "> [xinyi](#comment_3_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f): In most ad blockers you can add link to text file hosted on web urls and local computer. Text files are downloaded and updated every day. Every url is scanned and blocked if found in list. [...]\n\nWhile on clearnet it's acceptable that only few person have control of the \"block list\"\nhere, it's not the same, if i disagree on you blocking the site, i will just fork yours and advertise mine with reason why you should use mine not his, and then all hell will break loose, we will end up with millions of blocklist because everyone disagree with everyone on if one which sites should be blocked or not\nWhich is why i think this wont work without some sort of self/community moderating system",
				"added": 1527790743
			},
			{
				"comment_id": 107,
				"body": "> [vanadium](#comment_7_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): pedophiles are consistently the first ones to use them\ncant we fall that onto everything else?\nlike drug market, like any sort of movement that said country against ex journalism\neven whistleblowing for news outlet is a thing on tor\nwhile everything i listed above may not share a similarity on moral spectrum or anywhere else, they all are only there because they can no longer exist safely on the internet\n\n> [vanadium](#comment_7_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): I'm sure that we'll see a shift in politeness once Zeronet gets some real traction\ni feel like it's the doom spell of every community, i guess only time will tell how it ends",
				"added": 1527882852
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 100,
				"body": "> [twiddlestherat](#comment_1_1PGQDnyeqkQFhpL9e9pYv4U5uGu6tmgDvp): testing.  Where /pol/ at\n\nCome join [/pol/](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx:pol:0) at milchan!",
				"added": 1527400681
			},
			{
				"comment_id": 111,
				"body": "> [abdechahidihya](#comment_1_1iCFDEEHuTiVNVPmM8UKbCvjur5WZi2GG): I just want to understand how this whole thing works\n\nsee [this presentation](https://docs.google.com/presentation/d/1_2qK1IuOKJ51pgBvllZ9Yu7Au2l551t3XBgyTSvilew/pub?start=false&loop=false&delayms=3000&slide=id.g9a1cce9ee_0_4)\nif you have anything feel free to ask here or even make a new thread!!!",
				"added": 1528190233
			}
		],
		"1527416420_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 101,
				"body": "i mean if they do,\nwe all know what it takes is just someone stepping up to be an alternate game store, specifically friendly toward NSFW games(and controversial topic games)\nand they will easily swipe a portion of the market off steam\n\nif you act solely on business interest, that's very bad, they will be gaining momentum each time you ban games, and they focus on supporting things you cant support for whatever reason it's forbidden in the first place",
				"added": 1527419777
			}
		],
		"1527915269_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 108,
				"body": "maybe an android and iOS app store?\nwhy not desktop OS while we are at it\nhard to vet for malware doe",
				"added": 1527943893
			}
		],
		"1528032819_1HeCQMqcYxJugdjGVt3rS5hzxVyZYUsqoj": [
			{
				"comment_id": 109,
				"body": "same, never knew it existed\nprobs yes by adding it to the args/config\nalso a tracker wo people is kinda useless tho dont quote me as i dont know a lot about it",
				"added": 1528035723
			}
		],
		"1528080237_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": [
			{
				"comment_id": 110,
				"body": "while i am not fully against, i see the worst case scenario of DISTRIBUTED monopolies and it should be avoided\nremember the net neutrality slow/fast lane problem? well that's what we will create here by doing just that!!\nand i will also explain how it could be made.\n \nlet's set the scene:\npremise 1: all nodes are in interest of own their own profit\npremise 2: all nodes will act selfishly to achieve such goals\nconclusion: we will form a distributed \"cartile\" where all file owners will rack up their prices in unison to match others\n\nnow one can conclude in such scenario, someone will decided to drop the price for all these money of the desperate users, yes but you are wrong it dosent work that way...\n\nwe assume now bob decided to drop 50% from the average fees\nwe can safely assume that under premise 1, all nodes will react the same way\nresult: now bob dosent earn all these money he wished, and the users didnt get FUNNELED into him, and he also earns less\nconclusion: dropping prices is bad for yourself and permise 2 will stop bob from dropping the price in the beginning if he realize the outcome that he earn nothing from it other then worst pays\n\nOf course this is the disaster scenario, since now we all shift to financial incentive from moral duty\nand the only way to break it is to break the 2 premises and also have said file,\n\nsay carol has the file and choose to uphold moral duty over financial incentive\nall carol has to do is to set selling their file for free(or nearly cheap) and choose not to take the possibly large sum of money that could be earnt\n\nbut as long as carol is there, the whole network of nodes are useless, no one will pay for seeding IF you can get it for free,\nwe assume all these new users who just got the file 50% of them choose to seed for free while 50% of them choose to seed for small money,\nthe end result is a huge ignored network, all the nodes that cost money will get no traffic simply because there's large amount of free seeders\n\nand that's how NOT to use the financial incentive system!\nremember bitcoin?\ndo you mine because you are nice and willing to contribute to the network?\ndo you resist the temptation of mounting an 51% attack to the network because you are nice?\n\nno, you mine because you want money, and you dont mount an 51% attack because it will cost you shit load of money that could be spent like mining to get money\nit protect itself by simply expect everyone will act in their self interest, AND ALIANGING such interest that it matches with the \"right thing\" they wanted you to do\nit make attacks against the network very expensive, that no one want to commit such acts, and rewards these who mine to increase the security of it\n\nright now in the paid to seed modal, there's conflicting interest\ni can do the \"right thing\" and offer reasonable rates\nOr i can be profitable by racking up sky high prices  \nif enough people chooses option 2, let's just say we are all screwed\n\n>no one will pay for seeding IF you can get it for free\nThat's also a problem to the whole paying structure if i choose to be generous just to mess up everyone's scheme to earn money, thus the paying feature will never be used ever again",
				"added": 1528129423
			},
			{
				"comment_id": 117,
				"body": "i totally agree on that part, if the hash is same it wont need to redownload a content",
				"added": 1528380267
			}
		],
		"1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 112,
				"body": "> [anonymouslogin](#comment_138_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): How can we anonymouslogin have several different ZeroMe accounts?123\n\ndiffrent hubs",
				"added": 1528211520
			}
		]
	},
	"comment_vote": {}
}