{
	"title": "Don_Ehrenmann's Blog",
	"description": "Lisez-moi me plaindre, parce que ma vie est au moins aussi chiante que la vôtre.\n\n@donehrenmann",
	"links": "Passez dire bonjour :\n[Keybase.io](https://keybase.io/von_kavalier)\n\n---\n**VPN gratuit** : [secure.link/IsZOY4L7](https://secure.link/IsZOY4L7)",
	"next_post_id": 31,
	"demo": false,
	"modified": 1509703589,
	"post": [
		{
			"post_id": 30,
			"title": "Le temps c'est pas pour les tapettes",
			"date_published": 1509702787.353,
			"body": "Hey, ça fait presque 2 mois hein. C'est fou comme le temps passe vite, c'est fou comme j'ai totalement délaissé ce blog. Vous m'en voulez pas hein ? De toute manière les commentaires ont pas l'air de fonctionner alors de toute manière vous pouvez pas dire grand chose. :)\n\nSinon mon alternance s'est bien terminée, j'ai validé mon année et je suis pris dans la nouvelle boîte dont je parlais. Je m'y sens plutôt bien et c'est vraiment un nouveau départ pour moi, compte tenu de mon emménagement récent dans mon propre appart.\n\nJe suis pas là pour étayer ma vie (enfin si, mais pas dans ce post), mais je tenais tout de même à donner quelques nouvelles, ainsi que me rappeler à moi même que j'ai un blog ici à entretenir même si personne ne le lis :)\n\nJ'espère vous revoir bientôt.\n\nAllez salut à tous mais surtout à moi-même !\n\nDes bisous."
		},
		{
			"post_id": 29,
			"title": "Hein ? Quoi ? Le sommeil ? C'est un nouveau Pokémon ça, non ?",
			"date_published": 1504908078.311,
			"body": "Plop,\n\nOuais ouais je sais, pas beaucoup de nouvelles tout ça tout ça...\n\nLe fait étant que j'ai repris les cours et que le soir j'ai du travail et que je suis crevé. Ce qui est marrant (ou non) c'est que je ne débute pas mon année scolaire, je la termine. Ouais, c'est une vraie année scolaire pour le coup, de septembre à septembre. Vive l'alternance.\n\nJe suis **vraiment** crevé. Nan parce que je le dis souvent mais là j'en suis au point où je lutte tous les jours, matin et soir, dans les transports pour pas fermer les yeux (ce qui me donne vraiment l'air d'être un débile mental. Plus que d'habitude je veux dire). Mais bon demain je vais pouvoir dormir alors espérons que ça va me remettre d'aplomb pour la semaine qui arrive, avec un rapport de 40 pages qui doit être fini pour mardi, un support visuel pour une présentation orale, et un voyage avec mon entreprise (bon en vrai ça c'est cool je voulais juste me la péter).\n\nEn bref je suis fatigué mais je tiens bon parce que il me reste plus beaucoup de temps. Non je ne parle pas de ma mort. Au plaisir d'être lu.\n\nDes bisous."
		},
		{
			"post_id": 28,
			"title": "C'est pas la taille qui compte",
			"date_published": 1503861376.042,
			"body": "\"Long time no see\" comme disent ces indigènes de l'autre côté du Pacifique.\n\nJe suis en \"congé\" pendant une semaine là, enfin je vais surtout faire le déménagement de mon appart provisoire et retourner en cours par la suite. Ensuite j'aurais un voyage de 4 jours avec mon entreprise et ensuite retour école et ensuite voyage avec mon amoureuse et ensuite quelques jours de boulot et ensuite je change de boite.\n\nÇa fait beaucoup à digérer d'un coup mais je voulais pas m'attarder et puis de toute manière c'est moi qui décide de mon contenu ☺\n\nBref, des bisous, et faites pas de bêtises !"
		},
		{
			"post_id": 27,
			"title": "Mon futur est en marche",
			"date_published": 1503306365.3,
			"body": "Bon je viens d'accepter un job. Celui d'une autre entreprise. Le feeling passe bien et puis de toute manière comme je suis jeune, ben c'est le moment de tester des trucs et de faire ses experiences tant que j'ai pas encore d'impératifs qui m'obligent à rester dans la même boite pendant 10 ans.\nMaintenant je dois affronter mon boss actuel et lui expliquer les bonnes raison justifiées qui m'ont décidé à changer de boite, en dépit de tout ce qu'ils m'ont apporté et de la gentillesse avec laquelle ils m'ont accueilli."
		},
		{
			"post_id": 26,
			"title": "On ferme les yeux et on pense au petit Jésus",
			"date_published": 1503067087.3,
			"body": "Ça y est, j'ai dit que ça fonctionnait et qu'il y avait plus de bugs (en fait j'en ai vu un mais comme j'ai pas réussi à comprendre d'où il venait j'ai fait genre. Me jugez pas), et il va le tester la semaine prochaine.\n\nIl m'a donné autre chose à faire du coup !!! C'était tellement bien de bosser sur autre chose putain ! En moins de 2 heure ça fonctionnait ! Ça me fait tellement du bien d'avoir utilisé mon esprit pour autre chose que ces congés de mes couilles.\n\nBref, je suis donc tranquille tout le week-end (pendant lequel je vais devoir faire mon choix d'entreprise), et si mon karma est bon il verra pas de bug et je serais débarrassé sur ticket #1483 aka \"les congés de l'enfer du désespoir\".\n\nJ'espère que ça va vous en tout cas. Nan parce que j'ai pas réussi à mettre de commentaire sur mon propre blog du coup je sais pas si c'est possible de commenter en général. Si jamais c'est pas possible pensez à un ZeroMail, je répondrais quand je pourrais et je saurais qu'il y a quelque chose à régler comme ça. :)"
		},
		{
			"post_id": 25,
			"title": "Saoulé/20",
			"date_published": 1502976160.4,
			"body": "Yo.\n\nBon euh... Mon patron m'a demandé le projet terminé, testé et prêt pour demain. Et en vrai j'ai juste corrigé des petits trucs en 2 jours et on est pas loin d'un sans faute. J'espère juste que ça correspond à ses attentes, étant donné que je sais pas vraiment comment il va se servir de ce qu'il m'a demandé :/\n\nBref, si tout se passe bien j'ai terminé, il me suffit juste de bourrer les tests sauf que j'ai la flemme et que ce soir j'ai un entretien pour discuter du contrat de la dernière entreprise qu'il manquait. Sauf que c'était pas vraiment prévu, que j'ai les cheveux dégueulasses, que j'ai pas mis de parfum ce matin et que je vais puer de la gueule aussi. Nice. Ah oui, l'entretien n'a aucun rapport avec ma flemme mais j'avais rien d'autre à dire.\n\nBon je vais me faire un café moi.\n\n**Edit : **La machine à café fonctionne plus et c'était la dernière capsule..."
		},
		{
			"post_id": 24,
			"title": "Demain, ou le retour au purgatoire",
			"date_published": 1502791959.3,
			"body": "Hum.. Dernier jour de ce week-end de 4 jours... Je reprends le boulot demain et mon patron sera rentré.. J'espère ne pas trop m'en prendre plein la gueule et que il va plutôt me dire qu'il a besoin de quelqu'un en urgence sur un autre projet que je puisse enfin faire quelque chose d'intéressant dans le cadre de mes compétences.\n\nEn plus l'autre jour, un de mes responsables est passé me voir pour me donner la clé du bureau et forcément à ce moment je faisais autre chose sur mon PC... Génial la vision qu'ils ont de moi en ce moment. Ils savent que je passe des entretiens d'embauche et pendant ce temps mon travail avance pas et quand ils viennent me voir je suis pas en train de bosser. Toutes les conditions réunies pour me faire dégager en fait, et qui laissent à penser que je vais les quitter à la fin de mon contrat et que du coup je fous plus rien d'ici là (ce qui n'est absolument pas le cas).\n\nJ'en ai marre de cette pression de merde, marre de ne pas être encadré et marre qu'on sache que je suis en total pédalage de semoule sans que personne prennent la peine de venir me voir, et que lorsque je viens demander de l'aide j'ai l'impression de faire chier au plus haut point.\n\nCe projet me dégoûte de cette entreprise. C'est con."
		},
		{
			"post_id": 23,
			"title": "J'ai pas d'idée pour ce titre. Jugez pas",
			"date_published": 1502379437.2,
			"body": "Bon j'ai compris pourquoi le code la programmation tout ça mon problème d'avant (si c'est confus je vous demande pardon). \nEn fait le fait de cloner ça crée un lien avec les objets dans l'objet, et comme la date est un objet ben elle était liée aux changement. Voilà voilà. Du coup c'est réparé pour ce problème. \n\nMais mon moral a tout de même chuté depuis cette histoire de jours ouvrables (vous savez les jours qui ne sont ni des jours fériés ni des week-ends là). \n\nBref c'était juste pour vous tenir au courant et vous dire que la communauté StackOverflow m'a aidé sur ce coup là. Big up à toi Jon Stirling, dev PHP à RyuDigital."
		},
		{
			"post_id": 22,
			"title": "Invoquons Satan en PHP",
			"date_published": 1502357795.3,
			"body": "Je crois qu'il y a de la magie noire dans mon code... \n\nJ'ai une liste de 3 RTT que je récupère de la BDD, j'ai vérifié et tout est récupéré correctement.\nJ'utilise ces RTT dans une fonction, plus spécifiquement dans des `if`, mais sans les modifier, juste en vérification par rapport à des dates. \n\nEt là sans aucune raison, dans la même fonction mais après ces if, la date du dernier RTT de cette liste passe du 11/08/17 au 20/08/17. Soit je deviens fou, soit je me tape une anomalie impossible à prévoir dans ma version php ou je sais pas quoi :/\n\n```\nvar_dump($RTT_pris); // -------------------------------------------------------------------------------------\n// Algo that allows to separate in two arrays the conges w/ rtt and those w/o\nforeach ($conges as $conge) {\n    $count = 0;\n    foreach ($RTT_pris as $rtt) {\n        if ($rtt->getPrttDateDebutPose()<$conge->getCngDateDebut() || $poseRTTService->getDateLastDay($rtt)>$conge->getCngDateFin()) {\n            $count++;\n        }\n    }\n    if ($count == count($RTT_pris) && !in_array($conge, $conges_final)) {\n        array_push($conges_final, $conge);\n    } else {\n        array_push($conges_w_rtt, $conge);\n    }\n}\n\n// Stores the half days of a conge containing a RTT\nforeach ($conges_w_rtt as $cng) {\n    array_push($conges_part, $this->getCongeService()->getCongeByDemiJoursNoReverse($cng));\n} // Stores the RTT as half days for checking in the next algo, and putting all of those RTT in the final array to display\nvar_dump($RTT_pris); // ---------------------------------------------------------------------------------------\n```\n\nA quel moment la valeur de la date du dernier conge de la liste peut changer entre ces deux affichages ? Putain ! Si ça se trouve c'est tout con sauf que comme je suis sur ce projet depuis plusieurs mois je n'arrive pas à sortir les incohérences. J'en ai marre de ces congés bordel.\n\nAh et sinon j'ai eu une proposition d'embauche à 27000 brut aujourd'hui. Les 3 entreprises dans lesquelles j'ai postulé ont répondu positivement pour m'membaucher, il me manque plus que les modalités de contrat de la dernière et je pourrais faire un choix.\n\n**EDIT :**\nOk je sais d'où ça vient mais je sais pas pourquoi ça fait ça.\nJ'appelle une fonction pour avoir la date du dernier jour de RTT d'un RTT précis (puisque la date de fin n'est pas stockée dans la base) et cette même fonction en appelle une autre pour séparer les RTT en demi journées.\nEt donc je me demande comment la valeur de la date du dernier RTT d'une liste peut être modifiée alors que c'est fait dans une fonction extérieure et que sa valeur n'est pas censée remonter pour être altérée dans la donnée passée.\nSérieux ça me rend fou j'ai envie de me casser."
		},
		{
			"post_id": 21,
			"title": "Pourquoi réinventer la roue, et me demander d'inventer une couleur en même temps ?",
			"date_published": 1502274000.6,
			"body": "Oh bah dis donc ! Mais c'est que ça fonctionnait tout ça ! Et puis vous savez quoi ? Ben les RTT ne peuvent pas être le week-end et les jours fériés ! \nDonc je dois me retaper un algo qui va séparer un RTT en plusieurs parties si jamais il y a du week end ou du jour férié dedans. Nan parceque dans la base de données un RTT c'est  : date de début, nbre de jours. Va te démerder pour le découper en gérant les jours qui arrivent avec les changements de mois, d'années et en plus en évitant d'afficher les week ends et les congés.\n\nPourquoi il a fallu qu'il rajoutent les RTT ?! Pourquoi il a fallu qu'ils codent leur propre ERP ?! Putain mais ça me saoûle ce projet de meeeeeeerde !\n\nBonjour."
		},
		{
			"post_id": 15,
			"title": "Plus qu'un petit pas et mon pied pourra bronzer",
			"date_published": 1502191700.9,
			"body": "Bon, ça se passe plutôt bien. J'ai fini de tester tous les utilisateurs existants avec leurs congés/RTT et aucune erreur (enfin une petite mais j'ai pu la corriger). Maintenant on passe à la phase de test reloue où je dois tester des combinaisons cheloue et échanger des RTT avec des congés en espérant que tout fonctionne. Je le sens moyen ça, mais bon, ça se trouve ça va pas se passer trop mal et d'ici la fin de la journée ça fonctionnera, non ?"
		},
		{
			"post_id": 14,
			"title": "C'est là-bas la lumière, marchons encore un peu",
			"date_published": 1502181510.1,
			"body": "Hey !\n\nLe moral est peut être revenu.\nHier soir mon algo fonctionnait pour les congés de 2 utilisateurs différents, avec des RTT et tout le bordel. Là je suis en train de le tester pour tous les autres utilisateurs pour voir si il fait bien son taff, et c'est concluant pour le moment. Nice.\n\nMon algo est peut être faillible mais pour le moment tout se passe bien et je suis à 7 utilisateurs de testés sans aucune erreur. C'est un bon début et je suis content de moi :)\n\nSi vous voulez voir le magnifique diagramme d'une partie de mon algo c'est [ici](http://image.noelshack.com/fichiers/2017/32/2/1502181897-diagram.png).\n\nBref je vous tiens au courant mais franchement entrevoir la fin du tunnel après presque 2 mois d'errance dans le noir ça fait du bien."
		},
		{
			"post_id": 13,
			"title": "Super sous-merde, le retour",
			"date_published": 1502094915.433,
			"body": "Vous vous souvenez de mon diagramme et de mon algo ? Ouais. Ben il est toujours aussi bien sur papier, aucune faille, sauf que dès que je le code on se retrouve avec des boucles dans tous les sens, je sais pas quel congé est appelé, quand il doit être appelé et à quel moment on doit passer au suivant ni comment passer au suivant.\n\nDe retour au point de départ. C'est la loose. Je suis une sous-merde et j'ai aucun avenir dans la programmation. \n\nC'est un bon début de semaine ça."
		},
		{
			"post_id": 10,
			"title": "Peut-être la victoire ?",
			"date_published": 1501860492.338,
			"body": "J'ai réussi à modéliser un algo en diagramme et il a l'air plutôt solide. Sauf que le coder c'est pas aussi facile que le réfléchir. Au moins je vois quelque chose de plutôt stable pour le moment mais je vais sûrement me faire surpendre au final par un cas de figure que j'aurai pas envisagé.\n\nBref le but c'est de pas lâcher et de pas me faire engueuler par mon patron parce que j'arrive pas à avancer. J'y viendrai à bout ! (un jour...)"
		},
		{
			"post_id": 9,
			"title": "Le retour, le boulot, les plaintes",
			"date_published": 1501832538.973,
			"body": "Salut à tous, je suis rentré de ma semaine de vacances. Un jeudi soir. Et je bosse le vendredi. Ouais c'est con hein ?\n\nSinon c'était des vacances pas reposantes de ouf mais qui m'ont tout de même permis de me changer les idées. Sauf que là de retour devant cette liste de congés totalement fausse je suis totalement perdu et commence à regretter de ne pas avoir posé mon vendredi aussi...\n\nJe dois aussi parler à mon patron de la hausse du prix des transports en commun (dont il me rembourse la moitié) sauf que dans ma situation demander plus d'argent alors que le travaille ne suit pas ça le fait pas trop :/\n\nBref c'est reparti. Youpi."
		},
		{
			"post_id": 8,
			"title": "Mort par la fatigue",
			"date_published": 1501228629.728,
			"body": "Vous vous rappelez que je vous ai dit que j'étais **très** fatigué ?\nEh ben le test de l'autre boite m'a pris tellement de temps que j'ai fini par me coucher à 2h du mat. Je suis actuellement à l'état de zombie fatigué. C'est pour dire.\n\nLe test était pas si dur : fallait créer une classe PHP pour afficher avec une requête GET la météo de la ville choisie. Bon déjà mon PC a complètement pété un câble et mon serveur Apache étant d'une ancienne version (comme ma version PHP) je n'avais pas accès à certaines fonctionnalités. J'ai donc dû utiliser une fonction dégueu pour récupérer le JSON généré par une API (là c'est aussi le moment où j'ai dû apprendre à me servir d'une API).\nLe temps de mettre tout ça en place, de tester et de corriger il était plus d'une heure du mat', j'avais pas encore pris ma douche ni fait la vaisselle. Le bordel pour mon sommeil du coup.\nJe voulais aussi héberger l'appli pour que le gars qui m'a envoyé le test ait direct accès à une version live mais une des fonctions que j'ai utilisé n'était pas permise par mon hébergeur et donc ça m'enlevait cette possibilité d'épater.\nIl y avait aussi une deuxième question optionnelle au test mais *fuck it*, j'avais déjà les yeux qui brûlaient tels les flammes de l'enfer alors j'ai laissé tomber, pas le courage.\n\nDu coup j'attend la réponse (et celle de l'autre entreprise que je sais toujours pas quand je vais les rencontrer dans leurs locaux) et je vous tiens au courant.\nAujourd'hui re-boulot. Dernier jour avant le week-end et ma semaine de congé (du coup je serais pas présent hein, désolé), et aussi jour de retour de mon patron. Youpi (<- ça c'est ironique).\n\nBref portez-vous bien, et sûrement à vendredi prochain si je réécris pas dans la journée. Faites pas de bêtises."
		},
		{
			"post_id": 7,
			"title": "L'avenir un peu trop en jeu",
			"date_published": 1501141673.489,
			"body": "Plop. Je suis fatigué à mort. Pourtant j'ai dormi plus que d'habitude mais j'ai pas arrêté de me réveiller... Je pourrais ranger mon téléphone dans mes cernes putain...\n\nSinon l'entretien s'est bien passé, il me reste plus qu'un test de connaissances à réussir ce soir et ça devrait se faire, je vous tiens au courant. Cette entreprise m'attire pas mal, mais je serais cantonné à un éventail de technologies et de langages de programmation assez restreint, c'est le mauvais côté que je retiens de cette entrevue.\nEt je dois convenir d'une date d'entretien avec une autre entreprise après avoir passé un entretien téléphonique et également un test de connaissances pour eux. Bref c'est la semaine où mon avenir est en jeu. Difficile de calmer la pression.\n\nDe retour au boulot je dois maintenant trouver où mon algorithme ne fonctionne pas et pourquoi pas passer un autre mois à le corriger aussi."
		},
		{
			"post_id": 6,
			"title": "Futur radieux ?",
			"date_published": 1501078584.576,
			"body": "J'ai un entretien d'embauche ce soir. Pour une boite qui a l'air bien sympa. Sauf que même si le projet sur lequel je suis me dégoûte au plus haut point, j'aime mon entreprise actuelle et ce qu'elle a fait pour moi. Donc je ne suis pas sûr de la quitter suite à cet entretien. \n\nFaut vraiment que j'arrête de venir ici, ça me coupe dans mon travail et j'arrive encore moins à travailler...\n\n**Edit** : Je crois avoir un algorithme qui fonctionne. Le code est dégueulasse mais du peu que j'ai pu tester ça fonctionne. Faut juste que je pousse un peu plus les cas de test mais sinon c'est plutôt une bonne nouvelle. Je ferais ça demain. "
		},
		{
			"post_id": 5,
			"title": "Intranet de mort",
			"date_published": 1501063998.784,
			"body": "Dans le dernier post je vous parlais de mon boulot sur l'intranet, comme quoi je devais gérer des congés ou un truc comme ça.\n\nEn fait plus concrètement ça consiste à afficher les RTT en plus des congés mais si je rentre dans les détails ça va trop être un bordel et ce post va durer une centaine de lignes (presque autant que mon algorithme).\n\nDonc je galère, je fais des boucles dans des boucles, des `if` partout et rien n'a de sens considérant qu'à la fin ça ne fonctionnera pas et que je devrais recommencer ce qui m'a demandé une semaine de travail.\n\nJe suis démoralisé et démotivé. J'ai besoin de vacances et de changer de projet. Mon patron revient dans 2 jours et ça ne fonctionnera toujours pas. On dirait que ce contrat de CDI va me passer sous le nez."
		},
		{
			"post_id": 3,
			"title": "Bordel c'est long une journée, sauf quand c'est trop court",
			"date_published": 1500984409,
			"body": "Il est... 14h07 et j'en ai marre.\n\nJe préfère trainer sur ZeroNet et écrire cet article plutôt que de faire ce pourquoi je suis payé, à savoir programmer un putain d'intranet qui gère les congés de tous les employés.\n\nÇa m'intéresse pas, ça me fait chier et j'arrive pas à me concentrer de toute manière. J'ai un entretien d'embauche pour une boîte sympa demain soir et un test de connaissances jeudi pour une autre boîte. Elles veulent mon corps ça c'est moi qui vous le dis.\n\nCe soir c'est le pot de départ de 2 employés. Ils ont bien compris que la ville dans laquelle on bosse c'est bien de la merde et ont décidé de se barrer en partie à cause de ça. Good call.\nDu coup je vais rentrer tard et je vais avoir envie de rattraper ce que j'aurais pas fait pour me détendre et je vais encore dormir beaucoup trop peu. Chienne de vie (ouais, même si je peux m'en prendre qu'à moi même).\n\nAllez on se dit à la prochaine. Portez-vous bien."
		},
		{
			"post_id": 2,
			"title": "Au commencement était le blog",
			"date_published": 1500974867,
			"body": "Bonjour à tous,\n\nMe voici dans cette nouvelle aventure où je pourrais vous parler de tout, que ce soit mes pensées ou mes actions, et ça sans craindre personne, aucune censure, ou même les personnes que je risque de viser dans mes propos.\n\nJ'aime déjà cet endroit. À bientôt !"
		}
	]
}