{
	"next_comment_id": 7,
	"user_name": "Marcusfinch",
	"hub": "1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL",
	"post_like": {
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1597665490": 1597803048,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661": 1597981998
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "For storage, depending what OS you're on, compressing the zeronet data directories should help.  I would guess you thought of this already, though.  Was the compression not enough to help?\n\nI've just started to learn the zeronet code, but from what I've seen so far, there is a lot of ram used for tracking.   To reduce ram, that could be moved to backing store (e.g., a database), but then the net might run slower.  Also, I'm not sure how efficient python is with certain things.  It may be a lower-level language like C++ could make more efficient use of RAM.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1591783547",
			"date_added": 1597135334
		},
		{
			"comment_id": 2,
			"body": "I've still been thinking about this issue.  Would getting a RaspberryPi and configuring it as a Zeronet proxy fix it?  It's spending a few bucks, but having a dedicated device to offload zeronet from you laptop may make sense and would be cheaper than a newer laptop.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1591783547",
			"date_added": 1597387349
		},
		{
			"comment_id": 3,
			"body": "LMAO",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1597665490",
			"date_added": 1597803058
		},
		{
			"comment_id": 4,
			"body": "Glad to see you're back.  Even though we've never spoken, I've been learning a lot from your many posts.  Hope things are going better for you now.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661",
			"date_added": 1597982032
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: Me too!  I read your last post on the memory and storage usage.  Can you post what's using most of the storage, etc.?  I like to work on behind-the-scenes / platform code, so I'm interested in helping to address these problems if possible.  Thanks!",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661",
			"date_added": 1598146860
		},
		{
			"comment_id": 6,
			"body": "@Kaffie: Thanks for replying!  Yeah, I don't see a way around videos, but it might be possible to reduce the db/cached data.  For large datasets like videos, I wonder if it would be useful to allow users to set a water level and then a \"garbage collector\" could clean up older data for systems with small storage.  For people who have large storage, they can set it much higher.\n\nI've also wondered if it should use parity files like in the old USENET days.  Smaller storage systems could contribute by storing parity files (which take less space) and then if something is missing, the parity file could be requested so the file could be completed.\n\nFinally, with that much storage use it will be difficult to have mobile clients.  Even if someone puts a 256GB card in their phone they won't be able to serve that much data.  So I think it would be good to solve this problem in the general case.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661",
			"date_added": 1598235309
		}
	]
}