{
	"next_topic_id": 25,
	"topic": [
		{
			"topic_id": 1522520276,
			"title": "——做一个有思想的中国人",
			"body": "家事国事天下事，事事关心。\n\n我的站点achinese.bit：\n\n[Talk 论坛](http://127.0.0.1:43110/talk.achinese.bit)\n\n[Blog 博客](http://127.0.0.1:43110/blog.achinese.bit)\n\n [Zero me社交网络](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q/achinese@zeroid.bit)\n",
			"added": 1522520275
		},
		{
			"topic_id": 1522520546,
			"title": "环境话题",
			"type": "group",
			"body": "",
			"added": 1522520544
		},
		{
			"topic_id": 1522527073,
			"title": "时事话题",
			"type": "group",
			"body": "",
			"added": 1522527070
		},
		{
			"topic_id": 1522527088,
			"title": "政治话题",
			"type": "group",
			"body": "",
			"added": 1522527084
		},
		{
			"topic_id": 1522528350,
			"title": "废除主席任期限制的下一步会是什么呢？",
			"body": "",
			"added": 1522528344,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522528693,
			"title": "最近的大气排放标准很严格啊",
			"body": "",
			"added": 1522528686,
			"parent_topic_uri": "1522520546_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522528754,
			"title": "金三胖的旋风外交",
			"body": "颇有中美当年建交的风采。",
			"added": 1522528746,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522528806,
			"title": "今年的雾霾少了很多",
			"body": "",
			"added": 1522528797,
			"parent_topic_uri": "1522520546_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522529922,
			"title": "在中国司法独立有用么？",
			"body": "看到curiousguy的一个回复，觉得很有道理。\n\n不采用民主体制，不存在司法独立。\n\n现在是权权勾结，共党官员可以以党委的名义命令法院院长胡乱判案，由此造成司法不公大家有目共睹。\n\n就有人认为如果司法独立出来，不受党委的挟制，司法就会公正。这种想法同样可笑。法官就算获得皇帝一样的独立裁决权，他毕竟也是一个人，是人就可以被收买。以前是有人用权力压迫他胡乱判案，可以视为权力收买。假如权力收买的渠道消失，它同样可以被金钱或其它利益收买。例如碰到富商和穷人打官司的情况，富商显然有钱去收买法官，做出不公正的判决（不要提醒我存在监督机构，监督机构的负责人也是可以收买的）。\n\n因此，司法独立，和司法受党管辖，其实毫无差别。对于弱势的百姓而言，官官相护造成的不公和官商勾结造成的不公，对自己都是同样的不公。\n\n那么，就有人反对我了，既然人人都可以被收买，那么世界上不就不存在公正了吗？\n\n我的回答是，公正还是可能存在的，但只有民主，才能实现公正。\n\n美国的法官无权裁决嫌疑人是否有罪，有无罪的裁决是陪审团作出的，法官只能在陪审团裁决被告有罪的情况下，依据适用的法律条款给被告量刑。陪审团就是普通民众，美国公民通过简单的素质测验之后获得预备陪审员资格。美国的法院会随机传召当地的预备陪审员出庭陪审，原被告双方的律师都有权筛掉预备陪审员中他们认为会对对方有利的具体人员。这种制度下打官司，收买法官绝无意义，因为法官无权决定胜负，就算收买法官的目的是为了重罪轻刑或轻罪重刑，但那只会导致法官成为被告的另一场官司，而对最终的司法公正影响不大。收买陪审团成员是有意义的，但是缺乏可操作性，每一庭的陪审团成员都是临时决定的，无人可预知。想要做到收买陪审团成员，只能在平常的时候对所有的公民示好，才能收买到，但是那样不就是打造社会和谐吗，当然是好事。因此在美国，无论是民与官争还是民与商争，都不大会出现司法不公的结果。\n\n这就是民主公正。",
			"added": 1522529912,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522538168,
			"title": "我用俺们村的现状 解释房地产引起的经济危机",
			"body": "俺们这个村，以前有种菜卖菜的、有养猪卖肉的、有种粮卖大米的、有种果树卖果子的、有开厂生产家电的、有村长修房卖房的。\n\n　　其中，种菜的种2万斤能卖2万元。养猪2千斤能卖2万元。种粮卖大米的1万斤能卖2万元。种水果5千斤能卖2万元，开木材厂的一年也能能产5万元。村上的铺子价格也合理，一年房租几千块，不管是卖菜的，还是卖肉的都能接受，都有自己合理的利润。\n\n　　总之这个村应有尽有，一直能保持平衡发展，大家各司其职、各尽其才。产品互相买卖，有肉、有饭、有水果吃、有家电用、有房子住。日子一天比一天过得的好，余钱也一天比一天多。\n\n\n　　但是，突然有一天来了一个建房子的，在村子里修了很多房子，告诉大家可以来买，如果钱不够，可以由村长出面帮忙到钱行去借，于是就有人买了，第一年卖10万一套，卖肉的买了，欠了8万。第二年卖20万一套，卖米的急了，看着卖肉的赚了，也买了，欠了15万。第三年卖50万一套，卖果子的也买了，欠了40万。\n\n　　就这样村里有能力的人都买了高价房，那个建房子的是赚大发了啊，不但把他们以前的积蓄赚了，还让他们后20年赚的钱都源源不断的流给自己。于是卖肉的卖了钱，不敢像以前一样买家电，买水果，赚了一点钱后就还给村里银行了。其他的也是这样，卖了一点钱就还一点。\n\n　　因为很多人都买卖起了房子，并且这些房子都在涨价，于是渐渐的主业都不做了，而且稍微有点钱就得去还银行，结果卖肉的卖不出去了，卖菜的也卖不出去了，卖家电的也卖不出去了。因为大家都没钱了啊，买不了啊，即使有赚了点钱还得还给村里的银行啊，但是还是开心的，因为房子在升值啊！大家眼巴巴着看着房子升值，然后皆大欢喜。\n\n　　此时村上的铺子租金也水涨船高，一年比一年贵。卖了的菜钱还不够铺子租金。所以一边是种果子的卖不了钱，一边是村上的果子一年比一年贵，并且还不好卖。\n\n　　到了最后，整个村子里只有那个建房子的人发财了，其它人日子都过的干巴巴的。虽然他可以随便消费，但是他一家人能吃多少、能用多少啊？村子里大量的产品都卖不出去啊。\n\n　　于是俺们村现在是这样的情况。各行各业都产能正常，就是产品卖不出去。卖肉的肉很多，但卖不出去，但也没钱买米。卖家电的家电很多，但卖不出去，也没钱买菜啊。即使卖出去一点，除了最基本的生活其他也不敢买啊，因为欠着村长里银行的钱啊。\n\n　　后来，村上生产木材的工人也只能回家了，因为家电卖不出去，发不了工资。\n\n　　工人回村后地也没了，因为前几年被征去修房子了，很多人开始无所事事起来：买了房子的一直在坐等房价坐地升天，没有买房子的也不知道能干什么好。\n\n　　后来村上卖果子的，只能把果子倒河里了啊，因为大家都没钱消费，加上村上的商铺和运费太贵，果子的价格一低再低，原先批发出去1元1斤的果子，现在批发出去1毛钱1斤，但加上运费5毛1斤，铺面费2元1斤。村上其他人买到手也要2.6元1斤啊。\n\n　　一方面是种果子的被逼得把果子倒河里，一方面是其他村民没钱消费，价格太贵，怎么办啊啊？果农果子卖不了，只能自己饿了吃自己的果子，没钱买其他的了，没钱买肉了，没钱买米了。\n\n　　不管是卖肉的最先花10万买房子的，还是卖菜的花30万买房子的，还是最后卖果子的花50万买村长房子的，他们都是可悲的，因为房子只有2万的成本。那个外来的卖房子的才是最大的得利者。\n\n　　此时大家开始互相找心理安慰和快感。比如卖肉的10万买的的房，欠了8万，他的优越感在于他看到卖果子的花了50万买的房，他觉得自己处境要好多了。\n\n　　所以现在看起来村里产品都是过剩的，真的过剩嘛？其实不是，想买车的很多吧，为什么不买呢，因为还欠着钱行的几十上百万钱呢。\n\n　　后来，村长召集大家开会，说出现这一切的原因是大家手里没有钱了，于是表示要钞票，而且释放流动性，降低贷款利率，刺激货币流通。但关键问题是，每次印的钱，不是跑到了外来建房子的人手里，就是跑到那几户恶霸手里……\n\n来自- 头条ABC",
			"added": 1522538157,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522541977,
			"title": "唐努乌梁海 - 丢失的领土",
			"body": "【国家领土到底在不在竟然成了机密】唐努乌梁海，面积约17万平方公里，是有中俄条约承认的中国合法领土，1944年被苏联非法侵占，划为苏联领土，现为俄罗斯控制。2018年3月7日，曾在2004年登上过钓鱼岛的退役军人、独立研究者殷敏鸿为俄占领土唐努乌梁海的信息公开问题，通过邮政挂号信向北京市第三中级人民法院邮寄了行政起诉状，被告是外交部。\n\n殷敏鸿的诉求是，想知道“1949年以后，中华人民共和国政府有没有与苏联政府，俄罗斯政府签订过条约，正式承认唐努乌梁海地区为苏联领土或俄罗斯领土？中苏、中俄有没有签订边界条约、协定、议定书规定唐努乌梁海地区的中苏、中俄边界？中蒙有没有签订边界条约、协定、议定书规定唐努乌梁海地区的中蒙边界？”。\n\n转载至零网",
			"added": 1522541965,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522542569,
			"title": "江棋生：新极权，还是翘起尾巴的后极权？",
			"body": "这段话说得好：“国人日益增长的权利意识和公民精神与被强行按上的臣民角色之间的矛盾，或国人日益增长的当家作主的意愿与被强制安排的跟屁虫角色之间的矛盾，迟早会成为社会的主要矛盾。”\n\n原文如下：\n\n关于习近平上位以来搞新极权的说法，我虽早有所闻且难于苟同，但直到写作《重读零八宪章》一文，我也只是点到为止，没有正面给出自己的明确见解。近日，相继读到冯崇义先生的断言：习近平“想把中国从邓小平的后极权主义带回极权主义社会”，和张博树先生的描述：宪政自由主义者将“习近平新时代”称之为“习近平新极权主义时代”，终于使我下决心公开言说自己思索良久的一些不同看法。\n\n应当说，自2012年11月中共十八大到2017年10月中共十九大，习近平所干的以下三件事，与邓（江胡）时代的路数是有显著区别的。一是外交上不再韬光养晦，而是一步步从锋芒外露到锋芒毕露。二是政治上从“要警惕右，但主要是防止‘左’”，到主要是防右反右。相应地，意识形态上不再取守势，而是搞“自卫反击”，重树马克思主义主旋律，重夺思想阵地话语权，公然下令“七不讲”。三是边撸起袖子加大选择性反腐力度，边让个人崇拜之风在中共党内死灰复燃，卷土重来。其中最为肉麻和令人恶心的颂圣谀词，乃出自北京市委书记蔡奇、天津市委书记李鸿忠和国防部长常万全等马屁精之口。\n\n然而，上述三大区别能表明习近平搞的是新极权吗？\n\n我的看法是，不能。\n\n我的理由是，习近平在言论和行动上都没有反对和告别邓（江胡）的改革开放政策：他没有反改革，试图从半吊子市场经济即“社会主义市场经济”返回计划经济；他也没有反开放，意图重新闭关锁国。而正是邓主张的改革开放，使中国从毛时代毫无政治、经济和社会多元化的极权主义社会，走向邓时代政治一元化、经济和社会呈现有限多元化的后极权社会。习近平既在所谓“旨在坚持和完善社会主义制度”的改开大计上沿袭邓（江胡），未敢造次而邓规习随，那么他上位以来所搞的，就显然不是新极权。\n事实上，习近平所搞的，还是后极权。更精准地说，他搞的是：在外部因素和其性格因素共同作用下，自鸣得意地翘起了尾巴的后极权。我的这一“翘尾后极权”说法，与沈大伟教授给出的“硬威权主义”概念，或可称异曲而同工。上世纪90年代初，邓小平提出“韬光养晦、有所作为”，是为了使冷战结束后处于弱势不利地位的中国能够站住脚跟，并通过“发展是硬道理”徐图将来。到了比胡锦涛明显强势的习近平任上，由于中国在经济总量上已成全球老二，加上发达国家总体上搞绥靖主义等因素，中国的后极权政体认为机不可失，可以适时冒泡、牛起来了，于是公开告别邓小平的“韬光养晦”谋略，对外毫不隐讳地宣示“大国崛起”，亮名片，搞推销，展拳脚，疾步趋近世界舞台中心；对内则更加宁“左”勿右，除了对民间觉醒者的维权和抗争之管控、打压更为严厉和凶狠外，还发明了让人尊严扫地的歧视性“低端人口”标签，将一部分温顺无助的国民悍然排除在人类命运共同体之外。\n那么，中共十九大之后拥有“领袖和统帅”头衔的习近平，会搞新极权吗？\n\n我的看法是，依然不会。\n\n我的理由是，习近平如果要搞新极权，那就要反邓小平改开路数而行之，把已有的经济、社会有限多元化一一抹掉。这对习来说，首先不是能否做成的问题，而是想不想干的问题。在我看来，习还不至于不明白，没有上述有限多元化，哪会有今天官媒上自夸不已的“辉煌中国”？哪会有他在一带一路上大撒币的底气和牛气？而没有上述有限多元化，中共又如何“决胜全面建成小康社会”？如何实现所谓“两个一百年的宏伟目标”？\n\n因此我认为，他不会搞。当然，如果他的确如冯胜平所企盼的是“浑人”一个，“虽千万人吾往矣”，愣是要搞新极权，那也是注定搞不成的（此处不赘）。\n\n中共十九大之后的习近平，还是会照搞后极权。对于这一点，从他在十九大报告中列出的“建设新时代”十四条基本方略，人们可以看得清清楚楚。有人误以为习近平要搞新极权，我觉得是多少看走眼了。而真正完全看走眼的，当数那些至今还对习近平会改旗易帜搞宪政抱有幻想的人。习近平上位以来的言论和行动，充分表明了他与宪政的势不两立，表明了他是铁了心要将宪政拒之门外的死磕派。而那些怀揣玫瑰梦的人，居然对这一朗若白昼的事实视而不见。\n\n质言之，毛泽东的社会主义，是极权主义。加上“中国特色”限定词的社会主义，则是后极权主义。而所谓“习近平新时代中国特色社会主义”，就是习近平新时代后极权主义，即翘起尾巴的后极权主义。\n\n作为极权主义变种的后极权主义，与极权主义一样有个内在的致命伤，那就是对人权的蔑视。这种政体不忘初心，坚持将国人视为只能听它话、跟它走的跟屁虫，不能具有独立人格和自由思想，更无资格当家作主。在这样的政体下，国人日益增长的权利意识和公民精神与被强行按上的臣民角色之间的矛盾，或国人日益增长的当家作主的意愿与被强制安排的跟屁虫角色之间的矛盾，迟早会成为社会的主要矛盾。而在这一主要矛盾的凸显、激化和加剧中，越来越多觉醒了的民众必将成为制度变革的伟大力量；这种伟力除了会使后极权政体翘起的尾巴抖落下来外，还必定会将后极权政体打包送进历史的博物馆。\n\n2017年11月29日 于\n江苏常熟\n（自由亚洲电台11月30日播出）",
			"added": 1522542556,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522542810,
			"title": "网转中国社会十大怪",
			"body": "第一怪：小偷反腐成常态；\n第二怪：吃的喝的都有害；\n第三怪：发飙都是官二代；\n第四怪：贪官太多情妇害；\n第五怪：回扣不够拒门外；\n第六怪：歪门邪道来钱快；\n第七怪：真相处处被掩盖；\n第八怪：房价疯涨难下来；\n第九怪：投诉无门遭人揣；\n第十怪：诺言反成大祸害。",
			"added": 1522542796,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522575446,
			"title": "天宫一号，可控还是失控？",
			"body": "欧洲宇航局预测今天下午进入大气层，明天上午着陆。\n\n2年前天宫一号就失去联系，当外媒揭露的时候。党的航天局说还在可控的情况下返回地面。\n\n一转眼，见证奇迹的时刻到了。可控还是失控，看看会打谁的脸！",
			"added": 1522575431,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522584845,
			"title": "美韩两国军队将展开代号为“鹞鹰”（Foal Eagle）的联合军演",
			"body": "4月1日，美韩两国军队将展开代号为“鹞鹰”（Foal Eagle）的联合军演。媒体报导说，美国海军两栖攻击舰黄蜂号（USS Wasp）将参加本次军演，黄蜂号远征打击群拥有航母战斗群的威力。",
			"added": 1522584828,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522585542,
			"title": "惊人调查结果：饮用水都受到微塑料污染",
			"body": "（德国之声中文网）从纽约到新德里，全世界水龙头中流出的自来水都含有只能通过显微镜才能看到的小塑料颗粒。这是位于美国华盛顿一家公益互联网通讯社(Orb Media)调查研究的结果。\n\n当家中的自来水经检测发现含有微塑料物质之后，生活在厄瓜多尔基多市的61岁居民诺罗纳（Mercedes Noroña）说：\"这很糟糕。\"\"或许这样说有些夸张，但是水中含有这些东西真的令人恐惧。\"\n\n最近的调查结果表明，微塑料不仅污染了海洋，也污染了淡水源，土壤和空气。这次研究再次表明，全球人类赖以生存的自来水管道的水源都含有微塑料。\n\n此次调查对全球五大洲多个城市进行了150多次自来水检测。其中83%的自来水含有微塑料成分。此次调查主要是检测自来水中是否含有微塑料。只要水中有极少的塑料纤维，检测结果就会呈阳性。这项研究没有说明可能的毒理学发现。换句话说，17％的样品不含任何塑料成分 - 而且是没有一点塑料纤维。\n\n最近的调查结果表明，微塑料不仅污染了海洋，也污染了淡水源，土壤和空气\n\n尽管如此调查报告的作者警告说，如果合成纤维存在于自来水中，它们也可能存在于食品中，例如面包和婴儿食品。\n\n专家们估计，它们来自合成纤维纺织品，地毯和家具。然而不清楚的是，这些塑料纤维是如何进入自来水管道的以及对人体健康有哪些风险。\n\n风险究竟有多大？\n\n专家们认为，进入人体的塑料纤维也可以污染环境。英国普利茅斯大学的海洋生物学家理查德·汤普森（Richard Thompson）说，动物实验清楚地表明：\"是塑料释放了这些化学物质，而消化道中的条件甚至可以加速其释放。\"\n\n微塑料研究员兼网络通讯社Orb Media的调查负责人马森（Sherri Mason）说，塑料也使动物世界受到影响。她列举了一些调查数据。她说：\"有足够的理由对此感到担忧。如果说微塑料给动物造成污染，我们又怎么能相信，塑料没有给我们的健康造成影响呢？\"\n\n香港教育大学的环境科学家林柯芬（Lincoln Fok）说，目前人们对这一问题还不清楚。\"有关微型塑料对人体健康影响的研究还处于初级阶段。\"\n\n充满塑料的世界\n\n如今人类饮用的所有自来水中都或多或少的含有塑料纤维。纽约特朗普大厦内的特朗普烧烤餐厅的自来水中检测到的微塑料含量与印尼雅加达的自来水检测结果相同。瓶装饮用水和家庭中经过过滤的纯净水中都含有微塑料。\n\n在美国，自来水中的塑料含量没有限制。但是欧盟规定自来水不能含有其它杂质。尽管如此自来水都含有塑料纤维。来自美国和黎巴嫩首都贝鲁特的自来水采样中，含有微型塑料颗粒的水样占94%。在新德里有82%的自来水采样含有微塑料，乌干达坎帕拉的水样占81%，雅加达占76%，基多占75%，欧洲平均占72%的自来水采样含微塑料。\n\n负责在贝鲁特采集自来水水样的水利工程师哈瓦（Hussam Hawwa）说：\"这项调查只是触及了表面。\"\"不过该调查似乎已经引起人们的普遍关注。\"\n\n李京慧/达扬 (德新社、法新社、路透社)\n",
			"added": 1522585524,
			"parent_topic_uri": "1522520546_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522685345,
			"title": "China Topics",
			"type": "group",
			"body": "About China",
			"added": 1522685326
		},
		{
			"topic_id": 1522742781,
			"title": "Welcome to discuss China in English",
			"body": "I can answer your questions about China at my best knowledge.",
			"added": 1522742761,
			"parent_topic_uri": "1522685345_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522750730,
			"title": "零八宪章全文 （刘晓波等）",
			"body": "一、前言\n\n今年是中国立宪百年，《世界人权宣言》公布60周年，“民主墙”诞生30周年，中国政府签署《公民权利和政治权利国际公约》10周年。在经历了长期的人权灾难和艰难曲折的抗争历程之后，觉醒的中国公民日渐清楚地认识到，自由、平等、人权是人类共同的普世价值；民主、共和、宪政是现代政治的基本制度架构。抽离了这些普世价值和基本政制架构的“现代化”，是剥夺人的权利、腐蚀人性、摧毁人的尊严的灾难过程。21世纪的中国将走向何方，是继续这种威权统治下的“现代化”，还是认同普世价值、融入主流文明、建立民主政体？这是一个不容回避的抉择。\n\n19世纪中期的历史巨变，暴露了中国传统专制制度的腐朽，揭开了中华大地上“数千年未有之大变局”的序幕。洋务运动追求器物层面的进良，甲午战败再次暴露了体制的过时；戊戌变法触及到制度层面的革新，终因顽固派的残酷镇压而归于失败；辛亥革命在表面上埋葬了延续2000多年的皇权制度，建立了亚洲第一个共和国。囿于当时内忧外患的特定历史条件，共和政体只是昙花一现，专制主义旋即卷土重来。器物模仿和制度更新的失败，推动国人深入到对文化病根的反思，遂有以“科学与民主”为旗帜的“五四”新文化运动，因内战频仍和外敌入侵，中国政治民主化历程被迫中断。抗日战争胜利后的中国再次开启了宪政历程，然而国共内战的结果使中国陷入了现代极权主义的深渊。1949年建立的“新中国”，名义上是“人民共和国”，实质上是“党天下”。执政党垄断了所有政治、经济和社会资源，制造了反右、大跃进、文革、六四、打压民间宗教活动与维权运动等一系列人权灾难，致使数千万人失去生命，国民和国家都付出了极为惨重的代价。\n\n二十世纪后期的“改革开放”，使中国摆脱了毛泽东时代的普遍贫困和绝对极权，民间财富和民众生活水平有了大幅度提高，个人的经济自由和社会权利得到部分恢复，公民社会开始生长，民间对人权和政治自由的呼声日益高涨。执政者也在进行走向市场化和私有化的经济改革的同时，开始了从拒绝人权到逐渐承认人权的转变。中国政府于1997年、1998年分别签署了两个重要的国际人权公约，全国人大于2004年通过修宪把“尊重和保障人权”写进宪法，今年又承诺制订和推行《国家人权行动计划》。但是，这些政治进步迄今为止大多停留在纸面上；有法律而无法治，有宪法而无宪政，仍然是有目共睹的政治现实。执政集团继续坚持维系威权统治，排拒政治变革，由此导致官场腐败，法治难立，人权不彰，道德沦丧，社会两极分化，经济畸形发展，自然环境和人文环境遭到双重破坏，公民的自由、财产和追求幸福的权利得不到制度化的保障，各种社会矛盾不断积累，不满情绪持续高涨，特别是官民对立激化和群体事件激增，正在显示着灾难性的失控趋势，现行体制的落伍已经到了非改不可的地步。\n\n二、我们的基本理念\n\n当此决定中国未来命运的历史关头，有必要反思百年来的现代化历程，重申如下基本理念：\n\n自由：自由是普世价值的核心之所在。言论、出版、信仰、集会、结社、迁徙、罢工和游行示威等权利都是自由的具体体现。自由不昌，则无现代文明可言。\n\n人权：人权不是国家的赐予，而是每个人与生俱来就享有的权利。保障人权，既是政府的首要目标和公共权力合法性的基础，也是“以人为本”的内在要求。中国的历次政治灾难都与执政当局对人权的无视密切相关。人是国家的主体，国家服务于人民，政府为人民而存在。\n\n平等：每一个个体的人，不论社会地位、职业、性别、经济状况、种族、肤色、宗教或政治信仰，其人格、尊严、自由都是平等的。必须落实法律面前人人平等的原则，落实公民的社会、经济、文化、政治权利平等的原则。\n\n共和：共和就是“大家共治，和平共生”，就是分权制衡与利益平衡，就是多种利益成分、不同社会集团、多元文化与信仰追求的群体，在平等参与、公平竞争、共同议政的基础上，以和平的方式处理公共事务。\n\n民主：最基本的涵义是主权在民和民选政府。民主具有如下基本特点：（1）政权的合法性来自人民，政治权力来源于人民；（2）政治统治经过人民选择，（3）公民享有真正的选举权，各级政府的主要政务官员必须通过定期的竞选产生。（4）尊重多数人的决定，同时保护少数人的基本人权。一句话，民主使政府成为\"民有，民治，民享\"的现代公器。\n\n宪政：宪政是通过法律规定和法治来保障宪法确定的公民基本自由和权利的原则，限制并划定政府权力和行为的边界，并提供相应的制度设施。\n\n在中国，帝国皇权的时代早已一去不复返了；在世界范围内，威权体制也日近黄昏；公民应该成为真正的国家主人。祛除依赖“明君”、“清官”的臣民意识，张扬权利为本、参与为责的公民意识，实践自由，躬行民主，尊奉法治，才是中国的根本出路。\n\n三、我们的基本主张\n\n借此，我们本着负责任与建设性的公民精神对国家政制、公民权利与社会发展诸方面提出如下具体主张：\n\n1、修改宪法：根据前述价值理念修改宪法，删除现行宪法中不符合主权在民原则的条文，使宪法真正成为人权的保证书和公共权力的许可状，成为任何个人、团体和党派不得违反的可以实施的最高法律，为中国民主化奠定法权基础。\n\n2、分权制衡：构建分权制衡的现代政府，保证立法、司法、行政三权分立。确立法定行政和责任政府的原则，防止行政权力过分扩张；政府应对纳税人负责；在中央和地方之间建立分权与制衡制度，中央权力须由宪法明确界定授权，地方实行充分自治。\n\n3、立法民主：各级立法机构由直选产生，立法秉持公平正义原则，实行立法民主。\n\n4、司法独立：司法应超越党派、不受任何干预，实行司法独立，保障司法公正；设立宪法法院，建立违宪审查制度，维护宪法权威。尽早撤销严重危害国家法治的各级党的政法委员会，避免公器私用。\n\n5、公器公用：实现军队国家化，军人应效忠于宪法，效忠于国家，政党组织应从军队中退出，提高军队职业化水平。包括警察在内的所有公务员应保持政治中立。消除公务员录用的党派歧视，应不分党派平等录用。\n\n6、人权保障：切实保障人权，维护人的尊严。设立对最高民意机关负责的人权委员会，防止政府滥用公权侵犯人权，尤其要保障公民的人身自由，任何人不受非法逮捕、拘禁、传讯、审问、处罚，废除劳动教养制度。\n\n7、公职选举：全面推行民主选举制度，落实一人一票的平等选举权。各级行政首长的直接选举应制度化地逐步推行。定期自由竞争选举和公民参选法定公共职务是不可剥夺的基本人权。\n\n8、城乡平等：废除现行的城乡二元户籍制度，落实公民一律平等的宪法权利，保障公民的自由迁徙权。\n\n9、结社自由：保障公民的结社自由权，将现行的社团登记审批制改为备案制。开放党禁，以宪法和法律规范政党行为，取消一党垄断执政特权，确立政党活动自由和公平竞争的原则，实现政党政治正常化和法制化。\n\n10、集会自由：和平集会、游行、示威和表达自由，是宪法规定的公民基本自由，不应受到执政党和政府的非法干预与违宪限制。\n\n11、言论自由：落实言论自由、出版自由和学术自由，保障公民的知情权和监督权。制订《新闻法》和《出版法》，开放报禁，废除现行《刑法》中的\"煽动颠覆国家政权罪\"条款，杜绝以言治罪。\n\n12、宗教自由：保障宗教自由与信仰自由，实行政教分离，宗教信仰活动不受政府干预。审查并撤销限制或剥夺公民宗教自由的行政法规、行政规章和地方性法规；禁止以行政立法管理宗教活动。废除宗教团体（包括宗教活动场所）必经登记始获合法地位的事先许可制度，代之以无须任何审查的备案制。\n\n13、公民教育：取消服务于一党统治、带有浓厚意识形态色彩的政治教育与政治考试，推广以普世价值和公民权利为本的公民教育，确立公民意识，倡导服务社会的公民美德。\n\n14、财产保护：确立和保护私有财产权利，实行自由、开放的市场经济制度，保障创业自由，消除行政垄断；设立对最高民意机关负责的国有资产管理委员会，合法有序地展开产权改革，明晰产权归属和责任者；开展新土地运动，推进土地私有化，切实保障公民尤其是农民的土地所有权。\n\n15、财税改革：确立民主财政和保障纳税人的权利。建立权责明确的公共财政制度构架和运行机制，建立各级政府合理有效的财政分权体系；对赋税制度进行重大改革，以降低税率、简化税制、公平税负。非经社会公共选择过程，民意机关决议，行政部门不得随意加税、开征新税。通过产权改革，引进多元市场主体和竞争机制，降低金融准入门槛，为发展民间金融创造条件，使金融体系充分发挥活力。\n\n16、社会保障：建立覆盖全体国民的社会保障体制，使国民在教育、医疗、养老和就业等方面得到最基本的保障。\n\n17、环境保护：保护生态环境，提倡可持续发展，为子孙后代和全人类负责；明确落实国家和各级官员必须为此承担的相应责任；发挥民间组织在环境保护中的参与和监督作用。\n\n18、联邦共和：以平等、公正的态度参与维持地区和平与发展，塑造一个负责任的大国形象。维护香港、澳门的自由制度。在自由民主的前提下，通过平等谈判与合作互动的方式寻求海峡两岸和解方案。以大智慧探索各民族共同繁荣的可能途径和制度设计，在民主宪政的架构下建立中华联邦共和国。\n\n19、转型正义：为历次政治运动中遭受政治迫害的人士及其家属，恢复名誉，给予国家赔偿；释放所有政治犯和良心犯，释放所有因信仰而获罪的人员；成立真相调查委员会，查清历史事件的真相，厘清责任，伸张正义；在此基础上寻求社会和解。\n\n四、结语\n\n中国作为世界大国，作为联合国安理会五个常任理事国之一和人权理事会的成员，理应为人类和平事业与人权进步做出自身的贡献。但令人遗憾的是，在当今世界的所有大国里，唯独中国还处在威权主义政治生态中，并由此造成连绵不断的人权灾难和社会危机，束缚了中华民族的自身发展，制约了人类文明的进步──这种局面必须改变！政治民主化变革不能再拖延下去。\n\n为此，我们本着勇于践行的公民精神，公布《零八宪章》。我们希望所有具有同样危机感、责任感和使命感的中国公民，不分朝野，不论身份，求同存异，积极参与到公民运动中来，共同推动中国社会的伟大变革，以期早日建成一个自由、民主、宪政的国家，实现国人百余年来锲而不舍的追求与梦想。\n\n2008年12月9日",
			"added": 1522750709,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522875124,
			"title": "“中国奇迹”是不是由中国模式带来的？",
			"body": "胥志义：记得曾看过何新先生的一本书，书的题目和内容都忘了，其中有一个观点却给我留下深刻印象。那就是生产关系会妨碍生产力发展却不会促进生产力发展。这个观点的新颖独特之处在于，与传统的生产关系会反作用于生产力的观点不符。生产关系者，模式也。按照何新先生的观点，坏的模式会妨碍生产力的发展，好的模式最好也就是不会妨碍生产力发展，却不会促进生产力发展。这个观点与当下的主流观点不符。主流观点认为，“中国奇迹”是由中国模式带来的，姑不论中国目前取得的发展是不是“奇迹”，即便中国经济在这一段时间取得很快发展，但这种发展是中国模式“促进”的？\n\n 一，农民生产积极性是由承包制调动起来的吗？ \n\n\n我国的改革是逼出来的。比如农村承包制，是在行政式的集体经济搞不下去的情况下，农民为了吃饱肚子而悄悄搞起来的。如果再行压制，农民还要饿肚，更遑论走向富裕了。又如发展个私经济，当时有大量知青返城，国家无力给他们安排工作，如果不允许个私经济存在和发展，这些人怎样生计？所以，中国的改革过程，明显具有打破阻碍生产力发展的生产关系桎梏的特点。它不是在构筑什么模式，而是在生存和发展的压力下摧毁传统的制度桎梏。如果农民家多养一头猪想生活更好都被当作资本主义尾巴要割掉，这样的制度难道不是生产力发展的桎梏？\n\n农村实行承包制之后，农业生产获得快速发展。主流意识形态说是农村承包制调动了农民生产积极性，促进了农业生产发展。农民生产积极性是由承包制调动起来的吗？还是本来就有，只是被以前那种行政式的集体经济压抑了？显然，农民生产积极性本来就有，它源于人追求幸福和富裕的天性，如果建国后不实行行政式的集体经济制度，生产早就发展起来了。承包制只是赋于农民生产自主权、经济行为自由权、以及收益直接归自已所有的收益权。是对农民放松管制扩大自由，是打破阻碍生产力发展的生产关系（集体经济）桎梏，而不是促进生产力发展的动力。而一旦放松管制，人们获得更多自由，生产力就发展了。\n\n同样，允许个私经济存在和发展，是对56年社会主义改造的否定，是对任何社会个体运用自已的劳动、技术、包括资本，去讨生活求富裕权利的认可和回归，而这种权利，是个人最基本的天生的自然权利，却在社会主义的理念下被剥夺，这种剥夺，正是生产力发展的桎梏。改革之后，私有经济的发展成为中国经济发展的主要推动力量，正是打破这一桎梏带来的。\n\n中国的改革，就是在这不断打破桎梏的过程中蹒跚前进。改革之初，我们并没有设计什么模式，改革之中，我们确立了市场经济的发展方向。但市场经济并不是什么模式，而是在人的经济发展权利不被剥夺的条件下，自然形成的。简单说来，只要不去设计什么计划经济或其它什么经济模式，并付诸实施，社会经济的自然发展就是市场经济。而计划经济确然是一种模式，中国由计划经济向市场经济的过渡，并不是一种模式向另一种模式的过渡，而是一个去模式化的过程。如果中国建国时把土地分给了农民之后，不去搞集体化和人民公社，不去搞工商业的社会主义改造，不是强制性的一律只准搞集体经济，国有经济，那三十年后还用实行经济改革吗？我国的经济改革实际上是改回到建国初期，从头再来，同时也是一个回归自然的过程。简单说来，中国前三十年建立社会主义制度，或曰建立某一模式的过程，就是一个制造生产力发展桎梏的过程。而改革是否定前三十年社会主义制度的过程，同时也是一个打破生产力发展桎梏的过程。\n\n二，经济要素流动的均衡作用\n\n中国取得目前的经济成就，明显与中国实行的开放政策有关，但开放的政策是一种模式吗？\n\n经济学有一个产业转移理论，它建立的基础是在经济全球化，即经济要素可以在全球流动的条件下，基于发达国家与不发达国家之间的经济发展水平差异，所带来的生产成本主要是劳力成本差异，会推动产业从发达国家向不发达国家转移。这种转移，首先从劳动密集型产业开始，隋着不发达国家人民文化水平的提高，也会带来技术型产业的转移。产业转移是通过两条途径实现的：一是生产低成本，技术高收益的选择，使发达国家的资本与技术流向不发达国家，投入在地城上的变化，带来产业从发达国家向不发达国家转移；二是不发达国家的产业，因以劳力成本低为主的生产成本低带来产品价格低（非生产效率高带来的产品价格低），在世界范围内的产品市场份额争夺中，处于有利地位，遏制并减少高劳力成本产品的市场份额，从而萎缩高劳力成本地区或国家（发达地区或国家）的某些产业，特别是劳动密集型产业，带来低劳力成本地区或国家（不发达国家）同类产业的增长。一萎缩一增长也是一种产业在地城上的转移。\n\n产业转移具有此消彼长的效应。如果中国代表不发达国家，美国代表发达国家，则中国制造的崛起，意味着美国制造的萎缩；中国就业岗位的增加，意味着美国就业岗位的减少；中国GDP的增长，意味着美国GDP的潜在下降。这是现在发达国家经济增长普遍缓慢，不发达国家经济普遍加速的主要原因。显然，由产业转移带来的经济增长或经济低迷与体制或模式无关。它是一个由经济要素流动带来的地区或国家之间经济发展水平的均衡过程。\n\n何谓均衡？比如自然界的冷热空气对流，它首先是冷热差别的产生，然后有空气流动，而冷热空气的对流可以缩小冷热差别，这就是一种均衡。各国经济发展因各种原因，会出现经济发展差异。比如有的有资源，有的资源较匮乏，有的创新能力很强，有的创新能力较低，由此带来各国经济发展水平差异。当这种差异达到一定程度时，会表现为经济要素价格差异。商品匮乏与过剩，会带来商品价格差异，人口密度和利用水平不同导致土地价格差异；收入水平不同导致劳力工资或劳力成本差异；资本盈余或稀缺导致资本利润差异；技术水平高低导致技术价格差异等。要素价格差异推动要素流动，要素流动既均衡要素价格，也会带来要素分布的均衡。而生产要素分布在不同地域（国家）上的均衡过程，实质上是一个地域（国家）经济发展水平差异缩小的过程。\n\n经济全球化的过程是一个经济要素流动突破国界的过程。所谓的“闭关锁国”，实际上是国家权力阻碍经济要素的跨国自由流动。中国在改革之前，由于闭关锁国，经济发展水平与发达国家越拉越大，由此带来生产要素价格越拉越大。最主要的一种生产要素价格即劳力价格（收入），与发达国家相比，出现十倍以上的差距。一旦取消国家权力对经济要素特别是资本技术流动的管制，这种差距必然带来资本技术从发达国家向中国的流动，因而推动了中国经济的快速发展。同时，由于中国允许国外商品进入中国。根据对等原则，中国商品也可进入外国，中国因低劳力成本所产生的低价商品大量进入发达国家。这也是中国经济取得现在成就的重要原因。这种通过开放带来的经济发展，本质上就是地区（国家）之间经济发展水平的均衡过程，它可以缩小地区（国家）之间的经济发展差异。我们能把由此带来的发展说成是“中国模式”带来的？\n\n国家通过国家权力人为的分割市场，阻碍经济要素流动，破坏了自然的经济均衡过程。中国经济长期落后，与此密切相关。所以“闭关锁国”是生产力发展的桎梏。开放则是打破这种桎梏。开放的国策并不是一种模式，而是一个回归自然的过程。因为所有的分割市场的国家行为，都逆自然而行，是制造桎梏的行为。\n\n三，后发国家的学习优势\n\n我们常说后发国家有后发优势，除了后发国家的低劳力成本优势之外，还在于后发国家的发展是一种学习性的发展，相对于先发国家的创新性发展是一种优势。学习明显比创新更快。创新是一个向各方面探索和试错的过程，充满着不确定和偶然性，因而是缓慢的。学习则有固定的方向，学习性发展，通过对现有成熟理论的学习和具体化，或对现有器物的模仿，或更直接的技术引进和购买，可获得比创新性发展更快的速度。先发国家没有学习性发展，它们不但在科学的理论研究方面处于世界前沿，而且在实际的生产技术上也处于世界前沿。所以才叫先发国家，只有后发国家才有学习性发展，因为学习更快，所以是后发国家的优势。\n\n我国的报刊上常常有这样一种说法：中国的经济发展，只用几十年的时间，就走过了发达国家一百多年走过的道路。这话没错，但以此骄傲却完全错了。中国是后发国家，可以通过学习甚至购买先进生产技术来较快的达到生产从落后走向先进。而发达国家的生产从落后走向先进，不可能有学习和技术购买，只能是一个充满探索和创新的过程，因而是更为艰难与缓慢的过程。比如通过发明汽车和汽车制造技术发展汽车产业，其中充满着众多技术的创新和发明，比学习或购买现成技术发展汽车产业，其艰难程度不知要高多少倍。后发国家通过学习使生产从落后走向先进，比发达国家通过创新使生产从落后走向先进更快，能是后发国家的骄傲，而不是先发国家的骄傲？\n\n显然，学习性发展确实是后发国家的优势，也一定会带来后发国家比先发国家更快的经济发展速度。因为先发国家的生产力水平已达到最先进，进一步的发展主要依赖创新，创新的艰难与不确定性，决定了他们的经济发展不可能很快。或许由于某一重大技术突破（如信息技术的突破），可带来一段时间经济的较快发展（如上世纪后期信息产业的发展），但这种突破不是规律性的一定会有，它具有偶然性，起码在时间即何时出现上具有偶然性。所以，发达国家有时发展很快，有时却显得停滞，取决于它们的创新。不发达国家则可不依赖创新也可带来经济发展。它们学习发达国家的技术，模仿发达国家的技术，购买发达国家的技术，不存在不确定性和偶然性。只要体制上不存在阻碍生产力发展的桎梏，一定可以取得比发达国家更快的发展速度。\n\n中国是后发国家，如果不能通过学习和购买引进先进技术达到快速发展，证明中国体制存在阻碍经济发展的桎梏，而取得了快速发展，却无法证明中国体制优越，充其量只能证明中国体制阻碍生产力发展的桎梏更少。中国取得目前的经济成就，明显与学习购买引进发达国家的先进技术有关，如何是“中国模式”带来的？把因学习型发展带来的更快速度，创新型发展难以速度很快，作为歌颂中国体制，批判西方体制的依据，忽视了学习比创新更快的常识。并不具有说服力。\n\n四，凯恩斯主义遇上了全球化\n\n中国模式的讨论是在2008年美国出现金融危机之后，中国采用了大规模的经济剌激政策，保住了经济增长速度开始的。它不但证明强大的行政力量对经济发展的作用，而且论证了“中国模式”创造“中国奇迹”。理论基础无非是凯恩斯主义。其实，凯恩斯主义的本意是通过政府的宏观经济政策，主要是财政和货币政策，来熨平经济发展过程中的周期性波动，防止或对抗经济危机。财政货币政策或可(只是或可）减少经济波动，但减少经济波动是促进经济发展吗？紧缩的财政与货币政策肯定不能“促进”经济发展，扩张的财政货币政策就一定能“促进”经济发展？\n\n中国的财政货币政策，特别是货币政策从来就没有“紧缩”过。也就是说，中国货币政策从来就不是一种熨平经济波动的手段，而是“剌激”经济的方法，这固然与中国“威权”的政治经济体制有关，但也与“温和的通货膨胀可以促进经济发展”的观点有关。当社会出现新的经济增长点，比如新技术、新产品的出现，或由人的需求产生新的产业，而社会资金短缺时，扩张的财政货币政策确实能带来经济快速发展。但这是由新的经济增长点促进的，而非扩张的财政货币政策促进的，谈不上什么“政府政策”促进了经济发展。\n\n如果社会没有出现经济增长点，扩张的财政货币政策能否促进经济发展？中国的凯恩斯主义者认为能。此种理论建立于以下逻辑推断：货币增加——投资增加——就业增长——需求增长——生产增长。这一逻辑在经济下行时，确实能在短时间内扭转下行，防止经济危机。但如果在这段时间内没有出现新的经济增长点，投资增加所形成的产业是无效产业，不但产生投资浪费，不能创造实质性的物质财富，而且就业增长带来的需求增长显然不可持续。\n\n所以扩张的货币政策，短时间防止经济危机或许有用。但不可能成为促进经济发展的方法。中国从2008年开始的大规模的宽松货币政策，确实维持了表面上的GDP增长，但其中充斥大量无效投资，不但没有增加社会物质财富，反而形成了天量债务，极可能诱发经济崩溃。现在我们越来越清楚的看到这一点。那位在国家发改委拿到钢铁厂批文的广东湛江市长，激动得在批文上亲吻，不过是2012年的事，现在就面临钢铁行业的“去产能”了。不知这个钢铁厂建没建起来，规划是投资700亿，究竟化了多少钱?\n\n凯恩斯主义影响巨大，即便美国这样一个自由主义占主流的国家，在2008年出现金融危机时，美联储也迫不及待的前后推出三轮QE。但美国的经济低迷并没有因QE而有所起色。相反，宽松货币政策带来的过剩流动性，反而流向国外，特别是流向新兴经济体。当美国国内没有出现新的经济增长点时，在全球化背景下，这些流动性进入全世界寻找获利机会。美联储的QE本是想提振美国经济，当货币流向国外时，QE对美国经济还有作用吗？美国经济在2014年大幅回升，并不是QE带来的，而是美国经济出现新的增长点，主要由美国的页岩油气革命所拉动。可见，技术进步才是经济增长的动力。一旦美国出现经济增长点，不仅原来流向国外的美元又回流美国，甚至其它国家货币也在流向美国。\n\n凯恩斯主义能不能促进经济发展或有争议，但凯恩斯主义能够发挥作用的前提，是存在一个以货币为边界（表现为以国别为边界）的封闭经济体。当全球化带来商品、生产要素在全球范围流动时，必然带来不同货币的兑换和自由流动，货币分割市场已不可能。货币政策调整的是以货币为边界的封闭经济体内的经济活动，当货币可以突破封闭经济体在全球自由流动时，凯恩斯主义彻底失效。流行大半个世纪的凯恩斯主义，在全球化的浪潮下，终将成为昨日黄花。\n\n五，生产力解放的根本是人的解放\n\n那末，那些先进发达国家，之所以先进发达，是不是由于他们的制度或曰模式先进，“促进”了他们的先进发达？也不尽然。纵观近现代世界发展历史，实质上是一个人的解放过程。废除农奴制，废除种族歧视制，妇女解放运动等，以及一切为了人的平等自由而进行的广泛而持久的，并且现在还在进行的斗争和改革，都打破了束缚生产力中最为核心和活跃因素人的主动性创造性的枷锁。而保护人的平等自由制度的建立，保护的是人的创造精神，创造潜力的发挥。这会导致经济较快发展。\n\n这些制度并不具有促进经济发展的神奇力量，建立的初衷也不是为了经济发展，因为追求平等自由是人类发展的目的。但由于它是人的解放的结果，它解放了人，同时也就解放了生产力，所以平等自由又是人类发展的手段。现在世界上所有先进发达国家相同的特点，都是人的解放比较彻底，而所有落后国家相同的特点，都是在人的解放上滞后于先进国家。也就是说，落后国家存在较多阻碍人的主动性创造性发挥，即阻碍生产力发展的制度性桎梏。从这个意义上说，自由平等人权等，不仅是普世性的价值观念，而且在此基础上建立的制度，也是一种普世性的保护生产力发展的制度。之所以说它是保护而不是促进生产力发展的制度，是因为人的主动性创造性是天生的，只可能被制度压抑，却不可能由制度来促进。制度的功能是保护而非促进。\n\n什么叫“中等收入陷阱”？那些落后国家，由于长期封闭，人民收入与发达国家相比，出现十倍甚至几十倍的差距，一旦开放，外国资本技术因其低劳力成本进入，同时具有竞争力的廉价产品进入世界，由此带来经济快速发展。但这是由低劳力成本而非生产效率的提高带来的。一旦人民收入有提高，达到一定水平，其生产边际成本接近发达国家，国外资本技术就会停止进入，同时产品竞争力下降，经济发展走向停滞。中等收入与发达国家高收入的差距，就是两国生产效率的差距。如果中等收入国家不能提高生产效率，就只能维持中等收入水平。而能不能提高生产效率，关键是人有没有得到充分解放。所谓进入“中等收入陷阱”的国家，都是人的解放不够彻底的国家。它们借助于产业转移，可以很轻易进入中等收入，却由于生产效率始终难以达到发达国家水平，将长期止步于中等收入。\n\n所以，我们不是寻找一种能够“促进”经济发展的模式，这世界上也没有什么能“促进”经济发展的模式，至少到现在还没有发现。却一定存在阻碍生产力发展桎梏的体制，我们的任务就是要去消除这种桎梏。增进人的权利，人的自由，既是社会进步的根本体现。也是消除生产力发展桎梏的要求。一个个人权利自由获得充分发展的国家，既是一个现代文明国家，也是一个具有创新能力发展能力的国家。\n\n如果我们还要去坚持什么“有特色”模式，要显示威权的中国模式“促进”经济发展的优越性，某些官员要表现他解决经济问题的本领，并大量动用国家资源去做这做那，必然又是一种政府带来的折腾，而中国已经折腾不起了。 [博讯来稿] (博讯 boxun.com)",
			"added": 1522875102,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522929072,
			"title": "民主必然走向独裁，专制才是人类的归宿(转载)",
			"body": "（本文转载自天涯，原作者信息不详）\n\n很多人认为，民主与独裁是对立的，民主能够避免独裁的出现。但是，历史一次次地证明，民主最后都走向独裁，而且都是心甘情愿的。\n\n民主的起源一般认为是古希腊，古希腊的民主产生了独裁者亚历山大大帝；古罗马的民主产生了奥古斯都，古罗马自此从共和制走向独裁的王权；17世纪，英国有一个短暂的共和国，执政者克伦威尔甚至砍掉了国王的脑袋，但是，他的独裁导致王朝复辟，英国到现在仍然是一个“王国”；18世纪法国大革命，推翻王权，国王上了断头台，接着产生了独裁者罗伯斯比尔。罗伯斯比尔被砍掉脑袋后，产生了大独裁者拿破仑；德国在欧洲实现民主较晚，却产生了一个希特勒；为什么民主总是一次次地以独裁告终？历史的规律会在美国重演吗？\n\n在古希腊民主思想最高涨的时期，反民主思想就产生了。苏格拉底就大声疾呼，希腊的民主是一个愚蠢的制度。在斯巴达人控制希腊时期，民主的发源地雅典经历了一个专制时期。等到雅典恢复了民主，那些民主人士认为，雅典的独裁者都是苏格拉底的学生和朋友，因此，他们把反民主的精神领袖苏格拉底处死了。这对民主真是一个讽刺。苏格拉底拒绝了流放，拒绝了逃亡，以自己高贵的死亡，向古希腊的民主发出了嘲笑。\n\n古希腊另一个伟大的思想家柏拉图，同样反对民主。在他的“理想国”里，最高的统治者是“哲学王”。柏拉图生前甚至看中了一个国王，希望亲自把他教育成他心目中的“哲学王”。但是，柏拉图没有成功。他的学生亚里士多德完成了柏拉图未能完成的事业。亚里士多德的学生中，最出名的就是那个独裁者亚历山大大帝。\n\n亚历山大大帝所领导的马其顿王国，长期以来，在希腊人的眼里，都是一个落后野蛮的国家，希腊城邦甚至不把马其顿看成同类。连马其顿王室的希腊血统都是令人怀疑的。但是，希腊科林斯同盟的长老们最终把最高统帅权授予了年轻的、富有极大野心的亚历山大。\n\n古罗马的凯撒在获得极大的权力之后，被谋杀而死。凯撒死后，他的侄子屋大维整合了所有的不同势力，以一种渐进改革的方式，最终使得古罗马的民主共和制名存实亡。公元前27年，元老院授予屋大维终身保民官的称号，标志着独裁的诞生。保民官是罗马政体的一个特殊角色。罗马的民主像古希腊一样，只涉及贵族和平民，不涉及奴隶。由于贵族往往能够掌握更大的权利，为了保障平民的权利，罗马政体特别设置了保民官这个职位。按照规定，这个职位不能由贵族担任，必须完全代表平民的利益。最重要的是，这个职位具有一票否决的巨大权力。屋大维长期都是罗马的执政官，而且出生贵族，按照规定，他不能同时担任执政官和保民官，哪怕单独担任保民官也不行。但是，为了奖励屋大维对罗马做出的巨大贡献，元老院将执政的权力和否决执政的权力都交给了他一个人。公元前23年，元老院再次授予屋大维“奥古斯都”的称号，这个称号的含义是“至尊至圣”。4年后，奥古斯都又担任了罗马的道德长官。再过7年，到了公元前12年，奥古斯都又担任了大祭司长。从行政到军事，从道德到宗教，所有的权力都掌握在一个人手中。罗马的元老院就是这样把所有权力交给了一个独裁者。此后的罗马，开始出现了皇帝。\n\n法国大革命以后出现的混乱，使得人们急需一个强有力的领导人。首先出现的罗伯斯比尔，并没有满足民主的要求，因为他除了杀人和恐怖统治，没有给法国的人民带来财富。拿破仑的出现，迎合了民众的这个要求。1799年，拿破仑获得了权力。经过几年的表现，人们真正喜欢上了这个小个子科西嘉人，于是，1802年，法国宪法授予拿破仑终身执政的权力。1804年，拿破仑决定恢复帝制。为此，拿破仑举行了全民投票，结果是：350万张“赞成”，2580张“反对”。换句话说，法国99%以上的民主意愿选择了独裁。\n\n1932年，在德国的选举中，希特勒的纳粹党获得将近40%的选票。虽然没有超过半数，但是，纳粹党毫无疑问是当时德国第一大党，第二、第三两个党的选票加起来也没有纳粹党多。经过一段时间的讨价还价，1933年，德国总统不得不按照民主程序，任命希特勒担任首相。\n\n我们不得不要问一下，为什么民主总是导致独裁？在我看来，原因就是追求财富的狂热欲望。\n\n民主简单理解就是每个人的意见综合成主流意见。实际上，每一个人的意见往往千差万别，很难统一。在某些问题上，大多数人的意见往往是错误的，例如当年只有少数人同意的“日心说”。最容易统一，或者说最容易调动的绝大多数人的普遍意愿就是发财。不管社会地位高低，不管文化水平差别，不管出身背景迥异，几乎所有的人都不会反对发财。因此，民主最容易统一的主流就是发财的欲望。当一个社会的发财欲望遭受严重打击的时候，如果有人站出来说：“我能让你们统统发财”，他立即就能得到民主的支持；如果他真的能够做到这一点，民主就情愿把权力全部交给这个人——让他独裁吧，只要他能让我们发财！如果这个人还用发财来要挟民主，民主在发财欲望面前，绝对容易彻底投降。\n\n古希腊的苏格拉底反对民主，一个重要的原因就是因为民主影响了社会效率。苏格拉底曾经说，在希腊造一座桥都要争吵无数次，因为，这座桥即使对全希腊，或者整个城邦有利，但很有可能对某些既得利益者不利。希腊城邦自诞生以来，只在初期有过短暂的安定。其他大部分时间里，各个城邦之间都在勾心斗角，打打杀杀，严重消耗了希腊有限的财力。那些本来能够造福民众的财富，都在不同利益集团的争斗中，无谓地消耗掉了。\n\n马其顿虽然在希腊眼里是一个落后野蛮的国家，但是，马其顿的金矿使它成为富裕的国家。亚历山大的父亲为了获取希腊的领导权，向希腊长老们描绘了一个美好的远景。在相当长一段时间里，东方的波斯人一直都是希腊的威胁，这种威胁从政治到军事，再到财富。亚历山大的父亲提出了向波斯人发动“复仇战争”的计划，得到了希腊各个城邦的拥护。当然，这个“复仇战争”绝对少不了对东方财富的掠夺。亚历山大就是在这个背景下，成为希腊民主的共同希望。他继承了父亲的宏伟计划，甚至比他父亲走得更远，他想征服全世界，他成为希腊的骄傲。\n\n亚历山大大帝年纪轻轻就死了。他死的时候，希腊帝国的版图从来没有那么广阔，希腊的殖民地从来没有那么多。他以血腥的暴力镇压各种反抗，在他带来的巨大财富面前，希腊放弃了民主。随着亚历山大大帝的死去，希腊的光荣时代也最终结束了。\n\n罗马的凯撒、苏拉等巨头获得超出常规的权利，都是因为他们通过征服战争，给罗马带来了巨大的财富和荣耀。凯撒的功绩之一就是征服今天的法国和英国等地区。屋大维能够最终成为独裁者，一方面是因为他消除了罗马的内战，另一方面也是因为他终于征服了埃及，以及地中海东岸广阔富饶的土地。屋大维给罗马带来的财富，终于使得元老院心甘情愿地把他推上独裁者的宝座。\n\n英国克伦威尔领导的共和国之所以短暂，不是因为他的独裁，而是因为他“错误”的财富政策。克伦威尔没有像所有“成功”的独裁者那样，向外扩张，给支持他的人们带来财富，而是仅仅在英国“窝里斗”，大搞极端平均主义，结果越搞越糟。如果克伦威尔有条件像拿破仑一样迅速扩张，他被民主催生的独裁共和国不会只有11年的寿命。英国的王朝恐怕也很难复辟。\n\n拿破仑就是给全体法国人看到并感受到现实的发财机会。拿破仑的军队几乎不带给养，这有两个好处，一是军队行动迅速，没有拖累；二是随处征收给养，给全体士兵制造了发财的机会。因此，拿破仑的军队所到之处，基本上都把当地抢掠一空。不光如此，拿破仑的军队还抢劫了欧洲各国王宫贵族的财富，这些都成为法国的荣耀。但是，最终给法国自己制造了无数的敌人。\n\n希特勒也同样给德国带来了发财梦想的实现。如今德国的汽车工业就是在希特勒时期奠定的基础。希特勒甚至第一个发出“让每个人都拥有小汽车”的豪言壮语。随着德国科技和工业力量的强大，希特勒决定停止支付第一次世界大战之后要求德国支付的战争赔款，其他国家也无可奈何。这就更让希特勒成为全体德国人的英雄。\n\n因此，简单一句话，只要民主同发财的梦想紧紧捆绑在一起，民主就很容易走向独裁。\n\n人类历史到目前为止，民主向独裁的光滑过渡，有一个例外，那就是美国。人们在说这个问题的时候，经常强调，以前导致独裁的民主，不是真正的现代民主，美国的民主才是真正的民主。因此，美国的民主不会导致独裁。这种论调是粉饰太平。美国之所以没有出现独裁，是因为它自建国以来，还没有遭遇财富方面的深刻危机。在美国历史上，每一次经济出现严重危机的时候，都会出现一个带有独裁性质的政权。幸亏历史的机遇使得美国较快地摆脱了经济危机。但是，这种好运会永远存在吗？现在全世界所有的民主国家领导人，只有美国总统经常把“上帝保佑美国”挂在嘴边。为什么上帝只保佑美国，不能保佑全世界？如果未来有一天，美国想尽一切和平的办法，都不能保证它现在的财富水平，如果未来有一天，在公平竞争的面前，美国财富的消退不可阻挡的时候，谁能保证美国不出现一个独裁的政权？\n\n面对当今的恐怖主义，美国人已经表示愿意牺牲个人权利，换来安全。面对未来的财富难以挽回的消退，美国人也完全可能愿意放弃民主——“让他独裁吧，只要他能让我们发财！”这个掌握着全世界最庞大暴力机器的国家，会不会成为全世界最大的威胁？让未来去回答吧。历史的魔咒会不会破除，现在还没有答案。\n\n要消除这个历史的魔咒，只有改变疯狂追逐财富的社会生态，让每个人都真正懂得，财富的富足并不能带来真正的幸福。并且要在社会经济制度中，让这种观念获得充分的生长空间。美国能做到吗？美国当然做不到，因为人性是卑劣的、贪婪的、逐利的，这一点是任何政治和意识形态都改变不了的。因此民主必然走向独裁，专制才是人类的归宿。",
			"added": 1522929049,
			"parent_topic_uri": "1522527088_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		},
		{
			"topic_id": 1522954343,
			"title": "中国电信业的成长史 （转载）",
			"body": "（此文节选自环球网）\n\n　　中国电信业的成长史，伴随着科技发展、大国博弈的故事，极其精彩！库叔今天就来跟读者聊一聊。\n\n　　1\n\n　　标准背后是国家利益\n\n　　众所周知，技术全球领先的美国制定了很多国际电信标准。\n\n　　标准是行业的“灯塔”和“指南针”，国际电信标准的制定权是掌控电信产业主导权的关键，是国家核心竞争力之一。\n\n　　美国人不是活雷锋，他们垄断国际电信标准是为了控制行业，从而牟取暴利。\n\n　　1985年7月，7名专家在雅各布博士家中达成一致，决定创建高通公司。\n\n　　一家靠卖标准获利的公司就这样诞生了。\n\n　　\n\n\n　　成立不久，这家公司就拥有了约4000多项相关专利，其中很多被国际电信联盟采纳。通过给全球100多家通信设备制造商进行专利授权，高通赚了个盆满钵盈。\n\n　　制定国际电信标准的门槛很高，高新技术和雄厚资金缺一不可。大多数国家只能对美国唯命是从。\n\n　　但是，欧洲国家不甘心。80年代，它们组成了国际电信标准的另一极——美标和欧标开始分庭抗礼。\n\n　　美标出台时，摩托罗拉等美企便宣布大力支持，并应用到自己全线产品中；欧标一问世，爱立信和诺基亚等欧企当然会力挺。\n\n　　这些企业巨头的支持是标准产生影响力的关键。\n\n　　同时代的中国是什么情况呢？\n\n　　那时，严重缺乏通信技术专利的中国，只能搞劳动密集型产业，成了全球最大的手机代工基地。\n\n　　外国人以专利费的名义拿走了大部分利润，中国的巨型企业和海量工人只能挣点小钱。\n\n　　\n\n\n　　掌握技术标准才能发大财，否则只能仰人鼻息、勉强糊口。\n\n　　由此，中国人切身感受到了技术标准的重要性。\n\n　　2\n\n　　中国连滚带爬赶上末班车\n\n　　在2G时代，欧美国家一边赚着大钱，一边搞3G技术标准。\n\n　　改革开放后，有迅猛发展的经济作基础，我们意识到：中国不能再跟在美国和欧洲后面跑了，必须在3G技术标准上有所作为！\n\n　　然而，欧美国家的一道道技术壁垒和专利陷阱都已铺好，外人很难从中分得一杯羹。\n\n　　于是，中国另辟蹊径，选择“时分双工”作为突破口。\n\n　　当时，大家普遍看好的是“频分双工”，因为它继承了2G技术设备；而“时分双工”缺乏工程基础，尚处于理论研究阶段，有风险。\n\n　　上不上？当伙计没前途，当老板才有未来。中国决定：必须上！\n\n　　1997年4月，国际电信联盟向各国发出征集函，征集第三代移动通信（3G）技术标准，中国政府指定大唐集团进行论证和筹备。\n\n　　1998年1月，国内组织权威专家进行论证，召开了香山会议，最后决定4月30日前向国际电信联盟提交TD-SCDMA标准（即中国版的3G技术标准）提案。\n\n　　然而，当时中国在3G方面的专利数量与国际电信联盟要求的数量差了一半，不足以发起国际电信标准的申请，时间还剩下3个月了，临时进行研究和申请也根本来不及。\n\n　　怎么办？\n\n　　中国盯上了西门子的TD-CDMA（注意没有S），因为它比较符合中国的TD-SCDMA技术路线。\n\n　　当时，西门子的技术实力非常强，但是，由于其3G技术路线与其它欧洲企业不同，所以“落了单”。\n\n　　欧洲向来抱团出击，因此，西门子“不合群”的标准体系很可能会被牺牲掉。\n\n　　西门子意识到，等国际标准定下来，自家的技术真的就成废纸了。\n\n　　与其砸在手里，不如尽快卖掉。\n\n　　由此，双方一拍即合：中国买进西门子的技术专利，凑够了数量，赶上了申请3G国际标准的末班车。\n\n \n\n　　\n\n\n　　3\n\n　　“联美抗欧”，挤进标准圈\n\n　　在酝酿3G国际标准过程中，欧洲的WCDMA（欧洲版的3G技术标准）比美国的CDMA2000（美国版3G技术标准）优势明显。\n\n　　欧洲也由此产生了一个宏伟的设想——打破美标和欧标并行的老局面，在3G时代将WCDMA树立为唯一的国际标准，将美国挤出标准制定圈。\n\n　　美国当然不乐意了，他们的CDMA2000提案承载着美国电信企业的未来，怎能将主导权拱手让给欧洲？\n\n　　不过他们也有些担心，因为当时欧标确实最优。\n\n　　于是，美国决定联合中国抱团阻止欧洲一家独大，让中国的TD-SCDMA跟美国的CDMA2000一同进标准。\n\n　　美国并不在乎中国标准也通过，他们认为，这无非就是在国际电信联盟的档案库里多份文件罢了，对美国并没有任何实质性影响，利用中国的帮助让美标挤进国际3G标准圈才是最终目的。\n\n　　中美联合强调，国际上不能只有一种标准，随后获得了多个国家支持。\n\n　　最终，欧标WCDMA、美标CDMA2000、中标TD-SCDMA共同成为3G国际标准，三足鼎力的国际格局就这样形成了。\n\n　　\n\n\n　　中国代表团回国后，一个非常现实的问题摆在了眼前：TD-SCDMA标准是锁在国际电信联盟的文件柜里当个摆设？还是真的把它做成产业？若真做产业，面临的难度可想而知。\n\n　　当时有个提法，让中国铁通搞个区域性的TD-SCDMA网，这也算是产业化了。\n\n　　但很多专家表示反对，他们认为小网络刺激不起产业规模，会越搞越缩水。而且，中国铁通的实力本来就不强，再交给它一个最艰巨的任务，结局可能很难看。\n\n　　经过反复斟酌，政府终于下了决心，把这个最艰巨的任务交给技术实力最强的中国移动，做成全国性网络。\n\n　　为此，政府重组中国电信业，将中国铁通并入中国移动，共同建设TD-SCDMA。\n\n　　\n\n\n　　与此同时，政府把当时最成熟、最优秀的欧标WCDMA交给中国联通经营，将美标CDMA2000交给中国电信经营。\n\n　　中国移动的任务最艰巨。\n\n　　\n\n\n　　4\n\n　　中国的TD-SCDMA真的不行？\n\n　　最初，中国的TD-SCDMA经营状况并不好，还曾被某些国人奚落嘲讽，是这项标准不行吗？\n\n　　完全不是！\n\n　　它足够先进，否则也不会被国际电信联盟批准成为3G的三大国际标准之一。\n\n　　\n\n\n　　那么，为什么经营不好？\n\n　　主要原因有以下四个：\n\n　　一是它不像欧标WCDMA那样有2G时代的技术和设备积累；\n\n　　二是智能天线等核心技术的工程化应用不给力；\n\n　　三是当时宣布支持中国TD-SCDMA的企业规模都很小，跟欧美电信巨头无法相提并论。而前面也提到过，如果没有企业去研究和推广，那标准就毫无用处；\n\n　　\n\n\n　　四是国内某些民众、公知、大V等的唱衰，对TD-SCDMA的发展造成了一定阻碍。对于任何国家来说，把自己的电信标准推广开来是极为艰辛的，如果有国民的大力支持，就会产生更好的效果。\n\n　　5\n\n　　联欧抗美，力挫WiMAX计划\n\n　　3G的三大国际标准建立后，美国发展怎样呢？\n\n　　情况很不好。虽然美国的CDMA2000如愿成为了国际标准，但它在美国本土的应用其实远不如欧标WCDMA，国外应用更不景气，最大的应用方居然是中国电信。\n\n　　对于3G产业的颓势，美国没有坐视不管——既然电信业搞不过欧洲，那就借力计算机业这个长项来弥补电信业的短板。\n\n　　于是，他们搞了个WiMAX（美国的另一种3G标准，特点是大带宽，但移动性较差）。\n\n　　与传统3G不同，WiMAX构建在IP网络环境上，这就进入美国擅长的计算机领域了。\n\n　　英特尔与摩托罗拉向WiMAX项目注资9亿美元，美国某运营商又注资30亿美元。如此大手笔的投入，WiMAX一经面世就光芒四射。\n\n　　这是美国依托强大的计算机产业试图对欧洲电信业发起的一次冲击。\n\n　　美国遇到了一个难题：没有频率。因为全球统一频率划分是由国际电信联盟负责的，必须申请成为基础性的国际电信标准后才能得到全球频率。\n\n　　也就是说，美国必须让WiMAX挤进3G国际电信标准，否则一切免谈。\n\n　　国际电信联盟曾公告全世界，3G标准提交的最后时间是1998年6月30日，而这时已经是2007年，大门已经关闭了9年。\n\n　　\n\n\n　　然而，美国就是任性，硬是通过政治手段打开了国际电信联盟的大门。它召开专题会议，把WiMAX纳入第四个3G国际电信标准，并如愿得到了全球频率。\n\n　　WiMAX横空出世，对外宣称是3.5G技术，有英特尔、IBM等巨头力挺，有国际电信联盟的全套手续，显现出了随时准备逆袭的势头。\n\n　　\n\n\n　　在学术领域，研究WiMAX的论文呈爆发之势，而WCDMA论文数量则明显下降。\n\n　　很多国家也加快了对WiMAX的推广。\n\n　　北电（加拿大一家电信企业）将传统3G业务出售给阿尔卡特，孤注一掷地全面转向WiMAX。\n\n　　除中国大陆之外的亚洲成了WiMAX的试验田，日本、韩国、马来西亚、菲律宾等都部署了WiMAX。\n\n　　中国台湾也重重地押宝WiMAX，争先恐后地抢夺WiMAX牌照，全球一动、威迈思电信、远传电信、大众电信、大同电信、威达超舜电讯等六家台湾企业都抢到了WiMAX牌照，准备大干一场。\n\n　　WiMAX的搅局，令欧洲和中国很不安。\n\n　　当初为了挤进3G标准，中国跟美国联合抗欧。现在，当然变成了中国跟欧洲联合抗美。\n\n　　知道中国跟欧洲联合之后，美国非但不惊慌，还放出狂话“中国的TD-SCDMA没有前途，唯一的出路就是向WiMAX靠拢”。\n\n　　为什么TD-SCDMA能向WiMAX靠拢呢？\n\n　　因为两者都使用了TDD（时分双工）机制。\n\n　　欧洲和中国加紧了抵制，2009年诺基亚的销售负责人公开批评WiMAX，把英特尔高管惹恼了，类似这样的斗争不断进行着。\n\n　　\n\n\n　　但美国显然低估了欧洲和中国的实力。\n\n　　欧洲电信商不生产WiMAX设备，WiMAX的通信基础设备就无法保证供应，使用体验越来越差。\n\n　　而中国不开放全球最大的电信市场，WiMAX的应用量就被硬生生的切走了一大块。\n\n　　这样，WiMAX慢慢就支撑不住了。\n\n　　澳大利亚最早部署WiMAX的运营商老总在国际会议上痛骂WiMAX，说室内覆盖在区区400米范围内就不行了，时延高达1000毫秒。他之前还在相关国际会议上对WiMAX赞不绝口，国际风向显然发生了变化。\n\n　　2010年，WiMAX标准的最大支柱英特尔撑不住了，宣布解散WiMAX部门。\n\n　　这可是一记要命的“闷棍”！WiMAX兵败如山倒，当初孤注一掷转向WiMAX的加拿大北电破产了。\n\n　　马来西亚、菲律宾、韩国等亚洲国家纷纷从WiMAX转向TD-LTE（中国主推的一种4G网络模式）。刚才提到WiMAX采用跟TD同样的“TDD机制”，当时只能向中国的TD-LTE转换。\n\n　　中国台湾在WiMAX上可是投入巨大，不肯轻易退出。自2010年英特尔退出WiMAX后，台湾又独自在WiMAX上苦撑了两年。等到2012年一盘算，发现六家运营商的WiMAX用户还不足15万，不及大陆一个贫困县！\n\n　　它显然押错了宝，有报道称总共损失达500亿美元。钱没了可以再挣，但电信产业路线错误，耽误的可是一个时代。\n\n　　2011年9月，全球最大的WiMAX服务提供商美国Clearwire公司宣布与中国移动达成合作伙伴关系，共同推进基于TD-LTE标准的产品与设备开发，其业务重心最终由WiMAX转向了TD-LTE。\n\n　　6\n\n　　中国电信业实现了逆袭！\n\n \n\n　　1998年，中国申请3G标准；到了2013年，到国内TD-SCDMA网络基本成熟。\n\n　　在这十多年的时间里，国际电信业波诡云谲，在国外拼杀多年的华为和中兴发展起来了，在全球四大电信设备商中，分别排名第一和第四。\n\n　　\n\n\n　　以前说起国际电信业巨头，大家脑海里浮现的是摩托罗拉、诺基亚，现在，它们都没落了，摩托罗拉的移动事业部还被联想收购了。\n\n　　现在华为和中兴才是妥妥的国际电信业巨头！\n\n　　\n\n\n　　电信业有两大支柱，一是设备，二是市场。\n\n　　当年欧洲卡住设备制造，中国不开放最大的电信市场，两个支柱一垮，WiMAX就被掐死。\n\n　　而如今，中国掌握着全球最强大的设备制造能力，拥有全球最大的电信市场，这就厉害了！\n\n　　当年，中国“联美抗欧”挤进标准圈；\n\n　　后来“联欧抗美”打压WiMAX；\n\n　　现在，中国要甩开欧洲、引领世界。\n\n　　欧洲的FDD制式（欧洲的第四代移动通信模式）已经很成熟，如果跟着欧洲跑肯定永远不能出头，因此中国再次决定利用TD体制弯道超车。\n\n　　难不难？\n\n　　中国政府掌控着电信设备制造和最大的电信市场，两手都很硬，超车就不难，没用两年时间就将TD赶超到了能与FDD平分秋色。\n\n　　2013年12月4日，中国政府发布了TD－LTE的牌照，但没发FDD-LTE牌照，政策意图非常明显，就是要主推TD体制。\n\n　　中国移动在3G时代憋坏了，抢了4G的TD－LTE牌照，不再继续投入3G时代的TD-SCDMA网络，集中全部力量上4G。\n\n　　按理说，牌照三大运营商都可以用，但联通和电信决定再等等，他们想经营FDD体制，这毕竟曾是电信业最强的欧洲主推制式。特别是联通，在3G时代尝到了欧洲制式的好处，想继续跟下去。\n\n　　在联通和电信等FDD牌照的时间里，移动疯狂建4G基站，利用4G的先发优势狂抢联通和电信的老用户，用户数居然涨至8亿。\n\n　　一年多后，政府看TD制式的基本盘稳住了，就发了FDD牌照，但联通和电信已经丧失了先机。联通近年来的利润持续下滑，董事长王晓初曾不止一次痛心疾首地表示错失了发展良机。\n\n　　电信业特别强调标准统一，因为没有标准就不能互联互联，而标准具有很强的排他性，标准竞争的结果就是强者愈强，然后垄断市场，弱者愈弱，最终被淘汰。\n\n　　过去，一直都是欧美标准引领世界，其技术标准一问世，就会被各大电信企业争抢。\n\n　　然而，电信业江湖中冒出了中国这个设备、市场两手抓的“新大哥”。\n\n　　中国帮美国，欧洲就吃不消，中国帮欧洲，美国就得吐血。\n\n　　2013年，TD牌照发布时，联通和电信还对欧洲标准有所期盼，结果却是错失良机，归根结底还是对电信江湖中美欧三家的势力消长判断失误。\n\n　　移动及时跟上了步伐，现在日进斗金。\n\n　　从踉踉跄跄地闯进国际电信标准圈的“小弟”，到成为全球电信业最重要的“带头大哥”，中国只用了不到20年。\n\n　　当前，电信业的主题是5G（第五代移动通信），而中国是推进5G最积极的国家，没有之一。在5G相关的各种国际电信组织里，都有中国专家的身影。\n\n　　现任国际电信联盟秘书长是赵厚麟，国际电信联盟的官方介绍很有意思，从不提联盟官员的国籍，只提出生地，例如赵秘书长生于江苏。\n\n　　\n\n\n　　2013年，科技部、发改委、工信部联合成立了IMT-2020（5G）推进组，指导5G工作。\n\n　　这个组织很重要——中国电信企业各有特长，在5G技术研发方面可不能“打乱仗”，进行统筹规划和合理分工才能减少内耗、形成合力。\n\n　　在推进组的领导下，中国已经进行了两轮5G测试。除了华为、中兴、大唐这三大主力，还有一些国外企业参加，爱立信和英特尔均得到了中国政府的表扬。\n\n　　欧美巨头企业为何会主动参加中国政府组织的5G测试？\n\n　　中国的三大运营商计划投资1.2万亿人民币，建造全球最大5G网，5G的未来在中国，国际电信企业当然乐于投奔。\n\n　　7\n\n　　中国电信业垄断坑人吗？\n\n　　公众聊起中国电信业，最普遍的说法：运营商垄断电信市场，不让优秀的国外电信企业进入，信号特别差，坑害消费者。\n\n　　这些说法是真的吗？\n\n　　首先，我们了来说说“垄断”。\n\n　　大家都知道，电信业是从邮政业分离出来的，以前没有电话时靠的就是邮政。\n\n　　邮政不是谁都可以经营的，各国都是如此，美国也曾有一部关于邮政专营的法律，对邮政进行严格限定，不准民间机构随便进入。\n\n　　与邮政专营性质类似的，还有自来水专营、燃气专营等，这叫作“行政垄断”——这些公众事业涉及公民基础性安全，不能完全依赖市场经济规则，政府必须管控，这是对人民的负责。\n\n　　\n\n\n　　电信运营商也是这个道理，既然不能随便设立，那么，应该有多少家呢？按理说如果只有一家，就会杜绝重复建设，从而降低成本，但是又容易形成价格垄断。\n\n　　\n\n\n　　现在全世界各个国家的通常设立2-4家全国性运营商，多数国家是三家，中国的全国性运营商有移动、联通、电信三家，这是国际主流模式。\n\n　　电信业市场竞争非常惨烈。这一点，看看你周围就知道了。对于电信业销售人员来说，今年如果拼命完成了销售任务，明年的任务一定会涨。抱怨上级没人性是没用的，因为上级压力更大。\n\n　　有的电信业销售人员早上5点贴的海报，被友商6点钟用自家海报给盖上了，然后就是争执甚至打架，而且一打架就是打群架，员工们自嘲说“连打架都不会，你还摆什么摊”。\n\n　　\n\n\n　　全世界哪里有这种悲催的市场垄断？\n\n　　其次，中国电信业运营市场不是没开放，而是开放了没人来。\n\n　　中国地域广阔，运营全国性电信网络投入极高，有时候，砸入100亿都看不到一点效果。这些，让无利不起早的外国电信运营商很无奈。\n\n　　第三，还有人质问，为什么国内电信市场很少有国外设备？\n\n　　这是因为中国电信企业的竞争力实在太强。华为和中兴在国外承揽电信工程时敢报对折价和对折工期，往往是以国家为单位承包的，就是说，你这个国家的电信基础设施我全包了，八个月内搞定。\n\n　　中国工程师及工作人员也是吃苦耐劳，做事效率极高，这是其他任何国家没法比的。\n\n　　我国电信设备市场其实早就开放了，但欧美国家的电信设备商在本国都被中国企业挤兑得厉害，怎么会到主场来找虐呢？\n\n　　这就好比是种粮大户收了几十万斤小麦，正发愁着要去产能呢，你扛了一袋面粉去他家里卖，能卖得出去才怪。\n\n　　第四，信号差就更不是事实了。\n\n　　根据统计数据，中国移动的4G基站有150多万，中国电信80多万，中国联通有70多万。\n\n　　全世界500万4G基站，中国占了64%，其他36%由包括美国在内的其他190多个国家拥有。\n\n　　中国的铁路沿线和国道基本都有信号，这在全球大国中是绝无仅有的。\n\n　　下图是美国黄石公园，如此美丽的全球著名旅游圣地居然没有信号，换作在中国，你敢想象吗？\n\n　　\n\n\n　　三年前曾有人在微博上发了一张对比图，中国地铁上人人都在玩手机，而外国地铁上人人都在看报纸，帖子感慨到：我们是不是除了玩手机就没法活了？\n\n　　后面跟贴无数，全是在批评中国人浮躁，羡慕外国人爱学习，连中国人的劣根性都讨论出来了。\n\n　　实际上，外国地铁绝大多数都没有上网信号，他们想看手机而不可得，不看报纸看什么？\n\n　　中国地铁率先解决了上网问题，而同期国外的地铁是没信号的，这两年华为承揽了欧洲国家的地铁网络工程，现在他们也有信号了。\n\n　　于是，欧洲人民也不看报纸，跟着中国人玩手机了。\n\n　　\n\n\n　　为什么中国的基站这么多，信号这么好？\n\n　　中国的“村村通”政策要求95%以上的偏远山村都必须有信号，而且资费不得高于城镇地区，三大运营商每年都会接受工信部下达的任务。\n\n　　大家都知道，经济越发达人口越密集的城市，其电信建设成本就越低，利润就越高，随便在楼顶上就可以建基站，覆盖上万月话费过百的城市人，员工骑个电车就可以维护10个基站。\n\n \n\n　　但在山区建基站，那得花一百万盖铁塔，极偏远山区还得使用VSAT卫星通信接入，然后只能覆盖一个村，村民月话费不到20，运营商一个月收入800块，还不够电费。\n\n　\n\n　　现在“村村通”已经完成，实现了信号的普遍覆盖，目前正在搞升级工程。\n\n　　“村村通”政策造就了中国全球第一大电信覆盖率，到处都有手机信号。\n\n　　偏远贫困人口的电信权被联合国认定为人权，中国电信业的“村村通”是国际电信联盟第CA/42STGkg号文件所倡导的“向农村和边远山区提供电信服务”理念的具体落实。\n\n　　西方国家不是习惯于讲人权吗？在这方面，中国是世界第一。",
			"added": 1522954319,
			"parent_topic_uri": "1522527073_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1522750730_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 1,
				"body": "《零八宪章》是为了纪念1948年12月10日《世界人权宣言》发表60周年之际，受捷克斯洛伐克反体制运动的象征性文件《七七宪章》（Charter 77）启发，由张祖桦负责起草、刘晓波等人修改并由303位各界人士首批签署的一份宣言。 (from Wikipedia)",
				"added": 1522750956
			}
		],
		"1522929072_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 2,
				"body": "不完全认同此文观点。但提供了另一个看待问题的角度。",
				"added": 1522929102
			}
		],
		"1522954343_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 3,
				"body": "看完此文，确实觉得中国电信业发展不容易。不过：\n\n1. 电信资费确实贵。\n2. 电信技术的高度发展确实成为国家权力的强有力工具。\n3. 大用户量让防火墙内部成为丰富多彩的大局域网，大家乐不思蜀。",
				"added": 1522954645
			}
		],
		"1522585542_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 4,
				"body": "> [flandre](#comment_1_1PBNStBUCMh9A4GuYqgCtf9itJpwah6Ani): 干了这杯塑料水来世还做天朝人\n\n关键是全球都一样。",
				"added": 1523185239
			}
		]
	},
	"comment_vote": {
		"1_1PBNStBUCMh9A4GuYqgCtf9itJpwah6Ani": 1
	}
}