{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "> [whotoldyouthat](#comment_2_1AeFu4C63ou5WLJuMboxp9Ni2z45eT5XmN): Far right sucks, so does far left. Difference is everyone knows the far right is a joke, literally nobody takes them seriously. The idea of there being a superior race has been destroyed thoroughly.Not near as many regard the far left as being a joke or dangerous. The ideas are more palatable, who wouldn't want more \"equality\" or even \"equity\"???! Unless you're very wealthy AND greedy as shit, you probably believe there needs to be as much equal opportunity as possible, possibly even more equitable outcomes. The problems start to arise when figuring out the details of how exactly things are made more equal. Ultimately it's just people doing the equalizing, and they'll need lots of power to do so. Unless the people doing so are perfectly honest, fair, etc the outcomes actually become more unfair than they start as, basically because power corrupts. Maybe if there was some way to ensure the ones making decisions to equalize all the outcomes were verifiably transparent every step of the way we could have true \"equity\"...Even if that's the way it's portrayed, how does the average Joe verify that things are truly transparent, instead of just appearing so? Can you really trust the \"experts\" to tell you the truth? I think that's at the heart of the divide right now, can you trust a story/narrative simply because it's told on all the legacy media? Can you trust a narrative simply because it's told by the guy you like aka Trump? Or just because all the new media, like on LBRY/Odysee, agree? IS ANYONE able to be trusted? If so, WHY?\n\nNo one can be trusted besides friends and family. Fuck, even that's being eroded for a thousand dollars a pop to list off people you know and saw at the Capitol protest. Far-anything sucks an iron rod. Republicans and Democrats are the same thing. I personally think it'd be cool if the left populist and right populist just agree to work out these fags running office right now. At least that's what I'd settle for.",
				"added": 1610282318
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 2,
				"body": "> [anonynous38883](#comment_35_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): if you don't like to see My post or whatever Ignore me :) because you are not the First to Try to Brain fuck me etc .. I don't care seriously. ! i will continue to promote Everywhere The Community ! ..\n\nHope to see you on a rekt thread soon faggot.",
				"added": 1610282526
			}
		],
		"1610272179_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 3,
				"body": "> [anonynous38883](#comment_34_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): Use Whonix (the operating system) and install zeronet there. Is pass over tor zeronet !https://www.whonix.org/wiki/ZeroNet [...]\n\nAgain. Faggot",
				"added": 1610282586
			}
		],
		"1609818090_16GjpPqXFJ8Vv9bXgBPCNswucvtTeDU4C5": [
			{
				"comment_id": 4,
				"body": "> [anonynous38883](#comment_32_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): hi\n\nSup Faggot.",
				"added": 1610282649
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 5,
				"body": "> [userneonshine](#comment_10_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E): G\n\nE",
				"added": 1610342918
			},
			{
				"comment_id": 6,
				"body": "> [bimmyql](#comment_28_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): \">\" \">\" \">\" /pol/ [...]\n\n> [bimmyql](#comment_27_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): don't ruin another platform please\n\nThis guy is drunk.",
				"added": 1610346021
			},
			{
				"comment_id": 7,
				"body": "> [bimmyql](#comment_35_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): They'll associate the decentralized internet movement with your shitposting, and ruin it for the rest of us. Since you idiots aren't the ones who understand the technology or maintain it, eventually you'll get unplugged too when we give up on your lost cause. So, maybe shut the fuck up for once in your life? idk. [...]\n\nMan, This ((((guy))) really loves to say \"NIGGER\" three times in a row.",
				"added": 1610357588
			}
		],
		"1610343260_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [
			{
				"comment_id": 8,
				"body": "These countries need to fix their internal problems first. I like the idea of \"NATO 2.0\" but the USA needs to fix its problems first.",
				"added": 1610358095
			}
		],
		"1610273837_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "The CCP can't even invade Taiwan properly. What makes you think they can land LIVE chinks on Mars?",
				"added": 1610365104
			}
		]
	},
	"comment_vote": {
		"1_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"21_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"23_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"2_17h62jBGHSyC4TLHGbUEUFXVzCZomSTrb3": 1,
		"8_1Q1XaWRtj7SGymmyrop2PSmM35kHckmHjf": 1,
		"10_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": 1,
		"5_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"1_1BBH2zzYFaYBWqtCjFQ9nAtFsudzTX1eZY": 1,
		"7_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"12_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"11_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"37_18UukzxVzEwd9ugyvKWYe2vud77GyL72Px": 1,
		"6_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"3_14xmVmzUMAx4egBicMbRNkqkrrgRgLFgYg": 1
	}
}