{
	"file": {
		"Solomon Kane - O Caador De Demnios (2009) Dub PT-BR.mp4": {
			"title": "Solomon Kane - O Caçador De Demônios (2009) Dub PT-BR",
			"type": "video",
			"description": "Seja um apoiador do canal!\nBitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85\n\ndoando 0.00004 BTC = R$1,00(1 real) você já ajuda muito :)\n\n\né um filme de ação, aventura e fantasia dirigido por Michael J. Bassett, é baseado no personagem homônimo criado em 1928 por Robert E. Howard para as revistas pulp. Sua estreia se deu a 23 de dezembro de 2009.\n\n\nData de lançamento: 23 de dezembro de 2009 (França)\nDireção: Michael J. Bassett\nAutor: Robert E. Howard\nMúsica composta por: Klaus Badelt\nOrçamento: 40 milhões USD",
			"is_featured": 0,
			"image_link": "https://3.bp.blogspot.com/-wSTYQjsFaoo/USt-WqgLJUI/AAAAAAAAAAA/Qc0XaK2YRFA/s640/Solomon%2BKaneBRY.jpg",
			"size": 2182596947,
			"date_added": 1547893844
		},
		"InProprietrio  O Mundo do Software Livre (Dublado H264 AAC 2008).mp4": {
			"title": "InProprietário – O Mundo do Software Livre (Dublado H264 AAC 2008)",
			"type": "video",
			"description": "Seja um apoiador do canal!\nBitcoin: 1Gmu9gU2E5ss2rCPKA5aWX7KQFooyHzf85\n\ndoando 0.00004 BTC = R$1,00(1 real) você já ajuda muito :)\n\n\nO documentário mostra que os Sistemas Operacionais Livres tem uma série de vantagens que nos são escondidas: Necessita-se de um equipamento menos potente para desenvolver as mesmas tarefas do que o Windows, é muito menos suscetível à vírus, e consequentemente a problemas de mal-funcionamento, mas acima de tudo, o Sistema Operacional Livre está ligado ao conceito de liberdade. Liberdade de informação, de mudanças e alterações. Além disso o acesso ao código-fonte dá segurança às instituições públicas de saber exatamente o que o Sistema estará fazendo, ao contrário da caixa-preta que é o sistema operacionais privados.\nO Acesso livre ao código fonte faz também de vários usuários, colaboradores desse imenso projeto mundial, desenvolvendo-o, atualizando-o, melhorando-o constantemente. Não é a toa que Sistemas com a base GNU/Linux, como o Fedora, Ubuntu e Apache entre outros são extremamente velozes, seguros criativos e inovadores.\nSe você ainda não sabe nada sobre o assunto, enverede-se e surpreenda-se.\n“Quem está acostumado com o bom, não sabe o que é o melhor”.",
			"is_featured": 0,
			"image_link": "https://3.bp.blogspot.com/-JENGvnENq7Y/TcbxBddVlnI/AAAAAAAAAnA/87FCZ47FI4E/w1200-h630-p-k-no-nu/poster_inproprietario.JPG",
			"size": 172235729,
			"date_added": 1547967580
		}
	}
}