{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"6_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 1,
				"body": "> [4lexandre](#comment_1_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc):En ce qui concerne les SDF, j'ai bien conscience que certains d'entre eux \"dorment toujours dans la rue\" mais ayez aussi conscience que ce n'est absolument pas la faute des \"migrants\" qui, plus est, sont des réfugiés. Comprenez donc qu'ils ont besoin d'un endroit où ils peuvent au moins se sentir en sécurité en attendant que la situation de chacun de leurs pays d'origine revienne à la normale. Je reconnais encore que vos \"Français SDF dorment toujours dans la rue\" mais ils ne sont pas les seuls à vivre cette situation; il y a aussi les réfugiés parmi eux. Si vous vous plaignez de leurs sorts, ce n'est pas aux pauvres réfugiés que vous devez rendre des comptes mais à votre État et l’État, c'est vous et c'est moi. Bougez-vous le cul tout de même, si vous vous souciez tant d'eux. Franchement, ça ne sert vraiment à rien de vous plaindre si, au final, vous ne participez pas vous-même à des actions charitables d'associations collectives qui  leur sont dédiés. Des SDF, il en existe dans tous les pays du monde, même dans les soi-disants pays les plus pauvres de la planète, et, ce, depuis l'apparition de l'Homme. En soit, l'existence de SDF en France n'est pas un cas extra-ordinaire et particulier.Bref; si je vous parles de cela, c'est tout simplement pour vous montrer à quel point votre raisonnement xénophobe ci-dessus est absurde et ne sert uniquement qu'à diviser pour mieux régner sur la conscience de vos lecteurs.Pour autant, sachez que, selon moi, les \"vrais\" Français, les \"authentiques\", sont ceux qui sont fidèles aux valeurs universelles de la République française (\"Liberté, Égalité, Fraternité\") et des Droits de l'Homme et du Citoyen de 1789.\n> Cordialement, Alexandre.\n\nToi tes complètement à coté de la plaque sur toute la ligne.\n\n\" En revanche, l'Anglais, le Néerlandais, l'Allemand et le Français qui débarquent en Afrique du Sud n'a pas forcément de racine ethnique, ni même culturelle ou religieuse, en commun avec le peuple autochtone sud-Africain.Ça ne vous choque pas non plus ?!On peut aussi parler des États-Unis, de l'Australie, de la Nouvelle-Zélande et de tout autre État né de la de l'invasion... je veux dire... de la colonisation  européenne, si vous voulez.\"\n\nEntièrement d'accord, sauf que moi je parle de la france, et que concernant le cas spécifique de la France, ça fait maintenant presque près de 60 ans que la france est partie de l'afrique, donc ce discours sur les méchants colons français tu te le garde pour toi. \n\nDe plus selon Jacques Marseilles: \"empire colonial et capitalisme français\", la colonisation n'a pas rapporté de l'argent à la france mais lui en a fait perdre.\n\nDe plus, pour ceux qui diraient qu'en ce moment il y a une néo-colonisation en afrique de la part de la france et que c'est une raison du niveau de vie élevé de la france, je leur répond: Quid de la Pologne, de la république tchèque, de l'irlande de la finlande, de l'estonie, de la Letonie, de la Lituanie etc... Est ce que ces pays cités ont aussi colonisé l'Afrique? Non. Dans ce cas pourquoi est ce que ce sont des pays développés? Parce que ce sont des pays qui ont une administration et une capacité organisationnelle évoluée, ce qui n'est pas le cas de beaucoup de pays africains à l'heure actuelle. \n\n\"Je reconnais encore que vos \"Français SDF dorment toujours dans la rue\" mais ils ne sont pas les seuls à vivre cette situation; il y a aussi les réfugiés parmi eux. Si vous vous plaignez de leurs sorts, ce n'est pas aux pauvres réfugiés que vous devez rendre des comptes mais à votre État et l’État, c'est vous et c'est moi. \"\n\nL'Etat c'est pas vous, ni moins, ducon (désolé mais t'en tiens une couche en terme d'inculture). C'est une structure de domination entre les mains de la classe capitaliste. \n\nLa plupart ne sont pas des réfugiés mais des migrants économiques. Seuls 20% des migrants sont des Syriens. Le reste sont constitués majoritairement d'Erythréens, de Soudanais, de Somalien et d'Afghans. Or ces pays ne sont pas/plus en guerre. Donc l'arguement des réfugiés est un argument de bobo bien pensant.\n\n\"Des SDF, il en existe dans tous les pays du monde, même dans les soi-disants pays les plus pauvres de la planète, et, ce, depuis l'apparition de l'Homme. \"\n\nEncore une énormité. Toi t'as jamais lu Marx. Il fallait dire: depuis l'apparition de la civilitsation avec la révolution néolithique il y a -12000 ans. Pas de SDF dans la société primitive. \n\n\"En soit, l'existence de SDF en France n'est pas un cas extra-ordinaire et particulier.\"\n\nC'est Border464 qui parle des SDF. Pas moi. D'ailleurs c'est un assez mauvais exemple puisque les SDF français de souche il y en a de moins en moins du fait du RSA et c'est tant mieux. Je ne sais pas s'ils ont l'équivalent au Québec mais il devraient y penser le cas échéant.\n\n\"Pour autant, sachez que, selon moi, les \"vrais\" Français, les \"authentiques\", sont ceux qui sont fidèles aux valeurs universelles de la République française (\"Liberté, Égalité, Fraternité\") et des Droits de l'Homme et du Citoyen de 1789.\"\n\nEt là on termine par le clou du spectacle de la connerie. \n\nLa révolution française a été l'aboutissement du libéralisme en france. Elle a été le moment où le capitalisme, né au 13ème siècle, est passé en domination formelle. Cette révolution a totalement libéralisé les conditions de travail: Loi le Chapelier de 1791, qui étaient d'avantage protégées sous l'ancien régime.\n\nQuant à ta devise de merde \"liberté, égalité, fraternité\", en réalité, c'est liberté de circulation de la marchandise, égalité du prix des marchandises humaines sur le marché, et fraternité dans l'aliénation.\n\nT'as pas l'air d'être un mauvais bougre, mais ton idéologie bobo des années 80 à la sauce SOS racisme touche pas à mon pote est en chute libre depuis quelques années, et se réduit à peaux de chagrin. Dans quelques années, elle sera inexistante, et c'est ineluctable, et pas trop tôt. ",
				"added": 1483378913
			}
		],
		"7_1G4nMD7txaYAvdpDeroZ9f67K3gtHsGn8H": [
			{
				"comment_id": 2,
				"body": "> [zeptik](#comment_8_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY): Oui soutenons les pauvres petits flics qui ont choisit leur putain de métier de chien de garde et qui tape plus facilement sur du manifestant pré-pubère ou vieux désarmés quant eux sont armés de la tête au pied et protégé par une armure complète !Plainions ces assassins couverts par la loi de leur bavures incessante et étonnons nous de la mort de l'un d'entre eux tous les mois alors qu'ils savent que leur taf est risqué en y entrant... C'est moins normal qu'un FDP dans un métier à risque qui passe son temps à humilier des jeunes en banlieue se fasse tuer qu'un jean-benoit le rebelle, 16ans,  mort en manif parce qu'il a pas put fuir à temps... BAH VOYONS !!!\n> J'aurais du respect pour ces salles merdes de flics le jour où ils feront leur travail : nous protéger au lieu de nous casser les couilles !\n\nLa flicaille est consubstantielle du mode de production qui consiste en la séparation entre propriétaires des moyens de production et travailleurs.\n\nEn effet, il faut constamment protéger les propriétaires des moyens de production de la rébéllion des prolétaires.\n\nVoilà leur vrai rôle, faire rempart à la classe capitaliste.\n\nMédite là dessus.",
				"added": 1483636293
			},
			{
				"comment_id": 5,
				"body": "> [reotip](#comment_1_1ELqWR9VHttv1e5es9e5H5gRnpiqUZ6h5k): La France n'est plus une démocratie depuis bien longtemps. \n\nOui, et en fait il faut remonter non pas au début de la 5ème république, ni même la 3ème, ni même (la mascarade de 1789), mais bel et bien au moyen âge où dans les assemblées populaires il y avait la démocratie directe ainsi que dans les états généraux. https://fr.wikipedia.org/wiki/D%C3%A9mocratie_directe#Moyen_.C3.82ge",
				"added": 1484763699
			},
			{
				"comment_id": 13,
				"body": "> [rambotito](#comment_4_1KrJgpJqJij8zdhJ4gFZg7gscskgtCgNmX): La magistrature a supporté hier la manif de Paris contre les violences policières... Quelle honte pour l'Etat Français!\n\nTiens donc, la magistrature est contre le petit flic de rue, petit flic qui est je le rappelle le premier rempart contre un éventuel changement salutaire de système. \n\nLa question que je me pose, au delà des débats rabattus encore et encore autour de cette affaire, est comment peut on encore avoir la vocation d'être flic aujourd'hui?\n\nIls ont détesté par tout le monde:\n\n-la racaille,\n\n-les bobos (slogan tout le monde déteste la police)\n\n-les natio-tradi : manif pour tous où des familles ont été brutalisées par les flics. \n\n-les conducteurs (radars mobiles)\n\n-l'Etat, qui veut les remplacer par du privé, et l'europe (eurogencorp).\n\nBref. Je me dis, le simple fait de toucher un salaire justifie t il toujours à lui seul le fait de vouloir être flic aujourd'hui?\n\n",
				"added": 1487532720
			}
		],
		"5_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 3,
				"body": "> [zeptik](#comment_7_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY): MDR mais vous êtes vraiment teuber à se point ?La plus part des migrans viennent pour fuir leur pays en guerre à cause (entre autre) de la france. De plus je te signales que la majorité veulent même pas rester en France dans ce pays de con mais cherchent à rejoindre l'angleterre mais sont stoppés aux frontières vers callais et donc s'entasse en attendant de pouvoir passé...\n> Avant d'ouvrir vos gueules vous voulez pas vous renseigner ? J'ai dit renseigné pas vidé le cerveau par ces FDP de TF1/BFM qui vendent du migrants parasite pour se payer une belle montée d’audience histoire de caler plus de pub de fils de pute d'entreprise qui à grand coup de lobbying derrière iront murmurer à l'oreille d'un gouvernement que la guerre c'est bien pour relancer une économie...\n\nJe savais pas que l'Erythrée, le Soudan, la Somalie, l'Afghanistant étaient en guerre.\n\nDe plus concernant la Syrie, la guerre est terminée, mais devine quoi: il y aura toujours autant de migrants en 2017.\n\nConcernant Calais c'est faux: il y avait au plus haut environ 10000 migrants à Calais. En revanche il y a en France chaque année environ 340000 migrants.\n\nNe pas regarder la télé c'est bien, être un minimum précis c'est encore mieux.\n\n\nAussi tu ne peux pas considérer éternellement que c'est de la faute des français caucasiens (j'ai cru comprendre que t'était maghrébin), s'il y a la guerre dans ces pays. Vous êtes plusieurs millions de maghrébins en françe  non? Qu'est ce que vous attendez pour foutre le gouvernement français en l'air et le changer par un gouvernement qui ne ferait pas de guerre?",
				"added": 1483663320
			},
			{
				"comment_id": 4,
				"body": "> [zeptik](#comment_18_1DBmmXNFiZSkrcoqGVLMmxvPGFpR5UTyUY): Je sais pas pourquoi tu persiste à m’inclure dedans mais bon...Le fait qu'un grand nombre suivent la même idée ne signifie pas qu'elle est meilleurs... Sinon go windows, google et facebook :p\n\nAh parce qu'on ne pense pas comme toi on est nécessairement google, BFM, TF1 et facebook.\n\nPour la colonisation ferme là c'est fini depuis presque 60 ans. Ensuite Jacques Marseilles (qui n'est pas du tout un grand méchant nazi d'extrème droite comme il en existe beaucoup dans ta tête de bobo bien pensant) a démontré dans son ouvrage empire colonial et capitalisme français que la colonisation FRANCAISE a coûté plus à la france qu'elle ne lui a rapporté. \n\nQuant à tes remarques de \"petit blanc privilégié\" tu te les garde pour toi bobo. Mes arrières grand parents, grand parents, on bossé dur et ont versé leur sang dans les guerres. Ils étaient agriculteurs et ouvriers et non pas des nantis comme il n'existent que dans la tête du bobo, logique, en psychologie cela s'appelle une projection: tu projette ton propre ressenti de nanti issu de famille bourgeoise sur les autres.  Mes parents n'ont pas connus la guerre mais ont tout les deux bossé toute leur vie et bossent encore, et je bosse.\n\nDe toute façon bobo j'ai un scoop pour toi qui n'est pas de BFM Tv, mais de l'avis qu'ont les gens dans la vie réelle et sur le net du bobo: le français moyen ne vous supporte plus. Ton idéologie immigrationiste se réduit d'année en année et finira en peau de chagrin puis en néant absolu. \n\nEt ça, tu ne peux absolument pas le nier. \n\nCependant jusqu'au bout vous serez une nuisance. \n\n\nPS: ce n'est pas 34000 migrants par an mais bien 340000. T'as vraiment le cerveau qui bug. Refuser de voir le réel même dans un chiffre mathématique.",
				"added": 1484179986
			}
		],
		"1_1pGdkP4RBt8QW66TEBLLY3124RzVw4mSg": [
			{
				"comment_id": 6,
				"body": "Dsl j'y connais pas plus que toi en matière de création de Zite.",
				"added": 1485103680
			}
		],
		"1_1N9tAvwFBRBWBpYMtek2XzdW8JvyJdMRHu": [
			{
				"comment_id": 7,
				"body": "Un peu bordélique. Assez peu ergonomique. Même les Zerosites sont mieux faits...\n\nSinon sur le contenu il y a tout et n'importe quoi. Pas mal d'infos vérifiables, mais j'ai l'impression que c'est assez branché E.T, ce qui est un parti pris.\n\nPas mal en définitive. Mieux que le site de l'immonde, l'abération, le cigaro, France-infaux and co et leur mainstrimisme à deux balles.",
				"added": 1486261294
			},
			{
				"comment_id": 9,
				"body": "> [lolman2323](#comment_1_1ANMqHnEZHwPmbSUj4yKWMpLaDxcY5JhZS): http://www.alexa.com/siteinfo/egaliteetreconciliation.fr\n\nJe comprends pas que l'audience d'égaliteetreconciliation.fr augmente même après les frasques de Soral, et aussi et surtout la censure qui sévit sur leur site concernant les coms.\n\nPeut être fait il le plein chez les musulmans.",
				"added": 1486487071
			}
		],
		"1_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc": [
			{
				"comment_id": 8,
				"body": "L'OTAN oui ça urge. Ce truc est le bras armé de l'hégémon anglo-américain. Cette magnifique \"alliance\" (forcée) atlantique est un aimant à conflits. Dans un récent sondage (de tête), seuls 48% des américains sont encore favorable à ce \"truc\".\n\nNo comment: https://www.youtube.com/watch?v=m3vqLb3md_o",
				"added": 1486261611
			},
			{
				"comment_id": 10,
				"body": "> [4lexandre](#comment_6_16ruLucRLto6GhT1Zb3P8JVZzC48fxd9Cc): Sans vouloir prendre sa défense, peux-tu me dire précisément dans quelles guerres Barack Obama a-t-il engagé son pays ? Je veux que tu m'en fasses une liste.\n\nIl a engagé la guerre en Syrie. Les US ont financé Daesh c'est même mainstream depuis pas mal de temps (pour construire un pipeline passant par la Syrie à destination de l'Europe et en provenance du qatar).\n\nConcernant l'Afghanistan et l'Irak, il n'a pas engagé à proprement parler les USA dans ces conflit mais n'a pas retiré les soldats aussi vite qu'il l'avait promi (fin 2011 seulement). Et il y a toujours des soldats US en Afghanistan. \n\nConcernant la Libye, les US ont joué un rôle important en soutien de la france dans l'attaque de ce pays (qui empêchait l'immigration massive de pays africains plus au sud notamment), pour le bénéfice de total. ",
				"added": 1486904313
			},
			{
				"comment_id": 11,
				"body": "> [starlord](#comment_4_17UMVmdiRu9jCT25dztFa3rJ1DoQhduZLc): Contre : nous avons un poids économique sans équivalant avec l'euro, un  Frexit serra catastrophique pour notre économie et nous mettra à la merci du libéralisme. Tout changement de politique serra rendu impossible par la pression des marché qui conspireront comme notre contre notre marché... Il est par contre urgent de renégocier les traité européen car ce n'est pas que la France  qui va mal mais l’Europe tout entière.\n\nToi t'as pas lu Zbigniew  Brzezińsky (le grand échiquier). L'europe est une construction destinée à empêcher une alliance Allemagne-Russie qui permettrait de créer une nouvelle superpuissance en alliant le savoir technologique allemand avec les immenses matières premières russes.\nLe vrai ennemi des Etats-unis, ce n'est pas l'Iran, la Syrie, ou même la chine, mais bien la france et surtout l'allemagne.",
				"added": 1486904559
			},
			{
				"comment_id": 12,
				"body": "> [lama](#comment_1_1Jz8s58P2G7aJ2vKVxn8r9JkakQz6ayXwo): Oui mais à la condition que ça engendre de nouvelles alliances/un nouveau groupement de pays anti{capitalistes, imperialistes}\n\nEuh moi je connais aucun pays au monde anti-capitaliste. Le capitalisme est déjà en domination réelle, et rien n'arrête le mouvement de l'histoire. \n\nLe seul choix que tu peux faire, c'est  l'extrême gauche du capital, l'extrême droit du capital, et ce qu'il y a entre (social démocratie, libéraux, etc...).\n\nAnticapitalisme= abolition de l'argent, abolition de l'Etat. Et c'est pas négociable.  \n\nPS: pour ceux que ça intéresse, je renvoie au excellentissimes vidéos (et éventuellement livres), de Francis Cousin. ",
				"added": 1486904722
			}
		],
		"1_1G1rxLmkA3aWSFCxKLiq7VPk1N6Jc4H5wU": [
			{
				"comment_id": 14,
				"body": "Il y a quelque chose de bizarre dans les films de Zemeckis, et notamment dans retour vers le futur.\n\nPuisqu'on est sur Zeronet on va se lâcher: il y a moyen que Zemeckis soit un agent illuminatis, ou quelque chose dans ce genre. De la même façon que Kubrick (eyes wide shut). Pourtant il ne m'a pas l'air d'être quelqu'un de nécessairement mauvais. Se pourrait il que toutes les personnes de cette organisation ne soient pas démoniaques? \n\nBeaucoup d'éléments dans retour vers le futur, mais aussi dans l'excellent film contact.\n\nhttps://www.youtube.com/watch?v=P1ULjJ3EqyY",
				"added": 1489270444
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 15,
				"body": "> [185185](#comment_7_1EZzNxPxXMSXmEMwJSU3U8jcgjfdAeyTfr): ca y est !!!! :::: http://127.0.0.1:43110/1JMuapWVoZWAYgty4fdo3ngopAULbCPC6i/ ca peut remplacer pleer en plus il sont en maintenance. Sick\n\nPas mal du tout.",
				"added": 1489877079
			}
		]
	},
	"comment_vote": {
		"16_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1,
		"7_1EZzNxPxXMSXmEMwJSU3U8jcgjfdAeyTfr": 1,
		"7_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1,
		"9_1K4VbAenZNLx3J6QFZrzWFw2xoZjBYYPKv": 1
	}
}