{
	"title": "NewSMTH",
	"description": "水木社区非官方博客\n理性中立客观\n舒适休闲娱乐",
	"links": "*   [leaflet的小屋](http://127.0.0.1:43110/leafok.bit/)\n*   [陈佳的博客](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/)\n*   [特快零网基地](http://127.0.0.1:43110/ZeroBBS.bit/?Topics:6_1FvnsJWRafUBWfdGpLm9DbtMQwFTaGjQBD/+NewExpress)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1508475446,
	"post": [
		{
			"post_id": 7,
			"title": "关于中医的一些错误认识",
			"date_published": 1507987466.442,
			"body": "概念性错误：\n不能区分中医理论，中药，中医疗法的区别，笼统的称为中医。\n\n常见错误观点：\n某人看中医好了，所以中医有用\n某人看中医死了，所以中医没用\n\n高明一点的错误观点：\n一百个病人看中医，90个好了，所以中医有用\n一百个病人看中医，90个没看好，所以中医没用\n\n更高明一点的错误观点：\n同一个病，100个看中医，100个不治疗，看中医好了90个，不治疗好了30个，所以中医有用\n\n迷惑性很强的错误观点：\n因为中医理论都错误，所以中医疗法，中药必然无效。\n这点迷惑性很强。举个例子看一下：\n假如一个生活在北半球的人认为：夏天太阳离地球近、冬天太阳离地球远，然后“推论”：夏天比冬天热。可以看到前提是错误的，结论是正确的。\n为什么？请自行思考。独立思考，从现在开始。\n\n正确观点：\n具体到某种病，某种治疗方案，无论中西医，用随机对照双盲的方法得出结论\n不会笼统地说中医有效或无效\n能认识到 无效 和 没有证据证明有效 的区别"
		},
		{
			"post_id": 6,
			"title": "转：穆斯林的人口比例与行为的关系",
			"date_published": 1502105337.135,
			"body": "当MSL人口在一个国家少于2%时，他们中的大多数会被认为是爱好和平的少数民族，不对其它公民构成威胁；\n这种情况的国家为：\n美国 0.6%\n澳大利亚 1.5%\n加拿大 1.9%\n中国 1.8%\n意大利 1.5%\n挪威 1.8%\n\n* * *\n\n在2％至5％，他们开始向其它少数民族和心存叛意的群体传教，往往从监狱中和街头帮派大规模的吸收新成员；\n这是发生在：\n丹麦 2％\n德国 3.7％\n英国 2.7％\n西班牙 4％\n泰国 4.6％\n\n到了5％，他们会行使突破人口比例平衡的过度影响；\n例如，它们将推动对清真（回教标准清洁）食品引进，从而确保清真食品的从业人员由MSL担任；\n它们会对连锁超市施加压力，在他们的货架上标注清真特性，并伴随着威胁不愿遵守的对象；\n这是发生在：\n法国 8％\n菲律宾 5％\n瑞典 5％\n瑞士 4.3％\n荷兰 5.5％\n特立尼达和多巴哥 5.8％\n到了这一步，他们将努力争取政府的授权，使他们能够在MSL聚居区根据自己的教法行使伊斯兰法；\n伊斯兰主义的最终目标是在整个世界建立伊斯兰教法；\n\n当 MSL接近人口的10％，他们试图增加法律条款，把“表达对MSL不满”定为非法；\n在巴黎，我们常看到汽车烧毁；\n任何非MSL的行为被认为冒犯了伊斯兰教，结果就是暴乱和恐怖；\n如在阿姆斯特丹，由反穆罕默德的漫画和电影导致的结果；\n每天看到这种紧张状态，尤其是在MSL区域；\n在：\n圭亚那 10％\n印度 13.4％\n以色列 16％\n肯尼亚 10％\n俄罗斯 15％\n\n在它们达到20％，可以预知此国家处于骚乱一触即发的状态，圣战武装的零星屠杀，和焚烧基督教堂和犹太教堂；\n如在：\n埃塞俄比亚 32.8％\n在40％，各国会经历大屠杀，持续不断的恐怖袭击，正在进行的武装内战：\n波斯尼亚 40％\n乍得 53.1％\n黎巴嫩 59.7％\n\n从60％起，国家将不受制约地迫害所有其它异教徒（包括不顺从的MSL）和零星的种族清洗（种族灭绝）；\n以伊斯兰教法作为武器对异教徒实行加税等岐视；\n如这样的：\n阿尔巴尼亚 70％\n马来西亚 60.4％\n卡塔尔 77.5％\n苏丹 70％\n\n到了80％以后，预计每天都在恐吓、暴力、圣战，一些种族清洗，甚至一些大屠杀；\n因为这些国家驱逐异教徒，把100%作为目标，如已在某些方面经验丰富；\n现正进行的：\n孟加拉国 83％\n埃及 90％\n加沙 98.7％\n印尼 86.1％\n伊朗 98％\n伊拉克 97％\n约旦 92％\n摩洛哥 98.7％\n巴基斯坦 97％\n巴勒斯坦 99％\n叙利亚 90％\n塔吉克斯坦 90％\n土耳其 99.8％\n阿拉伯联合酋长国 96％\n\n100％将迎来和平'达累斯萨拉姆'伊斯兰和平之家；\n这里有应该是和平的，因为大家都是MSL，Madrasses是唯一的学校，可兰经至高无上经典；\n如：\n阿富汗 100％\n沙特阿拉伯 100％\n索马里 100％\n也门 100％\n不幸的是，和平是永远不会实现；\n因为在这些100%纯国家里最激进的那部分MSL相互胁迫着发泄仇恨，为满足嗜血的欲望屠杀那些相对不太激进的MSL，以各种各样的理由，自相残杀。\n\n由此看来，中国MSL人口比例已经在2%-5%之间，这还是平均数据。"
		},
		{
			"post_id": 5,
			"title": "[转载]天津静海传销猖獗，警察包庇不作为zz from天涯",
			"date_published": 1501726520.3,
			"body": "[http://bbs.tianya.cn/post-59-661665-1.shtml](http://bbs.tianya.cn/post-59-661665-1.shtml)\n\n---\n\n　　我妹妹于4月15日左右被传销集团骗到天津静海县搞传销活动，我在23日接到妹妹电话，她在电话里支支吾吾，说话时暗示旁边有人，要我帮忙汇钱过去她做点事，然后妹妹趁机给我在微信发了个地址，电话就被匆忙挂断了，我们全家都意识到她应该是被传销集团控制了。于是，我于24日与家人一起赶赴天津市，根据妹妹在微信留下的地址：静海县静海镇华苑小区公寓旁边，我们在华苑小区旁一遍遍搜寻，终于在旁边的一间瓦房里发现大堆可疑人物活动，后来我们确定了妹妹就在这瓦房内，于是我们赶到辖区的静海镇西城派出所报案，15时30分许，派出所两个民警跟着我们赶到可疑地点，我们进瓦房后，发现里面有十几名年龄约15至20岁的年青人，其中有五六名是女孩，然后警察问他们谁想出去的，有一女孩站出来说想出去，又被警察吼着：滚回去，我在现场拍了几张相片，被警察叫删掉了然后还检查我手机，然后警察又把这伙人的上线叫出来带回派出所，叫这名上线打电话叫他们组织放我妹妹出来，原来我妹妹不在这个窝点，是在旁边的另一个窝点。过两个小时后，我妹妹被传销组织的带到派出所，我们接了妹妹后，这个派出所的警察还要找我们要出警费3000元，我们不理后把妹妹带出来了，根据向妹妹了解的情况得知：这个传销组织规模上万，里面有很多人没从家里拿到钱的都给控制了，不给出去，当地派出所警察都跟这个组织有关系，经常有人报警也没用，这个传销组织已经存在很长一段时间了，每天都有很多人从全国各地被骗来，根本没人管。本来妹妹救出来了，我也不想再惹太多闲事，但想着当时在窝点里看到那些女孩子渴望出去的眼神，我觉得必须要把这个事情揭露出来，为了不让更多人受害，能让当地相关部门引起重视，把那些可怜的受害者解救出来。请求看到这贴的都帮忙转发，引起更多关注，谢谢大家\n\n放肆的饭饭：\n举报 2017-02-14 15:02:14 评论\n我是昨天晚上刚被我哥从静海传销窝点救回来的，当地警察跟传销人员都是穿一条裤子的，我当时发了求救信息，我朋友替我报警后他们根本就没有搭理，最后是我哥带着人找过来，公安局的人才联系传销头目放的我！而且当地警察对这些传销窝点都清清楚楚，如果家人不过去，警察是根本不会管的\n\nvhkdgj：\n2017-02-20 15:36:35 评论\n评论 放肆的饭饭 ：你好，我表弟也是2，14号左右被骗进去的，他在天津上大学，几天前老师打电话说他可能被传销组织骗了，在静海区，现在她妈妈非常着急，家人快崩溃了，麻烦你能说下他们的地址吗，我们想办法救他，谢谢你了\n\n15662689745：\n举报 2016-08-03 12:44:56 评论\n@呉葰 静海的警察跟那些传销狗蛇鼠一窝，我在城西派出所报案，值班民警说最好不要报案，比较麻烦，然后那些传销狗就多次打电话给我，让我去城关派出所，幸亏没去，那个派出所应该都是他们的人，回来后部队的人让我把他们的详细信息给他们，说带兵帮我报仇，想着还是等等吧，"
		},
		{
			"post_id": 3,
			"title": "JAVA求职少年之死，疑与传销组织有关",
			"date_published": 1501726038.104,
			"body": "事到如今，丁页城依然自责着。在李文星告诉丁页城自己要去天津工作的时候，就曾跟他提过：“就只有电话面试了我一下，我都不知道（这工作）靠不靠谱，我怕是传销的。”然而在那样的情况下，他却依然没能拦住他去天津入职。\n\n---\n\n只因为李文星太渴望一份工作了。\n\n芥末堆 天一 吉吉 8月2日报道\n\n5月15日，李文星在招聘平台上发送简历。\n\n5月19日，收到聘用通知函。\n\n5月20日，从北京前往天津入职。\n\n7月8日，给母亲打最后一个电话说：“谁打电话要钱你们都别给”。\n\n7月14日，尸体在天津静海区被发现。\n\n短短两个月的时间，却成了李文星家人一辈子都挥之不去的梦魇。一份本以为是上市公司敲门砖的Offer，最终却让从东北大学12级学子李文星走向了生命的尽头。而当初在互联网招聘平台“BOSS直聘”上与李文星联系的北京科蓝公司，只不过是一家冒名招聘的“李鬼”公司。\n\n在过去的两个月里，去天津“报到”后的李文星态度冷淡、频繁失联、多次借钱，根据他出事前的种种反常的迹象，同村的大哥李刚毅认为：“只有可能是被骗到了传销组织里，没有别的可能性。”\n\n“你哥在天津出事了”\n\n今年23岁的李文星出生于山东德州的一个农村家庭，去年刚从东北大学的资源勘查工程专业毕业。李文星的双胞胎妹妹李文月说，作为家里唯一的大学生，从小成绩优异的哥哥曾是他们全家的希望。\n\n大学毕业后，李文星并不想找个与本专业有关的工作。“他如果做资源勘查，总是要出远门，但我们爸妈年纪大了，他想离家近一点，可以照顾父母。”李文月说。因此和家里商量后，李文星决定在北京报个IT培训班学习Java，之后找个IT行业的工作。\n\n李文星在BOSS直聘上给一位Boss的回复称：\n\n“找一家公司，可以在那边长远地发展，走技术路线，三年做到高级工程师”\n\n这是他给自己定的未来职业规划，但这一规划在半个多月前却戛然而止。\n\n7月15日，李文月意外的接到了母亲的电话，“你哥在天津出事了，你快去派出所看看吧。”听到电话里母亲带着哭腔的声音，李文月感到难以置信。挂了电话后，她不停地对自己说：“那肯定不是我哥，一定是他们搞错了。”\n\n微信图片_20170802023110.jpg\n\n发现李文星尸体的水坑\n\n据了解，就在一天前，有人在天津市静海区G104国道旁的一个水坑里发现了一具少年的尸体。由于长时间浸泡在水中，少年的长相、身形已无法辨认，但遗物中的身份证显示，他叫李文星，来自山东德州。随后，天津警方通过山东德州警方联系到了李文星的家人，并通知其前往天津辨尸。\n\n“当时我一遍又一遍的问那个警官，我哥的身份证为什么会出现在那个人的身上？”李文月回忆称，当时她根本无法相信这个死者就是自己的哥哥，一直以为是哥哥的身份证丢了。因为在她的印象里，这个时候哥哥不可能出现在天津，而且还是出现在一个“前不着村，后不着店”的地方。\n\n“冒牌”公司的offer\n\n时间回到两个多月前的5月15日，在北京天通苑的一间出租屋里，李文星刷着BOSS直聘，不停给招Java岗位的Boss们发送着信息，这样的行为已经持续很长一段时间了。\n\n在那之前的半个月，李文星的同村发小李昊阳来北京出差，想找机会和他聚一下，但那时李文星却告诉他，自己出差了，不太方便。\n\n在李昊阳的印象里，李文星从小到大就是一个自尊心特别强的人。而当时，李文星其实就在自己的小屋里不停地找着工作。\n\n这间小屋是他和大学同学陈栋合租的，房租是每人800元。当初他早于陈栋半年来的北京，住在李刚毅的家里，但他似乎并不喜欢这样的“依靠”。“他特别想自立，那时我们都劝过他，但他坚持要搬出来。”李文星的高中同学丁页城说，李文星脾气很倔，如果他想做某件事，基本就没人能劝回他。\n\n当天是周一，陈栋已经出门上班，李文星独自一人在家找工作。李文星的BOSS直聘聊天记录显示，从早上的9点21分到下午3点29分，6个小时的时间李文星一共向20位Boss发送了消息，唯一收到的回复来自“北京科蓝”人事部的薛婷婷。\n\nWechatIMG6_meitu_1_meitu_2.jpg\n\n李文星与薛婷婷在BOSS直聘上的聊天记录\n\nBOSS直聘上的聊天记录显示，在回答了薛婷婷“是否毕业？是否单身？是否有贷款？”几个问题后，李文星将简历发送给了她。\n\n陈栋回忆说，5月18日北京科蓝电话面试了李文星，在电话里还问了一些比较专业的问题。第二天，对方和李文星确认面试通过了，说Offer会在稍后发给他。\n\n在李文星的网易邮箱里，芥末堆看到了这份所谓的Offer，发自于一个昵称为“五杀乐队”的QQ邮箱。Offer中的信息显示，招聘方“北京科蓝”的全称为北京科蓝软件系统股份有限公司。Offer中要求李文星5月20日去天津滨海高新区软件园报到。\n\nlwx_看图王.jpg\n\n李文星收到的入职聘用书部分截图\n\n丁页城告诉芥末堆，在电话面试结束后，李文星还和他商量了一下这个工作机会，跟他说了自己的想法：“就只有电话面试了一下，我都不知道靠不靠谱，我怕是传销的。”丁页城说，可以让自己在天津的朋友帮忙打听下，让李文星先别去天津，但没想到他犹豫了一下还是直接去了。\n\nWechatIMG17_meitu_5.jpg\n\n李文星与丁页城的对话\n\n在得知李文星的事情之后，芥末堆曾试着通过电话联系北京科蓝软件系统股份有限公司，询问BOSS直聘上招人的“人事部薛婷婷”和Offer提到的联系人“人事行政部王文鹏”是否是这家公司的员工，对方表示，他们公司并没有这两名员工。\n\n此外，北京科蓝软件系统股份有限公司的工作人员告诉芥末堆，他们的邮件都是通过企业邮箱发送给求职者，而不是个人的QQ邮箱。\n\n不归路的起点\n\n5月20日上午，李文星带着几套换洗的衣服和一台笔记本电脑，独自乘城际列车去了天津。出发前，陈栋还问他要了家里的电话，提醒他如果去到居民楼什么的注意点。因为以新闻里的信息来判断，传销组织一般都隐藏在居民区里。\n\nWechatIMG13_meitu_4.jpg\n\n李文星购买车票的通知\n\n李文星到天津的时候已是中午，他在QQ上给李文月发送了一个在滨海新区的位置。下午2点41分，李文星发给陈栋的位置则显示，当时他已到了天津静海区。在看到李文星发送的位置后，陈栋问：“到了?”李文星却突然没了回复，一直到晚上6点20分，李文星才给他回了一句“嗯”。\n\nWechatIMG16_meitu_6.jpg\n\n李文星给陈栋发送在静海的定位\n\n包括李文星在内，他和他的亲人朋友们都没意识到的是，天津静海是各种非法传销组织盘踞已久的地方，在网上，从2004年至今的13年间，媒体对静海官方打击传销的报道几乎未曾断绝。\n\n当天晚上，李文月给哥哥打了个电话，“我问他在哪，他说在滨海找了个小旅馆先住下，明天去面试。”根据事后陈栋等人透露的信息，李文月猜测，当时哥哥可能就已被人控制，因此下午就已到了静海的他，却称自己住在滨海，这两地距离80公里，如果坐公交车的话要2个多小时车程。\n\n在李文月给李文星打电话的同一时间，陈栋又给李文星发微信问他是否入职了，还跟他讲了些自己公司里发生的事。然而当晚陈栋发了6条微信，李文星却没有回复过他。\n\n而从此之后，李文星的所在之处便不再被亲人和朋友详细了解，并且在天津和河北石家庄两地开始来回切换。\n\n第二天早上，李文月又给李文星打了个电话，“我问他在哪，说我去看他吧，但他却突然跟我说，他已经去石家庄上班了。”\n\n上午刚和要去看他的妹妹说去石家庄了，中午李文星却回复陈栋的微信说，自己要去天津的公司看一下。到了晚上 8 点，又突然告诉陈栋，他不在天津了，到石家庄了，“他说有个朋友的亲戚在石家庄的公司管事，他明天去那家公司，晚上先住在朋友那。”陈栋回忆说。\n\n丁页城得知李文星去石家庄的时候已经是5月27日了，当时的他并不知道李文星和妹妹还有陈栋之间的对话，但依然觉得特别奇怪。他告诉芥末堆，李文星的朋友，很多他没见过，但几乎都听说过，但在他的记忆里，从高中他俩认识开始，李文星就没有什么在石家庄的朋友。\n\n此外，李文星当初产生来北京的想法时，跟很多人都商量过，而且到了北京之后，他一心想在北京找家公司好好学习点技术。在丁页城看来，这样的李文星，是不会随随便便就去别的地方找个工作的。5月8日的时候，李文星曾在BOSS直聘上联系过一家公司的Boss，对方回复工作地点在天津，李文星毫不犹豫地拒绝了。\n\nWechatIMG24_meitu_11.jpg\n\n今年5月，李文星曾放弃了一份去天津的工作\n\n“文星可能根本就没去过石家庄，只是有人怕天津的妹妹要去看他，才逼着他说自己去了石家庄。”这几乎成了事后李文星家人和朋友达成的共识，根据之后的种种情况，他们推测，可能李文星在给陈栋发送完那个在静海区的位置后，就已被人控制了。\n\n从不借钱的他半个月借了三次钱\n\n李文星是个什么样的人？除了倔之外，“自尊心很强”是他的家人和朋友给他最多的评价，从小到大都是如此。\n\n“2014年的时候哥哥还在上学，我手机摔坏了，没敢和家里说，就跟我哥说我手机坏了，但我没有钱，我哥二话没说就挤出了两个月的生活费给我买手机。”李文月说，刚开始她以为家里给哥哥打了很多钱，但后来通过母亲才知道，哥哥压根就没有多余的生活费。\n\n即使是在这种一学期的生活费少了将近一半的情况下，李文星依然没有问任何朋友寻求过支援。从发小到同学，每个人印象里的李文星，都是一个即使再难，也不会开口向别人借钱的人。但当李文星去了天津之后，他们发现，他“变了”。\n\n5月21日之后，陈栋和李文星之间近乎失去了联系。陈栋几乎每晚都给李文星发微信，但李文星一直没有回复过。陈栋说。“22号晚上我给他打过一个电话，但当时他的语气特别冷，特别平淡，我以为是他当时比较忙。”\n\n直到5月25日，李文星竟然主动联系了陈栋，直截了当地说：“借500，转我支付宝就行。”陈栋提出让他说句是本人的话，他发了语音“你转我支付宝吧”。\n\n“因为那会他已经好几个月没收入了，我知道他剩下的钱不多了，而且之前我也跟他提过手里没钱花了和我说，所以就觉得借钱是件很正常的事。”陈栋告诉芥末堆，李文星还跟他说，过几天还他。\n\n李文星再一次主动找陈栋，已经是6月8日了。看到三句“在吗”、“吃了吗”、“最近怎么样”完全不像是以前说话风格的问候，陈栋还开玩笑地问道：“你是李文星？”更加出乎意料的是，上一次李文星说“过几天还他”的钱还没还，这一次又是来借钱，而且还是以一次从未发生过的“借钱行为”为由。\n\nWechatIMG26_meitu_10.jpg\n\n第二次问陈栋借钱的李文星\n\n陈栋有些不解，李文星告诉他去年通过微信给他转了1000元，但他并没有在微信里查到当时的转账记录，“这次我觉得不对了，我没问他借过钱，而且他也不会用这种借口管我要钱。”虽然意识到了异常，但陈栋没有深究到底，事到如今他依然内疚着。\n\n当晚，在找陈栋借钱的几分钟前，李文星同样以“花呗还不起了”为由，让丁页城向他的支付宝转500元，还把自己的手机号发了过去。丁页城看到对方发过来的的确是李文星的手机号，就没有太多的怀疑，直接给他打了500元。\n\nWechatIMG23_meitu_8.jpg\n\n芥末堆尝试向李文星的支付宝转账\n\n如今，芥末堆再去尝试给则这一手机号转账的时候，系统已显示“账号不存在，或对方关闭了‘通过手机号找到我’隐私开关”。李刚毅告诉芥末堆，出事之后，他将李文星的电话卡补了回来，试图登录他的支付宝找些线索，但结果却是李文星的支付宝已被注销。\n\n“谁打电话要钱你们都别给”\n\n李文星再一次出现，是在6月28日。那天上午，他开始找同学给他的微信发送验证码，说是手机丢了。当天还联系了母亲，让她把她和父亲的手机号发给他，说“他忘了他们的号码”。\n\nWechatIMG19_meitu_7.jpg\n\n李文星问家里要手机号\n\n对于这事，李文月有些纳闷，母亲的手机号已用了两三年，父亲的更是从一开始用手机就没换过号，至少七年了，哥哥怎么会忘了呢。\n\n从5月20日到了天津，到6月底声称手机丢失，这期间，李文星虽然变得不太“正常”，但断断续续依然和家人朋友保持着联系。\n\n“7月8日晚上，他给家里打了个电话，跟我妈说‘谁打电话要钱你们都别给’，之后就再也没有出现了。”李文月说，直到7月14日，哥哥的尸体在国道旁的那个水坑里被发现。\n\n“我哥从小到大都不惹事，我妈对他一直挺放心的，所以就大意了。”李文月的声音里带着哭腔，哥哥上大学的时候，因为怕骗子给家里打招聘电话，也跟母亲说过类似别给钱的话，而这一次事后回想起来极为严重的这一句“警告”，却因为家里对他“太过放心”而大意了。\n\n“李文星”案并非个例\n\n在芥末堆的调查中，发现这类虚假岗位的招聘者目标大多是像李文星这样刚刚步入社会的大学毕业生，他们往往社会阅历浅，并且急于找到一份工作在大城市生存下去，对招聘者缺乏警惕性并且不能识破骗局。\n\n在去天津之前，李文星自己也曾怀疑过这份工作的靠谱性，但最终他却还是选择去了天津，李文星做出这一决定的原因我们已无法得知。他的室友陈栋猜测，“当时他找工作的时间也挺长的，可能心里比较着急吧。”\n\n痛苦的求职经历和略为固执的性格是李文星走向骗局的两个重要因素。\n\n去年12月从达内培训完后，李文星在北京一家信息公司找了一份做Java工作，开始了试用期。“程序员特别吃经验，他没有工作经验，所以在那家公司不是很如意。”丁页城告诉芥末堆，最终，李文星没能经过试用期的考核，离开了那家公司。\n\n由于长期找工作的不顺，李文星有时的状态并不是很好，还向陈栋抱怨过：“985学校的毕业生还不如一个二本的计算机专业毕业生。”\n\n在求职的这几个月里，李文星不是没有过工作的机会。李刚毅告诉芥末堆，他通过朋友给李文星在新东方教育集团找了一份工作，但在一直没找到工作的情况下，李文星依然不肯接受这份别人帮他找到的工作。\n\n急于自己求职的李文星被李鬼“北京科蓝”钻了漏洞，而利用招聘进行骗人的李鬼公司却不止这一家，李文星的遭遇也并非偶然。\n\n几个月前，知乎网友“大奔奔”曾陪做前端开发的女友从北京出发去天津参加“中科软科技公司”的复试，对方称入职之后要在天津跟三个月的项目，结束后可回北京。\n\n到了天津之后，和他们联系的人事部经理给了他们一个位于天津静海区的地址，让他们做公交过去。等他们到了公交站后，说让他们等会，喊个朋友去接他们。“朋友”二字让大奔奔瞬间提高了警惕，给中科软总部打了个电话，查询是否有这位人事部经理，最终的结果是查无此人。\n\n微信截图_20170802045225.jpg\n\n网友大奔奔在知乎上分享类似的经历\n\n“接着我给我天津的朋友打电话，询问情况，他疑惑地问我，为什么去静海区，说静海区特别偏僻，并且那边传销很猖獗。”大奔奔在知乎上分享自己的经历时说到。\n\n在公交站等候的时候，他们还遇到了一位和他女友情况类似的男生，那位男生面试的是另一家公司，也在等人过来接。之后他们把和联系人的电话一对比，发现和他俩联系的竟然是同一个电话。\n\n通过搜索引擎，芥末堆还发现了很多网友类似的案例。套路大多是冒充知名企业招聘，对求职者进行电话面试，而且面试的问题还比较专业。电话面试结束后，告诉你有项目在天津，然后找理由让你去天津，并告诉你一个天津比较繁华的地方。等你到了天津后，再找理由让你去一个天津比较偏僻的地方，让你在那等他们。\n\n调查：冒名科蓝，十分钟收到18个求职意向\n\n为什么明明是一家李鬼公司，却能冒充上市公司在BOSS直聘上进行招聘呢？\n\n芥末堆在BOSS直聘上体验了一下发布招聘的流程。发布招聘信息前，Boss需要填写你的公司、职位和邮箱。只要选择BOSS直聘系统里搜索得到的一家公司，然后加入公司，再填写你的职位和邮箱后，就能发布招聘信息，期间没有察觉到有任何审核的环节。\n\n7月26日，芥末堆记者以科蓝公司市场主管的名义发布了一则Java的招聘，很短时间内便可以直接和应聘人沟通，而在发布不到10分钟内，就收到了18个求职者的求职意向。\n\n上周五，芥末堆与BOSS直聘取得联系，在给芥末堆的回复中，BOSS直聘方面称：“目前，所有在BOSS直聘上发布的职位，都必须经过审核，有问题的职位一经发现，会立即给予驳回和隐藏处理。BOSS直聘还在BOSS招聘过程中对用户设备、IP、职位描述、加密后聊天内容等数据以及各类行为特征进行实时监控，对出现问题的账户进行冻结封杀。”\n\n今日下午，BOSS直聘发布官方回应，称已在第一时间将有关的数据提取并保存，以便随时配合案件调查。传销与诈骗是这个社会巨大的毒瘤。用户和平台都深受其害。BOSS直聘将积极配合有关部门和家属，找出真相，让坏人受应有的制裁。他们愿与一切正义力量一道，为铲除传销和诈骗持续做出努力。他们相信和尊重法律，在一切水落石出之际，依据法律应当承担的一切责任，他们都愿意彻底承担。\n\n在网上， 有不少人分享过与李文星相似的经历，但他们却远比他幸运地多。李文星曾经和独自一人留在德州老家务农的母亲提过，如果天津的工作不行，他就直接回家看看。天津的工作的确“不行”，但在家的母亲却始终没能等到回家看看的他。\n\n得知李文星出事的当晚，李刚毅凭着记忆找到了李文星和陈栋住的那栋楼，挨家挨户敲门寻找陈栋。在联系到了陈栋之后，又通过陈栋找到了丁页城。他把李文星生命里最后两个月接触比较多的亲人、朋友都聚集到了一个群里，希望通过他们的回忆，为李文星的事找到一些线索。\n\n目前在BOSS直聘上，当初李文星求职的岗位已经停止招聘。由于尸检报告还未出来，李文星之死还未能被正式立案。\n\n截至目前，李文星的家人和朋友仍然在等一个结果，同时，他们也希望文星的死能让更多的年轻人远离“招聘骗局”。\n\n本文除李文星兄妹外，其他人物均为化名。"
		},
		{
			"post_id": 2,
			"title": "说说转基因吧，是否有害不是关键",
			"date_published": 1501405624.62,
			"body": "很多人在争论转基因食品有害还是无害，其实完全没必要，也不是关键所在。因为无论什么食品，都不可能证明“无害”，从纯粹逻辑上来说就是“不可能正明一个实体不存在”，不要提奥卡姆剃刀，那个只是当做不存在，没有证明不存在，也不要玩逻辑游戏，说什么“既是黑色又是白色的球不存在”。\n\n* * *\n\n转基因食品目前没有证据证明有害，以后会不会有，没人知道，但目前的安全级别，是完全可以食用的，至少有害级别远小于雾霾。但这并不是关键，关键在于，对于一种无害食品，个体有没有选择不吃或吃的权利，有没有代替他人做选择决定的权利。\n\n吃猪肉是否有害，个体有没有不吃猪肉的权利；吸烟有没有害，个体有没有吸烟的权利，答案不言而喻。比争论有害无害更重要的就是开放知情，自由选择的权利。非转基因食品成本更高，自然价格更贵，市场自然会调节。愿意吃转基因的去吃转基因，愿意吃非转基因的去吃非转，都愿意吃的也可以通吃。\n\n关键在于食品外包应当标明是否转基因，让个体自由选择，目前的情况，转基因食品一般不会主动标注，非转基因一般会主动标注，所以没啥好争论的，按照自己的爱好选择食物就可以了。\n\n来源：http://127.0.0.1:43110/sm.iZero.bit/"
		},
		{
			"post_id": 1,
			"title": "互加链接",
			"date_published": 1433033779.604,
			"body": "需要加链接的请回复。也欢迎把本站加链接。\n站名：水木社区非官方博客\n网址：http://127.0.0.1:43110/sm.iZero.bit/"
		}
	]
}