{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1518520936_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1556293876_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": [
			{
				"comment_id": 1,
				"body": "> [deliriumgoddess6](#comment_2_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): zeroblog может оформлять только автор сайта. А надо, чтобы каждый пользователь мог писать блоги\n\nЕсть ZeroMedium",
				"added": 1556739560
			},
			{
				"comment_id": 2,
				"body": "А чем их завлечь? В смысле, какая выгода авторам из clearnet размещать свой контент в зеронете? Там-то они зарабатывают или хотя бы купаются в трафике. А тут ни того, ни сего.",
				"added": 1556739750
			},
			{
				"comment_id": 3,
				"body": "> [deliriumgoddess6](#comment_4_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): такие сети как зеронет строятся на энтузиазме. И если завлечь людей, готовых делать контент не за деньги, то сюда обязательно подтянутся и те, кто не мыслит жизнь без заработка...\n\nУ меня ощущение, что вы можете развить свою мысль.",
				"added": 1556794011
			},
			{
				"comment_id": 4,
				"body": "> [if0](#comment_2_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Идея в основе - замечательная\n\nИдея, конечно, замечательная. Только она совсем про другое. Даже не будем касаться технической реализации ( в том числе js ), потому что достаточно вспомнить [xkcd: Security](https://xkcd.com/538/) и чуть его переформулировать: 's/Security/Freedom/'.\n\nПростые пользователи 0net это и есть мы, которые знают про API и другие аббревиатуры. Других тут и не будет.",
				"added": 1558372252
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_5_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Сомнительное решение …, когда их хранение зависит от желания, доброй воли и энтузиазма владельцев хабов.\n\nЕсть возможность сделать свой хаб, а затем убедить окружающих в его благонадёжности; либо довериться одному из существующих хабов. Всё упирается в силу инициативы и доверия.",
				"added": 1558902073
			},
			{
				"comment_id": 6,
				"body": "> [if0](#comment_6_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Случаются разные жизненные ситуации, в которых создателю хаба будет совсем не до ZN и его пользователей. [...] Как раз исходя из приведенных соображений следует считать любую федеративность - точкой отказа для децентрализованной сети\n\nГоворя о разных жизненных ситуациях, вы имеете в виду себя или кого-то другого? Просто не понятно, что вам мешает сделать свой хаб.\n\n> [if0](#comment_6_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Ситуация усугубляется тем, что все знают, что в один прекрасный день могут остатся без своих сообщений или не смогут аутентифицироваться [...]\n\nВаши сообщения останутся вместе с вами, они же на харде у вас.\nЕсли закроются существующие хабы, то появятся новые ( может быть вы предложите свой хаб ).\nЯ даже убеждён в том, что возможна миграция на новый хаб с имеющимися ключами от старого.",
				"added": 1559400485
			},
			{
				"comment_id": 7,
				"body": "> [if0](#comment_10_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я имел в виду недостатки данного решения,  весьма похожего на костыль, и сводящего \"на нет\" идею децентрализации. [...]\n\nДа, хабы это компромиссное решение между удобством использования и устойчивостью сети к цензурированию etc.\n\n> [if0](#comment_10_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): представим ситуацию, что каждый активный пользователь сети создаст свой хаб [...]\n\nНет.\n\n> [if0](#comment_10_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Идея с хабами - костыль, работоспособный при низкой сетевой нагрузке. По сути - тупиковый вариант [...]\n\nМожет ну её эту децентрализацию, говорят телега быстро пашет даже в условиях блокировок :-)\nЕсть у вас предложения получше?",
				"added": 1559554366
			},
			{
				"comment_id": 8,
				"body": "> [if0](#comment_11_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Дело не в блокировках [...]\nТо была ирония, если что.\n> [if0](#comment_11_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для преодоления цензуры можно использовать i2p или тот же самый Tor [...]\nЕсли вам i2p больше подходит, то почему мы сейчас общаемся в здесь? А про Tor можете поднять данные на досуге, как бы у него тоже не оказалось хозяина… ещё и покрупнее Паши.\n> [if0](#comment_11_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): никто не мешает выкладывать удобный для скачивания и последующего развертывания архив с контентом [...]\nСерьёзно?\n> [if0](#comment_11_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): сделают по мануале свой \"зайтик\" из трех постов, и вдоволь наигравшись благополучно вернутся в свои уютные телеги [...]\nnuff said",
				"added": 1559597158
			}
		]
	},
	"comment_vote": {
		"1_1LxaUgzJJJcWkh9xCnW2Mmh2LwKiiZoffo": 1
	}
}