{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1584481324,
			"title": "Il ritorno di Don Camillo colorized on IFS!",
			"body": "Please help me to seed this movie!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU_item_5+type:video",
			"added": 1584481323
		},
		{
			"topic_id": 1590169333,
			"title": "Don Camillo colorized with AI. LowRes streaming testing",
			"body": "Could you try to download this movie? By using a very compressed format yoo should stream it without any problem or download it very fast.  PS: i'm streaming behind TOR\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU_item_8+type:video\n\nI used these additional options for ffmpeg to compress the original video:\n\n-f mp4 -b:v 400k -r 25 -aspect 4:3 -vcodec libx264 -b:a 80k -acodec aac",
			"added": 1590169331
		},
		{
			"topic_id": 1591189932,
			"title": "The Great Dictator (Charlie Chaplin) colorized!",
			"body": "http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU_item_11+type:video\n\nThe first release of the most famous film of Charlie Chaplin colorized with AI on ZeroNet! Please seed it!",
			"added": 1591189929
		}
	],
	"topic_vote": {
		"1591530136_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1575374057_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 1,
				"body": "TNT0 (clone of TNTvillage, the biggest italian torrent site now dead. we are updating it with new torrents!)\n\nhttp://127.0.0.1:43110/16xT9VrbbAnWmGEBbA5zZ6HHFZ5nHAgncn/",
				"added": 1581502183
			}
		],
		"1581447935_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 2,
				"body": "> [lianna](#comment_120_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): That doesn't change the fact that, by not using SSL, you are putting users of your proxy in danger. Your \"nothing to hide\" argument falls apart considering even Google, the most popular and \"open\" site in the world, uses SSL to protect its users from ISP snooping.\n\ni turned off the machine and i'm trying to implement SSL.",
				"added": 1581516653
			}
		],
		"1582060549_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 3,
				"body": "Anyone could help me to seed this historical italian movie colorized by using an artificial intelligence? It will be banned if posted on clearnet...but i worked hard to create it!\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU_item_4+type:video",
				"added": 1582062830
			},
			{
				"comment_id": 4,
				"body": "> [rannulfr](#comment_45_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Done.  [...]\n\nis not difficult...but require a long time. I splitted the original file in 5 min parts and elaborate they one by one by using this before link colorized clips together\n\nhttps://colab.research.google.com/github/jantic/DeOldify/blob/master/VideoColorizerColab.ipynb",
				"added": 1582105874
			},
			{
				"comment_id": 5,
				"body": "personally i think that is wrong and dangerous to seed an entire cluster without checking its content. maybe can be useful to create a zerotalk clone where we can publish our material posted on IFS? (by doing this anyone could search it by using zerohello, improving visibility). If you manage IFS another good option to add can be seeding an entire (trusted) channel",
				"added": 1582106081
			}
		],
		"1590169333_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": [
			{
				"comment_id": 6,
				"body": "> [satoxyn1](#comment_121_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): What do you mean by streaming? It looks like a movie for me, not a live broadcast. You should also move MOOV atom to the beginning of the file (so called \"fast start\") [...]\n\nis not real time. is a movie. i want to see if the network can manage it in real time without lag",
				"added": 1590186099
			}
		],
		"1591530136_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 7,
				"body": "We should spam zeronet also on Telegram! For Telegram users a Zeronet backup will be useful in case of banning by the network administrators (telegram is centralized) while Zeronet by using Telegram can be spammed to a great number of people! Anyone should talk on Telegram about Zeronet!",
				"added": 1591539769
			}
		]
	},
	"comment_vote": {}
}