{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1596824289_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1597601766_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": 1,
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": 1,
		"1598587925_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": 1,
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": 1
	},
	"next_comment_id": 38,
	"comment": {
		"1596824289_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 1,
				"body": "I'm always late to the party, sigh.  This is a cool idea, though.  Will look at the other options - thanks for posting @adrenochrome",
				"added": 1596935855
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 2,
				"body": "most of us here are Americans.  We also LOVE that God-Emperor trump.\n\nThe BLM cancer that is spreading through cities under the cover of \"COVID\" and with the protection of Communist sympathizers, namely mayors Wheeler and Durkan, is part of the overall downfall plan.  With the remove of local police, it will result in either 1) the breakdown of many cities, or, 2) the institution of a federal police force.  Either one would be useful to the enemies of Burgerland and the scourge known as Communism / Socialism.",
				"added": 1596954870
			},
			{
				"comment_id": 3,
				"body": "> [otbtechnologies7](#comment_76_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): I would not call him \"God-Emperor\" by any means though lmfao! \n\nI just do that to rustle jimmies. :^)  Trump's not my first choice, but he's not horrible. \n\nAnd all kidding and rumor-mongering aside I think Biden's mental acuity is legitimately declining so a vote for Biden may end up being a vote for his Vice-President.",
				"added": 1596974753
			}
		],
		"1596981403_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 4,
				"body": "It has it's own \"DNS\" - ZeroName.  See http://127.0.0.1:43110/1Name2NXVi1RDPDgf5617UoW7xA6YrhM9F/  ZeroName gets the names from the NameCoin blockchain.",
				"added": 1597042507
			},
			{
				"comment_id": 5,
				"body": "> [sdfsdgasdew](#comment_64_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du): Tell me more detail about it , for example, when I press enter in the browser with the address \"http://127.0.0.1:43110/00.00.bit\" ,the zeronet client will call Namecoin's server to inquire into the database hold by namecoin.The namecoin server will give string  \"15DoUzapXLvwTxmjgSePYKiDWnsev7L4KK\" to Zeronet client?Is it the whole process？00.00.bit    15DoUzapXLvwTxmjgSePYKiDWnsev7L4KK    • Namecoin\n\nNo it doesn't call the namecoin server.  When you get a .bit domain from namecoin, it registers you in the blockchain.  I believe that what ZeroNet does is keep a current copy of the namecoin blockchain and uses that for lookups.\n\nYou can look at the code here (clearnet link) https://github.com/HelloZeroNet/ZeroNet/tree/fa7013fdf7eeb7bb01c1c113b4529b7233bf52ce/plugins/Zeroname",
				"added": 1597132792
			},
			{
				"comment_id": 17,
				"body": "There is no \"official server\".  This is a distributed network.  Most of the questions you're asking I don't think are documented; maybe someone else will chime in if they are.  The best way to proceed I think is to look at the code on github  ZeroNet behaves really differently from the internet, so you need to start thinking along those lines.  The best way to do so, I think, is to look at the source and see what it does.",
				"added": 1597431499
			}
		],
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 6,
				"body": "> [gomzik](#comment_7_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): At least I tried to run on my android phone at the same network (wifi), but on android it does not run at all. ZeroHello page does not loaded\n\nThere's an android app for ZeroNet in the playstore.  Is that what you're using?",
				"added": 1597165824
			},
			{
				"comment_id": 7,
				"body": "I can't think of a way to share them.  But maybe the problem is they can't get to the trackers?  It might be a  DNS block in which case if you give them the IP of the trackers they should be able to connect and get peers.\n\nSee if using a copy of your ZeroNet\\data\\trackers.json file works.",
				"added": 1597166344
			},
			{
				"comment_id": 8,
				"body": "> [gomzik](#comment_10_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): trackers.json does not changed from fresh install on my pc. I will try, but not sure, that it helps. Thanks.\n\nOh I thought of something else.  On the PC zeronet will use TOR to connect to some peers (you can also force it to use TOR for everything).  I don't know what is done on Android.  It may be the PC is working because it's using TOR to connect to peers.\n\n[otbtechnologies7]  Good work, friend.  Nice of you to help people.  Do you have thoughts on what I said above about TOR on PC vs Android?",
				"added": 1597180893
			},
			{
				"comment_id": 9,
				"body": "Here are what the default TOR settings look like on PC (sorry for clearnet link):  https://imgur.com/a/zcu4Jv7\n\nIf you can't see that I think I can post the pic to my ZeroMe stuff.  Let me know.\n\nIt may be that TOR has to be enabled, and maybe tunneling, for it to work.  Since I haven't used the android app, not sure if it can go through TOR itself.",
				"added": 1597181306
			},
			{
				"comment_id": 10,
				"body": "Here I put it on ZeroNet so you should be able to see it no matter what.  http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ/1597181358",
				"added": 1597181402
			},
			{
				"comment_id": 12,
				"body": "> [otbtechnologies7](#comment_89_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): \nThank you for the insight!",
				"added": 1597188278
			}
		],
		"1597175618_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 11,
				"body": "> [otbtechnologies7](#comment_88_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): Well, in any case, there would have to be a server of sorts which would be you. I am not sure I understand the concept. Please elaborate.  [...]\n\nI think he is looking for something to handle stream distribution.  Normally one streams from their PC to like facebook or twitch, and that delivers all the content to multiple peers.  Sounds like he is looking for a distributed replacement for twitch.\n\nI was thinking about this myself a week or so ago and also found no solution, so I'm also interested.\n\nThe most I could come up with was have a seedbox that takes a stream, buffers it to a file, and serves out pieces from the buffered file.  But that seems like it would need protocol changes to support.\n\n I don't know of any clients that support this - they support the client streaming from the torrent, but AFAIK nothing supports the stream feeding the torrent.\n\nIf anyone knows, please share!",
				"added": 1597181723
			},
			{
				"comment_id": 13,
				"body": "> [c2vjcmv0](#comment_22_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): A p2p broadcast sounds like an oxymoron. To achieve that you would need multiple p2ps which will increase the bandwidth. That's kinda the reason to why services use broadcasting instead of p2p. Or have I misunderstood the question?\n\nI can't speak for OP, but you understand my thinking.  The reason for it is the same for any distributed stuff - so that the stream can't be taken down by the streaming host.  But I'm thinking more along the lines of a livestream torrent; maybe OP actually means P2P in which case he probably wants something like Tox.",
				"added": 1597254874
			},
			{
				"comment_id": 14,
				"body": "> [c2vjcmv0](#comment_23_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): Then, isn't Tox a valid alternative?\n\nIt definitely is if one wants P2P.  I haven't looked at how Tox implements a/v streams for a while, but I think the source of the stream broadcasts directly to all the peers in the Tox room.\n\nWhat I'm tangentially interested in is being able to stream to a swarm so that the swarm helps distribute it.  I'm not sure if Tox does that.  I don't have a use case in particular but find it an interesting problem.\n\nI don't want to distract from OP.   Tox may very well be the best solution for them, and they may just want to post a Tox key on ZeroNet and use Tox for the actual communications.\n\nOP: If you want to look at tox here is the clearnet site:  https://tox.chat/",
				"added": 1597269298
			},
			{
				"comment_id": 15,
				"body": "This looks interesting as well if one wants to broadcast from a file:\n\nhttps://github.com/mafintosh/peerflix",
				"added": 1597270043
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 16,
				"body": "> [edgelordofdecent](#comment_629_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Looks like a dead project. I want to see a mesh network project that manages to survive. None of the sheep are interested though.\n\nI think what will help is projects will be dead or very slow until shit hits the fan then the sheep will be crying out for something.  Since we realize this, we should prepare by making/finding/using things that are ready to roll out at a moments notice to the general public.",
				"added": 1597389082
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 18,
				"body": "If you don't know how to ban evade, you probably shouldn't be posting on 4chan.  Ban evasion and opsec aren't much different.  Learn opsec/ban evasion first, then work your way up to shitposting on imageboards.  t /pol/",
				"added": 1597802475
			},
			{
				"comment_id": 24,
				"body": "> [otbtechnologies](#comment_63_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): I get shadow banned on 4Chan now\n\nHow is that even possible unless you namefag or tripfag?",
				"added": 1597973434
			},
			{
				"comment_id": 28,
				"body": "> [otbtechnologies](#comment_64_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): None-the-less, that is in fact censorship and shouldn't be tolerated... #My2Cents\n\nAgree.",
				"added": 1597981923
			}
		],
		"1597601766_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X": [
			{
				"comment_id": 19,
				"body": "> [legacyofbalancer](#comment_2_16sixqep8qDvuNETTiPWPQP8fDpUbjZY7X): Are you fucking serious?\n\nI agree with your take. I don't know what anyone is doing on here, and probably I don't want to.  Proof you have the keys is that they work.  Maybe he gave you the keys, maybe you killed him for the keys, maybe you are him under a new alias.  I don't know, nor do I really need to.\n\nI'll check out the zites soon. Sound interesting.",
				"added": 1597802778
			},
			{
				"comment_id": 20,
				"body": "I didn't realize they were all in Russian.  I barely speak burger let alone borscht, so I can't make much use of them.  Nice zites, though.  Good luck!",
				"added": 1597802859
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 21,
				"body": "Not sure, but I hope not.  I had used ZeroNet a while ago, but stepped away and only recently started using it again.  We could always fork the project if necessary\n\nI think a lot of the problem is lack of content causes people to not stay long, and without much use there's no point in doing a lot of development.  Hopefully the main developer is just busy and will come back to things.",
				"added": 1597809586
			},
			{
				"comment_id": 22,
				"body": "> [geekless](#comment_210_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): The bad news is that not all sources are available. AFAIK there's no source code of the Windows-specific launcher.\n\nThe tray program is there. https://github.com/HelloZeroNet/ZeroNet/tree/8b994e42c23a49225833357240c73d51896da6b2/plugins/Trayicon\n\nIf you're talking about the ZeroNet.exe, I think that's just built using a pyinstaller package",
				"added": 1597813344
			},
			{
				"comment_id": 23,
				"body": "> [kapec](#comment_23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Just a crazy idea of mine but.Have you tried donating?\n\nI'm willing to do so if it's still being developed.  Looking at some of the \"nastier\" bug comments it seems people donated to one of the features and are irritated they're not done yet.  I don't have a pet feature, but am willing to contribute to the overall project.  Do you know if the main developer has any posts anywhere on project status or such?",
				"added": 1597813441
			},
			{
				"comment_id": 29,
				"body": "> [kanade](#comment_108_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): ah yes, the solution to all the problems in the world, throw more money at it until it works\n\nThe thing is, though, it works most of the time.  As long as the money is thrown in the right place.",
				"added": 1598079521
			}
		],
		"1597818504_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 25,
				"body": "To slow down spammer account creation one possibility is to use proof of work much like bitcoin uses it.  To create a new ID, some problem that takes a long time could need to be solved.  Of course, the determined could set up \"id creation farms\" that do nothing but generated proof-of-work to obtain a lot of Ids, but it's a step in that direction and doesn't require a central authority to approve the person - just has to validate that the work was done.",
				"added": 1597973924
			},
			{
				"comment_id": 26,
				"body": "> [geekless](#comment_213_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Without the server side of ZeroID you can't even register an ID and post to this forum.\n\nZeroID could use blockchain combined with my suggestion below for a proof-of-work to slow down spammers.  If the proof of work passes, one is added to the blockchain.  Unfortunately, that would mean storing a copy of the user id block chain everywhere, but I don't really see a solution - blockchain or not - where a user can be validated without going to a server unless the list of users is replicated everywhere.",
				"added": 1597974136
			},
			{
				"comment_id": 27,
				"body": "> [xcape2net](#comment_779_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Or, a better system than downloading every email to every peer's hard drive needs to be implemented. What do you think?\n\nWe could use a routing system like uucp mail where a mail is routed to the user and only copied to machines along the route.  We would need DHT/PEX, though, so a path could be discovered from point A to point B through peers.  Each peer would try to forward to one peer closer until the node was reached, holding onto the mail until it gave it to another peer or a timer expired, etc.",
				"added": 1597974792
			}
		],
		"1598036610_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 30,
				"body": "> [merithtk](#comment_90_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): nope. she needs live messages, and refuses to change from facebook because she has friends there,\n\nThen goodbye to her.  And nothing of value was lost.",
				"added": 1598079587
			}
		],
		"1598587925_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": [
			{
				"comment_id": 31,
				"body": "> [blkdissident](#comment_7_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): Or those demanding action against climate change.\n\nI'm guessing they're still pissed about people not stopping the Ice Age, too.",
				"added": 1598674394
			},
			{
				"comment_id": 32,
				"body": "Good work.  Throw these fuckers in prison.  Or better yet, off the side of a cliff.",
				"added": 1598674474
			}
		],
		"1598474233_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 33,
				"body": ">defeat surveilance\n>Let Amazon track my website visits and associate a purchase with my visit to the website\n\nU wot m8?  I have nothing against being an Amazon affiliate, but it's not conducive to defeating surveillance.",
				"added": 1598675198
			}
		],
		"1598893256_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": [
			{
				"comment_id": 34,
				"body": "Completely one-sided streams showing only what the far-left wants you to see.  That said, it is better than mainstream news.",
				"added": 1598933598
			},
			{
				"comment_id": 35,
				"body": "> [0mega](#comment_8_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): there you are ya tiny trumptard shit fly. What are you going to do when your POS trump eats a bullet?\n\nAnother retard coming out of the cloud of CS gas.  I so wish they were using Zyklon B on you scumbags.",
				"added": 1598937938
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 36,
				"body": "> [kec](#comment_24_1PzqXnnYNvUNj4EjU1X6VCRAGFo7Rk9AWN): Admit it - zeronet is preferred because it has a web gui.\n\nAgree, but I see no problem in that regard.  Usability is important for adoption.",
				"added": 1599365647
			},
			{
				"comment_id": 37,
				"body": "There are different goals with all of those systems, which is part of the problem.  Right now, ZeroNet seems great for distributed sites.   Where ZeroNet is weak is anonymity, large data sets, real-time communictions (e.g., streaming).\n\nThat doesn't stop us from combining things, though.   ZeroNet can be the webface, IPFS can be storage, qBitTorrent for streaming, etc.  Why not put them all in one ecosystem?\n\nThere's also Ethereum which might be useful for block-chain things.",
				"added": 1599365946
			}
		]
	},
	"comment_vote": {
		"771_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"75_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"2_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"77_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"87_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"88_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"89_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"90_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"22_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"23_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"629_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"23_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"209_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"210_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"777_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"212_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"17_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"108_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"17_1HjJqWY2ECyyUE1F2sJSuXMRmU39uMNt6s": 1,
		"1138_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1137_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"13_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"5_1Mk11Va4hvFzWgfAhvyRJR4m6buvWENcBZ": 1
	}
}