{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1543239891_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 1,
				"body": "This has been really helpful. thank you.",
				"added": 1544241013
			},
			{
				"comment_id": 2,
				"body": "\nI like the layout first of all. It's easy to go back and find what you're looking for. Things move around and get buried in forums and blogs. \nI like that it's clear and easy to fallow, a lot of these zites with zeronet docs are overly complicated. \nI'm just a hobbyist and I tinker with java script a little so coming from CN to here I'm still confused about how to setup a zite from scratch. A live developers chat would be awesome...makes it easier to ask what feels like ridiculous questions.\nFor example...\nhttps://daniellmesquita.gitbook.io/the-truth-about-zeronet/4.-creating-static-zite#absolute-paths-dont-work\nI guess while typing the documentation they skipped over the example explaining how paths actually work.",
				"added": 1544292641
			},
			{
				"comment_id": 3,
				"body": "An interesting tool for teaching.\nhttps://scrimba.com/c/cKp6LhL",
				"added": 1544421254
			},
			{
				"comment_id": 4,
				"body": "> [trenta3](#comment_4_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): The idea is really good, but it would be great if it was opensource so that we could host something similar on ZeroNet...\n\nfor sure.\n\nany idea where i can find info on how zerome handles images? I'd like to use something like that for images and files. I like the place holder and how it shows how many seeds the files has. I read something about optional files...",
				"added": 1544488882
			},
			{
				"comment_id": 5,
				"body": "> [trenta3](#comment_5_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): Not really except in ZeroMe source code on GitHub. [...]\n\nThank you! That really helped out. Your links to anchors doesn't seem to work. I've tried in chrome and tor browser. Just a heads up. thanks again.",
				"added": 1544545277
			},
			{
				"comment_id": 6,
				"body": "Started a group chat room\nhttp://127.0.0.1:43110/thunderwave.bit/?GC:ZNforDevs",
				"added": 1544551312
			},
			{
				"comment_id": 7,
				"body": "@trenta3 I'm not comfortable enough with my knowledge of zeronet to do a tutorial yet but I have been adding to the wiki here and there.",
				"added": 1544627809
			}
		]
	},
	"comment_vote": {
		"1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"3_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"4_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"5_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"6_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"7_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1
	}
}