{
	"next_comment_id": 11,
	"comment": [
		{
			"comment_id": 1,
			"body": "Hi, \"dead inside\" has some causes and reasons, i would certainly want to know them. I do not think the life is a dead end.",
			"post_id": 2,
			"date_added": 1525861653
		},
		{
			"comment_id": 3,
			"body": "> I did go to college at 22...For one day. I then dropped out because I realized I was too stupid\n\nFrom your posts, you do not seem to be stupid. I think one day is way too short time to adapt. But in my country, even much older people than 30 years old decide to study again so they have more options for employement.\n\n> women destroyed my self-worth\n\ni think this can be somethig to write new blog post about",
			"post_id": 3,
			"date_added": 1525988391
		},
		{
			"comment_id": 4,
			"body": "I think most important things that formed young people is what happened in the childhood. Mainly parents, trauma things.. These are things one have to understand and somehow adopt in order to better deal with own future. But life is not ideal, so this is by far not unique opinion - \"I am.... Alone. ...Unloved. ...A waste of oxygen.\", i could say similar things and heard this numerous times on discussions. Though we have to find something good, some value if we do not want to continue feeling that way. I heard that the way to be loved is to give some love/attention/empathy, not to wait one probably do not usually see any ways to do it if is alone, thoug there can be found some small things one can do and be happy about that even if the major time he feel bad/alone, etc.",
			"post_id": 3,
			"date_added": 1526060042
		},
		{
			"comment_id": 5,
			"body": "You should go to see the people, you may attend some christian kind of meeting, from my experience it makes sense. But one have to seek to find group that fits. Death means your body and consciousness does not exist. I think still it is better to exist than stop existing. Death is not resting, death is no life, killed life, nothing. You may try to find some job, maybe even out of the city.\n\nhttps://www.biblestudytools.com/topical-verses/loneliness-bible-verses/",
			"post_id": 7,
			"date_added": 1526540642
		},
		{
			"comment_id": 6,
			"body": "> I'll never be able to see the country\n\nWhat country you want to see?\n\n> I'll never be able to find\n\nNever say never",
			"post_id": 8,
			"date_added": 1526633225
		},
		{
			"comment_id": 7,
			"body": "> lack of intelligence screws me harder\n\nI am not socialized i think and same thing bother me, maybe people who are not active with other people have this opinion in common. Maybe it is a temporary issue because of lack of experience/interraction (which can be gained).",
			"post_id": 4,
			"date_added": 1526633444
		},
		{
			"comment_id": 8,
			"body": "It is positive thing that you hate many things, it means you are not resigned in depression. Some things that you hate can not be changed, but for others you may change your thinking and find some positive things or change yourself at least a bit.",
			"post_id": 6,
			"date_added": 1526633616
		},
		{
			"comment_id": 9,
			"body": "If you want your situation not improve, then read this post every day or repeat that sentences in your mind.",
			"post_id": 5,
			"date_added": 1526633689
		},
		{
			"comment_id": 10,
			"body": "Yesterday i have seen the site [Suicide Prevention Hotlines](/15GbDJPVbjW3rs9b2oNUjYVPAVuW1KcPMe/)",
			"post_id": 8,
			"date_added": 1578212965
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}