{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1,
			"title": "Este vous capable de de gardez votre système (et zeronet)",
			"body": "hello c'est sick este vous capable de gardez votre système comme windows ou linux très longtemp voir le long de votre vie ?\nparce que moi je change de système d'exploitation de win à linux et par conséquent sur zeronet je change de nom avec ZeroID\ndonc vous restez au même système _ou pas_ ?",
			"added": 1469574679
		},
		{
			"topic_id": 3,
			"title": "PageRank pour ZeroNet",
			"body": "pourquoi pas du pagerank sur zeronet pour savoir le score d'une page zeronet est ce que mon site est populaire ?\nhttps://github.com/louridas/pagerank\nPS :: Ont sais que PageRank N'est plus maintenu par Google :'(",
			"added": 1469592749
		},
		{
			"topic_id": 5,
			"title": "y a t'il des boutique/magasin sur ZeroNet",
			"body": "ou sont les site marchand sur zeronet **Mais pas de marché noir** des marché legal qui vent des chose interessant et de tout, parce que zeronet est basé sur le bitcoin comme dit paf legeek : \"vous pouvez acheté des choise en utilisent le bitcoin\".",
			"added": 1469763904
		},
		{
			"topic_id": 8,
			"title": "Utilisé HTTrack pour capturé les site web et mèttre dans un site ZeroNet",
			"body": "l'idée est pas bête essayer d'aspirez vos sites préférer et de les mèttre sur ZeroNet\n\nJ'ai Deux bonne Raison pourquoi faire ca ::::\n* afin d'etre enfermer plus facilement sur ZeroNet avec des site capturé\n* le site disparait le site capturé sur ZeroNet reste !",
			"added": 1469850429
		},
		{
			"topic_id": 11,
			"title": "qui utilise ImageMagick ?",
			"body": "ce topic est adressé aux utilisateur d'ImageMagick car moi j'utilise ImageMagick que'ce que vous en pensez comment vous utilisé et vous utilisé avec les fonts google ?\nmerci d'avance !",
			"added": 1470246613
		},
		{
			"topic_id": 12,
			"title": "un google fonts sur ZeroNet",
			"body": "moi qui est fan de typographie, pourquoi pas des police d'ecriture pour zeronet comme google fonts.",
			"added": 1470452768
		},
		{
			"topic_id": 13,
			"title": "Torrentz est mort :'(",
			"body": "c’etait un moteur de recherche de torrent la méthode de fermeture ont ne peut plus chercher mais la cause est inconnu alors ma question vous utilisé ce site car moi je utilisait et tien en commentaire donner lui une fleurs sur son cercueil en tapent \"fleur\" OK,\nRIP TorrentZ.",
			"added": 1470620146
		},
		{
			"topic_id": 14,
			"title": "ZeroNet débarque un Réseau Social !",
			"body": "les développeurs de ZeroNet Sort ZeroMe Un Réseau Social qui va remplacé littéralement Facebook et Twitter !\nj'ai découvert un bug c'est dé qu'on supprime un élément il supprime le prècèdant donc faite attention !\nsortez de facebook et twitter  et rejoignez nous dans ZeroMe !!!! ::::::: http://127.0.0.1:43110/1MeFqFfFFGQfa1J3gJyYYUvb5Lksczq7nH/",
			"added": 1470888360
		},
		{
			"topic_id": 16,
			"title": "a l'aide :: ZeroMe Ne Fonctionne plus ...",
			"body": "en faite c'est que j'ai selectionné  Le Red et le Blue hub je suis débutant mais c'est un faut pas et mes follow déconne j'ai selectionné mes utilisateur alors en fait je les suit pas\nMerci de me trouver une solution.",
			"added": 1471147583
		}
	],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 1,
				"body": "J'arrive pas à l'obtenir :(",
				"added": 1469591124
			}
		],
		"1_1J4j9zrg5qitbELP3tpkRiReyDaWQLkG2P": [
			{
				"comment_id": 2,
				"body": "une vidéo sur youtube ?",
				"added": 1469591303
			}
		],
		"3_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 3,
				"body": "OK border0464fred, mais j'en ai peut meme le moin pourquoi parce que ma passion est les instrument de musique des andes et cette passion est faible voir au monde, sur mon site j'ai ma photo en déguisement indien et je tien un toyo de ma facon, esseye de t'acheter un toyo tu va galéré (alors sur internet, mais fait gaf), voila pourquoi j'ai le moin.",
				"added": 1469647743
			}
		],
		"5_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 4,
				"body": "je vien de voir ca sur korben",
				"added": 1469817431
			},
			{
				"comment_id": 15,
				"body": "> [sbeee](#comment_5_13k6itGVhzLTZUZKiqWWJ5KdvVUEMqDWDv): le réseau social zeroMe peut faire office de marché à terme\n\ncomment ?",
				"added": 1471013117
			}
		],
		"8_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 5,
				"body": "bonne idée, mais ont ne sais pas si il vont disparaître.\ncommence à faire ca moi je vais essayer ;-)",
				"added": 1470072057
			},
			{
				"comment_id": 6,
				"body": "je l'ai fait sur mes site préferer ::: http://127.0.0.1:43110/1Hb1Qj6Fhe7u89KwucuZZRertYAMcT9Xhb/",
				"added": 1470081953
			}
		],
		"2_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC": [
			{
				"comment_id": 7,
				"body": "que vous en pensez de mon site ?",
				"added": 1470248027
			}
		],
		"1_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 8,
				"body": "moi aussi kindlyfire je remplace tout les ordinateur win 8,10 par linux xubuntu car windows c'est une honte ils nous espionne et microsoft ne devrait jamais innondé le marché et même lutté contre le logiciel libre.",
				"added": 1470279143
			}
		],
		"2_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 9,
				"body": "pour le site numéro 1 de drogue, celui qu'il l'a maintenu a fait une erreur mais pour la deuxième version la ont ne sais pas, le troisième est présent, je sais comment faire un point onion sur le réseau tor j'en ai fait beaucoup ! anciennement mon site etait sur tor et maintenant sur ZeroNet.",
				"added": 1470449713
			},
			{
				"comment_id": 10,
				"body": "à zut !",
				"added": 1470591296
			}
		],
		"1_1M4Ab8CUu3byziHVvNXLHmPezC4Lg9hvNJ": [
			{
				"comment_id": 11,
				"body": "comme j'ai alerté dans un topic, il y'a pas grand chose sur notre sujet zeronet et en plus ils arrête d'en faire mais seul paf legeek en un fait un et donc en français vue qu'il est en matière de vie privé et c'est le plus long en plus, alors de l'autre coté de la vidéo qu'en je vois \"how to install zeronet and open play\" heuu \"open play\" franchement ont aurait pu faire mieux, et pire qu'en je voit \"How to download latest movies using 'zeronet.io'\" la \"using zeronet.io\" vous croyez quoi, utilisé le site de zeronet ??, alors essayer de en faire un sur youtube et toute monde et moi est heureux.",
				"added": 1470617736
			}
		],
		"13_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 12,
				"body": "> [alexdd](#comment_1_1JDqkJrKnMkfQm3t4sygbSq2yc6arFfxCw): stop using google translate ...\n\nc'est tous ce que tu donne ? :/",
				"added": 1470649527
			},
			{
				"comment_id": 13,
				"body": "t'a juste pas besoin d'ecrire en anglais et pourquoi donc \"arrêtez d'utilisé google translate\" ?",
				"added": 1470685894
			},
			{
				"comment_id": 14,
				"body": "gerardmensoif :: j'espère, mais en francais\nalexdd :: désoler mais l'ordinateur m'a corrigé \"c'est ait\" que \"c'estait\" désolé :/",
				"added": 1470692213
			}
		],
		"1_1JDqkJrKnMkfQm3t4sygbSq2yc6arFfxCw": [
			{
				"comment_id": 16,
				"body": "et après c'est torrentz :'(\npas un vpn mais tor",
				"added": 1471018048
			}
		]
	},
	"comment_vote": {}
}