{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 1,
				"body": "> [bigchungus](#comment_2_15JM5ADNgUtiyKtrkeojneyGY9DyYuFwz2): i see you and people like you as part of the solution - let the herd cull itself.  [...]\n\nagreed. let these morons and their offspring have all the vaccines. let them sprinkle it on their breakfast cereal. i totally approve.",
				"added": 1620931494
			},
			{
				"comment_id": 2,
				"body": "> [calmdownholden](#comment_47_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): But... muh dead bodies... I'm an idiot...blah...\n\nHere's what you and others like you should do with respect to vaccines - go and get them all. It shouldn't concern you that half of Fauci's team, and of the FDA and of the CDC, have not wanted to be vaccinated either, just go and get ALL the vaccines - pfizer, astra-zeneca, johnson & johnson, moderna - collect ALL the badges and then get your kids to do the same.\n\nYou know, your own children who have been proven over and over to not be covid-spreaders, who are statistically at near-ZERO risk of death from covid-19 and run a greater risk of death from the \"non-vaccine\" itself. Sign up the whole family and keep up with the schedule of shots every 3 months!! \n\nMeanwhile, I've already had covid-19 and I barely noticed it - 2 days of feeling under the weather and now I have perfect immunity. There is literally NOTHING we humans can make that beats nature's own immunization in the form of antibodies.\n\nLet's call this what it is folks, VOLUNTARY EUGENICS, and frankly I'm in favour of you and your family taking as many vaccines as possible.",
				"added": 1621354923
			}
		],
		"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX": [
			{
				"comment_id": 3,
				"body": "> [reflektion](#comment_16_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): read 1984, that's where the world is heading.\n\nthat's only half the story. the other half is \"Brave New World\" by Aldous Huxley. we are now a mix of both of these dystopias.",
				"added": 1621355171
			},
			{
				"comment_id": 14,
				"body": "OP: let's talk about how everything's going to shit ...\nAlso OP:  ... without mentioning any of the people responsible\n\nCompletely retarded.",
				"added": 1622071738
			}
		],
		"1620117334_1AEUvcwh6yyUse45jWaK5NqrVwkWrgm7bZ": [
			{
				"comment_id": 4,
				"body": "> [calmdownholden](#comment_46_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): There's a difference between Civil Disobedience, and active disruption and spreading harmful misinformation.Take your meds.\n\nHeads up everyone - look through this guy's post history and tell me he isn't some kind of professional state-paid troll. And if you don't think this place is crawling with them, think again.",
				"added": 1621355337
			},
			{
				"comment_id": 8,
				"body": "> [anonymouslogin](#comment_294_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Sure sure, NEVER give out personal information. Let's not get all carried away with the glowies paranoia eh?\n\nWho knows what getting \"carried away\" even means today when it comes to digital opsec/netsec? You certainly don't, not unless you make a living in computer security or work for a 3-letter agency. I remember privacy forums before 2013 when people just like you swore up and down that dragnet surveillance was a glowie paranoid fantasy - and then Snowden happened and much crow was eaten.\n\nSo why not throw caution to the wind and not \"get carried away\" in the other direction and spill everything on trust? Let it all hang out there? Because we all understand that you'd be a fucking moron who deserved everything they got if you did. Go on, do it.",
				"added": 1621437125
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 5,
				"body": "Testes sausages",
				"added": 1621355746
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 6,
				"body": "Telegram just seems like a massive honeypot. Signal is good but is also let down by it's insistence on phone number ID, essentially requiring you to dox yourself or else never use the number you used to register.\n\nHere are some other less well known social networks:\n* Fediverse decentralized networks - \n   * Diaspora\n   * Mastodon - the best of these\n   * Friendica\n* Movim   \n* Matrix - popularised by Element\n* Disroot\n* Tildeverse -  for nix nerds",
				"added": 1621359047
			}
		],
		"1621391570_1LbDaiYEJHxW7m75gdV1s8NSwPjSrBMEZ2": [
			{
				"comment_id": 7,
				"body": "a few things.\n\nyes, i agree that 0net should be a defacto tor-always experience. that's how i have mine configured and wouldn't use it any other way.\n\nbackdoors: there's no good reason to think that debian has been backdoored. you might think one or more of it's derived distros like Ubuntu might be, and probably has been, but you also have great mitigation strategies that make someone using debian way more secure than the average bunny - clamAV, firejail, kicksecure, whonix - these are all good efforts and far from the only ones available.\n\nand let's not forget that of all the things in your nix stack that are likely to be compromised, it's tor. either tor itself, or your exit node.",
				"added": 1621415958
			}
		],
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "agreed. he's either a paid troll or else an utter moron.",
				"added": 1621678475
			}
		],
		"1621542671_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 10,
				"body": "i don't have time to waste looking at his unhinged retarded troll rants. Just mute.",
				"added": 1621678610
			}
		],
		"1621394876_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 11,
				"body": "i'm usually at 20/24 trackers on linux/tor-only",
				"added": 1621678740
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 12,
				"body": "nothing can reach people like this. nothing can shake their unwavering belief in the honesty and goodness of governments. so don't try, just let him and everyone he loves take all the vaccines and all the booster shots. he and others like him are the finest examples of trash taking itself out.",
				"added": 1621678983
			}
		],
		"1621607826_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 13,
				"body": "that Andrew Lee guy sounds like a major douche. people should know by now that fucking with OSS communities never works, we just reappear elsewhere.\n\nrelevant irc xkcd: https://xkcd.com/1782/",
				"added": 1621679579
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 15,
				"body": "thank you for doing this, color me very impressed.",
				"added": 1622073334
			}
		]
	},
	"comment_vote": {
		"2_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"4_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"3_1NhSzUMdaQqZKaniiSxysB7EoNZsDUB1jX": 1,
		"1_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"7_19g2CS28ASKFNJYSsP1jRbsY4uNMyiPMg1": 1,
		"117_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"9_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"2_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf": 1,
		"16_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU": 1,
		"3096_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"15_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU": 1,
		"5_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"1_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf": 1,
		"7_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"5_1N5YTyNeraRGksf76WNQiJ3ZB2ZMMa4pnf": 1,
		"2_1K1Y6kTYm7QXpmvbZiCAdzB5w7jCwBkird": 1,
		"4_1NRE1HXTrFT9uH9N84FbiQ59FAffw554UP": 1,
		"4_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"1_1H7zNGEgo9AgbdKHhwoWzfeNqrav5RJZk": 1,
		"16_1JH6eLGfF5vqSWN1fvve8ALbgdPTvxzB9C": 1,
		"118_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1
	}
}