{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1568199205,
			"title": "Anti Spam/Troll delay mechanism feature wish",
			"body": "What ZeroTalk lacks is a strong anti spam/troll mechanism, everyone should have to wait a relatively long time when they register an id and also before they can send their messages. 15 - 30 minutes would be enough. There should also be an upper limit of messages per id and a delay between them. That would certainly reduce the number of trolls since they get bored easily.",
			"added": 1568199204
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1568199205_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g": [
			{
				"comment_id": 1,
				"body": "> [undisclosed](#comment_64_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): But trolls bring a certain vivacity to a thread.  They signal by their very presence, worthiness of the topic at hand.  Honestly, how long ago was it that you couldn't recognize who's trolling?\n\nNothing wrong with positive trolls but there are also many whose only intent is to trash ZeroTalk with hate speech, insults and other nasty garbage.",
				"added": 1568204837
			},
			{
				"comment_id": 2,
				"body": "> [bigbadbob](#comment_653_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): op is trolling me with the user name\n\n\"Kill yourself, moron.\" :D",
				"added": 1568217207
			},
			{
				"comment_id": 3,
				"body": "> [bigbadbob](#comment_657_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): but where is the \"real\" duende?  your like an imposter\n\n@duende where are you?",
				"added": 1568217370
			},
			{
				"comment_id": 4,
				"body": "> [bigbadbob](#comment_659_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): where is the real duende? you are an imposter\n\nhe is on suicide watch",
				"added": 1568217429
			},
			{
				"comment_id": 5,
				"body": "if calling Hitler a great man or the new zealand shooter a holy person is free speech to you then FUCK FREE SPEACH",
				"added": 1568222075
			},
			{
				"comment_id": 6,
				"body": "> [bigbadbob](#comment_665_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): a little off topic but your idea sux op.\n\nno, it would be a great garbage disposing mechanism",
				"added": 1568222793
			},
			{
				"comment_id": 7,
				"body": "> [436sdwd](#comment_9_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): If you hate Hitler, then you're an ally to capitalism. Capitalism and Marxism are two sides of the same coin, in practice. Hitler was one of the few world leaders that actually managed to rout the beast out, a true lover of his people and friend of the working class. [...]\n\nblah blah blah blah blah",
				"added": 1568223101
			},
			{
				"comment_id": 8,
				"body": "> [aspidochelone](#comment_177_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I don't know what it is about Brenton Tarrant, but he certainly is the one who changed the world.  \n\nThe only thing he has changed is ruining his own life cause now he has to spent the rest of it in a concrete shit box.",
				"added": 1568233048
			},
			{
				"comment_id": 9,
				"body": "> [436sdwd](#comment_11_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm): Then why do you know his name?\n\nThat isn't an appreciable change. The only thing that he has accomplished is ruining his own and his familys life by killing a few innocent people.",
				"added": 1568237069
			}
		]
	},
	"comment_vote": {
		"114_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"113_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1
	}
}