{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1594760103,
			"title": "mój drugi blog",
			"body": "http://127.0.0.1:43110/1FoesXVDqM3URaKZeMvhUh4wSXdgboJx4n/",
			"added": 1594760102
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1594760103_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 1,
				"body": "> [sasza](#comment_16_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB): brak polaczenia, musisz miec wlaczonego kompa caly czas. To podstawa dzialania tej struktury. Samo zalozenie nic nie da.\n\nNie jestem w Europie. wyłączyłem komputer, kiedy poszedłem spać. teraz powinno być więcej siewników i ludzi.\n\n> [kapec](#comment_19_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): Fajno, o czym zamierzasz blogować? Będę rozsiewać o ile uda mi się pobrać.\n\nten blog będzie dotyczył Europy i potencjalnych scenariuszy tego, jak Europa okaże się w przyszłości. lubię myśleć o takich hipotetycznych rzeczach.\n\nnie jestem eurpean, użyłem tłumacza google\n\ngoogle translate",
				"added": 1594828498
			},
			{
				"comment_id": 2,
				"body": "> [fornakter](#comment_13_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Jak postawić taki blog?\n\nmożesz sklonować zeroblog, a następnie tworzyć posty na blogu",
				"added": 1594924970
			},
			{
				"comment_id": 3,
				"body": "> [tajny2z](#comment_34_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): Juz seeduje. W jakiej czesci swiata mieszkasz teraz? Pozdrawiam i zycze powodzenia!\n\nMieszkam w Ameryce Południowej. Dziękuję za miłe słowa.",
				"added": 1595693268
			},
			{
				"comment_id": 4,
				"body": "> [plonacy1perun](#comment_3_15UPxFMtZojHw5JYJs9JQQ11kNa8Xn7YB4): Skąd zainteresowanie naszą grupą? Tam chyba niezły zamęt i do tego jeszcze stan pandemii?\n\nZainteresowanie Europą pochodzi z całej migracji, która ma miejsce. zawsze interesowałem się geografią. nie mogę pomóc, ale widzę, że niektóre kraje europejskie odniosą negatywny skutek. cywilizacja i społeczeństwa nie powstają z dnia na dzień, a teraz niektóre kraje europejskie będą miały gorszych ludzi, tracąc jednocześnie swoich lepszych. utrata jakości. Nie jestem Europejczykiem, ale myślę, że ta migracja w Europie będzie jedną z najciekawszych rzeczy w tym stuleciu na tej planecie. nigdy nie widzieliśmy czegoś takiego na tak wielką skalę. i dlaczego twoja grupa? jesteście polską, więc jesteście w europie, dlatego tutaj zamieściłam.",
				"added": 1595866793
			}
		]
	},
	"comment_vote": {}
}