{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1594275549,
			"title": "New Approach to Hong Kong Peace Revolution",
			"body": "New Approach to Hong Kong Peace Revolution\n光复香港、时代革命的新方式 \n在黄俄专政制造出来的邪恶新冠病毒蔓延全球之际，文明变革势在必行！\nThe crazy Hong Kong security law is much more brutal than the mainland, Chinese version, as it not only defines physical actions, also includes “activities\" (“活动”), which may include many daily trivial activities, such as words, thoughts, discussions and communication, etc!\n\nIn order to reduce the scale of bloody massacre in the potential conflicts, some new tactic can be adopted.\n鉴于香港版版的国安法比大陆的更邪恶，把思想言语的“活动”也纳入镇压范围，为了减少大规模的流血事件，东亚地区的和平革命，可以适当融合儒家文化提倡的“忠君勤王”思想，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤。\n\n\nMany people’s mindset is still limited by the Confucius medieval theory of loyalty to the emperor. In order to reduce the scale of potential conflicts to the minimum level, the best way to launch Peace Revolution is to appeal to all Chinese people to protect the glorious history of Xi's family legacy left by Xi Zhong Xun, as Xi Zhong Xun himself supports Constitutional Democracy with freedom of speech, freedom to worship God.\n\nThe new method can help avoid the bloody massacre in the potential conflicts.\n在中国大陆，由于黄俄“伪共匿产帮”的邪恶专政，篡改历史、误导视听，目前仍然有相当一部分老百姓和军人的意识水平停留在比岳飞思想更僵化的中世纪时期的“忠君报国”之思维。\n\n不少人犯了错误判断，因为习近平的父亲习仲勋先生确实有过光辉的历史。习仲勋先生曾因为反对文化大革命的压迫而英勇奋斗，并为1980年代的改革开放做出了巨大贡献。\n\n为了减少大规模的流血事件，东亚地区的和平革命，可以适当融合儒家文化提倡的“忠君勤王”思想，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤。\n\n一些激进的口号，比如“天灭… 共”，如果还要保留，建议稍微调整为：\n“天灭伪共匿产帮、维护仲勋光辉、恢复宪政!” 等等。那种口号，不但可以减少冲突，而且大陆人士一起传播，也更方便。此举将非常有利于促进整个大陆和香港的良好互动！\n\n上述新方法，绝不是为了抹黑香港人的勇气，而是为了应对险恶时局的务实策略。\n同时说明，真正的现代文明之基石，不是表面化的民主投票、也不是五大诉求、缺一不可，而只是一个最简单的灵魂文化：\n**尊重持枪权、尊重生命**\n仅此而已。\n\n枪支的火药来源于中华文明。所以真正的中华文明，是在美国本土传承。\n在台湾，甚至还有部分韩国瑜的粉丝（韩粉）认为中国人或者台湾人都不配拥有持枪权，那种思维是在侮辱诞生火药发明的中华文化，绝不可取！\n\n香港人的最终追求不应停留在民主选举的表面操作，而是建立一套完整的\n尊重持枪权、尊重生命 的法治体系。\n\n真理很宝贵，因为被很多假象掩盖。一些政客只提“人权”的普世价值，却不提\n尊重持枪权、尊重生命 的普世原则，所以政客们的表演往往很容易背叛舞台上面的漂亮口号，而这也是美国宪法关于持枪权修正案的永恒生命力之所在！\n\n尊重持枪权、尊重生命 的普世原则，属于神圣的追求，通过持枪权规范，把世俗层面的人权和尊重生命的“神圣”宗教态度融合在一起，超越了任何物质层面的科技创新。因为它非常宝贵，所以经常被政客们制造出各种假象所掩盖。\n\n只要这个普世原则存在，美国就具有永恒的生命力，而中华文明也不会消失！\n\n备注：\n把目标从“中共”改为“伪共匿产帮”，部分年轻人可能觉得有点怪异。顺便说明一下，彻头彻尾的、绝对意义上的“无神论”信徒是不存在的，只要他不敢否认有“精神”存在，那么他就无法否认每个人的“精神”空间里都存在着或多或少的“神圣”的情感 — 这种“神圣”的情感，无论是在工作层面的，还是生活层面的，总是伴随着每个生命。 而只要有“神圣”的精神空间存在，就有“神灵”的属性存在于他的精神空间。 对于这一点，共产主义的鼻祖马克思非常雄辩，但也犯错误，即使他不信上帝，而是信仰撒旦魔鬼，撒旦魔鬼也仍然属于邪恶色彩的“神灵”，与“无神论”是自相矛盾的。\n\n所以，在中国大陆，至少在中南海，那些连官僚财产都不敢公开的所谓“共党”根本就不配习仲勋那样的“共产主义“信徒之类的称呼，更准确的叫法应该是“伪共匿产帮”。\n把目标对准一小撮“伪共匿产帮”，而不是囊括数千万基层党员的“共党”，既有应对时局险恶的现实考量，更是严谨的科学分析方法。这方面，请大家仔细思考，再付诸实行。\n如此区分，可以清晰地把囊括数千万基层党员的“共党”，与一小撮“伪共匿产帮”完全区分开来。\n采纳严谨的科学分析方法，可以让严峻而复杂的问题显得更简单一些，尽量减少大规模的冲突。\n\n随着港版国安法的进一步推动，会有更多“五毛党”涌入香港。那些偏激的“五毛党”们往往以特别的“爱国主义”腔调，非常狂热地宣传“热爱祖国”、“热爱领袖”之类的话题。对于那些“五毛党”们，尽量避免浪费口舌跟他们争论，相反，可以顺着他们的思维，既然他们的“祖国”、“领袖”是那么地伟大、光荣、正确，那就非常应该推行持枪权保护真理的原则，去维护伟大的领袖、伟大的祖国。\n\n\n类似的道理，台湾一些韩国瑜的粉丝（韩粉）们如果一直强调“统一祖国”的伟大和急迫，那么，为了保护伟大的“统一祖国”事业，大家都应该支持持枪权保护真理的原则，去保护伟大的“统一”真理。\n…………………………………………………………………………………\nChinese Doctor Lee Wen Liang’s tragedy proves that if there's no freedom of speech or to worship God in East Asia, there's no freedom of breath in Europe and America!\n如果东亚无法自由说话、信仰基督，欧美也甭想自由呼吸！\n\nThere's a huge number of population on the vast land of China, among whom quite some people are still brainwashed by the atheism regime. The Peace Revolution in China will be a little different from other countries.\n\nTraditional Confucius culture often emphasizes loyalty to the country (to the emperor in the past).  Many people made mistakes to support CCP leader Xi Jin Ping, due to their respect of Xi Jin Ping’s father Xi Zhong Xun who did fight bravely against the Oppression by the Atheism Regime itself, and for the Reform and Opening revolution in the 1980's. \n\nIn short, Peace Revolution in the name of protection of Emperor Xi’s glorious family legacy can avoid the bloody massacre in the potential conflicts, since many military people’s mindset is still limited by medieval Confucius loyalty. ",
			"added": 1594275548,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1594278554,
			"title": "Flexible Way of Hong Kong Revolution",
			"body": "更灵活的方式，如同在Hong Kong Independence前加上小号的”No to”一样。\n但是，顺着“忠君勤王”的传统腐朽思维，以拥护领袖祖宗习仲勋的光辉为名义，发起和平革命，恢复宪政、清除文革毒瘤，在当前不但没有违反“伪共”“匿产帮”的所谓爱国主义思潮，而且完全是爱党爱国的正能量，非常容易促进香港和大陆之间的良好互动。\n\n**You may live without speech, but you can’t live without breadth!\n您可以不说话，但您不能不呼吸！**\nChinese Doctor Lee Wen Liang’s tragedy proves that if there's no freedom of speech or to worship God in East Asia, there's no freedom of breath in Europe and America! \n如果东亚无法自由说话、信仰基督，欧美也甭想自由呼吸！\n习仲勋 恰巧反对文革暴政，习氏孽障即使再无法无天，也不敢公开污蔑维护习氏祖宗光辉的活动是违法的！\nEmperor Xi Jin Ping’s father Mr Xi Zhong Xun happened to be a brave fighter against the brutal oppression by the notorious cultural revolution.  When Hong Kong Revolution is launched in a patriotic way, in the name of protecting Emperor Xi’s glorious family legacy left by his father Xi Zhong Xun, no matter how unreasonably cruel Emperor Xi can go, their henchmen don't dare openly condemn the patriotic revolution is illegal!!!  \n\n",
			"added": 1594278552,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		},
		{
			"topic_id": 1596087920,
			"title": "零网用户的准管理员操作 quasi-administrator’s customization of ZeroNet",
			"body": "一些资料给新手参考，具体细节见以下页面，有截图。\nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:3_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/",
			"added": 1596087917,
			"parent_topic_uri": "10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj"
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1586800582_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 1,
				"body": "You may live without speech, but you can’t live without breadth!\n您可以不说话，但您不能不呼吸！\nChinese Doctor Lee Wen Liang’s tragedy proves that if there's no freedom of speech or to worship God in East Asia, there's no freedom of breath in Europe and America! \n如果东亚无法自由说话、信仰基督，欧美也甭想自由呼吸！\n习仲勋 恰巧反对文革暴政，习氏孽障即使再无法无天，也不敢公开污蔑维护习氏祖宗光辉的活动是违法的！\nEmperor Xi Jin Ping’s father Mr Xi Zhong Xun happened to be a brave fighter against the brutal oppression by the notorious cultural revolution.  When Hong Kong Revolution is launched in a patriotic way, in the name of protecting Emperor Xi’s glorious family legacy left by his father Xi Zhong Xun, no matter how unreasonably cruel Emperor Xi can go, their henchmen don't dare openly condemn the patriotic revolution is illegal!!!  \n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1594278554_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/Flexible+Way+of+Hong+Kong+Revolution \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1594275549_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/New+Approach+to+Hong+Kong+Peace+Revolution \n\nIf there’re no different opinions, please let more people see the new solution.",
				"added": 1594280293
			}
		],
		"1592883932_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 2,
				"body": "香港变革的主题也可以调整为：时代革命的新方式，推翻黄俄暴政!\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/\n以前有个非暴力论坛，现在好像节点变少了... \n尝试发布到以上链接，其他朋友还能够看到这个帖子吗？",
				"added": 1594299644
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 3,
				"body": "To wear masks in hot summer is certainly uncomfortable for everybody.  \nThe best way  is to solve the pandemics thoroughly. The atheism gang refused to disclose the facts behind the coronavirus. Hong Kong revolution can accelerate the collapse of the atheism gang.  \n\nIf the process of Hong Kong revolution can be accelerated in 2020,  it’d benefit American People’s rating on Donald Trump’s efforts for second presidency, while ordinary people can enjoy freedom of breath at an early date, without the necessity to wear masks in hot weather!  \n[New Approach to Revolution，Liberate Hong Kong 推翻黄俄暴政！ ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/)",
				"added": 1596993109
			}
		]
	},
	"comment_vote": {}
}