{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Let me just throw some ideas out here, I'm not trying to build a consistent unified world view, but just giving some random thoughts that seem to oppose your argument.\n\nSo you said you \"only really started with the idea that life is good and should be improved and protected\", but to me this seems like an enormous assumption on your behalf.\n\nHow do you define what is good? What is good for you can be bad for others. What is good for a community is not necessarily good for the individuals in the community. What is good now will not necessarily be good in the future, and vice versa. Cancer cells and virus cells are pro-life, they want to reproduce, but by doing so they cause problems to the host. To me there is no universal notion of good, things are more like trade-offs and balances of power everywhere. The problem with anarchism is that it assumes that everyone has the same notion of what is good and will therefore automatically want to work together, which is flawed from my point of view.\n\nWhat does it mean to improve life? Does it mean having more power? But more power for one individual likely means less for another, or being in servitude. Does it mean being happier? Well then just take drugs that make you feel happy and that's it. Does it mean living longer? Well then we'd probably have some overpopulation problem.\n\nAnd why would you want to protect life in general? Protecting one life form usually means harming another one. This is the whole concept of the food chain: to thrive, all species need to feed on other species lower in the food chain (well, except for phytoplankton). The whole thing is more like a giant equilibrium between individuals of different species that eat one another. So to me there is no universal notion of \"protecting life\", it's nonsense.\n\nYour faith in anarchism and decentralization make sense in the digital world as it is very easy for one person to build something for everyone else, and then other people can simply contribute a little something and the projects gets better and better with time and active participation of everyone. But how do you do that if your problem is building an aircraft, or building and operating a microchip factory? These are complex endeavors that need to be planned rigorously beforehand, and then everyone has to execute the plan perfectly. There is no place for individual freedom, the individuals have to be constrained by one way ore another (money seems to be the way these days) to execute that plan. But how would you do that in an anarchist society? You'd have to convince everyone that what you have planned to do is for their own good as well, that's going to be complicated.\n\nSo I'm not saying that anarchism is bad, I actually like anarchism. I'm just trying to explain why I feel that your techno-utopian views are in contradiction with the self-determination principles that anarchism seems to promote. My personal views are more neutral towards the concept of progress (there is change but we cannot define anything as \"progress\", as progressing somewhere necessarily destroys something else).\n\nAs a further reading, I'd suggest the manifesto of Theodore Kaczynski against industrial civilization. To me it was a real eye-opener. And also the book \"Straw Dogs\" by John Gray, a very interesting essay on our essence as human beings. Completely contrarian to your views ;)",
			"post_id": 47,
			"date_added": 1516703085
		},
		{
			"comment_id": 2,
			"body": "Oh and another read that I have found to be actually quite enlightening is just reading up about evolutionary psychology. For this I'd just recommend going through David Nettle's textbook \"Evolution and Genetics for Psychology\". You'd better enjoy reading ;)",
			"post_id": 47,
			"date_added": 1516704079
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}