{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "> [z0net](#comment_31_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): My guesses include one or more of the following [...]\n\nThere are so many different ideas being thrown around but my money is on famine, war, mass death. I'd love to be able to believe al the 'good wins in the end' Q type stuff, but honestly I'm jaded to the point where I'd need to see it to believe it.",
				"added": 1584682480
			}
		],
		"1585004492_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 2,
				"body": "> [aspidochelone](#comment_382_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Why would the vaccine be a mark of the beast?  A good tree bears good fruit ... if the vaccine saves lives, how can it be evil?  Don't be turned into a tool for the virus.\nI don't think that the OP means to conflate the vaccine with the being the mark itself. The mark is not a literal mark. In christian theology the forehead is associated with ones thoughts and state of mind, the right hand is associated with ones deeds and the pattern of ones life. If you accept the new system that will come, THAT is the mark, not some tatoo or chip or whatever. God doesn't care so much about physical marks as he does about the spiritual marks on a person.",
				"added": 1585012781
			}
		],
		"1585516116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 3,
				"body": "This are OK here in central minnesota. People (excluding somalians) appear to abiding by the guidelines and things are a-ok. My daily routine has not changed since I was always a recluse anyway.",
				"added": 1585618933
			}
		],
		"1585525602_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 4,
				"body": "I think the while Q thing is a larp. No matter what the wealthy and powerful will win and we the peasants and chattle will get nothing but scraps. Nothing short of the return of christ will stop them.",
				"added": 1585623419
			}
		]
	},
	"comment_vote": {
		"31_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1
	}
}