{"cert_user_id": "ProphetZarquon@github", "next_comment_id": 3, "comment": {"1604064869_mirrored_Idealcoder_github": [{"comment_id": 1, "body": "I would love to see hash-based deduplication of larger files, since many sites / torrents host identical content.\n\nJust imagine how different the torrent scene would be if torrent clients automatically reassembled pieces of a file from _any_ torrent found to contain a file with a matching size & hash.\n", "added": 1442129133, "modified": 1442129133, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/115#issuecomment-139858268", "source_type": "github"}], "1604064925_mirrored_unrealwill_github": [{"comment_id": 2, "body": "Please forgive some of my ignorance, as I am neither a professional programmer nor a security analyst:\n\nCouldn't the client machine's HOSTS file serve the same purpose as a DNS in defining separate domains / subdomains for redirection to 127.0.0.1?\n\nI don't know what issues might arise trying to continually rewrite a very large HOSTS file, but I have observed that exceedingly large lists can be employed without noticeable impact to page request times.\n\nI don't know how many domain entries would potentially need to be made, nor how often that listing would need to be updated (hopefully not every time a new .bit domain is published?) but modifying the HOSTS file seems trivial compared to the potential pitfalls of establishing a functioning local DNS server.\n\nThe HOSTS file is generally ignored as a vestigial bit of legacy support, but I've yet to see any browser-equipped machine that didn't have one. HOSTS files used for domain blacklisting commonly run into several tens of thousands of entries without impeding the function of the browser even on very modest hardware.\n\n1) Is editing the HOSTS file even feasible, or do the .bit domain listings need to be updated too often for that?\n\n2) Would an up-to-date HOSTS file solve the issue of domain-specific permissions?\n", "added": 1442127271, "modified": 1442127271, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/157#issuecomment-139857308", "source_type": "github"}]}}