{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1
	},
	"next_comment_id": 13,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#A Lenda de Hércules\nA trama enfoca a história de amor entre o filho de Zeus e a princesa mortal de Creta, prometida para o irmão mais velho do semideus. Após serem enganados por um maléfico rei, Hércules e o capitão são vendidos como escravos e devem lutar lado a lado para retomar sua liberdade.\n\n- https://openload.co/f/r7XlAbuh3i8#",
				"added": 1543863994
			},
			{
				"comment_id": 2,
				"body": "#Percy Jackson e o Ladrão de Raios\nUm rapaz chamado Percy Jackson (Lerman) descobre que é um meio-sangue, filho do deus grego, Poseidon (McKidd). Para salvar sua mãe (Keener), devolver o raio de Zeus (Bean), e prevenir uma guerra entre os deuses, ele embarca em uma jornada por toda a América de hoje com seus amigos, Annabeth Chase (Daddario), também uma meio-sangue, e Grover Underwood (Jackson), um sátiro.\n\n- https://ok.ru/video/346098502160",
				"added": 1543864081
			},
			{
				"comment_id": 3,
				"body": "#Percy Jackson e o Mar de Monstros\nO aniversário de 17 anos de Percy Jackson (Logan Lerman) foi surpreendentemente calmo, sem ataques de monstros ou algo do tipo. Entretanto, uma inocente partida faz com que Percy e seus amigos se vejam desafiados a um jogo de vida ou morte contra um grupo de gigantes canibais. A chegada de Annabeth (Alexandra Daddario) traz ainda outra má notícia: a proteção mágica do Acampamento Meio-Sangue foi enveneada por uma arma misteriosa e, ao menos que seja curada, todos os semideuses serão mortos. Não demora muito para que Percy e seus amigos tenham que enfrentar o mar de monstros para salvar o local.\n\n- https://ok.ru/video/278344501776",
				"added": 1543864121
			},
			{
				"comment_id": 4,
				"body": "#Z : A Cidade Perdida\nNos anos 1920, o lendário explorador britânico Percy Fawcett (Charlie Hunnam) parte numa viagem até a selva amazônica em busca de uma cidade que ele acredita existir: Z. Ele não encontra o lugar e faz várias expedições até descobrir onde fica Z. Em uma dessas viagens, Percy parte rumo ao Mato Grosso e desaparece sem deixar vestígios.\n\n- https://ok.ru/video/354567195152",
				"added": 1543864182
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 5,
				"body": "#Scutoids são uma solução geométrica para empacotamento tridimensional de epitélio\n- https://sci-hub.tw/10.1038/s41467-018-05376-1",
				"added": 1543872081
			}
		],
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 6,
				"body": "#Resolvendo a equação de Pell\n-  https://web.archive.org/web/20181203213642/http://www.ams.org/notices/200202/fea-lenstra.pdf",
				"added": 1543873013
			},
			{
				"comment_id": 7,
				"body": "#Prova de que os computadores não podem fazer tudo (o problema da parada)\n- https://youtu.be/92WHN-pAFCs",
				"added": 1543873516
			},
			{
				"comment_id": 8,
				"body": "#Um Problema Insolúvel da Teoria Elementar dos Números\n- https://sci-hub.tw/10.2307/2371045",
				"added": 1543873563
			},
			{
				"comment_id": 9,
				"body": "#Vigésimo quarto problema de Hilbert\nResumo: Este artigo discute o problema que quase o fez entre os vinte e três problemas não resolvidos de Hilbert apresentados em seu histórico endereço de ICM. O problema, ao definir uma noção de simplicidade para provas matemáticas, é relevante para fundações e filosofia da matemática.\n- https://web.archive.org/web/20181203215734/https://www.maa.org/sites/default/files/pdf/upload_library/22/Ford/Thiele1-24.pdf",
				"added": 1543874300
			},
			{
				"comment_id": 10,
				"body": "#Problemas de Landau\nOs Problemas de Landau são quatro conhecidos problemas sobre os números primos, que Edmund Landau catalogou como \"inatacáveis no estado atual da ciência\" durante o Congresso Internacional de Matemáticos de 1912.\n\n#Os quatro problemas são os seguintes:\n\n- A conjectura de Goldbach: Todo número par maior que 2 pode ser expresso como a soma de dois números primos ?\n- A conjectura dos números primos gêmeos: Há infinitos números primos p tais que (p+2) também é um número primo ?\n- A conjectura de Legendre: Sempre existe um número primo entre dois quadrados perfeitos ?\n- A conjectura de que há infinitos números primos p tais que (p-1) é um quadrado perfeito. Dizendo de outra forma, há infinitos números primos da forma n^2 + 1 ?",
				"added": 1543874771
			},
			{
				"comment_id": 11,
				"body": "#Quase-primos representados por polinômios quadráticos\n- https://sci-hub.tw/10.1007/BF01578070",
				"added": 1543875407
			},
			{
				"comment_id": 12,
				"body": "#Intervalo entre primos\nUm intervalo entre primos consecutivos é a diferença entre dois números primos sucessivos.\n- https://sci-hub.tw/10.1093/qmath/os-8.1.255",
				"added": 1543875752
			}
		]
	},
	"comment_vote": {
		"30_1PqwSiizFr8j1LRqegXwZPixWiQEntzc3c": 1
	}
}