{
	"title": "读书吧骚年",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 28,
	"demo": false,
	"footer": "Powered by [ZeroNet](https://zeronet.io) [open, free, and uncensored]",
	"modified": 1621903249,
	"post": [
		{
			"post_id": 27,
			"title": "New blog post",
			"date_published": 1621903241.196,
			"body": "　　法曲（散序·道情）\n\n　　飞金走玉常奔驰。日上还西。自古待著长绳系。算尘心、谩劳役堪悲。盘古到此际。桑田变海，海复成陆高低。噫嘻。下土是凡质容仪。寿考能消，几日支持。念一世。真若朝荣暮落难期。幸有志、日传得神仙希夷。希夷。堪为千古人师。\n\n　　法曲（歌头）\n\n　　柱史乘车，青牛驾轭，紫云覆顶，函关令已前知。西升稍驻，尹喜虔恭誓。求老子。亲谈道德微旨。五千余言，俱救末俗，度脱令咸归生理。体元机。人间方解道术，兼明治身，与国阶梯。更有黄庭，专分二境，内外皆举璇题。羽客见者，倾诚恳诵合彝仪。万神潜礼。密奉二经，炷香静默，心无竞，靡端倪。得失扫去，意海澄流要体。内景防愆失。外景忘疲。阆风蓬岛岂能移。念诵灵辞。指群迷。　　法曲（遍第一）\n\n　　丽景早春时。正花漏初迟。东君出震，太和应物，恍惚中立丹基。天风卦成随象，记合成□□□□□□□必相契。三千六百火候，密运精微。蒸入肌肤，嫩红潮颊，自然旧容生辉。情志。鄙凡尘，瑶圃满眼，都看桃李。晴云万叠开异色。灵光湛湛增秀逸。与道合。真境丹房，随时沐浴，亦向朝夕。\n\n　　法曲（遍第二）\n\n　　向虚靖晨起。朝元意达，冲漠怡怡。三天澄映，九光霁碧，如有鹤舞鸾飞。泛空际。瑶室明辉。动与真期。至理常寂，户庭无远，欣欣端比。侍宴日在瑶池。师友多闲，抱琴沽酒度曲，笑采华芝。九节倚筇时。何须钓月眠石，寻觅占渊静逸。乐修持。淡然灵府泳真谛。怡养丹光里。春已收功，自育火枣交梨。　　法曲（遍第三）\n\n　　珠星璧月，昼景夜色相催。正阳炎序火府，龙珠蕴照，冰海融澌。洞天春常好，日日琪花，琼蕊芳菲。绛景无别，惟似琉璃。平地环绕清bc39。火中生莲，会成真物，更取海底龟儿。胜热涤暑风，全形莹若冰肌。常存道意。铄石流金无畏。共协混元一气。入冲极。觉自己。乾体还归。\n\n　　法曲（第四攧）\n\n　　南薰殿阁，卷窗户新翠。池沼十顷净，俯桥影横霓。龟鱼自乐，潺潺螭口，流水照碧，芰荷绿满长堤。柳烟水色，一派涟漪。松竹阴中，细风缓引凉吹。琴韵响，玉德凤轸，声转瑶徽。疏襟曳履。或行或凭几。待饮彻、玉鼎云英，怎更有炎曦。\n\n　　法曲（入破第一）\n\n　　秋容应节，渐肃景入窗扉。碧洞连翠微。南律回岩桂。金精壮盛时。拥蟾轮、生素辉。启口天为侣，是列仙行缀。心均太上，欲度世缘无亏。用定力坚持。奉真常，惟凝寂。忱诚贯斗极。赐长生，仍久视。洞达虚皇位。德寿高与天齐。\n\n　　法曲（入破第二）\n\n　　清昼静居香冷，风动万年枝。凉应兑卦体。秋色鸣轻e97c。冥心运正一。御铁牛、耕寸地。都种金钱花，秀色照戊己。新霜万物凋谢，我常无为。冲起浩然气。抱冲和，人间世。登高共赏宴，泛东篱。菊尽醉。谁会。登高意表、迥出凡尘外。\n\n　　法曲（入破第三）\n\n　　光铺晓曦。云影拂霜低。空阔飞鸿过，两三行、向天际。晴景乍升，晃疏棂，蜂翅迷。密障红炉暖，香缕飘烟细。超然坐久，幽径试寻寒梅。酥点竹间稀。正疏蓓吐南枝。微阳动细蕊。任斜日、沈淡晖。惨惨寒成。晚知皓雪欲垂垂。\n\n　　法曲（入破第四）\n\n　　黄钟正严凛，飞舞屑琼瑰。清赏丰年瑞。云液喜传杯。阴爻会见复，动一阳、生浩气。谁问添宫线，炼功在金液。晴檐试暖，表里莹如无疵。庭柳漏春信，更萱色、侵苔砌。优游岁向晚，叹人间时序疾。还捧椒觞，羽衣礼无极。\n\n　　法曲（第五煞）　　多景推移。便似风灯里。将尘寰喻，尘里白驹过隙。今世过却，来生何处觅。失时节。生死到来嗟何及。勤而行之。竞力待与、钟吕相期。三千行满，连环脱下已。驾青鸾素鹤朝太微。\n\n　　大椿（太母庆七十）\n\n　　梅拥繁枝，香飘翠帘，钧奏严陈华宴。诚孝感南极，老人星垂眷。东朝功崇庆远，享五福、长乐金殿。兹时寿协七旬，庆古今来稀见。\n\n　　慈颜绿发看更新，玉色粹温，体力加健。导引冲和气，觉春生酒面。龙章亲献龟台祝，与中宫、同诚欢忭。亿万斯年，当蓬莱、海波清浅。\n\n　　花心动（同前）\n\n　　椒柏称觞，抚寰瀛佳辰，正临端月。瑞应屡臻，宫御多祥，气候暖回微冽。圣母七旬寿，敻无前、天心昭格。溥庆处，坤珍效祉，宴开清切。\n\n　　金殿箫韶备设。锵钧奏留云，舞容回雪。赭袍绣拥，袆翟同诚，递捧玉杯欢悦。愿将亿万喜，祝亿万、从兹无缺。太平主，永隆圣孝凤阙。\n\n　　保寿乐（同前）\n\n　　和气暖回元日，四海充庭琛贡至。仗卫俨东朝，郁郁葱葱，响传环佩。凤历无穷，庆慈闱上寿，皇情与天俱喜。念永锡难老，在昔难比。\n\n　　六宫嫔嫱罗绮。奉圣德、坤宁俱备。箫韶动钧奏，花似锦，广筵启。同祝宴赏处，从教月明风细。亿载享温清，长生久视。\n\n　　宴清都（太母诞辰）\n\n　　画幕明新晓。晴日薄，小春微动花柳。宸闱荐祉，东朝诞育，载光坤厚。朱颜内鼎丹就。喜自得、长生妙有。奉冕旒、衣彩坤珍，同耀帕罗珠袖。\n\n　　钧奏。翠羽帘垂，三千粉色，花明如绣。歌声缓引，梁尘暗落，五云凝昼。龙香绕斟芳酒。尽夜饮、何妨禁漏。万万载、常向慈宁，俱献圣寿。\n\n　　宴清都（贵妃生日）\n\n　　凤苑东风软。春容早，岁端新律初转。宫云丽晓，人日应钟，庆符闺范。元妃懿德尊显。位四圣、晋芳避辇。佐圣主、美化重宣，光被海宇弥远。\n\n　　香满。帝渥恩隆，歌珠舞雪，俱陈丝管。彤闱共悦，天颜有喜，看寿觞亲劝。今年外家华焕。拥使节、新班侍宴。愿万载、永冠椒房，常奉舜殿。\n\n　　一寸金（太母诞辰）\n\n　　霜落鸳鸯，绣隐芙蓉小春节。应运看，月魄分辉，坤顺同符，文母徽音芳烈。诞育乾坤主，均慈爱、练裙岂别。经沙塞、涉履烟尘，瑞色怡然更英发。\n\n　　上圣中兴，严恭问寝，宫庭正和悦。看寿筵高启，龙香低转，声入霓裳，檀槽新拨。翠衮同行乐，钧韶奏、喜盈绛阙。倾心愿、亿载慈宁，醉赏闲风月。　　国香（同前）\n\n　　十月新阳。喜桃杏秀发，宫殿春香。宝历开图，文母协应时康。诞庆欣逢令旦，向花闱、罄列嫔嫱。欢荣是九五，侍膳芳筵，翠扆龙章。\n\n　　天心人共喜，拱三钗瑞彩，同捧瑶觞。禁中和气，都入法部丝簧。一片神仙锦绣，正珠帘、高卷云光。遐龄祝亿载，永奉慈颜，地久天长。　　国香（中宫生辰）\n\n　　红染芙蓉。似晓霞丽日，秋满珠宫。瑞彩朝来，都做和气葱葱。共庆龟台降祉，化均凤历同风。升平助阴化，奉养余闲，翰墨鸾龙。\n\n　　群仙移彩仗，尽红妆玉带，乐震霜空。响入千岩，芳桂香散房栊。劝寿天颜有喜，奉觞雁序雍容。蟠桃待从此，岁岁今朝，荐酒瑶钟。\n\n　　齐天乐（同前）\n\n　　芙蓉凝露青霞护，朝日绮疏风细。正是中秋，时候喜逢，中宫葱葱佳气。云龙庆会。赞真主当阳，辅成天地。暇日琴书，暂闲蚕馆见贤志。　　嫔嫱衣罗乍试。尽趋椒殿，喜芳绣筵初启。酒面腾红，香烟罩碧，恩满六宫金翠。何妨绛烛。任花欹玉侧，劝教沈醉。凤阙龙楼，夜色凉如水。　　透碧霄（同前）　　阆苑喜新晴。正桂华、飘下太清。宝御凉秋，梦祥明月，天开辅盈成。宫闱女职遵慈训，见海宇仪型。奉东朝、晨夕趋承。化内外、咸知柔顺，已看彤管赋和平。　　宴坤宁。香腾金猊，烟暖秘殿彩衣轻。六乐丝竹，绕云萦水，总按新声。天临帝幄，亲颁寿酒，恩意兼勤。雁行缀、宰府殊荣。愿万亿斯年，南山并永，坤厚赞尧明。\n\n　　芰荷香（同前）\n\n　　彩云闲。正西瑶阿母，初驻非烟。晓空吹静，暑气清度薰弦。母仪万国，配帝德、直切天垣。阴化从此俱宣。六宫内壶，欣拜新班。\n\n　　况是关雎咏懿美，奉东朝晨夕，甘旨芳鲜。上膺慈训，下齐海宇均欢。坤宁暇日，庆盛旦、且款芳筵。永赞二圣当天。雍和化洽，亿万新年。\n\n　　玉连环（天申寿词）\n\n　　庆云开霁，清华明昼，殿阁风度薰弦。电虹敷瑞，应炎运当千。端景命、符圣德，三阶正、万国归化，远胜文思睿藻，问寝格中天。\n\n　　深严。邃启芳筵。正花拥绛扆，瑶殿神仙。缓闻钧韶奏下，歌舞云边。宫闱罄和气，浃南山。罩翠霭、上寿烟。祝无疆御历万万年。\n\n　　夏云峰（圣节）　　绍洪基，抚万宇，中兴宝运符千。枢电瑞绕，景命燕及云天。挺生真主，平四海、复禹山川。班列立、瞻云就日，职贡衣冠。　　欢均鳌禁鹓鸾。望花城粉黛，金兽祥烟。笙箫缓奏，化国日永留连。宝觞亲劝，须纵饮、歌舞韶妍。都是祝、南山圣寿，亿万斯年。\n\n　　凤凰台上忆吹箫（同前）\n\n　　碧玉烟塘，绛罗艳卉，朱清炎驭升c95f。正应运、真人诞节，宝绪灵光。海宇均颁湛露，环佩拱、北极称觞。欢声浃，三十六宫，齐奉披香。\n\n　　芬芳。宝薰如霭，仙仗捧椒扉，秀绕嫔嫱。上万寿、双鬟妙舞，一部丝簧。花满蓬莱殿里，光照坐、尊俎生凉。南山祝，常对化日舒长。\n\n　　安平乐（圣节）\n\n　　圣德如尧，圣心如舜，欣逢出震昌期。中兴继体，抚有寰瀛，三阳方是炎曦。万国朝元，奉崇严宸扆，咫尺天威。瑞色满三墀。渐嵩呼、均庆彤闱。\n\n　　正金屋妆成，翠围红绕，香霭高散狻猊。东朝移雕辇，与坤仪、同奉瑶卮。阖殿花明，亿万载、咸歌寿祺。视天民，永祈宝历，垂衣端拱无为。\n\n　　夜合花（同前）\n\n　　星拱尧眉，日临云幄，晓天初静炎曦。香凝翠扆，花笼禁殿风迟。彩山高与云齐。奉明主、玉斝交挥。庆天申旦，九州四海，同咏昌时。\n\n　　今年麦有双歧。别有琅玕并节，深秀联枝。丰世瑞物，嘉祥效祉熙熙。坐中莫惜沈醉，仰三圣、玉德光辉。献南山寿，严宸万载，永奉垂衣。\n\n　　绿头鸭（同前）\n\n　　喜雨薰泛景，翠云低柳。正凉生殿阁，梅润晓天，暑风时候。应乘乾、彩虹流渚，惊电绕、璇霄枢斗。大业辉光，益建火德，梯航四海尽奔走。六府焕修，多方平定，寰宇歌元首。凝九有。三辰拱北，万邦孚佑。\n\n　　对祥烟、霁色清和，凤韶九成仪昼。听山声、响传呼舞，腾紫府、香浓金兽。禁御升平，慈闱燕适，袆衣共上玉觞酒。齐奉舜图，南山同永，合殿备金奏。祝圣寿。圣寿无疆，两仪并久。\n\n　　赏松菊（寿圣诞辰）　　凉飙应律惊潮韵，晓对彩蟾如水。庆霄占梦月，已祥开天地。圣主中兴大业，二南化、恭勤辅翊。抚宫闱，看仪型，海宇尽成和气。\n\n　　禁掖西瑶宴席。泛天风、响钧韶空外。贵是至尊母，极人间崇贵。缓引长生丽曲，翠林正、香传瑞桂。向灵华，奉光尧，同万万岁。\n\n　　瑞鹤仙（贵妃生辰）　　小梅凝秀色，泛霁霭晴和，春容初透。璿霄降仙格，觉葱葱佳气，先惊花柳。芝兰户牖。庆禀质、天长地久。有当熊避辇，嘉声懿德，六宫居右。\n\n　　清昼。文箫仪凤，妙舞低云，缓锵钧奏。香传绣幄，腾非雾，上金兽。愿千龄遐算，三宫慈爱，长享兹辰劝酒。向瑶台阆苑，芳音永嫔万寿。\n\n　　水龙吟（会庆节）　　翠帘迟晚，龙楼丽日，海宇明新霁。枢旋大电，虹流华渚，阳春天气。出震乘乾，保民立政，垂衣裳治。诞恩均九有，功兼七制，恢图抚、四荒外。\n\n　　威动殊邻万里。拥衣冠、称觞玉陛。虞韶缓度，龙香飞下，晴云如水。行见冰天，版图来上，诸侯盟会。奉怡颜宴罢，归移宝辇，向瑶池醉。　　水龙吟（东宫寿词）\n\n　　嫩凉微袅，秋容乍肃，迥觉凉如水。重阳已近，岩华增秀，一钩天际。香动前星，气横文圃，荣光呈瑞。仰宸心密眷，行都正牧，兵民奉、神明治。\n\n　　金殿朝回燕适。肆武功、文德咸备。萧闲翰墨，惟亲书史，不寻罗绮。欢动宸严，宴开鹤禁，生朝和气。愿青宫布政，龙楼问寝，同千万岁。\n\n　　水龙吟（庆王诞辰）\n\n　　傍阶红药，新梢翠竹，榭阁薰风静。维神降岳，维熊占梦，姿仪玉聘。金殿趋庭，禁严衣彩，寝门温靖。是宗藩帝子，天潢宝牒，当神武、侍明廷。　　为善先知最乐，咏诗书、存存成性。亲师讲道，扌离华挥藻，水云高兴。一代荣观，觊尧显舜，古今难并。看青华蕊简，松乔比寿，佐南风政。\n\n　　月上海棠慢（咏题）\n\n　　东风扬暖，渐是春半，海棠丽烟径。似蜀锦晴展，翠红交映。嫩梢万点胭脂，移西溪、浣花真景。濛濛雨，黄鹂飞上，数声宜听。\n\n　　风定。朱阑夜悄，蟾华如水，初照清影。喜浓芳满池，暗香难并。悄如彩云光中，留翔鸾、静临芳镜。携酒去、何妨花边露冷。\n\n　　松梢月　　院静无声。天边正、皓月初上重城。群木摇落，松路径暖风轻。喜揖蟾华当松顶，照榭阁、细影纵横。杖策徐步空明里，但襟袖皆清。\n\n　　恍若如临异境，漾凤沼岸阔，波净鱼惊。气入层汉，疑有素鹤飞鸣。夜色徘徊迟宫漏，渐坐久、露湿金茎。未忍归去，闻何处、重吹笙。\n\n　　隔帘花（咏题）\n\n　　宿雨初晴，花艳迎阳，槛前如绣如绮。向晓峭寒轻，窣真珠十二。正朝曦、桃杏暖，透影帘栊烘春霁。似暂隔、祥烟香雾，朝仙侣庭际。\n\n　　更值迟迟丽日。且休约寻芳，与开瑶席。未拟上金钩，尽围红遮翠。命佳名、坤殿喜，为写新声传新意。待向晚、迎香临月须卷起。\n\n　　东风第一枝（元夕）　　宝苑明春，青霞射晚，六幕云闲风静。茂林修竹昂霄，素月照人澄莹。梅花十顷，递暗香、琼瑶真景。散万斛金莲，崇山秀岭，尽开花径。\n\n　　真个好、月灯相映。真个乐、圣驾游幸。四部箫韶，群仙奏乐，万光耀境。玉华不夜，向洞天、暖烟回冷。好大家、酒色醺醺，任教漏移花影。\n\n　　水龙吟（初夏）\n\n　　鉴天云敛壶中，昼暖乍喜薰风永。轻纱渐试，香罗初褪，梅阴又□。广殿窗虚，翠帘卷起，一番清影。正新篁绿嫩，池光涨雨，鱼吹浪、燕飞径。\n\n　　好是九重邃密，有岚光、烟溪深静。升平暇日，长廊别院，笙歌缓整。宝辇迟留，玉觞时举，何妨乘兴。况一年好处，犹寒未暖，是清和景。\n\n　　夏云峰（端午）\n\n　　五云开，过夜来、初收几阵梅雨。画罗携芳扇，正喜逢重午。角黍星团，巧萦臂、龙纹轻缕。细祝降福天中，列箫韶歌舞。\n\n　　薰风凉殿开处。称绡裙雾縠，莲步俦侣。翠铺交枝艾，便手香微度。菖丝浮玉，向台榭、留连欢聚。笑语。自有冰姿消烦暑。　　忆吹箫（七夕）\n\n　　烦暑衣襟，乍凉院宇，梧桐吹下新秋。望鹊羽、桥成上汉，绿雾初收。喜见西南月吐，帘尽卷、玉宇珠楼。银潢晚，应是绛河，已度牵牛。\n\n　　何妨翠烟深处，佳丽拥缯筵，斗巧嬉游。是向夕、穿针竞立，香霭飞浮。别有回廊影里，应钿合、钗股空留。江天晓，萧萧雨入潮头。\n\n　　尾犯（中秋）\n\n　　秋空过雨静，晚景澄明，天淡如水。渐看蟾彩，东山旋升，金饼上云际。轻烟散尽，莹皓色、消尘翳。倚琼楼，皎若瑶台阆风，翠阑十二。　　正好登临无外。满斟与、清光对。虽桂华飘下，玉轮移影，归兴犹未。待继日同宴赏，听秘乐、广寒宫里。惟怕却，明月阴晴未定，且宜欢醉。\n\n　　秋蕊香（重阳）\n\n　　秋色宫庭，黄花禁御，西风乍透罗衣。龙山意渐爽，瑶砌叶初飞。喜天宇、明洁晓晴时。翠楼都卷帘帷。奉宴赏，菊英环坐，金玉成围。\n\n　　凭阑海山万里，登望处，休论戏马台池。揽幽芳、泛酒面香凝，携手与、仙姿共游嬉。从他纱帽频欹。并宝马，何妨归路，月挂天西。\n\n　　十六贤（闲暇）\n\n　　拱皇图，御宝历，上圣垂衣。旰食亲万机。海宇熙熙。登寿域，瑞霞彩云常捧日。花阴麦垅四民齐。宫卫仗肃，阆苑瑶池。台殿倚晴晖。\n\n　　当盛际。风俗美。寻胜事。人物总游嬉。太平何处，知不摇征旗摇酒旗。四方感格臻上瑞。官家闲暇宴芳菲。千万岁。嘉会明盛时。　　金盏倒垂莲（牡丹）\n\n　　谷雨初晴，对晓霞乍敛，暖风凝露。翠云低映，捧花王留住。满阑嫩红贵紫，道尽得、韶光分付。禁御浩荡，天香巧随天步。\n\n　　群仙倚春似语。遮丽日、更著轻罗深护。半开微吐，隐非烟非雾。正宜夜阑秉烛，况更有、姚黄娇妒。徘徊纵赏，任放濛濛柳絮。\n\n　　庆清朝（牡丹）\n\n　　绛罗萦色，茸金丽蕊，秀格压尽群芳。人间第一娇妩，深紫轻黄。乍过夜来谷雨，盈盈明艳惹天香。春风暖，宝幄竞倚，名称花王。\n\n　　朝槛五云拥秀，护晓日、偏宜翠幕高张。秾姿露叶，临赏须趁韶光。最喜鉴鸾初试，数枝姚魏插宫妆。然绛蜡，共花拚醉，莫靳瑶觞。\n\n　　花心动（芍药）\n\n　　密幄阴阴，正嘉花嘉木，尽成新翠。蕙圃过雨，牡丹初歇，怎见浅深相倚。好称花王侍。秀层台、重楼明丽。九重晓，狂香浩态，暖风轻细。\n\n　　堪想诗人赠意。喜芳艳卿云，嫩苞金蕊。要看秀色，收拾韶华，自做殿春天气。与持青梅酒，趁凝伫、晚妆相对。且频醉，芳菲向阑可惜。\n\n　　花心动（瑞香）\n\n　　玉井生寒，正枫落吴江，冷侵罗幕。翠云翦叶，紫锦攒花，暗香遍熏珠阁。瑞非兰麝比，氤氲清彻寥廊。向燕寝，团团秀色，巧宜围却。\n\n　　宝槛浓开对列，蜂共蝶多情，未知花萼。爱玩置向窗几，时时更碾，建春浇著。最是关情处，惊梦回、酒醒初觉。楚梅早，前村任他暗落。\n\n　　杏花天慢（杏花）\n\n　　桃蕊初谢，双燕来后，枝上嫩苞时节。绛萼滋浩露，照晓景、裁翦冰绡禁格。烟传靓质。似淡拂、妆成香颊。看暖日、催吐繁英，占断上林风月。\n\n　　坛边曾见数枝，算应是真仙，故留春色。顿觉偏造化，且任他、桃李成蹊谁说。晴霁易雪。待对饮、清赏无歇。更爱惜、留引鹇禽，未须再折。　　念奴娇（林檎）\n\n　　禁烟过也，正东风浓拂，来禽奇绝。翠叶修条千万点，轻染微红香雪。霁景烘云，暖梢吹绽，浩荡春容阔。棠阴已静，此花标韵终别。\n\n　　犹记宝帖开缄，如何青李，与佳名齐列。秀实甘芳莫待看，叶底匀圆堪折。且赏琼苞，繁英插鬓，淡伫留风月。宜将图画，有时凝想重阅。\n\n　　风流子（海棠）　　中春膏雨歇，雕阑晓，最好海棠时。正新梢吐绿，万苞凝露，暖铺云锦，香点胭脂。向枝上，绪风开秀色，桃李尽成蹊。朱唇晕酒，脸红微透，翠纱轻卷，红映丰肌。\n\n　　严宸风光主，临赏处，玉殿丽日迟迟。天与造化西蜀，浓艳芳菲。待绣帘卷起，欢奉长乐，内木困多闲，同宴椒闱。须是对花满酌，不醉无归。\n\n　　蜀溪春（黄海棠）\n\n　　蜀景风迟，浣花溪边，谁种芬芳。天与蔷薇，露华匀脸，繁蕊竞拂娇黄。枝上标韵别，浑不染、铅粉红妆。念杜陵、曾见时，也为赋篇章。\n\n　　如今盛开禁掖，千万朵莺羽，先借朝阳。待得君王，看花明艳，都道赭袍同光。须趁排宴席，偏宜带、疏雨笼香。占上苑，留住春，奉玉觞。\n\n　　倚楼人（荼コ）\n\n　　清明池馆，芳菲渐晚，晴香满架笼永昼。翠拥柔条，玉铺繁蕊，袅袅舞低襟袖。秀蓓凝浩露，疑挂六铢衣绉。檀点芳心，体薰清馥，粉容宜捻春风手。\n\n　　肯与芝兰共嗅。向夜阑凝月，素芳依旧。翦取长梢，青蛟喷雪，挽住晓云争秀。楼上人未去，常恐风欺雨瘦。红绡收取，举觞犹喜，窨得醺醺酒。\n\n　　夹竹桃花（咏题）\n\n　　绛彩娇春，苍筠静锁，掩映夭姿凝露。花腮藏翠，高节穿花遮护。重重蕊叶相怜，似青帔艳妆神仙侣。正武陵溪暗，淇园晓色，宜望中烟雨。\n\n　　向暖景、谁见斜枝处。喜上苑韶华渐布。又似瑞霞低拥，却恐随风飞去。要留最妍丽，须且闲凭佳句。更秀容、分付徐熙，素屏画图取。　　峭寒轻（赏残梅）\n\n　　照溪流清浅，正万梅都开，峭寒天气。才过了元宵，渐昼长禁宇，迤逦佳时。断肠枝上雪，残英已、片影初飞。苒苒随风，送春到、便烂漫香迟。　　凝睇。迎芳菲至。觉欣欣桃李，嫩色依微。应是有新酸，向嫩梢定须，一点藏枝。乍晴还又冷，从尊前、自落轻细。寄语高楼，夜笛声、且缓吹。\n\n　　竹马子（柳）\n\n　　喜韶景才回，章台向晓，官柳舒香缕，正和烟带雨，遮桃映杏，东君先与。乍引柔条萦路。娇黄照水，经渭城朝雨。翠惹丝垂，玉阑干风静，轻轻搭住。\n\n　　到此曾追想，陶潜旧隐，忆隋堤津渡。三眠昼永凝露。更许黄鹂娇语。似怕日暖，飞花成絮，拟雪堆绣户。待放教婆娑，如眉处、笼歌舞。\n\n　　二色莲（咏题）\n\n　　凤沼湛碧，莲影明洁，清泛波面。素肌鉴玉，烟脸晕红深浅。占得薰风弄色，照醉眼、梅妆相问。堤上柳垂轻帐，飞尘尽教遮断。\n\n　　重重翠荷净，列向横塘暖。争映芳草岸。画船未桨，清晓最宜遥看。似约鸳鸯并侣，又更与、春锄为伴。频宴赏，香成阵、瑶池任晚。\n\n　　八音谐（赏荷花，以八曲声合成，故名）\n\n　　芳景到横塘，官柳阴低覆，新过疏雨。望处藕花密，映烟汀沙渚。波静翠展琉璃，似伫立、飘飘川上女。弄晓色，正鲜妆照影，幽香潜度。\n\n　　水阁薰风对万姝，共泛泛红绿，闹花深处。移棹采初开，嗅金缨留取。趁时凝赏池边，预后约、淡云低护。未饮且凭阑，更待满、荷珠露。\n\n　　清风满桂楼（丹桂）\n\n　　凉飙霁雨。万叶吟秋，团团翠深红聚。芳桂月中来，应是染、仙禽顶砂匀注。晴光助绛色，更都润、丹霄风露。连朝看、枝间粟粟，巧裁霞缕。\n\n　　烟姿照琼宇。上苑移时，根连海山佳处。回看碧岩边，薇露过，残黄韵低尘污。诗人谩自许。道曾向、蟾宫折取。斜枝戴，惟称瑶池伴侣。\n\n　　雁侵云慢（咏题）\n\n　　晓云低。是残暑渐消，凉意初至。翠帘燕去，觉商飙天气。凝华吹、动绣额，乍殿阁、金茎风细。夜雨笼微阴，满绮窗、疏影响清吹。\n\n　　轻e97c嫩细透衣。想宵长漏迟，香动罗袂。戏曾计日，忆宾鸿来期。杯盘排备宴适，乍好景、心情先喜。待淡月疏烟里，试寻岩桂蕊。\n\n　　锦标归（待雪）\n\n　　风搅长空，冷入寒云，正是严凝初至。围炉坐久，珠帘卷起，准拟六花飞砌。渐苒苒晴烟，更暗觉、远天开霁。阻琼瑶、不舞蓝田，但有蟾华铺地。\n\n　　想像如今剡溪，应误幽人访客，轻舟闲舣。翠幕登临处，散无限清兴，顿孤沈醉。念好景佳时，谩望极、祥e648为瑞。却梅花、知我心情，故把飞英飘坠。\n\n　　索酒（四时景物须酒之意）\n\n　　乍喜惠风初到，上林翠红，竞开时候。四吹花香扑鼻，露裁烟染，天地如绣。渐觉南薰，总冰绡纱扇避烦昼。共游凉亭消暑，细酌轻讴须酒。\n\n　　江枫装锦雁横秋，正皓月莹空，翠阑侵斗。况素商霜晓，对径菊、金玉芙蓉争秀。万里彤云，散飞e648，炉中焰红兽。便须点水傍边，最宜著酉。\n\n　　凤箫吟（郊祀庆成）　　列旂常。中宵天净，郊丘展采圆苍。肇禋三岁礼，圣天子为民，致福穰穰。凝旒亲奠玉，粲珠联、星斗垂芒。渐月转燔柴，露重烟断坛旁。\n\n　　欢康。青霞催晓，六乐均调，响逐新阳。辇回天仗肃，庆千官抃舞，绣锦成行。鸡竿双凤阙，肆颁宣、恩动荣光。赞永御，萝图霈泽，常抚殊方。\n\n　　六花飞（册宝）\n\n　　寅杓乍正，瑞云开晓，罩紫府宫殿。圣孝虔恭，率宸庭冠剑。上徽称、天明地察，奉玉检、璇耀金辉，仰吾君，亲被衮龙，当槛俯旒冕。\n\n　　中兴明天子，舜心温凊，示未尝闲燕。礼无前比，出渊衷深念。赞木父金母至乐，万亿载、日月荣光俱欢忭。罗绮管弦开寿宴。\n\n　　浣溪沙（赏枨）\n\n　　禁御芙蓉秋气凉。新枨岂待满林霜。旨甘初荐摘青黄。　　乍剖金肤藏嫩玉，吴盐兼味发清香。圣心此意与天长。\n\n　　浣溪沙（赏灯）\n\n　　春到皇居景晏温。冰轮驾玉上祥云。烛龙衔耀九重门。\n\n　　宫掖两仪临舜殿，金莲万斛奉尧尊。官家慈孝格乾坤。\n\n　　浣溪沙（赏丹桂）\n\n　　初过西风烟雨微。霓光留景正团枝。月中新彩与增辉。\n\n　　霞影分丹乘浩露，珊瑚秀色满彤墀。凉飙吹上赭红衣。\n\n　　浣溪沙（西园赏牡丹，寿圣亲见双花，卧下皆未睹，折以劝酒，词亦继成）\n\n　　春晓于飞彩仗明。西园嘉瑞格和鸣。花王特地献双英。\n\n　　并蒂轻黄宜淡淡，联芳竞秀巧盈盈。飞琼萼绿两倾城。\n\n　　临江仙\n\n　　解。少间，月出云静，瞻天容如鉴。上喜，以诗句书扇，卧谨以临江仙歌之\\\\\n\n　　连夜阴云开晓景，中秋胜事偏饶。十分晴莹碧天高。台升吴岫顶，乐振海门潮。\n\n　　桂影一庭香渐远，四并都向今朝。宸欢得句付风骚。围棋消白日，赏月度清宵。\n\n　　临江仙（赏芍药）\n\n　　嫩绿阴阴台榭映，南风初送清微。扬州花市进芳菲。丝头开万朵，玉叶衬繁枝。\n\n　　自是诗人佳赠意，花王香借余姿。翠红深展奉瑶卮。何妨沈醉赏，天与绊春晖。\n\n　　西江月（丹桂）\n\n　　霞绮浓披翡翠，晨光巧上珊瑚。丹林偏许下清都。香占深岩烟雨。\n\n　　秋到九华宫殿，赭袍红借繁珠。广寒桂与世花殊。不带人间风露。\n\n　　西江月（西园雪后）\n\n　　连夜六花飞舞，清晨玉境瑶阶。湖山寒雾隐楼台。难画西园真态。\n\n　　月殿九华同到，雕舆乘兴俱来。浮春帘密锦筵开。不是山阴访戴。\n\n　　诉衷情（宫中牡丹）\n\n　　西都花市锦云同。谷雨贡黄封。天心故偏雨露，名品满深宫。\n\n　　开国艳，正春融。露香中。绮罗金殿，醉赏浓春，贵紫娇红。\n\n　　武陵春（禁中元夕）\n\n　　元夕晴和中禁好，梅影玉阑干。峭窄春衫试嫩寒。金翠会群仙。　　移下一天星斗璨，喜色动宸颜。行乐风光莫放闲。月在凤凰山。\n\n　　四槛花　　鸳瓦霜浓，兽炉烟冷，琐窗渐明。芙蓉红晕减，疏篁晓风清。睡觉犹眠，怯新寒，仍宿酒，尚有余酲。拥闲衾。先记早梅糁糁，流水泠泠。\n\n　　须记岁月堪惊。最难管、苍华满镜生。心地常自乐，谁能问枯荣。一味情尘、揩摩尽，人间世，更没亏成。惟萧散，眠食外，且乐升平。\n\n　　花心动　　绿结阴浓，渐南风初到、旧家庭院。细麦落花，圆荷浮叶，翠径受风新燕。乍晴还雨香罗怯，惜柳絮、已将春远。最好处，清和气暖，喜拈轻扇。\n\n　　好对层轩邃馆。供极目晴云，晓江横练。煮酒试尝，梅子团青，草草也休辞劝。待等闲暇寻胜去，又闲事、有时萦绊。且趁取良辰，醉后莫管。\n\n　　胜胜令\n\n　　梅风吹粉，柳影摇金。渐看春意入芳林。波明草嫩，据征鞍，晚烟沈。向野馆、愁绪怎禁。　　过了烧灯，醉别院，阻同寻。琐窗还是冷瑶琴。灯花灺也，拥春寒，掩闲衾。念翠屏、应倚夜深。　　玉蹀躞（从军过庐州作）\n\n　　红绿烟村惨淡，市井初经虏。舍馆人家，b128凄但尘土。依旧春色撩人，柳花飞处，犹听几声莺语。　　黯无绪。匹马三游西楚。行路漫怀古。可惜风月，佳时尚羁旅。归处应及荼コ，与插云鬓，此恨醉时分付。\n\n　　水龙吟（曾相生日）\n\n　　海榴红暖，圆荷翠小，榭阁薰风浅。真人抚运，云龙相际，真贤载诞。鲁国元勋，相门接踵，传家非远。辅中兴大业，折冲邻壤，扶红日、上霄汉。\n\n　　端是清明重见。范陶镕、咸收群彦。垂绅正笏，炉烟不动。宸廷闲燕。天地平成，父尧子舜，永膺宸眷。赐我公岁岁，恩荣锡命，向黄金殿。\n\n　　水龙吟（送戴郎中漕荆襄）\n\n　　晓云阁雨。疏梅缀玉，尘尾闻谈吐。精忠许国，才华扌离锦，尘劳释去。六印雄图，百川明辩，苏张谁数。有奇谋欲下，阴山族帐，惟英卫、可接武。　　想见临戎丰度。慨然定、中原疆土。果惊一坐，折冲遐裔，嘉言循古。安拊疲民，静摧骄虏，无烦旗鼓。看功成、入辅中兴，永佐乾坤主。\n\n　　宴清都\n\n　　野水澄空，远山随眼，笋舆乘兴庐阜。天池最极，云溪最隐，翠迷归路。三峡两龙翔翥。尽半月、犹贪杖屦。闲引杯，相赏好处奇处，险处清处。\n\n　　凝伫。道友重陪，西山胜迹，玉隆风御。滕阁下临，晴峰万里，水云千古。飞觞且同豪举。喜醉客、龙吟度曲。待记成佳话，归时从头细数。　　江神子（c72f父以昔年梦诗寄为长短句，因韵叙谢）\n\n　　帝俞赓载下方壶。雨随车。旷时无。尽道南丰，仙骨秀而都。光照丹丘人快睹，金腰褭，玉蟾蜍。\n\n　　自怜老景病仍f156。芘微躯。驻安舆。暗润赤城，风露喜踟蹰。行矣相门还入相，看惠爱，咏猗欤。\n\n　　满庭芳\n\n　　白氎行缠，青巾包结，几年且混常流。寰中谁见，心地自清幽。雨散昆仑顶上，香润遍、琼圃无忧。灵芽长，如今寒暑，饥渴总何愁。\n\n　　诸公，须著力，尘缘扫尽，师旨坚求。看天边、飞金走玉难留。住个庵儿不大，争恋得、月馆青楼。台山里，从人一任，说个好苏州。\n\n　　满庭芳\n\n　　玉景明心，木鸡修性，要须和会三家。未知头面，何处认摩耶。自有身中异境，藏巨浪、一点笼纱。升沈际，难将赋得，有限逐无涯。\n\n　　时时，须点检，随缘遣性，何更兴嗟。那浩然独得，迥绝痕瑕。妙占熙风惠日，乘正气、三缕明霞。真机运，连环放下，无处不光华。\n\n　　满庭芳　　风搅长空，霜飞平野，冷云常带遥山。乱鸦声断，烟霭有无间。气与寒威共凉，深绣户、帘幕重关。梅枝亚，纤纤秀色，疏影小阑干。　　相携，同好景，窥檐望雪，呵手低鬟。笑语里、都言雪意非慳。有个红炉暖处，围兽炭、不管宵残。从教醉，添香倚玉，门外任清寒。　　选冠子（淮上兀坐，等待取接，因得汉使一词，他日歌之）\n\n　　细柳排空，高榆拥岸，乍觉楚天秋意。凉随夜雨，望极长淮，孤馆漫成留滞。天净无云，浪痕清影，窗户闲临烟水。叹驱驰尘事，殊喜萧散，暂来闲适。\n\n　　常念想、圣主垂衣，临朝北顾，泛遣聊宽忧寄。e225轩载揽，虎节严持，谈笑挂帆千里。凭仗皇威，滥陪枢筦，一语折冲遐裔。待归来，瞻对龙颜，须知有喜。\n\n　　选冠子（宿石门）\n\n　　秀木撑空，凝云藏岫，处处群山横翠。霜风冽面，酒力潜消，征辔暂指天际。红叶黄花，水光山色，常爱晓云晴霁。念尘埃眯眼，年华易老，觉远行非易。\n\n　　常自感、羽客难寻，蓬莱难到，强作林泉活计。鱼依密藻，雁过烟空，家信渐遥千里。还是关河冷落，斜阳衰草，苇村山驿。又鸡声茅店，鸦啼露井重唤起。　　定风波\n\n　　雪后篱边冷未晴。江天浓淡暗还明。断续流香传玉蓓。心醉。临风嗅蕊不胜清。　　映竹幽姿深有思。何似。照溪真色更多情。待得微酸藏傅粉。黄嫩。湿云潜放雨轻轻。　　祝英台\n\n　　晚寒浓，残雪重，春意在何许。萼绿仙姿，海上未飞去。粲粲玉立丰标，天寒日暮，笑东风、不曾轻付。　　几凝伫。闲为写出横斜，无声断肠句。常对幽情，何事更重赋。待约他日貂裘，玉溪清夜，喷龙吟、月明徐步。\n\n　　二郎神　　半阴未雨。霁晓寒、轻烟薄暮。乍过了挑青，名园深院，把酒偏宜细步。满槛梅花，绕堤溪柳，径暖迁莺相语。春淡淡，渐觉清明，相傍小桃才吐。\n\n　　凝伫。山村水馆，难堪羁旅。甚觑著花开，频惊屈指，谩写奚奴丽句。幸有家山，青鸾应报，为我整齐歌舞。一任待，醉倚群红，花沾酒污。\n\n　　满路花\n\n　　清都山水客，何事入临安。珍祠天赐与，半生闲。曲池人静，水击赤乌蟠。飞上烟岚顶，三缕明霞照晚，时对胎仙。　　圃中有个小庭轩。才到便翛然。坐来闲看了，篆香残。道人活计，休道出尘难。归去后、安排著，一革两麻革奚，定期踏遍名山。\n\n　　木兰花慢\n\n　　断虹收霁雨，卷帘幕、与风期。正燕子将雏，莺儿弄巧，日影迟迟。荼コ。牡丹过也，但游丝、上下网晴晖。三月韶华，转头易失，密荫匀齐。　　常思。入夏景偏奇。是梅雨霏微。更乍著轻纱，凉摇素羽，翠点清池。还思。故山旧隐，想葱茏、翠竹锁窗扉。独倚西楼谩久，此怀冷淡谁知。\n\n　　念奴娇（送李士举）\n\n　　公家世德，建凌烟勋业，中兴长策。三十年来，皆帝扆殊选，金瓯名迹。眷倚江南，澄清一道，遴柬惟公得。西清严秘，龙光高动奎壁。\n\n　　深殿衣惹天香，皇华原野，接萧萧秋色。六筦均输行奏课，唐室家声皆识。老我相逢，萍蓬飘转，晚景俱头白。西山南浦，溯风衰泪横臆。\n\n　　念奴娇\n\n　　d046冰铸雪，赋神情天壤，无伦香泽。月女霜娥，直是有如许，清明姿色。细玉钗梁，温琼环佩，语好新音发。相逢一笑，桂宫连夜寒彻。\n\n　　应是第一瑶台，水晶宫殿里，飞升仙列。小谪尘寰缘契合，同饮银浆凝结。醉里归来，魂清骨醒，乍向层城别。晓风吹袂，冷香犹带残月。\n\n　　念奴娇（持节道京城中秋日）\n\n　　五门照日，是真人膺箓，炎图家国。二百年来，抚四海安乐，六服承德。虎旅横江，胡尘眯眼，恨有中原隔。宫城缺处，望来消尽金碧。\n\n　　征辔暂款神州，期宽北顾，且驰驱朝夕。皓彩流天宁忍见，双阙笼秋月色。欲饮无聊，还成长叹，清泪空横臆。请缨无路，异时林下犹忆。\n\n　　沁园春（早春）\n\n　　春点烟红，露晞新绿，土膏渐香。散懒慵情性，寻幽选静，一筇烟雨，几处松篁。恨我求闲，已成迟暮，石浅泉甘难屡尝。犹堪去，向清风皓月，南涧东冈。　　如今雁断三湘。念酒伴、不来梅自芳。幸隐居药馆，孙登啸咏，从容云水，无负年光。且共山间，琴书朋旧，时饮无何游醉乡。归常是，趁前村桑柘，犹挂残阳。\n\n　　沁园春（赠清虚先生）\n\n　　五老横峰，二林云衲，自古洞天。喷玉龙飞，下三峡水，望香炉日奄霭，如起非烟。有个真人，拨云峰下，宴坐修真不记年。明廷诏，看龙翔凤翥，宸制奎篇。\n\n　　君臣际会诚难。耸翠阁、频颁宝墨鲜。众妙门皆向，微言显启，两朝天德，甘涌神泉。道化承平，应稽升举，且向人间寻有缘。掀髯笑，做庐山隐逸，大宋神仙。\n\n　　青玉案\n\n　　东风冉冉迟芳昼。渐黄缀、疏疏柳。为惜春来通安否。可能相就，径须图醉，莫问伤春瘦。　　陶然共酌新醅酒。咏好句、须还凤楼手。唱了新词归来后。琐窗香暗，语声和笑，喜入灯花秀。\n\n　　青玉案\n\n　　尘埃踏遍长安道。念云水、归来好。趁得梅花先春到。冷云疏雨，暗香寒艳，万玉明清晓。\n\n　　青革奚黄帽从渠笑。粲十里、冰姿步时绕。正怕和风都过了。已输高士，锦囊翻句，醉后先倾倒。\n\n　　虞美人\n\n　　风流贺监栽培好。梅最妍姿巧。娟娟占得入时妆。秀影横斜香并、彩鸳鸯。\n\n　　汉皋解佩当时遇。绿满经行处。如今清梦已惊残。赖向君家窗户、得重看。\n\n　　虞美人\n\n　　芙蓉露下闲庭晚。犹觉秋容浅。惊心莫道岁华赊。已有官梅轻放、小春花。\n\n　　西风河汉溪流月。月下疏疏雪。新妆喜是寿阳人。鸾鉴不劳呵手、对寒云。\n\n　　阮郎归\n\n　　谁将春信到长安。江南腊向残。玉妃何事在人间。冰肌莹素颜。\n\n　　新月上，怯轻寒。香心破紫檀。数枝斜傍小亭闲。黄昏人倚阑。\n\n　　阮郎归\n\n　　玉宸赐得水云身。初欣不佩绅。烟霞一任著衣巾。朝中散袒人。\n\n　　湖水静，了无尘。语兼天上春。道人相见肯情亲。银钩墨尚新。　　菩萨蛮\n\n　　乱山影直危楼起。天涯目断雕阑倚。寂寞过东风。行宫烟雨中。\n\n　　长安何处日。城郭今寒食。谁待翠华归。片云天际飞。　　菩萨蛮\n\n　　天台不是登长道。浑如弱水烟波渺。楼上指归程。春风无限情。\n\n　　石桥书不到。雁阵横空杳。愁绪比遥峰。依依千万重。　　菩萨蛮（和贺子忱）\n\n　　琴堂窗户清无暑。宫妆争捧黄金注。劝我醉秋风。难辞两脸红。\n\n　　别来三堕叶。同是修门客。十载叹萍蓬。方欣一笑同。\n\n　　清平乐\n\n　　去年春破。强半途中过。日日篷窗眠了坐。饱听吴音楚些。　　今年犹在天涯。客情触处思家。柳密何人深院，竹疏特地桃花。\n\n　　清平乐\n\n　　风休雨罢。三五春寒夜。翠额重帘何妨下。一炷非兰非麝。\n\n　　红莲开遍吴宫。华灯小试房栊。客里愁须强遣，从来我辈情钟。\n\n　　清平乐\n\n　　春前别后。常是双眉皱。生怕莺声催残漏。梦破闲衾堆绣。\n\n　　又还玉露金风。秋声先到房栊。川上不传尺素，云间犹望飞鸿。\n\n　　点绛唇\n\n　　秋雨弥空，冷侵窗户琴书润。四檐成韵。孤坐无人问。　　壮志消沈，喜入清闲运。常安分。炷烟飘尽。更拨余香烬。\n\n　　点绛唇\n\n　　惨惨春阴，画桡寒漾梅风去。冷风吹度。愁入淮山路。\n\n　　歌扉归期，只恐春城暮。人何处。柳汀烟渚。听尽篷窗雨。\n\n　　点绛唇　　晓日浓阴，冷云遮断山无数。雁飞筝柱。都向愁边去。\n\n　　帘影沈沈，一缕芳香度。深庭户。且寻欢聚。雪意还成雨。\n\n　　点绛唇\n\n　　昏旦交时，个中已有甘香味。咽同真液。便觉温温地。\n\n　　八一高蟠，光动重楼外。但留意。自然和气。香满昆仑水。\n\n　　浣溪沙　　翠袖携持婉有情。湘筠犀轴巧装成。声随一苇更分明。\n\n　　倚竹双丝明玉细，低眉数曲语莺轻。转移新韵几多声。\n\n　　浣溪沙　　玉柱檀槽立锦筵。低眉信手曲初传。凤凰飞上四条弦。\n\n　　杨柳已吹三叠韵，何须人在九江船。夜凉人与月婵娟。\n\n　　酒泉子\n\n　　霜护云低，竹外斜枝初璀璨，仙风吹堕玉钿新。度清芬。\n\n　　叹寒冰艳了无尘。不占纷纷桃李径，一庭疏影冷摇春。月黄昏。//朱希真常跋此词及谒金门“春待去”词云：读二词，洒然变俚耳之焰烟，还古风之丽则，宛转有余味也。盖治世安乐之音欤。恨无韩娥曼声长歌，以释予幽忧穷卮之疾。但诵数过，增老夫暮年之叹。\n\n　　酒泉子\n\n　　爱景催暄。初向晴梢舒玉点，修筠霭霭隔婵娟。更清妍。　　东风欲到冷霜天。常记孤山残雪路，一枝流水小桥边。卧疏烟。\n\n　　酒泉子　　惨惨西风。人与两州俱不见，一江残照落霞红。舻声中。\n\n　　汀花萍草六朝空。人向赏心增远恨，闲云犹绕建康宫。古今同。\n\n　　酒泉子\n\n　　帘幕闲垂。密密围毡红兽暖，有人陌上冷征衣。未成归。\n\n　　檐间鹊语卜归期。应是疑人犹驻马，琐窗日影又还西。翠眉低。\n\n　　朝中措\n\n　　一封清诏下金銮。临遣讲邻欢。谁问火云挥汗，要看易水摇寒。\n\n　　何妨谈笑，平生志节，可障狂澜。预约黄花前后，殊庭瞻对宸颜。　　朝中措\n\n　　宝筝偏劝酒杯深。歌舞乍沈沈。秀指十三弦上，挑吟击玉锵金。\n\n　　牙台锦面，轻移雁柱，低转新音。妙是不须银甲，向人说尽芳心。\n\n　　朝中措（送袁提举）\n\n　　鸣珂揽辔玉霄东。持节散陈红。子舍已先多士，一鞭同袅春风。\n\n　　西瓯旧治，棠阴秀茂，竹马迎逢。正焙行驰金殿，仙班看缀夔龙。\n\n　　西江月（琵琶）\n\n　　弦泛龙香细拨，声回花底莺雏。低眉信手巧工夫。犹带巫烟楚雨。\n\n　　人占东风秀色，花笼宝髻真珠。锦条金凤要人扶。只恐乘鸾飞去。\n\n　　西江月（贺子忱家赏瑞香）\n\n　　春绣东风疑早，映檐翠箔低笼。氤氲不是梦云空。叶密香繁侵冻。\n\n　　折桂广寒手段，移来点检珍丛。醉归满载紫云浓。抱膝庵中仙种。\n\n　　谒金门\n\n　　春待去。帘外连天飞絮。老大心情慵纵步。草迷池上路。\n\n　　春去不知何处。欲问谁能分付。但有清阴遮院宇。晚莺和暮雨。\n\n　　玉楼春\n\n　　昔年曾到神清洞。笑领希夷非夙梦。看时须到月边乌，养处且论铅与汞。　　土膏仍有黄芽动。神水浇香灵气种。夜深谁伴玉琴闲，鹤在九华松露重。　　饮马歌\n\n　　兀术每遇对阵之际，吹此则f7e9战无还期也\\\\\n\n　　边头春未到。雪满交河道。暮沙明残照。塞烽云间小。\n\n　　断鸿悲。陇月低。泪湿征衣悄。岁华老。\n\n　　长寿仙促拍（太母生辰）\n\n　　舜德日辉光，正初冬盛期。东朝喜、诞生时。向彤闱、清净均化有，自然和气。长生久视，金殿熙熙。宴瑶池。\n\n　　袆衣俱侍、玳筵启。花如锦、耀朝晖。太平际天子，天下养、共瞻诚意。南山虔祝，亿万同岁。\n\n　　长寿仙促拍（贵妃生日）\n\n　　绛阙岧峣，正春光到时。当人日、诞芳仪。向宫壶、雅著徽誉美，懿德无亏。深被恩荣，金殿宴嬉。气融怡。\n\n　　贤均d97e木，宜颂二南诗。天心喜、锦筵启。阖部奏笙箫，祝寿处、愿与山齐。年年常奉，明主禁掖。　　浣溪沙\n\n　　西苑烟光倚槛新。桃花艳艳静无尘。照溪红映一天云。\n\n　　肯放落红流出水，且寻歌舞赏明春。持杯知是洞中人。\n\n　　浣溪沙（赏梅）\n\n　　日上龙城散晓阴。琼芳堂下玉成林。江梅开未十分深。\n\n　　随处锦亭穹帐暖，冷香邀住入衣襟。酒肠判断付频斟。\n\n　　酒泉子　　连面霜风。野馆山村逢至日，开怀欲殢酒杯空。与谁同。\n\n　　一缄来信托飞鸿。信里催归无限意，黄昏应是出房栊。夜香浓。\n\n　　诉衷情\n\n　　人情世态饱经过。眼也见来多。忙中掉得便去，不是有人唆。　　云似舞，水如歌。笑呵呵。这回还我，半世偎绥，一味磨跎。　　诉衷情\n\n　　得抽头处好抽头。等待几时休。贤且广张四至，我早已优游。　　黄道服，布钱绉。煞风流。往来熟后，也没惊怕，也没忧愁。　　朝中措\n\n　　酴醿芳架引繁英。香远透帘清。更与洛阳花市，一齐移在宫庭。\n\n　　琉璃万朵，娇红嫩紫，总是嘉名。殿阁真仙同赏，天颜喜入欢声。　　朝中措（咏雪）\n\n　　斜斜整整暗江湾。蓑笠有无间。应与君家却暑，冷看白满群山。\n\n　　想来何处，金炉焰兽，玉斝酡颜。好是溪涵寒影，山阴一棹人还。\n\n　　谒金门（咏木樨）\n\n　　香乍起。满院垂垂岩桂。未卷珠帘香已至。酒杯言笑里。\n\n　　叶下茸金繁蕊。别是清妍风致。更远随人闻细细。月华天似水。\n\n　　谒金门\n\n　　春渐至。雪染梅梢轻细。试路新芜殊可喜。冷云闲照水。\n\n　　白苎今年不寄。最好且寻幽会。不怕清寒侵紫绮。看灯同晚醉。\n\n　　玉蹀躞\n\n　　雨过池台秋静，桂影凉清昼。槁叶喧空，疏黄满堤柳。风外残菊枯荷，凭阑一饷，犹喜冷香襟袖。　　少欢偶。人道消愁须酒。酒又怕醒后。这般光景，愁怀煞难受。谁念千种秋情，乍凉虽好，还恨夜长时候。\n\n　　水调歌头　　江影浮空阔，江水拍天流。山藏地秘、伟观须是伟人收。闻道烟斜雨暗，还留月底风边，墨客一凝眸。阑槛随指顾，江海远生秋。\n\n　　绣帘卷，开绮宴，翠香浮。邹枚宾从俱咏，韵闲出嘉谋。点点群山吴楚，历历三州灯火，潮落没沙鸥。老子会心处，应已付南楼。　　醉思仙\n\n　　记华堂。对宝台绛蜡，红艳成行。ed51乌云髻映，浅浅宫妆。江梅媚，生嫩脸，莹素质、自有清香。歌喉稳，按镂版缓拍，娇倚银床。　　天外行云驻，轻尘暗落雕梁。似晓莺历历，琼韵锵锵。别来久，春将老，但梦里、也思量。仗何人，细说与，为伊潘鬓成霜。\n\n　　江神子（c72f·父生日）\n\n　　南丰诗将驻灵江。下明光，惹天香。十雨五风，连岁致丰穰。初夏清和才四日，开寿席、宴华堂。\n\n　　严宸已奏二南章。眷循良。比龚黄。玉笋班联，宜冠紫微郎。从此锋车宣室召，据相业、寿而康。\n\n　　满庭芳\n\n　　老不求名，心惟耽静，旧缘历过艰难。杜门无事，一味放痴顽。只藉炉香上彻，与天地、平直交关。真人喜，扶晨遣客，时暂下仙班。\n\n　　矜怜。身已病，九疑夙驾，来顾台山。看神超清境，玉链朱颜。为向芝田桂圃，收妙有、与作真丹。他年报，冲融朝礼，香火紫云间。　　满庭芳\n\n　　秋色澄晖，蟾波增莹，桂华宫殿香凝。夜凉天半，横管度新声。应是齐吹万指，岩谷震、石裂霜清。天如水，飞云散尽，江月照还明。\n\n　　人间，何处有，祥风缓引，飘下层城。想广寒光冷，妙舞轻盈。愿上君王万寿，空伫忆、酒海吞鲸。归来也，惊涛隐隐，余韵入青冥。\n\n　　武陵春（重阳）\n\n　　今岁重阳经闰早，金蕊粲繁枝。玉殿珠楼步辇随。高兴在东篱。　　且泛金英同潋滟，休与傲霜期。只恐秋香一夜衰。须插满头归。　　武陵春\n\n　　玉露金风寻胜去，一月看三州。红叶黄花满意秋。真是巧装愁。\n\n　　我在天台山下住，松菊占深幽。归趁梅花映小楼。应问久迟留。\n\n　　武陵春\n\n　　惨惨江云浑不动，玉雪耿孤芳。萼绿仙人带暗香。风韵冷尤长。\n\n　　陇信不来寒日晚，疏影照澄江。肯借横斜伴酒觞。应共月商量。\n\n　　武陵春\n\n　　春到小园春草绿，烟雨湿云山。池上梅花已半残。无奈晚来寒。\n\n　　不怕醉多只怕醒，花影上阑干。人在东风缥缈间。谁与伴幽闲。\n\n　　玉楼春（后宴词）\n\n　　九重盛旦薰风候。佳气氛氲横永昼。眉心烟彩拥群仙，华宴重开同圣后。\n\n　　箫韶宫殿锵金奏。香绕祥云腾宝兽。三千嫔御奉严宸，亿万斯年祈圣寿。\n\n　　玉楼春　　佳时莫放游鞍倦。梅润清薰随处宴。不妨一半雨兼风，况对有情莺与燕。　　琼艘百柁花千点。肯使笙歌容易转。兴来人事酒消磨，谁问蚊雷和蚁战。\n\n　　浪淘沙\n\n　　归意逐飞鸿。点点书空。爱渠南去晓烟中。不似老人尘土里，一似痴聋。　　庭院晚来风。还过秋容。旧时与客绕珍丛。有酒不曾无客醉，欢与秋浓。　　浪淘沙（木樨开时雨）\n\n　　秋杪喜新凉。烟淡池塘。团团岩桂作风光。多少水云萧散意，都付芬芳。\n\n　　雨逐漏声长。小院回廊。枕边清梦几悠扬。只恐四檐声未断，洗褪幽香。\n\n　　鹧鸪天（咏枨）　　枫落吴江肃晓霜。洞庭波静耿云光。芳苞照眼黄金嫩，纤指开新白玉香。\n\n　　盐胜雪，喜初尝。微酸历齿助新妆。直须满劝三山酒，更喜持杯云水乡。　　鹧鸪天\n\n　　准拟中秋快客情。新亭雨后喜登临。彩蟾特地中宵出，吹散层云十日阴。\n\n　　松露重，月烟深。祥云捧玉到天心。金波动是经年别，为酌金荷醉碧琳。\n\n　　鹧鸪天　　曾到东风最上头。低云阁雨接溪流。只应缟袂闺房秀，尚带天香汗漫游。\n\n　　当日暇，从贤侯。冲寒迎翠小迟留。归骖白凤来何处，更指玉霄城畔楼。\n\n　　鹧鸪天（席上作，期子忱、季相之酒）\n\n　　雪后疏香一两枝。高轩乘兴访春时。金蕉酌酒应须醉，玉指传觞岂易辞。\n\n　　嗟老大，喜追随。南楼宵漏任迟迟。已闻水部神仙语，更诵骑鲸短李诗。\n\n　　好事近\n\n　　花动两山春，绿绕翠围时节。雨涨晓来湖面，际天光清彻。\n\n　　移尊兰棹压深波，歌吹与尘绝。应向断云浓淡，见湖山真色。　　好事近　　密密偃蜂房，香远未应时霎。薇露紫烟浥尽，任风欺雪压。\n\n　　老人曾饮百川空，相对肯微呷。揽取占先风度，醉高烧红蜡。\n\n　　好事近　　潮尽海波平，赏尽绿烟凉月。罗袂乍迎风快，悄喜欢不彻。\n\n　　一年好处记如今，朝暮更无热。庭院晚来些雨，是开尊时节。\n\n　　胜胜慢\n\n　　素商吹景，西真赋巧，桂子秋借蟾光。层层翠葆，深隐幽艳清香。占得秀岩分种，天教薇露染娇黄。珍庭晓，透肌破鼻，细细芬芳。　　应是月中倒影，喜余叶婆娑，灏色迎凉。移根上苑，雅称曲槛回廊。趁取蕊珠密缀，与收花雾著宫裳。帘栊静，好围四坐，对赏瑶觞。\n\n　　一翦梅\n\n　　不占前村占宝阶。芳影横斜积渐开。水边竹外冷摇春，一带冲寒，香满襟怀。\n\n　　管领东风要有才。频携歌酒上春台。直须日日玉花前，金殿仙人，同赏同来。\n\n　　御街行（和陆判院梅词）　　凌寒架雪知春近。闲探处、如相问。溪流清浅暮云低，玉蓓横斜风定。晚枝雀c269，幽姿方展，还映疏篁冷。\n\n　　镜鸾妆罢明梢嫩。犹记宜相并。如今却月别传香，知引何人幽兴。不堪楼上，昭华吹断，声与愁肠尽。\n\n　　行香子\n\n　　也爱休官。也爱清闲。谢神天、教我愚顽。眼前万事，都不相干。访好林峦。好洞府，好溪山。\n\n　　日月如盘。缺又还圆。自然他、虎踞龙蟠。河东上下，一撞三关。看也非慳。也非易，也非难。\n\n　　蓦山溪（李次仲诞日）\n\n　　乌龙云洞，神护红尘外。金鼎养丹砂，有仙卿、清修名世。三千功行，活字少人知，松露d335，紫烟深，知是聃翁裔。\n\n　　吹箫后约，岂慕穿青紫。八十在人间，比当日、何须指李。相逢一笑，酒量海同宽，拔宅隐，玉霄寒，升举应新岁。\n\n　　千秋岁\n\n　　洞房秀韵，结绮临春后。都压尽，名花柳。锦堂笼翡翠，璨枕同清昼。谁似得，佳时占断长欢偶。\n\n　　我昔闻名久。欲见成消瘦。寻不遇，空回首。征途难驻马，坐想冰姿秀。凭寄语，南归更趁酴醿酒。\n\n　　水龙吟\n\n　　冻云阁雨，长风送雪，万里无凝滞。斜斜整整，纯白入素，应同太始。袁巷萧条，冷光寒透，有人曾至。但圆虚上下，澄明莹洁，如□□、混元气。\n\n　　时听松篁泻坠。任山川、珠联玉缀。一尘不染，一毫不现，真空妙治。祥应三白，润归多稼，已成丰岁。待收拾大翁，茶盐贺喜，兴村东醉。\n\n　　念奴娇\n\n　　烘帘昼暖，正飞花堆锦，风迟烟暮。绿叶成阴春又老，甲子谁能重数。梅已青圆，雪深犹记，曾捻疏枝否。须知物外，这些光景常驻。　　闻道江水东头，同门相过，不作儿女语。醉墨凌波歌数阕，心迹都忘逆旅。胸次扶摇，壶中光景，肯与人同趣。栖尘功就，浩然俱待飞去。\n\n　　念奴娇　　半阴未雨，洞房深、门掩清润芳晨。古鼎金炉，烟细细、飞起一缕轻云。罗绮娇春。争拢翠袖，笑语惹兰芬。歌筵初罢，最宜斗帐黄昏。\n\n　　楼上念远佳人。心随沈水，学兰灺俱焚。事与人非，争似此、些子香气常存。记得临分。罗巾余赠，尽日把浓熏。一回开看，一回肠断重闻。\n\n　　沁园春\n\n　　浓绿交阴，脆圆经雨，夏景正新。遽紫泥封检，红幢建钺，飘然吹起，一片闲云。禁殿趋班，玉音亲诏，并遣皇华通宝邻。凌篘去，任重霄温暑，万里风薰。\n\n　　炎曦正斡天钧。更午气均齐天地根。运至精感化，千和万合，涤除旁说，必自成真。已约归期，秋风前后，梨枣黄花满地匀。阊阖晚，待朝元紫府，上达明君。　　菩萨蛮　　稽山鉴水无寒暑。荷香莲露相倾注。堂拟揖樵风。山围晚照红。　　桃根随秀叶。玉尘频招客。客况不言蓬。回船逸兴同。　　菩萨蛮　　萧萧还是秋容暮。炉薰已冷氲香注。犹记踏香尘。东风满院春。\n\n　　冷烟迷望处。声断阑干雨。无计问行云。黄昏空掩门。\n\n　　菩萨蛮\n\n　　花飞零乱随风舞。花梢犹带虚檐雨。帘幕映黄昏。江天日暮云。\n\n　　有人楼上望。生怕褰虚幌。冷落对炉薰。一春常怨春。\n\n　　菩萨蛮（回文）\n\n　　等闲将度三春景。景春三度将闲等。愁怕更高楼。楼高更怕愁。\n\n　　弄花梅已动。动已梅花弄。梅看几年催。催年几看梅。　　菩萨蛮　　雨昏连夜催炎暑。暑炎催夜连昏雨。长簟水波凉。凉波水簟长。\n\n　　翠鬟双倚醉。醉倚双鬟翠。香枕印红妆。妆红印枕香。\n\n　　菩萨蛮\n\n　　玉珰摇素腰如束。束如腰素摇珰玉。宜更醉春期。期春醉更宜。\n\n　　绣鸳闲永昼。昼永闲鸳绣。归念不曾稀。稀曾不念归。\n\n　　清平乐　　秋凉破暑。暑气迟迟去。最喜连日风和雨。断送凉生庭户。\n\n　　晚来灯火回廊。有人新酒初尝。且喜薄衾围暖，却愁秋月如霜。\n\n　　清平乐　　一春老病。空过春光永。药鼎煎炉朝暮景。只是医方药性。\n\n　　经旬日色云遮。山高寒透窗纱。常恨檐头倾雨，犹能枕上看花。\n\n　　清平乐\n\n　　赵家燕燕。宜在昭阳殿。春入馆娃深宫宴。秀色从来未见。　　浅颦轻笑都宜。临风好是腰肢。今夜松江归路，月明愁满清辉。　　点绛唇\n\n　　怯雨羞云，翠鬟初按檀槽就。赏心时候。常劝花间酒。\n\n　　慢捻轻拢，怨感随纤手。胡沙奏。几行红袖。都道谁家有。　　点绛唇（奉旨西湖探梅）\n\n　　不厌频来，探梅选胜湖山里。瑶林琼蕊。真是游方外。\n\n　　玉殿珠楼，不并人间世。何妨醉。都无寒意。满坐惟和气。　　点绛唇\n\n　　有个庵儿，做来不大元非小。阳光常照。坐卧谁知道。　　炼得丹砂，不是人间灶。冲和妙。鹤鸣猿啸。一任西风老。\n\n　　点绛唇\n\n　　一气冲融，浩然识取生缘处。敛归灵府。便作真铅柱。\n\n　　九任玄归，行处龙先虎。山头雨。散成清露。玛瑙生玄圃。　　点绛唇　　石洞甭寒，柳烟吹散松风静。日华光映。翠水环云径。\n\n　　道境多闲，不是人间景。谈清净。道师歌咏。花转云房影。"
		},
		{
			"post_id": 26,
			"title": "New blog post",
			"date_published": 1621903058.017,
			"body": "　　水调歌头（用卢赞元韵别彭城）\n\n　　醉击玉壶缺，恨写绿琴哀。悠悠往事谁问，离思渺难裁。绿野堂前桃李，燕子楼中歌吹，那忍首重回。唯有旧时月，远远逐人来。\n\n　　小庭空，清夜永，独徘徊。伴人幽怨，一枝潇洒陇头梅。肠断云帆西去，目送烟波东注，千里接长淮。为我将双泪，好过楚王台。\n\n　　水调歌头（时居莆田）\n\n　　亭皋木叶下，原隰菊花黄。凭高满眼秋意，时节近重阳。追想彭门往岁，千骑云屯平野，高宴古球场。吊古论兴废，看剑引杯长。\n\n　　感流年，思往事，重凄凉。当时坐间英俊，强半已凋亡。慨念平生豪放，自笑如今霜鬓，漂泊水云乡。已矣功名志，此意付清觞。\n\n　　水调歌头\n\n　　相逢非草草，分袂太匆匆。征裘泪痕浥遍，眸子怯酸风。天际孤帆难驻，柳外香軿望断，云雨各西东。回首重城远，楼观暮烟中。\n\n　　黯销魂，思陈事，已成空。东郊胜赏，归路骑马踏残红。月下一樽芳酒，凭阑几曲清歌，别后少人同。为问桃花脸，一笑为谁容。\n\n　　满庭芳\n\n　　烟锁长堤，云横孤屿，断桥流水溶溶。凭阑凝望，远目送征鸿。桃叶溪边旧事，如春梦、回首无踪。难忘处，紫薇花下，清夜一尊同。\n\n　　东城，携手地，寻芳选胜，赏遍珍丛。念紫箫声阕，燕子楼空。好是卢郎未老，佳期在、端有相逢。重重恨，聊凭红叶，和泪寄西风。　　满庭芳\n\n　　风卷龙沙，云垂平野，晚来密雪交飞。坐看阑槛，琼蕊遍寒枝。妆点兰房景致，金铺掩、帘幕低垂。红炉畔，浅斟低唱，天色正相宜。　　更阑，人半醉，香肌玉暖，宝髻云欹。又何须高会，梁苑瑶池。堪笑子猷访戴，清兴尽、忍冻空回。仍休羡，渔人江上，披得一蓑归。\n\n　　满庭芳\n\n　　鹦鹉洲边，芙蓉城下，回然水秀山明。小舟双桨，特地访云英。惊破兰衾好梦，开朱户、一笑相迎。良宵永，南窗皓月，依旧照娉婷。\n\n　　别来，无限恨，持杯欲语，恍若魂惊。念霎时相见，又惨离情。还是匆匆去也，重携手、密语叮咛。佳期在，宝钗鸾镜，端不负平生。\n\n　　满庭芳\n\n　　秦洞花迷，巫阳梦断，夜来曾到蓝桥。洞房深处，重许见云翘。蕙帐残灯耿耿，纱窗外、疏雨萧萧。双心字，重衾小枕，玉困不胜娇。\n\n　　寻常，愁夜永，今宵更漏，弹指明朝。叙深情幽怨，泪裛香绡。记取于飞厚约，丹山愿、别选安巢。骖鸾去，青霄路稳，明月共吹箫。\n\n　　满庭芳\n\n　　玉鼎翻香，红炉叠胜，绮窗疏雨潇潇。故人相过，情话款良宵。酒晕微红衬脸，横波浸、满眼春娇。云屏掩，鸳鸯被暖，欹枕听寒潮。\n\n　　如今，成别恨，临风对月，总是无聊。念伤心南陌，执手河桥。还似一场春梦，离魂断、楚些难招。佳期在，踏青时候，花底听鸣镳。\n\n　　苏武慢\n\n　　雁落平沙，烟笼寒水，古垒鸣笳声断。青山隐隐，败叶萧萧，天际暝鸦零乱。楼上黄昏，片帆千里归程，年华将晚。望碧云空暮，佳人何处，梦魂俱远。\n\n　　忆旧游、邃馆朱扉，小园香径，尚想桃花人面。书盈锦轴，恨满金徽，难写寸心幽怨。两地离愁，一尊芳酒，凄凉危栏倚遍。尽迟留，凭仗西风，吹干泪眼。\n\n　　飞雪满群山\n\n　　冰结金壶，寒生罗幕，夜阑霜月侵门。翠筠敲竹，疏梅弄影，数声雁过南云。酒醒欹粲枕，怆犹有、残妆泪痕。绣衾孤拥，余香未减，犹是那时熏。　　长记得、扁舟寻旧约，听小窗风雨，灯火昏昏。锦裀才展，琼签报曙，宝钗又是轻分。黯然携手处，倚朱箔、愁凝黛颦。梦回云散，山遥水远空断魂。\n\n　　飞雪满群山　　绝代佳人，幽居空谷，绮窗森玉猗猗。小舟双桨，重寻旧约，洞房宛是当时。夜阑红烛暗，黯相对、浑如梦里。旋烘鸳锦，尘生绣帐，香减缕金衣。\n\n　　须信有、盟言同皎日，□利牵名役，事与君违。□君已许，今生来世，两情到此奚疑。彩鸾须凤友，算何日、丹山共归。未酬深愿，绵绵此恨无尽期。\n\n　　水龙吟（重过旧隐）\n\n　　画桥流水桃溪路，别是壶中佳致。南楼夜月，东窗疏雨，金莲共醉。人静回廊，并肩携手，玉芝香里。念紫箫声断，巫阳梦觉，人何在、花空委。　　寂寞危栏触倚。望仙乡、水云无际。芸房花院，重来空锁，苍苔满地。物是人非，小池依旧，彩鸳双戏。念当时风月，如今怀抱，有盈襟泪。　　蓦山溪（登历阳城楼）\n\n　　孤城暮角，落日边声静。醉袖拂危阑，对天末、孤云愁凝。吴津楚望，表里抱江山，山隐隐，水迢迢，满目江南景。\n\n　　羁怀易感，往事伤重省。罗袂浥残香，鬓星星、忍窥清镜。琼英好在，应念玉关遥，凝泪眼，下层楼，回首平林暝。\n\n　　蓦山溪　　疏梅雪里，已报东君信。冷艳与清香，似一个、人人标韵。晚来特地，酌酒慰幽芳，携素手，摘纤枝，插向乌云鬓。\n\n　　老来世事，百种皆消尽。荣利等浮云，谩汲汲、徒劳方寸。花前眼底，幸有赏心人，歌金缕，醉瑶卮，此外君体问。\n\n　　蓦山溪　　昼云今旦，雪霁严凝候。玉辇想回銮，正花覆、千官锦绣。周南留滞，清梦绕觚棱，心耿耿，路迢迢，此际空回首。\n\n　　华堂荐寿。玉笋持椒酒。一曲啭春莺，更祝我、膺时纳祐。功名富贵，老去已灰心，唯只愿，捧觞人，岁岁长依旧。\n\n　　蓦山溪　　金风玉露，时节清秋候。散发步闲亭，对荧荧、一天星斗。悲歌慷慨，念远复伤时，心耿耿，发星星，倚仗空搔首。\n\n　　区区恋豆。岂是甘牛后。时命未来间，且只得、低眉袖手。男儿此志，肯向死前休，无限事，几多愁，总付杯中酒。\n\n　　念奴娇\n\n　　凌空宝观，乍登临、多少伤离情味。淼淼烟波吴会远，极目江淮无际。槛外长江，楼中红袖，淡荡秋光里。一声横吹，半滩鸥鹭惊起。\n\n　　因念邃馆香闺，玉肌花貌，有盈盈仙子。弄水题红传密意，宝墨银钩曾寄。泪粉香销，碧云□杳，脉脉人千里。一弯新月，断肠危栏独倚。\n\n　　念奴娇\n\n　　岁华晼晚，念羁怀多感，佳会难卜。草草杯盘聊话旧，同剪西窗寒烛。翠袖笼香，双蛾敛恨，低按新翻曲。无情风雨，断肠更漏催促。\n\n　　匆匆归骑难留，鸾屏鸳被，忍良宵孤宿。回首幽欢成梦境，唯觉衣襟芬馥。海约山盟，云情雨意，何日教心足。不如不见，为君一味愁蹙。\n\n　　念奴娇\n\n　　画堂宴阕，望重帘不卷，轻哑朱户。悄悄回廊，惊渐闻、蟋蟀凌波微步。酒力融春，香风暗度，携手偎金缕。低低笑问，睡得真个稳否。\n\n　　因念隔阔经年，除非魂梦里，有时相遇。天意怜人心在了，岂信关山遐阻。晓色朦胧，柔情眷恋，后约叮咛语。休教肠断，楚台朝暮云雨。\n\n　　念奴娇\n\n　　当年豪放，况朋侪俱是，一时英杰。逸气凌云，佳丽地、独占春花秋月。冶叶倡条，寻芳选胜，是处曾攀折。昔游如梦，镜中空叹华发。\n\n　　邂逅萍梗相逢，十年往事，忍尊前重说。茂绿成阴春又晚，谁解丁香千结。宝瑟弹愁，玉壶敲怨，触目堪愁绝。酒阑人静，为君肠断时节。\n\n　　念奴娇\n\n　　轻雷骤雨，洗千岩浓翠，层峦森列。衣袂凉生，丛竹外、时有飞萤明灭。云浪鳞鳞，兰舟泛泛，共载一轮月。五湖当日，未应此段奇绝。\n\n　　归路横玉惊鸾，叫云清似水，悠扬天末。玉宇琼林凝望处，依约广寒宫阙。老去情钟，此心仍在，未肯甘华发。清欢留作，异时嘉话重说。\n\n　　雨中花慢\n\n　　寓目伤怀，逢欢感旧，年来事事疏慵。叹身心业重，赋得情浓。况是离多会少，难忘雨迹云踪。断无锦字，双鳞杳杳，新雁雍雍。　　良宵孤枕，人远天涯，除非梦里相逢。相逢处，愁红敛黛，还又匆匆。回首绿窗朱户，可怜明月清风。断肠风月，关河有尽，此恨无穷。\n\n　　喜迁莺\n\n　　青娥呈瑞。正惨惨暮寒，同云千里。剪水飞花，渐渐瑶英，密洒翠筠声细。邃馆静深，金铺半掩，重帘垂地。明窗外。伴疏梅潇洒，玉肌香腻。　　幽人当此际。醒魂照影，永漏愁无寐。强拊清尊，慵添宝鸭，谁会黯然情味。幸有赏心人，奈咫尺、重门深闭。今夜里。算忍教孤负，浓香鸳被。\n\n　　忆瑶姬（南徐连沧观赏月）\n\n　　微雨初晴。洗瑶空万里，月挂冰轮。广寒宫阙近，望素娥缥缈，彤桂亭亭。金盘露冷，玉树风轻。倍觉秋思清。念去年，曾共吹箫侣，同赏蓬瀛。　　奈此夜、旅泊江城。谩花光眩目，绿酒如渑。幽怀终有恨，恨绮窗清影，虚照娉婷。蓝桥□杳，楚馆云深。拟凭归梦去，强就枕，无奈孤衾梦易惊。\n\n　　丑奴儿慢\n\n　　明眸秀色，别是天真潇洒。更鬓发堆云，玉脸淡拂轻霞。醉里精神，众中标格谁能画。当时携手，花笼淡月，重门深亚。\n\n　　巫峡梦回，已成陈事，岂堪重话。谩赢得、罗襟清泪，鬓边霜华。念□伤怀，凭阑烟水渺无涯。秦源目断，碧云暮合，难认仙家。\n\n　　满江红\n\n　　人倚金铺，颦翠黛、盈盈堕睫。话别处、留连无计，语娇声咽。十幅云帆风力满，一川烟暝波光阔。但回首、极目望高城，弹清血。\n\n　　并兰舟，停画楫。曾共醉，津亭月。销魂处，今夜月圆人缺。楚岫云归空怅望，汉皋珮解成轻别。最苦是、拍塞满怀愁，无人说。\n\n　　婆罗门引（再游仙潭薛氏园亭）\n\n　　素秋向晚，岁华分付木芙蓉。萧萧红蓼西风。记得当时撷翠，拥手绕芳丛。念吹箫人去，明月楼空。\n\n　　遥山万重。望寸碧、想眉峰。翠钿琼珰谩好，谁适为容。凄凉怀抱，算此际、唯我与君同。凝泪际、目送征鸿。\n\n　　青玉案（和贺方回韵）\n\n　　参差弱柳长堤路。柳外征帆去。皓齿明眸娇态度。回头一梦，断肠千里，不到相逢地\n\n　　来时约略春将暮。幽恨空余锦中句。小院重门深几许。桃花依旧，出墙临水，乱落如红雨。\n\n　　青玉案\n\n　　鸾凰本是和鸣友。奈无计、长相守。云雨匆匆分袂后。彩舟东去，橹声呕轧，目断长堤柳。\n\n　　涓涓清泪轻绡透。残粉余香尚依旧。独上南楼空回首。夜来明月，怎知今夜，少个人携手。\n\n　　浣溪沙（壬寅五月西湖）\n\n　　双佩雷文拂手香。青纱衫子淡梳妆。冰姿绰约自生凉。　　虚掉玉钗惊翡翠，缓移兰棹趁鸳鸯。鬓鬟风乱绿云长。　　浣溪沙\n\n　　玉趾弯弯一折弓。秋波剪碧滟双瞳。浅颦轻笑意无穷。\n\n　　夜静拥炉熏督耨，月明飞棹采芙蓉。别来欢事少人同。\n\n　　浣溪沙（仙潭二首）\n\n　　萍末风轻入夜凉。飞桥画阁跨方塘。月移花影上回廊。\n\n　　粲枕随钗云鬓乱，红绵扑粉玉肌香。起来手看鸳鸯。\n\n　　浣溪沙\n\n　　窗外疏篁对节金。画桥新绿一篙深。沈沈清夜对横参。　　酒晕半消红玉脸，云鬟轻制小犀簪。梦回陈迹杳难寻。\n\n　　浣溪沙（昆山月华阁）\n\n　　沙上寒鸥接翼飞。潮生潮落水东西。征船鸣橹趁潮归。\n\n　　望断碧云无锦字，谩题红叶有新诗。黄昏微雨倚阑时。\n\n　　浣溪沙\n\n　　漠漠新田绿未齐。柳阴阴下水平堤。竹间时有乳鸦啼。\n\n　　云敛屏山横枕畔，夜阑璧月转林西。玉芝香里彩鸳栖。\n\n　　浣溪沙\n\n　　紫燕双双掠水飞。廉纤小雨未成泥。篱边开尽野蔷薇。\n\n　　会少离多终有恨，暂来还去益堪悲。后期重约采莲时。\n\n　　浣溪沙\n\n　　窄窄霜绡稳称身。强临歌酒惨离魂。故人相遇益伤神。\n\n　　断雨残云千里隔，琼枝璧月四时新。为君留取镜中春。　　浣溪沙\n\n　　且斗尊前见在身。昔游如梦可销魂。玉容依约旧精神。\n\n　　千里重来人事改，一杯相属意还新。韶华不减洞中春。　　浣溪沙（赋向伯恭芗林木犀二首）\n\n　　木似文犀感月华。寸根移种自仙家。春兰秋菊浪矜夸。\n\n　　玉露初零秋夜永，幽香直入小窗纱。此时风月独输他。\n\n　　浣溪沙　　叶剪玻璃蕊糁金。清香端不数琼沈。独将高韵冠芗林。\n\n　　千里江山新梦后，一天风露小庭深。主人归兴已骎骎。//伯恭时守平江府，署中亦有木犀，开时大起归兴，余故有后词末韵。不数月，得请，归芗林旧隐。\n\n　　浣溪沙\n\n　　浅褐衫儿寿带藤。碾花如意枕冠轻。凤鞋弓小称娉婷。　　约略梳妆随事好，出尘标韵出尘清。一枝梅映玉壶冰。\n\n　　浣溪沙\n\n　　窗外桃花烂熳开。年时曾伴玉人来。一枝斜插凤皇钗。　　今日重来人事改，花前无语独徘徊。凄凉怀抱可怜哉。\n\n　　虞美人\n\n　　瑶琴一弄清商怨。楼外桐阴转。月会澄淡露华浓。寂寞小池烟水、冷芙蓉。\n\n　　攀花撷翠当时事。绿叶同心字。有情还解忆人无。过尽寒沙新雁、甚无书。\n\n　　虞美人　　飞梁石径关山路。惨淡秋容暮。一行新雁破寒空。肠断碧云千里、水溶溶。　　鸾衾欲展谁堪共。帘幕霜华重。鸭炉香尽锦屏中。幽梦今宵何许、与君同。\n\n　　虞美人　　红尘匹马长安道。人与花俱老。缓垂鞭袖过平康。散尽高阳、零落少年场。　　朱弦重理相思调。无奈知音少。十年如梦尽堪伤。乐事如今、回首做凄凉。\n\n　　虞美人（甲辰入燕）\n\n　　彩旗摇曳樯乌转。鹢首征帆展。高城楼观暮云平。叠鼓凝笳都在、断肠声。　　绿窗朱户空回首。明月还依旧。乱山无数水茫茫。谁念塞垣风物、日煞凄惶。\n\n　　虞美人\n\n　　堆琼滴露冰壶莹。楼外天如镜。水晶双枕衬云鬟。卧看千山明月、听潺湲。\n\n　　渡江桃叶分飞后。马上犹回首。邮亭今夜月空圆。不似当时携手、对婵娟。\n\n　　虞美人\n\n　　碧溪曾寄流红字。忍话当时事。重来种种尽堪悲。有酒盈杯、聊为故人持。\n\n　　夜闲剪烛西窗语。怀抱今如许。尊前莫讶两依依。绿鬓朱颜、不似少年时。\n\n　　虞美人\n\n　　鸾屏绣被香云拥。平帖幽闺梦。觉来重试古龙涎。深炷玉炉、烧气不烧烟。\n\n　　匆匆人去三更也。月到回廊下。出门无语送郎时。泪共一天风露、湿罗衣。\n\n　　生查子　　画堂初见伊，明月当窗满。今夜月如眉，话别河桥畔。\n\n　　重见约中秋，莫负于飞愿。免使月圆时，两处空肠断。　　生查子\n\n　　霜寒月满窗，夜永人无寐。绛蜡有余情，偏照鸳鸯被。　　看尽旧时书，洒尽今生泪。衙鼓已三更，还是和衣睡。\n\n　　生查子　　金壶插玉芝，人面交相照。花影满方床，翠叠屏山杳。\n\n　　风月亦多情，特地今宵好。尽道夜初长，弹指东窗晓。\n\n　　生查子\n\n　　几番花信风，数点笼丝雨。并辔踏香尘，选胜东郊路。\n\n　　韶华转首空，谁解留春住。幸到绿尊前，且作莺花主。\n\n　　生查子\n\n　　银缸委坠红，碧锁朦胧晓。别泪洒金徽，一曲情多少。　　邮亭今夜长，明月香帏悄。纵使梦相逢，何处寻蓬岛。\n\n　　南歌子\n\n　　萧寺疏钟断，虚堂夜气清。凉蟾偏向小窗明。露井碧梧寒叶、颤秋声。\n\n　　幽恨人谁问，孤衾泪独横。此时风月此时情。拟倩蓝桥归梦、见云英。\n\n　　南歌子　　远水澄明绿，孤云黯淡愁。白萍红蓼满汀洲。肠断圆蟾空照、木兰舟。　　节物伤羁旅，归程叹滞留。佳期已误小红楼。赖得今年犹有、闰中秋。\n\n　　南歌子\n\n　　恨入眉峰翠，寒生酒晕红。临期凝泪洒西风。须信世间无物、似情浓。\n\n　　玉蹬敲霜月，金钲伴晓钟。凄凉古驿乱山重。今夜拥衾无寐、与君同。\n\n　　南乡子\n\n　　天外雨初收。风紧云轻已变秋。邂逅故人同一笑，迟留。聚散人生宜自谋。\n\n　　去路指南州。万顷云涛一叶舟。莫话太湖波浪险，归休。人在溪边正倚楼。\n\n　　南乡子\n\n　　因为此词\\\\\n\n　　木落雁南翔。锦鲤殷勤为渡江。泪墨银钩相忆字，成行。滴损云笺小凤皇。\n\n　　陈事费思量。回首烟波卷夕阳。尽道凭书聊破恨，难忘。及至书来更断肠。\n\n　　菩萨蛮（沐发）\n\n　　鸳鸯枕上云堆绿。兰膏微润知新沐。开帐对华灯。见郎双眼明。　　锦衾香馥郁。槛竹敲寒玉。何物最无情。晓鸡咿喔声。　　菩萨蛮\n\n　　杏花零落清明雨。卷帘双燕来还去。枕上玉芙蓉。暖香堆锦红。\n\n　　翠翘金钿雀。蝉鬓慵梳掠。心事一春闲。黛眉颦远山。　　菩萨蛮　　飞英不向枝头住。等闲又送春归去。云幄翠阴浮。长随日脚流。\n\n　　玉箫吹凤怨。惊起楼中燕。飞去自双双。恼人空断肠。\n\n　　菩萨蛮（广陵盛事）\n\n　　水光山影浮空碧。柳丝摇曳春无力。柳岸系行舟。吹箫忆旧游。　　旧游堪更忆。望断迷南北。千古恨悠悠。长江空自流。\n\n　　菩萨蛮　　当时携手今千里。可堪重到相逢地。触目尽关心。流莺尚好音。\n\n　　无人知我意。只有涓涓泪。寂寞到斜阳。罗衣裛旧香。\n\n　　菩萨蛮\n\n　　鸣笳叠鼓催双桨。扁舟稳泛桃花浪。别泪洒东风。前欢如梦中。　　梦魂无定据。不到相逢处。纵使梦相逢。香闺岂解同。\n\n　　菩萨蛮\n\n　　金铺半掩银蟾满。个人应恨归来晚。轧轧橹声迟。那知心已飞。　　迎门一笑粲。娇困横波慢。偎倚绿窗前。今宵人月圆。\n\n　　菩萨蛮\n\n　　双双紫燕来华屋。雨余芳草池塘绿。一夜摆花风。莺花满树红。\n\n　　杯深君莫诉。醉袖歌金缕。无奈惜花心。老来情转深。\n\n　　菩萨蛮　　朝来一阵狂风雨。春光已作堂堂去。茂绿满繁枝。青梅结子时。　　攀枝惊晼晚。乐事孤心眼。正是惜春归。那堪怨别离。\n\n　　菩萨蛮\n\n　　凝羞隔水抛红豆。嫩桃如脸腰如柳。心事暗相期。阳台云雨迷。　　玉楼花似雪。花上朦胧月。挥泪执柔荑。匆匆话别时。\n\n　　菩萨蛮\n\n　　花冠鼓翼东方动。兰闺惊破辽阳梦。翠被小屏山。晓窗灯影残。\n\n　　并头双燕语。似诉横塘雨。风雨晓寒多。征人可奈何。\n\n　　忆秦娥（西湖）\n\n　　湖光碧。春花秋月无今昔。无今昔。十年往事，尽成陈迹。\n\n　　玉箫声断云屏隔。山遥水远长相忆。长相忆。一生怀抱，为君牵役。\n\n　　忆秦娥\n\n　　花阴月。兰堂夜宴神仙客。神仙客。江梅标韵，海棠颜色。　　良辰佳会诚难得。花前一醉君休惜。君休惜。楚台云雨，今夕何夕。\n\n　　清平乐\n\n　　彩舟双橹。六月临平路。小雨轻风消晚暑。绕岸荷花无数。\n\n　　玉人璨枕方床。遥知待月西厢。昨夜有情风月，今宵特地凄凉。\n\n　　清平乐\n\n　　南窗月满。绣被堆香暖。苦恨春宵更漏短。应讶郎归又晚。\n\n　　征帆初落桥边。迎门一笑嫣然。今夜流霞共酌，何妨金盏垂莲。\n\n　　清平乐　　明眸秀色。肌理凝香雪。罗绮丛中标韵别。捧酒歌声清越。\n\n　　不辞醉脸潮红。却愁归骑匆匆。回首绿窗朱户，断肠明月清风。\n\n　　谒金门\n\n　　溪声咽。溪上有人离别。别语叮咛和泪说。罗巾沾泪血。\n\n　　尽做刚肠如铁。到此也应愁绝。回首断山帆影灭。画船空载月。　　谒金门\n\n　　相思切。触目只供愁绝。好梦惊回清漏咽。烛残香穗结。　　长恨南楼明月。只解照人离缺。同倚朱栏飞大白。今宵风月别。\n\n　　忆王孙\n\n　　凉生冰簟怯衣单。明月楼高空画栏。满院啼螀人未眠。掩重关。乌鹊南飞风露寒。\n\n　　阮郎归\n\n　　烟笼寒水暝禽栖。满庭红叶飞。兰堂寂寂画帘垂。霜浓更漏迟。　　鸳被冷，麝香微。强欹单枕时。西窗看尽月痕移。此情君怎知。\n\n　　柳梢青　　数声鶗f774。可怜又是，春归时节。满院东风，海棠铺绣，梨花飘雪。\n\n　　丁香露泣残枝，算未比、愁肠寸结。自是休文，多情多感，不干风月。\n\n　　柳梢青\n\n　　子规啼月。幽衾梦断，销魂时节。枕上斑斑，枝头点点，染成清血。\n\n　　凄凉断雨残云，算此恨、文君更切。老去情怀，春来况味，那禁离别。\n\n　　柳梢青\n\n　　联璧寻春，踏青尚忆，年时携手。此际重来，可怜还是，年时时候。\n\n　　阴阴柳下人家，人面桃花似旧。但愿年年，春风有信，人心长久。\n\n　　好事近\n\n　　花露滴香红，花底漏声初歇。人似一枝梅瘦，照冰壶清彻。\n\n　　翠蛾云鬓为谁容，虫丝宝奁结。可惜一春憔悴，负满怀风月。　　好事近\n\n　　十幅健帆风，天意巧催行客。极目五湖云浪，泛满空秋色。\n\n　　玉人应怪误佳期，凝恨正脉脉。锦鳞为传尺素，报兰舟消息。\n\n　　卜算子\n\n　　风雨送春归，寂寞花空委。枝上红稀地上多，万点随流水。\n\n　　翠黛敛春愁，照影临清bc39。应念韶华惜蕣颜，洒遍胭脂泪。\n\n　　卜算子　　小阁枕清流，一霎莲塘雨。风递幽香入槛来，枕簟全无暑。\n\n　　遐想似花人，阅岁音尘阻。物是人非空断肠，梦入芳洲路。　　卜算子（题扇）\n\n　　玉斧斩冰轮，中有乘鸾女。鬓乱钗横襟袖凉，只恐劝飞举。\n\n　　青冥缥缈间，自有吹箫侣。不向巫山十二峰，朝暮为云雨。　　卜算子\n\n　　前度月圆时，月下相携手。今夜天边月又圆，夜色如清昼。\n\n　　风月浑依旧。水馆空回首。明夜归来试问伊，曾解思量否。\n\n　　卜算子　　重重雪外山，渺渺烟中路。路转山横无尽愁，正是分携处。　　望极锦中书，肠断鱼中素。锦素沈沈两未期，鱼雁空相误。\n\n　　卜算子\n\n　　春事付莺花，曾是莺花主。醉拍春衫金缕衣，只向花间住。　　密意君听取。莫逐风来去。若是真心待于飞，云里千条路。\n\n　　小重山（吴松浮天阁送别）\n\n　　楼外江山展翠屏。沈沈虹影畔，彩舟横。一尊别酒为君倾。留不住，风色太无情。　　斜日半山明。画栏重倚处，独销凝。片帆回首在青冥。人不见，千里暮云平。\n\n　　小重山　　淡淡秋容烟水寒。楼高清夜永，倚阑干。玉人不见坐长叹。箫声远，明月满空山。\n\n　　遐想绿云鬟。青冥风露冷，独乘鸾。别时容易见时难。凭孤枕，聊复梦婵娟。\n\n　　小重山\n\n　　之筹边阁，诚不负所闻。明年归，则陈已入道矣。崔守呼之至，即席赠此\\\\　　流水桃花小洞天。壶中春不老，胜尘寰。霞衣鹤氅并桃冠。新装好，风韵愈飘然。　　功行满三千。婴儿并姹女，链成丹。刘郎曾约共升仙。十个月，养个小金坛。\n\n　　小重山\n\n　　楼上风高翠袖寒。碧云笼淡日，照阑干。绿杨芳草恨绵绵。长亭路，何处认征鞍。\n\n　　晓镜懒重看。鬓云堆凤髻，任阑珊。鸾衾鸳枕小屏山。人如玉，忍负一春闲。\n\n　　踏莎行　　珮解江皋，魂消南浦。人生惟有别离苦。别时容易见时难，算来却是无情语//尽载席上语。\n\n　　百计留君，留君不住。留君不住君须去。望君频问梦中来，免教肠断巫山雨。\n\n　　踏莎行（泰妓胡芳来常隶籍，以其端严如木偶，人因目之为佛，乃作是云）\n\n　　如是我闻，金仙出世。一超直入如来地。慈悲方便济群生，端严妙相谁能比。\n\n　　四众归依，悉皆欢喜。有情同赴龙华会。无忧帐里结良缘，么诃修哩修修哩。\n\n　　踏莎行　　客里光阴，伤离情味。玉觞未举心先醉。临岐莫怪苦留连，樯乌转处人千里。\n\n　　恨写新声，云笺密寄。短封难尽心中事。凭君看取纸痕斑，分明总是离人泪。\n\n　　踏莎行（题团扇）\n\n　　落日归云，寒空断雁。吴波浅淡山平远。丹青写出在霜缣，佳人特地裁团扇。　　渔艇孤烟，酒旗幽院。些儿景趣君休羡。五湖归去共扁舟，何如早早酬深愿。\n\n　　踏莎行\n\n　　水满青钱，烟滋翠葆。残英满地无人扫。先来羁思乱如云，无端更被春酲恼。\n\n　　叠叠遥山，绵绵远道。凭阑满目唯芳草。莫惊青鬓点秋霜，卢郎已分愁中老。　　踏莎行（赠光严道人）\n\n　　玉质孤高，天姿明慧。了无一点尘凡气。白莲空殿锁幽芳，亭亭独占秋光里。\n\n　　一切见闻，不可思议。我今有分亲瞻礼。愿垂方便济众生，他时同赴龙华会。\n\n　　定风波\n\n　　一曲骊歌酒一钟。可怜分袂太匆匆。百计留君留不住。□去。满川烟暝满帆风。　　目断魂销人不见。但见。青山隐隐水浮空。拟把一襟相忆泪。试□。云笺密洒付飞鸿。\n\n　　定风波（丙寅四月吴门西楼之集）\n\n　　老去情钟不自持。篸花酌酒送春归。玉貌冰姿人窈窕。一笑。清狂岂减少年时。\n\n　　欲上香车俱脉脉，半帘花影月平西。待得酒醒人已去。凝伫。断云残雨尽堪悲。\n\n　　点绛唇（登历阳连云观）　　水绕孤城，乱山深锁横江路。帆归别浦。苒苒兰皋暮。　　人在天涯，雁背南云去。空凝伫。凤楼何处。烟霭迷津渡。　　点绛唇（和安行老韵）\n\n　　香雪飘零，暖风著柳笼丝雨。恼人情绪。春事还如许。\n\n　　宝勒朱轮，共结寻芳侣。东郊路。乱红深处。醉拍黄金缕。\n\n　　点绛唇\n\n　　背壁灯残，卧听檐雨难成寐。井梧飘坠。历历蛩声细。\n\n　　数尽更筹，滴尽罗巾泪。如何睡。甫能得睡。梦到相思地。\n\n　　点绛唇\n\n　　月缺花残，世间乐事难双美。夜来相对。把酒弹清泪。\n\n　　一点情钟，销尽英雄气。樊笼外。五湖烟水。好作扁舟计。　　点绛唇\n\n　　玉笋持杯，敛红颦翠歌金缕。彩鸳戢羽。未免群鸡妒。\n\n　　我为情多，愁听多情语。君休诉。两心坚固。云里千条路。\n\n　　点绛唇\n\n　　人面桃花，去年今日津亭见。瑶琴锦荐。一弄清商怨。\n\n　　今日重来，不见如如花面。空肠断。乱红千片。流水天涯远。\n\n　　点绛唇（丙寅）\n\n　　梅雨初晴，画栏开遍忘忧草。兰堂清窈。高柳新蝉噪。\n\n　　枕上芙蓉，如梦还惊觉。匀妆了。背人微笑。风入玲珑罩。\n\n　　点绛唇　　帐外华灯，翠屏花影参差满。锦衣香暖。苦恨春宵短。\n\n　　画角声中，云雨还轻散。河桥畔。月华如练。回首成肠断。　　点绛唇\n\n　　绿萼冰花，数枝清影横疏牖。玉肌清瘦。夜久轻寒透。\n\n　　忍使孤芳，攀折他人手。人归后。断肠回首。只有香盈袖。\n\n　　点绛唇（送常守陈正同应之还朝）\n\n　　解绂朝天，满城桃李繁阴布。彩舟难驻。忍听骊歌举。\n\n　　协赞中兴，圣意方倾注。从今去。五云深处。稳步沙堤路。　　点绛唇\n\n　　云雨匆匆，洞房当日曾相遇。暂来还去。无计留春住。　　宝瑟重调，静听鸾弦语。休轻负。绮窗朱户。好做风光主。　　昭君怨\n\n　　一曲云和松响。多少离愁心上。寂寞掩屏帷。泪沾衣。　　最是销魂处。夜夜绮窗风雨。风雨伴愁眠。夜如年。\n\n　　醉落魄\n\n　　波纹如縠。池塘雨后添新绿。海棠初绽红生肉。双燕归来，还认旧巢宿。\n\n　　凝情凭暖阑干曲。新愁无限伤心目。谁人月下吹横玉。惊起鸳鸯，飞去自相逐。\n\n　　醉落魄　　霜华摇落。亭亭皓月侵朱箔。梦回欹枕听残角。一片寒声，风送入寥廓。\n\n　　眼前风月都如昨。独眠无奈情怀恶。凭肩携手于飞约。料想人人，终是赋情薄。\n\n　　醉落魄\n\n　　明眸秀色。双蛾巧画春山碧。盈盈标韵倾瑶席。一见尊前，宛是旧相识。\n\n　　深期密语虽端的。良宵无奈成轻掷。忍教只恁空相忆。得入手来，无限好则剧。\n\n　　醉落魄\n\n　　阳关声咽。清歌响断云屏隔。溪山依旧连空碧。昨日主人，今日是行客。\n\n　　绿窗朱户应如昔。回头往事成陈迹。后期总便无端的。月下风前，应也解相忆。\n\n　　极相思\n\n　　碧檐鸣玉玎珰。金锁小兰房。楼高夜永，飞霜满院，璧月沈缸。\n\n　　云雨不成巫峡梦，望仙乡、烟水茫茫。风前月底，登高念远，无限凄凉。\n\n　　极相思\n\n　　相思情味堪伤。谁与话衷肠。明朝见也，桃花人面，碧藓回廊。\n\n　　别后相逢唯有梦，梦回时、展转思量。不如早睡，今宵魂梦，先到伊行。\n\n　　玉楼春\n\n　　碧桃溪上蓝桥路。寂寞朱门闲院宇。粉墙疏竹弄清蟾，玉砌红蕉宜夜雨。\n\n　　个中人是吹箫侣。花底深盟曾共语。人生乐在两知心，此意此生君记取。\n\n　　玉楼春　　星河风露经年别。月照离亭花似雪。宝钗鸾镜会重逢，花里同眠今夜月。\n\n　　月华依旧当时节。细把离肠和泪说。人生只合镇长圆，休似月圆圆又缺。\n\n　　长相思\n\n　　我心坚。你心坚。各自心坚石也穿。谁言相见难。\n\n　　小窗前。月婵娟。玉困花柔并枕眠。今宵人月圆。\n\n　　长相思\n\n　　锦衾香。玉枕双。昨夜深深小洞房。回头已断肠。\n\n　　背兰缸。梦仙乡。风撼梧桐雨洒窗。今宵好夜长。\n\n　　长相思\n\n　　村姑儿。红袖衣。初发黄梅插稻时。双双女伴随。　　长歌诗。短歌诗。歌里真情恨别离。休言伊不知。\n\n　　西地锦\n\n　　寂寞悲秋怀抱。掩重门悄悄。清风皓月，朱阑画阁，双鸳池沼。\n\n　　不忍今宵重到。惹离愁多少。蓬山路杳，蓝桥信阻，黄花空老。\n\n　　归田乐\n\n　　风生萍末莲香细。新浴晚凉天气。犹自倚朱阑，波面双双彩鸳戏。\n\n　　鸾钗委坠云堆髻。谁会此时情意。冰簟玉琴横，还是月明人千里。　　七娘子\n\n　　天涯触目伤离绪。登临况值秋光暮。手捻黄花，凭谁分付。雍雍雁落蒹葭浦。　　凭高目断桃溪路。屏山楼外青无数。绿水红桥，锁窗朱户。如今总是销魂处。\n\n　　感皇恩\n\n　　酒晕衬横波，玉肌香透。轻袅腰肢妒垂柳。臂宽金钏，且是不干春瘦。捻金双合字，无心绣。\n\n　　ef2f云半堕，金钗欲溜。罗袂残香忍重嗅。渡江桃叶，肠断为谁招手。倚阑凝望久，眉空斗。\n\n　　膏雨晓来晴，海棠红透。碧草池塘袅金柳。\n\n　　感皇恩\n\n　　王孙何在，不念玉容消瘦。日长深院静，帘垂绣。\n\n　　璨枕堕钗，粉痕轻溜。玉鼎龙涎记同嗅。钿筝重理，心事谩凭纤手。素弦弹不尽，眉峰斗。\n\n　　减字木兰花\n\n　　初用乐\\\\\n\n　　彤庭龙尾。礼备天颜知有喜。九奏初传。耳冷人间十七年。\n\n　　盈成持守。仁德如春渐九有。三辅名州。好整笙歌结胜游。\n\n　　减字木兰花\n\n　　船回沙尾。几误红窗听鹊喜。尺素空传。转首相逢又隔年。\n\n　　寒灯独守。玉笋持杯宁复有。秀水南州。徒使幽人作梦游。　　减字木兰花\n\n　　多情多病。玉貌疲来愁览镜。门掩东风。零落桃花满地红。　　重帘不卷。愁睹杏梁双语燕。强拂瑶琴。一曲幽兰泪满襟。\n\n　　减字木兰花（庚申七夕）　　金风玉露。喜鹊桥成牛女渡。天宇沈沈。一夕佳期两意深。\n\n　　琼签报曙。忍使飚轮容易去。明日如今。想见君心似我心。\n\n　　减字木兰花\n\n　　锦屏人醉。玉暖香融春有味。今日兰舟。魂梦还随绿水流。\n\n　　高城望断。无奈城中人不见。斜倚妆楼。恨入眉峰两点愁。\n\n　　渔家傲\n\n　　烟锁池塘秋欲暮。细细前香，直到双栖处。并枕东窗听夜雨。偎金缕。云深不见来时路。\n\n　　晓色朦胧人去住。香覆重帘，密密闻私语。目断征帆归别浦。空凝伫。苔痕绿印金莲步。　　四楼子\n\n　　楼前流水悠悠。驻行舟。满目寒云衰草、使人愁。\n\n　　多少恨，多少泪，谩迟留。何似蓦然拚舍、去来休。　　四楼子\n\n　　红靴玉带葳蕤。翠绡衣。并辔垂鞭妆影、照清溪。\n\n　　长亭路。停骑处。晚凉时。空有许多明月、伴双栖。　　御街行\n\n　　东君不锁寻芳路。曾是莺花主。有情风月可怜宵，犹记绿窗朱户。十年空想，春风面杳，无计凭鳞羽。\n\n　　凄凉怀抱今如许。天与重相遇。不应还向楚峰前，朝暮为云为雨。算来各把，平生分付，也不是、恶著处。\n\n　　上阳春（柳）\n\n　　好在章台杨柳。不禁春瘦。淡烟微雨面尘丝，锁一点、眉头皱。　　忆自灞陵别后。青青依旧。万丝千缕太多情，忍攀折、行人手。　　临江仙\n\n　　繁杏枝头蜂蝶乱，香风阖坐微闻。靓妆浓艳任东君。无情风雨，春事已平分。\n\n　　珍重主人留客意，夜阑秉烛开尊。何须歌韵遏行云。羽觞交劝，挥尘细论文。\n\n　　临江仙\n\n　　昨夜中秋今夕望，十分桂影团圆。玉人相对绿尊前。素娥有恨，应是妒婵娟。\n\n　　人静小庭风露冷，歌声特地清圆。醉红醺脸髻鬟偏。翠裙轻皱，端的为留仙。\n\n　　临江仙\n\n　　帘幕深深清昼永，玉人不耐春寒。镂牙棋子缕金圆。象盘雅戏，相对小窗前。\n\n　　隔打直行尖曲路，教人费尽机关。局中胜负定谁偏。饶伊使幸，毕竟我赢先。　　临江仙\n\n　　仙品不同桃李艳，移来月窟云乡。幽姿绰约道家妆。绿云堆髻，娇额半涂黄。　　可但乍凉风月下，饶伊独占秋光。雨中别有恼人香。错教萧史，肠断忆巫阳。\n\n　　临江仙\n\n　　琪树鸾栖花露重，依稀兰洞风光。玉人相对自生凉。翠鬟琼珮，绰约蕊珠妆。　　宝瑟声沈清梦觉，夜阑明月幽窗。可堪襟袂惹余香。断云残雨，何处认高唐。\n\n　　临江仙（中秋和沈文伯）\n\n　　记得南楼三五夜，曾听凤管昭华。尊前此际重兴嗟。素娥端有恨，烟霭等闲遮。　　珍重主人留客意，厌厌缓引流霞。夜闲银汉淡天涯。亭亭丹桂现，耿耿玉绳斜。　　临江仙（藏春石）\n\n　　青润奇峰名韫玉，温其质并琼瑶。中分瀑布泻云涛。双峦呈翠色，气象两相高。　　珍重幽人诚好事，绿窗聊助风骚。寄言俗客莫相嘲。物轻人意重，千里赠鹅毛。\n\n　　鹧鸪天（客有作北里选胜图，冠以曲子名，东风第一枝，裒然居首因作此词）　　脉脉柔情不自持。浅颦轻笑百般宜。尊前唱歇黄金缕，一点春愁入翠眉。\n\n　　流蕙盼，捧瑶卮。借君歌扇写新诗。浮花谩说惊郎目，不似东风第一枝。　　惜奴娇\n\n　　隔阔多时，算彼此、难存济。咫尺地、千山万水。眼眼相看，要说话、都无计。只是。唱曲儿、词中认意。\n\n　　雪意垂垂，更刮地、寒风起。怎禁这几夜意。未散痴心，便指望、长偎倚。只替。那火桶儿、与奴暖被。\n\n　　行香子　　珠露初零。天宇澄明。正闲阶、皎月亭亭。更阑人静，烟敛风清。更井边桐，一叶叶，做秋声。\n\n　　斗帐鸾屏。翠被华c660。梦回时、酒力初醒。绿云堆枕，红玉生春。且打叠起，龙牙簟，竹夫人。\n\n　　一剪梅　　堆枕乌云堕翠翘。午梦惊回，满眼春娇。嬛嬛一袅楚宫腰。那更春来，玉减香消。\n\n　　柳下朱门傍小桥。几度红窗，误认鸣镳。断肠风月可怜宵。忍使恹恹，两处无聊。\n\n　　一剪梅\n\n　　高宴华堂夜向阑。急管飞霜，羯鼓声乾。仙人掌上水晶盘。回按凌波，舞袖弓弯。\n\n　　曲罢凝娇整翠鬟。玉笋持杯，巧笑嫣然。为君一醉倒金船。只恐醒来，人隔云山。　　一剪梅（甲辰除夜）　　夜永虚堂烛影寒。斗转春来，又是明年。异乡怀抱只凄然。尊酒相逢且自宽。\n\n　　天际孤云云外山。梦绕觚棱，日下长安。功名已觉负初心，羞对菱花，绿鬓成斑。\n\n　　六么令\n\n　　梅英飘雪，弱柳弄新绿。冷冷画桥流水，风静波如e061。长记扁舟共载，偶近旗亭宿。渺云横玉。鸳鸯枕上，听彻新翻数般曲。\n\n　　此际魂清梦冷，绣被香芬馥。因念多感情怀，触处伤心目。自是今宵独寐，怎不添愁蹙。如今心足。风前月下，赖有斯人慰幽独。\n\n　　镇西\n\n　　秋风吹暗雨，重衾寒透。伤心听、晓钟残漏。凝情久。记红窗夜雪，促膝围炉，交杯劝酒。如今顿孤欢偶。\n\n　　念别后。菱花清镜里。眉峰暗斗。想标容、怎禁销瘦。忍回首。但云笺妙墨，鸳锦啼妆，依然似旧。临风泪沾襟袖。\n\n　　看花回（和赵智夫韵）\n\n　　夜久凉生，庭院漏声频促。念昔胜游旧地，对画阁层峦，雨余烟簇。新诗暗藏小字，霜刀刊翠竹。携素手、细绕回塘，芰荷香里彩鸳宿。\n\n　　别后想、香锁腻玉。带围减、钟宽金粟。虽有鳞鸿锦素，奈事与心违，佳期难卜。拟解愁肠万结，唯凭尊酒绿。望天涯断魂处，醉拍阑干曲。\n\n　　诉衷情　　亭亭秋水玉芙蓉。天际水浮空。碧云望中空暮，人在广寒宫。\n\n　　双缕枕，曲屏风。小房栊。可怜今夜，明月清风，无计君同。\n\n　　浪淘沙\n\n　　楼下水潺湲。楼外屏山。淡烟笼月晚凉天。曾共玉人携素手，同倚阑干。\n\n　　云散梦难圆。幽恨绵绵。旧游重到忍重看。负你一生多少泪，月下花前。\n\n　　如梦令\n\n　　人静重门深亚。朱阁画帘高挂。人与月俱圆，月色波光相射。潇洒。潇洒。人月长长今夜。\n\n　　如梦令　　今夜行云何处。还是月华当午。倚遍曲阑桥，望断锦屏归路。空去。空去。梦到绿窗朱户。\n\n　　愁倚阑\n\n　　伤春晚，送春归。步云溪。绿叶同心双小字，记曾题。\n\n　　楼外红日平西。长亭路、烟草萋萋。云雨不成新梦后，倚阑时。\n\n　　愁倚阑\n\n　　天如水，月如钩。正新秋。月影参差人窈窕，小红楼。\n\n　　如今往事悠悠。楼前水、肠断东流。旧物忍看金约腕，玉搔头。\n\n　　愁倚阑　　一番雨，一番凉。夜初长。满院蛩吟人不寝，月侵廊。\n\n　　木犀微绽幽芳。西风透、窈窕红窗。恰似个人鸳被里，玉肌香。　　望江南（感事）　　落花尽，寂寞委残红。蝶帐梦回空晓月，凤楼人去谩东风。春事已成空。\n\n　　闲伫立，□□水溶溶。云锁乱山横惨淡，烟笼绿树晚溟濛。却在泪痕中。\n\n　　春光好\n\n　　鸾屏掩，翠衾香。小兰房。回首当时云雨梦，两难忘。　　如今水远山长。凭鳞翼、难叙衷肠。况是教人无可恨，一味思量。\n\n　　风流子\n\n　　韶华惊晼晚，青春老、倦客惜年芳。庭樾荫浓，半藏莺语，畹兰花减，时有蜂忙。粉墙低，嫩岚滋翠葆，零露湿残妆。风暖昼长，柳绵吹尽，淡烟微雨，梅子初黄。\n\n　　洛浦音容远，书空漫惆怅，往事悲凉。无奈锦鳞杳杳，不渡横塘。念蝴蝶梦回，子规声里，半窗斜月，一枕余香。拟待自宽，除非铁做心肠。　　朝中措\n\n　　章台杨柳月依依。飞絮送春归。院宇日长人静，园林绿暗红稀。\n\n　　庭前花谢了，行云散后，物是人非。唯有一襟清泪，凭阑洒遍残枝。\n\n　　朝中措\n\n　　雨余清镜湛秋容。屏展九华峰。万里闲云散尽，半规凉月当空。\n\n　　楼高夜永，凭阑笑语，此际谁同。端有妙人携手，翛然归路凌风。\n\n　　侍香金童\n\n　　宝马行春，缓辔随油壁。念一瞬、韶光堪重惜。还是去年同醉日。客里情怀，倍添凄恻。\n\n　　记南城、锦迳名园曾遍历。更柳下、人家似织。此际凭阑愁脉脉。满目江山，暮云空碧。　　江城子（秋夜观牛女星作）\n\n　　碧厨文簟小窗前。乍更阑。□□□。乌鹊南飞，秋意渐凄然。满院蛩吟风露下，人窕窈，月婵娟。\n\n　　双星旧约又经年。信谁传。恨绵绵。□隔明河，长作断肠仙。争似秦楼萧史伴，瑶台路，共乘鸾。\n\n　　西江月\n\n　　翡翠蒙金衫子，镂尘如意冠儿。持杯轻按遏云词。别是出尘风味。　　莫羡双星旧约，愿谐明月佳期。凭肩密语两心知。一棹五湖烟水。　　苍梧谣\n\n　　天。休使圆蟾照客眠。人何在，桂影自婵娟。\n\n　　采桑子（孙仲益集于西斋，题侍儿作第一流，因以词谢之）　　奇花不比寻常艳，独步南州。往事悠悠。辽鹤重来忆梦游。\n\n　　仙翁不改青青眼，一醉迟留。妙墨银钩。题作人间第一流。　　洞仙歌\n\n　　莺莺燕燕。本是于飞伴。风月佳时阻幽愿。但人心坚固后，天也怜人，相逢处、依旧桃花人面。　　绿窗携手，帘幕重重，烛影摇红夜将半。对尊前如梦，欲语魂惊，语未竟、已觉衣襟泪满。我只为、相思特特来，这度更休推，后回相见。　　瑞鹤仙\n\n　　玉猊香谩爇。叹瓶沈簪断，紫箫声绝。丹青挂寒壁。细端详，宛是旧时标格。音容望极。奈弱水、蓬山路隔。似瑶林琼树，韶华正好，一枝先折。\n\n　　凄切。相思情味，镜中绿鬓，看成华发。临风对月。空罗袂，揾清血。待随群逐队，开眉一笑，除你心肠是铁。看今生，为伊烦恼，甚时是彻。"
		},
		{
			"post_id": 25,
			"title": "【寄怀】步非烟",
			"date_published": 1611990233.582,
			"body": "【寄怀】步非烟\n画檐春燕须同宿，兰浦双鸳肯独飞。\n长恨桃源诸女伴，等闲花里送郎归。"
		},
		{
			"post_id": 24,
			"title": "【听妓洞云歌】布燮",
			"date_published": 1611990205.84,
			"body": "【听妓洞云歌】布燮\n嵇叔夜，鼓琴饮酒无闲暇。若使当时闻此歌，\n抛掷广陵都不藉。刘伯伦，虚生浪死过青春。\n一饮一硕犹自醉，无人为尔卜深尘。"
		},
		{
			"post_id": 23,
			"title": "【歌】病狂人",
			"date_published": 1611990169.735,
			"body": "【歌】病狂人\n踏阳春，人间三月雨和尘。阳春踏，秋风起，\n肠断人间白发人。\n\n五灵华，晓玲珑，天府由来汝府中。惆怅此情言不尽，\n一丸萝卜火吾宫。"
		},
		{
			"post_id": 22,
			"title": "毕耀的诗词",
			"date_published": 1611990130.814,
			"body": "【古意】毕耀\n璇闺绣户斜光入，千金女儿倚门立。横波美目虽往来，\n罗袂遥遥不相及。闻道今年初避人，珊珊挂镜长随身。\n愿得侍儿为道意，后堂罗帐一相亲。\n\n【赠独孤常州（见《纪事》）】毕耀\n洪炉无久停，日月速若飞。忽然冲人身，饮酒不须疑。"
		},
		{
			"post_id": 21,
			"title": "【横吹曲辞 关山月】鲍氏君徽",
			"date_published": 1611990096.145,
			"body": "【横吹曲辞 关山月】鲍氏君徽\n高高秋月明，北照辽阳城。塞迥光初满，风多晕更生。\n征人望乡思，战马闻鞞惊。朔风悲边草，胡沙昏虏营。\n霜疑匣中剑，风惫原上旌。早晚谒金阙，不闻刁斗声。"
		},
		{
			"post_id": 20,
			"title": "鲍溶的诗词",
			"date_published": 1611990053.431,
			"body": "【相和歌辞 苦哉远征人】鲍溶\n征人歌古曲，携手上河梁。李陵死别处，杳杳玄冥乡。\n忆昔从此路，连年征鬼方。久行迷汉历，三洗毡衣裳。\n百战身且在，微功信难忘。远承云台议，非势孰敢当。\n落日吊李广，白身过河阳。闲弓失月影，劳剑无龙光。\n去日始束发，今来发成霜。虚名乃闲事，生见父母乡。\n掩抑大风歌，裴回少年场。诚哉古人言，鸟尽良弓藏。\n\n【相和歌辞 采莲曲二首】鲍溶\n弄舟朅来南塘水，荷叶映身摘莲子。暑衣清净鸳鸯喜，\n作浪舞花惊不起。殷勤护惜纤纤指，水菱初熟多新刺。\n\n采莲朅来水无风，莲潭如镜松如龙。夏衫短袖交斜红，\n艳歌笑斗新芙蓉，戏鱼住听莲花东。\n\n【杂曲歌辞 壮士行】鲍溶\n西方太白高，壮士羞病死。心知报恩处，对酒歌易水。\n砂鸿嗥天末，横剑别妻子。苏武执节归，班超束书起。\n山河不足重，重在遇知己。\n\n【杂曲歌辞 鸣雁行】鲍溶\n七月朔方雁心苦，联影翻空落南土。八月江南阴复晴，\n浮云绕天难夜行。羽翼劳痛心虚惊，一声相呼百处鸣。\n楚童夜宿烟波侧，沙上布罗连草色。月暗风悲欲下天，\n不知何处容栖息。楚童胡为伤我神，尔不曾作远行人。\n江南羽族本不少，宁得网罗此客鸟。\n\n【杂歌谣辞 李夫人歌】鲍溶\n璿闺羽帐华烛陈，方士夜降夫人神。葳蕤半露芙蓉色，\n窈窕将期环珮身。丽如三五月，可望难亲近。\n颦黛含犀竟不言，春思秋怨谁能问。欲求巧笑如生时，\n歌尘在空瑟衔丝。神来未及梦相见，帝比初亡心更悲。\n爱之欲其生又死，东流万代无回水。宫漏丁丁夜向晨，\n烟销雾散愁方士。\n\n【古意】鲍溶\n女萝寄青松，绿蔓花绵绵。三五定君婚，结发早移天。\n肃肃羔雁礼，泠泠琴瑟篇。恭承采蘩祀，敢效同车贤。\n皎日不留景，良辰如逝川。愁心忽移爱，花貌无归妍。\n翠袖皓珠粉，碧阶封绿钱。新人易如玉，废瑟难为弦。\n寄谢蕣华木，荣君香阁前。岂无摇落苦，贵与根蒂连。\n希君旧光景，照妾薄暮年。\n\n【会仙歌】鲍溶\n轻轻濛濛，龙言凤语何从容，耳有响兮目无踪。杳杳默默，\n花张锦织，王母初自昆仑来，茅盈王方平在侧。\n青毛仙鸟衔锦符，谨上阿环起居王母书。始知仙事亦多故，\n一隔绛河千岁馀。详玉字，多喜气，瑶台明月来堕地。\n冠剑低昂蹈舞频，礼容尽若君臣事。愿言小仙艺，\n姓名许飞琼，洞阴玉磬敲天声。乐王母，一送玉杯长命酒。\n碧花醉，灵扬扬，笑赐二子长生方。二子未及伸拜谢，\n苍苍上兮皇皇下。\n\n【水殿采菱歌】鲍溶\n宫鸦叫赤光，潮声入宫宫影凉。火华啼露卷横塘，\n金堤四合宛柔扬。美人荷裙芙蓉妆，柔荑萦雾棹龙航。\n采莲一声歌态长，青丝结眼捕鸳鸯。\n\n【霓裳羽衣歌】鲍溶\n玉烟生窗午轻凝，晨华左耀鲜相凌。人言天孙机上亲手迹，\n有时怨别无所惜。遂令武帝厌云韶，金针天丝缀飘飘。\n五声写出心中见，拊石喧金柏梁殿。此衣春日赐何人，\n秦女腰肢轻若燕。香风间旋众彩随，联联珍珠贯长丝。\n眼前意是三清客，星宿离离绕身白。鸾凤有声不见身，\n出宫入徵随伶人。神仙如月只可望，瑶华池头几惆怅。\n乔山一闭曲未终，鼎湖秋惊白头浪。\n\n【游山】鲍溶\n白道行深云，云高路弥细。时时天上客，遗路人间世。\n烟花最深处，井臼得空刺。天寒鹤巢林，石长泉脉闭。\n神化万灵集，心期一朝契。不见金板书，谁知阮家裔。\n终期太古人，问取松柏岁。\n\n【怀仙二首】鲍溶\n昆仑九层台，台上宫城峻。西母持地图，东来献虞舜。\n虞宫礼成后，回驾仙风顺。十二楼上人，笙歌沸天引。\n裴回扶桑路，白日生离恨。青鸟更不来，麻姑断书信。\n乃知东海水，清浅谁能问。\n\n阆峰绮阁几千丈，瑶水西流十二城。\n曾见周灵王太子，碧桃花下自吹笙。\n\n【怀尹真人】鲍溶\n万里叠嶂翠，一心浮云闲。羽人杏花发，倚树红琼颜。\n流水杳冥外，女萝阴荫间。却思人间世，多恐不可还。\n青鸟飞难远，春云晴不闲。但恐五灵车，山上复有山。\n\n【感怀】鲍溶\n宿心不觉远，事去劳追忆。旷古川上怀，东流几时息。\n门前青山路，眼见归不得。晓梦云月光，过秋兰蕙色。\n\n【将归旧山留别孟郊】鲍溶\n择木无利刃，羡鱼无巧纶。如何不量力，自取中路贫。\n前者不厌耕，一日不离亲。今来千里外，我心不在身。\n悠悠慈母心，惟愿才如人。蚕桑能几许，衣服常著新。\n一饭吐尺丝，谁见此殷勤。别君归耕去，持火烧车轮。\n\n【长城】鲍溶\n蒙公虏生人，北筑秦氏冤。祸兴萧墙内，万里防祸根。\n城成六国亡，宫阙启千门。生人半为土，何用空中原。\n奈何家天下，骨肉尚无恩。投沙拥海水，安得久不翻。\n乘高惨人魂，寒日易黄昏。枯骨贯朽铁，砂中如有言。\n万古骊山下，徒悲野火燔。\n\n【寄福州从事殷尧藩】鲍溶\n越岭寒轻物象殊，海城台阁似蓬壶。几回入市鲛绡女，\n终岁啼花山鹧鸪。雷令剑龙知去未，虎夷云鹤亦来无。\n就中静事冥宵话，何惜双轮访病夫。\n\n【章华宫行】鲍溶\n烟渚南鸿呼晓群，章华宫娥怨行云。十二巫峰仰天绿，\n金车何处邀云宿。小腰婑堕三千人，宫衣水碧颜青春。\n岂无一人似神女，忍使黛蛾常不伸。黛蛾不伸犹自可，\n春朝诸处门常锁。\n\n【辞辇行】鲍溶\n汉家代久淳风薄，帝重微行极荒乐。青娥三千奉一人，\n班女不以色事君。朝停玉辇诏同载，三十六宫皆眄睐。\n不惊六马缓天仪，从容鸣环前致辞。君恩如海深难竭，\n妾命如丝轻易绝。愿陪阿母同小星，敢使太阳齐万物。\n周末幽王不可宗，妾闻上圣遗休风。五更三老侍白日，\n八十一女居深宫。愿将辇内有馀席，回赐忠臣妾恩泽。\n一时节义动贤君，千年名姓香氛氲，渐台水死何伤闻。\n\n【姑苏宫行】鲍溶\n姑苏宫，九层金台半虚空。雕楹璇题斗皎洁，\n中有妖姬似明月。西见洞庭秋镜开，水华百里盘宫来。\n越王采女能水戏，仙舟如龙旌曳翠。羽盖晴翻橘柚香，\n玉笙夜送芙蓉醉。归帆平静君无劳，还从下下上高高。\n\n【元日早朝行（一作鲍防诗）】鲍溶\n乾元发生春为宗，盛德在天斗建东。东方岁星大明宫，\n南山喜气摇晴空。望云五等舞万玉，献寿一声出千峰。\n文章垂彩礼乐正，太白下直旌旗红。旌旗不断春风前，\n直如朱绳非尔妍。\n\n【秋夜对月怀李正封】鲍溶\n援琴怅独立，高月对秋堂。美人远于月，徒望空景光。\n坐忆执手时，七弦起凄凉。平生知音少，君子安可忘。\n客意如梦寐，路岐遍四方。日远迷所之，满天心暗伤。\n主奉二鲤鱼，中含五文章。惜无千金答，愁思盈中肠。\n此夕临风叹，零露沾衣裳。\n\n【与峨眉山道士期尽日不至】鲍溶\n倾景安再中，人生有何常。胡为少君别，风驭峨眉阳。\n结我千日期，青山故人堂。期尽师不至，望云空烧香。\n顾惭有限身，易老白日光。怀君屡惊叹，支体安能强。\n往闻清修箓，未究服食方。瑶田有灵芝，眼见不得尝。\n玉壶贮天地，岁月亦已长。若用壶中景，东溟又堪伤。\n寄言赤玉箫，夜夜吹清商。\n\n【山中怀刘修】鲍溶\n松老秋意孤，夜凉吟风水。山人在远道，相忆中夜起。\n春光如不至，幽兰含香死。响象离鹤情，念来一相似。\n月斜掩扉卧，又在梦魂里。\n\n【送僧南游】鲍溶\n且攀隋宫柳，莫忆江南春。师有怀乡志，未为无事人。\n\n【子规】鲍溶\n中林子规啼，云是古蜀帝。蜀帝胡为鸟，惊急如罪戾。\n一啼艳阳节，春色亦可替。再啼孟夏林，密叶堪委翳。\n三啼凉秋晓，百卉无生意。四啼玄冥冬，云物惨不霁。\n芸黄壮士发，沾洒妖姬袂。悲深寒乌雏，哀掩病鹤翅。\n胡为托幽命，庇质无完毳。戚戚含至冤，卑卑忌群势。\n吾闻凤凰长，羽族皆受制。盍分翡翠毛，使学鹦鹉慧。\n敌怨不在弦，一哀尚能继。那令不知休，泣血经世世。\n古风失中和，衰代因郑卫。三叹尚淫哀，向渴嘻流涕。\n如因异声感，乐与中肠契。至教一昏芜，生人遂危脆。\n古意叹通近，如上青天际。荼蓼久已甘，空劳堇葵惠。\n谁闻子规苦，思与正声计。\n\n【忆旧游】鲍溶\n忆求无何乡，了在赤谷村。仙人居其中，将往问所存。\n日入濛汜宿，石烟抱山门。明月久不下，半峰照啼猿。\n堂上白鹤翁，神清心无烦。斋心侍席前，跪请长生恩。\n云昔崆峒老，何词受轩辕。从星使变化，任日张乾坤。\n若到旧乡里，宛如曾讨论。风移岩花气，珠贯金经言。\n凉夜惜易尽，青烟谢晨喧。自唯腥膻体，难久留其藩。\n几世身在梦，百年云无根。悠悠竟何事，愚智相忧冤。\n叹息几晚寤，蒙师招其魂。至今瑶华心，每想清水源。\n\n【经隐叟】鲍溶\n行蹋门外泉，坐披床上云。谁将许由事，万古留与君。\n虚洞闭金锁，蠹简藏鸟文。萝景深的的，蕙风闲薰薰。\n余有世上心，此来未及群。殷勤讳名姓，莫遣樵客闻。\n\n【苦哉远征人】鲍溶\n征人歌古曲，携手上河梁。李陵死别处，窅杳玄冥乡。\n忆昔从此路，连年征鬼方。久行迷汉历，三死毡衣裳。\n百战身且在，微功信难忘。远承云台议，非势孰敢当。\n落日吊李广，白首过河阳。闲弓失月影，劳剑无龙光。\n去日始束发，今来发成霜。虚名乃闲事，生见父母乡。\n掩抑大风歌，裴回少年场。诚哉古人言，鸟尽良弓藏。\n\n【首夏】鲍溶\n昨日青春去，晚峰尚含妍。虽留有馀态，脉脉防忧煎。\n幽人惜时节，对此感流年。\n\n【送僧东游】鲍溶\n风流东晋后，外学入僧家。独唱郢中雪，还游天际霞。\n云村共香饭，水月喻秋花。景物添新致，前程讵可涯。\n\n【东高峰（一作东峰亭）】鲍溶\n东亭最高峙，春树绕山腰。画里青鸾客，云中碧玉箫。\n秋风若西望，为我一长谣。\n\n【越女词】鲍溶\n越女芙蓉妆，浣纱清浅水。忽惊春心晓，不敢思君子。\n君子纵我思，宁来浣溪里。\n\n【山行经樵翁】鲍溶\n我心劳我身，远道谁与论。心如木中火，忧至常自燔。\n披访结恩地，世人轻报恩。女无良媒识，知入何人门。\n寒日行深山，路由谷中村。田翁樵采熟，男女讴吟喧。\n借问身命谋，上言愧乾坤。时清公赋薄，力勤地利繁。\n下念草木年，坐家见重孙。举案馈宾客，糟浆盈陶尊。\n醉闲鹿裘暖，白发舞轩轩。仰羡太古人，余将破行辕。\n遑遑问身事，师友难为言。离歌又行去，落日低寒泉。\n\n【旧镜】鲍溶\n婵娟本家镜，与妾归君子。每忆并照时，相逢明月里。\n春风忽分影，白日难依倚。珠粉不结花，玉珰宁辉耳。\n心期不可见，不保长如此。华发一欺人，青铜化为鬼。\n良人有归日，肯学妖桃李。瑶匣若浮云，冥冥藏玉水。\n侍儿不遣照，恐学孤鸾死。\n\n【感兴】鲍溶\n幽人无近迹，别易会则稀。黄鹤亦姓丁，寥寥何处飞。\n时见海上山，绕云心依依。谅无驭风术，中路愁虚归。\n童发慕道心，壮年堕尘机。白日不饶我，如今事皆非。\n群羊化石尽，双凫与我违。□岳黄金富，轩辕晓霞衣。\n谁令日在眼，容色烟云微。\n\n【客途逢乡人旋别】鲍溶\n惊鸿一断行，天远会无因。无因忽相会，感叹若有神。\n我乡路三千，百里一主人。一宿独何恋，何况旧乡邻。\n牢落岁华晏，相怜客中贫。迎霜君衣暖，与我同一身。\n谁在天日下，此生能不勤。青萍寄流水，安得长相亲。\n明发更远道，山河重苦辛。\n\n【洛阳春望】鲍溶\n五凤楼南望洛阳，龙门回合抱苍苍。受朝前殿云霞暖，\n封岳行宫草木香。四海为家知德盛，二京有宅卜年长。\n东人犹忆时巡礼，愿觐元和日月光。\n\n【巫山怀古】鲍溶\n十二峰峦斗翠微，石烟花雾犯容辉。青春楚女妒云老，\n白日神人入梦稀。银箭暗凋歌夜烛，珠泉频点舞时衣。\n谁伤宋玉千年后，留得青山辨是非。\n\n【温泉宫】鲍溶\n忆昔开元天地平，武皇十月幸华清。山蒸阴火云三素，\n日落温泉鸡一鸣。彩羽鸟仙歌不死，翠霓童妾舞长生。\n仍闻老叟垂黄发，犹说龙髯缥缈情。\n\n【赠远】鲍溶\n辛苦关西车骑官，几年旌节客河兰。金泥舞虎精神暗，\n银缕交龙气色寒。欲和古诗成窦锦，倍悲秋扇损齐纨。\n莫劳雁足传书信，愿向凌烟阁上看。\n\n【赠杨炼师】鲍溶\n柴烟衣上绣春云，清隐山书小篆文。\n明月在天将凤管，夜深吹向玉晨君。\n\n【答客】鲍溶\n竹间深路马惊嘶，独入蓬门半似迷。\n劳问圃人终岁事，桔槔声里雨春畦。\n\n【送僧文江】鲍溶\n吴王剑池上，禅子石房深。久慕白云性，忽劳青玉音。\n孤高知胜鹤，清雅似闻琴。此韵书珍重，烦师出定吟。\n\n【山中冬思二首】鲍溶\n山深先冬寒，败叶与林齐。门巷非世路，何人念穷栖。\n哀风破山起，夕雪误鸣鸡。巢鸟侵旦出，饥猿无声啼。\n晨兴动烟火，开云伐冰溪。老木寒更瘦，阴云晴亦低。\n我贫自求力，颜色常低迷。时思灵台下，游子正凄凄。\n\n雪壮冰亦坚，冻涧如平地。幽人毛褐暖，笑就糟床醉。\n唤人空谷应，开火寒猿至。拾薪煮秋栗，看鼎书古字。\n忽忆南涧游，衣巾多云气。露脚寻逸僧，谘量意中事。\n\n【冬夜答客】鲍溶\n冬日诚可爱，不如夜漏多。幸君霜露里，车马犯寒过。\n学耕不逢年，稂莠败黍禾。岂唯亲宾散，鸟鼠移巢窠。\n独见青松心，凌霜庇柔萝。壮日贱若此，留恩意如何。\n因忆古丈夫，一言重山河。临风弹楚剑，为子奏燕歌。\n\n【代楚老酬主人】鲍溶\n流水为我乡，扁舟为我宅。二毛去天远，几日人间客。\n曈曈衔山景，渺渺翔云迹。从时无定心，病处不暖席。\n烦君问岐路，为我生凄戚。百年衣食身，未死皆有役。\n曾伤无遗嗣，纵有复何益。终古北邙山，樵人卖松柏。\n\n【夏日华山别韩博士愈】鲍溶\n别地泰华阴，孤亭潼关口。夏日可畏时，望山易迟久。\n暂因车马倦，一逐云先后。碧霞气争寒，黄鸟语相诱。\n三峰多异态，迥举仙人手。天晴捧日轮，月夕弄星斗。\n幽疑白帝近，明见黄河走。远心不期来，真境非吾有。\n鸟鸣草木下，日息天地右。踯躅因风松，青冥谢仙叟。\n不知无声泪，中感一颜厚。青霄上何阶，别剑空朗扣。\n故乡此关外，身与名相守。迹比断根蓬，忧如长饮酒。\n生离抱多恨，方寸安可受。咫尺岐路分，苍烟蔽回首。\n\n【题吴征君岩居】鲍溶\n尧泽润天下，许由心不知。真风存绵绵，常与达者期。\n有道吾不仕，有生吾不欺。澹然灵府中，独见太古时。\n地脉发醴泉，岩根生灵芝。天文若通会，星影应离离。\n亭亭傅氏岩，何独万古思。\n\n【长安言怀】鲍溶\n殷殷生念厚，戚戚劳者多。二时昼夜等，百岁讵几何。\n日下文翰苑，侧身识经过。千虑恐一失，翔阳已蹉跎。\n临觞翦众忧，静寄丝桐歌。思归绕十指，五声不相和。\n暮天还巢翼，明日陨叶柯。高谢岩谷人，鹿衣带女萝。\n生不去亲爱，浮名若风波。谁令不及此，亲爱隔山河。\n\n【归雁】鲍溶\n南国春早暖，渚蒲正月生。东风吹雁心，上下和乐声。\n绕水半空去，拂云偕相迎。如防失群怨，预有侵夜惊。\n渺邈天外影，支离塞中莺。自顾摧颓羽，偏感南北情。\n乍甘烟雾劳，不顾龙沙荣。虽乐未归意，终不能自鸣。\n喜去春月满，归来秋风清。啼馀碧窗梦，望断阴山行。\n不及瑶wG燕，寄身金宫楹。\n\n【闻蝉】鲍溶\n高蝉旦夕唳，景物浮凉气。木叶渐惊年，锦字因络纬。\n稍断当窗梦，更凄临水意。清香笋蒂风，晓露莲花泪。\n馀引未全歇，凝悲寻迥至。星井欲望河，月扇看藏笥。\n谁念因声感，放歌写人事。\n\n【思琴高】鲍溶\n琴仙人，得仙去。万古钓龙空有处，我持曲钩思白鱼。\n仙溪绿尽含空虚，天钧踪迹无遗馀。烧香寄影在岩树，\n东礼海日鸡鸣初。\n\n【寒夜吟】鲍溶\n九衢金吾夜行行，上宫玉漏遥分明。霜飙乘阴扫地起，\n旅鸿迷雪绕枕声。远人归梦既不成，留家惜夜欢心发。\n罗幕画堂深皎洁，兰烟对酒客几人。兽火扬光二三月，\n细腰楚姬丝竹间。白纻长袖歌闲闲，岂识苦寒损朱颜。\n\n【玉山谣奉送王隐者】鲍溶\n凤凰城南玉山高，石脚耸立争雄豪。攒峰胎玉气色润，\n百泉透云流不尽。万古分明对眼开，五烟窈窕呈祥近。\n有客师事金身仙，用金买得山中田。闲开玉水灌芝草，\n静醉天酒松间眠。心期南溟万里外，出山几遇光阴改。\n水玉丁东不可闻，冰华皎洁应如待。秋风引吾歌去来，\n玉山彩翠遥相催。殷勤千树玉山顶，碧洞寥寥寒锦苔。\n\n【陇头水】鲍溶\n陇头水，千古不堪闻。生归苏属国，死别李将军。\n细响风凋草，清哀雁落云。\n\n【赠李黯将军】鲍溶\n细柳连营石堑牢，平安狼火赤星高。岩云入角雕龙爽，\n寒日摇旗画兽豪。搜伏雄儿欺魍魉，射声游骑怯分毫。\n圣人唯有河湟恨，寰海无虞在一劳。\n\n【古鉴】鲍溶\n古鉴含灵气象和，蛟龙盘鼻护金波。隐山道士未曾识，\n负局先生不敢磨。曾向春窗分绰约，误回秋水照蹉跎。\n世间纵有应难比，十斛明珠酬未多。\n\n【寄张十七校书李仁行秀才】鲍溶\n去年八月此佳辰，池上闲闲四五人。久行月影愁迷梦，\n误入华光笑认春。一与清风上芸阁，再期秋雨过龙津。\n今年此日何由见，蓬户萧条对病身。\n\n【旧镜】鲍溶\n团团铜镜似潭水，心爱玉颜私自亲。\n一经离别少年改，难与清光相见新。\n\n【期尽】鲍溶\n鱼锁生衣门不开，玉筐金月共尘埃。\n青山石妇千年望，雷雨曾知来不来。\n\n【秋暮送裴垍员外刺婺州】鲍溶\n婺女星边气不秋，金华山水似瀛州。\n含香太守心清净，去与神仙日日游。\n\n【杨真人箓中像】鲍溶\n画中留得清虚质，人世难逢白鹤身。\n应见茅盈哀老弟，为持金箓救生人。\n\n【怀王直秀才】鲍溶\n乡无竹圃为三径，贫寄邻家已二年。\n惟有素风身未坠，世间开口不言钱。\n\n【赠僧戒休】鲍溶\n风行露宿不知贫，明月为心又是身。\n欲问月中无我法，无人无我问何人。\n\n【酬江公见寄】鲍溶\n曾答雁门偈，为怜同社人。多惭惠休句，偕得此阳春。\n\n【宿水亭】鲍溶\n雕楹彩槛压通波，鱼鳞碧幕衔曲玉。\n夜深星月伴芙蓉，如在广寒宫里宿。\n\n【寄海陵韩长官】鲍溶\n吏散重门印不开，玉琴招鹤舞裴回。\n野人为此多东望，云雨仍从海上来。\n\n【题禅定寺集公竹院】鲍溶\n公门得休静，禅寺少逢迎。任客看花醉，随僧入竹行。\n归时常犯夜，云里有经声。\n\n【经旧游】鲍溶\n游鱼怀故池，倦鸟怀故窠。故山系归念，行坐青巍峨。\n羸马经旧途，此乡喜重过。居人无故老，倍感别日多。\n但见野中坟，累累如青螺。凉风日摇落，桑下松婆娑。\n叹息追古人，临风伤逝波。古人无不死，叹息欲如何。\n朅来遂远心，默默存天和。\n\n【山居】鲍溶\n窈窕垂涧萝，蒙茸黄葛花。鸳鸯怜碧水，照影舞金沙。\n\n【望麻姑山】鲍溶\n幽人往往怀麻姑，浮世悠悠仙景殊。\n自从青鸟不堪使，更得蓬莱消息无。\n\n【襄阳怀古】鲍溶\n襄阳太守沈碑意，身后身前几年事。\n湘江千岁未为陵，水底鱼龙应识字。\n\n【望江中金山寺】鲍溶\n一朵蓬莱在世间，梵王宫阙翠云间。\n近南溪水更清浅，闻道游人未忍还。\n\n【得僧书】鲍溶\n身归紫霄岭，书下白云来。翦笋发寒字，烧花芳夜雷。\n想随香驭至，不假定钟催。\n\n【和王璠侍御酬友人赠白角冠】鲍溶\n芙蓉寒艳镂冰姿，天朗灯深拔豸时。\n好见吹笙伊洛上，紫烟丹凤亦相随。\n\n【暮春戏赠樊宗宪】鲍溶\n羌笛胡琴春调长，美人何处乐年芳。野船弄酒鸳鸯醉，\n官路攀花騕褭狂。应和朝云垂手语，肯嫌夜色断刀光。\n\n【夏日怀杜悰驸马】鲍溶\n五月清凉萧史家，瑶池分水种菱花。回文地簟龙鳞浪，\n交锁天窗蝉翼纱。闲遣青琴飞小雪，自看碧玉破甘瓜。\n仍闻圣主知书癖，凤阁烧香对五车。\n\n【上阳宫月】鲍溶\n水北宫城夜柝严，宫西新月影纤纤。受环花幌小开镜，\n移烛瑶房皆卷帘。学织机边娥影静，拜新衣上露华沾。\n合裁班扇思行幸，愿托凉风箧笥嫌。\n\n【读淮南李相行营至楚州诗】鲍溶\n阃外建牙威不宾，古来戡难忆忠臣。已分舟楫归元老，\n更使熊罴属丈人。玄象合教沧海晏，青龙喜应太山春。\n来年二月登封礼，去望台星扈日轮。\n\n【闻国家将行封禅聊抒臣情】鲍溶\n云雨由来随六龙，玉泥瑶检不乾封。山知槱柞新烟火，\n臣望箫韶旧鼓钟。清跸间过素王庙，翠华高映大夫松。\n旅中病客谙尧曲，身贱何由奏九重。\n\n【送萧世秀才】鲍溶\n心交别我西京去，愁满春魂不易醒。\n从此无人访穷病，马蹄车辙草青青。\n\n【吴中夜别】鲍溶\n楚客秋思著黄叶，吴姬夜歌停碧云。\n声尽灯前各流泪，水天凉冷雁离群。\n\n【寄王璠侍御求蜀笺】鲍溶\n蜀川笺纸彩云初，闻说王家最有馀。\n野客思将池上学，石楠红叶不堪书。\n\n【羽林行】鲍溶\n朝出羽林宫，入参云台议。独请万里行，不奏和亲事。\n君王重年少，深纳开边利。宝马雕玉鞍，一朝从万骑。\n煌煌都门外，祖帐光七贵。歌钟乐行军，云物惨别地。\n箫笳整部曲，幢盖动郊次。临风亲戚怀，满袖儿女泪。\n行行复何赠，长剑报恩字。\n\n【织妇词】鲍溶\n百日织彩丝，一朝停杼机。机中有双凤，化作天边衣。\n使人马如风，诚不阻音徽。影响随羽翼，双双绕君飞。\n行人岂愿行，不怨不知归。所怨天尽处，何人见光辉。\n\n【采珠行】鲍溶\n东方暮空海面平，骊龙弄珠烧月明。海人惊窥水底火，\n百宝错落随龙行。浮心一夜生奸见，月质龙躯看几遍。\n擘波下去忘此身，迢迢谓海无灵神。海宫正当龙睡重，\n昨夜孤光今得弄。河伯空忧水府贫，天吴不敢相惊动。\n一团冰容掌上清，四面人入光中行。腾华乍摇白日影，\n铜镜万古羞为灵。海边老翁怨狂子，抱珠哭向无底水。\n一富何须龙颔前，千金几葬鱼腹里。鳞虫变化为阴阳，\n填海破山无景光。拊心仿佛失珠意，此土为尔离农桑。\n饮风衣日亦饱暖，老翁掷却荆鸡卵。\n\n【南塘二首】鲍溶\n南塘旅舍秋浅清，夜深绿蘋风不生。\n莲花受露重如睡，斜月起动鸳鸯声。\n\n塘东白日驻红雾，早鱼翻光落碧浔。\n画舟兰棹欲破浪，恐畏惊动莲花心。\n\n【寄李都护】鲍溶\n去年河上送行人，万里弓旌一武臣。\n闻道玉关烽火灭，犬戎知有外家亲。\n\n【汉宫词二首】鲍溶\n柏梁宸居清窈窕，东方先生夜待诏。\n夜久月当承露盘，内人吹笙舞凤鸾。\n\n月映东窗似玉轮，未央前殿绝声尘。\n宫槐花落西风起，鹦鹉惊寒夜唤人。\n\n【句】鲍溶\n万里岐路多，一身天地窄。（见张为《主客图》）\n\n.\n."
		},
		{
			"post_id": 19,
			"title": "鲍君徽的诗",
			"date_published": 1611990018.61,
			"body": "【关山月】鲍君徽\n高高秋月明，北照辽阳城。塞迥光初满，风多晕更生。\n征人望乡思，战马闻鼙惊。朔风悲边草，胡沙暗虏营。\n霜凝匣中剑，风惫原上旌。早晚谒金阙，不闻刁斗声。\n\n【东亭茶宴】鲍君徽\n闲朝向晓出帘栊，茗宴东亭四望通。远眺城池山色里，\n俯聆弦管水声中。幽篁引沼新抽翠，芳槿低檐欲吐红。\n坐久此中无限兴，更怜团扇起清风。"
		},
		{
			"post_id": 18,
			"title": "【送韦生酒】鲍家四弦",
			"date_published": 1611989987.362,
			"body": "【送韦生酒】鲍家四弦\n白露湿庭砌，皓月临前轩。此时去留恨，含思独无言。"
		},
		{
			"post_id": 17,
			"title": "鲍防的诗",
			"date_published": 1611989936.723,
			"body": "【状江南 孟春】鲍防\n江南孟春天，荇叶大如钱。白雪装梅树，青袍似葑田。\n\n【元日早朝行】鲍防\n乾元发生春为宗，盛德在木斗建东。东方岁星大明宫，\n南山喜气摇晴空。望云五等舞万玉，献寿一声出千峰。\n文昌随彩礼乐正，太平下直旌旗红。师旷应律调黄钟，\n王良运策调时龙。玄冥无事归朔土，青帝放身入朱宫。\n九韶九变五声里，四方四友一身中。天何言哉乐无穷，\n广成彭祖为三公。野臣潜随击壤老，日下鼓腹歌可封。"
		},
		{
			"post_id": 16,
			"title": "【行路难】宝月",
			"date_published": 1611989914.977,
			"body": "【行路难】宝月\n君不见，孤雁关外发，酸嘶度杨越。空城客子心肠断，\n幽闺思妇气欲绝。凝霜夜下拂罗衣，浮云中断开明月。\n夜夜遥遥徒相思，年年望望情不歇。取我匣中青铜镜，\n情人为我除白发。行路难，行路难。夜闻南城汉使度，\n使我流泪忆长安。"
		},
		{
			"post_id": 15,
			"title": "【和徐鼎臣见寄】包颖",
			"date_published": 1611989873.593,
			"body": "【和徐鼎臣见寄】包颖\n平生中表最情亲，浮世那堪聚散频。谢脁却吟归省阁，\n刘桢犹自卧漳滨。旧游半似前生事，要路多逢后进人。\n且喜新吟报强健，明年相望杏园春。"
		},
		{
			"post_id": 14,
			"title": "包融的诗",
			"date_published": 1611989839.844,
			"body": "【登翅头山题俨公石壁】包融\n晨登翅头山，山曛黄雾起。却瞻迷向背，直下失城市。\n暾日衔东郊，朝光生邑里。扫除诸烟氛，照出众楼雉。\n青为洞庭山，白是太湖水。苍茫远郊树，倏忽不相似。\n万象以区别，森然共盈几。坐令开心胸，渐觉落尘滓。\n北岩千馀仞，结庐谁家子。愿陪中峰游，朝暮白云里。\n\n【酬忠公林亭】包融\n江外有真隐，寂居岁已侵。结庐近西术，种树久成阴。\n人迹乍及户，车声遥隔林。自言解尘事，咫尺能辎尘。\n为道岂庐霍，会静由吾心。方秋院木落，仰望日萧森。\n持我兴来趣，采菊行相寻。尘念到门尽，远情对君深。\n一谈入理窟，再索破幽襟。安得山中信，致书移尚禽。\n\n【和陈校书省中玩雪】包融\n芸阁朝来雪，飘飖正满空。褰开明月下，校理落花中。\n色向怀铅白，光因翰简融。能令草玄者，回思入流风。\n\n【赋得岸花临水发】包融\n笑笑傍溪花，丛丛逐岸斜。朝开川上日，夜发浦中霞。\n照灼如临镜，zv茸胜浣纱。春来武陵道，几树落仙家。"
		},
		{
			"post_id": 13,
			"title": "包佶的诗",
			"date_published": 1611989800.185,
			"body": "【郊庙歌辞 祀风师乐章 送神】包佶\n微穆敷华能应节，飘扬发彩宜行庆。送迎灵驾神心享，\n跪拜灵坛礼容盛。气和草木发萌芽，德畅禽鱼遂翔泳。\n永望翠盖逐流云，自兹率土调春令。\n\n【郊庙歌辞 祀雨师乐章 送神】包佶\n整驾升车望寥廓，垂阴荐祉荡昏氛。飨时灵贶僾如在。\n乐罢馀声遥可闻。饮福陈诚礼容备，撤俎终献曙光分。\n跪拜临坛结空想，年年应节候油云。\n\n.\n.\n【祀风师乐章 迎神】包佶\n太皞御气，句芒肇功。苍龙青旗，爰候祥风。\n律以和应，神以感通。鼎俎修蚃，时惟礼崇。\n\n【祀风师乐章 迎俎酌献】包佶\n德盛昭临，迎拜巽方。爰候发生，式荐馨香。\n酌醴具举，工歌再扬。神歆入律，恩降百祥。\n\n【祀风师乐章 送神】包佶\n微穆敷华能应节，飘扬发彩宜行庆。送迎灵驾神心飨，\n跪拜灵坛礼容盛。气和草木发萌芽，德畅禽鱼遂翔泳。\n永望翠盖逐流云，自兹率土调春令。\n\n【祀雨师乐章 奠币登歌】包佶\n岁正朱明，礼布玄制。惟乐能感，与神合契。\n阴雾离披，灵驭摇裔。膏泽之庆，期于稔岁。\n\n【祀雨师乐章 亚献终献】包佶\n奠既备，献将终。神行令，瑞飞空。\n迎乾德，祈岁功。乘烟燎，俨从风。\n\n【答窦拾遗卧病见寄】包佶\n今春扶病移沧海，几度承恩对白花。送客屡闻帘外鹊，\n销愁已辨酒中蛇。瓶开枸杞悬泉水，鼎炼芙蓉伏火砂。\n误入尘埃牵吏役，羞将簿领到君家。\n\n【岭下卧疾，寄刘长卿员外】包佶\n唯有贫兼病，能令亲爱疏。岁时供放逐，身世付空虚。\n胫弱秋添絮，头风晓废梳。波澜喧众口，藜藿静吾庐。\n丧马思开卦，占鸮懒发书。十年江海隔，离恨子知予。\n\n【昭德皇后挽歌词】包佶\n西汜驰晖过，东园别路长。岁华唯陇柏，春事罢公桑。\n龟兆开泉户，禽巢闭画梁。更闻哀礼过，明诏制心丧。\n\n【双山过信公所居】包佶\n遥礼前朝塔，微闻后夜钟。人间第四祖，云里一双峰。\n积雨封苔径，多年亚石松。传心不传法，谁可继高踪。\n\n【抱疾谢李吏部赠诃黎勒叶】包佶\n一叶生西徼，赍来上海查。岁时经水府，根本别天涯。\n方士真难见，商胡辄自夸。此香同异域，看色胜仙家。\n茗饮暂调气，梧丸喜伐邪。幸蒙祛老疾，深愿驻韶华。\n\n【酬于侍郎湖南见寄十四韵】包佶\n桂岭千崖断，湘流一派通。长沙今贾傅，东海旧于公。\n章甫经殊俗，离骚继雅风。金闺文作字，玉匣气成虹。\n翰墨时招侣，丹青夙在公。主恩留左掖，人望积南宫。\n巧拙循名异，浮沉顾位同。九迁归上略，三已契愚衷。\n责谢庭中吏，悲宽塞上翁。楚材欣有适，燕石愧无功。\n山晓重岚外，林春苦雾中。雪花翻海鹤，波影倒江枫。\n去札频逢信，回帆早挂空。避贤方有日，非敢爱微躬。\n\n【发襄阳后却寄公安人】包佶\n挥泪送回人，将书报所亲。晚年多疾病，中路有风尘。\n王粲频征楚，君恩许入秦。还同星火去，马上别江春。\n\n【宿庐山，赠白鹤观刘尊师】包佶\n苍苍五老雾中坛，杳杳三山洞里官。手护昆仑象牙简，\n心推霹雳枣枝盘。春飞雪粉如毫润，晓漱琼膏冰齿寒。\n渐恨流年筋力少，惟思露冕事星冠。\n\n【送日本国聘贺使晁巨卿东归】包佶\n上才生下国，东海是西邻。九译蕃君使，千年圣主臣。\n野情偏得礼，木性本含真。锦帆乘风转，金装照地新。\n孤城开蜃阁，晓日上朱轮。早识来朝岁，涂山玉帛均。\n\n【近获风痹之疾，题寄所怀】包佶\n病夫将已矣，无可答君恩。衾枕同羁客，图书委外孙。\n久来从吏道，常欲奉空门。疾走机先息，欹行力渐烦。\n无医能却老，有变是游魂。鸟宿还依伴，蓬飘莫问根。\n寓形齐指马，观境制心猿。唯借南荣地，清晨暂负暄。\n\n【酬顾况见寄】包佶\n于越城边枫叶高，楚人书里寄离骚。\n寒江鸂鶒思俦侣，岁岁临流刷羽毛。\n\n【元日观百僚朝会】包佶\n万国贺唐尧，清晨会百僚。花冠萧相府，绣服霍嫖姚。\n寿色凝丹槛，欢声彻九霄。御炉分兽炭，仙管弄云韶。\n日照金觞动，风吹玉佩摇。都城献赋者，不得共趋朝。\n\n【寄杨侍御（一作包何诗）】包佶\n一官何幸得同时，十载无媒独见遗。\n今日不论腰下组，请君看取鬓边丝。\n\n.\n."
		},
		{
			"post_id": 12,
			"title": "包何的诗",
			"date_published": 1611989744.546,
			"body": "【和孟虔州闲斋即事】包何\n古郡邻江岭，公庭半薜萝。府僚闲不入，山鸟静偏过。\n睥睨临花柳，栏干枕芰荷。麦秋今欲至，君听两岐歌。\n\n【同阎伯均宿道士观有述】包何\n南国佳人去不回，洛阳才子更须媒。绮琴白雪无心弄，\n罗幌清风到晓开。冉冉修篁依户牖，迢迢列宿映楼台。\n纵令奔月成仙去，且作行云入梦来。\n\n【送王汶宰江阴】包何\n郡北乘流去，花间竟日行。海鱼朝满市，江鸟夜喧城。\n止酒非关病，援琴不在声。应缘五斗米，数日滞渊明。\n\n【阙下芙蓉】包何\n一人理国致升平，万物呈祥助圣明。天上河从阙下过，\n江南花向殿前生。广云垂荫开难落，湛露为珠满不倾。\n更对乐悬张宴处，歌工欲奏采莲声。\n\n【和程员外春日东郊即事】包何\n郎官休浣怜迟日，野老欢娱为有年。几处折花惊蝶梦，\n数家留叶待蚕眠。藤垂宛地萦珠履，泉迸侵阶浸绿钱。\n直到闭关朝谒去，莺声不散柳含烟。\n\n【同诸公寻李方直不遇】包何\n闻说到扬州，吹箫忆旧游。人来多不见，莫是上迷楼。\n\n【寄杨侍御（一作包佶诗）】包何\n一官何幸得同时，十载无媒独见遗。\n今日不论腰下组，请君看取鬓边丝。"
		},
		{
			"post_id": 11,
			"title": "【歌】白衫举子",
			"date_published": 1611989720.88,
			"body": "【歌】白衫举子\n执板狂歌乞个钱，尘中流浪且随缘。\n直饶到老常如此，犹胜危时弄化权。"
		},
		{
			"post_id": 10,
			"title": "【贺收复秦原诸州诗】白敏中",
			"date_published": 1611989608.351,
			"body": "【贺收复秦原诸州诗】白敏中\n一诏皇城四海颁，丑戎无数束身还。戍楼吹笛人休战，\n牧野嘶风马自闲。河水九盘收数曲，天山千里锁诸关。\n西边北塞今无事，为报东南夷与蛮。"
		},
		{
			"post_id": 9,
			"title": "白居易的诗",
			"date_published": 1610702568.003,
			"body": "【相和歌辞 王昭君二首】白居易\n满面胡沙满鬓风，眉销残黛脸销红。\n愁苦辛勤憔悴尽，如今却似画图中。\n\n汉使却回凭寄语，黄金何日赎蛾眉。\n君王若问妾颜色，莫道不如宫里时。\n\n【相和歌辞 短歌行二首】白居易\n曈曈太阳如火色，上行千里下一刻。出为白昼入为夜，\n圜转如珠住不得。住不得，可奈何，为君举酒歌短歌。\n歌声苦，词亦苦，四座少年君听取。今夕未竟明夕催，\n秋风才往春风回。人无根蒂时不驻，朱颜白日相隳颓。\n劝君且强笑一面，劝君复强饮一杯。人生不得长欢乐，\n年少须臾老到来。\n\n世人求富贵，多为身嗜欲。盛衰不自由，得失常相逐。\n问君少年日，苦学将干禄。负笈尘中游，抱书雪前宿。\n布衾不周体，藜茄才充腹。三十登宦途，五十被朝服。\n奴温已挟纩，马肥初食粟。未敢议欢游，尚为名检束。\n耳目聋暗后，堂上调丝竹。牙齿缺落时，盘中堆酒肉。\n彼来此已去，外馀中不足。少壮与荣华，相避如寒燠。\n青云去地远，白日终天速。从古无奈何，短歌听一曲。\n\n【相和歌辞 反白头吟】白居易\n炎炎者烈火，营营者小蝇。火不热真玉，蝇不点清冰。\n此苟无所受，彼莫能相仍。乃知物性中，各有能不能。\n古称怨报死，则人有所惩。惩淫或应可，在道未为弘。\n譬如蜩鷃徒，啾啾啅龙鹏。宜当委之去，寥廓高飞腾。\n岂能泥尘下，区区酬怨憎。胡为坐自苦，吞悲仍抚膺。\n\n【相和歌辞 怨诗】白居易\n夺宠心那惯，寻思倚殿门。不知移旧爱，何处作新恩。\n\n【相和歌辞 采莲曲】白居易\n菱叶萦波荷飐风，荷花深处小船通。\n逢郎欲语低头笑，碧玉搔头落水中。\n\n【杂曲歌辞 悲哉行】白居易\n悲哉为儒者，力学不能疲。读书眼欲暗，秉笔手生胝。\n十上方一第，成名常苦迟。纵有宦达者，两鬓已成丝。\n可怜少壮日，适在穷贱时。丈夫老且病，焉用富贵为。\n沉沉朱门宅，中有乳臭儿。状貌如妇人，光明膏粱肌。\n手不把书卷，身不擐戎衣。二十袭封爵，门承勋戚资。\n春来日日出，服御何轻肥。朝从博徒饮，暮有倡楼期。\n评封还酒债，堆金选蛾眉。声色狗马外，其馀一无知。\n山苗与涧松，地势随高卑。古来无奈何，非君独伤悲。\n\n【杂曲歌辞 长相思】白居易\n九月西风兴，月冷霜华凝。思君秋夜长，一夜魂九升。\n二月东风来，草坼花心开。思君春日迟，一日肠九回。\n妾住洛桥北，君住洛桥南。十五即相识，今年二十三。\n有如女萝草，生在松之侧。蔓短枝苦高，萦回上不得。\n人言人有愿，愿至天必成。愿作远方兽，步步比肩行。\n愿作深山木，枝枝连理生。\n\n【杂曲歌辞 离别难】白居易\n绿杨陌上送行人，马去车回一望尘。\n不觉别时红泪尽，归来无泪可沾巾。\n\n【杂曲歌辞 乐世】白居易\n管急丝繁拍渐稠，绿腰宛转曲终头。\n诚知乐世声声乐，老病人听未免愁。\n\n【杂曲歌辞 何满子】白居易\n世传满子是人名，临就刑时曲始成。\n一曲四词歌八叠，从头便是断肠声。\n\n【杂曲歌辞 竹枝】白居易\n瞿塘峡口冷烟低，白帝城头月向西。\n唱到竹枝声咽处，寒猿晴鸟一时啼。\n\n竹枝苦怨怨何人，夜静山空歇又闻。\n蛮儿巴女齐声唱，愁杀江楼病使君。\n\n巴东船舫上巴西，波面风生雨脚齐。\n水蓼冷花红蔟蔟，江蓠湿叶碧萋萋。\n\n江畔谁人唱竹枝，前声断咽后声迟。\n怪来调苦缘词苦，多是通州司马诗。\n\n【杂曲歌辞 杨柳枝】白居易\n六么水调家家唱，白雪梅花处处吹。\n古歌旧曲君休听，听取新翻杨柳枝。\n\n陶令门前四五树，亚夫营里百千条。\n何似东都正二月，黄金枝映洛阳桥。\n\n依依袅袅复青青，勾引清风无限情。\n白雪花繁空扑地，绿丝条弱不胜莺。\n\n红板江桥青酒旗，馆娃宫暖日斜时。\n可怜雨歇东风定，万树千条各自垂。\n\n苏州杨柳任君夸，更有钱塘胜馆娃。\n若解多情寻小小，绿杨深处是苏家。\n\n苏家小女旧知名，杨柳风前别有情。\n剥条盘作银环样，卷叶吹为玉笛声。\n\n叶含浓露如啼眼，枝袅轻风似舞腰。\n小树不禁攀折苦，乞君留取两三条。\n\n人言柳叶似愁眉，更有愁肠似柳丝。\n柳丝挽断肠牵断，彼此应无续得期。\n\n【杂曲歌辞 小曲新词】白居易\n霁色鲜宫殿，秋声脆管弦。圣明千岁乐，岁岁似今年。\n\n红裙明月夜，碧殿早秋时。好向昭阳宿，天凉玉漏迟。\n\n【贺雨】白居易\n皇帝嗣宝历，元和三年冬。自冬及春暮，不雨旱爞爞。\n上心念下民，惧岁成灾凶。遂下罪己诏，殷勤告万邦。\n帝曰予一人，继天承祖宗。忧勤不遑宁，夙夜心忡忡。\n元年诛刘辟，一举靖巴邛。二年戮李锜，不战安江东。\n顾惟眇眇德，遽有巍巍功。或者天降沴，无乃儆予躬。\n上思答天戒，下思致时邕。莫如率其身，慈和与俭恭。\n乃命罢进献，乃命赈饥穷。宥死降五刑，责己宽三农。\n宫女出宣徽，厩马减飞龙。庶政靡不举，皆出自宸衷。\n奔腾道路人，伛偻田野翁。欢呼相告报，感泣涕沾胸。\n顺人人心悦，先天天意从。诏下才七日，和气生冲融。\n凝为油油云，散作习习风。昼夜三日雨，凄凄复濛濛。\n万心春熙熙，百谷青芃芃。人变愁为喜，岁易俭为丰。\n乃知王者心，忧乐与众同。皇天与后土，所感无不通。\n冠珮何锵锵，将相及王公。蹈舞呼万岁，列贺明庭中。\n小臣诚愚陋，职忝金銮宫。稽首再三拜，一言献天聪。\n君以明为圣，臣以直为忠。敢贺有其始，亦愿有其终。\n\n【哭孔戡】白居易\n洛阳谁不死，戡死闻长安。我是知戡者，闻之涕泫然。\n戡佐山东军，非义不可干。拂衣向西来，其道直如弦。\n从事得如此，人人以为难。人言明明代，合置在朝端。\n或望居谏司，有事戡必言。或望居宪府，有邪戡必弹。\n惜哉两不谐，没齿为闲官。竟不得一日，謇謇立君前。\n形骸随众人，敛葬北邙山。平生刚肠内，直气归其间。\n贤者为生民，生死悬在天。谓天不爱人，胡为生其贤。\n谓天果爱民，胡为夺其年。茫茫元化中，谁执如此权。\n\n【梦仙】白居易\n人有梦仙者，梦身升上清。坐乘一白鹤，前引双红旌。\n羽衣忽飘飘，玉鸾俄铮铮。半空直下视，人世尘冥冥。\n渐失乡国处，才分山水形。东海一片白，列岳五点青。\n须臾群仙来，相引朝玉京。安期羡门辈，列侍如公卿。\n仰谒玉皇帝，稽首前致诚。帝言汝仙才，努力勿自轻。\n却后十五年，期汝不死庭。再拜受斯言，既寤喜且惊。\n秘之不敢泄，誓志居岩扃。恩爱舍骨肉，饮食断膻腥。\n朝餐云母散，夜吸沆瀣精。空山三十载，日望辎輧迎。\n前期过已久，鸾鹤无来声。齿发日衰白，耳目减聪明。\n一朝同物化，身与粪壤并。神仙信有之，俗力非可营。\n苟无金骨相，不列丹台名。徒传辟谷法，虚受烧丹经。\n只自取勤苦，百年终不成。悲哉梦仙人，一梦误一生。\n\n【羸骏】白居易\n骅骝失其主，羸饿无人牧。向风嘶一声，莽苍黄河曲。\n蹋冰水畔立，卧雪冢间宿。岁暮田野空，寒草不满腹。\n岂无市骏者，尽是凡人目。相马失于瘦，遂遗千里足。\n村中何扰扰，有吏征刍粟。输彼军厩中，化作驽骀肉。\n\n【李都尉古剑】白居易\n古剑寒黯黯，铸来几千秋。白光纳日月，紫气排斗牛。\n有客借一观，爱之不敢求。湛然玉匣中，秋水澄不流。\n至宝有本性，精刚无与俦。可使寸寸折，不能绕指柔。\n愿快直士心，将断佞臣头。不愿报小怨，夜半刺私仇。\n劝君慎所用，无作神兵羞。\n\n【月夜登阁避暑】白居易\n旱久炎气盛，中人若燔烧。清风隐何处，草树不动摇。\n何以避暑气，无如出尘嚣。行行都门外，佛阁正岧峣。\n清凉近高生，烦热委静销。开襟当轩坐，意泰神飘飘。\n回看归路傍，禾黍尽枯焦。独善诚有计，将何救旱苗。\n\n【赠元稹】白居易\n自我从宦游，七年在长安。所得惟元君，乃知定交难。\n岂无山上苗，径寸无岁寒。岂无要津水，咫尺有波澜。\n之子异于是，久处誓不谖。无波古井水，有节秋竹竿。\n一为同心友，三及芳岁阑。花下鞍马游，雪中杯酒欢。\n衡门相逢迎，不具带与冠。春风日高睡，秋月夜深看。\n不为同登科，不为同署官。所合在方寸，心源无异端。\n\n【答友问】白居易\n大圭廉不割，利剑用不缺。当其斩马时，良玉不如铁。\n置铁在洪炉，铁消易如雪。良玉同其中，三日烧不热。\n君疑才与德，咏此知优劣。\n\n【宿紫阁山北村】白居易\n晨游紫阁峰，暮宿山下村。村老见余喜，为余开一尊。\n举杯未及饮，暴卒来入门。紫衣挟刀斧，草草十馀人。\n夺我席上酒，掣我盘中飧。主人退后立，敛手反如宾。\n中庭有奇树，种来三十春。主人惜不得，持斧断其根。\n口称采造家，身属神策军。主人慎勿语，中尉正承恩。\n\n【赠樊著作】白居易\n阳城为谏议，以正事其君。其手如屈轶，举必指佞臣。\n卒使不仁者，不得秉国钧。元稹为御史，以直立其身。\n其心如肺石，动必达穷民。东川八十家，冤愤一言伸。\n刘辟肆乱心，杀人正纷纷。其嫂曰庾氏，弃绝不为亲。\n从史萌逆节，隐心潜负恩。其佐曰孔戡，舍去不为宾。\n凡此士与女，其道天下闻。常恐国史上，但记凤与麟。\n贤者不为名，名彰教乃敦。每惜若人辈，身死名亦沦。\n君为著作郎，职废志空存。虽有良史才，直笔无所申。\n何不自著书，实录彼善人。编为一家言，以备史阙文。\n\n【折剑头】白居易\n拾得折剑头，不知折之由。一握青蛇尾，数寸碧峰头。\n疑是斩鲸鲵，不然刺蛟虬。缺落泥土中，委弃无人收。\n我有鄙介性，好刚不好柔。勿轻直折剑，犹胜曲全钩。\n\n【酬元九对新栽竹有怀见寄】白居易\n昔我十年前，与君始相识。曾将秋竹竿，比君孤且直。\n中心一以合，外事纷无极。共保秋竹心，风霜侵不得。\n始嫌梧桐树，秋至先改色。不爱杨柳枝，春来软无力。\n怜君别我后，见竹长相忆。长欲在眼前，故栽庭户侧。\n分首今何处，君南我在北。吟我赠君诗，对之心恻恻。\n\n【春雪】白居易\n元和岁在卯，六年春二月。月晦寒食天，天阴夜飞雪。\n连宵复竟日，浩浩殊未歇。大似落鹅毛，密如飘玉屑。\n寒销春茫苍，气变风凛冽。上林草尽没，曲江水复结。\n红乾杏花死，绿冻杨枝折。所怜物性伤，非惜年芳绝。\n上天有时令，四序平分别。寒燠苟反常，物生皆夭阏。\n我观圣人意，鲁史有其说。或记水不冰，或书霜不杀。\n上将儆政教，下以防灾孽。兹雪今如何，信美非时节。\n\n【白牡丹（和钱学士作）】白居易\n城中看花客，旦暮走营营。素华人不顾，亦占牡丹名。\n闭在深寺中，车马无来声。唯有钱学士，尽日绕丛行。\n怜此皓然质，无人自芳馨。众嫌我独赏，移植在中庭。\n留景夜不暝，迎光曙先明。对之心亦静，虚白相向生。\n唐昌玉蕊花，攀玩众所争。折来比颜色，一种如瑶琼。\n彼因稀见贵，此以多为轻。始知无正色，爱恶随人情。\n岂惟花独尔，理与人事并。君看入时者，紫艳与红英。\n\n【寄唐生】白居易\n贾谊哭时事，阮籍哭路岐。唐生今亦哭，异代同其悲。\n唐生者何人，五十寒且饥。不悲口无食，不悲身无衣。\n所悲忠与义，悲甚则哭之。太尉击贼日，尚书叱盗时。\n大夫死凶寇，谏议谪蛮夷。每见如此事，声发涕辄随。\n往往闻其风，俗士犹或非。怜君头半白，其志竟不衰。\n我亦君之徒，郁郁何所为。不能发声哭，转作乐府诗。\n篇篇无空文，句句必尽规。功高虞人箴，痛甚骚人辞。\n非求宫律高，不务文字奇。惟歌生民病，愿得天子知。\n未得天子知，甘受时人嗤。药良气味苦，琴澹音声稀。\n不惧权豪怒，亦任亲朋讥。人竟无奈何，呼作狂男儿。\n每逢群盗息，或遇云雾披。但自高声歌，庶几天听卑。\n歌哭虽异名，所感则同归。寄君三十章，与君为哭词。\n\n【问友】白居易\n种兰不种艾，兰生艾亦生。根荄相交长，茎叶相附荣。\n香茎与臭叶，日夜俱长大。锄艾恐伤兰，溉兰恐滋艾。\n兰亦未能溉，艾亦未能除。沉吟意不决，问君合何如。\n\n【紫藤】白居易\n藤花紫蒙茸，藤叶青扶疏。谁谓好颜色，而为害有馀。\n下如蛇屈盘，上若绳萦纡。可怜中间树，束缚成枯株。\n柔蔓不自胜，袅袅挂空虚。岂知缠树木，千夫力不如。\n先柔后为害，有似谀佞徒。附著君权势，君迷不肯诛。\n又如妖妇人，绸缪蛊其夫。奇邪坏人室，夫惑不能除。\n寄言邦与家，所慎在其初。毫末不早辨，滋蔓信难图。\n愿以藤为戒，铭之于座隅。\n\n【慈乌夜啼】白居易\n慈乌失其母，哑哑吐哀音。昼夜不飞去，经年守故林。\n夜夜夜半啼，闻者为沾襟。声中如告诉，未尽反哺心。\n百鸟岂无母，尔独哀怨深。应是母慈重，使尔悲不任。\n昔有吴起者，母殁丧不临。嗟哉斯徒辈，其心不如禽。\n慈乌复慈乌，鸟中之曾参。\n\n【采地黄者】白居易\n麦死春不雨，禾损秋早霜。岁晏无口食，田中采地黄。\n采之将何用，持以易餱粮。凌晨荷锄去，薄暮不盈筐。\n携来朱门家，卖与白面郎。与君啖肥马，可使照地光。\n愿易马残粟，救此苦饥肠。\n\n【邓鲂、张彻落第】白居易\n古琴无俗韵，奏罢无人听。寒松无妖花，枝下无人行。\n春风十二街，轩骑不暂停。奔车看牡丹，走马听秦筝。\n众目悦芳艳，松独守其贞。众耳喜郑卫，琴亦不改声。\n怀哉二夫子，念此无自轻。\n\n【村居苦寒】白居易\n八年十二月，五日雪纷纷。竹柏皆冻死，况彼无衣民。\n回观村闾间，十室八九贫。北风利如剑，布絮不蔽身。\n唯烧蒿棘火，愁坐夜待晨。乃知大寒岁，农者尤苦辛。\n顾我当此日，草堂深掩门。褐裘覆紖被，坐卧有馀温。\n幸免饥冻苦，又无垄亩勤。念彼深可愧，自问是何人。\n\n【薛中丞】白居易\n百人无一直，百直无一遇。借问遇者谁，正人行得路。\n中丞薛存诚，守直心甚固。皇明烛如日，再使秉王度。\n奸豪与佞巧，非不憎且惧。直道渐光明，邪谋难盖覆。\n每因匪躬节，知有匡时具。张为坠网纲，倚作颓檐柱。\n悠哉上天意，报施纷回互。自古已冥茫，从今尤不谕。\n岂与小人意，昏然同好恶。不然君子人，何反如朝露。\n裴相昨已夭，薛君今又去。以我惜贤心，五年如旦暮。\n况闻善人命，长短系运数。今我一涕零，岂为中丞故。\n\n【夏旱】白居易\n太阴不离毕，太岁仍在午。旱日与炎风，枯焦我田亩。\n金石欲销铄，况兹禾与黍。嗷嗷万族中，唯农最辛苦。\n悯然望岁者，出门何所睹。但见棘与茨，罗生遍场圃。\n恶苗承沴气，欣然得其所。感此因问天，可能长不雨。\n\n【新制布裘】白居易\n桂布白似雪，吴绵软于云。布重绵且厚，为裘有馀温。\n朝拥坐至暮，夜覆眠达晨。谁知严冬月，支体暖如春。\n中夕忽有念，抚裘起逡巡。丈夫贵兼济，岂独善一身。\n安得万里裘，盖裹周四垠。稳暖皆如我，天下无寒人。\n\n【虾蟆（和张十六）】白居易\n嘉鱼荐宗庙，灵龟贡邦家。应龙能致雨，润我百谷芽。\n蠢蠢水族中，无用者虾蟆。形秽肌肉腥，出没于泥沙。\n六月七月交，时雨正滂沱。虾蟆得其志，快乐无以加。\n地既蕃其生，使之族类多。天又与其声，得以相喧哗。\n岂惟玉池上，污君清冷波。可独瑶瑟前，乱君鹿鸣歌。\n常恐飞上天，跳跃随姮娥。往往蚀明月，遣君无奈何。\n\n【文柏床】白居易\n陵上有老柏，柯叶寒苍苍。朝为风烟树，暮为宴寝床。\n以其多奇文，宜升君子堂。刮削露节目，拂拭生辉光。\n玄斑状狸首，素质如截肪。虽充悦目玩，终乏周身防。\n华彩诚可爱，生理苦已伤。方知自残者，为有好文章。\n\n【浔阳三题 湓浦竹】白居易\n浔阳十月天，天气仍温燠。有霜不杀草，有风不落木。\n玄冥气力薄，草木冬犹绿。谁肯湓浦头，回眼看修竹。\n其有顾盼者，持刀斩且束。剖劈青琅玕，家家盖墙屋。\n吾闻汾晋间，竹少重如玉。胡为取轻贱，生此西江曲。\n\n【大水】白居易\n浔阳郊郭间，大水岁一至。闾阎半飘荡，城堞多倾坠。\n苍茫生海色，渺漫连空翠。风卷白波翻，日煎红浪沸。\n工商彻屋去，牛马登山避。况当率税时，颇害农桑事。\n独有佣舟子，鼓枻生意气。不知万人灾，自觅锥刀利。\n吾无奈尔何，尔非久得志。九月霜降后，水涸为平地。\n\n.\n.\n【秦中吟十首 立碑】白居易\n勋德既下衰，文章亦陵夷。但见山中石，立作路旁碑。\n铭勋悉太公，叙德皆仲尼。复以多为贵，千言直万赀。\n为文彼何人，想见下笔时。但欲愚者悦，不思贤者嗤。\n岂独贤者嗤，仍传后代疑。古石苍苔字，安知是愧词。\n我闻望江县，麹令抚茕嫠。在官有仁政，名不闻京师。\n身殁欲归葬，百姓遮路岐。攀辕不得归，留葬此江湄。\n至今道其名，男女涕皆垂。无人立碑碣，唯有邑人知。\n\n【赠友五首】白居易\n一年十二月，每月有常令。君出臣奉行，谓之握金镜。\n由兹六气顺，以遂万物性。时令一反常，生灵受其病。\n周汉德下衰，王风始不竞。又从斩晁错，诸侯益强盛。\n百里不同禁，四时自为政。盛夏兴土功，方春剿人命。\n谁能救其失，待君佐邦柄。峨峨象魏门，悬法彝伦正。\n\n银生楚山曲，金生鄱溪滨。南人弃农业，求之多苦辛。\n披砂复凿石，矻矻无冬春。手足尽皴胝，爱利不爱身。\n畬田既慵斫，稻田亦懒耘。相携作游手，皆道求金银。\n毕竟金与银，何殊泥与尘。且非衣食物，不济饥寒人。\n弃本以趋末，日富而岁贫。所以先圣王，弃藏不为珍。\n谁能反古风，待君秉国钧。捐金复抵璧，勿使劳生民。\n\n私家无钱炉，平地无铜山。胡为秋夏税，岁岁输铜钱。\n钱力日已重，农力日已殚。贱粜粟与麦，贱贸丝与绵。\n岁暮衣食尽，焉得无饥寒。吾闻国之初，有制垂不刊。\n庸必算丁口，租必计桑田。不求土所无，不强人所难。\n量入以为出，上足下亦安。兵兴一变法，兵息遂不还。\n使我农桑人，憔悴畎亩间。谁能革此弊，待君秉利权。\n复彼租庸法，令如贞观年。\n\n京师四方则，王化之本根。长吏久于政，然后风教敦。\n如何尹京者，迁次不逡巡。请君屈指数，十年十五人。\n科条日相矫，吏力亦已勤。宽猛政不一，民心安得淳。\n九州雍为首，群牧之所遵。天下率如此，何以安吾民。\n谁能变此法，待君赞弥纶。慎择循良吏，令其长子孙。\n\n三十男有室，二十女有归。近代多离乱，婚姻多过期。\n嫁娶既不早，生育常苦迟。儿女未成人，父母已衰羸。\n凡人贵达日，多在长大时。欲报亲不待，孝心无所施。\n哀哉三牲养，少得及庭闱。惜哉万钟粟，多用饱妻儿。\n谁能正婚礼，待君张国维。庶使孝子心，皆无风树悲。\n\n【读史五首】白居易\n楚怀放灵均，国政亦荒淫。彷徨未忍决，绕泽行悲吟。\n汉文疑贾生，谪置湘之阴。是时刑方措，此去难为心。\n士生一代间，谁不有浮沉。良时真可惜，乱世何足钦。\n乃知汨罗恨，未抵长沙深。\n\n祸患如棼丝，其来无端绪。马迁下蚕室，嵇康就囹圄。\n抱冤志气屈，忍耻形神沮。当彼戮辱时，奋飞无翅羽。\n商山有黄绮，颍川有巢许。何不从之游，超然离网罟。\n山林少羁鞅，世路多艰阻。寄谢伐檀人，慎勿嗟穷处。\n\n汉日大将军，少为乞食子。秦时故列侯，老作锄瓜士。\n春华何暐晔，园中发桃李。秋风忽萧条，堂上生荆杞。\n深谷变为岸，桑田成海水。势去未须悲，时来何足喜。\n寄言荣枯者，反复殊未已。\n\n含沙射人影，虽病人不知。巧言构人罪，至死人不疑。\n掇蜂杀爱子，掩鼻戮宠姬。弘恭陷萧望，赵高谋李斯。\n阴德既必报，阴祸岂虚施。人事虽可罔，天道终难欺。\n明则有刑辟，幽则有神祇。苟免勿私喜，鬼得而诛之。\n\n季子憔悴时，妇见不下机。买臣负薪日，妻亦弃如遗。\n一朝黄金多，佩印衣锦归。去妻不敢视，妇嫂强依依。\n富贵家人重，贫贱妻子欺。奈何贫富间，可移亲爱志。\n遂使中人心，汲汲求富贵。又令下人力，各竞锥刀利。\n随分归舍来，一取妻孥意。\n\n【和答诗十首 和阳城驿】白居易\n商山阳城驿，中有叹者谁。云是元监察，江陵谪去时。\n忽见此驿名，良久涕欲垂。何故阳道州，名姓同于斯。\n怜君一寸心，宠辱誓不移。疾恶若巷伯，好贤如缁衣。\n沉吟不能去，意者欲改为。改为避贤驿，大署于门楣。\n荆人爱羊祜，户曹改为辞。一字不忍道，况兼姓呼之。\n因题八百言，言直文甚奇。诗成寄与我，锵若金和丝。\n上言阳公行，友悌无等夷。骨肉同衾裯，至死不相离。\n次言阳公迹，夏邑始栖迟。乡人化其风，少长皆孝慈。\n次言阳公道，终日对酒卮。兄弟笑相顾，醉貌红怡怡。\n次言阳公节，謇謇居谏司。誓心除国蠹，决死犯天威。\n终言阳公命，左迁天一涯。道州炎瘴地，身不得生归。\n一一皆实录，事事无孑遗。凡是为善者，闻之恻然悲。\n道州既已矣，往者不可追。何世无其人，来者亦可思。\n愿以君子文，告彼大乐师。附于雅歌末，奏之白玉墀。\n天子闻此章，教化如法施。直谏从如流，佞臣恶如疵。\n宰相闻此章，政柄端正持。进贤不知倦，去邪勿复疑。\n宪臣闻此章，不敢怀依违。谏官闻此章，不忍纵诡随。\n然后告史氏，旧史有前规。若作阳公传，欲令后世知。\n不劳叙世家，不用费文辞。但于国史上，全录元稹诗。\n\n【和答诗十首 和大觜乌】白居易\n乌者种有二，名同性不同。觜小者慈孝，觜大者贪庸。\n觜大命又长，生来十馀冬。物老颜色变，头毛白茸茸。\n飞来庭树上，初但惊儿童。老巫生奸计，与乌意潜通。\n云此非凡鸟，遥见起敬恭。千岁乃一出，喜贺主人翁。\n祥瑞来白日，神圣占知风。阴作北斗使，能为人吉凶。\n此乌所止家，家产日夜丰。上以致寿考，下可宜田农。\n主人富家子，身老心童蒙。随巫拜复祝，妇姑亦相从。\n杀鸡荐其肉，敬若禋六宗。乌喜张大觜，飞接在虚空。\n乌既饱膻腥，巫亦飨甘浓。乌巫互相利，不复两西东。\n日日营巢窟，稍稍近房栊。虽生八九子，谁辨其雌雄。\n群雏又成长，众觜逞残凶。探巢吞燕卵，入蔟啄蚕虫。\n岂无乘秋隼，羁绊委高墉。但食乌残肉，无施搏击功。\n亦有能言鹦，翅碧觜距红。暂曾说乌罪，囚闭在深笼。\n青青窗前柳，郁郁井上桐。贪乌占栖息，慈乌独不容。\n慈乌尔奚为，来往何憧憧。晓去先晨鼓，暮归后昏钟。\n辛苦尘土间，飞啄禾黍丛。得食将哺母，饥肠不自充。\n主人憎慈乌，命子削弹弓。弦续会稽竹，丸铸荆山铜。\n慈乌求母食，飞下尔庭中。数粒未入口，一丸已中胸。\n仰天号一声，似欲诉苍穹。反哺日未足，非是惜微躬。\n谁能持此冤，一为问化工。胡然大觜乌，竟得天年终。\n\n【和答诗十首 和雉媒】白居易\n吟君雉媒什，一哂复一叹。和之一何晚，今日乃成篇。\n岂唯鸟有之，抑亦人复然。张陈刎颈交，竟以势不完。\n至今不平气，塞绝泜水源。赵襄骨肉亲，亦以利相残。\n至今不善名，高于磨笄山。况此笼中雉，志在饮啄间。\n稻粱暂入口，性已随人迁。身苦亦自忘，同族何足言。\n但恨为媒拙，不足以自全。劝君今日后，养鸟养青鸾。\n青鸾一失侣，至死守孤单。劝君今日后，结客结任安。\n主人宾客去，独住在门阑。\n\n【和答诗十首 答箭镞】白居易\n矢人职司忧，为箭恐不精。精在利其镞，错磨锋镝成。\n插以青竹簳，羽之赤雁翎。勿言分寸铁，为用乃长兵。\n闻有狗盗者，昼伏夜潜行。摩弓拭箭镞，夜射不待明。\n一盗既流血，百犬同吠声。狺狺嗥不已，主人为之惊。\n盗心憎主人，主人不知情。反责镞太利，矢人获罪名。\n寄言控弦者，愿君少留听。何不向西射，西天有狼星。\n何不向东射，东海有长鲸。不然学仁贵，三矢平虏庭。\n不然学仲连，一发下燕城。胡为射小盗，此用无乃轻。\n徒沾一点血，虚污箭头腥。\n\n【和答诗十首 和分水岭】白居易\n高岭峻棱棱，细泉流亹亹。势分合不得，东西随所委。\n悠悠草蔓底，溅溅石罅里。分流来几年，昼夜两如此。\n朝宗远不及，去海三千里。浸润小无功，山苗长旱死。\n萦纡用无所，奔迫流不已。唯作呜咽声，夜入行人耳。\n有源殊不竭，无坎终难止。同出而异流，君看何所似。\n有似骨肉亲，派别从兹始。又似势利交，波澜相背起。\n所以赠君诗，将君何所比。不比山上泉，比君井中水。\n\n【叹鲁二首】白居易\n季桓心岂忠，其富过周公。阳货道岂正，其权执国命。\n由来富与权，不系才与贤。所托得其地，虽愚亦获安。\n彘肥因粪壤，鼠稳依社坛。虫兽尚如是，岂谓无因缘。\n\n展禽胡为者，直道竟三黜。颜子何如人，屡空聊过日。\n皆怀王佐道，不践陪臣秩。自古无奈何，命为时所屈。\n有如草木分，天各与其一。荔枝非名花，牡丹无甘实。\n\n【青冢】白居易\n上有饥鹰号，下有枯蓬走。茫茫边雪里，一掬沙培塿。\n传是昭君墓，埋闭蛾眉久。凝脂化为泥，铅黛复何有。\n唯有阴怨气，时生坟左右。郁郁如苦雾，不随骨销朽。\n妇人无他才，荣枯系妍否。何乃明妃命，独悬画工手。\n丹青一诖误，白黑相纷纠。遂使君眼中，西施作嫫母。\n同侪倾宠幸，异类为配偶。祸福安可知，美颜不如丑。\n何言一时事，可戒千年后。特报后来姝，不须倚眉首。\n无辞插荆钗，嫁作贫家妇。不见青冢上，行人为浇酒。\n\n【法曲－美列圣，正华声也】白居易\n法曲法曲歌大定，积德重熙有馀庆。永徽之人舞而咏，\n法曲法曲舞霓裳。政和世理音洋洋，开元之人乐且康。\n法曲法曲歌堂堂，堂堂之庆垂无疆。中宗肃宗复鸿业，\n唐祚中兴万万叶。法曲法曲合夷歌，夷声邪乱华声和。\n以乱干和天宝末，明年胡尘犯宫阙。乃知法曲本华风，\n苟能审音与政通。一从胡曲相参错，不辨兴衰与哀乐。\n愿求牙旷正华音，不令夷夏相交侵。\n\n【海漫漫－戒求仙也】白居易\n海漫漫，直下无底傍无边。云涛烟浪最深处，\n人传中有三神山。山上多生不死药，服之羽化为天仙。\n秦皇汉武信此语，方士年年采药去。蓬莱今古但闻名，\n烟水茫茫无觅处。海漫漫，风浩浩，眼穿不见蓬莱岛。\n不见蓬莱不敢归，童男丱女舟中老。徐福文成多诳诞，\n上元太一虚祈祷。君看骊山顶上茂陵头，毕竟悲风吹蔓草。\n何况玄元圣祖五千言，不言药，不言仙，不言白日升青天。\n\n【华原磬－刺乐工非其人也】白居易\n华原磬，华原磬，古人不听今人听。泗滨石，泗滨石，\n今人不击古人击。今人古人何不同，用之舍之由乐工。\n乐工虽在耳如壁，不分清浊即为聋。梨园弟子调律吕，\n知有新声不如古。古称浮磬出泗滨，立辨致死声感人。\n宫悬一听华原石，君心遂忘封疆臣。果然胡寇从燕起，\n武臣少肯封疆死。始知乐与时政通，岂听铿锵而已矣。\n磬襄入海去不归，长安市儿为乐师。华原磬与泗滨石，\n清浊两声谁得知。\n\n【新丰折臂翁－戒边功也】白居易\n新丰老翁八十八，头鬓眉须皆似雪。玄孙扶向店前行，\n左臂凭肩右臂折。问翁臂折来几年，兼问致折何因缘。\n翁云贯属新丰县，生逢圣代无征战。惯听梨园歌管声，\n不识旗枪与弓箭。无何天宝大征兵，户有三丁点一丁。\n点得驱将何处去，五月万里云南行。闻道云南有泸水，\n椒花落时瘴烟起。大军徒涉水如汤，未过十人二三死。\n村南村北哭声哀，儿别爷娘夫别妻。皆云前后征蛮者，\n千万人行无一回。是时翁年二十四，兵部牒中有名字。\n夜深不敢使人知，偷将大石捶折臂。张弓簸旗俱不堪，\n从兹始免征云南。骨碎筋伤非不苦，且图拣退归乡土。\n此臂折来六十年，一肢虽废一身全。至今风雨阴寒夜，\n直到天明痛不眠。痛不眠，终不悔，且喜老身今独在。\n不然当时泸水头，身死魂孤骨不收。应作云南望乡鬼，\n万人冢上哭呦呦。老人言，君听取。\n君不闻开元宰相宋开府，不赏边功防黩武。\n又不闻天宝宰相杨国忠，欲求恩幸立边功。\n边功未立生人怨，请问新丰折臂翁。\n\n【司天台－引古以儆今也】白居易\n司天台，仰观俯察天人际。羲和死来职事废，\n官不求贤空取艺。昔闻西汉元成间，上陵下替谪见天。\n北辰微闇少光色，四星煌煌如火赤。耀芒动角射三台，\n上台半灭中台坼。是时非无太史官，眼见心知不敢言。\n明朝趋入明光殿，唯奏庆云寿星见。天文时变两如斯，\n九重天子不得知。不得知，安用台高百尺为。\n\n【昆明春－思王泽之广被也】白居易\n昆明春，昆明春，春池岸古春流新。影浸南山青滉漾，\n波沉西日红奫沦。往年因旱池枯竭，龟尾曳涂鱼喣沫。\n诏开八水注恩波，千介万鳞同日活。今来净绿水照天，\n游鱼鱍鱍莲田田。洲香杜若抽心短，沙暖鸳鸯铺翅眠。\n动植飞沉皆遂性，皇泽如春无不被。渔者仍丰网罟资，\n贫人久获菰蒲利。诏以昆明近帝城，官家不得收其征。\n菰蒲无租鱼无税，近水之人感君惠。感君惠，独何人，\n吾闻率土皆王民，远民何疏近何亲。愿推此惠及天下，\n无远无近同欣欣。吴兴山中罢榷茗，鄱阳坑里休封银。\n天涯地角无禁利，熙熙同似昆明春。\n\n【道州民－美臣遇明主也】白居易\n道州民，多侏儒，长者不过三尺馀。市作矮奴年进送，\n号为道州任土贡。任土贡，宁若斯，不闻使人生别离，\n老翁哭孙母哭儿。一自阳城来守郡，不进矮奴频诏问。\n城云臣按六典书，任土贡有不贡无。道州水土所生者，\n只有矮民无矮奴。吾君感悟玺书下，岁贡矮奴宜悉罢。\n道州民，老者幼者何欣欣。父兄子弟始相保，\n从此得作良人身。道州民，民到于今受其赐，\n欲说使君先下泪。仍恐儿孙忘使君，生男多以阳为字。\n\n【五弦弹－恶郑之夺雅也】白居易\n五弦弹，五弦弹，听者倾耳心寥寥。赵璧知君入骨爱，\n五弦一一为君调。第一第二弦索索，秋风拂松疏韵落。\n第三第四弦泠泠，夜鹤忆子笼中鸣。第五弦声最掩抑，\n陇水冻咽流不得。五弦并奏君试听，凄凄切切复铮铮。\n铁击珊瑚一两曲，冰泻玉盘千万声。铁声杀，冰声寒。\n杀声入耳肤血憯，寒气中人肌骨酸。曲终声尽欲半日，\n四坐相对愁无言。座中有一远方士，唧唧咨咨声不已。\n自叹今朝初得闻，始知孤负平生耳。唯忧赵璧白发生，\n老死人间无此声。远方士，尔听五弦信为美，\n吾闻正始之音不如是。正始之音其若何，朱弦疏越清庙歌。\n一弹一唱再三叹，曲澹节稀声不多。融融曳曳召元气，\n听之不觉心平和。人情重今多贱古，古琴有弦人不抚。\n更从赵璧艺成来，二十五弦不如五。\n\n【缚戎人－达穷民之情也】白居易\n缚戎人，缚戎人，耳穿面破驱入秦。天子矜怜不忍杀，\n诏徙东南吴与越。黄衣小使录姓名，领出长安乘递行。\n身被金创面多瘠，扶病徒行日一驿。朝餐饥渴费杯盘，\n夜卧腥臊污床席。忽逢江水忆交河，垂手齐声呜咽歌。\n其中一虏语诸虏，尔苦非多我苦多。同伴行人因借问，\n欲说喉中气愤愤。自云乡管本凉原，大历年中没落蕃。\n一落蕃中四十载，遣著皮裘系毛带。唯许正朝服汉仪，\n敛衣整巾潜泪垂。誓心密定归乡计，不使蕃中妻子知。\n暗思幸有残筋力，更恐年衰归不得。蕃候严兵鸟不飞，\n脱身冒死奔逃归。昼伏宵行经大漠，云阴月黑风沙恶。\n惊藏青冢寒草疏，偷渡黄河夜冰薄。忽闻汉军鼙鼓声，\n路傍走出再拜迎。游骑不听能汉语，将军遂缚作蕃生。\n配向东南卑湿地，定无存恤空防备。念此吞声仰诉天，\n若为辛苦度残年。凉原乡井不得见，胡地妻儿虚弃捐。\n没蕃被囚思汉土，归汉被劫为蕃虏。早知如此悔归来，\n两地宁如一处苦。缚戎人，戎人之中我苦辛。\n自古此冤应未有，汉心汉语吐蕃身。\n\n.\n.\n【百炼镜－辨皇王鉴也】白居易\n百炼镜，镕范非常规，日辰处所灵且祇。江心波上舟中铸，\n五月五日日午时。琼粉金膏磨莹已，化为一片秋潭水。\n镜成将献蓬莱宫，扬州长吏手自封。人间臣妾不合照，\n背有九五飞天龙。人人呼为天子镜，我有一言闻太宗。\n太宗常以人为镜，鉴古鉴今不鉴容。四海安危居掌内，\n百王治乱悬心中。乃知天子别有镜，不是扬州百炼铜。\n\n【两朱阁－刺佛寺浸多也】白居易\n两朱阁，南北相对起。借问何人家，贞元双帝子。\n帝子吹箫双得仙，五云飘飖飞上天。第宅亭台不将去，\n化为佛寺在人间。妆阁伎楼何寂静，柳似舞腰池似镜。\n花落黄昏悄悄时，不闻歌吹闻钟磬。寺门敕榜金字书，\n尼院佛庭宽有馀。青苔明月多闲地，比屋疲人无处居。\n忆昨平阳宅初置，吞并平人几家地。仙去双双作梵宫，\n渐恐人间尽为寺。\n\n【涧底松－念寒俊也】白居易\n有松百尺大十围，生在涧底寒且卑。涧深山险人路绝，\n老死不逢工度之。天子明堂欠梁木，此求彼有两不知。\n谁喻苍苍造物意，但与之材不与地。金张世禄原宪贫，\n牛衣寒贱貂蝉贵。貂蝉与牛衣，高下虽有殊。高者未必贤，\n下者未必愚。君不见沉沉海底生珊瑚，历历天上种白榆。\n\n【红线毯－忧蚕桑之费也】白居易\n红线毯，择茧缲丝清水煮，拣丝练线红蓝染。\n染为红线红于蓝，织作披香殿上毯。披香殿广十丈馀，\n红线织成可殿铺。彩丝茸茸香拂拂，线软花虚不胜物。\n美人蹋上歌舞来，罗袜绣鞋随步没。太原毯涩毳缕硬，\n蜀都褥薄锦花冷，不如此毯温且柔，年年十月来宣州。\n宣城太守加样织，自谓为臣能竭力。百夫同担进宫中，\n线厚丝多卷不得。宣城太守知不知，一丈毯，千两丝。\n地不知寒人要暖，少夺人衣作地衣。\n\n【缭绫－念女工之劳也】白居易\n缭绫缭绫何所似，不似罗绡与纨绮。应似天台山上月明前，\n四十五尺瀑布泉。中有文章又奇绝，地铺白烟花簇雪。\n织者何人衣者谁，越溪寒女汉宫姬。去年中使宣口敕，\n天上取样人间织。织为云外秋雁行，染作江南春水色。\n广裁衫袖长制裙，金斗熨波刀翦纹。异彩奇文相隐映，\n转侧看花花不定。昭阳舞人恩正深，春衣一对直千金。\n汗沾粉污不再著，曳土蹋泥无惜心。缭绫织成费功绩，\n莫比寻常缯与帛。丝细缲多女手疼，扎扎千声不盈尺。\n昭阳殿里歌舞人。若见织时应也惜。\n\n【母别子－刺新间旧也】白居易\n母别子，子别母，白日无光哭声苦。关西骠骑大将军，\n去年破虏新策勋。敕赐金钱二百万，洛阳迎得如花人。\n新人迎来旧人弃，掌上莲花眼中刺。迎新弃旧未足悲，\n悲在君家留两儿。一始扶行一初坐，坐啼行哭牵人衣。\n以汝夫妇新燕婉，使我母子生别离。不如林中乌与鹊，\n母不失雏雄伴雌。应似园中桃李树，花落随风子在枝。\n新人新人听我语，洛阳无限红楼女。但愿将军重立功，\n更有新人胜于汝。\n\n【时世妆－儆戎也】白居易\n时世妆，时世妆，出自城中传四方。时世流行无远近，\n腮不施朱面无粉。乌膏注唇唇似泥，双眉画作八字低。\n妍媸黑白失本态，妆成尽似含悲啼。圆鬟无鬓堆髻样，\n斜红不晕赭面状。昔闻被发伊川中，辛有见之知有戎。\n元和妆梳君记取，髻堆面赭非华风。\n\n【盐商妇－恶幸人也】白居易\n盐商妇，多金帛，不事田农与蚕绩。南北东西不失家，\n风水为乡船作宅。本是扬州小家女，嫁得西江大商客。\n绿鬟富去金钗多，皓腕肥来银钏窄。前呼苍头后叱婢，\n问尔因何得如此。婿作盐商十五年，不属州县属天子。\n每年盐利入官时，少入官家多入私。官家利薄私家厚，\n盐铁尚书远不知。何况江头鱼米贱，红脍黄橙香稻饭。\n饱食浓妆倚柁楼，两朵红腮花欲绽。盐商妇，有幸嫁盐商。\n终朝美饭食，终岁好衣裳。好衣美食来何处，\n亦须惭愧桑弘羊。桑弘羊，死已久，不独汉时今亦有。\n\n【井底引银瓶－止淫奔也】白居易\n井底引银瓶，银瓶欲上丝绳绝。石上磨玉簪，\n玉簪欲成中央折。瓶沉簪折知奈何，似妾今朝与君别。\n忆昔在家为女时，人言举动有殊姿。婵娟两鬓秋蝉翼，\n宛转双蛾远山色。笑随戏伴后园中，此时与君未相识。\n妾弄青梅凭短墙，君骑白马傍垂杨。墙头马上遥相顾，\n一见知君即断肠。知君断肠共君语，君指南山松柏树。\n感君松柏化为心，闇合双鬟逐君去。到君家舍五六年，\n君家大人频有言。聘则为妻奔是妾，不堪主祀奉蘋蘩。\n终知君家不可住，其奈出门无去处。岂无父母在高堂，\n亦有亲情满故乡。潜来更不通消息，今日悲羞归不得。\n为君一日恩，误妾百年身。寄言痴小人家女，\n慎勿将身轻许人。\n\n【紫毫笔－讥失职也】白居易\n紫毫笔，尖如锥兮利如刀。江南石上有老兔，\n吃竹饮泉生紫毫。宣城之人采为笔，千万毛中拣一毫。\n毫虽轻，功甚重。管勒工名充岁贡，君兮臣兮勿轻用。\n勿轻用，将何如，愿赐东西府御史，愿颁左右台起居。\n搦管趋入黄金阙，抽毫立在白玉除。臣有奸邪正衙奏，\n君有动言直笔书。起居郎，侍御史，尔知紫毫不易致。\n每岁宣城进笔时，紫毫之价如金贵。慎勿空将弹失仪，\n慎勿空将录制词。\n\n【草茫茫－惩厚葬也】白居易\n草茫茫，土苍苍。苍苍茫茫在何处，骊山脚下秦皇墓。\n墓中下涸二重泉，当时自以为深固。下流水银象江海，\n上缀珠光作乌兔。别为天地于其间，拟将富贵随身去。\n一朝盗掘坟陵破，龙椁神堂三月火。可怜宝玉归人间，\n暂借泉中买身祸。奢者狼藉俭者安，一凶一吉在眼前。\n凭君回首向南望，汉文葬在霸陵原。\n\n【黑潭龙－疾贪吏也】白居易\n黑潭水深黑如墨，传有神龙人不识。潭上架屋官立祠，\n龙不能神人神之。丰凶水旱与疾疫，乡里皆言龙所为。\n家家养豚漉清酒，朝祈暮赛依巫口。神之来兮风飘飘，\n纸钱动兮锦伞摇。神之去兮风亦静，香火灭兮杯盘冷。\n肉堆潭岸石，酒泼庙前草。不知龙神享几多，\n林鼠山狐长醉饱。狐何幸，豚何辜，年年杀豚将喂狐。\n狐假龙神食豚尽，九重泉底龙知无。\n\n【秦吉了－哀冤民也】白居易\n秦吉了，出南中，彩毛青黑花颈红。耳聪心慧舌端巧，\n鸟语人言无不通。昨日长爪鸢，今朝大觜乌。\n鸢捎乳燕一窠覆，乌啄母鸡双眼枯。鸡号堕地燕惊去，\n然后拾卵攫其雏。岂无雕与鹗，嗉中肉饱不肯搏。\n亦有鸾鹤群，闲立高飏如不闻。秦吉了，人云尔是能言鸟，\n岂不见鸡燕之冤苦。吾闻凤凰百鸟主，\n尔竟不为凤凰之前致一言，安用噪噪闲言语。\n\n【感时】白居易\n朝见日上天，暮见日入地。不觉明镜中，忽年三十四。\n勿言身未老，冉冉行将至。白发虽未生，朱颜已先悴。\n人生讵几何，在世犹如寄。虽有七十期，十人无一二。\n今我犹未悟，往往不适意。胡为方寸间，不贮浩然气。\n贫贱非不恶，道在何足避。富贵非不爱，时来当自致。\n所以达人心，外物不能累。唯当饮美酒，终日陶陶醉。\n斯言胜金玉，佩服无失坠。\n\n【永崇里观居】白居易\n季夏中气候，烦暑自此收。萧飒风雨天，蝉声暮啾啾。\n永崇里巷静，华阳观院幽。轩车不到处，满地槐花秋。\n年光忽冉冉，世事本悠悠。何必待衰老，然后悟浮休。\n真隐岂长远，至道在冥搜。身虽世界住，心与虚无游。\n朝饥有蔬食，夜寒有布裘。幸免冻与馁，此外复何求。\n寡欲虽少病，乐天心不忧。何以明吾志，周易在床头。\n\n【病假中南亭闲望】白居易\n欹枕不视事，两日门掩关。始知吏役身，不病不得闲。\n闲意不在远，小亭方丈间。西檐竹梢上，坐见太白山。\n遥愧峰上云，对此尘中颜。\n\n【前庭凉夜】白居易\n露簟色似玉，风幌影如波。坐愁树叶落，中庭明月多。\n\n【早秋独夜】白居易\n井梧凉叶动，邻杵秋声发。独向檐下眠，觉来半床月。\n\n【冬夜与钱员外同直禁中】白居易\n夜深草诏罢，霜月凄凛凛。欲卧暖残杯，灯前相对饮。\n连铺青缣被，封置通中枕。仿佛百馀宵，与君同此寝。\n\n【夏日独直，寄萧侍御】白居易\n宪台文法地，翰林清切司。鹰猜课野鹤，骥德责山麋。\n课责虽不同，同归非所宜。是以方寸内，忽忽暗相思。\n夏日独上直，日长何所为。澹然无他念，虚静是吾师。\n形委有事牵，心与无事期。中臆一以旷，外累都若遗。\n地贵身不觉，意闲境来随。但对松与竹，如在山中时。\n情性聊自适，吟咏偶成诗。此意非夫子，馀人多不知。\n\n【禁中】白居易\n门严九重静，窗幽一室闲。好是修心处，何必在深山。\n\n【初除户曹，喜而言志】白居易\n诏授户曹掾，捧诏感君恩。感恩非为己，禄养及吾亲。\n弟兄俱簪笏，新妇俨衣巾。罗列高堂下，拜庆正纷纷。\n俸钱四五万，月可奉晨昏。廪禄二百石，岁可盈仓囷。\n喧喧车马来，贺客满我门。不以我为贪，知我家内贫。\n置酒延贺客，客容亦欢欣。笑云今日后，不复忧空尊。\n答云如君言，愿君少逡巡。我有平生志，醉后为君陈。\n人生百岁期，七十有几人。浮荣及虚位，皆是身之宾。\n唯有衣与食，此事粗关身。苟免饥寒外，馀物尽浮云。\n\n【禁中晓卧，因怀王起居】白居易\n迟迟禁漏尽，悄悄暝鸦喧。夜雨槐花落，微凉卧北轩。\n曙灯残未灭，风帘闲自翻。每一得静境，思与故人言。\n\n【寄李十一建】白居易\n外事牵我形，外物诱我情。李君别来久，褊吝从中生。\n忆昨访君时，立马扣柴荆。有时君未起，稚子喜先迎。\n连步笑出门，衣翻冠或倾。扫阶苔纹绿，拂榻藤阴清。\n家酝及春熟，园葵乘露烹。看山东亭坐，待月南原行。\n门静唯鸟语，坊远少鼓声。相对尽日言，不及利与名。\n分手来几时，明月三四盈。别时残花落，及此新蝉鸣。\n芳岁忽已晚，离抱怅未平。岂不思命驾，吏职坐相萦。\n前时君有期，访我来山城。心赏久云阻，言约无自轻。\n相去幸非远，走马一日程。\n\n【酬杨九弘贞长安病中见寄】白居易\n伏枕君寂寂，折腰我营营。所嗟经时别，相去一宿程。\n携手昨何时，昆明春水平。离郡来几日，太白夏云生。\n之子未得意，贫病客帝城。贫坚志士节，病长高人情。\n隐几自恬澹，闭门无送迎。龙卧心有待，鹤瘦貌弥清。\n清机发为文，投我如振琼。何以慰饥渴，捧之吟一声。\n\n【赠王山人】白居易\n闻君减寝食，日听神仙说。暗待非常人，潜求长生诀。\n言长本对短，未离生死辙。假使得长生，才能胜夭折。\n松树千年朽，槿花一日歇。毕竟共虚空，何须夸岁月。\n彭殇徒自异，生死终无别。不如学无生，无生即无灭。\n\n【赠能七伦】白居易\n涧松高百寻，四时寒森森。临风有清韵，向日无曲阴。\n如何时俗人，但赏桃李林。岂不知坚贞，芳馨诱其心。\n能生学为文，气高功亦深。手中一百篇，句句披沙金。\n苦节二十年，无人振陆沉。今我尚贫贱，徒为尔知音。\n\n【及第后归觐，留别诸同年】白居易\n十年常苦学，一上谬成名。擢第未为贵，贺亲方始荣。\n时辈六七人，送我出帝城。轩车动行色，丝管举离声。\n得意减别恨，半酣轻远程。翩翩马蹄疾，春日归乡情。\n\n【郊陶潜体诗十六首】白居易\n不动者厚地，不息者高天。无穷者日月，长在者山川。\n松柏与龟鹤，其寿皆千年。嗟嗟群物中，而人独不然。\n早出向朝市，暮已归下泉。形质及寿命，危脆若浮烟。\n尧舜与周孔，古来称圣贤。借问今何在，一去亦不还。\n我无不死药，万万随化迁。所未定知者，修短迟速间。\n幸及身健日，当歌一尊前。何必待人劝，持此自为欢。\n\n翳翳逾月阴，沉沉连日雨。开帘望天色，黄云暗如土。\n行潦毁我墉，疾风坏我宇。蓬莠生庭院，泥涂失场圃。\n村深绝宾客，窗晦无俦侣。尽日不下床，跳蛙时入户。\n出门无所往，入室还独处。不以酒自娱，块然与谁语。\n\n朝饮一杯酒，冥心合元化。兀然无所思，日高尚闲卧。\n暮读一卷书，会意如嘉话。欣然有所遇，夜深犹独坐。\n又得琴上趣，安弦有馀暇。复多诗中狂，下笔不能罢。\n唯兹三四事，持用度昼夜。所以阴雨中，经旬不出舍。\n始悟独往人，心安时亦过。\n\n东家采桑妇，雨来苦愁悲。蔟蚕北堂前，雨冷不成丝。\n西家荷锄叟，雨来亦怨咨。种豆南山下，雨多落为萁。\n而我独何幸，酝酒本无期。及此多雨日，正遇新熟时。\n开瓶泻尊中，玉液黄金脂。持玩已可悦，欢尝有馀滋。\n一酌发好容，再酌开愁眉。连延四五酌，酣畅入四肢。\n忽然遗我物，谁复分是非。是时连夕雨，酩酊无所知。\n人心苦颠倒，反为忧者嗤。\n\n朝亦独醉歌，暮亦独醉睡。未尽一壶酒，已成三独醉。\n勿嫌饮太少，且喜欢易致。一杯复两杯，多不过三四。\n便得心中适，尽忘身外事。更复强一杯，陶然遗万累。\n一饮一石者，徒以多为贵。及其酩酊时，与我亦无异。\n笑谢多饮者，酒钱徒自费。\n\n天秋无片云，地静无纤尘。团团新晴月，林外生白轮。\n忆昨阴霖天，连连三四旬。赖逢家酝熟，不觉过朝昏。\n私言雨霁后，可以罢馀尊。及对新月色，不醉亦愁人。\n床头残酒榼，欲尽味弥淳。携置南檐下，举酌自殷勤。\n清光入杯杓，白露生衣巾。乃知阴与晴，安可无此君。\n我有乐府诗，成来人未闻。今宵醉有兴，狂咏惊四邻。\n独赏犹复尔，何况有交亲。\n\n中秋三五夜，明月在前轩。临觞忽不饮，忆我平生欢。\n我有同心人，邈邈崔与钱。我有忘形友，迢迢李与元。\n或飞青云上，或落江湖间。与我不相见，于今四五年。\n我无缩地术，君非驭风仙。安得明月下，四人来晤言。\n良夜信难得，佳期杳无缘。明月又不驻，渐下西南天。\n岂无他时会，惜此清景前。\n\n家酝饮已尽，村中无酒酤。坐愁今夜醒，其奈秋怀何。\n有客忽叩门，言语一何佳。云是南村叟，挈榼来相过。\n且喜尊不燥，安问少与多。重阳虽已过，篱菊有残花。\n欢来苦昼短，不觉夕阳斜。老人勿遽起，且待新月华。\n客去有馀趣，竟夕独酣歌。\n\n原生衣百结，颜子食一箪。欢然乐其志，有以忘饥寒。\n今我何人哉，德不及先贤。衣食幸相属，胡为不自安。\n况兹清渭曲，居处安且闲。榆柳百馀树，茅茨十数间。\n寒负檐下日，热濯涧底泉。日出犹未起，日入已复眠。\n西风满村巷，清凉八月天。但有鸡犬声，不闻车马喧。\n时倾一尊酒，坐望东南山。稚侄初学步，牵衣戏我前。\n即此自可乐，庶几颜与原。\n\n湛湛尊中酒，有功不自伐。不伐人不知，我今代其说。\n良将临大敌，前驱千万卒。一箪投河饮，赴死心如一。\n壮士磨匕首，勇愤气蓬勃。一酣忘报雠，四体如无骨。\n东海杀孝妇，天旱逾年月。一酌酹其魂，通宵雨不歇。\n咸阳秦狱气，冤痛结为物。千岁不肯散，一沃亦销失。\n况兹儿女恨，及彼幽忧疾。快饮无不消，如霜得春日。\n方知麹糵灵，万物无与匹。\n\n烟霞隔悬圃，风波限瀛洲。我岂不欲往，大海路阻修。\n神仙但闻说，灵药不可求。长生无得者，举世如蜉蝣。\n逝者不重回，存者难久留。踟蹰未死间，何苦怀百忧。\n念此忽内热，坐看成白头。举杯还独饮，顾影自献酬。\n心与口相约，未醉勿言休。今朝不尽醉，知有明朝不。\n不见郭门外，累累坟与丘。月明愁杀人，黄蒿风飕飕。\n死者若有知，悔不秉烛游。\n\n吾闻浔阳郡，昔有陶征君。爱酒不爱名，忧醒不忧贫。\n尝为彭泽令，在官才八旬。愀然忽不乐，挂印著公门。\n口吟归去来，头戴漉酒巾。人吏留不得，直入故山云。\n归来五柳下，还以酒养真。人间荣与利，摆落如泥尘。\n先生去已久，纸墨有遗文。篇篇劝我饮，此外无所云。\n我从老大来，窃慕其为人。其他不可及，且效醉昏昏。\n\n楚王疑忠臣，江南放屈平。晋朝轻高士，林下弃刘伶。\n一人常独醉，一人常独醒。醒者多苦志，醉者多欢情。\n欢情信独善，苦志竟何成。兀傲瓮间卧，憔悴泽畔行。\n彼忧而此乐，道理甚分明。愿君且饮酒，勿思身后名。\n\n有一燕赵士，言貌甚奇瑰。日日酒家去，脱衣典数杯。\n问君何落拓，云仆生草莱。地寒命且薄，徒抱王佐才。\n岂无济时策，君门乏良媒。三献寝不报，迟迟空手回。\n亦有同门生，先升青云梯。贵贱交道绝，朱门叩不开。\n及归种禾黍，三岁旱为灾。入山烧黄白，一旦化为灰。\n蹉跎五十馀，生世苦不谐。处处去不得，却归酒中来。\n\n南巷有贵人，高盖驷马车。我问何所苦，四十垂白须。\n答云君不知，位重多忧虞。北里有寒士，瓮牖绳为枢。\n出扶桑枣杖，入卧蜗牛庐。散贱无忧患，心安体亦舒。\n东邻有富翁，藏货遍五都。东京收粟帛，西市鬻金珠。\n朝营暮计算，昼夜不安居。西舍有贫者，匹妇配匹夫。\n布裙行赁舂，裋褐坐佣书。以此求口食，一饱欣有馀。\n贵贱与贫富，高下虽有殊。忧乐与利害，彼此不相逾。\n是以达人观，万化同一途。但未知生死，胜负两何如。\n迟疑未知间，且以酒为娱。\n\n济水澄而洁，河水浑而黄。交流列四渎，清浊不相伤。\n太公战牧野，伯夷饿首阳。同时号贤圣，进退不相妨。\n谓天不爱民，胡为生稻粱。谓天果爱民，胡为生豺狼。\n谓神福善人，孔圣竟栖遑。谓神祸淫人，暴秦终霸王。\n颜回与黄宪，何辜早夭亡。蝮蛇与鸩鸟，何得寿延长。\n物理不可测，神道亦难量。举头仰问天，天色但苍苍。\n唯当多种黍，日醉手中觞。\n\n.\n.\n【渭上偶钓】白居易\n渭水如镜色，中有鲤与鲂。偶持一竿竹，悬钓在其傍。\n微风吹钓丝，袅袅十尺长。谁知对鱼坐，心在无何乡。\n昔有白头人，亦钓此渭阳。钓人不钓鱼，七十得文王。\n况我垂钓意，人鱼又兼忘。无机两不得，但弄秋水光。\n兴尽钓亦罢，归来饮我觞。\n\n【春眠】白居易\n新浴肢体畅，独寝神魂安。况因夜深坐，遂成日高眠。\n春被薄亦暖，朝窗深更闲。却忘人间事，似得枕上仙。\n至适无梦想，大和难名言。全胜彭泽醉，欲敌曹溪禅。\n何物呼我觉，伯劳声关关。起来妻子笑，生计春茫然。\n\n【夏日】白居易\n东窗晚无热，北户凉有风。尽日坐复卧，不离一室中。\n中心本无系，亦与出门同。\n\n【首夏病间】白居易\n我生来几时，万有四千日。自省于其间，非忧即有疾。\n老去虑渐息，年来病初愈。忽喜身与心，泰然两无苦。\n况兹孟夏月，清和好时节。微风吹袷衣，不寒复不热。\n移榻树阴下，竟日何所为。或饮一瓯茗，或吟两句诗。\n内无忧患迫，外无职役羁。此日不自适，何时是适时。\n\n【兰若寓居】白居易\n名宦老慵求，退身安草野。家园病懒归，寄居在兰若。\n薜衣换簪组，藜杖代车马。行止辄自由，甚觉身潇洒。\n晨游南坞上，夜息东庵下。人间千万事，无有关心者。\n\n【闻庾七左降，因咏所怀】白居易\n我病卧渭北，君老谪巴东。相悲一长叹，薄命与君同。\n既叹还自哂，哂叹两未终。后心诮前意，所见何迷蒙。\n人生大块间，如鸿毛在风。或飘青云上，或落泥涂中。\n衮服相天下，倘来非我通。布衣委草莽，偶去非吾穷。\n外物不可必，中怀须自空。无令怏怏气，留滞在心胸。\n\n【归田三首】白居易\n人生何所欲，所欲唯两端。中人爱富贵，高士慕神仙。\n神仙须有籍，富贵亦在天。莫恋长安道，莫寻方丈山。\n西京尘浩浩，东海浪漫漫。金门不可入，琪树何由攀。\n不如归山下，如法种春田。\n\n种田意已决，决意复何如。卖马买犊使，徒步归田庐。\n迎春治耒耜，候雨辟菑畬。策杖田头立，躬亲课仆夫。\n吾闻老农言，为稼慎在初。所施不卤莽，其报必有馀。\n上求奉王税，下望备家储。安得放慵惰，拱手而曳裾。\n学农未为鄙，亲友勿笑余。更待明年后，自拟执犁锄。\n\n三十为近臣，腰间鸣佩玉。四十为野夫，田中学锄谷。\n何言十年内，变化如此速。此理固是常，穷通相倚伏。\n为鱼有深水，为鸟有高木。何必守一方，窘然自牵束。\n化吾足为马，吾因以行陆。化吾手为弹，吾因以求肉。\n形骸为异物，委顺心犹足。幸得且归农，安知不为福。\n况吾行欲老，瞥若风前烛。孰能俄顷间，将心系荣辱。\n\n【寄同病者】白居易\n三十生二毛，早衰为沉疴。四十官七品，拙宦非由他。\n年颜日枯槁，时命日蹉跎。岂独我如此，圣贤无奈何。\n回观亲旧中，举目尤可嗟。或有终老者，沉贱如泥沙。\n或有始壮者，飘忽如风花。穷饿与夭促，不如我者多。\n以此反自慰，常得心平和。寄言同病者，回叹且为歌。\n\n【村雪夜坐】白居易\n南窗背灯坐，风霰暗纷纷。寂寞深村夜，残雁雪中闻。\n\n【观稼】白居易\n世役不我牵，身心常自若。晚出看田亩，闲行旁村落。\n累累绕场稼，啧啧群飞雀。年丰岂独人，禽鸟声亦乐。\n田翁逢我喜，默起具尊杓。敛手笑相延，社酒有残酌。\n愧兹勤且敬，藜杖为淹泊。言动任天真，未觉农人恶。\n停杯问生事，夫种妻儿获。筋力苦疲劳，衣食常单薄。\n自惭禄仕者，曾不营农作。饥食无所劳，何殊卫人鹤。\n\n【新构亭台，示诸弟侄】白居易\n平台高数尺，台上结茅茨。东西疏二牖，南北开两扉。\n芦帘前后卷，竹簟当中施。清泠白石枕，疏凉黄葛衣。\n开襟向风坐，夏日如秋时。啸傲颇有趣，窥临不知疲。\n东窗对华山，三峰碧参差。南檐当渭水，卧见云帆飞。\n仰摘枝上果，俯折畦中葵。足以充饥渴，何必慕甘肥。\n况有好群从，旦夕相追随。\n\n【东坡秋意，寄元八】白居易\n寥落野陂畔，独行思有馀。秋荷病叶上，白露大如珠。\n忽忆同赏地，曲江东北隅。秋池少游客，唯我与君俱。\n啼蛩隐红蓼，瘦马蹋青芜。当时与今日，俱是暮秋初。\n节物苦相似，时景亦无馀。唯有人分散，经年不得书。\n\n【咏拙】白居易\n所禀有巧拙，不可改者性。所赋有厚薄，不可移者命。\n我性愚且蠢，我命薄且屯。问我何以知，所知良有因。\n亦曾举两足，学人蹋红尘。从兹知性拙，不解转如轮。\n亦曾奋六翮，高飞到青云。从兹知命薄，摧落不逡巡。\n慕贵而厌贱，乐富而恶贫。同此天地间，我岂异于人。\n性命苟如此，反则成苦辛。以此自安分，虽穷每欣欣。\n葺茅为我庐，编蓬为我门。缝布作袍被，种谷充盘飧。\n静读古人书，闲钓清渭滨。优哉复游哉，聊以终吾身。\n\n【冬夜】白居易\n家贫亲爱散，身病交游罢。眼前无一人，独掩村斋卧。\n冷落灯火暗，离披帘幕破。策策窗户前，又闻新雪下。\n长年渐省睡，夜半起端坐。不学坐忘心，寂莫安可过。\n兀然身寄世，浩然心委化。如此来四年，一千三百夜。\n\n【友人夜访】白居易\n檐间清风簟，松下明月杯。幽意正如此，况乃故人来。\n\n【朝归书寄元八】白居易\n进入阁前拜，退就廊下餐。归来昭国里，人卧马歇鞍。\n却睡至日午，起坐心浩然。况当好时节，雨后清和天。\n柿树绿阴合，王家庭院宽。瓶中鄠县酒，墙上终南山。\n独眠仍独坐，开襟当风前。禅师与诗客，次第来相看。\n要语连夜语，须眠终日眠。除非奉朝谒，此外无别牵。\n年长身且健，官贫心甚安。幸无急病痛，不至苦饥寒。\n自此聊以适，外缘不能干。唯应静者信，难为动者言。\n台中元侍御，早晚作郎官。未作郎官际，无人相伴闲。\n\n【昭国闲居】白居易\n贫闲日高起，门巷昼寂寂。时暑放朝参，天阴少人客。\n槐花满田地，仅绝人行迹。独在一床眠，清凉风雨夕。\n勿嫌坊曲远，近即多牵役。勿嫌禄俸薄，厚即多忧责。\n平生尚恬旷，老大宜安适。何以养吾真，官闲居处僻。\n\n【赠杓直】白居易\n世路重禄位，栖栖者孔宣。人情爱年寿，夭死者颜渊。\n二人如何人，不奈命与天。我今信多幸，抚己愧前贤。\n已年四十四，又为五品官。况兹知足外，别有所安焉。\n早年以身代，直赴逍遥篇。近岁将心地，回向南宗禅。\n外顺世间法，内脱区中缘。进不厌朝市，退不恋人寰。\n自吾得此心，投足无不安。体非导引适，意无江湖闲。\n有兴或饮酒，无事多掩关。寂静夜深坐，安稳日高眠。\n秋不苦长夜，春不惜流年。委形老小外，忘怀生死间。\n昨日共君语，与余心膂然。此道不可道，因君聊强言。\n\n【题玉泉寺】白居易\n湛湛玉泉色，悠悠浮云身。闲心对定水，清净两无尘。\n手把青筇杖，头戴白纶巾。兴尽下山去，知我是谁人。\n\n【舟行（江州路上作）】白居易\n帆影日渐高，闲眠犹未起。起问鼓枻人，已行三十里。\n船头有行灶，炊稻烹红鲤。饱食起婆娑，盥漱秋江水。\n平生沧浪意，一旦来游此。何况不失家，舟中载妻子。\n\n【江州雪】白居易\n新雪满前山，初晴好天气。日西骑马出，忽有京都意。\n城柳方缀花，檐冰才结穗。须臾风日暖，处处皆飘坠。\n行吟赏未足，坐叹销何易。犹胜岭南看，雰雰不到地。\n\n.\n.\n【访陶公旧宅】白居易\n垢尘不污玉，灵凤不啄膻。呜呼陶靖节，生彼晋宋间。\n心实有所守，口终不能言。永惟孤竹子，拂衣首阳山。\n夷齐各一身，穷饿未为难。先生有五男，与之同饥寒。\n肠中食不充，身上衣不完。连征竟不起，斯可谓真贤。\n我生君之后，相去五百年。每读五柳传，目想心拳拳。\n昔常咏遗风，著为十六篇。今来访故宅，森若君在前。\n不慕尊有酒，不慕琴无弦。慕君遗荣利，老死此丘园。\n柴桑古村落，栗里旧山川。不见篱下菊，但馀墟中烟。\n子孙虽无闻，族氏犹未迁。每逢姓陶人，使我心依然。\n\n【泛湓水】白居易\n四月未全热，麦凉江气秋。湖山处处好，最爱湓水头。\n湓水从东来，一派入江流。可怜似萦带，中有随风舟。\n命酒一临泛，舍鞍扬棹讴。放回岸傍马，去逐波间鸥。\n烟浪始渺渺，风襟亦悠悠。初疑上河汉，中若寻瀛洲。\n汀树绿拂地，沙草芳未休。青萝与紫葛，枝蔓垂相樛。\n系缆步平岸，回头望江州。城雉映水见，隐隐如蜃楼。\n日入意未尽，将归复少留。到官行半岁，今日方一游。\n此地来何暮，可以写吾忧。\n\n【官舍内新凿小池】白居易\n帘下开小池，盈盈水方积。中底铺白沙，四隅甃青石。\n勿言不深广，但取幽人适。泛滟微雨朝，泓澄明月夕。\n岂无大江水，波浪连天白。未如床席间，方丈深盈尺。\n清浅可狎弄，昏烦聊漱涤。最爱晓暝时，一片秋天碧。\n\n【读谢灵运诗】白居易\n吾闻达士道，穷通顺冥数。通乃朝廷来，穷即江湖去。\n谢公才廓落，与世不相遇。壮志郁不用，须有所泄处。\n泄为山水诗，逸韵谐奇趣。大必笼天海，细不遗草树。\n岂惟玩景物，亦欲摅心素。往往即事中，未能忘兴谕。\n因知康乐作，不独在章句。\n\n【约心】白居易\n黑鬓丝雪侵，青袍尘土涴。兀兀复腾腾，江城一上佐。\n朝就高斋上，熏然负暄卧。晚下小池前，澹然临水坐。\n已约终身心，长如今日过。\n\n【早春】白居易\n雪消冰又释，景和风复暄。满庭田地湿，荠叶生墙根。\n官舍悄无事，日西斜掩门。不开庄老卷，欲与何人言。\n\n【睡起晏坐】白居易\n后亭昼眠足，起坐春景暮。新觉眼犹昏，无思心正住。\n澹寂归一性，虚闲遗万虑。了然此时心，无物可譬喻。\n本是无有乡，亦名不用处。行禅与坐忘，同归无异路。\n\n【春游二林寺】白居易\n下马二林寺，翛然进轻策。朝为公府吏，暮作灵山客。\n二月匡庐北，冰雪始消释。阳丛抽茗芽，阴窦泄泉脉。\n熙熙风土暖，蔼蔼云岚积。散作万壑春，凝为一气碧。\n身闲易飘泊，官散无牵迫。缅彼十八人，古今同此适。\n是年淮寇起，处处兴兵革。智士劳思谋，戎臣苦征役。\n独有不才者，山中弄泉石。\n\n【岁暮】白居易\n已任时命去，亦从岁月除。中心一调伏，外累尽空虚。\n名宦意已矣，林泉计何如。拟近东林寺，溪边结一庐。\n\n【栽杉】白居易\n劲叶森利剑，孤茎挺端标。才高四五尺，势若干青霄。\n移栽东窗前，爱尔寒不凋。病夫卧相对，日夕闲萧萧。\n昨为山中树，今为檐下条。虽然遇赏玩，无乃近尘嚣。\n犹胜涧谷底，埋没随众樵。不见郁郁松，委质山上苗。\n\n【咏意】白居易\n常闻南华经，巧劳智忧愁。不如无能者，饱食但遨游。\n平生爱慕道，今日近此流。自来浔阳郡，四序忽已周。\n不分物黑白，但与时沉浮。朝餐夕安寝，用是为身谋。\n此外即闲放，时寻山水幽。春游慧远寺，秋上庾公楼。\n或吟诗一章，或饮茶一瓯。身心一无系，浩浩如虚舟。\n富贵亦有苦，苦在心危忧。贫贱亦有乐，乐在身自由。\n\n【游石门涧】白居易\n石门无旧径，披榛访遗迹。时逢山水秋，清辉如古昔。\n常闻慧远辈，题诗此岩壁。云覆莓苔封，苍然无处觅。\n萧疏野生竹，崩剥多年石。自从东晋后，无复人游历。\n独有秋涧声，潺湲空旦夕。\n\n【白云期（黄石岩下作）】白居易\n三十气太壮，胸中多是非。六十身太老，四体不支持。\n四十至五十，正是退闲时。年长识命分，心慵少营为。\n见酒兴犹在，登山力未衰。吾年幸当此，且与白云期。\n\n【烹葵】白居易\n昨卧不夕食，今起乃朝饥。贫厨何所有，炊稻烹秋葵。\n红粒香复软，绿英滑且肥。饥来止于饱，饱后复何思。\n忆昔荣遇日，迨今穷退时。今亦不冻馁，昔亦无馀资。\n口既不减食，身又不减衣。抚心私自问，何者是荣衰。\n勿学常人意，其间分是非。\n\n【闭关】白居易\n我心忘世久，世亦不我干。遂成一无事，因得长掩关。\n掩关来几时，仿佛二三年。著书已盈帙，生子欲能言。\n始悟身向老，复悲世多艰。回顾趋时者，役役尘壤间。\n岁暮竟何得，不如且安闲。\n\n【截树】白居易\n种树当前轩，树高柯叶繁。惜哉远山色，隐此蒙笼间。\n一朝持斧斤，手自截其端。万叶落头上，千峰来面前。\n忽似决云雾，豁达睹青天。又如所念人，久别一款颜。\n始有清风至，稍见飞鸟还。开怀东南望，目远心辽然。\n人各有偏好，物莫能两全。岂不爱柔条，不如见青山。\n\n【题座隅】白居易\n手不任执殳，肩不能荷锄。量力揆所用，曾不敌一夫。\n幸因笔砚功，得升仕进途。历官凡五六，禄俸及妻孥。\n左右有兼仆，出入有单车。自奉虽不厚，亦不至饥劬。\n若有人及此，傍观为何如。虽贤亦为幸，况我鄙且愚。\n伯夷古贤人，鲁山亦其徒。时哉无奈何，俱化为饿殍。\n念彼益自愧，不敢忘斯须。平生荣利心，破灭无遗馀。\n犹恐尘妄起，题此于座隅。\n\n【垂钓】白居易\n临水一长啸，忽思十年初。三登甲乙第，一入承明庐。\n浮生多变化，外事有盈虚。今来伴江叟，沙头坐钓鱼。\n\n【赎鸡】白居易\n清晨临江望，水禽正喧繁。凫雁与鸥鹭，游飏戏朝暾。\n适有鬻鸡者，挈之来远村。飞鸣彼何乐，窘束此何冤。\n喔喔十四雏，罩缚同一樊。足伤金距缩，头抢花冠翻。\n经宿废饮啄，日高诣屠门。迟回未死间，饥渴欲相吞。\n常慕古人道，仁信及鱼豚。见兹生恻隐，赎放双林园。\n开笼解索时，鸡鸡听我言。与尔镪三百，小惠何足论。\n莫学衔环雀，崎岖谩报恩。\n\n【食后】白居易\n食罢一觉睡，起来两瓯茶。举头看日影，已复西南斜。\n乐人惜日促，忧人厌年赊。无忧无乐者，长短任生涯。\n\n【山下宿】白居易\n独到山下宿，静向月中行。何处水边碓，夜舂云母声。\n\n【闲居】白居易\n肺病不饮酒，眼昏不读书。端然无所作，身意闲有馀。\n鸡栖篱落晚，雪映林木疏。幽独已云极，何必山中居。\n\n【咏怀】白居易\n冉牛与颜渊，卞和与马迁。或罹天六极，或被人刑残。\n顾我信为幸，百骸且完全。五十不为夭，吾今欠数年。\n知分心自足，委顺身常安。故虽穷退日，而无戚戚颜。\n昔有荣先生，从事于其间。今我不量力，举心欲攀援。\n穷通不由己，欢戚不由天。命即无奈何，心可使泰然。\n且务由己者，省躬谅非难。勿问由天者，天高难与言。\n\n【山中独吟】白居易\n人各有一癖，我癖在章句。万缘皆已消，此病独未去。\n每逢美风景，或对好亲故。高声咏一篇，恍若与神遇。\n自为江上客，半在山中住。有时新诗成，独上东岩路。\n身倚白石崖，手攀青桂树。狂吟惊林壑，猿鸟皆窥觑。\n恐为世所嗤，故就无人处。\n\n【湖亭晚望残水】白居易\n湖上秋泬寥，湖边晚萧瑟。登亭望湖水，水缩湖底出。\n清渟得早霜，明灭浮残日。流注随地势，洼坳无定质。\n泓澄白龙卧，宛转青蛇屈。破镜折剑头，光芒又非一。\n久为山水客，见尽幽奇物。及来湖亭望，此状难谈悉。\n乃知天地间，胜事殊未毕。\n\n【初出城留别】白居易\n朝从紫禁归，暮出青门去。勿言城东陌，便是江南路。\n扬鞭簇车马，挥手辞亲故。我生本无乡，心安是归处。\n\n【宿清源寺】白居易\n往谪浔阳去，夜憩辋溪曲。今为钱塘行，重经兹寺宿。\n尔来几何岁，溪草二八绿。不见旧房僧，苍然新树木。\n虚空走日月，世界迁陵谷。我生寄其间，孰能逃倚伏。\n随缘又南去，好住东廊竹。\n\n【邓州路中作】白居易\n萧萧谁家村，秋梨叶半坼。漠漠谁家园，秋韭花初白。\n路逢故里物，使我嗟行役。不归渭北村，又作江南客。\n去乡徒自苦，济世终无益。自问波上萍，何如涧中石。\n\n【桐树馆重题】白居易\n阶前下马时，梁上题诗处。惨澹病使君，萧疏老松树。\n自嗟还自哂，又向杭州去。\n\n【思竹窗】白居易\n不忆西省松，不忆南宫菊。惟忆新昌堂，萧萧北窗竹。\n窗间枕簟在，来后何人宿。\n\n【秋蝶】白居易\n秋花紫蒙蒙，秋蝶黄茸茸。花低蝶新小，飞戏丛西东。\n日暮凉风来，纷纷花落丛。夜深白露冷，蝶已死丛中。\n朝生夕俱死，气类各相从。不见千年鹤，多栖百丈松。\n\n【枯桑】白居易\n道傍老枯树，枯来非一朝。皮黄外尚活，心黑中先焦。\n有似多忧者，非因外火烧。\n\n【山雉】白居易\n五步一啄草，十步一饮水。适性遂其生，时哉山梁雉。\n梁上无罾缴，梁下无鹰鹯。雌雄与群雏，皆得终天年。\n嗟嗟笼下鸡，及彼池中雁。既有稻粱恩，必有牺牲患。\n\n【清调吟】白居易\n索索风戒寒，沈沈日藏耀。劝君饮浊醪，听我吟清调。\n芳节变穷阴，朝光成夕照。与君生此世，不合长年少。\n今晨从此过，明日安能料。若不结跏禅，即须开口笑。\n\n【郡亭】白居易\n平旦起视事，亭午卧掩关。除亲簿领外，多在琴书前。\n况有虚白亭，坐见海门山。潮来一凭槛，宾至一开筵。\n终朝对云水，有时听管弦。持此聊过日，非忙亦非闲。\n山林太寂寞，朝阙空喧烦。唯兹郡阁内，嚣静得中间。\n\n【立春后五日】白居易\n立春后五日，春态纷婀娜。白日斜渐长，碧云低欲堕。\n残冰坼玉片，新萼排红颗。遇物尽欣欣，爱春非独我。\n迎芳后园立，就暖前檐坐。还有惆怅心，欲别红炉火。\n\n【官舍】白居易\n高树换新叶，阴阴覆地隅。何言太守宅，有似幽人居。\n太守卧其下，闲慵两有馀。起尝一瓯茗，行读一卷书。\n早梅结青实，残樱落红珠。稚女弄庭果，嬉戏牵人裾。\n是日晚弥静，巢禽下相呼。啧啧护儿鹊，哑哑母子乌。\n岂唯云鸟尔，吾亦引吾雏。\n\n【题小桥前新竹招客】白居易\n雁齿小红桥，垂檐低白屋。桥前何所有，苒苒新生竹。\n皮开坼褐锦，节露抽青玉。筠翠如可餐，粉霜不忍触。\n闲吟声未已，幽玩心难足。管领好风烟，轻欺凡草木。\n谁能有月夜，伴我林中宿。为君倾一杯，狂歌竹枝曲。\n\n【食饱】白居易\n食饱拂枕卧，睡足起闲吟。浅酌一杯酒，缓弹数弄琴。\n既可畅情性，亦足傲光阴。谁知利名尽，无复长安心。\n\n【南亭对酒送春】白居易\n含桃实已落，红薇花尚熏。冉冉三月尽，晚莺城上闻。\n独持一杯酒，南亭送残春。半酣忽长歌，歌中何所云。\n云我五十馀，未是苦老人。刺史二千石，亦不为贱贫。\n天下三品官，多老于我身。同年登第者，零落无一分。\n亲故半为鬼，僮仆多见孙。念此聊自解，逢酒且欢欣。\n\n【仲夏斋戒月】白居易\n仲夏斋戒月，三旬断腥膻。自觉心骨爽，行起身翩翩。\n始知绝粒人，四体更轻便。初能脱病患，久必成神仙。\n御寇驭泠风，赤松游紫烟。常疑此说谬，今乃知其然。\n我今过半百，气衰神不全。已垂两鬓丝，难补三丹田。\n但减荤血味，稍结清净缘。脱巾且修养，聊以终天年。\n\n【三年为刺史二首】白居易\n三年为刺史，无政在人口。唯向城郡中，题诗十馀首。\n惭非甘棠咏，岂有思人不。\n\n三年为刺史，饮冰复食檗。唯向天竺山，取得两片石。\n此抵有千金，无乃伤清白。\n\n【自馀杭归宿淮口作】白居易\n为郡已多暇，犹少勤吏职。罢郡更安闲，无所劳心力。\n舟行明月下，夜泊清淮北。岂止吾一身，举家同燕息。\n三年请禄俸，颇有馀衣食。乃至僮仆间，皆无冻馁色。\n行行弄云水，步步近乡国。妻子在我前，琴书在我侧。\n此外吾不知，于焉心自得。\n\n【洛下卜居】白居易\n三年典郡归，所得非金帛。天竺石两片，华亭鹤一支。\n饮啄供稻粱，包裹用茵席。诚知是劳费，其奈心爱惜。\n远从馀杭郭，同到洛阳陌。下担拂云根，开笼展霜翮。\n贞姿不可杂，高性宜其适。遂就无尘坊，仍求有水宅。\n东南得幽境，树老寒泉碧。池畔多竹阴，门前少人迹。\n未请中庶禄，且脱双骖易。岂独为身谋，安吾鹤与石。\n\n【赠苏少府】白居易\n籍甚二十年，今日方款颜。相送嵩洛下，论心杯酒间。\n河亚懒出入，府寮多闭关。苍发彼此老，白日寻常闲。\n朝从携手出，暮思联骑还。何当挈一榼，同宿龙门山。\n\n【琴】白居易\n置琴曲几上，慵坐但含情。何烦故挥弄，风弦自有声。\n\n【自咏】白居易\n夜镜隐白发，朝酒发红颜。可怜假年少，自笑须臾间。\n朱砂贱如土，不解烧为丹。玄鬓化为雪，未闻休得官。\n咄哉个丈夫，心性何堕顽。但遇诗与酒，便忘寝与餐。\n高声发一吟，似得诗中仙。引满饮一盏，尽忘身外缘。\n昔有醉先生，席地而幕天。于今居处在，许我当中眠。\n眠罢又一酌，酌罢又一篇。回面顾妻子，生计方落然。\n诚知此事非，又过知非年。岂不欲自改，改即心不安。\n且向安处去，其馀皆老闲。\n\n【晏起】白居易\n鸟鸣庭树上，日照屋檐时。老去慵转极，寒来起尤迟。\n厚薄被适性，高低枕得宜。神安体稳暖，此味何人知。\n睡足仰头坐，兀然无所思。如未凿七窍，若都遗四肢。\n缅想长安客，早朝霜满衣。彼此各自适，不知谁是非。\n\n【春葺新居】白居易\n江州司马日，忠州刺史时。栽松满后院，种柳荫前墀。\n彼皆非吾土，栽种尚忘疲。况兹是我宅，葺艺固其宜。\n平旦领仆使，乘春亲指挥。移花夹暖室，徙竹覆寒池。\n池水变绿色，池芳动清辉。寻芳弄水坐，尽日心熙熙。\n一物苟可适，万缘都若遗。设如宅门外，有事吾不知。\n\n【泛春池】白居易\n白蘋湘渚曲，绿筱剡溪口。各在天一涯，信美非吾有。\n何如此庭内，水竹交左右。霜竹百千竿，烟波六七亩。\n泓澄动阶砌，澹泞映户牖。蛇皮细有纹，镜面清无垢。\n主人过桥来，双童扶一叟。恐污清泠波，尘缨先抖擞。\n波上一叶舟，舟中一尊酒。酒开舟不系，去去随所偶。\n或绕蒲浦前，或泊桃岛后。未拨落杯花，低冲拂面柳。\n半酣迷所在，倚榜兀回首。不知此何处，复是人寰否。\n谁知始疏凿，几主相传受。杨家去云远，田氏将非久。\n天与爱水人，终焉落吾手。\n\n.\n.\n【伤杨弘贞】白居易\n颜子昔短命，仲尼惜其贤。杨生亦好学，不幸复徒然。\n谁识天地意，独与龟鹤年。\n\n【新栽竹】白居易\n佐邑意不适，闭门秋草生。何以娱野性，种竹百馀茎。\n见此溪上色，忆得山中情。有时公事暇，尽日绕栏行。\n勿言根未固，勿言阴未成。已觉庭宇内，稍稍有馀清。\n最爱近窗卧，秋风枝有声。\n\n【寄江南兄弟】白居易\n分散骨肉恋，趋驰名利牵。一奔尘埃马，一泛风波船。\n忽忆分手时，悯默秋风前。别来朝复夕，积日成七年。\n花落城中池，春深江上天。登楼东南望，鸟灭烟苍然。\n相去复几许，道里近三千。平地犹难见，况乃隔山川。\n\n【禁中月】白居易\n海水明月出，禁中清夜长。东南楼殿白，稍稍上宫墙。\n净落金塘水，明浮玉砌霜。不比人间见，尘土污清光。\n\n【初见白发】白居易\n白发生一茎，朝来明镜里。勿言一茎少，满头从此始。\n青山方远别，黄绶初从仕。未料容鬓间，蹉跎忽如此。\n\n【禁中秋宿】白居易\n风翻朱里幕，雨冷通中枕。耿耿背斜灯，秋床一人寝。\n\n【寄元九】白居易\n身为近密拘，心为名检缚。月夜与花时，少逢杯酒乐。\n唯有元夫子，闲来同一酌。把手或酣歌，展眉时笑谑。\n今春除御史，前月之东洛。别来未开颜，尘埃满尊杓。\n蕙风晚香尽，槐雨馀花落。秋意一萧条，离容两寂寞。\n况随白日老，共负青山约。谁识相念心，鞲鹰与笼鹤。\n\n【早梳头】白居易\n夜沐早梳头，窗明秋镜晓。飒然握中发，一沐知一少。\n年事渐蹉跎，世缘方缴绕。不学空门法，老病何由了。\n未得无生心，白头亦为夭。\n\n【别舍弟后月夜】白居易\n悄悄初别夜，去住两盘桓。行子孤灯店，居人明月轩。\n平生共贫苦，未必日成欢。及此暂为别，怀抱已忧烦。\n况是庭叶尽，复思山路寒。如何为不念，马瘦衣裳单。\n\n【金銮子晬日】白居易\n行年欲四十，有女曰金銮。生来始周岁，学坐未能言。\n惭非达者怀，未免俗情怜。从此累身外，徒云慰目前。\n若无夭折患，则有婚嫁牵。使我归山计，应迟十五年。\n\n【秋题牡丹丛】白居易\n晚丛白露夕，衰叶凉风朝。红艳久已歇，碧芳今亦销。\n幽人坐相对，心事共萧条。\n\n【曲江感秋（五年作）】白居易\n沙草新雨地，岸柳凉风枝。三年感秋意，并在曲江池。\n早蝉已嘹唳，晚荷复离披。前秋去秋思，一一生此时。\n昔人三十二，秋兴已云悲。我今欲四十，秋怀亦可知。\n岁月不虚设，此身随日衰。暗老不自觉，直到鬓成丝。\n\n【立秋日曲江忆元九】白居易\n下马柳阴下，独上堤上行。故人千万里，新蝉三两声。\n城中曲江水，江上江陵城。两地新秋思，应同此日情。\n\n【重到渭上旧居】白居易\n旧居清渭曲，开门当蔡渡。十年方一还，几欲迷归路。\n追思昔日行，感伤故游处。插柳作高林，种桃成老树。\n因惊成人者，尽是旧童孺。试问旧老人，半为绕村墓。\n浮生同过客，前后递来去。白日如弄珠，出没光不住。\n人物日改变，举目悲所遇。回念念我身，安得不衰暮。\n朱颜销不歇，白发生无数。唯有山门外，三峰色如故。\n\n【秋日】白居易\n池残寥落水，窗下悠扬日。袅袅秋风多，槐花半成实。\n下有独立人，年来四十一。\n\n【思归（时初为校书郎）】白居易\n养无晨昏膳，隐无伏腊资。遂求及亲禄，黾勉来京师。\n薄俸未及亲，别家已经时。冬积温席恋，春违采兰期。\n夏至一阴生，稍稍夕漏迟。块然抱愁者，长夜独先知。\n悠悠乡关路，梦去身不随。坐惜时节变，蝉鸣槐花枝。\n\n【客路感秋，寄明准上人】白居易\n日暮天地冷，雨霁山河清。长风从西来，草木凝秋声。\n已感岁倏忽，复伤物凋零。孰能不憯凄，天时牵人情。\n借问空门子，何法易修行。使我忘得心，不教烦恼生。\n\n【秋暮西归途中书情】白居易\n耿耿旅灯下，愁多常少眠。思乡贵早发，发在鸡鸣前。\n九月草木落，平芜连远山。秋阴和曙色，万木苍苍然。\n去秋偶东游，今秋始西旋。马瘦衣裳破，别家来二年。\n忆归复愁归，归无一囊钱。心虽非兰膏，安得不自然。\n\n【题赠定光上人】白居易\n二十身出家，四十心离尘。得径入大道，乘此不退轮。\n一坐十五年，林下秋复春。春花与秋气，不感无情人。\n我来如有悟，潜以心照身。误落闻见中，忧喜伤形神。\n安得遗耳目，冥然反天真。\n\n【酬李少府曹长官舍见赠】白居易\n低腰复敛手，心体不遑安。一落风尘下，方知为吏难。\n公事与日长，宦情随岁阑。惆怅青袍袖，芸香无半残。\n赖有李夫子，此怀聊自宽。两心如止水，彼此无波澜。\n往往簿书暇，相劝强为欢。白马晚蹋雪，渌觞春暖寒。\n恋月夜同宿，爱山晴共看。野性自相近，不是为同官。\n\n【晓别】白居易\n晓鼓声已半，离筵坐难久。请君断肠歌，送我和泪酒。\n月落欲明前，马嘶初别后。浩浩暗尘中，何由见回首。\n\n【惜栯李花】白居易\n树小花鲜妍，香繁条软弱。高低二三尺，重叠千万萼。\n朝艳蔼霏霏，夕凋纷漠漠。辞枝朱粉细，覆地红绡薄。\n由来好颜色，常苦易销铄。不见莨荡花，狂风吹不落。\n\n【新秋】白居易\n西风飘一叶，庭前飒已凉。风池明月水，衰莲白露房。\n其奈江南夜，绵绵自此长。\n\n【秋江送客】白居易\n秋鸿次第过，哀猿朝夕闻。是日孤舟客，此地亦离群。\n濛濛润衣雨，漠漠冒帆云。不醉浔阳酒，烟波愁杀人。\n\n【秋月】白居易\n夜初色苍然，夜深光浩然。稍转西廊下，渐满南窗前。\n况是绿芜地，复兹清露天。落叶声策策，惊鸟影翩翩。\n栖禽尚不稳，愁人安可眠。\n\n.\n.\n【读邓鲂诗】白居易\n尘架多文集，偶取一卷披。未及看姓名，疑是陶潜诗。\n看名知是君，恻恻令我悲。诗人多蹇厄，近日诚有之。\n京兆杜子美，犹得一拾遗。襄阳孟浩然，亦闻鬓成丝。\n嗟君两不如，三十在布衣。擢第禄不及，新婚妻未归。\n少年无疾患，溘死于路歧。天不与爵寿，唯与好文词。\n此理勿复道，巧历不能推。\n\n【秋夕】白居易\n叶声落如雨，月色白似霜。夜深方独卧，谁为拂尘床。\n\n【秋霁】白居易\n金火不相待，炎凉雨中变。林晴有残蝉，巢冷无留燕。\n沉吟卷长簟，怆恻收团扇。向夕稍无泥，闲步青苔院。\n月出砧杵动，家家捣秋练。独对多病妻，不能理针线。\n冬衣殊未制，夏服行将绽。何以迎早秋，一杯聊自劝。\n\n【送兄弟回雪夜】白居易\n日晦云气黄，东北风切切。时从村南还，新与兄弟别。\n离襟泪犹湿，回马嘶未歇。欲归一室坐，天阴多无月。\n夜长火消尽，岁暮雨凝结。寂寞满炉灰，飘零上阶雪。\n对雪画寒灰，残灯明复灭。灰死如我心，雪白如我发。\n所遇皆如此，顷刻堪愁绝。回念入坐忘，转忧作禅悦。\n平生洗心法，正为今宵设。\n\n【同友人寻涧花】白居易\n闻有涧底花，贳得村中酒。与君来校迟，已逢摇落后。\n临觞有遗恨，怅望空溪口。记取花发时，期君重携手。\n我生日日老，春色年年有。且作来岁期，不知身健否。\n\n【梦裴相公】白居易\n五年生死隔，一夕魂梦通。梦中如往日，同直金銮宫。\n仿佛金紫色，分明冰玉容。勤勤相眷意，亦与平生同。\n既寤知是梦，悯然情未终。追想当时事，何殊昨夜中。\n自我学心法，万缘成一空。今朝为君子，流涕一沾胸。\n\n【观儿戏】白居易\n髫龀七八岁，绮纨三四儿。弄尘复斗草，尽日乐嬉嬉。\n堂上长年客，鬓间新有丝。一看竹马戏，每忆童騃时。\n童騃饶戏乐，老大多忧悲。静念彼与此，不知谁是痴。\n\n【寄元九】白居易\n一病经四年，亲朋书信断。穷通合易交，自笑知何晚。\n元君在荆楚，去日唯云远。彼独是何人，心如石不转。\n忧我贫病身，书来唯劝勉。上言少愁苦，下道加餐饭。\n怜君为谪吏，穷薄家贫褊。三寄衣食资，数盈二十万。\n岂是贪衣食，感君心缱绻。念我口中食，分君身上暖。\n不因身病久，不因命多蹇。平生亲友心，岂得知深浅。\n\n【城上对月，期友人不至】白居易\n古人惜昼短，劝令秉烛游。况此迢迢夜，明月满西楼。\n复有盈尊酒，置在城上头。期君君不至，人月两悠悠。\n照水烟波白，照人肌发秋。清光正如此，不醉即须愁。\n\n【对酒】白居易\n人生一百岁，通计三万日。何况百岁人，人间百无一。\n贤愚共零落，贵贱同埋没。东岱前后魂，北邙新旧骨。\n复闻药误者，为爱延年术。又有忧死者，为贪政事笔。\n药误不得老，忧死非因疾。谁言人最灵，知得不知失。\n何如会亲友，饮此杯中物。能沃烦虑消，能陶真性出。\n所以刘阮辈，终年醉兀兀。\n\n【谕怀】白居易\n黑头日已白，白面日已黑。人生未死间，变化何终极。\n常言在己者，莫若形与色。一朝改变来，止遏不能得。\n况彼身外事，悠悠通与塞。\n\n【西原晚望】白居易\n花菊引闲行，行上西原路。原上晚无人，因高聊四顾。\n南阡有烟火，北陌连墟墓。村邻何萧疏，近者犹百步。\n吾庐在其下，寂寞风日暮。门外转枯蓬，篱根伏寒兔。\n故园汴水上，离乱不堪去。近岁始移家，飘然此村住。\n新屋五六间，古槐八九树。便是衰病身，此生终老处。\n\n【村居卧病三首】白居易\n戚戚抱羸病，悠悠度朝暮。夏木才结阴，秋兰已含露。\n前日巢中卵，化作雏飞去。昨日穴中虫，蜕为蝉上树。\n四时未尝歇，一物不暂住。唯有病客心，沉然独如故。\n\n新秋久病容，起步村南道。尽日不逢人，虫声遍荒草。\n西风吹白露，野绿秋仍早。草木犹未伤，先伤我怀抱。\n朱颜与玄鬓，强健几时好。况为忧病侵，不得依年老。\n\n种黍三十亩，雨来苗渐大。种薤二十畦，秋来欲堪刈。\n望黍作冬酒，留薤为春菜。荒村百物无，待此养衰瘵。\n葺庐备阴雨，补褐防寒岁。病身知几时，且作明年计。\n\n【栽松二首】白居易\n小松未盈尺，心爱手自移。苍然涧底色，云湿烟霏霏。\n栽植我年晚，长成君性迟。如何过四十，种此数寸枝。\n得见成阴否，人生七十稀。\n\n爱君抱晚节，怜君含直文。欲得朝朝见，阶前故种君。\n知君死则已，不死会凌云。\n\n【自觉二首】白居易\n四十未为老，忧伤早衰恶。前岁二毛生，今年一齿落。\n形骸日损耗，心事同萧索。夜寝与朝餐，其间味亦薄。\n同岁崔舍人，容光方灼灼。始知年与貌，衰盛随忧乐。\n畏老老转迫，忧病病弥缚。不畏复不忧，是除老病药。\n\n朝哭心所爱，暮哭心所亲。亲爱零落尽，安用身独存。\n几许平生欢，无限骨肉恩。结为肠间痛，聚作鼻头辛。\n悲来四支缓，泣尽双眸昏。所以年四十，心如七十人。\n我闻浮屠教，中有解脱门。置心为止水，视身如浮云。\n斗擞垢秽衣，度脱生死轮。胡为恋此苦，不去犹逡巡。\n回念发弘愿，愿此见在身。但受过去报，不结将来因。\n誓以智慧水，永洗烦恼尘。不将恩爱子，更种悲忧根。\n\n【送春】白居易\n三月三十日，春归日复暮。惆怅问春风，明朝应不住。\n送春曲江上，眷眷东西顾。但见扑水花，纷纷不知数。\n人生似行客，两足无停步。日日进前程，前程几多路。\n兵刀与水火，尽可违之去。唯有老到来，人间无避处。\n感时良为已，独倚池南树。今日送春心，心如别亲故。\n\n【初出蓝田路作】白居易\n停骖问前路，路在秋云里。苍苍县南道，去途从此始。\n绝顶忽上盘，众山皆下视。下视千万峰，峰头如浪起。\n朝经韩公坡，夕次蓝桥水。浔阳近四千，始行七十里。\n人烦马蹄跙，劳苦已如此。\n\n【微雨夜行】白居易\n漠漠秋云起，稍稍夜寒生。但觉衣裳湿，无点亦无声。\n\n【寄微之三首】白居易\n江州望通州，天涯与地末。有山万丈高，有江千里阔。\n间之以云雾，飞鸟不可越。谁知千古险，为我二人设。\n通州君初到，郁郁愁如结。江州我方去，迢迢行未歇。\n道路日乖隔，音信日断绝。因风欲寄语，地远声不彻。\n生当复相逢，死当从此别。\n\n君游襄阳日，我在长安住。今君在通州，我过襄阳去。\n襄阳九里郭，楼堞连云树。顾此稍依依，是君旧游处。\n苍茫兼葭水，中有浔阳路。此去更相思，江西少亲故。\n\n去国日已远，喜逢物似人。如何含此意，江上坐思君。\n有如河岳气，相合方氛氲。狂风吹中绝，两处成孤云。\n风回终有时，云合岂无因。努力各自爱，穷通我尔身。\n\n【夜闻歌者（宿鄂州）】白居易\n夜泊鹦鹉洲，江月秋澄澈。邻船有歌者，发词堪愁绝。\n歌罢继以泣，泣声通复咽。寻声见其人，有妇颜如雪。\n独倚帆樯立，娉婷十七八。夜泪如真珠，双双堕明月。\n借问谁家妇，歌泣何凄切。一问一沾襟，低眉终不说。\n\n【宿东林寺】白居易\n经窗灯焰短，僧炉火气深。索落庐山夜，风雪宿东林。\n\n【赠别崔五】白居易\n朝送南去客，暮迎北来宾。孰云当大路，少遇心所亲。\n劳者念息肩，热者思濯身。何如愁独日，忽见平生人。\n平生已不浅，是日重殷勤。问从何处来，及此江亭春。\n江天春多阴，夜月隔重云。移尊树间饮，灯照花纷纷。\n一会不易得，馀事何足云。明旦又分手，今夕且欢忻。\n\n【渐老】白居易\n今朝复明日，不觉年齿暮。白发逐梳落，朱颜辞镜去。\n当春颇愁寂，对酒寡欢趣。遇境多怆辛，逢人益敦故。\n形质属天地，推迁从不住。所怪少年心，销磨落何处。\n\n【夜雪】白居易\n已讶衾枕冷，复见窗户明。夜深知雪重，时闻折竹声。\n\n【首夏】白居易\n孟夏百物滋，动植一时好。麋鹿乐深林，虫蛇喜丰草。\n翔禽爱密叶，游鳞悦新藻。天和遗漏处，而我独枯槁。\n一身在天末，骨肉皆远道。旧国无来人，寇戎尘浩浩。\n沉忧竟何益，只自劳怀抱。不如放身心，冥然任天造。\n浔阳多美酒，可使杯不燥。湓鱼贱如泥，烹炙无昏早。\n朝饭山下寺，暮醉湖中岛。何必归故乡，兹焉可终老。\n\n【早蝉】白居易\n六月初七日，江头蝉始鸣。石楠深叶里，薄暮两三声。\n一催衰鬓色，再动故园情。西风殊未起，秋思先秋生。\n忆昔在东掖，宫槐花下听。今朝无限思，云树绕湓城。\n\n【南湖晚秋】白居易\n八月白露降，湖中水方老。旦夕秋风多，衰荷半倾倒。\n手攀青枫树，足蹋黄芦草。惨澹老容颜，冷落秋怀抱。\n有兄在淮楚，有弟在蜀道。万里何时来，烟波白浩浩。\n\n【感秋怀微之】白居易\n叶下湖又波，秋风此时至。谁知濩落心，先纳萧条气。\n推移感流岁，漂泊思同志。昔为烟霄侣，今作泥涂吏。\n白鸥毛羽弱，青凤文章异。各闭一笼中，岁晚同憔悴。\n\n【早蝉】白居易\n月出先照山，风生先动水。亦如早蝉声，先入闲人耳。\n一闻愁意结，再听乡心起。渭上新蝉声，先听浑相似。\n衡门有谁听，日暮槐花里。\n\n【早秋晚望，兼呈韦侍郎】白居易\n九派绕孤城，城高生远思。人烟半在船，野水多于地。\n穿霞日脚直，驱雁风头利。去国来几时，江上秋三至。\n夫君亦沦落，此地同飘寄。悯默向隅心，摧颓触笼翅。\n且谋眼前计，莫问胸中事。浔阳酒甚浓，相劝时时醉。\n\n【司马厅独宿】白居易\n荒凉满庭草，偃亚侵檐竹。府吏下厅帘，家僮开被襆。\n数声城上漏，一点窗间烛。官曹冷似冰，谁肯来同宿。\n\n【秋槿】白居易\n风露飒已冷，天色亦黄昏。中庭有槿花，荣落同一晨。\n秋开已寂寞，夕陨何纷纷。正怜少颜色，复叹不逡巡。\n感此因念彼，怀哉聊一陈。男儿老富贵，女子晚婚姻。\n头白始得志，色衰方事人。后时不获已，安得如青春。\n\n【初入峡有感】白居易\n上有万仞山，下有千丈水。苍苍两岸间，阔狭容一苇。\n瞿唐呀直泻，滟滪屹中峙。未夜黑岩昏，无风白浪起。\n大石如刀剑，小石如牙齿。一步不可行，况千三百里。\n苒箬竹蔑zB，欹危楫师趾。一跌无完舟，吾生系于此。\n常闻仗忠信，蛮貊可行矣。自古漂沉人，岂尽非君子。\n况吾时与命，蹇舛不足恃。常恐不才身，复作无名死。\n\n【自江州至忠州】白居易\n前在浔阳日，已叹宾朋寡。忽忽抱忧怀，出门无处写。\n今来转深僻，穷峡巅山下。五月断行舟，滟堆正如马。\n巴人类猿狖，矍铄满山野。敢望见交亲，喜逢似人者。\n\n【郡中】白居易\n乡路音信断，山城日月迟。欲知州近远，阶前摘荔枝。\n\n【东楼晓】白居易\n脉脉复脉脉，东楼无宿客。城暗云雾多，峡深田地窄。\n宵灯尚留焰，晨禽初展翮。欲知山高低，不见东方白。\n\n【南宾郡斋即事，寄杨万州】白居易\n山上巴子城，山下巴江水。中有穷独人，强名为刺史。\n时时窃自哂，刺史岂如是。仓粟喂家人，黄缣裹妻子。\n莓苔翳冠带，雾雨霾楼雉。衙鼓暮复朝，郡斋卧还起。\n回头望南浦，亦在烟波里。而我复何嗟，夫君犹滞此。\n\n【庭槐】白居易\n南方饶竹树，唯有青槐稀。十种七八死，纵活亦支离。\n何此郡庭下，一株独华滋。蒙蒙碧烟叶，袅袅黄花枝。\n我家渭水上，此树荫前墀。忽向天涯见，忆在故园时。\n人生有情感，遇物牵所思。树木犹复尔，况见旧亲知。\n\n【东楼竹】白居易\n潇洒城东楼，绕楼多修竹。森然一万竿，白粉封青玉。\n卷帘睡初觉，欹枕看未足。影转色入楼，床席生浮绿。\n空城绝宾客，向夕弥幽独。楼上夜不归，此君留我宿。\n\n【东城寻春】白居易\n老色日上面，欢情日去心。今既不如昔，后当不如今。\n今犹未甚衰，每事力可任。花时仍爱出，酒后尚能吟。\n但恐如此兴，亦随日销沉。东城春欲老，勉强一来寻。\n\n【桐花】白居易\n春令有常候，清明桐始发。何此巴峡中，桐花开十月。\n岂伊物理变，信是土宜别。地气反寒暄，天时倒生杀。\n草木坚强物，所禀固难夺。风候一参差，荣枯遂乖剌。\n况吾北人性，不耐南方热。强羸寿夭间，安得依时节。\n\n【花下对酒二首】白居易\n蔼蔼江气春，南宾闰正月。梅樱与桃杏，次第城上发。\n红房烂簇火，素艳纷团雪。香惜委风飘，愁牵压枝折。\n楼中老太守，头上新白发。冷澹病心情，暄和好时节。\n故园音信断，远郡亲宾绝。欲问花前尊，依然为谁设。\n\n引手攀红樱，红樱落似霰。仰首看白日，白日走如箭。\n年芳与时景，顷刻犹衰变。况是血肉身，安能长强健。\n人心苦迷执，慕贵忧贫贱。愁色常在眉，欢容不上面。\n况吾头半白，把镜非不见。何必花下杯，更待他人劝。\n\n【我身】白居易\n我身何所似，似彼孤生蓬。秋霜剪根断，浩浩随长风。\n昔游秦雍间，今落巴蛮中。昔为意气郎，今作寂寥翁。\n外貌虽寂寞，中怀颇冲融。赋命有厚薄，委心任穷通。\n通当为大鹏，举翅摩苍穹。穷则为鹪鹩，一枝足自容。\n苟知此道者，身穷心不穷。\n\n【东坡种花二首】白居易\n持钱买花树，城东坡上栽。但购有花者，不限桃杏梅。\n百果参杂种，千枝次第开。天时有早晚，地力无高低。\n红者霞艳艳，白者雪皑皑。游蜂逐不去，好鸟亦来栖。\n前有长流水，下有小平台。时拂台上石，一举风前杯。\n花枝荫我头，花蕊落我怀。独酌复独咏，不觉月平西。\n巴俗不爱花，竟春无人来。唯此醉太守，尽日不能回。\n\n东坡春向暮，树木今何如。漠漠花落尽，翳翳叶生初。\n每日领童仆，荷锄仍决渠。刬土壅其本，引泉溉其枯。\n小树低数尺，大树长丈馀。封植来几时，高下随扶疏。\n养树既如此，养民亦何殊。将欲茂枝叶，必先救根株。\n云何救根株，劝农均赋租。云何茂枝叶，省事宽刑书。\n移此为郡政，庶几甿俗苏。\n\n【哭诸故人，因寄元八】白居易\n昨日哭寝门，今日哭寝门。借问所哭谁，无非故交亲。\n伟卿既长往，质夫亦幽沦。屈指数年世，收涕自思身。\n彼皆少于我，先为泉下人。我今头半白，焉得身久存。\n好狂元郎中，相识二十春。昔见君生子，今闻君抱孙。\n存者尽老大，逝者已成尘。早晚升平宅，开眉一见君。\n\n【开元寺东池早春】白居易\n池水暖温暾，水清波潋滟。簇簇青泥中，新蒲叶如剑。\n梅房小白裹，柳彩轻黄染。顺气草熏熏，适情鸥泛泛。\n旧游成梦寐，往事随阳焱。芳物感幽怀，一动平生念。\n\n【卧小斋】白居易\n朝起视事毕，晏坐饱食终。散步长廊下，卧退小斋中。\n拙政自多暇，幽情谁与同。孰云二千石，心如田野翁。\n\n【征秋税毕，题郡南亭】白居易\n高城直下视，蠢蠢见巴蛮。安可施政教，尚不通语言。\n且喜赋敛毕，幸闻闾井安。岂伊循良化，赖此丰登年。\n案牍既简少，池馆亦清闲。秋雨檐果落，夕钟林鸟还。\n南亭日潇洒，偃卧恣疏顽。\n\n【郊下】白居易\n西日照高树，树头子规鸣。东风吹野水，水畔江蓠生。\n尽日看山立，有时寻涧行。兀兀长如此，何许似专城。\n\n【岁晚】白居易\n霜降水返壑，风落木归山。冉冉岁将宴，物皆复本源。\n何此南迁客，五年独未还。命屯分已定，日久心弥安。\n亦尝心与口，静念私自言。去国固非乐，归乡未必欢。\n何须自生苦，舍易求其难。\n\n【委顺】白居易\n山城虽荒芜，竹树有嘉色。郡俸诚不多，亦足充衣食。\n外累由心起，心宁累自息。尚欲忘家乡，谁能算官职。\n宜怀齐远近，委顺随南北。归去诚可怜，天涯住亦得。\n\n【庭松】白居易\n堂下何所有，十松当我阶。乱立无行次，高下亦不齐。\n高者三丈长，下者十尺低。有如野生物，不知何人栽。\n接以青瓦屋，承之白沙台。朝昏有风月，燥湿无尘泥。\n疏韵秋槭槭，凉阴夏凄凄。春深微雨夕，满叶珠蓑蓑。\n岁暮大雪天，压枝玉皑皑。四时各有趣，万木非其侪。\n去年买此宅，多为人所咍。一家二十口，移转就松来。\n移来有何得，但得烦襟开。即此是益友，岂必交贤才。\n顾我犹俗士，冠带走尘埃。未称为松主，时时一愧怀。\n\n【晚归有感】白居易\n朝吊李家孤，暮问崔家疾。回马独归来，低眉心郁郁。\n平生所善者，多不过六七。如何十年间，零落三无一。\n刘曾梦中见，元向花前失。渐老与谁游，春城好风日。\n\n【玩松竹二首】白居易\n龙蛇隐大泽，麋鹿游丰草。栖凤安于梧，潜鱼乐于藻。\n吾亦爱吾庐，庐中乐吾道。前松后修竹，偃卧可终老。\n各附其所安，不知他物好。\n\n坐爱前檐前，卧爱北窗北。窗竹多好风，檐松有嘉色。\n幽怀一以合，俗含随缘息。在尔虽无情，于予即有得。\n乃知性相近，不必动与植。\n\n【逍遥咏】白居易\n亦莫恋此身，亦莫厌此身。此身何足恋，万劫烦恼根。\n此身何足厌，一聚虚空尘。无恋亦无厌，始是逍遥人。\n\n.\n.\n【生离别】白居易\n食檗不易食梅难，檗能苦兮梅能酸。未如生别之为难，\n苦在心兮酸在肝。晨鸡再鸣残月没，征马连嘶行人出。\n回看骨肉哭一声，梅酸檗苦甘如蜜。黄河水白黄云秋，\n行人河边相对愁。天寒野旷何处宿，棠梨叶战风飕飕。\n生离别，生离别，忧从中来无断绝。忧极心劳血气衰，\n未年三十生白发。\n\n【王夫子】白居易\n王夫子，送君为一尉，东南三千五百里。道途虽远位虽卑，\n月俸犹堪活妻子。男儿口读古人书，束带敛手来从事。\n近将徇禄给一家，远则行道佐时理，行道佐时须待命，\n委身下位无为耻。命苟未来且求食，官无卑高及远迩。\n男儿上既未能济天下，下又不至饥寒死。吾观九品至一品，\n其间气味都相似。紫绶朱绂青布衫，颜色不同而已矣。\n王夫子，别有一事欲劝君，遇酒逢春且欢喜。\n\n【送张山人归嵩阳】白居易\n黄昏惨惨天微雪，修行坊西鼓声绝。张生马瘦衣且单，\n夜扣柴门与我别。愧君冒寒来别我，为君酤酒张灯火。\n酒酣火暖与君言，何事入关又出关。答云前年偶下山，\n四十馀月客长安。长安古来名利地，空手无金行路难。\n朝游九城陌，肥马轻车欺杀客。暮宿五侯门，\n残茶冷酒愁杀人。春明门，门前便是嵩山路。\n幸有云泉容此身，明日辞君且归去。\n\n【东墟晚歇（时退居渭村）】白居易\n凉风冷露萧索天，黄蒿紫菊荒凉田。绕冢秋花少颜色，\n细虫小蝶飞翻翻。中有腾腾独行者，手拄渔竿不骑马。\n晚从南涧钓鱼回，歇此墟中白杨下。褐衣半故白发新，\n人逢知我是何人。谁言渭浦栖迟客，曾作甘泉侍从臣。\n\n【挽歌词】白居易\n丹旐何飞扬，素骖亦悲鸣。晨光照闾巷，輀车俨欲行。\n萧条九月天，哀挽出重城。借问送者谁，妻子与弟兄。\n苍苍上古原，峨峨开新茔。含酸一恸哭，异口同哀声。\n旧陇转芜绝，新坟日罗列。春风草绿北邙山，\n此地年年生死别。\n\n【山鹧鸪】白居易\n山鹧鸪，朝朝暮暮啼复啼，啼时露白风凄凄。\n黄茅冈头秋日晚，苦竹岭下寒月低。畬田有粟何不啄，\n石楠有枝何不栖。迢迢不缓复不急，楼上舟中声暗入。\n梦乡迁客展转卧，抱儿寡妇彷徨立。山鹧鸪，\n尔本此乡鸟，生不辞巢不别群，何苦声声啼到晓。\n啼到晓，唯能愁北人，南人惯闻如不闻。\n\n【山石榴寄元九】白居易\n山石榴，一名山踯躅，一名杜鹃花，杜鹃啼时花扑扑。\n九江三月杜鹃来，一声催得一枝开。江城上佐闲无事，\n山下劚得厅前栽。烂熳一阑十八树，根株有数花无数。\n千房万叶一时新，嫩紫殷红鲜麹尘。泪痕裛损燕支脸，\n剪刀裁破红绡巾。谪仙初堕愁在世，姹女新嫁娇泥春。\n日射血珠将滴地，风翻火焰欲烧人。闲折两枝持在手，\n细看不似人间有。花中此物似西施，芙蓉芍药皆嫫母。\n奇芳绝艳别者谁，通州迁客元拾遗。拾遗初贬江陵去，\n去时正值青春暮。商山秦岭愁杀君，山石榴花红夹路。\n题诗报我何所云，苦云色似石榴裙。当时丛畔唯思我，\n今日阑前只忆君。忆君不见坐销落，日西风起红纷纷。\n\n【真娘墓（墓在虎丘寺）】白居易\n真娘墓，虎丘道。不识真娘镜中面，唯见真娘墓头草。\n霜摧桃李风折莲，真娘死时犹少年。脂肤荑手不牢固，\n世间尤物难留连。难留连，易销歇。塞北花，江南雪。\n\n【妇人苦】白居易\n蝉鬓加意梳，蛾眉用心扫。几度晓妆成，君看不言好。\n妾身重同穴，君意轻偕老。惆怅去年来，心知未能道。\n今朝一开口，语少意何深。愿引他时事，移君此日心。\n人言夫妇亲，义合如一身。及至死生际，何曾苦乐均。\n妇人一丧夫，终身守孤孑。有如林中竹，忽被风吹折。\n一折不重生，枯死犹抱节。男儿若丧妇，能不暂伤情。\n应似门前柳，逢春易发荣。风吹一枝折，还有一枝生。\n为君委曲言，愿君再三听。须知妇人苦，从此莫相轻。\n\n【潜别离】白居易\n不得哭，潜别离。不得语，暗相思。两心之外无人知。\n深笼夜锁独栖鸟，利剑春断连理枝。河水虽浊有清日，\n乌头虽黑有白时。唯有潜离与暗别，彼此甘心无后期。\n\n【寒食野望吟】白居易\n丘墟郭门外，寒食谁家哭。风吹旷野纸钱飞，\n古墓累累春草绿。棠梨花映白杨树，尽是死生离别处。\n冥寞重泉哭不闻，萧萧墓雨人归去。\n\n【简简吟】白居易\n苏家小女名简简，芙蓉花腮柳叶眼。十一把镜学点妆，\n十二抽针能绣裳。十三行坐事调品，不肯迷头白地藏。\n玲珑云髻生花样，飘飖风袖蔷薇香。殊姿异态不可状，\n忽忽转动如有光。二月繁霜杀桃李，明年欲嫁今年死。\n丈人阿母勿悲啼，此女不是凡夫妻。恐是天仙谪人世，\n只合人间十三岁。大都好物不坚牢，彩云易散琉璃脆。\n\n【醉歌（示伎人商玲珑）】白居易\n罢胡琴，掩秦瑟，玲珑再拜歌初毕。谁道使君不解歌，\n听唱黄鸡与白日。黄鸡催晓丑时鸣，白日催年酉前没。\n腰间红绶系未稳，镜里朱颜看已失。玲珑玲珑奈老何，\n使君歌了汝更歌。\n\n.\n.\n【题故曹王宅（宅在檀溪）】白居易\n甲第何年置，朱门此地开。山当宾阁出，溪绕妓堂回。\n覆井桐新长，阴窗竹旧栽。池荒红菡萏，砌老绿莓苔。\n捐馆梁王去，思人楚客来。西园飞盖处，依旧月裴回。\n\n【酬哥舒大见赠】白居易\n去岁欢游何处去，曲江西岸杏园东。花下忘归因美景，\n尊前劝酒是春风。各从微宦风尘里，共度流年离别中。\n今日相逢愁又喜，八人分散两人同。\n\n【感秋寄远】白居易\n惆怅时节晚，两情千里同。离忧不散处，庭树正秋风。\n燕影动归翼，蕙香销故丛。佳期与芳岁，牢落两成空。\n\n【秋雨中赠元九】白居易\n不堪红叶青苔地，又是凉风暮雨天。\n莫怪独吟秋思苦，比君校近二毛年。\n\n【答韦八】白居易\n丽句劳相赠，佳期恨有违。早知留酒待，悔不趁花归。\n春尽绿醅老，雨多红萼稀。今朝如一醉，犹得及芳菲。\n\n【和友人洛中春感】白居易\n莫悲金谷园中月，莫叹天津桥上春。\n若学多情寻往事，人间何处不伤神。\n\n【寄陆补阙（前年同登科）】白居易\n忽忆前年科第后，此时鸡鹤暂同群。\n秋风惆怅须吹散，鸡在中庭鹤在云。\n\n【曲江忆元九】白居易\n春来无伴闲游少，行乐三分减二分。\n何况今朝杏园里，闲人逢尽不逢君。\n\n【下邽庄南桃花】白居易\n村南无限桃花发，唯我多情独自来。\n日暮风吹红满地，无人解惜为谁开。\n\n【看恽家牡丹花戏赠李二十】白居易\n香胜烧兰红胜霞，城中最数令公家。\n人人散后君须看，归到江南无此花。\n\n【县西郊秋寄赠马造】白居易\n紫阁峰西清渭东，野烟深处夕阳中。风荷老叶萧条绿，\n水蓼残花寂寞红。我厌宦游君失意，可怜秋思两心同。\n\n【酬王十八、李大见招游山】白居易\n自怜幽会心期阻，复愧嘉招书信频。\n王事牵身去不得，满山松雪属他人。\n\n【宿杨家】白居易\n杨氏弟兄俱醉卧，披衣独起下高斋。\n夜深不语中庭立，月照藤花影上阶。\n\n【醉中归盩厔】白居易\n金光门外昆明路，半醉腾腾信马回。\n数日非关王事系，牡丹花尽始归来。\n\n【再因公事到骆口驿】白居易\n今年到时夏云白，去年来时秋树红。\n两度见山心有愧，皆因王事到山中。\n\n【酬赵秀才赠新登科诸先辈】白居易\n莫羡蓬莱鸾鹤侣，道成羽翼自生身。\n君看名在丹台者，尽是人间修道人。\n\n【长安送柳大东归】白居易\n白社羁游伴，青门远别离。浮名相引住，归路不同归。\n\n【社日关路作】白居易\n晚景函关路，凉风社日天。青岩新有燕，红树欲无蝉。\n愁立驿楼上，厌行官堠前。萧条秋兴苦，渐近二毛年。\n\n【乱后过流沟寺】白居易\n九月徐州新战后，悲风杀气满山河。\n唯有流沟山下寺，门前依旧白云多。\n\n【留别吴七正字】白居易\n成名共记甲科上，署吏同登芸阁间。\n唯是尘心殊道性，秋蓬常转水长闲。\n\n【邯郸冬至夜思家】白居易\n邯郸驿里逢冬至，抱膝灯前影伴身。\n想得家中夜深坐，还应说著远行人。\n\n【感故张仆射诸妓】白居易\n黄金不惜买蛾眉，拣得如花三四枝。\n歌舞教成心力尽，一朝身去不相随。\n\n【见尹公亮新诗，偶赠绝句】白居易\n袖里新诗十首馀，吟看句句是琼琚。\n如何持此将干谒，不及公卿一字书。\n\n【秘书省中忆旧山】白居易\n厌从薄宦校青简，悔别故山思白云。\n犹喜兰台非傲吏，归时应免动移文。\n\n【赋得古原草送别】白居易\n离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。\n远芳侵古道，晴翠接荒城。又送王孙去，萋萋满别情。\n\n【病中作（时年十八）】白居易\n久为劳生事，不学摄生道。年少已多病，此身岂堪老。\n\n【旅次景空寺宿幽上人院】白居易\n不与人境接，寺门开向山。暮钟寒鸟聚，秋雨病僧闲。\n月隐云树外，萤飞廊宇间。幸投花界宿，暂得静心颜。\n\n【过高将军墓】白居易\n原上新坟委一身，城中旧宅有何人。妓堂宾阁无归日，\n野草山花又欲春。门客空将感恩泪，白杨风里一沾巾。\n\n【除夜寄弟妹】白居易\n感时思弟妹，不寐百忧生。万里经年别，孤灯此夜情。\n病容非旧日，归思逼新正。早晚重欢会，羁离各长成。\n\n【感芍药花，寄正一上人】白居易\n今日阶前红芍药，几花欲老几花新。开时不解比色相，\n落后始知如幻身。空门此去几多地，欲把残花问上人。\n\n【秋暮郊居书怀】白居易\n郊居人事少，昼卧对林峦。穷巷厌多雨，贫家愁早寒。\n葛衣秋未换，书卷病仍看。若问生涯计，前溪一钓竿。\n\n【途中寒食】白居易\n路旁寒食行人尽，独占春愁在路旁。\n马上垂鞭愁不语，风吹百草野田香。\n\n【感月悲逝者】白居易\n存亡感月一潸然，月色今宵似往年。\n何处曾经同望月，樱桃树下后堂前。\n\n【长安早春旅怀】白居易\n轩车歌吹喧都邑，中有一人向隅立。夜深明月卷帘愁，\n日暮青山望乡泣。风吹新绿草芽坼，雨洒轻黄柳条湿。\n此生知负少年春，不展愁眉欲三十。\n\n【寄湘灵】白居易\n泪眼凌寒冻不流，每经高处即回头。\n遥知别后西楼上，应凭栏干独自愁。\n\n【客中守岁（在柳家庄）】白居易\n守岁尊无酒，思乡泪满巾。始知为客苦，不及在家贫。\n畏老偏惊节，防愁预恶春。故园今夜里，应念未归人。\n\n【宿樟亭驿】白居易\n夜半樟亭驿，愁人起望乡。月明何所见，潮水白茫茫。\n\n【题李次云窗竹】白居易\n不用裁为鸣凤管，不须截作钓鱼竿。\n千花百草凋零后，留向纷纷雪里看。\n\n【题李十一东亭】白居易\n相思夕上松台立，蛩思蝉声满耳秋。\n惆怅东亭风月好，主人今夜在鄜州。\n\n【题施山人野居】白居易\n得道应无著，谋生亦不妨。春泥秧稻暖，夜火焙茶香。\n水巷风尘少，松斋日月长。高闲真是贵，何处觅侯王。\n\n.\n.\n【重寻杏园】白居易\n忽忆芳时频酩酊，却寻醉处重裴回。\n杏花结子春深后，谁解多情又独来。\n\n【同李十一醉忆元九】白居易\n花时同醉破春愁，醉折花枝当酒筹。\n忽忆故人天际去，计程今日到凉州。\n\n【绝句代书赠钱员外】白居易\n欲寻秋景闲行去，君病多慵我兴孤。\n可惜今朝山最好，强能骑马出来无。\n\n【禁中九日对菊花酒忆元九】白居易\n赐酒盈杯谁共持，宫花满把独相思。\n相思只傍花边立，尽日吟君咏菊诗。\n\n【答张籍，因以代书】白居易\n怜君马瘦衣裘薄，许到江东访鄙夫。\n今日正闲天又暖，可能扶病暂来无。\n\n【见元九悼亡诗，因以此寄】白居易\n夜泪暗销明月幌，春肠遥断牡丹庭。\n人间此病治无药，唯有楞伽四卷经。\n\n【杏园花落时招钱员外同醉】白居易\n花园欲去去应迟，正是风吹狼藉时。\n近西数树犹堪醉，半落春风半在枝。\n\n【同钱员外禁中夜直】白居易\n宫漏三声知半夜，好风凉月满松筠。\n此时闲坐寂无语，药树影中唯两人。\n\n【寄陈式五兄】白居易\n年来白发两三茎，忆别君时髭未生。\n惆怅料君应满鬓，当初是我十年兄。\n\n【送元八归凤翔】白居易\n莫道岐州三日程，其如风雪一身行。\n与君况是经年别，暂到城来又出城。\n\n【咏怀】白居易\n岁去年来尘土中，眼看变作白头翁。\n如何办得归山计，两顷村田一亩宫。\n\n【酬钱员外雪中见寄】白居易\n松雪无尘小院寒，闭门不似住长安。\n烦君想我看心坐，报道心空无可看。\n\n【微之宅残牡丹】白居易\n残红零落无人赏，雨打风摧花不全。\n诸处见时犹怅望，况当元九小亭前。\n\n【感发落】白居易\n昔日愁头白，谁知未白衰。眼看应落尽，无可变成丝。\n\n【酬王十八见寄】白居易\n秋思太白峰头雪，晴忆仙游洞口云。\n未报皇恩归未得，惭君为寄北山文。\n\n【晚秋夜】白居易\n碧空溶溶月华静，月里愁人吊孤影。花开残菊傍疏篱，\n叶下衰桐落寒井。塞鸿飞急觉秋尽，邻鸡鸣迟知夜永。\n凝情不语空所思，风吹白露衣裳冷。\n\n【答元奉礼同宿见赠】白居易\n相逢俱叹不闲身，直日常多斋日频。\n晓鼓一声分散去，明朝风景属何人。\n\n【上巳日恩赐曲江宴会即事】白居易\n赐欢仍许醉，此会兴如何。翰苑主恩重，曲江春意多。\n花低羞艳妓，莺散让清歌。共道升平乐，元和胜永和。\n\n【和钱员外早冬玩禁中新菊】白居易\n禁署寒气迟，孟冬菊初坼。新黄间繁绿，烂若金照碧。\n仙郎小隐日，心似陶彭泽。秋怜潭上看，日惯篱边摘。\n今来此地赏，野意潜自适。金马门内花，玉山峰下客。\n寒芳引清句，吟玩烟景夕。赐酒色偏宜，握兰香不敌。\n凄凄百卉死，岁晚冰霜积。唯有此花开，殷勤助君惜。\n\n【凉夜有怀】白居易\n念别感时节，早蛩闻一声。风帘夜凉入，露簟秋意生。\n灯尽梦初罢，月斜天未明。暗凝无限思，起傍药阑行。\n\n【禁中闻蛩】白居易\n悄悄禁门闭，夜深无月明。西窗独暗坐，满耳新蛩声。\n\n【赠别宣上人】白居易\n上人处世界，清净何所似。似彼白莲花，在水不著水。\n性真悟泡幻，行洁离尘滓。修道来几时，身心俱到此。\n嗟余牵世网，不得长依止。离念与碧云，秋来朝夕起。\n\n【答骑马入空台】白居易\n君入空台去，朝往暮还来。我入泉台去，泉门无复开。\n鳏夫仍系职，稚女未胜哀。寂寞咸阳道，家人覆墓回。\n\n【忆元九】白居易\n渺渺江陵道，相思远不知。近来文卷里，半是忆君诗。\n\n【寄内】白居易\n条桑初绿即为别，柿叶半红犹未归。\n不如村妇知时节，解为田夫秋捣衣。\n\n【叹元九】白居易\n不入城门来五载，同时班列尽官高。\n何人牢落犹依旧，唯有江陵元士曹。\n\n【得袁相书】白居易\n谷苗深处一农夫，面黑头斑手把锄。\n何意使人犹识我，就田来送相公书。\n\n【游悟贞寺回山下别张殷衡】白居易\n世缘未了治不得，孤负青山心共知。\n愁君又入都门去，即是红尘满眼时。\n\n【病中得樊大书】白居易\n荒村破屋经年卧，寂绝无人问病身。\n唯有东都樊著作，至今书信尚殷勤。\n\n【昼卧】白居易\n抱枕无言语，空房独悄然。谁知尽日卧，非病亦非眠。\n\n【暮立】白居易\n黄昏独立佛堂前，满地槐花满树蝉。\n大抵四时心总苦，就中肠断是秋天。\n\n【答友问】白居易\n似玉童颜尽，如霜病鬓新。莫惊身顿老，心更老于身。\n\n【闻虫】白居易\n暗虫唧唧夜绵绵，况是秋阴欲雨天。\n犹恐愁人暂得睡，声声移近卧床前。\n\n【赠内】白居易\n漠漠暗苔新雨地，微微凉露欲秋天。\n莫对月明思往事，损君颜色减君年。\n\n【还李十一马】白居易\n传语李君劳寄马，病来唯著杖扶身。\n纵拟强骑无出处，却将牵与趁朝人。\n\n【夜坐】白居易\n斜月入前楹，迢迢夜坐情。梧桐上阶影，蟋蟀近床声。\n曙傍窗间至，秋从簟上生。感时因忆事，不寝到鸡鸣。\n\n【早春】白居易\n雪散因和气，冰开得暖光。春销不得处，唯有鬓边霜。\n\n【王昭君二首（时年十七）】白居易\n满面胡沙满鬓风，眉销残黛脸销红。\n愁苦辛勤憔悴尽，如今却似画图中。\n\n汉使却回凭寄语，黄金何日赎蛾眉。\n君王若问妾颜色，莫道不如宫里时。\n\n.\n.\n【渭村酬李二十见寄】白居易\n百里音书何太迟，暮秋把得暮春诗。柳条绿日君相忆，\n梨叶红时我始知。莫叹学官贫冷落，犹胜村客病支离。\n形容意绪遥看取，不似华阳观里时。\n\n【欲与元八卜邻，先有是赠】白居易\n平生心迹最相亲，欲隐墙东不为身。明月好同三径夜，\n绿杨宜作两家春。每因暂出犹思伴，岂得安居不择邻。\n何独终身数相见，子孙长作隔墙人。\n\n【重到城七绝句 见元九】白居易\n容貌一日减一日，心情十分无九分。\n每逢陌路犹嗟叹，何况今朝是见君。\n\n【重到城七绝句 张十八】白居易\n谏垣几见迁遗补，宪府频闻转殿监。\n独有咏诗张太祝，十年不改旧官衔。\n\n【重到城七绝句 裴五】白居易\n莫怪相逢无笑语，感今思旧戟门前。\n张家伯仲偏相似，每见清扬一惘然。\n\n【重到城七绝句 恒寂师】白居易\n旧游分散人零落，如此伤心事几条。\n会逐禅师坐禅去，一时灭尽定中消。\n\n【重伤小女子】白居易\n学人言语凭床行，嫩似花房脆似琼。才知恩爱迎三岁，\n未辨东西过一生。汝异下殇应杀礼，吾非上圣讵忘情。\n伤心自叹鸠巢拙，长堕春雏养不成。\n\n【赋得听边鸿】白居易\n惊风吹起塞鸿群，半拂平沙半入云。\n为问昭君月下听，何如苏武雪中闻。\n\n【病中早春】白居易\n今朝枕上觉头轻，强起阶前试脚行。膻腻断来无气力，\n风痰恼得少心情。暖消霜瓦津初合，寒减冰渠冻不成。\n唯有愁人鬓间雪，不随春尽逐春生。\n\n【曲江醉后赠诸亲故】白居易\n郭东丘墓何年客，江畔风光几日春。只合殷勤逐杯酒，\n不须疏索向交亲。中天或有长生药，下界应无不死人。\n除却醉来开口笑，世间何事更关身。\n\n【醉后却寄元九】白居易\n蒲池村里匆匆别，沣水桥边兀兀回。\n行到城门残酒醒，万重离恨一时来。\n\n【重到华阳观旧居】白居易\n忆昔初年三十二，当时秋思已难堪。\n若为重入华阳院，病鬓愁心四十三。\n\n【题王侍御池亭】白居易\n朱门深锁春池满，岸落蔷薇水浸莎。\n毕竟林塘谁是主，主人来少客来多。\n\n【雨夜忆元九】白居易\n天阴一日便堪愁，何况连宵雨不休。\n一种雨中君最苦，偏梁阁道向通州。\n\n【赠杨秘书巨源】白居易\n早闻一箭取辽城，相识虽新有故情。清句三朝谁是敌，\n白须四海半为兄。贫家薙草时时入，瘦马寻花处处行。\n不用更教诗过好，折君官职是声名。\n\n【寄生衣与微之，因题封上】白居易\n浅色縠衫轻似雾，纺花纱袴薄于云。\n莫嫌轻薄但知著，犹恐通州热杀君。\n\n【梦旧】白居易\n别来老大苦修道，炼得离心成死灰。\n平生忆念消磨尽，昨夜因何入梦来。\n\n【曲江夜归，闻元八见访】白居易\n自入台来见面稀，班中遥得揖容辉。\n早知相忆来相访，悔待江头明月归。\n\n【病中答招饮者】白居易\n顾我镜中悲白发，尽君花下醉青春。\n不缘眼痛兼身病，可是尊前第二人。\n\n【韩公堆寄元九】白居易\n韩公堆北涧西头，冷雨凉风拂面秋。\n努力南行少惆怅，江州犹似胜通州。\n\n【红鹦鹉（商山路逢）】白居易\n安南远进红鹦鹉，色似桃花语似人。\n文章辩慧皆如此，笼槛何年出得身。\n\n【罢药】白居易\n自学坐禅休服药，从他时复病沉沉。\n此身不要全强健，强健多生人我心。\n\n【襄阳舟夜】白居易\n下马襄阳郭，移舟汉阴驿。秋风截江起，寒浪连天白。\n本是多愁人，复此风波夕。\n\n【红藤杖】白居易\n交亲过浐别，车马到江回。唯有红藤杖，相随万里来。\n\n【途中感秋】白居易\n节物行摇落，年颜坐变衰。树初黄叶日，人欲白头时。\n乡国程程远，亲朋处处辞。唯残病与老，一步不相离。\n\n【舟夜赠内】白居易\n三声猿后垂乡泪，一叶舟中载病身。\n莫凭水窗南北望，月明月暗总愁人。\n\n【臼口阻风十日】白居易\n洪涛白浪塞江津，处处邅回事事迍。世上方为失途客，\n江头又作阻风人。鱼虾遇雨腥盈鼻，蚊蚋和烟痒满身。\n老大光阴能几日，等闲臼口坐经旬。\n\n【舟中读元九诗】白居易\n把君诗卷灯前读，诗尽灯残天未明。\n眼痛灭灯犹暗坐，逆风吹浪打船声。\n\n【雨中题衰柳】白居易\n湿屈青条折，寒飘黄叶多。不知秋雨意，更遣欲如何。\n\n【岁晚旅望】白居易\n朝来暮去星霜换，阴惨阳舒气序牵。万物秋霜能坏色，\n四时冬日最凋年。烟波半露新沙地，鸟雀群飞欲雪天。\n向晚苍苍南北望，穷阴旅思两无边。\n\n【题李山人】白居易\n厨无烟火室无妻，篱落萧条屋舍低。\n每日将何疗饥渴，井华云粉一刀圭。\n\n【江楼偶宴赠同座】白居易\n南浦闲行罢，西楼小宴时。望湖凭槛久，待月放杯迟。\n江果尝卢橘，山歌听竹枝。相逢且同乐，何必旧相知。\n\n【岁暮道情二首】白居易\n壮日苦曾惊岁月，长年都不惜光阴。\n为学空门平等法，先齐老少死生心。\n\n半故青衫半白头，雪风吹面上江楼。\n禅功自见无人觉，合是愁时亦不愁。\n\n【强酒】白居易\n若不坐禅销妄想，即须行醉放狂歌。\n不然秋月春风夜，争那闲思往事何。\n\n【听崔七妓人筝】白居易\n花脸云鬟坐玉楼，十三弦里一时愁。\n凭君向道休弹去，白尽江州司马头。\n\n【初到江州】白居易\n浔阳欲到思无穷，庾亮楼南湓口东。树木凋疏山雨后，\n人家低湿水烟中。菰蒋喂马行无力，芦荻编房卧有风。\n遥见朱轮来出郭，相迎劳动使君公。\n\n【谪居】白居易\n面瘦头斑四十四，远谪江州为郡吏。逢时弃置从不才，\n未老衰羸为何事。火烧寒涧松为烬，霜降春林花委地。\n遭时荣悴一时间，岂是昭昭上天意。\n\n【庾楼晓望】白居易\n独凭朱槛立凌晨，山色初明水色新。竹雾晓笼衔岭月，\n蘋风暖送过江春。子城阴处犹残雪，衙鼓声前未有尘。\n三百年来庾楼上，曾经多少望乡人。\n\n【江楼宴别】白居易\n楼中别曲催离酌，灯下红裙间绿袍。缥缈楚风罗绮薄，\n铮鏦越调管弦高。寒流带月澄如镜，夕吹和霜利似刀。\n尊酒未空欢未尽，舞腰歌袖莫辞劳。\n\n【代春赠】白居易\n山吐晴岚水放光，辛夷花白柳梢黄。\n但知莫作江西意，风景何曾异帝乡。\n\n【樱桃花下叹白发】白居易\n逐处花皆好，随年貌自衰。红樱满眼日，白发半头时。\n倚树无言久，攀条欲放迟。临风两堪叹，如雪复如丝。\n\n【移山樱桃】白居易\n亦知官舍非吾宅，且劚山樱满院栽。\n上佐近来多五考，少应四度见花开。\n\n【北楼送客归上都】白居易\n凭高眺远一凄凄，却下朱阑即解携。京路人归天直北，\n江楼客散日平西。长津欲度回渡尾，残酒重倾簇马蹄。\n不独别君须强饮，穷愁自要醉如泥。\n\n【游宝称寺】白居易\n竹寺初晴日，花塘欲晓春。野猿疑弄客，山鸟似呼人。\n酒嫩倾金液，茶新碾玉尘。可怜幽静地，堪寄老慵身。\n\n【见紫薇花忆微之】白居易\n一丛暗淡将何比，浅碧笼裙衬紫巾。\n除却微之见应爱，人间少有别花人。\n\n【湖亭望水】白居易\n久雨南湖涨，新晴北客过。日沉红有影，风定绿无波。\n岸没闾阎少，滩平船舫多。可怜心赏处，其奈独游何。\n\n【过郑处士】白居易\n闻道移居村坞间，竹林多处独开关。\n故来不是求他事，暂借南亭一望山。\n\n【春末夏初闲游江郭二首】白居易\n闲出乘轻屐，徐行蹋软沙。观鱼傍湓浦，看竹入杨家。\n林迸穿篱笋，藤飘落水花。雨埋钓舟小，风飏酒旗斜。\n嫩剥青菱角，浓煎白茗芽。淹留不知夕，城树欲栖鸦。\n\n柳影繁初合，莺声涩渐稀。早梅迎夏结，残絮送春飞。\n西日韶光尽，南风暑气微。展张新小簟，熨帖旧生衣。\n绿蚁杯香嫩，红丝脍缕肥。故园无此味，何必苦思归。\n\n【题庐山山下汤泉】白居易\n一眼汤泉流向东，浸泥浇草暖无功。\n骊山温水因何事，流入金铺玉甃中。\n\n【秋热】白居易\n西江风候接南威，暑气常多秋气微。\n犹道江州最凉冷，至今九月著生衣。\n\n【晚出西郊】白居易\n散吏闲如客，贫州冷似村。早凉湖北岸，残照郭西门。\n懒镊从须白，休治任眼昏。老来何所用，少兴不多言。\n\n【端居咏怀】白居易\n贾生俟罪心相似，张翰思归事不如。斜日早知惊鵩鸟，\n秋风悔不忆鲈鱼。胸襟曾贮匡时策，怀袖犹残谏猎书。\n从此万缘都摆落，欲携妻子买山居。\n\n【百花亭】白居易\n朱槛在空虚，凉风八月初。山形如岘首，江色似桐庐。\n佛寺乘船入，人家枕水居。高亭仍有月，今夜宿何如。\n\n【送客之湖南】白居易\n年年渐见南方物，事事堪伤北客情。山鬼趫跳唯一足，\n峡猿哀怨过三声。帆开青草湖中去，衣湿黄梅雨里行。\n别后双鱼难定寄，近来潮不到湓城。\n\n【西楼】白居易\n小郡大江边，危楼夕照前。青芜卑湿地，白露泬寥天。\n乡国此时阻，家书何处传。仍闻陈蔡戍，转战已三年。\n\n【四十五】白居易\n行年四十五，两鬓半苍苍。清瘦诗成癖，粗豪酒放狂。\n老来尤委命，安处即为乡。或拟庐山下，来春结草堂。\n\n【厅前桂】白居易\n天台岭上凌霜树，司马厅前委地丛。\n一种不生明月里，山中犹校胜尘中。\n\n【秋晚】白居易\n篱菊花稀砌桐落，树阴离离日色薄。单幕疏帘贫寂寞，\n凉风冷露秋萧索。光阴流转忽已晚，颜色凋残不如昨。\n莱妻卧病月明时，不捣寒衣空捣药。\n\n【除夜】白居易\n薄晚支颐坐，中宵枕臂眠。一从身去国，再见日周天。\n老度江南岁，春抛渭北田。浔阳来早晚，明日是三年。\n\n【庾楼新岁】白居易\n岁时销旅貌，风景触乡愁。牢落江湖意，新年上庾楼。\n\n【忆微之】白居易\n与君何日出屯蒙，鱼恋江湖鸟厌笼。分手各抛沧海畔，\n折腰俱老绿衫中。三年隔阔音尘断，两地飘零气味同。\n又被新年劝相忆，柳条黄软欲春风。\n\n【寒食江畔】白居易\n草香沙暖水云晴，风景令人忆帝京。还似往年春气味，\n不宜今日病心情。闻莺树下沈吟立，信马江头取次行。\n忽见紫桐花怅望，下邽明日是清明。\n\n【石榴树（一作石楠树）】白居易\n可怜颜色好阴凉，叶翦红笺花扑霜。伞盖低垂金翡翠，\n熏笼乱搭绣衣裳。春芽细炷千灯焰，夏蕊浓焚百和香。\n见说上林无此树，只教桃柳占年芳。\n\n【咏怀】白居易\n自从委顺任浮沈，渐觉年多功用深。面上减除忧喜色，\n胸中消尽是非心。妻儿不问唯耽酒，冠盖皆慵只抱琴。\n长笑灵均不知命，江蓠丛畔苦悲吟。\n\n【箬岘东池】白居易\n箬岘亭东有小池，早荷新荇绿参差。\n中宵把火行人发，惊起双栖白鹭鸶。\n\n【哭从弟】白居易\n伤心一尉便终身，叔母年高新妇贫。\n一片绿衫消不得，腰金拖紫是何人。\n\n【重题】白居易\n喜入山林初息影，厌趋朝市久劳生。早年薄有烟霞志，\n岁晚深谙世俗情。已许虎溪云里卧，不争龙尾道前行。\n从兹耳界应清净，免见啾啾毁誉声。\n\n长松树下小溪头，班鹿胎巾白布裘。药圃茶园为产业，\n野麋林鹤是交游。云生涧户衣裳润，岚隐山厨火烛幽。\n最爱一泉新引得，清泠屈曲绕阶流。\n\n日高睡足犹慵起，小阁重衾不怕寒。遗爱寺钟欹枕听，\n香炉峰雪拨帘看。匡庐便是逃名地，司马仍为送老官。\n心泰身宁是归处，故乡何独在长安。\n\n宦途自此心长别，世事从今口不言。岂止形骸同土木，\n兼将寿夭任乾坤。胸中壮气犹须遣，身外浮荣何足论。\n还有一条遗恨事，高家门馆未酬恩。\n\n【临水坐】白居易\n昔为东掖垣中客，今作西方社内人。\n手把杨枝临水坐，闲思往事似前身。\n\n【遗爱寺】白居易\n弄日临溪坐，寻花绕寺行。时时闻鸟语，处处是泉声。\n\n【黄石岩下作】白居易\n久别鹓鸾侣，深随鸟兽群。教他远亲故，何处觅知闻。\n昔日青云意，今移向白云。\n\n【江亭夕望】白居易\n凭高望远思悠哉，晚上江亭夜未回。日欲没时红浪沸，\n月初生处白烟开。辞枝雪蕊将春去，满镊霜毛送老来。\n争敢三年作归计，心知不及贾生才。\n\n【偶然二首】白居易\n楚怀邪乱灵均直，放弃合宜何恻恻。汉文明圣贾生贤，\n谪向长沙堪叹息。人事多端何足怪，天文至信犹差忒。\n月离于毕合滂沱，有时不雨何能测。\n\n火发城头鱼水里，救火竭池鱼失水。乖龙藏在牛领中，\n雷击龙来牛枉死。人道蓍神龟骨灵，试卜鱼牛那至此。\n六十四卦七十钻，毕竟不能知所以。\n\n【谢李六郎中寄新蜀茶】白居易\n故情周匝向交亲，新茗分张及病身。红纸一封书后信，\n绿芽十片火前春。汤添勺水煎鱼眼，末下刀圭搅麹尘。\n不寄他人先寄我，应缘我是别茶人。\n\n【彭蠡湖晚归】白居易\n彭蠡湖天晚，桃花水气春。鸟飞千白点，日没半红轮。\n何必为迁客，无劳是病身。何来临此望，少有不愁人。\n\n【西河雨夜送客】白居易\n云黑雨翛翛，江昏水暗流。有风催解缆，无月伴登楼。\n酒罢无多兴，帆开不少留。唯看一点火，遥认是行舟。\n\n【罗子】白居易\n有女名罗子，生来才两春。我今年已长，日夜二毛新。\n顾念娇啼面，思量老病身。直应头似雪，始得见成人。\n\n【昭君怨】白居易\n明妃风貌最娉婷，合在椒房应四星。只得当年备宫掖，\n何曾专夜奉帏屏。见疏从道迷图画，知屈那教配虏庭。\n自是君恩薄如纸，不须一向恨丹青。\n\n【戏问山石榴】白居易\n小树山榴近砌栽，半含红萼带花来。\n争知司马夫人妒，移到庭前便不开。\n\n【湖上闲望】白居易\n藤花浪拂紫茸条，菰叶风翻绿剪刀。\n闲弄水芳生楚思，时时合眼咏离骚。\n\n.\n.\n【清明日送韦侍御贬虔州】白居易\n寂寞清明日，萧条司马家。留饧和冷粥，出火煮新茶。\n欲别能无酒，相留亦有花。南迁更何处，此地已天涯。\n\n【晚题东林寺双池】白居易\n向晚双池好，初晴百物新。袅枝翻翠羽，溅水跃红鳞。\n萍泛同游子，莲开当丽人。临流一惆怅，还忆曲江春。\n\n【送客春游岭南二十韵】白居易\n已讶游何远，仍嗟别太频。离容君蹙促，赠语我殷勤。\n迢递天南面，苍茫海北漘。诃陵国分界，交趾郡为邻。\n蓊郁三光晦，温暾四气匀。阴晴变寒暑，昏晓错星辰。\n瘴地难为老，蛮陬不易驯。土民稀白首，洞主尽黄巾。\n战舰犹惊浪，戎车未息尘。红旗围卉服，紫绶裹文身。\n面苦桄榔裛，浆酸橄榄新。牙樯迎海舶，铜鼓赛江神。\n不冻贪泉暖，无霜毒草春。云烟蟒蛇气，刀剑鳄鱼鳞。\n路足羁栖客，官多谪逐臣。天黄生飓母，雨黑长枫人。\n回使先传语，征轩早返轮。须防杯里蛊，莫爱橐中珍。\n北与南殊俗，身将货孰亲。尝闻君子诫，忧道不忧贫。\n\n【自悲】白居易\n火宅煎熬地，霜松摧折身。因知群动内，易死不过人。\n\n【浔阳春三首 春来】白居易\n春来触地故乡情，忽见风光忆两京。金谷踏花香骑入，\n曲江碾草钿车行。谁家绿酒欢连夜，何处红楼睡失明。\n独有不眠不醉客，经春冷坐古湓城。\n\n【赠韦炼师】白居易\n浔阳迁客为居士，身似浮云心似灰。上界女仙无嗜欲，\n何因相顾两裴回。共疑过去人间世，曾作谁家夫妇来。\n\n【南湖早春】白居易\n风回云断雨初晴，返照湖边暖复明。乱点碎红山杏发，\n平铺新绿水蘋生。翅低白雁飞仍重，舌涩黄鹂语未成。\n不道江南春不好，年年衰病减心情。\n\n【题韦家泉池】白居易\n泉落青山出白云，萦村绕郭几家分。\n自从引作池中水，深浅方圆一任君。\n\n【遣怀】白居易\n羲和走驭趁年光，不许人间日月长。遂使四时都似电，\n争教两鬓不成霜。荣销枯去无非命，壮尽衰来亦是常。\n已共身心要约定，穷通生死不惊忙。\n\n【闻龟儿咏诗】白居易\n怜渠已解咏诗章，摇膝支颐学二郎。\n莫学二郎吟太苦，才年四十鬓如霜。\n\n【病起】白居易\n病不出门无限时，今朝强出与谁期。\n经年不上江楼醉，劳动春风飏酒旗。\n\n【赠写真者】白居易\n子骋丹青日，予当丑老时。无劳役神思，更画病容仪。\n迢递麒麟阁，图功未有期。区区尺素上，焉用写真为。\n\n【闲意】白居易\n不争荣耀任沉沦，日与时疏共道亲。北省朋僚音信断，\n东林长老往还频。病停夜食闲如社，慵拥朝裘暖似春。\n渐老渐谙闲气味，终身不拟作忙人。\n\n【夜送孟司功】白居易\n浔阳白司马，夜送孟功曹。江暗管弦急，楼明灯火高。\n湖波翻似箭，霜草杀如刀。且莫开征棹，阴风正怒号。\n\n【题诗屏风绝句】白居易\n相忆采君诗作障，自书自勘不辞劳。\n障成定被人争写，从此南中纸价高。\n\n【偶宴有怀】白居易\n遇兴寻文客，因欢命酒徒。春游忆亲故，夜会似京都。\n诗思闲仍在，乡愁醉暂无。狂来欲起舞，惭见白髭须。\n\n【山枇杷】白居易\n深山老去惜年华，况对东溪野枇杷。火树风来翻绛焰，\n琼枝日出晒红纱。回看桃李都无色，映得芙蓉不是花。\n争奈结根深石底，无因移得到人家。\n\n【岁暮】白居易\n穷阴急景坐相催，壮齿韶颜去不回。旧病重因年老发，\n新愁多是夜长来。膏明自爇缘多事，雁默先烹为不才。\n祸福细寻无会处，不如且进手中杯。\n\n【李白墓】白居易\n采石江边李白坟，绕田无限草连云。可怜荒垄穷泉骨，\n曾有惊天动地文。但是诗人多薄命，就中沦落不过君。\n\n【戏答诸少年】白居易\n顾我长年头似雪，饶君壮岁气如云。\n朱颜今日虽欺我，白发他时不放君。\n\n【题崔使君新楼】白居易\n忧人何处可销忧，碧瓮红栏湓水头。\n从此浔阳风月夜，崔公楼替庾公楼。\n\n【赠昙禅师（梦中作）】白居易\n五年不入慈恩寺，今日寻师始一来。\n欲知火宅焚烧苦，方寸如今化作灰。\n\n【醉吟二首】白居易\n空王百法学未得，姹女丹砂烧即飞。\n事事无成身老也，醉乡不去欲何归。\n\n两鬓千茎新似雪，十分一醆欲如泥。\n酒狂又引诗魔发，日午悲吟到日西。\n\n【答元八郎中、杨十二博士】白居易\n身觉浮云无所著，心同止水有何情。但知潇洒疏朝市，\n不要崎岖隐姓名。尽日观鱼临涧坐，有时随鹿上山行。\n谁能抛得人间事，来共腾腾过此生。\n\n【八月十五日夜湓亭望月】白居易\n昔年八月十五夜，曲江池畔杏园边。今年八月十五夜，\n湓浦沙头水馆前。西北望乡何处是，东南见月几回圆。\n临风一叹无人会，今夜清光似往年。\n\n【残暑招客】白居易\n云截山腰断，风驱雨脚回。早阴江上散，残热日中来。\n却取生衣著，重拈竹簟开。谁能淘晚热，闲饮两三杯。\n\n【九日醉吟】白居易\n有恨头还白，无情菊自黄。一为州司马，三见岁重阳。\n剑匣尘埃满，笼禽日月长。身从渔父笑，门任雀罗张。\n问疾因留客，听吟偶置觞。叹时论倚伏，怀旧数存亡。\n奈老应无计，治愁或有方。无过学王绩，唯以醉为乡。\n\n【赠李兵马使】白居易\n身得贰师馀气概，家藏都尉旧诗章。\n江南别有楼船将，燕颔虬须不姓杨。\n\n【三月三日怀微之】白居易\n良时光景长虚掷，壮岁风情已暗销。\n忽忆同为校书日，每年同醉是今朝。\n\n【春江闲步，赠张山人】白居易\n江景又妍和，牵愁发浩歌。晴沙金屑色，春水麹尘波。\n红簇交枝杏，青含卷叶荷。藉莎怜软暖，憩树爱婆娑。\n书信朝贤断，知音野老多。相逢不闲语，争奈日长何。\n\n【吴宫辞】白居易\n一入吴王殿，无人睹翠娥。楼高时见舞，宫静夜闻歌。\n半露胸如雪，斜回脸似波。妍媸各有分，谁敢妒恩多。\n\n【除忠州，寄谢崔相公】白居易\n提拔出泥知力竭，吹嘘生翅见情深。剑锋缺折难冲斗，\n桐尾烧焦岂望琴。感旧两行年老泪，酬恩一寸岁寒心。\n忠州好恶何须问，鸟得辞笼不择林。\n\n【洪州逢熊孺登】白居易\n靖安院里辛夷下，醉笑狂吟气最粗。\n莫问别来多少苦，低头看取白髭须。\n\n【又答贺客】白居易\n银章暂假为专城，贺客来多懒起迎。\n似挂绯衫衣架上，朽株枯竹有何荣。\n\n【钟陵饯送】白居易\n翠幕红筵高在云，歌钟一曲万家闻。\n路人指点滕王阁，看送忠州白使君。\n\n【戏赠户部李巡官】白居易\n好去民曹李判官，少贪公事且谋欢。\n男儿未死争能料，莫作忠州刺史看。\n\n【重赠李大夫】白居易\n早接清班登玉陛，同承别诏直金銮。凤巢阁上容身稳，\n鹤锁笼中展翅难。流落多年应是命，量移远郡未成官。\n惭君独不欺憔悴，犹作银台旧眼看。\n\n【题岳阳楼】白居易\n岳阳城下水漫漫，独上危楼倚曲栏。春岸绿时连梦泽，\n夕波红处近长安。猿攀树立啼何苦，雁点湖飞渡亦难。\n此地唯堪画图障，华堂张与贵人看。\n\n【题峡中石上】白居易\n巫女庙花红似粉，昭君村柳翠于眉。\n诚知老去风情少，见此争无一句诗。\n\n.\n.\n【赠康叟】白居易\n八十秦翁老不归，南宾太守乞寒衣。\n再三怜汝非他意，天宝遗民见渐稀。\n\n【东城春意】白居易\n风软云不动，郡城东北隅。晚来春澹澹，天气似京都。\n弦管随宜有，杯觞不道无。其如亲故远，无可共欢娱。\n\n【种桃杏】白居易\n无论海角与天涯，大抵心安即是家。路远谁能念乡曲，\n年深兼欲忘京华。忠州且作三年计，种杏栽桃拟待花。\n\n【龙昌寺荷池】白居易\n冷碧新秋水，残红半破莲。从来寥落意，不似此池边。\n\n【寄胡饼与杨万州】白居易\n胡麻饼样学京都，面脆油香新出炉。\n寄与饥馋杨大使，尝看得似辅兴无。\n\n【东亭闲望】白居易\n东亭尽日坐，谁伴寂寥身。绿桂为佳客，红蕉当美人。\n笑言虽不接，情状似相亲。不作悠悠想，如何度晚春。\n\n【和李澧州题韦开州经藏诗】白居易\n既悟莲花藏，须遗贝叶书。菩提无处所，文字本空虚。\n观指非知月，忘筌是得鱼。闻君登彼岸，舍筏复何如。\n\n【即事寄微之】白居易\n畬田涩米不耕锄，旱地荒园少菜蔬。想念土风今若此，\n料看生计合何如。衣缝纰颣黄丝绢，饭下腥咸白小鱼。\n饱暖饥寒何足道，此身长短是空虚。\n\n【留北客】白居易\n峡外相逢远，樽前一会难。即须分手别，且强展眉欢。\n楚袖萧条舞，巴弦趣数弹。笙歌随分有，莫作帝乡看。\n\n【和行简望郡南山】白居易\n反照前山云树明，从君苦道似华清。\n试听肠断巴猿叫，早晚骊山有此声。\n\n【阴雨】白居易\n岚雾今朝重，江山此地深。滩声秋更急，峡气晓多阴。\n望阙云遮眼，思乡雨滴心。将何慰幽独，赖此北窗琴。\n\n【送萧处士游黔南】白居易\n能文好饮老萧郎，身似浮云鬓似霜。生计抛来诗是业，\n家园忘却酒为乡。江从巴峡初成字，猿过巫阳始断肠。\n不醉黔中争去得，磨围山月正苍苍。\n\n【东楼招客夜饮】白居易\n莫辞数数醉东楼，除醉无因破得愁。\n唯有绿樽红烛下，暂时不似在忠州。\n\n【冬至夜】白居易\n老去襟怀常濩落，病来须鬓转苍浪。心灰不及炉中火，\n鬓雪多于砌下霜。三峡南宾城最远，一年冬至夜偏长。\n今宵始觉房栊冷，坐索寒衣托孟光。\n\n【酬严中丞晚眺黔江见寄】白居易\n江水三回曲，愁人两地情。磨围山下色，明月峡中声。\n晚后连天碧，秋来彻底清。临流有新恨，照见白须生。\n\n【答杨使君登楼见忆】白居易\n忠万楼中南北望，南州烟水北州云。\n两州何事偏相忆，各是笼禽作使君。\n\n【闻雷】白居易\n瘴地风霜早，温天气候催。穷冬不见雪，正月已闻雷。\n震蛰虫蛇出，惊枯草木开。空馀客方寸，依旧似寒灰。\n\n【感春】白居易\n巫峡中心郡，巴城四面春。草青临水地，头白见花人。\n忧喜皆心火，荣枯是眼尘。除非一杯酒，何物更关身。\n\n【巴水】白居易\n城下巴江水，春来似麹尘。软沙如渭曲，斜岸忆天津。\n影蘸新黄柳，香浮小白蘋。临流搔首坐，惆怅为何人。\n\n【送高侍御使回，因寄杨八】白居易\n明月峡边逢制使，黄茅岸上是忠州。\n到城莫说忠州恶，无益虚教杨八愁。\n\n【戏赠萧处士、清禅师】白居易\n三杯嵬峨忘机客，百衲头陀任运僧。\n又有放慵巴郡守，不营一事共腾腾。\n\n【三月三日】白居易\n暮春风景初三日，流世光阴半百年。\n欲作闲游无好伴，半江惆怅却回船。\n\n【代州民问】白居易\n龙昌寺底开山路，巴子台前种柳林。\n官职家乡都忘却，谁人会得使君心。\n\n【荔枝楼对酒】白居易\n荔枝新熟鸡冠色，烧酒初开琥珀香。\n欲摘一枝倾一醆，西楼无客共谁尝。\n\n【醉后赠人】白居易\n香球趁拍回环匼，花醆抛巡取次飞。\n自入春来未同醉，那能夜去独先归。\n\n【留题开元寺上方】白居易\n东寺台阁好，上方风景清。数来犹未厌，长别岂无情。\n恋水多临坐，辞花剩绕行。最怜新岸柳，手种未全成。\n\n【别桥上竹】白居易\n穿桥迸竹不依行，恐碍行人被损伤。\n我去自惭遗爱少，不教君得似甘棠。\n\n【棣华驿见杨八题梦兄弟诗】白居易\n遥闻旅宿梦兄弟，应为邮亭名棣华。\n名作棣华来早晚，自题诗后属杨家。\n\n【恻恻吟】白居易\n恻恻复恻恻，逐臣返乡国。前事难重论，少年不再得。\n泥涂绛老头班白，炎瘴灵均面黎黑。六年不死却归来，\n道著姓名人不识。\n\n【昭德皇后挽歌词】白居易\n仙去逍遥境，诗留窈窕章。春归金屋少，夜入寿宫长。\n凤引曾辞辇，蚕休昔采桑。阴灵何处感，沙麓月无光。\n\n【小曲新词二首】白居易\n霁色鲜宫殿，秋声脆管弦。圣明千岁乐，岁岁似今年。\n\n红裾明月夜，碧簟早秋时。好向昭阳宿，天凉玉漏迟。\n\n【残春曲（禁中口号）】白居易\n禁苑残莺三四声，景迟风慢暮春情。\n日西无事墙阴下，闲蹋宫花独自行。\n\n【长乐坡送人，赋得愁字】白居易\n行人南北分征路，流水东西接御沟。\n终日坡前恨离别，谩名长乐是长愁。\n\n【期不至】白居易\n红烛清樽久延伫，出门入门天欲曙。\n星稀月落竟不来，烟柳胧胧鹊飞去。\n\n【忆江柳】白居易\n曾栽杨柳江南岸，一别江南两度春。\n遥忆青青江岸上，不知攀折是何人。\n\n【三年别】白居易\n悠悠一别已三年，相望相思明月天。\n肠断青天望明月，别来三十六回圆。\n\n【后宫词】白居易\n泪湿罗巾梦不成，夜深前殿按歌声。\n红颜未老恩先断，斜倚薰笼坐到明。\n\n.\n.\n【答山侣】白居易\n颔下髭须半是丝，光阴向后几多时。非无解挂簪缨意，\n未有支持伏腊资。冒热冲寒徒自取，随行逐队欲何为。\n更惭山侣频传语，五十归来道未迟。\n\n【曲江亭晚望】白居易\n曲江岸北凭栏干，水面阴生日脚残。尘路行多绿袍故，\n风亭立久白须寒。诗成暗著闲心记，山好遥偷病眼看。\n不被马前提省印，何人信道是郎官。\n\n【寄题忠州小楼桃花】白居易\n再游巫峡知何日，总是秦人说向谁。\n长忆小楼风月夜，红栏干上两三枝。\n\n【和元少尹新授官】白居易\n官稳身应泰，春风信马行。纵忙无苦事，虽病有心情。\n厚禄儿孙饱，前驱道路荣。花时八入直，无暇贺元兄。\n\n【重和元少尹】白居易\n凤阁舍人京亚尹，白头俱未著绯衫。\n南宫起请无消息，朝散何时得入衔。\n\n【醉后】白居易\n酒后高歌且放狂，门前闲事莫思量。\n犹嫌小户长先醒，不得多时住醉乡。\n\n【晚春重到集贤院】白居易\n官曹清切非人境，风月鲜明是洞天。满砌荆花铺紫毯，\n隔墙榆荚撒青钱。前时谪去三千里，此地辞来十四年。\n虚薄至今惭旧职，院名抬举号为贤。\n\n【后宫词】白居易\n雨露由来一点恩，争能遍布及千门。\n三千宫女胭脂面，几个春来无泪痕。\n\n【题新居寄元八】白居易\n青龙冈北近西边，移入新居便泰然。冷巷闭门无客到，\n暖檐移榻向阳眠。阶庭宽窄才容足，墙壁高低粗及肩。\n莫羡升平元八宅，自思买用几多钱。\n\n【题新昌所居】白居易\n宅小人烦闷，泥深马钝顽。街东闲处住，日午热时还。\n院窄难栽竹，墙高不见山。唯应方寸内，此地觅宽闲。\n\n【初著绯戏赠元九】白居易\n晚遇缘才拙，先衰被病牵。那知垂白日，始是著绯年。\n身外名徒尔，人间事偶然。我朱君紫绶，犹未得差肩。\n\n【连雨】白居易\n风雨暗萧萧，鸡鸣暮复朝。碎声笼苦竹，冷翠落芭蕉。\n水鸟投檐宿，泥蛙入户跳。仍闻蕃客见，明日欲追朝。\n\n【立秋日登乐游园】白居易\n独行独语曲江头，回马迟迟上乐游。\n萧飒凉风与衰鬓，谁教计会一时秋。\n\n【夜筝】白居易\n紫袖红弦明月中，自弹自感暗低容。\n弦凝指咽声停处，别有深情一万重。\n\n【送客南迁】白居易\n我说南中事，君应不愿听。曾经身困苦，不觉语叮咛。\n烧处愁云梦，波时忆洞庭。春畬烟勃勃，秋瘴露冥冥。\n蚊蚋经冬活，鱼龙欲雨腥。水虫能射影，山鬼解藏形。\n穴掉巴蛇尾，林飘鸩鸟翎。飓风千里黑，qL草四时青。\n客似惊弦雁，舟如委浪萍。谁人劝言笑，何计慰漂零。\n慎勿琴离膝，长须酒满瓶。大都从此去，宜醉不宜醒。\n\n【寄远】白居易\n欲忘忘未得，欲去去无由。两腋不生翅，二毛空满头。\n坐看新落叶，行上最高楼。暝色无边际，茫茫尽眼愁。\n\n【寄山僧（时年五十）】白居易\n眼看过半百，早晚扫岩扉。白首谁能住，青山自不归。\n百千万劫障，四十九年非。会拟抽身去，当风斗擞衣。\n\n【酬严十八郎中见示】白居易\n口厌含香握厌兰，紫微青琐举头看。忽惊鬓后苍浪发，\n未得心中本分官。夜酌满容花色暖，秋吟切骨玉声寒。\n承明长短君应入，莫忆家江七里滩。\n\n【自问】白居易\n黑花满眼丝满头，早衰因病病因愁。\n宦途气味已谙尽，五十不休何日休。\n\n【新居早春二首】白居易\n静巷无来客，深居不出门。铺沙盖苔面，扫雪拥松根。\n渐暖宜闲步，初晴爱小园。觅花都未有，唯觉树枝繁。\n\n地润东风暖，闲行蹋草芽。呼童遣移竹，留客伴尝茶。\n溜滴檐冰尽，尘浮隙日斜。新居未曾到，邻里是谁家。\n\n【喜敏中及第，偶示所怀】白居易\n自知群从为儒少，岂料词场中第频。桂折一枝先许我，\n杨穿三叶尽惊人。转于文墨须留意，贵向烟霄早致身。\n莫学尔兄年五十，蹉跎始得掌丝纶。\n\n【寄白头陀】白居易\n近见头陀伴，云师老更慵。性灵闲似鹤，颜状古于松。\n山里犹难觅，人间岂易逢。仍闻移住处，太白最高峰。\n\n【勤政楼西老柳】白居易\n半朽临风树，多情立马人。开元一株柳，长庆二年春。\n\n【送冯舍人阁老往襄阳】白居易\n紫微阁底送君回，第二厅帘下不开。\n莫恋汉南风景好，岘山花尽早归来。\n\n【元家花】白居易\n今日元家宅，樱桃发几枝。稀稠与颜色，一似去年时。\n失却东园主，春风可得知。\n\n【惜小园花】白居易\n晓来红萼凋零尽，但见空枝四五株。\n前日狂风昨夜雨，残芳更合得存无。\n\n【送严大夫赴桂州】白居易\n地压坤方重，官兼宪府雄。桂林无瘴气，柏署有清风。\n山水衙门外，旌旗艛艓中。大夫应绝席，诗酒与谁同。\n\n【夏夜宿直】白居易\n人少庭宇旷，夜凉风露清。槐花满院气，松子落阶声。\n寂寞挑灯坐，沉吟蹋月行。年衰自无趣，不是厌承明。\n\n【玉真张观主下小女冠阿容】白居易\n绰约小天仙，生来十六年。姑山半峰雪，瑶水一枝莲。\n晚院花留立，春窗月伴眠。回眸虽欲语，阿母在傍边。\n\n【访陈二】白居易\n晓垂朱绶带，晚著白纶巾。出去为朝客，归来是野人。\n两餐聊过日，一榻足容身。此外皆闲事，时时访老陈。\n\n【曲江忆李十一】白居易\n李君殁后共谁游，柳岸荷亭两度秋。\n独绕曲江行一匝，依前还立水边愁。\n\n【闻夜砧】白居易\n谁家思妇秋捣帛，月苦风凄砧杵悲。八月九月正长夜，\n千声万声无了时。应到天明头尽白，一声添得一茎丝。\n\n【青门柳】白居易\n青青一树伤心色，曾入几人离恨中。\n为近都门多送别，长条折尽减春风。\n\n【暮江吟】白居易\n一道残阳铺水中，半江瑟瑟半江红。\n可怜九月初三夜，露似真珠月似弓。\n\n【怨词】白居易\n夺宠心那惯，寻思倚殿门。不知移旧爱，何处作新恩。\n\n【秋房夜】白居易\n云露青天月漏光，中庭立久却归房。\n水窗席冷未能卧，挑尽残灯秋夜长。\n\n【邻女】白居易\n娉婷十五胜天仙，白日姮娥旱地莲。\n何处闲教鹦鹉语，碧纱窗下绣床前。\n\n【移牡丹栽】白居易\n金钱买得牡丹栽，何处辞丛别主来。\n红芳堪惜还堪恨，百处移将百处开。\n\n【琵琶】白居易\n弦清拨剌语铮铮，背却残灯就月明。\n赖是心无惆怅事，不然争奈子弦声。\n\n【寄李苏州，兼示杨琼】白居易\n真娘墓头春草碧，心奴鬓上秋霜白。为问苏台酒席中，\n使君歌笑与谁同。就中犹有杨琼在，堪上东山伴谢公。\n\n【闲坐】白居易\n暖拥红炉火，闲搔白发头。百年慵里过，万事醉中休。\n有室同摩诘，无儿比邓攸。莫论身在日，身后亦无忧。\n\n【初罢中书舍人】白居易\n自惭拙宦叨清贵，还有痴心怕素餐。或望君臣相献替，\n可图妻子免饥寒。性疏岂合承恩久，命薄元知济事难。\n分寸宠光酬未得，不休更拟觅何官。\n\n【商山路有感】白居易\n忆昨征还日，三人归路同。此生都是梦，前事旋成空。\n杓直泉埋玉，虞平烛过风。唯残乐天在，头白向江东。\n\n【逢张十八员外籍】白居易\n旅思正茫茫，相逢此道傍。晓岚林叶暗，秋露草花香。\n白发江城守，青衫水部郎。客亭同宿处，忽似夜归乡。\n\n【寓言题僧】白居易\n劫风火起烧荒宅，苦海波生荡破船。\n力小无因救焚溺，清凉山下且安禅。\n\n【路上寄银匙与阿龟】白居易\n谪宦心都惯，辞乡去不难。缘留龟子住，涕泪一阑干。\n小子须娇养，邹婆为好看。银匙封寄汝，忆我即加餐。\n\n【郢州赠别王八使君】白居易\n昔是诗狂客，今为酒病夫。强吟翻怅望，纵醉不欢娱。\n鬓发三分白，交亲一半无。郢城君莫厌，犹校近京都。\n\n【夜泊旅望】白居易\n少睡多愁客，中宵起望乡。沙明连浦月，帆白满船霜。\n近海江弥阔，迎秋夜更长。烟波三十宿，犹未到钱唐。\n\n【舟中晚起】白居易\n日高犹掩水窗眠，枕簟清凉八月天。泊处或依沽酒店，\n宿时多伴钓鱼船。退身江海应无用，忧国朝廷自有贤。\n且向钱唐湖上去，冷吟闲醉二三年。\n\n【对酒自勉】白居易\n五十江城守，停杯一自思。头仍未尽白，官亦不全卑。\n荣宠寻过分，欢娱已校迟。肺伤虽怕酒，心健尚夸诗。\n夜舞吴娘袖，春歌蛮子词。犹堪三五岁，相伴醉花时。\n\n【醉题候仙亭】白居易\n蹇步垂朱绶，华缨映白须。何因驻衰老，只有且欢娱。\n酒兴还应在，诗情可便无。登山与临水，犹未要人扶。\n\n【虚白堂】白居易\n虚白堂前衙退后，更无一事到中心。\n移床就日檐间卧，卧咏闲诗侧枕琴。\n\n【晚兴】白居易\n极浦收残雨，高城驻落晖。山明虹半出，松暗鹤双归。\n将吏随衙散，文书入务稀。闲吟倚新竹，筠粉污朱衣。\n\n【病中对病鹤】白居易\n同病病夫怜病鹤，精神不损翅翎伤。未堪再举摩霄汉，\n只合相随觅稻粱。但作悲吟和嘹唳，难将俗貌对昂藏。\n唯应一事宜为伴，我发君毛俱似霜。\n\n【腊后岁前遇景咏意】白居易\n海梅半白柳微黄，冻水初融日欲长。度腊都无苦霜霰，\n迎春先有好风光。郡中起晚听衙鼓，城上行慵倚女墙。\n公事渐闲身且健，使君殊未厌馀杭。\n\n【花楼望雪命宴赋诗】白居易\n连天际海白皑皑，好上高楼望一回。何处更能分道路，\n此时兼不认池台。万重云树山头翠，百尺花楼江畔开。\n素壁联题分韵句，红炉巡饮暖寒杯。冰铺湖水银为面，\n风卷汀沙玉作堆。绊惹舞人春艳曳，句留醉客夜裴回。\n输将虚白堂前鹤，失却樟亭驿后梅。别有故情偏忆得，\n曾经穷苦照书来。\n\n【宿竹阁】白居易\n晚坐松檐下，宵眠竹阁间。清虚当服药，幽独抵归山。\n巧未能胜拙，忙应不及闲。无劳别修道，即此是玄关。\n\n【和薛秀才寻梅花同饮见赠】白居易\n忽惊林下发寒梅，便试花前饮冷杯。白马走迎诗客去，\n红筵铺待舞人来。歌声怨处微微落，酒气熏时旋旋开。\n若到岁寒无雨雪，犹应醉得两三回。\n\n【钱唐湖春行】白居易\n孤山寺北贾亭西，水面初平云脚低。几处早莺争暖树，\n谁家新燕啄春泥。乱花渐欲迷人眼，浅草才能没马蹄。\n最爱湖东行不足，绿杨阴里白沙堤。\n\n【重向火】白居易\n火销灰复死，疏弃已经旬。岂是人情薄，其如天气春。\n风寒忽再起，手冷重相亲。却就红炉坐，心如逢故人。\n\n【城上】白居易\n城上冬冬鼓，朝衙复晚衙。为君慵不出，落尽绕城花。\n\n【独行】白居易\n暗诵黄庭经在口，闲携青竹杖随身。\n晚花新笋堪为伴，独入林行不要人。\n\n【戏题木兰花】白居易\n紫房日照胭脂拆，素艳风吹腻粉开。\n怪得独饶脂粉态，木兰曾作女郎来。\n\n【湖中自照】白居易\n重重照影看容鬓，不见朱颜见白丝。\n失却少年无处觅，泥他湖水欲何为。\n\n【杭州春望】白居易\n望海楼明照曙霞，护江堤白蹋晴沙。涛声夜入伍员庙，\n柳色春藏苏小家。红袖织绫夸柿蒂，青旗沽酒趁梨花。\n谁开湖寺西南路，草绿裙腰一道斜。\n\n【湖亭晚归】白居易\n尽日湖亭卧，心闲事亦稀。起因残醉醒，坐待晚凉归。\n松雨飘藤帽，江风透葛衣。柳堤行不厌，沙软絮霏霏。\n\n【醉中酬殷协律】白居易\n泗水亭边一分散，浙江楼上重游陪。挥鞭二十年前别，\n命驾三千里外来。醉袖放狂相向舞，愁眉和笑一时开。\n留君夜住非无分，且尽青娥红烛台。\n\n【樟亭双樱树】白居易\n南馆西轩两树樱，春条长足夏阴成。\n素华朱实今虽尽，碧叶风来别有情。\n\n【赠沙鸥】白居易\n老逼教垂白，官科遣著绯。形骸虽有累，方寸却无机。\n遇酒多先醉，逢山爱晚归。沙鸥不知我，犹避隼旟飞。\n\n【江楼夕望招客】白居易\n海天东望夕茫茫，山势川形阔复长。灯火万家城四畔，\n星河一道水中央。风吹古木晴天雨，月照平沙夏夜霜。\n能就江楼销暑否，比君茅舍较清凉。\n\n【木芙蓉花下招客饮】白居易\n晚凉思饮两三杯，召得江头酒客来。\n莫怕秋无伴醉物，水莲花尽木莲开。\n\n【夜招周协律，兼答所赠】白居易\n满眼虽多客，开眉复向谁。少年非我伴，秋夜与君期。\n落魄俱耽酒，殷勤共爱诗。相怜别有意，彼此老无儿。\n\n【饮后夜醒】白居易\n黄昏饮散归来卧，夜半人扶强起行。枕上酒容和睡醒，\n楼前海月伴潮生。将归梁燕还重宿，欲灭窗灯却复明。\n直至晓来犹妄想，耳中如有管弦声。\n\n【早冬】白居易\n十月江南天气好，可怜冬景似春华。霜轻未杀萋萋草，\n日暖初干漠漠沙。老柘叶黄如嫩树，寒樱枝白是狂花。\n此时却羡闲人醉，五马无由入酒家。\n\n【正月十五日夜月】白居易\n岁熟人心乐，朝游复夜游。春风来海上，明月在江头。\n灯火家家市，笙歌处处楼。无妨思帝里，不合厌杭州。\n\n【题清头陀】白居易\n头陀独宿寺西峰，百尺禅庵半夜钟。\n烟月苍苍风瑟瑟，更无杂树对山松。\n\n【湖上醉中代诸妓寄严郎中】白居易\n笙歌杯酒正欢娱，忽忆仙郎望帝都。借问连宵直南省，\n何如尽日醉西湖。蛾眉别久心知否，鸡舌含多口厌无。\n还有些些惆怅事，春来山路见蘼芜。\n\n【晚兴】白居易\n草浅马翩翩，新晴薄暮天。柳条春拂面，衫袖醉垂鞭。\n立语花堤上，行吟水寺前。等闲消一日，不觉过三年。\n\n【竹楼宿】白居易\n小书楼下千竿竹，深火炉前一醆灯。\n此处与谁相伴宿，烧丹道士坐禅僧。\n\n【戏醉客】白居易\n莫言鲁国书生懦，莫把杭州刺史欺。\n醉客请君开眼望，绿杨风下有红旗。\n\n【题西亭】白居易\n朝亦视簿书，暮亦视簿书。簿书视未竟，蟋蟀鸣座隅。\n始觉芳岁晚，复嗟尘务拘。西园景多暇，可以少踌躇。\n池鸟澹容与，桥柳高扶疏。烟蔓袅青薜，水花披白蕖。\n何人造兹亭，华敞绰有馀。四檐轩鸟翅，复屋罗蜘蛛。\n直廊抵曲房，窈窕深且虚。修竹夹左右，清风来徐徐。\n此宜宴佳宾，鼓瑟吹笙竽。荒淫即不可，废旷将何如。\n幸有酒与乐，及时欢且娱。忽其解郡印，他人来此居。\n\n【北亭卧】白居易\n树绿晚阴合，池凉朝气清。莲开有佳色，鹤唳无凡声。\n唯此闲寂境，惬我幽独情。病假十五日，十日卧兹亭。\n明朝吏呼起，还复视黎甿。\n\n【霓裳羽衣歌（和微之）】白居易\n我昔元和侍宪皇，曾陪内宴宴昭阳。千歌百舞不可数，\n就中最爱霓裳舞。舞时寒食春风天，玉钩栏下香案前。\n案前舞者颜如玉，不著人家俗衣服。虹裳霞帔步摇冠，\n钿璎累累佩珊珊。娉婷似不任罗绮，顾听乐悬行复止。\n磬箫筝笛递相搀，击擫弹吹声逦迤。散序六奏未动衣，\n阳台宿云慵不飞。中序擘騞初入拍，秋竹竿裂春冰拆。\n飘然转旋回雪轻，嫣然纵送游龙惊。小垂手后柳无力，\n斜曳裾时云欲生。烟蛾敛略不胜态，风袖低昂如有情。\n上元点鬟招萼绿，王母挥袂别飞琼。繁音急节十二遍，\n跳珠撼玉何铿铮。翔鸾舞了却收翅，唳鹤曲终长引声。\n当时乍见惊心目，凝视谛听殊未足。一落人间八九年，\n耳冷不曾闻此曲。湓城但听山魈语，巴峡唯闻杜鹃哭。\n移领钱唐第二年，始有心情问丝竹。玲珑箜篌谢好筝，\n陈宠觱栗沈平笙。清弦脆管纤纤手，教得霓裳一曲成。\n虚白亭前湖水畔，前后祗应三度按。便除庶子抛却来，\n闻道如今各星散。今年五月至苏州，朝钟暮角催白头。\n贪看案牍常侵夜，不听笙歌直到秋。秋来无事多闲闷，\n忽忆霓裳无处问。闻君部内多乐徒，问有霓裳舞者无。\n答云七县十万户，无人知有霓裳舞。唯寄长歌与我来，\n题作霓裳羽衣谱。四幅花笺碧间红，霓裳实录在其中。\n千姿万状分明见，恰与昭阳舞者同。眼前仿佛睹形质，\n昔日今朝想如一。疑从魂梦呼召来，似著丹青图写出。\n我爱霓裳君合知，发于歌咏形于诗。君不见我歌云，\n惊破霓裳羽衣曲。又不见我诗云，曲爱霓裳未拍时。\n由来能事皆有主，杨氏创声君造谱。君言此舞难得人，\n须是倾城可怜女。吴妖小玉飞作烟，越艳西施化为土。\n娇花巧笑久寂寥，娃馆苎萝空处所。如君所言诚有是，\n君试从容听我语。若求国色始翻传，但恐人间废此舞。\n妍媸优劣宁相远，大都只在人抬举。李娟张态君莫嫌，\n亦拟随宜且教取。\n\n【啄木曲】白居易\n莫买宝剪刀，虚费千金直。我有心中愁，知君剪不得。\n莫磨解结锥，徒劳人气力。我有肠中结，知君解不得。\n莫染红丝线，徒夸好颜色。我有双泪珠，知君穿不得。\n莫近红炉火，炎气徒相逼。我有两鬓霜，知君销不得。\n刀不能剪心愁，锥不能解肠结。线不能穿泪珠，\n火不能销鬓雪。不如饮此神圣杯，万念千忧一时歇。\n\n【双石】白居易\n苍然两片石，厥状怪且丑。俗用无所堪，时人嫌不取。\n结从胚浑始，得自洞庭口。万古遗水滨，一朝入吾手。\n担舁来郡内，洗刷去泥垢。孔黑烟痕深，罅青苔色厚。\n老蛟蟠作足，古剑插为首。忽疑天上落，不似人间有。\n一可支吾琴，一可贮吾酒。峭绝高数尺，坳泓容一斗。\n五弦倚其左，一杯置其右。洼樽酌未空，玉山颓已久。\n人皆有所好，物各求其偶。渐恐少年场，不容垂白叟。\n回头问双石，能伴老夫否。石虽不能言，许我为三友。\n\n【日渐长，赠周、殷二判官】白居易\n日渐长，春尚早。墙头半露红萼枝，池岸新铺绿芽草。\n蹋草攀枝仰头叹，何人知此春怀抱。年颜盛壮名未成，\n官职欲高身已老。万茎白发真堪恨，一片绯衫何足道。\n赖得君来劝一杯，愁开闷破心头好。\n\n【自咏五首】白居易\n朝亦随群动，暮亦随群动。荣华瞬息间，求得将何用。\n形骸与冠盖，假合相戏弄。但异睡著人，不知梦是梦。\n\n一家五十口，一郡十万户。出为差科头，入为衣食主。\n水旱合心忧，饥寒须手抚。何异食蓼虫，不知苦是苦。\n\n公私颇多事，衰惫殊少欢。迎送宾客懒，鞭笞黎庶难。\n老耳倦声乐，病口厌杯盘。既无可恋者，何以不休官。\n\n一日复一日，自问何留滞。为贪逐日俸，拟作归田计。\n亦须随丰约，可得无限剂。若待足始休，休官在何岁。\n\n官舍非我庐，官园非我树。洛中有小宅，渭上有别墅。\n既无婚嫁累，幸有归休处。归去诚已迟，犹胜不归去。\n\n【题故元少尹集后二首】白居易\n黄壤讵知我，白头徒忆君。唯将老年泪，一洒故人文。\n\n遗文三十轴，轴轴金玉声。龙门原上土，埋骨不埋名。\n\n【吴中好风景二首】白居易\n吴中好风景，八月如三月。水荇叶仍香，木莲花未歇。\n海天微雨散，江郭纤埃灭。暑退衣服干，潮生船舫活。\n两衙渐多暇，亭午初无热。骑吏语使君，正是游时节。\n\n吴中好风景，风景无朝暮。晓色万家烟，秋声八月树。\n舟移管弦动，桥拥旌旗驻。改号齐云楼，重开武丘路。\n况当丰岁熟，好是欢游处。州民劝使君，且莫抛官去。\n\n【别苏州】白居易\n浩浩姑苏民，郁郁长洲城。来惭荷宠命，去愧无能名。\n青紫行将吏，班白列黎氓。一时临水拜，十里随舟行。\n饯筵犹未收，征棹不可停。稍隔烟树色，尚闻丝竹声。\n怅望武丘路，沉吟浒水亭。还乡信有兴，去郡能无情。\n\n【自问行何迟】白居易\n前月发京口，今辰次淮涯。二旬四百里，自问行何迟。\n还乡无他计，罢郡有馀资。进不慕富贵，退未忧寒饥。\n以此易过日，腾腾何所为。逢山辄倚棹，遇寺多题诗。\n酒醒夜深后，睡足日高时。眼底一无事，心中百不知。\n想到京国日，懒放亦如斯。何必冒风水，促促赴程归。\n\n【问杨琼】白居易\n古人唱歌兼唱情，今人唱歌唯唱声。\n欲说向君君不会，试将此语问杨琼。\n\n【宿荥阳】白居易\n生长在荥阳，少小辞乡曲。迢迢四十载，复向荥阳宿。\n去时十一二，今年五十六。追思儿戏时，宛然犹在目。\n旧居失处所，故里无宗族。岂唯变市朝，兼亦迁陵谷。\n独有溱洧水，无情依旧绿。\n\n【就花枝】白居易\n就花枝，移酒海，今朝不醉明朝悔。且算欢娱逐日来，\n任他容鬓随年改。醉翻衫袖抛小令，笑掷骰盘呼大采。\n自量气力与心情，三五年间犹得在。\n\n【题道宗上人十韵】白居易\n如来说偈赞，菩萨著论议。是故宗律师，以诗为佛事。\n一音无差别，四句有诠次。欲使第一流，皆知不二义。\n精洁沾戒体，闲淡藏禅味。从容恣语言，缥缈离文字。\n旁延邦国彦，上达王公贵。先以诗句牵，后令入佛智。\n人多爱师句，我独知师意。不似休上人，空多碧云思。\n\n【寄庾侍郎】白居易\n一双华亭鹤，数片太湖石。巉巉苍玉峰，矫矫青云翮。\n是时岁云暮，淡薄烟景夕。庭霜封石棱，池雪印鹤迹。\n幽致竟谁别，闲静聊自适。怀哉庾顺之，好是今宵客。\n\n【醉题沈子明壁】白居易\n不爱君池东十丛菊，不爱君池南万竿竹。爱君帘下唱歌人，\n色似芙蓉声似玉。我有阳关君未闻，若闻亦应愁杀君。\n\n【落花】白居易\n留春春不住，春归人寂寞。厌风风不定，风起花萧索。\n既兴风前叹，重命花下酌。劝君尝绿醅，教人拾红萼。\n桃飘火焰焰，梨堕雪漠漠。独有病眼花，春风吹不落。\n\n【耳顺吟，寄敦诗、梦得】白居易\n三十四十五欲牵，七十八十百病缠。五十六十却不恶，\n恬淡清净心安然。已过爱贪声利后，犹在病羸昏耄前。\n未无筋力寻山水，尚有心情听管弦。闲开新酒尝数醆，\n醉忆旧诗吟一篇。敦诗梦得且相劝，不用嫌他耳顺年。\n\n【忆旧游（寄刘苏州）】白居易\n忆旧游，旧游安在哉。旧游之人半白首，旧游之地多苍苔。\n江南旧游凡几处，就中最忆吴江隈。长洲苑绿柳万树，\n齐云楼春酒一杯。阊门晓严旗鼓出，皋桥夕闹船舫回。\n修蛾慢脸灯下醉，急管繁弦头上催。六七年前狂烂熳，\n三千里外思裴回。李娟张态一春梦，周五殷三归夜台。\n虎丘月色为谁好，娃宫花枝应自开。赖得刘郎解吟咏，\n江山气色合归来。\n\n【劝我酒】白居易\n劝我酒，我不辞。请君歌，歌莫迟。歌声长，辞亦切，\n此辞听者堪愁绝。洛阳女儿面似花，河南大尹头如雪。\n\n【感旧写真】白居易\n李放写我真，写来二十载。莫问真何如，画亦销光彩。\n朱颜与玄鬓，日夜改复改。无磋貌遽非，且喜身犹在。\n\n【秋池二首】白居易\n身闲无所为，心闲无所思。况当故园夜，复此新秋池。\n岸暗鸟栖后，桥明月出时。菱风香散漫，桂露光参差。\n静境多独得，幽怀竟谁知。悠然心中语，自问来何迟。\n\n朝衣薄且健，晚簟清仍滑。社近燕影稀，雨馀蝉声歇。\n闲中得诗境，此境幽难说。露荷珠自倾，风竹玉相戛。\n谁能一同宿，共玩新秋月。暑退早凉归，池边好时节。\n\n【问秋光】白居易\n殷卿领北镇，崔尹开南幕。外事信为荣，中怀未必乐。\n何如不才者，兀兀无所作。不引窗下琴，即举池上酌。\n淡交唯对水，老伴无如鹤。自适颇从容，旁观诚濩落。\n身心转恬泰，烟景弥淡泊。回首语秋光，东来应不错。\n\n【太湖石】白居易\n远望老嵯峨，近观怪嶔崟。才高八九尺，势若千万寻。\n嵌空华阳洞，重叠匡山岑。邈矣仙掌迥，呀然剑门深。\n形质冠今古，气色通晴阴。未秋已瑟瑟，欲雨先沈沈。\n天姿信为异，时用非所任。磨刀不如砺，捣帛不如砧。\n何乃主人意，重之如万金。岂伊造物者，独能知我心。\n\n【葺池上旧亭】白居易\n池月夜凄凉，池风晓萧飒。欲入池上冬，先葺池上閤。\n向暖窗户开，迎寒帘幕合。苔封旧瓦木，水照新朱蜡。\n软火深土炉，香醪小瓷榼。中有独宿翁，一灯对一榻。\n\n【玩止水】白居易\n动者乐流水，静者乐止水。利物不如流，鉴形不如止。\n凄清早霜降，淅沥微风起。中面红叶开，四隅绿萍委。\n广狭八九丈，湾环有涯涘。浅深三四尺，洞彻无表里。\n净分鹤翘足，澄见鱼掉尾。迎眸洗眼尘，隔胸荡心滓。\n定将禅不别，明与诚相似。清能律贪夫，淡可交君子。\n岂唯空狎玩，亦取相伦拟。欲识静者心，心源只如此。\n\n【日长】白居易\n日长昼加餐，夜短朝馀睡。春来寝食间，虽老犹有味。\n林塘得芳景，园曲生幽致。爱水多棹舟，惜花不扫地。\n幸无眼下病，且向樽前醉。身外何足言，人间本无事。\n\n【慵不能】白居易\n架上非无书，眼慵不能看。匣中亦有琴，手慵不能弹。\n腰慵不能带，头慵不能冠。午后恣情寝，午时随事餐。\n一餐终日饱，一寝至夜安。饥寒亦闲事，况乃不饥寒。\n\n【朝课】白居易\n平甃白石渠，静扫青苔院。池上好风来，新荷大如扇。\n小亭中何有，素琴对黄卷。蕊珠讽数篇，秋思弹一遍。\n从容朝课毕，方与客相见。\n\n【香山寺石楼潭夜浴】白居易\n炎光昼方炽，暑气宵弥毒。摇扇风甚微，褰裳汗霢霂。\n起向月下行，来就潭中浴。平石为浴床，洼石为浴斛。\n绡巾薄露顶，草屦轻乘足。清凉咏而归，归上石楼宿。\n\n【安稳眠】白居易\n家虽日渐贫，犹未苦饥冻。身虽日渐老，幸无急病痛。\n眼逢闹处合，心向闲时用。既得安稳眠，亦无颠倒梦。\n\n【书绅】白居易\n仕有职役劳，农有畎亩勤。优哉分司叟，心力无苦辛。\n岁晚头又白，自问何欣欣。新酒始开瓮，旧谷犹满囷。\n吾尝静自思，往往夜达晨。何以送吾老，何以安吾贫。\n岁计莫如谷，饱则不干人。日计莫如醉，醉则兼忘身。\n诚知有道理，未敢劝交亲。恐为人所哂，聊自书诸绅。\n\n【对火玩雪】白居易\n平生所心爱，爱火兼怜雪。火是腊天春，雪为阴夜月。\n鹅毛纷正堕，兽炭敲初折。盈尺白盐寒，满炉红玉热。\n稍宜杯酌动，渐引笙歌发。但识欢来由，不知醉时节。\n银盘堆柳絮，罗袖抟琼屑。共愁明日销，便作经年别。\n\n【苦热中寄舒员外】白居易\n何堪日衰病，复此时炎燠。厌对俗杯盘，倦听凡丝竹。\n藤床铺晚雪，角枕截寒玉。安得清瘦人，新秋夜同宿。\n非君固不可，何夕枉高躅。\n\n【寄情】白居易\n灼灼早春梅，东南枝最早。持来玩未足，花向手中老。\n芳香销掌握，怅望生怀抱。岂无后开花，念此先开好。\n\n【吴宫辞】白居易\n淡红花帔浅檀蛾，睡脸初开似剪波。\n坐对珠笼闲理曲，琵琶鹦鹉语相和。\n\n.\n.\n【席上答微之】白居易\n我住浙江西，君去浙江东。勿言一水隔，便与千里同。\n富贵无人劝君酒，今宵为我尽杯中。\n\n【答微之夸越州州宅】白居易\n贺上人回得报书，大夸州宅似仙居。厌看冯翊风沙久，\n喜见兰亭烟景初。日出旌旗生气色，月明楼阁在空虚。\n知君暗数江南郡，除却馀杭尽不如。\n\n【酬微之】白居易\n满帙填箱唱和诗，少年为戏老成悲。声声丽曲敲寒玉，\n句句妍辞缀色丝。吟玩独当明月夜，伤嗟同是白头时。\n由来才命相磨折，天遣无儿欲怨谁。\n\n【答微之咏怀见寄】白居易\n閤中同直前春事，船里相逢昨日情。分袂二年劳梦寐，\n并床三宿话平生。紫微北畔辞宫阙，沧海西头对郡城。\n聚散穷通何足道，醉来一曲放歌行。\n\n【雪中即事答微之】白居易\n连夜江云黄惨澹，平明山雪白模糊。银河沙涨三千里，\n梅岭花排一万株。北市风生飘散面，东楼日出照凝酥。\n谁家高士关门户，何处行人失道途。舞鹤庭前毛稍定，\n捣衣砧上练新铺。戏团稚女呵红手，愁坐衰翁对白须。\n压瘴一州除疾苦，呈丰万井尽欢娱。润含玉德怀君子，\n寒助霜威忆大夫。莫道烟波一水隔，何妨气候两乡殊。\n越中地暖多成雨，还有瑶台琼树无。\n\n【除夜寄微之】白居易\n鬓毛不觉白毵毵，一事无成百不堪。共惜盛时辞阙下，\n同嗟除夜在江南。家山泉石寻常忆，世路风波子细谙。\n老校于君合先退，明年半百又加三。\n\n【祭社宵兴灯前偶作】白居易\n城头传鼓角，灯下整衣冠。夜镜藏须白，秋泉漱齿寒。\n欲将闲送老，须著病辞官。更待年终后，支持归计看。\n\n【新春江次】白居易\n浦干潮未应，堤湿冻初销。粉片妆梅朵，金丝刷柳条。\n鸭头新绿水，雁齿小红桥。莫怪珂声碎，春来五马骄。\n\n【早春忆微之】白居易\n昏昏老与病相和，感物思君叹复歌。声早鸡先知夜短，\n色浓柳最占春多。沙头雨染斑斑草，水面风驱瑟瑟波。\n可道眼前光景恶，其如难见故人何。\n\n【自感】白居易\n宴游寝食渐无味，杯酒管弦徒绕身。\n宾客欢娱僮仆饱，始知官职为他人。\n\n【同诸客携酒早看樱桃花】白居易\n晓报樱桃发，春携酒客过。绿饧粘盏杓，红雪压枝柯。\n天色晴明少，人生事故多。停杯替花语，不醉拟如何。\n\n【早饮湖州酒，寄崔使君】白居易\n一榼扶头酒，泓澄泻玉壶。十分蘸甲酌，潋艳满银盂。\n捧出光华动，尝看气味殊。手中稀琥珀，舌上冷醍醐。\n瓶里有时尽，江边无处沽。不知崔太守，更有寄来无。\n\n【醉戏诸妓】白居易\n席上争飞使君酒，歌中多唱舍人诗。\n不知明日休官后，逐我东山去是谁。\n\n【酬周协律】白居易\n五十钱唐守，应为送老官。滥蒙辞客爱，犹作近臣看。\n凿落愁须饮，琵琶闷遣弹。白头虽强醉，不似少年欢。\n\n【诗解】白居易\n新篇日日成，不是爱声名。旧句时时改，无妨悦性情。\n但令长守郡，不觉却归城。只拟江湖上，吟哦过一生。\n\n【柘枝妓】白居易\n平铺一合锦筵开，连击三声画鼓催。红蜡烛移桃叶起，\n紫罗衫动柘枝来。带垂钿胯花腰重，帽转金铃雪面回。\n看即曲终留不住，云飘雨送向阳台。\n\n【天竺寺送坚上人归庐山】白居易\n锡杖登高寺，香炉忆旧峰。偶来舟不系，忽去鸟无踪。\n岂要留离偈，宁劳动别容。与师俱是梦，梦里暂相逢。\n\n【留题郡斋】白居易\n吟山歌水嘲风月，便是三年官满时。春为醉眠多闭閤，\n秋因晴望暂褰帷。更无一事移风俗，唯化州民解咏诗。\n\n【留题天竺、灵隐两寺】白居易\n在郡六百日，入山十二回。宿因月桂落，醉为海榴开。\n黄纸除书到，青宫诏命催。僧徒多怅望，宾从亦裴回。\n寺闇烟埋竹，林香雨落梅。别桥怜白石，辞洞恋青苔。\n渐出松间路，犹飞马上杯。谁教冷泉水，送我下山来。\n\n【重寄别微之】白居易\n凭仗江波寄一辞，不须惆怅报微之。\n犹胜往岁峡中别，滟滪堆边招手时。\n\n【别周军事】白居易\n主人头白官仍冷，去后怜君是底人。\n试谒会稽元相去，不妨相见却殷勤。\n\n【汴河路有感】白居易\n三十年前路，孤舟重往还。绕身新眷属，举目旧乡关。\n事去唯留水，人非但见山。啼襟与愁鬓，此日两成斑。\n\n【茅城驿】白居易\n汴河无景思，秋日又凄凄。地薄桑麻瘦，村贫屋舍低。\n早苗多间草，浊水半和泥。最是萧条处，茅城驿向西。\n\n【杭州回舫】白居易\n自别钱塘山水后，不多饮酒懒吟诗。\n欲将此意凭回棹，报与西湖风月知。\n\n【洛下寓居】白居易\n秋馆清凉日，书因解闷看。夜窗幽独处，琴不为人弹。\n游宴慵多废，趋朝老渐难。禅僧教断酒，道士劝休官。\n渭曲庄犹在，钱唐俸尚残。如能便归去，亦不至饥寒。\n\n【好听琴】白居易\n本性好丝桐，尘机闻即空。一声来耳里，万事离心中。\n清畅堪销疾，恬和好养蒙。尤宜听三乐，安慰白头翁。\n\n【酬皇甫庶子见寄】白居易\n掌纶不称吾应笑，典郡无能我自知。别诏忽惊新命出，\n同寮偶与夙心期。春坊潇洒优闲地，秋鬓苍浪老大时。\n独占二疏应未可，龙楼见拟觅分司。\n\n【远师】白居易\n东宫白庶子，南寺远禅师。何处遥相见，心无一事时。\n\n【小院酒醒】白居易\n酒醒闲独步，小院夜深凉。一领新秋簟，三间明月廊。\n未收残盏杓，初换热衣裳。好是幽眠处，松阴六尺床。\n\n【酬杨八】白居易\n君以旷怀宜静境，我因蹇步称闲官。\n闭门足病非高士，劳作云心鹤眼看。\n\n【秋晚】白居易\n烟景淡濛濛，池边微有风。觉寒蛩近壁，知暝鹤归笼。\n长貌随年改，衰情与物同。夜来霜厚薄，梨叶半低红。\n\n【池西亭】白居易\n朱栏映晚树，金魄落秋池。还似钱唐夜，西楼月出时。\n\n【吾庐】白居易\n吾庐不独贮妻儿，自觉年侵身力衰。眼下营求容足地，\n心中准拟挂冠时。新昌小院松当户，履道幽居竹绕池。\n莫道两都空有宅，林泉风月是家资。\n\n【早春晚归】白居易\n晚归骑马过天津，沙白桥红返照新。草色连延多隙地，\n鼓声闲缓少忙人。还如南国饶沟水，不似西京足路尘。\n金谷风光依旧在，无人管领石家春。\n\n【赠皇甫庶子】白居易\n何因散地共徘徊，人道君才我不才。骑少马蹄生易蹶，\n用稀印锁涩难开。妻知年老添衣絮，婢报天寒拨酒醅。\n更愧小胥咨拜表，单衫冲雪夜深来。\n\n【闲出觅春，戏赠诸郎官】白居易\n年来数出觅风光，亦不全闲亦不忙。放鞚体安骑稳马，\n隔袍身暖照晴阳。迎春日日添诗思，送老时时放酒狂。\n除却髭须白一色，其馀未伏少年郎。\n\n【泛小fq二首】白居易\n水一塘，fq一只。fq头漾漾知风起，fq背萧萧闻雨滴。\n醉卧船中欲醒时，忽疑身是江南客。\n\n船缓进，水平流。一茎竹篙剔船尾，两幅青幕覆船头。\n亚竹乱藤多照岸，如从凤口向湖州。\n\n【云和】白居易\n非琴非瑟亦非筝，拨柱推弦调未成。\n欲散白头千万恨，只消红袖两三声。\n\n【春雪过皇甫家】白居易\n晚来篮舆雪中回，喜遇君家门正开。\n唯要主人青眼待，琴诗谈笑自将来。\n\n【与皇甫庶子同游城东】白居易\n闲游何必多徒侣，相劝时时举一杯。博望苑中无职役，\n建春门外足池台。绿油剪叶蒲新长，红蜡黏枝杏欲开。\n白马朱衣两宫相，可怜天气出城来。\n\n【晚春寄微之并崔湖州】白居易\n洛阳陌上少交亲，履道城边欲暮春。\n崔在吴兴元在越，出门骑马觅何人。\n\n【寄皇甫七】白居易\n孟夏爱吾庐，陶潜语不虚。花樽飘落酒，风案展开书。\n邻女偷新果，家僮漉小鱼。不知皇甫七，池上兴何如。\n\n【除苏州刺史，别洛城东花】白居易\n乱雪千花落，新丝两鬓生。老除吴郡守，春别洛阳城。\n江上今重去，城东更一行。别花何用伴，劝酒有残莺。\n\n【船夜援琴】白居易\n鸟栖鱼不动，月照夜江深。身外都无事，舟中只有琴。\n七弦为益友，两耳是知音。心静即声淡，其间无古今。\n\n【渡淮】白居易\n淮水东南阔，无风渡亦难。孤烟生乍直，远树望多圆。\n春浪棹声急，夕阳帆影残。清流宜映月，今夜重吟看。\n\n【自咏】白居易\n形容瘦薄诗情苦，岂是人间有相人。只合一生眠白屋，\n何因三度拥朱轮。金章未佩虽非贵，银榼常携亦不贫。\n唯是无儿头早白，被天磨折恰平均。\n\n【紫薇花】白居易\n紫薇花对紫微翁，名目虽同貌不同。独占芳菲当夏景，\n不将颜色托春风。浔阳官舍双高树，兴善僧庭一大丛。\n何似苏州安置处，花堂栏下月明中。\n\n【题笼鹤】白居易\n经旬不饮酒，逾月未闻歌。岂是风情少，其如尘事多。\n虎丘惭客问，娃馆妒人过。莫笑笼中鹤，相看去几何。\n\n【登阊门闲望】白居易\n阊门四望郁苍苍，始觉州雄土俗强。十万夫家供课税，\n五千子弟守封疆。阖闾城碧铺秋草，乌鹊桥红带夕阳。\n处处楼前飘管吹，家家门外泊舟航。云埋虎寺山藏色，\n月耀娃宫水放光。曾赏钱唐嫌茂苑，今来未敢苦夸张。\n\n【秋寄微之十二韵】白居易\n娃馆松江北，稽城浙水东。屈君为长吏，伴我作衰翁。\n旌旆知非远，烟云望不通。忙多对酒榼，兴少阅诗筒。\n淡白秋来日，疏凉雨后风。馀霞数片绮，新月一张弓。\n影满衰桐树，香凋晚蕙丛。饥啼春谷鸟，寒怨络丝虫。\n览镜头虽白，听歌耳未聋。老愁从此遣，醉笑与谁同。\n清旦方堆案，黄昏始退公。可怜朝暮景，销在两衙中。\n\n【郡西亭偶咏】白居易\n常爱西亭面北林，公私尘事不能侵。共闲作伴无如鹤，\n与老相宜只有琴。莫遣是非分作界，须教吏隐合为心。\n可怜此道人皆见，但要修行功用深。\n\n【郡中夜听李山人弹三乐】白居易\n风琴秋拂匣，月户夜开关。荣启先生乐，姑苏太守闲。\n传声千古后，得意一时间。却怪钟期耳，唯听水与山。\n\n【唤笙歌】白居易\n露坠萎花槿，风吹败叶荷。老心欢乐少，秋眼感伤多。\n芳岁今如此，衰翁可奈何。犹应不如醉，试遣唤笙歌。\n\n【偶饮】白居易\n三盏醺醺四体融，妓亭檐下夕阳中。千声方响敲相续，\n一曲云和戛未终。今日心情如往日，秋风气味似春风。\n唯憎小吏樽前报，道去衙时水五筒。\n\n【宿湖中】白居易\n水天向晚碧沉沉，树影霞光重叠深。浸月冷波千顷练，\n苞霜新橘万株金。幸无案牍何妨醉，纵有笙歌不废吟。\n十只画船何处宿，洞庭山脚太湖心。\n\n【泛太湖书事，寄微之】白居易\n烟渚云帆处处通，飘然舟似入虚空。玉杯浅酌巡初匝，\n金管徐吹曲未终。黄夹缬林寒有叶，碧琉璃水净无风。\n避旗飞鹭翩翻白，惊鼓跳鱼拨剌红。涧雪压多松偃蹇，\n岩泉滴久石玲珑。书为故事留湖上，吟作新诗寄浙东。\n军府威容从道盛，江山气色定知同。报君一事君应羡，\n五宿澄波皓月中。\n\n【西楼喜雪命宴】白居易\n宿云黄惨澹，晓雪白飘飖。散面遮槐市，堆花压柳桥。\n四郊铺缟素，万室甃琼瑶。银榼携桑落，金炉上丽谯。\n光迎舞妓动，寒近醉人销。歌乐虽盈耳，惭无五袴谣。\n\n【酬刘和州戏赠】白居易\n钱唐山水接苏台，两地褰帷愧不才。政事素无争学得，\n风情旧有且将来。双蛾解珮啼相送，五马鸣珂笑却回。\n不似刘郎无景行，长抛春恨在天台。\n\n【岁暮寄微之三首】白居易\n微之别久能无叹，知退书稀岂免愁。甲子百年过半后，\n光阴一岁欲终头。池冰晓合胶船底，楼雪晴销露瓦沟。\n自觉欢情随日减，苏州心不及杭州。\n\n荣进虽频退亦频，与君才命不调匀。若不九重中掌事，\n即须千里外抛身。紫垣南北厅曾对，沧海东西郡又邻。\n唯欠结庐嵩洛下，一时归去作闲人。\n\n白头岁暮苦相思，除却悲吟无可为。枕上从妨一夜睡，\n灯前读尽十年诗。龙钟校正骑驴日，憔悴通江司马时。\n若并如今是全活，纡朱拖紫且开眉。\n\n【正月三日闲行】白居易\n黄鹂巷口莺欲语，乌鹊河头冰欲销。\n绿浪东西南北水，红栏三百九十桥。\n\n鸳鸯荡漾双双翅，杨柳交加万万条。\n借问春风来早晚，只从前日到今朝。\n\n【自叹】白居易\n岂独年相迫，兼为病所侵。春来痰气动，老去嗽声深。\n眼暗犹操笔，头斑未挂簪。因循过日月，真是俗人心。\n\n【小舫】白居易\n小舫一艘新造了，轻装梁柱庳安篷。深坊静岸游应遍，\n浅水低桥去尽通。黄柳影笼随棹月，白蘋香起打头风。\n慢牵欲傍樱桃泊，借问谁家花最红。\n\n【病中多雨逢寒食】白居易\n水国多阴常懒出，老夫饶病爱闲眠。三旬卧度莺花月，\n一半春销风雨天。薄暮何人吹觱篥，新晴几处缚秋千。\n彩绳芳树长如旧，唯是年年换少年。\n\n【苏州柳】白居易\n金谷园中黄袅娜，曲江亭畔碧婆娑。老来处处游行遍，\n不似苏州柳最多。絮扑白头条拂面，使君无计奈春何。\n\n【偶作】白居易\n红杏初生叶，青梅已缀枝。阑珊花落后，寂寞酒醒时。\n坐闷低眉久，行慵举足迟。少年君莫怪，头白自应知。\n\n【奉送三兄】白居易\n少年曾管二千兵，昼听笙歌夜斫营。自反丘园头尽白，\n每逢旗鼓眼犹明。杭州暮醉连床卧，吴郡春游并马行。\n自愧阿连官职慢，只教兄作使君兄。\n\n【吴樱桃】白居易\n含桃最说出东吴，香色鲜秾气味殊。洽恰举头千万颗，\n婆娑拂面两三株。鸟偷飞处衔将火，人摘争时蹋破珠。\n可惜风吹兼雨打，明朝后日即应无。\n\n【官宅】白居易\n红紫共纷纷，祗承老使君。移舟木兰棹，行酒石榴裙。\n水色窗窗见，花香院院闻。恋他官舍住，双鬓白如云。\n\n【莲石】白居易\n青石一两片，白莲三四枝。寄将东洛去，心与物相随。\n石倚风前树，莲栽月下池。遥知安置处，预想发荣时。\n领郡来何远，还乡去已迟。莫言千里别，岁晚有心期。\n\n【题东武丘寺六韵】白居易\n香刹看非远，祇园入始深。龙蟠松矫矫，玉立竹森森。\n怪石千僧坐，灵池一剑沉。海当亭两面，山在寺中心。\n酒熟凭花劝，诗成倩鸟吟。寄言轩冕客，此地好抽簪。\n\n【咏怀】白居易\n苏杭自昔称名郡，牧守当今当好官。两地江山蹋得遍，\n五年风月咏将残。几时酒醆曾抛却，何处花枝不把看。\n白发满头归得也，诗情酒兴渐阑珊。\n\n【百日假满】白居易\n心中久有归田计，身上都无济世才。长告初从百日满，\n故乡元约一年回。马辞辕下头高举，鹤出笼中翅大开。\n但拂衣行莫回顾，的无官职趁人来。\n\n【题报恩寺】白居易\n好是清凉地，都无系绊身。晚晴宜野寺，秋景属闲人。\n净石堪敷坐，寒泉可濯巾。自惭容鬓上，犹带郡庭尘。\n\n【自思益寺次楞伽寺作】白居易\n朝从思益峰游后，晚到楞伽寺歇时。照水姿容虽已老，\n上山筋力未全衰。行逢禅客多相问，坐倚渔舟一自思，\n犹去悬车十五载，休官非早亦非迟。\n\n【宿灵岩寺上院】白居易\n高高白月上青林，客去僧归独夜深。荤血屏除唯对酒，\n歌钟放散只留琴。更无俗物当人眼，但有泉声洗我心。\n最爱晓亭东望好，太湖烟水绿沉沉。\n\n【河亭晴望（九月八日）】白居易\n风转云头敛，烟销水面开。晴虹桥影出，秋雁橹声来。\n郡静官初罢，乡遥信未回。明朝是重九，谁劝菊花杯。\n\n【自喜】白居易\n自喜天教我少缘，家徒行计两翩翩。身兼妻子都三口，\n鹤与琴书共一船。僮仆减来无冗食，资粮算外有馀钱。\n携将贮作丘中费，犹免饥寒得数年。\n\n【江上对酒二首】白居易\n酒助疏顽性，琴资缓慢情。有慵将送老，无智可劳生。\n忽忽忘机坐，伥伥任运行。家乡安处是，那独在神京。\n\n久贮沧浪意，初辞桎梏身。昏昏常带酒，默默不应人。\n坐稳便箕踞，眠多爱欠伸。客来存礼数，始著白纶巾。\n\n【酒筵上答张居士】白居易\n但要前尘减，无妨外相同。虽过酒肆上，不离道场中。\n弦管声非实，花钿色是空。何人知此义，唯有净名翁。\n\n【听琵琶妓弹略略】白居易\n腕软拨头轻，新教略略成。四弦千遍语，一曲万重情。\n法向师边得，能从意上生。莫欺江外手，别是一家声。\n\n【梦苏州水阁，寄冯侍御】白居易\n扬州驿里梦苏州，梦到花桥水阁头。\n觉后不知冯侍御，此中昨夜共谁游。\n\n【答次休上人】白居易\n姓白使君无丽句，名休座主有新文。\n禅心不合生分别，莫爱馀霞嫌碧云。\n\n.\n.\n【思子台有感二首】白居易\n曾家机上闻投杼，尹氏园中见掇蜂。\n但以恩情生隙罅，何人不解作江充。\n\n闇生魑魅蠹生虫，何异谗生疑阻中。\n但使武皇心似烛，江充不敢作江充。\n\n【忆洛中所居】白居易\n忽忆东都宅，春来事宛然。雪销行径里，水上卧房前。\n厌绿栽黄竹，嫌红种白莲。醉教莺送酒，闲遣鹤看船。\n幸是林园主，惭为食禄牵。宦情薄似纸，乡思争于弦。\n岂合姑苏守，归休更待年。\n\n【琴茶】白居易\n兀兀寄形群动内，陶陶任性一生间。自抛官后春多醉，\n不读书来老更闲。琴里知闻唯渌水，茶中故旧是蒙山。\n穷通行止长相伴，谁道吾今无往还。\n\n【初到洛下闲游】白居易\n汉庭重少身宜退，洛下闲居迹可逃。趁伴入朝应老丑，\n寻春放醉尚粗豪。诗携彩纸新装卷，酒典绯花旧赐袍。\n曾在东方千骑上，至今躞蹀马头高。\n\n【太湖石】白居易\n烟翠三秋色，波涛万古痕。削成青玉片，截断碧云根。\n风气通岩穴，苔文护洞门。三峰具体小，应是华山孙。\n\n【南院】白居易\n林院无情绪，经春不一开。杨花飞作穗，榆荚落成堆。\n壮气从中减，流年逐后催。只应如过客，病去老迎来。\n\n【新昌闲居，招杨郎中兄弟】白居易\n纱巾角枕病眠翁，忙少闲多谁与同。但有双松当砌下，\n更无一事到心中。金章紫绶堪如梦，皂盖朱轮别似空。\n暑月贫家何所有，客来唯赠北窗风。\n\n【松斋偶兴】白居易\n置心思虑外，灭迹是非间。约俸为生计，随官换往还。\n耳烦闻晓角，眼醒见秋山。赖此松檐下，朝回半日闲。\n\n【松下琴赠客】白居易\n松寂风初定，琴清夜欲阑。偶因群动息，试拨一声看。\n寡鹤当徽怨，秋泉应指寒。惭君此倾听，本不为君弹。\n\n【涂山寺独游】白居易\n野径行无伴，僧房宿有期。涂山来去熟，唯是马蹄知。\n\n【登灵应台北望】白居易\n临高始见人寰小，对远方知色界空。\n回首却归朝市去，一稊米落太仓中。\n\n【闲行】白居易\n五十年来思虑熟，忙人应未胜闲人。林园傲逸真成贵，\n衣食单疏不是贫。专掌图书无过地，遍寻山水自由身。\n傥年七十犹强健，尚得闲行十五春。\n\n【与僧智如夜话】白居易\n懒钝尤知命，幽栖渐得朋。门闲无谒客，室静有禅僧。\n炉向初冬火，笼停半夜灯。忧劳缘智巧，自喜百无能。\n\n【晚寒（晚一作暝）】白居易\n急景流如箭，凄风利似刀。暝催鸡翅敛，寒束树枝高。\n缩水浓和酒，加绵厚絮袍。可怜冬计毕，暖卧醉陶陶。\n\n【奉使途中，戏赠张常侍】白居易\n早风吹土满长衢，驿骑星轺尽疾驱。\n共笑篮舁亦称使，日驰一驿向东都。\n\n【酬皇甫宾客】白居易\n闲官兼慢使，著处易停轮。况欲逢新岁，仍初见故人。\n冒寒寻到洛，待暖始归秦。亦拟同携手，城东略看春。\n\n【答苏庶子】白居易\n偶作关东使，重陪洛下游。病来从断酒，老去可禁愁。\n款曲偏青眼，蹉跎各白头。蓬山闲气味，依约似龙楼。\n\n【和刘郎中伤鄂姬】白居易\n不独君嗟我亦嗟，西风北雪杀南花。\n不知月夜魂归处，鹦鹉洲头第几家。\n\n【寄太原李相公】白居易\n闻道北都今一变，政和军乐万人安。绮罗二八围宾榻，\n组练三千夹将坛。蝉鬓应夸丞相少，貂裘不觉太原寒。\n世间大有虚荣贵，百岁无君一日欢。\n\n【宿窦使君庄水亭】白居易\n使君何在在江东，池柳初黄杏欲红。\n有兴即来闲便宿，不知谁是主人翁。\n\n【姚侍御见过，戏赠】白居易\n晚起春寒慵裹头，客来池上偶同游。\n东台御史多提举，莫按金章系布裘。\n\n【题洛中第宅】白居易\n水木谁家宅，门高占地宽。悬鱼挂青甃，行马护朱栏。\n春榭笼烟暖，秋庭锁月寒。松胶黏琥珀，筠粉扑琅玕。\n试问池台主，多为将相官。终身不曾到，唯展宅图看。\n\n【答林泉】白居易\n好住旧林泉，回头一怅然。渐知吾潦倒，深愧尔留连。\n欲作栖云计，须营种黍钱。更容求一郡，不得亦归田。\n\n【临都驿答梦得六言二首】白居易\n扬子津头月下，临都驿里灯前。\n昨日老于前日，去年春似今年。\n\n谢守归为秘监，冯公老作郎官。\n前事不须问著，新诗且更吟看。\n\n【和钱华州题少华清光绝句】白居易\n高情雅韵三峰守，主领清光管白云。\n自笑亦曾为刺史，苏州肥腻不如君。\n\n【代迎春花招刘郎中】白居易\n幸与松筠相近栽，不随桃李一时开。\n杏园岂敢妨君去，未有花时且看来。\n\n【闲出】白居易\n身外无羁束，心中少是非。被花留便住，逢酒醉方归。\n人事行时少，官曹入日稀。春寒游正好，稳马薄绵衣。\n\n【曲江有感】白居易\n曲江西岸又春风，万树花前一老翁。\n遇酒逢花还且醉，若论惆怅事何穷。\n\n【伊州】白居易\n老去将何散老愁，新教小玉唱伊州。\n亦应不得多年听，未教成时已白头。\n\n【晚从省归】白居易\n朝回北阙值清晨，晚出南宫送暮春。入去丞郎非散秩，\n归来诗酒是闲人。犹思泉石多成梦，尚叹簪裾未离身。\n终是不如山下去，心头眼底两无尘。\n\n【京路】白居易\n西来为看秦山雪，东去缘寻洛苑春。\n来去腾腾两京路，闲行除我更无人。\n\n【从陕至东京】白居易\n从陕至东京，山低路渐平。风光四百里，车马十三程。\n花共垂鞭看，杯多并辔倾。笙歌与谈笑，随分自将行。\n\n【宿杜曲花下】白居易\n觅得花千树，携来酒一壶。懒归兼拟宿，未醉岂劳扶。\n但惜春将晚，宁愁日渐晡。篮舆为卧舍，漆盝是行厨。\n斑竹盛茶柜，红泥罨饭炉。眼前无所阙，身外更何须。\n小面琵琶婢，苍头觱篥奴。从君饱富贵，曾作此游无。\n\n【绣妇叹】白居易\n连枝花样绣罗襦，本拟新年饷小姑。自觉逢春饶怅望，\n谁能每日趁功夫。针头不解愁眉结，线缕难穿泪脸珠。\n虽凭绣床都不绣，同床绣伴得知无。\n\n【恨词】白居易\n翠黛眉低敛，红珠泪暗销。从来恨人意，不省似今朝。\n\n【送敏中归豳宁幕】白居易\n六十衰翁儿女悲，傍人应笑尔应知。弟兄垂老相逢日，\n杯酒临欢欲散时。前路加餐须努力，今宵尽醉莫推辞。\n司徒知我难为别，直过秋归未讶迟。\n\n【人定】白居易\n人定月胧明，香消枕簟清。翠屏遮烛影，红袖下帘声。\n坐久吟方罢，眠初梦未成。谁家教鹦鹉，故故语相惊。\n\n【池窗】白居易\n池晚莲芳谢，窗秋竹意深。更无人作伴，唯对一张琴。\n\n【题崔常侍济源庄】白居易\n谷口谁家住，云扃锁竹泉。主人何处去，萝薜换貂蝉。\n籍在金闺内，班排玉扆前。诚知忆山水，归得是何年。\n\n【魏堤有怀】白居易\n魏王堤下水，声似使君滩。惆怅回头听，踌蹰立马看。\n荡风波眼急，翻雪浪心寒。忆得瞿唐事，重吟行路难。\n\n【代梦得吟】白居易\n后来变化三分贵，同辈凋零太半无。世上争先从尽汝，\n人间斗在不如吾。竿头已到应难久，局势虽迟未必输。\n不见山苗与林叶，迎春先绿亦先枯。\n\n【雨中招张司业宿】白居易\n过夏衣香润，迎秋簟色鲜。斜支花石枕，卧咏蕊珠篇。\n泥泞非游日，阴沉好睡天。能来同宿否，听雨对床眠。\n\n【对琴待月】白居易\n竹院新晴夜，松窗未卧时。共琴为老伴，与月有秋期。\n玉轸临风久，金波出雾迟。幽音待清景，唯是我心知。\n\n【早寒】白居易\n黄叶聚墙角，青苔围柱根。被经霜后薄，镜遇雨来昏。\n半卷寒檐幕，斜开暖阁门。迎冬兼送老，只仰酒盈尊。\n\n【和刘郎中望终南山秋雪】白居易\n遍览古今集，都无秋雪诗。阳春先唱后，阴岭未消时。\n草讶霜凝重，松疑鹤散迟。清光莫独占，亦对白云司。\n\n【送鹤与裴相临别赠诗】白居易\n司空爱尔尔须知，不信听吟送鹤诗。羽翮势高宁惜别，\n稻粱恩厚莫愁饥。夜栖少共鸡争树，晓浴先饶凤占池。\n稳上青云勿回顾，的应胜在白家时。\n\n【送河南尹冯学士赴任】白居易\n石渠金谷中间路，轩骑翩翩十日程。清洛饮冰添苦节，\n碧嵩看雪助高情。谩夸河北操旄钺，莫羡江西拥旆旌。\n何似府寮京令外，别教三十六峰迎。\n\n【乌夜啼（一有赋得字）】白居易\n城上归时晚，庭前宿处危。月明无叶树，霜滑有风枝。\n啼涩饥喉咽，飞低冻翅垂。画堂鹦鹉鸟，冷暖不相知。\n\n【冬夜闻虫】白居易\n虫声冬思苦于秋，不解愁人闻亦愁。\n我是老翁听不畏，少年莫听白君头。\n\n【赠朱道士】白居易\n仪容白皙上仙郎，方寸清虚内道场。两翼化生因服药，\n三尸卧死为休粮。醮坛北向宵占斗，寝室东开早纳阳。\n尽日窗间更无事，唯烧一炷降真香。\n\n【闻新蝉赠刘二十八】白居易\n蝉发一声时，槐花带两枝。只应催我老，兼遣报君知。\n白发生头速，青云入手迟。无过一杯酒，相劝数开眉。\n\n【和刘郎中学士题集贤阁】白居易\n朱阁青山高庳齐，与君才子作诗题。傍闻大内笙歌近，\n下视诸司屋舍低。万卷图书天禄上，一条风景月华西。\n欲知丞相优贤意，百步新廊不蹋泥。\n\n【病假中庞少尹携鱼酒相过】白居易\n宦情牢落年将暮，病假联绵日渐深。被老相催虽白首，\n与春无分未甘心。闲停茶碗从容语，醉把花枝取次吟。\n劳动故人庞阁老，提鱼携酒远相寻。\n\n【听曹刚琵琶兼示重莲】白居易\n拨拨弦弦意不同，胡啼番语两玲珑。\n谁能截得曹刚手，插向重莲衣袖中。\n\n【和刘郎中曲江春望见示】白居易\n芳景多游客，衰翁独在家。肺伤妨饮酒，眼痛忌看花。\n寺路随江曲，宫墙夹道斜。羡君犹壮健，不枉度年华。\n\n【南园试小乐】白居易\n小园斑驳花初发，新乐铮摐教欲成。红萼紫房皆手植，\n苍头碧玉尽家生。高调管色吹银字，慢拽歌词唱渭城。\n不饮一杯听一曲，将何安慰老心情。\n\n【和春深二十首】白居易\n何处春深好，春深富贵家。马为中路鸟，妓作后庭花。\n罗绮驱论队，金银用断车。眼前何所苦，唯苦日西斜。\n\n何处春深好，春深贫贱家。荒凉三径草，冷落四邻花。\n奴困归佣力，妻愁出赁车。途穷平路险，举足剧褒斜。\n\n何处春深好，春深执政家。凤池添砚水，鸡树落衣花。\n诏借当衢宅，恩容上殿车。延英开对久，门与日西斜。\n\n何处春深好，春深方镇家。通犀排带胯，瑞鹘勘袍花。\n飞絮冲球马，垂杨拂妓车。戎装拜春设，左握宝刀斜。\n\n何处春深好，春深刺史家。阴繁棠布叶，岐秀麦分花。\n五匹鸣珂马，双轮画轼车。和风引行乐，叶叶隼旟斜。\n\n何处春深好，春深学士家。凤书裁五色，马鬣剪三花。\n蜡炬开明火，银台赐物车。相逢不敢揖，彼此帽低斜。\n\n何处春深好，春深女学家。惯看温室树，饱识浴堂花。\n御印提随仗，香笺把下车。宋家宫样髻，一片绿云斜。\n\n何处春深好，春深御史家。絮萦骢马尾，蝶绕绣衣花。\n破柱行持斧，埋轮立驻车。入班遥认得，鱼贯一行斜。\n\n何处春深好，春深迁客家。一杯寒食酒，万里故园花。\n炎瘴蒸如火，光阴走似车。为忧鵩鸟至，只恐日光斜。\n\n何处春深好，春深经业家。唯求太常第，不管曲江花。\n折桂名惭郄，收萤志慕车。官场泥补处，最怕寸阴斜。\n\n何处春深好，春深隐士家。野衣裁薜叶，山饭晒松花。\n兰索纫幽珮，蒲轮驻软车。林间箕踞坐，白眼向人斜。\n\n何处春深好，春深渔父家。松湾随棹月，桃浦落船花。\n投饵移轻楫，牵轮转小车。萧萧芦叶里，风起钓丝斜。\n\n何处春深好，春深潮户家。涛翻三月雪，浪喷四时花。\n曳练驰千马，惊雷走万车。馀波落何处，江转富阳斜。\n\n何处春深好，春深痛饮家。十分杯里物，五色眼前花。\n餔歠眠糟瓮，流涎见麹车。中山一沉醉，千度日西斜。\n\n何处春深好，春深上巳家。兰亭席上酒，曲洛岸边花。\n弄水游童棹，湔裾小妇车。齐桡争渡处，一匹锦标斜。\n\n何处春深好，春深寒食家。玲珑镂鸡子，宛转彩球花。\n碧草追游骑，红尘拜扫车。秋千细腰女，摇曳逐风斜。\n\n何处春深好，春深博弈家。一先争破眼，六聚斗成花。\n鼓应投壶马，兵冲象戏车。弹棋局上事，最妙是长斜。\n\n何处春深好，春深嫁女家。紫排襦上雉，黄帖鬓边花。\n转烛初移障，鸣环欲上车。青衣传毡褥，锦绣一条斜。\n\n何处春深好，春深娶妇家。两行笼里烛，一树扇间花。\n宾拜登华席，亲迎障幰车。催妆诗未了，星斗渐倾斜。\n\n何处春深好，春深妓女家。眉欺杨柳叶，裙妒石榴花。\n兰麝熏行被，金铜钉坐车。杭州苏小小，人道最夭斜。\n\n【池鹤二首】白居易\n高竹笼前无伴侣，乱鸡群里有风标。低头乍恐丹砂落，\n晒翅常疑白雪消。转觉鸬鹚毛色下，苦嫌鹦鹉语声娇。\n临风一唳思何事，怅望青田云水遥。\n\n池中此鹤鹤中稀，恐是辽东老令威。带雪松枝翘膝胫，\n放花菱片缀毛衣。低回且向林间宿，奋迅终须天外飞。\n若问故巢知处在，主人相恋未能归。\n\n【僧院花】白居易\n欲悟色空为佛事，故栽芳树在僧家。\n细看便是华严偈，方便风开智慧花。\n\n【洛桥寒食日作十韵】白居易\n上苑风烟好，中桥道路平。蹴球尘不起，泼火雨新晴。\n宿醉头仍重，晨游眼乍明。老慵虽省事，春诱尚多情。\n遇客踟蹰立，寻花取次行。连钱嚼金勒，凿落写银罂。\n府酝伤教送，官娃岂要迎。舞腰那及柳，歌舌不如莺。\n乡国真堪恋，光阴可合轻。三年遇寒食，尽在洛阳城。\n\n【送令狐相公赴太原】白居易\n六纛双旌万铁衣，并汾旧路满光辉。青衫书记何年去，\n红旆将军昨日归。诗作马蹄随笔走，猎酣鹰翅伴觥飞。\n此都莫作多时计，再为苍生入紫微。\n\n【惜落花】白居易\n夜来风雨急，无复旧花林。枝上三分落，园中二寸深。\n日斜啼鸟思，春尽老人心。莫怪添杯饮，情多酒不禁。\n\n【忆晦叔】白居易\n游山弄水携诗卷，看月寻花把酒杯。\n六事尽思君作伴，几时归到洛阳来。\n\n【琴酒】白居易\n耳根得听琴初畅，心地忘机酒半酣。\n若使启期兼解醉，应言四乐不言三。\n\n【六年秋重题白莲】白居易\n素房含露玉冠鲜，绀叶摇风钿扇圆。本是吴州供进藕，\n今为伊水寄生莲。移根到此三千里，结子经今六七年。\n不独池中花故旧，兼乘旧日采花船。\n\n【卧听法曲霓裳】白居易\n金磬玉笙调已久，牙床角枕睡常迟。朦胧闲梦初成后，\n宛转柔声入破时。乐可理心应不谬，酒能陶性信无疑。\n起尝残酌听馀曲，斜背银缸半下帷。\n\n【寄刘苏州】白居易\n去年八月哭微之，今年八月哭敦诗。何堪老泪交流日，\n多是秋风摇落时。泣罢几回深自念，情来一倍苦相思。\n同年同病同心事，除却苏州更是谁。\n\n【秋思】白居易\n夕照红于烧，晴空碧胜蓝。兽形云不一，弓势月初三。\n雁思来天北，砧愁满水南。萧条秋气味，未老已深谙。\n\n【题周家歌者】白居易\n清紧如敲玉，深圆似转簧。一声肠一断，能有几多肠。\n\n【赠同座】白居易\n春黛双蛾嫩，秋蓬两鬓侵。谋欢身太晚，恨老意弥深。\n薄解灯前舞，尤能酒后吟。花丛便不入，犹自未甘心。\n\n【夜招晦叔】白居易\n庭草留霜池结冰，黄昏钟绝冻云凝。碧毡帐上正飘雪，\n红火炉前初炷灯。高调秦筝一两弄，小花蛮榼二三升。\n为君更奏湘神曲，夜就侬来能不能。\n\n【和杨师皋伤小姬英英】白居易\n自从娇騃一相依，共见杨花七度飞。玳瑁床空收枕席，\n琵琶弦断倚屏帏。人间有梦何曾入，泉下无家岂是归。\n坟上少啼留取泪，明年寒食更沾衣。\n\n【闻乐感邻】白居易\n老去亲朋零落尽，秋来弦管感伤多。尚书宅畔悲邻笛，\n廷尉门前叹雀罗。绿绮窗空分妓女，绛纱帐掩罢笙歌。\n欢娱未足身先去，争奈书生薄命何。\n\n.\n.\n【赠梦得】白居易\n心中万事不思量，坐倚屏风卧向阳。渐觉咏诗犹老丑，\n岂宜凭酒更粗狂。头垂白发我思退，脚蹋青云君欲忙。\n只有今春相伴在，花前剩醉两三场。\n\n【病免后喜除宾客】白居易\n卧在漳滨满十旬，起为商皓伴三人。\n从今且莫嫌身病，不病何由索得身。\n\n【陕府王大夫相迎偶赠】白居易\n紫微阁老自多情，白首园公岂要迎。伴我绿槐阴下歇，\n向君红旆影前行。纶巾发少浑欹仄，篮舆肩齐甚稳平。\n但问主人留几日，分司宾客去无程。\n\n【将至东都先寄令狐留守】白居易\n黄鸟无声叶满枝，闲吟想到洛城时。惜逢金谷三春尽，\n恨拜铜楼一月迟。诗境忽来还自得，醉乡潜去与谁期。\n东都添个狂宾客，先报壶觞风月知。\n\n【赠皇甫宾客】白居易\n轻衣稳马槐阴路，渐近东来渐少尘。耳闹久憎闻俗事，\n眼明初喜见闲人。昔曾对作承华相，今复连为博望宾。\n始信淡交宜久远，与君转老转相亲。\n\n【问江南物】白居易\n归来未及问生涯，先问江南物在耶。引手摩挲青石笋，\n回头点检白莲花。苏州舫故龙头暗，王尹桥倾雁齿斜。\n别有夜深惆怅事，月明双鹤在裴家。\n\n【答尉迟少尹问所须】白居易\n乍到频劳问所须，所须非玉亦非珠。\n爱君水阁宜闲咏，每有诗成许去无。\n\n【同崔十八寄元浙东王陕州】白居易\n未能同隐云林下，且复相招禄仕间。随月有钱胜卖药，\n终年无事抵归山。镜湖水远何由泛，棠树枝高不易攀。\n惆怅八科残四在，两人荣闹两人闲。\n\n【偶吟】白居易\n里巷多通水，林园尽不扃。松身为外户，池面是中庭。\n元氏诗三帙，陈家酒一瓶。醉来狂发咏，邻女映篱听。\n\n【池上即事】白居易\n行寻甃石引新泉，坐看修桥补钓船。绿竹挂衣凉处歇，\n清风展簟困时眠。身闲当贵真天爵，官散无忧即地仙。\n林下水边无厌日，便堪终老岂论年。\n\n【自题】白居易\n老宜官冷静，贫赖俸优饶。热月无堆案，寒天不趁朝。\n傍看应寂寞，自觉甚逍遥。徒对盈尊酒，兼无愁可销。\n\n【偶咏】白居易\n御热蕉衣健，扶羸竹杖轻。诵经凭槛立，散药绕廊行。\n暝槿无风落，秋虫欲雨鸣。身闲当将息，病亦有心情。\n\n【秋游】白居易\n下马闲行伊水头，凉风清景胜春游。\n何事古今诗句里，不多说著洛阳秋。\n\n【游平原赠晦叔】白居易\n照水容虽老，登山力未衰。欲眠先命酒，暂歇亦吟诗。\n且喜身无缚，终惭鬓有丝。回头语闲伴，闲校十年迟。\n\n【叹鹤病】白居易\n右翅低垂左胫伤，可怜风貌甚昂藏。\n亦知白日青天好，未要高飞且养疮。\n\n【对镜】白居易\n三分鬓发二分丝，晓镜秋容相对时。去作忙官应太老，\n退为闲叟未全迟。静中得味何须道，稳处安身更莫疑。\n若使至今黄绮在，闻吾此语亦分司。\n\n【即事】白居易\n见月连宵坐，闻风尽日眠。室香罗药气，笼暖焙茶烟。\n鹤啄新晴地，鸡栖薄暮天。自看淘酒米，倚杖小池前。\n\n【问移竹】白居易\n问君移竹意如何，慎勿排行但间窠。\n多种少栽皆有意，大都少校不如多。\n\n【偶吟二首】白居易\n眼下有衣兼有食，心中无喜亦无忧。正如身后有何事，\n应向人间无所求。静念道经深闭目，闲迎禅客小低头。\n犹残少许云泉兴，一岁龙门数度游。\n\n晴教晒药泥茶灶，闲看科松洗竹林。活计纵贫长净洁，\n池亭虽小颇幽深。厨香炊黍调和酒，窗暖安弦拂拭琴。\n老去生涯只如此，更无馀事可劳心。\n\n【勉闲游】白居易\n天时人事常多故，一岁春能几处游。不是尘埃便风雨，\n若非疾病即悲忧。贫穷心苦多无兴，富贵身忙不自由。\n唯有分司官恰好，闲游虽老未能休。\n\n【小桥柳】白居易\n细水涓涓似泪流，日西惆怅小桥头。\n衰杨叶尽空枝在，犹被霜风吹不休。\n\n【马上晚吟】白居易\n人少街荒已寂寥，风多尘起重萧条。上阳落叶飘宫树，\n中渡流澌拥渭桥。出早冒寒衣校薄，归迟侵黑酒全消。\n如今不是闲行日，日短天阴坊曲遥。\n\n【任老】白居易\n不愁陌上春光尽，亦任庭前日影斜。\n面黑眼昏头雪白，老应无可更增加。\n\n【答王尚书问履道池旧桥】白居易\n虹梁雁齿随年换，素板朱栏逐日修。但恨尚书能久别，\n莫忘州守不频游。重移旧柱开中眼，乱种新花拥两头。\n李郭小船何足问，待君乘过济川舟。\n\n【夜从法王寺下归岳寺】白居易\n双刹夹虚空，缘云一径通。似从忉利下，如过剑门中。\n灯火光初合，笙歌曲未终。可怜狮子座，舁出净名翁。\n\n【嵩阳观夜奏霓裳】白居易\n开元遗曲自凄凉，况近秋天调是商。爱者谁人唯白尹，\n奏时何处在嵩阳。回临山月声弥怨，散入松风韵更长。\n子晋少姨闻定怪，人间亦便有霓裳。\n\n【和杜录事题红叶】白居易\n寒山十月旦，霜叶一时新。似烧非因火，如花不待春。\n连行排绛帐，乱落剪红巾。解驻篮舆看，风前唯两人。\n\n【过温尚书旧庄】白居易\n白石清泉抛济口，碧幢红旆照河阳。\n村人都不知时事，犹自呼为处士庄。\n\n【弹秋思】白居易\n信意闲弹秋思时，调清声直韵疏迟。\n近来渐喜无人听，琴格高低心自知。\n\n【春风】白居易\n春风先发苑中梅，樱杏桃梨次第开。\n荠花榆荚深村里，亦道春风为我来。\n\n.\n.\n【恨去年】白居易\n老去唯耽酒，春来不著家。去年来校晚，不见洛阳花。\n\n【魏王堤】白居易\n花寒懒发鸟慵啼，信马闲行到日西。\n何处未春先有思，柳条无力魏王堤。\n\n【劝行乐】白居易\n少年信美何曾久，春日虽迟不再中。\n欢笑胜愁歌胜哭，请君莫道等头空。\n\n【自问】白居易\n年来私自问，何故不归京。佩玉腰无力，看花眼不明。\n老慵难发遣，春病易滋生。赖有弹琴女，时时听一声。\n\n【夜调琴忆崔少卿】白居易\n今夜调琴忽有情，欲弹惆怅忆崔卿。\n何人解爱中徽上，秋思头边八九声。\n\n【赠邻里往还】白居易\n问予何故独安然，免被饥寒婚嫁牵。骨肉都卢无十口，\n粮储依约有三年。但能斗薮人间事，便是逍遥地上仙。\n唯恐往还相厌贱，南家饮酒北家眠。\n\n【晚起】白居易\n起晚怜春暖，归迟爱月明。放慵长饱睡，闻健且闲行。\n北阙停朝簿，西方入社名。唯吟一句偈，无念是无生。\n\n【池上赠韦山人】白居易\n新竹夹平流，新荷拂小舟。众皆嫌好拙，谁肯伴闲游。\n客为忙多去，僧因饭暂留。独怜韦处士，尽日共悠悠。\n\n【对小潭寄远上人】白居易\n小潭澄见底，闲客坐开襟。借问不流水，何如无念心。\n彼惟清且浅，此乃寂而深。是义谁能答，明朝问道林。\n\n【晚出寻人不遇】白居易\n篮舆不乘乘晚凉，相寻不遇亦无妨。\n轻衣稳马槐阴下，自要闲行一两坊。\n\n【销暑】白居易\n何以销烦暑，端居一院中。眼前无长物，窗下有清风。\n热散由心静，凉生为室空。此时身自得，难更与人同。\n\n【池上小宴问程秀才】白居易\n洛下林园好自知，江南景物暗相随。净淘红粒罯香饭，\n薄切紫鳞烹水葵。雨滴篷声青雀舫，浪摇花影白莲池。\n停杯一问苏州客，何似吴松江上时。\n\n【舟中夜坐】白居易\n潭边霁后多清景，桥下凉来足好风。\n秋鹤一双船一只，夜深相伴月明中。\n\n【闲忙】白居易\n奔走朝行内，栖迟林墅间。多因病后退，少及健时还。\n斑白霜侵鬓，苍黄日下山。闲忙俱过日，忙校不如闲。\n\n【题西亭】白居易\n多见朱门富贵人，林园未毕即无身。\n我今幸作西亭主，已见池塘五度春。\n\n【看采莲】白居易\n小桃闲上小莲船，半采红莲半白莲。\n不似江南恶风浪，芙蓉池在卧床前。\n\n【夭老】白居易\n早世身如风里烛，暮年发似镜中丝。\n谁人断得人间事，少夭堪伤老又悲。\n\n【登天宫阁】白居易\n午时乘兴出，薄暮未能还。高上烟中阁，平看雪后山。\n委形群动里，任性一生间。洛下多闲客，其中我最闲。\n\n【日高卧】白居易\n怕寒放懒日高卧，临老谁言牵率身。夹幕绕房深似洞，\n重裀衬枕暖于春，小青衣动桃根起，嫩绿醅浮竹叶新。\n未裹头前倾一醆，何如冲雪趁朝人。\n\n【和微之叹槿花】白居易\n朝荣殊可惜，暮落实堪嗟。若向花中比，犹应胜眼花。\n\n【题平泉薛家雪堆庄】白居易\n怪石千年应自结，灵泉一带是谁开。蹙为宛转青蛇项，\n喷作玲珑白雪堆。赤日旱天长看雨，玄阴腊月亦闻雷。\n所嗟地去都门远，不得肩舁每日来。\n\n【哭皇甫七郎中（湜）】白居易\n志业过玄晏，词华似祢衡。多才非福禄，薄命是聪明。\n不得人间寿，还留身后名。涉江文一首，便可敌公卿。\n\n【疑梦二首】白居易\n莫惊宠辱虚忧喜，莫计恩雠浪苦辛。\n黄帝孔丘无处问，安知不是梦中身。\n\n鹿疑郑相终难辨，蝶化庄生讵可知。\n假使如今不是梦，能长于梦几多时。\n\n【归来二周岁】白居易\n归来二周岁，二岁似须臾。池藕重生叶，林鸦再引雏。\n时丰实仓廪，春暖葺庖厨。更作三年计，三年身健无。\n\n【题岐王旧山池石壁】白居易\n树深藤老竹回环，石壁重重锦翠斑。俗客看来犹解爱，\n忙人到此亦须闲。况当霁景凉风后，如在千岩万壑间。\n黄绮更归何处去，洛阳城内有商山。\n\n【早饮醉中除河南尹敕到】白居易\n雪拥衡门水满池，温炉卯后暖寒时。绿醅新酎尝初醉，\n黄纸除书到不知。厚俸自来诚忝滥，老身欲起尚迟疑。\n应须了却丘中计，女嫁男婚三径资。\n\n【府西池】白居易\n柳无气力枝先动，池有波纹冰尽开。\n今日不知谁计会，春风春水一时来。\n\n【不准拟二首】白居易\n篮舆腾腾一老夫，褐裘乌帽白髭须。早衰饶病多蔬食，\n筋力消磨合有无。不准拟身年六十，上山仍未要人扶。\n\n忆昔谪居炎瘴地，巴猿引哭虎随行。多于贾谊长沙苦，\n小校潘安白发生。不准拟身年六十，游春犹自有心情。\n\n【哭崔儿】白居易\n掌珠一颗儿三岁，鬓雪千茎父六旬。岂料汝先为异物，\n常忧吾不见成人。悲肠自断非因剑，啼眼加昏不是尘。\n怀抱又空天默默，依前重作邓攸身。\n\n【府斋感怀酬梦得】白居易\n府伶呼唤争先到，家酝提携动辄随。合是人生开眼日，\n自当年老敛眉时。丹砂炼作三铢土，玄发看成一把丝。\n劳寄新诗远安慰，不闻枯树再生枝。\n\n【履道池上作】白居易\n家池动作经旬别，松竹琴鱼好在无。树暗小巢藏巧妇，\n渠荒新叶长慈姑。不因车马时时到，岂觉林园日日芜。\n犹喜春深公事少，每来花下得踟蹰。\n\n【重修府西水亭院】白居易\n因下疏为沼，随高筑作台。龙门分水入，金谷取花栽。\n绕岸行初匝，凭轩立未回。园西有池位，留与后人开。\n\n【水堂醉卧问杜三十一】白居易\n闻君洛下住多年，何处春流最可怜。为问魏王堤岸下，\n何如同德寺门前。无妨水色堪闲玩，不得泉声伴醉眠。\n那似此堂帘幕底，连明连夜碧潺湲。\n\n【座中戏呈诸少年】白居易\n衰容禁得无多酒，秋鬓新添几许霜。纵有风情应淡薄，\n假如老健莫夸张。兴来吟咏从成癖，饮后酣歌少放狂。\n不为倚官兼挟势，因何入得少年场。\n\n【新制绫袄成，感而有咏】白居易\n水波文袄造新成，绫软绵匀温复轻。晨兴好拥向阳坐，\n晚出宜披蹋雪行。鹤氅毳疏无实事，木棉花冷得虚名。\n宴安往往欢侵夜，卧稳昏昏睡到明。百姓多寒无可救，\n一身独暖亦何情。心中为念农桑苦，耳里如闻饥冻声。\n争得大裘长万丈，与君都盖洛阳城。\n\n【醉吟】白居易\n醉来忘渴复忘饥，冠带形骸杳若遗。耳底斋钟初过后，\n心头卯酒未消时。临风朗咏从人听，看雪闲行任马迟。\n应被众疑公事慢，承前府尹不吟诗。\n\n【府酒五绝 招客】白居易\n日午微风且暮寒，春风冷峭雪乾残。\n碧毡帐下红炉畔，试为来尝一醆看。\n\n【府酒五绝 自劝】白居易\n忆昔羁贫应举年，脱衣典酒曲江边。\n十千一斗犹赊饮，何况官供不著钱。\n\n【晚归早出】白居易\n筋力年年减，风光日日新。退衙归逼夜，拜表出侵晨。\n何处台无月，谁家池不春。莫言无胜地，自是少闲人。\n坐厌推囚案，行嫌引马尘。几时辞府印，却作自由身。\n\n【天宫阁早春】白居易\n天宫高阁上何频，每上令人耳目新。前日晚登缘看雪，\n今朝晴望为迎春。林莺何处吟筝柱，墙柳谁家晒麹尘。\n可惜三川虚作主，风光不属白头人。\n\n【和梦得冬日晨兴】白居易\n漏传初五点，鸡报第三声。帐下从容起，窗间曨昒明。\n照书灯未灭，暖酒火重生。理曲弦歌动，先闻唱渭城。\n\n【赠晦叔忆梦得】白居易\n自别崔公四五秋，因何临老转风流。归来不说秦中事，\n歇定唯谋洛下游。酒面浮花应是喜，歌眉敛黛不关愁。\n得君更有无厌意，犹恨尊前欠老刘。\n\n【睡觉】白居易\n星河耿耿漏绵绵，月暗灯微欲曙天。转枕频伸书帐下，\n披裘箕踞火炉前。老眠早觉常残夜，病力先衰不待年。\n五欲已销诸念息，世间无境可勾牵。\n\n.\n.\n【咏兴五首 出府归吾庐】白居易\n出府归吾庐，静然安且逸。更无客干谒，时有僧问疾。\n家僮十馀人，枥马三四匹。慵发经旬卧，兴来连日出。\n出游爱何处，嵩碧伊瑟瑟。况有清和天，正当疏散日。\n身闲自为贵，何必居荣秩。心足即非贫，岂唯金满室。\n吾观权势者，苦以身徇物。炙手外炎炎，履冰中栗栗。\n朝饥口忘味，夕惕心忧失。但有富贵名，而无富贵实。\n\n【咏兴五首 四月池水满】白居易\n四月池水满，龟游鱼跃出。吾亦爱吾池，池边开一室。\n人鱼虽异族，其乐归于一。且与尔为徒，逍遥同过日。\n尔无羡沧海，蒲藻可委质。吾亦忘青云，衡茅足容膝。\n况吾与尔辈，本非蛟龙匹。假如云雨来，只是池中物。\n\n【秋凉闲卧】白居易\n残暑昼犹长，早凉秋尚嫩。露荷散清香，风竹含疏韵。\n幽闲竟日卧，衰病无人问。薄暮宅门前，槐花深一寸。\n\n【再授宾客分司】白居易\n优稳四皓官，清崇三品列。伊予再尘忝，内愧非才哲。\n俸钱七八万，给受无虚月。分命在东司，又不劳朝谒。\n既资闲养疾，亦赖慵藏拙。宾友得从容，琴觞恣怡悦。\n乘篮城外去，系马花前歇。六游金谷春，五看龙门雪。\n吾若默无语，安知吾快活。吾欲更尽言，复恐人豪夺。\n应为时所笑，苦惜分司阙。但问适意无，岂论官冷热。\n\n【首夏】白居易\n林静蚊未生，池静蛙未鸣。景长天气好，竟日和且清。\n春禽馀哢在，夏木新阴成。兀尔水边坐，翛然桥上行。\n自问一何适，身闲官不轻。料钱随月用，生计逐日营。\n食饱惭伯夷，酒足愧渊明。寿倍颜氏子，富百黔娄生。\n有一即为乐，况吾四者并。所以私自慰，虽老有心情。\n\n【立秋夕有怀梦得】白居易\n露簟荻竹清，风扇蒲葵轻。一与故人别，再见新蝉鸣。\n是夕凉飚起，闲境入幽情。回灯见栖鹤，隔竹闻吹笙。\n夜茶一两杓，秋吟三数声。所思渺千里，云外长洲城。\n\n【新秋晓兴】白居易\n浊暑忽已退，清宵未全长。晨釭耿残焰，宿閤凝微香。\n喔喔鸡下树，辉辉日上梁。枕低茵席软，卧稳身入床。\n睡足景犹早，起初风乍凉。展张小屏幛，收拾生衣裳。\n还有惆怅事，迟迟未能忘。拂镜梳白发，可怜冰照霜。\n\n【秋池独泛】白居易\n萧疏秋竹篱，清浅秋风池。一只短舫艇，一张斑鹿皮。\n皮上有野叟，手中持酒卮。半酣箕踞坐，自问身为谁。\n严子垂钓日，苏门长啸时。悠然意自得，意外何人知。\n\n【岁暮】白居易\n惨澹岁云暮，穷阴动经旬。霜风裂人面，冰雪摧车轮。\n而我当是时，独不知苦辛。晨炊廪有米，夕爨厨有薪。\n夹帽长覆耳，重裘宽裹身。加之一杯酒，煦妪如阳春。\n洛城士与庶，比屋多饥贫。何处炉有火，谁家甑无尘。\n如我饱暖者，百人无一人。安得不惭愧，放歌聊自陈。\n\n【古意】白居易\n脉脉复脉脉，美人千里隔。不见来几时，瑶草三四碧。\n玉琴声悄悄，鸾镜尘幂幂。昔为连理枝，今作分飞翮。\n寄书多不达，加饭终无益。心肠不自宽，衣带何由窄。\n\n【神照禅师同宿】白居易\n八年三月晦，山梨花满枝。龙门水西寺，夜与远公期。\n晏坐自相对，密语谁得知。前后际断处，一念不生时。\n\n【早夏游宴】白居易\n虽慵兴犹在，虽老心犹健。昨日山水游，今朝花酒宴。\n山榴艳似火，王蕊飘如霰。荣落逐瞬迁，炎凉随刻变。\n未收木绵褥，已动蒲葵扇。且喜物与人，年年得相见。\n\n【咏所乐】白居易\n兽乐在山谷，鱼乐在陂池。虫乐在深草，鸟乐在高枝。\n所乐虽不同，同归适其宜。不以彼易此，况论是与非。\n而我何所乐，所乐在分司。分司有何乐，乐哉人不知。\n官优有禄料，职散无羁縻。懒与道相近，钝将闲自随。\n昨朝拜表回，今晚行香归。归来北窗下，解巾脱尘衣。\n冷泉灌我顶，暖水濯四肢。体中幸无疾，卧任清风吹。\n心中又无事，坐任白日移。或开书一篇，或引酒一卮。\n但得如今日，终身无厌时。\n\n【寄卢少尹】白居易\n老诲心不乱，庄戒形太劳。生命既能保，死籍亦可逃。\n嘉肴与旨酒，信是腐肠膏。艳声与丽色，真为伐性刀。\n补养在积功，如裘集众毛。将欲致千里，可得差一毫。\n颜回何为者，簟瓢才自给。肥醲不到口，年不登三十。\n张苍何为者，染爱浩无际。妾媵填后房，竟寿百馀岁。\n苍寿有何德，回夭有何辜。谁谓具圣体，不如肥瓠躯。\n遂使世俗心，多疑仙道书。寄问卢先生，此理当何如。\n\n【咏怀】白居易\n我知世无幻，了无干世意。世知我无堪，亦无责我事。\n由兹两相忘，因得长自遂。自遂意何如，闲官在闲地。\n闲地唯东都，东都少名利。闲官是宾客，宾客无牵累。\n嵇康日日懒，毕卓时时醉。酒肆夜深归，僧房日高睡。\n形安不劳苦，神泰无忧畏。从官三十年，无如今气味。\n鸿虽脱罗弋，鹤尚居禄位。唯此未忘怀，有时犹内愧。\n\n【吟四虽（杂言）】白居易\n酒酣后，歌歇时。请君添一酌，听我吟四虽。年虽老，\n犹少于韦长史。命虽薄，犹胜于郑长水。眼虽病，\n犹明于徐郎中。家虽贫，犹富于郭庶子。省躬审分何侥幸，\n值酒逢歌且欢喜。忘荣知足委天和，亦应得尽生生理。\n\n【晚归香山寺，因咏所怀】白居易\n我年日已老，我身日已闲。闲出都门望，但见水与山。\n关塞碧岩岩，伊流清潺潺。中有古精舍，轩户无扃关。\n岸草歇可藉，径萝行可攀。朝随浮云出，夕与飞鸟还。\n吾道本迂拙，世途多险艰。尝闻嵇吕辈，尤悔生疏顽。\n巢悟入箕颍，皓知返商巅。岂唯乐肥遁，聊复祛忧患。\n吾亦从此去，终老伊嵩间。\n\n【送吕漳州】白居易\n今朝一壶酒，言送漳州牧。半自要闲游，爱花怜草绿。\n花前下鞍马，草上携丝竹。行客饮数杯，主人歌一曲。\n端居惜风景，屡出劳僮仆。独醉似无名，借君作题目。\n\n【咏怀】白居易\n高人乐丘园，中人慕官职。一事尚难成，两途安可得。\n遑遑干世者，多苦时命塞。亦有爱闲人，又为穷饿逼。\n我今幸双遂，禄仕兼游息。未尝羡荣华，不省劳心力。\n妻孥与婢仆，亦免愁衣食。所以吾一家，面无忧喜色。\n\n【老热】白居易\n一饱百情足，一酣万事休。何人不衰老，我老心无忧。\n仕者拘职役，农者劳田畴。何人不苦热，我热身自由。\n卧风北窗下，坐月南池头。脑凉脱乌帽，足热濯清流。\n慵发昼高枕，兴来夜泛舟。何乃有馀适，只缘无过求。\n或问诸亲友，乐天是与不。亦无别言语，多道天悠悠。\n悠悠君不知，此味深且幽。但恐君知后，亦来从我游。\n\n【六十六】白居易\n病知心力减，老觉光阴速。五十八归来，今年六十六。\n鬓丝千万白，池草八九绿。童稚尽成人，园林半乔木。\n看山倚高石，引水穿深竹。虽有潺湲声，至今听未足。\n\n【寒食】白居易\n人老何所乐，乐在归乡国。我归故园来，九度逢寒食。\n故园在何处，池馆东城侧。四邻梨花时，二月伊水色。\n岂独好风土，仍多旧亲戚。出去恣欢游，归来聊燕息。\n有官供禄俸，无事劳心力。但恐优稳多，微躬销不得。\n\n【题裴晋公女几山刻石诗后】白居易\n何处画功业，何处题诗篇。麒麟高阁上，女几小山前。\n尔后多少时，四朝二十年。贼骨化为土，贼垒犁为田。\n一从贼垒平，陈蔡民晏然。骡军成牛户，鬼火变人烟。\n生子已嫁娶，种桑亦丝绵。皆云公之德，欲报无由缘。\n公今在何处，守都镇三川。旧宅留永乐，新居开集贤。\n公今在何官，被衮珥貂蝉。战袍破犹在，髀肉生欲圆。\n襟怀转萧洒，气力弥精坚。登山不拄杖，上马能掉鞭。\n利泽浸入池，福降升自天。昔号天下将，今称地上仙。\n勿追赤松游，勿拍洪崖肩。商山有遗老，可以奉周旋。\n\n【饱食闲坐】白居易\n红粒陆浑稻，白鳞伊水鲂。庖童呼我食，饭热鱼鲜香。\n箸箸适我口，匙匙充我肠。八珍与五鼎，无复心思量。\n扪腹起盥漱，下阶振衣裳。绕庭行数匝，却上檐下床。\n箕踞拥裘坐，半身在日旸。可怜饱暖味，谁肯来同尝。\n是岁太和八，兵销时渐康。朝廷重经术，草泽搜贤良。\n尧舜求理切，夔龙启沃忙。怀才抱智者，无不走遑遑。\n唯此不才叟，顽慵恋洛阳。饱食不出门，闲坐不下堂。\n子弟多寂寞，僮仆少精光。衣食虽充给，神意不扬扬。\n为尔谋则短，为吾谋甚长。\n\n【览镜喜老】白居易\n今朝览明镜，须鬓尽成丝。行年六十四，安得不衰羸。\n亲属惜我老，相顾兴叹咨。而我独微笑，此意何人知。\n笑罢仍命酒，掩镜捋白髭。尔辈且安坐，从容听我词。\n生若不足恋，老亦何足悲。生若苟可恋，老即生多时。\n不老即须夭，不夭即须衰。晚衰胜早夭，此理决不疑。\n古人亦有言，浮生七十稀。我今欠六岁，多幸或庶几。\n倘得及此限，何羡荣启期。当喜不当叹，更倾酒一卮。\n\n【对琴酒】白居易\n西窗明且暖，晚坐卷书帷。琴匣拂开后，酒瓶添满时。\n角尊白螺醆，玉轸黄金徽。未及弹与酌，相对已依依。\n泠泠秋泉韵，贮在龙凤池。油油春云心，一杯可致之。\n自古有琴酒，得此味者稀。只因康与籍，及我三心知。\n\n【和裴侍中南园静兴见示】白居易\n池馆清且幽，高怀亦如此。有时帘动风，尽日桥照水。\n静将鹤为伴，闲与云相似。何必学留侯，崎岖觅松子。\n\n【二月一日作，赠韦七庶子】白居易\n园杏红萼坼，庭兰紫芽出。不觉春已深，今朝二月一。\n去冬病疮痏，将养遵医术。今春入道场，清净依僧律。\n尝闻圣贤语，所慎斋与疾。遂使爱酒人，停杯一百日。\n明朝二月二，疾平斋复毕。应须挈一壶，寻花觅韦七。\n\n【梦刘二十八，因诗问之】白居易\n昨夜梦梦得，初觉思踟蹰。忽忘来汝郡，犹疑在吴都。\n吴都三千里，汝郡二百馀。非梦亦不见，近与远何殊。\n尚能齐近远，焉用论荣枯。但问寝与食，近日两何如。\n病后能吟否，春来曾醉无。楼台与风景，汝又何如苏。\n相思一相报，勿复慵为书。\n\n【西行】白居易\n衣裘不单薄，车马不羸弱。蔼蔼三月天，闲行亦不恶。\n寿安流水馆，硖石青山郭。官道柳阴阴，行宫花漠漠。\n常闻俗间语，有钱在处乐。我虽非富人，亦不苦寂寞。\n家僮解弦管，骑从携杯杓。时向春风前，歇鞍开一酌。\n\n【途中作】白居易\n早起上肩舁，一杯平旦醉。晚憩下肩舁，一觉残春睡。\n身不经营物，心不思量事。但恐绮与里，只如吾气味。\n\n【睡后茶兴忆杨同州】白居易\n昨晚饮太多，嵬峨连宵醉。今朝餐又饱，烂漫移时睡。\n睡足摩挲眼，眼前无一事。信脚绕池行，偶然得幽致。\n婆娑绿阴树，斑驳青苔地。此处置绳床，傍边洗茶器。\n白瓷瓯甚洁，红炉炭方炽。沫下麹尘香，花浮鱼眼沸。\n盛来有佳色，咽罢馀芳气。不见杨慕巢，谁人知此味。\n\n【旱热二首】白居易\n彤云散不雨，赫日吁可畏。端坐犹挥汗，出门岂容易。\n忽思公府内，青衫折腰吏。复想驿路中，红尘走马使。\n征夫更辛苦，逐客弥憔悴。日入尚趋程，宵分不遑寐。\n安知北窗叟，偃卧风飒至。簟拂碧龙鳞，扇摇白鹤翅。\n岂唯身所得，兼示心无事。谁言苦热天，元有清凉地。\n\n勃勃旱尘气，炎炎赤日光。飞禽飐将坠，行人渴欲狂。\n壮者不耐饥，饥火烧其肠。肥者不禁热，喘急汗如浆。\n此时方自悟，老瘦亦何妨。肉轻足健逸，发少头清凉。\n薄食不饥渴，端居省衣裳。数匙粱饭冷，一领绡衫香。\n持此聊过日，焉知畏景长。\n\n【何处堪避暑】白居易\n何处堪避暑，林间背日楼。何处好追凉，池上随风舟。\n日高饥始食，食竟饱还游。游罢睡一觉，觉来茶一瓯。\n眼明见青山，耳醒闻碧流。脱袜闲濯足，解巾快搔头。\n如此来几时，已过六七秋。从心至百骸，无一不自由。\n拙退是其分，荣耀非所求。虽被世间笑，终无身外忧。\n此语君莫怪，静思吾亦愁。如何三伏月，杨尹谪虔州。\n\n【七月一日作】白居易\n七月一日天，秋生履道里。闲居见清景，高兴从此始。\n林间暑雨歇，池上凉风起。桥竹碧鲜鲜，岸莎青靡靡。\n苍然古磐石，清浅平流水。何言中门前，便是深山里。\n双僮侍坐卧，一杖扶行止。饥闻麻粥香，渴觉云汤美。\n平生所好物，今日多在此。此外更何思，市朝心已矣。\n\n【自宾客迁太子少傅分司】白居易\n头上渐无发，耳间新有毫。形容逐日老，官秩随年高。\n优饶又加俸，闲稳仍分曹。饮食免藜藿，居处非蓬蒿。\n何言家尚贫，银榼提绿醪。勿谓身未贵，金章照紫袍。\n诚合知止足，岂宜更贪饕。默默心自问，于国有何劳。\n\n【咏史（九年十一月作）】白居易\n秦磨利刀斩李斯，齐烧沸鼎烹郦其。可怜黄绮入商洛，\n闲卧白云歌紫芝。彼为菹醢机上尽，此为鸾皇天外飞。\n去者逍遥来者死，乃知祸福非天为。\n\n【春游】白居易\n上马临出门，出门复逡巡。回头问妻子，应怪春游频。\n诚知春游频，其奈老大身。朱颜去复去，白发新更新。\n请君屈十指，为我数交亲。大限年百岁，几人及七旬。\n我今六十五，走若下坂轮。假使得七十，只有五度春。\n逢春不游乐，但恐是痴人。\n\n【哭师皋】白居易\n南康丹旐引魂回，洛阳篮舁送葬来。北邙原边尹村畔，\n月苦烟愁夜过半。妻孥兄弟号一声，十二人肠一时断。\n往者何人送者谁，乐天哭别师皋时。平生分义向人尽，\n今日哀冤唯我知。我知何益徒垂泪，篮舆回竿马回辔。\n何日重闻扫市歌，谁家收得琵琶伎。萧萧风树白杨影，\n苍苍露草青蒿气。更就坟前哭一声，与君此别终天地。\n\n【夏日作】白居易\n葛衣疏且单，纱帽轻复宽。一衣与一帽，可以过炎天。\n止于便吾体，何必被罗纨。宿雨林笋嫩，晨露园葵鲜。\n烹葵炮嫩笋，可以备朝餐。止于适吾口，何必饫腥膻。\n饭讫盥漱已，扪腹方果然。婆娑庭前步，安稳窗下眠。\n外养物不费，内归心不烦。不费用难尽，不烦神易安。\n庶几无夭阏，得以终天年。\n\n【小台晚坐忆梦得】白居易\n汲泉洒小台，台上无纤埃。解带面西坐，轻襟随风开。\n晚凉闲兴动，忆同倾一杯。月明候柴户，藜杖何时来。\n\n【狂言示诸侄】白居易\n世欺不识字，我忝攻文笔。世欺不得官，我忝居班秩。\n人老多病苦，我今幸无疾。人老多忧累，我今婚嫁毕。\n心安不移转，身泰无牵率。所以十年来，形神闲且逸。\n况当垂老岁，所要无多物。一裘暖过冬，一饭饱终日。\n勿言舍宅小，不过寝一室。何用鞍马多，不能骑两匹。\n如我优幸身，人中十有七。如我知足心，人中百无一。\n傍观愚亦见，当己贤多失。不敢论他人，狂言示诸侄。\n\n【戏招诸客】白居易\n黄醅绿醑迎冬熟，绛帐红炉逐夜开。\n谁道洛中多逸客，不将书唤不曾来。\n\n【七年元日对酒五首】白居易\n庆吊经过懒，逢迎跪拜迟。不因时节日，岂觉此身羸。\n\n众老忧添岁，余衰喜入春。年开第七秩，屈指几多人。\n\n三杯蓝尾酒，一碟胶牙饧。除却崔常侍，无人共我争。\n\n今朝吴与洛，相忆一欣然。梦得君知否，俱过本命年。\n\n同岁崔何在，同年杜又无。应无藏避处，只有且欢娱。\n\n【洛下送牛相公出镇淮南】白居易\n北阙至东京，风光十六程。坐移丞相阁，春入广陵城。\n红旆拥双节，白须无一茎。万人开路看，百吏立班迎。\n阃外君弥重，尊前我亦荣。何须身自得，将相是门生。\n\n【洛中春游呈诸亲友】白居易\n莫叹年将暮，须怜岁又新。府中三遇腊，洛下五逢春。\n春树花珠颗，春塘水麹尘。春娃无气力，春马有精神。\n并辔鞭徐动，连盘酒慢巡。经过旧邻里，追逐好交亲。\n笑语销闲日，酣歌送老身。一生欢乐事，亦不少于人。\n\n【将归一绝】白居易\n欲去公门返野扉，预思泉竹已依依。\n更怜家酝迎春熟，一瓮醍醐待我归。\n\n【睡觉偶吟】白居易\n官初罢后归来夜，天欲明前睡觉时。\n起坐思量更无事，身心安乐复谁知。\n\n【自喜】白居易\n身慵难勉强，性拙易迟回。布被辰时起，柴门午后开。\n忙驱能者去，闲逐钝人来。自喜谁能会，无才胜有才。\n\n【感旧诗卷】白居易\n夜深吟罢一长吁，老泪灯前湿白须。\n二十年前旧诗卷，十人酬和九人无。\n\n【和梦得】白居易\n纶阁沈沈天宠命，苏台籍籍有能声。岂唯不得清文力，\n但恐空传冗吏名。郎署回翔何水部，江湖留滞谢宣城。\n所嗟非独君如此，自古才难共命争。\n\n【喜照密闲实四上人见过】白居易\n紫袍朝士白髯翁，与俗乖疏与道通。官秩三回分洛下，\n交游一半在僧中。臭帑世界终须出，香火因缘久愿同。\n斋后将何充供养，西轩泉石北窗风。\n\n【池上闲咏】白居易\n青莎台上起书楼，绿藻潭中系钓舟。日晚爱行深竹里，\n月明多上小桥头。暂尝新酒还成醉，亦出中门便当游。\n一部清商聊送老，白须萧飒管弦秋。\n\n【送考功崔郎中赴阙】白居易\n称意新官又少年，秋凉身健好朝天。\n青云上了无多路，却要徐驱稳著鞭。\n\n【送杨八给事赴常州】白居易\n无嗟别青琐，且喜拥朱轮。五十得三品，百千无一人。\n须勤念黎庶，莫苦忆交亲。此外无过醉，毗陵何限春。\n\n【醉送李二十常侍赴镇浙东】白居易\n靖安客舍花枝下，共脱青衫典浊醪。今日洛桥还醉别，\n金杯翻污麒麟袍。喧阗夙驾君脂辖，酩酊离筵我藉糟。\n好去商山紫芝伴，珊瑚鞭动马头高。\n\n【自咏】白居易\n白衣居士紫芝仙，半醉行歌半坐禅。今日维摩兼饮酒，\n当时绮季不请钱。等闲池上留宾客，随事灯前有管弦。\n但问此身销得否，分司气味不论年。\n\n【衰荷】白居易\n白露凋花花不残，凉风吹叶叶初乾。\n无人解爱萧条境，更绕衰丛一匝看。\n\n【自问】白居易\n依仁台废悲风晚，履信池荒宿草春。\n自问老身骑马出，洛阳城里觅何人。\n\n【青毡帐二十韵】白居易\n合聚千羊毳，施张百子弮。骨盘边柳健，色染塞蓝鲜。\n北制因戎创，南移逐虏迁。汰风吹不动，御雨湿弥坚。\n有顶中央耸，无隅四向圆。傍通门豁尔，内密气温然。\n远别关山外，初安庭户前。影孤明月夜，价重苦寒年。\n软暖围毡毯，枪摐束管弦。最宜霜后地，偏称雪中天。\n侧置低歌座，平铺小舞筵。闲多揭帘入，醉便拥袍眠。\n铁檠移灯背，银囊带火悬。深藏晓兰焰，暗贮宿香烟。\n兽炭休亲近，狐裘可弃捐。砚温融冻墨，瓶暖变春泉。\n蕙帐徒招隐，茅庵浪坐禅。贫僧应叹羡，寒士定留连。\n客宾于中接，儿孙向后传。王家夸旧物，未及此青毡。\n\n【同诸客题于家公主旧宅】白居易\n平阳旧宅少人游，应是游人到即愁。布谷鸟啼桃李院，\n络丝虫怨凤凰楼。台倾滑石犹残砌，帘断珍珠不满钩。\n闻道至今萧史在，髭须雪白向明州。\n\n【初冬早起寄梦得】白居易\n起戴乌纱帽，行披白布裘。炉温先暖酒，手冷未梳头。\n早起烟霜白，初寒鸟雀愁。诗成遣谁和，还是寄苏州。\n\n【香山寺二绝】白居易\n空山寂静老夫闲，伴鸟随云往复还。\n家酝满瓶书满架，半移生计入香山。\n\n爱风岩上攀松盖，恋月潭边坐石棱。\n且共云泉结缘境，他生当作此山僧。\n\n【同诸客嘲雪中马上妓】白居易\n珊瑚鞭亸马踟蹰，引手低蛾索一盂。腰为逆风成弱柳，\n面因冲冷作凝酥。银篦稳篸乌罗帽，花襜宜乘叱拨驹。\n雪里君看何所似，王昭君妹写真图。\n\n【早春忆苏州寄梦得】白居易\n吴苑四时风景好，就中偏好是春天。霞光曙后殷于火，\n水色晴来嫩似烟。士女笙歌宜月下，使君金紫称花前。\n诚知欢乐堪留恋，其奈离乡已四年。\n\n【负春】白居易\n病来道士教调气，老去山僧劝坐禅。\n孤负春风杨柳曲，去年断酒到今年。\n\n【早春招张宾客】白居易\n久雨初晴天气新，风烟草树尽欣欣。虽当冷落衰残日，\n还有阳和暖活身。池色溶溶蓝染水，花光焰焰火烧春。\n商山老伴相收拾，不用随他年少人。\n\n【感春】白居易\n老思不禁春，风光照眼新。花房红鸟觜，池浪碧鱼鳞。\n倚棹谁为伴，持杯自问身。心情多少在，六十二三人。\n\n【池边】白居易\n柳老香丝宛，荷新钿扇圆。残春深树里，斜日小楼前。\n醉遣收杯杓，闲听理管弦。池边更无事，看补采莲船。\n\n【送常秀才下第东归】白居易\n东归多旅恨，西上少知音。寒食看花眼，春风落日心。\n百忧当二月，一醉直千金。到处公卿席，无辞酒醆深。\n\n【题王家庄临水柳亭】白居易\n弱柳缘堤种，虚亭压水开。条疑逐风去，波欲上阶来。\n翠羽偷鱼入，红腰学舞回。春愁正无绪，争不尽残杯。\n\n【拜表回闲游】白居易\n玉珮金章紫花绶，纻衫藤带白纶巾。晨兴拜表称朝士，\n晚出游山作野人。达磨传心令息念，玄元留意遣同尘。\n八关净戒斋销日，一曲狂歌醉送春。酒肆法堂方丈室，\n其间岂是两般身。\n\n【早服云母散】白居易\n晓服云英漱井华，寥然身若在烟霞。药销日晏三匙饭，\n酒渴春深一碗茶。每夜坐禅观水月，有时行醉玩风花。\n净名事理人难解，身不出家心出家。\n\n【早夏游平原回】白居易\n夏早日初长，南风草木香。肩舆颇平稳，涧路甚清凉。\n紫蕨行看采，青梅旋摘尝。疗饥兼解渴，一醆冷云浆。\n\n【菩提寺上方晚眺】白居易\n楼阁高低树浅深，山光水色暝沉沉。嵩烟半卷青绡幕，\n伊浪平铺绿绮衾。飞鸟灭时宜极目，远风来处好开襟。\n谁知不离簪缨内，长得逍遥自在心。\n\n【读老子】白居易\n言者不如知者默，此语吾闻于老君。\n若道老君是知者，缘何自著五千文。\n\n【读禅经】白居易\n须知诸相皆非相，若住无馀却有馀。言下忘言一时了，\n梦中说梦两重虚。空花岂得兼求果，阳焰如何更觅鱼。\n摄动是禅禅是动，不禅不动即如如。\n\n【问鹤】白居易\n乌鸢争食雀争窠，独立池边风雪多。\n尽日蹋冰翘一足，不鸣不动意如何。\n\n【闲卧有所思二首】白居易\n向夕搴帘卧枕琴，微凉入户起开襟。偶因明月清风夜，\n忽想迁臣逐客心。何处投荒初恐惧，谁人绕泽正悲吟。\n始知洛下分司坐，一日安闲直万金。\n\n权门要路是身灾，散地闲居少祸胎。今日怜君岭南去，\n当时笑我洛中来。虫全性命缘无毒，木尽天年为不才。\n大抵吉凶多自致，李斯一去二疏回。\n\n【寄明州于驸马使君三绝句】白居易\n有花有酒有笙歌，其奈难逢亲故何。\n近海饶风春足雨，白须太守闷时多。\n\n平阳音乐随都尉，留滞三年在浙东。\n吴越声邪无法用，莫教偷入管弦中。\n\n何郎小妓歌喉好，严老呼为一串珠。\n海味腥咸损声气，听看犹得断肠无。\n\n【新秋喜凉】白居易\n过得炎蒸月，尤宜老病身。衣裳朝不润，枕簟夜相亲。\n楼月纤纤早，波风袅袅新。光阴与时节，先感是诗人。\n\n【哭崔二十四常侍】白居易\n貂冠初别九重门，马鬣新封四尺坟。薤露歌词非白雪，\n旌铭官爵是浮云。伯伦每置随身锸，元亮先为自祭文。\n莫道高风无继者，一千年内有崔君。\n\n【少年问】白居易\n少年怪我问如何，何事朝朝醉复歌。\n号作乐天应不错，忧愁时少乐时多。\n\n【代林园戏赠】白居易\n南院今秋游宴少，西坊近日往来频。\n假如宰相池亭好，作客何如作主人。\n\n【重戏赠】白居易\n集贤池馆从他盛，履道林亭勿自轻。\n往往归来嫌窄小，年年为主莫无情。\n\n【早秋登天宫寺阁赠诸客】白居易\n天宫阁上醉萧辰，丝管闲听酒慢巡。\n为向凉风清景道，今朝属我两三人。\n\n【八月十五日夜同诸客玩月】白居易\n月好共传唯此夜，境闲皆道是东都。嵩山表里千重雪，\n洛水高低两颗珠。清景难逢宜爱惜，白头相劝强欢娱。\n诚知亦有来年会，保得晴明强健无。\n\n【醉游平泉】白居易\n狂歌箕踞酒尊前，眼不看人面向天。\n洛客最闲唯有我，一年四度到平泉。\n\n【酬皇甫郎中对新菊花见忆】白居易\n爱菊高人吟逸韵，悲秋病客感衰怀。黄花助兴方携酒，\n红叶添愁正满阶。居士荤腥今已断，仙郎杯杓为谁排。\n愧君相忆东篱下，拟废重阳一日斋。\n\n【集贤池答侍中问】白居易\n主人晚入皇城宿，问客裴回何所须。\n池月幸闲无用处，今宵能借客游无。\n\n【老去】白居易\n老去愧妻儿，冬来有劝词。暖寒从饮酒，冲冷少吟诗。\n战胜心还壮，斋勤体校羸。由来世间法，损益合相随。\n\n【和同州杨侍郎夸柘枝见寄】白居易\n细吟冯翊使君诗，忆作馀杭太守时。\n君有一般输我事，柘枝看校十年迟。\n\n【寄李相公】白居易\n渐老只谋欢，虽贫不要官。唯求造化力，试为驻春看。\n\n【利仁北街作】白居易\n草色斑斑春雨晴，利仁坊北面西行。\n踟蹰立马缘何事，认得张家歌吹声。\n\n【过永宁】白居易\n村杏野桃繁似雪，行人不醉为谁开。\n赖逢山县卢明府，引我花前劝一杯。\n\n【罗敷水】白居易\n野店东头花落处，一条流水号罗敷。\n芳魂艳骨知何处，春草茫茫墓亦无。\n\n【池上二绝】白居易\n山僧对棋坐，局上竹阴清。映竹无人见，时闻下子声。\n\n小娃撑小艇，偷采白莲回。不解藏踪迹，浮萍一道开。\n\n【种柳三咏】白居易\n白头种松桂，早晚见成林。不及栽杨柳，明年便有阴。\n春风为催促，副取老人心。\n\n从君种杨柳，夹水意如何。准拟三年后，青丝拂绿波。\n仍教小楼上，对唱柳枝歌。\n\n更想五年后，千千条麹尘。路傍深映月，楼上暗藏春。\n愁杀闲游客，闻歌不见人。\n\n【池上即事】白居易\n移床避日依松竹，解带当风挂薜萝。钿砌池心绿蘋合，\n粉开花面白莲多。久阴新霁宜丝管，苦热初凉入绮罗。\n家酝瓶空人客绝，今宵争奈月明何。\n\n【小宅】白居易\n小宅里闾接，疏篱鸡犬通。渠分南巷水，窗借北家风。\n庾信园殊小，陶潜屋不丰。何劳问宽窄，宽窄在心中。\n\n【酒熟忆皇甫十】白居易\n新酒此时熟，故人何日来。自从金谷别，不见玉山颓。\n疏索柳花碗，寂寥荷叶杯。今冬问毡帐，雪里为谁开。\n\n【即事重题】白居易\n重裘暖帽宽毡履，小阁低窗深地炉。\n身稳心安眠未起，西京朝士得知无。\n\n【看嵩洛有叹】白居易\n今日看嵩洛，回头叹世间。荣华急如水，忧患大于山。\n见苦方知乐，经忙始爱闲。未闻笼里鸟，飞出肯飞还。\n\n【咏老赠梦得】白居易\n与君俱老也，自问老何如。眼涩夜先卧，头慵朝未梳。\n有时扶杖出，尽日闭门居。懒照新磨镜，休看小字书。\n情于故人重，迹共少年疏。唯是闲谈兴，相逢尚有馀。\n\n.\n.\n【自题小草亭】白居易\n新结一茅茨，规模俭且卑。土阶全垒块，山木半留皮。\n阴合连藤架，丛香近菊篱。壁宜藜杖倚，门称荻帘垂。\n窗里风清夜，檐间月好时。留连尝酒客，句引坐禅师。\n伴宿双栖鹤，扶行一侍儿。绿醅量醆饮，红稻约升炊。\n龌龊豪家笑，酸寒富室欺。陶庐闲自爱，颜巷陋谁知。\n蝼蚁谋深穴，鹪鹩占小枝。各随其分足，焉用有馀为。\n\n【闲卧寄刘同州】白居易\n软褥短屏风，昏昏醉卧翁。鼻香茶熟后，腰暖日阳中。\n伴老琴长在，迎春酒不空。可怜闲气味，唯欠与君同。\n\n【喜见刘同州梦得】白居易\n紫绶白髭须，同年二老夫。论心共牢落，见面且欢娱。\n酒好携来否，诗多记得无。应须为春草，五马少踟蹰。\n\n【寻春题诸家园林】白居易\n闻健朝朝出，乘春处处寻。天供闲日月，人借好园林。\n渐以狂为态，都无闷到心。平生身得所，未省似而今。\n\n【家园三绝】白居易\n沧浪峡水子陵滩，路远江深欲去难。\n何似家池通小院，卧房阶下插鱼竿。\n\n篱下先生时得醉，瓮间吏部暂偷闲。\n何如家酝双鱼榼，雪夜花时长在前。\n\n鸳鸯怕捉竟难亲，鹦鹉虽笼不著人。\n何似家禽双白鹤，闲行一步亦随身。\n\n【早春题少室东岩】白居易\n三十六峰晴，雪销岚翠生。月留三夜宿，春引四山行。\n远草初含色，寒禽未变声。东岩最高石，唯我有题名。\n\n【二月二日】白居易\n二月二日新雨晴，草芽菜甲一时生。\n轻衫细马春年少，十字津头一字行。\n\n【三月三日】白居易\n画堂三月初三日，絮扑窗纱燕拂檐。莲子数杯尝冷酒，\n柘枝一曲试春衫。阶临池面胜看镜，户映花丛当下帘。\n指点楼南玩新月，玉钩素手两纤纤。\n\n【残春咏怀，赠杨慕巢侍郎】白居易\n位逾三品日，年过六旬时。不道官班下，其如筋力衰。\n犹怜好风景，转重旧亲知。少壮难重得，欢娱且强为。\n兴来池上酌，醉出袖中诗。静话开襟久，闲吟放醆迟。\n落花无限雪，残鬓几多丝。莫说伤心事，春翁易酒悲。\n\n【池上逐凉二首】白居易\n青苔地上消残暑，绿树阴前逐晚凉。轻屐单衫薄纱帽，\n浅池平岸庳藤床。簪缨怪我情何薄，泉石谙君味甚长。\n遍问交亲为老计，多言宜静不宜忙。\n\n窗间睡足休高枕，水畔闲来上小船。棹遣秃头奴子拨，\n茶教纤手侍儿煎。门前便是红尘地，林外无非赤日天。\n谁信好风清簟上，更无一事但翛然。\n\n【老夫】白居易\n七八年来游洛都，三分游伴二分无。风前月下花园里，\n处处唯残个老夫。世事劳心非富贵，人间实事是欢娱。\n谁能逐我来闲坐，时共酣歌倾一壶。\n\n【无长物】白居易\n莫讶家居窄，无嫌活计贫。只缘无长物，始得作闲人。\n青竹单床簟，乌纱独幅巾。其馀皆称是，亦足奉吾身。\n\n【赠谈客】白居易\n上客清谈何亹亹，幽人闲思自寥寥。\n请君休说长安事，膝上风清琴正调。\n\n【题龙门堰西涧】白居易\n东岸菊丛西岸柳，柳阴烟合菊花开。一条秋水琉璃色，\n阔狭才容小舫回。除却悠悠白少傅，何人解入此中来。\n\n【尝酒听歌招客】白居易\n一瓮香醪新插刍，双鬟小妓薄能讴。管弦渐好新教得，\n罗绮虽贫免外求。世上贪忙不觉苦，人间除醉即须愁。\n不知此事君知否，君若知时从我游。\n\n【病中赠南邻觅酒】白居易\n头痛牙疼三日卧，妻看煎药婢来扶。\n今朝似校抬头语，先问南邻有酒无。\n\n【秋雨夜眠】白居易\n凉冷三秋夜，安闲一老翁。卧迟灯灭后，睡美雨声中。\n灰宿温瓶火，香添暖被笼。晓晴寒未起，霜叶满阶红。\n\n【斋戒满夜，戏招梦得】白居易\n纱笼灯下道场前，白日持斋夜坐禅。无复更思身外事，\n未能全尽世间缘。明朝又拟亲杯酒，今夕先闻理管弦。\n方丈若能来问疾，不妨兼有散花天。\n\n【答梦得秋庭独坐见赠】白居易\n林梢隐映夕阳残，庭际萧疏夜气寒。霜草欲枯虫思急，\n风枝未定鸟栖难。容衰见镜同惆怅，身健逢杯且喜欢。\n应是天教相暖热，一时垂老与闲官。\n\n【酬梦得霜夜对月见怀】白居易\n凄清冬夜景，摇落长年情。月带新霜色，砧和远雁声。\n暖怜炉火近，寒觉被衣轻。枕上酬佳句，诗成梦不成。\n\n【题酒瓮呈梦得】白居易\n若无清酒两三瓮，争向白须千万茎。麹糵销愁真得力，\n光阴催老苦无情。凌烟阁上功无分，伏火炉中药未成。\n更拟共君何处去，且来同作醉先生。\n\n【惜春赠李尹】白居易\n春色有时尽，公门终日忙。两衙但不阙，一醉亦何妨。\n芳树花团雪，衰翁鬓扑霜。知君倚年少，未苦惜风光。\n\n【闲游即事】白居易\n郊野游行熟，村园次第过。蓦山寻浥涧，蹋水渡伊河。\n寒食青青草，春风瑟瑟波。逢人共杯酒，随马有笙歌。\n胜事经非少，芳辰过亦多。还须自知分，不老拟如何。\n\n【池上早春，即事招梦得】白居易\n老更惊年改，闲先觉日长。晴熏榆荚黑，春染柳梢黄。\n云破山呈色，冰融水放光。低平稳船舫，轻暖好衣裳。\n白角三升榼，红茵六尺床。偶游难得伴，独醉不成狂。\n我有中心乐，君无外事忙。经过莫慵懒，相去两三坊。\n\n【春夜宴席上戏赠裴淄川】白居易\n九十不衰真地仙，六旬犹健亦天怜。今年相遇莺花月，\n此夜同欢歌酒筵。四座齐声和丝竹，两家随分斗金钿。\n留君到晓无他意，图向君前作少年。\n\n【三月三日祓禊洛滨】白居易\n三月草萋萋，黄莺歇又啼。柳桥晴有絮，沙路润无泥。\n禊事修初半，游人到欲齐。金钿耀桃李，丝管骇凫鹥。\n转岸回船尾，临流簇马蹄。闹翻扬子渡，蹋破魏王堤。\n妓接谢公宴，诗陪荀令题。舟同李膺泛，醴为穆生携。\n水引春心荡，花牵醉眼迷。尘街从鼓动，烟树任鸦栖。\n舞急红腰软，歌迟翠黛低。夜归何用烛，新月凤楼西。\n\n【喜小楼西新柳抽条】白居易\n一行弱柳前年种，数尺柔条今日新。渐欲拂他骑马客，\n未多遮得上楼人。须教碧玉羞眉黛，莫与红桃作麹尘。\n为报金堤千万树，饶伊未敢苦争春。\n\n【感事】白居易\n服气崔常侍，烧丹郑舍人。常期生羽翼，那忽化灰尘。\n每遇凄凉事，还思潦倒身。唯知趁杯酒，不解炼金银。\n睡适三尸性，慵安五藏神。无忧亦无喜，六十六年春。\n\n【偶作】白居易\n篮舁出即忘归舍，柴户昏犹未掩关。闻客病时惭体健，\n见人忙处觉心闲。清凉秋寺行香去，和暖春城拜表还。\n木雁一篇须记取，致身才与不才间。\n\n【幽居早秋闲咏】白居易\n幽僻嚣尘外，清凉水木间。卧风秋拂簟，步月夜开关。\n且得身安泰，从他世险艰。但休争要路，不必入深山。\n轩鹤留何用，泉鱼放不还。谁人知此味，临老十年闲。\n\n【烧药不成命酒独醉】白居易\n白发逢秋王，丹砂见火空。不能留姹女，争免作衰翁。\n赖有杯中绿，能为面上红。少年心不远，只在半酣中。\n\n【送李滁州】白居易\n君于觉路深留意，我亦禅门薄致功。未悟病时须去病，\n已知空后莫依空。白衣卧病嵩山下，皂盖行春楚水东。\n谁道三年千里别，两心同在道场中。\n\n【冬夜对酒寄皇甫十】白居易\n霜杀中庭草，冰生后院池。有风空动树，无叶可辞枝。\n十月苦长夜，百年强半时。新开一瓶酒，那得不相思。\n\n【寄献北都留守裴令公】白居易\n天上中台正，人间一品高。休明值尧舜，勋业过萧曹。\n始擅文三捷，终兼武六韬。动人名赫赫，忧国意忉忉。\n荡蔡擒封豕，平齐斩巨鳌。两河收土宇，四海定波涛。\n宠重移宫龠，恩新换阃旄。保厘东宅静，守护北门牢。\n晋国封疆阔，并州士马豪。胡兵惊赤帜，边雁避乌号。\n令下流如水，仁沾泽似膏。路喧歌五袴，军醉感单醪。\n将校森貔武，宾僚俨隽髦。客无烦夜柝，吏不犯秋毫。\n神在台骀助，魂亡猃狁逃。德星销彗孛，霖雨灭腥臊。\n烽戍高临代，关河远控洮。汾云晴漠漠，朔吹冷颾颾。\n豹尾交牙戟，虬须捧佩刀。通天白犀带，照地紫麟袍。\n羌管吹杨柳，燕姬酌蒲萄。银含凿落盏，金屑琵琶槽。\n遥想从军乐，应忘报国劳。紫微留北阙，绿野寄东皋。\n忽忆前时会，多惭下客叨。清宵陪宴话，美景从游遨。\n花月还同赏，琴诗雅自操。朱弦拂宫徵，洪笔振风骚。\n近竹开方丈，依林架桔槔。春池八九曲，画舫两三艘。\n径滑苔黏屐，潭深水没篙。绿丝萦岸柳，红粉映楼桃。\n为穆先陈醴，招刘共藉糟。舞鬟金翡翠，歌颈玉蛴螬。\n盛德终难过，明时岂易遭。公虽慕张范，帝未舍伊皋。\n眷恋心方结，踟蹰首已搔。鸾皇上寥廓，燕雀任蓬蒿。\n欲献文狂简，徒烦思郁陶。可怜四百字，轻重抵鸿毛。\n\n【酬思黯戏赠同用狂字】白居易\n钟乳三千两，金钗十二行。妒他心似火，欺我鬓如霜。\n慰老资歌笑，销愁仰酒浆。眼看狂不得，狂得且须狂。\n\n【闲适】白居易\n禄俸优饶官不卑，就中闲适是分司。风光暖助游行处，\n雨雪寒供饮宴时。肥马轻裘还且有，粗歌薄酒亦相随。\n微躬所要今皆得，只是蹉跎得校迟。\n\n【酬裴令公赠马相戏】白居易\n安石风流无奈何，欲将赤骥换青娥。\n不辞便送东山去，临老何人与唱歌。\n\n【早春持斋，答皇甫十见赠】白居易\n正月晴和风气新，纷纷已有醉游人。\n帝城花笑长斋客，三十年来负早春。\n\n【酬皇甫十早春对雪见赠】白居易\n漠漠复雰雰，东风散玉尘。明催竹窗晓，寒退柳园春。\n绿酝香堪忆，红炉暖可亲。忍心三两日，莫作破斋人。\n\n【送蕲春李十九使君赴郡】白居易\n可怜官职好文词，五十专城未是迟。晓日镜前无白发，\n春风门外有红旗。郡中何处堪携酒，席上谁人解和诗。\n唯共交亲开口笑，知君不及洛阳时。\n\n【寒食日寄杨东川】白居易\n不知杨六逢寒食，作底欢娱过此辰。兜率寺高宜望月，\n嘉陵江近好游春。蛮旗似火行随马，蜀妓如花坐绕身。\n不使黔娄夫妇看，夸张富贵向何人。\n\n【早夏晓兴赠梦得】白居易\n窗明帘薄透朝光，卧整巾簪起下床。背壁灯残经宿焰，\n开箱衣带隔年香。无情亦任他春去，不醉争销得昼长。\n一部清商一壶酒，与君明日暖新堂。\n\n【寄李蕲州】白居易\n下车书奏龚黄课，动笔诗传鲍谢风。江郡讴谣夸杜母，\n洛城欢会忆车公。笛愁春尽梅花里，簟冷秋生薤叶中。\n不道蕲州歌酒少，使君难称与谁同。\n\n【久雨闲闷，对酒偶吟】白居易\n凄凄苦雨暗铜驼，袅袅凉风起漕河。自夏及秋晴日少，\n从朝至暮闷时多。鹭临池立窥鱼笱，隼傍林飞拂雀罗。\n赖有杯中神圣物，百忧无奈十分何。\n\n【酬梦得早秋夜对月见寄】白居易\n吾衰寡情趣，君病懒经过。其奈西楼上，新秋明月何。\n庭芜凄白露，池色澹金波。况是初长夜，东城砧杵多。\n\n【谢杨东川寄衣服】白居易\n年年衰老交游少，处处萧条书信稀。\n唯有巢兄不相忘，春茶未断寄秋衣。\n\n【东城晚归】白居易\n一条邛杖悬龟榼，双角吴童控马衔。\n晚入东城谁识我，短靴低帽白蕉衫。\n\n【与牛家妓乐雨后合宴】白居易\n玉管清弦声旖旎，翠钗红袖坐参差。两家合奏洞房夜，\n八月连阴秋雨时。歌脸有情凝睇久，舞腰无力转裙迟。\n人间欢乐无过此，上界西方即不知。\n\n【自咏】白居易\n须白面微红，醺醺半醉中。百年随手过，万事转头空。\n卧疾瘦居士，行歌狂老翁。仍闻好事者，将我画屏风。\n\n【九月八日酬皇甫十见赠】白居易\n君方对酒缀诗章，我正持斋坐道场。处处追游虽不去，\n时时吟咏亦无妨。霜蓬旧鬓三分白，露菊新花一半黄。\n惆怅东篱不同醉，陶家明日是重阳。\n\n【杪秋独夜】白居易\n无限少年非我伴，可怜清夜与谁同。欢娱牢落中心少，\n亲故凋零四面空。红叶树飘风起后，白须人立月明中。\n前头更有萧条物，老菊衰兰三两丛。\n\n【苏州故吏】白居易\n江南故吏别来久，今日池边识我无。\n不独使君头似雪，华亭鹤死白莲枯。\n\n【天宫阁秋晴晚望】白居易\n洛城秋霁后，梵阁暮登时。此日风烟好，今秋节候迟。\n霞光红泛艳，树影碧参差。莫虑言归晚，牛家有宿期。\n\n【听歌】白居易\n管妙弦清歌入云，老人合眼醉醺醺。\n诚知不及当年听，犹觉闻时胜不闻。\n\n【初冬即事呈梦得】白居易\n青毡帐暖喜微雪，红地炉深宜早寒。走笔小诗能和否，\n泼醅新酒试尝看。僧来乞食因留宿，客到开尊便共欢。\n临老交亲零落尽，希君恕我取人宽。\n\n【四年春】白居易\n柳梢黄嫩草芽新，又入开成第四春。近日放慵多不出，\n少年嫌老可相亲。分司吉傅频过舍，致仕崔卿拟卜邻。\n时辈推迁年事到，往还多是白头人。\n\n【追欢偶作】白居易\n追欢逐乐少闲时，补贴平生得事迟。何处花开曾后看，\n谁家酒熟不先知。石楼月下吹芦管，金谷风前舞柳枝。\n十听春啼变莺舌，三嫌老丑换蛾眉。乐天一过难知分，\n犹自咨嗟两鬓丝。\n\n【西楼独立】白居易\n身著白衣头似雪，时时醉立小楼中。\n路人回顾应相怪，十一年来见此翁。\n\n【酬梦得比萱草见赠】白居易\n杜康能散闷，萱草解忘忧。借问萱逢杜，何如白见刘。\n老衰胜少夭，闲乐笑忙愁。试问同年内，何人得白头。\n\n【早春独登天宫阁】白居易\n天宫日暖阁门开，独上迎春饮一杯。\n无限游人遥怪我，缘何最老最先来。\n\n【长洲曲新词】白居易\n茂苑绮罗佳丽地，女湖桃李艳阳时。\n心奴已死胡容老，后辈风流是阿谁。\n\n【病中诗十五首 初病风】白居易\n六十八衰翁，乘衰百疾攻。朽株难免蠹，空穴易来风。\n肘痹宜生柳，头旋剧转蓬。恬然不动处，虚白在胸中。\n\n【病中诗十五首 送嵩客】白居易\n登山临水分无期，泉石烟霞今属谁。\n君到嵩阳吟此句，与教二十六峰知。\n\n【病中诗十五首 卖骆马】白居易\n五年花下醉骑行，临卖回头嘶一声。\n项籍顾骓犹解叹，乐天别骆岂无情。\n\n【病中诗十五首 自解】白居易\n房传往世为禅客，王道前生应画师。我亦定中观宿命，\n多生债负是歌诗。不然何故狂吟咏，病后多于未病时。\n\n【酬梦得贫居咏怀见赠】白居易\n岁阴生计两蹉跎，相顾悠悠醉且歌。厨冷难留乌止屋，\n门闲可与雀张罗。病添庄舄吟声苦，贫欠韩康药债多。\n日望挥金贺新命，俸钱依旧又如何。\n\n【感苏州旧舫】白居易\n画梁朽折红窗破，独立池边尽日看。\n守得苏州船舫烂，此身争合不衰残。\n\n【斋戒】白居易\n每因斋戒断荤腥，渐觉尘劳染爱轻。六贼定知无气色，\n三尸应恨少恩情。酒魔降伏终须尽，诗债填还亦欲平。\n从此始堪为弟子，竺乾师是古先生。\n\n【对镜偶吟，赠张道士抱元】白居易\n闲来对镜自思量，年貌衰残分所当。白发万茎何所怪，\n丹砂一粒不曾尝。眼昏久被书料理，肺渴多因酒损伤。\n今日逢师虽已晚，枕中治老有何方。\n\n【卧疾来早晚】白居易\n卧疾来早晚，悬悬将十旬。婢能寻本草，犬不吠医人。\n酒瓮全生醭，歌筵半委尘。风光还欲好，争向枕前春。\n\n【病后寒食】白居易\n故纱绛帐旧青毡，药酒醺醺引醉眠。斗擞弊袍春晚后，\n摩挲病脚日阳前。行无筋力寻山水，坐少精神听管弦。\n抛掷风光负寒食，曾来未省似今年。\n\n【春暖】白居易\n风痹宜和暖，春来脚较轻。莺留花下立，鹤引水边行。\n发少嫌巾重，颜衰讶镜明。不论亲与故，自亦昧平生。\n\n【送唐州崔使君侍亲赴任】白居易\n连持使节历专城，独贺崔侯最庆荣。乌府一抛霜简去，\n朱轮四从板舆行。发时止许沙鸥送，到日方乘竹马迎。\n唯虑郡斋宾友少，数杯春酒共谁倾。\n\n【池上早夏】白居易\n水积春塘晚，阴交夏木繁。舟船如野渡，篱落似江村。\n静拂琴床席，香开酒库门。慵闲无一事，时弄小娇孙。\n\n【时热少客，因咏所怀】白居易\n冠栉心多懒，逢迎兴渐微。况当时热甚，幸遇客来稀。\n湿洒池边地，凉开竹下扉。露床青篾簟，风架白蕉衣。\n院静留僧宿，楼空放妓归。衰残强欢宴，此事久知非。\n\n【足疾】白居易\n足疾无加亦不瘳，绵春历夏复经秋。开颜且酌尊中酒，\n代步多乘池上舟。幸有眼前衣食在，兼无身后子孙忧。\n应须学取陶彭泽，但委心形任去留。\n\n【梦微之】白居易\n夜来携手梦同游，晨起盈巾泪莫收。漳浦老身三度病，\n咸阳草树八回秋。君埋泉下泥销骨，我寄人间雪满头。\n阿卫韩郎相次去，夜台茫昧得知不。\n\n【老病幽独，偶吟所怀】白居易\n眼渐昏昏耳渐聋，满头霜雪半身风。已将身出浮云外，\n犹寄形于逆旅中。觞咏罢来宾阁闭，笙歌散后妓房空。\n世缘俗念消除尽，别是人间清净翁。\n\n【在家出家】白居易\n衣食支吾婚嫁毕，从今家事不相仍。夜眠身是投林鸟，\n朝饭心同乞食僧。清唳数声松下鹤，寒光一点竹间灯。\n中宵入定跏趺坐，女唤妻呼多不应。\n\n【题香山新经堂招僧】白居易\n烟满秋堂月满庭，香花漠漠磬泠泠。\n谁能来此寻真谛，白老新开一藏经。\n\n【早入皇城赠王留守仆射】白居易\n津桥残月晓沈沈，风露凄清禁署深。\n城柳宫槐谩摇落，悲愁不到贵人心。\n\n【改业】白居易\n先生老去饮无兴，居士病来闲有馀。犹觉醉吟多放逸，\n不如禅定更清虚。柘枝紫袖教丸药，羯鼓苍头遣种蔬。\n却被山僧戏相问，一时改业意何如。\n\n【山中五绝句 岭上云】白居易\n岭上白云朝未散，田中青麦旱将枯。\n自生自灭成何事，能逐东风作雨无。\n\n【山中五绝句 林下樗】白居易\n香檀文桂苦雕镌，生理何曾得自全。\n知我无材老樗否，一枝不损尽天年。\n\n【山中五绝句 洞中蝙蝠】白居易\n千年鼠化白蝙蝠，黑洞深藏避网罗。\n远害全身诚得计，一生幽暗又如何。\n\n【自戏三绝句 身报心】白居易\n心是身王身是宫，君今居在我宫中。\n是君家舍君须爱，何事论恩自说功。\n\n【过裴令公宅二绝句】白居易\n风吹杨柳出墙枝，忆得同欢共醉时。\n每到集贤坊地过，不曾一度不低眉。\n\n梁王旧馆雪濛濛，愁杀邹枚二老翁。\n假使明朝深一尺，亦无人到兔园中。\n\n【早热】白居易\n畏景又加旱，火云殊未收。篱暄饥有雀，池涸渴无鸥。\n岸帻头仍痛，褰裳汗亦流。若为当此日，迁客向炎州。\n\n【新涧亭】白居易\n烟萝初合涧新开，闲上西亭日几回。\n老病归山应未得，且移泉石就身来。\n\n【寄潮州杨继之】白居易\n相府潮阳俱梦中，梦中何者是穷通。\n他时事过方应悟，不独荣空辱亦空。\n\n【赠思黯】白居易\n为怜清浅爱潺湲，一日三回到水边。\n若道归仁滩更好，主人何故别三年。\n\n【听歌六绝句 想夫怜】白居易\n玉管朱弦莫急催，容听歌送十分杯。\n长爱夫怜第二句，请君重唱夕阳开。\n\n【听歌六绝句 离别难】白居易\n绿杨陌上送行人，马去车回一望尘。\n不觉别时红泪尽，归来无泪可沾巾。\n\n【开成二年夏闻新蝉赠梦得】白居易\n十载与君别，常感新蝉鸣。今年共君听，同在洛阳城。\n噪处知林静，闻时觉景清。凉风忽袅袅，秋思先秋生。\n残槿花边立，老槐阴下行。虽无索居恨，还动长年情。\n且喜未聋耳，年年闻此声。\n\n【春日闲居三首】白居易\n陶云爱吾庐，吾亦爱吾屋。屋中有琴书，聊以慰幽独。\n是时三月半，花落庭芜绿。舍上晨鸠鸣，窗间春睡足。\n睡足起闲坐，景晏方栉沐。今日非十斋，庖童馈鱼肉。\n饥来恣餐歠，冷热随所欲。饱竟快搔爬，筋骸无检束。\n岂徒畅肢体，兼欲遗耳目。便可傲松乔，何假杯中渌。\n\n广池春水平，群鱼恣游泳。新林绿阴成，众鸟欣相鸣。\n时我亦潇洒，适无累与病。鱼鸟人则殊，同归于遂性。\n缅思山梁雉，时哉感孔圣。圣人不得所，慨然叹时命。\n我今对鳞羽，取乐成谣咏。得所仍得时，吾生一何幸。\n\n劳者不觉歌，歌其劳苦事。逸者不觉歌，歌其逸乐意。\n问我逸如何，闲居多兴味。问我乐如何，闲官少忧累。\n又问俸厚薄，百千随月至。又问年几何，七十行欠二。\n所得皆过望，省躬良可愧。马闲无羁绊，鹤老有禄位。\n设自为化工，优饶只如是。安得不歌咏，默默受天赐。\n\n【池上幽境】白居易\n袅袅过水桥，微微入林路。幽境深谁知，老身闲独步。\n行行何所爱，遇物自成趣。平滑青盘石，低密绿阴树。\n石上一素琴，树下双草屦。此是荣先生，坐禅三乐处。\n\n【和梦得洛中早春见赠七韵】白居易\n众皆赏春色，君独怜春意。春意竟如何，老夫知此味。\n烛馀减夜漏，衾暖添朝睡。恬和台上风，虚润池边地。\n开迟花养艳，语懒莺含思。似讶隔年斋，如劝迎春醉。\n何日同宴游，心期二月二。\n\n【洗竹】白居易\n布裘寒拥颈，毡履温承足。独立冰池前，久看洗霜竹。\n先除老且病，次去纤而曲。剪弃犹可怜，琅玕十馀束。\n青青复籊籊，颇异凡草木。依然若有情，回头语僮仆。\n小者截鱼竿，大者编茅屋。勿作篲与箕，而令粪土辱。\n\n【三年除夜】白居易\n晰晰燎火光，氲氲腊酒香。嗤嗤童稚戏，迢迢岁夜长。\n堂上书帐前，长幼合成行。以我年最长，次第来称觞。\n七十期渐近，万缘心已忘。不唯少欢乐，兼亦无悲伤。\n素屏应居士，青衣侍孟光。夫妻老相对，各坐一绳床。\n\n【病中宴坐】白居易\n有酒病不饮，有诗慵不吟。头眩罢垂钩，手痹休援琴。\n竟日悄无事，所居闲且深。外安支离体，中养希夷心。\n窗户纳秋景，竹木澄夕阴。宴坐小池畔，清风时动襟。\n\n【赠梦得】白居易\n前日君家饮，昨日王家宴。今日过我庐，三日三会面。\n当歌聊自放，对酒交相劝。为我尽一杯，与君发三愿。\n一愿世清平，二愿身强健。三愿临老头，数与君相见。\n\n【遇物感兴因示子弟】白居易\n圣择狂夫言，俗信老人语。我有老狂词，听之吾语汝。\n吾观器用中，剑锐锋多伤。吾观形骸内，骨劲齿先亡。\n寄言处世者，不可苦刚强。龟性愚且善，鸠心钝无恶。\n人贱拾支床，鹘欺擒暖脚。寄言立身者，不得全柔弱。\n彼固罹祸难，此未免忧患。于何保终吉，强弱刚柔间。\n上遵周孔训，旁鉴老庄言。不唯鞭其后，亦要轭其先。\n\n【闲题家池，寄王屋张道士】白居易\n有石白磷磷，有水清潺潺。有叟头似雪，婆娑乎其间。\n进不趋要路，退不入深山。深山太濩落，要路多险艰。\n不如家池上，乐逸无忧患。有食适吾口，有酒酡吾颜。\n恍惚游醉乡，希夷造玄关。五千言下悟，十二年来闲。\n富者我不顾，贵者我不攀。唯有天坛子，时来一往还。\n\n【北窗竹石】白居易\n一片瑟瑟石，数竿青青竹。向我如有情，依然看不足。\n况临北窗下，复近西塘曲。筠风散馀清，苔雨含微绿。\n有妻亦衰老，无子方茕独。莫掩夜窗扉，共渠相伴宿。\n\n【闲坐看书，贻诸少年】白居易\n雨砌长寒芜，风庭落秋果。窗间有闲叟，尽日看书坐。\n书中见往事，历历知福祸。多取终厚亡，疾驱必先堕。\n劝君少干名，名为锢身锁。劝君少求利，利是焚身火。\n我心知已久，吾道无不可。所以雀罗门，不能寂寞我。\n\n【对酒闲吟，赠同老者】白居易\n人生七十稀，我年幸过之。远行将尽路，春梦欲觉时。\n家事口不问，世名心不思。老既不足叹，病亦不能治。\n扶持仰婢仆，将养信妻儿。饥饱进退食，寒暄加减衣。\n声妓放郑卫，裘马脱轻肥。百事尽除去，尚馀酒与诗。\n兴来吟一篇，吟罢酒一卮。不独适情性，兼用扶衰羸。\n云液洒六腑，阳和生四肢。于中我自乐，此外吾不知。\n寄问同老者，舍此将安归。莫学蓬心叟，胸中残是非。\n\n【香山居士写真诗】白居易\n昔作少学士，图形入集贤。今为老居士，写貌寄香山。\n鹤毳变玄发，鸡肤换朱颜。前形与后貌，相去三十年。\n勿叹韶华子，俄成皤叟仙。请看东海水，亦变作桑田。\n\n【不出门】白居易\n弥月不出门，永日无来宾。食饱更拂床，睡觉一嚬伸。\n轻箑白鸟羽，新簟青箭筠。方寸方丈室，空然两无尘。\n披衣腰不带，散发头不巾。袒跣北窗下，葛天之遗民。\n一日亦自足，况得以终身。不知天壤内，目我为何人。\n\n【春池闲泛】白居易\n绿塘新水平，红槛小舟轻。解缆随风去，开襟信意行。\n浅怜清演漾，深爱绿澄泓。白扑柳飞絮，红浮桃落英。\n古文科斗出，新叶剪刀生。树集莺朋友，云行雁弟兄。\n飞沈皆适性，酣咏自怡情。花助银杯气，松添玉轸声。\n鱼跳何事乐，鸥起复谁惊。莫唱沧浪曲，无尘可濯缨。\n\n【闲居自题，戏招宿客】白居易\n水畔竹林边，闲居二十年。健常携酒出，病即掩门眠。\n解绶收朝佩，褰裳出野船。屏除身外物，摆落世间缘。\n报曙窗何早，知秋簟最先。微风深树里，斜日小楼前。\n渠口添新石，篱根写乱泉。欲招同宿客，谁解爱潺湲。\n\n【闰九月九日独饮】白居易\n黄花丛畔绿尊前，犹有些些旧管弦。偶遇闰秋重九日，\n东篱独酌一陶然。自从九月持斋戒，不醉重阳十五年。\n\n【寒亭留客】白居易\n今朝闲坐石亭中，炉火销残尊又空。\n冷落若为留客住，冰池霜竹雪髯翁。\n\n【履道西门二首】白居易\n履道西门有弊居，池塘竹树绕吾庐。豪华肥壮虽无分，\n饱暖安闲即有馀。行灶朝香炊早饭，小园春暖掇新蔬。\n夷齐黄绮夸芝蕨，比我盘飧恐不如。\n\n履道西门独掩扉，官休病退客来稀。亦知轩冕荣堪恋，\n其奈田园老合归。跛鳖难随骐骥足，伤禽莫趁凤凰飞。\n世间认得身人少，今我虽愚亦庶几。\n\n【雪夜小饮赠梦得】白居易\n同为懒慢园林客，共对萧条雨雪天。小酌酒巡销永夜，\n大开口笑送残年。久将时背成遗老，多被人呼作散仙。\n呼作散仙应有以，曾看东海变桑田。\n\n【卯饮】白居易\n短屏风掩卧床头，乌帽青毡白氎裘。\n卯饮一杯眠一觉，世间何事不悠悠。\n\n【滩声】白居易\n碧玉班班沙历历，清流决决响泠泠。\n自从造得滩声后，玉管朱弦可要听。\n\n【出斋日喜皇甫十早访】白居易\n三旬斋满欲衔杯，平旦敲门门未开。\n除却朗之携一榼，的应不是别人来。\n\n【酬南洛阳早春见赠】白居易\n物华春意尚迟回，赖有东风昼夜催。寒缒柳腰收未得，\n暖熏花口噤初开。欲披云雾联襟去，先喜琼琚入袖来。\n久病长斋诗老退，争禁年少洛阳才。\n\n【携酒往朗之庄居同饮】白居易\n慵中又少经过处，别后都无劝酒人。\n不挈一壶相就醉，若为将老度残春。\n\n【春尽日】白居易\n芳景销残暑气生，感时思事坐含情。无人开口共谁语，\n有酒回头还自倾。醉对数丛红芍药，渴尝一碗绿昌明。\n春归似遣莺留语，好住园林三两声。\n\n【夏日与闲禅师林下避暑】白居易\n洛景城西尘土红，伴僧闲坐竹泉东。绿萝潭上不见日，\n白石滩边长有风。热恼渐知随念尽，清凉常愿与人同。\n每因毒暑悲亲故，多在炎方瘴海中。\n\n【病中看经赠诸道侣】白居易\n右眼昏花左足风，金篦石水用无功。不如回念三乘乐，\n便得浮生百病空。无子同居草庵下，有妻偕老道场中。\n何烦更请僧为侣，月上新归伴病翁。\n\n【池畔逐凉】白居易\n风清泉冷竹修修，三伏炎天凉似秋。黄犬引迎骑马客，\n青衣扶下钓鱼舟。衰容自觉宜闲坐，蹇步谁能更远游。\n料得此身终老处，只应林下与滩头。\n\n【池鹤八绝句 鹤答鸡】白居易\n尔争伉俪泥中斗，吾整羽仪松上栖。\n不可遣他天下眼，却轻野鹤重家鸡。\n\n【池鹤八绝句 鹤答乌】白居易\n吾爱栖云上华表，汝多攫肉下田中。\n吾音中羽汝声角，琴曲虽同调不同。\n\n【池鹤八绝句 鹤答鸢】白居易\n无妨自是莫相非，清浊高低各有归。\n鸾鹤群中彩云里，几时曾见喘鸢飞。\n\n【池鹤八绝句 鹤答鹅】白居易\n右军殁后欲何依，只合随鸡逐鸭飞。\n未必牺牲及吾辈，大都我瘦胜君肥。\n\n【答客说】白居易\n吾学空门非学仙，恐君此说是虚传。\n海山不是吾归处，归即应归兜率天。\n\n【昨日复今辰】白居易\n昨日复今辰，悠悠七十春。所经多故处，却想似前身。\n散秩优游老，闲居净洁贫。螺杯中有物，鹤氅上无尘。\n解佩收朝带，抽簪换野巾。风仪与名号，别是一生人。\n\n【游赵村杏花】白居易\n赵村红杏每年开，十五年来看几回。\n七十三人难再到，今春来是别花来。\n\n【问诸亲友】白居易\n七十人难到，过三更较稀。占花租野寺，定酒典朝衣。\n趁醉春多出，贪欢夜未归。不知亲故口，道我是耶非。\n\n【不与老为期】白居易\n不与老为期，因何两鬓丝。才应免夭促，便已及衰羸。\n昨夜梦何在，明朝身不知。百忧非我所，三乐是吾师。\n闭目常闲坐，低头每静思。存神机虑息，养气语言迟。\n行亦携诗箧，眠多枕酒卮。自惭无一事，少有不安时。\n\n【闲坐】白居易\n婆娑放鸡犬，嬉戏任儿童。闲坐槐阴下，开襟向晚风。\n沤麻池水里，晒枣日阳中。人物何相称，居然田舍翁。\n\n【道场独坐】白居易\n整顿衣巾拂净床，一瓶秋水一炉香。不论烦恼先须去，\n直到菩提亦拟忘。朝谒久停收剑珮，宴游渐罢废壶觞。\n世间无用残年处，只合逍遥坐道场。\n\n【狂吟七言十四韵】白居易\n亦知世是休明世，自想身非富贵身。但恐人间为长物，\n不如林下作遗民。游依二室成三友，住近双林当四邻。\n性海澄渟平少浪，心田洒扫净无尘。香山闲宿一千夜，\n梓泽连游十六春。是客相逢皆故旧，无僧每见不殷勤。\n药停有喜闲销疾，金尽无忧醉忘贫。补绽衣裳愧妻女，\n支持酒肉赖交亲。俸随日计钱盈贯，禄逐年支粟满囷。\n洛堰鱼鲜供取足，游村果熟馈争新。诗章人与传千首，\n寿命天教过七旬。点检一生徼幸事，东都除我更无人。\n\n【宿府池西亭】白居易\n池上平桥桥下亭，夜深睡觉上桥行。\n白头老尹重来宿，十五年前旧月明。\n\n【杨柳枝词】白居易\n一树春风千万枝，嫩于金色软于丝。\n永丰西角荒园里，尽日无人属阿谁。\n\n【斋居春久，感事遣怀】白居易\n斋戒坐三旬，笙歌发四邻。月明停酒夜，眼暗看花人。\n赖学空为观，深知念是尘。犹思闲语笑，未忘旧交亲。\n久作龙门主，多为兔苑宾。水嬉歌尽日，雪宴烛通晨。\n事事皆过分，时时自问身。风光抛得也，七十四年春。\n\n【欢喜二偈】白居易\n得老加年诚可喜，当春对酒亦宜欢。\n心中别有欢喜事，开得龙门八节滩。\n\n眼暗头旋耳重听，唯馀心口尚醒醒。\n今朝欢喜缘何事，礼彻佛名百部经。\n\n【赠诸少年】白居易\n少年莫笑我蹉跎，听我狂翁一曲歌。入手荣名取虽少，\n关心稳事得还多。老惭退马沾刍秣，高喜归鸿脱弋罗。\n官给俸钱天与寿，些些贫病奈吾何。\n\n【寄黔州马常侍】白居易\n闲看双节信为贵，乐饮一杯谁与同。\n可惜风情与心力，五年抛掷在黔中。\n\n【闲居】白居易\n风雨萧条秋少客，门庭冷静昼多关。金羁骆马近卖却，\n罗袖柳枝寻放还。书卷略寻聊取睡，酒杯浅把粗开颜。\n眼昏入夜休看月，脚重经春不上山。心静无妨喧处寂，\n机忘兼觉梦中闲。是非爱恶销停尽，唯寄空身在世间。\n\n【春眠】白居易\n枕低被暖身安稳，日照房门帐未开。\n还有少年春气味，时时暂到梦中来。\n\n【能无愧】白居易\n十两新绵褐，披行暖似春。一团香絮枕，倚坐稳于人。\n婢仆遣他尝药草，儿孙与我拂衣巾。回看左右能无愧，\n养活枯残废退身。\n\n【自咏老身示诸家属】白居易\n寿及七十五，俸沾五十千。夫妻偕老日，甥侄聚居年。\n粥美尝新米，袍温换故绵。家居虽濩落，眷属幸团圆。\n置榻素屏下，移炉青帐前。书听孙子读，汤看侍儿煎。\n走笔还诗债，抽衣当药钱。支分闲事了，爬背向阳眠。\n\n【六年立春日人日作】白居易\n二日立春人七日，盘蔬饼饵逐时新。年方吉郑犹为少，\n家比刘韩未是贫。乡园节岁应堪重，亲故欢游莫厌频。\n试作循潮封眼想，何由得见洛阳春。\n\n【咏身】白居易\n自中风来三历闰，从悬车后几逢春。周南留滞称遗老，\n汉上羸残号半人。薄有文章传子弟，断无书札答交亲。\n馀年自问将何用，恐是人间剩长身。\n\n【读道德经】白居易\n玄元皇帝著遗文，乌角先生仰后尘。金玉满堂非己物，\n子孙委蜕是他人。世间尽不关吾事，天下无亲于我身。\n只有一身宜爱护，少教冰炭逼心神。\n\n【窗中列远岫】白居易\n天静秋山好，窗开晓翠通。遥怜峰窈窕，不隔竹朦胧。\n万点当虚室，千重叠远空。列檐攒秀气，缘隙助清风。\n碧爱新晴后，明宜反照中。宣城郡斋在，望与古时同。\n\n【大社观献捷诗】白居易\n淮海妖氛灭，乾坤嘉气通。班师郊社内，操袂凯歌中。\n庙算无遗策，天兵不战功。小臣同鸟兽，率舞向皇风。\n\n【三谣 蟠木谣】白居易\n蟠木蟠木，有似我身；不中乎器，无用于人。\n下拥肿而上辚菌，桷不桷兮轮不轮。\n天子建明堂兮既非梁栋，诸侯斫大辂兮材又不中。\n唯我病夫，或有所用。用尔为几，承吾臂支吾颐而已矣。\n不伤尔性，不枉尔理。尔怏怏为几之外，无所用尔。\n尔既不材，吾亦不材，胡为乎人间裴回？蟠木蟠木，\n吾与汝归草堂去来。\n\n【三谣 朱藤谣】白居易\n朱藤朱藤，温如红玉，直如朱绳。自我得尔以为杖，\n大有裨于股肱。前年左选，东南万里。交游别我于国门，\n亲友送我于浐水。登高山兮车倒轮摧，渡汉水兮马跙蹄开。\n中途不进，部曲多回。唯此朱藤，实随我来。瘴疠之乡，\n无人之地。扶卫衰病，驱诃魑魅。吾独一身，赖尔为二。\n或水或陆，自北徂南。泥黏雪滑，足力不堪。吾本两足，\n得尔为三。紫霄峰头，黄石岩下。松门石磴，不通舆马。\n吾与尔披云拨水，环山绕野。二年蹋遍匡庐间，\n未尝一步而相舍。虽有佳子弟、良友朋，扶危助蹇，\n不如朱藤。嗟乎，穷既若是，通复何如，吾不以常杖待尔，\n尔勿以常人望吾。朱藤朱藤，吾虽青云之上、黄泥之下，\n誓不弃尔于斯须。\n\n【池上篇】白居易\n十亩之宅，五亩之园。有水一池，有竹千竿。勿谓土狭，\n勿谓地偏。足以容膝，足以息肩。有堂有庭，有桥有船。\n有书有酒，有歌有弦。有叟在中，白须飘然。识分知足，\n外无求焉。如鸟择木，姑务巢安。如龟居坎，不知海宽。\n灵鹤怪石，紫菱白莲。皆吾所好，尽在吾前。时饮一杯，\n或吟一篇。妻孥熙熙，鸡犬闲闲。优哉游哉，\n吾将终老乎其间。\n\n【不能忘情吟】白居易\n鬻骆马兮放杨柳枝，掩翠黛兮顿金羁。\n马不能言兮长鸣而却顾，杨柳枝再拜长跪而致辞。\n辞曰：主乘此骆五年，凡千有八百日。衔橛之下，\n不惊不逸。素事主十年，凡三千有六百日。巾栉之间，\n无违无失。今素貌虽陋，未至衰摧。骆力犹壮，\n又无虺隤。即骆之力，尚可以代主一步；素之歌，\n亦可以送主一杯。一旦双去，有去无回。故素将去，\n其辞也苦；骆将去，其鸣也哀。此人之情也，马之情也，\n岂主君独无情哉？予俯而叹，仰而咍，且曰：骆，骆，\n尔勿嘶：素，素，尔勿啼。骆反厩，素反闺。吾疾虽作，\n年虽颓，幸未及项籍之将死。何必一日之内，\n弃骓兮而别虞兮。乃目素兮素兮，为我歌杨柳枝。\n我姑酌彼金罍，我与尔归醉乡去来。\n\n.\n.\n【阴雨】白居易\n润叶濡枝浃四方，浓云来去势何长。\n旷然寰宇清风满，救旱功高暑气凉。\n\n【过故洛城】白居易\n故城门前春日斜，故城门里无人家。\n市朝欲认不知处，漠漠野田飞草花。\n\n【赠薛涛（见张为主客图）】白居易\n蛾眉山势接云霓，欲逐刘郎北路迷。\n若似剡中容易到，春风犹隔武陵溪。\n\n【听芦管】白居易\n幽咽新芦管，凄凉古竹枝。似临猿峡唱，疑在雁门吹。\n调为高多切，声缘小乍迟。粗豪嫌觱篥，细妙胜参差。\n云水巴南客，风沙陇上儿。屈原收泪夜，苏武断肠时。\n仰秣胡驹听，惊栖越鸟知。何言胡越异，闻此一同悲。\n\n【送刘郎中赴任苏州】白居易\n仁风膏雨去随轮，胜境欢游到逐身。水驿路穿儿店月，\n花船棹入女湖春。宣城独咏窗中岫，柳恽单题汀上蘋。\n何似姑苏诗太守，吟诗相继有三人。\n\n【除夜言怀，兼赠张常侍】白居易\n三百六旬今夜尽，六十四年明日催。不用叹身随日老，\n亦须知寿逐年来。加添雪兴凭毡帐，消杀春愁付酒杯。\n唯恨诗成君去后，红笺纸卷为谁开。\n\n【和河南郑尹新岁对雪】白居易\n白雪吟诗铃阁开，故情新兴两裴回。昔经勤苦照书卷，\n今助欢娱飘酒杯。楚客难酬郢中曲，吴公兼占洛阳才。\n铜街金谷春知否，又有诗人作尹来。\n\n【醉中见微之旧卷有感】白居易\n今朝何事一沾襟，检得君诗醉后吟。老泪交流风病眼，\n春笺摇动酒杯心。银钩尘覆年年暗，玉树泥埋日日深。\n闻道墓松高一丈，更无消息到如今。\n\n【赠张处士山人】白居易\n萝襟蕙带竹皮巾，虽到尘中不染尘。每见俗人多惨澹，\n惟逢美酒即殷勤。浮云心事谁能会，老鹤风标不可亲。\n世说三生如不谬，共疑巢许是前身。\n\n【初冬即事忆皇甫十】白居易\n冷竹风成韵，荒街叶作堆。欲寻联句卷，先饮暖寒杯。\n帽为迎霜戴，炉因试火开。时时还有客，终不当君来。\n\n【西还寿安路西歇马】白居易\n槐阴歇鞍马，柳絮惹衣巾。日晚独归路，春深多思人。\n去家才百里，为客只三旬。已念纱窗下，应生宝瑟尘。\n\n【梦得得新诗】白居易\n池上今宵风月凉，闲教少乐理霓裳。\n集仙殿里新词到，便播笙歌作乐章。\n\n【夜题玉泉】白居易\n遇客多言爱山水，逢僧尽道厌嚣尘。\n玉泉潭畔松间宿，要且经年无一人。\n\n【赠郑尹】白居易\n府池东北旧亭台，久别长思醉一回。\n但请主人空扫地，自携杯酒管弦来。\n\n【狐泉店前作】白居易\n野狐泉上柳花飞，逐水东流便不归。\n花水悠悠两无意，因风吹落偶相依。\n\n【与裴华州同过敷水戏赠】白居易\n使君五马且踟蹰，马上能听绝句无。\n每过桑间试留意，何妨后代有罗敷。\n\n【和柳公权登齐云楼】白居易\n楼外春晴百鸟鸣，楼中春酒美人倾。路旁花日添衣色，\n云里天风散珮声。向此高吟谁得意，偶来闲客独多情。\n佳时莫起兴亡恨，游乐今逢四海清。\n\n【灵岩寺】白居易\n馆娃宫畔千年寺，水阔云多客到稀。\n闻说春来更惆怅，百花深处一僧归。\n\n【寄韬光禅师】白居易\n一山门作两山门，两寺原从一寺分。东涧水流西涧水，\n南山云起北山云。前台花发后台见，上界钟声下界闻。\n遥想吾师行道处，天香桂子落纷纷。\n\n【曲江】白居易\n细草岸西东，酒旗摇水风。楼台在花杪，鸥鹭下烟中。\n翠幄晴相接，芳洲夜暂空。何人赏秋景，兴与此时同。\n\n【寒食日过枣团店】白居易\n寒食枣团店，春低杨柳枝。酒香留客住，莺语和人诗。\n困立攀花久，慵行上马迟。若为将此意，前字与僧期。\n\n【惜花】白居易\n可怜夭艳正当时，刚被狂风一夜吹。\n今日流莺来旧处，百般言语泥空枝。\n\n【宿诚禅师山房题赠】白居易\n不出孤峰上，人间四十秋。视身如传舍，阅世任东流。\n法为因缘立，心从次第修。中宵问真偈，有住是吾忧。\n\n【南池】白居易\n萧条微雨绝，荒岸抱清源。入舫山侵塞，分泉道接村。\n秋声依树色，月影在蒲根。淹泊方难遂，他宵关梦魂。\n\n【翻经台（见咸淳临安志）】白居易\n一会灵山犹未散，重翻贝叶有来由。\n是名精进才开眼，岩石无端亦点头。\n\n【一字至七字诗（赋得诗）】白居易\n诗。绮美，瑰奇。明月夜，落花时。能助欢笑，亦伤别离。\n调清金石怨，吟苦鬼神悲。天下只应我爱，世间唯有君知。\n自从都尉别苏句，便到司空送白辞。\n\n【和裴相公傍水闲行绝句】白居易\n行寻春水坐看山，早出中书晚未还。\n为报野僧岩客道，偷闲气味胜长闲。\n\n.\n.\n【秋霖即事联句三十韵】白居易\n萧索穷秋月，苍茫苦雨天。泄云生栋上，行潦入庭前。--白居易\n苔色侵三径，波声想五弦。井蛙争入户，辙鲋乱归泉。--王起\n高霤愁晨坐，空阶惊夜眠。鹤鸣犹未已，蚁穴亦频迁。--刘禹锡\n散漫疏还密，空濛断复连。竹沾青玉润，荷滴白珠圆。--白居易\n地湿灰蛾灭，池添水马怜。有苗沾霢霂，无月弄潺湲。--王起\n篱菊潜开秀，园蔬已罢鲜。断行随雁翅，孤啸耸鸢肩。--刘禹锡\n桥柱黏黄菌，墙衣点绿钱。草荒行药路，沙泛钓鱼船。--白居易\n长者车犹阻，高人榻且悬。金乌何日见，玉爵几时传。--王起\n近井桐先落，当檐石欲穿。趋风诚有恋，披雾邈无缘。--刘禹锡\n廪米陈生醭，庖薪湿起烟。鸣鸡潜报晓，急景暗凋年。--白居易\n盖洒高松上，丝繁细柳边。拂丛时起蝶，堕叶乍惊蝉。--王起\n巾角皆争垫，裙裾别似湔。人多蒙翠被，马尽著连乾。--刘禹锡\n好客无来者，贫家但悄然。湿泥印鹤迹，漏壁络蜗涎。--白居易\n蚊聚雷侵室，鸥翻浪满川。上楼愁幂幂，绕舍厌溅溅。--王起\n律候今秋矣，欢娱久旷焉。但令高兴在，晴后奉周旋。知--刘禹锡\n【会昌春连宴即事】白居易\n元年寒食日，上巳暮春天。鸡黍三家会，莺花二节连。--白居易\n光风初澹荡，美景渐暄妍。簪组兰亭上，车舆曲水边。--刘禹锡\n松声添奏乐，草色助铺筵。雀舫宜闲泛，螺杯任漫传。--王起\n园蔬香带露，厨柳暗藏烟。丽句轻珠玉，清谈胜管弦。--白居易\n陌喧金距斗，树动彩绳悬。姹女妆梳艳，游童衣服鲜。--刘禹锡\n圃香知种蕙，池暖忆开莲。怪石云疑触，夭桃火欲然。--王起\n正欢唯恐散，虽醉未思眠。啸傲人间世，追随地上仙。--白居易\n燕来双涎涎，雁去累翩翩。行乐真吾事，寻芳独我先。--刘禹锡\n滞周惭太史，入洛继先贤。昔恨多分手，今欢谬比肩。--王起\n病犹陪宴饮，老更奉周旋。望重青云客，情深白首年。--白居易\n遍尝珍馔后，许入画堂前。舞袖翻红炬，歌鬟插宝蝉。--刘禹锡\n断金多感激，倚玉贵迁延。说史吞颜注，论诗笑郑笺。--王起\n松筠寒不变，胶漆冷弥坚。兴伴王寻戴，荣同隗在燕。--白居易\n掷卢夸使气，刻烛斗成篇。实艺皆三捷，虚名愧六联。--刘禹锡\n兴阑犹举白，话静每思玄。更说归时好，亭亭月正圆。知--王起\n【城西别元九】白居易\n城西三月三十日，别友辞春两恨多。\n帝里却归犹寂寞，通州独去又如何。\n\n【游小洞庭】白居易\n湖山上头别有湖，芰荷香气占仙都。夜含星斗分乾象，\n晓映雷云作画图。风动绿蘋天上浪，鸟栖寒照月中乌。\n若非神物多灵迹，争得长年冬不枯。\n\n【花非花】白居易\n花非花，雾非雾。夜半来，天明去。来如春梦不多时，\n去似朝云无觅处。\n\n【如梦令】白居易\n前度小花静院，不比寻常时见。见了又还休，\n愁却等闲分散。肠断，肠断，记取钗横鬓乱。\n\n落月西窗惊起，好个匆匆些子。鬒鬓亸轻松，\n凝了一双秋水。告你，告你，休向人间整理。\n\n频日雅欢幽会，打得来来越z4。说著暂分飞，\n蹙损一双眉黛。无奈，无奈，两个心儿总待。"
		},
		{
			"post_id": 8,
			"title": "白行简的诗",
			"date_published": 1610702158.998,
			"body": "【春从何处来】白行简\n欲识春生处，先从木德来。入门潜报柳，度岭暗惊梅。\n透雪寒光散，消冰水镜开。晓迎郊骑发，夜逐斗杓回。\n淑气空中变，新声雨后催。偏宜资律吕，应是候阳台。\n\n【金在熔】白行简\n巨橐方熔物，洪炉欲范金。紫光看渐发，赤气望逾深。\n焰热晴云变，烟浮昼景阴。坚刚由我性，鼓铸任君心。\n踊跃徒标异，沈潜自可钦。何当得成器，待叩向知音。\n\n【夫子鼓琴得其人】白行简\n宣父穷玄奥，师襄授素琴。稍殊流水引，全辨圣人心。\n慕德声逾感，怀人意自深。泠泠传妙手，摵摵振空林。\n促调清风至，操弦白日沈。曲终情不尽，千古仰知音。"
		},
		{
			"post_id": 7,
			"title": "题贾岛墓",
			"date_published": 1610528142.264,
			"body": "倚恃才难继，昂藏貌不恭。骑驴冲大尹，夺卷忤宣宗。\n驰誉超先辈，居官下我侬。司仓旧曹署，一见一心忡。"
		},
		{
			"post_id": 6,
			"title": "题杨少卿书后",
			"date_published": 1610513619.542,
			"body": "端溪石砚宣城管，王屋松烟紫兔毫。\n更得孤卿老书札，人间无此五般高。"
		},
		{
			"post_id": 5,
			"title": "照抄别人的留个资料",
			"date_published": 1610499134.924,
			"body": "### 很多新人可能不知道的ZeroNet几个小技巧\n\n1.  如何注册、发帖：在能够发帖、回帖的地方点击`登录`（或者英文`Sign in as..`）在弹出框内点击`zeroid.bit Register »`，然后点击`获取认证证书`，填入你想要的用户名后点`发送请求`注册（如果显示红色`taken`说明该帐号已被抢注，出现绿色`ok`点击`发送请求`才有效）。提示出错信息可能是注册人数太多注册服务器保护机制启动，请稍后再试。如持续报错，请尝试翻墙注册，或者用比特信注册（这个zeroid.bit是中心化的，但是可以克隆出N个ID站，实现去中心化，详见[ID原理](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1958F7oCppj78MP966AfojMQwHg2WUupzq/1484953080)）。默认注册**_【不】_**匿名，想要匿名请看下文`匿名设置和相关知识`\n2.  鼠标移到自己的帖子/博文/标题的上方，左边出现铅笔的图标，点击铅笔图标以后能够编辑帖子/博文/标题，还可以删除帖子/博文。编辑的时候页面下方有个问号，点击它会出现markdown格式的帮助信息（有关markdown更详细的用法看[这里](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:6_1Q7UWk3im88kJkzmhzfD5q44rQDXLatxYq)、[这里](http://127.0.0.1:43110/cryptonbits.bit/?Post:6:Zeronet+Markdown+Cheatsheet)和[这里](http://127.0.0.1:43110/148or6yKMeNV4qdmKyCtpaNiFAeU1cccCw/?Post:10:%D0%BF%D0%BE%D0%B4%D1%81%D0%BA%D0%B0%D0%B7%D0%BA%D0%B0+%D0%B4%D0%BB%D1%8F+Markdown)），能够很简单地写出像本文那样排版~~优美~~的帖子/博文（本文markdown源码在[这里](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ_12)，欢迎参考、传播）\n3.  **社交功能ZeroMe**：\n    *   首先确保你的ZeroNet是0.4.0以上版本（[升级方法](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:10_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)），ZeroMe入口在 ZeroHello首页左侧栏下部的\"More sites\" 里，或者直接点击[这里](http://127.0.0.1:43110/Me.ZeroNetwork.bit)，点击后一会儿在右上角会出现一个提示，点 `Grant`，又过一会儿同样位置点`Add`\n    *   然后就可以在里面点`+`关注别人（不需要帐号即匿名关注），发帖需要ZeroID帐号，并且需要点`Create new profile`创建用户资料，最后选择一个Hub，点击`Join`正式生成发布（如果没有`Join`就先点`Download`）。注意：创建用户资料后要重新关注那些之前匿名关注过的人（点击页首左上角logo回到首页，可看到信息流，右边栏的`新用户`里有个`浏览全部 ›`里面能看到所有用户）。\n    *   点击`评论`或`回复` 回帖，按回车发送。改自己简介时如删不掉原文字可以Ctrl+A全选后直接打字覆盖，点`Save`保存。\n    *   在[ZeroMe首页](http://127.0.0.1:43110/Me.ZeroNetwork.bit)，右上角有三个点，点击以后出现`关注用户名提醒`和`关注你的帖子评论`，点击打勾后，可以在ZeroHello首页Newsfeed看到别人@你和回复你帖子的提醒。（关于Newsfeed介绍见下文的“关注”功能一节）\n    *   [http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Create+profile](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Create+profile) 这个地址是**从未创建过用户资料的**ZeroMe新用户才点的！老用户千万不要点里面的`Join`！！有些用户信息混乱被覆盖，就是因为乱点！\n    *   ZeroMe**老用户**换电脑登录方法：一般会自动登录，如果没有自动登录，可以点`Select user to post new content`，选择自己的ZeroID，**然后千万不要点`Create new profile`创建新账户**，而应等待进度条走完，然后按F5刷新就已登录了。\n    *   无论你的账户托管在哪个hub，只要你Download了其他hub（浏览其他hub上托管的信息时有个Download按钮），你就能在ZeroMe的时间线看到其他hub的帖子，follow其他hub的用户，跟其他hub用户互动留言，没有任何影响。ZeroMe（merger site特性）本身就是这样设计的。**不要试图加入（Join）多个hub，否则会引起自己信息混乱被覆盖。**\n    *   ZeroMe原生的发图功能：首先确保你的ZeroNet是0.5以上版本（[升级方法](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:10_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)），在发推框右侧有个按钮，点击后可以选择图片发送。鼠标移到在别人发的图片右下角，点击后勾选`帮助分发这个用户的新图片` 可以帮助该发图用户做种全部图片。\n    *   如果使用一段时间后，关注别人、评论以及发布信息时弹出“内容签名失败”/\"Sign failed: Invalid content\"，很可能是超限额了，具体请看[这里](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/1480422387)\n    *   其他问题在[ZeroMe讨论专贴](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:44_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ)里集中讨论\n4.  每个页面的右上角有个0图标，用鼠标按住它，向左拖拽，就会出现很多关于该页面的很多信息，还能做很多设置，还不赶快试一下！（这玩意儿有几种叫法：隐藏菜单hidden menu、侧边栏sidebar）\n5.  在ZeroID注册好帐号后，记得在ZeroMail里点Create my mailbox，否则别人不能给你发加密邮件。\n6.  [ZeroHello首页](http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D)有个搜索框（搜索框出现的前提是你已经“关注”过某网站，“关注”功能见下文），可以搜索【已访问过的】网站里的内容，请善用搜索来找到自己所需信息。【站内搜索功能】：可以指定搜索某站，如在搜索框键入`零网 site:new gfw talk`（new gfw talk是本站完整站名，注意不要多写、少写空格。）\n7.  ZeroNet上有哪些站？请看[0cnguide中文导航](http://127.0.0.1:43110/0cnguide.bit)、[0Net123中文导航](http://127.0.0.1:43110/0net123.bit)和[ZeroNet站点集合 & 搜索引擎](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:2_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/ZeroNet)\n8.  “关注”功能（加好友、互粉）：网站如果有`关注`或`Follow`字样的按钮，点击后会弹出一个菜单，默认情况帖子/博文/Posts是打勾的，就是已经关注了这个站的帖子。再次点击按钮，点击菜单里的评论/Comments，同时关注帖子/博文的评论、回复。关注以后，就会在你的ZeroHello首页的Newsfeed里看到你关注的内容更新。进版块后还要点“关注”，你才能信息流收到该版块的新帖。取消关注就是以上的逆操作。图示看[这里](http://127.0.0.1:43110/zeroblog.bit/?Post:66:How+to+find+people,+add+friends+)\n9.  **创建**自己博客/论坛/...的**超简单**方法见**[【建站教程（包括深入配置教程）】](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:18_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)**\n10.  备份你的ZeroNet帐号/私钥：ZeroNet\\data\\users.json这个文件相当于你的比特币钱包，这个文件丢失/损坏而你又没备份的话，你就无法操作你的帐号/网站了。所以把这个文件备份出来很重要。恢复/重新安装/迁移/跨设备使用ZeroNet只需把这个文件放到原位覆盖，方法是退出ZeroNet后台程序（托盘区**0**图标上点右键，选择`Quit`）再覆盖，覆盖完以后再启动ZeroNet。**_注意：一定要等到各网站数据全部同步完成再发帖，否则你会对空数据/旧数据签名发布到全网，导致你的数据丢失！_**如果还是显示未登录，请重走第1节里如何注册的步骤，但是在最后一步之前会显示 `授权为 ...` 就是已登录，可以到论坛发帖了）\n11.  升级ZeroNet的方法见[这里](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:10_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)\n12.  代理设置方法（只支持SOCKS5代理）：添加参数`--tor disable --proxy 127.0.0.1:8788 --disable_udp`（禁用走tor才能设置其他代理，8788是Lantern的SOCKS5端口，用其他代理的话请自行设置端口号）来启动ZeroNet，添加方法见下文`匿名相关`一节里的`使用运行参数自动打开Tor always模式`（如果你想设置Tor为代理，也请看那一节）\n13.  **匿名**相关：是否有需要匿名，要看你发布什么东西，请看**[【匿名设置和相关知识】](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:17_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/ZeroNet)**\n14.  想帮助ZeroNet发展的朋友，请考虑捐款给ZeroNet作者（不是捐给我），谢谢！捐款中文说明见[这里](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:21_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/+ZeroNet)\n\n[这里有个很完整的中文FAQ](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:37_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ)，收集了大量常见问题，请务必移步去看。\n如果本文以及所链接的资源还不能帮到你，你可以参考[中文版的ZeroWiki](http://127.0.0.1:43110/1NCezLP8aXjABVreBB1CKGPub2tKTtyhWU/?Page:map)，并且你可以参与编辑。\n\n* * *\n\nChange log:\n（本文之前的存档和Change log在[这里](http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?user_p2p@zeroid.bit)）\n4/20 增加”阅读更多“设置方法在`建站教程（包括深入配置教程）`\n4/21 增加clone博客的动画，域名免费注册服务及设置方法，论坛置顶和版块设置在`建站教程（包括深入配置教程）`\n4/24 增加中文博客列表\n4/25 增加中文版的ZeroWiki链接\n4/26 增加“zeronet直接走tor browser的tor的方法“在`匿名设置和相关知识`\n5/14 增加搜索功能介绍，FAQ链接\n6/1 增加注册ID方法、利用主私钥恢复网站私钥的方法、域名币基础知识在`建站教程（包括深入配置教程）`，注明“关注”后首页才出现搜索框\n6/10 增加设置启动参数的另一种方法（各种操作系统通用）在`匿名设置和相关知识`\n6/23 增加注册并绑定.bit域名图文教程在`建站教程（包括深入配置教程）`\n8/11 增加社交功能ZeroMe介绍\n8/18 补充社交功能ZeroMe介绍\n8/27 补充移机恢复帐号的方法\n11/10增加ZeroMe原生的发图功能介绍\n2017/2/28 增加0cnguide中文导航\n3/9 增加`一定要等到各网站数据全部同步完成再发帖，否则你会对空数据/旧数据签名发布到全网，导致你的数据丢失`的提醒\n4/15 增加“内容签名失败”的解决方法\n2018/1/27 增加站内搜索功能的介绍"
		},
		{
			"post_id": 4,
			"title": "又是新的一天开始了，来看看有什么变化没有",
			"date_published": 1610436430.869,
			"body": "不知道干嘛，我这是第二次安装了，第一次的软件顶部老显示用户，这个不显示，也高不明白，"
		},
		{
			"post_id": 3,
			"title": "昨天刚建设的网站，今天就不能发布资料了，老提示输入密匙",
			"date_published": 1610434698.668,
			"body": "昨天刚建设的网站，今天就不能发布资料了，老提示输入密匙，我文件重新安装了，是不是和首页一个等咯状态我退出有关。"
		},
		{
			"post_id": 2,
			"title": "跨越国界与你恋爱",
			"date_published": 1610428456.622,
			"body": "【跨越国界与你恋爱】\n\n我们只爱在那昏黄的路灯下散步，如果月光是清冷的那就更美妙些。背影被灯光拉得长长的，斜了，只是背影很快重叠；你笑着说\n　　“看，我的影子比你的好看”\n　　是的，你一直是美丽的。美丽包括了你的外表，还有你的内涵。秋起梧桐叶落，我知道此时你会和我一样同样怀念着每一片飘落的黄叶。身为女子，我们都具有与生俱来的温柔，曼妙和暗藏心底的坚强。\n\n　　Ich bin dein ,du bist mein\n　　Du bist mein ,ich bin dein\n　　Dessen sollsst du gewiss sein\n　　Du bist geschlossen in meinen Herzen\n　　Verloren ist des Schluessel lein\n　　Du musst immer frinnen sein\n\n　　你最爱在梧桐树下对我读这首诗歌，开始，我不懂；你用你的肢体语言告诉了我，我才知道诗歌蕴涵的美妙。。。。。。\n\n　　《一》\n\n　　落叶时节，你站在街头，你是焦急的；我觉得我应该帮助你，于是我上前，操着半生熟的英语问你，\n　　“你怎么了？”\n　　你滔滔不绝的一习话，让我如坠雾里。我着急的摇着手，要你慢慢的说，结果你一个单词，一个单词的说，然后我恍然大悟！我笑起来说\n　　“没问题，你跟我走”\n\n　　你乖乖的跟着我走，结果我们去的是同一个地方；不同的是，你是学校新聘请的外籍老师，而我，巧不巧成为你的小兵。我觉得你对我的好感来自于我不畏惧蹩脚的英语居然可以把你带到目的地，而我对你的好感就是在你向我投来的那一丝焦急的目光。于是，我们认识了；也于是，在校园里多次的遇见，你都会停下脚步和我打招呼，而我呢？呵呵，操着蹩脚的英语与德语和你侃起来，通常你都不知所云。我很伤心的走了，你马上跑到我面前，给我一个微笑\n　　“你说的我不完全懂，如果你写下来我就可以明白”\n　　聪明的你知道我的笔上工夫比嘴皮子工夫要深厚，于是乎，我们的交流动手，也动口。\n\n　　你说你不知道什么是卡拉OK，一个烟雨蒙蒙的下午，我把你带到“好乐迪”，你很好奇的看着，问我\n　　“卡拉OK在哪里？”\n　　“就在这”\n　　我要解释，可是你越来越迷糊，我只好拿着话筒吼起来，一曲结束，你高兴的鼓掌，几乎要把我当作你的偶像。你选了很久，选到了一首歌，恰恰也是我最喜欢的《Take my breathe away》，你先是怯怯的小声的唱着，我鼓励的眼神投向你，结果，你是我的偶像。入夜，我问你还想尝试什么？你说你要吃火锅。我想了很久，于是把你带到石门一路，看着那小吃，你跃跃欲试，然后你问我\n　　“什么最好吃？”\n　　“你可以每天吃一样”\n　　我简单的答到，你没吃火锅，我倒为自己找来麻烦。那段时间，只要你有空，你就拉着我到石门一路去，你屁颠屁颠的，而我苦不堪言，因为我坐车是容易晕车的。但是为了中德友谊不受影响，我只能牺牲自己了，换来了你—这个漂亮的德国公民对我说的一句话\n　　“你是一个好人”\n\n　　学校里周末都会放原声的电影，你开始拉着我一起去，通常我不知道说什么。你慢慢的给我解释，笨头笨脑的我一般只能明白一点点，你一着急，源源不断的语言从你嘴里吐出来，我很伤心很难过。电影结束后，你无可奈何的说\n　　“我跟你学中文吧”\n　　我一听，乐了！连忙点头。不过才发现是个善意的圈套，为了教你中文，每次我都得抱着厚厚的一本《德汉字典》和一本《英汉字典》。说不通的时候，看到你迷茫的眼神，我着急的走来走去，恨不得一头撞死在梧桐树下。\n\n　　我不知道我们的情絮生于何时？但那一次肯定是起了一个巨大的推动作用。那天下午，我在小花园教你中文，聊到中国的习俗，这时，你突然问了我\n　　“什么是缘分？”\n　　我马上翻开字典，不巧，没这个词的解释，中国文化博大精深，小小的字典无法包容，我尝试着找到正确的解释，可是很快的连我自己也开始迷糊起来。我说我需要休息一会，过后，我慢慢的说\n　　“一个男人，和一个女人认识了，这是缘”\n　　你好奇的点头\n　　“然后她们在一起了，就是缘分”\n　　你皱皱眉头\n　　“那分开了呢？”\n　　“那就不是缘分了”\n　　“那是什么？”\n　　我又开始头疼，想想，又重新说\n　　“再给你一个例子。缘，是因；份，是果”\n　　结果你更不明白，头脑更迷乱，我继续思考，接着努力\n　　“缘分，缘分。。。就是，，，是什么呢？”\n　　我几乎要哭起来了。过了好久，估计你是参悟到一些小道理，于是你看着我说\n　　“我和你认识了，是缘，对吗？”\n　　我欣喜的连忙点头，你终于开窍了！\n　　“如果我们相爱在一起了，是分，对吗？”\n　　我愣了一愣，其实这个解释也是对的，可是又不对。我踌躇着，想要给一个更合理的解释给你，你又问\n　　“对吗？”\n　　我看着你，突然发现你褐色的眼睛里多了一层色彩，亮亮的，浓浓的；我的心忽然的停顿了，隔了好几秒钟，我才能够又继续呼吸了。你明亮美丽的眼睛在看着我，轮廓分明的面容有些红色，沉默中，你在等待我。我突然笑起来，轻轻的说\n　　“是的，我们认识是缘，相爱在一起就是分了”\n　　刹那间，你闭上了眼睛，睫毛在微微颤动，忽然你睁开眼睛，操着纯正的汉语对我说\n　　“谢谢你的回答”\n　　你的手搁在石桌上，我斗胆轻轻握着它，一阵奇妙的感觉传遍我的身体，我的血液充沛，毛孔膨胀，你伸出手指，擦去我鼻尖的汗，笑起来\n　　“不要太紧张，OK？”\n　　我傻忽忽的直笑。\n\n　　《二》\n\n　　我不知道算不算是相爱了？我们的眼神在空间里传递着爱情的讯号，在教室里，在小道上。只要有你的地方，哪怕人再多的时候，我时常可以感觉到一种温柔如水的眼神射向我，我通体舒畅，我一回头，调皮的眨眨眼睛，你在远处笑了。上课的时候，你会让我上去写黑板，高高的讲台正好遮住你，于是我借着机会，手会轻轻的碰碰你，你会意的笑笑；做练习的时候，你会在我身边停留很长时间，垂下的发丝扫着我的耳朵，痒痒的，也怪舒服的，还可以闻着你身上的香水味道；如果你再低一点，我伸伸脖子就可以看到你完美的胸部。你秉承了德国人的一贯作风，天冷的时候你里面也只是一件低领的小毛衣，把你美妙的身材暴露无疑，惹得多少人会鼻血直往下淌。。。我的心里却很不高兴，你的心是我的，身体当然也是我的。\n\n　　于是，为了你的着装问题，在你的公寓里，我对你发了第一次脾气。\n　　“你能不能稍微多穿点？”\n　　“为什么？”\n　　“你的身材太好了，太多人注意你的身体”\n　　“身体本来就是要展现给大众的呀”\n　　我开始生气，在你房里走来，走去，突然吼了一声\n　　“我不喜欢你穿那么少！”\n　　“你因为这个和我生气了？”\n　　你脸上一层的忧伤，我连忙握着你的手，慢慢的说\n　　“我是东方人，对不对？”\n　　“是的”\n　　“东方人的观点，你的心是我的，身体也是我的了。。。我不希望让别人也来分享你的身体”\n　　你红了脸，转而聪明的问我\n　　“东方人真是这样想的吗？”\n　　我连忙点头，管它对不对，先骗你穿上衣服再说。你很听话的，之后不再穿着那些紧身的小毛衣，取代的是宽松的T-恤，虽然还是让人想入非非，但是也好了很多，谁让你的身材那么完美？我站出去，都没人看。。。\n\n　　跨越种族的恋爱有许多的啼笑皆非。第一次带你吃火锅，我问你\n　　“你吃什么？”\n　　“我不清楚，你做主”\n　　我的心开始自大的膨胀。于是点了一个鸳鸯锅，还有些菜：豆腐，猪脑，猪肝，腰子，麻雀，羊肉，2份青菜。当你看到红油油的火锅，吓呆了，我连忙安慰你\n　　“别怕，纯天然的，不是颜料”\n　　你小心翼翼的拿着筷子，蘸了蘸辣的火锅，立刻眼泪四射，吸引了众多的目光。我有些尴尬，连忙说\n　　“你吃另一边好了，不辣”\n　　“不行，我要征服它”\n　　日尔曼民族的坚忍不拔的性格在你身上得到了充分的体现，你流着泪吃起了火锅。你看到猪脑，眼睛瞪大了；看到腰子，你已经难以置信了。我笑笑，瓦着一小勺猪脑，烫了烫放在你碗里，\n　　“吃吧，中国的美食哦”\n　　你一吃，就说是豆腐，连真正的豆腐都不吃，只吃那盘猪脑。我放下一个小麻雀，你惊呼\n　　“我的上帝！你怎么可以吃它？”\n　　“为什么不能吃，很好吃的”\n　　结果你边画着十字架，边把麻雀往嘴里送。你用筷子还不熟练，不留神掉了一只，我笑起来，又给你拿了一只，吃完火锅，我数数，你一共掉了3只筷子，吃掉了6只小麻雀，一盘猪脑，还有半大盘的腰子和猪肝，而我只吃了一盘豆腐，和那些青菜。回到宿舍，我还泡了面吃。\n\n　　我的生日到了，你问我喜欢什么？我说只要是你送的我都喜欢，结果那天晚上你斩了半只烤鸭送给我，很开心的说\n　　“北京烤鸭，我想你一定喜欢”\n　　我点点头，其实是你喜欢吃烤鸭才对！然后我们两个坐在光秃秃的草地上，对着清冷的月光，吹着寒风，吃起了你所谓的北京烤鸭。不过第二天你还是送了一份正式的礼物给我，全德文版的《小王子》。\n\n　　带你到寺庙里，你来了兴趣要学别人求签。人家轻轻一摇，一根签就下来了，你也轻轻的摇，结果签全部撒了出来。你慌忙的把签放回去，继续摇，边说\n　　“哦，不不不，重新来”\n　　摇了2次，一根上上签被你摇了出来，你很高兴。高兴之余就往功德箱里放了50块钱，看得我好心疼。\n\n　　你对中国充满了好奇，所以我们一起去博物馆，从博物馆出来以后在广场地铁口有人卖仿真的古董，结果你买了很多，我知道旁边的人肯定在笑\n　　“两个傻子”\n　　我低着头，和你一起拎着你的宝贝回家。\n\n　　你说你要学做中国菜，于是我陪着你到超市采购，还买了一大堆的菜谱。然后回到家，你把我按在沙发上\n　　“你坐着，今天我给你做好吃的”\n　　我连忙点头。等了好几个小时，等到我把你的380克的巧克力和450克的曲奇全吃完，你欢喜的跑进来说\n　　“可以吃了”\n　　我坐在饭桌前，说实话，开始倒胃口。不过为了不扫兴，我还是很高兴的吃着你做的“糖醋排骨”，“番茄炒鸡蛋”，“青椒土豆“。可是我实在难以忍受了，看着我的痛苦，你难过的趴在桌上”呜呜“的哭起来，吓得我风卷残云的扫完了菜，你宛然一笑\n　　“不浪费，真好”\n　　我几乎要跌倒！原来你是捉弄我，害怕一桌子菜被扔到垃圾筒里，才假装哭泣。。。骗我的同情心。我生气了，黑着脸不说话，你坐在我旁边，怯怯的拉拉我的手\n　　“别生气，好么？我知道我错了，以后我做得好吃一点”\n　　我摇摇头不说话。你害怕我生气，轻轻的吻了我，我一呆，缓缓的看着你，你轻轻的说\n　　“要怎样你才不生气？”\n　　“那你再亲我一下”\n　　我大笑！\n\n《三》\n\n　　我们第一次到衡山路，那晚一张小黄叶飘到你肩膀上，你捏着它，对我念了一首诗\n　　Ich bin dein ,du bist mein\n　　Du bist mein ,ich bin dein\n　　Dessen sollsst du gewiss sein\n　　Du bist geschlossen in meinen Herzen\n　　Verloren ist des Schluessel lein\n　　Du musst immer frinnen sein\n\n　　我问是什么意思，你含羞不语。大半年的熏染，你也染上了东方女子的含蓄了。我还是问，你把手指放在嘴边轻轻一吻，然后很快按在我嘴唇上，轻轻的说\n　　“就是这个意思”\n\n　　我读懂了你眼里的温柔和浓情。那天晚上，我第一次问了你\n　　“你爱我吗？”\n　　“是的，我爱你”\n　　“为什么？”\n　　“因为我爱你”\n　　我感动，牵过你的手，你反问到\n　　“你不害怕我们年龄的距离么？”\n　　“你害怕么？”\n　　“我面对”\n　　“我也一样”\n　　我笑笑，把你的手紧紧的拽住。是的，我没有任何疑虑的爱上了你，跨越了时间，国界，种族。你美丽善良，你爱得真切，自然，丝毫不因为我比你小8岁而有所迟疑；你为了我逐渐的改变你自己。而我，纯真的象个孩子，尽管我不是孩子；我也善良，也爱得勇敢；为了你，我不断学习怎样去爱一个人。。。。以后，只要我们在昏黄的路灯下散步，你都会对着我读这首诗，再后来，变成我读给你听了。\n\n　　我们没有过激烈的争吵，从来没有过。只会是有时因为生活习惯，思考的方式不能融合而产生小矛盾。还记得那次吗？我在你面前杀鱼，你生气，说我不顾及生物的感受，我随口说\n　　“它哪懂什么呀，吃到肚子里就完了，顾及那么多？”\n　　“不，鱼也会思考，也有生命”\n　　“那你不吃鱼？”\n　　“我建议，如果你要结束它的生命，请用一种温和的方式，可以吗？”\n　　我无语，从那以后在你面前我不再吃鱼。\n\n　　春节我要回家，你偷偷的给我定了机票，你心疼我要坐火车，你担心我的安全。在把我送到机场，你倒哭了起来，你问我\n　　“你会快些回来吗？”\n　　“会的，你等我”\n　　结果，我初四就飞回了上海。看到我，你很兴奋，我们一起去了周庄。在周庄的第一天晚上，我们都把持不住，结果你教会了我怎么做爱。你倒是哭了起来，我急忙安慰你，你说\n　　“我想你会恨我的”\n　　“不会，为什么恨你？”\n　　“你们中国不是最在乎女人是不是处女的吗？现在。。。”\n　　“没关系，我不在乎”\n　　然后如鱼得水般的快乐。从周庄回来，你更加珍惜，心疼我。我们的关系，有爱情，也有了亲情。你给我买了一只手机，每个月都帮我缴费。你交代我，无论上哪里都要先和你说，害怕万一有什么。比如晚上坐出租前，要把出租车号码报给你；每天晚上临睡前给你报个晚安。。。我一一照做，其实上海很安全，倒是你经常迷路。\n\n　　很快，你的工作期限到了，要回到德国，为了我，你重新申请工作，终于拿到了二年的期限。那天我和你都很开心，我们一起逛了书城。你喜欢拉我到福州路，你喜欢给我买不同的书，因为你要我多接受知识。照旧，那天你又给我选了一大堆的书，付款后，我突然不开心，你捕捉到我的不快，就问我\n　　“你怎么了？”\n　　“我。。。。。以后，你别帮我付款好么？”\n　　“怎么？有区别么？”\n　　我难过的点点头\n　　“亲爱的，你的自尊在做怪了。和我在一起，你不需要顾及这个，我的报酬是大学老师的3倍，我完全有能力去支付，而且，你只是个学生，对吗？”\n　　我点头，你握握我的手，笑笑，什么事情也没有了。感觉到我对音乐和美术有兴趣，你把我送去学美术，和弹吉他。你说\n　　“你不一定要学得很好，只是做为一种兴趣，它可以培养你的气质，对你是有帮助的”\n　　只要有空，你就陪着我去学美术和音乐。大剧院有合适的演出，你就会买了票拉着我一起去。你的爱好如此广泛：大提琴，长笛，钢琴，美术，雕刻，摄影，而且都很精通，让我很崇拜哦。。。。不过你有一样不如我，你做菜的水平实在不敢恭维！你做鱼不放酒，姜，蒜，淋上一层的奶酪，然后放在微波炉转3分钟，就拿出来吃了。你说这样的鱼营养最好，结果你自己都不吃。自那以后，做菜都是我的工作。。。。。。。\n\n　　你问我\n　　“暑假和我一起到德国好么？”\n　　两天后我回答你说不好，你问\n　　“为什么？”\n　　“我。。。。。我。。。。”\n　　我老妈担心我被人拐，所以死活不同意我去德国玩，我怎么能把她的话原本的告诉你呢？那样你会非常伤心的。\n　　“是不是你家里人不让你去？”\n　　“不是，我想等我工作了以后，自己有钱了再去”\n　　我只好找了一个借口，你笑起来、\n　　“亲爱的，我知道你的自尊又作怪了”\n　　天啊，我什么时候自尊心又做怪了？你安慰我那渺小的，古怪的自尊，诶！后来你做的担保，在考试结束一星期后，我被你带到了那美丽的德国。\n\n　　《四》\n\n　　在WUERZBURG，我见到了你和蔼的父母，友善的兄弟姐妹。我给你的父母带去了上海的五香豆，豆腐干，和酒，好多小吃，还有两个大灯笼和一个很大的中国结，你的父母太高兴了，吻得我头晕。你姐姐的手艺比你的好多了，我喜欢她弄的香肠。德国的香肠真不错，那么大的一根，别有滋味；还有那个咸猪手，才棒呢！挑食的我居然吃下一个！你姐姐很开心的，结果走的时候买了一小箱的香肠给我带回上海。看到我开心，你也很开心，第二个晚上你告诉我一件事\n　　“亲爱的，我家里人都知道我是LESBIAN”\n　　“啊！！！！！！！！！！！！！！！！！！！！！！！！！！！！”\n　　我滚下了床，慌忙爬起来，战战兢兢的说\n　　“那，那我和你回来。。。。她们。。。都。。。”\n　　“她们是我的家人。。。爱我，当然也爱你，你不用担心”\n　　“你为什么不早说？”\n　　我哭丧着脸，后悔。\n　　“我知道你这个东方人和其他东方人不一样，念头总是古怪的，所以，我决定先斩后奏”\n　　你什么时候学的这个成语？\n　　“我什么时候古怪？“\n　　“你骗我别穿小毛衣！！“\n　　你笑着看我，我脸红。你家的人既然知道你是LESBIAN，也不用多说，我跟你回家，当然也是LESBIAN了。爱屋及屋，何况我那么可爱的一个中国女孩！你家上下都喜欢我，不，是很喜欢我，每天你的妈妈都会在我脸上“啵”的来个好几下。。。。你姐姐开车，我们去了MUENCHEN，HAMBURG，DUESSELDORF，STUTTGART，FRANKFURT，我快乐得很。你恶作剧的把我带到了天体浴场，我的乖乖咙地东。。。。我的眼珠几乎掉下来了，你立马站到我面前，娇声说\n　　“亲爱的”\n　　这下我几乎要晕，你完美的身体光溜溜的，我吓得跌坐在沙滩上，不一会，连忙把一条浴巾裹到你身上，你笑起来\n　　“不需要的。。。”\n　　无论男女，胖瘦，都是光溜溜的；身材好一点的，视野还算是饱了眼福；身材不好的，那就是。。。。那边那个胖老太，好几座大山在晃，居然还躺着晒太阳。。。我摇摇头，你一把拉过我，要脱掉我的T-恤，我死活不肯，拽着不放，我还是很含蓄，很矜持的。你最后放弃了，自己去玩了，身为含蓄的东方人，我是无论怎样也做不到光溜溜的暴露在别人眼皮底下的。搬张凳子，看着你做操，你的身体太完美，吸引了许多的目光，我一着急，连忙跑向你，把你给拉了过来，裹上毛巾，酸溜溜的说\n　　“别再做操了，快走吧”\n　　你笑起来，很听话的，然后我们走了。你说我保守，保守就保守吧。\n\n　　后来我们去了BERLIN，在凯旋门下，我激动的说\n　　“伟大的中华民族和日尔曼民族的代表相会了！”\n　　你吃吃的笑起来，在我额头上轻轻一吻，我看看左右，没人关心我，我才放心的不脸红。你在我耳边说\n　　“明年我们到HANNOVER参加LESBIAN的游行”\n　　我一屁股跌坐在地上，天啊！我的女朋友太惊人了，我的老脸往哪放啊！\n\n　　这天，你陪我到超市去选购东西，因为晚上我要做中国菜。看看超市，我不住的摇头，什么东西！肉都是剔得干干净净，我要找肥肉都找不到。鸡也是弄得一块一块的，这下做白切鸡也坐不起来了。转了很久，你突然说\n　　“我们去TUERKEY市场，那有很多东西”\n　　果真，TUERKEY市场有很多东西，很多是没加工的，我很高兴的选了很多。下午回到家，你帮我系上了围裙，做我的下手。在中国把你熏陶了很久，你终于知道土豆丝怎么切，筷子怎么拿了。在你的帮助下，一切得以顺利进行。为了表扬你，在厨房我亲吻了你，谁知道被你的妈妈无意看见了，我的上帝，我的脸比烧熟的龙虾还红，可惜你家的厨房装修的很好，连条缝都找不到，这下躲也没地方躲了。\n　　“她是有些保守和害羞的”\n　　天啊！你居然还和你妈妈介绍我。。。。。。。我一分心，切到了小拇指，疼得哇哇叫。你的妈妈赶紧到房间拿出急救箱，帮我清洗，包扎。最后我无可奈何的把你推出去\n　　“厨房重地，闲人莫入”\n\n　　晚上我的白切鸡，红烧排骨，油爆虾，紫菜汤，醋溜白菜等，博得了你家上上下下的欢心。末了，你妈妈偷偷在我耳边说\n　　“有你在ANN身边我就放心了”\n　　我头大了！真是服了你的妈妈。。。一点也不含蓄。\n\n　　一天晚上睡不着，我爬起来打开电视，乖乖，那画面也太让人喷血了！我瞪直了眼睛，屏住了呼吸，紧张的看着从未看过的画面，慢慢的，血管里好象有一只小老鼠在窜来窜去。。。你突然醒了，轻轻的抱住了我，悄悄的问\n　　“亲爱的，你睡不着么？”\n　　我脸红彤彤的，你盯着我，眼睛里是笑意\n　　“怎么了，你。。。。”\n　　我恼怒的看了一眼电视。都是它，害得我欲望蓬勃。。。。我关掉灯，扑到了你身上。你很明白，很配合的，不过第二天早上你浑身是吻痕。。。。。。。从那以后，你不让我半夜看电视了。\n\n　　在德国一个月，我体会很多，见识也长了，口语也流利了，人也胖了。你可恶的捏着我的小游泳圈笑着说\n　　“你得减肥了”\n　　我贼笑的把你扑到身下。\n\n　　知道我喜欢吃巧克力，你父母买了许多巧克力给我带回上海。放在你的冰箱里，本来我要留着慢慢吃，可是你的速度比我快多了，直到有一天我打开冰箱，我心爱的巧克力没有了！我伤心得说不出话，你解释\n　　“工作太多太多，我只好吃巧克力神”\n　　“咖啡可以提神，不是巧克力”\n　　我伤心得很。为了安慰我幼小的心灵，第二天你买了一堆的“德芙”放在冰箱，以便我打开冰箱就可以吃到巧克力，这个习惯你保持得很好。直到现在我每天都可以吃到巧克力。\n\n《五》\n\n　　我们相爱的第二年春天，你又额外的找了翻译的工作。你和我学中文有2年了，口语水平不错，文字水平差了些，所以啊，别人的中文资料都是我先看过，然后再告诉你，你再翻译，呵呵，居然也成了。那年春天，我们闹了别扭。你帮一个公司做翻译，谁知道有个男人看中了你，要追求你。每天一束花送到学校，每天电话不断，实在推不掉你也只好去赴约。那天晚上，我和同学从福州路附近，不知道怎么走的，走到 一条路上，居然看见你和那个男人酒店旁的一辆车前，那个男人还扶着你的肩膀！最后还吻了你。一时间，我醋意浓浓。旁边的同学想继续看，被我拉走了。我决定要惩罚你。\n\n　　你的电话我不接，你也不可能到我宿舍找我。几天后在校园里碰上了，我掉头就走，你追了上来，拉住我\n　　“你怎么了？”\n　　“没事”\n　　我甩开你的手，我的气还没消呢。下午下课，刚出教学楼，就发现你在等我。你叫住了我，我只好停下来。等到边上没人了，你痛苦的问我\n　　“你究竟怎么了？”\n　　“没什么。你不爱我了，我也不再打扰你”\n　　“亲爱的，你在说什么？我怎么可能不爱你？”\n　　我气冲冲的把那天看到的全告诉了你，你却笑起来，刮着我的鼻子\n　　“你妒忌了？。。。证明你很爱我”\n　　“拉倒吧”\n　　“我和他说清楚了，只是朋友。那天临别，他问我可以不可以吻我一下做为纪念，我说 可以。那么巧你就看到了。。。。”\n　　“那现在呢？”\n　　“朋友呀。亲爱的，我只想再多赚点钱，然后买套房子”\n　　“你住学校公寓好好的，买什么房子”\n　　“为你，也为我买房子呀。。。你不想我们住到一起吗？”\n　　你认真的看着我，我感动了，为错怪你而内疚。\n\n　　除了上课，你还做翻译，还做摄影记者，反正能赚钱的你都做过。你工作表现很好，你成为德国文化课的专职教授，你决定要在上海扎根了。在我们相爱的第三年，也就是我要毕业的那年夏天，你买了房子。等我毕业，落实好工作后我们一起买回了床铺，还有其他的东西。房子是大的，有两个阳台，3个房间。你说\n　　“你妈妈来就方便了”\n　　我感动。国庆，我老妈果真到上海来视察我的工作，实际就是顺便旅游。听到我妈妈要来，你很慌张，很小心。很多个晚上，你兴奋又紧张，多次摇醒我\n　　“亲爱的，你妈妈会喜欢我么？”\n　　“会的”\n　　“她保守么？”\n　　“恩，中国人都挺含蓄的，所以，你的睡衣最好换一换”\n　　的确，你的睡衣布料少的可怜，每天晚上都让我情欲澎湃；你还喜欢天体浴，没事了就把椅子搬到阳台上，脱得光溜溜的一躺。还好我们是楼顶，我也就放心一点了。\n　　“还有什么要注意的？”\n　　“不能做裸体操，不能做太阳浴，要勤快，早上要准备早餐，晚上要按时开饭”\n　　我心里偷笑，认真的你却当真了。我知道你的想法，我们是要过一辈子的 ，你也得学着取悦我老妈，不过我老妈不象你老妈那样好打发。。。嘿嘿，不同的国情照就了不同的人。把屋子打扫了，把两人的照片收了起来。。。可是我不愿意和你分床睡，因此你说\n　　“你妈妈在的时候，不许你有其他的举动”\n\n　　从机场接了我妈，你战战兢兢的上前，一鞠躬\n　　“伯母你好”\n　　把我妈给吓了一跳。一个洋人给自己鞠躬！我妈连忙扶着你，直说\n　　“不客气，不客气啊”\n\n　　回到家，你先进门，把一双拖鞋放在我妈脚下，又把我妈吓了一跳，连门都不敢进了。我笑起来，把我妈给推进去。等到她坐下，你又泡了一杯“龙井”，端到她面前，恭敬的说\n　　“伯母，喝茶”\n　　我妈吓得差点没接住杯子。趁着你不在，我妈问我\n　　“你的洋人朋友怎么那么客气？我都不知道怎么弄了”\n　　“没关系，你就受着。她都这样的”\n\n　　晚上，洗澡后我差点没笑出来。你居然穿了一套长袖长裤的睡衣！不过回到我们的房里，我很快帮你把它脱下，我也不习惯呢。\n\n　　第二天早上，你起了个早，破天荒的下楼到街对面早点摊打了一锅豆浆，还买了几个包子。以前这是我干的事情，而现在我在被窝里很舒服的睡觉。你叫醒了我妈\n　　“伯母，吃早餐了”\n　　我差点没滚下床，才6点！平时我妈不到7：30是不起床的。这下好了，6点被叫起来吃早餐。我妈迷糊的答应着，迷糊的刷牙，洗脸，坐在餐桌前还是睡眼朦胧的。\n　　“伯母，吃吧”\n　　你殷勤的把一碗豆浆和两个包子放在她老人家面前，笑笑，退到房里。看到我躲在被窝里早已笑翻，你恨恨的打了我好几下，我连忙搂着你\n　　“做中国人的媳妇都这样，你忍一忍啊”\n　　“我是说你！你偷懒！”\n\n　　7点，我们出门上班，我老妈坐着，昏昏欲睡。你真的可以算是个好媳妇了。每天早上雷打不动的6点准备好早餐，硬是把我妈的生物钟给调整了；每天晚上给她老人家500CC的牛奶，说是要补钙，老妈晚上起夜得勤快；出去吃饭，到最贵的西餐厅，我妈的刀叉差点就飞了出去。。。老妈熬不住了，找了空挡问我\n　　“明天周末，可以让我睡一睡懒觉吗？”\n　　第二天周末，你依旧要早起，我连忙把你按下了\n　　“今天周末，别弄了。。。”\n　　边说，边在你身上运动；那边的老妈呼呼大睡。等到我们10点多偃旗息鼓，她还在睡，誓有要补足一星期的睡眠的势头。。。。。\n\n　　你的表现我妈很满意，走前她对你说\n　　“有你在，我就放心了。。”\n　　“那伯母你喜欢我吗？”\n　　“当然喜欢。。。。要不，你做我干女儿行么？就怕你嫌委屈了”\n　　你马上跪下，甜甜的叫了一声\n　　“妈”\n　　嘿，把我妈乐死了，连忙摘下手上戴了十几年的银手镯挂到你手上，我都羡慕。皆大欢喜。。。。等我妈回到家，居然习惯每天6点起床，我爸的习惯也随之改变。。。。\n\n　　《六》\n\n　　我们相爱的第四个年头，我的工作有了起色，追求我的人也多了起来。我没有瞒过你的，你也很放心我。只是有一天你暗着脸回来，一句话也不说，吓的我不知道怎么办，百般安慰，你扑到我怀里轻声哭泣，我心疼得很，捧着你的脸，梨花带雨的模样，诶。。。\n　　“告诉我，怎么了？”\n　　“在中国，是不是每个人都要结婚？”\n　　“？？？谁告诉你的？”\n　　“你先回答我”\n　　“不一定，不过父母都希望孩子能有个幸福的婚姻。不过主动权在自己手里”\n　　你又哭起来，挺直的鼻尖红红的，我心疼及了，\n　　“到底怎么了？”\n　　“你会结婚么？你是不是也会要离开我？”\n　　“谁说的？”\n　　“今天几个老师在说的，说婚姻，说家庭，说一个女人哪有不结婚的？”\n　　“你为这？”\n　　我哭笑不得，擦去你的眼泪，认真，专注的看着你\n　　“亲爱的，我不会离开你，我们会一直这样的相爱，除非，你不要我了”\n　　“要的”\n　　你又哭倒在我怀里。\n\n　　我们结婚了，在我25岁，你33岁的时候生日的那天，我买了一对戒指。晚上，我轻轻问你\n　　“亲爱的，我要送给你一枚戒指，你愿意戴上它，永远不脱下么？”\n　　你点点头\n　　“愿意的”\n　　你伸出手，我把戒指套进了你的手指，你也把另一枚戒指套进了我的手指。这样，你才可以放心。。。。我的亲爱！美丽，风韵，轮廓分明，身材出众的你总是人群的焦点，在别人眼里，你是傲慢的德国人；在我面前，你是温柔的女人。自从我们认识以来，你就如此的温柔细致，我每天都在爱着你。\n\n　　算是结婚了吧！？感觉就是不一样！你也不厌其烦的学着发信息，每天我的手机几乎要爆炸！没多久你买了车，这下好了，每天早上你送我上班，你下课早，就到我公司楼下接我下班。公司里流言四起，一些劣质的中国人对一个中国女人和一个外国女人的关系是那样的好奇。这天你依旧在车里等我，我走出公司，你从车里出来，开心的朝我招手，几个公司的同事放慢了经过你身边的脚步，仔细的打量着你，你莫名其妙。后来一个周末，我们到百盛去买东西，后来坐在旁边的咖啡店里休息。真巧，公司里的几个八婆拎着大包小包也进去了，不过我们在里面，她们没看到我们。聊着聊着，我们竖起耳朵听到了关于我们的话题，如此的不堪让我怒火中烧！你按住我，不让我过去；我甩开你的手，直接走过去，那几个女人愣住了，张着嘴\n　　“说，怎么不说了？背后说人坏话被逮到的滋味不好受吧？”\n　　沉默，我气不打一处来，看着说得最起劲的那个女人\n　　“你吊了？平时和我那么热络，原来背后这副嘴脸，我看不起你”\n\n　　你走出来，把我拉走了。出去，你关切问我\n　　“你怎样？还生气么？”\n　　“不生气，我只为你一个人生气”\n　　你满足的笑起来。后来，关于我的流言也没了，你来接我，也没有好奇的眼光去打量你了。\n\n　　过了很久，有一天晚上你辗转反侧，我只好把你搬过来\n　　“怎么了？”\n　　“我在思考一件事情”\n　　“能告诉我么？”\n　　你眨眨眼睛，轻轻的说\n　　“我想离开学习”\n　　“你要走么？”\n　　我一着急掐住了你的胳膊，你笑起来，摇头\n　　“我想，自，己，开，公，司”\n　　我开始有些发呆，安静的你基本上是做学问的，我从未把你想象成商海里的一员。我清醒了一下\n　　“你决定了？你有方向了？”\n　　你点点头\n　　“那你还在思考什么？”\n　　“我在思考怎样和你说，我不知道你是否赞成”\n　　“傻瓜。你做的决定我都支持你，不过，如果不习惯不要勉强，还是可以做学问的”\n　　你很开心的抱住了我，亲吻我\n　　“亲爱的，我很高兴，有你的支持，我满足了”\n\n　　没过多久，你的文化传播公司启动了。刚开始，你踌躇满志的，辛苦你觉得是乐趣；可是没多久，一天晚上你憔悴不堪的回来，心情十分的不好，第一次狠狠挑剔着我做的菜，而且还浪费了！我知道你肯定不开心了，所以殷勤的帮你放好洗澡水；等你出来，我把牛奶端到你面前，这些事情经常是你做的。看着我跟在你屁股后转来转去，终于你良心发现，柔弱的看着我\n　　“亲爱的，抱抱我”\n　　我把你抱满怀，不一会，你噼里啪啦的发泄着你的不满和不快，还有愤怒，夹杂着德语，英语和汉语，让我来不及听清楚你就哭了起来，慌得我连忙轻拍你的肩膀，你忿忿的说\n　　“怎么可以这样？？？谈好的事情，说不做就不做，怎么会有这样的人？？？”\n　　搞了半天，我才弄清楚。原来有人和你谈好一个合作，今天上午准备签字的时候，对方突然反悔，只给了你一个电话说“很抱歉”，，下午你到对方公司，才知道对方和别家签约了。不守信用的人哪里都有，而且让人看不起，还让人愤怒。。。\n　　“别哭了，这也是一个教训。失败是成功的母亲，别太伤心”\n　　“我不是伤心我的合同没了，我是愤怒这样的行为”\n　　我无语，想想，继续安慰你\n　　“每个社会都有不好的人，你原来只是在学校，别人尊敬你是外籍老师；你现在自己出来做生意，大家都是平等的，而且你又没有什么强大的背景，所以竞争更加激烈。你能熬过去就一定能成功。如果你做得实在不开心，还是做老师吧？”\n　　“不！我要征服它”\n　　我立即想到第一次吃火锅，你流着泪征服了火锅。呵呵，你一发狠，没人能挡住你。\n　　“那就征服它”\n\n　　推倒从前，你又重新开始奋斗。你很聪明，善于运用你的资本。想想看，一个漂亮妖娆的洋女人，不时的在你面前放电，而且这桩生意也的确不错，，，嘿嘿，男人嘛。。。。你的公司开始大跃进。那段时间你非常忙碌，常常做“空中飞人”，我难得见到你。不过我们每天都有电话，你经常说\n　　“我不在的时候你要老实”\n　　“我很老实”\n　　“也是，除了我，还有谁会那么爱你呢？”\n　　我倒！不是没有MM爱我，只不过，我只爱你一个人呀。知道我第一次为了安慰一个MM而网友见面，你没生气，只是一个星期没和我说话，我贴了一星期的墙壁，以后再也不敢了。介于我有不良好的历史，你不在的时候总会千叮咛万嘱咐的，亲爱的，你是多心的。\n\n　　一次争取到了一个很大的代理权，你兴奋的跳起来，我眼眶也有些湿润。能到今日，你真的很不容易。最主要为了爱我，你一个人背井离乡的到一个陌生的国度生活了6年；为了爱我，你受了很多委屈，这里不一一道来。不过一切都在变好。。。。我张开怀抱，你扑向了我，我热烈的吻着你，因为我非常非常的爱你。\n\n　　你思量着想领养一个小孩，我连忙制止了你的念头；心有不甘的你很快抱回一只德国狗狗，现在长得象头小熊。。。。你越来越满足，越来越开心，你的魅力随着时间的流逝而更加浓郁。现在你正带着团在HANNOVER参加展览，然后还要到FRANKFURT，等你回来已经是初夏了。趁着你不在，我把我们写下来，简单一点，等你回来就可以看到，我知道你一定会更加更加更加的爱我。。。。。。\n\n－－完结－－"
		},
		{
			"post_id": 1,
			"title": "一起来读书吧",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}