{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1634884167,
			"title": "ZERO PLAY nie działa.",
			"body": "Ludzie, sporadycznie korzystam z Zeronetu od lat paru. Cyklicznie do niego wracam sprawdzić co tu słychać i jak ma się społeczność. I w ciągu każdej wizyty próbuje użyć ZeroPlay  (http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/). Nigdy mi to nie działało. Czy coś jest ze mną, czy to lipa jest z tym \"portalem\".",
			"added": 1634884166
		},
		{
			"topic_id": 1635491830,
			"title": "Humor yet again",
			"body": "Mówi lekarz do pacjenta:\n-Musi Pan przestać się masturbować. \n- Dlaczego? - Pyta zaniepokojony pacjent. \n- Bo muszę Pana zbadać.",
			"added": 1635491828
		},
		{
			"topic_id": 1636543084,
			"title": "Życie w stanie wyjatkowym.",
			"body": "Czy jest ktoś z terenów (lub zbliżonych) objętych stanem wyjątkowym? Chciałbym jakkolwiek zweryfikować informacje \"publiczne\" z naocznymi świadkami. \nNie wzgardzę też informacjami funkcjonariuszy straży granicznej WOT czy kimkolwiek z pierwszej linii.",
			"added": 1636543081
		},
		{
			"topic_id": 1637740051,
			"title": "Apel Polskiego Stowarzyszenia Niezależnych Lekarzy i Naukowców w sprawie natychmiastowego wstrzymania Narodowego Programu szczepień przeciwko Covid-19",
			"body": "17 listopada 2021 wystosowaliśmy do rządzących naszym krajem decydentów kolejny apel, wzywając ich do NATYCHMIASTOWEGO wstrzymania Narodowego Programu tzw. szczepień przeciwko Covid-19.\n\nNie można być obojętnym wobec tak wielu faktów i dowodów, napływających z całego świata, a także z naszej codziennej praktyki - które pokazują wyraźnie, jak wielkie zagrożenie i nieodwracalne szkody zdrowotne wyrządzają już teraz i przyniosą w przyszłości preparaty, którymi wszczepia się społeczeństwo, ukrywając ryzyko z tym związane.\n\nNikt nie będzie mógł powiedzieć, że nie był świadomy, podejmując decyzję. My dostarczamy dowodów, aby podejmowane decyzje były świadome. Czas przyniesie konsekwencje...\n\nWarszawa, 17 listopada 2021\n\n\n\n\nApel został skierowany do:\nPremier Rady Ministrów Mateusz Morawiecki\nMinister Zdrowia Adam Niedzielski\nMinister Michał Dworczyk - pełnomocnik rządu do spraw szczepień\n\n\n\nApel Polskiego Stowarzyszenia Niezależnych Lekarzy i Naukowców w sprawie natychmiastowego wstrzymania Narodowego Programu szczepień przeciwko Covid-19\n\nMy, lekarze i naukowcy zrzeszeni w Polskim Stowarzyszeniu Niezależnych Lekarzy i Naukowców, zwracamy się z apelem o natychmiastowe wstrzymanie szczepień przeciwko covid-19 w Polsce.\n\nW świetle najnowszych doniesień naukowych i statystycznych tzw. \"szczepionka\" przeciwko covid-19 nie jest ani bezpieczna, ani skuteczna, ani przebadana jak Państwo głosicie, rekomendując jej stosowanie obywatelom naszego kraju.\n\nBrak bezpieczeństwa tej \"szczepionki\", która w istocie jest preparatem inżynierii genetycznej nie stosowanym nigdy dotąd w medycynie, został obnażony przez wiele badań naukowych i danych statystycznych:\n\n1/ Eudra Vigilance to baza danych Unii Europejskiej, zawierająca raporty o podejrzewanych reakcjach na lekarstwa, z którą można zapoznać się na stronie internetowej pod linkiem: http://www.adrreports.eu/en/index.html\n\nObecnie zgłasza ona 27 247 ofiar śmiertelnych i 2 563 768 ciężkich niepożądanych odczynów poszczepiennych po szczepionkach na covid-19./dane na dzień 9.09.21r/.\n\nCiężkie odczyny poszczepienne to: paraliż, zaburzenia orientacji i pamięci, drgawki, zespół Guliama-Barego, porażenie nerwu twarzowego, porażenie kończyn, przewlekłe bóle mięśni i stawów, reakcje anafilaktyczne, powikłania zakrzepowo-zatorowe, które mogą powstać w każdym organie ciała-łącznie z nową jednostką chorobową: poszczepienną zakrzepicą małopłytkową, zapalenie mięśnia sercowego i osierdzia, zawały serca, poronienia, przewlekłe zmiany skórne, przewlekłe zmęczenie.\n\n2/ Amerykańska agencja do spraw zgłaszania niepożądanych odczynów poszczepiennych VAERS zgłasza na dzień 21.09.21r - 15 924 zgony po szczepieniu przeciwko covid-19 i 715 059 poważnych niepożądanych odczynów poszczepiennych.\n\n3/ Brytyjski urząd MHRA /Medical Health Regulatory Agency/ ujawnił, że w ciągu zaledwie ośmiu miesięcy od 9 grudnia 2020r. do 1 września 2021r. było cztery razy więcej zgonów z powodu szczepień na Covid-19 (było to 1632 zgony), niż po wszystkich szczepionkach w ciągu ostatnich 20 lat (zgonów tych było 404).\n\nhttps://theexpose.uk/2021/09/14/13-reasons-why-you-should-not-allow-your-child-to-get-the-covid-19-vaccine/\n\n4/ Do 6-tego października, od czasu rozpoczęcia epidemii, liczba zgonów związanych z potwierdzonym COVID-19 na Tajwanie wynosiła 844, natomiast liczba zgonów po szczepieniu na covid-19 na dzień 6 października wyniosła 849. Jest to pierwszy przypadek, kiedy liczba zgonów po szczepieniach przekroczyła liczbę potwierdzonych zgonów z powodu covid-19. https://pubmedinfo.org/2021/10/16/zgony-po-szczepionkach-c-19-przewyzszaja-ilosc-zgonow-zwiazanych-z-c-19/\n\n5/ Szczepionka firmy Pfizer,którą są szczepione między innymi polskie dzieci powyzej 12 roku życia, stwarza duże zagrożenie zapaleniem mięśnia sercowego i osierdzia. Naukowcy z prestiżowego medycznego miesięcznika JAMA obliczyli średnią miesięczną liczbę przypadków zapalenia mięśnia sercowego lub osierdzia w okresie przed \"szczepionką\" - od stycznia 2019 do stycznia 2021 było 16,9 w porównaniu z 27,3 w okresie \"szczepionki\" - od lutego do maja 2021 roku. Średnie liczby przypadków zapalenia osierdzia w tych samych okresach wyniosły 49,1 i 78,8. https://jamanetwork.com/journals/jama/fullarticle/2782900 (artykuł z dnia 4.08.21).\n\n6/ W materiale opublikowanym w British Medical Journal na podstawie oficjalnych danych firmy Pfizer i kalkulatora ryzyka Qcovid na każdą jedną unikniętą hospitalizację z powodu covid-19 nawet 223 młodych ludzi może doświadczyć minimum 1 poważnego zdarzenia poszczepiennego\n\nhttps://www.bmj.com/content/373/bmj.n1635/rr-4\n\n7/ W Polsce zgłaszalność niepożądanych odczynów poszczepiennych jest dalece niedoszacowana i w efekcie prawdziwa ich liczba jest nieznana. Jest 50 krotnie mniejsza niż np.w Holandii i 9 krotnie mniejsza niż średnia europejska, co potwierdzają liczni pacjenci poszkodowani przez te \"szczepionki\" i skarżący się, że lekarze nie chcą zgłaszać ich problemów zdrowotnych pojawiających się bezpośrednio po szczepieniu.\n\n8/ Badania naukowe opublikowane 13 października 2021 w największej na świecie bibliotece biomedycznej National Library of Medicine: SARS-CoV-2 Spike Impairs DNA Damage Repair and Inhibits V(D)J Recombination In Vitro wykazało, że pełnej długości białko wypustek SARS-CoV-2 -białko Spike/po \"szczepieniu\" dochodzi właśnie do produkcji takich białek w organizmie człowieka /, lokalizuje się w jądrze komórkowym i hamuje naprawę uszkodzeń DNA.\n\nhttps://pubmed.ncbi.nlm.nih.gov/34696485/#:~:text=Here%2C%20by%20using%20an%20in%20vi tro%20cell%20line%2C,required%20for%20effective%20V%28D%29J%20recombination%20in%20a daptive%20immunity.\n\nOdporność adaptacyjna odgrywa kluczową rolę w walce z zakażeniem SARS-CoV-2 i bezpośrednio wpływa na wyniki kliniczne pacjentów. Badania kliniczne wykazały, że pacjenci z ciężkim COVID-19 wykazują opóźnioną i słabą adaptacyjną odpowiedź immunologiczną; jednak mechanizm, za pomocą którego SARS-CoV-2 hamuje odporność nabytą, pozostaje niejasny. W badaniu tym, używając linii komórkowej in vitro, naukowcy donoszą, że białko wypustek SARS-CoV-2 znacząco hamuje naprawę uszkodzeń DNA, co jest wymagane do skutecznej rekombinacji V(D)J w odporności nabytej. Mechanicznie stwierdziliśmy, że białko kolczaste lokalizuje się w jądrze i hamuje naprawę uszkodzeń DNA, utrudniając rekrutację kluczowych białek naprawczych DNA BRCA1 i 53BP1 do miejsca uszkodzenia.\n\nOdkrycia te ujawniają potencjalny mechanizm molekularny, dzięki któremu białko wypustek może utrudniać odporność adaptacyjną i podkreślać potencjalne skutki uboczne szczepionek opartych na wypustkach o pełnej długości.\n\nOdkrycia te dostarczają dowodów na to, że białko kolca uszkadza maszynerię naprawy uszkodzeń DNA i adaptacyjną maszynerię immunologiczną in vitro. Zaproponowano potencjalny mechanizm, dzięki któremu białka kolczaste mogą osłabiać odporność nabytą poprzez hamowanie naprawy uszkodzeń DNA .Razem dane te pokazują, że białko kolce bezpośrednio wpływa na naprawę DNAw jądrze .\n\nBrak skuteczności\n\n1/ \"Szczepionka\" przeciwko Covid-19 nie działa\n\nhttps://www.irishtimes.com/news/health/waterford-city-district-has-state-s-highest-rate-of-covid-19-infections-1.4707344\n\nKilka dni temu irlandzka strona internetowa / link powyżej/ poinformowała, że w hrabstwie Waterford 99,7 % wszystkich mieszkańców zostało zaszczepionych na covid-19 i jest tam najwyższy wskaźnik zapadalności na covid-19. Irlandia posiada najwyższy wskaźnik szczepień w UE ponad 90 % u osób powyżej 16 roku życia i najwyższą liczbę hospitalizacji z powodu covid-19 od marca 2021r.\n\nSzczepionka nie tylko nie zatrzymuje transmisji ale powoduje wirusową ucieczkę immunologiczną i powstawanie nowych jeszcze bardziej zjadliwych odmian wirusa.\n\nNiedawna analiza pojawiającego się szczepu A30 opublikowana w \"Nature\" pokazuje,że białko kolca wariantu A30 Sars-Cov-2 jest silnie zmutowane i unika przeciwciał indukowanych szczepionką z wysoką skutecznością.\n\n2/ Badanie brytyjskiego Departamentu Zdrowia i Opieki Społecznej jest analizą trwającego ogólnopopulacyjnego monitorowania SARS-CoV-2 w Wielkiej Brytanii i obejmuje pomiary wiremii w populacji.\n\nBadanie wykazało, że miano wirusa w populacji zaszczepionej i nieszczepionej jest praktycznie takie samo i znacznie wyższe niż odnotowano przed wprowadzeniem szczepień przeciwko covid-19.\n\nAutorzy badania doszli do wniosku, że szczepionki Pfizera i Oxford / AstraZeneca straciły skuteczność w stosunku do wariantu Delta Covid-19\n\nhttps://theexpose.uk/2021/09/14/13-reasons-why-you-should-not-allow-your-child-to-get-the-covid-19-vaccine/\n\n3/ Raport zatytułowany \"Warianty powodujące objawy SARS-CoV-2 i warianty badane w Anglii \"\n\nhttps://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/fil e/1014926/Technical_Briefing_22_21_09_02.pdf\n\nopublikowany przez Public Health England podaje,że 536 zgonów miało miejsce wśród 219.716 potwierdzonych przypadków w populacji nieszczepionej od lutego 2021r. Jest to wskaźnik śmiertelności przypadków wynoszący 0,2%. Natomiast 1091 zgonów miało miejsce wśród 113 823 przypadków wśród w pełni zaszczepionej populacji. Jest to wskaźnik śmiertelności przypadków wynoszący 1%.\n\nOsoby w pełni zaszczepione stanowią 64,25% zgonów z powodu Covid-19 od lutego 2021 r., a wliczając w te liczby zaszczepionych częściowo, stanowią one 70%.\n\nOznacza to, że szczepionki na covid-19 wydają się zwiększać ryzyko śmierci z powodu covid-19 o 400%, zamiast zmniejszać ryzyko śmierci o 95%, jak twierdzą producenci szczepionek, organy zdrowia publicznego i rząd.\n\nhttps://theexpose.uk/2021/09/14/13-reasons-why-you-should-not-allow-your-child-to-get-the-covid-19-vaccine/\n\n4/ Według szwedzkiej gazety \"Svenska Dagbladet\", tamtejsza Agencja Zdrowia Publicznego (Folkhälsomyndigheten) poinformowała na początku października, że 70 procent zgonów z powodu COVID-19 w okresie od 1 do 24 września dotyczyło osób \"w pełni zaszczepionych\". W całym kraju odnotowano w tym czasie około 130 śmiertelnych przypadków COVID-19.\n\nhttps://dorzeczy.pl/zdrowie/214915/w-pelni-zaszczepieni-stanowia-wiekszosc-zgonow-na-covid-19.html\n\nW tym samym artykule podano,że według danych Agencji Bezpieczeństwa Zdrowia Wielkiej Brytanii /UKHSA /między 6 września a 3 października 70 procent śmiertelnych przypadków COVID-19 wystąpiło u osób w pełni zaszczepionych. W liczbach bezwzględnych było to 2281 zgonów \"w pełni zaszczepionych\" osób i tylko 611 u osób nieszczepionych w ciągu 28 dni od pozytywnego testu. Osoby częściowo zaszczepione stanowiły 98 przypadków zgonów.\n\n5/ O braku przewidywanej skuteczności \"szczepionki\"przeciwko covid-19 było wiadomo już na wiosnę 2021r. Dnia 25 .04.21r z inicjatywy prof. Włodzimierza Korab-Karpowicza został wysłany list otwarty do Ministra Zdrowia, który podpisało kilkudziesięciu lekarzy i naukowców, podnoszący tą kwestię i dokumentujacy tą tezę licznymi badaniami naukowymi. Już wtedy zadano tam pytanie: \"Dlaczego szczepi się masowo Polaków na SARS-CoV-2, kiedy wiadomo, że od zaprojektowania szczepionek wytworzyły się nowe mutacje wirusa, na które szczepionki nie są skuteczne?\"\n\nDowody:\n\nArtykuł 1: \"Evidence of escape of SARS-CoV-2 variant B.1.351 from natural and vaccine-induced sera\" opublikowany w Cell ( https://doi.org/10.1016/j.cell.2021.02.037) w sposób jednoznaczny wskazywał na to, że w chwili obecnej oryginalny wirus z Wuhan, tzw. \"early Wuhan\", na bazie którego powstały szczepionki na COVID-19 uległ mutacji. Mamy obecnie do czynienia z wirusami o tak silnych mutacjach, że szczepionki nie są już skuteczne.\n\nArtykuł 2: “Impact of SARS-CoV-2 B.1.1.7 Spike variant on neutralisation potency of sera from individuals vaccinated with Pfizer vaccine BNT162b2\" opublikowany w Nature (https://www.nature.com/articles/s41586-021-03412-7) wskazywał, że szczepionki Pfizer nie są efektywne w ochronie przed zakażeniem brytyjską wersją wirusa SARS-Cov2 B1.1.7., której występowanie w populacji polskiej wynosi obecnie 97%.\n\nArtykuł 3: \"A two-dose regimen of the ChAdOx1 nCoV-19 vaccine did not show protection against mild-to-moderate Covid-19 due to the B.1.351 variant\", opublikowny w The New Journal Journal of Medicine (https://www.nejm.org/doi/full/10.1056/nejmoa2102214) pokazywał na podstawiebadań przeprowadzonych w RPA, że AstraZeneca jest nieskuteczna w stosunku do wariantu południowoafrykańskiego koronawirusa.\n\n\t\nArtykuł 4:\"Evidence for increased breakthrough rates of SARS=CoV-2 variants of concern in BNT162b2 mRNA vaccinated individuals\" umieszczony jako preprint przed medRvix:\nhttps://www.medrxiv.org/content/10.11/2021.04.06.21254882v2.full.pdf\npokazywał na podstawie badań przeprowadzonych w Izraelu, że szczepionka Pfizer mniej skuteczna w stosunku do wariantu południowoafrykańskiego i brytyjskiego.\n\nArtykuł 5: \"Evidence for increased breakthrough rates of SARS-CoV-2 variants of concern in BNT162b2 mRNA vaccinated individuals\", umieszczony jako preprint przez medRxiv (https://www.medrxiv.org/content/10.1101/2021.04.06.21254882v1) udawadniał, że osoby zaszczepione preparatem firmy BioNTech - Pfizer (Comirnaty) są 8-krotnie bardziej narażone na zakażenie mutacjami wirusa SARS-Cov2 B1.1.7. i B.1.351 niż osoby niezaszczepione.\n\n6/ Grzegorz Płaczek opublikował na Facebooku (https://www.facebook.com/watch/live/?ref=watch_permalink&v=272949094717210) pismo z dnia 8.10.21r. z Ministerstwa Zdrowia na temat zachorowań i zgonów we wrześniu 2021r na Covid-19, z którego wynika że: ponad 19% osób, które umarły w Polsce we wrześniu 2021 z Covid-19 stanowią osoby w PEŁNI ZASZCZEPIONE. Liczba zgonów (we wrześniu 2021) z Covid-19 po 14 dniach PO PEŁNYM ZASZCZEPIENIU: 58 zgonów. Liczba wszystkich zgonów (we wrześniu 2021) z Covid-19: 301 zgonów.\n\nTo daje 19% zgonów z Covid 19 po pełnym zaszczepieniu.\n\nNatomiast w sierpniu 2021r. osoby w pełni zaszczepione stanowiły 36% zgonów wśród wszystkich zgonów na Covid-19!\n\nBadania szczepionek przeciwko Covid-19\n\n1/ Obecne na polskim rynku \"szczepionki\" przeciwko covid-19 są cały czas w trakcie badań klinicznych III fazy o czym piszą sami producenci tych preparatów w swoich charakterystykach produktu leczniczego. I tak badanie III fazy dla szczepionki Comirnaty firmy Pfizer-Biontech kończy się 31.01.23r, \"szczepionki\" Spikevax firmy Moderna dnia 31.12.22r., firmy Johnson&Johnson-31.12.2023r., firmy Astra-Zeneca - 31.05.2022r.\n\n2/ Dnia 2.11.2021r. W prestiżowym miesięczniku British Medical Journal (https://www.bmj.com/content/375/bmj.n2635) ukazał się artykuł przedstawiający wiele nieprawidłowości w trakcie przeprowadzania badań klinicznych \"szczepionki\" Pfizer przed dopuszczeniem jej do obrotu i zastosowaniu u ludzi na całym świecie. Dyrektor regionalny Brook Jackson, która była zatrudniona w organizacji badawczej Ventavia Research Group, powiedziała BMJ, że firma fałszowała dane, odślepiała pacjentów, zatrudniała niewłaściwie przeszkolonych personel szczepiący i powoli podejmowała działania następcze po zdarzeniach niepożądanych zgłoszonych w kluczowym badaniu III fazy firmy Pfizer. Pracownicy, którzy przeprowadzali kontrole jakości, byli przytłoczeni ilością znalezionych problemów. Powiedziała też, że podczas dwóch tygodni, kiedy była zatrudniona w Ventavia we wrześniu 2020 roku, wielokrotnie informowała swoich przełożonych o złym zarządzaniu laboratorium, obawach dotyczących bezpieczeństwa pacjentów i problemach z integralnością danych. Dyrektor Brook Jackson była również świadkiem następujących nieprawidłowości w trakcie trwania tych badań: uczestnicy umieszczeni na korytarzu po wstrzyknięciu i nie monitorowani przez personel kliniczny, brak terminowej obserwacji pacjentów, u których wystąpiły zdarzenia niepożądane, odchylenia protokołu nie były zgłaszane, szczepionki nie były przechowywane w odpowiednich temperaturach, błędnie oznakowane próbki laboratoryjne.\n\nW dokumencie informacyjnym firmy Pfizer przedłożonym na posiedzeniu komitetu doradczego FDA, które odbyło się 10 grudnia 2020 r., w celu omówienia wniosku firmy Pfizer o zezwolenie na zastosowanie awaryjne szczepionki przeciw Covid-19, firma nie wspomniała o problemach ze strony Ventavia. Następnego dnia FDA wydała zezwolenie na szczepionkę.\n\nW sierpniu tego roku, po całkowitym zatwierdzeniu szczepionki Pfizera, FDA opublikowała podsumowanie swoich kontroli dotyczących kluczowego badania firmy. Skontrolowano dziewięć ze 153 miejsc badania. Zakłady Ventavii nie znalazły się na liście dziewięciu, a w ciągu ośmiu miesięcy po wydaniu zezwolenia awaryjnego z grudnia 2020 r. nie przeprowadzono żadnych inspekcji zakładów, w których rekrutowano dorosłych.\n\nOdkąd Brook Jackson zgłosiła FDA problemy z Ventavią we wrześniu 2020 r., Pfizer zatrudnił firmę Ventavia jako podwykonawcę badawczego w czterech innych badaniach klinicznych szczepionek (szczepionka Covid-19 u dzieci i młodych dorosłych, kobiet w ciąży oraz dawka przypominająca, a także RSV próba szczepionki: NCT04816643, NCT04754594, NCT04955626, NCT05035212).\n\n3/ Na konferencji prasowej ,która odbyła się dnia 20.09.21r w W INSTYTUCIE W REUTLINGEN w Niemczech, w której wzięli udział lekarze ,naukowcy i prawnicy: prof. dr. Arne Burkhardt i prof. dr. Walter Lang, prof. dr. Peter Schirmacher ,dr Uta Lange, dr Axel Bolland,dr Hubmer-Mogg z Austrii, ujawniono wiele nowych zaskakujących dowodów dotyczących mechanizmów komórkowo-molekularnych działań niepożądanych tych \"szczepionek\" oraz niezadeklarowanych przez producentów w oficjalnych ulotkach składników tych preparatów.\n\nhttps://www.pathologie-konferenz.de/\n\nTłumaczenie w języku polskim:\n\nhttps://odysee.com/@EfektSetnejMaply:4/Pressconferenz1_pl:1\n\nhttps://odysee.com/@EfektSetnejMaply:4/Pressconfrerenz2_pl:e\n\nW pierwszej części tej konferencji wyniki swoich badań przekazali patolodzy niemieccy.\n\nW ponad 40 zwłokach poddanych autopsji, które zmarły w ciągu dwóch tygodni po szczepieniu COVID-19, około jedna trzecia zmarła w wyniku szczepienia. W ramach transmitowanej na żywo konferencji prasowej pokazane zostały mikroskopowe szczegóły zmian w tkankach. Przedstawione zdjęcia ujawniły patomechanizmy działań ubocznych szczepionek, mogące prowadzić do zgonu:\n\n- uszkodzenie śródbłonka naczyniowego, zapalenie ścian naczyń (tętnice, żyły), zapalenie okołonaczyniowe, zlepianie się erytrocytów, mikrozakrzepy\n\n- \"szał\" limfocytów - nacieki limfocytarne, wieloogniskowe zmiany zapalne, m.in. limfocytarne zapalenie mięśnia sercowego, osierdzia, nagromadzenie limfocytów wokół naczyń - aorty, naczyń wieńcowych\n\n- nadmierna reakcja immunologiczna prowadząca do powstania choroby autoimmunologicznej, np. choroba Haschimoto u wszystkich pacjentów\n\n- hiperplazja i nadaktywność narządów limfatycznych (węzły chłonne, śledziona), pseudochłoniaki\n\n- infiltracja i tworzenie pęcherzyków (grudek) limfatycznych w innych - nielimfatycznych organach, co prowadzi do ich zniszczenia (wątroba, płuca, tarczyca, gruczoł ślinowy, nerki)\n\n- wyczerpanie/osłabienie narządów limfatycznych co prowadzi do zmniejszenia wydolności układu odpornościowego\n\n- przyspieszenie rozrostu komórek rakowych\n\nProf. Arne Burkhard oznajmił, że \"takiego spustoszenia w organizmie jak u ofiar zmarłych po tych preparatach nie widział nigdy w ciągu całej swojej 40 letniej pracy\". Przestrzega, że ten kto chcesię zaszczepić poniesie ogromne konsekwencje zdrowotne .\n\nW drugiej części konferencji przedstawiane zostały wyniki badań mikroskopowych próbek wszystkich dostępnych na rynku \"szczepionek\" przeciwko covid-19 oraz badania próbek krwi pacjentów po przyjęciu tego preparatu. Pokazano krótkie sekwencje video oraz zdjęcia mikroskopowe tych próbek.\n\nW próbkach szczepionek zaobserwowano składniki, które nie powinny się w nich znajdować:\n\n- przesuwające się elementy wykazane pod mikroskopem ciemnego pola wyglądające jak \"chip\"\n\n- obiekt miał wielkość ok. 40 mikrometrów, w tle były widoczne poruszające się nanolipidy,\n\n- duże elementy /zbyt duże dla naczyń włosowatych/ o ostrych krawędziach,\n\n- poruszające się cząstki w kształcie - jak to określono - \"małych samolotów\", małe struktury metaliczne o ostrych krawędziach, w formie \"Y\", pierścienia, przezroczystych płytek, inne kształty,\n\n- bardzo uporządkowane struktury w formie łańcuchów, które były oglądane w 40 krotnym i 1000 krotnym powiększeniu,\n\n- struktury ,które wyglądały jak pasożyty.\n\nElementy te były badane w różnych seriach szczepionek i we wszystkich je znajdowano. Pierwsze analizy tych obiektów wykazały, że są to metale ciężkie jak chrom, żelazo i nikiel albo zawierają metale ciężkie.\n\nNa początku czerwca 2021r naukowcy badali inne szczepionki, takie jak: szczepionka FSME /przeciwko kleszczowemu zapaleniu mózgu/, która nie zawierała żadnych poruszających się elementów tylko aluminium, szczepionkę przeciw grypie dla dorosłych, szczepionkę przeciwko wirusowemu zapaleniu wątroby typu B oraz na odrę - te zawierały tylko cząstki białkowe. Zbadano również szczepionkę donosową dla dzieci przeciw grypie, w której znaleziono metaliczne, prostokątne o ostrych krawędziach elementy mogące się dostać do krwiobiegu w czasie podawania takiej szczepionki poprzez podrażnienie błony śluzowej nosa.\n\nW badanych próbkach krwi osób po szczepieniu przeciw covid-19 znajdowano \"poskręcane, podłużne wijące się\" formy o charakterze nieorganicznym wyglądające jak cząstki grafenu - światło załamywało się na nich podwójnie co wyklucza formę organiczną a także posklejane erytrocyty oraz ciała obce w postaci długich nici, nieorganiczne elementy, metalowe cząstki.\n\nW świetle powyżej przedstawionych obiektywnych faktów, doniesień naukowych i oficjalnych danych statystycznych pokazujących w sposób oczywisty, że obecnie podawane społeczeństwu polskiemu tzw. szczepionki przeciwko covid-19 są niebezpieczne oraz nieskuteczne, a przy tym nie w pełni przebadane, tym samym sprowadzają ryzyko ciężkich odczynów poszczepiennych łącznie z licznymi zgonami na osoby je przyjmujące.\n\nW związku z tym wzywamy do natychmiastowego! wstrzymania dalszego propagowania i podawania tych preparatów dzieciom i dorosłym Polakom.",
			"added": 1637740047
		}
	],
	"topic_vote": {
		"1635374346_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": 1,
		"1636109745_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1634582490_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 1,
				"body": "Sęk w tym, iż takie zestawienia powinny pojawiać się na powierzchni internetu.",
				"added": 1634628880
			}
		],
		"1634380149_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 2,
				"body": "O nie. To rasistowskie i seksistowskie!!! Lubię to :)",
				"added": 1634629008
			}
		],
		"1634884167_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 3,
				"body": "> [driud2](#comment_30_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Witam; działa. W takim sensie, że się zainstalował bez problemu. potem sprawdzę jak działa? Trzeba to dodać do spisu \"ZeroSites\". Bo tam jest główna informacja o stronach, które są tutaj do użytku.Pozdrawiam.\n\nOn jest na zero sites chyba jako pierwszy na liście XD\n\nOk to wiem, że ze mną jest coś nie teges.",
				"added": 1634888854
			}
		],
		"1635374346_1EYjF4EgbCCDsCxtVFTNAUJVBckvPeByx6": [
			{
				"comment_id": 4,
				"body": "Na szczęście Polacy to oporny naród i im bardziej ktoś dociska śrubę tym większy stawia opór.",
				"added": 1635404437
			}
		],
		"1636109745_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 5,
				"body": "Otóż to! Byle nie na Civid. Nasuwa mi się piosenka \"Jest tyle sposobów by umrzeć\".",
				"added": 1636118101
			}
		],
		"1637232450_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 6,
				"body": "Popieram. Bardzo dobra inicjatywa :)",
				"added": 1637246054
			},
			{
				"comment_id": 7,
				"body": "> [efi3](#comment_81_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ): Ciekawe, spostrzeżenie? [...]\nEfi3, mocno pojechałeś :)",
				"added": 1637322799
			}
		],
		"1637657368_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 8,
				"body": "Bardzo dobrze, że wydarzył się taki fuckup. Ktoś może pomyśle gdzie to podąża. Tak jak Konto steam. Ładujesz kasę w tytuły, które ktoś może Ci zabrać od tak. Kupujesz auto za gruby hajs a tak na prawdę nie masz do niego pełnego prawa.",
				"added": 1637659977
			}
		],
		"1637758437_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x": [
			{
				"comment_id": 9,
				"body": "I tutaj mamy reklamy.  driud2 witaj na czorno listo.",
				"added": 1637759202
			}
		],
		"1637740051_1CkXEBfYnBdZQEu7ZCQmvd723DjJwFjLx7": [
			{
				"comment_id": 10,
				"body": "> [kapec](#comment_57_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): kupuje czas samemu wirusowi aby się zaadoptował/wyewoluował do przetrwania w nowych warunkach, wytworzył nowe warianty odporne na dotychczasowe szczepionki. [...]\n\nPrzecież szczepionki są przeciw określonym \"wariantom\" wirusa. A on cały czas mutuje w niezliczone odmiany. Szczepionki z zasady są o krok za wirusem. Z tego powodu nie skutecznej ma szczepionki na grypę i najprawdopodobniej na covid też ne będzie. \n\nOsobiście jestem wszczepiony wszystkimi potrzebnymi szczepionkami, które działają (także na choroby tropikalne, z czasów gdy jeszcze latałem na wakacje czyt. przed pandemią).  Szczepionka na covid póki nie wyjdzie z etapu testów nie powinna być nazywana szczepionką. A jej skuteczność jest coraz w większym stopniu wątpliwa.  Bez kwestionowania fikołków logicznych tej pandemi będą mogli nam wcisnąć w żyłę sól fizjologiczną wziąć za to gruby hajs a następnie oczekiwać, że zgłosimy się po następną przypominającą dawkę. A to wszystko w pogoni za skuteczną obroną (szczepionką).  Przy założeniu, że wszystkie dotychczasowe dawki są bezpieczne (nikt tego nie potrafi wykazać). \n\nTaki wyścig szczepionki z wirusem może skończyć się wykreowaniu naprawdę groźnego wirusa, którego nie powstrzyma już żaden zastrzyk, ani żaden nawet najsilniejszy organizm. To będzie \"wariant\" omega.",
				"added": 1637825536
			}
		]
	},
	"comment_vote": {}
}