{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1597367837,
			"title": "Wirless Mesh Networks to Circumvent Internet Blackouts",
			"body": "As the United States of America approaches its most controversial election in the history of its existence, it is extremely important that the citizens of this country realize that Internet Blackouts are not out of the realm of possibility for what will occur if and when riots break out as a result of the elections this November. During the George Floyd riots (which were entirely uncalled for and quite embarrassing in my opinion) there were many well educated patriots who called for an internet blackout so the government could \"put an end to the riots.\" This would have looked similar to the situation that just unfolded in Belarus this past week. However, if this is any indication of what might come in November, then the citizens of the United States MUST be prepared.\n\nWireless Mesh Networks are used by the US Army for operations in areas where internet access is very limited or non-existent in order to carry out missions. These networks are very similar in concept to the decentralized nature of ZeroNet, but can operate on a larger scale and are even less prone to censorship should a government decide to \"pull the plug\" so to speak. \n\nAnyway, here is a perfect example of a project that may prevent countless deaths in the near future here in the United States regardless of what the results of this election may happen to be:\n\nhttps://www.commotionwireless.net/",
			"added": 1597367836
		}
	],
	"topic_vote": {
		"1596284934_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1596649883_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1597408822_1G7AgufdSvApA47h2Y4JhFMViX1g5Q27ho": 1,
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1597578463_1NgTAHQ6Ee7pWNXbmnJzfSCBNZoMhhbC4G": 1
	},
	"next_comment_id": 72,
	"comment": {
		"1593724956_18FmpbxghV4UBgrjHpwgU1igoAt2gRzApL": [
			{
				"comment_id": 1,
				"body": "https://tinyurl.com/y8b6r9bo\n\nSome genius wrote this book about a year and a half ago or so when he noticed similar happening in his own country. You will enjoy its contents, but please remember to share. Also some things have changed. Author no longer offers Tor Hosting or Domain Customization (though the other Service Providers listed are still in operation,) you are advised against DuckDuckGo (use SearX and StartPage/IXQuick instead) as it is proven to NOT be trustworthy, bitcoin mixer listed is no good (but ChipMixer still works fine.)\n\nhttps://OTB-Technologies.com for good networking opportunities...\n\nP.S. Its me; I am \"some genius\" hehe :P (Work is copyrighted, but feel free to share!!)",
				"added": 1594095612
			},
			{
				"comment_id": 2,
				"body": "Also,  Kodachi Linux is terrific for staying safe and anonymous; again, please promise to spread the word!\n\n(This didn't make it into the book due to the fact that it was introduced to me by a fellow anon after the book was originally published/submitted for copyrighting. Let me know if you have any questions. Wickr = OTBTechnologies)",
				"added": 1594096059
			}
		],
		"1592950813_1PGtPmD5NAWpf4kaEB1qquveCN8S4LUqrq": [
			{
				"comment_id": 3,
				"body": "Mariana's Web is Theoretically possible to exist only once Quantum Computers exist... Although...\nPost-Quantum Resistant Cryptography DOES exist and is in BETA testing right now... So, by principle, if you used such cryptography in a fashion similar to how the Tor Network and VPNs are designed... Then, you would essentially be accessing the closest thing to \"Mariana's Web\" that any civilian will likely have access to for centuries...\n\nFor more information on such theoretical possibilities, message me on Wickr, username is: otbtechnologies\nThis is where I am in my studies on InfoSec; PQC is up and coming \"Big Thing\" in InfoSec as of 2016 in the US anyway. Not sure where you reside. Either way... Will go global fast what with the NSA pushing Big Tech to make Quantum Computing a possibility as soon as possible; they are sick of smart people like me I think... XD XD XD",
				"added": 1594472076
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 4,
				"body": "> [ryuyu5]The ZeroNet is not the same as the ZeroTalk main forum instance. ZeroNet is a technology, like HTTP, WWW, HTML, and it can be used for many things, including dumb sheep socializing, although if You want dumb sheep socializing in P2P-style, then there are P2P-social-network-applications that connect with each other by using some special common P2P-social-application-protocols.\nhttps://fediverse.party/\nA \"social network\" is a bubble for dumb people, who get high from the false impression that other people are admiring them. Hence the photos and videos and \"sharing\" and \"tweeting\" and no serious substance.\n\nThe censored net is like a public street that has become popular: there are gangs (\"Governments\") that try to impose their rules on others, there are pick-pockets, but there are also nice ice-cream sellers, taxis, nice cafeteria and above all, a public street is a passage for one's own car from one nice parking space to another nice parking space. The current ZeroNet is an overlay-network, \"a car that drives on the gang-ridden public street from one nice parking space to another nice parking space\", an application that uses the centralized and censorable TCP/IP.\n\nA proper free network can only be a network that is PHYSICALLY DECENTRALIZED and CLANDESTINE. There is some more information on that at\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1576021462_1K8NrwqEfy49zAMWzHgywnToZib7PRaQMP/Can+ZeroNet+help+to+access+internet+during+blackout+internet [...]\n\nExcellent explanation! ^.^",
				"added": 1594472361
			},
			{
				"comment_id": 5,
				"body": "Apologies as I am just learning the markup for Talk.ZeroNet, and so I quoted that incorrect... good post tho.. thanks @ryuyu5",
				"added": 1594472439
			},
			{
				"comment_id": 6,
				"body": "Further, decentralized internet is not the future at all... Decentralized internet was actually the ORIGINAL design for the internet, but money overrode what happened instead... smh... I keep trying to explain this to people, but its over their heads most times... \nBut yes, Decentralization is going to be the \"new normal\" now that people are \"awake\" (I fucking hate \"future speak\" this is all so stupid for those who actually know and understand whats really going on smh... :-/)",
				"added": 1594472578
			},
			{
				"comment_id": 7,
				"body": "> [reichama](#comment_24_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): It's not called future speak, it's called newspeak. Everything old is new again or something like that.\n\nSorry, memory has faded since it has been just over a decade since reading the book itself.\nNow we are living it, soooo.... meh... :-/\nEither way... This is no bueno lol",
				"added": 1594525793
			}
		],
		"1596284934_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": [
			{
				"comment_id": 8,
				"body": "Here is the full video of the doctors which is being blocked on my country's social media:\nhttps://www.brighteon.com/9767ce5c-1d46-4288-96a1-2ffad4be7aea\n\nThese doctors are saying that what is going on is extremely immoral and unethical; but, many of their license's are being taken away for no good reason. This is very bad and what is going on in the United States right now is strikingly similar to how things began in Nazi Germany to the best of my knowledge (which is great since I have studied the history of civilization since prehistoric times in college and also in greater depth on my own time.)\nThen again, it could also easily go into the opposite direction quickly as well depending on how this election goes in November. A few twists and turns could easily shift this into a communist nation; I think I prefer the Nazi state better, but those are not very good choices either way. Why not go back to being a free country?",
				"added": 1596344604
			},
			{
				"comment_id": 9,
				"body": "Clickable link form: https://OTB-Technologies.com\n\nBy the way I use two different ZeroID for my postings due to security concerns in my country. \nI have two in case my otbtechnologies7 (which is my ZeroID for my mobile) is compromised which is more likely since this account is under extremely high level of security by comparison.\n\n#InCryptographyWeTrust",
				"added": 1596344996
			},
			{
				"comment_id": 10,
				"body": "Listen to what Doctor Simone Gold has to say at appx 1:47:00, \"More people are being harmed by the lock-down than the virus.\" She said this in a letter to the President months ago, just as I advised my co-workers (at the time) months ago would end up happening. Now the crooked leftists are using the virus to push their agendas.\n\nhttps://www.brighteon.com/9767ce5c-1d46-4288-96a1-2ffad4be7aea\n\nIts no longer about the virus or human health; its about politics.\nOther countries are doing GREAT!\nLook at Sweden: Zero deaths in the past 3 days and only 5 deaths total in the past week or so.\nThat country NEVER went into lock-down.\nThey trusted their citizens.\nTheir model for handling the virus is logical and kept their country prosperous while the rest of the world's economy suffered worse than it has since the Great Depression of the 1930s. This could have been avoided.\n\nThe Leftists, again, are literally killing people and letting people die to push their agendas right now.\nYet, they are point their collective fingers at Trump saying its all his fault this happened.\nHowever, all evidence from the medical community is on the contrary to this (now widespread) misinformation.\nAnytime anyone with an education on the matter speaks out they are made silent either through direct censorship or even through the revocation of their medical license by the board. Seems fair right?\nNo, this is tyranny.\nThis is literally hell on Earth.\n\n#MakeAmericaFreeAgain \n#OTB4PreSid3nT",
				"added": 1596350546
			},
			{
				"comment_id": 11,
				"body": "Truth is truth even if no one believes it...\nA lie is a lie even if everyone believes it...\n\nGet it? Got it? Good...",
				"added": 1596351145
			},
			{
				"comment_id": 20,
				"body": "All prior posts by OTBTechnologies7 are confirmed to be authentic.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596508300
			},
			{
				"comment_id": 22,
				"body": "This post was in fact written by me at approximately 72 hours ago.\n\nI apologize for my lateness in verifying that this post was in fact made by me, but its been an interesting week what with my having seen multiple government planes flying in strange airspace leading to me preparing for the next world war to start sometime soon. Hopefully this war remains digital, but it seems to me that it is becoming more and more physical by the day. Time will tell of course.\n\nAll prior posts by OTBTechnologies7 are confirmed to be authentic.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596767128
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 12,
				"body": "Mullvad is good; great jurisdiction.\nExcellent company policies too.\n\nI am not affiliated either; just like to share good information.\nThanks for mentioning Mullvad.\n\nExpressVPN is good too.\nIf you require Port Forwarding then AirVPN is reliable, but it is in 14 eyes jurisdiction so be cautious.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596355417
			},
			{
				"comment_id": 13,
				"body": "> [jeancharlatan](#comment_1_17LwqmdXGhvTyRMvsjfogExmfqQaUrnSym): Nobody's heard of Mullvad VPN? Checkout https://thatoneprivacysite.net/ very detailed comparison. I'm no affiliate.\n\nMullvad is good; great jurisdiction.\nExcellent company policies too.\n\nI am not affiliated either; just like to share good information.\nThanks for mentioning Mullvad.\n\nExpressVPN is good too.\nIf you require Port Forwarding then AirVPN is reliable, but it is in 14 eyes jurisdiction so be cautious.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596355430
			},
			{
				"comment_id": 14,
				"body": "As far as NordVPN is concerned; they appeared to be sell outs when I saw ads for them on mainstream TV Stations. I do not believe it indicates any wrongdoings on their part, but I wouldn't put it past them either of course.\nI believe they have been externally audited so meh.\nWho really knows though right?",
				"added": 1596355590
			}
		],
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 15,
				"body": "This is OTBTechnologies7 posting as OTBTechnologies to verify that this post was indeed made by the owner of OTB Technologies. This account is secure by Post Quantum Secure Cryptography whereas the other account is not. If ever anything comes into question on my other account, then demand it be verified by this account. Thank you!",
				"added": 1596497352
			},
			{
				"comment_id": 16,
				"body": "P.S. https://OTB-Technologies.com for more Truth...\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596497425
			},
			{
				"comment_id": 17,
				"body": "Again, my pseudonym is OTB Technologies and I approve this message.\n\n(P.S. They know my pseudonym and aren't going to do shit because if they do it will literally destroy any last bit of credibility that they have going for them... Go USA! Trump 2020!)",
				"added": 1596498621
			},
			{
				"comment_id": 18,
				"body": "Checkmate",
				"added": 1596498794
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 19,
				"body": "This post is authentic, my phone's security has still not been compromised.\nI will be away from this computer soon, so message verification may not happen.\nAgain, lots of military activity in the area right now, so please if anything seems suspicious verify my ID by demanding I post from this account as it is locked down with Post Quantum Secure Cryptography whereas otbtechnologies7 is not. It may take up to 24 hours to verify; if not verified in 24-48 hours assume I have been captured by adversaries and that neither account should be trusted.\n\nThis verification method is temporary and I will begin signing my posts with PGP soon so as to even further increase proof of ownership. Using the PGP method I will be able to verify on the fly on my mobile, but for now this is the method to utilize. Thank you!\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596508217
			},
			{
				"comment_id": 23,
				"body": "This post was in fact written by me at approximately 48-72 hours ago.\n\nI apologize for my lateness in verifying that this post was in fact made by me, but its been an interesting week what with my having seen multiple government planes flying in strange airspace leading to me preparing for the next world war to start sometime soon. Hopefully this war remains digital, but it seems to me that it is becoming more and more physical by the day. Time will tell of course.\n\nAll prior posts by OTBTechnologies7 are confirmed to be authentic.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596767199
			},
			{
				"comment_id": 57,
				"body": "> [stopjoggersnow](#comment_8_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC): weimerica is cancer now. It's the polar opposite of what it was when White men Founded it. But yes, I was born here.\n\nPerfect! :)\n\nJoin us...\n\nhttps://OTB-Technologies.com",
				"added": 1597875625
			}
		],
		"1596608855_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 21,
				"body": "This post was in fact written by me at approximately 48 hours ago.\n\nI apologize for my lateness in verifying that this post was in fact made by me, but its been an interesting week what with my having seen multiple government planes flying in strange airspace leading to me preparing for the next world war to start sometime soon. Hopefully this war remains digital, but it seems to me that it is becoming more and more physical by the day. Time will tell of course.\n\nAll prior posts by OTBTechnologies7 are confirmed to be authentic.\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1596767113
			},
			{
				"comment_id": 26,
				"body": "> [zaron](#comment_172_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Was it ever actually proven that the CCP gets anything from TikTok?\n\nIs this a serious question or are you simply trolling?",
				"added": 1597354380
			},
			{
				"comment_id": 27,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies7 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies7 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies7 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597354405
			}
		],
		"1597160449_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 24,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies7 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies7 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies7 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597353898
			}
		],
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 25,
				"body": "> [876zeronet](#comment_5_17vKwCbzk55MregPtemumGZ2yw2CHjRk8i): What abt using the Tor browser and the Tor network?\n\nUse a Meek-Azure Bridge and you can connect, or else you will not be able to access the network due to the Great Firewall. Similar proxies modeled after Meek-Azure now exist, but Meek-Azure is most well known and used.",
				"added": 1597354005
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 28,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies7 (or any other similar IDs) should be deemed irrelevant. Thank you! :)\n\n[ otbtechnologies3 has now officially replaced otbtechnologies7 - Any and all posts made by otbtechnologies7 after this point in time are to be considered irrelevant - Thank you again! ]",
				"added": 1597439162
			},
			{
				"comment_id": 29,
				"body": "> [otbtechnologies](#comment_28_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies7 (or any other similar IDs) should be deemed irrelevant. Thank you! :) [...]\n\nOTBTechnologies3***",
				"added": 1597439227
			},
			{
				"comment_id": 46,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597694359
			},
			{
				"comment_id": 47,
				"body": "\"Every now and then a man's mind is stretched by a new idea or sensation, and never shrinks back to its former dimensions.\"--Oliver Wendell Holmes, Sr.\n\nThings are different for those of us who have already helped transform the world into what it is today.\nOthers who did not participate have no idea.\nThey will learn though.\nOr, they will ignore.\nEither way...\n\nI rest my case :)",
				"added": 1597709389
			},
			{
				"comment_id": 48,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597709413
			},
			{
				"comment_id": 49,
				"body": "> [xcape2net](#comment_776_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Well, I hope it does succeed, because I would certainly love to be part of a globe-spanning mesh network that provides privacy for everyone.  But, I doubt it will happen, unless some billionaire like Elon Musk backs it.  Anyway, good luck.\n\nIts literally happening as we speak.\nBitcoin required no billionaire to get the ball rolling.\nGlobal mesh network will happen eventually.\nIt just takes time.",
				"added": 1597784248
			},
			{
				"comment_id": 50,
				"body": "Again, please reference: https://upload.wikimedia.org/wikipedia/en/4/45/DiffusionOfInnovation.png\n\nI studied business in college...\nEconomics has a lot to do with why this will happen...\n\n#Believe",
				"added": 1597784331
			},
			{
				"comment_id": 52,
				"body": "> [xcape2net](#comment_780_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Bitcoin didn't require that other users be within range.\n\nI will take this into account as I educate people on how to regain their First Amendment Rights...\nThanks again... :-)",
				"added": 1597874901
			},
			{
				"comment_id": 58,
				"body": "> [claude](#comment_1_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): You can quote multiple people within a single comment. You don't have to make individual comments for each quote. Just so you know :)\n\nThank you pal! :)",
				"added": 1597875658
			}
		],
		"1597408822_1G7AgufdSvApA47h2Y4JhFMViX1g5Q27ho": [
			{
				"comment_id": 30,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597527969
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 31,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597527991
			},
			{
				"comment_id": 32,
				"body": "> [c2vjcmv0](#comment_30_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3): You think I'm angry? About what? Some person spreading misinformation on the internet?Nah, annoyed maybe. [...]\n\n1.) Okay, good. Glad to hear that.\n2.) I was riding a bike and posting at stop lights. Hah! :)\n3.) Again, this is what started the whole debate. Re-Read the posts: I said, \"Well, yeah. That's sort of what this documentary explains. It elaborates that both Republicans and Democrats are actually involved in the Deep State conspiracy. Not just the Democrats which is what QAnon proponents seem to portray. You have to watch the whole thing for it to all come together.\" -AND- then I said, \"Just open your mind a little more and read in between the lines; it's quite simple in my opinion....\"\n\nSo, because I have much more important things to do with my limited time, I will try to recapitulate here in conclusion: Watch the video, listen closely to what is said, figure out how Psychological Warfare works, see how to use it to your advantage instead of relying on the video to teach you what to think, and (as I said before) if your only take away from what I have posted is that it is \"trumptard bs.\" and believe that people who support the President of the United States should \"fuck off\" because they are \"trump cum gobblers.\" and you believe that there will be a \"bullet for him 2020,\" then you are indeed a fucking moron... \n\nI have nothing further to say... Any adult with a functioning brain will side with me lol :)\n\nHave a good day! ^_^",
				"added": 1597594124
			},
			{
				"comment_id": 33,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597594132
			},
			{
				"comment_id": 38,
				"body": "As I said, \"I have nothing further to say... Any adult with a functioning brain will side with me lol :)\"\n\nThey will see the posts up to this point and make up their own mind as to which one of us is right or wrong...\n\nMost will side with me if they have any prior knowledge of Government or Military Operations...\n\nYou, on the other hand, seem to have an insufficient level of intelligence to even comprehend what I have said...\n\nLater...",
				"added": 1597594926
			},
			{
				"comment_id": 39,
				"body": "For more information about OTB Technologies, please visit: https://OTB-Technologies.com\n\n#MakeAmericaFreeAgain\n#OTB4Prez",
				"added": 1597607416
			},
			{
				"comment_id": 40,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597607421
			},
			{
				"comment_id": 41,
				"body": "> [otbtechnologies3](#comment_34_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc): Exactly. [...]\n\nAnd because I noticed the detectives used PGP to communicate just like the bad guys do, I suddenly got very interested in information security and ethical hacking. Now, I own a company that seeks to educate people regarding such matters in hopes to create a safer and more free world for everyone! Not just those in America...",
				"added": 1597622939
			},
			{
				"comment_id": 42,
				"body": "I have also done OSINT Projects and written formal reports that I have submitted to the authorities regarding an International Pedophilia ring I found just over a year ago. This was around the same time as Epstein's death ironically enough. Kind of strange coincidences no? I suppose in that case, correlation is not causation. But, none the less, its not my intention to sway people's opinion one way or another. I simply wish to speak on what I have done and what I have experienced first hand that leads me to think more openly about such things.\n\nAs many QAnon follows like to say, \"How many coincidences until it is mathematically impossible?\"\n\nPerhaps maybe this opens some eyes...\n\nOr, perhaps not...\n\n#IgnoranceIsBliss\n#TakeTheRedPill\n#FollowTheWhiteRabbit\n#WakeUpNeo\n#YoureInTheMatrix\n\n#WWG1WGA\n#QArmy",
				"added": 1597623477
			},
			{
				"comment_id": 43,
				"body": "Now, anytime I try to post things of this nature on mainstream social media sites my account gets limited or completely blocked... Just like Trump has going on now... Weird huh? :P",
				"added": 1597623560
			},
			{
				"comment_id": 44,
				"body": "Anyway... BUMP!\n\nMirrors:\n\nhttps://ipfs.io/ipfs/QmYnqet8SwumRr9mxSFmgGxSnFSZQmcBBt99PmpqeaHYsd\n\nhttps://mega.nz/file/7tcghCCA#JjCdPRgIziFMJuS_80luMuUn8DPsH3B6izvjyjXEdOA\n\nhttps://www.bitchute.com/video/q7EON7jOJV0X/\n\nhttps://open.lbry.com/@millieweaver:c/shadowgate:4\n\n(https://OTB-Technologies.com for more truth...)\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT",
				"added": 1597623647
			},
			{
				"comment_id": 45,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597623682
			},
			{
				"comment_id": 62,
				"body": "> [grouch0](#comment_3_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): Plandemic is something that needs attention, but it's just part of a much bigger picture. ShadowGate is important because it's a core component used to manage the narrative of the Plandemic and much more besides.\n\nRight, exactly!\n\nShadowGate is what let to Plandemic.\n\nFixing plandemic without addressing shadow gate is like taking a tylenol, but continuing to hit yourself on the head with a hammer lol! Best analogy I have for ya! :)",
				"added": 1597915569
			},
			{
				"comment_id": 66,
				"body": "> [wwg1wga](#comment_30_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Lol why do you hate Trump so much? [...]\n\nAgain, as I mentioned in the other thread, IGNORE THESE SUBHUMAN FUCKS!\n\nJoin our digital army by visiting: https://OTB-Technologies.com\n\nStick around long enough and I will teach you my ways...\n\nI've been doing this for over a decade now... :-)\n\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT\n#WWG1WGA\n#QArmy",
				"added": 1597974547
			},
			{
				"comment_id": 71,
				"body": "> [zaron](#comment_181_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Anyone that disagrees with you is a subhuman fucks? Wow. such intelligence\n\nNot sure how a matter of opinion relates to my level of intelligence, but sure... lol\n\nLack of intelligence would be indicated in your refusing to have an open mind to my views.\n\n0mega, c2vjcmv0, and yourself all seem to want to attack people for supporting their President without having any substantial reason for your views. Whereas I have substantiated my logic and reasoning in an intelligent manner.\n\nTo quote the \"best\" of what you lot have said, ** > [0mega](#comment_6_192xAupujZXB6jpoWqpwobPnEdQovAKiXc): Un-fucking-believable how stupid the average trumptard is. What are you cucks going to do when trump gets killed on live tv? I suggest you all gather and take long and hot baths with toasters. Fucking shit fly maga oxygen and space wasters....RL nobodies. Enough of ya **\n\nThat's a little worse than me calling you lot who refuse to listen to logic \"subhuman\" in my opinion.\nI consider you subhumans because of the fact that you aren't even intelligent enough to listen to logic.\n\nI've dealt with your type before: you say one thing, but your actions ask for another. The epitome of stupidity lol :)\n\nJust some food for thought mate... ^_^",
				"added": 1598077324
			}
		],
		"1597578463_1NgTAHQ6Ee7pWNXbmnJzfSCBNZoMhhbC4G": [
			{
				"comment_id": 34,
				"body": "> [driud](#comment_95_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): The position is simple; You have to know the truth.I know her. And I see everything differently.Black is not black and white is not white.Someone wants war, at any cost.And he will do anything to develop it.Pay attention to it, who wants war?Belarus is just an excuse..Stanowisko jest proste; Trzeba znać prawdę.Ja ją znam. I wszystko widzę inaczej.Czarne nie jest czarne, a białe nie jest białe.Ktoś chce wojny, za wszelką cenę.I zrobi wszystko, żeby ją wywołać.Zwróć na to uwagę, kto chce wojny?Białoruś to tylko pretekst.\n\nAh... Okay...\n\nThis even more so interests me now...\n\nAlso, side note, I never realized how unique the Polish language actually is in that many words do not have exact translations into the English language. I have a hard enough time understanding German and Swedish, but at very least the words are largely similar. I have attempted learning Russian, but quickly became defeated by the complexity. So, tell me, would Polish be easier or more difficult for an English speaking individual to learn?",
				"added": 1597594538
			},
			{
				"comment_id": 37,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597594735
			}
		],
		"1597577135_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 35,
				"body": "> [adrenochrome](#comment_28_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Watch interview with Aaron Russo about how the global elites want to enslave us with cashless & RFID: https://www.youtube.com/watch?v=GFgz8w8l1Cs\n\nI've been saying this since 2009 haha\n\nAlso people thought I was quite literally insane until Epstein died and the truth began coming out last year lol :)\n\nNow everyone is talking about what I was trying to expose for about a decade or so...\n\nNo apologies were given by anyone other than my best friend... People are lame sometimes :P",
				"added": 1597594711
			},
			{
				"comment_id": 36,
				"body": "This is OTB Technologies confirming all posts made by OTBTechnolgies3 are authentic and that my device from which I had been posting was not compromised. This post is being made from a post-quantum secure system.\n\nIf any content posted by the account OTBTechnologies3 ever seems questionable, please ask for my identity to be verified by this account. If no verification by this account (and this account ONLY) occurs within 24-48 hours, then all posts made by OTBTechnologies3 (or any other similar IDs) should be deemed irrelevant. Thank you! :)",
				"added": 1597594716
			},
			{
				"comment_id": 51,
				"body": "> [stopjoggersnow](#comment_3_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC): It would be a real shame if the goyim started just using whatever fucking currency they want.\n\nIAM Sofa King Wee Todd Edd says, \"Monero...\"\n\nxD",
				"added": 1597874849
			}
		],
		"1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 53,
				"body": "> [stopjoggersnow](#comment_1_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC): All censorship is bad. It is always a backdoor that leads to further and further censorship until everything is a complete shithole just like the clearnet. Look at the clearnet these days. It's completely and totally disgusting. There is zero difference of opinion. I dislike spam and all, but it will always be taken over and used by others for nefarious purposes. \"Safety\" is an illusion and \"usability\" is a buzzword.\n\nRight. I think this is what WWG1WGA was getting at...\n\nI can literally circumvent all government regulations (even the UN) and overthrow all of them if I wanted based on my education. The only thing stopping me is my conscious which tells me this is wrong; and the only reason I know how to do this is because the US Government infringed upon my rights in the first place... Soooo... Yeah... :)",
				"added": 1597875053
			},
			{
				"comment_id": 55,
				"body": "> [geekless10](#comment_1_12PZt1S4yo8R3U46XFTnreGTjAhThDppe4): vel moderation is possible.\n\nThis does make sense, but as WWG1WGA said, people will begin to shift away from this platform if this is done in favor of other platforms that actually respect their basic human rights as spelled out by the United Nations...\n\n#JustMyTwoCents",
				"added": 1597875252
			},
			{
				"comment_id": 56,
				"body": "> [otbtechnologies](#comment_54_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Rep [...]\n\nYour models of censorship would further empower me...\n\nThink about it before proceeding...\n\nI've had a decade to plan....\n\n#t3hWinZ\n#WWG1WGA\n#QArmy",
				"added": 1597875335
			},
			{
				"comment_id": 59,
				"body": "Oh... Right...\nShout out https://OTB-Technologies.com\n\n#ShotsFired :)",
				"added": 1597875861
			},
			{
				"comment_id": 60,
				"body": "> [thorburn](#comment_108_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): You guys seem to think that moderation of a forum equates to censorship on a global level which is retarded. [...]\n\nOhhh...\n\nOkay... Sorry, I fried a lot of drains back in the day and so my drain is a little slow sometimes but eventually it thinks good and stuff... you know... the struggle is really real && it be like dat sometimes doe! O_o\n\nAnyway, yeah so it would be like Omegle... Uncensored vs Censored Sections seems legit...\n\nGotta be by choice though...\n\nElsewize fuck this place fr fr lol :)",
				"added": 1597883611
			},
			{
				"comment_id": 61,
				"body": "Problem is then the uncensored section usually is nothing but dudes wanking... smh...\n\nAnd the censored section is full of stupid ads and no real people...\n\nAt least on omegle xD\n\nHere would probably be people like me in uncensored who just like to speak freely.... From what I have seen...\n\nI have yet to see ANY illegal content here...\n\nAnd the censored would be all the Leftists... Sort of like Facebook is now... haha :P\n\nSo, again... I think I have to agree with WWG1WGA: This is a tyrannical concept formed based on control issues...",
				"added": 1597883806
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 63,
				"body": "http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/  -  8Kun/8Chan\n\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA  -- MillChan\n\nMay take a bit to load and maybe have to reload depending, but still useful...\n\nI get shadow banned on 4Chan now, but I feel like my content would be acceptable on 8Kun haha :)\n\nKinda hard to get shadow banned on 4Chan, but I apparently have this way with words sometimes... :P\n\nI can always get around it, but I am too lazy lol...\n\nThey never full ban me though oddly enough, but even if they did I could circumvent it haha :D",
				"added": 1597915838
			},
			{
				"comment_id": 64,
				"body": "> [marcusfinch](#comment_24_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): How is that even possible unless you namefag or tripfag?\n\nI have no idea, but last time I even bothered only some of my posts were allowed.\n\nThe others never showed up.\n\nIt was as if a moderator was watching the submissions based on the IP I was using at the time lol\n\nWhatever. I was just using it for advertising anyway so idc. Meh.\n\nNone-the-less, that _is_ in fact censorship and shouldn't be tolerated... #My2Cents",
				"added": 1597974136
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 65,
				"body": "> [wwg1wga](#comment_34_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Exactly.Fuck all the Socialist and Communists on here that say otherwise. Fr fr... :-S\n\nDude just ignore them. They are clearly subservient slaves to the system, and as such they will never truly understand anything going on in the world today. Some people just want to be controlled by the elite, and it would appear that geekless is one of them. Just look at the fact that 80% of people posting in this thread are in support of our views on the topic. Just let it go dude. Worst case scenario I use my influence to divert all traffic from this service to a service that I am running. Only a fool would bother argue with these subhumans.\n\nJust something to think about my friend.\nThanks for your time and welcome to ZeroNet! :-)",
				"added": 1597974362
			},
			{
				"comment_id": 67,
				"body": "> [wwg1wga](#comment_36_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): Okay. Now I am understanding more why this might be necessary. Thanks!\n\nYeah, whatever.\n\nYou're welcome. Just read the fucking user manual before speaking with these subhumans again ffs... \n\nSmh... Sigh...\n\nEveryone gets one.... I'm not fucking saving you again though; you fucking idiot... :-S\n\nhttps://www.amazon.com/Psyop-Military-Psychological-Operations-Manual/dp/0557052564",
				"added": 1598050877
			},
			{
				"comment_id": 68,
				"body": "> [rhoticshwa](#comment_4_1HjJqWY2ECyyUE1F2sJSuXMRmU39uMNt6s): Take everything and divide it up for everyone, like the communism of decentralized internet ^^\n\nDecentralization is not communistic in nature whatsoever.\n\nIts discouraging to hear so many proponents of decentralization on ZeroTalk refer to it as a communist ideology.\n\nDecentralization serves the purpose of eliminating the possibility of government corruption in both communist as well as totalitarian regimes. Calling decentralization a communist ideology is like saying Bitcoin is communist.\n\nBitcoin is not communist in nature. Bitcoin was invented to replace the traditional banking system that was taken over by the Rothschild Family so they could have complete and total control over mankind. So, one can't really call these decentralized concepts communist in nature since they work to defeat corruption regardless of the sociopolitical climate in which their users find themselves submersed in whether by their choice or through birth.",
				"added": 1598076628
			},
			{
				"comment_id": 69,
				"body": "> [geekless](#comment_232_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Nice attitude to take ZeroNet down, by the way. [...]\n\nJust read this: makes sense now.\n\nSorry to be such a douche; I've been having a rough week trying to deal with damned near everyone still buying into the brainwashing they've been being subjected to their whole lives instead of waking up to save mankind.\n\nThe stress is real man... :(",
				"added": 1598076837
			}
		],
		"1598036610_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 70,
				"body": "> [rhoticshwa](#comment_3_1HjJqWY2ECyyUE1F2sJSuXMRmU39uMNt6s): Honestly, if you've got to talk to someone, text them. If they don't want you texting them, tell them you don't want to use the data-harvesting hell that is Facebook.\n\nExactly. Anyone I have tried this with tells me they totally get it dude.",
				"added": 1598076917
			}
		]
	},
	"comment_vote": {
		"9_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS": 1,
		"24_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"14_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"101_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"40_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"594_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"761_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"2396_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"592_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"24_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"4_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"3_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"23_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"2_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": 1,
		"22_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"21_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"19_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"18_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"17_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"16_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"15_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"25_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"9_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"8_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"27_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"10_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"28_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1_17LwqmdXGhvTyRMvsjfogExmfqQaUrnSym": 1,
		"51_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"50_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"49_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"48_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"47_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"46_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"45_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"16_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"52_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"53_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"17_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"18_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"54_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"62_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"63_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"61_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"60_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"59_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"58_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"57_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1,
		"41_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"40_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"39_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"38_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"86_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"5_17vKwCbzk55MregPtemumGZ2yw2CHjRk8i": 1,
		"5_1LSqe8TAgtK7g4mmm2pXvZDwf9Z9KgajnF": 1,
		"38_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"33_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"32_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"31_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"8_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"7_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"20_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"193_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"95_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"28_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"14_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"26_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"25_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"24_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"16_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"34_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"41_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"42_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"43_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"44_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"45_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"27_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"40_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"39_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"30_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"630_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"103_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"102_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"101_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"47_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"47_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": 1,
		"776_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"104_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"4_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC": 1,
		"106_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"3_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC": 1,
		"1_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC": 1,
		"8_1JR6zGbCYKJZhN7tvc5qZqnFDgG7wAt8nC": 1,
		"1_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"18_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"8_1NyRWK8Lnvfh58CyJhq1tAXpSr9XXhdLwG": 1,
		"178_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"3_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"65_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"34_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": 1,
		"33_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF": 1
	}
}