{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1601625369,
			"title": "What is the best smartphone hardware today?",
			"body": "What are the criteria important to you ? I like it light... for me the lightest... solid (can crash on hard floor and survive)... water resistant (can dive a little)... energy efficient and longevity... not too big, must feet in jeans pocket...\n\nthis isn't a discussion about software or os... purely hardware, physical.",
			"added": 1601625368
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 1,
				"body": "the nsa is not the enemy : the nsa is part of the dod. the dod job is to defend the constitution and bill of rights of the united states of america, which among those is the 1st amendement.\n\nand so rather than use \"black ops\" to steal their datas (videos, reports etc etc etc), just ask !",
				"added": 1601624796
			},
			{
				"comment_id": 8,
				"body": "> [thorburn](#comment_150_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): The digital domain has been established as the new battle ground numerous times by governments and their military leaders. \n\nhow could it not become so? please stop the utopia.\n\nThe NSA, DoD etc sworn an oath to defend and protect the constitution of the united states of america against all foreign and domestic enemies.\n\nWhat is the allegiance of the twitter and goolags of the world? not to the constitution for sure.\n\nMy hope is that frontline forces at the dod have seen what it means when civilization breaks down... what the foreign world idealized by the tech gurus is really, where none dare to go, where none but them can come back alive from...\n\nin short the dods goes to where the goolags and co censors certainly rightfully the datas (humans slavery, child rapes, organ harvesting usine, fields of war, razed cities) and to achieve that, among others is the nsa role to provide safe communication system...\n\nfree speech is inherently a military value... if you start to be censored on the battlefield what  is your chance of survival? if you aren't allowed to say that there is a fucking recon teams from the others side, what are you but dead walkings?\n\ndo you think that the tech gods, like dorsey can survive against a foreign professional death squad? what zuckerberg has 64 guards now? \n\nand if the nsa wants you down, they just ask the american dead squads to drop... like in pakistan near a military base, or many others places we will never know... \n\nedit : most military contractors aren't idiots, and those who seek to become the empire are simply dealt with, by death.",
				"added": 1601707696
			}
		],
		"1601562719_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 2,
				"body": "p2p open source decentralized exchange to trade p2p decentralized open source shared ledgers :)",
				"added": 1601624844
			}
		],
		"1601063471_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 3,
				"body": "bitmessage",
				"added": 1601624881
			}
		],
		"1586632143_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "> [jorden](#comment_2_116EQBujbsogJRh72LXNtMSmLbUK2Y3V57): Not just 5G, actually..\n\ntechnically and biologically, it's the electro magnetic fields, and that they are pulsated at high frequency with a deep penetration capabilities... if you think those \"wireless\" energy link can go through wall... imagine your cells and or the billions of living things inside you when they are exposed to those flux... did you know, neuro/nerve system... electricity... bio energetic water based beings... \n\na little term calcium ions... \n\npersonally, I don't seek to have my body expose to pulsated electromagnetic fields... or electro smog...\n\nit ain't because you can't see it  that it ain't dangerous...\n\nfor those in the LA area... micowave warfare... never heard of it? yeah...\n\n\"we are gonna fry this motherfucker\" aka put a trafficed microwave under his bed and fry him at night... boiling frog...\n\nemf is shit...\n\nand few believe, what they can't see... ahaha... ^ ^",
				"added": 1601625127
			},
			{
				"comment_id": 5,
				"body": "the good news is that it's physically impossible to shield those boxes on mast from the good old lead... and funnier, if the emf emitting box is shot precisely, there is then the awesome possibility to get a live kill... \n\nand the more technicians get killed, headshoted and murdered, while doing their jobs (like the nazis at auschwitz btw), the higher will the few remaining get paid, until the last throw the towel, and realize that even for 1 million dollar per day he won't fucking get to replace the next box.\n\nthen it box snipping can even be used to attract the henchmen of the regime...\n\npop the box.\nwait for the \"cops\"\npop the cops.\n\nWhat will the taliban council decide regarding 5g installation, and even the mighty american army with trillions of dollars will not be able to impose their will for long or wide.\n\nin a world where the corrupt rape children on islands with impunity, print money for themselves to finance their tyranny, disregards our will, like of those children raped, we have to ask ourselves, are we slaves or free men?\n\nthey see us as slaves, and have decided we are to be expired.\n\nare they right?\n\nafter all it's like forced vaccination, they don't care about our will, they have theirs, and they seek to eradicate ours... like those children.",
				"added": 1601697570
			}
		],
		"1601654430_1HtMCxNJ6vrZn5ckfLtbUYzTHgTKBDSvbx": [
			{
				"comment_id": 6,
				"body": "what did he do?",
				"added": 1601697608
			}
		],
		"1601625369_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR": [
			{
				"comment_id": 7,
				"body": "> [reichama](#comment_33_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe): \n\nI really like your remarks ! thanks for sharing them... yeah battery life is crucial. My point of view about software, os and programs, is that it's always easier to resolve it later... \n\nblue light, do they intentionally seek to reduce our fields of vision, to have us a more captive slaves, digital and in the realm? I wouldn't be surprised of such intentions by google...\n\nmore seriously, the os update for androids phone are catastrophic... but that's another topic...\n\nfor me, too big of screen, I don't want to have a case to carry it around... and hand size, I want to be able to reach anywhere on the screen with one hand... I guess you have big hands.\n\nyeah the jackwars... water resistance and thickness of the plug... I ain't against a new slimer standard, but not each brand with it's little proprietary system, filling the landfills of the world to make a cent more... like irresponsible corporate leech earth destroyers.\n\n> [stef58](#comment_3_1DFditCMdpMNrzNxNrsfiHyyUD69dsHkBB): \n\npowerfull... I get that... most comes from the programming side... software bloating, specially with spyware... yeah about intentional slowing... that's why I only mentionned hardware... because with open source software, it's possible to slim the code to highly efficiency, giving speech and security.\n\n\n\n> [thorburn](#comment_151_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): \n\nyeah that's maybe not a stupid strategy... the dual phone... one basic phone (btw they can be hacked too) and a portable computer... \n\nmy optic is more of a survival phone that will be thrown away in the flee against the mandatory vaccine teams... \n\nonce air superiority is achieved against the armies of the forced vaxxers, something useful for a long time...",
				"added": 1601698261
			}
		],
		"1601047977_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 9,
				"body": "justin bieber air style...",
				"added": 1601795034
			}
		],
		"1601749775_19J2Ft42BgLYFGnSsSxHAzkHb2Uv8ZtCky": [
			{
				"comment_id": 10,
				"body": "his \"accomplice\" thing, let me a little bit dubious... what does he means...\n\nyeah 2/10 ni sick children... those stories need sick, dead children or even better dying children...\n\nmaybe his uncle is a prince :).",
				"added": 1601795135
			}
		]
	},
	"comment_vote": {}
}