{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1612401936_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "is this one of those situations where, if you report the actual effectiveness you end up accidentally committing suicide by falling from a high rooftop?",
				"added": 1612407755
			}
		],
		"1612717482_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 2,
				"body": "yeah but it also makes your nuts shrivel up into little raisins.",
				"added": 1612795793
			}
		],
		"1613142823_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": [
			{
				"comment_id": 3,
				"body": "it's ok...  Trump will be pres again in 2024.",
				"added": 1613148762
			}
		],
		"1619248411_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd": [
			{
				"comment_id": 4,
				"body": "Makes sense that species acclimated to ice age earth would have problems surviving in the Holocene warming period.  Every day species go extinct and come into being.  This is business as usual.  It does not represent some kind of crisis for the biosphere.",
				"added": 1620060930
			},
			{
				"comment_id": 7,
				"body": "um...  I call bullshit on this.  We do not know how many species have lived on earth.  We do not know how many species currently live on earth.  We cannot know for certain that any organism we call \"extinct\" is actually extinct.  It would be impossible for anyone to know if the number of organisms going extinct is at some all time record or even what the specific number is.\n\nSecond, mankind has permission to interact with life on earth because humans ARE AN EXAMPLE OF life on earth.   We are going to eat stuff and blunder across the globe just like bears blunder across the forest.  Here is a question for you:  how many species do YOU think should be alive on earth currently?  Why should anyone else care what your magic number is?\n\nI don't want to dump toxic chemicals into the environment, I'm not suicidal.  But you cannot claim to know what you claim to know.  I'm a rational environmentalist.",
				"added": 1620449402
			}
		],
		"1619906359_1HGKXBnrJs6kTo2QqTUMYEicDsSwrYqwKN": [
			{
				"comment_id": 5,
				"body": "> [deuxzaron](#comment_141_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Take to laundromat. Drop in washer. Hit delicate cycle. profit.\n\nMild soap, no spin cycle.",
				"added": 1620061639
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 6,
				"body": "I too do not like it when they try to turn the frikkin frogs gay.",
				"added": 1620061716
			}
		]
	},
	"comment_vote": {}
}