{
    "article": [
        {
            "title": "Assyrian captivity",
            "text": "{{Redirect|Israelite diaspora|modern expats originating in the State of Israel|Yerida}}\n\n[[File:Deportation of Jews by Assyrians.svg|thumb|300px|Deportation of the Northern Kingdom of Israel by the Assyrian Empire.]]\nThe '''Assyrian captivity''' (or the '''Assyrian exile''') is the period in the [[history of Ancient Israel and Judah]] during which several thousand [[Israelites]] of ancient [[Samaria]] were resettled as captives by Assyria. This is one of the many instances of [[Resettlement policy of the Neo-Assyrian Empire|forcible relocations implemented by the Neo-Assyrian Empire]]. The Northern [[Kingdom of Israel (Samaria)|Kingdom of Israel]] was conquered by the [[Neo-Assyrian]] monarchs, [[Tiglath-Pileser III]] (Pul) and [[Shalmaneser V]]. The later Assyrian rulers [[Sargon II]] and his son and successor, [[Sennacherib]], were responsible for finishing the twenty-year demise of Israel's northern ten-tribe kingdom, although they did not overtake the [[Kingdom of Judah|Southern Kingdom]]. [[Assyrian siege of Jerusalem|Jerusalem was besieged]], but not taken. The tribes [[Population_transfer#Ancient_world|forcibly resettled]] by Assyria later became known as the [[Ten Lost Tribes]].\n\n== Biblical account ==\nThe captivities began in approximately [[740s BC|740 BCE]] (or 733/2 BCE according to other sources).<ref name=\"ReferenceA\">The Books of Kings and Chronicles modern view by [[Umberto Cassuto]] and [[Elia Samuele Artom]] (1981)</ref>\n<blockquote>And the God of Israel stirred up the spirit of Pul king of Assyria, and the spirit of Tilgathpilneser king of Assyria, and he carried them away, even the Reubenites, and the Gadites, and the half tribe of Manasseh, and brought them unto Halah, and Habor, and Hara, and to the river Gozan, unto this day. ({{bibleverse|1 Chronicles|5:26}})</blockquote>\n\n<blockquote>In the days of Pekah king of Israel came Tiglathpileser king of Assyria, and he took Ijon, and Abelbethmaachah, and Janoah, and Kedesh, and Hazor, and Gilead, and Galilee, all the land of Naphtali, and carried them captive to Assyria. ({{bibleverse|2 Kings|15:29}})</blockquote>\n\nIn [[720s BC|722 BCE]], nearly ten to twenty years after the initial deportations, the ruling city of the Northern Kingdom of Israel, [[Samaria (ancient city)|Samaria]], was finally taken by [[Sargon II]] after a three-year siege started by [[Shalmaneser V]].\n\n<blockquote>Against him came up [[Shalmaneser V|Shalmaneser]] king of [[Assyria]]; and Hoshea became his servant, and gave him presents.\nAnd the king of Assyria found conspiracy in Hoshea: for he had sent messengers to So king of Egypt, and brought no present to the king of Assyria, as he had done year by year: therefore the king of Assyria shut him up, and bound him in prison.\nThen the king of Assyria came up throughout all the land, and went up to Samaria, and besieged it three years.\nIn the ninth year of Hoshea the king of Assyria took [[Samaria]], and carried Israel away into Assyria, and placed them in Halah and in Habor by the river of Gozan, and in the cities of the Medes. ({{bibleverse|2 Kings|17:3–6}})</blockquote>\n\n<blockquote>And the king of Assyria did carry away Israel unto Assyria and put them in Halah and in Habor by the river of Gozan, and in the cities of the Medes: because they obeyed not the voice of the {{Lord}} their God, but transgressed his covenant, and all that Moses the servant of the {{Lord}} commanded and would not hear them, nor do them. ({{bibleverse|2 Kings|18:11–12|KJV}})</blockquote>\n\nThe term \"cities of the Medes\" mentioned above may be a corruption from an original text \"Mountains of [[Medes|Media]]\".<ref>[http://www.searchgodsword.org/enc/isb/print.cgi?number=T4089 Hara], entry by W. Ewing in the ''[[International Standard Bible Encyclopedia]]''</ref><ref>Rea, Cam. ''The Assyrian Exile: Israel's Legacy in Captivity'', p. 47 {{ISBN|1-60481-173-0}}</ref>\n\nThe [[Books of Kings|Book of Kings]] states several times that the entire people of the Kingdom of Israel had been taken into exile by the Assyrians. Some believe that the [[Books of Chronicles]] information about the fate of the Northern Kingdom adds up differently. What is often cited is 2nd Chronicles, Chapter 15, which mentions that there had been people from the hill-country cities of [[Tribe of Ephraim|Ephraim]] and [[Tribe of Manasseh|Manasseh]] who were captured by the Judean king, [[Asa of Judah]]. And Asa, sojourning among the Judean kingdom population, returned practicing the [[Hebrews|Hebrew]] belief. However, this is a mis-characterization of the events. Since those scriptures clearly declare that it was at a time when the Northern Kingdom was still intact, this happened in an era before the Assyrian Captivity.\n\n<blockquote>And when Asa heard these words, even the prophecy of Oded the prophet, he took courage, and put away the detestable things out of all the land of Judah and Benjamin, and out of the cities which he had taken from the hill-country of Ephraim; and he renewed the altar of the LORD, that was before the porch of the LORD.\nAnd he gathered all Judah and Benjamin, and them that sojourned with them out of Ephraim and Manasseh, and out of Simeon; for they fell to him out of Israel in abundance, when they saw that the LORD his God was with him.\nSo they gathered themselves together at Jerusalem in the third month, in the fifteenth year of the reign of Asa. ({{bibleverse|2 Chronicles|15:8–10|HE}})</blockquote>\n\nAccording to 2nd Chronicles, Chapter 30, there is evidence that at least some people of the Northern Kingdom of Israel were not exiled. These were invited by king [[Hezekiah]] to keep the [[Passover]] in a feast at [[Jerusalem]] with the Judean population. (The holiday was set one month forward from its original date.) Hezekiah sent his posts to spread the word among the remnant of the Northern kingdom; the posts were mocked during their visit to the country of Ephraim, Manasseh and Zebulun. However, some people of Asher and Manasseh and of Zebulun humbled themselves and came to Jerusalem. In a later part of the chapter, even people from the [[Tribe of Issachar]] and the strangers that \"came out from the land of Israel\" were said to take part in the passover event. Biblical scholars such as [[Umberto Cassuto]] and Elia Samuele Artom claimed that Hezekiah might have annexed these territories, in which inhabitants of the Kingdom of Israel remained, into his own kingdom.\n<blockquote>And Hezekiah sent to all Israel and Judah, and wrote letters also to Ephraim and Manasseh, that they should come to the house of the LORD at Jerusalem, to keep the passover unto the LORD, the God of Israel. ({{bibleverse|2 Chronicles|30:1|HE}})</blockquote>\n\n<blockquote>So they established a decree to make proclamation throughout all Israel, from Beer-sheba even to Dan, that they should come to keep the passover unto the LORD, the God of Israel, at Jerusalem; for they had not kept it in great numbers accordingly, as it is written.\nSo the posts went with the letters from the king and his princes throughout all Israel and Judah, according to the commandment of the king, saying: 'Ye children of Israel, turn back unto the LORD, the God of Abraham, Isaac, and Israel, that He may return to the remnant that are escaped out of the hand of the kings of Assyria.\nAnd be ye not like your fathers and like your brethren who acted treacherously against the LORD, the God of their fathers, so that He delivered them to desolation, as ye see.\nNow be ye not stiffnecked as your fathers were, but yield yourselves unto the LORD and enter into His sanctuary which He hath sanctified for ever; and serve the LORD your God that His fierce anger may turn away from you.\nFor if ye turn back unto the LORD, your brethren and your children shall find compassion before them that led them captive, and shall come back into this land; for the LORD your God is gracious and merciful, and will not turn away His face from you if ye return unto Him.' ({{bibleverse|2 Chronicles|30:5–9|HE}})</blockquote>\n\n<blockquote>So the posts passed from city to city through the country of Ephraim and Manasseh, even unto Zebulun; but they laughed them to scorn, and mocked them.\nNevertheless certain men of Asher and Manasseh and of Zebulun humbled themselves, and came to Jerusalem. ({{bibleverse|2 Chronicles|30:11–12|HE}})</blockquote>\n\n<blockquote>\nFor a multitude of the people, even many of Ephraim and Manasseh, Issachar and Zebulun, had not cleansed themselves, yet did they eat the passover otherwise than it is written. For Hezekiah had prayed for them, saying: 'The good LORD pardon ...' ({{bibleverse|2 Chronicles|30:18|HE}})\n</blockquote>\n\n<blockquote>And all the congregation of Judah, with the priests and the Levites, and all the congregation that came out of Israel, and the strangers that came out of the land of Israel, and that dwelt in Judah, rejoiced.\nSo there was great joy in Jerusalem; for since the time of Solomon the son of David king of Israel there was not the like in Jerusalem. ({{bibleverse|2 Chronicles|30:25–26|HE}})</blockquote>\n\nIn 2nd Chronicles, Chapter 31, it is said that the remnant of the Kingdom of Israel returned to their homes, but not before destroying Ba'al and Ashera places of Idol worship left in \"all Judah and Benjamin, in Ephraim also and Manasseh\".\n\n<blockquote>Now when all this was finished, all Israel that were present went out to the cities of Judah, and broke in pieces the pillars, and hewed down the Asherim, and broke down the high places and the altars out of all Judah and Benjamin, in Ephraim also and Manasseh, until they had destroyed them all. Then all the children of Israel returned, every man to his possession, into their own cities. ({{bibleverse|2 Chronicles|31:1|HE}})</blockquote>\n\n== Assyrian cuneiform ==\nAssyrian cuneiform states that 27,290 captives were taken from Samaria,<ref name=Luckenbill>Luckenbill, Daniel David. ''Ancient Records of Assyria and Babylon'', Oriental Institute University of Chicago, Chicago, Illinois, 1926. {{ISBN|1-85417-049-X}}</ref> the capital of the Northern [[Kingdom of Israel (Samaria)|Kingdom of Israel]], by the hand of [[Sargon II]].\n\nSargon records his first campaign on the walls of the royal palace at Dur-Sharrukin (Khorsabad):\n\n<blockquote>''In my first year of reign *** the people of Samaria *** to the number of 27,290 ... I carried away.\n\nFifty chariots for my royal equipment I selected. The city I rebuilt. I made it greater than it was before.\n\nPeople of the lands I had conquered I settled therein. My official (Tartan) I placed over them as governor.'' (L.ii.4.)<ref name=Luckenbill/></blockquote>\n\nThe description of the final defeat of the Northern Kingdom of Israel above appears to be a minor event in Sargon's legacy. Some historians attribute the ease of Israel's defeat to the previous two decades of invasions, defeats, and deportations.\n\nSome estimates assume a captivity numbering in the hundreds of thousands, minus those who died in defense of the kingdom and minus those who fled voluntarily before and during the invasions.\n\nHowever, it has also been suggested that the numbers deported by the Assyrians were rather limited and the bulk of the population remained ''in situ''.<ref>{{cite web|url=http://www.adath-shalom.ca/samaritan_origin.htm |title=Archived copy |accessdate=2011-02-13 |deadurl=yes |archiveurl=https://web.archive.org/web/20101119075635/http://adath-shalom.ca/samaritan_origin.htm |archivedate=2010-11-19 }}</ref> There is also evidence that significant numbers fled south to the [[Kingdom of Judah]].\n\n== Return ==\nUnlike the [[Kingdom of Judah]], which was able to return from its [[Babylonian captivity]], the ten tribes of the Northern Kingdom never had a foreign edict granting permission to return and rebuild their homeland. Many centuries later, rabbis of the restored Kingdom of Judah were still debating the return of the lost ten tribes.<ref>[[Mishnah]], Sanhedrin 110b</ref> <ref>{{cite web|url=https://www.sefaria.org/Mishnah_Sanhedrin.10.2?lang=bi&with=all&lang2=en|title=Mishnah Sanhedrin 10:2|website=www.sefaria.org}}</ref> However, Assyria had been conquered by Babylon, and Babylon had been conquered by the Medo-Persians.\n\nAccording to the [[Books of Chronicles]] chapter 9 line 3, the Israelites, who took part in [[The Return to Zion]], are stated to be from the [[Tribe of Judah]] alongside the [[Tribe of Simeon]] that was absorbed into it, the [[Tribe of Benjamin]], the [[Levite|Tribe of Levi]] (Levites and [[Kohen|Priests]]) alongside the tribes of [[Tribe of Ephraim|Ephraim]] and [[Tribe of Manasseh|Manasseh]], which according to the [[Books of Kings|Book of Kings]] 2 Chapter 7 were supposedly exiled by the Assyrians (The Biblical scholars [[Umberto Cassuto]] and Elia Samuele Artom claimed these two tribes' names to be a reference to the remnant of all Ten Tribes that was not exiled and absorbed into the Judean population).<ref name=\"ReferenceA\"/>\n\n<blockquote>And in Jerusalem dwelt of the children of Judah, and of the children of Benjamin, and of the children of Ephraim and Manasseh. This particular verse is often misconstrued, since the obvious declaration being made in {{bibleverse|1|Chronicles|9:1|HE}} are that of a genealogical reference. The clear indication is seen when directing the readers attention to {{bibleverse|1|Chronicles|9:2|HE}} when mentioning the Nethinims of which were a people conquered by Joshua ({{bibleverse|Joshua|9:27|HE}}. This thereby dictates that it's referring to a completely different time and era, as further seen with the description in verse 2 where it indicates that the Israelites were gaining their land-designated possessions attributed to their God YHWH and his General in charge Joshua. ({{bibleverse|1|Chronicles|9:3|HE}})</blockquote>\n\nThe scriptures of the titled \"Old Testament\" are not accurately complete without the records of those Hebrew writers that penned them. This points to the complete records that declare the clarity of the Grecian conquests of the Judeans during and after the reign of Alexander, as indicated by the book of Maccabbees.<ref>{{cite web|url=http://www.kingjamesbibleonline.org/1-Maccabees-Chapter-1/|title=1 MACCABEES CHAPTER 1 KJV|website=www.kingjamesbibleonline.org}}</ref>\nThe historical accuracy by the prophet Ezra is complete only when the details of the Apocrypha's 1st and 2nd Esdras are referenced, since there is where the complete history of the dispersion of the Northern Kingdom tribes is seen, in 2 Esdras 13:40–48.<ref>{{cite web|url=http://www.kingjamesbibleonline.org/book.php?book=2+Esdras&chapter=13&verse=40|title=2 ESDRAS CHAPTER 13 KJV|website=www.kingjamesbibleonline.org}}</ref>\n\n== See also ==\n*[[Assyria]]\n*[[Babylonian captivity]]\n*[[Hoshea]]\n*[[Ten Lost Tribes]]\n\n== References ==\n{{reflist}}\n\n==Further reading==\n*Keller, Werner. ''The Bible as History''  {{ISBN|0-281-04544-5}}\n*[[Book of Isaiah]] {{bibleverse-nb||Isaiah|36:1-22|HE}}, {{bibleverse-nb||Isaiah|37:1-38|HE}}, {{bibleverse-nb||Isaiah|7:1-20|HE}}, {{bibleverse-nb||Isaiah|8:1-23|HE}}, {{bibleverse-nb||Isaiah|9:1-20|HE}}, {{bibleverse-nb||Isaiah|10:1-34|HE}}, {{bibleverse-nb||Isaiah|11:1-16|HE}}, {{bibleverse-nb||Isaiah|17:1-14|HE}}, {{bibleverse-nb||Isaiah|19:21-25|HE}}, {{bibleverse-nb||Isaiah|38:1-22|HE}}\n\n[[Category:Ancient Israel and Judah]]\n[[Category:Books of Kings]]\n[[Category:8th-century BC in Assyria]]\n[[Category:Ten Lost Tribes]]\n[[Category:Books of Chronicles]]",
            "slug": "assyrian-captivity",
            "date_updated": 1537053306914,
            "imported": "https://en.wikipedia.org/wiki/Assyrian captivity"
        }
    ]
}