{
    "article": [
        {
            "title": "Halakha",
            "text": "{{more footnotes|date=March 2018}}\n{{Judaism|law}}\n'''''Halakha''''' ({{IPAc-en|h|ɑː|ˈ|l|ɔː|x|ə}};<ref>[http://dictionary.reference.com/browse/halacha \"Halacha\"]. ''[[Random House Webster's Unabridged Dictionary]]''.</ref> {{lang-he-n|הֲלָכָה}}, {{small|[[Sephardic Hebrew|Sephardic]]:}} {{IPA-he|halaˈχa|}}; also [[Hebrew transliteration|transliterated]] as '''''halacha''''', '''''halakhah''''', '''''halachah''''' or '''''halocho''''') ({{small|[[Ashkenazic Hebrew|Ashkenazic]]:}} {{IPA-he|haˈloχo|}}) is the collective body of [[Judaism|Jewish]] [[religious law]]s derived from the [[Torah|Written]] and [[Oral Torah]]. It is based on biblical laws or \"commandments\" (''[[Mitzvah|mitzvot]]'') (traditionally numbered as [[613 commandments|613]]), subsequent [[Talmud]]ic and [[rabbinic law]], and the customs and traditions compiled in the many books, one of the most famous of which is the 16th-century ''[[Shulchan Aruch]]'' (literally \"Prepared Table\").\n\n''Halakha'' is often translated as \"Jewish Law\", although a more literal translation might be \"the way to behave\" or \"the way of walking\". The word derives from the [[Semitic root|root]] that means \"to behave\" (also \"to go\" or \"to walk\"). ''Halakha'' guides not only religious practices and beliefs, but also numerous aspects of day-to-day life.\n\nHistorically, in the [[Jewish diaspora]], ''halakha'' served many Jewish communities as an enforceable avenue of law – both [[Civil law (legal system)|civil]] and [[religious law|religious]], since no differentiation exists in classical Judaism. Since the Jewish Enlightenment (''[[Haskalah]]'') and [[Jewish emancipation]] many have come to view the ''halakha'' as less binding in day-to-day life, as it relies on rabbinic interpretation, as opposed to the pure, written words recorded in the [[Hebrew Bible]].\n\nUnder contemporary [[Israeli law]], certain areas of Israeli family and personal status law are under the authority of the rabbinic courts, so are treated according to ''halakha''. Some differences in ''halakha'' itself are found among [[Ashkenazi]], [[Mizrahi]], [[Sephardi]], [[Yemenite Jews|Yemenite]], and other Jews who historically lived in isolated communities, such as in [[Beta Israel|Ethiopia]], reflecting the historic and geographic diversity of various Jewish communities within the Diaspora.\n\n== Etymology and terminology ==\nThe word ''halakha'' is derived from the [[Hebrew language|Hebrew]] root ''halakh'' – \"to walk\" or \"to go\".<ref>{{Cite book|title = Encyclopaedia Judaica | edition = 2nd | volume = 0.8 | chapter = HALAKHAH | author = Louis Jacobs | page = 252}}</ref> Taken literally, therefore, ''halakha'' translates as \"the way to walk\" rather than \"law\". The word ''halakha'' refers to the corpus of rabbinic legal texts, or to the overall system of religious law.\n\nThe term may also be related to [[Akkadian]] ''{{lang|akk|ilku}}'', a property tax, rendered in Aramaic as ''{{lang|arc|halakh}}'', designating one or several obligations.<ref name=\"EBR Schiffman\">{{cite encyclopedia |url=https://www.academia.edu/23518527/Halakhah_-_Modern_Judaism_from_the_Encyclopedia_of_the_Bible_and_its_Reception |title=Halakhah |section=Second Temple and Hellenistic Judaism |first=Lawrence H. |last=Schiffman |encyclopedia=Encyclopedia of the Bible and Its Reception |volume=11 |pages=2–8 |publisher=De Gruyter}}</ref>\n\n''Halakha'' is often contrasted with ''[[aggadah]]'' (\"the telling\"), the diverse corpus of rabbinic [[Exegesis|exegetical]], narrative, philosophical, mystical, and other \"non-legal\" texts.<ref name=\"EBR Schiffman\"/> At the same time, since writers of ''halakha'' may draw upon the aggadic and even mystical literature, a dynamic interchange occurs between the genres. ''Halakha'' also does not include the parts of the [[Torah]] not related to commandments.\n\n''Halakha'' constitutes the practical application of the [[613 mitzvot|613 ''mitzvot'']] (\"commandments\") in the Torah, as developed through discussion and debate in the classical [[rabbinic literature]], especially the [[Mishnah]] and the [[Talmud]] (the \"[[Oral Torah]]\") and as codified in the [[Mishneh Torah]] (\"Repetition of the Torah\") or ''[[Shulchan Aruch]]'' (\"Code of Law\").\n\nBecause ''halakha'' is developed and applied by various halakhic authorities rather than one sole \"official voice\", different individuals and communities may well have different answers to halakhic questions. With few exceptions, controversies are not settled through authoritative structures because during the [[Jewish diaspora]], Jews lacked a single judicial hierarchy or appellate review process for ''halakha''.\n\n''Halakha'' has been developed throughout the generations since before 500&nbsp;[[BCE]], in a constantly expanding collection of rabbinic literature initially consolidated in the Talmud. First and foremost, it forms a body of intricate judicial (rabbinical) opinions, legislation, customs, and recommendations, many of them passed down over the centuries, and an assortment of ingrained behaviors, relayed to successive generations from the moment a child begins to speak. It is also the subject of intense [[Torah study|study]] in ''[[yeshiva]]s''.\n\n== The 613 mitzvot ==\n{{see also|Mitzvah#Mitzvot and Jewish law}}\nBroadly, the ''halakha'' comprises the practical application of the 613 ''mitzvot'' in the Torah, as developed in subsequent rabbinic literature. According to the Talmud (''Tractate Makot''),  613 ''mitzvot'' are in the Torah, 248 positive (\"thou shall\") ''mitzvot'' and 365 negative (\"thou shall not\") ''mitzvot'', supplemented by seven ''mitzvot'' [[Mitzvah#Rabbinical mitzvot|legislated by the rabbis]] of antiquity.\n\n=== Categories ===\n{{Main|Oral Torah|Law given to Moses at Sinai}}\n{{See also|Mitzvah#Rabbinical mitzvot}}\nClassical [[Rabbinic Judaism]] has two basic categories of laws:{{citation needed|date=March 2016}}\n* Laws which are believed to have been revealed by God to the Israelites at Mount Sinai e.g. the Written Torah, also called the [[Law of Moses]], and also elucidations therefrom, known as the [[Oral Torah]]\n* Laws of human origin including rabbinic decrees, interpretations, customs, etc.\n\nThis division between revealed and rabbinic commandments may influence the importance of a rule, its enforcement and the nature of its ongoing interpretation. Halakhic authorities may disagree on which laws fall into which categories or the circumstances (if any) under which prior rabbinic rulings can be re-examined by contemporary rabbis, but all Halakhic Jews hold that both categories exist and that the first category is immutable, with exceptions only for life-saving and similar emergency circumstances.\n\nA second classical distinction is between the Written Law, laws written in the [[Hebrew Bible]], and the Oral Law, laws which are believed to have been transmitted orally prior to their later compilation in texts such as the Mishnah, Talmud, and rabbinic codes.\n\nCommandments are divided into positive and negative commands, which are treated differently in terms of divine and human punishment. Positive commandments ''require'' an action to be performed and are considered to bring the performer closer to God. Negative commandments (traditionally 365 in number) ''forbid'' a specific action, and violations create a distance from God.\n\nA further division is made between ''chukim'' (\"decrees\" – laws without obvious explanation, such as ''[[shatnez]]'', the law prohibiting wearing clothing made of mixtures of linen and wool), ''mishpatim'' (\"judgments\" – laws with obvious social implications) and ''eduyot'' (\"testimonies\" or \"commemorations\", such as the [[Shabbat]] and holidays). Through the ages, various rabbinical authorities have classified some of the 613 commandments in various other ways.\n\nA different approach divides the laws into a different set of categories:{{citation needed|date=March 2016}}\n* Laws in relation to God (''bein adam laMakom'', literally \"between a person and the Place\"), and\n* Laws about relations with other people (''bein adam le-chavero'', literally \"between a person and his friend\").\n\nWithin Talmudic literature, Jewish law is divided into the six orders of the Mishnah, which are categories by proximate subject matter: ''[[Zeraim]]'' (\"Seeds\") for agricultural laws and prayer, ''[[Moed]]'' (\"Festival\"), for the Sabbath and the Festivals, ''[[Nashim]]'' (\"Women\"), dealing primarily with marriage and divorce,'' [[Nezikin]] ''(\"Damages\"), for civil and criminal law,'' [[Kodashim]]'' (\"Holy things\"), for sacrifices and the [[kashrut|dietary laws]], and ''[[Tohorot]]'' (\"Purities\") for ritual purity. However, Talmudic texts often deal with laws outside these apparent subject categories. As a result, Jewish law came to be categorized in other ways in the post-Talmudic period.\n\nIn the major codes of Jewish law, two other main categorization schemes are found. [[Maimonides]]' ''Mishneh Torah'' divides the laws into 14 sections. The codification efforts that culminated in the ''Shulchan Aruch'' divide the law into four sections, including only laws that do not depend on being physically present in the [[Land of Israel]].\n\n=== Sin ===\n[[Judaism]] regards the violation of the commandments, the ''[[mitzvah|mitzvot]]'', to be a sin. The generic Hebrew word for any kind of sin is ''aveira'' (\"transgression\"). Based on the [[Tanakh]] (Hebrew Bible) Judaism describes three levels of sin:{{citation needed|date=March 2016}}\n* ''Pesha'' – an \"intentional sin\"; an action committed in deliberate defiance of God's commandments\n* ''Avon'' – a \"sin of [[lust]] or uncontrollable emotion, committed against one's will, and is not in line with one's true inner desires\". It is a sin done knowingly, but not done to defy God\n* ''Chet'' – an \"unintentional sin\"\n\nRelatedly, the three terms – ''chayyav, patur, mutar'' – in the [[Gemara]] (literally: \"the finished [word]\") and Halakhic codes classify the permissibility of an action or the severity of its prohibition and punishment.{{citation needed|date=March 2016}}\n* ''Chayyav'' (חייב), (literally \"obligated\" or \"must\") means the ones who transgress the prohibition are responsible for their own criminal actions, so ought to pay the price for them.\n* ''Patur'' (פטור) means \"exempt\" of liability to punishment, but the action is forbidden.\n* ''Mutar'' (מותר) means the action is permitted.\n\nJudaism understands that the vast majority of people, aside from those who are termed ''[[Tzadikim]]'' and those termed ''[[Tzadik|Tzadikim gemurim]]'' ([[Hebrew]]: צדיק, \"the righteous\" and \"the completely righteous\"), will succumb to sin in their lives. A sin or a state of sin does not condemn a person to damnation;  a road of ''[[teshuva]]'' ([[Hebrew]]: תשובה; repentance, literally: \"return\") is always present. For some classes of people, this is exceedingly difficult, such as those who commit adultery, as well as those who slander others.\n\nIn earlier days, when ancient Jews had a functioning court system (the ''[[beth din]]'' and the ''[[Sanhedrin]]'' high court), courts were empowered to administer physical punishments for various violations, upon conviction by [[Capital and corporal punishment in Judaism#Stringencies of evidence in capital cases|extremely high standards of evidence]], far stricter than those required in western courts today. These punishments included [[execution]], [[corporal punishment (Judaism)|corporal punishment]], [[incarceration]], and [[excommunication]]. However, since the fall of the [[Second Temple]], executions have been forbidden. Since the fall of the [[Jews and Judaism in Europe|autonomous Jewish communities of Europe]], most other punishments also have been discontinued.\n\nToday, then, one's accounts are reckoned solely by [[God]]. The Talmud says that although courts capable of executing sinners no longer exist, the prescribed penalties continue to be applied by Providence. For instance, someone who has committed a sin punishable by stoning might fall off a roof, or someone who ought to be executed by strangulation might drown.<ref>Ketubot 30b</ref>\n\n=== Gentiles and Jewish law ===\nThe [[Seven Laws of Noah]], also referred to as the Noahide Laws or the Noachide Laws, are a set of imperatives which, according to the Talmud, were given by God as a binding set of laws for the \"children of Noah\" – that is, all of humanity.\n\n== Sources and process ==\n{| style=\"float: right;\" border=\"1\" width=\"400\"\n|- valign=\"top\"\n|+Eras of Jewish law\n|\n* The ''[[Tannaim]]'' (literally the \"repeaters\") are the sages of the ''[[Mishnah]]'' (0–200)\n* The ''[[Amoraim]]'' (literally the \"sayers\") are the sages of the ''[[Gemara]]'' (200–500)\n* The ''[[Savoraim]]'' (literally the \"[[Inductive reasoning|reasoners]]\") are the classical [[Sassanid Empire|Persian]] rabbis (500–650)\n* The ''[[Geonim]]'' (literally the \"prides\" or \"geniuses\") are the rabbis of Sura and Pumbeditha, in Babylonia (650–1038)\n* The ''[[Rishonim]]'' (literally the \"firsts\") are the rabbis of the late medieval period (c. 1038–1563) preceding the [[Shulchan Aruch]]\n* The ''[[Acharonim]]'' (literally the \"lasts\") are the rabbis from roughly 1500 to the present.\n|\n|}\n{{See also|Rabbinic literature}}\nThe development of ''halakha'' in the period before the Maccabees, which has been described as the formative period in the history of its development, is shrouded in obscurity. Y. Baer (in Zion, 17 (1951–52), 1–55) has argued that there was little pure academic legal activity at this period and that many of the laws originating at this time were produced by a means of neighbourly good conduct rules in a similar way as carried out by Greeks in the age of Solon. For example, the first chapter of Bava Kamma, contains a formulation of the law of torts worded in the first person.<ref>{{Cite book|title = Encyclopaedia Judaica | edition = 2nd | volume = 0.8 | chapter = HALAKHAH | author = Louis Jacobs | page = 256}}</ref>\n\nThe boundaries of Jewish law are determined through the Halakhic process, a religious-ethical system of legal reasoning. Rabbis generally base their opinions on the primary sources of ''halakha'' as well as on precedent set by previous rabbinic opinions. The major sources and genre of ''halakha'' consulted include:\n* The foundational Talmudic literature (especially the [[Mishna]] and the [[Talmud|Babylonian Talmud]]) with commentaries;\n** [[Talmudic hermeneutics]]: the science which defines the rules and methods for the investigation and exact determination of the meaning of the Scriptures; includes also the rules by which the Halakhot are derived from and established by the written law. These may be seen as the rules by which early Jewish law was derived.\n** ''[[Gemara]]'' – the Talmudic process of elucidating the ''halakha''\n* The post-Talmudic codificatory literature, such as Maimonides's [[Mishneh Torah]] and the [[Shulchan Aruch]] with its commentaries;\n* Regulations and other \"legislative\" enactments promulgated by rabbis and communal bodies:\n** ''Gezeirah'' (literally \"declaration\"): \"preventative legislation\" of the rabbis, intended to prevent violations of the [[mitzva|commandments]]\n** ''Takkanah'' (literally \"Repair\", meaning also \"Regulation\"): \"positive legislation\", practices instituted by the rabbis not based (directly) on the [[mitzva|commandments]]\n* ''[[Minhag]]'': Customs, community practices, and customary law, as well as the exemplary deeds of prominent (or local) rabbis;\n* The ''[[responsa|she'eloth u-teshuvoth]]'' (responsa, literally \"questions and answers\") literature.\n* ''Dina d'malchuta dina'' (literally \"the law of the king is law\"): an additional aspect of ''halakha'', being the principle recognizing non-Jewish laws and non-Jewish legal jurisdiction as binding on Jewish citizens, provided that they are not contrary to a law in Judaism. This principle applies primarily in areas of commercial, civil and criminal law.\n\nIn antiquity, the ''[[Sanhedrin]]'' functioned essentially as the Supreme Court and legislature (in the US judicial system) for Judaism, and had the power to administer binding law, including both received law and its own rabbinic decrees, on all Jews—rulings of the Sanhedrin became ''halakha''; see [[Oral law#Oral law in Judaism|Oral law]]. That court ceased to function in its full mode in 40 CE. Today, the authoritative application of Jewish law is left to the local rabbi, and the local rabbinical courts, with only local applicability. In branches of Judaism that follow ''halakha'', lay individuals make numerous ad-hoc decisions, but are regarded as not having authority to decide certain issues definitively.\n\nSince the days of the Sanhedrin, however, no body or authority has been generally regarded as having the authority to create universally recognized precedents. As a result, ''halakha'' has developed in a somewhat different fashion from Anglo-American legal systems with a Supreme Court able to provide universally accepted precedents. Generally, Halakhic arguments are effectively, yet unofficially, peer-reviewed. When a rabbinic ''[[posek]]'' (literally \"he who makes a statement\", \"decisor\") proposes an additional interpretation of a law, that interpretation may be considered binding for the posek's questioner or immediate community. Depending on the stature of the posek and the quality of the decision, an interpretation may also be gradually accepted by other rabbis and members of other Jewish communities.\n\nUnder this system there is a tension between the relevance of earlier and later authorities in constraining Halakhic interpretation and innovation. On the one hand, there is a principle in ''halakha'' not to overrule a specific law from an earlier era, after it is accepted by the community as a law or [[vow]],<ref>[[Moshe Isserles|Rema]] [[Choshen Mishpat]] Chapter 25</ref> unless supported by another, relevant earlier precedent; see list below. On the other hand, another principle recognizes the responsibility and authority of later authorities, and especially the ''posek'' handling a then-current question. In addition, the ''halakha'' embodies a wide range of principles that permit judicial discretion and deviation (Ben-Menahem).\n\nNotwithstanding the potential for innovation, rabbis and Jewish communities differ greatly on how they make changes in ''halakha''. Notably, ''poskim'' frequently extend the application of a law to new situations, but do not consider such applications as constituting a \"change\" in ''halakha''. For example, many [[Orthodox Judaism|Orthodox]] rulings concerning electricity are derived from rulings concerning fire, as closing an electrical circuit may cause a spark. In contrast, Conservative ''poskim'' consider that switching on electrical equipment is physically and chemically more like turning on a water tap (which is permissible by ''halakha'') than lighting a fire (which is not permissible), and therefore permitted on Shabbat. The reformative [[Judaism]] in some cases explicitly interprets ''halakha'' to take into account its view of contemporary society. For instance, most Conservative rabbis extend the application of certain Jewish obligations and permissible activities to women (see [[#How halakha is viewed today|How halakha is viewed today]] below).\n\nWithin certain Jewish communities, formal organized bodies do exist. Within [[Modern Orthodox Judaism]], there is no one committee or leader, but Modern US-based Orthodox rabbis generally agree with the views set by consensus by the leaders of the [[Rabbinical Council of America]]. Within [[Conservative Judaism]], the [[Rabbinical Assembly]] has an official [[Committee on Jewish Law and Standards]].\n\nNote that Takkanot, the plural form of ''Takkanah'' above, in general do not affect or restrict observance of Torah ''mitzvot''. (In common parlance sometimes people use the general term ''takkanah'' to refer either ''gezeirot'' or ''takkanot''.) However, the Talmud states that in exceptional cases, the Sages had the authority to \"uproot matters from the Torah\". In Talmudic and classical Halakhic literature, this authority refers to the authority to prohibit some things that would otherwise be Biblically sanctioned (''shev v'al ta'aseh'', literally ''thou shall stay seated and not do''). Rabbis may rule that a specific mitzvah from the Torah should not be performed, e.g. blowing the ''[[shofar]]'' on Shabbat, or taking the ''[[Four Species|lulav and etrog]]'' on Shabbat. These examples of takkanot which may be executed out of caution lest some might otherwise carry the mentioned items between home and the synagogue, thus inadvertently violating a Sabbath ''[[Activities prohibited on Shabbat|melakha]]''. Another rare and limited form of takkanah involved overriding Torah prohibitions. In some cases, the Sages allowed the temporary violation of a prohibition in order to maintain the Jewish system as a whole. This was part of the basis for [[Esther]]'s relationship with [[Ahasuerus]] (Xeres). For general usage of takkanaot in Jewish history see the article [[Takkanah]]. For examples of this being used in Conservative Judaism see [[Conservative halakha]].\n\n=== Historical analysis ===\n{{Eras of the Halakha}}\nThe antiquity of the rules can be determined only by the dates of the authorities who quote them; in general, they cannot safely be declared older than the tanna (from Aramaic, literally \"repeater\") to whom they are first ascribed. It is certain, however, that the seven middot (literally \"measurements\", and referring to [good] behavior) of Hillel and the thirteen of Ishmael are earlier than the time of Hillel himself, who was the first to transmit them.\n\nThe Talmud gives no information concerning the origin of the middot, although the Geonim (\"Sages\") regarded them as Sinaitic (given by God to the people of Israel at the time of the Sinai presence). Modern historians believe that it is decidedly erroneous to consider the middot as traditional from the time of Moses on Sinai.\n\nThe middot seem to have been first laid down as abstract rules by the teachers of Hillel, though they were not immediately recognized by all as valid and binding. Different schools interpreted and modified them, restricted or expanded them, in various ways. Akiba and Ishmael and their scholars especially contributed to the development or establishment of these rules. Akiba devoted his attention particularly to the grammatical and exegetical rules, while Ishmael developed the logical. The rules laid down by one school were frequently rejected by another because the principles that guided them in their respective formulations were essentially different. According to Akiba, the divine language of the Torah is distinguished from the speech of men by the fact that in the former no word or sound is superfluous.\n\nSome scholars have observed a similarity between these rabbinic rules of interpretation and the hermeneutics of ancient Hellenistic culture. For example, Saul Lieberman argues that the *names* (e.g. ''kal vahomer'', literally a combination of the archaic form of the word for \"straw\" and the word for \"clay\" – \"straw and clay\", referring to the obvious [means of making a mud brick]) of rabbi Ishmael's ''middot'' are Hebrew translations of Greek terms, although the methods of those ''middot'' are not Greek in origin.<ref>Lieberman, Saul. \"Rabbinic interpretation of scripture\" and \"The hermeneutic rules of the aggadah\" in ''Hellenism in Jewish Palestine'' (NY, 1950) See also, Daube, David. \"Rabbinic methods of interpretation and Hellenistic rhetoric\" ''[[Hebrew Union College Annual|HUCA]]'' 22 (1949) 239ff.</ref>\n\n== Views today ==\n{{See also|Talmud#Present day}}\n[[Orthodox Judaism]] holds that ''halakha'' is the [[divine law]] as laid out in the Torah (five books of Moses), rabbinical laws, rabbinical decrees and customs combined. The rabbis, who made many additions and interpretations of Jewish Law, did so only in accordance with regulations they believe were given for this purpose to [[Moses]] on [[Mount Sinai, Egypt|Mount Sinai]], see Deuteronomy 17:11. See [[Orthodox Judaism#Beliefs|Orthodox Judaism, Beliefs about Jewish law and tradition]].<ref>{{cite news|title=Vail course explores origins of Judaism|url=http://www.vaildaily.com/news/17247766-113/vail-course-explores-origins-of-judaism|agency=Vail Daily|date=July 13, 2015|quote=“Just as science follows the scientific method, Judaism has its own system to ensure authenticity remains intact,” said Rabbi Zalman Abraham of JLI’s New York headquarters}}</ref>\n\n[[Conservative Judaism]] holds that ''halakha'' is normative and binding, and is developed as a partnership between people and God based on Sinaitic Torah. While there are a wide variety of Conservative views, a common belief is that ''halakha'' is, and has always been, an evolving process subject to interpretation by rabbis in every time period. See [[Conservative Judaism#Beliefs|Conservative Judaism, Beliefs]].\n\n[[Reform Judaism]] and [[Reconstructionist Judaism]] both hold that modern views of how the Torah and rabbinic law developed imply that the body of rabbinic Jewish law is no longer normative (seen as binding) on Jews today. Those in the traditionalist wing of these movements believe that the ''halakha'' represents a personal starting-point, holding that each Jew is obligated to interpret the Torah, Talmud and other Jewish works for themselves, and this interpretation will create separate commandments for each person.\n\nThose in the liberal and classical wings of Reform believe that in this day and era most Jewish religious rituals are no longer necessary, and many hold that following most Jewish laws is actually counterproductive. They propose that Judaism has entered a phase of ethical monotheism, and that the laws of Judaism are only remnants of an earlier stage of religious evolution, and need not be followed. This is considered wrong, and even [[heresy|heretical]], by Orthodox and Conservative Judaism.\n\nHumanistic Jews value the Torah as a historical, political, and sociological text written by their ancestors. They do not believe \"that every word of the Torah is true, or even morally correct, just because the Torah is old\". The Torah is both disagreed with and questioned. Humanistic Jews believe that the entire Jewish experience, and not only the Torah, should be studied as a source for Jewish behavior and ethical values.<ref>{{cite web|url=http://oradam.org/OAC/FAQ |title=FAQ for Humanistic Judaism, Reform Judaism, Humanists, Humanistic Jews, Congregation, Arizona, AZ |publisher=Oradam.org |access-date=2012-11-08}}</ref>\n\n=== Flexibility ===\n\nDespite its internal rigidity, ''halakha'' has a degree of flexibility in finding solutions to modern problems that are not explicitly mentioned in the Torah. From the very beginnings of Rabbinic Judaism, halakhic inquiry allowed for a \"sense of continuity between past and present, a self evident trust that their pattern of life and belief now conformed to the sacred patterns and beliefs presented by scripture and tradition.\"<ref>{{Cite book|url=https://www.worldcat.org/oclc/695390082|title=Jews, Christians, Muslims : a comparative introduction to monotheistic religions|date=2012|publisher=Prentice Hall|others=Denny, Frederick Mathewson., Eire, Carlos M. N., Jaffee, Martin S., Corrigan, John, 1952-|isbn=9780205018253|edition=2nd|location=Upper Saddle River, N.J.|oclc=695390082}}</ref> According to an analysis by Jewish scholar Jeffrey Rubenstein of Michael Berger’s book ''Rabbinic Authority'', the authority that rabbis hold  “derives not from the institutional or personal authority of the sages but from a ''communal'' decision to recognize that authority, much as a community recognizes a certain judicial system to resolve its disputes and interpret its laws.”<ref>Rubenstein, Jeffrey L. “Michael Berger. Rabbinic Authority. Oxford: Oxford University Press, 1998. Xii, 226 Pp. -.” ''AJS Review'', vol. 26, no. 2, 2002, pp. 356–359., doi:10.1017/S0364009402250114.</ref> Given this covenental relationship, rabbis are charged with connecting their contemporary community with the traditions and precedents of the past.\n\nWhen presented with contemporary issues, rabbis go through a halakhic process to find an answer. The classical approach has permitted new rulings regarding modern technology. For example, some of these rulings guide Jewish observers about the proper use of [[electricity]] on the Sabbath and holidays. Often, as to the applicability of the law in any given situation, the proviso is to \"consult your local rabbi or [[posek]]\". This notion lends rabbis a certain degree of local authority; however, for more complex questions the issue is passed onto higher rabbis who will then issue a ''teshuvot'', which is a ''responsa'' that is binding.<ref>Satlow, Michael, and Daniel Picus. “Judaism, Christianity, and Islam.” Lecture. Providence, Brown University.</ref> Indeed, rabbis will continuously issue different opinions and will constantly review each other's work so as to maintain the truest sense of ''halakha''. Overall, this process allows rabbis to maintain connection of traditional Jewish law to modern life.  Of course, the degree of flexibility depends on the sect of Judaism, with Reform being the most flexible, Conservative somewhat in the middle, and Orthodox being much more stringent and rigid. Modern critics, however, have charged that with the rise of movements that challenge the \"divine\" authority of ''halakha'', traditional Jews have greater reluctance to change, not only the laws themselves but also other customs and habits, than traditional Rabbinical Judaism did prior to the advent of Reform in the 19th century.\n\n=== Differences between Orthodox and Conservative Judaism ===\n{{unreferenced section|date=July 2017}}\nOrthodox Jews maintain ''halakha'' is derived from the divine law of the Torah (Bible), rabbinical laws, rabbinical decrees and customs combined. As such it should be adhered to as an unalterable authority. They also believe there are traditional formulas that date back to Moses on how the divine law may be interpreted – see above, \"Rules by which early Jewish law was derived\". Conservative Jews have varied views regarding the origin of the Torah and its authority today, and believe it can be continuously reinterpreted. Their view of ''halakha'' has given rise to substantial differences in approach as well as result.\n\n==== Orthodox Judaism ====\n{{unreferenced section|date=July 2017}}\nOrthodox Jews believe that ''halakha'' is a religious system whose core represents the [[Revelation|revealed]] will of God. Although Orthodox Judaism acknowledges that rabbis have made many decisions and decrees regarding Jewish Law where the written Torah itself is non-specific, they did so only in accordance with regulations given to them by [[Moses]] on [[Mount Sinai, Egypt|Mount Sinai]] (see Deuteronomy 5:8–13). These regulations were transmitted orally until shortly after the destruction of the [[Second Temple]]. They were then recorded in the [[Mishnah]], and explained in the Talmud and commentaries throughout history, including today. Orthodox Judaism believes that subsequent interpretations have been derived with the utmost accuracy and care. The most widely accepted codes of Jewish law are known as [[Mishneh Torah]] and the [[Shulchan Aruch]]. No rabbi has the right to change Jewish law unless he clearly understands how it coincides with the precepts of the Talmud and later codes of Jewish law. Later commentaries were accepted by many rabbis as final; however, other rabbis may disagree. {{Citation needed|date=July 2009}}\n\nOrthodox Judaism has a range of opinions on the circumstances and extent to which change is permissible. [[Haredi Judaism|Haredi]] Jews generally hold that even ''minhagim'' (customs) must be retained and existing precedents cannot be reconsidered. [[Modern Orthodox]] authorities are generally more inclined to permit limited changes in customs, and some reconsideration of precedent. All Orthodox authorities, however, agree that only later rabbinical interpretations are subject to reconsideration, and hold that core sources of Divine written and oral law, such as the [[Torah]] the [[Mishnah]] and the [[Talmud]], cannot be overridden.{{Citation needed|date=July 2009}}\n\n==== Conservative Judaism ====\n{{unreferenced section|date=July 2017}}\n{{Details|Conservative halakha}}\nOne view held by [[Conservative Judaism]] is that while God is real, the Torah is not the word of God in a literal sense. However, in this view the Torah is still held as mankind's record of its understanding of God's revelation, and thus still has divine authority. In this view, traditional Jewish law is still seen as binding. Jews who hold to this view generally try to use modern methods of historical study to learn how Jewish law has changed over time, and are in some cases more willing to change Jewish law in the present.\n\nA key practical difference between Conservative and Orthodox approaches is that Conservative Judaism holds that its rabbinical body's powers are not limited to reconsidering later precedents based on earlier sources, but the [[Committee on Jewish Law and Standards]] (CJLS) is empowered to override Biblical and Taanitic prohibitions by ''takkanah'' (decree) when perceived to be inconsistent with modern requirements or views of ethics. The CJLS has used this power on a number of occasions, most famously in the \"driving teshuva\", which says that if someone is unable to walk to any synagogue on the Sabbath, and their commitment to observance is so loose that not attending synagogue may lead them to drop it altogether, their rabbi may give them a dispensation to drive there and back; and more recently in its decision prohibiting the taking of evidence on [[Mamzer]] status on the grounds that implementing such a status is immoral. The CJLS has also held that the Talmudic concept of ''[[Kavod HaBriyot]]'' permits lifting rabbinic decrees (as distinct from carving narrow exceptions) on grounds of human dignity, and used this principle in a December 2006 opinion lifting all rabbinic prohibitions on [[Homosexuality|homosexual]] conduct (the opinion held that only male-male anal sex was forbidden by the [[the Bible and homosexuality|Bible]] and that this remained prohibited). Conservative Judaism also made a number of changes to the [[role of women in Judaism]], including counting women in the [[minyan]] and ordaining women as [[rabbi]]s. The latter was accomplished by simple vote on the faculty of the JTS. Orthodox Judaism holds that ''takkanot'' (rabbinical decrees) can only supplement and can never nullify Biblical law, and significant decisions must be accompanied by scholarly responsa citing sources and halakhic precedent.\n\nAn example of how different views of the origin of Jewish law inform Conservative approaches to interpreting that law involves the CJLS's acceptance of rabbi Elie Kaplan Spitz's responsum decreeing the Biblical category of ''mamzer'' as \"inoperative\", in which The CJLS adopted the Responsum's view that of how, in the Conservative view of ''halakha'', the \"morality which we learn through the unfolding narrative of our tradition\" informs the application of Mosaic law:\n\n{{Quote|We cannot conceive of God sanctioning undeserved suffering ... When a law of Torah conflicts with morality, when the law is 'unpleasant,' we are committed to find a way to address the problem… We are willing to do explicitly what was largely implicit in the past, namely, to make changes when needed on moral grounds. It is our desire to strengthen Torah that forces us to recognize, explicitly the overriding importance of morality, a morality which we learn from the larger, unfolding narrative of our tradition}}\n\nThe responsum cited several examples of how, in Spitz's view, the rabbinic sages declined to enforce punishments explicitly mandated by Torah law. The examples include the \"trial of the accused adulteress (Sotah)\", the \"Law of the Breaking of the Neck of the Heifer\" and the application of the death penalty for the \"rebellious child\". Spitz argues that the punishment of the Mamzer has been effectively inoperative for nearly two thousand years due to deliberate rabbinic inaction (with a few rule-proving counterexamples, including the 18th century Orthodox rabbi Ismael ha-Kohen of Modena, who decreed that a child should have the word \"mamzer\" tattooed to his forehead). Further he suggested that the rabbis have long regarded the punishment declared by the Torah as immoral, and came to the conclusion that no court should agree to hear testimony on \"mamzerut\". His motion was passed by the CJLS.\n\nThe decision represented a watershed for Conservative Judaism because it represented an explicit abrogation of a Biblical injunction on the grounds of contemporary morality, as distinct from exigency. The dissenters, who included rabbi [[Joel Roth]] as well as a partial concurrence by rabbi Daniel Nevins, argued for reaffirming the classical halakhic framework in which human decrees inform and often limit but never wholly abrogate law believed to be of Divine origin, stating that \"we should acknowledge that God's law is beyond our authority to eliminate\", but should continue the traditional approach of applying strict evidentiary rules and presumptions that tend to render enforcement unlikely. He also argued that the current framework is moral, both because proving mamzer status sufficiently beyond all doubt is already so difficult that it is rare, and because the mere existence and possibility of mamzerut status, even if rarely enforced, creates an important incentive for divorcing parties to obtain a [[get (divorce document)|get]] (Jewish religious divorce) to avoid the sin of adultery. He cited a responsum by prominent [[Haredi Judaism|Haredi Orthodox]] rabbi [[Ovadiah Yosef]] as an example of how the traditional approach works. Rabbi Yosef was faced with the child of a woman who had left a religious marriage without religious divorce and had a child in the second marriage, seemingly an open-and-shut case of Mamzer status. Rabbi Yosef proceeded to systematically discredit the evidence that the former marriage had ever taken place. The [[Ketubah]] was mysteriously not found and hence disqualified, and the officiating rabbi's testimony was never sufficiently corroborated and hence not credible. Rabbi Yosef then found reason to doubt that the new husband was ever the father, finding that because the ex-husband occasionally delivered alimony personally, an ancient presumption (one of many) that any time a husband and wife are alone together the law presumes intercourse has taken place governed the case. He held that Jewish law could not disprove, and hence had to conclude, that the original husband really was the child's father and there was no case of Mamzer status.\n\n== Codes of Jewish law ==\nThere are many formal codes of Jewish law that have developed over the past two thousand years. These codes have influenced, and in turn, have been influenced by, the ''[[responsa]]''; [[History of Responsa]] thus provides an informative complement to the survey below. The Torah and the Talmud are not formal [[code of law|codes of law]] - they are [[source of law|sources of law]].\n\nThe major codes of Jewish law:\n* The Mishnah, composed by [[Judah haNasi|rabbi Judah the Prince]], in 200&nbsp;CE, as a basic outline of the state of the Oral Law in his time. This was the framework upon which the Talmud was based; the Talmud's [[dialectic]] analysis of the content of the Mishna (''[[gemara]]''; completed c.&nbsp;500) became the basis for all later [[posek|halakhic decisions]] and subsequent [[codification (law)|codes]].\n* [[Codification (law)|Codification]]s by the [[Geonim]] of the halakhic material in the Talmud. An early work, ''She'iltot'' (\"Questions\") by [[Achai of Shabcha]] (c.&nbsp;752), discusses over 190 ''mitzvot'' – exploring and addressing various questions on these. The first legal [[codex]] proper, ''Halakhot Pesukot'' (\"Decided Laws\"), by [[Yehudai Gaon]] (c.&nbsp;760), rearranges the Talmud passages in a structure manageable to the layman. (It was written in [[Aramaic language#Jewish Middle Babylonian Aramaic|vernacular Aramaic]], and subsequently translated into [[Hebrew language|Hebrew]] as ''Hilkhot Riu''). ''Halakhot Gedolot'' (\"Great Law Book\"), by R.&nbsp;[[Simeon Kayyara]], published two generations later, contains extensive additional material, mainly from [[Responsa]] and [[Monograph]]s of the Geonim, and is presented in a form that is closer to the original Talmud language and structure. (Probably since it was distributed, also, amongst the newly established [[Ashkenazi]] communities.) The ''She'iltot'' was influential on both subsequent works.\n* The ''Hilchot'' of ''the Rif'', rabbi [[Isaac Alfasi]] (1013–1103), summations of the legal material in the Talmud. Alfasi transcribed the Talmud's halakhic conclusions verbatim, without the surrounding deliberation; he also excludes all aggadic (non-legal, homiletic) matter. The ''Hilchot'' soon superseded the geonic codes, as it contained all the decisions and laws then relevant, and additionally, served as an accessible Talmudic commentary; it has been printed with almost every subsequent edition of the Talmud.\n* The Mishneh Torah by Maimonides (1135–1204). This work encompasses the full range of Talmudic law; it is organized and reformulated in a logical system – in 14 books, 83 sections and 1000 chapters – with each ''halakha'' stated clearly. The Mishneh Torah is very influential to this day, and several later works reproduce passages verbatim. It also includes a section on [[Metaphysics]] and [[Jewish principles of faith|fundamental beliefs]]. (Some claim this section draws heavily on [[Aristotle|Aristotelian]] science and metaphysics; others suggest that it is within the tradition of [[Saadia Gaon]].) It is the main source of practical ''halakha'' for many [[Yemenite Jews]] – mainly [[Baladi]] and [[Dor Daim]] – as well as for a growing community referred to as ''[[Dor Daim#Talmide ha-Rambam|talmidei haRambam]]''.\n* The work of ''the Rosh'', rabbi [[Asher ben Jehiel]] (1250?/1259?–1328), an abstract of the Talmud, concisely stating the final halakhic decision and quoting later authorities, notably Alfasi, Maimonides, and the [[Tosafists]]. This work superseded rabbi Alfasi's and has been printed with almost every subsequent edition of the Talmud.\n* The ''[[Sefer Mitzvot Gadol]]'' (The \"SeMaG\") of rabbi [[Moses ben Jacob of Coucy]] (first half of the 13th century, [[Coucy-le-Château-Auffrique|Coucy]], Northern France). \"SeMaG\" is organised around the 365 negative and the 248 positive commandments, separately discussing each of them according to the Talmud (in light of the commentaries of [[Rashi]] and the [[Tosafot]]) and the other codes existent at the time. ''[[Sefer Mitzvot Katan]]'' (\"SeMaK\") by [[Isaac ben Joseph of Corbeil]] is an abridgement of the ''SeMaG'', including additional practical ''halakha'', as well as agaddic and [[Musar literature|ethical]] material.\n* \"The Mordechai\" – by [[Mordecai ben Hillel]], d.&nbsp;[[Nuremberg]] 1298 – serves both as a source of analysis, as well of decided law. Mordechai considered about 350 halakhic authorities, and was widely influential, particularly amongst the Ashkenazi and [[Italian Jews#Italian rite Jews|Italian]] communities. Although organised around the ''Hilchot'' of ''the Rif'', it is, in fact, an independent work. It has been printed with every edition of the Talmud since 1482.\n* The [[Arba'ah Turim]] (''The Tur'', lit. \"The Four Columns\") by rabbi [[Jacob ben Asher]] (1270–1343, [[Toledo, Spain]]). This work traces the ''halakha'' from the Torah text and the Talmud through the [[Rishonim]], with the ''Hilchot'' of Alfasi as its starting point. Ben Asher followed Maimonides's precedent in arranging his work in a topical order, however, the Tur covers only those areas of Jewish law that were in force in the author's time. The code is divided into four main sections; almost all codes since this time have followed the Tur's arrangement of material.\n** [[Orach Chayim]]: \"The Way of Life\" worship and ritual observance in the home and [[synagogue]], through the course of the day, the weekly sabbath and the festival cycle.\n** [[Yoreh De'ah]]: \"Teach Knowledge\" assorted ritual prohibitions, dietary laws and regulations concerning [[menstruation|menstrual]] impurity.\n** [[Even Ha'ezer]]: \"The Rock of the Helpmate\" [[marriage]], [[divorce]] and other issues in [[family]] law.\n** [[Choshen Mishpat]]: \"The Breastplate of Judgment\" The administration and [[adjudication]] of civil law.\n*The [[Shulchan Aruch|Beit Yosef, and the Shulchan Aruch]] of rabbi [[Yosef Karo]] (1488–1575). The ''Beit Yosef'' is a huge commentary on the ''Tur'' in which rabbi Karo traces the development of each law from the Talmud through later rabbinical literature (examining thirty-two [[posek|authorities]], beginning with the Talmud and ending with the works of rabbi [[Israel Isserlein]]). The Shulchan Aruch is, in turn, a condensation of the ''Beit Yosef'' – stating each ruling simply (literally translated, ''Shulchan Aruch'' means \"set table\"); this work follows the chapter divisions of the Tur. The Shulchan Aruch, together with its related commentaries, is considered by many to be the most authoritative compilation of ''halakha'' since the Talmud. In writing the Shulchan Aruch, rabbi Karo based his [[posek|rulings]] on three authorities – Maimonides, Asher ben Jehiel (Rosh), and Isaac Alfasi (Rif); he considered ''the Mordechai'' in inconclusive cases. [[Sephardi|Sephardic Jews]], generally, refer to the Shulchan Aruch as the basis for their daily practice.\n* The works of rabbi [[Moshe Isserles]] (\"Rema\"; [[Kraków]], [[Poland]], 1525 to 1572). Rema noted that the ''Shulchan Aruch'' was based on the [[Sephardic laws and customs|Sephardic]] tradition, and he created a series of [[gloss (annotation)|glosses]] to be appended to the text of the Shulkhan Aruch for cases where Sephardi and [[Ashkenazi]] [[minhag|customs]] differed (based on the works of [[Yaakov Moelin]], [[Israel Isserlein]], and [[Israel Bruna]]). The glosses are called ''Hamapah'', the \"Tablecloth\" for the \"Set Table\". His comments are now incorporated into the body of all printed editions of the Shulchan Aruch, typeset in a different script; today, \"Shulchan Aruch\" refers to the combined work of Karo and Isserles. Isserles' ''Darkhei Moshe'' is similarly a commentary on the Tur and the Beit Yosef.\n* The ''Levush Malkhut'' (\"Levush\") of rabbi [[Mordecai Yoffe]] (c. 1530–1612). A ten volume work, five discussing ''halakha'' at a level \"midway between the two extremes: the lengthy Beit Yosef of Caro on the one hand, and on the other Caro's Shulchan Aruch together with the Mappah of Isserles, which is too brief\", that particularly stresses the [[minhag|customs and practices]] of the Jews of Eastern Europe. The Levush was exceptional among the codes, in that it treated certain ''Halakhot'' from a Kabbalistic standpoint.\n* The [[Shulchan Aruch HaRav]] of rabbi [[Shneur Zalman of Liadi]] (c. 1800) was an attempt to recodify the law as it stood at that time– incorporating [[Shulchan Aruch#Major commentaries|commentaries on the Shulchan Aruch]], and [[History of Responsa#Acharonim|subsequent responsa]] – and thus stating the [[posek|decided ''halakha'']], as well as the underlying reasoning. The work was written, partly, so that laymen would be able to study Jewish law. Unfortunately, most of the work was lost in a fire prior to publication. It is the basis of practice for [[Chabad-Lubavitch]] and other [[Hasidic Judaism|Hasidic groups]], and is quoted as authoritative by many subsequent works, Hasidic and non-Hasidic alike.\n* Works structured directly on the Shulchan Aruch, providing analysis in light of [[Acharonim|Acharonic]] material and codes. The [[Mishnah Berurah]] of rabbi [[Yisrael Meir Kagan|Yisroel Meir ha-Kohen]], (the \"Chofetz Chaim\", Poland, 1838–1933) is a commentary on the \"Orach Chayim\" section of the Shulchan Aruch, discussing the application of each ''halakha'' in light of all subsequent [[Acharonim|Acharonic]] decisions. It has become the authoritative halakhic guide for much of [[Orthodox Judaism|Orthodox]] Ashkenazic Jewry in the postwar period. [[Aruch HaShulchan]] by rabbi [[Yechiel Michel Epstein]] (1829–1888) is a scholarly analysis of ''halakha'' through the perspective of the major Rishonim. The work follows the structure of the Tur and the Shulchan Aruch; rules dealing with vows, agriculture, and ritual purity, are discussed in a second work known as ''[[Aruch HaShulchan he'Atid]]''. [[Yaakov Chaim Sofer|Kaf HaChaim]] on [[Orach Chayim]] and parts of [[Yoreh De'ah]], by the Sephardi sage [[Yaakov Chaim Sofer]] ([[Baghdad]] and [[Jerusalem]], 1870–1939) is similar in scope, authority and approach to the Mishnah Berurah. [[Yalkut Yosef]], by rabbi [[Yitzhak Yosef]], is a voluminous, widely cited and contemporary work of ''halakha'', based on the rulings of rabbi [[Ovadia Yosef]].\n* \"[[Layman]] oriented\" digests of ''halakha''. The [[Kitzur Shulchan Oruch|Kitzur Shulchan Aruch]] of Rabbi [[Shlomo Ganzfried]] ([[Hungary]] 1804–1886), based on the very strict Hungarian customs of the 19th century, became immensely popular after its publication due to its simplicity. This work is not binding in the same way as the Mishneh Torah or the Shulchan Aruch. It is still popular in [[Orthodox Judaism]] as a framework for study, if not always for practice. [[Chayei Adam]] and [[Chochmat Adam]] by [[Avraham Danzig]] (Poland, 1748–1820) are similar Ashkenazi works, but are regarded as a more appropriate basis for practice.{{Citation needed|date=September 2008}} The [[Ben Ish Chai]] by [[Ben Ish Hai|Yosef Chaim]] ([[Baghdad]], 1832–1909) is a corresponding Sephardi work. [[Eliezer Melamed#Published works|''Peninei Halachah'']] by Rabbi [[Eliezer Melamed]] (15 volumes thus far) covers a wide range of subjects, from shabbat to organ donations, and in addition to clearly posing the practical law - reflecting the customs of various communities - also discusses the spiritual foundations of the Halakhot.\n* ''Temimei Haderech'' (\"A Guide To Jewish Religious Practice\") by rabbi [[Isaac Klein]] with contributions from the [[Committee on Jewish Law and Standards]] of the [[Rabbinical Assembly]]. This scholarly work is based on the previous traditional law codes, but written from a [[Conservative Judaism|Conservative Jewish]] point of view, and not accepted among Orthodox Jews.\n\n== See also ==\n{{Portal|Judaism|Law}}\n* [[Antinomianism]]\n* [[Baraita of Rabbi Ishmael]]\n* [[Jewish ethics]]\n* [[Jewish medical ethics]]\n* [[Mishpat Ivri]]\n* [[Sharia]]\n\n== References ==\n{{Reflist|30em}}\n\n== Bibliography ==\n* [[J. David Bleich]], ''Contemporary Halakhic Problems'' (5 vols), Ktav. {{ISBN|0-87068-450-7}}, {{ISBN|0-88125-474-6}}, {{ISBN|0-88125-315-4}}, {{ISBN|0-87068-275-X}}, Feldheim {{ISBN|1-56871-353-3}}\n* [[Menachem Elon]], ''Ha-Mishpat ha-Ivri'' (trans. ''Jewish Law: History, Sources, Principles'' {{ISBN|0-8276-0389-4}}), Jewish Publication Society. {{ISBN|0-8276-0537-4}}\n* Jacob Katz, ''Divine Law in Human Hands — Case Studies in Halakhic Flexibility'', Magnes Press. {{ISBN|965-223-980-1}}\n* [[Moshe Koppel]], \"Meta-Halakhah: Logic, Intuition, and the Unfolding of Jewish Law,\" {{ISBN|1-56821-901-6}}\n* Mendell Lewittes, ''Jewish Law: An Introduction'', Jason Aronson. {{ISBN|1-56821-302-6}}\n* Daniel Pollack ed., ''Contrasts in American and Jewish Law'', Ktav. {{ISBN|0-88125-750-8}}\n* Emanuel Quint, ''A Restatement of Rabbinic Civil Law'' (11 vols), Gefen Publishing. {{ISBN|0-87668-765-6}}, {{ISBN|0-87668-799-0}}, {{ISBN|0-87668-678-1}}, {{ISBN|0-87668-396-0}}, {{ISBN|0-87668-197-6}}, {{ISBN|1-56821-167-8}}, {{ISBN|1-56821-319-0}}, {{ISBN|1-56821-907-5}}, {{ISBN|0-7657-9969-3}}, {{ISBN|965-229-322-9}}, {{ISBN|965-229-323-7}}, {{ISBN|965-229-375-X}}\n* Emanuel Quint, ''Jewish Jurisprudence: Its Sources & Modern Applications '', Taylor and Francis. {{ISBN|3-7186-0293-8}}\n* Steven H. Resnicoff, ''Understanding Jewish Law'', LexisNexis, 2012. {{ISBN|9781422490204}}\n* [[Joel Roth]], ''Halakhic Process: A Systemic Analysis'', Jewish Theological Seminary. {{ISBN|0-87334-035-3}}\n* [[Joseph Soloveitchik]], ''Halakhic Man'', Jewish Publication Society trans. Lawrence Kaplan. {{ISBN|0-8276-0397-5}}\n* {{Cite Americana|short=1|wstitle=Halakah}}\n* {{Cite NIE|wstitle=Halacha|year=1905}}\n<!-- Too Specific:\n* David, Joseph E., \"Beyond the Janus Face of Zionist Legalism: The Theo-Political Conditions of the Jewish Law Project\" Ratio Juris, Vol. 18, No. 2, pp.&nbsp;206–35, June 2005. http://ssrn.com/abstract=729044\n* Kosman, Admiel: [http://opus.kobv.de/ubp/volltexte/2010/4899/ “Right and good” – On Halakha and Meta-Halakha and the actual meaning of these terms today. \"And thou shalt do that which is right and good\" (Deuteronomy 6:18)]\n-->\n\n== External links ==\n{{Wikiquote}}\n\n===Full-text resources of major halakhic works===\n\n* ''Mishneh Torah''\n*: [[Hebrew]]: [http://www.mechon-mamre.org/i/0.htm mechon-mamre.org]; [http://he.wikisource.org/wiki/%D7%9E%D7%A9%D7%A0%D7%94_%D7%AA%D7%95%D7%A8%D7%94_%D7%9C%D7%A8%D7%9E%D7%91%22%D7%9D wikisource]\n*: Translation: [http://www.chabad.org/library/article_cdo/aid/682956/jewish/Mishneh-Torah.htm chabad.org]\n*''Arba'ah Turim''\n*: Hebrew: [http://he.wikisource.org/wiki/%D7%90%D7%A8%D7%91%D7%A2%D7%94_%D7%98%D7%95%D7%A8%D7%99%D7%9D wikisource]\n*''Shulchan Aruch''\n*: Hebrew: {{webarchive |url=https://web.archive.org/web/20040624024611/http://www.chassidus.org.ru/chabadlibrary.org/sifrey_yesod/shulchan_oruch/index.php |date=June 24, 2004 |title=chassidus.org }}; [http://he.wikisource.org/wiki/%D7%A9%D7%95%D7%9C%D7%97%D7%9F_%D7%A2%D7%A8%D7%95%D7%9A wikisource]\n*: Translation: [[s:Shulchan Aruch|wikisource]] (incomplete); [http://www.shulchanarach.com/ shulchanarach.com] (incomplete)\n*''Shulchan Aruch HaRav''\n*: Hebrew: [http://he.wikisource.org/wiki/%D7%A9%D7%95%D7%9C%D7%97%D7%9F_%D7%A2%D7%A8%D7%95%D7%9A_%D7%94%D7%A8%D7%91 wikisource]; [http://www.chabadlibrary.org/books/default.aspx?furl=/adhaz/sh chabadlibrary.org]\n*:[https://web.archive.org/web/20140714230107/http://shulchanaruchharav.com/Halacha/default.aspx Shulchanaruchharav.com]\n* ''Aruch HaShulchan''\n*: Hebrew: [http://he.wikisource.org/wiki/%D7%A2%D7%A8%D7%95%D7%9A_%D7%94%D7%A9%D7%95%D7%9C%D7%97%D7%9F wikisource]\n* ''Kitzur Shulchan Aruch''\n*: Hebrew: [http://www.kitzur.net/ www.kitzur.net]; [http://www.shofar.net/Content/Kitzur_Shulchan.htm?id=5417 shofar.net]; [http://he.wikisource.org/wiki/%D7%A7%D7%99%D7%A6%D7%95%D7%A8_%D7%A9%D7%95%D7%9C%D7%97%D7%9F_%D7%A2%D7%A8%D7%95%D7%9A wikisource]\n*: Translation: [https://web.archive.org/web/20161103084018/http://www.yonanewman.org/kizzur/kiz-index1.html Yona Newman] (100% complete); [https://web.archive.org/web/20050826130052/http://www.torah.org/learning/halacha/ torah.org] (incomplete)\n* ''Ben Ish Chai''\n*: Hebrew: [http://he.wikisource.org/wiki/%D7%91%D7%9F_%D7%90%D7%99%D7%A9_%D7%97%D7%99 wikisource]; [https://web.archive.org/web/20050829033458/http://shechem.org/torah/benishhi/index.html shechem.org]\n* ''Kaf HaChaim''\n*: Hebrew: [http://www.hebrewbooks.org/14418 hebrewbooks.org] (volume 1; others available via [http://www.hebrewbooks.org/home.aspx search on site])\n* ''Mishnah Berurah''\n*: Hebrew: [http://he.wikisource.org/wiki/%D7%9E%D7%A9%D7%A0%D7%94_%D7%91%D7%A8%D7%95%D7%A8%D7%94 wikisource]; [http://www.mishnaberura.com/ mishnaberura.com] (With [[.mp3]] and [[.wma]] files); [http://www.hebrewbooks.org/14170 hebrewbooks.org]\n*: Translation: [https://archive.is/20121209044413/http://www.torah.org/advanced/mishna-berura/archives.html torah.org ]\n* ''Chayei Adam''\n*: Hebrew: [http://www.daat.ac.il/daat/vl/tohen.asp?id=388 daat.ac.il]\n* ''Chochmat Adam'':\n*: Hebrew: [http://www.daat.ac.il/daat/vl/tohen.asp?id=370 daat.ac.il]\n* ''Peninei Halachah'':\n*: Hebrew: [http://ph.yhb.org.il/ ph.yhb.org.il]\n*: Translation: [http://ph.yhb.org.il/en/ ph.yhb.org.il/en]\n* ''Yalkut Yosef''\n*: Hebrew: [http://yalkut.info/ yalkut.info]\n* ''A Guide to Jewish Religious Practice'':\n*: {{webarchive |url=https://web.archive.org/web/20070626172813/http://learn.jtsa.edu/topics/diduknow/jrpguide/ |date=June 26, 2007 }}\n* ''A Halacha Wiki''\n*: [http://halachipedia.com/index.php?title=Main_Page Halachipedia.com]\n*: [https://web.archive.org/web/20140714230107/http://shulchanaruchharav.com/Halacha/default.aspx Shulchanaruchharav.com]\n\n{{Halakha}}\n{{Jews and Judaism}}\n{{OrthodoxJudaism}}\n{{Law}}\n\n{{Italic title}}\n\n[[Category:Jewish law and rituals| ]]\n[[Category:Hebrew words and phrases]]\n[[Category:Legal codes]]\n[[Category:Orthodox Judaism]]\n[[Category:Religious law]]",
            "slug": "halakha",
            "date_updated": 1537055070184,
            "imported": "https://en.wikipedia.org/wiki/Halakha"
        }
    ]
}