{
    "article": [
        {
            "title": "Jewish diaspora",
            "text": "{{pp-30-500|small=yes}}\n{{Jews and Judaism sidebar |History}}\n{{POV-check|date=July 2018}}\n\nThe '''Jewish diaspora''' ([[Hebrew]]: '''''Tfutza''''', תְּפוּצָה) or '''exile''' (Hebrew: '''''Galut''''', גָּלוּת; [[Yiddish]]: ''Golus'') refers to the dispersion of [[Israelites]] or [[Jews]] out of their ancestral homeland (the [[Land of Israel]]) and their subsequent settlement in other parts of the globe.<ref>{{Cite news|url=https://www.britannica.com/topic/Diaspora-Judaism|title=Diaspora {{!}} Judaism|work=Encyclopedia Britannica|access-date=2018-07-12|language=en}}</ref><ref>Ben-Sasson, Haim Hillel. \"Galut.\" ''Encyclopaedia Judaica'', edited by Michael Berenbaum and Fred Skolnik, 2nd ed., vol. 7, Macmillan Reference USA, 2007, pp. 352-363. ''Gale Virtual Reference Library''</ref>   \n\nIn terms of the [[Hebrew Bible]], the term \"Exile\" denotes the fate of the Israelites who were [[Israelite diaspora|taken into exile]] from the [[Kingdom of Israel (Samaria)|Kingdom of Israel]] during the 8th century BCE, and the Judahites from the [[Kingdom of Judah]] who were taken into exile during the 6th century BCE. While in exile, the Judahites became known as \"Jews\" (יְהוּדִים, or ''Yehudim''), \"[[Mordecai]] the Jew\" from the [[Book of Esther]] being the first biblical mention of the term.\n\nThe first exile was the [[Assyrian exile]], the expulsion from the [[Kingdom of Israel (Samaria)]] begun by [[Tiglath-Pileser III]] of [[Assyria]] in 733 [[Common Era|BCE]]. This process was completed by [[Sargon II]] with the destruction of the kingdom in 722 BCE, concluding a three-year siege of [[Samaria (ancient city)|Samaria]] begun by [[Shalmaneser V]]. The next experience of exile was the [[Babylonian captivity]], in which portions of the population of the Kingdom of Judah were deported in 597 BCE and again in 586 BCE by the [[Neo-Babylonian Empire]] under the rule of [[Nebuchadnezzar II]].\n\nA Jewish diaspora existed for several centuries before the fall of the [[Second Temple]], and their dwelling in other countries for the most part  was not a result of compulsory dislocation.<ref> [[Erich S. Gruen]], [https://books.google.com/books?id=t1IR4WtFjGUC&pg=PA3  Diaspora: Jews Amidst Greeks and Romans] [[Harvard University Press]], 2009 pp.3-4, pp.233-234: 'Compulsory dislocation, . .cannot have accounted for more than a fraction of the diaspora. . .The vast bulk of Jews who dwelled abroad in the Second Temple Period did so voluntarily.' (2)'.Diaspora did not await the fall of Jerusalem to Roman power and destructiveness. The scattering of Jews had begun long before-occasionally through forced expulsion, much more frequently through voluntary migration.'</ref> Before the middle of the first century CE, in addition to Judea, Syria and Babylonia, large Jewish communities existed in the Roman provinces of Egypt, Cyrene and Crete and in Rome itself;<ref name = \"Smallwood\">{{cite book |url = https://books.google.com/?id=AW2BuWcalXIC&pg=PA168&dq=Diaspora+before+70#v=onepage&q=Diaspora%20before%2070&f=false | title = The Cambridge History of Judaism: The early Roman period, Volume 3 |editor1= William David Davies|editor2= Louis Finkelstein|editor3= William Horbury | author = E. Mary Smallwood | chapter = The Diaspora in the Roman period before CE 70| publisher = Cambridge University Press | year = 1984 | isbn = 9780521243773 }}</ref> after the [[Siege of Jerusalem (63 BC)|Siege of Jerusalem in 63 BCE]], when the [[Hasmonean dynasty|Hasmonean kingdom]] became a [[protectorate]] of Rome, emigration intensified.{{cn|date=July 2018}} In 6 CE the region was organized as the [[Judea (Roman province)|Roman province of Judea]]. The Judean population revolted against the Roman Empire in 66 CE in the [[First Jewish–Roman War]] which culminated in the [[Siege of Jerusalem (70 CE)#Destruction of Jerusalem|destruction of Jerusalem]] in 70 CE. During the siege, the Romans destroyed the Second Temple and most of [[Jerusalem]]. This watershed moment, the elimination of the symbolic centre of Judaism and Jewish identity constrained many Jews to reformulate a new self-definition and adjust their existence to the prospect of an indefinite period of displacement. <ref>Gruen, ''Diaspora: Jews Amidst Greeks and Romans,'' [[Harvard University Press]], 2009 pp233-234:</ref>\n\nIn 132 CE, [[Bar Kokhba revolt|Bar Kokhba led a rebellion]] against [[Hadrian]], a revolt connected with the renaming of Jerusalem as [[Aelia Capitolina]]. After four years of devastating warfare, the uprising was suppressed, and Jews were forbidden access to Jerusalem.\n\nDuring the [[Middle Ages]], due to increasing migration and resettlement, Jews divided into [[Jewish ethnic divisions|distinct regional groups]] which today are generally addressed according to two primary geographical groupings: the [[Ashkenazi]] of Northern and Eastern Europe, and the [[Sephardic]] Jews of [[Iberia]] (Spain and Portugal), [[North Africa]] and the [[Middle East]]. These groups have parallel histories sharing many cultural similarities as well as a series of massacres, persecutions and expulsions, such as the [[Alhambra Decree|expulsion from Spain in 1492]], the [[Edict of Expulsion|expulsion from England in 1290]], and the [[Jewish exodus from Arab and Muslim countries|expulsion from Arab countries in 1948–1973]]. Although the two branches comprise many unique ethno-cultural practices and have links to their local host populations (such as [[Central Europe]]ans for the Ashkenazim and [[Hispanics]] and [[Arabs]] for the Sephardim), their shared religion and ancestry, as well as their continuous communication and population transfers, has been responsible for a unified sense of cultural and religious [[Jewish peoplehood|Jewish identity]] between Sephardim and Ashkenazim from the late Roman period to the present.\n\n==Origins and uses of the terms==\n{{Main|Diaspora}}\nDiaspora has been a common phenomenon for many peoples since antiquity, but what is particular about the Jewish instance is the pronounced negative, religious, indeed metaphysical connotations traditionally attached to dispersion and exile (''galut''), two conditions which were conflated.<ref>[[Shmuel Noah Eisenstadt]]  [https://books.google.com/books?id=3Mz-1RFs98cC&pg=PA61 ''Explorations in Jewish Historical Experience: The Civilizational Dimension,'']   [[Brill Publishers|BRILL]], 2004 pp.60-61:'What was unique was the tendency to conflate  dispersion with Exile, and to endow the combined experience of dispersion and Exile with a strong metaphysical and religious negative evaluation of ''galut''. . In most cases ''galut'0' was  seen as basically negativce, explained in terms of sin and punishment. Life in ''galut'' was defined as a partial, suspe4nded existence, but at the same time it had to be nurtured in order to guarantee the survival of the Jewish people until the Redemption.'</ref>The English term ''diaspora'', which entered usage as late as 1876, and the Hebrew word ''galut'' though covering a similar semantic range, bear some distinct differences in connotation. The former has no traditional equivalent in Hebrew usage.<ref>'Diaspora is a relatively new English word and has no traditional Hebrew equivalent.¹.Howard Wettstein,  [https://books.google.com/books?id=6u90DckCgo4C&pg=PA47 'Coming to Terms with Exile.'] in Howard Wettstein  (ed.) ''Diasporas and Exiles: Varieties of Jewish Identity,'' [[University of California Press]] 2002  (pp. 47-59 p.47</ref>\n\n[[Steven Bowman]] argues that diaspora in antiquity connoted emigration from an ancestral mother city, with the emigrant community maintaining its cultural ties with the place of origin. Just as the Greek city exported its surplus population, so did Jerusalem, while remaining the cultural and religious centre or metropolis (''ir-va-em be-yisrael'') for the outlying communities. It could have two senses in Biblical terms, the idea of becoming a 'guiding light unto the nations' by dwelling in the midst of gentiles, or of enduring the pain of exile from one's homeland. The conditions of diaspora in the former case were premised on the free exercise of citizenship or resident alien status. Galut implies by comparison  living as a denigrated minority, stripped of such rights, in the host society.<ref name=\"Bowman\" /> Sometimes diaspora and galut are defined as 'voluntary' as opposed to 'involuntary' exile. <ref>Jeffrey M. Peck, [https://books.google.com/books?id=L4O5Z_Dif_sC&pg=PA154   ''Being Jewish in the New Germany,''] [[Rutgers University Press]], 2006 p 154.</ref>Diaspora, it has been argued, has a political edge, referring to geopolitical dispersion, which may be involuntary, but which can assume, under different conditions, a positive nuance. Galut is more [[Teleology|teleological]], and connotes a sense of uprootedness.<ref>Howard K. Wettstein, [https://books.google.com/books?id=NoPZu79hqaEC&pg=PA61 ‘Diaspora, Exile, and Jewish Identity,’] in M. Avrum Ehrlich  (ed.), ''Encyclopedia of the Jewish Diaspora: Origins, Experiences, and Culture, Volume 1,''   [[ABC-CLIO]], 2009  pp.61-63, p.61:’Diaspora is a political notion; it suggests geopolitical dispersion, perhaps involuntary. However, with changed circumstances, a population may come to see virtue in diasporic life. Diaspora-as oppposed to galut-may thus acquire a positive charge. Galut rings of teleology, not politics. It suggests dislocation, a sense of being uprooted, in the wrong place. Perhaps the community has been punished; perhaps awful things happen in our world</ref> [[Daniel Boyarin]] defines diaspora as a state where people have a dual cultural allegiance, productive of a double consciousness, and in this sense a cultural condition not premised on any particular history, as opposed to galut, which is more descriptive of an existential situation, that properly of exile, conveying a particular psychological outlook.<ref name=\"Boyarin2011\" >[[Daniel Boyarin]] in  Ilan Gur-Ze'ev  (ed.),[https://books.google.com/books?id=1dxPcKxz-jsC&pg=PA127 'Diasporic Philosophy and Counter-Education,'] [[Springer Science & Business Media]] 2011 p. 127 </ref> \n\nThe Greek word διασπορά (dispersion) first appears as a [[neologism]] in the translation of the [[Old Testament]] known as the [[Septuagint]], where it occurs 14 times,<ref>Stéphane Dufoix, [https://books.google.com/books?id=GNOYDQAAQBAJ&pg=PA28 ''The Dispersion: A History of the Word Diaspora,''] [[Brill Publishers|BRILL]], 2016 pp.28ff, 40.</ref> starting with a passage reading: ἔση διασπορὰ ἐν πάσαις βασιλείαις τῆς γῆς (thou shalt be a diaspora (or dispersion) in all kingdoms of the earth) ([[Deuteronomy]] xxviii:25), translating 'ləza‘ăwāh', whose root suggests 'trouble, terror'. In these contexts it never translated any term in the original [[Tanakh]] drawn from the [[Semitic root|Hebrew  root]] ''glt'' (גלה)  which lies behind ''galah,'' and ''golah'', nor even ''galuth.''<ref>Dufoix pp.41,46.</ref> ''Golah'' appears 42 times, and ''galuth'' in 15 passages, and first occurs in the [[Books of Kings|2 Kings 17:23]]'s reference to the deportation of the Judean elite to Babylonia.<ref>Dufoix p.47.</ref>  Stéphane Dufoix, in surveying the textual evidence, draws the following conclusion:\n<blockquote>''galuth'' and ''diaspora'' are drawn from two completely different lexicons. The first refers to episodes, precise and datable, in the history of the people of Israel, when the latter was subjected to  a foreign occupation, such as that of Babylon, in which most of the occurrences are found. The second, perhaps with a single exception that remains debatable, is never used to speak of the past and does not concern Babylon; the instrument of dispersion is never the historical sovereign of another country. ''Diaspora'' is  the word for chastisement, but the dispersion in question has not occurred yet: it is potential, conditional on the Jews not respecting the law of God. . .It follows that ''diaspora'' belongs, not to the domain of  history, but of theology.'<ref>Stéphane Dufoix, p.49</ref></blockquote>\n\nIn [[Talmud]]ic and post-Talmudic Rabbinic literature, this phenomenon was referred to as ''galut'' (exile), a term with strongly negative connotations, often contrasted with ''[[geula]]'' (redemption).<ref>See for example, ''Kiddushin'' ([[tosafot]]) 41a, ref. \"Assur l'adam...\"</ref> [[Eugene Borowitz]] describes Galut as \"fundamentally a theological category<ref>Eugene B. Borowitz, [https://books.google.com/books?id=mZbviV0BquAC&pg=PA129 ''Exploring Jewish Ethics: Papers on Covenant Responsibility,'']   [[Wayne State University Press]], 1990 p.129:'Galut is fundamentally a theological category.'</ref> The modern Hebrew concept of ''Tefutzot'' תפוצות, \"scattered\", was introduced in the 1930s by the [[American Jews|Jewish-American]] [[Zionist]] academic [[Simon Rawidowicz]],<ref>[[Simon Rawidowicz]],  [https://books.google.com/books?id=4mFRWm90biQC&pg=PA96  'On the concept of Galut,'], in his ''State of Israel, Diaspora, and Jewish Continuity: Essays on the \"ever-dying People,'' [[UPNE]], 1998 pp.96ff. p.80</ref> who to some degree argued for the acceptance of the Jewish presence outside the [[Land of Israel]] as a modern reality and an inevitability. The Greek term for [[diaspora]] (διασπορά) also appears three times in the [[New Testament]], where it refers to the scattering of Israel, i.e., the Ten Northern Tribes of Israel as opposed to the Southern Kingdom of Judah, although James (1:1) refers to the scattering of all twelve tribes.\n\nIn modern times, the contrasting meanings of diaspora/galut have given rise to controversy among Jews. Bowman states this in the following terms,\n\n<blockquote>(Diaspora) follows the Greek usage and is considered a positive phenomenon that continues the prophetic call of Israel to be a 'light unto the nations' and establish homes and families among the gentiles. The prophet Jeremiah issues this call to the preexilic emigrants in Egypt. . . Galut is a religious–nationalist term, which implies exile from the homeland as a result of collective sins, an exile that will be redeemed at YHWH’s pleasure. [[Jewish messianism]] is closely connected with the concept of galut.’<ref name=\"Bowman\" >Steven Bowman, [https://books.google.com/books?id=7QEjPVyd9YMC&pg=PA193   'Jewish Diaspora in the Greek World: The Principles of Acculturation,'] in  Melvin Ember, Carol R. Ember, Ian Skoggard  (eds.) ''Encyclopedia of Diasporas: Immigrant and Refugee Cultures Around the World. Volume I: Overviews and Topics; Volume II: Diaspora Communities,''  [[Springer Science & Business Media]], 2004 pp.192ff. p.193</ref></blockquote>\n\nIn Zionist debates a distinction was made between ''galut'' and ''golus/gola''. The latter denoted social and political exile, whereas the former, while consequential on the latter, was a psycho-spiritual  framework that was not wholly dependent on the conditions of life in diasporic exile, since one could technically remain in ''galut'' even in [[Eretz Israel]].<ref name=\"Gorny\" /><ref>[[Immanuel Jakobovits]], [https://www.jstor.org/stable/23260747 'Religious Responses to Jewish Statehood,'] [[Tradition (journal)|Tradition: A Journal of Orthodox Jewish Thought]], Vol. 20, No. 3 (FALL 1982), pp.188-204 pp.191,200 n.5. This was the view of [[Chabad]]  under [[Menachem Mendel Schneerson]]. </ref> Whereas [[Theodore Herzl]] and his follows thought that the establishment of a Jewish state would put an end to the diasporic exile, [[Ahad Ha-am]] thought to the contrary that such a state's function would be to 'sustain Jewish nationhood' in the diaspora.<ref name=\"Gorny\" >Yosef Gorny  [https://books.google.com/books?id=sUBSinsiciQC&pg=PA50 ''Converging Alternatives: The Bund and the Zionist Labor Movement, 1897-1985,'']  [[SUNY Press]], 2012 p.50.</ref>\n\n==Pre-Roman diaspora==\n[[File:Jewishdiaspora.png|thumb|right|Paths of Jewish deportation]]\nIn 722 BCE, the [[ancient Assyrians|Assyrians]], under [[Sargon II]], successor to [[Shalmaneser V]], conquered the [[Kingdom of Israel (Samaria)|Kingdom of Israel]], and many [[Israelites]] were [[Israelite diaspora|deported]] to [[Mesopotamia]].<ref>[https://books.google.com/books?id=TgoTAAAAYAAJ&source=gbs_navlinks_s Laura A Knott (1922) ''Student's History of the Hebrews'' p.225], Abingdon Press, New York</ref>The Jewish proper diaspora began with the Babylonian exile in the 6th century BCE.<ref name=\"Tripolitis\">{{cite book |url = https://books.google.com/?id=pj6Pll9qgtIC&pg=PA61&dq=jewish+Diaspora+babylon#v=onepage&q=jewish%20Diaspora%20babylon&f=false | title = Religions of the Hellenistic-Roman Age | author = Antonia Tripolitis | publisher = Wm. B. Eerdmans Publishing | pages = 61–62|year = 2002 | isbn = 9780802849137 }}</ref>\n\nAfter the overthrow of the [[Kingdom of Judah]] in 586 BCE by [[Nebuchadnezzar II]] of Babylon (see [[Babylonian captivity]]) and the deportation of a considerable portion of its inhabitants to [[Mesopotamia]], the Jews had two principal cultural centers: [[History of the Jews in Iraq|Babylonia]] and the [[land of Israel]].<ref>\"In the beginning, when the Torah was forgotten by Israel, Ezra came from Babylonia and reestablished it. Later the Torah became forgotten again. Then came [[Hillel the Elder|Hillel]] the Babylonian and reestablished it.\" [[Sukkah (Talmud)|''Sukkah'']] 20a</ref><ref>Hersh Goldwurm (1982) ''History of the Jewish People: The Second Temple Era'' p.143, Mesorah Publications, New York {{ISBN|978-0-899-06455-0}}</ref>\n\nDeportees returned to the [[Kingdom of Judah|Samaria]] after the Neo-Babylonian Empire was in turn conquered by [[Cyrus the Great]]. The biblical book of [[Ezra]] includes two texts said to be decrees allowing the deported Jews to return to their homeland after decades and ordering the Temple rebuilt. The differences in content and tone of the two decrees, one in Hebrew and one in Aramaic, have caused some scholars to question their authenticity.<ref>{{cite book |ref=Bedford |last=Bedford |first=Peter Ross |title=Temple Restoration in Early Achaemenid Judah |url=https://books.google.com/books?id=MOd320e710IC&pg=PA112#v=onepage&q=%22Hebrew+edict%22+%22Aramaic%20edict%22+Williamson&f=false |publisher=Brill |location=Leiden |year=2001 |page=112 (Cyrus edict section pp. 111–131) |isbn=9789004115095}}</ref> The [[Cyrus Cylinder]], an ancient tablet on which is written a declaration in the name of Cyrus referring to restoration of temples and repatriation of exiled peoples, has often been taken as corroboration of the authenticity of the biblical decrees attributed to Cyrus,<ref name=\"Becking\">{{cite book |last=Becking |first=Bob |authorlink= |editor1-last=Lipschitz |editor1-first=Oded |editor2-last=Oeming |editor2-first=Manfred |chapter=\"We All Returned as One!\": Critical Notes on the Myth of the Mass Return |title=Judah and the Judeans in the Persian Period |url=https://books.google.com/books?id=1zi2i_C1aNkC&pg=PA8#v=onepage&q=%22Cyrus%20cylinder%22%20Jerusalem&f=false |accessdate= |year=2006 |publisher=Eisenbrauns |location=Winona Lake, IN |page=8 |isbn=978-1-57506-104-7}}</ref> but other scholars point out that the cylinder's text is specific to Babylon and Mesopotamia and makes no mention of Judah or Jerusalem.<ref name=\"Becking\" />  [[Lester L. Grabbe]] asserted that the \"alleged decree of Cyrus\"<ref>Grabbe, ''A History of the Jews and Judaism in the Second Temple Period,'' vol.1 2004  [https://books.google.com/books?id=1cPeBAAAQBAJ&pg=PA76 pp.76ff.] </ref> regarding Judah, \"cannot be considered authentic\", but that there was a \"general policy of allowing deportees to return and to re-establish cult sites\". He also stated that archaeology suggests that the return was a \"trickle\" taking place over decades, rather than a single event. There is no sudden expansion of the population base of 30,000 and no credible indication of any special interest in ''[[Yehud Medinata|Yehud]]''.<ref name=\"Grabbe355\"> [[Lester L. Grabbe]],[https://books.google.com/books?id=1cPeBAAAQBAJ&pg=PA355 ''A History of the Jews and Judaism in the Second Temple Period: Yehud - A History of the Persian Province of Judah v. 1,''] [[T & T Clark]], isbn=978-0-567-08998-4,  2004 p.355.</ref>\n\nAlthough most of the Jewish people during this period, especially the wealthy families, were to be found in Babylonia, the existence they led there, under the successive rulers of the [[Achaemenid dynasty|Achaemenids]], the [[Seleucid Empire|Seleucids]], the [[Parthia]]ns, and the [[Sassanid dynasty|Sassanians]], was obscure and devoid of political influence. The poorest but most fervent of the exiles returned to Judah / the Land of Israel during the reign of the [[Achaemenid dynasty|Achaemenids]] (c. 550–330 BCE). There, with the reconstructed [[Temple in Jerusalem]] as their center, they organized themselves into a community, animated by a remarkable religious ardor and a tenacious attachment to the [[Torah]] as the focus of its identity. As this little nucleus increased in numbers with the accession of recruits from various quarters, it awoke to a consciousness of itself, and strove once again for national independence and political enfranchisement and sovereignty.{{citation needed|date=June 2017}}\n\nThe first [[History of the Jews in Egypt|Jewish diaspora in Egypt]] arose in the [[Twenty-sixth Dynasty of Egypt|last century of pharaonic rule]], apparently with the settlement there, either under [[Ashurbanipal]] or during the reign of [[Psamtik I|Psammeticus]] of a colony of Jewish mercenaries, a military class that successively served the [[Achaemenid Empire|Persian]], the [[Ptolemaic Kingdom|Ptolemaic]] and Roman governments down to the early decades of the second century C.E., when the revolt against Trajan destroyed them. Their presence was buttressed by numerous Jewish administrators who joined them in Egypt's military and urban centres.<ref>[[Steven B. Bowman|Steven Bowman]], [https://books.google.com/books?id=7QEjPVyd9YMC&pg=PA193 'Jewish Diaspora in the Greek World, The Principles of Acculturation,'] in  Melvin Ember, Carol R. Ember, Ian Skoggard  (eds.) ''Encyclopedia of Diasporas: Immigrant and Refugee Cultures Around the World. Volume I: Overviews and Topics; Volume II: Diaspora Communities,''  [[Springer Science & Business Media]], 2004 pp.192ff. pp.192-193.</ref>\n\nWhile communities in Alexandria and Rome dated back to before the [[Maccabean Revolt]], the population in the Jewish diaspora expanded after the [[Siege of Jerusalem (63 BC)|Pompey's campaign]] in 62 BCE. Under the [[Hasmonean]] princes, who were at first high priests and then kings, the Jewish state displayed even a certain luster and annexed several territories. Soon, however, discord within the royal family and the growing disaffection of the pious, the soul of the nation, towards rulers who no longer evinced any appreciation of the real aspirations of their subjects made the Jewish nation easy prey for the ambitions of the now increasingly autocratic and imperial Romans, the successors of the Seleucids. In 63 BCE [[Pompey]] invaded Jerusalem, the Jewish people lost their political sovereignty and independence, and [[Aulus Gabinius|Gabinius]] subjected the Jewish people to tribute.{{citation needed|date=June 2017}}\n\n===Early diaspora populations===\n{{Further|Hellenistic Judaism}}\nThe Jewish diaspora in Egypt was already several centuries old. It was as old as that of the East (Babylon), but not until the early Hellenistic period did it achieve comparable importance. Alexander the Great's breathtakingly rapid campaign of conquest led to the swift commercialisation of the Eastern Mediterranean after 333 BCE. After numerous vicissitudes, and especially owing to internal dissensions within the Seleucid dynasty on the one hand and to the interested support of the pre-Roman Empire, the pre-autocratic Roman Republic on the other, the cause of Jewish independence finally triumphed .As early as the third century BCE Jewish communities sprang up in the Aegean islands, Greece, Asia Minor, Cyrenaica, Italy and Egypt.<ref name=\"Ehrlich\">{{cite book |url = https://books.google.com/?id=NoPZu79hqaEC&printsec=frontcover&dq=jewish+diaspora#v=onepage&q=jewish%20diaspora&f=false| title = Encyclopedia of the Jewish Diaspora: Origins, Experiences, and Culture, Volume 1 |editor= Mark Avrum Ehrlich | publisher = ABC-CLIO| year = 2009| isbn = 9781851098736 }}</ref>{{rp| 8–11}} In Palestine, under the favourable auspices of the long period of peace - almost a whole century - which followed the advent of the Ptolemies, the new ways were to flourish. By means of all kinds of contacts, and particularly thanks to the development of commerce, Hellenism infiltrated on all sides in varying degrees. The ports of the Mediterranean coast were indispensable to commerce and, from the very beginning of the Hellenistic period, underwent great development. In the Western Diaspora Greek quickly became dominant in Jewish life and little sign remains of profound contact with Hebrew or Aramaic, the latter probably being the more prevalent. The proportion of Jews in the Diaspora in relation to the size of the nation as a whole increased steadily throughout the Hellenistic era and reached astonishing dimensions in the early Roman period, particularly in Alexandria. It was not least for this reason that the Jewish people became a major political factor, especially since the Jews in the diaspora, notwithstanding strong cultural, social and religious tensions, remained firmly united with their homeland.<ref name=Hegermann>Hegermann, Harald  (2008) \"The Diaspora in the Hellenistic Age.\" In: ''The Cambridge History of Judaism'', Vol. 2. Eds.: Davies and Finkelstein.PP. 115 - 166</ref> Smallwood writes that,'It is reasonable to conjecture that many, such as the settlement in Puteoli attested in 4 BCE went back to the late (pre-Roman Empire) Roman Republic or early Empire and originated in voluntary emigration and the lure of trade and commerce.\"<ref>E. Mary Smallwood (2008) \"The Diaspora in the Roman period before A.D. 70.\" In: ''The Cambridge History of Judaism'', Volume 3. Editors Davis and Finkelstein.</ref> Dating the numerous settlements is difficult. Some settlements may have resulted from the Jewish revolts. Others such as the Jewish community in Rome were far older dating back to at least the mid second century BCE. Although it expanded greatly following [[Siege of Jerusalem (63 BC) | Pompey’s campaign]] in 62 BCE. In 6 CE the Romans annex Judaea. Only the Jews in Babylonian remained outside of Roman rule.<ref name = \"Smallwood1\">{{cite book |url = https://books.google.com/books?id=AW2BuWcalXIC&pg=PA168&dq=Diaspora+before+70&hl=en&sa=X&ved=0ahUKEwipxYeYwsHUAhVByoMKHaB4CP8Q6AEIMTAD#v=onepage&q=Diaspora%20before%2070&f=false | title = The Cambridge History of Judaism: The early Roman period, Volume 3 |editor1= William David Davies|editor2= Louis Finkelstein|editor3= William Horbury | author = E. Mary Smallwood | chapter = The Diaspora in the Roman period before CE 70| publisher = Cambridge University Press | year = 1984 }}</ref>{{rp|168}} Unlike the Greek speaking Hellenized Jews in the west the Jewish communities in Babylonian and Judea continued the use of Aramaic as a primary language.<ref name=\"Tripolitis\"/> \n\nAs early as the middle of the 2nd century BCE the Jewish author of the third book of the [[Sibylline oracles|Oracula Sibyllina]] addressed the \"chosen people,\" saying: \"Every land is full of thee and every sea.\" The most diverse witnesses, such as [[Strabo]], [[Philo]], [[Seneca the Younger|Seneca]], [[Luke the Evangelist|Luke]] (the author of the ''[[Acts of the Apostles]]''), [[Cicero]], and [[Josephus]], all mention Jewish populations in the cities of the [[Mediterranean basin]]. See also [[History of the Jews in India]] and [[History of the Jews in China]] for pre-Roman (and post-) diasporic populations.\nKing [[Agrippa I]], in a letter to [[Caligula]], enumerated among the provinces of the Jewish diaspora almost all the Hellenized and non-Hellenized countries of the Orient. This enumeration was far from complete as [[Italy]] and [[Cyrene, Libya|Cyrene]] were not included. The [[Epigraphy|epigraphic]] discoveries from year to year augment the number of known Jewish communities but must be viewed with caution due to the lack of precise evidence of their numbers. According to the ancient Jewish historian Josephus, the next most dense Jewish population after the Land of Israel and [[Babylonia]] was in [[Syria]], particularly in [[Antioch]], and [[Damascus]], where 10,000 to 18,000 Jews were massacred during the great insurrection. The ancient Jewish philosopher Philo gives the number of Jewish inhabitants in [[Egypt]] as one million, one-eighth of the population. [[Alexandria]] was by far the most important of the Egyptian Jewish communities. The Jews in the Egyptian diaspora were on a par with their Ptolemaic counterparts and close ties existed for them with Jerusalem. As in other Hellenistic diasporas, the Egyptian diaspora was one of choice not of imposition.<ref name=Hegermann />\n\nTo judge by the accounts of wholesale massacres in 115 BCE, the number of Jewish residents in [[Cyrenaica]], [[Cyprus]], and [[Mesopotamia]] was also large. At the commencement of the reign of [[Caesar Augustus]], there were over 7,000 Jews in Rome (though this is only the number that is said to have escorted the envoys who came to demand the deposition of [[Herod Archelaus|Archelaus]]; compare: Bringmann: Klaus: Geschichte der Juden im Altertum, Stuttgart 2005, S. 202. Bringmann talks about 8,000 Jews who lived in the city of Rome.). Many sources say that the Jews constituted a full one-tenth (10%) of the population of the ancient city of Rome itself. Finally, if the sums confiscated by the [[Promagistrate|governor]] [[Lucius Valerius Flaccus]] in the year 62/61 BCE represented the tax of a didrachma per head for a single year, it would imply that the Jewish population of [[Anatolia|Asia Minor]] numbered 45,000 adult males, for a total of at least 180,000 persons.{{citation needed|date=July 2007}}\n\n==Under the Roman Empire==\n{{see also|History of the Jews in the Roman Empire}}\n<!--[[left|thumb|Expulsion of the Jews in the Reign of the Emperor [[Hadrian]] (135 CE): ''How Heraclius turned the Jews out of Jerusalem.'' (Facsimile of a Miniature in the ''Histoire des Empereurs'', Manuscript of the 15th century, in the Library of the Arsenal, Paris.)]]-->\nThe 13th-century author [[Bar Hebraeus]] gave a figure of 6,944,000 Jews in the Roman world. [[Salo Wittmayer Baron]] considered the figure convincing.<ref name=\"Baron\">{{cite book | title = A Social and Religious History of the Jews, by Salo Wittmayer Baron ... Volume 1 of A Social and Religious History of the Jews| author = Salo Wittmayer Baron | publisher = Columbia University Press | page = 132 | year = 1937 }}</ref> The figure of seven million within and one million outside the Roman world in the mid-first century became widely accepted, including by [[Louis Feldman]]. However, contemporary scholars now accept that Bar Hebraeus based his figure on a census of total Roman citizens and thus, included non-Jews. The figure of 6,944,000 being recorded in [[Chronicon (Eusebius)|Eusebius' Chronicon]].<ref name=\"Bartlett\">{{cite book |url = https://books.google.com/?id=RQgW9NMML4wC&pg=PA104&lpg=PA104&dq=roman+empire+jews+8+million#v=onepage&q=roman%20empire%20jews%208%20million&f=false | title = Jews in the Hellenistic and Roman Cities | author = John R. Bartlett | publisher = Routledge. London and New york | year = 2002 | isbn = 9780203446348 }}</ref>{{rp| 90, 94, 104–05}}<ref name=\"Rutgers\">{{cite book |url = https://books.google.com/?id=r5yvfbc2W5UC&pg=PA202&lpg=PA202&dq=bar+hebraeus+first+century#v=onepage&q=bar%20hebraeus%20first%20century&f=false| title = The Hidden Heritage of Diaspora Judaism: Volume 20 of Contributions to biblical exegesis and theology | author = Leonard Victor Rutgers| publisher = Peeters Publishers | page = 202|year = 1998| isbn = 9789042906662 }}</ref> Louis Feldman, previously an active supporter of the figure, now states that he and Baron were mistaken.<ref name=\"Feldman\">{{cite book | title = Judaism And Hellenism Reconsidered | author = Louis H. Feldman| publisher = BRILL| year = 2006}}</ref>{{rp| 185}} [[Philo]] gives a figure of one million Jews living in Egypt.  John R. Bartlett rejects Baron's figures entirely, arguing that we have no clue as to the size of the Jewish demographic in the ancient world.<ref name=\"Bartlett\"/>{{rp| 97–103}} The Romans did not distinguish between Jews inside and outside of the Land of Israel/Judaea. They collected an annual [[temple tax]] from Jews both in and outside of Israel. The revolts in and suppression of diaspora communities in Egypt, Libya and Crete in 115–117 CE had a severe impact on the Jewish diaspora.\n\n==Roman destruction of Judea==\n{{Main|Jewish–Roman wars}}\n{{See also|Judea (Roman province)}}\n[[File:Arch of Titus Menorah.png|thumb|250px|alt=Relief carving depicting Roman soldiers carrying a menorah and other artifacts|Copy of relief panel from the [[Arch of Titus]] in the [[Nahum Goldmann Museum of the Jewish People]], depicting the [[Roman triumph|triumphal parade]] of Roman soldiers celebrating \"''Judaea Capta''\" (\"Judaea is enslaved/conquered\") and leading newly enslaved Jews, while displaying spoils of the [[Siege of Jerusalem (AD 70)|siege of Jerusalem]].<ref name=FK2010>{{cite book|last=Kleiner|first=Fred|title=Gardner's Art Through the Ages: A Global History, Enhanced, Volume I: 1|year=2010|publisher=Wadsworth Publishing|isbn=1439085781|page=262|url=https://books.google.com/books?id=S1CRuET2CP8C&lpg=PA262&dq=%22Arch%20of%20Titus%22&pg=PA262#v=onepage&q&f=false}}</ref> ]]\n\nIt is commonly claimed that the diaspora began with Rome's twofold crushing of Jewish national aspirations. David Aberbach, for one, has argued that much of the European Jewish diaspora, by which he means exile or voluntary migration, originated with the Jewish wars which occurred between 66 and 135 CE.<ref name = \"Aberbach\">{{cite book |title= The European Jews, Patriotism and the Liberal State 1789-1939: A Study of Literature and Social Psychology Routledge Jewish Studies Series|url = https://books.google.com/?id=B3kXQEUJy_YC&printsec=frontcover&dq=The+European+Jews,+Patriotism+and+the+Liberal+State#v=snippet&q=135%20ce&f=false| author = David Aberbach | publisher = Routledge | year = 2012|isbn = 9781136158957}}</ref>{{rp| 224}} [[Martin Goodman (historian)| Martin Goodman]] states that it is only after the destruction of Jerusalem that Jews are found in northern Europe and along the western Mediterranean coast.<ref name=\"docs.google.com\">{{cite web|url=https://docs.google.com/document/d/1Ib2suAQgXxDFZ5zLdag9DMTFCaDPkJrDwResH1I_J4I/edit |work=The Times Literary Supplement|title=Secta and natio|first=MARTIN|last= GOODMAN|publisher=The Times Literary Supplement Limited |date=26 February 2010 |accessdate=2 October 2013}}</ref> This widespread popular belief holds that there was a sudden expulsion of Jews from Judea/Syria Palaestina and that this was crucial for the establishment of the Diaspora,<ref name=noreturn>[https://books.google.com/books?id=80j612aFo_4C&pg=PA159&hl=en&sa=X&ei=mj54UYakNJCM4gSK9ICwCQ&redir_esc=y#v=onepage&q&f=false ''No Return, No Refuge'' (Howard Adelman, Elazar Barkan, p. 159)]. \"in the popular imagination of Jewish history, in contrast to the accounts of historians or official agencies, there is a widespread notion that the Jews from Judea were expelled in antiquity after the destruction of the temple and the \"Great Rebellion\" (70 and 135 CE, respectively). Even more misleading, there is the widespread, popular belief that this expulsion created the diaspora.\"</ref> [[Israel Bartal]] contends that [[Shlomo Sand]] is incorrect in ascribing this view to most Jewish study scholars,<ref>'Every historian knew that the myth combining destruction and expulsion was very much alive in the mind of the public, having derived from a religious tradition and become firmly rooted in secular consciousness. In the popular discourse, as in the political statements and the educational system, the expulsion of the people of Israel after the fall of the kingdom was carved in stone. Most intelligent scholars evaded this dubious area with professional elegance; here and there, as though unwittingly, they supplemented their writings with alternative explanations of the prolonged exile.' [[Shlomo Sand]], [[The Invention of the Jewish People]], [[Verso]] 2009 pp.129ff. p.143</ref> instead arguing that this view is negligible among serious Jewish study scholars.<ref>{{cite news |url=http://www.haaretz.com/hasen/spages/999386.html |archiveurl=https://web.archive.org/web/20090416045211/http://www.haaretz.com/hasen/spages/999386.html |archivedate=April 16, 2009 |title=Inventing an Invention |first=Israel |last=Bartal |authorlink=Israel Bartal |publisher=Haaretz |date=July 6, 2008 |quote=Although the myth of an exile from the Jewish homeland (Palestine) does exist in popular Israeli culture, it is negligible in serious Jewish historical discussions.(Israel Bartal, dean of humanities at the Hebrew University)}}</ref> Arguing that the growth of diaspora Jewish communities was a gradual process that occurred over the centuries, starting with the Assyrian destruction of Israel, the Babylonian destruction of Judah, the Roman destruction of Judea, and the subsequent rule of Christians and Muslims. After the revolt, the Jewish religious and cultural center shifted to the Babylonian Jewish community and its scholars. For the generations that followed, the destruction of the Second Temple event came to represent a fundamental insight about the Jews who had become a dispossessed and persecuted people for much of their history.<ref name=MYTH>{{cite news |url=https://www.nytimes.com/2009/11/24/books/24jews.html?pagewanted=2 |title=Book Calls Jewish People an 'Invention' |newspaper=The New York Times |date=November 23, 2009 |page=2 |quote=Experts dismiss the popular notion that the Jews were expelled from Palestine in one fell swoop in A.D. 70. Yet while the destruction of Jerusalem and Second Temple by the Romans did not create the Diaspora, it caused a momentous change in the Jews' sense of themselves and their position in the world.}}</ref> Following the Bar Kokhba revolt Jews were reduced to a wholly diaspora people.<ref name =\"Philpott\">{{cite book | title = Just and Unjust Peace: An Ethic of Political Reconciliation | author = Daniel Philpott | publisher = Oxford University Press  | page = 131| year = 2012}}</ref>\n\n[[Erich S. Gruen]] maintains for example that focusing on the destruction of the Temple misses the point that already before this, the diaspora was well established. Compulsory dislocation of people cannot explain more than a fraction of the eventual diaspora.<ref>(\"Focus on the consequences of the Temple's destruction, however, overlooks a fact of immense significance: the diaspora had a long history prior to Rome's crushing of Jerusalem. (...) Compulsory dislocation, however, cannot have accounted for more than a fraction of the diaspora\" [[Erich S. Gruen]], \"Diaspora: Jews Amidst Greeks and Romans\", pages 2-3)</ref> Avrum Ehrlich also states that already well before the destruction of the Temple in 70 CE, more Jews lived in the Diaspora than in Israel.<ref>[https://scholar.google.com/scholar?&as_sdt=0,5&q=Mark+Avrum+Ehrlich Encyclopedia of the Jewish Diaspora: Origins, Experiences, and Culture, Volume 1] p. 126: \"In fact, well before the destruction of the Second Temple (70 CE), more Jews lived in the Diaspora than in the Land of Israel.\"</ref> According to Israel Yuval, the Babylonian captivity created a promise of return in the Jewish consciousness which had the effect of enhancing the Jewish self-perception of Exile after the destruction of the Second Temple, albeit their dispersion was due to an array of non-exilic factors.<ref>[https://books.google.com/books?id=gg0m24wY_lUC&printsec=frontcover&dq=The+Ten+Lost+Tribes:+A+World+History&hl=en&sa=X&ei=vca7UOzWM_D34QS5mYDgAQ&redir_esc=y#v=onepage&q=The%20Ten%20Lost%20Tribes%3A%20A%20World%20History&f=false ''The Ten Lost Tribes: A World History'' (Zvi Ben-Dor Benite, Oxford University Press 2009) pp. 17–18]\"the dispersal of the Jews, even in ancient times, was connected with an array of factors, none of them clearly exilic\"</ref>\nRoman rule, which began in 63 BCE, continued until a revolt from CE 66–70, a Jewish uprising to fight for independence, was eventually crushed after four years, culminating in the capture of Jerusalem and the burning and destruction of the Temple, the centre of the national and religious life of the Jews throughout the world.  The Jewish diaspora at the time of the Temple's destruction, according to [[Josephus]], was in Parthia (Persia), Babylonia (Iraq), Arabia, as well as some Jews beyond the Euphrates and in Adiabene (Kurdistan). In Josephus' own words, he had informed \"the remotest Arabians\" about the destruction.<ref>{{PACEJ|text=JW|NorW=W|bookno=1|chap=0|sec=2|show-translator=yes}} (Preface) Greek: {{lang|grc|Ἀράβων τε τοὺς πορρωτάτω}}.</ref>\n\nExactly when [[Anti-Judaism#Anti-Judaism in the pre-Christian Roman Empire|Roman Anti-Judaism]] began is a question of scholarly debate, however historian [[Hayim Hillel Ben-Sasson]] has proposed that the [[Caligula#Financial crisis and famine|\"Crisis under Caligula\"]] (37–41) was the \"first open break between Rome and the Jews\".<ref>[[Hayim Hillel Ben-Sasson]], ''A History of the Jewish People'', Harvard University Press, 1976, {{ISBN|0-674-39731-2}}, ''The Crisis Under Gaius Caligula'', pages 254–256: \"The reign of Gaius Caligula (37–41) witnessed the first open break between the Jews and the [[Julio-Claudian]] empire. Until then—if one accepts [[Sejanus]]' heyday and the trouble caused by the [[Census of Quirinius|census after Archelaus' banishment]]—there was usually an atmosphere of understanding between the Jews and the Empire ... These relations deteriorated seriously during Caligula's reign, and, though after his death the peace was outwardly re-established, considerable bitterness remained on both sides. ... Caligula ordered that a golden statue of *himself* be set up in the Temple in Jerusalem. ... Only Caligula's death, at the hands of Roman conspirators (41), prevented the outbreak of a Jewish-Roman war that might well have spread to the entire East.\"</ref>Meanwhile, the [[Kitos War]] led to the destruction of Jewish communities in Crete and North Africa, in 117 CE, and consequently the dispersal of Jews already living outside of Judea to further reaches of the Empire.<ref name=JewishEncDiaspora>[http://www.jewishencyclopedia.com/articles/5169-diaspora \"Diaspora\" entry in the Jewish Encyclopedia 1906]</ref>\n\n[[Jerusalem]] had been left in ruins from the time of [[Vespasian]]. Sixty years later, Hadrian, who had been instrumental in the expulsion from Palestine of [[Marcius Turbo]] after his bloody repression of Jews in the diaspora in 117 CE.,<ref>Galimnberti, 2010, p.73.</ref> on visiting the area of ''Iudaea'', decided to rebuilt the city in 130 CE, and settle it, circumstantial evidence suggesting it was he who renamed  it{{sfn|Feldman|1990|p=19|ps=: \"While it is true that there is no evidence as to precisely who changed the name of Judaea to Palestine and precisely when this was done, circumstantial evidence would seem to point to Hadrian himself, since he is, it would seem, responsible for a number of decrees that sought to crush the national and religious spirit of the Jews, whether these decrees were responsible for the uprising or were the result of it. In the first place, he refounded Jerusalem as a Graeco-Roman city under the name of Aelia Capitolina. He also erected on the site of the Temple another temple to Zeus.\"}}{{sfn|Jacobson|2001|p=44-45|ps=: \"Hadrian officially renamed Judea Syria Palaestina after his Roman armies suppressed the Bar-Kokhba Revolt (the Second Jewish Revolt) in 135 C.E.; this is commonly viewed as a move intended to sever the connection of the Jews to their historical homeland. However, that Jewish writers such as Philo, in particular, and Josephus, who flourished while Judea was still formally in existence, used the name Palestine for the Land of Israel in their Greek works, suggests that this interpretation of history is mistaken. Hadrian's choice of Syria Palaestina may be more correctly seen as a rationalization of the name of the new province, in accordance with its area being far larger than geographical Judea. Indeed, Syria Palaestina had an ancient pedigree that was intimately linked with the area of greater Israel.\"}} ''[[Ælia Capitolina]]'', with a Roman ''colonia'' and foreign cults. it is commonly held that this was done as an insult to the Jews and as a means of erasing the land's Jewish identity,<ref> [[Gudrun Krämer]] [https://books.google.com/books?id=tWrW_CKODdQC&pg=PA14 ''A History of Palestine: From the Ottoman Conquest to the Founding of the State of Israel,''] [[Princeton University Press]] p.14:\"As another element of retaliation, the Romans renamed the province of Judaea \"Syria Palestina\" to erase any linguistic connection with the rebellious Jews. As mentioned earlier, the name \"Palestine\" in itself was not new, having already served in Assyrian and Egyptian sources to designate the coastal plain of the southern Levant.\"</ref><ref> William  David Davies, Louis Finkelstein, Steven T. Katz (eds.) [https://books.google.com/books?id=BjtWLZhhMoYC ''The Cambridge History of Judaism: Volume 4, The Late Roman-Rabbinic Period,'']  [[Cambridge University Press]] 1984p=?: 'Hadrian visited Palestine in 130, as part of a tour of the eastern provinces of the Empire. It now seems likely, though not absolutely certain, that it was on this occasion that he announced his intention to restore Jerusalem, not as a Jewish city, but as a Roman colony to be named Aelia Capitolina, after himself (his full name was Publius Aelius Hadrianus) and Jupiter Capitolinus, the chief god of the Roman pantheon. This was presumably both intended and understood as a humiliating insult to the defeated God of Israel, who had previously occupied the site, and by extension to the people who persisted in worshiping Him. It also rendered the restoration of His Temple moot.’</ref><ref name=\"Ariel Lewin p. 33\">Ariel Lewin, [https://books.google.com/books?id=zlToSqE0k_cC&pg=PA33  ''The archaeology of Ancient Judea and Palestine,''] [[Getty Publications]] 2005 p. 33: \"It seems clear that by choosing a seemingly neutral name - one juxtaposing that of a neighboring province with the revived name of an ancient geographical entity (Palestine), already known from the writings of Herodotus - Hadrian was intending to suppress any connection between the Jewish people and that land.'</ref> <ref name=\"The Bar Kokhba War Reconsidered\"> [[Peter Schäfer]], [https://books.google.com/books?id=1TA-Fg4wBnUC&pg=PA33  ''The Bar Kokhba War Reconsidered''] Mohr Siebeck  2003 p.33.</ref>    Other argued that this project was expressive of an intention of establishing administratively and culturally a firm Roman imperial presence, and thus incorporate the province, now called Syro-Palaestina, into the Roman world system. These political measures were, according to Menachem Mor, devoid of any intention to eliminate Judaism,<ref>Menahem Mor,  [https://books.google.com/books?id=T8wJDAAAQBAJ&pg=PA487 ''The Second Jewish Revolt: The Bar Kokhba War, 132-136 CE,'']  [[Brill Publishers|BRILL]], 2016 p.487:’Despite the fact that the actions of Hadrian were of a political nature, their intention was not to bring about the eliminating of Judaism, at least not according to Hadrian’s perceptions. Some of the Jewish population in the Judeaean mountains regarded Roman conquest and the general policy of the emperor carried out by Tineius Rufus, the local governor, as sufficient cause for another revolt against Rome. Yet the territorial limitations of the Second Revolt testify that most of the Jewish population in Palestine did not regard these activities as a reason for rebellion.’ </ref> indeed, the pagan reframing of Jerusalem may have been a strategic move designed to challenge, rather, the growing threat, pretensions and influence of converts to Christianity, for whom Jerusalem was likewise a crucial symbol of their faith.<ref>David Golan, [https://www.jstor.org/stable/4435963 Hadrian's Decision to supplant \"Jerusalem\" by \"Aelia Capitolina\"] in ''Historia: Zeitschrift für Alte Geschichte,'' Bd. 35, H. 2 (2nd Qtr., 1986), [[Franz Steiner Verlag]] pp. 226-239 pp.233-238 </ref> Implementation of these plans led to violent opposition, and triggered a full-scale insurrection with the [[Bar Kokhba revolt|revolt led by Bar Kochba]] (132–136 CE),<ref>Giovanni Battista Bazzana, 'Bar Kochba’s Revolt and Hadrian’s Religious Policy,’ in  Marco Rizzi  (ed.), [https://books.google.com/books?id=BdQtshCmxZwC&pg=PA90  ''Hadrian and the Christians,'']  [[Walter de Gruyter]], 2010 pp.85-109 p.89-91.</ref> assisted, according to [[Dio Cassius]], by some other peoples, perhaps Arabs who had recently been subjected by Trajan.<ref>Alessandro Galimberti, 'Hadrian, Eleusus, and the Begi nning of Christian Apologetics' in Marco Rizzi  (ed.), [https://books.google.com/books?id=BdQtshCmxZwC&pg=PA90  ''Hadrian and the Christians,'']  [[Walter de Gruyter]], 2010 pp.71-84, p.74.</ref>  Jews were forbidden entrance to Jerusalem on pain of death, except for the day of [[Tisha B'Av]]. There was a further shift of the center of religious authority from [[Yavne]], as rabbis regrouped in [[Usha (city)|Usha]] in the western  Galilee, where the [[Mishnah]] was composed. This ban struck a blow at Jewish national identity within Palestine, while the Romans however continued to allow Jews in the diaspora their distinct national and religious identity throughout the Empire.<ref>Martin Goodman, [https://books.google.com/books?id=PWpyDAAAQBAJ&pg=PA75 'The Roman State and Jewish Diaspora Communities in the Antonine Age,'] in Yair Furstenberg  (ed.),''Jewish and Christian Communal Identities in the Roman World,''  [[Brill Publishers|BRILL]], 2016 pp.75-86 p.75.</ref>The military defeats of the Jews in Judaea in 70 CE and again in 135 CE, with thousands sold into slavery, meant a drop in Palestine's Jewish population was balanced by a rise in Diaspora numbers. These slaves and their children were eventually manumitted and joined local free communities.<ref name=\"Smallwood2\"> E. Mary Smallwood,  [https://books.google.com/?id=jSYbpitEjggC&pg=PA507 ''The Jews Under Roman Rule: From Pompey to Diocletian: a Study in Political Relations,'']   [[Brill Publishers|]] 2001 p.507.</ref> It has been argued that the archaeological evidence is suggestive of a Roman genocide taking place during the Second revolt.<ref name=Taylor>J. E. Taylor  [https://books.google.com/?id=XWIMFY4VnI4C&pg=PA243  ''The Essenes, the Scrolls, and the Dead Sea,'']  [[Oxford University Press]]  2012 p.243:'Up until this date the Bar Kokhba documents indicate that towns, villages and ports where Jews lived were busy with industry and activity. Afterwards there is an eerie silence, and the archaeological record testifies to little Jewish presence until the Byzantine era, in En Gedi. This picture coheres with what we have already determined in Part I of this study, that the crucial date for what can only be described as genocide, and the devastation of Jews and Judaism within central Judea, was 135 CE and not, as usually assumed, 70 CE, despite the siege of Jerusalem and the Temple's destruction.'</ref>  A significant movement of gentiles and [[Samaritans]] into villages formerly with a Jewish majority appears to have taken place thereafter.<ref>  Isaiah Gafni, [https://books.google.com/books?id=dJTnCgAAQBAJ&pg=PA67 ''Land, Center and Diaspora: Jewish Constructs in Late Antiquity,'']   [[Bloomsbury Publishing]], 1997 p.66.</ref>\n\n==Post-Roman period Jewish populations==\n{{Main|Jewish ethnic divisions}}\nDuring the [[Middle Ages]], due to increasing geographical dispersion and re-settlement, Jews divided into [[Jewish ethnic divisions|distinct regional groups]] which today are generally addressed according to two primary geographical groupings: the [[Ashkenazi]] of Northern and Eastern Europe, and the [[Sephardic]] Jews of [[Iberia]] (Spain and Portugal), [[North Africa]] and the [[Middle East]]. These groups have parallel histories sharing many cultural similarities as well as a series of massacres, persecutions and expulsions, such as the [[Alhambra Decree|expulsion from Spain in 1492]], the [[Edict of Expulsion|expulsion from England in 1290]], and the [[Jewish exodus from Arab and Muslim countries|expulsion from Arab countries in 1948–1973]]. Although the two branches comprise many unique ethno-cultural practices and have links to their local host populations (such as [[Central Europe]]ans for the Ashkenazim and [[Hispanics]] and [[Arabs]] for the Sephardim), their shared religion and ancestry, as well as their continuous communication and population transfers, has been responsible for a unified sense of cultural and religious [[Jewish peoplehood|Jewish identity]] between Sephardim and Ashkenazim from the late Roman period to the present.\n\nBy 1764 there were about 750,000 Jews in the [[Polish–Lithuanian Commonwealth]]. The worldwide Jewish population (comprising the Middle East and the rest of Europe) was estimated at 1.2 million.<ref>{{cite web |url=http://www.jewishjournal.com/articles/item/timeline_jewish_life_in_poland_from_1098_20070608/ |title=Timeline: Jewish life in Poland from 1098 |publisher=Jewish Journal |first=Jane |last=Ulman |date=June 7, 2007}}</ref>\n\n===Classic period: Jews and Samaritans===\nThe Jews (Hebrew: יְהוּדִים, Yehudim), also known as the Jewish people, are an ethnoreligious group who mainly trace their origins to the ancient Israelites of the Levant, as well as other contributory peoples/populations. The [[Samaritans]] consider themselves to be the remaining population of the [[Kingdom of Israel (Samaria)|Northern Kingdom of Israel]] who were not expelled during the [[Assyrian captivity of Israel|ten tribes exile]], and who joined with the incoming Assyrian populations to form the [[Samaritan]] community. Some biblical scholars also consider that parts of the Judean population had stayed to live in their homes during the [[Babylonian Exile|exilic]] period and later joined the returning Israelites from Babylon and formed the Jews of the classic and [[Hasmonean]] era.\n\nAfter the Persian conquest of Babylon in 539 BCE Judah ([[Hebrew language|Hebrew]]: יְהוּדָה Yehuda) became a [[Yehud Medinata|province of the Persian empire]]. This status continued into the following [[Hellenistic period]], when Yehud became a disputed province of Ptolemaic Egypt and Seleucid Syria. In the early part of the 2nd century BCE, a revolt against the Seleucids led to the establishment of an independent Jewish kingdom under the [[Hasmonean]] dynasty. The Hasmoneans adopted a deliberate policy of imitating and reconstituting the Davidic kingdom, and as part of this [[Forced conversion#Judaism|forcibly converted to Judaism]] their neighbours in the Land of Israel. The conversions included [[Nabatean]]s ([[Zabadeans]]) and [[Itureans]], the peoples of the former [[Philistine]] cities, the [[Moabites]], [[Ammon]]ites and [[Edomites]]. Attempts were also made to incorporate the [[Samaritans]], following takeover of Samaria. The success of mass-conversions is however questionable, as most groups retained their tribal separations and mostly turned Hellenistic or Christian, with [[Edomites]] perhaps being the only exception to merge into the Jewish society under Herodian dynasty and in the following period of [[Jewish-Roman Wars]].<ref>[http://www.britannica.com/EBcheched/topic/263498/Herodian-dynasty \"Herodian Dynasty\" article in Encyclopædia Britannica]</ref> While there are some references to maintaining the tribal separation among Israelites during the Hasmonean period, the dominant position of the tribe of Judah as well as nationalistic policies of Hasmoneans to refer to residents of Hasmonean Judea as Jews practically erased the tribal distinction, with the exception of the priestly orders of [[Levites]] and [[Kohanim]] (tribe of Levi).\n\nThe Babylonian Jewish community, though maintaining permanent ties with the Hasmonean and later Herodian kingdoms, evolved into a separate Jewish community, which during the Talmudic period assembled its own practices, the [[Babylonian Talmud]], slightly differing from the [[Jerusalem Talmud]]. The Babylonian Jewry is considered to be the predecessor of most [[Mizrahi]] Jewish communities.\n\n===Middle Ages===\n\n====Ashkenazi Jews====\n[[Ashkenazi Jews]] is a general category of Jewish populations who immigrated to what is now Germany and northeastern France during the [[Middle Ages]] and until modern times used to adhere to the [[Yiddishkeit|Yiddish culture]] and the [[Nusach Ashkenaz|Ashkenazi prayer style]]. There is evidence that groups of Jews had immigrated to [[Germania]] during the [[Roman Empire|Roman Era]]; they were probably merchants who followed the Roman Legions during their conquests. To a larger degree, modern Ashkenazi Jews are the descendants of Jews who migrated into northern France and lower Germany around 800–1000 CE, later migrating into Eastern Europe, as well as local Europeans who intermixed with Jews. Many Ashkenazi Jews are also descended from [[Sephardi Jews]] exiled from Spain, first during [[Persecution by Muslims|Islamic persecutions]] (11th-12th centuries) and later during Christian reconquests (13th-15th centuries) and the [[Spanish Inquisition]] (15th-16th centuries). In this sense, the modern term \"Ashkenazi\" refers to a subset of Jewish religious practices, adopted over time, rather than to a strict ethno-geographic division, which became erased over time.\n\nIn 2006, a study by Doron Behar and Karl Skorecki of the Technion and Ramban Medical Center in Haifa, Israel demonstrated that the vast majority of Ashkenazi Jews, both men and women, have Middle Eastern ancestry.<ref name=\"Wade\">{{cite news|url=https://www.nytimes.com/2006/01/14/science/14gene.html |work=The New York Times |first=Nicholas |last=Wade |title=New Light on Origins of Ashkenazi in Europe |date=January 14, 2006}}</ref> According to Nicholas Wades' 2010 Autosomal study Ashkenazi Jews share a common ancestry with other Jewish groups and Ashkenazi and [[Sephardi Jews]] have roughly 30% European ancestry with the rest being Middle Eastern.<ref name=\"nytimes.com\">{{cite news|url=https://www.nytimes.com/2010/06/10/science/10jews.html?adxnnl=1&ref=homepage&src=me&adxnnlx=1276466486-+ZqzWCnAH+wZr3wU9gONXw |work=The New York Times |first=Nicholas |last=Wade |title=Studies Show Jews' Genetic Similarity |date=June 9, 2010}}</ref> According to Hammer, the Ashkenazi population expanded through a series of bottlenecks—events that squeeze a population down to small numbers—perhaps as it migrated from the Middle East after the destruction of the Second Temple in 70 CE, to Italy, reaching the [[Rhine|Rhine Valley]] in the 10th century.\n\nDavid Goldstein, a Duke University geneticist and director of the Duke Center for Human Genome Variation, has said that the work of the Technion and Ramban team served only to confirm that genetic drift played a major role in shaping Ashkenazi mitochondrial DNA (mtDNA), which is inherited in a matrilineal manner. Goldstein argues that the Technion and Ramban mtDNA studies fail to actually establish a statistically significant link between modern Jews and historic Middle Eastern populations. This differs from the patrilineal case, where Goldstein said there is no doubt of a Middle Eastern origin.<ref name=\"Wade\"/>\n\nIn June 2010, Behar et al. \"shows that most Jewish samples form a remarkably tight subcluster with common genetic origin, that overlies Druze and Cypriot samples but not samples from other Levantine populations or paired Diaspora host populations. In contrast, Ethiopian Jews ([[Beta Israel]]) and [[Indian Jews]] (Bene Israel and [[Cochin Jews|Cochini]]) cluster with neighboring autochthonous populations in Ethiopia and western India, respectively, despite a clear paternal link between the Bene Israel and the Levant.\".<ref name=\"nytimes.com\"/><ref name=\"Behar2010\">{{cite journal |author1=Doron M. Behar  |author2=Bayazit Yunusbayev  |author3=Mait Metspalu  |author4=Ene Metspalu  |author5=Saharon Rosset  |author6=Jüri Parik  |author7=Siiri Rootsi  |author8=Gyaneshwer Chaubey  |author9=Ildus Kutuev  |author10=Guennady Yudkovsky  |author11=Elza K. Khusnutdinova  |author12=Oleg Balanovsky  |author13=Ornella Semino  |author14=Luisa Pereira  |author15=David Comas  |author16=David Gurwitz  |author17=Batsheva Bonne-Tamir  |author18=Tudor Parfitt  |author19=Michael F. Hammer  |author20=Karl Skorecki  |author21=Richard Villems |url=https://www.researchgate.net/publication/44657170_The_genome-wide_structure_of_the_Jewish_people/file/79e41508a88be7e829.pdf |title=The genome-wide structure of the Jewish people |journal=Nature |date=July 2010 |volume=466 |doi=10.1038/nature09103 |issue=7303 |pages=238–42 |pmid=20531471|bibcode=2010Natur.466..238B}}</ref> \"The most parsimonious explanation for these observations is a common genetic origin, which is consistent with an historical formulation of the Jewish people as descending from ancient Hebrew and Israelite residents of the Levant.\" In conclusion the authors are stating that the genetic results are concordant \"with the dispersion of the people of ancient Israel throughout the Old World\". Regarding the samples he used Behar points out that \"Our conclusion favoring common ancestry (of Jewish people) over recent admixture is further supported by the fact that our sample contains individuals that are known not to be admixed in the most recent one or two generations.\"\n\nA 2013 study of Ashkenazi mitochondrial DNA by Costa et al., reached the conclusion that the four major female founders and most of the minor female founders had ancestry in prehistoric Europe, rather than the Near East or Caucasus. According to the study these findings 'point to a significant role for the conversion of women in the formation of Ashkenazi communities\".<ref name=Costa>{{cite journal |author=M. D. Costa and 16 others |title=A substantial prehistoric European ancestry amongst Ashkenazi maternal lineages |journal=Nature Communications |year=2013 |doi=10.1038/ncomms3543 |volume=4 |pages=2543 |url=http://www.nature.com/ncomms/2013/131008/ncomms3543/full/ncomms3543.html |pmid=24104924 |pmc=3806353|bibcode=2013NatCo...4E2543C }}</ref>\n\nA study by Haber, et al., (2013) noted that while previous studies of the Levant, which had focused mainly on diaspora Jewish populations, showed that the \"Jews form a distinctive cluster in the Middle East\", these studies did not make clear \"whether the factors driving this structure would also involve other groups in the Levant\". The authors found strong evidence that modern Levant populations descend from two major apparent ancestral populations. One set of genetic characteristics which is shared with modern-day Europeans and Central Asians is most prominent in the Levant amongst \"Lebanese, Armenians, Cypriots, Druze and Jews, as well as Turks, Iranians and Caucasian populations\". The second set of inherited genetic characteristics is shared with populations in other parts of the Middle East as well as some African populations. Levant populations in this category today include \"Palestinians, Jordanians, Syrians, as well as North Africans, Ethiopians, Saudis, and Bedouins\". Concerning this second component of ancestry, the authors remark that while it correlates with \"the pattern of the Islamic expansion\", and that \"a pre-Islamic expansion Levant was more genetically similar to Europeans than to Middle Easterners,\" they also say that \"its presence in Lebanese Christians, Sephardi and Ashkenazi Jews, Cypriots and Armenians might suggest that its spread to the Levant could also represent an earlier event\". The authors also found a strong correlation between religion and apparent ancestry in the Levant: \n\n<blockquote>all Jews (Sephardi and Ashkenazi) cluster in one branch; Druze from Mount Lebanon and Druze from Mount Carmel are depicted on a private branch; and Lebanese Christians form a private branch with the Christian populations of Armenia and Cyprus placing the Lebanese Muslims as an outer group. The predominantly Muslim populations of Syrians, Palestinians and Jordanians cluster on branches with other Muslim populations as distant as Morocco and Yemen.<ref name=\"plosgenetics.org\">*{{Cite journal|url=http://www.plosgenetics.org/article/info%3Adoi%2F10.1371%2Fjournal.pgen.1003316| title=Genome-Wide Diversity in the Levant Reveals Recent Structuring by Culture| first1=Marc |last1=Haber| first2=Dominique |last2=Gauguier| first3=Sonia |last3=Youhanna| first4=Nick |last4=Patterson|first5=Priya| last5=Moorjani| journal=PLOS Genetics|doi=10.1371/journal.pgen.1003316|year=2013|editor1-last=Williams|editor1-first=Scott M|last6=Botigué|first6=Laura R.|last7=Platt|first7=Daniel E.|last8=Matisoo-Smith|first8=Elizabeth|last9=Soria-Hernanz|first9=David F.| last10=Wells| first10=R. S.| last11=Bertranpetit| first11=J| last12=Tyler-Smith| first12=C| last13=Comas| first13=D| last14=Zalloua| first14=P. A.|volume=9|issue=2|pages=e1003316|pmid=23468648|pmc=3585000| display-authors=8}}</ref></blockquote>\n\nAnother 2013 study, made by Doron M. Behar of the Rambam Health Care Campus in Israel and others, suggests that: \"Cumulatively, our analyses point strongly to ancestry of Ashkenazi Jews primarily from European and Middle Eastern populations and not from populations in or near the Caucasus region. The combined set of approaches suggests that the observations of Ashkenazi proximity to European and Middle Eastern populations in population structure analyses reflect actual genetic proximity of Ashkenazi Jews to populations with predominantly European and Middle Eastern ancestry components, and lack of visible introgression from the region of the Khazar Khaganate—particularly among the northern Volga and North Caucasus populations—into the Ashkenazi community.\"<ref>http://digitalcommons.wayne.edu/cgi/viewcontent.cgi?article=1040&context=humbiol_preprints</ref>\n\n====Sephardic Jews====\n[[Sephardi Jews]] are Jews whose ancestors lived in Spain or Portugal. Some 300,000 Jews resided in Spain before the Spanish Inquisition in the 15th century, when the [[Catholic Monarchs|Reyes Católicos]] reconquered Spain from the Arabs and ordered the Jews to convert to Catholicism, leave the country or face execution without trial. Those who chose not to convert, between 40,000 and 100,000, were expelled from Spain in 1492 in the wake of the [[Alhambra decree]].<ref>[https://www.telegraph.co.uk/news/worldnews/europe/spain/10631714/Spain-invites-descendants-of-Sephardic-Jews-expelled-500-years-ago-to-return.html Spain invites descendants of Sephardic Jews expelled 500 years ago to return]</ref> Sephardic Jews subsequently migrated to North Africa (Maghreb), Christian Europe (Netherlands, Britain, France and Poland), throughout the [[Ottoman Empire]] and even the newly discovered [[Latin America]]. In the Ottoman Empire, the Sephardim mostly settled in the European portion of the Empire, and mainly in the major cities such as: [[Istanbul]], [[Thessaloniki|Selânik]] and [[Bursa]]. Selânik, which is today known as Thessaloniki and found in modern-day Greece, had a large and flourishing Sephardic community as was the community of Maltese Jews in [[Malta]].\n\nA small number of Sephardic refugees who fled via the Netherlands as [[Marrano]]s settled in Hamburg and Altona Germany in the early 16th century, eventually appropriating Ashkenazic Jewish rituals into their religious practice. One famous figure from the Sephardic Ashkenazic population is [[Glückel of Hameln]]. Some relocated to the United States, establishing the country's first organized community of Jews and erecting the United States' first synagogue. Nevertheless, the majority of Sephardim remained in Spain and Portugal as [[Converso]]s, which would also be the fate for those who had migrated to Spanish and Portuguese ruled Latin America. Sephardic Jews evolved to form most of North Africa's Jewish communities of the modern era, as well as the bulk of the Turkish, Syrian, Galilean and Jerusalemite Jews of the Ottoman period.\n\n====Mizrahi Jews====\n[[Mizrahi Jews]] are Jews descended from the Jewish communities of the Middle East, Central Asia and the Caucasus, largely originating from the [[Babylonian Jewry]] of the classic period. The term Mizrahi is used in Israel in the language of politics, media and some social scientists for Jews from the Arab world and adjacent, primarily Muslim-majority countries. The definition of Mizrahi includes the modern [[Iraqi Jews]], [[Syrian Jews]], [[Lebanese Jews]], [[Persian Jews]], [[History of the Jews in Afghanistan|Afghan Jews]], [[Bukharian Jews]], [[Kurdish Jews]], [[Mountain Jews]], [[Georgian Jews]]. Some also include the North-African Sephardic communities and Yemenite Jews under the definition of Mizrahi, but do that from rather political generalization than ancestral reasons.\n\n====Yemenite Jews====\n{{main|Yemenite Jews}}\n[[Temanim]] are Jews who were living in [[Yemen]] prior to immigrating to Ottoman Palestine and Israel. Their geographic and social isolation from the rest of the Jewish community over the course of many centuries allowed them to develop a liturgy and set of practices that are significantly distinct from those of other Oriental Jewish groups; they themselves comprise three distinctly different groups, though the distinction is one of religious law and liturgy rather than of ethnicity. Traditionally the genesis of the Yemenite Jewish community came after the Babylonian exile, though the community most probably emerged during Roman times, and it was significantly reinforced during the reign of [[Dhu Nuwas]] in the 6th century CE and during later Muslim conquests in the 7th century CE, which drove the Arab Jewish tribes out of central Arabia.\n\n====Karaite Jews====\n[[Karaite Judaism|Karaim]] are Jews who used to live mostly in Egypt, Iraq, and [[Crimean Karaites|Crimea]] during the [[Middle Ages]]. They are distinguished by the form of Judaism which they observe. [[Rabbinic Jews]] of varying communities have affiliated with the Karaite community throughout the millennia. As such, Karaite Jews are less an ethnic division, than they are members of a particular branch of Judaism. [[Karaite Judaism]] recognizes the [[Tanakh]] as the single religious authority for the Jewish people. Linguistic principles and contextual exegesis are used in arriving at the correct meaning of the Torah. Karaite Jews strive to adhere to the plain or most obvious understanding of the text when interpreting the Tanakh. By contrast, [[Rabbinical Judaism]] regards an [[Oral Law]] (codified and recorded in the [[Mishnah]] and the [[Talmud]]) as being equally binding on Jews, and mandated by [[God]]. In Rabbinical Judaism, the Oral Law forms the basis of religion, morality, and Jewish life. Karaite Jews rely on the use of sound reasoning and the application of linguistic tools to determine the correct meaning of the Tanakh; while Rabbinical Judaism looks towards the Oral law codified in the Talmud, to provide the Jewish community with an accurate understanding of the Hebrew Scriptures.\n\nThe differences between Karaite and Rabbinic Judaism go back more than a thousand years. Rabbinical Judaism originates from the [[Pharisees]] of the Second Temple period. Karaite Judaism may have its origins among the [[Sadducees]] of the same era. Karaite Jews hold the entire Hebrew Bible to be a religious authority. As such, the vast majority of Karaites believe in the [[resurrection of the dead]].<ref>http://www.karaite-korner.org/karaite_faq.shtml</ref> Karaite Jews are widely regarded as being halachically Jewish by the Orthodox Rabbinate. Similarly, members of the rabbinic community are considered Jews by the Moetzet Hakhamim, if they are patrilineally Jewish.{{citation needed|date=October 2009}}\n\n===Modern era===\n\n====Israeli Jews====\nJews of Israel comprise an increasingly mixed wide range of Jewish communities making [[aliyah]] from Europe, North Africa, and elsewhere in the Middle East. While a significant portion of [[Israeli Jews]] still retain memories of their Sephardic, Ashkenazi and Mizrahi origins, mixed Jewish marriages among the communities are very common. There are also smaller groups of Yemenite Jews, Indian Jews and others, who still retain a semi-separate communal life. There are also approximately 50,000 adherents of [[Karaite Judaism]], most of whom live in Israel, but their exact numbers are not known, because most Karaites have not participated in any religious censuses. The [[Beta Israel]], though somewhat disputed as the descendants of the ancient Israelites, are widely recognized in Israel as Ethiopian Jews.\n\n====American Jews====\n{{See also|List of American Jews}}\n[[File:Welcome to the land of freedom.png|thumb|250px|European Jewish immigrants arriving in New York]]\nThe ancestry of most [[American Jews]] goes back to [[Ashkenazi Jewish]] communities that immigrated to the US in the course of the 19th and 20th centuries, as well as more recent influxes of Persian and other Mizrahi Jewish immigrants. The American Jewish community is considered to contain the highest percentage of mixed marriages between Jews and non-Jews, resulting in both increased assimilation and a significant influx of non-Jews becoming identified as Jews. The most widespread practice in the U.S is [[Reform Judaism]], which doesn't require or see the Jews as direct descendants of the ethnic Jews or Biblical Israelites, but rather adherents of the Jewish faith in its Reformist version, in contrast to [[Orthodox Judaism]], the mainstream practice in Israel, which considers the Jews as a closed ethnoreligious community with very strict procedures for conversion.\n\n====French Jews====\n[[File:1182 french expulsion of jews.jpg|thumb|Expulsion of French Jews, 1182]]\nThe Jews of modern France number around 400,000 persons, largely descendants of North African communities, some of which were Sephardic communities that had come from Spain and Portugal—others were Arab and [[Berber Jews]] from Algeria, Morocco and Tunisia, who were already living in North Africa before the Jewish exodus from the Iberian Peninsula—and to a smaller degree members of the Ashkenazi Jewish communities, who survived WWII and the [[Holocaust]].\n\n====Mountain Jews====\n\n[[Mountain Jews]] are [[Jew]]s from the eastern and northern slopes of the [[Caucasus]], mainly [[Azerbaijan]], [[Chechnya]] and [[Dagestan]]. They are the descendants of [[Persian Jews]] from [[Iran]].<ref>{{Cite web|title = Mountain Jews - Tablet Magazine – Jewish News and Politics, Jewish Arts and Culture, Jewish Life and Religion|url = http://www.tabletmag.com/jewish-news-and-politics/42649/mountain-jews|website = Tablet Magazine|accessdate = 2015-12-27}}</ref>\n\n====Bukharan Jews====\n[[Bukharan Jews]] are an ethnic group from Central Asia who historically practised Judaism and spoke Bukhori, a dialect of the Tajik-Persian language.\n\n====Kaifeng Jews====\n\nThe [[Kaifeng Jews]] are members of a small [[History of the Jews in China|Jewish]] community in [[Kaifeng]], in the [[Henan]] province of [[China]] who have assimilated into Chinese society while preserving some Jewish traditions and customs.\n\n====Cochin Jews====\n\n[[Cochin Jews]] also called '''Malabar Jews,''' are the oldest group of [[Indian Jews|Jews in India]], with possible roots that are claimed to date back to the time of [[King Solomon]].<ref>[https://books.google.com/books?id=qhKGPprbQaYC&printsec=frontcover&dq=isbn:9652781797&hl=en&sa=X&ei=UNa1VM-AFc_kuQSLiYLIAQ&ved=0CB8Q6wEwAA#v=onepage&q=two%20millennia&f=false ''The Jews of India: A Story of Three Communities''] by Orpa Slapak. The Israel Museum, Jerusalem. 2003. p. 27. {{ISBN|965-278-179-7}}.</ref><ref>Weil, Shalva. \"Jews in India.\" in M. Avrum Erlich (ed.) ''Encyclopaedia of the Jewish Diaspora'', Santa Barbara, USA: ABC CLIO. 2008, 3: 1204-1212.</ref> The Cochin Jews settled in the [[Kingdom of Cochin]] in [[South India]],<ref>Weil, Shalva. ''India's Jewish Heritage: Ritual, Art and Life-Cycle,'' Mumbai: Marg Publications, 2009. [first published in 2002; 3rd edn] Katz 2000; Koder 1973; Menachery 1998</ref> now part of the state of [[Kerala]].<ref>Weil, Shalva. \"Cochin Jews\", in Carol R. Ember, Melvin Ember and Ian Skoggard (eds) ''Encyclopedia of World Cultures Supplement'', New York: Macmillan Reference USA, 2002. pp. 78-80.</ref><ref>Weil, Shalva.  \"Cochin Jews\" in Judith Baskin (ed.)'' Cambridge Dictionary of Judaism and Jewish Culture'', New York: Cambridge University Press, 2011. pp. 107.</ref> As early as the 12th century, mention is made of the Black Jews in southern India. The Jewish traveler, [[Benjamin of Tudela]], speaking of [[Kollam]] (Quilon) on the Malabar Coast, writes in his ''Itinerary'': \"...throughout the island, including all the towns thereof, live several thousand Israelites. The inhabitants are all black, and the Jews also. The latter are good and benevolent. They know the [[law of Moses]] and the prophets, and to a small extent the [[Talmud]] and [[Halacha]].\"<ref>''The Itinerary of Benjamin of Tudela'' (ed. Marcus Nathan Adler), Oxford University Press, London 1907, p. 65</ref> These people later became known as the Malabari Jews. They built synagogues in [[Kerala]] beginning in the 12th and 13th centuries.<ref name=\"isjm\">Weil, Shalva. ''From Cochin to Israel''. Jerusalem: Kumu Berina, 1984. (Hebrew)</ref><ref>Weil, Shalva. \"Kerala to restore 400-year-old Indian synagogue\", ''The Jerusalem Post''. 2009.</ref> They are known to have developed [[Judeo-Malayalam]], a dialect of the [[Malayalam]] language.\n\n====Paradesi Jews====\n\n[[Paradesi Jews]] are mainly the descendents of [[Sephardic]] Jews who originally immigrated to India from Sepharad (Spain and Portugal) during the 15th and 16th centuries in order to flee forced conversion or persecution in the wake of the [[Alhambra Decree]] which expelled the Jews from Spain. They are sometimes referred to as White Jews, although that usage is generally considered pejorative or discriminatory and it is instead used to refer to relatively recent Jewish immigrants (end of the 15th century onwards), who are predominantly Sephardim.<ref name=\"Orpa Slapak\"/>\n\nThe Paradesi Jews of Cochin are a community of Sephardic Jews whose ancestors settled among the larger [[Cochin Jews|Cochin Jewish]] community located in [[Kerala]], a coastal southern state of India.<ref name=\"Orpa Slapak\">The Jews of India: A Story of Three Communities by Orpa Slapak. The Israel Museum, Jerusalem. 2003. p. 28. {{ISBN|965-278-179-7}}.</ref>\n\nThe Paradesi Jews of [[Madras]] traded in diamonds, precious stones and corals, they had very good relations with the rulers of Golkonda, they maintained trade connections with Europe, and their language skills were useful. Although the Sephardim spoke [[Judaeo-Spanish|Ladino]] (i.e. Spanish or Judeo-Spanish), in India they learned to speak [[Tamil language|Tamil]] and [[Judeo-Malayalam]] from the Malabar Jews.<ref name=Katz-Koder-Puthiakunnel>Katz 2000; Koder 1973; Thomas Puthiakunnel 1973</ref>{{full citation needed|date=May 2016}}\n\n====Georgian Jews====\nThe [[Georgian Jews]] are  considered ethnically and culturally distinct from neighboring Mountain Jews. They were also traditionally a highly separate group from the Ashkenazi Jews in Georgia.\n\n====Krymchaks====\nThe [[Krymchaks]] are Jewish ethno-religious communities of Crimea derived from Turkic-speaking adherents of Orthodox Judaism.\n\n====Anusim====\nDuring the history of the Jewish diaspora, Jews who lived in Christian Europe were often attacked by the local Christian population, and they were often [[forced to convert to Christianity]]. Many, known as \"[[Anusim]]\" ('forced-ones'), continued practicing Judaism in secret while living outwardly as ordinary Christians. The best known Anusim communities were the [[Jews of Spain]] and the [[Jews of Portugal]], although they existed throughout Europe. In the centuries since the rise of [[Islam]], many Jews living in the [[Muslim world]] were [[forced to convert to Islam]]{{Citation needed|date=October 2015}}, such as the [[Mashhad]]i Jews of [[Persia]], who continued to practice Judaism in secret and eventually [[aliyah|moved to Israel]]. Many of the Anusim's descendants left Judaism over the years. The results of a genetic study of the population of the [[Iberian Peninsula]] released in December 2008 \"attest to a high level of religious conversion (whether voluntary or enforced) driven by historical episodes of religious intolerance, which ultimately led to the integration of the Anusim's descendants.<ref>[http://www.cell.com/AJHG/fulltext/S0002-9297(08)00592-2]</ref>\n\n====Modern Samaritans====\nThe [[Samaritan]]s, who comprised a comparatively large group in classical times, now number 745 people, and today they live in two communities in [[Israel]] and the [[West Bank]], and they still regard themselves as descendants of the tribes of Ephraim (named by them as ''Aphrime'') and Manasseh (named by them as ''Manatch''). Samaritans adhere to a version of the [[Torah]] known as the [[Samaritan Pentateuch]], which differs in some respects from the [[Masoretic text]], sometimes in important ways, and less so from the [[Septuagint]].\n\nThe Samaritans consider themselves ''Bnei Yisrael'' (\"Children of Israel\" or \"Israelites\"), but they do not regard themselves as ''Yehudim'' (Jews). They view the term \"Jews\" as a designation for followers of Judaism, which they assert is a related but an altered and amended religion which was brought back by the exiled Israelite returnees, and is therefore not the true religion of the ancient Israelites, which according to them is [[Samaritanism]].\n\n====Genetic studies====\n{{Main|Genetic studies on Jews}}\n[[Y chromosome|Y DNA]] studies tend to imply a small number of founders in an old population whose members parted and followed different migration paths.<ref name=\"hammer2000\">{{cite journal|vauthors=Hammer MF, Redd AJ, Wood ET |title=Jewish and Middle Eastern non-Jewish populations share a common pool of Y-chromosome biallelic haplotypes|journal=Proceedings of the National Academy of Sciences of the United States of America|volume=97|issue=12|pages=6769–6774|date=June 2000|pmid=10801975|pmc=18733|doi=10.1073/pnas.100115997|bibcode=2000PNAS...97.6769H|ref=harv|display-authors=etal}}</ref> In most Jewish populations, these male line ancestors appear to have been mainly [[Middle East]]ern. For example, Ashkenazi Jews share more common paternal lineages with other Jewish and Middle Eastern groups than with non-Jewish populations in areas where Jews lived in [[Eastern Europe]], [[Germany]] and the French [[Rhine|Rhine Valley]]. This is consistent with Jewish traditions which place most Jewish paternal origins in the region of the Middle East.<ref name=\"Nebel 2001\">{{cite journal|author1=Nebel Almut |author2=Filon Dvora |author3=Brinkmann Bernd |author4=Majumder Partha P. |author5=Faerman Marina |author6=Oppenheim Ariella |year=2001|title=The Y Chromosome Pool of Jews as Part of the Genetic Landscape of the Middle East|journal=The American Journal of Human Genetics|volume=69|issue=5| pages=1095–112|pmc=1274378|pmid=11573163|doi=10.1086/324070|ref=harv}}</ref><ref>Molecular Photofitting: Predicting Ancestry and Phenotype Using DNA by Tony Nick Frudakis P:383 [https://books.google.com/books?id=9vXeydpj7VkC&pg=PA383&dq=ashkenazi+jews+middle+eastern+origin+bronze+age&hl=en&sa=X&ei=MQ_SUKWvFISa0QXSvIDIDA&redir_esc=y#v=onepage&q=ashkenazi%20jews%20middle%20eastern%20origin%20bronze%20age&f=false]</ref>\nConversely, the maternal lineages of Jewish populations, studied by looking at [[mitochondrial DNA]], are generally more heterogeneous.<ref name=\"Behar2008b\">{{cite journal|author=Behar DM, Metspalu E, Kivisild T|title=Counting the Founders: The Matrilineal Genetic Ancestry of the Jewish Diaspora|journal=PLoS ONE|volume=3|issue=4|pages=e2062|year=2008|pmid=18446216|pmc=2323359|doi=10.1371/journal.pone.0002062|editor1-last=MacAulay|editor1-first=Vincent|bibcode = 2008PLoSO...3.2062B|ref=harv|display-authors=etal}}</ref> Scholars such as [[Harry Ostrer]] and [[Raphael Falk]] believe this indicates that many Jewish males found new mates from European and other communities in the places where they migrated in the diaspora after fleeing ancient Israel.<ref name=\"Lewontin\">{{cite magazine |last=Lewontin |first=Richard |authorlink=Richard Lewontin |date=6 December 2012 |title=Is There a Jewish Gene? |url=http://www.nybooks.com/articles/2012/12/06/is-there-a-jewish-gene/ |magazine=New York Review of Books}}</ref> In contrast, Behar has found evidence that about 40% of Ashkenazi Jews originate maternally from just four female founders, who were of Middle Eastern origin. The populations of Sephardi and Mizrahi Jewish communities \"showed no evidence for a narrow founder effect.\"<ref name=\"Behar2008b\" /> Subsequent studies carried out by Feder et al. confirmed the large portion of the non-local maternal origin among Ashkenazi Jews. Reflecting on their findings related to the maternal origin of Ashkenazi Jews, the authors conclude \"Clearly, the differences between Jews and non-Jews are far larger than those observed among the Jewish communities. Hence, differences between the Jewish communities can be overlooked when non-Jews are included in the comparisons.\"<ref name=\"ncbi.nlm.nih.gov\">{{cite journal|pmid=20560205|year=2010|last1=Atzmon|first1=G|last2=Hao|first2=L|last3=Pe'Er|first3=I|last4=Velez|first4=C|last5=Pearlman|first5=A|last6=Palamara|first6=PF|last7=Morrow|first7=B|last8=Friedman|first8=E|last9=Oddoux|first9=C|title=Abraham's children in the genome era: Major Jewish diaspora populations comprise distinct genetic clusters with shared Middle Eastern Ancestry|volume=86|issue=6|pages=850–9|pmc=3032072|journal=American Journal of Human Genetics|doi=10.1016/j.ajhg.2010.04.015}}</ref><ref>{{cite journal|url=http://www.nature.com/ejhg/journal/v15/n4/full/5201764a.html|doi=10.1038/sj.ejhg.5201764|title=Ashkenazi Jewish mtDNA haplogroup distribution varies among distinct subpopulations: Lessons of population substructure in a closed group|year=2007|last1=Feder|first1=Jeanette|last2=Ovadia|first2=Ofer|last3=Glaser|first3=Benjamin|last4=Mishmar|first4=Dan|journal=European Journal of Human Genetics|volume=15|issue=4|pages=498–500|pmid=17245410}}</ref><ref name=\"ReferenceA\">{{cite journal|pmid=23052947|year=2013|last1=Ostrer|first1=H|last2=Skorecki|first2=K|title=The population genetics of the Jewish people|volume=132|issue=2|pages=119–27|doi=10.1007/s00439-012-1235-6|pmc=3543766|journal=Human Genetics}}</ref>\n\nStudies of [[Autosome|autosomal DNA]], which look at the entire DNA mixture, have become increasingly important as the technology develops. They show that Jewish populations have tended to form relatively closely related groups in independent communities, with most people in a community sharing significant ancestry in common.<ref name=\"nature.com\">{{cite web|url=http://www.nature.com/news/2010/100603/full/news.2010.277.html|doi=10.1038/news.2010.277\n|title=Jews worldwide share genetic ties|year=2010 |first=Alla |last=Katsnelson}}</ref> For Jewish populations of the diaspora, the genetic composition of [[Ashkenazi Jews|Ashkenazi]], [[Sephardi Jews|Sephardi]], and [[Mizrahi Jews|Mizrahi]] Jewish populations show a predominant amount of shared Middle Eastern ancestry. According to Behar, the most parsimonious explanation for this shared Middle Eastern ancestry is that it is \"consistent with the historical formulation of the Jewish people as descending from ancient [[Hebrews|Hebrew]] and [[Israelites|Israelite]] residents of the [[Levant]]\" and \"the dispersion of the people of ancient Israel throughout the [[Old World]]\".<ref name=\"Behar2010\" /> [[North Africa]]n, [[Italian Peninsula|Italian]] and others of [[Iberian Peninsula|Iberian]] origin show variable frequencies of admixture with non-Jewish historical host populations among the maternal lines. In the case of Ashkenazi and Sephardi Jews (in particular [[Moroccan Jews]]), who are closely related, the source of non-Jewish admixture is mainly [[southern Europe]]an, while Mizrahi Jews show evidence of admixture with other Middle Eastern populations and [[Sub-Saharan Africa]]ns. Behar ''et al.'' have remarked on an especially close relationship of Ashkenazi Jews and modern [[Italians]].<ref name=\"Behar2010\" /><ref name=zooss>{{cite journal|journal=Biol Direct |year=2010 |volume=5 |issue=57 |doi=10.1186/1745-6150-5-57 |title=The Origin of Eastern European Jews Revealed by Autosomal, Sex Chromosomal and mtDNA Polymorphisms |first=Avshalom |last=Zoossmann-Diskin |pmc=2964539 |pmid=20925954 |url=http://www.biology-direct.com/content/5/1/57 |page=57 |ref=harv |deadurl=yes |archiveurl=https://web.archive.org/web/20121116090339/http://www.biology-direct.com/content/5/1/57 |archivedate=16 November 2012 }}</ref><ref>{{cite news|title=Did Modern Jews Originate in Italy?|url=http://news.sciencemag.org/biology/2013/10/did-modern-jews-originate-italy|accessdate=21 October 2013|newspaper=[[Science (journal)|Science]]|date=8 October 2013}}</ref> Jews were found to be more closely related to groups in the north of the Fertile Crescent (Kurds, Turks, and Armenians) than to Arabs.<ref>{{cite journal |pmid=11573163 | doi=10.1086/324070 | pmc=1274378 | volume=69 | title=The Y chromosome pool of Jews as part of the genetic landscape of the Middle East | date=November 2001 | journal=Am. J. Hum. Genet. | pages=1095–112 | last1 = Nebel | first1 = A | last2 = Filon | first2 = D | last3 = Brinkmann | first3 = B | last4 = Majumder | first4 = PP | last5 = Faerman | first5 = M | last6 = Oppenheim | first6 = A}}</ref>\n\nThe studies also show that persons of [[Sephardic Bnei Anusim]] origin (those who are descendants of the \"[[anusim]]\" who were [[Forced conversion|forced to convert]] to [[Catholicism]]) throughout today's [[Iberia]] ([[Spain]] and [[Portugal]]) and [[Ibero-America]] ([[Hispanic America]] and [[Brazil]]), estimated that up to 19.8% of the modern population of Iberia and at least 10% of the modern population of Ibero-America, has [[Sephardic Jew]]ish ancestry within the last few centuries. The [[Bene Israel]] and the [[Cochin Jews]] of [[India]], [[Beta Israel]] of [[Ethiopia]], and a portion of the [[Lemba people]] of [[Southern Africa]], meanwhile, despite more closely resembling the local populations of their native countries, also have some more remote ancient Jewish descent.<ref>{{cite web|url=http://forward.com/articles/155742/jews-are-a-race-genes-reveal/?p=all |title=Jews Are a 'Race,' Genes Reveal&nbsp;– |publisher=Forward.com |accessdate=12 April 2013}}</ref><ref name=discovermagazine>{{cite web|url=http://blogs.discovermagazine.com/gnxp/2010/06/genetics-the-jews-its-still-complicated/ |title=Genetics & the Jews (it's still complicated) : Gene Expression |doi=10.1038/nature09103 |publisher=Blogs.discovermagazine.com |date=10 June 2010 |accessdate=12 April 2013|bibcode=2010Natur.466..238B }}</ref><ref name=\"in.reuters.com\">{{cite web|last=Begley |first=Sharon |url=http://in.reuters.com/article/2012/08/06/us-science-genetics-jews-idINBRE8751EI20120806?mlt_click=Master+Sponsor+Logo%28Active%29_19_More+News_sec-col1-m1_News |title=Genetic study offers clues to history of North Africa's Jews &#124; Reuters |publisher=In.reuters.com |accessdate=12 April 2013}}</ref><ref name=\"ReferenceA\"/>\n\n==Zionist \"Negation of the Diaspora\"==\n{{Main|Negation of the Diaspora|Diaspora Jew}}\n{{Aliyah}}\nAccording to [[Eliezer Schweid]], the rejection of life in the Diaspora is a central assumption in all currents of [[Zionism]].<ref>E. Schweid, \"Rejection of the Diaspora in Zionist Thought\", in ''Essential Papers on Zionsm'', ed. By Reinharz & Shapira, 1996, {{ISBN|0-8147-7449-0}}, p.133</ref> Underlying this attitude was the feeling that the Diaspora restricted the full growth of Jewish national life. For instance the poet [[Hayim Nahman Bialik]] wrote:\n\n<blockquote><poem>\nAnd my heart weeps for my unhappy people ...\nHow burned, how blasted must our portion be,\nIf seed like this is withered in its soil. ...\n</poem></blockquote>\n\nAccording to Schweid, Bialik meant that the \"seed\" was the potential of the Jewish people. Preserved in the Diaspora, this seed could only give rise to deformed results; however, once conditions changed the seed could still provide a plentiful harvest.<ref>Schweid, p. 157</ref>\n\nIn this matter Sternhell distinguishes two schools of thought in Zionism. One was the liberal or utilitarian school of [[Theodor Herzl]] and [[Max Nordau]]. Especially after the [[Dreyfus Affair]], they held that [[Antisemitism|anti-Semitism]] would never disappear and they saw Zionism as a rational solution for Jewish individuals.\n\nThe other was the organic nationalist school. It was prevalent among the Zionist olim and they saw the movement as a project to rescue the Jewish nation rather than as a project to only rescue Jewish individuals. For them, Zionism was the \"Rebirth of the Nation\".<ref>Z. Sternhell, ''The Founding Myths of Israel'', 1998, pp. 3–36, {{ISBN|0-691-01694-1}}, pp. 49–51</ref>\n\nContrary to the negation of the diaspora view, the acceptance of Jewish communities outside Israel was postulated by those, like [[Simon Rawidowicz]] (also a Zionist), who viewed the Jews as a culture which had evolved into a new 'worldly' entity that had no reason to seek an exclusive return, either physical, emotional or spiritual to its indigenous lands, and who believed that the Jews could remain one people even outside Israel.\n\nIt was argued that the dynamics of the diaspora which were affected by persecution, numerous subsequent exiles, as well as by political and economic conditions, had created a new Jewish awareness of the World, and a new awareness of the Jews by the World.{{citation needed|date=December 2016}}\n\nIn effect there are many Zionists today who do not embrace the \"Negation of the Diaspora\" as any kind of absolute {{citation needed|date=December 2016}}, and who see no conflict—and even a beneficial and worldly and positive symbiosis—between a diaspora of healthy self-respecting Jewish communities (such as those which have evolved in the United States, Canada, and several other Western countries) and a vital and evolving Israeli society and state of Israel.{{citation needed|date=December 2016}}\n\n==Mystical explanation==\nRabbi Tzvi Elimelech of Dinov (Bnei Yissaschar, Chodesh Kislev, 2:25) explains that each exile was characterized by a different negative aspect:<ref>{{cite web |url=http://www.chabad.org/kabbalah/article_cdo/aid/1693257/jewish/Lessons-from-the-Dreidel.htm |title=Lessons from the Dreidel |publisher=Chabad.org}}</ref>\n\n# The [[Babylonian exile]] was characterized by physical suffering and oppression. The Babylonians were lopsided towards the [[Sefirah]] of [[Gevurah]], strength and bodily might.\n# The [[Persia]]n exile was one of emotional temptation. The Persians were hedonists who declared that the purpose of life is to pursue indulgence and lusts—\"Let us eat and drink, for tomorrow we may die.\" They were lopsided towards the quality of [[Chesed]], attraction and kindness (albeit to the self).\n# [[Hellenistic civilization]] was highly cultured and sophisticated. Although the Greeks had a strong sense of aesthetics, they were highly pompous, and they viewed aesthetics as an end in itself. They were excessively attached to the quality of [[Tiferet]], beauty. This was also related to an appreciation of the intellect's transcendence over the body, which reveals the beauty of the spirit.\n# The exile of [[Edom]] began with [[Ancient Rome|Rome]], whose culture lacked any clearly defined philosophy. Rather, it adopted the philosophies of all the preceding cultures, causing Roman culture to be in a constant flux. Although the Roman Empire has fallen, the Jews are still in the exile of Edom, and indeed, one can find this phenomenon of ever-changing trends dominating modern [[Western culture|western society]]. The Romans and the various nations who inherited their rule (e.g., the [[Holy Roman Empire]], the [[Europe]]ans, the [[United States|Americans]]) are lopsided towards [[Malchut]], sovereignty, the lowest Sefirah, which can be received from any of the others, and can act as a medium for them.\n\nThe Jewish fast day of [[Tisha B'Av]] commemorates the destruction of the [[First Temple|First]] and [[Second Temple|Second]] Temples in [[Jerusalem]] and the subsequent [[exile]] of the Jews from the [[Land of Israel]]. The Jewish tradition maintains that the Roman exile would be the last, and that after the people of Israel returned to their land, they would never be exiled again. This statement is based on the verse: \"(You paying for) Your sin is over daughter of [[Zion]], he will not exile you (any)more\" [\"תם עוונך בת ציון, לא יוסף להגלותך\"].<ref>[[Tanakh]], [[Book of Lamentations|Lamentations]] 4:22</ref>\n\n==In Christian theology==\n{{Expand section|1=Requires quotes from early Christian theologians |2=Role in antisemitism, The Wandering Jew|date=June 2017}}\nAccording to [[Aharon Oppenheimer]], the concept of the exile beginning after the destruction of the Second Jewish Temple was developed by early Christians, who saw the destruction of the Temple as a punishment for Jewish [[deicide]], and by extension as an affirmation of the Christians as God's new [[Supersessionism|chosen people]], or the \"New Israel\". In actually, in the period that followed the destruction of the Temple, Jews had many freedoms. The people of Israel had religious, economic and cultural autonomy, and the [[Bar Kochba revolt]] demonstrated the unity of Israel and their political-military power at that time. Therefore, according to [[Aharon Oppenheimer]], it should be noted that the Jewish exile only started after the [[Bar Kochba revolt]], which devastated the Jewish community of Judea. Despite popular conception, Jews have had a continuous presence in the Land of Israel, despite the exile of the majority of Judeans.  The Jerusalem Talmud was signed in the fourth century, hundreds of years after the revolt. Moreover, many Jews remained in Israel even centuries later, including during the Byzantine period (many remnants of synagogues are found from this period).<ref>{{cite web |url=https://www.jewishvirtuallibrary.org/jsource/History/Diaspora.html |title=The Diaspora |publisher=Jewish Virtual Library}}</ref> Jews have been a majority or a significant plurality in [[Jerusalem]] in the millennia since their exile with few exceptions (including the period following the [[Siege of Jerusalem (1099)]] by the Crusaders and the 18 years of Jordanian occupation of eastern Jerusalem, in which Jerusalem's historic Jewish quarter was expelled).\n\n==Historical comparison of Jewish population==\n{{main|Historical Jewish population comparisons}}\n{| class=\"wikitable sortable\" style=\"text-align: right\"\n|-\n! Region\n! Jews, №<br />(1900)<ref name=\"jenc\">{{Cite Jewish Encyclopedia |title=Statistics |url=http://www.jewishencyclopedia.com/articles/13992-statistics}}</ref>\n! Jews, %<br />(1900)<ref name=\"jenc\"/>\n! Jews, №<br />(1942)<ref name=\"roosevelt\">{{cite web |url=http://docs.fdrlibrary.marist.edu/psf/box52/a467cg01.html |title=Distribution of the Jews in the World |first=Myron Charles |last=Taylor |authorlink=Myron Charles Taylor |year=1942 |work=Vatican Diplomatic Files |publisher=[[Franklin D. Roosevelt Presidential Library and Museum]] |accessdate=March 15, 2012}}</ref>\n! Jews, %<br />(1942)<ref name=\"roosevelt\"/>\n! Jews, №<br />(1970)<ref name=\"jppi\">{{cite web |url=http://jppi.org.il/uploads/2010_Annual_Assessment.pdf |title=Annual Assessment 2010 |first=Shlomo |last=Fischer |year=2011 |work=Executive Report No. 7 |publisher=[[The Jewish People Policy Institute]] |location=[[Jerusalem]] |format=[[Portable Document Format|PDF]] |isbn=978-9657549025 |accessdate=March 15, 2012}}</ref>\n! Jews, %<br />(1970)<ref name=\"jppi\"/>\n! Jews, №<br />(2010)<ref name=\"najdb\">{{cite web|url=http://www.jewishdatabank.org/Reports/World_Jewish_Population_2010.pdf |title=World Jewish Population, 2010 |first=Sergio |last=DellaPergola |authorlink=Sergio DellaPergola |editor1-first=Arnold |editor1-last=Dashefsky |editor1-link=Arnold Dashefsky |editor2-first=Ira |editor2-last=Sheskin |date=November 2, 2010 |work=Current Jewish Population Reports |publisher=North American Jewish Data Bank |location=[[Storrs, Connecticut]] |format=[[Portable Document Format|PDF]] |accessdate=March 15, 2012 |deadurl=yes |archiveurl=https://web.archive.org/web/20120209035446/http://www.jewishdatabank.org/Reports/World_Jewish_Population_2010.pdf |archivedate=February 9, 2012 |df= }}</ref>\n! Jews, %<br />(2010)<ref name=\"najdb\"/>\n|-\n| align=\"center\" | ''[[Jews and Judaism in Europe|Europe]]''\n| ''8,977,581''\n| ''2.20%''\n| ''9,237,314''\n| \n| ''3,228,000''\n| ''0.50%''\n| ''1,455,900''\n| ''0.18%''\n|-\n| align=\"left\" | [[History of the Jews in Austria|Austria]]{{ref label|austria|a}}\n| 1,224,899\n| 4.68%\n| \n| \n| \n| \n| 13,000\n| 0.06%\n|-\n| align=\"left\" | [[History of the Jews in Belgium|Belgium]]\n| 12,000\n| 0.18%\n| \n| \n| \n| \n| 30,300\n| 0.28%\n|-\n| align=\"left\" | [[History of the Jews in Bosnia and Herzegovina|Bosnia and Herzegovina]]\n| 8,213\n| 0.58%\n| \n| \n| \n| \n| 500\n| 0.01%\n|-\n| align=\"left\" | [[History of the Jews in Bulgaria|Bulgaria]]/[[History of the Jews in Turkey|Turkey]]/[[History of the Jews in the Ottoman Empire|Ottoman Empire]]{{ref label|ottoman|b}}\n| 390,018\n| 1.62%\n| \n| \n| \n| \n| 24,300\n| 0.02%\n|-\n| align=\"left\" | [[History of the Jews in Denmark|Denmark]]\n| 5,000\n| 0.20%\n| \n| \n| \n| \n| 6,400\n| 0.12%\n|-\n| align=\"left\" | [[History of the Jews in France|France]]\n| 86,885\n| 0.22%\n| \n| \n| 530,000\n| 1.02%\n| 483,500\n| 0.77%\n|-\n| align=\"left\" | [[History of the Jews in Germany|Germany]]\n| 586,948\n| 1.04%\n| \n| \n| 30,000\n| 0.04%\n| 119,000\n| 0.15%\n|-\n| align=\"left\" | [[History of the Jews in Hungary|Hungary]]{{ref label|hungary|c}}\n| 851,378\n| 4.43%\n| \n| \n| 70,000\n| 0.68%\n| 52,900\n| 0.27%\n|-\n| align=\"left\" | [[History of the Jews in Italy|Italy]]\n| 34,653\n| 0.10%\n| \n| \n| \n| \n| 28,400\n| 0.05%\n|-\n| align=\"left\" | [[History of the Jews in Luxembourg|Luxembourg]]\n| 1,200\n| 0.50%\n| \n| \n| \n| \n| 600\n| 0.12%\n|-\n| align=\"left\" | [[History of the Jews in the Netherlands|Netherlands]]\n| 103,988\n| 2.00%\n| \n| \n| \n| \n| 30,000\n| 0.18%\n|-\n| align=\"left\" | [[History of the Jews in Norway|Norway]]/[[History of the Jews in Sweden|Sweden]]\n| 5,000\n| 0.07%\n| \n| \n| \n| \n| 16,200\n| 0.11%\n|-\n| align=\"left\" | [[History of the Jews in Poland|Poland]]\n| 1,316,776\n| 16.25%\n| \n| \n| \n| \n| 3,200\n| 0.01%\n|-\n| align=\"left\" | [[History of the Jews in Portugal|Portugal]]\n| 1,200\n| 0.02%\n| \n| \n| \n| \n| 500\n| 0.00%\n|-\n| align=\"left\" | [[History of the Jews in Romania|Romania]]\n| 269,015\n| 4.99%\n| \n| \n| \n| \n| 9,700\n| 0.05%\n|-\n| align=\"left\" | [[History of the Jews in the Soviet Union|Russian Empire]] <small>(Europe)</small>{{ref label|russiaeu|d}}\n| 3,907,102\n| 3.17%\n| \n| \n| 1,897,000\n| 0.96%\n| 311,400\n| 0.15%\n|-\n| align=\"left\" | [[History of the Jews in Serbia|Serbia]]\n| 5,102\n| 0.20%\n| \n| \n| \n| \n| 1,400\n| 0.02%\n|-\n| align=\"left\" | [[History of the Jews in Spain|Spain]]\n| 5,000\n| 0.02%\n| \n| \n| \n| \n| 12,000\n| 0.03%\n|-\n| align=\"left\" | [[Jews and Judaism in Switzerland|Switzerland]]\n| 12,551\n| 0.38%\n| \n| \n| \n| \n| 17,600\n| 0.23%\n|-\n| align=\"left\" | [[History of the Jews in the United Kingdom|United Kingdom]]/[[History of the Jews in Ireland|Ireland]]\n| 250,000\n| 0.57%\n| \n| \n| 390,000\n| 0.70%\n| 293,200\n| 0.44%\n|-\n| align=\"center\" | ''[[List of Asian Jews|Asia]]''\n| ''352,340''\n| ''0.04%''\n| ''774,049''\n| \n| ''2,940,000''\n| ''0.14%''\n| ''5,741,500''\n| ''0.14%''\n|-\n| align=\"left\" | [[History of the Jews in the Arabian Peninsula|Arabia]]/[[Yemenite Jews|Yemen]]\n| 30,000\n| 0.42%\n| \n| \n| \n| \n| 200\n| 0.00%\n|-\n| align=\"left\" | [[History of the Jews in China|China]]/[[History of the Jews in Taiwan|Taiwan]]/[[History of the Jews in Japan|Japan]]\n| 2,000\n| 0.00%\n| \n| \n| \n| \n| 2,600\n| 0.00%\n|-\n| align=\"left\" | [[History of the Jews in India|India]]\n| 18,228\n| 0.0067%\n| \n| \n| \n| \n| 5,000\n| 0.00%\n|-\n| align=\"left\" | [[History of the Jews in Iran|Iran]]\n| 35,000\n| 0.39%\n| \n| \n| \n| \n| 10,400\n| 0.01%\n|-\n| align=\"left\" | [[Israel]]\n| \n| \n| \n| \n| 2,582,000\n| 86.82%\n| 5,413,800\n| 74.62%\n|-\n| align=\"left\" | [[History of the Jews in the Soviet Union|Russian Empire]] <small>(Asia)</small>{{ref label|russiaas|e}}\n| 89,635\n| 0.38%\n| \n| \n| 254,000\n| 0.57%\n| 18,600\n| 0.02%\n|-\n| align=\"center\" | ''[[African Jews|Africa]]''\n| ''372,659''\n| ''0.28%''\n| ''593,736''\n| \n| ''195,000''\n| ''0.05%''\n| ''76,200''\n| ''0.01%''\n|-\n| align=\"left\" | [[History of the Jews in Algeria|Algeria]]\n| 51,044\n| 1.07%\n| \n| \n| \n| \n| \n| \n|-\n| align=\"left\" | [[History of the Jews in Egypt|Egypt]]\n| 30,678\n| 0.31%\n| \n| \n| \n| \n| 100\n| 0.00%\n|-\n| align=\"left\" | [[Beta Israel|Ethiopia]]\n| 50,000\n| 1.00%\n| \n| \n| \n| \n| 100\n| 0.00%\n|-\n| align=\"left\" | [[History of the Jews in Libya|Libya]]\n| 18,680\n| 2.33%\n| \n| \n| \n| \n| \n| \n|-\n| align=\"left\" | [[History of the Jews in Morocco|Morocco]]\n| 109,712\n| 2.11%\n| \n| \n| \n| \n| 2,700\n| 0.01%\n|-\n| align=\"left\" | [[History of the Jews in South Africa|South Africa]]\n| 50,000\n| 4.54%\n| \n| \n| 118,000\n| 0.53%\n| 70,800\n| 0.14%\n|-\n| align=\"left\" | [[History of the Jews in Tunisia|Tunisia]]\n| 62,545\n| 4.16%\n| \n| \n| \n| \n| 1,000\n| 0.01%\n|-\n| align=\"center\" | ''[[Americas]]''\n| ''1,553,656''\n| ''1.00%''\n| ''4,739,769''\n| \n| ''6,200,000''\n| ''1.20%''\n| ''6,039,600''\n| ''0.64%''\n|-\n| align=\"left\" | [[History of the Jews of Argentina|Argentina]]\n| 20,000\n| 0.42%\n| \n| \n| 282,000\n| 1.18%\n| 182,300\n| 0.45%\n|-\n| align=\"left\" | [[Bolivia]]/[[List of Chilean Jews|Chile]]/[[Ecuador]]/[[Peru]]/[[Uruguay]]\n| 1,000\n| 0.01%\n| \n| \n| \n| \n| 41,400\n| 0.06%\n|-\n| align=\"left\" | [[History of the Jews in Brazil|Brazil]]\n| 2,000\n| 0.01%\n| \n| \n| 90,000\n| 0.09%\n| 107,329<ref name=\"ReferenceB\">[ftp://ftp.ibge.gov.br/Censos/Censo_Demografico_2010/Caracteristicas_Gerais_Religiao_Deficiencia/tab1_4.pdf 2010 Brazilian census] Brazilian Institute of Geography and Statistics. Retrieved on 2013-11-13</ref>\n| 0.05%\n|-\n| align=\"left\" | [[History of the Jews in Canada|Canada]]\n| 22,500\n| 0.42%\n| \n| \n| 286,000\n| 1.34%\n| 375,000\n| 1.11%\n|-\n| align=\"left\" | [[Central America]]\n| 4,035\n| 0.12%\n| \n| \n| \n| \n| 54,500\n| 0.03%\n|-\n| align=\"left\" | [[Colombia]]/[[The Guianas|Guiana]]/[[History of the Jews in Venezuela|Venezuela]]\n| 2,000\n| 0.03%\n| \n| \n| \n| \n| 14,700\n| 0.02%\n|-\n| align=\"left\" | [[History of the Jews in Mexico|Mexico]]\n| 1,000\n| 0.01%\n| \n| \n| 35,000\n| 0.07%\n| 39,400\n| 0.04%\n|-\n| align=\"left\" | [[Suriname]]\n| 1,121\n| 1.97%\n| \n| \n| \n| \n| 200\n| 0.04%\n|-\n| align=\"left\" | [[History of the Jews in the United States|United States]]\n| 1,500,000\n| 1.97%\n| 4,975,000\n| 3.00%\n| 5,400,000\n| 2.63%\n| 5,275,000\n| 1.71%\n|-\n| align=\"center\" | ''[[History of the Jews in Oceania|Oceania]]''\n| ''16,840''\n| ''0.28%''\n| ''26,954''\n| \n| ''70,000''\n| ''0.36%''\n| ''115,100''\n| ''0.32%''\n|-\n| align=\"left\" | [[History of the Jews in Australia|Australia]]\n| 15,122\n| 0.49%\n| \n| \n| 65,000\n| 0.52%\n| 107,500\n| 0.50%\n|-\n| align=\"left\" | [[History of the Jews in New Zealand|New Zealand]]\n| 1,611\n| 0.20%\n| \n| \n| \n| \n| 7,500\n| 0.17%\n|-\n! Total\n! 11,273,076\n! 0.68%\n! 15,371,822\n!\n! 12,633,000\n! 0.4%\n! 13,428,300\n! 0.19%\n|}\n\na.{{note|austria}} [[History of the Jews in Austria|Austria]], [[History of the Jews in the Czech Republic|Czech republic]], [[History of the Jews in Slovenia|Slovenia]]<br />\nb.{{note|ottoman}} [[Judaism in Albania|Albania]], [[History of the Jews in Iraq|Iraq]], [[History of the Jews in Jordan|Jordan]], [[History of the Jews in Lebanon|Lebanon]], [[History of the Jews in the Republic of Macedonia|Macedonia]], [[History of the Jews in Syria|Syria]], [[History of the Jews in Turkey|Turkey]]<br />\nc.{{note|hungary}}  [[History of the Jews in Croatia|Croatia]], [[History of the Jews in Hungary|Hungary]], [[History of the Jews in Slovakia|Slovakia]]<br />\nd.{{note|russiaeu}} [[Baltic states]] ([[History of the Jews in Estonia|Estonia]], [[History of the Jews in Latvia|Latvia]], [[History of the Jews in Lithuania|Lithuania]]), [[History of the Jews in Belarus|Belarus]], [[History of the Jews in Moldova|Moldova]], [[History of the Jews in Russia|Russia]] (including [[Siberia]]), [[History of the Jews in Ukraine|Ukraine]].<br />\ne.{{note|russiaas}} [[Caucasus]] ([[Jews in Armenia|Armenia]], [[Azerbaijani Jews|Azerbaijan]], [[History of the Jews in Georgia (country)|Georgia]]), [[Bukharan Jews|Central Asia]] ([[Jews in Kazakhstan|Kazakhstan]], [[Kyrgyzstan]], [[History of the Jews in Tajikistan|Tajikistan]], [[Turkmenistan]], [[Uzbek Jews|Uzbekistan]]).\n\n==Today==\nAs of 2010 the largest numbers of Jews live in [[Israel]] (5,703,700), [[United States of America|United States]] (5,275,000), [[France]] (483,500), [[Canada]] (375,000), the [[United Kingdom]] (269,000-292,000), [[Russia]] (205,000-1.5 million),<ref>{{cite journal|first= Mark |last= Tolts| title= Sources for the Demographic Study of the Jews in the Former Soviet Union| editor-first= Uzi |editor-last= Rebhun| url=https://books.google.com/books?id=0s_QAgAAQBAJ&pg=PA177 | work=The Social Scientific Study of Jewry: Sources, Approaches, Debates| publisher= Institute of Contemporary Jewry, The Hebrew University of Jerusalem/Oxford University Press| volume= XXV11 |year=2014 |page=170|isbn= 9780199363490}}</ref><ref>[http://www.interfax-religion.ru/?act=news&div=57988 В России проживает около миллиона иудеев] Interfax, 26 февраля 2015 года</ref><ref>[http://www.mskagency.ru/materials/2716461 STUDY: ABOUT 1.5 MILLION PEOPLE WITH JEWISH ROOTS LIVE IN RUSSIA] 20.10 12:14</ref> [[Argentina]] (182,300), [[Germany]] (119,000)<ref name=\"JewishWorldPop2010\">[http://www.bjpa.org/Publications/details.cfm?PublicationID=8075 World Jewish Population Study 2010], by Sergio DellaPergola, ed. Dashefsky, Arnold, Sheskin, Ira M., published by Association for the Social Scientific Study of Jewry (ASSJ), North American Jewish Data Bank, The Jewish Federations of North America, November 2010</ref> and [[Brazil]] (107,329).<ref name=\"ReferenceB\"/> These numbers reflect the \"core\" Jewish population, defined as being \"not inclusive of non-Jewish members of Jewish households, persons of Jewish ancestry who profess another monotheistic religion, other non-Jews of Jewish ancestry, and other non-Jews who may be interested in Jewish matters.\" Significant Jewish populations also remain in Middle Eastern and North African countries outside of Israel, particularly Iran, Turkey, Morocco, Tunisia, and Yemen. In general, these populations are shrinking due to low growth rates and high rates of emigration (particularly since the 1960s).\n\nThe [[Jewish Autonomous Oblast]] continues to be an [[Autonomous oblasts of Russia|Autonomous Oblast of Russia]].<ref>{{cite web|url=http://www.jewishaz.com/jewishnews/041008/revival.shtml |title=A Jewish revival in Birobidzhan? |publisher=Jewish News of Greater Phoenix |date=October 8, 2004 |deadurl=yes |archiveurl=https://web.archive.org/web/20110510142551/http://www.jewishaz.com/jewishnews/041008/revival.shtml |archivedate=May 10, 2011 |df= }}</ref> The [[Chief Rabbi]] of [[Birobidzhan]], [[Mordechai Scheiner]], says there are 4,000 Jews in the capital city.<ref>{{cite web|url=http://www.fjc.ru/news/newsArticle.asp?AID=525676&cid=84435&NewsType=80052 |title=From Tractors to Torah in Russia's Jewish Land |publisher=Federation of Jewish Communities of the CIS |date=June 1, 2007 |deadurl=yes |archiveurl=https://web.archive.org/web/20130411050518/http://fjc.ru/news/newsArticle.asp?AID=525676&cid=84435&NewsType=80052 |archivedate=April 11, 2013 |df= }}</ref> [[Governor]] [[Nikolay Mikhaylovich Volkov]] has stated that he intends to, \"support every valuable initiative maintained by our local Jewish organizations.\"<ref>{{cite web|url=http://www.fjc.ru/news/newsArticle.asp?AID=221939 |title=Governor Voices Support for Growing Far East Jewish Community |publisher=Federation of Jewish Communities of the CIS |date=November 15, 2004 |deadurl=yes |archiveurl=https://web.archive.org/web/20110518042318/http://www.fjc.ru/news/newsArticle.asp?AID=221939 |archivedate=May 18, 2011 |df= }}</ref> The [[Birobidzhan Synagogue]] opened in 2004 on the 70th anniversary of the region's founding in 1934.<ref>{{cite web|url=http://www.fjc.ru/news/newsArticle.asp?AID=166969 |title=Far East Community Prepares for 70th Anniversary of Jewish Autonomous Republic |publisher=Federation of Jewish Communities of the CIS |date=August 30, 2004 |deadurl=yes |archiveurl=https://web.archive.org/web/20110518041740/http://www.fjc.ru/news/newsArticle.asp?AID=166969 |archivedate=May 18, 2011 |df= }}</ref> An estimated 75,000 Jews live in the vast [[Siberia]] region.<ref>{{cite web |url=http://www.fjc.ru/news/newsArticle.asp?AID=136974 |title=Planting Jewish roots in Siberia |publisher=Federation of Jewish Communities of the CIS |date=May 24, 2004 |deadurl=yes |archiveurl=https://web.archive.org/web/20090827113526/http://www.fjc.ru/news/newsArticle.asp?AID=136974 |archivedate=August 27, 2009 |df= }}</ref>\n\n[[Metropolitan areas]] with the largest Jewish populations are listed below, though one source at jewishtemples.org,<ref>{{cite web |url=http://www.jewishtemples.org/ |title=Jewish Temples – World Jewish Population and Temple Directory |deadurl=yes |archiveurl=https://web.archive.org/web/20070913142408/http://www.jewishtemples.org/ |archivedate=2007-09-13 |df= }}</ref> states that \"It is difficult to come up with exact population figures on a country by country basis, let alone city by city around the world. Figures for Russia and other CIS countries are but educated guesses.\" The source cited here, the [http://www.bjpa.org/Publications/details.cfm?PublicationID=8075 2010 World Jewish Population Survey], also notes that \"Unlike our estimates of Jewish populations in individual countries, the data reported here on urban Jewish populations do not fully adjust for possible double counting due to multiple residences. The differences in the United States may be quite significant, in the range of tens of thousands, involving both major and minor metropolitan areas.\"<ref name=\"JewishWorldPop2010\" />\n\n# [[Gush Dan|Gush Dan (Tel Aviv and surroundings)]] – Israel – 2,979,900\n# [[New York City|New York City, New York]] – U.S. – 2,007,850\n# [[Jerusalem]] – 705,000\n# [[Los Angeles, California]] – U.S. – 684,950\n# [[Haifa]] – Israel – 671,400\n# [[Miami, Florida]] – U.S. – 485,850\n# [[Be'er Sheva]] – Israel – 367,600\n# [[San Francisco, California]] – U.S. – 345,700\n# [[Paris]] – France – 284,000\n# [[Chicago, Illinois]] – U.S. – 270,500\n# [[Philadelphia, Pennsylvania]] – U.S. – 263,800\n# [[Boston, Massachusetts]] – U.S. – 229,100\n# [[Washington, D.C.]] – U.S. – 215,600\n# [[London]] – United Kingdom – 195,000\n# [[Toronto]] – Canada – 180,000\n# [[Atlanta, Georgia]] – U.S. – 119,800\n# [[Moscow]] – Russia – 95,000\n# [[San Diego, California]] – U.S. – 89,000\n# [[Cleveland, Ohio]] – U.S. – 87,000<ref>http://www.jewishdatabank.org/study.asp?sid=90195&tp=6</ref>\n# [[Phoenix, Arizona]] – U.S. – 82,900\n# [[Montreal]] – Canada – 80,000\n# [[São Paulo]] – Brazil – 75,000<ref>{{cite web|url=https://www.jewishvirtuallibrary.org/jsource/vjw/Brazil.html#4 |title=Brazil - Modern-Day Community |publisher=www.jewishvirtuallibrary.org/ |year=2013 |accessdate=2013-12-22}}</ref>\n\n==See also==\n{{Div col|colwidth=30em}}\n* [[African Jews]]\n* [[Ashkenazi Jews]]\n* [[Australian Jews]]\n* [[Arab Jews]]\n* [[Baghdadi Jews]]\n* [[Banu Qurayza]]\n* [[British Jews]]\n* [[Bukharan Jews]]\n* [[East Asian Jews]]\n* [[Haredi Judaism]]\n* [[Hasidic Judaism]]\n* [[History of the Jews in Argentina]]\n* [[History of the Jews in Brazil]]\n* [[Homeland for the Jewish people]]\n* [[House of Israel (Ghana)]]\n* [[Igbo Jews]]\n* [[Italian Jews]]\n* [[Judaism in Mexico]]\n* [[Judaism in Nepal]]\n* [[Jewish Agency for Israel]]\n* [[Jewish exodus from Arab and Muslim countries]]\n* [[Jewish tribes of Arabia]]\n* [[Jews and Judaism in Europe]]\n* [[Jews by country]]\n* [[Jews in Indonesia]]\n* [[Jews in Turkey]]\n* [[Jews in Zimbabwe]]\n* [[Jews of Bilad el-Sudan]]\n* [[Mashhadi Jews]]\n* [[Mizrahi Jews]]\n* [[Moroccan Jews]]\n* [[Return to Zion]]\n{{div col end}}\n\n==References==\n{{reflist|30em}}\n\n==Bibliography==\n* [https://web.archive.org/web/20110807060506/http://www.jewishagency.org/JewishAgency/English/About/Press+Room/Jewish+Agency+In+The+News/2005/2005c/dec30cns.htm Immigration to Israel from North America hits 22-Year High] CNSNews.com, December 30, 2005\n*{{cite book|last1=Aviv|first1=Caryn S.|last2=Schneer|first2=David|title=New Jews: The End of the Jewish Diaspora|date=2005|publisher=New York University Press|location=New York|isbn=9780814740170|oclc=60321977}}\n* {{cite journal|title=Some Observations on the Name of Palestine|first=Louis H.|last=Feldman|journal=Hebrew Union College Annual|volume=61|date=1990|pages=1–23|publisher=Hebrew Union College - Jewish Institute of Religion|jstor=23508170|ref=harv}}\n* {{citation|url=http://cojs.org/when_palestine_meant_israel-_david_jacobson-_bar_27-03-_may-jun_2001/.|title=When Palestine Meant Israel|first=David|last=Jacobson|journal=Biblical Archeology Review|volume=27|issue=3|year=2001}}\n\n==External links==\n{{Commons category|Jewish diaspora}}\n* [http://www.jewishencyclopedia.com/view.jsp?artid=329&letter=D Jewish Diaspora] at the JewishEncyclopedia.com\n* [http://www.worldjewishcongress.org/en/communities World Jewish Congress – Jewish Communities]\n* Research and articles about the [http://bjpa.org/Publications/results.cfm?Topic=Diaspora-Experience&TopicID=470&SortBy=PublicationYear&SortDir=DESC&MaxRows=20 diaspora experience] and [http://bjpa.org/Publications/results.cfm?Topic=Diaspora-Relations&TopicID=20&SortBy=PublicationYear&SortDir=DESC&MaxRows=20 Israel-Diaspora relations] on the Berman Jewish Policy Archive @ NYU Wagner\n* [https://web.archive.org/web/20130508233644/http://sciencestage.com/v/18525/the-diaspora-and-israel-rich-cohen,-contributing-editor-at-vanity-fair-and-rolling-stone-conversatio.html The Diaspora and Israel – Rich Cohen]\n{{Jewish history}}\n{{Jews and Judaism}}\n\n{{DEFAULTSORT:Jewish diaspora}}\n[[Category:Jewish diaspora| ]]\n[[Category:Exile]]\n[[Category:Expulsions of Jews]]",
            "slug": "jewish-diaspora",
            "date_updated": 1537053249278,
            "imported": "https://en.wikipedia.org/wiki/Jewish diaspora"
        }
    ]
}