{
    "article": [
        {
            "title": "Ketuvim",
            "text": "{{refimprove|date=April 2008}}\n{{Books of Ketuvim |width=22.0em}}\n{{Tanakh OT}}\n{{Jews and Judaism sidebar |texts |width=22.0em}}\n\n'''Ketuvim''' ({{IPAc-en|k|ə|t|uː|ˈ|v|iː|m|,_|k|ə|ˈ|t|uː|v|ɪ|m}};<ref>[http://dictionary.reference.com/browse/ketuvim \"Ketuvim\"]. ''[[Random House Webster's Unabridged Dictionary]]''.</ref> {{lang-hbo|כְּתוּבִים}} ''Kəṯûḇîm'', \"writings\") is the third and final section of the [[Tanakh]] ([[Hebrew Bible]]), after [[Torah]] (instruction) and [[Nevi'im]] (prophets). In English translations of the Hebrew Bible, this section is usually titled \"Writings\".<ref>The first wave of synergism produced extraordinary results in terms of contemporary standards of literacy and belles lettres. The communal response of the first generation of Jews after the Exile had set the tone for centuries to come. Out of exile and diaspora had come at least two segments of the Hebrew Bible as we know it, Torah and Prophets, which were redacted no later than the end of the Persian period (circa 400 BCE); the third section of the Bible (the \"Hagiographa\") was available by this time as well. What was to become normative after 70 C.E. in Judaism had mostly been achieved and promulgated a half millennium before. — The Challenge of Hellenism for Early Judaism and Christianity by Eric M. Meyers, The Biblical Archaeologist, Vol. 55, No. 2 (Jun., 1992), pp. 84–91. Published by: The American Schools of Oriental Research.</ref> Another name used for this section is '''Hagiographa'''.\n\nThe Ketuvim are believed to have been written under [[Ruach HaKodesh|divine inspiration]], but with one level less authority than that of [[prophecy]].<ref>[[Jacob Neusner|Neusner, Jacob]], The Talmud Law, Theology, Narrative: A Sourcebook. University Press of America, 2005</ref>\n\nFound among the Writings within the Hebrew scriptures, I and II [[Books of Chronicles|Chronicles]] form one book, along with  [[Ezra]] and [[Nehemiah]] which form a single unit entitled \"[[Ezra–Nehemiah]]\".<ref>The Harper Collins Study Bible NRSV</ref>  (In citations by chapter and verse numbers, however, the Hebrew equivalents of \"Nehemiah\", \"I Chronicles\" and \"II Chronicles\" are used, as the system of chapter division was imported from Christian usage.)  Collectively, eleven books are included in the Ketuvim.\n\n== Groups of books ==\n\n===The poetic books===\nIn [[Masoretic]] manuscripts (and some printed editions), [[Psalms]], [[Book of Proverbs|Proverbs]] and [[Book of Job|Job]] are presented in a special two-column form emphasizing the parallel [[wikt:stich#English|stichs]] in the verses, which are a function of their [[Biblical poetry|poetry]]. Collectively, these three books are known as ''Sifrei Emet'' (an acronym of the titles in Hebrew, איוב, משלי, תהלים  yields ''Emet'' אמ\"ת, which is also the Hebrew for \"[[truth]]\").\n\nThese three books are also the only ones in the [[Hebrew Bible]] with a special system of [[cantillation]] notes that are designed to emphasize parallel stichs within verses. However, the beginning and end of the book of Job are in the normal prose system.\n\n===The five scrolls (''Hamesh Megillot'')===\nThe five relatively short books of [[Song of Songs]], [[Book of Ruth]], the [[Book of Lamentations]], [[Ecclesiastes]] and [[Book of Esther]] are collectively known as the ''Hamesh Megillot'' ([[Five Megillot]]). These are the latest books collected and designated as \"authoritative\" in the Jewish canon.<ref name=Coogan/> These scrolls are traditionally read over the course of the year in many Jewish communities. The list below presents them in the order they are read in the synagogue on holidays, beginning with the Song of Solomon on [[Passover]].\n\n===Other books===\nBesides the three poetic books and the five scrolls, the remaining books in Ketuvim are [[Book of Daniel|Daniel]], [[Ezra-Nehemiah]] and [[Books of Chronicles|Chronicles]]. Although there is no formal grouping for these books in the Jewish tradition, they nevertheless share a number of distinguishing characteristics:\n* The Talmudic tradition ascribes late authorship to all of them.\n* Two of them (Daniel and Ezra) are the only books in [[Tanakh]] with significant portions in [[Biblical Aramaic|Aramaic]].\n* These two also describe relatively late events (i.e. the Babylonian captivity and the subsequent restoration of Zion).\n\n== Order of the books ==\n{{Bible-related|CB}}\nThe following list presents the books of Ketuvim in the order they appear in most printed editions. It also divides them into three subgroups based on the distinctiveness of ''Sifrei Emet'' and ''Hamesh Megillot''.\n\nThe Three Poetic Books (''Sifrei Emet'')\n* Tehillim ([[Psalms]]) תְהִלִּים\n* Mishlei ([[Book of Proverbs]]) מִשְלֵי\n* Iyyôbh ([[Book of Job]]) אִיּוֹב\nThe [[Five Megillot]] (''Hamesh Megillot'')\n* Shīr Hashīrīm ([[Song of Songs]]) or (Song of Solomon) שִׁיר הַשִׁירִים  ([[Passover]])\n* Rūth ([[Book of Ruth]]) רוּת ([[Shābhû‘ôth]])\n* Eikhah ([[Book of Lamentations|Lamentations]]) איכה ([[Ninth of Av]]) [also called ''Kinnot'' in Hebrew]\n* Qōheleth ([[Ecclesiastes]]) קהלת ([[Sukkôth]])\n* Estēr ([[Book of Esther]]) אֶסְתֵר ([[Pûrîm]])\nOther Books\n* Dānî’ēl ([[Book of Daniel]]) דָּנִיֵּאל\n* ‘Ezrā ([[Book of Ezra]]-[[Book of Nehemiah]]) עזרא\n* Divrei ha-Yamim ([[Books of Chronicles|Chronicles]]) דברי הימים\n\nThe Jewish textual tradition never finalized the order of the books in Ketuvim. The [[Talmud|Babylonian Talmud]] ([[Bava Batra]] 14b–15a) gives their order as Ruth, Psalms, Job, Proverbs, Ecclesiastes, Song of Solomon, Lamentations of Jeremiah, Daniel, Scroll of Esther, Ezra, Chronicles.{{citation needed|date=January 2012}}\n\nIn Tiberian [[Masoretic]] codices, including the [[Aleppo Codex#Contents|Aleppo Codex]] and the [[Leningrad Codex#Sequence of the books|Leningrad Codex]], and often in old Spanish manuscripts as well, the order is Chronicles, Psalms, Job, Proverbs, Ruth, Song of Solomon, Ecclesiastes, Lamentations of Jeremiah, Esther, Daniel, Ezra.\n\n== Canonization ==\n{{main article|Development of the Hebrew Bible canon}}\nThe Ketuvim is the last of the three portions of the Tanakh to have been accepted as [[Biblical canon]], it is said that the people of Israel were adding what would become the Ketuvim to their holy literature shortly after the canonization of the prophets. There is no scholarly consensus as to when the Hebrew Bible canon was fixed: some scholars argue that it was fixed by the [[Hasmonean]] dynasty,<ref name=\"Philip R page 50\">Philip R. Davies in ''The Canon Debate'', page 50: \"With many other scholars, I conclude that the fixing of a canonical list was almost certainly the achievement of the Hasmonean dynasty.\"</ref> while others argue it was not fixed until the second century CE or even later.<ref name=Neusner/>\n\nWhile the Torah may have been considered canon by Israel as early as the 5th century BCE  and the [[Former Prophets|Former]] and [[Latter Prophets]] were canonized by the 2nd century BCE, [[Michael Coogan]] says that the Ketuvim was not a fixed canon until the 2nd century [[Common Era|CE]].<ref name=Coogan>[[Michael Coogan|Coogan, Michael]]. ''A Brief Introduction to the Old Testament: The Hebrew Bible in Its Context''. Oxford University Press, 2009, p. 5</ref> According to T. Henshaw, as early as 132 BCE some references suggesting that the Ketuvim was starting to take shape, though it lacked a formal title.<ref>Henshaw, T. ''The Writings: The Third Division of the Old Testament Canon''. George Allen & Unwin Ltd., 1963, pp. 16–17</ref> [[Jacob Neusner]] says something different, he argues that the notion of a biblical canon was not prominent in 2nd-century [[Rabbinic Judaism]] or even later.<ref name=Neusner>McDonald & Sanders, ''The Canon Debate'', 2002, page 5, cited are Neusner's ''Judaism and Christianity in the Age of Constantine'', pages 128–145, and ''Midrash in Context: Exegesis in Formative Judaism'', pages 1–22.</ref>\n\n''[[Against Apion]]'', the writing of [[Flavius Josephus|Josephus]] in 95 CE, treated the text of the Hebrew Bible as a closed canon to which \"... no one has ventured either to add, or to remove, or to alter a syllable...\";<ref>Lightfoot, Neil R. ''How We Got the Bible'', 3rd edition, rev. and expanded. Baker Book House Company. 2003, pp. 154–155</ref> Michael Barber, however, avers that Josephus' canon is \"not identical to that of the modern Hebrew Bible\".<ref name=Barber>{{cite web |url=http://www.thesacredpage.com/2006/03/loose-canons-development-of-old.html |title=Loose Canons: The Development of the Old Testament (Part 1) |first= Michael |last=Barber |date=2006-03-04}}</ref> For a long time, following this date, the divine inspiration of Esther, the Song of Songs, and Ecclesiastes was often under scrutiny.<ref>Henshaw, p. 17</ref>\n\nIn the 20th century, many scholars seemed to believe that the limits of the Ketuvim as canonized scripture were determined by the [[Council of Jamnia]] ({{circa}} 90 CE). But the theory of the Council of Jamnia is largely discredited today.<ref>{{citation |url=http://biblicalstudies.org.uk/pdf/jts/026_347.pdf |title=The Jamnia Period in Jewish History |author=W. M. Christie |publisher=Biblical Studies.org.uk}}</ref><ref>{{citation |author=[[Jack P. Lewis]] |title=Journal of Bible and Religion |volume=32 |others=No. 2 |date=April 1964 |chapter=What Do We Mean by Jabneh? |pages=125–132 |publisher=Oxford University Press |jstor=1460205}}</ref><ref>''[[Anchor Bible Dictionary]]'' Vol. III, pp.&nbsp;634–7 (New York 1992).</ref><ref>McDonald & Sanders, editors, ''The Canon Debate'', 2002, chapter 9: ''Jamnia Revisited'' by Jack P. Lewis.</ref>\n\n== Liturgical use ==\n{{see also|Jewish liturgy}}\n[[File:Aleppo-fascimile3-Ketuvim.pdf|thumb|235px|The [[Aleppo Codex]] from a facsimile edition. This file contains Ketuvim from the manuscript, including Chronicles, Psalms, Job, Proverbs, Ruth, and the beginning of the [[Song of Songs]]. The manuscript is missing the end of Ketuvim, including the rest of the Song of Songs, [[Ecclesiastes]], [[Book of Lamentations|Lamentations]] and [[Book of Esther|Esther]].]]\n\nThere is no formal system of synagogal reading of Ketuvim equivalent to the [[Torah portion]] and ''[[haftarah]]''. It is thought that there was once a cycle for reading the Psalms, parallel to the [[triennial cycle]] for Torah reading, as the number of psalms (150) is similar to the number of Torah portions in that cycle, and remnants of this tradition exist in [[Italian Jews#Italian rite Jews|Italy]]. All Jewish liturgies contain copious extracts from the Psalms, but these are normally sung to a regular recitative or rhythmic tune rather than read or chanted. Some communities also have a custom of reading Proverbs in the weeks following [[Passover|Pesach]], and Job on the [[Tisha B'Av|Ninth of Ab]].\n\nThe five megillot are read on the festivals, as mentioned above, though Sephardim have no custom of public reading of Song of Songs on Passover or Ecclesiastes on [[Sukkot]]. There are traces of an early custom of reading a ''haftarah'' from Ketuvim on [[Shabbat]] afternoons, but this does not survive in any community. Some [[Reform Judaism|Reform]] communities that operate a triennial cycle choose ''haftarot'' on Shabbat morning from Ketuvim as well as Neviim.\n\n===Extraliturgical public reading===\n{{main article|Seder ha-Mishmarah}}\nIn some Near and Middle Eastern Jewish traditions, the whole of Ketuvim (as well as the rest of the Tanakh and the [[Mishnah]]) is read each year on a weekly rota, usually on Shabbat afternoons. These reading sessions are not considered to be synagogue services, and often took place in the synagogue courtyard.\n\n===Cantillation===\nMedieval sources speak of three [[cantillation]] melodies, for Torah, Nevi'im and Ketuvim respectively. Today the position is more complicated. Oriental Sephardic communities preserve [[Cantillation#Psalms, Proverbs and Job|cantillation systems]] for the three poetic books, namely Psalms, Proverbs and the main part of Job (usually a different melody for each of the three books). No such systems exist in the Ashkenazi or [[Spanish and Portuguese Jews|Spanish and Portuguese]] traditions. However, the [[Ashkenazic]] [[yeshiva]] known as [[Yeshivat Aderet Eliyahu|Aderet Eliyahu]], in the Old City of Jerusalem, uses an adaptation of the Syrian cantillation-melody for these books, and this is becoming more popular among other Ashkenazim as well.\n\nIn all communities there are special cantillation melodies for Lamentations and Esther, and in some communities for the Song of Songs. Otherwise, the melody for the book of Ruth is considered the \"default\" melody for books of the Ketuvim not otherwise provided for. The \"prose\" passages at the beginning and end of the book of Job, as read on Tisha B'Av, may be read either to the tune of Ruth or to one resembling that for the Song of Songs.\n\n== The Targum to Ketuvim ==\n\nWestern [[targumim]] exist on ''Sifrei Emet'', on the [[Five Megillot]] and on Chronicles, i.e. on all the books of Ketuvim besides Daniel and Ezra (which contain large portions in Aramaic anyway). There are several complementary targumim to Esther.\n\nThere is, however, no \"official\" eastern (Babylonian) targum to Ketuvim, equivalent to [[Targum Onkelos]] on the Torah and [[Targum Jonathan]] on [[Nevi'im]]. In fact, the Babylonian [[Talmud]] explicitly notes the lack of a Targum to Ketuvim, explaining that [[Jonathan ben Uzziel]] was divinely prevented from completing his translation of the Bible.  A more prosaic explanation may consist in the lack of regular formal readings of Ketuvim in the synagogue (except the five Megillot), making it unnecessary to have an official system for line-by-line translation.\n\n== See also ==\n* [[Books of the Bible]]\n\n== References ==\n{{reflist|2}}\n\n== External links ==\n*[http://www.pizmonim.org David Betesh and the Sephardic Pizmonim Project] (Syrian melodies).\n*[https://web.archive.org/web/20040414011356/http://www.jewishsoftware.com/products/333.asp Tehillim ''(Psalms)'' on CD-Rom] (Syrian tradition, Rabbi Shimon Alouf).\n*[http://www.yutorah.org/searchResults.cfm?types=ALL&length=ALL&publication=ALL&categories=ALL&teacher=ALL&masechta=ALL&fromDaf=&toDaf=&series=4022&dates=ALL&language=ALL&keywords=&submitType=advanced Leining Master], Ashkenazi melodies for the five megillot.\n*[http://jnul.huji.ac.il/dl/music/purim/purim_eng.htm#kipur \"Potpourri for Purim\"], melodies for Megillat Ester in various traditional styles.\n\n{{Jews and Judaism}}\n\n{{Authority control}}\n\n[[Category:Ketuvim| ]]\n[[Category:Hebrew words and phrases]]\n[[Category:1st-millennium BC books]]",
            "slug": "ketuvim",
            "date_updated": 1537054602314,
            "imported": "https://en.wikipedia.org/wiki/Ketuvim"
        }
    ]
}