{
    "article": [
        {
            "title": "Tosefta",
            "text": "{{Distinguish|Tosafot|Tosafists}}\n\n{{Rabbinical Literature}}\nThe '''Tosefta''' ([[Talmudic Aramaic]]: תוספתא, \"supplement, addition\") is a compilation of the [[Oral Torah|Jewish oral law]] from the late 2nd century, the period of the [[Mishnah]].\n\n==Overview==\nIn many ways, the Tosefta acts as a supplement to the Mishnah (''tosefta'' means \"supplement, addition\"). The [[Mishnah]] ([[Hebrew]]: משנה) is the basic compilation of the [[Oral law]] of [[Judaism]]; according to the tradition, it was compiled in 189 CE.<ref>Rabbi Avraham ben David (RAVAD), ''Seder Hakabbalah lehaRavad'', Jerusalem 1971, p. 16 (Hebrew). The author, who wrote his own chronology in ''anno'' 1161 CE, places the compilation of the Mishnah in year 500 of the [[Seleucid Era]] counting, a date corresponding to 189 CE.</ref> The Tosefta closely corresponds to the Mishnah, with the same divisions for ''sedarim'' (\"orders\") and ''masekhot'' (\"tractates\"). It is mainly written in [[Mishnaic Hebrew]], with some [[Aramaic language|Aramaic]].\n\nAt times the text of the Tosefta agrees nearly verbatim with the Mishnah. At others there are significant differences. The Tosefta often attributes laws that are anonymous in the Mishnah to named [[Tannaim]]. It also augments the Mishnah with additional glosses and discussions. It offers additional [[Aggada|aggadic]] and [[midrash]]ic material, and it sometimes contradicts the Mishnah in the ruling of [[Halakha|Jewish law]], or in attributing in whose name a law was stated.\n\n==Origins==\nAccording to rabbinic tradition, the Tosefta was redacted by Rabbis [[Hiyya bar Abba|Ḥiya]] and [[Oshaiah]] (a student of Ḥiya).<ref>[[Rashi]] in his commentary on [[Talmud]] [[Sanhedrin]] 33a, s.v. ''v'afilu ta'ah b'rebbi Hiyya''.</ref> Whereas the Mishna was considered authoritative, the Tosefta was supplementary. The Talmud often utilizes the traditions found in the Tosefta to examine the text of the Mishnah.\n\nThe traditional view is that the Tosefta should be dated to a period concurrent with or shortly after the redaction of the [[Mishnah]]. This view pre-supposes that the Tosefta was produced in order to record variant material not included in the Mishnah.\n\nModern scholarship can be roughly divided into two camps. Some, such as [[Jacob N. Epstein]] theorize that the Tosefta as we have it developed from a proto-Tosefta recension which formed much of the basis for later [[Amoraim|Amoraic]] debate. Others, such as [[Hanoch Albeck|Hanokh Albeck]], theorize that the Tosefta is a later compendium of several [[Baraita|baraitot]] collections which were in use during the Amoraic period.\n\nMore recent scholarship, such as that of Yaakov Elman, concludes that since the Tosefta, as we know it, must be dated linguistically as an example of [[Mishnaic Hebrew|Middle Hebrew 1]], it was most likely compiled in early Amoraic times from oral transmission of baraitot.<ref>Yaakov Elman, ''Authority & Tradition'', Yeshiva Univ. Press, 1994; \"Babylonian Baraitot in Tosefta and the `Dialectology' of Middle Hebrew,\" Association for Jewish Studies Review 16 (1991), 1–29.</ref> Professor Shamma Friedman, has found that the Tosefta draws on relatively early Tannaitic source material and that parts of the Tosefta predate the Mishnah.<ref>S.Y. Friedman, ''Le-Hithavvut Shinnuye ha-Girsaot be'Talmud ha-Bavli'', '''Sidra''' 7, 1991.</ref>\n\n[[Alberdina Houtman]] and colleagues theorize that while the [[Mishnah]] was compiled in order to establish an authoritative text on halakhic tradition, a more conservative party opposed the exclusion of the rest of tradition and produced the Tosefta to avoid the impression that the written Mishnah was equivalent to the entire oral Torah. The original intention was that the two texts would be viewed on equal standing, but the succinctness of the Mishnah and the power and influence of Yehuda Ha-Nassi made it more popular among most students of tradition.<ref>Alberdina Houtman, ''Mishnah and Tosefta: A Synoptic Comparison of the Tractates Berakhot'', Mohr Siebeck, 1996</ref>\n\nUltimately, the state of the source material is such to allow divergent opinions to exist. These opinions serve to show the difficulties in establishing a clear picture of the origins of the Tosefta.\n\n==Tosefta's authority==\nRabbi [[Sherira Gaon]] (987 CE), in a letter written to the heads of the Jewish community in Kairuan (Tunisia), has disclosed somewhat about the authority of the Tosefta in relation to the [[Mishnah]]. There, he writes: \"We do not follow the opinion of R. [[Hiyya bar Abba|Ḥiya]], as expressed in a [[Baraita]], if he disputes with Rebbe [Yehuda Ha-Nassi]. For example, let us suppose that a certain ''halacha'' had originally been a matter of dispute between R. Meir and R. Yosi; but Rebbe [Yehuda Ha-Nassi] decided to record in the Mishnah only R. Meir's opinion [anonymously]. Had R. Ḥiya then come along, in the Tosefta, and stated that the ''halacha'' had been originally a matter of dispute - even though it has now been reported anonymously - we follow the Mishnah rather than take up the episode which places the rabbis at variance. Whenever R. Meir and R. Yosi disagree,<ref>e.g. Tosefta ''Demai'' 5:21</ref> the ''halacha'' follows R. Yosi. Nevertheless, since in the Mishnah, Rebbe [Yehuda Ha-Nassi] mentioned only R. Meir's opinion,<ref>e.g. Mishnah ''Demai'' 5:9</ref> we follow R. Meir.\"<ref>Rabbi Nosson Dovid Rabinowich (ed.), ''The Iggeres of Rav Sherira Gaon'', Jerusalem 1988, p. 37</ref>\n\nRabbi Sherira Gaon then brings down the reverse of this example: \"Or, let us suppose that Rebbe [Yehuda Ha-Nassi] in the Mishnah records a dispute between R. Meir and R. Yosi. However, R. Ḥiya prefers R. Meir's argument, and therefore records it in a Baraita without mentioning R. Yosi's opposing view. In such a case, we do not accept [R. Ḥiya's] decision.\"\n\n==Manuscripts / editions / commentaries==\n===Manuscripts===\nThree manuscripts exist of the Tosefta, they are: \n* 'Vienna' (late 13th century; Oesterreichische Nationalbibliothek Cod hebr. 20; the only complete manuscript),\n* 'Erfurt' (12th century; Berlin - Staatsbibliothek (Preussischer Kulturbesitz) Or. fol. 1220),<ref>[http://juedisches-leben.erfurt.de/jl/en/middle-ages/hebrew_manuscripts/research/index.html Erfurt Collection: Erfurt Hebrew Manuscripts] (Accessed: 8 June 2017)</ref> and,\n* 'London' (15th century; London - British Library Add. 27296; contains Seder Mo'ed only).\n\nThe ''Editio Princeps'' was printed in Venice in 1521 as an addendum to [[Isaac Alfasi]]'s ''Halakhot''.\n\nAll four of these sources, together with many [[Cairo Geniza|Geniza]] fragments, have been published online by [[Bar Ilan University]] in the form of a searchable database.<ref>Available at: http://www.biu.ac.il/js/tannaim/</ref>\n\n===Editions===\nTwo critical editions have been published. The first was that of [[Moses Samuel Zuckermandl]] in 1882, which relied heavily on the Erfurt manuscript of the Tosefta. Zuckermandl's work has been characterized as \"a great step forward\" for its time.<ref name=\"Wald\">Stephen G. Wald, \"Tosefta\" in the ''Encyclopaedia Judaica''. Ed. Michael Berenbaum and Fred Skolnik. Vol. 20. 2nd ed. Detroit: Macmillan Reference US, 2007. pp. 70–72</ref> This edition was reprinted in 1970 by Rabbi [[Saul Lieberman]], with additional notes and corrections.<ref>''Tosephta (based on the Erfut and Vienna Codices)'', (ed. M.S. Zuckermandel), Jerusalem 1970.</ref>\n\nIn 1955 Saul Lieberman first began publishing his monumental ''Tosefta ki-Feshutah''. Between 1955 and 1973, ten volumes of the new edition were published, representing the text and the commentaries on the entire orders of Zera'im, Mo'ed and Nashim. In 1988, three volumes were published posthumously on the order of Nezikin, including tractates Bava Kama, Bava Metziah, and Bava Basrah. Lieberman's work has been called the \"pinnacle of modern Tosefta studies.\"<ref name=\"Wald\"/>\n\n===Commentaries===\nMajor commentaries on the Tosefta include those by:\n* [[David Pardo (Italian rabbi)|David Pardo]]: ''Chasdei David''; Originally published in Livorno (1776), and printed in editions of the [[Vilna Edition Shas|Vilna Shas]].\n* [[Yehezkel Abramsky]]: ''Hazon Yehezkel'' (24 volumes, 1925–1975 in [[Hebrew language|Hebrew]]).\n* [[Saul Lieberman]]: ''Tosefet Rishonim'', Jerusalem 1937.\n* [[Jacob Neusner]] and his pupils (in a series called ''A History of the Mishnaic Law'', 1978–87)\n\n===Translations===\nThe Tosefta has been translated into English by Rabbi Jacob Neusner and his students in the commentary cited above, also published separately as ''The Tosefta: translated from the Hebrew'' (6 vols, 1977–86).\n\nEli Gurevich's English translation and detailed commentary on the Tosefta is in the progress of being written. It can be downloaded for free from his website http://www.toseftaonline.org/.\n\n==See also==\n* [[Oral law]]\n* [[Mishnah]]\n* [[Amoraim]]\n* [[Baraita]]\n* [[Talmud]]\n* [[Gemara]]\n* [[Rabbinic literature]]\n* [[Halakha]]\n* [[Old Synagogue (Erfurt)]]\n\n==Notes==\n{{reflist}}\n\n==External links==\n* [http://www.jewishencyclopedia.com/view.jsp?artid=277&letter=T \"TOSEFTA\" in the Jewish Encyclopedia]\n* [http://www.newadvent.org/cathen/14788a.htm Tosephta] in the ''[[Catholic Encyclopedia]]''\n* [http://www.toseftaonline.org ToseftaOnline.org - A new free English translation, commentary and edited Hebrew text of the Tosefta, as well as MP3 shiurim (lectures) and various commentaries available for free download]\n* [http://www.mechon-mamre.org/b/f/f0.htm Full text at Mechon-Mamre]\n* [http://jnul.huji.ac.il/dl/talmud/Online Treasury of Talmudic Manuscripts, Jewish National and University Library]{{dead link|date=December 2017 |bot=InternetArchiveBot |fix-attempted=yes }}\n* [http://www.sacred-texts.com/jud/t01/t0106.htm Sacred Texts: gives a more detailed explanation of the origins of the Tosefta (in relation to the rest of the Mishna)]\n\n{{mishnah}}\n\n[[Category:Talmud]]\n[[Category:Mishnah|Tosefta]]\n[[Category:Tannaitic literature]]",
            "slug": "tosefta",
            "date_updated": 1537054516127,
            "imported": "https://en.wikipedia.org/wiki/Tosefta"
        }
    ]
}