{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "WebAssembly on ZeroNet",
			"body": "http://webassembly.org/\nWould it be possible to create a WebAssembly API for ZeroNet as an alternative to JavaScript? There is just way too many flaws in JavaScript and I think having JavaScript as the only way to create dynamic sites limits developers.",
			"added": 1506891097
		},
		{
			"topic_id": 1524439656,
			"title": "ZeroNet CLI",
			"body": "I love to use terminal clients for clearnet sites like mps-youtube and I was wondering would it be possible to create a command-line client for ZeroNet. I know that ZeroNet being dependent on JavaScript makes it impossible to use on most text-based browsers, but I want to know if a custom text browser for ZeroNet can be made.",
			"added": 1524439654
		},
		{
			"topic_id": 1565899855,
			"title": "ZeroNet should warn users that they are not anonymous",
			"body": "After the 8chan refugees had their IP addresses exposed, I think ZeroNet should do a better job warning users that if they are not using a VPN or Tor, their IP can be retrieved by any user with little effort.\n\nThe only place where I see this warning is on the ZeroNet FAQ. I think the ZeroNet client should pop up a warning on the first time it's used. Alternatively we can bundle Tor with ZeroNet, which can encourage users to use Tor.",
			"added": 1565899852
		}
	],
	"topic_vote": {
		"1_18C45ndJpnDbtgU7QdFxbfcENxBsPPEUtG": 1,
		"1_14aBVs7naxTC3Vs9N2yoYod6iwoRP6xfV2": 1,
		"4_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"3_1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8o": 1,
		"1_1WeDfuFi18uBne938aNwZDwAuKPMDYQxn": 1,
		"6_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": 1,
		"3_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": 1,
		"8_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": 1,
		"4_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"22_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": 1,
		"1_18D4VdqDgiiykHZFvSRT1EtZ18pbHeYfMx": 1,
		"24_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": 1,
		"1_1BMjn5jgrLrGbQTbnZDLFKUuxP2ZBr4ufC": 1,
		"1_1M1msf96AhLpJDJimVK7mXXCoaAGxfzxh9": 1,
		"8_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"4_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"2_15Q5U52Aqgjb66GkzhkGKDYgWsqR8TEkJG": 1,
		"4_16t83GyRixTRFbTL91Lvk2q3Z8kJzJfAXH": 1,
		"2_16t83GyRixTRFbTL91Lvk2q3Z8kJzJfAXH": 1,
		"2_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"4_15Q5U52Aqgjb66GkzhkGKDYgWsqR8TEkJG": 1,
		"5_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": 1,
		"13_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1509660745_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"17_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1510499714_18j1DomS5vDgXcKnSGuSmPSDTQjxiWpyA5": 1,
		"1510856783_17ychMBS8Vq1mXtRgteUBcLSTuVGzcBLQQ": 1,
		"1511360238_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"1512670011_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": 1,
		"1521007152_1Cz286mxKa8Ujy6nj222YKegBkz1Aqo4ks": 1,
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"1521980671_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
		"1522759173_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr": 1,
		"1523193334_14RJhs7d84srMhP3Su4ErpZ5NfpXPRV3Ac": 1,
		"1523575854_1FKWKJcvHG4tatrW68b4CkHGXYNjxv7uBt": 1,
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": 1,
		"1523907568_17hQRqKh6sXzV4fAV6ero1pRHdkCEyFj7k": 1,
		"1524150545_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": 1,
		"1524357756_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1524545912_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": 1,
		"1526683349_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1527022297_1Nr4AQaJrccU6StFBXogUSGVCX7hUAHHSB": 1,
		"1526319410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1539742216_1QF6TdQmnXquDdxnjfmsuBnpp22admdGUm": 1,
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": 1,
		"1545062532_1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9": 1,
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1545441215_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"1543643463_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"1547237644_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"1552875369_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1,
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1553642587_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"1558041340_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1561994830_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"1570901775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": 1,
		"1572464062_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": 1,
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1610162257_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1616140819_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": 1,
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1636765653_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1636759226_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 74,
	"comment": {
		"1_1ApJ2dibcJbE8cvEeo3Db75cwkRArD2XjA": [
			{
				"comment_id": 1,
				"body": "> [butterball](#comment_1_1GmJVE6KmMyRKKfEg2aiTjCtCU5poP3Rde): Of course not. If they have any internet access at all, there's no way they can access arbitrary IPs on the greater internet. Everything would be a whitelist at the ISP level.\n\nThey don't have access to the internet, but there is an intranet that North Korean civilians use.",
				"added": 1505225576
			}
		],
		"4_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": [
			{
				"comment_id": 2,
				"body": "How about we get a major browser to have ZeroNet built-in. Just like how many browsers use to have built-in gopher clients.",
				"added": 1505227734
			},
			{
				"comment_id": 3,
				"body": "> [james007](#comment_19_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5): Right, until FireFox killed Gopher. [...]\n\nYou know, if we were to get a major browser to natively support ZeroNet it would be FireFox given how they supported Gopher for the longest time.",
				"added": 1505569711
			}
		],
		"8_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": [
			{
				"comment_id": 4,
				"body": "I think it's a good idea not just for ZeroNet but for clearnet sites as well since AdBlockers are becoming more of a problem.",
				"added": 1505663474
			}
		],
		"8_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 5,
				"body": "> [akito](#comment_207_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Why do so many people love Reddit... Its interface is ugly AF and most reddit sites are from retards, for retards. There are plenty of better platforms for the same needs.\n\nReddit only got popular because Digg made a retarded redesign back in 2011.\n\n> [kaffie](#comment_505_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There's already a Reddit/Voat clone here.\n\nWhy do they call it ZeroVoat? Can't they use a more original name instead of using a name from a clearnet service?",
				"added": 1506092103
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_112_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://steemit.com/steemit/@steemitblog/steemit-com-is-now-open-source\n\nsteemit requires you to give your phone number and also sells your data.",
				"added": 1506291883
			}
		],
		"6_18Cxdyc2FEuswoXnBkrAfCkM2Yu1p4NjcR": [
			{
				"comment_id": 6,
				"body": "They only problem is that they need to rewrite their code from scratch. Since Gab.ai is written in PHP and ZeroNet uses a JavaScript API.",
				"added": 1506269253
			}
		],
		"3_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 7,
				"body": "> [scrubthesecond](#comment_71_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): \n\n\nAlso people can obfuscate their JavaScript code so nobody can see it.",
				"added": 1506269590
			},
			{
				"comment_id": 9,
				"body": "> [ivanq](#comment_39_1CvyxRucf7BbDvGtFe5LayTS2qX88VN7Er): Well, you cannot decode this code, but you can see it!\n\nMany people including the Free Software Foundation don't consider obfuscated source code as real source code since it's not readable.",
				"added": 1506343856
			}
		],
		"11_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 10,
				"body": "> [planespherev3](#comment_270_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS): Yeah well. Internet exists since 1994. The masses only adopted it in the mid 2000. [...]\n\nThe Internet existed long before 1994. You might be talking about the World Wide Web which started in 1990.",
				"added": 1506737509
			}
		],
		"1_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 11,
				"body": "> [krixano](#comment_26_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): There are languages that compile to JavaScript (e.g. Typescript), but I agree that I don't really like javascript all that much.\n\nIt's not just programming JavaScript; it is also your computer running JavaScript. It's slow and bloated. Using a transcompile language like TypeScript or CoffeeScript will not improve this.",
				"added": 1506891919
			}
		],
		"1_1BMjn5jgrLrGbQTbnZDLFKUuxP2ZBr4ufC": [
			{
				"comment_id": 12,
				"body": "You should take a look here for a detailed look at ZeroNet's protocol https://zeronet.readthedocs.io/en/latest/help_zeronet/network_protocol/\n\nAlso, keep in mind that ZeroNet is suppose to be a P2P replacement for the web, not the Internet as a whole. So, while you could say make a game that posts your high score to a zite, a real-time online game using ZeroNet's protocol wouldn't be efficient. If, you plan to make P2P online game you should learn P2P networking and make your own protocol.",
				"added": 1507478184
			}
		],
		"4_1EMDKkZzS2ztrvcsUmzFkifjMWKFu73zCs": [
			{
				"comment_id": 13,
				"body": "What's it about?",
				"added": 1507759277
			}
		],
		"4_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": [
			{
				"comment_id": 14,
				"body": "ZeroNet URL shortener? Why didn't I think of that? Too bad I can't find any peers right now.",
				"added": 1507843801
			}
		],
		"1510856783_17ychMBS8Vq1mXtRgteUBcLSTuVGzcBLQQ": [
			{
				"comment_id": 15,
				"body": "> [akito](#comment_374_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): Who needs those skrubs over here... I wouldn't post it on forums like that. And in regards to the previous comment: I seriously don't want any of the retards here that still after all what we know about social media use Twitter or even Facebook. Those people obviously don't care about freedom, at all, else they would've already left. I think that spreading Zeronet on these pages would draw more criminals and malicious hackers here, than actual users wanting freedom. Remember, every zite you visit is code you download on your computer, that could run.\n\nMost imageboard users like the ones on 4chan and 8chan are for free speech so I don't think that this is a problem.",
				"added": 1510869864
			},
			{
				"comment_id": 16,
				"body": "> [ekaterina](#comment_3_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Didn't the exodus from 4chan to 8chan happen because 4chan was against free speech and started to censor a bunch of topics, so people moved to 8chan to speek freely there instead?\n\nIt was mostly due to them banning GamerGate and SJW discussions. However, it appears that the 4chan administration started fixing itself after moot left.\n\n> [vizy93](#comment_3_1KieR53aUzHPPH7b54QyDN5a8iYdZm4r9o): We ought to try to spread the word on reddit. 4chan bans Tor exit nodes so a lot of the people here can't even participate there\n\nI honestly believe the best places to spread the word are sites that may get shutdown by infrastructure companies. I'm talking sites like 8chan, Voat, and gab.ai.",
				"added": 1510959979
			}
		],
		"1512670011_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 17,
				"body": "Hitler would've been a hero if he killed Muslims instead of jews.",
				"added": 1513212106
			}
		],
		"1521980671_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 18,
				"body": "> [azz](#comment_17_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF): Bible is bloody book too\n\nYeah but those violent verses applied to a different time. They became irrelevant when Jesus said \"Let he who is without sin cast the first stone.\" Islam has no equivalent verse. Also, you should compare the acts of Jesus to the acts of Muhammad.",
				"added": 1522077183
			}
		],
		"1521962808_1He5bfTsvbUXQXp5HCuKLdYutSiqDUjBrs": [
			{
				"comment_id": 19,
				"body": "We need to get ZeroNet built in to major web browsers like Firefox, Chrome, Safari, etc. There were already talks about adding built-in IPFS to Firefox. I think they can also add ZeroNet to it as well.",
				"added": 1522241327
			}
		],
		"1522525455_1DgPkB13kMfTydPdqLVMAbKQBLRhr9Bdpr": [
			{
				"comment_id": 20,
				"body": "Discord is cancer.",
				"added": 1522611841
			}
		],
		"1524280296_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": [
			{
				"comment_id": 21,
				"body": "Email. Seriously, you can send a message to multiple people at once and there are still some active mailing lists out there.",
				"added": 1524439411
			}
		],
		"1524439656_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 22,
				"body": "> [chandelier](#comment_15_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8): I'd appreciate it if you could tell me some other good terminal clients for clearnet sites.\n\nOn the top of my head there's rtv for Reddit and t for Twitter. There's also a bunch of them for checking the news and weather. I recommend you Google them.",
				"added": 1524502464
			}
		],
		"1526860616_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 23,
				"body": "Isn't twitter more censored than Reddit? I remember them banning moderate conservatives.",
				"added": 1526907066
			}
		],
		"1527149420_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 24,
				"body": "That won't happen. The koran specifically tells people to kill non-believers including Jews. Even Muhammad killed over 800 jews during his life.",
				"added": 1527449835
			}
		],
		"1528080332_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": [
			{
				"comment_id": 25,
				"body": "GitHub is just cancer anyway. It's centralizing a decentralized protocol. You were meant to host repositories on your own servers but GitHub decided to combine it with social networking features and create one place to store and host all your code.",
				"added": 1528150399
			}
		],
		"1532983813_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 26,
				"body": "> [beenotung](#comment_27_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): @nicwow I guess the intention of >ZeroUP was to serve as a demo.The limitations, maybe are set against potential abuse.\n\nI suspect that the 10MB limit was to prevent it from becoming a place to pirate movies, software, etc but it still doesn't prevent someone from uploading smaller copyrighted material like retro game ROMs or music.",
				"added": 1536802902
			}
		],
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 27,
				"body": "That was made before dynamic content was added and was just a proof of concept. Nobody uses it anymore.",
				"added": 1537822877
			}
		],
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 28,
				"body": "> [znnex](#comment_1_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): We really ought to be moving things over to distributing networks like ZeroNet and Freenet\n\nYes, but I don't think most Tumblr users would be tech-savvy enough to use them and I bet once they realize that ZeroNet is uncensored, they will call us an \"alt-right platform\" or something like that.",
				"added": 1544458049
			},
			{
				"comment_id": 29,
				"body": "> [anonimoose](#comment_14_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): I was thinking of created a website that would act as a proxy that would remove the barrier completely, basically you go to a website and get access to zeronet.\n\nThere are many sites that do that already. ZeroWiki has a list [here](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies). What we really need is to have major browser to have ZeroNet built in. Firefox is the most likely since they have natively supported the gopher protocol for the longest time and there have been talks about implementing IPFS. I'm sure that if ZeroNet gets popular enough, they may implement it as well or instead of IPFS.",
				"added": 1544459435
			},
			{
				"comment_id": 30,
				"body": "> [znnex](#comment_3_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): I like to think it wouldn't be excessively difficult for people to figure out how to download and run (the daemon for) the friendliest dark/alt/whatever net around and navigate to a known URL.\n\nThe ZeroNet daemon has an option to start every time a user logs in to their computer iirc. So, most people just need to get through the install process and then never have to worry about it again (at least until they get a new device). Ideally, installing ZeroNet should be easy like installing a plug-in such as Adobe Flash or QuickTime (even though they are becoming increasingly irrelevant). However, I don't think people would be comfortable remembering 127.0.0.1:43110/<insert domain here>.bit compared to www.example.com and the idea of IDs and user-certificates that are required to be copied manually if you want to use them on multiple computers [remember that people use multiple devices these days (smartphones, tablets, laptops, etc)].\n\n> [znnex](#comment_3_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Besides, I'm sure the freeze peach and alt-right types will be welcoming enough to those with disparate opinions who just need a place to stay :) :)\n\nTumblr is filled with SJWs and they will avoid anything that is popular with the alt-right, alt-lite, neo-nazis, conservatives or anyone who is against their ideology like the plague regardless if they welcome those with differing opinions. There have been an increasing amount of alt-right users here so I see it becoming popular with them soon. Also, one of their goals is to make the entire internet a \"safe-space\" by getting major tech companies to remove anything they consider as \"hate-speech\" or \"toxic\". If they feel that the clearnet is too \"toxic\" you bet that they will be 100% against the idea of ZeroNet.",
				"added": 1544480438
			}
		],
		"1545062532_1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9": [
			{
				"comment_id": 31,
				"body": "We could just have a ZeroUp clone dedicated to ROMs, ISOs, emulators, PC abandonware, DRM-free games, etc. Just change the file size limit (or remove it entirely) and the allowed file extensions to extensions of common ROM, ISOs, and archive formats.",
				"added": 1545064274
			},
			{
				"comment_id": 32,
				"body": "> [moor](#comment_80_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Nice, what we (also) need is a ROM site like portalroms, 100% torrent and going for years, almost every single ROM has (many) seeders. and naturally ROMs are small and easy to seed. we can always check roms by using sites like redump.org, superfamicom.org, 3dsdb.com, etc...\n\nA ROM site is something that we definitely need given that Nintendo has gone ballistic on ROM sites lately. (I know that they were always known for this but it feels like it has become increasingly harder to find ROMS Nintendo or otherwise) This mostly concerns me because there is a lot of obscure games out there. Games that would otherwise be considered lost media if it weren't for their ROMs being dumped. (Games released for obscure services like Satallaview and Sega Modem being the most notable) A completely peer-to-peer ROM site will make sure that these games won't be lost. With this, we can make ZeroNet attractive to digital preservationists.",
				"added": 1545446692
			},
			{
				"comment_id": 34,
				"body": "> [moor](#comment_81_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): Yes, you also probably follow some relevant subreddit (CrackWatch, Piracy, Emulation, etc...). either way people in these forums are really \"demanding\" (at times, but continuously) for such alternatives, we really could attract potentially hundreds of thousands of users to at least experiment with a new platform that as of right know can provide everything they wish for. [...]\n\nI don't go on Reddit actually. The ISO Zone was the place I went to for ROMS and PC abandonware until they'd shutdown back in August even though Nintendo had no direct involvement it was most likely do to LoveROMS and Emuparadise being shutdown. Now they are trying to find a way to preserve games while still supporting the developers even though in a lot of cases, it is ambiguous to who currently owns the rights to a work and what portion of the rights they own.\n\nRight now, I think most emulation enthusiasts are going to be using torrents. You can find full ROM sets on any popular torrent tracker. I just wish that someone would find this and create a ROM/Abandonware site so we can have a gaming community because I feel like the only thing we ever talk about on ZeroNet is alt-tech and politics.",
				"added": 1545601676
			}
		],
		"1545042706_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 33,
				"body": "> [anonimoose](#comment_26_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): You could always create a script to download all the pages and serve them but wouldn't it be better to get the service to move here?\n\nA script like that would still be a good idea though. It can function as a ZeroNet equivalent to archive.is or the Internet Archive's \"Way Back Machine\"",
				"added": 1545447371
			}
		],
		"1545519505_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 35,
				"body": "We should just have a built-in anonymous account saved with every ZeroNet install. That way we can have just one that anyone can use and make it easier for admins to block anonymous users if they so choose.",
				"added": 1545690243
			}
		],
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 36,
				"body": "> [homegrown](#comment_9_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX): Pretty much something with programming skills since I have none.\n\nYou could clone ZeroUp or ZeroShare and change the required file extensions with files extensions of common ROM and archive formats.",
				"added": 1546874267
			}
		],
		"1551567748_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 37,
				"body": "If you have a clearnet site you can make a mirror of it and encourage users to visit the ZeroNet mirror instead. Even better just make the clearnet site redirect to a proxy accessing a ZeroNet site.",
				"added": 1551658178
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 38,
				"body": "People keep on saying that the manifesto and the live-stream should not be archived and many sites are deleting any reuploads of the manifesto which I think is a stupid idea. The manifesto and the live-stream should be circulated and archived because it allows us to know what really happened and the motivations of the shooter and not what the mainstream media said about it. Here are some facts that the media won't admit:\n\n* The shooter was not a Trump supporter nor right-leaning.\n* The shooting was not a \"Christian Terrorist Attack\". The shooter was not a Christian\n* The shooter was probably mentally ill. He acknowledges Spyro (a kid friendly PS1 game) and Candace Owens (a racial minority) as his inspiration to became an ethno-nationalist\n* Islam is a philosophy, not a race. You don't have to be Middle Eastern or North African to be a Muslim. (If you have the guts to watch the stream, you can see many of the victims were white)\n* While the shooter did announce his massacre on 8chan, he live-streamed the attack on Facebook.",
				"added": 1552873438
			}
		],
		"1552858206_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 39,
				"body": "I think there are even aspects of ZeroNet that can turn off even the more tech-savvy users:\n\n* The official client is written in Python which is very slow even compared to other scripting languages.\n* ZeroNet relies on JavaScript for dynamic websites making it unusable on text-based browsers or minimalist browsers like surf.\n* ZeroFrame is object-oriented, a paradigm that has been heavily criticized by many programmers.\n* We are not truly decentralized because we still rely on trackers that can be blocked by ISPs, DNS servers, and governments.\n* ZeroNet is only pseudo-anonymous - every post, upvote, etc. is attached to a hash that can be tracked across the entire network. If you want to remain anonymous, you need to change your hash frequently.\n\nMost of these problems can be fixed, but that last one is a huge flaw that we are going to have to deal with. When people talk about a decentralized web, I hear IPFS get talked about way more than ZeroNet.\n\n> [nekololi](#comment_347_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): everyone i mention ZeroNet to derisively refers to it as \"reddit-net\" due to the fact that the userbase is primarily reddit users, and because the culture of the community here is presumably similar to reddit. i don't go to that pit so i don't know if this description is accurate.\n\nI've never heard anyone call it Reddit-net and I don't think most of us are (formal) Reddit users. I've never used Reddit and I think the most popular zite right now is Millchan (most imageboard users despise Reddit and its users). I think most of the Reddit users here came after the site purged many of the controversial communities. (The site use to be one of the most free-speech friendly services out there)",
				"added": 1552875370
			}
		],
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 40,
				"body": "PaleMoon",
				"added": 1562253923
			},
			{
				"comment_id": 41,
				"body": "> [styromaniac](#comment_743_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Based on Firefox.\n\nIt's based on an old version though and it's now running on its own engine so I wouldn't call it a fork anymore.",
				"added": 1562387652
			},
			{
				"comment_id": 42,
				"body": "There is also GNU IceCat, but the emphasis on freetardism prevents certain sites from working correctly due to their JS. \n\n> [styromaniac](#comment_755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): All the more reason to dislike Mozilla, Claiming trademark over the word fox.\nThey could've at least rename it. At least Mozilla is not like RedHat/IBM with SystemD where they break API compatibility in every update, killing compatibility with forks in the process. But with that said, I really think the whole \"just fork it\" mentality does jack shit. I only ever see it working when a project becomes abandoned. The popularity of the vanilla software will overshadow the forks especially if it is trademarked or do that SystemD practice I mentioned earlier. I bet most Firefox users aren't even aware that forks even exist.",
				"added": 1562456121
			},
			{
				"comment_id": 43,
				"body": "> [nickwa](#comment_164_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): People do not realize Google is shady because people do not care. There is so many people I told about Google that still use it. Our problem just like with IE is going to be the normal users who use whatever other people use, as well as laziness. Google uses this to their advantage. Unfortunately, the only ways for things to change like IE: Is for things to get really bad, or another mind share takeover. There is even people who still use Facebook, despite its numerous scandals. Mind share is a hell of a thing. Even if you convince all the technology knowledgeable people to not use anything Google, the non-tech savy outweigh us. [...]\n\nI think switching browsers shouldn't be that much of a hassel even for non tech-savvy users. With something like Facebook, you need friends to use the same service, but with something like a browser, you just need to get use to a new interface.\n\nAs for mind share, you just need an aggressive ad-campaign. That's how Sega was abled to take on Nintendo's monopoly back in the 90s. Of course, a non-profit community project may not afford that, but it could be done by it's users.",
				"added": 1562972464
			}
		],
		"1563919186_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 44,
				"body": "ProtonMail is not secure. They now require SMS verification and they PGP encrypt your mail server-side so you can't generate your own keys. Really, the best options for a private and secure email service is to use a paid one like [Posteo](https://posteo.de/en/). They only charge 1 EUR ($1.11) per month and store absolutely nothing on their servers. [StartMail](https://www.startmail.com/) is another option but they do store metadata like your browser, operating system, and you country for marketing reasons.\n\nThere are non-profit email services like Disroot, RiseUp, and Autistici, but they are run by anarcho-communists, so it would be hypocritical to use them if you don't agree with their principles. (Autistici in particular requires you to send them a written justification to create an account and RiseUp is known to support Antifa)",
				"added": 1563987808
			}
		],
		"1564315854_1K2yxrbNgfo8ZtuGfvvUiPVueUrZEAbfJe": [
			{
				"comment_id": 45,
				"body": "The real point of failure is the fact that we still rely on BitTorrent trackers that can easily be blocked by governments and ISPs.",
				"added": 1564368826
			}
		],
		"1564381634_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 46,
				"body": "Anyone who has ever done any research on terrorism would know that most terrorists (especially ISIS) use Sneakernets for communication. Might as well ban flash drives and other removable storage. It would sure help cloud services gain more control.",
				"added": 1564410900
			}
		],
		"1565077480_1N86m5tuMjDQoXoocDpPVzY9dcRPC7MnuU": [
			{
				"comment_id": 47,
				"body": "> [gronk](#comment_3_19KeNwCSTBo3Fm6s1wGpxGvyb8nPSa2KZo): How long til zerotalk lets us add images to our posts and we simply replace chan forums with this\n\nMost forums allow you to embed images in posts. That doesn't make them chans.",
				"added": 1565118812
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 48,
				"body": "> [buckfruck](#comment_3_12sqywVGbwufXxaZEHhiNATtJP5pipQ2XB): This place was better before it was filled with Nazi sperg posters.\n\nNazis aren't capitalists.",
				"added": 1565739189
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 49,
				"body": "> [bvcfbfbcbcvd](#comment_37_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): I thought Tor was built into ZeroNet on Windows? It's not anymore?\n\nI primarily use Linux, so I don't know about the Windows bundle. Given how Linux software is installed, I don't think we can bundle Tor with the Linux bundle, but I think we should still warm users about this.",
				"added": 1565902171
			},
			{
				"comment_id": 50,
				"body": "> [bigbadbob](#comment_280_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I think ZN users understand this.  Im not so sure about the average 8chan refugee.   I would say zeronet does a pretty good job explaining it for those who pay attention.   LIke this thread warns people who may not understand.  Will they notice or care?\n\nI remember HotWheels (the original creator of 8chan) saying that most of 8chan's users bareback the site but I think most of those people were just lurkers and Redditors. The problem with using a VPN on an anonymous imageboard/textboard is that sometimes your VPN's IP can get banned because someone else spammed the board or posted illegal content using the same VPN that you are using.\n\nAlso, I think most people forgo VPNs because most of the free ones are scams and they don't want to pay a monthly fee on top of their ISP bill. Plus, people assume that they are difficult to set up even though clients make it easier these days. Maybe the ZeroNet site/documentation can have a list of recommended VPNs that are cheap and easy to use. Just no shilling.\n\n> [pseudonymity](#comment_28_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM): Can it not just be listed as a dependency in the Repo? That is the point of apt-get is it not, to make dependency hell a thing of the past.\n\nForgot about that. Duh! I normally compile from source because I hate apt deleting a dependency for something else and breaking my installation.",
				"added": 1565904262
			},
			{
				"comment_id": 51,
				"body": "> [bigbadbob](#comment_285_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I was never on 8chan but its certainly true for 4chan.   Anyone who posts anything must be rawdoggin it.  Every vpn i tried and tor nodes were banned, so i would only ever just lurk.   I just assumed people who post didn't care or understand.\n\n4chan has turned into a datamining operation after JapMoot took over. Of course they will ban VPN and Tor users. I wouldn't recommend lurking there. Just use the third-party archives if you want to read their content. Even Reddit is more user respecting at this point.",
				"added": 1565905452
			},
			{
				"comment_id": 53,
				"body": "> [bigbadbob](#comment_286_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Did you need to give up personal info to get a pass?    I never looked into it\n\nUnless you can pay with crypto, it is a scam.",
				"added": 1565914667
			}
		],
		"1565907846_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 52,
				"body": "Just clone this site and make a forum dedicated to any subject that you are interested in.",
				"added": 1565908195
			}
		],
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 54,
				"body": "They're too stupid to come here or anywhere else that is not Facebook.",
				"added": 1565924040
			}
		],
		"1565966228_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 55,
				"body": "Just wait until the emulator becomes fully usable. Nintendo isn't worth supporting anymore.",
				"added": 1565972069
			}
		],
		"1565639606_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 56,
				"body": "Just wait until this becomes popular and you will start seeing businesses finding ways to make money off of ZeroNet. Plus, every site has a BitCoin wallet and a donate option so I don't see how ZeroNet is communist.",
				"added": 1565972359
			}
		],
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 57,
				"body": "Politics itself is terrorism.\nhttps://invidio.us/watch?v=pu9JqdqhQw0",
				"added": 1566842863
			}
		],
		"1569269870_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 58,
				"body": "If you have a landlord, you don't own your property",
				"added": 1569500925
			}
		],
		"1569534830_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 59,
				"body": "Look up agorism. It is a way to start a peaceful revolution by creating black markets using crypto currencies which will make government regulation and eventually the government itself obsolete.",
				"added": 1569636557
			}
		],
		"1569695244_1MKHBc72uGEBSuHxagbgTWGmverPtzD1tH": [
			{
				"comment_id": 60,
				"body": "Apparently, they are rebranding it as QChan.",
				"added": 1569782088
			}
		],
		"1569810770_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 61,
				"body": "> [k0hlr4bi](#comment_30_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): gmail -> tutanota/protonmail/disroot\n\nTutanota and ProtonMail are honeypots and I wouldn't recommend using those. ProtonMail in particular requires SMS verification to sign up and encrypts mail server side rather than client side. Tutanota doesn't allow clients and stores a lot of metadata. More info [here](https://digdeeper.neocities.org/ghost/email.html).\n\nPersonally, I recommend a paid email service like [Posteo](http://posteo.de/). They are a Germany based service and only charge 1 EUR per month. They don't log IPs and deleted email is backed up on an encrypted server that only you have access to. [StartMail](http://StartMail.com/) is also a good option. They do collect metadata but it is all anonymized. The third service you mentioned (Disroot) is fine though.\n\n> [k0hlr4bi](#comment_30_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): chrome -> firefox/tor browser\nFirefox does track users with Google Analytics. It can be disabled with heavy modifications to the about:config settings. More info [here](https://spyware.neocities.org/articles/firefox.html) and info on disabling it [here](https://spyware.neocities.org/guides/firefox.html). If you want to truly break free from the tech giants (including Mozilla), PaleMoon is you best bet as far as browsers go.",
				"added": 1569865643
			},
			{
				"comment_id": 62,
				"body": "> [k0hlr4bi](#comment_32_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH): Anyone can make any promise in the world, but if you don't host it yourself, you still have no idea what they actually store, sell or process. And Posteo is in 14 Eyes country, just like Tutanota, so they can be tapped very easily. [...]\n\nNot saying they're perfect, but they are better than ProtonMail and Tutanota. Of course, you shouldn't fully trust any provider, but you should avoid known honeypots.",
				"added": 1569949984
			}
		],
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 63,
				"body": "> [brianhanson2nd](#comment_44_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): Nothing new there. Just don't connect your TV to the network, then it can't send anything anywhere. Get yourself a Raspberry PI, install KODI and then hook that up to your TV. A better experience, and no worries about some company harvesting your data. If you're still worried don't let the PI connect to the outside net.\n\nIf you're going that route you might as well just use a dumb TV, projector, or computer monitor. Smart TVs (or smart-anything) are worthless",
				"added": 1571366617
			},
			{
				"comment_id": 64,
				"body": "> [randomshits](#comment_218_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The embedded tracking is one reason why I refuse to buy a Smart TV even when they are on sale and cost as much as an older 32' tv. [...]\n\nYeah, but Dumb TVs are becoming harder to find (unless you buy used). Thankfully, projectors and computer monitors haven't fall victim of this (yet).\n\nHonestly, if I wanted to watch TV, I would just get a TV card for my computer. There is really no point of getting a smart TV or a dumb TV with a cable box, game console, DVD/Blu-ray player, etc when you can just use a computer.",
				"added": 1571585671
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 65,
				"body": "[Posteo](https://posteo.de) they're a paid service but are really cheap (1 EUR/ $1.11) and even accept cash payments which makes it more anonymous. There is also [Librem One](http://librem.one) which is run by Purism and gives you Email, XMPP, VPN, and Mastodon all one one package.",
				"added": 1571586618
			},
			{
				"comment_id": 69,
				"body": "> [kaar4bears](#comment_9_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): self-hosting is very painful but the only viable way.\n\nHave fun getting your IP address exposed.",
				"added": 1572029178
			}
		],
		"1571581867_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 66,
				"body": "You're back? Take you shitty poetry somewhere else!",
				"added": 1571588898
			}
		],
		"1571615422_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 67,
				"body": "> [kaffie](#comment_1114_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I'm big on the \"separate but equal\" concept. How about we give each race their own land, and allow us to do what we will do. Civilized people can behave properly and build up society without interference, and literal ape men can play king of the hill and fight each other constantly achieving nothing.\n\nAnd once the subhumans fight themselves to extinction, we take their land.",
				"added": 1571627488
			}
		],
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 68,
				"body": "> [justonetry](#comment_5_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5): Socialism in itself is an oxymoron, why should everything in society be left up to mob rule?\n\nIn my opinion, what makes socialism an oxymoron is the concept of personal property vs private property. Socialist and communist say that property that can't be used for a means of production would be considered personal property (the most common examples being houses and toothbrushes), but **anything** can be used as a means of production. You can rent out rooms in your house, use your car as a ride sharing service, use a toothbrush for a cleaning service, etc. Of course, the government can prevent you from doing these things, but that gives them authority of determining what you are allowed to own, and in a democratic or anarchist socialist system this means that your property would be owned by everyone.",
				"added": 1571678656
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 70,
				"body": "Pretty sure it's the mainstream media and big tech companies doing it just to demonize ZeroNet more and hopefully get more countries to block the protocol. A journalist did the same thing to 8chan back in 2015 just to get the site down.",
				"added": 1572029524
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 71,
				"body": "I got several things: \n* Forums\n* Personal websites with interesting content\n* RSS feeds\n* Comment sections that don't require registration\n* People creating content (videos, comics, indie games, etc) just for fun and not for profit (or at least ask for donations, but not like how people do it now with Patreon)\n* Ads being text, static images, or animated GIFs and not targeted\n\nI feel like ZeroNet (as well as other darknets) feels a lot like 90s and early 2000s Internet, just slightly more modernized. If ZeroNet (or any other P2P network) ever becomes popular, I hope it stays like this.",
				"added": 1572804821
			}
		],
		"1572837213_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 72,
				"body": "Hotwheels is still trying to get it shutdown.",
				"added": 1573002748
			}
		],
		"1617523821_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 73,
				"body": "> [zeroseed4](#comment_113_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Galactichanhttp://127.0.0.1:43110/19HKdTAeBh5nRiKn791czY7TwRB1QNrf1Q/\n\nThis is an imageboard, not a video sharing site.",
				"added": 1617677949
			}
		]
	},
	"comment_vote": {
		"476_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"14_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"22_15Q5U52Aqgjb66GkzhkGKDYgWsqR8TEkJG": 1,
		"11_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"79_1EbCmWB1LcB6NdJhRBhu6krKCs3gZhePzp": 1,
		"11_1EijxsAumeeuw6ojPjHc9KKwUfH6ryhbJc": 1,
		"19_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"489_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"108_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1LGsz63L1WkwPHtPyU6bUZnpW2yKw5bA3u": 1,
		"26_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"207_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"2_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"33_1CvyxRucf7BbDvGtFe5LayTS2qX88VN7Er": 1,
		"21_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"13_16nArdxrSaNThNp83kL8E6NLL9WD98iUne": 1,
		"7_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"1_17ahaGK6Y1Y9WxbGQutqB95EaeXQN1GpWE": 1,
		"1_184LKnpse8Uq7KQcCF6BUtMrN6M59mWuK6": 1,
		"38_1CvyxRucf7BbDvGtFe5LayTS2qX88VN7Er": 1,
		"4_15TYJCh3i9W5dsoSUvchPwAuaB3BABXS6o": 1,
		"71_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1,
		"13_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"4_18sV4LF2Q372BLkTJN5Z24HeRexQQscx1E": 1,
		"487_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"1_17Zks611RR4oN8USC3RxJzaw94GyPufioG": 1,
		"22_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"7_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": 1,
		"24_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"39_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"59_1A3XsuLB6P7LQPCw1QWASG7RGSwrCv6Xib": 1,
		"27_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"15_16nArdxrSaNThNp83kL8E6NLL9WD98iUne": 1,
		"7_16tWPYFLbad3R8iGcMuetyiwC2q5qXp45T": 1,
		"17_1KGozab6jp6jA6zVM8cTFdzMmBasriNP4f": 1,
		"31_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"271_1HYB4Pe6irbQgDbeKm1zeFD7M8pdbksFeS": 1,
		"4_1CSDDARdrzUk9iXgx8bopdfRi3TsZmdPEP": 1,
		"75_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1,
		"33_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"44_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": 1,
		"7_1CSDDARdrzUk9iXgx8bopdfRi3TsZmdPEP": 1,
		"28_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1017_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"19_1PrxUQFugjmputGP2FzPSw4Wmq6tCd7xV7": 1,
		"9_1Pwcc1Fk7bKMA1uayUTvZaUuaGBpvGMTRg": 1,
		"3_183gMpouB3uc5hjf6cuCc1oLz2neo8cCNs": 1,
		"4_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": 1,
		"3_1GpmErjpZ5pWPRVEhnTeDK6PoFKzQNDSV3": 1,
		"62_1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8o": 1,
		"91_1PiXrhT1UjMZmJc5WFhfUxourdfapeHJ8o": 1,
		"1023_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"42_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"59_1LUy9iAxeWsj1DP5L8V17Yb2vo87FucjgD": 1,
		"244_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"99_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"289_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1042_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"62_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"6_1vjjRJpiNosn98M8cc1R6FnhgwY2bAekr": 1,
		"1_1LPXmGBFprHaLUzZNUf19fj28Dc7grXHQP": 1,
		"182_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"101_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"370_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"7_1Kwdp9DBTBe391rfDhiR7ARRDkQh36KtTT": 1,
		"21_1CSDDARdrzUk9iXgx8bopdfRi3TsZmdPEP": 1,
		"1_1BHoa1dzzSKm8Sav1s5KzDGxwz68d72sJU": 1,
		"3_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD": 1,
		"1_12QBNnnWMchCNsy1TaARZanAkgKrZLtXLt": 1,
		"4_1KEvkyRid4apYrPa2S4fdZFFHAruf2PAeq": 1,
		"378_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1,
		"1_16PUgFapj8pSnEnS1bcAGVRPtfwvQBheRG": 1,
		"227_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1DtHQRZdSLiHAp7zN8UR8Q4xZEAtG8WRz7": 1,
		"13_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"102_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": 1,
		"17_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"33_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"18_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1,
		"3_14n34GiKJHRB8g5NgtuTRU21Xo5C72Yir1": 1,
		"1_1BR3qjriTqJKphaLrvBKxWi7rYfyqreoYL": 1,
		"177_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"4_1LAitKPQa2dNhNPTt2NKT2F4DuHWVqAexc": 1,
		"13_126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB": 1,
		"1_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": 1,
		"2_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"260_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_13famWF3y6uoaCw8pnQyqEYXyUyZ81sZuw": 1,
		"21_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"2_18VjpLXn2LhvMrnjs2VKncma4U3mMebyMH": 1,
		"29_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": 1,
		"22_1BQaDuyXqze4tNXucqvbz3yUVkysxCoeni": 1,
		"71_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"13_16CWdkXYYRnpct8GYS7GgD6yFcJHPXfMy8": 1,
		"3_1M7LJZ8FtQB4Z5zqjH1pY8PQQwAYRtvHVe": 1,
		"223_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"4_1ErQYVi5mdM9hGb6uT4jg8iwGxcJBJYX8h": 1,
		"12_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ": 1,
		"1_1JvyrP4kvtm74ehSGxTqH7mJ48FNkosy68": 1,
		"12_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"14_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ": 1,
		"14_1MTNhSVgCJpW8uBjFhnyA5NsgyKbKnvrLG": 1,
		"64_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"276_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"59_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"31_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1_1BpWqMrcVcqAYpzkutTbh9QYSGv3SkaPCx": 1,
		"341_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": 1,
		"2_14vpMXmnJuhoQ8qv9oDVRh313TaUModCLw": 1,
		"38_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"55_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"5_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"17_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1,
		"46_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1,
		"7_1BDzk7UPg7TeTu8gdY5eefwKKRyu4yWpXo": 1,
		"6_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1,
		"492_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"27_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"16_1GE4QKLQM3L6r1NngDQEuEzwNBqHoBiXtL": 1,
		"23_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"80_1JupR9ExhM4aiVd1Jyy2iuS12eukDnQ54X": 1,
		"145_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"3_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1,
		"1_19DoHhKBBkfpbVjRyo5mvdJVTqK96xZyYr": 1,
		"691_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"257_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"167_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"9_12H7vawHrBcyhkGXZYTJKPiboSKaAXyKw6": 1,
		"248_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"145_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"6_15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC": 1,
		"544_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"17_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"323_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"331_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"2_16ExhLrK3XmMRhe7XWHJYHdJZa6JnzHr6R": 1,
		"9_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L": 1,
		"35_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": 1,
		"26_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"48_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"2_1LEoCwN9k81ev6z4yxSLtc67hJbognPCvZ": 1,
		"502_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"26_1G2W1r5Eh1M81v8sUanDq2Cj4xnaRJurgs": 1,
		"441_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"335_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1DJmPvFYkCwh23tmHPNWEh5WeZfE6rMoxZ": 1,
		"190_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"86_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"6_12SuCFUNDaMYRHG9DsWCyCN1NgHGjddwSJ": 1,
		"2_122Epj7hmiJjKTdB6NJzeLt3N5T424KwsR": 1,
		"80_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"26_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": 1,
		"2_1H9p2ATiexTV3kzj47eKXMMXZAbg9wB39p": 1,
		"21_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"611_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"151_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"2_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"204_1DiRWRFXcVgQQ75cXnAG2pyxxjGo2VaH5": 1,
		"6_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"86_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": 1,
		"564_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"19_13SeW8Gn6YsZFqUaQp5JWSGvzjHWfKHqBY": 1,
		"4_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"4_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": 1,
		"68_1xf9XC4Nsa7YfQWFiK6xGsNDJA3AaCTUa": 1,
		"65_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"822_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"17_1HEBittLV8ADkGMhNehgZKsciCokp1RhUW": 1,
		"382_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"755_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1CkhdKhyEwqcihKX5dXe1mchYpLcvpYpiA": 1,
		"73_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"769_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"134_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"29_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"204_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"214_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1126_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"33_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"5_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": 1,
		"1_18hZmrTkwrqFu7bEWYmBJ1bKGXUm6GzQwG": 1,
		"17_19VWN3686xhWFFoEMoXWuGSKtx7TuhQanY": 1,
		"36_1NmkVyqBJX6a82YQFYkCNgQpE9AWsmeppp": 1,
		"19_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"235_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1_1PUCGkKu8TnLxyJuwKGwQXJYmiS5z2mk5o": 1,
		"940_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"26_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"226_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"12_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"764_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"44_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"3_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"1_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": 1
	}
}