{
	"title": "Scienza & Cultura libera",
	"description": "**Divulgazione scientifica indipendente, cultura libera e \ncontro-informazione**  contro il dominio del Copyright e la nuova infame legge europea che protegge le lobby e le multinazionali. \nPer donazioni in **BitCoin**: bc1qjj6su3l28hkg25jwyp\n7t5ye98vq8hcy84ml6us.\nPer donazioni in **Ethereum**:\n0xf29FF3c929bFCf2d39\n174c4759323b01Afaf2E92.\nGrazie.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 65,
	"demo": false,
	"modified": 1563003202,
	"post": [
		{
			"post_id": 64,
			"title": "Sostanze killer (Parte 2)",
			"date_published": 1563002902.599,
			"body": "_**Quali sono le sostanze più pericolose per la salute umana e per quali patologie rappresentano un agente eziologico scientificamente accertato?**_\n\nNon è semplice fare una “graduatoria” e distinguere “in vivo” e non in esperimenti di laboratorio l’azione di una singola sostanza dall’altra, dal momento che sono migliaia le molecole cui siamo esposti e centinaia quelle presenti in cocktail nei nostri corpi. L’azione di queste sostanze può modularsi reciprocamente ed è variabile in base alle condizioni individuali dell’individuo (età, stato di salute) e alla sua capacità di detossificazione, che in gran parte è geneticamente determinata.\n\n* * *\n\nSi è visto, ad esempio, che le persone che presentano particolari profili degli enzimi della famiglia di paraoxonase 1 (PON 1) che comportano una eliminazione meno efficace di pesticidi organofosfati, presentano tossicità molto più rilevanti di carattere neurotossico, metabolico e cardiovascolare per esposizione a queste sostanze. Comunque i migliori esempi di relazione fra sostanze tossiche e patologie umane li troviamo nelle malattie professionali: amianto e mesotelioma, amine aromatiche e tumori alla vescica, benzene e leucemie mieloidi, formaldeide e tumori nasali, cloruro di vinile monomero e tumori epatici, ma anche fumo di sigaretta e cancro al polmone.\nCi sono poi le sostanze dichiaratamente cancerogene e il foltissimo gruppo degli interferenti endocrini. Ma pensiamo anche alla qualità dell’aria, oggi ritenuto il maggior problema a livello globale per la salute umana in quanto si stima che la mortalità attribuibile all’inquinamento atmosferico ammonti annualmente a 4,33 milioni di individui e comporti la perdita di 123 milioni di anni di vita. La situazione dell’Italia a questo riguardo è molto critica e il Rapporto dell’UE vede il nostro Paese al primo posto in Europa per morti premature dovute alla cattiva qualità dell’aria: per i livelli di PM 2,5, NO2, Ozono si stima che nel corso del 2013 si siano verificati nel Paese 91.050 decessi prematuri.\nÈ ormai assodato che ad ogni aumento di particolato nell’aria è associato, a breve termine, un aumento di eventi avversi cardiaci e respiratori in quanto si induce stress ossidativo, alterazioni dell’endotelio vasale, stato pro-trombotico, infiammazione sistemica tali da provocare innalzamento della pressione arteriosa, aritmia, aumento della coagulabilità sanguigna, trombosi, vasocostrizione, aterosclerosi, ischemia cardiaca e infarto miocardico. In seguito a esposizione nel lungo periodo aumenta il rischio di broncopneumopatia cronica ostruttiva (BPCO), asma, cancro al polmone e morte.\nMa la cattiva qualità dell’aria si registra anche l’incremento della abortività spontanea, della prematurità, di malformazioni, ma anche di danni per lo sviluppo cognitivo con aumento di autismo, demenza e patologie metaboliche quali il diabete. La principale modalità con cui gli inquinanti presenti in aria interagiscono con le funzioni cerebrali è rappresentato ancora una volta da stress ossidativo e da conseguente neuro-infiammazione: recenti studi hanno evidenziato che per ogni incremento di 10 picogrammi per metro cubo di PM10 e PM2,5 si registra un incremento del rischio di autismo rispettivamente del 7% e del 13,2%. anche per quanto attiene la demenza e il declino cognitivo sono numerosi gli studi che già da alcuni anni correlano queste forme morbose con l’inalazione di particolato, specie se di taglia più fine. Particolarmente pericoloso risulta essere a questo proposito il PM 0,1 (nanoparticelle) che già in studi condotti a Città del Messico aveva dimostrato di poter raggiungere i lobi frontali attraverso il nervo olfattivo e indurre alterazioni di tipo neuro infiammatorio che precorrono l’insorgenza della malattia conclamata."
		},
		{
			"post_id": 63,
			"title": "Sostanze killer (Parte 1)",
			"date_published": 1562835289.59,
			"body": "### Metalli pesanti, pesticidi, diserbanti, diossine, inquinamento elettromagnetico: ecco come abbiamo trasformato il Pianeta in una discarica di sostanze che ci fanno ammalare. Intervista alla dottoressa Patrizia Gentilini.\n\n* * *\n\n«Da ragazzo – racconta Ibrahim Thiaw, vicedirettore UNEP (programma ONU per l’ambiente) in un recente discorso – guardavo le stelle e pensavo alle avventure di persone come Neil Armstrong. Come genitore, ho guardato i miei figli fare la stessa cosa e interrogarsi sul loro futuro: sarebbero stati loro a vedere l’era dei viaggi spaziali di massa? Ma oggi, quando trascorro una preziosa serata con mio nipote e guardiamo il cielo, penso ai bambini con vite così piene di inquinamento che non riescono nemmeno a vedere le stelle o immaginare un futuro o essere abbastanza sani da preoccuparsene. Mi chiedo se mio nipote viaggerà per il suo desiderio di avventura o perché costretto a cercare aria sana e acqua sicura per la sua famiglia. Perché, a partire da 36.000 piedi (circa 1200 km; ndr) di profondità della fossa delle Marianne – la parte più profonda dell’oceano – ai 36.000 piedi di altezza nei trafficati corridoi aerei e nella maggior parte dei posti in mezzo, gli esseri umani stanno inquinando e distruggendo tutto quello di cui abbiamo bisogno per mangiare, bere o respirare. Quando siamo scivolati dal meravigliarci di questo incredibile pianeta al distruggerlo quasi per caso? Quando siamo diventati così intorpiditi che 13 morti per un incidente stradale possono spingerci alle lacrime, ma 13 milioni di morti all’anno a causa dell’inquinamento e del degrado ambientale nemmeno ci spingono ad agire?».\nL’inquinamento ambientale globale è tra le più gravi sfide cui siamo chiamati a far fronte nel presente e nell’immediato futuro. Per capire la gravità della situazione e quante e quali patologie dipendono da come aria, acqua e suolo si siano ridotti a vere e proprie discariche, abbiamo intervistato Patrizia Gentilini, medico ISDE (Associazione Medici per l’Ambiente) da anni impegnata nella lotta all’inquinamento ambientale e nella divulgazione sui temi della prevenzione primaria e della salute uomo-ambiente.\n\n* * *\n\n**Sostanze cancerogene: ecco le più pericolose.**\nLe sostanze classificate a livello I ovvero “cancerogene per l’uomo” dall’Agenzia Internazionale per il Cancro (IARC) di Lione sono 118 fra cui ricordo metalli pesanti come cadmio, nichel, arsenico, tutti i 209 Policlorobifenili (PCB), diossina, particolato atmosferico, emissioni dei motori diesel, amianto, diversi IPA (idrocarburi policiclici aromatici), benzene ecc.\nQuelle classificate come “cancerogeno probabile” (2A) sono 80 e 289 quelle classificate come “cancerogeno possibile” (2B), ma i rischi per molte di esse sono non solo per il cancro, ma anche per molte altre patologie, basti pensare agli effetti a carico del cervello in via di sviluppo di piombo e mercurio.\n\n* * *\n\n_**Dottoressa Gentilini, a cosa si riferisce quando si parla oggi di inquinamento ambientale?**_\nLa persone, purtroppo, non sono consapevoli del fatto che nel giro di pochissime generazioni abbiamo modificato, in modo temo irreversibile, il nostro habitat dal punto di vista sia fisico (pensiamo ai campi elettromagnetici) che chimico, con l’introduzione nell’aria, nell’acqua, nei suoli, di centinaia di migliaia di molecole di sintesi, molto spesso tossiche e persistenti, di cui nulla, o quasi, sappiamo circa gli effetti sulla salute.\nSostanze che entrano nei nostri corpi attraverso la pelle, l’aria che respiriamo, il cibo che mangiamo e interferiscono con le funzioni di organi e apparati delicatissimi originando malattie e dando luogo a quello che è stato definito “il paradosso del progresso”. Sostanze tossiche e cancerogene si trovano a centinaia anche nel cordone ombelicale e nel latte materno, interferendo quindi con lo sviluppo embrio-fetale, con la possibilità di dare origine a patologie che poi si manifesteranno non solo nell’infanzia ma anche nell’età adulta, tanto che si parla di una “origine fetale delle malattie dell’adulto”: dal cancro alle patologie metaboliche, dall’infarto a quelle neurodegenerative. Abbiamo trasformato il mare in un deposito di plastiche e l’atmosfera in una discarica cambiandone la stessa composizione chimica: nel 2015 la CO2 ha superato stabilmente la soglia delle 400 parti per milione (ppm), si pensi che solo nel 1985 la sua concentrazione era di circa 340 ppm e sappiamo che l’aumento della CO2 – fondamentalmente conseguente all’utilizzo di combustibili fossili – è strettamente connesso con il riscaldamento globale e i cambiamenti climatici in atto. La situazione, per come la vedo io è semplicemente drammatica, ma continuiamo sulla strada perversa delle incentivazioni alla combustioni: dal biogas, alle biomasse, dai rifiuti al petrolio, anche se oggi le tecnologie per ottenere tutta l’energia di cui abbiamo bisogno da fonti davvero rinnovabili – ovvero dal Sole – sono più che mature."
		},
		{
			"post_id": 62,
			"title": "La prova del danno dell’inquinamento sulla nostra salute",
			"date_published": 1562825321.42,
			"body": "L’ambiente è inquinato: si sa, lo sappiamo tutti, non è una novità.\nE forse non abbiamo neppure più voglia di sentircelo dire, o di parlarne. Se è vero che l’uomo è l’unico animale che si è adattato a vivere a ogni latitudine, che ha modificato ambienti ostili rendendoli adatti alla propria vita, allora possiamo pensare che ci adatteremo anche alle modificazioni ambientali che noi stessi abbiamo creato.\n\n* * *\n\nQuello di cui non abbiamo ancora una chiara percezione è quanto l’ambiente sia irrimediabilmente inquinato e quanto questo inquinamento riguardi molto da vicino tutti noi. Qui non si tratto solo del vortice di rifiuti di plastica che si sposa nel Pacifico di cui abbiamo spesso sentito parlare, o dell’inquinamento dell’aria delle nostre metropoli, ma anche delle sostanze rilasciate dai contenitori in cui conserviamo i cibi; dei cibi stessi in cui si ritrovano tracce di pesticidi, antibiotici, metalli pesanti, diserbanti; dei detergenti che usiamo per la casa e la persona; della carta di riviste e giornali; degli scontrini; della padelle; delle vernici e di tutti gli ordinari materiali da costruzione… l’elenco è potenzialmente infinito. Le recenti notizie sul glifosato (diserbante cancerogeno prodotto dalla Bayer-Monsanto) ritrovato nelle urine di 14 donne romane in stato interessante, le uova al fipronil (un insetticida estremamente pericoloso) e l’acqua del rubinetto che contiene microplastica sono solo la punta dell’iceberg e non rendono conto di quanto le sostanze chimiche, i metalli pesanti, i pesticidi, gli interferenti endocrini e i farmaci stanno danneggiando, ogni giorno, la nostra salute.\n\nSin da prima della nascita siamo attaccati da queste sostanze che vanno a incidere su più sistemi e apparati, secondo meccanismi d’azione di cui solo da pochi anni stiamo iniziando a scoprire l’esatto funzionamento. Nella ricerca del danno negli inquinanti al nostro corpo, la medicina ufficiale sta scoprendo che gli equilibri che regolano la salute e la malattia sono veramente sottili e riguardano il corpo visto come un sistema totalmente interrelato. In questo sistema l’intestino dialoga con il sistema nervoso e quello immunitario; l’ambiente influenza l’espressione epigenetica del DNA; gli ormoni si relazionano con il sistema nervoso e immunitario e così via, in un’orchestra sinfonica di dimensioni infinite a produrre la musica più melodiosa e complessa che conosciamo: quella della vita.\n\nLeggendo questo blog scoprirete, tra le altre cose, non solo la portata dell’inquinamento ambientale e delle patologie che esso scatena nel nostro corpo, ma troverete anche le informazioni, spesso censurate dalla medicina ufficiale e dai mezzi d’informazione tradizionali, per difendervi dalle sostanze più pericolose e, non da ultimo, avrete la chiara consapevolezza di quanto sia meravigliosamente complessa e divina la macchina umana e di quanto la scienza e la medicina siano solo all’inizio di un’esplorazione che può dirci ancora tantissimo sia sulla malattia che sulla salute.\nAndiamo avanti: la strada della consapevolezza è stata tracciata ed è ancora lunga da percorrere."
		},
		{
			"post_id": 60,
			"title": "A Verona libere e liberi, colorati, forti del nostro rispetto, delle nostre differenze",
			"date_published": 1553853514,
			"body": "Quando l’aria si fa opprimente la sensazione è che tutto diventi grigio, scuro, privo di luminosità dei colori. Il colore accompagna la libertà e la democrazia, rappresenta il senso di libertà che si accompagna al vivere bene la propria identità e riconoscere diversità e differenze come ricchezza. Proprio per questo vogliamo una società colorata, dove l’uguaglianza non è omologazione ma universalità di diritti.\n\n* * *\n\nSe invece mancano i colori, il mondo si restringe, viene limitato, deprime e mortifica, perché costringe ognuno a vestire panni non propri; quelli richiesti, imposti, da una morale che qualcuno pretende di decidere per tutti e tutte.\nGià qualcuno vuol decidere come ognuno di noi debba vivere, chi debba amare, come vestirsi, che una donna deve stare chiusa nelle mura di casa, morire nel dolore, che bambini e bambine devono abbandonare la scuola per studiare in casa, dove vi è certezza di non confrontarsi con la complessità del mondo.\nIl 29, 30 e 31 marzo i fautori di questa visione del mondo si troveranno a Verona per declamare queste ipotesi.\nMentre i nostri colori aprono strade di libertà per ognuno, loro vogliono affermare che esiste un’unica scelta legittima, fatta di divieti, ma soprattutto di supremazia, di ruoli codificati, di subalternità imposte.\nNulla potrà convincerci che dovremmo tornare tutte a casa, che si al’uomo che sceglie come e se le donne devono procreare, che esista amore e legame solo tra uomo e donna, che l’amore sia astrattamente per sempre, che in suo nome dovremmo sopportare violenza, umiliazione e sottomissione.\nBasta aprire una finestra sul mondo per vedere come gli Stati teocratici sono illiberali e repressivi. Spesso li indichiamo come ritorno al passato lontano, basterebbe definirli autoritari, al contrario delle democrazie laiche, che fanno del rispetto del credo di ognuno la condizione per la libertà collettiva. Uno Stato laico dovrebbe garantire universalità dei diritti, non discriminare e non giudicare. È del tutto evidente la pulsione autoritaria oltre che ipocrita di questi messaggi. Ipocrita perché si potrebbe in lungo e in largo raccontare come almeno una parte degli oratori annunciati al Congresso di Verona non conduca una vita riconducibile al modello che loro stessi promuovono.\nQuesta contraddizione rafforza il versante autoritario, quello che nega la libertà di scelta che ci siamo conquistate in tanti anni, perché occorre sempre ricordare che la libertà delle donne è metro di misura della democrazia, di un Paese come del mondo. Il rispetto delle scelte di ognuno, la non discriminazione sono essenziali per la vita libera delle persone.\nA Verona in quegli stessi giorni in cui si svolgerà il Congresso mondiale delle famiglie, ci dovranno essere tante voci, tante persone per rendere evidente la distanza tra il loro grigio e il nostro arcobaleno, tra chi vuol vivere gioiosamente e responsabilmente le proprie scelte di autodeterminazione e chi invece vuole costringere, perché concepisce solo modelli proprietari e di supremazia, e non afferma se stesso autodeterminandosi ma volendo controllare mente e corpo dell’altro da sé.\nSentenze, disegni di legge, proclami ministeriali, la gogna social per chi afferma opinioni differenti, il rifiuto di ogni diversità appare nelle cronache con cadenza ormai quotidiana, ma nessuno si faccia illusioni: non arretreremo di un millimetro dalle nostre conquiste, anzi sappiamo che tanta strada ancora abbiamo da fare per raggiungere pienamente la nostra libertà.\nTroppe ambiguità abbiamo visto nel governo, insopportabile è l’adesione di istituzioni, che non dimostra come qualcuno sostiene libertà di pensiero ma violazione della nostra Costituzione.\nAnche per questo saremo a Verona, libere e liberi, colorati, forti del nostro rispetto, delle nostre differenze, certe del diritto di autodeterminarsi."
		},
		{
			"post_id": 59,
			"title": "Una marea di donne contro crociati e neofascisti",
			"date_published": 1553853399,
			"body": "I sovranisti religiosi, bianchi, nordamericani e i loro omologhi russi e italiani puntano il dito contro la pillola e l’autonomia delle donne, a cui impuntano il calo delle nascite che, dal loro punto di vista, sarebbe un danno alla nazione.\n\n* * *\n\nCome nella Grecia antica la donna dovrebbe stare al suo posto chiusa nel gineceo, senza istruzione. Il suo compito – così teorizzava Aristotele – sarebbe quello di mera matrice materiale per garantire all’uomo la prosecuzione della stirpe. Zitta e velata, per Paolo di Tarso, la donna era un essere inferiore subordinato in tutto alla volontà dell’uomo, come sua mera appendice essendo nata da una sua costola. Il “pater familias” aveva potere assoluto sulle femmine, anche di vita e di morte.\nA quella oppressiva società patriarcale che combattiamo da millenni ci vorrebbero riportare i fautori del Congresso mondiale delle famiglie che si tiene a Verona dal 29 marzo. Per tre giorni i fondamentalisti evangelici, ortodossi e cattolici uniscono le forze per imporre la loro antistorica e antiscientifica visione che criminalizza le donne che decidono di interrompere una gravidanza. Stiamo parlando di una congrega di suprematisti nordamericani neonazisti, di convertiti africani diventati feroci quanto i loro colonizzatori, di crociati pro vita che, Oltreoceano come in Italia, vorrebbero imporre la tutela della vita fin dal concepimento. Parliamo di feticisti tanatofili che antepongono la vita solo biologica di un agglomerato di cellule a quella della donna, al punto da arrivare a uccidere in nome della tutela dell’embrione. Mancano le parole per descrivere tale galleria dell’orrore. E ci risparmieremo volentieri di parlarne lasciandoli alle loro elucubrazioni perverse, e violente, se questo incredibile congresso (benedetto da sostenitori di Trump e di Putin con lauti sostegni economici) non annoverasse tra i partecipanti ben tre ministri della Repubblica.\nLo abbiamo già scritto e torniamo a denunciarlo, è inaccettabile che tra i relatori figurino il ministro degli Interni, Matteo Salvini, quello della Famiglia, Lorenzo Fontana, e persino quello dell’Istruzione, Marco Bussetti, insieme a una pletora di parlamentari di destra, a cominciare dal leghista Pillon e da Giorgia Meloni di Fratelli d’Italia.\nGli articoli che leggerete su questo sito ricostruiscono puntualmente la galassia dei relatori e l’agghiacciante rete di rapporti che li legano a vario titolo a gruppi neofascisti e integralisti religiosi e razzisti.\n(Un esempio per tutti, il portavoce di ProVita Alessandro Fiore è il figlio del capo di Forza Nuova Roberto).\nLeggerete anche le parole del papa che, da Loreto, avverte: «È necessario riscoprire il disegno tracciato da Dio per la famiglia, per ribadirne la grandezza e l'insostituibilità a servizio della vita e della società».\nChiesa e politici genuflessi, con tutta evidenza, cercano di imporre la loro visione medievale a una società italiana sempre più secolarizzata che, sempre più, sfugge loro di mano. Ma le chiese sono vuote e, soprattutto, le donne non sono più disposte a fare un passo indietro sui diritti conquistati, come scrive Susanna Camusso, invitando tutte e tutti a partecipare alla manifestazione del 30 a Verona, per un’Italia Laica. La Cgil ci sarà insieme ad un gran numero di altre associazioni, dall’Uaar, all’Anpi, a Di.Re e Vita di Donna. In piazza a Verona ci saranno, in primis, le attiviste di Non una di meno. «Voi Vandea, noi marea», gridano a gran voce contro i più alti rappresentanti delle istituzioni italiane che, folgorati sulla via di Lepanto, vogliono fare strage di diritti delle donne. E non da ora. Si chiamava appunto Associazione Lepanto la rete ultra confessionale promossa dallo storico Roberto De Mattei, qualche anno fa assunto ai vertici del Cnr. L’esimio professore ebbe a dire che il terremoto era un castigo di Dio contro la promiscuità degli omosessuali. La battaglia di Lepanto del 1571 (data epocale per i crociati che fecero strage di turchi) era incisa, insieme al nome di Breivik e a quello di Traini, sulle armi ricaricabili di Brenton Tarrant, fondamentalista bianco e razzista, stragista psicopatico che a Christchurch in Nuova Zelanda ha ucciso 50 persone inermi in due moschee. E oggi il dittatore Erdogan tuona contro l’islamofobia che albergherebbe in Occidente, accendendo il fuoco dello scontro, come ricostruisce il reportage di Roberto Pinzio. L’integralismo religioso e razzista non accetta il diverso, non accetta la dialettica e la pruralità dei punti di vista.\nE in nome di Dio uccide."
		},
		{
			"post_id": 58,
			"title": "Soltanto «mele marce» tra le forze di polizia? (Parte 2/2)",
			"date_published": 1556114740.737,
			"body": "Anche secondo un’inchiesta condotta dalla ASI, Giuseppe Casu è stato fatto oggetto di un «trattamento inaccettabile», ma questo non ha impedito alla sua storia di finire nel dimenticatoio. E la stessa cosa rischia di accadere a Riccardo Rasman, trentaquattro anni, di Trieste. Si tratta di un ragazzo affetto da una sindrome schizofrenica contratta nel corso del servizio militare, a causa di ripetuti atti di nonnismo: un problema noto persino alla Corte dei Conti, che gli ha riconosciuto l’infermità per cause di servizio, e che gli ha lasciato in eredità una vera e propria fobia nei confronti di chi indossa una divisa.\n\n* * *\n\nEbbene, il 27 ottobre del 2006 Riccardo Rasman è felice. Il giorno dopo avrebbe dovuto iniziare a lavorare e festeggia l’avvenimento facendo un po’ di baccano e lanciando qualche innocuo petardo dal balcone. Una sua vicina di casa, però, è spaventata dal trambusto e decide di chiamare la Polizia. Sotto casa del ragazzo, poco dopo, si presentano due pattuglie, e quattro agenti, con malagrazia, iniziano a picchiare sulla porta dell’appartamento da cui provengono i rumori. Riccardo Rasman, dallo spioncino, vede quegli uomini in divisa e ha subito paura. Si guarda bene dell’aprire e si rifugia sul letto, in camera. La sua fine è segnata. La polizia fa intervenire i vigili del fuoco, che sfondano la porta mentre gli agenti irrompono nella casa di Rasman picchiandolo senza pietà e utilizzando allo scopo persino il piede di porco usato per compiere l’effrazione. Quando, ammanettato con i polsi dietro la schiena e immobilizzato con del fil di ferro legato intorno ai piedi, Rasman diventa cianotico è troppo tardi. Alcuni vicini di casa riferiranno di aver sentito dei rantoli fortissimi, poi più nulla: Riccardo è morto; l’ennesimo nome che parenti, amici e persone di buona volontà sono costretti a invocare nella speranza di ottenere una verità e una giustizia che, il 29 gennaio del 2009, si risolve in una condanna a sei mesi di carcere con pena sospesa per tre dei quattro agenti responsabili del reato.\nAnche per il falegname Alda Bianzino, quarantaquattro anni, di Pietralunga, in provincia di Perugia, i famigliari e gli amici invocano verità e giustizia. Come il romano Stefano Cucchi, Bianzino era stato arrestato per il possesso di stupefacenti – nella fattispecie qualche pianta di cannabis – e trascinato nel carcere Capanne. Qui, il 4 ottobre del 2007, Bianzino muore in circostanze quantomeno misteriose visto che le lesioni agli organi interni che saranno accertate dall’autopsia lasciano pochi spazi al dubbio e parlano, ancora una volta, di percosse violente subite da un cittadino coinvolto in piccoli reati.\nIn questa macabra lista è stato iscritto anche Giuseppe Torrisi, cinquantotto anni, un clochard di Milano ucciso a forza di botte da due agenti di polizia ferroviaria alla Stazione Centrale, il 6 settembre del 2008\\. dopo aver compiuto il misfatto, la coppia di sceriffi ha pensato bene di compilare un falso verbale accusando Torrisi di averli aggrediti con un taglierino. La circostanza verrà smentita dalle riprese di una videocamera: fotogrammi che la dicono lunga sia sul modus operandi a cui le forze dell’ordine si abbandonano spesso e volentieri, sia sulla facilità con cui diventa possibile inquinare le prove nel momento in cui le figure di chi delinque e di chi indaga arrivano a coincidere. Non si è pensata la stessa cosa in relazione al caso di Gabriele Sandri, classe 1981, il dj romano ucciso da una pallottola esplosa dall’agente Luigi Spaccarotella l’11 novembre del 2007 in prossimità della stazione di servizio di Badia al Pino Est, vicino ad Arezzo?\nAnche lì, forse per un malinteso spirito di corpo, un sentimento ai limiti dell’omertà ha accompagnato l’inchiesta che avrebbe dovuto accertare le cause della morte di Sandri, fatto passare per un teppista armato di sassi e bastoni quando, il vero delinquente, era ed è chi gli ha sparato: una persona che ha interpretato come licenza di uccidere l’autorità conferita dalla divisa.\nSpaccarotella, è vero, è stato processato. Ma nemmeno la solennità del dibattimento ha scalfito la convinzione di chi è convinto che la legge utilizzi due pesi e due misure quando si tratta di giudicare un membro delle forze dell’ordine o un comune cittadino. Al di là di ogni buonsenso, infatti, Spaccarotella è stato riconosciuto colpevole soltanto di omicidio colposo (tendenzialmente chi estrae la pistola e fa fuoco contro una persona viene giudicato per omicidio volontario): la stessa imputazione per cui sono stati condannati anche i quattro agenti che massacrarono Federico Aldrovandi i quali, come se non fosse abbastanza grave quello che hanno fatto, non sono stati neppure espulsi dal servizio e attualmente indossano ancora la loro brava divisa, con un morto sulla coscienza, liberi di condurre una vita normale e magari di delinquere ancora.\nComunque c’è anche chi, a differenza di Sandri o Aldrovandi, non riesce neppure a sottoporre attraverso un processo – magari dagli esiti scandalosi – il suo caso all’attenzione dell’opinione pubblica. Il discorso vale per il ventiduenne Manuel Eliantonio, un ragazzo di Pinerolo che, la mattina del 23 dicembre del 2007, viene sorpreso dalla polizia alla guida di un’auto rubata. Tradotto nel carcere di Marassi, Manuel va incontro a un calvario allucinante: percosso ripetutamente e costretto ad assumere psicofarmaci in grado di trasformare un uomo in una larva, cerca di denunciare le violenze che subisce ai suoi famigliari e ai suoi legali. Visitato in carcere, ostenta evidenti segni di maltrattamento, eppure nessuno riesce a fare nulla finché, il 25 luglio del 2008, la signora Maria non viene messa a conoscenza dell’avvenuto decesso del figlio. Secondo i verbali, e bisogna tenere conto che si tratta di un caso ormai frettolosamente archiviato, Manuel sarebbe morto per un arresto cardiaco sopraggiunto dopo l’inalazione di gas butano prelevato da una bomboletta comunemente utilizzata in carcere per alimentare il fornello ma, come testimonia la signora Maria, il corpo del ragazzo «era gonfio, di tutte le sfumature di colore. La testa sembrava una palla da bowling, aveva il naso rotto, l’occhio livido. Era irriconoscibile».\nUna circostanza ancora più atroce se messa in parallelo con le ultime parole di Manuel. Quelle contenute in una lettera spedita a casa e recapitata alla madre lo stesso giorno della morte del figlio. Una lettera straziante dove, nero su bianco, il ragazzo dice: «Carissime bamboline, mi dispiace che non vi ho fatto avere più mie notizie ma anche io ho i miei problemi. Mi ammazzano di botte almeno una volta alla settimana, ora ho solo un occhio nero. Mi riempiono di psicofarmaci, quelli che riesco li sputo ma se non li prendo mi ricattano».\nTutto questo, purtroppo, non è che un frammento di ciò che accade nelle carceri italiane. Se si ha voglia e il cuore di consultare i dossier compilati con encomiabile sistematicità dalle associazioni per i diritti dei detenuti si scopre che, tra suicidi e morti per cause da chiarire, all’interno dei penitenziari sta andando in scena un olocausto che non sembra in grado neppure di scuotere le coscienze della gente comune, dei cittadini «per bene». Le colpe dei mass media, a tal proposito, sono gravissime. Perché quando una nuova persona vien stritolata dagli ingranaggi della giustizia la tendenza è quella di far passare il messaggio che, alla resa dei conti, se chi è stato arrestato o fermato dalle forze di polizia si fosse comportato bene non si sarebbe trovato nella situazione di farsi sparare in testa o massacrare di botte.\nLa colpa della propria morte, in buona sostanza, ricade sempre sulla vittima. Anche nel caso in cui questa, come il senegalese Chehari Behari Diouf, quarantadue anni, residente a Civitavecchia, in provincia di Roma, non avesse fatto null’altro di diverso dallo starsene comodamente seduto nel giardino di casa sua. L’ispettore di polizia Paolo Morra ha avuto da ridire e, accusando il signor Diouf di schiamazzi, gli ha scaricato addosso il fucile, uccidendolo il 31 gennaio del 2009.\ndall’esecuzione di Diouf alla fine di Stefano Cucchi, la morale sembra essere sempre la stessa. Persino nel caso in cui le responsabilità vengano accertate, i colpevoli in divisa sono protetti da indagini a dir poco felpate e, mentre chi è caduto sotto i loro colpi viene sbattuto in prima pagina e magari presentato come delinquente o drogato, i membri delle forze dell’ordine conoscono diritti sconosciuti agli altri cittadini, come un devoto rispetto alla privacy che gli risparmia l’onta, obbligatoria per i comuni mortali, di finire con le loro belle facce sulle pagine dei giornali.\nQuando, malgrado tutto, non si può evitare di prendere atto della colpevolezza di un carabiniere, una guardia carceraria o un poliziotto, poi, la giustificazione suprema è sempre la stessa. Che si parli di Luigi Spaccarotella (caso Sandri), di Paolo Forlani, Monica Segatto, Enzo Pontani e Luca Pollastri (caso Aldrovandi) o di Paolo Morra (caso Diouf), ecco che la teoria della «mela marcia» prende il sopravvento e i vari pregiudicati in divisa diventano delle semplici, dolorose, ma inevitabili, eccezioni in un corpo comunque presentato come sano.\nL’evidenza dei fatti se non la nuda casistica, però, afferma il contrario. Esiste in Italia, ed è il caso di sottolinearlo, un serio problema di violenza della Polizia: corollario di una più generale crisi del rispetto dei diritti umani. Le stesse politiche dell’ordine pubblico implementate nelle ultime legislature – e ormai estese a ogni ambito della vita civile come testimoniato dai continui provvedimenti presi, di volta in volta, per intensificare i controlli di polizia per le strade, sorvegliare gli stadi o «respingere» gli extracomunitari privi di permesso di soggiorno – (mal)celano la precisa volontà di eordere le garanzie democratiche a tutela del cittadino in nome di un pericoloso concetto di «sicurezza». Si tratta di un processo involutivo enormemente pericoloso, foriero di sventure inconcepibili come quella in cui è incappato un altro ragazzino di nome Rumesh Rajgama Achrige, un writer diciottenne di Como che, il 29 marzo del 2006, nel corso di un banale controllo, si è ritrovato ridotto in fin di vita da un colpo di pistola sparato contro di lui da uno dei vigili urbani che, negli ultimi anni, si è pensato bene di armare.\nCome affermato nell’integrazione parlamentare degli onorevoli Locatelli e Giordano, i fatti di Como rappresentano: «Il fallimento di una classe politica che, non solo non cerca il dialogo anche attraverso la necessaria e legittima convocazione di un consiglio comunale straordinario, ma utilizza metodi repressivi per affrontare i presunti problemi della città».\nIl discorso, più ampio, ha a che fare con un governo centrale particolarmente abile nello scambiare il concetto di «giustizia» con un’ambigua esigenza di legalità, criminalizzando categorie sempre più ampie di soggetti. Persone che la profonda crisi economica in corso rende incompatibili rispetto alle regole non scritte di un «sistema-Paese» ben disposto soltanto nei confronti di chi è pronto ad accettare una vita-coprifuoco, fatta di lavoro (in genere precario e mal pagato) e televisione. Ecco allora che i piccoli spacciatori, i ragazzi dei centri sociali, i migranti, i poveri e persino i malati psichici si ritrovano, tutti insieme, a vestire la maglia del «nemico»: individui nei confronti dei quali le forze di polizia sembrano combattere anziché, come in ogni caso sarebbe loro compito istituzionale, assistere nel rispetto della garanzie istituzionali. Stefano Cucchi, massacrato senza pietà, è solo l’ennesimo anello di questa catena: una trama dove le «mele marce» non si trovano soltanto tra gli individui responsabili dei vari reati ma soprattutto nei gangli del potere legislativo, dove non si fa altro che legittimare una cultura della paura, dell’intolleranza e del sospetto in un contesto di progressiva e inesorabile erosione di ogni garanzia sociale. Ora che le orbite tumefatte e incavate di Cucchi gridano vendetta la cospetto di ogni residuo di coscienza collettiva, sarà possibile operare un cambiamento e rivedere radicalmente le procedure di ordine pubblico in vigore in Italia? Sarà possibile, almeno per una volta, dare un senso a quegli slogan di «Verità e Giustizia» che comitati sparsi in tutto il Paese chiedono per le numerose vittime innocenti?\nIn attesa di una risposta, forse impossibile, non resta che constatare l’esistenza di un sospetto. Il sospetto, nella fattispecie, riguarda proprio la morbidezza delle sentenze con cui i colpevoli in divisa di fatti di sangue sono sistematicamente beneficiati: è forse possibile che queste sentenze siano così morbide perché in caso contrario le forze di polizia, qualora chiamate ad assolvere un simile compito (e se la democrazia in Italia non fosse poi così stabile? E se, come in passato, il Paese cadesse vittima di una svolta autoritaria?), non se la sentirebbero di aprire il fuoco sulla gente o di usare la violenza per reprimere manifestazioni di piazza?\nL’interrogativo – quello di un corpo di polizia da addomesticare in attesa di una chiamata generale alla repressione diffusa – resta inquietante e aperto. Come le ferite inferte al corpo di giovani come Stefano Cucchi, malamente cicatrizzate dall’avvento di inchieste morbide e sentenze compiacenti, complici di delitti atroci troppo spesso destinati a restare impuniti."
		},
		{
			"post_id": 57,
			"title": "Soltanto «mele marce» tra le forze di polizia? (Parte 1/2)",
			"date_published": 1555948224.509,
			"body": "Il 22 ottobre del 2009, con la morte improvvisa di Stefano Cucchi, è cambiata la storia. Prima che venissero rese pubbliche le fotografie del cadavere del trentunenne romano c’erano soltanto le immagini dei campi di concentramento nazisti a urlare «se questo è un uomo!» contro chi aveva costretto delle persone a finire, ormai ridotti a scheletri, in cataste ammucchiate davanti ai forni crematori o malamente nascoste nelle fosse comuni. Eppure, ancora una volta, «tutto questo è stato».\n\n* * *\n\nStefano Cucchi, arrestato al Parco degli Acquedotti della Capitale nella notte del 15 per il possesso di modeste quantità di stupefacenti e, da lì, trascinato come una cosa tra la camera di sicurezza della stazione «Tor Sapienza» dei Carabinieri, i banchi del Tribunale di piazzale Clodio, le celle di Regina Coeli e il reparto detentivo dell’ospedale Sandro Pertini, non è sopravvissuto agli atroci maltrattamenti a cui è andato incontro. Ora è sulle pagine dei giornali che hanno avuto il coraggio di pubblicare le immagini del suo decesso e fissa i lettori con i 37 chili del suo corpo da «Cristo giovinetto», con gli occhi spaccati, la mascella rotta, la spina dorsale fratturata e una pupilla fuori dalle orbite. Cosa gli è successo? Davvero, come è stato detto, «è caduto per le scale»? Davvero i suoi poveri resti sono soltanto il frutto dei suoi passati problemi di tossicodipendenza e dell’anoressia? O ha ragione chi ha avuto il coraggio di scrivere che la sua triste fine è da attribuirsi a «presunta morte naturale»?\nChi ha osato vergare queste parole mente sapendo di mentire.\nLa morte «naturale» non si presume, si constata. E se intorno al destino di Stefano può essere presunto qualcosa, questo qualcosa si chiama manganellate in faccia, anfibiate alla schiena o, più semplicemente, violenza becera e insensata compiuta dalle forze dell’ordine. Non ci credete?\nChiedete a chi ci è passato. Domandate ai ragazzetti fermati con qualche grammo di hashish cosa significa essere spogliati nudi in una caserma, essere costretti a una perquisizione anale o vaginale, essere percossi con gli stracci bagnati e il dorso degli elenchi del telefono….\nOppure domandate a chi è finito in carcere per piccoli reati quanto sia facile, in prigione, non riconoscere il codice di comportamento imposto dalla vigilanza e pagare con schiaffi, umiliazioni o peggio anche una semplice parola considerata fuori posto da chi, negli istituti di pena, rappresenta la legge.\nEbbene, se la legge è davvero uguale per tutti, è ora che chi indossa la divisa salga sul banco degli imputati per assumersi, insieme alle responsabilità penali dei singoli, anche la responsabilità di mettere in discussione il sistema dell’Ordine Pubblico, affrontando un discorso che riguarda, indistintamente, gli agenti penitenziari, i carabinieri e la polizia. Perché, soltanto facendo i conti a partire dal 2005, sull’altare della sicurezza sono state sacrificate decine di vite: persone, spesso giovanissime, assassinate dagli stessi uomini assunti al servizio dello Stato in loro presunta tutela.\nQuando questo accade, sulla scena del delitto cala una pesante cortina di piombo. E se di processo si parla, questo riguarda in primo luogo le vittime, in genere definite «tossicodipendenti», «sbandate», «malate di mente», «extracomunitarie» o «drogate». È stato il caso di Federico Aldrovandi, un ragazzino appena maggiorenne massacrato da quattro agenti di Polizia a Ferrara, il 25 settembre del 2005\\. Di lui, chi lo ha ucciso infierendo a calci, pugni e manganellate, ha prima detto che «sembrava un albanese», poi che si è ammazzato da solo prendendo a testate un muro. In gergo viene definita «crisi psicomotoria»: la stessa che è stata affibbiata anche a Giuseppe Casu, un signore sessantenne di Quartu, in provincia di Cagliari, trascinato via con la forza dalla piazza dove vendeva fichi d’india in quanto ambulante abusivo e da qui, grazie all’intervento di guardie municipali e carabinieri, condotto in Trattamento Sanitario Obbligatorio (TSO) nell’ospedale di Is Mirrionis. Nel nosocomio nessuno fa domande sulla mano gonfia del signor Casu o sulla presenza di sangue nelle sue urine: a nessuno importa scoprire qual’è l’origine delle ferite che il «paziente» ha sul corpo. Il venditore di fichi d’india viene semplicemente sedato e legato al letto. Lo stesso letto dove, il 9 ottobre de l2006, Giuseppe Casu muore."
		},
		{
			"post_id": 56,
			"title": "Non mi uccise la morte (Parte 7)",
			"date_published": 1555877391.244,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 7\\. Verità e Giustizia\n\nI genitori ottengono finalmente l’autorizzazione a poter fotografare le spoglie del ragazzo e decidono coraggiosamente di mostrarle alle principali testate giornalistiche. Le immagini cruente del corpo suppliziato si rincorrono nella rete, si apre un’interrogazione parlamentare, il Ministro Alfano riprende la tesi assurda della «caduta accidentale dalle scale»; cui segue Giovanardi: «Stefano Cucchi è morto perché anoressico, drogato e sieropositivo».\n\n* * *\n\nLa famiglia nomina allora Fabio Anselmo, già legale del giovane Aldrovandi, interviene Angiolo Marroni, Garante dei diritti dei detenuti del Lazio. S’increspa l’opinione pubblica: c’è un sottile filo nero che collega la morte di Stefano a quella di molti altri detenuti, dal ferroviere Pinelli fino al giovane Aldrovandi, la storia di Stefano non è più solo la storia della famiglia Cucchim a diviene la storia di tutti coloro i quali credono nel valore della parola Giustizia.\nAd duas Lauros, via di Tor Pignattara si riempie di giovani, chiedono «Verità e Giustizia per Stefano Cucchi».\nIniziano le perizie, le cartelle cliniche sono imbrattate, piene di correzioni e aggiustature, i medici risultano inadempienti: non hanno scelto il trattamento sanitario obbligatorio per salvare il ragazzo. Un detenuto del Gambia dichiara di aver assistito al pestaggio del giovane, in brevissimo tempo viene trasferito nel carcere di Teramo e scompare dalla scena.\nOrmai però il caso è di dominio pubblico: «Mio figlio in quel momento era sotto la tutela dello Stato», ha tuonato la voce sofferta del padre.\nEppure le foto mostrate coraggiosamente dalla famiglia rimangono per ora l’unica verità, rimangono l’unica àncora di salvezza di uno Stato, che ha fallito nel preservare la dignità umana di un ragazzo che gli avvenimenti avevano posto sotto la Sua tutela.\n\n«Caro Francesco, sono al Sandro Pertini, in stato d’arresto. Scusa se stasera sono di poche parole ma sono giù di morale e posso muovermi poco. Volevo sapere se potevi fare qualcosa per me. Adesso ti saluto, a te e agli altri operatori.\nP.S. per favore rispondimi».\n\nQuesta è la lettera scritta da Stefano il giorno prima di morire, una triste richiesta di aiuto, una lotta contro l’isolamento in cui era stato confinato, l’ultimo sospiro di una giovane vita spezzata."
		},
		{
			"post_id": 55,
			"title": "Non mi uccise la morte (Parte 6)",
			"date_published": 1555876210.706,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 6\\. Della presunta morte naturale.\n\n«22/10/2009 Vengo chiamata dal personale infermieristico in quanto il paziente non risponde agli stimoli. All’ingresso nella stanza trovo il personale infermieristico che ha già iniziato la rianimazione cardiopolmonare. Segni vitali assenti. Decesso ore 06:45.»\n\n* * *\n\nStefano muore così, in silenzio, senza poter riabbracciare i suoi famigliari, senza poter parlare con il suo avvocato di fiducia, isolato dal mondo esterno, steso su quel letto, con indosso gli stessi abiti del giorno dell’arresto.\nAlle 12:30 un carabiniere si presenta a casa Cucchi, si tratta di una pratica amministrativa, devono notificare alla famiglia il decreto del Pubblico Ministero per l’incarico del consulente d’ufficio a espletare l’autopsia per il decesso di Stefano.\nIn questa maniera la famiglia viene a conoscenza della sua morte: «Si è spento, non voleva le nostre cure, aveva sempre un lenzuolo sulla faccia! Si è praticamente spento».\nIl giovane per i medici «si è praticamente spento», ma la spiegazione non basta ai genitori che hanno consegnato una giovane vita nelle mani dello Stato e ora si trovano a fare i conti con un dolore insopprimibile.\nQualcosa si accende, qualcosa di più composto e orgoglioso della rabbia di chi ha perso un figlio, si tratta di un anelito alla Verità e alla Giustizia che in pochi giorni finirà per coinvolgere tutti i media e l’opinione pubblica.\nI genitori si recano all’obitorio, vogliono vedere il corpo del ragazzo. Stefano è irriconoscibile: ha un occhio gonfio e l’altro praticamente incavato, la mascella è rotta e il viso cotto da una sofferenza prolungata.\nQuesta è l’unica verità che viene consegnata alla famiglia Cucchi e da questa verità i famigliari di Stefano partono per una lotta legale che possa almeno portare pace alle sofferte spoglie del giovane. Viene effettuata l’autopsia. Al consulente di parte, nominato dalla famiglia, non viene consentito di scattare fotografie.\nIl corpo di Stefano ora pesa solo 37 chili."
		},
		{
			"post_id": 54,
			"title": "Non mi uccise la morte (Parte 5)",
			"date_published": 1555874715.791,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 5\\. Dal libro del profeta Isaia.\n\n“Il Servo del Signore è cresciuto come un virgulto davanti a lui e come una radice in terra arida. Disprezzato e reietto dagli uomini, uomo dei dolori che ben conosce il patire.\nMa al Signore è piaciuto prostrarlo con dolori. Quando offrirà se stesso in espiazione, vedrà una discendenza, vivrà a lungo, si compirà per mezzo suo la volontà del Signore.\nDopo il suo intimo tormento vedrà la luce e si sazierà della sua conoscenza; il giusto mio servo giustificherà molti, egli si addosserà la loro iniquità”.\n\n* * *\n\nVia Casalina 641, Roma, la chiesa dei santi Marcellino e Pietro Ad Duas Lauros si svuota lentamente, attendere il lunedì, questo l’unico pensiero della famiglia di Stefano.\nNessun fasto domenicale, nessun pranzo sontuoso, solo un pensiero: Stefano.\nLa liturgia domenicale continua in Tv, Benedetto XVI e il suo Angelus, sono parole che rimangono lì, impigliate in quel silenzio ambiguo, nell’attesa della venuta di un nuovo giorno che porti notizie concrete di un figlio lontano.\nIl lunedì, come loro indicato, i coniugi Cucchi si recano nuovamente presso il padiglione di Medicina Protetta dell’ospedale Pertini. Questa volta è il piantone a fermarli, vengono fatti accomodare in un vestibolo e vengono presi i documenti per registrare le generalità.\nNell’attesa hanno modo di parlare con la sovrintendente del reparto, alle insistenti richieste la donna liquida il discorso con un «il ragazzo sta tranquillo», ma la visita va nuovamente ritardata, c’è bisogno di un’autorizzazione dal carcere che ancora non è arrivata e quindi i genitori non possono vedere il ragazzo.\nI genitori non demordono, ripetono che non vogliono incontrare il ragazzo ma solo parlare con i medici, conoscere lo stato di salute di Stefano. Avranno notizie, è sempre la sovrintendente a rispondere, sicuramente domani, basterà attendere l’arrivo dell’autorizzazione: «Tornate domani e non vi preoccupate...».\n«Il paziente è molto polemico. Si gira con la testa mantenendo la posizione prona. Si convince a farsi visitare ma è scarsamente collaborante. Presenta verosimile ematoma regione glutea sinistra. Vistoso ematoma ed ecchimosi preorbitaria sinistra. Rifiuta di continuare a parlare. Impossibile proseguire la visita. Paziente non accessibile al colloquio».\nIl diario clinico di Stefano è ambiguo e pieno di correzioni.\nMartedì 20 ottobre, gruppuscoli di giovani girovagano per la città, c’è lo sciopero nazionale della scuola, studenti e insegnanti manifestano contro il previsto Regolamento di Riorganizzazione Scolastica. I genitori di Stefano sono di nuovo davanti al Sandro Pertini, non hanno perso le speranze, continuano a confidare nello Stato e nei suoi rappresentanti.\nIn questa occasione non vengono neanche fatti entrare, il piantone comunica loro attraverso una grigia griglia di citofono, l’autorizzazione non è arrivata, e mai arriverà in maniera autonoma, bisogna farne richiesta: «Sia per i colloqui con i detenuti sia per quelli con i medici occorre chiedere il permesso del Giudice del Tribunale a Piazzale Clodio».\nSono passati più di quattro giorni dall’arresto di Stefano e i genitori non hanno nessuna notizia sul suo stato di salute, la loro dignitosa fiducia comincia a traballare ma non si danno per vinti.\nIl giorno seguente il padre si reca in Tribunale e come indicato, dopo una mattinata di attesa, ottiene l’agognata autorizzazione, potrà avere notizia solo il giorno seguente, giovedì 22 ottobre.\nNel frattempo le condizioni di Stefano peggiorano ulteriormente: «Signora dica a mia sorella Ilaria di tenermi il cane. Se lo ricordi mi raccomando!». La frase sussurrata a una volontaria che presta servizio tra i detenuti suona quasi come un testamento sentimentale.\n\n«21/10/2009 Visti gli esami ematochimici eseguiti questa mattina, si propone nuovamente al paziente reidratazione endovenosa ma il paziente rifiuta perché vuole parlare prima con il suo avvocato e con l’assistente della comunità CEIS di Roma. Lo stesso rifiuta anche di alimentarsi, come sta facendo fin dall’ingresso, per lo stesso motivo. Ha un atteggiamento oppositivo e diffidente, è polemico sul vitto che gli viene portato».\n\nIl destino di Stefano sembra segnato, le sue parole inascoltate, ancora un po’ di forza, una penna e un fogliaccio per scrivere una breve lettera a Francesco, uno egli operatori del CEIS, il centro di recupero dove Stefano probabilmente voleva tornare»."
		},
		{
			"post_id": 53,
			"title": "Non mi uccise la morte (Parte 4)",
			"date_published": 1555858697.335,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 4\\. Lo splendore dei supplizi.\n\nOre 14:05, Rivotril, Roche SPA, clonazepam, benzodiazepina ad alta potenza, due compresse, bastano due compresse e quella sensazione di essere sotto giudizio sembra sparire, torna la quiete, ma non bisogna mai esagerare, i tremori sono sempre in agguato.\nDopo la somministrazione dell’antiepilettico la visita continua e i medici riscontrano le prime lesioni:\n«Si rilevano lesioni ecchimotiche in regione palpebrale inferiore bilateralmente, di lieve entità e colorito purpureo. Riferisce dolore e lesioni anche alla regione sacrale e agli arti inferiori, ma rifiuta l’ispezione. Evasivamente riferisce che le lesioni conseguono ad accidentale caduta dalle scale».\n\n* * *\n\nLo splendore dei supplizi ha cominciato a esercitare il suo bagliore, l’apparato della giustizia punitiva comincia a mordere la carne, il potere finisce per avere una presa immediata sul corpo del detenuto: lo investe, lo marchia, lo addestra al dolore. Il supplizio è quell’arte, esercitata dal potere, di intrattenere la vita nella sofferenza prima che l’esistenza cessi e sopraggiunga la morte.\nLa Città Giudiziaria entra in un triste cono d’ombra.\n«Cartella Provvisioria Nuovi Giunti, Casa Circondariale di Regina Coeli, Signor Cucchi Stefano, giunto in questa sede il 16/10/2009, peso kg 52, altezza 1,68.\nqueste le sparute indicazioni del diario clinico d’ingresso nel carcere di Regina Coeli, Stefano è dolorante, fatica a camminare, ha inspiegabilmente il volto gonfio.\nI sanitari decidono per il ricovero immediato presso l’ospedale Fatebenefratelli.\n«Frattura del corpo vertebrale di L3 sull’emisoma sinistro e frattura della prima vertebra coccigea», le radiografie eseguite dai medici del Fatebenefratelli parlano chiaro, il ragazzo è conciato male, eppure rifiuta il ricovero.\nIl sabato sopraggiunge nel silenzio, le strade della Città Eterna sono congestionate dal traffico, sono per di più giovani pronti al relax e alle feste del fine settimana, un’ambulanza con le sirene fatica a dimenarsi nel groviglio di macchine.\nOre 19:45, le condizioni di Stefano sono peggiorate, si decide per un nuovo ricovero presso la Divisione di Medicina Protetta dell’ospedale Sandro Pertini.\nViene effettuato un esame direttamente all'ingresso del ragazzo, le sue condizioni generali vengono definite “buone”, questo e tutti i diari clinici compilati successivamente mostrano una strana confusione e una noiosa tattica di copiatura amanuense divenendo uno la copia sbiadita dell’altro, la prognosi rimarrà invariata.\nLa sera ha raggiunto anche casa Cucchi, su Rai Uno c’è il quarto appuntamento con Affari Tuoi, il montepremi del quiz condotto da Max Giusti ha raggiunto quota due milioni di euro, l’Italia della crisi è incollata a quegli schermi, ruggisce d’invidia per una svolta che possa sistemare le cose in un colpo solo.\nSembrerebbe un sabato come tanti, non fosse per quel silenzio ambiguo, per quell’aria fitta di pensieri, poi d’un tratto, lo squillo del telefono…\nStefano sta male, è stato ricoverato d’urgenza presso la Sezione Penitenziaria dell’ospedale Sandro Pertini.\nI genitori si precipitano, giusto il tempo di organizzare una piccola busta con la biancheria pulita e via di corsa fino alle porte dell’ospedale.\nMa il detenuto non deve essere visto, i genitori vengono fermati all'ingresso, quello in cui si trovano è un carcere e i pazienti che vi risiedono sono detenuti e non possono avere visite non autorizzate.\nI genitori in realtà vogliono solo avere notizie sul suo stato di salute, ma anche questo è impossibile, sono notizie riservate la cui divulgazione è consentita solo ai medici competenti, devono tornare lunedì, dalle 12:00 alle 14:00, in orario di ricevimento.\nLunedì potranno finalmente parlare con i medici."
		},
		{
			"post_id": 52,
			"title": "Non mi uccise la morte (Parte 3)",
			"date_published": 1555840926.498,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 3\\. Sorvegliare e punire.\n\n09206207 questo il numero di riferimento del cartellino d’emergenza aperto dalla ARES, Azienda Regionale per l’Emergenza Sanitaria, alle ore 05:10 del 16 ottobre e chiuso poco dopo, alle ore 05:48.\nIl detenuto dice di essere affetto da epilessia, conferma di sentirsi poco bene e presenta tremori, ma rifiuta ogni tipo di assistenza sanitaria. L’ambulanza lascia via degli Armenti, la porta della cella si chiude di nuovo. Il primo dei tanti buchi neri di questa storia: il ragazzo sta male, sa di avere problemi di epilessia, mostra evidenti forme di tremore, ma preferisce una cella fredda e spoglia al ricovero in ospedale.\n\n* * *\n\nL’alba sopraggiunge lentamente, gela la punta dell’erbetta che circonda gli acquedotti e s’insinua nella pietra trasformando quell’immenso complesso monumentale in un corpo unico con la campagna circostante.\nStefano non ha dormito, lo spioncino della porta blindata cigola ancora; è stato colto in flagranza di reato e quindi verrà condotto dallo stato di fermo direttamente davanti al giudice del dibattimento.\nIl processo avverrà per direttissima.\nMercurio, messaggero alato degli dèi, protettore dei ladri, dei truffatori e dei bugiardi troneggia come un gufo all’ingresso della Città Giudiziaria. Sono le nove del mattino quando, scortato dai Carabinieri, Cucchi raggiunge il Tribunale.\nIl processo per direttissima inizierà solo alle 12:00, i genitori hanno nuovamente modo di vedere Stefano: cammina sulle sue gambe ma mostra il volto gonfio, memore di una notte difficile.\nPassa poco più di mezz’ora e il Giudice ha già emesso la sua sentenza di fronte a un avvocato d’ufficio annoiato e silenzioso. Stefano ha ammesso la detenzione di sostanze stupefacenti per uso personale, ma si decreta comunque la sua assegnazione al carcere di Regina Coeli. Non ci sta, con un calcio scaraventa la sedia che ha di fronte, abbraccia per l’ultima volta i suoi famigliari, il processo è terminato.\nLe porte della Città Giudiziaria si chiudono alle spalle della famiglia Cucchi, sono tristi e arrabbiati per la sentenza emessa ma conservano quella forma etica di rispetto e fiducia nei confronti dello Stato che è comune a tutte le famiglie italiane.\nDopo il processo avviene il passaggio di consegne: i Carabinieri lasciano il giovane nelle mani della Polizia Penitenziaria, sono solo le ore 14:00, il ragazzo viene sottoposto a una nuova visita sanitaria."
		},
		{
			"post_id": 51,
			"title": "Non mi uccise la morte (Parte 2)",
			"date_published": 1555665828.616,
			"body": "La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n### 2\\. Ad duas lauros.\n\nRoma, 15 ottobre 2009, Parco degli Acquedotti, un’area verde stretta tra le borgate che propone uno strano connubio tra antichità e urbanizzazione forzata, talvolta degrado: palazzacci ammucchiati dall’edilizia convulsa e triste degli anni Ottanta. Un giovane passeggia con il suo cane, sono le 23:30, è in compagna di un’altra persona, parlottano uno di fianco all’altro. La macchina dei Carabinieri si avvicina lentamente, sono insospettiti dai movimenti dei due, decidono di intervenire.\n\n* * *\n\nTrovano indosso al giovane venti grammi di hashish e delle pillole sospette, scatta il fermo, il ragazzo viene tratto in arresto e condotto nella casa di residenza per la perquisizione di rito.\nIl giovane vive con i genitori nel quaritere popolare di Tor Pignattara, poco distante dal luogo dell’arresto, “ad duas lauros”, così lo scrittore Tertulliano ricordava quelle terre: tra due lauri venne ucciso l’imperatore Valentiniano III durante una congiura.\nI genitori vengono svegliati dall’ingresso del giovane scortato dai Carabinieri, è notte fonda, gli uomini dell’Arma intendono perquisire la sua stanza.\nIl ragazzo si chiama Stefano Cucchi, ha trentun’anni ed è geometra, lavora nello studio di famiglia con il padre e la sorella; ha già avuto problemi per droga, infatti ha frequentato il CEIS: una comunità di recupero per le tossicodipendenze; ora sembra guarito e in salute, da tempo ormai segue un corso serale di prepugilistica.\nI Carabinieri terminano la perquisizione della casa senza sortire risultati, le pillole sono solo dei salvavita: Stefano ha occasionalmente delle crisi epilettiche e nonostante affermi che la droga sia per uso personale viene condotto in caserma dove si concludono le pratiche dell’arresto.\nI Carabinieri ci tengono a tranquillizzare i genitori: vista la modica quantità di stupefacente, sicuramente il ragazzo otterrà gli arresti domiciliari.\nStefano entra in camera di sicurezza solo verso le 04:00 del mattino, la camera è spoglia, fa freddo, c’è solo un materasso arrotolato e sudicio. Passano pochi minuti e comincia a lamentare tremori, un dolore alla testa insopportabile, le convulsioni.\nUn’ambulanza sopraggiunge poco dopo in via degli Armenti, sede della stazione dei Carabinieri."
		},
		{
			"post_id": 50,
			"title": "Non mi uccise la morte (Parte 1)",
			"date_published": 1555658303.293,
			"body": "### La storia di Stefano Cucchi: arrestato a Roma il 15 ottobre del 2009, tradotto in carcere, e mai più uscito vivo.\n\n«Abbiamo rischiato una rivolta perché il negro ha visto tutto. Un detenuto non si massacra in sezione, si massacra sotto».\n(G. L., Comandante Polizia Penitenziaria, carcere di Castrogno).\n\n* * *\n\nLa notte del 15 ottobre del 2009, il giovane geometra Stefano Cucchi viene fermato da una pattuglia dei Carabinieri nei pressi del Parco degli Acquedotti di Roma e trovato in possesso di una piccola quantità di hashish. I militari, dopo aver perquisito l’abitazione di Cucchi, arrestano il ragazzo e lo portano in caserma.\nAl momento del fermo – contrariamente a quanto si è sostenuto – Stefano gode di ottima salute e frequenta quotidianamente un corso di prepugilistica. Il giorno dopo il suo arresto, processato per direttissima nel tribunale di piazzale Clodio, ha il volto segnato ma sta ancora bene. Quello è l’ultimo momento in cui i genitori di Stefano Cucchi hanno la possibilità di vedere il figlio. Perché, una volta condotto nelle celle di sicurezza del tribunale e, da lì, nella sezione penale dell’ospedale Sandro Pertini, Stefano Cucchi emergerà dall’incubo in cui è precipitato soltanto grazie a una serie di immagini raccapriccianti: gli occhi incavati e la mascella rotta come uniche testimonianze di un trattamento crudele e disumano.\n«Decretato» morto la mattina del 22 ottobre, Stefano Cucchi da quel momento in poi diventa il simbolo dei diritti negati e dei tanti – troppi – omicidi commessi nelle carceri, sotto la tutela dello Stato.\n“Non mi uccise la morte” racconta con partecipata sofferenza gli ultimi giorni di vita del ragazzo e, con coraggio, squarcia il velo di omertà che è sembrato calare su un caso che ha commosso l’Italia.\n\n-\n\nPrima edizione: ottobre 2010\n\n* * *\n\n### 1. Splitting the atom.\n\nMilano, 7 novembre 2009, la platea del Palasharp è gremita, si esibiscono i Massive Attack, lo storico collettivo che ha fondato l’epopea trip hop, è la prima delle due date italiane del loro tour, stanno presentando il freschissimo “Splitting the atom”.\nL’atmosfera è incandescente, non c’è solo la loro musica: nello sfondo scorre l’installazione del approntata dai ragazzi di U.V.A., United Visual Artists. Si tratta di una fotografia contemporanea che, a seconda dei luoghi dove si esibisce il gruppo, contestualizza gli eventi: dallo stock market, alla cronaca, fino alle previsioni del tempo.\nL’Italia sembra allora un paese ricco di spunti: mentre la band esegue il brano “Inertia creeps”, tratto dall’album “Mezzanine”, alle loro spalle scorrono i titoli tratti dai principali fatti di cronaca avvenuti recentemente nel nostro paese. Dai gossip governativi a quelli legati al mondo dello spettacolo, fino alle sentenze più o meno discusse dei nostri tribunali.\nUna frase sembra infine far esplodere l’intera scena: «VERITÀ E GIUSTIZIA PER STEFANO CUCCHI».\nQuesto è il nome che si è letto più volte sullo sfondo mentre Robert Del Naja e Daddy G, superstiti del nucleo iniziale della band, eseguivano uno dei brani più intensi delle quasi due ore di spettacolo.\nChi è Stefano Cucchi e a quale verità si riferisce la band di Bristol?\nBisogna fare un passo indietro."
		},
		{
			"post_id": 49,
			"title": "Quando non andammo su Venere",
			"date_published": 1554559712.902,
			"body": "### La NASA aveva progettato una missione umana verso il pianeta, ma per fortuna l’idea venne abbandonata.\n\n* * *\n\nMentre si avvicina rapidamente il cinquantennale della prima passeggiata di un essere umano sul suolo lunare, e la corsa allo spazio sembra essere ritornata di moda (con i progetti avveniristici di miliardari col pallino delle astronavi, e le potenze emergenti sempre più coinvolte nella faccenda), fa un po’ impressione andarsi a riguardare le idee, spesso poco note, che la NASA aveva esplorato negli anni sessanta per il cosiddetto «Apollo Application Program» (AAP), una possibili continuazione del programma Apollo.\nLa più incredibile, ancora oggi, è senza dubbio quella che prevedeva una missione umana verso Venere. Sì, avete letto bene. Venere è uno dei luoghi più ostili del sistema solare, con temperature superficiali di circa 500°C e pressioni di 90 atmosfere, simili a quelle che avreste nelle profondità degli oceani. Eppure, la NASA aveva seriamente preso in considerazione la possibilità di mandare un equipaggio umano in missione da quelle parti.\n\n**Tredici mesi nello spazio**\nNaturalmente, non si trattava di scendere sul pianeta, impresa che ancora oggi si rivela proibitiva persino per le sonde automatizzate (solo i sovietici, negli anni settanta, sono riusciti a farlo, ma le apparecchiature non hanno resistito a lungo nell’inferno venusiano).\nQuello che avevano in mente gli americani era spedire tre astronauti in orbita attorno a Venere. La navicella sarebbe stata in realtà una vera e propria stazione spaziale di una trentina di metri, dove l’equipaggio avrebbe dovuto trascorrere ben 13 mesi, di cui circa quattro necessari per raggiungere il pianeta. Arrivati là, il veicolo avrebbe sorvolato Venere (da una a tre volte, a seconda delle varianti proposte), avvicinandosi fino a circa 6200 chilometri, per poi riprendere immediatamente il viaggio di ritorno. Durante le orbite, gli astronauti avrebbero gestito una serie di sonde e strumenti per studiare da vicino la superficie e l’atmosfera venusiana.\nSembra fantascienza, ma il progetto era reale (si possono consultare i documenti, ormai pubblici, negli archivi NASA). C’era pure una data proposta per la partenza: il 31 ottobre del 1973\\. In realtà, come sappiamo, le cose sono andate in maniera molto diversa.\n\n**Una brutta fine**\n​​​​​​​Già nel 1968, ancora prima che Armstrong lasciasse la sua impronta sulla Luna, il budget della NASA fu ridotto drasticamente, e il programma Apollo si concluse nel 1972 con la missione Apollo 17\\. A ogni modo, anche se la disponibilità economica fosse stata maggiore, c’è da chiedersi se una missione del genere, complessa e rischiosa, e con pochi vantaggi rispetto a una missione automatizzata con obiettivi scientifici simili, avrebbe avuto l’approvazione del Congresso degli Stati Uniti. Delle molte idee esplorate per l’AAP (tra cui c’era anche l’immancabile missione umana verso Marte, immaginata per gli anni ottanta), solo la stazione spaziale Skylab venne effettivamente realizzata (fu occupata per appena 24 settimane, tra il 1973 e il 1974).\ncol senno di poi, comunque, possiamo dire che la mancata realizzazione dell’ambiziosa missione umana verso Venere fu provvidenziale. All’epoca non si sapeva ancora molto sui rischi dell’attività solare per le missioni umane. In particolare, la prima violenta emissione di particelle cariche di alta energia da parte del Sole (la cosiddetta «espulsione di massa coronale») fu osservata chiaramente solo nel 1971\\. Oggi sappiamo che ce ne sarebbe stata una nel luglio del 1974, proprio durante il viaggio di ritorno della proposta missione umana verso Venere. Se le cose fossero andate in questo modo, è molto probabile che gli astronauti a bordo della navicella, non protetti dal campo magnetico terrestre, avrebbero fatto una brutta fine.\n\n-\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 48,
			"title": "L'antenato fantasma",
			"date_published": 1554559576.696,
			"body": "### Il DNA degli individui di origine asiatica conserva l’impronta di una misteriosa forma umana estinta.\n\n* * *\n\nProviamo a costruirci un modello, almeno un modello orientale del tutto orientativo, altrimenti rischiamo di non capire più dove ci sta portando la paleogenetica. Mi sembra che la parola chiave che fa nascere al momento più confusione sia questa: «introgressione». In effetti, i dati che emergono dallo studio del nostro genoma, comparato con quello di alcune forme umane estinte (poche purtroppo), puntano il dito su ripetuti eventi di ibridazione, quindi di introgressione genetica, con passaggio di DNA, fra differenti specie umane nel Pleistocene.\n\n**Grazie all’intelligenza artificiale**\nL’ultima di queste analisi, pubblicata su «Nature Communications», è stata sviluppata in due centri di ricerca di Barcellona, IBE e CNAG-CRG, in collaborazione con l’Università di Tartu in Estonia. Per la prima volta in questo campo, lo studio usa tecniche di analisi di deep learning (sottoinsieme del machine learning), ovvero basate sull’intelligenza artificiale e sulle reti neurali, aprendo la strada alla loro applicazione in altri settori della biologia evoluzionistica. Nel combinare algoritmi di questo tipo con sofisticate procedure statistiche, i ricercatori hanno mostrato che il genoma di individui di origine asiatica conserva l’impronta di una qualche forma umana diversa da Homo sapiens che, decine di migliaia di anni fa, si sarebbe incrociata con gli antenati di popolazioni orientali della nostra specie.\nLa stessa analisi suggerirebbe che la misteriosa forma umana estinta sarebbe una creatura a sua volta ibrida fra Neanderthal e Denisoviani, simile a quella che (non senza clamore) era stata annunciata l’estate scorsa. L’adolescente di madre Neanderthal e padre denisoviano, con quest’ultimo che aveva anche qualche antenato fra i Neanderthal, non era dunque un caso isolato, sembrerebbe ribadire la nuova ricerca, ma faceva piuttosto parte di un quadro complesso di ripetute ibridazioni, con eventi diffusi di introgressione genetica.\nCome altra possibile interpretazione ci torna in mente una ricerca pubblicata su «Nature» nel 2014, dove si ipotizzava l’esistenza di un potential unknown hominin. I dati genetici indicavano uno sconosciuto rappresentante del genere Homo che si sarebbe ibridato con i Denisoviani; alcuni di noi pensarono alle ultime popolazioni di H. erectus del Sudest asiatico. A loro volta, i Denisoviani (probabilmente diffusi in larga parte dell’Asia continentale) da tempo si ibridavano con i Neanderthal, e lo avrebbero fatto anche con le popolazioni di H. sapiens in diffusione nel continente asiatico, come pure con loro si sarebbero ibridati i Neanderthal del Vicino Oriente. Le popolazioni asiatiche di oggi sarebbero detentrici del retaggio di tutte queste ibridazioni.\n\n**Un quadro complesso**\n​​​​​​​Altro che «scappatelle»! Gli ultimi rappresentanti del genere Homo si incrociavano spesso fra loro, pur appartenendo a specie differenti. E tutto questo appare in contrasto con il significato che diamo comunemente al concetto di specie. I manuali di biologia insegnano che uno dei modi per distinguere tra due specie è che, sebbene alcune possano incrociarsi, generalmente non producono discendenti fertili (pensate al mulo, ibrido sterile tra asino e cavalla).\nTutto però è molto più complesso quando sono coinvolte specie estinte, per le quali non dobbiamo sottovalutare la dimensione diacronica, con una variabilità che si estende anche nel tempo. Ed è così che le specie, tutt’altro che realtà immutabili, ci appaiono come combinazioni genetiche in continuo divenire. Tanto più le conosciamo, tanto più ci accorgiamo che le nostre regole sono soggette a numerose eccezioni.\nCe lo mostra bene proprio la paleoantropologia.\n\n-\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 47,
			"title": "Le vie del progresso scientifico",
			"date_published": 1554559432.564,
			"body": "### Il futuro della fisica delle particelle, sulla base dei risultati di LHC.\n\nTempo fa si era assistito a una riaccensione della discussione, non nuova e spesso mal impostata, sull’utilità o meno della filosofia della scienza per la scienza.\n\n* * *\n\nSenza ritornare sui dettagli della discussione, già trattata a sufficienza nelle rubriche di settembre e novembre 2016, vorrei qui illustrare con un esempio virtuoso come la riflessione filosofica possa risultare utile in alcuni frangenti significativi dello sviluppo dell’impresa scientifica. L’occasione è data dalla discussione che sta suscitando il progetto del CERN di costruzione di un nuovo acceleratore di particelle, il Future Circular Collider (FCC), molto più potente dell’attuale Large Hadron Collider (LHC).\nLa quantità di fondi in gioco è enorme e questo porta inevitabilmente alla domanda se sia giustificato spendere cifre sempre più imponenti in progetti di questo tipo della fisica delle particelle.\nÈ sensato, si chiedono alcuni, affrontare simili costi per proseguire le indagini nella fisica fondamentale – in particolare, cercare «nuova fisica» oltre ai limiti del modello standard delle particelle elementari – quando sul tappeto ci sono questioni urgenti come il cambiamento climatico, la fame nel mondo, malattie di cui ancora non si conosce la cura, e via dicendo?\n\nIl caso del passato\nLa situazione ricorda un po’, mutatis mutandis, quella che si è verificata qualche decennio fa con il caso del progetto di costruzione negli Stati Uniti, in Texas, dell’acceleratore noto come SSC (Superconducting Super Collider). All’epoca la discussione si incentrò soprattutto sul tema delle ricadute sociali ed economiche degli investimenti previsti (e in parte già stanziati), con il risultato che il progetto, proposto nel 1982, venne definitivamente bloccato nel 1993 con grandi danni sia economici sia scientifici.\nOggi, le critiche al progetto del FCC poggiano anche su un altro argomento: viene considerato sbagliato continuare a investire su una tipologia di ricerche che non avrebbero portato (alle energie raggiunte al LHC) all’osservazione di «nuova fisica», tra cui innanzitutto le particelle previste in base alla supersimmetria. In breve, non ci sarebbe stato sufficiente progresso per questa via, e quindi, si sostiene, è inutile proseguire: meglio cercare (e finanziare) altre strade.\nQuesto è per esempio il succo dell’’opinione espressa in un editoriale del 23 gennaio sul «New York Times» da Sabine Hossenfelder, non nuova a polemiche sulle direzioni prese dalla fisica fondamentale.\n\nUna visione semplicistica\nTra le diverse reazioni che stanno suscitando simili prese di posizione, risulta particolarmente efficace la riflessione More than prediction di Michela Massimi, filosofa della scienza presso l’Università di Edimburgo, apparsa il 30 gennaio scorso sul quotidiano tedesco «Frankfurter Allgemeine». Da filosofa, appunto, l’autrice mette in guardia contro una visione semplicistica del progresso scientifico, per cui, se non si avverano alcune delle predizioni dei modelli adottati, non solo questi vanno abbandonati ma anche l’intera impresa di cui fanno parte deve essere considerata fallimentare.\nCome la storia insegna, la scienza procede in diversi modi – anche con risultati negativi che permettono di restringere il campo degli scenari ammissibili, come l’articolo di Massimi mette bene in risalto – e con ricadute teoriche, sperimentali e tecnologiche di varia natura (in questo senso, le ricadute di LHC sono numerose). L’impresa scientifica è molto pi ricca e articolata di quanto una visione banalizzata possa far sembrare, e il metterlo in luce è senz’altro un’utile funzione di una riflessione filosofica, storicamente improntata, sulla scienza e il suo sviluppo.\n\n-\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 46,
			"title": "La fine del sesso e il futuro della riproduzione umana (Libro completo di Henry Greely, 2016)",
			"date_published": 1553722973.551,
			"body": "Nel prossimo futuro il sesso sarà obsoleto. Non ci accoppieremo più per riprodurci, ma solo per piacere o magari altro, che comunque non avrà alcun legame con la generazione di prole. Gli eredi, almeno chi li vorrà, saranno concepiti dall’inizio fin quasi alla fine al di fuori del corpo umano, e sarà possibile selezionarli su misura, con un semplice sequenziamento dei genomi degli embrioni candidati all’impianto in utero.\n\n* * *\n\nPotrebbe sembrare uno scenario da fantascienza, magari distopico per qualcuno, e invece è una prospettiva realistica, come spiega Henry Greely in _La fine del sesso._\nGià ora grazie alle tecniche di fecondazione in vitro è possibile aggirare il sesso procreativo, e grazie alla diagnosi genetica preimpianto è possibile cercare nel genoma di cellule di embrioni tratti genetici che indicano un rischio o una certezza per alcune condizioni. Ma tutto questo non è nulla a confronto del futuro tratteggiato dalle ricerche attuali in biologia dello sviluppo, genetica e medicina.\nDocente di legge e genetica alla Stanford University, dove dirige il Center for Law and the Biosciences, Greely ritiene che probabilmente nell’arco di venti o quarant’anni la riproduzione umana sperimenterà una rivoluzione con profondi risvolti etici, sociali e antropologici, ma del tutto legale. Potrebbe essere possibile per esempio ottenere spermatozoi e ovuli da cellule adulte degli individui. Basterà riprogrammare queste cellule con un apposito cocktail di proteine per riportarle allo stato di cellule staminali pluripotenti indotte, in grado di differenziarsi in qualunque tipo cellulare che compone un organismo umano, e poi indurre quelle staminali a differenziarsi in gameti, maschili o femminili a scelta. E magari ottenere gameti maschili da donne e femminili da uomini. In alcuni casi è già possibile arrivare a questi risultati, sebbene in modo non efficiente, ed è potenzialmente possibile in altri, grazie a ricerche pionieristiche dello scienziato giapponese Shinya Yamanaka, premio Nobel per la medicina nel 2012 proprio per la scoperta della staminali pluripotenti indotte.\n\nO, ancora, sarà possibile clonare esseri umani a scopo terapeutico, in parallelo con gli esperimenti che hanno portato alla clonazione della pecora Dolly alla fine degli anni novanta, trasferendo il DNA del nucleo di una cellula adulta nel nucleo di una cellula uovo in precedenza svuotato del proprio DNA. E coinvolgere in tutto questo le staminali prelevate da embrioni umani.\n\nAnche selezionare il corredo genetico del nascituro potrebbe essere addirittura più facile. Una decina di anni fa, ricorda l’autore, il sequenziamento di un intero genoma umano costava 500 milioni di dollari. Tre anni fa solo 1500 dollari. Nei prossimi venti o quarant’anni, potrebbe essere possibile sequenziare l’intero genoma di una singola cellula embrionale in modo accurato per una decina di dollari. appena. Questo, tuttavia, non implica di per sé una scelta deliberata delle caratteristiche del nascituro, soprattutto perché la correlazione tra geni e tratti non è sempre nota, e in alcuni casi è assai complessa, tanto da rendere assai difficile o di fatto impossibile una selezione. Almeno per ora.\n\nNel frattempo, Greely si porta avanti e nel libro esamina anche le implicazioni su sicurezza, rapporti famigliari, equità, giustizia e uguaglianza che potrebbero derivare da uno scenario del genere, e quale ruolo potrebbero o dovrebbero avere i decisori politici. Tenendo bene in mente però una delle principali lezioni della scienza: quello che è scientificamente possibile non sempre avviene come ce lo aspettiamo, dunque è bene non farsi trovare impreparati almeno dagli eventi che possiamo vedere all’orizzonte.\n\n-\n\n## Il libro completo sarà pubblicato suddiviso in vari capitoli e sarà disponibile COMPLETAMENTE GRATIS sul nuovo blog omonimo:\n\n## [http://127.0.0.1:43110/14VJDydxgxJkCC8SwP8wtNpX8aETk5VaRk/](http://127.0.0.1:43110/14VJDydxgxJkCC8SwP8wtNpX8aETk5VaRk/)"
		},
		{
			"post_id": 45,
			"title": "Una donna contro Fermat",
			"date_published": 1553722639.98,
			"body": "### La matematica francese Sophie Germain cercò di risolvere almeno parzialmente il teorema di Fermat.\n\n* * *\n\nMillenni prima di Pitagora, Egizi e Babilonesi conoscevano già quelle che in seguito vennero appunto chiamate terne pitagoriche: cioè le terne di numeri in cui la somma dei quadrati dei primi due (corrispondenti ai cateti di un triangolo rettangolo) è uguale al quadrato del terzo (corrispondente all’ipotenusa).\nL’esempio più noto e antico è dato dei numeri 3, 4 e 5, che esibiscono le tre proprietà caratteristiche dei numeri costituenti le terne pitagoriche: in ciascuna deve infatti esserci un numero divisibile per 3, uno divisibile per 4 e uno divisibile per 5, anche se non sempre capita che ad avere queste proprietà siano tre numeri distinti, come invece accade nell’esempio citato.\n\n### Estrarre l’essenziale\n\nNel 1825, Sophie Germain cercò di generalizzare queste proprietà a somme di potenze maggiori dei quadrati, nel tentativo di risolvere almeno parzialmente il famoso teorema di Fermat: l’affermazione, cioè, che non esistono terne di numeri in cui la somma dei cubi dei primi due è uguale al cubo del terzo, e analogamente per le quarte potenze, le quinte potenze, e così via.\nCercando di estrarre l’essenziale dall’esempio precedente, la matematica francese notò anzitutto che l’esponente 2 usato nelle terne pitagoriche è un numero primo: decise dunque di restringere la propria attenzione alle potenze prime. Una restrizione comunque non riduttiva, perchè Fermat stesso aveva dimostrato il caso delle quarte potenze, e ogni potenza maggiore di 2 è divisibile per 4 o per un numero primo (o entrambi).\nLa Germain notò inoltre che 5 è un numero primo “parente” di 2, nel senso che è il successore del suo doppio. Le venne in mente allora di definire quelli che oggi si chiamano “numeri primi di Germain”, come quei numeri primi che hanno appunto un tale parente primo.\nDetto altrimenti, p è un primo di Germain se sono primi sia p che 2p+1.\nDi tali numeri primi ce ne sono parecchi, a partire da 2, 3, 5, 11, 23, 29, 41, 53, 83 e 89, ma non ce ne sono troppi. Per esempio, di numeri primi minori di 100 ce ne sono 25, ma solo i 10 appena enumerati sono primi di Germain. E in generale i numeri primi decrescono come il logaritmo, mentre i numeri primi di Germain decrescono come il quadrato del logaritmo.\nIl teorema che Germain dimostrò nel 1825 fu che, come in ogni terna pitagorica di quadrati devono esserci un numero divisibile per 4 e uno per 5, così in ogni analoga terna di potenze di un primo di Germain devono esserci un numero divisibile per p2 e uno per 2p+1.\nPer applicare il risultato al teorema di Fermat, servivano due passi ulteriori: generalizzare la parentela di un numero primo da uno a più parenti con proprietà analoghe a quelle sopra, e dimostrare almeno per qualche numero primo p l’esistenza di infiniti suoi parenti. Allora, almeno uno dei numeri di una terna di potenze di p avrebbe dovuto avere infiniti divisori, e questa contraddizione avrebbe dimostrato il teorema di Fermat per l’esponente p.\n\n### La prima vera matematica\n\nLeonard Dickson dimostrò nel 1909 che non esistono numeri primi che hanno un’infinità di parenti, dunque non si può dimostrare nessun caso particolare del teorema di Fermat alla maniera di Germain. Ma mostrò che era possibile un attacco in grande al problema, e iniziò un percorso che sarebbe sfociato nella dimostrazione di Adam Wiles nel 1995.\nIl teorema di Fermat rende vuoto il teorema di Germain, ma il suo lavoro non è andato perduto. Oggi i suoi primi sono infatti diventati uno strumento fondamentale per la crittografia, e ne discute addirittura Gwyneth Paltrow nel film Proof (2005), in un ruolo in parte ispirato a quella che fu la prima vera matematica della storia.\n\n-\n\nAutore: Piergiorgio Odifreddi, professore ordinario di logica matematica all’Università di Torino e visiting professor alla Cornell University di Ithaca (New York).\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 44,
			"title": "Una soluzione innovativa per l’adeguamento sismico",
			"date_published": 1553719980.779,
			"body": "### Un dispositivo antisismico da installare sui tetti degli edifici potrà garantire un monitoraggio costante e intervenire in caso di terremoto.\n\n* * *\n\nUn’immagine tragica, quella del campanile di Amatrice che svetta intatto mentre tutto intorno il paese è ridotto in macerie. È il 24 agosto 2016 e quell’immagine fa il giro dell’Italia e del mondo. Arriva anche a Milano, in casa di Alberto Bussini, giovane studente del Dipartimento di meccanica del Politecnico di Milano, che ne parla con il suo professore Francesco Ripamonti. La domanda che si pongono i due ingegneri è: «Perchè tutte le case e gli edifici intorno, anche più bassi, erano crollati mentre il campanile aveva resistito alle scosse che si erano susseguite in maniera devastante?».\nQualcuno in quelle ore aveva avanzato la teoria secondo cui le costruzioni antiche avessero una migliore tenuta sismica, ma la ragione della tenuta è nel comportamento dinamico del campanile, diverso da quello di tutti gli altri edifici intorno. «Quell’immagine ha fatto scattare in noi la lampadina: dovevamo studiare la dinamica di quella struttura e, partendo da lì, trovare una soluzione innovativa per l’adeguamento sismico degli edifici già costruiti», racconta Bussini. Il giovane si mette all’opera e fa di questo l’argomento della sua ricerca e della sua tesi di dottorato.​​​​​​​\n\n### In rampa di lancio\n\nDopo due anni la soluzione è pronta, almeno a livello sperimentale, e con essa anche una serie di algoritmi in grado di analizzare lo stato di un edificio in maniera economica e non invasiva. A gennaio 2018 è stata costituita una start-up che, grazie a investimenti personali e al know-how del Politecnico di Milano, è titolare di un brevetto e ha iniziato a partecipare alle competizioni per le aziende innovative. Si chiama ISAAC, acronimo di Identification Smart for Adaptive Active Controll. «Vincendo alcune competizioni abbiamo potuto finanziare il lavoro per arrivare al prototipo in scala del nostro dispositivo», continua Bussini.\n«L’apparecchio reale sarà un parallelepipedo di 30 centimetri di altezza per tre metri di lunghezza da posizionare nel solaio o sul tetto dell’edificio. Al suo interno ci sono una massa inerziale di 500 chilogrammi e attuatori ad altissima prestazione che, in caso di terremoto, faranno oscillare la massa con un moto armonico in modo da contrastare l’oscillazione dell’edificio, riuscendo di fatto ad annullarla». L’idea non è nuova: in Stati Uniti e Giappone questa tecnologia è usata per i grattacieli, ma il dispositivo ISAAC-AMD è molto più leggero dei suoi concorrenti pur garantendo la stessa efficacia: a fare la differenza sono gli attuatori, che fanno raggiungere grandi accelerazioni alla massa. In più, il sistema si calibra da solo, a seconda del tipo e delle condizioni dell’edificio in cui è installato.\nIl prototipo è stato realizzato e le prime prove sul campo hanno dato risultati che sono andati oltre le aspettative, tanto che oggi ISAAC ha contatti con aziende di gestione immobiliare e di infrastrutture. Per arrivare al prodotto pronto per il mercato, però, si dovrà aspettare fino al 2021\\. ma il giovane ricercatore-imprenditore, che oggi ha 25 anni, ha già la soluzione per colmare il tempo che lo separa dalla vendita del dispositivo, cercando di farsi conoscere e contemporaneamente mettere soldi in cassa per proseguire con il processo di industrializzazione: vendere servizi.\n«I nostri algoritmi sono in grado di fare analisi dinamiche delle strutture e già l’anno prossimo potremo offrire ai nostri clienti un prodotto che esegue l’analisi di vulnerabilità sismica in maniera efficace ed economica», continua Bussini. In poche parole, grazie a specifici programmi, gli ingegneri di ISAAC possono capire se un edificio è a rischio e possono individuare i punti di fragilità delle strutture e quindi suggerire interventi di manutenzione mirata.\n«Le tecnologie tradizionali sono piuttosto invasive, richiedono per esempio l’esecuzione di carotaggi: gli edifici vanno sgomberati mentre le infrastrutture devono essere chiuse», spiega l’ingegnere. Con evidenti disagi per la collettività e danni per i gestori che devono interrompere il servizio. In realtà la start-up ha già ricevuto richieste di intervento e sta lavorando, per esempio, con studi di progettazione che partecipano a gare e inseriscono nei loro progetti l’analisi di vulnerabilità a costo ridotto su edifici già esistenti.\nIl secondo prodotto che la start-up lancerà sarà sempre un programma, ma questa volta capace di condurre un monitoraggio dinamico continuo delle strutture in modo da individuare i processi che potrebbero portare danni. Una specie di strumento diagnostico per la prevenzione che, in caso di terremoto, potrebbe accertare in tempo reale se un edificio è agibile o meno, se è a rischio crolli.\nI due prodotti in rampa di lancio possono essere applicati a tutte le costruzioni, in muratura e in cemento armato, aprendo a ISAAC anche il mercato della protezione del patrimonio culturale. «Nell’ambito di un programma promosso dalla Fondazione Pesenti abbiamo presentato il nostro prodotto attirando l’attenzione della rappresentante della Protezione Civile presente nel pubblico», racconta Bussini. «È evidente che i nostri sistemi sarebbero di fondamentale aiuto per il personale che deve agire durante le emergenze e permetterebbero di avere un’idea chiara di quali strutture si possono usare e quali no». La strategia quindi prevede di aggredire il mercato con l’offerta di servizi per stabilire la vulnerabilità delle strutture per poi arrivare, fra due anni, a poter proporre anche il dispositivo.\n«Allo stato attuale delle nostre ricerche può essere usato solo per edifici in cemento armato e acciaio, circa il 37 per cento di tutti gli immobili italiani, specialmente quelli costruiti dagli anni sessanta fino agli anni ottanta, quando sono entrate in vigore le prime norme antisismiche», conclude l’ingegnere. Inutile sottolineare come, anche molte strutture edificate dopo quella data non siano a norma.\nCome testimoniano tragicamente le immagini dei centri abitati che hanno subito dei terremoti.\n\n-\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 43,
			"title": "Affrontare le sfide attuali con la testa di un fisico",
			"date_published": 1553707097.974,
			"body": "### Secondo il Nobel Anthony Leggett la fisica può essere un modello di rigore per le discussioni che riguardano questioni politiche e sociali.\n\n* * *\n\nHa oltre ottant’anni, un Nobel e innumerevoli lavori al suo attivo, ma Anthony Leggett non si ferma. Dopo gli studi sulla superfluidità che gli sono valsi il premio di Stoccolma nel 2003, ora si dedica soprattutto alla meccanica quantistica e alle sue applicazioni macroscopiche. Così, nel suo ultimo viaggio fra tre continenti, una tappa l’ha fatta a Napoli. Alla Città della Scienza, per riflettere su come la fisica può portare più rigore nel modo in cui affrontiamo le sfide sociali, nell’evento “Verso la comunità del millennio”, organizzato su idea di Paolo Silvestrini dell’Università della Campania, con la partecipazione di scienziati, umanisti, artisti. E all’Università degli Studi di Napoli «Federico II», per inaugurare il nuovo dottorato in tecnologie quantistiche, centrato sulle competenze interdisciplinari per sviluppare dispositivi e tecnologie, e coordinato da Francesco Tafuri, professore alla stessa università.\nIntervista a Anthony Leggett.\n\n**Non le sembra esagerato proporre la fisica come modello di rigore per le sfide sociali?**\nNon penso certo che la fisica sia la principale disciplina che può aiutare in queste sfide, anzi, altre lo fanno più direttamente. Ma penso che la pratica della fisica, ben fatta, può essere un utile modello per le discussioni delle questioni politiche e sociali. Perché è una disciplina di un rigore spietato: se sbagli qualcosa, in genere sei scoperto presto. E perché è una disciplina molto quantitativa, in cui per esempio devi continuamente stimare gli ordini di grandezza dei fenomeni. Cosa che manca in molti dibattiti sociali.\nPrenda la paura delle radiazioni, anche in dosi minime, quasi innocue. A Fukushima, si stima che le evacuazioni da una vasta area intorno alla centrale abbiano causato dai 500 ai 2000 morti, per esempio per i suicidi di chi ha dovuto abbandonare tutto. Mentre il livello delle radiazioni poneva un rischio basso, anche passandoci tutta la vita.\n\n**E in pratica, la fisica come aiuterebbe?** Per fare un esempio, penso che sarebbe molto utile abituare i giovani a queste stime degli ordini di grandezza, insegnandole come materia di studio alle scuole superiori. Negli Stati Uniti pochi anni fa si è dibattuto se insegnare l’algebra alle superiori, tra chi si opponeva perché non ha scopi pratici, e chi riteneva importante che tutti gli studenti si cimentino con il ragionamento matematico puro. Io sono contento che l’algebra sia insegnata. Ma si potrebbe ottenere benefici formativi analoghi facendo studiare argomenti statistici su questioni concrete di interesse generale, che abbinerebbero l’utilità intellettuale a quella pratica.\n\n**Il pubblico se pensa alla fisica pensa al CERN o alla cosmologia, ma ci sono campi meno famosi altrettanto importanti?**\nSenz’altro. Ovviamente è affascinante l’idea che puoi sbucciare la materia come una cipolla per arrivare al cuore, su scale sempre più piccole. Ma trovo altrettanto affascinante vedere cosa succede quando metti insieme tante particelle elementari e queste producono fenomeni nuovi, mostrano proprietà qualitativamente diverse, che non potevi immaginare ragionando al livello delle singole particelle (le cosiddette proprietà emergenti, un termine che a me non piace ma è molto usato). E quest’ultimo è un ambito molto rilevante: forse l’80 per cento dei fisici lavora in quest’area, detta della materia condensata, a scopi applicativi ma anche con moltissima ricerca di base.\n\n**Lei ha anche criticato la corsa all’interdisciplinarità, che pure è alla base del dottorato che inaugura.**\nSono del tutto a favore dell’interdisciplinarità quando serve. Solo, non è una virtù in sé. Non mi piace la pratica, comune in Nord America, di condizionare i grant alla cosiddetta interdisciplinarità del progetto: non c’è niente di male nel lavorare a un problema che non richiede grandi apporti di altre discipline, per esempio in fisica delle particelle. Quando poi un problema richiede il contributo di più discipline, come la superconduttività ad alte temperature, il coinvolgere anche chimici, ingegneri e così via viene da sé. Non perché lo impone un’agenzia governativa.\n\n**È stata una sorpresa trovare effetti quantistici misurabili a livello macroscopico, nella vita reale?**\nLe racconto un episodio. Nei primi anni novanta curavo una sezione di «Physical Review Letters». Un giorno abbiamo ricevuto un lavoro da un paio di autori che non conoscevo di un istituto britannico, su un teorema molto astratto della meccanica quantistica, e lo ho avviato alla valutazione. Ma poco dopo, la rivista ha ricevuto una lettera molto imbarazzata degli autori, che temevano di doverlo ritirare perché i loro superiori volevano classificarlo come segreto di interesse militare. Io non potevo crederci: come poteva una teoria tanto astratta avere un valore militare? Alla fine hanno permesso di pubblicarlo, ma ero scocciato che l’idea fosse stata anche solo presa in considerazione.\n\n**E oggi?**\nOggi tutto questo non pare più strano. Alcuni aspetti della cosiddetta rivoluzione dell’informatica quantistica (le tecniche di elaborazione dati basate sulla meccanica quantistica) trovano impieghi pratici. Per esempio la crittografia quantistica, già usata in esperimenti dimostrativi per trasferire dati in sicurezza. Alcuni giornalisti ipotizzano che sia già in uso nelle comunicazioni di massima sicurezza del governo statunitense, per esempio tra Casa Bianca e Pentagono.\n\n**Lei ci crede?**\nBeh, in principio non lo trovo impossibile.\n\n**Ci sono altri usi?**\nUn’altra applicazione vicino è la cosiddetta «ricottura quantistica», che permetterebbe di risolvere problemi ostici per i computer ordinari. Per esempio, se devo fare un viaggio in tante tappe, qual’è il percorso che minimizza gli spostamenti? Se le tappe sono anche solo una dozzina, diventa molto complicato calcolarlo con i metodi classici, mentre sfruttando algoritmi basati sui principi quantistici il problema è molto più affrontabile. La società canadese D-Wave sostiene di avere già una macchina che lo fa, battendo un computer classico, anche se non hanno pubblicato prove. La mia impressione è che non ci siano arrivati appieno, ma che siano vicini.\n\n**In che tempi saranno realtà computer quantistici di uso concreto?** Penso che uno di uso generale, che fa tutto quello che fanno i computer ordinari, sia lontano decenni, ma uno per usi specifici, per risolvere una determinata classe di problemi, potrebbe superare i computer classici già fra dieci anni.\n\n-\n\n_Chi è **Anthony James Leggett**_\nSi è laureato in fisica all’Università di Oxford, dove ha seguito anche studi umanistici. Dopo aver lavorato in varie università, tra cui Oxford e Cornell, dal 19983 è professore di fisica all’Università dell’Illinois a Urbana-Champaign. Nel 2003 ha ricevuto il Nobel per la fisica per studi sulla superfluidità nell’elio liquido, utili anche in fisica delle particelle e cosmologia.\nÈ membro, tra l’altro, della National Academy of Sciences, della Amercian Philosophical Society.\nÈ stato un precursore nel campo delle tecnologie quantistiche, studiando conseguenze macroscopiche di fenomeni quantistici e l’uso dei sistemi condensati per indagare i fondamenti della meccanica quantistica.\n\n-\n\n* * *\n\nFonte: Le Scienze (n. 607, marzo 2019)"
		},
		{
			"post_id": 41,
			"title": "La storia dei nostri fratelli estinti",
			"date_published": 1553460250.353,
			"body": "### Recensione del libro “Mio caro Neanderthal” di Silvana Condemi e François Savatier\n\nPoco più di 40.000 anni fa, un gruppo di migranti giunse in Europa provenendo dall’Africa. I nuovi arrivati iniziarono lentamente a conquistare territori, assimilando via via la popolazione che da 300.000 anni viveva in quella regione del mondo. Fu questa, a grandi linee, la dinamica che creò la fine dei Neanderthal europei a opera di un gruppo di nostri antenati Homo sapiens che si insediarono in pianta stabile nel Vecchio Continente.\n\n* * *\n\nPer decine di migliaia di anni dopo la loro scomparsa, avvenuta intorno a 38.000-35.000 anni fa, il ricordo degli uomini e delle donne di Neanderthal cadde nell’oblio. Poi, nel 1856, in una valle della Germania vennero alla luce resti fossilizzati inizialmente scambiati per quelli di un orso delle caverne. Erano invece fossili di una specie umana, a cui negli anni successivi alla scoperta fu dato il nome di Homo neanderthalensis (dal nome della valle dove erano stati trovati i fossili).\nPer lungo tempo questo ominide è stato considerato come un «uomo delle caverne», un nostro lontano parente rozzo da cui noi ci saremmo allontanati per dare vita a una stirpe più raffinata, anche nelle fattezze. La ricerca scientifica però ha stravolto questo ritratto di H. neanderthalensis, il quale non era affatto un bruto; quanto alla parentela, poi, i risultati più recenti degli studi sono stupefacenti, come raccontano Silvana Condemi, direttrice di ricerca al CNRS presso l’Università di Aix-Marseille, in Francia, e il giornalista scientifico François Savatier in “Mio caro Neanderthal”.\nTutte le popolazioni umane che vivono oggi in Europa e in Asia hanno DNA neanderthaliano, in una percentuale che varia tra l’1 e il 4 per cento del DNA totale. Questa eredità è frutto di incroci avvenuti a partire da 100.000 anni fa in Medio Oriente tra le popolazioni di H. sapiens che iniziavano a uscire dall’Africa e quelle di H. neanderthalensis incrociate lungo la via. Non è solo una testimonianza fossile; il DNA dei Neanderthal è stato ed è utile ancora oggi per una serie di funzioni che ci permettono, per esempio, di affrontare microrganismi patogeni che i nostri antenati in arrivo dall’Africa incontravano per la prima volta in Eurasia.\nSeguendo un percorso tra le conoscenze accumulate dalla ricerca scientifica studiando H. neanderthalesnis, il libro distrugge anche il mito del cavernicolo. I neanderthaliani, dispersi tra Europa, Asia settentrionale e Medio Oriente, parlavano, cacciavano, vivevano in clan, seppellivano i morti, curavano gli infermi, fabbricavano strumenti litici, si vestivano e avevano un pensiero simbolico. Ecco perché sarebbe corretto chiamarli «fratelli» (come fanno per tutto il libro gli autori).\nSono parenti stretti che vivono ancora in noi."
		},
		{
			"post_id": 40,
			"title": "Una nuova anomalia da disinnescare",
			"date_published": 1553459992.296,
			"body": "### Oggi come nella guerra fredda è necessario agire per contrastare la minaccia delle armi nucleari\n\nDue minuti alla mezzanotte. Anche nel 2018, come un anno prima, il Doomsday Clock, l’orologio dell’Apocalisse, è fermo a un passo dalla catastrofe.\n\n* * *\n\nIl «Bulletin of the Atomic Scientists», che lo aggiorna dal 1947, l’ha definita una «nuova anomalia», anche perché è la prima volta che l’orologio si trova per due volte così vicino all’ora fatidica. L’unica altra occasione in cui fu fissato a due minuti era il 1953, in piena guerra fredda, quando gli Stati Uniti hanno sperimentato la bomba all’idrogeno.\nE tanto basterebbe per capire fino a che punto gli scienziati del «Bulletin» siano preoccupati per lo stato del pianeta. Come nel 2017, una fonte di seria apprensione è l’approccio disinvolto di molti paesi, per usare un eufemismo, alla mitigazione del cambiamento climatico. Dopo anni di piccole ma significative riduzioni, le emissioni di gas serra hanno ricominciato ad aumentare, nonostante l’accordo sul clima di Parigi, o forse proprio per la sua debolezza.\nMa nel comunicato di inizio anno torna a farsi viva la minaccia nucleare, dopo i test del 2017 della Corea del Nord e le schermaglie di inizio 2018 tra Trump e Kim Jong-un (che si sono incontrati ad Hanoi mentre questo numero della rivista andava in stampa). Ma non solo. Gli Stati Uniti hanno abbandonato l’accordo nucleare con l’Iran, e hanno annunciato che si ritireranno dall’Intermediate-range Nuclear Forces Treaty (INF): «Gravi passi verso un completo smantellamento del processo di controllo globale degli armamenti». E, nonostante l’apparente distensione dei rapporti tra Stati Uniti e Corea del Nord, la questione delle testate nucleari coreane e dei test missilistici rimane irrisolta.\nInfine, i paesi definiti «nucleari» dal Trattato di non proliferazione stanno procedendo con programmi di modernizzazione degli arsenali che – sempre secondo il «Bulletin» - «sono indistinguibili da una corsa mondiale agli armamenti». E le dottrine militari di Russia e Stati Uniti hanno via via più eroso il tabù contro l’impiego di armi atomiche «mentre il processo per negoziare la riduzione delle testate nucleari e delle scorte di materiale fissile è moribondo».\nMoribondo. Ma allora chi ce lo fa fare di parlare di disarmo nucleare? In realtà, la ripresa di quel processo avrebbe due effetti positivi per tutti. Al di là di un evidente miglioramento della sicurezza planetaria, lo smantellamento delle testate atomiche potrebbe fornire combustibile per le centrali nucleari per la produzione di elettricità, come raccontano Flavio Parozzi e Franco Polidoro a pagina 30.\nSecondo una stima della Federation of Atomic Scientists, sono quasi 15.000 le testate totali negli arsenali militari, ma 5000 sono testate già dismesse da smantellare. A queste si aggiungono le riserve di uranio altamente arricchito e di plutonio, sufficienti per realizzare 100.000 nuove testate, da cui si potrebbero ricavare circa 1250 tonnellate di materiale fissibile. «Un buon esempio di percorsi fatti – scrivono gli autori – è stato dato dall’accordo Megatons to Megawatts tra Stati Uniti e Russia, con cui nel periodo 1993-2013 sono state convertite in combustibile per le centrali di generazione elettrica 20.000 testate nucleari».\nForse non è la stagione più favorevole per parlare di disarmo nucleare, con i leader del mondo che non fanno che mettere in mostra bicipiti.\nMa questa non è una buona ragione per non farlo, anzi."
		},
		{
			"post_id": 39,
			"title": "Se il cittadino diventa un nemico da combattere",
			"date_published": 1552818396.743,
			"body": "### Dietro a vicende come quella di Cucchi ci sono forze di polizia formate per affrontare scenari di guerra più che per la gestione della sicurezza pubblica. Il modello sono i soldati dei corpi speciali: non empatici, non riflessivi, obbedienti.\n\n* * *\n\nCharlie Barnao, insegna Sociologia della sopravvivenza a Catanzaro, studia le marginalità estreme urbane (persone senza dimora, prostituzione) e ha una lunga consuetudine con le tematiche degli abusi in divisa o della formazione di personalità autoritarie o fascistoidi, per usare le parole di Adorno, attraverso l’addestramento militare. Un filone di studi che Barnao ha imboccato dopo l’esperienza della leva nei parà, nella Folgore. Storie come quella di Stefano Cucchi gli fanno venire in mente «immediatamente il tema dell’addestramento militare» che Barnao collega «immediatamente a vicende come quelle accadute nelle prigioni di Abu Ghraib e Bagram, nella caserma di Bolzaneto, e ai civili torturati da parte dei soldati italiani in Somalia. E, ancora, dice: «Penso a due militari siracusani tutti e due: Emanuele Scieri, un caso del 1999 riaperto di recente, e Tony Drago, caporale 25enne, che, come Scieri, venne trovato morto nel 2014 dopo essere precipitato da una palazzina nella caserma di Roma dei Lancieri di Montebello. Le analogie sono tantissime, per entrambi la prima ipotesi fu quella del suicidio ma poi, tra mille incongruenze, le famiglie tentano disperatamente di far riaprire il caso. Come per Scieri l’ipotesi della difesa è quella del pestaggio mentre faceva le “pompate”».\nBarnao ricorda come il caso Scieri fosse stato cavalcato, a suo tempo, da chi stava conducendo il processo di professionalizzazione delle forze armate con l’abolizione della leva obbligatoria: «Rileggendo i resoconti della commissione parlamentare, il nonnismo veniva associato al servizio militare di leva e la creazione di un esercito di professionisti veniva “venduta” come la soluzione per superare il nonnismo. Il caso di Tony Drago rivela, invece, che quei rituali sono ancora in voga. Drago era uno delle migliaia di ragazzi del Sud che era partito come Vfp 1 (volontario in forma prefissata di un anno nell’esercito, ndr) per poter fare il poliziotto». Con l’eccezione di una finestra biennale, che verrà chiusa a dicembre, il reclutamento nei corpi di polizia e carabinieri richiede proprio il passaggio in un’esperienza militare, chi opera in ordine pubblico s’è fatto le ossa nei teatri di guerra. Per Barnao è un dettaglio cruciale: «È un processo di militarizzazione che in sociologia viene definito della “doppia conversione”». Il sociologo si riferisce all’ «amalgama di funzioni militari e di polizia» di cui hanno scritto Salvatore Palidda o Alessandro Del Lago. L’esercito che scende in ordine pubblico, si pensi all’Operazione Strade Sicure, e, contemporaneamente la guerra che diventa un’ «un’operazione di polizia internazionale».\n«E il tipo di addestramento è lo stesso, è di questo che mi occupo». La tesi di Barnao è che questi episodi che in genere vengono ricollegati alle “mele marce” siano strettamente correlati al tipo di addestramento che viene impartito. «Questo in tutto il mondo», puntualizza Barbao che sta per pubblicare i primi risultati di una ricerca su manuali di addestramento e manuali sulla tortura. Esistono manuali che insegnano la tortura? «Uno di questi, il più famoso, è il “Kubark counterintelligence interrogation” con il quale la CIA addestrava i suoi agenti alle tecniche dure di interrogatorio coercitivo che, nel tempo, sarebbero state dichiarate tortura». La parola Kubark è un criptonimo con cui la Cia designava se stessa. Elaborato nel 1963, sarebbe stato desecretato nel 1997 ma intanto era stato la base per una cospicua manualistica.\n«Dal 2001 assistiamo a un cambio di paradigma – riprende Barnao -. Con la guerra globale, anche da un punto di vista legale, gli Usa hanno cambiato la denominazione del nemico, da combattente a terrorista, per eludere i vincoli della Convenzione di Ginevra sui prigionieri di guerra. In questi manuali si spiegano le tecniche e le tre fasi della tortura: l’azzeramento della personalità con la perdita di ogni punto di riferimento, la seconda fase in cui si negozia l’informazione, la tortura è una serie di azioni razionali per ottenere informazioni, infine l’aggregazione o la riprogrammazione. Fasi della tortura, modello psicologico comportamentista, dinamiche interazionali fra torturato e torturatore corrispondono perfettamente alle fasi dell’addestramento, al modello psicologico e all’interazione fra addestratore e recluta. E ho scoperto che chi scrive i manuali di addestramento scrive anche i manuali per gli “interrogatori coercitivi”. Anche Naomi Klein ha usato la metafora della tortura nel suo Shock Economy».\nBarao spiega ancora che tutti i corpi speciali del mondo sottopongono gli uomini a un corso di sopravvivenza, il programma Sere (Survival, Evasion, Resistance and Escape). Per comprendere le ragioni storiche bisogna ricordare come la guerriglia dei Vietcong mise in crisi la tecnowar dello Zio Sam, il modello che era uscito dalla seconda guerra mondiale. Gli Usa, dopo che il 30 per cento dei marines tornò con un disturbo da stress post traumatico, presero a mettere in atto la cosiddetta “guerra sporca” «e misero a punto un tipo di addestramento che puntava a blindare la mente del soldato», spiega sempre Barnao, autore, con Pietro Saitta nel 2013 di “Costruire guerrieri. Autoritarismo e personalità fasciste nelle forze armate italiane”, contenuto nel volume collettivo “La violenza normalizzata”. Si afferma da allora un modello di soldato «non empatico, non riflessivo, che non fraternizza col nemico, obbediente. E resistente alla tortura. Sere parte proprio per questo, negli anni 50\\. e come si insegna quella “resistenza”? Torturandoli. Anche i “nostri” ragazzi. Il soldato ideale è quello dei corpi speciali e tutti si ispirano a questo modello».\nE Cucchi, Aldrovandi, e tutti gli altri cosa c’entrano con questo modello? «Sono “danni collaterali” per chi applica queste dottrine. Non dovrebbe essere così. Inoltre questo modello non funziona, lo stiamo verificando proprio intervistando i soldati che tornano dalle missioni. Il comportamentismo, come pure il condizionamento operante, è inadeguato di fronte a tutte le variabili della “guerra sporca” o della gestione dell’ordine pubblico».\nCambiare modello di addestramento allora, anche perché nei territori esplorati da Barnao non c’è spazio per le retoriche sulla democratizzazione delle polizie o sulla polizia di prossimità. Il sociologo non ha dubbi: bisogna passare da un modello «rapido ed economico a un approccio umanistico, in cui l’empatia sia un punto centrale, in cui l’altro da me sia un soggetto, non più un oggetto».\n\n-\n\n_Questo articolo si basa su articoli precedenti pubblicati nell'ottobre 2018_"
		},
		{
			"post_id": 38,
			"title": "Il proibizionismo uccide. Lo Stato non sia più complice delle narcomafie",
			"date_published": 1552672832.361,
			"body": "Tutto cominciò da quelle foto del corpo martoriato di Stefano Cucchi. «Non avete avuto paura a mostrare come era stato ridotto Stefano» disse Marco pannella ai familiari, e in particolare a Ilaria, all’indomani di quella conferenza stampa scandalo del 29 ottobre 2009, organizzata dal Comitato presieduto da Luigi Manconi. Senza quelle foto - «e la prudenza che avete usato nel mostrarle», disse Pannella – non saremmo mai riusciti a conoscere quel che Stefano ha voluto fare e comunicare in quei giorni tremendi che precedettero la sua morte.\n\n* * *\n\nMarco leggeva in quell’ultimo scorcio di vita di Stefano l’essenza di un comportamento “radicale”, esemplare. Gli era capitato in quei giorni di parlare con un giovane tassinaro romano che era stato compagno di palestra di Stefano e che gli aveva riferito che Stefano parlava spesso di lui, Pannella, e della battaglia radicale per la legalizzazione degli stupefacenti, con la quale concordava pienamente. «Stefano si è comportato come il più esperto di noi», diceva Pannella, ne rispondere alla violenza dello Stato con la nonviolenza del rifiuto di cibo e acqua quando gli fu negato il suo sacrosanto diritto di parlare con un avvocato. Questo suo volere e “dover essere” sono stati nutrimento e hanno avuto moltissimo a che fare con tutto ciò che si è verificato in questi lunghi nove anni, fino ai giorni nostri, che sono quelli dell’ “ammissione shock” da parte di uno dei carabinieri del brutale pestaggio cui fu vittima Stefano. Se ci siamo arrivati è grazie al coraggio, alla fermezza e all’amore della famiglia e dei tanti che l’hanno sostenuta, alla straordinaria capacità comunicativa e alla tenuta della sorella Ilaria, alla professionalità e umanità dell’avvocato Fabio Anselmo. E a Stefano, che in quelle ore tremende ha saputo agire e reagire di fronte a chi gli negava il dovuto per legge, cioè poter parlare con il suo avvocato. Quelli appena passati sono i giorni che né Stefano né Marco hanno potuto vedere, giorni che stanno restituendo verità e conoscenza ad una storia ignobile di regime che avrebbe dovuto rimanere sepolta sotto una coltre indicibile di disonorevoli omertà, complicità, insensibilità, prepotenze, volgarità che hanno coinvolto una piccola minoranza – ma compatta come una falange – di appartenenti alle forze armate, custodi, magistrati, sanitari, periti e uomini politici stile Giovanardi o Salvini. La relazione della Direzione nazionale antimafia, presentata al Parlamento il 31 luglio scorso, afferma che quello ddella cannabis, cioè la sostanza stupefacente “illegale” usata da Stefano e da almeno altre 4 milioni di persone in Italia, è un mercato in continua espansione nel mondo (e in Italia) e che «le azioni di contrasto che, fino ad ora, sono state svolte, nonostante i migliori propositi e gli sforzi più intensi, non hanno determinato, non solo, una scomparsa del fenomeno (che per quanto auspicabile appare obbiettivamente irrealizzabile), non solo un suo ridimensionamento, ma neppure un suo contenimento». Attraverso la repressione è dunque impossibile – e ce lo dice un’autorevole fonte come la Dna – non solo debellare il fenomeno o ridimensionarlo, ma neppure contenerlo. Questo vuol dire che inutilmente, e per di più distogliendo ingentissime forze e risorse che potrebbero proficuamente essere destinate in altre direzioni, più di diecimila persone (per cannabis, sono state esattamente 12.137 nel 2017) finiranno ogni anno nelle caserme e/o in carcere, cioè in luoghi oscuri, difficilmente controllabili per come sono concepiti e organizzati oggi in Italia, soprattutto se a finirci sono cittadini “normali”, che svolgono una vita “normale”, come era la vita di Stefano, sebbene fosse consumatore di sostanze illecite come i derivati della cannabis; sostanze vietate dalla legislazione proibizionista che ben si guarda, e meno male, di inibire l’uso e l’abuso di alcool e tabacco che – sia detto per inciso – ogni anno provocano quasi centomila morti solo nel nostro Pese. La morte di Stefano non è stata causata dalle sostanze di cui faceva uso, ma dal frutto bacato della repressione proibizionista che della regolamentazione (legalizzazione) di un fenomeno di massa non vuol nemmeno sentir parlare, scegliendo così di far prosperare e proliferare le narcomafie, consegnando loro il monopolio della produzione e del commercio e conferendo a spregiudicati cartelli criminali l’immenso potere corruttivo dell’economia legale e del tessuto democratico, civili e sociale di ogni Paese."
		},
		{
			"post_id": 37,
			"title": "La “cella zero” delle carceri disumane",
			"date_published": 1552507346.37,
			"body": "A Poggioreale per decenni è esistito un luogo del terrore dove i detenuti venivano picchiati. Pratiche illegali che hanno preso piede anche in altri penitenziari, come dimostrano gli esposti dei Garanti dei detenuti del Lazio e del Piemonte.\n\n* * *\n\n«Solo una lampada accesa. Tutt’intorno il nulla, solo quattro mura sporche di sangue e muffa. All’inizio c’era un cappio appeso. Era l’illuminazione del terrore. Centinaia e centinaia di detenuti ci sono passati». Pietro Ioia è stato il primo che ha denunciato le torture e le violenze che avvenivano nella cosiddetta “cella zero” del carcere di Poggioreale a Napoli. Bastava un pretesto, una scusa qualsiasi e il detenuto veniva portato nella stanza al piano terra. Senza telecamere, senza finestre. «Era il 1982 la prima volta che sono stato portato lì e picchiato», racconta Pietro. Erano, quelli, i tempi della guerra tra la Nuova camorra organizzata di Raffaele Cutolo e la Nuova famiglia, una guerra i cui effetti si ripercuotevano anche sui penitenziari napoletani. «Noi ragazzini venivamo obbligati dai boss a custodire le armi in carcere. Ci fu un’irruzione dei Nocs. Furono loro che crearono una stanza del terrore per ottenere confessioni». Così nasce la “cella zero”. Che per oltre 30 anni è sopravvissuta nel silenzio totale. Ed è contando su tale silenzio che, secondo le testimonianze, la “squadra della Uno bianca” prelevava detenuti per riempirli di botte, calci, schiaffi. C’era Ciondolino, così chiamato dai detenuti per il rumore del suo voluminoso mazzo di chiavi; Melella, dal nome delle guance rosse che gli si facevano quando beveva; e poi Piccolo boss, ‘O sfregiat, Zorro, Bei capelli. «Il mio compagno di cella era un lavorante addetto alla pulizia» racconta ancora Pietro che, uscito da Poggioreale, ha aperto un’associazione che raccoglie ex detenuti a Napoli. «Quando un agente gli diceva “comincia dalla zero” capiva che la sera c’era passato qualcuno. E si metteva i guanti perché ci sarebbe stato tanto sangue da togliere». Un orrore che oggi è reso visibile dalle tante testimonianze che si sono susseguite a quella di Ioia. Tutte oggi agli atti e tutte drammaticamente simili. Svegliati spesso nella notte, per futili o magari pretestuosi motivi, portati al piano terra, fatti denudare. E lì minacciati, torturati, picchiati. Emblematica la storia di F., costretto a fare «molte flessioni ricevendo tra l’altro percosse e calci». Il giorno dopo, per via dei tanti dolori soprattutto al lato sinistro del viso, richiede una visita medica. Ma «era presente lo stesso agente che la sera prima aveva effettuato gli abusi che mi ha personalmente interrogato sui motivi della visita». Peggio ancora è andata a un ex tossicodipendente che doveva scontare sei mesi di carcere, finito addirittura in coma con evidenti fratture ed ematomi sparsi in tutto il corpo. «Mi hanno portato nella cosiddetta “cella zero” per picchiarmi fino a farmi andare in coma, mi hanno colpito per tutto il corpo, anche ai testicoli per farmi perdere i sensi», ha denunciato pochi mesi fa intervistato da Fanpage.\nStorie incredibili che raccontano una pratica che, pur non coinvolgendo in toto la polizia penitenziaria, rischia di diventare un “usus” comune e reiterato nel tempo. A Napoli come, pare, anche a Viterbo. Il garante dei detenuti di Lazio e Umbria, Stefano Anastasia, solo pochi mesi fa ha consegnato in procura un esposto sulle violenze nel carcere Mammagialla di Viterbo. In quel documento si legge che almeno dieci detenuti sarebbero stati picchiati. Nei locali doccia, sulle scale o in stanze in uso alla sorveglianza. Tutte zone lontane dalle telecamere di sicurezza. «Quando ci portano lì sappiamo che è per essere picchiati», ha ammesso un detenuto. Un altro, invece, ha raccontato di essere stato «trasportato presso le scale dell’istituto e lì un gruppo di circa dieci agenti di polizia penitenziaria» lo avrebbe pestato. Ma col volto coperto dai passamontagna per non farsi riconoscere.\nTra i ragazzi ascoltati da Anastasia c’è anche Sharaf Hassan, 21enne egiziano. Nell’esposto si legge che Hassan diceva di essere stato picchiato il 20 marzo «da alcuni agenti di polizia penitenziaria», i quali «con molta probabilità gli avevano lesionato il timpano dell’orecchio sinistro», perché «sentiva come il rumore di un fischio». Il ragazzo avrebbe mostrato le sue ferite al garante: segni rossi sulle gambe e tagli sul petto. «Ho paura di morire», avrebbe detto. Pochi mesi dopo, il 23 luglio, Hassan è stato trovato morto in cella: si sarebbe impiccato con un asciugamano. Accertamenti, però, sono ancora in corso per capire cosa sia accaduto. E cosa accada ancora oggi a Viterbo: secondo quanto ci risulta, sarebbero addirittura due le inchieste in corso sul Mammagialla.\nSpostiamoci al Nord. Più precisamente a Ivrea. Già nella scorsa legislatura sono state presentate interrogazioni per l’utilizzo, anche qui, di una cella liscia. “L’acquario”, la chiamano. È lì che sarebbero stati portati alcuni detenuti la notte del 25 ottobre 2016, quando «le guardie hanno usato la violenza indiscriminata… Chiamata la squadra di supporto da Vercelli e riuniti in forza, armati di idranti e manganelli hanno distrutto dei compagni detenuti riducendone due quasi in fin di vita». Questa la denuncia che un detenuto è riuscito a far avere al garante in Piemonte, il quale ha immediatamente presentato un esposto.\nUn altro dei procedimenti nasce, invece, dalla testimonianza di due detenuti che, dallo spioncino del blindo che chiude il reparto “semiliberi”, avrebbero visto gli agenti prelevare H. e pestarlo. Una circostanza che troverebbe conferma nel diario clinico di H., da cui si evince che anche il medico che l’ha visitato ha parlato di «sanguinamento nasale» e di «escoriazioni su gambe, braccia e polsi». Interrogato, è stato lo stesso H. a raccontare cosa sarebbe accaduto: dopo la sua protesta perché voleva tornare nel reparto ordinario e andar via dall’isolamento, gli agenti lo avrebbero completamente bagnato con l’idrante antincendio e picchiato con calci, schiaffi e pugni in faccia e «nell’occasione mi rompevano anche il naso».\nMa i drammi non finiscono qui e spesso possono assumere anche tinte tragiche. Come nel caso di Alfredo Liotta. È il 26 luglio 2012 quando il suo corpo viene ritrovato ormai senza vita in una cella del carcere di Siracusa. All’inizio si dirà che Alfredo è morto per un presunto sciopero della fame. Peccato però che di tale sciopero non ci sia alcuna traccia nel diario clinico. I famigliari avevano denunciato invano un dimagrimento di 40 kg tanto da ridurlo su una sedia a rotelle: solo dopo si capirà che Alfredo soffriva di una grave crisi anoressica di cui nessuno, in carcere, si sarebbe fatto carico. Oggi per la morte del ragazzo sono imputate nove persone, ma c’è il rischio che non si giunga mai alla verità: dopo una serie di rinvii, la prima udienza è stata fissata per il 28 maggio 2019\\. «Abbiamo depositato una richiesta al presidente del tribunale per anticipare la trattazione del procedimento – spiega Simona Filippi, legale dell’associazione Antigone. «Non si può far partire un processo a quasi sette anni dalla morte della vittima». Dal tribunale,, però, non è arrivata alcuna risposta.\nDi uguale negligenza sarebbe stato vittima Stefano Borriello: ha solo 29 anni qaundo muore nel carcere di Pordenone. Causa della morte: un’infezione polmonare. Di cui nessuno, neanche il medico della Casa circondariale, si sarebbe avveduto. E proprio oggi il medico è rinviato a giudizio perché avrebbe omesso di diagnosticare la malattia, non provvedendo ad alcune analisi che avrebbero «evidenziato con estrema probabilità» i caratteri della polmonite.\nFunziona così.\nChi muore di polmonite e chi perché è caduto dalle scale.\n\n- - -\n\n_Questo articolo si basa su articoli precedenti pubblicati nell'ottobre 2018_"
		},
		{
			"post_id": 36,
			"title": "Uno Stato di violenza",
			"date_published": 1552506958.964,
			"body": "Lo spiraglio di luce sulla vicenda di Stefano Cucchi, morto 9 anni fa dopo un pestaggio in una caserma dei carabinieri, fa riemergere una lunga scia di abusi. Un sistema “law & order” che frantuma la società e crea paura. L’ultimo atto, il decreto sicurezza di Salvini.\n\n* * *\n\nAll’alba del 22 ottobre 2009 muore, paralizzato e disidratato, Stefano Cucchi, arrestato sei giorni prima per una ventina di grammi di hashish. Le carte della prima inchiesta, che rinviò a giudizio guardie carcerarie e sanitari del Pertini, dicevano già che cerano questioni da chiarire rispetto alle ore in cui il giovane era stato nelle mani dei carabinieri. Ma ci verranno nove anni perché venissero alla luce il pestaggio e i nomi dei carabinieri picchiatori. Se c’è una novità in questa storia è quella che ci spiega Fabio Anselmo, il più famoso avvocato dei casi di “malapolizia”: «È la prima volta che a parlare è uno dei protagonisti diretti». Si tratta di Francesco Tedesco. Da imputato di omicidio preterintenzionale si è trasformato in grande accusatore dei colleghi coimputati. Però nove anni dopo. Scrisse un rapporto proprio il giorno in cui seppe della morte di Stefano, ma lo insabbiarono. È stata la determinazione di Giovanni, Rita e Ilaria, padre, madre e sorella di Stefano Cucchi, a trasformare un dolore privato in una storia condivisa.\nMa di cosa parliamo quando parliamo di Cucchi, o Aldrovandi e Uva, Budroni, Magherini?\nPrendiamo Ilaria. Ilaria che buca lo schermo. Come Salvini, al contrario però di Salvini. Più come Mimmo Lucano. L’Italia è un Paese spaccato, come raccontano le piazze di questi giorni. È la linea etica: i solidali e gli ostili, gli ostili contro i solidali. E in mezzo, certo, gli indifferenti, che però sono più amici degli ostili.\n«Queste zecche del cazzo… speriamo che muoiano tutte… Intanto, uno a zero per noi», si disse in questura, a Genova, dopo l’omicidio di Carlo Giuliani mentre migliaia di agenti di ogni corpo violentavano i manifestanti. E i cellulari dei celerini squillavano cantando Faccetta nera. Sulle loro chat si possono leggere chicche come: «L’Italia non è uno stivale. È un anfibio da celerino». Ecco, quando parliamo di Cucchi parliamo anche della persistente subcultura fascistoide dentro settori di forze armate e di polizia.\nE i carabinieri che lo avrebbero pestato se ne vantavano al telefono: «Quel drogato di merda». Giovanardi dice lo stesso ma in modo più elegante. Ma il succo è sempre quello. Drogati di merda, immigrati di merda, poveri di merda. Giovanardi è anche l’autore, con Fini, della peggiore legge sulle droghe mmai stata in vigore in Italia: ha riempito le galere di stefanicucchi e le tasche delle cosche. Quando parliamo del caso Cucchi, allora, parliamo anche degli effetti del proibizionismo (e del carcere) e di altre morti, Stefano Frapporti, Aldo Bianzino…\nIl maresciallo comandante dei massacratori di Cucchi (presunti, il processo è ancora in corso) si scagliava su Facebook contro i parenti di Domenico Ferrulli e di Davide Bifolco, entrambi morti per aver incontrato uomini violenti in divisa. I nomi dei morti per “police brutality” compongono un catalogo lunghissimo, e più lungo ancora quello degli abusati sopravvissuti (ricordate Paolo Scaroni o Stefano Gugliotta?) dopo essere venuti in contatto con agenti, militari, secondini e pizzardoni. Due della Polfer di Milano lamentarono di essere stati aggrediti da un clochard alla Stazione centrale. Le telecamere della stazione li smentiranno, sono stati loro a pestare a morte Giuseppe Torrisi, 58 anni. Emmanuel Bonsu, cittadino ghanese, fu mezzo ammazzato di botte in una caserma di vigili urbani a Parma. Un vigile urbano di Como sparò in testa, spedendolo in coma, a Rumesh Rajgama Achrige, un ragazzino cingalese di 19 anni. La sua colpa era di essere un writer. I casi Cucchi parlano di degrado, decoro e sicurezza ma al contrario. E certi vigili urbani di Bologna scrivevano su Facebook che «Oggi dobbiamo sgomberare giusto qualche zingarello», oppure «Ci sono delle regole da rispettare qui, non siamo mica in Burundi!», ma quando il Comune li ha mandati a un corso di aggiornamento sul tema delle differenze e della società multiculturale, i loro politici di riferimento, Lega e Forza Italia, si sono scandalizzati, sarebbe «offensivo e svilente». Al mix di fascismo e proibizionismo, allora aggiungiamo dosi da cavallo di razzismo, lo stesso che si respira fuori dalle caserme. Ma c‘è altro.\nIl secondo sindacato di polizia, il Sap, tributò alcuni minuti di standing ovation ai quattro assassini di Federico Aldrovandi e il loro segretario ora è senatore della Lega. Piccole e grandi sigle reclamano l’impunità per i loro colleghi ma chiedono carta bianca contro No Tav, No Triv, No Tap promettendo coperture legali per eventuali strascichi giudiziari (anche se la Procura di Torino archivia a più non posso). Sindacalisti di polizia sono quelli che accusano i migranti di portare colera, scabbia o tubercolosi. Anche al “pattuglione” in partenza per la Diaz fu assicurato: «Se restate con la camicia impigliata da qualche parte sarete coperti. Faremo quadrato». Enrico Zucca, il pm della Diaz, notò che nelle parole del più alto grado degli imputati per la Diaz c’era «l’assenza di ogni traccia di cultura democratica in quell’istituzione che credevamo essere, invece, dopo la riforma tanto agognata, un corpo smilitarizzato, pienamente inserito nella vita democratica del Pese».\nRimilitarizzazione, corporativismo: aggiungere alla lista.\nA comandare i carabinieri di piazza Alimonda erano ufficiali dell’Arma, veterani delle missioni all’estero. Nessun Parlamento ha ritenuto opportuna una commissione d’inchiesta sui fatti di Genova ma ogni Parlamento ha sempre votato al rifinanziamento delle missioni di guerra e da trent’anni è incapace perfino di creare una legge contro la tortura coerente con la convenzione Onu. Ostili sul fronte interno e su quello esterno della guerra globale.\n«Ma che siete matti, ci volete marchiare come bestie?!», strillarono i rappresentanti di polizia e carabinieri contro chi proponeva un codice alfanumerico sulle giubbe di chi doveva operare travisato in ordine pubblico. Quei numeretti sul casco potrebbe decifrarli solo un magistrato, ce l’ha perfino la polizia di Erdogan ma qui no: impedirebbero ai poliziotti di essere efficaci, lamentano i soliti politici di riferimento. Salvini in primis che, oltre a fargli «schifo» Ilaria, pretende che ci si «sciacqui la bocca» quando si parla di forze dell’ordine. I casi Cucchi sono i frutti avvelenati del governo della paura, di quello che un sindacalista di polizia (ma del Silp-Cgil, si tratta dell’ex segretario Giardullo) definì il «modello di società impossibile, aperto alle merci, chiuso alle persone». La retorica “law & order”, della tolleranza zero, è strettamente connaturata ai processi del liberismo che prima frantumano la società con violenza (cosa c’è di più violento della precarizzazione delle vite o della devastazione ambientale?) e poi la saldano con la paura.\nMigranti, ultrà, ragazzi dei centri sociali, consumatori di sostanze: è soprattutto su di loro che si mettono a punto certe pratiche di controllo sociale da applicare poi nei luoghi di lavoro o nei territorio contro chiunque provi a ribellarsi.\nSi legga con questa lente il decreto sicurezza di Salvini per farsi venire il sospetto che sotto la linea etica c’è la questione sociale.\nMa se la violenza esibita corrisponde a una certa visione del mondo e dell’ordine, è marcia qualche mela o le mele marciano?\n\n* * *\n\n_Questo articolo si basa su precedenti articoli pubblicati nell'ottobre 2018_"
		},
		{
			"post_id": 35,
			"title": "«Continuo a lottare perché non accada mai più»",
			"date_published": 1552501868.819,
			"body": "«Mi fidavo talmente delle istituzioni da affidare loro mio fratello di fronte a quello che percepivo come un mio fallimento» racconta Ilaria Cucchi. E dopo l’ammissione di responsabilità dei carabinieri guarda al futuro: «Bisogna insistere, per Stefano, per Federico, per Carlo».\n\n* * *\n\nArriverà un giorno in cui questa vicenda giudiziaria avrà un fine, e allora che ne sarà della passione civile di Ilaria Cucchi? «Andrò avanti con l’associazione che porta il nome di Stefano. Ha ragione chi dice che lo strumentalizzo, continuerò a farlo, perché tramite lui ricordiamo tutti gli altri Stefano».\nDa quella notte di ottobre 2009, Ilaria Cucchi si interroga su cosa si dovrebbe fare «perché non succeda mai più», come, prima di lei, scrissero su un lenzuolo gli amici di Federico Aldrovandi quando scesero in piazza un anno dopo l’uccisione del diciottenne ferrarese da parte di quattro agenti. E prima di loro ci aveva pensato Haidi Giuliani, la mamma di Carlo, che provò a mettere insieme «il Paese dei comitati», come lo chiamava Manlio Milani, il marito di Livia Bottardi che morì nella strage di Brescia 27 anni prima di Carlo, 31 prima di Federico, 35 prima di Stefano.\n«L’unica cosa che posso fare è un lavoro di sensibilizzazione. In fondo è quello che stiamo facendo. Ed è l’unica speranza che abbiamo», dice la sorella di Cucchi al termine di un’ennesima, partecipatissima, proiezione collettiva di “Sulla mia pelle”, il film di Cremonini che ricostruisce l’ultima settimana di vita di Stefano. Migliaia di persone, da un mese, vi prendono parte nelle piazze, nelle università, nei centri sociali nonostante la lunga notte della Repubblica del tempo di Salvini e Di Maio.\nSolo cinque anni fa, di questi di tempi, l’assoluzione delle guardie penitenziarie, nel primo processo, quello che ignorava il ruolo dei carabinieri che avevano arrestato Cucchi, sembrava una pietra tombale sulla battaglia di verità e giustizia. Centinaia di persone diedero vita alle “mille candele” sotto il Csm per illuminare quei luoghi bui «dove ogni giorno si umiliano le esistenze e si calpesta la democrazia. Fu un nuovo inzio», ricorda Ilaria. Poi l’inchiesta bis, un altro processo e le rivelazioni di Francesco Tedesco: «Tutto quello che in questi anni avevo solo potuto immaginare, il tassello che mancava adesso è arrivato», ripete Ilaria Cucchi da quando le rivelazioni di uno dei carabinieri imputati hanno confermato quello che immaginava da quando aveva visto Stefano sul tavolo dell’obitorio. Nove anni fa. E mentre lei era in obitorio, Tedesco scriveva un rapporto su quello che era accaduto una settimana prima, la notte dell’arresto. Ma lei non poteva saperlo perché il “muro” era già stato issato, erano spariti i nomi di chi aveva preso parte all’arresto, erano stati falsificati i verbali, sarebbe sparito anche quel rapporto, un ministro del governo Berlusconi, La Russa, aveva ordinato di lasciar stare i carabinieri, che non c’entravano. La notte della Repubblica non è iniziata ieri. «Il muro serviva a fare la guerra a noi», dice Ilaria. Colpevolizzazione secondaria, direbbero gli addetti ai lavori della giurisprudenza: la tendenza a processare le vittime quando i carnefici sono potenti, magari in divisa. «Non ci siamo fermati e, col tempo, siamo diventati sempre di più».\n«Sono stati nove anni difficilissimi, la mia vita è cambiata per sempre. Io sono cambiata e se anche domani Stefano dovesse tornare a casa, tutto il dolore non ce lo toglierebbe nessuno. Nove anni fa ero una persona che si fidava talmente delle istituzioni da affidare loro mio fratello di fronte a quello che percepivo come un mio fallimento. Nel momento più brutto della nostra vita, però, quelle stesse istituzioni ci voltavano le spalle. Lo Stato non era più nostro alleato ma il nostro peggior nemico, non potevo nemmeno immaginare che sarebbe stata una battaglia dentro e fuori le aule di giustizia». Sono stati anni in cui Ilaria ha scoperto una dimensione politica che mai avrebbe immaginato, «era l’ultima cosa che avrei voluto, purtroppo sono stata costretta a diventare un punto di riferimento, quasi un eroe. Ma quello che è successo può ancora accadere a chiunque. Non possiamo più voltarci dall’altra parte».\n\n* * *\n\n_Questo articolo si basa su precedenti articoli pubblicati nell'ottobre 2018_"
		},
		{
			"post_id": 34,
			"title": "Per non dimenticare gli affetti",
			"date_published": 1552501479.956,
			"body": "Le notizie politiche sono sempre più assurde. I governanti Lega-M5s non sembrano ancora essersi resi conto che sono alla guida di un Paese con 60 milioni di abitanti. Ogni affermazione del governo ha una ripercussione. La manovra economica del governo non è ancora chiara. Di certo si sa soltanto che i soldi per mettere in atto il programma elettorale non ci sono. Ed ecco quindi che si deve ricorrere al debito.\n\n* * *\n\nIl problema non sono di per sè i soldi in prestito. Il problema è la credibilità di un governo che attacca tutto e tutti preventivamente senza valutarne gli effetti e le conseguenze. Il gridare al complotto speculativo non fa altro che alimentare la speculazione. Perché c’è chi in questi giorni sta scommettendo al ribasso del debito italiano e al suo downgrade, ossia all’abbassamento del rating, proprio per le affermazioni del governo.\nDi fatto questo abbassamento è già stato scontato dal mercato. L’innalzamento dello spread di 150 punti base sta già costando allo Stato per lo meno 1 punto percentuale in più all’anno nei rendimenti dei nuovi titoli in emissione, ossia maggiori spese per interessi. Di fatto la politica che a parole si voleva espansiva sta determinando che nel futuro dovremo pagare maggiori interessi riducendo in concreto la quantità di denaro disponibile per la spesa dello Stato. Ma l’aspetto economico è probabilmente il meno grave. Fa parte di una strategia politica ben precisa. Perchè un peggioramento del costo del debito italiano significa meno risorse da spendere e necessariamente un peggioramento delle condizioni per l’accesso al credito dell’economia italiana. La strategia politica è quella di tenere il Paese bloccato a pensare che ci sia un complotto internazionale che vuole strozzare l’Italia facendo in modo che la politica economica determini un peggioramento finanziario di cui si possa accusare qualche potere estero che gestisce il complotto (Soros, Bce, Troika, Commissione europea, ecc.).\nNel frattempo si fa in modo di indirizzare le difficoltà in cui si trova e si troverà sempre di più la popolazione a cause che non hanno nulla a che fare con quel problema. Prima fa tutte l’immigrazione. Si vuole fare in modo che le persone pensino che è il diverso, lo straniero che ci fa vivere male. Si vuole che le persone attribuiscano tutti i loro problemi di qualunque natura, la colpa di tutto ciò che non va a qualcun altro.\nSalvini dice di lavorare per gli italiani da buon padre di famiglia che protegge la casa e i figli. Che chiude la porta di casa per proteggerli.\nSalvini legittima un pensiero razzista e fascista.\nPerché viene costruita una realtà che non esiste e affermata con slogan che non hanno senso. Dire “aiutiamoli a casa loro” significa implicitamente dire che il Paese Italia è “casa nostra”. come dire che è una proprietà privata. È un assurdo assoluto. Viene proposto di eliminare completamente il concetto di Stato e di istituzioni che non sono la proprietà di nessuno. La Costituzione italiana stabilisce e garantisce diritti e doveri dei cittadini. Ma il termine “cittadino” si deve estendere a chiunque si trovi sul territorio dello Stato. È la Corte costituzionale che lo ha stabilito. Per lo Stato italiano vengono sempre prima le persone e non esiste un concetto di proprietà dello Stato da parte di qualcuno.\nPer quanto Salvini e Di Maio abbiano ampiamente vinto le elezioni questo non significa che siano diventati i “proprietari del Paese”. Fateci caso.\nLa loro proposta politica quotidiana è proprio questa: “Ora che siamo noi quelli che decidono, ora che siamo i proprietari, tutti dovranno fare quello che diciamo noi, per il bene di tutti”. e forse è proprio per questo che il clima è così pesante. Anche perché certe notizie sembrano confermare questa idea. Dalla circolare del ministero dell’Interno che stabilisce lo spostamento coatto dei migranti di Riace (poi rettificato perché illegale) alla sindaca leghista di Lodi che esclude dei bambini dalla mensa scolastica perché “non italiani”. Oppure quando Salvini parla di 60 milioni di italiani che sarebbero con lui. Quando sono a malapena 16 milioni quelli che hanno votato per lui e Di Maio. Esiste ancora la Costituzione, esiste una magistratura indipendente, dovrebbe esistere anche un’opposizione parlamentare anche se sembra scomparsa. Esistono soprattutto le persone, italiani o non italiani non ha alcuna importanza, che si oppongono a questa narrazione tossica e manipolatoria. Una opposizione spontanea che si ribella a questa violenza come necessità personale di affermazione di una identità di essere esseri umani.\nQualche giorno fa ho visto sulla Rai il bellissimo e drammatico documentario di Alberto Angela sul campo di concentramento nazista di Auschwitz. Non ricordo bene quando ma a un certo momento viene proposta l’idea che il grande pericolo, quello cui dobbiamo stare attenti per evitare il ripetersi di simili catastrofi sia l’odio.\nL’odio per l’altro, il diverso, lo straniero.\nIn realtà non è così. L’odio può determinare la violenza, questo sì. Ma il vero pericolo per la democrazia è quando l’azione di aggressione all’altro si realizza senza effetti. È quello che ha realizzato il “nazismo”.\nSalvini che manda i suoi tweet in cui fa affermazioni violentissime e finisce la frase con “un bacione”: quella mancanza di empatia, di sentire la realtà umana dell’altro, non è odio. È una politica priva di affetti.\nSalvini, come lui stesso dice, non odia nessuno. Fa il suo lavoro meticolosamente. È quando la realtà umana diversa da se stessi non esiste più, quando viene annullata, fatta scomparire che si perdono gli affetti.\nChi ha la pelle scura, lo straniero, la donna, il diverso perdono la qualità di essere esseri umani. È un pensiero freddo e razionale. Pensiero lucido che deve gestire un “problema”. L’odio non c’è affatto.\nIl grande pericolo è questo. La disumanità c’è quando si sono persi tutti gli affetti. Anche l’odio.\nRestare umani significa ribellarsi all’anaffettività.\n\n* * *\n\nQuesto articolo si basa su articoli precedenti pubblicati nell'ottobre 2018"
		},
		{
			"post_id": 33,
			"title": "Il libro nero della Lega (2019) (Parte 1)",
			"date_published": 1552327423.372,
			"body": "IL LIBRO NERO DELLA LEGA.\n\nLA TRUFFA MILIONARIA AI DANNI DEGLI ITALIANI,\nLE ALLEANZE CON PERSONAGGI IMPRESENTABILI AL SUD,\nLE TRAME OPACHE SULLO SCACCHIERE INTERNAZIONALE:\nTUTTA LA VERITÀ SUL PARTITO DI MATTEO SALVINI.\n\nChe fine hanno fatto i 49 milioni di euro della truffa sui rimborsi elettorali architettata da Umberto Bossi e Francesco Belsito? Perché Matteo Salvini mente quando dice di non aver mai visto un euro di quel tesoro? Chi sono i nuovi finanziatori del partito di oggi? E ancora, come mai il ministro dell’Interno per sfondare al Sud si è circondato di personaggi equivoci, riciclati, ex fascisti, condannati, indagati e con parentele su cui pesa il sospetto di contiguità con la mafia? Quali segreti si celano dietro le alleanze strette dal leader della Lega con Vladimir Putin e Donald Trump?\n\n* * *\n\nUn libro inchiesta svela per la prima volta le trame finanziarie e politiche del partito del ministro dell’Interno. È “Il libro nero della Lega”, una coraggiosa ricostruzione basata anche su importanti socumenti fin qui inediti.\n\nGiovanni Tizian e Stefano Vergine per le loro inchieste sulla Lega hanno ricevuto il Premio Franco Giustolisi “Giustizia e Verità” 2018.\n\n* * *\n\nGiovanni Tizian è giornalista del settimanale “L’Espresso”. Ha ottenuto numerosi riconoscimenti, tra i quali il Premio Enzo Biagi, la Colomba d’Oro per la pace, il Premio Biagio Agnes e il Premio Giuseppe Fava.\n\nStefano Vergine è giornalista freelance, dopo essere stato dal 2014 al 2018 vice caposervizio del settimanale “L’Espresso”. Ha collaborato con testate nazionali e straniere, occupandosi di economia, finanza e politica internazionale. Ha vinto nel 2015 e nel 2016 il premio State Street, dedicato al giornalismo economico e finanziario, e ha contribuito alla realizzazione dell’inchiesta Panama Papers, premiata con il Pulitzer nel 2017.\n\n* * *\n\nPrima edizione: febbraio 2019\n\n* * *\n\nIndice\n\nPremessa\n\nParte prima\n«Non ho mai visto quei soldi»\nDove sono finiti i 49 milioni del tesoro padano\n\n1.  Le origini della truffa\n\n2.  Perchè la Lega deve restituire i 48,9 milioni\n\n3.  L’interregno di Maroni\n\n4.  Aiello e il pm\n\n5.  Arriva Matteo\n\n6.  Tutto cambia tranne Giorgetti\n\n7.  Anche Salvini ha usato i soldi della truffa\n\n8.  Una partita di giro\n\n9.  La finanza leghista\n\n10.  I commercialisti di via Angelo Maj\n\n11.  Il metodo Parnasi\n\n12.  Parla Luca, trema Matteo\n\n13.  Tutti a tavola\n\n14.  Legacadabra\n\n15.  Crocevia Lussemburgo\n\n16.  La nuova Lega\n\nParte seconda\n«Nessun riciclato»\nGli impresentabili al Sud\n\n1.  Benvenuto al Sud\n\n2.  Un sogno del passato\n\n3.  L’isola dei riciclati\n\n4.  Dalla Dc alla Lega\n\n5.  Il Drago e il Padano\n\n6.  Detto “Salvino”\n\n7.  Firma sulla loggia\n\n8.  Ombre nere sullo stretto\n\n9.  Alla conquista di Roma\n\n10.  Piana leghista\n\n11.  Soci sospetti e affari con gli “invasori”\n\n12.  Il consuocero del boss\n\n13.  Lo chiamavano ‘o Criminale\n\n14.  Salvini il campano\n\n15.  Tra boss e mazzette\n\n16.  Le parole di un deluso\n\nParte terza\n«Putin è un grande, lo penso gratis»\nI poteri forti dietro l’internazionale sovranista\n\n1.  La svolta sovranista\n\n2.  La “Bestia” su Facebook\n\n3.  Mister flat tax ha fatto crack\n\n4.  L’alleanza con Putin\n\n5.  Tovarish Savoini\n\n6.  Padani col colbacco\n\n7.  L’oligarca del Cremlino\n\n8.  Tre milioni da Vladimir\n\n9.  Tra il Cupolone e la Casa Bianca\n\n10.  Un banchiere per amico\n\n11.  L’alleanza che non si dicembre\n\n12.  Russia nero-verde\n\n13.  La piramide sovranista\n\nDocumenti"
		},
		{
			"post_id": 31,
			"title": "Le donne sono pronte a lottare",
			"date_published": 1552234496.795,
			"body": "Anche quest’anno l’8 marzo è una giornata di sciopero per le donne di tutto il mondo. È l’ultima tappa di una mobilitazione cominciata in Argentina nel 2015 con la nascita del movimento “Ni una menos” contro i femminicidi e la violenza sulle donne. Quella mobilitazione si è poi estesa: dalla Polonia, dove nel 2016 la protesta ha bloccato un disegno di legge sull’aborto, agli Stati Uniti, dove dopo la marcia delle donne a Washington nel 2017 è nato il movimento #MeToo. In Italia “Non una di meno” ha preso piede dopo la grande manifestazione del 26 novembre 2016.\n\n* * *\n\nFin dall’inizio questo movimento ha scelto lo strumento dello sciopero, usandolo però in modo nuovo e più esteso. Infatti oltre ad astenersi dal lavoro retribuito, e quasi sempre sottopagato, le donne si astengono dai lavoro domestici e di cura, mai riconosciuti. Scioperano dai ruoli di madri e di custodi della famiglia, si sottraggono al controllo sui loro corpi e sulla loro vita privata.\nProtestano contro tutte le forme di violenza, non solo quella contro le donne bianche: la violenza contro le persone transessuali e transgender, quella contro gli omosessuali, la violenza razzista, la discriminazione delle persone con disabilità, la negazione dei diritti sociali, la chiusura delle frontiere, la devastazione dell’ambiente, l’espropriazione della terra.\nProprio mentre in Europa cresce un’onda conservatrice, nazionalista e razzista, il transfemminismo – come viene chiamato – tocca tutte le questioni più urgenti di oggi ed esprime una critica radicale del modo di concepire la politica, il lavoro, i rapporti tra i sessi e la vita privata.\nNessuno, però, ne parla.\nIntanto la violenza continua. In Italia quasi una donna su tre subisce qualche forma di violenza fisica o sessuale nel corso della vita. Nel 2013 il governo ha ratificato la convenzione di Istanbul del Consiglio d’Europa sulla prevenzione e la lotta alla violenza contro le donne e la violenza domestica. Secondo il Rapporto delle associazioni di donne sull’attuazione della convenzione, del 2018, lo stato italiano è intervenuto soprattutto per criminalizzare delle condotte, mentre la protezione e la prevenzione sono ostacolate da una cultura caratterizzata da “profondi stereotipi sessisti e diseguaglianze tra i generi”.\nLa battaglia è ancora lunga, ma oggi in piazza scendono tante donne decise a combatterla."
		},
		{
			"post_id": 30,
			"title": "L’ostinazione del potere algerino",
			"date_published": 1552169267.131,
			"body": "A quanto pare né il presidente né i suoi sostenitori hanno compreso l’ampiezza della rivendicazione popolare, calma ma risoluta, per un cambiamento radicale e immediato in Algeria. O forse hanno voluto far prevalere la volontà del clan su quella del popolo.\n\n* * *\n\nMentre milioni di algerini manifestano per invitarlo a rinunciare al quinto mandato, Abdelaziz Bouteflika manda al consiglio costituzionale un corteo di furgoni carichi di faldoni con le firme dei suoi sostenitori, nel tentativo di impressionare un popolo che però è ormai insensibile alle farse che hanno ridicolizzato la “democrazia” algerina.\nC’è un enorme scarto culturale e di metodo tra un popolo che ha deciso di protestare civilmente e un regime che quando non può ricorrere alla repressione si rifugia nei vecchi trucchi. Il potere è imprigionato nel rifiuto di cedere alle richieste della popolazione, molto probabilmente perché Bouteflika non tollera di essere umiliato. Fin dalla sua ascesa opportunisti di ogni tipo, provenienti dalla cerchia del potere ma anche dall’opposizione, si sono sottomessi a lui, il presidente che aveva promesso privilegi per tutti. Bouteflika ha finito per convincersi che per mantenere il potere gli bastasse conservare questa corte. Il risultato è stato una depoliticizzazione del potere. Oggi in Algeria non resta che un’unica autorità, e i politici hanno abbandonato programmi e princìpi per far parte del regime.\nQuesto non riguarda solo Bouteflika. È l’intero sistema della “democratura” che, in piena crisi di sopravvivenza, è colpito dalla presa di coscienza della popolazione. Il regime si accorge improvvisamente che le cerchie ristrette e le clientele non possono più difenderlo dalla collera popolare.\nDato che non si era mai immaginato un risveglio popolare come quello a cui sta assistendo, forse Bouteflika spera che la contestazione si sgonfi rapidamente. Se è così, la sua ostinazione potrebbe rivelarsi molto pericolosa."
		},
		{
			"post_id": 29,
			"title": "Riconoscere",
			"date_published": 1552167388.157,
			"body": "“Sono una vostra lettrice e trovo i vostri articoli sempre molto illuminanti. Pertanto vi chiedo un’illuminazione! Il mio compagno e io stiamo insieme da sei anni. È raro che parliamo di attualità ma quando capita insorgono terribili discussioni, sul tema dei migranti poi è come parlare con Salvini! Il suo pensiero è povero, pieno di luoghi comuni e disinformazione. Sono terrorizzata. Non si informa, non legge i giornali, ma pretende di giudicare! Aspettiamo un figlio e sono preoccupata all’idea di doverlo crescere con un papà becero”. M.S.\n\nSeminare l’odio e la discordia è, da sempre, uno dei modi per mantenere il potere e per controllare popoli e paesi. Divide et impera: politici come Matteo Salvini devono il loro successo a questa strategia.\n\n* * *\n\nLe divisioni attraversano tutta una società, gli spazi pubblici, i luoghi di lavoro, sono spaccature che arrivano fin dentro le case, e spezzano – o rischiano di spezzare – legami anche forti. La questione che lei pone è importante e la risposta non è semplice. Se la spinta che avvertiamo è alla discordia, forse dovremmo rispondere cercando la concordia. Ma fin dove si può arrivare per ricomporre una frattura? Lei dovrebbe accettare il suo compagno e le sue opinioni? Oppure, al contrario, cercare di fargli cambiare idea e se necessario entrare in conflitto con lui? La separazione può essere un’opzione? Forse possiamo chiedere aiuto a Italo Calvino: «L’inferno dei viventi non è qualcosa che sarà; se ce n’è uno, è quello che è già qui, l’inferno che abitiamo tutti i giorni, che formiamo stando insieme. Due modi ci sono per non soffrirne. Il primo riesce facile a molti: accettare l’inferno e diventarne parte fino al punto di non vederlo più. Il secondo è rischioso ed esige attenzione e apprendimento continui: cercare e saper riconoscere chi e cosa, in mezzo all’inferno, non è inferno, e farlo durare, e dargli spazio”."
		},
		{
			"post_id": 27,
			"title": "La “cella zero” delle carceri disumane",
			"date_published": 1540285528,
			"body": "_A Poggioreale per decenni è esistito un luogo del terrore dove i detenuti venivano picchiati. Pratiche illegali che hanno preso piede anche in altri penitenziari, come dimostrano gli esposti dei Garanti dei detenuti del Lazio e del Piemonte._\n\n«Solo una lampada accesa. Tutt’intorno il nulla, solo quattro mura sporche di sangue e muffa. All’inizio c’era un cappio appeso. Era l’illuminazione del terrore. Centinaia e centinaia di detenuti ci sono passati». Pietro Ioia è stato il primo che ha denunciato le torture e le violenze che avvenivano nella cosiddetta “cella zero” del carcere di Poggioreale a Napoli. Bastava un pretesto, una scusa qualsiasi e il detenuto veniva portato nella stanza al piano terra. Senza telecamere, senza finestre.\n\n* * *\n\n«Era il 1982 la prima volta che sono stato portato lì e picchiato», racconta Pietro. Erano, quelli, i tempi della guerra tra la Nuova camorra organizzata di Raffaele Cutolo e la Nuova famiglia, una guerra i cui effetti si ripercuotevano anche sui penitenziari napoletani. «Noi ragazzini venivamo obbligati dai boss a custodire le armi in carcere. Ci fu un’irruzione dei Nocs. Furono loro che crearono una stanza del terrore per ottenere confessioni». Così nasce la “cella zero”. Che per oltre 30 anni è sopravvissuta nel silenzio totale. Ed è contando su tale silenzio che, secondo le testimonianze, la “squadra della Uno bianca” prelevava detenuti per riempirli di botte, calci, schiaffi. C’era Ciondolino, così chiamato dai detenuti per il rumore del suo voluminoso mazzo di chiavi; Melella, dal nome delle guance rosse che gli si facevano quando beveva; e poi Piccolo boss, ‘O sfregiat, Zorro, Bei capelli. «Il mio compagno di cella era un lavorante addetto alla pulizia» racconta ancora Pietro che, uscito da Poggioreale, ha aperto un’associazione che raccoglie ex detenuti a Napoli. «Quando un agente gli diceva “comincia dalla zero” capiva che la sera c’era passato qualcuno. E si metteva i guanti perché ci sarebbe stato tanto sangue da togliere». Un orrore che oggi è reso visibile dalle tante testimonianze che si sono susseguite a quella di Ioia. Tutte oggi agli atti e tutte drammaticamente simili. Svegliati spesso nella notte, per futili o magari pretestuosi motivi, portati al piano terra, fatti denudare. E lì minacciati, torturati, picchiati. Emblematica la storia di F., costretto a fare «molte flessioni ricevendo tra l’altro percosse e calci». Il giorno dopo, per via dei tanti dolori soprattutto al lato sinistro del viso, richiede una visita medica. Ma «era presente lo stesso agente che la sera prima aveva effettuato gli abusi che mi ha personalmente interrogato sui motivi della visita». Peggio ancora è andata a un ex tossicodipendente che doveva scontare sei mesi di carcere, finito addirittura in coma con evidenti fratture ed ematomi sparsi in tutto il corpo. «Mi hanno portato nella cosiddetta “cella zero” per picchiarmi fino a farmi andare in coma, mi hanno colpito per tutto il corpo, anche ai testicoli per farmi perdere i sensi», ha denunciato pochi mesi fa intervistato da Fanpage.\nStorie incredibili che raccontano una pratica che, pur non coinvolgendo in toto la polizia penitenziaria, rischia di diventare un “usus” comune e reiterato nel tempo. A Napoli come, pare, anche a Viterbo. Il garante dei detenuti di Lazio e Umbria, Stefano Anastasia, solo pochi mesi fa ha consegnato in procura un esposto sulle violenze nel carcere Mammagialla di Viterbo. In quel documento si legge che almeno dieci detenuti sarebbero stati picchiati. Nei locali doccia, sulle scale o in stanze in uso alla sorveglianza. Tutte zone lontane dalle telecamere di sicurezza. «Quando ci portano lì sappiamo che è per essere picchiati», ha ammesso un detenuto. Un altro, invece, ha raccontato di essere stato «trasportato presso le scale dell’istituto e lì un gruppo di circa dieci agenti di polizia penitenziaria» lo avrebbe pestato. Ma col volto coperto dai passamontagna per non farsi riconoscere.\nTra i ragazzi ascoltati da Anastasia c’è anche Sharaf Hassan, 21enne egiziano. Nell’esposto si legge che Hassan diceva di essere stato picchiato il 20 marzo «da alcuni agenti di polizia penitenziaria», i quali «con molta probabilità gli avevano lesionato il timpano dell’orecchio sinistro», perché «sentiva come il rumore di un fischio». Il ragazzo avrebbe mostrato le sue ferite al garante: segni rossi sulle gambe e tagli sul petto. «Ho paura di morire», avrebbe detto. Pochi mesi dopo, il 23 luglio, Hassan è stato trovato morto in cella: si sarebbe impiccato con un asciugamano. Accertamenti, però, sono ancora in corso per capire cosa sia accaduto. E cosa accada ancora oggi a Viterbo: secondo quanto ci risulta, sarebbero addirittura due le inchieste in corso sul Mammagialla.\nSpostiamoci al Nord. Più precisamente a Ivrea. Già nella scorsa legislatura sono state presentate interrogazioni per l’utilizzo, anche qui, di una cella liscia. “L’acquario”, la chiamano. È lì che sarebbero stati portati alcuni detenuti la notte del 25 ottobre 2016, quando «le guardie hanno usato la violenza indiscriminata… Chiamata la squadra di supporto da Vercelli e riuniti in forza, armati di idranti e manganelli hanno distrutto dei compagni detenuti riducendone due quasi in fin di vita». Questa la denuncia che un detenuto è riuscito a far avere al garante in Piemonte, il quale ha immediatamente presentato un esposto.\nUn altro dei procedimenti nasce, invece, dalla testimonianza di due detenuti che, dallo spioncino del blindo che chiude il reparto “semiliberi”, avrebbero visto gli agenti prelevare H. e pestarlo. Una circostanza che troverebbe conferma nel diario clinico di H., da cui si evince che anche il medico che l’ha visitato ha parlato di «sanguinamento nasale» e di «escoriazioni su gambe, braccia e polsi». Interrogato, è stato lo stesso H. a raccontare cosa sarebbe accaduto: dopo la sua protesta perché voleva tornare nel reparto ordinario e andar via dall’isolamento, gli agenti lo avrebbero completamente bagnato con l’idrante antincendio e picchiato con calci, schiaffi e pugni in faccia e «nell’occasione mi rompevano anche il naso».\nMa i drammi non finiscono qui e spesso possono assumere anche tinte tragiche. Come nel caso di Alfredo Liotta. È il 26 luglio 2012 quando il suo corpo viene ritrovato ormai senza vita in una cella del carcere di Siracusa. All’inizio si dirà che Alfredo è morto per un presunto sciopero della fame. Peccato però che di tale sciopero non ci sia alcuna traccia nel diario clinico. I famigliari avevano denunciato invano un dimagrimento di 40 kg tanto da ridurlo su una sedia a rotelle: solo dopo si capirà che Alfredo soffriva di una grave crisi anoressica di cui nessuno, in carcere, si sarebbe fatto carico. Oggi per la morte del ragazzo sono imputate nove persone, ma c’è il rischio che non si giunga mai alla verità: dopo una serie di rinvii, la prima udienza è stata fissata per il 28 maggio 2019\\. «Abbiamo depositato una richiesta al presidente del tribunale per anticipare la trattazione del procedimento – spiega Simona Filippi, legale dell’associazione Antigone. «Non si può far partire un processo a quasi sette anni dalla morte della vittima». Dal tribunale,, però, non è arrivata alcuna risposta.\nDi uguale negligenza sarebbe stato vittima Stefano Borriello: ha solo 29 anni qaundo muore nel carcere di Pordenone. Causa della morte: un’infezione polmonare. Di cui nessuno, neanche il medico della Casa circondariale, si sarebbe avveduto. E proprio oggi il medico è rinviato a giudizio perché avrebbe omesso di diagnosticare la malattia, non provvedendo ad alcune analisi che avrebbero «evidenziato con estrema probabilità» i caratteri della polmonite.\n**Funziona così.\nChi muore di polmonite e chi perché è caduto dalle scale.**"
		},
		{
			"post_id": 26,
			"title": "Uno Stato di violenza",
			"date_published": 1539961801,
			"body": "Lo spiraglio di luce sulla vicenda di Stefano Cucchi, morto 9 anni fa dopo un pestaggio in una caserma dei carabinieri, fa riemergere una lunga scia di abusi. Un sistema “law & order” che frantuma la società e crea paura. L’ultimo atto, il decreto sicurezza di Salvini.\n\n* * *\n\nAll’alba del 22 ottobre 2009 muore, paralizzato e disidratato, Stefano Cucchi, arrestato sei giorni prima per una ventina di grammi di hashish. Le carte della prima inchiesta, che rinviò a giudizio guardie carcerarie e sanitari del Pertini, dicevano già che cerano questioni da chiarire rispetto alle ore in cui il giovane era stato nelle mani dei carabinieri. Ma ci verranno nove anni perché venissero alla luce il pestaggio e i nomi dei carabinieri picchiatori. Se c’è una novità in questa storia è quella che ci spiega Fabio Anselmo, il più famoso avvocato dei casi di “malapolizia”: «È la prima volta che a parlare è uno dei protagonisti diretti». Si tratta di Francesco Tedesco. Da imputato di omicidio preterintenzionale si è trasformato in grande accusatore dei colleghi coimputati. Però nove anni dopo. Scrisse un rapporto proprio il giorno in cui seppe della morte di Stefano, ma lo insabbiarono. È stata la determinazione di Giovanni, Rita e Ilaria, padre, madre e sorella di Stefano Cucchi, a trasformare un dolore privato in una storia condivisa.\nMa di cosa parliamo quando parliamo di Cucchi, o Aldrovandi e Uva, Budroni, Magherini?\nPrendiamo Ilaria. Ilaria che buca lo schermo. Come Salvini, al contrario però di Salvini. Più come Mimmo Lucano. L’Italia è un Paese spaccato, come raccontano le piazze di questi giorni. È la linea etica: i solidali e gli ostili, gli ostili contro i solidali. E in mezzo, certo, gli indifferenti, che però sono più amici degli ostili.\n«Queste zecche del cazzo… speriamo che muoiano tutte… Intanto, uno a zero per noi», si disse in questura, a Genova, dopo l’omicidio di Carlo Giuliani mentre migliaia di agenti di ogni corpo violentavano i manifestanti. E i cellulari dei celerini squillavano cantando Faccetta nera. Sulle loro chat si possono leggere chicche come: «L’Italia non è uno stivale. È un anfibio da celerino». Ecco, quando parliamo di Cucchi parliamo anche della persistente subcultura fascistoide dentro settori di forze armate e di polizia.\nE i carabinieri che lo avrebbero pestato se ne vantavano al telefono: «Quel drogato di merda». Giovanardi dice lo stesso ma in modo più elegante. Ma il succo è sempre quello. Drogati di merda, immigrati di merda, poveri di merda. Giovanardi è anche l’autore, con Fini, della peggiore legge sulle droghe mmai stata in vigore in Italia: ha riempito le galere di stefanicucchi e le tasche delle cosche. Quando parliamo del caso Cucchi, allora, parliamo anche degli effetti del proibizionismo (e del carcere) e di altre morti, Stefano Frapporti, Aldo Bianzino…\nIl maresciallo comandante dei massacratori di Cucchi (presunti, il processo è ancora in corso) si scagliava su Facebook contro i parenti di Domenico Ferrulli e di Davide Bifolco, entrambi morti per aver incontrato uomini violenti in divisa. I nomi dei morti per “police brutality” compongono un catalogo lunghissimo, e più lungo ancora quello degli abusati sopravvissuti (ricordate Paolo Scaroni o Stefano Gugliotta?) dopo essere venuti in contatto con agenti, militari, secondini e pizzardoni. Due della Polfer di Milano lamentarono di essere stati aggrediti da un clochard alla Stazione centrale. Le telecamere della stazione li smentiranno, sono stati loro a pestare a morte Giuseppe Torrisi, 58 anni. Emmanuel Bonsu, cittadino ghanese, fu mezzo ammazzato di botte in una caserma di vigili urbani a Parma. Un vigile urbano di Como sparò in testa, spedendolo in coma, a Rumesh Rajgama Achrige, un ragazzino cingalese di 19 anni. La sua colpa era di essere un writer. I casi Cucchi parlano di degrado, decoro e sicurezza ma al contrario. E certi vigili urbani di Bologna scrivevano su Facebook che «Oggi dobbiamo sgomberare giusto qualche zingarello», oppure «Ci sono delle regole da rispettare qui, non siamo mica in Burundi!», ma quando il Comune li ha mandati a un corso di aggiornamento sul tema delle differenze e della società multiculturale, i loro politici di riferimento, Lega e Forza Italia, si sono scandalizzati, sarebbe «offensivo e svilente». Al mix di fascismo e proibizionismo, allora aggiungiamo dosi da cavallo di razzismo, lo stesso che si respira fuori dalle caserme. Ma c‘è altro.\nIl secondo sindacato di polizia, il Sap, tributò alcuni minuti di standing ovation ai quattro assassini di Federico Aldrovandi e il loro segretario ora è senatore della Lega. Piccole e grandi sigle reclamano l’impunità per i loro colleghi ma chiedono carta bianca contro No Tav, No Triv, No Tap promettendo coperture legali per eventuali strascichi giudiziari (anche se la Procura di Torino archivia a più non posso). Sindacalisti di polizia sono quelli che accusano i migranti di portare colera, scabbia o tubercolosi. Anche al “pattuglione” in partenza per la Diaz fu assicurato: «Se restate con la camicia impigliata da qualche parte sarete coperti. Faremo quadrato». Enrico Zucca, il pm della Diaz, notò che nelle parole del più alto grado degli imputati per la Diaz c’era «l’assenza di ogni traccia di cultura democratica in quell’istituzione che credevamo essere, invece, dopo la riforma tanto agognata, un corpo smilitarizzato, pienamente inserito nella vita democratica del Pese».\nRimilitarizzazione, corporativismo: aggiungere alla lista.\nA comandare i carabinieri di piazza Alimonda erano ufficiali dell’Arma, veterani delle missioni all’estero. Nessun Parlamento ha ritenuto opportuna una commissione d’inchiesta sui fatti di Genova ma ogni Parlamento ha sempre votato al rifinanziamento delle missioni di guerra e da trent’anni è incapace perfino di creare una legge contro la tortura coerente con la convenzione Onu. Ostili sul fronte interno e su quello esterno della guerra globale.\n«Ma che siete matti, ci volete marchiare come bestie?!», strillarono i rappresentanti di polizia e carabinieri contro chi proponeva un codice alfanumerico sulle giubbe di chi doveva operare travisato in ordine pubblico. Quei numeretti sul casco potrebbe decifrarli solo un magistrato, ce l’ha perfino la polizia di Erdogan ma qui no: impedirebbero ai poliziotti di essere efficaci, lamentano i soliti politici di riferimento. Salvini in primis che, oltre a fargli «schifo» Ilaria, pretende che ci si «sciacqui la bocca» quando si parla di forze dell’ordine. I casi Cucchi sono i frutti avvelenati del governo della paura, di quello che un sindacalista di polizia (ma del Silp-Cgil, si tratta dell’ex segretario Giardullo) definì il «modello di società impossibile, aperto alle merci, chiuso alle persone». La retorica “law & order”, della tolleranza zero, è strettamente connaturata ai processi del liberismo che prima frantumano la società con violenza (cosa c’è di più violento della precarizzazione delle vite o della devastazione ambientale?) e poi la saldano con la paura.\nMigranti, ultrà, ragazzi dei centri sociali, consumatori di sostanze: è soprattutto su di loro che si mettono a punto certe pratiche di controllo sociale da applicare poi nei luoghi di lavoro o nei territorio contro chiunque provi a ribellarsi.\nSi legga con questa lente il decreto sicurezza di Salvini per farsi venire il sospetto che sotto la linea etica c’è la questione sociale.\nMa se la violenza esibita corrisponde a una certa visione del mondo e dell’ordine, è marcia qualche mela o le mele marciano?"
		},
		{
			"post_id": 25,
			"title": "«Continuo a lottare perché non accada mai più»",
			"date_published": 1540070652,
			"body": "### «Mi fidavo talmente delle istituzioni da affidare loro mio fratello di fronte a quello che percepivo come un mio fallimento» racconta Ilaria Cucchi. E dopo l’ammissione di responsabilità dei carabinieri guarda al futuro: «Bisogna insistere, per Stefano, per Federico, per Carlo».\n\nArriverà un giorno in cui questa vicenda giudiziaria avrà un fine, e allora che ne sarà della passione civile di Ilaria Cucchi? «Andrò avanti con l’associazione che porta il nome di Stefano. Ha ragione chi dice che lo strumentalizzo, continuerò a farlo, perché tramite lui ricordiamo tutti gli altri Stefano».\n\n* * *\n\nDa quella notte di ottobre 2009, Ilaria Cucchi si interroga su cosa si dovrebbe fare «perché non succeda mai più», come, prima di lei, scrissero su un lenzuolo gli amici di Federico Aldrovandi quando scesero in piazza un anno dopo l’uccisione del diciottenne ferrarese da parte di quattro agenti. E prima di loro ci aveva pensato Haidi Giuliani, la mamma di Carlo, che provò a mettere insieme «il Paese dei comitati», come lo chiamava Manlio Milani, il marito di Livia Bottardi che morì nella strage di Brescia 27 anni prima di Carlo, 31 prima di Federico, 35 prima di Stefano.\n\n«L’unica cosa che posso fare è un lavoro di sensibilizzazione. In fondo è quello che stiamo facendo. Ed è l’unica speranza che abbiamo», dice la sorella di Cucchi al termine di un’ennesima, partecipatissima, proiezione collettiva di “Sulla mia pelle”, il film di Cremonini che ricostruisce l’ultima settimana di vita di Stefano. Migliaia di persone, da un mese, vi prendono parte nelle piazze, nelle università, nei centri sociali nonostante la lunga notte della Repubblica del tempo di Salvini e Di Maio.\n\nSolo cinque anni fa, di questi di tempi, l’assoluzione delle guardie penitenziarie, nel primo processo, quello che ignorava il ruolo dei carabinieri che avevano arrestato Cucchi, sembrava una pietra tombale sulla battaglia di verità e giustizia. Centinaia di persone diedero vita alle “mille candele” sotto il Csm per illuminare quei luoghi bui «dove ogni giorno si umiliano le esistenze e si calpesta la democrazia. Fu un nuovo inzio», ricorda Ilaria. Poi l’inchiesta bis, un altro processo e le rivelazioni di Francesco Tedesco: «Tutto quello che in questi anni avevo solo potuto immaginare, il tassello che mancava adesso è arrivato», ripete Ilaria Cucchi da quando le rivelazioni di uno dei carabinieri imputati hanno confermato quello che immaginava da quando aveva visto Stefano sul tavolo dell’obitorio. Nove anni fa. E mentre lei era in obitorio, Tedesco scriveva un rapporto su quello che era accaduto una settimana prima, la notte dell’arresto. Ma lei non poteva saperlo perché il “muro” era già stato issato, erano spariti i nomi di chi aveva preso parte all’arresto, erano stati falsificati i verbali, sarebbe sparito anche quel rapporto, un ministro del governo Berlusconi, La Russa, aveva ordinato di lasciar stare i carabinieri, che non c’entravano. La notte della Repubblica non è iniziata ieri. «Il muro serviva a fare la guerra a noi», dice Ilaria. Colpevolizzazione secondaria, direbbero gli addetti ai lavori della giurisprudenza: la tendenza a processare le vittime quando i carnefici sono potenti, magari in divisa. «Non ci siamo fermati e, col tempo, siamo diventati sempre di più».\n\n«Sono stati nove anni difficilissimi, la mia vita è cambiata per sempre. Io sono cambiata e se anche domani Stefano dovesse tornare a casa, tutto il dolore non ce lo toglierebbe nessuno. Nove anni fa ero una persona che si fidava talmente delle istituzioni da affidare loro mio fratello di fronte a quello che percepivo come un mio fallimento. Nel momento più brutto della nostra vita, però, quelle stesse istituzioni ci voltavano le spalle. Lo Stato non era più nostro alleato ma il nostro peggior nemico, non potevo nemmeno immaginare che sarebbe stata una battaglia dentro e fuori le aule di giustizia». Sono stati anni in cui Ilaria ha scoperto una dimensione politica che mai avrebbe immaginato, «era l’ultima cosa che avrei voluto, purtroppo sono stata costretta a diventare un punto di riferimento, quasi un eroe. Ma quello che è successo può ancora accadere a chiunque. Non possiamo più voltarci dall’altra parte»."
		},
		{
			"post_id": 24,
			"title": "Distanza",
			"date_published": 1551462089.048,
			"body": "È come se si fosse svuotata una città delle dimensioni di Trento. Nel 2017 sono stati 115mila i cittadini italiani andati all’estero per cercare migliori occasioni di lavoro (nel 2008 erano stati 40mila). Chi va via è mediamente più giovane e più istruito del resto della popolazione (tanto che il 18,8 per cento dei dottori di ricerca vive all’estero), ma comunque solo la metà ha il diploma o la laurea. Sono alcuni dei numeri di un rapporto curato da ministero del lavoro, Istat, Inps, Inail e Anpal e pubblicato il 25 febbraio.\n\n* * *\n\nNonostante la crescita dell’occupazione, la distanza dal resto dell’Europa è aumentata. Se l’Italia avesse un tasso di occupazione uguale alla media dei principali paesi europei, oggi avrebbe 3,8 milioni di occupati in più, soprattutto nella sanità, nell’istruzione, nella pubblica amministrazione. La distanza dall’Europa è dovuta anche al divario di genere: in Italia solo il 48,1 per cento delle donne tra i 15 e i 74 anni fa parte della forza lavoro (contro il 59 per cento dell’Unione Europea). Crescono la sottoccupazione (un lavoro di persone ha lavorato meno ore di quelle per cui sarebbe stato disponibile) e la sovraistruzione (5,6 milioni di persone fanno un lavoro per il quale sono troppo qualificate e in cui le competenze non vengono quindi sfruttate nel modo migliore). I più colpiti sono i dipendenti a termine e pat-time, nei settori dei servizi alle famiglie, della ristorazione, degli alberghi.\n\nIl “disallineamento formativo” è accentuato tra i lavoratori immigrati e riguarda il 69,3 per cento degli stranieri diplomati e laureati (contro il 32,2 per cento degli italiani), soprattutto donne. “L’aumento della quota di occupazione meno qualificata”, dice il rapporto, “accompagnato dalla marcata segmentazione etnica del mercato del lavoro italiano, ha favorito la presenza di lavoratori immigrati più disposti ad accettare lavori disagiati e a bassa specializzazione”.\n\nCome dire che razzismo e sfruttamento vanno insieme."
		},
		{
			"post_id": 23,
			"title": " Tolleranza zero contro il Concordato",
			"date_published": 1551457938.23,
			"body": "Il 16 febbraio, cinque giorni prima del summit mondiale sulla pedofilia convocato in Vaticano da papa Francesco, l’ex cardinale Theodore McCarrick, già arcivescovo di Washington, è stato ridotto allo stato laicale. Un caso senza precedenti nei confronti di un porporato che fa seguito a un’altra rarità: il 28 luglio 2018 Bergoglio gli aveva infatti tolto il cardinalato. La sentenza definitiva della Congregazione per la dottrina della fede che ha riconosciuto McCarrick colpevole di crimini sessuali contro minori e adulti ha messo la parola fine alla sua poderosa carriera ecclesiastica.\n\n* * *\n\nE la decisione di spretarlo, sottolinea il comunicato delle Cdf emanato dalla sala stampa vaticana, è inappellabile, «non soggetta a ulteriore ricorso». Per il cardinale Daniel DiNardo, presidente della Conferenza episcopale Usa, il messaggio è chiaro: «Nessun vescovo, non importa quanto influente, è al di sopra della legge della Chiesa». Tutto qui. Per i vertici della Chiesa togliere la tonaca a un sacerdote che violenta delle persone è una condanna esemplare.\n\nE meno male che almeno in questo caso è avvenuto senza il vincolo del segreto pontificio che di norma pende sulle pronunce della Cdf con il risultato che ex preti con storie di violenza alle spalle se ne vadano in giro senza che nessuno abbia informato le autorità giudiziarie dei Paesi interessati. L’epilogo della vicenda di McCarrick è anche per altri motivi una storia interessante. Perché di solito la pena stabilita dalla Chiesa cattolica ai sacerdoti che violano le sue leggi interne consiste in un periodo di silenzio e preghiera in luoghi “protetti” lontano dai clamori mediatici.\n\nCosa che infatti era stata disposta per l’ex cardinale dopo la punizione del 28 luglio scorso in attesa del giudizio definitivo della Cdf. Ma silenzio e preghiera è anche il modo in cui di norma il Vaticano «reagisce» pubblicamente alle notizie sui crimini compiuti da ecclesiastici. Silenzio e preghiera sono le parole usate da papa Francesco per commentare l’accusa – che gli era stata rivolta nell’agosto 2018 dall’ex nunzio vaticano negli Usa, monsignor Carlo Maria Viganò – di aver insabbiato per anni (fino al 2018 appunto) le denunce contro McCarrick. «Perché la verità è mite, la verità è silenziosa, la verità non è rumorosa» e quindi «il giudizio fatelo voi», ha detto Bergoglio il 3 settembre 2018 durante la sua omelia a Santa Marta. Cosa ha indotto il papa a cambiare atteggiamento? E come si combinano il “silenzio e la preghiera” con i suoi frequenti proclami di «tolleranza zero»?\n\nVa considerato in primis che è passi consolidata in Vaticano intervenire pubblicamente laddove non è più possibile celare e risolvere le situazioni di crisi nelle “segrete stanze”. Si spiegano così, ad esempio, oltre alle ripercussioni pubbliche del dossier Viganò su McCarrick, il secondo summit convocato in Vaticano dalla Santa Sede in sette anni, a cui devono partecipare tutti i capi delle Conferenze episcopali del mondo. Inoltre, c’è dietro l’idea che dai peccati “Dio salva”, e che verso i peccatori vanno usati “misericordia e perdono”, perché «chi tra voi è senza peccato scagli la prima pietra». Questa doppia morale è da sempre l’asse portante nel mondo in cui la Chiesa (non) affronta la pedofilia al suo interno, e affonda le sue radici nella confusione che fa tra reato e peccato. L’abuso, cioè «l’atto sessuale di un chierico con un minore», è ritenuto un delitto contro la morale, un’offesa a Dio, in violazione del sesto comandamento, e non la violenza efferata contro una persona. Di conseguenza la vera vittima sarebbe Dio e il peccatore (che sotto sotto per certa cultura è anche il bambino) secondo la visione degli appartenenti al clero, deve rispondere alla persona che rappresenta l’Altissimo in Terra (il papa), e non alle leggi della società civile di cui fa parte.\n\nDi tutto questo non tiene conto lo Stato italiano nel tenere in vita il Concordato rinnovato nel 1984 con il Vaticano, sebbene dal 1996 in poi la nostra legislazione in materia di reati a sfondo sessuale sui bambini (e le donne) abbia fatto enormi progressi. Con quali conseguenze per l’incolumità dei bambini che frequentano le parrocchie, gli oratori, i seminari minori e le scuole cattoliche? Lo raccontiamo in questa storia, prendendo spunto dalla vibrante denuncia del Comitato Onu per i diritti dell’infanzia e dell’adolescenza che il 7 febbraio scorso ha pubblicato il Rapporto in cui indica al nostro governo tutto quello che andrebbe fatto per dare piena attuazione alla Convenzione di New York ratificata nel 1989.\n\nNell’indifferenza della stampa italiana, che dell’incredibile, sono state messe nero su bianco tutte le criticità derivanti dal Concordato che da un lato solleva i vescovi dall’obbligo di collaborare con l’autorità civile, e dall’altro come ci racconta l’avvocato Mario Caligiuri rappresentante legale di Rete L’Abuso, «limita fortemente nelle indagini la magistratura italiana con il rischio di impedire l’esercizio dell’azione penale nei confronti dei preti sospettati di pedofilia e dei “superiori” che trasferendoli di parrocchia in parrocchia consentono loro di rimanere in contatto con minori e di ripetere l’abuso». Questa garanzia d’impunità è intollerabile per un Paese laico e civile ed è ora che Stato e Chiesa ne prendano atto. Facciamo pertanto nostre le parole della pediatra e psicoterapeuta Maria Gabriella Gatti: «Rispetto a un delitto gravissimo e incredibilmente diffuso, così lesivo della realtà fisica e psichica dei minori non si può rivendicare una extraterritorialità o il diritto di difendere la sacralità, cioè la natura specifica, della dottrina che di fatto garantisce uno statuto speciale per i suoi ministri. I preti pedofili vivono su questa terra e devono rispettare le leggi della società in cui vivono, anche se sono convinti che le credenziali vantate rispetto alla sfera del trascendentale consentano loro comportamenti caratteristici dei criminale e dei malati mentali»."
		},
		{
			"post_id": 22,
			"title": "La resistenza e la capacità di reagire di Mujica è ciò che ci serve oggi",
			"date_published": 1551436419.565,
			"body": "Uno dei momenti chiave del film “Una notte di dodici anni” di Alvaro Brechner è un incontro in carcere fra Pepe Mujica e sua madre. Il futuro presidente dell’Uruguay, a quel punto in galera già da qualche anno, dà evidenti segni di cedimento. Dice di sentire delle voci, appare sofferente e smarrito: è stremato dalle torture, dalla brutalità, dall’isolamento in luoghi insopportabili.\n\n* * *\n\nIl Pepe davanti alla madre cerca complicità più che conforto: sembra chiedere l’autorizzazione ad arrendersi, a cadere in uno stato permanente di semi coscienza, senza più lottare, senza più pensare a un possibile dopo. La madre intuisce lo stato d’animo del figlio e reagisce con forza: «Mamma un cazzo, dice a muso duro, e scuote il prigioniero: non devi mollare, non devi dargliela vinta.\nÈ andata proprio così: il Pepe resterà in piedi, lucido e determinato, come i suoi otto compagni di prigionia (nel film se ne vedono due), militanti Tupamaros tenuti in ostaggio dai militari golpisti, che minacciavano di ucciderli in caso di attentati o altre azioni della resistenza armata.\nDopo dodici anni i nove saranno liberati, al crepuscolo del regime: il Pepe rivedrà sua madre fuori dal carcere. L’incontro in parlatorio è importante perchè documenta un aspetto decisivo nella dinamica della tortura (“Una notte lunga dodici anni” è un film sulla tortura, come non se ne vedevano da tempo). Mostra che la tortura si combatte attraverso il contatto umano, con la forza dell’empatia. Il Pepe e i suoi compagni resistono agli abusi e all’isolamento perché riescono, sia pure saltuariamente e fra spaventose difficoltà, a comunicare fra loro (a piccoli colpi sui muri) o con altre persone, a volte carcerieri disposti a dismettere per qualche ragione la maschera imposta dal ruolo, a volte familiari ammessi a rari colloqui.\nCome i vampiri non sopportano la luce del sole, così la tortura può essere sconfitta quando è sottoposta al vaglio delle relazioni sociali, al calore del contatto umano. Vale per l’individuo che deve affrontarla e trae dagli altri l’energia per non soccombere; vale per la società nel suo insieme.\nNei giorni scorsi è stato pubblicato da due agenzie dell’Onu (Unsmil e Ohrhc) un drammatico rapporto su quanto davvero avviene nei centri di detenzione per migranti in Libia. Sono testimonianze angoscianti: stupri seriali, abus innominabili, violenze continuate, torture in diretta telefonica per estorcere denaro ai parenti, vendite al mercato degli schiavi.\nSi potrebbe dire: niente di nuovo. Da tempo sappiamo, o crediamo di sapere, che la Libia è il non-Stato canaglia per eccellenza, un Paese dilaniato da signori e signorotti della guerra. Lo hanno documentato giornalisti, registi, Ong, la stessa Onu in passato.\nMa queste verità non hanno mai fatto breccia: non nelle istituzioni e nemmeno nell’opinione pubblica. Si sono stretti accordi con sedicenti “governi”, “sindaci” e “guardie costiere” della Libia fingendo di non sapere degli stupri, degli abusi, delle torture. Abbiamo chiuso gli occhi, mente e cuore pur di portare a casa l’unico risultato ambito: poter dichiarare a microfoni aperti «flussi ridotti», «porti chiusi», «basta coi trafficanti di uomini».\nParole false, consapevoli menzogne, ma ripetute così spesso, così a lungo, che alla fine ci troviamo a vivere in una società che non riesce più a comprendere e a capire chi sono i 49 della Sea Watch lasciati a vagare in mare per giorni e giorni o che cosa nascondono le cifre sulla riduzione dei flussi (cinica espressione presa dal linguaggio tecnico, tanto orribile quanto indicativa della disumanizzazione in corso). I segregati nei campi in Libia sono come Pepe Mujica: umiliati e torturati, prossimi a cedere, in balìa di carcerieri protetti – di fatto – da chi pretende di “governare” l’immigrazione a prescindere dalla persone, ignorando le loro sofferenze, oltre che loro aspirazioni.\nLa tortura è fra noi, ne siamo complici, e tutto sta per crollare: il nostro senso di civiltà, la dottrina dei diritti umani, ciò che da tempo intendiamo per “democrazia”.\nL’indifferenza per la negata dignità della persona, di ogni persona, sta diventando strutturale. Ci vorrebbe qualcuno, come la madre di Pepe Mujica, capace di urlarci: «Democrazia un cazzo»."
		},
		{
			"post_id": 20,
			"title": "Chiesa e pedofilia. Complicità di Stato",
			"date_published": 1551429241.704,
			"body": "Segretezza delle procedure, nessun obbligo di denuncia per i vescovi e di collaborazione con le autorità civili. Sono le principali cause della diffusione delle violenze sui minori di matrice ecclesiastica nel nostro Paese. Eppure è così che il Vaticano e la Conferenza Episcopale Italiana continuano a trattare i casi di abuso.\nPerché lo consente il Concordato.\n**Aboliamolo**.\n\nTante nuove notizie in arrivo su **Scienza e Cultura libera**."
		},
		{
			"post_id": 19,
			"title": "Per non dimenticare gli affetti",
			"date_published": 1538377694,
			"body": "Le notizie politiche sono sempre più assurde. I governanti Lega-M5s non sembrano ancora essersi resi conto che sono alla guida di un Paese con 60 milioni di abitanti. Ogni affermazione del governo ha una ripercussione. La manovra economica del governo non è ancora chiara. Di certo si sa soltanto che i soldi per mettere in atto il programma elettorale non ci sono. Ed ecco quindi che si deve ricorrere al debito.\n\n* * *\n\nIl problema non sono di per sè i soldi in prestito. Il problema è la credibilità di un governo che attacca tutto e tutti preventivamente senza valutarne gli effetti e le conseguenze. Il gridare al complotto speculativo non fa altro che alimentare la speculazione. Perché c’è chi in questi giorni sta scommettendo al ribasso del debito italiano e al suo downgrade, ossia all’abbassamento del rating, proprio per le affermazioni del governo.\n\nDi fatto questo abbassamento è già stato scontato dal mercato. L’innalzamento dello spread di 150 punti base sta già costando allo Stato per lo meno 1 punto percentuale in più all’anno nei rendimenti dei nuovi titoli in emissione, ossia maggiori spese per interessi. Di fatto la politica che a parole si voleva espansiva sta determinando che nel futuro dovremo pagare maggiori interessi riducendo in concreto la quantità di denaro disponibile per la spesa dello Stato. Ma l’aspetto economico è probabilmente il meno grave. Fa parte di una strategia politica ben precisa. Perchè un peggioramento del costo del debito italiano significa meno risorse da spendere e necessariamente un peggioramento delle condizioni per l’accesso al credito dell’economia italiana. La strategia politica è quella di tenere il Paese bloccato a pensare che ci sia un complotto internazionale che vuole strozzare l’Italia facendo in modo che la politica economica determini un peggioramento finanziario di cui si possa accusare qualche potere estero che gestisce il complotto (Soros, Bce, Troika, Commissione europea, ecc.).\n\nNel frattempo si fa in modo di indirizzare le difficoltà in cui si trova e si troverà sempre di più la popolazione a cause che non hanno nulla a che fare con quel problema. Prima fa tutte l’immigrazione. Si vuole fare in modo che le persone pensino che è il diverso, lo straniero che ci fa vivere male. Si vuole che le persone attribuiscano tutti i loro problemi di qualunque natura, la colpa di tutto ciò che non va a qualcun altro.\n\nSalvini dice di lavorare per gli italiani da buon padre di famiglia che protegge la casa e i figli. Che chiude la porta di casa per proteggerli.\n\nSalvini legittima un pensiero razzista e fascista.\n\nPerché viene costruita una realtà che non esiste e affermata con slogan che non hanno senso. Dire “aiutiamoli a casa loro” significa implicitamente dire che il Paese Italia è “casa nostra”. come dire che è una proprietà privata. È un assurdo assoluto. Viene proposto di eliminare completamente il concetto di Stato e di istituzioni che non sono la proprietà di nessuno. La Costituzione italiana stabilisce e garantisce diritti e doveri dei cittadini. Ma il termine “cittadino” si deve estendere a chiunque si trovi sul territorio dello Stato. È la Corte costituzionale che lo ha stabilito. Per lo Stato italiano vengono sempre prima le persone e non esiste un concetto di proprietà dello Stato da parte di qualcuno.\n\nPer quanto Salvini e Di Maio abbiano ampiamente vinto le elezioni questo non significa che siano diventati i “proprietari del Paese”. Fateci caso.\n\nLa loro proposta politica quotidiana è proprio questa: “Ora che siamo noi quelli che decidono, ora che siamo i proprietari, tutti dovranno fare quello che diciamo noi, per il bene di tutti”. e forse è proprio per questo che il clima è così pesante. Anche perché certe notizie sembrano confermare questa idea. Dalla circolare del ministero dell’Interno che stabilisce lo spostamento coatto dei migranti di Riace (poi rettificato perché illegale) alla sindaca leghista di Lodi che esclude dei bambini dalla mensa scolastica perché “non italiani”. Oppure quando Salvini parla di 60 milioni di italiani che sarebbero con lui. Quando sono a malapena 16 milioni quelli che hanno votato per lui e Di Maio. Esiste ancora la Costituzione, esiste una magistratura indipendente, dovrebbe esistere anche un’opposizione parlamentare anche se sembra scomparsa. Esistono soprattutto le persone, italiani o non italiani non ha alcuna importanza, che si oppongono a questa narrazione tossica e manipolatoria. Una opposizione spontanea che si ribella a questa violenza come necessità personale di affermazione di una identità di essere esseri umani.\n\nQualche giorno fa ho visto sulla Rai il bellissimo e drammatico documentario di Alberto Angela sul campo di concentramento nazista di Auschwitz. Non ricordo bene quando ma a un certo momento viene proposta l’idea che il grande pericolo, quello cui dobbiamo stare attenti per evitare il ripetersi di simili catastrofi sia l’odio.\n\nL’odio per l’altro, il diverso, lo straniero.\n\nIn realtà non è così. L’odio può determinare la violenza, questo sì. Ma il vero pericolo per la democrazia è quando l’azione di aggressione all’altro si realizza senza effetti. È quello che ha realizzato il “nazismo”.\n\nSalvini che manda i suoi tweet in cui fa affermazioni violentissime e finisce la frase con “un bacione”: quella mancanza di empatia, di sentire la realtà umana dell’altro, non è odio. È una politica priva di affetti.\n\nSalvini, come lui stesso dice, non odia nessuno. Fa il suo lavoro meticolosamente. È quando la realtà umana diversa da se stessi non esiste più, quando viene annullata, fatta scomparire che si perdono gli affetti.\n\nChi ha la pelle scura, lo straniero, la donna, il diverso perdono la qualità di essere esseri umani. È un pensiero freddo e razionale. Pensiero lucido che deve gestire un “problema”. L’odio non c’è affatto.\n\nIl grande pericolo è questo. La disumanità c’è quando si sono persi tutti gli affetti. Anche l’odio.\n\nRestare umani significa ribellarsi all’anaffettività.\n\n* * *\n\nData: ottobre 2018"
		},
		{
			"post_id": 18,
			"title": "Il caso Cucchi spiegato ai miei studenti",
			"date_published": 1551371829.934,
			"body": "«Prof, ma lei cosa ne pensa del caso Cucchi?». I ragazzi oggi soffrono di un vuoto di politica (nel senso più specifico del termine), ma non smettono di avere occhi per vedere quello che accade. E quando si tratta di casi singolari l’attenzione aumenta. È più facile immaginarsi di provare quel che ha provato un altro ragazzo che non proiettarsi in scenari più astratti, dove a lavorare è la mente del cuore. Così, casi come quello di Cucchi stimolano la curiosità: com’è possibile essere vittima di chi ti dovrebbe proteggere?\n\n* * *\n\n«Cosa sapete voi?», chiedo.\n«Lo hanno ucciso», dice uno.\nÈ il giorno della deposizione di un carabiniere che finalmente ammette il pestaggio letale.\n«Cosa avreste fatto voi se aveste assistito a un fatto del genere?».\n«Lo avrei detto».\nEcco, perché per anni e anni c’è stata omertà? Perché nessuno ha detto? Il nome di Aldrovandi viene richiamato per associazione, non tutti lo conoscono. Anche in quel caso solo l’ostinazione di un famigliare ha avuto ragione di quei silenzi complici. Ma allora è un fatto di responsabilità individuale o ha a che fare con qualcosa di più grande, di strutturale? Racconto delle tante storie che ho ascoltato negli anni, a cominciare da quelle dei centri di detenzione per immigrati irregolari su cui scrissi un libro dodici anni fa. Quel libro aveva in esergo la dichiarazione di un ispettore di polizia, di nome Michele Pellegrino, che aveva lavorato in un centro pugliese: «Nessuno sapeva di aver vinto un concorso per fare il guardiano di un lager», aveva detto, «Facciamo i guardiani di povera gente». Ecco, dopo quella dichiarazione ebbe un provvedimento disciplinare. Ma per tutti i numerosi casi di pestaggi ai danni di immigrati di cui raccontavo nel libro nessuno è mai stato punito, e nemmeno perseguito.come d’altronde nel caso delle violenze di Genova, quando i responsabili sono stati magari allontanati dalla città in cui operavano ma pure promossi. Qualcuno dei ragazzi ha visto il film Diaz, e di fronte a quella ferocia esibita c’è poco da parlare. Racconto che quella notte stavo per andare a dormire lì, e solo per un caso andai altrove. Questo richiama il fatto che in Italia non siamo mai riusciti a far passare una norma di civiltà, di responsabilità personale, come il numero di identificazione sulle divise delle forze di polizia.\nQuanto tutto questo ha a che fare con la storia della nostra Repubblica? Lo storico Ginsborg ha parlato di “continuità dello Stato” a proposito del passaggio tra fascismo e Repubblica, in ordine alla continuità di leggi, istituzioni e personale dell’amministrazione, compresi prefetti, questori e uomini della polizia. È un elemento utile per capire che ciò di cui stiamo parlando va inscritto in una prospettiva di lungo periodo? Stavo facendo politica, direbbe Salvini. Sì, e lo rivendico. Ma non politica in senso partitico. Faccio politica nel senso più vero del termine, nel senso aristotelico, perchè nessuno vive rinchiuso nel suo orticello ma è parte di una comunità e ha precise responsabilità etiche nei confronti degli altri esseri umani. Si tratta, semplicemente, di garantire i diritti sanciti dalla Costituzione.\nArticolo 2: «La Repubblica riconosce e garantisce i diritti inviolabili dell’uomo».\nArticolo 3: «Tutti i cittadini sono eguali davanti alla legge, senza distinzione (...) di condizioni personali e sociali».\nArticolo 13: «È punita ogni violenza fisica e morale sulle persone comunque sottoposte a restrizioni di libertà».\nRipartire dalla Costituzione come patto fondativo della Repubblica oggi appare più che mai necessario. Meditare insieme su quegli articoli legandoli non solo ai fatti di cronaca e di attualità, ma anche agli stessi eventi della storia passata. Riconoscere in quella carta fondativa della Repubblica dei valori e dei principi di giustizia universali, e riconoscere quanto si discostino da essi tutta una serie di pratiche politiche e sociali del presente.\nE poi capire, magari, che trascendono la legge stessa, in quanto frutto della volontà comune di uomini e donne che nello storia hanno agito in quanto forza collettiva per affermarli.\n\n* * *\n\nFonte: rivista pubblicata nel mese di ottobre 2018"
		},
		{
			"post_id": 17,
			"title": "La linea di confine",
			"date_published": 1551346892.535,
			"body": "Ingoiato il salvataggio del ministro dell’interno da parte della piattaforma Rousseau e della giunta del senato per le autorizzazioni a procedere, e in attesa del suo salvataggio definitivo da parte dell’aula, è bene ribadire cosa è in gioco nel caso Salvini e quale precedente sta scrivendo il parlamento italiano per tenere unita con la colla l’alleanza di governo tra Lega e 5Stelle.\n\n* * *\n\nNon è difficile. Bastano tre cose: leggere la legge costituzionale 1/89 che regola la materia dei reati ministeriali; leggere la relazione, chiarissima, con cui il tribunale dei ministri di Catania ha motivato la richiesta dell’autorizzazione; confrontarla con il fragore mediatico sollevato da uomini di governo, avvocati del popolo e giornalisti allineati per confondere le acque.\nSecondo la legge, il Senato (o la Camera) può negare l’autorizzazione a procedere contro un ministro solo nel caso in cui abbia commesso il reato per il quale è indagato - nella fattispecie il sequestro di 177 persone - nel contesto di un “atto politico” giustificato da un “prevalente interesse nazionale”. E questo sarebbe il caso secondo la suddetta compagnia di giro: Matteo Salvini - e con lui tutto il governo, chiamandosi generosamente in correità - avrebbe agito “politicamente” per il bene supremo della sicurezza dello stato.\nPeccato che i magistrati chiariscano, codici, costituzione e trattati internazionali alla mano, che per “atto politico” s’intende una rosa limitatissima di decisioni di rango istituzionale e di indiscutibile valore generale, che non possono comunque ledere un diritto inviolabile come la libertà personale. Mentre nel caso della nave Diciotti si tratta di una ordinaria decisione amministrativa, presa da Salvini sulla base dell’orientamento politico e del governo in materia di immigrazione.\nPreservando Salvini dal processo, il parlamento italiano stabilisce il pericoloso precedente per cui una linea politica di parte può investirsi dell’interesse generale e a questo fine usare ogni mezzo, compresa la violazione di un diritto fondamentale.\nIl salvataggio dell’alleanza di governo è niente al confronto di questo precedente, che rimette implicitamente in questione la linea di confine che passa tra uno stato di diritto e uno stato autoritario."
		},
		{
			"post_id": 16,
			"title": "Combattere l'antisemitismo",
			"date_published": 1551345455.019,
			"body": "L’antisemitismo è l’esempio più chiaro di una società minata dall’odio. Il suo aumento in Europa è sintomo di una malattia, ma anche di qualcosa di più profondo e terribile: l’ignoranza del passato. Tutte le forme di razzismo vanno condannate, ma purtroppo si conoscono con certezza le conseguenze dell’antico odio nei confronti degli ebrei: il più grande crimine della storia.\n\n* * *\n\nDi recente i responsabili del museo del museo di Auschwitz-Birkenau hanno scritto sui social network: «Quando guardiamo Auschwitz vediamo la fine di un processo. Bisogna ricordare che l’olocausto non è cominciato con le camere a gas. L’odio è cresciuto gradualmente a partire dalle parole, dagli stereotipi e dai pregiudizi, attraverso l’esclusione legale, la disumanizzazione e un’escalation di violenza».\nOggi i numeri non potrebbero essere più preoccupanti. Nei giorni scorsi il governo francese ha rivelato che nel 2018 gli atti di antisemitismo (insulti, minacce, aggressioni e omicidi) sono aumentati del 74 per cento, dopo due anni in cui erano diminuiti. Un ampio sondaggio dell’Agenzia europea per i diritti fondamentali condotto tra gli ebrei di dodici paesi ha rivelato che secondo l’85 per cento degli intervistati la situazione è peggiorata negli ultimi anni.\nNon si tratta solo della destra radicale, degli estremisti islamici o di movimenti difficilmente definibili dal punto di vista ideologico come i Gilet gialli. Il problema è che la normalizzazione dell’antisemitismo ha spinto governi come quello ungherese di Viktor Orbàn a lanciare campagne contro George Soros rispolverando gli elementi più inquietanti dell’odio contro gli ebrei.\nQuesta tendenza può essere invertita solo con la vigilanza e l’istruzione. Nel frattempo, i paesi hanno l’obbligo di combattere l’antisemitismo con tutti i mezzi possibili e segnalare tutti quelli che non lo fanno."
		},
		{
			"post_id": 15,
			"title": "Giochi di prestigio",
			"date_published": 1551344072.861,
			"body": "Il cambiamento è un gioco di prestigio. Nella nota in appendice a Nondimanco (Adelphi 2018), un bel libro di Carlo Ginzburg, si trovano accostate in maniera del tutto nuova due formule antitetiche.\n\n* * *\n\nLa prima compare nei “Discorsi” di Machiavelli: quando si dà nuova forma allo stato di una città, bisogna conservare l’ombra almeno nei modi d’essere del passato. La seconda è di Tomasi di Lampedusa e la pronuncia Tancredi nel “Gattopardo”: «Se vogliamo che tutto resti com’è, bisogna che tutto cambi». colpisce che, pur rovesciando Lampedusa la prescrizione di Machiavelli nel suo contrario, resiste l’idea, anch’essa machiavellica, che il cambiamento esige la gestione avveduta delle apparenze. Perchè le cosa cambino, dice Machiavelli, bisogna dare l’impressione che non tutto cambi. Perchè niente cambi, dice Tomasi di Lampedusa, bisogna dare l’impressione che tutto cambi. Sia il buon esito della rivoluzione sia quello della conservazione sono insomma fondati su una sorta di prestidigitazione. Se il mago non possiede quest’arte, nessun gioco che abbia a che fare col cambiamento riesce. I maghetti di turno oggi sembrano bravi con le apparenze, stanno sempre in video a nascondere esibendo, a esibire nascondendo. Eppure, durante i loro esercizi illusionistici, viene sempre più in mente la domanda che i cambiamenti felici non dovrebbero suscitare: stiamo cambiando in peggio?"
		},
		{
			"post_id": 12,
			"title": "Padroni a casa d'altri",
			"date_published": 1551205621.513,
			"body": "L’attacco di Di Maio a Macron, additato come unico responsabile dei mali d’Africa e delle partenze dei migranti, è solo l’ultimo atto di una sfida tra imperialismi. Prassi in cui l’Italia neoliberista di oggi si differenzia ben poco da quella fascista e coloniale.\n\n* * *\n\nE chi glielo spiega adesso a Luigi Di Maio che con queste accuse di neocolonialismo a Macron sta combinando un’ambaradan? «Una parola così sbarazzina... una reminiscenza abissina», per citare i versi del cantautore anarchico, Alessio Lega. Perchè l’Italia e lìEuropa hanno i loro scheletri nell’armadio e fuori dagli armadi quei processi agiscono potentemente anche dopo la decolonizzazione. Le schermaglie verbali tra Di Maio e Macron sono l’effetto di una concorrenza spietata tra Parigi e Roma piuttosto che il segnale di una diversità di approccio alla questione africana. Mentre il vicepremier a cinque stelle continua a provocare l’Eliseo perchè «pensi a decolonizzare l’Africa», il suo premier Giuseppe Conte gira tra Ciad e Niger e poi vola negli Emirati a supportare le imprese italiane ed Eni - mentre scriviamo - annuncia di aver messo le mani sugli impianti di raffinazione di Abu Dhabi, la più grande operazione mai condotta da quelle parti da un investitore straniero. Tutto ciò mentre i vertici del cane a sei zampe sono sotto processo per la maxi tangente in Nigeria.\n\nContinuiamo ad ascoltare Lega, nel senso di Alessio: «Che cosa mai vorrà dire “ambaradan”? / Colonialisti più bravi e più forti / abbiam portato le strade nel deserto / per il grande viaggio di tutti quei morti / L’Amba Aradam è la macchia dell’oblio / è il monumento a Rodolfo Graziani / i gagliardetti di Nassiriya / sono i due marò che fucilano gli indiani». Ventimila i morti etiopi e poche centinaia di italiani nel febbraio del 1936 all’Amba Aradam: una carneficina. Se ieri l’Italia non aveva nulla da invidiare alla capacità stragista di altri colonialismi («siamo stati i primi a usare i gas contro i civili», segnala Gabriele Proglio, giovane storico dell’Università di Coimbra che lavora su memoria, migrazioni, confini e dunque colonialismo), anche nelle pratiche neocoloniali siamo in prima fila. Prendiamo il land grabbing - il “controllo” delle terre da parte di imprese straniere - stando al report realizzato dalla Ong Fian International, a fine 2015 l’Italia, era al terzo posto tra i Paesi europei, con 615mila ettari, preceduta da Francia (629mila) e Regno Unito (2,5 milioni). Terra che servirà a sfruttare riserve naturali, o per la coltivazione intensiva, per il biocarburante, per villaggi turistici o città nuove di zecca. L’Africa possiede il 30% delle riserve naturali ma esprime solo il 3% del Pil mondiale. E poi ci sono Turchia, Arabia Saudita, Cina (il cui interscambio commerciale con l’Africa cresce del 20% l’anno), Canada, Brasile, Giappone e le 34 basi Usa tra Libia, Sahel e Corno d’Africa impegnate nei processi di guerra, concorrenza, depredazione, cambiamento climatico che hanno prodotto 50 milioni di profughi che solo in minima parte arrivano in Europa. In poche parole, le politiche neocoloniali in Africa sono la presenza coloniale nella decolonizzazione, con il loro carico di corruzione, diseguaglianze, sviluppo sregolato.\n\nSpiega ancora Proglio che i processi di adesso sono simili a quelli che favorirono nel 1869 l’acquisto della Baia di Assab da parte di una compagnia privata italiana, la Rubattino, per realizzare il Canale di Suez, «è l’inizio del colonialismo nel Crono d’Africa dove ora succede che Impregilo, un pezzo della cordata Tav, si gioca la partita della costruzione sul fiume Nilo di Gibe III, la più grande diga del continente, mettendo a rischio l’autonomia alimentare di più di mezzo milione di persone».\nCome abbiamo documentato più volte, l’Italia traffica armi in tutti i principali teatri di guerra (per esempio quelle usate dai sauditi nello Yemen), e i suoi grandi marchi fanno sgobbare adulti e minori con paghe da fame in Asia e Africa, Eni e Total si fanno la guerra in Libia.\n\n«Aiutiamoli a casa loro - continua lo storico - non è poi così diverso dal “civilizziamoli” di cento anni fa». anche il neocolonialismo è capace di suggestioni, sentite come suona bene: Agenzia italiana per la cooperazione e lo sviluppo. Si tratta dello strumento che presta soldi pubblici a 22 governi perchè predispongano acquisti, commesse, privatizzazioni per le aziende italiane indebitandosi per sempre. Infatti il primo a gettare acqua sul fuoco è Alfredo Gestari, presidente della Camera di Commercio Italo-Africana: «Da parte del governo critiche inutili e dannose per le imprese italiane in Africa. Queste tensioni hanno già creato ripercussioni negative. Se vogliamo sottrarre aree agli imprenditori francesi dobbiamo lavorare meglio di loro».\n\nIl neocolonialismo è il neoliberismo, insomma, «è un ordine economico che produce impoverimento, ti imponi con il diritto della forza e non con la forza del diritto anche quando le politiche sono formalmente pacifiche», ci spiega Alessandro Somma che insegna Diritto comparato a Ferrara. Il suo ragionamento parte dal «dispositivo neoliberale dell’Ue, basato sulla libertà di circolazione dei capitali (quattro paradisi fiscali su dieci sono proprio in Europa), che costituisce economie tutte rivolte all’esportazione, condannate a competere: queste politiche si basano sulla contrazione dei salari (che genera persone non in grado di consumare) e defiscalizzazione delle imprese (che azzerano il welfare) in modo da poter essere aggressivi sui mercati esterni. Così il colonialismo produce ricchezza ma anche l’impoverimento dei lavoratori nei suoi Paesi».\nDinamiche che lo stesso Somma approfondisce in “L’Europa a due velocità. Postpolitica dell’Unione Europea” (Imprimatur) e che spiegano, ad esempio, perchè la Germania pesa sulle sue “colonie” dell’Europa dell’Est ma ha anche otto milioni di mini-job dentro le sue frontiere. «Non ci sono le “grandi proletarie” - conclude Somma - ma tanti proletari poveri e poverissimi».\nQuesto non assolve Macron o i suoi predecessori, ma l’anticolonialismo in chiave antimigranti non si addice a un governo come quello italiano. «Ma quello che dice Di Maio è vero al 100%, e non era mai successo che lo dicesse un uomo di governo. Sì lo sappiamo che fra tre mesi ci sono le elezioni ma almeno l’ha detto ad alta voce», ci dice Issa Nouredine, 38enne del Togo, attivo a Cremona nella rete per l’integrazione. L’attivista ci spiega sia come il Franco Cfa inchiodi il suo e altri 13 Paesi alle politiche di austerità impedendo manovre espansive, sia come la Francia saccheggi il Togo della sua ricchezza maggiore, il fosfato. «Sylvanus Olympio, il primo presidente, fu assassinato perchè si opponeva al Cfa e ora governa dal 2005 il figlio di quel Gnassingbè Eyadéma che si vantava di avergli sparato. Dal 19 agosto l’opposizione del mio Paese è in piazza per chiedere uno sviluppo vero. Ma come può attuarlo se le riserve monetarie sono nella Bance centrale francese e se Parigi addestra i militari che praticano la repressione?» si domanda Issa, mentre elenca i nomi dei consiglieri di Stato per la polizia, i servizi e la gendarmeria. Tutti francesi. Inoltre, è per tangenti per ottenere concessioni portuali in Togo e in Guinea Conakry che è indagato il magnate francese Vincent Bolloré. Il Togo è anche lo scalo portuale più importante dell’area. «La fame è come la guerra», conclude Issa collegando la mancanza di democrazia alle pratiche del neocolonialismo e alla fuga della sua generazione.\n\n«La storia di questo periodo - avverte Proglio in fondo a una discussione più ricca di quanto possa entrare in un articolo - verrà raccontata, da questa o da quella sponda del Mediterraneo, come quella delle generazioni, la mia come quella dei ragazzi che sbarcano a Lampedusa, a cui si è sottratto il futuro. Ci guarderemo indietro fra vent’anni e capiremo che il futuro avremmo potuto conquistarlo insieme»."
		},
		{
			"post_id": 11,
			"title": "Nel Paese della bugia la verità è rivoluzionaria",
			"date_published": 1551193938.591,
			"body": "«È finita la pacchia» dice il ministro dell’Interno Salvini irridendo chi rischia la vita per raggiungere l’Italia e lavora come uno schiavo del caporalato nelle nostre campagne. «Hanno 17 anni e restano a bordo» sentenzia Salvini, cieco e sordo ai messaggi degli stessi siracusani che urlano e scrivono «Fateli scendere» su lenzuoli bianchi appesi alle finestre. «Non è roba nostra, se li prendano i Paesi Bassi», insiste lui riferendosi ai minorenni a bordo della Sea Watch da giorni in balìa del mare. Il linguaggio carico di odio, sempre più violento, di esponenti di governo rimbomba ogni giorno nelle nostre orecchie.\n\n* * *\n\nRivolto a migranti, rom, giovani come Arafet, cittadini italiano di origine tunisina che ha perso la vita durante un fermo della polizia. «Dovevano dargli un cappuccio e brioche?» ironizza il Capitano che poi inneggia alle forze dell’ordine che hanno salvato una gatta, promettendo pene severe per chi voleva uccidere... la povera gattina. È un eufemismo definire spregiudicata la propaganda orchestrata dai social media manager al servizio di Salvini. Difficile non pensare a certe fotografie dei nazisti che accarezzavano amorevolmente figli e cani, mentre sterminavano bambini ebrei come fossero cose, oggetti inanimati. Operazione comunicativa lucida, decisa a tavolino, spietata. Ma anche noi commentatori rischiamo di essere complici quando diciamo che è un’operazione studiata per accaparrarsi voti, quando ripetiamo che lo fa per ottenere consenso. Come se fosse normale ottenere consenso con frasi che incitano all’odio e con provvedimenti che vanno contro i valori antifascisti della Costituzione, come quelli contenuti nel decreto “immigrazione e sicurezza” che negano i diritti ai richiedenti asilo e impongono una feroce stretta alla protezione umanitaria.\nIl fascismo è UR-Fascismo, è endemico ed eterno, diceva Umberto Eco. Noi non pensiamo che sia innato, ma che allora come ora, una parte della società italiana, quella che si bea del revanscismo reazionario si sia gravemente ammalata, al punto da aver perso il proprio volto, al punto di aver perso ogni sensibilità e capacità di sentire. C’è qualcosa di patologico in questo consenso che cresce, almeno nei sondaggi, in modo proporzionale alla violenza del discorso politico legastellato. Ma c’è anche qualcosa di patologico nel trasformismo camaleontico di politici del centrosinistra che hanno dato avvio a tutto questo e oggi si fingono anime belle. E allora ci appare sempre più importante, contro questa ubriacatura di amnesia collettiva, tornare spesso a rimettere in fila i fatti, ricordare le cifre del genocidio nel Mediterraneo di cui ci stiamo rendendo tutti responsabili stando in silenzio. Ci pare fondamentale farlo riportando in primo piano le voci, l’identità, le storie di chi è annegato perché l’Europa e questo infame governo si sono voltati dall’altra parte.\nGli sbarchi sono diminuiti, Minniti e Salvini, fanno a gara nell’attribuirsene il “merito”, ma non dicono che se fino a pochi anni fa annegava nel Mediterraneo una persona su 39 ora ne scompare una su 6\\. è una palese menzogna affermare che nel Mediterraneo si muore perchè ci sono le Ong come ha detto il ministro dell’Interno accusato di sequestro di persona aggravato per aver impedito lo sbarco di profughi dalla nave Diciotti. È vero l’esatto contrario, si muore perchè le Ong non ci sono più, si muore a causa delle criminali politiche di chiusura dei porti e degli accordi con la Libia. Pesa su questo governo la responsabilità delle 170 persone annegate in due giorni a metà gennaio, ma anche la responsabilità delle centinaia di persone che sono state ricacciate nei lager libici. Fotografie agghiaccianti sono circolate anche nei giorni scorsi che mostrano persone in catene, con i segni di torture. “Si prega di chiudere gli occhi”. Lo pretende Matteo Salvini brandendo Vangelo e rosario. Con lui il devoto di padre Pio Giuseppe Conte. Ma anche il ministro delle Infrastrutture Toninelli che con un grottesco ribaltamento della realtà si appella ai trattati internazionali, che quasto governo ha ampiamente violato, rinnegando il millenario diritto del mare e uccidendo qualsiasi forma di umana solidarietà. Per tentare di rifarsi una verginità in vista delle elezioni europee, il ministro Luigi Di Maio attacca la Francia additandone gli interessi neocoloniali in Libia.\nCome se l’Italia non ne avesse. Non sa il giovane ministro che si vanta di non essere laureato che la Libia ha assunto la forma imposta dal colonialismo italiano? Non sa che gli italiani sono stati i primi a usare i gas contro i civili? I fascisti italiani sono responsabili di un genocidio in Cirenaica, perpetrarono uno sterminio di massa in Etiopia.\nLa storia del colonialismo è lunga e agghiacciante, ha caratterizzato il fascismo ma anche le epoche precedenti. E in forme moderne il colonialismo italiano, francese, europeo e delle altre potenze continua ancora oggi sotto forma di land grabbing, di sfruttamento delle risorse da parte delle multinazionali, di esternalizzazione delle frontiere e di costruzione, diretta o indiretta di disumani campi profughi e luoghi di detenzione per migranti. Numerosi e approfonditi articoli su questo blog ricostruiscono il panorama del neocolonialismo del nuovo millennio, riallacciando i fili con il passato.\nConoscere, approfondire, tornare a raccontare come fu compiuto lo sterminio è un impegno più che mai imprescindibile. Raccontare le storie dei migranti, capire perchè sono costretti a lasciare le loro terre, quali sono le nostre responsabilità è un impegno civile prioritario.\nRisuonano come una denuncia fortissima le parole della senatrice Liliana Segre: «Noi ebrei eravamo senza nome, oggi percepisco la stessa indifferenza verso i migranti».\nNon accettiamo di chiudere gli occhi."
		},
		{
			"post_id": 10,
			"title": "Come smontare da sinistra la propaganda giallonera, in poche mosse",
			"date_published": 1551176664.307,
			"body": "### Il reddito di cittadinanza in versione Cinque Stelle ha tutti i difetti del mondo più uno.\n\nEppure è difficile criticarlo, perchè mette sei miliardi sulla lotta alla povertà, quando quelli di prima avevano giurato che non fosse possibile. Lo stesso dicasi per la Quota 100 modificata. È lontanissima da qualsiasi promessa elettorale, ma è difficile sostenere che non si tratti di un passo in avanti, laddove si era sempre detto che fossero possibili solo salti all’indietro. Sono misure irresponsabili che mettono a rischi i conti dello Stato? Probabile, ma non abbiamo mai sentito grandi giornali e Confindustria lamentarsi quando i bilanci si facevano pericolanti per il peso delle prebende elargite ad una classe possidente parassitaria e ingorda.\n\n* * *\n\nDico questo perchè conquistato dalla propaganda governativa? No di certo. Semplicemente mi sconcerta l’idea che si possa pensare di opporsi a provvedimenti contraddittori mettendosi dalla parte del privilegio. Per chi ha lavorato 38 anni è infatti un insulto sentirsi dire che la sua fatica è tempo rubato ai più giovani. Per chi è impoverito è inaccettabile sentirsi accusare di pigrizia, furbizia e scarsa propensione all’impegno.\nChi ragiona in questo modo, dimostra soltanto di essere completamente scollegato da un Paese travolto da 30 anni di crescenti ingiustizie e disuguaglianze, su cui la crisi è passata come uno tsunami, cancellando ciò che resisteva traballando del “benessere” passato.\nCi ha consegnato un panorama di giovani senza prospettive diverse dall’espatrio, di anziani sempre più numerosi e privi di mezzi, di un’età di mezzo privata della prospettiva della classe media. Ha lasciato dietro di sè cinque milioni di poveri e trenta milioni di persone convinte di aver subito un torto, senza nemmeno capire bene da chi.\nÈ a loro che parlano i provvedimenti del governo, cogliendo un elemento di soddisfazione psicologica prima ancora che materiale. Esattamente come fecero gli 80 euro di Renzi, lasciano intendere che sia arrivato il momento della restituzione e del risarcimento del danno subito.\nAiuta ovviamente molto il fatto che chi li critica sia ritenuto giustamente responsabile di quel danno.\nAllora io sono per cogliere questo elemento, ma per dire senza reticenze che non basta, che è stato fatto poco e che è stato fatto male.\nChe il reddito di cittadinanza non sia il peggiore dei mali, ma che si potrebbe fare di più, escludendo le assurde vessatorie con cui il M5s ha voluto omaggiare i critici. Uscire dalla povertà è infatti un diritto in uno dei Paesi più ricchi del mondo, anche senza la necessità di trasferirsi a mille km di distanza.\nChe ridurre il tempo di lavoro è corretto, ma dovrebbe avvenire anche in termini di orario settimanale e non solo di età di pensionamento.\nChe soprattutto non può essere tutto ridotto a chi avrà la fortuna di maturare i requisiti nei prossimi tre anni, lasciando giovani di ieri e di oggi a un destino di povertà certa dopo il ritiro. Vale anche per loro il diritto a una vecchiaia serena, e si deve quindi prevedere un minimo di 1500 euro netti per tutti coloro che abbiano versato almeno 30 anni di contributi.\nSi può fare questo e molto altro, a partire da un piano straordinario di assunzioni nella scuola, nella sanità, nei servizi per l’infanzia, la terza età e la non autosufficienza.\nÈ necessario semplicemente il coraggio di fare ciò che la destra della Lega e del M5s non avranno mai il coraggio di fare: attaccare i veri privilegiati, che sono quelli che si sono arricchiti mentre tutti si impoverivano. Serve una seria tassa patrimoniale sulle grandi ricchezze, serve recuperare alla collettività le rendite generate dai servizi essenziali, serve tassare la speculazione di ogni tipo e recuperare l’immensa evasione fiscale, vero furto ai danni di noi tutti.\nCome vedete, non è difficile immaginare un’altra opposizione.\nCominciamo a farla."
		},
		{
			"post_id": 9,
			"title": "Capricci",
			"date_published": 1551117727.393,
			"body": "A prima vista sembra una sciocchezza: lasciarsi scappare un’azienda pronta a creare 25mila posti di lavoro. Ma se si guarda bene, la realtà è più complicata. Da una parte c’è Amazon, la più grande azienda statunitense (800 miliardi di dollari di valore in borsa), di Jeff Bezos, l’uomo più ricco del mondo (133 miliardi di patrimonio personale). Dall’altra ci sono i 60mila abitanti di Long Island City, un’ex area industriale di fronte a Manhattan. Nel 2017 Amazon, che ha sede a Seattle, aveva annunciato l’intenzione di costruire un secondo quartier generale e aveva messo in competizione tra loro le città americane per vedere chi offriva più incentivi.\n\n* * *\n\nNew York, di cui Long Island City fa parte, aveva offerto tre miliardi di dollari e alla fine l’aveva spuntata. Ma Amazon non ha mai avuto molta pazienza con le aziende locali. Quando l’anno scorso Seattle ha proposto una tassa per finanziare gli aiuti ai senzatetto, Amazon ha minacciato di bloccare gli investimenti e il comune ha fatto marcia indietro. Molti abitanti di Long Island City, sostenuti da politici come Alexandria Ocasio-Cortez, hanno espresso i loro timori per le possibili conseguenze dell’arrivo di Amazon: aumento del costo della vita e degli affitti, sovraffollamento delle scuole, collasso del traffico. Tutti problemi che città come San Francisco e Oakland vivono da anni. A questo si è aggiunto il rifiuto di Amazon di consentire ai futuri dipendenti di iscriversi ai sindacati. Non sentendosi accolta come avrebbe voluto, il 14 febbraio la società di Bezos ha deciso di ritirarsi (lo stesso giorno è uscita la notizia che per il 2018 Amazon non dovrà pagare tasse federali anche se ha avuto 11,2 miliardi di dollari di profitti). Bill de Blasio, sindaco democratico di New York, all’inizio favorevole all’arrivo di Amazon, ha provato a parlare con Bezos per avere spiegazioni. Ma non c’è riuscito. E sul New York Times ha scritto: “Amazon ha fatto i capricci, di fronte alle proteste ha preso il pallone e se n’è andata”."
		},
		{
			"post_id": 8,
			"title": "Se la matematica è rivoluzionaria",
			"date_published": 1546420357,
			"body": "### Recensione del libro «Le 17 equazioni che hanno cambiato il mondo» di Ian Stewart\n\nUn’equazione può cambiare il corso della storia? Per quanto possa sembrare una domanda provocatoria, che implica un ruolo cruciale della matematica nelle vicende umane, la risposta è affermativa. In effetti, è difficile immaginare il mondo di oggi se nel XIX secolo lo scienziato britannico James Clerk Maxwell non avesse stabilito delle relazioni matematiche tra i fenomeni del magnetismo e dell’elettricità in una serie di quattro equazioni che hanno previsto l’esistenza delle onde elettromagnetiche.\n\n* * *\n\nNon è stato solo un risultato scientifico epocale, le equazioni di Maxwell hanno costituito la prima importante unificazione di forze naturali, ma si è trattato anche di una pietra miliare nello sviluppo di tecnologie di cui oggi non possiamo fare a meno: dalle trasmissioni radiotelevisive al Wi-Fi, per fare due esempi. E proprio Maxwell è uno dei protagonisti di «Le 17 equazioni che hanno cambiato il mondo», libro di Ian Stewart allegato a richiesta con Le Scienze di febbraio (2019), che segnala la seconda uscita della nuova collana Frontiere, con libri di scienza tra i più interessanti tra quelli pubblicati di recente da case editrici italiane.\n\n**I segreti della natura**\n​​​​​​​Professore emerito di matematica alla Warwick University, autore di numerosi bestseller divulgativi, Stewart accompagna i lettori in un viaggio particolare nella storia della matematica e nella sua profonda influenza sulle nostre società. Le protagoniste, come recita il titolo, sono equazioni grazie a cui l’umanità ha fatto passi da gigante. Per ciascuna Stewart illustra il percorso che ha portato alla sua elaborazione e l’importanza nelle varie applicazioni che da essa sono state sviluppate, magari non sempre nell’immediato. Perché le equazioni possono svelare i segreti più intimi della natura, possono stabilire schemi con cui interpretare il mondo e magari intervenire per modificarlo a piacimento, ma può essere necessario del tempo per capire fino in fondo come sfruttare la potenza dei segreti svelati.\nAnzi, nelle storie raccontate da Stewart, spesso tra la definizione di un’equazione e le sue applicazioni passano decine e decine di anni, se non secoli.\n\n**Capisaldi della conoscenza**\n​​​​​​​Il viaggio nella storia delle equazioni inizia con una relazione conosciuta da tutti gli studenti: il teorema di Pitagora. Nella sua semplicità, questo teorema di oltre 2000 anni fa dimostra una relazione fondamentale tra i lati del triangolo rettangolo (la notazione sotto forma di equazione arrivò molto tempo dopo Pitagora, con lo sviluppo dell’algebra), che è stata fondamentale per lo sviluppo della cartografia e della navigazione.\nProseguendo su un’ideale linea temporale verso il presente il viaggio termina con l’equazione di Black-Scholes. Questo nome, non dirà nulla alla maggior parte delle persone, tuttavia l’equazione in questione è al centro degli andamenti più o meno turbolenti dei mercati finanziari del recente passato. (Per inciso, uno degli autori, Myron Scholes nel 1997 ha ricevuto il Nobel per l’economia per aver sviluppato questa equazione).\nTra l’inizio e la fine del viaggio, il lettore può incontrare altri capisaldi della conoscenza umana: dall’equazione della gravità di Newton all’equazione più famosa del mondo, E = mc^2 di Albert Einstein, dalla radice quadrata di -1 all’equazione di Schrödinger. E potrà apprezzarne l’importanza, concludendo che sì: un’equazione ha il potere di cambiare il mondo.\n\n*   * * * *\n\n* * *\n\nFonte: rivista Le Scienze (n. 605, gennaio 2019)"
		},
		{
			"post_id": 7,
			"title": "Al campionato mondiale di slalom tra i cavilli",
			"date_published": 1546300800,
			"body": "### Tra fondi sempre più esigui e burocrazia asfissiante, come muore la ricerca italiana.\n\nIl fondo ordinario del Consiglio nazionale delle ricerche, quel CNR fondato nel 1923 da Vito Volterra, è pari a 543 milioni di euro. Alla fine di ottobre – secondo i calcoli di Vito Mocella, ricercatore dell’Istituto per la microelettronica e microsistemi di Napoli e rappresentante del personale nel Consiglio di amministrazione dell’ente – considerando gli aumenti contrattuali e i fondi vincolati alla stabilizzazione dei precari, la spesa per il personale ammonta al 98,7 per cento del fondo ordinario.\n\n* * *\n\nMa c’è di più. Il CNR ha attestato in bilancio 83 milioni di euro di spese correnti che non sono coperte dal finanziamento ordinario. Si prevede che questi 83 milioni dovranno essere coperti, per il 2019, da prelievi forzosi sui progetti di ricerca. Come osservava Mocella, è come se si chiedesse agli agenti di polizia in servizio sulle volanti di pagare la benzina di tasca loro.\n\nAll’inizio di dicembre l’approvazione di un paio di emendamenti alla legge di bilancio ha garantito un aumento degli stanziamenti di circa 35 milioni di euro. Che sono stati salutati da qualche inguaribile ottimista come un rilancio della ricerca. In realtà quei 35 milioni bastano a malapena a coprire i fondi vincolati per le stabilizzazioni, ma non avanza nemmeno un centesimo per i 18 milioni degli aumenti salariali dovuti al rinnovo contrattuale. Morale, al bilancio del CNR mancano ancora 50 milioni per pagare stipendi, utenze, riscaldamento. Quanto alla ricerca, se proprio uno ci tiene deve trovarseli i fondi. E da quelli scalare la quota per pagare l’elettricità.\n\nIn questo nostro breve film dell’orrore sfumiamo a nero e ci troviamo in una scena del tutto diversa, all’apparenza. Siamo sul sito web dell’Università di Parma, dove alla fine di ottobre sono state pubblicate le “Linee guida per il processo di richiesta missione e richiesta rimborso”. Tre corposi file, complessivamente una sessantina di pagine, in cui viene descritta in dettaglio la procedura per essere autorizzati a una missione, come la partecipazione a un congresso, per esempio, un’attività che dovrebbe essere ordinaria amministrazione, per uno scienziato.\n\nPer farsi un’idea, sia molto superficiale, della perizia bizantina con cui sono state redatte, al paragrafo 3.4 si legge: «Il processo informatizzato prevede le seguenti 5 tipologie di flussi autorizzatori (corrispondenti a 5 diversi tipi di richiesta missione in U-WEB Missioni): DELRE – DELegati del Rettore; FASTR – Fondi di Altra Struttura di ateneo; FPROG – Fondi di PROGetto; FPSTR – Fondi di Propria STRuttura; FFORM – Fondi per la FORMazione». I codici per le singole spese sono 21.\n\nPer essere autorizzato a una missione e rientrare di tutte le spese, insomma, uun professore o un ricercatore deve vincere il campionato mondiale di slalom tra i cavilli. A meno che… «In caso di missioni senza spese a carico dell’Ateneo occorre barrare l’opzione ‘Missione senza spese’ nella sezione MISSIONE».\n\nE qui mi fermo. Perché delle magagne della ricerca italiana ha già parlato Roberto Defez sul numero di dicembre. A quelle, come si vede da questo scorcio aneddotico, si aggiunge l’agghiacciante riduzione della scienza a pubblica amministrazione, del ricercatore a contabile, in un crescendo rossiniano che ha come esito la morte della ricerca.\n\nThe end, titoli di coda, e buon anno anche a voi.\n\n*   *   *   *   *   *   *   *   *   +\n\nFonte: rivista **Le Scienze** 605 (Gennaio 2019)"
		},
		{
			"post_id": 6,
			"title": "Il fascino dello spazio vuoto",
			"date_published": 1550571884.759,
			"body": "### Recensione del libro «La fisica del nulla» di James Owen Weatherall.\n\nIl nulla può essere un territorio interessante e stimolante da esplorare, un ambito di ricerca in grado di generare risultati epocali per la nostra comprensione della realtà. Non è dunque un caso che questo concetto abbia impegnato alcune delle menti scientifiche più importanti del passato lontano e recente, come racconte James Owen Weatherall in «La fisica del nulla», libro allegato a richiesta con Le Scienze di marzo, la terza uscita della nuova collana “Frontiere”.\n\n* * *\n\nIl nulla che affronta Weatherall, professore di logica e filosofia della scienza all’Università della California a Irvine, è qualcosa di ancora più estremo di quello che oggi uno scienziato potrebbe chiamare vuoto spinto. È un palcoscenico privo di tutta la materia. Niente oggetti, niente molecole e atomi, niente quark né qualunque altra particella elementare. L’intuito potrebbe portare a pensare che su un palcoscenico simile non possa accadere niente, e invece.\nFu durante la prima metà del XX secolo che la fisica del nulla venne alla ribalta, un periodo rivoluzionario per la scienza, in cui teorie considerate valide da secoli dovettero cedere il passo a nuove descrizioni del mondo. La teoria ristretta della relatività e quella generale, elaborate da Albert Einstein, soppiantarono meccanica e gravitazione di Isaac Newton. Inizialmente le revisione fu necessaria per il successo della teoria della luce, dell’elettricità e del magnetismo formulata da James Clark Maxwell nell’Ottocento, portando alla relatività ristretta nel 1905\\. negli anni successivi Einstein posò lo sguardo sull’universo, arrivando nel 1915 alla relatività generale, che avrebbe preso il posto della gravità newtoniana. Spazio e tempo prima immutabili, come un contenitore pronto ad accogliere materia senza cambiare geometria, con Einstein diventarono una cosa sola, lo spazio-tempo, che poteva modificarsi anche senza la presenza di masse, minuscole o gigantesche che fossero.\nIn quegli anni rivoluzionari, esperimenti sui componenti più intimi della materia resero necessaria una nuova descrizione del mondo infinitamente piccolo: la meccanica quantistica. Anche questo nuovo quadro teorico portò a una nuova concezione del nulla, in particolare con la teoria quantistica dei campi - sviluppata tra gli altri da Paul Dirac e Richard Feynman - in cui il nulla diventa un palcoscenico dove possono apparire e scomparire particelle, dove il vuoto ha delle proprietà.\nIl nulla però non ha esaurito il suo fascino: custodisce un segreto che i fisici non riescono a svelare, la natura quantistica della gravità. Risolvere un mistero del genere permetterebbe di unificare meccanica quantistica e relatività generale, due pilastri della nostra descrizione della realtà, dalla scala subatomica a quella dell’universo. E forse potrebbe aprire nuove porte ancora sul nulla.\n\n*   *   *   *   +\n\nFonte: Le Scienze 606 (Febbraio 2019)"
		},
		{
			"post_id": 4,
			"title": "Se il sogno americano diventa un incubo",
			"date_published": 1550483197.482,
			"body": "### Disparità economiche esagerate tolgono qualsiasi opportunità ai poveri e danno troppo potere ai ricchi.\n\nÈ passato un quarto di secolo. Partendo per la prima volta per un viaggio fuori dall’Europa, ero affacciato avido al finestrino dell’aereo che stava per atterrare a Johannesburg. Le luci radenti dell’alba rischiaravano il Sudafrica che da tre mesi aveva eletto presidente Nelson Mandela. Abbagliato dai riflessi dorati che venivano da terra, mi ci volle un po’ per capire che si specchiavano su due diverse superfici: in parte venivano dalle piscine delle ville ordinate dei quartieri residenziali; in parte dai tetti di lamiera delle “township” dove la popolazione nera era stata confinata durante l’apartheid.\n\n* * *\n\nQuel giorno per la prima volta mi trovai sotto gli occhi la spropositata distanza socioeconomica tra ricchi, molto ricchi, a volte smisuratamente ricchi, e poveri ridotti in miseria, privi di qualsiasi potere d’acquisto. Sotto la fusoliera sfilavano fianco a fianco, separate dal nastro d’asfalto di una strada, le sontuose dimore dei mercanti di diamanti e le baracche di chi viveva con un reddito di meno di un dollaro al giorno.\n\nÈ il capitalismo, bellezza, direbbe qualcuno. Ma è sempre più chiaro che un’eccessiva diseguaglianza economica è negativa. Non solo per la società, ma anche per la salute e persino per l’ambiente.\n\nL’esempio più lampante viene dagli Stati Uniti, che secondo molti indicatori hanno il più alto livello di disuguaglianza tra i paesi sviluppati. Come scrive Joseph Stiglitz, premio Nobel per l’economia nel 2001, a pagina 38, i tre statunitensi più ricchi possiedono una ricchezza pari la 50 per cento meno agiato. E se da una parte questa è la conseguenza estrema del sogno americano, dall’altra significa che tre sole persone hanno quanto i 160 milioni meno abbienti, o giù di lì. Di più: negli ultimi quarant’anni la quota di reddito dello 0,1 per cento più ricco è quadruplicata e quella dell’1 per cento è raddoppiata. Per il 90 per cento dei salari più bassi è diminuita.\n\nCosì vacilla anche la retorica dell’ “american dream”, perché per i poveri è sempre più difficile emergere dalla povertà. Un esempio su tutti, negli Stati Uniti – salvo un certo numero di studenti meritevoli – l’accesso alle migliori università è impensabile per chi non provenga da famiglie molto benestanti. Sono sempre di più gli studenti che ricorrono al prestito d’onore, che restituiranno – si presume – una volta trovato un impiego. Ma l’età a cui riescono a rifonderlo è sempre più avanzata, quando ci riescono.\n\nQuanto alla salute, Robert Sapolski sottolinea come la disuguaglianza socioeconomica sia un fattore rilevante, ma non è tutto. «La valutazione di come le persone percepiscono il proprio benessere rispetto a quello degli altri – prosegue – è un indicatore di salute o malattia almeno altrettanto valido di qualsiasi misurazione oggettiva, come il livello di reddito». E sotto questo profilo psicologico, forse, non siamo poi così diversi dagli Stati Uniti, anche se il nostro sistema sanitario pubblico offre un maggiore accesso alle cure anche agli indigenti.\n\nÈ da leggere con attenzione, questo dossier sulla diseguaglianza. Perché se da una parte le differenze di reddito possono essere uno stimolo individuale alla crescita, è sempre più chiaro che disparità esagerate tolgono qualsiasi opportunità ai poveri e danno troppo potere ai ricchi. Che a loro volta lo pagano a caro prezzo. A Johannesburg, intorno a quelle ville, c’erano le guardi all’ingresso, e alti muri di cinta bordati da filo spinato.\n\n* * *\n\nAutore: Marco Cattaneo\n\nFonte: rivista Le Scienze (n. 606, febbraio 2019)"
		}
	]
}