{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "de la Musique sur ZeroNet ?",
			"body": "hello, pourquoi pas de la musique sur zeronet comme les films qui passe ?\ncomme que je connais :: pleer.com",
			"added": 1466685177
		},
		{
			"topic_id": 2,
			"title": "voila pleer.com c'est fini :'(((((((",
			"body": "j'utilise beaucoux pleer c'etait un site de téléchargement de mp3 mais suite a la chute des visiteur hors de la russie et des etat-unie pleer.net est fermer je suis vraiment triste dégouté et emmerdé que je peut plus télécharger de musique il reste tout de même [Home MP3](http://homemp3.ru/) mais mes reste de mp3 de pleer sur mon ordi c'est vraiment embêtant maintenant pour l'amour du ciel faite un site sur zeronet l'equivalent de pleer pour le remplacé.\n**MERCI**",
			"added": 1472168971
		},
		{
			"topic_id": 3,
			"title": "et si paf legeek pourait faire une vidéo de \"présentation\" de bitmessage !?",
			"body": "parce que ont voit paf legeek dans sa chaine faire des vidéo sur des logicielle libre qui respecte votre et en matière de vie privé, mais j'ai pas vue sur sa chaîne une vidéo parler de bitmessage car oui ce logicielle en fait partie, ils chiffre vos message en transite il est surtout inspiré du bitcoin, donc ce serait cool, merci.\n\nd'aillers mon addresse est :::: BM-2cUULjxxAKGUXVKuoWuq6F4PfE15CCo1GR\nvous pouvez me contacter",
			"added": 1473173405
		},
		{
			"topic_id": 4,
			"title": "Vos Contenu Premium sur notre Territoire, Et à L'etranger ?",
			"body": "J'ai Fait Une Article à quelle point que le parisien, le figaro propose des contenu premium mais es-que ca ce fait à l'etranger autement dit en angleterre ou aux etat-unis, ont t'ils des contenu prémium au etranger ? C'est Mon Enquete et donné Votre Avis et Commenter Sur Le Blog\nhttp://127.0.0.1:43110/17qdwZsS5oLLQKc6raP3hwCh9agUCS3zLn/?Post:7:Vos+Contenu+Premium+Sont+Seulement+En+France+\n_PS :: Le Blog N'a Pas Récu de Visiteur_",
			"added": 1473730802
		},
		{
			"topic_id": 5,
			"title": "La Culture Amerindienne :: Une Passion et une Panoplie Casse Tête !",
			"body": "Certe Je Me Suis Déguisé Vous Allez Pas Me Dire que C'est Faux hein ?\nPour cause si vous estes Passionner D'affrique Les Tenu Les Djumbé Facile Ont Va Pas Dire Le Contraire L'oceanie Avec Le Didgeridoo Un Peut Plus difficile Parcontre Ma Passion Etait Super Dure !\nParlont des Déguisement En vrai essayer de vous mèttre en Pancho ou Awayo Ca Reste Un Jeu D'enfant Mais Les Vrai costume native en nord pour du cinema ou pour le plaisir impossible,  l'equateur et les USA est le premier rang de faire mais du vrai et sans perruque, parcontre vous aurait des déguisement, c'est pas mal qu'an même pour une bonne passion ? et les instrument comme les flute de pan c'est relativement facile les quena un peut plus mais les quenacho pas possible mais le pire dans la matière c'est le Toyo (si vous savez pas ce que c'est allez au site de sick !) c'est le plus compliquer de tous mais comme les il est utilisé pas tout le temps dans les musique perso dans 1/4 des cas\nj'etait pure et simplement passionner de cette culture mais avec cette difficulté alucinante j'ai abandonné mais pas autant d'une maière totalement isolé ca veut dire je joue je me déguise sans chercher sur un moteur de recherche par exemple.",
			"added": 1473746272
		},
		{
			"topic_id": 6,
			"title": "Va C$ù*a MailChunk",
			"body": "J'ai essayer Mailchunk associer de bitmessage Mais qu'en j'ai créé un compte c'est payent 1$/m merde et j'ai fait n'importe quoi il ma déenregistré et j'ai tout supprimé.\nEN PLUS, C'est le seul qu'il marché jusqu'a présent, quoi les 2 echobot, Korben, Kaffie, ont recu un Message de ma part NON Je Vois Toujour, L'attente de la clef publique.\nN'esité pas à M'ecrire :: BM-2cUULjxxAKGUXVKuoWuq6F4PfE15CCo1GR, Je Serait Le Plus disponible possible mais essayer pas de m'ecrire sur ZeroMail car pour moi Ca Ne Marche Pas\nChao !",
			"added": 1474176324
		}
	],
	"topic_vote": {},
	"next_comment_id": 26,
	"comment": {
		"2_1HFyoddmyycAJAngDpX5k4fSKCwf6zqukE": [
			{
				"comment_id": 1,
				"body": "Je suis d'accord avec toi\nZeroNet je peut pas m'empassé :')\n\n1 :: je suis d'accord\n2 :: OK moi j'ai fait !\n3 :: j'aurais pu remarqué\n4 :: pas de mot de passe ;-)",
				"added": 1466715811
			}
		],
		"5_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC": [
			{
				"comment_id": 2,
				"body": "à moi d'avoir un proxy qui exécute du javascript.\n_c'est ma solution_",
				"added": 1472020489
			}
		],
		"2_18XDV3MuaGGQFAdeBNgcDUkviz2p28RsKB": [
			{
				"comment_id": 7,
				"body": "j'ai vue mailman, en revanche sur mon site j'ai ajouté un Questionnaire",
				"added": 1472931274
			},
			{
				"comment_id": 8,
				"body": "ca c'est sur ! yvesrogne",
				"added": 1473106612
			},
			{
				"comment_id": 23,
				"body": "> [troll](#comment_10_1DSVWXJjaSa3wDMjDLhsAP8W3a9ZMV49Mj): Pour la musique, faut directement aller sur le iTunes Russe :-) --> http://rutracker.org/forum/index.php\n\nitune russe ?, c'est un forum et je suis perdu enfin.",
				"added": 1475069600
			},
			{
				"comment_id": 25,
				"body": "OK DGSI, Mais ils sont en quelle mode de téléchargement en Torrent, en MP3, Ou Sur Youtube par contre ClipConverter.cc Est Hors Service, j'espère pas à Jamais.",
				"added": 1475088774
			}
		],
		"8_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 5,
				"body": "> [border0464fred](#comment_6_18XR5C5AxGfD5s2DbCPGuXxVN5oscoLyD6): httrack a bien marche selon mes test aussi +1\n\nNon !, ce logiciel déconne, regard bien sur le site archivé par exemple y a des fichiers vide.",
				"added": 1472818591
			}
		],
		"2_16z1hkD8sJLAA7etbrHivbz4G4Zj6Y4ofC": [
			{
				"comment_id": 6,
				"body": "J'ai ajouté des question",
				"added": 1472931177
			}
		],
		"1_1DdFL53pVKkKzPHVpakA5LWo8uw48LhjWj": [
			{
				"comment_id": 9,
				"body": "bonjour gudulf, j'utilise plus zerome pour des raison très con un qui déconne et autre qui à switcher de merge je parle de infinty qui m'a particulièrement fait c*$ùr, mais gudulf j'ai une question tu t'es inspiré de moi ben parce que, sur ton blog t'a mis \"chez gudulf\" car moi c'est \"chez sick\" ?",
				"added": 1473185353
			},
			{
				"comment_id": 10,
				"body": "yvesrogne ::: se serait bien pour les francophone et j'espère pas faire un faux-pas\ngudulf ::: comme par hasard :/ , mais mon site n'est pas un blog mais il y a un blog, et mon site n'est pas comme les autre sur zeronet je vous laisse le voir, je donne le suspense !",
				"added": 1473198829
			},
			{
				"comment_id": 11,
				"body": "lulu la tortue ::: C'est la Première Fois qu'il que je vois de la musique sur ZeroNet, On Attend ...\njusqu'a que ca arrive je balance tout les mp3 de pleer.",
				"added": 1473270975
			},
			{
				"comment_id": 12,
				"body": "> [membraxfr](#comment_3_15Eaist1YffBfCkpZ1iRb69v1h1C15cYgU): lol\n\nC'est tous qu'il donne, en plus il m'a dépassé par apport a mon topic\ngudulf 3 - 2 sick",
				"added": 1473351687
			}
		],
		"1_19vd2X9VjRkgY3qbtuTs6bvMcJCRZJY9Z6": [
			{
				"comment_id": 14,
				"body": "> [yvesrogne](#comment_1_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1): et je ne m'amuse pas à transférer mes données zéronet d\"un équipement à un autre ... C'est une histoire de sécurité!\n\nMais Moi Ca M'amuse pas Oh, C'est quand j'ai un Problème ou remplacer windows, et même les clef privé pour maintenire que de perdre le controle",
				"added": 1473740978
			}
		],
		"3_1HN5pCyG5g1483VcFueZNvGv4MkA7yxjw1": [
			{
				"comment_id": 15,
				"body": "> [dgsi](#comment_1_1JonCWijFbp7FP2HKYDUic3CoWkBcVwmc8): Si on parle de la même chose: http://127.0.0.1:43110/1DL6a4wyGtgmZFyUro6ARMqZPiUjUdMPV7\n\nC'est Vrai, En faite il faut un extention de chrome :: ZeroNet Protocole",
				"added": 1473754312
			}
		],
		"1_1JonCWijFbp7FP2HKYDUic3CoWkBcVwmc8": [
			{
				"comment_id": 16,
				"body": "C'est Vraiment La DGSI Serieux D'es Un Agent Bref, Pour Commencer Comment sur mes Topic",
				"added": 1473755518
			}
		],
		"1_1J5uFzQBpLpoyTZfH28Fv8KrThShewrF2d": [
			{
				"comment_id": 17,
				"body": "FR : mais, l'article n'existe pas\nEN : but, the article is not exist\nIN : wa, suyo'e nayessay",
				"added": 1473928279
			},
			{
				"comment_id": 20,
				"body": "C'est Bon",
				"added": 1473979987
			}
		],
		"1_1Ax5yj36bQDizcaeCMn9upKzVVyQ4wsm48": [
			{
				"comment_id": 18,
				"body": "si c'etait merveilleux, il aurait pas d'attentats sur notre territoire !",
				"added": 1473929411
			}
		],
		"1_1CNF4WYCP9372VLNWNR7RaeGZyvXvcSMaU": [
			{
				"comment_id": 19,
				"body": "J'ai Fait ^^ ::: http://127.0.0.1:43110/1SickfhMUKQURcdN9YHZeendi6jWJFFEs/",
				"added": 1473931683
			}
		],
		"1_18uwHHaZimsk85hjpKttgdcZdMa1rC9Bfz": [
			{
				"comment_id": 21,
				"body": "quoi, mais depuis 2015 c'est en france cette badlaw il est en suisse ?",
				"added": 1474917984
			}
		],
		"19_1D4B7XbRYY5p9kx79NtKr3qiShR5Tcpnvo": [
			{
				"comment_id": 22,
				"body": "c'est vraiment envahissant t'a besoin de posté une photo pas plusieurs alors que c'est la même :////////////",
				"added": 1475069462
			},
			{
				"comment_id": 24,
				"body": "> [dgsi](#comment_4_1JonCWijFbp7FP2HKYDUic3CoWkBcVwmc8): La photo met du temps à s'afficher sur un Raspberry Pi 2 lol\n\nOK, Avec Ton Raspberry que je connais pas, mais en tout cas doom1 à envahi l'espace de ZeroTalk/FR",
				"added": 1475088326
			}
		]
	},
	"comment_vote": {}
}