{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1546863669_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 1,
				"body": "Doesn't sound too complicated to be honest. Maybe I'll cook something up.",
				"added": 1546870298
			},
			{
				"comment_id": 2,
				"body": "> [anonimoose](#comment_31_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): just be sure to make seeding the roms optional else thats going to hit your site space limit really quickly\n\nGood call. I'm not too into developing content for ZeroNet yet so any advise is highly appreciated.",
				"added": 1546937118
			},
			{
				"comment_id": 3,
				"body": "> [anonimoose](#comment_33_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): i've only briefly looked into it and only then cloned a blog to try, I am mostly a back end developer so I would read up on the documentation\n\nYeah I played around with site creation on ZeroNet a bit and it's pretty straightforward; create whatever you want in vue or react or simple bootstrap html, then webpack it and you're done. Need to read up on how data is distributed among zn-clients, and how to minimize storage impact.\nThis is really fun stuff!",
				"added": 1546941661
			}
		],
		"1546939398_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_613_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): 2 says yes, 2 says now. Anyone else? Anyone can prove easily?\n\nWhat do you mean? Everyone so far said that ZeroNet only uses Trackers and a custom protocol to initiate the peer2peer downloads which works similar to Bittorrent.",
				"added": 1546945403
			},
			{
				"comment_id": 6,
				"body": "> [quantumworld](#comment_123_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Why cant all traffic be encrypted using this same protocol?\n\nafaik torrent protocols don't offer encryption but honestly I don't see a reason why zeronet is not enforcing SSL at least.",
				"added": 1547114583
			}
		],
		"1547014808_1JGp4gaBwTZ6rjuLytHJ1o9C93kfk7UQiD": [
			{
				"comment_id": 5,
				"body": "Some people are working on a messageboard that's using Ethereum as a ledger, maybe that will help chinese users to freely express themselves: https://0xchan.net",
				"added": 1547034476
			},
			{
				"comment_id": 7,
				"body": "> [anonimoose](#comment_37_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ): until thats blocked too.\n\nwell since you can create your own node and many chinese cryptocurrencies are building up on Ethereum, it'd be quite counterproductive to ban access to the entire Ethereum network. however, China being China, anything might happen I guess...",
				"added": 1547147248
			},
			{
				"comment_id": 8,
				"body": "> [d14na](#comment_84_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): Here is the latest distribution of Ethereum nodes:https://ethernodes.org/network/1 [...]\n\nI agree. Though Ethereum as it is right now may not be fully qualified to handle the amount of transactions necessary to facilitate something like ZeroNet. But maybe creating a cheeky bridge solution to have a script read content from a smart contract and then post it on ZeroNet... hmm...",
				"added": 1547204882
			}
		],
		"1547590466_16dA195gn9p2CL9LXgMYSWeHtp7zCBtqiw": [
			{
				"comment_id": 9,
				"body": "> [expatri0t](#comment_1_1AAAGerzGimCBY5z7h4U8kRfjjWbHMXhPP): BB has no anonymity features built into it by default & by the project dev's admission BB wasn't designed to include these features. Perhaps this might change as the project evolves? Although, if my memory serves me well it does utilize HTTPS :)\n\nThat is actually something I'm missing on ZeroNet.",
				"added": 1547593059
			}
		],
		"1547790597_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 10,
				"body": "Why would you do this tho? It would essentially also make you seed questionable content to say the least.",
				"added": 1547808801
			}
		]
	},
	"comment_vote": {
		"84_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1
	}
}