{"next_paste_id":18,"next_comment_id":0,"paste":[{"paste_id":0,"description":"Eu Tenho Um Deus - Giovani Santos","body":"Eu tenho um Deus\nQue pode tudo, tudo se eu crer\nQue faz o impossível acontecer\nE neste Deus\nEu posso plenamente confiar\nSe as águas não se abrirem\nEu ando sobre o mar\nMudou a minha historia\nPois fim no meu sofrer\n\nE pra você\nQue pensa que não tem mais solução\nSe sente tão pequeno na solidão\nSe a este Deus\nVocê completamente se entregar\nVerá que o milagre aconteceras\nMudando sua história\nProvando assim então o seu poder\n\nFechou a boca dos leões famintos\nParou o sol por determinação\nExalta o humilde e o abatido\nEste Deus fará de ti um campeão","language":"text/plain","encrypted":false,"added":1622166309},{"paste_id":1,"description":"João 16","body":"\"Tenho-lhes dito tudo isso para que vocês não venham a tropeçar.\nVocês serão expulsos das sinagogas; de fato, virá o tempo quando quem os matar pensará que está prestando culto a Deus.\nFarão essas coisas porque não conheceram nem o Pai, nem a mim.\nEstou lhes dizendo isto para que, quando chegar a hora, lembrem-se de que eu os avisei. Não lhes disse isso no princípio, porque eu estava com vocês\".\n\"Agora que vou para aquele que me enviou, nenhum de vocês me pergunta: ‘Para onde vais? ’\nPorque falei estas coisas, o coração de vocês encheu-se de tristeza.\nMas eu lhes afirmo que é para o bem de vocês que eu vou. Se eu não for, o Conselheiro não virá para vocês; mas se eu for, eu o enviarei.\nQuando ele vier, convencerá o mundo do pecado, da justiça e do juízo.\nDo pecado, porque os homens não crêem em mim;\nda justiça, porque vou para o Pai, e vocês não me verão mais;\ne do juízo, porque o príncipe deste mundo já está condenado.\n\"Tenho ainda muito que lhes dizer, mas vocês não o podem suportar agora.\nMas quando o Espírito da verdade vier, ele os guiará a toda a verdade. Não falará de si mesmo; falará apenas o que ouvir, e lhes anunciará o que está por vir.\nEle me glorificará, porque receberá do que é meu e o tornará conhecido a vocês.\nTudo o que pertence ao Pai é meu. Por isso eu disse que o Espírito receberá do que é meu e o tornará conhecido a vocês.\n\"Mais um pouco e já não me verão; um pouco mais, e me verão de novo\".\nAlguns dos seus discípulos disseram uns aos outros: \"O que ele quer dizer com isso: ‘Mais um pouco e não me verão’; e ‘um pouco mais e me verão de novo’, e ‘Porque vou para o Pai’? \"\nE perguntavam: \"Que quer dizer ‘um pouco mais’? Não entendemos o que ele está dizendo\".\nJesus percebeu que desejavam interrogá-lo a respeito disso, pelo que lhes disse: \"Vocês estão perguntando uns aos outros o que eu quis dizer quando falei: Mais um pouco e não me verão; um pouco mais e me verão de novo?\nDigo-lhes que certamente vocês chorarão e se lamentarão, mas o mundo se alegrará. Vocês se entristecerão, mas a tristeza de vocês se transformará em alegria.\nA mulher que está dando à luz sente dores, porque chegou a sua hora; mas, quando o bebê nasce, ela esquece a angústia, por causa da alegria de ter nascido no mundo um menino.\nAssim acontece com vocês: agora é hora de tristeza para vocês, mas eu os verei outra vez, e vocês se alegrarão, e ninguém lhes tirará essa alegria.\nNaquele dia vocês não me perguntarão mais nada. Eu lhes asseguro que meu Pai lhes dará tudo o que pedirem em meu nome.\nAté agora vocês não pediram nada em meu nome. Peçam e receberão, para que a alegria de vocês seja completa.\n\"Embora eu tenha falado por meio de figuras, vem a hora em que não usarei mais esse tipo de linguagem, mas lhes falarei abertamente a respeito de meu Pai.\nNesse dia, vocês pedirão em meu nome. Não digo que pedirei ao Pai em favor de vocês,\npois o próprio Pai os ama, porquanto vocês me amaram e creram que eu vim de Deus.\nEu vim do Pai e entrei no mundo; agora deixo o mundo e volto para o Pai\".\nEntão os discípulos de Jesus disseram: \"Agora estás falando claramente, e não por figuras.\nAgora podemos perceber que sabes todas as coisas e nem precisas que te façam perguntas. Por isso cremos que vieste de Deus\".\nRespondeu Jesus: \"Agora vocês crêem? \"\nAproxima-se a hora, e já chegou, quando vocês serão espalhados cada um para a sua casa. Vocês me deixarão sozinho. Mas, eu não estou sozinho, pois meu Pai está comigo.\n\"Eu lhes disse essas coisas para que em mim vocês tenham paz. Neste mundo vocês terão aflições; contudo, tenham ânimo! Eu venci o mundo\".\n\nJoão 16:1-33","language":"text/plain","encrypted":false,"added":1622221488},{"paste_id":2,"description":"Atos 7","body":"Então o sumo sacerdote perguntou a Estêvão: \"São verdadeiras estas acusações? \"\nA isso ele respondeu: \"Irmãos e pais, ouçam-me! O Deus glorioso apareceu a Abraão, nosso pai, estando ele ainda na Mesopotâmia, antes de morar em Harã, e lhe disse:\n‘Saia da sua terra e do meio dos seus parentes e vá para a terra que eu lhe mostrarei’.\n\"Então, ele saiu da terra dos caldeus e se estabeleceu em Harã. Depois da morte de seu pai, Deus o trouxe a esta terra, onde vocês agora vivem.\nDeus não lhe deu nenhuma herança aqui, nem mesmo o espaço de um pé. Mas lhe prometeu que ele e, depois dele, seus descendentes, possuiriam a terra, embora, naquele tempo, Abraão não tivesse filhos.\nDeus lhe falou desta forma: ‘Seus descendentes serão peregrinos numa terra estrangeira, e serão escravizados e maltratados por quatrocentos anos.\nMas eu castigarei a nação a quem servirão como escravos, e depois sairão dali e me adorarão neste lugar’.\nE deu a Abraão a aliança da circuncisão. Por isso, Abraão gerou Isaque e o circuncidou oito dias depois do seu nascimento. Mais tarde, Isaque gerou Jacó, e este os doze patriarcas.\n\"Os patriarcas, tendo inveja de José, venderam-no como escravo para o Egito. Mas Deus estava com ele\ne o libertou de todas as suas tribulações, dando a José favor e sabedoria diante do faraó, rei do Egito; este o tornou governador do Egito e de todo o seu palácio.\n\"Depois houve fome em todo o Egito e em Canaã, trazendo consigo grande sofrimento, e os nossos antepassados não encontravam alimento.\nOuvindo que havia trigo no Egito, Jacó enviou nossos antepassados em sua primeira viagem.\nNa segunda viagem deles, José fez-se reconhecer por seus irmãos, e o faraó pôde conhecer a família de José.\nDepois disso, José mandou buscar seu pai Jacó e toda a sua família, que eram setenta e cinco pessoas.\nEntão Jacó desceu ao Egito, onde faleceram ele e os nossos antepassados.\nSeus corpos foram levados de volta a Siquém e colocados no túmulo que Abraão havia comprado ali dos filhos de Hamor, por certa quantia.\n\"Ao se aproximar o tempo em que Deus cumpriria sua promessa a Abraão, aumentou muito o número do nosso povo no Egito.\nEntão outro rei, que nada sabia a respeito de José, passou a governar o Egito.\nEle agiu traiçoeiramente para com o nosso povo e oprimiu os nossos antepassados, obrigando-os a abandonar os seus recém-nascidos, para que não sobrevivessem.\n\"Naquele tempo nasceu Moisés, que era um menino extraordinário. Por três meses ele foi criado na casa de seu pai.\nQuando foi abandonado, a filha do faraó o tomou e o criou como seu próprio filho.\nMoisés foi educado em toda a sabedoria dos egípcios e veio a ser poderoso em palavras e obras.\n\"Ao completar quarenta anos, Moisés decidiu visitar seus irmãos israelitas.\nAo ver um deles sendo maltratado por um egípcio, saiu em defesa do oprimido e o vingou, matando o egípcio.\nEle pensava que seus irmãos compreenderiam que Deus o estava usando para salvá-los, mas eles não o compreenderam.\nNo dia seguinte, Moisés dirigiu-se a dois israelitas que estavam brigando, e tentou reconciliá-los, dizendo: ‘Homens, vocês são irmãos; por que ferem um ao outro? ’\n\"Mas o homem que maltratava o outro empurrou Moisés e disse: ‘Quem o nomeou líder e juiz sobre nós?\nQuer matar-me como matou o egípcio ontem? ’\nOuvindo isso, Moisés fugiu para Midiã, onde ficou morando como estrangeiro e teve dois filhos.\n\"Passados quarenta anos, apareceu a Moisés um anjo nas labaredas de uma sarça em chamas no deserto, perto do monte Sinai.\nVendo aquilo, ficou atônito. E, aproximando-se para observar, ouviu a voz do Senhor:\n‘Eu sou o Deus dos seus antepassados, o Deus de Abraão, o Deus de Isaque e o Deus de Jacó’. Moisés, tremendo de medo, não ousava olhar.\n\"Então o Senhor lhe disse: ‘Tire as sandálias dos pés, porque o lugar em que você está é terra santa.\nDe fato tenho visto a opressão sobre o meu povo no Egito. Ouvi seus gemidos e desci para livrá-lo. Venha agora, e eu o enviarei de volta ao Egito’.\n\"Este é o mesmo Moisés que tinham rejeitado com estas palavras: ‘Quem o nomeou líder e juiz? ’ Ele foi enviado pelo próprio Deus para ser líder e libertador deles, por meio do anjo que lhe tinha aparecido na sarça.\nEle os tirou de lá, fazendo maravilhas e sinais no Egito, no mar Vermelho e no deserto durante quarenta anos.\n\"Este é aquele Moisés que disse aos israelitas: ‘Deus lhes levantará dentre seus irmãos um profeta como eu’.\nEle estava na congregação, no deserto, com o anjo que lhe falava no monte Sinai e com os nossos antepassados, e recebeu palavras vivas, para transmiti-las a nós.\n\"Mas nossos antepassados se recusaram a obedecer-lhe; pelo contrário, rejeitaram-no, e em seus corações voltaram para o Egito.\nDisseram a Arão: ‘Faça para nós deuses que nos conduzam, pois a esse Moisés que nos tirou do Egito, não sabemos o que lhe aconteceu! ’\nNaquela ocasião fizeram um ídolo em forma de bezerro. Trouxeram-lhe sacrifícios e fizeram uma celebração em honra ao que suas mãos tinham feito.\nMas Deus afastou-se deles e os entregou à adoração dos astros, conforme o que foi escrito no livro dos profetas: ‘Foi a mim que vocês apresentaram sacrifícios e ofertas durante os quarenta anos no deserto, Ó nação de Israel?\nAo invés disso, levantaram o santuário de Moloque e a estrela do seu deus Renfã, ídolos que vocês fizeram para adorar! Portanto, eu os enviarei para o exílio, para além da Babilônia’.\n\"No deserto os nossos antepassados tinham o tabernáculo da aliança, que fora feito segundo a ordem de Deus a Moisés, de acordo com o modelo que ele tinha visto.\nTendo recebido o tabernáculo, nossos antepassados o levaram, sob a liderança de Josué, quando tomaram a terra das nações que Deus expulsou de diante deles. Esse tabernáculo permaneceu na terra até a época de Davi,\nque encontrou graça diante de Deus e pediu que ele lhe permitisse providenciar uma habitação para o Deus de Jacó.\nMas foi Salomão quem lhe construiu a casa.\n\"Todavia, o Altíssimo não habita em casas feitas por homens. Como diz o profeta:\n‘O céu é o meu trono, e a terra, o estrado dos meus pés. Que espécie de casa vocês me edificarão? diz o Senhor, ou onde seria meu lugar de descanso?\nNão foram as minhas mãos que fizeram todas estas coisas? ’\n\"Povo rebelde, obstinado de coração e de ouvidos! Vocês são iguais aos seus antepassados: sempre resistem ao Espírito Santo!\nQual dos profetas os seus antepassados não perseguiram? Eles mataram aqueles que prediziam a vinda do Justo, de quem agora vocês se tornaram traidores e assassinos —\nvocês, que receberam a Lei por intermédio de anjos, mas não lhe obedeceram\".\nOuvindo isso, ficavam furiosos e rangiam os dentes contra ele.\nMas Estêvão, cheio do Espírito Santo, levantou os olhos para o céu e viu a glória de Deus, e Jesus de pé, à direita de Deus,\ne disse: \"Vejo o céu aberto e o Filho do homem de pé, à direita de Deus\".\nMas eles taparam os ouvidos e, gritando bem alto, lançaram-se todos juntos contra ele,\narrastaram-no para fora da cidade e começaram a apedrejá-lo. As testemunhas deixaram seus mantos aos pés de um jovem chamado Saulo.\nEnquanto apedrejavam Estêvão, este orava: \"Senhor Jesus, recebe o meu espírito\".\nEntão caiu de joelhos e bradou: \"Senhor, não os consideres culpados deste pecado\". E, dizendo isso, adormeceu.\n\nAtos 7:1-60","language":"text/plain","encrypted":false,"added":1622221592},{"paste_id":3,"description":"Hebreus 3","body":"Portanto, santos irmãos, participantes do chamado celestial, fixem os seus pensamentos em Jesus, apóstolo e sumo sacerdote que confessamos.\nEle foi fiel àquele que o havia constituído, assim como Moisés foi fiel em toda a casa de Deus.\nJesus foi considerado digno de maior glória do que Moisés, da mesma forma que o construtor de uma casa tem mais honra do que a própria casa.\nPois toda casa é construída por alguém, mas Deus é o edificador de tudo.\nMoisés foi fiel como servo em toda a casa de Deus, dando testemunho do que haveria de ser dito no futuro,\nmas Cristo é fiel como Filho sobre a casa de Deus; e esta casa somos nós, se é que nos apegamos firmemente à confiança e à esperança da qual nos gloriamos.\nAssim, como diz o Espírito Santo: \"Hoje, se vocês ouvirem a sua voz,\nnão endureçam o coração, como na rebelião, durante o tempo de provação no deserto,\nonde os seus antepassados me tentaram, pondo-me à prova, apesar de, durante quarenta anos, terem visto o que eu fiz.\nPor isso fiquei irado contra aquela geração e disse: Os seus corações estão sempre se desviando, e eles não reconheceram os meus caminhos.\nAssim jurei na minha ira: Jamais entrarão no meu descanso\".\nCuidado, irmãos, para que nenhum de vocês tenha coração perverso e incrédulo, que se afaste do Deus vivo.\nPelo contrário, encorajem-se uns aos outros todos os dias, durante o tempo que se chama \"hoje\", de modo que nenhum de vocês seja endurecido pelo engano do pecado,\npois passamos a ser participantes de Cristo, desde que, de fato, nos apeguemos até o fim à confiança que tivemos no princípio.\nPor isso é que se diz: \"Se hoje vocês ouvirem a sua voz, não endureçam o coração, como na rebelião\".\nQuem foram os que ouviram e se rebelaram? Não foram todos os que Moisés tirou do Egito?\nContra quem Deus esteve irado durante quarenta anos? Não foi contra aqueles que pecaram, cujos corpos caíram no deserto?\nE a quem jurou que nunca haveriam de entrar no seu descanso? Não foi àqueles que foram desobedientes?\nVemos, assim, que foi por causa da incredulidade que não puderam entrar.\n\nHebreus 3:1-19","language":"text/plain","encrypted":false,"added":1622221709},{"paste_id":4,"description":"Hebreus 6","body":"Portanto, deixemos os ensinos elementares a respeito de Cristo e avancemos para a maturidade, sem lançar novamente o fundamento do arrependimento de atos que conduzem à morte, da fé em Deus,\nda instrução a respeito de batismos, da imposição de mãos, da ressurreição dos mortos e do juízo eterno.\nAssim faremos, se Deus o permitir.\nOra para aqueles que uma vez foram iluminados, provaram o dom celestial, tornaram-se participantes do Espírito Santo,\nexperimentaram a bondade da palavra de Deus e os poderes da era que há de vir,\ne caíram, é impossível que sejam reconduzidos ao arrependimento; pois para si mesmos estão crucificando de novo o Filho de Deus, sujeitando-o à desonra pública.\nPois a terra que absorve a chuva, que cai freqüentemente e dá colheita proveitosa àqueles que a cultivam, recebe a bênção de Deus.\nMas a terra que produz espinhos e ervas daninhas, é inútil e logo será amaldiçoada. Seu fim é ser queimada.\nAmados, mesmo falando dessa forma, estamos convictos de coisas melhores em relação a vocês, coisas próprias da salvação.\nDeus não é injusto; ele não se esquecerá do trabalho de vocês e do amor que demonstraram por ele, pois ajudaram os santos e continuam a ajudá-los.\nQueremos que cada um de vocês mostre essa mesma prontidão até o fim, para que tenham a plena certeza da esperança,\nde modo que vocês não se tornem negligentes, mas imitem aqueles que, por meio da fé e da paciência, recebem a herança prometida.\nQuando Deus fez a sua promessa a Abraão, por não haver ninguém superior por quem jurar, jurou por si mesmo,\ndizendo: \"Esteja certo de que o abençoarei e farei seus descendentes numerosos\".\nE foi assim que, depois de esperar pacientemente, Abraão alcançou a promessa.\nOs homens juram por alguém superior a si mesmos, e o juramento confirma o que foi dito, pondo fim a toda discussão.\nQuerendo mostrar de forma bem clara a natureza imutável do seu propósito para com os herdeiros da promessa, Deus o confirmou com juramento,\npara que, por meio de duas coisas imutáveis nas quais é impossível que Deus minta, sejamos firmemente encorajados, nós, que nos refugiamos nele para tomar posse da esperança a nós proposta.\nTemos esta esperança como âncora da alma, firme e segura, a qual adentra o santuário interior, por trás do véu,\nonde Jesus, que nos precedeu, entrou em nosso lugar, tornando-se sumo sacerdote para sempre, segundo a ordem de Melquisedeque.\n\nHebreus 6:1-20","language":"text/plain","encrypted":false,"added":1622313122},{"paste_id":5,"description":"Meu Barquinho - Giselli Cristina","body":"O vento balançou, meu barco em alto mar\nO medo me cercou, e quis me afogar\nMas então eu clamei, ao filho de Davi\nEle me escutou, por isso estou aqui\n\nO vento Ele acalmou, o medo repreendeu\nQuando Ele ordenou, o mar obedeceu\n\nNão temo mais o mar, pois firme está minha fé\nNo meu barquinho está, Jesus de Nazaré\nSe o medo me cercar, ou se o vento soprar\nSeu nome eu clamarei, Ele me guardará\n\nNão temo mais o mar, pois firme está minha fé\nNo meu barquinho está, Jesus de Nazaré\nSe o medo me cercar, ou se o vento soprar\nSeu nome eu clamarei, Ele me socorrerá\n\nO vento balançou, meu barco em alto mar\nO medo me cercou, e quis me afogar\nMas então eu clamei, ao filho de Davi\nEle me escutou, por isso estou aqui\n\nO vento Ele acalmou, o medo repreendeu\nQuando Ele ordenou, o mar obedeceu\n\nNão temo mais o mar, pois firme está minha fé\nNo meu barquinho está, Jesus de Nazaré\nSe o medo me cercar, ou se o vento soprar\nSeu nome eu clamarei, Ele me guardará\n\nNão temo mais o mar, pois firme está minha fé\nNo meu barquinho está, Jesus de Nazaré\nSe o medo me cercar, ou se o vento soprar\nSeu nome eu clamarei, Ele me socorrerá\n\nNão temo mais o mar, pois firme está minha fé\nNo meu barquinho está, Jesus de Nazaré\nSe o medo me cercar, ou se o vento soprar\nSeu nome eu clamarei, Ele me socorrerá","language":"text/plain","encrypted":false,"added":1622476666},{"paste_id":6,"description":"Sonda-me, Usa-me - Aline Barros","body":"Sonda-me, Senhor, e me conheces\nQuebranta o meu coração\n\nTransforma-me\nConforme a Tua palavra\nE enche-me até que em mim\nSe ache só a Ti\n\nEntão\nUsa-me, Senhor\nUsa-me\n\nComo um farol que brilha à noite\nComo ponte sobre as águas\nComo abrigo no deserto\nComo flecha que acerta o alvo\n\nEu quero ser usado\nDa maneira que te agrade\nEm qualquer hora e em qualquer lugar\n\nEis aqui a minha vida\nUsa-me, Senhor\nUsa-me\n\nSonda-me, Senhor, e me conheces\nQuebranta o meu coração\n\nTransforma-me\nConforme a Tua palavra\nE enche-me até que em mim\nSe ache só a Ti\n\nEntão\nUsa-me, Senhor\nUsa-me\n\nComo um farol que brilha à noite\nComo ponte sobre as águas\nComo abrigo no deserto\nComo flecha que acerta o alvo\n\nEu quero ser usado\nDa maneira que te agrade\nEm qualquer hora e em qualquer lugar\n\nEis aqui a minha vida\nUsa-me, Senhor\nUsa-me\n\nSonda-me\nQuebranta-me\nTransforma-me\nEnche-me\nE usa-me\n\nSonda-me\nQuebranta-me\nTransforma-me\nEnche-me\nE usa-me, Senhor\n\nComo um farol que brilha à noite\nComo ponte sobre as águas\nComo abrigo no deserto\nComo flecha que acerta o alvo\n\nEu quero ser usado\nDa maneira que te agrade\nEm qualquer hora e em qualquer lugar\n\nEis aqui a minha vida\nUsa-me, Senhor\nUsa-me\n\nSonda-me\nQuebranta-me\nTransforma-me\nEnche-me\nE usa-me\n\nSonda-me\nQuebranta-me\nTransforma-me\nEnche-me\nE usa-me, Senhor\n\nE usa-me, Senhor","language":"text/plain","encrypted":false,"added":1622476781},{"paste_id":7,"description":"Segregated Witness (Consensus layer)","body":"<pre>\n  BIP: 141\n  Layer: Consensus (soft fork)\n  Title: Segregated Witness (Consensus layer)\n  Author: Eric Lombrozo <elombrozo@gmail.com>\n          Johnson Lau <jl2012@xbt.hk>\n          Pieter Wuille <pieter.wuille@gmail.com>\n  Comments-Summary: No comments yet.\n  Comments-URI: https://github.com/bitcoin/bips/wiki/Comments:BIP-0141\n  Status: Final\n  Type: Standards Track\n  Created: 2015-12-21\n  License: PD\n</pre>\n\n==Abstract==\n\nThis BIP defines a new structure called a \"witness\" that is committed to blocks separately from the transaction merkle tree. This structure contains data required to check transaction validity but not required to determine transaction effects. In particular, scripts and signatures are moved into this new structure.\n\nThe witness is committed in a tree that is nested into the block's existing merkle root via the coinbase transaction for the purpose of making this BIP soft fork compatible. A future hard fork can place this tree in its own branch.\n\n==Motivation==\n\nThe entirety of the transaction's effects are determined by output consumption (spends) and new output creation. Other transaction data, and signatures in particular, are only required to validate the blockchain state, not to determine it.\n\nBy removing this data from the transaction structure committed to the transaction merkle tree, several problems are fixed:\n\n# '''Nonintentional malleability becomes impossible'''. Since signature data is no longer part of the transaction hash, changes to how the transaction was signed are no longer relevant to transaction identification. As a solution of transaction malleability, this is superior to the canonical signature approach ([https://github.com/bitcoin/bips/blob/master/bip-0062.mediawiki BIP62]):\n#* It prevents involuntary transaction malleability for any type of scripts, as long as all inputs are signed (with at least one CHECKSIG or CHECKMULTISIG operation)\n#* In the case of an m-of-n CHECKMULTISIG script, a transaction is malleable only with agreement of m private key holders (as opposed to only 1 private key holder with BIP62)\n#* It prevents involuntary transaction malleability due to unknown ECDSA signature malleability\n#* It allows creation of unconfirmed transaction dependency chains without counterparty risk, an important feature for offchain protocols such as the Lightning Network\n# '''Transmission of signature data becomes optional'''. It is needed only if a peer is trying to validate a transaction instead of just checking its existence. This reduces the size of SPV proofs and potentially improves the privacy of SPV clients as they can download more transactions using the same bandwidth.\n# '''Some constraints could be bypassed with a soft fork''' by moving part of the transaction data to a structure unknown to current protocol, for example:\n#* Size of witness could be ignored / discounted when calculating the block size, effectively increasing the block size to some extent\n#* Hard coded constants, such as maximum data push size (520 bytes) or sigops limit could be reevaluated or removed\n#* New script system could be introduced without any limitation from the existing script semantic. For example, a new transaction digest algorithm for transaction signature verification is described in [https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki BIP143]\n\n==Specification==\n\n=== Transaction ID ===\n\nA new data structure, <code>witness</code>, is defined. Each transaction will have 2 IDs.\n\nDefinition of <code>txid</code> remains unchanged: the double SHA256 of the traditional serialization format:\n  \n  [nVersion][txins][txouts][nLockTime]\n  \nA new <code>wtxid</code> is defined: the double SHA256 of the new serialization with witness data:\n  \n  [nVersion][marker][flag][txins][txouts][witness][nLockTime]\n  \nFormat of <code>nVersion</code>, <code>txins</code>, <code>txouts</code>, and <code>nLockTime</code> are same as traditional serialization.\n\nThe <code>marker</code> MUST be a 1-byte zero value: <code>0x00</code>.\n\nThe <code>flag</code> MUST be a 1-byte non-zero value. Currently, <code>0x01</code> MUST be used.\n\nThe <code>witness</code> is a serialization of all witness data of the transaction. Each txin is associated with a witness field. A witness field starts with a <code>var_int</code> to indicate the number of stack items for the txin. It is followed by stack items, with each item starts with a <code>var_int</code> to indicate the length. Witness data is NOT script.\n\nA non-witness program (defined hereinafter) txin MUST be associated with an empty witness field, represented by a <code>0x00</code>. If all txins are not witness program, a transaction's <code>wtxid</code> is equal to its <code>txid</code>.\n\n=== Commitment structure ===\n\nA new block rule is added which requires a commitment to the <code>wtxid</code>. The <code>wtxid</code> of coinbase transaction is assumed to be <code>0x0000....0000</code>.\n\nA <code>witness root hash</code> is calculated with all those <code>wtxid</code> as leaves, in a way similar to the <code>hashMerkleRoot</code> in the block header.\n\nThe commitment is recorded in a <code>scriptPubKey</code> of the coinbase transaction. It must be at least 38 bytes, with the first 6-byte of <code>0x6a24aa21a9ed</code>, that is:\n  \n   1-byte - OP_RETURN (0x6a)\n   1-byte - Push the following 36 bytes (0x24)\n   4-byte - Commitment header (0xaa21a9ed)\n  32-byte - Commitment hash: Double-SHA256(witness root hash|witness reserved value)\n  \n  39th byte onwards: Optional data with no consensus meaning\n  \nand the coinbase's input's witness must consist of a single 32-byte array for the <code>witness reserved value</code>.\n\nIf there are more than one <code>scriptPubKey</code> matching the pattern, the one with highest output index is assumed to be the commitment.\n\nIf all transactions in a block do not have witness data, the commitment is optional.\n\n=== Witness program ===\n\nA <code>scriptPubKey</code> (or <code>redeemScript</code> as defined in BIP16/P2SH) that consists of a 1-byte push opcode (for 0 to 16) followed by a data push between 2 and 40 bytes gets a new special meaning. The value of the first push is called the \"version byte\". The following byte vector pushed is called the \"witness program\".\n\nThere are two cases in which witness validation logic are triggered. Each case determines the location of the witness version byte and program, as well as the form of the scriptSig:\n# Triggered by a <code>scriptPubKey</code> that is exactly a push of a version byte, plus a push of a witness program. The scriptSig must be exactly empty or validation fails. (''\"native witness program\"'')\n# Triggered when a <code>scriptPubKey</code> is a P2SH script, and the BIP16 <code>redeemScript</code> pushed in the <code>scriptSig</code> is exactly a push of a version byte plus a push of a witness program. The <code>scriptSig</code> must be exactly a push of the BIP16 <code>redeemScript</code> or validation fails. (''\"P2SH witness program\"'')\n\nIf the version byte is 0, and the witness program is 20 bytes:\n* It is interpreted as a pay-to-witness-public-key-hash (P2WPKH) program.\n* The witness must consist of exactly 2 items (≤ 520 bytes each). The first one a signature, and the second one a public key.\n* The HASH160 of the public key must match the 20-byte witness program.\n* After normal script evaluation, the signature is verified against the public key with CHECKSIG operation. The verification must result in a single TRUE on the stack.\n\nIf the version byte is 0, and the witness program is 32 bytes:\n* It is interpreted as a pay-to-witness-script-hash (P2WSH) program.\n* The witness must consist of an input stack to feed to the script, followed by a serialized script (<code>witnessScript</code>).\n* The <code>witnessScript</code> (≤ 10,000 bytes) is popped off the initial witness stack. SHA256 of the <code>witnessScript</code> must match the 32-byte witness program.\n* The <code>witnessScript</code> is deserialized, and executed after normal script evaluation with the remaining witness stack (≤ 520 bytes for each stack item).\n* The script must not fail, and result in exactly a single TRUE on the stack.\n\nIf the version byte is 0, but the witness program is neither 20 nor 32 bytes, the script must fail.<ref>For example, a scriptPubKey with OP_0 followed by a 40-byte non-zero data push will fail due to incorrect program size. However, a scriptPubKey with OP_0 followed by a 41-byte non-zero data push will pass, since it is not considered to be a witness program</ref>\n\nIf the version byte is 1 to 16, no further interpretation of the witness program or witness stack happens, and there is no size restriction for the witness stack. These versions are reserved for future extensions.<ref>For backward compatibility, for any version byte from 0 to 16, the script must fail if the witness program has a <code>CastToBool</code> value of zero. However, having a hash like this is a successful preimage attack against the hash function, and the risk is negligible.</ref>\n\n=== Other consensus critical limits ===\n\n==== Block size ====\n\nBlocks are currently limited to 1,000,000 bytes (1MB) total size. We change this restriction as follows:\n\n''Block weight'' is defined as ''Base size'' * 3 + ''Total size''. (rationale<ref>Rationale of using a single composite constraint, instead of two separate limits such as 1MB base data and 3MB witness data: Using two separate limits would make mining and fee estimation nearly impossible. Miners would need to solve a complex non-linear optimization problem to find the set of transactions that maximize fees given both constraints, and wallets would not be able to know what to pay as it depends on which of the two conditions is most constrained by the time miners try to produce blocks with their transactions in. Another problem with such an approach is freeloading. Once a set of transactions hit the base data 1MB constraint, up to 3MB extra data could be added to the witness by just minimally increasing the fee. The marginal cost for extra witness space effectively becomes zero in that case.</ref>)\n\n''Base size'' is the block size in bytes with the original transaction serialization without any witness-related data, as seen by a non-upgraded node.\n\n''Total size'' is the block size in bytes with transactions serialized as described in [[bip-0144.mediawiki|BIP144]], including base data and witness data.\n\nThe new rule is ''block weight'' ≤ 4,000,000.\n\n==== Sigops ====\n\nSigops per block is currently limited to 20,000. We change this restriction as follows:\n\nSigops in the current pubkey script, signature script, and P2SH check script are counted at 4 times their previous value.\nThe sigop limit is likewise quadrupled to ≤ 80,000.\n\nEach P2WPKH input is counted as 1 sigop. In addition, opcodes within a P2WSH <code>witnessScript</code> are counted identically as previously within the P2SH <code>redeemScript</code>. That is, CHECKSIG is counted as only 1 sigop. When preceded by OP_1 to OP_16 CHECKMULTISIG is counted as 1 to 16 sigops respectively, otherwise it is counted as 20 sigops. This rule applies to both native witness program and P2SH witness program.\n\n=== Additional definitions ===\n\nThe following definitions are not used for consensus limits, but are suggested to provide language consistent with the terminology introduced above.\n\n==== Transaction size calculations ====\n\n''Transaction weight'' is defined as ''Base transaction size'' * 3 + ''Total transaction size'' (ie. the same method as calculating ''Block weight'' from ''Base size'' and ''Total size'').\n\n''Virtual transaction size'' is defined as ''Transaction weight'' / 4 (rounded up to the next integer).\n\n''Base transaction size'' is the size of the transaction serialised with the witness data stripped.\n\n''Total transaction size'' is the transaction size in bytes serialized as described in [[bip-0144.mediawiki|BIP144]], including base data and witness data.\n\n=== New script semantics ===\n\nDespite that the script language for P2WPKH and P2WSH looks very similar to pre-segregated witness script, there are several notable differences. Users MUST NOT assume that a script spendable in pre-segregated witness system would also be spendable as a P2WPKH or P2WSH script. Before large-scale deployment in the production network, developers should test the scripts on testnet with the default relay policy turned on, and with a small amount of money after BIP141 is activated on mainnet.\n\nA major difference at consensus level is described in [https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki BIP143], as a new transaction digest algorithm for signature verification in version 0 witness program.\n\nThree relay and mining policies are also included in the first release of segregated witness at reference implementation version 0.13.1. Softforks based on these policies are likely to be proposed in the near future. To avoid indefinite delay in transaction confirmation and permanent fund loss in a potential softfork, users MUST observe the new semantics carefully:\n\n# Only compressed public keys are accepted in P2WPKH and P2WSH (See [https://github.com/bitcoin/bips/blob/master/bip-0143.mediawiki#Restrictions_on_public_key_type BIP143])\n# The argument of OP_IF/NOTIF in P2WSH must be minimal<ref>https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2016-August/013014.html</ref>\n# Signature(s) must be null vector(s) if an OP_CHECKSIG or OP_CHECKMULTISIG is failed (for both pre-segregated witness script and P2WSH. See [https://github.com/bitcoin/bips/blob/master/bip-0146.mediawiki BIP146])\n\n== Examples ==\n\n=== P2WPKH ===\n\nThe following example is a version 0 pay-to-witness-public-key-hash (P2WPKH):\n\n    witness:      <signature> <pubkey>\n    scriptSig:    (empty)\n    scriptPubKey: 0 <20-byte-key-hash>\n                  (0x0014{20-byte-key-hash})\n\nThe '0' in scriptPubKey indicates the following push is a version 0 witness program. The length of the witness program indicates that it is a P2WPKH type. The witness must consist of exactly 2 items. The HASH160 of the pubkey in witness must match the witness program.\n\nThe signature is verified as\n\n    <signature> <pubkey> CHECKSIG\n\nComparing with a traditional P2PKH output, the P2WPKH equivalent occupies 3 less bytes in the scriptPubKey, and moves the signature and public key from scriptSig to witness.\n\n=== P2WPKH nested in BIP16 P2SH ===\n\nThe following example is the same P2WPKH, but nested in a BIP16 P2SH output.\n\n    witness:      <signature> <pubkey>\n    scriptSig:    <0 <20-byte-key-hash>>\n                  (0x160014{20-byte-key-hash})\n    scriptPubKey: HASH160 <20-byte-script-hash> EQUAL\n                  (0xA914{20-byte-script-hash}87)\n\nThe only item in scriptSig is hashed with HASH160, compared against the 20-byte-script-hash in scriptPubKey, and interpreted as:\n\n    0 <20-byte-key-hash>\n\nThe public key and signature are then verified as described in the previous example.\n\nComparing with the previous example, the scriptPubKey is 1 byte bigger and the scriptSig is 23 bytes bigger. Although a nested witness program is less efficient, its payment address is fully transparent and backward compatible for all Bitcoin reference client since version 0.6.0.\n\n=== P2WSH ===\n\nThe following example is an 1-of-2 multi-signature version 0 pay-to-witness-script-hash (P2WSH).\n\n    witness:      0 <signature1> <1 <pubkey1> <pubkey2> 2 CHECKMULTISIG>\n    scriptSig:    (empty)\n    scriptPubKey: 0 <32-byte-hash>\n                  (0x0020{32-byte-hash})\n\nThe '0' in scriptPubKey indicates the following push is a version 0 witness program. The length of the witness program indicates that it is a P2WSH type. The last item in the witness (the \"witnessScript\") is popped off, hashed with SHA256, compared against the 32-byte-hash in scriptPubKey, and deserialized:\n\n    1 <pubkey1> <pubkey2> 2 CHECKMULTISIG\n\nThe script is executed with the remaining data from witness:\n\n    0 <signature1> 1 <pubkey1> <pubkey2> 2 CHECKMULTISIG\n\nP2WSH allows maximum script size of 10,000 bytes, as the 520-byte push limit is bypassed.\n\nThe scriptPubKey occupies 34 bytes, as opposed to 23 bytes of BIP16 P2SH. The increased size improves security against possible collision attacks, as 2<sup>80</sup> work is not infeasible anymore (By the end of 2015, 2<sup>84</sup> hashes have been calculated in Bitcoin mining since the creation of Bitcoin). The spending script is same as the one for an equivalent BIP16 P2SH output but is moved to witness.\n\n=== P2WSH nested in BIP16 P2SH ===\n\nThe following example is the same 1-of-2 multi-signature P2WSH script, but nested in a BIP16 P2SH output.\n\n    witness:      0 <signature1> <1 <pubkey1> <pubkey2> 2 CHECKMULTISIG>\n    scriptSig:    <0 <32-byte-hash>>\n                  (0x220020{32-byte-hash})\n    scriptPubKey: HASH160 <20-byte-hash> EQUAL\n                  (0xA914{20-byte-hash}87)\n\nThe only item in scriptSig is hashed with HASH160, compared against the 20-byte-hash in scriptPubKey, and interpreted as:\n\n    0 <32-byte-hash>\n\nThe P2WSH witnessScript is then executed as described in the previous example.\n\nComparing with the previous example, the scriptPubKey is 11 bytes smaller (with reduced security) while witness is the same. However, it also requires 35 bytes in scriptSig.\n\n=== Extensible commitment structure ===\n\nThe new commitment in coinbase transaction is a hash of the <code>witness root hash</code> and a <code>witness reserved value</code>. The <code>witness reserved value</code> currently has no consensus meaning, but in the future allows new commitment values for future softforks. For example, if a new consensus-critical commitment is required in the future, the commitment in coinbase becomes:\n\n  Double-SHA256(Witness root hash|Hash(new commitment|witness reserved value))\n\nFor backward compatibility, the <code>Hash(new commitment|witness reserved value)</code> will go to the coinbase witness, and the <code>witness reserved value</code> will be recorded in another location specified by the future softfork. Any number of new commitment could be added in this way.\n\nAny commitments that are not consensus-critical to Bitcoin, such as merge-mining, MUST NOT use the <code>witness reserved value</code> to preserve the ability to do upgrades of the Bitcoin consensus protocol.\n\nThe optional data space following the commitment also leaves room for metadata of future softforks, and MUST NOT be used for other purpose.\n\n=== Trust-free unconfirmed transaction dependency chain ===\n\nSegregated witness fixes the problem of transaction malleability fundamentally, which enables the building of unconfirmed transaction dependency chains in a trust-free manner.\n\nTwo parties, Alice and Bob, may agree to send certain amount of Bitcoin to a 2-of-2 multisig output (the \"funding transaction\"). Without signing the funding transaction, they may create another transaction, time-locked in the future, spending the 2-of-2 multisig output to third account(s) (the \"spending transaction\"). Alice and Bob will sign the spending transaction and exchange the signatures. After examining the signatures, they will sign and commit the funding transaction to the blockchain. Without further action, the spending transaction will be confirmed after the lock-time and release the funding according to the original contract. It also retains the flexibility of revoking the original contract before the lock-time, by another spending transaction with shorter lock-time, but only with mutual-agreement of both parties.\n\nSuch setups are not possible with BIP62 as the malleability fix, since the spending transaction could not be created without both parties first signing the funding transaction. If Alice reveals the funding transaction signature before Bob does, Bob is able to lock up the funding indefinitely without ever signing the spending transaction.\n\nUnconfirmed transaction dependency chain is a fundamental building block of more sophisticated payment networks, such as duplex micropayment channel and the Lightning Network, which have the potential to greatly improve the scalability and efficiency of the Bitcoin system.\n\n== Future extensions ==\n\n=== Compact fraud proof for SPV nodes ===\n\nBitcoin right now only has two real security models. A user either runs a full-node which validates every block with all rules in the system, or a SPV (Simple Payment Verification) client which only validates the headers as a proof of publication of some transactions. The Bitcoin whitepaper suggested that SPV nodes may accept alerts from full nodes when they detect an invalid block, prompting the SPV node to download the questioned blocks and transactions for validation. This approach, however, could become a DoS attack vector as there is virtually no cost to generate a false alarm. An alarm must come with a compact, yet deterministic fraud proof.\n\nIn the current Bitcoin protocol, it is possible to generate compact fraud proof for almost all rules except a few:\n\n# It is not possible to prove a miner has introduced too many Bitcoins in the coinbase transaction outputs without showing the whole block itself and all input transactions.\n# It is not possible to prove the violation of any block specific constraints, such as size and sigop limits, without showing the whole block (and all input transactions in the case of sigop limit)\n# It is not possible to prove the spending of a non-existing input without showing all transaction IDs in the blockchain way back to the genesis block.\n\nExtra witness data can be committed that allows short proofs of block invalidity that SPV nodes can quickly verify:\n\n# Sum trees for transaction fee can be committed making it possible to construct short proofs that the miner does not add excessive fees to the coinbase transaction. Similar for the block size and sigop count limit.\n# Backlinks for the outputs spent by the transaction's inputs can be provided. These backlinks consist of a block hash and an offset that thin clients can easily query and check to verify that the outputs exist.\n\nThese commitments could be included in the extensible commitment structure through a soft fork and will be transparent to nodes that do not understand such new rules.\n\n=== New script system ===\n\nSince a version byte is pushed before a witness program, and programs with unknown versions are always considered as anyone-can-spend script, it is possible to introduce any new script system with a soft fork. The witness as a structure is not restricted by any existing script semantics and constraints, the 520-byte push limit in particular, and therefore allows arbitrarily large scripts and signatures.\n\nExamples of new script system include Schnorr signatures which reduce the size of multisig transactions dramatically, Lamport signature which is quantum computing resistance, and Merklized abstract syntax trees which allow very compact witness for conditional scripts with extreme complexity.\n\n=== Per-input lock-time and relative-lock-time ===\n\nCurrently there is only one nLockTime field in a transaction and all inputs must share the same value. [https://github.com/bitcoin/bips/blob/master/bip-0068.mediawiki BIP68] enables per-input relative-lock-time using the nSequence field, however, with a limited lock-time period and resolution.\n\nWith a soft fork, it is possible to introduce a separate witness structure to allow per-input lock-time and relative-lock-time, and a new script system that could sign and manipulate the new data (like [https://github.com/bitcoin/bips/blob/master/bip-0065.mediawiki BIP65] and [https://github.com/bitcoin/bips/blob/master/bip-0112.mediawiki BIP112]).\n\n== Backward compatibility ==\n\nAs a soft fork, older software will continue to operate without modification.  Non-upgraded nodes, however, will not see nor validate the witness data and will consider all witness programs as anyone-can-spend scripts (except a few edge cases where the witness programs are equal to 0, which the script must fail). Wallets should always be wary of anyone-can-spend scripts and treat them with suspicion. Non-upgraded nodes are strongly encouraged to upgrade in order to take advantage of the new features.\n\n'''What a non-upgraded wallet can do'''\n\n* Receiving bitcoin from non-upgraded and upgraded wallets\n* Sending bitcoin to non-upgraded and upgraded wallets with traditional P2PKH address (without any benefit of segregated witness)\n* Sending bitcoin to upgraded wallets using a P2SH address\n* Sending bitcoin to upgraded wallets using a native witness program through [https://github.com/bitcoin/bips/blob/master/bip-0070.mediawiki BIP70] payment protocol\n\n'''What a non-upgraded wallet cannot do'''\n\n* Validating segregated witness transaction. It assumes such a transaction is always valid\n\n== Deployment ==\n\nThis BIP will be deployed by \"version bits\" BIP9 with the name \"segwit\" and using bit 1.\n\nFor Bitcoin mainnet, the BIP9 starttime will be midnight 15 november 2016 UTC (Epoch timestamp 1479168000) and BIP9 timeout will be midnight 15 november 2017 UTC (Epoch timestamp 1510704000).\n\nFor Bitcoin testnet, the BIP9 starttime will be midnight 1 May 2016 UTC (Epoch timestamp 1462060800) and BIP9 timeout will be midnight 1 May 2017 UTC (Epoch timestamp 1493596800).\n\n== Credits ==\n\nSpecial thanks to Gregory Maxwell for originating many of the ideas in this BIP and Luke-Jr for figuring out how to deploy this as a soft fork.\n\n== Footnotes ==\n\n<references />\n\n== Reference Implementation ==\n\nhttps://github.com/bitcoin/bitcoin/pull/8149\n\n== References ==\n\n*[[bip-0016.mediawiki|BIP16 Pay to Script Hash]]\n*[[bip-0143.mediawiki|BIP143 Transaction Signature Verification for Version 0 Witness Program]]\n*[[bip-0144.mediawiki|BIP144 Segregated Witness (Peer Services)]]\n*[[bip-0173.mediawiki|BIP173 Base32 address format for native v0-16 witness outputs]]\n\n== Copyright ==\n\nThis document is placed in the public domain.\n","language":"text/plain","encrypted":false,"added":1622498412},{"paste_id":8,"description":"Raridade - Anderson Freire","body":"Não consigo ir além do teu olhar\nTudo o que eu consigo é imaginar\nA riqueza que existe dentro de você\n\nO ouro eu consigo só admirar\nMas te olhando eu posso a Deus adorar\nSua alma é um bem que nunca envelhecerá\n\nO pecado não consegue esconder\nA marca de Jesus que existe em você\nO que você fez ou deixou de fazer\nNão mudou o início, Deus escolheu você\nSua raridade não está\nNaquilo que você possui\nOu que sabe fazer\nIsso é mistério de Deus com você\n\nVocê é um espelho que reflete\nA imagem do Senhor\nNão chore se o mundo ainda não notou\nJá é o bastante Deus reconhecer\nO seu valor\nVocê é precioso, mais raro que o ouro\nPuro de ofir\nSe você desistiu, Deus não vai desistir\nEle está aqui pra te levantar se o mundo te fizer cair\n\nO ouro eu consigo só admirar\nMas te olhando eu posso a Deus adorar\nSua alma é um bem que nunca envelhecerá\n\nO pecado não consegue esconder\nA marca de Jesus que existe em você\nO que você fez ou deixou de fazer\nNão mudou o início, Deus escolheu você\nSua raridade não está\nNaquilo que você possui\nOu que sabe fazer\nIsso é mistério de Deus com você\n\nVocê é um espelho que reflete\nA imagem do Senhor\nNão chore se o mundo ainda não notou\nJá é o bastante Deus reconhecer\nO seu valor\nVocê é precioso, mais raro que o ouro\nPuro de ofir\nSe você desistiu, Deus não vai desistir\nEle está aqui pra te levantar\nSe o mundo te fizer cair\n\nVocê é um espelho que reflete\nA imagem do Senhor\nNão chore se o mundo ainda não notou\nJá é o bastante Deus reconhecer\nO seu valor\nVocê é precioso, mais raro que o ouro\nPuro de ofir\nSe você desistiu, Deus não vai desistir\nEle está aqui pra te levantar\nSe o mundo te fizer cair\n\nVocê é um espelho que reflete\nA imagem do Senhor\nNão chore se o mundo ainda não notou\nJá é o bastante Deus reconhecer\nO seu valor\nVocê é precioso, mais raro que o ouro\nPuro de ofir\nSe você desistiu, Deus não vai desistir\nEle está aqui pra te levantar\nSe o mundo te fizer cair","language":"text/plain","encrypted":false,"added":1622516751},{"paste_id":9,"description":"Imortalidade | Nerdologia","body":"DeWoody, J.; Rowe, C.A.; Hipkins, V.D.; Mock, K.E. (2008). \"\"Pando\" Lives: Molecular Genetic Evidence of a Giant Aspen Clone in Central Utah\". Western North American Naturalist 68 (4): 493–497. doi:10.3398/1527-0904-68.4.493.\nJochum, Klaus Peter, Xiaohong Wang, Torsten W. Vennemann, Bärbel Sinha, and Werner EG Müller. \"Siliceous deep-sea sponge Monorhaphis chuni: A potential paleoclimate archive in ancient animals.\" Chemical Geology 300 (2012): 143-151.\nArnaud-Haond, Sophie, Carlos M. Duarte, Elena Diaz-Almela, Núria Marbà, Tomas Sintes, and Ester A. Serrão. \"Implications of extreme life span in clonal organisms: millenary clones in meadows of the threatened seagrass Posidonia oceanica.\" PLoS One 7, no. 2 (2012): e30454.\n","language":"text/plain","encrypted":false,"added":1623157389},{"paste_id":10,"description":"Poderes de regeneração do Deadpool | Nerdologia","body":"- Brockes, Jeremy P., and Anoop Kumar. \"Appendage regeneration in adult vertebrates and implications for regenerative medicine.\" Science 310, no. 5756 (2005): 1919-1923.\n-Seifert, Ashley W., Stephen G. Kiama, Megan G. Seifert, Jacob R. Goheen, Todd M. Palmer, and Malcolm Maden. \"Skin shedding and tissue regeneration in African spiny mice (Acomys).\" Nature 489, no. 7417 (2012): 561-565.\n-Brockes, Jeremy P., and Anoop Kumar. \"Comparative aspects of animal regeneration.\" Annual review of cell and developmental biology 24 (2008): 525-549.","language":"text/plain","encrypted":false,"added":1623157516},{"paste_id":11,"description":"A mulher que mudou a medicina, Henrietta Lacks | Nerdologia","body":"Burkitt, D. (1958). A sarcoma involving the jaws in african children. British Journal of Surgery, 46(197), 218-223. doi:10.1002/bjs.18004619704\nEpstein, M. A., Achong, B. G., & Barr, Y. M. (1964). Virus Particles in Cultured Lymphoblasts from Burkitt’s Lymphoma. Lancet, 1(7335), 702-3.\nBosch, Francesc X., Attila Lorincz, Nubia Muñoz, C. J. L. M. Meijer, and Keerti V. Shah. \"The causal relation between human papillomavirus and cervical cancer.\" Journal of clinical pathology 55, no. 4 (2002): 244-265.\nDürst, Matthias, Lutz Gissmann, Hans Ikenberg, and Harald Zur Hausen. \"A papillomavirus DNA from a cervical carcinoma and its prevalence in cancer biopsy samples from different geographic regions.\" Proceedings of the National Academy of Sciences 80, no. 12 (1983): 3812-3815.\nBoshart, Michael, Lutz Gissmann, Hans Ikenberg, Andreas Kleinheinz, Wolfram Scheurlen, and H. zur Hausen. \"A new type of papillomavirus DNA, its presence in genital cancer biopsies and in cell lines derived from cervical cancer.\" The EMBO journal 3, no. 5 (1984): 1151-1157.","language":"text/plain","encrypted":false,"added":1623157754},{"paste_id":12,"description":"Híbridos humanos e o homúnculo | Nerdologia","body":"-Bedford, J. M. \"Sperm/egg interaction: the specificity of human spermatozoa.\" The Anatomical Record 188, no. 4 (1977): 477-487.\n-O'Bleness, Majesta, Veronica B. Searles, Ajit Varki, Pascal Gagneux, and James M. Sikela. \"Evolution of genetic and genomic features unique to the human lineage.\" Nature Reviews Genetics 13, no. 12 (2012): 853-866.\n-Rossiianov, Kirill. \"Beyond species: Il’ya Ivanov and his experiments on cross-breeding humans with anthropoid apes.\" Science in Context 15, no. 02 (2002): 277-316.\n-Sankararaman, Sriram, Swapan Mallick, Michael Dannemann, Kay Prüfer, Janet Kelso, Svante Pääbo, Nick Patterson, and David Reich. \"The genomic landscape of Neanderthal ancestry in present-day humans.\" Nature 507, no. 7492 (2014): 354-357.\n-Vernot, Benjamin, and Joshua M. Akey. \"Resurrecting surviving Neandertal lineages from modern human genomes.\" Science 343, no. 6174 (2014): 1017-1021.","language":"text/plain","encrypted":false,"added":1623158205},{"paste_id":13,"description":"Quimeras | Nerdologia","body":"-Darst, Catherine R., Pablo A. Menéndez‐Guerrero, Luis A. Coloma, and David C. Cannatella. \"Evolution of dietary specialization and chemical defense in poison frogs (Dendrobatidae): a comparative analysis.\" The American Naturalist 165, no. 1 (2005): 56-69.\n-Saporito, Ralph A., H. Martin Garraffo, Maureen A. Donnelly, Adam L. Edwards, John T. Longino, and John W. Daly. \"Formicine ants: an arthropod source for the pumiliotoxin alkaloids of dendrobatid poison frogs.\" Proceedings of the National Academy of Sciences of the United States of America 101, no. 21 (2004): 8045-8050.\n-Stynoski, Jennifer L., Yaritbel Torres-Mendoza, Mahmood Sasa-Marin, and Ralph A. Saporito. \"Evidence of maternal provisioning of alkaloid‐based chemical defenses in the strawberry poison frog Oophaga pumilio.\" Ecology 95, no. 3 (2014): 587-593.\n-Ross, Corinna N., Jeffrey A. French, and Guillermo Ortí. \"Germ-line chimerism and paternal care in marmosets (Callithrix kuhlii).\" Proceedings of the National Academy of Sciences 104, no. 15 (2007): 6278-6282.\n-Dunsford, I., C. C. Bowley, Ann M. Hutchison, Joan S. Thompson, Ruth Sanger, and R. R. Race. \"Human blood-group chimera.\" British medical journal 2, no. 4827 (1953): 81.\nWolinsky, Howard. \"A mythical beast.\" EMBO reports 8, no. 3 (2007): 212-214.","language":"text/plain","encrypted":false,"added":1623158341},{"paste_id":14,"description":"Tudo É do Pai - Pe. Fábio de Melo","body":"Eu pensei que podia viver, por mim mesmo\nEu pensei que as coisas do mundo\nNão iriam me derrubar\nO orgulho tomou conta do meu ser\nE o pecado devastou o meu viver\n\nFui embora, disse ao Pai, dá-me o que é meu!\nDá-me a parte que me cabe da herança\nFui pro mundo\nGastei tudo\nMe restou só o pecado\nHoje eu sei que nada é meu\nTudo é do Pai\n\n(refrão)\nTudo é do Pai\nToda honra e toda glória\nÉ dele a vitória\nAlcançada em minha vida\nTudo é do Pai\nSe sou fraco e pecador\nBem mais forte é o meu Senhor\nQue me cura por amor. (bis)","language":"text/plain","encrypted":false,"added":1623440847},{"paste_id":15,"description":"Teletransporte | Nerdologia","body":"-Glasstone, Samuel; Dolan, Philip J. (1977). The Effects of Nuclear Weapons, Third Edition. United States: United States Department of Defense and United States Department of Energy. [Pdf] https://web.archive.org/web/20200922074915/http://www.fourmilab.ch/etexts/www/effects/eonw_1.pdf\n-Bennett, Charles H., Gilles Brassard, Claude Crépeau, Richard Jozsa, Asher Peres, and William K. Wootters. \"Teleporting an unknown quantum state via dual classical and Einstein-Podolsky-Rosen channels.\" Physical review letters 70, no. 13 (1993): 1895.\n-Einstein, Albert, Boris Podolsky, and Nathan Rosen. \"Can quantum-mechanical description of physical reality be considered complete ?.\" Physical review 47, no. 10 (1935): 777.\n-Lemos, Gabriela Barreto, Victoria Borish, Garrett D. Cole, Sven Ramelow, Radek Lapkiewicz, and Anton Zeilinger. \"Quantum imaging with undetected photons.\" Nature 512, no. 7515 (2014): 409-412.\n-Yin, Juan, Ji-Gang Ren, He Lu, Yuan Cao, Hai-Lin Yong, Yu-Ping Wu, Chang Liu et al. \"Quantum teleportation and entanglement distribution over 100-kilometer free-space channels.\" Nature 488, no. 7410 (2012): 185-188.\n-Sender, Ron, Shai Fuchs, and Ron Milo. \"Are we really vastly outnumbered? Revisiting the ratio of bacterial to host cells in humans.\" Cell 164, no. 3 (2016): 337-340.","language":"text/plain","encrypted":false,"added":1623551935},{"paste_id":16,"description":"Dobra espacial e Millennium Falcon | Nerdologia","body":"-Morris, Michael S., Kip S. Thorne, and Ulvi Yurtsever. \"Wormholes, time machines, and the weak energy condition.\" Physical Review Letters 61, no. 13 (1988): 1446.\n-Alcubierre, Miguel. \"The warp drive: hyper-fast travel within general relativity.\" Classical and Quantum Gravity 11, no. 5 (1994): L73.\n-McMonigal, Brendan, Geraint F. Lewis, and Philip O’Byrne. \"Alcubierre warp drive: On the matter of matter.\" Physical Review D 85, no. 6 (2012): 064024.","language":"text/plain","encrypted":false,"added":1623552236},{"paste_id":17,"description":"COMO FAZER UM SABRE DE LUZ | Nerdologia","body":"- Hurricane, O. A., D. A. Callahan, D. T. Casey, P. M. Celliers, C. Cerjan, E. L. Dewald, T. R. Dittrich et al. \"Fuel gain exceeding unity in an inertially confined fusion implosion.\" Nature (2014).\n\n- Firstenberg, Ofer, Thibault Peyronel, Qi-Yu Liang, Alexey V. Gorshkov, Mikhail D. Lukin, and Vladan Vuletić. \"Attractive photons in a quantum nonlinear medium.\" Nature (2013).","language":"text/plain","encrypted":false,"added":1623553193}],"comment":[]}