{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 9,
	"comment": {
		"1619199374_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 1,
				"body": "funny for example, mexico opposes gmo, so what does foxnews does > a piece on santa muerte... \nyesterday cnn reaired it's piece of the filth with psyweapon, meanwhile vlad at the church...\nit becomes too pathetic guys\nso the biz of us medias is to bid itself to disinformation... okay...",
				"added": 1619948557
			},
			{
				"comment_id": 7,
				"body": "so the only goal of the talking heads in the disinformation medium (msn) is too look credible?\n\nI wouldn't be surprised if the strategy isn't in reality to really go down the rabbit hole, aka to expose you all, to get a real cultural revolution, to reestablish america... who knows... because yes, it's only when most of the american people will want you dead, that the real restoration can have a sense, and I guess you still have to fall more... at one point you will ask for their heads... you will see...",
				"added": 1619949221
			},
			{
				"comment_id": 8,
				"body": "and those of their children, that's the moment you will be ready to be free again... until then good luck mindcaptives...",
				"added": 1619949261
			}
		],
		"1618578079_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 2,
				"body": "I wanted to say, I got your little disinformation play, to condition the american mind saying : president bidet.... meanwhile the raw dnc media, never said president trump... they said mr trump, donald trump, trump admin etc.\nand I know you are nwo mr murdoch and you try to play hegelian controlled dialectic, however i know you are hate for china is real... we know it too, and you won't win. pla / mss / xinhua will always win over your filths. but nice and courageous to have tried...",
				"added": 1619948664
			},
			{
				"comment_id": 6,
				"body": "what makes we laugh is that you seriously believe that you have to be \"respected\", that you are valuable... for me you are objects, vermins or parasites... I don't know exactly, but I don't care, aka you are waste. all of you, and specially the bimbo, which I still don't know if they are just dumb or understand what they take part in... who knows, I guess, a few shekels and that's all they are worth...  sorry, I didn't meant to insult the great shekels... a few $.",
				"added": 1619949023
			}
		],
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 5,
				"body": "jesse watters, has declared war on santa muerte... If only the children of jesse waters were killed it would answer my question if he would still smile, I would :)\n\nof course it's part of their campaign to corner food supply... he who controls the food, don't care who prints the money, unless said money buys those with arms to take said food...",
				"added": 1619948917
			}
		]
	},
	"comment_vote": {}
}