{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1600713718,
			"title": "В РФ намерены запретить протоколы, позволяющие скрыть имя сайта",
			"body": "Началось общественное обсуждение проекта правового акта о внесении изменений в Федеральный закон \"Об информации, информационных технологиях и о защите информации\", разработанного Министерством цифрового развития, связи и массовых коммуникаций. В закон предложено ввести запрет на использование на территории Российской Федерации \"протоколов шифрования, позволяющих скрыть имя (идентификатор) ‎Интернет-страницы или сайта в сети Интернет, за исключением случаев, установленных законодательством Российской Федерации\".\n\nЗа нарушение запрета использования протоколов шифрования, позволяющих скрыть имя сайта предлагается приостановливать функционирование Интернет-ресурса в срок не позднее 1 (одного) рабочего дня со дня обнаружения данного нарушения уполномоченным на то федеральным органом исполнительной власти. Основной целью блокировки является TLS-расширение ECH (ранее известно как ESNI), которое может применяться совместно с TLS 1.3 и уже заблокировано в Китае. Так как формулировки в законопроекте размыты и отсутствует конкретика, кроме ECH/ESNI формально под блокировку могут попасть практически любые протоколы, обеспечивающие полное шифрование канала связи, а также протоколы DNS поверх HTTPS (DoH) и DNS поверх TLS (DoT).\n\nНапомним, что для организации работы на одном IP-адресе нескольких HTTPS-сайтов в своё время было разработано расширение SNI, осуществляющее передачу имени хоста в открытом виде в сообщении ClientHello, передаваемом до установки шифрованного канала связи. Подобная особенность даёт возможность на стороне интернет-провайдера выборочно фильтровать HTTPS-трафик и анализировать какие сайты открывает пользователь, что не позволяет добиться полной конфиденциальности при применении HTTPS.\n\nECH/ESNI полностью исключает утечку сведений о запрашиваемом сайте при анализе HTTPS-соединений. В сочетании с обращением через сеть доставки контента применение ECH/ESNI также даёт возможность скрыть от провайдера и IP-адрес запрашиваемого ресурса - системы инспектирования трафика видят только обращения к CDN и не могут применить блокировку без подмены TLS-сеанса, в случае которой в браузере пользователя будет показано соответствующее уведомление о подмене сертификата. В случае введения запрета ECH/ESNI для противостояния подобной возможности может помочь лишь полное ограничение доступа к сетям доставки контента (CDN), поддерживающим ECH/ESNI, иначе блокировка будет неэффективной и сможет легко обходиться при помощи CDN.\n\nПри использовании ECH/ESNI имя хоста как и в SNI передаётся в сообщении ClientHello, но содержимое передаваемых в данном сообщении данных зашифровано. Для шифрования используется секрет, вычисленный на основе ключей сервера и клиента. Для расшифровки перехваченного или полученного значения поля ECH/ESNI необходимо знать закрытый ключ клиента или сервера (плюс открытые ключи сервера или клиента). Информация об открытых ключах передаётся для серверного ключа в DNS, а для клиентского ключа в сообщении ClientHello. Расшифровка также возможна при помощи согласованного в процессе установки TLS-соединения общего секрета, известного только клиенту и серверу.\n\nПроголосовать против или за можно тут https://regulation.gov.ru/projects#npa=108513",
			"added": 1600713717
		},
		{
			"topic_id": 1600803262,
			"title": "OpenWrt Видео мануалы на русском",
			"body": "https://www.youtube.com/watch?v=ZTdVWc_nErA\nhttps://www.youtube.com/watch?v=0NOITqpZhqo\nhttps://www.youtube.com/watch?v=9wlsb8fvpd0\nhttps://www.youtube.com/watch?v=KVIppac4Ylk\nhttps://www.youtube.com/watch?v=z6-1ldbKc9I",
			"added": 1600803260
		},
		{
			"topic_id": 1600842991,
			"title": "ARM Cortex",
			"body": "https://www.youtube.com/watch?v=53kAUqmFpmE\n\nhttps://www.youtube.com/watch?v=G7zPm2bB-pM",
			"added": 1600842988
		},
		{
			"topic_id": 1601005630,
			"title": "В сеть утекли исходные коды операционной системы Windows XP и Server 2003",
			"body": "Также как и слив Intel я увидел этот слив у Antifa, который потом объединили в один архив на другом канале Telegram и выложили на 4channel. Слив включает в себя исходники DirectX 8 и Microsoft Paint и весит 12.9 Гбайт в распакованном виде и 2.539 Гбайт в запакованном (обе ОСи). Есть также полный торрент (magnet в комментах), вам нужен файл nt5src.rar (не windows_xp_source, это другой запороленный архив).\n\n\nВо многих файлах добавлена поддержка IA64. Есть pow.s, на ассемблере. mspaint в XPSP1\\NT\\shell\\osshell\\accesory\\mspaint\\ вполне компилируется! Содержит игры Hearts (на C++), Reversi, Solitare! Также есть исходники mssipotf, которые позволяют подписывать файлы шрифтов и проверять эти подписи (MD5 + RSA). Материал, возможно, будет дополняться.\n\nКачаем https://github.com/DEgITx/rats-search/releases и ищим там фаил nt5src.rar",
			"added": 1601005626
		}
	],
	"topic_vote": {
		"1592487565_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1596965084_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": [
			{
				"comment_id": 1,
				"body": "BitMessage он NAT не пробивает для его работы нужен открытый порт",
				"added": 1600760705
			}
		],
		"1596965501_19cz9jvEMzCTG3fBnUzwvZhxt1DnrQXxJJ": [
			{
				"comment_id": 2,
				"body": "для jabber/irc есть i2p а ZeroNet это скорее противоцензурное средство это обычный торрент правда с шифрованием",
				"added": 1600760824
			}
		],
		"1600713718_1Jxw16HD6aiTyRHnpwE7tupnLn8SCsKaEA": [
			{
				"comment_id": 3,
				"body": "сайты обяжет использовать только http а те что откажутся заблокируют или же рашка создаст свой анальный протокол",
				"added": 1600772444
			},
			{
				"comment_id": 4,
				"body": "Проголосовать против или за можно тут https://regulation.gov.ru/projects#npa=108513",
				"added": 1600800903
			}
		],
		"1592487565_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 5,
				"body": "Видео супер",
				"added": 1600803354
			}
		],
		"1597169972_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 6,
				"body": "Helio G85 против Snapdrago\n\nhttps://www.youtube.com/watch?v=aXYuq6gsDj4",
				"added": 1600932203
			}
		]
	},
	"comment_vote": {
		"1_1CTh9GN7q8ny4WFFXCWm1eHAyyqLrrLssc": 1
	}
}