{
	"next_post_id": 7,
	"next_comment_id": 14,
	"next_follow_id": 3,
	"avatar": "jpg",
	"user_name": "Daz",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1558005602,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1558006108,
			"body": "Ok let's see how this zeroMe works will some strange people just pop over and say hi. may be some free thinkers will pop in.  ",
			"date_added": 1558006106
		},
		{
			"post_id": 1558214868,
			"body": "In The Land of The Blind The One Eyed Man Is King \nBalance yourself to Balance the world.",
			"date_added": 1558214865,
			"meta": "{\"img\":\"900,264,655788257256245322333246877135876677356,01234567778177464997AB794C4999\"}"
		},
		{
			"post_id": 1559151864,
			"body": "How big does the Elephant in the room have to be before how many times do you have to say blimey he or she was only xx years old and now they are dead. How much freedom of speech do you have to lose. how many times do you have to vote No before they under stand one of the most simple word on earth NO. it seems to me that if the so called Zionist Jews keep taking peoples rights away. and banning free thinkers. They will end up giving a very negative view to the rest of the world on all Jews. I did watch a video some years back called Not In My Name. the young chap got a good beating by the Israeli police so it does seem the Zionist Jew  hate any one that speaks out about the NWO and use the poor Jews to hide behind.    ",
			"date_added": 1559151860,
			"meta": "{\"img\":\"900,506,000444766111a77aab56a125988a98979236643532754556,01122221300144567330389A99BCD302EF227EC03F1FFF11100371F1F373\"}"
		},
		{
			"post_id": 1560708388,
			"body": "Hi just popped in had to leave Fbook they just removed people if they did not like my name. Very strange because my old and new friends all knew my name.  ",
			"date_added": 1560708383
		},
		{
			"post_id": 1581254593,
			"body": "https://www.youtube.com/watch?v=Iu4rw2Iux1s",
			"date_added": 1581254587
		}
	],
	"post_like": {
		"1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1558214868": 1558214905
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Hi Vargink you are my first contact thank you im over in Brexit country and we have had some sunny days. hope i find you well. may best Daz ",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1558006108",
			"date_added": 1558035418
		},
		{
			"comment_id": 2,
			"body": "You are welcome quite easy we just send the chemical planes over they spray sky goes grey with the right wind we bring you rain.  ",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1558006108",
			"date_added": 1558082574
		},
		{
			"comment_id": 3,
			"body": "Yer so strange some countries are thinking of banning it because if the bankers have problems with a country they can flood them out of dry them out. what every you do don't tell to many people. They just get upset and go into a deep deep depression. One last thing if you notice lots of people dying around the age of fifty don't worry its just a side affect. my best daz",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1558006108",
			"date_added": 1558101056
		},
		{
			"comment_id": 4,
			"body": "so sad",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560629872",
			"date_added": 1560709286
		},
		{
			"comment_id": 5,
			"body": "first off if you are going to say anything remotely serous we have to look very smart suit and tie if possible, trouser  smart shirt no silly hats hide the tattoos. people are programmed to listen to people who look smart. if people are talking about children's games or tv shows or films, music, sure people can look as silly as they like silly hats the whole nine yards. same thing if you want to protest do it in a suite  just think how it looks police dragging a smart young chap dressed the way the rich people dress.      ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560566114",
			"date_added": 1560711237
		},
		{
			"comment_id": 6,
			"body": "@Jaka Tanker: \n@Kid Courageous: \nlol after getting my site on youtub taken down after five years, I lasted quite long my friends was getting taken out so fast at that time it was hard keeping up with the new names. I decided to think of a name that would sound so cool if Fbook took me down. lol please remember I am not a overly religious  person but there is one saying most English people use all the time\" God knows why\" I thought it would sound cool to send out a message that every one would remember my name\" God Knows Why\" fbook banned my name. Of course  most people knew it was not my real name. had some good friends who shared some great nwo info but as you all know fbook started to stop people getting your posts. hope we can start sharing info to keep each other safe and have fun along the way. god know why      ",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1560708388",
			"date_added": 1560722797
		},
		{
			"comment_id": 7,
			"body": "@Jaka Tanker: The young people do it all the time, in English schools Gay means means bad, poor, shit, I had no idea what they was talking about. so the word the TV shows was using for queer gay people meant 180 degrees the opposite. ugly, nasty, \nbad, so that MP is so gay is not meant as a happy man, but a man who loves his paralic member pushed in dirty siht who is evil. the young ones had worked it out. own our own culture.  Learn to say NO and ask why. Unlike many people I think there is still some wonderful teaching in the bible. wow some guy came along and kicked some banking Jews out of the church buildings. history just repeats nothing is new. Sorry did not mean to bore you.   ",
			"post_uri": "1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD_1560566114",
			"date_added": 1560726871
		},
		{
			"comment_id": 8,
			"body": "@Kid Courageous: lol yer those old people Ps how old is old I might have to get insulted lol and very upset he called me old. lol",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1560708388",
			"date_added": 1560727087
		},
		{
			"comment_id": 9,
			"body": "I would have black eyes all the time no way people would think I was a panda.  ",
			"post_uri": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560049640",
			"date_added": 1560727468
		},
		{
			"comment_id": 10,
			"body": "god is a woman every one knows that ",
			"post_uri": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1560003000",
			"date_added": 1560727530
		},
		{
			"comment_id": 11,
			"body": "Will you watch it.  Eye will  what ever you do don't cross the line",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1581254593",
			"date_added": 1581254692
		},
		{
			"comment_id": 12,
			"body": "lol yer what ever you do don't watch it twice lol cheers hope it played ok so hard to get any view unless you are a big corporation selling a big movie but the small club fils have no chance of getting any views or interest  but hay I had a go. ",
			"post_uri": "1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr_1581254593",
			"date_added": 1581259347
		},
		{
			"comment_id": 13,
			"body": "Great please seen me your money ASAP and being wonderful I will let you have some back when your down on your luck. at a modest rate of interest of course. PS i only want your gold and I will print out some bit of paper for you. cheers and may the moon god bless you  ",
			"post_uri": "1MLqjfXio3ZiogLZaoDaqsFxLBbhinzvPN_1581111499",
			"date_added": 1581264305
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "1PedoHubPRhuSRoVHspoeuTVvzHHxLM7Wf",
			"auth_address": "1HarLt9vMZty4Ceo4rwQZfqAEWdqhDNE3m",
			"user_name": "Lastofthefree",
			"date_added": 1558525575
		},
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6",
			"user_name": "Kid Courageous",
			"date_added": 1560727247
		}
	]
}