{
	"title": "BrainStorm",
	"description": "This is blog about great ideas, how to make money from them and all the fun we can have trying to make them work.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 12,
	"demo": false,
	"modified": 1539783564,
	"post": [
		{
			"post_id": 11,
			"title": "How to get lower prices with Cookies",
			"date_published": 1539782479.639,
			"body": "Companies use cookies to track users and show different prices according to what the company thinks the user is prepared to pay, so here's how to cheat their system :-\n\n1.  Find cookie IDs of people who get lower prices for certain items\n2.  Insert those Cookie IDs into your own web browser and get those lower prices.\n\n3.  Profit !\n\nHas this been done already ?\n\nWould it work ?"
		},
		{
			"post_id": 10,
			"title": "Project: BackWatch",
			"date_published": 1529062840.085,
			"body": "Is it possible to know if someone is searching for you on the web ?\n\nAfter a few brainstorming sessions I think the answer is Yes.\n\nObviously you can't see what people are typing in Google's search box (except Google) but you can sense when a person clicks a link on Google search results and hits several \"Tripwire\" pages.\n\nThe real question is: Who would pay for such a service ? and how much ?"
		},
		{
			"post_id": 9,
			"title": "Project: Hide Me",
			"date_published": 1528449742.51,
			"body": "A friend of mine asked me if it was possible to \"delete\" yourself from the Internet. I said it wasn't but it's quite possible to create so many similar-but-fake profiles that anyone searching would waste a lot of time and perhaps give up.\n\nWhat do you all think ?"
		},
		{
			"post_id": 8,
			"title": "Project: Cache popular sites on ZN",
			"date_published": 1497425481.633,
			"body": "I have noticed that after a few weeks, some interesting sites tend to disappear for a variety of reasons. It would be cool if they could be downloaded and put on ZN.\n\nMany would need to be converted to static HTML."
		},
		{
			"post_id": 7,
			"title": "Project: Rent-a-Crowd Detection",
			"date_published": 1497419834.136,
			"body": "A while ago I learned that crowds of people could be rented for almost any purpose. Here are a few examples :-\n\n1.  An un-cool CEO wants to look cool so rents crowds to pretend to be adoring customers, share-holders and paparazzi.\n2.  A politician wants to form a grassroots campaign so he/she rents a crowd to join them at rallies and pretend to be normal people (eg Astroturfing)\n\nI was going to form a similar organisation until I realised it would be much more fun to build a system that could detect rent-a-crowds. It would work like this :-\n\n1.  Find all the rent-a-crowd company websites and scan all the member faces and put into a database [Done last year - UK only]\n2.  Get images of various political rallies (from online news) and use facial recognition to match all the faces to the rent-a-crowd database. Bots could do this.\n3.  Present the evidence (for a price) to the opposite party who could use it to great effect in the news media.\n4.  Profit !\n\nZeroNet could be used as a vast distributed database of rent-a-crowd players.\n\nIdeas welcome."
		},
		{
			"post_id": 6,
			"title": "Project: BackWatch - Are you being investigated ?",
			"date_published": 1497418932.918,
			"body": "I'm sure many would find this service useful and would be prepared to pay loads of cash to use it, but I don't have the resources or contacts to get into this too seriously.\n\nAny ideas welcome."
		},
		{
			"post_id": 5,
			"title": "DropBox files are being scanned !",
			"date_published": 1497417764.048,
			"body": "I use Dropbox but because I don't trust them my files are pre-encrypted before they go into the Dropbox folder on my machines.\n\nA few months ago I setup an experiment to see if my files are being scanned. I put a few un-encrypted files in the Dropbox folder and in one file I made references to a few sub-domains that only I know about. These sub-domains have no inbound links so the only way they would get hits is someone scanning my files and accessing those sub-domains.\n\nA few days ago I got a hit from a bot called \"CMSCrawler agent\", does anyone know anything about this bot ?"
		},
		{
			"post_id": 4,
			"title": "Project: Writing Prompt",
			"date_published": 1497273719.663,
			"body": "<A HREF='write-home.html'>Open Source Writing</A> was inspired by WritingPromps on reddit. It allows you to add alternate sections to existing stories so you end up with a different ending."
		},
		{
			"post_id": 3,
			"title": "Game by Anders de la Motte",
			"date_published": 1497271626.118,
			"body": "Similar to <A HREF='elude-home.html'>elude</A> is a book called \"Game\" by Anders de la Motte. Join Henrik “HP” Petterson in the thrilling world of the Game! This special bundle includes all three books in Anders de la Motte’s Game Trilogy: Game, Buzz, and Bubble. In Game, Henrik “HP” Petterson, a slacker with a big ego and no impulse control, finds a cellphone that invites him to play a mysterious, high-stakes game. HP loves the thrill, but it soon becomes clear there is something more sinister at play. In Buzz, HP is newly wealthy due to his success at the Game, but he misses the excitement. When he meets the beautiful and enigmatic Anna Argos, she throws HP’s life into chaos, pitting him against a threat whose existence he cannot prove. In Bubble, HP is living off the grid, hiding from both the police and the makers of the Game. With everything at stake, HP resolves to complete one final mission in order to expose the Game and finally uncover the truth behind it."
		},
		{
			"post_id": 2,
			"title": "Project: Elude - Urban Escape & Evasion",
			"date_published": 1492414322.924,
			"body": "**[elude](elude-home.html)** is a project I came up with in 2010. It lets you be James Bond / Jason Bourne / Jack Bauer for a day or two. We did a very basic mission in 2010 in which two teams ran around London trying to catch the 'Fox'. It's a great idea and I would so love to get it off the ground"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}