{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Подробно о создании и подключении сайтов в Zeronet",
			"body": "Тема для тех кто желает сделать эту среду более интересной и удобной.",
			"added": 1557515179
		},
		{
			"topic_id": 2,
			"title": "Продолжаем эксперименты с Zeronet",
			"body": "Случайно нажал Mute в Zero ID и тем самым скрыл все чаты от своего логина.... Как мне обратно отобразить свои записи в Zeronet???",
			"added": 1557770291
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 1,
				"body": "Ребята..!! А пользователь сохранится в данной сети или прйдется нового регистрировать после каждой переустановки операционки?",
				"added": 1557172142
			},
			{
				"comment_id": 2,
				"body": "Благодарю за помощь !!!) Получается что нужно сохранить эту папку /home/user/ZeroNet-master/data ??? Потом естественно ее заменить после свежей установки Zeronet  в новой операционке ?",
				"added": 1557173180
			},
			{
				"comment_id": 3,
				"body": "> [ozago](#comment_2_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): Благодарю за помощь !!!) Получается что нужно сохранить эту папку /home/user/ZeroNet-master/data ??? Потом естественно ее заменить после свежей установки Zeronet  в новой операционке ? Еще не понятно то, что вроде как по новому законодательству блокировать подозрительный трафик ( DPI ) на уровне провайдера.., и как эта сеть тогда сможет существовать?",
				"added": 1557173334
			}
		],
		"1_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8": [
			{
				"comment_id": 4,
				"body": "Всем привет ! Еще не нашел толковой инструкции по добавлению уже работающего сайта из рунета. Хотелось бы более тщательно узнать об ограничениях и требованиях для созданных в Zeronet сайтов. Как обстоят дела с динамическими сайтами такими например как доски объявлений с внутренним чатом. Буду благодарен за полезную информацию...",
				"added": 1557515433
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_9_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Разработчики приветствуют и поощряют использование паттерна SPA, на котором здесь все завязано. Даже страницы полностью статических сайтов движок ZeroNet, динамически подгружает в iframe. \nБлагодарю за оперативный ответ, обязательно проверим на практике. И позвольте уточнить, где-нибудь есть пошаговое руководство или поисание как это реализовать?",
				"added": 1557519423
			},
			{
				"comment_id": 7,
				"body": "Получается , прежде чем залить сайт в Zeronet , нужно отключить регистрацию с белой почты? А восстановление пароля как происходить будет?",
				"added": 1558031326
			}
		],
		"2_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 6,
				"body": "А как файлы со своего ПК раздавать можно в зеронете??? И где их искать если что-то нужно??",
				"added": 1557603667
			}
		]
	},
	"comment_vote": {
		"2_1MrkBpKHLsJ55qA5sLCvj55vrMiSFQB1x5": 1,
		"2_15NFTBovjzsyqn5UVKWcfr4nSC7KpoG55P": 1
	}
}