{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1610200253_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "Commentary\n\nDid you ever wonder what it’s like to live in a one-party state?\n\nWell, wonder no more. You’re living in one. The major means of communication—in today’s terms that means social media—have now been taken over completely by the left.\n\nNot only has Donald Trump—still the president of the United States—been permanently banned from Twitter, its rapidly growing, open-to-all substitute Parler has almost simultaneously been de-platformed by Google.\n\nYou can’t get their app for Android anymore.\n\nApple threatens to be next, demanding Parler kowtow (by Saturday!) to Cupertino’s vision of what the world should be.\n\nI suppose that’s a social-justicey-politically-correct totalitarianism led by left-leaning… or so they want us to believe… tech billionaires.\n\nSound Chinese?\n\nMore than a bit.\n\nThink this was planned?\n\nJust the other day I wrote of the “false flag” (left-wing provocateurs) behind the mayhem in the Capitol. Many in high places pooh-poohed what I and others were saying. I wasn’t too sure of it myself.\n\nBut let’s review what’s happened since:\n\nJosh Hawley’s forthcoming book… on Big Tech, no less… is “canceled” by Simon & Schuster. Senator Hawley had been among the most outspoken about investigating the possibility of election fraud.\n\nTwitter permanently blocks General Flynn. I guess they don’t think he has had enough already.\n\nTwitter permanently blocks Lin Wood, the well-known attorney working to unmask possible fraud. Ditto for the courageous Sidney Powell.\n\nNot to be outdone, Facebook blocks President Trump’s account. (Not sure who was first—Facebook or Twitter—not that it matters.)\n\nMore insidiously, Facebook starts to delete groups or forums of people who publicly stepped away from the Democratic Party because of its scandals.\n\n(Elsewhere it’s revealed that Facebook banned accounts at the behest of Hunter Biden.)\n\nYouTube announces it will no longer distribute videos investigating election fraud and that producers of such videos will be punished if they do.\n\nAll this in a couple of days, the excuse being, in almost all cases, that the conservatives involved were instigating violence, the “outrage” that occurred at the Capitol.\n\nThis from the people who ignored exponentially more violence and destruction for months all across urban America.\n\nSense a strategy here? A plan?\n\nI know—I’m one of those conspiracy mongers. Everything has been “debunked.” Indeed, it was “debunked” before it happened.\n\nOnly I’m not a conspiracy monger, my friends. I’m one of those guys who is perfectly willing to admit it was Lee Harvey Oswald working alone from the Texas Schoolbook Depository.\n\nI’m the opposite. I’m a Occam’s Razor guy—what you see is what you get.\n\nAnd Occam’s Razor tells me the United States is turning into a near clone of the People’s Republic of China.\n\nThat’s not communism in the traditional sense. Karl Marx wouldn’t recognize it, not that what he had on offer was any better. For China, the word communism is a kind of paleo-virtue signaling.\n\nWhat China actually is (and where the United States is headed or has already arrived) is a form of oligarchic fascism. The capitalist market’s fine as long as it’s my capitalist market and you’re a member of my party.\n\nCommunist Party, Democratic Party, what difference does it make? As long as it’s ONE PARTY. And we’re in charge. The state über alles.\n\nSo forget about personal liberty and free expression and brush up your “social credit score.” Learn to be obedient, if you wish to survive.\n\nAnd above all don’t say anything critical or even slightly controversial on social media or you’re a dead person—or might as well be because you’ll be canceled.\n\nSo be careful, but don’t worry about erasing or deleting this article because it probably won’t be here tomorrow.\n\nJust kidding.\n\nI think.\n\nWell…. Either that or stand up and fight the [new] power. As somebody once said, “What do you have to lose?”\n\nRoger L. Simon is an award-winning novelist, Oscar-nominated screenwriter, co-founder of PJMedia, and now, editor-at-large for The Epoch Times. His most recent books are “The GOAT” (fiction) and “I Know Best: How Moral Narcissism Is Destroying Our Republic, If It Hasn’t Already” (nonfiction). Find him on Parler @rogerlsimon.\n\nViews expressed in this article are the opinions of the author and do not necessarily reflect the views of The Epoch Times.\nTOP NEWS>\n\n> [wotansboy](#comment_2_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW): not readable without an account",
				"added": 1610267243
			}
		],
		"1610272179_1BAG93hXwWmaDRyjYCGP8QLpwZ6YXVSvo4": [
			{
				"comment_id": 2,
				"body": "> [userneonshine](#comment_9_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E): If you are looking to be anonymous, check the tor browser\n\nNewbie question here, ass a follow up to this, is using tor plus zeronet more anonymous than using tor or zeronet by itself?",
				"added": 1610279239
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac]: Yes. Use Tor Browser and have ZeroNet in TOR always mode.\n\nThanks for the info!",
				"added": 1610299986
			}
		]
	},
	"comment_vote": {
		"2_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW": 1,
		"3_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": 1,
		"2856_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_13SsB3jkasV13WSwJ6qRjBVPBD2iPA52th": 1,
		"3_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"2877_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"569_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	}
}