{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Hackmeeting",
			"body": "https://hackmeeting.org",
			"added": 1562208419
		},
		{
			"topic_id": 2,
			"title": "Ingeniería informática libre",
			"body": "Hola. \n\n¿Conocéis algun lugar donde pueda encontrar la documentación en que se basan las carreras universitarias sobre ingeniería informática? \n\nMe estoy planteando generar un zite que contenga documentación sobre ese tema para que fuera posible hacer la carrera de ingeniería informática de forma autodidacta y cuyo contenido sea alojado en zeronet.",
			"added": 1563342163
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 1,
				"body": "> [aton2019](#comment_1_1PiTupjmKB9mD4xUg2RTZjchDMtJbjWLAU): Yo primera vez que entro a un Sitio así , espero aparezcan mas Webs con mas información para leer .Saludos a todos .\n \n¿Te refieres a leer en español?",
				"added": 1565961605
			}
		],
		"2_1H79P7Dn1eqyVFFhsPux4ZyApMuhzhwXCS": [
			{
				"comment_id": 2,
				"body": "Creo que funciona al revés. Diseñas algo, lo publicas y cuando mucha gente lo usa, te empiezan a llegar donaciones. \n\nDespues de eso es más fácil que puedas publicar una idea de proyecto y recibir financiación para desarrollarlo. Habiendo creado primero un entorno de confianza.\n\n¿Qué sabes hacer? ¿Podrías hacer una web de uso privado en zeronet? Con sus usuarios y contraseñas.",
				"added": 1565961814
			},
			{
				"comment_id": 5,
				"body": "Haz algo. Publica el código y tu wallet. Y ya veremos.",
				"added": 1566532560
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 3,
				"body": "Hola.",
				"added": 1565961858
			}
		],
		"2_1KDAb5oBYoGN3T1rzzpFztaxpwCBKDFeag": [
			{
				"comment_id": 4,
				"body": "> [garlicid](#comment_1_1G2dwDhKheLm2pu1LVK8eauVzjX6g1Adp2): Solo encontré esto en la clearnet. Creo que tiene lo que describes. https://www.acm.org/education/curricula-recommendations (En Inglés).\n\nInteresante enlace. ¡Gracias!\n\n¿Y ahora?\n\n¿Hay algun portal en zeronet donde se contenga toda esa información? Y si no existe. ¿Lo creamos?",
				"added": 1565962336
			}
		]
	},
	"comment_vote": {
		"1_1G2dwDhKheLm2pu1LVK8eauVzjX6g1Adp2": 1
	}
}