{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "test test test",
			"body": "test only\n\n-zeronet from wiki-\n\nZeroNet is a decentralized Internet-like network of peer-to-peer users. It is based in Budapest, Hungary; is built in Python; and fully open source.[1] Sites have specific \"ZeroNet URL\"s which can be accessed through an ordinary webbrowser when using the ZeroNet application, which acts as a local webhost for such pages.[1] ZeroNet is not anonymous by default, but users can hide their IP address by using the built in Tor-functionality.[1] ZeroNet uses bitcoin cryptography and the BitTorrent network.[2][3][4] The BitTorrent website Play hosts a magnet link repository on ZeroNet, which links to copyrighted content.[1] There is a Reddit community which offers support for ZeroNet.[1]\n\nThe existence of peer-to-peer online web-sites had been hypothesised for some time, with The Pirate Bay suggesting they would build a network, as well as BitTorrent Inc. which created the closed source Project Maelstrom.[1][5] One other similar project is the SAFE Network by MaidSafe, though it has not yet seen widespread use, and has been said to focus more on file storage.[5]\n\nAs of 2016 there is no way to take down a ZeroNet page which still has seeders,[1] thus making such pages immune to DMCA takedown notices.[6] By default, sites operate with a max-filesize of 10 megabytes, but this is a soft limit, and some websites go as big as gigabytes.",
			"added": 1525123966,
			"parent_topic_uri": "1_1JtWpPB5q8EjDbUmyZXKYS6vkKrix9h8s7"
		},
		{
			"topic_id": 2,
			"title": "test",
			"body": "test",
			"added": 1525129188,
			"parent_topic_uri": "1_1JtWpPB5q8EjDbUmyZXKYS6vkKrix9h8s7"
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ": [
			{
				"comment_id": 1,
				"body": "测试 测试 测试",
				"added": 1525123493
			}
		],
		"232_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 2,
				"body": "大概是因为不好用？",
				"added": 1525123793
			}
		],
		"1_181GPyZH6echfoCcSXBtqJFh6vwLsYXUDc": [
			{
				"comment_id": 3,
				"body": "spam",
				"added": 1525123811
			}
		]
	},
	"comment_vote": {
		"1_18vqVgrAU53vkyYcQTLDtPua5cxYK4gFhj": 1
	}
}