{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1565231801,
			"title": "Money with ZeroNet?",
			"body": "Hello, I would like to know how I can get money through ZeroNet being from Venezuela? I am currently going through a very difficult economic situation in my country. For that reason I am looking for options on the net, in a forum I observed information about ZeroNet and that you could earn income with this. but I don't know how the publication was old. I have time looking for alternatives online, I have already tried faucets, airdrops, captcha pages, video games and many other things, but I have not had much luck with this. I would sincerely like to know if there is any way in the network to get money from home. or if Zeronet can be useful for me. to get money online ?. thanks please if you can help me with information would be of great help. Thank you.",
			"added": 1565231800
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1565231801_1Gp6bE82nhuD8RJZaJqTJSgUozLHq92F1e": [
			{
				"comment_id": 1,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_621_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you can if someone is willing to send you a check by the post.\n\nmmmm",
				"added": 1565232783
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_623_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): zeronet is nor really socialism, but good try.\n\nFrom the little I understood, it is supposed to be a free network in which information can be obtained even beyond normal networks. At no time have I talked about socialism? Do you think I made any comment that has to do with that garbage called socialism ?. Socialism and communism completely destroyed my country. and I don't think the comment I made has a political attitude. if it offends you in something said comment. I'm sorry for you. but the fact that I want to try to get ahead looking for opportunities in any place does not imply cause of offense for anyone.",
				"added": 1565233443
			},
			{
				"comment_id": 3,
				"body": "> [duende](#comment_105_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself, maggot.\n\nu can help me with this?",
				"added": 1565235281
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_624_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): for sure now with duende and me, you are gonna 'hate zeronet'but we 'aren't bad guys' reallyor sometimes we are. [...]\n\nsure. thanks",
				"added": 1565235316
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_878_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Not really a thing. There's no ad networks (and most users here are savvy enough to block them), and no payment providers. All addresses (user auth addresses and site urls) are valid bitcoin addresses, and there's a \"donate\" button in the sidebar. I've personally received money in this form, but I'm not a huge fan of bitcoin or blockchains. [...]\n\nthanks for u great answer. very thanks. u can help me much with this. take a good night. (or morning or afternoom sorry here its night hehe).",
				"added": 1565236500
			},
			{
				"comment_id": 6,
				"body": "> [zerowatchdog](#comment_6_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM): If you are looking for some exotic IT business maybe DASH could be at crypto you can explore just because they have Venezuela highlighted very often in there news feed.\nhttps://twitter.com/dash_venezuela\nhttps://www.dash.org/news\n\nI wont' start a crypto talk here it just came into my mind reading \"Venezuela\"\n\nGood luck dude ! I hope things will improve in Venezuela soon\n\nThanks bro for u help, i goes to read about. thanks",
				"added": 1565268920
			}
		]
	},
	"comment_vote": {
		"878_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1
	}
}