{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "Офигеть, сайт из 1 кнопки на 36 мегабайт )))\nА что из этого нужно в продакшене?",
			"post_id": 7,
			"date_added": 1455621594
		},
		{
			"comment_id": 2,
			"body": "Мне как человеку увидевшему такой js в первый раз, не хватает мануала по сборке проекта сразу в продакшен папку, что бы руками все не копировать (ну или даже написать необходимое скриптом, все равно криво)",
			"post_id": 7,
			"date_added": 1455622295
		},
		{
			"comment_id": 3,
			"body": "ну в случае со сборкой обычно это делается в соседнем каталоге и получается разделение бинарников и исходников",
			"post_id": 7,
			"date_added": 1455623072
		},
		{
			"comment_id": 4,
			"body": "> [gomzik](#comment_29_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Вебпак полностью настраивается. Там можно указать, откуда брать и куда ложить. Прочитай первую часть еще раз, попробуй сделать как тебе удобнее, расскажи мне, может мне так больше понравится\n\nто есть можно собирать в \"соседний\" каталог",
			"post_id": 7,
			"date_added": 1455624730
		},
		{
			"comment_id": 5,
			"body": "типа того, а еще вариант с гит, папка то исключена и в продакшене просто не делать npm install, а js css уже собранны",
			"post_id": 7,
			"date_added": 1455625164
		},
		{
			"comment_id": 6,
			"body": "> [gomzik](#comment_33_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Только учти, что index.html никак никем не обрабатывается, т.е. он должен быть сразу на нужном месте или какой-то отдельный скрипт, который его туда скопирует. Еще можно посмотреть в сторону таких сборщиков как gulp, но это уже как по мне как-то перебор, иметь две билд системы в одном проекте. Вероятно для этого также придумали какой-то специальный лоадер для вебпака или еще чего...\n\nэто я понимаю",
			"post_id": 7,
			"date_added": 1455625213
		},
		{
			"comment_id": 7,
			"body": "> [gomzik](#comment_34_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Ну опять же, это этап сборки, а не работы в продакшене. Типа сначала происходит процесс сборки, где и будет npm install; webpack -p пакуется это все в какой-то пакет (да хоть зип) и этот пакет уже выливается в продакшен и раскладывается в те места, где их ждет тот же nginx\n\nну вот как раз я и имею в виду упрощение выкладки. т.е. грубо webpack -wd отладка. а git pre-commit script webpack -p, тогда преобразует и положит в коммит продакшен версию",
			"post_id": 7,
			"date_added": 1455625608
		},
		{
			"comment_id": 8,
			"body": "> [gomzik](#comment_37_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Из опыта говорю. Когда работает много людей над проектом, тебе просто надоедает резолвить эти файлы как конфликты. Да, там всего то достаточно сгенерить по новой и добавить их в коммит, но даже это надоедает после n-го раза\n\nда, ты прав. это скорее в after pull скрипт класть, генерацию верных ассетов.\nдо этого я только с самописными движками на пхп работал, там все ассерты были в виде отдельных файлов, максимум минификатор стоял, который сам при запросе определял есть ли собранная копия и если нужно собирал ее.",
			"post_id": 7,
			"date_added": 1455627856
		},
		{
			"comment_id": 9,
			"body": "welcome back )",
			"post_id": 20,
			"date_added": 1576154841
		}
	],
	"comment_vote": {},
	"post_vote": {
		"7": 1,
		"9": 1,
		"20": 1
	}
}