{
	"message": [
		{
			"body": "Would be nice to have channels like in irc. Or should I just clone the site, and rename and it should work?",
			"date_added": 1483918189109
		},
		{
			"body": "Hi. I am setting up the public proxy - http://proxy1.zeronet.functor.xyz:43110/ - feel free to test. https to be enabled soon.",
			"date_added": 1484020914777
		},
		{
			"body": "rythyrix, even with https, what guarantee would you have that I myself do not intercept the traffic ? :) I understand the need, just need to generate some certs. Once done (and test) I will post it in some other places.",
			"date_added": 1484021836263
		},
		{
			"body": "rythyrix, I do not know. maybe owners set it up, but something broke, like they were using old version of zeronet, or didn't configure properly to start up automatically after reboot. who knows",
			"date_added": 1484022584118
		},
		{
			"body": "rythyrix, even if the proxy is not used, it seeds some zites, so that is a plus too",
			"date_added": 1484022623284
		},
		{
			"body": "rythyrix: Proxy is mostly to lower barrier of entry, make people interested, and allow checking zites from smartphone or non-owned computers quick and easy. I fully agree, running full node is much better. I will try to add some info somewhere that it is recommended way of operation, and best way to help the zeronet grow",
			"date_added": 1484023325810
		},
		{
			"body": "rythyrix, sure forcing https / hsts will be done. Just a bit lazy today to do more. Identities are separated afaik. It uses cookies, and different users can log using different accounts.",
			"date_added": 1484024170309
		},
		{
			"body": "I updated my zeronet public proxy to use https / hsts. https://proxy1.zeronet.functor.xyz/ Enjoy.",
			"date_added": 1484078566684
		},
		{
			"body": "rythyrix: Just httpsified my proxy: https://proxy1.zeronet.functor.xyz/  HTTPS (with good selection of ciphers and options) + HTTP redirects + HSTS + secure/httpony cookie tweaks. Already added to zero wiki list - http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies  , I will publish via more channels tomorrow (starting with r/zeronet probably).",
			"date_added": 1484097825174
		},
		{
			"body": "There is a plugin that is disabled by default in zeronet, but is easy to enable.",
			"date_added": 1484098277594
		},
		{
			"body": "plugins/disabled-MultiUser",
			"date_added": 1484098321046
		},
		{
			"body": "I have a modified Dockerfile with all the settings to automate it, and isolate from the rest of the system. I will publish it on docker hub soon.",
			"date_added": 1484098348756
		},
		{
			"body": "Yes, I was messing with CA and SSL settings a bit for the last hour. I was publishing partial chain, which is ok, but not optimal. I am now sending both server and intermidiate certs.",
			"date_added": 1484098393148
		},
		{
			"body": "The mess with all the ports and redirects, is because there is different webserver on the same machine, and also need for reverse proxy, which my main server doesn't support well. so I run yaws, nginx and zeronet. But it all ends well, after configuring proper redirects.",
			"date_added": 1484098476563
		},
		{
			"body": "I just need to disable logs in nginx",
			"date_added": 1484098495854
		},
		{
			"body": "rythyrix: TCP + HTTP over localhost.",
			"date_added": 1484098815961
		},
		{
			"body": "access logs disabled in nginx. There were few interesting accesses from aws, tor, comcast (WA state). ANd interesingly from facebook, but this is probably because I published URL to proxy on facebook to some of my friends, and they try to fetch website title and create a thumbnail or fetch image for it ;)",
			"date_added": 1484098968535
		},
		{
			"body": "rythyrix, I was not expecting it, but it makes sense to me now. it is ok.",
			"date_added": 1484099971725
		},
		{
			"body": "I am just looking at my other webserver logs, and beyond lot of attempts to do some silly exploits, some bots and scan, there is a lot of checks for just \"/\" from a lot of devices in Brazil. I think some home routers.",
			"date_added": 1484100023020
		},
		{
			"body": "I have few entire /24 blocks from .cliente.imicro.com.br in my logs. Some do have port 53 open. So I am assuming some routers from ISP in homes.",
			"date_added": 1484100927381
		},
		{
			"body": "semi open. nmap says open,. but it doesn't respond to dns queries",
			"date_added": 1484100940410
		},
		{
			"body": "user agent is curl on mips-something-something, so another indication these are routers.",
			"date_added": 1484100963860
		},
		{
			"body": "MikroTik RB750G router probably",
			"date_added": 1484101034187
		},
		{
			"body": "No, it is not related to zeronet. I have it in logs for few weeks",
			"date_added": 1484101153396
		},
		{
			"body": "every host in 186.225.191.0/24 and in 177.67.93.0/24  if you want to play with",
			"date_added": 1484101203458
		},
		{
			"body": "At least some of them are on some blacklists, i.e. http://mxtoolbox.com/SuperTool.aspx?action=blacklist%3a177.131.57.155&run=toolpage#",
			"date_added": 1484101516922
		},
		{
			"body": "Ugh. https://onlyzero.net/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/ shows 4000-8000 peers for most of the sites. Interesting, I have < 1000 on my zeronet on my machine and on my proxy",
			"date_added": 1484102334806
		},
		{
			"body": "Does ZeroTube works for anybody? \"We are looking for peers...\" since yesterday. I wonder how it works.",
			"date_added": 1484104529476
		},
		{
			"body": "Thanks. Probably something is broken in the code, or just well, not enough peers indeed and poor handling of that.",
			"date_added": 1484104838867
		},
		{
			"body": "ipfs, indeed interesting. I am just using docker image, no need to compile or install it. easy, at least on LInux",
			"date_added": 1484106935314
		},
		{
			"body": "Doesn't any knows if there is wikipedia mirror on zeronet maybe?",
			"date_added": 1485544628985
		},
		{
			"body": "Ok. There will be soon then ;)",
			"date_added": 1485557269820
		},
		{
			"body": "INFO: Finished 11-process extraction of 1195216 articles in 10371.9s (115.2 art/s)",
			"date_added": 1485562471411
		},
		{
			"body": "I am processing xml dumps. Just few gigs. The tool I am using does have reasonable speed, but it lacks many wiki features and there are some bugs in handling of things like images and tables and some other esoteric wiki features. Maybe I should just use original wikimedia code to render stuff instead. Maybe.",
			"date_added": 1485568706328
		},
		{
			"body": "I am going to put all article on one site, but I will probably bundle them a bit by some hash. So, if you visit even single article, it you will actually download ~20 of them, so a) there is less files, b) it is hard to tell what have you are reading, c) it helps distribute files more, d) sure it is wasteful on bandwidth to some extent.",
			"date_added": 1485568799125
		},
		{
			"body": "I am fighting some escaping / unescaping in titles and links and files, to make it fully work.",
			"date_added": 1485568976648
		}
	]
}