{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1590263087,
			"title": "(Concept) BlueMaxima's Flashpoint webgame preservation project port/mirror on Zeronet",
			"body": "Just checking if it would be possible and what do you think about such project.",
			"added": 1590263086
		},
		{
			"topic_id": 1596264833,
			"title": "How Big?",
			"body": "I was wondering, do we have any estimation about how big the whole zeronet is? How fast does it grow?\nDo we have any statistics about it?",
			"added": 1596264831
		}
	],
	"topic_vote": {
		"1599012296_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": 1,
		"1602786830_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1602785059_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1603107058_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": 1,
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1603284377_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": 1,
		"1603487223_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1,
		"1606848814_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1607308202_14ttzKsh79te1T458HZGExH6Ghr13njvMr": 1,
		"1608022067_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1616688942_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1616953116_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1620574964_1C6gAPEiSgWRPes1bmpFhWcKGyyT2WMTiX": 1,
		"1623644877_1NSyEdCNMmed6Er224HDTUY6iyhdVEeRG2": 1,
		"1622734883_1JMFHri3FtAMY2CFhiL9yH62igSh4Nzq3s": 1,
		"1624713894_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1626704177_1JMn7zrA5b35HR8wTSeyQrbCSxj2LDuxgt": 1,
		"1625766106_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": 1,
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1628411219_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1634963804_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1636759226_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 119,
	"comment": {
		"1584808018_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "It can be but I would strongly advise you not to coz your activity could be crosreferenced easier, just start separate tor instance for that. Or run your own exit node and blend in with the crowd.",
				"added": 1584814443
			}
		],
		"1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 2,
				"body": "ZeroMail could be adopted to support \"Play-by-mail games\" \n\nexternal link to games list that support this game mode:\nhttps://www.mobygames.com/attribute/sheet/attributeId,1407/offset,0/so,0a/\n\nThere are some cool ones like:\nCapitalism Plus\nEmpire II: The Art of War\nSid Meier's Civilization series\nAge of Wonders Series",
				"added": 1592581870
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 3,
				"body": "You want to silence a democratically chosen president?\nThat's not justice that's crime against democracy.",
				"added": 1592633876
			}
		],
		"1593289936_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 4,
				"body": "nie rozumiem tego ostatniego zdania",
				"added": 1593338839
			}
		],
		"1594361535_17WS8Y1keB3p8ELXFPbX1ZRLfeCESyojtF": [
			{
				"comment_id": 5,
				"body": "http://127.0.0.1:43110/1JBFNPrAGp1nQX6RsAN6oRqCfvtoeWoion/\ndreamseach is kinda nice",
				"added": 1594368564
			},
			{
				"comment_id": 8,
				"body": "> [anshorei](#comment_144_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Yacy.\n\nI don't think yacy can crawl zeronet yet. It can crawl freenet just fine tho.",
				"added": 1595394915
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "cool USA antichinese propaganda you've got there m8",
				"added": 1594449445
			}
		],
		"1594475002_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 7,
				"body": "If it's not bundled with adware, spyware, free toolbar and a McAfee soon it will be.\nJust like every other \"freeware\" p2p program before like Kaaza, Bearshare, Limewire and Napster.\n\nWhat makes you think this time it will be different?",
				"added": 1594475968
			}
		],
		"1596079219_1LVZEMhitcYT5Q7bw5Hy9qWURWK5UaSfd6": [
			{
				"comment_id": 9,
				"body": "could you also mirror it onto zeronet?",
				"added": 1596087082
			}
		],
		"1596096685_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 10,
				"body": "For search engine try YaCy it has a shared p2p database created by independent crawlers you can also participate in crawling yourself.\n\nAs for video sharing maybe peertube. I'm not quite sold on it just yet but you can even set up your own instance and follow other instances as you please. I've heard some interesting ideas about zeronet - peertube bridges but there hasn't been anything that came out of this idea yet. \n\nJeśli chodzi o szukajki to spróbuj Yacy, ma współdzieloną bazę po sieci p2p tworzoną przez niezależne roboty indeksujące. W przeszukiwaniu i indeksowaniu sieci możesz też sam brać udział.\n\nCo do dzielenia się filmikami spróbuj peertube. Nie jestem co prawda do końca jeszcze przekonany ale możesz nawet postawić własną instancję i podłączać instancję innych. Słyszałem też o pomysłach by robić mosty zeronet – peertube ale nie wiem czy to nie skończyło się tylko na pomyśle.",
				"added": 1596125567
			}
		],
		"1596264833_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": [
			{
				"comment_id": 11,
				"body": "> [driud](#comment_74_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): In the tab, you have given numbers to which you can get connected.. Connected. - 7,. Onion, -773,. In total, - 6670,. Possible up to, - 6664,. Local, - 10.This is today's result..W zakładce, masz podane liczby do których możesz uzyskać połaczenie.. Połączony. - 7,. Onion, -773,. Sumarycznie, - 6670,. Możliwy  do, - 6664,.  Localne, - 10.To wynik dzisiejszy.\n\nbut these are your personal statistics not the network as a whole\n\nale to są twoje statystki a nie statystyki całej sieci\n\n> [otbtechnologies7](#comment_2_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w):  My business sells products and promotes services that ensure freedom of speech\n\nI find selling freedom as a product disgusting.",
				"added": 1596294884
			},
			{
				"comment_id": 12,
				"body": "> [otbtechnologies7](#comment_10_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): I think maybe you are misunderstanding how American society works maybe... Just my 2 cents\n\n> [otbtechnologies7](#comment_12_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): So, you are telling me that you are against me utilizing my 10+ years of experience fighting Big Tech and Big Government corruption to make JUST enough money to feed myself?... Odd..\n\nI think you've just answered yourself how american society \"works\".\nThat a man with 10+ years of skill and experience can barely feed himself.\n\nPutting that aside my initial idea of this thread was to estimate the initial cost of \"super node\" to funnel zeronet into internet independent mesh networks like network 44, yggdrasil or cjdns. After the initial funeling we could dismantle super node into smaller nodes furthers spliting the cost among users inside mesh network.",
				"added": 1596303729
			},
			{
				"comment_id": 13,
				"body": "> [driud](#comment_81_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): At the moment the statistics are;ZeroName; 12,422 - computers on.globally; 11 597. - this is how many calls can be made.This data depends on the day and time / time of day /.These are the facts, at a different time, there are different data..W tej chwili statystyki wynoszą;ZeroName; 12 422. - włączonych komputerów.Sumarycznie;  11 597. - tyle mozna wykonać połączeń.Te dane zależą od dnia i godziny, / pora dnia /.Takie są fakty, o innej godzinie, są inne dane.\n\nBut that doesn't say anything about size in PB. And that's what i'm trying to estimate.\nAle to nie mówi nic o rozmiarze w PB a właśnie to chce określić.",
				"added": 1596365825
			},
			{
				"comment_id": 14,
				"body": "> [driud](#comment_82_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): This is the average load, Zeroneta, There are those who do not turn off the computer. There are those that turn it off. And a different time zone causes variation, so you should consider this an average, not a constant number of users..Jest to średnia obciążenia, Zeroneta, Są tacy co nie wyłączają kompa. Są tacy co go wyłączają. A inna strefa czasowa powoduje zróżnicowanie.Trzeba to traktować jako średnią, a nie stałą ilości użytkowników.\n\nChodzi mi o rozmiar przestrzeni dyskowej w PB - petabajtach wygenerowanych przez tych wszystkich urzytkowników a nie ilu tych użytkowników jest. Chyba że przyjęlibyśmy jakąś liczbę danych które generuje przeciętny użytkownik i w ten sposób to przeliczyć.\n\nI'm talking about disk space in PB - petabytes genereted by all those users not about number of users. Unless we could estimate amount of data generated by average user and calculate it that way.",
				"added": 1596376323
			},
			{
				"comment_id": 15,
				"body": "> [otbtechnologies7](#comment_13_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): Do you by chance live in a Socialist or Communist country?\n\nBut don't you think P2P networks are inherently socialistic? There is no one person or company that can claim possession over the data inside, we're all owning it and redistributing it as a collective.",
				"added": 1596484356
			}
		],
		"1596566014_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 16,
				"body": "https://nyaa.si",
				"added": 1596602011
			},
			{
				"comment_id": 17,
				"body": "> [merithtk](#comment_85_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): the only My Hero Academia they have is sub... i want dub\n\ntry the ones with \"dual audio\" in the name",
				"added": 1596643002
			}
		],
		"1597273154_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 18,
				"body": "There are some gaming stuff that can be done over zeronet:\n-leader boards exchange like twingalaxies.com\n-mods and maps repository for popular games (many of this kind of sites are dying out) \n-tradicional and pen and paper play-by-mail-games (like chess and even rpgs with a Game Master)\n-digital play-by-email games like Age of Wonders, Sid's Meier's Civilisation, Capitalism Plus\n\nSą rzeczy dla graczy które dałoby się zrobić po zeronecie:\n-wymiana tabeli liderów na podobe twingalaxies.com\n-repozytoria z mapami i modami do popularnych gier (wiele z tych stron wymiera)\n-tradycyjne gry turowe z rozwiązaniami do rozgrywki po poczcie (szachy albo i nawet gry rpg wymagające mistrza gry)\n-cyfrowe gry turowe z rozwiązaniem do rozgrywki po poczcie elektronicznej takie jak Age of Wonders, Sid's Meier's Civilisation czy Capitalism Plus",
				"added": 1597296400
			},
			{
				"comment_id": 19,
				"body": "> [blkdissident](#comment_5_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): I'd be down to play some Civ passing a save file around\n\nWhich civ do you have?\nI've got 3rd one with expansions.\nBut as a warning i've got to tell you that i've never played civ before so it would be more like a proof of concept that it can be done.\n\nKtórego civa masz?\nJa mam civa trójkę z dodatkami.\nJednakże muszę cię ostrzec że nigdy w civa nie grałem wiec niech to nam posłuży jako udowodnienie koncepcji że to da się zrobić.",
				"added": 1597434267
			}
		],
		"1597659956_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 20,
				"body": "source: My ass",
				"added": 1597675310
			}
		],
		"1597726785_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": [
			{
				"comment_id": 21,
				"body": "I wouldn't trust an imageboard with a google captcha on it.",
				"added": 1597728148
			}
		],
		"1597403512_19phQegWSEy9ohnqRCLtSfKqXuwjofe62t": [
			{
				"comment_id": 22,
				"body": "was it successful?",
				"added": 1597781454
			}
		],
		"1597799191_1PpyPJUoaCRJd52mcxRszSMHJKUpcRVUMG": [
			{
				"comment_id": 23,
				"body": "Just a crazy idea of mine but.\nHave you tried donating?",
				"added": 1597811116
			},
			{
				"comment_id": 24,
				"body": "> [marcusfinch](#comment_29_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ): The thing is, though, it works most of the time.  As long as the money is thrown in the right place.\n\nIt works as long as there is no middle-man involved between payer and creator. Only then the creator can be in charge of his/her labor.",
				"added": 1598102316
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 25,
				"body": "If at all it should be done as an external plugin/addon in which the end user can tag inappropriate content/user to his/her individual liking and moral values.\n\nThen people could just accept which content they are comfortable with seeding. But also they could see what was \"blocked\" and are capable of turning it off or passing thru \"false positives\". So in the end it would work like filter like \"Adblock\" rather than an imposed censorship tool.",
				"added": 1598104244
			},
			{
				"comment_id": 28,
				"body": "> [geekless](#comment_243_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Do you mean blocklists?\n\nkinda, but automated with voting and tags",
				"added": 1598114103
			},
			{
				"comment_id": 31,
				"body": "> [otbtechh22f4wcuo](#comment_3_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb): The only concern I have is that it would allow people to live in their own little fishbowl of a world and limit ZeroNet's use as a free speech platform, but if that is what the devs want then so be it as it is their platform not mine.\n\nPeople would gravitate onto same minded groups anyhow. Speaking just English also limits you in such a way.",
				"added": 1598119994
			}
		],
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 26,
				"body": "> [otbtechnologies](#comment_66_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd): Join our digital army by visiting: https://OTB-Technologies.com\n\nZeronet is not your personal army.",
				"added": 1598106051
			},
			{
				"comment_id": 27,
				"body": "I have strange suspicion that otbtech and wwg1wga are the same guy.\nThey both follow similar mannerism and respond in similar timeframes.",
				"added": 1598113038
			},
			{
				"comment_id": 29,
				"body": "> [wwg1wga](#comment_50_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): What are you a conspiracy theorist? Lol :) [...]\n\nNo, as I said I'm being suspicious.\nFor me being suspicious is a part of being careful. There's nothing wrong with being careful now is it?\n\nYou're also awfully short-tempered just like him.",
				"added": 1598117471
			}
		],
		"1598113485_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [],
		"1594775906_1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL": [
			{
				"comment_id": 32,
				"body": "It would be a really nice foundation for recommerce craigslist-like zite. I can smell a huge potential in it.",
				"added": 1598121500
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 33,
				"body": "Cool samefaging m8.",
				"added": 1598456193
			},
			{
				"comment_id": 35,
				"body": "I'd say you're not very intelligent to majority of us on zeronet.\n\nYou're calling everyone who is disagreeing with you a communist or socialist (which is funny in p2p network and in open source projects in general btw.)\n\nAll the stuff you've supposedly exposed is someone else work and it's just a bunch of long quotations and links.\nYou're samefaging and when it was pointed out by several users you've started to samefag even more to hide that you're samefaging. It's not gonna work. But you're also act like a hot shit because you have a business but let me tell you, burning linux dvds and selling them on ebay is not a business (YES, according to our friend otbtechnologies it takes \"10+ years of experience fighting Big Tech and Big Government corruption\" to burn an iso to a disc ). You DO realize that it would take ONE purchase from you to deanonymize you right? \n\nhttps://www.ebay.com/usr/otb_technologies",
				"added": 1598544565
			},
			{
				"comment_id": 36,
				"body": "And all sentences in all 5 previous posts ended in \"...\" or emoticon. But it's not the same person. It's purely coincidental.",
				"added": 1598568592
			}
		],
		"1598474233_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 34,
				"body": "> [edgelordofdecent](#comment_639_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Lol. Why do I need a specialized linux distro to do that instead of a normal one? \"Advertising fees\" lol\n\nWhile I like the idea of dedicated linux distro (something nas/serverlike like OMV but with build in ipfs, freenet and zeronet). The \"advertising\" problem also bothers me to no end. We're in this censorship hell partially because people are trying to be more \"advertising friendly\".",
				"added": 1598505579
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 37,
				"body": "I'm flattered by your dedication, but why would a new user that started to post just yesterday would even care about some random drama on internet forum that happens all the time? Please explain.",
				"added": 1598587115
			},
			{
				"comment_id": 38,
				"body": "> [krombopulusmike](#comment_4_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): Lol, looks like kapec decided to rope you into the conspiracy theory nekololi!! Guess you lucked out!\n\nThat was a question to you, nekololi is here with us for much longer.",
				"added": 1598588363
			}
		],
		"1598551981_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 39,
				"body": "> [driud](#comment_105_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): It is based on Ubuntu; Ubuntu is, it was sold a long time ago. This is no longer linux.They let you in raspberries..To bazuje na Ubuntu; Ubuntu jest , zostało dawno temu sprzedane. To nie jest już linux.Wpuszczają was w maliny.\n\nWhat led you to that conclusion? It has nothing to do with ubuntu, it's a program not a distro. \n\nCo skłoniło Cię do takiego wniosku? Nie ma to żadnego związku z ubuntem nie jest to dystrybucja linucha a zwykły program.",
				"added": 1598629355
			}
		],
		"1598564669_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 40,
				"body": "Nice list of safe sites you have there.\nDo you take submissions?",
				"added": 1598630130
			},
			{
				"comment_id": 42,
				"body": "> [krombopulusmike](#comment_9_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): The hell this means? [...]\n\nIt meant that I like his selection of sites on his proxy. And was wandering if he is taking submissions for new sites (for example a blog or WebLabel) to be featured on his proxy.",
				"added": 1598643183
			}
		],
		"1598474713_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 41,
				"body": "How can I be sure you're not reading my emails?",
				"added": 1598630717
			}
		],
		"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 43,
				"body": "In a sense it's a good news that they're censoring and taking down everything in sight.\nThe more stuff they'll remove the more people will seek for alternatives.",
				"added": 1598789412
			}
		],
		"1598804751_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 44,
				"body": "> [kai0](#comment_1111_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): zeronet still can use after internet shut down\n\nyes, it can be used, it should work no problem even inside \"ad-hoc\" network inside crowd, many modern phones support ad-hoc\n\nbut be sure such program is hidden inside your phone and datastore is encrypted or stored in microsd card so it can be quickly destroyed\n\nalso, check out \"meSHenger\" on F-Droid",
				"added": 1598807784
			},
			{
				"comment_id": 45,
				"body": "This might be of interest for you.\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF_item_1+type:book",
				"added": 1598890718
			}
		],
		"1598965770_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 46,
				"body": "I'll try to seed it as soon as I'm able to connect.",
				"added": 1598972455
			},
			{
				"comment_id": 47,
				"body": "Unfortunately it got stuck at like 80+ percent on unity logo.",
				"added": 1598979766
			},
			{
				"comment_id": 48,
				"body": "Here are some zites that got \"unity webgl\" to work.\nMaybe this would help\n\nhttp://127.0.0.1:43110/1F5p2NpSKJPD7VBZdYfytiJ6VpJkEkyQ5c\nhttp://127.0.0.1:43110/1KG9WvnmV5fLvhMmqH6C78DrSdJ3teZmvV",
				"added": 1599070453
			}
		],
		"1599488992_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [
			{
				"comment_id": 49,
				"body": "It's not open source, why would I care. I've lost trust with them since they included toolbars and \"desktop agent\"  in like 2004. \n\nI like skins museum though. But even then there are open-source alternatives that supports \"winamp skins\" like QMMP and Audacious.",
				"added": 1599490714
			},
			{
				"comment_id": 50,
				"body": "> [fornakter](#comment_3_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): Wheres Winamp 6?\n\nAnd 4",
				"added": 1599576849
			},
			{
				"comment_id": 51,
				"body": "> [fornakter](#comment_4_1K3sE6hzvXW4Kcv9ehHunuTeT8K8vBPmzY): What?\n\nWinamp 4 was never released they went straight to 5. They gave an explanation \"nobody wants to see a Winamp 4 skin\".\n\nI thought it was pretty funny and worth mentioning.",
				"added": 1599585090
			}
		],
		"1596775198_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 52,
				"body": "> [zjb](#comment_1_12tBgNBrUGcjrEMQ54QLkUG7VYFqZnnSAN): masks can make ugly guys look pretty\n\nand prevents facial recognition",
				"added": 1599663571
			}
		],
		"1599688609_17DFecT1rUtpofyfEvapNqRtkZ7J86M4H4": [
			{
				"comment_id": 53,
				"body": "> [thorburn](#comment_129_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Because that statement is fundamentally untrue. The reality is that there has not been a truly free capitalist system, the closest it may have come was probably the late 1700 and 1800's. Primarily during the development of the industrial revolution. When it was possible for individuals to develop ideas and bring them to local/national markets independently, without overreaching legislation etc\n\nMaybe in the US after they won their independence from the British and became basically the classless society without people of the noble blood. That wasn't really the case for the rest of the world. In order to even have a chance to \"develop ideas\"  you would have to know how to read, have some sort of basic education and most importantly not be a peasant. As a peasant you were owned, you were someone else possession, not a free man. \n\n> [thorburn](#comment_129_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): . The legislation crept in to restrict independent businesses from expanding, and allow larger organisations to form monopolies which could afford the expenses required to comply with legislation. Today many large corporations actually create the legislation required to protect their interests via lobbying etc. The monopolies simply buy out individual and family owned businesses, hoovering up innovation either for profit or to prevent new ideas/products from impacting existing profitable markets.\n\nThis will always end up this way, with exploitation of people, we can't pretend that human greed has any boundaries because it does not. Those \"lagre corporations\" already grew into such proportions that they can create laws, or treat president as a puppet. What good is president for when he has no power to do stuff he was chosen to? It's not democracy anymore.\n\n> [thorburn](#comment_129_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK):  it requires the productivity of one group to be plundered in order to support another group. The plundering is managed by yet another group which decides who shall be plundered and rewarded\n\nThat's not the problem with capitalism nor socialism, it's the problem of central planing and a fact that if something gets too big it cannot be managed efficiently without creating social unrest at local levels. The USA was created in such an event. And even now you can see how coastline states are developed in comparison to how middle states are underdeveloped.",
				"added": 1599754002
			}
		],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 54,
				"body": "Be hostile toward them also and don't use services with google captcha in them. Boycott them!",
				"added": 1599918152
			},
			{
				"comment_id": 60,
				"body": "> [claude](#comment_15_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): Probably advocating for censorship like that one dude from a few days ago who wanted a default blocklist in ZeroNet and got dunked on in his thread. (The thread seems to have disappeared.)\n\nYou mean this one? It didn't disappear, it's unlisted. \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S/How+to+request+a+plugin\n\n> [krombopulusmike](#comment_30_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): Children shouldn't be on these sites...\n\nWe should have kid friendly sites. Just to promote content diversity so that one day zeronet can become a 1:1 internet replacement. Without generational change this place will die within single generation.",
				"added": 1600665224
			}
		],
		"1600039815_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 55,
				"body": "> [kaffie](#comment_1146_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): There have been a few people like that. Scalpers trying to sell domains, and some people \"registering them so scalpers don't get them\" but then naturally those people went afk as well. So there's a lot of \"dummy\" entries in the registry that all point to the same site.\n\nCybersquating was to be expected. DNS was a mistake.",
				"added": 1600096484
			}
		],
		"1600095815_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": [
			{
				"comment_id": 56,
				"body": "Cool, will seed your blog.\nDo you have any tips on learning Chinese?",
				"added": 1600101223
			}
		],
		"1600446346_1Au471PrXrTD9fdN8uQR4W93qMunb1v53S": [
			{
				"comment_id": 57,
				"body": "There is a simple difference between censorship and filtering.\nCensorship is imposed on you, filtering is not.\n\nAs an example no one thinks about tools like Adblock, cookie autodelete, no-script as a form of censorship because it is not imposed, you are in control of that.",
				"added": 1600592128
			},
			{
				"comment_id": 61,
				"body": "> [zeronetuser101](#comment_7_1JvFhgnYTD257iRnVk6JpzDgbkZjRKJYkD): When it is enabled by default, it is indirect censorship.\n\nYes, I agree with you on that part that it shouldn't be enabled by default. I think it should be as separate from zeronet project as possible like a browser plugin or as a \"set of rules\" for antivirus program or something like that.",
				"added": 1600786777
			}
		],
		"1600451214_14DD49E4i7XTVfi8WqSuV47Nuo1T66etmP": [
			{
				"comment_id": 58,
				"body": "> [j4s0f](#comment_4_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): Why would you want weChat? It's Chinese gov spyware!\n\nIt actually might be a plus because it's a reason why it's outside of reach for USAs PRISM program.\nTrue answer to this would be open source p2p communication like Tox protocol, but still.",
				"added": 1600598670
			}
		],
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 59,
				"body": "> [driud](#comment_129_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): w\n\nWhen it comes to privacy and security a salesman is not your friend.\n\nJeśli chodzi o prywatnośc i bezpieczeństwo to sprzedawca nie jest twoim przyjacielem.",
				"added": 1600606098
			}
		],
		"1600902116_1A2q7qJ8xFsE2p1sdzkN87rQQx5Hdkdppx": [
			{
				"comment_id": 62,
				"body": "I'm interested in seeding stuff but not necessarily in teams membership.",
				"added": 1600923520
			}
		],
		"1601047977_1Fi8DX6DCYM65akSho5nuAZRmKxn9Yf77R": [
			{
				"comment_id": 63,
				"body": "Wear a face mask in public, thanks to a pandemic it's not considered weird anymore.",
				"added": 1601050061
			}
		],
		"1601116187_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 64,
				"body": "> [j4s0f](#comment_10_172SzEe2eDN1U4swCbnPUbbGjoN9MXMnGQ): Zeronet is not good for videos to be honest. I prefer posting on qBitTorrent and magnet linking to it on Zeronet. But to answer your question, Big Kopy Kate 2 is the best of the ones you listed.\n\nCome think of it, there should be a way to embed videos (and maybe other big files) from within a torrent/magnet links onto a zite to merge torrent and zeronet swarms. Maybe we should request it as a feature or something.",
				"added": 1601220006
			}
		],
		"1602684360_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 65,
				"body": "You can seed us some stuff. :P",
				"added": 1602686897
			}
		],
		"1602677892_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 66,
				"body": "\"We have invented nothing\"\nIs there a torrent available of this archive? Coz in current state it's susceptible to censorship.",
				"added": 1602687561
			}
		],
		"1602786830_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": [
			{
				"comment_id": 67,
				"body": "Culture doesn't belong to the few, it belongs to the many!\n10/10 will seed",
				"added": 1602788684
			}
		],
		"1603117313_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 68,
				"body": "I've been looking forward for you resolving your issues. Keep up the good work, we really need some original content like this here. Will seed as soon as I'm able to connect.",
				"added": 1603120523
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 69,
				"body": "> [reichama]\nI wanted to tell pretty much the same but your comment was quicker. Living in eastern Europe at this time of weather season can make you depressed and it's common here.\nAs for vitamin D I would suggest Fish oil (tran) vitamin d needs to be dissolved in fat to be useful and fish oil does the trick.\n\nI'm a lazy bum myself and exercise video games saved me here (wii fit and ring fit adventure) the sense of self improvement pointed out by in-game statistics were motivating enough to keep me playing/exercising regularly.",
				"added": 1603128441
			}
		],
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 70,
				"body": "I think that plugins are poorly promoted within a network and programmers group are somewhat detached from end-users group. (best example of this would be nofish not posting here with us).\n\n> [driud](#comment_145_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Sure I get it; The language of slaves. is it so hard to turn on the translator\n\nBut that's just one more reason to learn it. To learn language of people you dislike. I mean what would be the chances of deciphering enigma if people didn't knew German in the first place.\n\nI to jest jescze jeden powód więcej dla którego miałbyś się go nauczyć. Warto jest uczyć się języków ludzi których się nie lubi. Pomyśl jakie mielibyśmy szanse rozszyfrowania enigmy gdybyśmy nie znali niemieckiego.",
				"added": 1603209849
			}
		],
		"1603368158_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 71,
				"body": "not your personal army",
				"added": 1603377382
			}
		],
		"1603374060_1E1y7xgzGJZzFvxUsjsXWk3YnBoGGWkosz": [
			{
				"comment_id": 72,
				"body": "how does it compare to BiglyBT?",
				"added": 1603377813
			}
		],
		"1603284377_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 73,
				"body": "> [leaks](#comment_8_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU): Cuba discovers it, they'll arrest people and shut down the entire internet and ask China for help with a new firewall. Good luck.\n\nI'd be less surprised if US would try to do such a thing. For many countries such networks is a chance for independence from american-internet-infrastructure and for US it is a threat to a monopolistic practices. \n\nhttps://archive.org/details/bbs-20040129-grennan/Grennan+and+Drexler+-+Tape+1.avi\ntimestamp 48:30 onward",
				"added": 1603387873
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 74,
				"body": "All I wanted from zeronet was huge anime titties and cat pictures.",
				"added": 1603477248
			}
		],
		"1603548193_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 75,
				"body": "I'm happy to report that I've successfully downloaded whole site and everything works.\nI don't really agree on most stuff that's there mostly the red-scare echo but I believe in freedom for you to say it. So ill seed it anyway.",
				"added": 1603621947
			}
		],
		"1603738395_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 76,
				"body": ">Anonymity is protected under the First Amendment. Anonymity is the only way to speak in the United States sometimes for various reasons for example.\n\nsame could be said about encryption and knowledge-sharing\nyet DMCA and Encryption export restrictions still happened\n1st amendment is a joke at this point",
				"added": 1603815834
			}
		],
		"1605282602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 77,
				"body": "> [77ha01](#comment_2_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A): Countless dystopia movies show us the ultimate outcome of AI, but we still don't acknowledge the dangers. It's not even sci-fi anymore. Technology is evolving at a faster rate than we are unfortunately.\n\nIt would be silly to even try stopping progress.\nBut we can at least mitigate its exploitative potential by making sure such projects stay open source, by making open datasets and by fighting computer illiteracy in general public.\n\nAs for emotions, nope, those are coming from mortal flesh and desires. Computers don't have those.",
				"added": 1605384589
			}
		],
		"1605824826_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 78,
				"body": "they're going to ban mathematics?\nhow?",
				"added": 1605894134
			}
		],
		"1605934602_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 79,
				"body": ">>Comments must be submitted by 31 March 2019.\n\nIs that a mistake?",
				"added": 1605938785
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 80,
				"body": "My personal recomendations\n\nGoogle = YaCy\nYoutube = PeerTube",
				"added": 1605986560
			},
			{
				"comment_id": 85,
				"body": "> [wdp4n3v8pn6imenx](#comment_2_138JhGhg571ZWe4pA6JecsiDQmR4QvzGLK): Describe how you use YaCy. Tried it eons ago and it was a mess. Must you still host a YaCy server to use it?\n\nI run it on my personal home-server (along with other p2p stuff). There are some volunteers that run it public like http://search.raid6.com.au/ and https://sixcooler.de:8443/ \n but preferred way is to run it yourself.",
				"added": 1606846438
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 81,
				"body": "OP has a point that this place got monothematic and every topic devolves rather quickly into conspiracy-bait.",
				"added": 1606147880
			}
		],
		"1606253072_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 82,
				"body": "It would be a problem if the project was closed source.",
				"added": 1606254357
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 83,
				"body": "Having someone to talk to usually helps.",
				"added": 1606506080
			}
		],
		"1606532098_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 84,
				"body": "Just imagine the things we could draw if we had monospaced fonts here.",
				"added": 1606545705
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 86,
				"body": "Coz I have bunch of hard drives and no idea what to do with them. \nUltimately I want to run it on non-internet-dependant meshnetwork. But It needs to get more popular first.",
				"added": 1607012152
			},
			{
				"comment_id": 87,
				"body": "> [papull](#comment_8_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): Dedicate it to Freenet\n\nI'm already on freenet also, as a silent lurker but still. \nDo you have any config recommendations for creating bitchin-fast node? Preferably one that runs past 500GB datastore \"limit\".",
				"added": 1607279061
			}
		],
		"1607189377_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 88,
				"body": "good",
				"added": 1607285711
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 89,
				"body": "we're using it it's fine",
				"added": 1616242427
			}
		],
		"1616203894_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 90,
				"body": "could you mirror it to zeronet or a torrent file?",
				"added": 1616242639
			}
		],
		"1616435266_165aBifCkjbWxo7rEf9ZaiCv39NpinQAtp": [
			{
				"comment_id": 91,
				"body": ">Badly Sorted Music and pictures of trains\nsounds awesome to be honest",
				"added": 1616441005
			}
		],
		"1616503348_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 92,
				"body": ">Or maybe the offline update mode aka \"sync this node from a USB flash stick\".\nJust imagine the possibilities like syncing nodes with mailing pigeons and microsd cards",
				"added": 1616514848
			}
		],
		"1616688942_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 93,
				"body": "cool site, will seed",
				"added": 1616690979
			}
		],
		"1616716381_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 94,
				"body": "> [deuxzaron](#comment_123_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): He's very likely to use his giant cock to do it\n\nI thought he was micro - soft",
				"added": 1616923458
			}
		],
		"1617087999_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": [
			{
				"comment_id": 95,
				"body": "Would be nice to have it mirrored here also",
				"added": 1617116477
			},
			{
				"comment_id": 96,
				"body": "> [theofflinebay](#comment_2_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN): I want to add it here and as a hidden service too.  It should be relatively straight forward to upload the downloadable version to ZeroNet.\n\nLooking forward to it!",
				"added": 1617205917
			}
		],
		"1620446786_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 97,
				"body": "It probably looks like a password to you coz it's not in english.",
				"added": 1620846637
			}
		],
		"1623356651_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 98,
				"body": "Not \"better\" but with a different approach I'd say freenet.\nAs for being obsolete I don't really care. I don't need fancy modern UI with animations that gives you motion sickness just to shitpost online.",
				"added": 1623388015
			}
		],
		"1620449256_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 99,
				"body": "Today I learned a difference between lama and alpaca.",
				"added": 1623479035
			},
			{
				"comment_id": 100,
				"body": "> [deuxzaron](#comment_160_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): I can't find anything about this but would Freenet run on OpenJDK?\n\nCan confirm that it runs on openJDK on debian just fine.",
				"added": 1623685394
			}
		],
		"1623654807_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": [
			{
				"comment_id": 101,
				"body": "My wish list:\n-BBS Documentary \n-Good copy bad copy\n-Computer Chronicles\n-Pure Pwnage web series (preferably the og torrent it was distributed officially)",
				"added": 1623768927
			},
			{
				"comment_id": 102,
				"body": "> [piracy](#comment_3_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz): all added to zerotorrent! :)\n\nthx !",
				"added": 1623788279
			},
			{
				"comment_id": 104,
				"body": "> [g8wl6n](#comment_7_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB): where\nhere \n\nhttp://127.0.0.1:43110/ZeroTorrent.bit/",
				"added": 1623906720
			},
			{
				"comment_id": 106,
				"body": "> [styromaniac](#comment_3114_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): While content on ZeroNet can help, I don't see the reason for piracy here \n\nFor me the reason is preatty simple:\n-more content -> more people -> more content ...\n\nWhile I realise that everything I've requested is licenced on CC licence or was released as a torrent anyway and is easy to get on clearnet. It's a way for independence from centralised network.",
				"added": 1624085073
			},
			{
				"comment_id": 107,
				"body": "> [piracy](#comment_6_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz): piracy is more tollerated\n\nI would split the term piracy into \"commercial piracy\" and \"non-commercial piracy\" because knowledge and culture sharing AKA \"non-commercial piracy\" lays implicit to the idea of freedom of speech and basic human-human interaction.",
				"added": 1624639789
			},
			{
				"comment_id": 108,
				"body": "> [zeroseed6b](#comment_4_1PYse2fs94EphqFApJnUCBPa4wMNTvTddn): Look at my cc content on galactichan\n\nOk, I've just started seeding it\n\nI'm all in for promoting zeronet to CC content creators because CC licenses are more on track with today information exchange than outdated copyright. But also p2p webhosting brings \"staying online\" cost to a minimum. I mean bandwidth cost is shared among peers, DDOS problem is already solved, no domain name associated cost, and the beauty of this place is that even \"abandoned content\" is still reachable.",
				"added": 1624684347
			}
		],
		"1623520940_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 103,
				"body": "Check this guy building a cabin.\n127.0.0.1:43110/1H8hYdFAtHikXWa617JbxDZoyoc6RJpWHY/",
				"added": 1623871336
			}
		],
		"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt": [
			{
				"comment_id": 105,
				"body": "> [orien3242](#comment_76_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): because zeronet was made by a chinese person\n\nI thought he was Hungarian.",
				"added": 1623948487
			}
		],
		"1624713894_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 109,
				"body": "I really like the style of this site! Rules are pretty vague but it really boils down to moderator intuition anyway. I've wanted to post there but I couldn't come up with anything worth writing, I really hate this ridiculous summer heat.",
				"added": 1624822363
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 110,
				"body": "It's not dead until last seeder leaves.",
				"added": 1624855677
			}
		],
		"1625348483_1LKatdJrXVLYHewYYmPfDioZxM3kAsYLPp": [
			{
				"comment_id": 111,
				"body": "> [qwyx](#comment_6_12sEK7ur84yYok3iWWPxZUvZd4YqjuQG9f): Why dead? because 99% of peoples live only in social media\n\nSocial media is the new opium for the masses unfortunately.",
				"added": 1625387533
			}
		],
		"1626704177_1JMn7zrA5b35HR8wTSeyQrbCSxj2LDuxgt": [
			{
				"comment_id": 112,
				"body": "What Zeronet needs the most is probably original content.\nCould you run zeronet node in yggdrassil network? \n\nWe could exchange sites for seeding later coz I have lots of spare resources too.",
				"added": 1626706297
			}
		],
		"1626899244_1GPfjgQaVsQ4F41n958K8sSYakRr1nvZCa": [
			{
				"comment_id": 113,
				"body": "hello, hope you'll stay with us",
				"added": 1626965334
			}
		],
		"1627637997_1B6JScbE4NxJHgSVTGGjeNhk157tpeLfWT": [
			{
				"comment_id": 114,
				"body": "Ask him for password and chip in for the subscription.",
				"added": 1627660811
			}
		],
		"1628395676_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 115,
				"body": "It sound good at first glance, but how are you going to solve problems associated with domain-squating, domain-name-resellers and other problems \".com bubble\" had?",
				"added": 1628412192
			}
		],
		"1637164951_1FmMvcMgGyFnWtH3aSAHmaxwedbBR4EVha": [],
		"1633895520_1BFxHVXHTKcnWLWPVKbTknZTAaiHz6tgcV": [
			{
				"comment_id": 118,
				"body": "It could be a basis for a proper searchengine. Did they released ZeroCrawler to the public? Can I run it myself?",
				"added": 1637648257
			}
		]
	},
	"comment_vote": {
		"11_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"480_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"119_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"6_1EdFvRMCSsjRQDSwKEaYDu3aU2o5PfzhrX": 1,
		"44_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"1156_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1158_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1Go2fSUWjjmqMA7rwxpb56Cj31mxfeELak": 1,
		"27_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"6_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1,
		"5_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": 1,
		"1_1LcaiyidDpqH5h7MfZTGSJiBVLTjBzgGjs": 1,
		"600_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"492_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"35_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"38_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"43_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"12_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"1_18hoZQZsweaLpw7nB9wJkqVA9ZSkbSAeQp": 1,
		"2599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1Aer18xiLtbmyE5e3LcZWc6mwmP8bN9URy": 1,
		"667_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"9_12C4ypkzVhDg4g8xjS8DARB1LcFTauXcXN": 1,
		"3_1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa": 1,
		"3_1AyJkc3Yv7gRoY2w1VR3Q7UgxFvwYhVLLh": 1,
		"2_1LZGRUjvEkyyX4dKdGqTCxP1smz6tkph8B": 1,
		"199_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1176_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"28_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"409_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"35_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv": 1,
		"1_1bKh5D7jgCbhCLTjQwxUCeovri6TF1Laj": 1,
		"1_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib": 1,
		"1_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"2_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"13_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU": 1,
		"8_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"204_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"84_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"811_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"2746_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_18eBzLnTF3adKYrHn7tAKfNzyrcT1qJz9J": 1,
		"21_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"6_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"2759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"79_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"9_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"492_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"11_1FaYmkpUhqXHNqzAhPvkJdPuQrhZNar1YF": 1,
		"5_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"2_19yGjJuztHvDMQprqT7cxPjzbjfthnf3nQ": 1,
		"14_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"55_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"828_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"763_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"105_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"2975_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"77_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"84_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"39_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"11_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": 1,
		"5_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"45_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"1_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": 1,
		"663_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"2_16u7ApvQbcH9sGVJV5ELBvY1AQiZLnbDKN": 1,
		"3074_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"142_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"10_1KBserDE8oownu1aR5REHcC3jf9qNkmQDo": 1,
		"3_1EkuneRk9X5yizVpYMkfk21EgjPzXm4tLh": 1,
		"19_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1,
		"94_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1_15E8TqgMTGTv8jc2utE6UXEsBaqKHYRHrd": 1,
		"4_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP": 1,
		"5_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP": 1,
		"156_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_14W1Bv1r2jPSPuRLGFhfG2PDm5JEitLkC7": 1,
		"2_1QArHQfn2ikmHDuqvBPcDPpomSrJtKqiZB": 1,
		"114_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"2_16zLpbqTz9hpy6E2oH3y7tHNiTyVsB4RiQ": 1,
		"3_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": 1,
		"4_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": 1,
		"116_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"4_1PYse2fs94EphqFApJnUCBPa4wMNTvTddn": 1,
		"6_15brvpgJ5PFKGLF6976wR5gMd2ryzcg2wz": 1,
		"1_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": 1,
		"3125_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"875_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"3135_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf": 1,
		"2_1JMn7zrA5b35HR8wTSeyQrbCSxj2LDuxgt": 1,
		"89_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"14_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8": 1,
		"2_1DMAiK5GgQzieWiy24LKz6NDkHJo8m5CLU": 1,
		"132_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"133_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"914_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"37_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1,
		"1_1Ej4267R8CipXfNUqkYrxrjzJ46ThsZ6e3": 1,
		"61_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD": 1
	}
}