{
	"title": "Zeroburbuja blog",
	"description": "Reflexiones burbujiles de un usuario de zeronet.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1525873574,
	"post": [
		{
			"post_id": 4,
			"title": "Sexmission",
			"date_published": 1525873301.5,
			"body": "Os dejo una película polaca , comedia de 1984 , que podría ser perfectamente producida en este 2018\\. Un mundo sin hombres, gobernado por mujeres, y dos hombres que habían sido hibernados , despiertan y se encuentran el percal:\n\n[https://easterneuropeanmovies.com/comedy/10-sexmission.html](https://easterneuropeanmovies.com/comedy/10-sexmission.html)\n\nAbajo de todo ,tenéis un link , con subtítulos en inglés y español"
		},
		{
			"post_id": 3,
			"title": "A vueltas con el progresismo, y el agujero negro al que vamos abocados.",
			"date_published": 1525619678.5,
			"body": "Pues el blog de un refugiado de burbuja.\n\nEstoy muy preocupado,por el cariz que van tomando las cosas en españa, censura a las claras , feminazismo desatado... hay que empezar a plantearse tomar medidas de una vez. Si seguimos delegando todo el poder en estos \"politicos\" , vendidos a Soros y oscuros intereses, nos espera poco futuro.\n\n*   feminazismo. Hembrismo. Doble rasero de medir ,respecto si eres mujer u hombre.\n\n*   pérdida gradual de derechos y libertades.Pérdida de presunción de inocencia si eres hombre, inversión de la carga de prueba en juicios.\n\n*   escasez de trabajo. Sueldos denigrantes, nulas perspectivas de futuro para gran parte de la población. Economía sin ninguna pespectiva , están intentado reavivar otra vez la burbuja inmobiliaria...\n\n*   inmigración desbocada e innecesaria. NO necesitamos traer millones de desgraciados , que lo único que suponen es carga para nuestro sistema de seguridad social. Y que poco o nada tienen que aportar. En un país con el paro que tenemos, no debería entrar ni uno más.\n\n*   Mamandurrias por doquier. Nos dicen que no hay dinero, y que hay que recortar. Pero se recorta donde ya estamos en el hueso, no donde está la grasa, : diputaciones, ayuntamientos con pocos habitantes, que se deberían fusionar, \"asesores\" a dedo, observatorios de diversas estupideces (género ,etc). AHÍ hay que recortar señores, y no en sanidad, educación...\n\n*   Impuestos a niveles confiscatorios. Claro está, para mantener el chiringuito , ya que incluso con el dinero del BCE -que es un balón de oxígeno, sin el cual estariamos en default- , ni siquiera con esas ,basta. Hay que chuparnos la sangre como sanguijuelas.\n\n*   Nulo interés en potenciar el mercado laboral , de una forma eficaz (reduciendo impuestos, cotizaciones seg.social..) . Becas para investigación que funcionen , arreglar de una maldita vez la separación entre estudios / necesidades del mercado laboral.\n\n    *   si se quisiera se podría hacer mucho mas. Pero es que el chiringuito actual, es coto de caza para el IBEX35, no quieren más competencia.\n\n    *   Así a bote pronto,  con todas las horas que tiene españa de sol ... podríamos ser una potencia en renovables (solar). Invertir AHÍ ,pero de forma sensata, no como ZP. No se trata de poner solo pasta, se trata de poner pasta con cabeza.\n\n*   Terrible piramide demográfica . No nacen niños españoles, las familias están desestructuradas , no hay valores, la gente no quiere tener niños. Pero los inmigrantes si los tienen, y en cantidad -> sustitución demográfica -> problemas de convivencia in crescendo (de aqui 10-15 años esto va ser la risión).\n\nEn fin , pensamientos que me vienen a la cabeza, sin darles demasiadas vueltas. Que os parece? Que medidas propondríais para revertir la actual , y kamikaze situación?\n\nEn otro rato más , si queréis comentarme algo, ya sabéis :)"
		}
	]
}