{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 29,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "O Último Grande Herói 1993 Dublagem Clássica SC São Paulo\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592347975_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Danny Madigan (Austin O’Brien) é um garoto que fã incondicional do personagem Jack Slater (Arnold Schwarzenegger). Ele ganha um ingresso de cinema mágico, que faz com que Danny entre no novo filme de Slater e passe por aventuras num mundo maluco, com desenhos animados, violência e até mesmo Catherine Tramell (personagem de Sharon Stone em “Instinto selvagem”). Porém, há um problema: o mesmo ingresso faz com que os vilões do filme saiam para o mundo real. Slater vem atrás deles, passa por vários apuros e acaba encontrando o ator que o interpreta, Arnold Schwarzenegger.",
				"added": 1592348484
			},
			{
				"comment_id": 2,
				"body": "19 - 007 - O Amanha Nunca Morre 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592535871_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: James Bond descobre que o magnata da mídia Elliot Carver colocou em prática um plano para manipular as superpotências e expandir seus negócios. O agente deve impedir que essa ideia doentia provoque uma nova guerra mundial.",
				"added": 1592551011
			},
			{
				"comment_id": 6,
				"body": "Massacre no Bairro Japonês 1991 Dublagem Clássica Álamo\n\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592618096_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: O americano de educação japonesa Chris Kenner é um policial responsável por Little Tóquio, um bairro de Los Angeles. Kenner faz parceria com Johnny Murata, um nipo-americano que não tem contato com suas raízes. Apesar de suas diferenças, os dois se sobressaem por suas habilidades em artes marciais quando lutam contra Yoshida, um traficante de drogas vingativo da máfia japonesa, que tem laços com o passado de Kenner.",
				"added": 1592618889
			},
			{
				"comment_id": 7,
				"body": "Trinity Ainda É Meu Nome 1971 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592636191_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Bambino (Bud Spencer) tenta ensinar seu irmão Trinity (Terence Hill) a ser um bom fora-da-lei e um bom ladrão de cavalos. No entanto, os planos dos dois irmãos são frustrados quando eles têm que salvar uma família de pioneiros e desbaratar uma gangue de tráfico de armas, que usa monges de uma missão como fachada.",
				"added": 1592636613
			},
			{
				"comment_id": 11,
				"body": "The 13th Warrior (Os 13 Guerreiros) 1999 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592775175_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Ahmed (Antonio Banderas), um embaixador exilado que vive distante de sua terra, encontra um bando de guerreiros que vem sendo atacado por ferozes criaturas, que devoram todas as coisas vivas que cruzam seu caminho. Quando um velho vidente alerta aos combatentes que estão fadados a perder a luta se não conseguirem um 13º guerreiro, Ahmed acaba juntando-se ao grupo na batalha para vencer o misterioso inimigo.",
				"added": 1592775386
			},
			{
				"comment_id": 14,
				"body": "Um Lobisomem Americano em Paris 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592886725_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: A filha de um lobisomem mora em Paris, onde sua mãe e o padrasto tentam curá-la da licantropia, que herdou geneticamente. Mas nem tudo corre como o planejado e ela tenta se suicidar saltando da Torre Eiffel, sendo salva por um americano que viaja através da Europa com dois amigos. Os dois se apaixonam, mas ele logo se envolve em uma sociedade secreta de lobisomens e uma droga que permite que os lobisomens se transformem, sem necessidade de lua cheia.",
				"added": 1592887501
			},
			{
				"comment_id": 15,
				"body": "O Quinto Elemento 1997 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592890252_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: No século XXIII, um motorista de taxi (Bruce Willis) de Nova York se envolve em uma aventura na qual tem de deter um ser demoníaco que percorre a galáxia a cada 5000 anos. Se nada for feito a Terra será destruída, mas para isto ele precisa encontrar 4 pedras antigas, que representam os elementos, e colocá-las em volta de uma bela mulher (Milla Jovovich), que é o quinto elemento.",
				"added": 1592890583
			},
			{
				"comment_id": 16,
				"body": "Sherlock Holmes - O Jogo Das Sombras 2011 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592973217_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Há um novo mentor criminoso em geral e não apenas ele é o equivalente intelectual de Holmes, mas sua capacidade para o mal e a falta de consciência pode lhe dar uma vantagem sobre o detetive.",
				"added": 1592973714
			},
			{
				"comment_id": 17,
				"body": "Rocky 3 - O Desafio Supremo 1982 Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593061037_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Após ter sido derrotado por Clubber Lang (Mr. T), um novo e temível adversário, Rocky (Sylvester Stallone) passa a ser treinado para a luta revanche por Apollo Creed (Carl Weathers), seu antigo rival, que deseja de Rocky apenas um pequeno favor em troca dos seus serviços.\n\n\n",
				"added": 1593061219
			},
			{
				"comment_id": 26,
				"body": "O Cara 2005 Dub\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593339690_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Após um agente federal ser encontrado morto nas ruas de Detroit, se descobre que ele estava recebendo suborno devido a um crime envolvendo milhões. Após esta descoberta as atenções se voltam para Derrick Vann (Samuel L. Jackson), seu parceiro, que trabalha sob disfarce e tem a fama de não ser muito confiável. Vann recebe um ultimato para recuperar as armas roubadas e encontrar o assassino do policial em 24 horas. É quando entra em sua vida Andy Fidler (Eugene Levy), um vendedor de material odontológico que chegou há pouco tempo na cidade para participar de uma convenção. Confundido com um comprador de armas pelos bandidos, Vann é obrigado a usar Fidler como testa de ferro para que seu plano dê certo.",
				"added": 1593339985
			},
			{
				"comment_id": 27,
				"body": "The Terminator (O Exterminador do Futuro) 1984 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1571297814_1AykVRYDikZAFCS4uF3uKRbwQqJEL3evys\n\nSinopse: Num futuro próximo, a guerra entre humanos e máquinas foi deflagrada. Com a tecnologia a seu dispor, um plano inusitado é arquitetado pelas máquinas ao enviar para o passado um androide com a missão de matar a mãe daquele que viria a se transformar num líder e seu pior inimigo. Contudo, os humanos também conseguem enviar um representante para proteger a mulher e tentar garantir o futuro da humanidade.",
				"added": 1593342723
			},
			{
				"comment_id": 28,
				"body": "Debi e Lóide - Dois Idiotas em Apuros 1994 Dublagem Clássica\n\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593444681_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C\n\nSinopse: Lloyd Christmas (Jim Carrey) e Harry Dunne (Jeff Daniels) são dois homens extremamente estúpidos. Quando Lloyd leva até o aeroporto Mary Swanson (Lauren Holly), uma bela mulher que vai para Aspen, Colorado, acredita que Mary perdeu uma mala. Na verdade ela \"esqueceu\" no saguão, pois dentro dela está uma grande soma para pagar o resgate do marido, mas antes que os seqüestradores peguem a valise Lloyd a recupera e tenta lhe entregar. Como o vôo já partiu e ele se sente atraído por Mary, convence Harry para irem até Aspen para devolver o dinheiro. Na viagem se envolvem em várias confusões, além de serem perseguidos pelos seqüestradores.",
				"added": 1593444896
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 3,
				"body": "Dragon Ball Z - Episodio 093 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592535468_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592551031
			},
			{
				"comment_id": 4,
				"body": "Naruto Classico 63 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592551047_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592551104
			},
			{
				"comment_id": 5,
				"body": "Os Simpsons S02E22 Dívida de Sangue Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592557346_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592557406
			},
			{
				"comment_id": 8,
				"body": "Dragon Ball Z - Episodio 094 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592713888_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592713958
			},
			{
				"comment_id": 9,
				"body": "Dragon Ball Z - Episodio 095 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592714183_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592714348
			},
			{
				"comment_id": 10,
				"body": "Dragon Ball Z - Episodio 096 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592714988_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592715065
			},
			{
				"comment_id": 12,
				"body": "Dragon Ball Z - Episodio 099 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592819966_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592820145
			},
			{
				"comment_id": 13,
				"body": "Futurama S01E01 - Piloto Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1592825977_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1592826054
			},
			{
				"comment_id": 18,
				"body": "Dragon Ball Z - Episodio 100 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593101236_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593101373
			},
			{
				"comment_id": 19,
				"body": "Futurama S01E02 - Uma Viagem à Lua Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593101997_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593102067
			},
			{
				"comment_id": 20,
				"body": "Futurama S01E03 - Um Amigo Robô Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593151744_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593151856
			},
			{
				"comment_id": 21,
				"body": "Dragon Ball Z - Episodio 101 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593242465_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593242567
			},
			{
				"comment_id": 22,
				"body": "Futurama S01E04 - A Procura de um Amor Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593243043_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593243138
			},
			{
				"comment_id": 23,
				"body": "Futurama S01E05 - Humanos Aqui não Entram Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593245126_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593245224
			},
			{
				"comment_id": 24,
				"body": "Dragon Ball Z - Episodio 102 Dub mkv\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593333713_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593333777
			},
			{
				"comment_id": 25,
				"body": "Futurama S01E06 - A Minha Fortuna São os Meus Amigos Dub\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1593334439_1DKzUdrEtyBHnNmDPXe7ACiHQF3s4eqm1C",
				"added": 1593334582
			}
		]
	},
	"comment_vote": {}
}