{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1612045366,
			"title": "Teoria spiskowa",
			"body": "Znalezione na stronie http://localhost:8888/USK@s7MNTvsRDIdeR1kMe5VUFlKRoqYWK4~x21QUWusRW~U,k3RCGghd3sFaRJnIyUgm3WdGTs9ZC2hh7a5chtQJuxk,AQACAAE/Teoria%20spiskowa/0/  ( Jest to Freenet, jak ktoś nie zna to zapraszam na ten link https://freenetproject.org/ )\n\nTen artykuł dał mi sporo do myślenia, ciekawi mnie co wy o tym myślicie, dajcie mi znać w komentarzach. Życzę miłej lektury ;) \n\n\n\n\n\n\n„Starożytni znawcy Tao,\nnie oświecali ludu,\nlecz go ogłupiali.\nTrud w rządzeniu ludem,\nwynika z tego, że lud dużo wie” (Lao-tsy).\n\n„Niech ci, którzy czytają ten wiersz, rozważą jego treść,\nNiech pospólstwo i niewykształceni zostawią go w spokoju,\nWszyscy oni – głupi astrologowie i barbarzyńcy – niech trzymają się z daleka, Ten, który czyni inne rzeczy, niech będzie kapłanem rytu” (Nostradamus).\n„Złamaliśmy prawo, ale nigdy nie mieliśmy wątpliwości. Ale teraz gdy idziemy przez las, uczymy się wątpić” (Ayn Rand).\n\nW teorię spiskową nie wierzy nikt o zdrowych zmysłach. Teoria spiskowa to domena\nobłąkanych umysłów. Maniacy, irracjonaliści, świry, szaleńcy, dzieci, fanatycy religijni – niech oni się tym zajmują. Ja jestem poważnym umysłem. Mam rodzinę, wykształcenie, dobrą pracę, duży dom, szybki samochód. Stoję twardo na ziemi. Wiem, jak zbudowany jest\n\nWszechświat, znam odpowiedź na każde pytanie, rozumiem system. Nie wierzę w nic, stawiam na fakty. Mam dyplom i trzy litery przed nazwiskiem. Otrzymałem edukację, otrzymałem prawidłowy światopogląd, a codziennie wieczorem otrzymuję świeże wiadomości zza szklanego ekranu. Tak! Wiem co się na świecie dzieje. Poważni dziennikarze w wygładzonych fryzurach, mądrzy specjaliści w drogich garniturach, uśmiechnięte prezenterki z wyciętym dekoltem. Profesjonalne zdjęcia, perfekcyjna polszczyzna, same dobre rady. Opinie ekspertów. Oni już zadbają o to, żeby żyło nam się dostatnio, wiedzą co i jak. Ten świat nie zginie pod ich przywództwem, oni go poprowadzą.\nWszystko jest tu takie proste i łatwe! Mamy opiekę socjalną, mamy darmową edukacją, mamy wgląd do wszystkich informacji. Policja sprawuje pieczę na naszym bezpieczeństwem, potężna armia broni naszych granic, a kamery na ulicy pilnują, aby nikomu nic się nie stało. Wszędzie jest nadzór, każda informacja jest zapisywana, nic tutaj nie ginie. Ład i porządek, po prostu – wszystko pod KONTROLĄ! Cóż za piękny, bezpieczny i bezstresowy świat. Wystarczy przestrzegać prawa i płacić podatki. Oni się wszystkim zajmą, a ja? Ja mogę korzystać z życia!\n\nMój sąsiad to kretyn. Nie ogląda telewizji, nie słucha radia, nie czyta gazet i jeździ jakimś rozklekotanych gratem. Sprzedaje jabłka w warzywniaku i zarabia marny tysiąc miesięcznie, ledwo wiąże koniec z końcem. Co z tego, że kiedyś ukończył z wyróżnieniem informatykę na renomowanej uczelni. Przecież nikt nie przyjmie takiego świra, co na rozmowę kwalifikacyjną w korporacji medialnej przychodzi w trampkach i koszulce z napisem: „Telewizja kłamie!”. Albo na pierwszej randce z dziewczyną rzuca jej podejrzenie, że jest tajną agentką GRU, która chce wykraść jego sekrety. On nawet nie może normalnie SMS-a napisać – kontaktuje się z jemu podobnymi świrami przy pomocy tajnego kodu, który sam opracował, gdyż twierdzi, że wszystkie rozmowy mogą być podsłuchiwane. Nawet jeśli, to co z tego? Mnie mogą podsłuchiwać, ja jestem porządnym obywatelem i nie mam nic do ukrycia. Ale on rzeczywiście mógłby mięć problem, gdyby policja zobaczyła o czym on dyskutuje, zaraz by go wzięli na spytki. A może nawet zamknęli wśród czubków? W klinikach pewnie już takich pełno. Ale ten debil nie chce wziąć nawet głupiej tabletki na uspokojenie, twierdzi, że nie da się truć kartelom farmaceutycznym. Zamiast tego żre czosnek i mleko z miodem. I jakieś nie przetestowane zioła, ponoć lecznicze, których importu mądra Unia zabroniła (jak można sprzedawać coś, co nie została przebadane? To może być niebezpieczne!) Ale on sobie to na czarno załatwia. Jak mnie wkurzy, to go sypnę. Aaa, ten down nie posiada nawet konta na facebooku ani na żadnym innym serwisie społecznościowym. W którym wieku on żyje? Jak można sobie bez tego radzić, nic dziwnego, że jego życie towarzyskie kuleje. Że niby magazynują nasze dane, że je wykorzystują, że służby specjalne nas inwigilują? Trzeba było nie wychylać się z szeregu, nie miałby takiego problemu. Gość musi mieć nie po kolei w głowie i tyle.\n\nI jeszcze te jego bezsensowne majaczenia na prawo i lewo. Jakieś UFO, reptilianie, smugi chemiczne, NWO, Rockefeller, Bilderberd, Komisja Trójstronna, Trójkąt Bermudzki, HARP, Mędrcy Syjonu, masoni, Iluminaci, dzieci indygo, sataniści, New Age, Kennedy, syndykaty… terroryzm, Czaszki i Piszczele, Bush, masowa kontrola umysłów, zagłada 90% ludzkości… podatek katastralny, Daniken, projekt Blue Beam, Leonardo da Vinci, naziści… co on tam jeszcze pierdolił? A, było tego trochę, ma całą stertę książek o tym głupotach… samolot Aurora, Roswell, strefa 51, fałszywe flagi, eksperyment Filadelfia, czarne wołgi, czarne helikoptery… andinia, waluta amero, ludzie w czerni, ludzie cienie… (ciekawe czym się różnią jedni od drugich?) ... Atlantyda, ziemia Mu, Lemuria, annunaki, marsjańska twarz, lądowanie na Księżycu, że niby fałszywe… o byłbym zapomniał, 9/11, jakim trzeba być idiotą, aby twierdzić, że rząd amerykański wymordował swoich własnych obywateli? Rząd? Demokratycznie wybrana, zaprzysiężona władza? Swoich… własnych… obywateli? To jakaś paranoja, takich powinno się zamykać w zakładać psychiatrycznych, to jakiś faszyzm, oni są niebezpieczni dla społeczeństwa. Przecież w telewizji wyraźnie pokazali jak było, czego on jeszcze chce? Że na YouTube znalazł jakiś filmik, gdzie jakiś świr ma jakieś wątpliwości? A po co sobie tym głowę zawracać? Wiadomo przecież, że wszystkie te amatorskie filmiki to rasistowska albo antysemicka, albo homofobiczna, a może szowinistyczna, seksistowska, antyfeministyczna, antygenderowska, antyekologiczna, antyeuropejska, antydemokratyczna, antyamerykańska, antypapuonowogwinejska, antyterrorystyczna… czy tam rusofobiczna, islamofobiczna, feminofobiczna, zoofobiczna, filofobiczna, fobiofobiczna, heksakosjoiheksekontaheksafobiczna PROPAGANDA! Jacy ci ludzie są naiwni, jak łatwo dają się zmanipulować w tym Internecie. Dziwne, że władza nie zrobiła jeszcze porządku z tymi przeklętymi światłowodami. Jak to tak, żeby każda bzdura swobodnie sobie krążyła po świecie i żeby każdy maniak mógł pisać co mu się tylko zrodziło w tym chorym umyśle? Kiedyś poddawano takiego zabiegowi lobotomii – jedno szybkie ciach i z gościa robiła się jarzyna do końca życia. I bardzo dobrze, przynajmniej nie truł już więcej tych głupot i nie mącić w głowie młodzieży. Przecież ich mogą czytać moje dzieci! A jeśli to jacyś pedofile, albo inni zboczeńcy? Dlaczego nikt tego nie kontroluje, nie sprawdza i nie cenzura? Powinien być jakiś porządek, jak można była pozwolić na taki bałagan? Miejmy nadzieję, że wielka nadzieja Ameryki, pan Barack Hussein Obama II, razem z wielką nadzieją Europy, panem José Manuel Durão Barroso zrobią i z tym porządek. Uporządkowali już przecież tyle rzeczy na tym chaotycznym świecie, zjednoczyli tylu ludzi i narodów, wprowadzili pokój na Wschodzie, uporali się z terroryzmem, zapewnili bezpieczeństwo na lotniskach, walczą z biedą, nierównością i dyskryminacją… to i z Internetem dadzą sobie radę. Bo jak nie, no to przecież każdy taki pedofil będzie sobie mógł tam bezkarnie grasować i pisać o tych… o tych… co tak jeszcze było? O tej całej zatrutej żywności, wodzie i powietrzu, o pieniądzu fidurcjalnym (co za nienowocześni zacofańcy mogą żądać przywrócenia standardu złota? Przecież to dobre dla barbarzyńców!), o FED, o podatkach, o bankierach, o łamaniu amerykańskiej konstytucja, która jest już taka przeterminowana i nie idzie z duchem czasu\n– przecież ten kapitalistyczny świstek papieru hamuje piękny marsz Ameryki ku powszechnej równości!\n\nEeeeh, Boże, który nie istniejesz, widzisz i nie robisz nic. Za karę w ciebie nie wierzę, nawet mnie nie próbuj przekonywać do swojego istnienia. Możesz nawet stanąć przede mną, ja należę do I-N-TL-I-G-E-N-C-J-I, a inteligencja jest zbyt inteligentna, żeby wierzyć w ten nieinteligentny, nielogiczny, nieracjonalny (i faszystowski oczywiście), religijny bełkot. Dobry dla niewykształconego motłochu. Albo mojego sąsiada. W każdym razie, skoro już nie istniejesz, to pokaraj ten cały ciemnogród i przyspiesz globalny marsz ludzkości ku nowej erze. Niech wyginą wszyscy ci zacofańcy, niech zatriumfuje rozum, nauka i technologia. Wkraczamy w nowe czasy, czasy powszechnego dobrobytu, gdzie każdy pomaga każdemu, gdzie zabiera się silniejszym a daje słabszym, gdzie wszyscy wspólnie pracują dla wspólnego dobra, aby żyło się dostatniej i świat był pięknym, przyjaznym miejscem. Ale najpierw… najpierw trzeba się pozbyć tego idioty, który idzie w moja stronę. Czego znowu? Szczepionki, epidemie i napęd antygrawitacyjny? A może Lady Gaga i Justin Bieber, w końcu to pedały i marionetki Illuminati!\n\n- Witaj Panie Slave, drogi sąsiedzie, piękna dziś pogoda, prawda? – zagadnął mnie najbardziej pasjonującym i najczęściej rozważanym tematem do rozmów, czyli problematyką meteorologiczną.\n- Piękna, bo nie ma smug chemicznych na niebie, czy piękna, bo jest w miarę chłodno w sierpniu i możesz triumfalnie głosić że: „Globalne ocieplenie to największy szwindel XXI wieku”, co, panie nawiedzony?\n- Ależ mogą panu pokazać mnóstwo opinii poważnych naukowców, którzy podważają dogmat o tym, że to wina człowieka…\n- Dobra, dobra, nie truj mi tu już swoich niepoprawnych bzdur! Wielki naukowiec i noblista Al Gore bezsprzecznie udowodnił czyja to jest wina. A na szczycie w Rio mądrzy ekolodzy podali rozwiązali, których ty – tu przerwałem na chwilę, żeby spojrzeć mu w oczy – kapitalistyczna świnio, nie chcesz zaakceptować ani zrozumieć. Planeta jest brudna, przeludniona, cierpi i należy jej pomóc. Potrzebny nam zrównoważony rozwój i ścisła kontrola zatruwającej świat gospodarki. Należy walczyć z przeludnieniem, rozdawać kondomy, edukować dzieci… - pomyślałem o czym jeszcze mówili socjaliści z Rio. – O! Opodatkować kierowców, lepiej żeby ludzie jeździli pociągami i komunikacją miejską. Mniej spalin i większe wpływy do budżetu. Albo niech się przesiądą na rower, przynajmniej schudną trochę, nie trzeba będzie tyle wydawać na służbę zdrowia. Należy budować mniej autostrad, a te pieniądze inwestować w środki transportu publicznego. I zwiększyć dystrybucję dóbr. Odebrać bogatym, to co mają nadmiar i za te pieniądze walczyć o ratowanie klimatu. A jak odbierze się bogatym, to będą mieli, wredni kapitaliści, mniej pieniędzy do inwestowania. Nie będzie wolnej przedsiębiorczości, to będzie mniej trucicieli. Wspaniałe, prawdą? Odbierajmy przedsiębiorcom, centralizujmy, budujmy przyjazne państwo. Pewna niemiecka socjalistka postulowała, żeby wprowadzić stu procentowy podatek dochodowy dla tych, co zarabiają powyżej czterdziestu tysięcy euro miesięczne. Genialne prawda? Na co komu tyle kasy, pieniądze szczęścia nie dają. Powinny leżeć w banku centralnym i tam być mądrze gospodarzone.\n- Ale czy Ty naprawdę w to wierzysz, że może istnieć taka centralna władza? Że ci ludzie będą przestrzegać zasad, wolności, praw naturalnych i…\n- Praw naturalnych? A co ty, dzikus jesteś? Mamy nowoczesną kartę praw człowieka, demokratycznie przegłosowaną w ONZ. Skoro ją napisali, to będą i jej przestrzegać. Mamy jeszcze traktaty, zgromadzenia publiczne, mamy demokrację, która jest najwspanialszym ustrojem jaki kiedykolwiek wymyślono… mielibyśmy też wspaniałą europejską konstytucję, gdyby naćpani trawą Holendrzy jej nie odrzucili… Na szczęście mamy chociaż Traktat Lizboński, nasz mężny Parlament nie dał się zastraszyć terrorowi irlandzkiemu i wszystko zrobił tak jak było w planie. A Irlandia dostała solidną nauczkę za te fanaberie, poprosiła o drugą szansę i odkupiła swoje grzechy. Wszystko idzie ku wspaniałej przyszłości!\n- Ale nie dostrzegasz tego, że jak zgromadzimy w jednym miejscu całą władzę, wszystkie te pieniądze, media, ludzkie umysły, to może w końcu sięgnąć po to ktoś o brudnych dłoniach? Skąd może mieć pewność, że za tym wszystkim nie stoi jakaś niebezpieczna klika, mafia, gang, ludzie cienie, którzy zakulisowo kierują tym wszystkim? Co, jeśli okażemy się masą niewolników w rękach kilkunastu bogatych i inteligentnych ludzi?\n\nJeśli władza jest do wzięcia, to prędzej czy później ktoś po nią sięga, nic nie stoi na przeszkodzie, aby tak się nie stało i teraz.\n- Ale nic też nie wskazuje na to, że tak ma być. Ja wierzę w dowody, więc proszę, udowodnij mi to. Bez dowodu, twoja wiara nic dla mnie nie znaczy. Ty po prostu wierzysz w to, w co chcesz wierzyć, dostrzegasz to co podsuwa ci twoja wyobraźnia i nie zdajesz sobie sprawy, że to tylko halucynacja, sen, marzenie, a może raczej koszmar. Jak można wierzyć w całą tą piramidę irracjonalnych popłuczyn?\n- Nie wierzę we wszystko…\n- Nie? To po co ci w domu książki na temat UFO, astrologii, sekt i jakich innych, pseudonaukowych „mondrości”?\n- To, że o czymś czytam, nie znaczy jeszcze, że się z tym zgadzam. Staram się po prostu dużo wiedzieć, myśleć, analizować. Szukać prawdy i odrzucać kłamstwo. Pytać, badać, gromadzić, filtrować informację, obrzucać plew i zbierać ziarno. Tak naprawdę nie wierzę w większość rzeczy o których czytam. Ale tym bardziej nie wierzę też w to, co mówią w TV, co piszą w prasie codziennej, podręcznikach akademickich, czego uczą w szkole. Nie wierzę ekspertom, politykom, demagogom, rewolucjonistom, pokojowcom, żadnym postępowcom; ani lewicy, ani prawicy. Próbuję tylko zbierać dane i tworzyć z nich spójny obraz rzeczywistości. Im więcej wiem, tym bardziej klarowny jest ten obraz.\n- Ty to musisz mieć niezły chaos w tej swojej zakręconej łepetynie… To w co ty w takim razie wierzysz?\n\n- Teorie spiskowe dzielę na trzy kategorie, w zależności od stopnia ich realności. Do pierwszej weźmy te najbardziej szalone, dziwaczne, ekstrawaganckie, awangardowe, oryginalne – zwyczajnie trudne do uwierzenia, nawet dla najbardziej otwartego umysłu. To może być teoria płaskiej Ziemi, według której nasza planeta nie jest kulą (geoidą gwoli ścisłości), a my od czasów Ptolemeusza byliśmy oszukiwani; albo teoria pustej Ziemi – glob jest wydrążony, ma dziury wejściowe na biegunach, a wewnątrz życie prowadzi obca rasa, która być może zakulisowo rządzi światem; dalej mamy reptilian Davida Icke, czyli tezę, że władcy największych państw (Bush, królowa Elżbieta, Putin, Merkel itd.) to jaszczury z kosmosu, które przybrały ludzką postać, aby wyniszczyć naszą cywilizację; mamy jeszcze teorię podziemnych baz ufo, projekt Cheops, scjentologiczny mit o Xenu, Hitler żyje, zombie produkowane przez Stalina na Syberii, żywe mumie w Japonii, Żydzi zatopili Titanica, a druga wojna światowa nigdy nie miała miejsca. Gdzieś nawet czytałem o pomyśle, że państwo Stany Zjednoczone w ogóle nie istnieje, zostało wymyślone przez media, aby ludzie wiedzieli, że istnieje mocarstwo trzymające pieczę nad światem. Według zwolenników nieistnienia Jankesów, ludzie, którzy chcą się dostać do Ameryki są usypiani na pokładzie samolotu, a następnie dokonuje się na ich mózgu manipulacji mającej na celu wszczepienie fałszywych wspomnień. Nie doczytałem jak w świetle tej hipotezy tłumaczy się istnieje amerykańskich samochodów, raperów, hamburgerów, korporacji, Myszki Miki czy kryzysu finansowego.\n\nW każdym razie, teorie te mają swój urok, warto się z nimi zapoznać, ale autorów najprawdopodobniej zwyczajnie poniosła fantazja. Lub też uznali, że w ten sposób da się łatwo zarobić, taki Icke wydał już kilkanaście książek, a na jego wykłady ludzie walą drzwiami i oknami, choć przyznam, że retor z niego wyśmienity, a pomijając opowieści o gadzinach, zdarza mu się mówić całkiem ciekawe rzeczy.\n\nAle weźmy teraz drugą kategorię. Do niej wrzucam wszystkie wymysły, które mają coś na rzeczy, ale brakuje przekonujących dowodów, aby w nie uwierzyć. Autorzy z reguły poprzestają na zadaniu ciekawego pytanie (a dlaczego tak? A skąd to się wzięło? A kto za tym stoi? A co, jeśli to nieprawda?), ale nie potrafią znaleźć przekonywującej odpowiedzi. Mają tylko jakieś przesłanki, strzępki dowodów, mdłe relacje świadków, same hipotezy i swój własny umysł, który próbuje za wszelką cenę połączyć skromne dane w jedną, logiczną całość. Tutaj weźmy np. chemtrails, czyli tezę, że jesteśmy zatruwani przez smugi kondensacyjne z samolotów – są filmy, zdjęcia, opinie pilotów, udokumentowane przypadki z historii, zasłyszane dialogi, które mówią, że coś w tym może być. Albo całą konspirację o Nowym Porządku Świata – tu jest bardzo bogata dokumentacja. Dalej można nadmienić spiski syjonistyczne, masońskie, satanistyczne, wszelkie tezy o manipulacji telewizyjnej, o projekcie HARP, atak na Word Trade Center, śmierć Kennedy’ego, masowa kontrola umysłu, różne gierki służb specjalnych, marionetkowi terroryści (vide Al Kaida) czy niejasne przyczyny przystąpienia Ameryki do II wojny światowej… Jest też kwestia antysemityzmu czy prawdy o Holokauście, ale o tym bardzo trudno głośno rozmawiać… Niemal we wszystkim jest trochę prawdy, są jakieś wskazówki, ale mimo to cały czas błądzimy. Jednak warto szukać, badać i pytać. To mnie najbardziej pochłania.\n- No dobra, ale gdzie te dowody?\n- Przecież mówię, ze nie ma dowodów, są tylko sugestie, przesłanki, to jest jak rozwiązywanie łamigłówki.\n- Bez dowodów można to wszystko o kant dupy rozbić, wszyscy wy, „tropiciele spisków”, cierpicie na prześladowczą manię szukania sensacji, chcecie, żeby cokolwiek się działo wokół, chcecie być wyjątkowi - nosiciele prawdy tłamszeni przez system. Macie zbyt dużo wolnego czasu, bo nie prowadzicie normalnego trybu życia, jak każdy porządny obywatel. Ja to wszystkie wrzucą do pierwszej kategorii; zamach WTC dokonany przez Amerykanów na samych sobie to taka samo bzdura jak ci reptilianie. Niby dlaczego miałbym wierzyć w cokolwiek?\n- Większość ludzi…\n- Większość ludzi to debile, a ci co twierdzą, że większość to debile, to najwięksi z nich. Fajny bonmot mi wyszedł?\n- Ciekawy. Widzisz, samodzielne myślenie nie jest wcale takie trudne, wystarczy tylko chcieć.\n- Ty chcesz i ci nie wychodzi. Dlaczego mam wierzyć w cokolwiek, jakikolwiek spisek?\n- Bo historia jest usiana spiskami! Nie chodzi o wiarę, chodzi o drążenie, o kojarzenie faktów. O szukanie prawdy i przyczyny, celu i sensu. Fakt, że nie ma dowodów, nie znaczy, że nie trzeba ich szukać. Nie ma dowodów na istnienie Boga, ale ludzie – tak teiści jak i ateiści – zastanawiają się nad jego istnieniem. Dzięki temu rozwinęła się filozofia, teologia, religia i sztuka. Nie wiemy jak powstał Wszechświat, ale szukamy odpowiedzi. Mamy jakieś niewielkie poszlaki i na ich podstawie próbujemy stworzyć spójną teorię wszystkiego. To samo można robić z każdą inną rzeczą. I powinno się robić. Większość ludzie - wcale nie debili – jak słyszy termin „teoria spiskowa” krzywi się z obrzydzenia i wyśmiania. Bo teoria spiskowa to w ich mniemaniu coś fantastycznego, oderwanego od rzeczywistości. Ale jaka jest przyczyna takiego myślenia? Przecież spiski były, są i będą; cała historia jest pisana spiskiem. Wojny, zdrady, skandale, rewolucje, przewroty – wszędzie u źródła krył się spisek. Rewolucja francuska, spisek prochowy, zamachy na Napoleona, bolszewicy. Na litość, nawet Jezusa zamordowano w wyniku spisku! Tego nikt nie neguje, bo to są fakty historyczne. Ale teraz? Nie, teraz wszystko jest w porządku. Nikt nie szepta, nie ugaduje się, nie spotyka po ciemku. Odkąd ludzie mają telewizję, wydaje im się, że wszystko jest jasne i klarowne. Bzdury!\n\nPozwól, ze zacytuję ci Murraya Rothbarda, wybitnego ekonomistę wolnorynkowego, zignorowanego przez mainstream za swoje wolnościowe, antypaństwowe i logiczne do bólu poglądy oraz szczerzą i ostrą krytykę wobec wszystkiego, co mijało się z prawdą. Rothbard pisze: „Zdarza się, że ktoś podejmuje się krytycznej analizy dotyczącej tego, kim są ludzie u władzy, starając się przy tym przeniknąć ich interesy polityczne i ekonomiczne. Związani z establishmentem liberałowie i konserwatyści (a często i libertarianie) określają te starania\nmianem „spiskowej teorii dziejów”, „paranoi”, „determinizmu ekonomicznego”, a nawet„marksizmu”. Te oszczercze etykietki przykleja się każdemu, kto dokonuje takiej analizy, bez względu na to, w której części spektrum poglądów ekonomicznych się on znajduje.”\n\nI jeszcze dalej, Rothbard: „Nic wiec dziwnego, że realistyczne analizy spisków tworzą „ekstremiści” znajdujący się poza głównym nurtem. Wszakże w żywotnym interesie aparatu państwa leży, aby utrzymać jego społeczną legitymizację czy nawet uświęcenie – a w tym celu politycy i cała biurokracja musza być uważani za swego rodzaju ponadnaturalne siły służące wyłącznie bliżej nieokreślonemu „dobru publicznemu””.\n\nPotrzeba ci jeszcze czegoś? Nawet jeśli 90% teorii spiskowych to bzdury, to czy nie warto wyjść z ignorancji i poświęcić się dla tych pozostałych 10%, poświęcić się dla prawdy?\n- Wiesz, to wcale nie jest takie proste, trzeba…\n- To jest bardzo proste, trzeba zacząć myśleć, być sceptycznym wobec tego co wokół i otworzyć umysł na niektóre sprawy.\n- Ja przecież cały czas jestem bardzo sceptyczny! Wobec tego, co próbujesz mi wmówić.\n- A powinieneś być sceptyczny wobec wszystkiego!\n- Eeeh, Rothbard to szalony anarchista i co gorsza – kapitalista. Wyjątkowo dziwaczne połączenie. Jaka jest trzecia kategoria?\n- Wszystko to, co jest pewne, udowodnione i niemal oczywiste dla każdego, kto o tym słyszał, ale mimo to mało kto o tym wie, albo mało kto w to wierzy. Fakty, które z różnych powodów są wyśmiewane, odrzucane, przemilczane przez media.\n\nNa przykład to, że Amerykanie dodają w niektórych stanach litu do wody, który może niekorzystnie wpływać na ludzki iloraz inteligencji, powodować otępienie i zmniejszać skłonność do buntu; uzasadniają te działania uspokajającym działaniem litu, co ma zmniejszać liczbę samobójstw. Albo problem obowiązkowych szczepień – dowiedzione jest, że niektóre szczepionki zabierają szkodliwe substancja (np. rtęć), a w niektórych rejonach, zwłaszcza w USA, mogły się przyczynić do zwiększonej umieralności czy zachorowalności (autyzm, choroby psychoneurologiczne, opóźnienia rozwojowe, upośledzenia umysłowe, astma, cukrzyca) wśród dzieci. Mimo to, ludzi, którzy domagają się liberalizacji szczepień, bądź sieję wątpliwości wśród rodziców, ma się za nawiedzonych oszołomów, a nawet uważa, za niebezpiecznych dla społeczeństwa - pseudonaukowców, jak wykazywał Richard Dawkins w którymś ze swoich „racjonalistycznych” programów.\n\nMamy jeszcze spisek żarówkowy, walkę z ziołolecznictwem i medycyną naturalną, chorobę wściekłych krów, czy epidemię ptasiej bądź świńskiej grypy, gdzie zostało przemilczane mnóstwo faktów, aby wywołać wśród ludzi panikę i aby ci się bezmyślnie szczepili, co napędzało przemysł farmaceutyczny i pozwalało załatwiać interesy polityczne. Albo właśnie globalne ocieplenie, miliardy euro i dolarów są marnotrawione na walkę z czymś, wobec czego cała masa poważnych naukowców ma istotne wątpliwości. A ile karier politycznych powstało dzięki temu! Albo system INDECT, po cichu wprowadzany, ma za zadanie w inteligentny sposób zbierać i analizować informację na temat wszystkiego co się rusza, całej aktywności na ulicy i w Internecie. Komputer sam będzie kojarzył dane na temat konkretnej osoby i w razie czego informował szybko policję – biorąc pod uwagę rosnącą liczbę kamer oraz obfitość informacji, które pozostawiamy po sobie w sieci, zwłaszcza w serwisach społecznościowych, jest to narzędzie totalnej inwigilacji. Zresztą, ci co mówili o ACTA, SOPA, PIPA, czy innych wynalazkach uderzających w wolność Internetu, też byli kiedyś uważani za w gorącej wodzie kąpanych. Ciekawe, że niektóre „spiskowe” serwisy podawały te informacje już w dwa lata przez masowymi protestami na ulicach. Większość ludzi obudziła się dopiero tydzień przed.\n\nWeźmy do tego jeszcze grupę Bildenberg i Komisję Trójstronną – ich istnienie jest przecież oczywiste. Czy to nie dziwne, że wszyscy najbardziej wpływowi ludzie świata, miliarderzy i władcy, należą do tych samych „klubów” i spotykają się regularnie, za zamkniętymi drzwiami, nie wpuszczając dziennikarzy, nie relacjonując, nie informując opinii publicznej ani jednym słowem. Łamiąc przy tym prawo, gdyż głową państw nie wolno dogadywać się bez obecności świadków, każda taka debata powinna być podana do informacji publicznej. Dlaczego media milczą? Czemu nikt sobie nie zada pytania: co oni tam robią? Piją kawę i gadają o futbolu? Czy tylko „maniacy” od teorii spiskowych mają się tym zajmować? Czy fakt, że kogoś to niepokoi i chce wiedzieć co się za tym kryje, czyni go „paranoikiem” i „mącicielem”? Co w tym złego, że ludzie chcą wiedzieć co robią ci, którzy nimi rządzą? Jakie interesy załatwiają i jakimi motywami się kierują. Przecież to dotyczy nas wszystkich. A do tego jeszcze ta groźba chipów RFID, ostatnio je też zaliczam do trzeciej kategorii.\n- Ci.. czego?\n- Chipów RFID. Miniaturowy nadajnik, wielkości dwóch ziaren ryżu, na którym można zapisać dowolne dane i komunikować się z nim na odległość. Technologia znana i lubiana, używamy tego na co dzień przy znakowaniu produktów, znakowaniu zwierząt, w halach i magazynach, także w dowodach osobistych i paszportach, przynajmniej w niektórych krajach.\n- Więc w czym problem?\n- Że oni chcą nam to wszczepiać pod skórę. Albo raczej doprowadzą do tego, że sami sobie wszczepimy…\n- Znakować ludzi tak, jak teraz znakuje się zwierzęta?\n- Dokładnie tak, słuszna uwaga.\n- Ale powiedziałeś, że te chipy są już w dowodach osobistych i paszportach. W dodatku prawie każdy ma już telefon komórkowy, który praktycznie działa na podobnych zasadach. Komputerek noszony zawsze przy sobie, z którym można się komunikować i w każdej chwili namierzyć. Po co jeszcze wszczepiać pod skórę?\n- Bo w tedy będą mieli już nad każdym całkowitą kontrolę. Będą wiedzieli co, gdzie i kiedy robisz. Żaden ruch nie zostanie niezauważony. W dodatku, taki chip mógłby pełnić rolę karty kredytowej. Wszystkie pieniądze by tam były zapisane, bez niego nie mógłbyś dokonać żadnej transakcji. Z czasem tradycyjny pieniądz może zostać wycofany, zastąpi się go cyfrowych, który będzie tylko w tych chipach i w komputerze centralnym. Komputer będzie wszystko zapisywać, sprawdzał i ratyfikował. Więc nawet jeśli posiadanie chipa nie będzie obowiązkowe, to w praktyce i tak każdy będzie musiał go mieć, bo inaczej nie będzie mógł normalnie funkcjonować w społeczeństwie, tak jak teraz bez dowody osobistego czy telefony, a wtedy…\n- A wtedy zniknie czarny rynek! Nie będzie nielegalnych transakcji, nie będzie mafii, prostytucji, narkotyków, handlu bronią, alkoholem, papierosami, nie będzie finansowych przekrętów ani korupcja. Wszystko będzie pod kontrolą! A skoro mówisz, że te chipy mogą śledzić każdy nasz ruch, to każdy przestępca zostanie natychmiast złapany! Zapanuje pokój, ład i porządek, podoba mi się to! Czemu miałbym nie nosić czegoś takiego w swojej ręce, skoro nie planuję robić żadnych przekrętów? To by mnie identyfikowało, czułbym się bezpieczny, niech bandziory się boją. A Ty, czemu się to nie podoba? Może sam kombinujesz coś na boku i boisz się, że zostanie to wykryte, co?\n- Bo widzisz, sęk w tym, że ja jestem człowiekiem, a dla mojego człowieczeństwa…\n- Niezbędna jest wygoda! Powiedziałeś, że będą tam zapisane wszystkie pieniądze, taka podręczna czy raczej podskórna karta kredytowa. Nie będę musiał nosić ze sobą opasłego portfela, plastikowych dokumentów, różnych aktówek, bo wszystko będzie w tym ziarenku ryżu. I nie będę się musiał martwić, że zostanę okradziony. Kiedy oni to wprowadzają? Co jeszcze potrafi to cudeńko?\n- Może przechowywać dane na temat choroby, niezbędne dla służb ratowniczych. Może poinformować policję w razie niebezpieczeństwa i ułatwić namierzenie, tak samo karetkę, może monitorować stan organizmu, informować służby porządkowe na lotniskach…\n- I Ty tego nie chcesz??!! Toż to genialny wynalazek. Jak tylko to wejdzie w obieg, ludzie rzucą się, żeby to zdobyć. Będą prosić i płacić, żeby dostać takiego wygodnego chipa.\n- Wiem.\n- A takie średniowiecze jak ty może sobie stać z boku i się przyglądać. Świat należy do nowoczesnych technologii. Młodzież to zrozumie.\n- To też wiem. Według brytyjskich badań, w tej chwili co dwudziesty dorosły i co dziesiąty nastolatek chce mieć chipa pod skórą. Skąd taka dwukrotna przepaść? To idzie wykładniczo, w następnym pokoleniu będzie co piąty, potem co drugi, a potem już tylko niedobitki będą się wzbraniać przed „zachipowaniem”.\n- Takie jak ty. Tylko po co? Czy tak nie będzie lepiej? Trzeba iść z duchem czasu. Z roku na rok ludzie stają się coraz doskonalszymi istotami. Więcej wiedzą, mają większą władzę na światem, dłużej żyją. Czemu nie udoskonalić swojego ciała, nie ułatwić sobie życia, skoro to tylko możliwe? Dzięki temu wynalazkowi możemy się stać kolektywem wyższych istot, inteligentnych, połączonych ze sobą, w pełnej interakcji z systemem. Ludzie i nowoczesna technologia razem. Jedność wszystkich ze wszystkim. Taka idea nazywa się transhumanizmem. Pomyśl, ile moglibyśmy razem osiągnąć z tymi chipami i innymi „częściami uzupełniającymi” w naszych ciałach i naszych mózgach.\n- A czy taki człowiek dalej będzie człowiekiem? Gdzie jest granica naszego człowieczeństwa? Co, jeśli stracimy panowanie nad naszymi własnymi ciałami, a przejmą je maszyny, bądź ludzie którzy nimi kierują?\n- A czy teraz masz kontrolę nad swoim własnym ciałem? Kontrolujesz swoje popędy, emocje i namiętności? Jesteś wstanie opanować głód, pragnienie, pociąg seksualny, potrzebę mrugania oczami? Jesteś niewolnikiem swojego ciała, mój drogi. Co za różnica, czy kontrolę nad tym i całą resztą będzie sprawował mózg, czy komputer? Karol Darwin już dawno udowodnił, że ludzie niczym nie różnią się od zwierząt. Więc równie dobrze mogą niczym nie różnić się od maszyn. Dlaczego nie przyspieszyć trochę ewolucji? My to rozumiemy i zrobimy to. Podczas gdy ty będziesz się miotał niczym zwierzę w klatce, kolejne pokolenie przeskoczy tę barierę. Ty tego nie rozumiesz, oni to zrozumieją.\n- Bo nimi manipulujecie.\n- Manipulujemy? Jak?\n- Szkoła! Telewizja, gazety młodzieżowe, banalne rozrywki, relatywizm moralny. Niszczycie rodzinę i wyśmiewacie tradycyjne wartości. Odbieracie dzieci z domu już od najmniejszego, nie pozwalacie rodzicom o niczym decydować. Większość czasu muszą przesiadywać w waszej szkole, a pozostałą część wśród mediów, którymi wy kierujecie. Sami ustanawiacie jeden słuszny program nauczania, dom rodzinny ma pełnić tylko rolę taniego hotelu, a matka i ojciec to niańki, które się muszą zatroszczyć o jedzenie, picie, sranie i ubranie. I niech nie przekazują żadnych rad, wartości, nakazów ani zakazów – oni się nie znają, najlepiej niech się w ogóle nie odzywają. To wy jesteście specjalistami, wy prezentujecie swoją wizję państwa, władzy, seksu, historii, nauki i obyczajowości. Wy decydujecie o tym, co jest dobre a co złe i czego wolno, a czego nie. O czym myśleć i czego się wystrzegać. Macie pod sobą cały rząd dusz i władzę nad nim. Lepicie ich umysły hurtowo, niczym odlewy gipsowe. Niszczycie rodzinę!\n- Niszczymy rodzinę…\n- Matki i ojca przez cały dzień nie ma w domu, bo w stworzonym przez was systemie oboje muszą pracować przez cały etat. Kobiety czują się „wyzwolone” i często są zmuszane odstawić rodzinę na dalszy plan, bo boją się, że zniszczy im ona kariery. Jak już ją zakładają to w późnym wieku i decydują się na tylko jedno dziecko. To idealnie pokrywa się z waszą wymarzoną depopulacją i walką z przeludnieniem. Jedno pokolenie – równa się – dwa razy mniej ludzi, dwa razy mniej problemów. A równouprawnienie kobiet… Idea może i szlachetna, ale kto ją nakręcał? Możni tego świata, znienawidzeni przez was kapitaliści. Fundacja Rockefellera sfinansowała Front Wyzwolenia Kobiet. Oni wyłożyli na to olbrzymie pieniądze, rozpropagowali w mediach. Bez tego cała akcja posuwałaby się w żółwim tempie. W wiesz w jaki sposób Nick Rockefeller tłumaczyć sens swojego działania? Równość płci? Łatwiejszy dostęp kobiet do pracy, do edukacji, do wiedzy? Walka z dyskryminacją? Nic z tych rzeczy, to były dla niego głupstwa, tych, którzy wierzyli w te idee fixe uważał za idiotów. Istotne powody były dwa: opodatkowanie połowy populacji oraz – co najistotniejsze – oderwania dzieci od zapracowanych matek. Im wcześniej dziecko musiało iść do przedszkola tym lepiej, bo było więcej czasu na indoktrynację.\n\nA teraz? Kobiety mają już dokładnie te same prawa, w niczym nie są dyskryminowane, a mimo to, z dnia na dzień jest coraz więcej, coraz to bardziej szalonych, „nienawidzących białych heteroseksualnych mężczyzn” feministek, które ciągle o coś walczą. O co i po jaką cholerę? I kto za to wszystko płaci? Dlaczego tak bardzo zależy im na dostępie do aborcji i antykoncepcji? Czy chodzi tylko o ideę „wolnego wyboru”? Zapewne jest to tylko piękna walka o wolność, a wielkie korporacje robiące na tym biznes nie mają z tym w ogóle nic wspólnego.\n\nAlbo weźmy tabuny homoseksualistów. Normalni, zwykli geje czy lesbijki, robią to co robią po swojemu, w niczym nikomu nie wadząc. Mogą wspólnie żyć i uprawiać swoje „rozrywki”. W wielu krajach już nawet mają takie same prawa jak cała reszta, ze ślubem i adopcją dzieci włącznie. Dlaczego więc wszędzie panuje taka moda na homoseksualizm, lansowanie zachowania, które nie przynosi społeczeństwu żadnego pożytku i jest - z punktu widzenia problematyki przetrwania gatunku – totalnie bezproduktywne? Rodzina wielodzietna to dziś obiekt wzgardy, wyśmiania i „ciemnogrodu”, za to wzorem nowoczesności jest model „dwóch dorosłych mężczyzn i zero dziecka”. Dzieciom się wmawia, że to normalne i pożądane, rodzicom każe się to akceptować, media epatują tym dookoła stawiając geja za wzór męskości, a masa pedryli lata z gołymi zadkami po ulicach i…\n- Ej, ej, ej, ej, ej, przystopuj trochę! Jesteś strasznie nietolerancyjny!\n- A cóż to jest tolerancja? Słowo pochodzi z łacińskiego słowa „tolerantia” i oznacza „wytrwałość”, „cierpliwość”. Nie oznacza „akceptacji”, „aprobaty”, „sympatii”, „lubienia”, „uwielbienia”, „powstrzymywania się od krytyki”. Tylko w ostatnich latach ten termin został tak dziwnie przemianowany; w słownikowej definicji oznacza on „postawa zgody na wyznawanie i głoszenie poglądów, z którymi się nie zgadzamy, oraz na praktykowanie sposobu życia, którego zdecydowanie nie aprobujemy”, więc w tym sensie każdy taki „homofob” jak ja jest bardzo tolerancyjny. Ale dziś wymaga się nie tylko zgadzania się, ale też chwalenia, kadzenia, uczenia się o tym, przyjmowania określonych poglądów, powstrzymywania odruchu obrzydzenia, uważania tego za „piękne” bądź „romantyczne”. Nie mogą wprost powiedzieć co mam na myśli, ani tym bardziej nie mogę uczyć tego moich dzieci, to jest grzech niewybaczalny, bo one muszę wpierw dostać prawidłowa dawkę wiedzy w szkołach, na wychowaniu do życia w rodzinie, albo na jakiś innych „tolerancyjnych” warsztatach bądź happeningach. Muszę przejść odpowiednie pranie mózgu, aby „ciemny tata rasista” przypadkiem nie namieszał im w głowie i nie zaraził wirusem swoich chorych poglądów.\n\nI znowu pytanie: kto ma w tym interes i komu na tym zależy? Na przykład Unia Europejska to bardzo dziwna instytucja. Wiesz, że lobby homoseksualne (Międzynarodowe Stowarzyszenie Pederastów, Lesbijek, Biseksualistów i Transseksualistów ILGA) jest w 70 procentach finansowane przez Unię Europejską? Właśnie, z naszych pieniędzy, z podatków wszystkich państw członkowskich. Łamią tym samym prawo, bo ILGA jako organizacja pozarządowa może być finansowana tylko z darowizn lub składek członkowskich. Ale Komisja Europejska się tym nie przejmuje tylko robi swoje. Za to każdy głos krytyki jest traktowany jako przejaw homofobii. Ale teraz spytajmy, jaki to ma wszystko sens? Kogo lobbuje ILGA, jeśli nie polityków europejskich? Wynika z tego, że Unia Europejska lobbuje samą siebie! Pytanie: po co?\n\nAle przyjrzyjmy się, kto rządzi Unią Europejską. Komisji Europejskiej przewodzi uwielbiany przez ciebie Jose Barroso - tak, był on w młodości komunistą, a ściślej maoistą - wyznawcą tyrana i mordercy. Człowiek, który posiadł władzę, choć lud europy nie miał na to żadnego wpływu i dalej nie ma; Parlament Europejski to chyba najbardziej antydemokratyczna instytucja rządowa na tym kontynencie. Na przykład ich „prezydent”, przewodniczący Parlamentu Europejskiego Henry van Rompey. Kim on jest? Pojawił się z nikąd, nieznany wcześniej premier Belgii, nikt go nie wybierał i nie można go też w żaden sposób odwołać. A ma w swoich rękach całą Europę, 500 mln ludzi. I dziwnym trafem jest członkiem grupy Bilderberg.\nDziwnym też trafem, liderem grupy Bilderberg, podobnie jak Komisji Trójstronnej, jest premier Włoch Mario Monti. Premier, który został narzucony Włochom po tym, jak do dymisji podał się Silvio Berlusconi. Pierwszy premier, który nie został wybrany w demokratycznych wyborach, i jest nim oczywiście lider tajemniczych, zakulisowych klubów, które teraz mogą „legalnie” rządzić jedną z najpotężniejszych gospodarek na świecie. Przypadek?\n\nZresztą, nie potrzeba włoskiego „zamachu stanu”. W spotkaniach Bilderberga brali regularnie udział: kanclerz Niemiec - Angela Merkel, premier Hiszpanii - Zapatero, premier Wielkiej Brytanii – Tony Blair, królowa Holandii, włoski polityk, kilkukrotny premier - Romano Prodi, cała śmietanka, wszystkie najpotężniejsze państwa Europy. Współczesny prezydent Francji, prawie komunista Hollande, był rzecznikiem prasowym dawnego prezydenta Francji Lionela Jospina, regularnego „bilderbergowca”.\n\nAle przejdźmy to USA, tam to się dopiero dzieje. Clinton, Kissinger, Brzezinski - najważniejsze figury Bilderberg i Komisji Trójstronnej. Chyba każdy prezydent Stanów Zjednoczonych należał do jakiegoś tajnego stowarzyszenie, może tylko Kennedy nie. W 1961 roku powiedział: „Działa przeciwko nam, na całym świecie, monolityczny i bezlitosny spisek, który opiera się głównie na niejawnych metodach poszerzania swej strefy wpływów; na bojówkach operujących pod osłoną nocy, a nie armiach operujących w świetle dnia. Jest to system, który zaciągnął w swe szeregi ogromne zasoby ludzkie i materialne, tworząc ściśle splecioną, niezwykle wydajną maszynę, która łączy w sobie działalność wojskową, dyplomatyczną, wywiadowczą, gospodarczą, naukową i polityczną. Działania tego spisku są tajne, nigdy nie upubliczniane. Jego pomyłki są głęboko grzebane i nigdy nie przeczytacie o nich w gazetach, dysydenci zaś są skutecznie wyciszani; rachunki są tajne, żadne plotki nie wyciekają do prasy, żaden sekret nie jest ujawniany”.\n\nDwa lata później dostał kulkę w łeb. A tydzień przed swoją śmiercią wydał rozkaz wykonawczy 11110, w którym emisja pieniędzy odbywałaby się przez skarb państwa, z pominięciem FEDu. Co więcej, każdy wydrukowany banknot musiał mieć pokrycie w srebrze, co odbierało Rezerwie Federalnej rzecz najważniejszą w całym przekręcie, kreowanie pieniądza z czystego powietrza! Wejście tego w życie odebrałoby całą władzę bankierom, wrócilibyśmy do starego dobrego parytety kruszcu sprzed 1913, kiedy to każdy był właścicielem swoich własnych, mających pokrycie pieniędzy i nikt nie mógł go oszukać niekontrolowanymi dodrukami czy lewymi pożyczkami. Nic z tego oczywiście nie wyszło; dekret 11110 zwyczajnie przepadł, został zignorowany, kiedy jego pomysłodawca wąchał kwiatki od spodu.\n\nPóźniej już nikt do tego nie wracał, a każdy kolejny prezydent był coraz bardziej „podejrzany”. W walce o prezydencki stołek, w 2004 roku starli się George Bush i John Kerry. Dziwnym trafem, obydwaj byli kuplami ze studiów, a konkretniej: należeli to tego samego tajnego stowarzyszenia studenckiego „Czaszki i Piszczele”. W czasie kampanii prezydenckiej jakoś żaden z nich nie rozwodził się specjalne na ten temat, a wszelkie pytania kwitowali niewinnymi uśmiechami. Dziwne to bywają koleje losy, świat jest mały!\n\nZa to pan Obama vel „pan zmiana” vel „triumf Ameryki nad rasizmem” ma niemały problem. Pomijając fakt, że nie spełnił prawie żadnej ze swoich obietnic, z Guantanamo i wycofaniem wojsk z Iraku i Afganistanu na czele, że dostał nagrodę Nobla za ładny uśmiech i dobre chęci (to nic, że nie wyszło, zdarza się), to nawet nie wiadomo, czy jest on w ogóle Amerykaninem (z urodzenia). Najpierw nie mógł znaleźć swojego aktu urodzenia, a kiedy już go zdobył i opublikował (w pliku PDF), pojawiły się poważne zastrzeżenia co do jego autentyczności. Według śledczych z Arizony, cały plik został zmontowany na poczekaniu, jest fałszywką. Według śledczego Mike Zullo „kody numeryczne na fragmentach aktu urodzenia wskazują na to, że części te nie zostały wypełnione. Pytanie zatem skąd wzięły się tam informacje o rasie i zawodzie ojca Obamy?”, dziennikarz Aleksander Jones dodaje, że „czcionki czy tła użyte w niektórych fragmentach opublikowanego dokumentu są nieodpowiednie i nie pasują one do reszty aktu. Oznacza to, że ludzie w Białym Domu wycinali i odpowiednio wklejali fragmenty certyfikatu”.\n\nDo tego ojciec Obamy został określony mianem „African” (\"Afrykanin”), choć w tamtych czasach wpisywano „Negro” („Murzyn”), a w rubryce „miejsce urodzenia ojca” pisze „Kenya”, chociaż w tamtych czasach Kenia nie miała jeszcze niepodległości, powinno być : „Kenya Colony” jak brytyjska kolonia.\n\nJest to bardzo istotne, gdyż fakt, że Obama nie urodził się w USA, ale gdzieś indziej, prawdopodobnie w Kenii, oznacza, że nie może on być prezydentem Stanów Zjednoczonych. Być może gdzieś ktoś trzyma oryginalny akt urodzenia prezydenta i tylko czeka, żeby wyciągnąć go na światło dzienne, gdyby przypadkiem marionetka w Białym Domu nie chciała być posłuszna… Nie zanudzam cię?\n- Co? Nie, nie, bardzo ciekawe rzeczy mówisz.\n- Ale to jeszcze nie wszystko, jest coś o wiele istotniejszego, być może najważniejszego; wiesz, że…\n- Wiesz co, miło się rozmawiało, ale muszą już iść…\n- Musisz iść? Dlaczego?\n- Idę patrzeć na seks w wielkim mieście…\n- Na co?!\n- „Seks w wielkim mieście”; jest taki serial, nie mogę przegapić kolejnego odcinka, a właśnie się zaczął, pięć minut temu. No to lecę, może kiedyś dokończymy, pa! Aha, gdybyś przypadkiem miał namiary na jakiegoś sprzedawcę chipów RFID, to daj mi znać!\nAutor: Wojciech Mazurkiewicz Źródło: libertarianin.org\nwww.newworldorder.com.pl",
			"added": 1612045365
		},
		{
			"topic_id": 1612049550,
			"title": "1.1.1.1 – warto zmienić swój DNS?",
			"body": "Temat zkopiowany z https://www.dobreprogramy.pl/WalkingNet/1.1.1.1-warto-zmienic-swoj-DNS,87530.html\n\nCo o tym myślicie?\n\n\n\n\n\n1.1.1.1 – warto zmienić swój DNS?\n\nOstatnio głośno się zrobiło o wyciągnięciu przez Cloudflare z niebytu adresu IP składającego się z czterech jedynek i udostępnieniu go jako serwer DNS. Zostaliśmy przy tym zapewnieni, że korzystając z niego, będziemy bezpieczniejsi, ponieważ wszelkie logi, z których można byłoby odczytać historię naszego surfowania usuwane są automatycznie z serwera po 24 godzinach. A więc z punktu widzenia bezpieczeństwa – warto zmienić, czy nie?\n\nWszyscy wiemy, że bez Systemu Nazw Domenowych żyłoby się nam o wiele trudniej. Z grubsza rzecz ujmując, każda strona w naszej przeglądarce pochodzi z innego adresu IP i mówiąc w dużym uproszczeniu - gdyby nie serwery DNS, w pasek adresu musielibyśmy wpisywać ciągi liczb, żeby zobaczyć jakąkolwiek witrynę.\n\nProducenci współczesnych systemów operacyjnych robią ostatnio wiele, abyśmy o kwestii DNS zapomnieli niemal całkowicie. W większości są one domyślnie ustawione na punkt dostępu do Internetu – bezpośrednio u ISP lub pośrednio – w naszym routerze. To oczywiście ułatwia życie, bo możemy łączyć się z globalną siecią niemal natychmiast po włączeniu urządzenia.\nSkoro działa, to po co ruszać?\n\nW związku z uruchomieniem nowych serwerów pod adresami 1.1.1.1 oraz 1.0.0.1 znów powróciła dyskusja, w której ściera się kilka frakcji – z jednej strony zwolenników globalnych i lokalnych dostawców, z drugiej – osób chcących chronić swoją prywatność z tymi, którzy z tego zrezygnowali. Na bardziej profesjonalnych forach przewija się dodatkowo jeszcze jeden wątek, gdzie indziej raczej pomijany, a który powinien być najistotniejszy – kwestia bezpieczeństwa sieci użytkownika.\n\nKoronnym argumentem zwolenników używania adresów DNS dostawcy Internetu jest ich fizyczna bliskość. Stronnicy globalnych serwerów podnoszą kwestie szybkich łączy i mnogość maszyn, dzięki którym ma się stabilny dostęp do sieci niezależnie od lokalizacji. Z kolei obawiający się o swoją prywatność zarzucają największym operatorom zbieranie logów i wykorzystywanie ich do swoich nie zawsze jasnych celów.\nPrywatność ponad wszystko?\n\nJak już wspomniałem, kwestia prywatności to nie to samo co bezpieczeństwo. To, że właściciel serwera DNS może posiadać wiedzę o stronach, które odwiedzamy, nie znaczy że musi tę wiedzę wykorzystywać przeciw nam. Trzeba mieć jednak świadomość, że każdy tego typu dostawca może być zobowiązany do udostępnienia informacji uprawnionym organom, które mogą po tę wiedzę się zgłosić. Oczywiście mając pewność, że wszelkie nasze działania są legalne, możemy przyjąć, że będziemy spać spokojnie. Jednak czy jesteśmy pewni, że w ostatniej wersji regulaminu, na który się zgodziliśmy, nie zawarto zapisu, który może uprawniać ISP do sprzedaży tych danych? Oprócz tego jest jeszcze kwestia podatności na wyciek informacji nas identyfikujących...\nA gdzie tu niebezpieczeństwo?\n\nCzy taki serwer DNS, którego właściwie na co dzień nikt nie zauważa może nam w ogóle zaszkodzić? No cóż, wyobraźmy sobie sytuację, że do naszego komputera dostało się złośliwe oprogramowanie, którego celem jest podmiana adresu serwera DNS. Wyobraźnia podpowiada w tym momencie już co najmniej kilka scenariuszy. Użytkownik może zostać przekierowany na specjalnie spreparowaną stronę, przez którą komputer zostanie zainfekowany kolejnym oprogramowaniem, które może posłużyć np. do szantażowania go. Inna możliwość, to przekierowywanie użytkownika w przypadku niektórych witryn na strony wyglądające identycznie jak te, które odwiedza na co dzień i wyłudzenie w ten sposób jego loginów i haseł.\nZatem jaki mamy wybór?\n\nWiemy już, że ustawiając adres DNS na automatyczne pobieranie, jesteśmy zdani na swojego operatora, który tym samym zyskuje o nas jako o kliencie całkiem sporo danych. Pomijając kwestie prywatności, trzeba zadać sobie jeszcze jedno ważne pytanie: Czy lokalny ISP zapewni nam wystarczający poziom bezpieczeństwa i ochroni nas przed potencjalnymi atakami z całego świata? Intuicja i doświadczenie podpowiadają, że znacznie większym zaufaniem można obdarzyć serwer należący do firmy globalnej, która jednak gwarantuje nam najwyższy poziom bezpieczeństwa (nawet jeśli częściowo odbędzie się to kosztem naszej prywatności).\n\nDotychczas najbardziej chyba znanymi dostawcami DNS na świecie były takie firmy jak Cisco z serwerami OpenDNS (208.67.222.222 i 208.67.220.220), Google (adresy: 8.8.8.8 i 8.8.4.4), czy też Global Cyber Alliance (9.9.9.9) . Cloudflare, który do nich dołączył z adresami 1.1.1.1 oraz 1.0.0.1 udostępniając jednocześnie przepływowość własnej sieci zapewnia, że jego usługę wyróżnia prawdziwa anonimowość, którą gwarantuje regularne, kasowanie logów co dobę.\nA co z wydajnością?\n\nOczywiście jeżeli wcześniej już wybrałeś adres swojego serwera DNS, to z pewnością wiedziałeś co robisz i w tym przypadku pozostaje Ci jedynie rozważenie dodatkowej opcji w palecie wyboru. Trzeba jednak przyznać, że od momentu wprowadzenia usługi 1.1.1.1 na rynek, czyli nieco ponad 2 tygodni, serwery Cloudflare wciąż są najszybsze, co można sprawdzić TUTAJ. Jeżeli przy tym, w przeciwieństwie do google’owych ósemek zapewniają nam one prywatność (na szali postawiono reputację niemałej firmy) i najwyższy poziom bezpieczeństwa, to odpowiadając na postawione w tytule pytanie, można śmiało stwierdzić, że ze względów bezpieczeństwa, prywatności oraz dostępności usługi ZDECYDOWANIE WARTO zmienić serwer DNS na 1.1.1.1.",
			"added": 1612049548
		},
		{
			"topic_id": 1612186153,
			"title": "Poradnik jak zrobić połączenie VPN => VPN => VPN => ...",
			"body": "Witajcie, dzisiaj wyjaśnie wam jak zrobić tak zwany VPN chain.\n\nJak wiecie można mieć 1 VPN na 1 karte sieciową ale czy aby napewno? Czy istnieje możliwość aby połączyć VPNy innych firm ze sobą aby VPNy się łączyły między sobą, zapewniając zwiększoną anonimowość? TAK JEST TO MOŻLIWE ale nie bezpośrednio, aby tego dokonać polecam ten program na windows: https://www.virtualbox.org/   A na linuxa polecam postawić system Qubes OS: https://www.qubes-os.org/ który sam w sobie jest zrobiony z VM (wirtualnych maszyn).\n\nZanim zaczniemy odpowiem na jedno pytanie.\n\nJaki jest tego sens skoro wystarczy że władze zgłoszą się do ostatniego VPN z naszego VPN chain?\n\nODP: Jeśli zrobicie darmowe konta na bylejakich VPN przez tora nie podając prawdziwych danych, władze będą musiały iść do następnego na którym też nic się nie dowiedzą, poza adresem IP wcześniejszego VPNa. Więc skoro nie podajecie prawdziwych danych, zakładacie konto tylko na darmowych VPN aby nie mieli waszych danych z płatności, robicie to przez tora, podajecie czasowego maila np z tej strony: https://temp-mail.org/pl/ Utrudniacie im cały proces bo będą musieli starać się o ujawnienie danych osobowych od każdego VPNa po kolei aby do was dojść.\n\nWięc zaczynamy:\n\n1) Robicie wirtualne maszyny  instalujecie 1 VPN każdą wirtualną maszyne. Chyba że macie windowsa,... to musicie robić VM w VM w VM, ... to będzie lagować więc jeśli chcecie zrobić mega VPN chain to lepiej Qubes OS zainstalować. \n2) Łączycie je aby jedna brała internet od drugiej.\n3) Odpalacie wyszstkie VPNy i gotowe.\n\nBONUS: \nBywa tak że VPNy mają przeciek DNS więc polecam sprawdzić na stronie https://www.dnsleaktest.com/ aby się nie okazało że wasz VPN chain was nie chroni.\nDo tego polecam zmienić na każdej VM DNS na cloudflare  aby załatać ten przeciek oto ten cały magiczny DNS: \nIP version 4\n1.1.1.1\n1.0.0.1\nIP version 6     <---------------------- Tak najlepiej wbić obydwa a nie tylko IPv4 jak większość.\n   2606:4700:4700::1111\n   2606:4700:4700::1001\nClaudflare zapewnia że nie zapisuje waszej aktywności. Oczywiście to jest kłamstwo, jednak wasza aktywność jest u nich kasowana po 24 godzinach. Największą ich zaletą jest szyfrowanie co zmniejsza kontrolowanie waszego ISP (czyli waszego dostawcy inter..).\nKtoś się pytał jakie pluginy są dobre do przeglądarki więc oto ich lista i wyjaśnienie:\n\n1) WebRTC cześć przeglądarek ma wyciek że łączą się z innymi przeglądarkami przez co może wycieknąć wasze prawdziwe IP.\n\n2)uBlock Origin nie dość że działa jak sławny adBlock to ma też w sobie WebRTC.\n\n3) HTTPS Everywhere aby wasze połączenia z każdą stroną były szyfrowane.\n\n4) NoScript Bywa tak że strony mają Java skrypt (najgorsze świństwo) a on potrafi wyciągnąć wasze IP mimo VPNa WAŻNE INFO NIE WŁ GO JEŚLI CHCESZ WIDZIEĆ STRONY NA ZERONECIE niestety zeronet jest nafaszerowany jawą :( \n\n5) To nie jest dodatek ale warto wiedzieć, gdy bawicie się w personalizacje waszej przeglądarki tracicie część anonimowości. Zatem jak sprawdzić czy jesteś anonimowy/wa?\n Link: https://amiunique.org/\n\n\nJeśli macie jakieś pytania lub problemy z wykonaniem całego procesu pisać śmiało.\n\nPozdrawiam, akranu.",
			"added": 1612186150
		}
	],
	"topic_vote": {
		"1609801670_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"1612045366_1HxF6zesCAqUtGzUYJ8WpE1TnLFsnQZw8s": 1,
		"1612186153_1HxF6zesCAqUtGzUYJ8WpE1TnLFsnQZw8s": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1609801670_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 1,
				"body": "Mistrzu, czy są jakieś metody aby obejść zabezpieczenia UEFI w nowych płytach? I czy da się coś zrobić z tymi procesorami?",
				"added": 1612047267
			}
		],
		"1610225804_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 2,
				"body": "driud mam do Ciebie pytanie co sądzisz o tych OS : QubesOS, Tails i Whonix? Czy są bezpieczne? Czy są szpiegowane? A i tak btw ja mam najnowsza wersje ZeroNeta, czy powinienem gdzieś ściągnąć starszą wersje?",
				"added": 1612048714
			}
		]
	},
	"comment_vote": {
		"199_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"198_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"207_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1
	}
}