{
    "article": [
        {
            "title": "Authentication",
            "text": "{{For|other uses of the terms \"authentic\" and \"authenticity\"|Authenticity (disambiguation){{!}}Authenticity}}\n{{distinguish|authorization}}[[File:ATMUser.140209.jpg|thumb|ATM user authenticating himself]]\n'''Authentication''' (from {{Lang-el|αὐθεντικός}} ''authentikos'', \"real, genuine\", from αὐθέντης ''authentes'', \"author\") is the act of [[proof (truth)|proving]] an [[Logical assertion|assertion]], such as the [[Digital identity|identity]] of a computer system user. In contrast with [[identity (philosophy)|identification]], the act of indicating  a person or thing's identity, authentication is the process of verifying that identity. It might involve validating personal [[identity document]]s, verifying the authenticity of a [[website]] with a [[public key certificate|digital certificate]],<ref name=\"Turner-DigitalAuthentication-Basics\">{{cite web|last1=Turner|first1=Dawn M.|title=Digital Authentication: The Basics|url=http://www.cryptomathic.com/news-events/blog/digital-authentication-the-basics|publisher=Cryptomathic|accessdate=9 August 2016|deadurl=no|archiveurl=https://web.archive.org/web/20160814214552/http://www.cryptomathic.com/news-events/blog/digital-authentication-the-basics|archivedate=14 August 2016|df=}}</ref> determining the age of an artifact by [[carbon dating]], or ensuring that a product or document is not [[counterfeit]].\n\n==Methods==\n{{Main article|Provenance}}\n\nAuthentication is relevant to multiple fields. In [[art]], [[antique]]s and [[anthropology]], a common problem is verifying that a given artifact was produced by a certain person or in a certain place or period of history.  In [[computer science]], verifying a user's identity is often required to allow access to confidential data or systems.<ref name=\":0\" />\n\nAuthentication can be considered to be of three types:\n\nThe '''first type''' of authentication is accepting proof of identity given by a credible person who has first-hand evidence that the identity is genuine.  When authentication is required of art or physical objects, this proof could be a friend, family member or colleague attesting to the item's provenance, perhaps by having witnessed the item in its creator's possession.  With autographed sports memorabilia, this could involve someone attesting that they witnessed the object being signed.  A vendor selling branded items implies authenticity, while he or she may not have evidence that every step in the supply chain was authenticated. Centralized authority-based trust relationships back most secure internet communication through known public certificate authorities; decentralized peer-based trust, also known as a [[web of trust]], is used for personal services such as email or files ([[pretty good privacy]], [[GNU Privacy Guard]]) and trust is established by known individuals signing each other's [[key (cryptography)|cryptographic key]] at [[Key signing parties]], for instance.\n\nThe '''second type''' of authentication is comparing the attributes of the object itself to what is known about objects of that origin.  For example, an art expert might look for similarities in the style of painting, check the location and form of a signature, or compare the object to an old photograph.  An [[archaeologist]], on the other hand, might use [[carbon dating]] to verify the age of an artifact, do a chemical and spectroscopic analysis of the materials used, or compare the style of construction or decoration to other artifacts of similar origin.  The physics of sound and light, and comparison with a known physical environment, can be used to examine the authenticity of audio recordings, photographs, or videos.  Documents can be verified as being created on ink or paper readily available at the time of the item's implied creation.\n\nAttribute comparison may be vulnerable to forgery.  In general, it relies on the facts that creating a forgery indistinguishable from a genuine artifact requires expert knowledge, that mistakes are easily made, and that the amount of effort required to do so is considerably greater than the amount of profit that can be gained from the forgery.\n\nIn art and antiques, certificates are of great importance for authenticating an object of interest and value. Certificates can, however, also be forged, and the authentication of these poses a problem. For instance, the son of [[Han van Meegeren]], the well-known art-forger, forged the work of his father and provided a certificate for its provenance as well; see the article [[Jacques van Meegeren]].\n\nCriminal and civil penalties for [[fraud]], [[forgery]], and [[counterfeit]]ing can reduce the incentive for falsification, depending on the risk of getting caught.\n\n[[Currency]] and other financial instruments commonly use this second type of authentication method.  Bills, coins, and [[cheque]]s incorporate hard-to-duplicate physical features, such as fine printing or engraving, distinctive feel, watermarks, and [[holographic]] imagery, which are easy for trained receivers to verify.\n\nThe '''third type''' of authentication relies on documentation or other external affirmations.  In criminal courts, the [[rules of evidence]] often require establishing the [[chain of custody]] of evidence presented.  This can be accomplished through a written evidence log, or by testimony from the police detectives and forensics staff that handled it.  Some antiques are accompanied by certificates attesting to their authenticity.  Signed sports memorabilia is usually accompanied by a certificate of authenticity.  These external records have their own problems of forgery and [[perjury]], and are also vulnerable to being separated from the artifact and lost.\n\nIn computer science, a user can be given [[Access control#Computer|'''''access''''' to secure systems]] based on user credentials that imply authenticity.  A network administrator can give a user a password, or provide the user with a key card or other access device to allow system access.  In this case, authenticity is implied but not guaranteed.\n\n[[Consumer goods]] such as pharmaceuticals, perfume, fashion clothing can use all three forms of authentication to prevent counterfeit goods from taking advantage of a popular brand's reputation (damaging the brand owner's sales and reputation).  As mentioned above, having an item for sale in a reputable store implicitly attests to it being genuine, the first type of authentication.  The second type of authentication might involve comparing the quality and craftsmanship of an item, such as an expensive handbag, to genuine articles.  The third type of authentication could be the presence of a [[trademark]] on the item, which is a legally protected marking, or any other identifying feature which aids consumers in the identification of genuine brand-name goods.  With software, companies have taken great steps to protect from counterfeiters, including adding holograms, security rings, security threads and color shifting ink.<ref>{{cite web|url=http://www.microsoft.com/en-us/howtotell/Software.aspx|title=How to Tell – Software|author=|date=|work=microsoft.com|accessdate=11 December 2016|deadurl=no|archiveurl=https://web.archive.org/web/20161220103343/http://www.microsoft.com/en-us/howtotell/Software.aspx|archivedate=20 December 2016|df=}}</ref>\n\n==Authentication factors==\nThe ways in which someone may be authenticated fall into three categories, based on what are known as the factors of authentication: something the user ''knows'', something the user ''has'', and something the user ''is''. Each '''authentication factor''' covers a range of elements used to authenticate or verify a person's identity prior to being granted access, approving a transaction request, signing a document or other work product, granting authority to others, and establishing a chain of authority.\n\nSecurity research has determined that for a positive authentication, elements from at least two, and preferably all three, factors should be verified.<ref>{{Cite web |url=http://www.ffiec.gov/pdf/authentication_guidance.pdf |title=Authentication in an Internet Banking Environment |author=Federal Financial Institutions Examination Council |year=2008 |accessdate=2009-12-31 |deadurl=no |archiveurl=https://web.archive.org/web/20100505203410/http://www.ffiec.gov/pdf/authentication_guidance.pdf |archivedate=2010-05-05 |df= }}</ref> The three factors (classes) and some of elements of each factor are:\n\n* the '''knowledge factors''': Something the user '''knows''' (e.g., a [[password]], [[partial password]], [[pass phrase]], or [[personal identification number]] (PIN), [[challenge response]] (the user must answer a question, or pattern), [[Security question]]\n* the '''ownership factors''': Something the user '''has''' (e.g., wrist band, [[ID card]], [[security token]], [[Microchip implant (human)|implanted device]], [[cell phone]] with built-in [[hardware token]], [[software token]], or [[cell phone]] holding a [[software token]])\n* the '''inherence factors''': Something the user '''is''' or '''does''' (e.g., [[fingerprint]], [[retina]]l pattern, [[DNA]] sequence (there are assorted definitions of what is sufficient), [[signature]], face, voice, unique bio-electric signals, or other [[biometric]] identifier).\n\n===Single-factor authentication===\nAs the weakest level of authentication, only a single component from one of the three categories of factors is used to authenticate an individual’s identity. The use of only one factor does not offer much protection from misuse or malicious intrusion. This type of authentication is not recommended for financial or personally relevant transactions that warrant a higher level of security.<ref name=\"Turner-DigitalAuthentication-Basics\" />\n\n===Multi-factor authentication===\n{{Main article|Multi-factor authentication}}\nMulti-factor authentication involves two or more authentication factors (''something you know'', ''something you have'', or ''something you are''). Two-factor authentication is a special case of multi-factor authentication involving exactly two factors.<ref name=\"Turner-DigitalAuthentication-Basics\" />\n\nFor example, using a bankcard (something the user '''has''') along with a PIN (something the user '''knows''') provides two-factor authentication. Business networks may require users to provide a password (knowledge factor) and a pseudorandom number from a [[security token]] (ownership factor). Access to a very-high-security system might require a [[mantrap (access control)|mantrap]] screening of height, weight, facial, and fingerprint checks (several inherence factor elements) plus a PIN and a day code (knowledge factor elements), but this is still a two-factor authentication.\n\n==Authentication types==\nThe most frequent types of authentication available in use for authenticating online users differ in the level of security provided by combining factors from the one or more of the three categories of factors for authentication:\n\n===Strong authentication===\n{{Main article|Strong authentication}}\nThe [[United States|U.S.]] [[United States government|government]]'s [[National Information Assurance Glossary]] defines '''''[[strong authentication]]''''' as\n<blockquote>layered authentication approach relying on two or more authenticators to establish the identity of an originator or receiver of information.<ref name=\"NCSC-StrongAuthentication\">{{cite web|last1=Committee on National Security Systems|title=National Information Assurance (IA) Glossary|url=https://www.ncsc.gov/nittf/docs/CNSSI-4009_National_Information_Assurance.pdf|publisher=National Counterintelligence and Security Center|accessdate=9 August 2016|deadurl=no|archiveurl=https://web.archive.org/web/20161121224542/https://www.ncsc.gov/nittf/docs/CNSSI-4009_National_Information_Assurance.pdf|archivedate=21 November 2016|df=}}</ref></blockquote> The European Central Bank (ECB) has defined ''strong authentication'' as \"a procedure based on two or more of the three authentication factors\". The factors that are used must be mutually independent and at least one factor must be \"non-reusable and non-replicable\", except in the case of an inherence factor and must also be incapable of being stolen off the Internet. In the European, as well as in the US-American understanding, strong authentication is very similar to multi-factor authentication or 2FA, but exceeding those with more rigorous requirements.<ref name=\"Turner-DigitalAuthentication-Basics\" /><ref name=\"ECB-Recommendations\">{{cite web|last1=European Central Bank|title=Recommendations for the Security of Internet Payments|url=https://www.ecb.europa.eu/pub/pdf/other/recommendationssecurityinternetpaymentsoutcomeofpcfinalversionafterpc201301en.pdf|publisher=European Central Bank|accessdate=9 August 2016|deadurl=no|archiveurl=https://web.archive.org/web/20161106212218/https://www.ecb.europa.eu/pub/pdf/other/recommendationssecurityinternetpaymentsoutcomeofpcfinalversionafterpc201301en.pdf|archivedate=6 November 2016|df=}}</ref>\n\nThe [[FIDO Alliance|Fast IDentity Online (FIDO) Alliance]] has been striving to establish technical specifications for strong authentication.<ref>{{cite web |url=http://www.infosecurity-magazine.com/news/fido-alliance-passes-150/ |title=FIDO Alliance Passes 150 Post-Password Certified Products |publisher=InfoSecurity Magazine |date=2016-04-05 |accessdate=2016-06-13 |deadurl=no |archiveurl=https://web.archive.org/web/20160617090024/http://www.infosecurity-magazine.com/news/fido-alliance-passes-150/ |archivedate=2016-06-17 |df= }}</ref>\n\n===Continuous authentication===\nConventional computer systems authenticate users only at the initial log-in session, which can be the cause of a critical security flaw. To resolve this problem, systems need continuous user authentication methods that continuously monitor and authenticate users based on some biometric trait(s). A study used behavioural biometrics based in writing styles as a continuous authentication method.<ref name=\"BROC2017\">Brocardo ML, Traore I, Woungang I, Obaidat MS. \"[http://onlinelibrary.wiley.com/doi/10.1002/dac.3259/full Authorship verification using deep belief network systems] {{webarchive|url=https://web.archive.org/web/20170322015517/http://onlinelibrary.wiley.com/doi/10.1002/dac.3259/full |date=2017-03-22 }}\". Int J Commun Syst. 2017. {{doi|10.1002/dac.3259}}</ref>\n\nRecent research has shown the possibility of using smartphones’ sensors and accessories to extract some behavioral attributes such as touch dynamics, keystroke dynamics and gait recognition. These attributes are known as behavioral biometrics and could be used to verify or identify users implicitly and continuously on smartphones. The authentication systems that have been built based on these behavioral biometric traits are known as active or continuous authentication systems.<ref name=\"MAHFOUZ201728\">{{Cite journal |doi = 10.1016/j.jisa.2017.10.002|title = A survey on behavioral biometric authentication on smartphones|journal = Journal of Information Security and Applications|volume = 37|pages = 28–37|year = 2017|last1 = Mahfouz|first1 = Ahmed|last2 = Mahmoud|first2 = Tarek M.|last3 = Eldin|first3 = Ahmed Sharaf|arxiv = 1801.09308}}</ref>\n\n===Digital authentication===\n{{Main article|Electronic authentication}}\nThe term ''digital authentication'', also known as ''electronic authentication'', refers to a group of processes where the confidence for user identities is established and presented via electronic methods to an information system. It is also referred to as e-authentication. The digital authentication process creates technical challenges because of the need to authenticate individuals or entities remotely over a network.\nThe American [[National Institute of Standards and Technology]] (NIST) has created a generic model for digital authentication that describes the processes that are used to accomplish secure authentication:\n\n# ''Enrollment'' – an individual applies to a credential service provider (CSP) to initiate the enrollment process. After successfully proving the applicant’s identity, the CSP allows the applicant to become a subscriber.\n# ''Authentication'' – After becoming a subscriber, the user receives an [[authenticator]] e.g., a [[software token|token]] and credentials, such as a user name. He or she is then permitted to perform online transactions within an authenticated session with a relying party, where they must provide proof that he or she possesses one or more authenticators.\n# ''Life-cycle maintenance'' – the CSP is charged with the task of maintaining the user’s credential of the course of its lifetime, while the subscriber is responsible for maintaining his or her authenticator(s).<ref name=\"Turner-DigitalAuthentication-Basics\" /><ref name=\"NIST-Authentication\">{{cite web|title=Draft NIST Special Publication 800-63-3: Digital Authentication Guideline|url=https://pages.nist.gov/800-63-3/sp800-63-3.html|publisher=National Institute of Standards and Technology, USA|accessdate=9 August 2016|deadurl=no|archiveurl=https://web.archive.org/web/20160913153728/https://pages.nist.gov/800-63-3/sp800-63-3.html|archivedate=13 September 2016|df=}}</ref>\n\nThe authentication of information can pose special problems with electronic communication, such as vulnerability to [[man-in-the-middle attack]]s, whereby a third party taps into the communication stream, and poses as each of the two other communicating parties, in order to intercept information from each.  Extra identity factors can be required to authenticate each party's identity.\n\n===Product authentication===\n[[File:GatewayTracingHologramLabel.jpg|thumb|A [[security hologram]] label on an electronics box for authentication]]\n\n[[Counterfeit]] products are often offered to consumers as being authentic.  [[Counterfeit consumer goods]] such as electronics, music, apparel, and [[counterfeit medications]] have been sold as being legitimate.  Efforts to control the [[supply chain]] and educate consumers help ensure that authentic products are sold and used. Even [[security printing]] on packages, [[label]]s, and [[nameplate]]s, however, is subject to counterfeiting.{{cn|date=July 2019}}\n\nA [[Secure cryptoprocessor|secure key storage device]] can be used for authentication in consumer electronics, network authentication, license management, supply chain management, etc. Generally the device to be authenticated needs some sort of wireless or wired digital connection to either a host system or a network. Nonetheless, the component being authenticated need not be electronic in nature as an authentication chip can be mechanically attached and read through a connector to the host e.g. an authenticated ink tank for use with a printer. For products and services that these secure coprocessors can be applied to, they can offer a solution that can be much more difficult to counterfeit than most other options while at the same time being more easily verified.{{cn|date=July 2019}}\n\n====Packaging====\n[[Packaging and labeling]] can be engineered to help reduce the risks of [[counterfeit consumer goods]] or the theft and resale of products.<ref>{{cite journal| last =Eliasson| first =C|author2=Matousek| title = Noninvasive Authentication of Pharmaceutical Products through Packaging Using Spatially Offset Raman Spectroscopy| journal = Analytical Chemistry| volume =79| issue =4| pages =1696–1701| date =2007| doi=10.1021/ac062223z| pmid=17297975}}</ref><ref>{{cite journal| last =Li| first =Ling| title = Technology designed to combat fakes in the global supply chain| journal = Business Horizons| volume =56| issue =2| pages = 167–177| date =March 2013| doi=10.1016/j.bushor.2012.11.010}}</ref> Some package constructions are more difficult to copy and some have pilfer-indicating seals. [[Counterfeit]] goods, unauthorized sales (diversion), material substitution and tampering can all be reduced with these anti-counterfeiting technologies. Packages may include authentication seals and use [[security printing]] to help indicate that the package and contents are not counterfeit; these too are subject to counterfeiting. Packages also can include anti-theft devices, such as dye-packs, [[Radio-frequency identification|RFID]] tags, or [[electronic article surveillance]]<ref>[http://electronics.howstuffworks.com/anti-shoplifting-device.htm How Anti-shoplifting Devices Work\"] {{webarchive|url=https://web.archive.org/web/20060427081528/http://electronics.howstuffworks.com/anti-shoplifting-device.htm |date=2006-04-27 }}, HowStuffWorks.com</ref> tags that can be activated or detected by devices at exit points and require specialized tools to deactivate. Anti-counterfeiting technologies that can be used with packaging include:\n\n* [[Taggant]] fingerprinting – uniquely coded microscopic materials that are verified from a database\n* Encrypted micro-particles – unpredictably placed markings (numbers, layers and colors) not visible to the human eye\n* [[Hologram]]s – graphics printed on seals, patches, foils or labels and used at point of sale for visual verification\n* Micro-printing – second-line authentication often used on currencies\n* Serialized [[barcode]]s\n* UV printing – marks only visible under UV light\n* [[Track and trace]] systems – use codes to link products to database tracking system\n* Water indicators – become visible when contacted with water\n* DNA tracking – genes embedded onto labels that can be traced\n* Color-shifting ink or film – visible marks that switch colors or texture when tilted\n* [[Tamper evident]] seals and tapes – destructible or graphically verifiable at point of sale\n* 2d barcodes – data codes that can be tracked\n* [[RFID]] chips\n* [[Near field communication|NFC]] chips\n\n==Information content==\n[[Literary forgery]] can involve imitating the style of a famous author.  If an original [[manuscript]], typewritten text, or recording is available, then the medium itself (or its packaging – anything from a box to [[e-mail headers]]) can help prove or disprove the authenticity of the document. However, text, audio, and video can be copied into new media, possibly leaving only the informational content itself to use in authentication. Various systems have been invented to allow authors to provide a means for readers to reliably authenticate that a given message originated from or was relayed by them.  These involve authentication factors like:\n\n* A difficult-to-reproduce physical artifact, such as a [[seal (device)|seal]], [[signature]], [[watermark]], special [[stationery]], or [[fingerprint]].\n* A [[shared secret]], such as a passphrase, in the content of the message.\n* An [[electronic signature]]; [[public-key infrastructure]] is often used to cryptographically guarantee that a message has been signed by the holder of a particular private key.\n\nThe opposite problem is detection of [[plagiarism]], where information from a different author is passed off as a person's own work.  A common technique for proving plagiarism is the discovery of another copy of the same or very similar text, which has different attribution.  In some cases, excessively high quality or a style mismatch may raise suspicion of plagiarism.\n\n===Literacy and literature authentication===\nIn literacy, authentication is a readers’ process of questioning the veracity of an aspect of literature and then verifying those questions via research. The fundamental question for authentication of literature is – Does one believe it? Related to that, an authentication project is therefore a reading and writing activity which students documents the relevant research process (<ref>Norton, D. E. (2004). ''The effective teaching of language arts''. New York: Pearson/Merrill/Prentice Hall.</ref>). It builds students' critical literacy. The documentation materials for literature go beyond narrative texts and likely include informational texts, primary sources, and multimedia. The process typically involves both internet and hands-on library research.  When authenticating historical fiction in particular, readers consider the extent that the major historical events, as well as the culture portrayed (e.g., the language, clothing, food, gender roles), are believable for the period.<ref name=\":0\">{{cite journal | last1 = McTigue | first1 = E. | last2 = Thornton | first2 = E. | last3 = Wiese | first3 = P. | year = 2013 | title = Authentication Projects for Historical Fiction: Do you believe it? | url = http://eric.ed.gov/?id=EJ1012775 | journal = The Reading Teacher | volume = 66 | issue =  6| pages = 495–505 | doi = 10.1002/trtr.1132 | deadurl = no | archiveurl = https://web.archive.org/web/20150707211148/http://eric.ed.gov/?id=EJ1012775 | archivedate = 2015-07-07 | df =  }}</ref>\n\n==History and state-of-the-art==\n[[File:KAL-55B Tactical Authentication System (Vietnam War era) - National Cryptologic Museum - DSC08013.JPG|thumb|NSA KAL-55B Tactical Authentication System used by the U.S. military during the [[Vietnam War]] – [[National Cryptologic Museum]]]]\n\nHistorically, [[fingerprint]]s have been used as the most authoritative method of authentication, but court cases in the US and elsewhere have raised fundamental doubts about fingerprint reliability.{{Citation needed|date=January 2010}} Outside of the legal system as well, fingerprints have been shown to be easily [[spoofing attack|spoof]]able, with [[British Telecom]]'s top computer-security official noting that \"few\" fingerprint readers have not already been tricked by one spoof or another.<ref>[https://www.theregister.co.uk/2008/03/30/german_interior_minister_fingerprint_appropriated   ''The Register'', UK; Dan Goodin; 30 March 2008; ''Get your German Interior Minister's fingerprint, here''. Compared to other solutions, \"It's basically like leaving the password to your computer everywhere you go, without you being able to control it anymore\", one of the hackers comments.] {{webarchive|url=https://web.archive.org/web/20170810131615/https://www.theregister.co.uk/2008/03/30/german_interior_minister_fingerprint_appropriated |date=10 August 2017 }}</ref> Hybrid or two-tiered authentication methods offer a compelling{{According to whom|date=December 2016}} solution, such as private keys encrypted by fingerprint inside of a USB device.\n\nIn a computer data context, cryptographic methods have been developed (''see'' [[digital signature]] and [[challenge-response authentication]]) which are currently{{When|date=December 2016}} not spoofable '''if and only if''' the originator's key has not been compromised. That the originator (or anyone other than an [[Adversary (cryptography)|attacker]]) knows (or doesn't know) about a compromise is irrelevant. It is not known whether these cryptographically based authentication methods are provably secure, since unanticipated mathematical developments may make them vulnerable to attack in future. If that were to occur, it may call into question much of the authentication in the past. In particular, a [[digital signature|digitally signed]] [[legal instrument|contract]] may be questioned when a new attack on the cryptography underlying the signature is discovered.{{Citation needed|date=December 2016}}\n\n==Authorization==\n{{Main article|Authorization}}\n[[File:US Navy 050308-N-2385R-029 Master-at-Arms Seaman Carly Farmer checks an identification card (ID) before allowing a driver to enter the gate at U.S. Fleet Activities Sasebo, Japan.jpg|thumbnail|A sailor checks a driver's identification card before allowing her to enter a military base.]]\n\nThe process of [[authorization]] is distinct from that of authentication. Whereas authentication is the process of verifying that \"you are who you say you are\", authorization is the process of verifying that \"you are permitted to do what you are trying to do\". This does not mean authorization presupposes authentication; an anonymous agent could be authorized to a limited action set.<ref>{{cite web |url=https://technet.microsoft.com/en-us/library/ff687018.aspx |title=Best Practices for Creating a Secure Guest Account |accessdate=2017-11-06 |deadurl=no |archiveurl=https://web.archive.org/web/20171107060852/https://technet.microsoft.com/en-us/library/ff687018.aspx |archivedate=2017-11-07 |df= }}</ref>\n\n==Access control==\n{{Main article|Access control}}\n\nOne familiar use of authentication and authorization is [[access control]]. A computer system that is supposed to be used only by those authorized must attempt to detect and exclude the unauthorized. Access to it is therefore usually controlled by insisting on an authentication procedure to establish with some degree of confidence the identity of the user, granting privileges established for that identity.\n\n== See also ==\n{{Too many see alsos|date=December 2016}}\n{{div col|colwidth=15em}}\n\n* [[Access Control Service]]\n* [[Acuant|AssureID]]\n* [[Atomic authorization]]\n* [[Authentication Open Service Interface Definition]]\n* [[Authenticity in art]]\n* [[Authorization]]\n* [[Basic access authentication]]\n* [[Biometrics]]\n* [[CAPTCHA]]\n* [[Chip Authentication Program]]\n* [[Closed-loop authentication]]\n* [[Diameter (protocol)]]\n* [[Digital identity]]\n* [[Extensible Authentication Protocol|EAP]]\n* [[Electronic authentication]]\n* [[Encrypted key exchange]] (EKE)\n* [[Fingerprint Verification Competition]]\n* [[Geolocation]]\n* [[Hash-based message authentication code]]\n* [[Identification (information)]]\n* [[Java Authentication and Authorization Service]]\n* [[Kantara Initiative]]\n* [[Kerberos (protocol)|Kerberos]]\n* [[Multi-factor authentication]]\n* [[Needham–Schroeder protocol]]\n* [[OAuth]] – an open standard for authorization\n* [[OpenAthens]]\n* [[OpenID Connect]] – an authentication method for the web\n* [[OpenID]] – an authentication method for the web\n* [[Provenance]]\n* [[Public-key cryptography]]\n* [[RADIUS]]\n* [[Reliance authentication]]\n* [[Secret sharing]]\n* [[Secure Remote Password protocol]] (SRP)\n* [[Secure Shell]]\n* [[Security printing]]\n* [[SQRL]]\n* [[Strong authentication]]\n* [[Tamper-evident technology]]\n* [[TCP Wrapper]]\n* [[Time-based authentication]]\n* [[Two-factor authentication]]\n* [[Usability of web authentication systems]]\n* [[Woo–Lam]]\n{{div col end}}\n\n== References ==\n{{Reflist}}\n\n==External links==\n<!--======================== {{No more links}} ============================\n    | PLEASE BE CAUTIOUS IN ADDING MORE LINKS TO THIS ARTICLE. Wikipedia  |\n    | is not a collection of links nor should it be used for advertising. |\n    |                                                                     |\n    |           Excessive or inappropriate links WILL BE DELETED.         |\n    | See [[Wikipedia:External links]] & [[Wikipedia:Spam]] for details.  |\n    |                                                                     |\n    | If there are already plentiful links, please propose additions or   |\n    | replacements on this article's discussion page, or submit your link |\n    | to the relevant category at the Open Directory Project (dmoz.org)   |\n    | and link back to that category using the {{dmoz}} template.         |\n    ======================= {{No more links}} =============================-->\n* {{cite web| title=Electronic Authentication Guideline – NIST Special Publication 800-63-2 |author= [[National Institute of Standards and Technology]], [[U.S. Department of Commerce]] |url=http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-63-2.pdf |date=August 2013}}\n* [https://www.nist.gov/itl/csd/piv_090809.cfm \" New NIST Publications Describe Standards for Identity Credentials and Authentication Systems\"]\n\n{{Authentication}}\n{{Authority control}}\n\n[[Category:Authentication| ]]\n[[Category:Applications of cryptography]]\n[[Category:Access control]]\n[[Category:Packaging]]\n[[Category:Notary]]\n[[Category:Computer access control]]",
            "slug": "authentication",
            "date_updated": 1565239053390,
            "imported": "https://en.wikipedia.org/wiki/Authentication"
        }
    ]
}