{
    "article": [
        {
            "title": "Code Lyoko: Evolution",
            "text": "{{Infobox television\n| show_name                = Code Lyoko: Evolution\n| image                    = Code Lyoko Evolution logo.jpg\n| caption                  = \n| creator                  = {{unbulleted list|Tania Palumbo|[[Thomas Romain]]}}\n| writer                   = \n| director                 = {{unbulleted list|Luccio di Rossa (live action)|Florian Ferrier (CGI)}}\n| starring                 = {{plainlist|\n*Léonie Berthonnaud\n*Marin Lafitte\n*Gulliver Bevernage\n*Quentin Merabet\n*Mélanie Tran\n*Diego Mestanza\n*Pauline Serieys\n*Bastien Thelliez\n*Frank Beckmann\n*Sophie Fern}}\n| theme_music_composer     = \n| opentheme                = \n| endtheme                 = \n| composer                 = \n| country                  = France\n| num_seasons              = 1\n| num_episodes             = 26<ref>{{cite web|url=http://newsletter.magelis.org/index-module-newsletter-page-viewArticle-idArticle-999.html |title=Code Lyoko: Evolution (série 26x26' - France 3) - Moonscoop |publisher=Newsletter.magelis.org |date= |accessdate=2012-09-25}}</ref>\n| list_episodes            = List of Code Lyoko: Evolution episodes\n| executive_producer       = Benoît di Sabatino<br>Christophe di Sabatino\n| runtime                  = 24 minutes\n| company = [[Moonscoop]]\n| distributor              = Moonscoop\n| network                  = [[France 4]]\n| first_aired              = January 5 – December 19, 2013\n| preceded_by              = ''[[Code Lyoko]]''\n| website                  = \n}}\n\n'''''Code Lyoko: Evolution''''' is the sequel to the [[France|French]] [[Cartoon series|animated television series]] ''[[Code Lyoko]]''. It premiered on December 19, 2012, on [[France 4]] and repeated October 9, 2016, on [[Boing (France)|Boing]]. It blends live-action with [[Computer-generated imagery|CGI]], picking up where the original series left off. In addition to improving upon the CGI in the original series, the soundtrack has been overhauled as well.\n\n==Plot==\nOne year after the events of the [[Code Lyoko|original animated series]], Aelita Schaeffer, Jeremy Belpois, Odd Della Robia, Ulrich Stern, Yumi Ishiyama, and newly-welcomed William Dunbar return to their daily lives and routines at Kadic Academy. X.A.N.A., despite their success in defeating it previously, suddenly reappears, reborn with even more strength and power than ever before. The protagonists reactivate Franz Hopper's quantum supercomputer, which runs the virtual world Lyoko, and resume their former double lives in order to protect humanity from the threat of X.A.N.A. once again. Joined by William Dunbar, who has finally been accepted as the sixth Lyoko Warrior, and an unreliable girl-genius named Laura Gauthier, the seven heroes are bent on unraveling the reasons for such a return and to exterminate X.A.N.A., the [[Artificial intelligence|autonomous]], sentient [[multi-agent system]] that is threatening the world once again.\n\nX.A.N.A. is currently unable to take over the network due to it missing some of its essential \"Source Codes,\" which it injected into the Lyoko Warriors, except for William, during their final virtualization in the original series, and is now trying to steal them back through its Spectres. Jeremy reasons that if X.A.N.A. regains all of its Codes, it will take over the internet and nothing will stop it. One benefit to having Codes, however, is that the carrier can deactivate towers on Lyoko under X.A.N.A.'s control, making all but William capable of doing so, as opposed to just Aelita alone. With the help of Laura, Jeremy works to write a virus that will be capable of hopefully eradicating X.A.N.A. for good this time.\n\nIn addition to X.A.N.A., the gang eventually discover that they have another dangerous enemy, a [[mad scientist]] named Professor Lowell Tyron, who seems to be the one responsible for unintentionally reactivating X.A.N.A.. He claims to have no knowledge of X.A.N.A., despite its high level of activity in the Cortex system, which is a Replika (a virtual world that is similar to Lyoko) that Tyron created. He commands a group of several virtual human avatars in green and black-striped ninja-like costumes to counter the Lyoko Warriors' efforts to hack into his system. In Tyron's lab, the group also discovers Aelita's long-lost mother, Anthea Hopper-Schaeffer. They seek to discover why she is with their new enemy and how to reunite Anthea and her daughter.\n\nIn the cliffhanger finale, \"Ultimate Mission\", it is revealed that Tyron had been married to Anthea Hopper for four years now, making him Aelita's stepfather. Tyron attempts to coerce Aelita into telling her friends to abort their plan to destroy the Cortex and coming with him, as he has legal custody of her, or risk never seeing her mother again. Aelita ultimately chooses to forsake her mother and go through with their original plan, and Tyron orders his subordinates to shut down his supercomputer while the Lyoko Warriors are still inside. They barely escape, having just injected Jeremy's virus into the core of the Cortex, which means that X.A.N.A. would be destroyed upon rebooting of Tyron's computer, unless either X.A.N.A. was able to back itself up, or Tyron is able to repair his supercomputer, and by extension, X.A.N.A. along with it; never truly confirming whether X.A.N.A. was entirely destroyed a second time.\n\n==Characters==\n{{see also|Code Lyoko#Characters}}\n===Main (Lyoko Warriors)===\n'''Jeremy Belpois''' ''(French: Jérémy Belpois)''\n:Portrayed by: Marin Lafitte \n:A computer genius and top student in class, Jeremy was the one who originally found the [[Supercomputer]] in the nearby abandoned factory and turned it on, beginning the group's struggle against X.A.N.A.. He believed he'd defeated X.A.N.A. using a [[multi-agent system]] of his own creation in the finale of ''[[Code Lyoko]]'' and was dubious that X.A.N.A. had returned at the start of ''Code Lyoko: Evolution''. Once the Lyoko Warriors start fighting X.A.N.A. again, Jeremy returns to his workaholic nature, often staying up late to work on programs such as the virus he intends to use to destroy the Cortex. He spends a lot of time working alongside Laura, causing Aelita to become jealous.\n\n'''Aelita Schaeffer'''\n:Portrayed by: Léonie Berthonnaud\n:Primarily known by her alias '''Aelita Stones''', she's the smartest of the group alongside Jeremy. Her father, Franz Hopper, created the Supercomputer, Lyoko and X.A.N.A., and ultimately sacrificed himself to try and stop X.A.N.A. once and for all. Aelita sometimes struggles with the reality of his death and the return of the enemy he died trying to defeat. She has a strong bond with Jeremy but his relationship with Laura causes her to be jealous. After she finds out that her mother, Anthea Hopper, is alive and working with Professor Tyron, Aelita is determined to contact her so that they can reunite. Aelita has been implanted with some of X.A.N.A.'s source codes, making her a target for its spectres.\n:On Lyoko, Aelita has pointed elf ears and the ability to summon a pair of pink angel wings in order to fly. Her weapon is her \"energy fields,\" pink balls of plasma that can be thrown. She can also generate a large pink shield made of the same sort of plasma. She is able to deactivate towers on Lyoko.\n\n'''Odd Della Robia<!--They changed it from \"Robbia\" to \"Robia\" in Evolution-->'''\n:Portrayed by: Gulliver Bevernaege\n:The comic relief of the group and a bad student who isn't interested in studying. He shares a dorm with Ulrich, where he used to keep his dog '''Kiwi'''. Between the events of ''Code Lyoko'' and ''Code Lyoko: Evolution'', Odd sent Kiwi home to stay with his sisters, but he misses his dog dearly. He's considered a ladies man and spends most of the series pursuing his love interest Samantha Suarez. His hair is now brown instead of blond, but retains the purple spot at the front. Odd has been implanted with some of X.A.N.A.'s source codes and is a target for X.A.N.A.'s spectres.\n:On Lyoko, Odd is like a cat, having a tail and clawed gloves which he can use to climb walls. He can summon an additional set of gauntlets over his gloves that shoot many blue \"laser arrows\" at once. While he still retains some of X.A.N.A.'s source codes, he's capable of deactivating towers on Lyoko.\n\n'''Ulrich Stern'''\n:Portrayed by: Quentin Merabet\n:A more reserved member of the group, Ulrich has a hard time sharing his feelings. His parents pressure him to achieve well in school, but he has difficulty learning and living up to their expectations. In his off-time he practices [[karate]] and [[judo]]<!--Not pencak silat!--> with Yumi, whom he has a crush on. He often butts heads with William, who he sees as a rival. Ulrich has been implanted with some of X.A.N.A.'s source codes and is a target for its spectres.\n:On Lyoko, Ulrich dual wields [[katana|katanas]]. His \"[[Superhuman speed|super sprint]]\" ability allows him to dash at high speeds and to run on walls, and his \"Triplicate\" power lets him create two clones of himself. While he still retains some of X.A.N.A.'s source codes, he's capable of deactivating towers on Lyoko.\n\n'''Yumi Ishiyama'''\n:Portrayed by: Mélanie Tran\n:A fairly reserved student who lives near and attends Kadic. She is the oldest of the group. She is of [[Japanese people|Japanese]] descent. She was initially very resistant to the idea of turning the Supercomputer back on again after signs of X.A.N.A.'s return. She practices [[judo]]<!--Not pencak silat!--> with Ulrich, whom she has a crush on, though it's not as obvious as Ulrich's crush on her. She's good friends with William, who's in her class, and doesn't like the idea of excluding him from the group now that X.A.N.A. has returned. Along with the rest of the Lyoko Warriors, she was implanted with some of X.A.N.A.'s source codes.\n:On Lyoko, Yumi's main weapons are a pair of tessen fans. Jeremy programs her a [[bō]] staff as well which she uses occasionally. She can deactivate towers on Lyoko as long as she still retains some of X.A.N.A.'s source codes.\n\n'''William Dunbar'''\n:Portrayed by: Diego Mestanza\n:An overconfident student in Yumi's class. William is initially kept uninformed about X.A.N.A.'s return because the group are distrustful of him. However, he eventually regains their trust and is allowed to fight alongside them. He still has feelings for Yumi but is more respectful of her boundaries. He has a rivalry with Ulrich. As he wasn't present on Lyoko during the final battle of the original series, he wasn't implanted with any of X.A.N.A.'s source codes.\n:On Lyoko, he retains his black outfit and some of his powers from his time under X.A.N.A.'s control: enhanced strength, and \"Supersmoke,\" which allows him to transform into a cloud of black smoke, move at great speed and even fly. His weapon is a giant sword which can release [[shock waves]].\n\n'''Laura Gauthier'''\n:Portrayed by: Pauline Serieys\n:The temporary seventh member of the Lyoko Warriors. She's a highly intelligent student, rivalling Jeremy in class, and has a keen interest in computing. She discovers Lyoko, the factory, and the Supercomputer after following William to the factory without his noticing. Her main role is to assist Jeremy in matters that even Aelita could not help in, such as advanced coding and constructing viruses. She is generally viewed with suspicion by the others due to her uninitiated status. She lacks sympathy towards Aelita's situation and enjoys spending time with Jeremy, so Aelita displays some animosity towards her. When Laura rebels against Jeremy, goes to the factory with William and sends him to the Cortex, William nearly gets captured by X.A.N.A. as he did in the original series. After the Lyoko Warriors stop the Scyphozoa from fully possessing William, Jeremy kicks Laura out of the group and erases her memories of the factory, the Supercomputer and Lyoko.\n\n===Antagonists===\n\n'''X.A.N.A.'''\n:Sometimes known as '''XANA'''. A powerful multi-agent system or [[artificial intelligence]] that returns from ''[[Code Lyoko]]'' to serve as the main antagonist of the series. After its supposed destruction in the original series, it was revealed in ''Code Lyoko: Evolution'' that X.A.N.A. survived by taking refuge in the Cortex, a sector generated by Professor Tyron's supercomputer. X.A.N.A. activates towers on Lyoko and sends spectres in the form of human beings to get close to the heroes and drain them of its source codes, which are a share of its power implanted in them before its previous downfall. X.A.N.A. is determined to become complete again so it can take full control of the world network.\n\n'''X.A.N.A.'s Monsters'''\n:The virtual creatures X.A.N.A. uses to protect the towers it has activated and try to stop the heroes from accessing them, or to stop them from reaching the centre of the Cortex. There are several different types of monsters, some inspired by real-life animals. X.A.N.A. also sometimes sends monsters to keep Tyron's Ninja avatars from finding out about X.A.N.A.'s presence in his supercomputer.\n\n'''Professor Lowell Tyron'''\n:Portrayed by: Franck Beckmann\n:The secondary antagonist, responsible for the creation of the Cortex within his own quantum supercomputer in Switzerland. His character is unintentionally responsible for X.A.N.A.'s rebirth as well as antagonizing Jeremy and his friends. He used to work with Franz Hopper, but was fired after not listening to his instructions and being too conceited. He later betrayed him by stealing blueprints to create his own supercomputer. After an unknown sequence of events, he married Anthea; this also makes him Aelita's stepfather.\n\n'''Ninjas'''\n:Human avatars, similar to the Lyoko Warriors, that are sent to the Cortex by Professor Tyron when necessary. Tyron lacks the technology to virtualise human beings directly into a virtual world, so he equips his staff with special suits that allow them to control Ninja avatars on the Cortex. Each Ninja is identical: faceless and green with white stripes, and armed with dual swords. They're masters of martial arts and stealth, with the ability to melt into the floor and resurface behind an enemy to take them by surprise. They're also able to travel across the Digital Sea without any protection. Their mission is to stop the Lyoko Warriors from interfering with the Cortex, and they make formidable opponents.\n\n===Supporting Characters===\n'''Jim Morales''' ''(French: Jim Moralès)''\n:Portrayed by: Bastien Thelliez\n:The physical education teacher at Kadic Academy and the chief disciplinarian. He often makes long speeches about the sports he teaches, or begins to reminisce about stories of his past before being interrupted by someone or cutting himself off. He can be quite serious when rules are broken, but he's also kind towards students in need. The heroes often cross him but his memory is usually erased by a Return to the Past.\n\n'''Samantha Suarez'''\n:Portrayed by: Louise Vallat\n:Odd's love interest. She seems to have known Odd for a long time, but Samantha only started boarding at Kadic Academy recently after a dispute with her father. Odd begins to pursue her as a love interest, even buying her a thousand red roses when he believes he's won the lottery. Samantha is hesitant about starting a relationship with him, most likely due to the fact that Odd can't tell her the truth about why he keeps running off.\n\n'''Anthea Hopper''' ''(French: Anthéa Hopper)''\n:Portrayed by: Sandrine Rigaux\n:Mother of Aelita and widow of Franz. In the original series, Anthea was kidnapped by men in black suits when Aelita was very young and her fate was never known. In ''Code Lyoko: Evolution'', she is revealed be alive and working alongside Professor Tyron, who had convinced her that her daughter was dead. She and Tyron married five years prior to the events of ''Code Lyoko: Evolution''. After Aelita manages to contact her mother and tell her that she's alive, Anthea sends her back a message expressing her happiness and her wish that Aelita come to Switzerland to live with her and her husband.\n\n*'''Elisabeth \"Sissi\" Delmas''', portrayed by Clémency Haynes. The principal's daughter and a student at Kadic Academy. Unlike in the original series, she no longer seems interested in Ulrich, and she tries to make friends with Aelita and Yumi.\n*'''Jean-Pierre Delmas''', portrayed by Eric Soubelet. The principal of Kadic Academy.\n*'''Suzanne Hertz''', portrayed by Sophie Fougère. A science teacher at Kadic.\n*'''Franz Hopper''', portrayed by Hugues Massinat. Late father of Aelita and husband of Anthea. He died sacrificing himself to stop X.A.N.A. at the end of ''Code Lyoko'' and only appears in old videos or photographs.\n\n==Cast==\n===Main===\n{| class=\"wikitable\"\n|-\n! ''Code Lyoko: Evolution'' characters\n! Original actors/actresses\n|-\n|'''Aelita Schaeffer'''\n| Léonie Berthonnaud\n|-\n| '''Jeremy Belpois'''\n| Marin Lafitte\n|-\n| '''Odd Della Robia'''\n| Gulliver Bevernage\n|-\n| '''Ulrich Stern'''\n| Quentin Merabet\n|-\n| '''Yumi Ishiyama'''\n| Mélanie Tran\n|-\n| '''William Dunbar'''\n| Diego Mestanza\n|-\n|'''Laura Gauthier'''\n|Pauline Serieys (12 Episodes)\n|}\n\n===Supporting===\n{| class=\"wikitable\"\n|-\n! ''Code Lyoko: Evolution'' characters\n! Original actors/actresses\n|-\n| '''Elisabeth \"Sissi\" Delmas'''\n| Clémency Haynes (2 Episodes)\n|-\n| '''Jean-Pierre Delmas'''\n| Éric Soubelet (5 Episodes)\n|-\n| '''Suzanne Hertz'''\n| Sophie Fougère (3 Episodes)\n|-\n| '''Jim Morales'''\n| Bastien Thelliez (20 Episodes)\n|-\n| '''Waldo Franz Shaffer (Franz Hopper)'''\n| Hugues Massignat (3 Episodes; photographs & video cams)\n|-\n| '''Anthea Hopper-Tyron'''\n| Sandrine Rigaux (5 Episodes)\n|-\n| '''Professor Lowell Tyron'''\n| Franck Beckmann (7 Episodes)\n|}\n\n==Production==\nThe budget for the series was expected to be €5,600,000.<ref>{{cite web|url=http://www.sudouest.fr/2012/02/29/en-chair-et-en-3d-646142-813.php |title=Angoulême : \"Code Lyoko\" en chair et en 3D |publisher=SudOuest.fr |date=2012-02-29 |accessdate=2012-09-25}}</ref>\n\n==Reception==\nCode Lyoko Evolution received mixed reviews. While the improved CGI animation was viewed positively by fans (though the change from the unique art style put many fans off), reception to most of the other changes were either mixed or outright negative. Fans lambasted Laura Gauthier's character and had mixed views about the live-action shooting replacing 2-D animation in real life. Fans also criticized the casting choices and wooden acting of some of the performers. Aspects of the writing have also been criticized and it is generally seen as inferior to the original series. All of this led to there only being one season with 26 episodes. \n\n==See also==\n{{Wikiquote}}\n* [[List of French animated television series]]\n* [[List of French television series]]\n\n==References==\n{{Reflist|30em}}\n\n{{Code Lyoko}}\n\n[[Category:Code Lyoko|Evolution]]\n[[Category:Television series with live action and animation]]\n[[Category:2010s French animated television series]]\n[[Category:2013 French television series debuts]]\n[[Category:2013 French television series endings]]\n[[Category:French children's animated action television series]]\n[[Category:French children's animated adventure television series]]\n[[Category:French children's animated science fiction television series]]\n[[Category:Television series about parallel universes]]\n[[Category:Television series by Splash Entertainment]]\n[[Category:Malware in fiction]]",
            "slug": "code-lyoko-evolution",
            "date_updated": 1565237328307,
            "imported": "https://en.wikipedia.org/wiki/Code_Lyoko:_Evolution"
        }
    ]
}