{
    "article": [
        {
            "title": "Code Lyoko",
            "text": "{{Use dmy dates|date=February 2011}}\n{{Infobox television\n| show_name                = Code Lyoko\n| image                    = Code Lyoko logo.png\n| caption                  = \n| genre                    = <!-- Do not add anything here unless it is reliably sourced (provide a reference). Do not remove this note without a reason given. -->[[Action film|Action]]/[[Adventure fiction|adventure]]<br/>[[Science fiction]]<ref name=\"mediatoon\">{{cite web|url=http://www.mediatoon-distribution.com/en/catalog/186/code-lyoko/|title=Code Lyoko|website=Mediatoon Distribution|accessdate=2016-02-26}}</ref><!-- Do not add anything here unless it is reliably sourced (provide a reference). Do not remove this note without a reason given. --><br />[[Drama]]\n| creator                  = Tania Palumbo<br />[[Thomas Romain]]\n| writer                   = Sophie Decroisette\n| director                 = Jérôme Mouscadet\n| starring                 = Sharon Mann<br />Matthew Géczy<br />Barbara Scaff<br />Mirabelle Kirkland<br />[[David Gasman]]<br />Jodi Forrest<br />Allan Wenger<br />Paul Bandey<br />Christine Flowers\n| theme_music_composer     = Franck Keller<br />Ygal Amar\n| opentheme                = \"Un monde sans danger\" (\"A World Without Danger\") by Julien Lamassonne (sung in English by [[Noam Kaniel]])\n| endtheme                 = \"A World Without Danger\" (Instrumental) {{small|Season 1}}<br />\n \"Break Away\" (Instrumental) by Subdigitals {{small|Seasons 2–4}}\n| composer                 = Serge Tavitian<br />Herman Martin\n| country                  = France\n| num_seasons              = 4\n| num_episodes             = 97<ref name=\"mediatoon\" />{{efn|Includes the two-part prequel titled \"XANA Awakens\".}}\n| list_episodes            = List of Code Lyoko episodes\n| executive_producer       = Nicolas Atlan<br/>Christophe di Sabatino<br/>Benoît di Sabatino\n| producer                 = Nicolas Altan\n| runtime                  = 26 minutes<ref name=\"mediatoon\" />\n| company                  = Antefilms (episodes 1-26)<br/>[[MoonScoop Group]] (episodes 27-97)<br/>[[Ellipsanime]]\n| distributor              = [[Taffy Entertainment]]\n| network                  = [[France 3]]<!-- Do not add Cartoon Network to this section, as this show was made in France and not in the United States, and do not remove this note without a reason given. -->\n| picture_format           = {{Plainlist|\n*[[576i]] ([[4:3]] [[SDTV]])}}\n| first_aired              = {{Start date|2003|09|03|df=y}}\n| last_aired               = {{End date|df=yes|2007|11|10}}\n| preceded_by              = \n| followed_by              = ''[[Code Lyoko: Evolution]]''\n| website                  = \n| image_alt                = \n| channel                  = \n| first_run                = \n| released                 = \n}}\n\n'''''Code Lyoko''''' is a French [[animated series|animated television series]] created by [[Thomas Romain]] and Tania Palumbo and produced by the [[MoonScoop Group]] for [[France 3]]. The series centers on a group of teenagers who travel to the virtual world of Lyoko to battle against a malignant [[artificial intelligence]] known as X.A.N.A. who threatens Earth. The scenes in the real world are presented in [[traditional animation|2D hand-drawn animation]], while the scenes in Lyoko are presented in [[computer-generated imagery|CGI animation]].\n\nThe series began its first, 97-episode run on 3 September 2003, on France's [[France 3]], and ended on 10 November 2007. It started airing in the United States on 19 April 2004 on [[Cartoon Network]].\n\n''Code Lyoko'' aired every day on Cartoon Network, in the [[Miguzi]] programming block, at 5:30 P.M. U.S. Eastern Time, sometimes showing two episodes consecutively, in the cases of season finales.\n\nOn 31 May 2011, the MoonScoop Group announced on its Facebook page that the show would be returning for a fifth season. This follow-up series was officially named ''[[Code Lyoko: Evolution]]'', which began airing at the end of 2012. This \"continuation\" to the series featured live action sequences for scenes taking place in the real world instead of its traditional 2D animation, but retained the iconic CGI for scenes taking place in Lyoko, now with an updated style. The show consisted of 26 episodes with the final episode airing in late 2013, leaving off on a cliffhanger with no second season planned as Moonscoop filed for bankruptcy in 2014.\n\n== Plot ==\nJeremy Belpois, a 12-year-old prodigy attending boarding school at Kadic Academy, discovers a quantum [[supercomputer]] in an abandoned factory near his school. Upon activating it, he discovers a virtual world called Lyoko with an [[artificial intelligence|artificially intelligent]] girl named Aelita trapped inside it. Jeremy learns of X.A.N.A., a fully autonomous, malevolent, and highly intelligent [[multi-agent system]], that also dwells within the Supercomputer. Using Lyoko's power, X.A.N.A is able to possess electronics and machinery (and later, people) in the real world to wreak havoc. X.A.N.A.'s primary objective is to eliminate anyone who's aware of the supercomputer's existence, so that it will be free to conquer the real world and enslave all human beings.\n\nJeremy works tirelessly to materialize Aelita into the real world and stop attacks caused by X.A.N.A. Jeremy is aided by his three friends Odd Della Robbia, Ulrich Stern, and Yumi Ishiyama, who are virtualized into Lyoko in order to save both worlds from the sinister virtual entity. They achieve this by escorting Aelita to various towers on Lyoko, which serve as interface terminals between Lyoko and Earth, and having her deactivate the one that X.A.N.A. is using to access the real world. Once the tower is deactivated, Jeremy is able to launch a \"Return to the Past\" program, which sends anyone scanned into the Supercomputer's memory back in time, whilst retaining memory of the other timeline, to undo any damage caused by X.A.N.A. (the only exception of this are any deaths caused by the attack, which would carry over even with the time reversion). In \"Code: Earth,\" Aelita is finally materialized, but the group discovers that X.A.N.A. had planted a virus inside of her that will kill her if the Supercomputer is deactivated. They realize that they cannot destroy X.A.N.A. completely, or Aelita will be destroyed along with it.\n\nAelita adjusts to life in the real world, while Jeremy attempts to develop an anti-virus program for her in an attempt to fully liberate her from X.A.N.A.'s power. On Lyoko, a fifth sector is discovered and the group explores more of Lyoko's secrets and mysteries. The gang begins to uncover information about a mysterious man named Franz Hopper, who went missing ten years ago. He supposedly created the Supercomputer, Lyoko, and X.A.N.A., and is eventually discovered to be Aelita's father. They finally find out that Franz Hopper is indeed alive somewhere, hiding deep within the uncharted parts of Lyoko to avoid X.A.N.A. further. All the while, X.A.N.A. attempts to steal Aelita's memory using a special monster, the Scyphozoa, in order to gain the Keys to Lyoko and free itself.\n\nAt the end of the season, Aelita and Jeremy discover that Aelita is actually human and does not have a virus, and instead is missing a fragment of herself. In \"The Key,\" X.A.N.A. tricks them with a fake fragment and succeeds in stealing Aelita's memory and escaping the Supercomputer into the World Wide Web, which exists in the Digital Sea outside of Lyoko. Aelita appears to perish as a result, but is revived when Franz Hopper gives her his faction of the Keys to Lyoko and restores her missing fragment: the memories of her forgotten childhood before she was virtualized on Lyoko.\n\nSince succeeding in escaping the confinements of the supercomputer, X.A.N.A. changes tactics by destroying each of Lyoko's surface sectors, until only Carthage (Sector 5) is left. Initially reluctant, the Lyoko Warriors make the decision to invite William Dunbar as the sixth member. However, shortly after being virtualized, he is possessed by X.A.N.A. via the Scyphozoa. Shortly after, he destroys the Core of Lyoko, destroying the entire virtual world and rendering the group unable to fight X.A.N.A., putting the entire real world in danger. After what they thought was their defeat, Jeremy receives a coded message from Franz Hopper that allows him to recreate Lyoko and continue the fight against X.A.N.A.\n\nJeremy and Aelita construct a digital submarine, the Skidbladnir (commonly referred to as the \"Skid\"), to travel across the Digital Sea to destroy X.A.N.A.'s \"Replikas,\" which are copies of Lyoko's sectors that are linked to X.A.N.A.-controlled supercomputers on Earth, all created for its goal of world domination. X.A.N.A. uses William as its general throughout the season to defend the Replikas, and sabotage the Lyoko Warriors in any way he can. To prevent suspicion regarding William's disappearance, Jeremy manages to program a spectre to take William's place at Kadic, although the clone has very low-level intelligence and acts very moronic. Near the end of the season, X.A.N.A. decides to draw energy from all of its Replikas to create the Kolossus, a gigantic, seemingly-invincible monster that later destroys the Skidbladnir. Before it is destroyed, Jeremy frees William from X.A.N.A.'s control. After his return, he has a difficult time gaining the trust of the group. While Ulrich defeats the Kolossus, Franz Hopper sacrifices himself in order to power Jeremy's \"anti-X.A.N.A. program,\" which destroys X.A.N.A. upon activation. Shortly after, the group, albeit reluctant due to their nostalgia, decides to shut down the Supercomputer.\n\n== Episodes ==\n{{Main|List of Code Lyoko episodes}}\n{{:List of Code Lyoko episodes}}\n\n== Characters ==\n===Main (Lyoko Warriors)===\n<!-- Deleted image removed: [[File:Code lyoko.jpg|thumb|183x183px|L to R: Aelita, Ulrich, Yumi, Odd with Kiwi, Jeremy.]] -->\n'''Jeremy Belpois''' ''(French: Jérémy Belpois; formerly Jeremie (French: Jérémie) in season 1)''\n:Voiced by: Raphaëlle Bruneau (French); Sharon Mann (English)\n:A 12-year-old top-of-the-class student who finds and starts the factory's [[supercomputer]] while looking for parts to build a robot. By turning on the Supercomputer, he reawakened Aelita, the virtual world of Lyoko, and the malevolent [[multi-agent system]] X.A.N.A.. His goals are mainly driven by his desire to protect Aelita and to save her from the Supercomputer and X.A.N.A. by materialising her on Earth. As part of the group, he specializes in programming new ways to defeat X.A.N.A. and monitors the group while they are on Lyoko. Because he is not very athletic and is more computer savvy, Jeremy almost never goes to Lyoko, only going there once and vowing to never do it again. His workaholic attitude occasionally puts a strain on his relationships with the other members of the group.\n\n'''Aelita Schaeffer'''\n:Voiced by: Sophie Landresse (French); Sharon Mann (English)\n:Mainly known by her alias '''Aelita Stones''', Aelita is the smartest of the group alongside Jeremy. At the beginning of the series she was trapped on Lyoko, inside the Supercomputer. She was originally thought to be an [[artificial intelligence|AI]] until it was revealed that she's actually the daughter of Franz Hopper, the creator of Lyoko. As a little girl, she lost her mother. When a group of suited men came to her home, she and her father fled and virtualized themselves on Lyoko. Between the virtualization and Jeremy's discovery of the Supercomputer, X.A.N.A. stole an important memory fragment that inhibited her from becoming fully human again. After this fragment is retrieved, she is no longer linked to the Supercomputer. After becoming human, she often has nightmares of her past life. She enrolls as a boarder at Kadic under the name Aelita Stones, claiming to be Odd's cousin. She reciprocates Jeremy's feelings for her, but he often strains their relationship by overlooking Aelita and her passions in favor of working on the Supercomputer. \n:Aelita is the only one capable of deactivating towers on Lyoko to stop X.A.N.A.'s attacks. On Lyoko, she has an elf-like appearance, similar to that of \"Mr. Pück,\" a toy elf from her childhood. She has the \"power of creation:\" the ability to create or remove objects, such as rocks or bridges, from the virtual environment. She had no weapons or defence until season 3 of the show, when she developed the ability to use \"energy fields,\" pink balls of plasma that can be thrown or used to block enemy fire. In season 4, Jeremy programs light pink angel wings as part of her new virtual attire, allowing her to fly.\n\n'''Odd Della Robbia'''\n:Voiced by: Raphaëlle Bruneau (French); Matthew Géczy (English)\n:The comic relief of the group. Odd is credited as having great potential when it comes to school, but rarely uses it, and gets bad grades due to his lack of studying. He shares a dorm with Ulrich and has a dog named '''Kiwi''', who he hides in a dresser because pets aren't allowed at Kadic. He's considered a ladies' man and has dated many of the girls at his school, but his romances tend to last only a few days. Before he attended Kadic, he lived with his parents and his five sisters. Odd's blond hair has a purple spot and is worn up in a spike. \n:On Lyoko, he is clothed like a cat, with a tail and clawed gloves that shoot \"[[arrowhead|laser arrows]].\" In season 1 he had a [[precognition|precognitive]] power named \"Future Flash\", but it was deleted before season 2. In season 2, Odd gains the ability to summon a purple shield by crossing his arms in front of his body. Another one of Odd's abilities is being able to use his claws to climb on walls.\n\n'''Ulrich Stern'''\n:Voiced by: Marie-Line Landerwijn (French); Barbara Weber-Scaff (English)\n:A more reserved member of the group, Ulrich has a hard time sharing his feelings. His parents pressure him to achieve well in school, but he has difficulty learning and living up to their expectations. In his off-time he practices [[Pencak silat]] with Yumi, whom he has a crush on. He suffers from [[vertigo]], which makes it hard to participate in activities such as rock climbing.\n:On Lyoko, he wears a yellow and brown outfit inspired by Japanese [[samurai]]. His main weapon is a [[katana]], and can dual wield them. His \"Supersprint\" ability allows him to dash at high speed, and his \"Triplicate\" power lets him create two clones of himself. He can combine these abilities in a technique called \"Triangulate,\" using his clones to form a triangle around an enemy and ambush it.\n\n'''Yumi Ishiyama'''\n:Voiced by: Géraldine Frippiat (French); [[Mirabelle Kirkland]] (English)\n:A fairly reserved student who lives near and attends Kadic. She is the oldest of the group. She is of [[Japanese people|Japanese]] descent, and has one younger brother, Hiroki. Because of her parents and culture, she must maintain good grades and observe family values. At home, she generally has to deal with marital issues between her parents. She is a friend of William Dunbar, who transferred to Kadic during season 2. She practices [[pencak silat]] with Ulrich, whom she has a crush on, though it's not as obvious as Ulrich's crush on her. She always wears black and has enough basic knowledge of the Supercomputer to operate it in Jeremy and Aelita's absence.\n:On Lyoko, Yumi is dressed in a [[geisha]]-inspired outfit with an [[obi (sash)|obi]] sash. Her main weapon is a tessen fan, and her power is [[telekinesis]], allowing her to move objects with her mind.\n\n'''William Dunbar'''\n:Voiced by: Mathieu Moreau (French); [[David Gasman]] (English)\n:An overconfident student who starts attending Kadic Academy after he was expelled from his previous school for vandalism. Yumi befriends him and he soon develops feelings for her. He often fights with Ulrich for Yumi's attention and is sometimes disrespectful of Yumi's boundaries, causing her to become frustrated with his unwanted advances. After proving helpful to the group out during several X.A.N.A. attacks, they vote on whether he should be allowed to join the group, but Yumi votes no and his memory is erased. Eventually, however, the vote becomes unanimous when William's membership is deemed necessary.\n:On his first mission on Lyoko, William is captured and possessed by X.A.N.A., who ensnares William as its puppet. From that point on, a clone of William, created by Jeremy, is used to pose as the real William until Jeremy is able to free him. Unfortunately, Jeremy's program is imperfect, causing the William clone to act either unintelligent or unpredictable. Near the end of the series the clone starts developing several human-like traits, which he eventually uses to help the warriors. Towards the end of the series, William is finally released from X.A.N.A.'s control.\n:On Lyoko, William wears a white outfit and carries a giant sword, which can release [[shock waves]]. Under X.A.N.A.'s control his outfit turns black and he gains a spiked gauntlet on his wrist, which can be used for defence. He has an array of powers including enhanced strength; \"Supersmoke,\" which allows him to transform into a cloud of black smoke and move around at great speed, eventually gaining the ability to fly as well; a [[second sight]] allowing him to see across great distances; and levitation. X.A.N.A. sends William to stop the Lyoko Warriors on the virtual world, and thanks to his various powers, he proves to be a formidable opponent.\n\n===Antagonists===\n\n'''X.A.N.A.'''\n:Sometimes known as XANA, it is a powerful multi-agent system that serves as the main antagonist of the series. It was originally created by Franz Hopper to destroy Project Carthage: a military software system that Franz Hopper had previously been involved with. He mentions that his motives were to prevent the French government from obtaining access to Project Carthage. Unfortunately, due to his repeated Returns to the Past, X.A.N.A. grew stronger and smarter until it eventually became sentient, choosing to rebel against Franz. It then trapped Franz and his daughter Aelita inside Lyoko. Luckily, Franz was able to shut down the Supercomputer to trap X.A.N.A. and stop it from wreaking havoc in the real world.\n\n:X.A.N.A. displays no mercy towards those who stand in its way, waging attacks through Lyoko on the real world, often attempting mortal harm against the main characters. Being a computer program, X.A.N.A. has no actual physical form. Instead, X.A.N.A. activates Lyoko structures called \"towers\" to access the real world, unleashing spectres from outlets to possess objects, natural forces, and animals to launch attacks on Earth, while sending monsters to fight its enemies on Lyoko. Objects and forces controlled by X.A.N.A. are marked with a symbol called the Eye of X.A.N.A., symbolizing its influence over them. Partway through the series, it gains the ability to possess human beings to do its bidding on Earth. Whenever a human is possessed by X.A.N.A., that person does what it commands and becomes pixelized, their forms altered and empowered with quantum-enhanced abilities. X.A.N.A can also create polymorphic spectres, empowered versions of its ghost creatures that take the form of human beings.\n:The only known physical incarnation of X.A.N.A. appeared in season 1, in the episode titled \"Ghost Channel,\" where after having its disguise as Jeremy being exposed, he transformed into a demonic [[caricature]] figure of Jeremy and tried to kill all of the Warriors. X.A.N.A.'s voice was provided by [[David Gasman]] in this episode.\n\n:Towards the end of the series, X.A.N.A. starts taking control of other supercomputers around the world and creating new virtual worlds within them, single-Sector copies of Lyoko called \"Replikas\". It then uses the resources of the supercomputer on Earth to build armies of robots that it intends to use to take over the world. However, X.A.N.A. is defeated by a multi-agent program created by Jeremy before it can put its plan into action.\n\n'''Monsters'''\n:There are many types of monsters in Lyoko that X.A.N.A. virtualizes to guard the towers it activates, fight the group, and do other tasks on Lyoko. The monsters generally seem to be organic/mechanical creatures with different traits of various animals and insects.\n:X.A.N.A. has many types of monsters: Kankrelats, Hornets, Bloks, Krabs, Megatanks, Tarantulas, Creepers, Mantas, the Scyphozoa, and the Kolossus. There are also Guardians, glowing spheres that are able to trap people inside them. These monsters can be destroyed by hitting the Eye of X.A.N.A. on their bodies. X.A.N.A. can also program monsters in the Digital Sea, such as Kongers, Sharks, and the Kalamar. These monsters are fought using torpedoes shot from the Skidbladnir or Navskids.\n\n===Recurring characters===\n\n'''Elisabeth \"Sissi\" Delmas'''\n:Voiced by: [[Carole Baillien]] (French); [[Christine Flowers]] and Jodi Forrest (English)\n:The principal's daughter and a Kadic student. She is a mean, spoiled, conceited, and somewhat popular girl who has a crush on Ulrich. Sissi and Odd quite often make fun of each other, with Odd making clever comebacks whenever Sissi says something rude or whenever they need her to go away. After Aelita is first materialized, she often does the same. Sissi tends to make fun of and openly insult Yumi in particular, mostly due to Ulrich liking Yumi more than her. Sissi is often followed by Herb and Nicolas, whom she often shows resentment towards, but uses them to her advantage anyway. She was initially part of the gang and knew about Lyoko, but was kicked out after breaking her oath to keep the Supercomputer a secret. Her memories of Lyoko were subsequently erased. Sissi also shows a dislike for her full name, Elisabeth, often making sounds of disgust when it's mentioned.\n\n'''Herb Pichon''' ''(French: Hervé Pichon)''\n:Voiced by: [[Carole Baillien]] (French); [[David Gasman]] (English)\n:An eighth grader at Kadic and a classmate to the Lyoko Warriors. He is the second-in-command of Sissi's gang, and sometimes even the boss in times of emergency when Sissi proves to be incompetent, as he is the most intelligent member of their group. Herb is also shown to be in love with Sissi, although he doesn't tell her because of her crushes on various boys, most notably Ulrich. He is the second-best student in his class after Jeremy and the two often compete with each other, but Herb is almost always the loser. Herb is also shown to be easily scared off, quick to run away when something troubling happens.\n\n'''Nicolas Poliakoff'''\n:Voiced by: [[Carole Baillien]] (French); Matthew Géczy (English)\n:An eighth grader at Kadic. He is the third member of Sissi's gang. He usually does not show much intelligence, which is commonly conveyed through his frequent use of pauses and uhs in speech. He usually only does things when Sissi orders him to, and will otherwise not do much on his own. Nicolas also has also been shown to have a crush on Aelita, although he never acts on it. He can play the drums, and was in the Pop Rock Progressives, a band started by Odd. He is generally more tolerant of and less rude toward the Lyoko Warriors than Herb and Sissi are. In some episodes, it is shown that he has at least some degree of intelligence, as he wrote a script for a performance of [[Romeo and Juliet]]. Nicolas is also shown to be as easily frightened as Herb is.\n\n'''Jean-Pierre Delmas'''\n:Voiced by: Bruno Mullenaerts (French); Allan Wenger (English)\n:The principal of Kadic Academy, who is easily controlled by his daughter Sissi. He can be stubborn and incredibly ignorant at times, especially when members of the Lyoko Warriors are trying to convince him of any dangerous activity caused by X.A.N.A.. His appearance is based on [[Hayao Miyazaki]].\n\n'''Jim Morales''' ''(French: Jim Moralès)''\n:Voiced by: Frédéric Meaux (French); [[David Gasman]] (English)\n:The physical education teacher at Kadic Academy and the chief disciplinarian. He is frequently mentioned to have had an extensive job history, although whenever it comes up, he almost always ends up dismissing it. Jim is often shown to digress from his lectures as he starts to reminisce on stories of his past, usually before being interrupted by someone or cutting himself off. On several occasions, Jim has discovered the existence of Lyoko or X.A.N.A. and displayed his helpfulness and willingness to keep it a secret, however his memories are always erased through the use of a \"Return to the Past.\" One of his more notable secrets is that he once starred in a film called \"Paco, the King of Disco.\"\n\n'''Suzanne Hertz'''\n:Voiced by: Nathalie Stas (French); Jodi Forrest (English)\n:Usually referred to as Mrs. Hertz, she's a science teacher at Kadic. She is the most shown primary academics teacher in the series, and appears to teach most branches of science at Kadic. She is also the only faculty member shown to organize field trips, which happens on several occasions. She has been shown to dislike or be disappointed in Odd and Ulrich, but takes a liking to Jeremy, and later Aelita.\n\n'''<!--Unless you can provide a canon source that says Milly's name really is Amelia, do not edit her name-->Milly Solovieff and Tamiya Diop'''\n:The sole members of the Kadic News crew, who are both are in sixth grade and share a dorm room. Tamiya seems to be less driven by her emotions, which allows her to think more clearly than Milly when bad things happen to them.\n\n'''Hiroki Ishiyama'''\n:Yumi's younger brother. He is often shown pestering her about things and purposely being annoying, such as asking her to do his homework or mentioning her feelings for Ulrich. He is frequently shown playing on a [[Game Boy|handheld gaming device]], and is often shown with his friend, Johnny. Hiroki has, on occasion, assisted Yumi when she needed it, although he usually requires some form of bribe.\n\n'''Takeho and Akiko Ishiyama'''\n:The parents of Yumi and Hiroki. Takeho is shown to be a fairly typical semi-strict busy father, and works for a local branch of a Japanese company. Akiko is depicted as a typical non-working housewife, and is generally the first one to ask Yumi if something is wrong. When her parents appear in an episode, it usually focuses on Yumi's family issues.\n\n===Supporting characters===\n'''Franz Hopper'''\n:Voiced by: Mathieu Moreau (French); Paul Bandey (English)\n:Full name '''Waldo Franz Schaeffer''', he is the creator of both Lyoko and X.A.N.A., and was involved in the creation of Project Carthage. His wife Anthea was kidnapped by men in black suits and he was forced to flee with his young daughter Aelita. The two went to live in a house called the Hermitage, located in a park near Kadic Academy and the abandoned factory. While working as a science teacher at the school, he constructed the Supercomputer in the factory, and programmed X.A.N.A. and the virtual world of Lyoko within it. When the men in black suits tracked him down again, he took Aelita to the factory and virtualised her onto Lyoko with him, where he believed they would be safe. However, X.A.N.A. refused to obey its creator's orders or live in peace alongside Franz and his daughter. Franz was forced to shut the Supercomputer down, until it was eventually discovered by Jeremy nearly ten years later. In one of the final episodes of the show, he sacrifices himself to allow Jeremy to finally defeat X.A.N.A.\n\n== Development ==\n[[File:GarageKidsPoster.png|thumbnail|left|2001 original promotional poster for ''Garage Kids'']]\n\n=== Origins ===\n''Code Lyoko'' originates from the film short ''Les enfants font leur cinéma'' (\"The children make their movies\"), directed by [[Thomas Romain]] and produced by a group of students from Parisian visual arts school [[Gobelins School of the Image]].<ref name=\"CLAnimeland\">{{cite web|url=http://www.animeland.com/articles/voir/84/Bilan-d-apprentissage|title=Bilan d’apprentissage|language=French|trans-title=Learning Assessment|website=AnimeLand.Com |date=2002-06-01|access-date=2011-06-13|quote= Aujourd’hui ce projet porte le nom de Garage Kid}}</ref> Romain worked with Tania Palumbo, Stanislas Brunet, and Jerome Cottray to create the film, which was screened at the [[Annecy International Animated Film Festival|2000 Annecy International Animated Film Festival]].<ref>{{cite web|title=Gobelins - Films d'Annecy 1999/2000/2001 (relativement inédits)|url=http://www.catsuka.com/news_detail.php?id=1301754897|website=Catsuka|accessdate=2011-06-13|language=French|date=2011-04-02}}</ref> French animation company [[MoonScoop Group#Subsidiaries|Antefilms]] offered Romain and Palumbo a contract as a result of the film. This led to the development of the pilot, ''Garage Kids''.<ref name=\"CLAnimeland\" />\n\n''Garage Kids'' was first released in 2001. The project was created by Palumbo, Romain, and Carlo de Boutiny and developed by Anne de Galard. Its producers were Eric Garnet, Nicolas Atlan, Benoît di Sabatino, and Christophe di Sabatino. The project was produced by Antefilms.\n\nSimilar to its succeeding show ''Code Lyoko'', ''Garage Kids'' was originally intended to be a 26-episode miniseries detailing the lives of four French boarding school students who discover the secret of the virtual world of Xanadu; created by a research group headed by a character known as the \"Professor\". The pilot featured both traditional animation and CGI.<ref>{{cite web|title=Antefilms presents Garage Kids|url=http://www.codelyoko.net/FRA/Garage_Kids/Garage_Kids.pdf|website=codelyoko.net|publisher=Antefilms|accessdate=2011-06-13|date=2002-03-12}}</ref>\n\n''Garage Kids'' eventually evolved into ''Code Lyoko'', which began broadcast in 2003 on [[France 3]] and 2004 on [[Cartoon Network]], with the virtual world renamed to \"Lyoko.\" Romain, however, left the show to work on the Japanese anime series ''[[Ōban Star-Racers]]''.\n\nThe factory and boarding school are based on real locations in France. The factory was based on a [[Renault]] production plant in [[Boulogne-Billancourt]], which has since been demolished.<ref>{{cite web|url=http://en.codelyoko.fr/inspirations/usine_renault.cl|title=Sources of inspiration > The factory in real life|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref> The school, Kadic Academy, is based on [[Lycée Lakanal]] in [[Sceaux, Hauts-de-Seine|Sceaux]].<ref>{{cite web|url=http://en.codelyoko.fr/inspirations/lakanal.cl|title=Sources of inspiration > Lycée Lakanal: Kadic Academy's model|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref>\n\n== Broadcast ==\nThe series premiered on [[France 3]] on 3 September 2003 and ended on 10 November 2007 in France. In the United States, the series premiered on 19 April 2004 on [[Cartoon Network]]. The second season started on 19 September 2005. The two-part ''XANA Awakens'' prequel aired on 2–3 October 2006, and the third season started a day later on 4 October 2006. The fourth and final season began on 18 May 2007. The last episode aired on Cartoon Network was \"[[List of Code Lyoko episodes#ep88|Cousins Once Removed]]\", and the remaining seven episodes were released online at Cartoon Network video. When the series aired on Cartoon Network, it was simultaneously both part of its after-school weekday afternoon action animation lighter-toned programming block, Miguzi from 2004 to 2007, and also a standalone show on its primetime timeslot. The show aired on [[Kabillion]] from 2007 to 2015.\n\nThe show also aired in Latin America and [[Japan]] on [[Jetix]]. In Italy, the show aired on [[Disney Channel (Italy)|Disney Channel]] and was published on DVD by [[Delta Pictures]] under the label [[20th Century Fox Home Entertainment]].\n\nAll four seasons were made available on Netflix on 6 August 2012, but have since been removed for unknown reasons. Since 2015, all of the English dubbed episodes (including the prequel ''XANA Awakens'') are currently viewable on [[YouTube]].\n\n== Accolades ==\nThe series received mostly positive reviews. ''Code Lyoko'' was voted as the best show by Canal J viewers in France,<ref>{{cite web|title=Code Lyoko Game Coming to DS|url=http://www.nintendoworldreport.com/newsArt.cfm?artid=10825|website=Nintendo World Report|date=2005-09-30}}</ref> and has achieved international fame as well; the show has been rated as one of the best shows on Cartoon Network and Kabillion in the United States, with Cartoon Network having it rated as the #3 best performing show in 2006<ref name=\":7\">CL Presentation MIPTV 2012 2012-04-19. Retrieved 2012-04-19.</ref><ref name=\"mipcom\">{{cite web|title=CL Presentation MIPCOM 09 [Lecture seule]|url=http://www.codelyoko.fr/files/cl_mipcom_09.pdf|website=CodeLyoko.Fr|publisher=Moonscoop|accessdate=2016-07-24}}</ref> and Kabillion having it as #4 in monthly average views in 2010.<ref name=\"mipcom\"/> The show has reached success in Spain as one of [[Clan TVE]]'s highest rated shows,<ref name=\"mipcom\"/> on Italy's Rai2 network,<ref name=\"mipcom\"/> and in Finland and the United Kingdom as well. The show also won France's Prix de l'Export 2006 Award for Animation in December 2006.<ref>{{cite web|title=French TV Prix for three|url=http://www.hollywoodreporter.com/news/french-tv-prix-three-146256|website=Hollywood Reporter|accessdate=2016-07-24|date=2006-12-13}}</ref>\n\n== Merchandise ==\nSeveral ''Code Lyoko'' products have been released, including DVDs, a series of cine-manga by [[Tokyopop]], a series of four novels by Italian publisher Atlantyca Entertainment, apparel and other accessories. In 2006, Marvel Toys released a line of ''Code Lyoko'' toys and action figures.\n\nWhen the series started to come to an end in 2007, [[The Game Factory]] released three video games based on the show: ''[[Code Lyoko (video game)|Code Lyoko]]'' and ''[[Code Lyoko: Fall of X.A.N.A.]]'' for the [[Nintendo DS]], and ''[[Code Lyoko: Quest for Infinity]]'' for the [[Wii]], [[PlayStation Portable|PSP]], and [[PlayStation 2]]. The games were met with mixed to positive reviews from critics despite some criticisms of gameplay. There have been other games released through various mediums, one being Facebook.<ref name=\"mipcom\"/><ref>{{cite web|title=Code Lyoko cracks the social gaming space|url=http://kidscreen.com/2011/11/21/code-lyoko-cracks-the-social-gaming-space/|website=Kidscreen|accessdate=2011-11-21|date=2011-11-21}}</ref>\n\nA series of Clan TVE festivals in Spain included live stage shows based on Code Lyoko among other things.<ref>{{cite web|title=El Festival del Clan en vídeo [Código Lyoko] (2011)|url=https://codigolyokoespain.blogspot.com.au/2012/01/blog-post.html|website=Código Lyoko España|accessdate=2017-01-11|language=Spanish|date=2012-01-26}}</ref> A game show known as Code Lyoko Challenge was planned to be released in late 2012, but fell through.<ref name=\"mipcom\" />\n\nIn January 2011, all four seasons of ''Code Lyoko'' were released on iTunes in the US and in France by Moonscoop Holdings, although as of May 2019 only seasons 1 and 2 are available and other seasons have been removed. In October 2011, all four seasons were released on Amazon Instant Streaming and on DVD in the USA, however these DVDs are now out of print.<ref>{{cite web|title=Code Lyoko|url=https://www.facebook.com/CodeLyoko/posts/259449940753800|website=Facebook|accessdate=2011-12-10|date=2011-08-16}}</ref>\n\n=== Book series ===\nA series of four chapter books was released by Atlantyca Entertainment and distributed in Italy and other countries. The novels delve deeper into the unanswered questions of the series. Taking place after the end of the series, X.A.N.A. has miraculously survived and returns, though weakened and initially missing its memories. X.A.N.A. possesses Eva Skinner, an American girl, and travels to France in order to infiltrate the gang and kill them off. Unaware of their enemy's presence, the group works to find clues about Aelita's past, left by her father Franz Hopper, and confirm whether or not her mother is still alive somewhere. But at the same time, a terrorist group, the Green Phoenix, has become interested in the supercomputer and intend to use both it and the virtual world of Lyoko for evil purposes.\n\nIt was confirmed that the series will never be released officially in English, nor the final two books released in French. However, some time later, a fan community came together and sought to not only finish the series but translate it into more languages, including English. They have since completed their work and made it available for free download in September 2014.<ref>{{cite web|url=http://en.codelyoko.fr/chronicles/chronique.cl|title=Chronicles > Chronicle of a translation|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref>\n\n== See also ==\n{{portal|Animation|France|Television|2000s}}\n* [[List of French animated television series]]\n* [[List of French television series]]\n*[[Tron]]\n*[[Gridman the Hyper Agent]]\n*[[Superhuman Samurai Syber-Squad]]\n*[[Digimon Adventure]]\n*[[Zixx]]\n*[[ReBoot: The Guardian Code]]\n\n== Notes ==\n{{notelist}}\n\n== References ==\n{{reflist|30em}}\n\n== External links ==\n{{Wikiquote}}\n* {{IMDb title|0417311|Code Lyoko}}\n\n{{Code Lyoko}}\n{{portal bar|Animation|Speculative fiction/Science fiction|}}\n\n[[Category:Code Lyoko| ]]\n[[Category:2000s French animated television series]]\n[[Category:2003 French television series debuts]]\n[[Category:2007 French television series endings]]\n[[Category:Artificial intelligence in fiction]]\n[[Category:French computer-animated television series]]\n[[Category:French children's animated action television series]]\n[[Category:French children's animated adventure television series]]\n[[Category:French children's animated science fiction television series]]\n[[Category:Television series about time travel]]\n[[Category:Fiction about mind control]]\n[[Category:Television series about parallel universes]]\n[[Category:Television series about robots]]\n[[Category:Television programs about spirit possession]]\n[[Category:Virtual reality in fiction]]\n[[Category:Anime-influenced Western animation]]\n[[Category:Television shows set in Paris]]\n[[Category:Television series by Splash Entertainment]]\n[[Category:Malware in fiction]]\n[[Category:French animated television programs featuring anthropomorphic characters]]",
            "slug": "code-lyoko",
            "date_updated": 1565237023620,
            "imported": "https://en.wikipedia.org/wiki/Code_Lyoko"
        },
        {
            "title": "Code Lyoko",
            "text": "{{Use dmy dates|date=February 2011}}\n{{Infobox television\n| show_name                = Code Lyoko\n| image                    = Code Lyoko logo.png\n| caption                  = \n| genre                    = <!-- Do not add anything here unless it is reliably sourced (provide a reference). Do not remove this note without a reason given. -->[[Action film|Action]]/[[Adventure fiction|adventure]]<br/>[[Science fiction]]<ref name=\"mediatoon\">{{cite web|url=http://www.mediatoon-distribution.com/en/catalog/186/code-lyoko/|title=Code Lyoko|website=Mediatoon Distribution|accessdate=2016-02-26}}</ref><!-- Do not add anything here unless it is reliably sourced (provide a reference). Do not remove this note without a reason given. --><br />[[Drama]]\n| creator                  = Tania Palumbo<br />[[Thomas Romain]]\n| writer                   = Sophie Decroisette\n| director                 = Jérôme Mouscadet\n| starring                 = Sharon Mann<br />Matthew Géczy<br />Barbara Scaff<br />Mirabelle Kirkland<br />[[David Gasman]]<br />Jodi Forrest<br />Allan Wenger<br />Paul Bandey<br />Christine Flowers\n| theme_music_composer     = Franck Keller<br />Ygal Amar\n| opentheme                = \"Un monde sans danger\" (\"A World Without Danger\") by Julien Lamassonne (sung in English by [[Noam Kaniel]])\n| endtheme                 = \"A World Without Danger\" (Instrumental) {{small|Season 1}}<br />\n \"Break Away\" (Instrumental) by Subdigitals {{small|Seasons 2–4}}\n| composer                 = Serge Tavitian<br />Herman Martin\n| country                  = France\n| num_seasons              = 4\n| num_episodes             = 97<ref name=\"mediatoon\" />{{efn|Includes the two-part prequel titled \"XANA Awakens\".}}\n| list_episodes            = List of Code Lyoko episodes\n| executive_producer       = Nicolas Atlan<br/>Christophe di Sabatino<br/>Benoît di Sabatino\n| producer                 = Nicolas Altan\n| runtime                  = 26 minutes<ref name=\"mediatoon\" />\n| company                  = Antefilms (episodes 1-26)<br/>[[MoonScoop Group]] (episodes 27-97)<br/>[[Ellipsanime]]\n| distributor              = [[Taffy Entertainment]]\n| network                  = [[France 3]]<!-- Do not add Cartoon Network to this section, as this show was made in France and not in the United States, and do not remove this note without a reason given. -->\n| picture_format           = {{Plainlist|\n*[[576i]] ([[4:3]] [[SDTV]])}}\n| first_aired              = {{Start date|2003|09|03|df=y}}\n| last_aired               = {{End date|df=yes|2007|11|10}}\n| preceded_by              = \n| followed_by              = ''[[Code Lyoko: Evolution]]''\n| website                  = \n| image_alt                = \n| channel                  = \n| first_run                = \n| released                 = \n}}\n\n'''''Code Lyoko''''' is a French [[animated series|animated television series]] created by [[Thomas Romain]] and Tania Palumbo and produced by the [[MoonScoop Group]] for [[France 3]]. The series centers on a group of teenagers who travel to the virtual world of Lyoko to battle against a malignant [[artificial intelligence]] known as X.A.N.A. who threatens Earth. The scenes in the real world are presented in [[traditional animation|2D hand-drawn animation]], while the scenes in Lyoko are presented in [[computer-generated imagery|CGI animation]].\n\nThe series began its first, 97-episode run on 3 September 2003, on France's [[France 3]], and ended on 10 November 2007. It started airing in the United States on 19 April 2004 on [[Cartoon Network]].\n\n''Code Lyoko'' aired every day on Cartoon Network, in the [[Miguzi]] programming block, at 5:30 P.M. U.S. Eastern Time, sometimes showing two episodes consecutively, in the cases of season finales.\n\nOn 31 May 2011, the MoonScoop Group announced on its Facebook page that the show would be returning for a fifth season. This follow-up series was officially named ''[[Code Lyoko: Evolution]]'', which began airing at the end of 2012. This \"continuation\" to the series featured live action sequences for scenes taking place in the real world instead of its traditional 2D animation, but retained the iconic CGI for scenes taking place in Lyoko, now with an updated style. The show consisted of 26 episodes with the final episode airing in late 2013, leaving off on a cliffhanger with no second season planned as Moonscoop filed for bankruptcy in 2014.\n\n== Plot ==\nJeremy Belpois, a 12-year-old prodigy attending boarding school at Kadic Academy, discovers a quantum [[supercomputer]] in an abandoned factory near his school. Upon activating it, he discovers a virtual world called Lyoko with an [[artificial intelligence|artificially intelligent]] girl named Aelita trapped inside it. Jeremy learns of X.A.N.A., a fully autonomous, malevolent, and highly intelligent [[multi-agent system]], that also dwells within the Supercomputer. Using Lyoko's power, X.A.N.A is able to possess electronics and machinery (and later, people) in the real world to wreak havoc. X.A.N.A.'s primary objective is to eliminate anyone who's aware of the supercomputer's existence, so that it will be free to conquer the real world and enslave all human beings.\n\nJeremy works tirelessly to materialize Aelita into the real world and stop attacks caused by X.A.N.A. Jeremy is aided by his three friends Odd Della Robbia, Ulrich Stern, and Yumi Ishiyama, who are virtualized into Lyoko in order to save both worlds from the sinister virtual entity. They achieve this by escorting Aelita to various towers on Lyoko, which serve as interface terminals between Lyoko and Earth, and having her deactivate the one that X.A.N.A. is using to access the real world. Once the tower is deactivated, Jeremy is able to launch a \"Return to the Past\" program, which sends anyone scanned into the Supercomputer's memory back in time, whilst retaining memory of the other timeline, to undo any damage caused by X.A.N.A. (the only exception of this are any deaths caused by the attack, which would carry over even with the time reversion). In \"Code: Earth,\" Aelita is finally materialized, but the group discovers that X.A.N.A. had planted a virus inside of her that will kill her if the Supercomputer is deactivated. They realize that they cannot destroy X.A.N.A. completely, or Aelita will be destroyed along with it.\n\nAelita adjusts to life in the real world, while Jeremy attempts to develop an anti-virus program for her in an attempt to fully liberate her from X.A.N.A.'s power. On Lyoko, a fifth sector is discovered and the group explores more of Lyoko's secrets and mysteries. The gang begins to uncover information about a mysterious man named Franz Hopper, who went missing ten years ago. He supposedly created the Supercomputer, Lyoko, and X.A.N.A., and is eventually discovered to be Aelita's father. They finally find out that Franz Hopper is indeed alive somewhere, hiding deep within the uncharted parts of Lyoko to avoid X.A.N.A. further. All the while, X.A.N.A. attempts to steal Aelita's memory using a special monster, the Scyphozoa, in order to gain the Keys to Lyoko and free itself.\n\nAt the end of the season, Aelita and Jeremy discover that Aelita is actually human and does not have a virus, and instead is missing a fragment of herself. In \"The Key,\" X.A.N.A. tricks them with a fake fragment and succeeds in stealing Aelita's memory and escaping the Supercomputer into the World Wide Web, which exists in the Digital Sea outside of Lyoko. Aelita appears to perish as a result, but is revived when Franz Hopper gives her his faction of the Keys to Lyoko and restores her missing fragment: the memories of her forgotten childhood before she was virtualized on Lyoko.\n\nSince succeeding in escaping the confinements of the supercomputer, X.A.N.A. changes tactics by destroying each of Lyoko's surface sectors, until only Carthage (Sector 5) is left. Initially reluctant, the Lyoko Warriors make the decision to invite William Dunbar as the sixth member. However, shortly after being virtualized, he is possessed by X.A.N.A. via the Scyphozoa. Shortly after, he destroys the Core of Lyoko, destroying the entire virtual world and rendering the group unable to fight X.A.N.A., putting the entire real world in danger. After what they thought was their defeat, Jeremy receives a coded message from Franz Hopper that allows him to recreate Lyoko and continue the fight against X.A.N.A.\n\nJeremy and Aelita construct a digital submarine, the Skidbladnir (commonly referred to as the \"Skid\"), to travel across the Digital Sea to destroy X.A.N.A.'s \"Replikas,\" which are copies of Lyoko's sectors that are linked to X.A.N.A.-controlled supercomputers on Earth, all created for its goal of world domination. X.A.N.A. uses William as its general throughout the season to defend the Replikas, and sabotage the Lyoko Warriors in any way he can. To prevent suspicion regarding William's disappearance, Jeremy manages to program a spectre to take William's place at Kadic, although the clone has very low-level intelligence and acts very moronic. Near the end of the season, X.A.N.A. decides to draw energy from all of its Replikas to create the Kolossus, a gigantic, seemingly-invincible monster that later destroys the Skidbladnir. Before it is destroyed, Jeremy frees William from X.A.N.A.'s control. After his return, he has a difficult time gaining the trust of the group. While Ulrich defeats the Kolossus, Franz Hopper sacrifices himself in order to power Jeremy's \"anti-X.A.N.A. program,\" which destroys X.A.N.A. upon activation. Shortly after, the group, albeit reluctant due to their nostalgia, decides to shut down the Supercomputer.\n\n== Episodes ==\n{{Main|List of Code Lyoko episodes}}\n{{:List of Code Lyoko episodes}}\n\n== Characters ==\n===Main (Lyoko Warriors)===\n<!-- Deleted image removed: [[File:Code lyoko.jpg|thumb|183x183px|L to R: Aelita, Ulrich, Yumi, Odd with Kiwi, Jeremy.]] -->\n'''Jeremy Belpois''' ''(French: Jérémy Belpois; formerly Jeremie (French: Jérémie) in season 1)''\n:Voiced by: Raphaëlle Bruneau (French); Sharon Mann (English)\n:A 12-year-old top-of-the-class student who finds and starts the factory's [[supercomputer]] while looking for parts to build a robot. By turning on the Supercomputer, he reawakened Aelita, the virtual world of Lyoko, and the malevolent [[multi-agent system]] X.A.N.A.. His goals are mainly driven by his desire to protect Aelita and to save her from the Supercomputer and X.A.N.A. by materialising her on Earth. As part of the group, he specializes in programming new ways to defeat X.A.N.A. and monitors the group while they are on Lyoko. Because he is not very athletic and is more computer savvy, Jeremy almost never goes to Lyoko, only going there once and vowing to never do it again. His workaholic attitude occasionally puts a strain on his relationships with the other members of the group.\n\n'''Aelita Schaeffer'''\n:Voiced by: Sophie Landresse (French); Sharon Mann (English)\n:Mainly known by her alias '''Aelita Stones''', Aelita is the smartest of the group alongside Jeremy. At the beginning of the series she was trapped on Lyoko, inside the Supercomputer. She was originally thought to be an [[artificial intelligence|AI]] until it was revealed that she's actually the daughter of Franz Hopper, the creator of Lyoko. As a little girl, she lost her mother. When a group of suited men came to her home, she and her father fled and virtualized themselves on Lyoko. Between the virtualization and Jeremy's discovery of the Supercomputer, X.A.N.A. stole an important memory fragment that inhibited her from becoming fully human again. After this fragment is retrieved, she is no longer linked to the Supercomputer. After becoming human, she often has nightmares of her past life. She enrolls as a boarder at Kadic under the name Aelita Stones, claiming to be Odd's cousin. She reciprocates Jeremy's feelings for her, but he often strains their relationship by overlooking Aelita and her passions in favor of working on the Supercomputer. \n:Aelita is the only one capable of deactivating towers on Lyoko to stop X.A.N.A.'s attacks. On Lyoko, she has an elf-like appearance, similar to that of \"Mr. Pück,\" a toy elf from her childhood. She has the \"power of creation:\" the ability to create or remove objects, such as rocks or bridges, from the virtual environment. She had no weapons or defence until season 3 of the show, when she developed the ability to use \"energy fields,\" pink balls of plasma that can be thrown or used to block enemy fire. In season 4, Jeremy programs light pink angel wings as part of her new virtual attire, allowing her to fly.\n\n'''Odd Della Robbia'''\n:Voiced by: Raphaëlle Bruneau (French); Matthew Géczy (English)\n:The comic relief of the group. Odd is credited as having great potential when it comes to school, but rarely uses it, and gets bad grades due to his lack of studying. He shares a dorm with Ulrich and has a dog named '''Kiwi''', who he hides in a dresser because pets aren't allowed at Kadic. He's considered a ladies' man and has dated many of the girls at his school, but his romances tend to last only a few days. Before he attended Kadic, he lived with his parents and his five sisters. Odd's blond hair has a purple spot and is worn up in a spike. \n:On Lyoko, he is clothed like a cat, with a tail and clawed gloves that shoot \"[[arrowhead|laser arrows]].\" In season 1 he had a [[precognition|precognitive]] power named \"Future Flash\", but it was deleted before season 2. In season 2, Odd gains the ability to summon a purple shield by crossing his arms in front of his body. Another one of Odd's abilities is being able to use his claws to climb on walls.\n\n'''Ulrich Stern'''\n:Voiced by: Marie-Line Landerwijn (French); Barbara Weber-Scaff (English)\n:A more reserved member of the group, Ulrich has a hard time sharing his feelings. His parents pressure him to achieve well in school, but he has difficulty learning and living up to their expectations. In his off-time he practices [[Pencak silat]] with Yumi, whom he has a crush on. He suffers from [[vertigo]], which makes it hard to participate in activities such as rock climbing.\n:On Lyoko, he wears a yellow and brown outfit inspired by Japanese [[samurai]]. His main weapon is a [[katana]], and can dual wield them. His \"Supersprint\" ability allows him to dash at high speed, and his \"Triplicate\" power lets him create two clones of himself. He can combine these abilities in a technique called \"Triangulate,\" using his clones to form a triangle around an enemy and ambush it.\n\n'''Yumi Ishiyama'''\n:Voiced by: Géraldine Frippiat (French); [[Mirabelle Kirkland]] (English)\n:A fairly reserved student who lives near and attends Kadic. She is the oldest of the group. She is of [[Japanese people|Japanese]] descent, and has one younger brother, Hiroki. Because of her parents and culture, she must maintain good grades and observe family values. At home, she generally has to deal with marital issues between her parents. She is a friend of William Dunbar, who transferred to Kadic during season 2. She practices [[pencak silat]] with Ulrich, whom she has a crush on, though it's not as obvious as Ulrich's crush on her. She always wears black and has enough basic knowledge of the Supercomputer to operate it in Jeremy and Aelita's absence.\n:On Lyoko, Yumi is dressed in a [[geisha]]-inspired outfit with an [[obi (sash)|obi]] sash. Her main weapon is a tessen fan, and her power is [[telekinesis]], allowing her to move objects with her mind.\n\n'''William Dunbar'''\n:Voiced by: Mathieu Moreau (French); [[David Gasman]] (English)\n:An overconfident student who starts attending Kadic Academy after he was expelled from his previous school for vandalism. Yumi befriends him and he soon develops feelings for her. He often fights with Ulrich for Yumi's attention and is sometimes disrespectful of Yumi's boundaries, causing her to become frustrated with his unwanted advances. After proving helpful to the group out during several X.A.N.A. attacks, they vote on whether he should be allowed to join the group, but Yumi votes no and his memory is erased. Eventually, however, the vote becomes unanimous when William's membership is deemed necessary.\n:On his first mission on Lyoko, William is captured and possessed by X.A.N.A., who ensnares William as its puppet. From that point on, a clone of William, created by Jeremy, is used to pose as the real William until Jeremy is able to free him. Unfortunately, Jeremy's program is imperfect, causing the William clone to act either unintelligent or unpredictable. Near the end of the series the clone starts developing several human-like traits, which he eventually uses to help the warriors. Towards the end of the series, William is finally released from X.A.N.A.'s control.\n:On Lyoko, William wears a white outfit and carries a giant sword, which can release [[shock waves]]. Under X.A.N.A.'s control his outfit turns black and he gains a spiked gauntlet on his wrist, which can be used for defence. He has an array of powers including enhanced strength; \"Supersmoke,\" which allows him to transform into a cloud of black smoke and move around at great speed, eventually gaining the ability to fly as well; a [[second sight]] allowing him to see across great distances; and levitation. X.A.N.A. sends William to stop the Lyoko Warriors on the virtual world, and thanks to his various powers, he proves to be a formidable opponent.\n\n===Antagonists===\n\n'''X.A.N.A.'''\n:Sometimes known as XANA, it is a powerful multi-agent system that serves as the main antagonist of the series. It was originally created by Franz Hopper to destroy Project Carthage: a military software system that Franz Hopper had previously been involved with. He mentions that his motives were to prevent the French government from obtaining access to Project Carthage. Unfortunately, due to his repeated Returns to the Past, X.A.N.A. grew stronger and smarter until it eventually became sentient, choosing to rebel against Franz. It then trapped Franz and his daughter Aelita inside Lyoko. Luckily, Franz was able to shut down the Supercomputer to trap X.A.N.A. and stop it from wreaking havoc in the real world.\n\n:X.A.N.A. displays no mercy towards those who stand in its way, waging attacks through Lyoko on the real world, often attempting mortal harm against the main characters. Being a computer program, X.A.N.A. has no actual physical form. Instead, X.A.N.A. activates Lyoko structures called \"towers\" to access the real world, unleashing spectres from outlets to possess objects, natural forces, and animals to launch attacks on Earth, while sending monsters to fight its enemies on Lyoko. Objects and forces controlled by X.A.N.A. are marked with a symbol called the Eye of X.A.N.A., symbolizing its influence over them. Partway through the series, it gains the ability to possess human beings to do its bidding on Earth. Whenever a human is possessed by X.A.N.A., that person does what it commands and becomes pixelized, their forms altered and empowered with quantum-enhanced abilities. X.A.N.A can also create polymorphic spectres, empowered versions of its ghost creatures that take the form of human beings.\n:The only known physical incarnation of X.A.N.A. appeared in season 1, in the episode titled \"Ghost Channel,\" where after having its disguise as Jeremy being exposed, he transformed into a demonic [[caricature]] figure of Jeremy and tried to kill all of the Warriors. X.A.N.A.'s voice was provided by [[David Gasman]] in this episode.\n\n:Towards the end of the series, X.A.N.A. starts taking control of other supercomputers around the world and creating new virtual worlds within them, single-Sector copies of Lyoko called \"Replikas\". It then uses the resources of the supercomputer on Earth to build armies of robots that it intends to use to take over the world. However, X.A.N.A. is defeated by a multi-agent program created by Jeremy before it can put its plan into action.\n\n'''Monsters'''\n:There are many types of monsters in Lyoko that X.A.N.A. virtualizes to guard the towers it activates, fight the group, and do other tasks on Lyoko. The monsters generally seem to be organic/mechanical creatures with different traits of various animals and insects.\n:X.A.N.A. has many types of monsters: Kankrelats, Hornets, Bloks, Krabs, Megatanks, Tarantulas, Creepers, Mantas, the Scyphozoa, and the Kolossus. There are also Guardians, glowing spheres that are able to trap people inside them. These monsters can be destroyed by hitting the Eye of X.A.N.A. on their bodies. X.A.N.A. can also program monsters in the Digital Sea, such as Kongers, Sharks, and the Kalamar. These monsters are fought using torpedoes shot from the Skidbladnir or Navskids.\n\n===Recurring characters===\n\n'''Elisabeth \"Sissi\" Delmas'''\n:Voiced by: [[Carole Baillien]] (French); [[Christine Flowers]] and Jodi Forrest (English)\n:The principal's daughter and a Kadic student. She is a mean, spoiled, conceited, and somewhat popular girl who has a crush on Ulrich. Sissi and Odd quite often make fun of each other, with Odd making clever comebacks whenever Sissi says something rude or whenever they need her to go away. After Aelita is first materialized, she often does the same. Sissi tends to make fun of and openly insult Yumi in particular, mostly due to Ulrich liking Yumi more than her. Sissi is often followed by Herb and Nicolas, whom she often shows resentment towards, but uses them to her advantage anyway. She was initially part of the gang and knew about Lyoko, but was kicked out after breaking her oath to keep the Supercomputer a secret. Her memories of Lyoko were subsequently erased. Sissi also shows a dislike for her full name, Elisabeth, often making sounds of disgust when it's mentioned.\n\n'''Herb Pichon''' ''(French: Hervé Pichon)''\n:Voiced by: [[Carole Baillien]] (French); [[David Gasman]] (English)\n:An eighth grader at Kadic and a classmate to the Lyoko Warriors. He is the second-in-command of Sissi's gang, and sometimes even the boss in times of emergency when Sissi proves to be incompetent, as he is the most intelligent member of their group. Herb is also shown to be in love with Sissi, although he doesn't tell her because of her crushes on various boys, most notably Ulrich. He is the second-best student in his class after Jeremy and the two often compete with each other, but Herb is almost always the loser. Herb is also shown to be easily scared off, quick to run away when something troubling happens.\n\n'''Nicolas Poliakoff'''\n:Voiced by: [[Carole Baillien]] (French); Matthew Géczy (English)\n:An eighth grader at Kadic. He is the third member of Sissi's gang. He usually does not show much intelligence, which is commonly conveyed through his frequent use of pauses and uhs in speech. He usually only does things when Sissi orders him to, and will otherwise not do much on his own. Nicolas also has also been shown to have a crush on Aelita, although he never acts on it. He can play the drums, and was in the Pop Rock Progressives, a band started by Odd. He is generally more tolerant of and less rude toward the Lyoko Warriors than Herb and Sissi are. In some episodes, it is shown that he has at least some degree of intelligence, as he wrote a script for a performance of [[Romeo and Juliet]]. Nicolas is also shown to be as easily frightened as Herb is.\n\n'''Jean-Pierre Delmas'''\n:Voiced by: Bruno Mullenaerts (French); Allan Wenger (English)\n:The principal of Kadic Academy, who is easily controlled by his daughter Sissi. He can be stubborn and incredibly ignorant at times, especially when members of the Lyoko Warriors are trying to convince him of any dangerous activity caused by X.A.N.A.. His appearance is based on [[Hayao Miyazaki]].\n\n'''Jim Morales''' ''(French: Jim Moralès)''\n:Voiced by: Frédéric Meaux (French); [[David Gasman]] (English)\n:The physical education teacher at Kadic Academy and the chief disciplinarian. He is frequently mentioned to have had an extensive job history, although whenever it comes up, he almost always ends up dismissing it. Jim is often shown to digress from his lectures as he starts to reminisce on stories of his past, usually before being interrupted by someone or cutting himself off. On several occasions, Jim has discovered the existence of Lyoko or X.A.N.A. and displayed his helpfulness and willingness to keep it a secret, however his memories are always erased through the use of a \"Return to the Past.\" One of his more notable secrets is that he once starred in a film called \"Paco, the King of Disco.\"\n\n'''Suzanne Hertz'''\n:Voiced by: Nathalie Stas (French); Jodi Forrest (English)\n:Usually referred to as Mrs. Hertz, she's a science teacher at Kadic. She is the most shown primary academics teacher in the series, and appears to teach most branches of science at Kadic. She is also the only faculty member shown to organize field trips, which happens on several occasions. She has been shown to dislike or be disappointed in Odd and Ulrich, but takes a liking to Jeremy, and later Aelita.\n\n'''<!--Unless you can provide a canon source that says Milly's name really is Amelia, do not edit her name-->Milly Solovieff and Tamiya Diop'''\n:The sole members of the Kadic News crew, who are both are in sixth grade and share a dorm room. Tamiya seems to be less driven by her emotions, which allows her to think more clearly than Milly when bad things happen to them.\n\n'''Hiroki Ishiyama'''\n:Yumi's younger brother. He is often shown pestering her about things and purposely being annoying, such as asking her to do his homework or mentioning her feelings for Ulrich. He is frequently shown playing on a [[Game Boy|handheld gaming device]], and is often shown with his friend, Johnny. Hiroki has, on occasion, assisted Yumi when she needed it, although he usually requires some form of bribe.\n\n'''Takeho and Akiko Ishiyama'''\n:The parents of Yumi and Hiroki. Takeho is shown to be a fairly typical semi-strict busy father, and works for a local branch of a Japanese company. Akiko is depicted as a typical non-working housewife, and is generally the first one to ask Yumi if something is wrong. When her parents appear in an episode, it usually focuses on Yumi's family issues.\n\n===Supporting characters===\n'''Franz Hopper'''\n:Voiced by: Mathieu Moreau (French); Paul Bandey (English)\n:Full name '''Waldo Franz Schaeffer''', he is the creator of both Lyoko and X.A.N.A., and was involved in the creation of Project Carthage. His wife Anthea was kidnapped by men in black suits and he was forced to flee with his young daughter Aelita. The two went to live in a house called the Hermitage, located in a park near Kadic Academy and the abandoned factory. While working as a science teacher at the school, he constructed the Supercomputer in the factory, and programmed X.A.N.A. and the virtual world of Lyoko within it. When the men in black suits tracked him down again, he took Aelita to the factory and virtualised her onto Lyoko with him, where he believed they would be safe. However, X.A.N.A. refused to obey its creator's orders or live in peace alongside Franz and his daughter. Franz was forced to shut the Supercomputer down, until it was eventually discovered by Jeremy nearly ten years later. In one of the final episodes of the show, he sacrifices himself to allow Jeremy to finally defeat X.A.N.A.\n\n== Development ==\n[[File:GarageKidsPoster.png|thumbnail|left|2001 original promotional poster for ''Garage Kids'']]\n\n=== Origins ===\n''Code Lyoko'' originates from the film short ''Les enfants font leur cinéma'' (\"The children make their movies\"), directed by [[Thomas Romain]] and produced by a group of students from Parisian visual arts school [[Gobelins School of the Image]].<ref name=\"CLAnimeland\">{{cite web|url=http://www.animeland.com/articles/voir/84/Bilan-d-apprentissage|title=Bilan d’apprentissage|language=French|trans-title=Learning Assessment|website=AnimeLand.Com |date=2002-06-01|access-date=2011-06-13|quote= Aujourd’hui ce projet porte le nom de Garage Kid}}</ref> Romain worked with Tania Palumbo, Stanislas Brunet, and Jerome Cottray to create the film, which was screened at the [[Annecy International Animated Film Festival|2000 Annecy International Animated Film Festival]].<ref>{{cite web|title=Gobelins - Films d'Annecy 1999/2000/2001 (relativement inédits)|url=http://www.catsuka.com/news_detail.php?id=1301754897|website=Catsuka|accessdate=2011-06-13|language=French|date=2011-04-02}}</ref> French animation company [[MoonScoop Group#Subsidiaries|Antefilms]] offered Romain and Palumbo a contract as a result of the film. This led to the development of the pilot, ''Garage Kids''.<ref name=\"CLAnimeland\" />\n\n''Garage Kids'' was first released in 2001. The project was created by Palumbo, Romain, and Carlo de Boutiny and developed by Anne de Galard. Its producers were Eric Garnet, Nicolas Atlan, Benoît di Sabatino, and Christophe di Sabatino. The project was produced by Antefilms.\n\nSimilar to its succeeding show ''Code Lyoko'', ''Garage Kids'' was originally intended to be a 26-episode miniseries detailing the lives of four French boarding school students who discover the secret of the virtual world of Xanadu; created by a research group headed by a character known as the \"Professor\". The pilot featured both traditional animation and CGI.<ref>{{cite web|title=Antefilms presents Garage Kids|url=http://www.codelyoko.net/FRA/Garage_Kids/Garage_Kids.pdf|website=codelyoko.net|publisher=Antefilms|accessdate=2011-06-13|date=2002-03-12}}</ref>\n\n''Garage Kids'' eventually evolved into ''Code Lyoko'', which began broadcast in 2003 on [[France 3]] and 2004 on [[Cartoon Network]], with the virtual world renamed to \"Lyoko.\" Romain, however, left the show to work on the Japanese anime series ''[[Ōban Star-Racers]]''.\n\nThe factory and boarding school are based on real locations in France. The factory was based on a [[Renault]] production plant in [[Boulogne-Billancourt]], which has since been demolished.<ref>{{cite web|url=http://en.codelyoko.fr/inspirations/usine_renault.cl|title=Sources of inspiration > The factory in real life|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref> The school, Kadic Academy, is based on [[Lycée Lakanal]] in [[Sceaux, Hauts-de-Seine|Sceaux]].<ref>{{cite web|url=http://en.codelyoko.fr/inspirations/lakanal.cl|title=Sources of inspiration > Lycée Lakanal: Kadic Academy's model|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref>\n\n== Broadcast ==\nThe series premiered on [[France 3]] on 3 September 2003 and ended on 10 November 2007 in France. In the United States, the series premiered on 19 April 2004 on [[Cartoon Network]]. The second season started on 19 September 2005. The two-part ''XANA Awakens'' prequel aired on 2–3 October 2006, and the third season started a day later on 4 October 2006. The fourth and final season began on 18 May 2007. The last episode aired on Cartoon Network was \"[[List of Code Lyoko episodes#ep88|Cousins Once Removed]]\", and the remaining seven episodes were released online at Cartoon Network video. When the series aired on Cartoon Network, it was simultaneously both part of its after-school weekday afternoon action animation lighter-toned programming block, Miguzi from 2004 to 2007, and also a standalone show on its primetime timeslot. The show aired on [[Kabillion]] from 2007 to 2015.\n\nThe show also aired in Latin America and [[Japan]] on [[Jetix]]. In Italy, the show aired on [[Disney Channel (Italy)|Disney Channel]] and was published on DVD by [[Delta Pictures]] under the label [[20th Century Fox Home Entertainment]].\n\nAll four seasons were made available on Netflix on 6 August 2012, but have since been removed for unknown reasons. Since 2015, all of the English dubbed episodes (including the prequel ''XANA Awakens'') are currently viewable on [[YouTube]].\n\n== Accolades ==\nThe series received mostly positive reviews. ''Code Lyoko'' was voted as the best show by Canal J viewers in France,<ref>{{cite web|title=Code Lyoko Game Coming to DS|url=http://www.nintendoworldreport.com/newsArt.cfm?artid=10825|website=Nintendo World Report|date=2005-09-30}}</ref> and has achieved international fame as well; the show has been rated as one of the best shows on Cartoon Network and Kabillion in the United States, with Cartoon Network having it rated as the #3 best performing show in 2006<ref name=\":7\">CL Presentation MIPTV 2012 2012-04-19. Retrieved 2012-04-19.</ref><ref name=\"mipcom\">{{cite web|title=CL Presentation MIPCOM 09 [Lecture seule]|url=http://www.codelyoko.fr/files/cl_mipcom_09.pdf|website=CodeLyoko.Fr|publisher=Moonscoop|accessdate=2016-07-24}}</ref> and Kabillion having it as #4 in monthly average views in 2010.<ref name=\"mipcom\"/> The show has reached success in Spain as one of [[Clan TVE]]'s highest rated shows,<ref name=\"mipcom\"/> on Italy's Rai2 network,<ref name=\"mipcom\"/> and in Finland and the United Kingdom as well. The show also won France's Prix de l'Export 2006 Award for Animation in December 2006.<ref>{{cite web|title=French TV Prix for three|url=http://www.hollywoodreporter.com/news/french-tv-prix-three-146256|website=Hollywood Reporter|accessdate=2016-07-24|date=2006-12-13}}</ref>\n\n== Merchandise ==\nSeveral ''Code Lyoko'' products have been released, including DVDs, a series of cine-manga by [[Tokyopop]], a series of four novels by Italian publisher Atlantyca Entertainment, apparel and other accessories. In 2006, Marvel Toys released a line of ''Code Lyoko'' toys and action figures.\n\nWhen the series started to come to an end in 2007, [[The Game Factory]] released three video games based on the show: ''[[Code Lyoko (video game)|Code Lyoko]]'' and ''[[Code Lyoko: Fall of X.A.N.A.]]'' for the [[Nintendo DS]], and ''[[Code Lyoko: Quest for Infinity]]'' for the [[Wii]], [[PlayStation Portable|PSP]], and [[PlayStation 2]]. The games were met with mixed to positive reviews from critics despite some criticisms of gameplay. There have been other games released through various mediums, one being Facebook.<ref name=\"mipcom\"/><ref>{{cite web|title=Code Lyoko cracks the social gaming space|url=http://kidscreen.com/2011/11/21/code-lyoko-cracks-the-social-gaming-space/|website=Kidscreen|accessdate=2011-11-21|date=2011-11-21}}</ref>\n\nA series of Clan TVE festivals in Spain included live stage shows based on Code Lyoko among other things.<ref>{{cite web|title=El Festival del Clan en vídeo [Código Lyoko] (2011)|url=https://codigolyokoespain.blogspot.com.au/2012/01/blog-post.html|website=Código Lyoko España|accessdate=2017-01-11|language=Spanish|date=2012-01-26}}</ref> A game show known as Code Lyoko Challenge was planned to be released in late 2012, but fell through.<ref name=\"mipcom\" />\n\nIn January 2011, all four seasons of ''Code Lyoko'' were released on iTunes in the US and in France by Moonscoop Holdings, although as of May 2019 only seasons 1 and 2 are available and other seasons have been removed. In October 2011, all four seasons were released on Amazon Instant Streaming and on DVD in the USA, however these DVDs are now out of print.<ref>{{cite web|title=Code Lyoko|url=https://www.facebook.com/CodeLyoko/posts/259449940753800|website=Facebook|accessdate=2011-12-10|date=2011-08-16}}</ref>\n\n=== Book series ===\nA series of four chapter books was released by Atlantyca Entertainment and distributed in Italy and other countries. The novels delve deeper into the unanswered questions of the series. Taking place after the end of the series, X.A.N.A. has miraculously survived and returns, though weakened and initially missing its memories. X.A.N.A. possesses Eva Skinner, an American girl, and travels to France in order to infiltrate the gang and kill them off. Unaware of their enemy's presence, the group works to find clues about Aelita's past, left by her father Franz Hopper, and confirm whether or not her mother is still alive somewhere. But at the same time, a terrorist group, the Green Phoenix, has become interested in the supercomputer and intend to use both it and the virtual world of Lyoko for evil purposes.\n\nIt was confirmed that the series will never be released officially in English, nor the final two books released in French. However, some time later, a fan community came together and sought to not only finish the series but translate it into more languages, including English. They have since completed their work and made it available for free download in September 2014.<ref>{{cite web|url=http://en.codelyoko.fr/chronicles/chronique.cl|title=Chronicles > Chronicle of a translation|website=CodeLyoko.Fr|accessdate=2017-01-11}}</ref>\n\n== See also ==\n{{portal|Animation|France|Television|2000s}}\n* [[List of French animated television series]]\n* [[List of French television series]]\n*[[Tron]]\n*[[Gridman the Hyper Agent]]\n*[[Superhuman Samurai Syber-Squad]]\n*[[Digimon Adventure]]\n*[[Zixx]]\n*[[ReBoot: The Guardian Code]]\n\n== Notes ==\n{{notelist}}\n\n== References ==\n{{reflist|30em}}\n\n== External links ==\n{{Wikiquote}}\n* {{IMDb title|0417311|Code Lyoko}}\n\n{{Code Lyoko}}\n{{portal bar|Animation|Speculative fiction/Science fiction|}}\n\n[[Category:Code Lyoko| ]]\n[[Category:2000s French animated television series]]\n[[Category:2003 French television series debuts]]\n[[Category:2007 French television series endings]]\n[[Category:Artificial intelligence in fiction]]\n[[Category:French computer-animated television series]]\n[[Category:French children's animated action television series]]\n[[Category:French children's animated adventure television series]]\n[[Category:French children's animated science fiction television series]]\n[[Category:Television series about time travel]]\n[[Category:Fiction about mind control]]\n[[Category:Television series about parallel universes]]\n[[Category:Television series about robots]]\n[[Category:Television programs about spirit possession]]\n[[Category:Virtual reality in fiction]]\n[[Category:Anime-influenced Western animation]]\n[[Category:Television shows set in Paris]]\n[[Category:Television series by Splash Entertainment]]\n[[Category:Malware in fiction]]\n[[Category:French animated television programs featuring anthropomorphic characters]]",
            "slug": "code-lyoko",
            "date_updated": 1565237191898,
            "imported": "https://en.wikipedia.org/wiki/Code_Lyoko"
        }
    ]
}