{
    "article": [
        {
            "title": "Logic Pro",
            "text": "{{More citations needed|date=May 2018}}{{Distinguish|Dolby Pro Logic}}\n{{Use mdy dates|date=October 2013}}\n{{Infobox software\n| name = Logic Pro\n| logo = 2015 Logic Pro Logo.png\n| screenshot = Logic Pro X screenshot.png\n| caption = A screenshot of Logic Pro X\n| developer = [[Apple Inc.]]\n| released = {{start date and age|1993}} (as Notator Logic)\n| latest_release_version = 10.4.6\n| latest release date = {{release date and age|2019|7|9}}<ref>{{cite web|url=https://support.apple.com/en-us/HT203718/|title=Logic Pro X 10.4 release notes - Apple Support|date=January 10, 2019}}</ref>\n| programming language = {{#statements:programming language}}\n| operating_system = {{#statements:operating system}}\n| platform = [[x64]] (as of Logic Pro 9.1)<ref name=\"Apple releases Logic Pro 9.1, adds 64-bit support\">{{cite web | url=http://www.musicradar.com/news/tech/apple-releases-logic-pro-9-1-adds-64-bit-support-232254 | title=MusicRadar - Logic 9.1 Release| accessdate=January 21, 2015}}</ref>\n| size = 1.45 GB\n| language = [[English language|English]], [[Chinese language|Chinese]], [[Japanese language|Japanese]], [[French language|French]], [[German language|German]], [[Spanish language|Spanish]]\n| genre = [[MIDI]] [[Music sequencer|sequencer]] and [[Digital Audio Workstation]]\n| license = [[Proprietary software|Proprietary]]\n| website = [https://geo.itunes.apple.com/us/app/logic-pro-x/id634148309?mt=12&at=11lMfi Mac App Store]\n}}\n'''Logic Pro''' is a [[digital audio workstation]] (DAW) and [[MIDI]] [[music sequencer|sequencer]] software application for the [[macOS]] platform. It was originally created in the early 1990s as '''Notator Logic''', or '''Logic''', by German software developer C-Lab, later [[Emagic]]. It became an [[Apple Inc.|Apple]] product, eventually known as Logic Pro, after Apple bought [[Emagic]] in 2002. It is the 2nd most popular DAW - after only Ableton Live - according to a survey conducted in 2015.<ref>{{Cite web|url=https://ask.audio/articles/the-top-11-most-popular-daws-you-voted-for|title=The Top 11 Most Popular DAWs (You Voted For)|website=ask.audio|language=en|access-date=2017-03-09}}</ref>\n\nA consumer-level version based on the same interface and audio engine but with reduced features, called [[Logic Express]], was also available at a reduced cost. Apple's [[GarageBand]], another application using Logic’s audio engine, is bundled in [[iLife]], a suite of software which comes included on any new [[Macintosh]] computer. On December 8, 2011, the boxed version of Logic Pro was discontinued, along with Logic Express, and Logic Pro is now only available through the [[Mac App Store]].{{cn|date=October 2017}}\n\n==Features==\nLogic Pro provides software instruments, audio effects and recording facilities for music synthesis. It also supports Apple Loops&nbsp;– [[Royalties|royalty-free,]] professionally recorded instrument loops. Logic Pro and Express share many functions and the same interface. [[Logic Express]] is limited to two-channel stereo mixdown, while Logic Pro can handle multichannel [[surround sound]]. Both can handle up to 255 audio tracks, depending on system performance ([[CPU]] and [[hard disk]] [[throughput]] and [[seek time]]). Logic Pro can work with [[MIDI]] keyboards and control surfaces for input and processing, and for MIDI output. It features real-time scoring in musical notation, supporting [[guitar]] [[tablature]], [[Chord (music)|chord]] abbreviations and drum notation. Advanced MIDI editing<ref>{{cite web |last1=Ialuna |first1=John |title=Author |url=https://www.midi.com.au/logic-pro-x-midi-files/ |website=Hit Trax MIDI Files |publisher=John Ialuna |accessdate=9 August 2018}}</ref> is possible though [https://www.midi.com.au/logic-pro-x-midi-files/ Logic Pro's MIDI Transform Window], where velocity, pitch, pitch-bends, humanize and precise note positioning are effected.\n\n===Software instruments===\nThe software instruments included in Logic Pro X include: Drum Kit Designer, Drum Machine Designer, ES, ES2, EFM1, ES E, ES M, ES P, EVOC 20 PolySynth, EXS24 mkII, Klopfgeist, Retro Synth, Sculpture, Ultrabeat, Vintage B3, Vintage Clav, Vintage Electric Piano. These instruments produce sound in various ways, through subtractive synthesis (ES, ES2, ES E, ES M, ES P, Retro Synth),  frequency modulation synthesis (EFM1), wavetable synthesis (ES2, Retro Synth), vocoding (EVOC 20 PolySynth), sampling (EXS24 mikII, Drum Kit Designer), and component modeling techniques (Ultrabeat, Vintage B3, Vintage Clav, and Vintage Electric Piano, Sculpture). As of version 10.2, Logic Pro X also includes Alchemy, a sample-manipulation synthesizer that was previously developed by Camel Audio.<ref name=\"The Logic Pros: A look at Logic’s new heavy weight sample manipulation synth Alchemy\">{{cite web | url=http://9to5mac.com/2015/08/30/logic-pros-alchemy-update/ | title=The Logic Pros: A look at Logic’s new heavy weight sample manipulation synth Alchemy | accessdate=September 1, 2015}}</ref> The software instruments are activated by MIDI information that can be input via a MIDI instrument or drawn into the MIDI editor.\n\n[[Image:Space Designer Logic Effect.png|thumb|left|250px|The Space Designer plugin attempts to emulate the characteristic echo and [[reverberation]] of a physical environment, using a method called [[Convolution reverb|convolution]].]]\n\n===Audio effects===\nAudio effects include amp and guitar pedal emulators, delay effects, distortion effects, [[dynamics (music)|dynamics]] processors, [[Equalization (audio)|equalization]] filters, filter effects, imaging processors, metering tools, modulation effects, pitch effects, and reverb effects.  Among Logic's reverb plugins is Space Designer, which uses [[convolution reverb]] to simulate the acoustics of audio played in different environments, such as rooms of varying size, or emulate the [[Echo (phenomenon)|echoes]] that might be heard on high mountains. \n\n===Distributed processing===\nThe application features [[distributed processing]] abilities (in 32-bit mode), which can function across an [[Ethernet]] [[LAN]]. One machine runs the Logic Pro app, while the other machines on the network run the Logic node app. Logic will then offload the effects and synth processing to the other machines on the network. If the network is fast enough (i.e. [[gigabit Ethernet]]) this can work in near real-time, depending on buffer settings and CPU loads. This allows users to combine the power of several Macintosh computers to process Logic Pro’s built-in software instruments and plug-ins, and 3rd party processing plug-ins.  As of version 10.0.7, Logic can access 24 processing threads, which is inline with Apple's flagship 12-core Mac Pro.\n\n==History==\n\n===Creator and Notator===\nIn the mid-to-late 1980s, Gerhard Lengeling and Chris Adam developed a [[MIDI]] [[music sequencer|sequencer]] program for the [[Atari ST]] platform called ''Creator''. When musical notation capabilities were added, this became ''Notator'', and later ''Notator SL''. For simplicity these three are collectively referred to as Notator.<ref>{{cite web|last1=Vaughn|first1=Mac|title=History of DAW|url=http://www.blog.logitunes.com/history-of-daw/|publisher=Logitunes|accessdate=2 December 2014|quote=Emagic, a software company based in Germany, was known for its early music sequencer called “Creator”. Creator was followed by Notator, which ran on the Atari ST platform. Notator Logic was launched in 1992 for both Atari, Macintosh and Windows. Emagic quickly dropped the “Notator” from the name and was redesigned with a new look and called ''Emagic Logic''. In 2002, Apple bought the software and discontinued all Windows based support for the program. Today, Logic still only exists on the Apple platform and is widely regarded as one of the most popular DAWS available.|deadurl=yes|archiveurl=https://archive.is/20141202191148/http://www.blog.logitunes.com/history-of-daw/|archivedate=December 2, 2014|df=mdy-all}}</ref>\n\nIts main rivals at the time included [[Digital Performer|Performer]], [[Opcode Systems|Vision]] & Steinberg 16.  Most [[MIDI]] sequencers presented a song as a linear set of tracks; however, Notator and Vision were pattern-based sequencers: songs were built by recording patterns (which might represent for example Intro, Verse, Chorus, Middle-8, Outro) with up to 16 tracks each, then assembling an Arrangement of these patterns, with up to 4 patterns playing simultaneously at any one time in the song.<ref>{{cite web|last1=Houghton|first1=Matt|title=Play Order Track|url=http://www.soundonsound.com/sos/mar07/articles/cubasetech_0307.htm|publisher=SoundOnSound|accessdate=2 December 2014|quote=Like Notator, Vision, and several other of the early MIDI sequencers, it was pattern-based. There was no timeline, no timeline-based looping of selections, and no arrange page. This method was more like a relational database than a modern computer sequencer. Users programmed various parts, comprising rhythms, chords and melodies, then programmed the order and number of repetitions of each of these parts to form songs.}}</ref> This more closely resembled working principles of hardware sequencers of the 1970s and 1980s.\n\nIn its time, Notator was widely regarded (by musicians and the musical press of the time e.g. International Musician) as one of the most powerful and intuitive sequencing and notation programs available on any platform, but afterward the popularity of Steinberg's [[Cubase]] increased and track-based sequencing prevailed over pattern-based, resulting in the eventual greater integration and hybridization of the two methods in later versions of both Cubase and Logic.<ref>{{cite web|title=The Audio Interface Choice|url=http://homestudio-recording.blogspot.com/|website=Home Studio|accessdate=6 April 2015}}</ref>\n\n===Logic===\nThe C-Lab programmers left that company to form [[Emagic]], and in 1993 released a new program, ''Notator Logic'', which attempted to fuse both track- and pattern-based operation (but looked much more like track-based sequencers than Notator). While rich in features, early versions of Logic on the Atari lacked the intuitiveness and immediacy of either Cubase or Notator, and never achieved the same success. However, by this time the Atari was becoming obsolete, and part of the reason why ''Notator Logic'' had been written from scratch with an object oriented GUI (though it shared the same nomenclature as its predecessor) was to make it easier to port to other platforms. The ''Notator'' prefix was dropped from the product name and the software became known as simply ''Logic''.\n\nAs later versions of the software became available for [[Mac OS]] and [[Microsoft Windows|Windows]] platforms, and acquired ever more sophisticated functions (especially in audio processing) to take advantage of increased computing power, Logic, together with the rise of the PC, gained popularity again.\n\n[[Apple Inc.|Apple]] acquired Emagic in July 2002.<ref>{{cite web | url=https://www.apple.com/pr/library/2002/jul/01emagic.html | title=Apple Acquires Emagic | work=Apple, Inc. | accessdate=February 13, 2007}}</ref>  The announcement included the news that development of the Windows version would no longer continue.  This announcement caused controversy in the recording industry with an estimated 70,000 users having invested in the Windows route not wishing to reinvest in a complete new system.  Despite much speculation in various Pro Audio forums however, exactly how many users may have abandoned Logic upon its acquisition by Apple, or abandoned the Windows platform for the Mac version, remains unknown,<ref>{{cite web | url=https://www.theregister.co.uk/2002/07/01/apple_drops_emagic_bombshell/ | title=Apple Drops Emagic Bombshell | work=The Register | accessdate=July 1, 2002}}</ref> but Apple Pro Apps revenue has steadily increased since Apple's acquisition of Emagic,<ref>{{cite web | url=http://alex4d.com/notes/item/pro-apps-2005-2014 | title=Apple Pro Apps Quarterly Revenue | work=Alex4D | accessdate=July 28, 2014}}</ref> (roughly $2 billion a year as of Q1 2014).\n\n==Versions==\n\n===Early versions===\n''Logic 5'' featured significant improvements in user interface, and increased compatibility with more types of computers, operating systems, and a wide range of audio interfaces. Logic 5.5.1 was the last version to be released for Windows. From Logic 6 onwards, the software would only be available on Mac OS.\n\nWith ''Logic 6'', Emagic added the availability of separately packaged software products that were closely integrated add-ons developed specifically for use with Logic, including software instruments, the EXS sampler and audio processing plug-ins. The Logic 6 package also included the stand-alone program [[WaveBurner Pro|Waveburner]], for burning [[Red Book (audio CD standard)|redbook]] audio CD standard-compliant CDR masters for replication, however, that application was considered a free bonus feature; it was not advertised as part of the package and did not include printed documentation.  PDF documentation was included on the installer disc.\n\nIn March 2004 Apple released ''Logic Pro 6'', which consolidated over 20 different Emagic products, including all instrument and effect plug-ins, Waveburner Pro (CD Authoring application), and Pro Tools TDM support, into a single product package. Apple also released a scaled down version of Logic called Logic Express, replacing two previous versions that filled that position called Logic Silver and Logic Gold. Apple began promoting Logic Pro as one of its flagship software ‘Pro’ applications for the Macintosh platform.\n\n===Logic Pro 7===\n''Logic Pro 7'' was released September 29, 2004. Most notably, Apple modified the interface of Logic 7 to look more like a product that was developed by Apple.\n\nAdditions to Logic Pro 7 included: the integration of Apple Loops, Distributed Audio Processing (a technology for combining the power of multiple computers on a network), 3 new instruments including Sculpture (a sound modeling synth) and Ultrabeat (a drum synth and sequencer), and 9 new effect plug-ins including Guitar Amp Pro (guitar amp simulator), and a linear phase corrected version of their 6 channel parametric equalizer. In total, Logic Pro 7 now included 70 effect plug-ins and 34 instrument plug-ins.\n\nPro-Tools TDM compatibility, which had been a feature of Logic since version 3.5, was not supported by Logic 7.2 on Intel-based Mac computers;<ref>According to Digidesign’s [http://digidesign.com/index.cfm?langid=100&navid=54&itemid=24121 compatibility document for Pro Tools TDM HD 7.2 and 7.3], Logic Pro will require a future update from Apple to support Pro Tools HD DAE for Intel-based Macs.\"</ref> TDM support returned with the release of Logic 8.\n\n===Logic Pro 8===\nOn September 12, 2007, Apple released the [[Logic Studio]] suite that included ''Logic Pro 8''. Logic Pro was no longer a separate product, although a limited version [[Logic Express]] 8 was released on the same day, and remained a separate product.\n\nSignificant changes were made for Logic 8. Logic Pro 8 was now mainly Cocoa code, but still included some Carbon Libraries.{{clarify|reason=technical jargon|date=October 2016}} Alongside changes such as the new processing plug-in (Delay Designer), Apple included features such as Quick Swipe Comping, similar to [[Soundtrack Pro|Soundtrack Pro 2]], and multi-take management.\n\nApple also made changes to ease of use. These include the discontinuation of the XSKey [[dongle]], and a streamlined interface. Each plug-in used in the channel strip opens in a new window when double-clicked.  Many of the features found in Logic 7 have been consolidated into one screen. Other additions to the new interface included consolidated arrange windows, dual channel strips, built in browsers (like that in [[GarageBand]]) and production templates.\n\n===Logic Pro 9===\nOn July 23, 2009, ''Logic Pro 9'' was announced. A major new feature included \"Flex Time\", Apple's take on \"elastic\" audio, which allows audio to be quantized.<ref>{{cite web|url=https://www.soundonsound.com/techniques/logic-using-flex-time-vocals|title=Logic - Using Flex Time on Vocals -|website=www.soundonsound.com}}</ref> A version of the [[Guitar pedalboard|pedalboard]] from [[GarageBand]] was included, together with a new virtual [[guitar amplifier]] where the modeled components could be combined in different ways. There were also a number of improvements to audio editing, fulfilled user requests such as \"bounce in place\" and selective track and channel strip import, as well as an expanded content library including one more [[GarageBand#Jam Packs|Jam Pack]]. Some of the bundled software, including MainStage 2 and Soundtrack Pro 3, was also improved. Logic Pro 9 is Universal Binary, although not officially supported for use on PowerPC computers.<ref name=\"XLR8R\">{{cite web|url=http://www.xlr8r.com/news/2009/07/first-look-logic-pro-9|title=A First Look At Logic Pro 9|date=July 24, 2009|publisher=XLR8R|accessdate=June 24, 2010|deadurl=yes|archiveurl=https://web.archive.org/web/20091001083357/http://www.xlr8r.com/news/2009/07/first-look-logic-pro-9|archivedate=October 1, 2009|df=mdy-all}}</ref> SoundDiver, which had been quietly bundled with previous versions, was dropped, eliminating support for arguably the world's most popular synthesizer editor/librarian. As Apple has bundled so many software instruments with Logic, it is not likely that we'll see the return of integration with external synthesizer hardware to the Logic platform.{{Citation needed|date=February 2012}}\n\nOn January 12, 2010, Apple released Logic Pro 9.1, an Intel only release, thereby officially discontinuing Logic for the PowerPC platform. Logic Pro 9.1 has the option of running in 64-bit mode, which allows the application to address more memory than in the past. Says Apple \"With 64-bit mode, the application memory is not limited to 4GB as with 32-bit applications, so there is essentially no practical limit by today's standards.\" Third party plug-ins that are 32-bit are still compatible, but will run from a 'wrapper' inside Logic Pro itself.\n\nOn December 9, 2011, Apple announced that Logic Pro Studio 9 would no longer be available on DVD, and would only be sold via the [[Mac App Store]]. The price was reduced from $499 to $199.99 for the Logic Pro app, and $29.99 for MainStage. The download was just over 400MB, and 19GB of optional loops were available as in-app downloads.<ref>{{cite web | url=https://itunes.apple.com/us/app/logic-pro/id459578486?mt=12 | title=Logic Pro 9 Product Page on Mac App Store | work=Apple, Inc. | accessdate=December 9, 2011}}</ref>\n\nThis version of Logic Pro Studio 9 no longer allows users to access any microtunings in [[Scala (software)|Scala]] format other than those provided with the software by Apple.\n\n===Logic Pro X===\nReleased as successor to Logic Pro 9 on July 16, 2013, ''Logic Pro X'' (10.0.0) included a new, single-window customizable interface, with a design in line with [[Final Cut Pro X]], as well as new features. New tools in this release are ''Drummer'', a virtual session player that automatically plays along with your song in a wide variety of drumming styles and techniques, and ''Flex Pitch'', a Flex Time equivalent for pitch editing in audio recordings.  Also, a new \"Smart Controls\" feature allows users to map parameters from an array of plugins to a single, convenient control interface. Redesigned keyboards and synths were included, together with new stomp boxes, bass amp and drum kit designers, and a chord arpeggiator. A completely rebuilt sound and loop library was introduced, along with a new Patch architecture. Logic Pro X has also improved track organization by allowing users to group multiple tracks into 'folder' like categories (e.g., acoustics, synthesizers, vocals, percussion, etc.). In addition to this organization, Logic Pro X allows individuals to trigger 'solo,' 'mute,' and 'volume' controls for each group.<ref name=\"macworld.com\">{{cite web|title = Review: Logic Pro X loses none of its power, gains great new features|url = http://www.macworld.com/article/2044283/logic-pro-x-loses-none-of-its-power-gains-great-new-features.html|website = Macworld|accessdate = 2015-11-10}}</ref> Further improvements were made to score editing, exporting (now compatible with [[MusicXML]] format), and introduces MIDI plug-in compatibility. Coinciding with the release of Logic Pro X was the release of a companion iPad app called Logic Remote, which allows wireless control of Logic Pro X, including ''Touch Instruments'' for playing and recording software instruments as well as tools for navigating, making basic edits and mixing.\n\nSince this release, Logic Pro X runs in 64-bit mode only and no longer works with 32-bit plug-ins.<ref>{{cite web|url=http://9to5mac.com/2013/07/26/logic-pro-x-review-powerful-new-features-a-simplified-ui-with-no-compromises-for-pros//|title=Logic Pro X review: Powerful new features & a simplified UI with no compromises for pros|date=July 26, 2013|publisher=}}</ref> Logic Pro X is capable of transferring most data from previous projects saved in Logic Pro 5 and later, though the transfer to 64-bit only means older 32-bit plugins will no longer work.<ref name=\"macworld.com\"/>\n\nThe current version is Logic 10.4.6, where 10.4 introduced a new reverb called Chromaverb, and new functionality like Smart Tempo, as well as the option to undo mixer actions. In addition, version 10.4 introduced support for version 2 of the [[Audio Random Access|ARA (Audio Random Access)]] standard.<ref>{{Cite news|url=https://producelikeapro.com/blog/logic-10-4-update-the-first-to-utilize-ara-2/|title=Logic 10.4 Update: the first to utilize ARA-2|last=Libertini|first=Carlo|date=2018-02-04|work=Produce Like A Pro|access-date=2019-07-09|language=en-US}}</ref>\n\n==See also==\n* [[Apple Inc.]]\n* [[Logic Studio]]\n* [[Logic Express]]\n* [[Mainstage (software)|Mainstage]]\n* [[GarageBand]]\n* [[Logic Control]]\n* [[Audio Units]]\n* [[Core Audio]]\n* [[Comparison of multitrack recording software]]\n\n==References==\n{{Reflist}}\n\n==External links==\n*{{Official website|www.apple.com/logic-pro}}\n\n{{Logic Studio}}\n{{Apple software}}\n{{Audio editors}}\n\n[[Category:MIDI]]\n[[Category:Digital audio workstation software]]\n[[Category:MacOS-only software made by Apple Inc.]]\n[[Category:MacOS audio editors]]",
            "slug": "logic-pro",
            "date_updated": 1565237976502,
            "imported": "https://en.wikipedia.org/wiki/Logic_Pro"
        }
    ]
}