{
    "article": [
        {
            "title": "Overlay network",
            "text": "An '''overlay network''' is a [[computer network]] that is built on top of another network<ref>{{Cite book | author = Sasu Tarkoma | title= Overlay Networks: Toward Information Networking | publisher=CRS Press | date= 2010 | page = 3 | isbn=9781439813737}}</ref>.\n\n==Structure==\n[[Node (networking)|Nodes]] in the overlay network can be thought of as being connected by virtual or logical links, each of which corresponds to a path, perhaps through many physical links, in the underlying network. For example, [[distributed systems]] such as [[peer-to-peer]] networks and [[client-server]] applications are overlay networks because their nodes run on top of the [[Internet]].{{fact|date=February 2018}}\n\nThe Internet was originally built as an overlay upon the [[telephone network]], while today (through the advent of [[VoIP]]), the telephone network is increasingly turning into an overlay network built on top of the Internet.{{fact|date=February 2018}}\n\n== Uses ==\n\n=== In telecommunication ===\n\n[[File:Network Overlay merged.svg|thumb|upright=1.5| Figure 1: A sample overlay network]]\n\n[[File:Network Overlay.svg|thumb|upright=1.5|Figure 2: Overlay network broken up into logical layers]]\nOverlay networks are used in [[telecommunication]] because of the availability of digital [[circuit switching]] equipment and [[optical fiber]].<ref>[http://www.corp.att.com/history/nethistory/transmission.html AT&T history of Network transmission]</ref> Telecommunication transport networks and IP networks (which combined make up the broader Internet) are all overlaid with at least an optical fiber layer, a transport layer and an IP or circuit switching layers (in the case of the [[PSTN]]).\n\n[[Enterprise private network]]s were first overlaid on [[telecommunication network]]s such as [[frame relay]] and [[Asynchronous Transfer Mode]] [[packet switching]] infrastructures but migration from these (now legacy) infrastructures to IP based [[Multiprotocol Label Switching|MPLS]] networks and [[virtual private network]]s started (2001~2002).\n\nFrom a physical standpoint, overlay networks are quite complex (see Figure 1) as they combine various logical layers that are operated and built by various entities (businesses, universities, government etc.) but they allow separation of concerns that over time permitted the buildup of a broad set of services that could not have been proposed by a single telecommunication operator (ranging from [[broadband Internet access]], voice over IP or [[IPTV]], competitive telecom operators etc.).<ref>Fransman, Martin. Telecoms in the Internet Age: From Boom to Bust to ...?. Oxford University Press.</ref>\n\n=== Over the Internet ===\n\nNowadays the Internet is the basis for more overlaid networks that can be constructed in order to permit [[routing]] of messages to destinations not specified by an [[IP address]]. For example, [[distributed hash table]]s can be used to route messages to a node having a specific [[logical address]], whose IP address is not known in advance.\n\nOverlay networks have also been proposed as a way to improve Internet [[routing]], such as through [[quality of service]] guarantees to achieve higher-quality [[streaming media]]. Previous proposals such as [[IntServ]], [[DiffServ]], and [[IP multicast]] have not seen wide acceptance, largely because they require modification of all [[router (computing)|routers]] in the network. On the other hand, an overlay network can be incrementally deployed on end-hosts running the overlay protocol software, without cooperation from [[Internet service provider|ISPs]]. The overlay has no control over how packets are routed in the underlying network between two overlay nodes, but it can control, for example, the sequence of overlay nodes a message traverses before reaching its destination.\n\nFor example, [[Akamai Technologies]] manages an overlay network which provides reliable, efficient content delivery (a kind of [[multicast]]). Academic research includes [[End System Multicast]] and Overcast, which is multicasting on an overlay network; [[#Resilience|RON (Resilient Overlay Network)]] for resilient routing; and OverQoS for quality of service guarantees, among others.\n\n==Resilience==\n''Resilient Overlay Networks (RON)'' are architectures that allow distributed Internet applications to detect and recover from disconnection or interference. Current wide area routing protocols that take at least several minutes to recover from are improved upon with this application layer overlay. The RON nodes monitor the Internet paths among themselves and will determine whether or not to reroute packets directly over the internet or over other RON nodes thus optimizing application specific metrics.<ref name=\"paper1\">{{Cite book |url= http://portal.acm.org/citation.cfm?id=502048 |doi= 10.1145/502034.502048 |title= Resilient Overlay Networks |author= David Andersen , Hari Balakrishnan , [[Frans Kaashoek]] , Robert Morris |date= December 2001 |journal= Proceedings of the Eighteenth ACM Symposium on Operating Systems Principles |pages= 131–45 |isbn= 978-1581133899 }}</ref>\n\nThe Resilient Overlay Network has a relatively simple conceptual design. RON nodes are deployed at various locations on the Internet. These nodes form an application layer overlay that cooperate in routing packets. Each of the RON nodes monitor the quality of the Internet paths between each other and uses this information to accurately and automatically select paths from each packet, thus reducing the amount of time required to recover from poor [[quality of service]].<ref name=\"paper1\"/>\n\n==Multicast==\n''Overlay multicast'' is also known as ''End System'' or ''Peer-to-Peer Multicast''. High bandwidth multi-source multicast among widely distributed nodes is a critical capability for a wide range of applications, including audio and video conferencing, multi-party games and content distribution. Throughout the last decade, a number of research projects have explored the use of [[multicast]] as an efficient and scalable mechanism to support such group communication applications. Multicast decouples the size of the receiver set from the amount of state kept at any single node and potentially avoids redundant communication in the network.\n\nThe limited deployment of IP Multicast, a best effort network layer multicast protocol, has led to considerable interest in alternate approaches that are implemented at the application layer, using only [[End System|end-systems]]. In an overlay or end-system multicast approach, participating peers organize themselves into an overlay topology for data delivery. Each edge in this topology corresponds to a unicast path between two end-systems or peers in the underlying [[Internet]]. All multicast-related functionality is implemented at the peers instead of at routers, and the goal of the multicast protocol is to construct and maintain an efficient overlay for data transmission.\n\n=== Disadvantages ===\n* Slow in spreading the data.\n* Long latency.\n* Duplicate packets at certain points.\n\n== List of overlay network protocols ==\nOverlay network protocols based on [[TCP/IP]] include:\n* [[http]] / [[https]]\n* [[Distributed hash table]]s (DHTs), such as [[Kad network|KAD]] and other protocols based on the [[Chord (peer-to-peer)|Chord]] and [[Kademlia]] algorithm, for example.\n* [[JXTA]]\n* [[XMPP]]: the routing of messages based on an endpoint Jabber ID (Example: nodeId_or_userId@domainId\\resourceId) instead of by an IP Address\n* Many [[peer-to-peer]] protocols including [[Gnutella]], [[Gnutella2]], [[Freenet]], [[I2P]] and [[Tor (anonymity network)|Tor]].\n* [[P2P Universal Computing Consortium|PUCC]]\n* [[Solipsis]]: a [[France Télécom]] system for massively shared virtual world\n* HyParView: a highly robust unstructured overlay for gossip broadcast\n\nOverlay network protocols based on UDP/IP include:\n* [[Real Time Media Flow Protocol]] – [[Adobe Flash]]\n\n== See also ==\n* [[Darknet]]\n* [[Mesh network]]\n* [[Computer network|Net]]\n* [[Peercasting]]\n* [[VPN|Virtual Private Network]]\n\n== References ==\n{{reflist}}\n== External links ==\n* [http://himalia.it.jyu.fi/ffdoc/storm/pegboard/available_overlays--hemppah/peg.gen.html List of overlay network implementations, July 2003]\n* [http://nms.csail.mit.edu/ron/ Resilient Overlay Networks]\n* [http://www.cs.brown.edu/~jj/papers/overcast-osdi00.pdf Overcast: reliable multicasting with an overlay network]\n* [http://nms.lcs.mit.edu/papers/overqos-nsdi04.html OverQoS: An overlay based architecture for enhancing Internet QoS]\n* [http://asc.di.fct.unl.pt/~jleitao/pdf/dsn07-leitao.pdf HyParView: a membership protocol for reliable gossip-based broadcast. João Leitão, José Pereira and Luís Rodrigues. Proceedings of the 37th Annual IEEE/IFIP International Conference on Dependable Systems and Networks (DSN), 2007]\n*  RFC 3170\n*  [http://www.tldp.org/HOWTO/Multicast-HOWTO.html Multicast over TCP/IP HOWTO]\n*  [http://www.aqualab.cs.northwestern.edu/projects.html Nemo – Resilient Overlay Multicast]\n*  [http://www.aqualab.cs.northwestern.edu/projects.html FatNemo – Emulating FatTrees for Overlay Multisource/Multicast]\n*  [https://web.archive.org/web/20050221110350/http://esm.cs.cmu.edu/ End System Multicast]\n*  [http://www.samrg.org/bib Bibliography ] on overlay multicast and application layer multicast for the [http://www.samrg.org IRTF Scalable Adaptive Multicast Research Group]\n\n{{DEFAULTSORT:Overlay Network}}\n[[Category:Anonymity networks]]\n[[Category:Network architecture]]",
            "slug": "overlay-network",
            "date_updated": 1565239274411,
            "imported": "https://en.wikipedia.org/wiki/Overlay_network"
        }
    ]
}