{
    "article": [
        {
            "title": "WASTE",
            "text": "{{about|the file sharing network and application||Waste (disambiguation)}}\n{{multiple issues|\n{{Notability|Products|date=July 2011}}\n{{refimprove|date=July 2011}}\n}}\n\n{{Infobox software\n| name                   = WASTE\n| title                  = \n| logo                   = <!-- Image name is enough -->\n| logo caption           = \n| logo_size              = \n| logo_alt               = \n| screenshot             = <!-- Image name is enough -->\n| caption                = \n| screenshot_size        = \n| screenshot_alt         = \n| collapsible            = \n| author                 = [[Justin Frankel]]\n| developer              = \n| released               = {{Start date and age|2003}}\n| discontinued           = \n| latest release version = 1.7\n| latest release date    = {{Start date and age|2008}}\n| latest preview version = \n| latest preview date    = <!-- {{Start date and age|YYYY|MM|DD|df=yes/no}} -->\n| frequently updated     = <!-- DO NOT include this parameter unless you know what it does -->\n| status                 = defunct\n| programming language   = [[C++]]\n| operating system       = [[Microsoft Windows|Windows]], [[Linux]], [[OS X]]\n| platform               = \n| size                   = \n| language               = English\n| language count         = <!-- DO NOT include this parameter unless you know what it does -->\n| language footnote      = \n| genre                  = [[Darknet]]\n| license                = [[GNU GPL]]\n| alexa                  = \n| website                = <!-- {{URL|example.org}} -->\n| standard               = \n| AsOf                   = \n}}\n'''WASTE''' is a [[peer-to-peer]] and [[friend-to-friend]] protocol and software application developed by [[Justin Frankel]] at [[Nullsoft]] in 2003 that features [[instant messaging]], [[chat rooms]], and file browsing/sharing capabilities.  The name WASTE is a reference to [[Thomas Pynchon]]'s novel ''[[The Crying of Lot 49]]''.  In the novel, W.A.S.T.E. is (among other things) an underground postal service.\n\nIn 2003, less than 24 hours after its release,<ref>{{Cite web|url=https://betanews.com/2003/05/30/aol-execs-flush-nullsoft-s-waste/|title=AOL Execs Flush Nullsoft's WASTE|date=May 31, 2003|website=BetaNews}}</ref> WASTE was removed from distribution by [[AOL]], Nullsoft's parent company.<ref>{{Cite web|url=https://www.afterdawn.com/news/article.cfm/2003/05/31/nullsoft_releases_waste_--_aol_pulls_the_plug|title=Nullsoft releases WASTE -- AOL pulls the plug|website=AfterDawn}}</ref> The original page was replaced with a statement claiming that the posting of the software was unauthorized and that no lawful rights to it were held by anyone who had downloaded it, in spite of the original claim that the software was released under the terms of the [[GNU General Public License]].\n\nSeveral developers have modified and upgraded the WASTE client and protocol.  The [[SourceForge]] edition is considered by many to be the official development branch, but there are several [[Fork (software development)|forks]].\n\n== Description ==\nWASTE is a decentralized chat, [[instant messaging]] and file sharing program and protocol. It behaves similarly to a [[virtual private network]] by connecting to a group of trusted computers, as determined by the users. This kind of network is commonly referred to as a [[darknet]].  It uses strong [[encryption]] to ensure that third parties cannot decipher the messages being transferred.  The same encryption is used to transmit and receive instant messages, chat, and files, maintain the connection, and browse and search.\n\n==WASTE networks ==\nWASTE networks are [[Decentralized computing|decentralized]] (see [[social network]]s), meaning there is no central hub or server that everyone connects to. Peers must connect to each other individually. Normally, this is accomplished by having individuals sharing their [[RSA (algorithm)|RSA]] public keys, ensuring that their computers are accessible via the appropriate ports (one or more parties must have an [[IP address]] and port that can be reached by the other), and entering the IP address and port of someone on the network to connect to.\n\nOnce connected to the network, public keys are automatically exchanged amongst members (provided enough of the members are set to forward and accept public keys), and nodes will then attempt to connect to each other, strengthening the network (decreasing the odds that any one node going down will collapse or shut out any part of the network), as well as increasing the number of possible routes from any given point to any other point, decreasing latency and bandwidth required for communication and file transfer.\n\nSince WASTE connects small, private groups rather than large, public ones, the network search feature is one of the fastest of all the decentralized P2P applications. Its instant messaging and file sharing capabilities are much closer to those of [[AOL Instant Messenger]] than more typical [[file sharing]] programs. Members of the network can create private and public chat rooms, instant message each other, browse each other's files, and trade files, including the pushing or active sending of files by hosts, as well as the more common downloading by users. Simple drag-and-drop to chat boxes will send files to their intended destinations.\n\nThe suggested size for a WASTE network (referred to as a ''mesh'' by users) is 10-50 [[node (networking)|node]]s, though it has been suggested that the size of the network is less critical than the ratio of nodes willing to route traffic to those that are not. With original [[Nullsoft]]-client groups now exceeding ten years of age, it's not uncommon for stable meshes to host multiple terabytes of secure content.\n\nBy default, WASTE listens to incoming connections on port 1337. This was probably chosen because of 1337's [[leet]] connotations.\n\nSince there is no central hub, WASTE networks typically employ a [[password]] or [[passphrase]], also called a ''network name'' to prevent collision. That is, a member from one network connecting to a member of another network, thus bridging the two networks. By assigning a unique identifier (passphrase) to your network, the risk of collisions can be reduced, particularly with the original clients.\n\n== Nullnets ==\n''Nullnets'' are networks without a passphrase. It is impossible to know how many nullnets exist, but there is one primary nullnet. The best way to access the nullnet is to post your credentials to the WASTE Key Exchange.<ref>{{Cite web|url=http://wastekeyexchange.blogspot.com/2007/05/waste-15-and-16.html|title=WASTE Key Exchange: WASTE 1.5 and 1.7 Nullnet Discussion|date=May 16, 2007}}</ref><ref>[http://waste.nfshost.com/ WASTE Key Exchange Server]{{Dead link|date=July 2019 |bot=InternetArchiveBot |fix-attempted=yes }}</ref> The nullnet can easily merge with other nullnets because there is no passphrase, which makes it a great place for public discussion and file sharing.\n\n== Strengths ==\n*Secured through the trade of [[RSA (algorithm)|RSA]] public keys, allowing for safe and secure communication and data transfer with trusted hosts.\n*The distributed nature means that the network isn't dependent on anyone setting up a server to act as a hub. Contrast this with other [[Peer-to-peer|P2P]] and chat protocols that require you to connect to a server. This means there is no single point of vulnerability for the network.\n*Similarly, there is no single group leader; everyone on the network is equal in what they can or cannot do, including inviting other members into the group, nor can any member kick another from the group, exclude them from public chats, etc.\n*WASTE can obfuscate its protocol, making it difficult to detect that WASTE is being used.\n*WASTE has a ''Saturate'' feature which adds random traffic, making [[traffic analysis]] more difficult.\n*The nodes (each a trusted connection) automatically determine the lowest latency route for traffic and, in doing so, [[load balancing (computing)|load balance]]. This also improves privacy, because packets often take different routes.\n\n== Shortcomings ==\n*Trading public keys, enabling [[port forwarding]] on your [[Firewall (networking)|firewall]] (if necessary), and connecting to each other can be a difficult and/or tedious process, especially for those who aren't very technically proficient.\n*Due to the network's distributed nature, it is impossible to ''kick'' someone from the network once they've gained access. Since every member of the network will have that member's public key, all that member needs to do to regain access is to connect to another member. Coordinating the change of the network name is exceedingly difficult, so the best course of action is to create another network and migrate everyone over to the new network. This could, of course, also be seen as a strength.\n*Since there is no central server, once someone disconnects from the network, they must know at least one network IP address to reconnect. It is possible that the network will drift from all the IP addresses used before so that none are known, and it becomes necessary to contact a network member and ask for address information to be able to reconnect. Indeed, it is possible that a network could unknowingly split into two this way. It takes at least some coordination to keep a WASTE network intact; this can be as simple as one or more volunteers with a static IP address or a fixed [[dynamic DNS]] (DDNS) address (available free of charge from a number of providers) keeping their node up to allow people to reconnect to the network.\n*While encryption is performed using the [[Blowfish (cipher)|Blowfish]] algorithm, which is thought to be strong, the [[Block cipher modes of operation#Propagating cipher-block chaining (PCBC)|PCBC]] mode used has several known security flaws.\n*Nicknames are not ''registered'', which allows eavesdropping and spoofing. WASTE version 1.6 reduces the chances of eavesdropping by using public keys for communication, but as network members may choose any nickname a user must know and recognize the [[Cryptographic hash function|hash]] of the person they wish to communicate with to be sure of their identity.\n*To connect from behind a firewall, one party must have the proper port forwarded to their computer; as WASTE networks do not depend on a central server there is no way around this. However, as long as one node accepts incoming connections it can act as a server, connecting nodes that cannot themselves accept incoming connections. Indeed, the long-term stability of a WASTE network depends on these hubs.\n\n== Versions ==\nAs of version 1.7, WASTE comes in an experimental and a stable release.  The experimental branch implements a new 16k packet size, which improves overhead and transfer speeds, but is not compatible with previous versions which support a 4k packet size.<ref>{{Cite web|url=http://wasteagain.sourceforge.net/introduction.shtml#whats-the-difference-to-original-waste|title=WASTE again: Introduction|website=wasteagain.sourceforge.net}}</ref>\n\nWASTE 1.7.4 for Windows was released on 24 December 2008, and was current {{As of|2009|10|lc=on}}. This is a new branch on [[SourceForge]] created because of inactivity on the main WASTE development branch. This is the most fully featured version to date.<ref>{{Cite web|url=http://wasteagain.sourceforge.net/|title=WASTE again: Project News|website=wasteagain.sourceforge.net}}</ref>\n\nA cross-platform (including [[Linux]], [[OS X]], and [[Microsoft Windows]]) beta version of WASTE called Waste 1.5 beta 4 a.k.a. wxWaste, using the [[WxWidgets]] toolkit is available.<ref>{{Cite web|url=https://sourceforge.net/projects/waste/files/wxWASTE%20Client_Server%20%28POSIX%29/|title=WASTE - Browse /wxWASTE Client_Server (POSIX) at SourceForge.net|website=sourceforge.net}}</ref>\n\n[[VIA Technologies]] released a [[Fork (software)|fork]] of WASTE under the name [[PadlockSL]], but removed the product's website after a few weeks. The user interface was written in [[Qt (software)|Qt]] and the client was available for GNU/Linux and Windows.<ref>{{Cite web|url=https://slashdot.org/story/04/04/16/1215204/via-pulls-padlocksl|title=VIA Pulls PadLockSL - Slashdot|website=slashdot.org}}</ref>\n\n== See also ==\n{{Portal|Free and open-source software}}\n* [[Peer-to-peer]] (P2P)\n* [[Anonymous P2P]]\n* [[File sharing]]\n* [[Friend-to-friend]] (F2F)\n\n==References==\n{{Reflist}}\n\n== External links ==\n* [http://wasteagain.sourceforge.net/ WASTE again] - a fork\n* [http://waste.sourceforge.net/ Original WASTE SourceForge site] - now defunct\n* {{webarchive |url=https://web.archive.org/web/20100317095429/http://www.rollingstone.com/news/story/5938320/the_worlds_most_dangerous_geek |date=March 17, 2010 |title=The World's Most Dangerous Geek(Rolling Stone interview with Justin Frankel) }}\n* [https://www.wired.com/wired/archive/12.04/start.html?pg=9 The Invisible Inner Circle]\n* [https://web.archive.org/web/20050121093556/http://www.marktaw.com/technology/AnonymousWaste.html Anonymous Communication With Waste]\n* [https://web.archive.org/web/20070804050303/http://www.showmedo.com/videos/video?name=sayersWaste000&fromSeriesID=63 'Secure File Transfer With WASTE - Introductory video'] by Russell Sayers at showmedo\n* [http://www.p2p-zone.com/underground/showthread.php?t=19077/ The Zer0Share Project] - Jack Spratts' Darknet\n{{File sharing protocols}}\n\n{{DEFAULTSORT:Waste}}\n[[Category:2003 software]]\n[[Category:File sharing networks]]\n[[Category:Anonymous file sharing networks]]\n[[Category:Windows instant messaging clients]]\n[[Category:MacOS instant messaging clients]]\n[[Category:Instant messaging clients for Linux]]\n[[Category:Free instant messaging clients]]\n[[Category:Free file sharing software]]\n[[Category:Free software programmed in C++]]\n[[Category:Cross-platform free software]]\n[[Category:Discontinued software]]",
            "slug": "waste",
            "date_updated": 1565239096247,
            "imported": "https://en.wikipedia.org/wiki/WASTE"
        }
    ]
}