{
    "article": [
        {
            "title": "Web directory",
            "text": "{{refimprove|date=February 2019}}\nA '''web directory''' or '''link directory''' is an online list or catalog of [[website]]s. That is, it is a directory on the [[World Wide Web]] of (all or part of) the World Wide Web. Historically, directories typically listed entries on people or businesses, and their contact information; such directories are still in use today. A web directory includes entries about websites, including links to those websites, organized into [[Categorization|categories]] and subcategories.<ref>{{cite web|title=Web directory|url=http://dictionary.reference.com/browse/web+directory|publisher=Dictionary|accessdate=30 August 2013}}</ref><ref name=\"about.com\">{{Cite web|url=http://websearch.about.com/od/enginesanddirectories/a/subdirectory.htm|title=What is a Web Directory|accessdate=2010-02-25|publisher=About.com|author=Wendy Boswell}}</ref><ref>{{cite web|title=Web Directory Or Directories|url=http://www.yourmaindomain.com/web-articles/what-is-web-directory.asp|publisher=yourmaindomain|accessdate=30 August 2013}}</ref> Besides a link, each entry may include the title of the website, and a description of its contents. In most web directories, the entries are about whole websites, rather than individual pages within them (called \"deep links\"). Websites are often limited to inclusion in only a few categories. \n\nThere are two ways to find information on the Web: by [[Web search engine|searching]] or [[browsing]]. Web directories provide links in a structured list to make browsing easier. Many web directories combine searching and browsing by providing a search engine to search the directory. Unlike search engines, which base results on a database of entries gathered automatically by [[web crawler]], most web directories are built manually by human editors. Many web directories allow site owners to submit their site for inclusion, and have editors review submissions for fitness.\n\nWeb directories may be general in scope, or limited to particular subjects or fields. Entries may be listed for free, or by paid submission (meaning the site owner must pay to have his or her website listed).\n\n'''RSS directories''' are similar to web directories, but contain collections of [[RSS feeds]], instead of links to web sites.\n\n==History==\nDuring the early development of the web,  there was a list of [[webserver]]s edited by [[Tim Berners-Lee]] and hosted on the [[CERN]] webserver. One historical snapshot from 1992 remains.<ref>{{cite web|url=http://www.w3.org/History/19921103-hypertext/hypertext/DataSources/WWW/Servers.html |title=World-Wide Web Servers |publisher=W3.org |date= |accessdate=2012-05-14}}</ref> He also created the [[World Wide Web Virtual Library]], which is the oldest web directory.<ref name=\"searchenginehistory.com\">{{Cite web|url=http://www.searchenginehistory.com/|title=History of Search Engines: From 1945 to Google Today|accessdate=2017-05-16|publisher=Search Engine History|author=Aaron Wall}}</ref>\n\n==Scope of listing==\nMost of the directories are general in on scope and list websites across a wide range of categories, regions and languages. But some niche directories focus on restricted regions, single languages, or specialist sectors. One type of niche directory with a large number of sites in existence is the [[shopping directory]]. Shopping directories specialize in the listing of retail [[e-commerce]] sites.\n\nExamples of well-known general web directories are [[Yahoo! Directory]] (shut down at the end of 2014) and [[DMOZ]] (shut down on March 14, 2017). DMOZ was significant due to its extensive categorization and large number of listings and its [[open content|free availability]] for use by other directories and search engines.<ref name=\"newscom\">Paul Festa (December 27, 1999), [http://www.news.com/2100-1023-234893.html Web search results still have human touch], ''CNET News.com'', retrieved September 18, 2007</ref>\n\nHowever, a debate over the quality of directories and databases still continues, as search engines use ODP's content without real integration, and some experiment using [[Data clustering|clustering]].\n\n== Development ==\n{{unref|section|date=April 2019}}\nThere have been many attempts to make building web directories easier, such as using automated submission of related links by script, or any number of available [[PHP]] portals and programs. Recently, [[social software]] techniques have spawned new efforts of categorization, with [[Amazon.com]] adding [[Tag (metadata)|tagging]] to their product pages.\n\n== Monetizing ==\nDirectories have various features in their listings, often depending upon the price paid for inclusion:\n* Cost\n** Free submission&nbsp;– there is no charge for the review and listing of the site\n** Paid submission&nbsp;– a one-time or recurring fee is charged for reviewing/listing the submitted link\n* [[No follow]]&nbsp;– there is a <code>rel=\"nofollow\"</code> attribute associated with the link, meaning search engines will give no weight to the link\n* Featured listing&nbsp;– the link is given a premium position in a category (or multiple categories) or other sections of the directory, such as the homepage. Sometimes called sponsored listing.\n* Bid for position&nbsp;– where sites are ordered based on bids\n* [[affiliate marketing|Affiliate links]]&nbsp;– where the directory earns commission for referred customers from the listed websites\n* Reciprocity\n** Reciprocal link&nbsp;– a link back to the directory must be added somewhere on the submitted site in order to get listed in the directory. This strategy has decreased in popularity due to changes in SEO algorithms which can make it less valuable or counterproductive.<ref>\n{{cite web |url=http://searchengineland.com/what-everyone-needs-to-know-about-good-bad-bland-links-129186 |title=What Everyone Needs To Know About Good, Bad & Bland Links |last=Schmitz |first=Tom |date=August 2, 2012 |website=searchengineland.com |publisher=Third Door Media |access-date=April 21, 2017 |quote=\"Reciprocal links may not help with competitive keyword rankings, but that does not mean you should avoid them when they make sound business sense. What you should definitely avoid are manipulative reciprocal linking schemes like automated link trading programs and three-way links or four-way links.\"}}\n\n</ref>\n** No Reciprocal link&nbsp;– a web directory where you will submit your links for free and no need to add link back to your website\n\n==Human-edited directories==\n{{unref|section|date=April 2019}}\nA human-edited directory is created and maintained by editors who add links based on the policies particular to that directory.\nHuman-edited directories are often targeted by [[search engine optimization|SEOs]] on the basis that links from reputable sources will improve rankings in the major [[Web search engine|search engine]]s. Some directories may prevent search engines from rating a displayed link by using redirects, [[nofollow]] attributes, or other techniques. Many human-edited directories, including [[DMOZ]], [[World Wide Web Virtual Library]], [[Business.com]] and [[Jasmine Directory]], are edited by volunteers, who are often experts in particular categories. These directories are sometimes criticized due to long delays in approving submissions, or for rigid organizational structures and disputes among volunteer editors.\n\nIn response to these criticisms, some volunteer-edited directories have adopted [[wiki]] technology, to allow broader community participation in editing the directory (at the risk of introducing lower-quality, less objective entries).\n\nAnother direction taken by some web directories is the paid for inclusion model. This method enables the directory to offer timely inclusion for submissions and generally fewer listings as a result of the paid model. They often offer additional listing options to further enhance listings, including features listings and additional links to inner pages of the listed website. These options typically have an additional fee associated but offer significant help and visibility to sites and/or their inside pages.\n\nToday submission of websites to web directories is considered a common SEO ([[search engine optimization]]) technique to get back-links for the submitted website. One distinctive feature of 'directory submission' is that it cannot be fully automated like search engine submissions. Manual directory submission is a tedious and time-consuming job and is often outsourced by [[webmasters]].\n\n==Bid for Position directories==\n{{unref|section|date=April 2019}}\n'''Bid for Position directories''', also known as bidding web directories, are paid-for-inclusion web directories where the listings of websites in the directory are ordered according to their bid amount. They are special in that the more a person pays, the higher up the list of websites in the directory they go. With the higher listing, the website becomes more visible and increases the chances that visitors who browse the directory will click on the listing.\n\n==See also==\n\n* [[Automated taxonomy construction]]\n* [[Article directory]]\n* [[List of web directories]]\n* [[Webring]]\n* [[Webography]]\n* [[Business directory]]\n\n==References==\n{{reflist}}\n\n==External links==\n* {{DMOZ|Computers/Internet/Searching/Directories/|Web directories}}\n\n{{Web syndication}}\n\n[[Category:Web directories| ]]\n[[Category:Search engine optimization]]",
            "slug": "web-directory",
            "date_updated": 1565239566371,
            "imported": "https://en.wikipedia.org/wiki/Web_directory"
        }
    ]
}