{
	"next_comment_id": 8,
	"user_name": "Iloveguac",
	"hub": "12cm58PYhaSaHUkKgsbf62Rg9Db5DukWYd",
	"post_like": {},
	"comment": [
		{
			"comment_id": 1,
			"body": "I can't see how any of this technology could possibly know what your skin looks like under your clothes. How will it know if you have tattoos, scars, or a birthmark? Nothing to be worried about at all. We've been able to manually copy and paste one person's head to another person's naked body for ages.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566058055
		},
		{
			"comment_id": 2,
			"body": "@Znnex: Well giving out real nudes would certainly remove the ability of anybody to blackmail you with fakes. If somebody got a picture of my face and threw it on a naked body it wouldn't bother me at all, because it's not a photo of me.\nI'd actually like to try this stuff out just to see how bad it really is.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566085302
		},
		{
			"comment_id": 3,
			"body": "@Kaffie: You missed my point, it's fake so anybody you know well will be able to spot the difference, and who cares about random people you don't know.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566097029
		},
		{
			"comment_id": 4,
			"body": "@Kaffie: If your coworkers are going to believe some stranger on the Internet more than you I think there are bigger problems.\nObviously the best practice is to just not post full body pictures of yourself in the first place, if the Internet only has access to your face, well I think even the stupidest of coworkers should be able to spot the differences.\nNo matter how good this tech get's it won't know what you really look like.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566097715
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: Oh I understand that. Actually wanted to try it myself, see what it could make from my face, but I couldn't find any code that I could run. The closest thing I could was https://github.com/junyanz/pytorch-CycleGAN-and-pix2pix but it didn't seem to be able to do the whole body from a face.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566098812
		},
		{
			"comment_id": 6,
			"body": "Well maybe being raised by a single father, surrounded my brothers I grew up differently than you. A fake nude wouldn't bother me.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1566039175",
			"date_added": 1566128711
		},
		{
			"comment_id": 7,
			"body": "I mean I only shower three days a week, and wear the same jeans for a few days in a row, but I change all my other clothes daily. I've never had anybody complain that I smell, well other than that one time I was stacking bags of literal shit in a garden center. I blame the chicken droppings for the smell though. :D",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1568279201",
			"date_added": 1568346587
		}
	]
}