{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Чем ZeroNet отличается от Project Maelstrom?",
			"body": "http://project-maelstrom.bittorrent.com/",
			"added": 1457317574
		},
		{
			"topic_id": 2,
			"title": "Нашел зеркало torrentfreak.com в ZeroNet",
			"body": "Вот оно http://127.0.0.1:43110/1JNqdTGVATFWRLzzYwVu19CuWYus5VmoUS/",
			"added": 1457318256
		},
		{
			"topic_id": 3,
			"title": "«Зеркалам» — бан,  за пропаганду обхода блокировок — штрафы  (РФ)",
			"body": "Роскомнадзор предлагает блокировать «зеркала» пиратских сайтов без решения суда\nПоисковики обяжут бороться с «зеркалами»\n\nПроблема распространения пиратского контента, по мнению рабочей группы, также подкрепляется тем, что «зеркала» легко найти с помощью поисковых систем.\nВ связи с этим правообладатели предлагают на законодательном уровне обязать поисковики удалять из поисковой раздачи ресурсы, на которых размещен пиратский контент.\nПри этом правообладатели поддержали борьбу с пропагандой средств обхода блокировок.\nПо мнению авторов поправок, распространение информации о порядке использования плагинов для браузеров и анонимайзеров существенно снижает эффективность борьбы с распространением нелегального контента.\n\nВ феврале документ об административной ответственности за пропаганду средств обхода блокировки сайтов был разработан Ассоциацией по защите авторских прав в интернете (АЗАПИ) и одобрен Роскомнадзором.\n\n«Введение административной ответственности за пропаганду средств обхода блокировки будет способствовать повышению эффективности блокирования запрещенных интернет-ресурсов», — отмечал глава АЗАПИ Максим Рябыко.\n\nНовыми поправками правообладатели предлагают ввести административный штраф за пропаганду для должностных лиц в размере от 3 тыс. до 5 тыс. руб., на лиц, осуществляющих предпринимательскую деятельность без образования юридического лица, — от 10 тыс. до 30 тыс. руб., на юридических лиц — от 50 тыс. до 100 тыс. руб.\n\n1) http://www.gazeta.ru/tech/2016/03/15/8123975/torrents_mirrors.shtml\n2) https://www.vedomosti.ru/technology/articles/2016/03/16/633698-poiskovie-sistemi-obyazhut-ubirat-ssilki-piratskie-saiti\n3) https://www.facebook.com/roskomnadzor.official/posts/1700394360239338",
			"added": 1458142278
		},
		{
			"topic_id": 4,
			"title": "Red Web: Россия примеряет «Великий китайский фаервол»",
			"body": "Кремль объединил свои усилия с китайскими властями для установления государственного контроля над Рунетом и его пользователями\nhttps://rublacklist.net/23615/ \nМосква в тесном сотрудничестве с Пекином работает над созданием собственной системы интернет-фильтрации и контроля интернета — Red Web («Красная сеть»), включающей в себя элементы китайского «Золотого щита», иногда также называемого «Великим китайским фаерволом».",
			"added": 1480425856
		}
	],
	"topic_vote": {
		"2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1K41NyBL97i49P3nv4RyUMtvBSjYJ9HB6y": [
			{
				"comment_id": 1,
				"body": "И какая тут анонимность тогда?",
				"added": 1457316672
			}
		],
		"2_1JSZ49XF58HCNGRpvHHs75DmRAcJUbzf4r": [
			{
				"comment_id": 2,
				"body": "Спам пошел",
				"added": 1457316738
			}
		],
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 3,
				"body": "> [cypher](#comment_16_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Хорошо, что zeronet сюда не подпадает, т.к. не является средством обхода блокировок. Тут всё своё.\n\nА тут можно \"пропагандировать\" способы обхода блокировок =)))  Это же не совсем интернет, попробуй тут кого найди)",
				"added": 1458144537
			}
		]
	},
	"comment_vote": {
		"4_18RfVGME7R14BmGRcbVbZ1RaHoaeBEKtZ3": 1
	}
}