{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "POSTE MÚSICAS AQUI!",
			"body": "\"Sem a música, a vida seria um erro.\" —  Friedrich Nietzsche",
			"added": 1588718962
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1_1Ljf3LCVnDRyzgjVwDLNJucYbhUGHRJbhZ": [
			{
				"comment_id": 1,
				"body": "#Download – NanoLinux: https://swarm-gateways.net/bzz:/0caac7fb01ceb34b95f43c88650c69764e70d9c6cdc3bf43c05fa4e5d6dccc0d/Nanolinux.zip (SHA-256: bcb58e9ddc825588cf683d846f762f0ac22291b3a5759a68ed69db489aec8d81)\n\n- Confira um vídeo demonstrando o Nanolinux 1.3: https://invidio.us/watch?v=0WPzt104ThA",
				"added": 1588701020
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 2,
				"body": "#A ilusão do empreendedorismo, o desemprego e a esquerda perdida\n\n- https://invidio.us/tgxrrq8VOX8\n\n- https://swarm-gateways.net/bzz:/63764d3155598473db48a0eaafc67932ce8533d01cf7961cf3a35ac1ed6c48f9/A+ilusão+do+empreendedorismo,+o+desemprego+e+a+esquerda+perdida-tgxrrq8VOX8.mp4\n\n#Indicações de textos complementares \n\nO “Que” de “Que fazer” de Althusser: https://web.archive.org/web/20200421193439/https://lavrapalavra.com/2019/12/06/o-que-de-que-fazer/\n\nDe onde vem o conservadorismo?: https://web.archive.org/web/20200328114003/https://blogdaboitempo.com.br/2015/04/15/de-onde-vem-o-conservadorismo/\n\nA “reforma” trabalhista gerou os efeitos pretendidos: https://web.archive.org/web/20200505204549/https://www.jorgesoutomaior.com/blog/a-reforma-trabalhista-gerou-os-efeitos-pretendidos\n\nO negócio é falar mal da CLT: https://web.archive.org/web/20190212021425/https://blogdaboitempo.com.br/2016/08/29/o-negocio-e-falar-mal-da-clt/\n\nGarantia de Emprego para Todos Brasileiros - c/ Dep. Glauber Braga: https://invidio.us/HezdSnx2El0\n\nAspectos políticos do Pleno Emprego, por Michal Kalecki: https://web.archive.org/web/20200326171626/https://jornalggn.com.br/gestao/aspectos-politicos-do-pleno-emprego-por-michal-kalecki/",
				"added": 1588711681
			},
			{
				"comment_id": 3,
				"body": "#A classe trabalhadora é TUDO e os empresários sabem\n- https://swarm-gateways.net/bzz:/82698350852f6d9575be7756c9d7d2a9eaf2316f96a986eb8d50dfd2f104163f/A+classe+trabalhadora+é+TUDO+e+os+empresários+sabem+_+066-aF_uMKC8E94.mp4\n\nRolou empresário humilhando funcionário pra pedir pro comércio abrir e a realidade é que isso escancara o desespero da burguesia pra fazer as mercadorias circularem, principalmente a força de trabalho e como ela circula na produção e no consumo na sociedade capitalista.\n\nVídeo especial pro dia dos TRABALHADORES, não do trabalho, e que vai seguir relevante, como a classe trabalhadora é!\n\nReferências em: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_0",
				"added": 1588717765
			},
			{
				"comment_id": 4,
				"body": "#Coisa de BURGUÊS\n- https://swarm-gateways.net/bzz:/b7b49aae5eb8d08c2157bbca859426d0b5acc71173642cc9d890cab642ae33fc/Coisa+de+BURGUÊS+_+059-l1U3uANOmXY.mp4\n\nComo é que se identifica uma pessoa burguesa na sociedade? Coisa de burguês é qualquer coisa que não seja sinônimo de pobreza? Seria hora de aprender a diferenciar acesso à consumo de posição de classe? E que uma posição de classe mediana, mesmo que influenciada pela ideologia burguesa, em nada consegue comprar o verdadeiro estilo de vida burguês?",
				"added": 1588718446
			}
		],
		"1_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": [
			{
				"comment_id": 5,
				"body": "#Porto Solidão -  Jessé\n- https://swarm-gateways.net/bzz:/ae295ab026c56568f2671d38e094506d2c79b3173c4305098b6b90b20bc6062d/_Porto+Solidão_......._Jessé_+Legendado-aZ4SVNUxN-E.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_9",
				"added": 1588719568
			},
			{
				"comment_id": 6,
				"body": "#Pra Não Dizer Que Não Falei Das Flores - Geraldo Vandré\n- https://swarm-gateways.net/bzz:/675e21aaa228b2059463557e17eb8a83d65195d8f33211d31502a8eb31b86d2e/Geraldo+Vandré+-+Pra+não+dizer+que+não+falei+das+Flores-1KskJDDW93k.mp4\n\n\"Pra não dizer que não falei das flores\" é uma canção escrita e interpretada por Geraldo Vandré. Ficou em segundo lugar no Festival Internacional da Canção de 1968. Teve sua execução proibida durante anos, após tornar-se um hino de resistência do movimento civil e estudantil que fazia oposição à ditadura militar brasileira, e ser censurada.Wikipedia (PT)\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_8",
				"added": 1588727309
			},
			{
				"comment_id": 7,
				"body": "#Another Brick In The Wall - Pink Floyd (Legendado PT-BR)\n- https://swarm-gateways.net/bzz:/d14846a439ac1987166106b370719dd6fa71fbe7f55f90290f21caa56ab6ab8b/Another+Brick+In+The+Wall+-+Pink+Floyd+(Legendado+PT-BR)-mP-ZAgsMAkE.mp4\n\nAnálise da música: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_7",
				"added": 1588728458
			},
			{
				"comment_id": 8,
				"body": "#Aleluia - Claudio Vektra\n- https://swarm-gateways.net/bzz:/0355ab2a1b5c7d1518ae16a3e919ea8e90681987c0aead01410520773ae2157e/CLAUDIO+VEKTRA+CANÇAO-ALELUIA-+CD+PROFETA-2012.-nZWHH7VVfls.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_6",
				"added": 1588728701
			},
			{
				"comment_id": 9,
				"body": "#O Escudo - Voz da Verdade\n- https://swarm-gateways.net/bzz:/5568ec7e4470f2bc37617e73955a152ad8dc39f15779f7d3cf5844a595ec5c6f/O+escudo+-+Voz+da+Verdade-CztPQwby0O8.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_10",
				"added": 1588729325
			},
			{
				"comment_id": 12,
				"body": "#Efésios 6 - Anderson Freire\n- https://swarm-gateways.net/bzz:/11989e06281969765f9fd3b9a0165bf406489a22b182ff618d1e1b5ef4bbcd43/Efésios+6+-+Anderson+Freire+com+letra-oCLUawi4HYY.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_11",
				"added": 1588729820
			},
			{
				"comment_id": 13,
				"body": "#Akekho Ofana Nojesu - Universal Gospel Choir\n- https://swarm-gateways.net/bzz:/355e9169066b859121fde53c66e73cef713eb4cf1fec89ca08a3cac234ad919b/AKEKHO+OFANA+NOJESU+Universal+Gospel+Choir+Legendado+Portugues+(video-letra+louvores+MAEP)-PfPpXHKIc0s.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_12",
				"added": 1588730314
			},
			{
				"comment_id": 14,
				"body": "#Eu Navegarei - Gabriela Rocha\n- https://swarm-gateways.net/bzz:/a2258d592d9d404f0410a305507ef790ec885cb20554a50406e51e0832eaa6c2/GABRIELA+ROCHA+-+EU+NAVEGAREI+(CLIPE+OFICIAL)+_+EP+CÉU-nSvxVCdj_gU.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_13",
				"added": 1588730992
			},
			{
				"comment_id": 15,
				"body": "#Precioso - Marcello Brayner\n- https://swarm-gateways.net/bzz:/55840a98a49058632479d63f0f9fcbd4d440521d384ee546ce2072aba33529c5/Precioso+(Trilha+sonora+novela+Jesus)+-+Marcello+Brayner-2UQygx3JcPg.mp4\n\nLetra: http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU_14",
				"added": 1588731219
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 10,
				"body": "Filhos, obedeçam a seus pais no Senhor, pois isso é justo.\n\"Honra teu pai e tua mãe\", este é o primeiro mandamento com promessa:\n\"para que tudo te corra bem e tenhas longa vida sobre a terra\".\nPais, não irritem seus filhos; antes criem-nos segundo a instrução e o conselho do Senhor.\nEscravos, obedeçam a seus senhores terrenos com respeito e temor, com sinceridade de coração, como a Cristo.\nObedeçam-lhes não apenas para agradá-los quando eles os observam, mas como escravos de Cristo, fazendo de coração a vontade de Deus.\nSirvam aos seus senhores de boa vontade, como ao Senhor, e não aos homens,\nporque vocês sabem que o Senhor recompensará a cada um pelo bem que praticar, seja escravo, seja livre.\nVocês, senhores, tratem seus escravos da mesma forma. Não os ameacem, uma vez que vocês sabem que o Senhor deles e de vocês está nos céus, e ele não faz diferença entre as pessoas.\nFinalmente, fortaleçam-se no Senhor e no seu forte poder.\nVistam toda a armadura de Deus, para poderem ficar firmes contra as ciladas do diabo,\npois a nossa luta não é contra pessoas, mas contra os poderes e autoridades, contra os dominadores deste mundo de trevas, contra as forças espirituais do mal nas regiões celestiais.\nPor isso, vistam toda a armadura de Deus, para que possam resistir no dia mau e permanecer inabaláveis, depois de terem feito tudo.\nAssim, mantenham-se firmes, cingindo-se com o cinto da verdade, vestindo a couraça da justiça\ne tendo os pés calçados com a prontidão do evangelho da paz.\nAlém disso, usem o escudo da fé, com o qual vocês poderão apagar todas as setas inflamadas do Maligno.\nUsem o capacete da salvação e a espada do Espírito, que é a palavra de Deus.\nOrem no Espírito em todas as ocasiões, com toda oração e súplica; tendo isso em mente, estejam atentos e perseverem na oração por todos os santos.\nOrem também por mim, para que, quando eu falar, seja-me dada a mensagem a fim de que, destemidamente, torne conhecido o mistério do evangelho,\npelo qual sou embaixador preso em correntes. Orem para que, permanecendo nele, eu fale com coragem, como me cumpre fazer.\nTíquico, o irmão amado e fiel servo do Senhor, lhes informará tudo, para que vocês também saibam qual é a minha situação e o que estou fazendo.\nEnviei-o a vocês por essa mesma razão, para que saibam como estamos e para que ele os encoraje.\nPaz seja com os irmãos, e amor com fé da parte de Deus Pai e do Senhor Jesus Cristo.\nA graça seja com todos os que amam a nosso Senhor Jesus Cristo com amor incorruptível.\n\n- Efésios 6:1-24",
				"added": 1588729649
			},
			{
				"comment_id": 11,
				"body": "Davi cantou ao Senhor este cântico, quando este o livrou das mãos de todos os seus inimigos e das mãos de Saul,\ndizendo: \"O Senhor é a minha rocha, a minha fortaleza e o meu libertador;\no meu Deus é a minha rocha, em que me refugio; o meu escudo e o meu poderoso salvador. Ele é a minha torre alta, o meu abrigo seguro. És o meu salvador, que me salva dos violentos.\nClamo ao Senhor, que é digno de louvor, e sou salvo dos meus inimigos.\n\"As ondas da morte me cercaram; as torrentes da destruição me aterrorizaram.\nAs cordas da sepultura me envolveram; as armadilhas da morte me confrontaram.\nNa minha angústia, clamei ao Senhor; clamei ao meu Deus. Do seu templo ele ouviu a minha voz; o meu grito de socorro chegou aos seus ouvidos.\n\"A terra abalou-se e tremeu, os alicerces dos céus estremeceram; tremeram porque ele estava irado.\nDas suas narinas saiu fumaça; da sua boca saiu fogo consumidor; dele saíram brasas vivas e flamejantes.\nEle abriu os céus e desceu; nuvens escuras estavam debaixo dos seus pés.\nMontou sobre um querubim e voou; elevou-se sobre as asas do vento.\nPôs as trevas ao seu redor; das densas nuvens de chuva fez o seu abrigo.\nDo brilho da sua presença flamejavam carvões em brasa.\nDos céus o Senhor trovejou; ressoou a voz do Altíssimo.\nEle atirou flechas e dispersou os inimigos, arremessou raios e os fez bater em retirada.\nOs vales apareceram, e os fundamentos da terra foram expostos, diante da repreensão do Senhor, com o forte sopro de suas narinas.\n\"Das alturas estendeu a mão e me segurou; tirou-me de águas profundas.\nLivrou-me do meu inimigo poderoso, dos meus adversários, que eram fortes demais para mim.\nEles me atacaram no dia da minha calamidade, mas o Senhor foi o meu amparo.\nDeu-me ampla liberdade; livrou-me, pois me quer bem.\n\"O Senhor me tratou segundo a minha retidão; segundo a pureza das minhas mãos me recompensou.\nPois guardei os caminhos do Senhor; não cometi a perversidade de afastar-me do meu Deus.\nTodos os seus mandamentos estão diante de mim; não me afastei dos seus decretos.\nTenho sido irrepreensível para com ele e guardei-me de pecar.\nO Senhor recompensou-me segundo a minha retidão, segundo a pureza das minhas mãos perante ele.\n\"Ao fiel te revelas fiel, ao irrepreensível te revelas irrepreensível,\nao puro te revelas puro, mas ao perverso te revelas astuto.\nSalvas os humildes, mas os teus olhos estão sobre os orgulhosos para os humilhar.\nTu és a minha lâmpada, ó Senhor! O Senhor ilumina-me as trevas.\nContigo posso avançar contra uma tropa; com o meu Deus posso transpor muralhas.\n\"Este é o Deus cujo caminho é perfeito; a palavra do Senhor é comprovadamente genuína. Ele é escudo para todos os que nele se refugiam.\nPois quem é Deus além do Senhor? E quem é Rocha senão o nosso Deus?\nÉ Deus quem me reveste de força e torna perfeito o meu caminho.\nEle me faz correr veloz como a gazela e me firma os passos nos lugares altos.\nÉ ele que treina as minhas mãos para a batalha, e assim os meus braços vergam o arco de bronze.\nTu me dás o teu escudo de livramento; a tua ajuda me fez forte.\nAlargas sob mim o meu caminho, para que os meus tornozelos não se torçam.\n\"Persegui os meus inimigos e os derrotei; não voltei enquanto não foram destruídos.\nEsmaguei-os completamente, e não puderam levantar-se; caíram debaixo dos meus pés.\nTu me revestiste de força para a batalha; fizeste cair aos meus pés os meus adversários.\nFizeste que os meus inimigos fugissem de mim; destruí os que me odiavam.\nGritaram por socorro, mas não havia quem os salvasse; gritaram ao Senhor, mas ele não respondeu.\nEu os reduzi a pó, como o pó da terra; esmaguei-os e os amassei como a lama das ruas.\n\"Tu me livraste dos ataques do meu povo; preservaste-me como líder de nações. Um povo que eu não conhecia me é sujeito.\nEstrangeiros me bajulam; assim que me ouvem, me obedecem.\nTodos eles perdem a coragem; saem tremendo das suas fortalezas.\n\"O Senhor vive! Bendita seja a minha Rocha! Exaltado seja Deus, a Rocha que me salva!\nEste é o Deus que em meu favor executa vingança, que sujeita nações ao meu poder;\nque me livrou dos meus inimigos. Tu me exaltaste acima dos meus agressores; de homens violentos me libertaste.\nPor isso te louvarei entre as nações, ó Senhor; cantarei louvores ao teu nome.\nEle concede grandes vitórias ao seu rei; é bondoso com o seu ungido, Davi e seus descendentes para sempre\".\n\n- 2 Samuel 22:1-51",
				"added": 1588729716
			}
		]
	},
	"comment_vote": {
		"2_1FvmEeafb1mjKoeZajJooyEyVZ9A5rPjPU": 1
	}
}