{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1579140316,
			"title": "How to win any argument....",
			"body": "Just censor them:\n\nhttps://twitter.com/Mailchimp/status/1217073200414306304\nhttps://www.nytimes.com/2018/07/20/business/media/sleeping-giants-breitbart-twitter.html\n\n\n\nThis one is strange. She's an American citizen working out of Berlin? Has published instructions on how to move to Germany as a \"freelancer\". 30 yo? There's a story here - but I haven't been able to find it. Suspect she's queer.\n\nShe's effective tho. Apparently has managed to strip Breitbart of 70% of their revenue, and has doxed many others. Certain Breitbart must know a lot about her since she hurt them so badly.\n\nThat story about \"people who live in glass houses\"? Karma should visit this bitch.\n\n\nhttps://www.thedrum.com/news/2019/09/04/sleeping-giants-breitbart-and-brand-safety-its-not-our-job-police-your-ads\n\nhttps://nandinijammi.com/about/\n\nhttp://voxday.blogspot.com/2020/01/fight-back-or-else.html\n\n\n\nTrying to find this \"Legal Legion of Evil\". Might send them money.\n\nI have made it very, very clear that the Legal Legion and I will vigorously exercise our legal rights whenever an individual - whether she calls herself a reporter or not - or organization attempts to interfere with our various contractual relationships. And if anyone doubts that we've laid more than a few legal traps in preparation for those inevitable attempts, well, perhaps you should go and talk to Patreon about how much they are enjoying their current dance with the Legion.\n\nAnd since we're on the subject, if you are a New York, Georgia, or California lawyer who is interested in collecting skulls and scalps by putting in some pro bono time with the LLoE, get in touch. I can assure you, no one is having more fun these days than the Legal Legion.\n\n\nWould enjoy seeing her bogged down with legal debts for a decade. That would take her just past the point where reproduction becomes impossible - even with artificial assistance. She needs to die a bitter old spinster. Karma satisfied.\n\nYou don't take prisoners with censorship. Should always be a fight to the death....",
			"added": 1579140315
		},
		{
			"topic_id": 1579399038,
			"title": "Why gun control?",
			"body": "https://i.redd.it/07gu02xd4jb41.jpg",
			"added": 1579399036
		},
		{
			"topic_id": 1579475766,
			"title": "How to Host Your Own Decentralized Site for Free on ZeroNet  2020/01/16",
			"body": "https://cheapskatesguide.org/articles/zeronet-site.html\n\nThought he did a good job here - so reposting.",
			"added": 1579475763
		},
		{
			"topic_id": 1579489896,
			"title": "I love this one :) He probably would too.",
			"body": "https://i.redd.it/g1h9x3jekob41.jpg\n\nHeard he enjoyed running his wheelchair over the toes of royals......",
			"added": 1579489892
		},
		{
			"topic_id": 1579676977,
			"title": "I trust the Tor people to do what they can to fix problems (but)",
			"body": "They sometimes come across as \"stubborn little nerds\" who deny their own eyes.\n\nThe Tor browser causes freezing and often glitches with Zeronet. Firefox does not. Not even a little bit.\n\nI'm sure there's something I've missed along the way, but there are counters to that and I'm using them. Using any browser for a localhost server should be simple, simple, simple.\n\nSo these days I just leave the Tor browser running so Zeronet can use it's updated Tor proxy...but mostly post using Firefox....and always using the discipline of a full Zeronet URL. Helps to know where you are going......\n\nIf Zeronet was built correctly, nothing on the internet should see that browser. Any browser.\n\nJust thought I'd pass this along. It will work until the Poindexters finish their arguments.",
			"added": 1579676972
		},
		{
			"topic_id": 1579733691,
			"title": "ZeroTalk seems to be a wretched hive of crazy people...",
			"body": "https://www.reddit.com/r/zeronet/comments/es2kdq/zerotalk_seems_to_be_a_wretched_hive_of_crazy/\n\nThumb on nose salute to this guy:\n\n\"You can't replace the internet with something where 90% of the content is posted by moonbats and wingnuts. Before looking at it, I had hope that ZeroNet might replace the regular internet, but it's clear this network only exists for people who honestly believe that the regular internet and society in general is rotten to the core (rather than just tarnished by greed).\n\ntl;dr: ZeroTalk is an online insane asylum, I'm going to run as far away from Zeronet as possible.\"\n\nHe needs to run to his mommy....",
			"added": 1579733685
		}
	],
	"topic_vote": {},
	"next_comment_id": 78,
	"comment": {
		"1575709869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "You're not a psychopath if you are self centered. Save your altruistic side for those who matter.\n\nSelf centered people are immune to suicide. They just are. The only people who succumb to suicide care excessively what others think. Becoming a modern disease.  \n\nTheir mirror diseased twin is the \"witch burner\". There currently is an oversupply. Hopefully governments around the world will increase bag limits so we can bring their numbers down. Such people are very destructive and fewer should not be allowed to exist.\n\n\"Minding one's own business and trying not to be a public annoyance\"....my how that seems like such a quaint idea now?\n\nHoping that some develop appetites for ending SJWs. Bravo to those who accumulate large body counts. Such \"disinfectant\" players should be celebrated.\n\nAll of us know those who really should not breath any more. Do them. Not yourself. Make your life count.",
				"added": 1579126164
			}
		],
		"1579112743_1sQE8j9Sb9fc6uqoPqyqgEXJVnVN3xXL8": [
			{
				"comment_id": 2,
				"body": "> [draugrdeathlord](#comment_401_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Internet tough guy ðŸ¤­\n\nIt's not his fault. He was born this way. Look up the frightening twin studies data. Humans are no different than animals. Behavior is set at conception....just may take awhile to express itself in all it's \"splendor\" <sarc>.\n\nSome people are just born assholes. And by random chance miss being ended.",
				"added": 1579126647
			},
			{
				"comment_id": 15,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1705_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): and i suppose \"you're the king asshole\"? [...]\n\nHow many dicks have been in your mouth over a lifetime?",
				"added": 1579139478
			}
		],
		"1579115866_152JLSuJAhrKabbvowpHjq5W6TzpxmYW3w": [
			{
				"comment_id": 3,
				"body": "Zeronet is very hit or miss. \n\nI do wish those sampling it would think a bit before throwing it aside as too haaaard (whiny voice).\n\nIt's new, there are problems and glitches. But what's it worth to you to be freed? \n\nOnly the new user can answer that for themselves - but it's worth serious consideration.  Perhaps spending some bux to support it properly.\n\nAnd if you feel it's important - do what you can to support the Tor network. Like setting up a relay. Participate in telling the creep authorities \"NO\".",
				"added": 1579127010
			}
		],
		"1578882405_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "PCs are bad investments. They are like those $30K musclecars kids build - then sell for a song to raise cash.\n\nEveryone can learn from screwing up.",
				"added": 1579127245
			}
		],
		"1579050143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1686_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): all of you, What did you give in return?\n\nSupported the Tor network for over a decade through a fiber connection so people like you can piss everyone off.",
				"added": 1579127378
			},
			{
				"comment_id": 35,
				"body": "> [draugrdeathlord](#comment_409_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): LOL !Still have a relay going here 7 years and ticking. Never provided an exit node though.My gift to ZN is on AVG 110 gigabytes uploaded per week. My ratio per day is around 6 to 10 ðŸ”¥ðŸ”¥\n\nWe need more like you",
				"added": 1579305129
			},
			{
				"comment_id": 36,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1707_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): did your pope send you a Medal for that, or 'Give you a Blowjob'? [...]\n\nYou're clearly a long term sniffer of your own farts. h3....ya gotta lay off that stuff. It has fucked up your brain.",
				"added": 1579305531
			},
			{
				"comment_id": 37,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1709_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): who caresyou're 'tools'and work 'for the system'. [...]\n\nH3...do you have any girlfriends. Have you ever seen pussy?",
				"added": 1579305611
			},
			{
				"comment_id": 50,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1730_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you belong to that group: \"the users\".\n\nThat does it. Gonna call your mom now and show her all the shit you post. Your nose will be in the corner for Eons......",
				"added": 1579486741
			}
		],
		"1579113760_1sQE8j9Sb9fc6uqoPqyqgEXJVnVN3xXL8": [
			{
				"comment_id": 6,
				"body": "Positioning yourself as a wit? You only made it halfway.......",
				"added": 1579127480
			}
		],
		"1578854998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 7,
				"body": "Males will be attracted to young females - that's not news. Or shouldn't be. They'd be defective if they weren't.\n\nWhat's changed here are religions and cults. And few have the guts to stand up to such peer pressure. Particularly media fanned peer pressure. Accordingly, if your job was as useless and worthless as a royal - you would be scared too.  :)  Gravytrain upended.\n\nIf females can bleed - they can breed. Though too early breeding can do serious damage. That's why families once had a say and some restraint on the blind reproductive drive of males. They also demanded that their kin gain the ancient protections of marriage before sexual access was granted.\n\nAnd that's the real problem here. Epstein was getting females on the cheap (or trying). Now that many of those females are well on their spinster path - they want revenge and money. It's that simple. Endless rationalizations will be aired to justify what they see as \"mine\"....and rest of us get to listen endlessly to this rubbish.\n\nAll was avoidable had Epstein simply become a citizen of a country where polygamy is legal - and just married them. Might not have worked for Andrew tho :) His \"job\" would have excluded such benefits :)\n\nThings were so much simpler in Khan's time. If he wanted a woman - he just took her. Chances are he previously killed all her male relatives anyway....\n\nhttps://www.thevintagenews.com/2018/06/09/genghis-khan/\n\nI hate watching prominent males cower like Andrew. That alone is reason for the royals to get rid of him. He should have instead simply stated that he liked women and wanted more of them. Then let those heads explode.\n\nAnd is some journo or activist had become a menace to him - he should have fucked their wife or daughter. Been that sneaky neighbor dog......",
				"added": 1579128704
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 8,
				"body": "Find a way to kill him. We're allowing too much trash to survive in this world.\n\nHe's done it to others. He'll do it again. All thieves are born that way. Niggers just bear more of them.",
				"added": 1579128948
			},
			{
				"comment_id": 17,
				"body": "> [hferbwauif](#comment_67_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): This. You're probably a privileged white male and don't see you would've done the same if you were him and was born into this fucked up world where you are considered little more than trash if you aren't born with a particular skin color.Fellow white people, we need to stop blaming other races for acts that we ourselves have driven them to commit.\n\nThat's bullshit. A thief is a thief. Clarity is seeing a thief as a thief and reacting to that. I'm not responsible for more thieves being born black. Bury them with the white thieves.\n\nOur modern problem is too little violence. If you were a police officer pulling over a guy in the '50's - you knew he might be a survivor of Iwo Jima. They didn't take prisoners in that war. So you knew it might not be difficult for such individuals to add another notch and you would have handled them accordingly with respect and firmness. No police criminality.\n\nCops today know that the supply of such people has declined...so they are just more free to abuse. And they do.\n\nThat nigger took the bicycle because he knew he'd get away with it - not because of some systematic oppression he was dealing with. There's no need to overthink this. Kill this nigger and word will get around. They'll steal from someone else. Killing works. Plenty of evidence in the news ALL the time.",
				"added": 1579145466
			},
			{
				"comment_id": 21,
				"body": "For all the SJW flies attracted to this dogshit: https://ibb.co/rQrc4pQ",
				"added": 1579241332
			},
			{
				"comment_id": 28,
				"body": "> [styromaniac](#comment_1720_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're going to be disappointed to trust whites more than blacks. It's financially dangerous. Don't leave yourself open to any thief just because they're not black.\n\nMeh....with white thieves you just use a larger caliber. Sneaky bastards.   :)",
				"added": 1579303888
			},
			{
				"comment_id": 29,
				"body": "> [cynyc](#comment_7_1DZMEripELi5Ewz34FYwP1LdGyo5jEgbG5): You stupid Chinese troll\n\nNYC. Took a shit there once.",
				"added": 1579304004
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_1723_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): So... you think that retrospect will save your finances... [...]\n\nMany states have castle laws. While killing someone is never routine and always has unforseen consequences (any lawyer will tell you that) - it's also true that ALL homeowners reliably are acquitted or never changed. Google it. It happens and it works. Even the lowest guy on the totem pole gets off under castle laws.\n\nNow if you live in a state without castle laws, well....that's your rut. Enjoy it. Or change it. No need to live in a shithole country.\n\nThere was a case two years ago where a sheriffs deputy broke into a home at 2AM seeking to serve a warrant. He was shot and killed by the homeowner. Sheriff's department wanted this guy badly. He had a history, and had killed one of THEIRS.\n\nGrand jury refused to charge him. It was dropped.\n\nSubmission to bullies and criminals is a drug. People who do that need rehab. The prospect of sudden deadly violence makes people civilized. It works and has worked for centuries.",
				"added": 1579319026
			},
			{
				"comment_id": 40,
				"body": "> [draugrdeathlord](#comment_420_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Corporate multinational tax evasion is the biggest theft foisted on us.\n\nIt's much worse than that. The Government just hands corporations our money while telling them \"don't do that again\". Same sort of limp dick response as when people allow others to take their shit. Corporate mutherfuckers who fail must just die. Should die. And if they caught not paying their taxes - we get to own them.\n\nI don't doubt the sincerity of these \"nice guys\" who want everyone to get along or fix their mistakes. Just claim that it doesn't work. Nothing changes until someone or something dies. THEN things get fixed.\n\nWells Fargo - DEAD\nCiti - DEAD\nJPMorgan - Dead\n\nNone of these companies deserved to live. None of the fools who borrowed too much from them should have escaped bankruptcy.\n\nWe've managed to combine the worst of both capitalist and socialist thinking with no advantage to show for it. Government excess burn rate is now $1 tril/yr, the fed injected another half trillion in December just to prevent collapse - yet we keep doing the same things expecting better outcomes. Worse, the entire world copies these stupids. \n\nEasier to just fix it. Everyone goes through bankruptcy, lying promises get erased, and government lives within it's income. All would be better. Like ripping a bandage off instead of wringing your hands endlessly about it.",
				"added": 1579323994
			},
			{
				"comment_id": 44,
				"body": "> [totaldarkness](#comment_20_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer): I guess there are no stoics in this thread? Maybe he needed that bike more than you. Either way he just proved his integrity was only worth $700. Maybe next time buy a cheaper bike - less likely to be stolen that way.\n\nWhat horseshit. You sound like someone from a California cult. It's amazing that anyone can be brainwashed into believing they owe anything to a thief. I feel sorry for you.",
				"added": 1579376708
			}
		],
		"1579127506_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 9,
				"body": "You're here - so it must be retard heaven.",
				"added": 1579129099
			}
		],
		"1578995205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "I don't think anyone really understands all these connections. Not really. We need to get a better handle on these problems but it's not clear where to even start. So we'll probably respond in the \"reaction mode\" with minimal effectiveness :(\n\nThe most critical task at hand? Make it easier for young people to form families early and have children. They also need a reasonable prospect of being able to support those children for 20-26 yrs.\n\nIf we can't get that part right - the other efforts will fail.",
				"added": 1579129460
			},
			{
				"comment_id": 11,
				"body": "> [anshorei](#comment_81_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Good luck turning coal miners into coders.\nCoding will soon be automated. It's a trap.",
				"added": 1579129636
			},
			{
				"comment_id": 12,
				"body": "> [aassddff](#comment_2_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): If you take Scarcity as in \"finite\", there's no such thing as post-scarcity.  [...]\n\nWe may also be in for a few surprises with our energy supplies - particularly petroleum energy (which is the most useful).\n\nThe problem has disappeared into our collective memory hole - but that doesn't mean we won't face it. No one is making any profit at current prices which means they will increase. Can we even function without cheap oil? Wonder - but have my own doubts.\n\nAlmost any new oil project except a very tiny sliver of outliers requires $100/bbl to break even. True even in the middle east.\n\nWhen this miscalculation becomes obvious - there will be hell to pay.",
				"added": 1579130057
			},
			{
				"comment_id": 18,
				"body": "draugrdeathlord â” 4 hours ago ^1 ^2\nReply\nâ‹®\n\nThere is no shortage of uranium and all its related isotopes. This energy scarcity is a manufactured crisis.\n\nNot so sure. The easy stuff has been found. So while there may be \"500 yrs or more\" available - it won't be at an extraction price we can afford. It gets worse too. *IF* it becomes clear we really can't afford current CO2 emissions - what do we do then? Even turning entirely toward nuclear has problems. Like batteries, we've been working on that stuff for decades and none of the options are very good.\n\nDoesn't help when people develop these religions and deliberately or unconsciously change the numbers. It's too easy to make big mistakes right now. Witness all these accounts detailing how poorly maintained all these weather stations are and how unreliable the historical data truly is. US has only 20ea calibrated weather stations. Probably much worse elsewhere. Yet that doesn't stop these people from wailing that the gods have turned against us.\n\nHaven't investigated to determine if it's just more propaganda....but some claim windpower has a negative ROI. WTF....they were saying it was cheaper than gas. So who is lying here?",
				"added": 1579147439
			}
		],
		"1578981843_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 13,
				"body": "Just some kindergarten teachers worst students trying to retain their bullshit jobs. CIA, Mossad...whatever. All are wards of the state and their taxpayer's problem.\n\nNot every kid born will ever do productive work. Some become welfare queens. It really is that simple.",
				"added": 1579130260
			},
			{
				"comment_id": 23,
				"body": "> [thetruth](#comment_77_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): Another one \"EXPOSED\", belonging to the false \"TRIBE\"\n\nHahahaha WTF are you talking about?",
				"added": 1579243486
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 14,
				"body": "Anyone know why they changed the path to their list? Took me awhile to figure out what they had done to break my installation.",
				"added": 1579130496
			}
		],
		"1579140316_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 16,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1713_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Instead of worrying about 'how many dicks in my mouth(1)', you should be asking yourself \"what's wrong with you and your generation\". [...]\n\nI can stack bodies. That would be exhilarating. Fun.\n\nBut YOUR head would be different. I'd have it mounted and keep it for awhile. Then I'd find some queer perverts to keep it in their queer bar permanently. People make bets. But when they lose the penalty would be putting their dick in h3bhkj5gqz4n3pjm's mouth. You'd be worn out in no time.",
				"added": 1579144217
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [
			{
				"comment_id": 19,
				"body": "I want a system that is simple, fair, thrifty and ruthless with deadbeats. And we really do some some agreement among ourselves where to limit government. Because they DON'T spend your money as efficiently as you can.\n\nPonder for a moment all those welfare queen federal employees you support. They contribute NOTHING - yet you still pay for them. What chumps taxpayers are.\n\nFire the CIA, FBI, NSA....make sure they are off the gravy train forever. Then hire SKILLED people for the IRS. Ones who can make rich people great taxpayers again.  :)",
				"added": 1579240441
			}
		],
		"1576233739_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 20,
				"body": "The problem with these conspiracy stories? When is the last time you witnessed competence in government work?\n\nMaybe it's all in your imagination the government was this competent? Maybe they were chumped?",
				"added": 1579240576
			},
			{
				"comment_id": 22,
				"body": "> [draugrdeathlord](#comment_447_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): The deepstate is very competent. Government not so much.\n\nI remain unconvinced. Those guys are only interested in paychecks and perks. Though I'll concede they may have developed an appetite for young pussy too.\n\nWhatever the real explanation for Epstein's killing - it will be ridiculous. As a sponsor of this bullshit - you'll be shaking your head in disbelief.",
				"added": 1579243292
			}
		],
		"1579175074_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 24,
				"body": "I don't care. Gonna kill and eat any I find before they get me :) Only way to be sure.",
				"added": 1579243566
			},
			{
				"comment_id": 25,
				"body": "> [thetruth](#comment_93_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): There has been a contract/ understanding and it was breached by humans again, as no man can be trusted, especially men from U.S. [...]\n\nDamn! They know about that one?",
				"added": 1579243625
			}
		],
		"1579150474_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 26,
				"body": "I really wish China and the US would quit trying to oneup and just trade. Win-win only. Both sides better off.\n\nIt's easy to enforce. Both sides pay only with expiring currency for purchases. If the selling party fails to use that currency within to years to purchase American or Chines goods - that currency becomes worthless.\n\nWe don't need endless negotiations from grand poobahs. We just need rules and enforcement.\n\nTrump needs to get over this need of his to inject himself into evrything. Just fix the border and STFU. \n\nBone weary of listening to the Washington clownposse babble.",
				"added": 1579243992
			}
		],
		"1579146540_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 27,
				"body": "It works, but what does this mean?",
				"added": 1579244207
			},
			{
				"comment_id": 41,
				"body": "> [quantumkitty](#comment_444_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): STL files are for 3d printing.\n\nThanks for the explanation. Aren't such printers still; beyond the reach of casual users?",
				"added": 1579324144
			},
			{
				"comment_id": 43,
				"body": "> [quantumkitty](#comment_448_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): People have been living under a cave while there's entire channels with millions of views dedicated to 3d printing on YouTube.\n\nOn eof the issues I'm sure is real world maintainability. Inkjets work great - when they work. Rest of the time they're just like some spray gun you forgot to clean :)\n\nWill look at it though. Have also looked at \"machine shops in a box\" which are still pricey.",
				"added": 1579352175
			}
		],
		"1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q": [
			{
				"comment_id": 30,
				"body": "Nancy should send her intern to blow Trump before he's impeached. It's only fair.",
				"added": 1579304160
			}
		],
		"1579271298_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 31,
				"body": "Setup a nonsense group on one of the chan boards like 08chan or Millchan. Traffic is low enough where your files might be safe for a couple years before new users roll them off that storage :)\n\nIt's kind of a stupid method - but would likely work. And I suspect there are several seeders mirroring that zite which gives you some redundancy.",
				"added": 1579304457
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 32,
				"body": "It's bad enough we have internal rascals, but the foreign ones you should be able to kill and eat.\n\nUnfortunate best we can do with the internal ones is make them unemployed :(",
				"added": 1579304598
			}
		],
		"1576287725_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 33,
				"body": "Yeah, many have a hunch that we're being played by Isis AND our own government. Just to keep these unworthies employed.",
				"added": 1579304686
			}
		],
		"1579216230_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 34,
				"body": "> [draugrdeathlord](#comment_444_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): For now I will just have faith in the CLI working, by experiment I think things did work. I do see allot more peers connected consistently with faster publish as a result.\n\nYou know about this site? They changed the link a week back. That link to an updated tracker list will more than double your access to trackers.\n\nOR you can just change your config file:\n\n[global]\ntrackers_file = \n data/15CEFKBRHFfAP9rmL6hhLmHoXrrgmw4B5o/cache/1/_h_.html\ntrackers = \n zero://boot3rdez4rzn36x.onion:15441\n zero://zero.booth.moe#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:443\n udp://tracker.coppersurfer.tk:6969\n udp://amigacity.xyz:6969\n udp://104.238.198.186:8000\n http://tracker01.loveapp.com:6789/announce\n http://open.acgnxtracker.com:80/announce\n http://open.trackerlist.xyz:80/announce\n zero://2602:ffc5::c5b2:5360:26312\ntor = always\nopen_browser = False\nfileserver_port = 25514\ntor_controller = 127.0.0.1:9151\ntor_proxy = 127.0.0.1:9150",
				"added": 1579305006
			}
		],
		"1579306799_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 38,
				"body": "My Zeronet swap file grows over time despite 10Gb of dram. Even if that gets fixed, suspect you'd get more done with 6e Zeronet laptops run headless. Each could concentrate on seeding a separate portion of Zeronet.\n\nCurrent protype here uses a 2Tb SSD\n\nUbuntu is apparently working on a centralized  system to control corporate laptops. Would be easy to scale to any level you wish.\n\nAnd there's always this: https://www.youtube.com/watch?v=splC57efBFQ&feature=emb_logo",
				"added": 1579318220
			},
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_1727_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm now thinking of a site seed system like so: [...]\n\nOr you might wish to use \"folderaxe\" to separate your files into separate equally balanced folders?",
				"added": 1579351955
			}
		],
		"1579391304_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 45,
				"body": "There's no reason for it not to proceed peaceably. Only the Journos and Feds are ginning this. If everyone ignores them - nothing will happen. Citizen anger and personal weapons will be on display - but nothing else. Virginia's governor thanked the NRA this week for an earlier peaceful protest. These are everyday people, and I suspect there will be kids.\n\nThe issue is quite simple. Rightly or wrongly - these rights exist.  The only way to take them away is to amend the Constitution. It cannot be a duty of citizens to constantly re-litigate rights they already have. Winks and end runs around the Constitution simply aren't allowed - so Virginia IS breaking the law here. Attempting to use the raw naked force of the state to take rights away.\n\nThe Constitution is our fundamental agreement. Eliminate that - and literally anything goes. Outsiders really have no grasp of how the Bill of Rights has always exerted control over us. Our last civil war was fought simply over the inconsistencies between that document and slavery's reality. Likely 90% of the population didn't give a damn about slaves....but the mental gymnastics required to justify those practices just became too onerous.\n\nCitizens DID give a damn about our own lies. Became weary of lying. Ultimately, our lies were purged by force. No one had any idea the purge would prove so costly. In today's equivalence, 6.2 million people were killed. WW2 was far less expensive.\n\nI don't expect violence at this protest. DO expect many future Wacos if Virginia State police attempt to seize guns from homes. Violence will flare very rapidly should that happen. There was already an incident 2months ago in NY state. Our luck will not last. There is real danger if they attempt to collect those guns. Believe three gunowners have already been killed in such raids......",
				"added": 1579394267
			},
			{
				"comment_id": 46,
				"body": "Very cringeworthy how many really believed that the Patriot Act would only be applied to bad guys. Not a peep from the public.....\n\nWe cannot rely on the founders to bail us out of everything. This was our own \"damn fool test\" - and we failed it.",
				"added": 1579476139
			},
			{
				"comment_id": 49,
				"body": "> [aspidochelone](#comment_324_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Discipline and morale are things that hold on a society-wide basis.  If people believe that the cops are going to do the right thing, the protesters are going to do the right thing, the city/state/federal government is going to do the right thing, then it is easier for them to remain disciplined and do the right thing themselves.  But when they think the  government is conniving to put them in jail, the protesters are going to pull out the guns they've owned for twenty years and suddenly start shooting people, the cops are going to lie and set people up and collaborate with Nazis etc., then all the various players will be more willing to consider any such thing. [...]\n\nI'm not certain that marches have the impact claimed. Letters, phone calls, and visits to state legislatures have more impact.\n\nRemember this a while back when some state legislators were working through some liberalization bills, but the purists appeared in droves. As I told my own representative, \"gun owners need to be more careful about frightening momma and less caught up in zealotries du jour\". Those who have never been around guns often fear them. Something to be recognized, not validated by frightening behavior. If those fears are ever overcome (such as those antigun church goers in Texas)....positions will moderate. \n\nNothing changes minds like quick action to save someone's kid.\n\nThat's what's needed here. Stepping back from the brink of threatening to invade homes to collect \"bad\" guns. Other concerns can be addressed if reason prevails.",
				"added": 1579486533
			}
		],
		"1579475766_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 47,
				"body": "> [realiodine](#comment_42_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): This article isn't on the ZeroNet mirror of this zite :/ kinda hampers my enjoyment. [...]\n\nSo let perfection be the enemy of the good?\n\nI'd wager that all of us are still learning here. And we'll get better over time.\n\nThis is the guy who helped many of us increase our tracker count. Some might consider that helpful.",
				"added": 1579485746
			}
		],
		"1579399038_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 48,
				"body": "> [atomiserxenolith](#comment_141_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): There should be no gun control by the State.\n\nI agree. But those of us who feel that way should acknowledge there are costs for this freedom - and should be willing to look opponents in the eye , own those costs...and claim those costs are worth it.",
				"added": 1579485950
			},
			{
				"comment_id": 63,
				"body": "> [quantumkitty](#comment_473_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Well, the copy cat effect is real and the science is there to back it up.Â People go on school shootings to become famous before they die, usually as a result of an inferiority complex. If you deprive school shooters of their fame, then the job becomes less glamorous.Â The more you share mass-shooter related content, the more you increase the chances of mass shootings happening. What you think about freedom of speech is irrelevant to the science.\n\nExactly and well phrased. Though it's ludicrous to lock people up for sharing videos.....\n\nMakes you long for a terminal cancer patient who accepts \"forbidden videos\" - then takes out the judge convicting him for sharing. \"Trade THIS video bitch\".\n\nNone of this would preclude a television station owner from refusing to air material. Not participating.",
				"added": 1579717652
			},
			{
				"comment_id": 72,
				"body": "> [atomiserxenolith](#comment_144_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): What costs are you referring to?\n\nFools who fail to secure their weapons from children. Hotheads with easy weapon access....list goes on and on.\n\nSecond amendment is still worth it.",
				"added": 1580014458
			},
			{
				"comment_id": 73,
				"body": "> [aspidochelone](#comment_335_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): So no, FUCK the numbers, I say stop trying to remote control people, not by just laws against crime but by physical and bureaucratic obstacles based on predicting their potential behavior.\n\nAgreed",
				"added": 1580014559
			}
		],
		"1579676977_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 51,
				"body": "> [rannulfr](#comment_7_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): TOR is US gov funded.\n\nNever let perfect be the enemy of good. There are endless discussions out there regarding the reliability of Tor. In the end, you either believe it's a honeypot - or you don't.\n\nI worry more about their Poindexters not being up to government Poindexters. It's a very uneven match. And it's clear that government's who DO throw a lot of resources into malicious relays CAN generate mischief and some de anonymization.\n\nBest way to counter that. Build a relay. Take a stand. Fight. There really is no room for spectators.....",
				"added": 1579711867
			}
		],
		"1579707290_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 52,
				"body": "I just want search engines to tell me it exists and where to find it. Not rank it.\n\nSadly, we've re-learned that no one can be trusted to be a truly fair broker. So it's time to retrieve such power or make having it irrelevant. \n\nGoogle in particular should be fired.",
				"added": 1579712152
			}
		],
		"1579685974_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 53,
				"body": "China is an embarrassment. She held such promise. 1.4 billion irreverent Chinese poking holes in stupidity.\n\nAt least for now - gone. Censored.\n\nA truly honest China, with native Chinese irreverence  would be an unstoppable force. It would change things for the better worldwide.\n\nSee many western countries as just tired. Not retaining enough fight in them to hold on to their freedoms. Likely a cycle...but it still disappoints. \n\nOceania in particular is baffling. Left alone, all by themselves...they resurrected the Soviet Union. \n\nDon't understand these mass shooters of little people, when there are so many politicians and evil partisans available to terrorize. WTF is wrong with these characters? With so many people worth eliminating - they pick a mosque?\n\nWhy not pick judges who imprison people for passing around videos. Is there anything more evil than censors?",
				"added": 1579712868
			}
		],
		"1579685919_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 54,
				"body": "> [blczero](#comment_1_14Fo49dHCwvfHdxrdBvEC42EZhPvsZYRkv): The US & UK should try harder to help out HK\n\nIt's really hard not to fall into evil when you \"help out\" other countries. Really not our fight. And the UK has baggage in China.\n\nHate to say it, but what Hong Kong needs are martyrs. Would not take many to stop the police excesses. All you need are protesters with bombs attached to a dead man's switch. Once some police were killed - they would get \"religion\" on civility. There would be a standoff, and more reasonable parties would prevail. \n\nNothing changes until people die. And nothing takes the place of violence. But protesters should NEVER be seen on the attack - only the final desperate act of resistance. And protesters with bloodlust should be dealt with severely by the mob - not the police. Only takes one asshole to destroy your message.\n\nMake no mistake, if the CCP resorts to Ghengis Khan rules - all HK'ers will die. That's the way the ancients took care of disturbances....So all depends on the CCP. Would they really be willing to kill their own citizens on this scale?\n\nConfess I don't know.",
				"added": 1579713648
			},
			{
				"comment_id": 55,
				"body": "> [draugrdeathlord](#comment_493_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): fucken hell, when will other countries step in and help these people\n\nNot buying this. If Chinese came in to \"help us\" sort out our conflicts - I'd favor killing and eating them. Like any alien invader.\n\nOnly Chinese brinkmanship with their own government can save China. And that must be ENTIRELY home grown.",
				"added": 1579713857
			}
		],
		"1579602906_1JH7GXsReuXYWoJKuREooRvjbWP15sMN2N": [
			{
				"comment_id": 56,
				"body": "> [aspidochelone](#comment_331_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Smart product = Dumb \"owner\". [...]\n\nI think it's unreasonable to expect appliance owners to be able to decipher every trick and trap manufacturers build into these devices. There needs to be a simple rule: \"A single on/off button must be provided which positively isolates appliances from the internet.\" And if your appliance leaks, or we catch you cheating - your company's CEO gets extended prison time and your company is liquidated with all proceeds becoming public property. ie The death penalty.\n\n\"No prisoners\" would work here.",
				"added": 1579714892
			}
		],
		"1579598887_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 57,
				"body": "I'm furious over what has been done to him. And Assange is probably not a likeable person.",
				"added": 1579714998
			},
			{
				"comment_id": 74,
				"body": "He'll be a hero in some movie someday, but right now he has powerful enemies and little capacity to fight them.\n\nShame on the cowardly Australian government for not coming to his aid.\n\nThe Brits don't shame. They are hopelessly lost.",
				"added": 1580015109
			}
		],
		"1579592713_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": [
			{
				"comment_id": 58,
				"body": "> [draugrdeathlord](#comment_492_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Except when you have a Properly setup VPN ðŸ˜‚ with open port so U seed and help keep the system alive. [...]\n\nMeh. Understand your reasons for saying this. But Tor is also a discipline. It takes into account uncertainty and allows people to plan for uncertainty.\n\nThere's really no telling who the censors will go after next. Tor makes it less likely they'll have any say.",
				"added": 1579715233
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 59,
				"body": "Was once a hard core funder of Hollywood. While we still do that to a very limited degree, I go out of my way to hurt them.\n\nThe studios are too big, the personnel too militant, and the movies are too repetitive and uninspiring. \n\nHollywood as we now  know it should just die.\n\nThere is so much rich material (writing) out there - and Hollywood serves us gruel?\n\n\nBTW, Hollywood celebrities. Not a day passes when I don't consider seeding your mansions with genetically engineered termites. Learn to STFU.",
				"added": 1579716021
			}
		],
		"1579512965_1JH7GXsReuXYWoJKuREooRvjbWP15sMN2N": [
			{
				"comment_id": 60,
				"body": "How about making free internet access a rite of passage for young adulthood? Just shield the kids completely until they reach puberty or thereabouts?\n\nIt's not like you'd be depriving them of \"the truth\"...just allowing them some time to grow.\n\nDid you know that silicon valley billionaires send their own kids to schools WITHOUT computers. Not even calculators are allowed. Fact. Maybe they know something here?\n\n\nTeenagers would pickup the internet quickly by osmosis. There is no need for these bullshit computer classes they offer in schools. Those are just a way for underperforming teachers to collect a paycheck.\n\nAnd no one should ever give schools budgets for computer hardware. They'll piss that money off every time. It's hard for any school to find competent people for this. Almost better to let the kids help make any hardware decisions - perhaps guided by some free thinking adults. Imagine the kids putting all school users on Raspberry Pi's ? That would be funny......",
				"added": 1579716566
			}
		],
		"1579428954_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 61,
				"body": "Something like 1.6 million top Chinese Communist officials have purchased \"dual citizenship\" (dog doodoo) from Canada or the United States?\n\nWhy are we allowing traitors to their own country to do this? And why haven't the Chinese people hanged these officials?\n\nNo country should allow dual citizenship - EVER. If it's a kid - they must choose at age 21.",
				"added": 1579717022
			}
		],
		"1579430150_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 62,
				"body": "Every country needs a Bill of Rights. Because rights are always inconvenient to the ruling class.",
				"added": 1579717242
			}
		],
		"1579312378_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 64,
				"body": "Everyone always expects sinister conspiracies (shaking head) .....\n\nHow about a fed employee who is like the proverbial Maytag repairman (never busy) dreaming up such stuff just to keep their job? I'm reminded of that famous line from the original Ghostbusters: \"I've been in the private sector, they expect results.\".  These federal employees would flounder, many would perish, if they had real jobs. Ditto our military.\n\nMany people we have working for us don't actually do anything. How long can this continue?\n\nEver wonder what mothers of FBI people say within quiet moments? Moms always know.",
				"added": 1579718118
			}
		],
		"1579733691_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 65,
				"body": "> [nekololi](#comment_429_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): im certain i came to these networks seeking refuge from the moonbats and the wingnuts. instead of escaping from them, i just found different kinds of moonbats and wingnuts that were slightly less appalling to associate with. [...]\n\nRemember that now ancient Apple commercial? Much of that artsy stuff...but boy did they nail it concerning conformity.\n\nIs that a place you really wish to live in? If so, you should really move into an HOA. It suits you.",
				"added": 1579735085
			},
			{
				"comment_id": 66,
				"body": "> [bigbadbob](#comment_912_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): WTF is a moonbat? lol\n\nReddit has a sub \"Dank memes\" and only half of anything posted there makes the cut, because Reddit mods are pussies and will never push the envelope. \n\nSome of that stuff is very original. Makes me wonder what that bunch would come up with for \"moonbat\" and his earlier post. Know I'd be laughin' for an hour - but this guy would probably retreat to his shrink :)",
				"added": 1579747626
			}
		],
		"1579728135_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 67,
				"body": "Good luck with addiction (if that's what it is). You probably should locate the major research hospitals/universities and ask them to make a local recommendation.\n\nEverything seems still in the snake oil stage (witness the poor success rate)...but some progress is still being made. You might be one of the lucky ones.\n\nRehab is expensive and mostly fails. Luck is more effective. But you won't know if you're lucky until you ask.",
				"added": 1579748373
			}
		],
		"1579726611_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 68,
				"body": "I'm sick of this suing for hurt fweelings. Both of these women should be removed from politics and their names never spoken again.\n\n:)",
				"added": 1579748454
			}
		],
		"1579524634_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 69,
				"body": "This is the game. Peabrain legislators assail your rights and then count on you to wimp out before challenging them.\n\nEveryone is into \"easy\" today - but it's a duty to challenge such laws. Then hopefully using the controversy to go back and ruin these legislators lives for life.\n\nThe Bill of Rights is worded very simply. I presume it was done that way for a reason. Likely to deter mealy mouth legal bandits and their priesthood?\n\nIn any case, ya gotta fight.",
				"added": 1579748881
			}
		],
		"1579442143_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 70,
				"body": "(shaking head) Fartsmacking again.",
				"added": 1579749271
			}
		],
		"1579762565_17U5GzDuhL9qeWAyDZLNB1tguX8xX1hXUe": [
			{
				"comment_id": 71,
				"body": "Optical rectitus.....When you get so angry - you sink into your own asshole and see the world through tunnel vision. Seems to be a peculiar affliction of modern civilization where you no longer worry about your next meal or who/what is trying to kill you. If you are just trying to stay alive (most animal life) - such considerations would never occur to you.\n\nWhat you need is a fight to the death. If you survive, you will never again question such things or worry about elites you could easily kill.\n\nYou expected to get out of life alive?  :)",
				"added": 1579803402
			}
		],
		"1579890249_16cUVejYswnQhxY6LRP6ftoC9WezKzpKbe": [
			{
				"comment_id": 75,
				"body": "\"Homosexuality is explicitly linked to pedophilia\"   Why even take the chance? Who wrote the \"rule\" that such risks must be taken? Where does all this indignation come from? It's baffling.",
				"added": 1580015531
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 76,
				"body": "At this point, it appears China is making \"heroic\" efforts to contain this. Doubt any Western country could perform any better.\n\nUnfortunately, we have underinvested in countermeasures for plagues worldwide, and probably lack the ability to quickly develop vaccines. So there will be unnecessary deaths.\n\nWe should have learned from the worldwide Flu epidemic of 1917 - but we didn't. If you wish to terrorize yourself - go to youtube. look it up. Amazing how little of this material ever made it to schools considering the death toll?",
				"added": 1580015807
			}
		],
		"1580070228_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 77,
				"body": "I'd wager the only effective counter at present is frequent hand washing, masks to avoid aerosols, avoidance of touching your face or eyes with hands, and avoidance of crowds when possible.\n\nIt's a shame we don't have a quicker vaccine production response.",
				"added": 1580088413
			}
		]
	},
	"comment_vote": {
		"398_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"397_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"399_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"152_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"36_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"390_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"68_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"69_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1
	}
}