{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1582169978,
			"title": "Anyone else watching Mike Bloomborg getting gang raped tonight?",
			"body": "He's getting assfucked by the whole stage.",
			"added": 1582169977
		},
		{
			"topic_id": 1587305852,
			"title": "What's wrong with socialism?",
			"body": "Seriously, What is actually wrong with socialism?\ninb4 Muh BILLIONS AND BILLIONS; Everyone knows that bullshit propaganda literally established be Nazis in WW2",
			"added": 1587305850
		}
	],
	"topic_vote": {
		"1582169978_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1584935552_1LyiVyfhYN2tEhwMJRCcxEFyBekXbqcMk7": 1,
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1584797417_16yxmFzgPzF4SGiAQi9qY3ev6aSQzv3tb": 1,
		"1585337817_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": 1,
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": 1
	},
	"next_comment_id": 41,
	"comment": {
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 1,
				"body": "Yes. Who would possibly want freedom for themselves and everybody else? You know what sounds great? Being dominated and controlled by a small group of retards for half of your waking existence.",
				"added": 1581594351
			},
			{
				"comment_id": 2,
				"body": "> [chernobyl](#comment_6_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE): suprnova: What a cocksucker.  [...]\n\nMUH JEWS",
				"added": 1581594369
			},
			{
				"comment_id": 6,
				"body": "I want communism",
				"added": 1582240792
			}
		],
		"1582104346_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 3,
				"body": "There's a zeronet movie? LOL",
				"added": 1582150421
			}
		],
		"1582169978_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 4,
				"body": "> [sfs9](#comment_41_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): Is there any particular reason, why any sane person would like to rape anybody, specially an old man?\n\nBecause he's porky, duh",
				"added": 1582202479
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 5,
				"body": "Ok grandpa",
				"added": 1582202525
			},
			{
				"comment_id": 7,
				"body": "God, is there anyone who uses this place who isn't a total fucking retard?",
				"added": 1583758804
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_1864_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Ahem. Me and my friends.\n\nI'll believe it when I see it.",
				"added": 1583759537
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_1865_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): See what?\n\nWhen I see you not being a retard.",
				"added": 1583760023
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1866_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Are you just here to start fights? I'm not gonna fall for the h8 b8, m8.\n\nLmfao, I am deff here to troll stupid poltards, yes.",
				"added": 1583765065
			}
		],
		"1584744394_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 11,
				"body": "The issue is that the way the economy functions in America is totaly at odds with something like covid-19.\nAnother issue is that the USD is basically the life tree of the global economy.",
				"added": 1585021381
			}
		],
		"1584256859_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 12,
				"body": "Why is Zeronet filled to the brim with brain dead boomers?",
				"added": 1585061020
			},
			{
				"comment_id": 13,
				"body": "> [bigbadbob](#comment_1049_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Perhaps you prefer reddit?\n\nNo I prefer not to be surrounded by idiots.",
				"added": 1585096752
			},
			{
				"comment_id": 14,
				"body": "> [bigbadbob](#comment_1051_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Is everyone a boomer or idiot to you?  What's your \"type\"? Who would you ideally want to hang out with?  Does that \"type\" you seek even exist?\n\nThe type of person I want to see is some one who doesn't call covid-19 a hoax. Also, there's an alarming rate of young people dying from it too.",
				"added": 1585099377
			}
		],
		"1585257650_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 15,
				"body": "Lol, what are they gonna do to me if I coof on everyone?",
				"added": 1585278907
			},
			{
				"comment_id": 16,
				"body": "> [bigbadbob](#comment_1055_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Not like (((they))) would let a good crisis go to waste.\n\nMuh jooos",
				"added": 1585280932
			}
		],
		"1585314197_13EafRdDw5sZF42dTn68uDdcssTWKbdauJ": [
			{
				"comment_id": 17,
				"body": "Lol, some of these bitches can't go 5 seconds with out some simps fawning over them.\nFucking kek.",
				"added": 1585336997
			},
			{
				"comment_id": 18,
				"body": "> [reichardnixon](#comment_92_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): Porn is propaganda to keep you distracted and demoralize you. Porn is poison to the nuclear family. This is all part of the agenda. Free porn right now is literally the same thing the Jews did when they invaded Palestine and flooded all of their TV stations with porn. Google it.\n\nNo one gives a shit about your gay nuclear family. We're gonna have public orgies where we are going.",
				"added": 1585337027
			}
		],
		"1585337817_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 19,
				"body": "I'm an alien.",
				"added": 1585341851
			}
		],
		"1585212415_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 20,
				"body": "Nigga, just get off the internet, LOL",
				"added": 1585366370
			}
		],
		"1585414548_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 21,
				"body": "> [moor](#comment_407_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): as an user noted in the comments: [...]\n\nDamn dude, being a retard must be difficult.",
				"added": 1585418281
			}
		],
		"1585426688_1EqH77TNk9ifhhW5MiKPn8P6fbnAF4A916": [
			{
				"comment_id": 22,
				"body": "Lmao, damn that's sad, man. Do you guys have extra arms over there?",
				"added": 1585445580
			}
		],
		"1585499838_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 23,
				"body": "Welp, time to move to Israel.",
				"added": 1585500328
			},
			{
				"comment_id": 24,
				"body": "Really though, do you have the source of this article? This is very interesting, wow.",
				"added": 1585500415
			},
			{
				"comment_id": 25,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_93_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): You serious? [...]\n\nNah, bro, this is all just a joke. hahahaha :^)",
				"added": 1585501646
			}
		],
		"1585616438_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 26,
				"body": "It's to bad this is a right wing pod cast. I need my daily injection of communist propaganda.",
				"added": 1585667236
			}
		],
		"1585836202_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 27,
				"body": "Everyones death toll is going to be higher than reported because none of these nations have an interest in looking like the absolute retards that they actually are to the general populations at large",
				"added": 1585839133
			}
		],
		"1585882218_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 28,
				"body": "I used to believe in conspiracies.\nThen I became a man and picked up Das Kapital.",
				"added": 1585923671
			},
			{
				"comment_id": 29,
				"body": "Conspiracy theories serve no other purpose than to distract the population from the real issues of global capitalism.\nThey are just another method the ruling class implores in their arsenal of psychological warfare against the working class.",
				"added": 1586204813
			}
		],
		"1586348383_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 30,
				"body": ">Not posting invidios insted of youtube.",
				"added": 1586461976
			}
		],
		"1586981807_145UdHkipHkyVRvbjGSB8CLGt9JwzVTsgg": [
			{
				"comment_id": 31,
				"body": "I'm doing ok. Ready to get the fuck out of this god damn house that's for sure.",
				"added": 1586992391
			}
		],
		"1587114042_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 32,
				"body": "I don't understand why you guys hate socialism so much, lol.",
				"added": 1587305368
			}
		],
		"1587305852_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 33,
				"body": "> [ranshit](#comment_136_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): While I would support a socialist economy, one just doesn't seem possible due to human laziness to ensure the success of socialism or it fails due to the greed of humanity in that some group will attempt to funnel resources solely to themselves. (which will deprive resources away from the socialist community). So while socialism may work in theory, we as a species aren't mature enough for such economic concepts. [...]\n\nI actually don't, totally, disagree with that sentiment. Though, I disagree as to the causes of it. I think that the reason socialistic economic systems fail with in the framework of a global capitalist hegemony is because they falter under pressure exerted on them by the influences of capital itself. Not because of some \"human nature\" People have been programed to behave the way they do.",
				"added": 1587319155
			},
			{
				"comment_id": 34,
				"body": "> [styromaniac](#comment_2060_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Democratic socialism seems fine. I'm with Bernie's ideals. I don't confuse it with communism.\n\nI think communism is really the onyl logical conclusion where the human species survives at this point.",
				"added": 1587319205
			},
			{
				"comment_id": 35,
				"body": "> [aassddff](#comment_97_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Don't feel like writing much about it right now, but assuming you mean Marxism variants the main thing is Materialism.Same issue I have with Italian Fascism focus on the state or National Socialism's obsession for races.Materialistic ideals always converge to degeneration and spiritual disorder.Just see how people in China seem to be all traumatized. See shit happening, but feel powerless to do anything. Makes sense, years ago they were being encouraged by the government to physically fight against their own family and burn down the temples they used to go to.All of the inherent failures in Marxist-variant systems are consequences of the spiritual, ethical and moral degeneracy it causes.\n\nWhat is \"spiritual disorder\" There is *only* the material world, lad. China is not the only socialistic model than can or should be persuide. The issue with china and other more authoritarian variants of socialism is the fact that they lack any real democracy. By \"Real\" democracy I mean a democracy run directly by the people both economically and politically.",
				"added": 1587347232
			}
		],
		"1592264885_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": [
			{
				"comment_id": 36,
				"body": "The changes will never come, precisely because peaceful protests do nothing. You must work from outside the system in order to achieve any meaningful change. Our political system in America does not care about the will of the masses and never has. It was not constructed to act that way. The American political system is designed to facilitate and maintain the existence of property and plutocratic domination. The only thing that can help us at this point is a full blown revolution against the American government.",
				"added": 1592280362
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 37,
				"body": "> [edgelordofdecent](#comment_566_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It is pretty much slab city you could say but with blm protesters instead of hippies. It is also governed by a sound cloud rapper.\n\nfake news. Raz is not the leader of the commune. There are no leaders.",
				"added": 1592280417
			},
			{
				"comment_id": 38,
				"body": "> [bigbadbob](#comment_1089_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Working for themselves would be better... But what are they doing?   I saw a picture of a garden.  It didn't look all that good.  Would hope they would at least have \"some\" skills to justify their declaration of sovereignty. I have no idea what is going on over there.  The only info I have access to MSM propaganda.  Maybe the can't afford police anymore or are too cheap,  or maybe it's just election year.   Glad I don't live there.  But here is far from perfect too.\n\nLol, Gardens don't just spring up over night. I mean, I am not saying it's perfect it's deff got some problems but we've not seen something like this in America for at least 60 years.",
				"added": 1592286376
			},
			{
				"comment_id": 39,
				"body": "> [schiz0@kxoid.bit](#comment_22_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): Another warning that BLM as a movement has no leadership. Anyone who claims to be a leader should immediately be suspect. [...]\n\nyeah, blm \"leadership\" is literally a bunch of feds.",
				"added": 1592338544
			},
			{
				"comment_id": 40,
				"body": "> [edgelordofdecent](#comment_567_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Explain that to them when they are trying to grow food with their shit after a few days. It takes 1-2 years before you can use human shit to grow food. They should at least get an emergency supply set up until they have a reliable way of growing food or create a trade network. [...]\n\nThe fuck? Why do you think they have to use shit? lmfao. Where did that come from?",
				"added": 1592338580
			}
		]
	},
	"comment_vote": {
		"1865_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"23_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1
	}
}