{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test",
				"added": 1565452150
			},
			{
				"comment_id": 2,
				"body": "Does this work?",
				"added": 1606428057
			},
			{
				"comment_id": 3,
				"body": "> [test3456](#comment_2_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): HI yes is see your message could take a second and test my site? [...]\n\nYour site doesn't load. It says \"No peers found\". You need to seed your site longer for this to have a chance to work.",
				"added": 1606504251
			},
			{
				"comment_id": 4,
				"body": "> [test3456](#comment_4_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): if my port is closed, (I cant open it). would that prevent people from downloading my site? [...]\n\nYes and Yes. Personally, for me Zeronet won't work at all if I don't use Tor. It is advised to use Tor by default anyways.",
				"added": 1606506764
			},
			{
				"comment_id": 5,
				"body": "> [test3456](#comment_3_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): i have been up all day.... any thoughts on what to check?\n\nWhatever you changed, your site seems to work now...",
				"added": 1606506992
			},
			{
				"comment_id": 6,
				"body": "> [test3456](#comment_5_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): I have switched over to Tor, Could you test the Site again?\n\nIt says.\n> Thanks to everyone that helped to Test this site!!!!!.\nIt seems to work now.",
				"added": 1606507228
			},
			{
				"comment_id": 8,
				"body": "> [test3456](#comment_6_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): Also to note since i have switched to Tor, I have noticed peers on the other site i activated have increased to a couple hundred now.  [...]\n\nI have zeromail but no zerosite yet.",
				"added": 1606509354
			}
		],
		"1606040168_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 7,
				"body": "I have Zeronet running on a headless Raspberry Pi. I can use it from every device that has a browser as long as I am in my home network.\nFor access outside your home network you could consider using a Tor service just like I do for ssh access. But I normally don't need Zeronet outside of my home network.",
				"added": 1606507700
			},
			{
				"comment_id": 10,
				"body": "> [test3456](#comment_10_1JuH625YcbVeN6ve7xDXVUkVcoRHgYU8rh): Interesting never thought, making my PI available over TOR hidden service, cause then i could access it from anywhere as long as i can connect to Tor.... [...]\n\nIt is really simple. Just google it. First search result worked ok for me:\nhttps://www.techrepublic.com/article/how-to-run-an-ssh-connection-through-tor/",
				"added": 1606578087
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 9,
				"body": "If you are non-European or Jewish you should strongly consider pulling through with that suicide.",
				"added": 1606521480
			},
			{
				"comment_id": 11,
				"body": "> [diurpagissa](#comment_14_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK): Well, partially agreed!I am living in an already messed country, where the occupier decides who and what salary could have!I am living in a country where soros and the rest of shit brought us misery and no hope!I am living in a country where spineless people are in huge numbers right now and those with bones are eliminated one by one by the regime!Change place at my age is out of the question.Future gives nobody any hope!When future sucks humans are killing themselves, no matter what the expectations from occupiers are!But not all, first will go those well educated, capable of analyzing the shit they are in!When situation will worsen the uneducated will follow!So, cliches like change what's bothering you are not applicable at all....Some places are just like prisons, but those guys commenting to go out are just talking empty words, and nothing else! [...]\n\nIn real life there are only the laws of physics. Might is right. ",
				"added": 1606592746
			},
			{
				"comment_id": 14,
				"body": "> [rolouzis](#comment_11_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2): Right. So 'm right! Expect suicide rates to go higher then! Soon...\n\nNo. If you want more power over your life the first thing you have to do is to get strong. Freedom through strength.",
				"added": 1606651233
			}
		],
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 12,
				"body": "Advertising is a flawed business model and has no chance to exist in a fully free society.",
				"added": 1606601763
			}
		],
		"1605258725_1EQvG7tmmrK7rvVPaXm9zFeHckdhPEXvWR": [
			{
				"comment_id": 13,
				"body": "> [sudoroot64](#comment_15_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG): But what happens when you turn your computer off. I think he is trying to create a server that runs 24/7 irregardless of the status of his main machine. I would use at least a Raspberry Pi 3 A+ though.\n\nIndeed Raspberry Pi zero won't cut it performance wise. I replaced my Raspi 2 with the Pi 3 to make it work.",
				"added": 1606647176
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 15,
				"body": "I2P/onion can technically be censored if the hosts are captured.\nZeronet is 100% uncensurable for every content that is even only moderately popular.",
				"added": 1607030024
			}
		]
	},
	"comment_vote": {
		"21_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS": 1,
		"204_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1
	}
}