{
	"title": "Sigma Fund X",
	"description": "from 1 mllion to 10 millions",
	"links": "- [Starnet](http://127.0.0.1:43110/1Fc6zxe5FSJkUFsH2qmJ2eZcFwCa3Yr7yD)",
	"next_post_id": 42,
	"demo": false,
	"modified": 1469362200,
	"post": [
		{
			"post_id": 41,
			"title": "New blog post",
			"date_published": 1469362200.781,
			"body": "Blog post body"
		},
		{
			"post_id": 40,
			"title": "上海电力底价 - 7",
			"date_published": 1469347195.349,
			"body": "Blog post body"
		},
		{
			"post_id": 39,
			"title": "\n\n　　上海电力股份有限公司实施2015年度分红派息方案为:每股派发现金红利0.25元(\n含税).股权登记日:2016年7月28日除息日:2016年7月29日现金红利发放日:2016年7月\n29日仅供参考,请查阅当日公告全文.\n",
			"date_published": 1469342053.863,
			"body": "应该考虑浙能电力，华电国际。"
		},
		{
			"post_id": 38,
			"title": "同济科技",
			"date_published": 1469283012.166,
			"body": "- stable divident\n- stable trading range\n- buy below 8.50"
		},
		{
			"post_id": 37,
			"title": "皖新传媒",
			"date_published": 1469282125.485,
			"body": "- ok divident\n- stable trading range"
		},
		{
			"post_id": 36,
			"title": "万向钱潮",
			"date_published": 1469281396.529,
			"body": "- ok divident\n- stable trading range\n- buy at 15.25"
		},
		{
			"post_id": 35,
			"title": "王府井",
			"date_published": 1469281012.635,
			"body": "- good divident\n- stable trading range\n- by definition it is stable, can not grow too much, so its price is stable;\n- it is well konwn, staying power is strong\n- buy below 15 yuan"
		},
		{
			"post_id": 34,
			"title": "仙ju制药",
			"date_published": 1469279775.091,
			"body": "- good trading range in a stable range \n- divdent normal\n- buy bellow 11 yuan"
		},
		{
			"post_id": 33,
			"title": "新希望",
			"date_published": 1469279325.239,
			"body": "- high divident\n\n8yuan buy"
		},
		{
			"post_id": 32,
			"title": "阳光照明",
			"date_published": 1469276248.388,
			"body": "- divident ok\n- good trading pattern"
		},
		{
			"post_id": 31,
			"title": "亿晶光电",
			"date_published": 1469196061.775,
			"body": "- divident ok and increasing\n- hot concept"
		},
		{
			"post_id": 30,
			"title": "庄股 --- 大冷股份",
			"date_published": 1469195743.974,
			"body": "- 8 块钱考虑买"
		},
		{
			"post_id": 29,
			"title": "庄股研究 --- 特发信息",
			"date_published": 1469187756.577,
			"body": "- 股性好\n- 风险高 --- 所有庄股都是高风险\n- 散户就是小三，随时可能被抛弃\n- 分红极低，这是庄股特征之一；因为股价虚高，但是被人为控制出模样；\n- 只有在高位，才能控制模样；这如同东西漂在空气中，更容易被控制；\n- 目前股价均线24；但是实际价值5元；因此股价5倍于实际价值；\n\n从股票历史可以看出庄家的策略：\n\n- 买筹码\n- 因此拉出高位\n- 反复高抛低吸"
		},
		{
			"post_id": 28,
			"title": "东方电缆",
			"date_published": 1469113574.964,
			"body": "Blog post body"
		},
		{
			"post_id": 27,
			"title": "国电电力",
			"date_published": 1468852263.769,
			"body": "要点一：所属板块　CDM项目 HS300_ 电力行业 沪股通 辽宁板块 融资融券 上证180_ 上证50_ 证金持股 \n\n要点二：经营范围　经依法登记,公司经营范围是：电力、热力生产、销售;煤炭产品经营;电网经营;新能源项目、高新技术、环保产业的开发与应用;信息咨询;电力技术开发咨询、技术服务写字楼及场地出租(以下限分支机构)发、输、变电设备检修、维护;通讯业务;水处理及销售。 \n\n要点三：主营业务-电力业务　公司是控股股东中国国电旗下的全国性上市发电公司,是中国国电在A股资本市场的直接融资窗口和实施整体改制的平台。截至目前,公司拥有直属及控股企业63家,参股企业21家,筹建处6家。公司资产结构优良,所属企业分布东北、华北、华东、华南、西南、西北等25个省、市、自治区。近年来,公司始终坚持科学发展,突出质量效益,做强做优主业,推动转型升级,公司电源结构和布局得到持续优化。 \n\n要点四：行业背景-电力行业　根据中电联发布的《2016年度全国电力供需形势分析预测报告》,2016年宏观经济增速总体将呈现稳中缓降态势,总体判断用电需求仍较低迷,在考虑常年气温水平的情况下,预计2016年全社会用电量同比增长1%-2%。分产业看,预计第一产业用电在常温气候条件下维持2015年中低速增长水平,第二产业用电量降幅将比2015年收窄,第三产业用电继续保持较快增长,预计用电量增速与2015年总体持平。城乡居民生活用电平稳增长,预计增速与2015年总体持平。 \n\n要点五：核心竞争力-资源获取和可持续发展能力　近年来,公司大力发展清洁可再生能源,火电机组在公司电源结构中虽然仍占主导,但占比逐年下降,截止2015年底火电机组比例为67.4%。清洁可再生能源的大力发展符合国家产业政策,有利于公司的长期稳定发展。面对国家风电发展的形势变化,公司不断调整发展策略,风电发展重心由 “三北”陆上风电逐步转向北部风电基地、中东南部山地风场、海上风电协调发展。技术优势方面：近年来,公司火电机组平均单机容量不断提高。 \n\n要点六：核心竞争力-人力资源保障能力　随着公司不断优化配备基层单位领导班子,强化后备干部和青年英才的选拔,全面加强中层干部管理,大力实施“人才强企”工程和职业经理人培训、建设职业发展通道等一系列措施,公司目前拥有一批适应市场形势、懂管理、能打硬仗的干部队伍,拥有一支符合发展要求,懂技术、甘于奉献的员工队伍,能够为公司持续发展提供坚实的人力资源保障。随着公司三项制度改革的不断推进,公司的管控能力将逐渐增强,管理效率将逐渐提高,动力活力将逐渐释放,市场竞争优势将逐渐凸显。 \n\n要点七：核心竞争力-成本管控保障能力　成本管控持续优化,管理水平不断提升。公司在系统内全面开展 “双提升”工作,深入推进成本费用对标管理,现已覆盖火电、水电、新能源、煤炭、前期、基建、综合等7个业务板块,形成了一套体系健全、指标合理、行之有效的成本费用对标管理制度。并通过对成本费用指标的进一步细化,落实各级管理责任、强化企业竞争意识,同时将对标管理结合绩效考核,有效提高了基层单位的工作积极性,实现了成本费用的全级次、全方位、全流程、系统化管理,有效提高了公司成本控制能力。 \n\n要点八：拟自筹12亿收购脱硫设施资产　 2016年2月公司公告,公司所属八家火电企业,拟自筹资金收购龙源环保的脱硫设施资产,转让价格是以资产评估值为基础加上相应增值税,总计12.8亿元。公司所属企业于2016年2月5日与龙源环保签署《资产转让协议》。过去12个月内公司所属企业向龙源环保出售资产,金额为2.98亿元。交易标的为龙源环保七家分公司相关脱硫设施资产,交易类别为购买资产。上述资产收购后,有利于公司按照“两个标准化”的管理要求,调整相关企业脱硫设备管理模式,实施统一安全生产管理标准,优化管理结构,确保达标排放。经协商设立3年过渡期,期内,相关企业委托龙源环保对脱硫设备进行运行维护,并签订过渡期运行维护合同。 \n\n要点九：资产注入预期　　公司接到控股股东中国国电《关于解决与国电电力同业竞争问题有关事项的函》，中国国电确定将公司作为中国国电火电及水电业务整合平台，中国国电力争用5年左右时间，通过资产购并，重组等方式，将中国国电发电业务资产注入国电电力。大股东国电集团是电力体制改革后国务院批准成立的五大全国性发电集团之一。 \n\n要点十：进入煤化工，精细化工和太阳能新材料领域　　09年2月公司完成出资12.66亿元持有英力特集团增资后51%股权。英力特集团主要产业及发展方向为电力，煤炭开发和具有上下游一体化优势氯碱化工，煤化工和新材料等。英力特集团为上市公司英力特第一大股东，持股3012万股，比例为21.91%。2010年12月15日中证报披露，总投资高达600亿元的国电英力特宁东煤基多联产化学工业园，是国电电力转型发展的又一着力点。宁东工业园自2009年6月25日启动以来，前期各项工作进展顺利。一期第一批的主要项目已于今年全面开工，积家井煤矿项目计划明年开工，2012年上半年同步投产。英力特的宁东煤基多联产化学工业园全部建成达产后，预计将年新增销售收入400亿元，创造利润70亿元。 \n\n要点十一：34.7亿收购股东发电资产　　2013年10月，公司拟自筹资金收购控股股东中国国电集团公司持有的国电安徽电力有限公司100％的股权，收购价格约为34.7亿元。资料显示，截至2013年9月末，安徽公司总资产约117.2亿元，净资产约18.9亿元；今年前9个月实现净利润约4.33亿元。此次交易的评估增值率为94.85%。 \n\n要点十二：新能源题材　　公司出资6232万元(占33%)组建赤峰新胜风力发电公司，风电项目动态总投资为7.89亿元，投资4.67亿元建设总规模300MW的辽宁兴城风电项目，在河南濮阳等地建设3至4座秸秆电厂，总容量约10万千瓦。公司已投资9604万元在辽宁锦州凌海南小柳风电场项目。2010年上半年开工风电项目容量90万千瓦，山西右玉高家堡等7个共计35万千瓦风电项目已获核准，海上风电开发全面启动。宁夏平罗，中卫，甘肃金塔共计3万千瓦光伏发电项目核准并开工。该公司2010年实现净利润5781万元。 \n\n要点十三：股权投资　截止2015年12月31日,公司投资国电南瑞(600406)2567万元,持有2.01%股权,投资远光软件(002063)800万元,持有6.30%股权,投资国电科环(01296)23.716亿元,持有39.19%股权。投资国电财务有限公司8.716亿元,占24.94%,投资大同证券公司67万元,占0.67%,投资长安保险经纪有限公司200万元,占0.87%。 \n"
		},
		{
			"post_id": 26,
			"title": "中粮屯河",
			"date_published": 1468585880.435,
			"body": "乱七八糟一堆东西"
		},
		{
			"post_id": 25,
			"title": "点火只为国家队出货 为什么近期老停牌中小板股票，在赶资金往大盘股进去",
			"date_published": 1468585835.318,
			"body": "Blog post body"
		},
		{
			"post_id": 24,
			"title": "中粮",
			"date_published": 1468585380.52,
			"body": "中粮旗下拥有九家上市公司，其中包括中国食品（00506.HK）、中粮控股（00606.HK）、蒙牛乳业（02319.HK）、中粮包装（00906.HK）、大悦城地产（00207.HK）五家香港上市公司，以及中粮屯河(行情12.15 +1.08%,买入)、酒鬼酒(行情23.69 -0.42%,买入)、中粮地产(行情10.15 +2.01%,买入)和中粮生化(行情11.94 +3.29%,买入)四家内地公司。"
		},
		{
			"post_id": 23,
			"title": "资产证券化率（意思是公司缺钱，需要创新方法圈钱），关注文山电力(行情10.30 -0.68%,买入)、佳电股份(行情9.69 -2.91%,买入)、东方电气(行情10.23 +0.69%,买入)等",
			"date_published": 1468584416.98,
			"body": "东方电气公告确认孙公司已连续八年亏损，资不抵债。 \n\n　　针对“公司旗下一风机企业资金链断裂，欠逾两百家供应商货款”的报道，东方电气(600875)昨日午间发布澄清公告，确认了孙公司已连续八年亏损，目前处于资不抵债状态。\n\n　　公告称，经公司认真核查，报道所指企业东方电气新能源设备(杭州)有限公司(下称“杭州新能源”)系东方电气集团东方电机有限公司投资设立的全资子公司，为东方电气的三级子公司。\n\n　　公告称，东方电气2015年度实现销售收入360.18亿元，实现利润总额5.33亿元，其中，杭州新能源实现销售收入2.46亿元，实现利润为亏损2.66亿元。\n\n　　东方电气方面表示，由于杭州新能源面临经营困难，截至2015年底已连续八年出现亏损，目前已处于资不抵债状态。对于其债权债务，东方电机责成杭州新能源正积极与相关各方沟通协商，并将按照相关政策妥善处理。\n\n　　事实上，不仅孙公司经营业绩差，东方电气近几年净利也急剧下降，今年还可能面临亏损的局面。资料显示，东方电气2014年实现净利润12.78亿元，同比下降45.59%，2015年净利继续下滑65.65%至4.39亿元。\n\n　　东方电气在2015年年报中发布了今年的利润风险提示：由于产品价格持续下滑，费用增加等原因，2016年仍将面临利润下降，甚至可能出现亏损。今年一季度，东方电气仅实现439.48万元，同比大幅下滑了95.9%。\n\n　　中金公司研报分析称，东方电气火力发电设备业务预计2016年改善幅度有限，主要是由于低价订单仍将于2016年执行。此外，由于电力需求疲软及短期内针对煤电厂的缓建停建政策，预计煤电装机增加短期将放缓，影响东方电气的火电设备业务的收入和利润水平。\n\n　　兴业证券也预测东方电气2016年营收平稳，净利润受减值拨备等因素预期亏损，考虑到当前发电设备行业尤其是传统火电设备订单执行存在不确定因素，建议投资者继续跟踪公司订单执行和新增订单变化情况。\n\n　　虽然基本面有诸多负面因素，但东方电气近两日股价却依然坚挺，周一上涨2.04%，周二上涨2.3%。市场人士分析认为，这很可能与近日大盘走势向好有关，行情好时，一些利空会被资金忽略，但业绩这块一直是该公司的一大硬伤，投资者还是应注意其中的风险。\n"
		},
		{
			"post_id": 22,
			"title": "2016年07月13日个股融资融券交易明细交易日期：",
			"date_published": 1468510128.638,
			"body": "http://stock.jrj.com.cn/rzrq/rzrqjymx.shtml?sort=BUY_VALUE"
		},
		{
			"post_id": 21,
			"title": "7月14日两市机构大单抛盘40股",
			"date_published": 1468509394.596,
			"body": "Blog post body"
		},
		{
			"post_id": 20,
			"title": "由于其高污染性，国家对新增产能的投放要求非常严格",
			"date_published": 1468509167.348,
			"body": "Blog post body"
		},
		{
			"post_id": 19,
			"title": "梅花生物",
			"date_published": 1468509031,
			"body": "梅花生物(行情6.95 +1.16%,买入):氨基酸业务受益养殖后周期 提价推动下带来高业绩弹性\n\n　　类别：公司研究 机构：国海证券股份有限公司 研究员：余春生 日期：2016-07-14\n\n　　苏氨酸业务扩产，增量推动下带来业绩增长L-苏氨酸是一种必需的氨基酸，主要用于医药、化学试剂、食品强化剂、饲料添加剂等方面，特别是饲料添加剂方面的用量增长快速。2013年中国地区苏氨酸产量达到27.60万吨，同比增长55.93%，成为全球最大的苏氨酸生产地区，其中梅花生物产能位居全球第一。根据公司年报显示，2015年公司拥有苏氨酸产能15万吨，当年生产苏氨酸15.28万吨，处于满负荷运转状态。2015年销售苏氨酸16.8万吨，同比增长22.21%，高于当年产能水平，可以看出公司产能束缚十分严重。2016年Q1，公司子公司通辽梅花科技有限公司8万吨苏氨酸项目实施完成，公司苏氨酸的生产实力有望大幅提升，有望为公司业绩增长带来新的贡献。\n\n　　氨基酸受益养殖后周期，提价推动下带来高业绩弹性公司赖氨酸和苏氨酸产品主要用于饲料行业。一方面，2016年猪价同比大幅上涨，而生猪存栏数只有小幅提升。短期内供需矛盾仍然存在，我们预计2016年猪价有望维持高位震荡，养殖户的养殖积极性有望提高，从而带动作为饲料蛋白的氨基酸的市场需求；另一方面，豆粕、鱼粉等替代品价格上涨也有望带来氨基酸用量增加。随着蛋白资源的日益紧张，价格上涨趋势不可避免。截至2016年7月11日，我国豆粕现货价为3420.61元/吨，同比上涨18.58%，较去年年底上涨30.03%。受需求增长刺激，目前我国赖氨酸和苏氨酸价格都有所上涨，公司业绩弹性有望增大。\n\n　　味精行业集中度提高，价格有望稳步提升2002年以来我国味精行业在市场竞争、行业政策等因素影响下已先后经历了多次行业整合。目前市场前三家企业市场占有率高达90%以上。而且由于其高污染性，国家对新增产能的投放要求非常严格，龙头企业凭借原料成本优势和规模经济优势拥有较强定价权，未来有望共同推动味精价格上涨，公司盈利能力可持续增强。\n\n　　盈利预测和投资评级:维持公司“买入”评级2015年，由于赖氨酸、呈味核苷酸二钠、黄原胶等氨基酸产品市场竞争加剧，导致产品价格下降，公司归母净利润同比减少14.95%，低于我们前期预测。2016年，随着养殖业复苏以及替代品价格上涨，氨基酸价格有望回升；同时公司苏氨酸新增产能有望对业绩增长新添动力；味精价格如果提升，公司味精业务盈利能力也有望大幅增强。基于上述分析，我们预测2016/17/18年EPS分别为0.29/0.39/0.51元，对应2016/17/18年PE分别为23.51/17.68/13.52倍，盈利预测调低是因为公司2015年业绩低于前期预测，但鉴于我们看好公司未来业绩增长趋势，同时公司目前估值偏低，维持公司“买入”评级。\n\n　　风险提示:味精和氨基酸行业整合未达预期，味精和氨基酸行业整合未达预期。\n"
		},
		{
			"post_id": 18,
			"title": "儿童用药",
			"date_published": 1468499762.242,
			"body": "儿童用药市场需求与供给的极度不匹配。2015年我国儿童人口数量约为2.5亿人，占总人口比重接近18%。二胎政策全面放开后，有助于出生人口保持平稳或略有回升，儿童人口数量整体保持稳定。然而，在我国6000多家制药企业，专业化儿童药生产企业仅30多家；药品批文18万条中专用于儿童的药品批文仅3100条左右；医院常用制剂品种约3500种，儿童专用品种约60种，比例仅占1.7%。我国2014年儿童用药市场规模约为1200亿元，其中近一半是成人药品减半使用。而对标美国来看，儿童人均用药相差十倍。儿童用药需求与供给短缺的矛盾在加剧。\n\n济川药业 27.54 -1.08%    \n　　解决儿童用药供给短缺，政策需先行。儿童群体具有特殊性，研发过程难度大，生产成本高。参考美国儿童药政策的演变，一方面加强监管，另一方则是给予儿童药研发、专利期和专卖权等极大的政策支持，推动儿童药行业的发展。我国从2014后出台的一系列政策的质量和可操作性强，对儿童药优先审评审批、招标直接挂网，儿童药行业有望迎来春天。\n\n　　儿童疾病以常见病为主，因此儿童药绝大多数为常见药，主要包括抗感染类、呼吸系统类和消化系统类，2015年增速保持10%以上。外资企业在国内儿童药市场占据较大市场份额；国内企业中，部分中成药独家品种显示出较强的品牌优势，化药企业可聚焦更适宜儿童的剂型和规格开发，替代外资产品的市场。 建议关注济川药业(600566,股吧)、长春高新(000661,股吧)、亚宝药业(600351,股吧)、山大华特(000915,股吧)。\n"
		},
		{
			"post_id": 17,
			"title": "科大讯飞（002230）",
			"date_published": 1468499241.153,
			"body": "一、公司简介\n\n科大讯飞（002230），全称科大讯飞股份有限公司（以下简称公司），公司成立于1999年，于2008年上市，是最早从事语音技术研究的公司，目前为中国最大的语音识别技术提供商。公司主营业务：语音支撑软件、行业应用产品/系统、信息工程和运维服务。\n\n二、公司股权稳定性\n\n截至2015年9月30日，公司前十大股东累计持股比例为34.72%，除去中国移动持有的13.94%股权、汇金持有的1.37%股权，其他大部分为公司实际控制人刘庆峰的一致行动人，持股比例约为20%。从股权集中度来看，公司股权较为分散，但短期举牌难度很高，遭遇野蛮人的概率不大（当然，很多人认为公司的价格很贵，也不愿意花钱来举牌）。\n\n公司实际控制人情况（从度娘摘取）。刘庆峰，男，1973年2月出生，今年43岁。中国科学技术大学本科，后来拿下了硕士和博士学位（学位取得是间断的）。从公开资料来看，刘庆峰还算年轻，科班出身，从创立公司到现在，一直在做一件事，就是语音，专注性极强。\n\n总体看，公司股权集中度较高，实际控制人话语权强，其个人对公司的影响很大。\n\n三、         公司业务分析\n\n先看下公司2014年度的产品收入分类饼状图：\n\n从上图可以看出，目前为公司营收贡献最大的3类产品为教育应用产品、信息工程于运维服务及语音支撑软件，占比超过70%。下面简单的介绍下公司的这些产品。\n\n教育应用产品，目前主要分为语音评测和语音教学两类，主要下游客户为教育机构，这类产品可以辅助教育机构进行语言类学科的教学和测验。这块业务毛利率在45%左右，未来市场前景广阔。\n\n信息工程与运维服务，这是公司最传统的赚钱业务，地域集中在安徽地区，毛利率约20%，是公司早期的现金流来源，这类业务未来一段时间内还会存在，但比重整体趋势还会不断下降。\n\n语音支撑软件，主要为以语音核心技术授权使用的形式提供给各行业开发商，为开发商在其系统和产品中集成语音技术提供支撑。这部分业务是公司毛利率最高的，约90%，但增速十分有限。这种嵌入式的语音软件，主要面向各类电子产品类终端，如手机、导航、学习机、电子词典、玩具、智能手表等。我属于纯外行，所以并不清楚这种授权类技术收入的市场空间有多少，但这个技术是讯飞的核心，公司的数据采集源泉也大多来自这里。\n\n电信语音增值产品，主要为移动通信商提供智能语音服务解决方案。这块业务毛利率超过85%，增速也较快，在2015年业务收入占比已超过语音支撑软件收入，在利润贡献方面已跃居前两位。这块业务的高速增长，也源于中国移动的战略入股。\n\nIFLYTEK--C3，声纹识别，或叫语音安全，属于私密业务，合作对象主要为政府、公安等部门，毛利率超过85%，业务增速很快，这部分业务可归类为军工，未来有较好的前景。\n\n整体看，公司的业务特点是以语音技术为基础，主要应用于教育、军工及民用领域，这3个方向都有很好的前景。\n\n四、         竞争对手\n\n国内主要为以百度为首的BAT互联网巨头，这些互联网巨头最大的优势就是钱多、人才多，尤其是百度，在开始研发智能语音技术后，对讯飞压力还是很大的。讯飞这几年研发占营业收入的比率一直接近30%，但和百度的投入相比，依然有差距。\n\n国外的主要对手以Nuance、谷歌、微软等公司为主。Nuance和讯飞类似，都是以语音作为公司发展的核心，谷歌和微软类似于BAT，属于互联网巨头公司。\n\n尽管讯飞具有先发优势，可这种优势并不是牢不可破。讯飞作为安徽省目前最牛的科技类公司，一定会不断的得到扶持，但相比这些，不断进化的思维是更重要的因素。\n\n五、财报分析\n\n无论公司的技术多牛，最终还是要回到地面来理性的看看下面的财务数据。\n\n1）：即期资产负债表\n\n截至2015年9月底，公司总资产79.12亿元，其中流动资产47.92亿元，非流动资产31.20亿元；负债和所有者权益方面，公司负债15.93亿元，所有者权益63.19亿元。简单来看，公司似乎资产不轻，负债率低。\n\n先看看流动资产都有哪些。\n\n除了货币资金和应收账款，其他的流动资产我们基本可以无视了，单纯的货币+应收，就已经占到了流动资产85%以上的比例。\n\n公司的货币资金在2015年出现大幅增加，主要源于第三季度非公开发行股票，预计到2016年的年中，这个数字会下降50%以上。\n\n关于应收账款，也出现了较大幅度的上升，公司方面解释的原因是因为主营业务收入的不断增长导致的。关于应收账款的增加，确实需要结合营业收入的变动幅度来看，这方面会在之后进行分析。\n\n其他科目金额较小，但其他流动资产较年初有较大增加，为公司购买理财产品所致。\n\n关于公司的流动资产，由于公司发行股票募集了新的资金，所以看起来现金比较充裕，但应收账款的持续增加对公司的资金周转确实带来了一定压力。不能认为讯飞的产品毛利率高，就认为讯飞不存在资金压力，公司2014年研发费5个多亿，销售和管理费用约7个来亿，这些都是实打实流出去的钱，不断增加的应收账款，会拖慢公司的发展，也说明公司对下游客户的掌控力没有毛利率看起来那么美。\n\n接下来看看公司的非流动资产。\n\n在看讯飞的报表之前，我觉得公司流动资产比率怎么也会超过80%吧，结果实际的情况还是和想象差别蛮大。下面我们来看看，为什么讯飞的资产这么“重”。\n\n公司固定资产和在建工程的占比达到31.30%，其中房屋建筑物达到一半以上，其次是专用设备、办公设备及运输设备，以上四项，基本构成了这部分资产的90%以上。\n\n无形资产占非流动资产的20.43%，达到6.37亿元。其中，占大头的是软件，占比超过无形资产的50%，这也是提的最多的资本化资产；其次就是土地和安徽工程大学机电学院校名等综合性无形资产（不知道是什么鬼，应该是2012年度归进来的）。被诟病最多的资产就是软件这块了，公司无形资产在2012年9月底的时候还是1.30亿元，那时候土地是大头资产，但过了3年，变成了6.37亿元，软件资产已成为这部分资产的大头。会计政策的激进或保守，是由公司决定的，做的激进，公司的利润表会好看些；做的保守，那短期利润表就会比较难看。其实这对公司未来5年或10年的长期发展，不会构成重大影响，即便是被资本化的费用，未来还是照样要摊销掉的。\n\n商誉，大头是公司在收购启明和瑞元信的时候发生的，这部分不做分析了，了解就好。\n\n可供出售金融资产和长期股权投资，前者是公司持有的一些合伙人的创投和基金，后者主要是公司持有的非控制类型的子公司股权。\n\n关于其他非流动资产，为公司提供的委托贷款，年化利率9%，期限2年，不必深究，要么就是公司的关系户，要么就是迫于政策压力之类。\n\n最后说说开发支出，这部分占比6.41%，简单来说，就是还没有转化为“软件资产”的资产，如果把这部分资产和无形资产进行合并，那么这类资产的非流动资产占比将达到27%左右，比例还是很高的。\n\n公司的非流动资产构成甚至比流动资产还要复杂，但进行归类后觉得也没那么麻烦了，主要就是股权投资、固定+在建、无形+开发+商誉、委托贷款。\n\n下面谈谈公司的负债。公司的资产质量一般，好在负债并不多。截至2015年9月底，公司负债总额15.93亿元，其中流动负债13.58亿元，非流动负债2.35亿元。构成公司负债的主要部分为应付账款、短期借款及预收款。从目前的资产状况来说，公司没有任何偿债压力，也就是说，未来公司有通过银行借款或公开发债等手段调整财务杠杆的弹性。\n\n总体看公司的资产，我们可以基本回答一开始的问题。\n\n1公司属于重资产类公司吗？ 如果以固定资产作为判断公司资产轻重的准则的话，公司属于轻资产公司；如果剔除资本化的资产及和主营业务不相关的资产（委托贷款），公司勉强算做轻资产公司。\n\n2公司未来资产的变动趋势？ 公司刚发行股票募集了资金，这些钱会用到新的项目投放上，所以未来货币资金会减少，在建工程和固定资产会增加；公司会发生新的收购，所以货币资金会减少，商誉等非流动资产会增加；公司还将继续把研发费用资本化，这将使无形资产进一步上升。短期看来，公司的资产会继续变重；但长期看来，随着公司盈利能力的增加，以及固定资产和无形资产的折旧或摊销，正常的情况下，长期趋势是公司流动资产比重会不断提升。\n\n3公司未来负债端的变动？2008年以后，公司的资产负债率就很少超过25%，但这个情况可能会在未来发生改变。2016年AAA级的债，票面利率约在3%上下，预计科大讯飞的主体评级在AA到AA+之间，融资成本也是非常低。公司应收账款每年都在增加，研发费每年也在增加，而且未来也很难有下降的趋势，为了应对其他强力竞争对手的狙击，公司必须不断的加大投入才能在这场智能语音卡位战中坚持到最后。如果今年讯飞发了5-10个亿的公开债券，也不用感到意外。作为投资者来说，在低市场利率的环境下，借钱似乎要比发行股票来的实惠。\n\n2）：公司盈利趋势分析\n\n这些年公司经历了高速发展，我们来看看过去5年公司的成长历程。本来应该只看营业收入和营业利润（由于公司营业外收入较多，所以用营业利润作为分析指标）趋势和增速的，但因为公司的应收账款增加较多，只好放到这里一起分析了。\n\n如上图所示，其实图表所表达的内容已经比较清楚了。公司过去几年无论是营业收入、营业利润还是应收账款，都在飞跑。公司目前依然把研发放在第一位，所以我们可以先不看公司的利润，但我们需要知道的是，如果把公司过去3年资本化的研发部分费用化，公司过去3年可能将是亏损的。无论是出于什么原因的资本化，我们要知道的是，公司目前还在烧钱的阶段。公司的应收账款增速，在过去4年中一直超过公司的营业收入增速，这确实是不小的隐患。截至2015年9月底，公司应收账款16.16亿元，是公司2014年营业利润的5.61倍。当然，欠讯飞钱的客户，大多信用良好，比如政府相关部门、垄断的移动通信商、教育机构等，但营收增速低于应收账款增速，绝对不是好事儿。\n\n3）：现金流分析\n\n其实看完资产负债表和利润状况后，我们应该基本猜到公司的现金流会如何了，单靠公司的经营现金流，是无法覆盖公司投入的，下面把图发出来：\n\n2010-2011年的时候，公司的经营现金流基本还够用，但到了2012年，公司不得不通过增发股票、银行借款这类方式来维持公司不断的投入。之前有对讯飞了解较多的朋友说，讯飞目前投入的还不够多，还要继续投钱搞研发，搞市场，我相信等他看完这个图表后，应该知道公司目前的砸钱速度已经很快了，按照这个趋势，2016年的投资活动流出会超过15亿元。\n\n六、估值\n\n这是一家还在不断发展的公司。如果要问5年后，科大讯飞会发展成什么样，会在智能产业链中的什么位置，我觉得很多人包括我，都答不上来。公司过去5年的营业收入复合增速为42.04%，这个趋势还在继续，哪年会停下来，我不知道。我们先忘掉公司的利润情况，目前公司在行业的卡位是更重要的事情，把精力点放在公司的技术优势、行业布局以及营业收入上面是目前的重点。如果公司在2014年之后的6年，营业收入复合增速还将保持在30%以上，那么到2020年，公司的营业收入将达到85亿元。（比安徽政府在2017年要求的100亿低了老多，但保守一些还是好的）但公司目前市值已经超过300亿，怎么看，都觉得不好下手。\n\n看完公司历史估值，可能我们多少就懂点了，讯飞一直就没便宜过啊！\n\n先说市盈率，公司过去5年，几乎就没有低于50倍的时候，根据公司披露的净利润范围区间，目前市盈率在58-88倍的范围内，区个中间数，大概就是70倍左右；再看市净率，公司过去5年，最低的时候约为4倍，目前约为5.51倍。从公司目前的股价来看，距离历史的底部估值区间还有超过20%的下跌幅度。在公司基本面没有发生重点变化的情况下，21元会是公司的估值底部上限，15元左右是公司的估值底部下限。\n"
		},
		{
			"post_id": 16,
			"title": "血液制品股——上海莱士",
			"date_published": 1468497719.613,
			"body": "从7月份开始，这家上市公司大股东增持金额竟高达38亿之多，创6月份A股大跌以来之最。这家上市公司便是有名的血液制品股——上海莱士\n\n先上公告，让大家感受一下大股东的霸气。\n\n\n实际控制人科瑞天诚及一致行动人科瑞集团和实际控制人黄凯控制的全资子公司这半年来合计增持38亿。其中通过二级市场直接增持7亿，剩下的31亿都是通过定向资管计划增持的。\n\n要知道，在A股大股东增持金额大于1亿元的案例已属罕见。6个月内增持40个亿发生的概率只比在地球上见到外星人低一点点。要知道上海莱士今年前三季度加总净利润只有11.7亿。其六个月累计的增持金额比前三季度加总净利润的3倍还多，大股东真可谓下了血本。\n\n于是，股价在大股东的一番狂轰滥炸下硬生生的走成了这个样子。下图为从2015年1月5日至今的前复权K线图。\n\n查看更多精彩图片\n\n什么股灾1.0,2.0,3.0全都不是事儿。而且股价在2015年11月24那天还创了新高！！\n面对这样的走势，只想说一句：完美！\n\n不难发现，较其他A股上市公司，上海莱仕可算是妥妥的人生赢家。如此平稳的股价走势都是大股东真金白银换回来的，也算为投资者交了一份满意的答卷。但是，这件事情反过来想，却不禁让人疑问。就算是6月份的股灾以来，上海莱士的PE也始终维持在60以上，在如此高估值的情况下大笔增持自家股票本就是一件不符合逻辑的事情。那么，在股价跌幅甚小的情况下，维持大股东增持的动力又是什么呢?在查询了上海莱士最近的公告后，答案浮出水面，就是文章开头骑行客提到的股权质押。\n\n\n公告显示：\n截止到2016年1月11日，大股东科瑞天诚累计质押股份占其所持有股份的51.5%。大股东莱士中国累计质押股份占其所持有股份的72.7%。二者合计累计质押股份占公司总股本的39%。\n \n其合计质押市值为413亿，按照50%的质押率进行计算，上海莱士大股东累计借款达200亿左右。回顾一下上海莱仕这家公司的历史，不难发现，股权质押一直是大股东筹措资金的重要手段，从2008年公司于深交所上市开始，大股东（科瑞天诚）质押股份的数量始终维持在其持股总数的50%以上。把手中的股票全部质押出去筹借资金也是常有的事。因此，对于这样一家上市公司，维持股价的稳定性就显得至关重要。因为，股价下跌不但意味着相同股数所能筹措到的资金将大大减少。同时，质押股票被平仓的风险也随之提高。\n\n\n所以大股东的买买买，也实属不得已而为之，毕竟38亿比之于200亿只算一个小数目而已。\n\n\n从2015年7月15日至今，上海莱仕无论从股权质押笔数，还是质押金额都荣登A股榜首。\n\n\n那么现在问题来了，上海莱仕为何频繁的质押其借款？其筹借的大笔资金的用处为何？为公司补充流动资金？还是别有他用？\n\n秉着八卦进行到底的精神，骑行客大胆猜测，小心求证。这个故事还是要从这家公司大股东的背景。上海莱仕成立于1988年，由“莱仕系”的创始人黄凯执掌的美国莱仕与上海市血液中心血制品输血器材经营公司合资成立。2007年改制后，科瑞天诚和莱仕中国分别持股50%，成为大股东。一年后，该公司于深交所上市。\n时至今日，科瑞天诚和莱仕中国仍然为上海莱仕的大股东，二者分别持股32.08%和30.42%。科瑞天诚是科瑞集团旗下子公司，后者为国内知名的投资公司，实际控制人为郑越文（见下图）。\n\n上面这位仁兄不仅长得一表人才，资本运作更是玩的风生水起。科瑞集团自成立以来，其投资标的中共诞生过6家上市公司，在A股上市的有两家，上海莱仕便是其中之一，另外一家为$平高电气(SH600312)。平高电气自2001年2月16日上市开始，科瑞集团便是仅次于平高集团的第二大股东，持股23.56%。2007年科瑞集团退出平高电气，精准的躲过了2008年熊市。此时股价较公司发行价（前复权）已经翻了近3倍了。再算上IPO时的股票溢价，科瑞集团可谓功成身退。\n\n\n上海莱仕亦如此。从2007年科瑞集团进驻上海莱仕，直至将其运作上市开始，时至今日，上海莱仕的股价已经翻了近20倍。在这里不得不佩服郑老板精准的眼光，实为价值投资PE的典范。科瑞集团投资领域主要集中于金融业，地产业，制造业和矿产业，无一例外有着投资大，投资周期长，“缺钱”的共性。因此，这也就不难解释，科瑞天诚的质押上海莱仕的股票筹集的资金到底流向了哪里？\n"
		},
		{
			"post_id": 15,
			"title": "大盘、龙头、资金、题材的共振。",
			"date_published": 1468133822.175,
			"body": "Blog post body"
		},
		{
			"post_id": 14,
			"title": "那些让你眼前一亮的题材，才是你需要关注的。",
			"date_published": 1468133743.628,
			"body": "Blog post body"
		},
		{
			"post_id": 13,
			"title": "要买就买龙头，把龙头作为交易标的，你会发现即使板块其它个股全都熄火了，龙头依然可以震荡一下，让你有机会出局！",
			"date_published": 1468133704.87,
			"body": "每天的各板块龙头和市场总龙头，你需要都去看"
		},
		{
			"post_id": 12,
			"title": "如果不把大盘作为交易系统的一部分，最后胜率绝不会高；大盘是核心。",
			"date_published": 1468133577.623,
			"body": "绝顶高手们一致把大盘看到如此重要的位置让我感到震惊！"
		},
		{
			"post_id": 11,
			"title": "对于亏损，一定要严格执行纪律，要尽快做出抉择。而盈利的时候，要让市场来决定能飘多远",
			"date_published": 1468133268.15,
			"body": "选择止损的前提。"
		},
		{
			"post_id": 10,
			"title": "a case investor's recommendations 典型的追涨杀跌",
			"date_published": 1468133032.394,
			"body": "做股票的正确理念：\n　　1.把自己买入股票的成本当成操作的依据的人，是没有入门的\n　　2.你买入股票时候，要研究企业的基本面和发展前景，成长性，这个是选股的理由，但是不作为操作依据\n　　3.你操作的唯一依据，一定是技术面和资金流向，每次进场前，都要设定好关键的技术位置，那个位置突破加仓，那个位置跌破就止损\n　　4.热点板块出现，一定要跟，要追随\n　　5.热点板块里面，一定要做龙头股票，不要担心涨的太多\n　　6.那个是龙头，怎么判断，很简单，这个热点开始启动，第一支涨停的，就是龙头\n　　7.做股票，要敢于判断出热点题材行情，大胆追随，那么怎么判断一个热点题材的行情呢？三大原则：大事件，大题材，大资金\n　　8.很多人都是亏损厌恶者，所以大多数人会对套住的股票死扛，而对有盈利的股票，都急于抛出\n\n　　我的观点是，对于亏损，一定要严格执行纪律，要尽快做出抉择。而盈利的时候，要让市场来决定能飘多远\n　　9.量能出现异常，一定要警惕，只往往预示着出现变盘的可能，但是要耐心观察\n\n　　这才是真正的正确的思维，换句话说，就是两个字\n　　追随\n\n　　“追随”这两个字，要想明白了，都受益匪浅"
		},
		{
			"post_id": 9,
			"title": "投资非主营业务",
			"date_published": 1468132789.854,
			"body": "投资非主营业务\n　　投资非主营业务（比如参股，并购等方式）无非俩个诉求：第一，靠概念炒股价圈钱，这几年来上市公司相继热衷于投资过手游行业，传媒行业，互联网金融行业。都是什么热投什么，就是想把自己和最热门的投资概念扯上关系，这和娱乐圈七八线小明星抱大腕大腿搏出位是一个思路；第二，自己的主营业务增长放缓或者前景变差，需要布局其他领域"
		},
		{
			"post_id": 8,
			"title": "股东结构",
			"date_published": 1468132726.367,
			"body": "股东结构\n　　必须有靠谱的单一大股东，我国企业擅长股东内斗，俩个大股东要还能专心经营绝对是楷模级别的。虽然单一股东很多时候意味着独断专行和家族企业，但是你还能分析，还能判断，俩个股东分析就很难了。"
		},
		{
			"post_id": 7,
			"title": "行业壁垒",
			"date_published": 1468132488.9,
			"body": "行业壁垒\n　　毛利率是可以一定程度反映行业壁垒的，50%以上剩下的不是软件互联网，就是医药。"
		},
		{
			"post_id": 6,
			"title": "主营业务占比",
			"date_published": 1468132434.297,
			"body": "主营业务占比\n　　这个不用多说，不务正业的公司绝对不碰，越高越好，100%最好；"
		},
		{
			"post_id": 5,
			"title": "股本",
			"date_published": 1468131684.36,
			"body": "股本\n　　这是放之世界皆准的标准，股本越小，扩张动力越大，潜力也越大，中国股民更是格外热衷于炒小盘股。总的来说，总股本不超过10个亿，越小越好"
		},
		{
			"post_id": 4,
			"title": "毛利率",
			"date_published": 1468131639.612,
			"body": "毛利率\n　　我不喜欢低毛利率的公司，传统制造业和零售业里很多企业做的很好，比如卖电器的，比如造汽车的，都有好公司，但是毛利率不足20%，这就说明规模是这类企业成长的重要决定因素。当他们的规模到一定程度，成长速度的下降几乎是必然的。我一般只看毛利率30-40%以上的"
		},
		{
			"post_id": 3,
			"title": "mission ",
			"date_published": 1468118340.563,
			"body": "- 如何抓大牛股\n- grow from 1 million to 10 millions\n"
		},
		{
			"post_id": 2,
			"title": "New blog post",
			"date_published": 1468118322.557,
			"body": "Blog post body"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your blog has been successfully created!"
		}
	]
}