{
	"title": "redstoneb's blog",
	"description": "The musings of a young man.",
	"links": "[GitHub](https://github.com/siraben)",
	"next_post_id": 3,
	"demo": false,
	"modified": 1548950000,
	"post": [
		{
			"post_id": 2,
			"title": "I'm Back!",
			"date_published": 1548949749.067,
			"body": "Life happened, and I completely forgot about ZeroNet for most of 2018, then I rediscovered my users.json file and voilà, everything was waiting for me again! ZeroNet is more important than ever in 2019, and to play my part at least I'll be making content free, whether that be movies or music, or books and more."
		},
		{
			"post_id": 1,
			"title": "ZeroNet is the future.",
			"date_published": 1495213200,
			"body": "The internet is dying. We are living in a online world increasingly governed by a handful of companies and ISPs, and you don't need to look beyond the current net neutrality debate to understand why this is a concern. While we fight to keep our internet access free, there are people in other countries without access to the world's information, because of censorship, bandwidth limitations (China has ~50 KB/s connections to overseas data centers), or just because it's too hard.\n\nThe client-server model is old and forgettable; once the server goes down, the site doesn't exist anymore. The server is an easy target for censorship or attack.\n\nZeroNet is the first of its kind, I applaud _nofish_ for having created a system with security in mind, and in which we are free to publish anything and interact with an expanding community. Zeromail is an example of this, you can send messages to anyone and the only people that can see it is you and the recipient, even as it propagates through the network as an encrypted file. Completely public and yet private. Every file in a website is verified and you download parts of the website from people around you, not from a single data center.\n\nThanks to this ease of use, people use ZeroNet all over the world, and in the future, one can easily imagine the people living in remote places, whether it be on an island, on barren ice sheets, or deep in the jungle, having equal and unfiltered access to the internet.\n\nThere is so much potential in ZeroNet, we are just at the beginning. Virtually anything that you can do on the clearnet can be done within ZeroNet itself, chat sites, forums, blogs, file sharing, video/audio streaming. One day, ZeroNet will be the _de facto_ standard for networking"
		}
	]
}