{
	"next_comment_id": 23,
	"user_name": "klu9@zeroid.bit",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1553382105": 1553460251,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554127981": 1554129740,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554486478": 1554573399,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554462966": 1554573430,
		"1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1554527852": 1554573873,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554654785": 1554655851,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554743798": 1554743789,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555408969": 1555435840,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555514682": 1555515023,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555781429": 1555784854,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555858716": 1555862424,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1557324747": 1557338432,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1558288253": 1558361962,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1558286498": 1558361970,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1558693210": 1558709177,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1560181341": 1560187528,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1560504881": 1560532823,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561154953": 1561160494,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561115870": 1561161308,
		"1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1561508877": 1561560519,
		"1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8_1561814850": 1561817690,
		"1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8_1561767551": 1561817774,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1562533304": 1562592162
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "+ They work now :)\n+ But now each language appears in the list twice (jp, en, ru, jp, en, ru)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1552444972",
			"date_added": 1552494229
		},
		{
			"comment_id": 2,
			"body": "I switched hubs a couple of months ago.\nAlmost as soon as I got onto ZeroNet, but before I understood anything about hubs, federation, space limits etc, I joined ZeroMe, and somehow ended up on \"torrents hub\" with a 100KB space limit. So after just 5 weeks on ZeroMe I was getting \"include too large\" errors without understanding what they meant  or why.\n\nI feel it should not be possible for someone to join ZeroMe without them at least being shown a page of brief explanation (about hubs, space etc) and being offered a list of hubs to choose from (with details like space limit etc). \"Prevention is better than cure.\"\n\n> you don't see that you are still following on their page (though subscription per se seems to work fine)\nSorry, I don't understand.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554834411
		},
		{
			"comment_id": 3,
			"body": "@caryoscelus: Thanks for the explanation. \nDamn, I used ZeroMe Unfuck to change hubs and it reported I was fully transitioned to KaffieHub and off torrents hub.\n\n@Krixano: \"people tend to stay with the \"official\" zites more for some reason.\" Network effect: there just aren't enough people on ZeroNet to support multiple social sites.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554837332
		},
		{
			"comment_id": 4,
			"body": "@Krixano: \"*Examples: ZeroExchange, ZeroMedium, KxoVid, 0Play Game Center, Kiwipedia, ZPlace*\" The utility of many of these zites is still based on having a critical mass of users, in turn attracting more users.\n.\nE.g. The other day I needed some info/help and I looked again at ZeroExchange (actually I've still got the tab open). And the zite had about 5 posts over a year. With the most \"recent\" being 4 months old. \n.\n(Also I clicked on the \"About\" page and it literally was just a page with a big  \"About Page!\" written on it :) )\n.\nSo I asked on ZeroTalk, where I felt more confident I would get a response. I don't really know if ZeroExchange is better, per se, than ZeroTalk. But I do know ZT has much more activity from many more users. So I posted there because people post there. I.e. network effect.\n.\nKiwipedia has additional issues: it was only on my 4th or 5th visit (I only returned because it kept nagging me for space) that I finally found  that there's any actual content on it. I literally clicked every single damned link on the home page until I finally found something (buried two/three levels down under a small link called \"Hub list\"). They've made a few small changes to the home page since then, but there are so many basic usability flaws with Kiwipedia I find it useless.\n.\nAnd even if the design & usability issues were fixed, it would still, like Wikipedia, rely on a critical mass of contributors, providing, editing and updating content.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554844519
		},
		{
			"comment_id": 5,
			"body": "@Krixano: re Kiwipedia: what's your method for finding information on Kiwipedia?\n.\nAt the moment, this is how it happens when I try it.\n1. Open Kiwipedia.\n2. Click on \"Hub List\".\n3. Click on \"en\".\n4. Click on \"List of English Wikipedia Pages\".\n5. Wait until I remember that does nothing.\n6. Click on \"Article Index\".\n7. Wait. The page looks blank but will eventually show something.\n8. Press CTRL+F and search. (Obviously this will only search article titles, not content). Go through results until finding the right one (if present).\n9. If no result (likely), go to Wikipedia and repeat the process with fewer steps (i.e. use Wikipedia's search box). \n\n.\nBookmarking \"Article Index\" would take care of steps 1-5. Are there other things I can do to make it easier to find info on Kiwipedia? I tried ZeroHello search (`xyz site:kiwipedia`) but that doesn't work.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554915701
		},
		{
			"comment_id": 6,
			"body": "@Krixano:\nre ZeroExchange about page: if people mentioning it is a problem, all it would take for people to never mention it again is to put there one paragraph even shorter than the one you posted here about people mentioning it. E.g.\n> ZeroExchange is a site where people can ` ___do xyz___ ` .\n.\nre \"*the centralization of ZeroTalk*\": Can you explain?\n.\nre \"*You can break this circle by being the type of person who uses new stuff regardless of how many people are on there*\" Like posting a video on KxoVid? ;)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554916550
		},
		{
			"comment_id": 7,
			"body": "@Krixano: So just copy & paste that to the About page. Problem solved.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554916661
		},
		{
			"comment_id": 8,
			"body": "Well, that escalated.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1554823066",
			"date_added": 1554917165
		},
		{
			"comment_id": 9,
			"body": ":D",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555072583",
			"date_added": 1555087252
		},
		{
			"comment_id": 10,
			"body": "@Deliriumgoddess6:\nHow about when it's hyperlinked?\n[Game.of.Thrones.S08E01.720p](ed2k://|file|%E6%9D%83%E5%8A%9B%E7%9A%84%E6%B8%B8%E6%88%8F.Game.of.Thrones.S08E01.720p-%E5%A4%A9%E5%A4%A9%E7%BE%8E%E5%89%A7%E5%AD%97%E5%B9%95%E7%BB%84.mp4|693078708|B3B109F40B707676EAB3DC6A77C17ED2|/)\n(Note: I haven't tried this myself, I don't have an ed2k client currently installed)",
			"post_uri": "1NNH8kJywadat5cvjhUvoPtL6PxVJXLGrH_1555343781",
			"date_added": 1555351233
		},
		{
			"comment_id": 11,
			"body": "For the mystery! The danger! The excitement!",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555352303",
			"date_added": 1555352508
		},
		{
			"comment_id": 12,
			"body": "> \"It's even more authoritative as an italicized block quote.\"",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555781429",
			"date_added": 1555784927
		},
		{
			"comment_id": 13,
			"body": "Aren't Skype calls P2P? (Not that I have compared Skype vs Tox vs Matrix)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555858716",
			"date_added": 1555862468
		},
		{
			"comment_id": 14,
			"body": "@caryoscelus: Skype *used* to be semi-P2P, but not any more.\n> Skype originally featured a hybrid peer-to-peer and client–server system. Skype has been powered entirely by Microsoft-operated supernodes since May 2012.\n",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555858716",
			"date_added": 1555868677
		},
		{
			"comment_id": 15,
			"body": "I think there's a \"law\" about problems, which goes something like this:\n+ Never automatically assume it's malice when it could just be incompetence.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1557814637",
			"date_added": 1557838484
		},
		{
			"comment_id": 16,
			"body": "@caryoscelus: I have constant connection issues too, although in my case it might be my telco/ISP just not giving a fuck due to its almost-monopoly over an area with few customers (the geography and economics here means no fixed-line competition whatsoever and almost no mobile competition.)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1557814637",
			"date_added": 1557927625
		},
		{
			"comment_id": 17,
			"body": "@caryoscelus: Connecting this thread to another, the Freedom on the Net 2018 report for my country pointed out recent legal & business developments that give my telco greater power in the marketplace and undermine the ability of competitors to provide alternative internet at a reasonable price.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1557814637",
			"date_added": 1557948386
		},
		{
			"comment_id": 18,
			"body": "Amazing to hear the protests and resistance seem to have worked this time.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1560181341",
			"date_added": 1560345104
		},
		{
			"comment_id": 19,
			"body": "Not if they are daily. But occasional posts here would definitely be fine and perhaps get the attention of people who don't already follow your sites.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1560605305",
			"date_added": 1560605673
		},
		{
			"comment_id": 20,
			"body": "I've done translation work but only in one direction: from [X] into English, the only language where I can be sure of the nuances of what I'm producing. Going from English into [X] I know I'd get the nuances wrong.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561154953",
			"date_added": 1561160805
		},
		{
			"comment_id": 21,
			"body": "Also \"likes\" are part of how social media giants try to keep us addicted, stimulating the reward centres of the brain. At least on ZeroMe, likes aren't data points being gathered and analyzed to sell to us... I hope.\n\nAn article about this just the other day, with one of the inventors:\n+ [BBC News - Should we dislike the 'Like' button?](https://www.bbc.com/news/business-48364817)",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561115870",
			"date_added": 1561161302
		},
		{
			"comment_id": 22,
			"body": "@caryoscelus: My theory: we all have only a limited amount of energy & attention for thinking and researching seriously. We can't think about & research seriously absolutely *everything* in life (because there are literally millions of variables) so we concentrate our effort on a few things we feel are most important to us. That means on all the other things in life we are reliant on others and on whatever info about it stuck in our minds over the years from casual exposure. Consequently we are *all* \"trusting idiots\" on many issues in life. It's just a question of *which* issues.\n.\nSo for the people clicking on ads, marketing analysis & manipulation just isn't one of the issues they focus on. At least until \"casual exposure\", e.g. a big news story like Cambridge Analytica, might, *might*, register and impact their feelings on it.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1561115870",
			"date_added": 1561212664
		}
	]
}