{
	"next_topic_id": 53,
	"topic": [
		{
			"topic_id": 1,
			"title": "FPOTUS - Fake President of the United States",
			"body": "Donald Trump regularly incites political violence and is a serial liar, rampant xenophobe, racist, misogynist and birther who has repeatedly pledged to ban all Muslims — 1.6 billion members of an entire religion — from entering the U.S.\n\nFeel free to post news stories and opinions. English only!",
			"added": 1488304094
		},
		{
			"topic_id": 2,
			"title": "Donald Trump, how will your administration deal with US-citizen children whose parents are deported?",
			"body": "Over President Donald Trump's first 100 days, we're asking him questions that our audience wants answers to. Join the project by tweeting this question to @realDonaldTrump with the hashtag #100Days100Qs:\n\n@realDonaldTrump: How will your administration deal with US-citizen children whose parents are deported? #100Days100Qs",
			"added": 1489074702
		},
		{
			"topic_id": 3,
			"title": "Donald Trump faces up to hard truths after FBI director James Comey labels his wiretapping claims false",
			"body": "On the 60th day of his presidency came the hardest truth for Donald Trump. He was wrong.\nJames B. Comey - the FBI director whom Trump celebrated on the campaign trail as a gutsy and honourable “Crooked Hillary” truth-teller - testified under oath Monday what many Americans had already assumed: Trump had falsely accused his predecessor of wiretapping his headquarters during last year’s campaign.\nTrump did not merely allege that former president Barack Obama ordered surveillance on Trump Tower, of course. He asserted it as fact, and then reasserted it, and then insisted that forthcoming evidence would prove him right.\nhttps://www.independent.co.uk/news/world/americas/donald-trump-james-comey-fbi-director-wiretapping-claims-false-barack-obama-gchq-trump-tower-a7641211.html",
			"added": 1490114716
		},
		{
			"topic_id": 4,
			"title": "How the White House Got James Comey Wrong",
			"body": "Early on Monday morning, a couple of hours before the start of the first House Intelligence Committee hearing on Russia’s involvement in the Presidential election, one of Donald Trump’s closest White House advisers made a startling—and completely erroneous—prediction: James Comey, the F.B.I. director, would testify that there was no collusion between the Trump campaign and Russia. “The Russian collusion thing has always been bullshit,” the official said. “I think Comey will come down and say there absolutely was no contact, collusion, or anything like that with the campaign.”\nhttp://www.newyorker.com/news/ryan-lizza/how-the-white-house-got-james-comey-wrong",
			"added": 1490114772
		},
		{
			"topic_id": 5,
			"title": "Sean Spicer attacks New York Times for 'made up' story criticising Donald Trump's tweets",
			"body": "White House Press Secretary Sean Spicer has reacted angrily to an article which suggested that he was one of a number of Donald Trump's staff that were getting tired of defending him.\n\nFocusing largely on the US leader's use of Twitter, The New York Times claimed that Mr Trump's use of the social media site was potentially damaging his administration and making it harder for his staff to defend him.\n\nhttps://www.independent.co.uk/news/world/americas/us-politics/sean-spicer-new-york-times-made-up-donald-trump-tweets-critical-a7641091.html",
			"added": 1490114840
		},
		{
			"topic_id": 6,
			"title": "US under Donald Trump is a 'parallel universe of disinformation', says Salma Hayek",
			"body": "Donald Trump's America is a “parallel universe of disinformation”, according to the actress Salma Hayek.\n\nThe Hollywood star has been an outspoken critic of the billionaire businessman, who she has previously accused of repeatedly asking her out even though he was aware she had a boyfriend.\n\nhttps://www.independent.co.uk/news/world/americas/us-politics/us-donald-trump-salma-hayek-america-parallel-universe-of-disinformation-fake-news-immigration-muslim-a7641506.html",
			"added": 1490114908
		},
		{
			"topic_id": 7,
			"title": "Donald Trump’s policy on leaks is highly hypocritical",
			"body": "Donald Trump is on a crusade to stop leaks. But not all leaks.\n\nAs he clings to the unsubstantiated claim that President Barack Obama wiretapped Trump Tower during the campaign — a claim with “no information that supports” it, according to congressional testimony Monday by FBI Director James B. Comey — it is worth remembering that news reports the White House has cited to bolster Trump's accusation are based on … leaks.\n\nTrump seems not to mind disclosures that help him push a narrative; he just hates ones that work against his preferred narratives. The president's inconsistency suggests that his opposition to leaks is more about politics than principle and that what he really wants to end is the flow of unflattering information.\n\nhttps://www.washingtonpost.com/news/the-fix/wp/2017/03/21/donald-trumps-policy-on-leaks-is-highly-hypocritical/",
			"added": 1490114967
		},
		{
			"topic_id": 8,
			"title": "Trump winery looking for foreign workers despite President's 'America first' slogan",
			"body": "As Donald Trump touts job creation for Americans as a top priority, his son's Virginia winery is seeking permission to hire foreign workers to cultivate its grapes.\n\nTrump Vineyard Estates, better known as Trump Winery, asked to bring in 29 workers this season through the federal H-2A visa program.\n\nhttps://www.independent.co.uk/news/world/americas/trump-winery-foreign-workers-eric-donald-a7641891.html",
			"added": 1490115049
		},
		{
			"topic_id": 9,
			"title": "Trump Organisation in violation of New York City law after failing to register Trump Tower with authorities",
			"body": "Donald Trump’s business has breached New York City law because it failed to register Trump Tower with the city’s department of housing.\n\nThe Trump Organisation, which has a $100 million (£80.1 million) mortgage on Trump Tower, failed to renew its annual registration with the New York City Department of Housing Preservation and Development after it expired in September 2016.\n\nFailing to renew the registration of properties with the housing authorities can result in a fine of up to $500 (£400), and revokes some of the rights enjoyed by property owners.\n\nhttps://www.independent.co.uk/news/world/americas/donald-trump-business-breach-new-york-law-tower-a7642326.html",
			"added": 1490135616
		},
		{
			"topic_id": 10,
			"title": "Reince Priebus should resign",
			"body": "Yesterday’s testimony from FBI Director James Comey, about an ongoing criminal investigation of links between the Trump campaign and Russian interference in the 2016 election, has cast a black cloud over the White House.\n\nBut in the case of White House chief of staff Reince Preibus, the impact is even more direct: Comey’s testimony strongly suggests that Priebus has not only repeatedly lied to the American people, but also that he may have obstructed justice.\n\nhttps://www.bostonglobe.com/opinion/2017/03/21/reince-priebus-should-resign/M6H5KmokyERBeGWVmoNYJL/story.html",
			"added": 1490135664
		},
		{
			"topic_id": 11,
			"title": "Fox News commentator Andrew Napolitano suspended after his latest conspiracy theory embarrasses the world",
			"body": "Fox News has been suspended its legal affairs commentator Andrew Napolitano after his uncorroborated allegation that former President Barack Obama used the U.K.’s spying operation to monitor President Donald Trump provoked an international incident.\n\nNapolitano’s claim, which he first made a week ago on an episode of “Fox & Friends,” was quickly picked up and repeated by White House press secretary Sean Spicer and later the president himself.\n\nhttps://www.salon.com/2017/03/21/fox-news-commentator-andrew-napolitano-suspended-after-his-latest-conspiracy-theory-embarrasses-world/",
			"added": 1490135717
		},
		{
			"topic_id": 12,
			"title": "Michael Moore calls on Democrats to declare ‘national emergency’ to stop Donald Trump",
			"body": "‘For the first time in our history, the President of the United States and his staff are under investigation for espionage’ he claims.\n\nFilmmaker Michael Moore has called on the Democratic Party in America to declare a national emergency, following the revelation that Donald Trump and his staff are being investigated by the FBI.\n\nFBI director James Comey confirmed this week that investigators are looking at alleged interference by Russia in the 2016 election, and any possible ties between Russia and Mr Trump’s campaign team.\n\nWriting on Instagram, Mr Moore has called for all business with Mr Trump to be halted, including decisions on legislation and confirmation of nominees to positions of public office, while he is under investigation.\n\nhttps://www.independent.co.uk/news/world/americas/michael-moore-democrats-donald-trump-national-emergency-us-president-documentary-congress-a7642836.html",
			"added": 1490191222
		},
		{
			"topic_id": 13,
			"title": "‘You got swamped’: Schwarzenegger calls out Trump’s low approval rating",
			"body": "Add another chapter to the ongoing star war between President Trump and Arnold Schwarzenegger. By way of dimly-lit video shot from an urban waterfront, Schwarzenegger mocked the president’s low approval ratings via Twitter on Tuesday.\n\nThe former California governor and actor was not above tossing a few barbs in the president’s direction. “Donald, the ratings are in, and you got swamped,” said Schwarzenegger, a Republican but not a Trump supporter. “Wow. Now you’re in the 30s?”\n\nTrump’s daily approval rating, per the Gallup poll, hit just 37 percent over the weekend. It marked a new floor for the young presidency and was, in the context of past presidents, dismal. The approval rating was “lower than Barack Obama experienced at any point over the course of his presidency,” as The Washington Post’s Philip Bump pointed out.\n\nhttps://www.washingtonpost.com/news/morning-mix/wp/2017/03/22/you-got-swamped-schwarzenegger-calls-out-trumps-low-approval-rating/",
			"added": 1490191298
		},
		{
			"topic_id": 14,
			"title": "Trump asked blacks, ‘What do you have to lose?’ He’s about to find out.",
			"body": "Candidate Donald Trump loved to ask African Americans (in front of overwhelmingly white audiences), “What do you have to lose?” President Trump will find out the answer Wednesday. That’s when he will meet with the Congressional Black Caucus at the White House for the first time. He’s so not going to like their answer.\n\nhttps://www.washingtonpost.com/blogs/post-partisan/wp/2017/03/22/trump-asked-blacks-what-do-you-have-to-lose-hes-about-to-find-out/",
			"added": 1490191388
		},
		{
			"topic_id": 15,
			"title": "White House refuses to attend international meeting to discuss human rights",
			"body": "The US pulled out of a international meeting that was to examine the potential impact on human rights of Donald Trump’s executive orders targeting refugees and immigrants.\n\nThe hearing of the Inter-American Commission on Human Rights (IACHR) was called following concerns about the impact of three executive orders signed by Mr Trump, including a plan to build a wall on the US-Mexico border.\n\nBut Reuters said the US announced it would not take part in the meeting, which was held in Washington DC on Tuesday.\n\nhttps://www.independent.co.uk/news/world/americas/trump-white-house-cancels-human-rights-meeting-to-discuss-executive-orders-muslim-ban-a7643391.html",
			"added": 1490191448
		},
		{
			"topic_id": 16,
			"title": "Giving New York the “shaft”: Newspapers blast GOP for Trumpcare loophole that could create massive deficits",
			"body": "The Republican Party’s repeal-and-replace bill for Obamacare, which has been showing signs of collapsing since as early as last week, is now facing a particularly harsh backlash from President Donald Trump’s home state of New York.\n\nThe deal, which the Center for American Progress observed would “blow a $2 billion hole in the state budget,” has caused New Yorkers to line up to register their outrage. CAP also pointed out that the earmark specifically for New York negotiated by some of the state’s GOP congressmen would force the state “to make up for this gap with massive cuts to state spending on county aid and other programs.”\n\nhttps://www.salon.com/2017/03/22/giving-new-york-the-shaft-newspapers-blast-gop-for-trumpcare-loophole-that-could-create-massive-deficits/",
			"added": 1490191512
		},
		{
			"topic_id": 17,
			"title": "Ivanka Trump’s “unofficial” White House job, explained",
			"body": "Ivanka Trump’s power behind the scenes in the White House is about to become official — unofficially. Trump is getting her own office in the West Wing, a security clearance, and a government-issued phone, according to Politico. She won’t be paid a salary or be sworn in. The role is described as “unofficial,” but it sounds official in all but name.\n\nHer appointment is pure nepotism: There is nothing on her résumé that suggests Ivanka Trump is qualified, by any traditional definition of the term, to advise the president of the United States.\n\nhttp://www.vox.com/2017/3/22/15005508/ivanka-trump-white-house-nepotism",
			"added": 1490191570
		},
		{
			"topic_id": 18,
			"title": "Ivanka Trump's family skiing 'funded by the taxpayer'",
			"body": "'Taxpayers can't afford Meals on Wheels anymore, but they can afford to pay for Trump's kids to vacation,' says critic.\n\nIvanka Trump has sparked outrage for the cost of her family’s spring break ski holiday in Colorado.\nPresident Donald Trump’s daughter, her husband Jared Kushner, their children and the President’s other son Eric reportedly required 100 Secret Service agents to travel with the group for the trip.\n\nhttps://www.independent.co.uk/news/world/americas/ivanka-trump-family-aspen-skiing-holiday-family-taxpayer-secret-service-agent-a7643246.html",
			"added": 1490191648
		},
		{
			"topic_id": 19,
			"title": "Supreme Court restricts Donald Trump's power to fill temporary government posts",
			"body": "The Supreme Court has limited the Donald Trump's power to temporarily fill vacant government posts while nominations are tied up in partisan political fights.\n\nThe 6-2 ruling said a former top lawyer at the National Labor Relations Board had served in violation of a federal law governing such appointments.\n\nhttps://www.independent.co.uk/news/world/americas/us-politics/supreme-court-donald-trump-government-jobs-lafe-solomon-barack-obama-a7643156.html",
			"added": 1490191714
		},
		{
			"topic_id": 20,
			"title": "FBI investigated Russian mafia at Trump Tower for two years in probe unrelated to 2016 election",
			"body": "The FBI did wiretap Trump Tower to monitor Russian activity, but it had nothing to do with the 2016 Presidential election, it has been reported.\n\nBetween 2011 and 2013 the Bureau had a warrant to spy on a high-level criminal Russian money-laundering ring, which operated in unit 63A of the iconic skyscraper — three floors below Mr Trump's penthouse.\n\nhttps://www.independent.co.uk/news/world/americas/us-politics/fbi-russia-mafia-trump-tower-two-years-2016-presidential-election-us-money-laundering-alimzhan-a7642851.html",
			"added": 1490191788
		},
		{
			"topic_id": 21,
			"title": "Did Putin use Breitbart and Infowars to help Trump? The FBI wants to know",
			"body": "President Donald Trump may have tried to dismiss claims that his campaign colluded with Russia as “fake news,” but a new report suggests that an FBI-led team is investigating how right-wing sites — peddling pro-Trump and anti-Clinton stories, fake and real alike — were promoted by Russian cyber intelligence.\n\nRussian cyber intelligence are believed to have created bots that promoted those stories throughout social media, and particularly on Facebook and Twitter, during times in the 2016 presidential election when Trump seemed to be trailing in the polls, according to McClatchy. The sites promoted included not only Russian propaganda sites like RT and Sputnik News, but also far right sites like InfoWars (run by conspiracy theorist Alex Jones) and Breitbart (then run by CEO Steve Bannon, who is now Trump’s chief strategist).\n\nhttps://www.salon.com/2017/03/22/did-putin-use-breitbart-and-infowars-to-help-trump-the-fbi-wants-to-know/",
			"added": 1490191844
		},
		{
			"topic_id": 22,
			"title": "A veteran GOP strategist explains why conservative elites put up with Trump's lies and corruption",
			"body": "A lot of weird stuff happened over the past seven days in American politics that might make President Trump’s party skeptical of him. The Trump administration provoked a minor international incident with the United Kingdom by accusing its surveillance agency of complicity in an illegal scheme to subject Trump’s campaign to surveillance. The directors of the FBI and the National Security Agency, plus the chairs of the congressional intelligence committees, rebuked the president for lying about these surveillance issues. Trump also provoked a minor international incident with Germany by accusing Angela Merkel’s government of being somehow in debt to NATO.\n\nhttp://www.vox.com/policy-and-politics/2017/3/22/14990838/why-republican-elites-back-trump",
			"added": 1490191934
		},
		{
			"topic_id": 23,
			"title": "Trump Sics Lawyers on Teen for Making Silly Site Where Kittens Punch Him",
			"body": "Lucy is a 17-year-old from San Francisco who spends her spare time reading at coffee shops, splurging on guac at Chipotle and practicing her tech skills. The high schooler dreams of working at a disruptive tech company and has recently been applying for web development jobs to get an early jump on her career. She wanted a “fun, little” project to put on her resume, so she coded a site called TrumpScratch.com where users click on Donald Trump’s face to punch him with tiny kitten paws.\n\nBut what was meant as nothing more than a jokey website for coding practice has turned into a legal nightmare. Now Lucy is facing the wrath of the big man himself.\n\nhttp://observer.com/2017/03/trump-cease-and-desist-kitten-punch-site/",
			"added": 1490192018
		},
		{
			"topic_id": 24,
			"title": "Trump's problem with truth",
			"body": "\"Believe Me.\"\n\nDonald Trump wore those words out as a candidate as he beseeched voters to buy into his grand plans and promises on everything from crushing ISIS to building a great border wall.\n\nNow, the question of whether Americans can trust Trump is again a dominant political theme after he was caught in a lie over claims that he was wiretapped by his predecessor Barack Obama.\n\nTrump's repudiation by FBI Director James Comey in a sensational hearing Monday came exactly two months into an administration unusually prone to obfuscation, blurring facts and peddling falsehoods.\n\nFrom false assessments of the size of his inaugural crowd and claims that millions of illegal voters dealt him defeat in the popular vote in November, the President has often seemed happy to propagate conspiracy theories.\n\nhttp://edition.cnn.com/2017/03/22/politics/donald-trump-trust-erosion/index.html",
			"added": 1490192092
		},
		{
			"topic_id": 25,
			"title": "WSJ editorial: Most Americans may conclude Trump 'fake president'",
			"body": "President Donald Trump's repeated lack of \"respect for the truth\" puts him in jeopardy of being viewed as \"a fake President,\" The Wall Street Journal editorial board says.\n\n\"Two months into his presidency, Gallup has Mr. Trump's approval rating at 39%. No doubt Mr. Trump considers that fake news, but if he doesn't show more respect for the truth, most Americans may conclude he's a fake President,\" reads the editorial, which appeared online Tuesday night.\n\nhttp://edition.cnn.com/2017/03/22/politics/donald-trump-wsj-trust/index.html",
			"added": 1490192152
		},
		{
			"topic_id": 26,
			"title": "Donald Trump has lost the Wall Street Journal’s editorial board",
			"body": "On Wednesday, the Wall Street Journal’s editorial board published a scathing criticism of President Trump, warning that “if he doesn't show more respect for the truth most Americans may conclude he's a fake President.” It also colorfully says that “the President clings to his assertion like a drunk to an empty gin bottle.”\nhttp://www.vox.com/policy-and-politics/2017/3/22/15021220/wall-street-journal-editorial-trump",
			"added": 1490211456
		},
		{
			"topic_id": 27,
			"title": "Trump Wants to Cut Public Broadcasting — Where Mike Pence’s Daughter Got Her Start as a Filmmaker",
			"body": "One of the more shocking elements of President Trump’s proposed 2018 budget is his suggestion to eliminate all $455 million in federal funding for the Corporation for Public Broadcasting, which provides support for public television and radio stations across the country.\n\nThis has been widely depicted as a threat to Sesame Street. But the real losers would be local stations in areas outside big coastal cities, which wouldn’t be able to make up for the budget hit with private support.\n\nViewers would lose out on public affairs and local programming — while creative professionals who ply their trade outside of New York or Los Angeles would no longer have an outlet for their unique skills.\n\nA good example of someone who used public broadcasting to support early career development is the daughter of Vice President Mike Pence.\n\nhttps://theintercept.com/2017/03/22/trump-wants-to-cut-public-broadcasting-where-mike-pences-daughter-got-her-start-as-a-filmmaker/",
			"added": 1490211536
		},
		{
			"topic_id": 28,
			"title": "Donald Trump is short on votes to pass Obamacare replacement bill through House",
			"body": "The Trump administration is currently short the votes needed to repeal and replace on Obamacare in a vote that could define Donald Trump's presidency.\n\nMore than 25 members of the deeply conservative Republican Freedom Caucus in US House of Representatives are set to vote ‘no’ on the American Health Care Act. Mr Trump had promised several times during his campaign and in the first few months of his presidency to repeal the healthcare plan and replace it with one that was not a \"disaster.\"\n\nThe vote is set to take place on 23 March. With expected absences, the Trump administration will need 215 votes to pass and could only really afford 22 Republicans to defect from the party line.\n\nhttps://www.independent.co.uk/news/world/americas/donald-trump-american-health-care-act-votes-short-obamacare-bill-house-congress-reform-white-house-a7644631.html",
			"added": 1490211603
		},
		{
			"topic_id": 29,
			"title": "Former Colorado GOP chairman who accused Democrats of voter fraud arrested for voter fraud",
			"body": "The former chairman of Colorado’s Republican Party, who just last year suggested on his “Wake Up!” talk radio show that Democrats were largely to blame for fraudulent votes, has been charged with voter fraud and forgery.\n\nAccording to the Weld County District Attorney’s office, Curtis allegedly filed out his ex-wife’s absentee ballot for last year’s presidential election after it had been sent to his house and forged her signature. He was charged with one count of misdemeanor voter fraud and one count of forgery, a Class 5 felony, according to local media. The 57-year-old radio jock, who served as party chairman from 1997-99, faces up to three years in jail if convicted.\n\nhttps://www.salon.com/2017/03/22/former-colorado-gop-chairman-who-accused-democrats-of-voter-fraud-arrested-for-voter-fraud/",
			"added": 1490229144
		},
		{
			"topic_id": 30,
			"title": "US Officials: Info suggests Trump associates may have coordinated with Russians",
			"body": "The FBI has information that indicates associates of President Donald Trump communicated with suspected Russian operatives to possibly coordinate the release of information damaging to Hillary Clinton's campaign, US officials told CNN.\n\nThis is partly what FBI Director James Comey was referring to when he made a bombshell announcement Monday before Congress that the FBI is investigating the Trump campaign's ties to Russia, according to one source.\n\nhttp://edition.cnn.com/2017/03/22/politics/us-officials-info-suggests-trump-associates-may-have-coordinated-with-russians/index.html",
			"added": 1490229206
		},
		{
			"topic_id": 31,
			"title": "10 Ways to Speak Truth to Lies in the Trump Era",
			"body": "In an era of fake news, alternative facts, and downright lies, it’s a daily struggle to promote a positive, inclusive vision for our country that’s rooted in truth and justice. And when the loudest and most virulent falsehoods come from the highest levels of government, this challenge can feel overwhelming.\n\nResearch and experience point to clear ways that advocates, journalists, and everyday people can overcome the fiction and get the real story out. Here are ten of them.\n\nhttp://www.alternet.org/news-amp-politics/speaking-truth-power-trumps-america",
			"added": 1490273977
		},
		{
			"topic_id": 32,
			"title": "Can President Trump Handle the Truth?",
			"body": "Generations of American children have learned the apocryphal tale of young George Washington, bravely admitting to his father that he chopped down the cherry tree. The story sprang from a culture that wanted even its fables to serve the ideal of truth. By that standard, the House Intelligence Committee hearing on March 20 should have been a massive humiliation for the President, who followed Washington 228 years later. It is rare for such hearings to be unclassified--and thus televised--but FBI Director James Comey found the largest possible audience for his rebuke of the sitting President.\nhttp://time.com/4710614/donald-trump-fbi-surveillance-house-intelligence-committee/",
			"added": 1490274031
		},
		{
			"topic_id": 33,
			"title": "Trump: When the President Says It, That Means It’s True",
			"body": "The commander in chief embraces a peculiar worldview in which bogus claims are retroactively justified and evidence simply conjured into existence.\nhttps://www.theatlantic.com/politics/archive/2017/03/trump-time-interview-ex-post-facto/520551/",
			"added": 1490288483
		},
		{
			"topic_id": 34,
			"title": "The Daily 202: Fresh evidence Trump’s Russia headaches are not going away",
			"body": "THE BIG IDEA: The drip, drip, drip of damaging Russia revelations continues, as White House efforts to change the narrative backfire.\n\n-- CNN reported late last night that the FBI has information that indicates associates of Donald Trump communicated with suspected Russian operatives to possibly coordinate the release of information damaging to Clinton's campaign: “This is partly what FBI Director James Comey was referring to when he made a bombshell announcement Monday before Congress that the FBI is investigating the Trump campaign's ties to Russia. … The FBI is now reviewing that information, which includes human intelligence, travel, business and phone records and accounts of in-person meetings.”\n\nhttps://www.washingtonpost.com/news/powerpost/paloma/daily-202/2017/03/23/daily-202-fresh-evidence-trump-s-russia-headaches-are-not-going-away/58d36ffae9b69b72b2551022/",
			"added": 1490288548
		},
		{
			"topic_id": 35,
			"title": "FBI reportedly investigating bots that spammed Breitbart and Infowars stories",
			"body": "As part of a probe into Russian influence on the 2016 election, an FBI-led investigation is seeking more information on social media bots that spammed “millions” of pro-Trump posts from far-right news organizations, according to a report published this week by McClatchy.\n\nThe bots sent out stories from controversial conservative sources such as Breitbart and Infowars, as well as the Russia-backed outlet RT. According to McClatchy, many of the stories contained false or misleading information.\n\nhttp://www.theverge.com/2017/3/23/15035696/fbi-bots-investigation-conservative-news-trump",
			"added": 1490288633
		},
		{
			"topic_id": 36,
			"title": "Report suggests FBI has travel, business, and phone records that could tie Trump's campaign to Russia",
			"body": "An FBI official claims to have information that suggests collaboration between President Donald Trump's associates and Russian intelligence officials during the 2016 election, CNN reported Wednesday night.\n\nThe anonymous law enforcement official told the news outlet that FBI evidence shows \"people connected to the campaign were in contact and it appeared they were giving the thumbs up to release information\" in order to promote Trump and erode trust in Hillary Clinton's campaign.\n\nhttp://www.businessinsider.com/trump-russia-campaign-travel-business-phone-records-fbi-investigation-2017-3",
			"added": 1490288702
		},
		{
			"topic_id": 37,
			"title": "Donald Trump’s Approval Ratings Are So Low, He Wants Advice from Melania",
			"body": "Melania Trump’s approval rating is so much higher than her husband's that the president has joked that he could seek her out for advice.\n\nWhile Donald Trump has continued to set record lows for approval ratings of a new president, his wife Melania has seen a sharp rise in popularity since becoming first lady. More than half, 52 percent, of Americans indicated they have a favorable opinion of her in a CNN/ORC poll released earlier this month, up 16 percent from before her husband’s inauguration.\n\nThe president, meanwhile, saw his approval rating slip to 35 percent in a Gallup tracking poll Tuesday, by some distance the lowest figure recorded by any president at this stage of their first term since before Dwight Eisenhower.\n\nhttp://www.newsweek.com/melania-trump-approval-rating-donald-576715",
			"added": 1490885195
		},
		{
			"topic_id": 38,
			"title": "Our Dishonest President",
			"body": "It was no secret during the campaign that Donald Trump was a narcissist and a demagogue who used fear and dishonesty to appeal to the worst in American voters. The Times called him unprepared and unsuited for the job he was seeking, and said his election would be a “catastrophe.”\n\nStill, nothing prepared us for the magnitude of this train wreck. Like millions of other Americans, we clung to a slim hope that the new president would turn out to be all noise and bluster, or that the people around him in the White House would act as a check on his worst instincts, or that he would be sobered and transformed by the awesome responsibilities of office.\n\nInstead, seventy-some days in — and with about 1,400 to go before his term is completed — it is increasingly clear that those hopes were misplaced.\n\nIn a matter of weeks, President Trump has taken dozens of real-life steps that, if they are not reversed, will rip families apart, foul rivers and pollute the air, intensify the calamitous effects of climate change and profoundly weaken the system of American public education for all.\n\nHis attempt to de-insure millions of people who had finally received healthcare coverage and, along the way, enact a massive transfer of wealth from the poor to the rich has been put on hold for the moment. But he is proceeding with his efforts to defang the government’s regulatory agencies and bloat the Pentagon’s budget even as he supposedly retreats from the global stage.\n\nhttp://www.latimes.com/projects/la-ed-our-dishonest-president/",
			"added": 1491219197
		},
		{
			"topic_id": 39,
			"title": "Why Trump lies",
			"body": "Donald Trump did not invent the lie and is not even its master. Lies have oozed out of the White House for more than two centuries and out of politicians’ mouths — out of all people’s mouths — likely as long as there has been human speech.\n\nBut amid all those lies, told to ourselves and to one another in order to amass power, woo lovers, hurt enemies and shield ourselves against the often glaring discomfort of reality, humanity has always had an abiding respect for truth.\n\nIn the United States, born and periodically reborn out of the repeated recognition and rejection of the age-old lie that some people are meant to take dominion over others, truth is as vital a part of the civic, social and intellectual culture as justice and liberty. Our civilization is premised on the conviction that such a thing as truth exists, that it is knowable, that it is verifiable, that it exists independently of authority or popularity and that at some point — and preferably sooner rather than later — it will prevail.\n\nEven American leaders who lie generally know the difference between their statements and the truth. Richard Nixon said “I am not a crook” but by that point must have seen that he was. Bill Clinton said “I did not have sexual relations with that woman” but knew that he did.\n\nhttp://www.latimes.com/projects/la-ed-why-trump-lies/",
			"added": 1491219356
		},
		{
			"topic_id": 40,
			"title": "Federal judge rules President Trump incited violence at rally as candidate",
			"body": "A Kentucky Federal Judge refused to dismiss the claim from three protesters at a 2016 Trump rally that then-candidate Trump, provoked violence with his rhetoric to have them removed.\n\nU. S. District Judge David J. Hale ruled in a March 31 opinion that he is rejecting requests from Trump and his supporters named as defendants in the case to dismiss the charges brought by three rally protesters because there was precedent of violence at previous Trump rallies and Trump was inciting violence by ordering the removal of protesters.\n\nhttp://www.bostonherald.com/news/national/2017/04/federal_judge_rules_president_trump_incited_violence_at_rally_as_candidate",
			"added": 1491220926
		},
		{
			"topic_id": 41,
			"title": "Protesting Trump's immigration policy? You might be accidentally helping him",
			"body": "An awkward question has begun to nag opponents of Donald Trump’s immigration policies: is the resistance inadvertently helping the administration?\n\nFew say it publicly but there is concern that the rallies and marches, alerts and tweets, workshops and press releases are helping the administration sow fear among undocumented immigrants.\n\nThe spectre of deportation so haunts communities across the United States that some people are afraid to report crimes and others have reportedly decided to return to Mexico and Central America before they get swept up.\n\nhttps://www.theguardian.com/us-news/2017/apr/03/donald-trump-immigration-deportation-protest-secret-agenda",
			"added": 1491221007
		},
		{
			"topic_id": 42,
			"title": "Robert Redford compares Trump to Nixon in Watergate warning",
			"body": "Robert Redford has said that Donald Trump has taken Richard Nixon’s attacks on journalism to “new and dangerous heights”, in a column written for the Washington Post.\n\nIn the article, titled 45 Years After Watergate, the Truth Is Again in Danger, the actor writes of his concerns that, if a political scandal similar to the one that brought down Nixon occurred today, it might not be “navigated” as well due to the public’s “tenuous grasp on truth”.\n\nRedford is more familiar than most with Watergate. In 1976 he played Post journalist Bob Woodward in All the President’s Men, Alan J Pakula’s film about the attempts by Woodward and Carl Bernstein (played by Dustin Hoffman) to investigate the scandal that would ultimately force Nixon to resign from the presidency.\n\nhttps://www.theguardian.com/film/2017/apr/03/robert-redford-trump-nixon-watergate-washington-post-all-the-presidents-men",
			"added": 1491221053
		},
		{
			"topic_id": 43,
			"title": "Trump’s Authoritarian Vision",
			"body": "Standing before the cheering throngs at the Republican National Convention last summer, Donald Trump bemoaned how special interests had rigged the country’s politics and its economy, leaving Americans victimized by unfair trade deals, incompetent bureaucrats and spineless leaders.\n\nHe swooped into politics, he declared, to subvert the powerful and rescue those who cannot defend themselves. “Nobody knows the system better than me, which is why I alone can fix it.”\n\nTo Trump’s faithful, those words were a rallying cry. But his critics heard something far more menacing in them: a dangerously authoritarian vision of the presidency — one that would crop up time and again as he talked about overruling generals, disregarding international law, ordering soldiers to commit war crimes, jailing his opponent.\n\nhttp://www.latimes.com/projects/la-ed-trumps-authoritarian-vision/",
			"added": 1491320951
		},
		{
			"topic_id": 44,
			"title": "Visitors to the U.S. may have to hand over their phones and Facebook passwords before they get a visa",
			"body": "Coming to America? You may have to hand over your phone — and your Facebook password — before you do.\n\nThe Trump administration may ask visa applicants to hand over their phones, along with social media logins and passwords, the Wall Street Journal reports. It’s part of the “extreme vetting” for visitors to the U.S. Trump promised during his campaign.\n\nTrump officials previously floated the idea this year. But at the time, they planned on scrutinizing visitors from majority-Muslim countries. Now, the WSJ says, “the changes could apply to people from all over the world, including allies like France and Germany.\n\nhttps://www.recode.net/2017/4/4/15176658/trump-visa-phone-facebook-password",
			"added": 1491321025
		},
		{
			"topic_id": 45,
			"title": "Steve Bannon has been removed from the National Security Council",
			"body": "President Donald Trump's chief strategist will no longer sit on the National Security Council. The White House announced in a presidential memorandum dated April 4 that Trump was reorganizing the NSC and Steve Bannon would no longer be on it.\nhttp://www.businessinsider.com/steve-bannon-removed-from-national-security-council-2017-4",
			"added": 1491409962
		},
		{
			"topic_id": 46,
			"title": "Trump’s War on Journalism",
			"body": "In Donald Trump’s America, the mere act of reporting news unflattering to the president is held up as evidence of bias. Journalists are slandered as “enemies of the people.”\nFacts that contradict Trump’s version of reality are dismissed as “fake news.” Reporters and their news organizations are “pathetic,” “very dishonest,” “failing,” and even, in one memorable turn of phrase, \"a pile of garbage.”\nhttp://www.latimes.com/projects/la-ed-trumps-war-on-journalism/",
			"added": 1491410022
		},
		{
			"topic_id": 47,
			"title": "National embarrassment: A majority of Americans don’t like having Donald Trump as president, and his wall isn’t helping him",
			"body": "A majority of voters in the U.S. are embarrassed to have Donald Trump as their president, according to a new Quinnipiac University poll released on Tuesday. Fifty-two percent of voters said they were embarrassed that Trump is leading the nation, while only 27 percent stated they were proud. Trump also appears to be losing popularity within key factions of his voter base — men and white people. Fifty-one percent of white male voters and 48 percent of all white voters polled said they disapprove of the way Trump is handling his new job. In total, only 35 percent approve of Trump’s handling of the presidency, while 57 percent said they disapprove.\nhttps://www.salon.com/2017/04/05/national-embarrassment-a-majority-of-americans-dont-like-having-donald-trump-as-president-and-his-wall-isnt-helping-him/",
			"added": 1491410809
		},
		{
			"topic_id": 48,
			"title": "Kelly: No border wall 'from sea to shining sea'",
			"body": "Homeland Security Secretary John Kelly said Wednesday it is \"unlikely\" that the Trump administration will build a full wall along the entire Southern border, despite President Donald Trump's consistent promises to that effect.\n\"It is unlikely that we will build a wall, a physical barrier, from sea to shining sea,\" Kelly told the Senate Homeland Security and Governmental Affairs Committee Wednesday morning.\nhttp://edition.cnn.com/2017/04/05/politics/kelly-testimony-senate-homeland-border-security-wall/",
			"added": 1491411070
		},
		{
			"topic_id": 49,
			"title": "The GOP's 2nd Attempt to Destroy Our Health Care System Is Falling Apart More Quickly Than the First",
			"body": "President Donald Trump may have told NBC News on Monday that he is serious about reviving health care reform, but early reports suggest that the second attempt at a repeal-and-replace bill for the Affordable Care Act, also known as Obamacare, isn’t going much better than the initial effort.\nhttp://www.alternet.org/right-wing/gops-2nd-attempt-destroy-our-health-care-system-falling-apart-more-quickly-first",
			"added": 1491412076
		},
		{
			"topic_id": 50,
			"title": "U.S. To Lose $1.6B As Mexican Vacationers Choose Canada",
			"body": "The American tourism industry could be facing a new phenomenon: waning interest in the traveling to the United States. After decades of sitting pretty as a bucket list destination, the stars and stripes might be on their way out. Experts warn that anti-immigration rhetoric as well as confusing travel and electronic bans have dampened foreign interest in U.S. vacations, especially from Mexico.\nhttps://www.forbes.com/sites/alexandratalty/2017/03/30/mexicans-choosing-canada-over-the-us-for-vacations/",
			"added": 1491412152
		},
		{
			"topic_id": 51,
			"title": "Conspiracy Theorist in Chief",
			"body": "It was bad enough back in 2011 when Donald Trump began peddling the crackpot conspiracy theory that President Barack Obama was not a native-born American. But at least Trump was just a private citizen then.\n\nBy the time he tweeted last month that Obama had sunk so low as to “tapp [sic] my phones during the very sacred election process,” Trump was a sitting president accusing a predecessor of what would have been an impeachable offense.\n\nhttp://www.latimes.com/projects/la-ed-conspiracy-theorist-in-chief/",
			"added": 1491568527
		},
		{
			"topic_id": 52,
			"title": "California Fights Back",
			"body": "When Donald Trump threatened on the campaign trail to deport every single immigrant living in the country illegally, bring back offshore drilling and reverse the anti-pollution policies that help clear smoggy skies, Californians immediately understood that our state would be disproportionately affected — and disproportionately harmed — by the reckless policies he was hoping to enact.\n\nAfter he was sworn in, he went further, singling out the state for attack. “California,” Trump declared in February, “in many ways is out of control.” In one overwrought tweet, he suggested that the federal government should cut all funding for UC Berkeley because a protest against a conservative guest speaker had turned violent. A few days later, he declared — even more irresponsibly — that he would “defund” the entire state if he felt it wasn’t cooperating sufficiently in his efforts to root out undocumented immigrants.\n\nhttp://www.latimes.com/projects/la-ed-california-fights-back/",
			"added": 1491568579
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}