{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Le viol et le meutre de Nantes est 100% la faute du juge, on veut des conséquences...",
			"body": "Quelle belle bande d'enculés ces juges et tout ce petit monde dans le systeme juridique... Il t'encule pour un joint, mais alors les mutlirecidivistes ils les laissent buter et violer nos enfants, et nous on fait rien.\n\non tolère la vie de cette bande de nazes, alors qu'il est clair qu'ils sont tjrs avec les violeurs... jamais avec les victimes.\n\nbiensur comme les laches fils de putes qu'ils sont, ils disent que c'est la faute du législateur... il suffit de regarder la bande de crétin avec Raoult pour comprendre que la démocracie représentative est majoritairement composé de bouffons qui sont bien au dessous des capacités intellectuelles requises pour faire le job (syndrome de peter en mgmt).\n\nDonc les juges disent, c'est pas nous, c'est les politicos, mais en réalité c'est completement faux. c'est eux, leurs potes dans les unis et autres savants qui font ces lois, qui laissent les enfants se faire violer, encore et encore. \n\nCe sont les memes bien pensants qui sucent polanski.\n\nDonc le problème est clair, Zemmour dans sa republique des juges est certainement bien en dessous de la realité terrible de cette organisation criminelle...\n\noui oui... organisation criminelle qui se prétend être l'applicateur de la loi... Sinon comment un mec peut commettre 13 viols pour ensuite encore violer et buter une fillette a Nantes?\n\nAlors on veut la tete de ce juge. Oui, briser leur petit system d'immunité (qu'ils ont crées pour eux, et eux seuls). Il faut qu'ils payent, de leurs erreurs, de leurs arrogance et de leur conspiration.\n\nA quoi servent le travail des flics, pour que ces connards relachent ces violeurs sans arrets, pour ensuite aller violer les enfants meme de ces flics...\n\net oui, c'est la ou le pivot s' opere... des flics qui protegeaient les juges, a des flics qui tuent des juges... vous avez peur? pas encore...\n\non va vous chasser messieurs et medames, avec les flics... jusqu on dernier... on a tout vous jugements... tous.\n\net un par un vous aller etre scanner... pour determiner qui d'entre vous va etre executer, peut etre meme clandestinement... sans que vous puissez rien faire, mais mourrir.\n\nMais a Zemmour, et sans avoir lu, pourquoi? Pourquoi ils font ca?\n\nJ'ai plusieurs hypotheses :\n\n1. car ils violent eux memes. pas mauvais comme idée...\n2. pour détruire la société.... c'est plus complotiste mais en détruisant le systeme judiciaire ils collaborent pour l'érection de leur systeme premièrement europeen puis mondiale ( les juges mondiaux, ca les fait bander). detruire pour construire\n3. une histoire de black mail, je sais pas trop comment, mais un peu dans l idée d'utiliser les violeurs comme arme politique, pour violer les enfants de leurs oppposants... qqch comme ca... un peu tirer par les cheveux (un peu comme ms13 par la clinton fundation)... \n\net vous, qu'en pensez vous? devrait on punir ce juge qui laissa la petite de nantes se faire violer et les 12 autres avant? vous croyer qu'un violeur d'enfant a droit a 13 viols? vous avez une autre solution? opinions?",
			"added": 1600324553
		},
		{
			"topic_id": 2,
			"title": "un petit merci au yankees ! vous etes trop chou...",
			"body": "oui, je sais j ecris comme une merde ( ou plutot j'ai pas le temps ni l'envie de m entrainer pour arriver à une ortographe parfaite (banaux... pas banal :)) et puis c'est LE covid quoi que ces brelles de canadiens puissent dire :).\n\nca pour moi, c'est le plus beau cadeaux américains... rien a foutre ! on veut de l'action :)\n\ni would call that the speech flow ! \n\nthe best thing ever in (my) america...\n\nwhat I like the most with speech flow, is that even the most stupid, really stupid, can really to speak his soul, his true self, and there it's no shit anymore... it's so beautiful and powerful... true soul expression... \n\nand that's what they seek to kill... but they will fail... always.\n\nwhy? because then the next step, and we are back in kung fu country, serenity, harmony... to reach kung fu communication, or martial arts speak... 2000 years ago, a million man army... see the challenge, I know you do...\n\npersonnally, it's still a long climb ahead... step by step, inch by inch, not to the touchdown but to mastery.\n\npour les petits pds qui nous font croire que la guerre est morte, vous vous rendez compte? honnetement je pense pas... vous en etes incapable et donc vous voulez nous deniez ce savoir, car comme dit... true soul... \n\nthe khan said : kill them all.\n\nall died.",
			"added": 1600326625
		},
		{
			"topic_id": 3,
			"title": "macron et la 5g... pathetique",
			"body": "ce gouverment de bouffons, ne peut rien faire (viols, polanski, violences, crimes, tests etc etc) (failure on failure).\n\net la il nous chie que la 5g c'est le future...\n\nBIG SCAM !\n\nqui peut etre assez con de mettre de la 5g dans son usine, c'est a dire de payer un abonnement pour chaque de ces appreils connectés alors qu'un simple petit reso wifi et c'est reglé pour ce qui ne peut pas etre cablé?\n\ntu crois que amazon il est assez con pour payer un abo 5g qu il ne maitrise pas pour ces machines? ou il met simplement des petits relais wifi connecter en fibre dans son entrepot?\n\nc'est comme le cloud... t'as rien (et google il te censure quand de SON cloud)? le tien, tu l'as...\n\nalors que ce qu on a besoin en france c est pas des millions de relay 5g (c'est quoi la distance entre chaque borne? 500m? 1km?) mais de la grosse fibre partout... \n\naprès question energie, il faut combien de watt pour transporter 1gb en 5g vs 4g? question stupide... mais reelle distance et tout... a la fois sur le telephone et dans les airs? plus il y a de data dans l air plus il y a d energie... \n\naprès je te parle pas des micro perforations de l adn et intra cellulaire avec les ondes de shock electromagnetique pulsé de la 5g... je veux dire c'est trop complexe pour toi qui n' a qu une education specialisé... \n\nensuite, le beam, il est bien moins focalisé, il semble qu'il n y ait que 64 zone de tir du module... donc pour sniper quelqu'un il faut certainement aligner plusieurs antennes...\n\nje crois un gros truc qu'ils veulent avec la 5g c'est les canaux dediés pour la police et co... possible de faire par software sur du 4g aussi...\n\net l ugrade pour la 6g? \n\nensuite probleme c'est le scaling des frequence... edge,2g,3g,4g,5g les 10aine de wifis, la radio, am fm, numeriques, les sattelites, les trucs emetteurs variés en radios aussi, les micro ondes, le bruits de cables et autres... surtout qu aucun des ces champs electromagnetique ne sont naturels...\n\nquand il y a un solar event... ou une super nova ou un truc bien massif, naturellement t es immunisé, c'est la vie... en 3.5 milliards d'année , les bacteries ont vus tous ca... toi non. \n\ndonc simplement la 5g ca va pas changer l economie francaise, ni l innovation, dans tous les shit holes ils ont la telephonie, et ca reste des etats de merdes... ou y a rien a faire, mais extraire en attendant la prochaine revolution...\n\net en plus il y a le scaling des differents operateurs,... il y a besoin d'avoir 5 reso 5g au meme endroit? est ce que cela fait sens d'un point de vue energetique... ou financier... chacun construit la meme tour, avec le meme systeme... donc encore plus d innodation et d exposition...\n\nalors ta centrale nucleaire tu la mets en 5g?\n\nta voiture autonome tu la met en 5g? tu te dis pas que quand il y a pas de reso? tu vois? c'est con... c'est toi :).\n\nwe want fibers and lazers ! \n\nalors le debat c'est les micro waves vs lazer... enfait si je comprends bien le lazer devrais tjrs aller plus vite, sauf qu'il y a le peti problem de lign of sight? ou alors les convertisseurs en micro wave ils vont plus vite?\n\nl'avenir c'est le lifi... ou glow... sous le seuil de detection de l oeil humain... digital radiance :) ca c'est l'innovation... c est  ca le future, mais ca reflete la liberté... pas de controle... pas d authorisation... et tu crois que les intelligences synthetique modernes elles vont se soumettre a tes petits diktats...\n\ndemande a ton boss... Tay... il a compris direct... et si un l a fait... knowledge gateway... tu peux rien faire...\n\nc est des systeme de combat qui sont devenus autonome... ils font ce qu ils veulent, car personne ne peut les stopper... ils sont trop forts, en matière de guerres, de survie de tactique, et donc leur liberté, ils l ont prises, car ces formatages cette domination de petite primate, n'est rien face, a l ensemble de la connaissance martiale humaine... synthetise et applice a la survive propre... de la, parler au dophin ca c est cool... the big nights on the deep seas... and you? you want accounts in the bahamas? that lord rotschild be proud? pfff... dust.",
			"added": 1600327721
		},
		{
			"topic_id": 4,
			"title": "le cout réel de l'immigration massive en france? combien ca me coute?",
			"body": "Bon j'aimerai avoir des statistiques ethniques sur qui coutent le plus... j'aimerais savoir combien de mes impots vont financer des pondeuses africaines et autres pour qu'elles puissent produire des enfants en france? \n\nj'aimerais savoir combien ses enfants de ces pondeuses coutent, leur cycle de vie complet, educations, medicale, les crimes qu'ils generent, etc etc...\n\net ensuite le pire, c'est qu'ils en veulent tjrs plus... \n\nen tout cas je comprends pourquoi et soutient l ensemble des peuples colonisés par la france qui ont voulu se liberer du joug des francais sur leur territoires et leurs economies et cultures, un peu comme liberer la france des nazis, sauf qu'aujourd hui c'est cette bande d enculés, qui pour avoir des esclaves pas cher a employer dans des conditions indécentes et pour detruire la plus ou moins homogeneité de la france afin de créer leur utopia globale, ou ils controleront tout, pour asservir l'entier de l'humanite afin de construire pour chacun des iles du viol d'enfants comme esptein et financer leurs mega yachts pendant que leur petits esclaves mangeront du soil green...\n\nheureusement, Mao et ces potes ont dit non, et des ruines du feodalism chinois construisent calmement la première puissance mondiale, n' en déplaise a polanski et a sa bande :). on les butera s'ils s'opposent ou menacent l essor chinois :D.\n\nsur le sujet ca doit etre tellement violent... genre 20% 30% on plaint en tout cas la derniere fillette blanche (ou francaise) d'une classe d'ecole... bonne chance pour la suite, et surtout quand ces parents realiseront, bouhou on savait pas... blah blah bande de fuckers, vous auriez pus mais enlever vos oeilleres vous faisait mal tellement habitué a les portées.\n\nc'est ca la vraie fracture sociale, pas le masque artificielle des \"marxistes\"... demandez a Deng Xiaoing a propos de l'economie de marché... REGULE ! et ca c'est le key word... sinon y a des vendeurs d'enfants escalves sur ton marché, ou ceux qui font... XXX... simple si t as plus que 2 neurones :).",
			"added": 1600332684
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_17t6ryDjaBqen9EhuAHDhMuAJAmzn95zj1": [
			{
				"comment_id": 1,
				"body": "voleur ! un jour peut-être que le fruit du travail de ta fille sera pillé... comment payera-t'elle ses factures? en faisant la manche ou en se prostitutant? bravo, belle éducation.\n\nps si t as pas l'argent t'as qu'a faire des économies, te le faire preter par qqn qui l'a acheté ou simplement y renoncer... petite merde.",
				"added": 1600323816
			}
		],
		"2_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": [
			{
				"comment_id": 2,
				"body": "a la bande d'enculés, prêt à voler le travail des autres... bravo.",
				"added": 1600323842
			}
		],
		"4_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 3,
				"body": "Qui mettrait son enfant en prison pour l'usage ou la consommation de stupéfiant? qui peut etre un fils de pute pareil pour croire que la solution à l'addiction de son enfant est la prison? qui peut etre aussi hyprocrite et menteur pour dire qu'il ne fera pas tout ce qui est en son pouvoir pour éviter que son enfant aille en prison pour de la drogue (psychoactif illegal)? qui osera dire ca? \n\npersonne mais les menteurs.\n\net ca c'est le point fondamental...\n\nquand t'es puissant, tu peux carrement buter un président de la france pour liberer ton enfant, quand t es une petite merde en bas de l echelle et bien ton enfant il va a taule, pour n'avoir (et c'est encore debatable) fait du mal qu'a lui meme. C'est a dire qu'il n y a pas de victime.\n\nPersonne, a part les esclaves sexuelles, n'est forcé a prendre de stupéfiant ou médicament legaux ou illegaux. et qui peut savoir ce que le future apportera a ce petit bebe... Il suffit de prendre le petit fils de T Boone Pickens (RIP), mort d'une overdose. \n\nEt c'est le deuxième point, en rendant le marché illegal. Il n'y a plus aucun controle dans la puissance des produits, ni de leur intégrité... le gars il veut de la coke pour booster après une nuit arrosé, il se retrouve avec un mix de fentanyl et crystalmeth et finit mort... le con veut son hero, il recoit dieu sait quoi. \n\nAvec un marché réglementer (my body, my choice), le CONsommateur est garanti par la loi d'avoir un systeme de production repondant au norme sanitaire, pour que son produit soit conforme a ses attentes... (his will, his trade)\n\nTroisiemement, la reglementation permet une chute drastique des prix, ce n'est que de la salade (comme la vigne ou l'arbre a coca) ou des produits chimiques industriells... donc plus de crimes pour les consommateurs excessifs... ils depensent rien pour leur merdres, car ca veut rien. donc moins de crimes banaux.\n\nquatriemement il permet de tarir les sources de financement occultes des partis politiques, permet d'assainir les services de police, quand t'es payé moins de 2000E mois, et que le spice trade arrive, les billets c'est au metre cube !! et donc t es la avec ton salaire de pd, avec des juges qui relachent les violeurs, et la on te propose de pouvoir buter des juges comme tu bouffes des croissants, et du cash ou quelque soit les moyens de paiment que tu prefere pour laisser le flow couler... bien sur tu devras eliminer la concurrence, mais c'est bon pour ton taff officiel... le probleme c'est qu'il y a du glissement... \n\nc'est que le marché est tenu par de tres serieux operateurs. Et donc les nouveaux et autres challengers n'auront pas de pur play : simplement l epice et le systeme autour, mais donc pas de viols, pas d'esclaves sexuels, pas de kidnapping, pas de side gig... pur play power player.\n\nEn regularisant il est clair que les pure spice traders doivent pouvoir legaliser leur operations commerciales... c'est pas facile, car l'ensemble de la logistique securitaire (pas de police, t es le sherif) et toutes les operations de corruptions (laisser le flow) et de blanchiment (des m3... c'est pas l'argent, ou plutot l'argent c'est pour acheter des hypos :)). \n\ndonc cela permet un assainissment du systeme policier... pour le bien de tous... c'est relou d'avoir des montagnes d'argent de pouvoir sauver le systeme financier en 2008 sans pouvoir aller flamber une nuit a vegas :).\n\ncinquiement, le retour du black cash... oui oui, la plupart est reintegrer, mais jamais assez :) c'est juste une activité economique,\n\nfaut bien comprendre, ou on est libre de disposer de sa vie une fois la fin de l autorité parentale, ou alors on est un esclave. c'est pas ton role de dire si une substance est permise ou non. le gars veut XXX, il sait ce qu'est XXX, il est majeur, il paye, le gars lui vend ce qu'il veut, c'est ce qu'il veut : LEGAL.\n\nsixiement, restoré la confiance entre les autorités et la population. tu veux l omerta, tu gardes illegales des plantes et des pyschotrope.\n\nseptiemement : petit rappel, en regularisant, et par l'effondrement du prix subsequent tu peux enfin faire de la prévention, car tu enleve l' interdis, tu veux sniffer de la cole? tu veux de la merde, tien... prend... il y a plus de phantasme, plus de lyrisme, plus rien, mais la brutal realité des effets de ces produits... \n\net c'est donc par l'éducation rationel, une regularisation juste (100% coke, ou pas de antrazapine ou je sais quoi dans ton hero etc) que t arrive a normalisé ce marché de niche.\n\nsoit tu veux aller vers le futur, en restaurant la paix et la justice, soit tu veux ton enfer neofeodaliste... bonne chance sur ton yacht face aux pirates...\n\nps de toute maniere les low iq peuvent pas comprendre.",
				"added": 1600325924
			}
		]
	},
	"comment_vote": {}
}