{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_16iGKuwiVs9no6N8gTnn8y12TGMzvxDxEL": 1,
		"1_1DM1Nn2JXHmDfr7zHtszmjJwQeX4j4QoYv": 1,
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": 1,
		"1_1GuuFYgC7KRWLzw9Q4wEJsiLyJMimFcxAN": 1,
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"1_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": 1,
		"2_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": 1
	},
	"next_comment_id": 15,
	"comment": {
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 1,
				"body": "> [if0](#comment_216_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Заставили исполнять трудовой кодекс РФ... Может стоило подать в суд или просто натравить надзорные органы? При чем здесь забастовка?\n> \n\nЭто не работает по двум причина\n\n1. Закон даёт минимальные гарантии работнику. Например нельзя платить меньше МРОТ, но вот сколько конкретно платить, будет ли ДМС или нет - всё зависит от того что удастся выбить у работодателя.\n\n2. В суде работодатель всегда имеет преимущество - документы у него в руках, найти свидетелй ему намного проще потому что работники в его власти.\n\nВ случае со стройкой остаётся непонятным как суд может заставить работодателя соблюдать технику безопасности.  Как только инспектора или приставы уйдут - всё вернётся на исходную\n\n> Убедительная победа над угнетателями.",
				"added": 1567508868
			},
			{
				"comment_id": 2,
				"body": "> [fant](#comment_44_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Да вы оба \"хороши\"...\n\nЕсли человек поддерживает фашизм значит он поддерживает и полицейское насилие.\n\nОдно без другого никак не бывает",
				"added": 1567508907
			},
			{
				"comment_id": 3,
				"body": "> [if0](#comment_219_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Одно не следует из другого. Полицейское насилие - один из эффективных способов сохранения власти, любой власти.\n\nЯ писал про ПОДДЕРЖКУ полицейского насилия а не про сам факт наличия такого явления.\n\n\nПоясняю:\n\nТот факт что в США существует полицеское насилие ещё не доказывает что США фашисткое государство\n\nЗато поддержка полицейского насилия в США гражданином США говорит о том что этот гражданин с большой вероятностью или фашист или в лучшем случае придерживается правых взглядов",
				"added": 1567590405
			},
			{
				"comment_id": 4,
				"body": "Взято из RetroShare\n\nretroshare://forum?name=%D0%97%D0%B0%D1%89%D0%B8%D1%82%D0%B0%20%D0%BF%D1%80%D0%B0%D0%B2%20%D0%BD%D0%B0%D1%91%D0%BC%D0%BD%D1%8B%D1%85%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%BD%D0%B8%D0%BA%D0%BE%D0%B2&id=621aecd142fefdff484762178f55d396\n\n\n\nСайты рабочего движения России\n\nКонфедерация труда России http://www.ktr.su\nПроект \"Молния\" https://molnia.org/\nПроект \"Вестник Бури\" http://vestnikburi.com/\nПрофсоюз Учитель https://pedagog-prof.org/\nПрофсоюз медиков Действий http://medrabotnik.org/\nПрофсоюз Новопроф http://novoprof.net/\nПрофсоюз МПРА http://mpra-union.org/\nПрофсоюз авиодиспетчеров https://fpadrus.ru/\nПрофсоюз моряков http://www.sur.ru/ru/\nПрофсоюз докеров http://www.rpdspb.ru/\nПрофсоюз Университетская Солидарность http://unisolidarity.ru/\nПрофсоюз работников кино http://profkino.ru/\nШереметьевский профсоюз лётного состава http://www.shpls.org/\nПрофсоюз лоцманов http://pilotsunion.ucoz.ru/\nПрофсоюз метро http://profrazin.com/\n\nПрофсоюз ученик https://m.vk.com/uchenik_org\nСтуденческий профсоюз «Community» https://vk.com/stud_fight\nПрофсоюз «Студент» https://vk.com/student_pr",
				"added": 1567590460
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_220_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я к тому, что у понятия \"фашизм\" слишком широкая трактовка и им слишком легко разбрасываются.\n\n14 признаков фашизма по Лоуренсу Бритту\n\n\n1) Мощный и продолжительный национализм — фашистские режимы постоянно используют националистические лозунги, девизы, символы, песни и так далее. Знамена можно увидеть везде, как и символы флага на одежде и в общественных местах.\n\n2) Пренебрежение к общепризнанным правам человека — из страха перед врагом и под предлогом обеспечения безопасности фашистские власти убеждают, что права человека могут игнорироваться в определенных случаях ради «необходимости». Людей заставляют «думать по-другому» или даже одобрять избиения, убийства, продолжительное лишение свободы задержанных и т.д.\n\n3) Выявление врага / искупительные жертвы как объединительная основа — народы при фашистских режимах сплачиваются в патриотичном движении в борьбе против общей опасности или противника: расовых, религиозных или национальных меньшинств, либералов, коммунистов, социалистов, террористов и т. д.\n\n4) Преимущественное положение вооруженных сил — даже если в стране есть много острых внутренних проблем, вооруженные силы получают непропорционально большое бюджетное финансирование, а внутренние проблемы остаются нерешенными. Пропаганда навязывает привлекательный образ военных и военной службы.\n\n5) Сильная дискриминация по признаку половой принадлежности — в фашистских правительствах доминируют мужчины. Традиционные гендерные роли жёстко закреплены. Отрицательное отношение к абортам и гомофобия.\n\n6) Контроль над СМИ — они контролируются непосредственно правительством или косвенно через сочувствующих журналистов либо руководителей СМИ. Распространена цензура — особенно в военное время.\n\n7) Маниакальное увлечение национальной безопасностью — страх используется как мотивационный инструмент правительства для давления на массы.\n\n8) Переплетение религии и правительства — правительства фашистских стран используют религию как инструмент управления общественным мнением. Религиозная риторика и терминология используются правительственными лидерами, даже когда главные принципы религии диаметрально противоположны действиям или политике правительства.\n\n9) Защита корпораций — промышленная и деловая аристократия в фашистских государствах часто является единственной силой, ставящей лидеров во власть, создавая взаимовыгодные деловые отношения с властной элитой.\n\n10)Притеснение профсоюзов — поскольку профсоюзы представляют единственную реальную угрозу для фашистских правительств, они либо полностью отсутствуют, либо серьезно ущемлены в возможностях [в российской ситуации вопрос выглядит странным)))].\n\n11) Презрение к интеллигенции и искусству — фашистские государства поощряют или терпимо относятся к проявлениям открытой враждебности к высшему образованию и к учёным. Зачастую они подвергаются преследованиям или даже арестам. Свобода самовыражения в искусстве подвергается открытым нападкам, и правительство часто отказывается финансировать искусство.\n\n12) Навязчивая идея преступления и наказания — при фашистских режимах полиции даются почти неограниченные полномочия. Люди во имя патриотизма во многих случаях предпочитают не замечать полицейских злоупотреблений, даже нарушение своих гражданских свобод. Часто создается национальная полиция с неограниченной властью.\n\n13) Необузданное кумовство и коррупция — фашистскими режимами почти всегда управляют кланы приятелей и партнеров, которые назначают друг друга на правительственные должности и используют власть для защиты членов своего клана от ответственности. Зачастую правительственные лидеры присваивают или даже напрямую разворовывают государственные ресурсы и казну.\n\n14) Мошеннические выборы — выборы в фашистских государствах часто превращаются в фарс. Нередко проводится клеветническая кампания (или даже убийства) кандидатов от оппозиции, законодательство используется для манипулирования численностью избирателей, границами округов, средствами массовой информации. Фашистские режимы часто используют судебную систему для манипулирования выборами.",
				"added": 1567671781
			},
			{
				"comment_id": 6,
				"body": "> [if0](#comment_220_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Я к тому, что у понятия \"фашизм\" слишком широкая трактовка и им слишком легко разбрасываются.\n\nСубъект прямо поддерживает как минимум пункты 10 и 12\n\nЗЫ\nВо избежание - я не поддерживаю ни текущий режим в России ни на Украине",
				"added": 1567671949
			},
			{
				"comment_id": 9,
				"body": "> [if0](#comment_222_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Многие из пунктов частично выполняются в считающихся демократическими странах. Флаги и национальную символику очень часто пихают куда не поподя, права человека постоянно нарушают - слежками за действиями и контролем за высказываниями в Интернете. Откровенно навязывается синтетическая терпимость и раздувается чувство вины перед \"обиженными меньшинствами\", проводится открытая обратная дискриминация, травля \"сексуальными скандалами\" и квотирование по половому признаку, слишком терпимо воспринимается лоббизм монополий.\n\nНу так буржуазные демократии не могут быть устойчивыми.\n\nЭто во второй половине 20-го века западные элиты делали уступки народам, потому что опасались что в случае народного восстания СССР придёт на помощь восставшему народу  и уних случится революция\n\nСейчас такой опасности западным элитам не грозит, наоборот обостряется борьба за рынки сбыта, конкуренция между развитыми странами.\n\nПоэтому и демократию и социальные блага везде сворачивают. \nИ будут сворачивать дальше и сильнее, так что любимая тема российских пропагандистов про \"мигрантов и геев и полит корректность\" - будет сущей мелочью, перед той суровой реальностью которая установится лет через десять-двадцать на Западе.\n\nЗЫ\nМне действительно очень смешно слушать бредни о том как плоха полит корректность или права меньшинств, потому что то что придёт ей на смену - классический империализм, для России будет просто адом.\n\nСейчас можно смеяться над Европой - мол какие дураки там.  С наступлением настоящего империализма России придётся защищаться от самой настоящей военной угрозы (и не только из Европы) ",
				"added": 1567765994
			},
			{
				"comment_id": 13,
				"body": "Новости от профсоюза медиков\n\nПрофсоюз Действие работников здравоохранения. Очень быстрый рост, свидетельствующий о серьёзных проблемах и социальных изменениях в отрасли. С начала года было объявлено шесть итальянских забастовок на скорой помощи, но, как правило, сама угроза подталкивает местное начальство к шагам навстречу. В Тольятти, например, подписано соглашение об увеличении надбавки за ночные смены с 60% до 100%. В Пензе, где численность профсоюза выросла с 15 до 950 человек за короткие полгода, достигнут протокол о повышении ставки до 100% от средней зарплаты по региону (сейчас 70%). Профсоюз охватил уже более 50 регионов и через две недели состоится общероссийский съезд (ранее профсоюз был межрегиональным).",
				"added": 1567779971
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 7,
				"body": "> [teen2019](#comment_1_1BSQUgGx4ncaBdVS6LBN3ep7i3BvUNctR6): Как раз дело в том что в принципе Украине никакого дела до РФки нет, ну вот так сталось что РФке до Украины есть. Потому нам принципиально важно чтоб РАШКА отвязалась от нас, государства Украина. И что хотите то и делайте. ТОЛЬКО У СЕБЯ.\n\nВы великолепны.  \n\nЕсть только две беды в ваших мечтаниях - нет способа сделать так чтобы России не было дело до Украины.  Хотя бы как рынок сбыта или транзитный коридор она нужна.\n\nГеографию не победить.\n\nПроблема Украины не в России а в отсутствии рынков сбыта высокотехнологичной продукции.\n\nЧто особо забавно в обратную сторону всё так же верно\n\nПроблема России также не в  Украине а в отсутствии рынков сбыта промышленной продукции.\n\nУкраине в гипотетическом случае возрождения промышленности и возвращение на путь прогресса будет большое дело до России как до рынка сбыта своей продукции.\n\nНу и совсем смешное - ни Украина ни Россия в текущем мировом устройстве не могут быть ничем кроме как периферией.\n\nДля teen2019 это обозначает что жить ему предстоит в бантустане на 38 млн рядом с соседним бантустаном на 145 млн или уезжать в Европу\n\nДобро пожаловать в реальный мир!",
				"added": 1567700033
			},
			{
				"comment_id": 8,
				"body": "> [teen2019](#comment_1_1BSQUgGx4ncaBdVS6LBN3ep7i3BvUNctR6): Как раз дело в том что в принципе Украине никакого дела до РФки нет, ну вот так сталось что РФке до Украины есть. Потому нам принципиально важно чтоб РАШКА отвязалась от нас, государства Украина. И что хотите то и делайте. ТОЛЬКО У СЕБЯ.\n\nЗапомните - между ватниками и майдаунами разницы нет\n\nИ те и другие просто глупы.\n\nСвоих мыслей нет ни у вас ни у ватников.  Разница между вами только в замене слов Украина на Россия, и ещё нескольких.",
				"added": 1567700197
			},
			{
				"comment_id": 10,
				"body": "> [fant](#comment_46_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Диванная онолитека подъехала )\n\nконтраргументов так понимаю нет а обида осталась\n\nЕсли после прочтения моего предыдущего поста о том что и ватники и майдауны просто два рода придурков, вы чувствуете обиду - значит вы или ватник или майдаун\n\nМинздрав советует заняться самообразованием. Начните систематически изучать любую естественную науку. Освоив её хотя бы  в объёме первого курса нормального университета вы овладеете основами методологии научных исследований.\n\nУдачи в этом нелёгком труде. Это тяжело, но лучше чем оставаться самодовольным мудаком.",
				"added": 1567766416
			},
			{
				"comment_id": 11,
				"body": "А вот вам небольшая интуиция о будущем России. Весьма унылом надо сказать. Что впрочем ожидаемо.\n\nhttps://primamedia.ru/news/851413/\n\nНа три десятка меньше профессий и специальностей будет в России. Минпросвещения объявило о прекращении подготовки по ряду направлений и специальностей среднего профессионального образования с 2021 года. На очереди еще 70 профессий, которые \"канут в лету\".\n\nВ перечень Минпросвещения попали девять профессий и 23 специальности. Это такие, как автомеханик, мастер отделочных строительных работ, слесарь, фрезеровщик-универсал, токарь-универсал, станочник, оптик-механик, лаборант-аналитик. Кроме того, в колледжах перестанут учить \"монтажу и технической эксплуатации промышленного оборудования\".\n\nВ министерстве отмечают, что специальности, которые попадают под \"сокращение\", — устарели и не соответствуют запросам современного рынка труда. Но это не значит, что молодежь перестанут готовить по конкретным профессиям.\n\nВ Минпросвещения отмечают, что это первый этап обновления профессий и программ подготовки. Планируется ликвидировать в общей сложности около 100 устаревших профессий.\n\nИли другая ссылка\n\nhttps://lenta.ru/news/2019/09/05/noslesar/",
				"added": 1567774904
			},
			{
				"comment_id": 12,
				"body": "И ещё одна интуиция - https://vz.ru/news/2019/9/6/996395.html\n\nВ правительстве опровергли сообщения о новом повышении пенсионного возраста\n\nПотом будет опровержение, опровержения",
				"added": 1567775643
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 14,
				"body": "Целенаправленно искал информацию о даркнет",
				"added": 1568378777
			}
		]
	},
	"comment_vote": {}
}