{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "Это будет тестовый комментарий.",
			"post_id": 2,
			"date_added": 1492718841
		},
		{
			"comment_id": 2,
			"body": "> [balancer73](#comment_1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Кстати, я тоже ZeroNet впервые щупал около года назад, в феврале 2016. Тогда показалось интересным, но сырым и кривым. Полгода спустя, в октябре, сделал второй заход — и сеть было не узнать :) Так с тех пор сразу тут и завис.\n\nА я когда хайп с хабра был. Хотя и слышал до этого, но казалось кривым и даже не хотел пытаться пользовать.",
			"post_id": 3,
			"date_added": 1492946802
		},
		{
			"comment_id": 3,
			"body": "...пока кто-то не сольет тебе всю репутацию.\nДа ну нафиг такие системы :)",
			"post_id": 7,
			"date_added": 1495148163
		},
		{
			"comment_id": 4,
			"body": "> [murka](#comment_1_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): С @alexanova там ситуация вообще показательна, на тот момент казалось что вот, случилось. Блокчейн перестал быть уделом маргиналов. [cut]\n\nППКС, пожалуй. Да и не будет порноактриса заморачиваться с зеронетом, это уж точно. Опять же, по причине \"немного\" неюзерфрендлиности (для новичков и не гиков) и невозможности монетизации, а она там прямо в первом посте про монетизацию и написала.\n",
			"post_id": 7,
			"date_added": 1495156591
		},
		{
			"comment_id": 5,
			"body": "> [murka](#comment_2_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Я рассматриваю проблему несколько шире. Да, можно закрывать глаза на флаги, если не гонишься за монетизацией, да и сокрытие постов можно обойти альтернативным интерфейсом или stand-alone блогом. Но даже только с сокрытием для большинства уже рушится целостность пространства. Но, Steemit активно пользуется методом демократического внедрения изменений. Если завтра большинство вдруг решит: \"А что это скрытые посты лежат мертвым грузом в блокчейне. Сообщество их отвергло. Почему бы их не удалить\". Не значит что так будет, но такой вариант развития событий вполне возможен.\n\nПривет, хардфорк?)",
			"post_id": 7,
			"date_added": 1495156619
		},
		{
			"comment_id": 6,
			"body": "> [murka](#comment_3_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Не нужно говорить о прочих, потому-что нет этих прочих. Голос просто копирует стимит во многом. Да, модель модерации там неудачна, но это не какое-то следствие технической реализации. Вероятно основатели хотели оставить себе достаточно прав в системе, чтобы скрывать контент, который мог бы повредить их бизнесу, а заодно аналогичные права пришлось раздать всем крупным инвесторам. Но это проблема конкретных площадок.\n\nГолос сделан на steemit вроде, разве нет?",
			"post_id": 7,
			"date_added": 1495156675
		},
		{
			"comment_id": 7,
			"body": "> [varakin](#comment_1_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): есть на голосе такой кислотный чувак @ili0braz, ему репутацию зафлагали, теперь его сообщения скрыты. Так вот флагает абсолютно все его посты некая @anela, вот прям как на работу ходит. Короче, интересно наблюдать)) Ещё в телеграме обсуждают то же самое, что ты здесь написал, так что там тоже много людей, которых вся эта ситуация бесит.\n\nО, прикольно. Ну жопа же! Хотели свободную от цензуры систему с монетизацией, получили черт знает что.",
			"post_id": 7,
			"date_added": 1495198274
		},
		{
			"comment_id": 8,
			"body": "Но тут надо отдельно категоризировать фильтрацию, типа \"Блоги\", \"ZeroMe\" и т.д. В идеале - с возможностью создавать свои категории, типа \"zeronet.ru\", который показывает последние посты с zeronet.ru, и т.д.",
			"post_id": 11,
			"date_added": 1522577047
		},
		{
			"comment_id": 9,
			"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Там есть что-то, чего нету в nftables?\n\nТам хороший и понятный синтаксис как минимум и возможность протестировать как будет работать pf с конфигом, не применяя его. Это как минимум и, ЕМНИП, nftables такого не умеет. И вообще у PF много плюшек, тут надо именно попробовать :) Хотя не скрою, что до этого пользовал только iptables из зоопарка *tables.\n\n> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Если нужно собирать метрики то могу предложить попробовать prometheus.\n\nВот только этого говна не надо. Да, настраивается легко. Да, может в графики. Но не может в нормальные алерты и управление из веб-морды (alertmanager ужасен) и еще там очень все трудно с композитными графиками.",
			"post_id": 12,
			"date_added": 1537993531
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}