{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1528893667,
			"title": "German socialist party wants to publicly fund feminist porn",
			"body": "Berlin's SPD wants to fund porn to fight sexism.\nBerlin's SPD has come up with a scheme to publicly fund feminist porn and distribute it for free via public broadcasters.\nhttp://www.dw.com/en/berlins-spd-wants-to-fund-porn-to-fight-sexism/a-44184929\n\nClearly our leftist anywhere-in-between-brothers-and-sisters are onto something. Let's help them fight sexism by making suggestions!\n\nFor a start:\n\n- I am going to slowly enter your gender pay gap...\n- Aaah, your patriarchy is so oppressive!\n\nor:\n\n- Hey babe, can you please prolong your consent to fuck for the next 10 minutes?\n- First you need to get rid of the oppressive stereotype that fucking is the same thing as having sex. Since fucking is a social act with all its associated stereotypes, your cis-male assumption that fucking and having sex are interchangeable only serves the patriarchal white blah blah blah...",
			"added": 1528893666
		},
		{
			"topic_id": 1530777929,
			"title": "Polizei raids homes of Zwiebelfreunde (Tor runners) and a hackerspace",
			"body": "https://www.ccc.de/en/updates/2018/hausdurchsuchungen-bei-vereinsvorstanden-der-zwiebelfreunde-und-im-openlab-augsburg\n\nSomebody did something illegal using a non-commercial high-privacy mail service, and the Zwiebelfreunde (literally: Onion Friends) had a donation button on their website for that mail service,\nso the Polizei raids homes of the Zwiebelfreunde, takes away all the electronics.\n\nBut it doesn't end there:\n\n\"While searching the premises of the board members in Augsburg, Jena, Dresden, and Berlin, the police  on their own accord decided to extend the search to premises also used by members of the CCC: the OpenLab in Augsburg. Here the officers were confronted with hackers in their natural habitat: substances to clean and etch circuit boards as well as hair bleach. After interpreting the contents of a whiteboard as a bomb making manual, the officers then went on to accuse random people present at the hackerspace of plotting a bombing attack. Three people were arrested on the spot and the hackerspace was subsequently searched without a court order and without any witnesses.\"",
			"added": 1530777927
		}
	],
	"topic_vote": {},
	"next_comment_id": 52,
	"comment": {
		"1528523924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "> decentralized\n> zite owner\nThat's the first problem. \"Decentralized\" means can't be shut down by criminals (for example, the government). But the zite owner can be easily found and targeted because he's sending out physical mail to anybody who asks.\n\n> There will be prohibited items\n*cough*\n\n> Enter.. Game Theory:\nYup, game theory. Let's say that some shit worth 200$ on a regular market (say Syscoin) is sold for 205$ on your market. The seller pays 5$ of tax from his profit margins because they're that woke and ethical but 5$ of taxes is shifted onto the buyer. \n\nWhy would the buyer bother with all this tax-loving setup and buy for 205$ instead of buying for 200$ and transferring 5$ to charity if they so desire?\n\nWhy would the seller bother with all this tax-loving setup instead of selling for 200$ and transferring 5$ to charity if they so desire?",
				"added": 1528530005
			},
			{
				"comment_id": 3,
				"body": "> But then, if they could arrest me.. then they might as well arrest anyone who uses ZeroNet.\nUsing ZeroNet or Tor isn't illegal (in most places). Trading without paying taxes to the government *is* illegal though. So there's a clear case against the zite owner *and* he has a list of everybody else's home addresses. What could possibly go wrong?\n\n> Solution: Don't vote for asshole Governments.\nSo your idea is meant to be implemented *after* we have either anarchy or a government that doesn't want to arrest people for not paying taxes to it?\n\n> but what if taxation was voluntary?\nhttps://www.bloomberg.com/news/articles/2017-07-06/-voluntary-tax-plan-as-expected-fails-miserably-in-norway",
				"added": 1528534288
			},
			{
				"comment_id": 4,
				"body": "The trust problem is well known to these guys:\nhttps://bitcointalk.org/index.php?board=5.0\nand it seems that escrows (private trust / arbitrage) almost solve it.\n\nAs for decentralization, I hope something like http://www.syscoin.org will do it, but I don't like the idea of waving your home address in front of unknown people. Perhaps first there should be a service/freelance market.",
				"added": 1528547319
			},
			{
				"comment_id": 5,
				"body": "OK, let's suppose that you've successfully averted 5% of all the GWP (https://en.wikipedia.org/wiki/Gross_world_product) to every human equally, which would be about 0.05 * US$78.28 trillion / 8 billion / year ~ 41$ / month. That's actually pretty decent for Africa. For me it would almost pay the electricity bill. Is that what you want?\n\n> Either give us a UBI, or we will continue\nNah, I'd just continue :)",
				"added": 1528549135
			}
		],
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 2,
				"body": "I could think of a few attack vectors:\n\n1. A Chinese user shuts down Tor to visit WeLoveParty.cn in order to write a mandatory daily letter expressing undying love for the party. That site gives him a hidden frame with a link to 127.0.0.1:43110 and a script to determine if the link renders as blue or purple (meaning the link was visited). If it's purple, a party van is immediately dispatched.\n\n2. A Chinese user sees a link to a Tienanmen video on a zite and clicks on it. The browser adds an HTTP_REFERER field to the GET request in order to tell Youtube where the user is coming from, and of course it starts with 127.0.0.1:43110. Additionally, Google gets an authentication cookie because the user didn't log out. Then Google helpfully tells the government that the user ...@gmail.com is coming from ZeroNet. A party van is promptly dispatched.\n\n3. The government publishes a HowToOverthrowXi blog on ZeroNet with an image loaded from a non-ZeroNet server. Later when the users shut down Tor in order to pay a mandatory daily visit to AbsolutelyTruthfulNews.cn, they're given the same image to load. Those who do not load it because they have already cached it are ZeroNet users. Multiple party vans are dispatched.",
				"added": 1528531741
			}
		],
		"1528601621_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "> The alt-right ironically love the idea of cut-throat capitalism (each man for himself)\nI've just gained some appreciation for the alt-right in US. \n\nUnfortunately in Europe it's not like that. Both left and right wing are socialists, with right-wing often more so.\nhttps://www.economist.com/europe/2018/01/25/in-europe-right-wing-parties-are-offering-bigger-handouts-than-traditional-ones\n\nJP at least deserves credit for pulling alt-right away from crazy.",
				"added": 1528612237
			}
		],
		"1528582989_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "I guess the parcel needs to be dropped down from an unreachable height :)",
				"added": 1528749230
			}
		],
		"1528776246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 8,
				"body": "so... are people already willingly throwing money at you?",
				"added": 1528794907
			},
			{
				"comment_id": 9,
				"body": "And who's going to pay for the leftist wet dreams, eh?\n\nAs it goes now, the health insurance trust fund will be depleted in 2026:\nhttps://www.ssa.gov/OACT/TRSUM/index.html\n\nGuess when the HI trust fund will be depleted if the \"quality affordable comprehensive\" etc. is implemented.",
				"added": 1528838905
			},
			{
				"comment_id": 10,
				"body": "> [scrubthesecond](#comment_91_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): Know of those rich individuals and corporations, who pay no tax yet demand welfare? Those absolute crooks will pay for it.\nYou mean rich commies like Soros? Sure they are crooks since they demand unsustainable policies like welfare. But they will most definitely not pay for it. For example, they can just move to Puerto Rico and pay almost no tax.\n\n> [scrubthesecond](#comment_91_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): corporate profits have never been higher and it's unacceptable!\nGood news, buy stocks then! Except don't because in reality corporate profits are so low that we're very likely in a bubble. \n\n> [scrubthesecond](#comment_91_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe):  Here in Australia, our economy isn't anywhere near as strong as the USA's\nAustralian net government debt is 19% but for US it's 82% - not quite an Italy yet but almost a Spain. That means that Australian govenment - not to be confused with Australian economy - is actually doing pretty well.\n\n> [scrubthesecond](#comment_91_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): yet we have Mediacare for everyone, free of upfront costs. It's paid for under our progressive tax system.\nIt's paid by putting a stranglehold on your economy thus potentially throwing future generations under the bus. In US, the current generation has been thrown under the bus by past generations. It's fun to shout \"eat the rich\" before you realize that it's your children and grandchildren that you're eating. Unfortunately, you can't just say \"let's do an Australia\" and make the US debt magically disappear.",
				"added": 1528877680
			},
			{
				"comment_id": 11,
				"body": "> [scrubthesecond](#comment_92_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): We've had free healthcare for generations, with little to no debt.\nThe stranglehold on your economy is not necessarily manifesting as debt, and Australia is still in the early stages.\n\nAustralia's tax revenue is 34% GDP and health care spending is 10% GDP\nUS tax revenue is 26% GDP but health care spending is 17% GDP.\nOf course US accumulates a lot more debt this way than Australia does!\n\nBut my point is that the US problem can't be fixed by more government spending. In fact, spending is the very cause. Dogs can get quality affordable healthcare in US and people cannot precisely because dog health isn't subsidized by the govt. \n\nPrices are set by equilibrium of market forces. Govt subsidizes healthcare, its price goes up since the patients can pay more. But then both the education price the licensing price go up because doctors can pay more. But then the patients can't pay for all that anymore and they complain to the govt. The govt gives in and increases the subsidies and the whole loop completes. That's why American pets have better healthcare than American people.\n\nNow I'm not saying that Australia will necessarily go down that badly - after all, US is quite uniquely mismanaged. But Australian healthcare spending has slowly crept up from 6% in the 80s to 10% GDP and this system has a nasty positive feedback loop so watch out.",
				"added": 1528969741
			}
		],
		"1529033869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "> [wildrunning](#comment_9_16jxbpwWm7DbyFCRhQ4FNirjuLsenv26Lk): Tech has enabled the rich to exploit the poor in third works countries at a huge loss to the local population.\n\nSo you like it when money flows from rich people to poor people but you don't like it when money flows from rich countries to poor countries? Come on, admit that you're a nationalist.\nTech has enabled the productive enterprises to allocate money in the most efficient way, lifting China out of poverty into which commie bullshit has thrown it.\n\n> who can afford them? My guess is at best just a few.\nIf one company desides to artificially keep the prices high to \"oppress\" somebody, other companies will undercut it. That's why the price will always be fair. Commies on the other hand encourage government to come rob (\"tax\") people at gunpoint. Now *that*'s how oppression looks to me.",
				"added": 1529042378
			},
			{
				"comment_id": 15,
				"body": "> [lucifersneighbor](#comment_14_16GUvkoVwUVDDUsbPWkkSxpq2ikmK9bd6E)\n\nDisagreed. There's a very real choice that people might make today: whether to sign up or not for either brain or whole body cryogenic preservation (Alcor's, for example). Whether or not you find it a good idea, putting your recently deceased brain in a freezer is quite different from cheerleading.",
				"added": 1529270829
			}
		],
		"1529135288_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": [
			{
				"comment_id": 13,
				"body": "No.\nZeronet itself doesn't use blockchains, which is great because we don't have do download 200GB. Using the same crypto means that the mapping between your public and private keys is the same, so you could use your public site key as your wallet address and spend bitcoins with your private site key.\nOne could in principle set up a server, just as ZeroNames provides an API to query the Namecoin blockchain. But why would anybody do that?",
				"added": 1529140155
			}
		],
		"1529242468_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": [
			{
				"comment_id": 14,
				"body": "> [jetten](#comment_27_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e): I consider the possibility that one of them will be a copyright troll that monitors illegal file sharing so small\n\nThat's basically the same as using an unpopular torrent tracker. I don't know what kind of encryption the Torrent protocol provides but remember that there's a big copyright troll looking over your shoulder at all times:\nhttps://en.wikipedia.org/wiki/Deep_packet_inspection#At_network/Internet_service_providers",
				"added": 1529253761
			}
		],
		"1528893667_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": [
			{
				"comment_id": 16,
				"body": "> [befreier](#comment_1_1FwsMAWJuDNjhQc2bQLBWXWNRYSUuUcQJo): Some country is exporting war and death to the world\n\nOh, SPD has a quite interesting approach to that problem. SPD has promised the voters to stop weapon sales to Saudi Arabia, Qatar and other countries like that. So SPD got a minister (Sigmar Gabriel) in a position to actually do it. But he increases the weapon sales instead:\nhttp://www.businessinsider.com/r-german-arms-export-jump-triggers-accusations-of-policy-failure-2016-7?IR=T\n\nSo they put another SPD politician (Brigitte Zypries) on the job. The result:\nhttp://www.dw.com/en/germany-quintuples-arms-sales-to-saudi-arabia-and-egypt/a-41370500\n\nThen the activists manage convince the Heckler&Koch to stop selling arms to Saudi Arabia and the such. As it turns out, it is actually *easier to convince a weapon manufacturer to stop selling weapons* than to convince an SPD politicians to go through with their promises.\nhttps://www.independent.co.uk/news/world/europe/heckler-koch-saudi-arabia-german-arms-trade-undemocratic-corrupt-nato-a7444981.html",
				"added": 1529347715
			}
		],
		"1529456113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 17,
				"body": "> If the child prisons were stormed today, \nOK, let's say you've successfully stormed a child prison. Now you have 100 crying kids and one very angry government. What do you do next?",
				"added": 1529501456
			}
		],
		"1529441721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 18,
				"body": "I feel like the situation is completely different with books, music and movies. \n\nPeople on average consume books slowly enough so that paying for the books isn't usually a problem. \n\nCreating music is a joy in itself to most musicians, which is actually an economic problem because it drives them to produce more music than the market wants. By now most people can find at least 90% of music they enjoy on YouTube. Therefore, most music is completely unsellable. This can not be solved by a new model, possibly because it isn't a problem.\n\n> maximizing the social experience.\nIn my days it was called \"a concert\".\n\nNow movies pose a really tough question. I'm not watching new movies anyway because they're shit and I'm pirating old movies because why is the copyright term decided unilaterally by Disney again? The whole industry is criminal and I'm not even sure anything needs to be done about it, it's the government that something should be dealt with.",
				"added": 1529504890
			}
		],
		"1529472127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 19,
				"body": "> our wasteful consumption of resources\nThe amount of matter and energy that humanity throws into space is negligible. The rest stays on Earth, therefore isn't wasteful. As soon as you have nanotech, heaps of trash are as valuable as an ore mine.\n\n> worry about self preservation\nAn AI can just go to the Moon and the asteroids. There's a lot of useful resources, no pesky gravity well and no pesky humans. Problem solved.",
				"added": 1529505778
			},
			{
				"comment_id": 20,
				"body": "also, what's abolitionism in this context?",
				"added": 1529505836
			},
			{
				"comment_id": 21,
				"body": "> [htgozn](#comment_193_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): True, but energy conversion happens only in one direction. [...]\n\nYou mean C + O2 -> CO2 + energy? But there's no reason you can't run that in the other direction if you need C for something like carbon nanotubes.\n\n> but similar realities are possible\n\nHumans are extremely inefficient if used for energy generation. Why anything remotely like Matrix is a concern?\n\n> quite easy to induce reproduction during captivity\n\nOh, getting humans to reproduce was never a problem. Population control, on the other hand...",
				"added": 1529522743
			},
			{
				"comment_id": 22,
				"body": "> [htgozn](#comment_194_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): And what will power such reverse conversions? Free energy? [...]\n\nAbout a third of all electric energy is generated from other sources than burning stuff.\nhttps://en.wikipedia.org/wiki/Electricity_generation#/media/File:Electricity_production_in_the_World.PNG\n(this probably naively counts photovoltaics as clean energy, which they're not, but anyway)\n\n> when it comes time to applying the second law of thermodynamics.\n\nThe Earth isn't a thermodynamically closed system because the Sun is shining upon it. Thus, the enthropy of Earth can go both ways. The second law is inapplicable here.",
				"added": 1529526559
			}
		],
		"1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 23,
				"body": "> [atomiserxenolith](#comment_4_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Is there any way I can be identified as the original creator of that content?\n\nAs was said, there's nothing that can prevent others from republishing. But I guess you could digitally sign the hash of your content with your site's private key and publish the hash and the signature here. Then if somebody copies the content there would be a proof in everyone's zeronet database that you were the first to publish it.",
				"added": 1530011670
			},
			{
				"comment_id": 25,
				"body": "> [atomiserxenolith](#comment_6_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): Isn't the  hash of the content of the two main files (in content.json) already generated from the site's private key in users.json? \n\nThere is a sha512 hash, but it's not generated from the site's private key, only from the file's content.\n\n> [atomiserxenolith](#comment_6_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): The signature is the public key address of the site.\n\nNo, the signature is something that only you can make. But you're right, maybe you don't need it.\n\nIf you want to sign something, import your site's private key into a Bitcoin wallet and sign a message using the wallet.\n\n> [atomiserxenolith](#comment_6_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): if there could perhaps be some kind of 'original content' register linking relevant content hashes with ZeroID?\n\nNow that's what you might need the signature for. You could sign a message saying \"I am ZeroID atomiserxenolith\" with your site's key.",
				"added": 1530083330
			}
		],
		"1530018029_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 24,
				"body": "Imagine you walk in the middle of nowhere when suddenly your phone notifies you that an open wifi is available. You connect to it and see a page saying: \n\n\"This network distributes some tourism info and safety advice through L33tHaxxorNet. In order to access it, you just need to install this little binary on your phone.\"\n\nWould you install it? Come on, you wouldn't.",
				"added": 1530035149
			}
		],
		"1527718057_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 26,
				"body": "How is OS affecting your virtual environment?\n\n> Open source software has miles to go.....\nAnd closed source software never had any problems like DLL hell?",
				"added": 1530083542
			}
		],
		"1530107535_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "Dunno about phones, but this router-based mesh seems to be rather alive than dead:\nhttps://wiki.freifunk.net/Kategorie:English",
				"added": 1530110211
			}
		],
		"1530115001_12Hdq1xCKHHYUJHxBWbvU6Eg1XoSgyHAMN": [
			{
				"comment_id": 28,
				"body": "One of the fastest data transfer methods in terms of bytes * m / s is an airplane loaded with Blu-Ray discs. Now we just need a network of those. (You didn't specify any latency requirements.)\n\n> [ssdifnskdjfnsdjk](#comment_322_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): use extremely high frequencies in the 30 GHz to 300 GHz range\n\nThat basically means we'll talk by pressing a microwave oven to our head.\nalso: https://en.wikipedia.org/wiki/Extremely_high_frequency",
				"added": 1530122777
			}
		],
		"1530730484_1F2A3gz99J8xkzx7sDWQxMnz6yNGWA7pGW": [
			{
				"comment_id": 29,
				"body": "Ti strana gorivo prodaje, li privatne firme? Protiv kog protestuješ?",
				"added": 1530774073
			}
		],
		"1530936401_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 30,
				"body": "Why don't you just go to ZeroHello, type into the \"Filter: Site name\" box, and there comes the link to your site?\nOf course if you haven't sync'd the site yet, it won't come up, but you said you're offline anyway? In other words, if you can sync a new site, why can't you also access ZeroName?",
				"added": 1530942848
			},
			{
				"comment_id": 32,
				"body": "OK, I see.\n\nHere is a simple although somewhat involved way:\n    $ echo '<a href=\"http://localhost:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\">Hello</a>' >foo.html\n    $ python2 -m SimpleHTTPServer\n    Serving HTTP on 0.0.0.0 port 8000 ...\nThen you tell your buddy to visit http://$YOUR_IP:8000.",
				"added": 1530984410
			},
			{
				"comment_id": 33,
				"body": "correction: index.html instead of foo.html\nalso: do it in an empty directory because everything in it is exposed",
				"added": 1530984526
			},
			{
				"comment_id": 34,
				"body": "Maybe ZeroBundle does what you want as it's supposed to sync ZeroName on startup. So if you have a copy of ZeroName and you give a ZeroBundle to your friend it should just work. (Haven't tried it though.)",
				"added": 1531029776
			}
		],
		"1530977864_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 31,
				"body": "There was a zeronet gateway somewhere, you could just use that.\n\nOtherwise, even if you somehow trick your peers into letting you skip uploading, the result would be essentially making a gateway out of them.",
				"added": 1530983498
			}
		],
		"1533160269_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 35,
				"body": "Thanks, this looks interesting!\n\nLook at this: https://hashbase.io/about \nThis is something I wish ZeroNet had.\n\nApparently the default for Dat is to download shit you don't want (like in IPFS), but there's a \"sparse mode\" in which you download only what you asked for (like in ZeroNet): https://docs.datproject.org/faq\nThe question is, how to enable sparse mode in the Beaker Browser?\n\n> [nicwow](#comment_21_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): However, it helps very much to have TOR built in.\nThe default ZeroNet setup might use Tor for the ZeroNet traffic but embedded clearnet images are transported without Tor. In such a setup you can be easily deanonymized. Whonix is a much better option.",
				"added": 1533187478
			},
			{
				"comment_id": 36,
				"body": "It's based on Electron so yes, Chromium.\nFail? Sure. \n\nBut what's not a fail? Firefox, perhaps? Check out this bug for example:\nhttps://bugzilla.mozilla.org/show_bug.cgi?id=1477042",
				"added": 1533399138
			},
			{
				"comment_id": 37,
				"body": "I agree that Firefox is still somewhat better even though it's rapidly getting worse. I'm writing this on Firefox.\n\nHowever, I've disabled OCSP queries in Firefox (basically configuring it to behave like Chrome in this regard) because I think this Chrome dev made a really good point about it:\nhttps://www.imperialviolet.org/2014/04/19/revchecking.html\n\nMore importantly, the attack surface exposed by HTML5 is simply insane. Do not expect your browser to be secure! Virtual machines or even dedicated hardware seems to be the only sensible way to contain browsers. I'm using Qubes for that.",
				"added": 1533415646
			}
		],
		"1533542320_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 38,
				"body": "I can confirm the effect.\n\nFast loop (15s):\n\n    .L6:\n    \tcmpl\t$0, -28(%rbp)\n    \tje\t.L5\n    \tmovl\t$116, %edi\n    \tcall\tputchar@PLT\n    .L5:\n    \taddq\t$1, -8(%rbp)\n    .L4:\n    \tmovq\t-8(%rbp), %rax\n    \tcmpq\t-24(%rbp), %rax\n    \tjb\t.L6\n\nSlow loop (25s):\n\n    .L5:\n    \taddq\t$1, -8(%rbp)\n    .L4:\n    \tmovq\t-8(%rbp), %rax\n    \tcmpq\t-24(%rbp), %rax\n    \tjb\t.L5",
				"added": 1533590094
			},
			{
				"comment_id": 39,
				"body": "This looks like a caching problem but I don't know the details.\nYou can remove the memory access from the fast loop:\n\n    .L5:\n       cmpl %eax, %eax\n\nand it becomes slow.\nOr you can add a memory access to the slow loop:\n\n    .L5:\n        movq -28(%rbp), %rax\n\nand it becomes fast.",
				"added": 1533594662
			},
			{
				"comment_id": 40,
				"body": "I meant\n\n    .L6:\n       cmpl %eax, %eax",
				"added": 1533594700
			}
		],
		"1533632541_16LdT3GLYKemm8EWbR5BYXKMmMoZrSoet5": [
			{
				"comment_id": 41,
				"body": "> [realjohndoe](#comment_16_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): He should sue and shame them.\nCompanies have the full right to deny service to whomever they want.\n\n> In the US, individuals have a right to assembly. Rights denied Alex Jones.\nYou don't have the right to assemble at my home if I don't want you to.\n\nI dig decentralization but people (esp. alt-right) seem to just go to gab.ai.",
				"added": 1533670056
			},
			{
				"comment_id": 42,
				"body": "> [realjohndoe](#comment_17_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): Companies do not have a right to discriminate. \nKicking people out based on their behavior is not discrimination. If someone comes into a non-smoking restaurant and starts to smoke, it's legit to kick them out, US public company or not.\n\n> [realjohndoe](#comment_17_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): gab.ai is a fraud, a joke. Probably just AI bots.\nI'd find that very surprising because making AI bots is way harder than making a social network. If it's just AI bots, I would be actually more interested in this project.",
				"added": 1533706798
			},
			{
				"comment_id": 43,
				"body": "Twitter has just suspended anarchyball\nLooks like they really want to push everyone to gab/fediverse/0net",
				"added": 1533722927
			},
			{
				"comment_id": 44,
				"body": "> [realjohndoe](#comment_19_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): It's specifically designed too try and take pressure and individuals off services like #Facebook and #Twitter,\nWell, that's a good goal. I want the world to have more things that take individuals off services like Facebook and Twitter. So I'd support IDF on this one except I doubt they have anything to do with it.\n\n> The Sysops are King, and the Users are their subjects.\nPeople with this view can just become kings, and it's not too difficult. The real problem is the reliance on clearnet DNS. Now fediverse within .onion would be a lot more interesting...\n\nEven if ZeroNet is the Holy Grail (I'm pretty unsure about that), it doesn't mean the actual FB/Tw users will end up in it. In several \"aaaah where do we run?\" discussions I've seen on twitter people mention gab, memo.cash and minds.com. Nobody have heard of fediverse, let alone 0net. I'm not writing there and I refuse to join so I can't tell them.",
				"added": 1533763096
			},
			{
				"comment_id": 45,
				"body": "Meanwhile the leftists consider boycotting Twitter...\n\nhttps://twitter.com/oneunderscore__/status/1027276401920143361\n\nSome excerpts so that you don't have to read it:\n\n- Can we call the Twitter boycott #HitTheRoadJack?\n\n- Or #jackoff\n\n- Oh, the irony of debating what hashtag to use during a boycott of Twitter.\n\n- I'm starting to get the feeling that @jack is a legit white supremacist.\n\n-  Twitter is 100% PRO Trump\n\n- The Resistance needs a new platform. Any suggestions?\n\n- It’s pretty clear that Jack is full on alt right Russian nazi at this point and has been for quite some time. I mean, he did help create a platform designed to intrude into societies and spread harmful propaganda.\n\n- After this Trump nightmare is over, I’m done with Twitter.\n\nNow there's a puzzle in all this: if two sides - at the same time! - feel that the platform is being captured by the Other Side, what is really happening and who's crazy?",
				"added": 1533823174
			},
			{
				"comment_id": 46,
				"body": "> [vergreeneyes](#comment_7_13SeW8Gn6YsZFqUaQp5JWSGvzjHWfKHqBY): Well, we can just look at the facts: How many conservatives have been shadowbanned, deverified or banned altogether, and how many far left activists have been treated the same way? [...]\n\nYou were probably asking in a you-know-the-answer-very-well tone, but I actually don't know. Did anybody count?\n\nHere's leftist perspective (https://twitter.com/Gr8Melin/status/1027286217933475840):\n    ... #RESISTANCE members on Twit are punished for using an expletive while tRump, Alex Jones & #Cult45 can use hate speech, incite violence, even threaten murder on Twit w/no consequences.\n\nAs for Candace Owens, Twitter apologized to her saying it was an error. \n\nSo here's my theory. Let's say a leftists knows 100 other leftists and 10 rightists, and a rightist knows 10 leftists and 100 rightists. Then assume that Twitter bans every tenth person at random. So every leftist sees 10 of their comrades banned but only 1 rightist, so they assume Twitter disproportionately bans the Left. Similarly, every rightist sees 10 of his fellows banned, but only 1 leftist, so he assumes Twitter disproportionately bans the Right.",
				"added": 1533848065
			},
			{
				"comment_id": 47,
				"body": "> [realjohndoe](#comment_24_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): can come together on pressing important issues most agree on. Like healthcare. [...]\n\nMost agree on healthcare?? O_O",
				"added": 1533848891
			},
			{
				"comment_id": 48,
				"body": "> [vergreeneyes](#comment_8_13SeW8Gn6YsZFqUaQp5JWSGvzjHWfKHqBY): In any case, pretty much any time I see conservatives complaining about shadow banning and all the rest of it, they give examples. Whenever I see a leftist complaining, they just seem to pull claims out of their ass without doing anything to back it up. \n\nI have to agree with this, especially after seeing @gavin_mcinnes banned.\n(And I'm not even a conservative, I'm an ancap)",
				"added": 1533990610
			}
		],
		"1533994530_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 49,
				"body": "Why do you want to write in C if you need a keyword like \"local\"?\n\nMaybe what you want is C++'s std::unique_ptr.",
				"added": 1534001123
			}
		],
		"1534020190_15ZZiGkShjcPCmk1geSBYyz1Q8SeXcsc1k": [
			{
				"comment_id": 50,
				"body": "In IPFS you pay for downloading content by distributing other random content (read: cp). In Zeronet you only distribute what you want. I like the zeronet way more.",
				"added": 1534056062
			},
			{
				"comment_id": 51,
				"body": "> [anotherneko](#comment_15_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): No, you only distibute what you download, like bittrorrent.\n\nI stand corrected. IPFS states what I've said in the paper but apparently they've never implemented it that way.",
				"added": 1534084294
			}
		]
	},
	"comment_vote": {}
}