{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1595903595,
			"title": "Vaccine Agenda Exposed ( Nano Tech Hydrogel in The Vaccine)",
			"body": "The chip is in the vaccines. \n\nhttps://ipfs.globalupload.io/QmdbTGZLiFXciFmdQqmd5ce6ibKfmCMCvBXV7XvcnbeVeF\n\nhttps://ipfs.globalupload.io/QmRP154T5xQE7pinAFnRpFib6hyRKGZNfHjwpCznVhZetX\n\nVaccine behavior modification:\n\nhttps://ipfs.globalupload.io/QmfMdKTuYfYxcBav48XwA98CXr2gdrCdAsHSVVS8K8TxFL\n\nTo know already if everybody took the vaccine. \n\nhttps://eu.usatoday.com/story/news/factcheck/2020/06/04/fact-check-feds-syringes-may-have-rfid-chips-but-vaccines-optional/5246222002/",
			"added": 1595903594
		},
		{
			"topic_id": 1604352252,
			"title": "Data-dump adrenochrome paper trail",
			"body": "https://www.bitchute.com/video/Q1MLBb5j4mz1/\nThis video (part 1) shares a large data-dump, a paper trail of documents, that are the most shocking evidence of the existence of adrenochrome. The volume is extensive and points out that this happens on an industrial scale and is part of a world wide network.",
			"added": 1604352250
		},
		{
			"topic_id": 1604435439,
			"title": "Covid 21 - 2nd \"Total\" Lockdown; ISOLATION CAMPS for \"Refusers\"",
			"body": "A little dramatic, just for information. A new Covid variant, the Covid 21, way more death and infections, economical crashed, city locked down, inter-city travel forbidden.  Mandatory vaccine, debt forgivness but in exchange of the forfeit of any and all individual assets. Those who refuse put in isolation camps due to the dangerosity of the Covid 21. \nhttps://halturnerradioshow.com/index.php/en/news-page/world/canada-going-tyrannical-2nd-total-lockdown-isolation-camps-for-refusers",
			"added": 1604435436
		}
	],
	"topic_vote": {
		"1588406337_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"1597034762_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	},
	"next_comment_id": 43,
	"comment": {
		"1552979216_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 1,
				"body": "> [tiltedfern](#comment_1_1AT659Rf1jdFpiuGiQewKnqpcWoza46dfU): Did you read the entire thing. I have it available.\n\nYes and he should have waited a few years to understand a few more things. It is not corrupt elites that organize immigration, but capitalism needs. He still believes in politics. Since he is only 28, it is understandable, but if he was around 40, he would be retard tier.",
				"added": 1553085643
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 2,
				"body": "GOLDEN GATE BRIDGE IS AN INSIDE JOB!!!",
				"added": 1565531402
			}
		],
		"1581413099_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 3,
				"body": ">We aren't all the same, we can't expect everyone to just fall in line and start donating their work and stuff for free for everyone else. \nYes workers fall in line and donate their work for less than it's worth. That's exploitation. Replace everyone else in your sentence by owner of the means of production thought. \n>There will always be groups and individuals who either don't care, or don't even want to participate in the group effort. Like there will always be those who want to exploit all that \"free\" effort.\nIt's called the Capitalist class, aka owners of the means of production. \nMy bet, you are into massive cognitive dissonance. Have a good day.",
				"added": 1583853307
			}
		],
		"1586334718_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 4,
				"body": "Here the link from David Icke banned video from LBRY, a decentralized P2P video-sharing platform. \nhttps://lbry.tv/@Merovingian:6/david-icke-covid19-interview-banned-by-youtube-:e",
				"added": 1586384894
			}
		],
		"1586956972_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 5,
				"body": "Computational propaganda. Or more simply, armies of human paid shills with multiple accounts flooding the boards constantly with mainstream ideology. \nWe need captchas for each posts, and no more than one post every 5 minutes. Only way to effectively counter quantitative propaganda.",
				"added": 1586983414
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_2039_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Or PoW (proof of work)\n\nYes proof of work might work as well. I'm just a little afraid that agencies with tons of hash power at their disposal could use it to still spam and shill the boards.",
				"added": 1587133820
			}
		],
		"1586435262_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 7,
				"body": "> [eze](#comment_3_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8): Stay away from all public hospitals! [...]\n\nSadly this. \nFor those who want to know more about the Virus theory scam. Also about 5G, Corona, and vaccines:\nhttps://lbry.tv/@psychoNWO:9/FAKE-Corona-Virus---5G-:5",
				"added": 1587134562
			}
		],
		"1587403903_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 8,
				"body": "> [cexy](#comment_14_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): This information has my mind split in multiple parts and sizzling! I'm literally speechless how people just let themselves be locked in their houses as those demons just carry on all this bloody mayhem. At least i am on this platform.  [...]\n\nThere are a lot of paid shills. Less people are brainwashed than you think. The \"system\", is based of NPC/paid shills.",
				"added": 1587586504
			},
			{
				"comment_id": 9,
				"body": "Please seed to protect it against censorship on clearnet.\nIt's on LBRY (P2P video sharing platform with app), and d-tube (based on IPFS).",
				"added": 1587586653
			},
			{
				"comment_id": 10,
				"body": "> [cexy](#comment_20_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): What is your opinion about the fact how submissive so many people are to stuff like covid-hoax?\n\nBrainwashed by decades of mainstream medias propaganda. The equivalent on the internet is facebook/twitter censorship, and replacement of interesting vids by paid shills \"sponsored\". ",
				"added": 1587586676
			},
			{
				"comment_id": 11,
				"body": "For those who were conviced by Icke about the 5G - Covid correlation, and want to go further:\nhttps://lbry.tv/@psychoNWO:9/FAKE-Corona-Virus---5G-:5",
				"added": 1587586925
			},
			{
				"comment_id": 12,
				"body": "> [cexy](#comment_24_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): 60 GHz interferes with oxygen gas molecule and can lead to asphyxiation. I've been warned. Thnx\n\nExactly. There is probably a correlation. It is said that at 60Ghz, oxygen electrons spin faster, and then it is more difficult for hemoglobin to fix them, thus the respiratory insufficiency potentially caused by 5G, and the people dropping unconscious on the streets in 5G covered areas in China. \nAn other possibility is that at 60Ghz, oxygen become ozon (so O2 becomes O3), and ozon cause, again, respiratory insufficiency. \nThere are not a lot of material proof for this, because guess what, the 5G telecom carriers didn't do much research, and if they did, they didn't publish it, much like what happened with Big tobbaco, who knew cigarettes cause cancer since the 1950s/1960s, but didn't publish the results for obvious reasons. There are also no independant researches on the effect of 5G on health.\nhttps://youtu.be/hsil3VQE5K4?t=157",
				"added": 1587673342
			}
		],
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": [
			{
				"comment_id": 13,
				"body": "> [epistemic](#comment_5_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): \"PizzaGate\" has been thoroughly debunked.\n\nHow much do they pay you?",
				"added": 1587852843
			}
		],
		"1588406337_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 14,
				"body": "Intel management engine and AMD PSP are really not tolerable. I'll stay with the AMD fx 8xxx series. Most powerful CPUs without super all-in-one backdoor. When Capitalism become so shitty that you don't buy new products because they are more powerful but total spy and control technology. ",
				"added": 1588445544
			},
			{
				"comment_id": 15,
				"body": "> [mg0](#comment_290_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa):  OpenPower\n\nhm I'm all in favor for this OpenPower initiative, that said, IBM isn't really the kind of non profit organization you can easily thrust, is it?  Can i even easily run Linux Debian/Ubuntu, Fedora or Manjaro with an arch Power9?",
				"added": 1588449738
			},
			{
				"comment_id": 16,
				"body": "> [cexy](#comment_64_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): Is AMD FX 8350 Black Edition \"Vishera\" CPU (8 Core, AM3+, Clock 4.0 GHz, Turbo 4.2 GHz, 8 MB L3 Cache, 125 W)  within the group of CPUs you are talking about? Why would trust MD fx 8xxx series?\n\nYes i've done some searches, and from what i've read, the AMD FX  (all of them), are exempt of PSP backdoor. I've heard that they have some more primitive backdoor, but i don't know if that's true, only one person talked about that. \nI also need confirmation on those informations.",
				"added": 1588454841
			},
			{
				"comment_id": 17,
				"body": "Apparently, all the AMD FX on am3+ motherboards are exempt of the PSP.\nhttps://libreboot.org/faq.html#amd-platform-security-processor-psp\nhttps://freundschafter.com/cybersecurity-cpu-and-system-alternatives-without-intel-me-iamt-and-amd-psp-secure-technology/\n\nSo, bulldozer core and piledriver core are exempt of the PSP.  On the other hand, Steamroller (FM2+) and Excavator (FM2+, AM4)  have the Platform security processor. \n\nIn summary, those CPUs are exempt of PSP:\nhttps://en.wikipedia.org/wiki/List_of_AMD_FX_microprocessors",
				"added": 1588477856
			},
			{
				"comment_id": 18,
				"body": "> [arione](#comment_20_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY): Do smarphone cpus have ME alikes? One of my friends told me that after several android phone factory resets there is a piece of malicious software that keeps coming back to the system as if unaffected by the reset. Or is android so full of backdoors that it could be them?\n\nAs far as i know Android is a gigantic backdoor. Google play store is closed source.",
				"added": 1588523137
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 19,
				"body": "Covid-19 is shock doctrine. It seems to work even on the internet. Most are inside the deep state frame regarding this psy-op. \nAlso, you should  have some serious doubts about the germ theory of disease. Go check Stefan Lanka, or David Crowe. \nhttps://theinfectiousmyth.com/book/CoronavirusPanic.pdf",
				"added": 1588524426
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 20,
				"body": "> [krak3n777777](#comment_1_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw): https://banned.video/watch?id=5eb48c68c246d400862ce135 This video has a section in it that shows Bill Gates smiling like he just won the lottery, on live tv during an interview on CNN news.\n\nHe smiles because crashing the economy was the plan all along. The Corona flu is a psy-op in order to hide the global financial collapse, which would have happened anyway. It's not that hard to understand. The elite wouldn't do something this massive, even to vaccinate the population. That's only a secondary, but important goal. The main goal, is to hide the global financial collapse, and avoid responsibility. It worked well. Until now, no revolt from the people due to austerity, and even if the people get angry, the mainstream medias could easily make them feel guilty for not wanting to make sacrifices due to the terrible Corona flu. \nAlso, reminder that to this day, the Corona flu has only killed a little more people than a bad yearly flu.",
				"added": 1589130624
			},
			{
				"comment_id": 21,
				"body": "> [jesuschrist](#comment_8_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): Looking at what he is doing and who he is associated too always makes me wonder if he was eating kids too.\n\nReminder that he was on the Lolita express.",
				"added": 1589210402
			},
			{
				"comment_id": 22,
				"body": "> [aassddff](#comment_16_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): \n\nSorry but all vaccines are bad. All of them. And YHWH is also the same entity as Baal and Moloch. YHWH is the demiurge. The chief of the archons.",
				"added": 1589323886
			}
		],
		"1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 23,
				"body": "> [plastic](#comment_3_16oxEAGbLsyEkLH9z6uDBWCLMMUkURTkAp): you sound paranoid and distrubed, are you sure you shouldn't see a psychiatrist?\n\nPaid shill you are not welcome here. This is not youtube, nor reddit.  You, or your masters, do not own this space.  Decentralized internet is ours. Data is stored in our hard drives. Not yours.  Get out.",
				"added": 1590429861
			}
		],
		"1590404236_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 24,
				"body": "That was the plan all along. Destroy overproduction, deflate the bubble, and take wealth from the working class, in a scenario where it is impossible for the masses to criticize, because supposedly, it is done to protect \"health\".",
				"added": 1590430758
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 25,
				"body": "> [zenanon](#comment_80_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): For me: [...]\n\nCommunism is classless by nature. So your personal definition might be wrong.",
				"added": 1590765019
			},
			{
				"comment_id": 26,
				"body": "> [adrenochrome](#comment_2_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T): Communism = controlled opposition by the satanic elites = totalitarian prison for humans\n\nThat's what you believe when you haven't completely lifted the veil adrenochrome.  You still are into Jehovist's narrative. You are just in total opposition of it, but still, being in total opposition of something means you still play the game. You want a goyim Capitalism. You want to replace Capitalism vanguard, the chosen people, by a goyim vanguard. How do i know nothing would change?",
				"added": 1590765301
			},
			{
				"comment_id": 27,
				"body": "> [anshorei](#comment_112_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): Reality is that neither will happen, the village will converge into something between the two ideals, but only as long as the villagers remain anarchists.\n\nGo check Huterrites. Is pretty much modern communism.",
				"added": 1590765488
			}
		],
		"1590855688_13ynUw2jD5FnBomqnq5vENr5ioWY7VEtTA": [
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_744_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Aether looks interesting.  How many people use it?\n\nIt tried it, but it feels a little claustrophobic. Don't know why.",
				"added": 1590941168
			},
			{
				"comment_id": 32,
				"body": "4chan. At least they don't censor nearly as much. ",
				"added": 1605631273
			}
		],
		"1590630000_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 29,
				"body": "The collapse of Capitalism.",
				"added": 1590941412
			}
		],
		"1592133605_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 30,
				"body": "Why should controlled opposition be against forced vaccination?",
				"added": 1592177912
			}
		],
		"1596497359_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": [
			{
				"comment_id": 31,
				"body": "> [merithtk](#comment_86_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): On paper, it would work. But mankind's. Natural greed and desire for power makes it fail every time.\n\nMeme answer.",
				"added": 1596922491
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 33,
				"body": "You are late, it already exist. And it's name is LBRY.",
				"added": 1605631418
			}
		],
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 34,
				"body": "That's not different than 4chan. If you are not behind a proxy, VPN, you can easily be tracked.",
				"added": 1605631823
			}
		],
		"1611920431_1F57R2GNQqq1McDDceeEekBpYwdWizAX7E": [
			{
				"comment_id": 35,
				"body": "When he said the proletarians are going to take over, i bet no one really imagined it would be this way.",
				"added": 1612007024
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 36,
				"body": "> [roaringturtles](#comment_59_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd): how can people become such sons and daughters of whores... those cnn workers are to be eliminated... it's so imperative... they can't live, they have to be off boarded...\n\nSure, so they can be replaced by some better journalists.",
				"added": 1619017564
			}
		],
		"1618959746_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 37,
				"body": "It's a good initiative. However, 5G is also in the Starlink.",
				"added": 1619220004
			}
		],
		"1619342119_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": [
			{
				"comment_id": 38,
				"body": "Why do medias exist? Can a good media exist? \nThe thing is, there is no such thing as a good media. All of them are echo chamber of particular interests. That include \"alternative\" medias.",
				"added": 1619444895
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 39,
				"body": "Hello, \nHow do i increase my limited space to store comments, in the french forum. I'm at 19K/20K.",
				"added": 1620127823
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 40,
				"body": "Israel got outdated by China in Capitalism. Jews were the vanguard of Capitalism, the people-class. Not anymore.",
				"added": 1620130774
			}
		],
		"1620574964_1C6gAPEiSgWRPes1bmpFhWcKGyyT2WMTiX": [
			{
				"comment_id": 41,
				"body": "> [xcape2net](#comment_847_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I agree with deepstrelok.  As anyone who has used ZeroNet for any length of time can attest, users hosting content on their computers has some important drawbacks.  Though I love the idea of using a decentralized network like ZeroNet, it is not good for many things that we rely on the Internet for.  I think what will happen is that decentralized networks will supplement the clearnet, not replace it.  And, that's alright.\n\nIt seems what i call semi-decentralized, like activity pub (i don't like mastodon or peertube though), and hosted instances like the search engine searx , or fchan (https://fchan.xyz), are what's more practical today. \nYou have the benefit of centralized platforms: speed, instant access, can upload files, can access from an old laptop or even a phone, but also the benefits of some decentralization: if there is some censorship, an other instance can open, and take if from here.",
				"added": 1620653114
			}
		],
		"1624835115_129GZPA7VpPa3YaRRW2ani34CaowY5hYB8": [
			{
				"comment_id": 42,
				"body": "Hm it's still useful, even dead, in case there is an attack on the clearnet (DNS attack + major hosting servers attack). Would be a place to exchange information.",
				"added": 1633385265
			}
		]
	},
	"comment_vote": {
		"17_1HFmAHXvHgkwfXcGZH9hMqj9TbgXDZNwGc": 1,
		"53_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"3_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": 1,
		"43_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"433_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"14_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"457_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"465_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"2128_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"26_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"56_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": 1
	}
}