{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1580020845_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1575616298_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": [
			{
				"comment_id": 1,
				"body": "04 - Alien Resurrection (a Ressurreição) 1997 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579472476_1JgdFzbwbAwdPmZ1FPs2M9p8G57ME4dsKg\n",
				"added": 1579473158
			},
			{
				"comment_id": 3,
				"body": "The WolfMan (O Lobisomen) 2010 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579572255_1JgdFzbwbAwdPmZ1FPs2M9p8G57ME4dsKg",
				"added": 1579575145
			},
			{
				"comment_id": 4,
				"body": "The Butterfly Effect (Efeito Borboleta) 2004 Leg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579768124_1JgdFzbwbAwdPmZ1FPs2M9p8G57ME4dsKg",
				"added": 1579768343
			},
			{
				"comment_id": 5,
				"body": "Michael Jackson - Moonwalker 1988 Leg ogg\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Video=1579812308_1JgdFzbwbAwdPmZ1FPs2M9p8G57ME4dsKg",
				"added": 1579814873
			}
		],
		"1579475766_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 2,
				"body": "Cheapskate's Guide on zeronet  \n\nhttp://127.0.0.1:43110/1CpqvBQWSzZSmnSZ58eVRA9Gjem6GdQkfw",
				"added": 1579504531
			}
		],
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "thank you.",
				"added": 1579856867
			},
			{
				"comment_id": 7,
				"body": "translate/tradução pt-br\n\nTudo está fora de controle - coleção de vídeos Wuhan\nParte 1 https://gnews.org/87312/\nParte 2 https://gnews.org/87341/\n\nProibir médicos de falar sobre o coronavírus\nhttps://gnews.org/87599/\n\nAutoridades ocultam doenças que levam à morte de pacientes\nhttps://gnews.org/87656/\n\nEm Wuhan, um membro da família de um paciente que aguardava tratamento mostrou-se furioso com o governo chinês incapaz e corrompido: 'Foda-se o PCC!'\nhttps://gnews.org/87625/\n\nObrigatório de usar uma máscara em Wuhan, China; Os infratores serão multados pela segurança pública\nhttps://gnews.org/86938/\n\nVídeo: linha do tempo da pneumonia de Wuhan de 8 de dezembro a 23 de janeiro de 8 de março de 2019, o primeiro caso de um novo tipo de pneumonia foi relatado em Wuhan China.\n\nFonte https://gnews.org/87713/\nVídeo: https://youtu.be/-vjCZUMU29o\n\nEm 31 de dezembro de 2019, a Comissão Municipal de Saúde e Saúde de Wuhan emitiu um aviso público pela primeira vez que algumas instituições médicas descobriram recentemente que muitos dos casos de pneumonia recebidos estavam relacionados ao Mercado de Frutos do Mar do Sul da China. Após receber o relatório, a Comissão Municipal de Saúde e Saúde de Wuhan lançou imediatamente as pesquisas de casos relacionados ao Mercado de Frutos do Mar do Sul da China e investigações retrospectivas que encontraram 27 casos, dos quais 7 estão em estado grave e os demais são estáveis ​​e controláveis, e 2 espera-se que os pacientes recebam alta no futuro próximo. Com base na situação, resultados do tratamento, investigações epidemiológicas, exames laboratoriais preliminares e outros aspectos da análise da situação, os especialistas acreditavam que os casos acima são pneumonia viral. A investigação não encontrou transmissão óbvia de humano para humano e nenhuma infecção da equipe médica.\n\nEm 1 de janeiro de 2020, oito pessoas foram presas na China por espalhar boatos sobre esta doença.\n\nO mercado de frutos do mar ligado à pneumonia foi finalmente fechado.\n\nEm 3 de janeiro de 2020, a Comissão de Saúde e Saúde de Wuhan anunciou 44 infecções, incluindo 11 casos graves.\n\nEm 9 de janeiro de 2020, houve uma identificação preliminar do surto de pneumonia viral como novo coronavírus.\n\nEm 11 de janeiro de 2020, a Comissão de Saúde e Saúde de Wuhan anunciou um caso de morte\n\nEm 14 de janeiro de 2020, a Tailândia encontrou um paciente da China.\n\nEm 15 de janeiro de 2020, Wuhan enviou uma notificação de casos desconhecidos de pneumonia sem excluir a transmissão de humano para humano.\n\nEm 16 de janeiro de 2020, o primeiro caso do Japão foi confirmado, o paciente esteve em Wuhan e dois turistas Wuhan entraram no Vietnã foram colocados em quarentena.\n\nEm 17 de janeiro de 2020, uma nova morte em Wuhan e um segundo caso foram encontrados na Tailândia.\n\nEm 19 de janeiro de 2020, 17 novos casos foram encontrados em Wuhan. O NHC (Comissão Nacional de Saúde) anunciou que o surto era evitável e controlável sem encontrar a fonte do vírus.\n\nEm 20 de janeiro de 2020,\n\nUm novo caso de morte e 136 casos confirmados em Wuhan nos últimos dois dias.\nDois casos confirmados em Pequim.\nUm caso confirmado em Guangdong.\nOito casos confirmados em Shenzhen.\nCinco casos confirmados em Zhejiang.\nUm caso na Coréia do Sul.\nUm caso em Xangai.\nUm caso em Chengdu\n\nZhong Nanshan, chefe de um especialista de alto nível organizado pela Comissão Nacional de Saúde, disse que o novo vírus causador do surto de pneumonia em Wuhan poderia se espalhar de humano para humano.\n\nEm 21 de janeiro de 2020, a pneumonia Wuhan causou uma morte, um segundo caso confirmado em Xangai, 4 casos estão sendo testados, 15 médicos foram infectados, incluindo um caso suspeito.\n\nEm 23 de janeiro de 2020, a Comissão Militar Central ordenou que o teatro central ajudasse Wuhan a fechar a cidade para evitar a instabilidade das pessoas causada pelo sentimento de pânico.",
				"added": 1579856930
			}
		],
		"1580020845_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 8,
				"body": "Hubs are the places where the data of some sites on zeronet are stored.\n\nWhich in this case are even more decentralized, because you can choose to save your data in one of the several hubs that exist or create your own.\n\nBelow is a link to a website that allows you to add several hubs at once, like opening them, and then it will upload their information.\n\nIn this case, they are the zerome hubs, zeronet's twitter style site.\n\n\nGet ALL hubs\nhttp://127.0.0.1:43110/0hub.bit/",
				"added": 1580029689
			},
			{
				"comment_id": 9,
				"body": "and here is one of the youtube style sites we have on zeronet,\nhttp://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/?Latest\n\nremember on zeronet you are free to create your own site so there will be several interesting sites that cannot be taken down, if they have several seeds and of course the owner of the same, do not delete it.\n\nBecause the only one who has control over the SITE itself is the owner of the site.\n\nAnd hubs, in this case, are also a way to take control of the data of the website owner, thus bringing more decentralization.\n\nAnd making pages like the zerome for example, something that you can easily modify and have yours, and access as if it were the original zerome, because it doesn't matter, because the data would be elsewhere, which are the HUBS.",
				"added": 1580029861
			},
			{
				"comment_id": 10,
				"body": "> [ktm](#comment_10_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6): I really appreciate the information! Thank you! This really does help.  I've added the hubs from the links provided and they look like they have updated themselves and have bells by their names. When I click on the names though, it shows me that message. I know that this is going to sound silly and I apologize for asking, but how do I see what is stored or on the hib? I mean, how do I see what's there?\n\ngood question :/",
				"added": 1580112735
			},
			{
				"comment_id": 11,
				"body": "http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Crr9qm9ywhtPx63Wd8pn2jGHSxGWffKNw/1580112960-deletar.png\n\nopen the hub website and then go there on the button that is on the upper right side of the browser, the button with the zeronet symbol, click and hold pulling to the left and it will open more options and then after that, go where you are in image, which I posted, showing \"OPEN SITE DIRETORY\"\n\nClick on it and it will open the folder and or directory where the saved files of the users of this hub are.\n\nRemembering that it is basically TEXTS, Images most I believe in base64.",
				"added": 1580113184
			}
		]
	},
	"comment_vote": {}
}