{
	"next_topic_id": 29,
	"topic": [
		{
			"topic_id": 1,
			"title": "Se il sogno americano diventa un incubo",
			"body": "Disparità economiche esagerate tolgono qualsiasi opportunità ai poveri e danno troppo potere ai ricchi.\nArticolo completo su \"Scienza & Cultura libera\": http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Home",
			"added": 1550484450
		},
		{
			"topic_id": 2,
			"title": "Il fascino dello spazio vuoto",
			"body": "Recensione del libro «La fisica del nulla» di James Owen Weatherall.\nArticolo completo su \"Scienza e Cultura libera\" : http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:6:Il+fascino+dello+spazio+vuoto",
			"added": 1550572695
		},
		{
			"topic_id": 3,
			"title": "Difficoltà a pubblicare nel blog",
			"body": "Ho delle difficoltà a pubblicare  nel blog. funziona molto lentamente e non mi incolla il testo. la porta è aperta e Zeronet funziona correttamente, però mi rende impossibile scrivere sul blog.",
			"added": 1550656579
		},
		{
			"topic_id": 4,
			"title": "Qualcuno conosce Beaker Browser?",
			"body": "E' un browser (basato su Chromium) che permette la creazione, condivisione e lettura di siti web statici, tramite p2p... il funzionamento è molto simile a Zeronet, ma non ci sono tracker e permette la condivisione di solo siti web (per adesso).... però funziona bene.... Ovviamente, i siti da voi creati sono ospitati sul vostro computer e, per permettere ad altri di leggerli, dovrete avere sempre Beaker in esecuzione... Oppure usare il super-peer Hashbase, gratuito fino a 100 MB di spazio (che per un sito non è poi così poco)....\nhttps://beakerbrowser.com/",
			"added": 1550656782
		},
		{
			"topic_id": 5,
			"title": "Scienza e Cultura libera",
			"body": "Divulgazione scientifica e cultura libera contro il dominio del Copyright. Blog estremamente critico verso i partiti fascisti e razzisti come Lega e 5Stelle.\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Home",
			"added": 1551174737
		},
		{
			"topic_id": 6,
			"title": "Scienza e Cultura libera",
			"body": "Divulgazione scientifica e cultura libera contro il dominio del Copyright. Blog anarchico, antirazzista e antifascista\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
			"added": 1551175940
		},
		{
			"topic_id": 7,
			"title": "Come smontare da sinistra la propaganda giallonera, in poche mosse",
			"body": "Il reddito di cittadinanza in versione Cinque Stelle ha tutti i difetti del mondo più uno.\n...\nContinua a leggere l'articolo su \"Scienza e Cultura libera\": http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:10:Come+smontare+da+sinistra+la+propaganda+giallonera,+in+poche+mosse",
			"added": 1551185213
		},
		{
			"topic_id": 8,
			"title": "Nel Paese della bugia la verità è rivoluzionaria",
			"body": "«È finita la pacchia» dice il ministro dell’Interno Salvini irridendo chi rischia la vita per raggiungere l’Italia e lavora come uno schiavo del caporalato nelle nostre campagne.......\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:11:Nel+Paese+della+bugia+la+verit%C3%A0+%C3%A8+rivoluzionaria",
			"added": 1551194180
		},
		{
			"topic_id": 9,
			"title": "Capricci",
			"body": "A prima vista sembra una sciocchezza: lasciarsi scappare un’azienda pronta a creare 25mila posti di lavoro. Ma se si guarda bene, la realtà è più complicata. Da una parte c’è Amazon, la più grande azienda statunitense (800 miliardi di dollari di valore in borsa), di Jeff Bezos, l’uomo più ricco del mondo (133 miliardi di patrimonio personale). Dall’altra ci sono i 60mila abitanti di Long Island City, un’ex area industriale di fronte a Manhattan. Nel 2017 Amazon, che ha sede a Seattle, aveva annunciato l’intenzione di costruire un secondo quartier generale e aveva messo in competizione tra loro le città americane per vedere chi offriva più incentivi.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:9:Capricci",
			"added": 1551204522
		},
		{
			"topic_id": 10,
			"title": "Padroni a casa d'altri",
			"body": "L’attacco di Di Maio a Macron, additato come unico responsabile dei mali d’Africa e delle partenze dei migranti, è solo l’ultimo atto di una sfida tra imperialismi. Prassi in cui l’Italia neoliberista di oggi si differenzia ben poco da quella fascista e coloniale.\n\nL'articolo completo qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:12:Padroni+a+casa+d%27altri",
			"added": 1551205807
		},
		{
			"topic_id": 11,
			"title": "Nonostante Auschwitz. Il \"ritorno\" del razzismo in Europa (Parte 1)",
			"body": "Per capire perchè il razzismo sia tornato sulla scena nelle nostre società non basta considerare gli avvenimenti dell’ultimo ventennio. Bisogna prendere sul serio l’ipotesi che il razzismo sia un ingrediente della modernità europea, non soltanto un effetto perverso della globalizzazione, tanto meno un residuo arcaico destinato a estinguersi.\nMa affermare la perversa normalità del razzismo non implica rassegnarsi alla sua presenza nefasta e operosa. Significa attrezzarsi a combattere, all’altezza della sfida, una cruciale battaglia di civiltà.\nArticolo completo qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:13:Nonostante+Auschwitz.+Il+%22ritorno%22+del+razzismo+in+Europa+(Parte+1)",
			"added": 1551290206
		},
		{
			"topic_id": 12,
			"title": "Giochi di prestigio",
			"body": "Il cambiamento è un gioco di prestigio.\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:15:Giochi+di+prestigio",
			"added": 1551344204
		},
		{
			"topic_id": 13,
			"title": "Combattere l'antisemitismo",
			"body": "L’antisemitismo è l’esempio più chiaro di una società minata dall’odio. Il suo aumento in Europa è sintomo di una malattia, ma anche di qualcosa di più profondo e terribile: l’ignoranza del passato. Tutte le forme di razzismo vanno condannate, ma purtroppo si conoscono con certezza le conseguenze dell’antico odio nei confronti degli ebrei: il più grande crimine della storia.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:16:Combattere+l%27antisemitismo",
			"added": 1551345631
		},
		{
			"topic_id": 14,
			"title": "La linea di confine",
			"body": "Ingoiato il salvataggio del ministro dell’interno da parte della piattaforma Rousseau e della giunta del senato per le autorizzazioni a procedere, e in attesa del suo salvataggio definitivo da parte dell’aula, è bene ribadire cosa è in gioco nel caso Salvini e quale precedente sta scrivendo il parlamento italiano per tenere unita con la colla l’alleanza di governo tra Lega e 5Stelle.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:17:La+linea+di+confine",
			"added": 1551347028
		},
		{
			"topic_id": 15,
			"title": "Il caso Cucchi spiegato ai miei studenti",
			"body": "«Prof, ma lei cosa ne pensa del caso Cucchi?». I ragazzi oggi soffrono di un vuoto di politica (nel senso più specifico del termine), ma non smettono di avere occhi per vedere quello che accade. E quando si tratta di casi singolari l’attenzione aumenta. È più facile immaginarsi di provare quel che ha provato un altro ragazzo che non proiettarsi in scenari più astratti, dove a lavorare è la mente del cuore. Così, casi come quello di Cucchi stimolano la curiosità: com’è possibile essere vittima di chi ti dovrebbe proteggere?\n\nArticolo completo: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:18:Il+caso+Cucchi+spiegato+ai+miei+studenti",
			"added": 1551372049
		},
		{
			"topic_id": 16,
			"title": "Per non dimenticare gli affetti",
			"body": "Le notizie politiche sono sempre più assurde. I governanti Lega-M5s non sembrano ancora essersi resi conto che sono ala guida di un Paese con 60 milioni di abitanti. Ogni affermazione del governo ha una ripercussione. La manovra economica del governo non è ancora chiara. Di certo si sa soltanto che i soldi per mettere in atto il programma elettorale non ci sono. Ed ecco quindi che si deve ricorrere al debito.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:19:Per+non+dimenticare+gli+affetti",
			"added": 1551427962
		},
		{
			"topic_id": 17,
			"title": "Chiesa e pedofilia. Complicità di Stato",
			"body": "Segretezza delle procedure, nessun obbligo di denuncia per i vescovi e di collaborazione con le autorità civili. Sono le principali cause della diffusione delle violenze sui minori di matrice ecclesiastica nel nostro Paese. Eppure è così che il Vaticano e la Conferenza Episcopale Italiana continuano a trattare i casi di abuso.\nPerché lo consente il Concordato.\nAboliamolo.\n\nTante nuove notizie in arrivo su \"Scienza e Cultura libera\".\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Home",
			"added": 1551429484
		},
		{
			"topic_id": 18,
			"title": "La resistenza e la capacità di reagire di Mujica è ciò che ci serve oggi",
			"body": "Uno dei momenti chiave del film “Una notte di dodici anni” di Alvaro Brechner è un incontro in carcere fra Pepe Mujica e sua madre. Il futuro presidente dell’Uruguay, a quel punto in galera già da qualche anno, dà evidenti segni di cedimento. Dice di sentire delle voci, appare sofferente e smarrito: è stremato dalle torture, dalla brutalità, dall’isolamento in luoghi insopportabili.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:22:La+resistenza+e+la+capacit%C3%A0+di+reagire+di+Mujica+%C3%A8+ci%C3%B2+che+ci+serve+oggi",
			"added": 1551436595
		},
		{
			"topic_id": 19,
			"title": "Tolleranza zero contro il Concordato",
			"body": "Il 16 febbraio, cinque giorni prima del summit mondiale sulla pedofilia convocato in Vaticano da papa Francesco, l’ex cardinale Theodore McCarrick, già arcivescovo di Washington, è stato ridotto allo stato laicale. Un caso senza precedenti nei confronti di un porporato che fa seguito a un’altra rarità: il 28 luglio 2018 Bergoglio gli aveva infatti tolto il cardinalato. La sentenza definitiva della Congregazione per la dottrina della fede che ha riconosciuto McCarrick colpevole di crimini sessuali contro minori e adulti ha messo la parola fine alla sua poderosa carriera ecclesiastica.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:23:+Tolleranza+zero+contro+il+Concordato",
			"added": 1551458219
		},
		{
			"topic_id": 20,
			"title": "Distanza",
			"body": "È come se si fosse svuotata una città delle dimensioni di Trento. Nel 2017 sono stati 115mila i cittadini italiani andati all’estero per cercare migliori occasioni di lavoro (nel 2008 erano stati 40mila). Chi va via è mediamente più giovane e più istruito del resto della popolazione (tanto che il 18,8 per cento dei dottori di ricerca vive all’estero), ma comunque solo la metà ha il diploma o la laurea. Sono alcuni dei numeri di un rapporto curato da ministero del lavoro, Istat, Inps, Inail e Anpal e pubblicato il 25 febbraio.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:24:Distanza",
			"added": 1551462210
		},
		{
			"topic_id": 21,
			"title": "«Continuo a lottare perché non accada mai più»",
			"body": "«Mi fidavo talmente delle istituzioni da affidare loro mio fratello di fronte a quello che percepivo come un mio fallimento» racconta Ilaria Cucchi. E dopo l’ammissione di responsabilità dei carabinieri guarda al futuro: «Bisogna insistere, per Stefano, per Federico, per Carlo».\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:25:%C2%ABContinuo+a+lottare+perch%C3%A9+non+accada+mai+pi%C3%B9%C2%BB",
			"added": 1551479333
		},
		{
			"topic_id": 22,
			"title": "Uno Stato di violenza",
			"body": "Lo spiraglio di luce sulla vicenda di Stefano Cucchi, morto 9 anni fa dopo un pestaggio in una caserma dei carabinieri, fa riemergere una lunga scia di abusi. Un sistema “law & order” che frantuma la società e crea paura. L’ultimo atto, il decreto sicurezza di Salvini.\n\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:26:Uno+Stato+di+violenza",
			"added": 1551629585
		},
		{
			"topic_id": 23,
			"title": "La cella \"zero\" delle carceri disumane",
			"body": "A Poggioreale per decenni è esistito un luogo del terrore dove i detenuti venivano picchiati. Pratiche illegali che hanno preso piede anche in altri penitenziari, come dimostrano gli esposti dei Garanti dei detenuti del Lazio e del Piemonte.\n«Solo una lampada accesa. Tutt’intorno il nulla, solo quattro mura sporche di sangue e muffa. All’inizio c’era un cappio appeso. Era l’illuminazione del terrore. Centinaia e centinaia di detenuti ci sono passati». Pietro Ioia è stato il primo che ha denunciato le torture e le violenze che avvenivano nella cosiddetta “cella zero” del carcere di Poggioreale a Napoli. Bastava un pretesto, una scusa qualsiasi e il detenuto veniva portato nella stanza al piano terra. Senza telecamere, senza finestre.\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:27:La+%E2%80%9Ccella+zero%E2%80%9D+delle+carceri+disumane",
			"added": 1551694211
		},
		{
			"topic_id": 24,
			"title": "\"Il libro nero della Lega\" in arrivo su Scienza & Cultura libera",
			"body": "Sto preparando \"Il libro nero della Lega\" per renderlo leggibile su ZeroNet.\nIl libro (completo) verrà pubblicato in varie parti su questo blog.\nGrazie a tutti i lettori di questo blog. Cerchiamo di resistere a questo governo infame e criminale. \nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
			"added": 1551863115
		},
		{
			"topic_id": 25,
			"title": "Riconoscere",
			"body": "“Sono una vostra lettrice e trovo i vostri articoli sempre molto illuminanti. Pertanto vi chiedo un’illuminazione! Il mio compagno e io stiamo insieme da sei anni. È raro che parliamo di attualità ma quando capita insorgono terribili discussioni, sul tema dei migranti poi è come parlare con Salvini! Il suo pensiero è povero, pieno di luoghi comuni e disinformazione. Sono terrorizzata. Non si informa, non legge i giornali, ma pretende di giudicare! Aspettiamo un figlio e sono preoccupata all’idea di doverlo crescere con un papà becero”.\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:29:Riconoscere",
			"added": 1552167516
		},
		{
			"topic_id": 26,
			"title": "L'ostinazione del potere algerino",
			"body": "A quanto pare né il presidente né i suoi sostenitori hanno compreso l’ampiezza della rivendicazione popolare, calma ma risoluta, per un cambiamento radicale e immediato in Algeria. O forse hanno voluto far prevalere la volontà del clan su quella del popolo.\nL'articolo continua qui: http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:30:L%E2%80%99ostinazione+del+potere+algerino",
			"added": 1552169402
		},
		{
			"topic_id": 27,
			"title": "Le donne sono pronte a lottare",
			"body": "Anche quest’anno l’8 marzo è una giornata di sciopero per le donne di tutto il mondo. È l’ultima tappa di una mobilitazione cominciata in Argentina nel 2015 con la nascita del movimento “Ni una menos” contro i femminicidi e la violenza sulle donne. Quella mobilitazione si è poi estesa: dalla Polonia, dove nel 2016 la protesta ha bloccato un disegno di legge sull’aborto, agli Stati Uniti, dove dopo la marcia delle donne a Washington nel 2017 è nato il movimento #MeToo. In Italia “Non una di meno” ha preso piede dopo la grande manifestazione del 26 novembre 2016.\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:31:Le+donne+sono+pronte+a+lottare",
			"added": 1552234623
		},
		{
			"topic_id": 28,
			"title": "Il libro nero della Lega (2019) (Parte 1)",
			"body": "IL LIBRO NERO DELLA LEGA.\n\nLA TRUFFA MILIONARIA AI DANNI DEGLI ITALIANI,\nLE ALLEANZE CON PERSONAGGI IMPRESENTABILI AL SUD,\nLE TRAME OPACHE SULLO SCACCHIERE INTERNAZIONALE:\nTUTTA LA VERITÀ SUL PARTITO DI MATTEO SALVINI.\n\nChe fine hanno fatto i 49 milioni di euro della truffa sui rimborsi elettorali architettata da Umberto Bossi e Francesco Belsito? Perché Matteo Salvini mente quando dice di non aver mai visto un euro di quel tesoro? Chi sono i nuovi finanziatori del partito di oggi? E ancora, come mai il ministro dell’Interno per sfondare al Sud si è circondato di personaggi equivoci, riciclati, ex fascisti, condannati, indagati e con parentele su cui pesa il sospetto di contiguità con la mafia? Quali segreti si celano dietro le alleanze strette dal leader della Lega con Vladimir Putin e Donald Trump?\nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/?Post:33:Il+libro+nero+della+Lega+(2019)+(Parte+1)",
			"added": 1552327704
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_1Vy5x8HrbwRc2GM32GfZtpxdgoB5f34fd": [
			{
				"comment_id": 1,
				"body": "Ciao a tutti. Uso ZeroNet da qualche mese e lo trovo ttimo. Ne approfitto per linkare il mio blog, \"Scienza e cultura libera\", in cui scrivo principalmente di scienza e divulgazione scientifica ma anche di politica e attualità. Gli articoli che scrivo non sono copiati da qualche sito e non li troverete su nessun'altro sito web, solo su \"Scienza e Cultura libera\". grazie. \n http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
				"added": 1552496514
			}
		],
		"1_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 2,
				"body": "Presente. Ho un piccolo blog su ZeroNet, \"Scienza e Cultura libera\", in cui scrivo di scienza, divulgazione scientifica, politica e attualità. \nhttp://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
				"added": 1552496669
			}
		],
		"1_1EidJhfDKh2xojwKUdjGRTpQ7osWjt66G2": [
			{
				"comment_id": 3,
				"body": "Ho un piccolo blog su ZeroNet dove scrivo principalmente di scienza e divulgazione ma anche di politica e del mio odio verso la Chiesa (anzi, le chiese) e TUTTE le religioni. Il blog si chiama \"Scienza e Cultura libera\".\n http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
				"added": 1552496827
			}
		],
		"1_14qkCANgpwdN9rLmjeEWyyxEzAjmwFVkom": [
			{
				"comment_id": 4,
				"body": "ho un piccolo blog su ZeroNet in cui scrivo principalmente di scienza, ma anche di software libero. Sono un felice utente di Arch Linux",
				"added": 1552496930
			},
			{
				"comment_id": 5,
				"body": "> [manuelrossi69](#comment_4_18beFpoZvw5LuQXGeW2gTprMC7BCCivJxa): ho un piccolo blog su ZeroNet in cui scrivo principalmente di scienza, ma anche di software libero. Sono un felice utente di Arch Linux\n\nIl blog è \"Scienza e cultura libera\" : http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
				"added": 1552496956
			}
		],
		"1_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 6,
				"body": "Ho un piccolo blog su ZeroNet in cui scrivo di scienza, politica e attualità. \"Scienza e cultura libera\".http://127.0.0.1:43110/17i3MDwDd6zrmsfYv461dgmzmsKengbL44/",
				"added": 1552497128
			}
		]
	},
	"comment_vote": {}
}