{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"4_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": 1,
		"1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "> [requrequ](#comment_2_1EFMHNDwAJjBaDMUdTAJKmEVvehiJnkEss): \n Давайте каждый будет сам выбирать что постить, а сообщество уже решит - что ему поддерживать, а что нет. Тем более, что сеть и основана на этом принципе.",
				"added": 1457464048
			},
			{
				"comment_id": 15,
				"body": "А что тут некоторые сообщения пропали? Про infobox от vlad20012 и про плагины от kostanew?",
				"added": 1457651262
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 2,
				"body": "> [splitfire](#comment_132_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): кстати, тут есть идея вместо торрентов, попробовать использовать ipfs. Очевидные проблемы:\n> \n> человек с установленным ipfs мало (на винде есть проблемы с установкой и использованием)\n> из людей, из пункта 1, хранящих крупные файлы еще меньше\n\nnofish хочет сделать поддержку больших файлов по принципам торрента. Надеюсь это будет не велосипед, а именно сам торрент-протокол. Тогда можно будет и фильмы подгружать с большим кол-вом сидеров и все остальное.",
				"added": 1457464396
			},
			{
				"comment_id": 4,
				"body": "> [esteban](#comment_62_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот то есть ты предлагаешь webtorrent. Но закрываю я страницу и что, кто раздавать будет.\n\nНет, не webtorrent, а обычный torrent, как расширение/ плагин для самого zeronet. Сколько хранить и сидировать просмотренный фильм - отдельный вопрос. Кто-нибудь знает как работает popcorn time в этом смысле?",
				"added": 1457464749
			},
			{
				"comment_id": 5,
				"body": "Кстати, еще вот что интересно. Zeronet умеет грузить картинки по запросу, а не все сразу. Можно то же самое провернуть с текстовой информацией, например с теми же описаниями для раздач?",
				"added": 1457465110
			},
			{
				"comment_id": 6,
				"body": "> [leinariys](#comment_43_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Да картинки по запросу грузятся + если настройка есть\n\nЭто понятно, я про большие блоки текста. Одно дело хранить сто тысяч магнет ссылок с названиями, а другое дело - еще и грузить описание к каждой раздаче.",
				"added": 1457477325
			},
			{
				"comment_id": 9,
				"body": "> [splitfire](#comment_138_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f): за плагин сразу НЕТ. Только начали избавляться от flash, java, так нет нас ничему история не учит, ибо кто будет:\n\nЯ имел в виду нативную поддержку, а не опциональную. Плагин в данном случае - это просто модуль, загляните в папку plugins, это я и имел в виду. Зря я упомянул слово плагин, потому что как это будет реализовано в коде - это технический вопрос и в общем дело десятое.\nДа и вообще, то, что мы тут теоретизируем никак не повлияет на то, как это будут делать. Надо уж тогда на англоязычной борде об этом писать.",
				"added": 1457537995
			}
		],
		"1_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": [
			{
				"comment_id": 3,
				"body": "Может немного оффтоп, и все же. Хорошо бы сделать так, чтобы по клику на никнейм открывалось что-то типа профиля с координатами - внутренней почтой, блогом если есть ит.д. Но видимо нужно ждать, пока разработчик допилит поддержку соцсетей.",
				"added": 1457464595
			}
		],
		"2_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 7,
				"body": "> [tempo](#comment_2_1RDjz1M273vR2UsAPQyd65Mamu23c6rrE): Ох, а как удалять свои сообщения? Думал что это возможно ибо читал про это.\n\nРедактировать  - кнопка слева от коммента, появляется при наведении курсора. При редактировании внизу есть кнопка delete.",
				"added": 1457525714
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 8,
				"body": "Возможность создания соцсетей - на очереди у разработчиков.",
				"added": 1457525823
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 11,
				"body": "> [netchaser](#comment_8_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): неа... не думаю... видишь ли сайты бывают разные... у одних по классике инфа статична, у других вытаскивается из БД по запросу. Те сайты у которых инфа статична могут пользоваться стандартным поиском аля сфинкс и хранить индекс в специальной БД...\n\nА сфинкс или его аналоги откуда возьмется, если сайты распределенные? Не на джаваскрипте же его писать.\n\n> [netchaser](#comment_8_1EZMwWn2rwtYz24pqL351j491QbyQcixfC): да и потом в плагин поиск запихнуть можно, но тогда вы получите некую монополию ) всё таки нельзя делать связи слишком сильными )\n\nЕсли это технология, причем с открытым доступом для всех, то какая же это монополия? По моему распределенная база данных - это единственный способ сделать полнотекстовый поиск по всей сети zeronet в стиле гугла. Иначе для того, чтобы загрузить местный гугл придется загружать все содержимое всех сайтов, чтобы потом локально (на своем компьютере, через js) в нем искать.",
				"added": 1457624720
			}
		],
		"4_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 12,
				"body": "> [jkepeer](#comment_3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): есть такая идея, сделать микро клиент к android,iOS который будет подгружать(прокси) контент с компа на котором установлен зеронет, есть смысл заворачиваться или уже есть?\n\nЕсть просто прокси в виде сайтов:\nhttp://bit.no.com:43110\nhttp://wrewolf.com:43110\nhttp://zero.pags.to:43110\nhttp://45.63.123.191:43110\nhttps://zeronet.classcoder.com",
				"added": 1457625359
			}
		],
		"1_1Kn7vDfQWK1M5Amu5sFK2EHEBr69Vvm1Ai": [
			{
				"comment_id": 13,
				"body": "Есть еще поисковики, в которых тыкая по random можно посмотреть сайты с тегами:\nhttp://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba\nhttp://127.0.0.1:43110/zerosearch.bit",
				"added": 1457625494
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 14,
				"body": "> [jkepeer](#comment_2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs): в этом и вопрос если уже есть, энтузиазма нет, а если нет то можно и попробовать\n\nВ местных поисковиках по слову \"music\" ничего не гуглится. Есть подозрение, что люди ждут, пока допилят поддержку загрузки больших файлов с нескольких источников по кусочкам, как в торренте. С другой стороны - mp3 не такие уж и большие.",
				"added": 1457626069
			}
		],
		"3_1JaAYJncF8JgK4obfPrc3Xppnc7FERVm2N": [
			{
				"comment_id": 16,
				"body": "Хорошо, что zeronet сюда не подпадает, т.к. не является средством обхода блокировок. Тут всё своё.",
				"added": 1458144267
			}
		],
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 17,
				"body": "> [kostanew](#comment_145_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Мне на почту сегодня ответили из bit.no.com, закрыли.\n\nА почему не сказали? Может копирасты наехали?",
				"added": 1458157124
			},
			{
				"comment_id": 18,
				"body": "> [kostanew](#comment_146_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): Дыру закрыли. Прокси сам работает.\n> А вот почему остальные прокси лежат, непонятно...\n\nА, ясно, я не правильно понял.",
				"added": 1458162567
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 19,
				"body": "Иногда захожу, проверяю. Жаль что в русскоязычном коммьюнити затишье. nofish вернулся из отпуска, надеюсь скоро будут обновления, и тут тоже будет оживление.",
				"added": 1469919944
			}
		]
	},
	"comment_vote": {
		"22_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"255_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": 1,
		"59_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"121_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF": 1,
		"212_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"209_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": 1,
		"65_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"152_14gGPfCHoaUU7PizjB6PaUmM6pZ5YV5H4f": 1,
		"92_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"94_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"98_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"114_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"69_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": 1,
		"149_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1,
		"150_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": 1
	}
}