{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "A politização inescrupulosa da pandemia por Trump e Bolsonaro",
			"body": "- https://invidio.us/watch?v=eGLzxGHsqgU\n- https://swarm-gateways.net/bzz:/c0b24a928d23ea906b28868824f00b12b1a59fada17296b7d407c09c8ec2f7da/A+Politiza%C3%A7%C3%A3o+da+pandemia+por+Trump+e+Bolsonaro+(V%C3%ADdeo)-eGLzxGHsqgU.mp4",
			"added": 1587152310
		},
		{
			"topic_id": 2,
			"title": "Coronavírus: o que está por trás da decisão de Donald Trump de suspender financiamento à OMS",
			"body": "#O anúncio do presidente dos Estados Unidos, Donald Trump, de suspender temporariamente a contribuição financeira de seu país à Organização Mundial da Saúde (OMS), enquanto investiga o papel do organismo internacional na atual pandemia de coronavírus, se materializou na terça-feira (14/04).\n\nMas não foi uma decisão que causou tanta surpresa.\nHá muito já se especulava que os ataques de Trump à OMS não se restringiriam apenas à retórica.\nOs EUA são o país que mais contribui para o orçamento do organismo multilateral baseado em Genebra, na Suíça. O Brasil também é um importante financiador da OMS, embora não tenha pagado sua contribuição em 2019 e 2020, conforme [revelou o blog do jornalista Jamil Chade no Uol](https://web.archive.org/web/20200414204530/https://noticias.uol.com.br/colunas/jamil-chade/2020/04/08/brasil-deve-r-169-milhoes-para-oms-divida-e-quarta-maior-da-agencia.htm).\nA dívida brasileira com a organização era de R$ 169 milhões até 31 de março, uma das maiores, segundo apontam documentos internos da OMS.\n\n#Mas o que motivou Trump?\nHá dois motivos principais, mas ambos envolvem a China, diz Barbara Plett-Usher, correspondente da BBC no Departamento de Estado dos EUA.\nPor um lado, o anúncio tem a ver, evidentemente, com o coronavírus.\nIntegrantes do governo Trump acusaram a OMS de ter cometido erros no tratamento da pandemia, dizendo que a organização foi influenciada pela China.\nEles alegam que a OMS apoiou o plano de ação do governo chinês, que subestimou o vírus, e que não o pressionou o suficiente em busca de informações.\nEm particular, o presidente Trump demonstrou descontentamento com as críticas da OMS à sua decisão de impedir a chegada de voos da China aos EUA.\nPor outro lado, acrescenta Plett-Usher, é parte de um esforço maior do governo Trump para reduzir a crescente influência global da China , especialmente em organismos internacionais.\nConforme noticiado pelo jornal americano The Wall Street Journal, a decisão procura pressionar a agência a contratar mais funcionários americanos.\n\"Instruo meu governo a interromper o financiamento enquanto uma investigação está sendo conduzida sobre o papel da OMS na má administração e encobrindo a disseminação do coronavírus\", disse Trump.\n\n\"A OMS falhou em seu dever principal e deve ser responsabilizada\", acrescentou.\n\"Muitos países disseram que escutariam a OMS e agora têm problemas\", disse Trump, que criticou a organização por não restringir os voos da China, onde o surto teve origem.\nO secretário-geral das Nações Unidas, o português António Guterres, reagiu à decisão de Trump e disse que \"agora não é a hora\" de cortar recursos para a OMS.\n\n#'Informação falsa'\nA decisão de suspender o financiamento da OMS ocorre num momento em que Trump está sendo alvo de críticas pela maneira com que lida com a crise nos Estados Unidos, o país com o maior número de mortos por covid-19.\nEm janeiro, pouco depois de assinar um acordo comercial com Pequim, o presidente dos Estados Unidos elogiou a China por conter o vírus.\nMas agora Trump questiona se o gigante asiático teria dito a verdade.\n\"O mundo recebeu todo tipo de informação falsa. Se a OMS tivesse ido à China para monitorar o surto, mais vidas seriam salvas\", afirmou o presidente.\n\"Sua confiança nos dados da China talvez tenha causado um aumento de 20 vezes no número de casos no mundo\", criticou, sem apresentar provas do que disse.\n\"Seus erros causaram muitas mortes\", acusou, e disse que a organização das Nações Unidas \"encobriu\" a gravidade do surto devido à sua suposta proximidade com a China.\n\"Se a OMS tivesse feito o seu trabalho de enviar especialistas médicos à China para avaliar objetivamente a situação in loco e criticar a falta de transparência da China, o surto poderia ter sido contido no foco com pouquíssimas mortes\", especulou Trump.\nTrump já havia acusado a OMS de colocar o politicamente correto acima de sua tarefa de salvar vidas e estar do lado da China, um país cuja transparência na pandemia foi amplamente criticada pelos Estados Unidos.\n\n#US$ 400 milhões\nEstima-se que os Estados Unidos sejam responsáveis por 15% de todo o financiamento da OMS. É o país que mais contribui, na ordem de US$ 400 milhões por ano.\nMas Trump também disse ter \"sérias dúvidas de que a generosidade dos Estados Unidos tenha sido usada da melhor maneira possível\".\nA contribuição da China em 2018-19 foi de quase US$ 76 milhões em contribuições obrigatórias e US$ 10 milhões em contribuições voluntárias, segundo o site da OMS.\nA organização pediu em março US$ 675 milhões para ajudar a combater a pandemia e deve pedir pelo menos US$ 1 bilhão agora.\nTodos os países-membros da ONU são obrigados a contribuir com o orçamento da OMS. Essa contribuição é proporcional à sua riqueza e à sua população.\n\n- Fonte: https://www.bbc.com/portuguese/internacional-52302892",
			"added": 1587152746
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"2_14ENvcp7USCpdNhDifXBkMhkVNmdmHikeB": [
			{
				"comment_id": 1,
				"body": "#Como se definem Direita e Esquerda? - Conceitos Históricos \n- https://invidio.us/watch?v=PAqZbDPXkXA\n- https://swarm-gateways.net/bzz:/ff9996a4ebc7f7f4a6ec0db4e7c5ccedb494a974bad50107e69914aa43e008f0/Como+se+definem+Direita+e+Esquerda?+-+Conceitos+Históricos-PAqZbDPXkXA.mp4\n\nAtualmente, os conceitos de direita e esquerda no Brasil (ainda que não apenas aqui) estão entre aqueles que são mais distorcidos de forma leviana com fins políticos e ideológicos, a ponto de algumas pessoas distorcerem a própria História por conta dos equívocos gerados pela falta de entendimento a respeito das definições clássicas desse conceito. Isso cria graves problemas de ordem moral, que apenas pioram um contexto social já bastante polarizado, no qual vivemos e que nos afeta diretamente em nossas relações sociais. O vídeo tenta colocar algumas coisas em seus devidos lugares.\n\n#LIVRO-BASE DO VÍDEO: [\"Direita e esquerda: razões e significados de uma distinção política\", de Norberto Bobbio](https://gateway.pinata.cloud/ipfs/QmNi7rQ3vNoABZXTE55rk5pyWC2mboaDGfAW6AEfY6iyFf/Norberto%20Bobbio%20-%20Direita%20e%20Esquerda_%20Razoes%20e%20Significados%20de%20uma%20Distincao%20Politica.%201-Editora%20da%20Universidade%20Estadual%20Paulista%20%28UNESP%29%20%281995%29.pdf)",
				"added": 1587132539
			},
			{
				"comment_id": 2,
				"body": "#O \"economicismo\" e a manutenção de privilégios no Brasil \n- https://invidio.us/watch?v=9SbJ3i2xzOU\n- https://gateway.pinata.cloud/ipfs/QmVgrTLfcjYu85yz3b8TmDchvwELcFDSJvT8tofXMYpje6\n\nO vídeo discute o conceito de \"economicismo\", no que concerne a uma forma de enxergar os problemas da sociedade a partir de um prisma puramente econômico, e mostra em termos gerais como se dá a manutenção de privilégios na sociedade brasileira.\n\nEste vídeo está plenamente ancorado na introdução do livro [\"A ralé brasileira\", do sociólogo brasileiro Jessé Souza](https://gateway.pinata.cloud/ipfs/QmPs6pxMuqZz6S9woECJzZg2Cpr6JqCdwojngMUG8fL77A/Livros%20de%20Jess%C3%A9%20Souza/A%20Ral%C3%A9%20Brasileira%20%E2%80%93%20Jess%C3%A9%20Souza.pdf).",
				"added": 1587133223
			},
			{
				"comment_id": 3,
				"body": "#O Brasil \"deu ERRADO\" por ser \"colônia de EXPLORAÇÃO\"? \n- https://invidio.us/watch?v=EL9DsgRbUiI\n- https://gateway.pinata.cloud/ipfs/QmfEtRSxGCjDD1WuQxZXGHLgbHs23YdZVBoMXP5vzoCXyw\n\nCom certeza você já ouviu várias vezes aquela história de que os Estados Unidos \"deram certo\" porque foram uma \"colônia de povoamento\", enquanto o Brasil \"deu errado\" por ser uma \"colônia de exploração\". Será mesmo?",
				"added": 1587133776
			},
			{
				"comment_id": 5,
				"body": "#REVISIONISMOS sobre a Ditadura Militar\n- https://invidio.us/watch?v=11QgN3IYORc\n- https://swarm-gateways.net/bzz:/58230f68df2fafdc2444dbe6df9359daf6c2c8254afe8b7da319e876609a2270/REVISIONISMOS+sobre+a+Ditadura+Militar+-+História+FM+003-11QgN3IYORc.mp4\n\n\"No terceiro episódio do podcast do Leitura ObrigaHISTÓRIA convidados dois estudiosos sobre a Ditadura Militar no Brasil para falar sobre alguns dos argumentos revisionistas mais recorrentes nas discussões contemporâneas sobre esse período sombrio da história brasileira recente. Foi golpe ou revolução? O congresso deu anuência ao processo e a seu próprio fechamento, dentro da legalidade? Não houve tortura? As memórias dos militares são uma \"verdade sufocada\"?\"\n\nERRATA: no trecho em que o Ricardo fala em \"estado de sítio\", o correto era \"estado de beligerância\".\n\n#LIVROS RECOMENDADOS:\n- Cláudio B Vasconcelos: Repressão a militares na ditadura pós-1964\n- Carlos Fico: O grande irmão\n- Carlos Fico: História do Brasil Contemporâneo\n- Pedro H. P. Campos: Estranhas Catedrais\n- Demian Melo (org): A miséria da historiografia",
				"added": 1587136796
			},
			{
				"comment_id": 6,
				"body": "#Idade Média: o que você aprendeu errado?\n- https://invidio.us/watch?v=VOEwufsPowY\n- https://swarm-gateways.net/bzz:/0f1a60e8a1af8d3ebdf869311905019ef3e5623c25e9e78e06e17be80dc1d7d1/Idade+Média:+o+que+você+aprendeu+errado?+-+História+FM+002-VOEwufsPowY.mp4\n\n\"No segundo episódio do podcast do Leitura ObrigaHISTÓRIA, trazemos medievalistas para discutir sobre o senso comum a respeito da Idade Média. De um lado, sujeitos que tratam o período como uma era de ouro difamada; do outro, sujeitos que demonizam o período como uma das piores épocas da história da humanidade. No entanto, como sempre, a história é muito mais complexa do que isso! Igreja, sexo, sexualidade, Cruzadas, oriente, Cristianismo, Islamismo, entre outros temas, são trazidos a tona.\"\n\n#LIVROS RECOMENDADOS:\n- Patrick J. Geary: O mito das nações: a invenção do nacionalismo\n- Alain de Libera: Filosofia Medieval\n- Leandro Rust: Bispos Guerreiros: violência e fé antes das Cruzadas",
				"added": 1587137377
			},
			{
				"comment_id": 7,
				"body": "#O que é Feudalismo - Conceitos históricos \n- https://invidio.us/watch?v=u2AJdkIis7k\n- https://swarm-gateways.net/bzz:/1d1e9b44d5815b34138eba4d8be0869bead085cb652832546d38bda69114570a/O+que+é+Feudalismo+-+Conceitos+históricos-u2AJdkIis7k.mp4\n\n#Bibliografia:\n- BOBBIO, N.; MATTEUCCI, N.; PASQUINO, G. (org). Dicionário de política.\n- LE GOFF, J. SCHMITT, J.C. (org). Dicionário temático do ocidente medieval.\n- LOYN, H.R. Dicionário da Idade Média.\n- SILVA, Kalina V., SILVA, Maciel. H. Dicionário de conceitos históricos.\n- BLOCH, Marc: A sociedade feudal\n- DUBY, George: As três ordens ou o imaginário do Feudalismo",
				"added": 1587137838
			},
			{
				"comment_id": 8,
				"body": "#Anacronismo, sincronia, diacronia e porque a história não se repete \n- https://invidio.us/watch?v=WjUOCaY4GLI\n- https://swarm-gateways.net/bzz:/4db39e120d0f5df8c807ee49ac26dc42f5f39bb014c111fec382b5abb5a13a54/Anacronismo,+sincronia,+diacronia+e+porque+a+história+não+se+repete-WjUOCaY4GLI.mp4\n\n#LINKS CITADOS NO VÍDEO:\n\n- Escravos africanos e o tráfico atlântico: história \"policamente correta\": https://web.archive.org/web/20191220204508/https://xadrezverbal.com/2014/02/28/escravos-africanos-e-o-trafico-atlantico-historia-politicamente-incorreta/\n\n- \"Nazismo de esquerda\" e a economia alemã na década de 1930: o problema com os conceitos: https://web.archive.org/web/20191130133716/http://leituraobrigahistoria.blogspot.com/2016/03/nazismo-de-esquerda-e-economia-alema-na.html\n\n- Negros, portugueses e a Batalha de Isso: anacronismo e escravidão na Península Ibérica medieval: https://web.archive.org/web/20200417154237/http://leituraobrigahistoria.blogspot.com/2016/04/negros-portugueses-e-batalha-de-isso.html\n\n- Sobre as comparações entre fascismos e comunismo: https://web.archive.org/web/20200417154417/http://leituraobrigahistoria.blogspot.com/2016/06/sobre-as-comparacoes-entre-fascismos-e.html",
				"added": 1587139190
			},
			{
				"comment_id": 9,
				"body": "#Marighella: o guerrilheiro que incendiou o mundo\n\n- https://ia903103.us.archive.org/1/items/historiafm_marighella/historiafm_marighella.mp3\n\n- https://swarm-gateways.net/bzz:/b222e5876c2c7ba3f00ce82e263086315e3d834a3595c059c373f16fa7cf0a58/historiafm_marighella.mp3\n\n\"No episódio de hoje convidamos o autor Mario Magalhães para conversar sobre o Carlos Marighella, ex-deputado, fundador do grupo armado Aliança Libertadora Nacional e inimigo N° 1 da Ditadura Militar no Brasil. Mario fala sobre sua pesquisa de nove anos a respeito da vida de Carlos Marighella, desde a infância na Bahia até sua execução em São Paulo. Conversamos também sobre as polêmicas recentes envolvendo o filme “Marighella” dirigido por Wagner Moura e sobre a cor do protagonista em relação a Seu Jorge, seu intérprete.\"\n\n#LEITURAS RECOMENDADAS:\n- Mario Magalhães: Marighella: o guerrilheiro que incendiou o mundo\n- Mario Magalhães: Sobre lutas e lágrimas: uma biografia de 2018\n- Chimamanda Ngozi Adichie: Hibisco Roxo",
				"added": 1587141302
			},
			{
				"comment_id": 10,
				"body": "#China VS Hong Kong: história de um impasse\n\n- https://ia601406.us.archive.org/0/items/china_hongkong_historiafm/china_hongkong_historiafm.mp3\n- https://swarm-gateways.net/bzz:/7e3857689b200b39b40747c85ebbb8f95a9b9905d7d7fb7e16e228e009f7357d/china_hongkong_historiafm.mp3\n\n\"No episódio de hoje convidamos o historiador e mestre em História Luis Fernando Junqueira para falar sobre a história de Hong Kong, sua relação indissociável com a história chinesa, os conflitos, impasses e problemas nessa relação, baseados principalmente no comportamento do governo chinês.\"\n\n#LEITURA RECOMENDADA:\n- Jonathan D. Spence: The search for modern China\n\n#FILMES RECOMENDADOS:\n- O último imperador (1988)\n- Adeus, minha concubina (1993)",
				"added": 1587147536
			}
		],
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 4,
				"body": "#O fim da União Soviética: da desestalinização ao colapso\n- https://archive.org/download/historiafm_fim_urss/historiafm_fim_urss.mp3\n- https://swarm-gateways.net/bzz:/48ec2f572cb082d25d4af032531f9d2dbd72e08d6913c8e9539362fdb8ed2887/historiafm_fim_urss.mp3\n\n\"No episódio de hoje convidamos o historiador Angelo Segrillo para conversar sobre o fim da União Soviética, processo este que ele pôde estudar com fontes locais. A conversa contempla desde o discurso secreto de Krushchev em 1956 à oficialização do fim da URSS em 1991, pincelando memórias recentes sobre o passado soviético.\"\n\n#LEITURAS RECOMENDADAS:\n- Angelo Segrillo: O Declínio da União Soviética\n- Angelo Segrillo: De Gorbachev a Putin\n- Angelo Segrillo: Os Russos\n- Mikhail Gorbachev: Perestroika\n- David MacKenzie & Michael W. Curran: A History of Russia, the Soviet Union, and Beyond",
				"added": 1587135611
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 11,
				"body": "#Redes Livres\n- https://www.redeslivres.org.br/\n\n“Imagine um meio de comunicação em que você e seus vizinhos estão interconectados e todos podem trocar arquivos em alta velocidade com anonimato e segurança; falar gratuitamente através de telefonemas, mensagens e bate-papos; transmitir canais locais de rádio e TV; mapear, trocar e divulgar serviços do bairro através de sites, wikis e outros serviços que ficam hospedados em seus próprios servidores.\nE a partir dessas ferramentas todas, a vizinhança local poderia realizar pesquisas, abaixo-assinados, consensos, votações, até agendar encontros físicos para se conhecer.\nE tudo isso funcionando sem depender da estrutura da internet, mas podendo, também, ser acessado ou oferecer o acesso a ela”",
				"added": 1587150535
			}
		],
		"1_12bpcgBZapJxQQvk6USaEhVLFaTmqK2tvQ": [
			{
				"comment_id": 12,
				"body": "#A politização inescrupulosa da pandemia por Trump e Bolsonaro\n- https://invidio.us/watch?v=eGLzxGHsqgU\n- https://swarm-gateways.net/bzz:/c0b24a928d23ea906b28868824f00b12b1a59fada17296b7d407c09c8ec2f7da/A+Politização+da+pandemia+por+Trump+e+Bolsonaro+(Vídeo)-eGLzxGHsqgU.mp4",
				"added": 1587152243
			},
			{
				"comment_id": 13,
				"body": "> [lindishe](#comment_12_15EBpr2PMGy1LdUcM6w1uBrQp7zrko64wn): A politização inescrupulosa da pandemia por Trump e Bolsonaro\n> \n> https://invidio.us/watch?v=eGLzxGHsqgU\n> https://swarm-gateways.net/bzz:/c0b24a928d23ea906b28868824f00b12b1a59fada17296b7d407c09c8ec2f7da/A+Politização+da+pandemia+por+Trump+e+Bolsonaro+(Vídeo)-eGLzxGHsqgU.mp4\n\n#Coronavírus: o que está por trás da decisão de Donald Trump de suspender financiamento à OMS\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:2_15EBpr2PMGy1LdUcM6w1uBrQp7zrko64wn/Coronav+rus+o+que+est+por+tr+s+da+decis+o+de+Donald+Trump+de+suspender+financiamento+OMS",
				"added": 1587152914
			}
		],
		"1_14kWLEqcu7S3GEc1HVMCGCQ6Cump23f2Lw": [
			{
				"comment_id": 14,
				"body": "#HACKERS VAZAM MAIS DE 5.000 ESTUDOS SOBRE O CORONAVÍRUS QUE ESTÃO SOB PAYWALL\n\n- https://www.reddit.com/r/DataHoarder/comments/exdka0/the_coronavirus_papers_unlocked_5352_scientific/\n\n- https://web.archive.org/web/20200415181443*/https://www.reddit.com/r/DataHoarder/comments/exdka0/the_coronavirus_papers_unlocked_5352_scientific/\n\nAté recentemente, esses estudos estavam por trás de um paywall. Se você quisesse acessar algum desses trabalhos científicos sobre o coronavírus, você deveria pagar, em alguns, até US$ 36,00 por paper.\n\nUm usuário do Reddit achou absurdo ter que pagar para ter acesso a esse conhecimento em tempos de pandemia. Então, ele ignorou o Paywall e publicou mais de 5.000 papers de pesquisa científica sobre o coronavírus que foram publicados entre 1968 e 2020 e todos agora estão disponíveis gratuitamente.\n\n#Link [IPFS](https://ipfs.io/): https://ipfs.io/ipfs/bafykbzaced4xstofs4tc5q4irede6uzaz3qzcdvcb2eedxgfakzwdyjnxgohq/",
				"added": 1587157388
			},
			{
				"comment_id": 15,
				"body": "#Estudo mostra que o novo coronavírus não foi criado em laboratório e nem manipulado propositalmente\n\nPesquisadores de universidades dos Estados Unidos, Austrália e Reino Unido constataram que o SARS-CoV-2, nome técnico do novo coronavírus, surgiu a partir de processos naturais, resultado de seleção natural. As conclusões da [pesquisa](https://swarm-gateways.net/bzz:/3db0234b86b9690689e360b56d416219121b3b3fb990d2e4e559bafd988489ab/10.1038@s41591-020-0820-9.pdf), publicada na renomada revista [Nature Medicine](https://doi.org/10.1038/s41591-020-0820-9), descartam as teses de que a doença teria nascido na bancada de alguém mal intencionado.\n\n\"Nossa análise claramente mostra que o SARS-CoV-2 não é uma construção de laboratório ou um vírus manipulado propositalmente\", escreveu a equipe de cinco cientistas.\n\n#Participaram da pesquisa:\n\n- Andrew Rambaut, professor de evolução molecular da Universidade de Edimburgo;\n- W. Ian Lipkin, professor de epidemiologia da Universidade de Columbia;\n- Edward C. Holmes, professor de biologia evolucionária da Universidade de Sydney;\n- Robert F. Garry, professor da Universidade de Tulane.\n- Kristian Andersen, professor associado de imunologia e microbiologia do Scripps Research\n\nFonte: https://web.archive.org/web/20200404041833/https://www.uol.com.br/tilt/noticias/redacao/2020/03/18/nem-china-nem-eua-coranavirus-nao-foi-criado-em-laboratorio-mostra-estudo.htm\n\n\n",
				"added": 1587168825
			}
		]
	},
	"comment_vote": {}
}