{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Coronavirus Challenges Freedom of Breath",
			"body": "Coronavirus Challenges Freedom of Breath\n冠状病毒挑战，人类需要创新\nInnovation, Courage and Gratitude\n— 创新在于勇气、创新在于感恩！\n— Challenges by the Novel Coronavirus(nCoV)\n\n**One may live without speech, but no one can live without breath!\n您可以不说话，但您不能不呼吸! ** \n2020年的冠状病毒变异正在给人类文明带来前所未有的挑战。\nThe human civilization is threatened by the unprecedented challenges posed by the novel Coronavirus in 2020. \n\n病毒，无生命、却有灵性的独特物质，人类肉眼无法识别。其身形之微小精巧，可用先进芯片的纳米级别来衡量；其变化多端之形态，却又超过任何人工智能产品。\nAs inanimate and unique substances, viruses cannot be recognized by the human eye.  The subtlety of its tiny size is similar to the nano level sophistication of advanced chips; yet the diversities of its shape exceed any artificial intelligence product. \n\n有生命的地方，就有病毒存在。作为一种独特的基因碎片，病毒比生命细胞更小，可穿过细胞壁垒。病毒自身没有新陈代谢，不会自动繁殖，但是一旦宿主的生命环境发生变异，病毒就会通过大量的细胞进行复制繁殖。\nWhere there is life, there is a virus. As a unique genetic fragment, the virus is smaller than living cells and can pass through cell barriers. The virus itself has no metabolism and does not multiply automatically, but upon mutation of the host's biological environment, virus replicates and reproduces through a large number of cells.\n\n并非所有病毒都是恶性的，也有好的病毒，比如包括人类在内的哺乳动物， 其胎盘是由病毒感染引发的进化而造成。婴儿血型可以与母亲不一样，但是在带有病毒变异的胎盘保护下，母亲的身体免疫力不会去攻击与母体血型不一样的胎儿。\nNot all viruses are malignant. There are good viruses, for example, the placenta of human beings and other mammals, is produced in the process of evolution triggered by viral infection. An infant's blood type can be different from the mother's, but under the protection of placenta, the mother's physical immunity will not attack the fetus with different blood type.\n\n有生命，就有病毒；就如同有法律，就有漏洞。当有人试图过度扭曲自然环境时，病毒就会在特定时期出现，对人类的过度行为予以矫正、甚至惩罚。\nAll creatures are accompanied with virus; just as loopholes associated to law and order.  However, if there's over-excessive distortion of the natural environment, special virus may emerge at certain periods, correcting the course of civilization, or even punishing the excessive behavior of human beings.\n\n即使信息文明高度发达，人类对人体之外的很多病毒还是很陌生。武汉肺炎在大范围传播时，仍然有一些人搞“万家宴”的娱乐酒席，这部分群体中，相当一部分已经后悔来不及！\nEven though the information technology is highly developed, there are still many viruses unknown for human beings.  When Wuhan pneumonia spread on a large scale, some atheism-minded people still held the Carnival of Wan Jia Yan (Joint Banquet of Thousands of Families). Many of them were infected. It's too late for them to regret!  \n敬畏生命、敬畏自然法则的人们，对生命和病毒的独特奥秘持有更加神圣的态度，才能够更好地保护好个体生命，抵御病毒的入侵。\nPeople who respect life, law and order, will keep sacred attitude to the unique mysteries of life and viruses, so they can better protect themselves and resist the invasion of viruses.\n\n彻头彻尾的、绝对意义上的“无神论”信徒是不存在的，只要他不敢否认有“精神”存在，那么他就无法否认每个人的“精神”空间里都存在着或多或少的“神圣”的情感 — 这种“神圣”的情感，无论是在工作层面的，还是生活层面的，总是伴随着每个生命。 而只要有“神圣”的精神空间存在，就有“神灵”的属性存在于他的精神空间。 对于这一点，共产主义的鼻祖马克思非常雄辩，但也犯错误，即使他不信上帝，而是信仰撒旦魔鬼，撒旦魔鬼也仍然属于邪恶色彩的“神灵”，与“无神论”是自相矛盾的。\n**There are no absolute atheists, for one simple reason — if they can’t deny the fact that each individual has a certain sense of \"holy space\" in their soul, which may be related either to the \"sacred\" love of their loved ones,  or the \"holy” passion of their occupation, then they can't deny the fact that there’s a certain sense of \"holy” God image in their soul. This can be taken as a simple \"scientific” logic, a common sense, without the need of large scale of geometry formulas to prove the logic. ** \n为了保护每个生命个体都拥有的的“神圣”灵魂空间，需要尊重生命、尊重持枪权的普世原则规范社会运作。\nTo protect the universal sense of Holy Image of God in everyone's soul, there’d be the universal principle that respects gun rights and human rights. \n\n在信息科技步入纳米级别的时代，如何把科技创新更好地用于社会体系的运作，尽量减少环境破坏，避免病毒泛滥，是21世纪的人类无法回避的话题。而面对这个问题，首先需要越来越多的人们从过度娱乐化的气氛中觉醒，敬畏生命、常怀感恩的同时，携手努力，融合东西方文明创新，消除破坏公平正义的文化毒瘤，让持枪权和尊重生命的文化信仰有力结合，法治的光辉普照大地！\nIn the era of nano-level information technology, it's a mission for mankind to apply scientific innovations on better management of the society in 21st century, to reduce the distortion of environment, curb down the spread of viruses.  More and more people will be awakened from the excessive entertainment atmosphere, keep gratitude and respect of life. Through joint efforts by both the West and the East, get rid of the poisonous viruses that distort law and justice, promote the principle that respects gun rights and individuals' lives, with glorious Rule of Law shining on Earth!",
			"added": 1596897431
		},
		{
			"topic_id": 2,
			"title": "The Secrets Behind Coronavirus …  新冠病毒的黑幕  1)  ",
			"body": "The Secrets Behind Coronavirus …   \n\nVarious phenomena indicated that the coronavirus is very probably produced by the atheism gang in East Asia on purpose, either as a bioweapon against the civilized world, or leaked out of their P4 laboratory due to corruptive system. \n\n#**1) The issue of different attitudes on Coronavirus and the Trap of Atheism **\nWhy some people still organized “Covid party”, despite the fact that the virus killed many people quickly (  https://www.nytimes.com/2020/07/12/us/30-year-old-covid-party-death.html  ) ? \n\nIt’s due to the over-entertaining environment that has partially eroded ** the corner of American culture — Puritan Christendom **. \n\n## **1.1) The Trap of Atheism ** \nThere are no absolute atheists, for one simple reason — if they can’t deny the fact that each individual has a certain sense of \"holy space\" in their soul, which may be related either to the \"sacred\" love of their loved ones,  or the \"holy” passion of their occupation, then they can't deny the fact that there’s a certain sense of \"holy” God image in their soul. This can be taken as a simple \"scientific” logic, a common sense, without the need of large scale of geometry formulas to prove the logic.\n彻头彻尾的、绝对意义上的“无神论”信徒是不存在的，只要他不敢否认有“精神”存在，那么他就无法否认每个人的“精神”空间里都存在着或多或少的“神圣”的情感 — 这种“神圣”的情感，无论是在工作层面的，还是生活层面的，总是伴随着每个生命。 而只要有“神圣”的精神空间存在，就有“神灵”的属性存在于他的精神空间。 对于这一点，共产主义的鼻祖马克思非常雄辩，但也犯错误，即使他不信上帝，而是信仰撒旦魔鬼，撒旦魔鬼也仍然属于邪恶色彩的“神灵”，与“无神论”是自相矛盾的。\nTo protect the universal sense of Holy Image of God in everyone's soul, there’d be the universal principle that respects gun rights and human rights.\n为了保护每个生命个体都拥有的的“神圣”灵魂空间，需要尊重生命、尊重持枪权的普世原则规范社会运作。\n\n## **1.2) The Atheism Gang behind the \"CCP\" ** \nThe \"CCP” who spread the virus on purpose should be better defined as the Atheism Gang \"伪共” \"匿产帮”, as explained in another message. \n\n [New Approach to Revolution，Liberate Hong Kong 推翻黄俄暴政！ ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/) \n\n[Some special information on Coronavirus ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Some+special+information+on+Coronavirus) \n\n(.. To continue )",
			"added": 1596898452
		},
		{
			"topic_id": 3,
			"title": "Donald Trump is not the worst ...",
			"body": "After the brutal Hong Kong security law marched into the civilized world, Hong Kong's cyberspace may collapse.  \n\n**Blessed by the constitutional system on Gun Rights and Human Rights, America’s internet will not collapse so easily.  **\n\nIt seems that due to the brutal GFW system that covers too many terrible facts, quite many ordinary people in the USA don’t see the dangerous toxicity of Coronavirus.  That’s why some people still organized **“Covid party”, which killed them quickly ** (  https://www.nytimes.com/2020/07/12/us/30-year-old-covid-party-death.html  )\n\nEven the merchant-minded President Donald Trump underestimated the poisoning power of the GFW.  Trump refused to wear masks in public, but Vice President Mike Pence insisted on wearing masks. Finally Donald Trump had to change his mind.  \n\nSo several months after Covid19 outbreak in the USA, Donald Trump finally **put on face masks** in July. \nhttps://www.bbc.com/news/world-us-canada-53378439   \n** Coronavirus: Donald Trump wears face mask for the first time ** \n\n##**Data Kills **\n**Data don’t kill people directly. Those who maneuver data improperly may kill many people. **\nAt the early stage of Covid19 pandemics, Taiwanese President Tsai Ing-wen sent messages to the USA that **the toxicity of Wuhan virus is very dangerous**.  But that important message was ignored by some politicians. \n\n\nLeaders who underestimate the trend of data development **don’t murder people directly**, but the wrong signal produced by the malfunction of data analysis may result in wrong actions by many ordinary people. \n\n## **Donald Trump is NOT the worst … ** ## \n**Apparently, Donald Trump is not a great leader, especially at the unprecedentedly–severe stage of history with highly-poisonous pandemics going out of control!   However, this message won’t put all the blames on Trump, since Donald Trump is still NOT the worst choice for American people.  Compared with other candidates, Donald Trump doesn’t have too complicated business relationships with East Asia, which is heavily polluted by the terrible virus produced by the atheism gang. **  \n\nThe fact is that despite many people being awakened up by the dangerous situation, which harms  America's finest tradition that respects Gun Rights and Human Rights, \nInvestigations Into The \"Bill & Melinda Gates Foundation\" For Medical Malpractice & Crimes Against Humanity \nhttps://petitions.whitehouse.gov/petition/we-call-investigations-bill-melinda-gates-foundation-medical-malpractice-crimes-against \nthe situation of cyberspace monopolized by Google, Microsoft can’t be changed in short time.  \n\nEven Donald Trump’s fighting against those \"fake media\" can’t change this situation quickly. \n## ** So what will happen if America’s internet is also collapsed? ** \n\nIn such case, the decentralized website of Zeronet https://zeronet.io/ will serve as a good solution for people to transmit revolutionary messages. With Bitcoin cryptography, the safety is higher than Telegram.  As an innovation of web technology, there's not any censorship, even NO SMS verification process is required as incurred on Telegram.  The new Peer-to-Peer data transmission will be a new tide of cyberspace revolution. \n\n\n## **Users can make quasi-administrator’s customization of ZeroNet … **\nFull details are available at the below URL:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1596087920_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/+quasi+administrator+s+customization+of+ZeroNet \n** 零網用戶的准管理員操作 **\n(Important note: The URL with the special beginning http://127.0.0.1:43110  should be opened by Zeronet App  https://zeronet.io/ ,  ) \n\n### ** Photo Illustration for New Users **\nhttp://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:3_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ \n\nAnother ZeroNet webpage for reference:\n### ** Liberate Hong Kong, Revolution of Our Time — New Approach to Hong Kong Peace Revolution ** \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/ \n\nRemarks:\n1) More details about Zeronet:\n1.1) On ZeroNet, all webpages start with the special URL  \nhttp://127.0.0.1:43110/ \nThe code 43110 represents the port used for secure data transmission by Bitcoin-encrypted technology. \n1.2) All zeronet webpages can be easily accessed, only after Zeronet app is launched on user’s equipment. \nThere’re different versions of Zeronet, for different system environments such as Windows, macOS, Linux, Android, etc. \nFull details of which are available in the below URL\nhttps://github.com/HelloZeroNet/ZeroNet#user-content-how-to-join \n\nPlease choose the version of Zeronet suitable for the system environment of your equipment. \n\nBefore visiting ZeroNet webpage \nhttp://127.0.0.1:43110/ \n** Zeronet app should be launched in your equipment at first. **",
			"added": 1597038048
		},
		{
			"topic_id": 4,
			"title": "Chances for Donald Trump — The Biggest Enemy ..",
			"body": "## The Biggest Enemy of Donald Trump …\n                                       —\tPeace for America \n\nThe Biggest Enemy of Donald Trump is neither Joe Biden, nor the dictator Xi Jin Ping — the hooligan leader of the atheism gang in Asia, but **the capricious mentality of Trump himself**. \n\nThe Biggest Enemy of Joe Biden is not Donald Trump either, but Biden's distorted pursuit of wealth that involves very complicated business relationships with East Asia, which may ultimately result in some people finally to be charged with   ** \"treason\" against America **. \n\nSome capricious words and behaviours by Trump did incur troubles against many people, and against Donald Trump himself.\n\nHowever, some of his remarks hold reason, and should be treated seriously. \n\"If I don't win the election, China will own the United States — you will have to learn to speak Chinese!\" Trump said.\nhttps://www.businessinsider.com/trump-says-americans-will-learn-to-speak-chinese-loses-biden-2020-8\n\n###**To have to learn Chinese? That’s just a minor point!! **\n\nIf America is totally polluted by the atheism virus, with American society ruled like the atheism gang as that in East Asia, with the so-called term \"Chinese Model\", then the number of **infected patients** would be tremendously reduced immediately (**highly possible to be “Zero” infection**), NOT due to good vaccines developed in time, but due to **media control that forbids report of any negative news** which may harm the dictatorship by the atheism gang!\n\nFurthermore,  in order to protect the glory of the ruling party, the facts that hundreds of thousands of patients died of Covid19 would not be reported either, maybe just with a few cases allowed to be reported, so as to accompany the propaganda on the ruling party's care on its own people! \n\n###The large number of people who perished would be totally silenced down, just like former whistle-blower Chinese Doctor Lee Wen Liang, besides millions of other people … \n( about 20 million mobile users disappeared by the end of March  https://www.epochtimes.com/gb/20/3/23/n11965551.htm ) \n\nThe above is just the consequences that can be seen, then there will be many **indescribable, unreported consequences**, such as organ harvest, with healthy people disappeared thoroughly in the world, while organ transplant business going bustling in various hospitals … \n\nThe notorious GFW has covered too many facts of cruel truth unknown by ordinary people in the USA.  The merchant-minded President Trump, apparently not with vicious purpose to cover the truth, but with some money-worship mind just in order **to keep the stock market from panic**, pretended not to see the danger of coronavirus, and just called it a variation of common flu.  It caused confusion in the society, and reduced the vigilance of the majority of American people.  USA failed to take precautious measures like Taiwan did, and the virus spread went out of control.  Due to over-preference on the stock market performance than the safety of people’s lives, Trump's mistake led to contrary results, with big plunge of stock market that may trigger other troubles as well.\n\nTrump's mistake can be termed as **a serious negligence** of his presidency work. \n\nCompared with other crimes such as **treason against America**, Trump's mistake is not so serious.  \n\nIn short, due to the coronavirus spread too wide, Donald Trump is certainly not a great leader, however, **he will NOT be the worst one**  in America's history.  \n\n##In fact, Donald Trump is himself a victim of the virus. \nHe simply underestimated the poisoning power of the GFW, which covered too many true death polls in East Asia that were unimaginable even for ordinary Chinese people, not to mention American netizens. \n\nSome of the technocrats who gave advanced technology and equipments to the atheism gang in China should be more seriously blamed or punished, since **they did it on purpose**. **It’s more vicious than Trump’s mistake**. \n\nThings are improving.  Police is banned from putting a knee to a person's head or neck \nhttps://edition.cnn.com/2020/07/09/us/schenectady-police-officer-knee-on-man-video/index.html \n\nSeveral months after Covid19 outbreak in the USA, Donald Trump finally put on face masks in July.\nhttps://www.bbc.com/news/world-us-canada-53378439 \n\nThanks to the powerful constitution system, no leaders can distort America's society at their will. After many troubles were caused by his own capricious words and behaviours, Donald Trump continues to grow on his first presidency. \n\nHis mistake doesn’t go so far as treason against American people. Since he is not the worst choice, Donald Trump deserves people’s support for a second presidency.  \n\n**It’s not because so many people love him, just because he is NOT the man who deserves the deepest hate by people living on this planet …  **",
			"added": 1597587542
		},
		{
			"topic_id": 5,
			"title": "User-level moderation — Zeronet long term operation ",
			"body": "Inspired by the idea of \n[User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine), there can be some further fine—tuning functions to transform those vicious spammers into good citizens, at the same time, reduce the unnecessary burden of adding new quota of additional 50K to enthusiasts who **truly love the freedom of uncensored speech**. \nTo keep long-term prosperity of any community, either in physical world, or in the virtual cyberspace, there is the necessity to promote the good, to punish the vicious. \n\nThere can be **a progressive style of management on the allocation of data space** for users on Zeronet. \n\nFor example, \n##A) To promote the good \n1) For users who often post good messages, with little use of curse words, vulgar content, when 50% of the default 50K space is consumed, the 50K limit will be automatically upgraded to be 100K. \n2) Then, when 50% of the default 100K space is consumed, if there’s still very little use of curse words or vulgar content, the 50K limit will be automatically upgraded to be 500K, or 1 MB, even more. \n\nSince by simple scientific logic, there’d be **no worry that such kind of users will do things to harm the prosperity of Zeronet ... ** \n\n## B) To punish the vicious \n1) For users who often post derogatory messages, with frequent use of curse words, vulgar content, when 10% or 25% of the default 50K space is consumed, the 50K limit will be automatically downgraded to be 40K. \n2) Then, when 50% of the 40K space is consumed, if there’s still frequent use of curse words or vulgar content, the 40K limit will be automatically downgraded to be 30K (or some other measures ... ) \n3) When there is only about 1 or 2 KB of data space left for such users, if the frequency of curse words has been reduced, then there’d be chance for them to enjoy about 3 or 5 KB of additional space in **a certain period** (say every two weeks or per month … )   \n\nBy scientific logic, **such style of management will transform vicious mentality gradually. **\n\nThe above is just some new ideas inspired by the \n[User-level moderation ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597847864_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq/Should+user+level+moderation+be+implemented+in+ZeroTalk+engine) \n\n**If there’re other ideas that’d help keep long term prosperity of Zeronet, please don’t hesitate to share! ** \n\n###Additional information:\nSome of the ideas are hypothesis based on the logic of computer programming.  As **human behaviours may be very complicated at certain stage of history**, so the other function \n[Pin comments to the top ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/New+Functions+on+ZeroNet) \n will be easier to be realized in short term, and it can benefit the prosperity of Zeronet on long term. \nAs to the above hypotheses, Part A) to promote the good will be easier to be implemented, Part B) may involve more complicated operation. It can be used as information for reference … \nThe implementation of Part A), besides the [Pin comments to the top ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597641256_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/New+Functions+on+ZeroNet), will **surely enhance Zeronet’s long term prosperity**. \n\nAnother historical phenomenon that deserves attention is about the constitutional gun rights in America. 200 years ago, gun rights were very special privileges among a small percent of the people.  Accompanied by liberation of black slaves, and the movement of women’s suffrage, gun rights were gradually populated among ordinary people. \n\nSo the special constructure of a system can be important. The implementation of the system depends on the changing circumstances of the reality … \nPerfect solution can’t be achieved at one stroke.  Things go stage by stage.  Let history witness the emerging innovations … ",
			"added": 1597907960
		},
		{
			"topic_id": 6,
			"title": "ShadowGate — An Unprecedented Exposure at the Sensitive Season",
			"body": "The Video on Youtube \nhttps://www.youtube.com/watch?v=DDL3jGrrbco \nhas been removed, saying that \n“This video has been removed for violating YouTube's policy on hate speech. Learn more about combating hate speech in your country. “\n\n**In fact, there’s nothing of hate speech. **\nThis simple fact reveals that some people are very afraid of further exposure by the special topics on ShadowGate. \n\n**At this special stage of history, the topics on ShadowGate, together with the decentralized web, such as Zeronet ( http://zeronet.io ) , IPFS (https://ipfs.io ) deserve special efforts for a wide-range propaganda. **\n\nSome observers believe that Donald Trump and his other family members are also victims by the ShadowGate. \n\nFor example, there’re rumors that Donald Trump’s brother died of diseases triggered by infection of the coronavirus … \n\nFurther details to be discussed later. \n\nThe on-going active discussion deserves special attention as well.\n[Watch NOW before this is taken down - #ShadowGate ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate)\n[Some special information on Coronavirus ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Some+special+information+on+Coronavirus)",
			"added": 1598173000
		},
		{
			"topic_id": 7,
			"title": "Heaven or Hell …",
			"body": "## The Major Differences between Xi-Tler and Adolf Hitler! \n中印边境对峙、文明与丛林对决\n\n中印冲突实际上是整个民主国家阵营与丛林专政体系的对决！\nThe Sino-Indian conflict is actually a duel between the entire civilization of democratic countries and the jungle dictatorship!\n\n##Sino-Indian Confrontation — Civilization or Jungle for the Planet!\n\n中印边境对峙，双方不断增兵。但因为核武器的互相制衡，全面战争暂时不会爆发。\nWith the intensified Sino-Indian border confrontation, the two sides continue to increase troops at their borders. But because of the mutual deterrence by nuclear weapons, a full-scale war will not break out for the time being.\n印度方面有人把习近平当成类似希特勒的独裁者来研究，这种觉悟值得赞赏。但是，仅仅把历史中的希特勒拿来比较，还不够。习近平与希特勒还是有很大的区别，主要表现在：\nSome people in India carefully studied Xi Jinping as a dictator similar to Hitler. This awareness is commendable. However, it is not enough just to compare Hitler in the past history. There're still \n##some big differences between Xi Jinping and Hitler, mainly on the below aspects:\n1) 希特勒的德意志帝国确实拥有强大的科技实力，而且很大一部分都是德国自主研发的。与希特勒的德意志帝国相比较，习近平主导的“伪共”“匿产帮”根本没有那么强大的自主创新能力，主要是靠间谍盗窃去推动他们的技术创新；但即便如此，开发芯片所需要的基础科学文化积淀还是无法直接盗窃盗版。所以，“伪共”间谍技术再高，也无法独立研发出芯片。\n### 1) Technical Innovation\nHitler's German Empire did have very strong technological innovation capability, and a large part of the technology innovation was developed by Deutsche Empire independently. Compared with Hitler’s Empire, Xi Jinping’s \"Pseudo-Communist\" \"Atheism Gang\" do not have so strong innovation capabilities at all. They mainly rely on spy theft to promote their technological innovation; but even so, what is needed to develop computer chips relies on long term accumulation of basic science and culture cultivation, which still cannot be directly cloned based on theft or piracy. Therefore, no matter how sophisticated the \"Atheism Gang's\" espionage is, it is impossible for them to develop computer chips independently.\n\n2) 因为德意志帝国拥有强大的科技实力，希特勒当年确实有高度的自信，对抗全世界，并且迅速发起的“闪电战”确实也征服了很多地区。“伪共”“匿产帮”如果也拥有强大的科技实力，不但彻底破坏了香港的一国两制，也早就把台湾给“武装统一”了，根本就不会去提什么“一国两制”之类的谎言。  \n流氓根本不会讲理，他们只看硬实力。在科技硬实力不足以抗衡全球的情况下，他们才会强调“多边主义”、“理性对话”之类的论调。\n###2) Confidence on Their Dictatorship\nBecause the Deutsche Empire had strong technological innovation, Hitler did have a high degree of self-confidence. He was capable to confront against the whole world, by rapid launch of the \"blitzkrieg\" that indeed conquered many regions.  If the \"Atheism Gang\" also had strong technical capabilities, they would not only have completely destroyed Hong Kong’s Rule of Law under the slogan of \"One Country, Two Systems\", they would have thoroughly invaded Taiwan by their policy of \"Armed Reunification”.  The hollow words such as the polite remarks of \"One country, Two systems”etc. would have been totally discarded like a scrap of paper! \n\nThe hooligans can't be reasoned.  They only look at the competition by the true power.  When the hard power of science and technology is not enough to contend with the world, they will emphasize on some polite arguments such as \"multilateralism\" and \"rational dialogue.\"\n\n3) 尽管科技实力无法与德意志帝国相比较，但习近平的“伪共”“匿产帮”确实也拥有比德意志帝国更加危险的武器 — 那就是无孔不入的间谍文化渗透、文化污染与病毒污染。\n仅仅依靠“伪共”“匿产帮”的丛林专政，是无法打造出GFW的信息围墙的，但是利用西方一些资本家不择手段谋取商业利益的贪婪，“伪共”“匿产帮”硬生生地建起了规模最庞大的信息过滤封锁围墙 — 臭名昭著的长城信息防火墙GFW不仅是对现代文明的嘲讽，而且对各种瘟疫的全球性蔓延起到了推波助澜的作用。\n### 3) The More Vicious Point of Xi-Tler than Hitler\nAlthough their technical strength cannot be compared with Hitler's Empire, Xi Jinping's \"Atheism Gang\" do have weapons that are more dangerous — that is, the pervasive infiltration by various espionage means, cultural pollution besides virus pollution.\n\nRelying only on the jungle dictatorship of the \"Atheism Gang's\" terrorism rule, they cannot build up the GFW information barrier by themselves.  \nHowever, by utilization of some mercenary businessmen's commercial activities,  the \"Atheism Gang\" has been able to set up the largest scale of IT pollution virus — the notorious Great Fire Wall (GFW) is a mockery of the downgraded modern civilization, besides intensifying the global plagues of the deadly Coronavirus pandemics.\n\n4）“伪共”“匿产帮”其实根本没有实力独立打造出研发高级病毒的P4实验室，但是，通过各种文化渗透和利益输送，西方就是有一些资本家政客主动地帮助“伪共”“匿产帮”搭建起生产病毒的P4实验室，于是，伴随着GFW扭曲真伪、颠倒黑白的信息技术，相应发生的就是直接杀害地球上千千万万个“生命”的病毒瘟疫。\n\n因为害死了太多人，“伪共”“匿产帮”的头目们惶惶不可终日，在他们走向灭亡之前，会比希特勒更加疯狂，同时因为末日的恐慌与日俱增，他们也会更加脆弱！\n\n希特勒在整个德意志帝国战败后，敢于自杀。“伪共”“匿产帮”披着“共党”的外衣，却连官僚财产都不敢公开，应该是**贪生怕死到了极点，估计没有希特勒的那个勇气。他们比希特勒更脆弱，但在灭亡之前，也会更加疯狂，预计会害死更多人。**\n\n### 4) The More Fragile Weakness of Xi-Tler than Hitler\nThe \"Atheism Gang\" actually do not have the strength to independently build the sophisticated P4 laboratories for the research and development of complicated viruses. However, through various cultural penetration and material interest bribery, there are some capitalists and politicians in the West who willingly helped the \"Atheism Gang\" set up P4 laboratories for virus production.  Therefore, along with GFW's information technology that distorts the truth, reverses right and wrong, pollutes the fundamental cornerstone for Rule of Law in the West, the outbreak of Coronavirus will continue to pollute the whole planet, with millions more of people to be infected or killed. \n\nBecause the Coronavirus killed too many people killed, the hooligan leaders of the Atheism Gang are in panic all day long. Before they perish on earth, they will become even more crazy than Hitler.   At the same time,  with the doomsday coming nearer, their panic also increases with every passing day,  so the Atheism Gang would be more vulnerable than Adolf Hitler! \n** Hitler dared to kill himself after total failures of his empire. The Atheism Gang might not be so brave as Hitler.  Since they're more vulnerable, so they might act more crazily and kill more people before their total extinction. ** \n\n5) 科技实力根本无法抗衡全球，与德意志帝国有天壤之别， 但是间谍文化渗透与瘟疫病毒传播却远远超过德意志帝国，这就是“伪共”“匿产帮”的最独特的地方。 但是，与德意志帝国相比，“伪共”“匿产帮”也有一个非同寻常的弱点，那就是，由于过度依赖“谎言”与“暴力”来维持统治，他们最害怕的是，居住在东亚大陆的庞大人群中，被残酷现实和历史真相唤醒的人越来越多，最终导致专政体系彻底崩溃！ \n### 5) The Special Features and The Tactics \nWith backward scientific and technological power, the \"Atheism Gang\" seems to be much weaker than the Deutsche empire, but their capability to destroy the world through espionage and virus pollution is much more dangerous than Hitler's Empire. \n\nHowever, compared with the Deutsche Empire, the \"Atheism Gang\" does have an extraordinary weakness, that is, due to excessive reliance on \"lies\" and \"violence\" to maintain their rule, what they fear most is that among the huge population of East Asia, more and more people are awakened by the cruel reality and the truth of history.  When the percentage of awakened people reaches a certain level, it'd trigger the total collapse of the dictatorship system!\n\n\n庞大的政治“维稳”费用超过了军队费用，就是一个事实表象。“文化自信”需要依靠“菜刀实名制”来维持，是众多闹剧中最突出的荒唐景象！ 在这方面，希特勒的德意志帝国是不需要依靠“菜刀实名制”来维持内部的统治。  \nThe huge expenditure on their Domestic Political Stability Maintenance has exceeded their military expenses, this is just one phenomenon.  The most absurd scene among various contradictions is their Confidence of Rule based on the \"Real-Name Verification System of Choppers\" and other sharp tools in people's daily cooking activities.  \n\nOn this aspect, Hitler would never need an absurd \"Real-Name Verification of Choppers\" to keep Hitler's domestic rule. \n\n“伪共”“匿产帮”科技创新落后，但是在文化污染和病毒传播方面又远远超过希特勒，同时，“伪共”又最害怕本国人民的觉醒。鉴于这些特点，可以采取相应的策略。美国，或者美国在欧洲、亚洲的盟友们，包括日本、台湾、印度等国家地区，可以采取更灵活的策略。\n**With weak capability on science and technology innovation, but more dangerous power on vicious spread of virus than Hitler's capability **, at the same time, they're very scared to see more people under their own rule get awakened up, this is the most peculiar feature of the \"Atheism Gang\" under Dictator Xi Jin Ping's rule. \n\nBased on these special characteristics, corresponding strategies and tactics can be adopted to fight the Unrestricted War already launched by the Atheism Gang against the whole planet.  The United States, or its allies in Europe and Asia, including Japan, Taiwan, India, Vietnam, etc., can adopt **more flexible strategies**.\n\n目前，在边境冲突的最前线，“伪共”的基本士兵们是被禁止与家属通信联络的，目的是为了防止士兵们看到老百姓们各种各样的 “维权”运动，尤其是退伍老兵们难以维持生计而被迫去“上访”“维权”的群体运动，非常容易动摇军心。对于这个特点，那些位于冲突最前线的文明地区，比如印度、越南等，可以通过各种手段打超限战，比如在中印边境、或者中越边境地段不断地传播中国退伍老兵“上访”“维权”又不断遭到“伪共”“匿产帮”打压的恐怖场面，这方面的信息传播之舆论战，效果会远远超过因为受制于核武器的互相制衡而被动采取的冷兵器肉搏战！\nAt present, at the forefront of the border conflicts, **the military soldiers dispatched by the \"Atheism Gang\" are forbidden to communicate with their families**. The purpose is simply to prevent those soldiers from seeing too many \"Civil Rights\" movements in domestic China, among which, **huge number of veterans' right movements can shake off the military morale with shocking domino effect**. \nIn fact, the GFW has been designed to keep each individual from seeing the \"Civil Rights\" movements by other groups of people in the society, so as to keep them living in the false appearance of prosperity and dreams coined up by the Atheism Gang. \n\nBased on this special feature of reality, special tactics can be adopted to fight back the Unrestricted War against the Atheism Gang.  At the border areas with large scale of confrontation, specific propaganda can be made, to spread the truth of large number of veterans who have to join in the Civil Rights movement due to unfair treatment and merciless bully by the regime itself. \n\n以上这些策略还只是普通的网友志愿者探讨的结果。对于欧美文明世界，以及美国的盟友印度、越南、台湾、日本等，当他们把上述方法与国家团队力量相结合后， 就能够把超限战的信息舆论战发挥到极致，直奔“伪共”“匿产帮”最薄弱的环节，不断出击，必然能够早日打赢超限战，让世界最优秀的病毒专家尽快进入武汉，查清新冠病毒的最原始真相后，才能找出最有效的治疗方案，让地球人早日摆脱“伪共”“匿产帮”制造出来的新冠病毒 “魔窟”！\n\nKnow yourself, and know the enemy; one hundred battles, not defeated. \n**Due to the mutual deterrence by nuclear weapons, full-scale hot war may be not feasible. **\nWit the tactics hit against the weakest point of the \"Atheism Gang\" that mainly relies on the GFW to keep their terrorism dictatorship,  the special propaganda war will achieve unusual effects when large scale of state-level teamwork is put into the implementation of this new type of unrestricted warfare!  \n\n**The earlier the \"Atheism Gang\" is collapsed, the earlier top-rank medical professionals can be sent to Wuhan, to discover the truth on the origin of the coronavirus, so as to make a more efficient solution on the global pandemics.** ",
			"added": 1601198943
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 1,
				"body": "[The Secrets Behind Coronavirus … 新冠病毒的黑幕 1) ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2 )",
				"added": 1596899643
			},
			{
				"comment_id": 3,
				"body": "[Topics About User-level moderation ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:5_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/About+User+level+moderation) \n\nBy the progressive style of management on the allocation of data space, it’d not only help enhance the long-term prosperity of Zeronet, but also reduce the extra burden that new quota be added to some users every few months (**which may be often too late for some active users **) .",
				"added": 1597908966
			}
		],
		"5_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 2,
				"body": "By the progressive style of management on the allocation of data space, it’d not only help enhance the long-term prosperity of Zeronet, but also reduce the extra burden that new quota be added to some users every few months (**which may be often too late for some active users **) .",
				"added": 1597908895
			}
		],
		"2_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 4,
				"body": "In Oriental Culture, the term \"the Atheism Gang of the FAKE CCP\" can be concisely interpreted as **\"伪共\" \"匿产帮\"**. For people who often travel to Hong Kong or East Asia, and are a little familiar with the Oriental Culture, they'd easily understand what the term **\"伪共\" \"匿产帮\"** means.   \n\nOnce the term**\"伪共\" \"匿产帮\"** is used to differentiate  a small group of top-rank hooligan leaders from 90 million grassroot CCP members, very overwhelming effect will be produced … \n\n**More importantly, the tactics of the special Propaganda War will help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his personal friendship with a vicious dictator.  **\n\nFrom Donald Trump's personal interest, whether he's pursuing eternal glory of an excellent president who seriously cares about the human rights of both American people and those people in East Asia brutally oppressed by the Atheism Gang, or **he's simply pursuing the secular power as the leader with the strongest political power ** in the USA, those tactics deserve careful consideration …",
				"added": 1599888952
			}
		]
	},
	"comment_vote": {}
}