{
	"title": "西域武僧的博客",
	"description": ">這是西域武僧的博客，武僧寫過的文章，都將保存在這裏，並希望與大家分享傳播溝通交流。\n微信ID：xyws8964",
	"links": "- [西域武僧的留言板](http://127.0.0.1:43110/1CsKeYh88Qh3qoxJ4RA2PiH7GdYYqLCx5h)",
	"next_post_id": 36,
	"demo": false,
	"modified": 1490755232,
	"post": [
		{
			"post_id": 35,
			"title": "中国再次进入“连奴隶都坐不稳的时代”",
			"date_published": 1489941111.092,
			"body": ">很多中国的历史学者都认为早在汉朝中国便消灭了奴隶制，这一提法的确立，主要来源于费正清主编的《剑桥中国史》。但我对此一向保持疑议，因为费先生即没有给奴隶社会制定出完整有效的定义，同时也没有将奴隶制向中央集权制转型的过程进行有说服力的描述。\n---\n首先，从诗经上看，“溥天之下，莫非王土；率土之滨，莫非王臣”，这句诗词从人身归属权和生产资料归属权两个方面，准确地描述了中国五千年奴隶制历史的实质。\n\n汉代儒博士孙叔通为刘邦制定朝臣觐见跪拜之礼，本质上也是依据人身与经济归属权这一核心价值观念所制定的，并且将这一官礼推广到民间，形成层级递进的拜官制度，到清帝逊位方绝。如果说中国是一个自由民的社会，那么这种显然带有奴隶制特征的，象征人身与经济归属权仪式的跪拜礼，必然不应该存在。而存在这种跪拜礼的社会，必然应该属于奴隶社会。\n\n中华民族的奴隶社会与其它民族历史上的奴隶社会有一些不同，比如在中央集权制度之下，奴隶主只能有一个，那就是皇帝。而在世界范围内其它民族中，奴隶主却可以很多，奴隶主之间形成隐形的竞争和议价机制，促进了奴隶制向资本主义制度的转化。在世界上绝大多数民族历史文化中，奴隶制不过是一种以经济为主体的制度（马克思也将奴隶制认定为一种基础的经济制度），而只有在中国，奴隶制发展为一套以政治制度为主体的、以层级结构为特征的、覆盖整个社会的制度，我们可以将其称之为“层级结构金字塔型奴隶制”。\n\n这种层级结构的奴隶制，奴隶主只有一个，奴隶基数足够庞大，每一个奴隶相对所承担的奴隶义务较少，因此这种奴隶制度可以长时间的延续。而世界其他大多数民族，因为没有形成这种层级化结构，而是一种“多中心分封式奴隶制”，奴隶主之间为了经济效益的竞争，战争不断，造成每一个奴隶所承担的义务过于繁重，因此奴隶主之间的战争和奴隶反抗断送了这种奴隶制，最终进入了资本主义时代。基本上，只有中国成功的将经济学意义上的奴隶社会进化成为了政治学意义上的奴隶社会，而世界上的其他民族，都没有完成这一转化。中国将原本分封的奴隶主，同样纳入了奴隶等级管理架构之中，通过剥夺其自卫权，进而剥夺了他们的议价权，成为单一奴隶主（皇帝）治下的高等级奴隶。\n\n综合人类史上有关奴隶社会的史料挖掘，我们基本上可以指出，奴隶社会具备如下十个基本特征：\n\n1、奴隶主对奴隶的生命具有生杀予夺大权，或者奴隶主杀死奴隶与奴隶杀死奴隶主，有着完全不同且差异显着的刑罚标准；\n2、奴隶主对奴隶的产出具有无偿占有的权利，但不承担任何义务；\n3、有一整套制度和礼仪保证奴隶社会的阶级差别；\n4、有完整的户籍和工籍制度，并且一般不可以转籍，奴隶主与奴隶等级固化，没有改籍空间；\n5、除了赋税之外，奴隶必须无偿承担徭役；\n6、奴隶不能逃跑，不能擅自离开所在地域，有户籍限制；\n7、奴隶没有属于自己的生产资料和不动资产；\n8、奴隶不得反抗奴隶主，不得表现出对奴隶主的不尊重乃至嘲讽，更不能批评；\n9、奴隶不具有自主的婚育繁衍权，奴隶会承受肉刑；\n10：奴隶没有包括决定其自身权利的参政议政权。\n\n从上述十个标准来进行比较，中华民族传统社会的确具备了奴隶制社会的绝大多数特征，唯一差别只在于程度的深浅有所不同。造成这种深浅差异的，则在于朱熹《论差役利害状》中所言的“祖宗成法”。这种“祖宗成法”不存在于法典之中，而是一种社会基本认可的“潜规则”。这种“潜规则”规定了官吏驭民的主要职责在于“优抚”而不是强迫、派遣徭役应当支付一定的费用、决讼还应当照顾社会舆论和情感、土地所有权虽在官方（皇帝）但仍允许有限的民间买卖，但必须取得官家承认等等。\n纵观中国历史的各个时期，凡是“祖宗成法”执行的比较好的时期，基本上都是“暂时坐稳了奴隶”的时代，而“祖宗成法”被破坏甚至被抛弃的时期，则人民大多处于一种“连奴隶都坐不稳”的时代（鲁迅语）。\n\n而如今的社会，正恰恰又一次进入了鲁迅所说的“连奴隶都坐不稳”的时代，而历史上但凡这样的时代，也都预示着进入了一个朝代更替的动乱时期。\n\n无论从掠夺式的征地拆迁、长达十数年的计划生育政策、复杂而严格的官场礼仪、繁重的赋税以及寡薄的社会福利、不断被践踏的法制等现今越来越让人跌破眼镜的现状来看，中国当前的社会形态，无疑仍旧是符合奴隶制十项标准的，并且随着雷y案、7零9案等对法制社会的进一步破坏，这种稳定的奴隶制社会结构正在破碎，中国再度进入朝代更替循环的时期。\n\n事实上，中国历史进程中，当面对这种转型时代的时候（唐德刚先生称之为“历史的三峡”），一向都不是只有“华山一条路”。其中，最令人难以选择的，也是最主要的道路只有两条。一条是重新回到“暂时坐稳了奴隶”的时代，一条是彻底推翻奴隶主和奴隶制度，走向遵从人道主义的，以宪政为基础的，三权分立的现代民主政治。\n\n从所谓的文革结束以后，一向具有忧国忧民传统的中国知识分子，一直在选择通过第一条道路，也就是重新回到“暂时坐稳了奴隶”的时代这条道路进行社会改造。选择这条道路的优点是显而易见的，那就是不会导致社会动荡，不需要革命，只通过规劝奴隶主改革，重新拾起被抛弃掉的 “祖宗成法”。这条道路看上去比较平坦，似乎成本也很低。于是，从七九至今历次社会运动，主流的声音都是改革。但是，同样从历史上看，选择这条道路的结果基本上都是失败的。可以说，面对奴隶主和其治下的高等级奴隶的无限欲望的时候，任何劝诫其“少吃点”或者“吃相好看点”的努力，都是徒劳的。这也是中国五千年历史上近百个朝廷更迭的根本原因。中国历史上还从来没有出现过主动让渡权利的奴隶主，我相信未来也不会有。因为没有人知道做奴隶主所能享受到的巨大精神和物质的满足，包括奴隶主也不知道，因为他总是认为还可以获得更多。\n\n所以纵观改革派，他们谋求在现有皇权不做根本性变更的情况下，尽量回到尊重”祖宗成法”的轨道上去，重新回到人民”暂时坐稳了奴隶”的时代的这种思想，首先会得到奴隶主最大的反感，如商末的比干，南宋岳飞，元末的脱脱等，他们基本上在社会革命思想尚未成型的时候，便被奴隶主杀死了。而基于不堪”连奴隶都坐不稳”的底层民众的革命力量，谋求的是推翻前朝统治，更换天地新颜。他们大多以造反者的姿态出现，令人恐惧的流寇特征杀伐征服。总体来说，社会中高级知识分子和士绅寄希望于改革，而历史一般都选择了革命。中国历史上近百次皇权变更，无不证明了这种历史的选择结果。\n\n尽管所有人的出发点都是好的，但最终的结果却是惊人的一致：社会必然走到第二条道路，也就是推翻奴隶主和奴隶制度上。但是，由于长期以来新的社会制度没有被探索出来（现代资本主义制度是十八世纪才逐渐成形，而此时的清国正处于较长期的暂时坐稳了奴隶的时代），投身反抗的奴隶们对于其他的社会制度没有概念，历史在转了个弯儿之后，又重新回到第一条路径上。他们推翻了旧的奴隶主，却没有能力推翻奴隶制度，于是他们只好又重新选择了一个能够暂时遵守“祖宗成法”的新奴隶主。\n\n尽管推翻奴隶主并不等于能够一并推翻奴隶制度，但是，奴隶主与奴隶制度这一对伴生体，必须同时击溃，才有可能创造出一个全新的、具有人道主义精神的、符合现代民主政治的新政体来。二者存其一，都不能成就孕育民主与自由的土壤。中华民族五千年来的奴隶制惯性尽管仍旧存在，但今天的转型期后有殷鉴不远，前有成熟的民主社会路径可以遵循，只要我辈出于公心，诉诸公论，应该还是可以彻底推翻这奴隶制度和其根源，孕育出符合人道主义的民主制度来的。\n"
		},
		{
			"post_id": 34,
			"title": "丁酉岁想之四",
			"date_published": 1488685286.033,
			"body": ">因为是人道主义孕育了文艺复兴，及至现代资本主义文明，我们必须重新回眸检视一下人道主义的确切含义。追溯人道主义的历史不难发现，基督精神是人道主义精神之父。耶稣以他道成肉身的奇迹，宣告了人神之间相互不可逾越的界限，将神意天谴的旧约置换为宣教领牧的新约，继而人人皆是上帝的选民，代替唯有经过教廷代理才能进入天国的等级代理模式。人人平等的理念就此滥觞。可见，人道主义的核心价值就是人人拥有自由、平等的本质。萨特认为，人道主义是：任何人都拥有自由选择生活的平等权利，但是任何人也必须承担这种自由选择权所产生后果的义务。这种选择自由的根基就是天赋人权，承担结果则由法律保障。而独裁专制政府则恰恰相反，他们按照等级性强迫民众甚至自身选择（即便身为权贵顶层，他们也没有多少自由选择的权利，比如他们不能选择正义，只能选择所谓集体利益），但是是否承担这种选择所造成的结果，却是自由的，甚至分配的。高阶级可以选择享受更好的结果（比如财物、特权），低阶级只能承担所有恶果的损失（比如强拆、有毒食品等）。因此，对坚持人道主义就是对独裁专制的反抗。\n---\n从人类历史上看，河套文明与滨海文明因为地缘影响，呈现出两种极端的差别。河套文明更倾向于孕育乌托邦哲学，比如中国印度埃及等等，其中比较典型且固化的，就是中国。从尚书到礼记，记载了一整套古人理想中的社会模型，所谓：九州攸同，四隩既宅，九山刊旅，九川涤源， 九泽既陂，四海会同。六府孔修，庶土交正，厎慎财赋，咸则三壤成赋。中邦锡土姓，祗台德先，不距朕行。后人则按照这一充满理想主义的幻象刻绘这个国家的政治经济文化甚至地理历史，从来没有睁开眼睛看看这个世界的真实状态。整个文化犹如开着眼的瞎子，毫无逻辑的狂妄自大与毫无理由的自卑懦弱构成了一幅五千年蓝图。即便间或孕育出道家、心学等接近人文主义思想的哲学，也逃不过稍纵即逝，终遭摈弃的结果。这与河套流域的稳定、富饶、闲暇的地理环境，有着因果的关系。而诞生于滨海地域的文化，多接近实证主义和人文主义，盖因其交通不便物产较薄常受海浪凌虐等因素所致，故此必须认清现实，凭借人力，正视自己和他人，才能结集社会，共同抗御。比如希腊。\n\n河套文明和滨海文明之间的差异，导致两种文化的巨大差异。一个偏向于积极、强势，力争上游并且为了传播自己的文化，不惜改变自己，同时有具有自我纠错能力，时刻反省，并且不断尝试进步。总体上来说，滨海文明呈现出的是一种人性的文化。而河套文明呈现出的文化则是复古，保守甚至是封闭性的。与其他文化表现不同，中国文化存在的目的是标榜自己有文化而已，中国文化人存在的目的也只是证明中国有文化而已。他们甚至创造出”国学”一词来试图证明中国文化的崇高性，但是却恰恰证明了中国文化的保守性。如果说滨海文明产生的文化是：文化的目的是为了让人生存的更好。而河套文明产生的文化则是：人生存的目的是为了让文化看起来更好。这种现象恰恰体现了乌托邦主义和人道主义之间的根本差别。\n\n狄俄尼索斯是希腊酒神，也是狂欢之神。是宙斯与忒拜的私生子，因为被赫拉嫉妒，一生颠沛流离，向人们传授酿酒技术，并且死而复活。是希腊神话中最人性化的一个神。耶稣是上帝的儿子，来到人间并以自己的生命传道，以自己的生命被钉在十字架而赦免了人的罪，与上帝定了新约，并死后复活。也是一神教中最具有人道主义特质的一个篇章。我觉得耶稣基督与狄俄尼索斯之间有着某种宗教血缘传承关系，也是复兴希腊文明的一个开始。是现代人道主义思想的发源处，文艺复兴的奠基处。如果这个假设成立的话，乌托邦与人道主义在宗教社会学上的立足点就更坚实了。最近想找有关书籍读读，看能否找到这两者之间的佐证。不知道这部分是否有人研究过。\n\n唐德刚先生认为，中国思想史上从来没有出现过经验主义-实证主义思想，五千年来一直是乌托邦-先验主义的试验场，一直到民国，都没有实现”数目字管理”。因此，中国文化更容易接受乌托邦思想的波及。在五十年代中期，中国人在人道主义的民主政治和马克思主义的专制制度之间选择的过程中，在历史惯性的必然驱使下，自然而然地转入专制制度（其实深究起来，当时国府制度也是偏向于集权，与共匪后来实行的专制制度只有量的差别，没有质的不同）。反观西方文明的发源-古希腊文化，却是泛哲学化的，巴门尼德、毕达哥拉斯到亚里士多德、柏拉图，数论派、道源论、逻辑学、伦理学、数学都得到了发展。而中国唯一能拿得出手的，只有春秋时期的百家争鸣，而诸子百家中，唯一能够称得上哲学的思想，也唯有老子的道德经而已。这两相比较，事实上也存在着巨大的量上的差异。中国后世几乎所有带有实证主义意味的科学，几乎都源自于道家。而儒家除了在孟子那里绽放出精致的伦理学思想之外，其后都基本上沦为了为君道主义提供佐证的伪道学。人道主义在中国历史文化中的缺失，是中国一切问题存在的根源，也是未来中国所面临的大问题。\n\n很多人认为中国早在汉朝便消灭了奴隶制，但我对此一向保持疑议。首先，从诗经上说，溥天之下，莫非王土；率土之滨，莫非王臣。我们首先不能否认诗经在中国历史文化上的影响，并且应该重视这种影响的一贯性，以及两千多年来儒家对这种思想的不断回应。汉代儒博士孙叔通（这家伙是个三姓家奴）为刘邦制定朝臣之间的跪拜礼，并且将这一官礼推广到民间，形成层级递进的拜官制度，到清帝逊位方绝。如果说中国是一个自由民的社会，那么这种象征归属权仪式的跪拜礼，必然不应该存在。而存在这种跪拜礼（层级结构的中心化奴隶制）的社会，必然属于奴隶社会。如果说这拜儒家所赐，必应不至于说我妄言。应该说，在中国古代，特别是汉代以后，中国是一个具有开明法度的奴隶社会，统治者一般不会破坏这一法度，并且还会经常适当地自我调整，以增加法度下的奴隶的自由度。但是，这种社会模式仍旧具有奴隶社会的一切特征：奴隶主（主要是指皇帝）对奴隶具有生杀予夺大权；奴隶主对奴隶的产出具有无偿占有的权利，但不承担任何义务；有一整套制度和礼仪保证奴隶社会的阶级差别；有完整的户籍和工籍制度，并且一般不可以转籍；除了赋税之外，奴隶必须无偿承担徭役。如果说这不是一个奴隶社会，什么才是奴隶社会呢？只不过那是一种比较好的奴隶社会，因为奴隶主为统治故，尚不愿意也不敢突破这部奴隶法。而今的奴隶社会，则是没有法度、朝令夕改、强词夺理、肆意蹂躏的奴隶社会，是中国历史上最黑暗的奴隶社会罢了。\n\n美联储毫无悬念的加息了，这是十年来美联储第三次加息，也是最早的一次加息。武僧估计美联储今年加息最少三次，甚至可能达到四次。那么，到今年底，美联邦基金利息将达到2％。按照目前美国经济运行状况，重回十年前5％的高位，应该不是难事儿。加息之后，对中国的影响如下：\n1、制造业更加困难，外资制造业撤资速度将更快，就业压力持续增加；\n2、国际资本出逃速度将加快，外汇储备极度缩水；\n3、毛币贬值压力持续加大，年底前将贬值到7.4左右，因为召开十九大的因素，政府将不会坐视毛币跌破7,5，但将为此付出巨大成本；\n4、毛币将迎来又一次印刷高潮，下半年M1M2的数字将非常”好看”\n5、通货膨胀将以感受得到的方式袭来，猪肉价格平均指数在年底有望突破24，甚至达到28的高位。\n\n武僧总结的奴隶社会的十大特征，大家自己对照：\n1、奴隶主对奴隶的生命具有生杀予夺大权，或者奴隶主杀死奴隶与奴隶杀死奴隶主，有着完全不同且差异显著的惩罚标准；\n2、奴隶主对奴隶的产出具有无偿占有的权利，但不承担任何义务；\n3、有一整套制度和礼仪保证奴隶社会的阶级差别；\n4、有完整的户籍和工籍制度，并且一般不可以转籍，奴隶主与奴隶阶级固化，没有改籍空间；\n5、除了赋税之外，奴隶必须无偿承担徭役；\n6、奴隶不能逃跑，不能擅自离开所在地域，有户籍限制；\n7、奴隶没有属于自己的生产资料和固定资产；\n8、奴隶不得反抗奴隶主，不得表现出对奴隶主的不尊重乃至嘲讽，更不能批评；\n9、奴隶不具有自主的婚育繁衍权，奴隶会承受肉刑；\n10：奴隶没有包括决定其自身权利的参政议政权。\n\n如果你认为这十条标准无误，请转发。\n\n突然觉得中国人的生存方式，非常有趣。很像我当年八酒在炮局被关押的那段经历。到时候被因为一点小事被关到了小号。炮局的小号和其他的小号不太一样的地方在于，他有一个窗户。他和监室的窗户不太一样，监室的窗户外面有一条个士兵走过通道，而小号没有，我想是因为小号很小，不到四个平方，而且比较安全，所以就没有外面士兵走的那层。所以在小号反而能看到蓝天。我突然觉得中国的状态就和我当年在炮局里面小号的那个状态一样，一个两米乘不到两米的这么一个小小的空间，非常肮脏，非常非常臭。但是你却抬头就能看到蓝天，但是那个蓝天的又可望不可及。他离你大概有3米5高，四米高的样子，你又爬不上去，但是通过窗户就可以看到他。现代民主制度就是，中国所在的一个小号，狭窄空间，顶上的窗户，通过它你能看到蓝天，那蓝天就是现代民主的希望，但是你似乎永远够不到，永远够不到似的。你必须特别努力，才能，用手指尖接触一点点，那个蓝天的感觉。\n\n专制政权的灭亡，有它一定的规律。首先它会疯狂的集权，将过去为了适应环境而有限分散的权利重新集中回来，这其中自然有统治者个人独裁的野心，同时也有极权本身扩张的动力。因为不扩张就满足不了组织物质和精神上的需求。接下来就是在经济上进行清洗，以筹措扩张所需要的庞大的资金。第三步因为经济收紧导致民间经济和企业（手工业者）破产，连锁反应导致社会不满情绪高涨，毫无悬念地启动维稳模式，使用大量军警力量维持统治，排除思想异己。接下来会发现，对外扩张与对内维稳两个方面的巨资消耗，造成财政进一步紧张。而对外扩张和对内维稳都已经启动，已然无法停止，整个极权力量分布严重不均衡，力量不足。正如孙子所言：守则不足。因为处处防备，也就等同于没有防备了。故此，极权者只有两条选择，如果对外扩张形式尚没有形成气候，必然选择对外妥协而加大对内维稳。但是这种妥协必然同样耗损自身力量，加大需要维稳的面积，仍旧处于守之不足的状态，社会矛盾加剧，处处火药桶，社会控制能力大幅下降。此时发动对内的战争动员，发动一部分人对抗另外一部分人；给一部分人希望，给另一部分人绝望。极权如同走钢丝，走过了是运气，走不过是常态。另一种选择是对外战争，同时化解内部矛盾，同仇敌忾宣传。但是其结果是外战必输，但是内部矛盾获得缓和。所谓胜兵先胜而后求战。没有胜算把握的战争，本质上就是一种维稳目的。但这也如同走钢丝，要看外部战争引发的面积，稍有不慎，即全面溃败。战争与维稳是末期最重要的主题，社会控制能力的丧失是着力点，推动专制走入绝境是事半功倍，令其守无可守是窍门，大崩溃时力挽狂澜是努力方向。\n\n专制政体本质上就是一种奴隶制。初期首要的问题是要将自由人转化为奴隶，这就需要一种乌托邦思想，比如太平天国的天堂论，比如国际共运的共产主义。通过弥撒的形式，让初选民成为受膏者。它必须要挖掘人对高尚的需求，强化这种需求，并且与不高尚形成水火一样的对立，鼓励从肉体上消灭反乌托邦的那种情绪。让奴隶误以为自己是进化的人，从而丧失人性，崇尚神性。乌托邦是属神的，是先验的。人性是属人的，是经验的。因此，反抗乌托邦的唯一方法是重归人性，唯一的理论基础是人道主义。人道主义是因果，也是救赎，是选择的自由和承担结果的责任。在神是行基督的道，以孩童的面貌回归神国。在佛就是众生畏果菩萨畏因。因此，崇拜他人的完美能够成就神性的，即是卖身为奴。相信人有原罪但最终能获得救赎的，就是奴隶的自我解放。"
		},
		{
			"post_id": 33,
			"title": "丁酉隨想之三",
			"date_published": 1488596128.851,
			"body": ">這個世界上，一部分人認為自己應該可以同任何一個他所看上的女人或男人睡覺，另一部分人則認為，每一個男人或女人，只應該與另一位女人或男人共度餘生；一些人認為沒有私有財產根據需求分配的田園牧歌制度是最完美的，而另外一部分則認為人人應該通過自己的能力和張揚欲望，使自己過的比其他人更好；一部人人認為利他主義是美好社會的特徵，而另外一些人則認為利己主義是世界進步的原動力。現代民主政治的選擇就是在這些相互矛盾並各自極端的思潮中謀取平衡。而極權主義則力圖在這種兩可抉擇中，消滅他們所不喜歡的一部分思想和擁有這種思想的人。\n\n---\n馬克思韋伯寫了本小冊子，叫做《新教倫理與資本主義》，很多人據此想當然地認為，基督教孕育了現代民主制度。且不說這些想當然者是否讀過韋伯的這部作品（韋伯在書中所論述的也不是他們所認為的那回事），單從書名上，就可以看出韋伯的立論是在新教之上。基督新教與猶太舊教的差別在於：上帝作為神格化獨一真神，不再干涉地上眾生的價值評判；以宣教模式代替了舊教中的懲罰模式；以自我犧牲代替了舊教的奉祭犧牲模式；以耶穌的道成肉身解放了眾生原罪下的永劫輪回；以因信得救代替了舊教的殺伐異端；以普世得救代替了舊教的種姓神選。新教的倫理價值正在於此，新教的資本主義土壤也在無此。\n\n對於執政者來說，真正的敵人總是來自執政圈內部，圈子內部有機會登上執政頂峰者，才是現有執政人最大的敵人。無論專制政權還是民主政權，莫不如此。唯一不同的是，民主政權形成了一套有效的競爭制度，制度的標準可以以選票多寡而量化衡量。而獨裁專制政權的程式標準是屠殺與算計，唯有幹掉或者幹倒競爭對手，才是勝利。因此，獨裁政權總是伴隨著血淋淋的歷史。而人民，在專制國家，要麼是唾棄的物件，要麼是可以無視的群體。在民主國家，也只不過是爭取的對象。儘管本質上人民的作用有限，但是境遇卻天壤之別。所以，人民也沒必要將政治太過當真，算不得象牙塔中的神聖之物。人民真正應該關心的，是自身在當政者眼裏是隨手可以碾死的螞蟻，還是可以用來裝飾的金箔。\n\n儒家講不知生焉知死，故此不語亂力怪神；佛家說不知死焉知生，故說無掛礙故無有恐怖。知生者追求人生的綻放，死後光宗耀祖。知死者追求死的解脫，生時了無羈絆。儒家因不知死而慎生，故此強調忠孝節義，避免死後尷尬。佛教知死而厭生，強調無我人眾生壽者，避免生時受各種欲望牽引。\n\n締結一個社群的基本原則是信任，鏈結相互信任的基礎，是基於宗族、信仰、利益、教化和社團。極權專制主義者，最熱衷於打破這五種信任的基礎，而一旦這五種基礎被打破，社會便成為一團散沙，整合力消失、榮譽感喪失、價值觀被顛覆，成為所有社會中最骯髒、最下流的社會。因此重建這一社會，將是一個艱苦卓絕的工程。人類六千多年歷史上，少有一個民族或者國家、社群能夠將支撐人與人之間相互信任的五大基礎顛覆的如此徹底。這也就是信仰在現下中國的珍貴所在，耶穌（此處以基督教為例）以其道成肉身的卓絕，重塑了人與神之間的關係，重新彰顯了人性中被淹沒的神性，重新強調了人的作用和價值。這種不與舊勢力同流合污的徹底決裂，和基於人道主義立場的自我強化，成為西元以來新世界的開端。所以“耶穌說我就是道路、真理、生命，若不藉著我，沒有人能到父那裏去。”所以，在某種意義上說，反抗的本質就是重建自信的過程，從一個人的自信走到一個團體重構信任的過程。這種自信，來源於正確的信仰，那就是：對自身神性的認可，對他人神性的尊重和對整個世界為神的意旨的信仰。\n\n\n每次貼有關於宗教信仰的帖子，就總有人問我你信什麼？你為什麼信這個而不信那個？你覺得基督教和佛教哪個是正教哪個是邪教…對於此類問題我在此貼一併作答，並且今後不再回答類似問題。第一，我即不是佛陀也不是耶穌，他們誰是正是邪我沒有能力評判，更不能僭越佛陀與基督進行評判（如果能夠評判佛陀與基督孰正孰邪必定應該高於他們的存在吧），我只是他們的學習者而已，追求的是解脫。第二，佛教與基督教孰高孰低的問題其實佛陀與基督也說了不算（因為沒有自己評判自己優劣對錯的，並且評判必須尋找一個更高階的存在來進行，而作為唯一真神或者佛陀，都沒有更高階的存在）。第三，作為我個人，基督徒得救和佛教徒的解脫是我所嚮往的。但是我也要選擇哪一個更適合我的心性，更對峙我的缺陷，更有助於我面對現實的問題。第四，我認為佛教所教與基督教所教之真理沒有本質差別，只有路徑不同。一個是籍著造者認識所造，一個是觀待所造去認識造者。人是有缺陷的動物，地緣隔絕更造成了數千年前人們的理解能力有限，全能的造物主不會對當時赤道的人講北極的事。作為佛教徒，我也只能以努力修行從而獲得身心的徹底解脫來證明佛教是正道，其他的我一律也證明不了。因為到山頂的路可能不只一條。\n\n亞里斯多德將人定義為自然的生命，同時具有政治能力。福柯則認為人是被政治框架定義了的非自然屬性的自然生命。這一從人----社會人的轉變，是現代政治社會轉變的客觀寫照。現代政治學諸種思潮，從自然主義到自由主義，從保守主義到後現代主義都強調了人在政治框架下的生命呈現，強調了政治的正確性和政治正確的前提下對人的重新估值。從這一視角下進行考量，無論資本主義還是共產主義，人這一被逐漸物化和利益化的政治個體，其來源與去向竟驚人地趨同。這也說明了在當今國際政治環境中民主人權與專制集權不斷妥協、媾和甚至交配的現實悖論。於是，我們需要一種新的回歸，回歸人道主義的本質，回歸人的價值，回歸亞里斯多德關於自然人的根本前提，重新定義現代政治的來源，方向與目的。\n\n\n人道主義這一哲學概念肈始於新教改革，濫觴於文藝復興。是人的權利與人的價值的重光。人道主義並不僅僅是關於人的生命的權利，它還包括著生命的本質、人生的意義、人的目的和人的價值以及關於人的因果律等內容。人道主義的缺位，是目前中國最大的問題，也是世界的主要問題之一。近年來人權概念混淆不清，很大程度上是因為人道主義的缺位造成的。比如我曾經談到過清算，並說中國最缺少的就是一場對思想的徹底清算，有朋友就認為這是非人道主義的。事實恰恰相反，人道主義一個最基本的要點，就是尊重人自由選擇的權利。當一個人徹底地擁有選擇的自由，他也同樣徹底地擁有承擔這種結果的義務。因為這是對所有人都公平的一種樣態，也是可以推廣及於普世的一種人道主義選擇。一個人可以自由選擇最利於自身的存在方式卻可以不承擔他所選擇的結果的時候，這就是獨裁和專制，是最徹底地非人道主義的。因此清算本身並不是反人道，而沒有原則的赦免才是。當然，如何清算、如何分清哪些是因為全體國民共同犯罪導致的個人選擇障礙，被迫選擇的因素，哪些是主動選擇並所應該承擔的後果，以及個人在選擇過後的懺悔心理以及補救行動，則是如何清算以及建立清算體系所要面臨的問題。\n\n\n毋庸置疑，臺灣是中華民族民主化進程的先行者和探索者，獨特的傳統中華文明與普世價值為核心的現代政治模式。臺灣政府對2.28事件的清算，有可能成為未來中國清算社會主義災難的又一個模版。中國自史以來，從來沒有經歷過一次徹底的，以人的價值為本位的，公平的社會清算，中國人也幾乎從來沒有籍此反思過自己在歷史中的作用和植根於生命價值的善惡。清算2.28的倡議在歷史上可能是首次。如果台府能夠摒棄党爭，形成一個獨立於各黨派，有各階層廣泛參與的調查清算機構，用嚴謹的態度和學養，徹底對2.28事件還原歷史真相，厘清歷史責任，進而達成在真相下的和解，不僅僅是對臺灣，對未來的中國都將意義重大！\n\n神權和人權各有其邊界。舉個例子，幾乎所有宗教信仰者都會認為自己的信仰是宇宙所至高無上的。這很正確，因為在基督教因信稱義，在佛教信為道源。但是如果將自己的這個信強加於他人的時候，問題就來了。比如說，世間萬物由神所創造，那麼在萬事發生之初誰有權力界定那些是神跡或者神所納悅，哪些不是？當你言說這個世界是獨一真神所創造，並且其他一切與這個言說不同的判斷都是錯誤的時候，事實上你並不是僅僅描述一個事實，而是將自己置於一個可以認證、證明和判斷神跡的高度，甚至說，你已經將自己置於神之上。另外一個問題是，如果這個世界的一切都是神所創造，所有都歸於神，那麼萬事相侵，勝者為神跡自是無疑，那麼那些失敗的，也是神納悅的麼？比如很多普粉稱川普是上帝意旨的體現。這時你仍舊將自己置於神之上，並且埋下了隱患，那就是如果川普最終證明是有害於美國或者人類，那麼他還是上帝意旨的體現嗎？這將使你陷入兩難悖論。所以，無論是信仰任何一種宗教，應該時時警醒自己是信仰者，而不是高於被信仰本身的裁判者。\n\n十多年來我一直在思考人類是不是有原罪。從基督教角度來說，夏娃受到誘惑吃了分別善惡樹的果子，因此人類的原罪是有生具來的，伊斯蘭教也一樣。佛教認為人從無始劫來無明障蔽故罪大惡極。從人類學角度說，世界上只有兩種動物對種族滅絕有特殊的愛好與能力，一種是黑猩猩，另外一種就是智人。智人這種動物從非洲的露西繁衍至今，似乎從骨子裏就是為了滅絕這個地球而存在的，幸虧有這種懺悔精神的制約，人類學會了如何與這個地球相處。這個地球上的其他生物，並不需要衍生出複雜的哲學和社會學，數學乃至物理學一整套的邏輯和實證，只有人類才需要。從一個側面證明了人類這個物種骨子裏與生俱來的侵略性和佔有欲對這個地球帶來的徹底傷害能力。這也許正是宗教意義上人類原罪的本質：分別善惡、知羞恥和貪嗔癡慢疑等等諸般。\n\n\n"
		},
		{
			"post_id": 32,
			"title": "丁酉隨想之二",
			"date_published": 1488595314.298,
			"body": ">春意融融，難免踏青。不過這次踏青時間長了點，整整半個月，在閩東山水中徜徉，和朋友一起爬了七八座山，溯了兩條溪，看了一次海，拜訪了幾座古村和古鎮，去了雙溪藝術家公社，探了一座埋藏在深山中被人盜掘一空的古墓，可惜沒有見到小龍女。連續喝了十幾天的大酒，其中兩次斷片。同時，也寫了近二十份隨筆，分成兩篇貼在這裡。\n\n---\n剛剛朋友推薦了劉軍寧的一篇關於理性主義和保守主義的文章。我認為，其中將理性主義用烏托邦替換下，這文章是成立的。否則，劉軍寧有故意混淆理性主義和烏托邦（空想社會主義）之間界限的嫌疑。首先，烏托邦並不是理性主義的產物，相反，以笛卡爾、斯賓諾莎為代表的理性主義在批判烏托邦主義的過程中，可以說是居功厥偉。烏托邦的本源是神秘主義，基本上是不承認人，特別是普通人的理性價值的，在哲學上他們尊崇的是至高道德或者至高理性。而理性主義則堅信通過人的邏輯、經驗可以推動社會發展和人類群體的進步，即哈耶克所言的人和價值（人類理性的總和產生的推動價值）。烏托邦與理性主義二者界限明顯不能混同的。而保守主義更傾向於保守舊的，經過長期經驗所證明具有社會價值的價值觀。應該說保守主義是在理性主義基礎上產生的更溫和的一種思想。這兩者倒是更接近些。劉軍甯在文章中還將理性主義與激進主義畫上了約等於號，這就更離譜了。縱觀人類歷史上，似乎沒有哪一次的革命或者人道災難，是理性主義者推動的，而大部分是烏托邦主義者所推動的。在文章的最後，劉軍寧提到的斯多葛學派，又恰恰是烏托邦主義流派中的一個源頭，其所信奉的世界理性，又恰恰是烏托邦主義後期發展的重要理論支柱。劉軍甯的文章，混淆了很多哲學基本概念，實在令人不解。\n\n人道主義是近代 被異化最嚴重的一個概念，在世界很多國家的課堂，特別是中俄等專制國家的課堂裏，人道主義基本上成為了人道救援的代名詞，成為反暴力、反革命的標籤，成為了奴化人民的一個緊箍咒。人道主義是以人為中心的世界觀，以人的價值和道義標準為基礎，尊重人的意願和人的價值，進而尊重一切生物乃至尊重整個世界。人道主義的出發點不是尊重，而是在人的意願與價值的達成，其臨界點是其行為不侵犯他人的意願與價值。人道主義是現代政治理念的哲學基礎，它首先在現有體制下保護每個人追求幸福的權利的同時，限制這種權利對他人產生損害。用薩特的人道主義觀點來說，首先保證的是人的選擇權，同時利用法律和制度，來明確、保護乃至賦予人在自由選擇前提下所應該承擔的結果。比如，人道主義並不為反對犯罪而反對犯罪，人道主義強調的是，一個人在犯罪的情況下也應該受到一套公正的法律以保證或強行迫使犯罪者承擔所應當承擔的後果。如果一個社會，犯罪者可以通過特權不去承擔其犯罪後果，或者守法並追求幸福的人無法保證自己獲得幸福的結果，這兩種情況都是反人道主義的。至於預防犯罪，促進人與人、人與自然的和諧相處，那是道德和教育的事情，政治和法律並不能越俎代庖。\n\n\n在中國，被玩壞了的政治與哲學概念實在太多了。早上我舉了人道主義這個概念為例子，相似乃至更有甚者的更多。比如左派和右派這一對政治學概念，你在中國語境中永遠爭論不清。這個問題從八十年代爭論至今，後來乾脆整了個中國的左派和右派這一對政治學之外的名詞，結果不但沒有清理清楚，相反更加混亂了。再比如革命與反革命，在中國，無論你是主張革命的還是反對革命的，結果都一樣會落個反革命的罪名。你追求社會進步社會轉型，明顯是革命路徑，最終也會帶上反革命的帽子。其實，就連革命這個詞本身，早就與其政治學含義失之毫釐謬之千里了。而將革命與殺人屠殺掛鈎，就更是狼子野心，故意歪曲了。\n\n\n說中國人沒有邏輯，不講邏輯。這也算是難為中國人了。連基本的邏輯辭彙含義都混淆不清，近乎詭辯式的辯證法的濫觴，邏輯關係是沒有辦法建立的。偷換概念，曲解詞義者盛行，以搏取政治好處。這基本上是六十多年來中國政治、哲學和科學界的普遍現象。\n\n所有的專制，從初期都是末日論信徒。他們相信一個舊的世界將被打碎，一個新的世界將建立。而在這個新的世界中，自己將幸運地成為選民。無論是閔采兒式的基督教革命，還是朱毛之流的所謂階級革命，莫不如此。而當革命成功之後，選民們自然成為人上之人，他們君臨天下，擘畫一切，當然也就成了新的”選民階級”。因為所有”選民”都想得到”選民”的一切，因此上最終一定會落到自相殘殺的境地。這就是一切以階層為目的的革命的最終結果，歷史上沒有一次沒有應驗過的。因此，所有以打破舊階層建立新階層為目的的革命，最終都必歸於失敗。\n\n\n我總是想到我十六七歲那年，尼采的查拉斯圖拉如是說一書四九年後首次出版發行，當時早晨五六點鐘騎自行車去西單新華書店排隊買書的情景。當時激動的心情一方面來自對西方哲學家的崇拜，另一方面來自于作為中國人首次與世界”先進”哲學近距離接觸的快感。八九之後找不到工作，被迫在圖書館埋頭苦讀了一年，才知道早在40年代，尼氏的作品早有善本翻譯。而當時的我，對民國思想的認識還停留在海國圖志的階段。其實，中國思想界自四九年被閹割之後，一直沒有再度成熟起來（民國時期中國思想界基本上已經接近人類共同成熟的標準），他們只不過從嬰兒期、兒童期、青年期一點點艱難的成長著，所出現的知識份子精英則不過是嬰兒期的、童年期的，最高不過是少年期的，充其量不過是初中校園尖子生。即便如此，還要被極權政府一茬茬割韭菜般的打壓。在這種知識層次和學術見地下，還要為引領世界，甚至得出二十世紀是中國人的世紀之類稚子托大的話，著實難免可笑。\n\n\n托洛茨基認為，共產主義人類改造計畫的目標是，通過人工干預和社會教育框架，人人獲得健康的體魄，沒有病痛和衰老，協調和敏銳，每個人心智無比的健全，愛好藝術和科學，通過教育和技術改造，使人人都能像亞里斯多德、歌德或者馬克思一樣，並站在巨人的肩膀上，完成人類的更高使命。這一烏托邦理想到了實踐中，則變成了史達林的人類改造計畫，他命令伊萬諾夫進行實驗，用黑猩猩的精子讓婦女懷孕，並謀求誕生一種強壯無比的，無需過多智慧和思辨能力，聽從指揮，以少量飲食並且能夠忍受疼痛和各種不適的新戰士，用以完成他全球共產主義化的征伐。這種理想與實踐之間的巨大差異，正好證明了反人道主義烏托邦的本質：用某種高尚的情感包裝下的罪惡欲望。它比納粹的淨化日爾曼血統的目標與過程相比顯得溫情脈脈一些，但其實質過程更殘酷血腥。順帶說一句，這種托洛茨基--史達林式的人體改造計畫，在中國可能走的更遠，像周帶魚這樣的新人類、新戰士正在茁壯成長。\n\n人道主義的”道”具有三重特性，第一特性是邏輯性的，解釋了人是什麼的問題。人的價值，人的特徵，人的思想精神所應該保守的和堅持的。如果邏輯性的人之道被打破，則人將被物化，淪為工具。第二特性是路徑性的，解釋了人是從哪里來的。今天的人何以從昨天的人走到今天，人的路徑依賴過程，以及從經驗中總結歸納提取的因果規律。如果打破這一特性的人之道，則人將成為可塑造的，割裂傳統與因果的，從而喪失底線，淪為生物。第三特性是神性的，在現有的路徑依賴和邏輯架構下，自我超越現實局限性，從而完成人格的強化。或者說是以今日之因來開創未來的新果。打破這一特徵的人之道，人類將失去希望，喪失未來，藝術文化科技的進步將停止。最終自我毀滅。\n\n我以前曾經嘗試著將法國大革命和俄國革命做一個比對，想將羅伯斯庇爾和列寧做個橫向對比。不過最近突然覺得當時的方法有問題。當年我採用的方式是，將歷史事件置入個人的思想與行為中，這種方法的問題在於過多的將歷史的責任強加於個人之上（儘管歷史中的個人或者其主觀意識形態或者為歷史過程中各種內外部壓力使然，的確值得譴責），個人成為了歷史的紐扣，於是歷史進入了宿命論的必然性，除了穿越回去將這歷史的罪魁禍首扼殺于繈褓中之外，別無他法。而當我試圖將歷史中的個人置入到歷史場景之中去觀待，卻發現由每個人共同創造的歷史，其借鑒意義和學術價值更大，因為在這種關照下，歷史中普通個人的選擇性，才可以直接影響到歷史進程本身。將歷史的責任強加到某一個個人身上的做法，是普羅大眾推卸責任的做法，是一種懦夫的做法。而中國歷史研究，普遍採取這種做法。\n"
		},
		{
			"post_id": 31,
			"title": "開普勒452b的革命",
			"date_published": 1486891414.848,
			"body": ">2015年12月4日淩晨12點，美國宇航局通過開普勒太空望遠鏡，經過長達數年的觀測，終於發現距離地球1400光年外天鵝座存在著一顆與地球近似度98％的行星：開普勒452b。這是一件可能轟動天文界的重大事件，也非常可能對未來天文觀測和宇航技術帶來天翻地覆的變化，這種變化來源於人類對宇宙的認知和對探索未知領域，以及對宇宙中可能存在的同伴前所未有的探尋熱情。也許過不了多久，第一顆外太空探測裝置將問世，並以特殊的方式，去逐漸揭開這顆宜居行星的真實面紗。\n\n---\n\n然而，這一切似乎與中國無關。因為中國科學家幾乎都在拼命研究一種稱之為“中國夢”的偽科學現象。這是中國科學界的悲哀，也是中國人的悲哀。\n\n如今，世界科學界正在醞釀著異常劇烈的變革，這種變革將深刻的影響未來世界的發展與走向。從理論物理到量子力學，科學哲學的發展正在衝擊著固有的社會哲學指導下的社會秩序。社交網路、穀歌眼鏡和3D列印，分別從三個方面動搖著傳統社會的根基：自媒體技術、自出版技術和自生產技術。\n\n新的社會將更少地依賴集體力量與智慧，更多地圍繞個體中心來發展，各人創新與個體創造將成為未來社會主流趨勢，從而個體經濟也講徹底改變社會經濟結構。眾籌模式就是這種經濟結構改變的一個開始，也許過不了二十幾年，人類社會將呈現出成熟的，與今天大不一樣的，但是更有利於人類進步和個體發展的新模式。\n\n這個模式很可能仍舊與中國無關。因為當整個世界正在從圍繞權力中心運作轉而逐漸圍繞個體中心運轉的時候，中國卻在重新回到權力中心和國營經濟的老路上，為保持權力中心運作的可行性，中國當局必然地要構造一個與世界潮流相隔絕的防火牆。這也是近兩三年中國政治局面全面倒退的哲學成因。\n\n與NASA今天淩晨的資訊爆炸更令人歡欣鼓舞的，是今年年初NASA公佈的另外一項研究結果，在NASA支持的一項長髮數十年的大學研究專案：時空漩渦理論的驗證，於今年一月終於獲得最終資料。這一實驗證實了愛因斯坦廣義相對論中一個重要的預言，就是隨著地球自傳，在地球周圍會形成一個時空的漩渦，這一漩渦是由地球品質所引發的。這一實驗的成功，為人類認識宇宙大爆炸原點以來時間與空間座標的演進提供了這個全新的認識視角：時間與空間並不是線性載體，而是與多重維度座標交織在一起的粘稠物，在這粘稠物中任何一物，由於其固有的品質與運動能量，也擁有其物自己的維度漩渦，而因籍著每一物的品質與運動能量不同，每一物所擁有的維度曲度也各不相同（這一假設是本人十幾年前做理論物理研究時提出的）。\n\n這一假設如果成立，那麼圍繞著個體社會的轉變，將更加迅猛，每一個社會人都將確立自己的社會中心地位，人類個體的解放將帶來人類社會翻天覆地的變化。\n\n從量子力學近幾十年的研究中，一些激動人心的成果也在不斷接近這一事實。例如波粒二象性： 當一個微小粒子被釋放到一個空間中，它是以波的形式存在的。但是奇怪的是，當觀察者用儀器去觀測它時，它馬上呈現出粒子的狀態。這一令人驚異的觀測結果，讓我們對這個世界的真實性產生了懷疑，它顛覆了我們對真實世界的定義，換句話說你世界的真實性只與你有意義，或者說你認為的真實世界只存在於你預設的真實當中。這一事實表明，人作為物質世界的在場者，有能力與世界產生互動式的影響。\n\n另外一個令人震驚的觀測結果，是測不淮原理：微小粒子被釋放到一個空間中，從空間的a端到b端，該粒子在所有可能的路徑上同時出現。而最終出現的路徑，同樣決定於觀察者所觀察的路徑。這一現象，可謂是徹底顛覆了人類對時間和空間早期的線性的認識，與廣義相對論時空扭曲（漩渦）理論不謀而合。比如，你可以將其想像為人類的歷史，如果人類歷史所有可能性組成一個集合，而實際上的歷史路徑，唯取決你如何去認識它。由此實驗而引發了一門新的科學概念，即平行宇宙概念。同時還引發了各種穿越小說大爆棚。\n\n各種現代科學和現代哲學，都指向一個原點：即個體中心的世界觀。這種世界觀顛覆了傳統以國家或者民族、教團為基礎的極權主義思維方式，向個體中心的豐富多彩的世界呈現，從扁平化的地球村，走向人的聯合體。今後的世界區分牛逼國家與傻逼國家的標準將是：牛逼國家擁有一批牛逼的個體人，而傻逼國家則擁有一批沒有思想的傻逼和事實上比他們更傻逼的大救星。\n\n然而，這一切仍舊與中國無關。\n"
		},
		{
			"post_id": 30,
			"title": "和提审不得不说的故事",
			"date_published": 1486824237.67,
			"body": ">二零一五年五月，因為赴約聖觀法師的飯局，我被煽動顛覆了一個月。在這個奇葩的國家，蹭頓飯都能顛覆政權，也算個樂子。所以，面對提審我的警官，我也是一副中了大獎的心態。\n\n---\n\n提審首先問我煽動顛覆政權的事兒。我說：我從89年因六四被捕至今，參與過中國文化復興運動，參與過組建中國民主黨，參與過零八憲章，也是你們武漢秦永敏先生人權觀察的最早一批觀察員，也參與過不少維權活動，應該也算得上是老資歷的運動員了，可是25年來，我連我老婆都沒煽動成功。就拿年初曲阜事件來說，大年初一我就直奔了曲阜，且不說我能煽動誰，就算你是我的親兄弟，大年初一不讓你在家好好過年，拉你去圍觀一個人權事件，還充滿了危險，我估計你肯定不去。你說我能煽動什麼人？\n\n你們看看現在參與維權的都是什麼人？訪民群體占了絕大多數。政府強拆一個村子，就煽動幾百訪民上街；下崗幾萬工人，就有幾千工人成為戰士；計生一個婦女，就煽動了一家老小，誰才是顛覆政府的煽動者？恰恰是政府。\n\n你的意思是政府煽動顛覆政府？提審問。\n\n我說：事實擺在那裏，就是如此。\n\n那你認為你反對不反對中共？他們問。\n\n當然反共。我回答：從八九年起我就反對他。用槍炮屠殺手無寸鐵的學生，難道不應該被反對？強拆人家難道不該被反對？平人家祖墳難道不該反對？嫖宿幼女難道不該被反對？經濟搞得如此之糟糕難道不該被反對？……\n\n提審打斷我說：中共也做過一些好事情吧？\n\n我回答：也有。舉個例子說吧，有這麼一個村子，所有的村民家裏都用上了高壓鍋。而村裏的一個傻逼也做了一個，不過他做的這個跟別人家的不一樣，沒有洩氣閥門。你說他一點好事也不幹吧？也不對。他每天把高壓鍋擦的鋥光瓦亮，甚至給這個高壓鍋表面鍍上金。可是，你他媽就是用金子鑄這麼一個沒有排氣閥的高壓鍋，他該炸還是得炸啊！\n\n聞罷，提審不再跟我探討這個話題，就問我怎麼看待西方的自由民主。我告訴他，西方的憲政人權民主自由，是保障人與生俱來的基本權力的保護傘。對於人來說，這是再正常也不過的事情了。而後，我話鋒一轉，說：話說回來，中國人配享受這些高貴的權力嗎？一個肆意抓捕良心犯，一個連言論都不敢發出的民族，你覺得你們配得上這些只有高貴的人才配享受的權力嗎？\n\n兩個提審半天沒說話，過了許久，才說：你也不能說的這麼絕對吧。\n\n我給他們講了個真實的故事，我一個朋友，也因參與八九學生運動而坐牢，出來後直接移民了。那年我送他，他跟我說：中國人就不值得我們付出，你為他們爭權力，他們朝你吐吐沫。\n\n這就是中國。\n"
		},
		{
			"post_id": 29,
			"title": "丁酉隨想之一",
			"date_published": 1486709567.894,
			"body": ">這是2017年春節期間，自己思考的一些片段。這些片段，曾一條條發到微信朋友圈，今天將這些思考的片段整理出來，也許會接下去繼續深入的思考。就在我寫前面這兩句話的空檔，一大波（是一大波，不是長了個大波）警員闖入我家，美其名曰找我了解情況，沒有任何手續，將我帶到派出所，問了一些八桿子打不著的事情。三個小時後，我才回到家，待心情平復下來，寫完這幾句話，將其發到零網，也算個存檔。（備註：今天是2017/2/10）\n\n---\n\n美國之所以從二戰前一個二流國家，在短短十幾年裏超越了他的老爸英國成為世界第一大國，憑藉的是他高舉著正義良知民主和人權的旗幟，承擔著世界終極夢想的義務。這是幾十年來美國所不斷付出的，也是其所不斷獲得的。如今，特朗普拋開這一切，說我應該從中獲得更多！那麼，上帝會連同他已經得到的，全部收回去。\n\n在中國，將獨裁者信成救世主的，和把佛陀信成裝飾品的，以及將神信成劊子手的人一樣多，而且多有交集。這種信仰歧視的本質，都同樣來源於專制主義的奴性，和對他所信仰的深刻的懷疑。\n\n人們總是能在意識中創造雙重標準。他們一方面批判專制主義禍國殃民的同時，卻期盼著另外一種專制主義將前一種推翻；或者他們譴責一種極端宗教屠殺人類，卻希望自己所信仰的宗教能夠將前一種屠殺殆盡；或者他們努力將自己的產品在世界暢行無阻，卻希望建一堵牆將他人的產品擋在外面。這種雙重思想的根源，就在於他們放棄了堅信自己曾經堅信的規則、制度和契約，並且放棄了對它們的守護，準備用暴力去解決這個問題。殊不知，暴力只有在維護規則、制度和契約的價值、正義和公平的時候才有效和正當，反之則必然失敗。\n\n其實，我們正在爭取的，是一個人成為他想成為的那個人的權利，以及保證這種想法能夠達成，並受到整個社會的一套由法律、道德和習慣組成的公正透明的制度公平對待的權利。這是一種自由，選擇權的自由以及對選擇後產生的結果進行承擔的義務。哪怕這種選擇是罪惡的，但畢竟選擇權本身不是罪惡也不可以被剝奪。明白了這個，你就有資格高喊：打倒極權，自由萬歲！\n\n極權主義並不是從一開始就面目猙獰的，甚至於在起初，它總是以善的化身來顯現。比如馬克思的聯合、太平天國的平等、裕仁天皇的共榮、希特勒的讓日爾曼再度偉大、土共的消滅專制等等，他們幾乎都有這同一個出身：善的出身。同時，他們也都有著同一個歸宿：惡的歸宿！這條路經在歷史上從來沒有更改過。因此我總是對偉大的人、善的事業和良好的出發點抱有深刻的懷疑。\n\n這個世界沒有人是萬能的和全知的。人對任何一個物體在不改變角度的前提下，最多只能看到它面積的百分之五十。因此沒有人能夠評判他人，甚至法律也不能。因此在判例法體制下，真正審判一個人有罪的，事實上不是法庭，而是陪審團。因為法庭沒有判一個人有罪或無罪的權利，而只有民眾有，因為只有他們才知道，任由這種行為持續下去是否會對他人帶來傷害。法庭只能夠通過一次次的庭審所獲得的經驗，來進行最後的宣判。判例法是經驗主義的，而大陸法系則是烏托邦式，它無視自由和個體，完全依靠想像來確定一個人的法律地位。他們將自己當做了上帝，卻沒有上帝的全知和全能。法律如此，推而廣之，政府也是如此。\n\n一個人因為他的局限性，和他的立場所導致的局限性，因此決定了他不能評判他人，所以才需要不同的一些人共同來評判一個事物，這正是陪審團的意義和價值所在。因為他人正站在與你不同的角度並看到這個物體你所看不到的那個面。此外，我們還需要科學進入到事物的內部和外部，需要哲學和歷史進入到事物的過去和未來。需要宗教站在事物未成之前與敗壞之後。儘管這努力很渺小，但是人們必須不斷地接近事物的真相，才能瞭解個大概。人永遠也只能走在接近真理的路上，所有標榜自己擁有真理或者就是真理本身的，都是謊言和欺騙。\n\n世界上只有兩種宗教，一種是通過造者（如上帝）去觀待所造，一種是通過所造（如宇宙）去認識造者。前者如天主基督伊斯蘭等，後者如佛道瑜伽等。但不論那種，其最終的目的都是使人認識自己。因為造者與所造，是不二的。就像達利與他的創作，即便是再頂級的藝術鑒賞家也無法清楚的說明達利或者他的畫作，達利只有他的畫能夠證明，而達利的畫也只有達利能夠說清。因此，無論是基督徒還是佛教徒，認為他能夠把握上帝或者這個宇宙的本質，都是虛妄的，因為無論對於造者和所造來說，他都是被造中最渺小的一部分。所以，人類最大的僭越，就是妄圖站在造者或者所造的整體的角度代言。人類所有的災難大多源於此，人類所有的專制與獨裁，也大多源於此。\n\n從目前經驗來看，人類宗教總體上要經歷三個階段才能成熟。拿基督信仰為例，第一個階段是黎明階段，作為耶穌的使徒仍舊在世間原本地傳播神的旨意。第二個階段，是壟斷階段。對神的信仰由少數人壟斷，比如教會，比如宗教裁判所。第三個階段是普世階段，任何人不必通過壟斷的牧者，都可以直接與上帝交集，獲得啟示或者禱告。佛教也是如此。佛陀在世三次集結到那爛陀早期，是黎明階段。那爛陀晚期到慧能前是黑暗階段，類似於基督教中世紀，佛陀的教言解釋權和懺悔權被少數僧侶所把持，甚至慧能在得到弘忍衣缽後還被追殺以至於不得不隱遁。第三個階段也就是慧能後的時代，類似於基督教宗教改革。慧能提出見性成佛，使得每一個佛教徒均能成佛，而不再受高級僧侶階層轄制（同時期還有廣弘念佛法門強調萬修萬人去的善導大師）進入到普世的成熟階段。從目前人類普世宗教來看，這三個階段必不可少的。而伊斯蘭教，目前尚處於第二階段，還沒有進入第三階段。反觀迫使基督教改革的由十三世紀蒙古鐵騎引發十四世紀文藝復興（人的復興）到十五世紀十六世紀的宗教改革。佛教也經過了周武宗滅佛到唐代的文化開放到佛教的改革。二者都有一支”上帝之鞭“迫使其改變。也許，如今的伊斯蘭教也正缺少這一鞭，而走向成熟。 \n\n我是回民，但我是個佛教徒，之所以我不信仰伊斯蘭教，除了我喜歡從瞭解所造進而認識造者之外（主要是我認知的短淺造成的），我同時也認為伊斯蘭教尚未成熟為普世宗教。什麼是伊斯蘭教成為普世宗教的標誌呢？首先，古蘭經可以用任何一個國家的語言所教授和印刷（目前只有沙烏地阿拉伯有各語種印經處），同時古蘭經可以以各國自己的語言念誦，第三，任何人都可以以自己熟悉的語言向真主祈禱和禮拜，第四，任何人都可以通過修行來獲得與真主的直接溝通，包括啟示，並且可以沒有任何障礙和恐懼地向公眾表達。這將是伊斯蘭教普世化的標誌，也是當年穆罕默德所做過的。願主安拉垂憫，將大能行於信眾之中！\n\n正是由於人的視野的局限性，沒有人能夠在一個角度上看到事物的全貌，故此言論自由是社會進步最根本的保障。沒有言論自由的世界就根本無法接近瞭解世界的真相。因為總有人是站在和你不同的角度如看待事物。在崇尚真實的表達的社會中，才有社會的進步。否則就是盲人摸象。所以說，言論自由是社會進步的根本動力，否則盲人騎瞎馬，夜半臨深池，社會的崩潰必定現於眼前。\n\n我一向認為，宗教是個人的事情。總體上應該對認識人生、認識自我、認識世界，對得救和解脫，對認識人的來源和去向，對終極的目的有所認識。我也是依照這個選擇來對待宗教。而佛教對這一點給我了很多。例如佛教教言，依法不依人，依經不依義，依了義不依不了義，對我的影響很大。讓我養成了盡可能的不依主觀意識評判人，不依言論取捨人。因此對於權力者，我也養成了從來不管他怎麼說，只看他怎麼做的習慣。說的再好聽，他所守護的價值觀卻騙不了人，是專制還是民主，一眼望去無比清晰。因此，我也不會守護善或者同情心，乃至利益。我所守護的，是一種價值觀和人類普世的，不可動搖的，可施四海而皆准的規則。\n\n對大多數人來說，真相並不總是那麼今人神往。比如生命的真相就在於你生存的每一天的意義就是一分一秒地接近死亡。比如說你填進嘴裏的每一口珍饈最終都要變成一泡屎從屁眼拉出去。於是，每一天的日子似乎都不那麼美好了，而每一口無論什麼山珍海味的美食，似乎都帶著一點兒屎味。但不管你願不願意，希不希望，信與不信，喜不喜歡，真相就在那裏，無法改變。去年秋天，漫威終於拍了一個有點腦子的電影，《神奇博士》。我覺得這部電影就是一部關於選擇真相的電影。至上尊者古一最終選擇了死亡，斯特蘭奇選擇了法師而放棄了醫生。而那塊在車禍中碎了錶蒙子的積家，則見證了他一次失敗的選擇，那次選擇他為了自己，而這一次選擇則為了他人。如果是我，我該如何選擇呢？我可能選擇用魔法修好那塊手錶，畢竟二三十萬呢，夠在北京買個洗手間了。[呲牙]\n\n因此，專制的標誌是：\n1，以一種烏托邦式的，經過想像規劃的，先驗的宗教性的、社會性的（如共產主義和納粹）或者物質性的（如美麗新世界中的大一統國）強制作為人群的整體發展目標。\n2，否定個人人生目標或者強調個人目的必須服從集體的目的。\n3，打壓、限制或者干涉個體的或者不符合所謂集體目的的言論自由。\n4，反對一切科技的、政治的、宗教的和哲學的再深入和再研究。\n5，反對一切與集體目標所依賴的宗教、哲學和其他信仰相左的其他宗教、信仰和哲學。\n6，強調集體的目標是可以實現，並實現之後可以達到人類終極幸福或者真理的，\n7，強調末世論並灌輸凡是與現有的集體目標相左的一切道路最終都必然陷入末世泥沼的觀點。\n8，對與所標榜的集體目標不同的顯而易見的事實採取避而不談的態度。\n9，習慣於通過篡改歷史來證明所設定的集體目標的正確性。\n10，鼓勵為了集體目標的達成而突破現有道德和社會價值底線的做法。\n符合以上以上十條特徵中的三條或以上，便具有極權主義傾向，超過五條便可認定為極權主義。超過八條，即可確認為最反動的極權政治。\n以上認定標準，僅為個人思考，歡迎批評和討論。\n\n"
		},
		{
			"post_id": 28,
			"title": "2017，民主的福音",
			"date_published": 1486528320.352,
			"body": ">高智晟律師說，在獄中他得到天啟，2017年獨裁體制將徹底崩潰。高律師是個虔誠的基督徒，內心純淨如孩童，信念堅定如腳下的大地。他敢言卻從不虛妄，閱歷豐富但從不圓滑苟且。\n---\n\n柴寶文2013年就曾經神秘地告訴我，2017年將是獨裁主義的大限。我問他為什麼是2017，他神秘地笑笑說，他請教了幾位高人，擺卦擺出來的。而且是好幾位精於此道的高手不約而同地得出這一結論。\n\n我對高智晟、柴寶文的預測是深信不疑的。年輕時閑的沒事，也喜歡研究些讖緯之學，幾年前突然想起，將《推背圖》、《燒餅歌》、《馬前課》、《萬年書》、《黃檗禪師詩》等古代預言進行了一次參同研究，得出的結論也指向2017。\n\n如果你認為這只是一些術士騙人的把戲，那就錯了。事實上，政治經濟科技與文化，是人類歷史發展的四駕馬車，而天啟文化或者東方的讖緯文化，恰好是文化這駕馬車上不可或缺的一個部分，它貌似天馬行空渾然不羈，但是卻暗合社會發展方向。\n\n昨天和前天，兩條新聞被放在國內新聞網站最不起眼的地方，很多人沒有注意。昨天的新聞是：美國國會批准通過解禁美國長達四十年的原油出口。前天的新聞是：德國開啟全新的核聚變實驗裝置，將產生核聚變的環境控制延長到30分鐘。前不久美國著名軍火商馬丁公司發佈消息稱，其核聚變研究取得突破性進展，並在小型化方面取得成功。再往前推三個月，石墨烯電池技術取得突破，這一技術一旦獲得成功將徹底改變現有電池技術，無異於一場能源革命。順帶說一句，石墨烯作為新新材料，其革命性的應用領域絕不僅僅電池產業，在光伏發電、電子通信、基礎材料等領域都有廣泛的應用前景。\n\n所有的前沿科技都指向一個事實：人類擺脫對化石能源的依賴已經指日可待。而縱觀世界上所有獨裁國家，幾乎沒有一個不是靠對基礎能源的控制，作為其獨裁統治的經濟保障的。從茉莉花革命至今一大批獨裁政府的倒臺，無不是伴隨著基礎能源領域正在發生的這場革命而來。獨裁政府一旦喪失了對基礎能源（生產資料）的控制權，也即意味著喪失了對社會的控制權。\n\n現代民主制度的基礎，就是人的社會化解放。個體所能獲得的生產資料逐漸豐富，使得政府的管控能力越發下降，最終獨裁崩潰民主到來。以前獨裁政府依靠手中的權力壟斷生產資料謀取暴力的時代終結，甚至獨裁者手中囤積的大量生產資料成為獨裁者自身的負擔，崩潰即在眼前。\n\n未來的世界格局將是原子化的。每一個成人個體都將成為社會中不可低估的一股力量。僅以應用科學的發展趨勢為例， 社交網路、穀歌眼鏡和3D列印，分別從三個方面動搖著傳統社會的根基：自媒體技術、自出版技術和自生產技術。這三項技術大大增強了個體的社會能力，同時削弱著政府（集體）的權利基礎。\n\n權力的本質就是分配資源，好的權力較為公平地分配資源，壞的權力完全憑喜好或者憑貪婪的欲望分配資源。而民主社會的發展和其未來的價值，就在於為原子化社會打下基礎。生產資料再也不是制約社會進步的必要條件，而人才成為發展的價值核心。\n\n這也就是為什麼發改委如此恐懼國際原油價格下跌；也是為什麼烏鎮護臉網大會會提出“互聯網主權”這一奇葩概念。他們喪失了對傳統資源的控制，他們正在千方百計獲取對新資源的控制權。\n\n互聯網是未來社會經濟發展的重要資源，可惜，這一資源本身不具有稀缺性，且基本上不具有獨佔性。而且，控制這一資源所涉及的成本，更是一個天文數字。除非你像朝鮮那樣，自絕於國際社會之外，完全關閉互聯網。\n\n如果說上一次世界革命是資訊化革命，那麼這一次將是原子化革命，也就是人的革命。個體創造力被全面解放，同時伴隨著獨裁統治的徹底消亡。\n\n為時不遠，我們2017見！"
		},
		{
			"post_id": 27,
			"title": "我就靜靜地看著你們裝逼",
			"date_published": 1486462300.401,
			"body": ">據葛永喜律師發出消息，二零一五年十一月十七號這天，柴寶文兄（曾用網名：合肥潑婦男、野茉莉走天涯）因涉“散佈謠言罪”案，將於哈爾濱香坊區法院開庭。柴寶文是黑龍江訪民徐純合在黑龍江慶安火車站被槍殺後，第一個被拘捕的民間維權人士，同時也拉開了大規模打壓公民圍觀和維權律師的序幕。而今，柴寶文的開庭，是否也預示著後續公民和律師群體逐漸進入庭審程式不得而知。如果真是這樣，對於身在監房中的人來說，也許是件好事.\n\n---\n\n寶文案值得關注，是因為這一案件的開審，是《刑九》修正案“謠言”入刑後第一起審理的“散佈謠言罪”。如何審理，如何宣判，判多少年等等，都有一定的風向標的作用。基本上也可以視為後續案件審理和審判的標杆。那一眾被非法關押的兄弟姐妹，即將承受或長或短的牢獄之苦，每每想到這裏，心情就莫名地沉痛。\n\n認識柴寶文，是在新浪微博風起雲湧的那段日子。特別是合肥小安妮事件期間，柴寶文幾次深夜給我打電話，訴說事件的進展，邀請我前往合肥，一起圍觀這起踐踏未成年人自由受教育權利的案件。遺憾的是當時我正在參與一個經濟項目，一直沒有能夠成行。專案結束我匆匆趕往合肥的時候，小安妮事件已經以悲劇收場，柴寶文等幾位朋友已因此身陷囹圄，張琳和小安妮也已經被遣送回到蚌埠。到了合肥，連忙趕到看守所，為已經被拘留的朋友存上一點生活費。之後我趕往蚌埠去看望張林和小安妮，可惜到了樓下，直接被全天二十四小時守候的“熊貓”，送上了離開蚌埠的列車。\n\n後來，寶文特地來北京看我，我們喝酒談天，無日不歡。再後來，合肥事件開始秋後算賬，我得知寶文流落深山，當時我還很羡慕他，一個人在山野裏流浪，寄情於山水間，倒也落得個灑脫。再後來，似乎風聲過去了，寶文回到合肥，可惜沒幾天，就因為慶安事件，再次入獄。\n\n在中國，關注一些社會熱點事件，是要付出沉重的代價的。這個沒有公義和法制的國家，有的只是一些嘴上不能說，但是每個人心裏都揣著明白裝糊塗的“規矩”，柴寶文他們只是“規矩”的受害者之一。在這個不講法律只講“規矩”的時代，誰又能逃脫懲罰呢？即便是這些“規矩”的制定者，也未必就能逃過這些“規矩”的嘲弄。想當年共產黨中最講“規矩”的劉少奇，遇上了老毛的“規矩”，也就只有手舉著“憲法”當“擋箭牌”的份。做人莫裝逼，裝逼當心遭雷劈。\n\n說柴寶文是傳播謠言，本質上就很裝逼。在中國從事過媒體的人，心裏都“門清”，如果柴寶文的質疑有罪，那麼中國所有的媒體記者都有罪，誰沒向有關方面索取過“紅包”？誰沒拿過“車馬費”？這種報導風格，這種報導方向，行內人一看就知道怎麼回事，只是大家都不說破而已，因為死無對證。但如果柴寶文的質疑算是“傳謠”，不知道央媒的“畝產萬斤”的報導算什麼？俄羅斯歸還中國4.7平方公里土地的消息算什麼？那個在央視信誓旦旦地對女粉絲保證股市能漲到一萬點的二貨又算什麼？\n\n你不能質疑我說謊，但是我可以追究你造謠，這豈止裝逼！\n\n對於強盜來說，所有君子之道都是邪路；對於騙子來說，所有真相都是謠言；對於只背過書名的文盲來說，所有閱讀過書籍內容的人都是無知；對於眼中只認得錢的流氓來說，所有對人性的追問都是“圖樣圖森破”。誰都知道強盜、騙子、流氓和文盲是不能長久的，但是我懶得說，就默默地看著你們裝逼。\n\n在遙遠的北方，柴寶文即將接受他們的審判，而在遙遠的南方，我只能深深思念我們的兄弟柴寶文。\n"
		},
		{
			"post_id": 26,
			"title": "大降準後的經濟崩潰線路圖",
			"date_published": 1486353657.367,
			"body": ">這篇文章大約完成於2016年的4月份，因為在新浪微博發表的頭條文章經常被刪，自己當時又偷懶沒有留下備份，因此尋找這些被刪除的文章，多少有些困難。而記起這些文章的寫作日期，更是一件難上加難的事情。這篇文章預測了接下來兩年到三年間中國經濟可能的發展路徑，今天還是可以借鑒的。\n---\n\n昨天寫了關於股市必然崩盤，散戶必將被割頭的預測，下午央行就爆出消息，將準備金利率下調一個百分點。4月20日一早，上證指數果然高開高走，截止到上午十點，已經衝到4300點高位。\n\n這次大降准，共本來的目的只有一個，就是釋放流動性，催生企業貸款力度。但結果也只能有一個，就是繼續拉高股票泡沫。這本是當局不願意看到的結果。因為中國目前面臨的主要矛盾，是日趨下行的經濟壓力，以及在這種經濟壓力下已經產生和可能產生的社會矛盾。說白了，大降准的目的是要解救日趨頹爛的實體經濟，因為實體經濟不振所導致的大失業，將為未來社會動蕩與變革，提供廣泛的失業人群，裡面保不齊就湧現出幾個李自成、高迎祥、張獻忠。\n\n中國實體經濟的崩潰，我早在2006年任《中國企業導刊》副主編時，便寫過一篇文章，題目是《中國無製造》，2004年在《中國財富》任管理版主編時寫《日立獨立日》時，便有了基本思路。中國經濟發展，遵循的不是一般性經濟規律，而是叢林法則的規律——弱肉強食——奴隸主壓榨奴隸的規律。\n\n因此，在奴隸不具備造反前景的情況下，奴隸主一定是以利益最大化作為基本策略，拉高房地產業的經濟比重，是利益最大化的選擇結果。而今，房地產神話已經破滅，拉高股市收割民間儲蓄資本，則成為一個可行的選項。\n\n這也是為什麼包子敢於在上台後四處撒錢，大搞亞投行、一路一帶這些指標性工程，憑的是巨額的外匯儲備和民間儲蓄。這種納粹式的經濟擴張，旨在獲得外在的認同感和提升內部認同感，至於扔出去的錢是落地生花還是肉包子打狗，則不在凱子外交的考慮范圍。\n\n但是，就老大個人而言，中國夢是光明的，底層的現實卻是殘酷的。這幾年實體經濟的下滑，導致的社會矛盾、群體性事件及暴力犯罪率激增，卻是所有人都看到的現實。\n\n奴隸不造反的因素只有兩個：可預期的長期穩定收入和可能擺脫奴隸地位的機會。對於中國來說，前者是工作崗位，後者是公務員考試。而今的現實是：工作崗位日趨減少，失業率大增。公務員考試更是和尚撐傘——擺設，考得上考不上另說，即便考上了，在講求血統，且越發講求血統的中國，你也不過是奴隸主身邊的狗腿子，想擺脫奴隸身份？還是下輩子託生到李剛家吧。\n\n這下明白提振實體經濟的重要性了吧。但是，造成實體經濟萎靡不振的根本原因是資源壟斷和高賦稅，這兩個問題不解決，光靠錢來刺激，根本就是揚湯止沸。可是，要放開壟斷或者降低賦稅，對當局來講又是釜底抽薪。因為高壟斷帶來的是權貴集團對現政權的鼎力支持，除了權貴集團之外，中國已經很難找到對現政權採取支持態度的階層了。而高稅賦則為現政權爭取國際支持，樹立大國形象，支撐經濟納粹，控制國內思潮氾濫提供了強大的資金支持。\n\n這才是當局所面臨的囚徒困境的根本。提振實體經濟的所有手段，都會流入到虛擬經濟的泡沫中去。而如果不能切實地提振實體經濟，便是重蹈福祿宴、七殺碑到煤山歪脖樹的覆轍。\n\n因此，下一步當局可能出台引導釋放的流動性轉入實體經濟的政策，但可惜的是為時已晚。如果央行不能出台打壓股市的政策，則降準的目標無法實現，釋放的流動性必然繼續進入股市，對企業沒有任何意義。如果央行出手打擊股市，強迫資金流向製造業和服務業，則股市崩盤，中國社會面臨崩潰。"
		},
		{
			"post_id": 25,
			"title": "小說：都市無聊",
			"date_published": 1486283800.593,
			"body": "><b>一 </b>\n>李科從長城飯店大堂一出來，立刻被蒸籠一樣的城市熱浪吞沒了。他沖門童一招手，門童立即替他叫來一輛計程車。 \n---\n\n去哪兒？司機問。 \n去機場。\n未等門童伸手替他拉開車門，李科便迫不及待的一頭鑽進了車裏。\n時間不夠了。 \n司機麻利的一把按下計價器，兩手讓人眼花繚亂的在方向盤上胡嚕了幾下，車子便象城市困獸般地駛上了寬闊的馬路。\n李科靠在後車座上，緊張地抬腕看了看手錶。快點兒快點兒快點兒快點兒，他心裏默默地念叨。要不是昨晚那個和他纏綿了一宿的自稱姓劉的小姐，他也不至於這麼狼狽。色欲炙心，這個詞用在他身上再適合不過了。可他就是改不了。記得那本讓他翻爛了的佛經上說，象他這種人死後要墮阿鼻地獄，炮烙千回方可超生。每次他讀這本佛經時，都要出一身冷汗。但冷汗歸冷汗，並不能減輕他對同女人上床的欲望，漸漸的，他開始喜歡起這種出冷汗的感覺，而且每次都伴隨著高潮。他甚至還把精液射在那本佛經上。\n死後墜地獄，像我這種人還能奢求什麼呢？對此，他深信不疑。儘管他是學量子物理的，他覺得這個物質能量世界的後面一定還有個反物質的世界存在，否則就有許多科學上的事情解釋不清。 \n腦子裏亂七八糟的，從佛經到高能物理，從地獄到射精，李科突然有一股想毀滅一切的欲望。\n看著窗外逐一而逝的人們，表情麻木，動作機械，象他一樣找不見生存的座標。\n你們每一個人都會下地獄！\n下地獄！\n他象個巫師一樣在心底裏詛咒。 \n這次回中國來是受美國斯坎泰拿空間物理研究所的委派，同中國航太航空總局簽定一份合作協定。此外，他還接了個私活，替局下屬的一家公司指導了一個課題專案，賺了一筆，所以比同來的洽談團晚回去了一個月。\n中國人哪怕被槍頂在太陽穴上，腦子裏也只想著賺錢。\n面對美國同事的諷刺，李科不是不在意，而是沒時間在意。\n移民！即使所有的美國人都把他這個拿到綠卡才三年的黃種人的美國人看，他也沒辦法自己把自己當美國人。\n回想三年前在美國星條旗下宣誓的時候，李科不禁覺得有點可笑。中國人是窮怕了的，好容易撈到機會，除了拼命賺錢錦衣歸故里，還能幹點什麼？所以他什麼都能忍。把所有的煩惱都壓在心底，等再也壓不住了的時候，他就找個女人好好發洩乾淨。\n 可如何又能發洩乾淨呢？煩惱如同麥地麻雀，趕跑了，還會飛回來。 \n李科突然想到自己近來找女人的次數越來越多了。 \n窗外的車輛行人房屋樹木一幀幀的凝覡於窗前，未等看清又逐幀逝去。 \n垃圾！ \n他腦子裏又閃過這個詞。\n前幾天偶在馬路邊上看到一條“不准亂倒垃圾”的標語，他便一下子陷入了這個詞的陷阱無力自拔。 \n垃圾。誰是垃圾？誰製造垃圾？人類的垃圾！垃圾的人類！ 都是垃圾！ \n也許回到美國後，他會在家裏供奉一個垃圾桶，誰知道呢？ \n思緒漫無目的，離起飛還太遙遠。 \n李科突然發現司機正從後視鏡裏上下打量著他。 \n\n<b>二</b>\n這人眼睛也忒毒，不象個好鳥兒。\n司機從後視鏡裏盯著後座上的這個乘客好久。心裏暗自尋思。 \n恰在這時，一個黑影撲面而來。他嚇了一跳，猛一回輪，與對面兒的一輛大卡車擦著風聲而過。好懸！原來走神之際，他竟駛上了逆行道。 大貨司機從敞開的車窗裏探出那顆光禿禿沾滿汗珠的腦袋，瞪著兩隻驢眼，回頭怒駡了一句∶ 你丫找死呀我操！ \n\n<b>三</b> \n陳生今兒憋了一腦門子的惡氣，把個大貨車開的瘋瘋癲癲的。罵了那個瞎了眼的捷達司機一句，心中的鬱悶才稍微緩解了一點。\n他一把扶著方向盤，一手把一盤破爛不堪的磁帶塞進了答錄機。 \n“……哥哥你岸上走恩恩愛愛……” \n什麼玩意！ 他一把又把錄音機關上。 \n車窗都開著，可一絲風都沒有腦門上的汗珠沾著蒼蠅，癢癢的難受。 \n不就是一個收破爛的嗎。 \n本來陳生今兒是不想出車的。天兒熱的邪乎。可那浙江來的廢品站老闆卻腆著個肚子非讓他把一車鋼材拉到鋼廠去。 \n憑什麼呀。不就有幾個錢嘛。再有錢也是個他媽的收破爛的。\n陳生一想起那大肚子就膩歪。堂堂一個北京的大老爺們兒給一外地收破爛的老冒支使得半死。 \n陳生為自己這三○年生不逢時慨歎。 \n上學那陣鬧文革，小學沒畢業就不上了，跟胡同裏的小痞子整天胡混。因為愛打架，兵也沒當成。大點兒了忙著張羅媳婦，可那會兒原來一塊兒混的哥們卻忙著擺攤做買賣。等自個兒轉過這根筋來，小買賣又讓人給做爛了。好不容易找了份工作又趕上那家工廠倒閉。想學個車本，偏這會兒老婆肚子又大了，等孩子上了學，借錢學了車，誰知司機又不吃香了，招聘司機的單位到去了不少，可人家要三年駕齡往上的。最後還是老婆的娘家托了個三杆子打不著的親戚給他找了這麼一個替廢品站開車的活。 \n煩！這天兒！ 連陣風都不捨得刮，什麼世道！ \n他那厚實的大手一把拍在方向盤上，嚇走了一隻叮在他滾圓的胳膊上的一隻蒼蠅。 \n老婆在家也不知道幹什麼呢。下崗之後她到自在了，整天跟人家打牌。陳生早就憋著找茬揍她一頓，可又不敢。如今找個媳婦不比找個工作容易，何況他這條件。 孩子也不讓他省心。前兒偷偷把老師的教鞭給撅了。老師讓同學給帶話來，要請家長呢。 \n還有那可惡的大肚子！\n陳生不知不覺又想起大肚子時常掛在嘴邊上的那段話∶ 人活著就得吃苦哇！吃苦就是享福哩！當年我一個人來北京，身上什麼都沒有，揀垃圾呀！什麼都揀，紙呀、塑膠呀、饅頭呀……你吃過沾著屎的饅頭沒？我吃過，沾著屎呀…… \n陳生真想抓過一泡屎橛塞進那張大嘴裏去，看他怎麼把它吃下去。可他不敢，人家捏著你的飯碗呢。 \n有勁沒處使，憋在心裏難受。想想以前在街上混的時候，抄起板磚看誰不順眼就往死裏拍！ \n他媽的那個逼！ \n吼了一句，腳底下一使勁，油門到了底。\n \n<b>四</b> \n韶華靠在樹幹上，從丁雨頭頂長髮的縫隙間望去，正看見那執勤的交警。\n那員警夠壞的，沒事兒就往樹林裏一躲，等有車過來他才鑽出去。韶華替他算了算，不到一個鐘頭他就罰了十七個司機。就屬剛才那大貨司機好玩兒，車開的飛快，那員警蹦出去一伸手，他就來了個急刹車，差點兒撞那員警身上。那禿腦殼司機跳下車來，奘的比那大貨車還鑿實。韶華本以為那大貨司機能跟那員警叫叫板，誰知他一下車，那腰彎的比蝦米還低，滿臉賠著笑，鋥亮的腦門直晃的員警往後躲。 韶華忍不住笑笑。 \n樂什麼哪？ 丁雨從韶華寬闊的胸膛的陶醉中抬起頭來問道。 沒，你那頭髮進了我的鼻孔。 \n丁雨嗔了一下，複又把頭埋進韶華的肩膀。 \n回去吧。韶華說。 \n丁雨扭動了一下身子。 \n我還有事呢。 丁雨又扭動了一下身子。 \n唉—— 韶華長長的歎了口氣。\n他也不知道自己為什麼歎氣，現在不是挺好的麼？可他就是想歎氣，而且長長的歎氣，經常地歎氣，毫無目的地歎氣。歎氣幾乎貫穿了他二十三年的生活。他清楚地記得自己第一次歎氣時，還是五、六歲的時候。那時媽還不老，她說： 這孩子，小大人似的。 \n小大人。這個詞一直深深地藏在他記憶的深處，一旦他歎起氣來的時候，便如剛睡醒般地跳到他流動的如平靜的溪水般的思想裏，濺起一個漣漪。 \n也許不是。也許是小大人先跳出來才引得他歎氣也不一定。 反正他歎氣。 反正他也不知道自己為什麼歎氣。 \n唉—— 丁雨隨著他長長的歎息又往他的懷裏鑽了鑽，象個受了驚嚇剛找到安慰的小兔子。 \n這丫頭什麼都好，就是太纏人，纏的他有點煩有點怕又有點不舍。不是不舍而是舍不下。在家裏韶華是獨子，從小都是別人捧著抱著保護著的對象，如今終於找到保護疼愛別人的感覺了。丁雨長的不好看，若不是喜歡她小鳥依人不言不語的感覺，韶華早就把她甩了。 韶華承認他和丁雨在一起時總是無法專心，但他又不能不承認一旦和她分開又不能不想她。 \n唉—— 你又歎氣了。丁雨在他懷裏喃喃地說。 \n也許韶華生來就是為這個世界歎氣的。\n小大人，大小人…… 走吧走吧。怪熱的。 \n丁雨又扭了扭身子。 \n韶華輕輕挽住她的長髮，稍一用力，她那還帶著稚氣的小臉便揚了起來。韶華把嘴唇按在了丁雨的嘴唇上。 \n嗚。丁雨悶叫了一聲，不知是頭髮被韶華拉疼了，還是為了別的什麼。 \n女人就是要別人疼的。能感覺到自己被人疼的女人才是好女人。\n韶華又走神了。他抬起眼皮向樹林外望去，員警不知又躲到哪里去了。 \n那女孩真漂亮。他看到一個白衣白裙的女孩騎著車從路上經過，還轉過頭朝他們這裏望了一眼，正好露出高聳的胸脯。 \n\n<b>五</b> \n張瑩騎著車，想著自個兒的心事。\n剛才偶爾瞥見路邊樹林中有人在接吻，讓她心理突突直跳了半天。她剛17歲，還是個實習護士，與異性的接觸還屬於神秘的未知領域。但她想，但她不敢。 \n以前她從來是不騎車的，但是今年不行了，去年的公共汽車成了她惡夢的發源地。特別是到了夏天，幾乎每天都有男人在她的身後蹭來蹭去。有一回，還有個男人把手伸到她裙子下面，摳嗤了半天，直到汽車靠了站，她才狼狽的跳了下去。後來心理還一直硌應了好幾天。從那開始，她便吵著家裏讓她騎車上班。但車上的遭遇，除了自己特親密的女伴之外，她是死也不敢講的。 \n但有時…… 特別是當滿載著汗臭味兒的公共汽車飄過她身邊的時候，她又幻想自己是那車上的一員，而且還有個特瀟灑的男孩緊緊靠在她的背上，手放在……當然是特溫柔的。 \n張瑩覺得自己臉上騰的一紅。想這個幹嗎？她朝左右看了看，怕被別人看出什麼來。 \n也許是昨天聽的那首歌兒的緣故吧。 “別說這是美麗，青春的你。你不過還是有個，性感的身體。會有人愛上你跟你有關係，現在你還太純潔，現在你的瘋狂還是秘密。” 性感。張瑩此時幾乎快要感到自己的性感破體而出了。她低頭看了看自己的身體，只看見薄薄的襯衫已經被汗水濕透，露出貼身的帶有花點兒的乳罩。\n她一陣緊張，生怕別人看見。可偏偏發現這會兒正有個男人直愣愣地盯住她的胸脯。 \n這人真無聊。一陣尷尬的情緒蕩過之後，她腳下加了力氣。 \n\n<b>六</b> \n其實李澤豐並沒有去看女孩聳立的胸脯，他的目光透過她們的身體，透過她們身後的樹林，樹林後的房子和房子後面的房子、公路……一直投向遠方。 \n其實他什麼也沒有看，雖然他睜著大大的眼睛。 \n這眼睛讓我感到不寒而慄。絕望。這詞兒也不準確，其實他眼裏連絕望都沒有。作為一個作者來說最怕碰到的就是這種眼睛，因為你無法從中讀出故事來。 \n可這種眼睛卻越來越多。你隨時可以在大街上，公園裏，學校課堂上，體育比賽場地上碰到幾個。\n只要你有一顆敏感的心，在你周圍環視一下，你就會發現你幾乎被這種眼神包圍了。 救救眼睛！救救人們的心靈！ 絕望的眼睛。麻木的眼睛。 \n他有多大？20、30、40、50……都差不多。北京人、河南人、安徽人、廣東人都象又都不象。一件街上到處可見的那種廉價仿冒的蘋果牌白色T恤，一條藍色的長褲，一雙帶網眼的人造防牛皮皮鞋，頭梳的很整齊，但仍舊顯得散亂。眼睛剛才說過了。鼻子癟癟的。嘴唇發幹，沒有血色兒。全身上下沒有一丁點兒特別的。象你、象我、象他。只不過我們總把絕望藏在眼裏希望的後面，而他卻是滿眼的絕望沒有半點希望。我們總把死亡藏在生活的後面讓人看到我們並不恐懼，而他卻是渾身上下散發著死屍的味道特別是在這大熱天裏。 \n我不敢再看。我恐懼。 \n雙目無神的他就靠在路邊的一根電線杆子上，象負了千年重擔，偶爾卸在路邊喘口氣仿似。 我的心一陣緊似一陣。攥著筆的手滲出了一層細汗。這悶熱的天氣，憋著雨呢！\n李澤豐在想什麼？也許什麼都沒有想。想什麼呢？國家大事兒離得太遠，向天安門城樓上的紅燈籠，除了幾個掛著牌牌的，別人誰也甭想摸到邊兒。想生活？生活有什麼好想的，日子一天一天的過，吃飽了睡覺，有錢吃點兒好的，沒錢將就填飽肚子。想幹點什麼都有人管著。單位有頭兒，家裏有老婆，出門有員警，還有他們後面印成本兒的和沒有印成本兒的法律、道德和傳統。想那事兒？更沒勁了。每天晚上他一爬上老婆乾巴巴的身子就想趕緊下來。白天沒話說，晚上就覺得空虛。也許在他身下的是不是他老婆都沒有關係，他就是對著空氣也能完成這恒古不變的責任似的性生活。\n他比死人還徹頭徹尾的死人！\n時間在飛快的隨著我的思緒跳動，許久，他突然動了一下，細微的一下，只是把腳後跟落在地上，便又凝固了。 他的凝固就是整個世界的凝固。天、水、風、火！腳下的大地為什麼不裂開，吞下我們這些懵懵懂懂的人們！ 我祈禱。 \n太陽帶著人類的髒血落到山那邊去了。也許明天還會有一個新的。 \n李澤豐終於跺了跺腳，抖落了一身的灰土，緩緩的扭身向亮馬橋的立交橋走去。剛巧走過亮馬河大橋的時候，突然一個女孩朝他的絕望跑了過來。 \n嘿，先生。玩玩去？ 李澤豐木然的搖了搖頭，走過橋頭去開自個兒的自行車。\n身後傳來一陣銀鈴般的笑聲，帶點兒諷刺。 \n\n<b>七</b>\n孫星星重又回到她的姐妹們中間去，一蹦坐到橋欄杆上。姐妹們的笑讓她有點不好意思起來。 \n你要從良呀，嫁個騎自行車的？ \n去你的。孫星星說。說完就抬起頭看星星。\n天還沒全黑，諾大的天穹上只有一顆星星在閃亮，把在它旁邊的月亮映的象簿紙似的暗淡無光。等會兒月亮就該亮起來了。孫星星總覺得月亮一出來，星星就變得傷感了。 \n雛兒就是雛兒嘛。耳畔又傳來姐妹們的調侃。 \n星星懶得答理她們。 今天這身打扮她還覺得滿意，緊身的露臍背心，黑色的短裙。身後還背個皮制的小包，走起路來調皮的一蹦一蹦的。她聯想到自己的乳房，聯想到昨天那個自稱姓李的美籍華人解不開她乳罩後面的紐袢的一副猴急的樣子。今天她沒敢再帶那乳罩，她怕客人發脾氣。有的客人發起脾氣來就不管不顧，弄的她幾個晚上上不了班。\n本來她今天下午沒事兒逛燕莎，想買那條墜著小金菩薩的項鏈，錢都取了，可又回想起前幾天老大姐被客人拽走了項鏈還打掉了兩顆槽牙的事兒，便把錢又重新存了起來。 \n嗨，攢著吧，攢著吧。腦子裏雖這麼想著，可那金晃晃的小菩薩總在她眼前晃晃的。 \n李雯挽了個黑熊似的老外打她面前經過，還沖她擠了下眼睛，打亂了她的思緒。 李雯總喜歡跟外國人幹，還勸她找個老外算了，還纏著她要幫她介紹個出手大方的。她不幹。她不喜歡外國人，一是怕，二是覺得沒有情調。誰也聽不懂誰說話，整個兒跟牲口差不了多少。 \n孫星星希望今兒個能碰到個有錢而且英俊瀟灑的，最好象HOT。那天HOT的演唱會她去了，還哭了一鼻子。哭什麼呢？她不知道。 \n月亮終於上來了。星星漸漸的悲傷了起來。可星星有什麼可悲傷的呢？它無始無終，沒有過去也沒有未來，沒有親人也沒有敵人，沒有歡樂也沒有悲傷，有的只是無盡的等待。 孫星星還在等。暑氣退了，從河水裏泛上來陣陣涼風。 許久許久，她多少覺得有些無聊。\n\n————————————————————————這篇小說大約寫於十年以前"
		},
		{
			"post_id": 24,
			"title": "被踢屁屁中國的未來慘狀",
			"date_published": 1486180147.271,
			"body": ">這是2015年10月左右寫的一篇文章。儘管目前美國已經宣布退出TPP，但是中國經濟與世界經濟的格局結構，仍舊是一樣的。這篇文章著重於分析未來中國經濟的走向，有部分內容還是值得參考和借鑒的。\n\n---\n這幾天主要目光都盯在最重要的這次TPP成員國部長級會議上。事實上，從兩個月前我便開始醞釀這篇文章，只是TPP相關協定還沒有達成，因此一直遲遲沒有動筆。2015年10月5日的傍晚，參與協定的十二個成員國最終終於艱難地達成了協議，只等各國國會批准，即可生效（這個不難，因為談判及談判底線事實上已經是國會授過權的）。\n\n而這個不帶中國玩兒的“踢屁屁”遊戲一但開始，將怎樣影響中國的政治、經濟、文化乃至國土安全，是我主要關注的問題，各位看官容我一一道來。\n\n<b>TPP的深遠意義?</b>\n\n我在幾個月前一篇不太受關注的關於理論物理的評論文章《開普勒425b的革命》一文中，曾經提到過一個觀點，就是未來的國際社會將越來越呈現個人化趨勢。社交網路、穀歌眼鏡、3D列印和眾籌金融，將分別從四個方面動搖傳統社會的根基：自媒體平臺、自出版技術、自生產技術和碎片化金融整合平臺使得每一個自由民都可能獨立通過這四種新技術，來完成現在必須依靠社會力量才能完成的工作。\n\n新的社會將更少地依賴政府的力量與智慧，更多地圍繞個體中心來發展。個人創新與個體創造將成為未來社會的主流趨勢，也許過不了二十年，人類社會將呈現出成熟的、與今天大不一樣的，但更有利於人類進步和個體發展的新模式。\n\nTPP協議的簽訂，其最深遠的意義就是：通過免除關稅、國有企業私有化等相關內容，更大程度上從經濟方面限制了締約國政府的權力，更有效地激發了民間個體的活力。TPP一但簽署生效，未來數年內，政府的作用將越來越小，全球將更迅速地進入扁平化、多極化和自由化。當然，除了中國等其他國家以外。但前提是，到那個時候，中國與其他國家還能夠存在。\n\n<b>大規模失業潮帶來政治動盪?</b>\n\n美國和日本是中國目前最大的貿易夥伴，而一但TPP協定正式實施，這兩個最大的貿易夥伴將消失，中國的進出口貿易將一落千丈。與從49年開始到90年代末期中國面臨的國際封鎖不同的是，那時候中國還能夠通過第三國與世界發生貿易，而TPP原產地原則則徹底地斷了中國的這條後路。2013年，中美貿易額為5821億美元，中日貿易額為3127億美元，兩項總計8948億美元。而2013年國家統計局公佈的經濟資料中，全年進出口總額為41603億美元，美日兩國占去21%以上。這還不包括通過第三國轉道進出口的資料。如果我們以2013年中國與美、日貿易額為基數，建立一個基準模型，綜合GDP、就業、價格、工業產值等相關權重對國際貿易的依賴。然後假定TPP十二成員國自2016年起一次性將關稅降至為0，再測算上述相關權重指標得出的結論是：由於進出口貿易的嚴重受損（大約損失1/4到1/2左右），那麼中國經濟受損將超過50%。\n\n這將意味著什麼呢？首先，製造業將面臨垮塌式的倒閉潮。因為中國在近三十年的經濟增長中，一直發展出口型導向經濟，使得中國經濟發展不得不依賴於進出口貿易，儘管當局一直叫嚷著拉動內需，但是為了滿足其驕奢淫逸的特權階層的利益，對民間財富一直採取橫徵暴斂的態度，拉動內需有風無雨。因此，一但進出口貿易額大規模受損，面向出口的製造業將因為失去市場而面臨崩潰。\n\n有人說TPP的達成將導致中國經濟崩潰，進而導致政治崩潰。這是不對的。我常說：對於奴隸制國家來說是不存在經濟危機的，因為奴隸制國家奴隸沒有財產自決權而奴隸主則有無限的財產自決權（通俗地說就是奴隸制國家一切財富都是由奴隸主支配的）。中國十三億人口平均從每個人身上每年扒走1000塊錢不見得就顯山露水，但是填補中、美、日貿易額的財政虧空卻綽綽有餘。呵呵，別以為這不可能，近幾年來隨著製造業轉移，他們一直是這麼幹的。\n\n但是TPP的達成導致製造業崩潰，將導致大規模的產業工人失業卻對奴隸主來說是致命的打擊。當這個國家中一大批奴隸無所事事的時候，會發生什麼，恐怕連魔鬼都不知道。上個世紀末進行的所謂國有體制改革，帶來的下崗工人潮所造成的社會動盪，至今經歷過的人可能還會記憶猶新。最終政府不得不通過武警、特警、城管、輔警、保安等一大批新增行政隊伍吸納眾多的無業人員，使得中國政府從上到下越來越黑社會化，至今餘毒愈演愈烈，尾大不掉。無數沒有執法權的執法隊伍成為政府的“家丁”，也使得無數地痞無賴獲得了以前連想都不敢想的進身權力階層的通道。\n\n而這一次的失業潮的規模將比上一次的下崗潮來的更迅猛，數量也更龐大，隨之帶來的各種社會問題，將在三到五年內成為影響中國社會和政治的主要因素。\n\n<b>民間購買力大幅下降與大饑荒?</b>\n\n隨著製造業的倒閉，建立在製造業基礎上的金融泡沫也將隨之破滅。股市即將一落千丈，而暴跌潮的起點，將從這個長假後的第一個交易日開始。儘管“國家隊”有可能再次通過大規模補倉，給自己挽回點兒面子，但是這次時間一定不會長久，大壩崩潰在即，靠幾根稻草撐住是異想天開。而伴隨著金融業的崩潰，人民幣貶值將一發不可收拾，別忘了美聯儲加息的達摩克利斯之劍將在十一月底斬落，人民幣的壓力不是一星半點的大。\n\n而最關鍵的是民間根本沒有財富的積累。所謂改革開放前半段積累的那點財富早已被房地產、醫療和教育吃幹榨淨，所謂的“改革紅利”早就透支完了，這一點根本不必自欺欺人。\n\n經濟崩潰加上人民幣貶值，所帶來的直接後果就是通貨膨脹。美元高企導致中國不得不向國際社會支付高額的進口成本。農業產業因為政策的束縛一直沒有形成產業化，能源領域被權貴壟斷效率低下，導致中國早已經是糧食和石油的進口依賴國。2014年根據農業部公佈的資料中國進口糧食達到1億噸，而中國糧食總產量為6億噸。能源更是一本爛賬，估計如今誰也搞不清進口多少出口多少。未來的糧食短缺和物價暴漲是完全可以預期的。由於民間財富積累的不足，因通貨膨脹導致的大饑荒將隨之而來，如果你國政府仁慈一些在實行票據供給制的同時大量精簡機構，那麼中國將重回文革計劃經濟時代。如果你國政府繼續在國際上打腫臉充胖子用金錢買外交，那麼中國將重回大躍進時代。\n\n前幾天有篇文章，是說中國將會再度回到“兩腳羊”時代，如今看來這種可能性不是沒有。所謂“兩腳羊”指的是歷史上戰亂時期，將虜來的人當作食物來源，倒懸於樹上放幹血，便於存放與煮食。因倒懸放血後的人屍慘白無色，形同羊屍故稱“兩腳羊”。也因其可供驅策與食用，如同羊群，故稱“兩腳羊”。這種情形也發生在和平時期，據明史記載，在明代饑荒時期有“菜人”交易者，就是自己的兒女自己捨不得吃，做“菜人”交換別家的子女來吃，也是兩腳羊的一種形式吧。一但經濟危機形成，這種慘烈的人吃人的社會現象，不是沒有可能發生，只是發生的烈度如何，要看這個過程中中國普通民眾的覺醒程度和國際社會的干預程度如何了。\n\n<b>科技與軍事實力一落千丈?</b>\n\n由於在知識產權方面的保護和開放，TPP國家將最大限度地共用科技成果。而美、日兩大科技強國，將大大地通過協定的有關特許條款提高TPP成員國的科技實力。而且，因為TPP只設立了最基礎的技術壁壘，該協議將對提高各成員國軍事水準有一定的促進作用。特別是美、日兩大軍事技術強國做支撐，參與國軍事實力的提升可謂是指日可待。因為TPP主要參與國是環太平洋國家，其中包括了目前絕大多數與中國領土有爭端的國家，你國政府利用局部軍事優勢耀武揚威的日子將一去不復返。再加上日本已經通過了新的安保法，你國在東南亞充當霸主的“中國夢”也將破滅，並在軍事上將陷入囚徒困境的兩難選擇，一方面如果不秀肌肉，國土不保，遭千夫所指。如果繼續秀肌肉，則加速周邊國家向TPP靠近，為自己樹立更多強大的敵人，以前所有金錢外交的努力瞬間打了水漂兒。\n\n縱觀TPP目前十二個成員國的構成，技術領先國家，資源優勢國家和勞動力資源豐富國家都被囊括在內了，TPP內部已經自成完整的經濟貿易體系，而週邊還有正在積極爭取加入的臺灣、印度等國，可以想見一個全球矚目的新興經濟共同體正在形成。而對中國更加釜底抽薪的是，TPP的協議達成，將最大限度地遏制中國在主導一帶一路和10+3兩大貿易體系的談判進程，甚至將導致中途夭折。因為參加TPP國際貿易體系各國的利益和義務是擺在桌面上的，誰都能夠看得見摸得著。而加入一帶一路和10+3，則未來的發展方向並不明朗，除了短期內能夠獲得一些有附加經濟條件的中國援助之外，邊際效應幾乎為零。在短期利益和長遠利益的判斷上，絕大多數國家都不會盲目地飲鴆止渴。\n\n<b>政治與文化將迅速被邊緣化?</b>\n\nTPP協議的達成還有一個重要的邊際效應就是，以美國為主導的政治文化體系將沖出美歐走向亞洲。如果說TPP之前的世界政治文化格局是，歐洲和美州為美國的勢力範圍，亞洲和非洲是俄國和中國占優的話，TPP一但形成，將徹底改變這一格局。俄羅斯可能是更早地看到這一點，在克裏米亞問題以及最近的敘利亞問題上，迫不及待地做出鞏固自己勢力範圍的姿態。而中國卻在南海首先折戟。\n\n以美國為主導的政治體制，是以憲政為基礎、最大限度地發揮民主的力量、充分保障人權和個體自由為特徵的現代體制。TPP協議的框架基礎則充分地表達了這一特徵（由於目前協定還未正式簽署，協定內容和相關最終框架結構還沒有正式公佈，但是2011年和2013年流布出來的大綱已經完全說明問題）。參與TPP協議談判的國家，必須是以美國為主導的這種政治體制的遵從者，這種強迫式的推行，將徹底改變亞洲政治生態，一大批國家或者主動，或者被動地將走上尊重人權，充分民主，依憲治國的自由之路。而以俄國和中國為代表的奉凱恩斯主義為圭旨的專制國家，將會大大地失去勢力範圍。\n\n文化方面，美國為主導的文化特徵是包容、自由和創新。俄、中為主導的社會文化是秩序、服從與循規蹈矩。這兩種文化在長期競爭中，一直自說自話，沒機會一較高下，而TPP談判則使得局勢瞬間明朗起來。對於TPP成員國來說，你要麼全盤接受，要麼退出這個遊戲，沒有中間地帶可以過渡。而美國為主導的開放文化的活力有目共睹，前有美國市場完全開放這根巨大的胡蘿蔔後有美國市場關閉這根令人恐懼的大棒，這種推行文化的政策，甩出孔子學院一個太陽系。要知道，TPP當前十二個成員國中，有超過半數的國家在此前並非是美國的擁躉者。\n\n而中國呢，以孔子學院為先鋒的文化擴張四處碰壁，在可預見的未來，中國文化的影響力更加微乎其微，中國將不再是文化沙漠，甚至將轉變成吞噬一切良知的文化黑洞。所謂高手過招，瞬間決定勝負，用這個來形容TPP談判過程中的中美，應該言不為過。\n\n<b>結論：沒有共產黨才有新中國?</b>\n\n這種形勢像極了二戰時邪惡軸心國即將滅亡的1941年。美國參與太平洋戰爭，給邪惡軸心致命的一擊。中國的未來已經擺在眼前可以預期，經濟形勢的走向通過資料模型的演算，也完全可以推測出來，而向著災難狂奔的腳步卻根本沒有停下來的意思。所謂盲人騎瞎馬，半夜臨深池，悲夫？幸乎？\n\n火龍蟄起燕門秋，原璧難應趙氏收。一院奇花春有主，連宵風雨不須愁。這是邵雍《梅花詩》的倒數第二首，也是針對這個時代的預言詩。天津一場大火似乎暗合了這個預言的首句，原璧為國之權柄，運數卻不在燕趙的統治者手中。但是，註定了的大好河山必得收拾，因此雖然災難不斷，但也沒什麼可擔心的。《梅花詩》的最後一首則預言了四海承平，天下一家，沒有統治者也沒有被剝削者的美好未來：數點梅花天地春，欲將剝複問前因；寰中自有承平日，四海為家孰主賓。\n\n諸葛亮的《馬前課》也並稱中國歷史上十大預言詩。在占卜這個時代的時候，他得了個離卦。離者，火也。在解卦詩中，他寫到：“四門乍辟，突如其來；晨雞一聲，其道大衰。”據我理解，大約是說2017的雞年，“其”道將徹底衰落的意思。“突如其來”這個成語出自離卦九四的爻辭：突如其來如，焚如死如棄如。意思是說順應突如其來的“變化”，焚燒它、殺死它、捨棄它。而《馬前課》接下來最後兩首預言詩則跟《梅花詩》沒什麼兩樣，一樣預言了接下來民主社會的美好前景：拯患救難，是唯聖人；陽複而治，晦極生明。賢不遺野，天下一家；無名無德，光耀中華。\n\n愚雖魯鈍，但閒暇也喜歡弄點讖緯之學玩玩，偶爾拿出來獻醜，對不對的，各位看官自行評判。也算給慘澹的中國未來留下點光明的念想兒。\n"
		},
		{
			"post_id": 23,
			"title": "手把手教你上“零網”",
			"date_published": 1486112654.134,
			"body": ">本文內容是zeronet的新手指導，內容包括四個部分\n>第一部分：zeronet（零網）是什麽？\n>第二部分：如何在windows電腦環境下瀏覽零網\n>第三部分：安卓手機如何接入零網\n>第四部分：一些介紹零網的帖子鏈接\n\n---\n\nZeronet是這幾天突然流行起來的基於P2P傳輸技術的網絡環境。它不同於目前我們使用的因特網，你甚至可以將其看作是一個獨立於當前因特網環境之外的另一個網絡。將英文直譯下來就簡稱為“零網”。\n\n在有網絡接入環境的情況下，就有零網，就像有網絡接入的環境下就有因特網一樣。他們之間的區別在於，因特網必須經過一系列的中央服務器，你才能瀏覽網絡內容。比如你要瀏覽新浪網，首先必須通過國際域名解析服務器解析sina.com所指向的主服務器的位置，然後通過主服務器下載和瀏覽新浪網的內容。而在零網的世界裡，並不需要這樣做。\n\n零網的結構叫做去“中心化”，這個結構下，沒有任何主服務器存在，所有的網站不過是一個密匙，一個字符串。比如，我在零網的博客密匙就是14XsquY8jNJRMV3UTa2cKLx3jYynbtjf2g，這個密匙的前面加上前綴： http://127.0.0.1:43110/，  就是我的博客地址。從這個地址也許你能夠看出，你瀏覽的我這個博客並不是從網絡上瀏覽，而是在你的電腦上瀏覽。對，沒錯，零網正是通過點對點傳輸技術，將我這個博客的整個網站下載到你電腦中，因此你瀏覽的所有內容，也都是你電腦上的內容。而別人要想瀏覽這個網站，當他第一次輸入這個地址密匙串後，會隨機從整個全球網絡所有瀏覽過我這個博客的個人電腦中，下載我這個博客的整個網站，到自己的電腦中瀏覽。而且，你電腦上的零網還會隨時與世界上所有瀏覽過這個網站的電腦同步更新這個網站的動態，也就是說我在這個博客上發表一篇文章，只要有人在我提交更新後瀏覽過一次這個網站，那麼理論上所有人瀏覽的時候都能夠看到我的最新文章，不論我的電腦是開著還是關著。\n\n好吧，直接說說zeronet有什麼用吧。\n\n首先，這是一個沒有網絡審查的網絡環境，不會有人因為看到你的帖子不爽了，就將它刪除掉。\n\n其次，你可以隨便在上面張貼任何東西，只要你一次發布，內容就永遠存在，因為沒有人能夠刪除它。\n\n第三，你可以在上面瀏覽任何東西，沒有人能管得了你的電腦或者手機（目前只支持安卓）在看什麼，永遠不會遇到404（因法律原因你所瀏覽的頁面不予顯示）。\n\n第四，你可以在網上建立你自己的博客、論壇、聊天室，甚至你自己的推特、資源下載站等等，另外還有點對點加密傳輸的郵件系統，以及同樣基於P2P環境的tox即時通訊系統和sync下載系統（關於這兩種我以後有時間再介紹）。目前已經有高手在零網中鏡像了整個美國之音網站，嗯嗯，對於代碼恐懼症重症患者的我來說，只能望洋興嘆了。\n\n第五，省去你在因特網建立網站龐大的服務器租賃和維護費用、域名租賃費用等等，以及海量的維護服務器的時間。\n\n但是有一點要注意，零網不具備隱藏IP的功能，也就是說你不能通過零網實現無痕跡上網，如果你在零網發布敏感言論，而熊貓恰好關注了你的言論的話，他們仍舊可以直接找上門來請你喝茶，或者贈你接下來一段時間的吃住行一體化無憂套餐。\n\n總之，零網就是一個沒有審核沒有防火牆的互聯網。即便你在一個局域網內，或者在未來某一天突然切斷與國際互聯網連接的條件下，只要內網還在，它仍舊是一個無邊界的，無審查的，無防火牆的自由的網絡。\n\n接下來就是乾貨了，教你一步步踏入零網。\n*************************\n先來說說通過電腦上零網。\n\n首先，你需要下載一個零網環境，在電腦上點擊下面這個鏈接下載：https://github.com/HelloZeroNet/ZeroBundle/releases/download/0.1.1/ZeroBundle-v0.1.1.zip\n\n如果github被封鎖，你也可以通過網盤下載，網盤地址：\n链接: http://pan.baidu.com/s/1slOhSx3 密码: 4nqa\n\n下載後將文件解壓到一個空間較大的硬盤的根目錄下，打開目錄，會看到一個zeronet.cmd的文件和一個文件夾。用鼠標雙擊zeronet.cmd這個文件，電腦會打開一個Dos窗口，這個窗口是該程序自動在你電腦中建立零網環境的過程，這個過程一般會持續十到二十分鐘，它會從網絡上自動下載一些必要的文件，以及零網初始的推薦訪問的網站，這需要你一點耐心，因為以後你再不用等這麼長時間了。當這個窗口關閉後，會自動打開瀏覽器頁面。在這裡我推薦使用Chrome，而不推薦使用IE。如果第一次打開失敗，也沒關係，直接關閉瀏覽器，再次打開，輸入http://127.0.0.1:43110/，  你便可以打開主頁面。\n\n有一種常見情況，就是當你打開zeronet.cmd這個文件後，那個黑色的Dos窗口一閃便消失不見，則說明你零網環境沒有建立起來，你需要下載一個vs2008運行環境。\nhttp://www.newasp.net/soft/26906.html  \n\n在這個鏈接裡可以下載，這是一個微軟自帶的運行環境庫，因為你電腦安裝的是簡化版本。下載安裝之後，重新打開zeronet.cmd，恭喜你已經進入零網大門。\n\n當然，如果你想在零網中有個自己的名號，那麼就需要註冊一個ID: http://127.0.0.1:43110/zeroid.bit  \t點擊進去輸入自己想要的ID就可以了，目前只支持英文和數字。武僧的ID是：xyws8964@zeroid.bit  大家可以在零網裡找我，或者給我發郵件。當然，如果你僅僅瀏覽而不發言的話，也可以不用註冊。\n\n然後，然後你就可以發掘零網內的資源，比如先上西域武僧的博客看看，地址是：\nhttp://127.0.0.1:43110/14XsquY8jNJRMV3UTa2cKLx3jYynbtjf2g/\n或者去我的留言板轉轉，給我增加點人氣：\nhttp://127.0.0.1:43110/1CsKeYh88Qh3qoxJ4RA2PiH7GdYYqLCx5h/ \n或者去零網推特看看大家在說什麼：\nhttp://127.0.0.1:43110/Me.ZeroNetwork.bit/\n再或者去最大的中文論壇GFWTalk看看有什麼好帖子：\nhttp://127.0.0.1:43110/NewGFWTalk.bit/\n然後去海盜灣種子站下載最新的大片：\nhttp://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/\n再去kindle下載不要錢的亞馬遜電子書（目前至少有60多G）：\nhttp://127.0.0.1:43110/1KHCBG6dmbKXTZNenfwhWZ5x3oDyYyHSD4\n當然，零網也會有自己的hao133中文導航：\nhttp://127.0.0.1:43110/0net123.bit/\n還有全套可查詢的巴拿馬文件，找找裡面有沒有你姐夫的踪跡：\nhttp://127.0.0.1:43110/PanamaPapers.bit/\n••••••\n\n總之，基本上你能夠想到的，零網上全都有。你想不到的，零網上也會有。別忘了，在瀏覽你喜歡的網站時，隨手點一下左邊欄的“關注更新”按鈕。這樣的話，一旦你用電腦打開zeronet，系統便會自動更新這個網站的信息，並且所有更新內容，都會顯示在http://127.0.0.1:43110/ 的首頁中。\n*************************\n接下來再來說說安卓手機中使用零網。\n\n首先報告個壞消息：目前手機版zeronet目前只支持安卓，不支持蘋果手機。\n\n首先到百度微盤下載安卓版zeronet\nhttps://pan.baidu.com/share/link?shareid=1509785266&uk=3910115520\n\n解壓縮後，將得到一個APK程序，將這個程序安裝到手機中。\n\n打開新安裝的程序，過一小會，便會打開瀏覽器，如果第一次打開瀏覽器顯示無法連接，關掉瀏覽器重新打開，在地址欄輸入http://127.0.0.1:43110/，  便可以進入零網的首頁。\n\n進入零網之後，參照前面所寫電腦上零網的相關內容，便可以自由瀏覽零網了。\n*************************\n網上關於零網的介紹、說明文檔鏈接：\n\n使用ZeroNet搭建P2P全球网站\nhttp://www.williamlong.info/archives/4574.html?_t=t\n\n如何评价 ZeroNet，是否是革命性的创新？其发展前景如何？与传统网络相比有何优缺点？\nhttps://www.zhihu.com/question/37439960\n\nZeroNet 简介\nhttp://blog.sina.com.cn/s/blog_466ffc870102wmlp.html\n\nP2P 网络 ZeroNet 初体验\nhttp://xuhehuan.com/2441.html\n*************************\n最後再羅嗦一句，零網是一個完全自由的，沒有頂層設計和管理的去中心化網絡環境，在這個環境下，什麼內容都可以發布，因此也會有令人不適或這令人很適的內容出現。因此有道德潔癖的朋友，請慎入。如果沒有，你懂的••••••\n如果你看到這篇攻略，還有其他疑問，可以加武僧的微信（xyws8964）提問交流。\n\n"
		},
		{
			"post_id": 22,
			"title": "搶劫法和沒辦法",
			"date_published": 1486006761.867,
			"body": ">去年包子提出“依法治國”的時候，我在微博寫了個段子，大致內容是：\n>一個飽受土匪蹂躪的村莊，突然有一天村口大樹上，土匪貼出告示，稱一切不合法的搶劫都是要堅決予以抵制和制裁。今後我們土匪將依法搶劫。村民們看到後欣喜若狂，終於可以擺脫60年匪患。趕忙把養在山洞裏、山澗下的牛羊豬雞趕回家，將藏在地窖埋在地下的糧食挖出來準備大快朵頤。這時，土匪騎著馬趕來了，不過與以往不同的是，為首的土匪手中高高舉著一本《搶劫法》。\n\n---\n\n其實對於飽經土匪蹂躪的人來說，根本沒有這麼傻，他們知道，只要土匪們一說建設、一說服務、一說管理、一說調控，一準兒是山上沒糧了。\n\n現在山上又沒糧了，所以開始琢磨著出臺《房產稅徵收辦法》了。\n\n根據目前媒體透露的消息，今後房產稅有望設起征點，超過起征點的部分需要繳稅，繳稅幅度從0.5％到3％遞增。大概的概念是第一套房征0.5％左右，第二套房可能就是2％，第三套房征3％。當然，我的預測一定不準確，按照官方的說法：具體徵收辦法還在研討中。其實借用你國口交部的標準說法應該是：聚義廳各位頭頸還沒有就本次搶劫額度達成一致意見。\n\n大家還是多祈求上帝真主佛菩薩三清玉帝濕婆大神顯顯神通，讓各位頭領的胃口小一點吧。\n\n近二十年的房地產改革，對於中國來說唯一解決了的，就是各級政府龐大的公務員開支和各地盲目市政建設的資金投入。當然，近年來中國GDP迅速成為世界第二，房地產業更是功不可沒。在中國房地產價格構成中，政府土地出讓金高達30％，建築成本約30％，行政費用和稅收占了30％，最後剩下10％才是建築公司和開發商的利潤，而這10％的利潤中，還包括孝敬各位官把子印把子和槍把子的灰色部分。\n\n有沒有覺得這幾年天天罵開發商罵錯了的？\n\n其實，我們買房子的時候已經給政府交了高額稅收的。那麼，如果徵收房產稅，你將每年還要多繳多少呢？這個我也不清楚，要等稅法出臺之後才能確定。不過網上有文章做了計算，大家可以上網搜搜看。不過奉勸心臟不好的朋友，事先準備好速效救心丸。\n\n有人說，房產稅這麼貴，我賣了行不行？等會兒，先不說到時候你能不能賣的出去，就算賣出去了，這一年的稅也要你交。而且，即便賣房潮導致當地產價格暴跌，可收稅標準是按照上一年當地房價平均價格徵收的。而且這還是仁慈的，否則按照五年平均價格收，這叫與國際接軌，汽油價格調整就是這麼算的。你服不服？\n\n當然，這只是極端例子，畢竟土匪都不會幹這樣竭澤而漁的事情，何況偉大光榮正確的党不是土匪！絕對不是！\n\n我們還是回過頭去看看上個月剛剛發生的股災吧。估計全國因股災破產而跳樓的統計數字一定是國家機密，說了就是煽動顛覆政府。連逍遙劉強這種股市期貨對沖高手都慘然謝世了，何況那些散戶呢。\n\n那麼，中國政府為什麼這麼缺錢呢？原因很簡單，一個，是中國的房地產市場近年逐漸低迷，存量已經超過飽和。各地三四線城市鬼城遍地，土地出讓金已經收不上來了，各地政府債因無序開發導致債臺高築，財政危機顯現。另外一個原因是中國養活著一個龐大的公務員群體。據官方報導，我國公務員總數為700到800萬左右。但是如果加上各種依靠財政供養的准公務員：社會團體人員、國企人員，事業單位人員，恐怕要超過4000萬以上。如果再加上城管、協警以及搞不清楚來歷的特警……\n\n而且，你國的公務員可是終身享受退休金、醫療等待遇的哦。\n\n山上的頭領太多，再加上七大姑八大姨二舅姥姥三姑奶奶……，草民不夠用了啊！\n\n網上有人說：美國也征房產稅，中國遲了30年才征，已經占了便宜了。可您別忘了，美國的房子是永久擁有權，不僅僅是土地擁有權，而且是包含地下和天空，那跟咱70年使用權不是一碼事。不信哪天您從您家地基裏挖出根烏木來試試就知道了。\n\n有朋友會問，如果房產稅開徵，房價一定會暴跌，這不也是好事？\n\n這倒是真的，房產稅一旦開徵，房價一定會繼續下滑。但您得算算，您家的房子使用年限還有多少年？只要這70年使用權年限的魔咒還在，潛在購買力就一定存在。別指望暴跌，能跌到您購買力能承受就算不錯了。\n\n總之，中國現在的問題是，不管怎麼樣他們總有法，房產稅遺產稅延遲退休……而且不需要經過你的同意。而你，則只有一個法：沒辦法！\n"
		},
		{
			"post_id": 21,
			"title": "被煽顛的望雲和尚",
			"date_published": 1485682356.672,
			"body": "![image alt](img/jx3.jpg)\n和望雲和尚相識，也是在2013年。當年他雲遊北平，京城諸友飯醉相迎。席間大家暢談甚歡，也瞭解瞭望雲和尚的一些故事，得知他正在為他所在的寧德鎳合金化工專案與當地政府抗爭。\n---\n算來我皈依佛門也近三十年了，於佛法也算略有深入。佛門中人本應四大皆空，以道為身。為匡公義不惜身命，以八正道為本，救護眾生，彰示因果，令人解脫。然今日之佛教徒，墮落深者惟求功名利養，墮落淺者只願自了往生。且不說如是修行，往生者佛國即是地獄，往大了說長此以往，三武一毛滅佛之災恐怕又將再現。歷史上哪一次佛難不是因佛門弟子與官宦統治階層苟合，背離正道所致？文革不遠，可惜佛門之中又有幾人看破？因此，十多年來我恥于談佛。\n\n而望雲和尚不同，在微博上我們神交已久，無論是維權話題還是佛教話題都溝通過很多，特別是對太虛大師“人間佛教”之學，都心嚮往之。\n\n望雲和尚一身兼臨濟曹洞，禪門正脈。在福建寧德有個小小的九仙禪寺，據說山清水秀，令人心動不已。那次在京飯醉之後，他回到廟裏，沒幾天就一個人隻身前往寧德市政府，舉牌抗議上馬鎳合金化工專案，後來得知他因此被拘留十天，令我對他更加佩服不已。\n\n14年十月，我倆又在廣州相見，辦完了事兒，我受邀來到他寧德的小廟。這裏真是修行的好地方，背靠群山環抱，前臨霍童靈溪。山上翠竹如錦緞，山下巴蕉映霞雲。山泉清澈，茶樹成行，天清雲淡，鳥鳴啾啾。令人一見便流連忘返，於是我就厚著臉皮賴在他的小廟不走了，一住就是半年多。期間誦讀了兩遍《華嚴經》，還學會了紅茶和綠茶的炒制。每日早晚功課，青燈古佛，難得的恬靜清閒。正所謂：百年三萬六千日，不及僧家半日閑。\n\n2015年過了清明，廟中茶葉做完，我也暫時辭別望雲和尚，離開了九仙禪寺。然而剛過七月中，便傳來望雲和尚被警方抓捕的消息，繼而和709事件中被捕諸君一樣，不允許律師會見，拒不通知家屬。一至半年，沒有任何消息。昨天，望雲和尚的律師龍霖律師發佈消息，才得知他因“煽動顛覆政府”被批捕。在這期間，望雲和尚七十多歲的老母親，一位護持九仙禪寺十多年的老居士也被趕出了寺院，九仙禪寺就此被當地政府非法強佔了。\n\n國寔唯堅，專制如磐石。哪怕一絲光亮的透入，都需仁人志士用自由、鮮血乃至生命為代價。望雲和尚是佛陀教義堅定的踐行者，橫遭此囹圄之災，更顯以身飼虎的英勇。作為佛教徒，人生最大的意義反不在於成就了什麼，而是在堅守了什麼，才不辜負“荷擔佛陀家業”，不枉為”住佛形象”之功德。\n\n望雲和尚好詞，而我好詩。故以詩贊曰：\n\n>九仙寺內九仙山，\n>一片冰心一片天。\n>廟小方能平溝壑，\n>望雲閣上天地寬。\n"
		},
		{
			"post_id": 20,
			"title": "我能為毒疫苗事件叫聲好麼？",
			"date_published": 1485584732.211,
			"body": "![image alt](img/dym.jpg)\n按照人類學的觀點，大約1700萬年前，人類的祖先因為一次偶然的事件，被逼著從樹上下到地面，學會了直立行走，自此與猿分道揚鑣，成為動物學上一個獨立的物種。直立行走，解放了人類的雙手，也解放了人類的雙眼。從此獲取了更多的資訊，刺激了大腦的發育，可以記憶更多的東西，同時可以作用邏輯能力，產生抽象思維。進而，利用解放了的雙手，產生前所未有的創造能力。\n---\n然而中國人，直到目前都沒有產生創造能力。哦，不！也許歷史上曾經創造過，但是那都是百十年前甚至數百年前的事情了，至少自1949年以後，除了殺人手法一路創新之外，真正值得驕傲的創新可謂少之又少。最可笑的，是連國家領導人帶出去隨訪的，都是造假貨的和賣假貨的。最最可笑的，是一群製造假貨的圍著創造真貨的，展示自己仿製的假貨造的有多麼像真的一樣牛逼。每每想到庫克哭笑不得的面容，我就想駡街：你還他媽的能再無恥麼？\n\n回答是：能！\n\n所以中國人，近代以來一直沒有直立起來。這個以跪為尚的民族，見到君主跪、見到官員跪、見到強權跪、見到偶像跪，受到侵害跪、被搶了財務跪、被殺了親人跪、受到公共災害跪，見到財富跪、見到成功跪、被強姦了跪、被屠戮了跪……幾乎就是無所不跪。唯一不跪的，是別人的創造力，因為他們善於模仿，無論你再牛逼的創新，我都能讓你臭大街。據說懸浮滑板這種高大上的新玩意兒，被發明出來不到兩年，在美國便被禁售了。禁售的原因說出來很尷尬，因為來自中國的仿冒貨充斥市場。\n\n歷史學家經常津津樂道的是，中國自秦朝開始，就消滅了奴隸制。我對此一般嗤之以鼻，因為中國所謂的消滅了奴隸制，無非就是將全體中國人全部變成奴隸，唯有一人除外。你見過一國的自由人圍著一個人下跪，而且下跪姿勢不對就滿門抄斬的麼？只有徹底的奴隸制國家才會如此，也只有徹底的奴隸制國家才會對此事實拒不承認，熟視無睹。\n\n他們最近又說要四年內消除貧困人口，對此我只能表示——哼哼！\n\n這兩天網路上嚷嚷得最熱鬧的事件，是毒疫苗事件。有些人不幹了，說這是屠殺孩子。另外一些人也不幹了，說媒體報導中的“殤”字用錯了。\n\n我覺得上天真的對中國人不薄，為了讓中國人擺脫奴隸的身份，一聲炮響為中國送來了馬克思列寧主義。破壞共和、破壞抗戰、發起內戰、三反五反、反右、大躍進、文革、鎮壓四五運動……一場接一場的災難，逼著中國人站起來。\n\n遠的不說了，就說我經歷過的吧。\n\n27年前春夏之交，有一批覺醒了的奴隸喊出：要民主、要人權、經濟自由化、取消剪刀差的聲音，被鎮壓了。那些跪著的人們說：要那玩意兒有什麼用，有吃有喝還折騰，活該！沒幾年，醫改房改教育改革成為壓在中國平民身上的三座大山，大批工人下崗，為國企減負。\n\n接著，又一批被下崗抽醒了的奴隸喊出：要工作要生存的聲音，他們甚至組織了政黨，來爭取民眾的政治權利。結果被紛紛判刑。那些跪著的人們說：中國容不得你們這些漢奸瞎折騰，這些美帝走狗要多党制搞亂中國。沒兩年，他們想練練氣功保養身體，少花點醫藥費都被抓，被摘器官了。\n\n接著，又一批覺醒了的奴隸搞了個憲章，要求保護公民權利，保護私有財產。發起人儘管獲得了諾貝爾獎，但至今仍在監獄服刑。那些跪著的人說：活該！好好的日子不過，瞎折騰！現在中國人最重要的是爭取生存權，中國不能亂，穩定才壓倒一切。沒過多久，他們的房產被以穩定和發展的名義強拆了。\n\n接著，一批被強拆逼醒了的奴隸喊出維權的口號，他們四處圍觀，見證並揭露不公，沒多久也被抓了。那些醒著的人們說：傻逼，跟共產黨對著幹，找死。看看我多聰明，人挪活樹挪死，甭管多少，拿錢走人，留得青山在不怕沒柴燒，被抓的都是別有用心。沒過多久，他們上街擺個攤，就被城管打了。\n\n接著，一批被社會的不公驚醒了的奴隸在微博在微信上喊出：要公平要正義的聲音，他們提出要構建公民社會，結果被以造謠煽顛的名義抓去坐牢了。那些跪著的人們說：哪里有絕對的公平正義？要正能量，眼睛要看得見光明，不能總盯著黑暗。沒幾天，霧霾籠罩了中國。\n\n接著，一批被霧霾熏醒了的奴隸開始關注中國的環境，他們自費購買設備監測霧霾，抗議化工污染，抵制核電，他們組成NGO為環保發聲，最終被抓被取締。那些跪著的人們說：污染是發展的必然結果，發展是硬道理。你們無理取鬧，無視發展的成績，活該！沒過多久，毒食品、毒酒、毒藥品、毒奶粉充斥市場。\n\n接著，輪到這些各種不公各種中毒的受害者維權了，他們四處上訪，到處訴說冤情。他們中有的被截訪，有的被關黑監獄，有的被打，有的甚至死於槍下。那些跪著的人們說：上什麼訪，放著日子不過，自找不自在。有困難想辦法，辦法總比困難多，受點苦怕什麼，活下去最重要。沒過多久，毒奶粉毒疫苗找到他們的孩子了。\n\n我相信，即便那些打了毒疫苗的孩子死光了，那些跪著的人們，依舊有的說……昨天，官方發言人指出，中國的疫苗管理水準已經達到世界先進水準，你們這些奴隸還不山呼萬歲，跪下謝恩？！\n\n其實，為了讓民眾站起來活著，中共可謂是煞費苦心，奈何習慣了跪著的國人，把好心當做驢肝肺。不過也沒關係，毒死了兒子，還有你孫子，死了你孫子還有你的重孫子，還有你父母、你爺爺奶奶，還有你。他們總有一種辦法，讓你學會直立行走，進化為人！"
		},
		{
			"post_id": 19,
			"title": "大權力VS大市場",
			"date_published": 1485584373.493,
			"body": "![image alt](img/qlsc.jpg)\n早在十多年前，我曾經跟朋友戲言，在中國有三樣東西不能碰：股票、保險和彩票。因為這三樣東西在成熟的市場經濟社會裏，都是由公司經營，國家監管，而在中國，卻是國家經營，無人監管。雖然當時是跟同事戲言，但是卻是我一向的準則。\n---\n破例是在2004年左右，因為工作原因，我從IT記者轉行做財經記者。股市分析是做財經記者的基本功，那時候大約炒了八個多月的股票，並總結出一套“地攤炒股法”的模式。我把炒股看做是擺地攤。擺地攤關鍵是什麼？不壓貨，貨常新，見利就走，壓貨就甩。我炒股大約也是奉行這一法則。雖然賺的不多，但是確實沒有賠錢。單位同事為此還很看不起我，說我不懂得長期持有價值。我哂笑，反駁他不懂中國國情。總之八個多月下來，我小打小鬧他大賠大賺，從資金比例上來看，我們倆的業績竟然差不多。\n\n再後來，我天馬行空的性格，著實跟天天與股市較勁的生活格格不入，清盤走人。\n\n但是我六年多財經媒體從業經歷，對股市分析方法還是有所瞭解，特別是對大盤指數的趨勢分析，我相當有自信的。但對個股分析，因為長期不炒，已經很生疏了。\n\n···中國股市的實質···\n\n中國股市到底是個什麼？我覺得周孝正教授說的最接近真實，他說：中國股市是莊家能看得到你底牌的賭場。你想想，莊家隨時都能看到你的底牌，那就不是什麼賭博，而是搶劫場了。\n\n眾所周知，中國是一個專制社會。權力對社會的控制無所不在，特別是對社會資源的控制。馬哲主義者堅信通過生產資料公有，經過共同生產產生財富，而後進行公平的分配，便可以實現共產的最終理想。這種基於原始農業社會或工業社會早期的烏托邦模式，在當代社會被多次驗證並不可行。因為這種模式扼殺了人類的創造性：每天蒸十個饅頭和蒸一個饅頭，最終都是換來一碗米飯的制度下，所有的創新必然集中在如何用更少的體力和成本換取更多的食物這一層面上，除此以外，沒有任何其他動力。社會主義國家莫不如此，自49年以來的中國也莫不如此，只是程度不同而已。中國一直被計畫著，只是計畫面的寬與窄的問題。\n\n但是，隨著經濟社會的發展，特別是自由市場經濟的發展，產品價值已經不單單體現在加工生產過程中，而更多的產生于思想、創造、創新、創意等軟資產，而這種軟資產，則是極權專制政府很難控制的。\n\n股票市場就是軟資產的產物，它不完全依靠產品，但又無法擺脫產品，而是在具有市場潛力的產品上，附加入未來可預期的增值潛力，通過投資人經驗與眼光的評價，賦予其軟價值的過程。在這個過程中，生產企業獲得了融資以擴大生產規模，投資人完成了資產增值。\n\n這是最基本的股市原理。\n\n而中國股市則並非如此。因為專制政府管理一切的龐大欲望，他們將各種軟資產也想納入自己的管理範疇，納入不了，便想辦法限制。言論限制，思想限制，藝術限制，學術限制莫不從此邏輯出。表現在股市上，就是軟資產與硬資產被生生割裂開，上市的公司首先是可管理的，而不是可發展的。因此，中國股市中上市公司的股價就會永遠被高估，哪怕它跌到一分也是被高估的。因為它沒有提供附加價值的能力。一條聽話的狗，怎麼能巴望它直立行走呢？\n\n因此，對於股價被嚴重高估的股市，怎麼跌都是可以想像，可以預期的。因此，我炒股的時候，總是預期我的股票會跌，這也令我大費腦筋。\n\n但是，就這麼一個價值被嚴重高估的股市，怎麼會漲呢？\n\n···中國股市是怎樣漲起來的···\n\n一個專制政府做夢都想控制一切，股市也不例外。但是，他如何控制？既要讓上市企業為其創造利潤又不能有太多的活力，保證其永遠都是自己盤中菜、圈裏羊？\n\n首先，是上市公司的審批制度。\n\n在正常國家，企業上市依靠的是註冊制。你的企業經過會計樓的審核，確實合乎相關市場的上市規則，而後經過路演將自己未來的發展藍圖呈現給以發行商為主體的金融界，經過發行商認定你的股票一旦上市交易能夠獲得收益，視收益大小有發行商願意承銷你的股票，經過向交易所簡單的註冊，你的股票就可以上市了。西方不同的交易所，其規則和對上市公司的要求各有不同，有的要求很嚴格，有的則要求較松。我曾經因工作關係跟蹤過在美國上市的中資企業，也為去美國上市的中資企業做過一點前期工作。儘管不同的交易所要求不同，流程有差異，但是基本框架沒有差別。在這裏，你看不到任何一隻政府的手，政府只能起到監督你是否按照規則如實地公開了規則規定必須如實公開的部分。具體到你能否上市，那完全是市場的選擇。\n\n而中國股票市場不同，它是批准制，政府權力完全剝奪了市場的權力。能不能上市，只看主管機構，甚至主管人的一支筆。由於一切都處於不透明不公開的狀態下，缺少有效的市場選擇權，因此上市企業的品質無從談起。甚至在中國，所有資源型企業，特別是央企和各地方國企，幾乎都是上市公司，這些成為了政府的親兒子，而那些“聽話”、“懂事”的大型製造業民企，則成為了政府的“乾兒子”，這兩種企業成為中國股市的主力軍。也就是說，在中國股市上，企業能否上市，股民是沒有選擇權的。\n\n再說說T+1交易模式，簡直就是專為中國品質低下的上市企業量身定做的維護獲利手段。這種交易模式大大限制了股市的活躍度，也限制了股市中資本的流動性，但是有利於上市企業獲取資金紅利，甚至有利於操縱股市。據我所知，世界上採取T+1交易方式的股市僅此一家別無分號。\n\n也就是說，中國股市創造了一種悖於成熟市場模式的“新模式”：它不利於優質企業上市但有利於股票上漲。\n\n因此上一個很滑稽的現實是：中國股民基本上不看甚至不關心財報，甚至連基金經理都很少看財報。甚至我做財經報導時間長了，也懶得看財報。反正中國股市就是一個莊家遊樂場，他們怎麼說，就怎麼寫吧。那烏七八糟的財報，你知道哪個數位真，哪個數位假？\n\n因此上，中國股市就是一個莊家遊樂場，散戶無非是跟著莊家押寶加磅，押對了賺一筆，押錯了，對不起，跳樓吧。\n\n這不是一篇關於股市的啟蒙文章，所以我也不想寫的太細。這本應是一篇對中國股市未來發展和結局進行預測的文章，可惜，我看了很多網上的股評甚至專家論述，對股市的本質都不甚了了甚至完全錯誤的。對股市的本質理解的錯誤，必然造成對中國股市理解的錯誤。因此如果你要問，中國股市是怎麼漲起來的？我的回答特簡單：問政府去啊！\n\n···為何每次救市都變成了砸市···\n\n我大概在上月末開始在微信預測次日滬指大盤走勢。有一天我曾說過一句半開玩笑的話：如果今晚出臺最新利好消息，明天大盤會跌。如果沒有利好消息，大盤會微漲。其實這真的不是玩笑，自從央行第二次降准降息，股市反應冷淡且次日下午便開始走低的表現看，我就堅信，央媽每一次出手救市，都將是對股災的火上澆油。\n\n這其中最主要的原因有兩個，一個是股民的覺醒。虐我千遍也不厭倦，但他媽的也總得有個頭啊！雙降利器的失靈，幾乎標誌著一切政府干預手段的失靈。股民的信心沒有了，政府的可信任度沒有了，正常市場都不會出現大逆轉，何況一個本身就被嚴重高估的市場。\n\n第二個原因，咱們的政府是利益導向型，救市的手段一定與市場的運行規律背道而馳。比如說，正常市場遇到股災一定是釋放流動性，減少股災給股民造成的損失，放寬融資管道，增加對沖止損通路。看到了吧？專制政府的手段完全相反。具體我前一篇就說了，說出來滿眼都是淚。這不是在救市，這是在犯罪。\n\n記得有一年我到中原某個城市採訪，城市一個標誌性大橋橋頭矗立著兩個蠢得不能再蠢的雕塑–—一隻黑貓一隻白貓。開車送我的司機對我說：自從有了這對貓，這個城市的黑社會就越來越猖獗了。\n\n當然，法律在中國，也就是個屁。只可憐那些被套牢等著強平的股民，為大市做了如此巨大的貢獻，卻最終落了個傾家蕩產的結果。\n\n利益導向型政府在股災來臨之際，首先想到的是要保住自己和自己選擇出來的上市公司的利益。而當政府信用破產到一定程度，上市公司的盈利能力差到一定程度，雙重壓力必然導致股民落荒而逃，因此你救市的手段越激烈，股民的反應越強烈，因為你每一次救市，大家知道：你沒牌了！你真的沒牌了！！你徹底沒牌了！！！\n\n···權力與市場的角逐···\n\n這是一場權力與市場的角逐。這是一場意圖控制一切的權力與以自由發展規律為基礎的市場經濟模式的角逐。如果權力不願意低下他那愚蠢而傲慢的頭顱，那麼他必然會失去市場。畢竟，在權力面前，市場也是不堪一擊的。因為權力可以干預規則、改變規則甚至徹底地拋棄規則。也許哪天，權力突然關閉中國的股票市場，也不會出乎我的預料之外。\n\n歷數從所謂改革開放以來，中國經濟的起起落落，你會發現一個現象，就是每一次經濟的發展或者復興，都是因為政府放開了一部分社會資源，引發民間活力而產生的。比如文革結束滿目蒼夷，農村土地改革將本屬於農民的地重新分給了人民，結果促成了農村經濟大發展，帶來了物質的逐漸豐富。緊接著逐步開放了輕工製造業、產品零售、服務業和批發業，使得八十年代的社會逐漸有了活力。緊接著，思想上的鉗制導致了那個春夏之交，經濟再度陷入低谷。而後通過特區模式再度放開了產品製造業空間。到九十年代末由於對國企造成了巨大衝擊。為挽救國企命運實施下崗計畫，通過國企改革整合了國企資源，提升了國企壟斷能力。但是將本應由國企按照契約負擔的對職工的責任，卻單方面撕毀契約，將負擔一股腦推給了社會，社會矛盾一觸即發。幸運的是當時互聯網熱潮西風東漸，這東西你國沒有見過，政府也不知道如何控制。於是迎來了第四次社會財富增長。隨著政府對互聯網的瞭解，逐漸管控了這一領域，無數本來很有希望的互聯網企業，在政府干預下紛紛倒閉，或者遠遁國外。好在緊跟著到來了移動通訊業的發展，又一次化解了危機。然而，在這個過程中，整合好了資源的國企紛紛捲土重來，國進民退大潮再次強姦了市場活力，直到今天……\n\n中國政府總強調政府管理，但政府真正應該管的，是自己那只貪婪而奸詐的手。否則要麼毀於市場，要麼關閉市場。\n\n但是，關閉市場，危機就解決了嗎？就像一條船，船漿被蟲蛀了個洞，即將斷裂。船長不去堵上這個洞補好這支槳，反而先告訴大家漿都有洞，大家不信。再說大家少一個槳船也能劃，仍然無效。就開始說我們將增加劃這支槳的人數……最終，乾脆將船槳扔進大海，這條船的命運也不用多說，大家都會清楚。在這場角逐中，無論是權力還是市場，都將是輸家！\n\n行文至此，我想也不用預測未來大盤走勢了吧。未來將以每日五個點左右的跌幅，一直將中國股市的水分榨幹，最終的底部資料，可能會是很難看的。市場正在顯示它的威力——還原真相。\n\n將權力的留給權力，讓價值的呈現價值，也許是最好的選擇，但是，我認為你國不會如此選擇。但是，我堅定地認為，這也許正是自由的曙光。\n"
		},
		{
			"post_id": 18,
			"title": "你總有機會為自己的冷漠付出代價",
			"date_published": 1485584046.599,
			"body": "![image alt](img/lzbz.jpg)\n廣西柳州的爆炸案令人驚魂未定，官方披露的資訊很少，但是見慣了當下中國各式苦難的國人，不用猜也知道大概發生了什麼。一個社會底層的老百姓，遭遇不公，告訴無門，最終做出了報復社會的決定。悲乎？儘管他投遞的郵包炸彈以政府機關為主要目標，但是終有平民受到傷害！幸乎？作為他個人來講，最終報復了這個不公的社會，受壓抑太久而扭曲的內心終於獲得平復，血恨深仇得以報償。\n---\n別以為這與你無關，這就是政治。當社會的不公義在持續不斷地踐踏人的權力和尊嚴，特別是這種不公義是以政府的名義強行推行，而你又不能阻止這種不公義的發生，甚至因為恐懼跟苟且連聲音都不敢發出，那麼，這災難遲早要落到你的頭上。這還算好的，如果它落到你至親骨肉的頭上，你將在孤獨和痛苦的回憶中懊悔終生。\n\n其實，政府跟強盜本來是水火不容的，雖然他們起初形成的本質是相同的。任何一個生命，只有在自體自在時才是真正自由的，但是伴隨著這種自由而來的，是嚴酷的自然環境和兇猛的野獸。因此，較為弱小的生命便形成組織，每一個個體讓渡一定的自由和權力，賦予集體更大的裁決處置權，以換取集體權利對個體的保護。這便是組織的形成。政府這種組織與強盜這種組織的區別在於，政府通過公共約定來維護組織中每一個個體的利益，並且通過武力或者談判對外來維護組織整體的利益。而強盜則更依據強權來維護組織的利益，特別是首先維護組織中處於權力頂峰者的利益。\n\n而中國社會管理階層則既不是政府也不是強盜，它甚至置組織和組織中的個體的利益而不顧，唯維護組織管理者的利益。所有的貪婪、奸詐、邪惡無所不用其極。對內橫徵暴斂，對外卑躬屈膝醜態盡出。中國當下所有的慘劇莫不出生於此。\n\n前不久流行“合法性”的說法，我的判斷很簡單：當一個政府所能賦予每一個組織成員的利益大於每一個組織個體付出的自由和權力的代價的時候，這個政府就是合法的政府，反之便是非法。\n\n而當一個政府不但不能保護組織內部的個體權力，相反卻嚴重地傷害和踐踏它的時候，任何災難的發生都有其充分的理由。\n\n柳州的爆炸案如此，天津的爆炸案如此，動車追尾事故如此，楊佳事件如此，天津商廈大火如此，前兩年頻繁發生在小學校幼稚園門前屠殺事件也同樣如此。沒有人是無辜的，因為你讓渡的自由和權力，成為了魔鬼，你不但不能阻止它，相反還為這魔鬼的惡行尋找自我安慰的理由。對邪惡的沉默就是邪惡的幫兇，更何況你豈止是沉默的幫兇，還在邪惡肆虐之時站腳助威！\n\n這就是佛家所講的共業吧。因果不昧，報應不爽。這業已成，你想還也要還，不想還，依然要還。\n\n廣西柳州爆炸案最值得大書特書的是，叫喊譴責濫殺無辜的聲音明顯小了。一則是這種事件如今發生的太多太多，人們的同情心早已透支殆盡。二來是很多人也認識到，這種災難的根源根本不在於災難的製造者，而在於這個我們人人有份的制度。甚至很多人可能都在想，如果有一天我也同樣遭遇這種告訴無門，無法承受的不公，我將怎麼辦？！在這個不義的社會裏，人人都是自危的受難者，同時人人也都是邪惡的幫兇。在這裏沒有無辜者。如果有一天我也同樣遭到不測，請不用為我收屍，喂狗正好！   \n"
		},
		{
			"post_id": 17,
			"title": "黑社會還是社會黑",
			"date_published": 1485583724.079,
			"body": "![image alt](img/shh.jpg)\n我少年時期最大的夢想，其實是想加入或者成立個黑社會組織。\n---\n那個時候剛上初中，讀了本閒書，書名大概是就是《世界十大黑幫》，書中比較詳細地介紹了黑手黨、三K黨、山口組、三合會、青紅幫等世界大佬級黑社會組織的發展歷程，看得年少輕狂的我熱血沸騰血脈噴張。然而現實比人強，當時正值八三年嚴打期間，看著身邊一個個大小“玩主”被抓被判刑，突然發現在一個法制不健全的社會裏，玩兒黑社會是一件安全係數和成功概率都很低的職業。\n\n後來，趕在嚴打尾巴上，我因為一點小事兒也被判了兩年少管，更驗證了當時“只有法制社會才有黑社會的發展空間”的判斷。\n\n眼看著加入黑社會的偉大夢想破滅，從少管所釋放之後，我又給人生設定了三個庸俗的夢想：第一是娶個正規大學畢業的老婆；第二是寫篇文章發表在報紙上；第三是到清華或者北大去講個課。35歲之前，這三個夢想都一一實現了，老婆就不說了，現如今大學生早沒當年那麼稀缺珍貴。工作沒幾年陰錯陽差混進了媒體一直幹到副主編，發表過的文章多到已經懶得再回頭去看。二十一世紀初趕上管理熱，在掛靠清華一個民辦的MBA研修班講了一年多的“《孫子兵法》與企業競爭戰略”，權當是站到了清華大學的講臺上。\n\n其實我一向是相信”有志者事竟成”的。如今，我最高大上的夢想就是……算了，不能說，說了也是敏感瓷兒。\n\n說這些事兒，主要是想厘清一個如今混淆不清的問題：到底是人的素質決定社會制度，還是社會制度決定人的素質？我是傾向於後者的。論據之一就是：當年那些讓人談虎變色的世界級黑幫組織，在民主的制度下如今大多儼然成為了社會底層秩序的守護者和捍衛者，在一些民主制度興盛的國家，如竹聯幫、山口組等都出現了向民間社團轉型的傾向。而在獨裁國家，比如中國，黑幫組織卻早已被收編如城管之流，墮落為朝廷鷹犬，讓我這個資深流氓都慚然不齒。\n\n好的制度造就好的國民，壞的制度只能加速“劣幣驅逐良幣”效應。再舉個實際的例子，在八十年代初剛剛開放那會兒，即便是大學教授，到五星級飯店也免不了一口痰吐在紅地毯上。如今，即便是農民工，估計也很少會衣著不整地出現在正規場所。因此我一向對素質論不以為然，沒有好的制度保證公民的尊嚴，何來高素質的公民？南京彭宇案和其後帶來的一系列惡劣效應，不正是這一結論的鮮明注腳嗎？\n\n無論是東方”人之初性本善”的性善論，還是西方”人人都有原罪”的性惡論，不管其善與惡的結論如何，但是其出發點都是一樣的，那就是每一個人都同樣擁有本性特徵，所有的人，要麼全部是性善，要麼全部是性惡，本質上並沒有差別。而最終表現在社會性上面的差別，在於”性相近而習相遠”，或者是認還是不認“主”。換句話說，人社會性的差異主要來自於社會教育、社會文化和社會制度（在基督教教義中，上帝是社會的立法者）。佛教不是也說“一切眾生皆具如來智慧德相，唯因妄想執著而不能證得”嗎。\n\n因此，說中國人素質低下無法享受民主，或者說中國人素質低下無法實現民主，再或者說中國要想實現民主必須提高全民素質一類的素質論提法，要麼是缺少社會學知識，要麼就是別有用心。在中國這種流氓盛行的法制環境、爾虞我詐的社會環境和崇尚豪取的教育環境下，如何能提高公民素質？更何況當下中國連公民社會都不存在，想做公民的都被關進監獄裏去了。\n\n2010年，我陪同門師叔去臺灣。師叔在武術界輩份頗高，與很多民國老兵都能續上齒緣。故此，我們爺兒倆在臺灣也受到比較隆重的接待，特別是跟臺灣幾位略有頭臉的黑道大哥，都喝過酒。席間自然談起當時在大陸混得風生水起的“白狼”。臺灣黑幫對此人的評價是：不忠不義。和在大陸能上黨媒的待遇截然不同，臺灣的大哥說，白狼早就被逐出了幫會，回去也會被打斷腿。這跟白狼在大陸的自說自話簡直就是冰火兩重天。臺灣的黑幫能有這種義薄雲天的善惡觀，與良好地保留了忠孝節義的傳統文化，以及其相對民主自由的社會環境不無關係。據我觀察，臺灣黑社會比大陸絕大多數政府機關還要白。他們念念關注的是，手下有幾萬徒眾，就有幾萬張選票。\n\n所以，是社會黑才滋生了黑社會，從來沒有因為黑社會導致了社會變黑。\n\n將這個問題引申一下，就是憲政政治與民主制度，誰成就了誰的問題。在我看來，首先是先有了憲政的制度，而後逐步形成了民主制度，逐漸成熟後的民主制度反過來再不斷完善憲政體制。而在專制社會裏，是無法產生民主思想的，因為制度的制定者和執行者——政府本身無法遏制自己為所欲為的欲望。中國歷史上最開放、政治最文明的朝代莫過於宋代，也未能發展出現代以三權分立為標誌的政治土壤，其原因就是，統治者沒有自我限制權力的意識和社會因素。我曾經說過，所謂的憲政，無非就是一種政治契約意識，統治者甚至可以制定一部奴隸制的憲法，但是你必須按照奴隸憲法中對待奴隸的標準來行政，而不能想怎麼來就怎麼來，想殺了誰就殺了誰。一切現代政治制度都來源於此，也發展於此。\n\n這就像一場拳擊賽，比賽的過程無論多麼殘酷，但卻是公平的。如果比賽進行到一半，裁判掏出槍來把參賽選手直接崩了，然後自己走上了領獎臺，這就不是殘酷的問題了，而是無恥，無一種令所有的流氓都不齒的恥。所有專制國家所無的，正恰恰是這種恥！\n"
		},
		{
			"post_id": 16,
			"title": "河邊的經濟崩潰",
			"date_published": 1485583403.008,
			"body": "![image alt](img/bdh.jpg)\n 據說（2016年7月）下個月，一群人將在一個叫“河”的海邊，開一個將決定未來數年間中國經濟將如何走向崩潰的會議。\n---\n在中國的政治語境中，我很喜歡北戴河這個特殊的地理名詞，頗有些坐井觀天的意味。本來嘛，明明是海濱，卻要將其稱之為“河”，那種俯瞰天下一覽眾山小的“氣概”，真的跟那只坐在井中妄尊自大的蛤蟆神似。\n\n據說，本次的河邊會議將主要研究經濟問題，我覺得倒不如說是研究未來數年內中國經濟如何崩潰問題來得言簡意賅。\n\n近幾天與中國經濟相關的消息，幾乎都是“惡意”的。經理人採購指數的連續下滑，說明了中國製造業已經開始顯現出崩潰的趨勢。近幾年來，隨著政府不斷加大對民間資本的掠奪力度，以民營經濟為主體的製造業完成了從有到無得“昇華”，眾多民營中小制造型企業紛紛倒閉，沒倒閉的不過在苟延殘喘。昂貴的物流費用和高企的能源成本，是套在製造業脖子上的兩個鎖鏈，如今越勒越緊。製造企業不得不靠偷工減料和低劣仿製生存，已經是眾所周知的事實。由於我早已離開經濟部門的工作崗位，因此很多過去唾手可得的經濟資料如今已經接觸不到了，我無法估算這兩年來的民營製造企業倒閉數目，但是每天從微博上、維權論壇上看到的因企業倒閉而引發的大規模維權事件，卻是層出不窮，而且已經不限於珠三角長三角這些傳統的勞動密集型企業集中的地區，內地也時有發生。\n\n伴隨著製造業崩潰而來的，是大量失業農民工將成為社會不穩定因素，而為將來可能出現的廣場革命儲備大量的人員。以前有人問過我，說中國為什麼沒有出現類似埃及敘利亞那樣的廣場革命，我回答說：中國人還沒有時間湊這個熱鬧，大多數有生力量還被禁錮在校園和血汗工廠裏。這部分力量對前途徹底絕望並且被釋放的日子，應該不遠了。我常說經濟危機對於一個奴隸制國家來說根本不是個問題。但是當一個奴隸國家中充滿了憤怒而無所事事的奴隸的時候，才真正是這個國家崩潰的臨界點。\n\n最新公佈的PMI初值只有48.2，這個數字一公佈，立刻引領國際大宗原材料產品期指的下滑，並帶動一批以製造業為基礎產業第三世界國家貨幣出現下跌。這一現象的出現，表明了國際社會對中國經濟走勢不樂觀。下一步甚至直接影響國際信用評級等一些列重要的社會經濟指標。惠譽和IMF近日都發出警告，稱中國債務危機已經顯現，比日本陷入經濟衰退前的債務增速還要快。\n\n前一陣子令人瞠目結舌的暴力救市，打消了我繼續預測中國股市大盤走勢的念頭。說實話，被用“槍”逼著交易的股市，還真沒有什麼可預測的。股指的漲跌，只跟握槍的那只手有關，跟經濟無關。但是，我曾經預言將出現的局面，毫無懸念的出現了，那就是世界上第一個只有一個人玩的股市。目前，中國股市套入的國家資金有多少？不得而知。只能說：很多，很多。以至於一個國家隊研討如何從股市中撤資的傳聞，都能引發股市大規模的跳水。無論是場內資金還是場外資金，大都玩起了短線，獲利離場的遊戲。中國期貨市場傳奇人物劉強的自殺，幾乎宣告了價值投資在中國股市的破產。今後的A股市場走勢，只有看“老佛爺”的一張臉，“老佛爺”今兒高興，就趕緊抽走點兒，“老佛爺”今兒臉色不好，就趕緊往裏填。\n\n股市不僅僅影響了“老佛爺”的臉色，更將影響國際貨幣基金組織對人民幣能否成為國際儲備貨幣的評估。其實也不用評估了，今年基本上沒戲，五年之後再說吧。不過這五年的世事著實難料。這河邊會議還在籌備階段，《日人民報》就放風出來，稱推進國企改革其中一項重要指標，就是要加強國有企業的經濟主導地位。這明顯是要重回計劃經濟的調門，完全顛覆了此前混合所有制的所謂改革，接下來，民營企業的生存環境將更加淒慘，解決了74％就業壓力的民營企業一旦陷入倒閉潮，對中國政治社會走向的影響，遠比股市暴跌深刻的多。不過話說回來，用征地掠奪了農民，用下崗掠奪了工人，用高稅收高生活成本掠奪了城市居民，用股市掠奪了中產階層之後，也該輪到你們企業主了。凱子外交需要錢啊……\n\n但是，IMF對國際貨幣的一條標準就是：政府不得大規模干預金融。這扣栓死了，今後怎麼解？\n\n其實可能人家根本就不想解，反正大不了關起門來我們自己玩，再來一次文革都無所謂了，再來一次閉關鎖國也沒什麼大不了。然而，這國門還鎖得住麼？\n\n這就是河邊經濟模式跟海洋經濟模式的差異。對於河，還有控制能力，對於大海，就必須遵循大海的規律。這也許就是為什麼，每年他們都要去一個叫“河”的海邊開會的深意吧。\n"
		},
		{
			"post_id": 15,
			"title": "一函遍複，致五毛們",
			"date_published": 1485338401.372,
			"body": "![image alt](img/wm.jpg)\n這兩天寫文章勤了點，除了親們打賞之外，也收穫了不少五毛的口水。我這個人不喜歡跟五毛說話，原因很簡單，差異不在於知識量或者看問題的角度，而是基本上的做人理念和人格完全不同。這些做人的道理本該是他們的父母從小教育給他們的。他又不管我叫爹，我更懶得管這閒事。\n---\n不過罵我的五毛多了，但罵詞兒千篇一律，為了提高五毛們的職業素養，勉勵他們積極上進，促進他們業務水準提高，罵詞兒更進一步豐富，故此我免費當回老爹，一篇統一回復。\n\n罵我最多的是說我漢奸，你要搞清楚，我身份證上寫的是回民，跟你們漢人沒個鳥兒關係。你們自己喜歡怎麼奸是你們自個兒的事，我充其量也就當個回奸。\n\n其次說我賣國。還是那句老話，這個國我活著暫住70年死了暫住20年，沒有一絲一毫的不動產屬於我的，我賣個屁啊。白龍尾島符拉迪沃斯托克倒是賣了，誰賣的怎麼賣的多少錢賣的？鬼才知道！鬼都知道！誰賣的你找誰要錢去啊。借你兩個膽子！\n\n最搞笑的是說我不愛國。我說我寫的都是實話，結果他說實話也不能隨便說，浦志強說實話就被關進去了。我擦，為了你所愛的國你他媽連句實話都不敢說，你他媽也配跟我說愛國？你他媽的是猴子請來的逗逼吧？\n\n還有人說我有政治企圖，想取而代之獲得政治利益等等。呵呵，我有政治企圖不假，就是需要一個公平的，尊重人權的，有較為廣泛的社會保障的，人人能得到法律公正保護的社會。最終目標是每個人一張選票，可以不受任何干涉地自由地決定自己的未來。說我想取而代之，實在是笑話。今天我跟孫子一樣被趕得到處流浪，動不動就坐牢，家徒四壁身無餘貫。好不容易為你們爭取到民主選舉的權力，我還得像孫子一樣去跟你們求一張選票。是你缺心眼兒啊還是我缺心眼兒啊？我這輩子欠你們的？在民主社會從政沒有什麼巨大利益可圖，有的只是無盡的奉獻，甚至生命。我這麼能力超強智商超高的人精兒怎麼可能去做從政這種職業啊！你這智商和眼界我真的無語了。\n\n說的最多的是罵我沒本事，拿美分，靠罵中國吃飯。且不說我從來沒拿過人家一分錢，我這個人也不喜歡吃嗟來之食。單說說本事吧。本人月盛齋後裔，300多年老字號，從小學過煮肉。小時候不喜歡上學，大了之後單位委託到大學培養了個技術員，拿不到學歷只好拼命學技術，當時拿了高低壓電工本電氣焊本，會玩車床旁通鉗工。文筆不錯幹了十幾年媒體，從記者當到副主編。自小家傳武術，18歲開始學摔跤，還學過散打練過拳擊。做過大型紀錄片監製，接觸過導演攝像。網路熱潮的時候參與過中國第一大MBA網站中國MBA在線的運營和管理，後來自辦“財智在線”網站，連代碼都是自己寫的。當年名列中國十大管理網站之一。在大學講過“孫子兵法與企業競爭策略”的EMBA課程。做過國字頭節能減排促進中心常務副主任，看透了中國官場虛偽和奸詐。玩過戶外，綠野資深領隊，登頂過四姑娘，國內最早玩戶外生存的老驢友……實話跟你說，憑我的本事，你全家餓死了，也餓不死我。\n\n還有一個跟我耍流氓的，說在中國分分鐘能讓我消失。我其實只想說一句話：要讓我消失你就得做的乾淨俐落，活著別讓我找到你，死前別讓我看見你。否則我活著殺了你全家，死了化作厲鬼毀你子孫八代，讓他們男為盜女為娼各個不得好死。別怪我狠，你動我一根汗毛你我就是私仇，我這個人私仇必報，絕不寬恕！還有我告訴你：小爺我從小二進宮，兩年少管，八九年學運蹲在北京炮局，正經的老炮兒，小爺我耍流氓的時候，你還在你爸大腿根那兒轉筋呢。\n\n還有位老爺子勸我別跟趙家人較勁，有時間多陪陪父母孩子，讓他們過得好點兒。這位老先生肯定不是五毛，但是代表了中國絕大多數人的想法。在這兒我首先得謝謝您老的關心。對父母，我這輩子肯定是不孝了，但不孝事小，對得起祖宗事大。將來九泉之下我父母面對列祖列宗，也會因為有我這麼個兒子臉上有光。再說我父母生活身體尚可，儘管不完全同意我的做法，但也知道我做的不是錯的事，只是叫我多加小心。對孩子更不用說了，我所追求的目標就是為了他們今後不必像我們這代人一樣如同圈養的豬般的活著。現在我給不了他太多的關愛，但是總有一天他必不會因我的軟弱和恐懼，戳著我的脊樑骨罵道：你們這幫軟弱的先人，因為你們的懦弱和猥瑣，才導致了我們如今悲慘的生活。\n\n必不會，我相信我對得起天地良心，先輩列祖和後代子孫。可你們呢？\n\n罵，請繼續，恕不奉陪。"
		},
		{
			"post_id": 14,
			"title": "我在我的祖國非法地活著",
			"date_published": 1485338174.635,
			"body": "![image alt](img/ff.jpg)\n也許會有這麼一天，早晨6點半，鬧鐘非法地叫醒了我，我非法地起床了。非法地穿好非法的衣服吃了頓非法的早點，非法地出門，非法地賺點小錢養家糊口。非法地填飽一天饑腸轆轆的肚子之後，晚上非法地拖著滿身疲憊的身體非法地躺在非法的床上。\n---\n別以為這是笑話，事實上對於獨裁統治者來說，你除了合法地為他們創造並被榨幹剩餘價值之外，你一切的行為都是非法的。因為你非法地消耗了他們本可以為所欲為地揮霍的資源。\n\n因此，在這個神奇的土地上，你會非法討薪、非法維權、非法上訪、非法寫作、非法出版、非法經營、非法辦學、非法行醫、非法言論、非法集會、非法侵佔、非法生育、非法喪葬、非法購買菜刀和白糖、非法獲取資訊、非法預測地震、非法監測霧霾、非法募捐、非法大吃大喝……\n\n事實上，對於專制政權來說，你除了為他們創造價值之外，連活著都是非法的，你唯一合法的身份就是創造價值的工具。也就是死而復生的技術沒有突破，否則你最佳的狀態應該是：需要你工作的時候你活蹦亂跳地幹活，一旦工作結束，你最好老老實實躺在墳墓裏，除了呼吸，連思維都應該停止。之所以還要保證你的呼吸能力，是因為他們還需要你替他們緩解霧霾。\n\n因此我對前兩天鬧得沸沸揚揚的闞中非法討薪公審公判大會一點兒也不關心，因此我對剛剛通過的非法募捐的法律一點兒也不關心。其實你自己靜下心來想一想，你曾經合法過嗎？\n\n這樣想一想你就釋然了，你能活著都是趙老太爺的恩賜，你還有臉討什麼薪？募什麼捐？維什麼權？！\n\n一國的行屍走肉！\n\n大約兩年前，我將上面這一段話的大致意思寫成微博發表，當然，當年寫的那段話遠沒有現在寫起來這麼具有現實的骨感。但是我那幾句不經意的牢騷後面，自然少不了五毛的駡街。其中一個略微斯文的傢伙評論到：為你的祖國在他需要的時候做出一些貢獻，有什麼值得抱怨的？\n\n國人（請原諒我侮辱了人這個高貴的辭彙）的生存境遇其實遠不如奴隸，但是國人的精神卻又遠強大過主人。在這個非法橫行的國度，有一個辭彙，就像普通家用電視機上的一個開關，一旦開啟，這國奴隸不如的人們，便似乎一下子高貴了起來，打滿雞血一般地慷慨激昂，勇往直前。這個詞就是：祖國。\n\n究其祖國的意義，首先是你生於斯長於斯，並且你祖祖輩輩在這裏生存生活，並死後長埋於此的地方。至少應該是有著你的祖輩生活的資訊並且供奉著你祖宗陵寢和牌位的地方。\n\n一個剛剛移民到某國的人，斷不會稱那個耳目一新的國家為祖國，直到他在這個新的國家子孫三代以後的後人，才會對這個國家有祖國認同感。說句糙話：埋著祖宗屍骨的地方才叫祖國。可是你，一個祖墳都被刨了被平了，死了只能暫埋20年的暫住民，也有臉稱這個地方是你的祖國？\n\n祖國這個高貴得常常令人淚流滿眶的辭彙，如今只不過是趙家人忽悠屁民的一針興奮劑。當他們需要你奉獻金錢乃至生命時，祖國出現了；當他們搶走你的財物的時候，祖國不見了。當他們要在國際上逞能時，祖國出現了；當他們嫖宿你家幼女時，祖國不見了。當他們需要轉移社會矛盾時，祖國出現了；當他們要強佔你養老金時，祖國不見了。當他們需要你為他們工作創造利潤時，祖國出現了；當你稅費沉重無力經營瀕臨倒閉時，祖國不見了。當他們需要你作惡欺壓良善時，祖國出現了；當他們為了平息民眾的憤怒需要替罪羊時，祖國不見了……\n\n在這片趙家土地上談祖國，你也配！\n\n除非你願意、且能夠，為實現你心目中真正能夠被稱之為祖國——那個充滿自由、公正之地的理想而捨生取義時，再奢談你的祖國吧。否則，你只能在你的“祖國”非法的活著。\n"
		},
		{
			"post_id": 13,
			"title": "救了只雞和埋了些人",
			"date_published": 1485337644.454,
			"body": "![image alt](img/jj.jpg)\n深圳滑坡事件發生後，各級政府官員、官方救援人員通力合作，終於救了只雞。在我印象中，好像汶川地震救了頭豬，天津大火救了條狗……仿似一時間中國儼然已經成為了世界動物保護標兵國，各種牲畜、家畜、孽畜都在這個國度幸福地安居樂業頤養天年，就算災難頻仍，又能奈畜何？\n---\n汶川地震那頭豬叫豬堅強，我覺得深圳這只雞應該叫雞穩定。君不見，自從這只雞獲救之後，責問土山哪里來之聲沒有了，問誰承包這個堆積場的聲音沒有了，問監管責任的聲音沒有了，問政府不作為的聲音沒有了，連問家屬情緒是否穩定的聲音都沒有了……這是一片多麼祥和的景象啊。我建議今後在擬建的深圳土石塌方遺址公園裏，為這只功高厥偉的雞樹立一座豐碑，若非在這突來的災難面前有這樣一隻穩如泰山定若閒庭的雞，又該有多少官員夜不能寐寢食難安啊！\n\n在土山堆積了多高成為敏感詞，非法堆積了多久成為遮罩詞，埋了多少棟樓成了謠言，死了多少人成為煽顛，幕後老闆是誰成了洩露國家機密的大時代裏，我們唯有歌頌這只雞，方能凸顯我們的愛國、愛黨、愛家！\n\n一片和諧社會大作中國夢的崛起景象。\n\n我不知道我所不知道的被埋在土石方下多少位死者中有沒有人會羡慕這只雞，就像我不知道我所不知道的中國還活著的人口中有多少人會羡慕這只雞一樣。我不能說：人不如雞，那畢竟太不和諧太不穩定了，且有煽動民族仇恨，哦不，是煽動物種仇恨的嫌疑。我只想說，你為什麼不能活得像只活雞？\n\n人之所以跟畜生有區別，只在於人有思想，有道德。人不同於雞，一把小米就幸福雞生了。按照馬斯洛的學說，人的追求是有層次的，是要逐漸實現自我的。這個自我不只滿足于溫飽安全，還需要歸屬於社會，並且得到相應的社會尊重。救了只雞和埋了些人，我覺得就比較缺乏社會歸屬感，因為醉心於救雞的與被救的雞，跟被埋在碎石下的人在類別上就具有差異，本質上就不是一個生物類限。當救雞的和被救的雞成為這個社會主流的時候，作為被埋在土石下的人想從中找到歸屬感，那確實是件挺麻煩的事兒。\n\n古語雲：人鬼不通途，其實人畜也不通途。\n\n據說下週二開庭的一個案子，也很受關注。報導稱，去年10月雲南晉寧一次征地慘案中，征地方與拆遷方進行了一場慘烈的械鬥，8人死亡18人受傷。此案將有5人被起訴故意殺人，其中四名村民，一名拆遷方組織者。這個案子去年我也聽說了，說是村民將扣留的幾名拆遷方成員，在雙方衝突時澆上汽油，點了天燈。\n\n我記憶中這個事件在微博上還一度引起爭論，有人說拆遷方也是聽命于領導，領導讓幹不得不幹。有人說做了壞事就應該承擔後果，被人點了天燈也是活該。我個人是傾向於後一種看法的。\n\n我只想問一個問題，領導讓幹就不得不幹，那麼領導讓你操你媽你是不是也二話不說撲上去就開操呢？如果不是，那麼你既然知道操你媽不對，你怎麼就不知道拆人家房子是不對的呢？你既然知道操你媽不對，你怎麼就不知道打人是不對的呢？你既然知道操你媽不對，你怎麼就不知道仗勢欺人是不對的呢？你既然知道操你媽不對，你怎麼就不知道欺壓良善是不對的呢？你既然知道操你媽不對，你怎麼就不知道見利忘義是不對的呢……我想，這就是人與畜生的區別吧。\n\n其實這個案子中被點了天燈的那幾個貨，也不過跟深圳救出的那只雞仿似。君不見，自此以後，追問征地手續的聲音沒有了，責問政府監管的聲音沒有了，追問征地開發中是否有權錢交易的聲音沒有了，甚至連多年上訪的聲音都沒有了……這是一片多麼祥和的景象啊。\n\n薩特說，人是自由的，人就是自由！作為自由的人既然選擇了自由，就一定會為自己自由的選擇付出代價，無論你的選擇是對的還是錯的。佛陀說：因果不昧報應不爽，因此菩薩畏因眾生畏果。這個世界上所有的一切無非因果迴圈報應不爽，無論是作惡的還是助紂為虐的，總有被清算的一天。當然，也許有人可能沒等到被清算就自己個兒死了，但你的子孫如何生存於世呢？即便你斷子絕孫，九泉之下你就有臉面面對你的列祖列宗了麼？我想，能不能想到這一層，也是人與畜生的差別吧。\n\n寫到此，突然又感到一陣淒涼。無論深圳救援能力專業與否，人家多少還救出了一隻雞。而我伏案執筆，日就萬言，也不一定能喚醒一個裝睡的活人。"
		},
		{
			"post_id": 12,
			"title": "公安部救市，我也是醉了",
			"date_published": 1485336799.858,
			"body": "![image alt](img/gabjs.jpg)\n新華社報到：2016年7月9日上午，剛剛履新的公安部副部長孟慶豐帶隊到證監會，會同證監會排查近期惡意賣空股票與股指的線索。至此，目前已有央行、財政部、國資委、證監會、銀監會、保監會、公安部等七部委參與到了本輪A股救市中。巧合的是，公安部一“出手”，兩市千股漲停。截至收盤，滬指報3709.33點，漲幅5.76%;深成指報11510.34點，漲幅4.25%;創業板指報2435.75點，漲幅3.03%。不少股民驚呼，難道公安部才是傳說中的“王炸”？\n---\n昨天，中國股市終於在公安部大力救市措施的作用下，全市沒有一隻股票下跌，全部上漲，與前幾日千股跌停的局面相映照的是，千股漲停。除了那些頓足捶胸事前慘遭停牌的股民們，其他股民可謂是歡欣鼓舞。從“暴利”救市發展成暴力救市，我真的沒有想到，也確實不敢想像。昨天一天，我都在為我貧瘠的智商而捉急。所以我決定，我今天不談股市，聊點別的。\n\n話說有一天，一輛車拋錨在山路上。車上的一干人等對此素手無策。司機著急地將車鑰匙在鑰匙孔中捅來捅去，一不小心，將鑰匙擰斷了。大家又嘗試推車，可前面一個小坡，大家誰都不願費力將車推上去。這時，乘客中一個五大三粗的流氓，上前扒拉開所有推車的人，還把堅持推車的張三暴打一頓。然後一手抬起車的一側，另一手扶住車的前輪，用力一轉，車輪滴溜溜地轉了起來。“能動了！能動了！看這轉速，最少有200邁！！”在一干乘客的歡呼聲中，大家拋下車子，步行下山而去。\n\n孟子有說過偃苗助長的故事。說宋國某人種田，既不除草也不施肥，因此他田裏的田苗比別人長得都矮。旁人多次勸他要除草施肥，他非但不聽，還施以老拳，將好心人暴打。一日，也許是被別人指責的難過，也許是因為確實自己家田苗長勢不好，突然有種揭不開鍋的隱憂，他突發奇想，將田中的一根根拔起來，而且拔的比旁人家的田苗還要高。回到家中，他自豪地對家人說：我今天終於幫著田裏的苗長高了，而且長得比天天數落我的那家人田裏的苗還高！他兒子聽後也很高興，忙跑到田裏去看，卻發現被拔高的田苗都枯萎了。\n\n從希臘哲學的“邏各斯”發源到笛卡爾成熟的理性主義者認為，人的知識來源於邏輯的認知，通過認知推理論證等手段，便可以獲得正確的方法，從而達到與目標一致的正確結果。而不管是經驗理性還是邏輯理性，理性主義基本上成為近代哲學中重要的組成部分。而理性的光輝，正是由於其不假感性的一廂情願，是超越欲望的實證主義態度。\n\n然而，一個老逼養的卻說：“理性之所以靠得住，是因為它源於感性。”我靠，當我讀到這句話的時候，好幾年掰不開鑷子，我品質低劣的小腦袋瓜，怎麼也無法將感性與理性統一起來。\n\n理性，一般指的是自然世界的客觀規律；感性，一般指的是自我對自然世界的認知。基本上，理性是以還原世界的本來面目為目的；感性是以世界對個體影響為研究方向。理性是除了客觀存在外擯斥其他影響因素的；感性是建立在個人情感之上認識世界的。理性是擁抱世界的，感性是世界為我所用的。\n\n人定勝天就是從中來的，公安部指揮股價，也是從這裏來的。\n\n說好的不說股市了，咱們繼續講故事。\n\n據網上說，五十年代中共在上海跟資本家鬥法，七搞八搞還是打不過。後來主席得到這個消息，說抓幾個就可以了。於是，黨中央贏了，而上海，一座東方明珠遠東最富裕的城市，從此輸了。\n\n這就像兩個拳擊手在拳臺上比賽，比著比著一個人突然從褲襠裏掏出把手槍，把對手給斃了。驚愕吧？恐怖吧？震驚吧？更值得驚愕恐怖震驚的還在後面：從裁判到觀眾，還他媽都認為劊子手贏了。我操！！\n\n這就是強權的邏輯：目的決定手段。一切的規則、道德、理性、科學都可以棄之不顧。不過這樣下去，對手從褲襠裏掏出手榴彈的日子也將不遠，學習葛天好榜樣！\n\n與此同時，我突然想到一個不寒而慄的問題，中國歷史上真的有過殺富濟貧的土匪嗎？一群打著人民的旗號搶劫的土匪，真的值得你相信嗎？從我理性主義的觀念看來，土匪只要打劫，就一定是為了自己。那麼，股市裏套牢的資金，誰的？\n\n唉！在這個反智主義盛行的時代，我真的醉了！\n"
		},
		{
			"post_id": 11,
			"title": "我們離文革還有多遠？",
			"date_published": 1485336151.733,
			"body": "![image alt](img/g20.jpg)\n這五十年來——以至於向前再回眸十年——六十年來，文革一直在場，只是程度深淺不同而已。\n---\n寫下這個題目，我們只能向後看，而不能向前看。\n\n50年前，史無前例的文化大革命宣告開始。這一場葬送了千萬人生命的人類浩劫，給中華民族歷史上，抹下了一道沉重的烙印。而今，五十年過去了，文革結束了嗎？對於這個問題，我們首先要弄清楚文革是什麼。\n\n文革，本質上就是通過消滅肉體的方式，將一個族群的思想統一到一個方向——領袖的思想方向上——並且利用製造集體瘋狂的手段，將領袖的權力無限放大。從這一點上來說，文革根本沒有結束過。因為這五十年來——以至於向前再回眸十年——六十年來，文革一直在場，只是程度深淺不同而已。\n\n六十年來，你可曾見過清除思想異己有半日停歇過？因此，當很多人寫道“文革即將重來”的時候，我就感覺好笑，文革什麼時候結束過？\n\n<b>——北戴河——</b>\n\n每年的七月底八月初，很多人都瞪大眼睛關注那個在北戴河召開的小圈子聚會。在這個流火的年月，接下來一個政策年度社會與經濟的走向是開放還是封閉？金融政策是寬鬆還是緊縮？民企是發展還是壓制？思想是開放還是禁錮？而所謂人事安排、權力交接、宮廷內鬥，除了趙家人和其大內管家之外，並不是人們真正關心的焦點，只不過是佐證前面的各種猜測而已。\n\n而今年的形勢不同以往，小圈子聚會剛剛結束，就傳出要成立關於計劃經濟體制專門的研究機構，以促使國企做大做強。另外在中央電視臺的一部紀錄片，也在大談特談《延安文藝座談會上的講話》對所謂的共產革命的積極意義。\n\n見微知著。作為深刻地研究並理解近百年中國歷史的我來說，這兩個並不為人注意的信號，卻比很多熱門話題更令人驚悚。這意味著未來可以預測的一段時期內，中國政治、社會、經濟環境將全面走向封閉。經濟上更大力度地將可流動資金注入奄奄一息的國企，以及無底深淵般的房地產和金融。所謂“供給側改革”的意圖更加明顯——增強國企壟斷範圍、全力擴大空置房銷售面積——甚至不惜破壞第一產業與第二、第三產業經濟平衡，將農民趕到城市。至於撂荒的農村耕地，正好可以繼續開發房地產。\n\n這就不難看出最新公佈的七月份經濟資料中的異常變化。本來已經形成剪刀差的M1、M2繼續擴大，高達15.2%，分別增長25.4%和10.2%。貨幣發行量繼續增加，而社會財富總量增長繼續萎縮。同時，新增貸款數量比預期降低了50%左右，意味著實體經濟仍舊不景氣，企業大多採取觀望態度，避免投資。其實從長期來看，諸多企業特別是國有企業和政府事業部門，在實業投資領域早就大幅縮減。甚至連城市基礎設施建設、企業基礎的設備維修都處於停滯狀態。一方面由於國際國內市場低迷，另一方面則是金融泡沫帶來的利益驅動。近年來層出不窮的公共安全事故——持續不斷的爆炸、火災以及自然災害導致的泥石流、內澇——正好證明了這一點。各種安全事故來源於對安全隱患的熟視無睹，而安全隱患的來源則是對責任的鬆懈和投入的減少。此外，在實際發生的4630億新增貸款中，居民中長期貸款則創下了4575億的新高，說明房貸在信貸中佔據了相當高的比例，房地產泡沫繼續擴大。\n\n在這樣的一個明顯扭曲的經濟資料下，提出計劃經濟這個議題就更顯得明目張膽。因為這種“流動性陷阱”的罪魁禍首，正是近年來國進民退、盲目投資、經濟泡沫和監管缺位造成的，而繼續擴大國企在市場中的主導地位，壓制民營企業發展的空間，正進一步地促使中國經濟在這一陷阱中越陷越深。\n\n看來，趙家是要鐵了心地在計劃經濟的道路上飛奔下去。畢竟國企才是趙家的錢袋子，民企不是。社會發展與經濟長期增長，事實上跟趙家人沒有任何關係，如何直接快速簡單地將社會資源在趙家人手中變現，才是至關重要的當務之急。\n\n<b>——連雲港——</b>\n\n如果說經濟資料表現的還是紙面上的經濟悖論，那麼發生在連雲港的抗爭事件則刻畫了經濟背景下官方與民間根本的對立——社會資源變現與生存危機之間的對立。\n\n連雲港的核廢料處理專案是趙家人手裏繼資源、能源、勞動力之後最後的一塊肥肉，一旦建成，將壟斷全球的核廢料處理，其利潤不可小覷。而且，這更是習援外執政以來在經濟層面最大的一個政績工程——我不光會撒幣，我也能掙錢，而且是掙全世界沒人敢掙的錢。為了將效益最大化，甚至不惜違反人類五千多年積累下來的一切常識，將處理廠建立在人口稠密的沿海地區，以免支付昂貴的向西北無人區運輸的費用。\n\n這一事件的背後，隱藏著的是對人生命的漠視。\n\n其實，這種漠視遠不是今天才有。從慘無人道的計生政策到以經濟發展為藉口的強拆，惡魔的車輪一旦轉動起來，刹車就絕不是其動力系統中必然的選項。長期以來，以金錢為代價的血酬定律，引發的社會普遍的生命漠視，是中國當前一大發展陷阱。\n\n其實對於專制統治者來說，中國地大物博，在地圖上隨便畫個地方，都可以視為無人區。諾大的三峽工程都可以移民，何況一個小小的連雲港。退一萬步來說，就算那裏的人全死光了，也不過區區500來萬人。跟十三億中國人相比較起來，還不到二百分之一。而對於兩個一百年的歷史偉大功績來說，根本就是恒沙一粒，不值得一提。\n\n但是站在民眾角度來看，每一個生命都是不可替代的。誰也不願意作為別人目標的犧牲品，哪怕你的目標再偉大。\n\n相比起過去的強拆、計生等官民對立來說，連雲港事件呈現出一種根本性的對立，是以生命為成本的權貴饕餮盛宴與不願放棄最後生存底線的草根之間的對立。這種對立事件，今後將會越來越多。因為趙家人的蠻橫不會戛然停止，同時也因為任何人的生命不會再來一次。\n\n<b>——南海與東海——</b>\n\n北戴河會議之後，軍方在很多問題上的表述明顯調門上調了八度。儘管雷聲大雨點小，但是仍舊顯示了一種心態。這種心態與一百多年前，脅迫著光緒傀儡寫下對十一國宣戰詔書慈禧同出一轍。同樣經歷了同治中興和洋務運動，大量的財富集中在統治者手中，凱子外交的結果就是助長了統治者的自大與狂傲。人民的生命賤如蔽履，社會對生命的尊嚴與命運的殘酷形成廣泛的漠視心裏，由於經濟的低迷導致民族主義盛行——人民對生活、對社會的怨恨不敢發洩在統治者身上，因為統治者不但不講法律，甚至不講道德。因此只能發洩在假想中的外國“敵人”身上——因為他們儘管也不講大清法律，但是卻講其本國法律——至少對生命本身還有幾分尊重在內。\n\n統治者的蠻橫、民間的怨恨、意淫的船堅炮利與國際環境在這種扭曲的社會中形成了一種合力的互動，共同將清王朝推向末路的深淵。\n\n這恐怕是獨裁者，特別是中國獨裁者共通的宿命。其實誰心裏都知道，這仗不能打。正如《孫子兵法》所說：主孰有道？將孰有能？天地孰得？法令孰行？兵眾孰強？士卒孰練？賞罰孰明？吾以此知勝負矣。\n\n但是無論哪一方又都希望打上一仗，就像俄羅斯輪盤，每個人都賭自己扣動扳機時，槍膛裏是空的。對於最高統治者來說，面對民怨和權力風險，打一仗也許是最能夠轉移矛盾的方法；對於貪腐成性的官員來說，打一仗可以讓自己的財富最大限度地變得安全；對於民粹分子來說，打一仗也許是改變命運的契機；對於尊重憲政人權的社運人士來說，打一仗也許能徹底破壞這一僵死的政治環境，如晚清一樣開創一個新的時代；對於底層民眾來說，已經活得生不如死了，倒不如置之死地而後生。總有一些時候，戰爭無論對博弈中哪一方來說，都看上去那麼的恰合時宜。如今欠缺的只是一個時間點，和一個適當的觸發事件。\n\n這裏根本不存在敢不敢打的問題，只存在在哪里和怎麼打的問題。勝算最大成本最小，一戰而定天下，是每一方力量都在精心盤算的盈虧點。儘管最後勝利者只能有一個，但是假像會令所有參與者都誤以為會笑到最後。這是人類有史以來所有戰爭莫不遵循的法則。\n\n<b>——杭州——</b>\n\n也許我們有幸能站到不遠的將來回望今天的愚蠢，一方面我們堅信西方敵對勢力亡我之心不死，一方面我們卻騰空一座千萬人口的城市以招待這些敵對分子。那個時候，我們可能會覺得這是一個笑話。\n\n試想這樣一個情境：一個走夜路的道士，一方面高喊“邪不勝正”，同時又在祈禱鬼神護佑。前者不過是給自己打氣的手段，後者才是內心的真實感受。\n\n人類是多元的，更是局限的。無論誰也逃脫不了這一局限。因為人的認識本身就是局限。比如，無論任何人在任何一個角度，只能看到任何一個物體一半的面積，永遠有另一半是他所觀察不到的。從近在咫尺的一塊橡皮到遠在天外的月亮。\n\n杭州就是如此。所謂西方敵對勢力，不過是嚇唬國內百姓的伎倆。而討好友邦則是老佛爺江山永固的法寶。獨裁者的結局通常都是愚蠢的，因為他以一人之智力對抗世界。\n\n杭州G20峰會的另外一個層面的意義，表現了官民對抗更深層次的焦慮。官方與民間相互之間的不信任，乃至猜忌，導致了官方甚至動用了坦克、軍隊來維護其外在的面子。外強中乾的表演，也註定了這次會議絕不會有什麼有價值的結果。與會各方表面上維護一個體面的國際形象，私下裏仍舊是心懷鬼胎。這種大國崛起式自我標榜的“盛會”，其奢靡程度也必將與其消亡速度成正比。正如西元610年，隋煬帝大集西域各國使臣與客商雲集洛陽，於城外通宵達旦演戲，戲場方圓四公里之闊，樂伎兩萬，樂聲傳至數十裏之外。外國人在洛陽吃飯住宿均不用花錢，連樹木都用錦緞包裹。有聰明的國外商人問曰：“中國亦有貧者，衣不蓋形，何如以此物與之，纏樹何為？”隋人慚不能答。八年後，隋煬帝斃，大隋亡。\n"
		},
		{
			"post_id": 10,
			"title": "2017，在劫難逃！",
			"date_published": 1485335536.505,
			"body": "![image alt](img/zjnt.jpg)\n2016年12月11日臨睡前，我跟網友打賭，次日人民幣兌美元將跌到1：6.94。第二天早晨打開電腦，離岸市場指數指向6.936。於是我鋪開稿紙，開始寫下這篇文章的題目：《2017，在劫難逃》。\n---\n<b>難以避免的經濟危機</b>\n\n2016年12月11日零時，WTO十五年貿易保護期到期，中國毫無懸念地沒有能夠獲得國際一致認可的市場經濟國地位，這預示著未來中國國際貿易將面臨四處碰壁的窘況。而中國若想最終獲得這一地位，除非落實其在2001年入市之初所作出的承諾，或者向WTO提起曠日持久的申訴。這兩種方式，都是習近平的“中國夢”所不能承受之重。\n\n其實，早在2001年中國加入世貿總協定之初，就有很多人認為，WTO是雙刃劍，一方面將會促進中國經濟發展，另一方面也將對中共的政治體制提出挑戰。事實上，能否落實WTO所規定的義務和責任，在中國根本就不是經濟問題，而是徹頭徹尾的政治問題。這是一個標準的囚徒困境：中共要麼放棄其無所不在的統治權力，要麼被國際主流社會踢出世界貿易圈之外。\n\n原本以為通過自身可預期的巨大市場，中共可以在國際貿易和金融領域為所欲為，自以為自己扣准了歐美經濟體的脈門，卻不成想自己的罩門已經被別人捏在手心裏。十多年來中國盡全國之力吹大的房地產泡沫，早被人一眼看穿，而製造業的短板，最終決定中國必然回到80年代所謂改革開放前的狀態：人民幣被孤立、糧食生產不足、進口困難導致消費品供應短缺、科技和生產技術落後世界水準二十年以上。甚至可能退至文革，必須依靠統一意識形態、食品配額制度，方能延續其統治。\n\n早在去年的文章中，我就預測今年年底前，人民幣對美元跌破1：7，並以此開啟經濟崩潰的大門。本月15日，美聯儲將再次迎來加息視窗，因為美國大選等因素一再推遲的美元加息，這次恐怕不會再跳票。這將進一步加重人民幣的下行壓力。而即將上任的川普，在對中貿易政策上的強硬態度，可以預見未來數年內，中美貿易將走上逆行道，而且歐洲和日本的態度也越發強硬。佔據著中國國際貿易總額60%以上的美日歐三大貿易體同時拒絕承認中國市場經濟地位，再加上美元升值所造成的經濟下行壓力，2017年中國經濟徹底解體的可能性日益加大。\n\n<b>漸行漸近的亞洲軍備競賽</b>\n\n儘管韓國總統朴槿惠日前辭去總統職務，但是日本與韓國正在修復的同盟關係，料想不會受到破壞。特別是在朝鮮不斷挑釁的情況下，韓國就更需要日本這一亞洲最近的盟友。而作為正在謀求重返亞洲主導地位的日本來說，與韓國修復同盟關係，則是相當重要的一個戰略佈局。\n\n美國候任總統川普在競選時，數次強調應該讓其盟友承擔更多的防務責任，這其中就包括支持（至少是不反對）包括日韓在內的亞洲盟友，自主研發高精尖武器甚至是核武器。日前，日本第二次試飛了全新的四代半心神戰機。從該機第一次試飛到第二次試飛，僅隔不到半年，可見日本方面應該是加快了心神的研發速度。而日本空軍力量在美國的支持下，已經強過中國，一旦心神戰機研發成功開始列裝，將是亞洲第一個部署四代半戰機的國家，其空軍戰鬥實力遠在中國之上。\n\n日本的軍事研發與工業製造水準早已獨步亞洲，心神戰機的研發只是在放棄防衛自製之後的小試牛刀。快速擴充軍備實力，甚至研發真正自主知識產權的航空母艦和核武，對日本來說並不困難。\n同樣感受到嚴重地區衝突威脅的，還有韓國和印度。朝鮮的存在在某種意義上來說，就是逼迫韓國通過購買一系列包括薩德在內的高端軍事設施，以提升日韓同盟的防禦能力。其實，對付朝鮮這種“手持狼牙棒”的義和團，是根本用不上薩德這種高大上的武器裝備的，真實目的幾乎所有人用腳後跟都能夠想明白。因此，一旦薩德部署完成，也就是朝鮮解放之時，這一點料想是不會有問題的。\n\n印度作為亞洲第二大國，一直與中國有領土爭端，同時對中國與巴基斯坦的關係耿耿於懷。印度的軍備一向以中國作為假想敵，近年來加快了軍備發展的印度，也將是亞洲未來軍備競賽中，中國的一個重要對手。\n\n分析亞洲地緣政治就不得不提到臺灣。\n\n自從川普與蔡英文通電話之後，美台關係便成了熱門話題。日前，川普又提出美台關係沒必要受制於一個中國政策。而日韓同盟要想在亞洲起到足夠分量的作用，拉攏並支持臺灣，也將是一個重要的戰略選擇。但是，目前臺灣從經濟到政治，還深刻地受著中國大陸的影響，未來日、韓、台戰略同盟的締結，還需要中共以更強硬甚至不惜軍事統一的態度，在背後助一臂之力。\n\n<b>日漸關閉的中國國門</b>\n\n經濟的日漸窘迫，使得原先構想的大撒幣模式的凱子外交，越來越難以為繼。而中共要想走出困境，目前似乎只有兩條路可以走。\n\n第一條路，是啟動政治體制改革和經濟改革，大幅縮減國有壟斷，讓權貴集團的黑手從經濟領域撤出來，讓自由經濟釋放活力。同時大規模精簡政府系統，縮減政府開支，全面減稅，並加強社會監督能力，向憲政之路邁出一步。但顯而易見，這對於視權利和利益為禁臠的中共來說，是最不可能的一條路。\n\n第二條路，切割與現代文明社會的一切聯繫，人民幣與美元脫鉤，關閉與國際互聯網介面。大力宣揚意識形態教育，大規模逮捕知識份子，禁絕自由思想。說到底，就是重回閉關鎖國的文革時代。\n這條路也有幾個問題，其中之一就是中國糧食的對外依存度高，自主糧食和農副產品產量不足以支持國內消費。一旦人民幣貶值，大量進口糧食將越來越困難。重新依靠供給制解決糧食危機，恐怕是到時候迫不得已的選擇。\n\n另外一個難題就是產能過剩的前提下，大量失業的工人，將成為社會最不安定的一族。隨著經濟的崩塌，大量外資撤走，民營企業紛紛倒閉，國有企業因市場需求銳減而開工不足，大量城市失業人口何去何從？要麼像79年一樣來一場對外戰爭，要麼向58年一樣來一場大規模的上山下鄉。\n但目前的問題是，農村已不再是穩固的根據地。多年的征地拆遷和基層的貪腐，早已將農民恬遐適然的田園生活打破。農村的剩餘勞動力和日益減少的可耕地面積的矛盾已經不可調和。這矛盾如何解決，恐怕沒有人去想。我常常在文章中提到一個觀點：奴隸社會不可能出現經濟危機，因為連奴隸的生命都不過是經濟本身；奴隸社會最大的敵人是失業，是莊園裏出現大量無所事事的准自由人。\n\n但是，儘管第二條路也是走不通的，但是從目前的情況看，已經開始走了。\n\n前兩天高調舉辦的全國高校政治思想工作會議，和山東等省份先後出臺旨在控制流動人口的登記制度，都釋放出重新回歸計劃經濟道路的信號。而接下來12月26日是毛誕，2016年這一天的紀念規格，在某種意義上將預示2017年的政治氣氛。如果不出所料的話，07年最晚春節過後，在政治理論方面新一輪批判憲政的戰役將再次打響，而與以往不同的是，這一輪的批判，將是不允許有反對聲音出現的。\n\n2016年是變化的前夜，美國、世界、中國莫不如此。而2017年，各種跡象表明，整個世界都將面臨劇烈的變化，不管向好的還是壞的方向轉變，有變化總好過溫水煮青蛙式的一成不變。\n\n2017，已經是在劫難逃！\n"
		},
		{
			"post_id": 9,
			"title": "絕望籠罩中國",
			"date_published": 1485333663.116,
			"body": "![image alt](img/wbs.jpg)\n<div align=\"center\">北京·景山公園·崇禎上吊處</div>\n上個月末，我多年前認識的一個朋友舉家離開了中國，他原本在蘇北地區做建築行業，六七年前最風生水起的時候，在北京買了兩套房，名下用來接待各級領導的依維柯就有兩輛。身後背著各種光環：地方人大代表，納稅大戶，因開發綠色社區曾經上過央視。然而，截止到上個月他離開中國，累計欠款數千萬人民幣，應收債務雖然也在數千萬上下，但是加上高額的民間借貸利息，早已經入不敷出了。他沒有選擇按照相關法律進行破產，而是選擇了逃亡。舉家到了美國之後，這個好幾年沒有聯繫過、經常對我的觀點嗤之以鼻、一向高呼中國是世界上最好的國家，但一直偷偷關注我的微博和微信的朋友，在微信上私信我說：“馬哥，現在我覺得你說的是對的。在中國是沒有希望的。”\n---\n跟這個發生在我朋友圈的事件相似的，是遼寧大石橋的運鈔車搶劫案。姑且不論所公佈的漏洞百出的案情，只按照官方披露的故事情節來看，這又是一起悲催的絕望故事。故事的主角也是一位曾經的工程建設企業老總，因政府長期拖欠專案款，導致欠債兩百多萬元，變賣家產也無力償還的他，最終選擇了搶劫運鈔車。搶完之後，他沒有逃離，而是挨個給債主還款，然後回家睡覺。如果這個離奇的故事是事實的話，那只能說被深深的絕望壓垮的李緒義（運鈔車搶劫故事的主角）早已將生死榮辱置之度外，唯一需要的是，作為欠債人的體面，和還錢瞬間的坦然。\n\n這份坦然，在今天的中國是如此的昂貴！\n\n與我那個自幹五朋友舉家逃往美國幾乎同時發生的，是甘肅偏僻山村楊改蘭一家六口服毒自殺的慘劇。\n\n8月26日，距離舉世關注的G20大會還有不到兩個星期的時間，甘肅康樂縣景古鎮阿姑村山老爺灣社28歲的年輕村民楊改蘭，騙自己三個年幼的孩子喝下農藥後，又用斧頭劈傷了自己的大女兒，強迫她也喝下農藥，然後服毒自殺。事後趕往醫院的丈夫得知一家五口人全部隕命，於次日也喝下了農藥，死於村旁小樹林中。作為這個社會的最底層，他們沒有能力逃亡國外，重新開始生活，而是選擇以死亡的方式逃離這個讓人絕望的國家。據事後新聞媒體拍攝的楊改蘭一家居住環境的照片，我們能夠看到的是難以言說的破敗。貧困如巨石般壓在這條山溝上，讓人窒息得無法抬起頭來。一家六口全部喪命，我們無法從死人的嘴裏得知導致這個事件切實的真相，但是生存的絕望和對未來的恐懼，一定是勒在這一家人脖頸上最緊的一道繩索。\n\n同樣彌漫著絕望的，是中共喉舌《環球時報》對這一事件的評論。這篇題為《這件轟動全國的慘案，也許並非“讓中國丟臉”這麼簡單》的文章稱：楊改蘭一家的悲劇，也許並不是貧困這麼簡單，“從今天康樂縣的慘案來看，農村扶貧也並不應該僅僅只是給‘低保’、給就業，更要關注大家的精神健康，甚至要管好農藥！”\n\n文章的作者“耿直哥”刻意繞過新聞中楊改蘭一家生存的窘狀、貧困與孤獨，而提出的解決問題的方法，是“管好農藥”。一向以洗地著稱的《環球時報》這次連洗地都洗得如此絕望，活脫脫像極了一個絕望的奴隸跪在主子的腳邊，木然地將主子拉的屎舔乾淨，已無求回報，只是為了證明自己還有點用，不該被殺掉而已。這已經不是一個“賤”字能解釋清楚的了。\n\n與甘肅楊改蘭慘案同時發生的，是伴隨著開學季以來，連續有大學生因被騙光學費、乃至生活費而死亡的事件。區區數千到萬元左右的生活費，就能夠奪去一個年輕的大學新生的生命，這其中的悲劇，恐怕連擅長小說的作家都很難想像。聽到這個新聞，我想起的是老舍在《茶館》中的一段臺詞：\n\n“這年月，作官的今天上任，明天撤職，作買賣的今天開市，明天關門，都不可靠！只有學生有錢，能夠按月交房租，沒錢的就上不了大學啊！您看，是這麼一筆帳不是？”\n\n如果說，一個上了大學的孩子是一個家庭的希望、一個剛剛飛出巢穴即將展翅高飛的孩子，心中也一定充滿了希望。那麼一個毀滅這雙重希望的社會，一定是一個無比殘酷的社會。區區萬把元錢，和年人均8000美元的GDP比較起來，是如此的沉重不堪！\n\n大概是2007年，中國人均GDP即將突破3000美元，我當時在《企業導刊》雜誌社任編輯部主任，曾經寫過一篇文章，大意是當心中國將陷入“南美陷阱”，也就是“權貴資本主義”泥沼。從2007年到2016年這短短九年間，我是親眼看著中國這個社會一步步走入這個陷阱，並且無法回頭。\n\n今年公佈的7月份經濟資料，M1與M2形成的剪刀差繼續擴大，高達15.2%。如此殘酷的資料表達的是：政府投入貨幣越來越大，印錢越來越多，而民間的投入和交易量越來越小。這種嚴重的流動性陷阱，除了官媒幾句“中國不存在流動性陷阱”的幹嚎之外，連個像樣的經濟學家的評論都沒有。何以故？根本不值得評論而已。只有像我這樣半吊子的財經愛好者寫篇文章分析下形勢，可惜還被屏蔽了。\n\n早在2010年我辭去所有公職之後，便決定不再寫文章。當時我曾經憤然甩下一句話：“這個社會不配利用我的智商，為暴政苟延殘喘！”現在才意識到，當時的這種情緒，無非也是一種絕望。大概是去年這個時候，我破戒了，因為有太多的東西如鯁在喉，同時也耐不住手癢。只是我採取了不再為未來找出路，只為衰敗的現實喝彩的態度。但還有不信邪的朋友在堅持寫作，比如我一位武夷山的友人，三個月前還寫了一篇文章，文章竭盡全力地謀求給中國的困境指一條出路，他的文章在網上存活了不到兩個小時，又被屏蔽了。幾天前在武夷山和他喝酒，他的口中，已然滿是絕望。\n\n所以，我對周小平、單人平、花千芳之流，鄙視歸鄙視，但怎麼也恨不起來。遇到他們的奇談怪論，無非調侃幾句，呵呵幾聲。對於即將崩潰的暴政來說，與其規勸它行善，倒不如鼓勵其作惡來的更直接、快捷、順暢。他們做的，比我曾經做過的，更直截了當！\n\n2012年十八大召開，我耐著性子認真地看完了電視直播。然後到康國雄老先生家中做客，當時原《炎黃春秋》雜誌副主編劉家駒先生也恰好在，自然而然地聊起剛剛結束的十八大，我問劉老的評價，劉老先生說：“從觀望到希望，最後到絕望。”\n\n一句“最後到絕望”，勾勒出中國近十年來的歷史軌跡。而今這絕望正逐漸蔓延開來，開始窒息整個社會。\n"
		},
		{
			"post_id": 8,
			"title": "法國暴恐案背景下的伊斯蘭教",
			"date_published": 1485333148.75,
			"body": "![image alt](img/fgbk.jpg)\n法國暴恐案發生後，網友任天堂問了我幾個問題，我不敢揣陋，一一作答。知識有限，認識也有限，對於這麼宏大的問題，錯誤的地方還請方家指正。\n---\n\n<B>問曰：有很多帖子說伊斯蘭教就是跟暴力捆綁在一起的，你怎麼看？</B>\n答曰：伊斯蘭教是上帝信仰中最晚開始傳播，也是最晚成型的。一般來說，任何宗教在人世間傳播的過程中，都會走過類似的一條路，從真理到只有少數人壟斷的真理再到普遍真理，或者說擁抱普世價值。伊斯蘭教基本上正處於第二個階段，並且和民粹主義集權專制政府一拍即合，形成了二戰後中東地區的政治主流生態，再加上巨大的石油利益衍生出以政府權貴為主體的利益集團，形成了現在這個局面。因此說伊斯蘭教與暴力捆綁在一起，不如說集權和民粹主義與暴力捆綁在一起更為恰當。\n\n<B>問曰：伊斯蘭人群跟基督教世界的關係，你怎麼看？伊斯蘭恐怖主義跟兩者的關係是否相關？</B>\n答曰：伊斯蘭教從古蘭經教義上說，與基督徒是兄弟關係，這一點是很清晰的。他們之間本來的差異在於對耶穌和默罕默德的認識問題。基督教認為耶穌是與上帝三位一體的真神，而伊斯蘭教認為耶穌是上帝的宗教傳播于世的先知。同時穆斯林認為默罕默德也是先知，是最後的一位也是最重要的一位先知，就像是城門上最後的一塊磚。這是宗教差異所在。而現在伊斯蘭教與基督教，哦不，應該說是伊斯蘭教中的集權力量與西方自由主義力量之間的對抗，事實上已經跟教義沒有關係了。這完全是民主跟獨裁的戰爭。那些被驅策做人體炸彈的穆斯林，跟任何獨裁國家被洗腦的民眾一樣，想想我們在文革中都幹過什麼吧，恐怕比這更邪惡。\n\n<B>問曰：亨廷頓說伊斯蘭教世界未來還是呈現擴張趨勢，這個你怎麼看？恐怖主義跟泛伊斯蘭是否相關？</B>\n答曰：我認為從宗教本質上說，越年輕的宗教越有生命力。伊斯蘭教來源於上帝的啟示，是世界上最重要的宗教之一，也是最年輕的宗教之一。只是局限於目前伊斯蘭世界專制力量，導致任何宗教改革的力量不能發生。因此上一旦人類這場專制與民主的戰爭勝負已定，伊斯蘭教中源自於上帝的力量也一定會戰勝魔鬼的力量，伊斯蘭教將迸發出巨大的生命力，這是有其歷史的必然性的。\n\n<B>問曰：伊斯蘭世界與現代民主政治文明的關係你怎麼看？其是否不相容？</B>\n答曰：我總是說，人類社會的問題推到神的身上，是人類的不負責任。任何宗教中都有正信和外道說，基督教也有，佛教也有。但是成熟的宗教都明白，信徒自身對普世價值的擁抱是神的本意。從這一點來說，伊斯蘭教徒還略顯年輕。但這絕不是神的本意。而是在於貫徹神的旨意的人。當神的旨意只有少數人獨霸解釋權的時候，教團本身就散發出魔鬼的味道。當神的旨意每一個人都可以平等地承接感悟和自由地交流的時候，教團才真正成為神的教團。\n\n<B>問曰：恐怖主義與發達國家的霸權關係你怎樣看？對中國有什麼借鑒意義嗎？</B>\n答曰：首先恐怖主義與發達國家和發展中國家沒有什麼關係。恐怖主義本質上是專制主義的產物，他們希望強迫所有人按照他們的理想去行為和生活。為此不惜使用最惡毒的暴力手段。這種專制主義形成國家，就是國家暴力主義。如果還行不成氣候，就是目前中東地區所呈現的暴力主義。他跟霸權沒有關係，還是民主與專制之間的矛盾。\n\n<B>補充提問：那麼他們為什麼沒有針對當地人群，而是基督教世界人群？也是當地專制者洗腦的緣故？</B>\n答曰：他們根本針對的是一切民主國家的人群，對平民，他們並不區分什麼民族地區和信仰。他們對本地區的暴力統治更殘暴。比對西方有過之而無不及。事實上，整個isis呈現出來的就是一種極度膨脹的集權主義理想與實現這一理想的迫切。在某種意義上來說，這也是近年來歐美國家自身綏靖主義所造成的惡果。在人類社會中，一旦你忽視了他人所承受的苦難的時候，也正是註定你將承受相等的苦難的開始。\n\n<B>問曰：宗教極端恐怖活動與當前伊斯蘭人群，尤其是伊斯蘭教的關係，你怎麼看？</B>\n答曰：伊斯蘭教地區的極端恐怖主義，事實上是極權專制主義綁架了宗教。應該說跟宗教本身沒有關係。但是，與教團有直接的關係。教團需要改革，但是改革需要自由的空間。\n\n<B>問曰：對於歷史上的伊斯蘭文明，以及其與今天的宗教恐怖活動的關係，你怎麼看？對中國有什麼借鑒意義？</B>\n答曰：開始我就說了，任何宗教都會有基本相同的一條路線，就是：真理、被少數人壟斷的真理和普遍真理。真理時代或者說是神啟時代是最純粹也是最美好的，被壟斷的時代則是最骯髒和黑暗的。普遍真理時代，也是又一個輝煌的時代開始。因為伊斯蘭教興起的時代恰恰處於基督教壟斷真理的時代，自然在歷史上留下來如此輝煌的印記。而今，基督教已經走入普遍真理時代，而伊斯蘭教處於壟斷真理時代，再加上被專制民粹主義綁架，自然處於最黑暗的時代。\n\n<B>補充問題：最後補充一個，雖然不是很宗教化，但是宗教功能非常強的，就是通婚問題，再加一個吃豬肉，或者說清真問題，跟通婚問題比較類似。</B>\n答曰：不吃豬肉其實是上帝信仰中比較共通的，原始的上帝信仰比如猶太教也不吃豬肉。但是年代久遠，被世人提起的並不多。東正教以前好像也不吃。舊約中也有關於不准吃豬肉的律法，我好多年沒有讀聖經，印象中應該是。事實上這是人類與上帝的一個約，凡是沒有被祭祀犧牲過的動物都不能吃。凡是祭祀犧牲過的，上帝會留下他的印記，比如分蹄、反芻和魚鱗與魚鰓。但是沒有這些特徵的，都是不應該吃的。然而隨著人類的繁衍和食物減少等因素，這些禁忌逐漸被開許了，但是伊斯蘭教因為年輕，因此上還恪守這些約。\n\n通婚也一樣的。任何宗教，甚至民族，乃至家族都有其通婚的約定。為的是其血統純正文化保守，在人類社會中屢見不鮮，更不是伊斯蘭教獨有的教義。"
		},
		{
			"post_id": 7,
			"title": "一個異教徒的禱告",
			"date_published": 1485331991.46,
			"body": "![image alt](img/szj.jpg)\n今天，一位元浙江的弟兄給我電話，他說：\n他們為什麼這麼行魔鬼的事，如此的羞辱我們，如此的踐踏我們的十字架。\n我想了很久，很久。說：\n對於魔鬼來說，凡事信仰真理的，都是邪教！\n---\n我是個佛教徒，在基督徒眼裏我是個異教徒。但是我仍舊很悲憤，我的悲憤在於……\n\n十字架。一個信仰的標誌。基督說，十字架是真理，是道路。我每想起，耶穌作為神的親子，被釘於十字架上，為人贖了罪，我就莫名的感動。那是神的寶血浸染了的十字架，那是人所得救的唯一見證，那是主耶穌基督用自己的生命闡述的：真理，道路和生命！\n\n我是個佛教徒，于基督教我理解的不多。但是我知道，主耶穌基督自降世以來所有言說成就於十字架，他以十字架為武器戰勝了我們內心的惡，戰勝了人的貪婪與無知，戰勝了人類的邪惡跟幫兇，戰勝了我們自己和成就神的道。而今，在這個國度，十字架要被拆去了，我欲哭無淚。\n\n我是個異教徒，不知道能否蒙神的恩典，不為別的，只為蒙神所甄別的戰士，如果我能，願神驅策。\n\n我是個異教徒，願神將我如他的信徒一樣揀選我為他的先鋒，這是我所願的。\n\n我是個異教徒，但我堅信神一定如同聽聞自己的信徒一樣的傾聽我今天的禱告，因為，今天，我向主耶和華禱告：\n\n<B>奉聖父聖子聖靈之名，請接受一個異教徒向您禱告。感謝主，讓我認識如此之堅強不屈的兄弟姊妹，感謝主將你一切擁有的賜予他們。感謝主給與我們今日生活的一切所需讓我們無所缺乏，感謝主！你讓我們從懵懂無知的羔羊，揀選我們為，不可戰勝的戰士。\n        感謝主，你原諒我們的懦弱，祈求你拿去我們心中的恐懼。感謝主你讓我們堅強，祈求你拿去我們心中的恐懼。當你留給我們的見證，他們都要奪去，感謝主，給我們力量讓我們守護你，如同我們的生命。\n       感謝主，我知道我們所付出的必受得你的恩寵，願你揀選我，成為你的先鋒。\n      感謝主讓我認識如此好的兄弟姊妹，感謝主讓我籍著兄弟姐妹的腳步繼續前行。我們永遠在奔赴十字架的路上，我們永遠是你在十字架上復活的羔羊。\n         感謝主，傾聽我一個異教徒的禱告，願你的大能行于地上如同行在天上。願你拿走我心中的懦弱賜予我力量，願你去除我的卑微賜予我神的榮耀，以使魔鬼顫抖，以使你的軍，所向披靡。\n        禱告，奉主耶穌基督之名！阿門！</B>"
		},
		{
			"post_id": 6,
			"title": "佛教：平等的與暴力的",
			"date_published": 1485329957.114,
			"body": "![image alt](img/pdbl.jpg)\n前一陣子在微信與網友溝通，網友問了很多關於佛教的問題。本人雖皈依佛門二十多年，但對於佛陀的教言來說，實在是連皮毛都不瞭解。與朋友所說的，只是自己日常算不得修行的一點兒心得，經朋友同意，將散亂的交流整理出來發到網上，錯謬之處，還請各位同修、大德指教。\n---\n<B>問曰：佛教的本質是什麼？</B>\n答曰：平等。佛教的本質是平等，在佛教中，平等甚至是整個世界的基礎。《華嚴經》中佛陀描述我們這個現實的世界，是建立在一朵蓮花上，支撐蓮花的十個風輪，其中第一個風輪就是平等輪。因此，在佛教徒的眼中，沒有平等，這個世界都不復存在了。\n\n佛陀在證悟之後，第一句話說的是：奇哉奇哉，一切眾生本具如來智慧德相，唯因妄想執著而不能證得。這句話的意思是說，所有這個世界的眾生，包括人、動物、植物、微生物，都與佛陀一般無異，其差別只在於是否執著於妄想而已。”離開了諸般妄想，即是諸佛（圓覺經語）”。因此，佛教是講平等的宗教，徹底的平等，本質上的平等。\n\n<B>問曰：佛教所說的平等跟現實的平均是不是一樣的？</B>\n答曰：不是。佛陀所說的平等是一切眾生本質上的平等。但是因貪嗔癡慢疑的深淺不同、執著於色聲香味觸法的深淺不同、過往的業力不同，所處終生群族的共業不同而有各種各樣的差別。因此，佛陀說的平等不是物質上的平均，而是精神上、本質上、靈魂上的平等。\n\n<B>問曰：什麼是業力和共業？</B>\n答曰：佛教認為，世間萬物和生命的輪回無非是因果，春天種下一粒種子，秋天收穫眾多果實。把水放在火上就會沸騰。因此，你昨天做了什麼，就會決定你今天的生存狀態。你今天做了什麼，也決定你未來的生活狀態。這個世界上沒有一個因不會最終結果，也沒有一個果不是因為過去所造的因。這個過去的因，就叫做業，這個業就像一股巨大的推力，推著每一個生命向前走，無論是天界還是地獄，這股力量都會推著六道輪回，沒有終點。由於過往的因太多，所以又叫“業海”。又因為六道輪回沒有終點，因此又稱“輪回”。\n\n共業是指你所在族群中所有眾生共同造的業，比如當下的中國如此惡劣的政治經濟文化和地理環境，在佛教徒看來，就是數千年來特別是百年來這個族群中所有眾生共同所造的共業造成的。如果我們今天仍不警醒，仍依附於惡業惡緣，可以預見的將來會更加淒慘。\n\n<B>問曰：改變業力，就是要多做善事不做惡事嗎？</B>\n答曰：非也。佛法非善法。佛教從根本上也不講究善惡，而是強調解脫。其實在佛陀看來，無論善還是惡，都是業。善也是業，執著於善業同樣解脫不了，因為一樣要受到善業所帶來的善果的纏縛。佛陀的教誨是：離開善惡，歸於八正道、六波若密，才是解脫之道。八正道是：正見、正思維、正語、正業、正方便、正命、正定、正念。六波若密是：佈施、持戒、忍辱、精進、禪、般若。\n\n換句話說，佛教徒不應該執著於善惡，而是遠離善惡，不依從於善惡，做善惡的觀察者和改變者，才能消除業力，出脫輪回。\n\n就比如我們面對現下共匪的惡，不是執著於他是否能夠行善政，也不是執著於他行了多少惡政，而是從根本上否定它，因為它本質上違背了八正道，同時也帶著眾生行入邪道，因此，佛教徒應該堅守八正道，並徹底摧毀這種惡的根源。在這種惡的面前，無論勸導其向善還是譴責其作惡，其實都是一種隨順，隨順了惡的道路。\n\n<B>問曰：佛教給人的感覺是非暴力的，好像逆來順受什麼的。</B>\n答曰：既然沒有善惡，自然也就沒有非暴力與暴力。佛教確實不主張暴力，希望用佛法來感化眾生，但是佛教也從沒有放棄暴力。假如你到寺院，一進山門就有兩尊佛像，一尊彌勒，一尊韋陀。韋陀尊者是天神，未來也將成佛。他身披鎧甲手持寶杵，誓用生命維護佛法。但他手中的寶杵是用來做什麼的呢？用來懲罰、降魔。\n\n暴力與非暴力只不過是方便法門，智慧解脫才是本質。用般若智慧指導方便，則方便無所不用。以愚癡來行使方便，則方便即是障礙。\n\n<B>問曰：那為什麼惡魔不倒，而且還越來越氣勢洶洶？</B>\n答曰：一切魔莫不是心魔。其實在佛陀的教言中，一切世間萬物，無不是每個人內心的化現。每個人的內心千差萬別，事實上每個人所看到的世界也千差萬別。那麼，我們之所以共同看到這個惡政所帶來的惡境，正因為我們心中也有類似的惡。\n\n對自己內心的惡的認識，有兩種方式，一種是自外而內的，由於看到惡境反觀自己，看到內心的惡，從而努力去剔除內心的惡。一種是自內而外的，因為看到並正視自己內心的惡，而反觀到這個惡境的惡，並且奮起反抗。兩者的結果是相同的，但是路徑不同。\n\n當然，有人也看到內心的惡但是不敢正視它面對它，自然會隨順惡境的惡，這就類似我們網上所說的“五毛”。而有的人看到了惡境的惡卻不懂得反觀自己內心的惡，雖則反抗但是結果卻是造就了更大的惡，這便是中共政權的由來。\n\n因為我們不能將惡境反觀自心，同時又不敢正視自己內心的惡，甚至隨順它、嬌慣它，因此最終造就了惡魔的勢力越做越大。\n\n因此說，反抗暴政事實上也正是反抗自己內心的惡。幾千年來，特別是近百年來，我們所造的惡業形成的共業，形成了今天這種人間慘境，對這一點認識的越深刻，我們的反抗就越堅定和徹底。我們反抗的目的是要使我們成之為人，乃至成就佛道。而不再為奴，為自己惡性的奴，最終走上解脫的八正道。\n\n<B>問曰：說說最近頗流行的活佛轉世吧，以及朝陽區散養的仁波切。</B>\n答曰：每一個人都在輪回轉世。佛教認為，這個世間有六道：天道、人道、阿修羅、地獄、餓鬼、畜生。人因前世及累劫業力所致，在六道中不停地流轉。一般人前世今生，稱之為輪回，而不叫轉世，是因為這種輪回你不能做主，只能隨著業力流轉。而轉世活佛則依靠的是濟世救人的願力，並且明確地知道自己將救度某一類型的有緣眾生。因此，轉世活佛轉世而來有個必然清晰的目的，就是要不惜身命救度眾生。否則，就是你說的散養仁波切了。\n\n其實漢傳佛教也有轉世，只不過沒有形成這種制度而已。很多不惜身命拯救社會拯救大眾者，不也正是活佛轉世的一種表現嗎？\n\n<B>問曰：你怎麼看待法輪功？</B>\n答曰：我很久以前接觸過他們的書，感覺與佛教相比，粗糙很多，很多教義自成悖論，肯定不屬於佛教。而且教義更執著於善，對人本質的解脫關注不夠。這是我十多年前的觀感，目前對他們瞭解的還是不多，資訊來源有限，不敢多做評價。\n\n<B>問曰：為什麼佛教徒要念阿彌陀佛。</B>\n答曰：因為人們隨著業力流轉不停地輪回，永無出期。儘管聞聽佛陀的教誨，但是依靠自己的力量消除宿業出脫輪回，是很難很難的。因此，無始劫來，一些成佛的修行者在修行過程中就曾經發過各種各樣的願，其中阿彌陀佛就發願說：聞我名號必來我剎若不爾者不取正覺。阿彌陀佛為修行者建立了一方淨土，可以使眾生暫時出脫六道輪回，在彌陀淨土修行成就。因此，學佛之人念彌陀名號，希望籍著佛力，早日出脫輪回，成就佛道。\n\n其實，因往先無量劫成就的諸佛願力不同，成就的佛號加持力也不同。不同希求的眾生也有念誦不同的佛號的。比如求健康的念藥師佛，我是學武術的，還念過很長一段時間鬥戰勝佛呢。"
		},
		{
			"post_id": 5,
			"title": "華嚴心鏡 · 第三章：因果的真相",
			"date_published": 1485311286.764,
			"body": "![image alt](img/jx4.jpg)\n前幾天在一個佛教群裏討論帶業往生的問題，有人說，如果因果實有就不可能帶業往生，也有人說因彌陀願力故可以帶業往生。也就是說，一些人認為因果實有，任何人也不能違背因果的規律，因此帶業往生彌陀淨土，一生成佛，是不可能的。而有人認為因果為世間法，依靠個人修行無法擺脫六道輪回，但是阿彌陀佛以其宏大的誓願以及已經成佛的果地覺，可以超越世間法帶業往生，往生後一切因果為緣，一切冤親眷屬均以此緣終得利益，故可以橫斷因果。\n---\n但是，持因果實有觀點的朋友認為，如果說在因果律下，一個殺了人的人可以帶業往生彌陀淨土，並且一生成佛，那麼對於那個被他所殺的人，是不公平的，因此他不能帶業往生。而持因果實無觀點的朋友則認為，六道本是有為法，如夢幻泡影，一旦生命體一念覺醒，便不受因果束縛。\n\n持因果實有觀點的朋友舉《佛說興起行經》中的故事，即便釋迦牟尼佛已經成道，仍不免因宿世各種業因，現頭疼三日（佛陀宿世為幼童時捕魚，用木棒打魚頭三下）、剛木槍刺腳（佛陀宿世曾為船主，與另一船主爭船，佛陀船主以槍刺對方腳，而導致其死亡）等宿世業報。\n\n持因果實無觀點的朋友則認為，釋迦牟尼佛現此種種相為教化眾生故，是佛陀以意願行之。如《佛說興起行經•序》中所說：所以殷勤告舍利弗者，欲化諸龍故也。\n\n因果，是佛教教義中非常重要的一對範疇，也是哲學上的根本範疇，更是物理學上的一對有趣的範疇。\n\n從哲學上，特別是從唯物主義哲學上來講，因果律是具有廣泛的規律性。宇宙中任意一種狀態，都是從前一種狀態發展而來。也就是什麼樣的因最終一定對應什麼果。但問題是，一顆種子落到地上，卻並不一定結成什麼樣的果子。因為它還要受到種子所落之處、氣候條件、天氣變化、鳥獸吞食、地質災害、種子自身健康等等因素的影響，才能最終呈現出果的樣子。因此，傳統唯物主義哲學觀認為因果是唯一決定性因素的學說，哲學界一般認為是教條主義。馬克思主義便是這種教條主義的產物。他認為人類一定是通過原始共產主義——剝削的奴隸社會到資本主義社會的演變——反抗剝削的社會主義社會——最終進入沒有剝削的共產主義社會。這是馬克思《資本論》的學說中，剩餘價值作為社會發展的主導因素，所推導出共產主義的結果。但是他沒有考慮到相關的緣——憲政制度、自由市場經濟的自我調節能力、社會福利的發展和科技的進步所對單一的社會因果產生的影響。\n\n而佛陀在因果律的闡述中，則引入了十二因緣的概念。佛陀不說因果，而說因緣，或者直接說緣，而不直接說因。\n\n有一次，佛陀正在法會中講法，一優婆夷心懷憂懼。原來，此優婆夷名顛倒，此顛倒女往昔曾懷六甲，因家法故，服毒墮胎。因其墮胎因緣，當于現世得多病短壽之報，於是在法會中祈求佛陀慈悲哀佑。此時地獄鬼使已至，即將索取顛倒女的性命，佛陀說：鬼使且慢，我正在為此顛倒女說法，說法之後自有驗證。於是，佛告訴此顛倒女說：\n\n顛倒當知，此無常殺鬼，情求難脫，縱有無量百千金銀琉璃硨磲赤珠瑪瑙，而將贖命，無能得免，縱使國王王子，大臣長者，恃其勢力，無常鬼至，斷其寶命，無一能免。顛倒當知，唯佛一字能免斯苦。顛倒，世有二人甚為稀有，如優曇花，難可值遇，一者不行惡法，二者有罪即能懺悔，如是之人，甚為稀有。汝能至心於我懺悔，我當為汝說長壽經，令汝得免無常鬼苦。\n\n顛倒女懺悔後，佛陀為說十二因緣法：\n\n無明緣行，行緣識，識緣名色，名色緣六入，六入緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死憂悲苦惱；無明滅即行滅，行滅即識滅，識滅即名色滅，名色滅即六入滅，六入滅即觸滅，觸滅即受滅，受滅即愛滅，愛滅即取滅，取滅即有滅，有滅即生滅，生滅即老死憂悲苦惱滅。顛倒當知，一切眾生，不能見於十二因緣，是故輪轉生死苦趣。若有人見十二因緣者，即是見法，見法者即是見佛，見佛者即是佛性。何以故，一切諸佛以此為性，汝今得聞我說此十二因緣，汝今以得佛性清淨，堪為法器。”\n\n接下來，佛陀又說：\n\n我當為汝說一實道，汝當思惟，守護一念，一念者謂菩提心，菩提心者，名曰大乘。諸佛菩薩為眾生故，分別說三。汝當念念常勤守護是菩提心，勿令忘失。縱有五陰四蛇，三毒六賊，一切諸魔，來所侵嬈，終不能變是菩提心。因獲如是菩提心故，身如金剛，心如虛空，難可沮壞，因不壞故，即得阿耨多羅三藐三菩提，因得阿耨多羅三藐三菩提故，常樂我淨具足而有，即能遠離此無常殺鬼，生老病死諸地獄苦。\n\n這段經文中，佛陀明確說明十二因緣，順生緣起則為流轉門，眾生流轉生死六道輪回。逆生則為還滅門，眾生煩惱解脫覺悟成佛。而從流轉門到還滅門則“唯佛一字”能轉。所謂皈依佛門，當諸惡莫作眾善奉行（即不行惡法），勤常懺悔（有罪即能懺悔）。並且應當發菩提心，執持六波羅蜜，踐行“利益眾生饒益有情”的菩薩道，達至“常樂我淨”的涅槃境地，自然遠離生老病死等憂悲苦惱。\n\n佛陀說法畢，地獄清淨為蓮花池，鬼使立舍鬼境。而顛倒女聞佛說法，心豁明淨，了了而悟，以佛神力，升于虛空，高七多羅樹，安心靜坐。此顛倒女者，即為文殊師利菩薩。\n\n佛陀在《佛說長壽滅罪護諸童子陀羅尼經》中所說法，明確說明：因果為幻，因果可斷，因果可逆。只不過，這個為幻、可斷、可逆的過程，首先要唯佛是道、勤常懺悔、發菩提心、廣行六波羅蜜。因此，釋迦牟尼佛說淨土法門，可帶業往生，肯定是真實不虛，決定成立的。但是也免不了要皈命彌陀、常行懺悔、發菩提心、廣行六波羅蜜。\n\n佛教是解脫的宗教，不是善惡的宗教。\n\n其實世界上所有的宗教，也都是解脫的宗教，而不是善惡的宗教。原因很簡單，依著人類的見識，是無法評判善惡的。基督教系統中亞當、夏娃被逐出伊甸園，也是因為偷吃了分別善惡樹上的果子，才產生了人的原罪。《華嚴經》說：無一眾生，而不具有如來智慧，但以妄想顛倒執著，而不證得。若離妄想，一切智自然智無礙智，則得現前。所謂妄想者，妄想諸相唯實，顛倒一切幻像為真，執著一切有我人眾生壽者。\n\n過去七佛傳法偈，見載於五代時期延壽禪師的《宗鏡錄》，不知佛經原本出處。這七個偈子，是過去七佛傳法時所說，莊嚴劫前三佛的傳法偈，無不談善惡或者罪福。\n\n毗婆屍佛曰：\n身從無相中受生，猶如幻出諸形象， \n幻人心識本來無，罪福皆空無所住。\n\n屍棄佛曰：\n起諸善業本是幻，造諸惡業亦是幻， \n身如聚沫心如風，幻出無根無實性。  \n\n毗舍浮佛曰：\n假借四大以為身，心本無生因境有， \n前境若無心亦無，罪福如幻起亦滅。\n\n賢劫四佛中，迦葉佛也談到罪福，他說：\n一切眾生性清淨，從本無生無可滅， \n即此身心是幻生，幻化之中無罪福。\n\n賢劫另外三佛多談空性，拘那含佛在談到空性之餘，也談到罪性。\n\n拘留孫佛曰：    \n見身無實是佛見，了心如幻是佛了， \n了得身心本性空，斯人與佛何殊別。   \n\n拘那含佛曰：  \n佛不見身知是佛，若實有知別無佛， \n智者能知罪性空，坦然不懼於生死。    \n\n釋迦牟尼佛曰：\n法本法無法，無法法亦法，\n今付無法時，法法何曾法。    \n\n那麼，為什麼佛陀在有些經典上又說因果實有。比如《大寶積經》中說：\n\n假使經百劫，所作業不亡，\n因緣會遇時，果報還自受。\n\n其實，這其中的差異並不在因果，而是不同的經典，不同的法會，針對不同的有緣眾生，佛陀分別從真諦和俗諦兩個角度分別解說的。《大品般若經》上說：“菩薩住二諦，為眾生說法，為著有者說空，為著空者說有。”而《維摩詰所說經》雲：“佛以一音演說法，眾生隨類各得解。”不管是佛菩薩根據眾生根器分別從真俗二諦演說佛法，還是佛陀一音說法，而我們眾生因各自的因緣和理解能力所局限，各自從真俗二諦解讀。但是真俗二諦作為佛教最基本的立論原則，佛教徒應該明瞭通達才能通達佛教。《華嚴經》雲：性相佛法及僧伽，二諦融通三昧印。\n\n從佛教教義上說，依佛陀果地講，若人欲了之，三世一切佛，應觀法界性，一切唯心造（《華嚴經》）。但是從眾生因地說，善惡之報，如影隨形，三世因果，迴圈不失（《涅槃經》）。\n\n所以，在因果這個問題上，無論持因果實有還是持因果實無，無疑都落入斷、常二見。虛雲法師雲：佛法是體，世法是用。體是理，是真諦；用是事，是俗諦。要知“二諦圓融三昧印”的道理，不融通就落於偏枯。如離體表用，是凡夫凡情；離事講心，是不明心地。真俗二諦，名目很多，真是體，俗是用；戒定慧體用都得，都是一個心地中生出種種名字，若能融會貫通，則條條大路通長安。\n\n然而有趣的是，現代理論物理學，也在質疑傳統因果理論的真偽，其中最著名的理論就是“時間旅行”理論。而持這種觀點的物理學家中最著名的就是霍金。\n\n霍金認為，時間旅行是可能，並且無處不在的。如果將時間作為第四維，那麼人類至少有三種可行的時間旅行的方式。\n\n但是，這一理論一經提出，立刻引發了理論物理學界的激烈討論。因為這一理論中包含了至少五種悖論，其中最著名的一種，即：“外祖父悖論”：如果你能夠進行時間旅行回到過去，而且回去之後在你的外祖母懷你的母親之前殺死你的外祖父，並娶了你的外祖母，那麼你是誰？\n\n這個著名的悖論，後來被好萊塢著名導演卡梅隆看中，並演繹於其1984年拍攝的經典電影《終結者》中。影片中約翰康納派自己的手下凱爾裏斯回到過去保護自己的母親莎拉•康納，結果，凱爾裏斯愛上了莎拉•康納，並使她懷上了孩子，而這孩子，正是派凱爾裏斯回去保護自己母親的約翰康納。\n\n關於時空旅行的悖論還很多，比如另一個“觀察者效應”的悖論：假如你能回到過去，並且成功改變了歷史，可只有時間旅行者本身知道歷史改變前後有什麼不同。這個矛盾是在於，如果旅行者真的改變了歷史，這對歷史中的其他人有什麼意義呢？假如歷史仍舊依據其固定的劇本演繹，那麼時間旅行者本身又有何存在價值？對於時間旅行者來說，前者沒有任何能證明他自身存在於這個世界上的紀錄，後者沒有任何能證明他自身來源於歷史上的因果記錄。\n\n如果將佛陀和凡夫視作時間旅行中的線性時間的兩端：一切眾生無不來自清淨真如，因妄想執著而成凡夫。而一切諸佛又莫不從無明業海了達一切唯幻，以幻修真而成菩提。那麼，時間旅行中的各種悖論也同樣適用於學佛。從佛果地覺上說，一切有為法如夢幻泡影，何來眾生？從眾生因地行上說，起心動念無不是罪，如何成佛？因此佛教解決這一悖論的方式就是融通：二諦融通三昧印。正如《圓覺經》上說：\n\n善男子，譬如患翳，妄見空華；患翳若除，不可說言：‘此翳已滅，何時更起一切諸翳？’何以故？翳華二法，非相待故。亦如空華滅于空時，不可說言：‘虛空何時更起空華？’何以故？空本無華，非起滅故。生死涅盤同於起滅，妙覺圓照離于華翳。善男子，當知虛空非是暫有，亦非暫無，況複如來圓覺隨順而為虛空平等本性！\n\n佛教教義言說到極致，只能依靠譬喻。如《華嚴經》雲：\n\n如來以一切譬諭，說種種事。無有譬諭，能說此法。何以故？心智路絕！不思議故。諸佛菩薩，但隨眾生心，令其歡喜，為說譬諭。非是究竟。\n\n言語道斷，心智路絕！即便佛陀也無法用人類殘缺的言語同時描述真、俗二諦境界。就如同一個已經登上山頂的先行者，他無法用言語同時描述山頂風光和登山路上的沿途風光，也如同我們在描述一個物體，任何一個人都無法從一個角度準確地觀察並且描述一個物體全部的六個面，而只能在同一個角度看到並描述物體的任意三個面。這是人類的局限性所限制的。而最終登上山頂的路徑唯有三條：第一是依佛陀的精神，探尋登山的道路，披荊斬棘歷經艱險而到達山頂。第二是根據佛陀描述山頂風光，不必登頂而遍覽山頂風光如佛。第三種，唯依佛陀所言說通往山頂的道路，一步一個腳印踩著佛陀的足跡達到山頂。而不能說這三種途徑哪個是真哪個是假，更不能說這三種途徑孰高孰低。\n\n言語道斷，心智路絕！譬喻終歸是譬喻，也只能是譬喻，最終的究竟覺，還要依靠眾生自己的領悟。\n"
		},
		{
			"post_id": 4,
			"title": "華嚴心鏡 · 第二章：平等的本質",
			"date_published": 1485231379.572,
			"body": "![image alt](img/jx3.jpg)\n<div align=\"center\">望雲和尚法照</div>\n當年，佛陀於菩提樹下成道后，說了一句貫穿於佛陀初中後善全部教言的話：奇哉，一切眾生本具如來智慧德相，唯因妄想執著而不能證得。故此，佛陀說法四十九年，八萬四千法門，無一例外，是要破除一切眾生妄想執著而引發貪嗔癡慢疑諸行，自十善業道而入普賢行願，最終成就無上解脫。\n---\n\n佛陀自菩提場中證道后，於三七日中，為海眾雲集的無量大千世界諸菩薩、眾神首說《華嚴經》，以毗盧遮那佛為本起果地，以文殊妙智起信，以普賢妙行起行，以彌勒菩薩為一切眾生本來成佛起證。無一不是引導眾生，同證阿耨多羅三藐三菩提。\n\n故此，佛教是徹底平等的宗教，其平等的理念，貫穿了佛陀信仰的始終。這種平等是終極的平等：一切眾生本來是佛，只是因為被妄想執著所纏縛，而不能證得佛之果報，於六道之中生死流轉，無有出期。故此，修行便有了著力處，即破除因妄想執著而產生的各種苦惱，達到“心無掛礙，無掛礙故無有恐怖，遠離顛倒夢想，究竟涅槃”的佛陀果地。\n\n這種平等性遠離了一切有對的差異，無善無惡，無高無低，無好無壞，無能無所。是無緣大慈同體大悲的發起力，是慈悲喜舍四無量心的根本田。在《圓覺經》中，佛陀如此描述這個層次的平等： 善男子，一切障碍，即究竟觉，得念失念，无非解脱，成法破法，皆名涅盘，智慧愚痴，通为般若，菩萨外道所成就法，同是菩提，无明真如无异境界，诸戒定慧及淫怒痴，俱是梵行。众生国土，同一法性，地狱天宫，皆为净土，有性无性，齐成佛道，一切烦恼，毕竟解脱，法界海慧，照了诸相，犹如虚空，此名如来随顺觉性。\n\n佛陀所言的平等，是一切眾生果地上的平等，而非眾生行業上的平等。這是其中最重要差別，也是與人類其他宗教、哲學中所論述的絕大多數平等理論從根本上不相同的。\n\n《華嚴經-華藏世界品》中，佛陀描述這個世界，是由十重風輪，上持華藏香水海，並華藏世界，其中就包括了我們所存在的這個娑婆世界。而這十重風輪最下一重，即名曰：平等住。如無平等，則一切世界均不能成立。\n\n 但是，在佛陀教法中，果地的平等，並不等同於因地上的平等，或者說，覺性上的眾生平等，並不等同於行持上的眾生平等。故此，方有六道輪迴及諸佛國土、三千大千世界、八萬四千法門等一切差別。《華嚴經》偈云：若人欲了之，三世一切佛，應觀法界性，一切唯心造。\n\n一切法門，三界六道，諸性差別無非是妄想分別執著的那顆心所造作，而其本體，清淨圓明，本無差別。《楞嚴經》佛陀七處征心，阿難遍識各處而找不到自己的本心，本心不在內不在外，清淨無染，本具一切智种。而那顆能識能找的假心，則是本心外障，妄執我有，固有妄想執著。因此，佛陀的教法，便是令人回歸那個不生不滅無垢無對的本心，從而解脫一切有為法、生滅法的纏縛。龍樹菩薩云：不生亦不灭，不常亦不断。不一亦不异，不来亦不出。能说是因缘，善灭诸戏论。\n\n佛陀是真語者，識語者，不妄語者，實真實言也。\n\n幾乎世界上所有宗教都認為分別是人類的原罪。\n\n——佛教（包括印度教等）認為，因為分別，所以眾生流轉生死。\n\n——基督教等（包括天主教、伊斯蘭教、猶太教、東正教等同系宗教）認為，亞當和夏娃是因為吃了分別善惡樹上的果實，而有原罪。\n\n——老子《道德經》說：知不知，尚也。不知知，病也。聖人不病，以其病病。夫為病病，是以不病。\n\n然而，儘管幾乎世界上所有宗教都認為，分別是人類認識世界過程中最大的過失，但分別同時也是哲學意義上，人與其他生物最本質的區別。\n\n人類的認知，不可否認是有局限性的。米蘭昆德拉說：人類一思考，上帝就發笑。人類通過認知，是很難達到真理的。換句話說：人類永遠走在通往真理的路上。而那些自詡掌握了真理的，若不是人類最大的劊子手，便是最無恥的無賴。何況那些掌握宇宙真理的，更是如此。\n\n釋迦摩尼佛在《圓覺經》中，對佛陀果地的平等，與眾生因地的分別，有一段精彩的描述。\n\n佛說：最上成就者有一切真實的覺照，叫做圓覺總持。在這圓覺性中，有一切真實的法體、智慧解脫的法門。所有修行者和成道者，無不依此圓覺法門，永斷無明而最終成佛。無明就像一個迷路的人不知身處何地，以為地、水、火、風（四大）所組成的這個身體就是自己，以為色聲香味觸法（六塵）所投射在本心中的影像就是真實的世界。又像有人患了眼病，看到空中仿佛有花朵或者第二個月亮。事實上，空中並沒有花朵，只是病人因病妄見，並執著於實有。因其執著，不但無法認識到眼前的空，也執迷於眼前的花，因此便有種種因妄執而導致的錯誤判斷於錯誤行為，最終流轉生死。無明並非實有。就像人做夢，夢中時一切都是真實的，受了驚嚇一樣流汗，夢中奔跑也會導致雙腿酸痛，但是一旦醒來，夢中的一切都不見了。又好像有眼病的人，病好之後，眼前的花朵都不見了，但又不能說那花朵滅於虛空，因為它事實上從來沒有出現過。一切眾生在無生中妄執四大六塵為實有，故有生滅心，生滅見，因此說其流轉生死，而事實上本無生死。一切修行成就者，知道眼前的花朵無生無滅，唯因緣合和假成，故此不再隨花起花滅而流轉，繼而不隨生死流轉。不是強迫自己認識無生無死，而是徹底明了本無生死。就像患病的眼睛，因為有眼能看到花，同時也就能看到虛空。因明了虛空，也就知道眼前的花朵是虛幻的，但是，也不能說那個能見花的眼睛是虛幻的。能見的有和虛妄花朵的無都不執著，即是真正領悟了圓覺。就像虛空，本來寂滅不動，修行者所證得的本體無起無滅無生無死無知無識遍滿虛空一切法界。這就是佛陀成佛的修行路徑。\n\n現代物理學有波粒二象性和測不准理論，可謂是顛覆了傳統物理學，甚至可以說顛覆了我們所認知的這個世界。\n\n波粒二象性是說，當一個微小粒子被釋放到一個空間中，它是以波的形式存在的。但是奇怪的是，當觀察者用儀器去觀測它時，它馬上呈粒子的狀態。物理学家格里宾这样描述：我们称之为真实的任何东西都是由不真实的东西所构成。在亚原子粒子诸如电子和质子的层次上，物体在未被观测时的确并不“真实”存在，以至于我们会恍惚地怀疑，一棵树或一间房子在没人看他时是否还真实的存在。\n\n測不准原理是說：微小粒子被釋放到一個空間中，從空間的a端到b端，該粒子在所有可能的路徑上同時出現。而最終出現的路徑，同樣決定於觀察者所觀察的路徑。這一現象，可謂是徹底顛覆了人類對時間和空間的認識。比如，你可以將其想象為人類的歷史，如果人類歷史所有可能性組成一個集合，而實際上的歷史路徑，唯取決你如何去認識它。由此實驗而引發了一門新的科學概念，即平行宇宙概念。同時還引發了各種穿越小說大爆棚。\n\n其實，佛陀所描述的真如，便和現代物理學中統一場是頗有些類似的。統一場（引力場、磁力場、強力場和弱力場統一）在理論物理中是確然存在的，但卻是不可證的。愛因斯坦耗費40年光陰未畢其工，身殘志堅的霍金如今拾起衣缽，謀求更有建樹，而今前景仍然暗淡。\n\n統一場的確然存在，即可以想象為圓覺總持的確然存在，而人類利用科學手段去認識它的存在，就好像是人的分別心在起作用，以分別心去認識真如，便是南轅北轍，反過來若以真如馭萬法，便是轉識成智妙用無限了。《圓覺經》說：若以輪回心，思維即旋復。但至輪迴際，不能入佛海。\n\n故此，佛教認為，人若成佛，必須經過信解行證四個階段，四個階段中，信是首位，如《華嚴經》所說：信為道源功德母。因為以人的局限性認知，是不可能從邏輯上推導和求證出真實的佛性，首先必須通過佛陀展示的果地而起信，之後再通過深入經藏，理解佛陀所教修行的理論，在徹底解了修行路徑后，依解起修行菩提道，最終證得佛地。\n\n既然人有其認知上和物理上的局限性，那麼完美的佛陀，又是怎樣的呢？\n\n《華嚴經》中，描繪了佛陀初成道時所展現的至尊境界：\n\n尔时，世尊处于此座，于一切法成最正觉，智入三世悉皆平等，其身充满一切世间，其音普顺十方国土。譬如虚空具含众像，于诸境界无所分别；又如虚空普遍一切，于诸国土平等随入。身恒遍坐一切道场，菩萨众中威光赫奕，如日轮出，照明世界。三世所行，众福大海，悉已清净，而恒示生诸佛国土。无边色相，圆满光明，遍周法界，等无差别；演一切法，如布大云。一一毛端，悉能容受一切世界而无障碍，各现无量神通之力，教化调伏一切众生；身遍十方而无来往，智入诸相，了法空寂。三世诸佛所有神变，于光明中靡不咸睹；一切佛土不思议劫所有庄严，悉令显现。\n\n在這一段中，經文從體、相兩個方面，闡述了佛陀的五大神通。\n\n第一大神通，從體的方面“智入三世悉皆平等”，從相的方面“三世所行，众福大海，悉已清净，而恒示生诸佛国土。”\n\n三世，指的是過去、現在、未來。平等，說的是佛陀的一切均平等法施，無“我人眾生壽者”的差別。因此，佛陀在過、現、未來三世所有一切行持希皆清淨，具無上福德。但是，佛陀並不因此而停止大悲願力，仍舊不斷示現於諸佛國土，拔濟群迷，拯救眾生。\n\n第二大神通，從體的方面“其身充满一切世间”，從相的方面“无边色相，圆满光明，遍周法界，等无差别”。\n\n佛有三身，叫做法、報、化。我們一般所說的娑婆教主釋迦摩尼佛，便是佛的化身之一。其實，佛陀為度化眾生，為一切眾生都能離苦得樂，在無量無邊世界化現無量無邊諸佛、菩薩、天龍八部、人非人等。比如我們常說的觀世音菩薩，即是過去正法明如來所化現。釋迦摩尼佛更是千百億化身。大藏經中有一部很短小的經典，叫做《佛說如來獅子吼經》。這部經講的是，一天佛陀對勝積菩薩說，你去北方六千億恆河沙等世界，然後再過百千億算數世界外，有一個叫做歡喜的世界，這個世界有一尊佛叫做法上如來。法上如來現在正在說獅子吼經，這部經非常殊勝，你去聽聞求法。\n\n勝積菩薩領旨前往，經過和法上如來一段非常具有禪意的對話後，法上如來開始宣講獅子吼法門。這獅子吼法門其實只有一句話，即：娑婆世界釋迦摩尼佛，即我今法上如來為利樂一切眾生而化現說法。\n\n一個遙遠的佛說了一個殊勝的法門叫做大獅子吼，內容是說另一個遙遠的釋迦摩尼佛是我所化現的，這讓很多人看來似乎匪夷所思，但事實上確實如此，因為這正是佛，還包括所有八地以上菩薩最重要的神通力之一。而且，他們不但能化佛，化菩薩，甚至於可以化現任何一種物質，所謂眾生當以什麼身得度，便現什麼身而為說法。這便是佛陀化身，遍佈一切三千大千世界而普轉法輪。\n\n法身佛是毗盧遮那佛，也就是能化現諸佛菩薩的本體。在哲学上，毗卢遮那佛就是“一即一切，一切即一”的一，是清净本体，万法源头。毗卢遮那的意思是“大光明遍照”，如同太阳高升，能破除一切黑暗，因此在藏传佛教中，又称“大日如来”。\n\n清净法身毗卢遮那佛所在的国土，称为常寂光土，内涵是光明无尽的虚空。法身佛无处不在又无形无相，非善非恶也非对错，甚至不是光明也不是黑暗，是远离一切二元论的清净本体。唐代高僧百丈怀海禅师说：灵光独耀，迥脱根尘，体露真常，不拘文字。心性无染，本自真诚，但离妄缘，即如如佛。\n\n老子《道德经》开篇即说：道可道非常道，名可名，非常名。无名天地之始，有名万物之母。道冲而用之或不盈，渊兮似万物之宗。挫其锐，解其纷，和其光，同其尘，湛兮似若存。描述的也是宇宙本體的一種境界。\n\n此外，還有報身佛。是佛菩萨修行菩萨道，普度众生所成就的功德依正受报。《佛说无量寿经》和《观无量寿佛经》中，释迦摩尼佛所描述的阿弥陀佛净土，即是阿弥陀佛的报身土。报身佛都会现三十二相八十种随形好，以庄严其身。不同的报身佛因其发愿不同，修证的法门不同，其报身土有所不同。比如阿弥陀佛发愿是，当他成佛时，要接引所有信愿称名的众生，到他的极乐世界去修行，因为其国土极乐，没有任何染杂，也没有任何阻碍修行的事物存在，一切饮食衣物和欲望，都能随愿满足，所以没有任何争斗和诱惑，也没有任何造作恶业的机会。因此，称名往生极乐国土的众生，都能在那里很快成佛。\n\n而释迦摩尼佛在修菩萨道时发愿，是建立一个令耽著爱欲，罪业深重的众生都能离苦得乐的世界，使其能够根据苦集灭道四圣谛而解了世界的本质，最终成佛。因此，释迦摩尼佛所成就的报土，就是我们今天所在的娑婆世界的样子。\n\n《维摩诘所说经》中记载了这样一个故事。有一天，佛陀在毗耶离庵罗树园讲法，舍利弗一边听一边心里打起了小九九。都说菩萨心里清净，成就的国土就清净平整。我皈依的这位释迦摩尼佛是不是当菩萨时心里不清净，所以成佛之后的国土如此之不清静？到处沟沟坎坎、高山峡谷、垃圾遍地、枯树杂草。你再看看人家佛陀的世界，七重栏楯七重罗网七重宝树周匝围绕。金沙铺地平整柔软，国土遍布七宝（金银琉璃玛瑙赤珠等宝）池，池中充满八功德水，长着美丽圣洁的莲花，连池边栏杆都是各种宝贝做成的，宫殿在各种珍宝装饰下格外璀璨，甚至连鸟叫声都是念佛声。大家都是佛陀，为什么咱这儿就这么粗不堪言呢？佛陀知道舍利弗在想什么，于是就对他说：日月难道不清净吗？日月有想让谁看到不想让谁看到吗？它对看者有分别吗？舍利弗说：没有。那为什么盲人看不到呢？佛陀反问道。舍利弗回答说：那是因为盲人眼睛生病无法看到，不是日月的问题。于是，佛陀告诉舍利弗：就像日月一样，由于众生罪孽深重，因此无法见到佛陀国土严净。这个时候，有个名为螺髻的梵天王插嘴对舍利弗说：舍利弗啊，我见此释迦摩尼佛土清净得像我的自在天宫。舍利弗反驳说：我就是看这片土地肮脏不堪，高低不平。梵天王说：那是你人品问题！佛陀一看，这是要打架的节奏啊。于是，佛以足指按地，这个娑婆世界一下子变得严净整洁，众宝庄严，所有众生都能看到自己坐于莲花座上，与佛菩萨无异。舍利弗看罢，立马儿服了，说：今天才看到佛国土严净。佛告舍利弗：我的国土一向严净，是因眾生罪障，故此示现不净。如果众生心净，便可以看到我的国土清净。\n\n在《悲华经》中，寂意菩萨也曾询问过释迦牟尼佛同样的问题，佛陀这样回答说：“善男子！菩萨摩诃萨以本愿故取净妙国，亦以愿故取不净土。何以故？善男子！菩萨摩诃萨成就大悲故，取斯弊恶不净土耳。是故吾以本愿，处此不净秽恶世界，成阿耨多罗三藐三菩提。”\n\n佛的“其身遍滿”神通，便是指佛的法身、化身遍滿一切虛空。而佛的報身也同樣遍滿一切虛空，只取決於眾生能否看到。\n\n佛陀第三大神通，從體上“其音普顺十方国土”，從相上“演一切法，如布大云。”\n\n佛陀音聲遍滿法界，眾生聞者隨類各解，各有所證。就像這部《華嚴經》，佛陀成道後21天所說，本有上中下三部，由文殊菩薩與阿難在鐵圍山中結集，結集之後便藏於龍宮了。直到龍樹菩薩出世，到龍宮中查看，这部《大方广佛华严经》的上中下三部，分别对应众生的上中下三根。上部是上根性众生听闻和集结的，有十三千大千世界微尘数偈（偈是印度韵文的计算单位，一偈为一韵句），一四天下微尘数品（大致是将四个地球碎为微尘，所有微尘数那么多）。中部是中等根性的众生听闻集结的，有四十九万八千八百偈，一千二百品。下部只有十万偈，四十八品。为什么有这样的差别呢？因为上根性的人更有智慧，佛以一音演说，他能举一反三，甚至举一反千，多少世界微尘数偈就是无量无边的意思。中等根性的人，能够如实听到佛陀的每一个字，而下等根性的人，佛陀说一万字，他能听明白三分之一就不错了，所以三部各有不同。龙树菩萨一看，上部和中部太大了，人间也装不下，就算装下了，也没人看的完。于是就把下部拿回来了。所以說，佛陀以一音演說菩提妙法，不同根性的人，所得到的理解和覺受也是完全不同的。\n\n第四大神通，從體的方面“譬如虚空具含众像，于诸境界无所分别；又如虚空普遍一切，于诸国土平等随入。”從相的方面“一一毛端，悉能容受一切世界而无障碍，各现无量神通之力，教化调伏一切众生；身遍十方而无来往，智入诸相，了法空寂。”\n\n這一神通是從出、入兩方面來說，從出的方面說是佛陀性德普含一切法界，從入的方面說是佛能在一切法界隨心化現普度眾生。這兩方面缺一不可。\n\n佛陀這一神通，就是近來被科學界廣泛關注的因陀羅網境界，也被稱為帝網境界。\n\n《丁保福佛学大辞典》中引述通路记解释说：“忉利天王帝释宫殿，张网覆上，悬网饰殿。彼网皆以宝珠作之，每目悬珠，光明赫赫，照烛明朗。珠玉无量，出算数表。网珠玲玲，各现珠影。一珠之中，现诸珠影。珠珠皆尔，互相影现。无所隐覆，了了分明。相貌朗然，此是一重。各各影现珠中，所现一切珠影，亦现诸珠影像形体，此是二重。各各影现，二重所现珠影之中，亦现一切。所悬珠影，乃至如是。天帝所感，宫殿网珠，如是交映，重重影现，隐映互彰，重重无尽。” \n\n帝网一般用来代指因陀罗网，我認為，帝網只是是简单被动的因陀罗网。《華嚴經》善财童子五十三參中，在弥勒菩萨自在天宫所见的因陀罗网重重无尽的阁楼，可能被帝释天看到了，之后就想在自己的天宫中也弄一个，但是帝释天的功力不够，没有办法凭空地造出如此主动的层层无尽。于是，他想出了一个妙法，将无数摩尼宝珠装饰在自己的天宫房顶上，这样每颗摩尼宝珠相互映彻，则能生成一个被动的层层无尽的因陀罗网。也不知道他向弥勒菩萨支付了专利费没有。\n\n这张山寨的因陀罗网，除了无法实现处于任何一个佛菩萨法会中听法，都能同时身处所有佛菩萨法会中听法，并且每一法会中佛菩萨所说诸法都能令听者分别领受这一功能外，其它功能倒是都能实现。所以我觉得帝网不过是因陀罗网的模型，就如同我们在手机店里看到的手机模型一样，除了不能打电话，其外在形象倒是一应俱全。根据《宋高僧传》记载，法藏法师根据山寨的帝网，也做了一个山寨的镜网，用十面大镜子，八方各置一面，上下各置一面。每个镜子相距一丈。在中央摆放一尊佛像，像前放置一个大油灯。然后让不能理解因陀罗网的学生进去，以体会因陀罗网的含义。在一般的佛教论述中，往往帝网与因陀罗网混用，也没有看到有指出帝网与因陀罗网不同的说明，因此在这里稍微提示一下。我个人认为，帝网是不能完全等同于因陀罗网的。因陀罗网是主动的，能同时映彻本体和现象，而帝网却是被动的，只有在现象之间实现相互映彻的能力。  \n\n在《華嚴金獅子章》中，法藏法師以皇宮里的一座金獅子為比喻，給武則天講解因陀羅網的含義，他說：狮子眼耳肢节，一一毛处，各有金狮子；一一毛处狮子，同时顿入一毛中。一一毛中，皆有无边狮子；又复一一毛，带此无边狮子，还入一毛中。如是重重无尽，犹天帝网珠，名因陀罗网境界门。\n\n法藏法师用金狮子作比喻，现象世界中每一个现象都是本体的完整显现，本体包含一切现象，所以每一个现象也包含了其它的一切现象。更深一层，这一现象不仅仅包含了一切现象，同时还包含了它所包含的一切现象所包含的一切现象。同样，其它任何一个现象中所包含的一切现象，也各各包含了一切现象。現代科學中的全息理論、信息場理論、量子力學統一場理論和熱力學理論中，都對因陀羅網境界發生了廣泛的興趣，因此，因陀羅網這個佛教專有名詞，如今也成了時髦的科學名詞。\n\n佛陀的前四大神通，其實八地以上菩薩也能做到，而唯有這第五大神通，是與諸菩薩眾所不共的。從體上說“身恒遍坐一切道场，菩萨众中威光赫奕，如日轮出，照明世界”。從相上說“三世诸佛所有神变，于光明中靡不咸睹；一切佛土不思议劫所有庄严，悉令显现”。\n\n這一神通是說佛陀光出世間一切眾生菩薩。\n\n就像用紅外探測儀觀察一切眾生，所有的生命體都是能夠發光的，如果用磁力場探測儀，則能夠分析出不同眾生的光譜。不同眾生光譜和光輻射量不同，其個人能量也不同。美國科學家大偉-霍金斯曾經做過一系列這方面的測量，並且開創了一門意識能量的學說。他將測量出的人體能量分成17個級別，能量級在200以下，有八個層級，這些層級的生命多顯現消極怯弱的一面，從羞恥蔑視到驕傲刻薄。從能量級200起的生命體，則展現出積極向上的一面，從勇敢肯定開始，直到能量級為1000的開悟正覺。在霍金斯的臨床研究中（值得注意的是，霍金斯不僅是名教授，同時還是臨床心理醫生，西方的學術教研體系與中國完全不可同日而語），檢測到的最高級別意識能量，是獲得諾貝爾和平獎的特蕾莎修女，能量值達到700。而超過700到達1000的能量級的人，在他的推斷中只有耶穌、佛陀和老子。\n\n目前，我在大陸還沒有找到霍金斯的相關著作，只能找到一些零散的介紹性文章。也是，一個崇拜唯物主義，崇拜臘肉的國家，怎麼能夠允許這種研究存在呢？萬一哪一天霍金斯檢測下那塊被他們頂禮膜拜的臘肉，發現其能量值為負，那該讓包子們多麼尷尬啊。"
		},
		{
			"post_id": 3,
			"title": "華嚴心鏡 · 第一章：一與多的局限",
			"date_published": 1485231288.217,
			"body": "![image alt](img/jx2.jpg)\n第一次在九僊禪寺誦讀華嚴經，是在2014年10月。到小廟當天，便聽望雲師講支提山天冠菩薩道場的殊勝因緣，好在望雲師藏書極厚，又披瀝相關志書多種，方全窺此九僊禪寺的妙處。繼而看到他收藏的一套浙江香海禪寺倡印的《大方廣佛華嚴經》，印刷極其精美，而且有拼音標註。倡印這部大經的香海禪寺住持賢崇法師，上世紀八十年代在支提山華嚴寺上妙下果老和尚座下落髮，而望雲師曾是妙老的侍者。因此，望雲師和賢崇師之間有同師之誼，這才有收藏這部價值不菲、印刷精良、限量結緣的上乘珍藏版的因緣，也才有我誦讀《華嚴經》的殊勝緣起。\n---\n\n我在學佛修行中，很喜歡誦讀經典。一般常見較短的經文我基本上都誦讀過，較長的如《楞嚴經》、《法華經》、《維摩詰所說經》也有誦讀的經驗。但是近七十萬字的大經，還是第一次誦讀。\n\n誦讀經典的覺受很難用言語來表達。我這個人很隨性，對各種新鮮的事物都很感興趣，所以導致內心雜亂吧，因此，經常用讀經的方式攝心，將自己散亂狂野的心，用佛陀的經典或者佛號攝回到佛陀的正道上來。誦經時，口中發聲再從耳根迴入自心，整個人一下子就清淨了很多，仿佛受到諸佛菩薩的強大加持。再加上放聲誦讀經典，可以自利外，還可以利益無量無邊眾生。望雲和尚非常慈悲，開許我每天在大殿誦讀，這種莊嚴清淨的感受，猶如醍醐灌頂，常有靈光閃現。第一次誦讀只誦到《入法界品》的三分之一處，因家中有事，便只能暫停了。回京處理了一些事情，又去廣州料理武館的事。好在誦經前的發願文沒有剋期，所以當時就想，在九僊禪寺留下這麼個因緣也好，將來有時間因緣具足時再續上。\n\n沒想到因緣這麼快就來了，武館的事情出了點麻煩，我再次回到望雲師的小廟，開始繼續誦讀《華嚴》。\n\n初次誦讀，每天只能誦讀四五品的樣子，大約一共讀了二十天。最後數品讀完後，我立刻發心再剋期誦讀一遍，並寫了發願文。\n\n“ 愚自束发以来，蒙上能下行法师授受三皈。以求出脱轮回，普度众生。及至弱冠，恰逢学生民主运动，得闻宪政人权民主自由为持百年盛世之圭旨，与佛教之清净平等觉有情相应不二也。故知追求宪政即为戒贪，追求民主即为戒嗔，追求人权即为戒痴，追求自由即为戒慢，于此追求，志不疑惑。\n\n日前遭帝都租住地警方驱赶，蒙宁德九仙禅寺之上性下慧法师之邀，暂住宝刹，得闻九仙禅寺所在之支提山，为天冠菩萨道场，昔元表法师云游至此，于岩上唱诵华严大经，感天动地，常放金光。时值五代吴越国主听闻异事，命慧平，慧泽二僧前往。自此支提山佛法宏开。九仙禅寺所在之九仙峰，唐高僧本凈和尚常住于此。又得见性慧法师珍藏八十华严一部，甚是喜爱。因缘和合，故发愿读诵《华严经》，并愿得佛般若智慧，饶益有情，以醒国人之智，共除红魔邪教。使宪政人权民主自由之光行于震旦，令众生皆至清净，平等之觉地。并以此回向震旦众生，及狱中诸友，身体安康，调适百宜，早日挣脱樊笼。共令红魔邪教于我中华大地彻底摧毁尔。\n\n自双十国庆后，每日勤诵。愿诸佛菩萨，天龙八部，护法诸神及闻者慈悲加持。伽蓝圣众护持道场，九仙禅寺法脉弘扬，接引十方。后学德强谨誓。  ”\n\n華嚴稱經王，是因為這部經內容完備。經中開篇即全彰一真法界，由法身佛毗盧遮那如來開顯，依正莊嚴華藏世界。文殊菩薩與普賢菩薩領無量無邊各個世界大菩薩眾，依次講述成佛的次第，從十信、十住、十行、十迴向、十地直到成佛。而後，再由善財童子遍參五十三位善知識，一一證得諸解脫法，等同佛智，一生補處。\n\n這部大經，是釋迦摩尼佛成佛后初在阿蘭若法菩提場中始說，繼而升座忉利天、夜摩天，兜率天、他化自在天等處，分別對菩薩摩訶薩、天龍八部等有緣眾生所講。因此這部經最開始並沒有在人間流通，而是由文殊菩薩和阿難等在鐵圍山間集結成經后，就放在龍宮了，直到龍樹菩薩出世。\n\n龍樹菩薩因緣殊勝，年輕時就通達了眾多經典。經讀多了，就有一點點我慢心升起，覺得這個世界上沒有誰讀經能讀到我這麼多的。龍王看出了龍樹菩薩的我慢，便說，才看了這麼一點書，就貢高我慢，我有一部經書就夠你讀無數世的，你信不信？龍樹菩薩一聽，不可能。無圖無真相，有本事你帶我去看看。\n\n龍王也想趁機顯擺顯擺自己家的藏書，就帶龍樹菩薩回龍宮去看。龍樹一看不要緊，嚇呆了。這部《大方廣佛華嚴經》分上中下三部，分別對應眾生的上中下三根。上部是上根性眾生聽聞和集結的，有十三千大千世界微塵數偈（偈是印度韻文的計算單位，一偈為一韻句），一四天下微塵數品（大致是將四個地球碎為微塵，所有微塵數那麼多）。中部是中等根性的眾生聽聞集結的，有四十九萬八千八百偈，一千二百品。下部只有十萬偈，四十八品。為什麼有這樣的差別呢？因為上根性的人更有智慧，佛以一音演說，他能舉一反三，甚至舉一反千，多少世界微塵數偈就是無量無邊的意思。中等根性的人，能夠如實聽到佛陀的每一個字，而下等根性的人，佛陀說一萬字，他能聽明白三分之一就不錯了，所以三部各有不同。龍樹菩薩一看，上部和中部太大了，人間也裝不下，就算裝下了，也沒人看的完。於是就把下部拿回來了。\n\n龍王很鬱悶：我就是想顯擺一下，沒說要送給你啊。所以啊，有好東西在懂行的人面前顯擺，是件很危險的事情。要麼顯擺砸了，東西不好，遭人恥笑。要麼顯擺成功了，東西沒了。\n\n龍樹菩薩將這一部《華嚴經》帶回人間之後，又經歷了三、四百年的光景，由於印度潮濕，貝葉經不好保存，脫失腐爛等等因素，到唐代武則天迎請的時候，只剩下四萬五千偈，三十九品。這已經是最完備的一個版本了。而梵文原本保存下來的只有《入法界品》和《十地品》，目前上座部佛教還在日常持誦。\n\n因為這部經是講一真法界，所以，非有緣人是聽不到，看不到的。《華嚴經·入法界品第一》中說：\n\n“ 于时，上首诸大声闻──舍利弗、大目揵连、摩诃迦叶、离婆多、须菩提、阿（上少下免）楼驮、难陀、劫宾那、迦旃延、富楼那等诸大声闻，在逝多林皆悉不见如来神力、如来严好、如来境界、如来游戏、如来神变、如来尊胜、如来妙行、如来威德、如来住持、如来净刹，亦复不见不可思议菩萨境界、菩萨大会、菩萨普入、菩萨普至、菩萨普诣、菩萨神变、菩萨游戏、菩萨眷属、菩萨方所、菩萨庄严师子座、菩萨宫殿、菩萨住处、菩萨所入三昧自在、菩萨观察、菩萨频申、菩萨勇猛、菩萨供养、菩萨受记、菩萨成熟、菩萨勇健、菩萨法身清净、菩萨智身圆满、菩萨愿身示现、菩萨色身成就、菩萨诸相具足清净、菩萨常光众色庄严、菩萨放大光网、菩萨起变化云、菩萨身遍十方、菩萨诸行圆满。如是等事，一切声闻诸大弟子皆悉不见。 ”\n\n為什麼這些平常一直跟隨佛陀學習的大弟子們，卻都看不到佛陀講法，諸菩薩眾聽法呢？這是因為他們沒有證得佛菩薩的證量。\n\n比如，我們這個世界上，無論任何人，在任何一個角度上，看任何一個物體，都只能看到它二分之一的面。比如說一個正方體，我們最多就只能看到它的三個面，並且經常主觀地認為，這三個面就已經是這個正方體的全部了。但是如果你在物體的背面立一面鏡子，你就會發現，這個物體背後還有兩個面，如果這個物體是放在一塊玻璃上，玻璃下面再安放一塊鏡子，你才能發現這物體還有一個面。用鏡子就好比佛菩薩的智慧，墊玻璃就好比佛菩薩的方便。方便智慧具足的條件下，你才能看到事物的全部。而普通人不具備這種方便智慧時，自然看不到佛陀的世界。\n\n當然，這只是打個比方，並不是佛菩薩真正看到的世界，而只是我們藉著佛菩薩的方便智慧，經過佛菩薩的加持，佛教典籍的研習以及跟隨住持和傳承佛陀所教授的修行儀軌的僧寶進行修證所證得的對世界較初級的認識。因為無論是玻璃還是鏡子，還都有擺放的角度問題，與六面體的實質還有誤差。而佛菩薩已經證得同體無礙，遂所趣入的境地，在他覺受某一實物的時候，他就是這個實物本身。他不但可以準確無誤地了解這個實物的六個面，還可以深入事物的內部，了解每一個原子、分子、電子、夸克、希格斯玻色子的各個層面和組織結構，以及它們各自的過去現在未來。這就是我們與佛陀所感知的世界的差別，我們感知的是世界的兩維三維最多四維，而佛陀感知的是四維上下和去來現在。也就是說，佛陀的真理是全息，是本質，是完整。而人的認知只是片面，部分和當下某個角度所能夠看到的。這是由人的局限性造成的。\n\n一般人大多都聽說過一些佛陀的名號，比如釋迦摩尼佛、阿彌陀佛、藥師佛、彌勒佛等等。事實上，深入經典，佛陀的意義並不是如此簡單。佛陀有五身，所謂橫三身，豎三世。橫三身表示佛的體、相、用：即法身毗盧遮那佛、報身盧舍那佛、化身釋迦摩尼佛。豎三世表示佛的時間概念：即過去燃燈佛、現在釋迦摩尼佛、未來彌勒佛。用五身表示佛陀，其意義在於表達佛陀無處不在，無所不在和無時不在的內涵。因此，能夠認識並且體悟佛陀的五身，才能真正稱得上是認識佛陀。\n\n毗盧遮那佛，是釋迦摩尼佛的法身，也是一切佛菩薩的法身。我們在寺院中所見到的一切佛菩薩形象，其本體都來源於毗盧遮那佛。在哲學上，毗盧遮那佛就是“一即一切”的一，是清淨本體，萬法源頭。毗盧遮那的意思是“大光明遍照”，如同太陽高升，能破除一切黑暗，因此在藏傳佛教中，又稱“大日如來”。\n\n清淨法身毗盧遮那佛所在的國土，稱為常寂光土，內涵是光明無盡的虛空。法身佛無處不在又無形無相，非善非惡也非對錯，甚至不是光明也不是黑暗，是遠離一切二元論的清淨本體。唐代高僧百丈懷海禪師說：靈光獨耀，迥脫根塵，體露真常，不拘文字。心性無染，本自真誠，但離妄緣，即如如佛。\n\n老子《道德經》開篇即說：道可道非常道，名可名，非常名。無名天地之始，有名萬物之母。道沖而用之或不盈，淵兮似萬物之宗。挫其銳，解其紛，和其光，同其塵，湛兮似若存。\n\n《華嚴經·世主妙嚴品》描述道：爾時世尊處於此座，於一切法，成最正覺。智入三世，希皆平等；其身充滿一切世間，其心普順十方國土。譬如虛空具含眾相，於諸境界無所分別；又如虛空普遍一切，於諸國土，平等隨入。身遍十方而無來往，智入諸相，了法空寂。\n\n兩千五百多年前，中國和印度兩位聖哲都在追問真理的路上達到不即兩邊不離有無的境界。\n\n盧舍那佛，是佛陀的報身。是佛菩薩修行菩薩道，普度眾生所成就的功德依正受報。《佛說無量壽經》和《觀無量壽佛經》中，釋迦摩尼佛所描述的阿彌陀佛淨土，即是阿彌陀佛的報身土。報身佛都會現三十二相八十种隨形好，以莊嚴其身。不同的報身佛因其發願不同，修證的法門不同，其報身土有所不同。比如阿彌陀佛發願是，當他成佛時，要接引所有信願稱名的眾生，到他的極樂世界去修行，因為其國土極樂，沒有任何雜緣，也沒有任何阻礙修行的事物存在，一切飲食衣物和慾望，都能隨願滿足，所以沒有任何爭鬥和誘惑，也沒有任何造作惡業的機會。因此上，稱名往生極樂國土的眾生，都能在那裡很快成佛。\n\n而釋迦摩尼佛在修菩薩道時發願，是建立一個令眾生都能離苦得樂的世界，這個世界修行的眾生，都能夠根據苦集滅道四聖諦而解了世界的本質，最終成佛。因此，釋迦摩尼佛所成就的報土，就是我們今天所在的娑婆世界的樣子。\n\n《維摩詰所說經》中記載了這樣一個故事。有一天，佛陀在毗耶離菴羅樹園講法，舍利弗一邊聽一邊心裡打起了小九九。都說菩薩心裡清淨，成就的國土就清淨平整。我皈依的這位釋迦摩尼佛是不是當菩薩時心裡不清淨，所以成佛之後的國土如此之不清靜？到處溝溝坎坎、高山峽谷、垃圾遍地、枯樹雜草。你再看看人家佛陀的世界，七重欄楯七重羅網七重寶樹周匝圍繞。金沙鋪地平整柔軟，國土遍佈七寶（金銀琉璃瑪瑙赤珠等寶）池，池中充滿八功德水，長著美麗聖潔的蓮花，連池邊欄杆都是各種寶貝做成的，宮殿在各種珍寶裝飾下格外璀璨，甚至連鳥叫聲都是念佛聲。大家都是佛陀，為什麼咱這兒就這麼粗不堪言呢？佛陀知道舍利弗在想什麼，於是就對他說：日月難道不清淨嗎？難道日月有想讓誰看到不想讓誰看到嗎？它對看者有分別嗎？舍利弗說：沒有。那為什麼盲人看不到呢？佛陀反問道。舍利弗回答說：那是盲人眼睛生病無法看到的問題，不是日月的問題。於是，佛陀告訴舍利弗：就像日月的問題一樣，由於眾生罪孽深重，因此無法見到佛陀國土嚴淨，這不是我的問題。這個時候，有個名為螺髻的梵天王插嘴對舍利弗說：舍利弗啊，我見此釋迦摩尼佛土清淨的像我的自在天宮。舍利弗反駁說：我就是看這片土地骯髒不堪，高低不平。梵天王說：那是你人品問題！佛陀一看，這是要打架的節奏啊。於是，釋迦摩尼佛以足指按地，這個娑婆世界一下子變得嚴淨整潔，眾寶莊嚴，所有眾生都能看到，甚至都能看見自己坐於蓮花座上，與佛菩薩無異。舍利弗看罷，立馬兒服了，說：今天才看到佛國土嚴淨。佛告舍利弗：我的國土一向嚴淨，但是為了度眾生的原因，故此示現不淨。就像天人所用的食器，會根據不同天人福德，會自動生出不同飲食。所以舍利弗，如果眾生心淨，便可以看到我的國土清淨。\n\n釋迦摩尼佛是佛陀化身，為接引眾生而示現佛身。事實上，釋迦摩尼佛並不僅僅是示現佛身，也會示現菩薩身、國王身、龍身、眾生身等各種身。眾生應以什麼身得度，佛陀便會示現什麼身而為其講法，令他證入菩提，了脫生死直至成佛。因此釋迦摩尼佛又稱“千百億化身”。另外，除了佛陀以外，菩薩也會隨應示現佛身、菩薩身、國王身、龍身、眾生身等。因為佛菩薩都以無緣大慈同體大悲教化眾生離苦得樂，受記成佛。因此上，讀者們要小心了，也許每天跟你同床共枕的那一半，就是佛菩薩化身來度化你的，可要記得對他（她）好一點。\n\n但是，佛菩薩化身這麼多，豈不日常中見到每一個人都要當佛菩薩看待？當然不用。常懷謙下之心肯定是對的，《聖經》上說：謙虛的人有福，因為天堂是他們的。老子也說：謙下得高尚。《周易·謙》曰：謙尊而光，卑而不可逾，君子之終也。幾乎所有人類輝煌的文明，都讚揚謙虛的品格。但是，你要是見一個人就認為是佛菩薩化身，上去就要拉著人家給人家磕三個頭，那就是神經病了。\n\n不過，釋迦摩尼佛在《金剛經》中，為須菩提講述了佛菩薩化身度人的標準，以免得大家馬路上亂認佛菩薩帶來的尷尬。佛說，應無所住而生其心。不住色聲香味觸法生心。不住我、人、眾生、壽者生心。也就是說，佛菩薩為眾生說法，或者勸導眾生的時候，沒有分別心、沒有企圖心、沒有高下我慢心、沒有利益心。如果你的身邊有這樣的朋友，時常願意以這樣的態度勸導你，那麼你真的要珍惜了，不管那是否佛菩薩化現，但肯定是你值得一生交往的真朋友。\n\n過去現在未來三世佛，是表一切諸佛在時間上出入無礙。諸佛體性無二，本不存在過去現在未來的問題。佛陀又稱如來，是表述無來無去若來若去如是而來如是而去的內涵。過去燃燈古佛現在釋迦摩尼佛當來下生彌勒佛，本就是一體，根據眾生根性示現不同化身，以度化眾生。\n\n從哲學上講，時間也不是宇宙固有的元素，而是通過人類的認知，製造出來的一個尺度。從目前天體物理學的研究結果上看，我們只能假定這個宇宙有一個爆炸原點，但又無法證明。因此可以說，宇宙沒有開始也沒有結束。沒有開始，也沒有結束，也就表示沒有時間。\n\n《大方廣圓覺修多羅了義經》也是佛陀法身在常寂光土為諸位菩薩所說的經典，在這部經典中，佛陀因為說法的對象是諸菩薩眾，連天龍八部都沒有參加，因此上不需要拐彎抹角打比方舉例子，而是用直截了當的語言，說：\n\n“覺圓明故，顯心清淨；心清淨故，見塵清淨。見清淨故，眼根清淨；根清淨故，眼識清淨。識清淨故，聞塵清淨；聞清淨故，耳根清淨，根清淨故，耳識清淨。識清淨故，覺塵清淨。如是乃至鼻舌身意亦復如是。善男子！根清淨故色塵清淨，色清淨故，聲塵清淨，如是乃至香味觸法亦復如是。善男子，六塵清淨故，地大清淨；地清淨故，水大清淨；火大風大亦復如是……善男子！一切實相性清淨故，一身清淨，一身清淨故，多身清淨；多身清淨故，如是乃至十方眾生園覺清淨。善男子，一世界清淨故多世界清淨；多世界清淨故，如是乃至盡於虛空，圓裹三世，一切平等，清淨不動。”\n\n在這段經文中，佛陀講了如何獲得圓滿的清淨心，可觀佛土清淨，並可現清淨佛土的次第。其最根本的基礎就是：覺圓明。所謂覺圓明，就是證得一真法界。那麼，什麼是一真法界？眾生能夠證得一真法界嗎？\n\n傳說古希臘有個脾氣很怪的哲學家戴奧基尼斯。這個邋遢的老傢伙酷愛讀書和陽光。為了二者兼得，他便住在廣場的一個陶桶里。平生除了書以外，只有一件斗篷，一根手杖和每日必不可少的麵包。亞歷山大王得知戴奧基尼斯的名聲，為了顯示自己的慈悲跟寬厚，特意帶著大量的隨從去廣場看望他，來到戴奧基尼斯所居住的桶前，亞歷山大問到：“我能為您做些什麼嗎？”戴奧基尼斯頭也不抬的回答說：“能。你可以站的遠一些，別擋住我的陽光。”亞歷山大愕然，轉身對自己的隨從說：“如果我不是亞歷山大，就應該成為戴奧基尼斯。”\n\n還有個關於戴奧基尼斯的故事，是講有一天，一個年輕人來到戴奧基尼斯的桶前請教。這天可能是個陰天，天上沒有太陽，因此這個青年幸運的沒有遭到老戴驅趕。在得到了老戴的允許之後，他開始提問，說：“我認為一個人無法走過一個有限距離的。如果將這一線段的兩端分別設成a和b的話，那麼，a、b之間有c點，而a與c之間又有d點，a和d之間又有e點……如此下去，這個線段可以被無限的分割，一個可以無限分割的距離，怎麼能是有限長的呢？如果距離是無限的，人又怎麼能走過呢？”\n\n老戴聽罷年輕人的問題，立刻從終身沒有離開過的陶桶中蹦了出來，激動的半天說不出來話。\n\n一旁老戴的學生看到老師不說話，便自作聰明的打了提問題的年輕人一個耳光，說：“你看，我的老師不是已經走過你說的那段距離了嗎？”\n\n還沒等這個學生說完，老戴手中的棍子就落到了他頭上，只聽老戴激動地用有些顫抖的聲音罵道：“蠢貨，這個青年的問題是對的！”\n\n估計是老戴這一棍子打的太狠了，把這個學生打暈了，所以這個故事到這裡就結束了。\n\n其實，這個問題中國戰國時期的公孫龍也曾提出過，他說：“一尺之槌，日取其半，萬世不竭。” 我大約二十歲左右看到這個故事，自此這個被稱作悖論的問題一直困擾著我。很多哲學上科學上對這個悖論的解釋，是必須假定這世界上存在著最小單一不可分割的粒子，並且這個世界是由這種粒子組成。因此，有限距離在分割到最小不可分割粒子，便無法再繼續分割下去，於是，無限分割不成立，距離便為有限。但直到目前為止，最小單一不可分割粒子仍沒有被科學證明。 比如，西方最早認為原子是組成世界的最小單位。在中國墨家曰“端”，儒家稱之為“無內”，認為是最小單位。總之，就是有一個小的不能再小的東西，這個東西是不能再分割的。\n\n數學家最早解決了這個難題：太複雜了，老子不玩了！於是他們乾脆把數字1踢出了素數隊伍，將它列為最小自然數。因為他們無法證明1是最小整數。\n\n物理學家發現原子可以分為原子核和電子，原子核又可分為中子和質子。\n\n對於量子物理學家來說，什麼中子、質子都太大了，現在的研究方向是夸克，以及尋找更基本的希格斯玻色子。\n\n……\n\n也就是說，直到目前，尚且沒有任何一個領域的科學家聲稱找到了這種不了再分的單一物質。\n\n其實，哲學家們早就看到了這個問題的關鍵。打個比方吧，如果這個世界上真的存在唯一最小不可分的單一粒子，世界上所有的物體必然都是由這種唯一最小不可分的物體組成的，比如男人和女人。那麼一個關聯的問題出現了：既然男人與女人都是由唯一最小不可分割粒子組成，那麼造成男人和女人存在的外在差異的因素又是什麼呢？\n\n古希臘哲學家柏拉圖在《巴門尼德篇》中就借巴門尼德和亞里士多德之口探討了一和多的問題，以及是否存在著單一與眾多的問題。所謂單一，就是不可以再分割的一。那麼這個一如果有，這個一還有意義嗎？這個一豈不就是一切？於是，最終柏拉圖通過巴門尼德給出了結論說：\n\n“看起來，無論單一存在還是不存在，單一和他物各自對於他們自身而言，以及他們二者彼此相對而言，即完全是一切又完全不是一切；即完全代表為一切又完全不代表為一切。”\n\n這個似是而非的結論為《巴門尼德篇》劃上了句號，卻沒有給研究這套理論的科學家們劃上句號。他們無法將這一哲學上的觀念，應用於現實。於是，西方哲學乾脆將其劃分為形而上與行而下兩個層面。形而上就去研究形而上的部分，行而下就去研究行而下的部分，兩者井水不犯河水，不鬥嘴，不吵架，相敬如賓。\n\n對於這一點，台灣哲學家方東美教授有清晰的論述。他將這種西方哲學所展現出的二元對立，稱之為“精神分裂症”，而他認為完美解決這一精神分裂問題的，恰是大乘佛教《華嚴經》所描述的華藏世界。\n\n在 《華嚴經·華藏世界品》中，佛陀借普賢菩薩口描述的華藏世界是這樣的：\n\n華藏世界是毗盧遮那佛在人類不可想象長的時間中，不斷地修行菩薩道而最終生成的。這個世界是出生於一個世界种中。這個世界种名字叫“普照十方熾然寶光明”。這個世界种自下而上生出無數個世界，普賢菩薩為我們略舉了其中二十個世界，他們分別是：最胜光邊照世界，其中有佛叫淨眼離垢燈如來；其上是香蓮花妙莊嚴世界，有佛名師子光勝照如來；其上有世界名一切寶莊嚴普照光，其中有佛叫做淨光智勝幢如來；再往上是種種光明莊嚴世界，其世界有佛名金剛光明無量精進力善出現……最上一個世界名妙寶焰，其土有佛名福德相光明如來。而我們這個娑婆世界就處於這個普照十方熾然寶光明世界种自最下起第十三層。以金剛莊嚴為特點，依附于種種色風輪所持蓮花網上，狀如虛空，以普圓滿天宮殿莊嚴虛空雲作為裝飾。\n\n我們所處的這個世界种是在中央香水海中生長的一隻一切香摩尼王莊嚴蓮花上。而這種能生蓮花，並且蓮花中能安住世界种，並能出生無數世界的香水海，在這個華藏世界中有無量無邊。這些無量無邊的香水海就在華藏世界中。除了這些香水海外，還有香水河圍繞大輪圍山，大地為金剛所成，被各種摩尼寶充滿，並以各種妙寶而嚴飾，以無數種佛所出生清淨功德而具莊嚴。\n\n這一華藏世界，出生於普光摩尼莊嚴香水海中的光明蕊香幢大蓮花中。這個普光摩尼莊嚴香水海，依無數風輪，而安住于虛空之中。普賢菩薩略舉了無數風輪中的十個，自下而上分別是：平等住、出生種種寶莊嚴、寶威德、平等焰、種種普莊嚴、普清淨、聲遍十方、一切寶光明、速疾普持、種種宮殿遊行、殊勝威光藏風輪。\n\n圍繞著我們這個出生娑婆世界的世界海，以右旋的形式又生出無數世界海。而每一個世界海外又右旋而出無量世界海，每一個世界海中皆生蓮花，一一蓮花中皆安住一世界种，普賢菩薩用了大量的文字和贊誦一一列舉二十世界，每一世界的清淨莊嚴和各自特色，所有佛陀的名字。這些相互關聯的香水海、蓮花、世界种及無量世界，形成了一個巨大無邊際的因陀羅網。\n\n畢竟我們去佛的時代已經非常遙遠，大約已經過了兩千五百多年了。兩千五百年，人類文字的變化，以及文字的字義都發生了很多變化。再加上佛經都是從梵文翻譯成漢語，有些甚至從梵文翻譯成印度語，然後再經過吐火羅語、波斯語或者亞洲南部其他小語種再翻譯成漢語的，因此文意之間，被割裂的很多。當年，佛陀在描繪華藏世界的時候，想來對很多華藏世界的物性也無法一一用這個娑婆世界的語言描述出其本來面目，只能用我們這個世界所相似的物性來指代。比如風輪，比如蓮花，比如宮殿莊嚴，比如香水海，比如世界种等等。這些指代如今已經很難靠思維去理解。但是，仍舊有很多指代的意義，我們能夠管窺蠡測一些佛陀的本來意義。\n\n例如，為什麼由佛陀的修行而能生出眾多世界？為什麼這些世界都是向右旋轉而排列？為什麼世界的最下方是由平等風輪所持？為什麼最下一個風輪名平等？為什麼眾多世界中有的世界嚴淨有的粗穢？為什麼這個華藏世界由毗盧遮那佛的願力和修行所成就而每一個世界又分別有佛？以及什麼是因陀羅網？"
		},
		{
			"post_id": 2,
			"title": "華嚴心鏡 · 緣起",
			"date_published": 1485231206.453,
			"body": "![image alt](img/jx1.jpg)\n\n這篇文章是當初在福建寧德九仙禪寺誦讀《華嚴經》時寫的一篇《緣起》，如今歲月匆匆，已經過去兩年多了。當初的九仙禪寺已經面目全非，望雲和尚在2015年7月9日全國律師、公民大抓捕中身陷囹圄，至今沒有消息。709事件中被關押的全國數十名律師、公民還都沒有全部恢復自由，重新貼出這系列文章，心情仍覺得很悲憤。\n---\n2014年末，我在廣州的武館遭到當地國寶的軀幹，估計是我平時網上反共言論太多，積極參與各種街頭活動，武館聚集的同道太多等等。這小小的違緣，卻給我帶來了大大的煩惱，隨即心生去意.想起幾個月前在福建寧德的九僊禪寺誦讀華嚴經還有數品尚未圓滿，於是再次踏上了前往寧德的火車。\n\n九僊禪寺，位於閩東寧德市九都鎮九仙峰的半山腰，這裡山巒疊翠，滿眼綠色。一條二十來米寬的霍童溪從山前流過，與巍峨的九仙峰交相輝映。\n\n九仙峰的地理位置很獨特，往北是秀美的霍童山，為道家三十六小洞天之首，道教著名真人陶弘景曾在此採藥、煉丹、修真，此外，三國時的葛洪、唐時司馬承禎、宋時白玉蟾許多道教真人都層涉足此山。霍童山作為道教第一名山，被眾多道教典籍所記載，此地民間也流傳著眾多神仙應化的傳說故事。從九仙峰往南，是雄偉的支提山，在《華嚴經•菩薩住地品》中明確記載，天冠菩薩與諸眷屬在支提山中卓錫，與一千眷屬在此山中廣行菩薩道，弘揚佛法。九仙峰就坐落在這兩大佛道聖地主峰的中間。事實上，從道教來講，霍童山到支提山都是道教聖地霍童山脈的範疇。而從佛教來說，從支提山到霍童山都是佛教天冠菩薩道場。總之，九仙峰所屬的這一整片山脈，恰是一片仙聖同居的修行淨土。\n\n來到九仙峰下九仙村，沿著蜿蜒曲折的碎石山路一路向上攀登，就到了位於半山腰的九僊禪寺。從寺前的小廣場上極目遠眺，群山碧水盡收眼底。腳下是綠油油的梯田茶園，正值臘月，墨綠的茶葉如滴染的錦緞。間或點綴著一叢叢的芭蕉樹。這裡的野生芭蕉酸中帶甜，極其美味，絕非城裡的香蕉可比，並且可以任意採摘。  \n\n從九僊禪寺向山上眺望，一大片竹林和杉樹一直延伸到山頂的巨石下，蔥蔥郁郁，微風撫過，聆聽林海濤聲，實是一種神仙般的享受。難怪佛教和道教兩家的菩薩和仙人，都願意選擇這裡，修行應化。\n\n九僊禪寺，始建于唐代元和十四年（公元917年），曾是支提山一處重要的道場。唐代高僧本淨曾在此行化。自唐代以降，九僊禪寺幾經興廢。到民國時期，僧人妙喜法師遠渡南洋多方化募，在此重修了九僊禪寺。可惜，文革時期，僧眾慘遭迫害，寺院古建全部被毀。我在九僊禪寺大殿基石和寺外山溪小橋上，分別發現兩塊刻字的基石，其中一塊四字碑上能辨認出“十所為”三字，另一塊被作為大殿房基的石磚上，尚能辨認出“恭為”二字。這塊石碑每個字都有十公分見方，是我所見到的碑刻作品中字體最大的。不知何時寺院被毀，附近村民將其切割成石塊用來搞建築了。但由此仍可以想見當初這座寺院的規模。妙喜法師在文革期間也數次被批鬥，后被關進學習班，一百零八天后餓死在裡面。這位傳奇的民國僧人，徒通五國外語，一生修諸佛事，勉勵恢復道場，最終卻仍難逃法難，讓人不免唏噓。\n\n文革後，寧德僧人海明再次恢復九僊禪寺，在原大殿廢墟土丕房基的基礎上，安梁覆瓦，並修建了山門。\n\n目前，九僊禪寺的當家師釋性慧和尚，2000年彌陀聖誕於支提山靈峰寺出家，2002年於福鼎太姥山平興寺受具足戒。隨後在全國各地參訪，於2006年春，常住本寺。性慧法師自號望雲，有大願心，希望能恢復道場昔日雄風。目前正籌劃興建一座規模宏大的念佛堂。\n\n常住九僊禪寺的維喏師釋徹心，自號圓悟。於1997年於雞西市淨土寺出家，1999年在江西省靜安縣寶峰禪寺禮上一下誠大和尚座下受具足戒。圓悟師教宗般若，行歸淨土，也曾遠赴藏地求法。\n\n望雲師是一個很風趣的和尚，有一次，居士們正在閒聊，說起中國歷史上最俊秀的美男子。有人說是潘安，有人說是柳下惠。這時，正在泡茶的望雲師若有所思的抬起頭來，沉思了一下，說道：我覺得是包公，稱得上是黑潘安。大家都覺得很詫異，丈二和尚摸不著頭腦。這時，望雲和尚才緩緩的說：我覺得吧，我多少比包公還白一點點。\n\n望雲和尚小我幾歲，皮膚有點黑，但很自戀。他經常稱自己是奶油小生。當有人質疑的時候，他就往往自嘲道：我是巧克力奶油小生。\n\n年逾五十的圓悟法師於佛事極其精通、專業且敬業，脾氣很好。他出家前曾為警官，但近二十年的叢林生活已經使他的體重嚴重超標。有一次，我帶一位年輕的女居士去登九仙峰。九仙峰非常難爬，山頂幾乎就是一塊九十度角的巨石。我倆是找到了一個山洞，從山洞頂上鑽出去才找到通往山頂的路。很多地方是懸崖峭壁，需要我將這位女居士抱過險地才能繼續前進。回來後，我們向大家講述這一路上的驚險際遇，讓圓悟師甚為羨慕。最後，他躍躍欲試地對我說：武僧，下次帶我去好嗎？我聽罷尋思了良久，說：八十斤的女居士我能抱起來越過險地。一百八十斤的圓悟師，我估計就一起滾下山了。\n\n發心長期在九僊禪寺護持道場的老居士是望雲和尚的母親。她老人家十幾歲開始念佛，並受了菩薩戒。年近七十，廟裡廟外所有的事情她都一手操辦，幹起活來頂的上一個棒小夥子。望雲師除了衛星墜地，國際爭端等天下大事要親力親為以外，所有的小事都交給了媽媽。來到小廟的僧人、居士，都稱她是老菩薩。\n\n望雲的九僊禪寺很小，但他的願心很大，曾對我說今後要募化三個億來擴建寺院。我聽罷抬頭看看明亮的天空，反問道：你說的是貶值後的盧布嗎？\n\n小小的九僊禪寺只有一進院落。進得山門，眼前就是大殿，院子兩側是二層的僧寮。大殿內泥塑彩繪的本師釋迦摩尼佛像和西方三聖像，都非常精彩。據望雲師介紹，是八十年代一位聾啞民間藝人的作品。如果今後寺院擴建，也要蓋一座古佛殿，將這些精美的佛像妥善保留起來。\n\n小廟雖小，但道風很正。每天全堂的早晚功課，是絕不含糊的。晚上還要誦讀《藥師本願功德經》。初一十五藥師普佛，遠近居士都可以隨意參加。據說過去小廟還有跳大神、算命、水陸法會等專門賺錢的項目，但望雲師父一來，就全給停掉了。他說寺院不能當成生意來做，要用真正的佛法來接引眾生。廟裡沒有了這些賺錢的項目，供養的來源一下子就少了很多，生活也越發清苦。過去廟裡的師父和護持道場的居士漸漸都走了。但是真正注重修行的都留了下來。\n\n也許是寺院歷久的傳承，也許是古拙的大殿泥墻，也許是寺院道風嚴謹，也許是天冠菩薩和伽藍護持，總之，當我初次來到這所寺院，就由衷地從心底升起一份尊重，一份親切。\n\n第一次到九僊禪寺，是2014年9月份。我和望雲師是微博上的好友，他來北京在我家也住過，他對我大講九僊禪寺綺麗宏偉的風景，清新的空氣，絕無污染的山泉以及純天然綠色食品，讓我神往。到了寺院，方知此和尚果不虛言。\n\n支提山佛法興盛，遠迄自五代。據宋代支提寺僧人顯求所撰《支提山記》記載，五代時高麗國（現朝鮮）法師元表在西域（古絲綢之路）遊歷求法，偶遇心王菩薩。菩薩告訴元表法師說：“東震旦國（指中國東部）有座名叫支提的山，天冠菩薩擕其眷屬千人在此說法。你要帶著這部櫚木函裝的《華嚴經》，到那裡去持誦，等天冠菩薩出世，以此為證建立道場。”元表法師領菩薩法旨，便背負此經遠赴千山萬水，來到支提山上的那羅岩窟，在這裡日夜誦經，常感動天地放光，遠近村民都以為是山上藏有異寶。有一天，一位迷路的樵夫來到岩下，聽到元表法師誦經，梵音清澈，遂順著山麓溯溪而下，廣為傳播，說支提山放光，是有僧人在岩洞中誦經所致。霍童甘露寺元白法師聽到這個消息，歷盡千辛萬苦來到岩下，頂禮元表法師，問到：“大師是什麼人？所讀的是什麼經典？”元表法師回答到：“我讀的是《華嚴經》，如果你能向龍王借一塊地以建道場，我就把這部經傳給你。”元白聽罷，靜心誠意向大海的方向殷勤懇請，果然感動了龍王，海中湧沙填地。元表見此，知道因緣已具，現神通騰空而去。元白驚為菩薩化現，回甘露寺邀請僧慧平、慧澤及都尉司一起返回那羅岩迎請《華嚴經》。\n\n元白等人將《華嚴經》迎請回霍童，具奏閩王，閩王閱后，又上報五代十國時期吳越王錢叔（有單立人的）。於是，錢王派沈相國和靈隱寺了悟禪師一起到支提山尋訪。夜宿山下，便聽到山間鐘鼓之聲。次日尋訪響處，極度難行，只能劈藤而進。走到半山，忽見一白猿做招手狀。一行人跟著白猿走了三天，到了一處溪澗，見一寺院規模宏大，殿閣崢嶸。山門匾額上書“化成之寺”。一行人當夜便寄宿在這家寺院，與寺中僧眾談玄論道。次日醒來，卻發現一行人夜宿荒野。只見林木森森，溪水潺潺，天香襲襲。一行人回報錢王，錢王驚歎神異。敕了悟禪師在該地建支提寺，裝塑三寶及天冠菩薩千尊，心王菩薩一尊。\n\n支提山法脈宏開，很多僧人來此弘法建寺。九僊禪寺就是在這個時期建成。據說唐高僧本淨和尚卓錫九僊禪寺時，一天傍晚有九位俗眾借宿。次日清晨辭別，化鶴飛去。當地人訝稱是九仙峰的九位仙人前來做客。這個故事，也記錄在支提寺志中。\n\n九仙峰的仙人傳說源自東漢末年。據說當地有一家人，生了一個極聰慧的男孩兒，遂請了一位道長給孩子算命。道長掐指一算，卻算出這個孩子只能活到十八歲。家人聽罷非常著急，請求道長能給指出個破解之法。道長沉吟良久，說：十八歲那年的九月初九到那座山上去碰碰運氣吧。家人順著道長手指的方向，就看到後來稱為九仙的山峰。轉眼十八年過去了，這個倒霉孩子一個人帶了把柴刀懷著一點僅存的希望向九仙峰上爬去。尋路斬藤終於登上山頂，卻見八仙圍聚在一個棋盤石前，看呂洞賓與漢鐘離在下棋。一盤棋奕完，諸位神仙騎驢的騎驢，騎鶴的騎鶴，騎寶劍的騎寶劍全飛走了。小樵夫連說句話的機會都沒撈到，心想，這下完了，神仙都不救我。喑喑然沿原路下山，卻見自己居住的村莊早已變了模樣。原來山中方一日，地上已千年。這半天時間，人間已過了數百年的光景，物是人非。後來，這位小樵夫也入了道門，成為八仙後的第九仙。才引出九仙借宿九僊禪寺的故事。\n\n我曾和年輕的女居士香香第一次登九仙峰，去尋找神仙的蹤跡，可惜因為山路實在難走，要趕在天黑前下山，只差數十米沒有爬到山頂。\n\n九仙峰著實難爬，饒是我綠野資深領隊，攀登過四姑娘山的經驗，都有些力不從心的感覺。最主要的困難是山上沒有路，登山的裝備又遠在北京，出發時也忘記了帶把柴刀。從九仙寺上山，沿山間公路可以走到一里外的栢苑村。再往上走小路，穿過村民耕種的茶園、竹林和杉木林，就到了小路的盡頭。此時才到了九仙峰的半山腰。從這裡往上，就是人跡罕至的原始森林，到處覆蓋著荊棘和粗壯的藤蔓 。\n\n登上九仙峰下的一個小小平台，這裡有幾棵松樹和輸變電塔。再向上，就是幾乎垂直的，兩百多米高的岩壁。沒有攀岩的裝備，是萬不可能再向上攀登了。我和香香居士觀察山的走勢，發現山的北面坡度比較平緩，便沿著岩石下面的緩坡一路繞過去。這條路的下面是一根栢苑村飲水的管道，應該還有人曾經走過。我們沿著管線一直向北，直到水源地：九仙峰北側山麓的一個大大的岩洞。這裡泉水潺潺，村民們在泉水匯集處砌了個小小蓄水池，這便是下面栢苑村日常用水的來源。\n\n我倆沿著岩洞周圍查看了一圈，這裡仍舊沒有上山的路，十幾米高的岩壁，即便我用徒手攀岩的技術上去，香香一個弱小的女孩子，也沒辦法上去。\n\n但她仍不願放棄，仔細觀察這個岩洞，她突然發現岩壁頂部有光線透出。我倆順著濕漉漉洞壁一路往上爬，在山洞的頂部果然有一個只能供一個人匍匐著爬出的小洞口。邊爬我還在想，當年樵夫神仙是否也是從這個洞爬上去的呢？\n\n爬出洞口，霍然開朗，果然到達了岩石的頂部。從這裡一路向上，是山泉常年沖激出來水道，除了石頭濕滑，有很多三四米高的石壁瀑布外，比我們先前走過荊棘叢好走許多。一路向上，好在我攀岩技術還不賴，幾個小倒角都輕鬆過關。很多地方都是我先攀上小斷崖，再把香香居士拉上去。山間泉水啜手可掬，清冽甘甜。  \n\n香香在小憩的時候，偶然在一座小瀑布的頂端，找到一小段烏木。這段烏木造型非常奇特，秀骨崢嶸。她本想帶回九僊禪寺供養望雲和尚，插在花盆中做一盆景。但我還沒等她說話，便搶過來研究起這段烏木的材質來，一用力便掰斷了。害得香香總想把我從山上踢下去，不過想想她自己可能下不去山，才恨恨地作罷。\n\n我們一路玩兒一路向上爬，很快走到了泉路的盡頭。這裡再上去估計二十米，應該便是山頂的鞍部，這段路完全是原始森林，沒有裝備的情況下會非常危險。此時已經是下午兩點了，午飯我們只吃了幾塊士力架，必須趕到天黑前下山。香香居士仍然意猶未盡，甚至想到山頂上過夜。我斷然拒絕，哼！男女授受不親，我可是純潔的如同一張白紙，表誘惑我。\n\n雖然我已經估計到下山的路會很艱險，但是真沒有想到竟然如此艱險。很多斷崖爬上來的時候沒覺得太困難，但下去的時候則異常驚險。這種石頭山的碎石很多，有些都已經鬆動了。一腳踏下去很容易踏空，山中枯枝，一不注意，便會斷開，我還要經常將香香居士從山崖上抱下來。如果不是為了要在美女面前撐住戶外高手的臉面，估計我早就崩潰了。等我們一路艱難的回到水源山洞的時候，我做出了一個錯誤的決定。本應該沿著原路自岩石下往南走，而我覺得順溪流而下會比鉆樹叢容易，卻忘記了山頂的幾百米到山腳下會變成數公里。結果走到山下時，已經到霍童，恰好是五代年間元表法師所在的甘露寺。這座千年著名古剎，也早已被毀，如今也在重建。此時天已經擦黑，寺中僧人都已經回到寮房，沒有機會了解該寺的情況了。\n\n甘露寺離霍童古鎮很近，從古鎮考古發現，這片區域早在一萬年前便有人類生存的痕跡，五千年前便進入了新石器時代，曾出土過各種文化遺存。霍童古鎮現存的明清建築非常多，是研究閩東地區民居建築風格的好去處。在一家祠堂中我還發現了民國海軍著名將領薩鎮冰的題匾，筆力渾厚，古拙蒼勁。望雲師曾帶我拜訪了霍童鎮著名的霍林宮，可惜當家的道長沒有在，我們在一位年輕道長的盛情邀請下一起喝茶。據小道長介紹，霍林仙人，是中國周朝時一位著名的神仙，根據《寧德縣志》記載，霍林仙人是武夷帝君的父親。不過現在，武夷帝君所在的武夷山成了天下名片，而帝君父親所居的霍童山卻很少為人知道。這也算是一種“長江後浪推前浪”吧。"
		},
		{
			"post_id": 1,
			"title": "《善顛和尚》第一季",
			"date_published": 1433033779.604,
			"body": "![image alt](img/sd1.jpg)\n2013年起，我在新浪微博註冊了個新的ID：善顛和尚，並且準備用這個ID發表一些關於佛學的零星感悟。但沒過多久，ID被封殺，此後再也沒有更新過。如今將當初備份的二十一條微博整理成一篇文章，保存到這裏，暫定名為《善顛和尚第一季》，希望有時間、有興趣的時候，將這個系列繼續寫下去。\n---\n-01-\n    現今佛教，從不為底層的災難發聲。無論地方血拆殺人被逼自焚，無論計生墮胎斂財一屍兩命，無論諸善知識因言獲罪身陷囹圄。諸大和尚仍舊佛照念香照供燈油錢照收供養財照斂，全無懺悔之心護教之意，乃至叢林淪為各方斂財工具。各方施主供養叢林，叢林卻不能成其依祜。長此以往，佛必去神州遠矣。悲夫！\n\n-02-\n    若心不動念即能成佛，石頭早成佛了。以定生慧，若心不動念靜如死水，慧從何生？定的真意，是心無掛礙，是無我人眾生壽者，是不分別不執著。佛陀的教誨，是以出世心行入世道。以無我之心行大善道，效法如來匡扶社會人心，才是真佛子。若以修行來推卸社會責任，以聲聞利養做佛事以斂財，不是佛教徒！\n\n-03-\n    網傳王林贈符李天一，稱遇違緣，可逢凶化吉貴人護佑，今李天一難逃囹圄。回頭再想，大陸名刹古寺近年來得了多少頭香供養，這些上頭柱香者，多為貪官惡吏豪商巨賈。請問各大寺主高僧大德，您是利用此機緣與他講佛說法規勸正路，還是摸著兜裡數十萬上百萬的香火錢偷笑？若是後者，罔披袈裟與王騙子何異？\n\n-04-\n    佛陀教言是救度眾生匡扶社稷的良藥，而不是迷幻群氓歌功頌德的心靈雞湯。當黑暗來臨時，佛陀選擇以身飼虎；當國難當頭時，弘一大師倡導上馬殺賊下馬學佛；當惡政囂張時，已身在香港的虛雲大師選擇回國親赴教難；當國運黯然時，圓瑛大師選擇絕食抗議絕不妥協。真佛子絕不苟且，更不該以心靈雞湯騙人。\n\n\n-05-\n    一稱南無佛，皆共成佛道！佛語真實不虛。念佛哪怕一句，皆得不退轉於阿耨多羅三藐三菩提。但關竅在這個念字，如何是真念佛，如何是借佛裝扮自己？蕅益大師法語，念佛是大佈施大持戒大忍辱大精進大禪定大智慧。六大具足何須百千萬聲，一句南無阿彌陀佛，六道眾生悉共成佛。念佛在心，不是手指上的戒指。\n\n\n-06-\n    如今的僧俗弟子不願意與眾生交集，乃至佛教界與社會隔絕，無法瞭解社會的真相。究其原因無非信仰、習俗、文化差別。讀誦《金剛經》我們頂禮佛陀智慧的同時，也頂禮佛陀平實的修持：入城乞食滌足趺坐。讀誦《壇經》時我們看到六祖慧能與盜賊為夥但吃肉邊菜。我們，能高貴過佛陀、慧能嗎？貢高我慢而已！\n\n-07-\n    憤怒不是嗔恨。憤怒是對罪惡的抗爭。看到醫院謊稱新生兒已死將其出售、紅會要求傷者捐獻器官否則停用呼吸機、計生委對胎兒引產一屍兩命的新聞，不表達自己的憤怒，這種悲劇早晚會發生到你的身上，因為你是這共業的製造者，必受其果報。抗爭就是修行，在娑婆世界，無人能獨善其身。\n\n-08-\n    《圓覺經》：一心清淨一世界清靜乃至三千大千世界悉皆清淨。善知識應知：一切世界無非本心造作，如目染疾。一切善惡相，皆由自心起，心相不除，心不止息，猶如目疾不除，將眼閉起，就能一了百了了麼？善知識，當發精進無畏大悲大智之心，戰勝心魔，自度度他，悲智雙運。莫以自度廢度他，方為行菩薩道！\n\n-09-\n    今民殃不斷，實為此地眾生共業之所致。120萬國軍內戰被屠；鎮反到文革，冤死之菁華近千萬；大躍進餓死國民三千萬；學潮殺人；計生殺人、血拆殺人、酷刑殺人……眾生共業感召今日之果報。今提議：寺院精舍人家，凡日課誦經念佛之地，可擺放“1945年以來蒙冤同胞之靈位”，各界一體懺悔供養，共消共業。\n\n-10-\n    有居士問僧瓜農被城管砣斃事，僧曰：因果耳。遂念佛去。末學以為，這不是修行。或許農夫確有前因得此果報，但城管此因亦必招後受惡果。真修行人，當勉勵奉勸身邊親友中有從事社會管理者，明鑒因果報應，規其惡行惡意，常以佛法皈化向善向佛。當遇到此類事件時，當挺身站在弱者前面。止惡，方為修行。\n\n\n-11-\n    佛的含義是：自覺覺他覺行圓滿。這也是佛教徒追求的方向。可惜，如今一些善知識，自覺倒是有了，覺他偶爾私下裡也悄悄地相互“覺”一下，可到了覺行圓滿這一層，各種顧慮便升起來了：會不會影響工作啊？會不會影響名聞利養啊？如此校記籌量，即墮入聲聞緣覺，乃至為順應名聞利養心行邪道而不自知。\n\n-12-\n    末學有機會去台灣參訪，拜會了台灣四大叢林和本土佛教諸長老。台灣主流佛教繼承和發揚了太虛法師人間佛教宗風，一句：“問政不幹政”使得台灣佛教全球共仰。爲了匡扶正義社會人心，台灣僧人上街遊行抗議，在選舉體制下利用佛教力量遴選代言人，甚至推出自己的競選領袖。而反觀大陸，太虛宗風孱弱久矣。\n\n-13-\n    虔誠持誦佛經過十遍，經義自圓。何以故？以人解經皆有主見曲解，以法誦經全仗三寶加持。如國土恩，《心地觀經》中為國王恩，民國時改為國土恩，深意全失。佛陀於經中列舉國王修善與修惡種種差別。國王修善道，自然隨喜恭順，若國王行惡道，國民必遭刀兵水火劫，糾其過患，即是報恩。故佛經貴誦不貴解。\n\n-14-\n    相比歷史上三武一宗，文革毀佛可謂甚矣。前者無非四到六年，後者荼毒二十餘年。釋迦佛八歲等身像被搗毀面目，六祖慧能之肉身舍利被開膛破肚。虛雲大和尚一百一十二歲被毒打。無數僧尼被還俗乃至批鬥槍殺。三武一宗之時，尚有鄉村可供隱蔽，文革之禍可謂鋪天蓋地。眾善知識當自省，佛教何以有此之禍？！\n\n-15-\n    漢傳佛教從不憚與政權合作，甚至在絕大多數的情況下，漢傳佛教籍著與政權合作，獲得了最大的發展。但是，漢傳佛教絕對不與惡的政權合作，否則滅佛即在眼前。周武王時僧兵起義，對抗窮兵黷武的政權救民於水火，隋末有少林僧助唐兵，開創大唐盛世。政權善惡，佛陀在經典中闡述清晰明白，當為佛子之眼目。\n\n-16-\n    自從此博開通之後，末學雖然也常常祈請三寶加持，念佛回向法界。奈何才疏學淺，仍不免有錯落之處，深感不安。在此一併懺悔。今後也當更加精進念佛修持。願此博能為這悲催的時代，回施一點來自佛陀教言的祜。也願諸位網友看到本博錯處，不吝賜教。南無阿彌陀佛！\n\n-17-\n    鬥戰勝佛身藍色，手捧鎧甲在胸間。能勝無量煩惱根，我今至誠歸命禮。鬥戰勝佛，無怖畏相，能勝一切貪嗔癡慢疑所生煩惱。能勝者，諸佛如來一真法界；所勝者，一切世間六塵緣影。諸善知識當至誠頂禮鬥戰勝佛，以大無畏心對治自身一切過患，以四無量心對治世間一切醜惡。隨順眾生，匡正社會，以振佛威！\n\n-18-\n    以五毒治身，則必罪障纏身。若以五毒治國，則政亡不遠矣。而今政府，正是在以五毒治國：經濟上橫徵暴斂不恤民力，是為貪；外交上四處樹敵假想外邦覬覦，是為嗔；執政方略上否定普世價值污蔑憲政，是為癡；行政上以我為尊肆意妄為欺壓良善，是為慢；文化上無理審查弄虛作假是為疑。五毒之國，運能久乎？\n\n-19-\n    貪為五毒之首。眼耳鼻舌身與五塵相應，妄持有我，貪戀色聲香味觸。色者資財，聲者菲靡，香者思戀，味者執著，觸者情色。然實無有我，所謂生不帶來死不帶去，故曰貪毒。地水火風四大假合成就為我，四大各散，我自何來？故能勘破此毒，轉“成所作智”，蓋無根塵之羈絆，無所識之執著，故能所願皆辦。\n\n-20-\n    涅槃經迦葉尊者問：前有居士不守淨業於屏風外偷聽佛陀說戒。您令密跡金剛將其擊為粉末，太慘了。佛說：作為佛子，應當宣示正道。若遇不守正道，佛子應驅遣呵責壞法之人。如一國王專行惡政，鄰國王聞訊興兵欲以殄滅。惡王最終改邪歸正，那興兵的國王，當得無上福報。佛子若不呵斥壞法之人，是佛法中怨。\n\n-21-\n    佛說不分別，是不分別我人眾生壽者；佛說空相，是空色聲香味觸法諸受。佛從未說要無視苦樂覺受，放棄對諸娑婆境界的觀察。也並不是放棄對善的追求和對惡的鞭笞。而是在無我人眾生壽者的境界下，放棄對色聲香味觸法的追求，而以更決絕的心，視死亡如重生，方能擔當眾生，成就大道！心靈雞湯故當休矣！"
		}
	]
}