{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1599760929,
			"title": "Выпуск libtorrent 2.0 с поддержкой протокола BitTorrent 2 пизда или заебись",
			"body": "Представлен значительный выпуск библиотеки libtorrent 2.0 (известна также как libtorrent-rasterbar), предлагающей реализацию протокола BitTorrent, эффективную с точки зрения потребления памяти и нагрузки на CPU. Библиотека задействована в таких торрент-клиентах, как Deluge, qBittorrent, Folx, Lince, Miro и Flush (не путать с другой библиотекой libtorrent, которая используется в rTorrent). Код libtorrent написан на языке C++ и распространяется под лицензией BSD.\n\nВыпуск примечателен добавлением поддержки протокола BitTorrent v2, в котором осуществлён уход от использования алгоритма SHA-1, имеющего проблемы с подбором коллизий, в пользу SHA2-256. SHA2-256 применяется как для контроля целостности блоков данных, так и для записей в индексах (info-dictionary), что нарушает совместимость с DHT и трекерами. Для магнитных ссылок на торренты с хэшами SHA2-256 предложен новый префикс \"urn:btmh:\" (для SHA-1 и гибридных торрентов используется \"urn:btih:\").\n\nТак как замена функции хэширования нарушает совместимость протокола (поле с хэшем 32 байта вместо 20 байт) разработка спецификации BitTorrent v2 изначально велась без оглядки на обратную совместимость и в состав были приняты другие существенные изменения, такие как использование хеш-дерева Меркла в индексах для сокращения размера torrent-файлов и проверки загруженных данных на уровне блоков.\n\nИз изменений в BitTorrent v2 также выделяется переход к привязке отдельных хэш-деревьев к каждому файлу и применение выравнивания файлов по частям (без добавления добавочного заполнения после каждого файла), что позволяет избавиться от дублирования данных при наличии одинаковых файлов и упрощает выявления разных источников для файлов. Повышена эффективность кодирования структуры каталогов в торренте и добавлены оптимизации для обработки большого числа мелких файлов.\n\nДля сглаживания сосуществования BitTorrent v1 и BitTorrent v2 реализована возможность создания гибридных torrent-файлов, которые включают помимо структур с хэшами SHA-1, индексы с SHA2-256. Указанные гибридные торренты могут использоваться с клиентами, поддерживающими только протокол BitTorrent v1. Ожидаемая в libtorrent 2.0 поддержка протокола WebTorrent из-за нерешённых проблем со стабильностью отложена до следующего значительного выпуска, который выйдет не раньше конца года.\n\nhttps://blog.libtorrent.org/2020/09/bittorrent-v2/",
			"added": 1599760928
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1598886070_1MWBkE6NXav3JtJTy4bUBZqFQYsggBtykJ": [
			{
				"comment_id": 1,
				"body": "этого в retroshare полно",
				"added": 1599760821
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 2,
				"body": "CQEGAcGXxsBNBF9aeS0BCADG48ixGCRN/cWAEFiJPqvavOvu3n9TcGTuzvNfF+Th\n2rko46zJn+OfkFp0zzjb7yiBXJKgIJxS/dK+Bx8V36AuEPyR6f1/l9vFQoFcQQxM\nkhKQol89XAdq2Q2JSLTbXrwgpY1lS4brtrp8ig7UaZ3ZxexsLNkGQOmjMrU8Rbtg\nM4eOCf+jTiP/OpHYYkDe5ruLvnvLTPpUFeTdidUqPhQ5QjdCUW7SmBJ1BSR7mLtr\nfSIOb5sLvI0LfTC9lUXH7EosTXUSe+3SZxoGSTpMquaSC1GO44YBq8rr76txUACv\nrd9cfbPhnByIz+y5ktoxiOWqluVe8J4WdTLvUbOMkOLzABEBAAHNI1J1c2xhbiAo\nR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBfBBMBAgATBQJfWnktCRDRkiSH\nF3OV1AIZAQAAt+MH/0f9nKu/BlxlBOFwps1OhT0epCpmlXh4qsa/3eNWa5N1xKnO\nwQ0jFmWNuBGfen1z9CIvuWjkA6RKUC1bYt5yfDysZFWmtQpZFVJew5R6PE2830dk\nprcGUfQ47sV95iosJwWbWwCc/5q45pcT6NvYYCv0Twb1mdMkmU0o/VrZq0t8mwiV\n4PfoLyqI1eISDvWQvfZWhvd2dVLNiF00z2mI47pI+aYqqM4j0mo3isw3Ss2n133r\nHx9otiWxHuJ1/qYD3SvruI9qxPA52J7rC3xxnsnHAPS3Qs/xKeQDsCU3RDmCugR/\nYI/9ohqqTpwC6UgLqsuPdre1Gb8Ys0aozLDQ7dMCBl607HTcOQMGwKhY/tw5BAAG\nC015IGNvbXB1dGVyBRCsWUhy1JUMi5iUYyVbBA5KBwMIqnU=",
				"added": 1599826179
			}
		],
		"1599993973_1LBxgBiCcnTFh4mEyaF3ycmPY2ciC3c3Kj": [
			{
				"comment_id": 3,
				"body": "https://www.youtube.com/watch?v=6_tRxkNIdCc\n\nhttps://www.youtube.com/watch?v=-h8Kt58t7io",
				"added": 1600158540
			}
		],
		"1600188813_1445uEZzfBAyQjCYY2ccRRY9j4Ap6QSfV4": [
			{
				"comment_id": 4,
				"body": "index.html в папке и есть ваш сайт",
				"added": 1600417772
			}
		]
	},
	"comment_vote": {}
}