{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1565549694,
			"title": "Are there still (((journalists))) lurking here or did they move on?",
			"body": "They might be busy with telling people how Epsteins suicide was totally not suspicious now.\nEvery journalist please reply to this thread so that we know.",
			"added": 1565549693
		},
		{
			"topic_id": 1565637531,
			"title": "What thot will watch us when Kelly is on vacation next week?",
			"body": "I hope it's the one in the middle, https://imgur.com/a/LpYfZD8",
			"added": 1565637529
		},
		{
			"topic_id": 1565678144,
			"title": "Nigger hate thread",
			"body": "Tell us why you hate niggers here",
			"added": 1565678141
		}
	],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 1,
				"body": "kelly would be a good fuck",
				"added": 1565558030
			},
			{
				"comment_id": 5,
				"body": "Kelly wrote an article yesterday about how everybody who questiones the Epstein suicide that conveniently happened right when the security cam malfunctioned is a conspiracy theories and that russian bots manipulated the tweets.\nhttps://www.thedailybeast.com/conspiracy-theories-erupt-after-jeffrey-epsteins-death\nKelly might have moved on. Sad, i wanted to play minecraft with her.",
				"added": 1565584459
			},
			{
				"comment_id": 8,
				"body": "I don't care about zionist Donald, but the media, especially the thots, seem to have a hate boner for him.\nhttps://imgur.com/a/jRqShZX\nThats some kind of sexual fantasy or something, maybe Kelly can confirm.",
				"added": 1565596460
			}
		],
		"1565575614_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 2,
				"body": "When you refresh the page you see a request to ZeroNet-Internal/Websocket that gets a 101 status in return. This is websocket, a full-duplex connection that stays alive the whole session.\nThis is also how browser games work ... or basically everything that needs lots of small life updates.\nIn chrome you can check the packages that get sent through it. In firefox there isn't any built-in methode for that, but you can use some basic userscript or extension that prints it.",
				"added": 1565577223
			}
		],
		"1565525838_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "Make a HTML page thats just a big iframe to your clearnet site.\nBut idk why the fuck you would want such a thing.\n\nIf you have a torrent site and want to be save and have a bunker in case the clearnet site gets shut down, but you still want a presence on the clearnet, you would have to go through the extra work of making your zite decentralized + making a bridge to permanently auto-seed all changes from the clearnet to the zite.",
				"added": 1565578002
			}
		],
		"1565538736_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 4,
				"body": "Reminder that the Romans were the original Nazis\nQuote Talmud:\n>Rabbi Chiya bar Avin said that Rabbi Yehoshua be Karcha said, \"An elder of the men of Jerusalem recounted to me, 'In this valley, Nevuzaradan, the head of the henchmen, killed two million one hundred and ten thousand [people]; and in Jerusalem, he killed nine hundred and forty thousand upon one stone, until their blood went and touched the blood of Zecharia, to fulfill that which is stated (Hosea 4:2), \"and blood touches blood.\"'\" \n\n>the Gemara cites the verse: “The voice is the voice of Jacob, but the hands are the hands of Esau” (Genesis 27:22), which the Sages expounded as follows: “The voice”; this is the cry stirred up by the emperor Hadrian, who caused the Jewish people to cry out when he killed six hundred thousand on six hundred thousand in Alexandria of Egypt, twice the number of men who left Egypt. “The voice of Jacob”; this is the cry aroused by the emperor Vespasian, who killed four million people in the city of Beitar. And some say: He killed forty million people. “And the hands are the hands of Esau”; this is the wicked kingdom of Rome that destroyed our Temple, burned our Sanctuary, and exiled us from our land.\n\n>The Jerusalem Talmud relates that the number of slain was so enormous, that the Romans \"went on killing until their horses were submerged in blood to their nostrils,\"[7] and that the flow of blood overturned large stones in its course, and that when the flow of blood travelled along a riverine brook at a distance of 40 biblical miles to the Mediterranean sea, the red hue from the blood of the slain could still be seen in the sea at a distance of 4 biblical miles. \n\n600.000 in Alexandria\n40 million in Betar\n>2.110 million in Nevuzaraden\n940.000 in Jerusalem\n(don't question those numbers, goyim!)\n\nFuck Romans, those antisemitic bigots.",
				"added": 1565583832
			}
		],
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 6,
				"body": "4han will never be down, a honeypot for 10+ years now",
				"added": 1565584616
			}
		],
		"1565593853_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 7,
				"body": "KDE, because it's what you will end up using if it's a productive environment.\nQt is just much more popular and used by many more companies and pretty much all Software Developers i know that work with linux eventually ended up with some RedHat distro and KDE independent from each other.",
				"added": 1565596063
			}
		],
		"1565620016_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 9,
				"body": "> [dreams](#comment_15_175k5jSMnhAcN1tFBKyytJwGdPYxrmxB4i): I would like to see internet access and cell phones decentralized.\nThat's what ham radio is about since times before the internet was even thing, and they still do things like citywide wifis that they connect with each other.",
				"added": 1565621506
			},
			{
				"comment_id": 10,
				"body": "Everything that needs a central authority to confirm something can't be decentralized.\ni.e. a onlineshop where you get a status of your order and maybe delivery status",
				"added": 1565621702
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 11,
				"body": "cryptomining as a form of bot protection is an interesting idea",
				"added": 1565637904
			}
		],
		"1565638691_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "I never saw a single worker supporting communism, just saying.",
				"added": 1565640098
			}
		],
		"1565638318_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 13,
				"body": "In theory you could run a webserver on localhost and make the mistake of specifically setting way too permissive CORS Headers so that then some site script from some random page could access it.\nSo if you are shit and if some web service that you are running is shit, you could potentially run into a security issue.\nBut then it's not your \"NoProxy for 127.0.0.1\" that's the vulnerability, it's the shitty software with its shit CORSE Headers thats the vulnerability.\n\n(also note that the port is included in the same origin policies per default, a zite on 127.0.0.1:43110 can not do Cross-Origin Requests to a webserver on 127.0.0.1:80 without the webserver specifically allowing it)\n\ntl;dr: There is no issue, setting \"NoProxy for: 127.0.0.1\" is perfectly fine.",
				"added": 1565640857
			}
		],
		"1565637531_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 14,
				"body": "It's the \"I am a bad girl, tame me\" pose.\nShes into bondage. Like most woman like this are.",
				"added": 1565641175
			},
			{
				"comment_id": 17,
				"body": "bump so that kelly can see it when she checks out what the evil nazis are up to.",
				"added": 1565662891
			}
		],
		"1565490001_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": [
			{
				"comment_id": 15,
				"body": "So the one big benefit of millchan merger is that you can opt-in to boards, so you don't seed all per default.\nThe downsite is that you have to find all those boards first in order to merge them to your Hub.\nidk about that",
				"added": 1565641519
			}
		],
		"1565645808_1NkqJSocDr3nAa6WWDCAHgtf3ftwBUGGCK": [
			{
				"comment_id": 16,
				"body": "> [kaffie](#comment_1014_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Because most people here are far left anarchists. Same for all p2p/decentralization platforms. \nI seriously doubt that if i remember how ham radio, the early internet and the golden time of p2p filesharing was like.\n>Far left views naturally lead to a desire for open platforms.\nAham.... how did every sinlge far-left government end up?\n>Don't y'all like absolute domination via authority figures? Isn't that like your whole dream? Why run from what you advocate for?\nEconomical right-wing, aka free market and ancapism, is pretty much the total opposite of authoritarian. You know, that real Anarchism that doesn't require every single human to be a brainwashed ant. You know, liberaitarians, those people who force crypto currancies hard and are their strongest supporters.\n\nAuthoriarian and economic far right-wing is a contradiction in itself. A true free market can not exist under an authoitarian government.\nJust like Libertarian and economic far left is a contradiction. There can't be such a thing like equal distribution of all goods without an entity (government) above that is regulating and controling it.",
				"added": 1565662561
			},
			{
				"comment_id": 18,
				"body": "> [kaffie](#comment_1022_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I remember fine. p2p filesharing people are horribly against capitalism, by nature.\nTell that Kim Dotcom in his 15 million USD mansion in New Zealand that he should share his wealth, or Sean Parker with his 2.4 billion USD fortune. P2P filesharing was (and still is) a lucrative business. Some get rich by providing the platform, others get rich by using it to distribute spyware.\n>why would they do what they consider theft?\nBecause it can make you god damn rich with no real effort.\nDont tell me that you are one of the \"They all just do it out of unselfish reasons because they want to gift things to the world\" retards.\n>How do you enforce the free market and concepts of ownership?\nI am the initial owner of what i produce, because i made it, i have it in my hands. The one who wants to take it away from me by force is the one who wants to enforce something (aka what the far left wants to do).\nSo you might rephrase your question with:\n>How do you stop someone from stealing what you own?\nAnd there are multiple ways of doing so, by disencouragement because nobody would want to trade with the criminal anymore, by personal NAP enforcement, by NAP enforcement of my other customers who aren't happy with it or by a privaiized police. I am no Ancap, but even i know that they at least think about what happenes if someone breaks the NAP, while Communists (talking about the statless society that they want to achieve) simply assume that nobody would commit any crimes anymore once Communism is achieved, so we don't need something like enforcement of basic rights. Nobody hates each other, so nobody would commit murder, nobody would rape, everything would be perfect in the pink unicorn fluffy land that's achieved communism. Also LGBTQ doesn't exist anymore once capitalism vanishes, because being gay is a capitalist construct.\nIn reality  \"achieved\" Communism would fall appart as soon as the first one says:\n>hey, wait a minute, what about if i actually demand people to give me more in return if they want my stuff?\nAs i said, libertarian economical far-left is a contradiction in itself, just like Authoritaian economical far-right.\n\n>\"force\". Thanks for proving my point.\nso now you suddenly don't support decentralized crypto currencies anymore, because pretty much all of it's political supporters are economic right wing libertarians?\nOr wait... you deliberately dropped the context to imply that \"force\" here means that someone will stand with a gun in front of you and force you to abandon fiat money?\n>But all right wing people, by definition, are authoritarian.\nTotal bullshit. Liberitarians aren't authoritarian. But they are as capitalistic as you can get.\nhttps://en.wikipedia.org/wiki/Libertarian_Party_(United_States)\nSame with Ancaps.\nAs i said, you can't have a free market with an authoritarian government that has it's hands everywhere.\nYou know which countries had a planned economy where a central authority tells you what and how much you have to produce.... the ulimate form of Authoritarians, where you can't even decide what you work for. All Marxism-Leninism. A planned economy is the total opposite of a free market... so congrats Commies.... you achieved to abandon capitalism.... ups, accidentally told farmers to stop farming and now 40 million people died in your \"Huge leap forward\"? LMAO, nevermind, it wasn't real communism yet.\nAnyway, back to your statement, let's apply reality to it:\nAll applied left wing politics in the real world ended up as the most authoritarian shitholes in existence. You must feel really proud for being part of the political ideology that formed modern North Korea.",
				"added": 1565671277
			},
			{
				"comment_id": 19,
				"body": "> [kaffie](#comment_1023_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): None of those people did p2p file sharing to acquire their wealth. [...]\n>Founder of Napster\n>didn't do p2p file sharing to acquire their wealth\nok\n>Wat. Okay I'm done because that's the single most idiotic thing I've ever read in my life.\nNice argument you got there. The P2P pineers got rich thanks to what they did. Distributing movies and music is a multi billion $$$ market, you must be delusional if you think that there aren't tons of people around who are just in it to try to make money. Also whoever bought a few bitcoin when it started could make a fortune.\n>That's exactly what it is. P2P software is inherently anticapitalist.\nWhat exactly should be anticapitalist about that? What?\nJust because i don't need a centralized server and the people are the once hosting for me? So that i don't have to pay for sservers and it's cheaper for me to launch a site with whatever i think will generate me revenue?\nPro tip: Pay-to-visit websites are a neglactable minority, so by your definition i guess that the whole internet is already anticapitalist?\n>If I copy and paste what you have written, is that taking away your work by force?\nWhat the hell makes you think that everything that a human can produce is digital? WTF.\nIs the basis of your whole economic ideology one little specific group of products?\nDo you think that Libertarians support copyright lunacy? What even is your point here?\n>right after trying to claim p2p is right-wing\nWHERE, where did i make that claim?\nOh wait, i guess for you there are just two possible things: Right and Left. Even thought that you obviously don't even understand what the right-left spectrum means, because when you talk about right-wing, you obviously think about facism. I gave you the chance multiple times to realize this mistake! I hinted it many many times by specifically says ECONOMIC right wing, And we are talking about capitalism, which should give be enough for you to get it. National Socialists an italian fascists where not free-market enthusiastic captialists! The capitalistic (not real capitalism) USA is not fascist!\nYou are just mixing up \"right wing = Nazi\" with \"economic right = capitalist\" as you please. So lets make that clear:\nFree market capitalism is the economic far-right, it's represented by Libertarians and Ancaps, NatSocs are far away from that, NatSocs implemented a form of a welfare state. Libertarians are not Authoritarian, Ancaps are the opposite of Authoritarian. The most Authoritarian capitalist that you can get is Pinochet, and that was a sock puppet and not an independent government.\n>I'm more than happy to not \"trade\" with anyone. That's fine.\nThen you wont receive any goods, perfectly fine and possible in an Ancap society. You just can't force someone to give you stuff for free. You have to get your own food (this one thing that communists don't like).\n>Worth noting that cryptocurrencies are not decentralized.\nmonero\n>Libertarians, despite their oxymoronic name, are actually authoritarian. Intensely so.\n[citation needed]\nHow so?\nHow are the people who say that everybody should mind his own business authoritarian, but somehow the people who say that you should give everything away to everyone are not?\nYou do realize that a communist commune within an Libertarian society is perfectly possible, but the other way around is not? Thats their definition of freedom, you can't get any less authoritarian than that.\n> You can't have a free market without violent enforcement of \"ownership\" \nWhy would i need to violently enforce \"ownership\"?\nOwnership is the initial state. i.e.: I produce a shoe. Because i produced it, i have it in my hand and i decide what i do with it. How is this \"violently enforced\" in any way? Could you give me an example of how that would look like without that \"violently enforcement\"? Bring an example. What are you talking about?\n> and a centralized means of currency production\nSmall hint: It's still capitalism, even if its bartering. The currency doesn't matter. And why would the currency have to be centralized? A market with competition and the rules of supply and demand works with any currency or even without currency.\n>See the problem is again violently beating up people who disagree with your claim of ownership.\nlol, so if i produce a shoe and someone else wants that shoe and i say that he can have it, but just if he gives me 5 bottles of milk in return, it is me who is \"violently beating up people who disagree with my claim of ownership\"?\nWanting something in return for my product is violence?\n>hate to break it to you, but that's still capitalism.\nNo, it is by definition not. There are no rules of supply and demand in an planned economy and there is no competition. It literally is not capitalism! By the very definition of it!\n>Manufactured famines in the USSR and North Korea, among other communist countries/nations were due to interventions by imperialists. \nHow is the Great Leap Forward, which is the example we are talking about, caused by \"interventions by imperialists\"? How? Explain! It was an economic and social communist reform. It was caused because farmers were suddenly not the owner of their own land anymore and couldn't even decide what gets planted and the massive push towards industrialisation.\n>imperialists\n>imperialists\n>imperialists\n>imperialists\nyou keep saying that over and over again, but do you even know what that means?\nDo you know why it says \"Workers of the world, unite!\" and not just simpler \"Workers unite!\"?\nDid you read Marx or at least listen to some Commie explaining that?\nThe thought is that all humans are identical and nationalities do not exist, so countries are just imaginary borders and in order to really achieve communism you have to abandon the concept of nations. Communism is imperialistic in the sense that they want to conquer the whole world. Its part of the ideology. This is why the USSR enslaved half of Europe after WW2 and why the Communists try to take every country they could. The USA defeated Japan pretty much alone and then just left East-Asia alone and the Communists did immediately use that power vaccum to take over China with violence. \nOnce they had this, they invaded South Korea, and even thought that the UNO and every single other country told them not to, they just continued and the USA had to show up again, with a legit UN mandate, to stop them from commiting a mass-genocide. Then China and the USSR had to throw all their people at it and we got what we have now.\nBut hey, you didn't mention that, you conveniently forgot to mention that North Korean Commies invaded South Korea out of purely imperialistic motivations.",
				"added": 1565676563
			},
			{
				"comment_id": 20,
				"body": "tl;dr:\n• Communism is by definition ANTIDEMOCRATIC\n(it's an \"revolutionary\" ideology, this means: They do not even try to get into power by vote, but by revolution aka coup. As you can confirm by looking at the history of pretty much all communist countries in human history)\n• Communism is by definition IMPERIALISTIC\n(the goal of abanoning nations is on top priority, you can't abandon all nations without first conquering all, they want the whole world, not just a country)\n• Communism is by implication AUTHORITARIAN\n(having a central authority telling you what to work as and what to produce and then how the goods you produce will be used and who gets them — of course there is that fairy tale story that once the people are brainwashed enough you can abandon the state and the system will keep itself afloat, but thats unrealistic thinking and no communist country was ever even close — in reality, we know how communist countries look like — North Korea)",
				"added": 1565677166
			},
			{
				"comment_id": 24,
				"body": ">How do I get in on this? Why are so many in this banking cartel Jewish despite their vast minority? What are their connections?\nYou get in on this by reading a history book.\n\nStart with the Roman-Jewish wars where jews revolted because they thought that the Romans would forbid them to mutilate babies — they lost 3 times and efficiently lost their whole country and the Province Judea got changed into Palestina (if you want something to laugh, read about the jewish claims of the holocausts that Romans comitted. 40 million jews died in a single city of fishers).\nThen read about how jews, without home country, scattered themselves over whole Europe during the following centuries and how they kept in touch with each other, basically establishing the first international postal service.\nThen read about how they used the connection of jews through multiple countries to trade with informations and how this gave them huge advantages in finance and media (the Rothschilds got informations about the outcome of battles before the involved governments got the message). How monarchs hired them because of this, and how they then used those insider informations to be huge fucking leeches, biting the hand that feeds them.\n\n.... and this is already how the story ends... the last time that jewish connections were relavant for getting informations accross countries was maybe 200 years ago... they don't have that advantage anymore.\nToday they own the media and finance because they still clinge on what they got centuries ago. Just a jew is allowed to replace a jew. It's nothing more than nepotism.",
				"added": 1565751224
			}
		],
		"1565677270_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 21,
				"body": "Argentinia has so many finance crashes that nobody cares anymore.\nWhich is pretty good for them, because its always over after a year or so because nobody expects them to pay debts anyway.",
				"added": 1565677515
			}
		],
		"1565716215_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 22,
				"body": "Discord doesn't seem to have any problem with pedophiles or threats of violence, but in that case they had to shut everything down?\nTells you much about their priorities.",
				"added": 1565721849
			}
		],
		"1565706281_1LUP6SN7WrXAH7e5bUFxdmrVsFr2m43XB4": [
			{
				"comment_id": 23,
				"body": "Do you guys think that Kelly knows what this whole P2P thing is about, or does she just repeat what others tell her?",
				"added": 1565722369
			}
		]
	},
	"comment_vote": {}
}