{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1608640318,
			"title": "Nurse passes out on live interview after gettings the vaccination",
			"body": "https://www.liveleak.com/view?t=9awQ_1608257052\n\nThoughts??",
			"added": 1608640317
		}
	],
	"topic_vote": {
		"1608588854_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1,
		"1608641364_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": 1,
		"1608764285_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [],
		"1606040168_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 2,
				"body": "What about setting up the local server on a raspberry pi and forwarding your local IP to your iPhone so when you type 192.168.0.14 (your raspberry pi) it will bring up the local host server. Then if you want to take it globally you can then just use a VPN to stay connected to your home wifi using wireguard or OPENVPN. \n\n\nJust throwing in my two cents",
				"added": 1606864587
			}
		],
		"1608588854_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 3,
				"body": "Either we're living in an delusional world of make believe with someone / something controlling things as if we're running on a script or I'm going crazy…How long can we deny the truth when it's all coming to life in front of us?\n\n\nEither it's a coincidence or we're living in a predeterminism reality, where everything is already planned and plotted regardless of what choice you pick. Since shows like the simpsons already predicted a lot of things to the last 'T'",
				"added": 1608630123
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 4,
				"body": "I may not be correct but from the looks of it, more and more people are starting to not buy into the bullshit. Even the average joe is starting to question the rush and forcefulness and irational rules. I say the goal is to hit 51% of those that believe C19 was a scam the rest of the 49% will be neutralized by the time we cross the 51% mark. \n\nMaybe I'm just the optimistic type but it seems more people have woken up than ever since the start...",
				"added": 1608639186
			}
		],
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 5,
				"body": "> [edgelordofdecent](#comment_737_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): It's because of covid-20. Duh\n\nWell go figure:  I heard in January more people gonna drop like flies",
				"added": 1608690086
			}
		]
	},
	"comment_vote": {
		"737_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1
	}
}