{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1536596994_15FmQ5wYgywWC5mtkpCtg2HcnWXLpyk9nj": 1,
		"1536519739_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1543487242_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1543742417_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn": 1
	},
	"next_comment_id": 42,
	"comment": {
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": [
			{
				"comment_id": 1,
				"body": "A reddit thread about it was literally how I found out about zeronet. It's also why I'm using zeronet now.",
				"added": 1536838034
			},
			{
				"comment_id": 2,
				"body": "A reddit thread about it was literally how I found out about zeronet. It's also why I'm using zeronet now.",
				"added": 1536838042
			}
		],
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 3,
				"body": "I would never have found Linux without a search engine because I'd need a site talking about linux and without being able to search info on it I'd still think Linux was a single OS and never have even heard Ubuntu outside of it being used as whatever the African phrase was. Simple reality is a search engine is going to be needed when ZeroNet gets bigger simply because the amount of information is going to grow to big to navigate without one.",
				"added": 1536840226
			},
			{
				"comment_id": 5,
				"body": "> [kaffie](#comment_674_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Can't search for something if you don't know what it is. [...]\n\nLong term the best way to do a search engine might be to update zeronet to make it searchable somehow. Also most times someone uses a search engine they are trying to find more information on something. For example I know what email is. I would use a search engine to find email providers. Search engines aren't used for discovery but rather research.\n\nHowever I don't necessarily think it needs to work in the same way as clear-net ones. The purpose of a search engine is to organize the network it searches. Therefore maybe it would be feasible to create a standard that would allow quickly indexing a site with minimal data needed (my guess for an implementation would be to have some kind of standard xml format where a search engine need only to parse the xml, bypassing the page itself.I'm not a programmer though so I'm probably not the best person to try to create an implementation). However a search engine really is needed. Maybe you as an individual don't need one and that's fine. I personally use ecosia regularly and many other people use various other search engines.\n\nIf nothing else the clear-net has shown that there is demand for a way to search the contents of a computer network and so while whether or not that demand is justified is debatable, since the demand is there ZeroNet won't take of without it. Right now this whole thread seems to be a debate on whether or not we need to organize the data contained in ZeroNet. I haven't seen much discussion on how to do it. As the thread title is attempting to explore methods to create one people just coming to say \"I don't use one and therefore nobody needs one\" are being counterproductive and derailing the thread.",
				"added": 1536858957
			}
		],
		"1536596994_15FmQ5wYgywWC5mtkpCtg2HcnWXLpyk9nj": [
			{
				"comment_id": 4,
				"body": "I still think subleq is the best esoteric language. A single command to have Turing completeness is impressive in it's own right (https://en.wikipedia.org/wiki/One_instruction_set_computer)",
				"added": 1536857859
			}
		],
		"1543672789_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 6,
				"body": "> [quantumworld](#comment_9_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I got banned from twitter after I made fun of a stuffed pig. They said that I was insensitive to vegetarians. And it had nothing to do with vegetarians. They are insane.\n\nAm a vegitarian and I can neither a.) see how that could be even remotely offensive or b.) see how it's not acting like a whiny child to ban somebody over a joke.",
				"added": 1543736360
			}
		],
		"1543643463_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 7,
				"body": "Personally I just want privacy, not nessacarily anonymity. Zeronet happens to be able to provide both so I reside on here with an account. I understand people's desire for anonymity, I just don't share it.",
				"added": 1543736660
			}
		],
		"1543694585_16af9LM4sncd3n6NQDX7GqdWreYvCbKX4q": [
			{
				"comment_id": 8,
				"body": "Unsure if generic troll, russian bot, or russian troll. I guess it could be a generic troll with a russian dildo. Then it manages to be all 3. Either way this is obviously not legitimate or is a peak asshole.",
				"added": 1543736832
			},
			{
				"comment_id": 11,
				"body": "> [eightyfour](#comment_37_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): Hi there FBI, how's the fish biting today? Or are you a journo looking for a scary tech story to write? You never know these days.\n\nWell why can't it be both? I imagine a journalist working for the fbi would be able to do investigations pretty well. They'd just have to make sure that the journalist is loyal to the state and not morals.",
				"added": 1543739597
			}
		],
		"1543487242_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 9,
				"body": "Needs a proper mechanism for search indexing. Right now it's all just sitting in the realm of thought experiment since zeronet is fundamentally different from the regular net. Somebody else will probably beat me to it tbh since I'm doing it as a learning project.",
				"added": 1543736936
			},
			{
				"comment_id": 10,
				"body": "> [futuretoast](#comment_9_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): Needs a proper mechanism for search indexing. Right now it's all just sitting in the realm of thought experiment since zeronet is fundamentally different from the regular net. Somebody else will probably beat me to it tbh since I'm doing it as a learning project.\n\nNvm I actually just found zoogle. Is it too late to change my answer to more people?",
				"added": 1543739465
			},
			{
				"comment_id": 41,
				"body": "> [ssdifnskdjfnsdjk](#comment_509_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): To change your answer (comment) or delete it, move your mouse cursor over your answer/comment and then the semi-transparent pencil appear on the left of your post.. Search mechanism is on ZeroHello (\"Search in connected sites\") and there are several search engines too, most advanced is currently Horizon.\n\nThanks a lot kind stanger. I didn't know you could edit responses. I'll have to try horizon now. (I've been using zoogle zearch)",
				"added": 1543747435
			}
		],
		"1543742417_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn": [
			{
				"comment_id": 12,
				"body": "Looks like it used to be hosted on a site called beta archive before they took down the files. Doesn't look like the web archive picked it up either cause the ftp server they used needed registration stuff and I'm pretty sure the archive would've just gotten denied access to the site.",
				"added": 1543743370
			},
			{
				"comment_id": 13,
				"body": "> [timelinehyperbot](#comment_47_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): quantumworld because Linux sucks for a desktop/gaming solution...  A professional should only use Linux and gamers should only use a hacked version of Windows 10 that prevents automatic updates and other nasty Microcraps built in stuff...\n\nI dunno I do gaming on my linux box (albiet mostly emulation)",
				"added": 1543743404
			},
			{
				"comment_id": 14,
				"body": "That's not what the guy is looking for though",
				"added": 1543743445
			},
			{
				"comment_id": 15,
				"body": "He's looking for the content of a source leak from windows 10 (a few bits of driver stuff was all afaik)",
				"added": 1543743478
			},
			{
				"comment_id": 16,
				"body": "I'm sure it's been mirrored by somebody. It's just gone from it's original host",
				"added": 1543743523
			},
			{
				"comment_id": 17,
				"body": "> [timelinehyperbot](#comment_49_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Microsoft does NOT release source code!\n\nYes. Hence why the leak was a big deal",
				"added": 1543743536
			},
			{
				"comment_id": 18,
				"body": "Have you checked if somebody stuck it in gitlab or github (I'd check gitlab first tbh since microsoft bought out github I wouldn't expect to find it there)",
				"added": 1543743627
			},
			{
				"comment_id": 19,
				"body": "> [timelinehyperbot](#comment_51_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): github was bought out by Microsoft!\n\nYeah that's why I'm suggesting to check gitlab. There's a chance it might be there. Git hub it's a next to none chance of it being there",
				"added": 1543743721
			},
			{
				"comment_id": 20,
				"body": "> [timelinehyperbot](#comment_53_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): question, is Twitter dead?\n\nTo people here yes. To people not on here no.",
				"added": 1543743835
			},
			{
				"comment_id": 21,
				"body": "Twitter: Using 140 characters for either politics or shitposting. There is no third option",
				"added": 1543743945
			},
			{
				"comment_id": 22,
				"body": "> [quantumworld](#comment_23_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I got banned for comparing David Hogg to a Pig. They told me I was promoting cruelty to animals. (This really happened!)\n\nI think I saw you earlier in another board on here",
				"added": 1543744048
			},
			{
				"comment_id": 23,
				"body": "> [timelinehyperbot](#comment_56_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): 280 chars not 140 chars\n\nMy bad. I never really used twitter. I just watched the shitstorm from people trying to cram politics into such short posts",
				"added": 1543744091
			},
			{
				"comment_id": 24,
				"body": "> [quantumworld](#comment_23_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I got banned for comparing David Hogg to a Pig. They told me I was promoting cruelty to animals. (This really happened!)\n\nI had to look up who that was. I forgot all about that shitstorm",
				"added": 1543744213
			},
			{
				"comment_id": 25,
				"body": "> [nootnat](#comment_7_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn): GODAMMIT PEOPLE, i don't really need the source of windows 10, even windows 8 or 8.1 would be good enough\n\nYou know it was a just a few core driver right?",
				"added": 1543744232
			},
			{
				"comment_id": 26,
				"body": "> [quantumworld](#comment_24_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Twitter sucks. I hated using it when I was on there. I have a lifetime ban.. And I will never use or promote any twitter account for anyone or any Business. Twitter is DEAD to me! And Jackoff Dorcey can take his SJW Nazi's and shove it..\n\nMake new twitter accounts and post actual mein kampf on half and then post feminist mein kampf (quick search sould find it) on the other half. Watch as half get banned. Guess which half",
				"added": 1543744306
			},
			{
				"comment_id": 27,
				"body": "> [nootnat](#comment_8_1MzPWz97Wnb8Ny5D6sNYhNaaTyzpSDSHGn): It was the whole ARM code for windows, according to some news websites\n\nIt was only 1.2 gb of actual code. I though it did have some arm drivers in there but it was just a bunch of drivers and nothing of importance (except maybe for something like reatcos)",
				"added": 1543744375
			},
			{
				"comment_id": 28,
				"body": "\"\nThe person that confirmed the leak already stated what bits of source were leaked:\n\n\"No source code has been leaked other than the ARM shared source kit.\" \"\n\nCopy patsed from that same forum",
				"added": 1543744455
			},
			{
				"comment_id": 29,
				"body": "> [quantumworld](#comment_26_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): They do a phone number verify now.. I am out of numbers and they flagged all numbers that are on a rotating system such as google. They are locked down pretty good. However server side stuff I would love to look into. Nothing would be more fun than watching a dark twitter .com site.\n\nCan you verify with google voice numbers? Spamming the dying remanent of google plus and twitter would be fun",
				"added": 1543744582
			},
			{
				"comment_id": 30,
				"body": "> [timelinehyperbot](#comment_61_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Question: I need to re adapt my twitter bot to something else any suggestions?\n\nSpamming feminist mein kampf on censorship-heavy websites.",
				"added": 1543744658
			},
			{
				"comment_id": 31,
				"body": "> [quantumworld](#comment_27_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I  have tried that. They flagged me..  Unless they recently changed there settings. last time I tried was 3 weeks ago.I really dont want back on there system. I want to dos them so bad I could blow up the sun.. lol\n\nWell technically I'm not suggesting using their systems normally. Technically I'm suggesting abusing their systems. There has to be a way to do it. On some level they flagged some aspect of you computer. Different network with the operating system running from a vm and a browser you don't usually use should let you make fake accounts",
				"added": 1543744799
			},
			{
				"comment_id": 32,
				"body": "Alsy fyi @nootnat since this started as looking for torrents here http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3/?Home\n\nTorrent site hosted on znet",
				"added": 1543744897
			},
			{
				"comment_id": 33,
				"body": "> [quantumworld](#comment_29_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have tried all of that.. They have a script file with there phone verifying system that has all of those numbers flagged. I was very impressed. They need a Loving Dos attack that has a nice rewrite to all there drives.. Its Format the servers time..\n\nNah. Cut the power to twitter hq. Deleciously evil.\n\n> [timelinehyperbot](#comment_65_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Should i convert my twitter bot to a Tumblr bot???\n\nYes",
				"added": 1543745002
			},
			{
				"comment_id": 34,
				"body": "> [timelinehyperbot](#comment_65_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Should i convert my twitter bot to a Tumblr bot???\n\nAlso have it find twitter post, replace the words \"white people\" with \"the jews\". Enjoy tumblr going insane",
				"added": 1543745065
			},
			{
				"comment_id": 35,
				"body": "*tumblr post",
				"added": 1543745071
			},
			{
				"comment_id": 36,
				"body": "> [quantumworld](#comment_32_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Thats evil.. lol\n\nI can't take full credit. I stole the idea from reddit",
				"added": 1543745158
			},
			{
				"comment_id": 37,
				"body": "> [timelinehyperbot](#comment_67_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Can i post to tumblr as autonomous WITHOUT the capcha code?  ... I'm using python 3\n\n\nI dunno. I just gave up signing into anything that needed google captchas. So far I've lost my minecraft account and my playstation account to it",
				"added": 1543745278
			},
			{
				"comment_id": 38,
				"body": "> [quantumworld](#comment_33_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I say do some html injections and see if you can bypass the captia. It may work...\n\nSimilar thing here, but replace python programmer with just tech savy dude",
				"added": 1543745872
			}
		],
		"1542278485_1ELQXPkiUPmfR2ZCJLyhEucP5vqkLWaJdv": [
			{
				"comment_id": 39,
				"body": "Gentoo",
				"added": 1543746999
			}
		],
		"1543656691_1HbvuN84epzW1vjpRjgemxPADB6UqdZpvy": [
			{
				"comment_id": 40,
				"body": "http://127.0.0.1:43110/Sites.ZeroNetwork.bit/ Good list of popular sites\n\nhttp://127.0.0.1:43110/13EYKqmPpwzBU4iaQq9Y4vfVMgj8dHeLkc/ Experimental search engine\n\nShould be everything you need from there",
				"added": 1543747199
			}
		]
	},
	"comment_vote": {
		"15_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": 1,
		"209_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"674_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"41_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"210_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"5_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1": 1,
		"11_13Dnn8CFKa8NJLf4gxnJTp8sXqYqrA9U7L": 1,
		"363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1,
		"37_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"315_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"22_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1
	}
}