{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1566288245_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "If You intend to archive material, then I suggest that You use NilFS file system and mount the hard-disk in readonly mode. The NilFS is not suitable for multiuser scenarios, where the file system is mounted with write permission, because in those scenarios it, supposedly, has a security flaw that one user can access the files of another user. However, the NilFS never corrupts, to the extent that there is no fsck-tool for it, because that tool is just NOT NEEDED BY DESIGN. If You need write-access, want to run some P2P-system, then I suggest the ReiserFS. Yes, the original author, the Reiser, murdered his wife, but the ReiserFS is a collective effort and the tech is really good. It helps, if there is a root cron job that runs the sync command line tool every minute. ",
				"added": 1576091559
			}
		],
		"1571814102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "It's like with the nukes: You know that the other guy will build them anyway regardless of all \"treaties\", so You'll need to build them for Yourself too, just in case. What regards to the mass surveillance, then You can be pretty sure that the governments will do it anyway, even if it is in the form of a census. The only option is to mass-surveil back. Face recognition at private business entry doors to detect politicians, the whole works. That's the idea behind the \"free press\" or at least that's the advertised idea. The various artists and \"activists\" and lawyers are just too incapable of implementing proper technical solutions, hence the nonsense protests and other empty talk. By the way, politicians also wear cellphones that report to the cellphone network towers that a cellphone has entered the service area of the tower. That's how the network knows, where to redirect the incoming phone calls. Those quacks by the cellphones are in public space, just record them and there's a nice log about politicians. ",
				"added": 1576882424
			}
		],
		"1517334612_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "ZeroNet is my favorite. But \nhttps://bitmessage.org/\nis also nice.",
				"added": 1576882914
			}
		]
	},
	"comment_vote": {}
}