{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Мировые новости",
			"body": "Мировые новости",
			"added": 1515088753
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1LnwBwPzFoehJbbQ7tLn69Er478AZHknvA": [
			{
				"comment_id": 1,
				"body": "Названы пять простых способов замедлить старение.\n\nНобелевский лауреат озвучила советы по продлению жизни.\nБиолог Элизабет Блэкберн, которая является лауреатом Нобелевской премии, назвала пять простых способов замедлить старение, пишет Business Insider.\nУченая основывается на своей научной работе по теории старения вследствие укорачивания теломер в хромосомах.\nВ первую очередь, Блэкберн рекомендует справиться со стрессом. В своем исследовании она изучала поведение матерей, воспитывающих детей с аутизмом и другими хроническими заболеваниями. Отмечается, что у более стрессоустойчивых женщин теломеры укорачивались значительно медленнее.\nВо-вторых, специалист советует медитировать. По ее данным, люди, медитировавшие по 12 минут в день в течение двух месяцев, смогли замедлить изменение теломер.\nТакже Блэкберн считает важным больше общаться с соседями, вступить в брак и завести друга на всю жизнь. \nКроме того, биолог рекомендует зарабатывать деньги. Ее исследование показало, что у людей с более высокими доходами теломеры чаще бывают длиннее.\nРанее ученые выяснили, что периодическое умеренное голодание замедляет возрастные изменения.\n \nСекс назвали способом продления жизни",
				"added": 1515088954
			},
			{
				"comment_id": 2,
				"body": "четверг, 4 января 2018,  доллар США в ходе торгов на \"Московской бирже\" опустился ниже 57 рублей впервые с 16 октября 2017 года, сообщает агентство \"Интерфакс\". Курс американской валюты по состоянию на 18:51 по московскому времени составлял 56,97 рубля, что на 25 копеек ниже уровня закрытия предыдущих торгов.\n\nПри этом евро стоил 68,85 рубля, на 1 копейку больше, чем при закрытии торгов в среду. Позитивная динамика евро против рубля объясняется ростом единой европейской валюты к доллару США на мировом рынке Forex благодаря лучшим, чем ожидалось, данным об экономической активности в еврозоне.\n\nМежду тем цены на нефть в четверг практически не изменились, оставшись у самых высоких уровней за три года благодаря информации об очередном сокращении запасов топлива в Соединенных Штатах.\n\nНакануне Американский институт нефти (API) сообщил, что запасы нефти в США на прошлой неделе сократились на 5 миллионов баррелей. Данные министерства энергетики будут обнародованы позднее, однако эксперты прогнозируют, что официальная статистика укажет на снижение запасов на 4,7 миллиона баррелей.\n\nВ среду стоимость фьючерса на нефть марки Brent с поставкой в марте 2018 года в ходе торгов на бирже ICE в Лондоне превысила 68 долларов за баррель впервые с 13 мая 2015 года. В четверг стоимость мартовских фьючерсов составила 67,85 доллара за баррель.\n\nКак сообщалось ранее, на цены на нефть также повлияли крупнейшие с 2009 года протесты в Иране - третьем по величине производителе нефти ОПЕК. Мировому спросу на нефть также поспособствовали слабость доллара, ожидания глобального экономического роста и ледяной шторм, обрушившийся на США.\n\nПредыдущий рекорд цены на нефть был установлен в конце декабря после информации о взрыве нефтепровода в Ливии.",
				"added": 1515089259
			}
		]
	},
	"comment_vote": {}
}