{
	"title": "撒马利亚人",
	"description": "余生不用你指教了\n我自己瞎几把过吧",
	"links": "世界上没有老实人，所谓\n\n的老实人是用来欺骗像\n\n我这样老实的人！",
	"next_post_id": 14,
	"demo": false,
	"modified": 1503041778,
	"post": [
		{
			"post_id": 13,
			"title": "反对新纳粹和未来的言论自由表达",
			"date_published": 1503041756.733,
			"body": "　　在弗吉尼亚州夏洛茨维尔事件之后，GoDaddy 和 Google 以及 Cloudflare 相继宣布停止为新纳粹网站 Daily Stormer 提供服务。电子前哨基金会（EFF）[认为](https://www.eff.org/deeplinks/2017/08/fighting-neo-nazis-future-free-expression)，所有理性的人都应该反对仇恨性的暴力行为，但我们应该认识到，在互联网上，任何用于缄默新纳粹的策略未来都可能会用于对付其他人，包括我们赞同其观点的人。保护言论自由表达并不意味着我们对所有被保护的言论意见一致。保护言论自由是因为我们相信没有人能决定谁能说话谁无权说话。EFF 认为，GoDaddy、Google 和 Cloudflare 的做法是危险的，因为这些没有多少竞争对手的互联网中间商控制了太多的言论，其决定的后果将会对言论自由产生深远影响。如果域名注册服务商因为政治考虑而决定谁能注册，那么我们将会看到每一个政府和权力机构都会认为自己有着相等或更具有合法性的权力。"
		},
		{
			"post_id": 12,
			"title": "NSA 在新西兰非法监视 Kim Dotcom",
			"date_published": 1501657546.181,
			"body": "　　根据新西兰政府通讯安全局（GCSB）的文件，NSA [非法监视了](http://thehill.com/policy/cybersecurity/344742-nsa-unlawfully-surveiled-kim-dotcom-in-new-zealand) 文件共享网站 Megaupload 的创始人 Kim Dotcom。新西兰先驱报的[报道](http://www.nzherald.co.nz/index.cfm?objectid=11897719&ref=twitter)称，GCSB 告诉高等法院，它在 2012 年初停止了针对 Dotcom 的所有监控，但源自 Dotcom 的少量通信在其不知情下使用其技术继续遭到拦截。Dotcom 是在代号为 Operation Debut 的行动中遭到 NSA 和 GCSB 的监视，监视计划于 2012 年 1 月结束，但 NSA 继续利用了新西兰的技术监听 Dotcom 的通信。法院文件没有解释 NSA 是如何能在 GCSB 不知情下利用其间谍技术的。Megaupload 于 2012 年在新西兰和美国的联合执法行动中遭到关闭，美国要求引渡 Dotcom 到该国受审，而 Dotcom 正竭力阻止美国的引渡企图。"
		},
		{
			"post_id": 9,
			"title": "防火墙内中国互联网一片繁荣",
			"date_published": 1497245173.157,
			"body": "　　《华尔街日报》中文网前主编发表文章称，<a href=\"http://cn.wsj.com/gb/20170612/LLW112305.asp\" target=\"_blank\">在防火墙内中国互联网一片繁荣</a>。“尽管审查制度、保护主义和抄袭往往是提到中国科技公司时很多外国人首先联想到的事情，而且它们也无疑是很重要的因素，但了解中国互联网行业的关键在于跳出这些认知的条条框框来进行思考。”作者称，“中国确实对互联网进行严格审查。许多人对防火墙造成的生活和工作不便感到沮丧。不过，大多数中国人不关注他们无法访问的信息，因为国内网站绰绰有余地填补了这些空白... 即便外国应用程序被解封，中国竞争者也会获胜，因为使用中国应用的人已经非常多，这些产品已经变得不可或缺... 一旦一种技术或商业模式出现，中国人可以巧妙地让其适应本地市场，在中国，这被称为'微创新'。”"
		},
		{
			"post_id": 8,
			"title": "宫亚峰：走中国特色的网络治理之路",
			"date_published": 1497071145.439,
			"body": "　　2016年4月19日，习近平总书记在网络安全和信息化工作座谈会上首次提出中国特色社会主义治网之道，是以习近平同志为核心的党中央对网络空间治理理论和实践的重大创新，是中国特色社会主义社会治理体系的重要组成部分，是有效实施网络治理的方法论和建设网络强国的基本遵循。\n\n---\n\n　　网络和信息技术的高速发展使得“网络空间越来越成为信息传播的新渠道、生产生活的新空间、经济发展的新引擎、文化繁荣的新载体、社会治理的新平台、交流合作的新纽带、国家主权的新疆域”。网络空间所构成的虚拟社会悄然地渗透到我们生活的方方面面，改变着现实社会的传统形态和人们之间的相互关系。网络治理是信息技术发展给人类带来的新课题。其所面临的不仅仅是科学技术问题，而且涉及人类赖以生存和开展社会活动的网络空间命运共同体的一系列相关法律、规则、规范，以及环境、安全、管理等诸多领域的社会系统工程。网络治理是一个全球性课题，网络空间的治理水平直接考验我们人类的智慧。\n\n　　中国是一个互联网用户数量最多、应用最广泛、创新最活跃的网络大国，同时还存在技术基础薄弱、发展要求迫切、城乡差别明显等诸多的困难和问题。中国的网络治理势必要着眼先进科学技术发展的趋势，结合我国社会现实情况，发挥社会主义制度优势，走中国特色社会主义网络治理之道。\n\n　　坚持中国共产党的领导是中国特色网络治理的核心。中国社会发展的历史和经验证明，坚持共产党的领导，社会就进步、经济就发展、人民就幸福，离开或消弱党的领导就必然会走向反面。党的十八大明确提出建设富强、民主、文明、和谐的社会主义现代化国家，实现中华民族伟大复兴的奋斗目标，为我们实现网络强国战略指明了方向。党的十八届五中全会提出的创新、协调、绿色、开放、共享的发展理念，为中国特色的网络治理规律的把握提出了总要求。在党的领导下完善国家网信管理体制、政府职能部门、社会组织与社区、公民参与有机衔接、联动融合的网络空间安全治理体系是中国特色网络治理的组织保证。\n\n　　坚持以人民为中心的思想是中国特色网络治理的宗旨。“网络安全为人民，网络安全靠人民”是中国共产党人的一贯思想方法在网络治理实践中的延伸与发展。网络环境影响着人类的生存和社会活动，网络秩序关乎每个人的切身利益。习近平总书记指出“网络空间是亿万民众共同的精神家园。网络空间天朗气清、生态良好，符合人民利益。网络空间乌烟瘴气、生态恶化，不符合人民利益。”净化网络空间、维护网络安全、建立良好秩序是人民的期待和需求，各级党政机关领导干部要以人民的期待为己任、以人民的需求为目标，带领广大人民群众共同构建和维护良好的网络环境。\n\n　　坚持发展与安全相结合是中国特色网络治理的原则。习近平总书记“没有网络安全就没有国家安全，没有信息化就没有现代化”的精辟论断，深刻阐述了网络安全与信息化发展的辩证关系，充分说明安全是发展的前提，发展是安全的保障，安全和发展相辅相成，不可或缺，不能偏废。正确处理发展与安全的关系是网络治理的重要保证，必须坚持以发展促安全、以安全保发展的思想。大力发展信息网络为代表的先进科学技术，以信息化驱动现代化，实施国家大数据战略，推进“互联网+”行动计划，加快释放现代科技发展的巨大潜能。同时要加强国家网络安全监测防护能力建设，保护公民个人信息安全，保卫国家关键信息基础设施安全，保卫国家主权和政治安全，建久安之势、成长治之业。\n\n　　坚持开放合作与自主创新相结合是中国特色网络治理的基础。网络治理，中国离不开世界，世界也离不开中国。网络治理必须从人类文明、社会发展和全球战略等方面加强国际合作，要在《联合国宪章》框架指导下，在保证国家网络空间主权不受侵犯的基础上，与各主权国家平等协商建立网络空间资源、标准、规则、产品、产业、技术和打击网络犯罪等一系列法律框架及网络空间治理规则。在国际社会的合作和共同参与下，积极推进构建和平、安全、开放、合作的网络空间，建立多边、民主、透明的国际互联网治理体系，实现互联网资源共享、责任共担、合作共治。坚持开放合作不等于放弃自主创新，鼓励自主创新更不是反对开放合作。网络治理要处理好国家与国家、安全与发展、技术产业与网络生态等关系，必须突破关键核心技术的难题。关键核心技术是买不来、等不来的，要在基础技术、通用技术、非对称技术、“杀手锏”技术、前沿技术、颠覆性技术等方面加强自主创新，努力赶超世界先进水平，自强自立才能真正掌握我国网络治理的主导权，保证互联网技术、应用及管理健康发展造福人类。\n\n　　坚持法治与文化相结合是中国特色网络治理的艺术。互联网不是法外之地，依法治网、依法办网、依法上网，让互联网在法治轨道上健康运行是社会主义法治建设的重要体现。用法律明确网络主体的权利义务，规范网民的行为。坚决制止和打击利用网络鼓吹推翻国家政权、攻击破环国家关键信息基础设施、非法侵害利用他人信息等违法行为。中华民族在数千年的发展历程中所形成的优秀传统文化是人类文明成果的重要组成部分，社会主义核心价值观是社会主义核心价值体系的高度凝练和实践要求。坚持德法兼治，在加强法律刚性约束的同时，用社会主义核心价值观和人类优秀文明成果滋养人心、滋养社会，培育向上向善的网络文化，为广大网民营造风清气正、秩序井然的网络空间，使全社会形成为实现中华民族伟大复兴而奋斗的共同理想、共同目标、共同价值观。走中国特色的网络治理之路，为人类贡献东方智慧。（作者：中国互联网协会网络与信息安全工作委员会委员 宫亚峰）"
		},
		{
			"post_id": 7,
			"title": "Tor Browser 7.0 释出",
			"date_published": 1496917799.1,
			"body": "　　Tor Browser 团队宣布释出 7.0 版。Tor Browser 7.0 是基于最新的长期支持版 Firefox 52 ESR，最主要特性是多进程模式 e10s 和内容沙盒。Linux 和 macOS 版本默认启用了 e10s 和内容沙盒，但 Windows 版的内容沙盒还没有启用。此外，Linux 和 macOS 用户还可选择设置只通过 Unix Domain sockets 通信来进一步加固浏览器。Tor Browser 7.0 还有安全和隐私方面的进一步增强，Tor 0.3.0.7，Torbutton 1.9.7.3，Tor Launcher 0.2.12.2，HTTPS-Everywhere 5.2.17， NoScript 5.0.5，修正了大量 bug。"
		},
		{
			"post_id": 6,
			"title": "GnuPG 项目发起众筹",
			"date_published": 1496758072.707,
			"body": "　　PGP 加密软件的 GPL 替代 GnuPG 项目发起了<a href=\"https://gnupg.org/donate/\" target=\"_blank\">众筹活动</a>，目标是每月 15000 欧元，能资助三名全职开发者。活动页称，GnuPG 项目需要你的帮助！ GnuPG 项目由 Werner 在 1997 年发起，一度难以为继，只剩下一个人在维持，Werner 准备放弃之际发生了 Edward Snowden 事件，加密隐私工具再次引起了公众的关注，GnuPG 项目的上一次众筹活动取得了相当大的成绩，私人支持者捐赠了 25 万欧元，机构如 Stripe、Facebook 和 Linux 基金会承诺每年捐款 5 万欧元，此次众筹活动旨在保持一个较大团队的长期运作。"
		},
		{
			"post_id": 5,
			"title": "ZeroNet就不能随便找几个节点去镜像么",
			"date_published": 1496679230.159,
			"body": "　　反正一个网站也不大，新装的ZeroNet自动随机镜像几个站不是更好？"
		},
		{
			"post_id": 3,
			"title": "谁送我个Resilio Sync的专业版",
			"date_published": 1496562129.788,
			"body": "　　穷得买不起这货，好用来分享文件啊。"
		},
		{
			"post_id": 2,
			"title": "看到斗鱼上主播玩国外的游戏挂VPN的Ping值很高",
			"date_published": 1496423182.503,
			"body": "　　有什么办法能针对游戏优化VPN网络质量？\n\n　　感觉网易的UU加速器不错！"
		}
	]
}