{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "A Life-or-Death Election",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt/An+Open+Letter+to+All+Elected+Officials+in+the+United+States+Government \n\nThe special post is shared on the ZeroNet site Make America Great Again \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/  \n\nWith the title slightly adjusted to be:\nAn Open Letter by Awakened American to All Elected Officials \n\nIt's one of the best articles ever posted on Zeronet! \n\n**Hong Kong has been downgraded from Rule of Law to total jungle dictatorship by the Atheism Gang, simply due to lack of Gun Rights system to protect the fundamental justice of society. **\n\nIf there're NOT the constitutional system focused on Gun Rights to protect human rights, in the eyes of some cruel politicians like Hitler or Stalin, **those printed votes could be easily tramped and crushed, just like scraps of paper! **\n\n## The Universal Principle ##\nThe fundamental system with Gun Rights to protect human rights, is the soul of American vitality.  It'd be taken as the Universal Principle.  Only based on this universal principle, can the so-called universal value of Democracy and Rule of Law have some significant meaning! \n\nTake a look at the former administration of Obama-Hillary government. They often mention democracy, human rights with very good oral eloquence, but some of those politicians in fact have betrayed America.  Whether they'd be punished as crimes of treason against America, depends on the strength of justice by the majorities of American people awakened up by the facts.  \n\n“The only thing necessary for the triumph of evil is for good men to do nothing.”\n— Edmund Burke \n\nIn traditional election events, the two candidates were opponents in a common game of competition.  The 2020 Election is much different. \n**It's a life-or-death battle, with the defeated candidate highly possible to be charged with crimes of treason against America, and sent to jail by people's demand on constitutional justice. **\n\nVarious phenomena show that American people refuse to be deceived by the voter fraud crimes, instead of being silenced, they firmly demand justice and transparency on the 2020 Election, **an unprecedentedly-fierce battle between right and wrong, good and evil! ** \n\nThe 2020 Election is a Life-or-Death Election. It's not just a game between politicians. **It's a battle that concerns the fundamental security issue — whether the Constitutional System of America's Liberty can long endure or not!  ** ",
			"added": 1605421911
		},
		{
			"topic_id": 2,
			"title": "An Eternal Glory of Speech",
			"body": "## An Eternal Glory of Speech — Abraham Lincoln's Gettysburg Address \n\nFour score and seven years ago our fathers brought forth ,on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\n八十七年前，我们的先辈在这个大陆上创建了一个新国家 — 她在自由的愿望中孕育产生，她奉行一切人生来平等的原则。\nNow we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that nation might live. It is altogether fitting and proper that we should do this.\n现在，我们正在进行一场伟大的内战，这是对我们国家的考验，也是对任何一个孕育于自由并奉行上述原则的国家能否长久存在下去的考验。\n今天，我们在这场战争中的一个伟大的战场上集会。为了使这个国家继续存在下去，烈士们滴尽了最后一滴血。\n现在，我们在这里，是为了把这个战场的一部分奉献给他们，作为他们最后的安息之地。我们理应这样做，这也是恰当的。\nBut, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. The world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that **government of the people, by the people, for the people, shall not perish from the earth.**\n但是，从更广泛的意义上来说，这块土地我们既无权奉献，也无法把这块土地神圣化。\n因为，曾在这儿浴血奋战过的勇士们，活着的和倒下的，已经把她神圣化了，这份神圣远不是我们的微薄之躯所能增减。\n今后，全世界将很少注意到，也很难长久记住我们今天在这里所说的话，但是，勇士们在这里的所作所为永远都不会被忘记。\n我们这些尚活在人世的人们，应该忘我地工作，致力于勇士们未竟的崇高事业。我们应该竭尽所能去完成摆在我们面前的伟大任务。希望在这里，我们能从光荣的烈士们身上汲取更多的献身精神，来完成他们为之献出生命的事业。希望在这里，我们能够下定最大的决心，不让他们白白牺牲；\n希望我们能使国家在上帝的赐福中得到自由的新生，**让这个民有、民治、民享的政府永世长存！**\n\nRemarks:\n百度上面所流行的汉语版本\nhttps://baike.baidu.com/item/%E8%91%9B%E5%BA%95%E6%96%AF%E5%A0%A1%E6%BC%94%E8%AF%B4/9524243 \n只是字面上传达了部分意思，但是不够有力量。\n海外网友整理的上述版本，更符合原文经典所包含的简洁、有力的灵魂力量！\n(原文才272个单词，是有史以来最简短、最有力量的演说！）",
			"added": 1605423334
		},
		{
			"topic_id": 3,
			"title": "Taiwan Redefinition — a key to Trumpism Revolution",
			"body": "The major feature of Trumpism Revolution is a total change of conventional political mentality since the fall of former Soviet Union, by clearly indicating that the atheism regime in mainland, China is the most serious threat against America and the whole civilization of the planet! \n\nBefore the coronavirus crisis, Donald Trump in fact mainly cared about the materiel interest, as manifested in many trade negotiations. \n\nAfter the Covid19 outbreak, Donald Trump gradually realized that an all-around conflict with the atheism gang of the FAKE CCP is inevitable.  \n\nThen after the nationwide voters fraud crimes occurred in the 2020 election, besides Donald Trump, the majority of American people began to see how terribly America has been infiltrated by the atheism culture pollution!\n\nDuring the cold war time, in order to better fight against the former Soviet Union, an **ambiguous strategy** was adopted by the USA on the definition of China — it's not an important matter whether it'd be represented by Republic of China (中华民国) that respects the modern civilization based on Three Principles Of The People as advocated by Dr. Sun Yat-sen, or by Communism Dictatorship China which boasted itself to be a \"People's Republic of China\", but in fact tramped upon human rights like ants, and should better be defined as an atheism dictatorship jungle,  or at least NOT a republic, as could be seen by more and more people. \n\nIt's a special stage of history now. The 2020 Election is a life-or-death battle that concerns the fundamental security issue of America — whether the Constitutional System of America's Liberty can long endure or not!  \n\nThe Supreme Court rejected the lawsuit launched by Texas state. Marathon style lawsuit is part of the unrestricted warfare. \n\nIt requires long term efforts to Make America Great Again. In order to ensure that the bright course not be destroyed by other politicians who stole the election, now it's time to redefine Taiwan, or redefine China, by clearly stating that \n## **Taiwan represents the Republic of China; that America encourages a peaceful reunification of China based on the Three Principles Of The People as represented by Republic of China.  The Constitutional Democracy inherited by ROC was also firmly pursued by many Red Noblemen. One prominent example is Xi Zhong Xun, who was the father of Emperor Xi Ji Pin. **\n\nA clear clarification on the definition of Taiwan or Republic of China will help protect the fruitful results by many people's efforts under Trump administration in the past few years.  \n\nWith the clear redefinition done, if the 2020 Election would not be stolen by distorted means, then formal diplomatic relations could be prepared at the next stage.  Or even if there are too many obstacles on the way ahead, the clear clarification on Taiwan's representation of the Republic of China can help **reduce the corruptive maneuver space by other politicians** who tend to betray America secretly. \n\nWith the international structure justified, **the domestic battle to resume Rule of Law in America will see less obstacles** on the road ahead.",
			"added": 1608215531
		},
		{
			"topic_id": 4,
			"title": "Trumpism Revolution — Australia Leads the Tide!",
			"body": "Australia's counterattack against the atheism regime in China has produced very significant impact — electricity shut down in many cities has paralyzed **millions of surveillance cameras!**  The special phenomena show even **more shocking effect than the trade war** launched by Donald Trump, which mainly obstructed the expansion of the atheism gang's pollution on long term basis. \n\nThrough the global dynamic efforts, **the most terrible power grid failure is highly possible to trigger a large political crisis in 2021**, to transform the atheism dictatorship land into a modern civilization that respects God! \n\nThe **special effect** produced by Australia's counterattack may be **NOT seen by Trump Administration well enough**.  \n\n##To all people who care about 2020 Election:\nPlease present the message to more people who care about **a Great America, or a civilized East Asia that accommodates justice, democracy, and freedom to worship God! **\n\nBesides strengthening the current strategy, the best tactic by Trump Administration should be focused on further enhancing all allies' tough tactics against the atheism gang, to win the Unrestricted War and embrace a new America! \n\n\nRemarks:\nIn East Asia, the situation becomes very severe after a series of special crises. In early 2020, Mr Ren Zhi Qiang was jailed for his criticism of Emperor Xi; then in late 2020, the world-famous former CEO of Alibaba Jack Ma was jailed, just due to his over-pride which resulted in Jack's satirical criticism of Chinese system\nhttps://posts.careerengine.us/p/5f959a4a9210f13fd81feb51 \n中国金融没有系统性风险，因为“没有系统”\n(**There're no systematic risks in China, since there doesn't exist any System at all.**) \n\nSuch criticism is certainly correct. However, the more important point is that, **the way to fight back by criticism is WRONG**.  The jungle system doesn't deserve any criticism at all. \n## The situation should be changed by action, not by criticism.\n",
			"added": 1609604885
		},
		{
			"topic_id": 5,
			"title": "Emancipation of mind — 1st step of American Revolution!",
			"body": "##Emancipation of mind — American Revolution \n— Restoration of American Constitution \n\nNo intervention of politics by military? There can be some **dangerous traps of mindset** by the distorted medias. \n  \nThe long tradition that **military people should not interfere with politics** is based on some prerequisite conditions:\n1) Those politicians themselves should **respect the principle of justice and transparency**;\n2) At least there're **NO crimes of treason against their motherland**, involved on any of those president candidates.\n\nThe special republic system is itself built by great military warriors 200 years ago, with military troops formed mainly by the Protestants who refuse the feudal system of semi-slavery dictatorship by British monarchs. \n\nThe American Federation was built by the forefathers such as Washington, Jefferson, etc., **at tremendous sacrifice of many people's blood and tears**.  At the early stage of the republic, those politicians certainly needn't worry about crimes of treason among any of them, despite so many deviations on the ruling and management of the republic, since the republic is an inseparable part of their life. Such patriotic sentiment is the same among all the people who fought brilliantly for the independence of America! \n\nNo matter how many disputes or arguments occurred at Capitol Hill 200 years ago, no one could imagine that any of the president candidates might be involved with crimes of treason against America!  \n\nToday's situation is totally different. \nIt's simple mathematics work to see that there exists huge scale of voters fraud! \n\n\"Simple Math\" Shows Biden Claims 13 MILLION More Votes Than There Were Eligible Voters Who Voted in 2020 Election \nhttps://www.thegatewaypundit.com/2020/12/breaking-huge-simple-math-shows-biden-claims-13-million-votes-eligible-voters-voted-2020-election/ \n\nBesides the unshakable evidence, there're many other phenomenal facts that can mutually prove each other as logical evidences. \nJoe Biden says he's built most extensive \"voter fraud\" org in history  \nhttps://www.youtube.com/watch?v=WGRnhBmHYN0  \n\nFurthermore, there're tons of other evidences gathered up by so many American citizens that are enough to further prove the huge voters fraud, such as data manipulation, manmade malfunction by Dominion voting systems. \n\nBased on the large scale of abnormal facts and phenomena, the default prerequisite conditions that military people should not interfere politics don't exist, since the 2020 Election dispute is not an ordinary domestic political dispute, it's a special war against America, launched by some corruptive American politicians in secret collusion with foreign powers, with the most vicious purpose to overturn **American Constitution**! \n\nIt's a special type of **Unrestricted Warfare**, which was launched much earlier than the election event in November, with the coronavirus pandemics taken as a special weapon to cause chaos in American politics and society. \n\nAt such special stage of history, with unprecedented means of **Unrestricted Warfare** that has infiltrated American society seriously, accompanied by crazy coronavirus spreading to many places of the United States, if American people are still misled by some hypocrite politicians or vicious journalists that **the 2020 Election dispute is just an ordinary domestic issue, and that military people should not interfere politics,  then the entire system of American Constitution may be totally eroded by the corruptive and crazy devils** who have seriously polluted the purified land of America, which was once the most glorious free beacon on the planet!  \n\nAs a speculative merchant, Donald Trump may be good at bankruptcy operation of corporation management in order to maximize the commercial interest.  But **American Constitution** should not be run with bankruptcy speculation. \n\nIn short, for American people, there's no way to retreat further.  If **American Constitution** can be easily insulted or overturned by a large scale voter fraud, and those military people don't take it as a dangerous war, but **simply take it as a small political joke that military should not interfere, then there will be many more disasters to occur on the land of USA …  **\n\nDonald Trump once said that if he failed, then \"China\" would own the United States.  There're some mistakes in Donald Trump's outlook on the world, which should better be rectified, so as to fight back the Unrestricted War more efficiently.  \n\nAs can be seen by many people, in East Asia, the so-called \"People's Republic of China\" is NOT a republic at all, it treated Chinese people like ants, and poisoned American people like mice. It should better be defined as an atheism dictatorship jungle, but **NEVER as a republic**. The traditional sense of \"China\" often refers to Republic of China, as represented by Taiwan.  **The \"Republic of China\" never keeps any vicious purpose to own, occupy the territory of America's land, or to  poison American people or pollute America's society**. \n\nSo there's no way to retreat for American people. Instead, they'd fight back, by uniting up both ordinary citizens and military people, since it's a **special war — an Unrestricted War**, NOT just a small domestic political dispute on the 2020 Election! \n\nBoth Donald Trump and Joe Biden are speculative politicians, not perfect choices as president candidates.  \nCompared with other politicians for the time being, the best advantage of Donald Trump is that there're **no treason crimes against America**, despite so many faults and mistakes committed by Trump. \n\n\nIvanka Trump once boasted that her father Donald Trump was a great warrior. \n\n**If they don't want to insult the honor of a warrior, or humiliate the centuries-long glory of America's Constitution, an effective counterattack should be launched in January, to punish those betrayers of the federal republic. ** ",
			"added": 1610043287
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"3_139mS7MVsytiqfvLcqkb4S1VKqDMhCXs8n": [
			{
				"comment_id": 1,
				"body": "to discuss further ...",
				"added": 1610041880
			}
		]
	},
	"comment_vote": {}
}