{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1592713044,
			"title": "Полезные ссылки для трансгуманиста",
			"body": "http://127.0.0.1:43110/18PBe5GZDAcJQ32Q85N7G6sU1L4VKZ6PDL/\nЧлены фракции Трансгуманистов движения \"Гражданское Общество\" (https://civsoc.net) запили сборник полезных ссылок, я перенес их в zero.net (надеюсь они не будут против). Сборник обновляется, но не знаю буду ли обновлять его здесь, но даже в таком состоянии там очень много интересного, кстати, рекомендую вступить через @transhumanist_bot, если вы поддерживаете ценности фракции (заодно сможете докинуть полезных ссылок в сборник).",
			"added": 1592713043
		}
	],
	"topic_vote": {
		"1_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": 1,
		"4_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"10_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"1_1MR3MSi8wAjrMmZ795tYqbgaZ3dmbXGgh7": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1MR3MSi8wAjrMmZ795tYqbgaZ3dmbXGgh7": [
			{
				"comment_id": 1,
				"body": "Вообще, если хочется чего-то необычного, то стоит посмотреть в сторону восточного кинематографа. Я сейчас назову довольно знаменитые представителей этого направления, но буду надеяться, что вам еще не довелось их глянуть. Начну с картин Акиры Куросавы, например, не слабо удивившая меня в свое время \"Тень воина\". Огромный масштаб и проработка декораций. Для меня это был первый самурайский боевик(если фильм можно отнести к этому жанру), что вкупе с выше сказанным дало очень необычный опыт. \nНо не стоит зацикливаться на японском кино, есть еще более непредсказуемая вещь - кинематограф южной Кореи. Вот тут точно кладезь гениев. Лично мне больше всего нравится Пак Чхан Ук. Я долго откладывал Олдбоя и зря. Отличная режиссура и необычный сюжет, это до сих пор заставляет меня иногда пересматривать этот фильм снова. \nНу направление я задал, дальше все делается довольно легко, для начала можно пройтись по указанным режиссерам, а потом просто перейти на похожие фильмы. \n\nА еще просто советую старые фильмы глянуть, довольно необычное ощущения. (например, Мост через реку Квай или 55 дней в Пекине)",
				"added": 1572917628
			}
		],
		"4_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 2,
				"body": "Ну у нас есть это ( http://127.0.0.1:43110/ZeroTorrent.bit/ ), правда реализация не очень, но думаю, если зеронет популярней станет, то только вопрос времени, когда здесь появится хороший руязычный трекер.",
				"added": 1573154062
			}
		]
	},
	"comment_vote": {
		"1_1MMpsjj9iNC5JT9usW8tatHvcY8QAAhP6": 1,
		"14_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"67_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"2_1Jtas1e392Kx9sfvZKnCQR8HMH7gcJ1FpW": 1,
		"23_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": 1,
		"65_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	}
}