{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 1,
				"body": "I agree.  Mobile devices are rather popular ;) Torrents on such devices are not a good idea.  There should be a solution that allows users on mobile to use the system without eating up all of their data.\n\nI'm not sure the proper way to go about it, but from an end user perspective it would be nice if it disabled seeding when not on wifi?\n\nOr another method I've been considering is running a private clearnet proxy at home, just for me.  Then I can use a VPN from the phone to home, and access ZeroNet without using phone data for torrents.",
				"added": 1528753961
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_1_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I have an unlimited data plan. I'll torrent all month if I want to. All that I lose is prioritization after 22GB. The bigger issue is scheduling and bandwidth throttling ZeroNet to not interfere with other apps using bandwidth.\n\nBandwidth on mobile devices is generally more expensive than bandwidth at home, work, or on a dedicated server.\n\nMobile devices are also limited by their batteries, apps that are constantly using bandwidth seem to be a drain on the battery.\n\nI do not believe that in the current state, ZeroNet is a good match for mobile devices unless they are using a clearweb proxy or used in a static location with power and wifi.\n\nDo you disagree?  How long can you seed on your phone before the battery dies?",
				"added": 1528816527
			}
		],
		"1528703264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 2,
				"body": "I believe that *optional* content filtering is something that would be of benefit to ZeroNet.  I also believe that a Web of Trust model could be leveraged to provide a wealth of options to ZeroNet, one of which being optional content filtering.",
				"added": 1528754161
			},
			{
				"comment_id": 3,
				"body": "> [thunder33345](#comment_3_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): yep as soon as \"optional\" became mandatory it's no longer called content filter but censorship\n\nCorrect.  Fortunately on ZeroNet it doesn't matter if someone creates something you dislike.  Even filtering that is perceived as \"mandatory\".  Just don't use that system or those zites.  Free speech advocates like yourself can and will make a place for the speech they enjoy and ZeroNet is resilient enough to support multiple mutually-exclusive opinions on filtering.\n\nWith a WoT (web of trust) multiple mutually exclusive opinions on content and users can exist simultaneously and users can opt to see only content trusted by people they trust or not.  (potentially)\n\nPotentially the WoT might be able to have users flag zites with community generated tags (like Steam does) and regardless of whether users spam/flood the WoT, the content can still be useful based on how much users trust or distrust the individuals.\n\nWin/win IMO.\n\nIf you're here for puppies and hate kittens, a WoT could help you avoid seeing kittens and help you see more puppies.\n\nIt could also help people determine if they want to agree to an online transaction with someone they've never had interaction with.\n\nIt could also really help with search, and zites for search could trust and or distrust users to flag zites appropriately.  A search zite could spring up that is weighted towards puppies, and another could spring up that is weighted towards kittens.  If we can work together and accurately label content it would be of benefit to everyone regardless of our stances on the content in question.\n\nIt could help users avoid what they deem as \"garbage\" content by whichever metrics they choose to be \"garbage\".  I don't really see a drawback to it other than:\n\n* A WoT zite might not be trusted, so having protocol that enables users to host their own trust dbs adhering to a specific format might be handy.  The WoT site should be FOSS and/or able to be cloned, so that if there is a trust issue with the zite owner, others can spring up without effort and \"merger\" (or something) the end user trust dbs.\n\n* It would have to be implemented and that takes time and effort.\n\nThoughts?\n\nHow else could ZeroNet benefit from a FOSS, decentralized, distributed, clonable, WoT?",
				"added": 1528815590
			},
			{
				"comment_id": 5,
				"body": "> [thunder33345](#comment_4_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K):  it's still kinda up to site to allow/enable WOT support\n\nI'm thinking, potentially wrongly, that it could be done independent of support by the zites and users being trusted or untrusted.\n\nIt would be nice if in my user's trust db (hosted on my personal zite or something) could include a trust value for \"Unlimit Talk\"'s URL of http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh\n\nThat zite wouldn't need anything special in order for me to trust or distrust it.  It should be able to be done in a manner that allows users the freedom to \"thumbs up\" or \"thumbs down\" content without the consent of the content creator.  But it should also not be a plurality, if possible.  There could (and maybe I'm just too head-in-the-clouds here), but there could be a way for a user to say that \"Unlimit Talk\" is both flagged by me in my personally controlled db, as both \"puppies\" as well as \"kittens\" and \"apples\" but not \"oranges\", etc.\n\nIf it relies on specific zite support, it will not be a useful curation tool.",
				"added": 1528819761
			},
			{
				"comment_id": 6,
				"body": "Addendum to last post:\n\nA WoT zite that was FOSS could act as a content curation gateway and read user's trust db.  This wouldn't need any changes to how ZeroNet works since everything would be zites.  No mandatory anything.\n\nIf the WoT zite that was the defacto standard became untrusted by the userbase, another one adhering to the same db standard could be cloned.",
				"added": 1528820425
			},
			{
				"comment_id": 7,
				"body": "Oh, you mean embedding it in the curation zite?  The problem there, IMO, is that if the curation zite is not to be trusted, then we can't trust the user data stored there.  Users should store their own data independently of the curation gateway.  That should allow us to move from an untrusted WoT zite to a trusted one without losing the community curation data, and still being able to trust that our trust level of their trust data is accurate.",
				"added": 1528821578
			},
			{
				"comment_id": 8,
				"body": "Or are you suggesting that the zite that is being trusted/untrusted host the db that says they are trusted or not?  If a zite is untrusted would you really trust it enough to say that it was untrusted?  Users really should be the ones in control of their own trust DBs, not zites.",
				"added": 1528822566
			},
			{
				"comment_id": 9,
				"body": "> [thunder33345](#comment_6_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): the data can be trusted because it will be signed by the address you trusted, if it isnt, the file is automatically invalidatedif we are still following, a \"trust\" is just something like thisi tell my friends i trust bob a lot, he's a good and honest guy that you all should do business with him if you cansay my friend is alice, carol, daniel [...]\n\nThat makes sense.  What about the event where the zite owner is intentionally a jerk, and deletes the trust dbs?  Shouldn't they be controlled by the users to prevent this?",
				"added": 1528834132
			}
		]
	},
	"comment_vote": {}
}