{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 1,
				"body": "This may be a bit naive or ignorant, but i think too much bias in philosophy causes false perspectives, i think that we need to remember that any philosophy begins with thoughts of one person. People think about things based on their own perception, even if they try to remove their bias. This bias can be hard to see far off on the logical chain especially if and when things change. For example imagine someone knows nothing about philosophy and someone says: \"This statement is true, i think therefore i am\". I will call the ignorant philosopher Person A, and the informed philosopher Person B.  The first barrier is language, given no additional information, Person A must have the same understanding of all rules that apply to the statement as Person B including definition, context, grammar, punctuation, intent, origin, and many other factors. If any of these fail the statement is not fully understood and has the potential to carry false perception into later statements. To make this a bit more understandable , lets add another variable to person A. Person A is a christian, In their pursuit of god they come across EX- 3:14 which states that the name of god will forever be \"I am\" (though there are many variations of the exact phrasing of this such as i am that i am, or i am who i am) Person A now enters into this debate with a bias that could turn this statement into something like \" i think therefore god\" . Now lets say person B is Buddhist. If unchecked something like this could evolve into a situation in which Person A tells person C \"Buddhists believe that their thoughts create god\". I'm sure i don't have to explain how dangerous situations like this can be. What this means to me, and to answer your question about morals is that things become more obscure the farther down a logical chain you get blurring the lines between right and wrong. What it really boils down to is situations like this adding up and causing fear. IMO this is seen in many forms of Christianity where fear prevents the correction of these statements. Statements such as \"if you don't accept Jesus as your lord and savior then you will go to hell\" coupled with ideas of hell similar to Dante's inferno result in what i would call terrorism.",
				"added": 1542306958
			}
		]
	},
	"comment_vote": {}
}