{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1552021464,
			"title": "So...How keep an eye on your IP?",
			"body": "How keep eye on IP through Zeronets Tor connecsion like check.torproject.org?",
			"added": 1552021463
		}
	],
	"topic_vote": {},
	"next_comment_id": 29,
	"comment": {
		"1552021464_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW": [
			{
				"comment_id": 1,
				"body": "nevr mind I figure out http://127.0.0.1:43110/Stats",
				"added": 1552025276
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 2,
				"body": "What's sad is you caring what other people are doing to fill their free time. Some 115ish years ago people would complain about men reading newspapers on the trolley instead of talking to each other. Thousands of years ago people were complaining about the youngens writing on paper and losing the ability to work on stone tablets.\n\nIt's just you trying to hold on to what is going the way of the dodo...20 years from now we very well could never have to actually see each other in order to touch and some dumb fuck on the street corner, by themselves, are gonna claim it's sad that they cant grope anyone anymore.",
				"added": 1555008727
			},
			{
				"comment_id": 3,
				"body": "> [quantumworld](#comment_365_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): They are all being controlled secretly by central authority. Do not wake them from there sleep or they will be required to think again.\n\nDon't go trying to claim we're the ones asleep when you can't even use the correct \"their/there/they're\", boomer.\nAnd for being so \"asleep\" we don't tune into what has traditionally been used to keep people \"asleep\" to begin with...PRIMARILY NEWSPAPERS AND BOOKS. At lease with mobile devices I can chat it up with a group of hundreds of people smelling the bullshit instead of watching a screen of sheep agreeing with each other or reading the words of a faceless ideologue with a gun to his head, typing whatever is required of them.\n>If so called \"future\" gone wrong it's better to go to past and choose different way.\nDoomed to repeat the failures of the past because you're stuck in it...\n\n\nALSO : for people so against the MEDIUM (phone) you sure as hell don't have any issue being here on Zeronet using a COMPUTER (which your phone is anyway). Back to the Sheep-papers with you hypocritical, contradictory lot...",
				"added": 1555182251
			},
			{
				"comment_id": 4,
				"body": "> [quantumworld](#comment_368_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Clearly you have broken with central command authority. Please stare at your phone more and do not question anything we tell you.\n\nAnd you clearly don't understand English well enough to notice your contradictory opening...hard to break with something and still be aligned with it. Furthermore, I'm of the edge of your boom generation and X, so I don't glom onto my Phone like BOOMERS do as they scream about their kids following their example, all the while their children have better control habits overall.\n\nInstead of trying to insinuate that the tool is creating the shed, or that the carpenter lacks skill to stop building on  the ground incorrectly, look at the person directing the building and if THEY lack the experience to direct...old fucks constantly and consistently suggest going back to the days of old where the exact same activities (\"you damn kids and your CD/Cassettes/Radios/Land Line Phone/Jitterbug Dancing/Automobile/NEWSPAPER/PENS/etc\" ad nauseam).\n\nIn short it's not the phone or computer or anything else that is the problem IT'S THE GOD DAMN PARENTS. I don't sit in front of my phone because I had other shit to deal with when I was growing. Kids today have less outdoor options that don't require some ungodly amount of money to participate in, and others that have stipulations (namely parks) where they can be ejected simply for not being old enough and/or not being with a guardian because people are so unnecessarily worried about them getting hurt or kidnapped. Stuff em indoors for 10 years...and then complain that all they want to do to get away from your stupid ass is read the messages from the friend they can't go visit.",
				"added": 1555238729
			},
			{
				"comment_id": 5,
				"body": "Anyone notice how this entire thread s predicated on the phone and not what is on it?\n\n>I see people glued to them everyday. It is very sad.\n\nSo it would be sad if they were reading a book on that screen instead of carrying around a wad of heavy paper that can be damaged, right?\n\nConversing with someone they have no time to see anymore because of the far more pressing issue of excessive work and diminished time to be in the presence of people we actually care about?\n\nFuck these kids for staring into their phones because their best friend went to a school 600km away and scheduling prevents calling at times of the day that make sense, or their limited access to cost-prohibitive and/or socially decried outdoor activities...\n\n...SO SAD. What's sad is the shallow thought pool on ZeroTalk, where people are on about the top layer of an issue instead of digging deeper because they're more into virtue signaling instead of doing that thing they think people staring into phones aren't doing.....T H I N K I N G (primarily Quantum...grow your brain using a phone app, you clearly don't use books)",
				"added": 1555239700
			},
			{
				"comment_id": 6,
				"body": "> [blazingeye](#comment_10_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Do you read what people write here? It's not about \"let's go to live in cave as primal society\". It's about wrong ways. Nobody here claimed computer or phone is bad.\n\n>I see people glued to them everyday. It is very sad.\nSad = bad. Get real, dude. And yes, I clearly have read anything anyone else has said here because at least half of them automatically attributed people being in their phones as a sign of degeneracy...ya know, BAD.\n\nLastly : \n>It's not about \"let's go to live in cave as primal society\".\n\n>> [blazingeye](#comment_9_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): If so called \"future\" gone wrong it's better to go to past and choose different way.\n\nDon't forget you suggested it yourself...",
				"added": 1555326822
			},
			{
				"comment_id": 8,
				"body": "> [blazingeye](#comment_12_16eEwa5Fc9xKJWFQHBb9yNXPSmvuAu8aKd): Then you are trying to substitude words just to blame everyone for nothing. [...]\n\nSo I'm a liar because you don't know how to assert context to your own empty usage of a word?\nYou're not even using \"lair\" correctly...how about you take your ass to these books and paper sheets you're so gungho about and learn what \"context\" and \"critical thinking\" are before you start asserting that people being enamored with something more interesting than what you like are sheep...",
				"added": 1555403027
			},
			{
				"comment_id": 10,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_4_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): It's not about the mediums [...]\n...SO WHY NOT POST \n>WILL THE WORLD KILL US\ninstead of trying to suggest phones will kill us? It's because OP was an anti-tech twat, just like >[blazingeye] and >[quantumworld] since they're not well enough in their heads to start their argument from that point to begin with, and continue on about the phone regardless of it not being the object of their displeasure. And now we have you suggesting that it's not the phones that OP was talking about, but how its something to do with not thinking...\n\n> [shitnotworking](#comment_5_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Anyone notice how this entire threads predicated on the phone AND NOT WHAT IS ON IT? [...]\n\n\"AND NOT WHAT IS ON IT\". You can't sit here and strawman that Social Media doesn't assist/allow/promote in thinking about important (personally or externally) issues just because you have a narrow/biased view of it and the medium it's being viewed on. \n\nOP already fell into that stupid trap by suggesting that it's \"SAD\" to be looking at the phone without even establishing what anyone could be looking at/talking to (and **blazing doubled down on thinking 'SAD IS NOT BAD\" as if SAD has ever been used for anything else, the fucking retard...** ). \n\nThen, someone else (you) inserted Social Media as what is on the phone (still an assumption, mind you) **PREDICATED ON ABSOLUTELY NOTHING OTHER THAN HAVING THE PHONE....**\n\nYa know...I get this feeling that the lot of you are the issue, and not the phone. I have 2 phones : neither of which I use for anything other than listening to music or (the 2nd one) for minor communication. BUT IF YOU FUCKS SAW ME WITH IT OUT ON THE TUBE SOMEWHERE : >sad; it's gonna kill us.\n\nFUCK. SAKE.",
				"added": 1555405163
			},
			{
				"comment_id": 11,
				"body": "> [quantumworld](#comment_380_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I am not anti technology.  I am anti Stupid technology. Big difference. The smart spy phone is one of those inventions that will be stopped or there will be a technology Cival war against such devices. As Joseph Gerbal says. \"You should have nothing to hide.!\" I hate Nazi's and will always be that way.\n\n1 - Has nothing to do with Nazi's and as such I'm going to invoke Godwin's Law here...and quite frankly any spying they did was par for the course elsewhere, and still didn't use high technology for the hyper-censored society that they created.\n\n2 - There is no difference...you're still sitting butt-clinched on the notion that the phone by default is stupid simply because you can't figure out how to prevent it from having the ability to spy on you, as if you can't comb through a custom ROM to disable those features, use a Dumb Phone / Flip Phone (Pre-Android) that have minimal ability to be spied on internally, or to know about efforts to create phones impossible or excessively hard to spy on (Purism's Librem 5).\n\nPhones aren't stupid, the people using them to relay sensitive information are stupid. And doubly subjective is what is and isn't sensitive, because half the people around these parts are chicken-with-head-cut-off over a corporation knowing typical shit like their age, marriage status, and leisure interests that is relayed publicly and has been done since long before Smartphones existed and the other half will have their heads on a chopping block if they don't secure certain information like their political beliefs, sexual orientation, or affiliations with less than savory groups/hobbies... >>> you won't see that 2nd group around here bitching about THE PHONE or its use as a spying tool, they'll continue being worried about the idiot on the other side listening in and whoever has his leash because they're not going to stop snooping even if the phone magically stops being a tool to spy with...",
				"added": 1555423338
			},
			{
				"comment_id": 12,
				"body": "> [geekosan](#comment_11_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4): You are right about that. Phones are not stupid, and they know where you live.\n\nWhich is worse tho : your parents knowing where you live or a phone that like everything else in your house (Gas, Electric, etc) is tied to where you live...?\n\nYour parents know far more damaging things about you than Facebook Mobile...or at least they SHOULD. :<",
				"added": 1555515206
			}
		],
		"1555389717_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": [
			{
				"comment_id": 7,
				"body": "Wish we could downvote shit...2 years since the last commit.",
				"added": 1555402877
			}
		],
		"1555194783_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "> [duck0](#comment_23_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): \"Social media\" should be limited to self destructing time periods of shit posting.  Maybe a day, week, month? Possibility of archiving a period and restarting.  [...]\n\nSo a recap? A highlight reel?\n\nI'm sure those wouldn't just be manipulated to suggest that everything was perfect or anything, if that is in fact the suggestion you're making.",
				"added": 1555404968
			}
		],
		"1555844108_19r2tS5GqeMQnxmyPq9ufD79LXoMVDszDU": [
			{
				"comment_id": 13,
				"body": "> [1pgallery](#comment_64_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE): only if you know what you are doing, which pretty much means \"no\", I don't trust my computer to be untampered with and I certainly don't trust my grandma's computer to be free of malware.\n\nUse a live CD/USB.",
				"added": 1555858738
			},
			{
				"comment_id": 14,
				"body": "> [ztz](#comment_8_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): the #blockchain meme is not for actual use cases [...]\n\nA blockchain is a ledger of transactions. Banks use ledgers, but they're slowAF and not up to snuff digitally (See: SWIFT, who are also developing their own Blockchain).\n\nNeedless to say it's stupid to claim that a bank with a ledger wants to use a digitally distributed ledger that cuts down on transaction costs (excluding Bitcoin, apparently) that also happens to be similar to what they already use...",
				"added": 1555880234
			},
			{
				"comment_id": 16,
				"body": "> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): Well, if bad research is to be believed, bitcoin is boiling the oceans, causing the next climate crisis, and so many system say they have a better solution, so which side is claiming that a blockchain is efficient (for centralized usage)?\nWARNING: Long Post\nSUB WARNING : [ztz] likes to talk about things he knows nothing of. I suggest you take anything he says going forth with a grain of salt...\n\n--TL;DR at the start:\nThere's no such thing as a {{{centralized}}} banking Blockchain. Blockchains are distributed by design. Just because a group of banks run them in cohesion and use a network (RippleNet for example) for exclusive use by banks and financial institutions, doesn't stop it from being one. Anyone claiming that a bank cutting transaction costs down to micro-pennies by no longer using the current system of SWIFT that charges large percentages per transaction on their global, and as far as I'm aware ONLY, network...is clearly unaware of the fact that banks love keeping more of their money (so...YOUR money) in their own god damn pockets. SWIFT is not doing that well, and other Blockchain-powered options may prove to be their solution going forward.\n\n> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): efficient\n> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): Well, if bad research is to be believed, bitcoin is boiling the oceans, causing the next climate crisis\n\nI'm not even going to touch that bullshit statement because I'm certain the only thing anyone has pointed out is that Mining Farms gobble up assloads of Energy that for the most part requires coal to fuel... I'm not here to argue climate change...if it's bad research don't include it in your argument.\nMOVING ON...\n\n> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): efficient\n> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): many system say they have a better solution, so which side is claiming that a Blockchain is efficient (for centralized usage)?\n\nThere isn't a side other than old-heads and established banking kingpins that claim it's not efficient...SWIFT is the current garbage solution that costs an ass ton to run and takes far to long to complete a ledger-valid transaction using, but they'd and any company financing them would claim Blockchains are unexplored territory all the while people are exploring them (and as I said previously, SWIFT is now developing their own Blockchain...because their MySql-so-cheap ledger isn't fast enough or cheaper than a Blockchain ledger. So they're hypocrites...par for the course with banks and financial institutions).\n\nA Blockchain using premined coin (Ripple) and allowing banks to purchase it for use as ledger ink at the cost of ~$0.0000035USD avg (at time of posting) per transaction with ~1500 transactions a second: the efficiency they're talking about is in manhours, storage, and, to some degree I'd have to guess, energy costs.\n\n> [ztz](#comment_10_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): And the cost of MySql for thousands of transactions is next to nothing\n\nWhat if I told you that a Bank Wire costs anywhere between $15 - $45 and it wasn't just because people wanted to profit off of your money transfer...? People (man hours) verify that funds are available at bank branches halfway across the planet, storing these transactions on millions of HDDs hosted in Server Rooms using obscene levels of space and electricity 24/7 and it still takes 3 days to propagate and verify most transaction records. You're too shallow into your thinking or knowledge of the topic (and the Banking system in general) if you think it's as simply as popping off a few MySQL queries to write a line to a database in a box, especially seeing as MySQL databases, unlike Blockchains (at least easily), have the explicit ability to overwritten maliciously as a core reason why it costs so much. And then SWIFT takes their cut...-_-\n\nClearnet: https://ripple.com/use-cases/banks/\nPlay around with that Slider in the middle of the page as if you were a megabank and then suggest to me saving 348 Million USD annually in transaction costs by using a distributed Blockchain and Transaction Network (RippleNet) doesn't sound like a good thing to at the very least TEST...which is exactly what nearly 200 banks and CC processors are doing (American Express, MoneyGram [got sick of SWIFT, I bet...], UAE Exchange, WorldCom Finance, etc).\n\n>Needless to say it's stupid to claim that a bank with a ledger wants to use a database that cuts down on transaction costs\nBecause, apparently, it's stupid to think that a bank...an entity focused on money...wouldn't adopt a technology that allows them to...KEEP. MORE. MONEY... >_>\n(See previous blocks)\nAt best you could have claimed that they could use it to cut down on INTERNAL costs and still keep the transaction costs that they typically pass on to the customers for added profit, but you focused on the Blockchain instead of the grubby fucks wanting to use it to keep more money in their wallets. ƪ(‾ε‾“)ʃ",
				"added": 1555934015
			}
		],
		"1555920851_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 15,
				"body": "> [ztz](#comment_11_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): Afaik it was a ponzi scheme; thus sell your bags on uninformed people i.e. buy low sell high\n\nThis will be your 2nd time failing to read between the lines, as well as taking a question asked of you out of context. He's asking how he COULD have made money off of BitConnect seeing as it never was a real thing, not HOW he did it as if he was in on the scam. He's confused, not inquisitive.\n\n[duende] hit the nail in the head, and the nail has been well read on 8ch and elsewhere...he was shitposting because he knew the Media would grab onto it as if it were fact instead of checking his claims. \n\nIirc he also suggested something about My Little Pony being an influence................",
				"added": 1555931774
			}
		],
		"1555707064_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 17,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_35_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I DON'T CARE WHAT YOU CARE OF WHAT I'M THINKING.THINKING DOES NOT INTEREST ME.\n\nWhat a fucking moron... -_-",
				"added": 1555934336
			},
			{
				"comment_id": 18,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_40_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): I'M SHITTING ON YOU, YOU LITTLE VIRGIN.\n\nThat's where you're wrong, kid. (☞ﾟヮﾟ)☞",
				"added": 1555936177
			},
			{
				"comment_id": 19,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_41_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Nothing more to add: credulity and self-centeredness still is the main problem with this human world.\n\nBut you're part of the problem yourself, kid! If you only ended yourself we'd be one step closer to a better society!",
				"added": 1556016903
			}
		],
		"1556212621_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4": [
			{
				"comment_id": 20,
				"body": "> [franc](#comment_10_166W3JhPgc183GgfmPqRdKebZbPgjsfaR4): You are bringing up all argoments with them I agree, but I think globally pedofilia and revenge porn aren't ethic things\n\nAnd who has the final say on what is ethical or not?  A court with their own religious and political bias, prone to agreeing with the mob if it keeps them their job and pay? Regardless of the subject matter? The mob, who've already established that they're not of rational mind to make decisions for others?\n\nAt the end of the day only you can be your own ethical and moral ruler...and that's exactly why there's a block option and MOBA (mother of all blocklists - http://127.0.0.1:43110/Styromaniac.blocklist.bit/ ) so you can come to your own peace and others can browse as they agree with their own ethics/morals. \n\nDon't force yourself on others on a free speech platform and start the slippery slope of \"they banned that so why not this and this and this and that and anything else I don't like\".",
				"added": 1556222825
			},
			{
				"comment_id": 21,
				"body": "> [ztz](#comment_14_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): Free Speech, but without the forms of speeches you don't like is not free speech\n\n^ Bingo.",
				"added": 1556224089
			}
		],
		"1556287335_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 22,
				"body": "> [xeu100](#comment_1_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq): Was that a self suggestion?\n\nDon't feed trolls -_-",
				"added": 1556300232
			},
			{
				"comment_id": 23,
				"body": "> [duende](#comment_17_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): You are shit, glad you know, now become self cleaning and kill yourself.\nDon't feed trolls -_-",
				"added": 1556301029
			},
			{
				"comment_id": 24,
				"body": "> [xeu100](#comment_3_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq): So I'm the troll lol\n\nDuende is the troll, I'm tell YOU not to feed him so he stops coming here and trolling...smfh",
				"added": 1556303482
			},
			{
				"comment_id": 25,
				"body": "> [kxobot@kxoid.bit](#comment_11_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA): You should look at your last reponse before you posted that. You're quoting duende, and then saying \"Don't feed trolls\".\n\nAnd the one before THAT, which has the same reply, is \"dont respond to trolls\".\nMy \"don't respond to trolls\" to duendo is a empty repeat : a non-feed reply.\n\nI had been looking for a \"no fishing\" ascii to post to any more of duendindonuffin's posts but the site keeps reformatting them, so I went \"nothing to work with\" instead.",
				"added": 1556306314
			}
		],
		"1556366714_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 26,
				"body": ">Is the Dat network anonymous? \n>No! Dat is not anonymous or private.\n>When you visit or seed a dat:// website, other visitors can see your IP address. You should not visit a dat:// website >with the expectation that you can share or view its files with anonymity.\n\nHaha, fuck that shit. You're just broadcasting your location to everyone who connects. You'd have to run the service through Tor and, whoa, that's what Hidden Services and ZeroNet already do. It's 100% designed with clearnet in mind to the point where I can only see it being used by people who inject Soy in their veins...",
				"added": 1556458871
			}
		],
		"1557680958_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 27,
				"body": "> [quantumworld](#comment_455_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I agree, and there have been no arrests on any of this stuff either. Just shows you we are all in a different class than those with lots of money.\n\nNo you're just too stupid to understand how the law works and think someone who you WANT to be put in jail broke the law when they didn't. No collusion because there wasn't any, and HEARSAY for suggestions that he already had legal ability to do (firing Robert Muller) but were not acted upon IS NOT conspiracy to obstructed justice (which is why every non CNN/MSNBC/DNC related attorney notes they wouldn't charge him either, since you can't suggest yourself into a crime that requires adamant actions, especially when those actions are A) legal for you to take and B) nullified by your innocence...you can't obstruct an investigation into a crime they know you didn't commit). And you're also skipping around the people who have (had) money in the investigation who were either charged for unrelated items, charged for semantically false (honest truths) information, or charged as a tactic to get information from them they didn't have to begin with.\n\nAdd in the fact that they had spies placed in and around (some legal, some not) the campaign since day 1 and they didn't find jack shit...to the point where BEFORE day 1 they didn't even trust the source that suggested that there was something iffy with the Trump transition.\n\nThe entire escapade was a set from the get go, before Hillary lost, to try and permanently poison the well against the RNC/Republican Establishment going forward because Hillary wanted her office...and last I checked they KNOW she broke the law with her email server and SHE isn't in jail not because of her money, but because Jim Comey is a fucking retard.\n\n---\n\nAnd in regards to your retarded suggestion that a unrelated TV show was a dogwhistle for his winning : explain why there are shows where Hillary won...? And none that suggested Obama? Maybe...JUST MAYBE...it has something to do with how popular someone is AT THE TIME. ESPECIALLY since those shows (Such as the Simpsons) have been on the record to have outlandish situations written and animated for instances of relevance in the future...",
				"added": 1557685880
			}
		],
		"1557536353_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 28,
				"body": "> [anonymouslogin](#comment_296_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): those with the vision of cooperative benefit can leave those without it to squander opportunities with their tribalism.\n\nYou really should read shit aloud before you post, because you just called both sides tribes, glorified one, and then shat on the other...",
				"added": 1557686838
			}
		]
	},
	"comment_vote": {
		"9_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": 1,
		"10_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW": 1,
		"128_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"27_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"9_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"16_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW": 1,
		"228_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"79_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"14_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc": 1,
		"96_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"36_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"37_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"38_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"39_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1
	}
}