{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1556161291,
			"title": "ZeroTalk now Supports KxoId!",
			"body": "The PR was accepted here: https://github.com/HelloZeroNet/ZeroTalk/pull/76\n\nThis post is also a little test to see if it's working properly.\n\nSee an explanation on how KxoId works here: http://127.0.0.1:43110/kxonet.bit/?/kxoid",
			"added": 1556161290
		},
		{
			"topic_id": 1556254561,
			"title": "License Offenders Blocklist",
			"body": "This is a voluntary blocklist for zites that offend the License of zites they have cloned or used source code from. It applies to:\n* Clones/Forks to zites which use a copyleft license (including MPL, GPL, etc.), but do not use the same license\n* Zites that do not follow the restrictions of the zite they fork/clone/use source code from (examples of restrictions include \"Include Original Source\", \"Include Copyright\", \"Give Credit\", etc.)\n* Proprietary zites which have **explicitly** given me a complaint about the offending zite.\n\nZites that offend Licenses will be placed under a notice for 7 days. After the 7 days are up and the zite is still offending, the zite will be added to the Blocklist. \n\n**Since the majority of Zites probably don't follow any of the rules yet, this Blocklist will not go into effect until May 17th.**\n\nhttp://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/blocklist/license-offenders",
			"added": 1556254559
		},
		{
			"topic_id": 1557305222,
			"title": "KxoBlock",
			"body": "KxoBlock is a new zite for sharing and collaborating on Blocklists. You can easily create blocklists for zites, users, or both. The interface allows easily adding and removing a blocked item.\n\nWhen adding a user or zite, you will get an autocomplete to allow for easier finding of users or zites that you want to block - this only works if CORS has been accepted for ZeroId, ZeroSites, KxoNetwork, and Important Zites. (currently unimplemented)\n\nWhen you view another's blocklist - you can enable it so that the items on that list are blocked for your client. When the list is updated, the new items will also be blocked by your client.\n\nYou can follow a blocklist to get a notification in the ZeroHello NewsFeed on when the list was updated. (currently unimplemented)\n\nIf you don't want to use the whole list, just specific items from the list, you can click on an item and either mute that user or add the item to one of your own blocklists.\n\nFinally, in a future update, there will be an area where users of a blocklist can request to the blocklist owner that items be added to the list. The blocklist owner will be able to go through these and click to accept or reject - making changes when needed if accepting.\n\nRemember that not all features have been implemented yet, and that this zite is still in Alpha. You can report bugs here. Below are some more screenshots of how the zite looks.\n\nhttp://127.0.0.1:43110/161W1XFqy3dFyeaGuw34eH4GKvCnbbCLPR/?/",
			"added": 1557305219
		}
	],
	"topic_vote": {
		"1556161291_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1556254561_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1557305222_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1
	},
	"next_comment_id": 51,
	"comment": {
		"1556106580_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": [
			{
				"comment_id": 1,
				"body": "> [sharer](#comment_31_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P): yes [...]\n\nI know I have had a problem before when either not making sure I change the `schema_changed` fields after modifying the dbschema file, or using `0` for `schema_changed`. Not sure if that's what your problem is though.",
				"added": 1556162294
			}
		],
		"1556136561_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": [
			{
				"comment_id": 2,
				"body": "> [caryoscelus](#comment_135_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Ok :/ Thanks for letting me know\n\nAs a sidenote though - *technically* it's not JavaScript, so therefore it isn't NonFree *JS* :)\nIt's only the code that's basically the server portion of id creations/signing. And it isn't exactly completely finished yet, which is one reason why it hasn't been released open-source yet.",
				"added": 1556185527
			},
			{
				"comment_id": 3,
				"body": "just on my private servers that are being contacted by KxoNetwork",
				"added": 1556196503
			}
		],
		"1556161291_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": [
			{
				"comment_id": 4,
				"body": "> [filips](#comment_8_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Will other official ZeroNet sites also be supported?\n\nI can make pull requests to add support to the other official zites, but it'd be up to @nofish: if he want's to merge them or not.\n\nI have KxoHub that already allows KxoId's to post to ZeroMe - the only thing would be adding KxoId support for the user's index (which isn't a *requirement* for KxoHub to work - which is why it already works - but does allow searching of KxoId profiles on ZeroMe).\n\nBtw, @gabew: , me and some other people are going to work on creating a plugin that will allow easily installing plugins - this way problems with not installing the plugin correctly are reduced and it'd require less work on the user's part.",
				"added": 1556228470
			},
			{
				"comment_id": 5,
				"body": "Sidenote: If people don't know, you can see what id provider someone is using as well as the public key of the user by placing (hovering) your mouse over the user's name and waiting for the tooltip to pop up.",
				"added": 1556242748
			},
			{
				"comment_id": 22,
				"body": "bump",
				"added": 1556473493
			}
		],
		"1556254561_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": [
			{
				"comment_id": 6,
				"body": "> [60](#comment_76_1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1): GNU GPL dont require state changesMPL does\n\nAccording to both tldrlegal.com and GitHub, GPL 2, 3, and MPL all require Stating Changes.",
				"added": 1556257354
			},
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_835_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I lol'd. copyright has no power here.\n\nWhich is why this is a blocklist, **obviously** - LOL.\n\nBtw, pretty ironic for someone who complained about plasmmer (aka Daniell) copying their work.",
				"added": 1556288075
			},
			{
				"comment_id": 8,
				"body": "> [caryoscelus](#comment_137_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Sorry, wut?\n\nWebsites that aren't licensed the same as the zite they are cloned/forked from if that original uses a copyleft are obviously in violation of that license. If KxoVid is GPL, and someone clones KxoVid, they must also be GPL - that's how Copyleft works.",
				"added": 1556288178
			},
			{
				"comment_id": 10,
				"body": "> [caryoscelus](#comment_146_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): That's pretty obvious violation, but that doesn't mean every clone/fork of such a site violates license (which seems to be what you're going to block according to you post). [...]\n\n> but not those that violate copyright from other sources. Is that correct?\n\nI've originally thought that I was going to do from both zites and other sources. But I'm not 100% sure yet.... What do you think I should do?\n\nBtw, one of the main goals of this Blocklist isn't to just block everything Copyrighted (@Kaffie). There are projects that don't give credit - which I personally think is wrong. Additionally, a lot of people (like you, it seems) want to make sure that as many zites are open - and GPL is the way to do this.\nAlso, I specifically say that clones of proprietary zites are **not** added unless there's a complaint by the owner of the original. Finally, this blocklist only applies to **source code**.\n\nBtw, one reason why I'm doing this is it'll make it more comfortable for *me* to Open Source my projects if I know there's a blocklist like this (including StreamZ).\n\n> but that doesn't mean every clone/fork of such a site violates license (which seems to be what you're going to block according to you post).\n\nOkay, my mistake. Perhaps what I said above was a little confusing - I'll rewrite it. The 3 bulleted items above are things that are going to be **looked at** (hence `applies to`). Only zites *in violation* of licenses will be blocked.",
				"added": 1556289270
			},
			{
				"comment_id": 15,
				"body": "> [kaffie](#comment_836_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh):\n> I've promoted various sites that have used my code as a base, and done truly unique and cool things.\n\nThere's a difference between using code as a base and stealing code with no effort in changing or improving it - which is I believe what your problem was with Daniell's clone of Kaffiene, correct?\n\n> Lol. you really like copyright so much you're going to enforce it?\n\nI think the things people create should be respected and **credited.** I think that anyone who achieves anything actually useful and/or novel would be pissed if someone else claimed that work as their own.\n\nI also think people who don't want to credit from sources they use are being selfish.\n\n> Lol. you really like copyright so much you're going to enforce it?\n\nThere are people who have enough respect for what other's do and actually care about either things like GPL or care about the proper people being credited. It's a sad time we live in where Artists and Singers and Actors get a lot of recognition, but all the other people who were involved in the productions of these things get no credit or thanks at all. Some of the most respectable Singers are ones who always recognize the band and background singers, imo.\n\nSo, this **optional** Blocklist is for the people who have this respect for people's work. Whether or not you like the blocklist doesn't matter, because I can almost guarantee there are others who do, and why should we deny them of that just because some or even the majority doesn't like it?\n\n**Additionally, I should note that the aspect of copyright that I and a lot of people care about is *credit* and nothing else - which is *precisely* why Open Source exists - it prioritizes credit over redistribution and modification (obviously).**",
				"added": 1556331627
			},
			{
				"comment_id": 19,
				"body": "> [castaway](#comment_3_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA): never mind the license offenders can we do a  blocklist for the questionable pron material floating around ?\n\nThere should already be some blocklists for them. There's a ZeroTalk post that contains links to blocklists here: [/Talk.ZeroNetwork.bit/?Topic:1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/List+of+ZeroNet+blocklists+that+are+using+ContentFilter+plugin](/Talk.ZeroNetwork.bit/?Topic:1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/List+of+ZeroNet+blocklists+that+are+using+ContentFilter+plugin)",
				"added": 1556415157
			},
			{
				"comment_id": 23,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_76_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Centralized as well as decentralized are a bit of a catch-all term, \"general terms\". [...]\n\nI'm not forcing anyone to use the blocklist, so this doesn't qualify an centralization. By not allowing blocklists you are taking away the freedom to see only what you want to see, this same freedom being granted/protected by the ZeroNet client *also* not forcing people to seed content that they don't want to seed.\n\nWhich brings me to this... having a blocklists grants the freedom of people to choose what they see and what they have on their computer, while also allowing the freedom of these others to continue to use ZeroNet - tl;dr: Blocklists don't prevent the blocked people from using ZeroNet.\n\nBtw, Freedom of speech is **not** the same thing as requiring everyone listen to you. With blocklists, you can certainly speak - doesn't mean people have to listen to you.\n\nIt also sounds like you think blocklists are something they aren't. Again, blocklists are **opt-in**, and only stop **opted-in clients** from receiving information from the blocked source. It in no way prevents clients who haven't opted-in to the blocklist from seeing this information.",
				"added": 1556571322
			},
			{
				"comment_id": 25,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_77_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Freedom does not exist per se. [...]\n\nWell... I clearly disagree on the whole obligation crap. If someone speaks to you, you should have the *decency* to hear them out. But nobody has the obligation to look at every single thing ever that someone says.\n\nAnd I feel like you use this as an excuse to be disrespectful to people, and as a way to complain and whine for people not listening to you when you're being aweful to them. Sorry, but it doesn't work like that.\n\nBut, none of this changes the fact that the Blocklist is only used by people who exercise **their own** free will to block others - **they choose** whether they accept my blocklist or not. Therefore, this is certainly *self-censorship*, but this is **in no way** (centralized) Censorship. Because of this, you cannot put the blame on me for someone else's own choice.\n\n(of course, there is also the notion of determinism - and therefore free will according to this mindset doesn't exist. This doesn't change the fact that *I* don't cause/determine them to use the blocklist.)",
				"added": 1556576939
			},
			{
				"comment_id": 26,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_78_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Because you've bee.> kxobot@kxoid.bit: they choose whether they accept my blocklist or not. Therefore, this is certainly self-censorship, but this is  [...]\n\nIt's ironic you use the word narcissistic against me, and then can't even spell it too!\nSorry, but you're not a doctor - you don't get to diagnose random people you disagree with as being narcissists because you can't backup your own statements.\nAnd actually, any doctor knows that you can't diagnose someone over the fucking internet using the limited amount of evidence/resources you have.\n\n> No one has that, freewill, once again that Masonic Personality Delirium; something completely non-existent.\n> Hence your Mental Delirium Of 'Persecution'\n\nYou *conveniently* skip over the part where I actually talk about the thinking that free will doesn't exist:\n> (of course, there is also the notion of determinism - and therefore free will according to this mindset doesn't exist. This doesn't change the fact that I don't cause/determine them to use the blocklist.)\n\nQuestion: If you think free will can't/doesn't exist, then how can *you* (specifically) think so low of others, how can *you* think obligation can exist, how can *you* hold people accountable for their thinking? Your beliefs clearly don't add up.\n\n> I like it (to be disresptful), I like to fight and destroy all those who don't fight on this fight.\n\nThat's all I need to hear. You'd rather tear people down than think logically and back up your statements.\nThank you, next!\n\nBtw, it's also ironic that it seems you want to censor self-censoring software.",
				"added": 1556596345
			},
			{
				"comment_id": 27,
				"body": "> [styromaniac](#comment_692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I didn't pay attention to who created this thread. Was thinking someone else made this. [...]\n\nYeah, I'm @krixano (and @krixano@kxoid.bit). This is the profile I use on my desktop computer.",
				"added": 1556596575
			}
		],
		"1549533305_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 9,
				"body": "[/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/blocklist/license-offenders](/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/blocklist/license-offenders) - Block zites that are in violation of FOSS licenses.",
				"added": 1556288410
			}
		],
		"1556287335_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 11,
				"body": "> [shitnotworking](#comment_24_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): Duende is the troll, I'm tell YOU not to feed him so he stops coming here and trolling...smfh\n\nYou should look at your last reponse before you posted that. You're quoting duende, and then saying \"Don't feed trolls\".",
				"added": 1556303838
			},
			{
				"comment_id": 13,
				"body": "> [shitnotworking](#comment_25_14ogJNYFcw4vvWiy79raBJorUEcJHx1BEW): And the one before THAT, which has the same reply, is \"dont respond to trolls\".My \"don't respond to trolls\" to duendo is a empty repeat : a non-feed reply. [...]\n\nWell, I'm just saying, you should consider that that post confused xeu100.",
				"added": 1556306405
			},
			{
				"comment_id": 14,
				"body": "> [mrmatrix](#comment_6_1DD6MxkhN6jytqx22K1ENsaESe7EW9cGFq): And you should not be so stuck up. Lose that ego mate.\n\nI don't understand... shitnotworking was being disrespecful to  xeu100 for a misunderstanding that wasn't actually his fault.\n\nIf being considerate and nice to people is being stuck-up.. then that's a lame excuse to condone assholes like you.\nBtw, I'm questioning whether you actually know what \"stuck-up\" means....\n\n> Loose that ego man\n\nYou know nothing about me - stop pretending like you do. If you did know anything about me, you certainly wouldn't be saying this - just goes to show...",
				"added": 1556315033
			}
		],
		"1556299233_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 12,
				"body": "Actually, this is an old unfixed bug - I don't exactly know what the problem is, but it's something to do with downloading all of the hubs before you've first visited ZeroMe or something.",
				"added": 1556306263
			}
		],
		"1556335000_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 16,
				"body": "> [robione](#comment_229_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Someone should make a Py3 .zip of the repo to upgrade existing Py2 installs minus their config files.\n\nYou can download the py3 zip directly from GitHub. All you really need to do is drag your data folder over from py2 to py3.",
				"added": 1556391506
			},
			{
				"comment_id": 17,
				"body": "> [filips](#comment_10_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): When will Python 3 bundle for Windows be available?\n\nI believe nofish has said that he's going to do this soon in his latest Blog Post or something, idk.",
				"added": 1556396014
			},
			{
				"comment_id": 29,
				"body": "> [duck0](#comment_37_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): I also had to download it via Github. Does GitCenter not allow branches like GitHub? Not sure. Or maybe it just hasn't been uploaded by the maintainer.\n\nGitcenter *does* have branches, that's what everything on the left sidebar is - I just don't think @nofish has pushed the py3 branch to the gitcenter repo yet.",
				"added": 1557026613
			}
		],
		"1556406701_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 20,
				"body": "I'm guessing your talking about the YouTube **zite**?: 149EPBN4hQRpwj5TcoPETepnoXHCUXzaCN\n\nBtw, this is pretty much an exact clone of KopyKate Big.",
				"added": 1556422591
			},
			{
				"comment_id": 21,
				"body": "[KxoVid](/kxovid.bit) uses Merged-Zites based on categories as a kinda-filter function. One of the categories is NSFW. If you don't want to see NSFW videos, then you simply just don't download the category. Additionally, using merged-zites means more decentralization.",
				"added": 1556472539
			}
		],
		"1556571053_18yjuvi7DyL85Rip57MiXEcGhkgCv2rHT2": [
			{
				"comment_id": 24,
				"body": "There's [KxoVid](/kxovid.bit) that is a video-sharing zite that uses Categories (which are merged-zites) - only videos from the categories you download will be visible.\n\nBtw, YouTube is pretty much a 100% clone of KopyKate Big, which *doesn't* have nearly as much porn.",
				"added": 1556571484
			},
			{
				"comment_id": 28,
				"body": "> [ssdifnskdjfnsdjk](#comment_808_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Are there employed full-time moderators who clean the categories from offtopic/harmful content? Is there a protection from a b0tnet to spam the site/categories with high amount of advertisement? [...]\n\nMy interpretation of this post was that jediknightchan didn't want to see a bunch of porn on a video zite. KxoVid solves this by creating categories that you have to download in order to see the content - very much like a filter.\n\nOf course, this really only works if people actually put videos where they're supposed to be.\n\n> new videos are published/categorized after moderator approval \n\nThis is pretty much impossible in ZeroNet.\n\nI also don't own all of the categories. Some were created by Daniell (aka plasmmer), and some were created by others. It's up to them to moderate their own categories/hubs. This is another improvement KxoVid has over KopyKate Big.",
				"added": 1556665849
			}
		],
		"1557079828_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 30,
				"body": "[KxoNetwork's](/kxonet.bit) blocklists now have the ability to click on an individual user in the list to mute - in case you don't want to enable the whole list.\nI'll also be adding the ability to mute a KxoId from a KxoId's profile page.",
				"added": 1557092704
			}
		],
		"1557168662_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 32,
				"body": "This post is very confusing to me - especially how the last line relates to everything else.\n\nAre you trying to say that once we start \"subtracting\" *some* rights, we'll eventually end up where everyone's rights are \"subtracted\"?\n\nI'd also like to know what this is in response to, or what led to you thinking about this.",
				"added": 1557219030
			},
			{
				"comment_id": 33,
				"body": "> [ztz](#comment_28_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): \"How are we trained to think like sheep? By the rewards we receive from our modern social institutions for other-regarding flock behaviors like jealousy (feeling sad when others are glad) and schadenfreude (feeling glad when others are sad), and by the penalties we receive for self-regarding pack behaviors like honor and shame.\" [...]\n\nRead *some* of that article. This is my *initial* reaction to it.\n\nNot very many scientific sources or studies done/cited I don't think... yet a lot of quotes.\nIt also seems to only talk about specific aspects of humans that relate to sheep while completely disregarding the aspects that relate to wolves (or even other animals - seems to be a bit of a continuum between only sheeps and wolves). I have a feeling it's a bit biased or leaning/tilted - because I don't see him talking about other aspects of humans at all.\n\nI mean, even citing the Harvard Prison Experiment would have better supported what he was trying to say.\n\nHumans can be altruistic and selfless, which is the opposite of sheep. And Honor and Shame is dependent on Culture and a lot of other factors - from what I've read (I'll admit, didn't read all of it), he doesn't talk about that at all.\n\nI think if we did a survey today - there'd be more people than what this author would expect who believe in some honorable or obligational things that people should do, and some shameful things that people shouldn't do.\n\nAdditionally, while agnosticism or atheism is rising in 1st-world countries, religion (like Christianity and Islam) is actually rising in other countries - and overall.\n\nI disagree *kinda* that the world is missing shame - I actually think that there might be **more** shame being *put on people* that could account for a **desensitization** of it - so much hate is being spewed online that the only way to remain sane is to desensitize yourself from all of that.\n\nThere's also seems to be a bias for Christianity - which... whatever I guess....\n\n> Any coin worth having has two sides. A shameless politics has no honor. A riskless market has no reward. Oh, the Missionaries will tell you that there’s honor in the shameless politics and reward in the riskless markets, and for all the high-functioning sociopaths out there I’m sure that’s true, But if you’re not totally sheepified yet, if your goal is still honorable service to your clients or your partners or your family or your nation or your species — whatever your pack may be — then you know that this is NOT true.\n\nAlso, this is a **complete** turnoff and makes me not want to read any more of this website, to be completely honest.",
				"added": 1557220314
			},
			{
				"comment_id": 34,
				"body": "> [ztz](#comment_30_18GfaqZq5nMa3eUCysUBcEmwMQXfBqF1Wc): To everyone their cup of tea.I don't read the site for truth, but get ideas on how to think about something; perspectives, ways of expressing ideas, etc. [...]\n\nThe problem is that that only applies to a certain extent. If someone is known to be a biased and lying person, then can you actually trust that they are telling the truth?\n\nAdditionally, making someone not *want* to read it isn't the same as making them *stop* reading it.",
				"added": 1557228161
			}
		],
		"1557278450_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": [
			{
				"comment_id": 35,
				"body": "> [fantoski](#comment_20_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Here's the big growing project:  [...]\n\nYouTube is a **clone of KopyKate BIG**. KopyKate Big is the original and more established here.\nAnyways, neither are being developed afaik.\n\nThere's also ShareTube and KxoVid.",
				"added": 1557290872
			}
		],
		"1557305635_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 36,
				"body": "> [quantumworld](#comment_430_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Pathetic that you are deleting your best sites. Oh well. Your loss of credibility as a site developer.\n\nRest assured... my credibility will be just fine outside of ZeroNet. ZeroNet isn't **that** important.",
				"added": 1557309221
			},
			{
				"comment_id": 37,
				"body": "> [quantumworld](#comment_431_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Good. You treat people like shit and you act like a 3 year old having a temper tantrum. Good luck you will need it. You may be a good coder but your personality is pure garbage.\n\nInteresting... Considering so far, throughout all of this I've been called a \"Drama Queen\", \"pure garbage\", \"pathetic\", \"idiotic\", \"agressive\", I think \"sjw\". I've been mocked and made into \"entertainment\". I'm wondering... what have I called other people? (besides \"jerk\")",
				"added": 1557309402
			},
			{
				"comment_id": 38,
				"body": "> [quantumworld](#comment_432_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): This falls in the I don't care category. Humans are not code. Maybe you need to learn to tell the difference.\n\nYou called my personality garbage... if you're gonna do that, you have to back up your statements. So tell me... do you have any actual evidence that shows I'm any worse than the people calling me these names?",
				"added": 1557309987
			},
			{
				"comment_id": 39,
				"body": "> [quantumworld](#comment_434_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Maybe it is related to your actions on deleting your best sites you ever made on Zeronet. Think of it as a back handed complement.\n\nWell... I actually made sure someone backed up all the data, so you know..... assumptions I suppose are being made.",
				"added": 1557310253
			},
			{
				"comment_id": 40,
				"body": "> [quantumworld](#comment_435_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Good maybe you will make an even better site than that. But since you are leaving Zeronet for what ever reason you feel you need to there is not much to say. Good coders usually have nasty attitudes after a bad day of why the hell is this not working moment. Kinda like me zapping out emacs on a bad keystroke.\n.\n>  But since you are leaving Zeronet for what ever reason you feel you need to\n\nWho said I was leaving? Is this another assumption?",
				"added": 1557310603
			},
			{
				"comment_id": 41,
				"body": "> [quantumworld](#comment_436_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Well good you are not leaving.\n\nI also didn't say I wasn't leaving.",
				"added": 1557310880
			},
			{
				"comment_id": 42,
				"body": "> [ssdifnskdjfnsdjk](#comment_825_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): should i waste my time to try to find all the links i made to Krixano sites or just by ignorant and keep dead links?\n\nJust keep the dead links.... you won't be able to replace them with anything anyways.",
				"added": 1557310944
			},
			{
				"comment_id": 43,
				"body": "ZeroMedium Data: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd/1557349202-ZeroMediumData.zip\nNew Important Zites Data: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd/NewImportantZitesData.zip\n\nThe rest of the data's on the hubs for their respective zites.",
				"added": 1557349348
			},
			{
				"comment_id": 44,
				"body": "> [leftside](#comment_756_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): How old is he, by the way? I saw his clear mugshot today for the first time.I've guessed he's +50 based on his blurred avatar picture on ZeroMe.\n\n> I saw his clear mugshot today for the first time.\n\nNo you didn't - I don't have a mugshot.\n\nHere's my github, for anyone wondering - I use the **exact same** image that I used on ZeroMe: https://github.com/krixano",
				"added": 1557367121
			},
			{
				"comment_id": 45,
				"body": "> [leftside](#comment_758_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): p\n.\n> A mug shot or mugshot is a photographic portrait of a person from the waist up, typically taken after a person is arrested.",
				"added": 1557370241
			},
			{
				"comment_id": 46,
				"body": "> [leftside](#comment_759_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): If u're a teenager, I apologize to u about the expression such as 'unstable mentality' I mentioned.But if u are over 25, u'd better see a doctor or psychotherapists, etc soonest.My sincerity.\n\nI'm mentally unstable because I deleted my zites? lol",
				"added": 1557371051
			}
		],
		"1557505878_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 47,
				"body": "All zites actually use at least one class if they use ZeroFrame, because ZeroFrame uses a class. So, I feel like the problem is actually something else, but I don't actually know - haven't checked it out yet.",
				"added": 1557527293
			},
			{
				"comment_id": 48,
				"body": "Ok, so I've actually found the problem. Firefox *does* support classes, it *doesn't* support **fields** (variable definitions) in classes. This is where the problem is in the code (lines 72-82):\n\n```javascript\n\t\tdataURLtoFile = function(dataurl, filename) {\n\t\t\tvar arr = dataurl.split(','),\n\t\t\t\tmime = arr[0].match(/:(.*?);/)[1],\n\t\t\t\tbstr = atob(arr[1]),\n\t\t\t\tn = bstr.length,\n\t\t\t\tu8arr = new Uint8Array(n);\n\t\t\twhile (n--) {\n\t\t\t\tu8arr[n] = bstr.charCodeAt(n);\n\t\t\t}\n\t\t\treturn new File([u8arr], filename, { type: mime });\n\t\t};\n```\n\nThis is a field/variable. It needs to be converted into a regular function: `dataURLtoFile(dataurl, filename) {`.",
				"added": 1557527602
			},
			{
				"comment_id": 49,
				"body": "> [fantoski](#comment_27_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3): Oh wow thanks for the effort you put into looking into the code and finding the problem. This part is a copy-paste, I'll fix this right now. I'm gonna try and see if it works, if it does I'll send the new code to uvpda@zeroid.bit and he'll sign it.\n\nNo problem. Happy to help!\n\nIf this didn't fix it, tell me and I'll try to look at the code more.",
				"added": 1557536321
			}
		],
		"1557847676_1DR9EVmTR2KA8mJXmzTknbEAUzveKLRJut": [
			{
				"comment_id": 50,
				"body": "BWOI/RVRE is not new (I suppose this depends on what you consider new and what it's relative to), and afaik, isn't being actively developed anymore.",
				"added": 1558306224
			}
		]
	},
	"comment_vote": {
		"2_1KkkmfSfcx2gyvoajNUztYyPMiko99fXDP": 1,
		"432_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"8_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"147_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"9_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"4_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"8_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"685_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"21_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"23_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm": 1,
		"692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"38_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"8_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"21_13eTQePN4cvnxL9qFurmPFgHRTXMGNNbCy": 1,
		"27_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"28_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": 1,
		"38_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1
	}
}