{
	"posts": [
		{
			"id": "7ec2eb71-2005-42e7-9939-3b0932669739",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "beb0042a-c847-478f-9315-7b6df7ee6b39",
			"body": ">>ec1471ff-b942-4148-a8f2-99775bfc41ae\nI'd post here more often but I am not sure if my post  are published here and could be read by anyone else. I tried posting a week ago here.\n5/5 published nice hopefully it works now. I had 0/5 didn't publish error messages.",
			"time": 1567295153446,
			"files": "[]",
			"last_edited": 1567295309946,
			"subject": null,
			"capcode": null
		},
		{
			"id": "cefa1eb3-9fda-43f0-9cdd-d94d7bf775b3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>a961d93f-a5cd-4a3a-b7eb-5d62fe366e91 \nHow could I view the whole image zeronet reconnects after clicking on an image or video?  I could only see thumbnails. I set it to 100mb (limit used: 20%) and I can't click on the  post number to reply, just sends me to the bottom of the page.",
			"time": 1567347076666,
			"files": "[]",
			"last_edited": 1567348638936,
			"subject": null,
			"capcode": null
		},
		{
			"id": "1e1547dc-cb91-471c-a743-fe6fe0689f44",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>9c23467a-e857-42c6-830c-2f4edd90ae8e \nThe edit doesn't work either, I have to click 5 times to edit my post.",
			"time": 1567348277836,
			"files": "[]"
		},
		{
			"id": "bba35904-d785-49dc-8836-7d816ea89458",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>1e1547dc-cb91-471c-a743-fe6fe0689f44\nIt takes a few clicks to delete my to post also.",
			"time": 1567348896436,
			"files": "[]"
		},
		{
			"id": "6e0d247c-df1c-4fba-bb60-037abcf3c8d9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>bba35904-d785-49dc-8836-7d816ea89458\nI realized to the reply button froze for a few clicks when I decided to delete my post.",
			"time": 1567349140536,
			"files": "[]"
		},
		{
			"id": "cdb6f4a6-c626-44ef-8669-eec59b3d1c57",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>b2e8cd37-b1f7-4b7d-a657-72c122636d2b \nThe sideways triangle freezes a couple times when clicked under my end see >>1e1547dc-cb91-471c-a743-fe6fe0689f44 It's so annoying to edit my post. I needs to be fixed",
			"time": 1567349921429,
			"files": "[]",
			"last_edited": 1567350056529,
			"subject": null,
			"capcode": null
		},
		{
			"id": "12a54436-cf2a-4394-878b-fbe3a14af95a",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "063c2667-e53a-40ef-877a-d9eb8f31ded6",
			"body": ">if you configure your zeronet to always use TOR, so that if your vpn disconnected you are not revealing your IP\nThen How come my IP is leaked on http://127.0.0.1:43110/181aQJMXV5fTSMFVVWoLwmVSLSb6UZSp1J/ when not using a VPN?",
			"time": 1567392111805,
			"files": "[{\"name\":\"tor always.png\",\"thumb\":\"12ac6966ba714268fe67360654acdb31b50a51df-thumb.png\",\"size\":12877,\"type\":\"image/png\",\"original\":\"12ac6966ba714268fe67360654acdb31b50a51df.png\",\"directory\":\"1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn\"}]"
		},
		{
			"id": "a236606f-fa49-4dd2-85ae-33ff925ad7c4",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": ">>bbb16c71-4c82-4499-afb2-5dd80dcb7503\nObango won the 2012 election with a terrible approval rating.",
			"time": 1567458323759,
			"files": "[]"
		},
		{
			"id": "242541d3-749b-4807-9537-25ec587a7d15",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": ">>42a86d10-f8fe-458b-9b11-f12dfdd98114\nCause Romney was literally a  Republican Mormon  version of Obango ie making  RomneyCare",
			"time": 1567515304954,
			"files": "[]"
		},
		{
			"id": "9319dea5-5bfc-4610-a527-2ddb503bd546",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>587cc281-f66a-4789-8530-ba6610fbb10b \nthe problem with Christianity isn't that  it completely ignores the ethnicity issue but it encourages the ethnicity issue to grow, nearly every domination is giving to the poor African children from the white middle class in hopes to spread the gospel. Not only that but to adopt non-white in homes and stop making children of your own. I lost so much family members because of Christianity.",
			"time": 1567949510662,
			"files": "[]"
		},
		{
			"id": "515f642c-c126-41af-b969-b0d4d157345c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>e801128e-9e9e-434c-a298-3c40c27bde43 \nThis isn't entirely true, there are payroll firms that pays in bitcoin, Ethereum or ripple. This for example https://www.bitwage.com/",
			"time": 1568069688200,
			"files": "[]",
			"last_edited": 1568069714000,
			"subject": null,
			"capcode": null
		},
		{
			"id": "7f3b5ef3-e8a9-40f4-b138-d30aa0c32756",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>82381912-9e25-4c7e-8368-b7756bbe3e8f \nNope,  it hasn't gone through under my end.",
			"time": 1568072479425,
			"files": "[{\"name\":\"Untitled.png\",\"thumb\":\"8492ce29dc244b50985984076e5acb7b19584824-thumb.png\",\"size\":3565,\"type\":\"image/png\",\"original\":\"8492ce29dc244b50985984076e5acb7b19584824.png\",\"directory\":\"1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn\"}]",
			"last_edited": 1568072741555,
			"subject": null,
			"capcode": null
		},
		{
			"id": "cd055d88-9ae8-4276-9d49-904919522a60",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>59231a0b-353a-4a63-8a50-d3b440e91538\ncraigslist areadly allows crypto payments of ripple or Ether. Uber and  Airnb allows to be paid or pay in bitcoin. Coindesk atms is being installed in  the downtown areas and college campus but only it takes bitcoin.",
			"time": 1568231655395,
			"files": "[{\"name\":\"qmomizbtgi601.jpg\",\"thumb\":\"f97955f0cd86d11f95ddcea134bb1b457f7f70fe-thumb.jpg\",\"size\":60366,\"type\":\"image/jpeg\",\"original\":\"f97955f0cd86d11f95ddcea134bb1b457f7f70fe.jpg\",\"directory\":\"1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn\"}]",
			"last_edited": 1568231701895,
			"subject": null,
			"capcode": null
		},
		{
			"id": "c787109a-b533-4c37-bc24-ca338c49c5ec",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4bd6aad7-b27c-4ad5-abe0-aab5bd829f85",
			"body": "> The use of social media is an extension of the lifestyle questions typically asked when applying for life insurance, such as questions about whether you engage in rock climbing or other adventure sports\nThey already ask what are your hobbies and what foods you eat, if you are depressed or if have a gun in your home at the doctors during your annual checkup, they have been doing this for a while now.",
			"time": 1568332683448,
			"files": "[]",
			"last_edited": 1568332847748,
			"subject": null,
			"capcode": null
		},
		{
			"id": "68c93183-6486-4403-8bad-89f76afe878a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4c662606-d87c-4429-9166-7badef17c4c8",
			"body": ">>445642dc-fd10-409a-8d55-473d1271f495 \nThat fag on the left looks like he has AIDS",
			"time": 1569894147859,
			"files": "[]"
		},
		{
			"id": "9001823d-fcca-488d-aee6-c515eec1fd30",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fd5517ff-1c3d-4468-8897-7ea5345fa079",
			"body": "Nienchan's tor page is vvadkyuldkwon6za.onion",
			"time": 1570483246427,
			"files": "[]",
			"last_edited": 1570483294927,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2abc9b5a-005d-4815-a811-6dd3593080a0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"body": "I am not able to pass a background due being on disability for Aspergers and have a rep payee but could control the money I make working under SGA part time. What could I spend legally? I am willing to spend about $400.",
			"time": 1571851988885,
			"files": "[]"
		},
		{
			"id": "5374f252-3566-4e69-8bef-735ef4bd6151",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6be1af32-f44f-462a-8519-21074a403e4f",
			"body": ">>3d5e0799-9a8e-4808-a08a-a7fb6a3eb72a\nThis is because a civil lawsuit is easier to win then criminal case. OJ had to pay $25 million to family for the death of Nicole Brown Simpson even though he was acquitted during the murder trial.",
			"time": 1572446667168,
			"files": "[]"
		},
		{
			"id": "b6300933-6689-47c3-8bd3-55503975b7e6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "How to get into paganism? ",
			"body": "How do I get into Odinism? I tried Christianity every Protestant church is the Weimar it's disgusting. I don't want to send money to Israel, I don't want to travel to Africa for a missions trip when poor whites are struggling in the Appalachians. I don't want to adopt niggers, I don't  want to mix race with based non-white Christians. Why should I continue supporting an anti-white religion? It's all tiring.",
			"time": 1573613470139,
			"files": "[]",
			"last_edited": 1573613753755,
			"capcode": null
		},
		{
			"id": "d1288e5e-0645-49d7-8f13-bc0b984a38c0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>4e98a52c-cdc7-4292-b30d-2a88564ba438 \n8chan/8kun's /pol/ won't likely be around and  here's the boards that will be migrated https://pastebin.com/GnaHEdhP. Mind you some boards are already there.",
			"time": 1574992900673,
			"files": "[{\"name\":\"24ba254fd8cebd5b8cb9a8a119b15ae8dc786cbdb0c525f5d3b6bd0c1685c3c3.png\",\"thumb\":\"aa9746ad7991460a9fc5e9a2ee27c1b9b2953a65-thumb.png\",\"size\":463358,\"type\":\"image/png\",\"original\":\"aa9746ad7991460a9fc5e9a2ee27c1b9b2953a65.png\",\"directory\":\"1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn\"}]",
			"last_edited": 1574992996589,
			"subject": null,
			"capcode": null
		},
		{
			"id": "7d550f40-c45c-4ad3-b98c-83df43168f34",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>9ba27438-fe1b-498e-813b-8197307cbea9\n>there's talk of a mass exodus.\nto where?\n>>128d93d8-ee99-40f2-887f-68e829359f42\nI haven't been banned but my post keeps getting removed by the mods, I gave up on 8kun, iirc some anon made a  /liberty/ copycat board but it was removed a week later because /pnd/ was already there. After the /pnd/ mods temporary banned tor posting tor it declined quickly, because some anon used chameleon\n>>7595e133-aee2-4e07-a49f-f1a04c01bf15 \nIt's still up but nobody is posting except a few anons there.The only thing that's keeping /pnd/ it artificially alive is the /cvg/ threads.",
			"time": 1586977530253,
			"files": "[]",
			"last_edited": 1586978507209,
			"subject": null,
			"capcode": null
		},
		{
			"id": "2d094cf8-edfd-4a9a-ab06-443cd958f7c0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Secretary of State Mike Pompeo plans harsher UN sanctions for Iran",
			"body": ">Secretary of State Mike Pompeo is preparing a legal argument that the United States remains a participant in the Iran nuclear accord that President Trump has renounced, part of an intricate strategy to pressure the United Nations Security Council to extend an arms embargo on Tehran or see far more stringent sanctions reimposed on the country.\n>The strategy has been described in recent days by administration officials as they begin to circulate a new resolution in the Security Council that would bar countries from exporting conventional arms to Iran after the current ban expires in October. Any effort to renew the arms embargo is almost certain to be opposed by Russia and, publicly or quietly, by China. The Russians have already told American and European officials they are eager to resume conventional arms sales to Iran.\n>In an effort to force the issue, Mr. Pompeo has approved a plan, bound to be opposed by many of Washington’s European allies, under which the United States would, in essence, claim it legally remains a “participant state” in the nuclear accord that Mr. Trump has denounced — but only for the purposes of invoking a “snapback” that would restore the U.N. sanctions on Iran that were in place before the accord.\n>If the arms embargo is not renewed, the United States would exercise that right as an original member of the agreement. That step would force a restoration of the wide array of the sanctions that prohibited oil sales and banking arrangements before the adoption of the agreement in 2015. Enforcing those older sanctions would, in theory, be binding on all members of the United Nations.\n>European diplomats who have learned of the effort maintain that Mr. Trump and Mr. Pompeo are selectively choosing whether they are still in the agreement to fit their agenda.\n>The entire drama could play out this autumn in the weeks before the presidential election, setting up a potential confrontation with Iran in the midst of the contest.\n>Political calculations aside, the administration’s larger plan may go beyond imposing harsher sanctions on Iran. It is also to force Tehran to give up any pretense of preserving the Obama-era agreement. Only by shattering it, many senior administration officials say, will Ayatollah Ali Khamenei and President Hassan Rouhani be forced to negotiate an entirely new agreement more to Mr. Trump’s liking.\n>Iran has resisted even opening talks with the Trump administration, saying that before it would sit down Mr. Trump to amend the previous agreement, the United States would have to re-enter the accord and fully abide by its terms. Mr. Trump has refused.\n>The intricate strategy has been described by senior administration officials involved in devising it. Asked about it, Mr. Pompeo said in a statement to The New York Times: “We cannot allow the Islamic Republic of Iran to purchase conventional weapons in six months. President Obama should never have agreed to end the U.N. arms embargo.”\n>“We are prepared to exercise all of our diplomatic options to ensure the arms embargo stays in place at the U.N. Security Council,” he added.\n>A draft of the American resolution to extend the arms embargo indefinitely has been shared with some members of the Security Council by Brian H. Hook, the State Department’s special representative for Iran, who is carrying out the new strategy.\n>In trips to New York and Paris, he has described the administration’s insistence that Tehran never receive even small conventional arms, much less missiles. But he did not explain the next step if the arms embargo lapses: an effort to unilaterally force the imposition of even more crushing sanctions.\n>The timing is critical for Iran, which has been ravaged by the coronavirus. A month ago, the United Nations secretary general, António Guterres, wrote to the world’s largest economic powers and urged a lifting of economic sanctions on Iran, along with Cuba, Venezuela, North Korea and Zimbabwe. “I am encouraging the waiving of sanctions imposed on countries to ensure access to food, essential health supplies, and Covid-19 medical support,” he wrote. “This is the time for solidarity not exclusion.”\n>He did not say how long that waiver should last, and his appeal has made little progress.\n>Mr. Trump said that he would be willing to give some medical equipment to Iran to combat the virus, such as ventilators, “if they ask for it.” Iran’s leaders have not asked.\n1/3",
			"time": 1587996451525,
			"files": "[{\"name\":\"3da9324efea1b1df247fb25d4385d65216128159d5d02369e24d99da109a48a0.jpg\",\"thumb\":\"5775f6f100816f5ef7bcd8a99474774ad2bb62be-thumb.jpg\",\"size\":64701,\"type\":\"image/jpeg\",\"original\":\"5775f6f100816f5ef7bcd8a99474774ad2bb62be.jpg\",\"directory\":\"1GZPZKDb8JzHmjYMt14L3dHpzPxnNYm3Sn\"}]",
			"last_edited": 1587997489826,
			"capcode": null
		},
		{
			"id": "36554e62-a943-4c0f-8214-de6be2b6d315",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2d094cf8-edfd-4a9a-ab06-443cd958f7c0",
			"body": ">>2d094cf8-edfd-4a9a-ab06-443cd958f7c0\n>Trump administration officials say their threat to return to the far harsher sanctions — which blocked virtually all oil sales and drove Iran to the negotiating table — would not come until fall, presumably after the first phase of the coronavirus response has passed. They maintain it is separate from any relaxation of restrictions on medical supplies, some of which are exempted already from U.S. sanctions.\n>The arms embargo at the center of the dispute was something of a sideshow to the main nuclear agreement. The agreement covers only Iran’s nuclear activity: It required Iran to ship about 97 percent of its nuclear fuel out of the country — moved to Russia, in early 2016 — and to observe sharp limits on its production of nuclear material for 15 years.\n>Iran abided by those limits for a year after Mr. Trump pulled out of the agreement. But since last summer, it has gradually violated the limitations on both how much nuclear fuel it is allowed to stockpile and the level to which it can enrich its fuel. As a result, experts agree that it has greatly shortened its “breakout time,” the period needed to make enough fuel for a single nuclear weapon. Iran insists it would return to the agreed-upon levels as soon as Mr. Trump came back into compliance with the agreement by lifting unilateral sanctions.\n>The arms embargo — along with limits on missile launches — was part of a United Nations Security Council resolution that enshrined the nuclear accord, and suspended years of U.N.-imposed sanctions. That is what begins to expire in October. (The limits come off in stages: Small arms restrictions end this year, but restrictions on missiles and their components remain in place for another three years.)\n>Mr. Pompeo has warned that if the weapons embargo is not extended, Iran will supply more arms to groups that the United States considers terrorists, including Syrian militias and Hezbollah. Even his critics on Capitol Hill agree that he is probably right about what would happen to those arms.\n>Wendy R. Sherman, who served as the negotiation team leader of the Iran accord during the Obama administration and now directs the Center for Public Leadership at Harvard, recalled that the Russians and Chinese never wanted a conventional arms embargo on Iran, and only agreed to one of limited duration.\n>In an interview, Ms. Sherman predicted that if the United States argues that it remains a participant in the agreement for the purposes of dismantling the accord, “I think they will get tremendous pushback, because the Trump administration withdrew from the agreement.” She predicted that any move to impose the snapback provisions “will be strongly resisted, and should be.” But she added, “That doesn’t mean it wouldn’t succeed.”\n>Under Mr. Pompeo’s plan, an American-drafted resolution, which has already been given to the Europeans, the Saudis and the United Arab Emirates, would propose extending the conventional arms embargo, according to a copy reviewed by The New York Times.\n>The American draft says that “Iran shall not supply, sell or transfer, directly or indirectly, from its territory, by its nationals or using its flag vessels or aircraft, any arms or related matériel, and that all member states shall prohibit the procurement of such items from Iran by their nationals, or using their flagged vessels or aircraft, and whether or not originating in the territory of Iran.”\n>Russia, the U.S. expects, would veto the resolution in the Security Council.\n>In response, the United States would then attempt to declare that it remains a participant state in the agreement, formally called the Joint Comprehensive Plan of Action, despite Mr. Trump’s declaration that he was abandoning it.\n>As a participant state, the United States would declare that Iran is violating the agreement because it is now producing nuclear fuel above the limits in the accord — and impose the snapback of U.N. sanctions that Mr. Obama referred to in his 2015 speech, when he was trying to reassure critics of the agreement.\n>Relying on a legal opinion developed by lawyers within Mr. Pompeo’s department, the United States would dispute the arguments of the other signatories that Mr. Trump gave up all rights to invoke the snapback when he declared that the United States was reimposing its own sanctions on Iran, despite Washington’s obligations under the agreement.\n2/3",
			"time": 1587996539426,
			"files": "[]",
			"last_edited": 1587996649826,
			"subject": null,
			"capcode": null
		},
		{
			"id": "85c2c939-0016-46d1-8883-0d4531bd6db3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2d094cf8-edfd-4a9a-ab06-443cd958f7c0",
			"body": ">>2d094cf8-edfd-4a9a-ab06-443cd958f7c0\n>>36554e62-a943-4c0f-8214-de6be2b6d315\n>A senior European diplomat, who spoke on the condition of anonymity, dismissed the strategy as pushing the words of the agreement far beyond their logical context.\n>But the administration’s strategy could well work, even if other members of the United Nations ignored the move. At that point, on paper at least, the United Nations would be back to all the sanctions on Iran that existed before Mr. Obama reached the accord with Tehran.\n\nhttps://archive.is/RIkdE\nhttps://www.nytimes.com/2020/04/26/world/middleeast/us-iran-nuclear-deal-pompeo.html\n\nBtw where did the high quality posters end up? Is my thread really that bad? no one on 8kun is responding to my thread, I thought this an important topic so I thought I would share with you.",
			"time": 1587996720026,
			"files": "[]",
			"last_edited": 1587997055626,
			"subject": null,
			"capcode": null
		},
		{
			"id": "1d5dc791-12d0-491c-93fd-aed73ff115bb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>205cf3c7-df3e-405d-b33c-25031d268449\n/pol/ could survive on clearnet  because there's no hate speech law in the US, in fact it's the only country to not have a hate speech law. You try to host it in EU, watch it shut down almost immediately.",
			"time": 1588249462234,
			"files": "[]",
			"last_edited": 1588251316180,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}