{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1536758231,
			"title": "Article 13 and 11",
			"body": "What do you think about this cancer being passed?",
			"added": 1536758230
		}
	],
	"topic_vote": {
		"1530709027_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1530974446_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "the title is pure clickbait",
				"added": 1531424050
			}
		],
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": [
			{
				"comment_id": 2,
				"body": "> [wulf](#comment_2_1AdgRmF4CQZRJVUf7t7GWmETZc2fq6PuBy): This is what you get for empowering bureaucrats to decide what you can/can't do. I have no sympathy for those who encouraged the creation of this coercive monstrosity (EU) but whom only claim credit when it does things they support.\"Concentrated power is not rendered harmless by the good intentions of those who created it\" - Milton Friedman\nI'm not really against EU (most of the stuff they do isn't too bad imo) but shit like this really makes me hate them (https://streamable.com/l3ml8).\nAbout your quote - who does render the power harmless them? I thought there is more to this quote, but I couldn't find anything more to it.",
				"added": 1536762936
			},
			{
				"comment_id": 3,
				"body": "> [sirius17](#comment_24_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3): It will be interesting to see what Google does when they are presented with the first invoice for linking to a news website. I suspect they will simply remove the link and let the news website sink into oblivion !!\n\nWouldn't it only work with stuff like reddit where people are linking stuff? Google is just a search engine, if they are actually trying to make them pay for search results, then EU is seriously fucked.",
				"added": 1536766721
			},
			{
				"comment_id": 4,
				"body": "> [sirius17](#comment_25_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3): Google links to stuff too, especial it's news section. This was tried before somewhere in the EU (Spain I think) and the results were hilarious.\n\nWell thats fucking great",
				"added": 1536768212
			},
			{
				"comment_id": 5,
				"body": "> [flax](#comment_1_1Ap8wHPueMwX3Bcazwgbbpuu5C6ssSRSA): I heard that there will be another vote in January 2019. I don't like it one bit though. That's why I checked ZeroNet out to begin with, I like it so far.\n\nToo bad the people who actually vote for it don't know jack shit about internet or computer technology in general.",
				"added": 1536774180
			},
			{
				"comment_id": 6,
				"body": "> [flax](#comment_2_1Ap8wHPueMwX3Bcazwgbbpuu5C6ssSRSA): Yeah, they're all boomers my friend. I am starting to draw the line for wanting to leave the EU\n\nWell they do seem to know shit about non-technology subjects, so that's that. Though they didn't even try to listen (denied all improvements to 11 and 13) so that's also that.",
				"added": 1536779823
			}
		],
		"1536806132_15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC": [
			{
				"comment_id": 7,
				"body": "> [kaffie](#comment_670_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): I've been considering making a ZN reddit clone, tbh. If y'all would like that to happen a bit faster consider pledging to my patreon, selecting the ZN tier.\n\nShameless plug :P Anyways, good luck I guess.",
				"added": 1536835650
			}
		]
	},
	"comment_vote": {
		"2_1NgZxp8n6Th2QgsaFejVQAHxq2fVHgnzRB": 1,
		"1_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1,
		"2_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1,
		"3_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": 1
	}
}