{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "[RESOLU] Ip sur ZeroNet",
			"body": "http://127.0.0.1:43110/Stats (Merci à angristan)\nAncien message : \nBonjour\nY'a t-il un moyen de connaitre son IP sur le réseau zeronet en mode local?\nPeut-on avoir son propre site pour le savoir ?\nJ'ai trouvé ceci (ce site communique avec un autre, extérieur au réseau zeronet) : \nhttp://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe/.\nJ'ai ouvert le fichier \"index.html\" situé dans le dossier (windows) : \nZeroNet\\data\\1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe\nVoici ce qu'il contient:\n<html>\n<head>\n  <title>\n    ArchTech\n  </title>\n<link rel=\"stylesheet\" href=\"css/all.css\" type=\"text/css\">\n  </head>\n\t<body>\n\t<p class=\"title\">ArchTech's Resource</p>\n<br>\n<script type=\"text/javascript\" src=\"http://l2.io/ip.js?var=myip\"></script>\n          <p class=\"ip\" style=\"font-size:300%;color:#33FF33;\" align=\"center\">Your IP is <script>document.write(myip);</script>\n</html>\n\nIl communique avec http://l2.io/ip qui lui transmet en retour votre IP.\nPas trop sérieux car il réalise cette demande en http.\nSi vous êtes sur tor seulement sur le réseau zeronet, et le reste de votre navigateur n'y est pas, l'IP reçu sera la vrai, et non celle utilisée sur le réseau zeronet.\n\n",
			"added": 1458589274
		},
		{
			"topic_id": 2,
			"title": "[En cours de finalisation] Clonage site Zerotalk FR entier pour test",
			"body": "Bonjour\nJ'ai transformé ce lien en archive zerotalk FR. (normalement, aucune modif ne peut être réalisée)\nhttp://127.0.0.1:43110/133wwN1GKngFkXe7Lv2nwiSJZ6KrEx6Mj1/\nPour copier zerotalk FR : \nAller sur la page ZeroHello de Zeronet : http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D\nRéalisez un clique gauche sur les 3 petits points verticaux à droite du site Zerotalk FR  ( http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D) et cliquez sur clone:\nEnsuite, aller dans le dossier \"data\", \"users\" du zerotalk FR d'origine et copier tous les dossier \"XXgerXXrgcgrec456gsh\" (exemple) et le fichier \"zerotalk\". \nCopiez les fichiers énoncés ci-dessus dans les dossiers  \"data\", \"users\"  du nouveau site.\nEt normalement, votre zerotalk FR est fonctionnel et cloné.\nTest réalisé sous windows\n",
			"added": 1458760006
		},
		{
			"topic_id": 3,
			"title": "[Stopé] Clonage du site Play",
			"body": "Bonjour tout le monde\n## Mise à jour le 05-04-2016:\nJe viens de réfléchir à une question principal (j'aurais dû le faire avant):\nEs-ce légal de copier un site et de le diffuser sur autre adresse, sans consentement de son propriétaire ?\nJe me suis documenté un petit peu et il me semble que non.\nBref, je stop tout avant d'avoir des problèmes et j'ai supprimé tout le site de mon dossier data.\n\n##Archive \nJe suis en train de tester si c'est possible de copier Play, comme sa. Voici le site et n'hésitez pas à allez le voir afin de me dire s'il est fonctionnel : \nhttp://127.0.0.1:43110/1xxxxxxx (le lien est enlevé afin qu'il soit supprimé définitivement de 0net)\n\nPar contre, je ne peux expliquer comment il fonctionne, comment ajouter des films. Désolé, une recherche devra être effectuée sur les fichiers stockés dans le dossier du site.",
			"added": 1459720377
		},
		{
			"topic_id": 4,
			"title": "Sites et listes de sites sur Zeronet",
			"body": "Sites ou listes de sites intéressants sur Zeronet\n## Benchmark\nhttp://127.0.0.1:43110/Benchmark\nCe benchmark permettrai (pas sûr à 100%) de mesurer les performances de votre PC en cryptographie, en base de donnée et peut être autre chose\n__ \n## Blogs\nInformatique : http://127.0.0.1:43110/1MNb8vJAyyYEhmn5Lo962DttpGE7NYp4Yp/\nSon auteur nous fait découvrir de petites pépites : logiciels, systèmes d'exploitations, trucs & astuces ...\n__\n## Quelques infos sur le fonctionnement de votre ZeroNet : \n(Connaitre son IP, le nombre de peers connectés aux sites que  vous uploadez ...)\nhttp://127.0.0.1:43110/Stats\n__\n## ZeroChat FR :\nLe chat francophone :\nhttp://127.0.0.1:43110/fr.0rc.bit/\n__\n## ZeroPress : \nhttp://127.0.0.1:43110/zeropress.bit/\nArticles sur ZeroNet dans de nombreuses langues dont le français\n__\n## ZeroWiki : \nListe de sites (principalement en anglais) : \nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:list-of-zites\n____________________________________\nPS : N'hésitez pas à créer votre site.\nVoici de l'aide pour vos création (en anglais) : \nhttps://zeronet.readthedocs.org/en/latest/ (rubrique : Site Development)\n\nPS 2 : Si des infos sont péronés, n'hésite pas à me laissez un message afin que je rectifie.\nDe plus, si vous avez des petites bombes utiles, pas farfelus, lol, n'hésitez pas à nous les faire découvrir.\n\n\n",
			"added": 1460570905
		}
	],
	"topic_vote": {
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": 1,
		"4_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": 1
	},
	"next_comment_id": 24,
	"comment": {
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 1,
				"body": "Bonjour tous le monde\n## Quel est l'utilité de ce benchmark ?",
				"added": 1458333612
			},
			{
				"comment_id": 3,
				"body": "Merci pour ta réponse.\nVoici le résultat : \nCryptBitcoin:\n- hdPrivatekey x 10..........0.469s [x1.49: Fine]\n- sign x 10..........0.218s [x1.61: Fine]\n- openssl verify x 100..........0.328s [x1.13: OK]\n- pure-python verify x 10..........1.094s [x1.46: Fine]\n\nCryptHash:\n- sha256 5M x 10..........0.515s [x1.17: OK]\n- sha512 5M x 10..........0.562s [x1.07: OK]\n- os.urandom(256) x 100 000..........2.031s [x0.32: Ehh]\n\nMsgpack:\n- pack 5K x 10 000..........0.734s [x1.06: OK]\n- unpack 5K x 10 000..........1.141s [x1.05: OK]\n- streaming unpack 5K x 10 000..........1.266s [x1.11: OK]\n\nDb:\n- Open x 10..........0.047s [x2.77: WOW]\n- Insert x 10 x 1000..........1.078s [x0.93: OK]\n- Buffered insert x 100 x 100..........2.062s [x0.63: Goodish]\n- Total rows in db: 20000\n- Indexed query x 1000..........0.765s [x0.33: Ehh]\n- Not indexed query x 100..........0.625s [x0.96: OK]\n- Like query x 100..........1.703s [x1.06: OK]\n\nDone. Total: 14.92s\n\nPar contre, es ce possible d'avoir la signification de \"Ehh\"?",
				"added": 1458406541
			},
			{
				"comment_id": 22,
				"body": "> [jsr022](#comment_2_1LxuvfWTHKc38YkapNeKYRm9WNN6DmjhYz): il semble mesurer des performances en cryptographie et en bases de données, ce qui dépend fortement du CPU (et aussi de la RAM si t'en as pas beaucoup !)\n\nOkey. Thx a lot",
				"added": 1460742309
			}
		],
		"1_1QESmp3qVTC4wekwXp8yzeScpLGsLhMgHM": [
			{
				"comment_id": 2,
				"body": "Heu là , boujouo hes chasseurs \nOh le temps s'raguernaudit, y'a les poules qui s'acroupionnent, on va n'avé une ' r'napée\nIl n'restaient pon à d'meuther en Jèrri car i' siévaient les bêtes et i' lus abriyaient dans des caves dans les falaises du hoummet tch'est achteu.\nNou n'est pon seux entouor l'originne du nom\nBref, je suis un Normand, qui dit de la merde (car je ne sais pas parler la langue de mes ancetres :-(, honnnte a mo !!!)\nEt je me balade sur le zeronet...",
				"added": 1458334399
			}
		],
		"1_1JGsW6FQa6CRSGwBqrZoUWhw1SEjs2P88": [
			{
				"comment_id": 4,
				"body": "Je te comprends et encore, nous sommes petits (et assez bien en France, mais ce n'est pas une raison pour accepter les pilules) dans ce monde de déglingué où règne le profis, des profis ....\nNe jamais baissé les bras, au travail et dans le privé et toujours se remette en cause.\n\nL'humain est un numéro dans cette organisation qui est un capitalisme désorganisé.\nCe capitalisme a été très utile car il a fait naitre de nombreuses évolutions, découvertes mais les Hommes ne doivent pas être traité comme des choses. \nDe multiples alternatives existent et nos putains de politiciens continues leur fonction piloté par des lobies sans ce souciés des habitants (un peu quand même, mais pas trop)\nDe nombreuses méthodes de vies apparaissent, Crowfunding entre particulier (tout en faisant attention à l'intermédiaire s'il y en a un), information alternative (et rester ouvert et ne jamais croire sur parole un journal, TV ou papier. Vérifier souvent les sources, surtout des sondages), plainte en groupe contre une marque...\nPar contre, certains traités sont en négociations et peuvent nous faire du mal : TAFTA et TTIP.\nSi c'est traités sont acceptés, les multinationales seront plus fortes que les états...\nLes partis politiques, gauche, droite n'existent plus. Notre pays est piloté par Bruxelle et l'Union Européenne.  Ouvré les yeux et ce n'est pas de la science fiction. Pourquoi de nombreux anglais souhaitent quitter l'UE !!\nUn référendum sur l’accord d’association (de libre-échange) entre l’Union européenne et l’Ukraine va avoir lieu au Pays Bas le 04 avril 2016:\nhttps://blogs.mediapart.fr/djordje-kuzmanovic/blog/150116/les-pays-bas-sappretent-infliger-une-lecon-de-democratie-lunion-europeenne\n\"Jean-Claude Juncker, président de la Commission européenne, craignant les conséquences d’un tel vote juste avant des élections législatives cruciales au Pays-Bas et en France en 2017, mais aussi en pleine négociation du TTIP, le traité de libre-échange transatlantique, a enjoint les citoyens des Pays-Bas à ne pas  \"mal voter\" \"\n",
				"added": 1458423947
			},
			{
				"comment_id": 19,
				"body": "Pour ceux qui n'ont pas le temps de se documenter et qui souhaitent toujours regarder leur \"Journaux TV du 20 h\", \n\nhttp://www.tvlibertes.com/\n\nC'est site internet qui réalise des journaux TV (environ 25 min) , diffusés sur Youtube du lundi au vendredi, vers 20h (peut être avant) :\nLes 2 présentateurs et les personnes qui commentent les petits reportages s'expriment très bien et les sujets sont bien développés (mieux que les chaine principales). \nA vous de vous faire une idée.\nFini TF1 et autres conneries. \nSi vous connaissez d'autres site d'info fiables qui réalisent des journaux TV, n'hésitez pas à les faire partager.\n",
				"added": 1459970295
			}
		],
		"1_1Nz3CsGw5hkJSvjNsSbcFQru4bkau8i3Rd": [
			{
				"comment_id": 5,
				"body": "Bonjour\nPeux-t'on choisir les noeuds de sorties d'entrée et de sorties ?\n",
				"added": 1458587349
			}
		],
		"3_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 6,
				"body": "C'est vrai que ce ZeroTalk est bien, pour un début, mais fait un peu fouillis :-)\nIl faudrait des catégories, une fonction de recherche...\n",
				"added": 1458587555
			},
			{
				"comment_id": 18,
				"body": "Si vous n'avez toujours pas eu de réponse, le zerotalk FR est facilement clonable, avec tous les posts bien sur , expliqué ici : \nhttp://127.0.0.1:43110/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET/?Topic:2_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w.",
				"added": 1459884021
			}
		],
		"1_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 7,
				"body": "Ok, merci",
				"added": 1458757964
			}
		],
		"1_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 8,
				"body": "N'hésite pas à créer ton site :-)",
				"added": 1458758009
			}
		],
		"2_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 9,
				"body": "Merci de la réponse. RRR. sa fonctionne de mon côté, mais je suis en local et surement que le pb provient de chez moi.",
				"added": 1458763449
			},
			{
				"comment_id": 10,
				"body": "hummm, merci pour vos retours. J'ai du supprimer trop de fichiers utiles.\nJe suis en mode test sur un autre, en gardant le maximum de fichier et il semble prometteur V3: \nhttp://127.0.0.1:43110/133wwN1GKngFkXe7Lv2nwiSJZ6KrEx6Mj1/ ",
				"added": 1458847655
			},
			{
				"comment_id": 11,
				"body": "bonjour\nJe n'ai pas testé. Je testerai plus tard et je ferai un tuto si sa fonctionne",
				"added": 1459188567
			},
			{
				"comment_id": 15,
				"body": "Excusez moi, je n'ai pas répondu à toutes les questions. Je répare mon erreur right now :-)\nP\nour de ce qui est de créer un site comme play, oui c'est possible. Mais bon, il n'est pas si génial que sa.\nLes utilisateurs ne peuvent poster de liens pointant vers un fichier à télécharger.\n\nDe plus, je ne connais pas de tuto sur le clonage de site. \n\nSinon, voici de l'aide en anglais pour comprendre le fonctionnement d'un site sur zeronet et pour en créer 1 :\nhttps://zeronet.readthedocs.org/en/latest/ Site en anglais (rubrique : Site Development)\n",
				"added": 1459449221
			},
			{
				"comment_id": 16,
				"body": "Transformation du site de test en archive de zerotalk FR et modification du poste principal\nN'hésitez pas à tester la copie et me dire si cela marche chez vous.",
				"added": 1459735659
			}
		],
		"3_14yeJduXkemL1WVGqk9kJ1Wrn3UgBD175y": [
			{
				"comment_id": 12,
				"body": "Voici ce que je vois quand je clique sur ton lien : \nUne page grisatre avec le texte suivant en haut à gauche :\n\"Not Found\"\n\"index.html\"",
				"added": 1459355197
			},
			{
				"comment_id": 21,
				"body": "> [flatc0de](#comment_1_1DoS1LGhn8h9g9WzQtCaoX83tdPLgpKHUK): Et on fait comment pour en mettre un en place ?\nJe ne peux t'aider car j'ai juste réalisé des copies de sites existants\nRegarde ici, tu trouvera peut être ton bonheur  :\nhttps://zeronet.readthedocs.org/en/latest/ Site en anglais (rubrique : Site Development)",
				"added": 1460566856
			}
		],
		"1_1M1c7x7SLau8D2bm8Gw8iWQbBqe9X4zqPw": [
			{
				"comment_id": 13,
				"body": "Bonjour, au revoir, sava ?, a plus tard\nHello, Good Bye, How are you?, see you soon\nDu texte, une politesse et un savoir vivre est toujours gratuit :-)",
				"added": 1459447551
			},
			{
				"comment_id": 14,
				"body": "désolé, erreur de grammaire : sont toujours gratuit",
				"added": 1459447634
			}
		],
		"3_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 17,
				"body": "Je viens de réfléchir à une question principal (j'aurais dû le faire avant): \nEs-ce légal de copier un site et de le diffuser sur autre adresse, sans consentement de son propriétaire ?\nJe me suis documenté un petit peu et il me semble que non. \nBref, je stop tout avant d'avoir quelques problèmes. \nPS : J'ai réussi à le faire fonctionner en local. :-)",
				"added": 1459881186
			}
		],
		"2_14yeJduXkemL1WVGqk9kJ1Wrn3UgBD175y": [
			{
				"comment_id": 20,
				"body": "https://zeronet.readthedocs.org/en/latest/ Site en anglais (rubrique : Site Development)",
				"added": 1460566766
			}
		],
		"1_1rqn9p4Qmho987KZCDKBGcTCRbqmrnQCd": [
			{
				"comment_id": 23,
				"body": "Es-ce un blog ciblé sur un sujet ?",
				"added": 1461261508
			}
		]
	},
	"comment_vote": {}
}