{
	"posts": [
		{
			"id": "3da0fd6f-5ac5-4e5c-912e-277f709d26d7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5dfa8ea9-aead-4412-8f9e-77120e1d216d",
			"body": ">>572da4dc-e3b1-4a8d-97ef-299a25a9edff\nThen she should listen to Putin who very diplomatically called her along with her handlers *and* the open border agenda pushers conniving racist scum in one fell swoop:\n> No one has explained to Greta that the modern world is complex and different and ... people in Africa or in many Asian countries want to live at the same wealth level as in Sweden\n> Of course, emotions are inevitable, but still if we want to be effective, we must stay professional.\nI don't have the numbers, but IIRC the developed world where eco-nonsense comes from generates far more pollution and waste than a large chunk of poorer nations combined. If they actually meant anything they said, they would have cleaned up their act before playing the blame game.",
			"time": 1570238061398,
			"files": "[]"
		},
		{
			"id": "1feee2af-d7e0-4667-b99f-a12dc421a860",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fd5517ff-1c3d-4468-8897-7ea5345fa079",
			"body": ">>c82a7149-c693-403c-b393-2056022b4864\nBugmenot has ceased to be useful ages ago. Now it either returns nothing or banned/deleted accounts for most sites that need it.",
			"time": 1570239353191,
			"files": "[]"
		},
		{
			"id": "a153c307-627b-4131-9377-d572880a529e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "0188815e-c312-4638-b2ff-549c1c9c83fa",
			"body": ">>d8718391-67fc-4ec7-8fe7-0078215aaee5\n>die just like yellowvests\nWrong. Yellow vests are still doing their thing across the country but any talk of it is forbidden or downplayed in the MSM. The riot police are still resorting to violence and tear gas to disperse large groups. Check local French news and you'll still see stuff like that going on.",
			"time": 1570517069269,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}