{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "¿Hay suficiente gente aquí?",
			"body": "Buenas. Esto de ZeroNet me tiene fascinado desde hace días. Si bien no es la primera vez que se monta algo así, sí que por primera vez lo encuentro suficientemente sencillo de usar como para recomendarlo a cualquier usuario. Creo que esto puede ser algo grande si se consigue que venga gente y para ello es fundamental que haya algo interesante. Tengo la capacidad y las ganas de montar cosas aquí pero necesitaría saber si hay gente en ZeroNet intersada o bien esto está más muerto que vivo. Así que os pediría que comentárais este mensaje para tomar el pulso un poco al colectivo español aquí y, si es posible, me gustaría que indicárais si estaríais interesados sólo en consumir contenidos o bien si estaríais dispuestos y tenéis la capacidad de generarlo o subirlo (o incluso de programar web). En cualquier caso un saludo a tod@s.",
			"added": 1517476340
		},
		{
			"topic_id": 2,
			"title": "AnimeZero - Streaming de anime en español",
			"body": "A ver qué os parece esta web: http://127.0.0.1:43110/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4/",
			"added": 1518820698
		},
		{
			"topic_id": 3,
			"title": "La Guardia Civil cierra Divxtotal y otras 22 webs P2P, y habrá más \"cierres\" próximamente",
			"body": "La Guardia Civil acaba de anunciar el inicio de una campaña de bloqueo de páginas dedicadas a compartir por P2P contenidos con propiedad intelectual. Con el nombre de \"operación CASCADA\", se ha realizado una primera fase en la que se han cerrado 23 páginas, entre las que se encuentran DivxTotaL, GamesTorrents o Estrenos DTL.\n\nTal y como se ha explicado en el comunicado oficial, las páginas cerradas destacan por su antigüedad y prestigio entre los usuarios, y compartían material audiovisual protegido como películas, serie, música y videojuegos. Este movimiento es sólo una primera fase, por lo que es de esperar que se produzcan nuevos cierres masivos en los próximos días.\n\n\"La mayoría de las páginas web investigadas contaban con unos índices de visitas diarios muy elevados, siendo algunas de ellas de las más conocidas y utilizadas en nuestro país para descargar ilegalmente y de manera gratuita, todo tipo de material audiovisual protegido\", podemos leer en el comunicado.\n\nLa Guardia Civil apunta que los administradores de estos dominios operaban desde el extranjero, desde donde estaban obteniendo importantes beneficios económicos con la publicidad y la gestión de las bases de datos, tanto de enlaces como de usuarios. También aseguran que aproximadamente el 80% del tráfico de estas páginas venía de España.\n\nAunque dependiendo de tu conexión es posible que todavía puedas ver funcionando a alguna de estas webs, tanto sus páginas principales como sus principales redirecciones han sido ya cerradas. Cuando entras a ellas, te encontrarás con un mensaje diciéndote que el dominio ha sido intervenido y se encuentra en disposición judicial.\n\nEn el comunicado también se apunta a que hasta ahora, estas páginas han estado utilizando todo tipo de trucos como cambios de dominio para migrar su contenido y evitar al cierre. Eso ha llevado, según la Guardia Civil, a que componentes del Departamento de Delitos Telemáticos de su Unidad Central Operativa se vieran obligados a implementar una serie de medidas para provocar un bloqueo total de las páginas.\n\nSobre estas medidas no han dado detalles, por lo que es difícil saber si sólo han confiscado los dominios o hay más. En cualquier caso, habrá que esperar a ver cómo se desarrollan los acontecimientos en las próximas horas para ver hasta qué punto hay posibilidad de que las páginas vuelvan a abrir o no.\n\nLa operación que tiene difícil ser efectiva\n\nLa Guardia Civil se ha referido a este cierre de páginas como \"la primera de una serie de actuaciones que se llevarán a cabo\". Por lo tanto, es de esperar que se realicen nuevos cierres durante los próximos días o semanas, aunque de momento no tenemos pistas sobre cuáles pueden ser las futuras páginas afectadas.\n\nEn cualquier caso, la experiencia de otros cierres nos dice que en este juego del gato y el ratón las autoridades suelen tener las de perder. Pueden cerrar el acceso a las páginas o incluso destruir sus bases de datos, pero normalmente no tardan en surgir nuevas webs que tratan de aprovechar la caída de esos gigantes para tratar de posicionarse como una alternativa.\n\nPor lo tanto, parece bastante difícil que estas medidas puedan tener un impacto real y duradero en las descargas P2P más allá del de hacer que los usuarios que quieran realizar las descargas tengan que buscar otras páginas. Esto dependerá en gran parte de cómo evolucione la operación y cómo reaccionen ante la inevitable apertura de nuevas páginas alternativas.",
			"added": 1519168433
		},
		{
			"topic_id": 4,
			"title": "Fariña",
			"body": "Si alguien está interesado en el libro \"Fariña\" (el que han secuestrado esta semana). Está en el IFS tanto en [EPUB](/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/1EjCZapTECBem63aaBazBrwa9eh9AwmXuq/Farina_-_Nacho_Carretero.epub) como [PDF](/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/1EjCZapTECBem63aaBazBrwa9eh9AwmXuq/Farina_-_Nacho_Carretero.pdf).",
			"added": 1519342508
		},
		{
			"topic_id": 5,
			"title": "Thor: Ragnarok (2017) [720p Esp]",
			"body": "Por si a alguien le interesa: http://127.0.0.1:43110/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4/",
			"added": 1519723674
		}
	],
	"topic_vote": {},
	"next_comment_id": 22,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "un saludo a todos. auguro un gran futuro a esta plataforma la verdad :D",
				"added": 1517318984
			}
		],
		"1_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 2,
				"body": "Bueno pues parece que por aquí ya no pasa ni el Tato : (",
				"added": 1518257538
			},
			{
				"comment_id": 5,
				"body": "Hombre. Alguien da señales de vida. Mira una de las cosas que tengo en mente es montar un NETFLIX de ANIME en español. Creo que tendría su sitio aquí. Pero claro si no hay nadie de habla hispana por aquí pues mi gozo en un pozo. En el foro inglés sí que hay movimiento pero por aquí está la cosa regular. ¿Tú crees que la gente lo usaría?",
				"added": 1518545978
			},
			{
				"comment_id": 19,
				"body": "Últimamente veo más gente por aquí. Sobre todo desde que tan entrado todos los de forocoches. Quizá ya seamos suficientes para montar algo en español. ¿Qué pensáis que tendría más interés?: cómics, pelis, anime, ...",
				"added": 1527002474
			}
		],
		"1_1BGWexcsjvPpnPZVmmioZvwBBQ3WoZsWuQ": [
			{
				"comment_id": 3,
				"body": "¿Estás sólo aportando los documentos o pretendes que los colguemos en ZeroNet?",
				"added": 1518257864
			},
			{
				"comment_id": 4,
				"body": "Veo que son todos el mismo archivo. Un PDF de más de 800 páginas aunque ocupa poco al ser prácticamente todo texto (no llega a 4 MB). En cuanto al contenido le he echado un vistazo y me parece que no voy a estar de acuerdo con las ideas que transmite pero en cualquier caso me lo voy a leer. Es interesante. En cuanto a publicarlo aquí en ZeroNet es muy fácil. Si quieres te lo hago yo o te digo cómo es y lo subes tú mismo.",
				"added": 1518259055
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 6,
				"body": "Hay algun HUB español en ZeroMe?",
				"added": 1518772059
			}
		],
		"2_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 7,
				"body": "Lo del audio ¿por qué lo dices? ¿Prefieres audio japonés a español? En cualquier caso es algo que estoy mirando (audio y subtítulos) pero no es trivial hacerlo en HTML. En cuando a las pelis clásicas. Menciona algunas a ver si hay suerte y las tengo a mano. Sí que te pediría un favor: prueba a poner una peli (por ejemplo Blame) y mira si va por streaming (si empieza a reproducirse más o menos rápido) o si tiene que descargarse entera antes de empezar (es una cosa importante en este tipo de web y que no tengo claro como funciona en ZeroNet).",
				"added": 1518992872
			},
			{
				"comment_id": 8,
				"body": "En cuanto a la reproducción estoy mirando cómo va WebTorrent para intentarlo con él o algo similar a ver si fuera posible en el futuro tener una biblioteca gigante de anime entre todos (en mi disco no cabría todo).",
				"added": 1518992954
			},
			{
				"comment_id": 9,
				"body": "Hola. He puesto una peli nueva: \"Your Name\" (http://127.0.0.1:43110/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4/data/Your%20Name/index.html). Esta vez la he puesto a través del IFS (http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/). A ver si alguien la prueba y me dice qué tal va.",
				"added": 1518999889
			},
			{
				"comment_id": 11,
				"body": "¿Con asiáticos te refieres a anime? en cualquier caso subirlos al IFS que te he enlazado puede ser buena opción.",
				"added": 1519145973
			},
			{
				"comment_id": 12,
				"body": "He agregado 3 pelis más de Studio Ghibli.",
				"added": 1519152161
			}
		],
		"5_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh": [
			{
				"comment_id": 10,
				"body": "Yo flipo. Y el tipo lo pide con toda la naturalidad del mundo. Este es el que pedía amigos en otro hilo. Hay que joderse.",
				"added": 1519140153
			}
		],
		"3_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 13,
				"body": "Quizá es el momento de que los usuarios tomemos las riendas del asunto y comencemos a compartir los archivos entre nosotros a través de ZN. Y dejar de tragarnos los anuncios que todas estas webs piratas nos meten a la fuerza. Si nos unimos podemos tener la mayor biblioteca de contenidos audiovisuales en español que nunca haya existido, a prueba de cierres y libre de publicidad.",
				"added": 1519168539
			},
			{
				"comment_id": 14,
				"body": "Yo creo que es más que posible. Ya hay un zite de [Anime](/16MSit65b2i7XFsTQyvTB1zwd8kfbcegQ4) que está empezando y el código es muy fácil. La cosa es que haya suficientes hispanohablantes aquí como para que haya interés y que podamos mantener los contenidos online entre todos. La parte técnica está resuelta. El problema es que haya gente.",
				"added": 1519252865
			},
			{
				"comment_id": 15,
				"body": "> [raspdani](#comment_3_18arkBiTNCaEEu3gcyw7CuZFEJdjBoqJh9): llevo tiempo buscando documentación para desarrollar webs dinamicas, a la vez sigo experimentando con 0net y se me plantean muchas dudas sobre el funcionamiento, disponibilidad del contenido, Yo tengo una maquina que puedo usar de servidor para montar una plataforma, mi tiempo también es limitado, tengo conocimientos de html, css, javascript, nodejs, sql, json. Si alguien estuviera dispuesto a desarrollar o experimentar me puede contactar por aqui o en el correo de 0\n\ntomo nota de tu nick. yo tambien llevo un tiempo probando cosas por aqui y creo que esto tiene un gran potencial. estamos en contacto",
				"added": 1519340365
			}
		],
		"6_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh": [
			{
				"comment_id": 16,
				"body": "cuidadin con el leososa7777 este: http://127.0.0.1:43110/165eqHdoQfyf7CVGqtVCGNDvMBZhwVSJBL/?Topic:5_1HdCZUfNgcjinB2LUKrajPcWDHigQzASKh/Alguien+me+dice+pajina+de+pidofilos+etc",
				"added": 1519520344
			}
		],
		"4_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": [
			{
				"comment_id": 17,
				"body": "> [ragnarredbeard](#comment_1_12ShEEixS7XubE6ymmNaMCJ9x1bAj8Pk7V): Pues yo quiero invitarte a conocer la primera edición de Might is Right en español, cabe destacar que es la edición oficial en este idioma: http://goo.gl/L6TuZP\n\npor que pones un enlace a la clearnet? por que no lo pones disponible a traves de ZN?",
				"added": 1520894400
			}
		],
		"1_1EeQ3cEhqrErmYhjLF6yfyzi8kKTaitdKr": [
			{
				"comment_id": 18,
				"body": "> [johnnymnemonic](#comment_1_1KWcXwtuktBNACsYDjCAZCy16HgmoM4AU): Yeee, alguno sabe si está mierda de zeronet es anónima o solo descentralizada??\n\nZeroNet en principio es sólo descentralizada. Si además quieres anonimato tienes que acceder a ella mediante Tor.",
				"added": 1526678776
			}
		],
		"1_1QCyQRZtSRyWmTbPnUHfa8i6ZMADipKbr1": [
			{
				"comment_id": 20,
				"body": "Por supuesto. Si quieres usar la red Tor, tienes que utilizar el navegador Tor.",
				"added": 1527321972
			}
		],
		"1_16R5QjbfiJiwuFDRPAHdMrM9i4Dy2EWaUg": [
			{
				"comment_id": 21,
				"body": "https://www.repelisplus.ch/",
				"added": 1529764000
			}
		]
	},
	"comment_vote": {
		"5_1Lh89nAb4YeizEER15JUcpscy37mZwDUer": 1,
		"1_18arkBiTNCaEEu3gcyw7CuZFEJdjBoqJh9": 1,
		"10_1EjCZapTECBem63aaBazBrwa9eh9AwmXuq": 1
	}
}