{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "A Special Tactic by the White House",
			"body": "The below content is a draft of statement that may serve as reference, if some leaders decide to fight back more aggressively with **a special Propaganda War, at the special stage of history with Unrestricted Warfare already launched by the Atheism Gang against the whole civilized world with the flooding of coronavirus. ** \nThe bilingual edition will be more powerful. \n\nEven if it’s not used at all, some of the discussion may still serve as reference for leaders who like more flexible tactics. For example,\nbased on Miles Yu’s strategy that differentiates Chinese people from the CCP, further fine—tuning of tactics can be applied on the counterattack in this Unrestricted War, by further differentiation of the 90 million grassroots CCP members from a small group of top-rank hooligan leaders.  \nWhen such flexibility is adopted, America will win the war at an early date. \n\n\n##Special Statement \nThis is to clarify that \nDonald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely against the oppression in the Cultural Revolution, and made great contribution to the Reform and Opening revolution in the 1980's. \nTo keep the Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. It complies with the glorious history of Xi's family legacy. It deserves nationwide support by the whole Chinese nation. \nThe Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, Donald Trump may resume communication with President Xi when necessary.\n\n###特 別 聲 明 \n唐納德•特朗普（Donald Trump）在此聲明：\n特朗普對中共領導人習近平的尊重主要是由於習近平的父親習仲勳先生的光輝榮譽所激發。習仲勳先生曾因為反對文化大革命的壓迫而英勇奮鬥，並為1980年代的改革開放做出了巨大貢獻 。\n保持改革開放政策，有助於保持更好的透明度，並更好地對抗新冠病毒所造成的全球性瘟疫。 這種努力也有利於保護習氏家族的光輝歷史， 應該得到整個中華民族的全面支援。\n應對全球性的冠狀病毒瘟疫，需要地球上所有國家的共同努力。 為了促進新文明的實現，唐納德•特朗普會在必要時恢復與習主席的溝通。\n\nSimplified Chinese Version:\n###特 别 声 明 \n唐纳德•特朗普（Donald Trump）在此声明：\n特朗普对中共领导人习近平的尊重主要是由于习近平的父亲习仲勋先生的光辉荣誉所激发。习仲勋先生曾因为反对文化大革命的压迫而英勇奋斗，并为1980年代的改革开放做出了巨大贡献 。\n保持改革开放政策，有助于保持更好的透明度，并更好地对抗新冠病毒所造成的全球性瘟疫。 这种努力也有利于保护习氏家族的光辉历史， 应该得到整个中华民族的全面支持。\n应对全球性的冠状病毒瘟疫，需要地球上所有国家的共同努力。 为了促进新文明的实现，唐纳德•特朗普会在必要时恢复与习主席的沟通。\n\n###Remarks:\nDonald Trump made mistakes by underestimating the destroying power of the coronavirus and the GFW system that distorts many facts.\n\nHowever, compared with other people who may be charged with treason against America, Donald Trump doesn’t have complicated business relationship with East Asia, so Donald Trump is NOT the worst candidate for 2020 president election. \n\nNo leaders are perfect.\nhttps://www.masterclass.com/classes/doris-kearns-goodwin-teaches-us-presidential-history-and-leadership \nAll people learn to grow on the journey of life. \n\nBased on logical reasoning, similar tactic may help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his personal friendship with a vicious dictator.  \n\n## As it’s based on hypothesis,  \nif there’s anything for Donald Trump to apologize for his mistake, then the White House can make further apologies by stating that \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, the White House appeals righteous people all over the world, including Chinese people, Chinese army, and those grassroots CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, to stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\n\nThe above will be enough to launch a special **Propaganda War, which will accelerate the collapse of the Atheism Gang of the FAKE CCP.** \n\nWith the acceleration of the CCP’s collapse, Donald Trump will naturally get higher ratings on his presidential job, so as to win the 2020 election campaign!",
			"added": 1598449596
		},
		{
			"topic_id": 2,
			"title": "The Humiliated Situation of Donald Trump to be Changed …",
			"body": "###War, Virus, Revolution …\n\nThe Coronavirus is just one of the pandemic weapons spread by \"the CCP” in mainland, China, which is in fact **\"an Atheism Gang of the Fake CCP”** that completely destroys traditional Communism, as represented by the pursuit by Emperor Xi Jin Ping’s father Xi Zhong Xun, who was himself brutally persecuted by the atheism regime. \nIt was spread purposefully,  with the vicious aim to destroy the free world and the modern civilization.  It’s part of the Unrestricted War.   \n(Note: the term **”CCP”** hereafter always refers to the **\"the Atheism Gang of the Fake CCP”, the details of which are available in separate topic** —  [Liberate Hong Kong, A New Approach …  ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1594275549_1PPHzUHjZ77arm8QhzTWpWL5H6ECqd9oeD/)\n)\n \nAs a new type of warfare, the Unrestricted War means fighting in both tangible traditional way, and the intangible way, mainly in the **information battlefield** that includes cyberspace war, espionage infiltration, **culture pollution, propaganda war,**  financial war, besides biochemical weapons like the special pandemic virus of Covid19… \n\n###1) The Unrestricted War \n####1.1) Traditional Hot War Not Feasible \nIn August 2020, there’s a well-calculated action by “the CCP” to intensify their threaten against Taiwan, during the time when Alex Azar, the U.S. health secretary visited Taiwan. \nhttps://www.forbes.com/sites/davidaxe/2020/08/10/chinas-jets-are-pushing-closer-and-closer-to-taiwan/#7094886343f3  \n\nThe \"CCP’s\" action was foreseen by the US-Japan-Taiwan Alliance force.  Several F16 fighters took off, and the \"CCP”’s J10 fighters had to retreat after short time invasion of Taiwan’s Sovereignty of Air-Defense Identification Zone. \n\nDonald Trump apparently made mistakes by underestimating the toxicity of the coronavirus and the GFW’s poison. After the Covid19 pandemics going out of control, the Trump Administration was anxious to see a certain scale of hot war break out at Taiwan Straights or South China Sea, so as to enhance people’s ratings on his presidential job. \n\nHowever, **the fake \"CCP”, as the most vicious Atheism Gang on the planet, are very crafty.**  Due to brutal dictatorship that resulted in backward technology innovation, they could see that there’s no advantage in conventional weapons. So they dared not fire the first shot. \n\nOn the US side, due to strict Rule of Law enforced in the military, the US army could not fire the first shot either. \n\n**So solution by means of hot war seems not workable. **\n\n####1.2) The Intangible War Never Stops \nDue to failures of innovation on conventional weapons, \"the CCP's” major threaten against the free world relies on their nuclear weapons. \nWith hundreds of warheads, plus intercontinental missiles,  \"the CCP's” threaten is certainly hundreds of times worse than the North Korea nuclear issue. \n\nSo a few hooligan leaders of the Atheism Gang of the Fake CCP could behavior much more barbarically than North Korean dictator Kim Jong-un.  The crazy Hong Kong security law is just one of the examples. \n\n**To confront such an abnormally vicious atheism gang, some special means should be adopted, so as to accelerate the collapse of the “CCP”. **\n\n###2) Special Means to Fight against the \"CCP” \n\"Know the enemy and know yourself; one hundred battles, not defeated\"  — Sun Tsu’s Art of War \n\nAs to the special means, some netizens have discovered a new approach to accelerate the collapse of the atheism gang of the FAKE CCP. \nDetails are presented in other topics, such as \"Liberate Hong Kong\", and  **\"A Special Tactic by the White House\". **\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House\n\nBefore specific means are adopted, some analysis of **the special features of the Atheism Gang of the Fake CCP should be made.** \n####2.1) The functions of the GFW \nThe notorious GFW is known by almost everybody in the free world. However, on the land of China dominated by the atheism gang, at least more than 60% of ordinary people don’t know what is GFW, though they often use internet on WeChat, TikTok, etc. \n\nWhy are there so strange phenomena? \nIt’s because **the Most Scary Thing** for the atheism gang is not confrontation against the West Civilization, but failures to brainwash the large scale of population that dwells on the continent in East Asia. \n\nFor the atheism gang of the fake \"CCP”, they’re always worried about the trend that the percentage of people awakened up will be higher and higher, which will automatically end their dictatorship. \n\nGFW certainly can’t be used as weapons to fight against American troops.  But there’s high spending on constant upgrading of the GFW system. Together with other huge expenditures on suppressing down domestic Chinese people’s fighting for freedom, the total spending on Stability Maintenance (called as Wei Wen in Chinese Ping Yin) has surpassed **the \"CCP’s” expenditures on military!! **\n \n \n###2.2) The Necessity to Take Special Means\n####2.2.1) Simple Facts of the Atheism Gang’s Danger\nFacts have proven that not only many ordinary citizens disappeared totally on this planet, due to the Covid19 pandemic weapon, some top-rank leader’s family members are also knocked down by the coronavirus. \n\nThere’re wide-spread rumors that Donald Trump’s brother Robert Trump died of diseases triggered by infection of the coronavirus, while Vladimir Putin’s daughter was also seriously affected due to the special demand for power maneuver by Putin, who required his daughter Katerina Tikhonova be used in an experiment on Covid19 vaccines, by forcing her to inoculation of the \"sputnik 6” vaccine on the virus, and then acute fever occurred on Katerina Tikhonova. \n\nWhether Katerina is still alive or not, needs further verification.  \nHowever, all the facts can simply prove that the Covid19 virus can attack any person, whether they’re of Royal aristocracy descent, or grassroot family background. \n\n### 2.2.2) The Humiliated Situation of Trump to be Changed … \nBefore the Covid19 outbreak, Donald Trump often emphasized his personal relationship with \"CCP’s\" President Emperor Xi.  Due to low rating on his presidential job, now Trump even refused to do communication with Xi. \n\n**The Special Tactic by the White House in fact belongs to the scope of Propaganda War in the new type of Unrestricted Warware. **\n\nBesides Donald Trump, many people in China, including **Second-generation Red Aristocrats** made mistakes by underestimating the style and the craziness level of Emperor Xi’s dictatorship, since Emperor Xi’s father **Mr. Xi Zhong Xun was indeed a great hero**. ** Mr Xi Zhong Xun insisted on fighting against the oppression by the Cultural Revolution, despite being brutally tortured by the regime …   Mr Xi Zhong Xun is not only a hero among many ordinary Chinese people, but also among many grassroot CCP members ** (many of whom are not much different from ordinary American citizens, except a little over-emphasis on atheism mentality due to the long time brainwashing by the \"CCP\" regime). \n\nA lady named Chai Xia exiled to the USA, so as to seek better ways of fighting.  In the past, Chai Xia also supported Emperor Xi’s anti-corruption movement, which only intensified more corruptive dictatorship. \n\nSo there’s no wonder that Donald Trump could bring more humiliation to himself, \n###if he’s NOT prudent enough about his personal relationship with Dictator Xi.  \n\nWith the Special Tactic by the White House ,  the Propaganda War will be waged by the USA in a very graceful and polite way. \n \nWith the bona fide clarification that \n**Donald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely against the oppression in the Cultural Revolution, and made great contribution to the Reform and Opening revolution in the 1980's. **\nTo keep the **Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. It complies with the glorious history of Xi's family legacy. It deserves nationwide support by the whole Chinese nation. **\n**The Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, Donald Trump may resume communication with President Xi when necessary. ** \n\n(The bilingual version will be more powerful, details of which are in below URL: \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House ) \n\nIt’d help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his **personal friendship with a vicious dictator.**  \nIf there’s anything for Donald Trump to apologize, then the White House can make further apologies by stating that \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, the White House appeals righteous people all over the world, including \n###Chinese people, Chinese army, and those grassroot CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, \nto stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\n\nThe above will be enough to launch a special **Propaganda War**, which will accelerate the collapse of the Atheism Gang of the FAKE CCP. \n\n###2.2.3) The Reality of Sensitive Election Season \nThe special part of  2.2.2) The Humiliated Situation of Trump to be Changed …  is based on hypotheses of an ideal operation by a good team with wise people who seriously respect America’s constitution and the universal value of gun rights and human rights. \n\nIn reality, quite many people keep speculative mind, including the merchant-minded President Donald Trump.  \n\nThere’s very harsh criticism against Donald Trump.\nhttps://www.brookings.edu/blog/order-from-chaos/2020/07/27/pompeos-surreal-speech-on-china/ \n**All the criticism goes to the points well! **\n\n**The only pity is that the author doesn’t indicate another simple fact — despite all the serious problems, Donald Trump doesn’t have complicated business relationship with East Asia, so compared with other people who may be charged with treason against America, \n####Donald Trump is NOT the worst candidate. **\n\n**There’s also powerful exposure by Donald Trump’s niece Mary Trump \nhttps://www.youtube.com/watch?v=guoiy0bZbT8 \nThe \"Most Dangerous\" Man. ** \n\nHowever, before the trouble of coronavirus is settled, no one can be more dangerous than Covid19!  \n\nFurthermore, mutations of coronavirus have emerged. \nFirst Documented Coronavirus Reinfection Reported in Hong Kong \nhttps://www.nytimes.com/2020/08/24/health/coronavirus-reinfection.html  \n\nIt means that without thorough discovery of the earliest origin of the virus in Wuhan, China, people’s knowledge of the virus may be limited.  The vaccines developed in the past may not work effectively on the sophisticated mutations of Covid19. \n\n####To settle the coronavirus also requires a total collapse of the Atheism Gang of the FAKE CCP. \n\n**To fight against the coronavirus, and to eradicate the atheism gang who specifically spread the virus on purpose,  the \"Most Dangerous\" Man Donald Trump is in fact not dangerous enough.  ** \n\nNo leaders are perfect.\nhttps://www.masterclass.com/classes/doris-kearns-goodwin-teaches-us-presidential-history-and-leadership  \nAll people learn to grow on the journey of life.\n\nThe Trump’s family can also be victims of the virus, or victims by the ShaodowGate … (details available in additional remarks) \n\nBut he has the unusual capability to fight back, so people will stand up with Donald Trump. \n\n###Additional Information:\nAs can be seen by some people, there’s a project Pearl Peace, focused on Christendom expansion in East Asia, especially on the atheism land of China, where churches emerge up one after another, despite various tough obstacles. \n\nAs to the Propaganda War, besides the Special Tactic by the White House, there’re some other tactics such as changing the Chinese style of VoiceOfAmerica, with more powerful elements added into the Propaganda War, as discussed by a famous team **APAT \"(All People Act Together)\", who focus on a National Uprising in China**.  \n\n\n**The Special Tactic of Propaganda War**,  appeals all people to support a peaceful revolution coming on the way (in fact mainly targeted on military people as a special effort), but avoid the deterioration of Trump's personal relationship with Emperor Xi.  In fact, all the efforts are focused on the positive trend — to protect the glory of Xi's glorious family legacy left by his father Xi Zhong Xun. \n\nEmperor Xi might be not educated well enough to understand the special efforts.  However, many descendents of other Princelings will response positively, since all of them are extremely anxious just like Ren Zhi Qiang and Wu Xiao Hui (Deng Xiao Ping's grand son-in-law) who were jailed without justice. \n\n**More importantly, the Special Statement will help Donald Trump** \n## continually benefit from his relationship with Emperor Xi, \n** making it as an advantage, instead of as a shame now due to the Coronavirus going out of control!! \n\nSome of the special ideas are inspired by Miles Yu’s peculiar approach. \nMiles Yu, a key player in new approach to Beijing\nhttps://www.washingtontimes.com/news/2020/jun/15/miles-yu-mike-pompeo-adviser-helps-form-china-poli/ \n\nMiles Yu’s methodology to differentiate the CCP from Chinese people is a very clever strategy!  On the aspect of protecting America’s homeland, such strategy is enough. Prohibiting all CCP members from entering the USA is a good way to reduce the flooding virus deeply permeated in American society. \n\nIn order to fight back in the Unrestricted Warfare, such methodology can be further fine-tuned, such as **differentiating ordinary grassroot-level CCP members from a small group of top-rank hooligan leaders**.  \n###The number of grassroot CCP members is above 90 million, \nand by extension of their family relationships, it’s indirectly related to hundreds of millions of Chinese people. \n\nSo in order to fight back more effectively, further fine-tuning of tactics will produce special results once the policy makers in the USA recognize **the big potential of flexible tactics in this Unrestricted Warfare**.  \n\n###Special Remarks: \nAt a special stage of history with Unrestricted Warfare that includes Covid19 pandemics concerning the basic freedom of breath for all people living on the planet, implementation of good tactics needs some fundamental consensus — that  \n**there are no absolute atheists, for one simple reason — if they can’t deny the fact that each individual has a certain sense of \"holy space\" in their soul, which may be related either to the \"sacred\" love of their loved ones, or the \"holy” passion of their occupation, then they can't deny the fact that there’s a certain sense of \"holy” God image in their soul. This can be taken as a simple \"scientific” logic, a common sense, without the need of large scale of geometry formulas to prove the logic.**\n\nBased on this consensus, some wise people will see that most of the CCP members are in fact victims by the brainwashing machine of the atheism gang. **So long as they haven’t committed serious crimes in the past, most of them can be pardoned for their mistaken choice of the atheism ideology. **  \n\nTo fight back by a special Propaganda War requires serious mentality. \nDonald Trump’s biggest enemy is the capricious mind of his own. \n\nThanks to the special constitutional system, no one can distort America at their personal will.  Though it took several months for Trump to see that his attitude on refusing to wear face masks was wrong, once he changed his mind, he does look to be more serious on some seemingly-trivial issues, which in fact have significant influence for leaders at a turbulent time.   \n\nThe Trump’s family can also be victims of the virus, or victims by \n###the ShadowGate … \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate \n\nThe manmade pandemics may make some of the top-rank US elite fight back more aggressively?  If so, the probability may be above 50% for special tactics on the Propaganda War to be adopted?",
			"added": 1598451944
		},
		{
			"topic_id": 3,
			"title": "The Most Vicious Scheme …",
			"body": "As to the original photo format file,\nhttp://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1599982185_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Nuclear+Bomb+Suicide+Very+Crazy+Scheme \n\nBelow is the text edition of the crazy scheme by the most vicious Atheism Gang of the FAKE CCP, for easier reference. \n\nIn the past，when we were doing military research, there was always a misconception that the United \nStates could be destroyed only by dropping nuclear bombs on the United States．\n\nIn fact, if you hit hundreds of nuclear bombs to the US, secondary disasters and so on, the \nworld will be completely destroyed． In this way, there is no need to drop a nuclear bomb．\nIt is very easy to destroy the world．Here are three examples:\n1. When a nuclear submarine loaded with nuclear warheads is detonated in the Pacific Ocean．\nthe huge wave can exceed 2000 meters, which will submerge all areas except the Qinghai Tibet\nPlateau；\n\n2．Detonating thousands of nuclear bombs in the Himalayas at the same time can change the orbit of\nthe earth, and the earth will carry all mankind to the boundless Dark Universe；\n\n3．Drilling 10,000 meters deep in the Sichuan Basin and implanting thousands of nuclear bombs at\nthe same time will trigger the collapse of the earth's core and the extinction of human beings all over\nthe world．\n\nTherefore, if Trump is bent on fighting against China, leaving no living space for the yellow and \nblack people,or even intervening in the future war to liberate Taiwan, the ultimate result of Trump's\nactions will be the destruction of all mankind．\n\nI admit it's a very evil idea．But when we get to the end, it's the ultimate solution．Americans can't\nbe both anti human and save itself．Are Americans ready to see God as much as possible when they \nintervene in Chinese affairs? Trump should make a good assessment. \n",
			"added": 1600011935
		},
		{
			"topic_id": 4,
			"title": "When Rage Conquers Fear …",
			"body": "https://chinadigitaltimes.net/chinese/634216.html \n二月。墨水足够用来痛哭，\n大放悲声抒写二月，\n一直到轰响的泥泞，\n燃起黑色的春天。\n——帕斯捷尔纳克\n\n豕鼠交替之际，九衢首疫，举国大疫，一时间神州肃杀，人心惶惶。公权进退失据，致使小民遭殃，疫疠散布全球，中国渐成世界孤岛。此前三十多年“改革开放”辛苦积攒的开放性状态，至此几乎毁于一旦，一巴掌把中国尤其是它的国家治理打回前现代状态。而断路封门，夹杂着不断发生的野蛮人道灾难，迹近中世纪。原因则在于当轴上下，起则钳口而瞒骗，继则诿责却邀功，眼睁睁错过防治窗口。垄断一切、定于一尊的“组织性失序”和只对上负责的“制度性无能”，特别是孜孜于“保江山”的一己之私而置亿万国民于水火的政体“道德性败坏”，致使人祸大于天灾，在将政体的德性窳败暴露无遗之际，抖露了前所未有的体制性虚弱。至此，人祸之灾，于当今中国伦理、政治、社会与经济，甚于一场全面战争。再说一遍，甚于一场全面战争。此可谓外寇未逞其志，而家贼先祸其国。老美或有打击中国经济之思，不料当轴急先锋也。尤其是疫疠猖獗当口，所谓“亲自”云云，心口不一，无耻之尤，更令国人愤慨，民心丧尽。\n\n是的，国民的愤怒已如火山喷发，而愤怒的人民将不再恐惧。至此，放眼世界体系，揆诸全球政治周期，综理戊戌以来的国情进展，概略下述九项，兹此敬呈国人。\n\n许章润\n\n首先，政治败坏，政体德性罄尽。保家业、坐江山，构成了这一政体及其层峰思维的核心，开口闭口的“人民群众”不过是搜刮的税收单位，数目字管理下的维稳对象和“必要代价”，供养着维续这个极权政体的大小无数蝗虫。公权上下隐瞒疫情，一再延宕，只为了那个围绕着“核心”的灯红酒绿、歌舞升平，说明心中根本就无生民无辜、而人命关天之理念，亦无全球体系中休戚相关之概念。待到事发，既丢人现眼，更天良丧尽，遭殃的是小民百姓。权力核心仍在，而低效与乱象并生，尤其是网警效命恶政，动如鹰犬，加班加点封锁信息，而信息不胫而走，说明特务政治临朝，国安委变成最具强力部门，虽无以复加，却已然前现代，有用复无用矣。其实，老祖宗早已明言，防民之口甚于防川，哪怕网信办再有能耐，也对付不了十四万万张嘴，古人岂余欺哉!盖因一切围绕江山打转，自以为权力无所不能，沉迷于所谓“领袖”之自欺，而终究欺瞒不住。大疫当前，却又毫无领袖德识，捉襟见肘，累死前方将士，祸殃亿万民众，却还在那里空喊政治口号，这个那个，煞有介事，令国人齿冷，让万方见笑。此亦非他，乃政体之“道德性败坏”也。若说七十年里连绵灾难早已晓瑜万众极权之恶，则此番大疫，更将此昭显无遗。惟盼吾族亿万同胞，老少爷们，长记性，少奴性，在一切公共事务上运用自己的理性，不要再为极权殉葬。否则，韭菜们，永难得救。\n\n其次，僭主政治下，政制溃败，三十多年的技术官僚体系终结。曾几何时，在道德动机和利益动机双重驱动下，一大批技术官僚型干才上阵，而终究形成了一种虽不理想、弊端重重、但却于特定时段顶事儿的技术官僚体系。其间一大原因，就在于挂钩于职位升迁的政绩追求，激发了贫寒子弟入第后的献身冲动。至于乘势而上的红二们，从来尸位素餐，酒囊饭袋，成事不足败事有余，在此不论。可惜，随着最近几年的不断整肃，红色江山老调重弹，只用听话的，自家的，其结果，技术官僚体系的德性与干才，其基于政绩升迁的那点儿冲动，不知不觉，乃消失殆尽。尤其是所谓“红色基因”的自家人判准及其圈定，让天下寒心而灰心，进而，离德离心。于是，这便出现了官场上普遍平庸而萎顿委琐之态。鄂省乱象，群魔乱舞，不过一隅，其实省省如此，举朝如此矣。其间原因，就在于这个后领袖时代，领袖制本身就在摧毁治理结构，口言现代治理却使整个国家治理陷入无结构性之窘境。此间症状，正为“组织性失序”和“制度性无能”。君不见，惟一人马首是瞻，而一人暝朦，治国无道，为政无方，却弄权有术，遂举国遭罪。百官无所适从，善者只堪支应，想做事而不敢做事，恶者混水摸鱼，不做事却还搅事，甚而火中取栗，遂劣胜优汰，一团乱象矣。\n\n再次，内政治理全面隳颓。由此急转直下，遂表现为下述两方面。一方面，经济下滑已成定势，今年势必雪上加霜，为“风波”以来所未有，将“组织性失序”和“制度性无能”推展至极。至于举国信心下跌、产权恐惧、政学愤懑、社会萎缩、文化出版萧条，惟剩狗屁红歌红剧，以及无耻文痞歌功颂德之肉麻兮兮，早成事实。而最为扼腕之处，则为对于港台形势之误判，尤其是拒不兑现基本法的普选承诺，着着臭棋，致使政治公信力跌至谷底，导致中国最为富庶文明之地的民众之离心离德，令世界看清这一政体的无赖嘴脸。那边厢，中美关系失序，而基于超级大国没有纯粹内政的定律，这是关乎国运之荦荦大端。恰恰在此，当轴颟顸，再加上碰到个大洋国的特没谱，遂一塌糊涂。网议“帝国主义亡我之心不死”，想做而没做成的事，却让他做成了，岂只调侃，而实锥心疼痛也哉。另一方面，几年来公权加紧限制与摧毁社会发育，钳口日甚，导致社会预警机制疲弱乃至于丧失，遇有大疫，便从封口而封城，死心复死人矣。因而，不难理解的是，与此相伴而来的，便是政治市侩主义与庸俗实用主义蔓延政治，无以复加，表明作为特殊时段的特殊现象登场的“知青政治”，早已德识俱亡。可以说，上上下下，他们是四十年来最为不堪的一届领导。因而，此时此刻，兑现《宪法》第35条，解除报禁，解除对于网络的特务式管控，实现公民言论自由和良心自由，坐实公民游行示威和包括结社在内的各项自组织权利，尊重全体国民的普遍人权，特别是政治普选的权利，而且，对于病毒的来源、隐瞒疫情的责任人及其体制性根源，启动独立追责机制，才是“战后重建”之大道，也是当务之急也。\n\n复次，内廷政治登场。几年来的集权行动，党政一体之加剧，特别是以党代政，如前所述，几乎将官僚体制瘫痪。动机既靡，尾大不掉，遂以纪检监察为鞭，抽打这个机体卖命，维续其等因奉此，逶迤着拖下去。而因言论自由和现代文官体制阙如，更无所谓“国王忠诚的反对者”在场，鞭子本身亦且不受督约，复以国安委一统辖制下更为严厉之铁腕统领，最后层层归属，上统于一人。而一人肉身凡胎，不敷其用，党国体制下又无分权制衡体制来分责合力，遂聚亲信合议。于是，内廷生焉。说句大白话，就是 “集体领导”分解为“九龙治水”式寡头政制失效、相权衰落之际，领袖之小圈子成为“国中之国”，一个类似于老美感喟的隐形结构。揆诸既往，“1949政体”常态之下，官僚体系负责行政，纵便毛时代亦且容忍周相一亩三分地。“革委会”与“人保组”之出现，打散这一结构，终至不可维持。晚近四十年里，多数时候“君相”大致平衡，党政一体而借行政落实党旨。只是到了这几年，方始出现这一最为封闭无能、阴鸷森森之内廷政治，而彻底堵塞了重建常态政治之可能性也。一旦进路闭锁，彼此皆无退路，则形势紧绷，大家都做不了事，只能眼睁睁看着情形恶化，终至不可收拾之境。置此情形下，经济社会早已遭受重创，风雨飘摇于世俗化进程中的伦理社会不堪托付，市民社会羸弱兮兮，公民社会根本就不存在，至于最高境界的政治社会连个影子都没有，则一旦风吹草动，大灾来临，自救无力，他救受阻，必致祸殃。此番江夏之乱，现象在下，而根子在上，在于这个孜孜于“保江山，坐江山”，而非立定于人民主权、“以文明立国，以自由立国”的体制本身。结果，其情其形，恰如网议之“集中力量办大事”，顿时变成了“集中力量惹大事”。江夏大疫，再次佐证而已矣。\n\n第五，以“大数据极权主义”及其“微信恐怖主义”治国驭民。过往三十多年，在底色不变的前提下，官方意识形态口径经历了从“振兴中华”的民族主义和“四化”的富强追求，到“三个代表”和“新三民主义”，再至“新时代”云云的第次转折。就其品质而言，总体趋势是先升后降，到达“三个代表”抛物线顶端后一路下走，直至走到此刻一意赤裸裸“保江山”的“大数据极权主义”。相应的，看似自毛式极权向威权过渡的趋势，在“奥运”后亦且止住，而反转向毛氏极权回归，尤以晚近六年之加速为甚。因其动用奠立于无度财政汲取的科技手段，这便形成了“1984”式“大数据极权主义”。缘此而来，其“微信恐怖主义”直接针对亿万国民，用纳税人的血汗豢养着海量网警，监控国民的一言一行，堪为这个体制直接对付国民的毒瘤。而动辄停号封号，大面积封群，甚至动用治安武力，导致人人自危，在被迫自我审查之际，为可能降临的莫名处罚担忧。由此窒息了一切公共讨论的思想生机，也扼杀了原本应当存在的社会传播与预警机制。由此，“基于法西斯主义的军功僭主政治”渐次成型，却又日益表现出“组织性失序”和“制度性无能”，其非结构性与解结构性。职是之故，不难理解，面对大疫，无所不能的极权统治在赳赳君临一切的同时，恰恰于国家治理方面居然捉襟见肘，制造大国一时间口罩难求。那江夏城内，鄂省全境，至今尚有无数未曾收治、求医无门、辗转哀嚎的患者，还不知有多少因此而命丧黄泉者，将此无所不能与一无所能，暴露得淋漓尽致。盖因排除社会与民间，斩断一切信息来源，只允许党媒宣传，这个国家永远是跛脚巨人，如果确为巨人的话。\n\n第六，底牌亮出，锁闭一切改良的可能性。换言之，所谓的“改革开放”死翘翘了。从2018年底之“该改的”、“不该改的”与“坚决不改”云云，至去秋十九届四中全会公报之诸般宣示，可得断言者，中国近代史上的第三波“改革开放”，终于寿终正寝。其实，这一死亡过程至少起自六年前，只不过至此算是明示无误而已。回头一望，二十世纪全球史上，但凡右翼极权政治，迫于压力，皆有自我转型的可能性，而无需诉诸大规模流血。纵便是“苏东波”，尤其是东欧共产诸国等红色极权政体，居然亦且和平过渡，令人诧异而欣慰。但吾国刻下，当局既将路径锁闭，则和平过渡是否可能，顿成疑问。若果如此，则“兴，百姓苦;亡，百姓苦”，夫复何言!但愿此番大疫过后，全民反省，举国自觉，看看尚能重启“第四波改革开放”否!?\n\n第七，由此顺流直下，中国再度孤立于世界体系，已成定局。百多年里，对于这个起自近代地中海文明、盛极于大西洋文明的现代世界体系，中国上演了多场“抗拒”与“顺从”的拉锯战，反反复复，跌跌撞撞。晚近三十多年里，痛定思痛，“低头致意”以及“迎头赶上”，乃至于“别开生面”，蔚为主流。惜乎近年再度犯二，犯横，表明“改开”走到头了，左翼极权“退无可退”，无法于和平过渡中完成自我转型，因而，也就怪异于现代世界体系。虽则如此，总体而言，几番拉锯下来，中国以其浩瀚体量与开放性态度，终于再度跻身现代世界体系，成为这个体系的重要博弈者，重新诠释着所谓“中心—边缘”的地缘叙事，也是事实。但是，与国力和时势不相匹配、太过张扬的外向型国策，尤其是内政回头，日益“法西斯化”，引发这个体系中的其他博弈者对于红色帝国崛起的戒慎戒惧，导致在高喊“人类命运共同体”之际却为共同体所实际拒斥的悲剧，而日呈孤立之势，更是眼面前的事实。事情很复杂而道理却很简单，一个不能善待自己国民的政权，怎能善待世界;一个不肯融入现代政治文明体系中的国族，你让人怎么跟你共同体嘛!故尔，经济层面的交通互存还将继续存在，而文明共同体意义上的孤立却已成事实。此非文化战争，亦非通常所谓“文明冲突”一词所能打发，更非迄今一时间数十个国家对中国实施旅行禁限，以及世界范围的厌华、拒华与贬华氛围之悄悄潮涨这么简单。——在此可得提示者，隐蔽的“黄祸”意识势必顺势冒头，而买单承受歧视与隔离之痛的只会是我华族同胞，而非权贵——毋宁，关乎对于历经磨难方始凝练而成的现代世界普世价值的顺逆从违，而牵扯到置身列国体系的条约秩序之中，吾国吾族如何生存的生命意志及其国族哲学，其取舍，其从违。在此，顺昌逆亡，则所谓孤立者，全球现代政治文明版图上之形单影只、孤家寡人也。扭转这一局面，重建负责任大国形象，担负起应担之责，而首先自良善内政起始，必然且只能皈依人类普世文明大道，特别是要坐实“主权在民”这一立国之本。在此，内政，还是内政，一种“立宪民主，人民共和”的良善政体及其有效治理，才是摆脱孤立、自立于世界体系的大经大法，而为国族生存与昌盛之康庄大道也。那时节，顺时应势，中国加入G7 而成G8，亦且并非不可想象者也。\n\n第八，人民已不再恐惧。而说一千道一万，就在于生计多艰、历经忧患的亿万民众，多少年里被折腾得一佛升天二佛出世的“我们人民”，早已不再相信权力的神话，更不会将好不容易获得的那一丝丝市民自由与三餐温饱的底线生计，俯首帖耳地交还给僭主政制，任凭他们生杀予夺。毋宁，尤其是经此大疫，人民怒了，不干了。他们目睹了欺瞒疫情不顾生民安危的刻薄寡恩，他们身受着为了歌舞升平而视民众为刍狗的深重代价，他们更亲历了无数生命在分分钟倒下，却还在封号钳口、开发感动、歌功颂德的无耻荒唐。一句话，“我不相信”，老子不干了。若说人心看不见摸不着，最最无用，似乎经验世界早已对此佐证再三，也不无道理。这不，万民皆曰可杀，他却坐享天年，如那个人人唾骂之李大鸟者，令人感慨天不长眼，天道不公，可实际上，天是苦难本身，与我们一同受罪。但是，假如说人之为人，就在于人人胸腔里跳动着一颗人心，而非狼心狗肺，其因生老病死而悲欣交集，其因祸福义利而恨爱交加，其因落花而落泪、流水而伤怀，则人心所向，披荆斩棘，摧枯拉朽矣!人心丧尽之际，便是末日到来之时!至于脑残与岁月静好婊们，一群乌合之众，历史从来不是他们抒写的，更不因他们而改变奔流的航道，同样证之于史，不予欺也。\n\n第九，败象已现，倒计时开始，立宪时刻将至。戊戌修宪，开启邪恶之门，集权登顶之际，恰恰是情势反转之时。自此一路狂奔倒退，终至败象连连。撇开人心已丧不论，则前文叙及之港台应对失策与中美关系失序，以及经济下滑之不可遏止、全球孤立，表明治理失败，违忤现代政治常识的强人政治事与愿违。大家面对闷局而恐惧其已成僵局，苦思焦虑其开局与再布局，期期于内部生变式与自下而上式之破局犹如水中捞月之时，港台形势发展实已自边缘捅破铁桶，而开辟出一线生机。此种自边缘破局、而渐进于中心的和平过渡之道，或许，将成为中国式大转型的收束进路。此时，吾友所说之“难城”，或为华夏旧邦新命之耶路撒冷。换言之，边缘突破意味着现代中国的立宪时刻再度即将降临。当此关口，天欲晓，将明未明，强权抱残守缺，不肯服膺民意，则崇高之门既已打开，可得预言者，必有大量身影倒毙于黎明前矣。\n\n以上九点，呈诸国民，均为常识。而一再申说，就在于国家治理未入常态政治轨道，国族政治文明有待现代转型，而于积善前行中，期期以“立宪民主，人民共和”收束这波已然延续一个半世纪的文明大转型。正是在此，我们，“我们人民”，岂能“豬一般的苟且，狗一樣的奴媚，蛆蟲似的卑污”?!\n\n行文至此，回瞰身后，戊戌以来，在下因言获罪，降级停职，留校察看，行止困限。此番作文，预感必有新罚降身，抑或竟为笔者此生最后一文，亦未可知。但大疫当前，前有沟壑，则言责在身，不可推诿，无所逃遁。否则，不如杀猪卖肉。是的，义愤，如西哲所言，正是义愤，惟义与愤所在，惟吾土先贤揭橥之仁与义这一 “人心人路”之激荡，令书斋学者成为知识分子，直至把性命搭进去。毕竟，自由，一种超验存在和行动指归，一种最具神性的世界现象，是人之为人的禀赋，华夏儿女不能例外。而世界精神，那个地上的神，不是别的，就是自由理念的绚烂展开。如此，朋友，我的亿万同胞，纵然火湖在前，何所惧哉!\n\n脚下的这片大地啊，你深情而寡恩，少福却多难。你一点点耗尽我们的耐心，你一寸寸斫丧我们的尊严。我不知道该诅咒你，还是必须礼赞你，但我知道，我分明痛切地知道，一提起你，我就止不住泪溢双眼，心揪得痛。是啊，是啊，如诗人所咏，“我不要温和地走进那个良夜，老年应当在日暮时燃烧咆哮;怒斥，怒斥那光明的消逝。”因而，书生无用，一声长叹，只能执笔为剑，讨公道，求正义。置此大疫，睹此乱象，愿我同胞，十四万万兄弟姐妹，我们这些永远无法逃离这片大地的亿万生民，人人向不义咆哮，个个为正义将生命怒燃，刺破夜瘴迎接黎明，齐齐用力、用心、用命，拥抱那终将降临这片大地的自由的太阳!\n\n庚子正月初四初稿，初九定稿，窗外突降大雪\n请点击购买许章润教授著作：戊戌六章\nhttps://www.amazon.com/gp/product/1715096819/",
			"added": 1631334871
		},
		{
			"topic_id": 5,
			"title": " International Whistleblower or Crime Exposure Act ",
			"body": "Lee Wen Liang Act \n— International Whistleblower or Crime Exposure Act \n\nWhen you surround an army, leave an outlet free. Do not press a desperate foe too hard. Such is the art of warfare.\n围师遗阙，穷寇勿迫，此用兵之法也。\nThe Art of War — Sun Tzu\n\nSince Trump Administration of 2016, America has made tremendous efforts to awaken up more and more allies on the imminent danger imposed by the CCP against the civilized world. \n\nAfter the controversial 2020 Election, some policies by Trump Administration were changed, with some measures further strengthened, while many tactics adjusted. \n\nAfter a peculiar withdrawal of military from Afghanistan, more disputes occurred. Despite a big chaos of rights and wrongs in the cyberspace, there're still some honorable military leaders who haven't lost their minds yet. \n\nhttps://video.foxnews.com/v/6272827874001/ \nRetired general calls for Milley's resignation, says military has lost confidence in Joint Chiefs chair. \n\nFrom the superficial phenomena, it can be seen that the Biden Administration indeed made some efforts on rallying up a big team of allies to support America's fighting against (or \"competition with\" ?) the CCP's expansion and invasion by coronavirus. \n\nIf those efforts are indeed meant to revitalize America's fine culture, then further efforts can be made to accelerate the collapse of the CCP, such as establishing a system of International Whistleblower or Crime Exposure Act, to encourage more people who know the inside stories of the true situation to imitate the brave example set by Chinese Doctor Lee Wen Liang who simply exposed the crimes of the dangerous virus by a good doctor’s conscience. , without the intention on obtaining either the secular fame as a \"Hero\" or other physical interest in this over-entertaining age with over-flooding IT games polluting the mental world of many people all over the world!  \n\nIt's easy to see the necessity of a special legislation on International Whistleblower or Crime Exposure Act.  The details should be decided by law experts. \n\nBased on analysis of many events, some Christian associates like to suggest a few points as below. \n\nAccording to some netizens' feedback, in 2020, China's former vice minister of public security, Sun Lijun indeed had some strong ideas to expose the crimes of the CCP on the Bio-weapon production, but due to many crime activities participated by Sun Lijun himself, he hesitated for too long until it’s too late to take action.  Much of his hesitance was caused by the event of Wang Lijun’s failure in 2012, as the former Chongqing police chief was eventually rejected by America’s consulate in Chengdu, which was on the territory of the CCP and could be easily besieged by them. \nhttps://www.secretchina.com/news/gb/2021/09/14/983734.html \n\nSimilarly, in 2018, another hooligan leader in the CCP regime, named Meng Hong Wei, who was former Intepol President, once worked and lived in France, which made it more convenient for him to escape from CCP’s persecution. \nhttps://www.citizenpowerforchina.org/statement-on-the-meng-hongwei-%E5%AD%9F%E5%AE%8F%E4%BC%9F-incident-from-citizen-power-initiatives-for-china/ \nBut hooligan Meng also hesitated too much, mainly because there’re too many crime activities committed by himself, partially due to other complicated factors such as Wang Lijun's failure in 2012, and Donald Trump’s over pride on his personal friendship with Dictator Xi, since at that time Coronavirus didn’t invade America yet and President Trump indeed never cared much about a tough fighting against the CCP until the Covid19 broke out in 2020, and seriously hit America just as it hit the Chinese people! \n\nSo the major goal of the International Whistleblower or Crime Exposure Act is to encourage people to bravely rebel against the brutal CCP jungle system. \nSome provisions may go as follows. \na) Strong support will be provided by international community to those people who bravely fight back against the jungle dictatorship. \nFor whistleblowers who are able to escape CCP’s territory (like Meng Hong Wei’s case in France), they needn't worry about death-threatening danger, as strong measures will be provided by America and its allies. \nb) For some people who might have committed crimes against humanity in the past, they will be exempted from death penalty if they can provide significant evidence of those terrorist gang's crimes. \nc) For people who didn't join in the crimes and are brave enough to take the whistleblower action like Chinese Doctor Lee Wen Liang, besides strong support on security measures, there'll be awards to encourage their brave deeds.  \nd) When necessary and mutually agreed upon by the parties concerned, those whistleblowers' brave deeds can be reported by medias, to promote the heroic spirit, and to encourage more people to fight back against the jungle dictatorship system! \n\nIn short, \n###this is an unusual period of history. So unconventional methods should be adopted, \nto accelerate the collapse of the atheism jungle dictatorship of the fake CCP in East Asia.\n\nYou and I have a rendezvous with destiny. We'll preserve for our children this, the last best hope of man on earth, or we'll sentence them to take the last step into a thousand years of darkness! \n\nWhen more and more people join in the bright course, it's possible to see a new tide of Puritanism Resurrection emerge in America, accompanied with the glorious tide of freedom that government of the people, by the people and for the people, shines eternally on the planet! \n",
			"added": 1631959467
		},
		{
			"topic_id": 6,
			"title": "Adjusted Tactics",
			"body": "The more compromise is made, the more dangerous it can be!\n\nSome policy adjustments can embolden the expansion of terrorism.  The description of China as the most dangerous rival of America is now adjusted to be a strategic competitor. \n\nTherefore, terrorism activities increase rapidly on the planet. Taliban regime rose again in Afghanistan, while millions of illegal immigrants pour into America, which \n##further accelerates the spread of coronavirus mutations. \n\nIn order to curb own over-crazy conflicts, mutual deterrence strategy has to be strengthened, with the emergence of Australia as a nuclear power after the Aukus deal was done. \nhttps://www.cnn.com/2021/09/17/australia/nuclear-submarines-aukus-explainer-intl-hnk-ml/index.html \n\nSmaller nations have to unite up and act in concert.   \nThe China-Lithuania Rift Is a Wake-Up Call for Europe \nhttps://foreignpolicy.com/2021/09/22/china-lithuania-taiwan-eu-nato/   \n\nMore and more people see the necessity to enhance relationships with Taiwan. At the same time, it’s also clear that no one would like to see a crazy nuclear war occur between a few nuclear powers. \n\nSo some flexible tactics should be adopted. \n\nDuring the cold war time, in order to better fight against the former Soviet Union, an **ambiguous strategy** was adopted by the USA on the definition of China — it's not an important matter whether it'd be represented by Republic of China (中华民国) that respects the modern civilization based on Three Principles Of The People as advocated by Dr. Sun Yat-sen, or by Communism Dictatorship China which boasted itself to be a \"People's Republic of China\", but in fact tramped upon human rights like ants, and should better be defined as an atheism dictatorship jungle, or at least **NOT a republic**, as could be seen by more and more people.\n\nAt this unusual stage of history, all nations who seek to enhance relationships with Taiwan may adopt a flexible policy to promote the good.  During the process to resume the diplomatic relationships, a clear statement can be made as follows: \n**(The statement is a draft, the bilingual edition will be more powerful.)**\n\n##Statement on Taiwan Relations and One China Policy \n\nTaiwan represents the Republic of China. All the civilized nations on the planet **respect One China Policy** as much as they cherish the reality of **only One Planet suitable for human civilization in the Milky Way**, and therefore all the people over the world encourage a peaceful **reunification of China** based on the Three Principles Of The People as represented by Republic of China. The Constitutional Democracy inherited by ROC was also firmly pursued by many Red Noblemen. One prominent example is Xi Zhong Xun, who was the father of Emperor Xi Ji Pin. \n\nIn the past, many people in the West attached importance to trade and economic cooperation with the CCP regime.  Those activities were mainly triggered by Westerners’ respect of Emperor Xi's father Mr Xi Zhong Xun who fought bravely against the brutal persecution by Revolution in China and made great contribution to the Reform and Opening revolution in the 1980's. \n\nTo keep the Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. \n####It complies with the glorious history of Xi's family legacy.  \nIt deserves nationwide support by the whole Chinese nation, by all Chinese netizens and soldiers.  \n\nThe Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, when necessary, the civilized nations may resume efforts on promotion of the special relationships with mainland, China. \n\nSimplified Chinese Version:\n##关于台湾关系和一个中国的政策声明\n\n台湾是中华民国的表率。地球上的文明国度都高度尊重一个中国的原则，就如同他们知道：银河系里只有一个星球适合人类生存一样。\n因此，地球上的所有人民都鼓励在“三民主义”的基础上促进中国两岸统一。\n众所周知，中华民国的“三民主义”精神与习近平的父亲习仲勋先生以及很多其他“红军”先辈所追求的宪政民主是相符合的。\n过去，西方有很多人重视和中共政权的贸易经济合作。那些活动的开展，主要也是因为人们尊重习近平的父亲习仲勋先生的光辉历史。\n习仲勋先生曾因为反对文化大革命的压迫而英勇奋斗，并为1980年代的改革开放做出了巨大贡献 。\n保持改革开放政策，有助于保持更好的透明度，并更好地对抗新冠病毒所造成的全球性瘟疫。 这种努力也有利于保护习氏家族的光辉历史， 应该得到整个中华民族的全面支持。\n应对全球性的冠状病毒瘟疫，需要地球上所有国家的共同努力。 为了促进新文明的实现，在必要的时候，文明国度会再次努力促进和中国大陆之间的各种合作。\n\nTraditional Chinese Version:\n## 關於臺灣關係和一個中國的政策聲明\n\n臺灣是中華民國的表率。地球上的文明國度都高度尊重一個中國的原則，就如同他們知道：銀河系裡只有一個星球適合人類生存一樣。\n因此，地球上的所有人民都鼓勵在“三民主義”的基礎上促進中國兩岸統一。\n眾所周知，中華民國的“三民主義”精神與習近平的父親習仲勳先生以及很多其他“紅軍”先輩所追求的憲政民主是相符合的。\n過去，西方有很多人重視和中共政權的貿易經濟合作。那些活動的開展，主要也是因為人們尊重習近平的父親習仲勳先生的光輝歷史。\n習仲勳先生曾因為反對文化大革命的壓迫而英勇奮鬥，並為1980年代的改革開放做出了巨大貢獻 。\n保持改革開放政策，有助於保持更好的透明度，並更好地對抗新冠病毒所造成的全球性瘟疫。 這種努力也有利於保護習氏家族的光輝歷史， 應該得到整個中華民族的全面支援。\n應對全球性的冠狀病毒瘟疫，需要地球上所有國家的共同努力。 為了促進新文明的實現，在必要的時候，文明國度會再次努力促進和中國大陸之間的各種合作。\n\n##Remarks: \nThe spread of Coronavirus all over the world has proven that \nif there's no freedom of speech in East Asia, there's no freedom of breath for people in Europe or America either! \n\nTo secure free expansion of Christendom in East Asia has become a mission for our generation. It concerns the living environment of the global civilization, as the Covid19 affects the freedom of breath by all people on the planet, whether they are senior tycoons or young children!  \n\nAs the atheism regime doesn’t allow any physical organization by civilians in mainland China, Pearl Peace sees some special ways to launch a Peaceful Revolution in China. \n\nThere's a huge number of population on the vast land of China, among whom quite some people are still brainwashed by the atheism regime. The Peace Revolution in China will be a little different from other countries. \n\nTraditional Confucius culture often emphasizes loyalty to the country (to the emperor in the past).  Many people made mistakes to support CCP leader Xi Jin Ping, due to their respect of Xi Jin Ping’s father Xi Zhong Xun who did fight bravely against the Oppression by the Atheism Regime itself, and for the Reform and Opening revolution in the 1980's.  \n\nMany people’s mindset is still limited by the Confucius medieval theory of loyalty. In order to reduce the scale of potential conflicts to the minimum level, the best way to launch Peace Revolution is to appeal to all Chinese people to protect the glorious history of Xi's family legacy left by Xi Zhong Xun, as Xi Zhong Xun himself supports Constitutional Democracy with freedom of speech, freedom to worship God.  \n\nIn short, Peace Revolution in the name of protection of Emperor Xi’s glorious family legacy can avoid large scale bloody massacre in the potential conflicts, since many military people’s mindset is still limited by the medieval Confucius loyalty. \n\n\n\n## Additional information: \nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!  \nIn order to remediate the severe situation, Civilized Nations appeal righteous people all over the world, including Chinese people, Chinese army, and those grassroot CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship, to stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\nThe above will be enough to launch a special Propaganda War, which will accelerate the collapse of the Atheism Gang of the FAKE CCP. \n\nWith the acceleration of the CCP’s collapse, sustainable development of human civilization can be kept for many generations!  \n\nSome details are discussed by cyberspace activists on ZeroNet (https://zeronet.io/), a highly-encrypted platform based on Bitcoin technology.",
			"added": 1632474569
		},
		{
			"topic_id": 7,
			"title": "独特的彭帅事件 The Olympics",
			"body": "独特的彭帅事件\n— 全球觉醒、抵抗丛林暴政！\n\nThe coronavirus has killed more people than World War II in some countries and regions.  The mutations of Covid19 are attacking much more people than the past wars in the world! \n在一些国家和地区，被新冠病毒杀死的人远超第二次世界大战。变异的病毒不断地袭击世界各地的人们，攻击范围超过历次战争！\n\nWhether the virus is from nature or produced in laboratory is mysteriously \"ambiguous\", but it’s clear that the vicious spreading of the Wuhan virus is a well-known fact. \n病毒来源于自然还是实验室，还是处于神秘的“模糊”状态。但是，病毒的恶意扩散，是个很清晰的事实。\n\nAll the above attacks are launched by the Fake CCP in East Asia, which is a terrorism gang rather than a modern political party. \n这一切的攻击都被“伪共”“匿产帮”所操纵。与现代文明的所谓“政党”相比，“黄俄党”更像恐怖组织，不适合称之为某个党派。\n\nBesides the man-made disasters of the coronavirus and the inefficacy of vaccines, many crimes have occurred in Hong Kong and mainland, China where many people disappear everyday.   Some disappearances are closely related to Organ Harvest deals!  Those events don't attract worldwide attention, simply because the victims are common beings without worldwide fame!  \n除了病毒和无效疫苗的人造灾难之外，香港和大陆每天都有很多人被消失，一些案件与器官活摘有关联。那些事件没有引起持久的全球关注，只是因为受害者是普通人，没有世俗的全球知名度而已！\n\nFinally it’s time for some famous celebrities to disappear in similar style! Peng Shuai, the Tennis Champion, is just one of the examples. \n于是，被失踪的角色终于轮到全球名人身上了！ 网球冠军彭帅，只是其中一个例子而已。\n\nBefore the collapse of the Terrorism Gang in East Asia, Peng Shuai will not be the last victim of the jungle system. \n在“伪共”“匿产帮”崩溃垮台之前，彭帅不会是黄俄暴政的最后一个受害者。\n\nIn the unusual circumstances of a special time of history, to let CCP take over the manifested fame as the host of Olympics will only further instigate the audacity of the Terrorism Gang to kill more and more people every day!  \n在非常时期的非常阶段，让“伪共”“匿产帮”继续挟持奥运会举办者的光环，只会让他们更加肆无忌惮地传播病毒、屠杀更多的民众！\n\nThe physical Olympics event emphasizes fighting for honor and glory.  At this unusual moment of time, to fight for justice and fundamental dignity of human rights will be the best honor for all athletes!  \n传统的奥运会着重于为荣誉而战。在非同寻常的历史阶段，为公平正义、人权尊严而奋斗是运动员们的最好荣誉！\n\nTo fight against the expansion of CCP virus is a more challenging Marathon of Spiritual Olympics, for a traditional Olympics Game may be ended in a few weeks, but the Spiritual Marathon will take many months and years, just like the bright course to revitalize America. \n抗击“伪共”“匿产帮”的邪恶病毒扩张，是精神领域的奥运马拉松。精神空间的马拉松甚至是更严峻的挑战。因为传统的奥运会比赛一般几个星期就结束了，但是精神文明的马拉松将是一场持久战， 它将是旷日持久、持续多年的战斗征程，就如同重振美国的历史进程一样。\n\nGod bless all people on the planet the fundamental rights to keep guns, to observe the universal principle of respecting Gun Rights and Human Rights, to live with the very basic freedom of living without being threatened by Terrorism Dictatorship, whether they are famous celebrities, strong athletes with fine physical organs or simple human beings living on the tiny planet in this universe! \n原上帝庇佑这个星球上的所有人，赋予他们以持枪权，推行尊重持枪权、尊重生命的普世原则，让人们的生活免受丛林暴政的恐怖主义所威胁，无论他们是享誉全球的明星，拥有强健身体器官的运动员，还是默默无闻的普通人。在浩大宇宙中这个渺小的星球上面，只有普世原则保驾护航，所谓的“民主宪政”之普世价值才有意义。\n\n\n\n\nRemarks: \nIn her initial exposure, Peng Shuai, the well-known tennis star didn’t seriously accuse the deceptive offense by Zhang Gao Li as a sex assault, just like an abnormal extramarital affair. Since Zhang Gao Li is one of the most dangerous top-rank gang leaders of the CCP mafia, Peng Shuai immediately plunged herself into a dangerous abyss, though Peng Shuai herself may be not aware of the hell jungle situation yet.  The unusual exposure by Peng Shuai is itself of more entertainment tint rather than a serious criminal lawsuit. It means Peng Shuai’s mind could be maneuvered even more easily than Jack Ma, the former CEO of Alibaba corporation. \n网球明星彭帅在最初的信息爆料中，并没有严肃指控张高丽的欺骗威胁手段是性侵犯，而似乎更像一起异常的婚外情案例。但是，由于张高丽是“伪共”“匿产帮”最危险的头目之一，彭帅其实已经让自己陷入了无边的黑暗深渊，虽然彭帅本人并不一定清晰地意识到她个人在墙内的处境已经如同掉入地狱丛林一样，随时会被彻底消失。彭帅的不寻常的爆料，其语气和态度都不像严肃的刑事指控，但更多地带有娱乐色彩。这意味着彭帅的心理甚至比阿里巴巴前任CEO马云更加容易被操纵。\n\nCompared with Peng Shuai's event, another brave lady named Zhang Zhan deserves more serious attention by all the people over the world. Due to her brave exposure of some abnormal reality covered by the CCP on Wuhan Coronavirus, Ms Zhang has been imprisoned by CCP since 2020.  As an unapologetic Christian,  even inside the jail, she often keeps hunger strike to fight persistently against the brutal repression by the barbarous CCP. \n与彭帅的事件相比，另一位名叫张展的勇士更值得世人关注。张女士勇敢地揭露了“伪共”“匿产帮”对武汉冠状病毒的一些反常现实，自2020年以来张女士一直被邪恶的“伪共”“匿产帮”关押。 \n\nChinese journalist, Palestinian journalist and Pegasus Project receive 2021 Reporters Without Borders (RSF) Press Freedom Awards \nhttps://rsf.org/en/news/chinese-journalist-palestinian-journalist-and-pegasus-project-receive-2021-rsf-press-freedom-awards \n中国记者和巴勒斯坦记者一起获得2021 年记者无国界（RSF）新闻自由奖\n\nSo a serious Global Boycott can be based on a serious true event by a serious Christian Lady with clear distinction of rights and wrongs instead of a sports game star who can be more easily maneuvered by the jungle dictatorship system! \n一场严肃的全球性文化觉醒和抵制行动，更应该立足于严肃的、坚定的公民抗争行动。体育领域的明星，并不一定具有那么清晰的、泾渭分明的是非善恶观点，而且一些明星的个人生活空间完全处于信息雾霾沦陷区的丛林暴政，如果没有坚定的信仰，非常容易产生思想动摇，产生自相矛盾的言语和行为，最终会让墙外的支持者们和各界领袖不好找到坚定而鲜明的原则，予以长期而一贯的原则性支持。",
			"added": 1637653271
		}
	],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"3_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY": [
			{
				"comment_id": 1,
				"body": "[English part - photo format ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1599982949_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Nuclear+Bomb+Suicide+English+part+Very+Crazy+Scheme)\non the standby site serves as reference.",
				"added": 1600012508
			}
		],
		"8_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 2,
				"body": "Special topics about Zeronet \n[The Number of Peers on Zeronet is Underestimated ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1601791658_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2/The+Number+of+Peers+on+Zeronet+is+Underestimated)\n\n[ZeroNet Management to be Enhanced ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/ZeroNet+is+ruled+by+one+person+And+this+should+be+fixed)",
				"added": 1601914798
			}
		],
		"3_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX": [
			{
				"comment_id": 3,
				"body": "https://www.presidency.ucsb.edu/documents/address-behalf-senator-barry-goldwater-time-for-choosing \nThe original text is very long. \nAddress on Behalf of Senator Barry Goldwater: \"A Time for Choosing\"\n\nOctober 27, 1964\nThank you very much. Thank you and good evening. The sponsor has been identified, but unlike most television programs, the performer hasn't been provided with a script. As a matter of fact, I have been permitted to choose my own ideas regarding the choice that we face in the next few weeks.\n\nI have spent most of my life as a Democrat. I recently have seen fit to follow another course. I believe that the issues confronting us cross party lines. Now, one side in this campaign has been telling us that the issues of this election are the maintenance of peace and prosperity. The line has been used \"We've never had it so good.\"\n\nBut I have an uncomfortable feeling that this prosperity isn't something on which we can base our hopes for the future. No nation in history has ever survived a tax burden that reached a third of its national income. Today, 37 cents of every dollar earned in this country is the tax collector's share, and yet our government continues to spend $17 million a day more than the government takes in. We haven't balanced our budget 28 out of the last 34 years. We have raised our debt limit three times in the last twelve months, and now our national debt is one and a half times bigger than all the combined debts of all the nations in the world. We have $15 billion in gold in our treasury--we don't own an ounce. Foreign dollar claims are $27.3 billion, and we have just had announced that the dollar of 1939 will now purchase 45 cents in its total value.\n\nAs for the peace that we would preserve, I wonder who among us would like to approach the wife or mother whose husband or son has died in South Vietnam and ask them if they think this is a peace that should be maintained indefinitely. Do they mean peace, or do they mean we just want to be left in peace? There can be no real peace while one American is dying some place in the world for the rest of us. We are at war with the most dangerous enemy that has ever faced mankind in his long climb from the swamp to the stars, and it has been said if we lose that war, and in doing so lose this way of freedom of ours, history will record with the greatest astonishment that those who had the most to lose did the least to prevent its happening. Well, I think it's time we ask ourselves if we still know the freedoms that were intended for us by the Founding Fathers.\n\nNot too long ago two friends of mine were talking to a Cuban refugee, a businessman who had escaped from Castro, and in the midst of his story one of my friends turned to the other and said, \"We don't know how lucky we are.\" And the Cuban stopped and said, \"How lucky you are! I had someplace to escape to.\" In that sentence he told us the entire story. If we lose freedom here, there is no place to escape to. This is the last stand on Earth. And this idea that government is beholden to the people, that it has no other source of power except to sovereign people, is still the newest and most unique idea in all the long history of man's relation to man. This is the issue of this election. Whether we believe in our capacity for self-government or whether we abandon the American revolution and confess that a little intellectual elite in a far-distant capital can plan our lives for us better than we can plan them ourselves.\n\nYou and I are told increasingly that we have to choose between a left or right, but I would like to suggest that there is no such thing as a left or right. There is only an up or down--up to a man's age-old dream, the ultimate in individual freedom consistent with law and order--or down to the ant heap totalitarianism, and regardless of their sincerity, their humanitarian motives, those who would trade our freedom for security have embarked on this downward course.\n\nIn this vote-harvesting time, they use terms like the \"Great Society,\" or as we were told a few days ago by the President, we must accept a \"greater government activity in the affairs of the people.\" But they have been a little more explicit in the past and among themselves--and all of the things that I now will quote have appeared in print. These are not Republican accusations. For example, they have voices that say \"the cold war will end through acceptance of a not undemocratic socialism.\" Another voice says that the profit motive has become outmoded, it must be replaced by the incentives of the welfare state; or our traditional system of individual freedom is incapable of solving the complex problems of the 20th century. Senator Fullbright has said at Stanford University that the Constitution is outmoded. He referred to the president as our moral teacher and our leader, and he said he is hobbled in his task by the restrictions in power imposed on him by this antiquated document. He must be freed so that he can do for us what he knows is best. And Senator Clark of Pennsylvania, another articulate spokesman, defines liberalism as \"meeting the material needs of the masses through the full power of centralized government.\" Well, I for one resent it when a representative of the people refers to you and me--the free man and woman of this country--as \"the masses.\" This is a term we haven't applied to ourselves in America. But beyond that, \"the full power of centralized government\"--this was the very thing the Founding Fathers sought to minimize. They knew that governments don't control things. A government can't control the economy without controlling people. And they know when a government sets out to do that, it must use force and coercion to achieve its purpose. They also knew, those Founding Fathers, that outside of its legitimate functions, government does nothing as well or as economically as the private sector of the economy.\n\nNow, we have no better example of this than the government's involvement in the farm economy over the last 30 years. Since 1955, the cost of this program has nearly doubled. One-fourth of farming in America is responsible for 85% of the farm surplus. Three-fourths of farming is out on the free market and has known a 21% increase in the per capita consumption of all its produce. You see, that one-fourth of farming is regulated and controlled by the federal government. In the last three years we have spent $43 in feed grain program for every bushel of corn we don't grow.\n\nSenator Humphrey last week charged that Barry Goldwater as President would seek to eliminate farmers. He should do his homework a little better, because he will find out that we have had a decline of 5 million in the farm population under these government programs. He will also find that the Democratic administration has sought to get from Congress an extension of the farm program to include that three-fourths that is now free. He will find that they have also asked for the right to imprison farmers who wouldn't keep books as prescribed by the federal government. The Secretary of Agriculture asked for the right to seize farms through condemnation and resell them to other individuals. And contained in that same program was a provision that would have allowed the federal government to remove 2 million farmers from the soil.\n\nAt the same time, there has been an increase in the Department of Agriculture employees. There is now one for every 30 farms in the United States, and still they can't tell us how 66 shiploads of grain headed for Austria disappeared without a trace and Billie Sol Estes never left shore.\n\nEvery responsible farmer and farm organization has repeatedly asked the government to free the farm economy, but who are farmers to know what is best for them? The wheat farmers voted against a wheat program. The government passed it anyway. Now the price of bread goes up; the price of wheat to the farmer goes down.\n\nMeanwhile, back in the city, under urban renewal the assault on freedom carries on. Private property rights are so diluted that public interest is almost anything that a few government planners decide it should be. In a program that takes for the needy and gives to the greedy, we see such spectacles as in Cleveland, Ohio, a million-and-a-half-dollar building completed only three years ago must be destroyed to make way for what government officials call a \"more compatible use of the land.\" The President tells us he is now going to start building public housing units in the thousands where heretofore we have only built them in the hundreds. But FHA and the Veterans Administration tell us that they have 120,000 housing units they've taken back through mortgage foreclosures. For three decades, we have sought to solve the problems of unemployment through government planning, and the more the plans fail, the more the planners plan. The latest is the Area Redevelopment Agency. They have just declared Rice County, Kansas, a depressed area. Rice County, Kansas, has two hundred oil wells, and the 14,000 people there have over $30 million on deposit in personal savings in their banks. When the government tells you you're depressed, lie down and be depressed.\n\nWe have so many people who can't see a fat man standing beside a thin one without coming to the conclusion that the fat man got that way by taking advantage of the thin one. So they are going to solve all the problems of human misery through government and government planning. Well, now, if government planning and welfare had the answer and they've had almost 30 years of it, shouldn't we expect government to almost read the score to us once in a while? Shouldn't they be telling us about the decline each year in the number of people needing help? The reduction in the need for public housing?\n\nBut the reverse is true. Each year the need grows greater, the program grows greater. We were told four years ago that 17 million people went to bed hungry each night. Well, that was probably true. They were all on a diet. But now we are told that 9.3 million families in this country are poverty-stricken on the basis of earning less than $3,000 a year. Welfare spending is 10 times greater than in the dark depths of the Depression. We are spending $45 billion on welfare. Now do a little arithmetic, and you will find that if we divided the $45 billion up equally among those 9 million poor families, we would be able to give each family $4,600 a year, and this added to their present income should eliminate poverty! Direct aid to the poor, however, is running only about $600 per family. It would seem that someplace there must be some overhead.\n\nSo now we declare \"war on poverty,\" or \"you, too, can be a Bobby Baker!\" Now, do they honestly expect us to believe that if we add $1 billion to the $45 million we are spending...one more program to the 30-odd we have--and remember, this new program doesn't replace any, it just duplicates existing programs--do they believe that poverty is suddenly going to disappear by magic? Well, in all fairness I should explain that there is one part of the new program that isn't duplicated. This is the youth feature. We are now going to solve the dropout problem, juvenile delinquency, by reinstituting something like the old CCC camps, and we are going to put our young people in camps, but again we do some arithmetic, and we find that we are going to spend each year just on room and board for each young person that we help $4,700 a year! We can send them to Harvard for $2,700! Don't get me wrong. I'm not suggesting that Harvard is the answer to juvenile delinquency.\n\nBut seriously, what are we doing to those we seek to help? Not too long ago, a judge called me here in Los Angeles. He told me of a young woman who had come before him for a divorce. She had six children, was pregnant with her seventh. Under his questioning, she revealed her husband was a laborer earning $250 a month. She wanted a divorce so that she could get an $80 raise. She is eligible for $330 a month in the Aid to Dependent Children Program. She got the idea from two women in her neighborhood who had already done that very thing.\n\nYet anytime you and I question the schemes of the do-gooders, we are denounced as being against their humanitarian goals. They say we are always \"against\" things, never \"for\" anything. Well, the trouble with our liberal friends is not that they are ignorant, but that they know so much that isn't so. We are for a provision that destitution should not follow unemployment by reason of old age, and to that end we have accepted Social Security as a step toward meeting the problem.\n\nBut we are against those entrusted with this program when they practice deception regarding its fiscal shortcomings, when they charge that any criticism of the program means that we want to end payments to those who depend on them for livelihood. They have called it insurance to us in a hundred million pieces of literature. But then they appeared before the Supreme Court and they testified that it was a welfare program. They only use the term \"insurance\" to sell it to the people. And they said Social Security dues are a tax for the general use of the government, and the government has used that tax. There is no fund, because Robert Byers, the actuarial head, appeared before a congressional committee and admitted that Social Security as of this moment is $298 billion in the hole. But he said there should be no cause for worry because as long as they have the power to tax, they could always take away from the people whatever they needed to bail them out of trouble! And they are doing just that.\n\nA young man, 21 years of age, working at an average salary...his Social Security contribution would, in the open market, buy him an insurance policy that would guarantee $220 a month at age 65. The government promises $127. He could live it up until he is 31 and then take out a policy that would pay more than Social Security. Now, are we so lacking in business sense that we can't put this program on a sound basis so that people who do require those payments will find that they can get them when they are due...that the cupboard isn't bare? Barry Goldwater thinks we can.\n\nAt the same time, can't we introduce voluntary features that would permit a citizen who can do better on his own to be excused upon presentation of evidence that he had made provisions for the non-earning years? Should we allow a widow with children to work, and not lose the benefits supposedly paid for by her deceased husband? Shouldn't you and I be allowed to declare who our beneficiaries will be under these programs, which we cannot do? I think we are for telling our senior citizens that no one in this country should be denied medical care because of a lack of funds. But I think we are against forcing all citizens, regardless of need, into a compulsory government program, especially when we have such examples, as announced last week, when France admitted that their Medicare program was now bankrupt. They've come to the end of the road.\n\nIn addition, was Barry Goldwater so irresponsible when he suggested that our government give up its program of deliberate planned inflation so that when you do get your Social Security pension, a dollar will buy a dollar's worth, and not 45 cents' worth?\n\nI think we are for an international organization, where the nations of the world can seek peace. But I think we are against subordinating American interests to an organization that has become so structurally unsound that today you can muster a two-thirds vote on the floor of the General Assembly among the nations that represent less than 10 percent of the world's population. I think we are against the hypocrisy of assailing our allies because here and there they cling to a colony, while we engage in a conspiracy of silence and never open our mouths about the millions of people enslaved in Soviet colonies in the satellite nation.\n\nI think we are for aiding our allies by sharing of our material blessings with those nations which share in our fundamental beliefs, but we are against doling out money government to government, creating bureaucracy, if not socialism, all over the world. We set out to help 19 countries. We are helping 107. We spent $146 billion. With that money, we bought a $2 million yacht for Haile Selassie. We bought dress suits for Greek undertakers, extra wives for Kenyan government officials. We bought a thousand TV sets for a place where they have no electricity. In the last six years, 52 nations have bought $7 billion worth of our gold, and all 52 are receiving foreign aid from this country.\n\nNo government ever voluntarily reduces itself in size. Government programs, once launched, never disappear. Actually, a government bureau is the nearest thing to eternal life we'll ever see on this Earth. Federal employees number 2.5 million, and federal, state, and local, one out of six of the nation's work force is employed by the government. These proliferating bureaus with their thousands of regulations have cost us many of our constitutional safeguards. How many of us realize that today federal agents can invade a man's property without a warrant? They can impose a fine without a formal hearing, let alone a trial by jury, and they can seize and sell his property in auction to enforce the payment of that fine. In Chico County, Arkansas, James Wier overplanted his rice allotment. The government obtained a $17,000 judgment, and a U.S. marshal sold his 950-acre farm at auction. The government said it was necessary as a warning to others to make the system work. Last February 19 at the University of Minnesota, Norman Thomas, six-time candidate for President on the Socialist Party ticket, said, \"If Barry Goldwater became President, he would stop the advance of socialism in the United States.\" I think that's exactly what he will do.\n\nAs a former Democrat, I can tell you Norman Thomas isn't the only man who has drawn this parallel to socialism with the present administration. Back in 1936, Mr. Democrat himself, Al Smith, the great American, came before the American people and charged that the leadership of his party was taking the part of Jefferson, Jackson, and Cleveland down the road under the banners of Marx, Lenin, and Stalin. And he walked away from his party, and he never returned to the day he died, because to this day, the leadership of that party has been taking that party, that honorable party, down the road in the image of the labor socialist party of England. Now it doesn't require expropriation or confiscation of private property or business to impose socialism on a people. What does it mean whether you hold the deed or the title to your business or property if the government holds the power of life and death over that business or property? Such machinery already exists. The government can find some charge to bring against any concern it chooses to prosecute. Every businessman has his own tale of harassment. Somewhere a perversion has taken place. Our natural, inalienable rights are now considered to be a dispensation of government, and freedom has never been so fragile, so close to slipping from our grasp as it is at this moment. Our Democratic opponents seem unwilling to debate these issues. They want to make you and I believe that this is a contest between two men...that we are to choose just between two personalities.\n\nWell, what of this man that they would destroy? And in destroying, they would destroy that which he represents, the ideas that you and I hold dear. Is he the brash and shallow and trigger-happy man they say he is? Well, I have been privileged to know him \"when.\" I knew him long before he ever dreamed of trying for high office, and I can tell you personally I have never known a man in my life I believe so incapable of doing a dishonest or dishonorable thing.\n\nThis is a man who in his own business, before he entered politics, instituted a profit-sharing plan, before unions had ever thought of it. He put in health and medical insurance for all his employees. He took 50 percent of the profits before taxes and set up a retirement program, a pension plan for all his employees. He sent checks for life to an employee who was ill and couldn't work. He provided nursing care for the children of mothers who work in the stores. When Mexico was ravaged by floods from the Rio Grande, he climbed in his airplane and flew medicine and supplies down there.\n\nAn ex-GI told me how he met him. It was the week before Christmas during the Korean War, and he was at the Los Angeles airport trying to get a ride home to Arizona for Christmas, and he said that there were a lot of servicemen there and no seats available on the planes. Then a voice came over the loudspeaker and said, \"Any men in uniform wanting a ride to Arizona, go to runway such-and-such,\" and they went down there, and there was this fellow named Barry Goldwater sitting in his plane. Every day in the weeks before Christmas, all day long, he would load up the plane, fly to Arizona, fly them to their homes, then fly back over to get another load.\n\nDuring the hectic split-second timing of a campaign, this is a man who took time out to sit beside an old friend who was dying of cancer. His campaign managers were understandably impatient, but he said, \"There aren't many left who care what happens to her. I'd like her to know I care.\" This is a man who said to his 19-year-old son, \"There is no foundation like the rock of honesty and fairness, and when you begin to build your life upon that rock, with the cement of the faith in God that you have, then you have a real start.\" This is not a man who could carelessly send other people's sons to war. And that is the issue of this campaign that makes all of the other problems I have discussed academic, unless we realize that we are in a war that must be won.\n\nThose who would trade our freedom for the soup kitchen of the welfare state have told us that they have a utopian solution of peace without victory. They call their policy \"accommodation.\" And they say if we only avoid any direct confrontation with the enemy, he will forget his evil ways and learn to love us. All who oppose them are indicted as warmongers. They say we offer simple answers to complex problems. Well, perhaps there is a simple answer--not an easy answer--but simple.\n\nIf you and I have the courage to tell our elected officials that we want our national policy based upon what we know in our hearts is morally right. We cannot buy our security, our freedom from the threat of the bomb by committing an immorality so great as saying to a billion now in slavery behind the Iron Curtain, \"Give up your dreams of freedom because to save our own skin, we are willing to make a deal with your slave masters.\" Alexander Hamilton said, \"A nation which can prefer disgrace to danger is prepared for a master, and deserves one.\" Let's set the record straight. There is no argument over the choice between peace and war, but there is only one guaranteed way you can have peace--and you can have it in the next second--surrender.\n\nAdmittedly there is a risk in any course we follow other than this, but every lesson in history tells us that the greater risk lies in appeasement, and this is the specter our well-meaning liberal friends refuse to face--that their policy of accommodation is appeasement, and it gives no choice between peace and war, only between fight and surrender. If we continue to accommodate, continue to back and retreat, eventually we have to face the final demand--the ultimatum. And what then? When Nikita Khrushchev has told his people he knows what our answer will be? He has told them that we are retreating under the pressure of the Cold War, and someday when the time comes to deliver the ultimatum, our surrender will be voluntary because by that time we will have weakened from within spiritually, morally, and economically. He believes this because from our side he has heard voices pleading for \"peace at any price\" or \"better Red than dead,\" or as one commentator put it, he would rather \"live on his knees than die on his feet.\" And therein lies the road to war, because those voices don't speak for the rest of us. You and I know and do not believe that life is so dear and peace so sweet as to be purchased at the price of chains and slavery. If nothing in life is worth dying for, when did this begin--just in the face of this enemy? Or should Moses have told the children of Israel to live in slavery under the pharaohs? Should Christ have refused the cross? Should the patriots at Concord Bridge have thrown down their guns and refused to fire the shot heard 'round the world? The martyrs of history were not fools, and our honored dead who gave their lives to stop the advance of the Nazis didn't die in vain. Where, then, is the road to peace? Well, it's a simple answer after all.\n\nYou and I have the courage to say to our enemies, \"There is a price we will not pay.\" There is a point beyond which they must not advance. This is the meaning in the phrase of Barry Goldwater's \"peace through strength.\" Winston Churchill said that \"the destiny of man is not measured by material computation. When great forces are on the move in the world, we learn we are spirits--not animals.\" And he said, \"There is something going on in time and space, and beyond time and space, which, whether we like it or not, spells duty.\"\n\nYou and I have a rendezvous with destiny. We will preserve for our children this, the last best hope of man on Earth, or we will sentence them to take the last step into a thousand years of darkness.\n\nWe will keep in mind and remember that Barry Goldwater has faith in us. He has faith that you and I have the ability and the dignity and the right to make our own decisions and determine our own destiny.\n\nThank you very much.",
				"added": 1631512558
			},
			{
				"comment_id": 4,
				"body": "A shortened version, very concise and powerful!\n**[No argument over the choice between peace and war ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1631512412_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/No+argument+over+the+choice+between+peace+and+war)**",
				"added": 1631512634
			}
		],
		"1_1Gjx11bmWfCZT6ck2nxNVDt9mjeTqf6LJX": [
			{
				"comment_id": 5,
				"body": "Alexei Navalny \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1611430566_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue \nPUTIN PROTEST Anti-Putin protesters clash with cops across Russia as 1,300 arrested in -15C temperatures over poisoned Alexei Navalny\nhttps://www.the-sun.com/news/2194901/anti-putin-protesters-alexei-navalny/\n\n;;\n### Any Russian guys available? \nPlease help check a simple question.\nPutin's palace. History of world's largest bribe \nhttps://www.youtube.com/watch?v=ipAnwilMncI \n\nA small question here. \n### How many people in Russia has got the idea of Navalny’s exposure of Putin’s betrayal against Russian nation? \nSince there’s no GFW, maybe more than 60% or 70% of Russian people already see the situation clearly? \n## Please give a reply on [Unlimit Talk ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh), to reduce the obstacles of [The 50 K limit ](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Some+Self+Contradictory+Problems)\n;;\n",
				"added": 1632033124
			}
		]
	},
	"comment_vote": {}
}