{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 114,
	"comment": {
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 1,
				"body": "> [deuxzaron](#comment_133_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): why are so many of these posts one person talking to themselves?\n\nhehehehe... the hears of tel aviv reach far and wide :).\n\n---\n\nI was quite shocked by the Eichman trial, not about it, but the lie... Israel gives death sentences like candies ! and rightly so !\n\nSo the side effects of the vaccines? Vaccines Adverse Reactions? I heard about the \"period tsunami\", I guess it's the part targeted in the uteruses... but who knows...\n\nAnd the vaxxnaziausweiss? still possible to go to groceries or on the beach without the experimental injection?\n\nHow many more \"boosters\" (not dead yet you pesky co2 breeders)?\n\nand the plumes from levianthan? funny?\n\nHowever I saw a show about a man whose wife was murdered in a forest, which he wanted to transform in a natural reserve (support), and did a running race: I loved when he said, looking around in the forest where his wife was killed, this is the beauty of the creation...\n\nI can't imagine how the UNO hates you :) you dare to have faith in God but not them? Heretics.\n\nSo, when do the hostilities against the ICC operators begin? it's them or defense, both are impossible.",
				"added": 1618729617
			},
			{
				"comment_id": 2,
				"body": "> [deuxzaron](#comment_133_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): why are so many of these posts one person talking to themselves?\n\nisn't it so annoying that serfs have a god given capabilities to express themselves? I can't imagine the multi-generational frustration among the feodalists :).",
				"added": 1618729684
			},
			{
				"comment_id": 5,
				"body": "did you know that I am antiSOMEsemiths, like you :).",
				"added": 1618730040
			},
			{
				"comment_id": 20,
				"body": "> [slfsrvingpltcn](#comment_5_1B7Rs1nGkNUzS2ccFdn34ANbxS2KVb2mTE): did you know that I am antiSOMEsemiths, like you :).\n\nbut to be clear, I am not against them because they are \"semiths\" but more because they are pedos, thieves, don't understand the security reality of israel, bolshevicks (those I hate particularly), seek white genocide or population replacement etc... again it on an individual basis, and they could be black, and there are, that it wouldn't change a thing in my hate toward them :). because you know some people only understand words, and not meanings :). goyim... I maybe anitgoyim... :).",
				"added": 1618734201
			},
			{
				"comment_id": 21,
				"body": "I think it would be illegal to make antigoyism a crime... hehehe...",
				"added": 1618734263
			},
			{
				"comment_id": 58,
				"body": "I didn't have the time to watch it (yet), but why is the \"grand\" rabbi of france a child? strange... heheh.",
				"added": 1618772210
			},
			{
				"comment_id": 59,
				"body": "(I find myself super funny here), hehehe.",
				"added": 1618772240
			},
			{
				"comment_id": 98,
				"body": "So as already since the time of moses there were ... jews... I don't know what the hebraic term to describe those against moses... \n\nthe icc...\n\nso, it's clear that this idea of targeted snipping of judges children is useless... the globalists / nwo / uno chartrists will replace them with another one, even smarter, so...\n\nNuking...\n\ntactical nuking...\n\na patsie...\n\nwho will take the fall?\n\nI mean this is a method that they will remember... they won't even be able to play the victim, because, there is the second tap !!! ehehhehehe... (where they rebuild, if they dare).\n\nso... pack the thing, like a price, big conference, lot of academics... you know the place to be for the legals of the nwo... ohhh they will be happy flattered... ohhh it works, even on crow...\n\nand then with out expectation, boom.\n\nor I don't know what a nice little tactical nuke, with the exact radius to blast this building complex, but not raze the city (if possible) sounds make...\n\nbut it will be a nice to way to start the clearing of those who want to impose themselves over the IDF !\n\nmy problem, is just a few pedos hiding in israel, and it's not even sure, because most are in the falling west... like the icc... aha.\n\nso what's the answer? icc can come and destroy, capture, rule, everything they wish? not in china... we don't joke, unity.",
				"added": 1618937893
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 3,
				"body": "> [deuxzaron](#comment_136_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Congress already passed laws absolving them from insider trading so good luck with that\n\nthey went as far as legalizing pedophilia (childrape) for themselves and their donors... pedophiliac colonialists aristocratic feodalism = modern usa (that's the real NWO as George H. Bush envisioned it), what a great success!",
				"added": 1618729776
			}
		],
		"1618696253_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 4,
				"body": "> [deuxzaron](#comment_135_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): The Vatican already said it's OK to take it\n\nyeah, it's very sad to understand that most of the vatican history has been about legitimizing the rule of feodalist hereditary leaders, the antithesis of what was once upon a time Rome.\n\nFurthermore, I find interesting how the vatican almost never fight, even verbally against for example the end of medical / religious exemption against forced vaxxination by the vaxxnazis \n\nhttps://www.northjersey.com/story/opinion/2020/01/20/its-time-to-repeal-njs-religious-exemption-from-vaccines/4504877002/\n\nonly Rabbis stood up :\n\nhttps://www.nytimes.com/2020/01/16/nyregion/nj-vaccinations-religious-exemption.html\n\nto whom belongs our body? Ourselves? God or our benevolent wise and just feodalists overlords?",
				"added": 1618729997
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 6,
				"body": "> [deuxzaron](#comment_134_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Are you Alex Jones?\n\nno alexjones wants to control, like all msner, the flow of his comments, if they come here it's only to harvest, never to participate, because it must happen on the platform they control, and can censors.",
				"added": 1618730107
			},
			{
				"comment_id": 15,
				"body": "what I find the most sad, is that this man, know he lives under a feodal childraping unjust savage wannabe aristocrats colonialists system, and still wants to export this failed model to the world, and specially \"liberate china from ccp\"... I mean, it's very sad what cognitive dissonnance does to those unable to reframe... or let go what they believe for what they see... and still pretends to be \"proud to be american\", maybe he got an invitation for the new little st. james :). I find furthermore even more depressing that he saw live the take over of pedotrump, and still pretend there is a republic in america... elections don't matter.\n\nanyway, that's not the first nation to disappears before China, nor the last :). they come and go, China remains :).",
				"added": 1618733316
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 7,
				"body": "How to really win the afghanistan war...\n\nSo the core idea is to not interfer in their domestic fight.\n\nHowever there is an interesting way...\n\nI saw the little clip on RT, with saskya, the girl who did the visit of moskow during the pandemic, how she talked about the contradictory message send by the feodalist pedophiliac regime occupying D.C.. \n\nIt's important to put it in perspective with Watters on foxnews entry segment, where he talked about the \"feodalist\" tactic about domestic propaganda, which aim is to humiliate the viewer, in making him accept the lies, and \"forced\" to repeat it, to create a docile cucked easy to control serfs.\n\nAnd that's what Obiden tried in their move.\n\nAnd so come the greatest move ever, the chinese way, say yes, and do the contrary :). And even worst, tempt them, offer bribes to the Big guy brother, negociate, and then cancel them, and repeat this process accross the whole feodalist (corporate) america... it's just to waste them time, and train/evaluate KGB agents.\n\nThe second part of this plan, and it's important it's never putin or any real official who publicly support or cooperate with the american feodal childrapist regime, but going to retire operators. So that TRUST REMAINS UNBROKEN and or just at the end (implosion, IW2, CW) in the USA that putin can lie to then reveal it...\n\nSo then by saying to american PMC (feodalists forces) and DOD (childrapists protection forces) and CIA (childrapists runners), that yeah yeah, full cooperation \"on the taliban issue\"...\n\nmeanwhile... I think so that to win this war, it's with the local winners. and that by building WAR trust, is the best way to cement credibility and future cooperation with them. They are true warriors, they abeid by the ethics of war, and the righteouser russia is, and generous, the higher the trust will be.\n\ncontinued on the next post due to scrolling problems :).",
				"added": 1618730708
			},
			{
				"comment_id": 8,
				"body": "So Russia should offer the talibans :\n\ndeployement of S400 fully managed by russian forces, in russian isolation zone, don't worry the talibans, masters of their land, have no problem to find safe and secured sites. the goal being, to execute anything the pedochild rapists forces could fly over.\n\nsecond step, is to deploy cheap DNA harvesters to the talibans, to take the DNA of all PMC operators that the pedowest will deploy, for further use, it costs nothing.\n\nthird step is to provide constant intel stream to taliban death squads, to clear all cia / pmc from afghanistan, the goal being not to raise the prices (I mean the pmc are commodities), but to build this trust. Of course against hard targets, it could be cool to do some foreign ops, and then inform the talibans, for them to visit the kill zones.\n\nagain the main idea is battle trust.\n\nif we can win the heart and mind of all talibans accross afghanistan, Russia belly will be way safer. When all talibans leaders, and young pales, can say and firmly believe, Russia = friend. We have won.\n\nof course it means to leave behind everything you may believe in. It's not to russians or soviets to tell how afghan to live, neither the UNO, nor China and even less america.\n\nfor me this is a solid plan for afghanistan, totally realistic, and assured of very long term return, but it rest on one critical fundation : they live the way they see fit. And as they wish to be student of PBUH, more understanding to them can we only wish, while providing them the means to really achieve independence, victory and sovereignty while farming the american pedofeudalist forces who are just commodities... that weaken them generally...",
				"added": 1618731180
			},
			{
				"comment_id": 9,
				"body": "hard? no, sugar coat it... send some SVR / RF forces to pentagon, or letters, and say : we will work with america that we love so much, while at the same time doing this project...\n\nremember the words of the pedofeodalist childrapists have 0 meaning.\n\n#and they want to whitegenocide russia if you aren't aware of. erase it's culture, history, language and even more importantly faith and people, for them acheive their great new world order.\n\nbut don't forget russians, you may be stil tempted by the \"west\"... Which is ironic in the 3rd Rome narrative... \n\nmeanwhile further East, where the TAO reigns, we can't fall to this western narrative, they are scientifically proven less civilized, to not use the term savages.",
				"added": 1618731459
			},
			{
				"comment_id": 17,
				"body": "btw what's the biggest single day loss of pmc history? would be cool to reach a 10k single day death score :) the real think to keep in my mind is that they must have hope... (and maybe it's their overlord who wants to eliminate them to prevent their counter coup :), it's getting interesting...). pmc hiding in afghanistan protected by s400 as guests of the talibans to prepare the american second civil war... a great hollywood scenario :).",
				"added": 1618733817
			},
			{
				"comment_id": 18,
				"body": "key words : open mindedness, awareness and lethality. the triumvirate of victory :).",
				"added": 1618733889
			},
			{
				"comment_id": 23,
				"body": "Why is Victoria Nuland family still alive? She has killed 13k in the western front, splitted Russia and the ukraine... WE WANT REVENGE !\n\nanother idea before continuing the tour... \n\nwhy not use and capture the ukrainian right wing sector, just by using accurate constant data feeded to them + offensive support for them to take back kyvy? Because I read the begining of the dmitri \"brief\" ;), and it appears that they are not very informed, and coupled with the Russian Right Sectors, they could be recovered once in power facing the \"sewer\" problems, and as I seem to get it, those won't have issues to use murder of the \"ruling class\" of kiev?\n\nanyway... that's just an idea...\n\ncontrary to northern Front review... my idea is to be able to have fixed S500 (+ being ++++ range) to face what ever... a few sites... because I am not sure how s500+ (real) are movable in the middle of the winter there, and as such a few fix sites, to project death if necessary, seems always fun... \n\nbut yeah... vicky... I don't even want a corpse, her kids first...",
				"added": 1618764405
			},
			{
				"comment_id": 39,
				"body": "for me the people of the ukrainian right sector, are first and formost human being, they may have a lot of cia controllers inserted inside them, but I believe that with truth, available in various density format, they like anyone will be to see and understand, and so we will win them over, and as such achieve a full spectral victory over the dividers and occupiers of ukraine, and then my favorite part, counter strike with such hate and violence that for a few centuries those behind this will leak their wounds. violence is always the answer, just sometime, it's how to deploy it that counts. that's the full victory scenario to me :).",
				"added": 1618765714
			},
			{
				"comment_id": 40,
				"body": "but you get it, the hardest part at first, is to be able to flush all self narratives... to rewind to the classical : is there a tank there? 1 . 0. nothing else.",
				"added": 1618765772
			},
			{
				"comment_id": 41,
				"body": "and it leaves what? the capacity to absorb any chance on the flow of war :). awareness in open mindess to deploy lethality... ahhh yeah, the adversaries are shitting their pants running :).",
				"added": 1618765854
			},
			{
				"comment_id": 42,
				"body": "because they can feel what the flush implies, and how afraid they are from jumping... to cross over:). isn't war the last kingdom of truth?",
				"added": 1618765897
			},
			{
				"comment_id": 76,
				"body": "a stupid little question regarding drones... one hit by a sarmat part, how far drones are gone from impact? 10? 20km? more? depend on the charge? hehehe... curious... in the sene I find funny drone warfare, or autonmous fight, but at one point, to really clear the batteflied is the most efficient way to restore sanity on the other side...\n\n\"nuke walls\".",
				"added": 1618773839
			},
			{
				"comment_id": 77,
				"body": "for me, I would call that the commerical trap of war... some would prefer to sell 1 million ak to 2 million men, when 1 rentry vehicule (lol, the term) can do the same job way faster... and at a cheaper price :). but it's a radical vision of war... like way waste time killing victoria nuland, when she will be at the funerals of her children? I don't understand what's problematic in war realism, or removing \"chevalery\", what an idiotic concept... win. the rest is illusory.",
				"added": 1618773952
			},
			{
				"comment_id": 78,
				"body": "but don't get me wrong, I support the million ak buy in, once the nuke stoke / mfg are depleted... yeah yeah... no time limit... at least the ak are already made... some will only have sticks, it will be fun :).",
				"added": 1618774032
			},
			{
				"comment_id": 79,
				"body": "because then relaunching a nuke program, maybe way too complex and a wrong ressources allocation :).",
				"added": 1618774063
			},
			{
				"comment_id": 80,
				"body": "specially when the other side will have sticks :).",
				"added": 1618774113
			},
			{
				"comment_id": 81,
				"body": "si vis pacem para bellum, not circus games...",
				"added": 1618774135
			},
			{
				"comment_id": 82,
				"body": "I have a little difficulty to visualize a 10mt at 10km of alltitude... what does it looks like for enemy predators and avengers? I mean, unflyable?",
				"added": 1618774189
			},
			{
				"comment_id": 83,
				"body": "I was neuropathed in ground or just above nuking... but not pure aerial nuking...",
				"added": 1618774227
			},
			{
				"comment_id": 84,
				"body": "however it requires a great serenity and calm, and sadly is the appropriate level of violence to eliminate the enemies of mankind, aka the pentagon and co.",
				"added": 1618774276
			},
			{
				"comment_id": 85,
				"body": "and I still don't understand at which speed the energy waves from aerial nuking move... faster than a hypersonic plane?",
				"added": 1618774350
			},
			{
				"comment_id": 86,
				"body": "it's a physical question, at which speed does the death of wall of aerial nuking moves?",
				"added": 1618774372
			},
			{
				"comment_id": 87,
				"body": "I guess it's very slow compared to quantic wmds :)",
				"added": 1618774387
			},
			{
				"comment_id": 88,
				"body": "\"your bomb blasts are slower than light?\" loling in space :).",
				"added": 1618774432
			},
			{
				"comment_id": 89,
				"body": "or just as fast... ahhahha.",
				"added": 1618774441
			},
			{
				"comment_id": 90,
				"body": "america is a colonial power, it want to enslave russia, china, the mainland in short to reduce us all like they did to the american people... simple...",
				"added": 1618774487
			},
			{
				"comment_id": 91,
				"body": "once all the narrative is removed. that's what remains. they have tons of excuses, for our own security is the funniest... but yeah... they have to be killed, they won't understand, nor change... that's my belief. And better to be wrong, and them dead, than right and them as serfmasters.",
				"added": 1618774543
			},
			{
				"comment_id": 95,
				"body": "About the nasa people, I mean they are \"functional autists\" in a clear sense...\n\nnow the real little victims of a toxic world and others toxins...\n\nmy theory or protocol I would like to try...\n\nis based on the idea of flushing the toxins (may take years) and rebuilding the nervous system (if possible)\n\nto achieve it... of course clean, food, water, and air... and cannabis ! specifically THC, because of it helping to calm the young suffering patient until recovery or at least improvement and increase blood circulations...\n\nwho knows... maybe it's terminal (irrecoverable)...\n\nbut yeah... toxins...\n\nthe roman water pipe trap... \n\nand far away from emf fields (from wifi to 5g+ or micrwave, electric outlets not quality etc).",
				"added": 1618929431
			},
			{
				"comment_id": 99,
				"body": "> [anonysan](#comment_29_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): ah, I see this thread has become a place to shill and dicksuck the Russian mafia state. Let me put this very simply to you: Russia is not anti NWO, they don't give a fuck about free speech, they don't give a fuck about freedom, and they don't give a fuck about the white race or ZOG or whatever nazi shit you care about. Russia censors websites all the time for abitrary reasons and as of now is building their own internet infrastructure so they can implement a great firewall just like in China, yet there are retards on here who have the audacity to defend these governments on a platform that was quite literally built for resisting censorship. Russia's corruption is worse than, if not just as bad as the corruption of oligarchs in the west. The grass is not greener on the other side just because they oppose your government, stop buying into this fallacy\n\n#dicksuck \n\nfunny to see this new propaganda angle of the american department of state, I guess the homos of the fbi have taken it over? is blinken an homo too? maybe even a pedo too?\n\n#Russian mafia state\n\nI don't know which of those 3 words you hate the most, that the russian federation is russian born, raised and trained led? Or that's a state? or maybe it's the meritocratic of your so called \"mafia\" that you dislike more? maybe the idea of not wishing the death of the russian people?\n\n#Russia is not anti NWO\n\nyou mean which nwo? the uno agenda global one world gov? the NWO of george herbert bush? the eugenist/population reductionnists? which one? I don't think the Kremlin ever intended to be the serf or vassal of anyone, but fully and wholy sovereign. I guess you want the obiden regime to rule it too? good luck...\n\n#free speech\n\nyou mean transgender story time? or hormone puberty blockers for children? maybe it's the gay frogs that trigger you, or that the food supply is Gmofree and clean? you know filthy rat, you will get killed, like all those you will turn to foment against mother russia... killed. so thanks for helping us purge our ranks from the weak, and treasonous. we appreciate, we have full spectral dominance over anything inside russian borders. anything.\n\n#the white race\n\nThe Russian Federation is a multi ethnic, tribal etc state. If you wish to try your homopropaganda in grozny I wish you luck, and a swift death. And concerning the Natives of the Great East, those who are as russians as those of st petersburg, you will be amazed how some are really good with rifles... and the great outdoors? life... simply. a friendly reminder... \n\n#ZOG \n\nyou mean the escape of the soviet world? rest assured the home front is solid too :). \n\n#nazi shit\n\na little bit more details on this comment would be appreciated...\n\n# censors websites\n\nyour disinformation isn't allowed? you think you wrote the rules of destabilization in the state departement / fbi? it was lenin birthday not so long ago... try to kill your tsars and we speak then... your road is still long little serfs.\n\n#own internet infrastructure\n\na problem with it? wanted to own the network in fort meade? heheheh... it's cybernayah... don't forget \"snowwhites\", meaning little fools who need sunscreen to get outside of their hawai'ian resorts or to ski the slopes of colorado/utah...\n\n#these governments\n\nwhich you can't control, you hate? progressive indeed...\n\n#Russia's corruption\n\nat least there are russians (and that's the main reason you are angry), secondly they don't seek to genocide/replace the russian people, nor become subservient to anyone, and even less serfs. And are they really corrupt or just more successful? \n\n#grass is not greener\n\nbut the forest is.\n\nthanks for playing low iq.",
				"added": 1619251084
			},
			{
				"comment_id": 103,
				"body": "> [anonysan](#comment_30_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna):  to grow their own food\n\nindependence, sovereignty, self reliance, rugged individualism, clean healthy food from the creation... that reminds me of the great principles of a formerly great nation... which could it be?",
				"added": 1619253990
			}
		],
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 10,
				"body": "another firing mistake this morning... quickly resoved, but it was funny, as I am slowly losing the habit on \"targeting\" a certain channel, following my mistake, I tried to zap, and on it too there was a \"propaganda/humiliation\" program, again rezap and escaped from this enserfing narrative... :). Shanxi seems super nice :).",
				"added": 1618731620
			},
			{
				"comment_id": 11,
				"body": "I hope to reach the flawless day, soon...\n\nI am curious if I should maybe try to look at some digital french press for the lulz, sadly, it makes years that I don't even check it... it's so low information, so low quality, so low iq... but of course they don't make orthographic mistakes :).",
				"added": 1618731687
			}
		],
		"1618583185_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9": [
			{
				"comment_id": 12,
				"body": "> [zeroseed5](#comment_19_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg): For 3 reasons [...]\n\nbut why don't you use simply torrent magnet link to link the files, otherwise if it's distributed you always risk to lose low interests files... and in a sense isn't it digital darwinism? the problem with unfiltred or batch seeding of file, specially if uncensored is that the pedo/fbi can insert what ever they want.\n\nby using torrents you keep control of what you see, and the protocol works, and apparently you don't have the coding skills yet to do something working... I don't even say bug free and even less secure...",
				"added": 1618731854
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 13,
				"body": "https://grist.org/science/first-gmo-mosquitoes-to-be-released-in-the-florida-keys/\n\nwhat a great man :) he could become potus, the transhumanists already love him !",
				"added": 1618732374
			},
			{
				"comment_id": 19,
				"body": "how many people did the fiefdom of florida arrested for recreational psycoactive use in 2020? land of the what already? raped? or dumbed down?",
				"added": 1618734048
			},
			{
				"comment_id": 102,
				"body": "> [anonysan](#comment_31_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): Florida keeps getting more based by the day. If you think covid lockdowns are still for your safety you're fucking retarded. Those who would sacrifice their liberty for security deserve neither and will lose both\n\nand that includes plants of the creation... what's the problem with recreational use of plants of the creation? the state of florida politicans have a right to decide what I put inside my body now, which plants I can grow in this perfect weather? How I should live my life? that's totalitarianism.\n\nI find interesting that for example this woman :  Dr. Simone Gold (2021 Tulsa Event Day 1 Part 13 Dr. Simone Gold at the Health & Freedom Conference 04-16-2021, “The Religion of Public Health” - https://www.brighteon.com/309d84d4-7cab-4ae9-868b-8fa05b02fc0f) is unable to understand that ALL coercive medications are totally inhuman. She just focuses on forced experimental injections, so called mandatory vaccines, rather than be able to see the big picture.",
				"added": 1619253903
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 14,
				"body": "my theory is that you are at the stage preceding the 3 kingdoms... in the sense that the feodal rulers still have this settlers / council attitude, meaning that there hasn't been yet the emergence of the leading factions (3 kingdoms) of couse of all this in primal (meaning primitive savages) context...\n\nthe real question, when will the unity for the take over of the republic break into fiefdom, who will turn to war against each others? what's fun is that contrary to the balkans which lines of demarkation were based on religion, ethniticities, languages and culture, the new american one will be along feodal warlords (even if at first, the first generation of such leaders won't be fighters, that's later in the process... :D, where you will be killed:D), and the part were we will be able to negotiate... and then the unifier... If i was mexico or canada, I would arm up... those who will reunify america by the means of war, won't have a reason to stop at your imaginary line... unless you can defend it... but maybe this whole division to then consolidation process will take place at the western scale, but there the monarchical pmc will stand in the path of the new aristocracy, explaining their hate toward old european constitutional monarchs... we see through you american filths, you are soo stupid, or resaid, freting in such a small pounds, that you have weakened...",
				"added": 1618732923
			},
			{
				"comment_id": 16,
				"body": "In short I really do like the ideals expressed by the founders, some people (for various reasons) but the rests... let's say disdain and ununderstanding.",
				"added": 1618733414
			},
			{
				"comment_id": 22,
				"body": "Dear Dan Hoffman, we will murder your family, feed them you... I can only feel hate, total, toward you, and all your kinds, we will wage war on you and liberate america once and for all, and you know it as I do, it's only with the will and intent to murder your children that we will be able to do it. otherwise, they, the cattles will remain enlsaved to your control. so yes, I believe, lie the cartel man showed us, by killing your kinds, can only we be free. regards to julian assange...",
				"added": 1618764097
			},
			{
				"comment_id": 24,
				"body": "But don't get me wrong, non human, I didn't intend to compare assange, to your tool... just pointing again why killing your offspring is part of our path to regain america. we will. you are the DE.",
				"added": 1618764650
			},
			{
				"comment_id": 25,
				"body": "you call it the great american schiism, the moment all personals of the cia will be come \"dead or alive\".",
				"added": 1618764707
			},
			{
				"comment_id": 26,
				"body": "and we will murder you all.",
				"added": 1618764724
			},
			{
				"comment_id": 27,
				"body": "you wanted to rape us on your island, threat us worst than farm animal, while laughing at the us... do please... until you won't. all of you, where ever you hide. we will find you, and kill you.",
				"added": 1618764770
			},
			{
				"comment_id": 28,
				"body": "the only real outcome for your offsprings to live, is that, once you are captured, we present you before them, and they kill you.",
				"added": 1618764795
			},
			{
				"comment_id": 29,
				"body": "otherwise, you will eat them, and then be executed.",
				"added": 1618764807
			},
			{
				"comment_id": 30,
				"body": "I am curious what is now the kill score, to kill anything that worked for the cia? 100k? I guess they have spread, 500k - 1000k? that's seems okay... I mean only the personals, active and vet.",
				"added": 1618764892
			},
			{
				"comment_id": 31,
				"body": "we have the files anyway... I am just curious... how much is the score to dispose from this earth this organization? anyone knows?",
				"added": 1618764932
			},
			{
				"comment_id": 32,
				"body": "for america to live, the cia personals must die. that's it.",
				"added": 1618764993
			},
			{
				"comment_id": 33,
				"body": "now you chose, as said, for me it's only theory :).",
				"added": 1618765016
			},
			{
				"comment_id": 34,
				"body": "and the ss too, but that's small fry.",
				"added": 1618765040
			},
			{
				"comment_id": 35,
				"body": "details...",
				"added": 1618765045
			},
			{
				"comment_id": 36,
				"body": "ss 15k? at max?",
				"added": 1618765070
			},
			{
				"comment_id": 43,
				"body": "for me there is no healing, no forgiving, but wipe out of the cia/ss. that's it. isn't it a1? ahh no, that's only for the approved narrative constantly changing, but don't worry hoffman, you are soo low on the totem, that you can go try to make this quick bucks you seems to need, contrary to gina for example, or the renowned and esteemed former ag barr... hmmm... you see? funny isn't it, how irrevelant the cia has become... nuisance, pest, vermin, parasits, to be eradicated. unconstitutional or treasonous? why? that's the real question, self serving? to fuck simply said? certainly, primates.",
				"added": 1618766303
			},
			{
				"comment_id": 44,
				"body": "but don't worry, i just see yourselves as products of your own limited \"culture\"... savages.",
				"added": 1618766338
			},
			{
				"comment_id": 45,
				"body": "and let me conclude, putting me in an excellent mood after this burst anger : glory to the MSS :). forever (as always:D).",
				"added": 1618766413
			},
			{
				"comment_id": 46,
				"body": "the elimination of the last cia agent on earth will be a great step in the march forward :D, another one... in a long series :).",
				"added": 1618766451
			},
			{
				"comment_id": 47,
				"body": "for example \"danny\" compared to julie ehad, you are almost a friendly... poor boy, go sleep.",
				"added": 1618766499
			},
			{
				"comment_id": 48,
				"body": "as the goal being, the last, you may be it... stored or queued... I like this word :).",
				"added": 1618766537
			},
			{
				"comment_id": 49,
				"body": "and her name is?",
				"added": 1618766558
			},
			{
				"comment_id": 50,
				"body": "yeah, we all know who we are talking about, detained in your allied country...",
				"added": 1618766591
			},
			{
				"comment_id": 51,
				"body": "for me the cia is like the feed of the catterpillar... at first you say, they will never eat all this, and later you are again refilling :).",
				"added": 1618766639
			},
			{
				"comment_id": 52,
				"body": "ahhaha life in the outtering as uncivilized as it is, offers some interesting perspective on what not to do :).",
				"added": 1618766672
			},
			{
				"comment_id": 53,
				"body": "ps let me be clear last agency of the feodal us gov working, nasa, failure is part of learning... however it when it become systematic like the cia / ss that we have a problem... I don't understand why those agencies couldn't learn management... I mean it's less complicated than building the rockets, but foundational :)",
				"added": 1618766840
			},
			{
				"comment_id": 54,
				"body": "I guess their only prupose became their own existence... selfserving bureaucracies... I guess looking at the stars, remind all that the goal isn't here, but there, somewhere (above the rainbow).",
				"added": 1618766946
			},
			{
				"comment_id": 55,
				"body": "a question (it makes a long time) : how implicated is the DHS (and their ground forces TSA) implicated in pedogate?",
				"added": 1618767762
			},
			{
				"comment_id": 56,
				"body": "isn't the dhs pedocentral?",
				"added": 1618767778
			},
			{
				"comment_id": 57,
				"body": "why would otherwise would have they created it, and by the avoidance of it, I never mentionned it, isn't it already an interesting lead? who knows... that would be the perfect organization to structure childrape across the usa, while being always able to divert to so called more established institutions, while having access to all... hmmm...",
				"added": 1618767851
			},
			{
				"comment_id": 64,
				"body": "simply said : the usa are too uncompetitive for the Mainland...",
				"added": 1618772662
			},
			{
				"comment_id": 65,
				"body": "in short they have one coin, from la to nyc, we have had more than the world can remember from lisbon to beyond :), they can only undersand one language... there are people who still sang in the \"glutural way\" in the mainland... I mean what can they do but attempt to bribe and or brainwash us? the funniest is part is that as soon as we pierce their gamem and see through their lies, there is only weakness of wicked beings... pathetic little fools who believed they could rule the world from D.C... lol... I sincerly believe in smashing this city, to make it a ruin/openair museum, field with the corpses of all those wannabe aristocrats, pedochildrapists incompetent fools...\n\nyou had fun with us... strike back will harsh...",
				"added": 1618772861
			},
			{
				"comment_id": 66,
				"body": "oh you can hide behind your christians cattles, happy rapeable fools that you feeded on reserve status... it worked on the weak... now we see... enemies of mankind.",
				"added": 1618772919
			},
			{
				"comment_id": 67,
				"body": "I sincerly hope america to die, what has it become, is such a shame to what it was intended to be... the worst nation on earth. what's the most disturbing, is the people there... a few exception, in a continent filled with shits, from natives beaten by a few peons to those occupying it... \n\nnew idea: removing the american people, keeping the idea, reforming the governing ways... hmmm... could be a fun resort :).",
				"added": 1618773045
			},
			{
				"comment_id": 68,
				"body": "fundamentally wasn't it it over ambitious for the runaway / castaway to want to conquer where they fled from in the first place? ohh you had a little run... and the sun raised once again upon china :)... and across the world it shined...",
				"added": 1618773141
			},
			{
				"comment_id": 69,
				"body": "\"chinalight\"\n\ngl&hf",
				"added": 1618773164
			},
			{
				"comment_id": 72,
				"body": "and you know what's the most amusing in all I theorize, is that if I am right, I am very slow... meaning that many more before me got it... :) you are soo doomed.",
				"added": 1618773401
			},
			{
				"comment_id": 73,
				"body": "in short, when even a low iq like me gets it, I can't imagine how further others already are since so long... you deserve your coming troubles... kill this cia / ss / doj, msn, restart... maybe it's already too late :). the creation of god will remain, only the miserable fallen will be gone :).",
				"added": 1618773498
			},
			{
				"comment_id": 74,
				"body": "for me it's safer to take out the usa in a first strike no retaliation... it's done. my opinion.",
				"added": 1618773623
			},
			{
				"comment_id": 75,
				"body": "it's cool to see the usa as the enemies of the mainland... which they are... which they didn't have to be... but reverse colonialism... bad idea...",
				"added": 1618773686
			},
			{
				"comment_id": 92,
				"body": "I am not sure, if it wasn't a premeditated murder, be it in their drug dealing chauvin / flyod and their night club or if it was a murder organized by the pedos, to cover their pedogate... who knows... one sure thing, even without chauvin and his squad behaving illegally (And stupidily) even on a battlefield, floyd would be maybe dead, but from an inconstant potency of fentanyl / crack what ever cocktail he was on :).",
				"added": 1618927892
			},
			{
				"comment_id": 93,
				"body": "I can't breath...",
				"added": 1618927956
			},
			{
				"comment_id": 94,
				"body": "and then his muscle rigidity droped? I guess? and the white apes (all the squad) didn't buldge... we have the right to mamatize you as we wish, rapeable taxcattles !",
				"added": 1618928002
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 37,
				"body": "bullshit, fled, because it, the agent, couldn't censor us here... learn their playbook... unless you are one of them.",
				"added": 1618765420
			}
		],
		"1618604090_19xhtyj7LfruJTijwdhgR7yocsLVrLgSuP": [
			{
				"comment_id": 38,
				"body": "> [xcape2net](#comment_843_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This is the only post (or comment) jo23 has made, so I don't think you can say she is one of \"their\" agents based only on this one post.  Please, give newcomers  the benefit of the doubt, and don't assume everyone is out to get ZeroNet.\n\nbullshit, fled, because it, the agent, couldn't censor us here... learn their playbook... unless you are one of them. they aren't out to get zn, they just get smashed, and have to review with their psy behavioral teams to attack us... classic of their playbook. but here as it's a muteable field, they have no asymtric hedge to exploit... and worst it exposes their intellectual mediocrity to their superiors... :).",
				"added": 1618765499
			}
		],
		"1618578079_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 60,
				"body": "Chris Wallace.",
				"added": 1618772318
			},
			{
				"comment_id": 61,
				"body": "nav?",
				"added": 1618772372
			},
			{
				"comment_id": 62,
				"body": "this is one of the biggest domestic enemies ever that america was dumb, docile, captive, brainwashed enough to carry, his elimination will be a great day in the recovery post liberation :).",
				"added": 1618772409
			},
			{
				"comment_id": 63,
				"body": "in propaganda presentation, chris wallace, is my arch enemy ! violent ! there is nothing more killeable than those things, excellent prayers, on low iq / information / high trust goyim... very very mean to pray on such low capabilities... but I appreciate the play... the occupiers of america know their game, only their game isn't good enough, anymore...",
				"added": 1618772555
			}
		],
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 70,
				"body": "filths. congrats you are now suspect on covid release, japan.",
				"added": 1618773234
			},
			{
				"comment_id": 71,
				"body": "(modern japan aka so called fake westernized gov, to be clear, poor people, subjected to this)... we are originalists... and improve upon, not that...",
				"added": 1618773303
			}
		],
		"1618903442_1ExytFkUZYj844g1P5D3USjzzczUdHvm9E": [
			{
				"comment_id": 96,
				"body": "Why is kamala not on the border? ahahahah, she is setting up her foundation like the clinton to rack massive amount of wealth, and then she has to organize all of this... be patient, it's new for her... :). \n\nthey \n\ndon't\n\nhave\n\nto\n\ngive\n\na \n\nshit !\n\nthe ss will protect them as long as they get their bones, and the msn is beyond recoverable...\n\nbut but but...\n\namerica is exceptional, at least some still believe...\n\nstupid\n\nrather than admit the fall...\n\nlook at whom got the wealth (aka they profited from the fall)\n\nand resolve this...\n\nnoo... deny... paper over...\n\nwhat can you do, when the whole security state itself doesn't believe in the idea of america itself...\n\nlook where is gina yachting? and Barr? triple deck?\n\nthey don't care, they have FULL immunity, what ever they do, including raping kids...\n\nand what are the american people doing? \n\nwhat are the american people?\n\nthe current ones... \n\n:(.",
				"added": 1618936409
			},
			{
				"comment_id": 97,
				"body": "If the sec teams of america could wake up, one of the first tactical nuke to detonate will on lahaye... ICC center, full of people. that will start the war of independence 2... but dream on... american too weak...\n\nthis how you threat with \"globalists\", they wanted to rule us, they burned alive, and in the ruins, the locals, will see, that they shall have used their brains...\n\nbut again useless... americans too weak.",
				"added": 1618936850
			},
			{
				"comment_id": 106,
				"body": "> [Charles Hugh Smith via OfTwoMinds blog](#https://www.zerohedge.com/political/people-have-lost-faith-state-and-state-has-lost-faith-its-people): As dissent is crushed, the citizenry lose faith in the state's judiciary, law enforcement, taxation and security agencies--in effect, faith in the state is completely destroyed. Once self-serving elites control the state, dissent cannot be tolerated, as the parasitic elites' hold on power is illegitimate and thus precarious. This is why whistleblowers pose such an existential threat to a thoroughly corrupt, debauched, incompetent self-serving state.\n\n>This is how states and empires decay and slide into the dustbin of history. When the citizenry lose faith in the state and the state has lost faith in its citizenry, then everything become theater and artifice: the pantomime of elections, the carefully curated simulacra of \"free speech,\" (free as long as you mouth the approved narratives), the flood of absurd promises (free money for everyone forever!) that can never be fulfilled, the tiresome parade of politically expedient fake-fixes, a central bank slavishly devoted to expanding already jaw-dropping wealth and income inequality, and a political leadership so clueless they believe their pathetic strutting on stage is actually persuading the audience of their competence and sincerity.",
				"added": 1619254759
			}
		],
		"1619113988_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 100,
				"body": "> [leonarddurden](#comment_4_15UYgac5oQizmt3ZDVUEPjuo97WHYqswSD): I say― Who cares? Do you? [...]\n\nRight now, no... I prefer to gather opinion from the uncensored web before searching a little bit more myself...\n\nfor example I am curious what mr X taught about Liberia and ethnostates... was he part of nation of islam or black panthers? \n\nI had only one concret exposure, I guess, to his movement, it was in forest gump... maybe it wasn't his... and then there is the black fist of some athletes... \n\nhis relation with Cassius Clay? \n\n> [captaincoom](#comment_12_1F5H5zYxjS7G4C66ajhZLjkD8yvBHCwBJG): he asked the real questions\n\nwhat were his best questions?",
				"added": 1619251501
			}
		],
		"1619250997_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8": [
			{
				"comment_id": 101,
				"body": "personally, sometimes, I feel like a refreshing emptying... If you felt it you understand what I mean, it's like if something (energetic) went away, like was drained...",
				"added": 1619251698
			},
			{
				"comment_id": 104,
				"body": "> [jpeer](#comment_2_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8): Yea, it is a relieving/refreshing feeling.    The theory is you pick up electrons, but it may be magnetics or something. [...]\n\nI will check for the vision effects... but yeah, you describe it well... thanks by the way for your tips and post !",
				"added": 1619254036
			}
		],
		"1619121928_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 105,
				"body": "> [anonysan](#comment_32_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna): so because the US is a surveillance state we want an even more intrusive surveillance state to become the new hegemon? This is really stupid...\n\na surveillance state, under whose watch, epstein and many others raped kids... so who is this surveillance state really working for? itself or more sinister forces? maybe both, as they could be one and the same.\n\nit's really important for any independent nation state to have a very efficient so called surveillance state, for like in China, be able to detect, find and even kill cia and others western assets before they can do any damages... \n\nRemember there is nothing funnier than to drop harvested corps of cia and western forces... anywhere, but specially in \"american\" consulates and embassy across china.\n\nbut recently, they come less, it's sad... I am curious why :).",
				"added": 1619254112
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 107,
				"body": "I see... now it's \"interpol\", you note that \"interpol\" never arrested any pedos related to eptsein... I guess they seek to establish their rape camps in myanmar... where is the \"interpol\" hq? I guess you have real WEAPONS OF WAR... strike hard, once. I heard that mobile mortar teams are very hard to defeat in urban environment... specially when executed by covert front line active duties forces... remember, there is ONLY EXTREME VIOLENCE against foreign forces... \nI am sorry it had to fall on you, but it was expected, the obiden regime seeks world dominance. Someone will have to stop them, definitively. and it will, will you be part of it?",
				"added": 1619257848
			},
			{
				"comment_id": 108,
				"body": "Headquartered in Lyon... what a surprise... soft... very soft and permeable...",
				"added": 1619257916
			},
			{
				"comment_id": 109,
				"body": ">INTERPOL has an annual budget of €142 million\n\nahahha...",
				"added": 1619257963
			},
			{
				"comment_id": 110,
				"body": "Myanmar – June 1956\ntime to leave... it was an error all along to take part in any of those international shit...",
				"added": 1619258023
			},
			{
				"comment_id": 111,
				"body": "pre strike : Bangkok, Thailand",
				"added": 1619258039
			},
			{
				"comment_id": 112,
				"body": "INTERPOL opened a Special Representative Office to the UN in New York City in 200\nof course...",
				"added": 1619258056
			},
			{
				"comment_id": 113,
				"body": "hello Jürgen...",
				"added": 1619258072
			}
		]
	},
	"comment_vote": {}
}