{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1635976285,
			"title": "日本での生活",
			"body": "私の最大の夢の一つは、日本に住むことです。労働許可証や学生証以外に日本に滞在できる方法はありますか？あなたが日本国籍を持っていることを前提にお聞きしたいと思いました。\n\n(違法な方法を探しているわけではありません)",
			"added": 1635976284
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1635976285_1NZLf9ua6XqTiK2SLyJMhN9pZhUVJVPi6g": [
			{
				"comment_id": 1,
				"body": "> [kuroto](#comment_183_1HiYg779FznW6G8fWqAGL5iGvRmExfSasX): 国籍を得るところまで行かなくて良いのであれば日本文化の研修などの文化活動で滞在できるようです。短期なら観光でいいのですが目的は中期以上の滞在でしょうから、就労を除くと選択肢は少ないですね・・・ちなみに文化活動では最長で3年、最短で3ヶ月ほど滞在できると書いてありました。ただし、審査が厳しくそれなりの実績が要るようなので何にせよ滞在できるようになるまで時間がかかるでしょうね。 [...]\n\n私は日本語をあまり知らないので、英語で書きます。\n\nI want to get citizenship. I want to come and work in Japan. According to my research, I had to stay and work in Japan for 5 years to get citizenship.\n\nAmong my plans was to come and stay through the language school, but the money of the language school is too expensive for me right now.\n\nI guess I have no other alternative",
				"added": 1636039928
			},
			{
				"comment_id": 2,
				"body": "> [kuroto](#comment_185_1HiYg779FznW6G8fWqAGL5iGvRmExfSasX): 例があるとはいえ流石に来てそのまま日本で働くということにはならないでしょうけど、日本で生活したいというのであればとにかくまずは一度短期滞在してみることをオススメしておきます。 [...]\n\n私は、女性の同意なしに結婚することはありません。今の私の計画は、お金を貯めて語学学校に入学することです。2年後に語学学校を卒業したら、仕事を見つけようと思っています。\n\n私はソフトウェア開発者です。Ruby、Swift、Objective-Cを知っています。就職できるといいですね (っ´ω｀c)",
				"added": 1636136173
			},
			{
				"comment_id": 3,
				"body": "> [kuroto](#comment_186_1HiYg779FznW6G8fWqAGL5iGvRmExfSasX): おお、ある程度方針は決まってるんですね！しかし日本語学校は2年間で150万円ほどですか・・・生活費も考えるとアルバイトしながらということになるんでしょうけど、留学在留資格で許される労働時間は週に28時間まで、夏休みなどの長期休業中は週に40時間までとなっています。奨学金や学生寮の有無、予定している留学先の最低賃金、毎月必要な生活費なども確かめてしっかり計画を固めていきましょう( `･ㅂ･)وぐっ\n\n自分の国から行った人も何人かいました。彼らは学校の費用も払い、学校の期間中ずっと働いていました。充分なお金があったら、いくつかの学校に相談してみようと思います。\n\nところで、情報をありがとうございます。私は日本人の慈悲深い面が大好きです(=^_^=)",
				"added": 1636207076
			},
			{
				"comment_id": 4,
				"body": "> [woodenchicken2](#comment_91_1AeMaVT1dLEG2zV3WicpfCLaGG976Q5GQ1): おおー、頑張ってください!私は食べたことありませんがコオロギラーメンとかあるみたいですよ～日本に来たら食べたもの教えて下さいねー\n\nトルコに来たら、アダナ・ケバブを食べるべきです。その味はとても美味しいですよ",
				"added": 1636207508
			}
		]
	},
	"comment_vote": {
		"188_1HiYg779FznW6G8fWqAGL5iGvRmExfSasX": 1,
		"92_1AeMaVT1dLEG2zV3WicpfCLaGG976Q5GQ1": 1
	}
}