{"next_paste_id":15,"next_comment_id":0,"paste":[{"paste_id":0,"description":"","body":"América pré-colombiana\nPopulação:\nPopulação total\n→ Dobyns: 90-112 milhões.\nDOBYNS, Henry F. An appraisal of techniques with a new hemisferic estimate. Current Antrhropology, Chicago, v. 7, n. 4, p. 395-416, Sept. 1966.\n→ Denevan: 53,9 milhões \n“Sugeri recentemente um total de 53,9 milhões para o Novo Mundo [para época anterior à chegada de Colombo].(Denevan, 1992, p. 370)”\nDENEVAN, William M. The pristine myth: the landscape of the Americas in 1492. Annals of the Association of American Geographers, Milton Park, v. 82, n. 3, p. 369-385, Sept. 1992.\n→ Russell Thornton: 70 milhões. Thornton 1987, p. 25. Thornton, Russel (1987). American Indian Holocaust and Survival: ˜a Population History Since 1492. [S.l.]: Norman : University of Oklahoma Press.\n→ Chaunu: 80 a 100 milhões.  (1969:382)\nCHAUNU, Pierre. Conquista e exploração dos novos mundos: século XVI. Tradução: Jordino Assis dos Santos Marques; Maurílio José de Oliveira Camello. São Paulo: Pioneira; Edusp, 1984[1969].\n\nPopulação México\n→ Brooks: 5 a 10 milhões: (Brooks, 1993, p. 4-5)\nBROOKS, Francis J. Revising the conquest of Mexico: smallpox, sources, and populations. The Journal of Interdisciplinary History, Cambridge, v. 24, n. 1, p. 1-29, Summer 1993.\n→ Diamond: 20 milhões: Em 1618, a população inicial do México, de quase 20 milhões, caíra para cerca de 1,6 milhão.  (Diamond, 2009, p. 210).\n→ Cook e Borah: 25 milhões: (Sánchez-Albornoz, 2003, p. 10-11) \nSÁNCHEZ-ALBORNOZ, Nicolás. El debate inagotable. Revista de Indias, Madrid, v. 63, n. 227, p. 9-18, 2003.\n→ Dobyns: 32 milhões. (1966)\n→ Denevan: 21 milhões. (1976)\n\n% de mortes\n→ Diamond: 95%. \"em todas as Américas, as doenças introduzidas pelos europeus se alastraram de uma tribo para outra bem antes do avanço dos próprios europeus, matando um percentual calculado em cerca de 95% da população nativa da América pré-colombiana\" (2009, p. 77)\nDIAMOND, Jared. Armas, germes e aço. Tradução de Silvia de Souza Costa, Cynthia Cortes e Paulo Soares. Rio de Janeiro: Record, 2009.\n→ Denevan: 89%. As populações ameríndias (estimadas) declinaram na ilha de Espanhola de 1 milhão, em 1492, para algumas centenas, 50 anos depois, o que corresponde a uma diminuição de mais de 99%; no Peru, de 9 milhões, em 1520, a 670.000, em 1620 (decréscimo de 92%); na bacia do México, de 1,6 milhões, em 1519, para 180.000, em 1607 (queda populacional de 89%); e na América do Norte, de 3,8 milhões, em 1492, para 1 milhão, em 1800 (74%). Um colapso geral de 53,9 milhões, em 1492, para 5,6 milhões, em 1650, equivale a uma redução de 89% (Denevan, 1992, p. 371).\n→ Elsa Malvido: 85 a 90%. \nMALVIDO, Elsa. La epidemiología, una propuesta para explicar la despoblación americana. Revista de Indias, Madrid, v. 63, n. 227, p. 65-78, 2003. \n→ Dobyns: 95 a 96%.  Obra de 1966 já citada \n\n1544 e 1545, Juan Ginés de Sepúlveda\n\"Esses bárbaros do Novo Mundo em [...] prudência, engenhosidade, virtude e humanidade são tão inferiores aos espanhóis quanto as crianças aos adultos e as mulheres aos homens, havendo entre eles tanta diferença quanto aquela entre povos selvagens e crueis aos povos clementes,[...], e devo dizer também dos macacos aos homens. (p.110)\"\nSepúlveda APUD Brading, D. Orbe indiano. De la monarquía católica a la república criolla. 1492-1867. México: Fondo de Cultura Económica, 1991, 770 p.\nTráfico negreiro\n→ Cerca de 4 milhões de mortos entre 1500-1900 em função da instituição escravidão. Mas um número ainda maior foi morto no processo de captura.\nRosenbaum, Alan S., and Israel W. Charny, Is the Holocaust Unique?, 2001, pp. 98–99. \n\nGenocídio dos povos indígenas dos Estados Unidos \nWallace, Anthony F.C. The Long, Bitter Trail: Andrew Jackson and the Indians. New York: Hill and Wang, 1993.","language":"text/plain","encrypted":false,"added":1604340185},{"paste_id":1,"description":"","body":"Por que o capitalismo deu errado:\n1 - INEFICIENTE\n⇨ Massa de pessoas sem trabalho ou no trabalho informal\n⇨ Empresas que prevalessem são as de maior capital, não as de melhor serviço ou produto.\n⇨ O que não dá retorno a curto e médio prazo, não compensa.\n⇨ Pessoas não são estimuladas a apostar no que são mais capazes, mas o que dá $\n⇨ Produz ausência de demanda, por incapacidade financeira de adquirir, não por falta de interesse\n\n2 - NÃO FAVORECE O RISCO\n⇨ Tudo que dá errado é pago individualmente, arriscar por quê?\n⇨ Massa das pessoas não tem recursos para arriscar nada. E quem tem, não quer colocá-lo em risco.\n⇨ Bancos e ações existem para retirar o risco ou minimizá-lo aos proprietários.\n⇨ As empresas terceirizam o risco para o Estado\n\n3 - NEGA AS DIFERENÇAS\n⇨ submete tudo que é qualitativo a um parâmetro quantitativo: dinheiro e capital\n⇨ pessoas realmente ricas sobrevivem (acionistas - jogando com ações ações, independente do que acontece\n⇨ escolhas dependem mais do retorno financeiro, que das capacidades e interesses.\n\n4 - AUSÊNCIA DE LIBERDADE\n⇨ Formalmente vc pode fazer tudo, mas as condições para realizar raramente são dadas.\n⇨ A condição para fazer algo é o acesso ao capital: expropriação\n⇨ Ser livre, significa ter consciência das necessidades das condições. Impossível no capitalismo.\n⇨ Parte expressiva dos recursos são destinados a segurança\n\n5 - ANTI-MERITOCRÁTICO\n⇨ Os grandes capitalistas não desenvolveram nem projetaram nada.\n⇨ Quem ganha os frutos de seu mérito é o empregador.\n⇨ Não adianta ter uma boa ideia. É preciso ter capital para implementá-la OU\n⇨ Outros vão colher os frutos de seu mérito\n\n6 - TODO AVANÇO GERA RETROCESSOS\n⇨ Avanços tecnológicos geram desemprego\n\n7 - FRAGMENTA O CONHECIMENTO\n⇨ Conhecimento de cada empresa está sob segredo comercial\n⇨ Somente conhecimentos abstratos são compartilhados nas universidades\n⇨ Veja na pandemia: milhares de iniciativas individuais para vacina\n\n8 - NÃO ESTIMULA O CONHECIMENTO\n⇨ Reduz ao mínimo possível a necessidade de trabalho qualificado. Palavra de ordem: reduzir a dependência do trabalhador.\n\n9 - É IRRACIONAL\n⇨ Livre concorrência gera monopólio, mas precisa da livre concorrência para existir.\n⇨ Imposto estatal reduz taxa de lucro, mas precisa do Estado para socorrê-los e garantir a permanência do sistema.\n\n10 - PRODUZ INTERNAMENTE SUAS PRÓPRIAS CRISES\n⇨ Crises absurdas. Não há falta de produtos e de riqueza. Há crise porque tem muita riqueza.\n⇨ Elevação da produção de riqueza é estimulada diminuindo ao máximo a capacidade de aquisição daqueles que vão consumi-la.","language":"text/plain","encrypted":false,"added":1604341129},{"paste_id":2,"description":"Números 15","body":"O Senhor disse a Moisés:\n\"Diga o seguinte aos israelitas: Quando entrarem na terra que lhes dou para sua habitação,\ne apresentarem ao Senhor uma oferta, de bois ou de ovelhas, preparada no fogo como aroma agradável ao Senhor, seja holocausto, seja sacrifício, para cumprir um voto ou como oferta voluntária ou como oferta relativa a uma festa,\naquele que trouxer a sua oferta apresentará também ao Senhor uma oferta de cereal de um jarro da melhor farinha amassada com um litro de óleo.\nPara cada cordeiro do holocausto ou do sacrifício, prepare um litro de vinho como oferta derramada.\n\"Para um carneiro, prepare uma oferta de cereal de dois jarros da melhor farinha com um litro de óleo\ne um litro de vinho como oferta derramada. Apresente-a como aroma agradável ao Senhor.\n\"Quando algum de vocês preparar um novilho para holocausto ou para sacrifício para cumprir voto especial, ou como oferta de comunhão ao Senhor,\ntraga com o novilho uma oferta de cereal de três jarros da melhor farinha amassada com meio galão de óleo.\nTraga também meio galão de vinho para a oferta derramada. Será uma oferta preparada no fogo, de aroma agradável ao Senhor.\nCada novilho ou carneiro, ou cordeiro ou cabrito, deverá ser preparado dessa maneira.\nFaçam isso com cada animal, com tantos quantos vocês prepararem.\n\"Todo o que for natural da terra deverá proceder dessa maneira quando trouxer uma oferta preparada no fogo de aroma agradável ao Senhor.\nE se um estrangeiro que vive entre vocês, ou entre os descendentes de vocês, apresentar uma oferta preparada no fogo, de aroma agradável ao Senhor, deverá fazer o mesmo.\nA assembléia deverá ter as mesmas leis, que valerão tanto para vocês como para o estrangeiro que vive entre vocês; este é um decreto perpétuo pelas suas gerações, que, perante o Senhor, valerá tanto para vocês quanto para o estrangeiro residente.\nA mesma lei e ordenança se aplicará tanto a vocês como ao estrangeiro residente\".\nO Senhor disse ainda a Moisés:\n\"Diga aos israelitas: Quando vocês entrarem na terra para onde os levo\ne comerem do fruto da terra, apresentem uma porção como contribuição ao Senhor.\nApresentem um bolo feito das primícias da farinha de vocês. Apresentem-no como contribuição da sua colheita.\nEm todas as suas gerações vocês apresentarão das primícias da farinha uma contribuição ao Senhor.\n\"Mas se vocês pecarem e deixarem de cumprir todos esses mandamentos\n— tudo o que o Senhor lhes ordenou por meio de Moisés, desde o dia em que os ordenou e pelas suas gerações —\ne se isso for feito sem intenção e não for do conhecimento da comunidade, toda a comunidade terá que oferecer um novilho para o holocausto de aroma agradável ao Senhor. Também apresentarão com sua oferta de cereal uma oferta derramada, conforme as prescrições, e um bode como oferta pelo pecado.\nO sacerdote fará propiciação por toda a comunidade de Israel, e eles serão perdoados, pois o seu pecado não foi intencional e eles trouxeram ao Senhor uma oferta preparada no fogo e uma oferta pelo pecado.\nA comunidade de Israel toda e os estrangeiros residentes entre eles serão perdoados, porque todo o povo esteve envolvido num pecado involuntário.\n\"Se, contudo, apenas uma pessoa pecar sem intenção, ela terá que trazer uma cabra de um ano como oferta pelo pecado.\nO sacerdote fará propiciação pela pessoa que pecar, cometendo uma falta involuntária perante o Senhor, e ela será perdoada.\nSomente uma lei haverá para todo aquele que pecar sem intenção, seja ele israelita nato, seja estrangeiro residente.\n\"Mas todo aquele que pecar com atitude desafiadora, seja natural da terra, seja estrangeiro residente, insulta ao Senhor, e será eliminado do meio do seu povo.\nPor ter desprezado a palavra do Senhor e quebrado os seus mandamentos, terá que ser eliminado; sua culpa estará sobre ele\".\nCerto dia, quando os israelitas estavam no deserto, encontraram um homem recolhendo lenha no dia de sábado.\nAqueles que o encontraram recolhendo lenha levaram-no a Moisés, a Arão e a toda a comunidade,\nque o prenderam, porque não sabiam o que deveria ser feito com ele.\nEntão o Senhor disse a Moisés: \"O homem terá que ser executado. Toda a comunidade o apedrejará fora do acampamento\".\nAssim, toda a comunidade o levou para fora do acampamento e o apedrejou até à morte, conforme o Senhor tinha ordenado a Moisés.\nO Senhor disse a Moisés:\n\"Diga o seguinte aos israelitas: Façam borlas nas extremidades das suas roupas e ponham um cordão azul em cada uma delas; façam isso por todas as suas gerações.\nQuando virem essas borlas vocês se lembrarão de todos os mandamentos do Senhor, para que lhes obedeçam e não se prostituam nem sigam as inclinações dos seus corações e dos seus olhos.\nAssim vocês se lembrarão de obedecer a todos os meus mandamentos, e para o seu Deus vocês serão um povo consagrado.\nEu sou o Senhor, o seu Deus, que os trouxe do Egito para ser o Deus de vocês. Eu sou o Senhor, o seu Deus\".\n\nNúmeros 15:1-41","language":"text/plain","encrypted":false,"added":1604353074},{"paste_id":4,"description":"Gênesis 1","body":"No princípio Deus criou os céus e a terra.\nEra a terra sem forma e vazia; trevas cobriam a face do abismo, e o Espírito de Deus se movia sobre a face das águas.\nDisse Deus: \"Haja luz\", e houve luz.\nDeus viu que a luz era boa, e separou a luz das trevas.\nDeus chamou à luz dia, e às trevas chamou noite. Passaram-se a tarde e a manhã; esse foi o primeiro dia.\nDepois disse Deus: \"Haja entre as águas um firmamento que separe águas de águas\".\nEntão Deus fez o firmamento e separou as águas que estavam embaixo do firmamento das que estavam por cima. E assim foi.\nAo firmamento Deus chamou céu. Passaram-se a tarde e a manhã; esse foi o segundo dia.\nE disse Deus: \"Ajuntem-se num só lugar as águas que estão debaixo do céu, e apareça a parte seca\". E assim foi.\nÀ parte seca Deus chamou terra, e chamou mares ao conjunto das águas. E Deus viu que ficou bom.\nEntão disse Deus: \"Cubra-se a terra de vegetação: plantas que dêem sementes e árvores cujos frutos produzam sementes de acordo com as suas espécies\". E assim foi.\nA terra fez brotar a vegetação: plantas que dão sementes de acordo com as suas espécies, e árvores cujos frutos produzem sementes de acordo com as suas espécies. E Deus viu que ficou bom.\nPassaram-se a tarde e a manhã; esse foi o terceiro dia.\nDisse Deus: \"Haja luminares no firmamento do céu para separar o dia da noite. Sirvam eles de sinais para marcar estações, dias e anos,\ne sirvam de luminares no firmamento do céu para iluminar a terra\". E assim foi.\nDeus fez os dois grandes luminares: o maior para governar o dia e o menor para governar a noite; fez também as estrelas.\nDeus os colocou no firmamento do céu para iluminar a terra,\ngovernar o dia e a noite, e separar a luz das trevas. E Deus viu que ficou bom.\nPassaram-se a tarde e a manhã; esse foi o quarto dia.\nDisse também Deus: \"Encham-se as águas de seres vivos, e sobre a terra voem aves sob o firmamento do céu\".\nAssim Deus criou os grandes animais aquáticos e os demais seres vivos que povoam as águas, de acordo com as suas espécies; e todas as aves, de acordo com as suas espécies. E Deus viu que ficou bom.\nEntão Deus os abençoou, dizendo: \"Sejam férteis e multipliquem-se! Encham as águas dos mares! E multipliquem-se as aves na terra\".\nPassaram-se a tarde e a manhã; esse foi o quinto dia.\nE disse Deus: \"Produza a terra seres vivos de acordo com as suas espécies: rebanhos domésticos, animais selvagens e os demais seres vivos da terra, cada um de acordo com a sua espécie\". E assim foi.\nDeus fez os animais selvagens de acordo com as suas espécies, os rebanhos domésticos de acordo com as suas espécies, e os demais seres vivos da terra de acordo com as suas espécies. E Deus viu que ficou bom.\nEntão disse Deus: \"Façamos o homem à nossa imagem, conforme a nossa semelhança. Domine ele sobre os peixes do mar, sobre as aves do céu, sobre os animais grandes de toda a terra e sobre todos os pequenos animais que se movem rente ao chão\".\nCriou Deus o homem à sua imagem, à imagem de Deus o criou; homem e mulher os criou.\nDeus os abençoou, e lhes disse: \"Sejam férteis e multipliquem-se! Encham e subjuguem a terra! Dominem sobre os peixes do mar, sobre as aves do céu e sobre todos os animais que se movem pela terra\".\nDisse Deus: \"Eis que lhes dou todas as plantas que nascem em toda a terra e produzem sementes, e todas as árvores que dão frutos com sementes. Elas servirão de alimento para vocês.\nE dou todos os vegetais como alimento a tudo o que tem em si fôlego de vida: a todos os grandes animais da terra, a todas as aves do céu e a todas as criaturas que se movem rente ao chão\". E assim foi.\nE Deus viu tudo o que havia feito, e tudo havia ficado muito bom. Passaram-se a tarde e a manhã; esse foi o sexto dia.\n\nGênesis 1:1-31","language":"text/plain","encrypted":false,"added":1604433780},{"paste_id":5,"description":"2 Pedro 2","body":"No passado surgiram falsos profetas no meio do povo, como também surgirão entre vocês falsos mestres. Estes introduzirão secretamente heresias destruidoras, chegando a negar o Soberano que os resgatou, trazendo sobre si mesmos repentina destruição.\nMuitos seguirão os caminhos vergonhosos desses homens e, por causa deles, será difamado o caminho da verdade.\nEm sua cobiça, tais mestres os explorarão com histórias que inventaram. Há muito tempo a sua condenação paira sobre eles, e a sua destruição não tarda.\nPois Deus não poupou os anjos que pecaram, mas os lançou no inferno, prendendo-os em abismos tenebrosos a fim de serem reservados para o juízo.\nEle não poupou o mundo antigo quando trouxe o dilúvio sobre aquele povo ímpio, mas preservou Noé, pregador da justiça, e mais sete pessoas.\nTambém condenou as cidades de Sodoma e Gomorra, reduzindo-as a cinzas, tornando-as exemplo do que acontecerá aos ímpios;\nmas livrou Ló, homem justo, que se afligia com o procedimento libertino dos que não tinham princípios morais\n( pois, vivendo entre eles, todos os dias aquele justo se atormentava em sua alma justa por causa das maldades que via e ouvia ).\nVemos, portanto, que o Senhor sabe livrar os piedosos da provação e manter em castigo os ímpios para o dia do juízo,\nespecialmente os que seguem os desejos impuros da carne e desprezam a autoridade. Insolentes e arrogantes, tais homens não têm medo de difamar os seres celestiais;\ncontudo, nem os anjos, embora sendo maiores em força e poder, fazem acusações injuriosas contra aqueles seres na presença do Senhor.\nMas eles difamam o que desconhecem e são como criaturas irracionais, guiadas pelo instinto, nascidas para serem capturadas e destruídas; serão corrompidos pela sua própria corrupção!\nEles receberão retribuição pela injustiça que causaram. Consideram prazer entregar-se à devassidão em plena luz do dia. São nódoas e manchas, regalando-se em seus prazeres, quando participam das festas de vocês.\nTendo os olhos cheios de adultério, nunca param de pecar, iludem os instáveis e têm o coração exercitado na ganância. Malditos!\nEles abandonaram o caminho reto e se desviaram, seguindo o caminho de Balaão, filho de Beor, que amou o salário da injustiça,\nmas em sua transgressão foi repreendido por uma jumenta, um animal mudo, que falou com voz humana e refreou a insensatez do profeta.\nEsses homens são fontes sem água e névoas impelidas pela tempestade. A escuridão das trevas lhes está reservada,\npois eles, com palavras de vaidosa arrogância e provocando os desejos libertinos da carne, seduzem os que estão quase conseguindo fugir daqueles que vivem no erro.\nPrometendo-lhes liberdade, eles mesmos são escravos da corrupção, pois o homem é escravo daquilo que o domina.\nSe, tendo escapado das contaminações do mundo por meio do conhecimento de nosso Senhor e Salvador Jesus Cristo, encontram-se novamente nelas enredados e por elas dominados, estão em pior estado do que no princípio.\nTeria sido melhor que não tivessem conhecido o caminho da justiça, do que, depois de o terem conhecido, voltarem as costas para o santo mandamento que lhes foi transmitido.\nConfirma-se neles que é verdadeiro o provérbio: \"O cão voltou ao seu vômito\" e ainda: \"A porca lavada voltou a revolver-se na lama\".\n\n2 Pedro 2:1-22","language":"text/plain","encrypted":false,"added":1604435380},{"paste_id":6,"description":"","body":"\"Então Josué falou ao Senhor, no dia em que o Senhor entregou os amorreus na mão dos filhos de Israel, e disse na presença de Israel:\n\nSol, detém-se sobre Gibeão, e tu, Lua, sobre o Vale de Aijalom.\n\nE o Sol se deteve, e a Lua parou, até que o povo se vingou de seus inimigos.\n\nNão está isto escrito no livro de Jasar? O sol, pois, se deteve no meio do céu, e não se apressou a pôr-se, quase um dia inteiro.\"\n\nLivro de Josué (10:12-14)","language":"text/plain","encrypted":false,"added":1604450952},{"paste_id":8,"description":"TRECHOS: LUTA DE CLASSES NA FRANÇA","body":"\"Enquanto  o  Luxemburgo  buscava  a pedra filosofal, no Hôtel de Ville se cunhava a moeda corrente\"\n\n\"ao lado dos ministérios das finanças, do comércio, dos serviços públicos, ao lado do banco e da bolsa, levantou-se uma sinagoga socialista, cujos sumos  sacerdotes,  Louis  Blanc  e  Albert,  estavam  incumbidos  de  descobrir  a  terra prometida,  anunciar  o  novo  evangelho  e  dar  trabalho  ao  proletariado  parisiense.\"\n\n\"Napoleão foi o nome coletivo de todos os partidos coligados contra a república burguesa, Ledru-Rollin e Raspail foram os nomes próprios, aquele o da pequena burguesia democrática, estes o do proletariado revolucionário. Os votos para Raspail – os proletários e seus porta-vozes socialistas declararam isto em alto e bom som – seriam uma mera demonstração, protestos em igual número contra todo e qualquer mandato presidencial, isto é, contra a própria Constituição, votos em igual número contra Ledru-Rollin, o primeiro ato pelo qual o proletariado, como partido político autônomo, desvinculou-se do partido democrático.\" Luta de classes na frança\"","language":"text/plain","encrypted":false,"added":1604961853},{"paste_id":9,"description":"TRECHOS: Mensagem do Comitê Central à Liga dos Comunistas","body":"\"A atitude do partido operário revolucionário em face da democracia pequeno-burguesa é a seguinte: marchar com ela na luta pela derrubada daquela fração cuja derrota é desejada pelo partido operário; marchar contra ela em todos os casos em que a democracia pequeno-burguesa queira consolidar a sua posição em proveito próprio” (MARX, 1982, p.85). \"\n\n\"Ao lado dos candidatos burgueses democráticos figurem em toda parte candidatos operários, escolhidos na medida do possível entre os membros da Liga, e que para o seu triunfo se ponham em jogo todos os meios disponíveis. Mesmo que não exista esperança alguma de triunfo, os operários devem apresentar candidatos próprios para conservar a independência, fazer uma avaliação de forças e demonstrar abertamente a todo mundo sua posição revolucionária e os pontos de vista do partido. Ao mesmo tempo, os operários não devem se deixar enganar pelas alegações dos democratas de que, por exemplo, tal atitude divide o partido democrático e facilita o triunfo da reação. Todas essas alegações tem o objetivo de iludir o proletariado. Os êxitos que o partido operário alcançar com semelhante atitude independente pesam muito mais do que os danos que possa ocasionar a presença de uns quantos reacionários na assembleia representativa.” (MARX, 1982, p.90)","language":"text/plain","encrypted":false,"added":1604961972},{"paste_id":10,"description":"Deus Proverá - Gabriela Gomes","body":"Eu posso até estar aflito, mas nunca derrotado\nEu posso até chorar, eu posso até sofrer\nMas o amanhã virá e minha fé será recompensada\nE o meu Deus não falha, não!\n\nEu posso até estar ferido, mas nunca destruído\nEu posso ser provado para ser aprovado\nMas o amanhã virá e minha fé será recompensada\nE o meu Deus não falha, não!\nNão falha, não!\n\nNão vivo pela vista não\nEu vivo pela fé, então\nDeus proverá! Deus proverá!\nOlho para o alto, então\nVem o socorro, sim!\nDeus proverá! Deus proverá!\n\nEu posso até estar ferido, mas nunca destruído\nEu posso ser provado para ser aprovado\nMas o amanhã virá e minha fé será recompensada\nE o meu Deus não falha\nEle não falha! Ele não falha, não!\n\nNão vivo pela vista não, eu vivo pela fé então\nDeus proverá! Deus proverá!\nOlho para o alto, então\nVem o socorro, sim!\nDeus proverá! Deus proverá!\n\nNão vivo pela vista não\nEu vivo pela fé, então\nDeus proverá! Deus proverá!\nOlho para o alto, então\nVem o socorro, sim!\nDeus proverá! Deus proverá!\nDeus proverá! Ele proverá!\n\nDeus proverá quando o azeite e a farinha faltar\nQuando minha força se esgotar\nDeus proverá! Deus proverá!\nMesmo cego me faz enxergar\nMesmo falho me faz andar sobre as águas\n\nDeus proverá quando o azeite e a farinha faltar\nQuando minha força se esgotar\nDeus proverá! Deus proverá!\nMesmo cego me faz enxergar\nMesmo falho me faz andar sobre as águas\n\nDeus proverá quando o azeite e a farinha faltar\nQuando minha força se esgotar\nDeus proverá! E Deus proverá!\nMesmo cego me faz enxergar\nMesmo falho me faz andar sobre as águas\n\nNão vivo pela vista não\nEu vivo pela fé, então\nDeus proverá! Deus proverá!\nOlho para o alto, então\nVem o socorro, sim!\nDeus proverá, Deus proverá","language":"text/plain","encrypted":false,"added":1605043575},{"paste_id":11,"description":"João 11 - NVI - Nova Versão Internacional - Bíblia","body":"Havia um homem chamado Lázaro. Ele era de Betânia, do povoado de Maria e de sua irmã Marta. E aconteceu que Lázaro ficou doente.\nMaria, sua irmã, era a mesma que derramara perfume sobre o Senhor e lhe enxugara os pés com os cabelos.\nEntão as irmãs de Lázaro mandaram dizer a Jesus: \"Senhor, aquele a quem amas está doente\".\nAo ouvir isso, Jesus disse: \"Essa doença não acabará em morte; é para a glória de Deus, para que o Filho de Deus seja glorificado por meio dela\".\nJesus amava Marta, a irmã dela e Lázaro.\nNo entanto, quando ouviu falar que Lázaro estava doente, ficou mais dois dias onde estava.\nDepois disse aos seus discípulos: \"Vamos voltar para a Judéia\".\nEstes disseram: \"Mestre, há pouco os judeus tentaram apedrejar-te e assim mesmo vais voltar para lá? \"\nJesus respondeu: \"O dia não tem doze horas? Quem anda de dia não tropeça, pois vê a luz deste mundo.\nQuando anda de noite, tropeça, pois nele não há luz\".\nDepois de dizer isso, prosseguiu dizendo-lhes: \"Nosso amigo Lázaro adormeceu, mas vou até lá para acordá-lo\".\nSeus discípulos responderam: \"Senhor, se ele dorme, vai melhorar\".\nJesus tinha falado de sua morte, mas os seus discípulos pensaram que ele estava falando simplesmente do sono.\nEntão lhes disse claramente: \"Lázaro morreu,\ne para o bem de vocês estou contente por não ter estado lá, para que vocês creiam. Mas, vamos até ele\".\nEntão Tomé, chamado Dídimo, disse aos outros discípulos: \"Vamos também para morrermos com ele\".\nAo chegar, Jesus verificou que Lázaro já estava no sepulcro havia quatro dias.\nBetânia distava cerca de três quilômetros de Jerusalém,\ne muitos judeus tinham ido visitar Marta e Maria para confortá-las pela perda do irmão.\nQuando Marta ouviu que Jesus estava chegando, foi encontrá-lo, mas Maria ficou em casa.\nDisse Marta a Jesus: \"Senhor, se estivesses aqui meu irmão não teria morrido.\nMas sei que, mesmo agora, Deus te dará tudo o que pedires\".\nDisse-lhe Jesus: \"O seu irmão vai ressuscitar\".\nMarta respondeu: \"Eu sei que ele vai ressuscitar na ressurreição, no último dia\".\nDisse-lhe Jesus: \"Eu sou a ressurreição e a vida. Aquele que crê em mim, ainda que morra, viverá;\ne quem vive e crê em mim, não morrerá eternamente. Você crê nisso? \"\nEla lhe respondeu: \"Sim, Senhor, eu tenho crido que tu és o Cristo, o Filho de Deus que devia vir ao mundo\".\nE depois de dizer isso, foi para casa e, chamando à parte Maria, disse-lhe: \"O Mestre está aqui e está chamando você\".\nAo ouvir isso, Maria levantou-se depressa e foi ao encontro dele.\nJesus ainda não tinha entrado no povoado, mas estava no lugar onde Marta o encontrara.\nQuando notaram que ela se levantou depressa e saiu, os judeus, que a estavam confortando em casa, seguiram-na, supondo que ela ia ao sepulcro, para ali chorar.\nChegando ao lugar onde Jesus estava e vendo-o, Maria prostrou-se aos seus pés e disse: \"Senhor, se estivesses aqui meu irmão não teria morrido\".\nAo ver chorando Maria e os judeus que a acompanhavam, Jesus agitou-se no espírito e perturbou-se.\n\"Onde o colocaram? \", perguntou ele. \"Vem e vê, Senhor\", responderam eles.\nJesus chorou.\nEntão os judeus disseram: \"Vejam como ele o amava! \"\nMas alguns deles disseram: \"Ele, que abriu os olhos do cego, não poderia ter impedido que este homem morresse? \"\nJesus, outra vez profundamente comovido, foi até o sepulcro. Era uma gruta com uma pedra colocada à entrada.\n\"Tirem a pedra\", disse ele. Disse Marta, irmã do morto: \"Senhor, ele já cheira mal, pois já faz quatro dias\".\nDisse-lhe Jesus: \"Não lhe falei que, se você cresse, veria a glória de Deus? \"\nEntão tiraram a pedra. Jesus olhou para cima e disse: \"Pai, eu te agradeço porque me ouviste.\nEu sabia que sempre me ouves, mas disse isso por causa do povo que está aqui, para que creia que tu me enviaste\".\nDepois de dizer isso, Jesus bradou em alta voz: \"Lázaro, venha para fora! \"\nO morto saiu, com as mãos e os pés envolvidos em faixas de linho, e o rosto envolto num pano. Disse-lhes Jesus: \"Tirem as faixas dele e deixem-no ir\".\nMuitos dos judeus que tinham vindo visitar Maria, vendo o que Jesus fizera, creram nele.\nMas alguns deles foram contar aos fariseus o que Jesus tinha feito.\nEntão os chefes dos sacerdotes e os fariseus convocaram uma reunião do Sinédrio. \"O que estamos fazendo? \", perguntaram eles. \"Aí está esse homem realizando muitos sinais miraculosos.\nSe o deixarmos, todos crerão nele, e então os romanos virão e tirarão tanto o nosso lugar como a nossa nação\".\nEntão um deles, chamado Caifás, que naquele ano era o sumo sacerdote, tomou a palavra e disse: \"Nada sabeis!\nNão percebeis que vos é melhor que morra um homem pelo povo, e que não pereça toda a nação\".\nEle não disse isso de si mesmo, mas, sendo o sumo sacerdote naquele ano, profetizou que Jesus morreria pela nação judaica,\ne não somente por aquela nação, mas também pelos filhos de Deus que estão espalhados, para reuni-los num povo.\nE daquele dia em diante, resolveram tirar-lhe a vida.\nPor essa razão, Jesus não andava mais publicamente entre os judeus. Ao invés disso, retirou-se para uma região próxima do deserto, para um povoado chamado Efraim, onde ficou com os seus discípulos.\nAo se aproximar a Páscoa judaica, muitos foram daquela região para Jerusalém a fim de participarem das purificações cerimoniais antes da Páscoa.\nContinuavam procurando Jesus e, no templo, perguntavam uns aos outros: \"O que vocês acham? Será que ele virá à festa? \"\nMas os chefes dos sacerdotes e os fariseus tinham ordenado que, se alguém soubesse onde Jesus estava, o denunciasse, para que o pudessem prender.\n\nJoão 11:1-57","language":"text/plain","encrypted":false,"added":1605121891},{"paste_id":12,"description":"2 Coríntios 11","body":"Espero que vocês suportem um pouco da minha insensatez. Sim, por favor, sejam pacientes comigo.\nO zelo que tenho por vocês é um zelo que vem de Deus. Eu os prometi a um único marido, Cristo, querendo apresentá-los a ele como uma virgem pura.\nO que receio, e quero evitar, é que assim como a serpente enganou Eva com astúcia, a mente de vocês seja corrompida e se desvie da sua sincera e pura devoção a Cristo.\nPois, se alguém lhes vem pregando um Jesus que não é aquele que pregamos, ou se vocês acolhem um espírito diferente do que acolheram ou um evangelho diferente do que aceitaram, vocês o suportam facilmente.\nTodavia, não me julgo nem um pouco inferior a esses \"super-apóstolos\".\nEu posso não ser um orador eloqüente; contudo tenho conhecimento. De fato, já manifestamos isso a vocês em todo tipo de situação.\nSerá que cometi algum pecado ao humilhar-me a fim de elevá-los, pregando-lhes gratuitamente o evangelho de Deus?\nDespojei outras igrejas, recebendo delas sustento, a fim de servi-los.\nQuando estive entre vocês e passei por alguma necessidade, não fui um peso para ninguém; pois os irmãos, quando vieram da Macedônia, supriram aquilo de que eu necessitava. Fiz tudo para não ser pesado a vocês, e continuarei a agir assim.\nTão certo como a verdade de Cristo está em mim, ninguém na região da Acaia poderá privar-me deste orgulho.\nPor quê? Por que não os amo? Deus sabe que os amo!\nE continuarei fazendo o que faço, a fim de não dar oportunidade àqueles que desejam encontrar ocasião de serem considerados iguais a nós nas coisas de que se orgulham.\nPois tais homens são falsos apóstolos, obreiros enganosos, fingindo-se apóstolos de Cristo.\nIsto não é de admirar, pois o próprio Satanás se disfarça de anjo de luz.\nPortanto, não é surpresa que os seus servos finjam que são servos da justiça. O fim deles será o que as suas ações merecem.\nFaço questão de repetir: ninguém me considere insensato. Mas se vocês assim me consideram, recebam-me como receberiam um insensato, a fim de que eu me orgulhe um pouco.\nAo ostentar este orgulho, não estou falando segundo o Senhor, mas como insensato.\nVisto que muitos estão se vangloriando de modo bem humano, eu também me orgulharei.\nVocês, por serem tão sábios, suportam de boa vontade os insensatos!\nDe fato, vocês suportam até quem os escraviza ou os explora, ou quem se exalta ou lhes fere a face.\nPara minha vergonha, admito que fomos fracos demais para isso! Naquilo em que todos os outros se atrevem a gloriar-se — falo como insensato — eu também me atrevo.\nSão eles hebreus? Eu também. São israelitas? Eu também. São descendentes de Abraão? Eu também.\nSão eles servos de Cristo? — estou fora de mim para falar desta forma — eu ainda mais: trabalhei muito mais, fui encarcerado mais vezes, fui açoitado mais severamente e exposto à morte repetidas vezes.\nCinco vezes recebi dos judeus trinta e nove açoites.\nTrês vezes fui golpeado com varas, uma vez apedrejado, três vezes sofri naufrágio, passei uma noite e um dia exposto à fúria do mar.\nEstive continuamente viajando de uma parte a outra, enfrentei perigos nos rios, perigos de assaltantes, perigos dos meus compatriotas, perigos dos gentios; perigos na cidade, perigos no deserto, perigos no mar, e perigos dos falsos irmãos.\nTrabalhei arduamente; muitas vezes fiquei sem dormir, passei fome e sede, e muitas vezes fiquei em jejum; suportei frio e nudez.\nAlém disso, enfrento diariamente uma pressão interior, a saber, a minha preocupação com todas as igrejas.\nQuem está fraco, que eu não me sinta fraco? Quem não se escandaliza, que eu não me queime por dentro?\nSe devo me orgulhar, que seja nas coisas que mostram a minha fraqueza.\nO Deus e Pai do Senhor Jesus, que é bendito para sempre, sabe que não estou mentindo.\nEm Damasco, o governador nomeado pelo rei Aretas mandou que se vigiasse a cidade para me prender.\nMas de uma janela na muralha fui baixado numa cesta e escapei das mãos dele.\n\n2 Coríntios 11:1-33","language":"text/plain","encrypted":false,"added":1605201325},{"paste_id":13,"description":"Mateus 11","body":"Depois que terminou de instruir seus doze discípulos, Jesus saiu para ensinar e pregar nas cidades da Galiléia.\nJoão, ao ouvir na prisão o que Cristo estava fazendo, enviou seus discípulos para lhe perguntarem:\n\"És tu aquele que haveria de vir ou devemos esperar algum outro? \"\nJesus respondeu: \"Voltem e anunciem a João o que vocês estão ouvindo e vendo:\nos cegos vêem, os mancos andam, os leprosos são purificados, os surdos ouvem, os mortos são ressuscitados, e as boas novas são pregadas aos pobres;\ne feliz é aquele que não se escandaliza por minha causa\".\nEnquanto saíam os discípulos de João, Jesus começou a falar à multidão a respeito de João: \"O que vocês foram ver no deserto? Um caniço agitado pelo vento?\nOu, o que foram ver? Um homem vestido de roupas finas? Ora, os que usam roupas finas estão nos palácios reais.\nAfinal, o que foram ver? Um profeta? Sim, eu lhes digo, e mais que profeta.\nEste é aquele a respeito de quem está escrito: ‘Enviarei o meu mensageiro à tua frente; ele preparará o teu caminho diante de ti’.\nDigo-lhes a verdade: Entre os nascidos de mulher não surgiu ninguém maior do que João Batista; todavia, o menor no Reino dos céus é maior do que ele.\nDesde os dias de João Batista até agora, o Reino dos céus é tomado à força, e os que usam de força se apoderam dele.\nPois todos os Profetas e a Lei profetizaram até João.\nE se vocês quiserem aceitar, este é o Elias que havia de vir.\nAquele que tem ouvidos, ouça!\n\"A que posso comparar esta geração? São como crianças que ficam sentadas nas praças e gritam umas às outras:\n‘Nós lhes tocamos flauta, mas vocês não dançaram; cantamos um lamento, mas vocês não se entristeceram’.\nPois veio João, que jejua e não bebe vinho, e dizem: ‘Ele tem demônio’.\nVeio o Filho do homem comendo e bebendo, e dizem: ‘Aí está um comilão e beberrão, amigo de publicanos e \"pecadores\" ’. Mas a sabedoria é comprovada pelas obras que a acompanham\".\nEntão Jesus começou a denunciar as cidades em que havia sido realizada a maioria dos seus milagres, porque não se arrependeram.\n\"Ai de você, Corazim! Ai de você, Betsaida! Porque se os milagres que foram realizados entre vocês tivessem sido realizados em Tiro e Sidom, há muito tempo elas se teriam arrependido, vestindo roupas de saco e cobrindo-se de cinzas.\nMas eu lhes afirmo que no dia do juízo haverá menor rigor para Tiro e Sidom do que para vocês.\nE você, Cafarnaum: será elevada até o céu? Não, você descerá até ao Hades! Se os milagres que em você foram realizados tivessem sido realizados em Sodoma, ela teria permanecido até hoje.\nMas eu lhes afirmo que no dia do juízo haverá menor rigor para Sodoma do que para você\".\nNaquela ocasião Jesus disse: \"Eu te louvo, Pai, Senhor dos céus e da terra, porque escondeste estas coisas dos sábios e cultos, e as revelaste aos pequeninos.\nSim, Pai, pois assim foi do teu agrado.\n\"Todas as coisas me foram entregues por meu Pai. Ninguém conhece o Filho a não ser o Pai, e ninguém conhece o Pai a não ser o Filho e aqueles a quem o Filho o quiser revelar.\n\"Venham a mim, todos os que estão cansados e sobrecarregados, e eu lhes darei descanso.\nTomem sobre vocês o meu jugo e aprendam de mim, pois sou manso e humilde de coração, e vocês encontrarão descanso para as suas almas.\nPois o meu jugo é suave e o meu fardo é leve\".\n\nMateus 11:1-30","language":"text/plain","encrypted":false,"added":1605201554},{"paste_id":14,"description":"Mãezinha Querida - Laelson Aboiador","body":"Minha mãezinha querida\nOh minha mãezinha adorada\nÉs a mulher da minha vida\nMinha Santa Imaculada\nPorque aqui neste mundo\nQuem tem sua mãe tem tudo\nQuem não tem mãe não tem nada\n\nQuando a mãe vê um filho\nSe preparar pra sair\nEla fica aperriada\nEles vão se divertir\nEm farra em bebedeira\nEla passa a noite inteira\nE não consegue dormir\n\nQuem tem sua mãe querida\nTrate ela com prazer\nLher dê amor lhe dê carinho\nNão deixe ela sofrer\nNão lhe troque por ninguém\nSó sabe o valor que tem\nNo dia que tu perder\n\nQuem perdeu o amor de mãe\nLembra e chora com saudade\nOh mãe só existe uma\nQue ama sem falsidades\nEu tenho minha mãe querida\nEnquanto ela for viva\nEu tenho felicidades\n\nSeus cabelos branquearam\nSua vista escureceu\nAs suas pernas cansaram\nSeus nervos enfraqueceu\nMinha mãezinha querida\nÉs tudo na minha vida\nPresente que Deus me deu\n\nOfereço essa canção\nQue escrevi com amor\nA todas as mães do mundo\nE a minha que me criou\nMulher brava de coragem\nReceba essa homenagem\nDe Laelson Aboiador\n\nMulher brava de coragem\nReceba essa homenagem\nDe seu filho aboiador","language":"text/plain","encrypted":false,"added":1605633957}],"comment":[]}