{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1574529308_1MFJwynRwEkS2vHr8BH21DjDBEXcbiVZko": [
			{
				"comment_id": 1,
				"body": "I was this year in Iran. Can't imagine these people protesting - and probably they don't. They are really peaceful - the way western people can't even imagine. Of course they are complaining. Mostly because being naive about what they see in western channels like bbc persia and plenty others being made by foreign powers. They have many good things in Iran they can't appreciate because they simply have no comparison - the things we should be jealous about. I wish them best - especially to not support any external powers against themselves. Our internet is full of spying services - it's proper way to cut it out just for the sake of being able to defend themselves. I was worried seeing they had instagram on. They have also phone application for showing \"the real value\" of their national currency on black market - so someone managing it can undermine the currency easily and they all believe it. Peace!",
				"added": 1574636804
			}
		],
		"1574929776_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 2,
				"body": "Theory of evolution is flawed on another level than smart design question. It says we all derive from one organism - I mean all types of organisms derive from one initial type. Assuming life on Earth started spontaneously as it had special environment in which pure chemistry was able to spontaneously organise into life - having such conditions it's hard to believe only one type of organism appeared. As we believe in power of random actions on each other step of evolution, we should also be ready to accept many different organisms to appear which further were evolving. But theory of evolution explicitly limits this to only one organism - which is just faith of Darwin, not proved science. We have many types of organisms on earth which have it's own trees of evolution.\n\nAbout smart design - if it's smart it can occur even before life or Earth or Universe were created. It can occur in a very first step which is so brilliant (or also lucky) that leads to all these creations without further intervention. There is no prove for that - and there is no prove against it. From a science perspective this is equal - I mean you shouldn't say there's no creator because there's no prove for it's existence. You need a prove from a science perspective to say it doesn't exist. That's why we have faith and science - and they don't need to be against each other.\n\nI guess if you have enough imagination to think about God, you are also well prepared to imagine and discover unknown things in science. Nonetheless you need to accept, that there is infinite questions to be asked and answered and you will never know - who created your creator or what was before \"the big bang\" - and before it, and before it...",
				"added": 1574947049
			}
		],
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "Sure - plugin on the main site is a good idea. Should be together with proper warning and specific description of possible danger for each one - possibly comments section designated for security subject. I like the off topic too. We should embrace off topics, different languages, angry responses with no offend. So far I understand all used languages ha! ha!",
				"added": 1603184301
			}
		],
		"1603437706_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 4,
				"body": "4y ago when I didn't know about ZeroNet and before others like Scuttlebut(?) as implemented I did proof of concept of p2p offline system. What I was thinking was that the key block is message, like { id: hash, type: \"comment\" (other data specific for this type of message) }, and even applications which can operate on this messages can be delivered as type: \"application\". This way any amount of apps can work on, and relate to the same data without any \"communication\" between applications, as application is the presentation layer, and data is data. That's it.\n\nI know I didn't helped, sorry! I can't grasp yet how ZeroNet works to start developing here.",
				"added": 1603476440
			}
		],
		"1625657536_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 5,
				"body": "Was working on the same/similar concept few years ago - even similar layout. Many identities - easily switch-able - is a key feature.",
				"added": 1625677186
			}
		]
	},
	"comment_vote": {}
}