{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 2,
			"title": "10 Estratégias de Manipulação em Massa utilizadas diariamente contra a população",
			"body": "Noam Chomsky é um linguista, filósofo, cientista cognitivo, comentarista e ativista político norte-americano, reverenciado em âmbito acadêmico como “o pai da linguística moderna“, também é uma das mais renomadas figuras no campo da filosofia analítica.(Fonte: https://pt.wikipedia.org/wiki/Noam_Chomsky )\n\n**************************************************************************************************************\n\"Em um estado totalitário não se importa com o que as pessoas pensam,\ndesde que o governo possa controlá-lo pela força usando cassetetes.\nMas quando você não pode controlar as pessoas pela força, você tem \nque controlar o que as pessoas pensam, e a maneira típica de fazer\nisso é através da propaganda (fabricação de consentimento, criação \nde ilusões necessárias), marginalizando o público em geral ou \nreduzindo-a a alguma forma de apatia\"\n(Chomsky, N., 1993)\n**************************************************************************************************************\n\n\n\nInspirado nas idéias de Noam Chomsky, o francês Sylvain Timsit elaborou a lista das “10 estratégias mais comuns de manipulação em massa através dos meios de comunicação de massa“\n\nSylvain Timsit elenca estratégias utilizadas diariamente há dezenas de anos para manobrar massas, criar um senso comum e conseguir fazer a população agir conforme interesses de uma pequena elite mundial.\n\nQualquer semelhança com a situação atual do Brasil não é mera coincidência, os grandes meios de comunicação sempre estiveram alinhados com essas elites e praticam incansavelmente várias dessas estratégias para manipular diariamente as massas, até chegar um momento que você realmente crê que o pensamento é seu.\n\n#1. A estratégia da Distração\nO elemento primordial do controle social é a estratégia da distração, que consiste em desviar a atenção do público dos problemas importantes e das mudanças decididas pelas elites políticas e econômicas, mediante a técnica do dilúvio, ou inundação de contínuas distrações e de informações insignificantes.\n\nA estratégia da distração é igualmente indispensável para impedir o público de interessar-se por conhecimentos essenciais, nas áreas da ciência, economia, psicologia, neurobiologia e cibernética.\n\n“Manter a atenção do público distraída, longe dos verdadeiros problemas sociais, cativada por temas sem importância real. Manter o público ocupado, ocupado, ocupado, sem nenhum tempo para pensar; de volta à granja como os outros animais“\n\n#2. Criar problemas e depois oferecer soluções\nEste método também é chamado “problema-reação-solução“. Se cria um problema, uma “situação” prevista para causar certa reação no público, a fim de que este seja o mandante das medidas que se deseja aceitar.\n\nPor exemplo: Deixar que se desenvolva ou que se intensifique a violência urbana, ou organizar atentados sangrentos, a fim de que o público seja o mandante de leis de segurança e políticas desfavoráveis à liberdade.\n\nOu também: Criar uma crise econômica para fazer aceitar como um mal necessário o retrocesso dos direitos sociais e o desmantelamento dos serviços públicos. (qualquer semelhança com a atual situação do Brasil não é mera coincidência).\n\n#3. A estratégia da gradualidade\nPara fazer que se aceite uma medida inaceitável, basta aplicá-la gradualmente, a conta-gotas, por anos consecutivos. Foi dessa maneira que condições socioeconômicas radicalmente novas, neoliberalismo por exemplo, foram impostas durante as décadas de 1980 e 1990. Estratégia também utilizada por Hitler e por vários líderes comunistas.  E comumente utilizada pelas grandes meios de comunicação.\n\n#4. A estratégia de diferir\nOutra maneira de se fazer aceitar uma decisão impopular é a de apresentá-la como “dolorosa e necessária“, obtendo a aceitação pública, no momento, para uma aplicação futura.\n\nÉ mais fácil aceitar um sacrifício futuro do que um sacrifício imediato. Primeiro, porque o esforço não é empregado imediatamente.\n\nDepois, porque o público, a massa, tem sempre a tendência a esperar ingenuamente que “amanhã tudo irá melhorar” e que o sacrifício exigido poderá ser evitado. Isto dá mais tempo ao público para acostumar-se à ideia da mudança e aceitá-la com resignação quando chegue o momento.\n\n#5. Dirigir-se ao público como crianças\nA maioria da publicidade dirigida ao grande público utiliza discurso, argumentos, personagens e entonação particularmente infantis, muitas vezes próximos à debilidade, como se o espectador fosse uma criança de pouca idade ou um deficiente mental.\n\nQuanto mais se tenta enganar ao espectador, mais se tende a adotar um tom infantilizante. Por quê? “Se alguém se dirige a uma pessoa como se ela tivesse a idade de 12 anos ou menos, então, em razão da sugestionabilidade, ela tenderá, com certa probabilidade, a uma resposta ou reação também desprovida de um sentido crítico como as de uma pessoa de 12 anos ou menos de idade.”\n\n#6. Utilizar o aspecto emocional muito mais do que a reflexão\nFazer uso do aspecto emocional é uma técnica clássica para causar um curto circuito na análise racional, e finalmente no sentido crítico dos indivíduos.\n\nPor outro lado, a utilização do registro emocional permite abrir a porta de acesso ao inconsciente para implantar ou injetar ideias, desejos, medos e temores, compulsões ou induzir comportamentos.\n\n#7. Manter o público na ignorância e na mediocridade\nFazer com que o público seja incapaz de compreender as tecnologias e os métodos utilizados para seu controle e sua escravidão.\n\n“A qualidade da educação dada às classes sociais inferiores deve ser a mais pobre e medíocre possível, de forma que a distância da ignorância que paira entre as classes inferiores e as classes sociais superiores seja e permaneça impossível de ser revertida por estas classes mais baixas.\n\n#8. Estimular o público a ser complacente com a mediocridade\nPromover ao público a crer que é moda o ato de ser estúpido, vulgar e inculto.\n\n#9. Reforçar a auto-culpabilidade\nFazer com que o indivíduo acredite que somente ele é culpado pela sua própria desgraça, por causa da insuficiência de sua inteligência, suas capacidades, ou de seus esforços.\n\nAssim, no lugar de se rebelar contra o sistema econômico, o indivíduo se auto desvaloriza e se culpa, o que gera um estado depressivo, cujo um dos efeitos é a inibição de sua ação. E, sem ação, não há questionamento!\n\n#10. Conhecer aos indivíduos melhor do que eles mesmos se conhecem\nNo transcurso dos últimos 50 anos, os avanços acelerados da ciência têm gerado uma crescente brecha entre os conhecimentos do público e aqueles possuídos e utilizados pelas elites dominantes.\n\nGraças à biologia, a neurobiologia a psicologia aplicada, o “sistema” tem desfrutado de um conhecimento avançado sobre a psique do ser humano, tanto em sua forma física como psicologicamente.\n\nO sistema tem conseguido conhecer melhor o indivíduo comum do que ele conhece a si mesmo. Isto significa que, na maioria dos casos, o sistema exerce um controle maior e um grande poder sobre os indivíduos, maior que o dos indivíduos sobre si mesmos.\n\n- Fonte: https://dausacker.wordpress.com/2016/02/14/10-estrategias-de-manipulacao-em-massa-utilizadas-diariamente-contra-a-populacao/",
			"added": 1552778687
		}
	],
	"topic_vote": {
		"2_132B7WMrBKXDKPxGuh82hN9m6jfH9W1TRN": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 11,
	"comment": {
		"4_1GsRfuDKJuXwTjpAzk9rHWaeQkrh5c9RbF": [
			{
				"comment_id": 1,
				"body": "#Abrago - Associação Brasileira de GO\nA Abrago é um grupo sem fins lucrativos e seu principal objetivo é a divulgação do GO no Brasil e o suporte para a criação de clubes de GO. A Abrago foi criada a partir do entusiasmo de pessoas comuns para divulgação do go no Brasil, hoje é presidida pelo Sr Roberto Petresco.\n\n- https://abrago.org/",
				"added": 1552760050
			},
			{
				"comment_id": 2,
				"body": "#Aprenda a Jogar Go Interativamente (Baduk ou Weiqi)\n\n- https://baduk.com.br/",
				"added": 1552760067
			},
			{
				"comment_id": 3,
				"body": "#Aprenda Go\n\n- https://mega.nz/#F!NxYWmITD!P-ZMru3guyv7BvRo2BFitQ",
				"added": 1552761858
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 4,
				"body": "#O MENINO QUE QUERIA SER REI\n\nAlex (Louis Serkis) é um garoto que enfrenta problemas no colégio, por sempre defender o amigo Bedders (Dean Chaumoo) dos valentões Lance (Tom Taylor) e Kaye (Rhianna Dorris). Um dia, ao fugir da dupla, ele se esconde em um canteiro de obras abandonado. Lá encontra uma espada encravada em uma pedra, da qual retira com grande facilidade. O que Alex não sabia era que a espada era a lendária Excalibur e que, como seu novo portador, precisa agora enfrentar a meia-irmã do rei Arthur, Morgana (Rebecca Ferguson), que está prestes a retomar seu poder. Para tanto, ele conta com a ajuda do mago Merlin (Angus Imrie), transformado em uma versão bem mais jovem.\n\n- https://www.ok.ru/video/1340506966561",
				"added": 1552770943
			},
			{
				"comment_id": 5,
				"body": "#VIAGEM MALDITA\nViagem Maldita é a história de uma família em férias com direção à Califórnia, que no entanto é desviada com muito pavor a um trecho desolado do deserto, levando seus viajantes a ficarem presos em um zona atômica do governo. Longe de tudo, a família Carter logo percebe que esta aparente desabitada terra devastada, é na verdade local de procriação de uma cruel e sanguinária, família de mutantes...que fará deles suas presas, enfrentando assim uma batalha desesperada pela sobrevivência.\n\n\n- https://chishare.cc/embed/4692800946/",
				"added": 1552771382
			},
			{
				"comment_id": 6,
				"body": "#VIAGEM MALDITA 2 - O RETORNO DOS MALDITOS\nSinopse: Como parte de uma missão de rotina, uma unidade de soldados da Guarda Nacional pára no isolado laboratório do Novo México. Lá eles encontram um campo de pesquisa misteriosamente deserto. Após presenciar um sinal de perigo em uma montanha distante, o grupo decide iniciar uma missão de procura e resgate. Porém o que eles não sabem é que estas são as mesmas montanhas que a família Carver visitou e que uma tribo de mutantes canibais os aguarda.\n\n- http://thevid.tv/v/kkogjqzswhb1izq/",
				"added": 1552771542
			},
			{
				"comment_id": 7,
				"body": "#FENÔMENO\n\nNo dia do seu 37º aniversário um mecânico (John Travolta) vê uma luz muito intensa e sente um impacto que o leva ao chão, fazendo com que ele imediatamente se torne uma pessoa extraordinariamente inteligente. No início ele não descobre este seu novo dom, mas o fato de não mais dormir, ler alguns livros por dia, prever um terremoto, aprender português em vinte minutos, decifrar códigos militares, entre outras coisas, chamam a atenção de muita gente, inclusive do governo, que deseja utilizar esta inteligência no Serviço Secreto e não em benefício da comunidade, que é o sonho dele.\n\n- https://youtu.be/xp1cKARhGwU",
				"added": 1552773992
			},
			{
				"comment_id": 8,
				"body": "#Fenômeno 2\nSinopse: Fenômeno 2 conta-nos a história de um homem comum, George Malley, que vê uma estranha luz a brilhar no céu no dia de seu aniversário e acorda no dia seguinte com um QI muito mais elevado e com superpoderes. George deseja colocar os seus novos dons ao serviço de boas causas, para a mãe Nora, e a sua pequena cidade. mas quando a notícia se espalha, ele passa a ser tratado como um anormal e um rebelde. O governo quer usar o talento de George com outros fins, mas ele teme que seja usado apenas como cobaia.\n\n- https://youtu.be/a_ObgHKXVZY",
				"added": 1552774112
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 9,
				"body": "#Nem muitas águas conseguem apagar o amor; os rios não conseguem levá-lo na correnteza. Se alguém oferecesse todas as riquezas da sua casa para adquirir o amor, seria totalmente desprezado.\n\n- Cânticos 8:7",
				"added": 1552777757
			},
			{
				"comment_id": 10,
				"body": "Quanto lhe for possível, não deixe de fazer o bem a quem dele precisa,\nNão diga ao seu próximo: \"Volte amanhã, e eu lhe darei algo\", se pode ajudá-lo hoje.\n\n- Provérbios 3:27,28",
				"added": 1552777947
			}
		]
	},
	"comment_vote": {}
}