{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bolsonaro precisa do impeachment para fazer sua revolução",
			"body": "Em um mito grego, um monstro chamado Esfinge aterroriza a cidade de Tebas com um enigma: “Que criatura pela manhã tem quatro pés, à tarde tem dois e à noite tem três?” Ao que adiciona: “Decifra-me ou devoro-te.” O mesmo faz Jair Messias Bolsonaro nos dias que correm: lança um enigma às instituições para ver se elas respondem. Se não o fizerem, serão devoradas.\n\nNas últimas semanas, o presidente fez acenos aos seus seguidores e os encorajou a participar das manifestações de 15 de março contra o Congresso e o Supremo Tribunal Federal. Ele próprio compareceu em uma delas e cumprimentou o público. Chegou a compartilhar um vídeo em que elogiava a iniciativa ao se dirigir a militares, policiais e empresários. Não fosse o coronavírus, teríamos visto um número muito maior de pessoas manifestando-se a favor do presidente e contra as instituições da República.\n\nA atuação de Bolsonaro foi criticada pelo estamento político. O ministro Celso de Mello, do STF, declarou que o presidente não estava à altura do cargo; o governador de São Paulo, João Doria, criticou aquilo que chamou de “governo de ódio”. No dia da manifestação, Davi Alcolumbre, presidente do Senado, e Rodrigo Maia, presidente da Câmara, criticaram a atuação de Bolsonaro na saúde pública, uma vez que, ao participar dos protestos e saudar os manifestantes, o presidente da República desrespeitou os protocolos do próprio Ministério da Saúde para conter a epidemia de coronavírus.\n\nEm entrevista à CNN Brasil, foi dado ao presidente um largo tempo de tevê para que esclarecesse sua atitude. Bolsonaro provocou Alcolumbre e Maia convidando-os a comparecerem nas manifestações também, dizendo que política se faz por intermédio do povo. Por fim, disse que as negociações políticas não poderiam ser feitas nos bastidores e sim publicamente, com a participação da população. O discurso da ligação direta entre o líder e o povo, que ignora a intermediação das instituições, é a definição mais clássica de populismo.\n\nO fato de o presidente incitar subversão aos poderes instituídos pela Constituição faz parte de um movimento mais antigo, que remonta aos tempos de campanha, quando, repetidas vezes, ele desacreditou os procedimentos, os pesos e contrapesos da República. Esse movimento coloca as instituições diante de um enigma: como evitar que Bolsonaro destrua as instituições sem estimular, com isso, a adesão popular ao presidente?\n\nRepreender exemplarmente Bolsonaro pode aumentar o ódio da parcela da população que o apoia. Deixá-lo falar abertamente contra as instituições democráticas pode levar descrédito a essas mesmas instituições. Mas o enigma de Bolsonaro subiu um degrau quando ele próprio, presidente do país, apoiou manifestações que pedem o fechamento do Congresso e do Supremo. É um ponto-limite que exige uma resposta firme do Congresso.\n\nDo ponto de vista institucional, a resposta mais adequada talvez seja o impeachment, como sugeriu o governador do Rio de Janeiro, Wilson Witzel – ex-aliado do presidente, eleito graças ao poderio cibernético do clã Bolsonaro. O Congresso instauraria um processo de impedimento como resposta para mostrar que as instituições não tolerarão qualquer discurso e ação golpista por parte do Executivo.\n\nTal medida configuraria uma decisão acertada, que reafirmaria o equilíbrio de poderes: impedir que um eleito de perfil totalitário se torne um totalitário de fato. A medida transmitiria em alto e bom som ao país a mensagem de que as instituições de controle são mais fortes do que os arroubos ditatoriais do Executivo, e por conseguinte as instituições sairiam mais fortalecidas. Existe, inclusive, embasamento jurídico para fundamentar o pedido, segundo juristas. No entanto, do ponto de vista político, aos olhos dos simpatizantes do presidente, um pedido de impedimento confirmaria a tese de que o Congresso e o STF querem inviabilizar o seu governo. Consequentemente, esses seguidores se voltariam contra as instituições em definitivo, abrindo ainda mais espaço para a radicalização.\n\nUma alternativa, que evitaria a radicalização do movimento anti-Congresso e anti-STF, seria criticar publicamente essas posturas, sem tomar qualquer medida concreta contra as ações do presidente – caminho que, aparentemente, os líderes do Congresso decidiram seguir. Dessa maneira, a bandeira principal do séquito bolsonarista não encontraria fundamentação, e o discurso que teima na tese da perseguição ao presidente seria esvaziado. Entretanto, essa medida coloca as instituições numa postura passiva, contribuindo para a normalização do discurso antidemocrático.\n\nO enigma, portanto, não pode ser esclarecido recorrendo às ferramentas clássicas da ciência política. É melhor analisá-lo à luz do ativismo digital.\n\n \n\nA história política dirá se Bolsonaro prepara um golpe de Estado, um autogolpe, para ser mais preciso. Como qualquer líder populista, ele cria uma conexão direta com a população, visando colocá-la contra o Congresso, enquanto busca o apoio das Forças Armadas para fechá-lo. O presidente peruano Alberto Fujimori, populista eleito como outsider da política, deu um autogolpe em 1992 e fechou o Congresso.\n\nMas não acho que Bolsonaro busque um autogolpe, que é um estratagema daqueles que falharam em criar um movimento verdadeiramente popular e precisam recorrer a uma força desproporcionalmente maior que a do regime vigente. Militares dão golpes, pois são politicamente medíocres. Empresários dão golpes, pois também são politicamente medíocres. O udenismo (corrente política relacionada à União Democrática Nacional, legenda de direita que existiu de 1945 a 1965) precisou de golpes para sobreviver, pois sempre foi incapaz de conquistar a maioria da população.\n\nA ciência política nos mostrará, no entanto, que basta olhar o mundo atual para verificar que golpes de Estado não são mais dispositivos úteis para subverter as democracias liberais. No livro Como as Democracias Morrem, os professores Steven Levitsky e Daniel Ziblatt, da Universidade Harvard, traçam paralelos entre as táticas hoje utilizadas por lideranças iliberais em diferentes partes do mundo. Nas Filipinas, o presidente Rodrigo Duterte persegue jornalistas e prende adversários políticos. Na Índia, o premiê Narendra Modi, oriundo do grupo nacionalista hindu responsável pelo assassinato de Mahatma Gandhi, aproveitou sua reeleição para estimular expurgos e limitar os direitos da minoria muçulmana (que é do tamanho da população brasileira). Na Turquia, o presidente Recep Erdoğan censura acadêmicos que ousam falar do genocídio da população armênia realizado pelo governo otomano na segunda década do século XX. Na Venezuela, Nicolás Maduro mantém seus adversários políticos na prisão. Nos Estados Unidos, Donald Trump avança sobre as regras do bom convívio democrático. No Reino Unido, o premiê Boris Johnson desafia a convenção política, colocando em risco a credibilidade da monarquia. Casos semelhantes ocorrem em El Salvador, Egito, Hungria, Polônia e, é claro, no Brasil. Nenhum desses governantes precisou recorrer ao golpismo militar, bastando a eles ir erodindo pouco a pouco as instituições, com método, rito e calma.\n\nO liberalismo está morrendo em todas as partes, e no Brasil não é diferente. Bolsonaro se diferencia, porém, dos outros líderes iliberais por ter se recusado a estabelecer uma aliança sólida com o estamento político, ainda que esse fosse o desejo mais íntimo desse estamento. Se tivesse comprado o apoio de parte das pessoas que ocupam posições estratégicas, por meio da distribuição de cargos, de emendas ou de doações eleitorais, teria certamente conseguido acelerar de maneira mais eficiente a erosão democrática. Bolsonaro fez isso apenas com o Exército agraciando centenas de militares com cargos comissionados e outros privilégios. O caminho da cooptação do estamento político foi seguido pelas principais lideranças radicais no mundo, menos pela nossa. Há quem atribua falta de capacidade de negociação a Bolsonaro, mas eu concluo que se trata de uma estratégia extremamente calculada da parte dele.\n\nBolsonaro não quer que a democracia morra como aspiram outros líderes, em diferentes países. Ele apenas busca outro formato de democracia. Bolsonaro não precisa dar um golpe porque pode fazer uma revolução autoritária. A primeira revolução verdadeira da história do Brasil. Muito mais profunda do que a ocorrida em 1930, quando, apesar da bagunça, no fundo tudo se resumia a uma disputa entre elites estaduais. Muito mais verdadeira que o golpe de 1964, em que as Forças Armadas apenas cumpriram o papel daquilo que é esperado de quase todos os Exércitos que, como o brasileiro, não lutam guerras: derrubar regimes democráticos e populares. Trata-se de uma revolução de fato, e não apenas da transformação de um regime democrático em regime autoritário, como ocorre nos países acima citados.\n\n \n\nO presidente está conectado, mas difere de outros arquétipos de políticos autoritários. Em um texto que publiquei no site da piauí (“Bolsonaro traz o futuro prometido”) pouco antes do segundo turno da eleição de 2018 e quando já se apontava a dominância eleitoral de Bolsonaro, escrevi o seguinte: “O marco zero do futuro será o dia 28 de outubro de 2018. Um futuro que se desenha também para outras nações, mas do qual os pioneiros somos nós. O Brasil é a vanguarda de um novo modo de fazer política, da concretização de um novo programa de verdade que encerra o ciclo histórico do Iluminismo. A destruição do liberalismo global começa aqui.”\n\nO filósofo Luciano Floridi, da Universidade de Oxford, defende a tese de que sociedades hiperconectadas vivem a transição da história para a hiper-história, uma nova era da humanidade em que as categorias de pensamento e de exercício da política são refundadas à luz das novas tecnologias. De acordo com o pensador, nessa nova era não há mais distinção entre o real e o virtual, entre o offline e o online, e as pessoas já não confiam tanto nas instituições, mas confiam nos perfis das redes sociais. Seguindo essa lógica, afirmei no texto de 2018 que Bolsonaro seria o primeiro chefe de Estado da hiper-história, em todo o mundo.\n\nA ciência política institucional foi incapaz de prever o fenômeno Bolsonaro porque ele não se enquadra em nenhuma evidência que consta da literatura acadêmica, mas acredito que as ferramentas do ativismo digital são úteis para compreender o fenômeno. Sua vitória eleitoral se deu exclusivamente graças às redes sociais, contradizendo os cinco pontos determinantes para o sucesso eleitoral usualmente apontados pelos politólogos. Até 2018, a empiria demonstrava que, para um candidato sair vencedor, precisaria ter uma boa performance durante seu tempo de televisão, firmar-se na memória dos eleitores, saber lidar com a estrutura partidária, construir alianças regionais e obter uma boa estrutura de financiamento da campanha. E de preferência conseguir sair-se bem em todos esses itens.\n\nBolsonaro tinha muito menos dinheiro, menos tempo de televisão e uma estrutura partidária praticamente nula se comparada à da maioria dos candidatos. Tampouco dispunha de um histórico de gestão memorável que pudesse impulsionar os votos. Dentre os líderes iliberais do mundo, tanto Erdoğan quanto Modi haviam feito gestões de sucesso em governos locais antes de serem eleitos para o Executivo nacional. O húngaro Viktor Orbán tinha uma estrutura partidária formada há décadas e com larga participação em governos locais e no Parlamento. Duterte contava com o apoio de uma ampla coalizão, que incluía até partidos de esquerda.\n\nDonald Trump ao menos tinha financiamento, exposição e alianças durante as prévias do Partido Republicano e fez uso extensivo das redes sociais para vencê-las. Mas a imagem de Trump como empresário bem-sucedido foi construída pela televisão, sendo ele portanto muito mais um depositário da videocracia do que da era digital. Uma vez escolhido nas prévias, Trump foi abraçado pelos republicanos e teve à sua disposição toda a máquina do partido nas eleições gerais de 2016.\n\nBolsonaro é o primeiro líder a governar exclusivamente por meio das redes sociais. Sua postura beligerante não tem similar, mesmo entre outros líderes iliberais, que acabaram por estabelecer alianças com o estamento político para ir corroendo a democracia por dentro. Se o Partido Republicano ofereceu resistência a Trump durante a campanha de 2016, isso deixou de ocorrer depois que ele assumiu a Presidência. Apesar das barbaridades cometidas por ele, apenas os senadores Mitt Romney e John McCain, este já falecido, foram capazes de enfrentá-lo. O mesmo se pode dizer do estamento político em países como a Turquia e a Hungria.\n\nAo contrário desses exemplos externos, Bolsonaro não fez essa aliança. E isso ocorreu não por resistência do Congresso ou dos partidos políticos, mas por decisão deliberada dele próprio. O presidente não apenas nunca teve um partido e uma base legislativa sólidos, como atualmente nem sequer está filiado a um partido. Como se elegeu graças ao fenômeno digital, é neste que ele constrói seu modo de governar. Se for bem-sucedido, o Brasil definitivamente será o primeiro país a ter sua vida política determinada pelos parâmetros da hiper-história.\n\n \n\nBolsonaro provou haver uma nova forma de ser eleito, e agora tateia na busca de uma nova forma de governabilidade própria à era digital. Sua estratégia – típica do ativismo – é tentar converter o apoio que tem nas redes online em mobilização offline e constante. Existem três grandes desafios para quem pratica o ativismo em tempos de mídias sociais: primeiro, a formação de uma base de apoio que chamaremos de constituency; segundo, de canal; e terceiro, de continuidade e profundidade do engajamento.\n\nNo tempo da tevê e da comunicação de massa, o importante era falar para o maior número de pessoas, seguindo a lógica do broadcasting – de um para muitos. As redes sociais funcionam a partir da lógica do multicasting – de muitos para um. Ou seja, o que importa é conseguir falar com constituencies específicas. É complexo chegar nelas, pois as redes sociais replicam a atomização da sociedade em uma plataforma. Cada pessoa é um perfil que se relaciona a distância e transacionalmente com outro perfil – um e outro refletindo os seus gostos particulares, sua personalidade e sobretudo sua opinião. A arquitetura de redes sociais está desenhada de tal modo que elas estimulam a hiperindividualização: por um lado, o perfil (a pessoa) é estimulado a revelar constantemente suas preferências, por outro tende a apenas se comunicar com aqueles que pensam de forma parecida com ele – fenômeno chamado pelo empresário e ativista Eli Pariser de filter bubble (bolha de filtro).\n\nDo ponto de vista do ativista que quer formar um movimento, as redes sociais são difíceis de penetrar. Mas existem duas estratégias para romper a filter bubble e alinhar audiências diferentes. A primeira é conquistar seguidores a partir de suas opiniões. Sabe-se que algumas plataformas de redes sociais privilegiam o conteúdo que gera mais interação logo depois de sua postagem. Isso favorece postagens que chamem muito a atenção, entre outros motivos por serem sensacionalistas ou contrariarem o “senso comum” e o “politicamente correto”. Quanto mais absurdo o conteúdo da mensagem, mais interações ela gera. Quanto mais interações, maior o seu alcance. Quanto mais numerosa a audiência, maior a capacidade de reunir seguidores.\n\nA segunda estratégia é fidelizar esses seguidores, criando proximidade com ele. A partir do momento em que obtém muitos seguidores, o perfil se torna um influencer, isto é, um perfil seguido por muitos perfis. Manter esses seguidores ativos e sempre em interação é fundamental. De modo que o melhor a fazer é compartilhar tudo que se pode, o tempo todo, trazendo o seguidor para mais perto, quase como se ele assistisse a um reality show do qual o influencer é a estrela, capaz de dar opiniões instantâneas sobre tudo que está sendo debatido, de compartilhar momentos íntimos de sua vida e aproximar os seguidores cada vez mais de seu dia a dia.\n\nBolsonaro se constituiu como um brilhante influencer, e foi assim que se elegeu. Para fidelizar o público e mantê-lo constantemente engajado foi necessário criar uma trajetória de herói que as pessoas pudessem acompanhar: com adversários, obstáculos, provações e grandes emoções. Mas não basta ser apenas um influencer extraordinariamente ativo: o segredo é fundir diversas filter bubbles em uma só, cujo único denominador comum é o influencer. Assim, este se transforma em canal de comunicação e principal fonte de informação. É como se fosse um mundo paralelo, um simulacro de realidade, em torno do qual giram uma miríade de blogs, perfis e influencers. Durante as eleições, Bolsonaro se constituiu como um canal assim e soube habilmente fundir bolhas diferentes: dos neoudenistas da luta contra a corrupção aos neopentecostais e aos fascistas.\n\nDesde sua eleição, Bolsonaro tem como meta se constituir como canal dominante de uma parcela importante da população. Cada ato seu na Presidência é pensado como um modo de consolidar e expandir uma gigantesca filter bubble que dele dependa. Para isso foi necessário abrir uma guerra contra a imprensa e contra as instituições, transformando qualquer crítica ou denúncia de corrupção a ele dirigida em mensagem inválida para seu público. O objetivo da Presidência com suas “pautas-bomba” não é aprová-las, mas apenas gerar discórdia.\n\nTodas seguem sempre o mesmo fio lógico: quanto mais propostas absurdas são apresentadas, mais a imprensa e as demais instituições são obrigadas a criticar e tentar impedir os atos do presidente. Dessa maneira, a narrativa de Bolsonaro de que é perseguido pela mídia e as instituições se confirma o tempo todo para o público de seus canais na internet. Dentre todas as pautas-bomba, talvez a mais reveladora tenha sido a tentativa de nomear Eduardo Bolsonaro embaixador dos Estados Unidos. Não acredito, sinceramente, que Bolsonaro quisesse nomear o filho embaixador: queria apenas forçar uma enxurrada de críticas de seus previsíveis opositores. Fato é que nenhuma das “pautas-bomba” foi aprovada pelo Congresso, o que leva a nossa elite intelectual e a imprensa a elogiarem a resistência das instituições.\n\n \n\nAlguns analistas políticos dizem que as instituições estão resistindo, dado que Bolsonaro não conseguiu emplacar nada além de parte da agenda econômica – e isso é verdade. Outros afirmam que as instituições não estão aumentando o custo do golpismo de Bolsonaro: as declarações do presidente e de seus ministros não costumam surtir nenhum efeito prático – e estes também têm razão. As instituições estão bloqueando as ações concretas, mas deixando passar declarações totalmente absurdas. Ou seja, exercem o contrapoder de um lado, e deixam de exercê-lo de outro.\n\nO ano de 2019 foi marcado por esse estranho equilíbrio geral. Detrás das aparentes batalhas se justapuseram confortavelmente dois conceitos diferentes de comunicação e dois conceitos diferentes de poder. As instituições saíram ganhando nesse conflito, mas Bolsonaro também foi vencedor. O importante para Bolsonaro não é aprovar políticas públicas, apenas autorizar um horizonte aspiracional às suas bases políticas. Bolsonaro ganha apenas propondo. O Congresso ganha apenas impedindo que seja aprovado. Todos ganham.\n\nNo ativismo digital, trabalha-se com a noção de “curva de engajamento”: sabe-se que para manter as pessoas engajadas e a audiência atenta é necessário oferecer ações sempre mais profundas para seus seguidores. Se no início um seguidor curtiu os posts de Bolsonaro, ele rapidamente passou a assistir todos os vídeos de Bolsonaro, para em seguida se informar unicamente por meio de blogs bolsonaristas, e por fim ir às ruas no dia 15 de março defender o presidente. Essa foi a curva traçada por Bolsonaro: começar como influencer, que em seguida se torna canal dominante para, ao final, galvanizar esse canal em uma infraestrutura de mobilização constante. “Infraestrutura de mobilização” é aquilo que permite conformar maiorias políticas. Na revolução bolsonariana, as eleições não servem para conformar maiorias, apenas para legitimar institucionalmente a capacidade de organização e mobilização dessas infraestruturas armadas na internet. É por meio delas que pretendem viabilizar uma nova forma de governo que não passe pelas instituições, mas apenas pela vontade de minorias politicamente organizadas. Governar para aqueles que gritam mais alto.\n\nAs bases às quais Bolsonaro acena são sempre as compostas por pessoas em posição de poder: brancos, homens, heterossexuais e gente armada, como militares e policiais. O denominador comum desses grupos é o poder que exercem sobre a sociedade.\n\nDe um lado, Bolsonaro se aliou aos pequenos poderes; de outro, aos grandes, como o empresariado e o mercado financeiro. Ele teve a inteligência de entender que seria necessário deixar os grandes poderes agirem livremente, de modo que não impedissem a sua revolução. Apesar de nacionalista e intervencionista, Bolsonaro entregou as chaves da economia a esses grandes poderes como jamais nenhum governo liberal e conservador foi capaz de fazer. A aliança dos pequenos poderosos da sociedade com os grandes poderosos do capital, numa sólida formação de maioria política conectada e engajada 24 horas por dia, tornou-se um movimento impossível de ser detido.\n\nA crise do coronavírus abriu uma possibilidade extraordinária para o presidente expandir a sua bolha para camadas mais populares. Consciente de que a única chance de o país não viver um colapso na saúde pública são as medidas de distanciamento social implementadas por governos locais, Bolsonaro faz uma aposta arriscada porém certeira: criticar essas medidas para tomar a frente da revolta popular que, na ausência de uma política assistencial para compensar as perdas de renda provocadas pelas medidas de contenção ao vírus, inevitavelmente emergirá. Bolsonaro joga com essa convulsão e, quando ela ocorrer, poderá dizer que ele sempre alertou para os perigos da “histeria” dos governadores e da imprensa, canalizando a onda de revolta em favor de sua figura. Os vilões que causaram a crise econômica serão as instituições e a imprensa que exageraram e agiram com paranoia.\n\nO equilíbrio geral de 2019 não pode se sustentar em 2020, pois todo engajamento de rede social é superficial e efêmero. Se a internet permite falar com um público muito mais diverso, também traz uma dificuldade extra: a fragilidade e a superficialidade do engajamento. Como manter as pessoas engajadas ao longo do tempo? Para engajar seus seguidores de maneira concreta e profunda, Bolsonaro precisa subir mais um degrau.\n\nUma lição básica de todo ativismo digital é que, para converter uma audiência passiva em um movimento ativo, é necessário que exista um ponto de tomada de decisão real. Esse ponto imprime urgência e gera no público o que os ativistas chamam de “medo de perder”, isto é, o medo que as pessoas têm de ver uma situação se deteriorar, seja por uma perda de direito, de status ou ainda de poder. No ativismo, as pessoas se cansam quando são instadas a se mobilizar em cima de suposições e teorias conspiratórias. Para fazer o caldo entornar, é preciso uma ameaça concreta e urgente. Bolsonaro perderá tração sobre sua filter bubble se ficar repetindo o mesmo discurso em que se faz vítima da perseguição do Congresso, do STF e da mídia sem ter nenhuma fundamentação concreta. É necessário que um fato novo emerja e gere urgência nas bases do bolsonarismo.\n\nA instauração de um processo de impeachment é o ponto de decisão urgente que Bolsonaro precisa para conseguir mobilizar de maneira profunda e constante a integralidade de seus apoiadores. Com isso, ele ganhará seis meses de intensa mobilização de suas bases, com engajamento cada vez mais profundo dos seguidores. Terá vilões perfeitos que estarão explicitamente engajados em derrubá-lo. Com o impeachment, Bolsonaro coloca as instituições contra a parede e põe em marcha a revolução.\n\nAssim deve ser lido o pronunciamento de Bolsonaro da noite do dia 24 de março: como um apelo desesperado à instauração do processo de impeachment contra ele. A sua atuação na crise do coronavírus, contrariando as recomendações das autoridades sanitárias e científicas, segue o mesmo vetor estratégico das pautas-bomba, das suas declarações anti-democráticas, da convocação de manifestações contra as instituições. A cada nova polêmica, ele elege um novo adversário e o instiga a uma atuação mais enérgica. Se suas ameaças contra as instituições democráticas ou nosso patrimônio ambiental não foram motivos suficientes para o impedimento, Bolsonaro dobra a aposta agora e se apresenta como uma ameaça sanitária. Desse modo, obriga os adversários que ele mesmo escolhe – o Congresso, o Supremo, a imprensa, e agora também os governadores – a tomarem uma medida mais drástica contra a sua atuação.\n\nO enigma colocado ao Congresso e ao Supremo Tribunal Federal é ingrato. Se estes promoverem o impedimento de Bolsonaro, fortalecerão o movimento revolucionário do presidente, levando o país ao caos geral. Se não instaurarem logo um processo de impeachment, terminarão por normalizar mais uma medida autoritária de Bolsonaro, deteriorando a credibilidade das instituições e pavimentando o solo para a construção orgânica da revolução. Não há outro desfecho possível do bolsonarismo que não a guerra. Se for derrotado em 2022, Bolsonaro não aceitará o resultado das urnas. Qualquer que seja a resposta dada pelas instituições, o presidente-esfinge as devorará.\n\nO ano de 2020 parece um remake do 1938 europeu, com atores de qualidade inferior. A ambição colonial de Hitler e Mussolini na Europa já estava clara quando o primeiro-ministro inglês Neville Chamberlain concedeu à Alemanha nazista a anexação da Tchecoslováquia em troca da paz no continente. Naquele momento, o então parlamentar Winston Churchill fez uma afirmação que se confirmaria: “Entre a desonra e a guerra, eles [os ingleses] escolheram a desonra e terão a guerra.” Resta saber se Rodrigo Maia e Davi Alcolumbre estão mais para Chamberlain ou Churchill.\n\n- Fonte: https://web.archive.org/web/20200409072636/https://piaui.folha.uol.com.br/materia/uma-esfinge-na-presidencia/",
			"added": 1586544895
		},
		{
			"topic_id": 2,
			"title": "Ainda bem que o Bolsonaro não é presidente do Brasil",
			"body": "- https://invidio.us/azd32-zfxsA\n\n\"Nesse momento de crise e que a gente tá com medo dos impactos da pandemia na nossa vida, faz diferença apontar os erros e acertos do governo atual, principalmente se a gente para pra pensar que dois anos atrás corremos o risco do ex-deputado federal Jair Bolsonaro ser eleito. Foi por pouco, mas pelo menos Bolsonaro não é o presidente do Brasil hoje. Imagina só o desespero que seria se a gente tivesse que lidar com tudo isso hoje sob um governo de extrema-direta. Bate um pequeno alívio ver que nos livramos dessa.\"",
			"added": 1586546295
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"2_14xgDiAemcxMSTL7Bo6AQ1yec5JNJtQkm6": [
			{
				"comment_id": 1,
				"body": "#A hipótese do Comunismo Hermenêutico\n- https://web.archive.org/web/20200207154316/https://outraspalavras.net/alemdamercadoria/a-hipotese-do-comunismo-hermeneutico/\n\nDois filósofos propõem: para voltar a ser potente e perigoso, marxismo deve deixar pretensão à verdade histórica e assumir-se como imperativo ético, espectro que convoca seres humanos a novas relações entre si e com a natureza\n\n#Por uma nova Declaração dos Direitos Humanos\n- https://web.archive.org/web/20200406135722/https://outraspalavras.net/sem-categoria/por-uma-nova-declaracao-dos-direitos-humanos/\n\nVistos como triunfantes, após a queda do Muro de Berlim, eles estão em frangalhos – tanto os sociais quanto os civis –, pois o capital os vê como obstáculos. Será possível resgatá-los, livrando-os das nódoas do eurocentrismo?\n\n#Crônica de Cuba, em incerta transição\n- https://web.archive.org/web/20191230132625/https://outraspalavras.net/descolonizacoes/cronica-de-cuba-em-incerta-transicao/\n\nVida simples e moradia precária – mesmo para médicos e administradores. Desigualdade, mínima. Há cultura e tempo livre: a lógica neoliberal não invadiu as almas. Grandezas e impasses da ilha, vistas a partir de alguns de seus habitantes\n\n\n#Ecossocialismo, democracia e nova sociedade\n- https://web.archive.org/web/20191226142156/https://outraspalavras.net/crise-civilizatoria/ecossocialismo-democracia-radical-e-nova-civilizacao/\n\nDiante do risco de catástrofe climática, tornou-se crucial pensar saídas. Implica resgatar justiça social do marxismo e anarquismo, mas articulá-la a nova relação com a natureza e a mudança nos modos de produzir, consumir e decidir\n\n#Socialismo Democrático: o papel da autonomia\n- https://web.archive.org/web/20191212085900/https://outraspalavras.net/crise-civilizatoria/socialismo-democratico-o-papel-da-autonomia/\n\nTransformados, Big Data e algoritmos permitiriam superar mercado; produzir e distribuir riquezas de forma desalienada. Mas este sistema, ao contrário do que se pensou ao longo do século XX, não precisa ser controlado de cima para baixo\n\n#Pós-capitalismo na era do algoritmo (1)\n- https://web.archive.org/web/20191226091110/https://outraspalavras.net/pos-capitalismo/pos-capitalismo-na-era-do-algoritmo-1/\n\nDado como morto após a queda da União Soviética, o planejamento está em cena de novo, impulsionado pelo Big Data. As corporações usam-no para turbinar o consumismo. Mas ele pode impulsionar um socialismo radicalmente democrático\n\n\n#Pós-capitalismo na era do algoritmo (2)\n- https://web.archive.org/web/20191227203006/https://outraspalavras.net/pos-capitalismo/pos-capitalismo-na-era-do-algoritimo-2/\n\nSalvador Allende queria a informática em favor do planejamento estatal. As corporações empregam-na para o lucro e a desigualdade. Um socialismo renovado seria desafiado a utilizá-la para superar o mercado e a alienação\n\n#Pós-capitalismo na era do algoritmo (final)\n- https://web.archive.org/web/20191208154833/https://outraspalavras.net/crise-civilizatoria/pos-capitalismo-na-era-do-algoritmo-final/\n\nAs mesmas tecnologias que permitiram a manipulação da política podem abrir espaço para democracia radical, novas relações com a natureza e superação do mercado. Desta contradição se darão disputas cruciais no século XXI\n\n#Socialismo, utopia inviável? (1)\n- https://web.archive.org/web/20191101093954/https://outraspalavras.net/alemdamercadoria/socialismo-utopia-inviavel-1/\n\nHá cem anos, Mises e Hayek desafiaram o sistema proposto por Marx: seria ineficiente e autoritário. Escola Austríaca defendia a desigualdade, mas previu impasses que bloquearam o socialismo. Agora, surgiram meios para superá-los\n\n#Socialismo, utopia inviável? (2)\n- https://web.archive.org/web/20191101094202/https://outraspalavras.net/alemdamercadoria/socialismo-utopia-inviavel-2/\n\nPara Hayek, a economia, muito complexa, só pode evoluir por meio da competição – que o socialismo inibe. Embora resignado, ele frisou as relações entre produção centralizada e autoritarismo. Como responder a esse desafio?\n\n#Socialismo, utopia inviável? (3)\n- https://web.archive.org/web/20191101094010/https://outraspalavras.net/alemdamercadoria/socialismo-utopia-inviavel-3/\n\nHá pós-capitalismo latente no Big Data e na Inteligência Artificial. Já é possível superar o mercado e planejar a produção de modo democrático, sem o peso da burocracia estatal. Desta brecha surgirá uma das disputas centrais no século XXI\n\n#Polêmica: Esquerda sem Antígona?\n- https://web.archive.org/web/20190624152426/https://outraspalavras.net/outrapolitica/polemica-esquerda-antigona/\n\nTodas as ferramentas conceituais e experimentais da esquerda estão sujeitas a uma submissão às formas sociais do capital. Os escritos de Adorno e Kurz nunca fizeram tanta falta\n\n#Internet: o curiosíssimo pacote cubano\n- https://web.archive.org/web/20200410150910/https://outraspalavras.net/tecnologiaemdisputa/internet-o-curiosissimo-pacote-cubano/\n\nO desenvolvimento de redes de relacionamento offline em Cuba, por décadas, levou à criação do “El Paquete Semanal que circula por toda ilha -uma atualização do que rola na internet de mão em mão.\n\n#Marx, 200 anos: como reinventar a emancipação?\n- https://web.archive.org/web/20200410151043/https://outraspalavras.net/sem-categoria/marx-200-anos-como-reinventar-a-emancipacao/\n\nEm Berlim, Toni Negri, Michael Hart e novos movimentos debatem: por que “primaveras” de 2011-2013 fracassaram? Pode-se combinar horizontalismo com construção de programas e estratégias?\n\n#Cuba: reinvenção ou arranjo burocrático?\n- https://web.archive.org/web/20200410151330/https://outraspalavras.net/sem-categoria/cuba-reinvencao-ou-arranjo-burocratico/\n\nTerminam os governos da “geração histórica”; há incertezas e desejo difuso de mudanças. Diáz-Canel, o novo presidente, poderá liderá-las? Em que rumo?\n\n#Viagem à Rússia, às vésperas dos 100 Anos\n- https://web.archive.org/web/20200410151426/https://outraspalavras.net/historia-e-memoria/viagem-russia-vesperas-dos-100-anos/\n\nA Revolução não será tão celebrada. Mas o reerguimento do país é notável — em meio a polêmicas sobre o autoritarismo de Putin e ao apoio quase unânime a sua política externa independente\n\n#Comuns, a racionalidade do Pós-Capitalismo\n- https://web.archive.org/web/20200410151615/https://outraspalavras.net/pos-capitalismo/comuns-a-racionalidade-do-pos-capitalismo/\n\nDepois de renovarem visão da esquerda sobre a ordem neoliberal, Pierre Dardot e Christian Laval sustentam: é possível superá-la, mas no século XXI os caminhos são outros\n\n#O socialismo sem dentes de Ruy Fausto\n- https://web.archive.org/web/20200410151749/https://outraspalavras.net/sem-categoria/o-socialismo-sem-dentes-de-ruy-fausto/\n\nEm “Caminhos da Esquerda”, o professor abre mão de uma das críticas mais agudas e atuais de Marx – a que fustiga o fetichismo e a alienação\n\n#Agamben: profanar a Democracia Representativa\n- https://web.archive.org/web/20200410151905/https://outraspalavras.net/sem-categoria/dialogo-com-agamben-profanar-a-democracia-representativa/\n\nA quem interessa sacralizar um sistema que agora representa apenas o poder financeiro — ou o Deus convertido em Dinheiro, segundo notou filósofo?\n\n#Boaventura: para que o futuro seja de novo possível\n- https://web.archive.org/web/20200410152128/https://outraspalavras.net/pos-capitalismo/boaventura-para-que-o-futuro-seja-de-novo-possivel/\n\nE se o divórcio entre Democracia e Revolução estiver na origem dos tempos sombrios que vivemos? E se Democracia e Revolução puderem se amigar de novo?\n\n#Comunismo: haverá uma “quarta onda”?\n- https://web.archive.org/web/20200410152339/https://outraspalavras.net/pos-capitalismo/comunismo-havera-uma-quarta-onda/\n\nCem anos após a Revolução Russa, o mundo parece mais desigual e injusto que nunca. A velha fênix, que já viveu três vezes, poderá ressurgir das cinzas?\n\n#Fidel, por Eduardo Galeano\n- https://web.archive.org/web/20200410152454/https://outraspalavras.net/geopoliticaeguerra/fidel-por-eduardo-galeano/\n\n“E seus inimigos não dizem que apesar de todos os pesares essa ilha sofrida mas obstinadamente alegre gerou a sociedade latino-americana menos injusta”\n\n#Boaventura: “Somos todos anticapitalistas”\n- https://web.archive.org/web/20200410152612/https://outraspalavras.net/pos-capitalismo/boaventura-somos-todos-anticapitalistas/\n\nEm seu novo livro, sociólogo afirma: lutas operárias já não podem libertar a sociedade; cabe à esquerda despertar múltiplos sujeitos que sistema quer inertes\n\n#A filosofia política de Mujica por ele mesmo\n- https://web.archive.org/web/20200410153127/https://outraspalavras.net/sem-categoria/a-filosofia-politica-de-pepe-mujica-por-ele-mesmo/\n\nEx-presidente sustenta em S.Paulo: é preciso viver como a maioria, aproveitar os dias, libertar-se dos interesses e sonhar com o que virá depois de nós\n\n#Silvio Rodríguez: \"Haverá outra revolução, no futuro\"\n- https://web.archive.org/web/20200410153356/https://outraspalavras.net/poeticas/silvio-rodriguez-havera-outra-revolucao-no-futuro/\n\nEm turnê pelos bairros de Cuba, compositor debate relação com EUA, conquistas culturais e riscos de acomodação. Ele avisa: “não desprezem a centelha do povo”\n\n#Mujica, teórico da transição pós-capitalista?\n- https://web.archive.org/web/20200410153452/https://outraspalavras.net/blog/mujica-teorico-da-transicao-pos-capitalista/\n\nEm entrevista inédita no Brasil, ele debate causas do fracasso do “socialismo real” e afirma: para superar sistema, é preciso começar pelo choque de valores\n\n#Quarenta anos depois\n- https://web.archive.org/web/20200410153654/https://outraspalavras.net/sem-categoria/quarenta-anos-depois/\n\nSocialismo democrático de Allende transformou Santiago no centro fervilhante de criatividade política e intelectual dos anos 1970. Qual a herança deste experimento?\n\n#Marxismo e natureza humana\n- https://web.archive.org/web/20200410154858/https://outraspalavras.net/sem-categoria/sobre-marxismo-e-natureza-humana/\n\nPara argumentar que capitalismo é inevitável, seus defensores associam ser humano a cobiça, rivalidade e ostentação. Marx desmontou tal crença\n\n#O Lincoln que Spielberg — e os EUA — esqueceram\n- https://web.archive.org/web/20191205015034/https://outraspalavras.net/sem-categoria/o-lincoln-que-spielberg-e-os-eua-esqueceram/\n\nAlém de anti-escravista, presidente norte-americano lia Marx, simpatizava com socialistas utópicos e defendia direitos trabalhistas radicais\n\n#O Lincoln que Spielberg — e os EUA — esqueceram\nhttps://web.archive.org/web/20191205015034/https://outraspalavras.net/sem-categoria/o-lincoln-que-spielberg-e-os-eua-esqueceram/\n\nAlém de anti-escravista, presidente norte-americano lia Marx, simpatizava com socialistas utópicos e defendia direitos trabalhistas radicais\n\n#Razões e estratégias do Ecossocialismo\n- https://web.archive.org/web/20200410155708/https://outraspalavras.net/sem-categoria/razoes-e-estrategias-do-ecossocialismo/\n\nMichael Löwy explica por que proposta diverge do “socialismo real”, vai além do ambientalismo e precisa de vitórias parciais\n\n#José Luís Fiori: Desenvolvimentismo e “dependência”\n- https://web.archive.org/web/20200410155952/https://outraspalavras.net/sem-categoria/desenvolvimentismo-e-dependencia/\n\nComo surgiram teorias que, tentando completar Marx, examinaram subdesenvolvimento latino-americano, reunindo de FHC aos que só acreditavam na revolução socialista\n\n#José Luís Fiori vê o “desenvolvimentismo de esquerda\"\n- https://web.archive.org/web/20200410160329/https://outraspalavras.net/sem-categoria/o-desenvolvimentismo-de-esquerda/\n\nCorrente estreitou tanto o seu “horizonte utópico”, que acabou se transformando numa ideologia tecnocrática, sem mais nenhuma capacidade de mobilização social\n\n#Cuba começa a definir seu futuro\n- https://web.archive.org/web/20200410160444/https://outraspalavras.net/sem-categoria/cuba-comeca-a-definir-seu-futuro/\n\nMudanças propostas pelo Partido Comunista vão além da Economia. Setores sociais reivindicam participação. Bispos querem mais investimento privado\n\n#“Como mudar o mundo”\n- https://web.archive.org/web/20200410160633/https://outraspalavras.net/sem-categoria/o-inexaurivel-marx/\n\nObra mais recente de Eric Hobsbawm debate Marx, que via na arte, mais que no trabalho, essência da atividade humana\n\n#Que aconteceu com o meu marxismo?\n- https://web.archive.org/web/20200410160737/https://outraspalavras.net/sem-categoria/que-aconteceu-com-o-meu-marxismo/\n\nCésar Altamira examina três movimentos contemporâneos que reivindicam Marx, sem reduzi-lo à ortodoxia. Como Negri, ele enxerga o “operário social”",
				"added": 1586544759
			},
			{
				"comment_id": 2,
				"body": "#As democracias engolidas e o erro de Piketty\n- https://web.archive.org/web/20200407234435/https://outraspalavras.net/crise-civilizatoria/as-democracias-engolidas-e-o-erro-de-piketty/\n\nDistribuir riquezas por meio de tributos, como propõe economista francês, é importante. Mas para frear a produção de desigualdades e a devastação do mundo, é preciso novas relações de produção — como percebeu o próprio papa Francisco\n\n#Piketty propõe um novo imposto redistributivo\n- https://web.archive.org/web/20200408100515/https://outraspalavras.net/outrasmidias/piketty-propoe-um-novo-imposto-redistributivo/\n\nOferecer a cada ser humano, aos 25 anos, o equivalente a R$ 500 mil. Para tanto, tributar pesadamente os bilionários. Economista sustenta: medida democratizaria acesso à riqueza e às decisões de poder, além de saldar dívida com exploração escrava\n\n#Propriedade privada acima de tudo, propõe Flávio Bolsonaro\n- https://web.archive.org/web/20200408105751/https://outraspalavras.net/outrasmidias/propriedade-privada-acima-de-tudo-propoe-filho-01/\n\nFilho do presidente quer alterar Constituição para destruir “função social” do imóvel: dar salvo-conduto a proprietários que violem leis trabalhistas e de preservação ambiental, e permitir espaços vazios e improdutivos nas cidades e no campo\n\n#Piketty propõe “socialismo participativo”\n- https://web.archive.org/web/20191231044844/https://outraspalavras.net/outrasmidias/piketty-propoe-socialismo-participativo/\n\nEm novo livro, economista recupera debate socialista sobre a propriedade e sugere formas para superar desigualdades: renda básica cidadã financiada por tributação progressiva, herança coletivizada e educação de qualidade e para todos\n\n#Piketty propõe superar a propriedade privada\n- https://web.archive.org/web/20191128210357/https://outraspalavras.net/outrasmidias/piketty-propoe-superar-a-propriedade-privada/\n\nEm seu novo livro, economista francês apresenta antídotos ao hipercapitalismo e à acumulação ilimitada. Entre eles: imposto de até 90% sobre o patrimônio; propriedade temporal dos bens; e herança comum a todos os seres humanos\n\n#A lógica senil da propriedade privada\n- https://web.archive.org/web/20200106165041/https://outraspalavras.net/alemdamercadoria/a-logica-senil-da-propriedade-privada/\n\nNum tempo de recursos escassos, permitir que terra e riquezas sejam controladas por muito poucos — e herdadas — é roubar as novas gerações. Está na hora das Propriedades Comuns\n\n#Mulheres, vítimas da primeira luta de classes?\n- https://web.archive.org/web/20190529012242/https://outraspalavras.net/outrasmidias/mulheres-vitimas-da-primeira-luta-de-classes/\n\nO poder de fazer da mulher uma propriedade está na raiz do patriarcado — mas também do capitalismo. Ele modela todas as outras formas de propriedade e de captura do que é fecundo\n\n#Cuba e a propriedade privada\n- https://web.archive.org/web/20200410190436/https://outraspalavras.net/outrasmidias/cuba-e-a-propriedade-privada/\n\nManter o caminho? Abrir para o “empreendedorismo” privado? Socialismo autogestionário? são muitos os dilemas do socialismo cubano",
				"added": 1586545496
			},
			{
				"comment_id": 5,
				"body": "#Mais-valia\n- https://swarm-gateways.net/bzz:/3b542d37fed188e59b145a0594f4075796a7e139cb7f959ac4dd91bab4a5a9ac/mais-valia-quadrinhos.png\n\nMais-valia é o termo famosamente empregado por Karl Marx à diferença entre o valor final da mercadoria produzida e a soma do valor dos meios de produção e do valor do trabalho, que seria a base do lucro no sistema capitalista.",
				"added": 1586546787
			},
			{
				"comment_id": 6,
				"body": "#Revolução Russa: assim tudo começou\n- https://web.archive.org/web/20200410193724/https://outraspalavras.net/pos-capitalismo/revolucao-russa-assim-tudo-comecou/\n\nComo foram as semanas frenéticas que levaram, há cem anos, ao colapso do poder burguês na Rússia e ao primeiro governo anticapitalista da História",
				"added": 1586547468
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 3,
				"body": "> [ermintor](#comment_7_1MwwTJRv96yifi4KwRtDRjFHQjtxz7kPcr): The Corporation\n> \n> https://gateway.pinata.cloud/ipfs/QmbfmGFR8T2ct8a9KCEtSBokyPgu3f9eRzpA81zUN9n74N\n> \n>  A partir da polêmica decisão da Suprema Corte de Justiça americana concluindo que uma corporação, aos olhos da lei, é uma \"pessoa\", são analisados os poderes das grandes corporações no mundo atual. A exploração da mão-de-obra barata no Terceiro Mundo e a devastação do meio ambiente são alguns dos fatos explorados, que entrevistam presidentes de corporações como a Nike, Shell e IBM, além de Noam Chomsky, Milton Friedman e Michael Moore.\n\n#A nova face das corporações modernas (1)\n- https://web.archive.org/web/20200406135245/https://outraspalavras.net/crise-civilizatoria/a-nova-face-das-corporacoes-modernas-1/\n\nAutor do documentário The Corporation afirma, 15 anos depois: megaempresas assumiram discurso “verde” e “do bem”. Mas mantêm essência de suas práticas, tentam livrar-se de qualquer controle social e se tornam “psicopatas com charme”\n\n#A nova face das corporações modernas (2)\n- https://web.archive.org/web/20200315112927/https://outraspalavras.net/crise-civilizatoria/a-nova-face-das-corporacoes-modernas-2/\n\nAutor do documentário The Corporation sustenta: sedentas de lucros e autocentradas, megaempresas buscam minar controles democráticos e reduzir tudo a mercadoria. Podem tornar-se obsoletas, nas sociedades contemporâneas",
				"added": 1586545695
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 4,
				"body": "#Diamantes de Sangue \n- https://swarm-gateways.net/bzz:/5af827b4bd53d1d928dee8f71b246f552efddec426cf76e6512f2017171065aa/Diamantes_de_Sangue-Rafael_Marques.pdf\n\nO trabalho de investigação de Rafael Marques é já bem conhecido, sobretudo através dos canais de comunicação on-line. É ele um dos principais responsáveis por denunciar e divulgar os esquemas de corrupção que envolvem as mais altas esferas do poder em Angola, bem como as empresas e entidades estrangeiras que com ele negoceiam.\n\nNa região do Cuango, a situação é trágica.\n\nPara benefício dos que exploram os diamantes, as populações são mantidas em condições de quase escravatura, sendo torturadas, assassinadas, roubadas e impedidas de manter quaisquer actividades de auto-subsistência.\n\nAs autoridades e o governo ignoram os crimes, as forças armadas e policiais são não só coniventes como também protagonistas desses crimes.",
				"added": 1586545814
			}
		]
	},
	"comment_vote": {}
}