{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1579853774_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1580340450_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1580340450_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 1,
				"body": "Check this: https://www.planetminecraft.com/forums/help/javaedition/what-are-the-risks-of-hosting-a--576103/\n\nWhy don't you decentralise it and use this zeronet protocol instead? Just be sure to be an active peer to have 100% uotine",
				"added": 1580341171
			},
			{
				"comment_id": 2,
				"body": "> [aassddff](#comment_20_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): This is so i can access it from  computers that do not have Zeronet installed, and most public proxies seem unstable. 0net.io isn't working at all, and i can't seem to find any others who work.\n\nOh sorry I was high af hahahah I misread..\n\nI'm not an expert on this but maybe if there isn't any good public proxy is because you'd need a powerful server to provide good speed, and potentially huge traffic loads? Maybe the banners don't make enough money to pay the fees if people started taking advantage of it. Consider also that content passing by could be horrible illegal shit, who wants that responsibility?\n\nAnyway, I think what you want can be accomplished with a simple flask server (if I'm not mistaken the source code is mainly python right?), it doesn't have to be hosted in your computer, and it would be just a portal webapp, like a smart frame that interfaces the user with zeronet. \n\nIn my opinion you should keep it private and try to hide the fact that you are embedding a zero net site when you will publish the proxy. If you manage to hardcode your site at server side level (~ the only one you could connect to with the proxy) you should be good. Still, I think that by doing all this you are nullifying some security layers designed to make this system stronger.\n\nIf you wanna investigate more and they won't reply here, I suppose you can open an issue on their Github repo, but prepare to be digitally scolded.",
				"added": 1580344484
			}
		]
	},
	"comment_vote": {}
}