{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1514877972_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa": [
			{
				"comment_id": 5,
				"body": "The backbone of ZeroNet is and should stay masses of individual peers, lest the network become degenerate and centralized, enabling censors to control what we can see or not. I find it hard to believe that giving site owners an incentive to keep \"unsavvy\" users on *specific* proxies for their own profit can end up doing more good than harm to the network. ZeroNet needs users and content to thrive, but above all it needs them to be running their own clients for the concept to work at all.",
				"added": 1514883040
			},
			{
				"comment_id": 6,
				"body": "> [mrsrobotzerocat](#comment_17_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa): ZeroNet proxies will serve the same purpose as e-wallets, or tor .onion sites - providing access to blockchain technology to the mainstream consumers who don't want to run their own clients and don't want to download some 20GB file/s. Consumers who are unsatisfied with the way certain proxies are run, will always have the option not to use them, and will download the client instead.\n\n> [htgozn](#comment_55_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): ...many wouldn't peek an interest until they glimpsed a sight of what they were missing...\n\nProxies are imporant introducers, and I'm not arguing that they should be gone. The only problematic thing is giving site owners an incentive to *keep* \"unsavvy\" users on *specific* proxies, emphasis on **keep** and **specific**. This combination has a rather adverse implication on decentralization: \"Zite owners would have to come up with a way of implementing code that *stops their zites from being displayed on proxies that do not provide them a good deal*.\" Now consider putting \"127.0.0.1\" in that list.",
				"added": 1514884233
			},
			{
				"comment_id": 7,
				"body": "> [mrsrobotzerocat](#comment_19_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa): You obviously wouldn't be able to reverse-blacklist a local IP address like 127.0.0.1, but you could certainly blacklist a domain from broadcasting your content.\n\nOne does not have to *blacklist a domain from broadcasting their content* to *stops their zites from being displayed*. They can just make their site stop working when `127.0.0.1` is in the URL. That's not rocket science. Not many \"unsavvy\" users can get around that.",
				"added": 1514884604
			},
			{
				"comment_id": 8,
				"body": "> [htgozn](#comment_56_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): may be one part of ZeroNet's future evolution\n\nIf it is, then it's a future many would like to opt out of. We didn't come here to ask for even more centralization.\n\n> [mrsrobotzerocat](#comment_20_1DpN91N84piuzYn2iJKM9RK3Ek8JVNjewa): blocking all the people who post/upload content to your zite using their clients. Thus, making your zite unpopular.\n\nUnpopular among \"savvy\" users, maybe, but they don't generate the income.",
				"added": 1514885528
			}
		],
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 9,
				"body": "This looks pretty nice.",
				"added": 1543727154
			}
		]
	},
	"comment_vote": {}
}