{
	"title": "cannonfodder",
	"description": "Exploring ZeroNet",
	"links": "# My sites\n- [TV Magnet Links](/1MagneTSMMkNmJTMsTGJtfuNsqGjzzXgQv)\n- [River of News](/1RivERqttrjFqwp9YH1FviduBosQPtdBN)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1602411611,
	"post": [
		{
			"post_id": 20,
			"title": "Updates started again",
			"date_published": 1602411441.526,
			"body": "Both [TV Magnet Links](http://127.0.0.1:43110/1MagneTSMMkNmJTMsTGJtfuNsqGjzzXgQv) and [River of News](http://127.0.0.1:43110/1RivERqttrjFqwp9YH1FviduBosQPtdBN) have started operating again. The caching to Freenet is disabled though."
		},
		{
			"post_id": 19,
			"title": "Newsriver article cache time limit",
			"date_published": 1572812847.045,
			"body": "The length of time that the cached images for articles are kept has been changed to 24 hours. The images are optional files so aren't downloaded by default but they are about 500 MB per day which can be an issue for sites that choose to download all optional files. For now I'll leave it at 24 hours but may make it longer if it is an issue."
		},
		{
			"post_id": 18,
			"title": "Fixed broken newsriver imports",
			"date_published": 1572474833.539,
			"body": "Imports of NYT and some other news sites was not working. This is now fixed. Thank you to the user who sent me a ZeroMail about it. I hadn't noticed that it was primarily RT content recently."
		},
		{
			"post_id": 17,
			"title": "Newsriver now caching articles to ZeroNet",
			"date_published": 1572301200.548,
			"body": "Following up on my previous post about caching articles to Freenet, the [newsriver.bit](http://127.0.0.1:43110/newsriver.bit/) site now caches some of the articles on ZeroNet itself using the optional files support. The cached articles are images of the website, rather than the website itself, to make caching easier. If you enable downloading optional files for newsriver from the sidebar of the site then you can help contribute the seeding of the files."
		},
		{
			"post_id": 16,
			"title": "Newsriver caching articles to Freenet",
			"date_published": 1492421890.216,
			"body": "The [newsriver.bit](http://127.0.0.1:43110/newsriver.bit/) site now caches some of the articles on Freenet. This allows reading the articles anonymously. You will need to have Freenet installed and running on the default port of 8888 for this to work. Look for the `(freenet)` indicator in the titles.\n\nI'm not caching them in ZeroNet yet due to their size. I'll work on caching the last  few days only in ZeroNet as a workaround at some point."
		},
		{
			"post_id": 15,
			"title": "TV episode site using ettv releases",
			"date_published": 1491984680.764,
			"body": "I've updated [tvepisodes.bit](http://127.0.0.1:43110/) to use ettv releases. Inserts into Freenet continue and are discussed in the Freenet 'tvepisodes' FMS forum."
		},
		{
			"post_id": 14,
			"title": "TV Episode site now using RARBG",
			"date_published": 1474778594.377,
			"body": "I had problems with the eztv.ag import so I've switched to using rarbg.to for [tvepisodes.bit](http://127.0.0.1:43110/tvepisodes.bit/). Updating how now resumed."
		},
		{
			"post_id": 13,
			"title": "TV Episode updates resumed using EZTV",
			"date_published": 1469353253.341,
			"body": "With kat.ag going down the updates stopped on [tvepisodes.bit](http://127.0.0.1:43110/tvepisodes.bit/). I've switched to using eztv.ag to obtain the source of new torrents and resumed updates.\n\nIn the future I plan to add more sources and investigate getting new torrents directly from the bittorrent DHT."
		},
		{
			"post_id": 12,
			"title": "BBC news back on River of News",
			"date_published": 1466919603.238,
			"body": "The [River of News](http://127.0.0.1:43110/newsriver.bit) site had BBC news temporarily disabled due to issues importing their RSS feed. This is now fixed and I've re-enabled it."
		},
		{
			"post_id": 11,
			"title": "Monero Donations",
			"date_published": 1461071919.925,
			"body": "I've added a [Monero](https://getmonero.org/home) donation address to [TV Magnet Links](/tvepisodes.bit) and [River of News](/newsriver.bit). The address is <small>45XA7Ji6h7Pai157hJEKSgPpgKr8TJ9YPbbt8e8nXV9FBnzND3GwZGUL66cSMaGhDicJRCbCN68QQ6MmKrtjpacMQMzU2X1</small>.\n\nMonero is a cryptocurrency designed to be more anonymous than bitcoin. It does not allow tracing the origins of transactions."
		},
		{
			"post_id": 10,
			"title": "Freenet uploads resumed",
			"date_published": 1459776358.533,
			"body": "I've resumed the [TV Episode](/tvepisodes.bit) Freenet uploading with some speed improvements. The queue should fall as far behind now."
		},
		{
			"post_id": 9,
			"title": "Freenet uploads paused",
			"date_published": 1459386483.094,
			"body": "I've paused the [TV Episode](/tvepisodes.bit) Freenet uploading temporarily while I let the upload queue catch up and implement some optimizations."
		},
		{
			"post_id": 8,
			"title": "Freenet TV Episode insert progress",
			"date_published": 1458958627.384,
			"body": "The insertion of [TV Episode](/tvepisodes.bit) files into Freenet is working but is slow. The site shows whether a particular file is being inserted or the freenet key if the insert completes. I've successfully downloaded from freenet using the keys.\n\nCurrently only SD definition files are being inserted. 720p, 1080p and above are being ignored. Once I have insertion stable and faster I'll look at adding the better quality files.\n\nThe contents of the torrent are stored as a zip file. Freenet allows storing directories of files and I'll investigate how to get this working. This might enable playing the files directly from Freenet. It would also allow selecting individual files if all you want is a .srt rather than getting the entire results."
		},
		{
			"post_id": 7,
			"title": "TV Episode Freenet Links Available",
			"date_published": 1458807686.73,
			"body": "I've added a feature to the [TV Episodes](/tvepisodes.bit) site to make it safer to anonymously download the files instead of using bittorrent where your IP address can be discovered.\n\nI'm using Freenet to store the files and there is a new \"Freenet Key\" column in the table of episodes. If the upload to Freenet has completed for that file then the key to download will appear there. Entering that key in Freenet will start the download.\n\nFreenet is an anonymous decentralized network for storage of files and information. Their website is [https://freenetproject.org](https://freenetproject.org/).\n\nI thought about using IPFS for this but that has the issue of not being anonymous. Publishing the files there will reveal the IP address for users seeding the data and those retrieving it. If this changes I'll reconsider."
		},
		{
			"post_id": 6,
			"title": "Want a .bit name? Need namecoins?",
			"date_published": 1456990913.831,
			"body": "I made this offer on the ZeroTalk forums recently when people asked how to get namecoins to register their .bit name for their sites.\n\nIf you have namecoin installed and can [ZeroMail me](/Mail.ZeroNetwork.bit/?to=cannonfodder)  a namecoin address I'll send you a small amount of coins to get started. It'll be enough to register a name and update it a few times.\n\nI can also register the name for you if you don't have namecoin installed and transfer it to you when do install it - but that requires a significant amount of trust in me that I won't run off with your name so I don't recommend it.\n\nI'll keep this going until demand gets too high for my small amount of namecoins to last. Luckily registering requires a very small amount.\n\nI registered [tvepisodes.bit](/tvepisodes.bit), [newsriver.bit](/newsriver.bit) and [cannonf.bit](/cannonf.bit) for my sites.\n\n"
		},
		{
			"post_id": 4,
			"title": "River of News",
			"date_published": 1456902044.344,
			"body": "Along with resurrecting the TV episodes site I've revived the [River of News](/1RivERqttrjFqwp9YH1FviduBosQPtdBN). This shows a rolling 24 hours of news from the New York Times and BBC websites with links to the original articles."
		},
		{
			"post_id": 2,
			"title": "TV Episodes Magnet Mirror",
			"date_published": 1456901265.52,
			"body": "A while back I created a site to show the [last week of TV magnet links](/1MagneTSMMkNmJTMsTGJtfuNsqGjzzXgQv) from [Kickass Torrents](https://kat.cr). I stopped updating it late last year but with the recent attention around ZeroNet decided to resume it.\n\nIt's quite basic but I find it useful. ZeroNet has gained a lot of features since I played with it and I'm looking at how the site can be expanded to use them."
		}
	]
}