{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "14 Características do Fascismo",
			"body": "#Dr. Lawrence Britt examinou os regimes fascistas de Hitler (Alemanha) , Mussolini (Itália) , Franco (Espanha) , Suharto (Indonésia) e vários regimes latino-americanos. Britt encontrou 14 características que definem o Fascismo.\n\n1 . Nacionalismo Poderoso e Continuando – regimes fascistas tendem a fazer uso constante de lemas patrióticos, slogans, símbolos, músicas e outros apetrechos. Bandeiras são vistas em todos os lugares, assim como os símbolos da bandeira em roupas e em demonstrações públicas.\n\n2 . Desdém para o reconhecimento dos direitos humanos – Por causa do medo de inimigos e da necessidade de segurança, as pessoas em regimes fascistas estão convencidos de que os direitos humanos podem ser ignorados em alguns casos por causa da ” necessidade”. As pessoas tendem a olhar para o outro ou até mesmo aprovar a tortura, as execuções sumárias, assassinatos, longos encarceramentos de prisioneiros.\n\n3 . Identificação de inimigos / bodes expiatórios como uma causa unificadora – As pessoas devido ao medo se reúnem em um frenesi patriótico unificador para lidar com a necessidade de eliminar uma ameaça comum percebida ou inimigo : as minorias raciais , étnicas ou religiosas ; liberais ; comunistas; socialistas, terroristas.\n\n4 . Supremacia dos Militares – Mesmo quando problemas civis são regra geral, é dado ao militar uma quantidade desproporcional de financiamento do governo, e a agenda domestica e civil nacional é negligenciada. Soldados e serviço militar se tornam prioridade.\n\n5 . Sexismo desenfreado – Os governos das nações fascistas tendem a ser quase exclusivamente dominado pelos homens. Sob regimes fascistas, os papéis tradicionais de gênero tornam-se mais rígida. O divórcio, o aborto e a homossexualidade são suprimidos e o estado é representado como o guardião supremo da instituição familiar.\n\n6 . Controle das mídias de massas – Às vezes, a mídia é controlada diretamente pelo governo, mas em outros casos, a mídia é controlada indiretamente pela regulamentação do governo, ou porta-vozes da mídia simpático e executivos. Censura, especialmente em tempo de guerra , é muito comum. A mídia também pode ser controlada por meios subentendidos; acordos comerciais, concessão de benefícios a um canal específico.\n\n7 . Obsessão com a Segurança Nacional – O medo é usado como uma ferramenta de motivação por parte do governo sobre as massas .\n\n8 . Religião e governo estão entrelaçadas – Os governos de nações fascistas tendem a usar a religião mais comum no país como uma ferramenta para manipular a opinião pública. Retórica religiosa e terminologia é comum entre os líderes do governo, mesmo quando os grandes princípios da religião são diametralmente opostas às políticas e ações do governo.\n\n9 . Poder corporativo está protegido – A aristocracia industrial e empresarial de uma nação fascista, muitas vezes são os que colocam os líderes do governo no poder, criando uma relação negócios/governo mutuamente benéfica que mantem o poder da elite.\n\n10 . O poder do trabalhador é suprimido – Porque o poder de organização do trabalhador é a única ameaça real a um governo fascista, sindicatos ou são eliminados por completo, ou são severamente reprimidas.\n\n11 . Desdém por intelectuais e as Artes – nações fascistas tendem a promover e tolerar hostilidade aberta ao ensino superior, e na academia. Não é incomum para os professores e outros acadêmicos a serem censuradas ou até mesmo presos. A liberdade de expressão nas artes e nas letras são abertamente atacados.\n\n12 . Obsessão com Crime e Castigo – sob regimes fascistas, é dado poder quase ilimitado à polícia para fazer cumprir as leis. As pessoas são muitas vezes dispostas a ignorar os abusos policiais e até mesmo abrir mão de liberdades civis em nome do patriotismo. Muitas vezes existe uma força policial nacional com poder virtualmente ilimitado em nações fascistas.\n\n13 . Favoritismo desenfreado e Corrupção – regimes fascistas quase sempre são governadas por grupos de amigos e associados que nomeiam uns aos outros para cargos do governo e usar o poder governamental e autoridade para proteger seus amigos de prestação de contas. Não é incomum em regimes fascistas de recursos nacionais e até mesmo tesouros a serem apropriados ou mesmo definitivas roubados por líderes do governo.\n\n14 . Eleições fraudulentas/Urnas Fraudulentas e fraudáveis – Às vezes as eleições em nações fascistas são uma farsa completa. Outras vezes as eleições são manipuladas por campanhas de difamação contra ou mesmo assassinato de candidatos da oposição , o uso de legislação para controlar os números de voto ou limites dos distritos políticos e manipulação dos meios de comunicação. Nações fascistas também usam normalmente os seus sistemas judiciários para manipular ou controlar as eleições.",
			"added": 1537652049
		},
		{
			"topic_id": 2,
			"title": "Noam Chomsky em português",
			"body": "#Noam Chomsky em português\n- https://www.youtube.com/channel/UCweS7hhuA4cY2vrhwheXvNA",
			"added": 1537653121
		},
		{
			"topic_id": 3,
			"title": "Filosofia da ciência",
			"body": "A filosofia da ciência pode ser dividida em duas grandes áreas: a epistemologia da ciência e a metafísica da ciência. A epistemologia da ciência discute a justificação e a objectividade do conhecimento científico. A metafísica da ciência discute aspectos filosoficamente problemáticos da realidade desvendada pela ciência.",
			"added": 1537663732
		}
	],
	"topic_vote": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"2_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"1_1xm3wUZda9fxCaKUSgkNCvHrwBPnLS6ni": 1,
		"2_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"3_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 20,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#Suma Teológica\nSuma Teológica ou Summa Theologica (por vezes Summa Theologiæ) é o título da obra básica de São Tomás de Aquino, frade, teólogo e santo da Igreja Católica, um corpo de doutrina que se constitui numa das bases da dogmática do catolicismo e considerada uma das principais obras filosóficas da escolástica. Foi escrita entre os anos de 1265 a 1273. \n- https://web.archive.org/web/20180922203514/https://sumateologica.files.wordpress.com/2017/04/suma-teolc3b3gica.pdf",
				"added": 1537649062
			},
			{
				"comment_id": 3,
				"body": "#Mein Kampf – Adolf Hitler\nMein Kampf é o título do livro de dois volumes de autoria de Adolf Hitler, no qual ele expressou suas ideias anti-semitas, racialistas e nacional-socialistas então adotadas pelo partido nazista. O primeiro volume foi escrito na prisão e editado em 1925, o segundo foi escrito por Hitler fora da prisão e editado em 1926. Mein Kampf tornou-se um guia ideológico e de ação para os nazistas, e ainda hoje influencia os neonazistas, sendo chamado por alguns de “Bíblia Nazista”.\n\nÉ importante ressaltar que as ideias propostas em Mein Kampf não surgiram com Hitler, mas são oriundas de teorias e argumentos então correntes na Europa. Na Alemanha nazista, era uma exigência não oficial possuir o livro. Era comum presentear o livro a crianças recém-nascidas, ou como presente de casamento. Todos os estudantes o recebiam na sua formatura.\n\n- https://web.archive.org/web/20180922205542/https://sanderleisilveira.com.br/PDF/Adolf-Hitler/Adolf-Hitler-Mein-Kampf-PT.pdf",
				"added": 1537649785
			},
			{
				"comment_id": 4,
				"body": "#Manual do Guerrilheiro Urbano – Carlos Marighella\nEscrito em 1969, para servir de orientação aos movimentos revolucionários e libertários. Circulou em versões mimeografadas e fotocopiadas, algumas diferentes entre si, sem que se possa apontar qual é a original. Nesta obra, defendeu o terrorismo, o sequestro e as execuções sumárias como métodos a serem empregados pelos guerrilheiros brasileiros. Nos anos 80, a CIA – Central Inteligence Agency, dos Estados Unidos, fez traduções em inglês e espanhol para distribuir entre os serviços de inteligência do mundo inteiro e para servir como material didático na Escola das Américas, por ela mantida, no Panamá.\n- https://web.archive.org/web/20180922210320/https://www.documentosrevelados.com.br/wp-content/uploads/2015/08/carlos-marighella-manual-do-guerrilheiro-urbano.pdf",
				"added": 1537650240
			},
			{
				"comment_id": 5,
				"body": "#[Diferença essencial entre Homem e Animal]\n#Autor: Max Scheler\n- https://web.archive.org/web/20180922211733/http://www.lusosofia.net/textos/scheler_max_dieferenca_entre_homem_e_animal.pdf",
				"added": 1537651155
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 2,
				"body": "Não amem o mundo nem o que nele há. Se alguém amar o mundo, o amor do Pai não está nele.\nPois tudo o que há no mundo — a cobiça da carne, a cobiça dos olhos e a ostentação dos bens — não provém do Pai, mas do mundo.\nO mundo e a sua cobiça passam, mas aquele que faz a vontade de Deus permanece para sempre.\n\n- 1 João 2:15-17",
				"added": 1537649199
			}
		],
		"1_1PCYHhrL3dQCiB3cSHU2xk2M7rKk7Y6mUd": [
			{
				"comment_id": 6,
				"body": "60 FORMAS DE FUGIR DO ESTADO PARTE 1: http://telegra.ph/60-FORMAS-DE-FUGIR-DO-ESTADO---PARTE-1-03-19\n\n60 FORMAS DE FUGIR DO ESTADO PARTE 2: http://telegra.ph/60-FORMAS-DE-FUGIR-DO-ESTADO---PARTE-2-03-19",
				"added": 1537652510
			}
		],
		"1_1xm3wUZda9fxCaKUSgkNCvHrwBPnLS6ni": [
			{
				"comment_id": 7,
				"body": "#A Física da Alma – Amit Goswami\nExiste mesmo uma alma que sobreviva à morte e transmigre de um corpo para outro? Será que a reencarnação é científica? Há uma explicação convincente para os inúmeros relatos de experiências de quase morte e de comunicações mediúnicas? E para o fenômeno dos anjos e guias espirituais? A resposta de Goswami para essas perguntas é sim. Por meio de um trabalho cientificamente bem fundamentado e, ao mesmo tempo, de leitura fácil e compreensível, o pesquisador indiano promete revolucionar os principais conceitos da medicina, física e filosofia. O resultado é uma profunda, ampla e enriquecedora visão de mundo que integra mente e espírito na ciência. \n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg/A%20Fisica%20da%20Alma%20-%20Amit%20Goswami.pdf",
				"added": 1537654203
			},
			{
				"comment_id": 8,
				"body": "#Ramana Maharshi e o Caminho do Autoconhecimento, de Arthur Osborne.\n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg/Ramana%20Maharshi%20e%20o%20Caminho%20do%20Autoconhecimento.pdf",
				"added": 1537654531
			},
			{
				"comment_id": 9,
				"body": "#Os Pensadores - Tomas de Aquino e Dante Alighieri\n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg/[Tomas_de_Aquino,_Dante_alighieri]_Os_Pensadores_-(b-ok.xyz).pdf",
				"added": 1537654945
			},
			{
				"comment_id": 13,
				"body": "#Pedagogia do Oprimido\nPedagogia do Oprimido é um dos mais conhecidos trabalhos do educador e filósofo brasileiro Paulo Freire. O livro propõe uma pedagogia com uma nova forma de relacionamento entre professor, estudante, e sociedade.\n- https://web.archive.org/web/20180923001246/http://files.portalconscienciapolitica.com.br/200000081-ed3e5ee3d0/Pedagogia%20do%20Oprimido.pdf",
				"added": 1537661633
			}
		],
		"2_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": [
			{
				"comment_id": 10,
				"body": "# Substância, liberdade e existência - impasses metafisicos em Spinoza\n- https://web.archive.org/web/20180922235618/http://www.sens-public.org/IMG/pdf/SensPublic_FCaprio_Substancia_Liberdade_e_Existencia.pdf",
				"added": 1537660865
			},
			{
				"comment_id": 11,
				"body": "#Principios da filosofia cartesiana e Pensamentos Metafísicos - Baruch de Spinoza\n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg/[Baruch_de_Spinoza]_Principios_da_filosofia_cartes(b-ok.xyz).pdf",
				"added": 1537661221
			},
			{
				"comment_id": 12,
				"body": "#Breve tratado de Deus, do homem e do seu bem-estar\n- http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg/[Baruch_de_Spinoza]_Breve_tratado_de_Deus,_do_home(b-ok.xyz).pdf",
				"added": 1537661306
			},
			{
				"comment_id": 14,
				"body": "#A Matrix enquanto hipótese metafísica\n- https://web.archive.org/web/20180923003606/https://criticanarede.com/meta_matrix.html",
				"added": 1537663042
			},
			{
				"comment_id": 15,
				"body": "#Por que há algo em vez de nada?\n- https://web.archive.org/web/20170815060153/http://criticanarede.com:80/onada.html",
				"added": 1537663097
			}
		],
		"3_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": [
			{
				"comment_id": 16,
				"body": "#A teoria de tudo\n- https://web.archive.org/web/20180923004834/https://criticanarede.com/teoriadetudo.html",
				"added": 1537663946
			},
			{
				"comment_id": 17,
				"body": "O que é uma lei da natureza?\n- https://web.archive.org/web/20171211234343/https://criticanarede.com/leidanatureza.html",
				"added": 1537663983
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 18,
				"body": "#A gravidade e a curvatura do espaço-tempo\n- https://web.archive.org/web/20171006083912/https://criticanarede.com/cie_gravidade.html",
				"added": 1537664087
			},
			{
				"comment_id": 19,
				"body": "#Problemas filosóficos tradicionais sobre o espaço e o tempo\n- https://web.archive.org/web/20180923005626/https://criticanarede.com/est_realrecriada.html",
				"added": 1537664241
			}
		]
	},
	"comment_vote": {
		"1_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"2_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"6_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"7_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"9_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"10_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"11_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"12_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"13_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"19_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1,
		"18_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": 1
	}
}