{
	"posts": [
		{
			"id": "227b208e-af10-427d-ad14-86b7b485fd27",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>4418449f-d318-47ff-92f5-6ec5ed4b252b\nThis might be a good idea. 08chan is cool but right now it has enough problems that this might be better for gathering everyone in one place, especially if we need to bunker for any length of time.\n\n1. It's an out-of-date fork of Millchan missing important bugfixes, supposedly including one that could cause people to not delete and continue sharing content they had muted, as this anon has been talking about. >>0179ee26-9508-4c55-8acf-7ed1ae638e2a We might be better off just on Millchan itself (the one set up by the developer) so it's up to date. But we would need to coordinate that. Or maybe the person who set it up can update it somehow, but I don't know if they're active.\n\n2. The instructions in the widely distributed image for using it with the Tor Browser say to make an exception in the proxy settings, but don't mention you need to enable Tor for all connections on the main ZeroHello page, which is the next step in the actual ZeroNet FAQ. If you make the exception but don't enable Tor on ZeroHello because you followed the instructions, everything you do on ZeroNet is going through the clearnet without using Tor at all.\n\n3. Thumbnails aren't working with Tor Browser, though that's fixed on the updated Millchan version too.\n\n4. Right now it's suceptible to spamming if it gets enough attention, and it might be suceptible to DDOS too. \n\n5. Honestly \"mute illegal content if it's posted\" isn't good enough, I think we need board owners to be able to delete posts for everyone. Otherwise any sufficently dedicated and immoral anti-GG person can fuck up threads for all new visitors, which is especially bad with 1, 2, and 4. I don't know if any feature to enable this exists or is coming to Millchan.",
			"time": 1565033222200,
			"files": "[]"
		},
		{
			"id": "22217ba4-04af-49e7-8dcf-c6b094aef120",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>39e6b49b-3b12-4df6-922c-01c93c7baad4\n>'enabled' is the default and will allow connections for bother normal p2p and p2p over onion traffic.\n\nSo it'll never connect to a Miichan instance without Tor? That's good then, thanks. Someone else pointed out the difference from the official FAQ, which says to click enable for everything, so I didn't realize it was on by default.\n\n>The owner of a board can add users to the blacklist by default, effectively banning them. This is what the 'Enable blacklist'-checkbox at the bottom of the page enables and disables\n\nThat's good so long as the board owner is active. This makes me more positive about Miichan as a bunker (though not necessarily long-term), but we would need to organize a move without leaving people behind. Mostly I'm just hoping fullchan is up soon and we'll update the image and let people know for future needs, but at worst we can post a bunch of threads on 08chan letting people know about the migration once it's organized.\n\nIncidentally it's annoying I can't make the quick-reply box bigger, I see the updated version has fixed that as well.",
			"time": 1565037439400,
			"files": "[]"
		},
		{
			"id": "e783507e-d536-4ee3-9ba7-5afc8dbcaed2",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>2188252d-1b27-4073-9c13-ef6b68662fea\nYou're right, it's there, it was just hard to see. The only reason it was more visible on Miichan was because it was very pale grey on black instead of on white.",
			"time": 1565037780100,
			"files": "[]"
		},
		{
			"id": "651aceea-22b5-4ec4-8f42-2ec79a4bb455",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>8047c725-7646-4c3f-b6ae-d6f05c45e58c\nCan someone set Tor to disabled and get the IPs of other posters who have it \"Enabled\" instead of \"Always\"?",
			"time": 1565038819400,
			"files": "[]"
		},
		{
			"id": "9cb6c756-79a8-4e7a-8d32-832251d3cb43",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": "Keep in mind there's a bug regarding properly deleting files when they're muted:\n>>3fb6f055-27b3-427c-bfbd-6fa922621219\nIt seems good to start working on it in case fullchan takes more than a day to get back up.",
			"time": 1565040369400,
			"files": "[]"
		},
		{
			"id": "a62ad2bd-df7d-4aa5-bdd8-f4a0b05d43cf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>d63aee41-2e38-4d0b-b86f-060f41779073\n>There's no \"moderation responsibility\" since we can't moderate anyway. \n\nWell, if someone starts attacking the board by posting CP or spamming we definitely want it blacklisted as quickly as possible, not many people would be willing to be here if they had to mute stuff like that all the time.",
			"time": 1565041205700,
			"files": "[]"
		},
		{
			"id": "fcbbd304-c54a-4850-8e65-2dc0f19e0384",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>c697ba4d-aaf3-434d-8b5f-550b7a56cf3f\nIf we don't want to deal with the nature of 08chan and this lasts more than a day we could have a vote or something and decide whether to migrate to the more conventional bunker.\nhttps://vch.moe/v/index.html\n\nIs there something Mark can implement to change the \"board owner can see your IP\" thing for the other bunker? Honestly I don't personally care, it's the same way 8chan worked originally and he didn't abuse it then, but if it's going to scare people off it should be fixed. Though you can apparently post with Tor there so that's a way to mitigate it.",
			"time": 1565052553000,
			"files": "[]"
		},
		{
			"id": "bbd99bb9-7943-4d78-b0fa-ad9528962634",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>1779492e-c250-4f36-a560-f4412f0cd81d\nImageboards need a critical mass of people to stay active and healthy, we don't have that many people to spare. Scaring away people and not bringing in enough fresh blood just means we'll slowly die from inactivity. This is a major happening and we're already very slow, if we stayed here without convincing most of 8/v/ to come (and finding ways to remain discoverable for new people) it'll get to the point of hours and then days between posts.",
			"time": 1565104229400,
			"files": "[]"
		},
		{
			"id": "f501b334-c044-4206-90db-7b3dadc44946",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": "If you modify about:config you can apparently fix the problem where you post blank thumbnails in Tor Browser. Trying it now.",
			"time": 1565105083897,
			"files": "[{\"name\":\"28fc8895253929398990c46175c9f8b810eec8e1.png\",\"thumb\":\"917214aab3c9500d7ad0bf60abb9f35fb84ae300-thumb.png\",\"size\":32545,\"type\":\"image/png\",\"original\":\"28fc8895253929398990c46175c9f8b810eec8e1.png\",\"directory\":\"1GFLR8XVXZB2yjCgKqYCpS2i471DAXctck\"}]"
		},
		{
			"id": "e209d806-b17b-49a2-bdb6-030f94449e0f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "088088c9-a098-4133-aa2b-1811b71e04fa",
			"body": ">>088088c9-a098-4133-aa2b-1811b71e04fa\nHere:\nhttps://ggwiki.deepfreeze.it/index.php?title=The_GamerGate_OP\n\nRemember you can edit your post with the [E]. ",
			"time": 1565127905113,
			"files": "[]"
		},
		{
			"id": "916e9016-a3e8-4a5d-a223-f7a6088f6388",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>be0760c9-5aba-461b-ba19-b52bb2e41fc8\nYeah, I think there are too many fundamental flaws with the 08chan platform right now. Not least that we might never get enough numbers to be self-sustaining if people have to install software to visit and there's FUD about CP and all. Maybe we should have a vote on where to reunify 8/v/, we don't have the numbers to afford splitting.",
			"time": 1565137584186,
			"files": "[]"
		},
		{
			"id": "0270d5e7-21d9-46dd-b3af-f0b285710c0a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": "EDIT: Disregard this, I fucked up and muted the board creator instead of blacklisting the entire board. You have to click the board name to the left of the number of posts, not the long string.\n\n>>8a9eae2b-09ae-4450-ba8f-1a88e3f9364d\n>>8ae03b92-ba2c-4dda-9511-a074068f5229\nMillchan used to not delete the files when you muted a board, it only did it for individuals.\n\nWay it used to work:\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1#post-100b0d69-e615-44a3-ac74-c47448e60a01\n\nUpdate when it was changed:\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1#post-e4563630-3caf-4cff-8fa3-7575f3b26a16\n\nList of recently downloaded files on your computer:\nhttp://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Files\n\nWhen I visited and then muted /test/ I got the \"This will delete all files that were downloaded from this board!\" warning, which should indicate our version of Millchan is sufficiently up-to-date. However I was checking some of the files manually on my computer and in the recent files list, and they haven't been deleted from either yet. Is it not working properly?",
			"time": 1565142847837,
			"files": "[]",
			"last_edited": 1565144892972
		},
		{
			"id": "eb31b603-ae6a-484d-97f2-8f408a700661",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>8e1151ff-a221-4ae3-a063-58cdc44bedd2\nIt's not really a matter of technical difficulty, it's that a website is just a website while anything that has to go to these lengths to avoid censorship is weird and scary. We would have enough trouble just convincing 8/v/ posters to come here, I've already seen posts on other bunkers where people are calling it a honeypot or not willing to use something involving Tor or having technical difficulties getting it running.",
			"time": 1565143228030,
			"files": "[]"
		},
		{
			"id": "eda0b08d-9e09-431a-82b1-0dbd32709888",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": "EDIT: This is wrong, you click the board name to the left of the number of posts. The long string just blacklists the board creator.\n\n>>08cc981d-562c-4077-aab3-1f09cd9b5fcc\nClick the string of numbers/letters to the left of the board name.",
			"time": 1565143554524,
			"files": "[]",
			"last_edited": 1565144811216
		},
		{
			"id": "6c789498-1cc3-4302-b761-391edd815558",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>e701759a-7acf-400b-a705-6af5b933f081\nHave you done this stuff?\n\nhttps://zeronet.readthedocs.io/en/latest/faq/#how-to-make-zeronet-work-with-tor-under-linuxmacos",
			"time": 1565143780499,
			"files": "[]"
		},
		{
			"id": "48b28fa6-a9ec-4625-8426-30bbdf586caa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>65ad03de-a668-445b-84d9-58090f3cdb15\nI was told it was the hash, that's a bit confusing. Sorry for spreading misinformation",
			"time": 1565144519640,
			"files": "[]"
		},
		{
			"id": "ef8f6e98-67f3-4077-a4fa-991269772f32",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b24efb34-fa0a-4ca3-a05a-1ab8f16f3b2a",
			"body": ">>48b28fa6-a9ec-4625-8426-30bbdf586caa\nI meant to link this, the post immediately prior to mine:\n>>ff3d95a4-5f50-4de9-b1e1-b3335f401607\n\nWas that because I had the /test/ creator muted so it fucked up post numbers for me until I unmuted him? Are links incompatible if there's even 1 difference in muted users?",
			"time": 1565145261124,
			"files": "[]"
		},
		{
			"id": "85b637a1-fe82-4935-80d1-a129ced11c4c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "74d33156-4e74-468d-afba-8a122ef97c10",
			"body": ">>b8d2543c-2260-482f-9be0-f6e8a57eda98\n==Using [Pin] in the board list will automatically seed anything from that board.==\n\nLike all automatic seeding this risks someone posting CP there, but it's subject to the board-owner blacklist so long as you don't turn the blacklist off, so the board owner can help by blacklisting any illegal content.",
			"time": 1565147921045,
			"files": "[]"
		},
		{
			"id": "e2f9cfc5-7cbd-42cf-a06f-6510f3b60c90",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "4b721eef-4524-4a56-ae86-cd244a505868",
			"body": ">>0ea7b8e6-f240-4904-bd23-a07bfc466c44\n==8/v/ is currently divided between here and vch.moe, for those unaware==\n\nThis bunker was more advertised but posting on the other bunker doesn't require installing software or have FUD about CP. (It does have concerns about Mark seeing your IP, but you can avoid that by using Tor.) Plus some people there have had technical issues accessing 08chan. Right now this bunker is up to 2040 posts and vch.moe is up to 2470, but their posts are almost all concentrated in the GG thread (though it looks smaller because it's currently a cyclical). We should decide on where to reunify, maybe having a vote advertised in both bunkers if necessary.",
			"time": 1565300830948,
			"files": "[]"
		},
		{
			"id": "c8990810-0c10-403c-80b6-24dca7792dc7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": "Testing to see if I can post or if I need a non-self-generated certificate.\n\n>>494e061f-6677-477a-9d49-55bffc20a07b\nhttp://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/",
			"time": 1565353675845,
			"files": "[]"
		},
		{
			"id": "3f62b3aa-f32d-4063-a1e7-98dee1c75a01",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "e0a6634e-bb76-4cb6-9c34-719011e548da",
			"body": ">>c8990810-0c10-403c-80b6-24dca7792dc7\nCan anyone else see this? Was the default one already not self-generated?",
			"time": 1565353741999,
			"files": "[]"
		},
		{
			"id": "1c06dbee-6d22-48ff-80ae-c35adf6577fa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "4b721eef-4524-4a56-ae86-cd244a505868",
			"body": "==Can anyone see this post?==\n\nI'm testing to see if I can post or if I need a non-self-generated certificate.\n\n>>494e061f-6677-477a-9d49-55bffc20a07b\nhttp://127.0.0.1:43110/1iD5ZQJMNXu43w1qLB8sfdHVKppVMduGz/",
			"time": 1565353943237,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}