{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 1,
				"body": "Hola Desde Argentina. Muy interesante ZeroNet. Un cordial saludo.",
				"added": 1607196273
			},
			{
				"comment_id": 2,
				"body": "Buenas: Interesante, importante, bien echo, esa es mi primera impreción de ZeroNet",
				"added": 1607277759
			},
			{
				"comment_id": 3,
				"body": "> [mwesecar](#comment_1_128UcsL6WXxsG1TbMksHqCxLC9hsymBv1F): que es esto?\n\nEs un chat multi usuario, que se organiza por temas (hilos)",
				"added": 1607277839
			},
			{
				"comment_id": 4,
				"body": "> [t73110](#comment_2_1NzxhTsZ1mbLsDF5ncBas2NkpaLys5nS1X): Hola buenas tardes\n\nBuenas tardes !!",
				"added": 1607277865
			},
			{
				"comment_id": 5,
				"body": "> [carloscesar](#comment_2_1ALWm44f5mZUS2HmATz81Pk4dp3gHRaiqt): Un saludo a tosa la comunidad\n\nTómese un jarabe !!",
				"added": 1607563177
			}
		],
		"10_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi": [
			{
				"comment_id": 6,
				"body": "Esto es la paradoja de la tolerancia o de la intolerancia ?",
				"added": 1607825180
			}
		],
		"1_15eTuvZsi1KYGhCNC9ye8zgZMXNBZ1Na42": [
			{
				"comment_id": 7,
				"body": "Hola buenas noches. La Deep Web es un lugar que se genero solo, en realidad hay una sola web, una parte esta organizada en los buscadores mas importantes como Google que indexan sitios y los guardan en sus servidores para que nosotros los encontremos  sin necesidad de conocer la dirección exacta, pero los buscadores tienen una capacidad limitada de indexacion, volviendo a Google tiene mas o menos el 30% de la red, pero eso no quiere decir que el resto este organizado en otro lugar. Si creo una pagina web y evito que Google me indexe, nadie me va a encontrar salvo que conozca exactamente la dirección, pero eso no quiere decir que mi pagina este en un lugar raro o de una filosofía extraña, etc, etc",
				"added": 1607825925
			}
		],
		"1_1PD6ADNcGcQkAvVL9dcZVUTMwWSLmDFGmc": [
			{
				"comment_id": 8,
				"body": "Muy interesante Manjaro y también Solus, por distintas razones. Solus es la distro de donde nació Budgie, con eso les digo todo.",
				"added": 1607997710
			},
			{
				"comment_id": 9,
				"body": "> [tux2020](#comment_2_1PD6ADNcGcQkAvVL9dcZVUTMwWSLmDFGmc): ¿Qué distribución de Linux usan?\n\nDe escritorio Ubuntu, pero en mi notebook habitualmente instalo como laboratorio distintas distribuciones, me gusta mucho Manjaro y me gusta mucho Solus.",
				"added": 1607997797
			}
		],
		"2_1MtnAW7x2y3YJjRxubqBkP47UVGpjScdtG": [
			{
				"comment_id": 10,
				"body": "Hola, gracias por preguntar. me parece un concepto muy bueno, esta muy bien programado y su estructura es impecable, no termino de entender algunas cosas, y creo que al autor se le paso el entusiasmo, porque claramente necesita un escritorio o linea de tiempo propia donde chekear lo que uno hace, por ejemplo. Pero no son criticas, realmente me fascina.",
				"added": 1607998000
			}
		]
	},
	"comment_vote": {}
}