{
	"title": "Richi's Blog",
	"description": "paragliding, software, bitcoin…",
	"links": "- [ZeroMe](/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ/ulrichard@zeroid.bit)\n- [my gallery](/1EHrpXd3f6CyKooBFtpLhdFk5C3bqFhyg1)\n- [Paragliding tandem flights](http://paraeasy.ch)\n- [My blog on the internet](https://ulrichard.ch/blog)\n- [South America 2007](/1MrcCZjfRCKeJZAENsjDqf7dvDhEhFpsXY)\n- [Why I prefer Bitcoin](/13UYenBm13vidxEA9DxKMSA3CJacWdkpke)\n-[Why I prefer Linux](/1Aiq4P8bh1f9pPxQz9MA2Z1cDkYaUGjEPn/)\n-[Tesla for Bitcoin](/1P9yJty4fzXkuGV3BSM4VSADr7xap2riAa/)\n-[Bought with Bitcoin](/17JvYecccPVS8nzngiUKwJQe8LX5jrjNwo/)\n-[my Openbazaar store](https://bazaarbay.org/QmTTfM7eydF1bMP6WJsaN5tCJxqHNFnspt4bgPhhihZLvC/store)",
	"next_post_id": 57,
	"demo": false,
	"modified": 1602268204,
	"post": [
		{
			"post_id": 56,
			"title": "Why was second factor authentication watered down?",
			"date_published": 1602262923.193,
			"body": "As far as I can remember, two factor authentication was used since the first time I used online banking with [BBS](https://en.wikipedia.org/wiki/Bulletin_board_system) like text interface over a 14.4bps modem. Back in the day the second factor was a printed list with numbered codes.\nThe idea of using different factors is to prevent hackers form accessing your bank account in case they can sniff your password with a trojan keylogger on your system. The factors are generally divided into things you know, things you have and things you are. In general it is assumed that everything typed or stored on a multi purpose computing system can be extracted by an attacker.\n<h2>Things you know (memorized):</h2>\n* username\n* password\n\nThe fist category is pretty much self explanatory. It is the typical password. Before we hat hundreds o accounts, we were able to memorize our passwords. Single factor authentication with only a password is not only problematic because attackers can eavesdrop what we type, but also because computers are increasingly fast at trying.\n\n<h2>Things you are:</h2>\n* biometrics\n\nIn theory biometrics would be the perfect method for authentication. Unfortunately the technical implementations have many weak points. There are countless stories of fooling fingerprint readers with sticky tape or jelly sweets. But even when you couldn't fool the device itself, as long as the sensors are run on top of a general purpose computing device, the data can be stolen or manipulated. Once the biometric data are stolen, you can't change a fingerprint or an iris as easily as you can change a password. \n\n<h2>Things you have (possess):</h2>\n* printed list with codes\n* dedicated device for displaying codes\n* phone for receiving text messages\n* phone for running an app to display codes\n\nThis one is also simple at first sight. But lets dissect them a bit closer. For a printed list with codes it is not enough to install a trojan on your system. It generally requires physical access to make a copy of it. But as soon as you scan it and save a copy on your computer to make login more convenient for you, it also become more convenient for an attacker to steal. And there are still banks who send a pdf with the 2FA codes electronically. As a general rule of thumb: once a secret is stored on a general purpose computer its security is weakened considerably. Thus it is not only important how secret information is stored, but equally important how it was generated and how it was transported.\nIt may not be equally easy to compromise text messages with every cell operator, but it happened too may times and made this method become abandoned. As described above, information stored on connected general purpose computing devices can be extracted. This is an important fact to consider when using authentication apps such as authy or Google authenticator. These apps are based on [TOTP](https://en.wikipedia.org/wiki/Time-based_One-time_Password_algorithm), but the important difference to TOTP hardware devices is how the secret is stored and protected.\nThat leaves us with dedicated hardware devices. These come in many forms. Some banks have used little TOTP devices for decades. There are devices that operate in conjunction with your plastic debit card, some that scan mosaic codes. What they all have in common is that they display a code that you enter on the logon screen. \nAnd then there is [FIDO U2FA](https://de.wikipedia.org/wiki/U2F). It is a standard that was established in 2014, but didn't gain the traction yet that it would deserve. The FIDO devices store a seed in protected memory, and generate a sub key for every site you want to visit securely, some even display the site you are about to login. This in fact also protects against phishing sites. Meanwhile most Bitcoin hardware wallets can act as FIDO U2FA devices. But the most widely known and used dedicated 2FA device is surely the [YubiKey](https://www.yubico.com/) which comes in a great form factor.\n\n<h2>I propose a new categorization of factors:</h2>\n* things that a trojan can steal from your computer or smartphone\n* things that a thieve can copy when breaking into your apartment\n* things that you would notice immediately when stolen from your keyring\nWith this categorization, you realize that most snake oil app based 2FA belong into the first category. Banking trojans that consist of a part for the computer and a part for the smartphone were around even before those 2FA apps became popular. \n\n<h2>But I don't want to carry around a device</h2>\nSecurity is often a hit in convenience. For me it was always clear that I want to protct every account I can with the security offered by a dedicated device. But apparently there are enough people who don't care about security, or simply don't understand the tradeoffs. When I discovered that the Tesla account was only secured by a password, I was so shocked that I disabled remote access in the car. That was almost three years ago. In the forum discussions there were people arguing against carrying around a security device weighting a few grams. And indeed when Tesla introduced 2FA last week, they use soley TOTP. Whenever I have to use TOTP, I use it with my Yubikey. But still that procedure has one important weakness. When setting it up, the secret is displayed and/or entered on a general purpose computing device that must be connected to the internet. When this device is compromised, the whole 2FA is moot. Hence I will leave my car disconnected for the time being.\nSince I have learnt about secure 2FA devices, I want to have all my accounts secured. Hence I switched my main bank account to a bank that supports hardware based 2FA a couple of years ago. Now at my new employer which also happens to be a bank, we use 2FA to logon to some systems. The default is a proprietary app that is only available for iOS and Android. My phone runs PureOS for security reasons. From the internal network, we can use TOTP and even FIDO, but when logging in from home, only the less secure method with the proprietary app is allowed. I will never understand the reason behind that. I can still work from home. I can access the git repos, but I can't login to Jira nor Webex nor the time reporting. Since I work for a bank now, I have an account with my employer, that has very favorable conditions. But again the 2FA is only possible with a proprietary app that is only available for iOS and Android. This is a real pity. Even if that app was available for any of my phones, I would not deposit a lot, because of the weak security."
		},
		{
			"post_id": 55,
			"title": "Why I am sending back my Librem5",
			"date_published": 1593458821,
			"body": "After paying 0.163 BTC for a pre-order, I patiently waited two and a half years for the Librem 5 to finally arrive. Now after half a year with the phone, I finally lost patience. For some more context, please read my former blog posts [The Librem 5 phone is still at an early stage](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:45:The+Librem+5+phone+is+still+at+an+early+stage) and [One month with the Librem5](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:49:One+month+with+the+Librem5).\n<h3>A computer that looks like a phone<h3>\nWhen the phone arrived it could do computer things, but no basic phone tasks. So it was more like a small tablet. Phone calls didn't work at all for the first month. And text messages started working after about a week, but only with weird workarounds.\n<h3>An expensive hand warmer</h3>\nWhen the phone arrived, there was no power management implemented, meaning it constantly ran at full speed. No wonder was the device always warm and the battery was flat after an hour on average. It didn't make a difference whether I used it or not. After about one or two weeks of having the device I charged it over the night while it was switched on. When I grabbed it in the morning, it was so hot that I could not hold it in my hands. The plastic part between the cellular and the wifi cards started melting together with the back cover.\n<h3>Hot freezes</h3>\nOne common occurrence was from early on that it it would no longer react to any inputs after a while, but still burn the battery down at the same speed. It also at the same moment stopped responding from SSH connections, so it was not just the display.\nWhen the issue started, I had a freeze about every second day, then every day, then twice a day. For a while it never ran for more than 15 minutes without freezing. Since about the time I had the phone for a month, it rarely runs for more than five minutes before freezing.\nThe freezing is the issue that rendered the phone completely useless for me. It triggered me to move the SIM card back to my five years old UBPorts phone. For the next few months I switched the phone on about once a week to install the latest software upgrades. Every time I hoped the freezing issue would be solved. From the responses on the forum, it appeared like my device was the only one experiencing these difficulties, but still it appeared like they were working on resolving the issue through software updates. \n<h3>Bricked for the first time</h3>\nInstead of fixing the freezing, an upgrade around Easter made the phone not boot any more. It started to boot, but was stuck at the terminal that is usually only visible for a second. Apparently it was a known issue, but the remedy that was provided, didn't work on my phone. So I was advised to re-flash it. But the flashing procedure also didn't work. After a while and some experimentation, I found out that out of a computer and two notebooks, only my XPS13 was able to flash the phone. I am still puzzled why it didn't work with the Librem13 especially. But to my disappointment, the freezing issue persisted.\n<h3>Dead battery</h3>\nI kept installing the upgrades on a weekly basis. In between I usually removed the battery. When I tested the voltage, it was always between 3.6 and 4 Volts. Then one day I left it plugged in with the original charger for about a week or two. Since then It wouldn't boot any more. Not only did it stop booting in the middle of the process like before. This time there was no sign of life whatsoever.  When I tested the battery, now it read 0 Volts no matter how many times I tried to charge it. I tried with the original charger as well as with others. I read somewhere that the L5 has an issue with the charging, in that it starts discharging after the battery is full. After that it apparently doesn't start charging again until it is re-plugged. But I didn't expect this to result in a battery that appears to be totally dead. Even if I wanted to charge it with an universal LiPo charger, I wouldn't even know which way to connect it. The phone doesn't run with a dead battery, and it also doesn't boot without a battery.\n<h3>Sending it back</h3>\nThe only thing left for me left to do is sending it back. I didn't sign up for a museum piece. I just want a phone that works. It is up to Purism now if they can repair my phone, send me one from the current batch, or one from the mass production batch later on. After being through all this, I would prefer to wait for the batch that is hopefully more reliable. But I will take whatever Purism sends me.\n<h3>Friends asking</h3>\nI am often asked about this open source phone that I told everyone when waiting for it. I would love to tell them how great it was, and convince them to order theirs as well. I still think it is very important to have a phone that you can trust. But unfortunately I have to tell them what a disaster it was so far. I tell them that it appears that I got an exceptionally bad sample, and that most others are probably fine, or at least usable.\n"
		},
		{
			"post_id": 54,
			"title": "A decade of blogging",
			"date_published": 1590689200.562,
			"body": "Yesterday it was exactly ten years ago, when I published [the first post](https://ulrichard.ch/blog/index.php/2010/05/27/handheld-24ghz-spectrum-analyzer/) on my [personal blog](https://ulrichard.ch/blog). Before that, I kind of blogged on the old, old version of [ParaEasy](http://paraeasy.ch) about flying adventures. For our adventure in South America, we wrote our diary on a manually edited [html page](/1MrcCZjfRCKeJZAENsjDqf7dvDhEhFpsXY/).\nOn my personal blog, I still write about paragliding, but also about Bitcoin, Tesla, electronics projects, software development, work and holidays. Whatever I deem interesting enough to write about and preserve for a couple of years. Over these years, I published 193 posts, and left 6 drafts unfinished. My first post a decade ago was about a [handheld spectrum analyzer for the 2.4 GHz ISM band](https://ulrichard.ch/blog/index.php/2010/05/27/handheld-24ghz-spectrum-analyzer/). That device is still running every day on my desk at work. The display lost a line or two at the bottom, but that doesn't hurt the functionality much. And only recently I used part of the code again for another project.\nThe post that is probably read the most, judging by the number of comments, is about [resetting my favorite Logitech keyboard](https://ulrichard.ch/blog/index.php/2016/12/09/resetting-the-logitech-k810-bluetooth-keyboard/). It helped countless people who had the same problem with their keyboards.\nI don't track visitors on principle. So I don't know how many people visit the page and what articles they read. One time a company approached me with an offer to put advertisements on my blog. But it was very vague, and since I assumed that they would want to track my visitors, I didn't answer. The blog is not for making money, and I don't think my posts are interesting enough for lots of people that it would be worth wile for advertising anyway.\nThe page ran on [Wordpress](https://wordpress.org) from the start and it still is. For the first couple of years it was hosted on an [Alix](https://pcengines.ch/alix.htm) and for the last couple of years it has been on a [NUC](https://www.intel.de/content/www/de/de/products/boards-kits/nuc.html). There was also another computer in between that I can't quite remember the specs. They all ran Debian or Ubuntu and served the pages with Apache.\nFor the last four years I have mirrored the new posts also on [my blog](http://127.0.0.1:43110/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/) on [ZeroNet](https://zeronet.io)."
		},
		{
			"post_id": 53,
			"title": "Our temporary tree house",
			"date_published": 1586626078,
			"body": "I have been fascinated by tree houses for as long as I can remember. I don't know if everybody is fascinated as much, and I don't remember how it started. It might have been Peter Pan or the Evok bear folks in the Star Wars movie. In my teenage years, I built a simple tree house together with my brothers. I grew up in a single family house surrounded by meadows. The forest started only a two minute walk from our house. So we had good pre-conditions for such an endeavor. Our kids share the same fascination. They looked through our book with the most beautiful tree houses many times and dreamed with us. My absolute favorite is the [Heidi tree house chalet](http://treehousechalet.com/). Many times our kids told us that they wanted to build a tree house. Not just the perfect thing some time in a possible future. But a real one now. I always told them that it is not as simple as they might think. And that we can't build a semi permanent structure in the public forest. So they started asking my uncle who owns a strip of forest. But that is also not so practicable to drive with the car for 20 minutes every time they want to build up. \nI read about [Tentsile](https://www.tentsile.com/) tree tents a couple of years ago. They are awesome and cool, but a bit expensive for a tent, or a hammock. I was on the lookout for a while to rent one, or to catch a cheap one in a sale. They change prices from time to time, but they are still not cheap. But this spring I decided to buy one if the price would go down enough. For one, it is still a lot cheaper than a semi decent tree house. And if I wait for too long, the kids might not be as excited any more. Since it is listed on Galaxus, I could pay for it with Bitcoin. Due to the Corona situation, it took almost a month for it to arrive. When the post man brought the packet, the kids came running totally excited. They knew exactly what was in that cardboard box. \nOf course I would also like to create a multi level stack. But I told the boys, I won't buy more of the stuff. If it is important enough for them, they can wish the extension for Christmas or birthdays. \nToday was finally the day we put it up for the first time. The nights are still too cold, so we will sleep in our fabric tree house another time. To spend more time in the forest, we brought some expedition meals that we boiled with the gas stove. The nap after lunch we spent in the tree tent hammock. It is really comfortable as long as the weight is distributed evenly. But if everybody sits in the same corner of the tent, it tilts quite a bit. The three person tent is big enough to host two adults and our two kids. The underfloor storage departments are very practical. Now we all look forward for the nights to become warm enough to sleep outside. The kids an me could probably do it already, but my wive is very temperature sensitive.\nAnd for those who wonder about the corona lockdown restrictions, the place where we suspended the tent is less than a kilometer from our home. And every time we cross somebody on the trail, we go to the side to maintain the two meters distance.\n\n<a href=\"https://ipfs.io/ipfs/QmQ8NHkt21czzivTMneb2YiUCezYAdKeV31UV5PBZDYm47\"><img src=\"img/G0029628.JPG\"/> </a>\n<a href=\"https://ipfs.io/ipfs/QmbF2NJdv1SNbt7nb9faYuxyC2UnBLVJqu9u8TXxonAMAn\"><img src=\"img/G0069648.JPG\"/> </a>"
		},
		{
			"post_id": 52,
			"title": "Working from home during the Corona shutdown",
			"date_published": 1584826362.423,
			"body": "Like many people these days I currently work from home. Due to the corona pandemic, everything that is not essential is closed in Switzerland. Since I work in software development it is possible to work at home, and most if not all people in my team do so. What is great about the new situation is that I can now eat lunch with my family. We also try to go for a short walk to the lake or the forest after lunch. But there are a couple of factors that make working at home challenging:\n*  The factor that I anticipated to be the worst is distraction. Normally when I try to work on something at home that needs concentration, it takes on average five minutes before somebody comes and wants something from me. And then again after another five minutes, and again and again. This is why I can usually only work at home, when everybody else is asleep. All the more astonished am I, that they leave me do my work now that it's for my employer and not a hobby project of mine. A very important contribution is from my [noise cancelling headphones](https://www.bang-olufsen.com/de/kopfhoerer/beoplay-h9). Without them this would not be possible. \n* The office at home is the size of a broom closet. It is 1.4 by 2.2 meters with no window or direct daylight. Thus it is important to go out to the patio from time to time to get some fresh air and some rays of sun light.\n* I have a very comfortable chair in my home office, and a nice solid table. But I grew so used to the table I have at work that I can raise to a standing position whenever I want. Even if I wanted to buy such a table, I couldn't fit it in my small office at home. So I have to take care to move my body enough, not to develop back pain. Especially now that I can't go swimming in the communal pool. I just hope the lock-down won't get so bad that I can't go running any more.\n* My screens are roughly 20 years old, and the low resolution makes it a bit challenging to work effectively. I wanted to order a new screen for years, but always postponed the purchase. Now that I knew that I would work from home, I figured it is the time to go ahead. Even though I ordered it very soon, delivery took more than a week, as the online shops and delivery companies are totally overwhelmed at the moment.\n* And then, there is the elephant in the room. Let me begin by a quote I recently read on the website of the [Session messenger](https://getsession.org/download/): \"Friends don’t let friends use compromised messengers\". This statement really resonated with me. At the opposite end of the spectrum, there is a communication software that is closed source, has a proprietary protocol, centralized infrastructure, no end-to-end encryption, constant access to the internet, the microphone, the webcam, the keyboard and the screen. On top of that it also has the capability to take over control of the computer. [Back Orifice](https://en.wikipedia.org/wiki/Back_Orifice) pales in comparison with these capabilities. That it is tedious to use and only fully works about half of the time is only the lesser evil. It was developed by a company with a long track record of deception and abuses. This software is called [Microsoft Teams](https://medium.com/@joshuamkite/the-horror-of-microsoft-teams-c18360712361), and it was recently declared as the primary means of communication in our company. In the past, I flat out refused to use it. But in the current environment of emergency, I felt that I could not complicate things. Seemingly nobody else had any reservations against inviting the [panopticon](https://www.theguardian.com/technology/2015/jul/23/panopticon-digital-surveillance-jeremy-bentham) into their homes. When a co-worker told me that it could be used from within the browser, I was slightly relieved. As long as it is contained in the browser sandbox, the amount of harm it can do is somewhat limited. With the browser you have some control over what access you grant it. Unfortunately in the browser only the chat feature worked, but no audio or video calls. So my team lead asked me to install the desktop client. Installing malware directly on the machine was a no go for me, so I installed it quarantined inside an empty virtual machine. This now works for audio conferences. But I feel uneasy, uncomfortable even stressed, whenever it is running. Often I block access to the microphone or the network to the VM, but that brings only light improvement. So, when somebody writes on slack, I enable Teams, but I can't have it running with full access all the time, I just can't. I am reachable through slack, email, phone, text messages, matrix, tox, session, even telegram and soon Juggernaut. They all have an open source client that I can trust. I just need a quick note, to start Teams on request. Isn't it ironic that with the struggle to care about physical hygiene, nobody seems to think about digital hygiene.\n\nI often think about why I care more about digital security and privacy than average people. So many people carelessly ignore the security of their devices, it is almost reckless. I don't think I have more to hide than other people. For a long time I have cared about [FLOSS](https://en.wikipedia.org/wiki/Free_and_open-source_software) . It is not only that I dislike artificial barriers and vendor-lock-ins. It is also the trust gained through being able to inspect the software. But the biggest impact came, when I started to be involved with Bitcoin. This is when I really learned about the value of information, and how to protect it. There were times when I had more wealth sitting on my computer than on my bank account. Who wouldn't think about how to protect it from the grabs of thieves. With Bitcoin, you are responsible for the private keys. When you fail to protect them, your wealth is gone. There is no bank you can beg to reverse the transaction. But on the plus side, If you protect your data well, nobody can steal it from you. If your bank goes bust, your Bitcoins are still save. Many people don't want that responsibility, and prefer somebody else to handle it for them. I can see the same behavior with [cloud computing](https://fsfe.org/contribute/spreadtheword.en.html#nocloud). Bitcoin people are very passionate about [OpSec](https://en.wikipedia.org/wiki/Operations_security). I am talking about the original cypherpunk people here, not the \"get rich quick\" crowd that showed up later on. There is a mantra in the Bitcoin world: \"don't trust, verify\". Everything that can't be verified, such as closed source software, has to be considered as compromised.\n\nOk, enough of going on a tangent.  This post is about working from home. My wive calculated the first day, that I should now be able to finish at least an hour earlier, because there is no more commute. Sounds reasonable, right? My usual day now looks like this: I get up at the same time as usual and take a shower. I dress the same way and groom the beard the same way as I would, if I went outside. Instead of having breakfast alone and driving to work, I start working. When everybody is ready, we have breakfast together. After that I work again until lunch is ready. When I have to go to the toilet, I also grab a fresh tea and go outside for a minute to get some fresh air and some sun. The lunch break is longer than at the office. The kids eat very slowly, and we have a rule at home that we all wait at the table for everybody to finish. Then we usually go for a walk to the forest and/or the lake. We are very fortunate that both are only about two hundred meters away. Because the lunch break is longer, I often work as long in the afternoon as I usually are in the office, or even till the time I would otherwise arrive at home.\n\nWe also currently spend the weekends mostly at home. So I took the chance, to tidy up and clean my small office at home.\n\nInteresting reading about privacy in the current state of emergency:\n* [Open vs Certified](https://jimmysong.substack.com/p/open-hardware-for-bitcoin-bitcoin)\n* [Datenwut: Chaos Computer Club vergleicht Microsoft Office mit Spyware](https://winfuture.de/news,103378.html)\n* [Microsoft faces Dutch crunch over Windows 10 private data slurp](https://www.theregister.co.uk/2017/10/14/microsoft_faces_dutch_crunch_over_windows_10_data_slurp)\n* [A GIF Image Could Have Let Hackers Hijack Microsoft Teams at Your Firm](https://businessinsights.bitdefender.com/a-gif-image-could-have-let-hackers-hijack-microsoft-teams-at-your-firm)\n* [The world after coronavirus](https://ipfs.io/ipfs/QmQ5tykpPB2nCQAvrYFnFVQuXSuBuSdhLGtfT6nQd3Cr4H)\n* [What You Should Know About Online Tools During the COVID-19 Crisis](https://www.eff.org/deeplinks/2020/03/what-you-should-know-about-online-tools-during-covid-19-crisis)\n* [Überwacht: Sieben Milliarden im Visier](https://www.arte.tv/de/videos/083310-000-A/ueberwacht-sieben-milliarden-im-visier/)\n* [To Track Coronavirus, Israel Moves to Tap Secret Trove of Cellphone Data](https://www.nytimes.com/2020/03/16/world/middleeast/israel-coronavirus-cellphone-tracking.html)\n* [Protecting Civil Liberties During a Public Health Crisis](https://www.eff.org/deeplinks/2020/03/protecting-civil-liberties-during-public-health-crisis)\n* [Privacy Advocates Are Sounding Alarms Over Coronavirus Surveillance](https://www.coindesk.com/privacy-advocates-are-sounding-alarms-over-coronavirus-surveillance)\n* [Data – the new oil, or potential for a toxic oil spill?](https://craphound.com/podcast/2020/03/23/data-the-new-oil-or-potential-for-a-toxic-oil-spill/)\n* [Purisms Essential List of Free Software for Remote Work](https://puri.sm/posts/our-essential-list-of-free-software-for-remote-work/)\n* [11 countries are now using people's phones to track the coronavirus pandemic, and it heralds a massive increase in surveillance](https://www.businessinsider.com/countries-tracking-citizens-phones-coronavirus-2020-3?op=1&r=US&IR=T)\n* [Bosses Panic-Buy Spy Software to Keep Tabs on Remote Workers](https://www.bloomberg.com/news/features/2020-03-27/bosses-panic-buy-spy-software-to-keep-tabs-on-remote-workers)\n* [Microsofts Software ist Schadsoftware](https://www.gnu.org/proprietary/malware-microsoft.html)\n* [Zoom needs to clean up its privacy act](https://blogs.harvard.edu/doc/2020/03/27/zoom/)\n* [Researchers Say Microsoft Edge’s Telemetry Has the Worst Privacy of Any Major Browser](https://winbuzzer.com/2020/03/17/researchers-say-microsoft-edges-telemetry-has-the-worst-privacy-of-any-major-browser-xcxwbn)\n* [Does your video call have End-to-End Encryption? Probably not..](https://webrtchacks.com/you-dont-have-end-to-end-encryption-e2ee/)\n* [This is what end-to-end encryption should look like!](https://jitsi.org/news/e2ee)\n* [Zoom’s Security Woes Were No Secret to Business Partners Like Dropbox](https://www.nytimes.com/2020/04/20/technology/zoom-security-dropbox-hackers.html)\n* [Die freundliche Spionin](https://netzpolitik.org/2020/siri-die-freundliche-spionin-apple/)\n* [We’re losing the war against surveillance capitalism because we let Big Tech frame the debate](https://www.salon.com/2020/06/20/were-losing-the-war-against-surveillance-capitalism-because-we-let-big-tech-frame-the-debate)\n* [Datenschutz-Aufsichtsbehörde: Teams und Zoom lassen sich nicht DSGVO-konform nutzen](https://www.computerbase.de/2020-07/teams-zoom-nicht-dsgvo-konform-datenschutz-bfdi/)\n\nLast but not least, some conspiracy theory:\n* [Bill Gates, The Caricature of a Villain](https://coronacircus.com/2020/04/12/bill-gates-the-caricature-of-a-villain/)\n\n<a href=\"https://ipfs.io/ipfs/QmNb2vW87sTFTzxQLkxLnTLCTsXTo51HCQgNE2gJc74TNp\"><img src=\"img/HomeOffice.jpg\"/></a>\n\n"
		},
		{
			"post_id": 50,
			"title": "Could somebody please compete with Tesla",
			"date_published": 1579202352,
			"body": "I am a Tesla fan boy. The first stock I ever bought was TSLA. And it is still my second biggest position after Bitcoin. So, of course I am delighted by the recent rally. But speculation was never the primary motivation. I only buy stocks or cryptos, if I see a sustainable benefit to our society at large. I have an important investment disadvantage in that I only invest in companies that behave ethically. This excludes most of the highly profitable big tech stocks, such as: Apple, Alphabet, Amazon, Microsoft and Disney. My investments are long term. The [TSLA market cap](https://docs.google.com/spreadsheets/d/1HflVng6sYIb6Gs4pOKiDGtqU5YJ2-hgdM4pRNaT62gs/edit#gid=1052727546) raced past Daimler just two months ago, and is now only 8.5% below Volkswagen. Essentially, it doubled in the past half year. Should it continue with this pace, it [could become the worlds most valuable car maker](https://www.handelsblatt.com/meinung/gastbeitraege/gastbeitrag-von-frank-thelen-tesla-wird-marktkapitalisierung-verdoppeln-vw-und-bmw-werden-bedeutungslos/25462604.html) before the year ends. There are analysts who predict even much higher figures. After all, [Tesla's financial charts show numbers close to exponential](https://www.tesmanian.com/blogs/tesmanian-blog/teslas-financial-charts-show-numbers-close-to-exponential).\nIn the past, Tesla was not perceived as a threat by the old guard of car makers. At least they wouldn't publicly admit. Some still to this day act as if they could continue selling their pollution machines for the foreseeable future. These days, [the tone has changed](http://www.autonews.ch/?p=25441). Tesla is the benchmark for electric cars, and electric cars are the future.\nEver since I drove a Model S for the first time, I knew that this is the future. It is not just that driving electric is so much nicer, it is also the rest of the experience. Tesla owners are not surprised that their manufacturer leads the brand loyalty statistics. Over the years many Tesla killers were announced. All of them fell short. They have a hard time to even compete with the cars that Tesla released seven years ago. The Porsche Taycan was the first who can compete in terms of performance, but it is the least efficient electric car on the market. Meanwhile the Tesla model 3 is the most efficient car on the market. The Audi comes close in terms of charging speed, but is almost as inefficient as the Porsche. The Hyundai comes close in terms of efficiency, but lacks in everything else. There are so many unique features where Tesla is ahead of the pack: Supercharger network, over the air updates, really good software in the car, self driving, consistently rated as best in class safety. They are pushing the bar in so many directions. \nIn the foreseeable future, I wouldn't even consider another car make. All these developments are great, and it seems as if the gap would even increase. But this trajectory leads to a future that slowly starts to concern me. Monopolies are never good. There are countless examples of companies who acted benign while growing up, but turned into bullies once they were big enough to get away with it. Cory Doctorow calls it \"every pirate wants to become an admiral\" in his book [Information doesn't want to be free](https://www.goodreads.com/book/show/20763766-information-doesn-t-want-to-be-free). I never met Elon, but I think he is a good guy. Nevertheless every company can rotate personal and change direction. And Tesla customers are reliant on the company more than is usual. So far they never exploited their position, but who could assure that it never happens in the future. On my last service visit they informed me that in the future they would only accept payments by credit cards. My last credit card expired five years ago, and I have no intentions to go back into the dark ages of pull payments. Also for supercharger usage, you only have three options: Either deposit credit card information in your Tesla account, having some free credit from referrals or the like, or having a car with unlimited lifetime free supercharging. Luckily I have the last option. Using credit cards and leaving its information everywhere can lead to unpleasant experiences like [unintentionally buying upgrades](https://ww.electrek.co/2020/01/15/tesla-owners-unintentially-buying-software-upgrades-musk/#). I am sure they will make it right this time, but maybe they could get away with something like this in the future. As long as there is competition, companies have an incentive to keep customers happy. But if your product is so much better than everything else, that incentive goes away, and bad behavior is becoming the norm. So far, there is still some competition from polluting cars, but this will diminish in the coming decade. I am not even sure if it can be considered competition. Everybody (with very few exceptions) who ever drove an electric car never wants to go back. I read from people who say they were treated by Tesla employees as if they needed to be grateful for the privilege to get such a great product. So far all interactions I had with Tesla were really pleasant, but there are many reports that leave you wondering.\nSo please, traditional car markers as well as startups: Don't let that 17 year young Californian electric car company push you out of the market. But please don't try to hinder them with cheating and throwing rocks like in the past. Better start making products that can compete with Tesla on many levels. Competition is healthy, and having choice is good.\n<img src=\"img/LeafTesla.jpg\">"
		},
		{
			"post_id": 49,
			"title": "One month with the Librem5",
			"date_published": 1577885858.662,
			"body": "About a month ago I received the phone, that I eagerly awaited for two years. But the experience was not quite how I anticipated. I wrote the [first review](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:45:The+Librem+5+phone+is+still+at+an+early+stage) after having the phone for a few days. And this one extends upon the early impressions. Thus I will go through the same bullet points and extend upon the first review. I  encourage you to read it first to have the full context.\n<h4>Wifi and bluetooth</h4>\nWifi reception in the office dramatically improved after about two weeks. At first I attributed it to a software update for the phone, but then I discovered a new access point in the meeting room. I expect that I will have to live with sub standard wifi reception, stemming from an antenna design that will be improved in later iterations. But so far this didn't pose a problem other than initially at the office.\nAfter reading a [blog post from purism about software updates](https://puri.sm/posts/librem-5-november-2019-software-update/), I tested the bluetooth connectivity in the car again. A soon as I switched on the phone while sitting in the car, the music stopped, and the dash of the car indicated an active call. So there was clearly an audio connection established between the phone and the car. But trying to terminate the phantom call with the controls at the steering wheel didn't result in any change. Initiating a call from the car controls didn't work. When my wive called my phone, there was no indication of an incoming call, neither visually nor auditory, neither on the phone nor on the car. I was able to initiate a call from the phone, but the audio didn't come from the car speakers and also the car microphone didn't transmit to the phone on the other side. It is good to see progress in this important area, but at this stage it is not usable.\nI didn't test mobile data yet. I am not convinced that the rest of the functionality of the phone would warrant buying a mobile data package that I would then not be able to use.\n<h4>Text messages</h4>\nThe important update for this part came about a week after I got the phone. Usually when I start the messaging app, it comes up blank the first time. I close it through the main GUI, and the second time it works. So far it is the component of the phone that works the most reliable.\n<h4>Phone</h4>\nThe comment I found about killing the cally app to get rid of the message about a missing audio capable modem was almost right. But cally was renamed to calls. At the current state I have to issue \"killall calls\" only once to get past that error. Shortly before Christmas I received an update that enabled basic phone functionality. I am now able to initiate calls, and we both hear each other. At the moment I don't get any indication of incoming calls. A couple of updates ago, I saw incoming calls, and could accept them. But back then, audio didn't work.\nAgain, it is good to see progress in this important area, but it is not really usable yet.\nI wanted to disable the SIM PIN, that I have to enter every time I boot the phone. But so far I couldn't figure out how.\nUpdate Jan 4th: Today was the first time I heard the phone ringing. I picked up and we had a short conversation. Great, finally.\n<h4>Browser</h4>\nNo big changes here.\n<h4>Settings</h4>\nNo big changes here.\n<h4>Terminal</h4>\nNo big changes here.\n<h4>Clock</h4>\nNo big changes here.\n<h4>Battery life</h4>\nSubjectively I think it is now less hot when the screen is turned off, and more hot if it actually performs something.\nBut the problem with the hot freezes got progressively worse. The first time the phone froze was about five minutes after I switched it on for the first time. Then I had a freeze about every second day, then every day, then twice a day. For a while it never ran for more than 15 minutes without freezing. Now it rarely runs for more than five minutes before freezing. There is an exception about once a week, when it runs for half an hour before freezing. When I reboot directly after a freeze, It hardly runs for two minutes before freezing again. This leads me to believe that it is a thermal issue. I am wondering if there is something I can do to improve the situation, such as installing an additional heat sink.\nAfter having the phone for something more than a week, I left it turned on while charging over the night. When I grabbed it in the morning, it was so hot that I could not hold it in my hand. The plastic part between the cellular and the wifi cards started melting. It was again in the (hot) frozen state. After I rebooted it,\nit briefly displayed the time around midnight. This leads me to believe that it was frozen for half the night and still heated up so badly. After this incident I only charge it attended or switched off.\nUpdate Jan 4th: The last two days it ran for almost an hour before freezing once each day. Sometimes it can be little things that cheer me up.\n<h4>Apps</h4>\nI still didn't install many apps. I found some lists in the meantime with [apps specific to the Librem5](https://source.puri.sm/Librem5/community-wiki/wikis/List-of-Apps-in-Development) and [Mobile GNU/Linux Apps](https://mglapps.frama.io/), which should help in identifying suitable applications to install.\nI installed evolution to synchronize contacts and calendars. Restoring a backup from my notebook worked by rotating the screen back and forth to find my way through the dialogs. Only when actually synchronizing, I reached a dialog for accepting TLS certificates, where I could not bring the button I need into the screen space.\nBut Evolution allowed me to import a file with all my contacts. Now they also show up in the phones built in contacts app. This is good enough for the moment.\n<h4>Conclusion</h4>\nThe frequent freezing is the most serious annoyance that I currently have with the phone. It makes the phone very annoying to operate. Just for checking the weather or any other website, I boot the phone, enter the unlocking code, enter the SIM PIN, enter the keychain password, and only then can I start the browser. I have to race to find the information I want before the phone freezes. When it does, I press the power button for ten seconds until the screen turns black. Then I have to wait for the phone to cool down before I can boot it again.\nIt makes it impossible to be reachable the same way I used to be for the last 20 years. Now I switch on the phone a couple of times each day for short periods of time to check for regular text messages and text messages about missed calls. My wife hates my new phone for this reason. On the other hand, I probably never had so much privacy in the last 20 years, as I am not being tracked by the cell phone operators. Still, this is not the way I imagined the privacy gained with this phone.\nI wonder if all the phones from the Birch batch freeze so often, or if it is an issue just with my phone. I hope it can be resolved through software updates, or with an easy hardware modification that I can handle myself. I am not sure how I could send it back for warranty without paying taxes and handling fees again and again. I am not even sure, if I would want a current one as a replacement, or wait for the evergreen batch."
		},
		{
			"post_id": 48,
			"title": "Considerations for communication software",
			"date_published": 1577298195,
			"body": "Back in the day we used xmpp to chat among co-workers. All was good. For reasons beyond my understanding, we had to use [Skype for Business](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:7:Running+hostile+software+in+a+container) for a period of time. After that we switched to [Slack](https://slack.com/). I don't particularly like Slack, but anything is better than a closed-source product from Microsoft with a proprietary protocol and centralized servers, that is constantly online and has access to a microphone and a keylogger. I thought that we were done with picking the worst possible option. That was until some people recently started using [Microsoft Teams](https://medium.com/@joshuamkite/the-horror-of-microsoft-teams-c18360712361) and try forcing it down other peoples throat.\nSo lets take a step back, and think about what you seek to achieve with a chat software. You want to convey a message to a target audience. Now think about what or who your target audience is. Is it one of: your co-workers, your boss, all employees in your company, the competition, your neighbour, your wive, the NSA, your ISP, a random hacker, the Zuck, your insurance agent, or all of the above. \nIn case it is not the last option, you might want to think about encryption. The only type of encryption that makes any sense is \"end to end encryption\". That means the message is encrypted at the sender, and only the receiver can decrypt it. That also means, no coordination server or transmission service can read it. Makes sense, right? Encryption is only meaningful if the client software is open source. Too many proprietary apps have been caught using key escrow or introducing other types of back doors for \"man in the middle attacks\".\nNext thing is the infrastructure. Of course it is best, if the communication is direct peer to peer, or at least federated. If the encryption is solid it is not a catastrophe if it is centralized, but it leaves you vulnerable to metadata surveillance.\nOnce the foundational features are sorted, we can move to the nice to have usability features. Do you need groups? Do you need audio or video calls, Do you need screen sharing? Do you want the client to be easy to operate?\nMost of the big name communication apps today fail at the fundamental requirements already. Even if they say they have end-to-end-encryption, it is meaningless if they are proprietary closed-source clients. That is true for WhatsApp, Skype, MS Teams, Facebook Messenger, and the list goes on and on.\nApplications that pass the first and most important hurdle are for example: [Tox](https://tox.chat/), [Session](https://getsession.org/download/) and [Mattermost](https://breakoutstartups.substack.com/p/breakout-startups-23-mattermost).\nI didn't really research other good options yet. So if you know of, or use some good ones, please share them in the comments."
		},
		{
			"post_id": 46,
			"title": "LoRa mesh networks and Bitcoin",
			"date_published": 1577293269,
			"body": "I have been a big fan of open wireless mesh networks for a long time. For one I prefer decentralized, resilient infrastructure over centralized counterparts with singular points of failure. In addition I prefer buying something that I can use for as long as it works over paying for a service plan that I also have to pay when I don't use it. When sharing and a community is involved, it makes it all the better. \nFor a long time I ran an [openwireless.ch node](https://ulrichard.ch/blog/index.php/2011/03/11/openwirelessch-in-brunnen/), which was similar to the German [Freifunker community](http://start.freifunk.net). I still run a lonely [MeshPotato](https://villagetelco.org/mesh-potato/). Unfortunately, they are no longer available for purchase. When I found out about the [Sonnet](http://www.sonnetlabs.com/) early last year, I was instantly excited, and wanted to pre-order a pack. Unfortunately on kickstarter it is not possible to pay with a sane payment method. Sonnet people promised to accept Bitcoin payments, once their web shop was set up by fall 2018. That was long ago, and by now they only ship prototypes. So I started looking around for [other mesh devices](http://127.0.0.1:43110/17BfnpuK949SBPVXyNx38La5dUNrLSVJag/). The [GoTenna](https://gotennamesh.com/products/mesh) seems to be the the most used and consumer ready device. What I didn't like about it was that their app is closed source and only available for Android/iOS. I was most interested in internet sharing, which only few devices enable.\nThen I found out about [LoCha mesh from BTC Venezuela](https://github.com/btcven/locha). Wow, what an incredible project. It is still very early, and unfortunately there was not a lot of visible progress over the last year. They develop devices that propagate off-grid bitcoin payments over a LoRa mesh.\nLately I bought a flight computer that communicates over [FANET](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:43:Flying+AdHoc+Network). It is another great LoRa mesh network with a narrow use case.\nLooking around for general use, standardized LoRa mesh networks, I came across [the things network](https://www.thethingsnetwork.org/docs/devices/). It is yet another cool technology, but unfortunately not a mesh.\nI heard about [TxTenna](https://txtenna.com/) before, but as I had my reservations against the proprietary nature of GoTenna, I was not too interested, and rather hoped for [LoCha mesh](https://github.com/btcven/locha) to make progress fast.\nRecently I listened to a [podcast about txtenna](https://bitcoinundco.com/en/richard-myers-gotenna/) and the incredibly cool [GlobalMeshLabs and Lot49](https://globalmeshlabs.org/) project. That triggered me to get a pair of gotennas to start experimenting with txtenna. Ordering directly from GoTenna didn't really work, as they only accept credit card payments and shipping would cost an insane 97 dollars. So I looked for used ones on [ebay](http://ebay.com) and [ricardo](https://ricardo.ch). I found some, but they were either too old without mesh, or from too far away. Where I found a pair was on my favorite marketplace: [OpenBazaar](https://openbazaar.com). Payment on OpenBazaar is in Bitcoin or a few other crypto currencies. For this purchase I could even pay with Lightning. \nAs the packet arrived, there was still no GoTenna App for neither my new [PureOS](https://puri.sm/products/librem-5/) phone, nor for my older [ubports](https://ubports.com/) phone. I figured it would be easiest to bite the bullet and make the first steps with the proprietary Android app. First I tried on a cheap Wiko phone that was lying around. I bought it last year during the [WAVE trophy](https://wavetrophy.com)  as a temporary solution, when I thought my regular phone was broken. The GoTenna app was neither available from [f-droid](https://f-droid.org/), nor as a direct download from the GoTenna website. Downloading it from a shady website that might bundle malware was not really an option (yet). Next thing I tried was the phone of my wive. She still uses a google account. So I tried installing it from the play store. But unfortunately there was not enough free storage on her phone. So I decided to bite yet another bullet, and register a single use google account just for setting up txtenna on this burner phone. But I progressed only a couple of pages, up to the point where it asked me for my mobile phone number. There is no SIM in this phone, and I don't want to connect this experiment to my real identity. I'm not going to perform anything nefarious, but I just don't want Google or any other company sneaking around and track my every move. So I downloaded the GoTenna app from a shady website. Fully aware, that I have to regard the phone as compromised from now on, and not fit for real transactions. But at this point I want to explore the technology. Judging by the amount of crap-ware this phone had pre-installed, it was never suited for any form of sensitive data anyway. The next step was installing the TxTenna and Samourai wallet apps, again from shady websites. So far, the user experience was really crap, lets see how the app itself behaves.\nAfter starting the GoTenna app, I could pair it with one of the devices. For setting up, you have to enter a name and a phone number. But there is an option not to enter a phone number, but generate a random ID instead, that you can share with your friends. Guess which option I chose... \nNext up was installing [txtenna-python](https://github.com/remyers/txtenna-python) on a [RaspiBlitz](https://raspiblitz.com/). The readme looked straightforward, even if you are not too familiar with python or virtualenv. There were some minor hickups, but they were solvable. For example when building the virtualenv, I got an errormessage about a missing 'ffi.h\" file. That went away with \"sudo apt install libffi-dev\". After the virtualenv built sucessfully, I tried starting txtenna.py, but was greeted with an error message about a missing \n\"requests\" import. That went away with \"pip install requests\". \nThe next one was more tricky: \"No module named goTenna\". I assume I will learn more about this when I receive my GoTenna SDK token that I requested more than two weeks ago at [their site](https://gotenna.com/pages/sdk#sdk-signup). This is another unnecessary, artificial barrier. I mean, what do they want to prevent by requiring people to apply for an SDK token? I bought the device. Why can't I just use it?\nAfter some time I came to the realization that my initial gut feeling was right about the proprietary GoTenna. I will most likely sell the GoTennas again. Hopefully LoCha and Sonnet make good progress in the near future. I definitely intend to try them and I am sure the experience will be better than with GoTenna."
		},
		{
			"post_id": 45,
			"title": "The Librem 5 phone is still at an early stage",
			"date_published": 1575318877,
			"body": "When I learned that [Purism](https://puri.sm/) was going to develop a privacy respecting and security focused smart phone, I was immediately very excited. So far the only real open source phone was the [OpenMoko](http://wiki.openmoko.org/wiki/Main_Page), and that was almost a decade ago. I ordered one as soon as they opened the pre-orders. A quick look in my Bitcoin wallet revealed that I paid the phone pre-order on Aug 24th 2017. Of course I knew that it would take a while, and that problems are to be expected, which result in later deliveries. When they finally prepared for shipping, they asked everyone for their preferred batch. They warned that early batches would be not as flush as later iterations, and that the software was still a work in progress. Having waited for so long, I was eager to get it as soon as possible. Using an OpenMoko and later [Ubuntu Touch](https://ubuntu-touch.io/de_DE/) device as my main phone, I gathered some experience with unfinished products. A solid base is more important to me than the finished product.\nTo my knowledge it is the only phone that separates the main CPU from the base band (correction in the comments). Like the Purism notebooks, it has hardware kill switches. One for wifi/bluetooth, one for camera/microphone, and one for the cellular modem. This makes it the only phone on the market where the user is in control. It allows the owner to own the phone instead of Google/Apple in combination with the phone company. In today's economy, this is a very important development. Modern phones [track their users](https://www.nytimes.com/interactive/2019/12/19/opinion/location-tracking-cell-phone.html) in so many ways that they have become golden hobbles. This is the main concern with Android, but even [Apple is not without doubts](https://invidio.us/watch?v=shxTTon5lfs) in this area. The main issue I have with iOS is that it patronizes its users. If you don't want neither of these evils, then you cannot just walk into the next phone store and expect to find something. Devices that came installed with Ubuntu Touch have sold out a long time ago. Purism describe their phone as:\n<blockquote>hardware and software that treats you like a person and not a commodity to be exploited for profit</blockquote>\nLast Friday, the waiting was finally over, and I received my [Librem 5](https://puri.sm/products/librem-5/).\nThe first impression when unpacking was, that it is thick and heavy. In fact it is so thick that my kids make fun of me. The build quality is a lot better than I expected after the warnings about the early batches.\nThe on-off button doesn't always work reliably, so I first charged it like the manual suggested. It is quite quick to boot. When I can't get it to start with the on/off button, I usually open the device, and remove the battery for a moment. This always makes it boot reliably. Did I mention that it boots really fast?\n[Here is another report with unboxing pictures](https://azdle.net/2019/11/comparing-apples-and-gnomes/), so that I don't have to make the pictures myself.\nSwitching apps and general usage of the phone OS makes a good impression. Not as good as current ubports, but a lot better than OpenMoko in its best days. \n<h4>Wifi and bluetooth</h4>\nUnfortunately the phone froze during the initial setup when trying to connect to the office wifi. After a reboot, I removed the wifi in the settings, and connected again. This time it appeared to connect, but it didn't get an IP address, and thus I was unable to fetch anything from the internet. At home, connecting to the wifi worked as easy as with every other device.\nI talked to a sysadmin, and he told me there is nothing special with the company wifi. But he told me that the signal strength is not great everywhere. So I went straight to the physical wifi router. In close proximity, the phone connected successfully, and I was able to browse the web. This is probably the reason there was something about antenna optimization in the description of a later batch.\nThe bluetooth configuration doesn't work at all. But the phone is discoverable, and when another device wants to pair, it displays the code to compare. The other device then reports success. But so far I was not able to make use of bluetooth with the device. Bluetooth audio is one of the sore points with my current ubports phone. It used to work perfectly for a long time. But then I got an update last winter that crippled bluetooth functionality. For almost a year already, I could receive calls in the car, but after one second the audio connection breaks every time. It was one of my biggest hopes that bluetooth hands free in the car would work out of the box with the Librem 5.\nI haven't tested mobile data connection yet. This is because I rarely buy mobile data. I have wifi at most places I go. My car has an internet connection and a browser which is enough for on the way. The only time really I need mobile data is when I want to pay with Bitcoin in a restaurant, and no friend is with me who can set up an access point on his phone. \n<h4>Text messages</h4>\nSending a text message worked on the first try. Only the integration with the address book still needs to be improved. Speaking of the address book, I haven't found out yet how to synchronize or import my contacts.\nSo far I didn't receive any text messages. I strongly suspect that at least some should have come my way in the last couple of days. I tried testing it myself with [LnSms](https://lnsms.world/), but it didn't arrive. This is possibly due to a [bug with non numeric senders](https://source.puri.sm/Librem5/chatty/issues/222#note_69967). But that I didn't receive regular text messages is bothering me. A friend sent some to me for testing, and none arrived.\n<h4>Phone</h4>\nEven before I wanted to place a call, I read in the forum that [there is a problem with audio routing](https://forums.puri.sm/t/how-about-a-little-community-effort-to-solve-the-phone-call-audio-routing-problem/7992). I didn't even get that far. I cannot initiate a call, because below the dial buttons there is a message warning me that there is no voice-capable modem. Somewhere in the bug tracker I found a post that claimed that it should be possible to work around this by killing the cally app five times in a row. That didn't work for me. So if this smart phone is no phone yet, I hope that it is at least smart ;-)\n<h4>Browser</h4>\nIt is not the best browser that exists for phones, but it works good enough for everything I tried so far. For sure it is better than the browser in the Tesla.\n<h4>Settings</h4>\nThe settings pages look very familiar. In fact they are the same as in any modern Gnome desktop operating system. Some pages are too big for the screen, and some don't make much sense for a phone, while some phone specific settings are missing. I already installed the first update, although I don't know what it actually contained. \nThe audio page reveals that there are lots of audio devices. I went through them all, and clicked the test sound button, but I couldn't hear any sound coming from the device.\n<h4>Terminal</h4>\nA linux smart phone needs a terminal. The Librem 5 comes with Kings Cross pre-installed. The terminal app itself looks quite good. But the virtual keyboard is lacking arrow and tab keys which are extremely helpful when working with a terminal. \nI was delighted to find out that unlike with ubports, you can hack around with the actual system, and the packages seem to be apt based. I never liked click, snap or flatpack. Apt is my favorite package format.\n<h4>Clock</h4>\nFor the first three days, after every reboot, the system date was reverted to February 2019. This rendered all TLS certificates issued after this date invalid. Thus preventing me from upgrading the system until I manually fixed the date every time. I am not sure what I did yesterday, but I suspect that I re-enabled automatic time synchronization just AFTER correcting the date. Since then, the system time is correct IF the phone has an internet connection. It is not yet synchronized from the cell phone network, or preserved across reboots.\nFor the last 20 years I used my phone to wake me up in the morning. Some phones also worked when switched of, while others had to be enabled to reliably wake me up. In the settings of the Librem 5, I can set multiple alarm clocks, and specify how to repeat and on which days of the week. So far so good, this is on par with most phones. Problem is, when the time comes, no sound emits from the device, and not even a reminder is visible on the screen.\n<h4>Battery life</h4>\nWhether the screen is on or off doesn't seem to make a difference. The device gets very, very hot. It is no surprise that the battery doesn't last very long. It doesn't even last an hour. So I just have to switch the phone off while it is not being used and not plugged in. People at purism are working to tweak the kernel to dial down the frequency, switch off cores, and put the CPU to sleep when not in use. I hope they assign this issue a high priority.\nCharging time when the phone it is turned off is ok. But when it is turned on, I don't really know if it is slowly charging or slowly discharging. That is with the provided charger. Be careful where you plug in the phone for charging!\nWhen I plug in the phone to my notebook, the notebook often looses internet connectivity. I didn't investigate why yet. Maybe it adds another connection and assigns it priority in the routing table. I will try with an USB condom and see how that goes.... Indeed, no problem so far if I use an USB condom.\nWhen I plug in the phone to the USB ports in the car, I often get a warning on the dash that there is a problem with the touch screen. The big screen in the middle of the car still updates, but it no longer processes touch inputs. I then have to unplug the phone and reboot the MCU. I'm not sure if the phone registers as an HDI device, draws too much power or interferes in another way.\n<h4>Apps</h4>\nThe phone comes with the following apps pre installed: phone, messages, browser, contacts, clock, settings, help, terminal, software, text editor\nAnything can be installed from the software app or at the command line from the apt repository, but so far I have mostly installed command line applications. I suspect most regular desktop applications don't behave well on a phone. I am not aware of a list of applications that run well on phones. And I don't think there are a lot of apps that were developed specifically for this device other than the apps from Purism themselves.\nAs a test I installed my favorite desktop Bitcoin wallet: [Electrum](https://electrum.org). Unfortunately it didn't start. At the commandline I saw an error about something missing to bridge Qt5 to Wayland. So far I didn't investigate much further.\nAfter using ubports for the longest time, I am used to most apps not being available to me, so the whole app thing is no big deal for me.\nWhat I miss most on my current ubports phone is a decent Bitcoin wallet. As long as there is none, at least a qr code reader would be cool. This would be necessary if I want to use a web based wallet.\n<h4>Conclusion</h4>\nI hate to say it, but at the current state, this phone is even less usable than both my previous linux phones in their initial condition. The previous phones improved quickly and got more or less usable. I abandoned the OpenMoko after half a year, because it was just not reliable enough as a phone, especially the audio in calls. The Ubuntu Touch phone on the other hand has been my daily driver for almost five years. \nMaybe I am too optimistic in wanting to use the Librem 5 as my main and only phone from the start. Lets see how things progress from here... With some software updates I hope it will become the phone that I want to use for the next five years.\nI hope I didn't discourage anybody from ordering a Librem 5. If you want a phone that preserves your dignity, this is pretty much the only option at the moment. And I am sure it will improve."
		},
		{
			"post_id": 44,
			"title": "Social norms for how we dress",
			"date_published": 1574367660.825,
			"body": "I know a boy who often pulls the bottom end of his trousers up to his knees. He asserts that otherwise he would feel too hot. His parents try to pursue him not to do that. They are embarrassed if he walks around like this in public. They try to convince him to conform to [social norms](https://en.wikipedia.org/wiki/Social_norm), and try to explain to him what this is. They also try to explain to him that this is a likely source of mockery amongst his classmates. Children are more direct and brutal in their peer pressure.\nThis triggered me to think deeper about social norms, and [how we dress](https://fashionculturesparsons.wordpress.com/2014/04/09/social-norms-in-fashion/) in special. Most people automatically adhere to these norms automatically without even being concise about. Only when peer pressure does not seem to work, do we start thinking about these mechanisms. \n<blockquote>“Clothes,\" writes Keenan, “are society’s way of showing where we belong in the order of things, our role and position in the social pageantry\".</blockquote> [Clothing is also a form of communication](http://www.articlemyriad.com/clothing-communication-culture-sociology-fashion/). But what is the message of a highly intelligent individual with a good job and a family, who walks around dressed like a homeless? If the message is \"fuck you, I don't care\", is this rude?\n\nAn example that puzzles me as of late is clothing and appearance in an office environment. Some companies have strict rules for clothes or even provide uniforms. Stricter rules are usually for people who have direct contact with customers. The more so, if the customers are from other businesses or if the company itself is a bank or an insurance. These rules are more relaxed in other office settings such as for example research, development, administration or schools. In such settings, many things are fine. The range goes from shorts and flip flops through hoodies all the way to suit and tie. Being able to work with shorts and open shoes is great in summer, but a tie is a rare appearance in these settings. Most people dress casual, but neat. Whether people wear a shirt, a polo or a t-shirt, it is usually clean, straight and only worn for one day. So the appearance of the people can vary, but it is within certain bounds. It is the kind of appearance we have grown to expect from people working in an office or going to school. \nAgain, all of this didn't grab my attention until somebody doesn't adhere to the unwritten rules. Now there is that one person who goes to work with cheap looking trainer trousers and a wrinkled t-shirt, sometimes even with cargo shorts on top of long sleeve thermal underwear. Before I saw that, it would have been unimaginable for me to be dressed like this while not exercising, let alone going to work like this. \nI don't write this post to complain. It doesn't bother me, as long as it doesn't smell badly, and as long as I don't see the same shirt worn for many days. I am just puzzled why some people are not embarrassed walking around like this. And it triggered me to think more about social norms, and why they work on most people without even thinking about.\nHere are some interesting quotes from a [German magazine](https://www.beobachter.ch/arbeit-bildung/arbeitgeber/dresscode-angemessen-angezogen-zur-arbeit):\n<blockquote>Als Faustregel gilt: Gehen Sie so gekleidet zur Arbeit, dass Sie jederzeit zu einem Kundentermin oder zu einem Gespräch mit der Leitung Ihrer Firma gerufen werden könnten.</blockquote>\n<blockquote>Mit einem ungepflegten, schludrigen Auftreten demonstriere ich, dass ich mir nichts aus Äusserlichkeiten mache und auch nicht bereit bin, mich in Hierarchien und Strukturen einzuordnen», erklärt Laufbahnberaterin Regula Zellweger. «Ausgebeulte T-Shirts zum Beispiel, Heilandsandalen und Strubbelbart haben etwas Pubertäres. Damit zeige ich, dass ich in meiner Entwicklung irgendwo stehengeblieben bin.</blockquote>\nThe first quote actually reminds me of a story from my former job. Usually when I went to work in shorts for in house development, I always had more formal clothes in the car. This was for the case that I had to go for an emergency customer visit. Only that one time on the first day after a holiday, I was not prepared. And so I went to a customer in shorts and Hawaii shirt. It was clean and ironed and all, and the customer was cool about it. But I didn't feel very comfortable, because I thought it was not appropriate. It was a lesson for me.\n\nThere are also popular behaviors that I don't engage in, and for good reason. For example it seems common these days to let predatory tech companies invade your privacy, and compromise the security of your devices. This is for me a case where I gauge the pros and cons, coming to the conclusion to only use open source operating systems and programs. Most people don't care, and just use the product that gives the biggest margin for the salesman. My explanation is that I have more information available, because I am interested in technology and security. Am I breaking a social norm here? Not sure about that. I am not really sure how to compare technology to clothes in this respect. I am far from being an expert in clothing. I read [a very interesting book about dress code](https://www.amazon.com/Dresscode-man-Style-perfekten-Auftritt/dp/3991000180) some years ago, and I know that the [production of fashion is very unfair](https://www.amazon.de/Die-Grüne-Lüge-Werner-Boote/dp/B07JMFLY7L). So I fully understand if somebody buys clothing that is from controlled production or from recycled material or whatever he deems important. Even if I think these are important considerations, I am not interested enough in these topics to spend a considerable amount of my time researching the respective supply chains. Hence I am not in a position to make really informed decisions. Thus I stay with mainstream clothing products, sometimes even vanity brands. I imagine that is also the reason most people buy closed source software or trade their privacy for using flashy services. At least that is what my non tech friends tell me."
		},
		{
			"post_id": 43,
			"title": "Flying AdHoc Network",
			"date_published": 1571952737,
			"body": "The first time I heard about [FANET](http://fanet.ch/) was at a gathering of some paragliding friends last year. They mentioned that they can display each others position on their flight computers. While that sounds cool, I don't often get to fly cross country any more. Thus this feature was not of particular interest to me. Then some months ago I read an article about the [Skytraxx 3.0](https://flyovershop.ch/skytraxx3/?page_id=86) in a paragliding magazine. It was mainly focused on the builtin database of aerial obstacles, namely dangerous cables. But it also mentioned that weather stations could broadcast wind information on FANET, which the flight computer would then display in real time. Now that was more interesting to me. The part I like the most about the FANET technology is that it is an open LoRa mesh network. I watched a [video](https://www.youtube.com/watch?v=RHuFTOXQlY4&feature=youtu.be) where the developer explained that it is even possible to transmit landing procedures based on wind direction to be displayed on the flight computer. Further pilots can send messages to each other, and change the mode from \"flying\" to \"retrieve car\" or \"need a ride\". All of this together was too much to ignore. \nWhile FANET was developed by Skytraxx, it is an open protocol, and other companies started including support for it in their devices. The Skytraxx devices that come with FANET, also include [FLARM](https://flarm.com/). FLARM started as collision avoidance system for sailplanes. But in the meantime, most light aircraft are equipped. Devices for paragliders only transmit to FLARM. They are unlikely to crash into one another due to the slow speed. But by transmitting their position, faster aircraft can be warned soon enough about their presence. Like [FlightRadar](https://www.flightradar24.com/47.11,8.47/10) for big airplanes there is [GliderNet](http://live.glidernet.org/#c=46.95287,8.87941&z=8&s=1) based on FLARM and [SkyNet](https://www.burnair.ch/skynetmap/#9/46.9498/8.6174) based on FANET. These sites are fed by ground stations that decode the signals broadcast by the aircraft. All you have to do in order to appear on these sites, is register with the [Open Glider Network](http://ddb.glidernet.org/). If you register in addition with [LiveTrack24](https://www.livetrack24.com/tracks/country/ch) and link your OGN registration (the FLARM id), then your flights are automatically archived. What I like most about this, is that I can give the [URL](https://www.livetrack24.com/user/ulrichard/tracks/page_num/1) to my beloved ones. If I'm not home in time, they can check if I am still airborne, and where my last recorded position was. So in the improbable case of an accident, they could send search and rescue in the right direction.\n\n"
		},
		{
			"post_id": 42,
			"title": "Technical inspection with the Tesla",
			"date_published": 1570956811,
			"body": "Cars have to go to the technical inspection every second year in Switzerland. New ones are exempt from this for the first five years. Now that my Model S is closing in on becoming six years old next month, I got the invitation to bring it in for inspection. Usually with my old ICE cars, I would visit the mechanic beforehand to bring everything in order and to wash the engine. The Tesla has no dirty engine to wash, and was in service last July. So I completely skipped the preparation part.\nAs usual, the expert performed a short test drive with hard braking. Then followed the indoor inspection. Testing brakes, suspension and lights was as usual. But that was it already. He admitted that he didn't have much training for Teslas. His manual seemed to indicate that the parking brake was mechanical, while I am convinced it is electronically activated. So he tried to spot the cable. But we were unable to figure out which way it was, because everything is so well hidden behind covers. He said that the lower part of the car looked like from formula one, and wanted to know what material the shield of the battery was made of. He did not have a single complaint, and was done in less than 15 minutes. Wow, I never had a car before that was through the inspection so quickly.\n\nSo now is a good time to do some recap. I had the car now for three months short of three years. During this time, I did the following to it:\n* Added 95'000 km to the odometer (essentially doubled it)\n* Charged 19'208 kWh\n* Paid CHF 2'082.5 for electricity\n* Paid CHF 63.5 for parking that was only necessary for charging\n* Bought three sets of new tires, that I paid all with Bitcoin\n\nHere is some statistic about where I charge:\n<img src=\"img/PowerUsagePerPlug.png\">\n* 65% at home (typ2 16kWh)\n* 15% superchargers\n* 13% typ2 22kWh. Probably the lions share of this is the public charger near my in-law's place, but  it also includes Tesla destination chargers and most public chargers in general.\n* 2% Chademo (50 kW) and CCS (150 kW)\n\nGiven that only 2% was Chademo and CCS together it seems silly that I bought both adapters that cost together close to CHF 1'000. But it was mainly about peace of mind, being sure I can charge everywhere. During holiday trips each one of them proved invaluable. Even if I have an insurance that covers the cost for towing, it would be very inconvenient to get stranded, especially far away from home.\n\nI had a couple of repairs:\n* Two xenon headlight bulbs replaced\n* One 12V battery replaced\n* One door handle replaced with newer version (known problem with the cable to the micro switches in the first revision)\n* Tire pressure monitor system replaced with newer version.\n* Front brake disks and pads replaced. Was damaged from under usage due to recuperation.\n* One electric motor replaced under warranty. It worked still fine, but it was not completely silent any more.\n* Replaced all lug nuts, because somebody damaged them using a wrong tool when changing tires.\n\nIn total, I paid something more than CHF 4'000 for all the repairs.\n\nUpdate:\nIn the meantime, I found a schematic picture of how the parking brake looks like. So it is definitely electronically activated.\n<img src=\"img/ElectricParkingBrake.jpg\">\n\n\n"
		},
		{
			"post_id": 41,
			"title": "When a product is better than the description",
			"date_published": 1569272701,
			"body": "When I was a kid I liked wrist watches from Casio. I had one with a calculator, one with an address database, one with an infrared remote control and one with an altimeter. But for the last 25 years I didn't wear one. I don't like to wrap anything around my wrist. And since I carry a phone, I have a way to find out what time it is.\nWhen friends and neighbors started wearing fitness trackers, I thought I don't need that. When I went running, I did it for my personal fitness, not to compare to somebody else. And I can care about my fitness without a device telling me to walk some more before going to bed. When my wive wanted to gift me a step counter for my birthday a couple of years ago, my response was: thanks, but no thanks. I have no use for a step counter.\nSome times I brought my phone when I went running to record the GPS track just to try. Some co-workers upload all their activity to  Strava, and claim \"if it's not on Strava, it didn't happen\". Not so for me.\nSince I started carrying my ultra light paraglider for run and fly, I took the phone with me more often. In the backpack it disturbs less than in the shirt. The main reason for carrying the phone was to be able to call for help in an emergency. And when I brought the phone with me anyway, I could just as well run the tracker app on it. But unfortunately it didn't work very reliably. When the screen was off, it stopped tracking, and when the screen was on, it often registered fingers that weren't there. So it happened often that it stopped tracking after a while, or deleted the track entirely. Sometimes I had a ton of apps open after running and I didn't know what else happened to my phone. But still, with the few tracks that recorded at least the uphill running part, I could see my progress on that segment. That turned out to be more interesting than I anticipated.\nSo when my wife recently wanted ideas for my birthday, I told her \"a cheap wristwatch with GPS tracker, that works without a crappy lock-in smartphone app\". My absolute nightmare is to have a closed source device that tracks my every move, where I have no control over the data it collects. Worst of all, it would become useless when the manufacturer decided to stop maintaining the app. I don't want devices with planned obsolescence. Of course I had to do the research myself. On the product page they only mentioned their iOS and Android apps, which are of no use to me. I noticed a while ago, that there are some packages in the debian repo for Garmin Forerunner devices. Further research brought me to quite complicated methods to get the data from these watches. But then I found a page that stated that when you plug in the watch with its USB cable to a computer, it mounts a filesystem and you can just copy the activity files. If it is really that easy, then I really don't understand all the fuss. Everything seemed to indicate that all Forerunner watches come with a USB cable for charging the device that also acts as a data cable. It is beyond me why they don't mention that explicitly on the product page. So, for my purposes a relatively cheap Forerunner 30 or 35 should be just fine.\nAnd so I got one for my birthday from my wive. It even has a heart rate sensor that I wouldn't need. And indeed, just plugging it in with the USB cable, I can grab the fit files and either upload it directly to Strava, or convert it to a more common format using gpsbabel.\nLater I found out that there is even a small program called [PyTrainer](https://github.com/pytrainer/pytrainer) that can import and display the data.\n"
		},
		{
			"post_id": 40,
			"title": "Driving around the adriatic sea",
			"date_published": 1564955730,
			"body": "This years summer holiday we spent in Korfu, Greece. At first we talked about Croatia, when somebody came up with the idea to go farther south to Greece. \nLets begin with the important facts. This time not as accurate as for the [trip to Norway](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:26:Road+trip+to+Norway+with+the+Tesla), since I [deactivated app access](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:28:Why+I+deactivated+Tesla+app+access) a while ago, which allowed to automatically collect all the data in the past.\nDuration: 13 days\nDistance covered: 4'100 km\nElectricity charged: 850 kWh\nWaiting time for charges: 3 hours\nCost for charges: EUR 34 + tips\n[Our route on a map](https://abetterrouteplanner.com/?plan_uuid=0289408b-4ca3-4dba-8e9e-f40233902c75)\nAll hotels except the holiday house on Corfu booked with [CheapAir](https://cheapair.com) and paid with [Bitcoin](https://bitcoin.org)\nLike the last few years, a key criteria was that we didn't want to spew big amounts of CO2 and accompanying toxic gasses into the atmosphere. Thus we went again with our electric car. On the way to Corfu I drove the Balcan route. To make the trip home shorter, we took a fairy to Italy. Not only are the roads better in Italy, but also the charging infrastructure is more developed.\nIt was going to be the first time for us leaving the comfort of the [Superchargers](https://www.tesla.com/findus?v=2&bounds=48.59746931576996%2C33.687073419620106%2C36.8191418765847%2C-0.1947625178798944&zoom=6&filters=supercharger). There are some stations planned for the lower Balcan, but no dates are provided yet.\nAs you can see when comparing the above numbers to the [Norway trip](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:26:Road+trip+to+Norway+with+the+Tesla), this time we had some waiting times for charging the car. It had a couple of reasons as you will see when reading through. In general, when I write about a short stop at a Supercharger, that is for coffee or ice cream and toilet. A longer stop at a Supercharger usually means lunch or dinner. These types of breaks don't count towards the \"waiting time for charges\" as there is no waiting involved. With waiting times I mean times that were not necessary if it was not for charging. Not all of the waiting was strictly necessary to reach the next destination. But in countries without established charging infrastructure, I always wanted to have some reserve in the battery. You never know if the next planned charge really works out. This is in stark contrast to the normal use of Superchargers, which always work reliably in my experience. With everything else, there is always some risk involved. Thus on our trip I always had a plan B and a plan C.\nI love electric road trips, but unfortunately not everybody in the family does. The compromise was to spend a full week stationary in a [holiday house](https://www.corfucompany.com/rental/hyacinth/) on Corfu island. The road trip through the Balcan was a mere means to get there. My wive wanted to have all the hotels on the way booked in advance. The one time we had difficulty finding accommodation in Norway was too stressful for her.\n<h4>day 1: Driving to Croatia</h4>\nWe started very early in the morning, hoping to reach our destination in the early afternoon. We made it around Milano before the morning rush hour, and our first stop was at the Supercharger in Brescia. We were so early, the shopping mall next to it was still closed. Thus our plan of having breakfast there didn't play out. So we had some breakfast from our food reserves in the Tesla lounge. We made a short (coffee and toilet) stop at the Supercharger next to Venice. The next stop was already at the Supercharger in Slowenia. Again, our plan of having lunch there didn't play out, because there was no restaurant nearby, only a gas station shop. So, we drove to a restaurant with a [destination charger](https://www.tesla.com/destination-charging) that was close to our route. It turned out to be a [very nice restaurant](https://hotel-navis.hr/en/flavours-are-not-born-but-created). The food was delicious, and the view over the sea marvelous. Now the battery had more than enough energy to reach the [Plitvice Holiday Resort](https://plitvice.com). We didn't know that for the tiny strip of highway in Slowenia we were supposed to buy a vignette. And promptly two policemen imposed a EUR 150 fine on us. Yes, the Swiss police also hands out fines to tourists who drive on the highway without a vignette, but the signs are hard to miss upon entering Switzerland. While we didn't see anything when entering Slowenia. Avoiding the highway would probably not even have been a time penalty, if I knew about this. On the way to Grabovac, the navigation system took us through single lane back country roads. Once even on a dirt road which turned out to be an error. I booked a [tree house](https://www.plitvice.com/glamping/) for the night, and it was the absolute highlight for our boys. The resort has a pictogram for E.V. charging on the website, and when I asked, they told me that I don't have to reserve a charging spot, and that it will be all fine. When we arrived, I realized that there was no special infrastructure for charging cars, instead I could connect to one of the power outlets, that are all over the camp ground. Because the fuse constantly blew, I had to dial down all the way to 7Amp (1.6kW).\n<h4>day 2: Plitvice lakes</h4>\nWe spent all morning in the tree house and the resort. It was a dream come true for the boys. At the bottom of the tree house there was a trampoline atop of a small artificial river. The river ended in a small artificial lake that was surrounded by nice bungalows. In the afternoon, we visited the Plitvice Lakes. It is one of UNESCOs oldest national parks. The 16 lakes and numerous waterfalls are a must see! In the evening we drove to Zadar. I didn't care to book an accommodation with charging, because the next Supercharger is so close. We visited the old town where the car charged on a free station while we had dinner.\n<h4>day 3: Dubrovnik and driving to Montenegro</h4>\nWe made short stops at all the Superchargers we crossed: Zadar, Split and Gravorac. Then we topped up the Battery in the parking, while visiting the old town of Dubrovnik. We knew it must look cool, if they filmed part of \"Game of Thrones\" there. But it was almost like Venice, just without canals. After leaving Croatia, we drove through most of Montenegro while it was already dark. But at least we got to see some of its beauty in daylight and during dawn. Next time, I would plan more time for Montenegro. I didn't know the country, and my wive was worried about the cleanliness, so I booked a better hotel than we would usually choose. The prices are generally cheaper in Montenegro, thus we got a gigantic suite with two bedrooms, two bathrooms and a big kitchen/living room in a [spa hotel](https://www.montefila.com) for the same price as we got a simple room or apartment in other places. After the last Supercharger was in Croatia, it was important that we can charge the car full over the night. Thus I booked only after making sure to get three phase power. The owner was very well prepared and helpful. I am also thankful to [Benedikt](https://eexplorer.life) who sent me an old Yugoslavian plug which is still common in Montenegro.\n<h4>day 4: Driving through Albania</h4>\nBefore leaving Ulcinj, the boys took a swim in the hotel pool. Albania was the country where part of our family didn't look forward to. It is really different to the other countries we visited. It has nice places, but you also see a lot of dirt and garbage lying around everywhere. Especially the suburbs of Tirana looked grim. This was close to the industrial area where we visited the Volkswagen importer which has a CCS charging station. My car got the CCS retrofit only weeks before our trip. CCS is normally used for high power fast charging of up to 150kW and potentially more in the future. So I was a little bit disappointed when I found out that this CCS station only delivers 22kW. At least the employees were very friendly and helpful. Unfortunately there was no good restaurant nearby, so we had our lunch again from our food reserves. Albania has highways that are free to use. But they are different from what we are used to. Every ten minutes or so, there is a crossing where it narrows to one lane and the speed is limited to 40km/h. And every time you slow down in concert with 10 other cars, there is one asshole who crosses all the double markings on the road and passes everyone else with 150km/h, risking fatalities if another car crossed the road. This sort of extreme reckless driving was present everywhere in Albania. I had to brake very hard multiple times to prevent frontal crashes on curvy roads where some idiot drove on the wrong lane in front of a curve with zero visibility. This really tainted my image of Albanians even though the people I had direct contact with, were really nice and friendly. \nWhen I missed a fork, because the road looked like a dirt road and I thought there must be a better road ahead, we came to a nice beach and took a short break. After that, the navigation system told me to continue along the dirt road to the other end of the beach. To my astonishment, the road leading up to the main road was not paved, and in a very bad condition. I put the air suspension to \"very high\", but still had to be very careful not to scratch the bottom of the car at the rocks. This was really at the border of what I want to put my car through. But after you drove a bad road for a while and think that it has to improve any moment, it is hard to turn around and go back.\nWe arrived at the [Palazzine Hotel in Vlore](https://lepalazzineresort.com) in the late afternoon. Vlore is by far the nicest place in Albania that we saw. It has a long beach full of hotels and restaurants. It is relatively clean, not as clean as in western Europe, but cleaner than the rest of the country. For about the same price we got a nice suite again. Despite the reassurances when booking and a week before the trip, the receptionist didn't know anything about car charging. But she called a house keeper and a cook. They were extremely helpful, and didn't stop searching until they found a [suitable three phase plug in the upper kitchen](https://www.plugshare.com/location/200383). With my 10 meter extension cord it was just enough to reach the charging port of the car. The hotel has a beautiful terrace about 20 meters above the sea. From there we witnessed a scenic sunset while having a delicious and surprisingly cheap dinner.\n<h4>day 5: Reaching Corfu</h4>\nShortly after leaving Vlore, we drove up a mountain pass road. On the way up, the forest looked almost like home to us. But the way down on the other side had totally different vegetation. It was a lot drier and steeper, going straight to the sea. There was a paragliding spot, but we didn't have time. From there we could already see Corfu in the distance. Even if the straight line distance was not a lot, driving the curvy roads along the coast all the way to Igoumenitsa took a long time. Because we didn't wand to wait an hour for the fairy which goes to the south of Corfu, we took the one to the north which left earlier. Only on the boat we realized how much longer this detour would take. Nonetheless we arrived at our [holiday house](https://www.corfucompany.com/rental/hyacinth/) shortly before dawn.\n<h4>A week in Corfu</h4>\nWe spent a week in Corfu, visiting different beaches, the highest mountain, a castle built for Sissi and the main city. I couldn't fly my paragllider, because I drove to the wrong town which sounded so similar. But I took some basic lessons for kite surfing. The feel for the wing I gained from paragliding helped a lot. But standing up on the board was not so easy for me. At the premise we had access to a regular household plug for charging the car. Since our trips on the island were usually not that long, the slow charging speed was enough.\n<h4>Fairy to Brindisi</h4>\nFor the trip back home we took a fairy to Italy. This reduced our travel time considerably. I was told to be one hour before departure at the port, where I would get the real ticket in exchange for the voucher. At the entrance of the harbor, we asked where we would get that ticket, and they sent us back into the city. After some more misinformation, we barely made it onto the ship in time. I took the shortest fairy route because I wanted to produce the least amount of CO2. But we were still disgusted to see the dirty air exiting the exhaust of the fairy boat. My wive didn't want to sleep on the boat, so we spent an extended afternoon looking at the calm sea, and trying to find food on a boat with only closed restaurants. Arriving in Brindisi, we drove until our [hotel near Pescara](https://www.hotelvillamedici.eu) with a dinner stop at the Cerignola Supercharger.\n<h4>Back home</h4>\nLike the first day, the last one of our holiday was a very long one with a lot of driving and traffic jams. We charged at the following Superchargers: Pescara, Fano, Modena, Melide. This time eating while charging worked out again as it usually does. When we approached Altdorf in the middle of the night, we discovered that the Axenstrasse is closed, and we thus had to drive all around lake Lucerne, adding yet another hour.\n<h4>Navigation</h4>\nI was curious about where the car would have internet connectivity, and how far the offline maps of the navigation system would reach. My guess was that connectivity would only be available in countries where Tesla has Superchargers, namely only as far as Croatia. I was almost correct. Luckily for us the car had connectivity also in Greece. In Montenegro and Albania the car had no Internet, leaving us with only the offline maps and without traffic information nor music streaming. No big deal, really. If it were not for a little problem we discovered when driving through Montenegro in the dark. As soon as the screen switched to night mode after the sun went down, the offline maps didn't display any information other than the current route. At least it correctly recalculated the route when I missed a fork. A bit more context would be helpful, though.\n"
		},
		{
			"post_id": 39,
			"title": "Energy consumption vs time saving",
			"date_published": 1555582006,
			"body": "There is a construction site at the feeway exit for my work place. Because of that, it takes about ten minutes more to commute. That triggered me to drive along the other site of lake Zug. It is the shorter route. But since it is a small road that goes through all the villages, it usually takes about ten minutes longer. What is more interesting, is the energy consumption.\nOn the freeway route the car usually consumes between 15 and 23 kWh per daily commute. The actual value depends mainly on temperature and weather conditions. The highest consumption values are with freezing temperatures and snow storms. This results in bad aero-dynamics and high rolling resistance combined with energy used for heating the cabin.\nOn the alternative route the car only consumed about 11kWh the other day. That was with moderate temperature and a short part of freeway. And this was still with winter tires, which usually lead to higher consumption.\nThe massive difference is not explained by the shorter distance, but by the slower speed. Hence by driving the shorter route, I could reduce the energy cost per daily commute from an average CHF 2.7 to CHF 1.7 but is this worth enlarging the commute from 2x30 to 2x40 minutes? Not really!\nOh and BTW, the daily commute by train would be CHF 25 and take on the order of 2x50 minutes."
		},
		{
			"post_id": 38,
			"title": "Bitcoin Advanced Course by 21lectures",
			"date_published": 1552427886.973,
			"body": "Last week I attended a [Bitcoin Advanced Course](https://www.21lectures.com/advanced-course) that was hosted by 21lectures. Lucas who is also the president of the [Bitcoin Association Switzerland](http://bitcoinassociation.ch) initially wanted [Jimmy Song](https://cryptoinsider.21mil.com/how-to-become-a-blockchain-developer-with-jimmy-song) to teach his Bitcoin courses also in Switzerland. But when that didn't work out, he decided to build the classes himself, with the help of great quality teachers and developers from the local community.\nTo guarantee fruitful interaction, the groups are kept small. But when I arrived, the group was even smaller than I expected. What surprised me even more, was that a good portion of the students came to Zurich from other countries especially for this course.\nThe biggest part of the course was taught by [James Chiang](https://teachbitcoin.io/). He is preparing a bigger course that he will host online. It consisted of theory and practical excercises. \nSetting up the environment for the exercises proved to be almost as challenging as the hardcore crypto theory.\nFor me, the most interesting part was the last day, which was about the Lightning Network. As it is still new technology that is in heavy development, there is not a lot of learning material around. All the more valuable was the first hand information we received from Christian Decker.\nAn important part of the whole experience were the lunches. Most of the times, the teachers joined, so that we could ask additional questions and have interesting discussions.\nIf you are interested in Bitcoin and programming, I can definitely recommend this course.\n\nA somewhat interesting aspect was also how to get to Zurich. Downtown parking during office hours is really expensive, and there can be traffic jams. The venue was very close to the main train station. So it would appear to be reasonable to get there by train. But a return ticket for one day costs CHF 56. Lots of Swiss people have a half price card for public transport. They changed their terms a couple of years ago. I made the mistake of reading the new terms and discovered that they are really not acceptable. So I drove there by car, which cost CHF 4.15 for the electricity and CHF 36 for the parking. Still a lot, but also a lot cheaper then by train. "
		},
		{
			"post_id": 37,
			"title": "CppOnSea",
			"date_published": 1551954268,
			"body": "I meant to write about [CppOnSea](https://cpponsea.uk) for a while. The event is already a month in the past. So I better write down my impressions as long as I can remember anything. My comments will probably be shorter than had I written it down earlier.\nLast year I learned from a podcast about a new C++ conference in Great Britain. It made a good first impression. As the details trickled in over the course of the ensuing months, I started to think it would be worth visiting.\nWhen I asked around in the office who would join, I got only one positive answer. Reaching the venue by plane would not only be impractical, but I also didn't really want to pollute the atmosphere. So I proposed to drive there with my electric car. \nI checked the weather in advance, since what I wanted the least, was driving through a snow storm for a whole day. Exactly the night before we left, we had a good portion of fresh snow. As it was even on the highway, we made rather slow progress in the first two hours. The rest of the trip was uneventful, with the exception of having to drive over a small pass because a tunnel was closed in the Elsass. We took the tunnel below the channel. It is different than riding through the Swiss mountains on the back of a train, but not too much different. We arrived late in the evening at a nice old hotel on the cliff right next to the event hall where the conference was going to be. The breakfast was a lot better than what I remembered from previous stays in the UK. \nA baroque event hall built right into the cliff served as the venue for the conference. During the breaks we had a nice view onto the sea, and sometimes we had the impression we could see France on the other side.\n<h4>[Opening Keynote: Oh The Humanity](https://cpponsea.uk/sessions/keynote-oh-the-humanity.html)</h4>\nThe opening keynote was funny and entertaining. That is all I remember.\n<h4>[Postmodern immutable data structures](https://cpponsea.uk/sessions/postmodern-immutable-data-structures.html)</h4>\nThe speaker presented his library for immutable data structures. They enable a more functional style. It sure has something to it, but I don't see a use case in anything that I am currently involved.\n<h4>[What I Talk about When I Talk about Cross Platform Development](https://cpponsea.uk/sessions/what-i-talk-about-when-i-talk-about-cross-platform-development.html)</h4>\nHe had a much broader scope than what I considered so far. It is interesting to know, but I don't think I will use any of it in the foreseeable future. But it triggered me to think about using emscripten again.\n<h4>[Better Tools in Your Clang Toolbox: Extending clang-tidy With Your Custom Checks](https://cpponsea.uk/sessions/better-tools-in-your-clang-toolbox-extending-clang-tidy-with-your-custom-checks.html)</h4>\nI have known and sporadically used clang on linux for some years. But even though it is a great compiler I  didn't use it too much because you would have to compile everything yourself, rather than using dependencies from the apt repository. Also I knew that clang is shipped with VisualStudio, but only for cross compiling to ARM. What was new to me, is that you can also compile (but not link) regular desktop applications on Windows, with some work even MFC applications. This in turn allows the usage of clang tidy, which a good portion of this talk was about. What was also new to me, is that the MSVC compiler switch <b>/permissive-</b> causes VisualStudio to use a completely new compiler that is no longer built with YACC, but is much more standards compliant. This better compiler introduces breaking changes to old code. That is why we didn't use the flag so far. But I think it would be good to slowly introduce it module by module. This way we could sanitize the codebase, and maybe later start using the clang tools.\n<h4>[Deconstructing Privilege](https://cpponsea.uk/sessions/deconstructing-privilege.html)</h4>\nThis one was in the main hall, and for all attendees. It had nothing to do with C++ or with programming per se. It was more about social interactions with minorities. I still don't know why there was such an emphasis on this topic. But it seems to be a phenomenon at lots of IT conferences lately.\n<h4>[The Hitchhiker's Guide to Faster Builds](https://cpponsea.uk/sessions/the-hitchhikers-guide-to-faster-builds.html)</h4>\nBuilding the CAD I am working on can take up to an hour if I build only locally. Over the years we optimize the pre compiled headers from time to time, but also the linker takes a lot of time. So this was especially interesting for me.\nThe speaker ran through an extensive list of approaches to reduce build times. Lots of it was not applicable for us, or too esoteric. But one main takeaway was that I should look into union builds. He mentioned cotire to help with that. When we switched to cmake a couple of years ago, I tried to use cotire to simplify the handling of pre compiled headers, but couldn't really get it to work. Maybe it is time to re-visit it.\n<h4>[Diffuse your way out of a paper bag](https://cpponsea.uk/sessions/diffuse-your-way-out-of-a-paper-bag.html)</h4>\nThis one was entertaining, but I didn't learn much from it, except for the British humor.\n<h4>[A linear algebra library for C++23](https://cpponsea.uk/sessions/a-linear-algebra-library-for-cpp23.html)</h4>\nIn a way it is surprising that C++ has no linear algebra library standardized by now. Because of this many independent libraries exist, and many companies wrote their own implementations. This could lead to the conclusion that it comes too late. But I was delighted to learn, that the proposed library mixes well with existing libraries and data structures. So we will see how much of it we end up using when it is finally released.\n<h4>[Sailing from 4 to 7 Cs: just keep swimming](https://cpponsea.uk/sessions/sailing-from-4-to-7-cs-just-keep-swimming.html)</h4>\nThis one was about tooling. Nothing that I think will be applicable for us.\n<h4>[Keynote: What Everyone Should Know About How Amazing Compilers Are](https://cpponsea.uk/sessions/keynote-what-everyone-should-know-about-how-amazing-compilers-are.html)</h4>\nThis one was informative and entertaining. He had many good examples of how amazingly good modern compilers are at optimizing our code, and work around bugs in certain CPUs. This video is worth watching even if you don't work with C++."
		},
		{
			"post_id": 36,
			"title": "How I wrecked the new glider by flying into a cable",
			"date_published": 1551817829.602,
			"body": "We went skiing to Stoos lately. From time to time I went up to the Fronalpstock with the kids. Every time we were up there, I checked the conditions for paragliding. Every time, the wind was blowing from the back. Not very strong, but if it is from the wrong direction, it can be too much rather quickly.\nWhen the day was almost over, I figured that I could also go to the Klingenstock, which is better shielded from southerly winds. When I reached the summit, there was virtually no wind at all. As the sun was already quite low, I could not spot some cables that I knew from the past. I knew I had to be especially careful.\nI don't fly at the Klingenstock very often, only once in a couple of years. The last time was with the speed wing, and I started close to the top on the west side. With the speed wing, I just glide with the skis and the glider comes up pretty quickly. I didn't want to stretch the lines that quickly with the fragile single skin glider. That is why I descended a bit to a more flat area. I took off from there with a regular paraglider many years ago.\nNow the single skin has a worse glide ratio compared to a regular glider. This is why after take off and flying straight for a while, I realized that it would get tight with clearing a small hill in front. My first reaction was to avoid it by flying left. But then I would cross the ski slope with very little ground clearance or possibly even having to land. This is not only forbidden, it can also be dangerous in some cases. So I decided to fly around the small hill on the right hand side. Thus I made a right turn of approximately 90 degrees.\nAnd there it was. All of a sudden I saw a cable right in front of me frighteningly close. I had no time to think. Call it instinct or muscle memory, I immediately continued the right hand turn as hard as I could, to fly back to the slope. For a moment it looked almost as if I could clear the cable and perform a slope landing. But when I was only about 5 meters above ground, the upper left part of the lines connecting the glider to the harness collided with the cable. My forward movement came to a halt, and I slid down gently into the soft snow. Along the way down I could hear lines snapping and the fabric ripping. I was not injured or even hurt, but the glider looked like a wreck. I sent it for repair. But it turned out that it was a total loss. The glider was only two months old and had less than ten flights. Bad things always happen when the equipment is new! Like when I was ground handling a brand new glider 15 years ago, and a RC airplane hit it.\nThis was the most severe incident in my 17 years of flying with more than 2'200 flights.\nIn the aftermath it is always important to analyze what went wrong, and what I should have done better.\nThe first and most important thing is that I was not hurt. But could I have saved the glider?\nTo save the glider after I saw the cable, I could stall or spin it. That way I would hit the ground before the cable or slip under it. But these procedures induce a pendulum moment and/or spin movement. This is not what you want close to the ground. The risk of injuries would be way too high. In school we learned that some people overreact in this sort of situation, and involuntarily stall or spin the glider. This often results in injuries. So I am relieved that my instinct reaction was just right. I would act the same way if I had the time to fully evaluate the situation.\nIf my reaction was correct after the fact, what could or should I do better that it couldn't happen in the first place?\nThe easiest answer would be to look out carefully for any sort of obstacles. The bad part about this, is that I actually did that. \nThe next would be to inform about a flying area before going there. When leaving home, I expected to fly from Fronalpstock which I know fairly well. And even if I considered flying from Klingenstock, I don't think I would look up the map with aerial obstacles, since I was flying there before. But maybe I should. Another advice might be not to fly with dim light in areas that you don't know very well. For when it is darker, I strictly follow this rule. And I might have to adjust the threshold here.\nCables can be dangerous also for other aerial vehicles like helicopters. There are efforts to remove cables that are no longer in use. So I asked the corporation that owns the land about the cable. \nIn the meantime I already received the replacement, which is the exact same model of single skin paraglider. Last weekend I used the new glider for the purpose that I bought it for : run and fly. I ran halfway up the Urmiberg an flew down."
		},
		{
			"post_id": 35,
			"title": "Run and fly with the XXLite2",
			"date_published": 1544562585,
			"body": "Before I participated in the [rollibock trophy](http://rollibocktrophy.ch) in Fiesch last October, I thought my paraglider equipment was fairly lightweight. The glider is a regular Mac Para Marvel, but the Advance Lightness 2 harness is optimized for weight as the name implies, as well as the accompanying backpack. With helmet, gloves, sun glasses, flight computer and clothes, the equipment is slightly less than 14.5kg. When I started paragliding in 2002, a normal equipment was about 20kg. For reference, my tandem equipment is around 30kg, and my competition equipment also was in that ballpark.\nWhen I looked around the participants at the rollibock, I was astonished by the small and light backpacks they had. They were literally running up the mountain. When single skin gliders were first released, it didn't spark my interest. They were a strange appearance, and the flight characteristics looked slightly frightening to me. But a lot has improved since then. Some models have tubes along the leading edge, others from front to back. They have a lot better characteristics and performance than the first models. I started my research in the internet. Some models weight only 1kg. \nBest of all, I started thinking how cool it would be to combine hill running with paragliding. I try to run once a week from Brunnen to Morschach and back. Depending on my daily condition, I make it up to the cable car, or I turn around shortly before I reach Morschach. I always prefer running uphill. Especially since I started getting cramps in my forearms on the descent, sometimes even extending from there. It only happened on longer tours, and only on the descent. After a while I found out that it was caused by dehydration, and I took detours to water sources. I didn't want to carry any water when I go running. But carrying an ultra light paraglider is something entirely different.\nSo I asked the loal flying school for an [Ozone XXLite 2](https://flyozone.com/paragliders/de/products/gliders/xxlite-2/info/) glider for a test flight. November is the worst month for flying in Switzerland. The weather is mostly bad with lots of fog, and most cable cars are closed for revision. When the weather was finally flyable, somebody else grabbed the wing already a couple of times. In early December, I finally got to try it. I didn't really know what to expect. Some people I talked to, praised single skin gliders as great and fun, while others dismissed them as falling out of the sky like a stone. I completed two flights from the Rothenflue. Take off was very nice both times. With the slightest blow of light wind, you can bring it above the head and maintain it there. Also without wind it was easy to get airborne. The handling was surprisingly similar to a regular paraglider. It doesn't flare as well as a regular wing, but it does flare somewhat. I didn't know beforehand, but most single skin gliders apparently don't flare at all. Appart from the handling, I was mostly interested in the performance of the glider. Of course it was not made for performance, and is far from regular gliders in that respect. The teacher from the school providing the glider told me to expect something in the range of a school glider at the time I started flying. When I checked my XCTrainer in the air, I mostly saw glide ratios between 6.5 and 7 with speeds around 35km/h. For comparison, my regular glider has a glide ratio of around 9 and a current high end comp glider is slightly above 10. The trim speed again seems to be different from other single skin gliders that apparently mostly fly less than 30km/h.\nMy resume after the first two flights was that the flying characteristics are good enough, and the small and ultra light package is just astonishing. In short, I ordered one on the same day. Luckily the forecasted delivery time was much shorter than I expected.\nA week after ordering, I picked up the new wing including the [super light harness](https://flyozone.com/paragliders/de/products/harnesses/f-lite/info/) that I didn't see before. Of course I bought the glider at the [flying school](http://winwings.ch) where I can pay with Bitcoin. At home, I installed the special lightweight carabiners and the speed system. But the weather really didn't look good. We had occasional rain and very strong wind for days. I added a [ribcap](http://www.ribcap.ch/) and gloves to the kit. With this addition, the backpack now weights 1.8kg.\nAs the first chance of getting good enough weather, I went to the Zugerberg. Instead of the usual walking to the takeoff, I ran. The light backpack really doesn't bother at all. Even with light wind from behind, the glider took off flwalessly. The gliding ratio was enough to clear the trees halfway down. When I started paragliding, some school gliders had to land before the trees here because they didn't glide good enoug. Also the landing was smooth. The only thing that was strange was the cold wind flowing around my butt. Usually it is very comfy in my cocoon harness. The equipment is packed rather quickly into the backpack, and I was ready to run up to the train. From the train of course I ran again to the car. So my first flight with the new kit was not a pure \"run and fly\", but I can say that it works as I envisioned. Now I'm ready for the real \"run and fly\" adventures. "
		},
		{
			"post_id": 34,
			"title": "inconvenient chat about odor",
			"date_published": 1543616316.921,
			"body": "About a year ago we reorganized some seats in the company I work for. To be closer to the people I work with most of the time, I moved into another small office. Every time I walked into that office before, there was a predominant smell of sweat. I didn't know where it came from, but it was the only office that had it. I hesitated, couldn't come up with a good excuse, and hoped I would get used to it. When I grew up, my father had sheep and goats. I often had to help dispose their shit. Thus I thought my nose could handle a lot.\nSome days it was less, some days it was more, but it was always there. So I started to look out for the source. I had my suspicions, but it was difficult for me to tell them. So I started researching the internet for [how to tell coworkers about their sweat odor](https://www.stern.de/lifestyle/mode/buero-knigge--was-tun--wenn-der-kollege-nach-schweiss-riecht--8186398.html). It is a really uncomfortable situation. I didn't want to ruin our good working relationship by offending them. But quite frankly I was offended by that smell.\nIt was obvious to me that it has to do with the fact that they often come to work by bicycle. But other people also cycle to work, and don't emit that smell.\nThey are really nice guys to talk to, and brilliant on the job. I couldn't believe that one does not notice their own odor, especially if it is that strong. On days where it was most intense, I started burning scent candles to ease the pain. My hope was that this would be a subtle hint, but the message didn't go through. On the internet and in newspapers, there were stories of people who put soap or deodorants on other people's desks. But other people called this procedure gutless, and detrimental to the working relationship.\nMy wive constantly tells me how her nose can pick up many more smells than mine, and even goes as far as calling my nose deaf. This is why I can't imagine I was the only one noticing the smell in our office. So why would I have to be the guy telling them? But since I was closest in the office, I was suffering the most. Some times I would breathe through the mouth for a whole day. \nSome times I noticed a synthetic sports shirt being worn for a whole week, smelling stronger day by day. I had the impression one guy washes every day, but sometimes starts to emit pungent sweat in the afternoon. Maybe he uses an [inefficient deodorant](https://polishforums.com/life/poland-around-horrible-smell-sweat-26785/) or none at all. I don't know how often the other guy showers, but sometimes I had the impression it was only once a week. Maybe it is just a [cultural difference](http://www.thedaily.sk/the-brit-in-bratislava-and-life-in-slovakia/). Seeing the same clothes being worn for the whole week for cycling and working just reinforced that impression. Also if I see the same shirt being worn for two months straight, I start wondering. Don't get me wrong, I sometimes wear trousers or pullovers for a week, but only if it is cold enough, and I don't engage in high pulse activities. But I change underwear and shirts every day. Especially when I do sports, the sweat soaked clothes go straight to the laundry. Even more important with synthetic fabric.\nOther behaviors started to disturb me. For example I didn't want to have fingers on my mouse and keyboard, that I saw just minutes before in somebody's nose or mouth, or scratching balls or but cracks. But again, how to tell them? I just held on to my mouse and didn't let go.\nWhen we are having lunch, and somebody wants to chime in on a conversation before he swallowed everything, that's no big deal. It happens to me also from time to time. Even though we try hard to train our kids not to do that. But I don't want to see somebodies half chewed food while in a work related conversation. I didn't eat a banana in months, because it was so disguisting to see.\nThe situation started affecting my work. I would wait with functional reviews in the hope that the smell would be gone tomorrow. Wednesday is usually the best day, but not always. I started not to ask for advice in areas where somebody else had more experience. Instead looking for the information myself. When I was unsure about the direction, I started to commit half baked code to get feedback through the review process. Sometimes I even researched devices to clean the air. More and more I started to think about just how I would best tell them without offending. Even this thinking started to consume time, that I could better spend coding. I knew it would be best to get over with it, but it is just something I was not comfortable with. Something had to happen.\nToday I finally had the courage. I told them that there was something which bothered me for a while, and that it was the strong sweat odor in our office. They said they can't notice anything. But they could hang their cycling clothes in another room and see if that helps. I didn't say that the odor moves around with the body, as I wanted them to keep their dignity. One guy argued that maybe what my nose picked up was from rotten fruits in the bin, and that we should dispose them in the kitchen. I'm nonetheless hopeful that the situation is going to change for the better.\nPlease comment if you had similar experiences, or good advice."
		},
		{
			"post_id": 33,
			"title": "Generating solar electricity at home",
			"date_published": 1540149623.005,
			"body": "After I switched to an electric car, I started to care much more about where the energy we consume comes from. With petrol and diesel you don't really have that choice. We are in a comfortable situation that we have some small hydro electric dams nearby. Thus all the electricity we use at home and for driving around, comes from 100% renewable, local production. When you meet with other E.V. drivers, renewable energy production is always an interesting topic. Lots of these folks have their own solar panels on the roof. Solar is especially interesting as it has no moving parts, and can be employed by private people. It becomes more problematic however if you don't own a house. We live in a rented apartment, thus we have no option to put our own solar panels on the roof. Not all is lost fortunately. Recently I learned about panels with an integrated micro inverter that can be plugged directly into a regular plug on your balcony. According to Swiss law, up to 600W can be installed by private individuals. They only have to notify their power provider.\nSo I ordered an ADE Geranium from [Energiegenossenschaft](http://www.energiegenossenschaft.ch) that I could pay with Bitcoin. Last week it arrived, and I immediately installed it in our garden. It can feed up to 250W into the plug. I don't expect to feed a lot of this into the grid. It is more to reduce the standby consumption by refrigerators and computers. 250W is peak anyway and not often reached. In the first week after installation, it only produced 3.5 kWh. So it will likely take 10 years for it to amortize. But it comes with a 25 year warranty."
		},
		{
			"post_id": 32,
			"title": "Bye bye Jaguar",
			"date_published": 1533757727.129,
			"body": "In my former Job, I visited customers from time to time. One day in 2001 on a parking lot accross the street of a customer, I saw a gorgeous Jaguar XJ. It was from the second series, painted in british racing green and had a vynil roof. It didn't have a price tag, and I thought I would never be able to afford a Jaguar anyway. But out of curiosity I asked what it would cost. The answer was CHF 6'000 from the inspection or CHF 4'000 as is. I was blown away. Never would I have thought that this car could be that affordable. A friend warned me by telling a story of somebody bringing his Jag for a repair and asking for the price. The answer was that if you drive a Jag, you don't ask how much it costs. Nevertheless I was hooked. That is how my love for Jaguar cars started. Before that, I viewed them as beautiful, expensive old men cars. Of course I wanted to buy the car with a valid inspection. I called the mechanic many times, and he always told me that he didn't have time to look at it. Until one day he told me that he wanted to take the car on the lift, and the lift went right through the rust. So this one was not worth it, but there must be others. Hence I started to look for other XJ cars from the early 80ies. On customer visits, occasionally I drove detours to Dealers that specialized on vintage British cars. That is how I learned about the XJS, and henceforth included it in my search. \nIn the summer of 2002 I found an XJS that I liked. It was from 1984, in very good condition, had 75'000 km on the clock and should cost CHF 10k. On the test drive I heared a strange milling noise when driving around corners. The owner agreed to give it cheaper, and I took the risk of the repair for that noise. Luckily it turned out to be just a faulty rubber part on the mounting of the transmission.\nI drove many pleasant trips with the Jag in the past Years. The mighty V12 5.3l engine runs incredibly smooth. And the car was always very reliable. Of course I had some repairs, but nothing to complain about. It always consumed a lot of gasoline, and leaked some oil. That was just part of it.\nMost trips were within Switzerland, often with the Jaguar Drivers Club. Only in the last few years, we drove to the Lego Land in Germany and to Elba island in Italy. We wanted to drive to [Elba with the Camper](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:6), but after too many coolant pipes bursted, we used the much smaller, but more reliable Jaguar instead. Unfortunately this had an unpleasant side effect.\nWhen the car turned 30, I registered it as a veteran. You can only get that status if the vehicle is in very good and original condition. It is basically classified as worthy of conservation. But that status was later revoked, because I drove too many kilometers ([the Elba trip](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:6)).\nAfter 16 Jears of ownership, I sold my Jaguar XJS. It was not as easy as I anticipated, and in the end I gave it for much cheaper than I wanted to. But after switching to an electric car, I simply lost interest in polluting vehicles. When I sold it, it had a little more than 135'000km on the clock. So I drove it for about 60'000km in 16 years. The bulk of it was in the first few years.\nIf Jaguar delivered the I-Pace two years earlier, I would probably stayed with the brand. But a recent article just reminded me that I am very well served with Tesla:\nhttps://www.topgear.com/car-news/electric/top-gears-big-jaguar-i-pace-test-journey-back"
		},
		{
			"post_id": 31,
			"title": "Charging at a strangers house",
			"date_published": 1532289547.397,
			"body": "We spent the last week in an alpine Chalet and had to leave the car in a public parking halfway down the mountain. Upon arrival, the battery was down to 20% SOC. I read that leaving it below 20% or above 80% for extended periods of time was not too healthy. So I asked at a house next to the parking, if I could plug in the car for a while. They seemed friendly and agreed immediately. I told the man that I would need about 40kWh, and asked how much the electricity costs. He said he had no clue and I would have to know.\nWhen I came to pick up the car, I gave him about twice as much as the electricity would cost at the most expensive rate known to me, and about three times as much as I pay at home. That was when he started complaining. He said when he goes to the gas pump with his ICE car, he wouldn't get a lot of gas for this price. And if he knew that I was going to pay so little, he wouldn't let me charge. Same for me, if I knew he would be discontent, I would rather drive 20 minutes to the next Supercharger, get free electricity, and still be welcome.\nI never paid so much for a charge as I gave him. Usually if the electricity is too expensive at a public charging station, I just drive on to find something reasonable. But I paid him more than I usually would, because I wanted it to be a good experience for him.\nI read about mostly good experiences when asking strangers for a plug. But after this incident, I will think twice next time.\nWhat were your experiences with charging at a stranger's house?"
		},
		{
			"post_id": 30,
			"title": "Spending Bitcoin while charging the car",
			"date_published": 1525281701,
			"body": "When I go some place new, I always check out what Bitcoin accepting venues there are. I usually try to prioritize shops that accept crypto currency.\nWhen I drive some place far away, I have to charge the car on the way. No big deal, usually I can eat, drink or go to the toilet. All those activities, I prefer not to perform in the car while driving anyway. When I'm done, the battery is charged enough to continue the journey.\nBut how cool would it be to combine the two. If there was a restaurant that accepts BTC next to a supercharger, I would eat there for sure. Unfortunately finding this information manually is a hassle. That is how the idea was born to write a simple script to correlate charging stations and Bitcoin shops. I did it only quick and dirty. It could be improved a lot, but I'm not sure that is necessary.\nYou can visit a map with the correlated locations on ZeroNet: [Bitcoin shops at car charging stations](http://127.0.0.1:43110/197RQPCjQg48T5ByLhTh9eZPPyNKR3kfS1/)\nIf you want to have a look at the script that compiles the list or improve it, you can do so at: [bitcoin_supercharger.py](http://127.0.0.1:43110/197RQPCjQg48T5ByLhTh9eZPPyNKR3kfS1/bitcoin_supercharger.py)"
		},
		{
			"post_id": 29,
			"title": "Green Technology Tour",
			"date_published": 1523357304.955,
			"body": "Charles and I are going to participate in the [WAVE](http://www.wavetrophy.com/route-ch2018) (world advanced vehicle expedition) along the Grand Tour of Switzerland. This years tour will take place from June 8th to 16th and is titled \"Green Technology Tour\".\nWe enter the trophy as Team Bitcoin with a big BTC logo on the frunk.\nThe tour will have well publicized stops at approx 40 cities. I'm very excited to spread the word about decentralized payments, and that Bitcoin is so much more than speculation...\n\nYou can follow our team blog directly on ZeroNet: \n[zero://wavebtc.bit](http://127.0.0.1:43110/wavebtc.bit)\nor through a proxy:\n[https://zero.acelewis.com/#wavebtc.bit](https://zero.acelewis.com/#wavebtc.bit)\n\nGeneral info about the WAVE is at: \n[wavetrophy.com](http://www.wavetrophy.com/route-ch2018)"
		},
		{
			"post_id": 28,
			"title": "Why I deactivated Tesla app access",
			"date_published": 1516387310,
			"body": "\nThe official Tesla App is unfortunately not available for Ubuntu Phone. And there is no indication that it will be on my next phone, the [Librem5 from Purism](https://puri.sm/shop/librem-5/). On the bright side, from the computer I can control my car using the [VisibleTesla](http://visibletesla.com) desktop app running inside a docker container. But the best part about remotely controlling the car is that the [API is publicly documented](https://timdorr.docs.apiary.io/). Bindings are available for most scripting languages. That allows me to control the car from my Ubuntu phone at the command line. It also allows me to run a cron job to pre heat the car before I drive to and from work. It also allows me to precisely track how much electricity I charge, and where. It also allowed us to open the doors directly from an [ethereum smart contract](https://ethereum.org) at [Hack4Climate](https://hack4climate.org/). And it allowed me to implement a cool [live tracking](https://zeronet.mpa.today/norwegentesla.bit) for our summer holiday road trip. The possibilities are endless. \n\nAll my scripts authenticate using a token that is said to expire after 90 days. I set up my scripts so that I can enter my password to get a new token. And then the new token is used from there. Usually I enter the password on a maximally secured system, and then copy the file containing the access token to the other systems. That is because I saw in the API documentation, that remote starting the car requires the password explicitly. So if a hacker gained root access to my server or my phone, he could open the doors, but not drive away with my car.\n\nWhen I first discovered that the Tesla account is secured only with a password, I was bewildered. I mean, this account is essentially a virtual key to my car. Everything that secures something with a value above a few hundred bucks, has used two factor authentication for many years. Having been in the Bitcoin space for some time, cyber security is very important for me. I refuse to use software based 2FA, instead I insist on hardware solutions. I have used a USB dongle with a secure element to manage my GPG keys for a long time. I use FIDO U2FA wherever I can. Most of my crypto currency holdings are secured by multiple hardware wallets. I switched my bank, because the former used text messages as second factor. And now, I find out that the most expensive thing that I bought in my entire live, is secured with only one factor. Wow! That was shocker No 1! So I picked a very long and hard to guess password. I didn't store it anywhere. I am very cautious on which devices I even type it. But still I was uneasy about it all along.\n\nLast week some of my scripts started reporting errors. As expected, an access token was expired. But I failed to  get a new one by entering the password. So I tried logging in on the Tesla website. What I got to see, was a message that my account was blocked due to too many invalid login attempts. There was a button to reset the password. The result of that reset request was an eMail in my inbox with a link to a web form, where I can enter a new password. Hey, but wait a second. That eMail was NOT encrypted! Even if the link is only valid for a few minutes, everybody who sees it could take over my Tesla account, and steal my car. Seriously? That was shocker No 2!!! If a hacker gained access to my eMail account, he could even delete the mail, and I had no idea what's going on.\n\nI have regarded unencrypted eMails as an insecure means of communication for many years. And I thought that was common sense. For increased security, I run my own mail server. But my ISP added all the dynamic IP addresses to a spam list, and wants me to pay for an expensive business account in order to have self hosted eMail work well. Hence I use an externally hosted eMail address for most of the time, also for my Tesla account. So I wanted to quickly verify the security of that mail account. And while I'm at it, change the password to a more secure one. But the first surprise came in the form of the customer login to the management system. It was http only. No way to enter the password without running the risk of it being eavesdropped on. Seriously? That was shocker No 3!!!\n\nSure, it's easy to blame my eMail provider, or me for selecting it. In reality it used to be hosted with another company that was later acquired. That just highlights the fact, that it is outside of your control. Email is not secure, and should not be used to transmit sensitive information, unless it's encrypted - Period! I read about hacked eMail accounts and account takeovers every week. Lots of websites require some security questions in order to unlock an account. That's better than nothing, if there is not a lot at stake. But if an account controls anything of value, solid 2 factor authentication is a must. Even if the mail account offers FIDO U2FA, I wouldn't trust it with my car. For example gmail offers U2FA. But guess what happens when you log in with a browser that has no support for it. Yes right, convenience gets priority over security.\n\nAccount Recovery Exploitation is a known problem. Let me quote a paragraph from an article by yubico: [5 Surprisingly Easy Ways Your Online Account Credentials Can Be Stolen](https://www.yubico.com/2018/01/5-surprisingly-easy-ways-online-account-credentials-can-stolen/)\n<blockquote>Due to the large scale of users for many services and the general desire to keep support costs low everywhere, account recovery flows can be much weaker than the primary authentication channel. For example, it’s common for companies deploying strong two-factor authentication (2FA) solutions as their primary method to leave SMS as a backup. Alternatively, companies may simply allow help desk personnel to reset credentials or set temporary bypass codes with just a phone call and little to no identity verification requirements.\nServices implementing 2FA need to strengthen both the primary and the recovery login flow so that users aren’t compromised by the weaker path.</blockquote>\n\nUnfortunately, both the primary and the recovery login flow of the Tesla account are incredibly weak. As much as I love the cool and convenient features from remotely controlling my car, I disabled app access in the settings screen of the car. I would like to re-enable it very much. But only once I can trust the security of it again.\n\nI read many times how important security is for Tesla. And how fast they respond to fix vulnerabilities. But then I found numerous reports of people complaining about the very same problems from FOUR years ago: [1](https://www.grahamcluley.com/hack-password-tesla-car/) [2](https://www.extremetech.com/extreme/179556-teslas-model-s-can-be-located-unlocked-and-burglarized-with-a-simple-hack) [3](https://www.computerworld.com/article/2489327/personal-technology/hacked-passwords-can-enable-remote-unlocking--tracking-of-tesla-cars.html) [4](https://www.pcworld.com/article/2138400/hacked-passwords-can-enable-remote-unlocking-tracking-of-tesla-cars.html) [5](https://www.cio.com/article/2377458/security0/hacked-passwords-can-enable-remote-unlocking--tracking-of-tesla-cars.html) [6](http://www.dhanjani.com/blog/2014/03/curosry-evaluation-of-the-tesla-model-s-we-cant-protect-our-cars-like-we-protect-our-workstations.html) [7](https://cleantechnica.com/2014/04/13/teslas-shortfalls-security-systems/) [8](https://promon.co/security-news/hacking-tesla-app-stolen-car/) [9](https://teslamotorsclub.com/tmc/threads/account-email-changed-without-a-request-from-me.102253/) [10](https://www.mocana.com/blog/2014/04/01/tesla-cars-lack-two-factor-authentication) [11](https://www.pcauthority.com.au/news/security-slip-lets-crims-locate-unlock-tesla-model-s-roadster-381459) [12](https://www.mocana.com/blog/2014/04/01/tesla-cars-lack-two-factor-authentication). Sure, security means different things to different people. I'm grateful to the engineers who make sure, I don't get killed in the car. But I also don't want my car to get stolen or broken into so easily. When discussing this topic on a [forum](https://forums.tesla.com/forum/forums/keyfob-security-face-relay-box-attack), one guy stated he doesn't want to carry a secure hardware device the size of a key, and that he doesn't care if his car is stolen. He has insurance. I have insurance too, but still don't want to go through that experience.\n\nNow, if you read this far and have a Twitter account, may I ask you to visit [https://www.dongleauth.info/#iot](https://www.dongleauth.info/#iot), and click the button next to Tesla?\n\n\n<img src=\"img/KeyPad.jpg\">\n"
		},
		{
			"post_id": 27,
			"title": "The mother of all hackathons",
			"date_published": 1511116812.184,
			"body": "I just returned from [#hack4climate](https://www.hack4climate.org). Even if it was just my third hackathon, I can state with certainty that this one was unlike any other. None of the 100 hackers from 33  countries experienced anything remotely comparable before.\n\nThe topic of the event was to develop solutions how blockchain technology can help fighting climate change.\n\nFirst let me explore how the event differentiated from other hackathons. The hacking session was 24 hours, but the whole event lasted four full days. There were pre-workshops around the world. 100 participants were selected and invited to Bonn. Travel expenses were covered. We stayed on a five star hotel ship. It was adjacent to the UN climate conference. We had balcony suites on the ship. The food was appropriate for a 5 star ship, complete with wine to every dinner. The days before and after the hacking session were filled with interesting talks, a guided city tour, interesting discussions and lots of networking. There were so many interesting people and so much to talk about. At the last day they wanted to make a photo of us on the boat in front of the UN building. Drones were forbidden in the security zone, so the photographer rented a crane to get the perfect shot.\n\nI knew nobody from the event in advance. But I knew that out of the sub topics, I was most interested in \"sustainable transportation\". At the team building session, I headed straight to the guy with the most interesting pitch that contained something about cars. Our team was formed son after, and I had a good feeling from the start. Two were from Singapore who already knew each other. Two were from India one living in San Francisco and the other in China. And one was also from Switzerland, but we didn't know each other before.\n\nWhen the hack session started at Tuesday noon, we shaped our rough ideas into a project that we could realize in the short amount of time. Then everybody stated what he would like to do. It all seemed to fit together wonderfully. I wanted to implement the smart contract. I didn't have much experience in that area, and was grateful that the others could help me and answer my questions. Rather than drawing large diagrams, we collaborated on the interfaces, and then worked towards these. We didn't hit mayor roadblocks or problems, everything seemed to flow in place. Most of us agreed that we are not productive after 2AM and that is is better to get some hours of sleep. In the morning we went out to shoot a video of our product in action.  The guys from [SBB](https://www.sbb.ch) (who was a sponsor of the event) were around us most of the time. They helped where they could, and were generally very interested and engaged. We had many great discussions with them.\n\nOur project was about end to end transportation. On the mobile app, you select a destination, and it identifies legs to use different means of transportation. We focused on car sharing, but other options include trains, bikes or buses. Our smart contract abstracts a car that can be rented over the [ethereum](https://ethereum.org) blockchain. The owner of the car registers it by creating an instance of the smart contract. A person who wants to rent it can do so by sending [ether](https://ethereum.org/ether). The required amount is determined by the price per km the owner wants, times the number of km the renter wants. If he doesn't use up the credit, the rest is reimbursed at the end of the trip. But if he drives too far, the cars performance is degraded by the smart contract. The car was represented by a [RaspberryPi](https://www.raspberrypi.org) running an [ethereum](https://ethereum.org) node and our backend running on [nodejs](https://nodejs.org). Initially opening the car was indicated by an LED attached to the [RPI](https://www.raspberrypi.org). But to make it more realistic, the [RPI](https://www.raspberrypi.org) then called the [Tesla API](https://tesla.com) to open a real car. At the end of the trip the [RPI](https://www.raspberrypi.org) collected information about the car such as odometer and battery level as well as firmware version, stored it on the [IPFS](https://ipfs.org) and registered the [IPFS](https://ipfs.org) address with the smart contract to form an unfalsifiable audit trail. Last but not least, one of our team members used data from moving cars and turned it into an appealing 3D animation that highlights the hot spots in a city.\n\nWe were thrilled all along, even more after all the positive reactions to our presentation. And hooray, we made it into the finalists! That meant, we could present our project at the COP. That's the fair for NGO's which is attached to the UN climate conference. The team that won the hackathon, did so deservedly. Their project was about incentivizing land owners not to cut their trees. They used blockchain and game theory for the monetary part. In addition they trained a neuronal network to predict areas which are endangered most of deforestation, and need special attention.\n\nA first official [video appeared here](https://www.facebook.com/Connect4Climate/videos/1924336437591671/?hc_ref=ARQQP-_cCZzWPzPRQDoF8YITG_rusF-GXKLRX7gL-7msL2jVUN4IEMjnaHLRVF2lVjE), and I'm sure others will follow on [the official website](https://www.hack4climate.org).\n\n<h3>Update Dec 16 2017</h3>\nThe official after movie of #hack4climate was released:\nhttps://youtu.be/UOANny6i0QM"
		},
		{
			"post_id": 26,
			"title": "Road trip to Norway with the Tesla",
			"date_published": 1502135477.878,
			"body": "Our last road trip was a while back. After we returned from [South America](/1MrcCZjfRCKeJZAENsjDqf7dvDhEhFpsXY), we planned that our next big trip with the Büssli would be to Scandinavia. But we figured that family holidays with small kids are better stationary at one camp ground. Now that the kids are old enough, we didn't trust the Büssli enough for such a big trip. Reliability of the vehicle becomes more important the more people are traveling. Since we have now a very new (for our terms) vehicle, we figured it was time for our next road trip. Let's drive to Norway with the Tesla!\nMany people still think electric cars are not suited for long trips. That might be true for some, but a Tesla is up to everything!\nFirst the important facts:\nDuration: 15 days\nDistance covered: 5'000 km\nElectricity charged: 1'088 kWh\nWaiting time for charges: ZERO\nCost for charges: CHF 41\n[Our route on a map](/norwegentesla.bit)\n<h3>Transit</h3>\nWe knew that it would be a long trip from Switzerland to Norway and back. The kids need to be able to run around every day. So driving it in one go was out of the question. Also my wive is not comfortable enough to drive the new car in a foreign country yet, hence I had to drive it all by myself. She also didn't want to drive during the night. So we had to expect some traffic jams, and split the distance roughly in half. Both ways we slept in the Hanover area. We chose not do drive all the way around trough Sweden, but take the fairy from Denmark to Norway. To make the route in Norway more like a one way, we took the fairy back from Bergen to Denmark. Spending the night on the boat, we were ready to drive trough Denmark in the early morning.\n<h3>Charging</h3>\nWhile on the road, we mostly charged at the Tesla Superchargers. The navigation system does a great job, planning the required charges. The Superchargers once again proved to be just great. If possible we also charged over the night. But we didn't stay in the fancy hotels that have destination chargers. Instead, all we got on the camp grounds were Schuko outlets. Not only is the charging slow, but more than once, the charge stopped in the middle of the night because a fuse blew. It was always enough to reach the next Supercharger. In Bergen the main parking provided 54 free type2 chargers with 30A one phase. The only two other charges were in the Stavanger area. We stayed at the Lysse Fjord for a few days, and the next supercharger would have been more than half an hour away. Stavanger is Norway's offshore oil industry center. So it is not such a big surprise that there were less EV's in that area. I ordered a free RFID tag from Fortum before the trip. They have a decent charging network in Norway. So I charged twice with Chademo.\nWe tried to charge while having our meals, when shopping, and when somebody needed to go to the toilet. When we came back, the car had always enough energy to continue the trip. We NEVER had to wait for it to charge. I think this is a big takeaway from our trip.\n<h3>Environment</h3>\nObviously an E.V. has no emissions. But this is only fully true, if the electricity doesn't come from a coal plant. We have a reasonably clean electricity mix in Switzerland. Mostly hydro power, some nuclear and a tiny rest. Tesla promised that on the Swiss Superchargers, they only use energy from renewable sources. I recently confirmed that the electricity we use and charge at home comes exclusively from hydro, mostly local.\nNorway has a massive amount of hydro power plants, and considerable wind power. I would be surprised if they had any electricity at all from non renewable sources.\nBut Germany has a dirty energy mix in general. They burn lots of coal. In the past decades they made huge progress in efficiency and reducing pollution. But that can't do away the CO2. I read an article from 2015 that Tesla Germany was in the process of migrating all the sources of the electricity for their Superchargers to renewable. So I assume that they should be complete by now. In fact I saw massive solar arrays adjacent to many Superchargers and wondered if they were related. I assume the same holds true for Denmark.\nThat leaves me with the 10kWh that I charged over night from a regular German power outlet, which probably contained some coal energy. This equates to 1% of the electricity of the entire holiday trip. Plus the fairy boats burned some form of oil. Their use per passenger is difficult for me to quantify.\n<h3>Climate neutral</h3>\nA few days later by coincidence I found [MyClimate](https://www.myclimate.org/) where you can compensate the CO2 pollution of a variety of activities. That brought me to the idea, that I could make our holiday climate neutral. They have calculators for different types of emissions. Although not exactly the ones I was looking for. For the fairies I used the cruise ship calculator, and for the brown electricity the house heating calculator, that allowed me to specify German electricity and how much. The calculated sum was 0.966 metric tons of CO2. To compensate, [I donated CHF 27](https://ipfs.io/ipfs/QmZPFzADSC5hVd9pZtxxqe95LoGU6e2YkPdLhPwRyEzcip) for climate protection projects. What really surprised me was how much pollution a cruise ship emits, even compared to a gasoline car.\n<h3>Kragero</h3>\nThe first destination in Norway was Kragero. It has some nice islands in front that are part of a nature protection area. The flat that we booked over AirBnb had a nice view over the sea. We visited a small island that was connected with a bridge and hosted the remains of an old fortress.\n<h3>Dalen</h3>\nThere is not a lot of Bitcoin activity in Norway. But on [coinmap.org](http://www.coinmap.org/#/map/59.47752266/7.97950745/10) I found a camp ground. It is run by Dutch people. My wive was pleased by the clean toilets. As chance would have it, Dalen also has the most beautiful hotel in Norway. We didn't stay there, but we had a drink in comfortable leather seats while listening to the piano in the big hall.\n<h3>Farsund</h3>\nAfter the shower facility of the cabin we booked didn't meet my wives expectations, we drove on to Kristiansand. All the way we tried to find a place to spend the night. In the rural areas there were many signs for cabins. But we saw none of them when we got closer to the sea. We ended up in a camp site with a beautiful beach. The sanitary installations were far worse than what we dissed before. But it was too late to search something else. When we arrived a 9pm, I set up our tent. The night was too cold for my wife, even though she was the only one with a sleeping bag for sub zero temperatures. So this was to be our only night in the tent. The next morning we went to the beach, but the sea was just too cold for us to swim.\n<h3>LandaLand</h3>\nThe famous Lyssefjord is a very touristic area. Thousands of people walk up to the Preikestolen every day. We had a small room at the LandaLand for three nights. The first day we drove around the fjord trough the mountains and down the 27 steep curves. From there we took the fairy trough the fjord.\nOn the second day we hiked to the Preikestolen. We started early through the well prepared trail in light rain. There were lots of people, but not nearly as many as in the stories of other people.\nThe third day there was a nice event in LandaLand. The kids could shoot with bow and arrow, cast some tin and cook pancakes over the open fire. Later we drove to Stavanger and visited the oil museum. It was very interesting. They seemed to be open to all the questions about the environment. But of course their angle is slightly different than ours, driving an E.V. I was mainly interested in the technical aspects of the drilling platforms, deep sea exploration and submarines. These parts were very informative. Finally we had a delicious dinner at the food festival.\n<h3>Voss</h3>\nNorwegians love outdoor sports, and Voss is most known for it. On the way there we saw some more beautiful fjords and waterfalls. Every camp ground and every hotel and every holiday flat in the vicinity of Voss seemed to be fully booked. After a long search, we found a family room in the youth hostel. I could finally make the first flight with my paraglider in Norway. Since all the cable cars were closed, I had to walk up. This marked the 20th country for me to paraglide. Numer 19 was Korea in 2009. Initially we planned to stay some days in Voss, but the weather was getting worse and the city center was not that great. Since we saw lots of fjords already we thought the Sognefjord couldn't be that much different. So we decided to spend the last few days in Bergen.\n<h3>Bergen</h3>\nWe were very lucky with the accommodation that we found on AirBnb. We spent two nights in a nicely prepared basement apartment hosted by a lovely retired lady.  Also the city was nice. In Bergen we saw way more electric cars than in the regions visited so far.\n<h2>Payments</h2>\nOne strange thing was that the restaurant where we had lunch in Bergen didn't have a toilet. So we went the the shopping mall. But the toilet had a card reader attached. It wouldn't work with a regular Maestro card. And I had to try multiple times to figure out how to open the door with my Xapo Visa debit card. Even the toy cars where the kids can ride in the shopping mall are card operated. In Norway almost everything is payed by card. Some might call it progress, to me this is completely derailed."
		},
		{
			"post_id": 25,
			"title": "Driving the Tesla",
			"date_published": 1492542030,
			"body": "It is now almost three months and 7'000 kilometers. So I thought, I write a small review for my Tesla S85.\n<h3>Silence</h3>\nThe immediate most notable difference when driving an electric car is the absence of the engine noise. People who drive big engine gasoline cars often assure how essential this is to their driving experience. I was curious how I would feel about that myself. The V12 has a distinctive sound, but in the Jaguar it is not amplified at all. Instead it is running very silently. I also had my \"hey look, my ride can produce louder noises than yours\" days when tuning mopeds. But that ended when puberty was over.\nPeople coming from diesel engines don't seem to miss the sound as much as the petrol heads. After all, most diesel cars still sound like tractors.\nTurns out, it is incredibly peaceful to drive along in complete silence. I missed the engine noise not a single time. There are occasions where pedestrians or cyclists [didn't expect a car to be so close](http://gizmodo.com/electric-cars-must-now-make-noise-and-we-have-some-sugg-1788970784), but that is just something to be a bit more alert. And there is the occasional awkward situation when somebody clearly never saw an electric car before and stares at it in disbelieve.\n<h3>Controls</h3>\nThe most notable difference when you enter the car is the absence of any controls other than what is around the steering wheel. Instead there is the gigantic touch screen in the center. It controls everything from the navigation system to the music to the suspension to the sun roof to the interior and exterior lights and almost everything else. After reading books about haptic user interface design, I expected this to have occasional disadvantages. There is obviously something to it, to have the switch for the sun roof located next to the sun roof and being able to operate it blindly. But I got used to managing everything with the touch screen quicker than I anticipated. And it has many advantages of its own. It gives much more control, and can be changed with over the air software updates. And it is generally easier to learn. Let's not forget that the car does most of these things automatically anyway. \nAnother notable control that is absent is the gear selector lever. There is a handle to switch between \"D\", \"N\", \"R\" and \"P\" attached to the steering wheel column. But it doesn't allow to restrict the (not present) transmission to lower gears. If you like to drive curvy mountain roads in a sporty manner, you may think you'd miss that. But think about it for a moment longer. The only two reasons you shift to a lower gear before a curve is to decelerate and have more torque available for acceleration. The Tesla not only decelerates when you lift your foot before the turn, it converts the kinetic energy back into electricity and stores it in the battery. And when you hit it again, the torque is immediately available without any special manipulation. In effect, the only reason for wanting a gear stick back is nostalgia.\n<h3>Software</h3>\nAs cars get more and more computerized, and as I read stories of cars getting equipped with mainstream mobile operating systems, I started to worry. I never wanted a car running [iOS](http://www.mercedescla.org/forum/64-cla-problems-issues-complaints/22529-apple-carplay.html), [Android](https://www.theregister.co.uk/2015/10/08/porsche_google_android_autho) or god beware [Windows](http://fortune.com/2016/10/07/myford-touch-lawsuit/). So I was relieved big time when I learned that the Tesla cars [run on Linux](http://www.autoblog.com/2014/04/12/tesla-model-s-owners-hack-their-cars-find-ubuntu) and have a Qt interface. This is absolutely the best choice and I salute the engineers to it. Tesla is often described as a technology company, rather than a car company. That certainly shows in their technology decisions. As a software developer, I can attest them that they are all very sound. This trend continues with the later models, and how they react to problems with the older autopilot hardware. One further instance where I can applaud them is how they handled reports of a security vulnerability in their mobile app. They acknowledged it and were very quick to push an improved version. This is in stark contrast to other car manufacturers who try to neglect for as long as they possibly can.\n<h3>Security</h3>\nTesla stated many times that security is their single most important concern. This was mainly about safety on the road. But also their security practices with regard to the computer systems seems to be sound. Except for one thing. To gain control through means of the remote app, only an eMail address and a password is required. This in turn allows you to open the doors, start the car and drive it. Adding two factor authentication would be much preferred. And if you are at it, make is solid hardware based like FIDO U2FA.\n<h3>Mechanics</h3>\nOther car companies (especially from Germany) moan about lower quality, but so far I found nothing that would back that claim. They also badmouthed Jaguar for that, while I had many more problems with German cars than with English ones. They go to great lengths explaining how their gap dimensions are tighter, giving them better aerodynamics. But hey, go on priding yourselves with efficiency improvements from 35 to 36% while the electric drive train starts above 90%.\nWith petrol engine and gearbox transmissions out, there are far fewer parts that can break and that need maintenance. One common meme is that a Tesla has exactly six consumable parts: 4 tires and 2 windshield wipers. No oil, and a much smaller and easier coolant circulation also put an end to smeary puddles on the parking lot.  \n<h3>Improvements</h3>\nNothing is perfect. The one thing that worries me and many other Tesla owners is the [maintenance cost after they run out of warranty](https://news.ycombinator.com/item?id=11233898). Yes there is less stuff that can break. And reports from what I read so far attest that the prices for spare parts were reasonable. Further, Elon promised that they don't want to make too much money with repairs. But the repair manuals are very hard to get. And there are reports where they denied to deliver spare parts. So in essence we are very dependent on their goodwill. More so than I like. One thing I already found out is that the hourly rates are much higher than what the company charges, where I had my cars fixed so far. I'm looking forward for a haynes manual at least.\n<h3>Environment</h3>\nOne thing that I didn't expect to make such a big difference, is the good feeling from caring about the environment. Of course there are people who try to discredit all the benefits. The biggest part is CO2, but also apart from that, ICE cars emit lots of other toxic gases and dust. Even if coal was used to produce the electricity, the plants would have far better filters an no cheating software. If you look at the whole chain, there are no oil tankers, no exploding oil drilling platforms and no enormous pipelines required to power an electric car. The metric to look at the whole value chain is called \"[well to wheel](https://www.teslarati.com/energy-expert-says-tesla-electric-vehicle-industry-here-stay)\". The difference in overall efficiency is gigantic.  Gasoline cars are at 12% while electric cars are somewhere between 32% and 70% depending on the source of the electricity.\nThere is still a [lot of education](https://www.e-spirit.net/english-1/) to do.\n\t\n "
		},
		{
			"post_id": 24,
			"title": "Choose your bleeding edge",
			"date_published": 1491939592,
			"body": "Are early adopters usually interested in only one new technology, or generally forward looking and open to innovation?\nI encountered multiple startups that seem to assume the former. As a company you want to make your product available for a large number of potential users. But who are your potential users? Sometimes you have to choose one or more platforms where you make your product available. This decision is especially important for startups with limited resources. It might be a difficult choice. Either exclusively opt for an established platform with a large user base. Or add support for an emerging contender with fewer users. Now I would argue those fewer users are more likely to try your new product. This is because if you already use bleeding edge technology in one field, you are more likely to experiment with innovative new ideas in other areas as well. But this is only my humble opinion. Of course there are more potential users on the legacy platforms. But how many of them are there because they were told so, and would never venture into something new on their own?\nLet me list a couple of examples I ran into:\n* Ubuntu phone is still a relatively new operating system for smart phones. Canonical canceled their efforts on it last week. I'll keep using it because it is still the best option if you value your freedom. But there are a few things about it that I really don't understand. For somebody to choose ubuntu phone, one has to be dissatisfied with the existing, well established alternatives. Probably you don't like the paternalism on the iOS platform, and the privacy intrusions on Android. So why does UP ship with no real email app installed, but only a gmail web app? This is not giving them what they are used to, but trying to force them into the very thing they are trying to escape. Why would they ship with google as the only option to synchronize PIM data from the settings screen? And why would they still after 2 years only add OwnCloud to the GUI? Is it really so hard for Canonical to imagine that people store their contacts and appointments on a standard CalDAV store using their own Ubuntu server product? Don't get me wrong on that. It is great to be open to competing platforms. But to penalize your own users is clearly not the solution.\n* Tesla make awesome cars. They are at the forefront of innovation for electric vehicles. And they are pushing the boundaries of autonomic driving for consumers. Yet they still only accept ancient forms of payments for their products and services. Out of all the stories of cars bought with Bitcoin, Tesla is mentioned most often by a big margin. Yet all those stories are with resellers and/or used cars. They also have no public plans to include a modern BTC wallet into the car software for paying electricity, parking or roads. Since the car runs on Linux and Qt, it should be relatively easy to integrate a light wallet like electrum. In addition, their remote control app is available only for Android and iOS.\n* There are many options to pay for the electricity when charging an electric car. None of them is convenient. One should assume that companies that are innovative enough to provide services to modern cars involving some form of value transfer should be open to the latest (eight year old) advances in payments technology. Yet I am not aware of a single charging station that is in production where I could pay with Bitcoin for the charge. Instead there is a company that develops a blockchain based solution that introduces even more friction rather than to remove it. They offer their proprietary app for (you guessed it) Android and iOS. You have to buy their tokens beforehand and you can only pay them with credit card or paypal.\n* Steemit is a social platform that rewards users for writing and curating. They want to differentiate themselves from the giant centralized networks. With their ties to blockchain, they seek to please a decentralized crowd. But you cannot sign up if you don't have neither a facebook nor a twitter account. That's like a horse is required to acquire a car.\n\nTurns out if you want to make use of innovative new technology on multiple orthogonal fronts, you can have a really hard time.\nI really don't get it why technology seems to advance in any given directory in isolation. It is like saying you can either have a color TV or stereo sound, but not both. Things converge eventually, because you can have AC in your car and not just at home. But why aren't they bundled at an early stage?\nThe largest group of people does not necessarily contain the largest number of people to potentially experiment with new products. They might have left the old world already. Sure you want to have them all as customers at last, but the early adopters might help you to get there. And the early adopters have slightly different requirements than the eventual end users.\n\n"
		},
		{
			"post_id": 23,
			"title": "Quality",
			"date_published": 1490354743,
			"body": "<h3>Quality is important</h3>\nDuring the apprenticeship at [Victorinox](http://victorinox.ch) we were indoctrinated with \"quality above all else\". The teacher told us that also in our private lives we would be better off buying quality products even if they are considerably more expensive than throwaway products. Part of it stuck with me ever since. But I relaxed the rule somewhat. I usually assess how much I am going to use a product before I buy it. If it is a tool I expect to only need once a year, I buy a cheap one. The good ones are for people who need them in their everyday work. \nBut shoes are something entirely different. When I switched from the machine industry to software development early in my professional career, live became better. Shortly after the salary hike, I visited a [shoe store](https://www.city-luzern.ch/citycard-luzern/annahme-und-verkaufsstellen/item/schuhhaus-imgrueth-ag.html). When the sales lady talked me into buying a pair of fine English goodyear shoes, I reminded myself that quality pays off in the long run. I have had these very same shoes for 19 years. I used them a lot and they are still very comfortable. Over the years, they needed some minor repairs. From above they still look perfectly fine, but now they are worn off, so that a bigger repair would be required. The cost would be about half of what a pair of new ones cost. I hesitated a while. Nineteen years is already quite remarkable, but how cool would it be to have 40 year old shoes that are still in regular use? On the other hand, by buying the [almost same model](http://www.koala.ch/en/shoes/8735-fr-victory.html) from the same manufacturer at the same store, I am rewarding them for their exceptional work.\n<h3>Economics are even more important</h3>\nProducing quality products is unfortunately no guarantee for success in our society. A school mate once told me that his father worked as an electrician in New York. He was fired because the stuff he did never broke. \nQuality control is well understood in the mechanical manufacturing industry. We worked with precisions of 0.01mm on a daily basis. It is also understood on the broader scale. Companies rigorously test their products before going into mass production.\nBut it is an entirely different beast in software. There are many facets to it. They range from not crashing, deliver expected results in all edge cases, robust against malicious attacks, execution time, energy efficiency, to maintainability of the source code. As an engineer, it saddens me to no end to witness that companies with the [lowest quality software](http://microsoft.com) do so well economically. What could be the reasons for that? What is so different in software from hardware? The most obvious difference is that software can be patched so easily. Found a critical bug? Just push an update that fixes it. I used to say that software is newer and not as well understood as other disciplines. But after 17 years in the field, I no longer think of this as a major contributing factor. After all, the mechanical first industrial revolution happened also not a lot more than 100 years ago. I think the customers or end users are responsible to a large degree. As long as companies can sell sloppy products with aggressive marketing, why should they invest into quality? I hope that the digital natives, that are growing up with ever more technology, have a better understanding. But it might also be that they accept the current state as the reality we live in."
		},
		{
			"post_id": 22,
			"title": "Charging electric vehicles with Bitcoin",
			"date_published": 1489434343,
			"body": "In my [last post](?Post:21:Charging+electric+vehicles) I ranted about the current payment methods for charging E.V.s. The electricity for a full charge of an electric car costs something in the range of $2 to $20. But most of the time, we only need a partial charge. [Credit cards](https://ulrichard.ch/blog/?p=1519) impose enormous fees on low value transactions, and require expensive equipment. PayPal even adds on top of that. This is why some energy providers opted to use RFID membership cards. Unfortunately there are many of these. Most have excessive annual fees. They are mostly incompatible island solutions and they [usually offer bad deals](https://www.heise.de/newsticker/meldung/32C3-Bei-Stromtankstellen-ist-vieles-schon-kaputt-3056942.html). So let me explain why [Bitcoin](https://bitcoin.org) offers the perfect solution here.\n<h3>Machine to machine</h3>\nSome [car manufacturers are already looking into equipping their vehicles with digital wallets](http://bitcoinist.com/mercedes-bitcoin-digitization-strategy/). And some [power companies are looking already into blockchain payments](http://www.coindesk.com/german-utility-company-turns-to-blockchain-amid-shifting-energy-landscape). So the [car could pay directly for the power](http://t3n.de/news/blockchain-elektromobilitaet-725714). This can be done exactly and trustlessly with use of [Bitcoin payment channels](https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/). The [cars already communicate with the charging terminals](https://en.wikipedia.org/wiki/IEC_62196#Signaling), so payment would be just one more stream of information. Because Bitcoin accounts don't need to be tied to a person, and you can create as many accounts as you like, it is no problem to have a separate account for the car. Or you can share an account between your car and other devices. Whatever fits your use case best. The same goes for the infrastructure provider. He can maintain a separate [hierarchical deterministic wallet](https://en.bitcoin.it/wiki/Deterministic_wallet#Type_2_hierarchical_deterministic_wallet) for every charging station. It would even be relatively easy to put a protocol in place where the charging station doesn't even need an Internet connection by itself. Instead the car or the consumer could present a proof that was signed by the energy provider that a valid payment was made. The possibilities are endless.\n<h3>Accessibility</h3>\nBitcoin wallets [exists on almost every operating system](https://bitcoin.org/en/choose-your-wallet). Most of them are open source. This is in stark contrast to proprietary apps that some charging providers advertise. If they have one for Android and one for iOS, I'm out of luck. It won't run on my Ubuntu phone. \n<h3>Transaction costs</h3>\nWhen I started with Bitcoin in 2011, transaction costs were really neglectable. They were optional, and usually a fraction of a penny. For a long time they were at about two pennies, which is still minor. Only recently they started to raise to about 20 pennies for an average size medium priority transaction. This is still comparable to Maestro cards, and way below credit cards. But it is not so great at the moment for micro transactions. The reason for this is that the block size is capped and the limit was reached. Thus a fee market emerged, where you pay a higher fee to have your transaction included in a block sooner. The Bitcoin community is in deep crisis over this. It is not as bad as it sounds though. Because Bitcoin is an open, distributed system, there is no dictator or board of directors who decides the course behind closed doors. Instead the discussion is held publicly. Everybody who feels he has something to contribute, can take part. It can take longer to come to an agreement, but the chances of getting a good solution are maximized this way. Consensus is something sacred with a trustless distributed network such as Bitcoin. So trust me, the [fees will decrease again](https://www.cryptocoinsnews.com/high-transaction-fees-arent-big-issue-bitcoin/) one or another way. If we can even call it a problem when comparing with other options.\n<h3>User agreements</h3>\nDo you know somebody who likes user agreements? Do you know somebody [who reads everything he signs](http://www.blick.ch/news/schweiz/zentralschweiz/tag-heuer-tappt-in-online-falle-keine-uhren-sause-auf-dem-ruetli-id6360849.html)? I don't, eventhough I force myself to read more than I would like to. If a multi page agreement is required to sell something or to make use of a service, that is a clear indication that there is something wrong with the design of the product. If I see an overly lengthy agreement before I can use something, I get offended and run away. The occasions where it is difficult to find a better alternative are few and far between.\n\nIf I buy a hammer in a store, I don't have to sign neither the seller nor the producer off a liability in case I break something with it. If I buy a power tool, I don't have to sign a letter to make nobody reliable if I electrocute myself. Even the company delivering the electric power cannot be held responsible if I get an electric shock. And I don't have to sign them off before they would deliver electricity to me. This is because there are rules and regulations and certifications. We know how these tools are supposed to work, and we make sure they do so.\n\nSo why do I have to sign pages of incomprehensible legaleeze before opening a bank account or applying for a credit card? Why do I have to sign a user agreement when I want an RFID from one of the power providers for E.V.s? Why do I have to sign off my privacy rights before using an online service? Because the product is poorly designed!\n\nI don't have to sign anything to open a Bitcoin account. Not even if I want to create a million Bitcoin accounts. I can just do it. Bitcoin is asset based. So whoever or whatever is in control of the private key can spend the funds. Clear and simple.\n<h3>Clear and simple</h3>\nCharging an electric vehicle should be at least as simple as fueling a gasoline car. You can usually pay in cash or debit card. I heard that there are charging stations that you can pay in cash. So far I found only one. During a short flight yesterday I charged the car at the [Swiss Holiday Park](http://www.goingelectric.de/stromtankstellen/Schweiz/Morschach/swiss-holiday-park-Dorfstrasse-11/9018/). This was actually the first time I payed for a charge. It was a good service at a reasonable fee. \nOnly Bitcoin could make the experience even better.\n\n<h3>Update Jan 2018:</h3>\nMeanwhile I have had a charger in the garage at home for half a year. Charging like this is awesome!\nAll my reservations against the RFID cards at the public charging stations were just confirmed by a talk at the 34c3:\n\nhttps://media.ccc.de/v/34c3-9092-ladeinfrastruktur_fur_elektroautos_ausbau_statt_sicherheit\n\n<h3>Update Jan 2019</h3>\nIt seems some things are moving into the right direction, albeit at a slow pace:\n[A Security Model for Electric Vehicle and Charging Pile Management Based on Blockchain Ecosystem](https://ieeexplore.ieee.org/stamp/stamp.jsp?arnumber=8306865)\n[Building a Private Bitcoin-based Payment Network among Electric Vehicles and Charging Stations](http://www.people.vcu.edu/~ebulut/blockchain2018.pdf)\n[Japanisches Unternehmen testet Bitcoin-Zahlungen im Lightning Network](https://de.cointelegraph.com/news/japanese-electric-company-tests-bitcoin-lightning-network-payments-for-car-charging)"
		},
		{
			"post_id": 21,
			"title": "Charging electric vehicles",
			"date_published": 1488929058.855,
			"body": "<h3>First experience</h3>\nIn a month of driving the Tesla, I collected some experiences but I feel I'm still a newbie. Charging is obviously very different from fueling a car. I gathered some information before buying the car, but it turned out I still had some misconceptions. The first thing I realized on the day after picking up the car. In retrospect I'm not sure why I was so fully convinced that there was a supercharger at the service center in Cham. It was somehow part of the decision to buy the car. So I drove to work, and the car displayed a warning that the battery would run low, and I should look for a charging opportunity. But it only suggested some hotels with destination charging in the area of Zug. Unimpressed, I drove to the Tesla Service center in Cham, and started looking around for the supercharger. A friendly employee informed me that they didn't have any of these here. But I could charge it at their 22kW plug. While it was charging, we registered the ownership change, and I could look around in the shop. Another employee showed me [lemnet.org, a website that displays charging stations on a map](https://lemnet.org).\n<h3>Near the work place</h3>\nWith this site I found three charging stations within walking distance of my work place. All three were listed as free and without restrictions. The closest one has two parking spots that are very visibly marked for electric vehicles. But after I plugged in the car for the second time, somebody informed me that they are intended only for customers. Ok, nothing wrong with that, but then it should be corrected in all the websites. I sent an email to the company that I would be willing to pay, if I could charge there regularly. So far I didn't receive a reply. The next one is at a dealer for German cars, where my brother bought his eGolf. It would even allow for faster charging, if I had an adapter. Sometimes it is occupied. The third option is in a shopping mall. They have at least 4 spots, and so far I always found an empty one. Power is free, but I have to pay for the parking. And sometimes it only delivers 11kW. So for these three options it usually takes half a day for fully charging up. It is walking distance, but to drive the car to the other side of the railway tracks during the lunch break is almost 5km.\n<h3>At home</h3>\nObviously the best option to charge an E.V. is during the night at home. Electricity is cheaper during the night, and the car is idle anyway. My brother was responsible for the electrical installations at the building we currently live. He told me that it would be no problem to install a charging possibility in the subterranean parking. A cable rail already runs from the distributor and electricity counters to exactly our parking spot. So I thought I would obviously get the permission to have a plug installed. To my big astonishment, I received the refusal only after I bought the car. When I asked for the reason, I only received a vague excuse.\n<h3>Near from home</h3>\nPublic charging options are not so great where I live. There is one across the street, but with a really bad deal. More on that later. The next would be at the lake front with a Hotel. That might be an emergency option to have dinner there, when the car needs an urgent refill. Then there are the shopping malls in the neighboring towns which offer free power and even free parking while they are open. But the amount of power is limited so that charging takes longer than even the longest shopping marathon. There are good charging stations in a 10km radius, but I have to combine this with another activity.\n<h3>At the work place</h3>\nIn the meantime I asked my employer, if I could install a plug at the parking in the office. Of course I would pay for the installation and the power. He has to check with the owner of the building. So an answer is still pending. So much to day to day charging.\n<h3>Supercharger</h3>\nFor longer trips, there are obviously the Tesla superchargers. They are simply great! They are even greater after you explore other options. The navigation software plans supercharger stops into the trip, and calculates the remaining battery power at the destination. Not only that, but it even displays how many stalls are occupied before you arrive at a supercharger. You get there, plug in, and wait for it to charge up while drinking a coffee and going to the toilet. Of course it takes longer than fueling gasoline or diesel. But compared to all other E.V. charging options available today, it is more than twice as fast. Once you charged enough, you simply pull the cord, and drive on. I never had an issue with a supercharger. They simply work great. Most of the time for longer trips, superchargers are all you need. You might have to drive minor deviations, but that's usually fine.\n<h3>Other public charging infrastructure</h3>\nNonetheless, I wanted to try other charging stations. There are many more charging stations than I anticipated. Even remote towns usually have more than one. Fast charging stations are fewer, but still plenty. I'm still hesitant to buy the CHADEMO adapter for fast DC charging. But whether it is DC fast or AC slower charging, is only one distinction. The more important one turned out to be whether it's free or not. In general I am not opposed to paying for a service I consume at all. Quite the opposite. I believe that if I pay for a good service, then it will be there also in the future, and maybe even improve further. But so far I never payed for charging. And the reason is simply that I could not. I have no exact data, but my impression is that about half of the public charging stations are free at the moment. Of course this won't stay that way forever. It is more like a promotion, and the sponsors range from cities to energy providers to shopping malls. Half of the remaining stations support payment with NFC enabled credit cards with a hefty additional fee. Since I don't have a credit card, I couldn't make use of that option. What is left is a jungle of RFID cards and physical keys and whatnot. There are countless offerings where you pay an annual fee of usually around $100. This will give you access to a number of charging stations whose number and distribution wary greatly. For some offerings this flat rate is all you pay. For others you have to pre-pay, and still others will send you an invoice. The prices are sometimes per kWh, sometimes per hour and sometimes a combination. Most of the time it is not transparent what you would pay. With one operator you can send a text message that would charge your mobile a one time fee of $8 for one hour of charging. You could call this extortion of people with empty batteries. To make a long story short, paying for charging electric vehicles is pure horror. I don't plan on making use of the offerings I encountered so far. Instead I wait and hope and suggest that it will soon be possible to pay with Bitcoin. This would be a match made in heaven.\n<h3>Frequency of charging</h3>\nThe first thing people usually fear with E.V.'s is what would happen when the battery runs flat. Granted, that is not such a nice thought. And I'm not intending on finding out. The cars navigation system does a great job at helping to avoid such a situation. A friend of my brother reported to being able to drive for quite a distance after the indication for the remaining distance went to zero. This is probably not very healthy for the battery. During regular operation you usually don't charge above 90%. This has two reasons. On one hand charging gets slower the closer to full you get. And on the other hand, it is also better for the health of the battery not to fully charge it too often. So 100% charge is in preparation for longer trips. But I also don't feel too confident to go below 15% in regular operation. The reason is that should something unexpected come up, I want to be able to drive to e.g. the hospital and back and then still be able to reach a charging station. For all of these reasons I charge the car usually three times a week.\n<h3>Proprietary standards</h3>\nEven if the plug of the Tesla is a standard Type 2, it makes use of proprietary extensions. No other cars can make use of the superchargers, even if the plugs would fit mechanically. I am usually strongly opposed to such practices. If it was on a larger scale it would be monopolistic. I believe that open standards and interoperability are very important. So why do I support a company that develops their secret sauce? Tesla is still a startup compared to the incumbent car companies. Even if they have great successes by any metric, it is not granted yet that they will succeed long term. I certainly hope they do! Tesla has an advantage with knowledge in electric vehicles, with batteries and charging infrastructure. The traditional car manufacturers have an advantage in mass production and supply chain management. Both are catching up to each other. Now it is important that the intersection will happen at the right spot. I hope Tesla will open up their charging infrastructure to other cars in the future, even if that could imply that I will have to wait in line some day. But it would be too early now. Tesla needs every advantage they have at the moment to succeed. The Model3 will be their grading test. Elon Musk displayed a healthy attitude in the past by sharing the patents, and with his remarks after Dieselgate. So I'm confident he will do the right thing."
		},
		{
			"post_id": 20,
			"title": "Buying a Tesla with Bitcoin",
			"date_published": 1486671632,
			"body": "The first car that I bought at age twenty was dirt cheap, and didn't last for more than two years. Then followed some Rover cars that were better, but also didn't last very long. I was always the last one to own a car before it was no longer economically viable to fix it. After a while I wanted something better, and bought a Jaguar. Later I wanted a camper and bought a Volkswagen. I have had these two cars for 15 and 12 years. In the meantime they are 33 and 28 years old. The Jag was never an everyday car, and I didn't use it when there was snow or salt on the roads anyway. Neither is the camper a typical everyday car. But as we didn't want a third vehicle it would have to serve for weekend needs. I went to work by public transport. Over the last years our beloved Buessli started to fail us, and we used it to sleep inside less and less. Part of the reason for having two cars was redundancy. But lately when the camper had engine problems during winter, we ended up without a working vehicle. We had to go skiing with public transport. After a while we became annoyed.\nThus we started talking about selling it and getting a regular car. My wive also wanted me to sell the Jag. But I was opposing strongly. Meanwhile my brother bought an electric car and rejoiced about it. In my head an idea started forming that I would be ready to sell the Jaguar, but only to get a Tesla. If only they were cheaper. We didn't want to wait for the Model 3. I would like the Model X very much, but the price was just too much. I would also like the Jaguar I-Pace, but it comes too late and again the price. So we started to look around for cheaper electric cars in general. One important condition is that the range lasts to the Wallis to visit the family of my wive. That's where most electric cars on the market failed. Peugeot announced one for this year, but nothing was around for a test drive. And it would be a very small car, not really suited for a family to go on holidays. \nReplacing our two special cars wouldn't be easy anyway. The Jag is a sports car with a V12 engine that runs almost as smooth as an electric. The VW Camper has lots of room and beds and a kitchen. And then the new one should be electric.\nA used Tesla S seemed to be the only option. It has enough range, enough space, enough power and is very nice to drive. But again the price ... Fortunately the price of Bitcoin kept rising over the past years, and my investments appreciated enough to make this a possibility. And I wanted to buy my next car with Bitcoin anyway. I had a \"Bought with Bitcoin\" sticker ready for quite some time. Still few people have enough experience with the magic internet money to sell a car for it. Tesla would not sell cars directly for Bitcoin yet. There are [a couple of stories](/1P9yJty4fzXkuGV3BSM4VSADr7xap2riAa/) of people who bought Tesla cars, but it was only through retailers. The closest being [Auto Outlet](http://www.luxurycollection.fi/en/uutiset/2016/07/we-accept-bitcoins/) in Finland. They would happily sell one to me, but the prices seemed to be even higher than in Switzerland. Reading up about car imports wasn't encouraging to say the least.\nSo I asked a couple of people who wanted to sell their cars in Switzerland if they would do it for Bitcoin. Most replied \"no\" straight away. I didn't want to talk anybody into something he doesn't understand. So I kept asking. One gentleman agreed if we would make the transfer at a broker. But then he sold the car before I could even test drive it. Yes demand is high, and they usually sell quickly. So when another gentleman replied with a price in Bitcoin, I knew I would have to act fast. The test ride was very nice, and the same evening I convinced my wive, just in time.\nYesterday we went to collect it. The boys keep asking me why it is not as fast as the Jag. I had to tell them a couple of times already that in the 15 years I have had it, I never drove it faster than the Tesla top speed. And the Tesla accelerates faster, which is more fun anyway. It is about 1 second faster to go from 0 to 100. Still far from the model with [ludicrous mode](https://www.engadget.com/2017/02/07/tesla-model-s-ludicrous-acceleration-record/), but more than enough for all practical purposes.\nThe car is truly totally different from any car I drove in the past. It's a blast, and hard to describe with words alone. People generally love their Tesla cars, [but this guy has a very good way of expressing it](http://theoatmeal.com/comics/tesla_model_s).\n[<img src=\"img/TeslaBitcoin.jpg\">](https://ipfs.io/ipfs/Qmexqx1wv8B8GBtC7Za64DVWyprMHzunBkgpY8JLRFAwGg)"
		},
		{
			"post_id": 19,
			"title": "Hackthevalley Hackathon 2017 Baar",
			"date_published": 1485810997,
			"body": "<h3>Motivation</h3>\nAfter the good experience last year at the [six fintech hackathon](https://www.six-group.com/about/en/site/hackathon.html), I was trilled to go to [hack the valley](https://hackthevalley.thomsonreuters.com/) which is even closer geographically and whose subject is even closer to Bitcoin. My goal was to gain experience with [ethereum](https://ethereum.org). So far I only completed the tutorials. I found the technology very interesting, but in the past, I couldn't come up with a good idea how to make use of it. Neither did I learn of a killer product that went live. This is in stark contrast to Bitcoin. When I first learned about Bitcoin, it was immediately clear to me that this was something very special, something that I waited for without knowing.\n<h3>Team formation</h3>\nIn contrast to the hackathon last year, most people already showed up as teams. I estimate that only about three of the fourteen teams were formed on site. I joined three guys from a bank in Paris, along with another French guy and a South African who lives in Zurich. First we had to decide on a project. We went through a list with a couple of ideas. But it turned out that for a lot of them it was hard to justify [what benefit a blockchain would bring](http://thinkingopensource.blogspot.com/2017/01/do-you-really-need-blockchain-or-could.html) compared to a more traditional approach. That is something I see a lot in the current blockchain hype. Showing up as a team with a formulated idea is a big advantage, as the technology and possible problem areas can be explored before. But In both occasions I enjoyed it to meet new and interesting people and see what we can achieve together in this limited time.\n<h3>Our project</h3>\nWe settled on the challenge \"fighting fraud in the supply chain\" with a project that puts smart locks on containers. The devices log all open and close operation on a blockchain. Unlocking operations would have to be authorized by a smart contract. The locks communicate through bluetooth low energy with an app on a smart phone. This in turn communicates to a backend that talks to the blockchain.\n<h3>Implementation</h3>\nShortly after we had the rough concept, the other team members stated that they would feel more confident implementing the smart contract in java, rather than solidity. That's why they voted for using [hyperledger](https://hyperledger.org) instead of [ethereum](https://ethereum.org). Setting it all up and getting the [docker](https://www.docker.com/) containers to work proved a lot more difficult than anybody anticipated. Not only had some team members Windows machines, but also on linux we faced a problem. Namely the docker containers were configured to use the google nameservers, while apparently all outside DNS was blocked by the Thomson Reuters network. The connectivity was generally very flaky.\n<h3>Infrastructure</h3>\nI enjoyed working with the team. But that we didn't know the infrastructure we were working on, complicated our work considerably. The last time I programmed seriously with Java was probably 15 years ago. And we didn't have good tool support within the environment. I'm sure it is possible to set everything up to work comfortably, but that would have cost us more time even than we lost with the complicated turnaround cycles. In the end, we couldn't complete our prototype in time. Sure, that is is not a strict requirement of a hackathon. But it's the pride and goal of every software developer to have the thing perform in a live demo.\n<h3>Presentations and prize giving</h3>\nAs is common for events like this, the quality of the projects varies wildly. I think nobody in our team expected to be in the top ranks. Even though I must say the presentation looked better than my code.\nThe project that I liked the most was about subleasing parking spots while people don't need them. I could imagine something like this generalized to become a decentralized form of AirBnB. The sharing economy is often cited as an Area where smart contracts could thrive.\nThe winners were the same people that won the London HackEthon. During the presentation I thought it rather boring. It was about heart rate sensors publishing directly to ethereum. A smart contract would then take action if the data was out of order. Only after they received the price, I thought some more about it. In hindsight I can see the value in it, and that it was probably implemented better then most other projects.\n<h3>Conclusion</h3>\nThanks to [Thomson Reuters](https://www.thomsonreuters.com) and all others involved for organizing this great event!\n I hear a lot from Bitcoin maximalists that all other chains can't compete with the one true blockchain. I'm also invested most in Bitcoin, but I want to be open to the possibilities of other blockchains and smart contract platforms in special. Although I must admit, I never saw a compelling reason for permissioned ledgers and private blockchains. A week before the event I learned about [Bitcoin uncensored](http://bitcoinist.com/author/bitcoin-uncensored/), and listened to a couple of the episodes. They essentially debunk most of the altcoins and blockchain projects. Calling them ponzi schemes and frauds. This made me skeptical of the blockchain boom, but all the more I was keen to discover good uses at and event full of blockchain hackers. I'm still positive that there are applications that can be improved with blockchains. But most of the ideas have to be discarded upon closer scrunity. The only three practical uses for blockchain so far are monetary, timestamping and naming. I am looking forward to expand this list, but it's not as easy as it seems at first. \n\n<table border=\"0\"><tr><td>[<img src=\"img/image20170128_105203022.thumb.jpg\">](https://ipfs.io/ipfs/QmYAKBH6iLyd1WTypvezMbjTjiF75vKymjXG33W4EgX9JS)</td><td>[<img src=\"img/image20170128_105215419.thumb.jpg\">](https://ipfs.io/ipfs/Qmb4sTA86D6GS3CrW2ieQbauG8nEgstkks94Bjy5b2VD14)</td><td>[<img src=\"img/image20170129_132704442.thumb.jpg\">](https://ipfs.io/ipfs/QmTavotrBDwKibz3YFAy4tL5MzZbEU66GMZN81b88VnW8L)</td></tr></table>\n"
		},
		{
			"post_id": 18,
			"title": "Add an SSD and the keyboard stops working",
			"date_published": 1481610960,
			"body": "Yes, the title sounds pretty outlandish. Stuff like this shouldn't happen with a decent operating system. But that is exactly how working Microsoft Windows is like.\nWe received new SSD's at work so that we can have faster access to more working copies of our source code. This speeds up compilation immensely. So, I shut down the computer, and installed the SSD. Should be really easy. To allow easier access to the inside of the computer case, I unplugged all the cables. \nWhen I powered up the device again, I couldn't log on. In fact I couldn't type anything. The keyboard was not working, because bluetooth was not working.\nIt shouldn't matter which USB port the devices are plugged, so I didn't care to plug everything in the same place. But Windows has a habit of re-installing drivers when a device is plugged in a different USB port. That's usually no big deal. But it might be that the bluetooth stack needed some manual intervention or even re-pairing. So I logged in with an old PS2 keyboard. I tried to reinstate bluetooth again. But that proved to be nearly impossible. I even had to manually start the bluetooth service because the bluetooth setting dialog would not load. Updating drivers, uninstalling drivers to have new ones fetched. Nothing helped. Not even our systems administrator had an answer. \nI recalled that some two years ago, I had no bluetooth after a Windows update. Because it was so obvious what broke it, I reversed the updated bluetooth driver, and kept it at the older version ever since. But this time there was no older version to go back. So I found out by chance that I can manually search for a driver for the bluetooth dongle. After some experimentation, I chose local instead of online, and then picked a generic bluetooth radio instead of the driver with the name of the chipset. Finally I could type again with the regular keyboard.\nWorking with Windows is like balancing on top of a house of cards. You try not to fart, because everything could cause it to crumble.\nI don't even want to know what riddle Microsoft comes up with the next time.\nMeanwhile my Linux boxes churn away unimpressed. They work and work and work, like the bunny from the Duracel advertisement from my childhood."
		},
		{
			"post_id": 17,
			"title": "Resetting the Logitech K810 bluetooth keyboard",
			"date_published": 1481277830.682,
			"body": "The Logitech K810 has been my favorite keyboard for many years. I have one at home and one in the office. It allows to easily switch between 3 different devices. It has the same size and layout as most notebooks, is stylish, and a blast to type. \nBut one day about a year ago something strange happened. When I wanted to type a '\\' I got nothing. When I wanted to type a '<', I would get a '§'. When I wanted to type a '>', I would get a '°'. And vice versa. So, effectively two keys were swapped. This was only on the Windows workstation in the office. When I switched the keyboard to the Linux notebook or to the phone, all keys were correct. It also never happened at home.\nAt first I thought this was a joke by my co-workers. So I tried everything on the windows machine: un-pairing and re-pairing. Scanning the registry for uncommon key mappings. Nothing helped until I found a page that described how to perform a factory reset on the keyboard. The problem was solved, but only for a year. Last week when I came to work after the weekend, the very same keys were swapped again. Finding the page with the reset instructions was more difficult than I remembered. It was not freely available, but only after logging in on the Logitech support page. That is why I want to preserve it here, in case it happens again to me or anybody else:\n\n* un-pair and remove the keyboard from the bluetooth settings on your pc \n* reset your keyboard: with keyboard on and unpaired from any device, press the following key  sequence:  \n** “Escape”, “o”,“Escape”, “o”,“Escape”, “b”\n* if the reset is accepted the lights on top of your K810 will blink for a second\n* Reconnect your K810 to your pc and test it on other devices if possible."
		},
		{
			"post_id": 16,
			"title": "Meeting C++ 2016",
			"date_published": 1479513736.882,
			"body": "This is my first time at [Meeting C++ in Berlin](http://meetingcpp.com). I came here with my boss Andi. To profit more, we split up during the talks. Afterwards we shared what we learned.\nI will complete this post later, adding links to the presentations and videos as they become available.\n\nI attended the following talks:\n\n<h3>Opening Keynote by Bjarne Stroustrup</h3>\nHe talked about the evolution and future direction of C++. Explaining the guiding principles and philosophy of the language. He also explained how the standards committee works, and that even he himself is sometimes over voted. He could tell that and even name the people of other opinions without any bitterness. Very professional and focused!\nThe main point that sticked out was: zero overhead abstractions\n* [video](https://www.youtube.com/watch?v=DvUL0Y2bpyc)\n\n[<img src=\"img/MeetingCpp2016Keynote.jpg\">](https://ipfs.io/ipfs/QmfWXfkVz49WpatZjcrJYY5xmkAuX7kXsi2vVNgTHMfwWt)\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/7.html\">C++ Core Guidelines: Migrating your Code Base</a> by Peter Sommerlad</h3>\nUnfortunately Peter Sommerlad was sick and couldn't come. So Bjarne Stroustrup agreed ten minutes before his own keynote to jump in, and give the talk without any preparation. He claimed never to have had a talk about this topic. He had some slides with the name of his employer, and he jumped around in those slides. Other than this barely noticeable detail, you couldn't tell that the talk was not prepared. He talked about how to use the [GSL](https://github.com/Microsoft/GSL) in new code. But the main focus was on how to gradually improve old legacy code by introducing the types the GSL provides. In the future there should be even tools to perform the conversion automatically.\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/6.html\">Reduce: From functional programming to C++17 fold expressions</a> by Nikos Athanasiou</h3>\nHe started out by showing how fold can be performed at runtime with std::accumulate(). Then he gave some theory and showed the syntax of other languages such as: haskell, python and scala. The C++17 fold expression operator doesn't just add syntactic sugar, but open up a load of new possibilities. With constexpr functions, the folds can be evaluated at compile time. As a consequence they can not only operate on values, but even on types. The talker shared with us how he broke his personal error message record: During his experiments he got an error with a quarter of a million lines!\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/13.html\">Implementing a web game in C++14</a> by Kris Jusiak</h3>\nIn this talk we witnessed how a [relatively simple game](https://github.com/modern-cpp-examples/match3) can be implemented with help of the following libraries: ranges, [dependency injection](https://github.com/boost-experimental/di) and [state machine](https://github.com/boost-experimental/sml). The code was all in pure C++14 and was then compiled to asm.js and/or webassembly using emscripten. The result was a static website that runs the game very efficiently in the browser. In the talk we were walked through the different parts of the implementation. In contrast to a naive imperative approach, after the initial learning curve this can be maintained and extended a lot easier.\n* [slides](https://modern-cpp-examples.github.io/match3/meetingcpp-2016/#/)\n* [video](https://www.youtube.com/watch?v=8gRHHIjx4oE)\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/40.html\">Learn Robotics with C++ in 1 hour</a> by Jackie Kay</h3>\nWe didn't actually learn how to program robots. First, she walked us through some history of robotics. By highlighting some of the mayor challenges, she explained different solutions, and how they evolved over time. Because robots run in a real time environment and have lots of data to process, performance is crucial. In the past the problems were solved more analytically, while nowadays the focus is on deep learning with neuronal networks. She had a strong emphasis on libraries that are being used in robotics. To my surprise, I knew and used most of them, even the ones she introduced as lesser known such as dlib.\n\n<h3>Nerd Party</h3>\nIn the evening there was free beer in the big underground hall. There was no music, so that people could talk. Not really how you would usually imagine a party. We had a look at the different sponsor booths, and watched some product demos. After a while we went up to the sky lounge in the 14th floor with a marvelous view over the city.\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/37.html\">SYCL building blocks for C++ libraries</a> by Gordon Brown</h3>\nEven though I experimented with heterogeneous parallel computing a few years ago, I was not really aware what is in the works with [SYCL](https://www.khronos.org/sycl). My earlier experiments were with OpenCL and Cuda. They were cool, but left a lot to be desired. I never looked into OpenAMP despite the improved syntax. In Contrast SYCL seems to do it right on all fronts. I hope this brings GPGUP within reach, so that I could use it in my day to day work sometimes. In the talk, he showed the general architecture, how the pipelines work. Rather than defining execution barriers yourself and schedule the work, you define work groups, and their dependencies. SYCL then figures out how to best arrange and schedule the different tasks onto the different cores. Finally he talked about higher level libraries where SYCL is being integrated: [compute](https://www.codeplay.com/products/computesuite/computecpp/), tensor flow and computer vision.\n* [video](https://www.youtube.com/watch?v=HH-ikWJ8cU4)\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/3.html\">Clang Static Analysis</a> by Gabor Horvath</h3>\nDuring this talk we learned how static analyzers find the potential problems in the code to warn the developers about. Starting with simple semantic searches, through path tracing with and without branch merging. Bottom line was that there is no one tool to beat them all, but that the more tools you use, the better. Because they all work differently, each on can find individual problems.\n\n<h3><a href=\"http://meetingcpp.com/index.php/tv16/items/29.html\">Computer Architecture, C++, and High Performance</a> by Matt P. Dziubinski</h3>\nThis talk made me realize how long ago it was, that I learned about hardware architectures in school. Back in the day we thought mainly about the simple theoretical model of how an ALU works. The talk made clear how you could boost performance by distributing the work to the different parallel ALU's that exist within every CPU core. In the example he boosted the performance by two simply by manually partially unroll a summation loop. Another important point to take home is the performance gap between CPU and memory access. Even for caches, it is widening with every new hardware generation. Traditional algorithm analysis considers floating point operations as the expensive part. But meanwhile you can execute hundreds of FLOP's in the time it takes to resolve a single cache miss. On one side he showed some techniques to better utilize the available hardware. And on the other hand he demonstrated tools to measure different aspects, such as usage of the parallel components within the core, or cache misses. With so diverse hardware it is really difficult to predict, thus measuring is key.\n\n<h3>Lightning talks</h3>\nThe short talks were of varying quality, but mostly funny. As with a good portion of the talks, there were technical difficulties with connecting the notebooks to the projectors.\n\n<h3>Closing keynote: C++ metaprogramming: evolution and future directions - by Louis Dionne</h3>\nC++ metaprogramming: evolution and future directions\nWe both didn't know what to expect from this talk. But it proved to be one of the best of the conference. He started out by showing some template meta programming with the boost::mpl, transitioned to boost::fusion, and landed at his hana library. The syntax for C++ TMP is generally considered insane. But with his hana library, types are treated like values. This makes the compile time code really readable and only distinguishable from runtime code at a second glance. True to the main C++ paradigm of zero overhead abstraction he showcased an implementation of an event dispatcher that looks like runtime code with a map, but actually resolves at compile time to direct function calls. Cool stuff really. Leveraging knowledge that is available at compile time and use it at compile time. He even claimed that in contrast to some other TMP techniques, compile times should not suffer so much with hana.\n* [video](https://www.youtube.com/watch?v=o_axRcPKAsM)\n\n<h3>Conclusions</h3>\nC++ is fancy again!\nI have been programming professionally for about 17 years. In all this time C++ has been my primary language. Not only that, it has also always been my preferred language. But there were times where it seemed to be stagnating. Other languages had fancy new features. They claimed to catch up with C++ performance. But experience showed that none ever managed to run as fast as C++ or produced such a small footprint. The fancy features proved either not as useful as they first appeared, or they are being added to C++. In retrospect it seems to have been the right choice to resist the urge to add a garbage collector. It's better to produce no garbage in the first place. RAII turns out to be the better idiom as it can be applied to all sorts of resources, not only memory. The pace with which the language improves is only accelerating.\nYes, there is old ugly code that is using dangerous features. That is how the language evolved, and we can't get rid of it. But with tools like the GSL and static analyzers we still can improve the security of legacy code bases.\nExciting times! "
		},
		{
			"post_id": 15,
			"title": "Electrum 2.7 with improved hardware multisig",
			"date_published": 1476127767,
			"body": "[Electrum](http://electrum.org) has been my favorite Bitoin wallet software for a very long time. The reason I had a look at it initially was because there was a debian package. Only when Trezor hardware wallet support was added and was not yet released, I downloaded the sources. It is written in Python. I work with python regularly, but it is not my primary language. But for frequently updating and testing experimental software, it is pretty cool. That's how I started to report bugs in the unreleased development branch, and sometimes even committing the patches myself.\nBut the reason I'm writing this post is, that the new 2.7 release contains two features that are important to me.\n<h3>Ledger Nano S</h3>\nOne is that the [Ledger](https://ledgerwallet.com) devices now also support multisig with electrum. I took this as the trigger to order a Nano S. It works totally different from the HW1 in that it has a display. Thus you can set it up without an air gapped computer. With only the two buttons, you can navigate through the whole setup process. As a bonus it is also to my knowledge the first hardware device to store Ethereum tokens, not counting experiments such as [quorum](https://quorumwallet.com). So I finally moved my presales ETH.\n<h3>Multisig with hardware wallets</h3>\nI wrote about [multisig with hardware wallets](https://ulrichard.ch/blog/?p=2035) before. But Thomas took it a huge step further. Now it's not only super secure, but also super user friendly. Now the hardware wallets are directly connected to the multisig wallet. No more saving unsigned transactions to files and load in the other wallet. You can still do that if you have the signing devices distributed geographically. Given a solid backup and redundancy strategy, you can now also have a 3 of 3 multisig hardware wallet. So your bitcoins would still be secure if your computer was hacked, and two of the three major BitCoin hardware wallets had a problem, which is very very unlikely.\n\nThe only thing still missing is the debian package for the 2.7 version."
		},
		{
			"post_id": 13,
			"title": "My new notebook",
			"date_published": 1475407088.713,
			"body": "Last week I finally received my new notebook. It was a long journey, but it was worth it. If you didn't follow my blog, you can read about it [here](https://ulrichard.ch/blog/?p=1678), [here](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:2:Why+I+still+have+no+new+notebook) and [here](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:10:Worst+customer+experience+ever). \n<h3>Delivery</h3>\nIt was delivered in two pieces. The first box contained the notebook, and was delivered normally. The second box contained the docking station and an additional power supply. For the second box I had to send a copy of the invoice to the tax office. I expected Dell to place the required documents inside the boxes. But since it was a domestic delivery for Dell, they didn't. And I forgot to tell my friend who re-shipped them to check. So when the second box was delivered, I had to pay the import taxes for the whole order in one go. That wouldn't be a problem in itself, but an announcement would have been nice. Because I don't usually walk around with so much money, I had to ask the whole team to borrow some cash. Yeah, cash was the only option.\n<h3>First impression</h3>\nAs expected, the first impression was great. And I had high expectations because I owned a previous model already. The border less screen is a blast. The large bezel of some other devices is such an useless waste of space. Also the docking station works flawlessly. I had somehow the impression they had different models for America and Europe. But other than the power cord, I couldn't tell anything that wouldn't fit. Only one USB-C cable is between the dock and the notebook. This is enough for charging the notebook, connecting external monitors, USB3 devices and sound. Funny enough the [Bluetooth LE Mouse](https://www.caseking.de/logitech-mx-master-laser-maus-schwarz-gold-gamo-577.html) has shorter wakeup times when the docking station is plugged in.\nI don't insist on linux being pre-installed to save the time installing. It is to make sure the drivers stay available also in the future. I want to make sure that the OEM's are aware of the people who want to have sane operating systems on their devices. It is essentially the same reason I insisted on paying with BitCoin. It is my money that I spend, and thus I want my purchase to show up in the appropriate columns of the statistics. If people don't care, some corrupt middle managers just make certain options harder to get and then claim nobody wanted them.\nThe only item that is not according to my wish list is the keyboard layout. I wanted a Swiss layout, but made the compromise to get a US keyboard because the other factors were more important to me. The plan was to get a swiss keyboard, and retrofit it myself. But when I look at the device now, I figured out that this wouldn't be easy, as it would require a European palm rest. Thus I abandoned that plan. I had devices with US keyboards before. It's no big deal, I just prefer the Swiss layout.\n<h3>Installation</h3>\nEvery time I set up a new device, I follow the guides for installing with [smartcard backed full disk encryption](https://blog.kumina.nl/2010/07/two-factor-luks-using-ubuntu/) and [smartcard backed ssh](https://www.programmierecke.net/howto/gpg-ssh.html). I wanted to automate this process for a while. So I used the opportunity to write the scripts this time. Since I wanted the procedure to work reproducibly, I started over every time I missed something. In the end I installed the OS at least five times. The next script for installing all the software including those from personal packet archives is a classic. I probably created it almost a decade ago, and always refined it. I once tried to do something similar for Windows at work. But in the end I abandoned it.\n<h3>Problems</h3>\nNo system is perfect, and especially notebooks are known to not always have perfect driver support for linux kernels. The Sputnik team certainly does a great job with routing all their tweaks upstream. So far, I only found two minor problems. Wifi and the touchscreen didn't work after resuming. Since I use full disk encryption I, suspend only occasionally. The boot times are really ok anyway. This is my first notebook with a touch screen. I force myself to use it sometimes, but on such a small high res screen my fingers are just too big. So, it's nice to have, but hardly essential.\nIt is also my first device with a 4k screen. Ubuntu does great with the scaling and settings. The only applications that don't fully support high res that I found so far, are: [electrum](https://electrum.org), [bitsquare](https://bitsquare.io) and [openbazaar](https://openbazaar.org). Oh, and it would be nice if the applications used the DPI scaling of the screen they are currently displaying.\nLast but not least, the battery time didn't impress me the only two times I ran on battery so far. It hardly lasts for a full movie. But I will try terminating all my background tasks next time.\n<h3>Update December 20th 2016</h3>\nHere is a nice video describing the device: \n[https://www.youtube.com/watch?v=kvsgTJbIWNo](https://www.youtube.com/watch?v=kvsgTJbIWNo)\n"
		},
		{
			"post_id": 12,
			"title": "Decentralized websites and more",
			"date_published": 1474916422.909,
			"body": "\"Cool idea, but to be of any use, it would need more functionality and more content\" was my impression when I first looked into [zeronet](https://zeronet.io/). Back then static web pages were all there was, and no UI support for any managing tasks. The next time I checked, probably more than half a year later, it had a blog engine, subscription on the welcome page, mail, chat, forums, wiki, boards and more. Blogs was what hooked me this time. The interesting feature was that you could subscribe, and have the news listed on the hello page. So I started to write new blog posts both on wordpress and on zeronet. True, wordpress has lots of more functionality than the zeronet blog engine. Some things are nice gimmicks, but none of it is really essential. ZeroBlog is really all you need.\nSome people started to leave [twister](http://twister.net.co/) for zeronet, but I couldn't quite understand why. For me, it filled another niche. They are both very nice in their own way.\n<h4>How it works</h4>\nTo create a site, you can execute a python command on the commandline, or simply clone an existing zite. In both cases, a private key is generated that you need to later sign the content. Signing is really easy, but you better take good care for your private keys. Make sure not to share them, but do make backups for yourself. From the private key, a public key is derived and from that a BitCoin address. The BitCoin address serves as the unique identifier for your zite. If this identifier looks too complicated, you can register a [shorter name](https://github.com/HelloZeroNet/ZeroName) on the [NameCoin](http://namecoin.org) blockchain, and link it to your bitcoin address for the zite. Once you sign and publish your zite, you can give the address to your friends, or publish it where other people can pick it up. Whenever another zeronet user requests your address, he sends the query into the mesh. Whoever is closest, serves the files anonymously. Now the user who visited, becomes a seeder who also serves your content. No central server required. Now you can switch off all your computers, and your zite is available. Your zite stays online for as long as there is at least one other user seeding it. \nOnce you installed zeronet, you can find my zeronet blog at:  [ulrichard.bit](http://localhost:43110/ulrichard.bit)  \n<h4>Proxies</h4>\nTo visit zeronet sites, or simply zites as they are called, you should run the zeronet client. The software is written in python with few dependencies. So it is really easy to run. You can either run it locally, or on a personal server. Then just visit the entry page with the browser and navigate from there. But if you want to visit a zite without installing any software, there are also public proxies. There are many reasons why running the software is better than using these proxies, but I won't go into the details now. And I don't list the proxies here.\n<h4>ZeroMe</h4>\nThen came merger zites. I read about the concept before the release, and was really curious. Some things are not as easy to accomplish with a decentralized anonymous system as with a centralized architecture. But when I had my first play with ZeroMe, my reaction was \"Wow this is what I have been waiting for\". I don't use most social media because of the centralized architecture, and because they own all the data of the users and can make with it whatever they please. There have been decentralized social platforms before, but they were usually a hassle to install and maintain or not so great from a usability standpoint. Now with ZeroMe you choose a hub to store your data, an identity provider, and a presentation. So you have three orthogonal aspects to your experience. \n<h4>Data Hub</h4>\nYou can subscribe to as many hubs as you wish, but store your data to only one of them per identity. They can be organized by region, language or interests. The more you subscribe to, the more data will be stored on your harddrive, and the more bandwidth will be consumed. You can also run your own hub, and use it only with your friends.\n<h4>Identity</h4>\nThe identities existed for a while. You needed an identity to write a blog, to comment on other people's blogs, to write and receive ZeroMail, to write to boards and chats and talks and wikis. Again different identity providers have different requirements. For [ZeroId](/zeroid.bit/) you have to register your handle on the [namecoin](http://namecoin.org) blockchain. For [Zeroverse](/zeroverse.bit) you had to send a [bitmessage](http://bitmessage.org). For [KaffieId](/id.kaffie.bit) no external proof is required. You can maintain as many identities as you like. Some can be more credible, others totally anonymous.\n<h4>Presentation</h4>\nThe official frontend is [Me.ZeroNetwork.bit](/Me.ZeroNetwork.bit). But as it is all opensource. The first forks or clones started to appear. There is the darker themed [Dark ZeroMe](/1HmJ7GadjdiQUPevaK7QXVrK4nhyCp1fSj). There is [ZeroMe Plus](/1Lj1oPcN7oZQL8HkS5KbkzQuKqs42zQWY6) which adds some nice features.\nBy the way, my handle for zero.me is also @ulrichard."
		},
		{
			"post_id": 11,
			"title": "Hike and Fly the \"Kleiner Mythen\"",
			"date_published": 1474904215.575,
			"body": "I used to hike the smaller Mythen at least once a year with a paraglider on the back to fly down. Usually i took the Chaemi route which involves some light climbing. Many times I saw mountain goats, and once I slept near the top. Last year I didn't make it, so I wanted to revive the tradition. Last Thursday I sent messages to some friends asking who would join. Pascal came. With good company the whole trip is even more pleasant. Just before we reached the summit, the fog came in and blocked the view in takeoff direction. We decided to descend. We almost reached Zwischenmythen when the fog lifted. So we hiked up again. The reward was a gentle glide into the sunset. I appreciated every second of the flight a lot more then if I went up with a cablecar.\n[<img src=\"img/klMythen.jpg\">](https://ipfs.io/ipfs/QmP9G2wcnHYpoWzRrVFtCvXz5pX6rZa9RmSj9gNf5SbmTR)\n[<img src=\"img/klMythen2.jpg\">](https://ipfs.io/ipfs/QmYLZd8Qox1FsMz2VJMRx91J2dbhW1ummhhqZaQn6q29WM)"
		},
		{
			"post_id": 10,
			"title": "Worst customer experience ever",
			"date_published": 1472756397.387,
			"body": "<h3>The best notebook ever</h3>\nI [blogged](?Post:2:Why+I+still+have+no+new+notebook) about my attempts to buy a decent notebook here before. But let's recap quickly. In the fall of 2013 I bought a Dell XPS13 Developer edition. When Dell shortly thereafter announced that they now accept BitCoin, I had the feeling I missed out on that opportunity. Nevertheless, it was the best computer I ever had. As it came with ubuntu preinstalled, there was no hassle with drivers. Everything just worked, it was lightning fast and gorgeous. But in February 2015 it was stolen. \n<h3>Paying with BitCoin</h3>\nI wanted to buy the same notebook again, but this time I wanted to pay with BitCoin. The option was not available for the Swiss market, but they expanded it to Canada and the UK. I really didn't want to find out that it would be possible in Switzerland just after I ordered. Thus I decided to hold my breadth. The waiting became very long, as my ancient intermediary notebook was having thermal issues. \n<h3>Purism</h3>\nThe selection of ultrabooks with linux pre-installed, that can be bought with BitCoin is not so large. If It has to have a backlit Swiss keyboard, it gets really difficult. But somehow I learned about [purism](http://puri.sm). Their librem notebooks looked very good. As with most startups, the people were really approachable and helpful. I was ready to order their best machine, but they kept having delays. Delivery was always two months out. When it was [pushed way back again](https://puri.sm/posts/at-crossroads-for-the-librem-15-4k-lessons-learned-from-supply-chain-dependencies/), I decided I didn't want to wait any longer, and re-targeted for the Dell.\n<h3>UK</h3>\nAfter a lot more than a year of waiting, and asking Dell to make the leap forward, I was ready to give up the Swiss keyboard. I was ready to order from the UK instead. I was ready to retrofit a Swiss keyboard myself, and pay double taxes. I found a [service](https://www.forward2me.com/) that would forward the parcel. But although BitCoin was listed as a payment option on the UK Dell website, the option was not available on the checkout screen. I reported this to Dell customer support and tried on a regular basis over the course of a month. Finally I gave up on the UK store.\n<h3>US</h3>\nThe US store had a model with a 1TB SSD that was even better than the models offered in the European stores. So I went for that. All the mail forwarding services in the US either couldn't process my card to cover their fees, or didn't provide a phone number. But a domestic phone number was required for the order form at the Dell store. So I asked around if I could have my order delivered to somebody in the US, and he would forward it to me. A former co-worker who lives in California now agreed. I went ahead and placed the order to his address. Because I was really in need of the device, I chose the faster, more expensive delivery method. Shortly after I paid, I received an eMail stating that the formal order confirmation should follow in two days at the latest.\n<h3>Black hole</h3>\nThat was the one and only, and the last communication I received from Dell. After a week I started to question why I didn't receive the formal confirmation, and I found out that the order didn't appear on the order status page. So I tried to contact Dell order support. In order to initiate a support session, one has to enter the order number. And because the order was not properly in the system, I couldn't contact them. I tried different means to contact them almost on a daily basis. This week I could finally chat with a support representative. He couldn't find my order in the system neither, and gave me an eMail address. So I wrote to what appears to be the main eMail address for customer support in the US. An automated response came immediately stating that a human would respond within 24 hours. Nobody ever did of course. I reached out to coinbase to ask about my transaction. They very quickly responded. They stated that on their side everything went through normally, and that Dell indeed received the money. Somebody on a forum suggested that the order might be canceled because of some obscure export regulations. But why a company would cancel an order on such a basis without ever notifying the customer is beyond me.\nIt has been almost a month now, that I have been desperately trying to find out, when I will receive the notebook that I really need. Dell didn't even bother to tell me anything. How is that different from the worst scams and frauds out there on the internet? To me that was a lot of money that I sent. I thought of Dell as being trustworthy. No more...\n<h3>Update September 8th 2016</h3>\nBarton sent me a mail today stating that they found the problem. They made sure it doesn't happen again. And the notebook should be delivered early next week. Looking forward...\n<h3>Update September 22th 2016</h3>\nThe box with the precious new power machine was delivered to me today.\nHooray! Finally! Jay! So excited! \nNow I know what I will do tonight... Setting it all up.\n"
		},
		{
			"post_id": 9,
			"title": "game modding with pen and paper",
			"date_published": 1471895431.456,
			"body": "I have lots of good memories from youth camps. Some involve playing Donkey Kong and Mario Brothers while sitting on trees. Another classic video game was Asteroids. When I recently read an article in a German magazine about building an Asteroids clone with an Arduino and an OLED, lots of old memories resurfaced. The source code was provided, and the build was simple. As the control was used as digital, I didn't use an analog joystick. When I gave it to the kids to play, they didn't share the same enthusiasm that I had back then. But that's probably because they grow up with lots more tiny computers than we had. So I wanted to involve them some more, and give them a sense of how this thing works. I don't know how well they understood, when I explained them the concept of a pixel. \nSo I grabbed pen and paper, read the source code and drew the [pixel art](https://ipfs.io/ipfs/QmeeUPQ8CkYtxx31tiWFsAZde1BwtqKUfi2W1vw3drAXPq). Next, I told them they could modify the images to their liking, but still preserve the mechanics of the game. It was essentially the spaceship with one frame, the asteroid with three frames and the explosion with four frames. Seven year old Levin understood immediately, and painted his versions. For five year old Noah it might be a bit early, but he also participated enthusiastically.\nAll I had to do was transform their [paintings](https://ipfs.io/ipfs/QmeeUPQ8CkYtxx31tiWFsAZde1BwtqKUfi2W1vw3drAXPq) back into source code and load it onto the AtMega chip. Now they were hooked a lot more to the game than before.\n[<img src=\"img/ShootDuino.jpg\"/>](https://ipfs.io/ipfs/QmY3em6UtdTtJvR2h4wBKDd2SymMVrs2DXRmyQJaiyd9pA) [<img src=\"img/Asteroids.jpg\"/>](https://ipfs.io/ipfs/QmeeUPQ8CkYtxx31tiWFsAZde1BwtqKUfi2W1vw3drAXPq)"
		},
		{
			"post_id": 8,
			"title": "drive in cinema",
			"date_published": 1471893988.96,
			"body": "The last time I was in a drive in cinema was about ten years ago. At the place I was in Volketswil, they no longer organize these events. So I was looking from time to time for another place. The ones I found were too far away. Then I saw an advertisement for [Hinwil](http://driveinmovies.ch). It is close enough and on a [TCS](http://tcs.ch) training area. The slope towards the screen seems to be perfect. We chose a movie that we could watch with the kids: [Alvin and the Chipmunks: The Road Chip](http://driveinmovies.ch/index.php/de/filme-2016/alvin-and-the-chipmunks)\nBecause we expected a ton of people, we made sure to be there early. But to our surprise only about 20 cars were lined up. So we got a really good spot in the center of the front row. They didn't use a projector, but a huge LED wall. That was really valuable for the afternoon kids movie. We tuned the car audio to the provided frequency, and enjoyed the movie.\nThey had food and drinks and VIP pickups with cushions. The whole event was really well organized. I hope they had more people at the evenings so that they will also organize the event for many years to come.\n[<img src=\"img/driveincinema.jpg\"/>](https://ipfs.io/ipfs/QmWcfZPpDmuLfYMTu619qw1Rrf87LcWmxu9ZtPNat8Ew3U)"
		},
		{
			"post_id": 7,
			"title": "Running hostile software in a container",
			"date_published": 1471499212.893,
			"body": "Remember Skype, the once popular phone software? I used it a lot when we were traveling in [South America](/1MrcCZjfRCKeJZAENsjDqf7dvDhEhFpsXY), and international calls were insanely expensive. But I stopped using it when it was acquired by Microsoft, and they switched from a P2P model to centralized servers. From what I could observe, it gradually worsened from there, and I really thought I wouldn't have to use it ever again. That was until somebody decided that we had to use Skype for Business instead of XMPP at work. There are a plethora of better alternatives. The one I use the most these days is [Tox](https://tox.chat).\n\nI use the Windows Workstation only for things that I can't do on Linux. There is not much that falls into this category, besides VisualStudio compiling projects that involve MFC. There is [Skype](https://linux.slashdot.org/story/07/08/26/1312256/skype-linux-reads-password-and-firefox-profile) for Linux, but there is no official Skype for Business for Linux. So for a moment it looked like the Windows machine got a second task. But running an [obfuscated](http://www.oklabs.net/skype-reverse-engineering-the-long-journey/) [malicious](https://linux.slashdot.org/story/07/08/26/1312256/skype-linux-reads-password-and-firefox-profile) binary blob from Microsoft with known [backdoors](http://www.technobuffalo.com/2013/07/11/microsoft-gave-the-nsa-direct-backdoor-access-to-outlook-skype/), that is online all the time on an operating system that can not be secured makes me uneasy. So I looked for a way to run it securely on Linux. The first thing I found was an open source implementation of the reverse engineered proprietary protocol as a plugin for Pidgin. That sounded good, but it didn't work unfortunately. The second option was a closed source clone from [tel.red](http://tel.red/). They provide their own apt repository with regular updates. That's quite good actually, if you don't care about closed source software, and the security of your device and your data in general.\n\nI learned about docker a while back, but only used it marginally so far. This was the first real use I had for it, so I started learning more about it. Copying and adapting a docker file is a lot easier than the articles I read so far made me believe. I found a couple of [sites](https://binfalse.de/2016/01/04/docker-jail-for-skype/) [about](https://github.com/tomparys/docker-skype-pulseaudio) [packing](https://index.docker.io/u/tomparys/skype/) [Skype](https://github.com/tomparys/docker-skype-pulseaudio/blob/master/Dockerfile) [into](<a href=\"https://www.dustri.org/b/running-skype-in-docker.html) a docker container, but none for Skype for Business. So I took [one of the former ones](https://github.com/tomparys/docker-skype-pulseaudio) and adapted it. To use my container, just follow these easy steps:\n\n<code class=\"language-bash\">git clone https://github.com:ulrichard/docker-skype-business\ncd docker-skype-business\ndocker build -t skype .\ndocker run -d -p 55555:22 --name skype_container skype\nssh-copy-id -p 55555 docker@localhost\nssh -X -p 55555 docker@localhost sky</code>\nThe password for ssh-copy-id is \"docker\".\n\nThen log into sky with your credentials. You can do this every time, or you can store a configured copy of the container as follows:\n\n<code class=\"language-bash\">docker commit skype_container skype_business</code>\n\nThe next time, you just run it with:\n\n<code class=\"language-bash\">docker run -d -p 55555:22 skype_business\nssh -X -p 55555 docker@localhost sky</code>\n\nI left some pulseaudio stuff from the original container at least in the README file. I don't intend to use it for anything but receiving chat messages. But if you want to, feel free to experiment and report back."
		},
		{
			"post_id": 6,
			"title": "A holiday that didn't start so well",
			"date_published": 1469562728.639,
			"body": "<h3>Büssli</h3>\nOur camper van suffered three ripped cooling water hoses in the last two months. Together with my brother who is the engineer in charge of maintaining our vehicles, we looked for the source of the troubles. Although not entirely sure, after a test ride I was confident that we found and fixed it. We even exchanged some hoses that looked worn as a precautionary measure.\nSo my wive and myself stuffed everithing for our holiday on the Italian island of Elba into the van. Rather than at 11pm as initially planned, we left already at 4pm. That should give us some comfortable reserve to reach the ferry the next morning. Unfortunately, the cooling water warning light forced me to drive to a service area after only 30km. It was a ripped cooling water hose again. The guy from the breakdown service replaced it and performed a series of tests to make sure the cooling system worked propperly. He told us we could move on, but we didn't trust our [Hippie Bus](https://www.youtube.com/watch?v=Bp6gaPYwPB0) enough to drive all the way, after what happened.\n<h3>XJS</h3>\nSo we returned home in order to perform another episode of [How much luggage fits into a vintage grand tourer](https://ulrichard.ch/blog/?p=1760). With the Jaguar I drove trough the night. I did a few stops for drinks and toilet. After one stop in the early morning, not too far away from the port, the engine wouldn't start. Oh shit, I had this a few years ago, and remember just too well, that the highly compressed V12 engine wouldn't start with an ordinary bridging cable. Back then, the [TCS](http://tcs.ch) guy had a super thick cable and I don't know how many batteries in the trunk in order to kick start my car. So this time as a first measure, I bought a 500 Amp bridging cable at the gas station. We tried it with a couple of other cars. But through the narrow contact area of the clamps, there would just not come enough power to start the engine. So I called the breakdown service again. He came with an ordinary booster pack, and wouldn't beleve that an engine could require more energy to start than his booster pack could provide. So he brought us to his plumber shop. I asked them to install a charged battery. But they insisted that the problem must be somewhere else. So he carried us 20km to the next Jaguar repair shop. After a while they fited a new battery, and all was well again. We could continue our journey with a six hours delay. We missed the ferry we booked, but it was no problem to take another one. \n<h3>Elba</h3>\nThe time on Elba was great and without trouble. Water and air temperatures were very nice. It was the first time at the sea for Noah. He insisted on bringing his best shirt: \"Mom told me it is only for special ocasion. I'm going to see the sea for the first time. That is very special to me\". With Levin we were at the Dune du Pyla when he was 19 months old. He only remembered what we told him, and the photos we showed him. The water was super clear and flat for the most part. Only the last two days we got some small waves. To see all the beaches and caves, we went on a full day boat tour all around the island. A couple of times the boat stopped, and we could go for a swim. Another day we visited the oldest city on the island that we still remembered from the last time 8 years ago. But for the most part, we enjoyed the beach. The guys that were next to us at the camp side told us that every time we were away, people would take pictures of our hippie bus tent. Also when I was driving the Jaguar around in Italy or parking it, I often heard remarks containing words such as \"belleza\". Somebody liked it so much that he wanted a souvenir, and stole all four tire valve caps.\n[![camp side](img/IMG_3430.JPG)](https://ipfs.io/ipfs/QmdBrVRA6g2LAc2K9w8sdCJHdxBbUhhYJQ8Vzs1PoJrVcC)\n<h3>Trip back home</h3>\nThe drive home was mostly smooth. Only once we had some worrying moments. That was when I climbed a small hill on the highway, and right in front of me there was a plastic gas canister on the road. It would have been too risky to perform an avoidance manouver. So I centered on it, and hoped it would slip under the car. Instead we dragged it along. I was releaved that only one hundred meters ahead was an exit. By driving the right wheels on the sidewalk for a moment I could get rid of it.  "
		},
		{
			"post_id": 5,
			"title": "Paying for gas",
			"date_published": 1467877199.332,
			"body": "Maestro card unreadable, Visa not accepted, new CHF 50 bill not recognized.\nAt least the next gas station was not too far away. \nTime for BitCoin"
		},
		{
			"post_id": 4,
			"title": "The legacy banks in Switzerland",
			"date_published": 1464854078.836,
			"body": "<h3>Transaction costs</h3>\nI have a separate bank account for my tandem flying hobby at the local bank where I live. I didn't want a plastic card for it, and setting up online banking turned out to be too complicated. So I pay a CHF 3.00 fee for every withdrawal at the counter. That is, if I go to the branch at my home town.\nBut last week I wanted to withdraw some money near where I work, less than 30km away, at a branch of the same bank. The teller told me that he would have to make a phone call to the other branch, and that the transaction would cost CHF 10.00\nThat was too much for me. Considering that a bitcoin transaction to Australia (16'000 km) costs CHF 0.02, the transaction cost of the retail bank per km is more than 250'000 times as expensive as that of BitCoin.\n<h3>Communication</h3>\nIn Switzerland we usually don't tell each other how much we earn, or how much we have on our bank account. Swiss Banks even had a reputation of secrecy up until recently. Naturally when you communicate with your bank, you expect this to be confidential. So I asked my bank representative for his public key some years ago, so that we could exchange encrypted emails. His answer was that I would have to use the messaging in the online banking platform in order to enjoy encrypted communication. I strongly dislike to have to log into different web platforms in order to communicate with different people. Some banks even communicate with their customers through centralized unencrypted social media, thus voluntarily introducing a man in the middle. I just had to accept what they offered for the time being. Hence I used this messaging system to cancel my credit card last year. He asked me if I wanted to cancel right away, or just not renew it when it ran out in a couple of months. I opted for the later. But then it was renewed nonetheless. So I asked what went wrong, and to please fix it. The answer was, that I didn't specify when to cancel. Of course I did! Whether the message disappeared from the system because of some glitch, or was deleted intentionally to cover up incompetency doesn't really matter. Fact is, the communication channel failed completely. Accountability is an important part of communication. This incident cost a lot of trust that I had in my bank. \n<h3>Stranded funds</h3>\nBut the story with the cancelled credit card didn't end there. Because it was not cancelled in time. Some company where I used a service, renewed without my consent. Thus they charged the card that should have been terminated by that time. So I had to send a printed form for the chargeback to the card operator. It took some time, but the money came back to my card account. And for another half a year, I receive a monthly letter stating the balance would be reimbursed next month. I misinterpreted this that it would be automatically sent back to my bank account. But it won't. I have to send them another signed letter by snail mail to perform the obvious. As if it was 1995, and the electronic signature on my email was not 1'000 more secure than the ink on the paper.\n<br>\nMaybe I'm just spoiled with how well everything works with BitCoin. But the legacy banks really could do a better job.\nCompanies that deal with BitCoin usually:\n* Have competent and responsive customer care\n* Offer real two factor login with hardware tokens\n* Encrypt and sign the eMails with OpenPGP\n* Execute transactions instantly, not only once per work day\n* Have reasonable fees, even if the volume is still ramping up\n* Care about the usability of their platforms\n\nAnd where they have limitations, they are usually imposed by the legacy financial institutions.\n"
		},
		{
			"post_id": 2,
			"title": "Why I still have no new notebook",
			"date_published": 1462305877,
			"body": "It has been more than 14 months since my XPS 13DE notebook was stolen. Ever since, I was on the hunt for a replacement. I have just some simple requirements that seem so difficult to meet:\n\n- Linux pre-installed\n- Payment in BitCoin\n- Swiss German Keyboard with back light\n- Ultrabook (slim and powerful)\n\nThe natural choice would be to go with the successor of the model that I was so fond of. Dell does accept BitCoin, but only in the US, UK and Canada. Unfortunately they don’t sell Swiss keyboards in those markets, and I don’t know where to get a keyboard to retro fit.\n\nThere are a few vendors selling devices that fulfill some of the requirements, but I found only one so far that can achieve them all.\n\nThe best choice at the moment seems to be a Librem13 or Librem15 from purism. The 13inch model has only an i5 processor, and no backlit keyboard. So I would opt for the 15inch model. They have difficulties getting the display panels. And lots of the devices they shipped internationally didn’t reach their destination. This an unfortunate situation, but they seem very friendly and responsive. From what I can observe, they give their best to resolve the situation as good as they can. At the moment It looks like I have to wait two more months to get a Librem15.\n\nHere are some devices that I considered:\n\n| Model | Linux | BitCoin | Keyboard | Ultrabook | Remarks |\n| ---------- | --------- | ------------ | -------------- | -------------- | ------------- |\t\n| Dell XPS13 Developer Edition | yes | no | yes | yes | Very nice device |\n| Purism Librem15 | yes | yes | yes | yes | Waiting for display, and shipping  problems |\n| Tuxedo | yes | unknown | no | yes | Only German Keyboards |\n| Why | yes | no | yes | yes | Some devices look a bit clonky. |\n\nIf you know of a device that fulfills my requirements, and is not listed here, please tell me.\n\nThis blog post first appeared on:  https://ulrichard.ch/blog/?p=2105"
		}
	]
}