{
	"next_comment_id": 60,
	"comment": [
		{
			"comment_id": 1,
			"body": "Chouette, je connaissais pas Mailchunk, je vais tester ça! Merci :)",
			"post_id": 7,
			"date_added": 1458332030
		},
		{
			"comment_id": 2,
			"body": "C'était surtout pour tester. J'ai aussi installé Antox sur Android, comme ça je peux me parler à moi-même!  \\^_^/  #tristesse",
			"post_id": 4,
			"date_added": 1458332117
		},
		{
			"comment_id": 3,
			"body": "merci :)",
			"post_id": 2,
			"date_added": 1458332160
		},
		{
			"comment_id": 4,
			"body": "j'avoue :D",
			"post_id": 4,
			"date_added": 1458757443
		},
		{
			"comment_id": 5,
			"body": "Ils en parlent plus en détail ici: https://www.eff.org/deeplinks/2014/11/what-makes-good-security-audit\n\nMais c'est vrai que cela reste un peu flou, difficile à dire si l'audit de sécurité est fait de manière indépendante et si les auditeurs n'ont pas subi de pressions de la part des éditeurs de logiciels commerciaux.\n\nJe vais essayer de traduire l'article et l'ajouter à mon post initial.\n\n\n\n\n\n\n\n",
			"post_id": 10,
			"date_added": 1458819789
		},
		{
			"comment_id": 7,
			"body": "Oui tu as raison Ghostery est aussi un super module :)\nIl y a aussi NoScript, mais peut parfois être corsé à utiliser, à déconseiller aux novices.",
			"post_id": 8,
			"date_added": 1458906165
		},
		{
			"comment_id": 8,
			"body": "Tout est trop centralisé ^_^ même mon cerveau!\n\nSinon j'ai lu sur Numérama:\n> À partir du 1er juin 2016, toutes les publicités des FAI qui indiquent le débit descendant d'une offre d'accès à internet devront aussi préciser le débit montant.\n\nhttp://www.numerama.com/tech/154953-debit-upload-devra-etre-precise-pubs-fai.html",
			"post_id": 9,
			"date_added": 1458906443
		},
		{
			"comment_id": 9,
			"body": "bienvenue \\^_^/ ",
			"post_id": 2,
			"date_added": 1458945669
		},
		{
			"comment_id": 10,
			"body": "Salut @elnormand,\nNon j'ai simplement téléchargé l'.apk sur (KAT.cr) pour ne pas le citer :)\nVoici le lien: https://kat.cr/spotify-music-v4-6-0-689-premium-mod-t11976108.html\n",
			"post_id": 6,
			"date_added": 1463485441
		},
		{
			"comment_id": 11,
			"body": "J'avoue tribler est un client torrent prometteur mais terriblement lent chez moi, je suppose que c'est le prix à payer pour avoir l'anonymat. Je fais des tests en modifiant ma config, j'essaye avec moins de proxys. \nPour le moment j'utilise encore le bon vieux uTorrent Serenity. ... (ne me lancez pas des cailloux svp...), mais je vais suivre avec attention l'évolution de Tribler ainsi que https://webtorrent.io/ \\^__^/ ",
			"post_id": 6,
			"date_added": 1463526499
		},
		{
			"comment_id": 12,
			"body": "Merci pour ton retour @elnormand, au moins j'ai une piste à explorer maintenant. Si je trouve une solution je n'hésiterai pas à la partager biensur ^^",
			"post_id": 13,
			"date_added": 1463526631
		},
		{
			"comment_id": 13,
			"body": "Il est super qBittorent rien à dire, un must-have.\nEn plus il est multi-plateforme, que demande le peuple! :)\n\nIl manque juste un LeecherMod pour pouvoir télécharger sans se soucier du ratio sur les trackers privés :) c'est pour ça que j'utilise encore uTorrent Serenity, c'est le seul client qui propose ça à ma connaissance.",
			"post_id": 6,
			"date_added": 1463613791
		},
		{
			"comment_id": 14,
			"body": "Salut @b0rk, ça roule merci! ^...^\nmerci pour ton petit message, ça fait toujours plaisir de voir qu'il y a de l'activité sur ZeroNet.",
			"post_id": 2,
			"date_added": 1463678784
		},
		{
			"comment_id": 15,
			"body": "Ouais t'as raison @noob, qTox a l'air bien plus abouti. En plus on a la possibilité d'exporter son profil au format .tox pour l'importer dans Antox sous Android par exemple. Du tout bon.",
			"post_id": 4,
			"date_added": 1463678941
		},
		{
			"comment_id": 16,
			"body": "Non, pour ma part cela n'a pas supprimé mes messages, curieux cette affaire :)",
			"post_id": 13,
			"date_added": 1464034671
		},
		{
			"comment_id": 17,
			"body": "J'avoue... faut pas suivre mon exemple :D\nMais pour ma part j'ai pas une connexion en fibre symétrique, mon upload est vraiment trop lent. Si je télécharge un ou 2 blueray faudrait que je passe la semaine a uploader pour conserver un bon ratio. :D",
			"post_id": 6,
			"date_added": 1464034810
		},
		{
			"comment_id": 18,
			"body": "Pourtant j'ai posté d'autres msg après cette date! .. j'y pige plus rien :)",
			"post_id": 13,
			"date_added": 1464112803
		},
		{
			"comment_id": 19,
			"body": "Je t'en prie @tonythefrench, avec plaisir!",
			"post_id": 9,
			"date_added": 1464112839
		},
		{
			"comment_id": 20,
			"body": "J'avoue, c'est la première chose qu'on cherche sur ZN. D’ailleurs ils devraient en intégrer un sur la page d'accueil ZeroHello.",
			"post_id": 3,
			"date_added": 1464112968
		},
		{
			"comment_id": 21,
			"body": "ah mais oui... tu as raison @elnormand !!! je viens effectivement de constater que mes messages antérieurs à cette date (18/05/2016) ont disparu du Chat FR... je ne m'en étais même pas rendu compte!",
			"post_id": 13,
			"date_added": 1464124494
		},
		{
			"comment_id": 22,
			"body": "Nan ça fonctionne que sur Zeronet :) \n\nTu peux pas la partager avec l'extérieur car si je voulais partager le lien de la vidéo avec l'extérieur je devrais donner l'adresse: 127.0.0.1 = localhost (donc ça renvoie sur la machine hôte de l'utilisateur) et s'il n'a pas ZeroNet installé il ne verra rien :)",
			"post_id": 21,
			"date_added": 1464207844
		},
		{
			"comment_id": 23,
			"body": "^_^ j'aime ton enthousiasme! \n\nBah non, ZeroNet tout entier est un réseau à part, il fait partie de ce que l'on appelle le DeepWeb (web profond) ou le DarkWeb (le web caché) comme les réseaux Freenet ou i2p. Ce sont des réseaux décentralisés de Pair à Pair (P2P). Chaque machine est donc client et serveur :)\n\nLe web traditionnel c'est le \"ClearWeb\" qui est de plus en plus centralisé et contrôlé par des grandes entreprises qu'on nome \"GAFAM\" (Google, Apple, Facebook, Amazon, Microsoft).\n\nDonc cette vidéo est hébergée/partagée par moi et ceux qui sont venus visiter mon blog (toi aussi) :) Si tout le monde se déconnecte elle n'est plus visible, mais tant qu'il y a une seule personne connectée elle sera encore visible :) C'est la force des réseaux décentralisés.\nLes contenus populaires sont donc très difficiles a censurer (voir impossible).\n",
			"post_id": 21,
			"date_added": 1464215773
		},
		{
			"comment_id": 24,
			"body": "@up4 : je comprends pas,  pourtant tu peux voir la vidéo sur cette page non ? Elle fait 3.6mb au format .webm \nSi tu regardes sur cette page par exemple: http://127.0.0.1:43110/1Gn9DgEuDZVKeaq449oiMZQnE9uPLziyCm\nLa vidéo de dessous fait plus de 6Mb, je peux la voir sur mon disque dur dans... data/1Gn9DgEuDZVKeaq449oiMZQnE9uPLziyCm/bunny.mp4\nPareil pour ce site: http://127.0.0.1:43110/1GAKtBpSxrZk6VKPS6iythg3VbQEwgS7yU  il héberge bien ses 3 vidéos, elles font plus de 1Mb pourtant.",
			"post_id": 21,
			"date_added": 1464217484
		},
		{
			"comment_id": 25,
			"body": "ok merci pour ces infos :)",
			"post_id": 21,
			"date_added": 1464218783
		},
		{
			"comment_id": 26,
			"body": "Vivement le support des tables de hachage distribuées alors :D (le mec qui vient de lire l'article DHT sur wikipedia)\nVa te couper la barbe Wolverine! \\^__^/",
			"post_id": 21,
			"date_added": 1464219308
		},
		{
			"comment_id": 27,
			"body": "^_^ j'ai un début de duvet, j'en suis pas peu fier!!!",
			"post_id": 21,
			"date_added": 1464219418
		},
		{
			"comment_id": 28,
			"body": "Hein! Mais t'es un fou toi :D...\n\nPourquoi ne pas utiliser le routage en onion de [Tribler](https://www.tribler.org/) s'il ne veut pas utiliser Tor pour l'échange de gros fichiers ?",
			"post_id": 21,
			"date_added": 1464262764
		},
		{
			"comment_id": 29,
			"body": "Dit comme ça ... ouais, c'est pas vendeur :D",
			"post_id": 21,
			"date_added": 1464268452
		},
		{
			"comment_id": 33,
			"body": "Salut @elnormand,\nOui ZN peut communiquer avec l'extérieur bien-sur.\nPar exemple je peux insérer une vidéo youtube sur mon blog. (je l'ai fait ci-dessus)\n\nPar contre, depuis le ClearWeb ceux qui pourront accéder à ce blog seront seulement ceux qui auront installé ZN sur leur machine, pas les autres car ils seront redirigés vers leur propre machine \"localhost\".\n\nJe pense que tu parlais de ce site qui peut récupérer ton IP: http://127.0.0.1:43110/1Ey8WR7e3quTdPTMZZKDdqw2U6JG3zvkHe Il communique avec un script qui se trouve a l'adresse: http://www.l2.io\n\nLa preuve par l'image : http://127.0.0.1:43110/16g8mFUtLsQBM6bPMJ6xEEQWLWAufnzEXA//medias/img/l2io.jpg\n\nComme tu peux le voir il n'affiche pas mon adresse ip car j'ai installé un module complémentaire firefox qui empêche les sites de charger du contenu exterieur a leur propre adresse, ce module s'appelle uMatrix: https://addons.mozilla.org/en-US/firefox/addon/umatrix/\n\nIl y a une autre méthode décrite sur le blog de @erkan plus radicale, c'est de modifier ton proxy avec ton adresse localhost 127.0.0.1 comme ceci: http://127.0.0.1:43110/zeroblog.bit/?Post:60:protect+yourselves:+set+a+non-working+proxy",
			"post_id": 21,
			"date_added": 1464389975
		},
		{
			"comment_id": 35,
			"body": "Envoie le lien vers ton blog en commentaire ^_^\nEt comment t'as fait pour lever la limite à 1000k ? :)",
			"post_id": 18,
			"date_added": 1464390153
		},
		{
			"comment_id": 37,
			"body": "Parfait merci :)\nEt est cool d'avoir fait un modèle de blog clonable avec le ZeroverseID et la limite des commentaires levée :) je vais le mettre sur le wikiFR :)",
			"post_id": 18,
			"date_added": 1464391970
		},
		{
			"comment_id": 38,
			"body": "Merci @elnormand, j'ai reussi à lever la limite des messages, par contre on ne peut toujours pas poster avec une ZeroVerseID ici...\n\nÇa m'affiche \"Content publish failed\", je vais continuer de fouiller :)",
			"post_id": 18,
			"date_added": 1464447793
		},
		{
			"comment_id": 39,
			"body": "test",
			"post_id": 26,
			"date_added": 1464448050
		},
		{
			"comment_id": 40,
			"body": "@vincentolivier J'en conviens, ma phrase n'était pas très explicite mais elle sous-entendait que je ne voulais pas voir de sujets pro-pédophilie. Autrement dit des sujets incitant aux abus sexuels sur mineurs non-consentants ou au viol d'enfants.\n\nAprès, les questions que tu soulèves ont plus rapport avec la majorité sexuelle qui selon moi est un sujet comme un autre sauf qu'il ne me passionne pas plus que ça et que je suis loin d'avoir un avis sur tout d'ailleurs.\n\nEnsuite pour ma part je pense qu'une liberté d'expression totale est souhaitable et bienvenue si elle à pour but d'exposer un point de vue, une pensée, une réflexion, une idée. Mais il s'agit d'un outil comme un autre, selon comme on l'utilise on peut également attiser la haine, discriminer, injurier, agresser... dans ce cas je trouve cet outil moins salutaire.\n",
			"post_id": 27,
			"date_added": 1464919091
		},
		{
			"comment_id": 41,
			"body": "Je ne vais pas me rabaisser à justifier des propos que je n'ai pas tenus, et il serait tout aussi facile pour moi d'injecter dans les tiens un sens tout aussi nauséabond ou farfelu.\n\nPour ma part j'utilise le sens commun des mots. Hors quand on parle de pédophilie, pour une écrasante majorité des gens ce terme désigne bien l'abus sexuel d'un adulte sur un enfant. Et je maintiens que je suis contre tout sujet pro-pédophilie.\nAprès, que tu considères que l'âge de la majorité sexuelle mériterai d'être débattue, même s'il s'agit d'un sujet qui ne me passionne pas, mais au nom de quoi voudrai-je l'interdire...\n\nSi le but de ton intervention était de dire que tout sujet, même un aussi controversé que celui-la, mérite sa place et mérite d'être débattu comme n'importe quel autre sujet, je te l'accorde si pour autant le but du sujet n'est pas d'en faire l’apologie.\n\nPour quelqu'un qui attache une grande importance aux sens des mots tu sembles prendre un malin plaisir à détourner le sens des miens.\nSi ta façon de débattre passe par le travestissement des pensées de ton interlocuteur alors je comprends mieux d’où provient ton sentiment de grandeur. \n\nPS: Est-ce que vous pouvez me dire si vous arrivez à lire ce message ? Car quand je le publie cela m'affiche \"Content publish failed\"\n\n\n",
			"post_id": 27,
			"date_added": 1464952158
		},
		{
			"comment_id": 42,
			"body": "Merci @bluecheese ^^",
			"post_id": 2,
			"date_added": 1475057617
		},
		{
			"comment_id": 43,
			"body": "@sbsbsb content que ça te plaise :)",
			"post_id": 8,
			"date_added": 1475096870
		},
		{
			"comment_id": 45,
			"body": "Avec plaisir :)\n\n",
			"post_id": 28,
			"date_added": 1475181593
		},
		{
			"comment_id": 54,
			"body": "quelqu'un peut voir ce commentaire ?",
			"post_id": 29,
			"date_added": 1475875680
		},
		{
			"comment_id": 55,
			"body": "Salut @ci, ça me fait plaisir aussi ^^ , courage pour ton apprentissage !",
			"post_id": 2,
			"date_added": 1475875734
		},
		{
			"comment_id": 56,
			"body": "Ahh cool merci ^^ ",
			"post_id": 29,
			"date_added": 1475879285
		},
		{
			"comment_id": 57,
			"body": "@sickbird bienvenu au club ^^",
			"post_id": 4,
			"date_added": 1476207423
		},
		{
			"comment_id": 58,
			"body": "@sickbird: moi je l'ai installé sur W7, je l'ai téléchargé ici > [OpenVPN](https://openvpn.net/index.php/open-source/downloads.html)",
			"post_id": 32,
			"date_added": 1476530993
		},
		{
			"comment_id": 59,
			"body": "@greatesick: je t'en prie ^^",
			"post_id": 32,
			"date_added": 1476548895
		}
	],
	"comment_vote": {},
	"post_vote": {
		"3": 1,
		"8": 1,
		"21": 1
	}
}