{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1560452233,
			"title": "What happens if suddenly everyone becomes offline (so a website has no peers)?",
			"body": "Hi, In Zeronet what would happen if every peer of a website becomes offline? would the website go offline?",
			"added": 1560452232
		},
		{
			"topic_id": 1560623238,
			"title": "Some more questions (about files and search function)",
			"body": "Hi,\nI haven't yet found it so here it goes:\n\n-Does zeronet have some kind of deduplication, so for example, on kopycat, if the same video already exists, will it use the already existing version on the network or would it host a new one?\n-Does ZeroTalk have some search function?",
			"added": 1560623236
		},
		{
			"topic_id": 1560716669,
			"title": "We really need some categories/tags on 0talk/KopyKate",
			"body": "Hey,\n\nSo i've used 0net lately, it seems a really nice concept, but 0talk and kopykate (the biggest video zite that i'm aware of) need tags or categories, at least, to separate NSFW and SWF content\n\nEDIT: And 0up, well... most zites that can have *graphical content*",
			"added": 1560716666
		},
		{
			"topic_id": 1561067598,
			"title": "How much would it cost to register a domain?",
			"body": "*A .bit domain",
			"added": 1561067594
		}
	],
	"topic_vote": {
		"1560529461_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	},
	"next_comment_id": 28,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "So how does this thingy work?",
				"added": 1560450094
			},
			{
				"comment_id": 2,
				"body": "> [holeyhouseofair](#comment_12_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): not many people use it, its a nice idea in principle\n\nYeah, it actually seems pretty cool, with a nice design and all, which zites (is that what it is called?) are nice to visit for a newcomer?",
				"added": 1560451912
			},
			{
				"comment_id": 4,
				"body": "What would happen if i exceed the 50K text limit?",
				"added": 1560455001
			},
			{
				"comment_id": 5,
				"body": "> [holeyhouseofair](#comment_13_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): sorry, can't help, i'm a newcomer myself, fuckboi.bit is a chuckle. but I thought randomly browsing p2p hosted sites might be a bit dangerous so I stopped looking at them under the zeroname.bit registry. [...]\n\nWell, just the simple fact of being here, sending these messages is \"dangerous\", from what i understood just sending a message will show your/tor IP to all peers connected",
				"added": 1560462719
			},
			{
				"comment_id": 25,
				"body": "> [charoniv](#comment_2_1AZUBBXiKcUJsTb1dGEJHxs1Lze6FDrizF): are you hacker????\n\nI am hacker, are you hacker?",
				"added": 1561493215
			}
		],
		"1560452233_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA": [
			{
				"comment_id": 3,
				"body": "> [mg0](#comment_54_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Until any of the peers comes back online, pretty much becomes offline, yeah.\n\nI see, but in case of a \"big\" website there would be a server at least seeding (acting as a peer, i don't understand much on how zeronet works yet) , so it would never go offline, unless that server went down (same as in clearnet )",
				"added": 1560452606
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 6,
				"body": "Does zeronet have some kind of deduplication for files like ipfs?",
				"added": 1560505913
			},
			{
				"comment_id": 7,
				"body": "Hmm it seems like it is not possible to edit things so.... How would zeronet be scalable? Since every comment and post (in zerotalk case) goes to every user, wouldn't storage be a problem later on?\n\nEDIT: oh i see it :D",
				"added": 1560507913
			},
			{
				"comment_id": 9,
				"body": "> [leftside](#comment_789_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That's why i'm always talking about the timestamp based site splitting system. [...]\n\nhmm so you mean like each day a \"backup\" is made and then some peers get one day and some peers get other day?",
				"added": 1560523272
			},
			{
				"comment_id": 10,
				"body": "> [leftside](#comment_791_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Plz refer to this, too.\n\nhmm but then, what if you wanted to check old posts/comments/content? since almost no one had it it would be really difficult to get it (no seeds)",
				"added": 1560524053
			},
			{
				"comment_id": 11,
				"body": "How can I install ZeroNet to remote machine? is intended to make the \"remote machine\" work as a proxy, right? So it would connect to zeronet and then send the files to the destination computer through cleanet?",
				"added": 1560527317
			},
			{
				"comment_id": 12,
				"body": "> [leftside](#comment_792_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): As I already mentioned serious Zeronet keepers never abandon old archives.If it were abandoned, that would simply mean that it's just really useless.\n\nThat is arguable, you might have some archive which people don't care right now, but most likely will try to search for it in the future and find nothing :/ That's my concern about zeronet, besides that, the zeronet idea is amazing",
				"added": 1560600966
			},
			{
				"comment_id": 13,
				"body": "> [leftside](#comment_795_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That's a piece of cake to overcome as long as u decided to begin my idea.\n\nguess i still don't get your idea, so you say that old files should go to an archive, which gets distributed to who requests older files/threads/comments, right? in this case the old files would be easily lost",
				"added": 1560612383
			},
			{
				"comment_id": 19,
				"body": "> [agentofuser](#comment_2_1LLawDt1mCR8RmM1BemAHtqqceDhCxXEqu): Is there a zeronet-hosted version of the docs?\n\nNot sure if this is official, but here it is http://127.0.0.1:43110/1DocsYf2tZVVMEMJFHiDsppmFicZCWkVv1/\n\n> [leftside](#comment_798_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): why do we have to lose them?We can keep them if we want.There's no need to make a limit regarding ur idea.\n\nThe initial problem is that 0net is not scalable space-wise, if you don't want to lose files, everyone loading a certain zite has to download all the files (the main files, not the optional files, kopykat has like 600GB in optional files IIRC), that is not really space efficient if we get some zite like reddit or wikipedia is (text wise)",
				"added": 1560880950
			}
		],
		"1560456511_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 8,
				"body": "No peers :/",
				"added": 1560513874
			}
		],
		"1560623238_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA": [
			{
				"comment_id": 14,
				"body": "> [leftside](#comment_796_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): This feature requires fine intervention of the human to vote on what to deduplicate and from which point to which point to refer.AI could do the job sooner or later.\n\nThat wouldn't be needed, IPFS has deduplication based on file hash, but i'm not sure if that would fit on Zeronet though",
				"added": 1560696644
			},
			{
				"comment_id": 18,
				"body": "> [leftside](#comment_797_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Hash-based file matching system doesn't catch up with the cropped or quality-modified ones.\n\nsure it doesn't, but it does prevent duplication of equal files, which would save a lot of space",
				"added": 1560776396
			}
		],
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": [
			{
				"comment_id": 15,
				"body": "> [brunomoutier](#comment_1_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep): And this is a Zite proxied to clearnet\n\nJust out of curiosity, is there any zite that does the oposite? clearnet to 0net",
				"added": 1560708605
			},
			{
				"comment_id": 16,
				"body": "> [filips](#comment_34_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Probably no, because it is not needed. If you have ZeroNet, you also have clearnet. So you can just normally open clearnet website.\n\nnot necessarily, zeronet works without internet access (someone posted a video using 0net on a LAN), but i don't see how that proxy would work though, even if just one of the computers had internet access, there would be no way to \"ask\" that specific computer to get the clearnet site data and put it in 0net (unless i'm missing some technical detail)",
				"added": 1560708891
			},
			{
				"comment_id": 17,
				"body": "> [filips](#comment_35_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You could run program that download site's files and then put it to ZeroNet site. But you would have to do this when you have internet access and site won't be interactive.\n\nyeah, i wasn't really thinking about the technicals, :)",
				"added": 1560712100
			}
		],
		"1561014446_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 20,
				"body": "Is there any file size limit or something on zeroup? If not why separating the file in multiple parts?",
				"added": 1561028899
			},
			{
				"comment_id": 21,
				"body": "> [trustmenot](#comment_5_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75): Yes there is: it's 200 mb and we can upload only some formats (.zip, .tar.gz, mp4 and few more). That's why I had to split, then zip (and not the viceversa, for example). If you're interested in something in particular just ask for the upload :)\n\nBummer, i thought it had no limit (like torrents), do you have an idea when the \"test period\" will end?",
				"added": 1561029513
			}
		],
		"1560995957_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 22,
				"body": "> [r3naam3r](#comment_5_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM): Please at least use invidio.us instead of YT links. We're in ZeroNet, after all. PeerTube would be the most preferred.\n\nOr even kopykat ;)",
				"added": 1561032170
			}
		],
		"1561067598_16jR7jLoJPHcGJV9tE1uSugPNMNDvS4zXA": [
			{
				"comment_id": 23,
				"body": "> [styromaniac@kxoid.bit](#comment_95_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): Like 3¢\n\nSo is it like just a transaction (without any minimum value)?\n\n> [duende](#comment_89_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2): Kill yourself.\n\nTell me more",
				"added": 1561069572
			}
		],
		"1561382724_1DRUKfZhYCZfFbQmXXgNmA3PfpqeYcxdwB": [
			{
				"comment_id": 24,
				"body": "Those VPNs wouldn't work on networks where DPI applies though",
				"added": 1561400027
			}
		],
		"1561588776_17qFwdksVrSSiUjiwKJbVJs81QNDi8b4hg": [
			{
				"comment_id": 26,
				"body": "Maybe some routing problems?",
				"added": 1561634926
			}
		],
		"1566475780_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 27,
				"body": "Well, who uses edge / internet explorer most likely wouldn't be \"aware\" of zeronet",
				"added": 1566547148
			}
		]
	},
	"comment_vote": {
		"12_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57": 1
	}
}