{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1626871884_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 1,
				"body": "> [driud2](#comment_12_1JDpHhGdjABkY3qGtr7oBuzKADmLQvMt4x): Привет; Вы хорошо и подробно все описали, есть пара несоответствий. Но это небольшой пик против всей статьи. Проблема в этом. Что мы живем в двух разных странах? У вас еще есть, в основном управляющие, которые говорят на вашем языке. У меня управляющие имеют два гражданства и разговаривают на иностранном языке. Все руководящие должности заняли люди с двумя гражданствами. Они могут делать все, что захотят, с нами с одним гражданством. Вторая проблема заключается в том, что людей усыпили химически. Это уже не люди, а био-роботы. Я общаюсь с такими каждый день, нормального уже не встретишь, или это сделать очень сложно.С био-роботом ни о чем конкретном не поговоришь. Они уже отключены от нормального, самостоятельного, мышления. Это драма для нас как нации. Мы пережили санацию, оккупацию, захваты и разделы; теперь наш народ был уничтожен, честь бежала, уехала за границу, за хлебом. Те, что остались? Их заменяют другие народы, чужие. Это основная наша проблема.. Ваши советы в основном хороши, но скажите, как их передать широкой публике? Эти люди просто смотрят телевизор, и до них ничего не доходит.С уважением.PS. приятно разговаривать с тем, кто понимает проблемы.\n\nпривет. я не автор статьи, но у меня есть небольшое предложение как это реализовать. можно снять небольшой ролик о разоблачении правительства и следом - эти советы. далее нужно распространить этот ролик во всех известных видеохостингах(преимущественно YouTube). делать это нужно всем и сообща, с множества аккаунтов, иначе YouTube будет очень быстро блокировать ролики. так же нужно научиться перехватывать сигнал телевидения и вбрасывать туда этот ролик. делать это, опять таки, нужно всем, так как все живут в разных точках страны и телевидение распространяется только на определённое расстояние, тоесть район, в котором ты живешь. и с чем большего количества мест удастся перехватить сигнал и прокинуть видео - тем больше людей, которые просто смотрят телевизор, увидят его.\n\nесли скооперироваться, собрать пользователей с полезными навыками и/или самим научиться, то всё может получиться.",
				"added": 1627196965
			}
		]
	},
	"comment_vote": {}
}