{"next_paste_id":1,"next_comment_id":0,"paste":[{"paste_id":0,"description":"Bible in the darknet","body":"Bible in the darknet\n--------------------\n\nhttps://bible4u.net is a project which is dedicated as an internet Bible available in various darknet networks. Provides various public domain translations available to free read and download (in PDF, XML, LaTeX and TXT format).\n\nMirrors:\n\thttp://holybible.rocks\n\thttp://bible4.me\n\nHere are its darknet links (with some other interesting Christian pages available on darknet):\n\n=== ZeroNet ===\n\nhttp://127.0.0.1:43110/bible4u.bit - Bible4u (ZeroNet mirror) - Free Bible translations in multiple languages available to read online and to free download (PDF, XML, LaTeX and TXT format).\n\n=== TOR ===\n\nhttp://bible4u2kjgjvbxs.onion/ - Bible4u (Tor mirror) - Free Bible translations in multiple languages available to read online and to free download (PDF, XML, LaTeX and TXT format).\nhttp://rijmkns2jo23ax3p.onion/ - Down Tor Bible - Download free Christian Holy Bible for you to read, study, on your portable laptop or computer.\nhttp://sonofgod5u4eafyv.onion/ - The Holy Gospel! Bringing Light to the Dark Web! - This website is dedicated to providing secure access to the Christian Bible and New Testament texts to countries where the bible is forbidden.\n\n=== I2P ===\n\nhttp://bible4u.i2p/ - Bible4u (I2P mirror) - Free Bible translations in multiple languages available to read online and to free download (PDF, XML, LaTeX and TXT format).\n\n=== Freenet ===\n\nhttp://127.0.0.1:8888/freenet:USK@iQVx3wWN1wYC8ZQDoT5iKd~n1irZ4JgEK2wAGL9bUE8,Y8PpufzBB7KM-KjUeggSNRJ0PzsEjUQHCdGrjNUDvNs,AQACAAE/bible4u/4/ - Bible4u (Freenet mirror) - a limited static Freenet version of Bible4u page.\nhttp://127.0.0.1:8888/freenet:USK@hduc0Y9l9TwaM1psUSr3JXBK5a2W5-ToWg4701AS4io,3LpFeSArmcUNY0WumSpHILtCRqgWAgNZjGTUoJKpptc,AQACAAE/TCR/9/ - True Christian Resources - several Bibles and Christian books to download.\n\nA free Bible for You with a several translations available to read and free download. This Bible project is also available within various darknet networks. Our mission is to provide a various Bible translation in the areas, where an internet censorship is present.\n","language":"text/plain","encrypted":false,"added":1546189500}],"comment":[]}