{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Preparação IME/ITA",
			"body": "- IME(Instituto Militar de Engenharia) - http://www.ime.eb.mil.br/pt/\n- ITA(Instituto Tecnológico de Aeronáutica) - http://www.ita.br/\n\n#Dicas de livros e recomendações para aqueles que desejam tentar o vestibular do IME ou ITA.\n\n- Elaborado por Pedro Siciliano Peixoto.\n\n#MATEMÁTICA\n1.Geometria II (Morgado)\n- Importantíssimo para o aprofundamento em Geometria, que costuma ser um ponto cobrado\nfortemente na prova do IME. Sempre há 1 ou 2 questões de geometria, e normalmente a\ndificuldade é elevada. Caso haja maior dificuldade, recomendo adquirir também Geometria I, do\nMorgado.\n\n2.Produtos Notáveis, Fatorações e Desigualdades - Volume 1 da Coleção Tópicos de Matemática\n – IME/ITA/Olimpíadas (Carlos A Gomes)\n- Outro livro essencial para a prova do IME. Desenvolve um pensamento abstrato e comparativo,\nmuito exigido, contém um elevado número de exercícios de boa dificuldade e, em geral, clássicos\nem Matemática. Além disso, introduz as principais desigualdades, como a desigualdade de\nmédias, sempre repetida e empregada para provar teoremas.\n\n3.Problemas selecionados de Matemática IME/ITA/Olimpíadas (Marcilio Miranda)\n- Livro de apoio, com uma coletânea de exercícios difíceis do mundo todo, muitos dos quais já\nestiveram presentes no vestibular do IME.\n\n4.Análise Combinatória e Probabilidade (Augusto César Morgado)\n- Livro de importância periférica, mas bom para aqueles que encontram maiores dificuldades em\ncombinatória avançada. Os que preferirem podem simplesmente buscar provas anteriores do IME\n(quase sempre há uma questão de Combinatória), mas a carga teórica do livro ajuda a completar\no aprendizado.\n\n5.Números Complexos e Polinômios (Caio dos Santos Guimarães)\n- Livro importantíssimo, talvez o mais importante para a prova de Matemática do IME. Aborda o\ntema de duas questões certas na prova. Complexos e Polinômios normalmente são cobrados em\nalto nível, e, sem esse livro, muitas relações geométricas e operações difíceis de serem cobradas\n(mas exigidas) serão ignoradas. Não esqueçam dele!\n***Determinantes também são uma constante na prova. Aprofundem-se no tema, até\ndeterminantes de 4ª ordem (não ignorem, porém, os de 5ª ordem). Costumam ser uma questão\ndifícil.\n***Logaritmos em geral também sempre se fazem presentes. Especialmente o logaritmo natural.\n\n#FÍSICA\n1.Fundamentos da Mecânica - volumes 1 e 2 (Renato Brito)\n- Livros que todos os aspirantes a alunos do IME já leram ou possuem para Física. Mecânica é,\nconhecidamente, o tópico preferido do IME, e a cobrança é sempre relacionada à Matemática e\nbem aprofundada, como o livro transmite.\n\n2.Coleção Física Clássica (Caio Sérgio Calçado)\n- Coleção adotada pelo CSA-NL. Boa no conteúdo teórico e exercícios, mas requer eventual\naprofundamento com pesquisas na internet, pois não é voltada para um estudo aprofundado.\nFazer exercícios mais difíceis.\n\n3.Curso de Física Básica (Moysés Nussenzveig)\n- Livro de aprofundamento, bem mais apurado, adotado por algumas instituições de nível superior\nno curso básico. Aborda conceitos mais complexos que, às vezes, são cobrados no IME.\n***Estudar conceitos mais difíceis como MHS e suas equações, efeitos de 2 molas combinadas,\netc. A parte de ondas também requer aprofundamento.\n*** Conceitos básicos de integral e derivada também são abordados.\n***Estudar projeções em geral, revisando a cartesiana <ux, uy, uz> e vendo, especialmente,\ncoordenadas esféricas.\n\n#QUÍMICA\n1.Princípios de Química (Peter Atkins)\n- Essencial. Toda a Química pode ser estudada por ele, no que diz respeito ao IME ou ao ITA.\nPrestar atenção nas 3 leis da Termodinâmica, no aprofundamento de entropia, em Química\nOrgânica (principalmente nomenclatura, com questões de elevada dificuldade), e, principalmente,\ntomar conhecimento de fórmulas mais complexas, como a Lei de Arrhenius, relações entre\npressões de vapor, energia livre de gibbs, etc., além de um estudo mais profundo de Cinética\nQuímica e o conhecimento quantitativo das propriedades coligativas.\n\n2.Química (Feltre)\n- Adotado pelo CSA. Bom ao nível de embasamento, mas não aborda todos os assuntos cobrados\nna prova.\n***Não bobear em Química. Conhecer compostos e reações orgânicas de maior importância. A\nprova do IME em Química é muito abrangente, mas talvez não tão aprofundada. Atenção!\n\n#COMENTÁRIOS GERAIS\n- ... Em primeiro lugar, vamos analisar a prova em si. São 4 dias cansativos de prova, com cerca de\n4 horas de em cada um, contendo Matemática, Física, Química e Português-Inglês, com pesos 3 2,5 - 2,5 - 1-1. É redundante dizer que o conteúdo das provas é muito maior do que o pedido em\noutros vestibulares, e a dificuldade também é bem superior. Porém, a atenção à matemática em\nespecial é muito importante, pois é o primeiro critério de desempate na classificação e tem peso\nmaior do que todas as outras matérias. É também considerada a prova mais difícil do IME, via de\nregra. Física também pode ser bem difícil, então atenção! Química, normalmente, não é uma\nprova muito trabalhada, mas é abrangente, e, portanto, cansativa. Além disso, atenção para tirar\nmais de 4 em todas as provas, ou o candidato é automaticamente eliminado!\n- Quanto à fase objetiva, antes da própria fase discursiva sobre a qual estamos discutindo, há 40\nquestões, das quais devemos acertar 20, com pelo menos 40% de aproveitamento em cada\nmatéria (15 - matemática, 15 - física, 10 - química). Algumas são questões básicas, mas outras\npodem ser bem complicadas, então a atenção é imprescindível para poder passar para a próxima\nfase. Contudo, o número de acertos não alterará sua nota discursiva, que vai compor, sozinha,\nsua nota final. Assim, recomendo treino constante em múltipla-escolha.\n- Por fim, para toda a prova e o processo anterior a ela, reforço que é necessário muito estudo, e\na atenção nunca pode ser perdida. O processo seletivo é disputado por muitos candidatos que se\nprepararam especificamente para IME-ITA por anos, e estudam há muito com esse foco, e\nsomente as matérias de exatas que estão presentes no concurso. Dessa forma, às vezes não dará\npara entrar em detalhes em todos os assuntos, mas isso pode ser compensado satisfatoriamente\ncom o esforço do próprio aluno e, em especial, com sua atenção durante a prova. Erros bobos\npodem custar sua classificação, e o treino inibe erros bobos. Refazer provas antigas, ler, reler,\nquestionar e estudar constantemente são as características que distinguem o aluno do CSA, e só assim o sucesso pode ser obtido. Às vezes, na escola, basta a \"inteligência\", mas, nessa prova,\nela não valerá nada sem o esforço.\n\n#DICAS\n* Provar teoremas sempre de modo ilimitado, quando possível. O IME cobra muito casos infinitos\nou sequências lógicas complicadas, que devem ser deduzidas ou vistas antes da prova. Ou seja,\nnunca pense em números finitos, sempre tente alongar relações ao n-ésimo termo.\n* Repito: REFAÇAM PROVAS! Normalmente, as questões não são repetidas muitas vezes, mas\nas ideias são quase sempre constantes. Dê preferência às provas recentes.\n* Tenha pelo menos ideias de integral e derivada, ainda que não saiba operações complicadas.\n*SITE - \"rumo ao ita\" - muitíssimo importante para achar exercícios, dicas especiais, conteúdos\nteóricos extras, etc. Os conteúdos teóricos, especialmente, podem ser muito úteis.\n*Não precisa comprar todos os livros. Procurem outras fontes, pdf's, livros emprestados, ou, se\npreferível, compre de 2ª mão. Alguns, porém, como o Atkins de Química, será usado no Curso\nBásico do IME, então é um bom livro para se comprar. O site da \"vestseller\" contém quase todos\nesses livros para venda, se houver interesse. Muitos deles são pequenos ou têm preço bem\nreduzido, então não se preocupem em adquirir alguns, se quiserem!\n\n#BOA SORTE!",
			"added": 1546188884
		}
	],
	"topic_vote": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1_1G8X5xnLri7S9dzMLveQisPkejtJa8hNWm": [
			{
				"comment_id": 1,
				"body": "#Atkins – Princípios de química (pdf)\n- https://web.archive.org/web/20181230164555/https://crispassinato.files.wordpress.com/2016/03/atkins-princc3adpios-de-quc3admica-portuguc3aas-brasil.pdf",
				"added": 1546189003
			},
			{
				"comment_id": 2,
				"body": "#A Matemática no Vestibular do IME - Sérgio Lima Netto \n- https://web.archive.org/web/20181230154011/http://pessoal.educacional.com.br/up/4660001/2828833/IMEv17.pdf",
				"added": 1546189036
			},
			{
				"comment_id": 3,
				"body": "#Análise Combinatória e Probabilidade (Augusto César Morgado)\n- https://web.archive.org/web/20181230162820/https://portaldosaber.obmep.org.br/uploads/msg/5fpwf84eez8c0.pdf",
				"added": 1546189081
			},
			{
				"comment_id": 4,
				"body": "#Números Complexos e Polinômios (Caio dos Santos Guimarães)\n- https://mega.nz/#!zXozEABa!INa9611E5RUYTxTU-AHzVuzR4HUorfdKAyV7NKw9yCE",
				"added": 1546194432
			},
			{
				"comment_id": 5,
				"body": "#Geometria I - A.C. Morgado / E. Wagner / M. Jorge\n- https://mega.nz/#!vSYmiCDJ!Ng_qg8ZgAh9XGUvTbrJxYCysF07Fal9eZEo1dvb1rT4  \n\n#Geometria II - A.C. Morgado / E. Wagner / M. Jorge\n- https://mega.nz/#!vSQ2kCSb!8HrfuKLI3_WLTIfOVC3UletY3O5gtngSyBkx8nvngiE",
				"added": 1546195536
			},
			{
				"comment_id": 6,
				"body": "#Fundamentos de Mecânica - Renato Brito\n- Vol. 1: https://mega.nz/#!jORwXAaR!T2EW9MvlUCJQ6D5cgfbC5hCFzlEDKwNQ4ALSTGAJ4pg\n- Vol. 2: https://mega.nz/#!TfQwFKDI!HusP1Tpy0FuKnEqVwSRHsAGxgOUupYAcxbX4lgo-Pq0",
				"added": 1546198524
			},
			{
				"comment_id": 7,
				"body": "#Problemas selecionados de Matemática IME/ITA/Olimpíadas (Marcilio Miranda)\n- https://mega.nz/#!rfIQmaBT!DtaX3kU8nUUYuaFy4u2GLOohuaSZIFEUp4SYQ6e8uM4",
				"added": 1546199048
			},
			{
				"comment_id": 9,
				"body": "#Compendio Algebra para IME ITA ! (O melhor do mundo para IME ITA !!!)\n- https://mega.nz/#!LTREUSZJ!eAhD9KawiqWxXPrjYczjZ8AkIEoMWXuE0struJF6lKc",
				"added": 1546200487
			},
			{
				"comment_id": 10,
				"body": "#Elementos da Matemática Vol 2 - Marcelo Rufino e Márcio Rodrigues (IME ITA)\nGEOMETRIA PLANA \n- https://mega.nz/#!uKAmlSJQ!0lPjo1dm1rXbZ-OFcloktBPrvRZtGjhlmqvvdvU9VH8",
				"added": 1546201141
			},
			{
				"comment_id": 11,
				"body": "# Provas do Vestibular do ITA de alguns anos anteriores\n- http://www.vestibular.ita.br/provas.htm",
				"added": 1546201429
			},
			{
				"comment_id": 12,
				"body": "#Rumo ao ITA\nRumo ao ITA | Material gratuito pra você passar no ITA\n- https://rumoaoita.com/",
				"added": 1546201516
			},
			{
				"comment_id": 13,
				"body": "#Matemática resumo elementar\n- https://www.slideshare.net/trigono_metria/matemtica-resumo-elementar",
				"added": 1546202407
			},
			{
				"comment_id": 14,
				"body": "#CURSO DE NÚMEROS COMPLEXOS PARA O ITA\n- https://web.archive.org/web/20181230204114/https://rumoaoita.com/wp-content/uploads/2017/03/numeros_complexos_curso_de_numeros_complexos_ita.pdf",
				"added": 1546202559
			},
			{
				"comment_id": 15,
				"body": "#Questões ITA, IME, Vestibular e Concursos\n- https://www.youtube.com/playlist?list=PLYKguiakfI-grt_JVCIXWpzfmygwfG5_7",
				"added": 1546213413
			},
			{
				"comment_id": 16,
				"body": "#Como ESTUDAR com eficiência\n\"A diferença entre o mestre e o aprendiz, é que o mestre falhou mais vezes do que o aprendiz tentou\"\n- https://youtu.be/4grBqYAyI_o",
				"added": 1546217497
			},
			{
				"comment_id": 17,
				"body": "#Como passar em concursos, vestibulares e Enem? - Professor Pierluigi Piazzi\n- https://youtu.be/0qxDU96J-do",
				"added": 1546230497
			}
		]
	},
	"comment_vote": {}
}