{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1632925044,
			"title": "Zeroseed Pack V3-compatible fow Windows, Mac and Linux are out!",
			"body": "These packs can be useful to use V3 on desktop witout any hack until an official fork will be done, just use then with the Tor Browser:\n\nWindows: https://mega.nz/file/7ex03RIL#TfTIVWsKQVolqiSdR8XlbtVgB7uUkwBt1Ds3y4a1WLI\nMac: https://mega.nz/file/uOpCDLxS#GiALWjnu_5gYfFzMWqXOpTR370RuJq6HLK0r9dDtxO0\nLinux: https://mega.nz/file/vDpAgBrT#qLfXqtI0tQhmCOh1jgFsiYkncpSJHlpJ3oz9RcP6mRU",
			"added": 1632925043
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1630381630_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": [
			{
				"comment_id": 1,
				"body": "Please add these new trackers! in next days all my V2 trackers will be converted to v3.  If you manage a tracker please consider to migrate it to V3 because within a month all v2 will be disabled and actually tor zeronet network is congested (many seeded files on galactichan can't be downloaded and also forums like zerotalk don't sync properly in tor always mode)\n\nzero://pn4q2zzt2pw4nk7yidxvsxmydko7dfibuzxdswi6gu6ninjpofvqs2id.onion:15441\nzero://6i54dd5th73oelv636ivix6sjnwfgk2qsltnyvswagwphub375t3xcad.onion:15441",
				"added": 1631868687
			},
			{
				"comment_id": 2,
				"body": "New V3 trackers here:\n\nzero://wlxav3szbrdhest4j7dib2vgbrd7uj7u7rnuzg22cxbih7yxyg2hsmid.onion:15441\nzero://zy7wttvjtsijt5uwmlar4yguvjc2gppzbdj4v6bujng6xwjmkdg7uvqd.onion:15441\nzero://rlcjomszyitxpwv7kzopmqgzk3bdpsxeull4c3s6goszkk6h2sotfoad.onion:15441",
				"added": 1631956749
			},
			{
				"comment_id": 4,
				"body": "New V3 tracker also created on proxy VPS\n\nzero://tl74auz4tyqv4bieeclmyoe4uwtoc2dj7fdqv4nc4gl5j2bwg2r26bqd.onion:15441\n\nI broke the zeronet in the VPS adding the V3 support, but i redownloaded many zites in a fresh installation. Tell me if i miss some important zites",
				"added": 1631961612
			}
		],
		"1631935740_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 3,
				"body": "maybe the meek support is missing. i contacted the dev...",
				"added": 1631956782
			},
			{
				"comment_id": 5,
				"body": "> [xcape2net](#comment_976_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This says V2 sites will continue to work until you update to the new Tor browser that will be released next month.  If you don't update, you will continue to be able to reach v2 sites.  So, make a copy of your Tor browser now.\n\ni think when v2 support will be dropped also old v2 tor browser will be out of games without v2 exit nodes, bridges and intermediate nodes",
				"added": 1631964277
			},
			{
				"comment_id": 6,
				"body": "> [xcape2net](#comment_978_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I'm thinking it will take months for some v2 nodes to go off line.  I'm still confused about how this will affect access to ZeroNet.\n\nwithout v2 support zeronet  tor always mode nodes that use v2 as ID cannot communicate each others",
				"added": 1631967531
			}
		]
	},
	"comment_vote": {}
}