{
	"next_post_id": 2,
	"next_comment_id": 3,
	"next_follow_id": 1,
	"avatar": "generate",
	"user_name": "Unknownazzwipe",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1613435554,
			"body": "Hello ZeroMe!"
		}
	],
	"post_like": {
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613363780": 1613435646,
		"13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc_1613286076": 1613435832,
		"1Av994gwLx3FHCaMPWcCN3txfVApCHFsi7_1613040130": 1613438262,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613027872": 1613438385,
		"18V3yAk827Q61WfYormvHGbKgDx3cs3kyu_1612927207": 1613438534,
		"18V3yAk827Q61WfYormvHGbKgDx3cs3kyu_1612926285": 1613438564,
		"18V3yAk827Q61WfYormvHGbKgDx3cs3kyu_1612763310": 1613438616,
		"18V3yAk827Q61WfYormvHGbKgDx3cs3kyu_1612680861": 1613438650
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Interesting",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613363780",
			"date_added": 1613435698
		},
		{
			"comment_id": 2,
			"body": "@Satanlovesyou: I don't know if you're in the same country or not but there's been things to remove Christian ideals, eg. God in many things, most notably the national anthem. I do agree that most people don't care what someone does, however, I'm confused as to what you mean by \"so long as you keep it out of the capitol.\" Do you mean to imply that all Christians and all trump supporters riot in capitals? I don't mean to seem biased but nobody was outing  all democratic supporters when a select few were rioting when trump was first elected. Why do you seem to think that all Republicans do these things? Please, why say to keep it out of the capitol as if you're implying that all of a specific group riot in the capitol? Also, the main media is absolutely caring what republicans do, almost to an extreme degree. Have you seen the headlines? So many of them seem to imply that Republicans are all bad. You honestly can't expect us to believe that you all don't care what we do when your statement is so obviously geared to imply that all Christians and Republicans and Conservatives riot in the capitol or are all violent people. Can you wholeheartedly say that no Democrat supporters are bad, violent, and crude? If you can, you're lying or are just completely ignoring the facts. Though, if you do believe this, you're fucked. I mean seriously, that's some fucked up mindset. Perhaps even twisted and manipulated. Sorry, just saying... ",
			"post_uri": "16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S_1613226084",
			"date_added": 1613437509
		}
	],
	"follow": []
}