{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Экономика заслуг",
			"body": "Суть инициативы сводится к следующему. Давайте организуем жизнь таким образом, чтобы мы сами (а не узкий слой людей, принимающих решения, которых примерно 0.1%) могли выявлять заслуженных. И эти заслуженные люди, получали бы максимальные возможности и преимущества при:\n\nраспределении контрактов от государства,\n\nполучении заказов от коммерческих компаний,\n\nраспределении должностей в органах государственной власти и госучреждениях\n\nустройстве на работу в крупные корпорации,\n\nполучении налоговых и иных льгот,\n\nдоступе к различным видам ресурсов и т.д. и т.п.\n\nhttps://www.youtube.com/watch?v=RYxMqXg43yg",
			"added": 1554758057
		},
		{
			"topic_id": 1608592461,
			"title": "Журналисты подвели итоги года.",
			"body": "https://youtu.be/5jbFE7K-WkQ",
			"added": 1608592459
		},
		{
			"topic_id": 1610089549,
			"title": "Взгляд на происходящее в США от профессора эмигранта.",
			"body": "   https://youtu.be/toX7DC8St-k   #сша #usa #трамп",
			"added": 1610089546
		},
		{
			"topic_id": 1621742818,
			"title": "кино не для всех",
			"body": "Обалдел от подачи инфы.кино не для всех.САХАРОВ. ДВЕ ЖИЗНИ (2021)",
			"added": 1621742814
		}
	],
	"topic_vote": {
		"4_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h": 1,
		"1_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd": 1,
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": 1,
		"1_1MBBa4uLbwqT67VopHivqzZPfvWF8C9Ko6": 1,
		"2_12K5vsasxR5FDX2Pa9pv4YnYbpHJ8QoJTY": 1,
		"1585597315_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1,
		"1591860854_1HHNSMVnDWhbMLHohUAQnh4kjF9ZYwdiUc": 1,
		"1591001587_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": 1,
		"1589484353_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": 1,
		"1594730531_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv": 1,
		"1590655214_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": 1,
		"1584457808_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"1584283661_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1593644510_1DsDKkrbdNHdbm1wfWi4AwZvhgJn8jUKNz": 1,
		"1603890293_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ": 1,
		"1604941685_16JByxcaVSnx4QiPAXHjuV6hzi44uNoWCD": 1,
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": 1,
		"1606848904_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": 1
	},
	"next_comment_id": 46,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Однако +1",
				"added": 1539543800
			},
			{
				"comment_id": 22,
				"body": "Гамарджоба",
				"added": 1584517146
			},
			{
				"comment_id": 27,
				"body": "Пи",
				"added": 1586401685
			},
			{
				"comment_id": 38,
				"body": "-",
				"added": 1605456660
			},
			{
				"comment_id": 43,
				"body": "+",
				"added": 1623286426
			},
			{
				"comment_id": 45,
				"body": "Все тут)",
				"added": 1629774213
			}
		],
		"1_1FSr4KP1pQCjknEWexaNy89X3YZNL9ocgr": [
			{
				"comment_id": 2,
				"body": "Что,где,когда?",
				"added": 1545777162
			}
		],
		"1_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS": [
			{
				"comment_id": 3,
				"body": "Цель исследований – изучить основные концепции будущего человеческого общества, понять роль будущего в современном обществе и выделить наиболее общие прогнозы его формирования.\n\nПредмет исследований –  анализ связи эволюции человеческого познания и формирования представлений о будущем.\n\nОбъект исследований – философские концепции будущего человеческого общества, способы его предсказания и основные прогнозы.\n\nБудущее всегда имело очень специальное место в философии и, в общем, в людском разуме. Это поистине большое место, потому что люди нуждаются в предсказаниях того, что же с ними произойдет.\n\nНа самом деле,  мы  называем будущим ту  особую силу, заставляющую человека прилагать множество усилий, чтобы  жить не только сегодняшним днем, заботиться не только о  детях (как это делают все животные), но и о внуках, строить здания на века, творить искусство, развивать науку и технику, исследовать вселенную – и просто  часами мечтательно думать.\n\nФормирование представлений о будущем находилось в тесной связи с эволюцией научного знания о мире. Существует множество концепций и сценариев развития будущего человеческого будущего. Большая часть утопий посвящена проблемам будущего общества и относится к разряду социальных. Но некоторые из них затрагивают проблемы науки, техники, технических вопросов градостроительства, здравоохранения и т.д., лишь косвенно касаясь социальной стороны дела.",
				"added": 1545777413
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 4,
				"body": "Цели определены,задачи поставлены.Пора за работу.К чему всё это приведёт мы можем только предполагать.",
				"added": 1548805603
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 5,
				"body": "Паноптикум!",
				"added": 1549339605
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 6,
				"body": "Какие могут быть на \"будущее\" обходы,которые на 100% не могут быть заблокированы? вот вопрос вопросов.",
				"added": 1550432296
			}
		],
		"1_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": [
			{
				"comment_id": 7,
				"body": "> [hartmann2](#comment_1_19vb3KdkTdVe3RCfqVvSPHSLZg1jZu6T6k): Хуйня какая-то. Хорошее и плохое это крайне субъективные понятия. Да и то что ты предлагаешь предполагает тотальное отслеживание всех и вся. Короче очередная левацакая нежизнеспособная херота.\n\nв корень надо зрить,ещё раз обстаятельней.",
				"added": 1555194040
			},
			{
				"comment_id": 10,
				"body": "> [hartmann2](#comment_1_19vb3KdkTdVe3RCfqVvSPHSLZg1jZu6T6k): Хуйня какая-то. Хорошее и плохое это крайне субъективные понятия. Да и то что ты предлагаешь предполагает тотальное отслеживание всех и вся. Короче очередная левацакая нежизнеспособная херота.\n\nПо поводу отслеживания,надо подумать,но всё новое диктует новые понятия о нравственности индивидов.\nХорошо плохо частный случай мировоззрения.",
				"added": 1555986037
			}
		],
		"2_1CV23652pUmbK7yQtjyrBp7ZRhaV7U97aa": [
			{
				"comment_id": 8,
				"body": "Спасибо!",
				"added": 1555454232
			}
		],
		"1_1P7PoyMkQ7MXyfgReQfHqgcPJaZhKhwAKn": [
			{
				"comment_id": 9,
				"body": "Глубоко.",
				"added": 1555727123
			}
		],
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 11,
				"body": "CQEGAcGcxsBNBF1M0qoBCADJBIJ7uuZQ1CbUqUWJwuOfJWgkrEKM5jZfa6txFnR/\noiGYX5myA2h1+3ChdMxWPx9qU5j33EkdxQ+LfJuje82d17Pc9/Fk/2NW2Ub37bgo\nix7KM2Da9tqeawpH1obdTrU3VHtw3mnV8XgWZxEIP6Hhg73ggR1xzWUZMt3KYmds\nephf5j4oKuw8CmDg5hphpK9HXoRvMrA/f7y7WUctiCXnpdlZFlA98n15L6jserhB\nmF3Z8c846OMMIQQAKEKGazMhe2Iu0PFqzLGFOAgL/4rdVnPxuwzvCpV+mkjdh5rZ\n+yvkw3QHmZtNtvCN424zqCrr6/AOUw+B/OEOiwjlbWVnABEBAAHNKXNsZXZpbm5p\na3J1bSAoR2VuZXJhdGVkIGJ5IFJldHJvU2hhcmUpIDw+wsBeBBMBAgATBQJdTNKq\nCRDEm3fFchQp3gIZAQAAkIAH+I9np64cDbQfe29FGvoFtrTeu+TXtWNn3DD3CnDs\n8Zh1Gz8plSO45m4YrBqeflnKbT2xeB1t+8ELgOl7YFoFZkNBIzuGlk19NEYCaPTQ\noH2Fq8tdDD0mL/f3cwI0liGLlD79x1NbFWz5S8beiJ//Uce6H6tUXZV5gvZCb6rY\ndYgn5vkhF/A05ErBQqhQZHBXmAG1IyrUoZb4T1pRLFo5+cblbueL1AJP9mbWXiwL\nVEAdNd20z5Asl6OMEeD/FqJVm45/clmAUGIStILGqPGtuiOQIZ1/r1175wT+3MqI\nALlxNh90NzbEcwxgQWqVEjM3SozV3+SeJl3MQX5f+zibbQIGAAAAAAAAAwbAqAFo\nagkEAAYABRCU/S0N5mnTVozBXnk8XfIKBwOMJr4=",
				"added": 1565315824
			}
		],
		"1_1JJoeimWbdW8iRd5dpgE7CJ5gAQVGphQFB": [
			{
				"comment_id": 12,
				"body": "перевели бы.\nПривет сообщество Zeronet,\n\nЯ начинаю новый проект, где можно разместить рекламу его / ее сайта Darknet (Tor, I2P, Freenet, Zeronet) на карте Darknet (www.thedarknetmap.com) в качестве задачи, чтобы попытаться заработать столько же, сколько BTC 200 продавая квадраты (единица рекламы на карте), а также позволяя пользователям, не принадлежащим к Darknet, быстро и легко визуализировать сайты Darknet, а также продвигать средства обеспечения конфиденциальности и децентрализованные сети.\n\nНа данный момент уже есть несколько объявлений / веб-сайтов из Zeronet. Как было сказано выше, приветствуются веб-сайты Tor, I2P, Freenet или Zeronet на любом языке или в любом регионе мира.\n\nЕсли вы заинтересованы в размещении рекламы своего сайта на карте, ознакомьтесь с условиями на странице «Купить квадраты». Вы также можете связаться со мной по электронной почте через мой веб-сайт в случае возникновения любых вопросов, связанных с вашей рекламой / картой.\n\nС наилучшими пожеланиями\n\nTDM\nwww.thedarknetmap.com",
				"added": 1565983992
			}
		],
		"5_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 13,
				"body": "С Прошедшем Международным днём левшей.\nНа Руси к левшам относились подозрительно. Им даже запрещали давать показания в суде. Считалось, что левшой был сам дьявол. А в советских школах маленьких левшей переучивали в обязательном порядке. Психологи считают, что все эти люди-левши обладают сильным характером и мощным творческим потенциалом.\n\nСогласно статистическим данным, от 3 до 10% населения Земли — левши.",
				"added": 1565984411
			},
			{
				"comment_id": 14,
				"body": "Ну и с наступающим днём рождения русской тельняшки, который отмечается 19 августа. Хотя он пока не является официальным, но весьма популярен. Особенно широко празднуют в Санкт-Петербурге, где энтузиасты отмечают его как собственную традицию.",
				"added": 1565984564
			}
		],
		"2_1Jwt8CVfFDXPrGGEc6BL4MGjLU8e7jrUnq": [
			{
				"comment_id": 15,
				"body": "Слякота",
				"added": 1572556029
			}
		],
		"1_1MR3MSi8wAjrMmZ795tYqbgaZ3dmbXGgh7": [
			{
				"comment_id": 16,
				"body": "сериал \"утопия\"",
				"added": 1572901336
			}
		],
		"11_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 17,
				"body": "Отлично!",
				"added": 1574023664
			}
		],
		"1_17pzasQeng5RwUSqQ7smYUidZTED3RTEKH": [
			{
				"comment_id": 18,
				"body": "Всё как вам кажется интересное,но лучше своё.",
				"added": 1574377955
			}
		],
		"1_1E3o28BmawAEP5vzkCyfk1FyAwQbQUxsHR": [
			{
				"comment_id": 19,
				"body": "#мызаOpenSource.",
				"added": 1576545933
			}
		],
		"3_1Lor5wJQKJNk45xfXPtvaZBJNU5yGSNAtH": [
			{
				"comment_id": 20,
				"body": "Уря!!!",
				"added": 1577812722
			}
		],
		"1_1PH2qS7FvHqGYC5mYoWGPmbCjhztcSvLDp": [
			{
				"comment_id": 21,
				"body": "Другие интересы + лень.",
				"added": 1581538787
			}
		],
		"1584552124_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 23,
				"body": "UTC+3",
				"added": 1584628705
			}
		],
		"1585226964_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 24,
				"body": "https://youtu.be/3eWy7Ffo3TE\n",
				"added": 1585335549
			}
		],
		"1585342885_1MPcrHSmkXTCxVLNRT42z9JYETbdsmgmdG": [
			{
				"comment_id": 25,
				"body": "„все движется и ничто не остается на месте“https://ru.wikipedia.org/wiki/%D0%92%D1%81%D1%91_%D1%82%D0%B5%D1%87%D1%91%D1%82,_%D0%B2%D1%81%D1%91_%D0%BC%D0%B5%D0%BD%D1%8F%D0%B5%D1%82%D1%81%D1%8F",
				"added": 1585344979
			}
		],
		"1585691293_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 26,
				"body": "НЕТ СЛОВ,спасибо!!!",
				"added": 1585699976
			}
		],
		"1591860854_1HHNSMVnDWhbMLHohUAQnh4kjF9ZYwdiUc": [
			{
				"comment_id": 28,
				"body": "https://youtu.be/PCTpJc-38jM?t=935",
				"added": 1591922595
			},
			{
				"comment_id": 30,
				"body": "СССР-это рабство начала,середины,конца двадцатого века (не интересно),у нас впереди новое цифровое рабство двадцать первого века ))). А вообще сейчас по всему миру существует множество сообществ (псевдо-свободных) вступай пож. Свобода внутри,насильно сделать людей счастливыми невозможно,так-как счастье для каждого человека разное.мимолётное,изменчивое,\"заразное\" ну и сугубо личное!",
				"added": 1594763741
			},
			{
				"comment_id": 32,
				"body": "Взгляд на СССР от (\"предателя системы\") сотрудника программы \"Новости\".1984 г. https://youtu.be/cBjHDAW2OFY",
				"added": 1598104352
			}
		],
		"1591001587_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 29,
				"body": "Американские учёные ПРЕКЛОНИЛИ КОЛЕНО и переименовали \"ЧЁРНУЮ ДЫРУ\" в \"АФРООТВЕРСТИЕ\"!",
				"added": 1592091212
			}
		],
		"1590655214_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": [
			{
				"comment_id": 31,
				"body": "Это борьба с ветреными мельницами,хотя и благородная! \"Государственная наука\" История,проститутка действующей  власти.",
				"added": 1594764571
			}
		],
		"1598886070_1MWBkE6NXav3JtJTy4bUBZqFQYsggBtykJ": [
			{
				"comment_id": 33,
				"body": "+",
				"added": 1599999867
			}
		],
		"1590428068_1DF9SmXMYDMz7UGB6pxNXMbq9UgxwJEZie": [
			{
				"comment_id": 34,
				"body": "Стратегия поиска лекарственных средств для лечения и профилактики коронавирусной инфекции развивается в нескольких направлениях. Первое - это разработка вакцин. Второе - поиск способа обмана вируса муляжами - «калитками» не на поверхности клеток, а вокруг. Растворимые формы АПФ2 (ангиотензинпревращающий фермент, мембранный белок - прим. ред.), то есть муляжи, заставят вирус отвлечься на них и снизят вирусную нагрузку на клетки, защитив таким образом легкие. Третье - попробовать сломать не «калитку», а проход через нее. По-научному, это ингибирование сериновых протеаз, то есть белков, по которым вирус идет как по дорожке, внутрь клетки, открыв замок «калитки».\n\nЧетвертое - это разработка новых, белковых, блокаторов АПФ2 для борьбы с COVID-19. Здесь самое интересное. Для лечения гипертонии активно ищут пищевые белки, то есть белки в составе нашей еды, которые блокируют или подавляют АПФ2. Около 13 процентов всех белков обычного куриного яйца составляет овотрансферрин. Он содержится не в желтке, а в белке, обладает антибактериальными, противовирусными и противогрибковыми свойствами. Кроме того, он является пищевым белковым блокатором АПФ2.\n\n- Старые добрые антибиотики никак не помогут нам в борьбе со смертельными вирусными заболеваниями типа COVID-19?\n\n- В последнее время в документах Всемирной организации здравоохранения название «антибиотики» заменили на более правильное определение этой группы лекарственных веществ - «противомикробные препараты». Микробы или бактерии - это клеточные формы жизни. У них нет такого ядра, как в клетках нашего организма, но есть ДНК с наследственной информацией и маленькие органы - органоиды, которые позволяют им существовать автономно, было бы только питание вокруг. Бактерии размножаются, как и клетки нашего организма, - из одной бактерии при делении образуется две, из двух - четыре, и так до бесконечности. Основные противомикробные препараты могут нарушать процесс деления бактерии или работу органоидов, которые синтезируют бактериальные белки, а некоторые делают «дырки» в оболочке этих безъядерных клеток. Бактерии - это клеточная форма жизни, но безъядерная, поэтому их называют \"прокариоты\", то есть доядерные. Мы с вами эукариоты - ядерная форма жизни. В наших клетках ДНК лежит внутри конверта ядерной оболочки.\n\nВирусы - это вообще неклеточные формы жизни. У вируса есть только оболочка, окружающая нуклеиновую кислоту. Нуклеиновая кислота - это «шпаргалка», где написана структура белка оболочки вируса. У вируса нет специальных органоидов для выработки своих вирусных белков. Для этого вирусы используют клетки организма-носителя. Вирусы - внутриклеточные паразиты. Вирус проникает в клетку для размножения, чтобы из одного себя сделать сотню подобных. Внутри клетки вирус теряет свою оболочку. Из одной копии нуклеиновой кислоты образуются сотни одинаковых копий-шпаргалок. В зараженной клетке-хозяйке с этих шпаргалок синтезируются вирусные белки. Они окружают многочисленные новые вирусные нуклеиновые кислоты. Внутри клетки образуется сотня вирусов. Клетка, переполненная вирусами, не может нормально функционировать и погибает. Сотни вирусов выходят на свободу, чтобы заселиться и размножиться в новых клетках.\n\n- Почему вирус SARS-CoV-2 выбрал человека для своего размножения?\n\n- У каждого вируса свои \"любимые\" клетки-хозяйки. Есть вирусы, размножающиеся внутри бактерий, их называют \"бактериофаги\". Есть вирусы, размножающиеся исключительно в клетках растений, а другим подавай клетки животных. Внутри многоклеточного организма вирусу нужны не все, а только избранные клетки: вирус гепатита размножается только в клетках печени, вирус иммунодефицита человека - в лимфоцитах Т-хелперах. Для каждого вируса \"любимой\" является та клетка, у которой есть «калитка», через которую вирус может проникнуть внутрь. Для SARS-CoV-2 такой «калиткой» является АПФ2. Этот фермент относится к ренин-ангиотензиновой системе, регулирующей обмен натрия и артериальное давление. Натрий и артериальное давление связаны как нитка с иголкой. Поэтому одна из рекомендаций в борьбе с сердечно-сосудистыми заболеваниями и гипертонией - это уменьшение потребления соли, то есть хлорида натрия. Натрий задерживает воду в организме, увеличивается объем циркулирующей крови, значит, повышается давление крови.\n\nРенин-ангиотензиновая система досталась нам не для гипертонии. Наши предки часто страдали от ранений и кровопотери. Поэтому нужны были механизмы повышения артериального давления после потери крови, чтобы наш предок мог добраться до укромного места и спрятаться от врагов или хищников. Как же это работает? Около каждого клубочка в почках на кровеносных сосудах есть клетки, чувствующие концентрацию натрия и артериальное давление. Если падает давление или снижается натрий, околоклубочковые клетки выбрасывают в кровь фермент ренин. Рен - это почка, а ренин — фермент из почки. Ренин расщепляет белок ангиотензиноген до ангиотензина-1. С кровью первый ангиотензин попадает в сосуды легкого, где его ждет АПФ2. Первый ангиотензин изменяется и становится вторым (ангиотензин-2). У ангиотензина-2 две функции: заставить мышечные клетки артерий сократиться и дать команду надпочечникам выбросить в кровь гормон альдостерон. Последний заставит почки задержать натрий в организме. Оба механизма повышают артериальное давление.\n\n- Почему коронавирус вызывает вирусную пневмонию?\n\n- В ренин-ангиотензиновой системе АПФ2 находится на мембране клеток, выстилающих кровеносные капилляры легких. Но до них вирус не добирается. Кроме капилляров, АПФ2 есть в клетках альвеол легких. Альвеолы - это наполненные воздухом мешочки, через стенку которых происходит обмен кислорода и углекислого газа. С воздухом, а значит и с вирусом, в случае заражения контактируют два типа эпителиальных клеток альвеол. На плоских, через которые происходит обмен газами, нет АПФ2. На кубических, которые вырабатывают сурфактант, чтобы стенки альвеол не слипались, есть АПФ2. Через эту «калитку» коронавирус попадает в кубические альвеолярные клетки. Когда клетки погибают, в эпителиальной стенке альвеол появляется «дырка». Через «дырку» плазма крови попадает в альвеолу, она заполняется жидкостью, жидкость не позволяет воздуху заполнить альвеолу, нарушается газообмен. Если развивается дыхательная недостаточность, аппарат ИВЛ помогает заполнять легкие больного кислородом до того момента, пока организм сам не восстановит целостность эпителиальной выстилки альвеол.",
				"added": 1603458353
			},
			{
				"comment_id": 35,
				"body": "Больные Герпесом,побеждают любой вирус! https://habr.com/ru/post/494896/",
				"added": 1605382513
			},
			{
				"comment_id": 39,
				"body": "Расследование от янки https://www.brighteon.com/76686ab5-b88d-4185-b4fb-9eb433d3a0b4",
				"added": 1606777534
			},
			{
				"comment_id": 42,
				"body": "Что стоит за вакцинацией? Интервью с президентом лиги пациентов, эксперт РАН https://youtu.be/cbmqj-M54is",
				"added": 1610249228
			}
		],
		"1604941685_16JByxcaVSnx4QiPAXHjuV6hzi44uNoWCD": [
			{
				"comment_id": 36,
				"body": "Бандана шарф  и от ветра и от властей!",
				"added": 1605382917
			},
			{
				"comment_id": 37,
				"body": "> [ksnde](#comment_28_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji): imho прятаться за банданой не выход. Нужно показать свою активную человеческую и гражданскую позицию открытым лицом.\n\nПоказать есть всегда где можно, а скрыть??? https://habr.com/ru/company/jetinfosystems/blog/449216/",
				"added": 1605393329
			}
		],
		"1606587381_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 40,
				"body": "Игнор!",
				"added": 1606951692
			}
		],
		"1606848904_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 41,
				"body": "+",
				"added": 1606953695
			}
		],
		"1629212181_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 44,
				"body": "Дьявол кроется в деталях https://youtu.be/sX8GepWVcdQ",
				"added": 1629774154
			}
		]
	},
	"comment_vote": {
		"4_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"14_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"2_142FMMWp3EWtvPhh3n7DfaJikCxcRcKUKP": 1,
		"1_1G1PNFuM8kuc3VFMLWKdTHpwA38MY4G9Ng": 1,
		"19_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"18_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"29_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1_14cZCssXC9Vc2hn4rjgmySXmE7irAGQnv2": 1,
		"151_1HicSvtnQCja3kxKMmiPQjgxxoFSnzussv": 1,
		"1_1PzrPjeEMF1a8onqRp2RPzVvSvDd86LLdH": 1
	}
}