{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1615545564,
			"title": "lol the treason of miller !!!",
			"body": "lol...",
			"added": 1615545563
		},
		{
			"topic_id": 1615546357,
			"title": "I love buffet !!!",
			"body": "it's soo cool ! all you can eat ! as much or as little of everything offered. I bet leftists hate buffet !!! they want to decide what I eat, how much salt and sugar, and be careful not too much beef... beef? the evil cows? fuck you leftards.",
			"added": 1615546355
		},
		{
			"topic_id": 1615546466,
			"title": "cnbc - american greed , einstein was wrong...",
			"body": "if there is one thing unlimited in this universe it's .... hehehehe",
			"added": 1615546463
		},
		{
			"topic_id": 1615548817,
			"title": "pedogen honoré is targeting first oath keepers...",
			"body": "logic ! be safe !",
			"added": 1615548813
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 1,
				"body": "omg, just had a boating incident ! iceberg... all the shit... gone !",
				"added": 1615539183
			}
		],
		"1615534190_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 2,
				"body": "> [captain404](#comment_17_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): i dont think u understand how it s work cause i totally can. And it s  necesary cause otherwize u could host unwanted illegal content. u just click on the 3 dot and u click mute users. but i search at the lowest lvl posssible.\n\nI know censorship is addictive for those who can only lose the battle of idea, as they are stupid and worst unable to expose clearly their project and move forward with it !\n\nyou can't as said, it's not a permission network... you dl, create a key and rulez. nothing else.\n\nand as users shift quickly keys you are even more stuck :)\n\ngo back on twitter...",
				"added": 1615542947
			},
			{
				"comment_id": 3,
				"body": "> [calmdownholden](#comment_26_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Move your cursor to their comment. [...]\n\nthe problem is that captain404 can't cope with encensored speech... he is going all crazy inside the code to find a way to censor nodes to remove user forever  :) hehehehe  a classical demoncrat :).\n\nhe must hack tor and zeronet :)... lol\n\nhe wants his safe space, where he can censors anyone, but not to himself, to everyone !",
				"added": 1615545063
			}
		],
		"1615468688_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 4,
				"body": "> [captain404](#comment_16_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc): Reply\n\nlol you are so formated by cnn / cia crap... those in xinjang were trained, brainwashed and used by the cia to attempt an insurgency using terrorism as a tactic to try to splinter china territorial integrity... it failed. next.\n\naka I am a groupie of CCP , and have 0 will none what so ever as a foreigner it would be super impolite to participate in any related to politics of china and specially a separatist movement ! I am for the reunification, including hk and the fish islands :D and the South china sea defense system stays (it won't capsize :D).so what?",
				"added": 1615545767
			}
		],
		"1615487471_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 5,
				"body": "even ted cruz is fan :)",
				"added": 1615545810
			},
			{
				"comment_id": 10,
				"body": "have you ever eaten mexican lamb?",
				"added": 1615546703
			},
			{
				"comment_id": 11,
				"body": "Mexico has one of the lowest income taxes in the world, charging a maximum income tax of 30.00%.\nThe current Mexico VAT (Value Added Tax) is 16.00%. \n\ndo you have a good tax website for easy comparison?",
				"added": 1615546846
			}
		],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 6,
				"body": "> [calmdownholden](#comment_27_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): They're not banned. The only books actually banned are books that contain illegal things like perverted crap.This \"they're banning books!\" is mixing up Cancel Culture with Banning.Cancel Culture is when people decide as a group not to support something.That's just people exercising their rights.Some may even protest to companies, which is also their right.But it's not law.Anyway, it's Conservatives that have a history of banning books.Liberals just point to harmful media. How is that \"hiding\" anything if they're pointing to it as an example of destructive media?\n\nwrong cancel culture or wokism is a front for the take over of the usa... rather than wanting to not be exposed to something (mute user) they want to ban to have full control of discourse, speech, and then liberty and then your assets and even body (specially the one of your children).",
				"added": 1615545884
			},
			{
				"comment_id": 7,
				"body": "for example no one stops you from asking at walmart when they will get XM1158 in the munition part of the store... cancel culture rather than not going to this alley, want the alley terminated. you understand? do you? another captain404?",
				"added": 1615545940
			}
		],
		"1615444288_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 8,
				"body": "safe to rape kids when when they grow they can't get AKs to bring justice to themselves :) or their parents.\nor the 2ndA is a nice tool against mandatory force vaxxination... everything some hate ! free human being carrying and minding their own business in their own pursuit of happyness...",
				"added": 1615546033
			}
		],
		"1615546357_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg": [
			{
				"comment_id": 9,
				"body": "another great version is the chinese round central desk on the table... modernity incarnated !",
				"added": 1615546625
			}
		],
		"1615548817_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg": [
			{
				"comment_id": 12,
				"body": "maybe dissolution to start new with Oath guardians?",
				"added": 1615549134
			},
			{
				"comment_id": 13,
				"body": "you know, just play their game :D.",
				"added": 1615549144
			},
			{
				"comment_id": 14,
				"body": "and stuart goes in the shadow and new leadership ! rulezzz a1 & a2 forever !",
				"added": 1615549181
			}
		]
	},
	"comment_vote": {}
}