{
	"next_comment_id": 13,
	"comment": [
		{
			"comment_id": 1,
			"body": "О, armagetron жив))",
			"post_id": 9,
			"date_added": 1535539313
		},
		{
			"comment_id": 2,
			"body": "Проект интересный, но для меня шоустоппером в Гайке всегда была наглухо отсутствующая система прав доступа.\n\n> Однако, я никогда не понимал людей, подходящих к таким проектам с точки зрения выполняемых функций. Я помню времена, когда я занимался ядром Windows NT и Linux 2.xx показался мне убогой поделкой. [...] Однако было чувство чего-то неизведанного, красивого, ОТКРЫТОГО. Чего-то принципиально иного, принадлежащего не корпорации а нам -- программистам! \n\nОднако проблема с любыми проектами после Linux как раз в том, что уже есть Linux. Возможность иметь доступ к исходному коду и править его по своему усмотрению — это гигантское конкурентное преимущество, которое в отдельных случаях может с лихвой компенсировать отсутствующие функции (а может и не компенсировать :) ). Поэтому сравнение по потербительским качествам очень даже уместно.\n\nНо вот как раз Linux своим весом убивает все другие альтернативы в пределах своей экологической ниши (кроме, разве что, FreeBSD и в какой-то мере OpenBSD). И это хорошо: меньше фрагментация, больше давление СПО на проприетарное ПО.\n\nМожно сказать, Linux + *BSD занимают всю эту нишу целиком.",
			"post_id": 15,
			"date_added": 1539003864
		},
		{
			"comment_id": 3,
			"body": "> [hugeping](#comment_19_19sx7YG6a4HKdViStAqwCxQkboV3frmxwX): В случае, когда система используется как десктопная, это не такой уж недостаток.\n\nУ всех по-разному. У меня нет, пожалуй, ни одного десктопного устройства, которое бы использовалось исключительно в одно лицо.\n\n> Но мне не нравится вывод. :) Я его не принимаю. :)\n\nНа эмоциональном уровне мне такой вывод тоже не нравится, но рационально рассуждая, это, вероятно, благо для общества.\n",
			"post_id": 15,
			"date_added": 1539005446
		},
		{
			"comment_id": 4,
			"body": "Кстати, из подобных проектов-клонов еще очень интереснен AROS. ... ну и наверное, всё. Не вспоминается ничего больше.\n\nА из самобытных, HelenOS.",
			"post_id": 15,
			"date_added": 1539135021
		},
		{
			"comment_id": 5,
			"body": "Очень прикольно близкородственные языки изучать. Прямо чувствуется, как расширяется базовая прошивка. :)",
			"post_id": 16,
			"date_added": 1540275668
		},
		{
			"comment_id": 6,
			"body": "Отважно!\nПроект развивается... По меркам 1998-го года это полноценная ОС. :)",
			"post_id": 18,
			"date_added": 1548081266
		},
		{
			"comment_id": 7,
			"body": "Крутится идея сделать некий гибрид на основе [HTMLy](https://www.htmly.com/), [Jekyll](https://jekyllrb.com/), [кода caryoscelus-а](http://127.0.0.1:43110/1MCoA8rQHhwu4LY2t2aabqcGSRqrL8uf2X/?/) и собственно движка ZeroBlog.\n\nЧтобы один и тот же фронт работал с любым вариантом бэка, и чтобы можно было зеркалировать контент в разные сети полностью автоматически на уровне движка сайта.",
			"post_id": 31,
			"date_added": 1616387798
		},
		{
			"comment_id": 8,
			"body": "> В Plan9 нет (и не может быть) современного браузера. Почему его не может быть, хорошо описано здесь: https://habr.com/ru/post/541196/ Это сильно пересекается с моей заметкой о ненастоящей победе open source. \n\nПусть это верно, но подход \"мы до основания всё разрушим\" — настолько же неверный. Не нужно делать \"современный браузер\" в понимании Гугла. Но нужно делать браузер в понимании качественного софта с хорошей архитектурой. Пусть он будет несовместим.\n\nGemini в понятие хорошей архитектуры не вписывается.\n\nСчитаю, что это эскапизм и пораженчество — добровольно скатываться на уровень палки-копалки только потому, что корпорации решили монопольно застолбить HTML. Так они что угодно отберут.\n\nЕсли бы Столлман таким же принципом руководствовался, мы бы не увидели ни компилятора, ни вообще чего бы то ни было от GNU.",
			"post_id": 29,
			"date_added": 1616388140
		},
		{
			"comment_id": 9,
			"body": "Меня ЖЖ заблокировал в то время, пока я туда даже не заходил. :)",
			"post_id": 28,
			"date_added": 1616388219
		},
		{
			"comment_id": 10,
			"body": "> А Linux-то, linux ещё наш? Или он уже стал товаром, которым торгуют корпорации?\n\nНикогда не был. С самого начала это был инструмент корпораций.\n\nК сожалению, free software началось и закончилось на хакерах, получавших образование еще в 70~80-е. Последующие поколения оказались не способны воспринять идею в том количестве , чтобы идея воспроизводилась.\n\n> Сегодня кажется, что open source победил окончательно и бесповоротно. \n\nOpen source победил, совершенно верно. Достаточно вспомнить историю и смысл термина open source. Free software потерпело поражение.\n\nПо крайней мере, на нынешнем витке прогресса.",
			"post_id": 22,
			"date_added": 1616388641
		},
		{
			"comment_id": 11,
			"body": "> Я пишу эти строки в браузере NetSurf и понимаю, что этот браузер свободен. Да, он не удовлетворяет коммерческим стандартам, но он достаточно прост, чтобы развиваться в режиме \"свободного творчества\".\n\nДа вот его бы и дорабатывать вместо gemini...\n\nВот тут я описывал идею о переходе к полностью декларативному фронту:\n\n* https://www.linux.org.ru/news/opensource/16187331?cid=16194720\n* https://www.linux.org.ru/news/opensource/16187331?cid=16194777\n\nКроме очевидных преимуществ для обычного браузера, это даёт и другие возможности:\n\n* Можно доработать тот же NetSurf под декларативные API, позволяющие делать сайты с динамическим обновлением страниц, не таща в него интерпретатор JS и полную реализацию всего DOM API.\n\n* Можно фронт для ZeroNet перевести полностью на декларативное представление, чтобы не исполнять недовереный тьюринг-полный код в браузере. Можно даже пользоваться им через тот же Netsurf.\n\nВопрос как всегда один... где взять время. Ну или где сначала взять столько денег, чтобы потом уволиться, и было это самое свободное время. :(",
			"post_id": 22,
			"date_added": 1616389784
		},
		{
			"comment_id": 12,
			"body": "Ну проблема-то не в JS. Ведь если бы это был баг на сервере, вы бы его отладить не смогли. И были бы точно в ситуации матери-одиночки с гуманитарным образованием.\n\nПроблема в организации общественных институтов на всех уровнях, где всем на всех плевать.",
			"post_id": 23,
			"date_added": 1616391588
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"15": 1,
		"18": 1,
		"22": 1,
		"23": 1,
		"31": 1
	}
}