{"cert_user_id": "stman@github", "next_comment_id": 5, "comment": {"1604065246_mirrored_HelloZeroNet_github": [{"comment_id": 1, "body": "Hello.\nIf you need some help to investigate the case, do not hesitate to ask me.\nI am an experienced Mac OS X \"Objective-C\" and \"C\" experienced developer.\n", "added": 1458721428, "modified": 1458721428, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/363#issuecomment-200303274", "source_type": "github"}, {"comment_id": 2, "body": "You are experiencing the exact same problem as most P2P developpers porting their code to Mac OS X : YaCy had it, Twister has it, you have it.\n\nWhat I recommand is to build a little native Mac OS X app to launch all necessary processes your application needs, but also that could be used, with a GUI (Menu, Icon in task bar) to configure the daemon and the options so that users don't have to edit text files and so on.\n\nRegarding the libraries, I recommand to include all dependant libraries in an already compiled format (*.a) in a true Mac OS X Application bundle, with the little native app.\n\nThe \"Linux\" way of doing things (Recompiling the source code of each library) is not recommanded to create easy to install Mac OS X Application bundles : Application Bundle where created / engineered to have all the libraries already compiled.\n\nI am going to do this work for Twister, but I would be really glad to do it for ZeroNet too :-)\n\nYou can count on my active cooperation to solving this little issue, it will be an honor for me.\n\nKind regards,\n\nStman.\n", "added": 1458723272, "modified": 1458723272, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/363#issuecomment-200318643", "source_type": "github"}, {"comment_id": 3, "body": "If you are a registered Developper, one can publish either on the MacAppStore, but in that case the application must meet Apple requirements, and the rules for the MacAppStore are more open than those applying to iOS Apps, \n\nOR\n\nOne can make the binary, signed with his Dev account, on any \"custom server\" .\n\nBoth solutions would end this issue \"Un-identifyed\" developer.\n", "added": 1459866926, "modified": 1459866926, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/363#issuecomment-205911283", "source_type": "github"}, {"comment_id": 4, "body": "With pleasure....\n", "added": 1459995765, "modified": 1459995765, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/363#issuecomment-206702508", "source_type": "github"}]}}