{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "El de abajo me come los huevos",
			"body": "Pues eso",
			"added": 1525721502
		},
		{
			"topic_id": 2,
			"title": "Una juez abre diligencias penales a raíz de las publicaciones que identifican a la víctima de 'La Manada'",
			"body": "- El Juzgado de Instrucción Número 30 de Madrid investiga la difusión en Internet de datos personales y publicaciones ofensivas contra la víctima de 'La Manada'\n\n- La jueza está pendiente de recibir un informe de la Unidad de Ciberdelincuencia de la Policía con las publicaciones detectadas en foros, Webs y perfiles de redes .\n\n- La Policía investiga a los autores y a quienes difunden los enlaces ya que la propia sentencia lo prohibe\n\n\nhttp://cadenaser.com/ser/2018/05/07/tribunales/1525715743_998396.html",
			"added": 1525722844
		}
	],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_18neEHgfy4dyCSY4tJzUi3AwjHds4U6bw9": [
			{
				"comment_id": 1,
				"body": "Al carrer",
				"added": 1525721409
			}
		],
		"1_17mdQ1RaLCu1m2gqf4wosf15VWgccxuoUk": [
			{
				"comment_id": 2,
				"body": "DEP se invierten los mensajes",
				"added": 1525722803
			}
		],
		"2_17mdQ1RaLCu1m2gqf4wosf15VWgccxuoUk": [
			{
				"comment_id": 3,
				"body": "Añadir que sólo es delito si se ha hecho por el camino \"ilegal\", es decir, si has hackeado la base de datos del tribunal de Navarra, por ejemplo.\n\nDe todas formas, me parece una tontería que prospere esta \"denuncia\", cuando son los medios los que han filtrado de todo (ilegal).",
				"added": 1525722945
			},
			{
				"comment_id": 4,
				"body": "> [1r34l](#comment_1_1YqDKgbqnmK69y67tYpqBfnMvtrGFFLJH): Los que han compartido información pública o enlaces no han cometido ninguna ilegalidad, así que no os subrayeis.\n> De los periódicos no hay que fiarse, no hay más que ver la desinformación que metieron cuando se hizo el CSI con el objetivo de cagarnos a los shurs y que desde fuera nos pusieran a parir.\n\nYa sabemos que no es ilegal, el tema es que le están dando bola a algo que es culpa de los medios, y todos sabemos que no les van a hacer nada porque si no ya lo hubieran hecho antes.",
				"added": 1525723228
			}
		],
		"1_1Ja3ocDF3abwsEKdxvMxsWwUU1aV7iSPYb": [
			{
				"comment_id": 5,
				"body": "Es internacional, lleva 40 días abierta (la web).",
				"added": 1525725533
			},
			{
				"comment_id": 6,
				"body": "Ojo al pie de página,  \" Donations of $2 and over are tax deductible in Australia\"",
				"added": 1525725645
			},
			{
				"comment_id": 7,
				"body": "Podríamos mirar de denunciar la web, el problema es el coste claro...",
				"added": 1525725693
			}
		]
	},
	"comment_vote": {
		"14_1HKB4ahN7FeDLQWkpyGnscSEVRUvu2y18S": 1
	}
}