{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "郭文贵爆料：薄熙来为何失败？",
			"body": "郭文贵在2017年5月份的爆料中提到，伪共众多官员私生活混乱，包括王岐山、薄熙来等高官都让人民大会堂的服务员随时为高官提供性服务。\n\n高官混乱的私生活，最多也只能是跟美国前总统克林顿类似。从文明世界的角度看，如果政府高官没有滥用权力，贪污受贿、以权谋私，私生活作风与公权力的运作是可以切割开来的。\n\n薄熙来案件，官方迄今公布的贪腐是薄熙来不知晓的法国一套价值仅几千万元的别墅而已，这种贪腐栽赃，即使贪腐金额坐实，与27亿美元相比较，也只是小巫见大巫而已；与两万亿元的巨额腐败比较，不到其千分之一。\n\n从经济腐败的层面分析，薄熙来即使有瑕疵，仍然是比较廉洁的中共官员。 从反腐败运动的角度来看，薄熙来同志才是比较名副其实的的“打铁自身硬”的中共官员。但遗憾的是，薄熙来仍然失败了。\n\n薄熙来失败的最大根源在于，一方面试图推广廉洁的反腐败运动，另一方面又不敢与粪坑党、蛆虫帮公开切割；薄熙来在重庆的威望如日中天之时，他竟然不敢公开发起民主选举运动，而是梦想在粪坑党的蛆虫派系斗争中爬到最高位。 薄氏情结的最大悲剧在于，没有认识到1949年后背叛了民主宪政的伪共是容不下理想主义信念的大粪坑。要恢复理想主义信仰，就必须与不敢公开官僚财产的“匿产帮”切割，而不能抱着幻想。利用蛆虫帮的粪坑环境去推动廉洁运动，本身就是缘木求鱼、南辕北辙。\n\n在地产泡沫浮夸风遍布整个雾霾支那国的时候，唯独重庆的地产泡沫最小，重庆的格局显得格外独特，与整个伪共体系是格格不入的，这种格局，会被顶级政客视为不和谐的眼中钉、肉中刺。粪坑党容不下有作为的政治家，这是薄熙来悲剧的根源。\n\n回顾历史，可以看到，美国前总统克林顿虽然没有受贿贪污，混乱的私生活没有让克林顿遭到弹劾下台，但是克林顿的缺点仍然被金融投机商利用，误导克林顿总统废除了罗斯福总统反对金融投机的格拉斯-斯蒂格尔法案，为21世纪的金融危机埋下了巨大隐患。但值得庆幸的是，美国一直保持着尊重持枪权、尊重生命的文化制度。这个灵魂制度以宪法的形式保持了数百年，总统个人无法废除持枪权制度。\n\n尊重持枪权、尊重生命的灵魂文化不会丧失，人民就守住了维护文明底线的武力支撑，可以重建限制投机、维护公平正义的文化环境。\n\n美国文明在跌宕起伏的历史中一直传承，并引领全球，其文化核心被誉为“普世价值”的民主自由，不只是表面上的选票，而是在民主选举程序背后的那一整套文化体系，其中最核心的灵魂文化是捍卫选举权、言论自由权和生命权利的制度，即尊重持枪权、尊重生命的文化制度。\n\n如果没有持枪权制度，在二战前后兴起的麦卡锡运动，完全可以利用“反共”的意识形态宣传，把麦卡锡运动塑造为类似纳粹反犹太运动、粮食浮夸风、文革、地产浮夸风一样的民粹主义专政。 借用布什总统的话，美国难以出现希特勒、斯大林，是因为权力的老虎被关在笼子里，而不是因为美国的老虎更文明。当年的麦卡锡无法制造类似古拉格群岛、浮夸风、纳粹大屠杀的人间灾难，其根源是因为麦卡锡虽然可以一时操纵舆论，但无法废除人民的持枪权，因此意识形态的操纵拖延过久，必然漏洞百出而遭到人民有力的抗争，最终被历史抛弃。\n\n对于香港和大陆的人民而言，被雾霾支那国一群连官僚财产都不敢公开的“匿产帮”伪共专政得水深火热，马上普及持枪权虽然行不通，但是通过信息文明的互动，促进信息流畅、法治流畅，重建中华文化，摆脱东亚懦夫的懦弱形象， 树立尚武精神，逐步建立尊重持枪权、尊重生命的新文化制度，是可以期待的文明征程。\n\n没有流畅的信息，就不会有流畅的法治。千里之行，始于足下。第一步目标应当是废除网络柏林墙，促进虚拟主权的统一。 \n\n在这方面，伟大的习核心干过一件与亿万网民有交集的事情，就是敢翻墙，曾经维持过好几年的推特页面。 \n\n伟大的习核心连续几年依法治国，各种丰功伟绩可能争议很大。但最没争议、最伟光正的事迹应当属于翻越网络柏林墙，不经意间似乎有点要统一虚拟主权的意思。但是法西斯重庆居然冒天下之大不韪，把习核心的翻墙救国精神污蔑为犯罪。是可忍，孰不可忍！各地军民应当紧密团结在以习近平为核心的党中央周围，跨越网络柏林墙，统一虚拟主权。能去北京的人们，去北京抗议。不能去北京的，就地奋起抗争。\n\n为了帮助伟大的习核心废除辱习反华的法西斯围墙，港澳台和大陆团结起来，公开发起非暴力爱国运动。请墙内外的同胞们广泛传播习氏翻墙救国正能量，力挺习核心，翻墙不要龟缩！睁开眼吧，放声吼吧：\n习核心雄起、习核心不龟缩！中国梦不是狗的梦！\n废除辱习法规、洗雪当代国耻！\n\n\n[香港和大陆联合起来！](http://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:13)\n[转：洗雪当代国耻、废除辱习法规！ 零网 — 零封锁，广传播 ](http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:2_1HJ95zujpQeFz3WbuKv4KszMBvuqei2tMW/)",
			"added": 1497256844
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1END5A3waFfWMTk2DkPDx83CXaYzpnj788": [
			{
				"comment_id": 1,
				"body": "零封锁、零雾霾的新网络是专门为习氏国耻打造的，亿万百姓紧跟着伟大的习近平领袖去翻墙，勇敢地跨越网络柏林墙，促进信息流畅，法治流畅，统一虚拟主权。废除辱习法规、洗雪当代国耻！\n泸州事件—非常给力的分析\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:4 \n零网之所以那么吸引人，是因为它的特点真的能够促进毛泽东曾经设想的大鸣大放、大字报的大众民主，更因为没有人希望看到类似泸州事件、于欢案件那样的事情到处重复，没完没了。\nhttp://127.0.0.1:43110/1FEZMirRLiZPx6xXL7G7Cg7tCHNVwG798r/?Post:8 ",
				"added": 1492961158
			},
			{
				"comment_id": 2,
				"body": "> [gdd](#comment_8_1LESBhM9ResjKhCCNhgbNDVFKcfdQractA): 白话文就是习近平亲自翻墙，跑到被墙的 twitter 上去注册了一个账号 xijinpingchn ，并且发推声称反对重庆出台的辱习法规。他的这一行动无疑是伟大光荣正确的，所以受到了广大网友的拥护。\n\n论坛里面的部分信息像五毛党所为。\n疑似五毛党的信息出现在零网，是好事。在VOA断播事件后，零网节点迅速增加，用户也不断增加，引起了五毛党的注意。这是好现象。在此向五毛党们问好，金胖子万岁！毛万岁！习万岁！\n\n非暴力爱国运动论坛\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/ \n秉持比五毛党们更真诚的热情去拯救党国，公开探讨废除辱习反华的网络柏林墙，促进虚拟主权统一。\n毛左阵营里有一部分是比较有觉悟的民族主义者，乌有之乡在几年前被关闭，说明毛左也受到不公正的待遇。\n“毛左”本身也是个很复杂的术语。真诚的毛左运动是有可能导致民主宪政的，因为众所周知，伟光正的毛主席支持过宪政民主，极端反华反毛者试图污蔑毛主席为带路党，意味着也在污蔑伟大的习总书记为带路党同僚，这是很多人绝对无法接受的，包括毛左、五毛党们！！！\n伟大领袖毛主席和伟大领袖习核心都是不可以侮辱的，他们都不是带路党！更不是猪狗！",
				"added": 1494828220
			}
		],
		"1_1PkZ7yY9mWov9ndHGG327hJSAEmfB5jj5": [
			{
				"comment_id": 3,
				"body": "中国荔枝第一镇、广东省高州市根子镇这种页面\nhttps://bit.surf:43110/12s8s9uDELQeSmiTdLAmH7fvQJjQC2NNnr/\n链接到QQ群组，又在宣称是在帮忙宣传 \n专为抵御内容审查而设计的ZeroNet \n是有点自相矛盾的。 \n因为使用零网的人们，很少会去使用QQ。所以这种信息，疑似五毛党发布。请大家谨慎对待!!!",
				"added": 1496285367
			}
		]
	},
	"comment_vote": {}
}