{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Работа ZeroNet в изолированной среде",
			"body": "нашел интригующий ролик доказывающий что зеронет может работать в изолированной среде, только я не нашел пояснения как это можно реализовать. Может быть вы сможете мне помочь.\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL/local_peer_discovery.mp4",
			"added": 1556432220
		},
		{
			"topic_id": 2,
			"title": "Что есть Хаб?",
			"body": "глупый вопрос, но что есть хаб в зеронете?",
			"added": 1557248835
		},
		{
			"topic_id": 3,
			"title": "Борьба со спамерами",
			"body": "Как я могу заблокировать некоторых пользователей?",
			"added": 1557682936
		},
		{
			"topic_id": 4,
			"title": "CTF'щики вы тут??",
			"body": "Существует ли такой зайт в котором описаны инструменты для хакинга?\n\n\nPS перенес сюда статью [ура новый контент!] о Burp Suite: http://127.0.0.1:43110/1Fi4HftCEA9iyMaqozMKqTQ29AV9EFa7qK/?Post:4:+INFORMATION_SECURYTY+%D0%A7%D1%82%D0%BE+%D1%82%D0%B0%D0%BA%D0%BE%D0%B5+Burp+Suite+",
			"added": 1563539875
		}
	],
	"topic_vote": {
		"2_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": 1,
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"1_1e2mHauMGG8GgSDvaaPrNanxvaxwpGQRV": 1,
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2": 1,
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1
	},
	"next_comment_id": 37,
	"comment": {
		"1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 1,
				"body": "> [deliriumgoddess6](#comment_1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): Ты меня не понял. Вот к примеру, у нас есть сеть, траффик которой проходит через провайдера. однако возможно ли каким либо способом обойти провайдела имея в наличии сеть оптоволоконных кабелей к примеру. Ладно, если вайфай, там реально создать сеть в обход провайдера, особенно если плотность велика.Я понимаю, что оборудование програмно и удаленно контроллируется провайдером. Однако реально ли это обойти?Это чисто теоретические размышления.\n\nЧисто теоретически можно как-то незаконно  подключиьься к магистральной линии, но это почти нереально (можно отрубить кабель и поставить туда свой, но тогда это поймут абсолютно ВСЕ, т к скорость упадет у всех(был случай когда перерезали кабель к Японии и весь трафик шел через Европу)).\nКуда более реальна-нереальна распределенная mesh-сеть подключенных между собой проводами или беспроводами роутерами, такая гиперлокальная сеть(см. B.A.T.M.A.N). В теории внутри такой сети может жить отдельный zeronet, который может связываться с внешним zeronet'om через некий шлюз или же развиваться отдельной ветвью (интересно что будет после объединения ветвей)",
				"added": 1552151314
			},
			{
				"comment_id": 2,
				"body": "> [zxfhu](#comment_7_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): да ебать все российские сети пускай путинские пидорасты сами налоги по ним гоняют из пизды в жопу\n>  иностранных спутников полно спутниковый интернет будем юзать и заливать в локалку РФ торенты\n\nИ будем жить как в Норильске....",
				"added": 1552159890
			},
			{
				"comment_id": 3,
				"body": "> [murzazade4](#comment_26_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Путинские - не путинские, а размерность номера автономной системы всего 65535 вариантов на весь мир.\n\nнесовсем понял Вас",
				"added": 1552160094
			},
			{
				"comment_id": 4,
				"body": "> [zxfhu](#comment_12_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): 65535 это диапазон портов ( какие номера автономной системы дурачек )\n\nчто мешает сделать свой велосипед?)",
				"added": 1552160700
			},
			{
				"comment_id": 5,
				"body": "> [zxfhu](#comment_13_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): какой велосипед тут речь про интернет идетhttps://ru.wikibooks.org/wiki/TCP/IPhttps://ru.wikipedia.org/wiki/%D0%9F%D0%BE%D1%80%D1%82_(%D0%BA%D0%BE%D0%BC%D0%BF%D1%8C%D1%8E%D1%82%D0%B5%D1%80%D0%BD%D1%8B%D0%B5_%D1%81%D0%B5%D1%82%D0%B8)\n\n\"Ранее (до 2007 года) использовались только 16-битные номера AS, что позволяло сделать максимум 65536 присвоений, часть из которых (номера от 64512 до 65534) была зарезервирована как приватные номера AS, которые могут использоваться только локально, по аналогии с частными IP-адресами. Кроме того, номера 0 и 65535 являются зарезервированными IANA и не могут использоваться для маршрутизации, а диапазон 64496-64511 зарезервирован для использования в документации и примерах. В связи со скорым исчерпанием доступного диапазона в 2007-м году был разработан и предложен стандарт на 32-битные номера AS RFC 4893, что позволило адресовать 232 автономных систем (за вычетом некоторых зарезервированных диапазонов), не теряя совместимости с уже имеющимися 16-битными ASN. \" из вашей статьи",
				"added": 1552160986
			},
			{
				"comment_id": 6,
				"body": "> [zxfhu](#comment_14_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): если вы имеете в виду построить свою сеть с нуля то никто не разрешает тянуть оптику тоже самое касается и всяких меш сетей по радиоканалу\n\nэто все уже зависит от условий. Если сохранится бесплатный вайфай и все остальное и только интернет будет как в китае цензурироваться, то свою meshсеть построить реально.",
				"added": 1552161398
			},
			{
				"comment_id": 7,
				"body": "> [zerolespero](#comment_6_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): это все уже зависит от условий. Если сохранится бесплатный вайфай и все остальное и только интернет будет как в китае цензурироваться, то свою meshсеть построить реально.\n\nвсе зависит от людей",
				"added": 1552161426
			},
			{
				"comment_id": 8,
				"body": "> [zxfhu](#comment_16_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): как только меш сеть станет конкурировать с действующими провайдерами роутеры будут пеленговать и изымать с ментами ну или просто штрафовать владельца где тот установлен\n\nв качестве примера meshсети могу привети firechat -- это приложение создает meshсеть на группе смартфонов используя wi-fi, bluetooth. Это приложение использовали в 2012 Протестанты в Китае, т.к власти выключали местный интернет. Конечно такую сеть можно легко заблокировать глушилкой. Так или иначе вопрос блокировки это всегда вопрос времени.",
				"added": 1552161869
			}
		],
		"2_1HEgim6JmWnJtP5j4MwCZmnL6DuxPHZAna": [
			{
				"comment_id": 9,
				"body": "чем syncthing не подходит?",
				"added": 1556091668
			},
			{
				"comment_id": 10,
				"body": "была бы возможность блочить таких людей, но тогда у всех придется удалять этот пост.....минусы децентрализации",
				"added": 1556093864
			}
		],
		"3_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 11,
				"body": "если даже они и смогут отключить рунет от общнго инета, мы здесь продолжим жить. ZeroNet спокойно работает в изолированных сетях, просто время от времени кто-то сможет гонять на ту сторону, скачивать изменения на зайтах, а потом возвращаться и распространять инфу другим пирам",
				"added": 1556094169
			}
		],
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 12,
				"body": "на хабре",
				"added": 1556169233
			}
		],
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 13,
				"body": "> [geekless](#comment_118_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В локальной сети пиры сами находят друг друга.\n\nпо идее они так должны делать, но сейчас проверяя это на виртуалках обьединенных в одну сеть, они не могут обнаружить друг-друга, хотя и виртуалки пингуются между собой. (виртуализация vmware workstation 15, объединение в сеть с помощью LAN сегмента, т.е. статическая маршрутизация без общего роутера/комутатора)",
				"added": 1556449122
			},
			{
				"comment_id": 14,
				"body": "> [sasiska2](#comment_1_13yET77xHP1vpHmJf9a3fbdct3vB5PpzWT): Разве DHT уже реализовали?\n\nвроде да, но он не работает.....",
				"added": 1556539829
			},
			{
				"comment_id": 15,
				"body": "> [geekless](#comment_119_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Т.е. ты создал сайт на одной машине и пытаешься открыть на другой - и оно не работает?\n\nнет, я использовал общий zerotalk, топик тестовых сообщений, на обоих виртуалках этот сайт был скачан. Сечас попытаюсь создать свой сайт и проверить",
				"added": 1556539927
			},
			{
				"comment_id": 16,
				"body": "как удтверждается в официальном блоге, DHT пока что работает только с белыми ip (глобально) и если включен плагин Bootstrapper. info: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:135:Changelog:+August+28,+2018",
				"added": 1556540202
			},
			{
				"comment_id": 17,
				"body": "> [zerolespero](#comment_16_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): как удтверждается в официальном блоге, DHT пока что работает только с белыми ip (глобально) и если включен плагин Bootstrapper. info: http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:135:Changelog:+August+28,+2018\n\nвключив Bootstrapper на обоих виртуалках ничего не изменилось, они все также не могут найти друг-друга как локальных пиров",
				"added": 1556540487
			},
			{
				"comment_id": 18,
				"body": "> [geekless](#comment_120_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Вроде за локалку отвечает этот плагин: https://github.com/HelloZeroNet/ZeroNet/tree/master/plugins/AnnounceLocal\n\nстранно, вроде включен, скоро проведу тест на реальном оборудовании (2 ноута роутер без подключения к wan)",
				"added": 1556629193
			},
			{
				"comment_id": 19,
				"body": "> [ozago](#comment_2_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): Благодарю за помощь !!!) Получается что нужно сохранить эту папку /home/user/ZeroNet-master/data ??? Потом естественно ее заменить после свежей установки Zeronet  в новой операционке ?\n\nесли нужны все сайты то всю папку data, если только пользователя перенести то только файл users.json (в папке data)",
				"added": 1557234492
			}
		],
		"1_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": [
			{
				"comment_id": 20,
				"body": "вы имеете в виду подключение к серверам гугл напрямую? тогда предлагаю воспользоваться vpn/proxy которые ведут трафик до калифорнии (или одного из датацентров гугла)",
				"added": 1557241407
			}
		],
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 21,
				"body": "много контента есть на англоязычных блогах и общем зеротолке, на русском не мало материала(сравнивая со всеми языками, кроме китайского и английского), нам не хватает активных пользователей, которые смогут эффективно генерировать контент",
				"added": 1557241791
			}
		],
		"4_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 22,
				"body": "> [74x](#comment_2_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp): Чем вам приложения на основе XMPP протокола не угодили?\n\nисходя из шапки, пользователь интересуется децентрализованными мессенджерами, а XMPP это клиент-серверный протокол, и для его использования нужно пользоваться уже поднятыми чужими серверами, либо поднимать свой сервер. Плюсы децентрализованных мессенджеров в том что нет необходимости в общем сервере",
				"added": 1557242025
			},
			{
				"comment_id": 23,
				"body": "что вы скажете о meshenger'е?",
				"added": 1557242161
			}
		],
		"2_1AefSRYaJKZg4XhSbQJs2GtNA4cur8h1Qp": [
			{
				"comment_id": 24,
				"body": "> [cxtg](#comment_5_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz): Сам алгоритм шифрования взломать невозможно https://ru.wikipedia.org/wiki/Advanced_Encryption_Standard еще не было прецедентов чтоб кто то его смог взломать\n> RSA https://ru.wikipedia.org/wiki/RSA\n\n*невозможно за приемлемое время, невозможно, если закрыть глаза на существование квантовых компьютеров, которые могут взломать AES и RSA за несколько минут",
				"added": 1557243756
			},
			{
				"comment_id": 25,
				"body": "> [ruslan777c](#comment_1_1PmTT7rXXV3k1cEr4ecFR3DPEbR2biHbuj): а чем доказывается существование квантовых компьютеров ( не чем это все домыслы )а вот обычные суперкомпьютеры взломать aes не могут\n\nконечно, сейчас не существует квантовых компьютеров, которые смогли бы сейчас и в ближайшие лет 20 взламывать данные протоколы шифрования.\nСпособ взлома RSA и AES известен со времен их создания, и любой компьютер может их взломать, если у него  будет достаточно времени.",
				"added": 1557310105
			}
		],
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": [
			{
				"comment_id": 26,
				"body": "http://127.0.0.1:43110/1JBFNPrAGp1nQX6RsAN6oRqCfvtoeWoion/ мой любимый",
				"added": 1558704662
			}
		],
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": [
			{
				"comment_id": 27,
				"body": "> [dude](#comment_70_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Тут можно было бы рассказать про 6to4 и прочие Ygg, но боюсь это будет пустым сотрясанием воздуха. И лень :)Аффтар: если твой контент будет интересным, он разойдется по сети и без наличия доступного порта.Главное сообщай о нем куда нибудь, чтоб люди интресовались. А сетевые процессы оставь программе, оно само разрулится.\n\nа можно еще рассказать о прекрасной ~~России~~ ipv6 когда у каждого будет уникальный ip, и можно будет забыть об белых и серых IP......",
				"added": 1559430140
			}
		],
		"2_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 28,
				"body": "можно больше информации о проблеме?",
				"added": 1559549182
			}
		],
		"3_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": [
			{
				"comment_id": 29,
				"body": "больше данных, пожалуйста",
				"added": 1559549215
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 30,
				"body": "Криптография на JS весьма ненаднжна........",
				"added": 1562915955
			},
			{
				"comment_id": 31,
				"body": "это весьма полезно для CTF'щиков",
				"added": 1562954093
			}
		],
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 32,
				"body": "> [ultraviolet](#comment_118_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): По сути действительно хорошая вещь для связывания нескольких локальных сетей в одну ipv6 сеть.  Расшаривания файлов,  организации удалённого терминального доступа,  общей телефонной сети и так далее\n> Второе назначение - средство преодоления цензуры. Ставим yggdrassil себе дома и ставим на удалённой VDS,  идём на VDS по RDP осматриваем свободный интернет.Всё то же самое работает и по tor и по i2p\n> Как транспорт для ZeroNet ну а ZerNet  - тут сами выдумывайте, у меня пока в процессе создание распределёного хранилища исходного кода и собранных артефактов для CI/CD\n> Дополнительный слой прозрачного шифрования для WiFi - для связи внутри одной сети\n> Удалённое управление множеством VDS через ansible/taktuk и прСтавим везде yggdrassil и в инвентарный файл пишим в инвентарные файлы ipv6 адреса\n> Стабильность - норм,  накладных расходов больших вроде нет.\n\n\n***\n> Второе назначение - средство преодоления цензуры. Ставим yggdrassil себе дома и ставим на удалённой VDS,  идём на VDS по RDP осматриваем свободный интернет.Всё то же самое работает и по tor и по i2p\n\nОчень ресурсоемкое решения, лучше используйте linux. (vps  с windows обычно весьма дороже)\n1. Арендуем самый дешевый vps/vds с linux за бугром\n2. Ставим Openvpn(Любой протокол позволяющий пускать трафик через наш vps)\n3. наслаждаемся свободным интернетом\n+ можно разместить публичную ноду yggdrasil\n\nPS остраня нетерпимость к windows",
				"added": 1565681393
			},
			{
				"comment_id": 33,
				"body": "> [ultraviolet](#comment_119_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e): Всё так, с небольшими \"но\"\n> 1) RDP намного менее требователен к качеству связи чем проброс X через ssh или VNC\n> помогает правильный подбор шифров используемых на ssh сервере и опция -Y вместо -X\n> ещё можно nx использовать\n> 2) Предложенная Вами схема с VDS как OpenVPN сервером имеет один большой недостаток - она уязвима перед \"ковровыми банами\" - ситуациями когда роскомнадзор банит целую подсеть или блок адресов за наличие в ней mtp proxy или чего-то похожего\n> yggdrassil, tor,  i2p в этом плане предпочтительнее т.к. позволят получить доступ к такой vds даже при её попадании в банОкно в свободный интернет остаётся в этом случае открытым\n\n1. не понимаю необходимость графики (опционально)\n\n2. есть механизмы маскировки openvpn под https. Если вы используете vps один или с небольшой группой людей, то шанс блокировок минимален. \n\nНо конечно yggdrasil будет работать до тех пор пока есть ноды к которым можно подключиться, то же самое с i2p и tor(но у 2х последних есть скрытые шлюзы, так называемые мосты)\n\nНормальную скорость работы можно наблюдать только в vpn и yggdrasil. Но yggdrasil станет по-настоящему безопасным, только тогда когда он будет использоваться как протокол маршрутизации, а не сети-над-сетью",
				"added": 1565718222
			},
			{
				"comment_id": 35,
				"body": "как протокол маршрутизации сети -- вещь прикольная, но по-сути сейчас сеть идет через публичные пиры по обычному tcp (есть возможность tls но пока в России только Питерская нода поддерживает), т е соединение защищенно непосредственно в сети yggdrasil, но подключение через ноду не шифруется.",
				"added": 1578486379
			},
			{
				"comment_id": 36,
				"body": "как протокол маршрутизации сети -- вещь прикольная, но по-сути сейчас сеть идет через публичные пиры по обычному tcp (есть возможность tls но пока в России только Питерская нода поддерживает), т е соединение защищенно непосредственно в сети yggdrasil, но подключение через ноду не шифруется.",
				"added": 1578486388
			}
		],
		"2_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 34,
				"body": "если бы не java, было бы норм",
				"added": 1570262951
			}
		]
	},
	"comment_vote": {
		"35_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"3_1EvxfCoxLud3PxCZznczb2idoKKJeUB3TU": 1,
		"12_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"16_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"52_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"1_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": 1,
		"53_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"59_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"13_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"93_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"180_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"5_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy": 1,
		"22_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo": 1,
		"2_1JE6djoBJfroS1y5DnwpMWRRcMkruPpkyv": 1
	}
}