{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet всё?",
			"body": "Еще год назад он был полон жизни. Сейчас всё совсем глухо.\nОстались ли русскоязычные зайты, на которых есть жизнь?",
			"added": 1548020547
		},
		{
			"topic_id": 2,
			"title": "Судьба Зеронета",
			"body": "Отредактировано за бессмысленностью. ",
			"added": 1548624442
		}
	],
	"topic_vote": {
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 98,
	"comment": {
		"1_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 1,
				"body": "> [caryoscelus](#comment_33_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Нет (за исключением пары полуживых блогов), все сидят на англоязычных неспецифично-язычных. Тут слишком мало людей, чтобы ещё по языкам делиться\n\nНу вас-то я здесь периодически вижу. Но еще вот летом 2018 сеть (то есть её русскоязычный сегмент, конечно) был полон жизни, была какая-то совершенно особенная атмосфера. А сейчас что-то совсем глухо стало, да и после происшествия Балансера (дай Бог он выкарабкается!) здесь уже нет активных членов.\nА ведь так было хорошо. Ни быдла, ни школьников, вежливые, умные айтишники.",
				"added": 1548024467
			},
			{
				"comment_id": 3,
				"body": "> [nononono](#comment_2_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Да не было тут особой ру-жизни. Было очень много Балансера.\n\nА теперь Балансера нету. Не хотелось бы проебать такой чудный уголок.",
				"added": 1548086419
			},
			{
				"comment_id": 13,
				"body": "Здесь есть блоговая платформа. 0blog. Новый сайт создается буквально в два клика мышью, полуркайте.\nПроблема 100% в контенте. Текущая стилистика мне лично нравится: ничего лишнего, всё удобно и быстро, и никакой рекламы.\nВот чат да, проблема. Выход - использовать для коммуникации контакты в клирнетовких протоколах (прежде всего xmpp). Вполне себе рабочая опция. И ононимность, и удобство.",
				"added": 1548368045
			}
		],
		"1_18Xtf4D6fjV5LcbfbfwbCLhevDPWFvXnDp": [
			{
				"comment_id": 2,
				"body": "Заходить сюда почаще, очевидно же.",
				"added": 1548086386
			}
		],
		"2_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds": [
			{
				"comment_id": 4,
				"body": "> [pussyjuice](#comment_3_1F4oxgYUoS5TYCgRahBQmzriDSrDhbsMYc): Зашёл от хикканов отдыхать, а вы тут даже, омг, не выбраться мне из статуса \"хикка\"\n\nПора Рефужач пилить.",
				"added": 1548086552
			},
			{
				"comment_id": 5,
				"body": "> [caryoscelus](#comment_29_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Для обжития лучше бы на другой форум переехать, ибо тут 30К, а админа нет.\n\nДа без проблем, могу создать, если будете заходить.",
				"added": 1548086567
			},
			{
				"comment_id": 6,
				"body": "> [ciniil8n2](#comment_1_17pyCvFSCXyYUiEid8Wa1dmchWa1Cr7AcK): Конечно есть. Привет из /rf/ сосача.\n\nЭто какая-то тотальная помойка в последнее время.",
				"added": 1548086614
			}
		],
		"1_1DFURoGa82KRTWpHMYDgjsZ9vSKK752i9S": [
			{
				"comment_id": 7,
				"body": "Что там?",
				"added": 1548365366
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 8,
				"body": "> [geekless2](#comment_22_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Этот сайт давно остался без админов. И вот теперь Роман умер, и сразу несколько форумов в ZeroNet тоже остались без присмотра. Надеюсь, его ключи не попадут в чужие руки, и никакой злоумышленник не удалит его сайты, и они продолжат работать.\n> Жаль, что в ZeroNet еще не реализовано архивирование состояния сайтов, и из-за этого контент уязвим к действиям злоумышленника, завладевшего приватным ключом.\n> У меня давно была идея заюзать возможность мультиподписи для форума. Создать форум и дать права на управление нескольким доверенным пользователям. Теперь, думаю, пора этим заняться. Вот только кому, кроме Ромы, я мог бы теперь доверить доступ? И кто согласится? Пока не знаю...\n\nГиклс, вы ли это? \nА где старый аккаунт?\nДа и ДругойНеко тоже тут. Все олды в сборе, однако. ",
				"added": 1548365412
			},
			{
				"comment_id": 9,
				"body": "По теме. Объявляю дух Романа Каршиева покровителем русскоязычного сегмента сети ЗероНет. Он, как никто иной, вложивший в неё массу сил и часть своей души, заслуживает этой роли.\nПокойся с миром, Роман. Ты был настоящим айтшником - умным, деятельным, изобретательным и весьма верным другом. Мне очень будет не хватать твоих оптимистичных постов и бодрого настроя.\nНо всё в этой материальной Вселенной имеет конец, и он пошёл дальше. Успев вложить часть себя в эту небольшую сеть, которая, смею надеяться, станет в будущем чем-то большим.\nПокойся с миром, Роман. Мы не забудем тебя, и не забудем твоё дело.\n\nP.S. Гиклс, Неко - можно архивировать сайты Балансера (их великое множество, я не знаю все, вы олды, у вас должно быть), сохраните их в zip - возможно, когда-нибудь здесь будет сайт-мемориал имени Романа. По крайней мере, он точно заслужил его.\n\nP. P. S. Я соглашусь. ",
				"added": 1548365689
			},
			{
				"comment_id": 14,
				"body": "> [shevanez](#comment_4_1FSbdEiKNhHNUNpnHBbbPS3s39TrFCS7P8): Спасибо.  Главное начать.\n\nИзучайте, скоро грядут изменения.",
				"added": 1548542214
			},
			{
				"comment_id": 19,
				"body": "> [geekless2](#comment_25_175EyKtgTGXztQ4aoLiG3ghPmVqzqTwJUo): Какие?\n\nНу, увидите, я сделаю объявление. ",
				"added": 1548621559
			},
			{
				"comment_id": 42,
				"body": "> [oob0imah](#comment_1_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9): Добрый день.я с Роминой авиабазы. в зеронете я не ориентируюсь - зарегался только с Роминой подачиВы позволите процитировать пост в Роминых персоналиях?http://www.wrk.ru/community/2019/01/t30288_55--balancer.848.html\n\nНе стоит. Я никогда не был на Авиабазе и знал Балансера только по ЗероНету.\nТак что пусть это остаётся частью его Даркнетовской жизни.",
				"added": 1548800956
			}
		],
		"2_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 10,
				"body": "А у нас для этого есть специализированные политические форумы, а это - глобальный русскоязычный портал.",
				"added": 1548366170
			},
			{
				"comment_id": 16,
				"body": "> [deliriumgoddesss](#comment_19_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): чет я не нашел такого. ну может это и к лучшему\nУчитывая вашу мелкобуквенность - скорее всего.\nНо я имел в виду, что даже если нет специализированных политических форумов, вы их всегда можете создать сами.\nТут технические вопросы по ЗероНету обсуждаются.",
				"added": 1548542464
			},
			{
				"comment_id": 18,
				"body": "> [cederbaum](#comment_13_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Мнение El-muridНе скажу, что со всем согласен, но само по себе размышление весьма качественное\n> !!!ВНЕШНИЕ ССЫЛКИ!!!https://zen.yandex.ru/media/el_murid/venesuelskii-keis-1-5c4de2a4c7776100ae886791https://zen.yandex.ru/media/el_murid/venesuelskii-keis-2-5c4dfc20b204f400ac70a4da\n\nЭль-Мюридка в качестве аргумента - это такая штука, или вы серьёзно?\nЗачем тащить пропагандонов в ЗероНет, неужели в клирнете всего этого не хватает?",
				"added": 1548621511
			},
			{
				"comment_id": 20,
				"body": "> [syntia](#comment_39_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Колумб открыл оМЕРИКУ? Скажем же - Закройте форточку, не портите воздух.\n\nЭм, что вы хотели сказать этим потоком сознания?\n\nP.S. Уважаемые novichki, вы развели здесь реальный оффтоп. \nК сожалению, модераторов нет, чтобы почистили, но, надеюсь, это изменится.\nЭтот форум посвящен глобальным вопросам технического характера. Не обсуждению четамувенесуэльцев и украинской проблеме. Мы всегда рады поучаствовать во внятной дискуссии, но, пожалуйста, на специализированных ресурсах, благо создать политический форум здесь можно в два клика. ",
				"added": 1548621614
			},
			{
				"comment_id": 39,
				"body": "> [cederbaum](#comment_18_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Как марксист я не могу согласится со всеми построениями el-murid, хотя есть вещи с которыми согласен.Назвать его пропагандистом - соврать.\n> el-murid пишет, то что думает. Его размышления опираются на весьма солидную теоритическую базу - теорию систем, теорию социального субъекта,  класическую политэкономию, теорию игр.Применяет эти теории он весьма своеобразно. \n> Относительно же Венесуэлы - он прав.  Это конец крайне гнилого политического режима, который завёл эту страну в глубокий кризис.\n> Во многом он прав и относительно будущего России.  Текущий режим тут также ведёт страну в такой же кризис.  Разница в том, что запас прочности России за счёт наследия СССР много больше.\n> Всё сказанное мной не обозначает что в Венесуэлле или в России после краха режима Путина (мне не нравится это название, но пусть будет пока так), наступит рай или воцарится свобода-равенство и братство.Этого не будет. На 100%.  Это твёрдо можно гарантировать.\n> Но законы природы таковы, что общество проедающее созданное предыдущими поколениями гарантированно рано или поздно остаётся ни с чем.Это не следствие чьей-то злой воли.  Из кувшина можно выпить только, то, что в кувшине есть.Законы сохранения обойти нельзя.\nВы знаете, что о Эль-Мюриде ходят слухи, что он в своё время пытался стать платным пропагандистом? Что он ходил, по-моему, к Кристине Потупчик, но его жестко  отказали? \nИ да, господа, вам не кажется, что ВСЕ топовые ЖЖ-блоггеры на политическую тематику не могут рассматриваться в качестве беспристрастного на 100% обзорщика? Все эти люди так или иначе ангажированы. Я с этой кухней давно знаком, и, представьте себе, топовые блоггеры могут получать зарплату от АП. \nP.S. Вы думаете, главный форум - хорошее место для споров в подобной тональности?  И нет, это не имеет ничего общего с моими политическими взглядами. \nИменно поэтому я, да, уверен, что здесь не надо разводить ядреный срач, а делать это лучше в специальном загончике, если так хочется. Аргумент \"а вот у англосаксов срутся\" - не аргумент. ",
				"added": 1548790863
			},
			{
				"comment_id": 41,
				"body": "> [cederbaum](#comment_20_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Простите, но лично мне было бы интересно предметно критиковать теорию,  модель которую использует оппонент, например el-murid, а не личность оппонента\n> Если оппонент научно честен и его теория логически верна - какая разница кто оплачивает его обед?\n> Если же оппонент допускает фактологические подтасовки или его теория содержит ошибки - будь он хоть самым святым бессеребрянником, это не делает его построения верными.\n\nХорошо. \nИзвините, возможно, я несколько нахамил вам в предыдущем посте. Гнев - мой недостаток, я с ним борюсь.\nНо поймите, раздражение вызывает тот факт, что человек не приводит собственные факты, а ссылается на чужие. Слишком часто мне доводилось наблюдать, как это ассоциируется с интеллектуальной ленью и нежеланием думать своей головой.  Тем более если есть подозрения в фактической предвзятости. Тут не Фрицморген, конечно, но где-то в этой патриотической лиге.",
				"added": 1548800398
			}
		],
		"1_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 11,
				"body": "Перебирайтесь в ЗероНет\nЗаблокировать его невозможно, да и не нужно, пока тут не будет политики (а её не будет, если коммьюнити будет адекватное).\nДля анонимности тут есть маршрутизация через Тор.",
				"added": 1548367627
			},
			{
				"comment_id": 15,
				"body": "> [shevanez](#comment_2_1FSbdEiKNhHNUNpnHBbbPS3s39TrFCS7P8): Вот уже переселение начал.\nЗамечательно. Располагайтесь, заходте на форум ежедневно.\n> [elemi](#comment_1_18UeDvpmD9K3KxA1WjVh9G8pevYrAfDgmF): Зеронет наверное идеальней чем все остальное. Скорость классная, люди адекватные) сидел бы тут сутками напролет,  только людей очень мало) и активность слабая)\nЛюди да, умные. Раньше, когда здесь 95% были программисты, было еще лучше, обсуждали вещи вплоть до распределенных систем и двоичного программирования. \n> [cederbaum](#comment_4_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Я начал с RetroShare,  штука неплохая, но от обычного интернета всё же отличная.  ZeroNet пока изучаю.\nРетроШара, на мой взгляд, заселена шифропараноиками в крайней степени, да и мне лично она показалась крайне неудобной вещью.",
				"added": 1548542386
			},
			{
				"comment_id": 17,
				"body": "Ничего себе вы тут нафлудили. \nКак будто в ранний Зеронет вернулся.",
				"added": 1548621430
			},
			{
				"comment_id": 24,
				"body": "> [bvn13](#comment_7_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): А вот в англоязычном пространстве зеронета - политосрачи\n\nА там уже не то коммьюнити, что было раньше, понабежали всякие.\nХотя уже тут в соседней теме начали тащить Эль-Мюрида и прочую пропаганду. \nТак что хотелось бы просто загнать это всё в огороженные резервации, хотя бы. \nПонимаю, что звучит грубо и без политики в ЗероНете разумеется, не обойтись, но лично я политикой и четамувенесуэльцев/хохлов/нужное подставить сыт по горло еще в клирнете. ",
				"added": 1548627907
			},
			{
				"comment_id": 25,
				"body": "> [geekless](#comment_63_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Есть кнопка Mute.\n> Уж как-то надо определиться - за свободу слова или за цензуру.\n\nЗа свободу слова, естественно, но в рамках отдельных тематических форумов.\nЕсть люди, которым просто неприятно читать про политику. Их ведь тоже надо уважать. И я это не о себе сейчас, я бы как раз с удовольствием бы посрался на тему политоты. \nТак что безусловно, никакой цензуры быть не может, но давайте уж все это дело будет обсуждаться там, где его можно будет никогда и не увидеть при желании.",
				"added": 1548684522
			}
		],
		"1_1F4oxgYUoS5TYCgRahBQmzriDSrDhbsMYc": [
			{
				"comment_id": 12,
				"body": "Конечно, но только на огороженных сайтах (тут есть такая опция) и только для своих. \nУ нас, когда был еще жив Балансер (царствие ему небесное), и были дискуссии с олдами, обсуждали этот вопрос. Пришли к выводу, что, поскольку хостинг сайтов раздельный, в сети может сосуществовать полностью белая тематика и тотальное непотребство без особых рисков.",
				"added": 1548367815
			},
			{
				"comment_id": 68,
				"body": "> [mistalero](#comment_30_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что за опция?\n\nПриватные сайты. Не знаю точно, реализована ли она уже, но в roadmap она была.",
				"added": 1549638737
			}
		],
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": [
			{
				"comment_id": 21,
				"body": "> [santosa](#comment_1_1FWuWYw9WD3KR3zRxW41AVrxdogCpS5mRJ): Пишите FAQ первым делом. Я, например, впервые тут и пока до блогов только добрался и как-то порно фото нашел и всё.\n\nFAQ уже есть.\nhttp://127.0.0.1:43110/1zeroRvxd42DSWUETotiaa8k5a5mDGvJs/\nНо оно несколько устарело (несильно, но некоторые зайты уже неактуальны)\nЕго надо обновить и закрепить большим жирным шрифтом  заглавной темой на этом форуме.\nЭто одно из первейших направлений деятельности, которым я предлагаю заняться. Задача - получить контроль над этим зайтом. А то тут админ раз в год появляется. \nP.S. Все обновления этой темы будут отображаться у вас в реальном времени, если вы нажмете в правом верхнем углу кнопочку Following in Newsfeed.",
				"added": 1548625225
			},
			{
				"comment_id": 22,
				"body": "> [santosa](#comment_2_1FWuWYw9WD3KR3zRxW41AVrxdogCpS5mRJ): Спасибо за оперативность в ответе! Будем просвещаться!\n\nУ меня все обновления в реальном времени, особенности движка форума\nПока онлайн, буду отвечать сразу же.",
				"added": 1548626310
			},
			{
				"comment_id": 23,
				"body": "> [bvn13](#comment_5_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): А вообще удобно ли все это хозяйство запускать на каком-нибудь сервачке и ходить с мобилки/удаленно?\n\nУ ЗероНета нет \"сервачков\". \nВесь контент хранится на машине каждого юзера. Да, и на вашей тоже. И полностью доступен в любой момент, даже оффлайн.",
				"added": 1548627484
			},
			{
				"comment_id": 26,
				"body": "> [geekless](#comment_62_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): А должно быть иначе в нецензурируемой сети?\n\nНу порядок элементарный навести-то можно, наверное? \n\n> [geekless](#comment_67_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Кстати, что касается совета. У меня давно была идея, но всё было не до того. Немного другая идея...\n> Нужна площадка для общения, защищенная от DoS атаки на файлы в data/users/. Т.е. это подразумевает доступ по белым спискам и ручную модерацию. Но не с целью ограничить кого-то в правах, а именно для защиты от автоматических атак.\n\nПолностью поддерживаю, такая же идея была. \nБелые списки это здорово в плане приватности. \n\n> [nononono](#comment_6_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Ржачный пост ))) \"Я стар...\" \"Я бы хотел...\" \"Я буду рад...\" \"Возглавим, ура!\" \"Седина яиц!\". Дурь, вождизм и попытка зарулить п2п, ну-ну (уж молчу что ZN вообще ни в каком месте не дарк)...\n\nА вот и первый параноик.\nВо-первых, зарулить p2p нет ни малейшей возможности, при всём желании. Просто архитектура сети не позволяет.\nВпрочем, я знал, что будут претензии подобного рода. Вы просто не знаете, что такое осваивать сеть с нуля  в то время, когда самые первые юзеры, у которых остался контроль над основными узлами, давно забили на сеть, и ты тыкаешься в эти устаревшие ссылки, видишь посты, датируемые 2017 годом и ранее, и при этом пытаешься во всём этом разобраться. \nЕсли бы не Балансер, то я, в своё время, так бы и забил, наверное. \n\n> [caryoscelus](#comment_36_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Суть пузырей именно в том, что пользователи не видят ничего за пределами своего ;) А выползают из него только в экстренных ситуациях.\n> Во многом такое понимание возникает из-за того, что сеть всё ещё достаточно мала и пролистав один каталог мы можем продолжить искать что-то новое (хотя многие просто уходят). Если представить хоть сколько-то масштабный приток активных пользователей, любителей лазить по каталогам значительно поубавится. Частные рекомендации никуда не денутся, но конкурировать \"домашние страницы зеронета\" будут скорее всего в маленьком тесном кругу\n\nОт пузырей в данном случае никуда не деться, такова архитектура сети.\nСуть идеи в том, чтобы пользователи сразу вползали в некий \"начальный пузырь\" ссылок и контактов, и уже оттуда распределялись по интересам. Это, на мой взгляд, оптимальный компромисс. \nНо для этого надо отредактировать вот этот конкретный форум  Хотя бы. Убрать ссылки на давным-давно устаревшего Гомзика,  повесить вместо них блог Geekless'а (который сейчас самый активный юзер в сети) и закрепить ссылку на FAQ первым сообщением.\nА, ну еще обновить движок форума на более свежую версию, которая позволят создавать подразделы. ",
				"added": 1548685361
			},
			{
				"comment_id": 28,
				"body": "> [geekless](#comment_64_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Суммарная статистика пользователей, которые имеют >=10 постов, по 3 самым посещаемым русскоязычным форумам:\n> http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgEhttp://127.0.0.1:43110/1F4WVHDpQYxuJL6xEY3EZTYkZds9TTjVHChttp://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ\n> Количество постов - ник - дата первого поста - дата последнего поста:\nНу, в итоге видно, что кроме трех указанных мной человек старожилов, по сути, больше и нет (кроме покойного Романа). \nОстальные либо пишут эпизодически, либо давно не появлялись в сети.\nПочему бы не передать им чисто административные задачи? Какая-либо реальная регуляция тут НЕВОЗМОЖНА, но начальный пузырь для адаптации новичков в сети сделать стоит. ",
				"added": 1548685754
			},
			{
				"comment_id": 31,
				"body": "> [geekless](#comment_68_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Жаль deepstrelok куда-то пропал. Интересные материалы публиковал. Надеюсь, не подстрелили стрелка, и не сел никуда.\nДа, помню Леонида. Тоже хотелось бы его видеть в составе. Отличный блог у него был.\n> [geekless](#comment_69_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я сейчас сижу и сочиняю документ на английском... моего инглиша явно не хватает для составления документов формальным полуюридическим языком.Нужно как-то скооперироваться со всеми, не только с русскоязычными.\nНемного не понял вас.  Документ, касающийся ЗероНета?\nИ каким именно образом кооперироваться с англоязычными?",
				"added": 1548686590
			},
			{
				"comment_id": 33,
				"body": "> [geekless](#comment_70_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Объединённый совет.\n\nНе уверен, что они воспримут эту идею, но стоит попробовать, да.",
				"added": 1548687126
			},
			{
				"comment_id": 34,
				"body": "> [cederbaum](#comment_15_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Будущее Zeronet зависит от наличия в нём интересного и востребованного контента, интересных сервисов.Много обещать не буду.  С меня сайт на математическую тему.  Подборка литературы,  ссылки на математические сайты в clearnet,  информация о математическом ПО.\n> Вот созданный мной форум в RetroShare: retroshare://forum?name=Mathematics%20%2F%20matematicas%20%2F%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D0%B0%D1%82%D0%B8%D0%BA%D0%B0%20%2F%20Mathematik&id=c194b4aeb77d42b01f2277d75c81297d\n> Буду популяризировать ZeroNet среди знакомых и коллег.\n\nВау, как круто. А можно вкратце о том, что там, для тех, у кого Ретрошара давно удалена?\nТакие люди нам очень нужны.\nP.S. Если здесь начнут зависать люди с математическим образованием, это огромный плюс к интересности и атмосфере сети. ",
				"added": 1548712134
			},
			{
				"comment_id": 37,
				"body": "> [anotherneko](#comment_121_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Почему бы не сделать ее открытой и не разместить здесь же, в zn? \nТоже вариант, я не против.\nНо здесь возникает вопрос: кто тогда возьмёт на себя непосредственную модерацию этого форума и чистку разделов?\nЕсли речь идёт о нескольких олдах, можно отдать админку им всем, на случай, если кто-то уйдет - полномочия останутся. \nВ принципе, меня лично устроила бы передача админки Geekless'у, он постоянный участник сети и на мой запрос по Вики среагировал довольно оперативно.\nВ таком случае можно ограничиться созданием подраздела на этом форуме. Демократично, открыто и удобно. ",
				"added": 1548714703
			},
			{
				"comment_id": 38,
				"body": "> [cederbaum](#comment_17_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): \n> Также в планах -  публикация сведений о подборке в пабликах НМУ, форумах Мехмата, МФТИ, МИФИ и так далее.Естественно с пояснениями - почему именно Darknet а не clearnet и как технологиями ZeroNet или RetroShare (Tor, i2p) пользоваться\n\nГлавное преимущество ЗероНета - невозможность удаления контента. Всё, что вы здесь опубликуете, останется здесь навсегда. Люди будут летать на Марс, а все ваши файлы останутся и никуда не исчезнут, пока хотя бы один сид раздает их.\nНу и, разумеется, полное отсутствие рекламы, неподцензуренность, и интеллектуальная атмосфера в целом. \nИменно это меня в своё время и подкупило, кстати. Только здесь я получил развернутый ответ (от Балансера) по поводу низкоуровневого программирования на старых ПК. ",
				"added": 1548714976
			},
			{
				"comment_id": 40,
				"body": "> [geekless](#comment_71_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ну или квантовые вычисления хакнут ECDSA, и всё... xD\n\nЯ уже писал вам в англоязычном блоге, что, если это произойдет, в апокалипсисе, который настанет после этого, никому до ЗероНета не будет особого дела.",
				"added": 1548791342
			},
			{
				"comment_id": 45,
				"body": "> [gomzik](#comment_105_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Вот это я неожиданно вовремя заглянул. Да, balancer делал многое и не только для zeronet, но и для любых децентрализованных штук в частности. Rest In Peace...\n> Я давно уже не заходил себя, но это скорее проблемы временного характера, zeronet навсегда в моем сердечке. Это я к тому, что с удовольствием поучаствую в любой активности в популяризации проекта, сети, чего угодно, но на текущем этапе жизни я не готов гарантировать какую-либо регулярность.\n> Очень много апдейтов пропустил, далеко еще не со всеми аспектами зайтостроения разобрался, но все еще хочется как-то помочь зеронетушке любимой.\n> Короче говоря, я, судя по статистике ниже, олд еще аж 16го года, готов помогать по мере возможностей, если конечно возьмете\n\nПервая просьба: поделитесь, пожалуйста, админкой на этом сайте с Geekless'ом. Он здесь находится постоянно и уже очень много сделал для сети. Потому что если вы исчезнете, это будет очень неудобно.\nА сделать тут еще очень много надо. Воспользуясь случаем, выдвину запросы:\n1. Закрепить ссылочку на FAQ http://127.0.0.1:43110/1Apr5ba6u9Nz6eFASmFrefGvyBKkM76QgE/?Topic:4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4/ZeroNet+Ru+FAQ+ZeroNet чтобы она всегда висела наверху.\n2. Убрать из предложенных блогов kostanew, он здесь уже давно не появлялся и заменить его блогом Geekless, там сейчас самая актуальная информация по разработке на данный момент.\n3. Создать подраздел на форуме \"Совет по развитию\" куда и перекинуть эту тему.\n\nВот мой скромный набор предложений, кампанию за реализацию которых я, собственно, и развернул всей этой темой.",
				"added": 1548883411
			},
			{
				"comment_id": 46,
				"body": "> [deliriumgoddesss](#comment_26_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ): кстати, на западе началась кампания против зеронета. Чую она и до россиюшки доберется. Готовимся к массовым вбросам.\n\nМожно источник информации?\nUPD. Нашёл самостоятельно. На ZeroTalk это сейчас наиболее обсуждаемая тема.\nОказывается, они сейчас форсят, что якобы в ЗероНете окопалась запрещенная в РФ организация. \nЭто ставит еще более актуальным вопрос об администрировании.",
				"added": 1548884249
			},
			{
				"comment_id": 49,
				"body": "Зайт тут спамить начали, похоже. Есть какие методы противодействия?",
				"added": 1549057955
			},
			{
				"comment_id": 50,
				"body": "> [shift](#comment_380_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Господа,  а есть то какая версия zerobord с модерацией или еще нет? из проекта на полгода выпал\n\nСамая свежая версия - та, на которой работает ZeroTalk.",
				"added": 1549201332
			},
			{
				"comment_id": 51,
				"body": "> [shift](#comment_383_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): и там есть модерация?\n\nНу можете зайти и посмотреть. 95% процентов что есть, они убирали китайские топики в своё время.\nИ да, Шифт, реализуйте уже список запросов, я их неоднократно постил в треде. Или передайте админку Geekless. \nПожалуйста.",
				"added": 1549295115
			},
			{
				"comment_id": 54,
				"body": "Дежурное напоминание админу: проапгрейдите сайт, закрепите FAQ, наведите порядок.",
				"added": 1549386289
			},
			{
				"comment_id": 57,
				"body": "Пользуясь случаем, хочу поделиться в этой теме промежуточными впечатлениями.\nВ целом, после Балансера стало заметно хуже. Несколько человек (включая меня) молодцы, реально генерируют около половины контента в русскоязычном сегменте, но пока еще этого мало.\nПроблема сейчас - это текучка людей. Были всякие Цедербаумы и прочие, но они как появлются, так и исчезают. Админ этого сайта тоже вроде приходил, но очень ненадолго.\nНе хватает чего-то вроде гравитационной массы, чтобы удержать людей. Из-за этого наблюдаем текучку.\nИ да, субъективно - качество приходящих стало несколько хуже по сравнению с прошлыми годами. Появилась политота, обильные смайлоюзеры, спамеры. Раньше такого не припомню. ",
				"added": 1549399725
			},
			{
				"comment_id": 59,
				"body": "> [jamesjames](#comment_10_1FpqTHmVvxR5EznDnqE6DwgwJfiG9N7vmp): В ZeroNet не нужно постоянно сидеть „крутя педали“, закидывать мусором гонясь за количеством также не следует, пусть себе спокойно работает пополняя общую базу полезной/уникальной информацией.\nОх, у меня много есть что сказать по этому поводу.\nСеть (её русскоязычный сегмент) развивалась \"в свободном режиме\" где-то  года 4 с самого запуска. В это время она так и не обрела устойчивости: люди приходили и уходили. Я сам приходил сюда год назад, провёл здесь около месяца и ушёл - причина, думаю, во всех случаях стандартна: отсутствие контента.\nМы не \"крутили педали\" 4 года, и за это время ничего особого не добились. Стоило мне вбросить этот пост - и посмотрите, за неделю было проведено больше работы и создано больше блогов, чем за полгода до этого. \n\n> \n> Не следует удерживать тех, кто не хочет здесь оставаться, они вернутся при подходящем случае.Главное – дальше популяризировать ZeroNet как это делал Balancer, кратко и понятно, на собственном примере, вызывая интерес не только к возможностям сети, а и как дешёвый способ публикации, доступ к уникальной информации которой нет в интернете.\n> \nСтремиться удержать людей не обязательно значит, что им кто-то что-то будет навязывать. Это Интернет, тут такое невозможно. \n> Пусть приходят, двери ZeroNet открыты всем без исключения.\nУ меня противоположное мнение по этому поводу. Когда я пришёл в ЗероНет, то, помимо прочего, полюбил его за то, что тут собралось очень интересное коммьюнити. \nОткрывать двери нужно прежде всего для людей интересных и нетривиальных.\nЕсли открывать двери для всех без исключения, хлынет тот токсичный контент, которого и в Клинете полно. Оно надо, делать из ЗероНета маленькую копию РуНета?",
				"added": 1549472769
			},
			{
				"comment_id": 60,
				"body": "> [nononono](#comment_9_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Уже который день у меня глаза наполнены слезами умиления...Ох, ребята,  be careful с этим фюрером.\"Я сурьёздно\" )\n\nВаше мнение всем невероятно интересно, продолжайте держать в курсе.\nВсё, чего я добиваюсь - пытаюсь сделать так. чтобы ЗероНет не загнулся. В том числе и от тех проблем, которые ждут сеть по мере роста популярности, если таковая произойдет. ",
				"added": 1549545421
			},
			{
				"comment_id": 61,
				"body": "> [gomzik](#comment_117_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Мдауж, неплохо так проштормило зеронет спамом. А еще ругаются на модерацию, как потом иначе все же в этом шуме найти хоть что-то полезное. Хотя конечно согласен, где есть ниточки контроля, там всегда будет злоупотребление полномочиями\n\nРечь идёт не о контроле, а о модерации небольшого числа (подчеркну) основных зайтов, с которых происходит приход и адаптация людей с Клирнета.\nВсё, что за пределами этого - полностью во власти владельцев сторонних зайтов.\nP.S. Только, видимо, зря я всё это написал, если даже админ, который бывал в этой теме, так и не сделал ничего из предложенного. ",
				"added": 1549545515
			},
			{
				"comment_id": 62,
				"body": "> [geekless](#comment_112_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Тут посерьёзнее каша заваривается. Китайский спамер атаковал ZeroMe и ZeroTalk.\n\nТак вот почему у меня тормозит ZeroMe.\n> [syntia](#comment_47_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Каких прекрасных людей теряем, друзья... Как жаль... :(\nА вот это уже бот.\nСудя по всему, за ЗероНет взялись по всем фронтам. ",
				"added": 1549545557
			},
			{
				"comment_id": 63,
				"body": "> [nononono](#comment_11_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Кто тебе сказал что он загибается?Кто тебе сказал что ЗероНет нужны какие-либо усилия чтобы он не загибался?И, повторю - кто тебя назначил главным спасальщиком?\n> \n> Какой бот? Какие фронты?? Что ты несешь???\n> И если надо спасать ЗН, то от тебя (и твоих подпевал), конечно... Ты абсолютно неадекватен.\n> \n> ZeroMe у тебя тормозит потому что ZeroMe сама по себе мегалагучая \"в дизайне\" дрянь. И чем дальше тем будет хуже и без всяких школо-спамеров.\n> Ты еще и некомпетентен.\n\nТоварищ майор, ну не переживайте вы так, всё равно тут террористов нет. Мы просто реализуем своё конституционное право на свободу переписки (извинился на всякий случай за цитирование Конституции, никакого экстремизма).\nP.S. Хотя, возможно, это просто лахтинец. Знакомый истерично-экспрессивный стиль, нацеленный на то, чтобы переорать собеседника. ",
				"added": 1549552238
			},
			{
				"comment_id": 64,
				"body": "> [geekless](#comment_114_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там БД тормозит в основном.\n\nТак на это и нацелен спам, собственно: рост базы данных до состояния лагодрома.\nИ, насколько я знаю, блокирование не помогает: посты продолжают отображаться, но их раздача продолжется.\nЭто проблема.",
				"added": 1549552388
			},
			{
				"comment_id": 66,
				"body": "> [geekless](#comment_115_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): \n> А на практике, кто бы занялся. У меня сейчас нет времени.\nДа вряд ли уже кто-то займется, это бессмысленно, если скоро будет портирование на третий питон. Всё равно менять придётся.\nВообще странно, что разработчик изначально написал код на втором Питоне, а не на третьем.",
				"added": 1549579479
			},
			{
				"comment_id": 72,
				"body": "Ну что ж, пришло время подвести что-то вроде предварительных итогов по поводу этого треда.\nСпасибо всем, кто откликнулся. было выдвинуто много конструктивных предложений. Но по факту инициатива была подхвачена geekless, и им был проделан достаточно большой объём работы с целью привлечь англоязычный сегмент, что увенчалось некоторым успехом: откликнулась kaffie, один из активистов англоязычного сегмента.\nНо пока что инициатива глохнет из-за технического несовершенства многих узлов сети, отсутствия свободного времени у участников (и слишком низкого уровня квалификации у остальных). \nВ итоге из реалистичных целей - ждать перехода на третий Питон и добиваться всё-таки от админа данного форума, чтобы он пофиксил его. Остальное пока несущественно. Ну и, разумеется, заходите сюда почаще, поддерживайте активностью сеть, аполняйте контентом, я, со своей стороны. всегда буду стараться это сделать. \nВсем большое спасибо за участие в обсуждении.",
				"added": 1549834844
			},
			{
				"comment_id": 76,
				"body": "Ничего себе ботов понабежало.",
				"added": 1549976685
			},
			{
				"comment_id": 78,
				"body": "> [gluckman](#comment_43_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): \n> Если ZeroNet Concil будет делать разумные вещи - буду  помогать,  будут творить фигню - интернет большой я и в стороне постою\n\nНу, этим сейчас занимается уже geekless, не я.\nhttp://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD",
				"added": 1550065565
			},
			{
				"comment_id": 95,
				"body": "> [adiom](#comment_3_1BUgGDu31ceZJeMmFpKpdqro2fGqEb1qXG): я вообще недавно узнал кто такой балансер, жаль что он ушел, но что значит \"сеть осталась без руководства\"? это децентрализованный проект - каждый популяризирует как может, нет?\n> невозможно читать такой текст без форматирования  (это проблемы со зрением) не осилил пока всё\n\nСеть вообще безвсего осталась теперь. Одни тупые школьники на нулевой.",
				"added": 1551425106
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 27,
				"body": "> [sinobi](#comment_18_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL): https://ru.wikipedia.org/wiki/Netsukuku Вот хорошая идея на случай зомби-апокалипсиса\n\nЭтой штуке сто лет в обед, и с приватностью там не очень. \nПлюс, дата последнего обновления - 2014 год. Не шутите так.",
				"added": 1548685620
			},
			{
				"comment_id": 29,
				"body": "> [sinobi](#comment_19_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL): я про идею :)\n\nТак вы сейчас буквально используете гораздо более адекватную реализацию этой идеи. \nИли вы имели в виду реализацию именно сетевого протоколоап? Так есть cjdns и прочие меш-сети.",
				"added": 1548685942
			},
			{
				"comment_id": 30,
				"body": "> [sinobi](#comment_20_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL): Как альтернатива интернета в общем идея хорошая , я не говорю про анонимность.0net все равно использует интернет, а там смысл в независимом интернете впринципе.\n\nЭто называется \"меш-сеть\", погуглите Hyperborea.\nИ да, для таких штук нужно быть киберпанком 80-го уровня. \nДа в этой теме всё как раз и описано, насколько это сложно, даже через радиосвязь. ",
				"added": 1548686316
			},
			{
				"comment_id": 32,
				"body": "> [sinobi](#comment_22_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL): Без провайдеров , без посредников, не контроля.\n\nНу, тогда вооружайтесь высшей математикой, квантовая связь сама себя не изобретет.\n> [sinobi](#comment_23_1HrCEoWhAu7miP6GCnKhwZhM1VAPibcCRL): Интересно однако в 0net ,хотя бы тут меня понимают :)\n\nЯ создал эту тему еще полгода назад, и у меня были точно такие же мысли.\nВ итоге пришёл к выводу, что организация параллельного Интернета - это дело дико сложное, ресурсозатратное и грозящее реальной бутылкой в наших условиях.",
				"added": 1548686890
			}
		],
		"34_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 35,
				"body": "> [l8](#comment_12_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Казалось бы: до школьных каникул ещё далеко.\n\nВ школьниках нет ничего плохого, если они неглупые и готовы учиться.",
				"added": 1548713372
			},
			{
				"comment_id": 36,
				"body": "> [l8](#comment_13_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Зато в кликушестве, паникёрстве, плачах Ярославны, бессмысленной имитации кипучей деятельности (даже без желания понимания матчасти), а так же в постах, которые невозможно разобрать с трёх раз — много плохого. \n> Вернее всё.\n\nЭто возрастное. \nСам таким был.\nНе забывайте, школотроны -  не глупые взрослые, а личинки будущих людей.",
				"added": 1548713638
			},
			{
				"comment_id": 91,
				"body": "> [fsat](#comment_5_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h): 1-БАЗА СОБИРАЕТСЯ НЕ СРАЗУ\n> 2-ТЕСТИРУЙТЕ РАЗНЫЕ ВЕРСИИ ПРОГРАММЫ 1.0.0 И 1.1.1 они самые стабильные\n> 3- я свою базу собирал неделю моя база качайте https://drive.google.com/file/d/1kfaNESGPcPjzNi0vnmWQtuKkIElYWQDl/view?usp=sharing пароль к орхиву 4trg5ETGD43rtFR4AJ\n> 4-оба порта желательно открыть но не обязательно\n\nЕЩЕ БОЛЬШЕ КАПСА",
				"added": 1551192151
			},
			{
				"comment_id": 92,
				"body": "> [fsat](#comment_7_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h): тебе не похуй ли уебак ? это мои посты я просто сказал что самая стабильная версия это 1.1.1 работает на linux и на win\n\nПочему ты сразу скатываешься в оскорбления?\nЯ просто хотел сказать, что не надо быть неуравновешенным школьником. Не надо сразу кидаться говном.",
				"added": 1551215214
			}
		],
		"37_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 43,
				"body": "Господа, похоже, у нас первый спамер.",
				"added": 1548882011
			}
		],
		"4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 44,
				"body": "Замечательно. Вот это бы теперь закрепить, чтобы оно всегда висело на заглавной.",
				"added": 1548882213
			},
			{
				"comment_id": 56,
				"body": "У нас тут живая дискуссия, идёт довольно бодренько.\nhttp://127.0.0.1:43110/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:1549295456_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y/\nЛюбители СССР, присоединяйтесь.",
				"added": 1549391084
			},
			{
				"comment_id": 74,
				"body": "Неистовый, решительный бамп.",
				"added": 1549894753
			}
		],
		"35_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": [
			{
				"comment_id": 47,
				"body": "> [cederbaum](#comment_23_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV): Не знаю, ставлю себе в план для изучения\n\nУ вас что-то отображается?\nУ меня пост пустой.",
				"added": 1548885469
			},
			{
				"comment_id": 48,
				"body": "> [geekless](#comment_82_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Заголовок же. «Как прикрутить Sphinx к zeronet»\n\nА мне показалось, это спам. Ни вопросительного знака, ничего. Спам как он есть.",
				"added": 1548968399
			}
		],
		"2_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": [
			{
				"comment_id": 52,
				"body": "Это какой-то Омск...",
				"added": 1549320433
			},
			{
				"comment_id": 53,
				"body": "> [bvn13](#comment_12_19eXfGkykvbJgB7fb4TPYTkxWmuNTxeRMJ): Можно подумать, Tor спасет. Я вот на ВПС (не в РФ) поднял тор для зеронета, но я не знаю, открыт ли он для всех. Ключ делал какой-то.\n\nПока что спасал. Таки это поделие американцев.",
				"added": 1549320837
			},
			{
				"comment_id": 71,
				"body": "> [gluckman](#comment_38_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Законы России и многих других стран преследуют за \"распространение\" порнографических материалов. Думаю излишни говорить, что p2p сеть ZeroNet делает каждого посетителя такого сайта \"распространителем\"\n\nПросто не раздавайте порносайты.\n Да их тут и нет, впрочем-то. Этого всего добра в Клирнете хватает.",
				"added": 1549662851
			}
		],
		"5_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 55,
				"body": "Шикарно.\nСпасибо вам за подвижничество, Geekless. Вы фактически единственный продолжаете дело Балансера.\nP.S. Только на раздачу встаньте. ",
				"added": 1549390699
			}
		],
		"1_1Pr9VbYQky3wwQRTv7o1SaNaAXJJPJvwRZ": [
			{
				"comment_id": 58,
				"body": "> [slxnxt](#comment_1_1Hiwge5zfHLUeGYZeLythYBKt1bN4W5F9z): Протеин инсайдера, надеюсь.\n\nВычисляйте.",
				"added": 1549471875
			}
		],
		"2_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 65,
				"body": "> [mistalero](#comment_28_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Как то он некорректно работает.\n\nОн не работает.\nЕдинственный более-менее работающий поисковик здесь.\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1549576503
			},
			{
				"comment_id": 70,
				"body": "> [mistalero](#comment_29_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Это каталог, а не поисковик.\n\nЗато работает. В целом функции такие же, как и у поисковика, зайтов пока немного, можно просмотреть вручную весь каталог, особенно русскоязычных.\n> [promusik](#comment_48_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): И как туда зайты заносить?\nВерхняя правая часть экрана - submit New Site",
				"added": 1549639105
			}
		],
		"2_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 67,
				"body": "> [slxnxt](#comment_2_1Hiwge5zfHLUeGYZeLythYBKt1bN4W5F9z): . И в любой момент смогу подменить приложение на модифицированное, чтобы увести средства пользователей. Кто будет этим пользоваться?\n\nТак и владельцы крупных клирнетовских бирж точно так же могут увести средства пользователей, от этого никто не застрахован. Помните Mt.Gox? \nВсё держится на честном слове и репутации.",
				"added": 1549579618
			},
			{
				"comment_id": 69,
				"body": "> [slxnxt](#comment_3_1Hiwge5zfHLUeGYZeLythYBKt1bN4W5F9z): \n> Да тут вообще, всего пользователей криптовалют, можно по пальцам руки пересчитать они уже пользуются биржами, в том числе децентрализованными, если заинтересованы в последних.\n\nДецентрализованнаябиржа - это как? Что-то типа WAVES?",
				"added": 1549639004
			}
		],
		"2_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 73,
				"body": "> [beeholder](#comment_2_1JZKKzmvBupAZGgJuWQzmNLo1MBs5N9rn): ну хоть бы вычитал и повторы убрал, прежде чем копипастить..\n\nДа это ньюфаг какой-то перевозбудился.",
				"added": 1549887701
			}
		],
		"13_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 75,
				"body": "> [mistalero](#comment_32_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Что за Matrix?\n\nАнонимный мессенджер",
				"added": 1549904135
			}
		],
		"3_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 77,
				"body": "> [promusik](#comment_54_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Это же бывший GNU Ring. Юзал я его около года назад. Был очень не стабилен и качество связи очень уныло. По факту по пол часа (я даже не утрирую) соединялся с другим пользователем и не показывал его актуальный статус: в сети / не в сети. Может сейчас и стало лучше, не тестил.\n> По юзабельности и качеству TOX оказался чуть более стабильным.\n\nДа, меня тоже напрягло, что у него логотип Ring на заглавной.",
				"added": 1549976717
			}
		],
		"1_1Q6g2HSASAUunmUi4MhT2yjAKAD2H5S74j": [
			{
				"comment_id": 79,
				"body": "Ну вы б еще Vasyan Remix на телефон закачали.\nПользуйтесь проверенными кастомами.",
				"added": 1550261095
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 80,
				"body": "Да ничего не будет.\nВ Китае не смогли, здесь и подавно не смогут.",
				"added": 1550522450
			},
			{
				"comment_id": 82,
				"body": "> [gluek](#comment_5_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Юридически смогут, фактически как обычно\n\nА что юридически смогут?\nВ КНР, у которой денег немеренно, мощностей под производство оборудования - тоже, до сих пор Золотой Щит обходится через прокси. \nА вы про Русь переживаете, белки. Ничего не будет. Ну, может, Телеграм заблокируют, в конце концов. Невелика потеря.",
				"added": 1550526161
			},
			{
				"comment_id": 83,
				"body": "> [nononono](#comment_16_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Смешно ) Да никто не будет ходить к каждому персонально. Просто запретят меши одним днем и будут принимать чуваков с открытым вайфаем выборочно и показательно. Через месяц забудете как пишется \"меш\".\n\nДа-да-да, товарищ майор, прямо будете рейды проводить, как в СССР при поимке радиохулиганов.",
				"added": 1550607443
			}
		],
		"1_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 84,
				"body": "Да, здесь для этой цели специально Тор встроен.",
				"added": 1550607492
			}
		],
		"1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 85,
				"body": "Основная проблема ЗероНета - это не технические ограничения (хотя и это тоже, но в меньшей степени). Основная проблема - это полное отсутствие коммьюнити. Даже в этой теме ответы оставляют одни левые Аноны, которых я тут раньше не видел. Что свидетельствует о том, что люди приходят и уходят - текучка. Кто эти люди, о чём они пишут вообще - смотришь на ЗероНет и думаешь.",
				"added": 1551017873
			},
			{
				"comment_id": 86,
				"body": "И да, у меня ощущение, что Зеронет сейчас активно топят лахтинские боты, судя по этой теме. И, надо признать, у них получается - желание писать и общаться с подобными людьми не очень велико.\n\nВ любом случае, способность к самоорганизации у нас очень низка, ниже плинтуса. Как только какое-либо коммьюнити разрастается, люди начинают собачиться друг с другом из-за надуманных проблем. Наблюдал такое и среди англоязычных, но у русскоязычных это выражено не в пример сильнее. ",
				"added": 1551017948
			},
			{
				"comment_id": 88,
				"body": "> [revolter](#comment_3_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Тебе просто кажется, на азерском форуме пересидел, моча в голову ударила. Впрочем, можно удалить Зеронет, если не нравится.\n\nА вот и первый ольгинец. Видите? Собственно, и без этих ребят тут было не айс, но они очень быстро всё засрать могут, если будет необходимость.\n",
				"added": 1551023351
			},
			{
				"comment_id": 89,
				"body": "> [revolter](#comment_4_1KjdFRQ6GtEB5nPzWHUQNnGrmozrabJqGJ): Извини конечно, но ты должен понять, что главные враги Зеронета - это вахтеры, которые делят пользователей на своих/чужих, мечтают ввести доступ по белым спискам и подмять под себя ресурсы.\n\nПлохо работаешь, негодно. Тоньше надо. Поздно уже извиняться, когда ниже толсто намекал на необходимость удалить Зеронет.\nА всё равно, раз уж эти появились - это уже всё, конец. Всё, к чему прикасается Ольгино, превращается в дерьмо.\nПроебали мы Зеронет.",
				"added": 1551027287
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 90,
				"body": "> [fsat](#comment_1_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h): Вам на политические форум нужно идти\n\nТут таких нету.",
				"added": 1551189570
			},
			{
				"comment_id": 93,
				"body": "Шли годы, а Анон все так же обсуждал: ну как же обустроить Россию!....",
				"added": 1551291075
			},
			{
				"comment_id": 94,
				"body": "> [hartmann](#comment_7_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c): Традиционное развлечение же. Спорили, спорят и будут спорить. И без какого либо результата.\n\nДа, вы очень странные.",
				"added": 1551360262
			}
		],
		"3_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 96,
				"body": "Всем похуй.",
				"added": 1551425132
			}
		],
		"1_1Dw6LvgbshhRFV9XQgPCAkqTZCdK5V7ce1": [
			{
				"comment_id": 97,
				"body": "> [fsat](#comment_20_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h): 1-как правило  слабоумные линуксоиды2-начинающие криптопанки3-серьезных ребят тут нет и не будет до тех пор пока в zeronet не появится поддержка dht и как следствие полнотекстовый поиск и шифрование\n\nХайповых школьников забыл.",
				"added": 1551425553
			}
		]
	},
	"comment_vote": {
		"70_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"15_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"17_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1,
		"111_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"22_1EoGNJ7g8DxDmhN1h3k6kGKb9TBmBJUmSV": 1
	}
}