{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "En la medida en que tor es software libre ¿no crees que la posibilidad de ser empleada como sistema de control no estaría a la vista de cualquiera que revise el código? En cuanto al origen militar ¿acaso la propia www no tiene ese mismo origen?",
			"post_id": 20,
			"date_added": 1457915771
		},
		{
			"comment_id": 2,
			"body": "Hace tiempo que instalé I2P por última vez, pero leyendo tu artículo me han dado ganas de volverlo a probar. Gracias :)",
			"post_id": 23,
			"date_added": 1458002454
		},
		{
			"comment_id": 3,
			"body": "Extraído de la propia documentación de I2P (http://i2p-projekt.i2p/es/comparison/tor), por si a alguien le interesa:\n\nBeneficios de Tor sobre I2p\n* El número de usuarios es mucho mayor; mucho más visible en entorno académicos y comunidades de hackers; tiene los beneficios de tener estudios formales sobre el anonimato, resistencia y rendimiento; y tienen un líder no anónimo universitario y visible\n* Ha resuelto ya algunos problemas de escalado que I2P aún debe arreglar.\n* Tiene muchos fondos\n* Tiene más desarrolladores, incluso algunos con fondos\n* Tiene un bloqueo de nivel de estado más resistente debido la capa de transporte TLS y a los puentes (I2P tienen propuestas de \"rutas completamente restringidas\" pero estas aún no están implementadas)\n* Es tan grande que incluso se ha adaptado para bloquear los intentos de DOS\n* Diseñado para optimizar el tráfico de salida, con un gran número de nodos de salida\n* Mejor documentación, tiene estudios formales y especificaciones, una web mejor, y muchas traducciones\n* Más eficiente con el uso de la memoria\n* Los nodos cliente de Tor tienen muy poco gasto de ancho de nada\n* El control centralizado reduce la complejidad de cada nodo y puede evitar ataques Sybil fácilmente\n* Un núcleo de nodos de gran capacidad proporciona una mayor rendimiento y menor latencia\n* C, no java (ey!)\n\nBeneficios de I2P sobre Tor\n* Diseñado para optimizar los servicios ocultos, que son mucho más rápidos que los de Tor\n* Totalmente distribuido y auto organizado\n* Los pares son seleccionados continuamente según el rendimiento y categoría, en vez de confiar en la capacidad indicada\n* Los pares Floodfill (\"servidores de directorios\") cambian, en vez de estar siempre fijos.\n* Tan pequeña que no ha sido bloqueada o Dosed.\n* Amigable con las aplicaciones p2p\n* Conmutado por paquete en vez de conmutado por circuito\n ** Implica control de carga transparente de los mensajes a través de múltiples pares, en vez de por un sólo camino.\n ** Resistencia contra fallos ya que usa varios túneles en paralelo, además de rotar los túneles\n ** El número de conexiones en i2p vienen dado por O(1) en vez de O(N) (por ejemplo, Alice tiene 2 túneles de entrada que son usados por todos los pares con lo que habla Alice, en vez de un circuito por cada par)\n* Túneles unidireccionales en vez de circuitos bidireccionales, usando el doble de nodos un par se compromete más para obtener la misma información.\n* Protección contra la detección de la actividad de un cliente, incluso cuando un atacante participa en el túnel, ya que los túneles no son sólo usados para pasar el mensaje de punto a punto (por ejemplo, netDB, administración de túneles, pruebas en los túneles)\n* Los túneles de I2P tienen una vida corta, reduciendo el número de muestras que un atacante puede usar para lograr un ataque activo, al contrario que con los circuitos en Tor, que son típicamente de larga duración.\n* Los APIs de I2P están específicamente diseñados para el anonimato y la seguridad, mientras que SOCKS está diseñado para su funcionalidad.\n* Básicamente todos los pares participan en el rutado de otros\n* El uso de ancho de banda de cualquier par completo es bajo, mientras que en Tor, aunque un nodo cliente no necesita mucho ancho de banda, realmente no participan completamente en la red.\n* Sistema integrado de actualizaciones automáticas\n* Ambos tipos de transporte, TCP y UDP\n* Java, en vez de C (ewww)\n",
			"post_id": 23,
			"date_added": 1458005443
		},
		{
			"comment_id": 4,
			"body": "Me ha gustado el tono positivo del post, ojalá podamos ayudar a materializarlo.\n\nEn cuanto al listado que aportas, veo que falta SAFE:\nhttps://forobits.com/t/maidsafe-hilo-general/\nno conozco mucho, hace poco alguien me habló de ella y parece interesante también.\n\nPor cierto, también fui usuario de Retroshare una temporada pero indagando el otro día sobre su estado, me pareció que está algo abandonado el proyecto. Es una pena pues el concepto era muy interesante y prometía mucho. Estaría muy bien que un día pudieras escribir sobre él para animar a la gente a probarlo y hasta podríamos jugar un poco con el invento entre varios o varias.\n\nUn saludo.",
			"post_id": 25,
			"date_added": 1458084472
		},
		{
			"comment_id": 5,
			"body": "Esperamos ansiosos (pero sin presión alguna) tus próximas entregas. En cuanto a MainSAFE  y tras haber investigado un rato, no me acaba de quedar muy claro si es una revolución, una estafa o un proyecto a medio camino entre ambos extremos. En una línea similar, está Ethereum (https://es.wikipedia.org/wiki/Ethereum), que probablemente también merecería un post algún día. Saludos.   ",
			"post_id": 25,
			"date_added": 1458158920
		},
		{
			"comment_id": 6,
			"body": "Para mi lo mas preocupante es precisamente el poco enfoque que, por ahora, tiene esta red en cuanto al anonimato :(",
			"post_id": 28,
			"date_added": 1458403378
		},
		{
			"comment_id": 7,
			"body": "Yo añadiría un elemento que me parece el más crítico: limitar o evitar en lo posible el uso de smartphones. Hay que tener en cuenta que en este país (y en toda la UE) es obligatorio *identificarse* para poder conseguir una SIM de un proveedor de acceso a la rede telefónica inalámbrica. Así pues, dificilmente vamos a poder ser anónimos portando encima un dispositivo que asocia nuestra posición geográfica, nuestra agenda telefónica y nuestros ires y venires por internet y demás universos de metadatos, cuando además nos identifica unívocamente a un DNI y a un domicilio. Nuestra personal chapa de ganado marcado es nuestro teléfono \"inteligente\".",
			"post_id": 27,
			"date_added": 1458495129
		},
		{
			"comment_id": 8,
			"body": "Muy interesante, muchas gracias por tomarte el tiempo de explicarlo :-)",
			"post_id": 314,
			"date_added": 1492716263
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"2": 1,
		"20": 1,
		"23": 1,
		"28": 1,
		"34": 1
	}
}