{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "С @alexanova там ситуация вообще показательна, на тот момент казалось что вот, случилось. Блокчейн перестал быть уделом маргиналов. Известный человек 30+ тыс подписчиков в твиттере из абсолютно не связанной с блокчейном и криптовалютами сферы. Но оказалось что сами пользователи Steemit не поняли свалившуюся на них удачу. Я просто не понимаю, как можно было просрать такой шанс. Там можно было получить нехилый приток аудитории в конечном итоге.\n\nНо, что ещё стало заметил именно в тот момент. Сообщество там примерно разделилось, на тех за и тех кто против. Это не было единогласное решение. Сила флага там много больше силы лайка. И в этом проблема. Даже если они хотят там изображать свободный рыночный подход к модерации, это неправильно выбранные параметры. При них будет скрываться все, что не нравится каким-то группам лиц. Сценарий 451 по Фаренгейту, где было запрещено все, потому-что кого-то задевало. И вот они ещё там считают это благом, да и невозможность критиковать изнутри этому способствует. Во многом это из-за отсутствия аналогов. К концу года должна появиться AKASHA на схожих принципах но довольно отличающаяся в деталях.\n\nВ такие моменты я вижу преимущества тех, принижаемых нами ужасных централизованных соцсетей вроде YouTube, Twitter, Facebook. При всех тех ужасах цензуры, и единоличного управления, там ситуация с контентом куда лучше. И на сравнительном примере со Steemit, на фейсбуке будет все там возможное и много большее сверху и напротив, значительную часть контента и пользователей фейсбука она просто не способна принять. В ней нет возможности для того разнообразия. А чтобы составлять какую-то конкуренцию, и даже допустить теоретический перекат пользователей, нужно обладать много большим потенциалом \"принять всех\". Хотя там проблемы с масштабируемостью ко всему прочему, говорить о подобном рано.\n\n>Может, Алексе рассказать про ZeroNet?\n\nВот я довольно давно знаком с разными децентрализованными сетями. И мне бы просто стыдно было что-то советовать кому-либо известному человеку или медиа всерьез, как площадку для публикаций. Для фанатиков оно конечно все хорошо, но они просто привыкли закрывать глаза и отказываться от сравнений с популярными площадками по причине: они же такие большие и такие коммерческие, куда нам с нами тягаться. Вот они таке плохие, этого должно быть достаточно чтобы с них уходить, надо только агитировать и объяснять людям, крича об одиночных случаях блокировок аккаунтов и подобном. А нужно тягаться и сравнивать, если хотим рассчитывать на серьезную аудиторию.\n\nМастодон может быть несколько ближе для принятия массами, но там уже начала складываться определенная практика цензуры, так-что пока непонятно как это разрешится. С учетом блокировок инстансов, неравномерного качества предоставляемого сервиса, это все вытекает в проблемы с интуитивным пониманием площадки для новичков, которое таковым и так только с натяжкой можно было назвать.\n",
			"post_id": 7,
			"date_added": 1495154779
		},
		{
			"comment_id": 2,
			"body": "> [pozya](#comment_3_1Jq6z2fdZefKyb3MFWTCPnJqwvmHxfU8Px): ...пока кто-то не сольет тебе всю репутацию.Да ну нафиг такие системы :)\n\n> [balancer73](#comment_3_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ну и сольёт, и что? :)\n> Я же писал — кросспостить выборочно :D Что мешает постить те из записей, что вполне будут в формате?\n\nЯ рассматриваю проблему несколько шире. Да, можно закрывать глаза на флаги, если не гонишься за монетизацией, да и сокрытие постов можно обойти альтернативным интерфейсом или stand-alone блогом. Но даже только с сокрытием для большинства уже рушится целостность пространства. Но, Steemit активно пользуется методом демократического внедрения изменений. Если завтра большинство вдруг решит: \"А что это скрытые посты лежат мертвым грузом в блокчейне. Сообщество их отвергло. Почему бы их не удалить\". Не значит что так будет, но такой вариант развития событий вполне возможен.",
			"post_id": 7,
			"date_added": 1495155236
		},
		{
			"comment_id": 3,
			"body": ">и прочие \"криптоблоги\"\n\nНе нужно говорить о прочих, потому-что нет этих прочих. Голос просто копирует стимит во многом. Да, модель модерации там неудачна, но это не какое-то следствие технической реализации. Вероятно основатели хотели оставить себе достаточно прав в системе, чтобы скрывать контент, который мог бы повредить их бизнесу, а заодно аналогичные права пришлось раздать всем крупным инвесторам. Но это проблема конкретных площадок.\n",
			"post_id": 7,
			"date_added": 1495155570
		},
		{
			"comment_id": 8,
			"body": ">Привет, хардфорк?)\n\nПривет сплит. На самом деле, для сплитопригодности уже нужно хорошее разношерстное сообщество.\n\n> Голос сделан на steemit вроде, разве нет?\n\nОн сделан на основе кода стимит, но это отдельный блокчейн, было проведено свое ICO и сеть от стимита не зависит напрямую, хотя большинство нововведений и хардфорков повторяют за ним.\n\n> Хотели свободную от цензуры систему с монетизацией, получили черт знает что.\n\nХотели получить денег на хайповой теме децентрализации. Да и раздробленность сообщества ещё.",
			"post_id": 7,
			"date_added": 1495401035
		}
	],
	"comment_vote": {},
	"post_vote": {
		"7": 1
	}
}