{
	"title": "冲虚志",
	"description": "各种修道体悟行，不喜勿进",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 32,
	"demo": false,
	"modified": 1467773269,
	"post": [
		{
			"post_id": 31,
			"title": "谈谈管理之有无利用",
			"date_published": 1467773239.227,
			"body": "首先声明，我说的利用，不是你理解的利用。概念不统一，根本就尿不到一个壶里去。\n我说的利用，源自老子:“有之以为利，无之以为用。”\n于是问题来了，一大波文盲快速聚集中，各个都很愤慨：这他妈究竟是个什么鬼？\n我突然很同情当年西出函谷关的老子，为什么要走？为什么一个东方的圣人却把自己全盘西化？都是被文盲给逼的啊。就连进行义务扫盲教育的孔圣人，也不过是看起来不那么傻逼的文盲。（此段装逼值一百，逼格直接满分）\n由于老子已经全盘西化了，我突然发现用西文解释中国的汉字具有更清晰的效果。因为大家西文水平都不怎么样，正因为不怎么样，才在词汇的意义上比较统一。比如为了解释什么是利，什么是用，我挑了两个西文单词，一下子就全清楚了。\n这两个单词分别是exploration 和exploitation。于是一大波西文盲又开始迅速聚集围观，说妈蛋你装逼都装到海外去了，再过两天地球都装不下你了。\n各位稍安勿躁，为了解释这两个词，咱从西游记发现水帘洞的故事入手。话说一群猴子看见飞流直下三千尺的瀑布之后，很好奇瀑布后面是什么，但是没人敢为自己的好奇心冒险，只有孙悟空瞑目蹲身，跳过水帘，发现了花果山福地，水帘洞洞天，为群猴找到了一份天造地设的家当。请问，孙悟空的这种行为，叫什么？\n雷锋？傻逼?二货？图样图森破？这些词基本代表了现代中国社会的普世价值观。但我要告诉你的是，孙悟空的这种行为，就是exploration，大白话说，就是创新、探索、研究、发现。科学家、新兴企业家、各种极限运动爱好者、神秘事件解读者……甚至民科，基本都可以划分到这一类来。他们的行为就像披荆斩棘的利刃一样，在未知的世界里探路前行。只有当你内心有想法，有意愿，有求知好奇的欲望，才会去做这些但求过程，不问结果的探索性质的行为，老子给统一归纳为“利”。\n孙悟空发现了水帘洞之后，群猴一拥而入，抢盆夺碗，占灶争床，那么请问，群猴的这种行为，叫什么？\n答案不言自明，这种行为就是exploitation。根据已有的，现成的知识或者经验，让生活走入正轨，并维持一种常规状态的行为，用时下流行词来概括，就是维稳。比如让火车按时按点开车，飞机按时按点降落，这些都可以称之为exploitation。只有当你心如止水，湛然常寂，无欲无求的时候，才会过上这种常规性的、重复性的、单调枯燥的、平淡如水的生活，这种生活不需要创新，不需要改变，完全基于已有的知识和时空范围，因此老子给统一归纳为“用”。\n然后世间事不过就是利出而用，用尽而利。循环往复，生死轮替。\n比如沈括的驴友生活就是一种利，在这种“利”的行为下，他发现了煤矿和石油，然后就有人通过烧煤烧油来便利生活或者谋取利益，这就是以沈括的“利”，实现自己的“用”。\n再比如，美国军方为了解决如何避免苏联核打击而发明了去中心化的网络，这种研究就是“利”，而后来互联网的发展改变了一个时代，这种结果就是“用”。\n有人说，利出而用，就这么简单的一件小事，你在这儿夸夸其谈半天，究竟有毛意思？\n各位，须知这世界所有的复杂都源自简单，越是简单的事，里面越是有不可思议的复杂。\n比如我们人类，人之出生到成家立业，其实就是一个不断“利”的过程，天性如此，你看那小婴儿，对一切事物都充满好奇，什么东西都想摸摸，什么味道都想尝尝，其行为举止乃至语言，都充满了不可思议的“创新”和“另类”。但是尽管他们看起来很新潮，却连最基本的动作都做不好，比如走路会摔跤，吃饭会噎住，说话会结巴……这就是能利而不能用的表现啊。\n再看老年人，有工作有保障有人生经验，做事从容自信，言谈举止无不得体，唯一的问题就是毫无新意可言。他们因循守旧，不思进取，墨守成规，严肃刻板……这就是能用而不能利的表现。\n然后问题来了，若是两者各行其是，互不干扰，倒也无妨，问题是同在一个屋檐下，老的看小的不稳重，小的看老的不变通，老的非要以“用”的标准遏制小的“利”的本性；而小的非要以“利”的标准嘲弄老的“用”的稳便。如此，老少之间矛盾四起，纷争不断。\n个体如是，组织亦如此。对于企业来说，为什么百年老店如此罕见？请问你百岁老人就很常见吗？都是一回事。即便有所谓的百年老店，也早就死去活来折腾了不知多少次。企业草创之处，就如同婴儿一般，虽然筋柔骨弱，看起来弱不禁风的模样，但是其内在的本性却是“利”，这时期的企业创意十足，锐意进取，在未知的蓝海傲立潮头，常能发现新利基，开辟新领域，引领时代的发展。而企业一旦占据了主流市场，规模化，步入正轨之后，其“用”的本性开始显露，如果石油能日进斗金，那么开发太阳能就不会占据他的主体地位。此时的企业，最重要的目标是把已有的“用”最大化，并尽可能常态化。创新固然重要，但是其风险和收益是一样的，那么保证已有的收益就比获取未必能拿到手的未知收益重要的多。\n有人看到这，说I see，如今国家号召万众创新，就是鼓励大家都去利，不要固步自封于用。凡是这么想的人，都还不能领悟我们传统文化的精髓。\n什么是传统文化的精髓？孔子云：中庸。老子云：守中。所以只能利而不能用，不得精髓；只能用而不能不利，亦不得精髓。综合来看，精髓一个字就足以概括：易。\n居安而能思危者，易也；穷变通久者，易也。利出能用者，易也；用尽能利者，易也。\n在人们认识的误区当中，普遍认为保守的人不懂变通，他们没有注意到的是，创新者、探索者其实更不懂得变通？每个人其实都安享于自己熟悉的状态当中，一个创新者，一个学者固然不停的探索新知识，发现新领域，但你让他们停下探索的步伐，他们也做不到。他们最熟悉的事情，就是不停的去满足自己的好奇心，这也就是为什么科学家，学者少有能成就企业家的原因。即便发现了金山，他也不愿意为了挖取一块金子而耽误自己继续探索未知的乐趣。这在本质上，和守着一座金山吃到死，也不愿意探索是否还有另外的金山的保守者如出一辙。\n有人说，你不过解释了什么是利用，这和管理有个球关系？\n在我看来，管理的本质，应该是平衡利用。因为个体天性如此，都是执着于利或用的某一端，管理的作用，就是以外部力量干预个体之天性，让利和用的力量均衡发展。想当年蔡元培提出兼容并包的大学理念，其最终作用，不过就是让善于利的人和善于用的人都济济于北大，从而平衡了北大的利用之势，得以综合全面和长远的发展。因循守旧，遵纪守法就是用的势头盖过了利的势头，用不尽尚可，用尽则必亡；朝令夕改，新规层出不穷，就是利的势头改过了用的势头，没有给“用”留下充足的时间与空间，利出而不及用，也是败亡的征兆。\n关尹子说：“在己无居，形物自著。”大白话解释就是环境一直在变化，你自己不要执着。恰好我发现马克吐温有一句话可以当作最佳注解:“最可怕的,并不是那些未知的事,而是那些你一直坚信的,但实际上并不是那么回事儿的事。”所以呢，真正的管理，不是期盼能有什么万古不变，一用就灵的规章制度、顶层设计，而是管理者自身的不执着，并且在这种不执着状态下能洞悉先机的本能。听起来有些玄幻了，这大概也就是为什么法家的规章制度更能深入人心的原因了吧。\n"
		},
		{
			"post_id": 30,
			"title": "The Real Reason You Are Who You Are",
			"date_published": 1467084662.615,
			"body": "You share 99.5% of your DNA with the person sitting next to you. In fact, you share 97.5% of your DNA with mice. And, believe it or not, 50% of banana DNA is identical to yours! So what makes you so special? Epigenetics.\nThe New Plastics\nRemember the scene in “The Graduate” when the smug, older businessman takes aside the newly minted, baby faced, college grad Benjamin Braddock (Dustin Hoffman) at a party and says: “I just want to say one word to you — just one word — ‘plastics.’” Well, epigenetics is the new plastics. The belief that the genome you inherit from your mother and father is faithfully perpetuated in you is not true anymore. DNA is not your destiny, epigenetics is.\nEpigenetics is the non-genetic variation that we see all around us. Even within our own bodies, it explains how different cells, although all having identical DNA, can perform very different tasks, and maintain those tasks for as long as we live. It is why a nose is a nose and why an ear is an ear. Pretty powerful stuff, and stuff that we are just now realizing.\nA Genetic Light Switch\nBroadly defined, epigenetics includes any process that alters gene activity without changing the DNA sequence. Not only that, epigenetic alterations to DNA are heritable and can be passed to offspring. This little fact makes epigenetics critical to that long, windy road that got us here, also termed evolution.\nSeveral kinds of epigenetic changes to DNA have been described, including methylation, acetylation and other “-ations,” but in general, they serve to “mark” areas of DNA so that affected genes either become active or stay quiet. These marks are both natural and essential to life, but they can also go awry and lead to adverse behavioral and health effects, like cancer, autoimmunity, schizophrenia and autism.\nFilling the Gaps of Infertility\nTechnology can now examine epigenetic marks on DNA on a grand scale, and what’s being learned from such work is fascinating. Take male infertility for example. Most of it is currently unexplained. But epigenomewide studies now suggest that epigenetic patterns in sperm can predict your ability to be a father, both naturally and with the help of assisted reproduction.\nThis has led biotech companies like Episona* to devote their entire existence to figuring out the epigenetic links to fertility. Even more intriguing is the thought that, given the heritability of things, that maybe male infertility is not just about what you’re doing in your life, but also about what your parents’ did in theirs.\nOK, I’ll stop with the “what’s-beyond-the-universe” thinking, and just leave you with the notion that this epigenetics thing is big in medicine right now, clearly emerging as a ghost-like, parallel universe to the Watson-and-Crick-conceived world of DNA.\n*Disclosure: Dr. Turek is an advisor to Episona. \nOriginally posted to my blog, Turek On Men’s Health, here.\n原文地址：https://tincture.io/epigenetics-the-real-reason-you-are-who-you-are-b4469003f9a#.j4xz2siq9"
		},
		{
			"post_id": 29,
			"title": "我是谁",
			"date_published": 1467074575.145,
			"body": "按最新装逼指南，先提出一个高逼格的问题，然后解答之。\n于是我掐指一算，古往今来，唯有我是谁这个问题，最高大上。逼格直上九霄云外。\n像这种高逼格的问题，自然不乏各种高逼格的解答，比如各大宗教，比如高哲先贤，我随便引用一个，都可以获得不少鲜花和掌声。但那谁谁不是说了嘛，装逼不能只为鲜花和掌声，当满世界都在提“云端技术”的时候，我得给大家搞点接地气儿的，至少咱得听得懂，不云山雾绕才行。\n有关我是谁这个问题，大家都把关注点放在了谁的上面，却没人讨论讨论谁谓我。\n于是我一查，哎呦我去，这个我字还真是与我们的常识大相径庭。\n先看《说文》：“手持大戌，呐喊示威。 我，古杀字。”这怎么说的，我不是第一人称代词吗？怎么和兵器啊、打打杀杀什么的牵扯到一起了？我再仔细一瞅这个“我”字，还真是，二戈相背，想想古代那些牛逼闪闪的达官贵人，出行或者祭祀的时候，是不是都身后跟着两排手持尖兵的仪仗队。\n于是这样一副逻辑轮廓就出来了：我的本意，就是武器，武器是用来干啥的，废话，当然是杀人的。为毛要杀人啊？为了我呗。那么你说我是谁？\n我原来就是一种偏见。就是私有和分别的代名词。\n话说在人类社会没有成型之前，一群毛还没进化干净的猴子，为了在地球这个严酷的生存环境下生存，自发形成了团结互助的国际共产主义精神，你摘桃子我打鱼，你耕田来我织衣，所产出的东西大家共享，你吃我摘的桃子，我吃你打的鱼，你吃我种的粮食，我穿你织的衣。大家通力合作，自然分工，资源共享，只要老天爷不发火，倒也是一副其乐融融的世外桃源景象。\n后来呢，有些有经验的猴子赶着年景好，凭着自己丰富的经验，每年多收了三五斗，手头有了余粮，就开始饱暖思淫欲，种地地有时间琢磨怎么打鱼，打鱼的琢磨怎么织衣，还有更离谱的开始琢磨起自己从哪来到哪去的问题，这思维一开拓，本来是副业的东西慢慢占据了主业的精力和时间，为了不耽搁自己琢磨副业的时间，满足生存的主业又不能丢，于是只好想法设法让别人代替自己来做主业，这个时候，交换就产生了。比如研究我是谁从哪里来到哪里去的人开始对种地的吹一些高逼格的东西，对方听得满意，就以此为交换，情愿交出手里的余粮，那个不种地只琢磨圣人之道的家伙也就填饱了肚皮。\n余粮（生产过剩）诞生了私有观念，私有观念催生了交换，交换诞生了商业，然后商业促进了分工的进一步深化。商业的意义在于，让人们从靠天吃饭转向靠人吃饭。以前自己不种地，或者自己种地但赶上年成不好，就要面临基本生存问题，敬畏老天可以求雨求好收成，敬畏人就没什么必要，但有了商业，有了聪明人的囤积居奇，慢慢人们就发现，敬畏老天其实不如敬畏某个手里有资源的人来的见效，最明显的就是，老天看不见摸不着，除了巫师，谁也没法和他沟通，也不知道这伙计到底喜好什么，有资源的人就不一样了，别管怎么有资源，毕竟在人的层面和大家是一样的，可见可摸，甚至可以揣测他的喜好，因为都是人嘛，推己及人，八九都不离十。只要你能投其所好，换口饭吃总是不成问题。比如娼妓业，即便在现在的猴群当中，也能发现靠性交易换取资源的现象，足见此类商业模式之古老程度，跨越物种，超越时间。\n既然可以卖身，自然可以卖命。最早的卖命，其实是为了保命。看似矛盾，实在是因为在严苛的环境下，卖命固然有未来丢命的可能，但若不卖，丢命却只在眼前。\n命一旦可卖，聪明的商人立即知道掌握命运的法则，生命诚可贵，爱情价更多，只要有资源，什么都好说。只要你能掌控资源，你就可以完全掌控别人的命运，而掌握别人的命运，就是掌控自己的命运。从此，人类社会开启权力的游戏模式。\n掌控资源有两种模式，一种是让自己占有资源，一种是剥夺其他人的资源。两者殊途同归，相反相成。尤其是剥夺他人资源尤为重要，第一剥夺来的资源就是自己的；另外，被剥夺者丧失了资源，想生存就只能卖自己的命。于是乎，奴隶制诞生了。\n如何剥夺他人的资源，在文明诞生之前，最直接有效的方式就是暴力掠夺。你看《动物世界》里天天上演的，就是这种资源争夺战。人类的高大上在于，发明了武器，正所谓手里有枪，心里不慌，朝核峰会开得再热火朝天，三胖只需要发射一枚导弹就代表了缺席者的发言。\n所以“我”，最早应该是奴隶主对自己的代指。他傲慢的对被征服者说，你所有的一切，都是“我”的，然后被征服者疑惑的问：“我是谁？”奴隶主指指身后的武器说：“这就是我。”\n古人说“国之大事，在祀与戎”，祀是表达对强于己者的驯服，戎是表达对弱于己者的征服。手持刀枪，则天下皆备于“我”矣。好暗黑的样子有木有？于是你就知道古代的老百姓为毛那么信神，不是他们良心发现了，而是外面来了个更狠的。和同为人的奴隶主相比，老天爷的残忍，忽然变得温情了许多。这就叫斯德哥尔摩综合症。\n有人看到这略表失望，说妈蛋我还以为你要讲哲学意义上的我是谁，弄了半天你给搞了个文字游戏。\n这不叫游戏，这叫探源，哲学才是真正意义上的文字游戏。\n话说在人类文明诞生之前，神鬼肆虐，老天残暴不仁，人类文明一诞生，和君王们一比，以前老天爷的种种残暴不仁忽然变成公正无私了。当人们以为君王就是最残暴的时候，和自家的父母官一比，君王又成了公正无私的了。所以要是没有贪官酷吏，哪来的圣主明君。商鞅深谙此道，才提出用奸不用贤的用人举措，自此才是虎豹盈山，豺狼满地。连诸葛亮那样的“贤人”，入蜀之后也不得不采取苛政，不把你折腾的死去活来，刘备“三丁抽一”又如何显示出仁义来呢？刘璋暗弱，老百姓吃肉骂娘，刘备倒是雄主，代价却是十室九空。所以老百姓的苦难，有一半都是自找的。话说如今的小青年动则就叫嚣血洗东京，扬我中华国威，大抵是红烧肉吃多了，烧坏了脑子。\n所以我是谁？我就是一种分别心，一种私欲的边界，一种以私欲为边界的对抗与冲突。老子云：常无，以观其妙，常有，以观其徼。徼就是边界。一个人有了我的观念，就给自己划定了一个圈子，出了圈子，就要喊打喊杀。我是东北人，东北就是家乡，山东就是异土；我是中国人，山东也是家乡，日本就是异邦；我是地球人，日本人也是同胞，只有火星人才是对头。\n我是谁，可以一层一层分别；同样我是谁，也可以一层一层包容。那么，你到底选择你是谁呢？\n"
		},
		{
			"post_id": 28,
			"title": "Kaiko Releases Bitcoin and Ethereum Market Report",
			"date_published": 1466562989.452,
			"body": "FR, June 21, 2016 at 11:28 BST\n\n\nWhere do big bitcoin traders move their money? Do high trading volumes at Chinese exchanges really equal liquidity? Why is there such a spread difference on different trading platforms?\n\nThe first \"Bitcoin and Ethereum Market Report\" by data analysts Kaiko.com, now available for purchase, has revealed some fascinating insights into trading activity on large digital currency exchanges in first quarter 2016.\n\nKaiko's report is essential reading for anyone operating a business in the digital currency space, or studying the industry for policy or academic reasons.\n\nKaiko founder and CEO Pascal Gauthier said:\n\"The first half of 2016 has been one of the most important periods in bitcoin's history. Our report on digital currency exchanges will give you and your business the most useful information to make the right decisions. And there's more coming soon.\"\n\nVolumes versus liquidity – why they're not the same\n\nBy analyzing trading data from the most popular bitcoin exchanges, Kaiko has determined the best methods for calculating an accurate world bitcoin price, and ranked the exchanges according to their volumes and \"available liquidity\".\n\nFor BTC USD trading, popular platforms like Huobi, Bitfinex and OKCoin are the top-three ranked exchanges for trading volumes. Yet only Bitfinex has high available liquidity. The other two are great for small-volume, high frequency trading, but anyone trying to move a large amount of money at once will probably shift the bitcoin price in a noticeable way.\n\nExchanges like itBit and Bitstamp have higher liquidity, but lower overall volumes. Kaiko's report shows how important it is to look at both datasets to record an accurate ranking.\n\nKaiko's ranking formula gives proportionate weighting to both volumes and liquidity, to give a truer picture of where the 'real' trading is happening.\n\nHow much is a bitcoin really worth?\n\nKaiko's Bitcoin Price Indices also give the most accurate calculation of bitcoin's price worldwide. It is the only company to analyze prices in bitcoin's three most common fiat currency trading pairs: US dollar, Chinese yuan and Euro.\n\nThe simple average prices released by other news and data companies also miss some subtleties. Kaiko once again dives deeper into the data, comparing prices to exchanges' order books and actual orders executed.\n\nAs well as releasing a separate index for each of the three fiat currencies, Kaiko also packages them into one USD figure to serve as the global standard.\n\nThe exchanges report also analyzes the indices' accuracy, showing there has rarely been more than 1% variation between Kaiko and the nine major exchanges, even in times of high price volatility.\n\nEthereum and more\n\nThe Bitcoin and Ethereum Market Report also examines another of 2016's hottest trends in digital currency: Ethereum. Ethereum's smart contracts have had their own issues, but the platform's volatile currency 'ether' is easier to understand and has been popular with traders, making millions for some who've studied its patterns.\n\nKaiko to release more reports\n\nKaiko’s exchange report is the first in a series the company is producing to give an accurate, statistics-based overview of the digital currency industry. Over the coming months, more reports will be published to examine other sectors of the bitcoin industry, such as mining.\n\nThe Bitcoin and Ethereum Market Report is available for purchase on the Bitcoin.com Store and on Airex Market. It covers the period December 1st 2015 to May 31st, 2016.\n\nThe report looks at the currency pairs of most interest to the digital currency industry at the time of publication: BTC-USD, BTC-EUR, BTC-CNY, ETH-BTC, and ETH-USD.\n\nAll underlying data from the report is also available for purchase, should anyone in the industry wish to re-crunch parts of it.\n\nAbout Kaiko\n\nKaiko launched in 2015, with a stated goal to become the Ultimate Data Source for Bitcoin. Its mission is to organize Bitcoin’s information to help businesses succeed by providing data, insights and services.\n\nOver the past year the company has co-operated with premier sites like Bitcoin.com and BitMEX to supply price and other network data charts, with the aim of helping bitcoin and digital currency users make better decisions.\n\nKaiko now has eight staff and is looking to hire more talented data professionals and developers in Paris.\n\nFor more information about Kaiko and its data services for the digital currency industry, please contact hello@kaiko.com  or visit\n\nhttps://www.kaiko.com/"
		},
		{
			"post_id": 27,
			"title": "聊聊东北和朝鲜",
			"date_published": 1466476395.596,
			"body": "话说两会期间，小强总理跑到重庆代表团那里意味深长的说了一句：“现在不同地区行业经济走势出现分化，通俗讲就是冰火两重天。重庆属于火的那一端，跟重庆火锅一样。”\n为毛这么说呢？我们看去年全国平均GDP不到6.5%，而重庆却有11%，是全国平均水平的一倍还多。在全国经济低迷的时刻，重庆却如此风骚，也难怪总理要特别临幸一把。\n既然是冰与火之歌，那唱完了火的那一面，必然就要唱冰的那一面。总理言犹未尽，那无声的矛头，已经开始遥指东北。下界一帮牛鬼蛇神深谙上意，重庆的火锅、火辣和火爆没人再锦上添花加把火，倒是齐刷刷开始唱衰东北：winter is coming，拿什么拯救你，我的东北。\n这一段时间，媒体上最热门的两个关键字，一个是朝鲜，另一个就是东北。各领国际国内风骚数十天啊。三胖大过年的就开始不消停，一直穷折腾到现在，在国际舞台尽展凤姐、思聪本色，搞得左邻右舍鸡飞狗跳，人心惶惶。\n其实从个人角度，我对三胖是蛮放心的。为毛这么说？因为人家是独裁体制啊，具有社会主义优越性。但凡在家能可劲儿打老婆的，在外面一定是怂逼，只要外人不睡他老婆，不强拆他家房子，他才不会去招惹别人呢，自己在家里面称王称霸打老婆多爽。外面的世界帅锅又多，各种风骚小白脸也不少，万一引狼入室、引火烧身，那多不值当的啊。所以但凡是独裁体制，一般不会主动挑起战争，对内的维稳才是正事。\n有人说妈蛋你看不见希特勒正在啪啪的打你脸呢？\n诸位稍安勿躁，用马克思主义来说：凡事要一分为二的看。这万事万物，一定分内因和外因两种，从内因来讲，希特勒并不比三胖高大上，假设希特勒也是三世公子哥，二战断不会烽火狼烟四起。但从外因来看，则完全不一样。希魔生逢乱世，屌丝出身，要想上位，必然要借外国黑暗势力阴谋颠覆的东风，吹旺爱国凝聚人心的烈火，焚烧一个旧世界，希魔才能浴火重生，顺利上位新世界。所谓请神容易送神难，这熊熊烈火，烧起来固然痛快无比，但一旦烧到自家门口，想控制住那也没有可能，所谓玩火自焚，说的就是希魔一类的人，放火本身就是为了上位，可惜上位之后，火势不由自主，只能顺势尽情燃烧，与之同化为灰烬。\n三胖则不然，不存在上位的需求，作为全球最成功的80后，藐视一切拼爹族和啃老族。人家就出生在那个位置上，唯一需要关注的，就是如何把这个位置坐稳了。人家小日子过得滋滋润润的，才没希魔那种毁灭旧世界的屌丝心态呢。有人说，那你如何解释三胖在国际上各种挑衅的举动？\n大哥，千万别被媒体迷惑了你的双眼，蒙蔽了你的心灵。你咋知道不是国际社会在挑衅三胖，而非三胖在挑衅国际社会？这因果关系，如果你不能通透的看，很容易反因为果，得出一个错误结论来。\n见过狗龇牙没？狗为什么要龇牙？\n那位兄台说了：要咬人呗。\n错，大错以及特错。没听说过咬人的狗不叫吗？叫的最凶的狗一定是最不想咬人的那条狗。狗龇牙，只是因为感受到了威胁，要狂吠两声宣泄内心的恐惧，其实叫的最凶的狗，人家的内心独白是这样的：“大哥，你赶紧走吧，我服了，你就把我当个屁放了还不行吗？”\n有人说，三胖的威胁从何而来？靠，大哥你看不见三胖左邻右舍的都是高富帅啊？高富帅也就罢了，还天天对人家老婆抛媚眼，三胖就跟武大郎差不多，自身太挫，左邻右舍都知道他守不住潘金莲，人人都想勾搭一下，唯一的问题就是谁能得手，竞争只存在于左邻右舍之间，根本没三胖什么事。连远隔太平洋的西门庆都听说了这个消息，仗着财大气粗，硬是不远万里来横插一杠子，想拔个头筹。\n面对这样的局面，三胖的内心独白是这样的：“你们都他妈当我是空气啊？老子是挫，但老子是存在的，老子在，你们就休想和潘金莲上床。”于是就有了一系列的狗龇牙事件。\n问题是国际社会是高富帅的天下，人家不会说自己想勾引潘金莲，人家说是三胖太挫，还爱家暴，要解救失足妇女，维护女权。于是民意沸腾，大家都对三胖口诛笔伐，完全忘记了三胖和潘金莲是合法夫妻的事实。\n有人说你他妈这么维护三胖，你是金丝啊？\n真是冤枉，我只是在还原一个客观事实，完全没有立场。要说我同情金三胖，那完全无视我也是同情潘金莲的嘛。尽管是合法夫妻，人家也有追求性福的权力不是。\n说完三胖，咱说东北。东北本质上和朝鲜一样，都是蒙受不白之冤。不同之处在于，三胖因为自身太挫，东北是因为自身太帅。这长相挫，容易招人觊觎；长太帅，容易招人嫉妒。最后的结果都一样，就是惹祸上身。\n有人说妈蛋你不能因为自己是东北人，就可劲儿往自己脸上贴金。用《新白娘子传奇》里的台词说:公子你不要碧莲了？\n借用焦点访谈的广告词：咱用事实说话。\n先问大家伙一个问题，当年为毛会闯关东？因为东北富饶，能吃上饭对不对？所以说，借用历史课本对我大中华的评价，东北那嘎达是地大物博，资源丰富啊。\n地大物博，资源丰富，这仅仅是天资。稍微学过点经济学常识的都知道，资源不是关键。小日本就是典型，地不大，物也不博，资源不但不丰富，还短缺，但人家就是能亚洲枝头一枝独秀，走向全球毫不含糊，搞得我大中华的大爷大妈们买个马桶盖都得漂洋过海。所以说，资源不能当事儿来讲。\n所以呢，其实我想说的是，当年闯关东，说明那时没有户籍限制。什么是户籍限制？看看三胖如何守住潘金莲就知道了。潘金莲再穷再漂亮，但他妈就是迈不出自家那道门槛，要不是开窗户砸了西门庆的头，这辈子也就只能在家被三胖家暴。\n因为没有户籍限制，所以人口能流动，人口流动就能解决一切所谓的“天灾”或者“饥荒”。别说人类社会，动物界不也存在大迁徙嘛。此地过不下去，那就迁徙到能过下去的地方。所以说，在一个人口流动没有受限制的区域，人口指标，可以看作当地经济发展指标。\n东北作为大清国的龙兴之地，一直处于特别保护的状态，几百年的户籍限制让东北地广人稀。后来大清国亡了，人口开始向东北聚集，除了资源性原因，那就是经济制度的因素了。话说当年国共伪满三国鼎立，自打东北被小日本子占领之后，经济就开始迅猛发展。为毛会这样呢？因为归属权不一样了。以前属于我大中华，对小日本子来说那就是外财，外财只能抢和祸害，不会考虑持久发展的问题；一旦归属权变成日本（当时被国际社会23个国家认可），自家东西当然态度立马180度大转弯，再加上小日本子在搞经济建设这方面的确有经验和积累，东北被这么一折腾，成为当时亚洲乃至世界经济成长最快的国家之一。1945年时，满洲国其工业规模超越日本跃居亚洲第一。（这个结论可不敢妄传，具体来源请查阅文献：东北1945年工业规模亚洲第一. 深圳新闻网. 2009-07-01 [2011-07-28] （中文（简体）‎）\n抛却政治观念，你懂的，老百姓那是要肚皮不要脸皮的。哪富裕往哪钻，于是东北人口开始暴增，具体数据不说了，有兴趣的自己查。对于这些研究结果，很多人从情理上是不愿意相信的，于是就开始质疑这些研究是不是别有用心，是不是有小日本的资助以便为他们侵略中国洗地？\n这些阴毛论我就不瞎掺和了，咱只用逻辑去推理。再问诸君一个问题，解放战争初期，国共两党为何胶着于东北？\n先看看我党1945年制定的战略部署：“向北发展，向南防御”，提出“只要我能控制东北及热、察两省，并有全国各解放区及全国人民配合斗争，即能保障中国人民的胜利。”\n这是什么意思？为什么不去占蒙古？为什么不去占西北？为什么拼了老命抢夺东北？\n值得拼命去抢的东西，一定有值得其舍命的价值。正因为东北的经济实力太强悍了，高富帅一枚，才惹得一帮娘们为他争风吃醋，乃至大打出手。\n后面的事情我就不说了，懂的人自然会自己去了解。近日看这么多人不停黑我大东北，又是人懒又是民风不正的各种花花活层出不穷，着实让人愤慨。再漂亮的潘金莲，跟了武大郎也只能灰头土脸在家里挨揍。再英俊的高富帅，找个白骨精也能让你精尽人亡。\n你看哪家老娘们把自家老公搞残废了会对外宣称是自己如狼似虎的？能说出口的，也无外乎这男人啊，体质不好，肾虚，需要六味地黄丸，他好我也好。你看，这就是逻辑嘛，不洞悉人心，你哪知道这内里的花花肠子。要说这朝鲜和东北啊，还真是难兄难弟，难怪挨一块儿了。\n"
		},
		{
			"post_id": 26,
			"title": "继续谈谈管理之帝道王道和霸道 ",
			"date_published": 1466381065.352,
			"body": "因为是我干这个的，要是在这方面连个牛逼也吹不出来，装逼的时候人家就不能给你打满分。所以呢，没事的时候还得瞎琢磨琢磨。\n那么管理是什么呢？\n管理就是个笑话。\n有人一听，靠，这逼装大了。您还别说，这就是大境界下的结论。怎么理解这个问题呢？想想假如你是个村长，把自己村子搞得红红火火，然后你见到习总说我这套治理村子的管理制度，那牛逼得……此处略去一万字，然后习总会怎么说，习总至少在心里说，你丫就是个逗逼。\n所以任何偏安一隅的管理手段，放在宏观大背景下，都是一个笑话。比如那个美国总统候选人唐老鸭川普，自信到爆棚，为毛自信呢？因为有百亿身家啊。任何人胆敢质疑他的能力，他一句话就把对方噎的哑口无言:“老子有钱。老子管理这么大一个商业帝国，这不是能力的明证吗？”对于普通人来说，这无可辩驳，因为商业帝国对于普通人来说就是大背景和大环境，但对于美国总统来说，一个百亿的商业帝国能说明什么问题呢？在整个美国的大背景下，你唐老鸭川普的那些言论就是他么的逗逼啊。\n但大小都是相对的。有大背景，还有更大的背景。美国是个大背景，放在人类社会里就是个缩影；人类社会背景够大了，放到整个地球的生态圈里就是个缩影。所以人类社会折腾的那些管理手段，和大自然的“天道”、“规律”相比，就是个笑话。\n但讲笑话是人类文明的重要标识之一。所以呢，咱先把大背景放一放，咱就在这个小圈子里讲讲咱那些俏皮话。为了避免敏感性，圈子也不能太小，时间也不能太近，咱把时空的轴线往远里拉一拉，比如拉到大秦帝国。\n请问大秦帝国为毛能统一六国呢？学过历史的不加思考，秦国的强大不就是源自商鞅变法吗。Bingo，商鞅变法是一个重要的转折点，那么请问，商鞅变法的目的何在?有人说妈蛋你这不又把圈子兜回来了吗？商鞅变法的目的不就是统一六国吗？\n这么回答的肯定是大学生。历史是肤浅的，教科书里的历史就更肤浅了，而且还是有意识的肤浅。\n在回答这个问题之前，咱们先看看商鞅是怎么见到秦孝公搏上位的。据说商鞅从魏国跑到秦国，先是买通了孝公身边的一个近臣叫景监的，通过景监，把自己兜售给秦孝公。第一次见面，商鞅讲的是帝策。何谓帝策？咱们华夏文明肇始于三皇五帝，黄帝、颛顼、帝喾、尧、舜合称五帝，五帝那个时代，人类还处于部落阶段，也就是说刚从猴子里面剥离出来，能独自对抗大自然了。那个时候科学技术还不够发达，可能农业技术都不过关，所以人民的愿景不过是能抵御天灾，大家伙吃饱饭其乐融融也就够了。对抗天灾的唯一可能性，就是通力合作，任何一个人，别管多牛，都不可能一个人在大自然的残酷迫害下自得其乐，所以呢，最重要的是合作，不存在严重的阶级划分问题，因为没有余粮嘛。所谓的统治者，比如五帝，也不过是大家觉得这个人靠谱，推举他作为协调众人通力合作的首领。这个首领是为大家伙服务的。所以人类社会最初，在资源不多的前提下，其实实行的是民主制度。那个时候所有的政策制度，都得大家伙满意认可，所以才有顺民心，得民意的说法。商鞅呢，给孝公讲的就是这么一套理论，然后孝公就听得睡着了。\n商鞅一看孝公不感兴趣，就央求景监再给他一次机会，于是第二次见面，商鞅开始侃王策。啥是王策？自从大禹的儿子夏启开始，民主没了，首领开始世袭，首领称王，实行分封制度，自家亲戚各人分封一块土地，这块土地的首领依据土地大小分成公侯伯子男，名字不一样，本质都一样，其实都是独立小王国，自己有自己的军队，自己有自己的官府，自己有自己的一套管理制度，总之，只要你年年朝贡，你在自己土地上爱怎么折腾就怎么折腾，中央不管。这个时候，阶级划分已经非常明确了，你是王的亲戚，你就是诸侯，你是人民，你就一辈子当奴隶。人民的愿景已经不重要了，因为那个时候的人民很愚昧，相信君权神授那一套理论，承认自己就是个需要神来眷顾的贱人，王以及诸侯和大夫都是神委派的牧羊犬，这个牧羊犬再坑爹，也不敢怎么样，因为后台是神啊，得罪不起。所以那个时候基本没有什么奴隶造反，因为大家都认命。尽管人民的愿景已经不重要了，但诸侯和大夫们的愿景很重要，因为这帮人有钱有闲，读书又多，和王走得近，彼此了解底细，不好忽悠，所以王策，就是作为一个王，怎么管好自己分封的各路诸侯的管理手段。这次孝公没睡着，但是发火了，把景监一顿臭骂，害的景监回去就把商鞅痛骂了一顿出气。\n正如所有的成功者所具备的基本素质一样，商鞅不但没气馁，反而信誓旦旦，言之凿凿的说他终于明白孝公喜欢什么了。要求景监再推荐一次。景监半信半疑，所谓拿人手短，只好又推荐了一次。这次商鞅摇唇鼓舌，大谈霸道。这次孝公来精神了，把商鞅引为知己，两个人对着吹牛逼吹了三天三夜，然后就定下了变法的事宜。\n于是问题来了，何谓霸道?周朝自从平王东迁，周王无论从军事实力、王国财力，还是从个人威信都跌到了谷底，各路诸侯都发现周王其实已经没什么能力管的住他们了，于是各玩各的，都想自己独霸一方，威慑诸侯。这个时期历史上叫春秋，春秋诞生了五位霸主，都打着尊王攘夷的幌子再凭借自身实力压制各路诸侯，乘机给自己捞好处。就和现在的美国差不多，看到中东石油资源不错，就以人权或者维护世界和平的名义，联合各个国家去攻打中东，然后宣称为了不让这些石油资源继续为害人间，他们就勉为其难都运到自己国家去。春秋五霸基本上就干这些事。商鞅所讲霸道，就是以侯王个人愿景为出发点，如何实行一系列管理手段，集中一切力量与资源，实现侯王个人愿景。\n所以帝道，王道，霸道，其根本区别在于愿景不同，也就是说，这些管理手段所要达到的目的是不一样的。帝道，是为了让全体人民满意；王道，是为了让自己的小弟们满意；霸道，是为了让侯王自己一个人满意。所以孝公听帝道和王道都不感兴趣，一听霸道，深得朕心！\n所以说，离开了目的，单独谈管理手段，就是一个笑话。帝道牛不牛？牛，但是只是老百姓这么认为，对帝王和大臣们来说就是个笑话；王道牛不牛？牛，但是只有各路官僚这么认为，对老百姓和中央的帝王来说就是个笑话；霸道牛不牛？牛，但只有中央的帝王这么认为，对老百姓和大臣们来说就是个笑话。\n所以商鞅变法，核心目的只有一个，就是让孝公一个人满意。孝公想称霸诸侯，就得打仗，想打仗，就得动员老百姓参军。兵马未动，粮草先行，每一场仗打得不是力气，而是资源，没钱没粮，打仗就是个笑话。所以为了达成孝公个人这一愿景，必须让老百姓愿参军，爱种地。\n于是问题又来了，从老百姓个人角度，谁没事愿意上战场当炮灰啊？谁愿意一辈子面朝黄土背朝天啊？不愿意是吗？上手段。一系列的手段都指向一个目的，让老百姓除了种地打仗，别无选择。\n具体的手段就不赘述了，有兴趣的可以自行查阅。总之呢，这些手段只为了达到两个统一，一个是思想统一，另一个就是资源统一。统一到哪里去呢？当然是孝公那里去。所有人只能有一种思想，就是孝公的思想；所有人只能从一个地方取得资源，就是孝公那里的资源。孝公代表的就是国，老百姓就是民，商鞅把民当成国的敌人，想要强国，必须弱民。\n效果怎么样？历史证明，那效果是杠杠的。因为自从商鞅开始，这套办法就一直绵延了两千多年，都没变过。乃至于今天的朝鲜，还在继续延续这一套管理手段。\n然后有人又问了，真那么好用，朝鲜怎么那么积贫积弱？\n所以你就又图样图森破了不是，你只关注这些手段，你没注意时代的背景啊。时代变了，背景变了，曾经管用的现在就不管用了。古达打仗靠人堆，现在能靠人吗？古代富有靠种地，现在能靠种地吗？你看现在哪个发达国家是靠农业的？现在这个时代拼的是智力资源，你种一年地，赶不上人家卖几部苹果手机，你拼上百万人的军队，抵不过人家一颗原子弹。\n而商鞅这套手段，最致命的弱点在哪里？就在于弱民。民弱了，都成为傻逼，是挺好使唤的，但这些傻逼也开发不出来苹果手机和原子弹啊。想开发这些高科技产品，就得先开发民智，民智一开，就成了强民，强民是“国”之大敌，所以在新时代背景下，这个国，不能再是孝公一个人的了，而要改变体制，让他变成所有至少是大部分国民的。所以像朝鲜的金家王朝体制，注定是要被历史所淘汰的。民主是社会发展之必然，历史兜了一个大圈，我们注定要重返原点。\n林林总总吹了这么多，其实讲的还是一个总体趋势。有关商鞅的法制思想，其实有很多细节还具有相当的参考价值。商鞅不仅仅是一位政治家，他还是一位社会心理学大师，他对人性和人心的理解与把握，只能用两个字概括:至深！有关这方面的内容，等再有兴趣的时候接着吹吧。\n"
		},
		{
			"post_id": 25,
			"title": "Guide to Setting up OpenBazaar Server on a VPS",
			"date_published": 1466253862.184,
			"body": "Virtual Private Server (VPS)\n\nIf you want to start selling, you can also download the installer, but you'll have to have your desktop/laptop running OpenBazaar 24/7 to make your listings available. If you want to run OpenBazaar 24/7, then you should probably install OpenBazaar on a virtual private server or VPS.\n\nWhile this sounds complicated, we've tried to it as easy for you as possible. This article contains a number of different ways to you can get started with OpenBazaar by manually installing it on a VPS.\n\nYou should know...\n\nOpenBazaar the application is actually a combination of two components: the client and server. The client is what you will interface with, and the server is the networking & database backend. Please don't be confused by the terminology 'server', it just means this is the part of the OpenBazaar application that communicates with the rest of the network.\n\n2.1 Amazon Web Services (AWS)\n\nOne of our community members has made a step-by-step guide to install your OpenBazaar server component on an Amazon AWS instance.\n\nWhat's great about this approach is that Amazon lets you use their smallest VPS for free for 1 year! What's even better is that OpenBazaar runs on this just fine.\n\nhttps://www.youtube.com/watch?v=r0ghe76sRIU\n2.2 Vultr\n\nAnother one of our community members has created a video tutorial for setting up OpenBazaar on the Vultr VPS service (they accept Bitcoin too).\n\nhttps://www.youtube.com/watch?v=GIL0-R1PRsQ \n2.3 Digital Ocean\n\nDigital Ocean has some great options and is an easy, user-friendly platform to create and install OpenBazaar. Unlike AWS, their service isn't free, but their smallest plan costs $5/month.\n\nThe guide below also doubles as a way to install OpenBazaar from source in Ubuntu 15.10.\n\nSTEP 1: SIGN UP FOR A DIGITAL OCEAN ACCOUNT AND CREATE A DROPLET\n\nVisit the Digital Ocean website and sign up. You can then choose to create a droplet (their term for a VPS).\nChoose Ubuntu 15.10 x64 with a $5/month plan. It should look like this:\n\nChoose the datacenter region of your preference (choose something close to your location if you want to optimize for speed). You don't need to choose any additional options.\nYou can add a SSH key if you like. This makes logging into your VPS easier and more secure in the future. If you don't add a SSH key, it will login with a password instead. If you don't know what an SSH key or how to use one, ignore this.\nYou can now choose any hostname (e.g. myshop) you like and hit \"Create.\"\nSTEP TWO: USE SSH TO COMMUNICATE WITH YOUR NEW VPS\n\nOnce the droplet is created you will receive an email which gives you three important things:\nThe IP Address of your VPS\nYour username (default is root)\nYour password\nNow you need to log in and communicate with your VPS. This is done using a protocol called SSH.\nFor Linux and OS X users SSH is supported in terminal itself. Windows users will need to install a new program called Putty.\n \n\nSSH with Linux and OS X\n\nOpen your terminal. Use Ctrl+Alt+T for Linux users and use Spolight search for \"terminal\" in OS X.\nNow you enter a command to connect to your VPS (note that throughout this guide when you see [ ] brackets you don't type those in):\nssh root@[VPS-IP-Address]\n[Note that later you will not use root to login, but another username.]\nAfter the @ symbol you put in the IP address you received in that email.\nSince this is the first time you've connected to this address, you'll receive a warning:\nThe authenticity of host '[IP address]' can't be established. Are you sure you want to continue connecting (yes/no)?\nEnsure you've got the right IP, then type 'yes'.\nIt will now prompt you for a password; enter the password from the email. If successful, it will now ask you to create a new password.\nYou'll need to re-enter the original password, then enter a new one twice.\nMake sure you use a strong password! Anyone else could take over your OpenBazaar server if they guessed your password and gained access to your VPS.\nYou're now connected to your VPS and can control it through this terminal.\n \n\nSSH with Windows\n\nThere are multiple SSH clients you can use with Windows. One open-source program with a good reputation is called Putty. You can find adownload here.\nTo make a SSH connection, put the IP address you received in the email into the \"Host name (or IP address)\" field and leave it on port 22.\nA window will pop up asking you \"login as:\" and you type 'root'. [Note that later you will not use root to login, but another username.] Then put in the password you received in the email.\nIf successful, it will now ask you to create a new password.\nYou'll need to re-enter the original password, then enter a new one twice.\nMake sure you use a strong password! Anyone else could take over your OpenBazaar server if they guessed your password and gained access to your VPS.\nYou're now connected to your VPS and can control it through this terminal.\n \n\nSTEP THREE: CREATE A NEW USER TO AVOID USING 'ROOT'\n\nNow you're logged into your VPS via SSH and are at 'root.' Root access means you can make any changes you want to the computer. That sounds like a good thing, but it's actually a bad idea to use root to run your OpenBazaar server.\nIf something goes wrong you could accidentally mess the VPS up and your server with it. It's much better to create another user within your VPS and use that account to run the server.\nType the following command into the terminal, replacing 'username' with an easy to remember name of your choice:\nadduser [username]\nIt will ask you for new passwords (you can use the same password as root if you like, just make sure they're strong) and also ask for more information about the user (you can just hit enter to skip).\nOnce that's complete, you need to give the new user the ability to use sudo, which is a command that allows you to make changes to your installation. To do this, type in:\nvisudo\nYou will now see text in the terminal which you can edit. Scroll down with the down arrow until you see a line that reads:\nroot ALL=(ALL:ALL) ALL\nDirectly underneath that line add a new line that starts with the new username you created and replicates the rest of the 'root' line above:\n[newusername] ALL=(ALL:ALL) ALL\nNow save your changes by hitting Ctrl+X, confirm by typing Y (or yes) and then hit enter.\nYou can now exit this SSH session in order to log into your new username. For Linux/OS X this means you use the following command:\nssh [newusername]@[VPS-IP-Address]\nFor Windows, when you receive the \"login as:\" prompt you put in the new username instead of root.\n \n\nSTEP FOUR: INSTALL OPENBAZAAR SERVER\n\nLog into your VPS under your new username. You're now ready to install the OpenBazaar server.\nTo make the installation process as easy as possible, we've created some installation scripts for you to use:\n \n\nCreate the Installation Script\n\nInstall nano, a terminal-based text editor:\nsudo apt-get install nano\nSelect the directory you want to create the installation script. If you have freshly logged into your VPS, you're probably in the /home/[username]/, which is fine. Now we'll create the installation script:\nsudo nano install.sh\nThis will open nano, where you'll paste in the following installation script. Copy the script below and paste it in (use Shift+Insert to paste):\n#!/bin/bash\n\nsudo apt-get update && sudo apt-get upgrade\nsudo apt-get install git\nsudo apt-get install build-essential libssl-dev libffi-dev python-dev openssl python-pip libzmq3-dev\nsudo echo \"deb http://us.archive.ubuntu.com/ubuntu vivid main universe\" | sudo tee -a /etc/apt/sources.list\nsudo apt-get update\nsudo apt-get -f install\nsudo apt-get install libsodium-dev\nsudo pip install cryptography\nsudo apt-get install autoconf pkg-config libtool\n(cd /$HOME/; sudo git clone https://github.com/zeromq/libzmq)\n(cd /$HOME/libzmq; sudo ./autogen.sh && sudo ./configure && sudo make -j 4)\n(cd /$HOME/libzmq; sudo make check && sudo make install && sudo ldconfig)\n(cd /$HOME/; sudo git clone https://github.com/OpenBazaar/OpenBazaar-Server.git)\n(cd /$HOME/OpenBazaar-Server; sudo pip install -r requirements.txt)\nIt should look something like this:\n\nSave (Ctrl+O) and exit (Ctrl+X).\nGive the script executable permissions: sudo chmod +x install.sh\n \n\nInstall OpenBazaar\n\nRun the installation script you just created (you'll have to press y in a couple of places):\nsudo bash install.sh\n \n\nSetup OpenBazaar\n\nThe script will have created an OpenBazaar-Server folder. Navigate to this folder by typing: cd /home/[username]/OpenBazaar-Server\nTo access your OpenBazaar node remotely, you'll need to change the default username and password. To do this, type:\nsudo nano ob.cfg\nNow you need to use the down arrow on your keyboard to move down until you see a section that shows a username and password, as shown below:\n\nNote that both username and password have #'s at the beginning; those must be removed.\nAfter removing the #'s before USERNAME and PASSWORD enter in your own username and password as shown below.\n\nSave (Ctrl+O) and exit (Ctrl+X).\nYour OpenBazaar node is now setup and ready to run!\n \n\nSTEP 5: SETUP SSL\n\nSSL makes the connection from the remote server to your client computer more secure. It's not necessary to enable in order to connect to your server, but it is highly recommended because it's insecure otherwise.\nThis guide explains how to set up SSL with your remote server.\n \n\nSTEP SIX: START THE SERVER\n\nTo run your OpenBazaar node, make sure you're in/home/[username]/OpenBazaar-Server/, and then type in:\nsudo python openbazaard.py start -da 0.0.0.0\nThis command (-d) runs OpenBazaar as a background process that keeps running after you logout of your VPS (no need to use cron or anything else to keep it alive).\nYou won't see any terminal output other than OpenBazaar is starting.\nOpenBazaar will also be remotely accessible from any IP address (-a 0.0.0.0), which takes into account that your IP address may change all the time (especially if you're using a laptop).\nPlease note that no one can access your node without the username and password you created in Step 4.\nYou can now exit your VPS, as your OpenBazaar node is now running and connected to the network.\nPlease note that the first time your run the node, it may take a few minutes to generate your unique OpenBazaar crytographic identity.\nIf you need to top the server, type:\nsudo python openbazaard.py stop\nAfter you stop the server, you can update it to the latest code by typing:\nsudo git pull\n \n\n3.0 Connect to your OpenBazaar VPS Node\n\nThere are 2 ways to connect to your OpenBazaar VPS node:\nDownload the installer and setup the connection to your VPS node\nInstall the client from source\nIf you use the installer, you can easily setup a new connection to your VPS node.\nFirst you'll have to setup a local node and go through on-boarding, which you can use to make purchases for example.\nOnce you have setup your local node, select the Menu button and 'default':\nhttps://i.imgur.com/l4CPnTE.png\nNext, select 'New Server'.\nhttps://i.imgur.com/5vHZVf3.png\nAdd in the following data:\nName. What you want to call this configuration.\nServer IP. The IP address of the VPS hosting your OpenBazaar node.\nUsername. The username you set in the ob.cfg file in section 2.3\nPassword. The password you set in the ob.cfg file in section 2.3\nPress the SSL button if you have enabled SSL for your node.\nClick 'Save Changes' and you should automatically connect to your OpenBazzar VPS node.\nIf you want to install the OpenBazaar client from source, the next section will guide you how to set that up for your operating system.\n \n\n4.0 Install From Source\n\nSome of you may want to run OpenBazaar using the latest code, which means installing from the source code. This is much trickier to do and only recommend it if you know what you're doing. Since the VPS instructions are installing from source on Linux, below are instructions for installing on Windows and Mac OSX.\n\n \n\n4.1 Windows\n\nYou will need some basic knowledge of the command line to do this. You can easily access the terminal/command line from Windows Explorer within a desired location of interest if you type in cmd in the address bar.\n\n \n\nI am also going to assume you have installed git, python 2.7 and pip into your computer and added them to your $PATH.\n\n \n\nINSTALL DEPENDENCIES FOR THE OPENBAZAAR SERVER\n\nInstall setuptools\nDownload the ez_setup.py file fromhttps://pypi.python.org/pypi/setuptools\nDoesn't matter where you download it to, but open the terminal and install it: python ez_setup.py\nInstall Microsoft C++ compiler for Python 2.7\nDownload and install from https://www.microsoft.com/en-au/download/details.aspx?id=44266\nInstall miniupnpc\nDownload the file fromhttps://openbazaar.org/downloads/miniupnpc-1.9-cp27-none-win_amd64.whl\nOpen the terminal and install: pip install miniupnpc-1.9-cp27-none-win_amd64.whl\nInstall pynacl\nDownload the file from https://openbazaar.org/downloads/PyNaCl-0.3.0-cp27-none-win_amd64.whl\nOpen the terminal and install: pip install PyNaCl-0.3.0-cp27-none-win_amd64.whl\nInstall OpenSSL for Windows\nDownload and install fromhttps://slproweb.com/download/Win64OpenSSL-1_0_2g.exe\n \n\nINSTALL DEPENDENCIES FOR THE OPENBAZAAR CLIENT\n\nInstall NodeJS\nDownload and install from https://nodejs.org/en/\n \n\n4.2 OSX\n\nINSTALL DEPENDENCIES FOR THE OPENBAZAAR SERVER\n\nInstall Xcode command line tools\nOpen the terminal and type: xcode-select --install\nInstall homebrew\nruby -e \"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)\"\nbrew update\nbrew doctor\nInstall git, libffi, openssl, and python\nbrew install git\nbrew install openssl\nbrew install libffi\nbrew install python\nInstall cryptography library (El Capitan)\nsudo env LDFLAGS=\"-L$(brew --prefix openssl)/lib\" CFLAGS=\"-I$(brew --prefix openssl)/include\" pip install cryptography\n \n\nINSTALL DEPENDENCIES FOR THE OPENBAZAAR CLIENT\n\nInstall Node\nbrew install node\nInstall npm\nbrew install npm\n \n\n4.3 Linux\n\nThe instructions for installing OpenBazaar-Server in Linux are identical to setting a node up on a VPS. However, there are unique installation scripts depending on the version of Ubuntu or Debian that you are running, which you can find here.\n\n \n\nINSTALL DEPENDENCIES FOR THE OPENBAZAAR CLIENT\n\nInstall npm\nsudo apt-get install npm\nInstall NodeJS\ncurl -sL https://deb.nodesource.com/setup_0.12 | sudo bash -\nsudo apt-get install -y nodejs\nIf you have problems install NodeJS in Linux, follow these instructions\nInstall Electron-prebuilt\nnpm install electron-prebuilt\nClone the client repository into a directory of your choice\ngit clonehttps://github.com/OpenBazaar/OpenBazaar-Client.git\nNavigate into the new folder you just created\ncd OpenBazaar-Client\nInstall the client\nnpm install\nRun the client\nnpm start\n \n\n4.4 Install the OpenBazaar Server (all OS's)\n\nInstall OpenBazaar server repository somewhere on your computer\nNote: if you ran the script above, you do not need to do this step.\ngit clone https://github.com/OpenBazaar/OpenBazaar-Server.git\nNavigate to the newly created OpenBazaar-Server folder\ncd OpenBazaar-Server\nInstall other dependencies\npip install -r requirements.txt\nLookout for potential errors; if there are, go to our #installation-issues channel on the OpenBazaar Slack so we can help you\nRerun this command if you had to fix any bugs\nSetup authentication\nOpen the ob.cfg file in the OpenBazaar-Server folder\nIf you only have a terminal if you're using Linux, you can open it using nano (if you don't have it, sudo apt-get install nano)\nnano ob.cfg\nScroll down until you find these lines:\n#USERNAME = username\n#PASSWORD = password\nRemove the # in front of USERNAME and PASSWORD\nChange the username and password to whatever you want, for example:\nUSERNAME = drwasho\nPASSWORD = password\nRun the server\npython openbazaard.py start\nOther flags you may want to use:\n-d (daemon) runs the server as a background process\n-a allows you to permit a specific IP address to make RESTandWebsocket API calls\nIf you want to make your server accessible from anywhere, set the ip address to 0.0.0.0\nThe server can only be accessed with the proper authentication settings, which you should have set in Step 5!\nExample of how I run my node: python openbazaard.py start -da 0.0.0.0\nIf you want to stop the server, you need to open a second terminal at the server's location (if the server isn't running in the background) and type: python openbazaard.py stop\nThis shuts down the server properly and you won't get any weird connectivity issues if you try to start the server again immediately\nYou can also restart the server with: python openbazaard.py restart\n \n\n4.4 Install the OpenBazaar Client (all OS's)\n\nClone the client repository into a directory of your choice\ngit clonehttps://github.com/OpenBazaar/OpenBazaar-Client.git\nNavigate into the new folder you just created\ncd OpenBazaar-Client\nInstall the client\nnpm install\nRun the client\nnpm start\nThe OpenBazaar server must be running for the Client to work properly. It will start by searching for the server running onlocalhost.\nIf it fails to connect, a modal will pop-up allowing you to change the location of the server (if not localhost), ports (you shouldn't have to change these), and the username & password.\nMake sure that the username and password match what you entered in ob.cfg\nIf you are running the server for the first time, it may take a minute or so to connect as the server is generating a GUID (OpenBazaar address). Be patient!\n \n\n4.5 Updating the Server and Client Components\n\nMake sure the server or client are shutdown\nOpen the terminal and type git pull in the OpenBazaar-ServerorOpenBazaar-Client folders\nCheck for regular updates on a daily basis\n \n\n4.6 Setup SSL\n\nInstructions can be found here: https://slack-files.com/T02FPGBKB-F0XK9ND2Q-fc5e6500a3.\nWarning: without an SSL connection to your remote node, you are vulnerable to MITM attacks and your authentication details are unencrypted. Do not run a remote node without SSL enabled!\n \n\nConnection problems\n\nIf you're having trouble connecting to other stores, or other users say they cannot connect to your store, then try opening ports to ensure a better connection. The following ports should be opened:\n\n\n\n \n\nHappy Bazaaring!\n原文链接：https://openbazaar.zendesk.com/hc/en-us/articles/207852873-Guide-to-Setting-up-OpenBazaar-Server-on-a-VPS"
		},
		{
			"post_id": 24,
			"title": "抗生素的前世今生",
			"date_published": 1466126363.424,
			"body": "很多人都知道抗生素，但仅仅知道个名而已。所以科普工作任重而道远啊，它可以打破行业壁垒，让知识跨行业无界交流，让每个人都有希望形成一种整体全局意识。就目前我所知，最牛逼的科普工作应该是微软的windows操作系统，没有这套系统，电脑就不可能走进千家万户。\n那么啥是抗生素呢？为了让外行轻松上手，你可以把这个东西理解为一种武器，一种化学武器，一种在微生物和动植物界当中广泛使用的化学武器。\n其实呢，在微观领域，微生物们也和人类一样有组织有社会，任我行不是说有人的地方就有江湖吗？其实这句话可以扩展一下，有生物的地方就有江湖。在这个江湖里为了抢食物抢女人抢地盘，各方势力就得大动干戈。刚开始大家拼体力，后来拼片刀，然后拼枪炮，到现在就开始拼核武器、气象武器、生化武器等等不一而足。总之，抢地盘的游戏是促进科技发展的重要动力之一。我们人类只以为自己才有高科技武器，这明显是无知自恋狂的表现。\n其实生化武器在自然界早就普及。比如我们常吃的大蒜，为什么有那么一股子难闻的气味？其实那就是它的生化武器，也是一种抗生素，有细菌真菌想把大蒜当成食物，它们进攻的时候都是团体作战，靠着非凡的生育能力，它们动则调动上亿规模的军队大举进攻，跟如此众多的军队作战，靠单兵肯定是不行的了，于是只好上大规模杀伤性武器，于是大蒜就分泌这种抗生素，轻松就能灭掉几亿的入侵者。\n由于科学无国界，这种超震撼的大规模杀伤性武器不可能被大蒜所独有，微生物也开始自行研发自主知识产权的大规模杀伤性生化武器。其实微生物之间也不是铁板一块，它们还处于部落时代，一个部落就是一个种族，在我们这个地球上究竟有多少种这样的部落，只有天晓得。反正目前已经被人类发现的部落就有几百万个。这些部落有时候会协同作战，去攻打动植物，但大部分时候，其实是处于完全的内战当中，都是你想灭了我，我想灭了你，整个就是一个中世界之前的日本国啊。每个部落都拥有自主知识产权的生化武器，一旦施展，那就杀得尸横遍野，血流漂杵。唯一的问题就在于，每个部落的生化武器只能针对个别部落有效果，而不是对所有部落都有效果，这个很好理解，要是哪个部落拥有可以消灭其他所有部落的生化武器，那么地球上就不会有几百万种微生物，而是仅存一种微生物。就像春秋战国，大大小小几百个国家，车不同轨，书不同文，我大秦帝国一出，立马全国山河一片黑，多样性立马就变成唯一性了。\n于是我们就可以明白，有多少种拥有自主知识产权生化武器的微生物部落，就有多少种抗生素。我们人类目前已发现上万种抗生素，每种抗生素都有独特的针对性，针对不同的微生物具有杀灭效果。我们知道，人类受伤，比如用刀割个口子，甚至砍掉一只胳膊一条腿，其实都不会导致死亡，关键问题是，有了伤口，就给了各种微生物大规模入侵的机会。成千上万的微生物在人类受伤或者生病的时候大举进攻，正是乘你病要你命。这个时候要是不用有针对性的抗生素，基本上就是死路一条。所以抗生素的发明，挽救了无数人的生命，尤其是在人类社会最混乱的时期，比如二战，缺胳膊少腿的人太多，有了抗生素，这些人就可以苟延残喘了。也正因为如此，抗生素才被列为二十世纪最伟大的发明。\n不过正所谓有无相生，难易相成，长短相形，高下相倾，音声相和，前后相随。能救人的东西，反过来就能害人。这是为什么捏？还得从微生物部落之间此消彼长的对抗说起。\n话说一种微生物用生化武器去消灭另外一个微生物部落，那个被消灭的部落为了图存，就开始卧薪尝胆，隐忍待发，从废墟之上展望新生。我们知道，一个微生物部落人口众多，用亿计都计不过来，因此，如此众多的人口，被一次性大规模灭绝时，必然有那么几个身体素质好的，在这次灭绝当中幸存下来，这些幸存者为什么能幸存呢？因为它们本身具有抵抗这种生化武器的基因，在遭受种族灭绝之前，它们在体制内被自家同胞压迫的默默无闻，一旦整个体制遭受重大创伤，体制内的压迫不复存在，自身优势得以彰显，于是他们就会在废墟之上重建家园，并且诞生一个全新的部落，这个部落就是复仇天使，因为这个新的部落不再害怕以前灭绝过他们的生化武器，当它们再次和敌人交锋的时候，就会占据上峰，取得压倒性优势。\n然后问题来了，尽管这是微生物部落之间的基督山伯爵故事，但是却会影响到人类社会的安危。因为人类就是利用微生物的生化武器去控制微生物对自身的伤害，本来这种武器是好用的，如今人家改朝换代甚至种族都换了，原来的武器不好使了，那么这个新的微生物种族侵染人类的时候，人类就束手无策了。\n我们知道，任何社会，这种大规模灭绝事件都是非常罕见的，这样可以使变异被控制在一个非常和缓的进程当中。但人类对抗生素大规模的使用，造成了这种大规模灭族事件频繁上演，这就等于给微生物提供了无数进化重演，变身复仇天使的机会。有人问，人类怎么大规模使用抗生素了？不就是医院给病人用一用吗？\n所以你看无知是多么可怕。如果抗生素仅仅被用来治病，那也谈不上大规模，但如果用来谋取利益，那就泛滥成灾了。你想想，人类得病受伤时因为微生物感染致死，那么动物呢？植物呢？都一个道理。所以人类养殖动植物谋取市场利益的时候，为了不让动植物得病，最简单的办法，就是把动植物生长环境里的微生物都干掉。\n于是乎，养猪的不停的给猪用抗生素，养鸡的不停给鸡用抗生素，养鱼的不停给鱼用抗生素……刚开始真管用啊，微生物都被大规模灭绝了，自然没有东西去感染养殖产品，所以被养殖的鸡鸭什么的都幸福快乐的成长，一只鸡从破壳到上餐桌只需要四十天，这里面有三分之二的功劳是抗生素的。\n然后问题又来了，老板们美滋滋数钱的时候，没人关注那些抗生素到底流向哪里？抗生素被施用之后，不是简单的局限于养殖场或者农场里，而是通过粪便、垃圾、水流甚至风力迅速散播到自然界，于是产生了一个更大范围的筛选场地，不适应的微生物都被灭绝掉了，适应的都存活下来了，存活下来的微生物具有了耐药性，当它们大举反扑的时候，人类就毫无招架之力了。\n那么抗生素的使用究竟有多大规模呢?我们来看一组数据：我国年产抗生素原料大约21万吨，出口3万吨，其余自用（包括医疗与农业使用)，人均年消费量138克左右(美国仅13克)。\n有人说，这么大的量啊，都使用了到底带来你所说的那些后果没有啊？我怎么觉得自己活的挺滋润，没啥子事情呢？我们再来看一组数据：\n据2006~2007年度卫生部全国细菌耐药监测结果显示，全国医院抗菌药物年使用率高达74%。在美英等发达国家，医院的抗生素使用率仅为22%~25%。另据1995~2007年疾病分类调查，中国感染性疾病占全部疾病总发病数的49%，其中细菌感染性占全部疾病的18%~21%，也就是说80%以上属于滥用抗生素，每年有8万人因此死亡。这些数字使中国成为世界上滥用抗生素问题最严重的国家。\n注意，这个统计数据仅仅停留于2007年。\n然后我们再来关注一个雪上加霜的消息：中国正在考虑批准转基因水稻的商业化生产。\n我对转基因没有任何敌意和畏惧，因为我从事过这个专业。也正因为我从事过这个行业，所以知道有一种基因叫抗生素抗性基因。这个很好理解，我们前面说过那些在大规模灭绝事件中幸存下来的微生物，就是因为自身含有某种抗生素的抗性基因才得以侥幸存活。那么科学家就把这种基因片段提取出来，让后和其他目的基因（比如抗旱的基因）整合到一起，然后再通过某种技术手段把这些基因转入到植物（比如水稻）体内。于是被转化后的水稻就具有了抗旱的特性。\n等等，这里有一个细节是专家不愿意提及的。抗旱是抗旱基因的特性，但是还有一个基因和抗旱基因整合到一起的，那就是抗生素抗性基因，假设是头孢霉素的抗性基因，那么这种水稻就具有了对头孢霉素免疫的特性。\n有人说，那干嘛要把抗头孢霉素的基因和抗旱基因连接到一起啊，我们只转化抗旱基因不就完了。\n所以说你外行了不是。转化也是一个大规模筛选的过程，因为转基因是在细胞水平上进行的，我们不敢保证一个细胞一下子就能转进去，所以其实我们是同时对几亿个细胞进行转化，那么问题就来了，我们如何知道哪个细胞是转化成功的？这时候就需要抗生素抗性基因起作用了。我们把转化后的所有细胞都放在含有抗生素的培养基上，凡是能活下来的，我们就知道它是基因转化成功的植株。所以呢，抗生素抗性基因在植物转基因过程当中被当成了筛选标记，无论你想转什么基因，都得把这个筛选标记带上。\n这时候有专家跳出来说，一看你就不能与时俱进，用抗生素做筛选标记早就是陈芝麻烂谷子的事儿了，我们现在还可以用绿色荧光蛋白基因，并且新的筛选标记基因也在不断的探索更新中。\n这位专家说的没错，绿色荧光蛋白基因也可以作为筛选标记，转化成功后用紫外灯一照，通体都冒绿光啊。整个就是一个验假钞的过程。不过呢，据我所知，国家准备批准的转基因水稻应该是华中农大张启发院士的成果，张院士那时候可是我们的励志偶像，我们所有的方法体系估计都借鉴过张院士的，因此呢，没什么意外的话，张院士的转基因水稻，用的就是抗生素抗性筛选标记。\n有人又说了，那人家张院士或许可以重新更换筛选标记呢？这也有可能，但如果这么较真儿的话，我也可以质疑，新的筛选标记难道就不会带来新的问题吗？你说你自己吃的大米要是用紫外灯一照绿油油的冒光，那是多么酸爽的赶脚。\n我对张院士以及转基因科研工作充满敬意，但是转基因水稻商业化的问题，我觉得还是审慎一点比较好，毕竟那是千家万户每天都要吃的东西。谨慎不是我自己异想天开，国际上是有背书的：2003年，联合国粮农组织(FAO)和世界卫生组织(WHO)联合颁布的转基因植物食品风险评估准则第58条指出：“对在临床上应用的抗生素具有抗性的耐抗生素基因不应在食品中出现”。欧盟决定从2004年起禁止使用耐抗生素标记的基因。2007年，世界卫生组织(WHO)根据药用重要性将卡那霉素、新霉素和四环素列为第二级别，为重要类抗生素，意味着卡那霉素抗性基因、四环素抗性基因等这类抗生素抗性基因不应在食品中出现。欧盟药品管理局(EMEA)认同世界卫生组织(WHO)的观点，指出卡那霉素应该被列为在医疗上有重要作用的药品一类。因此，这类抗生素抗性基因不应出现在市场上或者田间试验的转基因植物中。\n你看，老外也不是那么言之凿凿就确定转基因作物一定没害对吧。\n有人又说了，抗生素抗性基因又不是抗生素，吃到胃里就分解掉了，你怕个屌？我倒是不怕，但有人怕啊，这些怕的人还专门做了研究，表明转基因食品中的抗生素抗性基因可能通过转染肠道细菌，从而造成人类对这些抗生素产生抗性，也就是耐药性。这问题就大了，耐药性或许是好事，比如有人用抗生素谋杀你，你却安然无恙。但耐药性带来的更多是不确定性，谁知道这些肠道里的细菌会做出什么妖蛾子啊。2009年绿色和平随机对超市所销售木瓜的转基因成分检测发现：国产木瓜均为转基因木瓜。绿色和平的调查发现，市场出现的转基因木瓜含有抗生素抗性基因，而且已经进入食物链，食用这些木瓜可能使消费者对部分抗生素产生抗性，从而威胁消费者健康。绿色和平呼吁相关政府部门立即召回市场上所有的转基因木瓜，重新评估并调整转基因。\n木瓜已带来如此恐慌，遑论水稻。在抗生素全面泛滥的大环境下，在土壤毒害、大气雾霾、水源污染的背景下，哪里有什么“有机”食品呢？\n答案是有。请原谅我这其实一篇软文，下面是广告时间。\n在东北群山峻岭的包裹当中，有一片和朝鲜、俄罗斯接壤并毗邻日本海的土地。这里的河流源自长白山，奔腾进入日本海，在入海口附近冲刷出一片美丽富饶的平原，这片平原为全国罕见的富硒地区，禀赋日本海的独特海洋性气候，这里冬暖夏凉，昼夜温差适宜高品质水稻种植，所产大米不仅色泽白嫩，香气扑鼻，口感柔韧，并且还富含对人体有益的硒元素。这片土地上所产的大米已走入中南海。这片土地叫珲春，是我的家乡。\n2008年，珲春天然含硒大米获得第三届全国经稻米大会“优质食味粳米”称号，在本届大会上，珲春大米以其优良的品质，获得大会一致好评，经专家评审委员会评审后，在全国众多品牌米的评选中拔得头筹，荣获全国粳稻米大会金奖，同时，又获得了中国优质大米品牌的殊荣。经国家质检总局审查 ，被确认为国内含硒量高的绿色有机大米，成为人体补硒、防治疾病的健康营养品。在2008年长春市举行的天然含硒大米品评会上，珲春大米以每公斤108元卖出了吉林省最高价。\n如果你静下心来思考，这个世界上最珍贵的东西都是免费的。空气、水、阳光……而你每天都吃下肚的盐、油、米，在你的收入中所占的比例又是多大呢？真正的关爱自己不是给自己花高价买衣服买手机买汽车，真正的关爱自己应该是花高价在这个漫天雾霾，四处污染的城市里给自己寻觅一份高品质的食物。许多人在买五千多的手机时不皱一下眉头，在买十块钱一斤的大米时，却斤斤计较。物有所值，珍贵的东西不是值得你拥有，而是值得你付出。\n"
		},
		{
			"post_id": 23,
			"title": "只有心灵的High-tech才是高逼格",
			"date_published": 1466047671.658,
			"body": "自从拿着Iphone、Macbook、Ipad三位一体到星巴克玩自拍落伍以后，google glass和iwatch以及各类可穿戴高科技电子设备掀起新一轮装逼高潮。这年头，要是没有计步软件，走过的路可能都是白走的。问题是，谁他么关注你每天走了多少步啊？\n以上属于热门槽点，不吐不快，不必自行联想代入。\n自从上帝被达尔文干翻在地之后，人类理性的光辉照亮了前进的方向。科学技术日新月异，创新引领未来已经成为世界共识。我们的生活因为科技发展而愈发美好，只不过，凡是过分美好的事物，总有不堪入目的一面偶尔会被人瞥见。科学击败了宗教，但科学却越来越像个宗教。我相信生活的美好在于简单，而不是刻意的复杂化。\n比如hightech，已经成为高逼格的代名词。这年头，你要是不搞点云计算、大数据、物联网、人工智能啥的你都不好意思说自己是互联网家。反正别管你是卖肉的还是做鞋的，不和互联网加减乘除一下，你就成不了“家”。\n以前我们是发现问题，解决问题。\n现在是创造问题，解决问题，然后再创造问题。不会创造问题的tech永远high不起来。民间有个恶搞的故事说，美国航天局为了解决太空无重力下钢笔不下水的问题，投入大笔经费，历经十年，研发出适用于失重状态、身体倒立、水中、任何平面物体，甚至在摄氏零下300度也能书写流利的太空笔。而俄罗斯只用一只铅笔就解决了所有问题。\n这个故事当然是谣言，太空笔的研发意义也远不止太空书写那么简单。就像太空探索，火星之旅虽然不能直接帮助提升人类目前的生活水准，但这项探索计划孕育出的很多新技术和新方法所能给人类带来的益处将远远超过所付出的成本。\n尽管如此，这个谣言还是反映了一点现实问题，科技的发展，正有意无意的走向复杂化。如果这种复杂单纯是小群体的内部规范，那也无可厚非，关键问题是，刻意复杂化的群体正在通过蔑视其他群体来提升自身的逼格和影响力。\n比如江湖郎中，这个群体正处于大规模灭绝当中。以前有个头疼脑热，一张方子一把药，几块钱也可以解决问题，但现在你要是不挂个专家号，接受一系列hightech仪器的全面检测，花上万儿八千，你都不好意思说自己去过医院看过病。过去的医疗理念是不治已病治未病，你自己生活健康，哪里用得着找医生呢？现在的理念则是不病也要把你弄出病，满世界都是各种不健康生活方式的诱导，有时还被刻意包装成“拼搏与奋进”的励志楷模。如果成功就是可以享用各种hightech的医疗器械，服用各种New research的新药，那么这和被用倚天剑屠龙刀杀死的猪有什么分别呢？\n对于金三胖而言，犬决还是炮决或许有点分别，毕竟欣赏性不一样嘛；但对于被决的那个人，有分别吗？难道被炮决的会比被犬决的更高大上，逼格更高一点吗？\n话说印度有位设计师叫Mileha Soneji，她有位叔叔得了帕金森综合症，她通过长期观察和交流，发现叔叔特别不愿意在有人的时候喝咖啡，因为他的手会抖，容易把咖啡溅出来把自己搞得很尴尬。于是Mileha就设计了一种边缘带弧度的咖啡杯，这样拿咖啡的人手抖的时候，咖啡会顺着杯壁的弧度流回杯内，避免了溅出杯外。经过更长期的观察，她又发现，叔叔走平地尽管很困难，走楼梯却像没事人一样，完全不需要辅助设备，这个现象估计很多专业的医师也没有发现吧。毕竟谁能想到，走平路都走不稳的帕金森病人，居然对走楼梯那么再行呢？我们往往都按自己的主观意识和经验习惯判断别人，这是可怕的限制，或者叫偏见，它会阻碍我们对客观事物的认知与理解。总之，Mileha对叔叔的爱让她超越了这种障碍，她发现帕金森病人善于走楼梯之后，就设计了一种三维画面的贴纸，贴在医院和病房的地面上，让病人感觉自己是在走楼梯，走的就非常舒服和畅快。Mileha的这些研究与设计，你说算不算是对帕金森病人的一种福音呢？但在许多科技界人士看来，这算什么呢？这里没有任何高科技的成分。我想如果Mileha设计一个app，把这种三维楼梯效果融合进谷哥眼镜里，那一定就算高科技了吧。\n然并卵，能简单为何一定要复杂呢？\n1492年，哥伦布发现了新大陆，成为西班牙的英雄。国王和王后也把他当作上宾，封他做海军上将。可是有些贵族瞧不起他，他们用鼻子一哼，说：“哼，这有什么稀罕？只要坐船出海，谁都会到那块陆地的。”哥伦布听了，从盘子里拿个鸡蛋，站了起来提出一个问题：“女士们，先生们，谁能把这个鸡蛋竖起来？”鸡蛋从这个人手上传到那个人手上，大家都把鸡蛋扶直了，可是一放手，鸡蛋立刻倒 了。最后，鸡蛋回到哥伦布手上，满屋子鸦雀无声，大家都要看他怎样把鸡蛋竖起来。哥伦布不慌不忙，把鸡蛋的一头在桌上轻轻一敲，敲破了一点儿壳，鸡蛋就稳稳地直立在桌子上了。\n“这有什么稀罕？”贵族们又讥笑起哥伦布来了。\n“本来就没有什么可稀罕的，”哥伦布说，“可是你们为什么做不到呢？我能想到你们想不到的，这就是我胜过你们的地方。”\n然而，为什么一定要分个胜负呢？\n换句话说，凸显自己一定要碾压别人吗？真正的强大难道不是从保护并尊重弱小做起吗？为什么我们总是有意无意接受并传递着一种煽动对抗与仇恨的价值观呢？\n在知乎上，在贴吧里，在天涯上，甚至在电视媒体上，到处充斥着各种学院派对民科的蔑视。民科这个群体整体素质当然不高，他们的学术构想当然有点不着调，他们的论证当然不够客观充分，但是，这就是凌辱和碾压他们的借口吗？科学不是开放的吗？科学不是无国界无阶级的吗？科学不是包容的吗？为什么我见到的处处都是学术霸权主义，为什么学术垄断成为一种新常态，为什么敬爱仁慈的科学家形象正在向冷酷无情的教父形象转变？\n自从库兹韦尔做出《奇点临近》的预言之后，tech的high已经毋庸置疑，然而这并不足以振奋人心。技术始终只是工具，就像一把利刃，可以快刀斩乱麻，也可以杀人无数。而决定它能干什么的，是握住工具的那只手，或者说，指挥手的那颗心。那么，如果一颗比较low的心，却掌握了那么high的tech，结果会是什么，想想就不寒而栗。听说金三胖都能发射核弹了，多吓人啊！\n因此，我们的装逼导向，应该从技术和工具上转移，转向心灵和修养，毕竟，技术的发展太快了，快得你都跟不上装逼的节奏。当初酷炫吊炸天的Iphone5s，过了两年谁还好意思拿出来啊？所有通过对外物的占有，战利品式的炫耀，都会成为过去时，唯有心灵的高逼格，才会让你体悟当下的喜悦。\n所以各位逼友们，是时候调整自己的装逼新方向了。\n"
		},
		{
			"post_id": 22,
			"title": "我们为什么要做精神贵族？",
			"date_published": 1462503127.422,
			"body": "作为一个资深屌丝来说，我都羞于提“贵族”两个字。这年头你爸不姓李，不开着豪车撞死几个人，你还好意思称自己是“贵族”吗？\n尽管一般的屌丝都这么认为，但作为资深屌丝，我还是想更正一下概念。富不等同于贵，贫不等同于贱。啥意思呢，简单来说吧，一个是在讲物质，一个是在讲精神。比如你明天摸彩票，一下子中了两个亿，于是乎，你富了，你脱贫了，这是纯物质性的，物质上拥有了，就是富，就是脱贫。但尽管你坐拥两亿身家，依旧半个字识不上一箩筐，对基本常识都不了解，那么你依旧是一个贱人，不能算是贵人。\n还有人认为，所谓的贵贱，指的不是精神，而是权力。当上公务员的，就算没钱，也是贵人。进不了公务员梯队的，有钱也是贱人。这种理解其实是一种偏见。因为古代，尤其是秦朝一统天下之前，学和官是一体的，所谓知识就是力量，谁懂得多，谁就是老大。那么作为管理者，他既有时间也有精力去垄断学术，比如周文王演八卦，周公制礼乐，最牛逼的学术一定是由最高层的统治者所掌握和发展。普通老百姓，混口饭吃都不容易，哪里有时间去读书。即便想读书，那也缺少师资力量，在那样一个信息匮乏的时代，作为一个底层百姓，请问你有多少机会能买到一本书？唐僧西行十四年，才取经三藏，这还是作为一种国家资源，普通百姓恐怕过上数百年也未必有机会一睹三藏的真容。所以呢，在信息闭塞的时代，只有代表国家的政权机构才能广泛接触信息资源，不是你懂的多才能当官，而是你当了官才能懂得多。你想老聃为什么那么牛逼啊，因为人家是国家图书馆馆长，直接接触第一手信息资源的人，那自然不同凡响，连孔圣那么博学的人也要低三下四去向老子请教。\n正因为在古代官职的高低等同于学术思想的高低，因此往往直接把当官的称之为贵人。而实际上只要你能获得别人的尊重，你就可以称之为贵人。比如像孔子周游列国的时候虽然没有一官半职，但知识渊博，弟子三千，依然可以称之为贵人；像庄子穷的到处借米下锅，列子饿的面有饥色，这两人都身无官职，但其思想普遍受到别人的尊重，因此都可以被列入贵人行列。\n然后问题来了，我们为什么要成为一个精神贵族啊？只要老子有钱，做一个贱人怎么了？你不服吗？不服拿钱拍死你。\n我估计很多贱人都是这么想的。能不能拿钱拍死别人已经成为成功与否的标志了。从某种意义上讲，这是促进货币流通，降低通货紧缩风险，缓解社会两极分化的矛盾的良好手段。想当初河间侯要是拿钱拍一下来借米的庄生，大家一拍两散，相忘于江湖，那是多么和谐的一副画面，美的简直让人无法直视！因此，对于拿钱拍人我不怀任何歧视，只要你有钱，欢迎来拍。\n尽管如此，我还是要继续提倡一下做精神贵族的事儿。\n朱元璋大家都知道吧，就是那个血腥刽子手。以各种借口大肆屠杀开国功臣。为毛这么疯狂呢？有一个小故事说朱元璋杀功臣杀得太多，太子都看不下去了，去质问朱元璋。朱元璋啪的就扔地下一根狼牙棒，然后让太子去捡起来，太子一拿狼牙棒，就被刺伤了手，于是朱元璋语重心长的教导太子说：“一切都是为了孩子啊。你说我要是不替你把刺儿都拔了，我死了之后你得多受伤啊？”\n这个故事真伪不得而知，我估计是编造的。毕竟真实的生活场景里，狼牙棒是有把手的，太子不会愚蠢到直接去拿有刺的一端。另外朱元璋教学模式固然生动，但完全没顾及教学事故的出现，比如太子要是小心翼翼拿起狼牙棒结果还没伤到手，那该怎么继续呢？这得多掉链子啊？\n不管怎么说，就算这个故事是假的，但朱元璋疯狂杀人是真的。而他如此疯狂的原因，唯一合理的解释，也只能是为了维护自家权力的稳定。那么问题来了，为了保护自身权力而大肆屠杀当初的小伙伴，这是一种什么心态呢？\n这毫无疑问是一种贱人的心态。什么是贱人？就是不自信的人。虽然有时候没钱没权会导致一定的不自信，但有钱有权却未必就能一定自信。自不自信可以作为贵与贱的分水岭。鲁迅在《上海文艺之一瞥》中说：“奴才做了主人，是决不肯废去‘老爷’的称呼的，他的摆架子，恐怕比他的主人还十足，还可笑。这正如上海的工人赚了几文钱，开起小小的工厂来，对付工人反而凶到绝顶一样。”朱元璋尽管走到人生最巅峰的位置，依旧改变不了他的贱人本质。他解决自己不自信的方式很奶无，无非就是小学生心中幻想的“天下帅哥都死绝”的那一套。\n让自己变帅的方式只有两种，一种是整自己，另外一种就是整别人。整自己好理解，比如范爷去韩国小小修饰一下，回来就很拉风。整别人就很变态了，自己丑还不让别人说，关键是还不许有比自己更美的存在。比如像朱元璋这样的，比我能耐的都死绝了，老子就是最有能耐的。\n朱元璋选择的整别人的方式如果稍微推衍一下，就是极恐怖的事情，尤其是“一切为了孩子”。因为朱元璋固然丑陋，但如果他的儿子孙子变得更丑陋怎么办？谁也不能保证自己的子孙世世代代都是大帅逼。那么为了确保自己的子孙永远都最帅，唯一的可能就是把别人都整成丑得不能再丑的大丑逼，而且要世世代代如此。《西游记》中菩提祖师对孙悟空的诅咒：“把你这猢狲剥皮锉骨，将神魂贬在九幽之处，教你万劫不得翻身！”大概也就是朱元璋这个路数。明清之后中国的饱受屈辱大概就是朱元璋这种整别人逻辑的恶果显现吧！！\n这种贱人逻辑并非朱元璋首创，事实上从姜太公开始就有了苗头了。话说姜太公白手起家，辅佐武王得了江山之后，被分封到齐地。这个当初钓于渭水的老屌丝终于翻身当家做起了主人。要说姜太公在渭水钓鱼之前，也是个没有官职但却有相当号召力的网络大V，结果这个网络大V做了宣传部长之后，听说自己封地上也有一个网络大V叫华士，于是马上对其进行招安，结果华士不愿意做官，怎么招就是不来，于是太公就派人把他给杀了。周公质问他为什么滥杀无辜，他还振振有词：“夫不臣天子，不友诸侯，望犹得臣而友之乎？望不得臣而友之，是弃民也；召之三不至，是逆民也。而旌之以为教首，使一国效之，望谁与为君乎？”这个老屌丝倒是忘了，自己当初钓于渭水的时候对文王再三扭捏作态，若是文王和他一般思维，早就把他脑袋给砍了！！所以啊，草根逆袭的故事一点都不动人，倒是很恐怖，那些指望工人阶级解放全人类，凤凰男女建设家乡，先富带动后富的梦中人，都可以从白日梦里醒醒了。\n姜太公首创之后，到了商鞅就彻底发扬光大了。商鞅变法闻名遐迩，但估计也没几个人知道变法的内容到底是怎么一回事。其实很简单，商鞅变法可以概括为驭民五术：愚民：弱民；疲民；辱民；贫民。如果有哪个老百姓承受了这五伤拳犹能屹立不倒，那就会引出终极大招——杀之。商君的这驭民五术，我们当代人可能很难体会到其真正的实效，但如果大家能跑到朝鲜体验一下生活，那就对商君的变法精髓有切肤之痛了。君不见，金家父子那么丑陋的人，在朝鲜都和神仙一样，这就是把帅哥都杀干净的效果啊！！\n有人说，那照你这么说，商君就是万恶之首啊。我们国人素质这么低下，是不是就都是商鞅变法造成的呢？\n有关系，但也不尽然，就像我不歧视拿钱拍人这种土豪行为一样，我也不歧视商君反人类的驭民五术。毕竟商君是站在帝王的角度考虑问题，出发点和立场不一样，对善和恶的认识就不一样。老百姓固然会知道真相的我眼泪掉下来，但帝王会很开森的啦。如果你是金三胖，你会讨厌商君吗？你不但不会，恐怕还要万世师表以事之。\n其实商鞅对人性有很深刻的认识。不管你学什么，一定要深刻领悟人性。否则你所学的一定不够深刻。比如亚当斯密，虽然是西方经济学的鼻祖，但他对经济的领悟源自于《道德情操论》，如果他对人性的本质没有如此深刻的理解，他就无法窥破经济运行的背后规律所在，更提不出自由市场的那只看不见的手。正因为商鞅对人性有深刻的了解，才能提出“用善，则民亲其亲；任奸，则民亲其制。”这在当时可谓石破天惊，别的国家都用五讲四美三热爱的四有新人，秦国却专用各种地痞流氓无赖混混。为什么呢？因为四有新人讨老百姓喜欢，老百姓既然知道喜欢什么样的人，就不会盲目喜欢帝王了；但如果用地痞无赖流氓，老百姓根本不知道该喜欢谁，只能期盼青天大老爷、明君圣主的拯救了。正因为商君道破天机，从秦之后的历朝历代，老百姓所看到的官员形象，都变成了诸葛亮阵前骂王朗的那一段：“庙堂之上，朽木为官，殿陛之间，禽兽食禄；狼心狗行之辈，滚滚当道，奴颜婢膝之徒，纷纷秉政。”正因为老百姓平时能看到的都是这些“豺狼之徒”，看不见摸不到的“明君圣主”才变得更加热切，甚至成为唯一的精神慰藉。更何况危急时刻，明君圣主总会杀几只豺狼虎豹以振民心，这就更加坚定了老百姓对体制，对君主的依赖之心。\n所以驭民五术只是帝王版的“天下帅哥都死绝”，和朱元璋一样，都是给老百姓整容，往丑里面整，越丑越好。站在老百姓角度固然听起来挺可恨，但是内里却有符合人趋利避害本性的一面。所以，我们不能就此而指责痛恨某一个人，例如商鞅，例如朱元璋，那样是不够客观公正的。因为换成其他任何人，最终结果都一个吊样。\n比如抛开中国的中央集权体制，抛开商鞅抛开帝王，我们单讨论西方的现代企业管理体制。谈到西方管理学，只需要把握三大定律：帕金森定律，彼得原理和墨菲定律。其中帕金森定律其本质就是西方版的“天下帅哥都死绝”。话说英国著名历史学家诺斯古德·帕金森曾提出：一个不称职的管理者，可能有三条出路，第一是申请退职，把位子让给能干的人；第二是让一位能干的人来协助自己工作；第三是任用两个水平比自己更低的人当助手。假如你是那位管理者，你会怎么选？选第一条路，那叫自杀，肯定不符合人性；选第二条路，没经验的人会这么选，有经验的人会意识到自己其实在培养自己的掘墓人；应用排除法，以上两条路不通，就只有第三条路最适宜。于是，一个笨蛋会找两个笨蛋当助手，上行下效，这两个笨蛋会继续找四个笨蛋，四个笨蛋会继续找八个笨蛋，如此类推，就形成了一个机构臃肿，人浮于事，相互扯皮，效率低下的领导体系。所以你看，按人性来论，官僚体制完全不可避免。不论东西方，还是古今中外，都一个吊样。\n那有什么好的解决办法吗？比如完善机制，构建选拔任用体系啦。抱歉，我一向认为，人的问题只能靠人来解决，尤其是涉及人性深处的东西，机制和体制很难起到匡正的作用。所谓好的机制能够让恶人从善，不过是以偏概全的偏见，如果民主机制和三权分立制度真的是灵丹妙药，美国早就该一统全球了才对。很明显，民主固然有诱人之处，翻过来看就是其不足难堪之处，和集权制一样，都是外表光鲜，内里腐臭。\n既然人的问题需要人来解决，那么提高个人素养，做一个精神贵族就很有必要了。如果人人都是大帅逼，帝王那套天下帅哥都死绝的招数就不够灵光了。毕竟孤家寡人是没有意义的，更何况孤家寡人要想杀掉其他所有的人，本身就是一个不切实际的妄想。\n而一个管理者，如果其本身就已经帅到掉渣，那么自信爆棚的他也根本不会介意找两个也很帅的人做助手。你看黄晓明就找了一群大帅逼做伴郎，毫无违和之感。作为一个管理者，只有自身足够强大，境界足够高，才能自信从容的启用任何一位强者和贤才。所以，一个公司有多牛逼，看看他的最高领导人就知道了。作为求职的大学生，选择企业的参考标准，也是最高领导人的素养，只有帅哥能接纳帅哥，只有贵族才能包容贵族。为了这世界能够多一分包容，多一分接纳，这就是我们要争取做精神贵族的原因啊！\n"
		},
		{
			"post_id": 21,
			"title": "在线收看HBO的网址",
			"date_published": 1462429360.259,
			"body": "http://freetvall.com/video/USS8DDU8NSO1/-HBO"
		},
		{
			"post_id": 20,
			"title": "无敌是多么寂寞",
			"date_published": 1462407522.062,
			"body": "本着不装逼就会死的原则，周星驰的《美人鱼》上映了。据说邓超演唱的那首《无敌》作词作曲都是星爷。难怪那么恶俗，吓死宝宝了。对于这种低级趣味，我只想义正词严地说：我好喜欢！\n到了星爷那个位置，名利双收，阅尽世间繁华，感慨一句“人生多聊赖，寂寞谁人知”，估计也算不上无病呻吟吧；不过若是反推之，星爷的“无敌是多么寂寞”就是有病的呻吟，听这呻吟的动静，貌似病得还不轻。\n肯定有无脑粉丝说：“你丫就是一穷逼，哪里懂得星爷首映就破十亿票房的空虚，赶紧把欠星爷的电影票还上，别瞎比比。”\n我想这些粉丝一定不知道，穷逼有穷逼的好处，至少不会感到无敌是多么的寂寞。这得多神经病才能像星爷这么呻吟啊？《冰与火之歌》里科本学士为詹姆截肢的时候说：“这会很痛。”詹姆说：“我会尖叫”。科本学士：“这会非常非常的痛。”詹姆：“我会大声大声尖叫。”根据此段描写，联系星爷的叫声，我觉得他一定非常非常的痛。\n如果按照《黄帝内经》中上古天真论的标准，这个世界没有一个人敢说自己是“没病”的。我们都是病人，因此古时的贤人雅士一见面不谈赐教，直接说“先生曾不发药乎？”意思很直白，先承认自己是个有病的人，然后请对方赶紧说几句带疗效的话，以便话疗。当然，那个时代的人多半还处于可疗愈阶段，所以积极主动求医问药；到了现今都病入膏肓了，干脆破罐子破摔，见面都先问哪里发财，所谓人为财死，为了秉承舍生忘死之精神，病人都不叫病人了，改头换面称为“成功人士”。\n成功总是那么的让人胆战心惊！\n话说春秋末期三家分晋之时，卫国有一位天真少年叫吴起。那个时候社会阶层是非常明确和固定的，你爸是李刚，你就是李刚，你爸不是李双江，你也别想翻身农奴把歌唱。吴起出身其实还不错，虽然老爸不是公务员，但是家里有钱啊。不过在那样一个社会阶级明确的社会里，有钱和牛逼没半毛钱关系，有钱只意味着你能吃好喝好，其他一概没用。吴起作为一名天真少年，日子本来也过得不错，喝个小酒，泡个小妞，悠哉游哉，一眨眼，一天过去了，再一眨眼，一辈子就过去了。但他妈不干了，他妈和后世所有的母亲一样，犯了一个望子成龙的错误，教导吴起说你要是混不进公务员队伍，就别回来见我。吴起也和所有的傻逼少年一样，信口就胡诌说：“我要是做不到国家总理，我还真他妈不回来见你了。”于是一语成谶。所以你看，所有励志人物的背后，都是他妈逼的啊！\n从天真少年到有为青年，吴起在人生的道路上完成了一次华丽的转身。他先跑到鲁国和孔子的弟子曾参学儒学，刻苦研读六年，过年也不回家。老师曾参就问他，儒家是讲礼的，你春节不回家算怎么一回事？吴起说我对我妈发了誓，做不到相国不回家看她。曾参很惊诧，说妈蛋你可以对别人发毒誓，哪有对自己老母亲发毒誓的，这他妈哪是人啊，这是禽兽。于是曾参从此就很讨厌吴起。没多久，卫国有人捎信过来说吴起他妈去世了。吴起一听，干嚎三声，然后没事人一样继续用功读书。曾参实在看不下去了，说母亲去世都不去奔丧，这叫忘本啊，水无本则竭，木无本则折，人而无本，能令终乎？算了，这小兔崽子我教不了。于是直接把吴起撵走了。吴起一看，操，你不教，老子还不学了呢，直接放弃已经苦读多年的儒学专业，跨界攻读军工专业去了。学成之后直接选调到鲁国公务员队伍里。\n后来齐国攻打鲁国，有人推荐吴起领兵可以抵御齐国，但鲁侯不允，原因是鲁侯顾虑吴起有一个齐国媳妇，怕吴起因此有二心。吴起听说后，回家对媳妇说：“你愿不愿意我出将入相，家财万贯，名垂青史？”媳妇说：“好呀好呀，我就喜欢成功男人，我宁愿坐在宝马车上哭，也不愿坐在自行车上笑。”吴起说那我就放心了，伸手就是一刀，割了媳妇的头颅去见鲁侯，然后拜将领兵，击退齐军。齐国一看吴起这么牛逼，这是个祸害啊，于是派人挑选美女，带上黄金千镒去贿赂吴起。吴起想成功不就是升官发财死老婆吗，于是来者不拒。没想到齐国这是反间计，掉头就向中纪委举报，于是吴起只好亡命逃到魏国。\n吴起到魏国之后凭借军事才能，帮魏国攻下秦国的河西五城。功勋卓著，距离相国之位仅一步之遥。但魏文侯死后，新君立田文做相国，吴起不愿意了，拦住田文质问他说：“你能为国家捞钱吗？你能为国家拓地吗？你能扬威于外不让秦国欺负魏国吗？这些方面你都不如我，有啥脸面做相国啊？”田文被问得很羞愧，支支吾吾敷衍了事，掉头就向魏侯打小报告，于是吴起又被迫跑路，一溜烟流串到楚国。\n楚国自从被伍子胥打得满地找牙之后，一蹶不振，知耻后勇，重用吴起。吴起对楚王说：“打仗靠什么，靠士兵。士兵为什么卖命？为钱财。没钱你打毛仗啊。你看楚国财政，都被那些红二代挥霍了，没本事没文化没用的人全靠国家养着，再多的钱粮也用不到士兵身上。要图强，没别的办法，改革变法，削弱既得利益集团的势力，把钱抓到手用在刀刃上。”楚王说你办事我放心，放手干吧。于是轰轰烈烈的吴起变法在楚国上演了。在伤害了无数红二代的既得利益之后，楚国终于有钱强大了。这时楚王一命呜呼，受过伤的红二代们蜂拥而起追杀吴起，吴起自知无路可逃，一溜烟跑到楚王的停尸处，抱住楚王尸体，被红二代们一阵乱箭射成马蜂窝。\n有人问，吴起为啥要抱着楚王尸体死啊，这是基情还是士为知己者死的感动啊？所以你们都图样图森破了不是，像吴起这样杀妻叛母的成功人士会动感情吗？你没听说死诸葛还能吓退活司马吗？吴起抱着楚王尸体其实是为了给自己报仇。像吴起这样没根没底的下层人，一旦失势，别指望有谁能给他报仇翻案。白手起家的人一切都只能靠自己，包括为自己报仇。话说乱箭齐发，能射在吴起身上，楚王的尸体上还能少得了吗？\n果不其然，新君继位，发现自己父亲被射成马蜂窝，这能善罢甘休？天子之怒，伏尸百万，流血千里。新君这一通杀啊，足足灭了七十多家。注意古代的家可不是现在的一家三口，那个家，代表的可是家族！凡是参与射杀吴起的人，基本都被杀光了。所以吴起死了也能害人无数，这真是成功人士的典范啊！\n吴起同学作为成功人士的代表，励志故事的典型，其经历引发的一个思考就是：人为毛要追求成功啊？\n答案是不甘寂寞。\n什么为民请愿、解民倒悬、自由民主等等都是虚无缥缈的概念或者骗人的鬼话。能吃饭，能过自己的小日子，没有奴隶会觉得自己是奴隶。反之，要均衡各方利益，照顾各方想法，战战兢兢，小心谨慎，乃至婚姻都不能自主的帝王，又何尝能感觉到自由？每一次成功，不过是给自己的心灵更加一道枷锁，无论是金钱还是权力，你占有的越多，意味着你付出的将越多，劳心费力，守之不易。老子云：“甚爱必大费，多藏必厚亡。”多占有的唯一意义，大概就是多失去吧！\n或许我们都不曾注意到，寂寞才是生命的常态。寂寞不是用来忍耐的，而是历经磨难，几经折腾之后要追寻的唯一正果。我们渴求财富，那是因为内心匮乏；我们渴望权力，那是因为内心恐惧；我们忙忙碌碌寻求充实，那是因为不愿正视自己的空虚；我们走亲访友，那是因为无法面对寂寞。\n发现寂寞，你才会发现自己，那里是缘起，亦是归宿。不是因为无敌而寂寞，而是寂寞本身自无敌。只有不甘寂寞的人，才会刻意寻求“树敌”。\n最后献上《西游记》里关于菩提祖师的一句描写：“空寂自然随变化，真如本性任为之。”这是寂寞的真境界，任物屈伸而不在我。能不能做到看个人修为了，反正我还做不到，与君共勉吧。\n"
		},
		{
			"post_id": 19,
			"title": "权力的游戏第六季第二集（百度网盘）",
			"date_published": 1462343893.222,
			"body": "链接：http://pan.baidu.com/s/1eRIjY4i 密码：obm4"
		},
		{
			"post_id": 18,
			"title": "一锅王八汤引发的血案",
			"date_published": 1462343407.988,
			"body": "最近至少有一打人说我变胖了。这让我灰常的郁闷。本来呢，我对腰身变紧的自我解释是冬天穿的保暖内衣有厚度，现在群众用雪亮的眼睛揭破一个血淋林的现实:你丫就是个水桶腰，别把责任推给保暖内衣。\n妈蛋不是说心宽体胖吗？干嘛紧盯着体胖不放啊？咋就没有人说我心宽了呢？\n事实上我心一点都不宽啊。心宽的人怎么会在乎别人说他胖呢？所以体重的增加和心宽不宽没半毛钱关系，唯一的可能，就是吃多了。我的食欲好得令人发指，而且极具海纳百川的包容精神，从不挑食，借用功夫熊猫三的台词来说就是:我觉得我在吃的方面还是很有潜力可挖的。尽管今年是大师兄的年份，但我相信二师兄才是知己啊！\n一说到吃，我就忍不住又看了看时间，饭点好像到了啊！食指大动，键盘都敲不准了！于是问题来了，什么叫食指大动？\n食指是大拇指和中指之间的那根手指头，地球人都知道，问题是，古人为什么命名为食指呢？话说在发明筷子之前，我们人类都和印度阿三一样吃手抓饭的，当你用手去抓食物的时候，比较文雅的姿势就是食指和拇指的配合，当然你也可以用中指，不过吃饭竖中指，完全显不出对食物的尊重啊！再说中指和拇指配合那叫兰花指，只有娘炮才爱做那个手势。后来筷子发明了，拿筷子也要用到食指。正因为古人经常在吃饭的时候用到食指，才以“食”命名之。\n有人说，那按照这个解释，食指大动就是形容吃饭了？\n有关联但不尽然。因为有关食指大动还有一个典故。\n春秋时期郑国的郑灵公时代，有一位叫公子宋的贵族。这位老兄有一项特异功能，每次要品尝到美味的时候，都会显示预兆，这个预兆就是食指动。有一天公子宋和执政大臣（相当于总理）归生一起上朝，刚走到朝堂门口，公子宋的食指就开始动了起来，于是公子宋就对归生说：“今天我们要有好东西吃啦。”归生问缘故，公子宋就把自己的特异功能描述了一遍。归生当然不信，一笑了之。结果两人进门后，遇见大内总管叫人去请庖丁，两人问总管叫庖丁何事？总管说：“有人在江里抓到一只二百多斤重的王八，送给郑灵公，灵公准备做一锅王八汤和大臣们一起品尝。”两人进入朝堂，果然发现堂下绑着一只大王八，公子宋很得意，归生也很惊诧，两人相视而笑，结果被郑灵公发现，就问他们有啥高兴事儿。归生就把公子宋的特异功能转述了一遍。灵公说：“还有这等事？我还真不信了，我的地盘我做主，我倒要看看你们的预言准不准。”于是等王八汤做好了，一杯一杯给大臣们分，分到归生恰好就是最后一碗，刚好没有公子宋的份儿。然后灵公就瞧着尴尬的公子宋得意的笑，说：“你不是食指动，就能尝到美味儿吗？今天遇到我咋就不灵了呢？”公子宋本来牛逼吹得挺满，这会儿被灵公开了一个玩笑，面儿上挂不住了，不管三七二十一走到灵公面前，伸手就在灵公碗里拈了一块王八肉吃了，然后挑衅的说：“这不就应验了？”说完扭头就走了。灵公气得摔了筷子说：“妈蛋活腻歪了，以为我不敢杀你吗？”归生吓得赶紧跪下给公子宋求情，灵公仍旧愤恨不已。君臣都不欢而散。\n归生作为和事佬，赶快跑到公子宋家里劝他去向灵公道歉。公子宋也很拽，说明摆着是灵公先欺负我，我干嘛要向他道歉。归生赶紧晓以大义，说灵公是领导，就算他有错在先，也得你去请罪。于是第二天归生强行带着公子宋去找灵公道歉。结果公子宋根本不服软，归生只好代为谢罪。灵公看到公子宋还那么牛气，更生气了，对归生说：“你看他那个屌样子，这他妈是来谢罪还是来问罪的啊？”说完拂袖而去。公子宋看见灵公怒气冲冲的样子，心底下发虚，怕灵公真的会杀他，于是和归生密谋要先下手为强。归生不同意但是也没有揭发检举。公子宋就私下集结家丁，突袭了宫廷，用沙土袋子压死灵公，对外称灵公做噩梦暴毙。然后另立灵公的长子为君。\n公子宋为我们创立了两个用语，一个是“食指动”，表示有美味儿可吃的征兆；另一个就是“染指”，表示以下犯上，从灵公的碗里拈走一块王八肉。创立这两个词语的代价是弑君，以及为楚国攻打郑国留下了借口，导致自己和归生都被清算。最倒霉的是归生，孔子作春秋，把弑君的罪名安到了归生的头上。所以总理不好当啊，任重则责重，和稀泥结果把自己搞得一身腥臭。\n年关将至，又到了一年最“美味儿”的时刻，给大家讲这个故事一则秉承娱乐至死的精神；二来告诫各位老板们不要随便开员工的玩笑，有时候是有生命危险滴；三来嘛，我们一直忽略了那只被宰杀的王八。其名曰鼋，东汉许慎在《说文》中也指出：“甲虫惟鼋最大，故字从元，元者大也。”《西游记》里记载其居住在“通天河”，怒湿经书以作九九八十一难之最后一难。最近听说美国政府为了保护这东西惹得牛仔们闹独立。所以呢，管它迷不迷信，就算从生态保护的角度，还是少招惹为妙。\n"
		},
		{
			"post_id": 17,
			"title": "我们为什么喜欢赌博",
			"date_published": 1461989426.613,
			"body": "这一篇算是私人定制。因为有网友问到这个问题。\n严格意义上，我算不上一个赌徒，也没有从事赌博的经历与经验，因此我的认识估计非常浅显。但这是一个浅薄者瞎比比的时代不是吗？\n先把这个词拆开，估计会有更清楚的认识。赌，拿着钱的人；博，博取，获得，通过自己的行动来获得。因此赌博就是金钱的游戏。而我更想把它定义为有钱人的游戏。\n为什么要这么定义呢，因为赌博这个词被我们的社会赋予了太多的负面色彩。而事实上赌博应该是一个中性词。它不包含任何感情色彩和价值取向，它只是一种游戏。任何人都需要游戏不是吗？因为人生就是一场游戏对不对？只不过穷人有穷人的玩法，富人有富人的玩法。就像打高尔夫，你真让一个从没走出深山的老农去打高尔夫，他并不会觉得这种把球打到洞里的游戏有多么的好玩、牛逼或者高大上。一般来说，觉得打高尔夫高大上的人，多半都是打不起的小资，他们的感觉不经意间就泄露了他们对自己生活状态的否定。当然，这也没有多糟糕，如果你愿意听，我可以用一个让小资们听起来非常舒服的词来代指——锐意进取。如果老农表示抗议，我也可以送您两个词——知足常乐、安贫乐道。\n知道了赌博是个中性词，咱们就可以心平气和的来讨论有关赌博的故事。首先大家都听过这么一句民谚：小赌怡情，大赌伤身。一般来说，能在老百姓中间流传的道理都非常客观公允。比如这句话，就通过“怡情”点出了赌博的游戏本质。至于伤身，那完全是大小之辩，你玩个一百块的砸金花就能心跳脸红脖子粗，伤身是不可避免的了；但这点赌资，在马云那估计都提不起兴趣，人家有这时间陪你砸一百块的金花，还不如随便陪哪个老总吹个牛逼就能进账百万。所以大和小，不在赌，而在赌的人。每个人对大和小的理解是不一样的，因此不同的人聚在一起，就难免会起尴尬与冲突。有人说同学情深，战友同心，那完全忽略了时间与地点，当你们同在一间教室，一个战壕的时候，那是情深与同心，天南海北几十年后，想和谐只有做路人。否则有钱的对没钱的说咱们去天上人间happy 一下，顺便做个泰式按摩，再到赌场拿几十万碰碰手气，你说你得有多么的难受啊。所以说脱离了时间地点人物事件的感情，就是找不痛快，除非你遇到的是李嘉诚那样把自己伪装的严严实实的老狐狸，但即便李嘉诚能让你感觉舒服，那也是因为他的虚伪（这个词让很多人感觉刺耳，不如换成修养吧），而不是你们之间“真挚的友谊”对不对？所以还是老百姓的话在理，这人要在一起，一定是能“玩”在一起。\n所以我们为什么喜欢赌博，因为我们都喜欢玩啊。如果你看小说、看电影、打电玩、出席各种派对都不觉得愧疚的话，那么赌博有什么好愧疚的呢？都是玩而已，唯一的问题，就是你玩不玩得起?\n如果说玩也能让人产生痛苦的话，一定是你玩了一个自己玩不起的游戏。\n对大部分人来说，都不会轻易犯这样低级的错误。所以玩上一个自己玩不起的游戏的情况，很少，少到可以忽略不计。你感觉这很常见只不过是因为小说或者电视看多了。只有稀罕事才会被写成小说或拍成电视。所以作为观众的你总是觉得没钱还去赌的人很普遍，话说你是不是觉得手撕鬼子、裤裆藏雷也是抗战过程的新常态啊？\n既然现实中人们不会轻易去玩一个自己玩不起的游戏，那么现实中那么多的痛苦是哪里来的呢？\n很简单，从骗子那里来的。没人会玩一个自己玩不起的游戏，但是如果有个热情、亲切又很贴心的骗子跟你说那其实是一个你玩得起的游戏，那情况就完全不一样了。从某种意义上来讲，人类最没用的就是智商，智商是最早的骗子发明的，对智商的需求随着骗术的升级而不断提高。这个世界如果没有骗子，连60的智商都是多余的！！！\n比如马路对面的麻将馆，挂的对联就写着：“东西南北中发白 大家发财到这玩”，横批是“杠上开花”。这个麻将馆老板的文学素养不高，但骗人的心情是急切的，他告诉你来这玩是为了发财，于是你把满怀理想与激情地进去，最后发现发财的是麻将馆的老板。\n当然低级的人只会玩弄低级的骗术，骗的是更低级的人。如果换成“福利彩票”，听起来就能让更多的人上当。毕竟这名字能让人有品德高尚，乐于助人的优越感。再换成“取之于民，用之于民”那就更不得了了，你要是不主动上缴点什么，出门不好意思见人！所以呢，最成功的人，一定是个最精明的骗子，他可以骗所有的人。比如美联储，他们能让所有人相信美元就是财富。\n所以赌博或赌局既不可耻也不可怕，可耻和可怕的是主导赌博和设立赌局的人。赌博最早源自于抽签的占卜方式，东汉许慎《说文》载“古者乌曹作博”,乌曹是夏桀的臣子,由此看来,赌博在中国的夏朝就有出现。5000年前在伊拉克和印度出现了骰子，而且它的足迹遍布希腊、罗马、中东和玛雅古文明社会。当人类还没那么高智商的时代，人们把重大决策交给命运或者说是神来决定，用数学术语说就是随机性。大家都觉得随机是一个非常不靠谱的东西，但这个没那么有趣味的数学概念其实蕴含了一个最高哲理，那就是公平与公正。每个人对公平公正的理解其实都是站在自身或者团队的立场之上，说的都是狭隘的公平与公正，而绝对的公平公正在哪？就在随机性里。人类最原始的决策方式，就是靠抽签或者占卜来体现神的旨意，因为太公平公正了，所以除了高智商的人，无不心悦诚服。有人说你那么喜欢神旨，为什么不滚回原始社会去？好冤枉有木有？我有说过喜欢吗？我只是说笨蛋们对随机性结果心悦诚服而已。而如今的社会，明显是圣人驱动的社会对不对？你看哪一项法规或者道德所体现的公正性，维护的不是牛逼者的利益？你要是觉得社会不公平，一定是因为你自己是个笨蛋。\n不要相信赢者通吃，因为无论赢家还是输家，都不过是交钱入场的赌客而已。只有赌场老板和设局的人才会一直笑到最后。我们喜爱赌博，因为从天性里，我们追崇绝对的公平与公正，只不过一旦成为赢家，赢来的筹码会形成重力，压低你内心的天平，让你更喜欢相对的公平。这个时候，你看到多劳多得，赢家通吃这样的字眼会感觉无比的亲切！！而一旦价值观扭曲，即便你成为输家，也不会再有所质疑！庄家会笑到最后，但是要成为庄家，你要先培养一批信奉庄家理念的赌徒，所以，你智商要高到能成功欺骗这些人。\n所以，尽管从天性里，我们都喜欢赌博；尽管在现实里，我们都在“博弈”，但我还是要奉劝一句：不要再赌了。\n因为：你不玩，你就不会输。\n"
		},
		{
			"post_id": 16,
			"title": "为什么不必害怕转基因",
			"date_published": 1461801523.572,
			"body": "因为恐惧比转基因为害更大。\n好吧，这个答案太鸡汤了，有损于理工男的科学形象。更科学的答案在于进化论。\n让我们先把话题扯远一点。话说当年我还在实验室里搞转基因的时候，这个东西还不是个敏感词。当时我做的是最低端的下游工作，也就是组织培养，利用农杆菌侵染植物愈伤组织，然后在无菌环境下用含抗生素的培养基筛选转化成功的细胞与植株。至于转什么基因，想表达什么功效，基因片段如何镶嵌到质粒当中，又如何将质粒导入到农杆菌中，这些高大上的尖端科技都不是我这种低端人士所能接触的。我只是整条技术链条的最末一环，作用就是不断去验证老板的strategy或者idea是否可行。这是份非常无聊的工作，因为植物的生长周期很长，而农杆菌对不同植物侵染的成功率各不相同，你需要不断重复，做大批量的劳动才能确保在经年累月的积累当中被偶然性给砸中。当然，事实是，即便最低端的工作，也有值得你追求和探索的东西，比如如何提高侵染几率的这种“偶然性”，或者干脆把这种偶然性变成必然性。那就是我当年能够顺利毕业的亮点之一。\n在经年枯燥繁冗的工作中，我见证了生命的奇迹。那一团团未分化的细胞组织在培养基上成长为一棵棵植株。有时候我想，如果是一颗颗的种子，那么就没有人会感觉惊奇，而那一个个细胞成长为一棵植株的过程和种子又有何本质分别呢？奇迹每天都在我们身边发生，而我们熟视无睹。\n我迷恋上了生命的奇迹，一度我以为，我的归宿或者是一片田地。但农耕文明已经瓦解了，我们总是要向前看不是吗？\n考古生物学发现地球经历过五次生物大灭绝。这种灭绝有一定周期性，大约6200万年就会发生一次。而据《科学》杂志发表的一项研究，如今动物的灭亡和减少正是地球第六次生物大灭绝的前奏。这是正在发生的事实而不是末日情怀。相伴而来的疑问则是，如果灭绝意味着结束和终止，那么为什么会有五次？或许我们谈论生命的时候故意忽略了什么东西。生命的奇迹在于，它不仅仅指代的是生活，还包含了死亡。\n生只是生命的一部分，而生死轮回，才构成生命的全部。生命是个周而复始的过程，每一个所谓的终点，其实都是一个起点，生命没有终始。或许我们不该叫生生不息，而应该叫生死不息。\n与生物大灭绝相对应的就是生命大爆发。迄今为止，在古生物学和地质学上这依旧是一大悬案，自达尔文以来就一直困扰着进化论等学术界。大约5亿4200万年前到5亿3000万年前，在地质学上称做寒武纪的开始，绝大多数无脊椎动物门在这2000多万年时间内出现了。这种 “同时”性和“突然”性让进化论的线性结构产生了危机。甚至让宗教界人士以此为借口，秉承上帝的旨意卷土重来。我虽然无意否认上帝，但是我不愿意把他当成解决问题的借口。如果更理性一点推理，那其中的一种可能性就是：生命从来就没有“灭绝”，它一直存在；生命也不是突然爆发，它一直在那儿。只不过换了个马甲而已！！！\n让我们产生迷惑的，只是生命的形态，如果能掌握生命的本质，你会发现，生命也许一直都在那儿，不生不灭，不增不减。把这种考古生物学上的大循环缩小来看，用一首唐诗就可以概括：离离原上草，一岁一枯荣。野火烧不尽，春风吹又生。春天的草是嫩芽，夏天的草是绿叶，秋天的草是花果，冬天的草是根系。草的形态随着外部环境的变化而变化，但它的生命一直都在，如果非要说生命的本质到底是什么，目前我能找到的答案大概就是信息。形态千变万化，信息永流传。\n在小尺度上，生命的信息记录在DNA里；在大尺度上，它或许记录在水中、空气中，甚至是以太、暗物质或者暗能量里。当环境恶劣时，形态收缩便于信息的记录与保存；当环境适宜时，信息开始萌发，各种形态开始“突然”地，“同时”地出现在地球上。\n好吧，在没有证据之前，这不过是有关伪科学的猜想。接下来我们还是谈论一些有证据的科学事实。南非开普敦大学有一位分子生物学教授叫Jill Farrant。话说在全球暖化，人口激增，粮食需求旺盛而土地有限，水资源短缺的时代，如何确保人类日益增加的口粮需求呢？Jill Farrant给出了一条“明路”，通过基因修饰创造耐旱作物。具体途径是这样的:每段基因都有一个可调控的开关叫启动子，只有启动子启动，这段基因才开始表达性状。作物接受到干旱信号的时候，会启动自我衰败的基因，其实就是增加体内自由基的表达，以加速老化，这样作物的叶片就开始干枯，但事实上这只是一种自我防护机制，作物并没有因此而死亡。一遇到湿润环境，就又开始恢复生长。Jill Farrant的工作就是把植物接受干旱信号后启动自我衰败的基因的启动子转接到另一段基因之上，这段基因是抗氧化基因，它一表达，就会产生抗氧化物质清除自由基，阻止植物的老化和衰败。因此，经过基因修饰之后的作物，遇到干旱环境，启动的不仅仅是自我衰败的基因，还启动了抗氧化清除自由基的基因，这样就可以在干旱环境里继续保证作物的生长。从目前的表达结果来看，Jill Farrant取得了非常漂亮的结果，在连续三周不浇水的情况下，对照作物严重枯萎，而转基因的作物依旧保持着生长的态势。\n看起来这是科技改变生活，拯救世界的明证啊！至少Jill Farrant是这么认为的。她认为她的技术可以解决世界面临淡水资源短缺时代的粮食危机。救民于水火，解民倒悬啊！有了高科技，人口就可以无限繁殖，资源就可以随便浪费，科学的问题终归是要科学来解决啊！！！\n无论是从技术角度还是从科学角度，Jill Farrant都可以当之无愧的称之为Master。她的学术价值毋庸置疑，但说到拯救世界，还是省省吧。她拯救世界的路线存在严重的bug，那就是时间尺度问题。经基因修饰的作物可以三周不浇水，四周呢？五周呢？一年呢？十年呢？有人会反驳说，你丫也太挑剔了，把时间线拉长，那些没经基因修饰的作物也一样都干死了，而且还死得早，不到三周就死翘翘了，而经过科学的改造，至少人家能活四周嘛。多一点时间就多一分机会啊。如果你真的这么认为，那就图样图森破了。在我们的传统文化里，有一个理念叫舍生取义，死而不亡。在我们的古人眼里，死和亡是不同的，死是暂时的，亡才是终结。植物枯萎，那叫死，不叫亡，死的目的是提高耐受力，把有限的能量用于记录和保存信息，等待环境变化到适宜的时候东山再起。而经过基因修饰的作物呢？在面临干旱的时候还疯狂生长，完全没有给自己留下记录和保存信息的余地，这才是自取灭亡啊。试想大旱三年之后，那些死去的作物是有机会再度萌发的，而那些灭亡的作物，就永远的丧失了这个机会。\n进化论的核心就是优胜劣汰。而科学家们困惑的地方在于，为什么有些优势物种，反遭淘汰。比如学术界一直探讨的霸王龙，完美的杀戮机器啊，应该万古长青才对，偏偏就灭绝了。当他们还在理论和现实的矛盾当中徘徊时，完全忽视了自己的概念误区，那就是，什么是优势，什么是劣势？优势和劣势完全是个相对概念，不是绝对的啊。在这个环境下的优势，在另外一个环境下可能就是劣势，比如在陆地上兔子比乌龟有优势，在水里那就完全相反啦。而问题的关键在于，环境不是一成不变的，外在环境永远处在不停的变迁当中。\n在一个不断变迁的环境当中，没有谁敢保证自己永远一枝独秀。应对不断变迁的环境唯一的办法，就是多样性。不要狭隘的限制到一种可能当中，而应该包容无限的可能。谁知道现在看起来挺傻逼的东西明天会不会牛逼啊！\n所以，回到我们的题目，转基因有什么好怕的?在人类修饰基因之前，生命之间就不停的进行着基因的融合与修饰，我觉得这可以称之为信息交流吧。而大自然不断变迁的环境就像那混合了抗生素的培养基，淘汰失败者，保存成功者，而所谓的失败和成功，不过都是在有限的时间尺度之内，比如6200万年，在大自然的眼中，那不过是白驹过隙的一瞬间。无论是被淘汰的失败者还是暂时留存的成功者，他们都死而不亡，在更大的时间尺度上，默默的循环往复，生命恒久远，信息永流传。\n而具体到我们有生之年的时间尺度，转基因作物不过比经大自然优化过的作物多疯狂那么几天或者几周而已。而疯狂的代价是失去东山再起的机会。试想真的出现三年不雨的情况，被转过耐旱基因的作物就自然被淘汰了，而那些被大自然优化过的作物，却可以在默默的沉寂当中重新迸发。所以，你怕个毛啊？\n存在即合理。当下总是最好的。与其心怀恐惧，成天要求别人不要这样不要那样，还不如敞开胸怀，解放自我，顺其自然。与这世间万物，默然相爱，寂静欢喜。\n"
		},
		{
			"post_id": 15,
			"title": "《权力的游戏》第六季第一集",
			"date_published": 1461734951.114,
			"body": "http://pan.baidu.com/share/link?shareid=4264035168&uk=725657881\n提取码：b57e"
		},
		{
			"post_id": 14,
			"title": "如果你不搞砸，你就不会做成",
			"date_published": 1461734832.146,
			"body": "作为受过高等教育的证明，你知道，我可是进过实验室的人。就是那种需要穿着白大褂，穿梭在各种瓶瓶罐罐之间，闻着各种化学试剂的味道，睡眼惺忪地等待着一个未知结果的lab。我这是要上演生活大爆炸和绝命毒师的节奏吗？\n有好结局的故事，不一定有一个好的开始。\n进实验室的第一天，我就打碎了一个烧瓶。然后我就像被批斗的黑五类一样被抓到实验室所有师生的面前，向他们赤裸裸展示什么是高分低能。好吧，我必须承认，把我从理科生掰弯成一个文艺青年的过程里，那只烧瓶起到了不可估量的作用。但真正不能让我释怀的是，为什么打碎了一只烧瓶就成了低能儿的代表。如果顺着这个逻辑推理，美国的自由女神像应该是最高能的代表，因为她那只火炬几百年了就没动摇过一下。\n天底下所有的老师或老板，对学生或员工的期望都是一样的：“那些蠢货为什么总是把事情搞砸？”\n于是紧接着就诞生了我的疑问：为什么所有的学生和员工都把事情搞砸了，而那个实验室和那个公司却依旧能茁壮成长？\n答案是蝴蝶效应，不知道什么是蝴蝶效应的同学自行百度。每当我们回首前尘往事的时候，用的都是宏观视角，类似于卫星上看地球，只不过一个是时间上的宏观，一个是空间上的宏观。在宏观视角下，你会发现，随着事情的发展，某些一开始看起来微不足道的事物往往最后起着举足轻重的作用。人生不可以重来，但是电脑游戏可以，每一次通关的结局都不尽相同，正如你每一次游戏起始的条件和输入参数无法相同。\n在摇滚乐的历史上，最牛逼的人肯定不是崔健。崔健只是把摇滚介绍给了懵懂的中国人。那么在国际视角下，有一位猛人叫布莱恩·伊诺。这位兄台从来不敢自称为音乐家，但他却是音乐史上的一个传奇。在他玩音乐的四十多年里，和大卫鲍威合作过《超能英雄》；和U2合作过《注意点宝贝》和《约书亚之树》；除此之外，他和DEVO乐队合作过，和酷玩乐队合作过……他几乎和所有牛逼的乐队都合作过。\n那么你知道他是怎么和这些牛逼乐队合作的吗？协调关系，让 每一位成员更加和谐，团队和睦相处？No，Definitely not！他来了就是让他们难受的。为了确保每一次合作都能把他们给恶心到想吐，布莱恩特意发明了一套纸牌，每张牌上都写满特定的指示，当大家在讨论问题都陷入僵局和绝境的时候，就抽牌决定。比如有一张牌上面写着“交换乐器”。那么抽到这张牌，乐队成员就开始互换乐器进行演奏，架子鼓手去弹钢琴，钢琴手去弹吉他，吉他手去吹管……\n然后，然后就是一片混乱，各种不和谐，各种咒骂，各种尴尬……\n最后是各种奇迹！！！\n菲尔·科林斯曾在布莱恩制作的一张专辑中做架子鼓手，合作过程中的各种不愉快让他满地摔啤酒瓶子；而Carlos Alomar直接对布莱恩说：“布莱恩，你知道吗，你的方法就他妈是蠢货加逗逼才能想出来的。”唯一让人不可思议的就是这个蠢货加逗逼才想出来的方法，让这张专辑的口碑相当得好。而三十五年后，Carlos Alomar自己也开始应用这个蠢货加逗逼想出来的方法。因为他开始意识到：良药苦口利于病啊。\n布莱恩的名言：“留意那些让你难受的细节，然后放大它。”“先采取一个突然、不可预测的破坏性行动，然后再整合。”\n当事情变得足够糟乱的时候，创新就出现了。所以，你只有先把事情搞砸，才可能把事情做成。灵感源自混沌，不可能才意味着无限的可能！\n作为一个艺人，如果江郎才尽，那说明药磕少了，柜出少了。话说我这算是教唆犯罪吗？此处少儿不宜，省略五万字。\n在人类进化的长河当中，思维的习惯、观点、经验，有时甚至是世界的“真相”，使我们的生活基本上局限于一种熟悉的环境中，通俗点说，就是我们容易形成思维定势。如果我们认为那就是生活的全部，它们就会成为可怕的限制。巴甫洛夫为我们揭示了这一真相：一条狗的唾液腺对每一次进食的铃声都会作出反应。如果我们是那条狗，那么整个社会则铃铛遍布。混乱的意义在于，它让我们终于认识到，不是每一次铃铛响都意味着进食！！\n因此，如果布莱恩在各个乐队中的作用，如果管理学家认可那算是管理的话，他的管理不是为我们制定条条框框，不是让我们舒舒服服的和睦相处，而是为平静的一潭死水引入了混乱，在通常的意义上，这会被管理学家认为是大逆不道。然而，如果一定要说管理可以带来创新的话，那么一定是大逆不道的管理，带来了意想不到的创新。\n有情人终成眷属，这种happy ending不会是一个打动人的好故事；而只有猜到开始却猜不到结局的爱情，才会让人刻骨铭心不是吗？痛苦比舒适更有耐受力，它的威力甚至可以减缓时间的流速。然而，我们更倾向于选择的，却是让时间飞驰而过的快乐！\n我无意诟病美满、舒适、快乐以及条件反射般的思维定势。我们甚至可以运用定势思维来淡然接受这一切。比如平静的看着一个人慢慢老去。凡人终有一死，这是你可以接受的世界观，然后一切都顺其自然，再正常不过。但是，没经历混乱，你怎知事情不会有一丝丝转机？问题只在于，谁有勇气把混乱引进自己的生活！\n你不搞砸，你就不会做成。而且，我知道你根本不会有把自己的事搞砸的勇气。那么唯一的机会在哪里？就在于你诅天咒地抱怨的所谓命运的各种意外，各种不公。你没有勇气出手，命运代劳了，不计较你毫无感激之情，默默承受你的抱怨，老天爷真是个活雷锋有木有？\n那么，你准备好接受来自命运的所谓“善意”了吗？从黑暗、落满灰尘的角落里找到一个叫“感恩”的东西，把它擦拭干净，闪闪发光，时刻照亮你前进的方向。\n"
		},
		{
			"post_id": 13,
			"title": "你有多爽，你就有多平庸",
			"date_published": 1461541833.259,
			"body": "有人说我在哗众取宠，因为我老是挑战他们的常识。\n好冤枉有木有？我只是找出了你们常识当中的纰漏，从来没有去挑战，更没有去颠覆。比如我说注意力不集中是好事，但我没说专注就是坏事。事实上是你们一直用常识来污蔑、打压、约束我们这些不那么符合常识的人。奴隶只不过说戴着脚镣手铐不方便干活，奴隶主就认为奴隶是要造反。你知道奴隶为什么会造反吗？是奴隶主逼着他们造反啊！\n比如这一篇的题目，我估计有些人一看，就觉得我是在否定平庸，是要倡导大家都去争取非凡。其实我就是一个很平庸的人啊。我从来不否认平庸，甚至还很喜欢平庸，不信，你把这个题目倒过来读一遍试试：你有多平庸，你就有多爽。\n怎么样，感觉舒缓多了吧？所以我要告诉你，你的感觉是多么的不靠谱。只不过顺序颠倒了一下，你就情绪失控了。\n所以对于国家来说，文字游戏多么重要啊。找不到工作要叫待业；炒鱿鱼要叫下岗；经济衰退叫负增长；打破常规叫新常态。因为老百姓都是傻逼啊，自己的情绪完全不由自主，几个词汇就能把他们搞得精神失常！！！\n所以我不能用感觉说话，尽管我的感觉很准。这是个科学昌明的时代，我要用事实说法！妈蛋，这是焦点访谈吗？\n为大家隆重介绍另外一个社会心理学家，此人名叫凯瑟琳菲利普斯。话说凯瑟琳绞尽脑汁，搞了一个杀人游戏。哦，对不起，或许叫侦察破案游戏更贴切一点。游戏的内容是这样的，凯瑟琳搜集了一些案件，要同学们根据她提供的案发现场的各种蛛丝马迹，来商讨破案方法。凯瑟琳设计的是四人破案组，四个同学一组，然后测试他们的破案效率。她测试了好多组，小组之间的区别是，要么四个人都是熟人朋友，要么是三个熟人，一个陌生人。\n我们直接说结果吧。经过多次测试，凯瑟琳发现，全是熟人的那些小组，破案率只有50%；而夹杂了一个陌生人的小组呢……嗯哼，如你所愿，破案率是75%。\n好吧，我知道这个结果并不意外。毕竟许多年前就流传过哈佛不留本校毕业生任教的传说。陌生人会带来文化融合，学校会因此而保持活力和年轻。\n但这个试验还没有结束。凯瑟琳在每次破案结束后都会现场采访小组四个人的合作感受。对于由四个熟人组成的小组来说，毫不例外，尽管他们业绩平平，但是每个人都感觉良好，工作时光非常欢乐，合作愉快。而对于那有一个陌生人的小组，每个人的感觉都非常糟糕，各种不爽，各种不顺，各种尴尬，尽管他们事实上取得了非常不错的业绩，但是在他们的感觉里，却认为他们这个团队根本不可能取得任何成绩……好吧，不用我多说了，你们都该看得出来，普通人的感觉是多么的不靠谱。\n所以，你应该很明白了，如果你目标是解决问题，那么注定经历苦难；如果你的目标是生活的爽，那么注定平凡而平庸。这本来应该是个常识，但问题是，在当下的社会，好多人貌似都把“杰出”、“非凡”和“爽”划了等号。比如你小时候总有一些人告诉你，努力奋斗出人头地，你才会过上好生活。很显然，这些人没过过好生活，根本不知道好生活是什么样子的。这大概就是这一代人痛苦的来源吧，他们越杰出，越痛苦，然后还搞不明白。\n所以你做任何事的时候，都先掂量明白。读书不能是为了爽，当官不能是为了爽，做科学家也不能是为了爽，甚至做企业挣钱也不能是为了爽。因为，做这些，其实是为了责任。\n用不用我告诉你，即便是爱情，也不是为了爽。因为爱情也是责任，不是简单的荷尔蒙综合症。\n文化融合，听起来是多么和谐的一个词语，但仅仅是词语。如果你经历过融合的过程，恐怕就不会那么和谐了。许多人天天嚷嚷着要效法商鞅变法，估计他们不知道商鞅的下场吧。如果你具备了商鞅的牺牲精神，才可以谈变法。否则，割你一块肉都会喊疼的主，我不相信你真能变法！！！\n所以，如果你准备走一段不平凡的人生，注定不会很爽。知道什么人很爽吗？傻逼啊!没听说过傻人有傻福吗？大家一直把傻逼当成一个贬义词，那不过是非凡的人为了标榜自己的非凡而用的一个对比词而已。你知道非凡的人生是通过付出得到的，他们失去了那么多，嫉妒得喊你一声傻逼，难道不应该吗？即便是最痛苦的人生，生命中也有很爽的那么一些片段与时刻，所以即便是最杰出的人，生命中也有偶尔傻逼的一些插曲。因此，傻逼是一个褒义词还是贬义词抑或是中性词，完全看个人心态怎么样了。话说杨贵妃要是穿越到赵飞燕时代，估计也是个傻逼死胖子吧！\n人生是一场不由自主的选择，但当你来到这个世界上，就已经接受了一种trade off的游戏规则。我们不断的牺牲掉一些东西，然后不断的得到一些东西。舍与得交替轮回，把你的人生维持在一种微妙的平衡之中。如果你选择爽，那么请接受平庸的现状。如果你抱怨平庸，恭喜你，你正在选择非凡，不是这辈子，估计也是下辈子。梦想总会照进现实，或者说现实会编织梦想。现实与梦想本身就是一种trade off，只要你愿意玩，游戏永远没有尽头！\n"
		},
		{
			"post_id": 12,
			"title": "注意力不集中怎么办",
			"date_published": 1461453158.831,
			"body": "小时候我们都很崇拜毛主席对吧?\n什么，你不知道毛主席？好吧，我们之间已经有严重的代沟了。不过你知道毛主席是一个非常伟大的人就够了。各个时代都有非常伟大的人，形貌名姓或许不相同，但有关他们的奇闻异事大体上都差不多。所有的伟大都是相似的，而平凡却各不相同。\n小时候老师看我们不认真听讲，就耐心的给我们讲毛主席在城门口读书的故事。说毛主席啊，胸怀伟大的理想，热爱读书，为了训练自己的注意力，每天一大早，就跑到城门口人来人往最热闹、最喧哗的地方读书。长此以往，毛主席读书时非常投入，注意力非常集中，外在环境都无法干扰他了。老师的结论就是：专注成就非凡。\n后来不知从哪里看到的，说华罗庚也在闹市读过书。于是我自己又得出个结论，只要你牛逼了，就有人替你吹牛逼了！\n专注当然是一件好事，但一旦立为标杆，就不那么美好了。尤其像我这样发散性思维的人，东一榔头，西一锤子，本来悠哉游哉也挺高兴，但用专注的标杆一衡量，就凄凄惨惨戚戚了。这就好比你明明是一只猴子，却非要把你关在鸽子笼里。尽管能住进鸽子笼的猴子是挺非凡的，但谁他妈关注过猴子的苦恼啊！\n话说有一个著名的心理学家叫雪莱卡森，她针对哈佛的本科生做了一个长期的跟踪调查。首先，她把调查对象做了一个简单测试。测试什么呢？测试他们的注意力程度。怎么测试呢？比如把他们叫到餐馆里讨论问题，餐馆里各色人等七嘴八舌的特别吵杂，要是你不受干扰，能很好的继续你们讨论的问题，那么你就是一个注意力非常集中的人。反之，要是你心绪不宁，被外界环境干扰的无法讨论你们的问题，那你就是注意力容易分散的人。\n话说到这里，大家的惯性思维一定会认为，注意力分散一定是个不利因素，是缺点，是需要纠正的毛病，是阻碍我们成就非凡事业的障碍。然而……\n经过雪莱卡森多年的跟踪调查，结果发现倒是那些注意力不那么集中的同学，在人生道路上取得了一系列辉煌。他们有的发表了自己的第一本小说，成为作家；有的出版了自己的第一张专辑，成为音乐家……而那些特别专注的同学，则一直在平凡的岗位上默默奉献青春。\n那么，问题来了，这他妈到底是怎么一回事？说好的专注成就非凡呢？说好的毛主席和华罗庚呢？为毛他们的成功不能像唐骏一样可以复制呢？\n雪莱卡森的结论是，那些注意力不那么集中的同学，具有发散性思维，而发散性思维，成为他们创新与灵感的来源。英语里有个短语叫“think outside the box”，直译就是在盒子外面思考，具体意思就是跳出框架约束，放飞你的心灵。用我们的官方术语解释，就是解放思想，挣脱束缚。\n你看，小平同志让我们解放思想，口号喊了三十多年。结果呢？结果是我们从英文的“think outside box”才知道，思想从来不需要解放，思想一直都是自由翱翔的。你飞不高，是因为有人为你的思想套上了一个牢笼。当你的思想被紧闭在一个box里面，试问你怎么能信马由缰，驰骋奔腾呢？如果你是一只被关在笼子里面的鸟，那么无论你喝多少心灵鸡汤，接受多少鼓励与努力，你也飞不起来。所以呢，我们需要的不是解放思想。要解放的，是思想外面的牢笼。\n所以，那些注意力不那么集中的同学，注意力不集中，那就是你的天性啊。你的思想无时无刻不在试图展翅翱翔，它在竭尽所能的试图与牢笼外面的广阔天地建立联系，每一次分散，都是在牢笼上穿透了一个窟窿，当窟窿足够多，这个牢笼就再也不能束缚你思想的放飞。此时，you can think outside the box because the box was full of holes。多么可爱的holes，尽管更多的时候，它代表了深渊的意思！！！\n所以，如果说专注是一件美好的事情，那么不专注，也不是一件非常糟糕的事情。放开那些条条框框的标准，你会发现一个到处都是美好的世界。一个好的老师，眼睛里没有废柴的学生；一个好的领导，手底下没有无用的职员。如果你一定说有，那么只可能是你眼界没开阔到能看清楚什么是美好。为什么说私欲会拉低你的境界，因为私欲就是你给自己设立的一个门槛极低的标准啊，它会蒙蔽你的心灵，遮蔽你的双眼，束缚你的头脑，捆绑你的手脚。\n那么，回到我们的问题，注意力不集中怎么办？不需要怎么办，那正是你的优势啊。你不会成为一个专注的人，你不是毛泽东，你也不是华罗庚，但你会成为一个创意十足的人，你就是你自己。老天爷为你准备了那么宽阔的道路，你说你干嘛非要千军万马的过独木桥呢？\n"
		},
		{
			"post_id": 11,
			"title": "急什么急？",
			"date_published": 1461326080.205,
			"body": "如果有什么熟人对我小时候还保留一点印象的话，我想他一定会用一个字来高度概括，那就是“笨”。事实上那也是我对童年唯一的回忆。你看我都没好意思用呆萌来稍微掩饰一下，毕竟如今大家用呆萌来形容一个人的时候，多少还保留了一点可爱的意思。而我的笨，是货真价实的蠢笨，别人不咬牙切齿我就很感恩戴德了。\n所以上小学的时候，我要是在班级能拿个好成绩，自己都觉得不好意思。像我这么蠢笨的人居然都能名列前茅，这老天得是多么的不公平啊。当然，这或许跟老天没什么吊关系，大概只能算是学校和老师的问题吧。\n那么，像我这样爱思考的好同学就一定忍不住去琢磨，为什么越笨反而成绩越好呢？首先，我得搞明白，大家伙和我自己为什么会认为我笨？结论来源于观察，比如啊，同学们背一首古诗，用了三十秒，我用了三天；同学们理解一个数学公式用了一节课，我用了一个星期；同学们听完一个新来的同学自我介绍后，就交流无障碍，知道他姓甚名谁，家住哪里；而我呢，可能一个学期还没搞明白他是男是女……凡此种种，不可胜数，认真回忆起来都是眼泪啊！你知道我此时此刻的感觉是什么吗？是紧张啊，因为用以上标准一衡量，我忽然发现好像现在我也没有聪明起来呀！！！\n既然清楚了自己笨的具体表现，那么问题来了，为什么这么一个笨蛋考起试来好像还不错呢？可能性只有两种，一种是我们的教育其实倾向于培养笨蛋；另一种就是尽管是笨蛋，也有其闪光的一面，考试的时候恰好让笨蛋们光彩夺目。\n好吧，我知道有些同学已经迫不及待要跳起来斥责我说：“你这个大愤青，又要准备黑我大天朝的教育制度了。”\n弱弱的问一句，能允许我表现得委屈一点吗？人家已经不够青了，而且愤也不给劲儿了。人家正努力向理智型大叔勇猛迈进好吗。这里的梗是:作为一个资深老笨蛋，我忽然好想和你们分享笨蛋的闪光点啊。\n首先为大家隆重介绍一位知名心理学家——奥本海默丹尼尔。看名字好魔性有木有？别管了，反正你也不认识。自媒体时代，只要是你不认识的人，都可以是知名人士。总之呢，这个砖家也好，叫兽也罢，搞了这么一个试验，他纠集了一帮高中老师，让他们在准备课堂讲义的ppt时，采用不同的字体，一半的人用常规字体，比如宋体或黑体，另一半则用方正舒体或者华文彩云，反正就是那些让你阅读起来很困难的丑陋字体。结果怎么样呢？结果是，到期末考试成绩一出来，那些被丑陋字体折磨了一学期的同学，成绩硬是要高出一大截。这是怎么回事呢？这结果和如今家长们的直觉完全相反啊。这要是哪个学生回家哭诉在课堂上完全看不懂板书，原因则是老师故意用了丑陋的字体，那家长们还不冲进校园海扁老师一顿啊。经常有学生总结考试失利的原因：不是坐在后排看不清楚，就是老师方言太浓重，听不清楚。说的好像给他调到前排，换个中央电视台的主持人，他就能名列前茅一样。\n经过对照、查摆，奥本海默终于发现一个重要原因。丑陋的字体固然让学生阅读困难，但是适当增加的阅读难度却降低了学生的阅读速度。本来一个天资聪颖的学生可以一目十行，如今换成丑陋字体，他就只能十目一行。而伴随着阅读速度的降低，增加的是学生对阅读内容的揣摩与理解，甚至，还会有进一步的联想与思考！而这些才是增强学生对知识深度理解与记忆的关键。\n好了，现在大家终于明白，不是所有的笨蛋都一无是处。作为一个资深笨蛋，我想分享给所有笨蛋的彩蛋就是：笨蛋们有一个天生优势，就是慢。\n这是一个快速发展的社会，这是一个急躁的社会，这是一个风风火火、莫名其妙的社会，被这个社会定义为笨蛋的人，不要逼迫自己去和别人拼速度，而应该静下心来，慢慢欣赏自己的一无是处。这个世界上还有比明知道自己是一只乌龟，还要和兔子比奔跑速度更蠢的想法吗？或许全世界都是这种“鼓励”你的声音，不要理他们，因为他们都是傻逼。\n用更励志的话来说，笨蛋只是一群自以为是的傻逼给你打的标签，而真实的自己，有待于你自己去发现。你被标签的“缺点”，恰好就是你真实的“优点”，乌龟只有在兔子眼里才笨拙，水里的鱼儿可不会这么想。每个人都有自己的“天赋”。你知道什么是天赋吗？就是大自然把你创生出来的时候就赋予你的礼物。有认说老天爷不爱我，所以没给我天赋。错了，这个世界上如果还有绝对的公正，那一定就是大自然或者你口中的老天爷了。每个人都有自己的gift，区别只在于，你他妈老盯着别人的gift。\n所以，以后有傻逼劝你适应社会或者改变社会的时候，你可以礼貌的笑笑，用肯定和鼓励的眼神安抚对方受伤害的心灵，然后，你坚定不移的适应自己和改变自己。当别人给你打标签的时候，你要感激对方，因为对方帮你发现了上天赋予你的礼物。当全世界都急速奔驰的时候，你要怀着感恩的心欣赏他们带给你速度与激情的既视感。世界因为一动和一静而圆润完满。既然已经有人勇往直前、开拓进取、傲立潮头，你说你还急什么急！\n"
		},
		{
			"post_id": 10,
			"title": "如何不下载软件就激活office2016",
			"date_published": 1461325281.782,
			"body": "office2016如何下载我就不多说了，zeronet里也有相关链接。实在找不到可以到下面的地址下载。https://dl.dropboxusercontent.com/u/90422302/YouTube/dloffice2016.html这个是英文版，可以到官网下载语言包，就会变成中文版。\n安装好之后，访问下面的网址：\nhttps://dl.dropboxusercontent.com/u/90422302/YouTube/mso2k16_proplus.txt\n把这个网址里的全部内容拷贝到文本文件当中，\n然后另存为123.cmd（后缀名是cmd）\n然后以管理员身份运行123.cmd，就大功告成了。"
		},
		{
			"post_id": 9,
			"title": "骂脏话能让人放松吗？",
			"date_published": 1461299750.832,
			"body": "原文地址：http://www.bbc.com/ukchina/simp/vert_cap/2016/04/160421_vert_cap_can-swearing-make-you-more-relaxed.shtml?ocid=socialflow_twitter\n警告：本文的一些激烈用语可能会让一些读者感到不适。\n在办公室度过了让人崩溃的一天，很多人需要发泄一下。一些人会选择去健身房，通过排汗来释放愤怒。另一些人则去酒吧，和朋友边喝酒边发泄。但是，释放压力最好的方法会不会是这两种方式的结合体？\n在加拿大卡尔加里（Calgary）的一家酒吧里，受到鼓励之后，瑜伽爱好者们给这种古代艺术增添了新的变化：愤怒瑜伽（Rage Yoga）。这种新的概念颠覆了安静、禅意的瑜伽课氛围——参加者会被鼓励在动作的间隙咒骂、喊叫，之后留下来喝啤酒。\n当你创造了真正可以释放自我的空间，你就不太会严肃对待自己和自己的问题。\n是的，这是真的，我们也欢迎脏话。根据该公司的网站，你在课上会听到“脏话、大笑和胡诌”，它把拉伸、姿势练习和坏脾气结合起来，目的是让身体更加健康。一小时的课要花12加拿大元（9.2美元），还包括2张啤酒打折券。\n这种瑜伽的创建者是24岁的林赛·伊斯塔斯（Lindsay Istace），她是柔韧性和健身教练。在一次很糟糕的分手后，她碰巧想到了把瑜伽体位法（瑜伽的姿势和动作）和泄愤结合起来。“我当时的心情跌落谷底，” 伊斯塔斯解释道，“我受到了很大的伤害，感到愤怒，不知所措。”一不留神，她发现自己一边在做日常的瑜伽练习，一边开始咒骂。\nImage copyrightGetty\nImage caption\n土耳其示威者在示威抗议活动中做瑜伽宣泄压力和愤怒。（图片来源：Getty Images）\n瑜伽和冥想的益处在大量文献中都有记载——它能帮助人控制压力，提高注意力和整体的健康水平。确实，很多公司现在都鼓励瑜伽和冥想。但是咒骂呢？让人惊讶的是，它正在流行起来。研究表明，粗话可以增加我们对疼痛的承受力，让我们在工作中更有说服力，在一些群体中，它还能带来凝聚力。那么，把幽默感、内心的安宁和咒骂结合起来能否开辟一条通往个体平静和专注力的新路径？它能否帮助我们应对工作压力和日常生活？\n安全的地方\n伊斯塔斯说咒骂帮助她在安全的环境下释放负面情绪。“我先是喊叫，骂人，然后哭，最后笑自己。当你创造了真正可以释放自我的空间，你就不太会严肃对待自己和自己的问题。”\n她和朋友说到愤怒瑜伽的想法时，大家一起笑了。之后，她就决定开一次研讨会。研讨会取得了巨大的成功。于是，她设计了一项针对下班后人群的课程。伊斯塔斯说这个想法已经步入正轨。“这个很酷的概念似乎与人们息息相关。所以，一开始我们当它是个笑话，但是做了几次之后，我们意识到它确实有特别之处。”\n课程在平静、平和的气氛中开始，然后伊斯塔斯让学员“释放一天中全部的抑郁”。整节课都充斥着咒骂。“在课程结束时，我们也不再说印度问候语‘namaste’，而是说‘太他妈好了。’”伊斯塔斯说。\nImage copyrightGetty\nImage caption\n大多数瑜伽课程教人在平和、安静的状态下放松自己——但是，如果喊叫和咒骂也有帮助的话呢？（图片来源：Getty Images）\n懂得把平静、愚蠢和咒骂结合起来，培养专注力的不止伊斯塔斯一人。在旧金山生活的作家、导演简森·黑德利（Jason Headley）创作了一部名为“操他的：一次真诚的冥想”（F*ck That: An Honest Meditation）、观看次数达到650万次的YouTube视频。创作的起因是他和妻子调侃一段冥想指导录影中舒缓的语调。\n“我专心模仿那个人的声音，”黑德利在电子邮件中写道，“然后我开始在家里到处学那个声音，只是为了逗乐我们自己。一天我的妻子为一件事情烦闷，我就用平静、舒缓的声音和她说，‘承认吧，所有那些破事就是他妈的扯淡。’然后我们都大笑，我们说，‘也许这里面有点蹊跷。’”\n于是，黑德利写了一个脚本，修改以后进行了录制。“我希望舒缓和咒骂的成分恰到好处。弄好以后，我在2015年7月把视频传到YouTube上，它立刻火了。”\n平静和科学\n专注力和健康的潮流——包括冥想应用HeadSpace、像Daybreaker那样的工作前的聚会活动、各类瑜伽以及大量的图书、杂志、研讨会和辅助营养品——为那些靠禅道赚钱的人带来了丰厚的报酬。\n那么，专注咒骂和用语言表达愤怒真的对你有好处吗？\n美国行业研究公司IBIS World的一份报告显示2015年美国的另类医疗收入已经达到133亿美元。其中，冥想接近10亿美元，占行业总收入的7.4%，瑜伽占15.1%，深呼吸练习占15.3%。\n大多数另类医疗都关注正面导向。那么，专注咒骂和用语言表达愤怒真的对你有好处吗？虽然没有研究专门讨论这个话题，但是其他研究表明它可能对你有益。\n一项研究表明，咒骂并不总是负面的，即使在工作场合也是这样。而2003年研究者对新西兰一家肥皂工厂的研究发现，在一些情境下，工人在一起骂人能产生某种凝聚力。\nImage copyrightGetty\n基尔大学（Keele University）的心理学家、博士理查德·史蒂芬斯（Richard Stephens）所带领的团队进行了一项研究，发现咒骂可以让我们更有说服力，增加我们对疼痛的承受力，尤其是那些在日常生活中很少咒骂的人。原因是？咒骂似乎会激发“战斗或逃跑”的压力反应。\n“有证据把咒骂与大脑的一些区域联系起来，而那不是通常处理语言的区域，”《Black Sheep: The Hidden Benefits of Being Bad》（“害群之马：恶人亦善”）的作者史蒂芬斯说。\n虽然史蒂芬斯和他的团队发布的数据是关于生理疼痛，不是心理的痛苦或焦虑，但是他说咒骂的减压功能是成立的，有必要进行深入研究。“它理应发挥功能。”他说，“人们在情绪化时会骂人，这和人在疼痛的时候是一样的。”\n把专注和咒骂结合起来的想法很有创造力，他补充说。\n“咒骂一旦披上新的外衣就有了一定的声望。”史蒂芬斯博士说，“表演者有时候可以骂一句，获得观众的反应，但如果你过度使用，这种反应就会停止。”同样道理，在放松的情境下，你不会预期听到那种话，所以它有一种让人震惊的力量。他说。他还补充说，在脱离情境时听到咒骂会让人发笑，这本身就有放松的作用。\n全球共鸣\n尽管黑德利和伊斯塔斯的理念一开始可能会被人嘲笑，但是它们在一些人中获得了共鸣。\n这真是以积极的方式利用消极情绪的极好方法。\n黑德利的冥想总是妙趣横生。“这不是开冥想或专注力的玩笑，而是开人的局限的玩笑。冥想指导者会说这样一些话，‘清空你的大脑。’我对此感到震惊。我该如何清空大脑？我的脑子里总是装满了各种想法、日程、情绪和些许愤怒。” 黑德利说。\n让黑德利惊讶的是，他的真诚的冥想得到了大量积极的好评。“人们开始说他们觉得这种‘冥想’真的很有帮助。他们想要时间更长的版本，所以我做了一款应用。”黑德利题为《操他的：一次真诚的冥想》的新书将在4月由企鹅兰登出版公司出版。\n类似地，愤怒瑜伽也建立起了一个强大的粉丝团，伊斯塔斯说。她吸引了媒体的注意力，来自俄罗斯、英国和南非的各种询问也接踵而至，于是伊斯塔斯发起了名为Kickstarter的活动，要为在线课程的开发募集资金（第一项课程将被命名为Bendy and Badass）。她还希望8月在加拿大进行一次愤怒瑜伽巡回讲座。\n“这真是以积极的方式利用消极情绪的极好方法。”她说，“它有很强的建设性。”"
		},
		{
			"post_id": 8,
			"title": "Free VPN integrated in Opera for better online privacy",
			"date_published": 1461284677,
			"body": "Today, we want to share with you another big thing that you will first see in the developer channel for Opera for computers.\n\nWe are the first major browser maker to integrate an unlimited and free VPN or virtual private network. Now, you don’t have to download VPN extensions or pay for VPN subscriptions to access blocked websites and to shield your browsing when on public Wi-Fi.\n\nVPN settings\n\nWhy we are adding free VPN in Opera\n\nBringing this important privacy improvement marks another step in building a browser that matches up to people’s expectations in 2016. When you think about it, many popular options offered by desktop browsers today were invented (quite frequently by Opera) many years ago. The innovation energy in the industry has been recently so focused on mobile, even if the desktop is still thriving.\n\nIn January, we were reviewing our product plans, and we realized that people need new features in order to browse the web efficiently in 2016. It also became apparent to us that what people need are not the same features that were relevant for their browsers ten years ago. This is why we today have more engineers than ever before working on new features for our desktop browser.\n\nSo far we have the native ad blocker. And, we’re introducing another major feature in just a matter of a few weeks; a native, unlimited and free VPN client, right inside your browser!\n\nVPN enabled popup\n\nEnhanced privacy online with Opera’s free VPN\n\nAccording to Global Web Index*, more than half a billion people (24% of the world’s internet population) have tried or are currently using VPN services. According to the research, the primary reasons for people to use a VPN are:\n\n– To access better entertainment content (38%)\n– To keep anonymity while browsing (30%)\n– To access restricted networks and sites in my country (28%)\n– To access restricted sites at work (27%)\n– To communicate with friends/family abroad (24%)\n– To access restricted news websites in my country (22%)\n\nAccording to the research, young people are leading the way when it comes to VPN usage, with almost one third of people between 16-34 having used a VPN.\n\n\nBetter than traditional VPNs\n\nUntil now, most VPN services and proxy servers have been limited and based on a paid subscription. With a free, unlimited, native VPN that just works out-of-the-box and doesn’t require any subscription, Opera wants to make VPNs available to everyone.\n\nThat’s why Opera’s built-in free VPN feature is easy to use. To activate it, Mac users just need to click the Opera menu, select “Preferences” and toggle the feature VPN on, while Windows and Linux users need to go to the “Privacy and Security” section in “Settings” and enable VPN there. A button will appear in the browser address field, from which the user can see and change location (more locations will appear later), check whether their IP is exposed and review statistics for their data used. It’s free and unlimited to use, yet it offers several must-have options available in paid VPNs, such as:\n\nHide your IP address – Opera will replace your IP address with a virtual IP address, so it’s harder for sites to track your location and identify your computer. This means you can browse the web more privately.\nUnblocking of firewalls and websites – Many countries, schools and workplaces block video-streaming sites, social networks and other services. By using a VPN you can access your favorite content, no matter where you are.\nPublic Wi-Fi security – When you’re surfing the web on public Wi-Fi, intruders can easily sniff data. By using a VPN, you can improve the security of your personal information.\nVPN enabled\n\nLet us know what you think\n\nDownload Opera 38 developer and give the free, unlimited VPN a try. BTW: beyond our native ad blocker and VPN, you can expect more exciting features to come very soon.\n\nOther changes\n\nVideo pop-up\n\nThis feature has been extensively described here. It is now present in developer, too. Enjoy!\n\nAdd your own photo as theme\n\nSome time ago, we introduced the “Create your theme” option in the theme manager. It turned out, though, that the option was not visible enough for users. Now just go to Customize startpage and click ‘+’ button and use your own photos to create a theme.\n\nExtension button visible on the Speed Dial side panel\n\nAll extension users will have the extension manager always handy. The extension icon is visible on side panel on the left side of the Speed Dial page.\n\nSupport for adding a personal ad blocker list\n\nOur ad blocker now contains support for adding your own block lists. To add your own custom list file, head to Settings and click the ‘Custom Block Lists’ button in the ad-blocking section (note that ‘Show advanced settings’ from the ‘Browser’ panel must be enabled to see the button).\nThe lists have to be in EasyList-style format, and you can use existing lists such as the EasyList affiliate lists to ensure you get to block all that you want. As a reminder, Opera itself provides a block list based on the publicly available EasyList and EasyPrivacy.\n\nSpeed Dial improvements\n\nDid you ever remove your speed dial accidentally? Now you won’t. You’ll notice three little dots on hover in place where close button used to be. It has the same content as context menu, so you can open, edit or remove speed dial.\n\nInstallation links:\n\nOpera developer for Windows\nOpera developer for Mac\nOpera developer for 32-bit Linux – deb file\nOpera developer for 64-bit Linux – deb file\nOpera developer for 32-bit Linux – RPM file\nOpera developer for 64-bit Linux – RPM file\nChangelog: Full changelog link\n\n \n\n* “VPNs Proxy Servers”, GWI Trends Q4 2015, 2015"
		},
		{
			"post_id": 7,
			"title": "利用carina搭建vps已经行不通了",
			"date_published": 1461283008.338,
			"body": "今天早上收到carina的邮件，内容如下：\n\n大体意思是ss占用了他们的带宽。比较温馨的是居然还提供了翻墙的替代方案——内置vpn的opera浏览器。\nYour Carina account has been suspended!\nWe've found that your account was running an instance of Shadowsocks. In combination with other instances this lead to a very high level of bandwidth consumption. As a result other Carina users were impacted negatively.\n\nAdditionally it is a violation of Rackspace's Global Acceptable Use Policy (AUP) to \"cloak identity or contact information, including the omission, deletion, forgery or misreporting of any transmission or identification information, such as return mailing and IP addresses\".\n\nGiven the impact to users and our AUP, we decided to disable your account. If you feel like we've disabled your account in error please contact us via the carina-support email.\n\nAs an alternative to running Shadowsocks on Carina, you may want to take a look at Opera's new free VPN, which is build right into the browser.\nThanks,\nThe Carina team"
		},
		{
			"post_id": 6,
			"title": "介绍一个p2p资源搜索引擎",
			"date_published": 1461282902,
			"body": "http://engiy.com/\n亲测还是不错，唯一的问题就是下载资源的人太少，下载起来太费劲。当然，这也不是搜索引擎的问题。"
		},
		{
			"post_id": 5,
			"title": "如果生活强奸了你，你为什么不顺便给它生个孩子?",
			"date_published": 1461114902,
			"body": "《冰与火之歌》里，史塔克家族有一句口头禅，叫凛冬将至。马丁老爷子写了将近二十年，出书五卷，史塔克家族都快被他写绝种了，这个凛冬依旧在姗姗来迟的路上。为什么呢？因为秋收冬藏啊。春天是开始得瑟，夏天是使劲得瑟，秋天是最后的得瑟，冬天是什么呢？是得瑟不起来了吗？我可是个乐观主义者，所以冬天其实是孕育得瑟。生命在于得瑟，冬天就是孕育生命的季节。我好爱冬天的样子有木有？\n前两天微信上有好事者整理了最近几年报纸上关于我国经济状况的开年报道。从2011年开始，就是“这将是中国经济最困难的一年”。然后这“最困难”一直持续到2016年。有人表示看不懂，质问到底哪一年最困难？不要那么呆萌了好不好，这明摆着就是一年比一年困难嘛。马丁老爷子写个凛冬将至都能写上二十年，我们才“困难”了不到五年，有点耐心好不好。凛冬将至和凛冬已至完全是两个概念，经济下行和经济崩溃还有着十万八千里的距离呢。这就好比高空跳伞，只要伞能打开，那一溜儿的高空坠落玩得就是心跳，就算伞打不开，那也得脑袋触地，才能定性为惨案。\n好吧，我就别装得像个经济学家似的了，其实我对经济一窍不通，也不感兴趣，反正经济好坏我挣的也就那仨瓜俩枣，以饿不死为限度，我现在应该感恩戴德才对。我感兴趣的只是人的心态，说实话，这个世界上没有什么比研究人的意识形态更有意思的了。世间万事，风起云涌，波云诡谲，背后穿插的都是人的意识形态。之前我写过《精细化管理正在扼杀我们的创造力与效率》，其实更早之前，我还写过一系列的《谈谈管理》呢。后来写不下去是因为我发现关于管理的认识，从一开始就是不靠谱的。大部分人对于管理的认识不过停留于制度层面，各种狗屁规定就不提了，即便是制礼、制乐、立法、修宪，也早被历史的发展证明是乱之源，祸之首。还是那句话，制度真的那么牛逼，那些有钱有品牌的大公司就该万古长青才对，取得统治地位的宗教或执政党也该真的万岁万岁万万岁才对。而事实惨不忍睹，越是制度完善的公司，死得越快；越是法制健全的国家，乱得越凶。这背后的原因你不搞清楚，围绕制度建设你写一万本管理手册又有个卵用？\n一切都是认识上的偏差。这么武断的结论霸气侧漏有木有？反正你也不懂，干嘛不装逼！\n作为一个管理者，你最喜欢什么？当然是井井有条对不对。你废了那么大劲儿，搞了各种龟腚，还不是为了一切都井然有序？你用制度约束人的目的是什么？秩序对不对？确定性有木有？防止一切意外，一切出轨，一切混乱，如果有可能，你希望太阳都按着你的意思转有木有？你把一切都纳入轨道，分门别类，有条不紊，看到开头，不用猜就知道了结尾，这么确定和明晰，你觉得你的管理很到家是不是？你觉得你的制度建设很成功对不对？你觉得你为组织的发展贡献了青春，奉献了热血，挥洒了汗水有木有？\n知道我想告诉你什么吗？你的确贡献了青春，奉献了热血，挥洒了汗水，只不过不是为了组织的发展，而是为了组织的死亡。你在不遗余力地杀死自己的组织，还沾沾自喜，自鸣得意！\n1975年的二月底，德国有一个17岁的小姑娘叫布兰德斯，作为当时德国最年轻的音乐会发起人，她竭尽全力安排好每一个细节。她甚至成功的邀请到美国著名钢琴家凯斯杰瑞。但她毕竟是个新手，竭尽全力不代表每一个细节都能安排得当。当杰瑞到了现场之后，发现供他演奏的钢琴又老又旧，他尝试着调了几个音之后，怒气冲天的向布兰德斯提出，要么找一架新钢琴，要么他拒绝表演。布兰德斯打遍了所有电话，在有限的时间里，她除了能叫到一个调音师外，根本搞不到一架新钢琴。无奈的她只好站在雨地里向坐在汽车里的杰瑞恳求他不要离去。杰瑞被她感动了，按约定走上舞台，开始用那架老旧的钢琴演奏。为了避开那些坏掉的钢琴键，杰瑞努力把音调控制在中间调，由于钢琴相对于整个音乐大礼堂太小，音量不足以让全场的人听得清楚，杰瑞还要站着扭曲身体狠狠敲击按键，他怪异的姿势让观众感觉他充满了激情，而演奏的那首乐曲，也让人耳目一新，作为一首爵士乐曲，中间调散发的舒缓和平和打动了所有观众，最后的奇迹是，这场音乐会成为杰瑞有史以来卖得最好的爵士乐专辑。\n嗯，通过这个故事，我想说的是，井井有条只是人们单纯的愿望，而现实充满了意外。而当你遭遇意外的时候，本能会让你选择逃避，就像杰瑞耍大牌一样怒气冲天地钻进汽车要绝尘而去。而另一种违背本能的选择则是拥抱意外，那可能让你很不爽，但是请你仔细回忆，你人生的每一次值得留恋的奇迹，是发生在你很爽的状态下的？意外、混乱、不确定性这些在直觉上让你不爽的东西，其实有可能正是对你最有裨益的东西，因为正是混乱、意外和不确定性，导致了充满无限可能的“创新”。\n好吧，我们终于提到了“创新”，在经济最低迷的时代，呼声最高的就是“创新”。而对于“新”究竟是不是“创”出来的，我持怀疑态度。因为“创”意味着主动性和确定性，一切尽在掌握的赶脚，而一切尽在掌握的“有条不紊”，又有何新意可言呢？什么是新？意外就是新，混乱就是新，不确定性也是新。习惯了制度和秩序的人们，最恐惧的就是“新”，你让他们用制度和秩序去创造新，还有比这更不靠谱的事情吗？\n其实，这一篇的题目，我本来想叫《混沌是诱发创新性的最好状态》。不过这种专业性词汇会把所有人都吓得失去继续阅读的兴趣。有人曾经说你为什么满嘴脏话毫无斯文可言？因为你们都爱听脏话啊。我难道不是在迎合你们的需求吗？如果你真的那么喜爱斯文，为什么老师讲课的时候你会昏昏欲睡呢？各种礼乐法制把你打扮的像个花枝招展的淑女，其实内心还保留着婊子的狂野有木有？这个世界看似井然有序，内里掩盖的确是混乱和躁动，这让你很不安对不对，但为什么不积极乐观一点呢？每一次混乱难道不是一场全新的体验吗？叶公好龙和国家提倡创新听起来高度一致有木有？对于个人而言，如果被强奸不可避免，我看你还是准备生个孩子更靠谱。\n"
		},
		{
			"post_id": 4,
			"title": "要么放手，要么放弃\n",
			"date_published": 1461025143.911,
			"body": "三国时期，刘备从袁绍那跑路到刘表那里。刘表和陶谦一样，深深地被刘备的仁义无双所折服，所以没事就喜欢和刘备掏心窝子。有一天酒喝高了，就透漏了自己废长立幼的打算，刘备一听，就坦诚地告诉刘表，废长立幼，乱之源也。当然刘备马上就意识到自己犯了一个致命错误，不是他的见解有错，而是因为他寄居人下，犯了疏不间亲的错误。\n在王权时代，废长立幼等同于自乱其序。对于一个独裁者而言，没有什么比建立稳定的秩序更重要的了。所谓人心思定，只要能把人们的意识形态稳定在一个状态，那么就万事OK，如果人心不稳，马上就会祸乱纷争。王室就如同整个社会的大脑，废长立幼等同于让大脑精神错乱，直接导致整个社会精神病发作。\n权力只能有一个中心。我想所有的独裁者都认可这个道理并利用其来为自己的独裁而辩护。但在我看来，最不懂这句话的，恰恰就是独裁者。\n正因为权力只有一个中心，所以才要懂的放权和放手。如果每一个免疫球蛋白捕杀外源病菌的时候都要向大脑汇报，那么我想不用等到外源病菌侵占我们的肌体，大脑就已经先崩溃了。所以权力只有一个中心这句话本身没错，错的地方在于，没有给权力加一个范围。任何有点常识的人都下意识的给自己一个划一个圈子，平时的决策啊，活动啊什么的一般都不会超越这个圈子，所谓越界则危，话说您要是被一个陌生人靠太近，马上就会感觉非常不舒服。这世上大概也只有金三胖才敢号称自己是宇宙强国，自信来源于无知，没圈子，没底线，没范围，就不会知止，知止不殆，不知止，你懂的。\n我们来看太阳系，圈子划定在太阳系，那么的确只有一个中心，这个中心就是太阳。但如果范围超越了太阳系，你会发现有无数个太阳。所以任何中心，都是固定范围里的中心，同理可推，任何权力，都是一定范围内的权力。在这个权力范围内，有并且应该只能有一个中心。\n有人跳出来反对，说你丫天文学没学好，请问双体或三体问题何解？\n客官莫急，我话还没说完。在一个特定范围内，有且只应有一个中心，才能政令畅通，秩序井然。天无二日，国无二主，只是保证国泰民安的必要条件，如果不在乎国泰民安，那么天也可以十日并出，国也可以诸侯纷乱。所以你别拿三体问题吓唬我，老祖宗记录了十体现象，可惜都被我们当成荒诞不经的神话。\n所以在宇宙的尺度，由于其大无外，大到没边儿，就不存在范围的问题，既然没有范围，那么，如何管理呢？答案是，没范围，也就没中心。这就是去中心化的由来。当我们要越界做事的时候，“中心”会成为自身最大的障碍，而一个有效的管理模式就是多中心并存互联的网格结构，在一个网状结构当中，不存在一个实际意义上的中心，但是，却又处处都是中心，每一个网络节点，都是中心。所以去中心化，其实就是多中心化。我们的古人把这种其大无外，其小无内的超越范围界限的管理虚拟成一个“中心化的形象”，称之为“道”。道无形无相，却无处不在，统御了所有事物的发展运行。如果把道抽象为一种管理模式，那么没有什么比这种多中心的网格结构更接近的了。\n道的最大特征是什么？是静定。说白了就是不折腾。太阳系爱怎么折腾就怎么折腾，道不会横加干涉，它不会告诉太阳是该正着转，还是反着转，也不会因为看着太阳太丑陋，就硬塞进另外一个太阳进来。无论太阳系怎么折腾，最终都会化为宇宙秩序的一部分。我们人类太渺小，无法理解这种无为之治和不言之教，所以只能从最表象的层面上去归纳，最后能找出的一个似是而非的特征表象就是“信”，宇宙大道对太阳系赋予了最高的信任，在这种信任机制下，才会任凭其折腾而不加干涉。\n这里需要注意的是，信是我们人为描述的一种道的表象，信不是道，甚至可能什么都不是。但我们人类最爱的，不就是折腾这些虚无的概念吗？只因把握不了实质，才爱玩弄各种概念。所以其实像我这样夸夸其谈的，都是不得要领的傻逼。\n所以在我们人类的层级社会里，为什么上级总爱干涉下级?不干涉何以体现“领导”？但更本质的原因，来自于不信。上下级之间没有基本的信任，然后就产生了严重的内耗。\n然后另一个问题诞生了，你想想你为什么不信任别人？人心隔肚皮啦，道德沦丧啦，别跟我扯这些乌七八糟的概念，你不信任别人，很简单，因为你不自信。\n一个连自己都信不过的人，你能指望他信任别人？\n刘邦为什么能用韩信？因为刘邦自信。刘备为什么能用孔明？因为刘备自信。你为什么在这听我吹牛逼，因为你不自信。然后另一个问题接踵而至，自信打哪里来？\n自信从恍惚中来。何谓恍惚，能静能定就能恍惚。老子云：“惚兮恍兮，其中有象；恍兮惚兮，其中有物。窈兮冥兮，其中有精；其精甚真，其中有信。”听起来很玄妙是吧?那么我问你:什么是自由？\n有同学说，自由就是想干什么就干什么。这位同学，你的答案给了秦始皇建长城最好的借口。\n自由是不想干什么就不干什么。比如说，你不想再想那些烦心事儿了，你做得到吗？你能把你的女神从意识里抹除吗？你做不到，所以你不自由。\n通常来讲，人们普遍都会感觉工作很累，总想放假。但是一旦放假，却发现比工作更累。忙着旅游，忙着吃喝，忙着聚会，忙着看电视……总之，你想让你不忙，你做不到。你不自由。\n有人说我玩我开心啊。你真的开心？还是你只不过想逃避不开心？无论是工作，还是不工作，你都不停的折腾，忙这忙那，一刻也不曾让自己消停下来。你有没有想过，你是喜欢忙，还是害怕不忙?\n让我更直白一点： 你可曾真的素面直对自己的空虚与寂寞？你能让自己不去忙这忙那，想东想西吗？你不能，你不自由。\n有人说妈蛋你装毛逼啊，就他妈好像你能做到似的。我的确做不到，我能做到就不在这瞎比比了。不过人不能因为有了凤姐就无视自己的丑陋对吧？话说凤姐让全民那么high，难道不是因为你内心那点自卑的优越感吗？\n别人是大丑逼的事实改变不了你自己是大丑逼的事实！！！一码归一码。\n有人又说了，那你他妈啰里吧嗦叨逼叨这么多想干嘛？很简单，我想论证一下管理的最基本原则在于放手。谈管理太大，有装逼的嫌疑，而且还要为尊者讳。所以不妨说成教育。比如家长带孩子。很多人肯定对这个话题感兴趣，朋友圈各种孩子秀就是明证。\n你看现在的家长带孩子，各种保护，无微不至。含在口里怕化了，捧在手里怕掉了，搞得我天天怀疑人生，妈蛋当年老子是怎么活过来的，没理由啊？\n在孩子的世界里，有并且应该只有一个中心，那就是孩子自己。你看他学个脚踏车，家长也要用手扶着车把，妈蛋我严重怀疑那孩子摔跤就是因为你动了他的车把。\n说到脚踏车，我忽然又想起学驾照的事。估计大多人感同身受。那教练坐在副驾驶上，你不动他骂，你要是动了，他骂得更凶，反正要是不把你搞到昏头昏脑，完全不知道怎么开的状态，人家教练就不算称职。我严重怀疑驾校其实是一个阴谋，他不是教你如何开车的，是教你如何出车祸的。\n说完驾校，咱再说点高科技的，Google的无人驾驶汽车。话说Google X刚开始研发无人驾驶汽车的时候，也严重怀疑人工智能的可靠性。为此，他们最初的研发方案是在现有人为驾驶汽车的基础上加入智能控制系统。也就是说，车虽然由人工智能开动，但是紧急情况，乘客或者说司机可以操控方向盘和刹车来直接介入并中断人工智能的控制。这听起来很符合我们中国人的逻辑，有操纵感嘛，大权在握，紧急情况下重新夺权上位。胡服骑射的赵武灵王就是这么干的，自己四十来岁就退居二线，让孩子接班，然后又退而不休，总觉得自己特英明，儿子处理问题太奶无，图样图森破，于是啥事都想插一杠子，插上瘾了还想重新执政，这还能消停，太上皇让位，接班人本来挺感恩，这退而不休，恩马上就变成仇了。\n继续说无人驾驶。无人驾驶最让人怀疑的地方，就是安全性。为什么呢？因为人类天生都很自负，总觉得自己是最牛逼的，机器人怎么能比自己优秀呢？所以他自己出多少车祸都不要紧，机器人要是出一例车祸，他就能抓住不放，大做文章。所以Google的策略是，在投放市场之前，要经过尽可能长的时间来测试。他们研发的无人驾驶汽车在美国三个城市已经不间断运行了将近一年。刚开始还确实有纰漏，发生刮蹭事件。然后他们就研究总结，结果发现，所有的刮蹭事件，都是因为在紧急情况下，司机突然接手控制权，人工智能被中断所导致的。\n然后问题就很简单了，Google把原来的设计全部推翻，重新设计了一款车，这车没有方向盘，没有脚踏板，没有任何人为控制的东西，完全由内嵌的人工智能来掌握，结果呢？结果这款车目前已经不间断运行将近200多天了，一次意外也没发生。\n所以呢，不是人工智能值得信赖，而是因为你信赖人工智能，它才真的智能。有人说，阿尔法狗下棋都战胜人类了，人工智能会不会真的有一天要奴役人类啊？我给你的回答是，只要人类这么想，将来一定会被人工智能所奴役。不是人工智能要去奴役你，而是你自己在奴役自己。\n为什么呢？因为你不自由。要么放手，要么放弃，所有的真谛，也不过就这么两句话了！"
		},
		{
			"post_id": 3,
			"title": "秦始皇为什么修长城",
			"date_published": 1460945210.192,
			"body": "因为要抵御匈奴。这是标准的历史课本答案。\n然后问题来了，一道破墙真的能挡得住匈奴铁骑？刘邦表示不服，汉武帝表示不服，五胡乱华表示不服，李世民表示不服，宋徽宗表示不服，忽必烈表示不服，皇太极表示不服……八国联军和小日本也表示不服。反正只要你翻翻历史，就会发现自打这道破墙建起来之后，“匈奴”们忽然气焰高涨了许多，动不动就玩一样横扫我华夏大地。倒是秦始皇建长城之前，祖国未能一统，内乱频仍，倒不曾听说有哪个匈奴敢跑到华夏大地上叫嚣，反倒是我华夏的秦、赵、燕不停的欺负人家。\n然后，然后问题就很清楚了，长城根本就不是用来防御匈奴的。因为秦始皇根本就没怕过匈奴。别说统一六国的秦始皇，大秦帝国上下近七百年，数十位帝王又有谁怕过匈奴？想当初秦非子为周孝王养马养的很尽心尽力，官封弼马温，对不起，搞差了，应该是分封诸侯，一个屌丝终于咸鱼翻身，偏安于祖国的西南角，默默地看着中原各路高富帅流口水。由于打不过高富帅，没事的时候就只能拿匈奴练手。周幽王引火烧身，引狼入室之后，秦襄公终于一展身手，打得犬戎满地找牙，华丽丽地在周平王面前搏了一个满堂彩。周平王被秦襄公的七彩祥云亮瞎了钛合金眼，一糊涂就把周王朝龙兴凤鸣之地分封给了襄公，自此之后，秦国远离中原纷争，闷头在自家地里闭关修炼，把匈奴当成了陪练的怪兽，没事就去打怪升级。\n所以，从秦国创立之初，就一直以揍匈奴为基本娱乐活动之一，要说秦始皇怕匈奴，简直是天大的笑话。那么，绵延万里的长城到底是干球用的？\n回答这个问题之前，咱先来看看朝鲜。去过朝鲜的人应该都注意到一个现象，就是凡是和中国交界的山脉，都是光秃秃一棵树也没有，山下也没有任何树林，而进入朝鲜腹地，则山深林密，生态环保的不要不要地。为毛会这样捏？因为朝鲜人民军放火烧山，特意营造这么一片开阔的边境视野。有人说了，弄这么开阔的视野，难道是为了在山洞里能一目了然地观察友军动态吗？你也太高看朝鲜人民军了，假设友军真的要揍他，就算让他观察到，难道他还能抵挡得住不成？这开阔的视野，不是用来观察友军的，而是用来监视同胞的。因为总有那么多要肚皮不要脸皮的叛徒、走资派、美分抛弃革命理想和爱国情怀，想跨境投入敌人怀抱。\n对于三胖来说，外面的世界管不了，自家一亩三分地还管不了吗？打不过西门庆，总能按得住潘金莲吧。只要潘金莲出不了门，西门庆就算潘驴邓小闲五事俱全，也只能瞅着窗户干瞪眼。\n看明白了朝鲜，回头再看秦始皇的长城，答案就呼之欲出了。能够四处征伐的匈奴军队，逢山开路，遇水搭桥，小小一道城墙自然阻挡不了他们侵袭的脚步，但是对于墙内的老百姓而言，想翻阅这一道高墙恐怕就有如登天之难了。所以秦始皇修长城，不是拒匈奴，而是怕老百姓跟着匈奴跑到塞外去。\n有人说我大中华地大物博，居住环境优越，老百姓怎么会舍得这么优越的自然环境跑到塞外受那风寒之苦？这位仁兄敢是没听孔圣人说过苛政猛于虎也。秦政苛到什么程度，你不了解，秦始皇和秦国的百姓却是了解的。秦始皇在位短短三十七年，中灭六国、北击匈奴、南征百越、筑万里长城、筑灵渠、修骊山陵、建阿房宫……看看这些大项目、大工程，咱先别提辉煌的事，咱先算算经济账，这他妈得需要多少钱？而这些钱就要秦国人民在这短短三十七年内默默的付出与承受。把这些苛捐杂税压到你头上，但凡有条活路，你不跑路？\n不跑才怪。秦始皇也是这么想的。都跑了上哪搞钱去？还有那么多宏图伟业没实现呢。上手段。于是长城诞生了。\n所以说，秦国对匈奴还是有一点畏惧的，不是畏惧匈奴兵力强盛，而是畏惧匈奴仁政爱民，对本国人民的吸引力太大。有人说你他妈瞎比比，匈奴凶暴残忍地球人都知道，到你这里咋就成了仁政爱民了？各位爱国青年，爱国的情怀可以理解，但事实可是要看数据的。残暴与否那是一个对比结果，老子不是说了吗，天地不仁，以万物为刍狗。如果没有对比，老天爷就是一个残暴不仁的家伙，但是有了圣人做对比，老天爷就显得很仁义了。所谓的匈奴残暴，也不过是侵略边境，杀人放火，打仗哪有不死人的。和白起一战坑四十万赵军相比，匈奴是不是够仁义了？各位一听到南京大屠杀就怒火中烧，血气翻涌，却没人关注被消灭掉的八百万国军，所谓杀敌一千，自损八百，能歼敌八百万，自身伤亡也得有个四百万吧，那你算算死了多少人？\n秦国对匈奴仁政的担心，可不是我信口胡诌，这在历史上是有记载的。早在秦穆公时期，匈奴王就派了一个叫由余的家伙出使秦国，穆公为了彰我国威，领着由余参观各种高楼大厦，由余不解，就问穆公说大王您搞这么多大项目是靠谁来建设呢？要是靠鬼，那您得请神拜佛麻烦神仙们；要是靠老百姓，你丫这不是典型的劳民伤财吗？穆公从来没见过还有站在老百姓角度施政的理念，这种理念只存在于三皇五帝的传说当中，平时也就当个故事听听，谁他妈当真啊，结果这次听由余一说，穆公立刻意识到，匈奴王搞得就是中原传说当中的圣人之治。这还了得，外面没有小白脸，打老婆还可以，这外面突然出现了风骚的帅哥，再打老婆就容易把老婆打跑了。于是穆公为此而闷闷不乐。然后百里奚就给他出主意，说匈奴那所谓的圣人之治，其实就是因为他们没见过世面，乡巴佬一个，因为没见过世面，所以心思才单纯，并不是真的就是圣人，搞翻他们很容易，文化侵蚀和平演变就够了。于是穆公就从国内挑选了一批美女演员和各色珍宝送给匈奴王，匈奴王果然就此乱了心，由余的劝谏也听不进去，直接导致由余叛变帮助秦国一统匈奴。\n我们来看看由余对穆公描述的匈奴政治：“礼乐法度，此乃中国所以乱也！自上圣创为文法，以约束百姓，仅仅小治。其后日渐骄淫。借礼乐之名，以粉饰其身；假法度之威，以督责其下。人民怨望，因生篡夺。若戎夷则不然。上含淳德以遇其下，下怀忠信以事其上。上下一体，无形迹之相欺，无文法之相扰。不见其治，乃为至治。”看见没有，匈奴那嘎达可是“上含淳德，下怀忠信。”正因为统治者有德，不会想着建设大项目，搞大工程，搞军备竞赛，所以对“财”的需求就不那么高，因此中央不会与民争利，也不会上各种手段把老百姓手里的资源都集中到自己手上。这样自然藏富于民，老百姓过得安心舒心，你说他能不向往这样的桃源生活吗？\n但是秦穆公当然不会责备自己德行太差，他只知道只要把外面的小白脸变成丑八怪，自己就是大帅哥一枚。于是他搞翻了匈奴王，然后还警告子孙们注意匈奴这个国外势力，别让他把自家老百姓给勾搭跑了。秦始皇北击匈奴但是不能一举灭之，没奈何，只好修个长城把自家媳妇看紧了。而且长城还可以阻断信息往来，万一哪天自己和姐夫在运河边上做了点见不得人的事被发现了，也不至于搞得长城内外都鸡飞狗跳。\n话说康熙重臣张廷玉的父亲张英，老家的亲戚建房子和邻居为了三尺的土地闹得不可开交。为此修书一封，求张英出面给邻居点颜色看看。张英看罢淡然一笑，回书只写了一首打油诗：“千里修书只为墙，让他三尺又何妨。万里长城今犹在，不见当年秦始皇。”本来这是彰显我华夏民族谦让宽容美德的一件事，在姜文的《鬼子来了》里，就变成了我华夏民族懦弱的曲证。这样曲解传统美德是不好滴。其实我华夏传统中谦让包容是有着内在风骨做支撑的，这在秦汉之前的士子文化当中表现尤为明显。当然，有关士子的血性和傲骨，等我们有时间再继续深聊。\n"
		}
	]
}