{
    "article": [
        {
            "title": "Community_gardening",
            "text": "{{Distinguish|Communal garden}}\n{{lead too short|date=November 2016}}\n[[Image:Community garden in Ottawa.jpg|thumb|300px|Strathcona Heights Community Garden in [[Ottawa]], [[Canada]]]]\n\nA '''community garden''' is a single piece of land [[gardening|garden]]ed [[collective]]ly by a group of people.<ref>{{cite web|url = http://www.communitygarden.org/learn/|title = What is a community garden?|archiveurl= https://web.archive.org/web/20071204082111/http://www.communitygarden.org/learn/ |archivedate= 2007-12-04 |website = American Community Garden Association}}</ref> Community gardens utilize either individual or shared plots on private or public land while producing fruit, vegetables, and/or plants grown for their attractive appearance. Around the world, community gardens can fulfill a variety of purposes such as aesthetic and community improvement, physical or mental well-being, or land conservation.\n\n==Background==\n[[File:South Central Farm 6.jpg|thumb|Crops at the former [[South Central Farm]] in [[Los Angeles]], [[California]], [[United States]]]]\n\nAccording to Marin Master Gardeners, \"a community garden is any piece of land gardened by a group of people, utilizing either individual or shared plots on private or public land\".<ref>{{citation|url=http://ucanr.edu/sites/MarinMG/Great_Gardening_Information/Marin_Community_Gardens/|archiveurl=https://web.archive.org/web/20160510091024/http://ucanr.edu/sites/MarinMG/Great_Gardening_Information/Marin_Community_Gardens/|archivedate=10 May 2016|publisher=University of California|title=Community Gardens|author=Marin Master Gardeners}}</ref> Community gardens provide fresh products and plants as well as contributing to a sense of community and connection to the environment and an opportunity for satisfying labor and neighborhood improvement.<ref>{{cite journal | last1 = Hannah | first1 = A.K. | last2 = Oh | first2 = P. | year = 2000 | title = Rethinking Urban Poverty: A look at Community Gardens | url = | journal = Bulletin of Science, Technology & Society | volume = 20 | issue = 3| pages = 207–216 | doi=10.1177/027046760002000308}}</ref> They are publicly functioning in terms of ownership, access, and management,<ref>{{cite journal | last1 = Ferris | first1 = J. | last2 = Norman | first2 = C. | last3 = Sempik | first3 = J. | year = 2001 | title = People, Land and Sustainability: Community Gardens and the Social Dimension of Sustainable Development | url = | journal = Social Policy and Administration | volume = 35 | issue = 5| pages = 559–568 | doi=10.1111/1467-9515.t01-1-00253}}</ref> as well as typically owned in trust by local governments or not for profit associations.\n\nCommunity gardens vary widely throughout the world. In North America, community gardens range from familiar \"[[victory garden]]\" areas where people grow small plots of vegetables, to large \"greening\" projects to preserve natural areas, to tiny street beautification planters on urban street corners. Some grow only flowers, others are nurtured communally and their bounty shared. There are even non-profits in many major cities that offer assistance to low-income families, children groups, and community organizations by helping them develop and grow their own gardens. In the UK and the rest of Europe, closely related \"[[allotment gardens]]\" can have dozens of plots, each measuring hundreds of square meters and rented by the same family for generations. In the developing world, commonly held land for small gardens is a familiar part of the landscape, even in urban areas, where they may function as [[market garden]]s. They also practice crop rotations with versatile plants such as peanuts, [[tomatoes]]<ref>{{cite web|title=Tomatoes Secrets|url=https://totallytomatoes.net/the-versatile-totally-tomatoes-fruit|accessdate=6 July 2015|url-status=dead|archiveurl=https://web.archive.org/web/20160117010208/http://totallytomatoes.net/the-versatile-totally-tomatoes-fruit|archivedate=17 January 2016}}</ref> and much more.\n\nCommunity gardens are often used in urban neighborhoods to alleviate the food desert effect. Food accessibility described in urban areas refers to residents who have limited access to fresh produce such as fruits and vegetables. [[Food desert]]s often serve lower-income neighborhoods usually in which residents are forced to rely on unhealthy food options such as expensive processed foods from convenience stores, gas stations, and fast-food restaurants. Community gardens provide accessibility for fresh food to be in closer proximity located in local neighborhoods. Community gardens can help expand the realm for ensuring residents’ access to healthy and affordable food in a community.<ref>{{Cite web|url=http://environment.yale.edu/yer/article/oases-in-the-urban-food-desert#gsc.tab=0|title=Oases in the urban 'food desert'? {{!}} Yale Environment Review|website=environment.yale.edu|language=en|access-date=2017-05-25}}</ref>\n\nCommunity gardens may help alleviate one effect of climate change, which is expected to cause a global decline in agricultural output, making fresh produce increasingly unaffordable.<ref name= \"autogenerated24\">Harris, E (2009). \"The role of community gardens in creating healthy communities\", Australian Planner, v. 46, no. 2 (June 2009) pp. 24–27.</ref> Community gardens are also an increasingly popular method of changing the built environment in order to promote health and wellness in the face of urbanization. The built environment has a wide range of positive and negative effects on the people who work, live, and play in a given area, including a person's chance of developing obesity <ref>Xu, Y., & Wang, F. (2015). Built environment and obesity by urbanicity in the U.S. Health & Place, 34, 19–29..</ref> Community gardens encourage an urban community's [[food security]], allowing citizens to grow their own food or for others to donate what they have grown.<ref name= \"autogenerated24\"/><ref>{{cite journal|last=Nelson|first=Toni|date=1 November 1996|title=Closing the nutrient loop: Using urban agriculture to increase food supply and reduce waste|journal=World Watch |volume=9|url=http://www.thefreelibrary.com/Closing+the+nutrient+loop.-a019034365| pages=10–17}}</ref> Advocates say locally grown food decreases a community's reliance on fossil fuels for transport of food from large agricultural areas and reduces a society's overall use of fossil fuels to drive in agricultural machinery.<ref>[http://www.mercurynews.com/opinion/ci_14687546]: Kishler, Les. Opinion: community gardens are a serious answer to food supplies, health (2010, March 18) ''San Jose Mercury News''.</ref> A 2012 op-ed by community garden advocate Les Kishler examines how community gardening can reinforce the so-called \"positive\" ideas and activities of the [[Occupy movement]].<ref>{{cite web |url=http://www.nationofchange.org/occupy-community-gardens-1328107081 |title=Occupy Community Gardens |accessdate= |url-status=dead |archiveurl=https://web.archive.org/web/20120414010232/http://www.nationofchange.org/occupy-community-gardens-1328107081 |archivedate= 2012-04-14 |last= Kishler|first= Les|date = 12 February 2012|work =Nation of Change}}</ref>\n\nCommunity gardens improve users’ health through increased fresh vegetable consumption and providing a venue for exercise.<ref name=\"autogenerated24\"/><ref name=\"WellbeingMay2013\">{{cite web|title=Lean and green|url=http://www.wellbeing.com.au/newsdetail/Lean-and-green_000916|accessdate=7 May 2013|date=1 May 2013|publisher=Wellbeing.com.au}}</ref> A fundamental part of good health is a diet rich in fresh fruits, vegetables, and other plant based foods.<ref>Hartley, L., Igbinedion, E., Thorogood, M., Clarke, A., Stranges, S., Hooper, L., & Rees, K. (2012). Increased consumption of fruit and vegetables for the primary prevention of cardiovascular diseases. ''Protocols Cochrane Database of Systematic Reviews.''\n</ref> Community gardens provide access to such foods for the communities in which they are located. Community gardens are especially important in communities with large concentrations of low socioeconomic populations, as a lack fresh fruit and vegetable availability plagues these communities at disproportionate rates.<ref name=\"Obesity 2016\">{{cite journal | last1 = Chen | first1 = D. | last2 = Jaenicke | first2 = E. C. | last3 = Volpe | first3 = R. J. | year = 2016 | title = Food Environments and Obesity: Household Diet Expenditure Versus Food Deserts | doi = 10.2105/ajph.2016.303048 | pmid = 26985622 | journal = Am J Public Health | volume = 106| issue = 5| pages = 881–888| pmc = 4985118 }}</ref>\n\nThe gardens also combat two forms of alienation that plague modern urban life, by bringing urban gardeners closer in touch with the source of their food, and by breaking down isolation by creating a social community. Community gardens provide other social benefits, such as the sharing of food production knowledge with the wider community and safer living spaces.<ref>Harris, E (2009). Non-profit organizations in [[Kansas City, Missouri|Kansas City]] and elsewhere help children, community groups, and low-income people grow gardens. \"The role of community gardens in creating healthy communities\", Australian Planner, v. 46, no. 2 (June 2009) pp. 24–27.</ref> Active communities experience less [[crime]] and [[vandalism]].<ref>Melville Court, Chatham, Kent,\" Moiser, Steve, ''Landscape Design,'' no306 (Dec. 2001/Jan. 2002) p. 34.</ref>\n\n===Ownership===\n[[Image:DSC02001 Ausschnitt Mobiler Gemeinschaftsgarten Palette-Bigbag.JPG|thumb|left|Mobility Community gardening]]\nLand for a community garden can be publicly or privately held.<ref>{{cite news|url=http://homes.ninemsn.com.au/2015/11/20/14/47/start-a-community-garden|archiveurl=https://web.archive.org/web/20151120221228/http://homes.ninemsn.com.au/2015/11/20/14/47/start-a-community-garden|archivedate=20 November 2015|first=Tricia|last=Hogbin|title=How to start a community garden|date=20 November 2015|website=NineMSN}}</ref> One strong tradition in North American community gardening in urban areas is cleaning up abandoned vacant lots and turning them into productive gardens.<ref>{{cite news|url=http://www.dnainfo.com/new-york/20140924/astoria/how-you-can-turn-new-york-citys-vacant-lots-into-community-gardens|archiveurl=https://web.archive.org/web/20150921092144/http://www.dnainfo.com/new-york/20140924/astoria/how-you-can-turn-new-york-citys-vacant-lots-into-community-gardens|archivedate=21 September 2015|title=How You Can Turn New York City's Vacant Lots into Community Gardens |first=Jeanmarie|last=Evelly|date=24 September 2014|publisher=DNAinfo New York}}</ref> Alternatively, community gardens can be seen as a health or recreational amenity and included in public parks, similar to ball fields or playgrounds. Historically, community gardens have also served to provide food during wartime or periods of economic depression. Access to land and security of land tenure remains a major challenge for community gardeners and their supporters throughout the world, since in most cases the gardeners themselves do not own or control the land directly.<ref>''Visionaries and planners : the garden city movement and the modern community'', Stanley Buder. New York: Oxford University Press, 1990. {{ISBN|0-19-506174-8}}</ref>\n\nSome gardens are grown collectively, with everyone working together; others are split into clearly divided plots, each managed by a different gardener (or group or family). Many community gardens have both \"common areas\" with shared upkeep and individual/family plots. Though communal areas are successful in some cases, in others there is a [[tragedy of the commons]], which results in uneven workload on participants, and sometimes demoralization, neglect, and abandonment of the communal model. Some relate this to the largely unsuccessful history of [[collective farming]].<ref>{{cite news|agency=NPR|url=https://www.npr.org/blogs/thesalt/2012/03/20/148999066/at-the-community-garden-its-community-thats-the-hard-part|title=At The Community Garden, It's Community That's The Hard Part|date=20 March 2012 |accessdate=26 April 2012}}</ref>\n\nUnlike [[public parks]], whether community gardens are open to the general public is dependent upon the lease agreements with the management body of the park and the community garden membership. Open or closed-gate policies vary from garden to garden. However, in a key difference, community gardens are managed and maintained with the active participation of the gardeners themselves, rather than tended only by a professional staff. A second difference is food production: Unlike parks, where plantings are ornamental (or more recently ecological), community gardens often encourage food production by providing gardeners a place to grow vegetables and other crops. To facilitate this, a community garden may be divided into individual plots or tended in a communal fashion, depending on the size and quality of a garden and the members involved.<ref>''Selected factors influencing the success of a community garden'', by Gordon Arthur Clark. Kansas State University, 1980.</ref>\n\n=== Types of gardens ===\nThere are multiple types of community gardens with distinct varieties in which the community can participate in.<ref>{{Cite web|url=http://marinmg.ucanr.edu/Great_Gardening_Information/Marin_Community_Gardens/|title=Community Gardens|last=Resources|first=University of California, Division of Agriculture and Natural|website=marinmg.ucanr.edu|language=en-US|access-date=2017-05-22}}</ref> \n* '''Neighborhood gardens''' are the most common type that is normally defined as a garden where a group of people come together to grow fruits, vegetables and ornamentals. They are identifiable as a parcel of private or public land where individual plots are rented by gardeners at a nominal annual fee. \n* '''Residential Gardens''' are typically shared among residents in apartment communities, assisted living, and affordable housing units. These gardens are organized and maintained by residents living on the premise.\n* '''Institutional Gardens '''are attached to either public or private organizations and offer numerous beneficial services for residents. Benefits include mental or physical rehabilitation and therapy, as well as teaching a set of skills for job-related placement.\n* '''Demonstration Gardens''' are used for educational and recreational purposes in mind. They often offer short seminars or presentations about gardening, and provide the necessary tools to operate a community garden. \n[[File:A 20ft x 20ft community garden plot in Harrisonburg, Virginia.jpg|thumb|A 20ft x 20ft community garden plot in Harrisonburg, Virginia.]]\n\n=== Plot size ===\nIn Britain, the 1922 Allotment act specifies \"an allotment not exceeding 40 [square] [[Rod (unit)|pole]]s in extent\"; since a rod, pole or perch is 5.5 yards in length, 40 square rods is 1210 square yards or 10890 square feet (equivalent to a large plot of 90&nbsp;ft x 121&nbsp;ft).<ref>{{cite web|title=Allotments: a plotholder's guide|url=http://ari.farmgarden.org.uk/documents/Other_ARI_publications/plotholdersguide.pdf|accessdate=18 May 2015|url-status=dead|archiveurl=https://web.archive.org/web/20150518235754/http://ari.farmgarden.org.uk/documents/Other_ARI_publications/plotholdersguide.pdf|archivedate=18 May 2015}}</ref> In practice, plot sizes vary; Lewisham offers plots with an \"average size\" of \"125 meters square\".{{efn|This apparently means 125m<sup>2</sup> or about 1345 square feet, equivalent to a plot of about 15ft x 90ft.}}<ref>{{cite web|title=Allotments and community gardens|url=http://www.lewisham.gov.uk/inmyarea/openspaces/Pages/allotments.aspx|publisher=Lewisham Borough Council|accessdate=18 May 2015|url-status=dead|archiveurl=https://web.archive.org/web/20150510052302/http://www.lewisham.gov.uk/inmyarea/openspaces/Pages/allotments.aspx|archivedate=10 May 2015}}</ref>\n\nIn America there is no standardized plot size. For example, plots of 3 m × 6 m (10&nbsp;ft × 20&nbsp;ft = 200 square feet) and 3 m x 4.5 m (10&nbsp;ft x 15&nbsp;ft) are listed in [[Alaska]].<ref>{{cite web |title=Parks and Recreation: Community Gardens |url=http://www.muni.org/departments/parks/pages/gardenplots.aspx |publisher=Municipality of Anchorage |accessdate=18 May 2015 |url-status=dead |archiveurl=https://web.archive.org/web/20150524062830/http://www.muni.org/Departments/parks/Pages/GardenPlots.aspx |archivedate=24 May 2015 }}</ref> Montgomery Parks in [[Maryland]] lists plots of 200, 300, 400 and 625 square feet.<ref>{{cite web |title=Community Gardens Program |url=http://www.montgomeryparks.org/permits/find/community_gardens_program.shtm |publisher=Montgomery Parks, Maryland |accessdate=18 May 2015}}</ref>\nIn Canada, plots of 20&nbsp;ft x 20&nbsp;ft and 10&nbsp;ft x 10&nbsp;ft, as well as smaller \"raised beds\", are listed in [[Vancouver]].<ref>{{cite web|title=Community Gardens|url=http://www.cityofvancouver.us/parksrec/page/community-gardens#Garden%20Plot%20Rates|publisher=City of Vancouver|accessdate=18 May 2015}}</ref>\n\n===Location===\nCommunity gardens may be found in neighborhoods, schools, hospitals, and on residential housing grounds. The location of a community garden is a critical factor in how often the community garden is used and who visits it. Exposure to a community garden is much more likely for an individual if they are able to walk or drive to the location, as opposed to public transportation.<ref name=Blaine>{{cite journal|url=http://www.joe.org/joe/2010december/a6.php|title=Profiling Community Gardeners|archiveurl=https://web.archive.org/web/20160505184513/http://www.joe.org/joe/2010december/a6.php|archivedate=5 May 2016|date=December 2010|volume=48|issue=6|first1=Thomas W.|last1=Blaine|first2=Parwinder S.|last2=Grewal|first3=Ashley|last3=Dawes|first4=Darrin|last4=Snider}}</ref> The length of travel time is also a factor. Those who live within a 15-minute or less travel distance are more likely to visit a community garden as compared to those with a longer travel time.<ref name=Blaine/> Such statistics should be taken into consideration when choosing a location for a community garden for a target population.\n\nThe site location should also be considered for its soil conditions as well as sun conditions. Solar conditions are of paramount importance, as above ground gardening is always possible. An area with a fair amount of morning sunlight and shade in the afternoon is most ideal. While specifics vary from plant to plant, most do well with 6 to 8 full hours of sunlight.<ref name=\"repository.arizona.edu\">https://repository.arizona.edu/bitstream/handle/10150/344448/az1435-2015.pdf?sequence=1&isAllowed=y</ref>\n\nWhen considering a location, areas near industrial zones may require soil testing for contaminants. If soil is safe, the composition should be loose and well-draining. However, if the soil at the location is unable to be used, synthetic soil may also be used in raised gardens beds or containers.<ref name=\"repository.arizona.edu\"/>\n\nRushall Garden in Melbourne, Victoria, Australia is situated on land that was formerly a minor railway junction, now repurposed.\n[[File:Rushallgardenaerial.png|thumb|Rushall Garden aerial view]]\n\n===Plant choice and physical layout===\nWhile food production is central to many community and allotment gardens, not all have vegetables as a main focus. Restoration of natural areas and native plant gardens are also popular, as are \"art\" gardens. Many gardens have several different planting elements, and combine plots with such projects as small orchards, herbs and butterfly gardens. Individual plots can become \"virtual\" backyards, each highly diverse, creating a \"quilt\" of flowers, vegetables and folk art.{{Citation needed|date=June 2009}}\n\nRegardless of plant choice, planning out the garden layout beforehand will help avoid problems down the line. According to the Arizona Master Gardener Manual, taking measurements of the garden size, sunlight locations and planted crops vs. yield quantity, will ensure a detailed record that helps when making decisions for the coming years. Other consideration to garden layout would be efficient use of space by using trellises for climbing crops, being mindful of taller plants blocking sunlight to shorter plants and plants that have similar life cycles close together.<ref name=\"repository.arizona.edu\"/>\n\n===Group and leadership selection===\nThe community gardening movement in North American is inclusive, diverse, pro-democracy, and supportive of community involvement. Gardeners may be of any cultural background, young or old, new gardeners or seasoned growers, rich or poor. A garden may have only a few people active, or hundreds.{{Citation needed|date=June 2009}}\n\nSome community gardens “self-support” through membership dues, and others require a sponsor for tools, seeds, or money donations. Churches, schools, private businesses or parks and recreation departments supporters and community leaders.<ref name=\":0\">{{Cite news|url=https://communitygarden.org/mission/|title=Growing Community Across the U.S. and Canada – American Community Garden Association|last=|first=|date=|work=American Community Garden Association|access-date=2017-05-20|language=en-US}}</ref>\n\nFinally, all community gardens have a structure. The organization depends in part on whether the garden is \"top down\" or \"grassroots\". There are many different organizational models in use for community gardens. Some elect boards in a democratic fashion, while others can be run by appointed officials. Some are managed by [[non-profit organization]]s, such as a community gardening association, a community association, a church, or other land-owner; others by a city's recreation or parks department, a school or University.\n\nGardeners may form a grassroots group to initiate the garden, such as the Green Guerrillas of New York City,<ref>[http://www.greenguerillas.org Green Guerillas]</ref> or a garden may be organized \"top down\" by a municipal agency. In Santa Clara, California there is a non-profit by the name of Appleseeds<ref>[http://communitygardensasappleseeds.info Community Gardens as Appleseeds]</ref> that offers free assistance in starting up new community gardens around the world.\n\n===Membership rules and fees===\nIn most cases, gardeners are expected to pay annual dues to help with garden upkeep, and the organization must manage these fees. The tasks in a community garden are many, including upkeep, mulching paths, recruiting members, and fund raising. Rules and an 'operations manual' are both invaluable tools, and ideas for both are available at the ACGA.<ref>[http://www.communitygarden.org American Community Gardening Association]</ref>\n\n===Health effects of community gardens===\nCommunity gardens have been shown to have positive health effects on those who participate in the programs, particularly in the areas of decreasing body mass index and lower rates of obesity. Studies have found that community gardens in schools have been found to improve average body mass index in children. A 2013 study found that 17% of obese or overweight children improved their body mass index over seven weeks.<ref name=Castro>{{cite journal | last1 = Castro | first1 = DC | last2 = Samuels | first2 = M | last3 = Harman | first3 = AE | year = 2013 | title = Growing healthy kids: a community garden-based obesity prevention program | doi = 10.1016/j.amepre.2012.11.024 | pmid = 23415183 | journal = American Journal of Preventive Medicine | volume = 44 | issue = 3 Suppl 3| pages = S193–9 | doi-access = free }}</ref><ref name=\"Obesity 2016\"/> Specifically, 13% of the obese children achieved a lower body mass index in the overweight range, while 23% of overweight children achieved a normal body mass index.<ref name=Castro/> Many studies have been performed largely in low-income, Hispanic/Latino communities in the United States.<ref>{{cite journal | last1 = Davis | first1 = JN | last2 = Ventura | first2 = EE | last3 = Cook | first3 = LT | last4 = Gyllenhammer | first4 = LE | last5 = Gatto | first5 = NM | date = August 2011 | title = LA Sprouts: a gardening, nutrition, and cooking intervention for Latino youth improves diet and reduces obesity | url = | journal = Journal of the American Dietetic Association | volume = 111 | issue = 8| pages = 1224–30 | doi = 10.1016/j.jada.2011.05.009 | pmid=21802571}}</ref> In these programs, gardening lessons were accompanied by nutrition and cooking classes and optional parent engagement. Successful programs highlighted the necessity of culturally tailored programming.\n\nThere is some evidence to suggest that community gardens have a similar effect in adults. A study found that community gardeners in Utah had a lower body mass index than their non-gardening siblings and unrelated neighbors.<ref>{{cite journal | last1 = Zick | first1 = CD | last2 = Smith | first2 = KR | last3 = Kowaleski-Jones | first3 = L | last4 = Uno | first4 = C | last5 = Merrill | first5 = BJ | date = June 2013 | title = Harvesting more than vegetables: the potential weight control benefits of community gardening | journal = American Journal of Public Health | volume = 103 | issue = 6| pages = 1110–5 | doi=10.2105/ajph.2012.301009 | pmid=23597347 | pmc=3698715}}</ref> Administrative records were used to compare body mass indexes of community gardeners to that of unrelated neighbors, siblings, and spouses. Gardeners were less likely to be overweight or obese than their neighbors, and gardeners had lower body mass indexes than their siblings. However, there was no difference in body mass index between gardeners and their spouses which may suggest that community gardening creates healthy habits for the entire household.\n\nParticipation in a community garden has been shown to increase both availability and consumption of fruits and vegetables in households. A study showed an average increase in availability of 2.55 fruits and 4.3 vegetables with participation in a community garden. It also showed that children in participating households consumed an average of two additional servings per week of fruits and 4.9 additional servings per week of vegetables.<ref>{{citation|url=https://salud-america.org/sites/salud-america/files/grantee-research/castro2011.pdf|title=Salud America! Pilot Investigator Project Results|archiveurl=https://web.archive.org/web/20151203210653/https://salud-america.org/sites/salud-america/files/grantee-research/castro2011.pdf|archivedate=3 December 2015}}</ref>\n\n===Policy implications===\nThere is strong support among American adults for local and state policies and policy changes that support community gardens. A study found that 47.2% of American adults supported such policies.<ref>{{citation |pmid=22898158 |title=Support among U.S. adults for local and state policies to increase fruit and vegetable access |first1=JL |last1=Foltz |first2=DM |last2=Harris |first3=Blanck |last3=HM |doi=10.1016/j.amepre.2012.05.017 |volume=43 |issue=3 |year=2012 |journal=Am J Prev Med |pages=S102–8 |url=https://zenodo.org/record/1258714 }}</ref> However, community gardens compete with the interests of developers. <ref>{{Cite journal|last=Schmelzkopf|first=Karen|date=1995|title=Urban Community Gardens as Contested Space|journal=Geographical Review|volume=85|issue=3|pages=364–381|doi=10.2307/215279|issn=0016-7428|jstor=215279}}</ref> Community gardens are largely impacted and governed by policies at the city level. In particular, zoning laws strongly impact the possibility of community gardens. The momentum for rezoning often comes from the public need for access to fruits and vegetables. Rezoning is necessary in many cities for a parcel of land to be designated a community garden, but rezoning doesn't guarantee garden will not be developed in the future.\n\nFurther policies can be enacted to protect community gardens from future development. For example, New York State reached a settlement in 2002 which protected hundreds of community gardens which had been established by the Parks and Recreation Department GreenThumb Program from future development.<ref>\nRobert Fox Elder. (2005). protecting new york city's community gardens. New York University Environmental Law Journal, 13, 769–803.</ref>\n\nAt times, zoning policy lags behind the development of community gardens. In these cases, community gardens may exist illegally. Such was the case in Detroit when hundreds of community gardens were created in abandoned spaces around the city. The city of Detroit created agricultural zones in 2013 in the middle of urban areas to legitimize the over 355 “illegal” community gardens.<ref>Kaffer, N. (2010). Planners recommend new zoning, lower tax rate for urban farms. Crain's Detroit Business, 26(13), 8. 91 U. Det. Mercy L. Rev. 345. Retrieved from www.lexisnexis.com/hottopics/lnacademic</ref>\n\n==Examples==\n===Australia===\n[[File:Community_Garden,_Melbourne,_Australia.jpg|thumb|Community Garden, Melbourne, Australia]]\nThe first Australian community garden was established in 1977 in [[Nunawading, Victoria]] followed soon after by Ringwood Community Garden<ref>{{cite web | url=http://www.ringwoodcommunitygarden.org.au | title=Ringwood Community Garden | accessdate=29 January 2014}}</ref> in March 1980.<ref name=Australia[ACTGov]>{{cite web|title=A Study of the Demand for Community Gardens and their Benefits for the ACT Community|url=http://www.actpla.act.gov.au/tools_resources/research_based_planning_for_a_better_city/demand_for_community_gardens_and_their_benefits|publisher=ACT Government|accessdate=14 April 2013|author=Environment and Sustainable Development Directorate|date=5 April 2013}}</ref>\n\n=== Japan ===\nIn Japan, rooftops on the train stations have been transformed into community gardens. Plots are rented to local residents for $980 per year. These community gardens have become active open spaces now.<ref>{{Cite web|url=https://inhabitat.com/rooftop-farms-on-japanese-train-stations-serve-as-community-gardens/|title=Rooftop Farms on Japanese Train Stations Serve as Community Gardens|last=Meinhold|first=Bridgette|date=25 March 2014|website=Inhabitat|access-date=4 April 2019}}</ref>\n\n=== Mali ===\nOften externally supported, community gardens become increasingly important in developing countries, such as West African [[Mali]] to bridge the gap between supply and requirements for micro-nutrients and at the same time strengthen an inclusive development.<ref>[http://nbn-resolving.de/urn:nbn:de:0168-ssoar-325187 Hans-Heinrich Bass, Klaus von Freyhold und Cordula Weisskoeppel: Water harvesting, tree protection: towards food security in the Sahel, Bremen 2013]</ref>\n\n=== Spain ===\n[[File:Foto familia huertos comunitario.JPG|thumb|right|400px|The [[squatting|squatted]] [[social center]] [[Can Masdeu]] is home to one of the largest community gardens in Barcelona.]] Most older Spaniards grew up in the countryside and moved to the city to find work. Strong family ties often keep them from retiring to the countryside, and so urban community gardens are in great demand. [[Potluck]]s and [[paella]]s are common, as well as regular meetings to manage the affairs of the garden.<ref>{{cite web|url=http://urbangardensbarcelona.wordpress.com/ |title=Urban Gardens |publisher=Urbangardensbarcelona.wordpress.com |date=25 November 2009 |accessdate=11 December 2011}}</ref>\n\n=== Taiwan ===\nThere is an extensive network of community gardens and collective urban farms in Taipei City often occupying areas of the city that are waiting for development. Flood-prone river banks and other areas unsuitable for urban construction often become legal or illegal community gardens. The network of the community gardens of Taipei are referred to as ''[[Urban Acupuncture|Taipei organic acupuncture]]'' of the industrial city.<ref>[http://blog.p2pfoundation.net/the-community-gardens-of-taipei/2010/12/04 \"The Community Gardens of Taipei\"] Casagrande, Marco (2010). ''P2P Foundation''</ref>\n\n=== United Kingdom ===\nIn the [[United Kingdom]], community gardening is generally distinct from allotment gardening, though the distinction is sometimes blurred. Allotments are generally plots of land let to individuals for their cultivation by local authorities or other public bodies—the upkeep of the land is usually the responsibility of the individual plot owners. Allotments tend (but not invariably) to be situated around the outskirts of built-up areas. Use of allotment areas as open space or play areas is generally discouraged. However, there are an increasing number of community-managed allotments, which may include allotment plots and a community garden area, many of them overseen by the Federation of City Farms and Community Gardens (a registered charity).<ref name=\"aboutFCFCG\">{{cite web | url=http://www.farmgarden.org.uk/about-us | title=About FCFCG | publisher=Federation of City Farms and Community Gardens | accessdate=12 January 2014}}</ref>\n\nThe community garden movement is of more recent provenance than allotment gardening, with many such gardens built on patches of derelict land, waste ground or land owned by the local authority or a private landlord that is not being used for any purpose. A community garden in the United Kingdom tends to be situated in a built-up area and is typically run by people from the local community as an independent, non-profit organisation (though this may be wholly or partly funded by public money).{{Citation needed|date=June 2009}} For example, Norwich's Fifth Quarter Community Garden.\n\nIt is also likely to perform a dual function as an open space or play area (in which role it may also be known as a 'city park') and—while it may offer plots to individual cultivators—the organisation that administers the garden will normally have a great deal of the responsibility for its planting, landscaping and upkeep. An example inner-city garden of this sort is [[Islington]]'s Culpeper Community Garden, which is a registered charity,<ref>{{cite web | url=http://www.culpeper.org.uk/ | title=Culpeper Community Garden: Islington's Green Oasis | accessdate=12 January 2014}}</ref> or [[Camden Town|Camden]]'s [[Phoenix Garden]].<ref>{{cite web | url=http://www.thephoenixgarden.org/ | title=The Phoenix Garden | accessdate=12 January 2014}}</ref>\n\n===United States===\n{{Main|Community gardening in the United States}}\n\n== Notes ==\n{{Notelist}}\n\n==References==\n{{Reflist}}\n\n{{Commons category|Community gardens}}\n\n{{Horticulture and gardening}}\n\n[[Category:Community gardening| ]]\n[[Category:Horticulture and gardening]]\n[[Category:Localism (politics)]]",
            "slug": "community-gardening",
            "date_updated": 1592516508819,
            "imported": "https://en.wikipedia.org/wiki/Community_gardening"
        }
    ]
}