{
	"title": "公共政策参与&公民权利",
	"description": "提升公民能力，限制政府权力",
	"links": "- [Source code](https://github.com/mirrorcn/mirror-CN)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1464789908,
	"post": [
		{
			"post_id": 13,
			"title": "居住证是否需要提前半年登记？省市文件意见不一\n\n陕西两居住证红头文件“打架”，大学生建议法制办审查合法性",
			"date_published": 1464789805.123,
			"body": "\n［义务提供线索 欢迎关注、采访报道］\n\n6月1日\n\n“如果这两个文件‘打架’的现象不能解决、并且与国务院《居住证暂行条例》相一致，老百姓‘办证难’问题还会越来越多，对于大学毕业生来说也很影响就业和居住的选择！”正在寻找各地工作机会的应届毕业生陈波毅（化名）今天通过EMS向陕西省公安厅和陕西省法制办邮寄了一封《规范性文件合法性审查建议信》，希望能够纠正陕西省公安厅和西安市政府两个文件“打架”的现象。\n\n \n\n**红头文件打架：省公安厅文件比国务院文件和西安市文件多了一个条件**\n\n \n\n继去年年底国务院颁布《居住证暂行条例》之后，陕西省公安厅于今年年初发布了《陕西省公安厅关于认真做好<居住证暂行条例>贯彻实施工作的通知》，其中规定“居住半年以上，是指在居住地居住并办理居住登记满半年”，这意味着比国务院《居住证暂行条例》的第二条“公民离开常住户口所在地，到其他城市居住半年以上，符合有合法稳定就业、合法稳定住所、连续就读条件之一的，可以依照本条例的规定申领居住证”多了一个“并办理居住登记满半年”，而且这也与今年5月25日起实施的《西安市居住证管理实施办法》的“居住半年以上，是指在本市实际居住已满半年”（并没有要求必须办理居住登记）存在不一致的地方，导致既存在省市两个红头文件“打架”，同时省公安厅的文件也与国务院《居住证暂行条例》相冲突两个问题。\n\n \n\n陈波毅是广州的一名应届毕业生，最近在找工作的时候也在留意就业、办理居住证件比较友好的城市，本来对于古都西安非常向往的他，在看到相关新闻并到政府网站看到文件全文之后，心里就有点不高兴了。他在网上搜索相关的信息，发现不少人在小孩入学、考驾照而急需办居住证的时候也都面临类似困扰：\n\n \n\n“派出所户籍民警告诉我，从我登记办理开始，6个月以后才能办理居住证，办证时间还需要1个月。”小李告诉记者，如果这样算下来，居住证办下来最早要到9月中旬了，那岂不是耽误了小孩上学？\n\n同样的问题还出现在了家住高新区的李女士身上。“我最近要考驾照，已经找了驾校报了名，驾校要求外地学员必须要办西安市居住证，结果唐延路派出所跟我说至少半年后才能拿到。”李女士说，她已经给交了驾考报名费，这段时间刚好也有时间学驾照，就因为居住证的问题，现在不知道该怎么处理了。（西部网：“西安居住证办理延长到6个月，全陕西政策都一样”，http://xian.qq.com/a/20160218/046040.htm?）\n\n \n\n**向省法制办建议启动合法性审查程序**\n\n \n\n经过查阅大量资料，陈波毅认为，根据《陕西省规范性文件监督管理办法》第九条第二款规定，“为实施法律、法规、规章而制定的规范性文件，不得增设公民、法人或者其他组织的义务，不得限制公民、法人或者其他组织的权利”，证明居住了半年以上，应该主要通过租房合同来证明，或者通过社保、劳动合同等佐证也可以，但是如果一定要按照陕西省公安厅的做法，办居住证必须先登记（即使你已经在西安居住了半年以上，也要先去公安部门登记），过了半年之后才能来真正申请居住证，就要增加办证人的时间成本，非常不便民，而且陕西省公安厅所发文件实际上超越了对于国务院《居住证暂行条例》的合理解释，不当限制了公民权利；同时也与《西安市居住证管理实施办法》存在不一致的地方，出现了西安市政府规章和省政府部门规范性文件相冲突的问题出现（注：《立法法》第九十一条规定，“部门规章之间、部门规章与地方政府规章之间具有同等效力，在各自的权限范围内施行”，类比该条款，市政府规章和省政府部门规范性文件也具有同等效力），也导致了与国务院《居住证暂行条例》相一致的《西安市居住证管理实施办法》难以实施。综合来看，陕西省公安厅的文件既不合法，也不合理。\n\n \n\n所以陈波毅根据《陕西省规范性文件监督管理办法》第三十条，“制定机关接到公民、法人或者其他组织对本机关制定的规范性文件提出质疑或者修改建议的，应当予以核实;规范性文件确有问题的，制定机关应当自行改正或者撤销。政府法制机构接到公民、法人或者其他组织举报有关规范性文件存在问题的，转送制定机关核实处理，制定机关应当在规定时间内回复处理结果；必要时，政府法制机构可直接审查处理”，分别向陕西省公安厅和陕西省法制办提交了《规范性文件合法性审查建议信》，希望两部门能够纠正这一错误。"
		},
		{
			"post_id": 12,
			"title": "重庆市相关部门关于疫苗电子监管码系统的信息可能存在冲突\n\n深圳疑似疫苗不良反应小孩家长申请公开相关信息",
			"date_published": 1464789601.522,
			"body": "\n\n【义务新闻线索  欢迎采访、报道、引用】\n\n2016年6月1日\n\n今天是“六一”儿童节，深圳疑似疫苗不良反应小孩家长蔡英（化名）向重庆市疾控中心邮寄了一份政府信息公开申请书，申请公开重庆市启用了疫苗电子监管码系统的行政区域名称及启用时间。上午9点半，蔡英通过邮政特快专递将政府信息公开申请表寄出。\n\n“提出这个政府信息公开申请除了想获得相关信息，也是为了便于监督疫苗安全，”蔡英说。\n\n \n\n**为疑似疫苗不良反应小孩家长 长期关注各地疫苗安全**\n\n蔡英的小孩2015年6月27日在深圳接种了流脑a+c疫苗，10天后眼睑出现浮肿，被医院诊断为肾病综合症，孩子现在还在治疗过程中。\n\n蔡英认为小孩遭受了疫苗不良反应，因此一直比较关注全国各地的疫苗安全情况，也与其他关注疫苗安全的家长有交流。4月份听到重庆一位家长讲述向重庆市永川区疾控中心申请公开小孩接种疫苗的电子监管码等详细信息的事情，3月底收到永川区疾控中心的回复，该回复称“因重庆市疾控中心无疫苗电子监管系统，所以无法提供电子监管码，望理解”。\n\n5月15日，蔡英看到重庆南岸区委宣传部官方微博“南岸政务”转发了金龙网标题为《重庆一接种门诊疫苗使用投诉调查有新进展 调查表明疫苗来源正规》的新闻报导，称重庆市相关部门在调查南岸区一起疫苗安全事件时邀请家长代表通过其手机登录国家食品药品监督管理局APP终端，对现场启封的疫苗包装上的中国药品电子监管码进行查询，查到了疫苗的流向，家长对检查结果予以认可。\n\n \n\n**重庆市不同部门的信息可能有冲突 关注疫苗安全家长申请政府信息公开**\n\n   4月份重庆市永川区疾控中心给家长的回复称重庆没有实行电子监管码系统，但是“南岸政务”官微转发金龙网的报导又称家长通过疫苗电子监管码查到了疫苗的流向。重庆市永川区疾控中心与南岸区疫苗安全事件联合调查小组的信息可能有冲突，也有可能是重庆市南岸区在今年4月份启用了疫苗电子监管码系统。\n\n   蔡英认为小孩遭遇的是疫苗不良反应，她在小孩生病后自学了一些法律知识，她认为根据《政府信息公开条例》，重庆市哪些行政区域启用了疫苗电子监管码系统事关群众切身利益，属于政府应当主动公开的信息，但是她在重庆市疾控中心的网站上没有看到相关信息。她决定向重庆市疾控中心申请政府信息公开。\n\n她在政府信息公开申请表中“所需信息”一栏写道：\n\n“请公开：**1、重庆市启用了疫苗电子监管码系统的行政区域名称；2、启用了疫苗电子监管码系统的行政区域的启用时间**。”\n\n在申请说明里，她写到：“申请人是疫苗不良反应的小孩家长，一直关注各地疫苗安全动态。日前看到重庆南岸区委宣传部官方微博“南岸政务”转发了金龙网5月15日标题为《重庆一接种门诊疫苗使用投诉调查有新进展 调查表明疫苗来源正规》的新闻报导，称重庆市相关部门在调查南岸区一起疫苗安全事件时邀请家长代表通过其手机登录国家食品药品监督管理局APP终端，对现场启封的疫苗包装上的中国药品电子监管码进行查询，查到了疫苗的流向，家长对检查结果予以认可。申请人认为，重庆市哪些行政区域启用了疫苗电子监管码系统属于政府应当主动公开的信息，但是在贵部门的网站上没有看到。为了便于监督疫苗安全，特申请公开。”\n\n“我申请政府信息公开除了想了解重庆市疫苗电子监管码系统的启用情况，也是为了督促重庆市早日全面启用疫苗电子监管码系统，提高疫苗的安全性，”蔡英说。\n\n据了解，国家食品药品监督管理总局在2015年1月份发布了《关于药品生产经营企业全面实施药品电子监管有关事宜的公告》，要求在2015年12月31日前，境内药品制剂生产企业、进口药品制药厂商须全部纳入中国药品电子监管网。所有药品批发、零售企业须全部入中国药品电子监管网，严格按照新修订《药品经营质量管理规范》要求，对所经营的已赋码药品“见码必扫”，及时核注核销、上传信息，确保数据完整、准确，并认真处理药品电子监管系统内预警信息。\n\n \n\n附件一、采访联系人\n\n附件二、重庆市永川区疾控中心给一位家长的信息公开申请答复\n\n附件三：政府信息公开申请表（见单独附件，已把个人信息删掉）\n\n   附件四、EMS邮寄单（见单独附件）    \n\n相关法律规定：\n\n国家食品药品监督管理总局\n\n**《关于药品生产经营企业全面实施药品电子监管有关事宜的公告》**\n\n为按期完成《国家药品安全“十二五”规划》要求的“完善覆盖全品种、全过程、可追溯的药品电子监管体系”工作任务，在2015年年底前实现全部药品制剂品种、全部生产和流通过程的电子监管，现将药品生产、经营企业和进口药品制药厂商实施药品电子监管有关事宜公告如下：\n\n2015年12月31日前,境内药品制剂生产企业、进口药品制药厂商须全部纳入中国药品电子监管网（以下简称入网），按照原国家食品药品监督管理局《关于印发药品电子监管工作指导意见的通知》（国食药监办〔2012〕283号）的要求，完成生产线改造，在药品各级销售包装上加印（贴）统一标识的中国药品电子监管码（以下称赋码），并进行数据采集上传，通过中国药品电子监管平台核注核销。2016年1月1日后生产的药品制剂应做到全部赋码。\n\n2015年12月31日前,所有药品批发、零售企业须全部入网，严格按照新修订《药品经营质量管理规范》要求，对所经营的已赋码药品“见码必扫”，及时核注核销、上传信息，确保数据完整、准确，并认真处理药品电子监管系统内预警信息。\n\n"
		},
		{
			"post_id": 11,
			"title": "广深两地家长提请规范性文件审查\n认为北京昌平区小学入学文件违法 以致一家长自焚",
			"date_published": 1464703527.919,
			"body": "\n［义务提供线索 欢迎关注、采访报道］\n\n5月31日\n\n\n2016年5月31日上午，广州家长李润发和深圳家长甄理（化名），通过邮政快递分别向北京市昌平区人民代表大会常务委员会、北京市昌平区政府法制办公室邮寄了一份《规范性文件合法性审查申请书》，请求对北京市昌平区教委制定的《昌平区2016年义务教育阶段入学工作意见》之附件《昌平区2016年非本市户籍适龄儿童小学入学条件审核办法》进行合法性审查，建议删除关于“申请人须出具房租发票”之相关条款。昌平区教委超越立法权限创设了以租房发票来作为实际居所地的证明，缺乏法律法规依据，不当地限制了适龄儿童入学的权益。\n\n\n**以房租发票作为入学条件 缺乏法律依据**\n\n《昌平区2016年非本市户籍适龄儿童小学入学条件审核办法》第五章第二节规定，“申请人租住房屋的，须提供规范有效的房屋租赁合同、税务机关在2015年12月31日以前出具的房租发票、房屋出租方的房屋产权证、身份证复印件”。然而，北京市教委《关于2016年义务教育阶段入学工作的意见》（京教基二〔2016〕3号，以下简称“意见”）规定，“非本市户籍的适龄儿童少年，因父母或其他法定监护人在本市工作或居住，需要……提供在京实际住所居住证明”，《昌平区2016年义务教育阶段入学工作意见》“非本市户籍的适龄儿童，由其父母或其他法定监护人持本人务工就业证明、实际居住证明、全家户口簿、暂住证、户籍所在地乡镇人民政府（街道办事处）出具的在当地没有监护条件的证明等相关材料，到昌平区居住地所在镇政府（街道办事处）进行初审”，均未要求以房租发票来作为实际居住证明。\n\n虽然《北京市房屋租赁管理若干规定》规定，房屋租赁应当到房管部门备案、纳税，但是在该规定中的行政职能是房屋管理和税务管理，并不涉及到教育管理的职能；而且房屋出租后到房管部门备案、纳税，是房屋出租人的责任，而非承租人的责任，法律不强人所难，“连坐”也不符合法治的精神。所以强制将房屋租赁备案和房租税与入学资格捆绑没有法律依据。\n\n因此昌平区教委在《昌平区2016年非本市户籍适龄儿童小学入学条件审核办法》中，制定依据虽有上述两个文件，却是却超越立法权限创设了以租房发票来作为实际居所地的证明，缺乏法律法规依据，无形中排除了大量流动人口子女的小学入学的可能性。\n\n**小一入学门槛多多 违背义务教育原则**\n\n按照北京市教委《关于2016年义务教育阶段入学工作的意见》（京教基二〔2016〕3号）规定，“非本市户籍的适龄儿童少年，……，由其父母或其他法定监护人持本人在京务工就业证明、在京实际住所居住证明、全家户口簿、在京暂住证、户籍所在地街道办事处或乡镇人民政府出具的在当地没有监护条件的证明等相关材料，到居住地所在街道办事处或乡镇人民政府审核……”，也即“五证”。有些区县教委会要求更多证明文件。众多非京户籍家长为这些证明自己在京就业、实际居住，疲于在不同的政府部门之间奔波，甚至需要往返数次户籍所在地开具相关证明。在实践中也引发了悲剧事件，如5月20日于北京昌平区发生的一家长因子女上学问题而自焚的事件。（参见附件新闻链接1）\n\n北京市教委在《意见》的工作原则中提到，“（一）坚持政府统筹，将义务教育阶段入学工作作为政府行为予以保障。（三）坚持免试、就近，确保适龄儿童少年接受义务教育”。我国《义务教育法》亦强调适龄儿童接受义务教育是一项基本权利，“是国家必须予以保障的公益性事业”（总则第二条）。然而在实际操作上，各地教育部门都对非本市户籍的适龄儿童（及其家长）施以更加复杂的入学条件。移居深圳已二十余年的孩子家长甄理曾亲自收集了全国十个流动人口比例较大的城市的小学入学政策，发现无一例外地对非本市户籍适龄儿童（及其家长）要求出示（父母）就业（社保）证明、居住（购房或租赁）证明，甚至还要求出示与孩子入学毫无关联的计划生育证明。甄理向记者表示，既然接受非本市户籍适龄儿童入学是当地政府教育部门的义务，则申请人只需证明实际居住即可，无需父母的就业证明甚至计划生育证明；而租赁合同、水电费清单等都可作为申请人实际居住的证明。\n\n李总理在今年5月6日的国务院常务会议，讨论确定进一步简政放权、取消非行政许可审批类别时明确要求，对于那些于法、于文件都没有依据的证明，必须予以废除；至于那些确实必要的证明，也要进一步简化办理流程，以便利办事群众。（参见附件新闻链接2）\n\n\n\n附件：\n\n4、相关新闻链接\n        1. 每日头条：非京籍家长因孩子上学问题自焚 致重度烧伤     http://toutiao.com/i6287085151818088961/\n        2. 每经网：总理主持国务院常务会：于法、于文件都没有依据的证明，必须废除    http://www.nbd.com.cn/articles/2015-11-19/963680.html\n\n\n5、相关法规\n        1. 北京市教委《关于2016年义务教育阶段入学工作的意见》（京教基二〔2016〕3号）\n        2. 《昌平区2016年义务教育阶段入学工作意见》及附件《昌平区2016年非本市户籍适龄儿童小学入学条件审核办法》\n"
		},
		{
			"post_id": 10,
			"title": "五种常见止咳药被曝硫磺超标后，政府做了什么？",
			"date_published": 1464442953.603,
			"body": "\n\n## 热心市民甄先生申请31省政府信息公开\n\n[义务提供以下新闻线索，欢迎采用、引用，欢迎采访报道]\n\n2016年5月24日\n\n \n\n5月24日，因为对不久前曝光的五种常见止咳药含硫磺超标的事感到十分担心、忧虑，珠海的热心市民甄先生向31个省份的食品药品监督管理局寄出政府信息公开申请函，申请各省公开都做了哪些事情来应对这些常见药含硫磺超标。“这些都是常见药，特别为家人朋友担心，不知道已经造成了哪些危害。事情曝光后，也没看到相关部门的追责，不知道各省市的食品药品监管部门有没有对药品进行排查、下架，不能让这些药再继续销售了。”甄先生说。\n\n \n\n5种常见止咳药检出硫磺，涉云南白药、哈药等，危害肝肾健康\n\n \n\n5月7日，有媒体接到举报人白某举报，根据举报人白某提供的西安国联质量检测技术股份有限公司出具的检测报告和留存样品，发现其中5种药品：太极集团重庆中药二厂有限公司生产的橘红丸、通药制药集团股份有限公司生产的橘红丸、通药制药集团股份有限公司生产的润肺止嗽丸、哈药集团世一堂制药厂生产的金贝痰咳清颗粒、云南白药集团股份有限公司生产的小儿宝泰康颗粒含硫磺。这5种止咳药中100克成品药最高的竟然含有0.6克硫磺（即千分之六的比例），最少的也有0.1克硫磺。\n\n二氧化硫是有毒化学物质，长期接触食用二氧化硫残留的中药材，会令人产生呕吐、腹泻、恶心等症状，严重的会危害肝脏、肾脏，还会引起慢性中毒如慢性鼻炎、咽炎、支气管炎以及支气管哮喘、肺气肿等，还可能提高肺癌的患病率。\n\n杭州市药品医疗器械企业权益保护协会发布一份报告显示，若中药材中的二氧化硫超过500μg/kg，就会使人产生味觉上的不适，能够闻到特别刺鼻的酸味，会引起包括急性咳嗽在内的急性毒性反应。\n\n \n\n政府做了啥？热心市民申请31省食药监信息公开\n\n因为没看到政府部门对这一事件做出反应，珠海市民甄先生非常忧虑，经过查找相关法律法规，甄先生决定向31个省的食品药品监督管理局寄出政府信息公开申请，以解答自己的疑惑。“如果政府真的没有对药品下架情况进行排查，就太可怕了，我相信政府部门应该不会装作没看见。”甄先生说。\n\n5月24日，甄先生寄出了政府信息公开申请，申请的内容是：\n\n“1.目前贵省市场上依然流通的这5种止咳化痰药品的具体销售点（经销商、代理商、销售门店）地址和联系电话、负责人姓名。\n\n2.从这5种药开始销售，至2016年5月22日，在贵省各销售点已经销售完的这5种止咳化痰药品的重量和数量。\n\n3.从5月7日新闻报道这5种止咳化痰药品硫磺超标后，至5月22日，贵省已下架这5种止咳化痰药品的数量分别是多少。\n\n4.从5月7日新闻报道这5种止咳化痰药品硫磺超标后，至5月22日，贵部门本案目前通知了哪些县市的哪些部门进行药品下架情况排查。\n\n5.从5月7日新闻报道这5种止咳化痰药品硫磺超标后，至5月22日，贵省这些药品的消费者身体状况的排查情况。”\n "
		},
		{
			"post_id": 9,
			"title": "一长沙孕妇为看检验报告向两部门申请信息公开\n",
			"date_published": 1462955551.1,
			"body": "仅检测冒牌“雅培”奶粉  检验报告且不公开\n\n\n                    【义务新闻线索  欢迎采访、报道、引用】\n\n                     2016年4月13日\n\n \n长沙的孕妈妈吴玲（化名）打算今天（4月13日）上午9点多去芙蓉中路邮政支局邮寄两份政府信息公开申请表，她将分别向上海市公安局和国家食品药品监督管理总局申请政府信息公开。\n\n“仅听到冒牌‘雅培’的检验结果，且不是检验报告全文。我想看到所有涉案冒牌奶粉的检验报告，”吴玲说。\n\n \n\n仅对假冒雅培品牌进行检验 检验报告全文未公示\n\n吴玲已经怀孕三个多月了，备孕前就关注婴幼儿奶粉方面信息，曾想将来去香港购买奶粉，但由于距离较远，最终还是把目光投向国内销售的奶粉，经常留意比较各种品牌的优劣和价格。\n\n前段，她从网上了解到，去年开始被上海公安部门查处的“仿冒婴儿乳粉案”中的犯罪嫌疑人在长沙也设置了一个窝点，生产假冒的雅培奶粉达1万多罐，目前还有3300罐假冒雅培奶粉没有查明下落。\n\n   后来又从食药监总局的公告中得知，上海市公安部门已经对查获的假冒乳粉进行了产品检验，产品符合国家标准，不存在安全风险。\n\n吴玲觉得食药监总局的信息披露像挤牙膏，最初不披露，后来说有假冒雅培奶粉，后来又说贝因美也卷入此次假冒奶粉案中。从去年上海公安查处到这些品牌的公布跨度半年，“不知道多少无辜的孩子食用了这些奶粉。”吴玲说。\n\n吴玲了解到上海公安机关委托上海市质量监督检验技术研究院对冒牌“雅培”婴幼儿配方乳粉进行检验，共检测微生物、营养素等14项关键项目，所检项目均符合婴幼儿配方乳粉食品安全国家标准，其中钙含量略低于“雅培”婴幼儿配方乳粉标签明示值。\n\n“涉案奶粉有雅培、贝因美，为何只有假冒雅培奶粉的检测结论？另外，为何不公开检验报告，只公布检验结论？若没对涉案品牌全部做检测，就说涉案奶粉符合安全标准，让我这这个准妈妈心里都没法踏实，最好能公开全部涉案奶粉的检验报告全文。”吴玲说。\n\n \n\n向两部门申请信息公开 要求公开所有涉案品牌\n\n为了弄清楚是否对冒牌的“贝因美”也做了食品安全标准检验，同时为了得到检验报告全文，吴玲决定向上海市公安局和国家食药监局申请政府信息公开。\n\n在她给国家食药监总局的信息公开申请表中所需信息的内容描述中写道：\n\n “在贵网站4月6日的’食品药品监管总局新闻发言人再谈冒牌乳粉案’中，提到’总局4月4日通报涉案产品经办案机关检验符合食品安全标准，但属于冒牌食品’，请公开所有涉案产品的检验报告。”\n\n在所需信息的用途一栏中，她写道：\n\n“作为一个怀孕的准妈妈非常关注奶粉安全，在贵网站4月9日的通报中提及上海公安机关委托上海市质量监督检验技术研究院对冒牌‘雅培’婴幼儿配方乳粉进行检验，但并未公开检验报告全文，觉得公开全文才更有说服力，请满足一个准妈妈的知情权，谢谢！”\n\n 在她给上海市公安局的政府信息公开申请表中也表达了类似的内容。\n\n  为了能早日得到检验报告内容信息，她在获取政府信息方式一栏选取了“电子邮件”选项。“对方把检验报告扫描后发我电子邮箱就行，这样相对会快一些。”吴玲说。"
		},
		{
			"post_id": 8,
			"title": "\t疫苗律师团发布建议信：允许集团诉讼、建立药害救济基金",
			"date_published": 1462955039.8,
			"body": "志愿律师团关于问题疫苗案件鉴定与救济机制的建议\n\n\n全国人大、国务院、最高检、卫计委、中国消费者协会：\n\n我们是在“山东5.7亿疫苗案”案发后志愿为受害者提供法律服务的律师。据估算，过去五年间流入市场的“庞氏疫苗”约有200余万剂，受影响的可能是湖北、安徽、广东、河南、四川等24个省市的数百万人，我们也陆陆续续接到非常多疫苗案件的咨询电话，在接待咨询和办案过程中，我们发现，疫苗案件的鉴定和救济机制存在着重大缺陷：\n\n \n\n一、医疗事故技术鉴定方和预防接种异常反应鉴定组织方为利益相关方\n\n由于诉讼程序耗时过长，无法及时支付医疗费，疫苗案件当事人往往选择先走医疗事故鉴定（疫苗失效、变质，或接种流程不规范时）或预防接种异常反应鉴定程序（疫苗有效，接种流程规范时）。\n\n《预防接种异常反应鉴定办法》规定，“省级、设区的市级和县级疾病预防控制机构应当成立预防接种异常反应调查诊断专家组,负责预防接种异常反应调查诊断。”“受种方、接种单位、疫苗生产企业对预防接种异常反应调查诊断结论有争议时,可以在收到预防接种异常反应调查诊断结论之日起60日内向接种单位所在地设区的市级医学会申请进行预防接种异常反应鉴定”；这种规定忽略了大多数接种单位的公立性，忽略了疾控预防控制机构和接种单位的上下级和利益共同体关系，让可能是疫苗案件当事人利益冲突方的疾控机构组织鉴定，无法保证中立、客观、公正。\n\n《医疗事故处理条例》规定“卫生行政部门接到医疗机构关于重大医疗过失行为的报告或者医疗事故争议当事人要求处理医疗事故争议的申请后，对需要进行医疗事故技术鉴定的，应当交由负责医疗事故技术鉴定工作的医学会组织鉴定；医患双方协商解决医疗事故争议，需要进行医疗事故技术鉴定的，由双方当事人共同委托负责医疗事故技术鉴定工作的医学会组织鉴定。”这项规定同样忽略了我国医院、医学会的公立性，及其与卫生局的利益共同体关系，使得鉴定结果不具有可信度。\n\n二、缺乏集团诉讼渠道，维权成本高\n\n我国《民事诉讼法》第五十三条规定：“当事人一方人数众多的共同诉讼，可以由当事人推选代表人进行诉讼”。第五十四条还规定：“诉讼标的是同一种类、当事人一方人数众多在起诉时人数尚未确定的，人民法院可以发出公告，说明案件情况和诉讼请求，通知权利人在一定期间向人民法院登记。向人民法院登记的权利人可以推选代表人进行诉讼；推选不出代表人的，人民法院可以与参加登记的权利人商定代表人”。大规模影响性的事件发生后的分别诉讼会耗费过多家庭收入和司法资源，但我国实行的代表人诉讼只在确定原告具体人员的情况下才能进行，与发达国家代表人提起集团诉讼时无须明确集团的具体成员及明确授权的要求不同。代表人诉讼的这种限制性规定，使得疫苗失效或变质下对疫苗生产者和销售者的集团诉讼变得非常艰难，受害者想完成聚集、集体授权、选举等必要程序，几乎不可能。\n\n有鉴于此，我们提出如下解决方案：\n\n1.修改预防接种异常反应鉴定和医疗事故技术鉴定相关程序规定，允许当事人个人委托鉴定机构，允许异地鉴定机构鉴定，取消对私立接种单位、私立门诊、医院设立门槛的过度行政干预。修改《民事诉讼法》等集团诉讼配套法律，允许不确定人员的集团诉讼，完善公益诉讼相关规定。\n\n2.考虑到短时间内无法修改《民事诉讼法》等法律，建议由最高人民检察院或中国消费者协会代表疫苗消费者提起民事公益诉讼，对庞氏及上下游销售商、接种单位提起民事诉讼。\n\n3.鉴于短时间内《预防接种异常反应鉴定办法》《医疗事故处理条例》无法修改，公立医院和医学会仍占主导地位，建议由卫计委邀请世界卫生组织派出专家团队，对各地的预防接种纠纷的鉴定结果予以审查、监督，对鉴定结果持有异议的，可由世界卫生组织专家做最终鉴定。\n\n4.参考德国、日本、美国、台湾等19个国家和地区的经验，对不幸被'恶魔抽签\"的疫苗接种后的不良反应人群提供无过失责任的补偿方案，即建立疫苗接种强制保险制度，或药害救济基金制度，使公民打疫苗时没有后顾之忧。\n\n \n\n问题疫苗事件志愿律师团\n\n2016年4月9日"
		},
		{
			"post_id": 7,
			"title": "一长沙市民向30家北京三级甲等医院申请信息公开，希望唤醒沉睡的医疗信息公开规定",
			"date_published": 1462954037.9,
			"body": "一长沙市民向30家北京三级甲等医院申请信息公开\n\n 期望唤醒“沉睡”的《医疗卫生服务单位信息公开管理办法（试行）》\n\n                    【义务新闻线索  欢迎采访、报道、引用】\n\n  2016年4月19日\n\n \n\n \n\n2010年8月1日开始实施的《医疗卫生服务单位信息公开管理办法（试行）》（以下简称“《管理办法》”）在网络搜索引擎上基本上找不到依申请公开的相关案例，长沙市民杨占青打算唤起这些“沉睡”的规定，在医患纠纷居高不下的时代，希望能通过一些行动来提高医疗卫生服务工作的透明度，促进医疗卫生服务单位依法执业。\n\n杨占青在今天中午10点多通过邮政快递分别向北京市30家三级甲等医院各寄出一份医疗卫生服务信息公开申请表。\n\n“这30家三级甲等医院的网站都没有介绍负责本医院的信息公开机构信息，而按照规定是要向社会公布的，我有意选择国内数得上的医院来督促执行信息公开规定，若它们做不到，其他医院会更难”，杨占青说。\n\n \n\n为帮陷入医患纠纷的朋友 发现“沉睡”的《管理办法》\n\n杨占青一位广州的朋友蒋先生的妻子吴女士2015年10月份因为头疼去广州白云区第一人民医院就医，医生给她开了脑部CT检查，随后吴女士得知孕期做CT可能导致胎儿畸形，后经医院建议做了终止妊娠手术。这位朋友和吴女士都认为当时工作人员并未告知孕妇做CT的风险而投诉医院，而医院辩解已经做了口头告知。蒋先生反复投诉将近半年，中间也有媒体报道和行政部门介入，此纠纷仍然陷入各执一词的困境。\n\n当蒋先生联系到杨占青，希望法律专业的他能给一些建议。杨占青在了解医患双方责任中发现《医疗卫生服务单位信息公开管理办法(试行)》第十二条规定患者接受电子计算机X射线断层扫描技术（CT）前，医院应当及时、规范和患者签署相应的知情同意书，而医院和吴女士并未签署任何文书，白云区卫生和计划生育局在组织医患双方沟通中发现医院并未签署文书，但并按照《管理办法》对医院进行责任追究。\n\n    杨占青随后建议蒋先生和吴女士给白云区卫生和计划生育局提交“责令公开及处分请求书”，要求行政部门按照 《管理办法》向患者公开医疗清淡，并对医院不签订知情同意书的行为进行警告处分等责任追究。\n\n“这些对患者知情权有诸多保障的规定却很少人知道，行政部门也没有这方面意识，‘沉睡’的规定和一张废纸无疑”，杨占青说。\n\n其实早在2006年，为贯彻落实国务院关于公用事业单位推行办事公开制度的要求，促进医院依法执业，诚信行医，和谐医患关系，不断满足群众的就医需求，卫生部颁布了《卫生部关于全面推行医院院务公开的指导意见》（卫医发〔2006〕428号），在该意见中，对医院、妇幼卫生机构、疾控机构、社区卫生机构、乡镇卫生院等设置了信息公开目录清单，要求医疗机构根据自身条件向社会公开、向患者公开、向内部职工公开。\n\n    而《医疗卫生服务单位信息公开管理办法（试行）》更是规定了“公民、法人或者其他组织还可以依法向医疗卫生服务单位申请获取涉及其自身利益的相关信息。”并要求医疗卫生服务单位指定机构负责本单位信息公开日常工作，并向社会公开本单位信息公开工作机构的名称、办公地址、办公时间、联系电话、传真号码、电子邮箱等。\n\n \n\n向30家三级甲等医院申请信息公开 期望推动医疗卫生信息公开\n\n杨占青随后对医疗卫生单位的信息公开充满兴趣，他希望了解医院能否接受公民的信息公开申请，医院是否做了信息公开申请的指引，并打算做些公益行动去推动医院信息透明。\n\n他专门选择了医疗卫生相对发达的北京，通过国家卫计委医政医管局网站了解到北京共有30家三级甲等医院（不包括军队医院和中医院），在对这30家医院的网站进行浏览发现，没有一个网站有信息公开指引说明，便打算先对这30家医院进行信息公开申请，要求公开这些医院“负责本单位信息公开的工作机构名称、邮寄地址、电话及电子邮箱信息”，在所需信息用途一栏，杨占青填道：“按照《管理办法》规定，医疗卫生服务单位应当指定机构（以下统称信息公开工作机构）负责本单位信息公开日常工作，并向社会公开本单位信息公开工作机构的名称、办公地址、办公时间、联系电话、传真号码、电子邮箱等。但在贵单位网站上并未看到相关信息，为以后申请相关信息方便，特申请公开。”\n\n杨占青说按照《管理办法》规定，这些医院应当自收到申请之日起15个工作日内予以答复。“若这些医院在规定期限内不答复，也不做延期说明，我会按照《管理办法》的规定，一一进行投诉，希望北京的医院能带头做起来。”杨占青说。\n\n\n\n_附件二、信息公开申请书（核心内容）_\n\n**所需信息的内容描述**\n >   请公开贵医院负责本单位信息公开的工作机构名称、邮寄地址、电话及电子邮箱信息，将相关信息发我电子邮箱。\n\n**所需信息的用途**\n>   按照《医疗卫生服务单位信息公开管理办法（试行）》规定，医疗卫生服务单位应当指定机构（以下统称信息公开工作机构）负责本单位信息公开日常工作，并向社会公开本单位信息公开工作机构的名称、办公地址、办公时间、联系电话、传真号码、电子邮箱等。但在贵单位网站上并未看到相关信息，为以后申请相关信息方便，特申请公开。\n\n\n_附件四、30家医院名单_\n\n北京博爱医院\t北京市丰台区角门北路10号\t67563322\t\tcrrcweb@163.com\n北京大学第六医院\t北京市海淀区花园北路51号\t010-82801936\t100191\t[email protected]\n北京大学第三医院\t官方网页无法打开\t\t\t\n北京大学第一医院\t北京市西城区西什库大街8号\t83572211\t100034\tbdyyweb@163.com\n北京大学口腔医院\t北京市海淀区中关村南大街22号\t010-62179977\t100081\t\n北京大学人民医院\t北京市西直门南大街11号\t88326666\t100044\t\n北京回龙观医院\t北京昌平回龙观\t(010)62715511\t100096\thuilder@126.com\n北京积水潭医院\t西城区新街口东街31号\t010-58516688\t100035\tjishuitan2009@163.com\n北京肿瘤医院\t北京海淀区阜成路52号（定慧寺）\t010-88121122\t100142\t\n首都儿科研究所附属儿童医院\t北京市朝阳区雅宝路2号\t010-85695555\t100020\t\n中国医学科学院肿瘤医院\t北京市朝阳区潘家园南里17号\t010-67781331\t100021\tjijian8210@sohu.com\n中国医学科学院整形外科医院\t北京市石景山区八大处路\t010-88772233\t100144\t\n中国医学科学院阜外心血管病医院\t北京市西城区北礼士路167号\t88322674\t100037\t\n中国医学科学院北京协和医院\t（东院）北京市东城区帅府园一号，100730；（西院）北京市西城区大木仓胡同41号，100032\t69156114\t100032\t\n卫生部中日友好医院\t北京市朝阳区樱花园东街\t010-84205288\t100029\tzrylfzb@126.com\n卫生部北京医院\t北京市东城区东单大华路1号\t85132266\t100730\tbjyy@bjhmoh.cn\n首都医科大学宣武医院\t北京市西城区长椿街45号宣武医院\t83198277\t100053\t只有网页邮箱\n首都医科大学附属北京佑安医院\t北京丰台区右安门外西头条8号\t（010）83997000\t100069\tyouanyuanban@163.com\n首都医科大学附属北京妇产医院\t北京市朝阳区姚家园路251号（东院） 北京市东城区骑河楼街17号（西院）\t52277666\t\tbjfcyy@126.com\n首都医科大学附属北京朝阳医院\t朝阳区工体南路8号\t85231000\t100020\tchaoyangyuanban@126.com\n首都医科大学附属北京安贞医院\t北京市朝阳区安贞路2号\t64412431\t100029\t\n首都医科大学附属北京安定医院\t北京市西城区安康胡同5号\t16880120\t\tanding_xuanjiao@163.com\n首都医科大学附属北京地坛医院\t无网页\t\t\t\n首都医科大学附属北京口腔医院\t北京市东城区天坛西里4号\t010-57099114\t100050\t只有网页邮箱\n首都医科大学附属北京世纪坛医院\t北京市海淀区羊坊店铁医路10号\t63925588\t100038\tweb@bjsjth.cn　\n首都医科大学附属北京同仁医院\t无网页\t\t\t\n首都医科大学附属北京胸科医院\t北京市通州区北马厂97号\t(010)89509000\t101149\tbjxiongkeyiyuan@sina.com\n首都医科大学附属北京友谊医院\t北京市西城区永安路95号\t010-63016616\t100050\tbfhxjk@yahoo.cn\n首都医科大学附属北京儿童医院\t北京市西城区南礼士路56号\t(010)59616161\t100045\tbchcomplain@163.com\n首都医科大学附属北京天坛医院\t北京市东城区天坛西里6号 \t010-67096611\t100050\tbjttyyjw@163.com\n\n\n_附件五、相关规定_\n\n《医疗卫生服务单位信息公开管理办法（试行）》\n\n于2010年3月15日经卫生部部务会议讨论通过，自2010年8月1日起施行\n\n \n\n第十二条　医疗服务中的下列信息应当事先告知患者按照规定需要签署知情同意书的，应当及时、规范签署相应的知情同意书：\n\n　　（二）患者接受的超声、造影、电子计算机X射线断层扫描技术（CT）、磁共振成像（MRI）等主要辅助检查项目及其收费标准。\n\n（四）法律法规和临床诊疗规范规定的其他知情同意事项。\n\n \n\n　   第十三条　除本办法第七条、第八条、第九条、第十条规定的应当向社会主动公开的信息外，公民、法人或者其他组织还可以依法向医疗卫生服务单位申请获取涉及其自身利益的相关信息。\n\n \n\n第十五条　医疗卫生服务单位应当建立健全本单位信息公开工作制度，指定机构（以下统称信息公开工作机构）负责本单位信息公开日常工作，并向社会公开本单位信息公开工作机构的名称、办公地址、办公时间、联系电话、传真号码、电子邮箱等。\n\n \n\n第二十一条　医疗卫生服务单位收到信息获取申请，能够当场答复的，应当当场予以答复。\n\n　　不能当场答复的，应当自收到申请之日起15个工作日内予以答复；如需延长答复期限的，应当经本单位信息公开工作负责人同意，并告知申请人，延长答复的期限最长不得超过15个工作日。\n\n \n\n    第二十六条　县级以上地方人民政府卫生、中医药行政管理部门应当建立健全医疗卫生服务单位信息公开工作责任追究制度。违反本办法，有下列情形之一的，由县级以上地方人民政府卫生、中医药行政管理部门责令改正，给予警告；对医疗卫生服务单位直接负责的主管领导和其他直接责任人员依法给予处分：\n\n　（五）违反本办法规定的其他行为。"
		},
		{
			"post_id": 6,
			"title": "艾滋就业歧视案首获胜诉判决 贵州小伙历时23个月获赔9800",
			"date_published": 1462952131.8,
			"body": " \n\n近日，公益机构南京天下公获悉，贵州艾滋就业歧视案一审判决原告胜诉，被告贵州黎平县教育和科技局须在判决生效后7日内支付原告9800元经济补偿金。第二被告黎平县人力资源和社会保障局承担连带责任。案件代理律师江小龙是在5月6日星期五收到该判决书的。\n\n \n\n南京天下公创办人、现哥伦比亚大学法学院访问学者于方强表示，这是一个值得纪念的案件，这是自2010年第一例艾滋就业歧视案发生以来，唯一获得法院胜诉判决的案件。此前曾有江苏和江西艾滋就业歧视案通过和解获得最高4.5万元的赔偿，但并没有胜诉判决。“李成案弥补了这一缺陷，今后的司法实践都无法绕开这一判例。”于方强说。截止目前，中国共发生了7起艾滋就业歧视案，天下公为其中6起案件提供了法律援助，另一起案件（广州艾滋就业歧视案）正在诉讼过程中。\n\n \n\n相比于天下公的乐观，原告李成（化名）却有些疲惫。他说自己还没有准备好是否要上诉，需要和律师商量。“维权太累了”，李成对记者表示。“从我2014年决定维权到现在，已经有23个月了。其中有很多挫折，心理压力很大，如果没有律师和公益机构的鼓励，我早就放弃维权好几次了。”李成所说的“挫折”指，此案经历了劳动仲裁不受理该案，法院一审裁定不受理的尴尬。“如果不是我们致信最高法院院长，二审法院也很有可能不受理。”2014年世界艾滋病日前，李成和贵州另一艾滋就业歧视案当事人小海（化名）致信最高法院院长周强，呼吁保障艾滋病人的诉讼权利。小海于2010年遭受就业歧视并起诉至法院，但贵州当地法院并未受理，同时违反法律规定，没有给小海出具不受理通知，导致其无法行使诉讼权利。2015年1月，黔东南苗族侗族自治州中级人民法院裁定由黎平县法院受理李成案。\n\n \n\n李成的代理人、鼎尊律师事务所律师江小龙表示，尽管原告胜诉，但是法院判决并未支持原告提出的精神损害赔偿要求，这是一个遗憾。“这表明法院仅仅把该案当成是一个普通的动纠纷，而不是侵权案件，根本没有考虑到歧视对人精神的伤害。”江小龙说，“我们离《就业促进法》的立法精神还很远，还需要继续努力。”\n\n \n\n附：相关新闻报道链接\n\n \n\n全国第6例艾滋就业歧视案诉讼遭拒 前5例无胜诉\n\nhttp://news.163.com/14/1112/07/AAR67R4500014SEH.html\n\n艾滋就业歧视案：一个贵州艾滋病毒感染者的心路历程\n\nhttp://news.gog.cn/system/2015/03/27/014209625.shtml\n\n贵州两艾滋就业歧视案当事人致信最高院院长\n\nhttp://news.sina.com.cn/o/2014-11-30/155831224754.shtml\n\n"
		},
		{
			"post_id": 5,
			"title": "民间发布：政府信息公开救济机制观察报告 2016",
			"date_published": 1462545931.087,
			"body": "在《政府信息公开条例》实施八周年之际，民间公益机构OGICN发布《中国政府信息公开救济机制观察报告》，对各省（自治区、直辖市）的政府信息公开行政复议和行政诉讼情况进行了分析，并对今年即将进行修订的《政府信息公开条例》提出了修订的建议。\n\n----> [报告全文](docs/Ogi-8-ann-cso-report-OGICN.html)\n\n（首刊于：http://www.ogicn.org/news/201.html）"
		},
		{
			"post_id": 4,
			"title": "申请公开深圳交警局“禁摩限电”措施的相关依据",
			"date_published": 1462265108.5,
			"body": "> 　  深圳交警日前(3月29日)开始了“禁摩限电”专项集中整治行动，在全市设置150个整治点，针对主干道、地铁口、公交站点、口岸、商业区等摩托车、电动自行车兜客揽客乱象进行集中整治。3月29日，深圳交警开展了第二次“禁摩限电”集中整治行动。深圳交警在开展“禁摩限电”行动中零容忍，出重拳严厉打击摩托车、电动自行车非法拉客乱象。对于无证驾驶摩托车在地铁口、公交站点等区域聚集兜客揽客，违规使用电动（机动）三轮车，以及对“涉摩涉电”暴力抗法人员，将一律依法拘留。（来源：深圳商报）\nhttp://www.stc.gov.cn/JGDT/201603/t20160330_53866.htm\n\n> 行动开展以来，各单位共查扣电动车17975辆、拘留874人。通报称，据快递行业协会汇总统计，在两次集中行动期间被拘留的快递企业人员19人，经核实，共有16人有系统记录，均为“未取得机动车驾驶证驾驶机动三轮车上路行驶”；拘留期限5—10日不等，至4月4日，已有12人返回岗位。\n\n>　据通报介绍，造成上述情况的原因是，有的快递员在空车情况下，个别单位在执法过程中未能很好地区分出快递员工。此外，查扣的有备案标志快递企业车辆30余台，主要原因是违规走机动车道等。\nhttp://www.stc.gov.cn/JGDT/201604/t20160405_54023.htm\n\n**因此**，站长觉得这事有点大，“特区”政府不能乱来啊，你经济发达了、都开汽车了，就排挤掉用电动车维生的中底层民众了？政府乱出政策，也因公众没有参与。（记不记得，同是深圳交警局，2014年底，神不知鬼不觉突然宣布“小汽车限牌令”，还派特警封锁卖车4S店！——这样的政策、规定是不合法的， 不符合《立法法》关于法律、法规和规章的制定需有征集公众意见的相关程序。）\n\n因此，站长在2016年4月12日向深圳交警局寄出信息公开申请，问了四个问题：\n\n1. 请求公开贵单位的“禁摩限电”行政行为所发放的奖金的预算，以及截至收到本申请之日的奖金总额。\n2. 请求公开贵单位的“禁摩限电”行政行为所发放的奖金的预算的来源。若来自“财政预算”，请在《2016年深圳市公安局交通警察局部门预算》中予以标明并注明具体金额和所占总预算之比例；若为其他来源，请公开奖金提供者的名称和组织。\n3. 请求公开贵单位的“禁摩限电”行政行为已经发放的奖金的奖励标准和奖励对象。\n4. 请求公开贵单位在岗位职责内正常出勤执法进行额外资金奖励的法律依据。\n\n三个星期后，得到了这样的答复：\n![交警局回复1](img/sz-police-OGI-reply-1.jpg)\n\n![交警局回复2](img/sz-police-OGI-reply-2.jpg)\n\n你看……"
		},
		{
			"post_id": 3,
			"title": "政府信息公开申请手册",
			"date_published": 1462259010,
			"body": "**「基础阅读」**\n \n**问题一：什么是政府信息公开**\n\n答：政府信息公开是指行政机关依照法定程序，以法定形式公开与社会成员利益相关的信息。政府信息公开有两种方式：行政机关主动公开和依申请公开。本手册中主要介绍依申请公开，是指公民、法人（如企业）依照《政府信息公开条例》，要求行使政府职能的部门（如行政机关）依法公开政务信息。\n\n**问题二：为什么要申请政府信息公开**\n\n答：政府信息公开被认为是 2003 年“非典”最重要的“遗产”之一。《求是》2013年 2 月刊发温家宝文章《努力建设人民满意的政府》：“‘非典’疫情，以及由此引发的我们治国理政理念的转变，和一系列重大经济社会政策的调整，无论是对我国经济社会发展来说，还是对政府改革和建设来说，都是一件具有标志性意义的大事。”也正是从 2003 年开始，国务院成立《政府信息公开条例》专家起草小组。2008 年 5 月 1 日全国正式施行《政府信息公开条例》。从此，中国的政务信息公开步入“有法可依”时代。\n\n国务院法制办负责人张穹在答记者问时说：“阳光是最好的防腐剂，政府的权力运行过程公开透明会大大地降低腐败发生的几率。”张穹指出，政府信息公开便于从制度上、从源头上遏制和预防腐败。公布并实施政府信息公开条例是推进社会主义民主，建设法治政府、阳光政府、透明政府的重要举措。\n\n“政府信息公开以后，行政机关的职责权限、办事程序、办事结果、监督方式等信息能够为广大群众知晓，保障了人民群众的知情权、参与权和监督权，有利于人民群众监督政府部\n门正确地行使行政权力，实现依法行政，防止行政权力被滥用。”\n\n---\n<br />\n- 继续阅读请猛戳[网页版的手册](docs/OGI-manual-html.html)（无图）\n- 有图的完整PDF版：[镜像拆那](https://github.com/mirrorcn/mirror-CN/blob/master/%E6%89%8B%E5%86%8C%E5%92%8C%E6%8C%87%E5%8D%97/%E6%94%BF%E5%BA%9C%E4%BF%A1%E6%81%AF%E5%85%AC%E5%BC%80%E7%94%B3%E8%AF%B7%E6%89%8B%E5%86%8C.pdf)\n\n- 站长注：这只是第一步！寻求与政策制定者、当权者对话！"
		},
		{
			"post_id": 2,
			"title": "这里有什么？",
			"date_published": 1462118022.252,
			"body": "- 上传/发布 一些手册/指南，有助于维权和公众参与、政策倡导。\n- 政府信息公开申请、行政复议、行政诉讼、规范性文件合法性审查……等等方法的案例。\n\n\n他山之石：https://github.com/mirrorcn/mirror-CN\n"
		},
		{
			"post_id": 1,
			"title": "为什么？",
			"date_published": 1462112600.643,
			"body": "### 一个抗审查、抗屏蔽、抗下线的网络\n\n呼呼，终于！有个网络空间可以让我尽情地书写，直接地表达，再也不用担心写的字或发上来的资料因为“敏感”词汇而发布失败，或被墙。\n\n### 什么是Zeronet？\n\n一种“去中心化”的网络模式，没有中心服务器，每台连进来的电脑都是一台服务器，这个网络的内容，可以存在于每一台连进来的电脑上！因此，除非发布者本人删除，没有其他任何人可以干涉内容的发布。而且只要有一个电脑为某个网站做了种并开着，这个网站就是在线的，可以被访问到！\n\n了解更多请看这里：\n- 英文操作手册 https://zeronet.readthedocs.io/en/latest/\n- 中文介绍：https://xiaolan.me/zeronet-0.html  (自备梯子）\n- 程序源码和下载：https://Github.com/hellozeronet/zeronet\n\n### 为什么要做这个网站？\n\n天朝很多社会问题，虽然最根本是这个专制的政权，但民间社会也有一定的责任。这个国家的公民不参与关于自己社区、自己城市、自己国家的公共政策、法律的制定、执行的过程，不与当权者互动或施压，当权者自然可以胡做非为了。这就是所谓的“公众参与”。\n\n当然，公众参与是要理性的、非暴力的。公民需要有一定的法律知识、谈判能力和沟通对话技巧。参与到法律、政策的制定、执行和审查过程，防止政府滥用职权，限权问责。\n\n本站因而旨在提供一定资料供看客参考、学习，解决自己和他人遇到的困境，维护好权益。\n\n### Who is who？\n\n政策倡导（policy advocacy），就如同Hacker（骇客），他们凭着自己对计算机/网络的精通，玩遍自己和其他人的计算机，挖出系统/软件漏洞，凭着超能的自学和问题解决能力，对事物的本质和真相探求个究竟。一个政策倡导者也就是一个在政策上的骇客，对某个领域的社会公共政策（尽力）了如指掌，找出政策漏洞，对政策受害者以协助/维权，并推动政策的积极改革。\n\nPosted at May 01 2016\n\n"
		}
	]
}