{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": 1,
		"1615300036_1NrJoibEdrXzVEwJxwyMtHs79G9G29YmV4": 1,
		"1616490001_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": 1,
		"1619297900_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 1,
				"body": "The problem is once you start to limit what people can and can't say where do you stop? first its hate speech then fake news, next thing we end up fully 1984 speaking newspeak.\n\nbasically all speech including things you don't like or agree with and even out right bullshit has to be protected because the alternative is government  oppression.",
				"added": 1615381805
			}
		],
		"1610682330_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "someone should create a wrapper so we can dump files into s3 or blackblaze buckets as the storage is super cheap.",
				"added": 1615381912
			}
		],
		"1615284757_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 3,
				"body": "This year has shown us all the government love nothing more than to have complete control and people are willing to blindly follow the rules they set.",
				"added": 1615382349
			},
			{
				"comment_id": 7,
				"body": "> [anonymouslogin](#comment_253_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Combining concepts here....PCR testing for COVID with 35 or more iterations causes millions of false positive tests, in the US though 500,000 or more are dead. This means the virus is much more deadly then previously thought, but the vaccine is probably not necessary on a widespread scale because a virus that is more deadly is less likely to spread widely due to the morbidity and severity of the illness....thoughts?\n\nthere is little difference between a dead host and a recovered one to the virus,  killing you host is not an effective way to spread.\n\nif you look at the deaths its < 5% and its the most fragile 5%. The ones that eat taxes in health care costs and pay nothing back. The world could use a small depopulation.",
				"added": 1615464232
			},
			{
				"comment_id": 9,
				"body": "> [anonymouslogin](#comment_260_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): You helped make my point here, killing your host as a pathogen is a spread limiter. Virulence has actually saved the entire world from any number of pandemics. Perhaps this will be the same and the vaccine...perhaps the vaccine is for something else entirely. Here is food for thought. Promiscuous DNA or RNA strands integrated into your cellular replication can cause literally anything to be true for your physiology. By flipping an epigenetic switch people could be made deathly allergic to any common rare chemical....spray the metropolitan areas with that chemical over a vaccinated population and guess what? Game over. Now do what they tell you to do or else.\n\nThis is exactly my fear, mrna has  been researched for some 60 years and they where mocked for their ideas. I will never trust something that modifies your dna.\n\nhttps://www.macleans.ca/society/science/scientists-mrna-covid-vaccines/",
				"added": 1615562547
			}
		],
		"1615237176_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 4,
				"body": "> [frontline](#comment_12_1HJKoK5icacs175hMpyE5AQDozvmQDF1No): remember she laughed when her daddy supported those who raped our kids with impunity... she was happy to serve the pedostate. the state of the enemies of mankind... one day one day...\n\nso? if the news of late has shown us anything its that pedophilia is far more common than anyone thought, and if something is the rule rather than the exception trying to stop it is never going to work. Just look at the gay timeline and you'll see its the same.",
				"added": 1615382525
			}
		],
		"1615112255_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": [
			{
				"comment_id": 5,
				"body": "docker run -d -e \"ENABLE_TOR=true\" -v ~/zeronet:/root/data -p 15441:15441 -p 127.0.0.1:43110:43110 nofish/zeronet\n\nopen tor broken and go to about:config and search network.proxy.no_proxies_on and add 127.0.0.1 to the list\n\nlast step is to open noScript settings and add http://127.0.0.1:43110 to per site permissons, this is reset every time to close the browser so you'll need to redo this step",
				"added": 1615382722
			},
			{
				"comment_id": 6,
				"body": "> [xanadu](#comment_14_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Any chance you have docker-compose :D\n\njust made this for you\n\n    version: '2.3'\n    services:\n      zeronet:\n        image:  nofish/zeronet \n        volumes:\n          - ./zeronet:/root/data\n        ports:\n          - 15441:15441 \n          - 43110:43110",
				"added": 1615384205
			}
		],
		"1615341294_1H8kw4ERGwEvAsdM1oB46tK81RncwQLeoG": [
			{
				"comment_id": 8,
				"body": "none of the PDFs download does anyone have clear net links?",
				"added": 1615549741
			}
		],
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 10,
				"body": "isn't this an option on pretty much every single online platform?",
				"added": 1615814643
			}
		],
		"1615970209_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 11,
				"body": "normally theses sorts of insults mean you have won whatever discussion you were having and they can no longer refute your arguments and resulted to attacking you as a person.",
				"added": 1615975278
			}
		],
		"1615948566_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS": [
			{
				"comment_id": 12,
				"body": "I have a bash alias to run a docker image",
				"added": 1615993996
			}
		],
		"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2": [
			{
				"comment_id": 13,
				"body": "people still use it, its not completely dead.",
				"added": 1616234393
			}
		],
		"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG": [
			{
				"comment_id": 14,
				"body": "> [aplayer](#comment_5_14JFttTvjwR9PitBWPMU8FEqRCwACAeekM): I just know amd is baddest company at architecture design. I have 2 amd expensive graphics that are not usable.\n\n> [sabretooth](#comment_6_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): You'll find very few informed people agree with that, especially with how they're doing in the CPU market.\n\nand the fact that their GPU section is actually ATI and although owned by AMD is it s own entity.\n\nback when AMD released althon it shat all over intel, there was nothing they could do to keep up and had to result to hammer up the voltage and clocks just to keep up which increaed both power consumption and heat.\n\nThen intel came out with the core series this was a major win and AMD came out with the FX, which on paper was actually a very good designed it `lacked` in single threads and had slower performance as it had only 1 floating point unit per 2 cores. \n\nRyzen however is amazing design, allowing for high yields from the FAB, lower power consumption and very high core count.\n\nThere is no doubt that this is athlon all over again for amd, intel are getting spanked and AMD is loving it.",
				"added": 1617368355
			}
		],
		"1617049867_14yMvcYduUdrbFWW5taEgW1HgaFJgoSxZT": [
			{
				"comment_id": 15,
				"body": "or you can just fuck off mining on my machine :)",
				"added": 1617368441
			}
		],
		"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX": [
			{
				"comment_id": 16,
				"body": "read 1984, that's where the world is heading.",
				"added": 1617708244
			}
		]
	},
	"comment_vote": {
		"96_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"246_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8": 1,
		"15_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"83_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"260_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"17_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": 1,
		"2_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": 1,
		"90_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"1_1KkANbCsG8Naxc2u5oCaVr9agkAN9tGQCi": 1,
		"4_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU": 1,
		"110_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": 1,
		"294_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_14L3nYs5oE6mrFd6dp2siSGMjXtCAYU1YX": 1,
		"22_1HVwr4J7Hd5iENz5hnBE4z4j1K3L85AAMg": 1
	}
}