{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"1598537511_15QhKCBKHERPhEpR1DCXx4Ue8VAEiVWXwf": 1,
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"1600586345_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": 1,
		"1602120041_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"1603744262_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1606601124_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": 1,
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": 1,
		"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607899896_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1608115429_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1608462575_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": 1,
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": 1,
		"1611623437_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1611883036_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"1613196054_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": 1,
		"1615021326_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"1617435563_1KZdUJK67R6bzE4w2tXQTvkKNfmsqubWoD": 1
	},
	"next_comment_id": 87,
	"comment": {
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 1,
				"body": "I see ZeroNet as a foundation that I can build upon. Userbase doesn't matter all that much. Linux has like 2% of the market and it's still awesome.  It's just somewhat troublesome to find content without a search engine.",
				"added": 1592075716
			},
			{
				"comment_id": 19,
				"body": "It's a quality of small communities that cannot be maintained upon growth. Additionally, without having the ability to verify claims made, you cannot be sure whether those claims are true, substance or not. Also, your verification method could be faulty. Thus, there is some deep truth in the famous words of Socrates: I know that I know nothing.",
				"added": 1594304195
			},
			{
				"comment_id": 24,
				"body": "It's not called future speak, it's called newspeak. Everything old is new again or something like that.",
				"added": 1594483182
			}
		],
		"1592157079_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 2,
				"body": "Hate is the escalation and redirection of love. It is impossible to hate if you do not first love.",
				"added": 1592236223
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 3,
				"body": "If there was a way to gain immortality by continuously sacrificing and using the blood of children, do you think nobody would be willing to pay the price? Even if it was just a hoax, I'm willing to believe that there are people out there both capable and willing to test it out.\n\nPeople are willing to sacrifice others in slave labor just to get a new phone. I wouldn't depend on people's morality too much.",
				"added": 1592236642
			},
			{
				"comment_id": 4,
				"body": "Ignorant people without morals exist, yes. And I'm fairly sure that depending on your viewpoint, this characterizes pretty much every human ever.",
				"added": 1592244481
			},
			{
				"comment_id": 5,
				"body": "Patents aren't things that actually work, unfortunately. They just describe things very broadly. I once tried to implement something based on a patent and the thing was full of equations that self-referenced each other in a way that circled around. At the end you were at the beginning without any result. I'm convinced patents are only used to be able to sue each other, they do not hold any knowledge.",
				"added": 1592255627
			}
		],
		"1593004202_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 6,
				"body": "Only if they ever manage to get the search to find everything.",
				"added": 1593021815
			}
		],
		"1593271955_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 7,
				"body": "Somewhat along those lines: https://www.crowdsupply.com/eoma68/micro-desktop",
				"added": 1593510530
			}
		],
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": [
			{
				"comment_id": 8,
				"body": "The underlying issue lies within the human brain. Being around people that are not like you causes stress to humans. As long as it's only few people that are unlike you it's unnoticeable, but as soon as you are outnumbered it kicks in. The safest way for everyone involved would be strict segregation. \n\nPeople made up the word racism and pretend like it's something that can be overcome. But it can't. Just like you can't overcome starvation. It's part of the human condition and it would be more productive to acknowledge this. Being outnumbered by people that are not like you puts huge stress on your brain. It's probably a survival instinct. Maybe you can find some people that do experience this, evolution is still ongoing, after all. It just won't help much, since there are still millions of people out there affected by this.\n\nRacism isn't learned behavior, it's a manifestation of a hardwired response our brain makes. Segregation is the only viable solution if you don't intend on genociding everyone that isn't like you or racemixing everyone together.",
				"added": 1593560055
			},
			{
				"comment_id": 9,
				"body": "Brainwashing isn't that easy. It's true that high IQ people have it easier to not act on their instincts, but by the very definition of IQ and its normal distribution, half of all people are below average IQ. You can't ignore that half when making policies. Racism is just one of the names given to this. Fans of opposing sports teams can get violent with each other for exactly the same reason. Or people of different religion. Or political parties. It's just that you can't change the color of your skin and the structure of your bones (albino Africans are still easily recognized as Africans, despite having white skin). As long as it's not obvious that someone you've met is in some way different from you, there's no issue. Just like you can have a pleasant conversation with someone on the train, even if that person happens to be a serial killer. As long as you don't know, you won't fear for your life.",
				"added": 1593598709
			},
			{
				"comment_id": 11,
				"body": "Only people with really high IQ 130 and up have the capacity to not act on their instincts based on reason. With lots of efforts you can get everyone with an IQ above 85 or so to train to ignore their instincts. For example to get soldiers to run into a minefield having to ignore their survival instinct.\n\nGetting along isn't a problem either way. You can get along with a tiger, too. It's just that your brain will continuously be alerted. The problem is the stress it puts you under. Or more precisely, that there is no way to stop this stress. If you have a tiger as a pet, you can lock it up somewhere and the stress will be over. And like I said, there are some folks who do not experience this alertness. They are the kind of guys getting eaten by their own pet tiger.",
				"added": 1593792206
			},
			{
				"comment_id": 12,
				"body": "It's not an analogy, it's an example. If you're in company of people who are like you, your brain isn't working against you, at least. Also, your brain is like that for a reason: evolution. People who had this alertness for strangers happened to be good at having children. Another instinct that most people can't do much about is feeling disgust about insects. Or feces. \n\nThe problem with instincts is that you can't do much about them. Try convincing yourself to eat insects. It's incredible hard if not outright impossible for lots of people. Of course, some don't have this problem, but we're looking at a problem affecting the entire population, so you need to take everyone into account.\n\nEven if you manage coexistence with people that are not like you, you will always instinctively favor people who are like you. Be it when choosing a spouse, an employee, a boss, an hairdresser, whatever. That's why even when mixing lots of different people, they will mostly segregate themselves into small groups of people who are like them. You cannot do anything about this. It's hardwired in our brains.",
				"added": 1593819704
			}
		],
		"1590855688_13ynUw2jD5FnBomqnq5vENr5ioWY7VEtTA": [
			{
				"comment_id": 10,
				"body": "https://voat.co/v/all/new",
				"added": 1593604843
			},
			{
				"comment_id": 41,
				"body": "Aren't scripts the things websites run that you block if you care to? What you say makes no sense whatsoever. If you don't want windows spying, run Linux yourself. If you don't want the website spying, block their spying scripts yourself.",
				"added": 1605608174
			}
		],
		"1593886909_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": [
			{
				"comment_id": 13,
				"body": "Why should I care? Also, their site doesn't have the buzzwords \"open source\" nor \"free software\", so I immediately dismiss it.",
				"added": 1593890145
			},
			{
				"comment_id": 14,
				"body": "There's a difference between freeware and open source. A major one at that. As long as it is proprietary software I'm not going to use it. Got burnt more than once using free proprietary programs. The problem is that if the owner shuts it down, you have no recourse but to stop using the software. If it was open source, you could just fork it.",
				"added": 1593941003
			}
		],
		"1593959660_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 15,
				"body": "Ask your favorite search engine that isn't Google since they censor this \"SAO read online\" and pick among a few dozen different sites offering this for free.",
				"added": 1593982477
			},
			{
				"comment_id": 16,
				"body": "Use a different search engine. First result I get: https://swordartonlinemanga.com/",
				"added": 1594034020
			},
			{
				"comment_id": 17,
				"body": "So which search engine were you using anyway? I know that Google censors things like that and so should DuckDuckGo, since they are just Google with a different layer of spyware on top. Surprisingly enough bing doesn't censor this and neither does searx.",
				"added": 1594166402
			},
			{
				"comment_id": 21,
				"body": "Yeah, DDG censors stuff, by virtue of using Google under the hood, which censors stuff. DDG is like Google, they just lie about themselves. Probably to catch users fed up with Google to prevent them from using alternatives that don't spy. Otherwise it doesn't make much sense that DDG gets shilled all around the clearnet like a miracle cure.\n\nSources\nhttps://archive.is/qntuk\nhttps://www.stoutner.com/new-default-homepage-and-search-engine/",
				"added": 1594373429
			},
			{
				"comment_id": 25,
				"body": "Search engines that don't spy on you and don't charge money either will likely always have some shortcomings.",
				"added": 1594542741
			}
		],
		"1594178844_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 18,
				"body": "Only a court of law can find out. And the outcome might be different each time.",
				"added": 1594207865
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 20,
				"body": "Truly Clown World.",
				"added": 1594323812
			}
		],
		"1594440525_17WS8Y1keB3p8ELXFPbX1ZRLfeCESyojtF": [
			{
				"comment_id": 22,
				"body": "..and just the other day I was pointing out the inherent censorship of DDG and how it's shilled everywhere.\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1593959660_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8",
				"added": 1594470623
			}
		],
		"1594475002_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 23,
				"body": "Beta was better than VHS and still horribly lost the format war of old. Beta was a proprietary format from Sony and VHS open for everybody. The only reason Blu-ray won is because everyone moved on to streaming.\n\nIf it's not open source I treat it as if it didn't exist, since that's the fate of abandoned proprietary software.",
				"added": 1594482975
			}
		],
		"1595539570_14DNyAMGhtRAujyha8zv5Gv6WNCEbotvcj": [
			{
				"comment_id": 26,
				"body": "Alpine is great for docker images. Docker is a superior version of virtual machines.",
				"added": 1595541047
			}
		],
		"1596079219_1LVZEMhitcYT5Q7bw5Hy9qWURWK5UaSfd6": [
			{
				"comment_id": 27,
				"body": "It's better to cut up videos like this in small 10min sections dedicated to a single topic. It's a lot of content to digest for a single video. It might even be better to make even shorter videos to focus on a single task, but if you care for the YouTube thing, their algorithm favors stuff that hits 10min. If the goal is just to teach others, then just go with one video that is as short as possible to accomplish one task. \n\nRepetition is important for learning and smaller videos dedicated to single tasks make it easier to repeat exactly the things you don't yet fully grasp.",
				"added": 1596136821
			}
		],
		"1597484759_14ADWoY886HnM8jPeipXarxAfyQANiMTQj": [
			{
				"comment_id": 28,
				"body": "Not too excited about bitrate starved movies, tbh. What's even the point of watching a movie with atrocious quality? Like the ones you can find on archive.org for public domain movies. To be barely watchable, you'd need at least 3gb for an one hour movie. Though, I prefer the ones exceeding 10gb, of course. \n\nCurrently, I'm interested in movies from around 1920 to 1949. For example some Lon Chaney movies, like Phantom of the Opera (1925) or Hunchback of Notre Dame (1923).",
				"added": 1597508372
			}
		],
		"1600281891_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 29,
				"body": "Generally speaking, media that people get outraged about isn't as outrageous as you'd expect. I won't find out this time, however. If it can be helped, which it can, I don't watch modern movies with niggers. Something horribly went wrong around 2013 making these all cringy as fuck to the point where I just gave up.",
				"added": 1600425432
			},
			{
				"comment_id": 30,
				"body": "This isn't the beginning of the end. For that you are a few hundred years too late. WWII was basically the end of any meaningful resistance already. Now we're just on a roadmap towards total destruction. Just like Rome was. Next up, the new dark ages.",
				"added": 1601027565
			},
			{
				"comment_id": 31,
				"body": "Having control of my own life won't alter the course of history, unfortunately.",
				"added": 1601543918
			},
			{
				"comment_id": 32,
				"body": "Government is full of puppets. Remember when people went out and had their fun killing nobles and kings? Nobles and kings were puppets, too. Even if you go in and destroy all the puppets, nothing will fundamentally change. You'll just get new puppets or maybe become a puppet yourself. Looking back in history however, I can't think of a case were the new puppets were better.\n\nThe puppets in government are people just like you. Thinking of them as traitors already shows that the puppet masters were successful in dividing you. Not that it takes much. Unifying people is hard, dividing them is easy. You can divide people however you want. Poor and rich, employed and unemployed, white and black, men and women, by age, by occupation, by political views, by nationality, etc. etc. \n\nFunnily enough, during WWII, people of the Air Force would feel more camaraderie with the enemy pilots than with their own foot soldiers, because they were more similar to the enemy pilots. Also, they wouldn't have to kill each other, just shoot each other down, so it was more of a sport than war up there in the air.",
				"added": 1601556889
			}
		],
		"1601625369_1GxcXMQvC2wXWVLVFeC4EyJiphuChLnGR": [
			{
				"comment_id": 33,
				"body": "The only hardware aspect I really care for is battery life and that is strongly tied to efficient software or the lack thereof. I install something that promised to filter out blue light and will also dim the screen, saving lots and lots of battery life this way. Ironically Android constantly reports this app as eating battery in the background, when it does exactly the opposite. I can go days without charging, despite normal use. \n\nAlso, the screen needs to be big. I'm especially disappointed by the small width. Phones increase in height, which doesn't matter to me, but they are kind of stuck at their current width. \n\nA headphone jack is a must. Wireless headphones are too easy to lose. \n\nDon't do the stupid notch thing. As I said, screen estate in height is pointless.",
				"added": 1601636432
			},
			{
				"comment_id": 34,
				"body": "My hands are big enough to even use a small tablet one handed like a phone. \nBlue light triggers our brains to be awake. They use it inside long tunnels, for example. Blue light also makes everything brighter. If you've got one of those LEDs where you can switch the color around, try it at night to switch from red to blue and see how much brighter the entire room gets.\n\nFiltering blue light in the evening out of your screens helps with sleep, since blue light constantly signals our brain to be alert/awake. For phone screens there's the additional benefit of not attracting mosquitoes and other bugs with the screen light. Bugs will naturally fly towards blue light. (White light contains blue light.)\n\nBlue light filters are part of the defaults nowadays, even Win10 has one build in. A pretty good one at that. But the ones for phones are lousy, so I use an app that is better at this. The downside is that I have to turn it off in bright sun light.",
				"added": 1601723233
			}
		],
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 35,
				"body": "Is this an alternative to cloud storage? Why not just save it on your own system with offsite backups in your friends or relatives houses?",
				"added": 1602233455
			},
			{
				"comment_id": 36,
				"body": "The people who are capable of pressing the button \"restore\" usually are incapable of setting the whole thing up, so they are still at the mercy of the people who can and if they think it's less hassle to not move to the cloud, that's how it's going to be.\n\nIf you're basically targeting tech illiterate people, the setup has to be one button, too. Reaching them through ZeroNet might prove impossible, though.",
				"added": 1602442915
			}
		],
		"1602684360_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 37,
				"body": "Depends on your setup. If you have access to the router and he doesn't, you can limit his speeds through that. You can even set it up to only limit speed during the night hours. Failing that all I can think of is to use up all the bandwidth yourself.",
				"added": 1602689240
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 38,
				"body": "Something to do against depression is exercise to the point of exhaustion. That's when the body releases all kinds of chemicals that help with depression. Big pharma wants to sell everyone pills against everything, but most ailments can be fixed by changing what you eat and exercising. As stupid as it sounds, it works. \n\nExposing your skin to direct sunlight also helps with depression, if you're a lazy bum like me and can't get yourself to stick to an exercise routine. Or, failing the availability of direct sunlight, daylight lamps or if you want to buy pills, Vitamin D supplements. \n\nPersonally, whenever I get down and feel like shit I stop what I'm doing and do some serious exercise. Even if it's only a few minutes of lifting. After that I always feel better. But it has to get real bad for that, since I basically hate exercise.",
				"added": 1603127058
			}
		],
		"1603894128_1JV9baqEPCwXcpw8YUJGNDvLJWhi2JTVMV": [
			{
				"comment_id": 39,
				"body": "If it's older than around 2015 and you don't want to use it as your main system, but to fool around, go for either Void or Artix. I installed Void on a 2005 laptop and it's usable, especially if you only use suckless software on it: https://suckless.org/rocks/",
				"added": 1603964507
			}
		],
		"1605530541_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 40,
				"body": "ZeroNet doesn't promise anonymity and I never expected it.\nWhat I like about ZeroNet is that it removes the single point of failure that servers basically are and allows me to fool around building a hobby site that doesn't have monthly fees attached that would increase with the popularity of the site. Though, I haven't yet figured out how to actually publish my hobby site, it's not a problem, as it's not presentable yet anyway.",
				"added": 1605557505
			}
		],
		"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 42,
				"body": "> [nekololi](#comment_497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): promise you will see a day where gab and parler, for example, take up the task to censor whatever they consider problematic or undesireable.\n\nGab already censors stuff they don't like. Don't have to wait for that to happen.\n\nOn Bitchute older videos will eventually become unseeded and thus inaccessible.",
				"added": 1606053115
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 43,
				"body": "No one could ever satisfactorily explain to me why racism is a bad thing. The way I see it, racism (and xenophobia) is a survival instinct inherent to all people.",
				"added": 1606129034
			}
		],
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 44,
				"body": "What are good steps to take to prepare oneself?",
				"added": 1606129156
			}
		],
		"1606985120_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 45,
				"body": "Because ZeroNet is easy to use and I like the idea of having a website without having a server running 24/7. I don't like javascript, but nothing is perfect.",
				"added": 1607031330
			}
		],
		"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 46,
				"body": "When I first heard of the concept of dissenter (the addon) I thought it was a neat idea, but then found out that you have to make an account with gab, I think it was, which were two red flags. First for gab, which openly censors stuff they don't like, second for having to make an account. The browser thing just happened because the addon got banned everywhere. I still think it's a neat concept, but it should be decentralized. If it took off, you'd just changed the authority that can ban/hide/shadowban comments. Kinda like reddit, where you can create subreddits about specific a specific site outside of that specific sites mods reach to ban, but you're just within the reach of someone else to ban you. The fundamental problem isn't solved. Someone else can remove what you said and prevent you from saying more.",
				"added": 1607384248
			},
			{
				"comment_id": 47,
				"body": "Like I mentioned, gab is a site with their own bias and they delete content they don't like and ban users that post it. They not only have this ability, they make use of it already. It might only be niche content for now, but the precedent bodes ill for the platform.",
				"added": 1607442577
			},
			{
				"comment_id": 79,
				"body": "For anyone interested: https://spyware.neocities.org/articles/dissenter.html",
				"added": 1613226178
			}
		],
		"1607500928_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 48,
				"body": "What's missing or what I haven't found is a search engine to discover stuff. With a search engine and an effort to clone most stuff from the clearnet over, the thing could grow on its own. Not sure if that would be a good thing, though. The way the clearnet got ruined was by getting everyone on it.",
				"added": 1607520337
			}
		],
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 49,
				"body": "I guess the biggest problem with projects like these is that you are essentially crafting ghost towns, by copying an infrastructure designed to scale up for millions of people, but not designed to scale down to accommodate a dozen. \n\nVoat on the clearnet has the same issue, and basically lives off the people reddit bans. It's somewhat like people new to Linux trying to recreate their Windows workflows. \n\nTo take off, being a copy won't be good enough.  There needs to be some value to attract people. The value of reddit isn't the infrastructure, but the content the people contribute. But I don't know how to solve this chicken-egg-proglem.",
				"added": 1607596630
			},
			{
				"comment_id": 50,
				"body": "Trust is difficult to gain, but easy to lose. It's the default attitude for people living in society. For example, it's a natural thing for people traveling by train to help others with their luggage. But if this trust is ever exploited to rob them, this natural trust gets replaced by wariness. \n\nThat's the advantage of the clearnet. It operates on people's default trust. But it's an uphill battle to gain the trust of the people that got their trust betrayed. Which is pretty much all of them, but not everyone has realized yet. Only the ones that realized will show up around these parts, though.\n\nSo now the question is how to trust anything on the Internet again. I don't have an answer for this.\n\nBut manipulative algorithms is only scratching the surface of things. It's much more comprehensive than that. Reflect on the things you read on the Internet and try to evaluate whether it can be trusted. Like a review on a popular internet shop. Bad or good, it is certain that a large percentage of them are paid for to manipulate your impression. Can you tell which are genuine and which are not? Or a news report. Same story. Can you distinguish truth from lie? Or an online forum. Same exact thing. It's impossible to tell for sure which are genuine people and which are paid shills. Even worse, AI has gotten good enough to become really, really difficult to tell apart from fellow humans. Most people even lack the basic awareness that AI, that is hard to distinguish from humans is a thing that exists. Manipulators have easily scalable methods to reach most people. Even without the AI, there are services where you can buy real humans doing this thing for you and it's possibly even cheaper than the AI solution.\n\nOnce you realize the dilemma, how can you ever trust anything on the Internet again? Verifying everything personally doesn't scale and often isn't possible at all. Just take a common example from recent years. X raped Y. How would you even go about verifying this claim?\n\nThat's where I'm stuck. How do you reliably tell truth from lies?\n\nIs this even a problem that is solvable on the technical side of things? Software is even harder to trust, since it's always just one update away from being compromised. And the updates for these kind of things come really, really fast. \n\nDon't get me wrong. I like that this project exists. It's a 'something'. All I'm doing is talking, which usually doesn't accomplish anything. It's just that I'm seeing little hope for the reasons I stated.  I'd say nevermind the trust issue and let's focus on providing some value, but the trust issue might be the most crucial thing in this context. Since ignoring it, you might as well just set up shop on the clearnet.",
				"added": 1607637686
			}
		],
		"1607663597_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 51,
				"body": "This comes to mind: https://files.catbox.moe/rlmnwz.jpg",
				"added": 1607719518
			}
		],
		"1608025556_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 52,
				"body": "1945 minus 1933 equals not six years. First get your primary school math right, then we can talk about the other nonsense you're spouting.",
				"added": 1608028573
			}
		],
		"1608023788_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 53,
				"body": "It's not really about morality, it's about the hand you are dealt. If you're weak, you have to promote compassion and gather other weaklings around you. If you're strong, you don't have to do these things. Nobody is arguing for their own demise, not even if they realize that their own demise would be a good thing. To do so would be a sign of mental illness. Like people committing suicide. You take the hand you're dealt  and make the best of it.\n\nYou're correct that history is written by the victors and you should also know that the National Socialists lost the war. How you can combine both of these facts to arrive at the conclusion that you know anything that is true about the National Socialists is beyond me, though.",
				"added": 1608065987
			}
		],
		"1608115429_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 54,
				"body": "It's not that I don't game anymore, it's just that I don't have the time to invest in these kind of big games. So I just replay my old games every now and then or try a hack of one of my old games, like Super Mario 64 Star Road. Stuff you can play for ten minutes to half an hour and then quit.",
				"added": 1608150943
			}
		],
		"1608149924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 55,
				"body": "Thinking you can get rich by having someone pay you a salary is faulty reasoning. If you want to get rich, be the one paying the salary.",
				"added": 1608152747
			},
			{
				"comment_id": 56,
				"body": "> [quantumkitty](#comment_498_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I agree. But we're not talking about getting rich, only living a middle class lifestyle.\n\nMiddle class is a concept that won't be around for that much longer if we keep going at this pace. Not sure if this is a bad thing, either.",
				"added": 1608218473
			}
		],
		"1608542019_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 57,
				"body": "Googles purchase of Youtube in 2006 has ended Youtube. From then, it was just a matter of time.",
				"added": 1608543963
			}
		],
		"1609355588_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": [
			{
				"comment_id": 58,
				"body": "It's not like bandwidth is something in limited supply. I don't need RSS updates every 60s, but I don't care enough to figure out and/or touch the default settings of newsboat.",
				"added": 1609609945
			}
		],
		"1609357450_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 59,
				"body": "All forums I knew died. It's not that they were taken down or anything, they just became ghost towns. Maybe that's why there's nothing particularly great on that front. Admittedly, forums failed at their intended purpose of becoming web archives of content. All of them were too complicated to navigate for visitors and everything useful put into them became outdated quickly. \n\nSites like reddit weren't that much of an improvement, either. But at least they admitted that there's not much point to the whole archive things, so content has become more volatile and nobody is told to post into a thread that was last posted into two years ago and that is hard to find instead of just starting a new one. That spirit is very much alive over at the stackoverflow side of things, though. And it's killing all interest in newcomers to contribute over there, too. But at least stackoverflow managed to become a relevant archive of information that doesn't expire quite as quickly. \n\nThe solution would obviously be to marry the volatile nature of reddit-clones with the archive goal of stackoverflow to generate a self-updating problem solving website to tackle every possible question in existence as many times as it is asked, most likely refining the answers with every cycle.\n\nAnyway, what do you want a forum for anyway? I kinda got sidetracked here.",
				"added": 1609623283
			}
		],
		"1609975971_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 60,
				"body": "Why is something like Twitter needed? I never used it and don't see any reason to.\n\nReddit is just an aggregator for communities and all communities will have to develop hierarchies upon reaching a certain size. Communities are also echo chambers, that's the secret sauce that makes them into communities. That's not a problem tech can fix. \n\nYou'd need something quite different from reddit that prevents communities from forming, while still providing a similar service. You can impede communities from forming by having all participants be anonymous to each other, so when someone posts something, no one can easily associate a post history. But that's not sufficient. Another measure would be to prevent users from filtering their own content. Filter bubbles are mostly created by users themselves by engaging in things they agree with and disengaging from things they disagree with. That's how online communities form. \n\nOf course, without the community aspect there's nothing holding things together. Only the value the site provides. Which wouldn't be much, since you'd have to prevent users from only engaging with the things they want to prevent the communities from forming.\n\nI guess there's no way around at least a loose community. Think Stackoverflow, but everyone is anonymous to each other and nobody has the ability to delete questions.",
				"added": 1610018986
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 61,
				"body": "Here is the evidence: https://hereistheevidence.com/",
				"added": 1610364949
			}
		],
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 62,
				"body": "Are both implants mandatory?",
				"added": 1610465668
			}
		],
		"1610611550_1ASwoyvUC5DBAECJFQ7WqZVazYdo1HKiDp": [
			{
				"comment_id": 63,
				"body": "True, a working search engine is essential to the whole eco-system. If you can't find useful information on here, it might as well not exist. \n\nBut having it work like on the clearnet, where you have to crawl and index everything yourself likely isn't feasible. I wonder if it could work when this was reversed and zites had to go to the search engine to tell it they exist and what they are about. Maybe have that place be public and all the search engines could crawl over that data, so there could be competing search engines based on public data that everyone can add information to.",
				"added": 1610623136
			},
			{
				"comment_id": 64,
				"body": "How is sort by popular solving the problem of \"I made a new zite, how are people going to find it\"?",
				"added": 1610707971
			}
		],
		"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": [
			{
				"comment_id": 65,
				"body": "As a clearnet search engine alternative, there's searx, but for youtube I haven't really found something that could replace it. Maybe peertube, but the content is lacking. I tried bitchute, but they also just censor and old videos won't get seeded so they become unwatchable. Also, the video quality is really bad.",
				"added": 1610708194
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 66,
				"body": "Just use Nextcloud Talk and don't trust stuff you don't host yourself. If only all these applications could talk to each other, then I wouldn't have to have half a dozen of them installed.",
				"added": 1610802606
			},
			{
				"comment_id": 67,
				"body": "About briar: I don't trust any project with a code of conduct like this https://briarproject.org/code-of-conduct/\nLanguage like \"Community leaders\" is an immediate, major, blinking red flag for me. It means people are more interested in who you are and what you do - even outside of the project - than they are about the project itself.",
				"added": 1610803117
			},
			{
				"comment_id": 68,
				"body": "> [orien3242](#comment_51_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP): if its not open source and 3rd party verified its not good. Full stop.\n\nThreema is Open Source. https://threema.ch/en/faq/source_code",
				"added": 1611229952
			}
		],
		"1611726067_13tGzarcdadLitoZsqPPW8WHypGtdNxz9L": [
			{
				"comment_id": 69,
				"body": "Why would you want to contribute to upgrading your own filter bubble? Exposing yourself to banned viewpoints is part of the reason to leave censored platforms, isn't it?",
				"added": 1611747037
			},
			{
				"comment_id": 70,
				"body": "That's what a filter bubble is. Ignoring viewpoints you don't like and only listening to viewpoints you do like. Search engines contribute by figuring out what you do and don't like and showing you results based on what they know.\n\nYour defaming of viewpoints you do not like doesn't change the concept. Muting is a crude solution to the spam problem.\n\nIf you enjoy censored platforms, alternatives like ZeroNet might not be the best solution for you. If you're not careful fascists will be the least of your problems, what with all the child porn communities floating around.\nPretty much by design, the people getting banned everywhere else are the first ones to discover and use alternatives like ZeroNet. Their hand is forced, after all. \n\nI'm also just here since I find the tech interesting, but I'm not on a personal crusade against viewpoints I dislike. After all, I could be wrong. Maybe the earth is flat and there's a serious conspiracy on the level of Santa Claus going on, only perpetrated against grown-ups and children alike. Or maybe not. But I don't feel the need to deplatform flat earthers. Generally, I'm only interested in the truth and for that the first step is to concede that I could be wrong about everything I know. Therefore I want to be exposed to all kinds of different viewpoints with the goal of verifying what I think I know. But that's just me. You do you.",
				"added": 1611749057
			},
			{
				"comment_id": 71,
				"body": "Let's not forget that people thirsty for censoring views they didn't like are partly to blame for the mess the clearnet is in right now. Makes you wonder how multiculturalism is supposed to work, when each group insists on\n\nIt's kinda like people moving from Windows to Linux, who instead of figuring out how it's done in Linux, just want to replicate their old ways. The unfortunate part is that there's nothing that would help them figure out that running Microsoft Excel in wine is maybe not the most optimal thing to do.\n\nBut they totally can. Just like they can mute 'assholes'. No need to think deeply if you can make stuff you don't want to think about disappear with the press of a button. There's nothing wrong with that, either. But maybe, just maybe there's a better way to do things. Or maybe there isn't.",
				"added": 1611759830
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 72,
				"body": "Not until it's circulated for at least two years. Not taking my chances with an untested vaccine, that hasn't been in use for at least two years.",
				"added": 1611910758
			},
			{
				"comment_id": 73,
				"body": "How can I infect other people that chose to get the vaccine? Isn't the vaccine designed to prevent exactly that?\nBesides, using that logic you'd have to ban cigarettes in public, since second hand smoke is exponentially more dangerous.",
				"added": 1611921881
			},
			{
				"comment_id": 74,
				"body": "This thing is going on for nearly an entire year now. The full hospital excuse begins to sound rather strange. You can build a new hospital within a year. But then all of this is rather strange, what with the masks that have holes for some instrumentalists and the grocery stores still being open instead of being forced to do delivery.\n\n..or the countries that don't even encourage masks in the grocery stores.",
				"added": 1611951715
			}
		],
		"1612007867_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 75,
				"body": "You don't need a checklist to tell facts apart from opinion. A fact is something that can be verified by yourself. Simple as that. If it cannot be verified, it's a theory. Of course, verification is very difficult for a lot of things that some people like to pretend are facts. Like the existence of god. That's why the narrative tells you to believe, not to verify.\n\nAlso, Mark Zuckerberg isn't secretly a lizard. He's secretly an android. But that's not a fact, it's just a theory.\nYou're welcome.",
				"added": 1612030984
			},
			{
				"comment_id": 76,
				"body": "Actually, the Russians said that the moon landing was fake. In my country it's not even that controversial. Everyone is aware that the Americans faked it, since they couldn't beat the Russians in all the other landmarks of the Space Race™.",
				"added": 1612095786
			}
		],
		"1612534044_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 77,
				"body": "How many lies can you fit into one article. Apparently an overwhelming amount.",
				"added": 1612538908
			}
		],
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 78,
				"body": "What impedes ZeroNet adoption is that there isn't a search engine in your face when you start out. Without a search engine, the user experience is crippled. All you can do is look around featured sites and click your way around until you get bored. Maybe you find a worthwhile zite, maybe you don't. The time investment is high, but there's no guarantee to find anything. \n\nIt's this kind of friction that is the problem.",
				"added": 1613167012
			}
		],
		"1613222411_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 80,
				"body": "Too much centralization. Of everything. The fix is to avoid it where you can, make other people aware of the problem and create/use decentralized alternatives.",
				"added": 1613226773
			}
		],
		"1613258600_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 81,
				"body": "I only remember Sci-Fi always being wary of new technology. Not sure how Terminator (1984) was optimistic. The book 1984 (1949) also seemed to paint a rather pessimistic outlook for the future. Mostly the messages we got from Sci-Fi was that technology will turn against us. Like the 1956 Sci-Fi classic Forbidden Planet. Sci-Fi and dystopia if not outright apocalypse have always gone hand in hand.",
				"added": 1613300968
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 82,
				"body": "The parallel universe theory is just one attempt to resolve the first time travel paradox. But it cannot fully resolve the paradox. Say you travel from the year 2020 of timeline A back to the year 2019, reach timeline B and kill yourself. A parallel universe resolves the paradox of killing your previous self, but what if you wait two years in timeline B and than travel back to the year 2020 of timeline A, only to kill yourself before going out on your adventure. The paradox is back. \n\nIt's like resolving the origin of life by saying life came from outer space. It doesn't resolve anything, it just introduced indirection.",
				"added": 1613383783
			},
			{
				"comment_id": 83,
				"body": "As an addendum, if you want to resolve the paradox by establishing the rule, that each time you time-travel you create a new parallel universe, so you wouldn't be able to go back to your original timeline A, after having traveled to timeline B, you make time-travel completely meaningless, since that would mean no time-traveler could ever reach our timeline A.",
				"added": 1613399027
			}
		],
		"1613425717_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 84,
				"body": "Linux Mint. \nYou might want to use a rolling release for your own needs, though. \nStability also means no easy way to install up to date versions of software that might include fixes for issues you experience. That's why I'm planning on switching to Artix in the future. Currently test driving it on my laptop. But only once long term support for my current install runs out.",
				"added": 1613474083
			}
		],
		"1617149531_16badkisTTGDcQf3YmZ9ra8b9PnhaJTynx": [
			{
				"comment_id": 85,
				"body": "I don't bother with politics. I'm here because the tech is cool and I think the centralized Internet is flawed. Take Google for example. They make money with ads, so when you search for something, sites that use Google Ads magically appear at the top. \n\nCentralization is easy, but creates power structures that are then easy to abuse. Think about YouTube. All the content is there, so everyone searching for a video will go to YouTube. Now if you're a video creator, where do you upload? Where the eyeballs are. So now YouTube has become the only viable choice to both watch and upload videos to. \n\nIf instead there were many video sites and many search sites that each would let you search over all of them, wouldn't that be better for everyone involved? Power wouldn't concentrate into few people's hands and therefore abuse opportunities wouldn't arise. \n\nSame thing with Microsoft, Apple's AppStore, Steam, Netflix etc. etc. etc. \n\nCentralization gives power to the platform owners which is then easy to abuse. \n\nGovernments are no exception. Wouldn't it be way better for everyone if the USA and the European Union just disbanded? World Government is stupid. Countries should be smaller. People all over the world are different and it's easier to satisfy everyone's needs and wants if there aren't so many opinions to considerate.",
				"added": 1617193286
			}
		],
		"1617435563_1KZdUJK67R6bzE4w2tXQTvkKNfmsqubWoD": [
			{
				"comment_id": 86,
				"body": "Not just since yesterday, mind you. The switch occurred around 2014. \nhttps://a.pomf.cat/dwfewn.png",
				"added": 1617443178
			}
		]
	},
	"comment_vote": {
		"1_19ZHTs6h2KhwL1X5vrRkUmoyDRk9Muwsap": 1,
		"42_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"10_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"6_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"3_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"6_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": 1,
		"24_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"1188_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9": 1,
		"497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"1200_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"49_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"1208_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"23_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"2746_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"53_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"1_15cQMmBd5VDA4Ye4Aq2xcmXhuPd8w8vrJ6": 1,
		"416_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"86_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": 1,
		"59_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"2_1LqGNexResiFRowJMZ5pd1VvKDBgJA1r3b": 1,
		"4_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq": 1,
		"1_1P49qK814LXkWtXWu9PvWEwDQC7iDagpGV": 1,
		"5_1CDMo8F3AQjnZcsXLyf7p4xnNhGDQSUT5E": 1,
		"28_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"3_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": 1,
		"1_1EvNcAayp2Umf6EZwtZqu9fAxV9a7zDiUj": 1,
		"2_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": 1,
		"47_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"5_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"40_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"41_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"67_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"4_1AmREURqCZmJEr8bH1zQgJd1kGrnqkeTiy": 1,
		"3_1BGkjiYVSWuenLNRJoghTFwdCKMgJCRZXL": 1,
		"51_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"18_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"54_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"71_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"76_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"77_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"27_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"72_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"82_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"14_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"69_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"86_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"3_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"5_13UNccDwDNZx97EtsahFYrU3e5u4YGFbs7": 1,
		"5_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"32_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"88_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"12_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"2_13kyRkukBSEXhXA3w72Gv1mo5n7Pgtuqg5": 1,
		"8_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"7_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"3_1KqRW6E7xaTFMVsErAKaN48V6pq3cq8L3z": 1,
		"68_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"109_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"117_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": 1,
		"1_1851aFpye4naTGR1817guf36cbuw8mmvXL": 1,
		"67_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"15_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"555_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"30_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"74_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"6_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": 1,
		"90_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"2_1MPubcGr8qkduM8Bbx5NYvMXcpk4C7Dyup": 1
	}
}