{
	"next_comment_id": 76,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [pycole](#comment_1_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): We really need a page like this as a readme or something. There seems to be another influx of new users (from Hacker News and TorrentFreak, it seems), and I've seen people asking if there's a search engine every few hours or so.\n\nWell when you first start up ZeroNet, the home page is *supposed* to do something like that. But it really just ends up pointing people to ZeroBoard which sucks, and ZeroTalk, where people ask for something like this page.\n\nAs for a search engine, ZeroSearch isn't really all that great. It was made a few months ago, and doesn't have the newer sites. The dev apparently has to add them manually after people submit requests. So in the mean time, I'm cloning it and seeing if I can make something more usable. We'll see how that goes.",
			"post_id": 2,
			"date_added": 1456980473
		},
		{
			"comment_id": 2,
			"body": "> [perception](#comment_1_1CL2jU9pTjtMasNihDK3JCofdPWq2ZVGuu): Nice, but the links in your search results are broken.\n\nAre the links fixed now? It was doing some weird stuff with the search.kaffie.bit domain and when using the chrome extension. I just hard replaced it with http://127.0.0.1:43110/",
			"post_id": 4,
			"date_added": 1456993707
		},
		{
			"comment_id": 3,
			"body": "> [oxilic](#comment_1_1PNyuY1iZqXBpft4ArouqcnE4pNRGYij5i): So you just copied the source code for zerosearch and changed the design a bit?\n\nAs I mentioned in the blog, I indeed cloned the site. I've made several modifications though, and I plan on doing more. I mainly did it for my own personal use, since I can't stand ZeroSearch.",
			"post_id": 4,
			"date_added": 1457049622
		},
		{
			"comment_id": 4,
			"body": "> [thevideovault](#comment_1_1DfkDpkeDXGbHJ2ZT31DPvYr5xR59Jr8BA): Can't blame them for borrowing, but when they inflate their index by ignoring duplicates that is just sloppy.\n\nThat's what I figured. Which is why I've provided the tools to properly clean out duplicates. I don't really have an issue with them copying the index, which is why I made it even easier to do so. The issue is having sloppy indexes and results. I'm providing what I see to be a quality service. If that improves the overall search environment of ZeroNet, then mission accomplished.",
			"post_id": 5,
			"date_added": 1457146086
		},
		{
			"comment_id": 5,
			"body": "> [pycole](#comment_2_1KwTTgPRSTHFmmJAFBt6kQfdyNeSM5KJuH): Neat! one issue though: In discover mode, there's no indication that the tags are clickable (they look like plain text), and the checkbox for discover mode is unlabeled. Just some cosmetic issues to consider.\n\nYea, I wasn't sure what the best way of displaying all this is, so I just did a write up here on this blog. Making each term a visible blue link, and having text next to the checkbox would be incredibly clunky. As it is now, it's clean, even if it's a not exactly clear and user-friendly.",
			"post_id": 6,
			"date_added": 1457165622
		},
		{
			"comment_id": 6,
			"body": "> [thevideovault](#comment_2_1DfkDpkeDXGbHJ2ZT31DPvYr5xR59Jr8BA): Hey how did you do the \"Read More\" button for your blog post?\n\nYou do a line break. 3 '-' in a row wherever you want it to cut off.",
			"post_id": 2,
			"date_added": 1457393229
		},
		{
			"comment_id": 7,
			"body": "> [thisguy1337](#comment_1_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao):  I highly suggest you do the same to your search results as it's much easier on the eyes to have different sizes for the title/description with a line break.\n\nAlright. I went ahead and took your advice. How's it look? I was also considering adding a visual indicator of the site address, but making it display ends up making the search take longer. So I left it out.\n\n",
			"post_id": 8,
			"date_added": 1457587060
		},
		{
			"comment_id": 8,
			"body": "> [thevideovault](#comment_6_1DfkDpkeDXGbHJ2ZT31DPvYr5xR59Jr8BA): I am trying to also edit content.json to remove the cloning option. Can you describe the steps you used in detail? I've tried editing and saving content.json, then clicking \"save site settings\" (which doesn't appear to do anything), then \"sign\" and as soon as I do that it resets content.json.\n\nThat's what I did. Specifically I went into the content.json, made 'cloneable=true', and then attempted to save and publish right before I wrote this article. As it turned out, it had reverted the content.json. So then, I tried to edit the file once again. I made the changes, and saved the file. But this time, I decided to try and \"save site settings\", since I realized that it properly changed the name/description. So I did that, and then before signing/publishing, I made sure to check whether it's clone able. I can't remember if it was, but if so, change it back again. Sign. Make sure it's still there. Then publish.\n\nDon't sign with the terminal, sign with the actual dragged out sidebar when you're on the site.",
			"post_id": 10,
			"date_added": 1457914680
		},
		{
			"comment_id": 9,
			"body": "> [thisguy1337](#comment_2_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): Please don't be angry about that, I asked the guy to do it [1] because I enjoy his UI but love your index.  I'm hoping each Zite can have their own perks. I really enjoy Kaffiene's peer count system.\n> [1] - http://127.0.0.1:43110/0list.bit/?Topic:1_19z3VucxwAoyQZwhmjEgA6vJ9TTp2GmGLN\n\nI'm not angry at all. I just noticed some issues and reported on them. There's *not* 1000 unique sites, there's only 600. I really like the 'Kaffiene search' idea. It helps improve searching in general. There have been site count issues in the past, and I noticed my script wasn't catching these ones. I'm just being upfront about what I see and what I do. Kaffiene's index is freely accessible for this very reason. It's just important that if you're going to report numbers, to make them as accurate as possible.",
			"post_id": 18,
			"date_added": 1458783360
		},
		{
			"comment_id": 10,
			"body": "> [thisguy1337](#comment_3_16bxMyoL49mWYhcZKBYVBT5zEFW9SQpiao): @ 0 confirmation, but some nmc is otw, keep up the great work. :)\n\nAwesome. Using it to register Kaffiene.bit.",
			"post_id": 18,
			"date_added": 1458787480
		},
		{
			"comment_id": 11,
			"body": "> [bwoi](#comment_1_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L): Those \"duplicates\" are not technically duplicates - you merged two separate indexes, which are used in two different places (one is for one search option, one is for another) which means that there are only 4 duplicated that the user will see - which means that the script is correct.  \n\nHuh? The Bwoi script was reporting counts based on the merged lists. The reported 1000+ and 4 duplicate count was what was reported on the site, along with what my script reported. That report is inaccurate. If you were going to report two separate indexes, you should make that clear.\n\n>We are not 'misrepresenting' search results either, I've tried to bring back some functionality and I'm going to be working on more stuff. \n\nThere was a button labeled 'Kaffiene Search' that did not accurately pop up Kaffiene search results. That's misrepresenting search results.\n\n>We don't use regex searching - or siterank for that matter - to keep things simple and present the user with what they want to see. \n\nThat's fine. But if you're reporting something as Kaffiene's results, it needs to actually match what would pop up in Kaffiene.\n\n>At some point in the future we'll implement search logging to put sites where they need to be on the results table, so that more popular sites are at the top.\n\nYou can display sites however you please. That's really none of my concern.",
			"post_id": 18,
			"date_added": 1458984983
		},
		{
			"comment_id": 12,
			"body": "> [wired](#comment_1_1MA9FAQkvuKGyyr29ecGJ3FtMjPKBtJhpU): thank you for the review on ERR0R, Also, i think your search engine is the most advanced one out there :)\n\nERR0R is definitely the style of search I've been waiting to see pop up. And yea, I try. I'm really glad to see all the various search engines popping up. We're actually starting to see some decent offerings.\n\n> [muja](#comment_4_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): The second link is dead. Should be this. :)\n\nFixed. I accidentally just put the address with nothing else and it formatted it as a relative link. Whoops.",
			"post_id": 19,
			"date_added": 1460219238
		},
		{
			"comment_id": 17,
			"body": "> [bwoi](#comment_2_1F1kDrT693w8ATbcXV1wHmGSD6SpSY4f5L): \n\nAmusingly, I was planning on getting zite types (blog/talk/chat/etc) tagged depending on some stuff that commonly appears when cloning. Since my current method likely won't catch it. I still haven't filtered out dummy text (like that linux bit on every blog), and it only grabs a list of terms that were already tags. Instead, I want to make it to grab only the most used keywords. And yea, the site index format really needs to go. It's clunky, breaks with certain tags/titles, etc. I want to change it to a full JSON/sqlite system, so that you can 'follow' Kaffiene and get search functionality right on the homepage. But that's probably a ways off.\n\nI'm really wondering how I'm gonna get those ~800 (and growing) sites tagged. My current script is pretty slow, and doesn't really provide quality results yet. I don't want to do them by hand, but I might just break down and do it.",
			"post_id": 23,
			"date_added": 1470713350
		},
		{
			"comment_id": 18,
			"body": "> [dickwad](#comment_1_1bnmc9XsY2kyqwqjKmpWyBDbwyniqRzy1): looks complicated\n\nThat's because it's mostly a hack. I hope official support for changing hubs will come soon enough.",
			"post_id": 25,
			"date_added": 1470986114
		},
		{
			"comment_id": 19,
			"body": "> [p2p](#comment_1_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): Great! THX for sharing. What's the post size limit of Red/Blue hub? and space limit?\n\nRed/Blue are capped at 50kb by default. Infinity I think is at 5mb, and Kaffie hub is at a whopping 10mb. Obviously these can be raised/lowered per user if the hub owner wishes.\n\n> [musickiller](#comment_1_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): so... why would I do that exactly?\n> I think an optimal choice is for thise who post non-stop is to create a profile on the Red hub, write 1 post like \"Follow my hub for more: [link]\", and create their own hub with only 1 profile - theirs. This way, people like me, who don't want (can't) download tonns of data for a single user's posts, would not need to do that.\n> I'm not sure that any migration is needed in that case =D\n\nBecause there's an increasing number of people fed up with nofish's low caps. And ZeroMe is *made* to be decentralized and have many hubs. That's the whole point. If everyone's only on red hub or blue hub, eventually the size of those will balloon up into several hundred megs and later gigabytes. Having more hubs (and switching hubs) let's people migrate to smaller hubs so they don't need as much data, or to go to a hub with less restrictions so they don't need to keep bothering the hub owner.\n\nHaving 1 hub per person would work (it was discussed in github whether it should be 1-per-person or hubs), but the problem is seeding. With a 1 person hub, there's not really any incentive to seed that hub unless you want to follow the one user who's in it.\n\nBasically, if you care about decentralization, more hubs = better. This is a guide on how to switch hubs, so you're not stuck on the one you randomly clicked. I just plugged my hub because of the high cap and to help decentralize things.\n\nEdit: It's worth noting you *must* download everyone who's part of a hub's data. Meaning that the main hubs (red and blue) will be bloated and you'd have to hold it all. Rather than the few Kaffie hub users who may or may not get to 10mb (I'm currently at ~20kb or so).",
			"post_id": 25,
			"date_added": 1470997145
		},
		{
			"comment_id": 20,
			"body": "> [musickiller](#comment_3_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): I ment that there should be an index of users and personal hubs (or small group hubs).\n\nYea, there should definitely be an official way of seeing all the hubs. @Bot has made a way to view all the hubs people are in, using his [zerome clone.](http://127.0.0.1:43110/1NFiNiTYxiKn5PJo9eDEsiusJJUFkew5Vo/?Create+profile#) And ZeroMe already has an official users list.\n\n>As long as your hub is small, I'll seed it with pleasure from all my devices. Red hub has a higher priority in my mind only because most new users will join official (or largest) hubs first.\n\nCertainly. The point is that I'm trying to move people *away* from the official/large hubs. Decentralization and all that.\n\n> What would happen if I just deleted my folder from old hub and created a profile in new one? As you might guess, I don't care much about my old messages. I have a blog for archiving.\n\nYou have to make sure you sign/publish, otherwise it won't *really* be deleted. But say you overwrite your data.json with nothing. Assuming you did it in your home hub, it'll delete your bio, all of your posts, all of your comments on your home hub, and all of your likes on your home hub. As well as all the people you follow. Your posts on other hubs will remain untouched (as you didn't delete your file on those hubs). If you then create a new profile, it'll create it properly, but not propagate the changes through the other hubs. So either you delete your user data from all the hubs you interacted with, or you modify them.\n\nIf you leave them be, some weird issues start to occur, where you get a double profile and such. This also happens a bit when people still follow your old profile. That's why I wrote out this guide. I originally had some issues when I simply clicked 'join' on a different hub.",
			"post_id": 25,
			"date_added": 1471007085
		},
		{
			"comment_id": 21,
			"body": "> [weakish](#comment_1_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): .In the end, sign and publish with own key (I guess this is the only way, cause hub changed breaking original commenter's signature.)\n\nAFAIK you can't sign other users' content unless it's on your own site. And if that's the case, there's no reason not to just migrate all the user's content anyway. So I'm not sure how much this would help.\n",
			"post_id": 25,
			"date_added": 1471214118
		},
		{
			"comment_id": 22,
			"body": "> [klauszimmermann](#comment_2_15QGRquMETTn5LnCHjTm1qa9eaXGtq7gpT): Nice!\n> Could you point to the dent in ZeroMe where you saw the instructions?\n\nThere wasn't instructions. I saw Jaythezero's comment about it [here.](/me.zeronetwork.bit/?Post/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/1NAaF8VitwKSPo79RzJFhqz14gndmdWcGV/8) And I simply went ahead and copied the js and html files, and made the appropriate changes to my data.json and dbschema. Though, I was originally exposed to the idea [from this blog, linked from the official zeroblog.](/19k2nhubaYsDJNPHL6iNs3D2K9Mgj66P4R)\n\n> [sleepyhowl](#comment_1_1HpYtqXhZDwfNNtH6AHvDcNbD7syU7uFvN): Thank you ^^For sure I will take a look at this idea.btw do you know why the read me button show and other times left a wall of text in the main page?\n\nThe 'read more' appears wherever I first use a line break (which you do like this: `---`). If no line break is used, the whole post is shown on the main home page. I'm always conflicted whether I should break up long posts or not.",
			"post_id": 27,
			"date_added": 1471491310
		},
		{
			"comment_id": 23,
			"body": "> [muja](#comment_5_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): How does the Nanasi ID/KaffieID work? Where is the username stored?\n\nFor Nanasi/KaffieID the names are not unique. They're simply a name/label attached to the cert. Your user certs (for all ID sites) is stored in `zeronet/data/users.json` You'll see something like this: \n\n```\n\"kaffie.bit\": {\n        \"auth_address\": \"myauthaddressthatappearsintheusersdatafolder\", \n        \"auth_privatekey\": \"privatekey\", \n        \"auth_type\": \"web\", \n        \"auth_user_name\": \"kaffie\", \n        \"cert_sign\": \"longsignthing\"\n      }, \n```\n\nNanasi automatically generates the auth_user_name based on your auth_address (which is uniquely generated per site for each user). KaffieID instead lets you freely choose it. The cert_sign is based on a few factors. In Nanasi this includes your name. Meaning that if your name changes, you get a different cert_sign. In kaffieID I avoid making the sign using your name, so that you may freely change it and keep the same credentials (auth_address, privatekey, cert_sign).\n\nUnlike ZeroVerse or ZeroID there's no 'list of users'. You can't see who's been issued a KaffieId (or Nanasi), and usernames are not unique, meaning that two people may have the same name, but different auth_addresses. This means that KaffieID is entirely private and anonymous. You can generate certs offline, you have no way of seeing other user's who've made certs, and you have no way of knowing what names have been selected.\n\nAs I mentioned, KaffieID is freely cloneable. If you check the index.html (or rather, the index-default.html) you can see a bit at the bottom that mentions to uncomment a section to generate a new site key for signing, and to adjust the domain pointer. The genid.js file is everything responsible for signing certs (along with the bitcoin.js include for certain lib functions).\n\nHopefully that clears things up.",
			"post_id": 28,
			"date_added": 1471750488
		},
		{
			"comment_id": 24,
			"body": "> [spawn](#comment_1_1rVzPYdY5NJLM5vzA93mQNjuWoMVd9gDu): Where I can use KaffieId? I created one, but it dont want work. I change in ZeroMe profile to this one created with KaffieId, but when I post something it goes Content publish failed.. On Zeroblogs or Zeroforums I cant choose profile created with KaffieId (in list with profile its have grey color and cant be clicked).\n\nAt the moment, only ZeroMe works with it. The rest of the ZeroNet demosites only accept ZeroID (and likely only ever will). However, sites can change their cert select code to allow more than just ZeroID. As for 'content publish failed', I think that's an issue ZeroMe has with non-ZeroID accounts. However, you can see that I have successfully used KaffieID [here.](http://127.0.0.1:43110/me.zeronetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/1MEaxKqZWGEqFH62TRNEEZuNh8iX4nnq5f/)",
			"post_id": 28,
			"date_added": 1471815658
		},
		{
			"comment_id": 26,
			"body": "> [spawn](#comment_2_1rVzPYdY5NJLM5vzA93mQNjuWoMVd9gDu): Hmm. I write comment with Kaffie ID, but only in my spawn account I can see it. I tried fresh install, and there isnt this comment from spawn Kaffies ID under this topic.\n\nYea, I'm not sure what's up. There seems to be a signing/publishing problem and I'm not sure why.",
			"post_id": 28,
			"date_added": 1471912767
		},
		{
			"comment_id": 27,
			"body": "> [p2p](#comment_6_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ): yep, video streaming will be the killer feature if ZeroNet has.\n\nKopyKate seems to be the best service for video streaming. However, there *really* needs to be a solution to dead links. KopyKate uses some sort of webseeding solution, which I found works excellently on some videos (2mb/s download) and horribly on others (20kb/s). While non KopyKate videos posted are almost always dead.\n\nI've seen IPFS proposed as a solution a few times, but outside of a couple of particular videos, most of IPFS's files fail to load for me. It also requires external software outside of ZeroNet. Not a clean solution.\n\nThe last option I saw was an 'optional big files' thing. That might work, but it looks pretty complicated.",
			"post_id": 31,
			"date_added": 1481877735
		},
		{
			"comment_id": 28,
			"body": "> [kindlyfire](#comment_3_1FTFKztuv4Z5uy6iS83k9hB2xtS6yFnDxx): Nice to see you are still here ! Started to wonder if you were gone. (not that I showed my presence a lot)\n\nWell I've poked my head in every now and again. I've just sort of been distracted and depressed. Medical issues. I still love ZeroNet and haven't forgotten about it. I'm just *really* bad at getting myself to work on stuff. I'm kinda glad to see you here still as well :)",
			"post_id": 31,
			"date_added": 1482210704
		},
		{
			"comment_id": 29,
			"body": "> [zero](#comment_1_1DLf7WXLCVK3VyLtV3gawnBjTynYeRyhgh): Hi, I tried to configure my zeroblog to accept the alternativ IDs, like KaffieID, and I did on ZeroNet/data/1zite_direction/data/users/content.json\n\nLooks like your content.json is correct. Did you add the right code to allow *selecting* the cert? In your javascript files there should be something like this:\n\n```\nPage.cmd(\"certSelect\", {\n\t\t\"accepted_domains\": [\"kaffie.bit\", \"zeroid.bit\"],\n\t\t\"accept_any\": true\n\t\t});\n```\n\n'accept_any' will make anything accepted (but you'd still need them listed in the content.json for some reason). I like to make sure kaffie.bit is listed under 'accepted_domains'. For the record, that's literally copied+pasted from this blog ;).\n\n",
			"post_id": 29,
			"date_added": 1482210960
		},
		{
			"comment_id": 30,
			"body": "> [programdog](#comment_1_1BA2fUtT5cqyWHx4p3caoEYo2YFGU5dnn4): [bug]:When I came in this size,there are so many tags under the title.But it's gnoe after I have clicked that title and it never shows again.\n\nYeah, that's one bug with the blog software I use. I haven't really looked at it, and it's easily fixed just by refreshing. Not really an issue, but I might look into it later.",
			"post_id": 33,
			"date_added": 1482610015
		},
		{
			"comment_id": 31,
			"body": "> [tester999](#comment_1_1H8fXQf3qMUcEwEP1X2x4SoTWK8wHh4nCW): I'm a bit new to zeronet.  I just finished NoFish \"ZeroChat tutorial (new)\".  I was able to modify it with tipue into a simple search engine.  I found your site from a link from https://zero.acelewis.com/.  I read your explanation of how the site grabs new links.  I was thinking about how I would do it.  Could you pull the site visitors have on their local machines, and use that to make an index?  When you look at the start page it list them with then number of updates.\n> My example site is at.http://127.0.0.1:43110/1CBoYyapthhSJfhCcYs5RX8yfFacwkPYU5\n\nUnfortunately you can't do this. I had a similar idea when I first made Kaffiene. Have it automatically grab the sites the user has visited (like in ZeroHello) and then submit them to the index. Unfortunately the ability to see all the sites a user has visited is only available to NoFish for the official pages. There might be a way to have users manually choose to give admin permissions to a search site, and then do it. But that sort of defeats the purpose of having it automatically do it. At the moment user submissions or crawlers seem to be the only way of managing an index.",
			"post_id": 31,
			"date_added": 1484529681
		},
		{
			"comment_id": 32,
			"body": "> [emacsen3](#comment_1_13XLBAQjKBQzDnmuYdhNnwRGYe5XdPsXLQ): i can't find data.json,what is the path\n\n`/data/users/[your id]/data.json` for each hub you're in. ",
			"post_id": 25,
			"date_added": 1488329245
		},
		{
			"comment_id": 33,
			"body": "> [tesztelek](#comment_1_1JLMVnLTd72f6UiP16P3XxkKLyatmt9PSu): Why I should change?\n\nIf you want to for whatever reason. I personally changed because the default hubs didn't give me enough space and I constantly hit the limits.",
			"post_id": 25,
			"date_added": 1490466474
		},
		{
			"comment_id": 34,
			"body": "> [tesztelek](#comment_2_1JLMVnLTd72f6UiP16P3XxkKLyatmt9PSu): Where can i see whats the different between this 2 hubs? Sorry Iam new here i would like to know more.\n\nThere's not really any way to see what the difference is between the various hubs. It *generally* shouldn't matter which one you are on. But I find @nofish sets the posting limits *way too low*. So I made my own with an absurdly high limit. Generally if you're happy as it is, then it's best not to move. Since the default hubs will be seen by the most amount of people.",
			"post_id": 25,
			"date_added": 1490492658
		},
		{
			"comment_id": 35,
			"body": "> [sickphone](#comment_1_1HvxgPnxu6yB9Ao8AS4zMH4Zo9QLyjGv21): When you update jour search engine? Because there music site for example\n\nYeah, I know I need to update my search engine. Sorry about that.",
			"post_id": 34,
			"date_added": 1492391355
		},
		{
			"comment_id": 36,
			"body": "> [jayofthezero](#comment_2_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): Is this still relevant? Can't remember if NoFish made this easier or not.\n\nI don't think he did. AFAIK it should still work and be relevant.",
			"post_id": 25,
			"date_added": 1492391463
		},
		{
			"comment_id": 37,
			"body": "> [thecuriousnerd](#comment_1_16esmH5mTmsJL4S5DW4dup5883xJh6GdDS): Do you by any chance know where one can find a list of hubs?\n\nI'd suggest [0hub.bit](/0hub.bit). That lets you quickly download all the relevant hubs. Kaffiene's list is a bit outdated like the rest of the index.",
			"post_id": 25,
			"date_added": 1492746885
		},
		{
			"comment_id": 38,
			"body": "> [erneraude](#comment_1_1JwPBvZYXLJzrA6YisjpsyTuuieFLCARS6): Maybe we can sort the zerome users by number of followers?\n\nIs there an easy way to grab the number of followers for a user? Might take some effort but I like the idea.",
			"post_id": 36,
			"date_added": 1493279421
		},
		{
			"comment_id": 39,
			"body": "> [dantox](#comment_1_124r7zJTeBXwvYzBSd1FzxPViL3J967VWm): Hi Kaffie,\n> My question is marginally related to the post but is not completely off-topic i suppose.I just went to go to your hub,(from http://127.0.0.1:43110/me.zeronetwork.bit/?Create+profile i clicked on \"Join!\" button by Kaffie hub) and i got:\n> User dantox@zeroid.bit already exists on this hub\n> But i do not remember tried to join your hub before. Am i being silly or this is kinda strange? Sorry for my noob question. Reading your post and a comment below, i suppose that i do have to change me zeroid for something else and then follow instructions in your post?\n\nYou should *never* got to the 'create profile' page if you've already been using ZeroMe. I explicitly discourage this in the guide. Just make sure your data files are formatted in the way directed by the guide. They'll almost certainly be a mess by this point though, due to going to the create profile page multiple times. Namely you just need your main content on which hub you want your account to be. You need the user list (1UDb...) to point to your hub. And you need to change all of the hubs that you commented in to refer back to your main hub, and to remove your main content from there.\n\nEdit: Actually, I went ahead and took a look at your files on the hubs, and it looks like you're okay. No weirdness. Just follow the guide and you should be good to go.",
			"post_id": 25,
			"date_added": 1494554315
		},
		{
			"comment_id": 40,
			"body": "> [gzz](#comment_1_1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9): Hello Kaffie,I got some problems, and the instructions don't apply to my situation.Here is the Thing: I was on bluehub and it was all fine, while after changing to a new computer and I accidentally clicked  'create profile' in whitehub,  it messed up. I didn't know your method at first and tried to delete my user folder in whitehub. Now with your method(I copied the folder in bluehub) everything seems fine. But I just can't follow other people on zerome.Can you help me? Thanks.\n\nAlright, I did a writeup for you. Please read it in it’s entirety before modifying files. There’s a bit at the end that I thought about later that you’ll want to read. Make sure you have a solid understanding of what you need to do before you mess with files. Let me know if you have any issues :)\n\n*Edit:* if you need live help, please come visit [my discord server](https://discord.gg/4kY4yAD)\n\n—\n\nThe userdb says you’re signed up as hub: 1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m which is ‘Free Hub’ according to Kaffiene. Not blue or white. Kaffiene has you in the user registry as blue hub, which makes sense as you mentioned you started there. I went ahead and checked out white hub as per your suggestion, and you indeed seem to have profile data there.\n\nSo from my understanding you have profile data in Free Hub, BlueHub, and WhiteHub. With your current active hub being Free Hub, and indeed your only post shows up under Free Hub. You appear to have some likes and comments on white hub, but *not* on blue hub. White/blue hubs show that you have 9 posts, while free hub shows the updated 12.\n\nI don’t know all of the hubs you’ve commented in, liked stuff on, etc. So I can’t walk you through editing those, besides just giving a general outline. But here’s what you need to do. First things first, pick a hub you want to use. Personally I’m fond of my own hub, but you’re free to do what you like. The easiest route would be to stay on Free Hub. That requires the least changes. But I don’t really know who manages that one, so it might not be great long-term. Nofish’s hubs are also good.\n\nIf you decide to stay on Free Hub, then ignore this part:\n\n—\n\nTo switch your hub, go into the user registry site and your particular user folder. `1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV/data/userdb/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/content.json`. In the content.json, all you want to do is change ‘hub’ to whatever hub you want. Simple.\n\nThen go to `1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m/data/users/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/data.json` and copy+paste the first few lines (`next_post_id`, through the bottom of the `post[]` array) into your new hub data.json: `[hubaddress]/data/users/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/data.json` in the appropriate spot. You’ll need to adjust the `next_comment_id` to what it is in that hub (since we aren’t migrating comments) as well as `hub` over to the new hub address. If you have posts in the destination hub, you’ll need to merge the two post arrays. if you need help with this, let me know. You could easily just delete one of them as well. I’d also recommend editing `next_follow_id` to 1, given that you are following no one.\n\nIn `1ABFCaadiEa3bFNzN3RcCZSsviqMNTbz3m/data/users/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/data.json` go ahead and delete the `post[]` array, `next_post_id`, `next_follow_id`, `avatar`, and `intro`, and all of the entries (but not the array) for `comment[]`. Change `hub` into your new hub address.\n\n—\n\nIdeally by this point you’ve got your destination hub cleaned up and configured. If you stuck with Free Hub, then there’s nothing that needed to be done (it’s a complete/clean setup), but if you wanted to switch somewhere else, hopefully you’ve got it all proper. Ask questions if you’re lost.\n\nNow we need to adjust the leftover data from your messed up hub switching, as well as to repoint all the hubs over to your new profile. From what you’ve told me, you’ve only interacted with Free Hub, White Hub, and Blue hub. However, if there’s more, you’ll need to follow these steps for those as well. A quick `mdfind` on my machine reveals that you have data folders in `1KNmG5rJUGhgUJGFbLkv2B5isaqu9PrZqi` (amethyst hub) and `1GrEenUGRWnzaNZjR3XsQa6dQgdPDTyt7i` (green hub) as well. Both are properly formatted, but amethyst says your hub is blue hub, and green says your hub is free hub like free hub/white/blue do. If you’re going to stick with free you need to edit amethyst appropriately. If blue, then edit green appropriately. If something else, edit both. Neither have profile data, so no tampering other than putting in the proper hub is needed.\n\nNow to deal with the pesky extra profile data on blue and white hubs. Unless you’re migrating to one of them, you’ll want to delete it. So in: `1White24UrrwQrD86o6Vrc1apgZ1x1o51/data/users/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/data.json` go ahead and do what you did before. Delete `next_post_id`, `next_follow_id`, `avatar`, `intro`, the `post[]` array. And then point `hub` to your new hub. If you’re going to stay on free hub, this repointing is unnecessary given that both white and blue hub are pointing back to free hub.\n\nRepeat that same process for `1BLueGvui1GdbtsjcKqCf4F67uKfritG49/data/users/1Km1dprxotasxFzeEY8QkwpHVbvffvMBb9/data.json`.\n\nThat should be it. Though in the process of writing this I realized all of your comments do *not* relate to your own posts *except* your Free Hub comments, which are all posted on your single free hub post. If you’re *migrating from free hub* it’d be best to move these comments over to the appropriate hub (just like you did with your posts) and then delete the comments from free hub. If you’re staying on free hub, no need to do anything. The big issue is that *other peoples comments* will still be posted on *free hub*, meaning they won’t show up. Migrating the posts as I described will *unlink* the other users’ comments from your post. If you migrate your posts/comments, only your comments will show up and it’ll look like you’re talking to no-one, haha.\n\nThe ‘cleanest’ migration would be to either delete all the posts/comments that originated from Free Hub, OR, to keep the posts/comments where they are. Following the guide will migrate your posts to the new hub, and then unlink the comments so that there are none for your post.\n\nHopefully if you follow all these instructions correctly, you should un-fuck your situation. Enjoy!",
			"post_id": 25,
			"date_added": 1497141760
		},
		{
			"comment_id": 41,
			"body": "> [zerozeroeight](#comment_1_1NZUrFx8k5t56o6RLYNgDbtySxhosyteJp): Why i don't open your ZeroMovies , \n> \"data:text/html;charset=utf-8,<script src%3D\"http%3A%2F%2Fajax.googleapis.com%2Fajax%2Flibs%2Fjquery%2<%2Finput>\"%0A%09result %2B%3D \n> ......\n> false)%0A%7D*%2F%0A%24(document).keypress(function (e) %7B%0A if (e.which %3D%3D 13) %7B%0A search()%3B%0A %7D%0A%7D)%3B%0A<%2Fscript>\" is stop?\n\nIdeally what should happen is it should load the script from indexb.txt into a URL, and then redirect you there. It's a mechanism to escape zeronet's iframe..",
			"post_id": 43,
			"date_added": 1500450243
		},
		{
			"comment_id": 42,
			"body": "> [gopher](#comment_1_1Q7Ebizvdsta5fdhrojC6eyUzRKrPKY5Cb): too complex.\n\nThat's because it wasn't intended for people to switch hubs. This is technically a hack. I've been considering making a tool to automate this process. And tbh, it seems like it's in high demand.",
			"post_id": 25,
			"date_added": 1500808182
		},
		{
			"comment_id": 43,
			"body": "> [infect](#comment_1_16rjsqjxFb6AqjW7Mxs5beWRFLBYoxMAAo): but anyways, i wanted to ask you if you are searching for any logo, since i am a graphic designer and i like your site.\n\nSure. If someone wants to help contribute to the look and feel of Kaffiene, I'm all ears. Any contributions you'd like to make are fully welcome.\n\nRabbitSearch sounds pretty neat. I'd like to see what you have done. The big issue with Kaffiene I'm facing is updating the index in an automated and useful manner. I'm way behind on including zites, so there needs to be a better way of gathering and tagging them.",
			"post_id": 45,
			"date_added": 1503703905
		},
		{
			"comment_id": 44,
			"body": "> [infect](#comment_2_16rjsqjxFb6AqjW7Mxs5beWRFLBYoxMAAo): Cool, i will make something for you :) wich colors are prefered? also the rabbitsearch wasnt really that special, it was based upon zerotalk\n\nWhatever looks good. Feel free to do a whole redesign, or just a logo, or whatever you feel like. No guarantees I'll switch, but I'm definitely open. After all, the current style was just a suggestion from someone, so I went ahead and applied it. Personally I like pastel colors, pink, and like a forest green. But feel free to do as you like. Maybe making it cyberpunk or something would be neat.",
			"post_id": 45,
			"date_added": 1503806036
		},
		{
			"comment_id": 45,
			"body": "> [infect](#comment_3_16rjsqjxFb6AqjW7Mxs5beWRFLBYoxMAAo): shows the peers, now its above the sitename, but i need it under the sitename, just above the tags, i found that it is coded into the javascript, but im not very good at javascript, so ca you please tell me, how can i fix this?\n\nOn line 376 you should find:\n\n---\n\nvar str = [\"<div class='entry'><span class='siterank'>\",addrank[1],\"<br><c>peers</c></span> <span class='resentry'><a class='sitelink' href='\", url, addrank[0], \"' target='_top'>\", desc[0], \"</a> <span class='proxies'><a id='kfp' class='proxylink' href='\",proxy1,addrank[0],\"' target='_top'>1</a><a id='bnp' class='proxylink' href='\",proxy2,addrank[0],\"' target='_top'>2</a><a id='wwp' class='proxylink' href='\",proxy3,addrank[0],\"' target='_top'>3</a></span>\", profilename, \"<br><span class='tags'>\", desc[1], \"</span></span></div>\"];\n\n---\n\nThat's the shitty string array for formatting entries. Format it how you please. `<span class='siterank'>\",addrank[1],\"<br><c>peers</c></span> ` is the relevant bit for peers/siterank. As you can see in the first string it opens a span tag with the proper class. Then the next string is the siterank itself. And then the third string writes out 'peers' and closes the span tag (and also includes some other stuff). If you wanted to put it after, you'd write it something like this:\n\n---\n\nvar str = [\"<div class='entry'>\",\"<span class='resentry'><a class='sitelink' href='\", url, addrank[0], \"' target='_top'>\", desc[0], \"</a> <span class='proxies'><a id='kfp' class='proxylink' href='\",proxy1,addrank[0],\"' target='_top'>1</a><a id='bnp' class='proxylink' href='\",proxy2,addrank[0],\"' target='_top'>2</a><a id='wwp' class='proxylink' href='\",proxy3,addrank[0],\"' target='_top'>3</a></span>\", profilename, \"<br><span class='tags'>\", desc[1], \"</span></span><span class='siterank'>\",addrank[1],\"<br><c>peers</c></span></div>\"];\n\n---\n\nI actually just tried that snippet and it works fine and doesn't effect the look of the results at all and only moves the siterank text after the entry.\n\n>its because when the window is resized to a smaller size, the peers and sitename will overlap each other, trying to make it look good on small screens :)\n\nRight. I was wondering whether I should switch to using css grids in order to format things. Perhaps that'll work better. And it's easy to make mobile-friendly.\n\n>PS: im making a theme where you can easily change the colors, im not good with lighter colors so.. it's mostly black..\n\nOh. I was hoping for a lighter theme, in order to match the rest of ZeroNet. Do note how I was trying to make a consistent theme across my network of sites.\n\n> because it looks good with alot of colors, and white, and one other color you can easily swap with another color :) im gonna try to make a cyberpunk theme too \n\nAwesome.\n\n>(cyberpunk like in the animes right? )\n\nSure? Cyberpunk is just a general thing. Lots of neon lights, glitch effects, techy things, etc. Check out [systemspace.bit](/systemspace.bit) for an idea of what I mean. That's my attempt at making something cyberpunky (albeit copying a lot from some source material).",
			"post_id": 45,
			"date_added": 1504006771
		},
		{
			"comment_id": 46,
			"body": "> [rainbowcat](#comment_1_1NAytMtn4tGCCrPNV4bDRViH6VrQ3xhYzu): https://medlineplus.gov/ency/article/000954.htmhttps://en.wikipedia.org/wiki/Conversion_disorder\n\nThanks? I'm obviously already well read on the basic clinical information. I just meant more like experiences with people you know, or if you have it yourself.\n\n> [jayofthezero](#comment_3_16nArdxrSaNThNp83kL8E6NLL9WD98iUne): ZeroNet Sci-Hub should be possible now that BigFile support is live. Would be interesting if it was made using merger sites. Wish I had the time and skills to do it myself.\n\nYeah that's what I was thinking as well. Are bigfiles needed though? PDFs usually aren't that big. Only a few hundred kilobytes, or a megabyte or two at most.",
			"post_id": 46,
			"date_added": 1515218053
		},
		{
			"comment_id": 47,
			"body": "> [polar](#comment_1_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6): More: http://127.0.0.1:43110/1QHbf72f4vdx3QAxN1LTN9KP19J428Q85R/\n\nI haven't tried it but it looks like it might be much easier for people who aren't that tech savvy.",
			"post_id": 25,
			"date_added": 1515218209
		},
		{
			"comment_id": 48,
			"body": "> [lxpz](#comment_1_1LrDWSzi63MhST9ZNkefSPJGFAuByRMeCx): Let me just throw some ideas out here, I'm not trying to build a consistent unified world view, but just giving some random thoughts that seem to oppose your argument.\n\nThanks for the input. I wasn't exactly looking for a debate, and as such didn't really describe the *reasons* why I accepted what I did. I've got a lot, and the actual process was much more involved. This was just a brief overview.\n\n>So you said you \"only really started with the idea that life is good and should be improved and protected\", but to me this seems like an enormous assumption on your behalf.\n\nWell yeah. It's an opinion. As all moral views are. Entirely subjective. But what's the alternative? What life to go extinct? Just not care about the fate of your species? The arguments for life are, I feel, pretty straight forward. You and I are life. There's not really any good reason to discriminate (equality is good for the survival of life and the species in general). But yeah, there's not an objective argument here, just like there's not an objective argument for *any* morals. But as I said, this is my worldview, so my opinion haha. I think life is precious. It stands out among all the other 'natural' things. And it's the only thing capable of making more complexity and organization, contrary to entropy.\n\n>How do you define what is good? What is good for you can be bad for others. \n\nI just told you. But yeah, it's entirely subjective. I'm not making an argument for objective morals. I'm sharing my worldview, and perhaps a religion. Naturally the foundation is subjective.\n\n>What is good for a community is not necessarily good for the individuals in the community. \n\nThis is false, actually. If you look at long-term survival of communal species, what's good for the community is good for the individuals. That's why cooperation and altruism is a thing. And again, with reproduction. Having other members of our species alive helps prolong our genetics.\n\n>Cancer cells and virus cells are pro-life, they want to reproduce, but by doing so they cause problems to the host.\n\nAnd if the host dies, the cancer dies. And life is over for both. It's a net negative. Cancer cells are damaged. Viruses spread throughout a species which allows them to live.\n\n> To me there is no universal notion of good\n\nSure. That's why these are my opinions.\n\n>What does it mean to improve life?\n\nI realize that was pretty vague. I mean in the transhumanist sense. Improve capabilities. Improve longevity. Improve ability.\n\n>Does it mean having more power? But more power for one individual likely means less for another, or being in servitude.\n\nNah, not power. That's not really an improvement. Do note that I left it vague for a reason. These are *guiding* views. Not answers to questions. A worldview is something that you can follow to help make decisions. Not something that has all the answers.\n\n>Does it mean being happier?\n\nSure. Longterm wellbeing and happiness. Comfort. Etc.\n\n>Well then just take drugs that make you feel happy and that's it. \n\nUnfortunately we don't really have anything like that yet. And such a concept is a transhumanist idea.\n\n>Does it mean living longer? Well then we'd probably have some overpopulation problem.\n\nI addressed this. Consistent/constant duplication/replication is desired. It helps prolong life. Helps encourage and spread life. The overpopulation issue is due to finite resources, and indeed a battle with entropy. Instead of cutting down population, I suggest increasing efficiency and reducing consumption and waste.\n\n>And why would you want to protect life in general?\n\nAgain, stemming back to an opinion: that life is precious and good. Personally, I like life. I think it's something that's good that should be protected and encouraged. I'm not sure why anyone would be against this...\n\n>So to me there is no universal notion of \"protecting life\", it's nonsense.\n\nSo do you think it's pointless to be vegan? Personally, I can't see much of a reason to exploit animals. Especially when I realize that I *am* the animals in some sense. Or will be. Again, with my other views. When I do experience that, is that something I'd like to experience? Absolutely not. I don't see why one can't exist without exploiting another. There's no reason you need to.\n\n>Your faith in anarchism and decentralization make sense in the digital world as it is very easy for one person to build something for everyone else, and then other people can simply contribute a little something and the projects gets better and better with time and active participation of everyone. But how do you do that if your problem is building an aircraft, or building and operating a microchip factory?\n\nIt's something I've developed over time. I suggest you talk with some people who are much more knowledgable about anarchism and ownershipless societies than I am. Ultimately, you can still have organization, just not coercive organization.\n\nThe reasoning for anarchism is fairly simple. Centralized government is flawed and corruptible. Capitalism is garbage and harms society and the longevity of humanity. As such, get rid of both. Replace those with anarchist decentralized systems. The decentralization helps increase redundancy, a core principle of life (helps keep things alive). And the anarchism helps prevent corruption, as well as to support flexibility and 'remixing', the change, evolve, improve sort of view. You can't do that if everyone is identical.\n\nThe improvement thing stems from evolution. The way we've survived so far is by evolving and overcoming whatever problems come our way. Being adaptable and and continually improving.\n\nI do encourage you to think of these views all together. Hopefully you get the picture I'm trying to paint here. Perhaps you don't agree with it (and thus disagree with the fundamental moral opinion), but I at least ask for you to ponder it. These are my views, and I haven't seen really much argument against it. It's really the only thing I could identify as really being 'worth' supporting and doing. So that's my answer. What's the purpose of life? What's the meaning? To overcome the odds, survive, reproduce/duplicate, and to defeat entropy and arguably live forever happy and healthy for every single life form. Do you have any *better* purpose or meaning?",
			"post_id": 47,
			"date_added": 1516713907
		},
		{
			"comment_id": 49,
			"body": "> [jamesholden](#comment_1_12w3zJ6gRrcAw2kSCQXDkorgqxuXnkKkF8): The first thing that came to my mind is that you're a modern, humanist, curious and spiritual person (you speak of qualia(s) and the mind being something akin to math, very real yet very abstract which are 2 points a person leaning towards materialism which doesn't believe in the \"soul\" or the \"mind\" would dismiss,\n\nMy position is that 'soul' has always been horribly defined. Though when I speak of qualia, some people say I'm talking about a 'soul'. And that they cannot identify the same thing. If that's the case there must be soulless/qualialess people. It's not really an *abstract* thing. Just... different.\n\n\n>you speak of liking the community aspects of life and religion much, like humanists, you speak of transhumanism which is a very recent and modern philosophical theme) but I don't think there a \"definite\" or single name for your beliefs, we're all a mixed bags of beliefs after all and our life experiences are shaping them, one day, one question and one answer at a time.\n\nYeah, I've dug through a lot of religions. Humanism/Transhumanism are good for those aspects, but still lack the *religion* side of things that I've been craving. Hence my thoughts on starting one.\n\n> Indeed, as the stoics said, we have to \"live by our nature\", it's the only way according to them, this includes a lot of \"common sense\"\n\nYeah I got into stoicism for a while. Not quite what I'm looking for, but a lot of interesting stuff in there.\n\n> I think you would enjoy the Crash Course Philosophy video series, very thoughtful videos\n\nI'll have to check them out.",
			"post_id": 47,
			"date_added": 1516858155
		},
		{
			"comment_id": 50,
			"body": "> [caryoscelus](#comment_1_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I pretty much agree with this. Privacy is only required in flawed society. But then the question is whether ideal society is even possible. As far as my opinion goes, i think it is, but it is possible to arrive there for humanity. But many would disagree it is even at all possible.\n> Then there's debate on whether we can improve current society by destructing privacy (i.e. \"open surveillance\"). Argument can be made for both views and if you're interested, i'll elaborate.\n\nTo be clear, I'm *opposed* to monopolized control of information and spying. This centralized government and corporate surveillance is not good by any stretch of the imagination. That is *not* my position. I support *open* knowledge and information. If *everyone* has perfect knowledge, that can do a lot of good in the world. Privacy seems like a temporary tactic to avoid oppressive and violent systems.\n\n> How far would your definition of life extend? What to do in case of interest conflict?\n\nI'm clearly referring to the collection of systems, laws, and 'stuff' that continually strives to reproduce, survive, increase it's longevity. So under that life would be *everything* like this. Whether it's bacteria, viruses, animals, plants, humans, aliens, etc. In the cases of interest conflicts, keep in mind that this is a general *moral* view, not a guide as to how to live under these morals. The moral thing would be the one that allows life to thrive and survive. For example, killing a virus in order to maintain a more complex organism that can help build larger metasystems to keep *all* life alive, would be a respectable trade off. The ideal would be to keep the virus itself alive, as well as the host.\n\n> It is commonly argued that no one actually understands quantum mechanics and you're likely not even quantum physicist (correct me if i'm wrong).\n\nSure. I don't claim to know the intimate details. But I've done a lot of digging into the topic, at least in terms of philosophy and general understanding of how things go. I know enough to form my worldview.\n\n> I don't think it's possible to fully learn the system from inside. Since we perceive qualia with qualia (if i understand what you mean by it correctly), we can't get to its nature.\n\nYeah, that's kind of the point I got stuck at. It doesn't seem possible to figure out.\n\n> I can criticize your reincarnation & time ideas later, if you're interested.\n\nI'm certainly interested. I'll have to watch your video in a bit.",
			"post_id": 47,
			"date_added": 1516858653
		},
		{
			"comment_id": 51,
			"body": "> [caryoscelus](#comment_2_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Maybe. But that's end point and there's no way to get there immediately. More realistic would be to start an open p2p surveillance system which anyone can join.\n\nSure. I don't think personal info is the best thing to give up while under capitalism. But as an ideal we should pursue it. Your solution sounds pretty cool, actually.\n\n> What about religion, language, math or maybe even ascii?\n\nAFAIK, those wouldn't be considered life, as they don't 'act' and do things. Though I'd avoid making any hard claims, as we don't know the exact nature of life, qualia, etc. Remember, these are just general broad ideals and views. Not meant to determine the exact nature of reality or intimate details of science.\n\n> If a single entity can be called alive, then clearly reproduction should not be necessary criteria if we want to keep general intuition about alive things (e.g. most ants are sterile). If you would prefer to apply term alive only for species, then hypothetical cyborg might cease to be alive (as soon as they are no longer human).\n\nThis is where it gets tricky. It's clear that we can recognize the subjective information consciousness as alive. Since that's what we identify as 'self', especially in cases of being a cyborg or having a mind upload. But where is the line drawn? It's hard to say.\n\n> So, if you agree with that and want to keep intuition (so ants and cyborgs are considered alive), what about any dynamic equilibrium systems? Can they be thought as \"striving to survive\"?\n\nAnts are alive. Yes. Cyborgs (part human, part machine) I'd consider alive as well. Robot/AGI agents are more tricky, but provided they can demonstrate a desire to survive, reproduce, and improve themselves, then sure.\n\n\n> Not sure how it is supposed to appear that the past is changing (in my worldview the past does not materially exist).\n\nThe past necessarily exists unless you reject materialism and/or modern physics. By the past changing I mean that events in history have changed from what they used to be. Under my worldview that'd be a timeline shift. Under idealism it'd probably just be normal.\n\n>But more importantly, the concept of any change assumes time already. So for the past to change, you'll first need it to exist in a somewhat material form and then you'll need a second time dimension, in which it could change.\n\nUnder my view it'd be a timeline/worldline shift. If materialism is debunked, then idealism.\n\n> And then there's the question \"how would you even notice a modified past?\" \n\nBecause I see it with my eyes? I don't know the why/how. I'm very curious. It's just odd.\n\n> First of all, if you're deriving worldline concept from multi-world interpretation of quantum physics, you should realize that amount of those lines should increase almost infinitely at every moment (unless we imagine that the world's wave function has very few valid states for some odd reason, but then that situation isn't substantially better in explaining the world than single line universe with some form of wave funcs collapse: the \"low-count\" multiverse would still involve some collapse).\n\nYes. This is my view.\n\n> Then the first question is: how it is determined that \"we\" go into one branch and not another? \n\nA mystery of the universe, ain't it? They're all equally as existent, and there's no 'present'. But there's still the question of flow. We *perceive* time to flow, and as such there needs to be an explanation of why it appears that we observe time in a chronological order. And I don't have an answer. My understanding is that these 'flows' always happen. They appear to happen in this flowing order due to memory and entropy (the direction of 'time'). Why *this particular flow* is something I can't figure out and is one of the reasons I've been considering a switch to idealism.\n\n>If we assume some kind of metaphysical agency (free will, basically) and attach it to all quantum \"decisions\" (which is a big stretch, but still), what about other worlds? \n\nI'd reject that tbh.\n\n> And finally, to the sliding concept. Frankly, it doesn't make much sense to me. Even if we accept world lines and uniqueness of our world and then imagine \"jumping\" to another line.. the most easy thing to imagine would be jumping of \"uniqueness\" label itself. But even that is only easy when you view it from the side. But when you try to actually imagine it, you'll have a sharp disconnected jump: a moment ago there was one world, a moment later it is completely another (unless you imagine a non-discrete worldlines, on which i'll elaborate below).\n\nThat explanation is how it appears to me. A moment ago, there was one world. And a moment later it's entirely different. Yes. That exactly. Usually it takes me a while to notice the difference, or that a 'change' had occurred at all. But once I notice it changed, there's usually quite a few things that changed at the same time. This latest 'slide' was dealing with how early technology existed. \n\n>Since it's a 'new' world with its own past, all the memories of its inhabitants would contain references to its past and the old world would thus have no traces. So in this scheme apparently there's no way to know what world was considered unique before the current moment.\n\nYes. This is effectively how it is. There's quite a few people, however, who noticed the change. But not everyone. I'm starting to think that those who don't notice such changes are a sort of npc or p-zombie. But I'm still digging into this.\n\n> Now lets consider a bit more complex scenario (but still with discrete world lines), which is btw quite usual in sci-fi. For us to be able to say that the change actually occurred, we'll need some observer which would retain memory from the old world. So, part of the world remains as it were in the old world, but the rest is again completely new.\n\nYes, this appears to be the case. It strikes against my understanding of the MWI and time travel as well. Which is why it's been giving me problems. Why are memories swapped over? I don't get it.\n\n>This has numerous issues, but the most important is of course how the world resolves the conflicts. Even if there's a way to \"specify a mask\" (using computer graphics analogy), how can it be applied to a world where on quantum level many particles have not only flew away, \nbut even morphed into other particles?\n\nHonestly? Because it's my best explanation when assuming materialism. How the fuck else do you explain this stuff? It's horribly confusing.\n\n> If we draw the timeline tree, in this picture our position would be a bit fuzzy if we zoom enough. So in a way it ends up being no better than single world interpretation, since we still have to live with some level of quantum uncertainty (which is otherwise resolved by multi-world). But, on the other hand it allows true \"sliding\", not jumping between lines: if our position on tree is probabilistic, the probability cloud can be imagined to morph and go over to remote lines over the time.\n\nThe problem with this, is that it'd argue that you can't observe the *past* changing. Major events have indeed changed. Things like the JFK assassination, or the moon landings. I've seen landmasses move as well (entire continents). These are not small by any stretch.\n\n> And, of course, all these constructs imply materialism. If we get rid of it, many things become possible, but i don't see the point of so strictly sticking to science if materialism is not true.\n\nThis is what I'm slowly being convinced of.\n\n> I should also note that since the multi-world interpretation is generally alien to me (i don't see how it explains anything; drifting between timelines is not something that i've heard to have any evidence or theoretical basis and if the timeline tree branches are fully isolated, those alternate worlds become too virtual to consider them real in usual sense of word), my analysis might miss some important direction of thought.\n\nTrue. But I've been a staunch materialist pretty much my whole life, and I'm not ready to give that up without entirely failing to explain it with materialism, or perhaps with a solid explanation and proof of idealism.",
			"post_id": 47,
			"date_added": 1516877978
		},
		{
			"comment_id": 52,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i have been searching for \"accepted_domains\" string in all zite files, and can not find it. My zite is recently clonned ZeroTalk.\n\n> I Signed and published changes, but my site authorization box shows only zeroid.bit as an option, please any idea?\n\nThe cert_signers thing is for *permissions*. To have the login box pop up with the appropriate options, you need to alter the *javascript*. There's a point where the login is requested. It'll include a list of accepted signers. You can change the list to be anything, or you could list just the signers you want.",
			"post_id": 29,
			"date_added": 1517457314
		},
		{
			"comment_id": 53,
			"body": "> [thecuriousnerd](#comment_4_16esmH5mTmsJL4S5DW4dup5883xJh6GdDS): Holy crap, I never thought I would see someone with such similar world views. I was starting to wonder if I would ever encounter someone with this mindset. \n\nAs I mentioned, it's very bizarre isn't it? You'd think after working to find accurate and proper views that you'd find a whole community of people waiting for you who've walked the path before. And yet there's just seemingly nothing. I've got a discord server [here](https://discord.gg/YAcAXaD) that I plan to use as a chatroom for people who share these views. But I haven't really 'launched' that yet. I feel like I need to write a book on the topic as a foundation to point people to when they're curious.\n\n>Have you seen any of Ghost in the Shell? I ultimately believe people can overcome the universe, as well as have it be a good thing. \n\nI know of it, but haven't seen it. And yeah, it's nice to think that maybe we will eventually overcome it, but right now the odds aren't looking that good.\n\n> Although in my mind in order to accomplish this you need to create a bridge (for the masses) in order to get to it. This could be via decentralized systems that are easy for the masses to use along with furthering biology, specifically longevity research or biogerontology. \n\nRight. Trying to talk about all the complexities loses people very quickly. Even something like ZeroNet people have a hard time getting into. For the lifestyle stuff, I think it's most important to demonstrate something that works, and then have a way of introducing people to it. For the tech, providing all-in-one solutions would be ideal (buy a box, turn it on, and you're connected to the new web).\n\n> However I think getting there will be difficult if we are unable to share information easily and collaborate. Accessibility is the main factor in this.\n\nYup. That's a big thing. Making sure information is accessible. And yet, we see the exact opposite in today's society. ",
			"post_id": 47,
			"date_added": 1522150861
		},
		{
			"comment_id": 54,
			"body": "> [ks](#comment_1_1LgeiYLn7zoh3kpQSxmUmfgM5Hb7FK3xgD): And then there's Kanji Damage ⌘ https://www.kanjidamage.com/ (“where you can learn 1,700 kanji using Yo Mama jokes”)\n\n1,700 doesn't cover the Jouyou kanji and wouldn't be sufficient. The goal here is to learn all of the Kanji you need so that you can start reading real Japanese. Kanji Damage also appears to give a lot of unimportant stuff (like readings) and doesn't seem to have a clear goal in mind other than giving you the kanji in a sensible order.\n\nIf you can do Kanji damage for *all* of the jouyou kanji, and do it in the manner described above, I imagine it'd be fine as a replacement. Provided you're getting the meaning+recognizing the kanji itself.\n\nAs the next step of AJATT is basically starting to learn everything in-context, which is what will give the readings, vocab, etc. Personally, I'm a *lazy* learner haha. I like things just handed to me and just \"here you go, follow this and you'll be golden\". And I found the nihongoshark guide to basically match the AJATT method but in a very lazy and easy format. I liked the guide, but felt it was a bit longwinded so I trimmed it down to the main stuff here.\n\nAnything similar should be fine, but this is the approach I'm taking and it's been working well.",
			"post_id": 49,
			"date_added": 1536137548
		},
		{
			"comment_id": 55,
			"body": "> [weakish](#comment_2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): Thanks for your works on ZeroNet. Unfortunately Patreon does not support bitcoin and I have no credit card. (Maybe I will apply one next year.)\n\nAFAIK debit should work as well. Unfortunately, bitcoin doesn't pay the bills.",
			"post_id": 50,
			"date_added": 1536975732
		},
		{
			"comment_id": 56,
			"body": "> [ssdifnskdjfnsdjk](#comment_2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): The step \"1. Install CJDNS\" is a bit confusing for a Windows user. I am unsure if i need to follow text starting from \"Generate a new config\". Maybe you should add sub-sections under \"1. Install CJDNS\". For example:A) WINDOWSB) MAC or LINUXso it is easier to read. Btw as a noob it also confuse me that i do not see Linux mentioned in the tutorial.\n\nThe installer will install cjdns for you, but you still need to add the peer. I didn't install on windows so I'm not sure what the exact process is. Does it pop open a text file? If so that's what you need to edit. The instructions on the download page should walk you through it.\n\nNamely on these steps:\n\n>Once you have some peering information (a block of JavaScript code), you can add a peer to your node. Open the Start menu and go to \"CJDNS for Windows\" and then \"Configure cjdns\".\nFind the line \"//Ask somebody who is already connected\", and paste your peering credentials directly after that line. If you have multiple peers, be sure to separate them with commas!\n\nThat should open up the config file. The last little bit of step one on my guide:\n\n>You'll want to add a peer that's connected to the hyperboria network already, though if you just want private use you can connect to a friend or whoever is on the cjdns network you want to use ZeroNet on. LAN peers are auto-configured.\n\n>One such public peer that you can use is:\n\nIs relevant here. Since this is just instructions on how to set up a peer.\n\nStep 2 (configuring zeronet) is the same on every platform.\n\n> [piloth](#comment_1_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck): Thank you so much for this. It had one unexpected benefit for me. I use my smartphone tethered to my computer exclusively for internet because of where I live. My port for ZeroNet now shows open after installing and running CJDNS. I went to the Mapping Hyperboria site and I had a question. How do I find the peer info? I know this may sound silly, but I am a total noob when it comes to this. Thanks again!\n\nIt's not silly at all. So the  site I linked (fc00.org) is a map of the hyperboria/cjdns network. To find more peers you can... ask them directly. As cjdns is meant to be a sort of friend network. Though more realistically since we're all anons you'll want to poke around and find what are called \"public peers\". You can either find them on clearnet (search around for the info. There's a lot [here](https://github.com/hyperboria/peers) but I haven't checked to see if they're up) or you can take cjdns ips from fc00.org and plug them into your browser (such as: http://[fc6a:30c9:53a1:2c6b:ccbf:1261:2aef:45d3]/ ). Clicking around sites like this is kinda tedious, slow, and may not have a 100% rate (as not all nodes are hosting websites). And even less will have public peering info. \n\nAs for your node... I'm having a hard time connecting to it. Bad peering info? Node not up? You'll want to make sure you can connect to hyperboria/cjdns sites, as that'll ensure you're connected properly to the network (which I can't seem to reach you atm).\n\nHere's one site I found from my personal list: http://[fc9b:499a:dd7a:92a:7b3e:be3a:32fc:53dc]/config/ As you can see they have public peering info listed there. If you can't connect, I'll repost it here (and for others who are having issues with the peer I provided):\n\n```\n// public peers from [fc9b:499a:dd7a:92a:7b3e:be3a:32fc:53dc]\n// generated at 07:39:30 07.02.2019\n\"163.172.148.88:43418\": {\n\t\"publicKey\": \"7h898y2xdhtm9xgng7f97umx9wfjhkxfx2wkxw89mrq2y6k954d0.k\",\n\t\"password\": \"\",\n\t\"peerName\": \"cz.prague-hx.ngu.h\",\n},\n\"207.148.84.23:34499\": {\n\t\"publicKey\": \"rbc84c9psmy1uvhlxmfm398bkfrmq513mgcylf1f1khj1s6d1zx0.k\",\n\t\"password\": \"g0T7erf7FtU25EElGotWkWmW1dluNcJPkhuFpmMP\",\n\t\"peerName\": \"vul1.djc.id.au\",\n},\n\"164.132.111.49:53741\": {\n\t\"publicKey\": \"35mdjzlxmsnuhc30ny4rhjyu5r1wdvhb09dctd1q5dcbq6r40qs0.k\",\n\t\"password\": \"cr36pn2tp8u91s672pw2uu61u54ryu8\",\n\t\"peerName\": \"h.akru.me\",\n},\n\"163.172.26.210:27410\": {\n\t\"publicKey\": \"8bqv77rkzn888mcr8wu3k9b22hpczhn7c0zzyrqpj4bbx8rbf810.k\",\n\t\"password\": \"ZGZWKOX5H535MG7MRYRKFMF4IY5GFCO5\",\n\t\"peerName\": \"h.totem.tfnux.org\",\n},\n\"185.87.193.205:18842\": {\n\t\"publicKey\": \"7h898y2xdhtm9xgng7f97umx9wfjhkxfx2wkxw89mrq2y6k954d0.k\",\n\t\"password\": \"public-190103\",\n\t\"peerName\": \"h.ihc.cupivan.ru\",\n},\n\"50.31.112.231:5249\": {\n\t\"publicKey\": \"tghwsb26dvczp983358ssvyvyjnsb2jkrvl2j5u1p56066nl64f0.k\",\n\t\"password\": \"8l8hm1rzvn772bxl0d2gdrx1v6c5n4m\",\n\t\"peerName\": \"Jon Lane\",\n},\n\"104.200.29.163:53053\": {\n\t\"publicKey\": \"1941p5k8qqvj17vjrkb9z97wscvtgc1vp8pv1huk5120cu42ytt0.k\",\n\t\"password\": \"cLjDBorhsYJUmJrESGueHsRY4HXcFyj\",\n\t\"peerName\": \"transitiontech\",\n},\n\"50.236.201.218:57776\": {\n\t\"publicKey\": \"8hpgpx0lwh9bz314cd9cjtchu5149s23yk8d4fqc5z1tkq2hzv00.k\",\n\t\"password\": \"88xf53d9ytks9bgvuy24yrs3d7lx2wj\",\n\t\"peerName\": \"cjdns.stephen304.com\",\n},\n```\n\nAnd their ipv6 nodes (if you have native ipv6 and want to connect to hyperboria/cjdns through that):\n\n```\n// public peers from [fc9b:499a:dd7a:92a:7b3e:be3a:32fc:53dc]\n// generated at 07:39:30 07.02.2019\n\"[2001:bc8:4400:2900::2:929]:43418\": {\n\t\"publicKey\": \"7h898y2xdhtm9xgng7f97umx9wfjhkxfx2wkxw89mrq2y6k954d0.k\",\n\t\"password\": \"\",\n\t\"peerName\": \"cz.prague-hx.ngu.h\",\n},\n\"[2001:19f0:5801:e2d:5400:1ff:fea5:b19a]:34499\": {\n\t\"publicKey\": \"rbc84c9psmy1uvhlxmfm398bkfrmq513mgcylf1f1khj1s6d1zx0.k\",\n\t\"password\": \"g0T7erf7FtU25EElGotWkWmW1dluNcJPkhuFpmMP\",\n\t\"peerName\": \"vul1.djc.id.au\",\n},\n\"[2001:41d0:401:3100::34e6]:53741\": {\n\t\"publicKey\": \"35mdjzlxmsnuhc30ny4rhjyu5r1wdvhb09dctd1q5dcbq6r40qs0.k\",\n\t\"password\": \"cr36pn2tp8u91s672pw2uu61u54ryu8\",\n\t\"peerName\": \"h.akru.me\",\n},\n\"[2001:bc8:2495:100::1]:27410\": {\n\t\"publicKey\": \"8bqv77rkzn888mcr8wu3k9b22hpczhn7c0zzyrqpj4bbx8rbf810.k\",\n\t\"password\": \"ZGZWKOX5H535MG7MRYRKFMF4IY5GFCO5\",\n\t\"peerName\": \"h.totem.tfnux.org\",\n},\n\n```",
			"post_id": 51,
			"date_added": 1549514474
		},
		{
			"comment_id": 57,
			"body": "> [ssdifnskdjfnsdjk](#comment_2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Btw as a noob it also confuse me that i do not see Linux mentioned in the tutorial.\n\nLinux users are a bit on their own. The cjdns github page has details on how to install cjdns. Configuring your peering info should be the same as on mac and windows. And naturally configuring zeronet will also be the same. I haven't set up cjdns on linux so I'm not entirely sure what it entails.",
			"post_id": 51,
			"date_added": 1549514994
		},
		{
			"comment_id": 58,
			"body": "> [redder](#comment_1_12tHguT9rDNwqe2aps9Wya1mrrbb6E1J9y): What's the benefit or disadvantages of cjdns vs tor?\n\nThey're entirely different. Tor is an anonymization network. It runs over clearnet ipv4 and hops through randomized relay nodes to arrive at the final destination. It doesn't provide any sort of ip allocation, or routing technology and relies fully on the existing internet infrastructure.\n\ncjdns is a part of mesh networking, and works to route traffic through meshes. Instead of running through clearnet ipv4, it can connect through a variety of means (including LAN connections), and provides a static/global ipv6 on top of that. So that you can use regular ipv6-enabled applications without requiring a standard ipv4/ipv6 internet connection. The routing is *decentralized*, as opposed to tor's reliance on centralized routing (by your isp).\n\nBasically, with cjdns, your node can be completely offline, save for a lan connection with another cjdns node, and yet still connect to the entire cjdns network. This is not possible with tor.\n\nFor the purposes of ZeroNet it helps provide decentralization. With tor, there's nothing really different. There's two ZeroNet nodes that both use ipv4 to connect to one another using traditional internet infrastructure. It's just that tor hides the ipv4 from each user, and has relays/hops around the world to help anonymization. But the end result is still centralized routing to an IP allocated by a centralized authority.\n\nWith cjdns this isn't the case. You merely connect to your cjdns peers that you yourself manually chose. And they relay your traffic in a decentralized manner (among their peers, and then their peers, etc. until it reaches your destination). So that you don't have to \"phone home\" to learn where an IP address is.\n\nWith tor, you still have a reliance on assigned ip addresses. With cjdns, you don't. Though today with most of zeronet working through the clearnet internet, this is largely a feature that won't have a *huge* difference on how things work to the end user. But this is an important step to migrating zeronet to a fully decentralized internet.\n\nWithout cjdns, we're at the mercy of ip allocation. Want to use the internet? Better go ask the gov and an official corporate isp. With cjdns? Just hook up to your friends network and mesh/peer with them. Easy.\n\nTL;DR: To the end user right now there's not much of a functional difference, as both are overlay networks/routing. Tor is designed to complement clearnet and use it to anonymize, while cjdns is designed to replace clearnet and migrate us away from using it. cjdns doesn't anonymize though. So if your goal is privacy, you'll want to use tor for the time being. If your goal is decentralization, you'll want to use cjdns. Or if you're just a fanatic about these kinds of tech, you can obviously just enable both.",
			"post_id": 51,
			"date_added": 1549585604
		},
		{
			"comment_id": 59,
			"body": "> [piloth](#comment_4_1FKuNsExQML7APuNmkCV8uzB5pKupcmnck): I tried thanking you again after you responded to my question but it didn't publish to peers so it didn't make it through i don't think. Our internet at work today was in and out because of bad weather.\n\nThat's something I'm trying to work to solve. As the node you connect to may have the content you're looking for!\n\nBut yeah it's worth noting that the benefits of cjdns *also* apply to other ip-replacement overlays like yggdrasil. I think there's a few others as well tbh, but I'm not really familiar with them.",
			"post_id": 51,
			"date_added": 1549592536
		},
		{
			"comment_id": 60,
			"body": "> [frayoshi](#comment_1_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp): cool!!Just, the block all function seems like not working for me... could I be doing someting wrong?\n\nIt should work fine? What error is it giving? To add it manually you can just add the following to your /data/filters.json file under \"includes\"\n\n```\n\"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/filters/users.json\": {\n      \"address\": \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\", \n      \"date_added\": 1549539186.161785, \n      \"description\": null, \n      \"inner_path\": \"filters/users.json\"\n    }\n```\n\nSo it should look something like this:\n\n```\n{\n  \"includes\": {\n     \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG/filters/users.json\": {\n      \"address\": \"1CufK1ZtvekbFXEpSyKT2gDjf9jnqW8KwG\", \n      \"date_added\": 1549539186.161785, \n      \"description\": null, \n      \"inner_path\": \"filters/users.json\"\n    }\n  }, \n  \"mutes\": {\n   //all your muted users and such\n }\n}\n```",
			"post_id": 52,
			"date_added": 1549689559
		},
		{
			"comment_id": 61,
			"body": "> [klu9](#comment_2_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): I know I'm merged with the hub I'd like to join (yours:) but I'm not sure if I have to do something more to \"seed\" it. I notice in the Sidebar for hubs there is an option DOWNLOAD AND HELP DISTRIBUTE ALL FILES, currently turned off. Do I need to turn that on? Or would that be overkill?(And it being off for all hubs, is that a possible reason why I ran out of space so quickly on my current home hub?)\n\nNah you just need to visit the hub and make sure you have downloaded the content. No need to switch the \"help distribute all files\". What that toggle does is help share all of the *optional* files, which isn't needed. Turning that on for everything can be overkill. Since the files are *optional.* But if you have a lot of drive space and really want to help host ZeroNet content, then you may want to switch that on.\n\nYou ran out of space quickly on your current home hob because nofish sets the limits ridiculously low. It's a bit silly. There really needs to be a way to remove any limits.\n\nYou may just want to make a backup of your files and use the unfuck zerome site to do the migration. Unless you're comfy doing all of this stuff by hand (which is honestly a pain).\n\n> [klu9](#comment_3_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): Did you mean hub rather than sub?\n\nI did, yes. And I've corrected the article now. Thank you.",
			"post_id": 25,
			"date_added": 1550449499
		},
		{
			"comment_id": 62,
			"body": "> [klu9](#comment_4_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @kaffie:OK thanks.\n> \n> I wish there was a way for users to receive more space from a site as easy as the one they can give more space to a site. E.g. when a user hits their limit, the site owner is presented with a button \"Set this user's limit to 200KB\".\n\nThe problem still ends up with a matter of the owner being inactive, or there being way too many users to manage.\n\n> [klu9](#comment_5_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs): @kaffie:\n> \n> ZeroTalk - Which specific files should I back up before changing ZeroMe hubs?Any suggestions?\n\nYou'll want to back up all of your [hub]/data/users/[yourid]/data.json files. Primarily the one that is your home hub.",
			"post_id": 25,
			"date_added": 1550535693
		},
		{
			"comment_id": 63,
			"body": "> [weakish](#comment_3_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): Debit card in my region does not work with Patreon. Just made a transaction to the kaffie hub address (the hub I am using in ZeroMe).\n\nThanks. But I have no idea how to actually get this address into my wallet.",
			"post_id": 50,
			"date_added": 1553731108
		},
		{
			"comment_id": 64,
			"body": "> [cyborg420](#comment_1_1126H2juNUiz3uTyBnXp2BtVEL7wciMNWq): cat ZeroNet/data/users.json get the auth_privatekey, and import the key via electrum. worked for me :)\n\nThe importing is the confusing part. I have the key. I'm using multibit on my mac.",
			"post_id": 50,
			"date_added": 1553732799
		},
		{
			"comment_id": 65,
			"body": "> [cyborg420](#comment_2_1126H2juNUiz3uTyBnXp2BtVEL7wciMNWq): try electrum. (https://download.electrum.org/3.3.4/electrum-3.3.4.dmg) multibit.org/help tells me, that importing \"old\" private keys is not supported - only their fancy format... :)\n\nThat's working great, thanks!",
			"post_id": 50,
			"date_added": 1553733876
		},
		{
			"comment_id": 66,
			"body": "> [lostfile](#comment_1_1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa): i wonder if its possible to make a local mesh-network using this\n\nyes, that's the entire purpose. So if you set up cjdns on a few nodes, and/or a router, etc. then they'll automatically \"link up\". From there if you have a cjdns enabled zeronet, it'll be an easy to configure mesh net + decentralized web.> [googleceo](#comment_2_15SpA2pA6hoUAmPrz5rp75goP4cXxw7tau): Dear Kaffie, \n> please help me out. I fail at step 2: Two questions: \n> \n> Do I rename to \"Bootstrapped\" or \"bootstrapped\" ? The original name is capitalized.\n> How do I get my IPv6 when I am in a IP4 network ?\n\nYou rename to the same name, without \"disabled-\".\n\n>How do I get my IPv6 when I am in a IP4 network ?\n\nCJDNS will generate one for you. It should be in the config file, and you can also get it through ipconfig/ifconfig.",
			"post_id": 51,
			"date_added": 1556594337
		},
		{
			"comment_id": 67,
			"body": "I actually found Jesus, and am Gnostic now. My moral and political views have mostly remained the same during my spiritual conversion, but some of the spiritual/atheist commentary is off now.",
			"post_id": 47,
			"date_added": 1565318561
		},
		{
			"comment_id": 68,
			"body": "> [moleman](#comment_1_1NxzhgT8Nm2xiA3HeT8UmWCezM2N3fyds4): This is a great guide, have you considered updating it?\n\nYeah I've been wanting to write a new one. This was written back when I basically first started using ZN.",
			"post_id": 2,
			"date_added": 1566184154
		},
		{
			"comment_id": 69,
			"body": "> [swashbuckler](#comment_1_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Is list still curated?\n\nI haven't been on ZN for a few months, but yes, I've definitely tried to keep up with any spam that's recently occurred. You can see the most recent addition was march 2020. AFAIK there hasn't been really much spam lately but do let me know if there's ever a problem with it.",
			"post_id": 52,
			"date_added": 1597919772
		},
		{
			"comment_id": 70,
			"body": "> [apollyon094](#comment_1_18RcKVHULk9ctAGksWLPjqzqbFFvgp1t3P): Someone pedophile retard named Renato186a has been spamming CP on a bunch of zites, I stopped seeding all of them because of him. Could you add this person to the blacklist?\n\nDo you have his public address? or a link to a post by him on zerotalk or something?",
			"post_id": 52,
			"date_added": 1601987352
		},
		{
			"comment_id": 71,
			"body": "> [gitcenter](#comment_1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Looks nice in general. A few problems I noticed and ideas:\n> \n> The '123' links don't work anymore, so they should probably be removed.\n\nYeah, I've been meaning to replace them but I don't really know of any active proxies.\n\n> The description lacks proper punctuation. For instance, I've added Name.YO to ZeroSites just now with description being 'A free, if centralized, domain name provider', but Kaffiene says it's 'A free if centralized domain name provider' which makes a lot less sense.\n\nThis is due to how the tagging works. Should be fixable by just not removing punctuation except when clicking on it.\n\n> It says '---- peers' for almost every site. I understand why that happens, but this is not very user-friendly. Maybe remove '---- peers' altogether if the peer count is unknown or collect that count manually (via a script)?\n\nThe peer count was a feature of the old index, which was manually added. The new index doesn't work the same way and thus lacks that, but to keep the old index sorted and merged with the new index, the new index needs a peer count, which '----' ends up being it. Perhaps it'll just be best to remove peer counts entirely?\n\n> It'd be great to sort the search results by popularity (ZeroSites stars, at least). When I search 'ZeroMe' the real ZeroMe is the third from the end.\n\nRight now it sorts by date added, meaning the newest sites are on top. The idea was to have the newer results first, to keep the search results relevant. As the top rated sites don't change that often. I'll have to see if I can add in support for sorting by stars...",
			"post_id": 53,
			"date_added": 1629239010
		},
		{
			"comment_id": 72,
			"body": "removed the peer counts and proxy links, and sorted by oldest instead of newest (which should help get the older well known sites towards the top). I also fixed the punctuation in the descriptions. Though I couldn't figure out how to sort by stars. My sql knowledge is too shitty for that and the way zerosites has it set up is weird.",
			"post_id": 53,
			"date_added": 1629245968
		},
		{
			"comment_id": 73,
			"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): There's 0net-preview.com, but it doesn't allow adding new sites. Still useful. This is the only online public proxy I'm aware of. There are also a few other proxies I found via a way I'm not going to disclose because they look like someone's accidentally open private nodes.\n> \n> I still think it'd be better to sort by stars, because it's too easy to fake site addition date.\n\nIf you can figure out the sql then I'm happy to use it and agree sorting by stars or peers would be best. But I was banging my head against the wall for a few hours today trying to figure out how to do it and failed miserably. As for 0net-preview, I'm aware of it, but it's not that useful for my search engine because it doesn't allow adding sites, so most sites are unsupported.\n\n> [nulap2p](#comment_3_1Mup2dSD24gKN2FKrAAAeAykgwqQwnbFqH): is it ready to be the default Kaffiene engine? seems much batter thanks to zerosites addition\n\nmore or less. I might make it the default search in the next few days. Just making sure everything is good and working.",
			"post_id": 53,
			"date_added": 1629280071
		},
		{
			"comment_id": 74,
			"body": "> [xterix](#comment_1_14EHytsD6XdHp8cVqv9nzGb8SYutDoX9Pi): can somebody help me with registration on zeroid or zeroverse? they both are broken.clicking send request on zeroid causes this appear in right up corner: \"Error while during request: error undefined\" and sending a message in bitmessage doesn't work, they don't receive it. trying to send mail in zeroverse doesn't work too,  the button is greyed out.\n\nCheck [zerotalk.](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di) The zeroid domain name seems to have gone down. I don't really think there's anything that can be done. That's the problem with those centralized ID systems... Guess it's time for everyone to start using kaffieid?",
			"post_id": 2,
			"date_added": 1630476893
		},
		{
			"comment_id": 75,
			"body": "> [musickiller](#comment_4_15NScazvsCHNmiXi6o6nvaMiwjeJYizgZQ): But is kaffieid spammer-safe? Bitmessage was a good way to make sure you have to do at least some PoW to get the ID. ZeroID was so centralized it could check the IP of a person before giving the ID. Hence some protection. What about your ID? What's stopping the user from frequent change of the ID (to counter the filters) to kill whole ZeroNet over a week?\n> I like the idea behind your kaffieid, but I'm not sure people will use it correctly, so not sure I want that on my blog, etc...\n\nUser authentication on Zeronet works via public keys, not by unique username. If you're concerned about blocking/banning, you can ban/block the auth address directly. As for spammers making new auth addresses, this is also a vulnerability with zeroid (albeit they need unique names each time). Changing one's username/id for kaffieid doesn't get around auth address bans, if that's what you're concerned about.",
			"post_id": 2,
			"date_added": 1635326763
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}