{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1555954035,
			"title": "Zeronet realt time messaging",
			"body": "Dear all,\nI am a beginner with zeronet. \nI want to use Zeronet for my personal project in which i want to send messages realt time after every half of second. Can you please tell me if this is possible with ZeroNet?",
			"added": 1555954034
		},
		{
			"topic_id": 1557415940,
			"title": "synchronize the database every half of second?",
			"body": "Hi everyone,\nI am using PeerMessage plugin to send and receive messages almost real time, like every half of second.\nI want to know if it is possible to synchronize the database on realtime? like signing and publishing every half of second?",
			"added": 1557415938
		}
	],
	"topic_vote": {
		"1557415940_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1,
		"1555954035_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1,
		"1557408522_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1555954035_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": [
			{
				"comment_id": 1,
				"body": "> [glightstar](#comment_110_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): It is possible by utilizing the PeerMessage plugin (github) developed by @gitcenter, @krixano and @thunder33345. For the best performance, I suggest you use the new python3 version of ZeroNet together with the python3 version of just-mentioned plugin, which can both be found in the py3-branches of the respective repositories.\n\nThank you very much for the reply.\nCan you please tell me how to use this pluging, there is a little guide but i could't understand properly: I have to pull the plugin and where i have to place it? in the source folders of ZeroNet i found a plugin folder, so should i pull the PeerMessage plugin there?",
				"added": 1556094475
			},
			{
				"comment_id": 8,
				"body": "> [lavaphox](#comment_19_13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm): i know that im developing one, buuut idk when its done since im super lazy right now :P\n\nAre you working on git? Can you please share the project so i can get an idea?",
				"added": 1556094637
			},
			{
				"comment_id": 9,
				"body": "@glightstar @lavaphox,\nThank you very much for the reply.\nI used Peermessage and i am able to send and receive messages, almost real time. \nBut i have another question: is it possible to synchronize the built in database in real time? like signing and publishing after every half second?",
				"added": 1557415607
			},
			{
				"comment_id": 11,
				"body": "> [glightstar](#comment_146_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): Publishing to the network is limited to one action per 30 seconds by the ZeroNet client.I'm not quite sure if @lavaphox understood your question right, or if I might be understanding it wrong tho.. [...]\n\nI think you understood it right, i want to publish it to the network almost realtime. If i put it simple, i want to synchronize the database of the peers (nodes) every half of second",
				"added": 1558111612
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 10,
				"body": "Hi everyone,\nI am using PeerMessage plugin to send and receive messages almost real time, like every half of second.\nI want to know if it is possible to synchronize the database on realtime? like signing and publishing every half of second?",
				"added": 1557416637
			}
		],
		"1557415940_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": [
			{
				"comment_id": 12,
				"body": "@ivanq @krixano  any idea?",
				"added": 1558111713
			}
		]
	},
	"comment_vote": {
		"10_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1,
		"12_1gyp68xGQMYy4CBjedTvYU6xsyxPv1Bzc": 1
	}
}