{
	"posts": [
		{
			"id": "1289fb8a-49d0-47c7-b251-ec9a4e8b7646",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "b7c352c1-9f93-41fb-a2fe-3d9cb429c6a4",
			"body": ">>b50c9461-25fb-4062-8001-3c1f67437c15\nIf it makes you feel any better at least its the girl with the naughty cables this time around.  ",
			"time": 1565625709400,
			"files": "[]"
		},
		{
			"id": "d17abd9b-04cb-4b08-ac95-97cdfb198045",
			"directory": "users/15EpLpGmtU5vSM91SGSRcpZfY9sSFaEYVx",
			"uri": "tg",
			"thread": "f91e5ca8-a9df-4b41-9ce0-9a4d1309fcad",
			"body": "Friendly reminder for people who want /tg/ to thrive, make sure you PIN the board on the global listing.  That means you seed the content to make it more responsive for the other users.\nWill be useful if we plan on doing stuff like character art threads and the like.  \nOr just using a lot of pictures in general.",
			"time": 1565627936200,
			"files": "[{\"name\":\"Make the pin, earn a blin.png\",\"thumb\":\"c4f44138a64fd102e1d6862a52bba35dc159eab7-thumb.png\",\"size\":71972,\"type\":\"image/png\",\"original\":\"908b02ab461cd0904356adf37a0b65e657f6c424.png\",\"directory\":\"1QFHvfSbTA9LNsdK5ngRxuvpyVDGekpTxK\"}]"
		},
		{
			"id": "9d0e3988-9406-4d72-894b-5eda0cdadf84",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">What have (you) been doing since 8chan went down?\nWaiting for it to come back.\nOther than that catching up on some reading and my backlog.  \n>Are (you) excited to see Jim testify before Congress?\nSort of?  Jims scripted update was good, but today he posted a weird fucking rambling video from a childrens playground.  The point was that people were still naming 8chan as being complicit in the Oslo shooting even though that happened while 8chan was down.\nWorst case scenario is that he'll get bowled over and the place stays down for the count.  \n>Are (you) using Tor/VPN? You're not a retard, right?\nBoth baby, re-upped my subscription to Cyberghost for another year, got a good coupon so 18 months was 43 dollars, outside jurisdiction of the 5, 9, and 14 eyes and they (atleast state in their TOS) they keep zero logs so I'm feeling good.\n\nStill trying to get the hang of things here, still unable to post pictures and I probably should get around to applying the millchan update so pinning and muting works better.   ",
			"time": 1565646573300,
			"files": "[]"
		},
		{
			"id": "c62725da-9b50-4fb2-b2b8-0b29a939b07b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">>df862592-ebf0-4d9b-b0ce-2f6f9ab1840e\nConsidering that they are in Romania, I don't think they can be sued by the FBI, and the government of Romania declared EU data retention unconstitutional in 2014 and have passed their own laws to prevent data collection, so I think I'm more or less in the clear as I've checked them against a number of specific sites such that looked into this, and it's not as big as NordVPN to pay people off to make it sound good so I think it's alright to say this is one of the safer clients.\n\nAgain I could be wrong really, but short of running everything in a virtual machine I wipe and cycle every other day I don't know how else to keep excessively clean.",
			"time": 1565649427600,
			"files": "[]"
		},
		{
			"id": "856cfa4c-78f3-4a90-ab50-f5f793e22943",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">>9138eef9-ee83-4c02-a193-6ba07675f7b4\n>glownigs, shills, and faggot redditors.\nIs it wrong that I find the last one the worst?",
			"time": 1565837827900,
			"files": "[]"
		},
		{
			"id": "1d236f10-7d6f-4f66-a498-11b8bf73115f",
			"directory": "users/15EpLpGmtU5vSM91SGSRcpZfY9sSFaEYVx",
			"uri": "tg",
			"subject": "Your Games thread",
			"body": "Well thought I may as well try this.  Share stories about your latest group sessions in any tabletop game.  DnD, WoD, OSR, whatever.  I want to know ow you're doing.",
			"time": 1565838105800,
			"files": "[]"
		},
		{
			"id": "c9160b60-da49-473b-a447-2b577f144cca",
			"directory": "users/15EpLpGmtU5vSM91SGSRcpZfY9sSFaEYVx",
			"uri": "tg",
			"thread": "1d236f10-7d6f-4f66-a498-11b8bf73115f",
			"body": "System is 5E, player levels are 10.  \nIdea is that currently our party (Warlock, Barbarian\\Cleric, Barbarian, Gunslinger) are currently in a misfit in a perpetual twilight woods.  \nWhat happened is that a cult of the Wild Hunt stormed in, and after their forward agent poisoned a good size of the towns populous to draw out its protector (a forest witch) and run her down.  This triggered the towns defense mechanisms, all roads are now blocked and the river is now enchanted so all who touch it are compelled to lie down and drown themselves.  The wicker cage now surrounding the town is charging up and will essentially purge everyone that is not a descendant of the founding families.  \nAfter speaking with the Witch after bailing her ass out of getting staked and we were able to weasel out some details, namely that the security mechanism can be defused if we destroy the main threat, namely the huntsman, the remainders of which have barricaded themselves into a town house and are regrouping at this moment.  This is all well and good but WHILE this was happened our Barbarians decided to wander off and brave the river hoping to establish an escape route.  As one was a dwarf, the Cleric first tied rope around the dwarf, then herself, and cast enhance self\\bulls strength and passed the difficult Acrobatics and Strength checks required to launch Dwarfbarian to the other side without touching the waters. \nUnfortunately they failed the int check prior to measure out the distance, the rope went taut and the Cleric went in and proceeded to fail the Wis save and started to drown.  \nDwarf had to start reeling them in like a fish, so now both are on the far side of the river in the woods in between the impassable cage and the deathwaters effectively splitting the party neatly in two prior to the big conclusion.  GM had to call it early, and redraw plans.\n\nTonight we are actually going to try and conclude this shit show, apparently the GM has a timer where if they cant figure out a way to reunite the party, the two on the farside are getting some Nasty Shit while us in town are going to get a rebalanced assault mission.  \nSo it'll be interesting to see just what the fuck happens considering the Warlock has no spellslots left and no time for short rest.  If anything comical happens will update.",
			"time": 1566012691900,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}