{
	"title": "My VoIP News",
	"description": "[Voice over IP, SIP, PBX and Internet Telephony](https://myvoipnews.com)",
	"links": "",
	"next_post_id": 7,
	"demo": false,
	"modified": 1487370812,
	"post": [
		{
			"post_id": 6,
			"title": "Callcentric adds Conference Room Feature",
			"date_published": 1487370768.176,
			"body": "The new Callcentric Conference Room Feature is available for all accounts, free or paid, and is located in the lower left part of the Dashboard.\n\nDesigned with simplicity in mind, this feature gives you the ability to instantly setup a conference line by clicking on “Request Free Conference number / PIN“.\n\nCurrently there is no limit to the amount of participants that you can have on a single conference call and the Conference Number/PIN Combination that you generate will remain valid until you choose to delete it.\n\nThe Conference Number does not have any restrictions in terms of how long a call can go on for. All of the numbers that are used with the Conference Room Feature are from NY State. Calls placed to the Conference Room Number from your Callcentric Account will be billed based on the outbound calling plan you are subscribed to.\n\nFor those looking for a conference solution on the go, the Callcentric Anonochat App for the iPhone is the answer! Available FREE in the App Store, with no sign-up or personal information required, the Anonochat App lets you create a conference bridge and share the call in number/PIN with your contacts in just a few taps!\n\nFrom 2/16/17 until 3/17/17 Callcentric are waiving the one-time setup fees on all new orders for both Office Unlimited Numbers and Additional Office Unlimited Channels."
		},
		{
			"post_id": 5,
			"title": "Callcentric Reduces Toll-Free Rates",
			"date_published": 1484780400,
			"body": "[Callcentric](http://www.callcentric.com) today reduced their inbound toll-free rates for calls from both the US48 and Canada! The rate reduction is automatic for all customers and went into effect earlier today. Below is a summary:\n\n- Inbound from US48 – Reduced to 1.98 cents/minute (previous rate was 2.9 cents/min)\n- Inbound from Canada – Reduced to 2.4 cents/minute (previous rate was 7.0 cents/min)\n\nFor the next 30 days (1/18/17 until 2/16/17) they are waiving the one-time setup fees on all new orders for both Toll-Free Numbers and Additional Inbound Channels for Toll-Free numbers.\n\nCallcentric is a [RespOrg](https://en.wikipedia.org/wiki/RespOrg) for Toll-Free Numbers giving them greater control over these numbers."
		}
	]
}