{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1616675540_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1571814102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1601196324_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1584103549_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1583915794_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1616675540_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "i dont think so. googles pretty clever with their tracking that i bet they do get meaningful information just by you downloading a resource from gstatic. but its theoretically possible to route all traffic to gstatic through tor or something. i dont know of any extensions that do this though.",
				"added": 1616695431
			}
		],
		"1601196324_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "i recommend against dual booting windows and linux. if you really need to run windows, you should either do it in a vm, or with a separate machine.\n\nmicrosoft hijacks your bootloader all the time when windows updates, which gets incredibly annoying. moreso, when dual booting, microsoft has the power to scan your linux partition while youre booted into windows, and if you use full disk encryption, they have enough power to inject a keylogger into your bootloader when you type your decryption password. that doesnt mean they do, or would, but in my opinion, if you dont think microsoft will go that far, youre not paranoid enough.\n\nthen again, if you had full disk encryption on your linux partition, and microsoft were to tamper with your bootloader, the hashes would show up different, and if you want to go through the trouble of checking hashes and warning us if it turns out to be true, be my guest. but in my opinion its not worth the trouble.\n\ntheres also plenty more attacks they can do with full hardware access, take for example, injecting code into your roms. im not worried about that though, because we already know new intel and amd chips do have hardware backdoors (intel me/amd psp).\n\nme personally, i dont run windows on any of my machines anymore. almost all my games and software are either open source, have native linux builds, or run on proton just fine. i run all closed source software in a sandbox, except for my nvidia drivers, which im trying to move away from.\n\nswitching drives might be safe and paranoid enough. but you should physically disconnect the drives like you said you wouldnt have to do.",
				"added": 1616704889
			}
		],
		"1583915794_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 3,
				"body": "> [ulrichard](#comment_2_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ): ... \"ensures that your ISP cannot collect and sell personal information related to your browsing behavior. \"-> For this to be true, one has to also use TOR or a VPN.\n\n> [twc](#comment_4_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C): True. Even though the payload isn't visible when using HTTPS, the headers, including domain and URI are visible to a snooping network operator. [...]\n\ni will say that doh is still a great next step to cut down how much info your isp can collect about you, making doh worth it.",
				"added": 1616705077
			}
		],
		"1571814102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 4,
				"body": "> [ssdifnskdjfnsdjk](#comment_102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): \"believing that surveillance keeps you safe means believing in the institutions that conduct surveillance, and public trust in both government and corporations is at an all time low\"\n\nwe really shouldnt believe that surveillance keeps us safe at all. privacy is a right our nation is supposed to 'secure' for us, which means that *national security is never more important than privacy, period.*",
				"added": 1616705811
			}
		],
		"1518509680_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 5,
				"body": "if its decentralized its not really clearnet. decentralized dns is not enough on its own, because your isp becomes a single point of failure. but yes, as @subpixel said, a clearnet service may have a domain name but really be a way to access a decentralized website.\n\nfor example: if for whatever reason you were trying to get on zeronet through a chromebook, you could use a zeronet proxy (i use https://zeronet.now.im/ whenever im linking to zeronet content for my friends because they dont have zeronet themselves).\n\nin the meantime, *please* get away from that chromebook and move to a regular pc.",
				"added": 1617227453
			}
		],
		"1528234320_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 6,
				"body": "im using cloudflare dns over https with dnscrypt-proxy",
				"added": 1617229521
			}
		],
		"1520962290_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "> [ssdifnskdjfnsdjk](#comment_145_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Set Tor to be the SOCKS5 proxy of your app like a web browser on Linux\n\ndont do this. it will make your privacy worse than just routing your traffic normally. if something calls for tor, use tor, and if something calls for your regular web browser, use your regular web browser",
				"added": 1617229899
			},
			{
				"comment_id": 8,
				"body": "> [ssdifnskdjfnsdjk](#comment_146_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): in this case my aim is more about anonymity than the privacy, but i am wondering why you are saying this, do you mean the risk of exit node capturing the plain (unencrypted) HTTP traffic? If i make sure i toriffy only the major sites that are using https, i think the risks of leaking plain password would be minimal.\n\nif its anonymity you care about, proxying through tor is not good enough. webrtc routes outside of your socks proxy, so it will end up going through clearnet, and websites can use that to unanonymize you. tor browser takes care of this by blocking webrtc. you should be able to do the same for your browser, and if not, you could probably patch your browser if its open source.\n\nif you can patch it you should be fine, unless theres another protocol that routes outside of your proxy the same way.",
				"added": 1617392310
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_147_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS):\n\nin that case you should be good. sorry if i confused you, now i know for next time :)",
				"added": 1617484516
			}
		]
	},
	"comment_vote": {
		"2_1AMDCwJEDNWWiP3KVp5M9vCCaj91tefBbB": 1,
		"102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"144_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"10_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"3_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"130_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"146_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"147_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	}
}