{
	"posts": [
		{
			"id": "605718cd-2622-4230-b09e-6035836b9d3b",
			"directory": "users/19Z7HRwLtPP2zkK5EFm1qwTPBZhJH9kZWy",
			"uri": "cp",
			"thread": "d0eac899-7e28-4c4c-97ae-49c9bfc2a436",
			"body": "In that case, could you kindly direct me to a non-honeypot site?",
			"time": 1566443438241,
			"files": "[]"
		},
		{
			"id": "c808fe1e-700f-413e-b6d4-da069449b19c",
			"directory": "users/1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo",
			"uri": "test",
			"thread": "9185acb1-6be1-4cc5-8a66-87f4d5e2955b",
			"body": ">>6cf8c873-cd79-4d9b-88ea-64c6663ba05d\nLets see if posting has fixed itself. I was having some problems before the update.",
			"time": 1566506434036,
			"files": "[]"
		},
		{
			"id": "91b56eb2-c5eb-4a41-a7f6-736974510ba1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b45720e1-3884-4328-a831-0cdc2ce039dd",
			"body": ">>b45720e1-3884-4328-a831-0cdc2ce039dd\nI would be a fascist, but I trust the winds of fate to give us a great leader far less than I trust myself. Oh, sure, there have definitely been dictators who have brought freedom and prosperity to their people, but for every one of them, there have been two who brought poverty and oppression.\nThat said, a wise fuhrer is infinitely more possible than real communism, and the communists/jews hate both pro-white dictatorships and nations of independent and free peoples. The question of whether we need kings or liberty can be settled after we remove their mutual enemy.",
			"time": 1566510839597,
			"files": "[]"
		},
		{
			"id": "7c2880d1-400d-4468-867e-33b8cd20276f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fa783407-01f6-4800-ad69-7bf37feec21e",
			"body": "I don't think that this is the right place, but I don't know anywhere better.\nI have ended up with a server. A powerful one. What is the best way to put it to work to generate some passive income with minimal maintenance?",
			"time": 1566512462065,
			"files": "[]"
		},
		{
			"id": "e9ff990f-7c45-4bc9-8990-0800f32c0fbf",
			"directory": "users/1ESR1LzuQJvYkrU9Rwu3BQ4x4NeKVAmcx5",
			"uri": "clang",
			"thread": "34d9e964-bf2a-4c87-ae4d-11167c935b20",
			"body": ">>cfa4c61e-d8fb-462c-bddb-e61d20f58796\nI'm bitter that more people have used machines as accessories in their self-harm fantasies than as their own sexual end. I found an amenable fetish that won't send me to jail or send me to the hospital, and there's less good material than for any given disgusting garbage kink.",
			"time": 1566526802600,
			"files": "[{\"name\":\"my servos when.gif\",\"thumb\":\"e4d07ec1ee2896e7988c25d4f659deb362078b69-thumb.jpg\",\"size\":4120697,\"type\":\"image/gif\",\"original\":\"e4d07ec1ee2896e7988c25d4f659deb362078b69.gif\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		},
		{
			"id": "4259e4cf-9bb3-4e3b-9dc8-cd3c40cbf143",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "6f1e9601-15ff-41d0-8c08-da01cc6f9bbd",
			"body": ">>a16de5a3-9cf7-4624-898a-29c2141770ab\nSomehow, the idea has taken root that the government spending more resources suppressing an idea is that idea losing. That's why so many on cuck/pol/ get mad whenever a shooting happens. Apparently, it's going to encourage more censorship and more security, and that's a problem. The reason why glowniggers want you to commit terrorist attacks is so that they can justify more security, right?\nGuys, you realize that normies' relationship with the government doesn't work like that, right? The normies pay their taxes so that they don't have to worry about things like personal safety. When the normies have to put up with layers and layers of security and bullshit, that doesn't make them hate whoever is the reason the government found to justify that, they hate the government because they very specifically pay taxes so that national security isn't their problem. Now, though, they're being bothered by this garbage all the time, passing through metal detectors and showing ID just to check an account balance, and it makes the government look weak that they have to do all of that. And we all know what happens to weak governments, don't we, and what do you know, there's this replacement right over there who seems to run circles around the feds. Glowniggers want political violence and terrorism because their budget is directly linked to it. The fact that their increased police budget is a detriment to the actual government doesn't factor into their minds.\nBut sure, let's just keep being optics cucks who hope that a political solution can be found even as our enemies do everything in their power to prevent us from even being allowed to live unmolested for our views. That's a real alpha move, that will get the normies on our side, the broader population would love to be ruled by a party which concedes more than Neville Chamberlain and responds to aggression by crying. It's not like playing the victim worked historically by being backed by big money interests and threats of violence.",
			"time": 1566528318200,
			"files": "[]"
		},
		{
			"id": "ae86e632-098d-4c17-96de-3e4773c29f59",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "504b65b8-ea6a-4fb9-83a7-7f8ff7ad6a36",
			"body": "Thread theme:\nhttps://www.youtube.com/watch?v=ZLsX9WUdYnU",
			"time": 1566528624900,
			"files": "[]"
		},
		{
			"id": "d411b86e-848a-498c-b2ea-391eb36af1d0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>5a9987f0-180c-433f-806f-dbffcf3c54a5\nThere are three kinds of people: those who's philosophy is based in religion, those who's philosophy is based in egoism, and those who haven't given enough thought to their philosophy yet. Either there is a definitive good larger than yourself, or there isn't.\nWhat good does socialism or marxism serve? Not one that can be proven any more than the existence of a deity. You have a very special relationship with yourself, and this makes your own person the only one who's soul and humanity you can personally attest to. Even in its idealized form where it works and doesn't just kill people, when you support a socialist system, you are lowering yourself to the level of the unknown stranger in service to his good on the hope that as much returns to you as you put in. Do you know that you are taking that risk to further someone who shares humanity with you? You cannot know, and yet you do it anyways, allowing yourself to be pushed and pulled by the idea that you owe something to the people around you.\nAs for a deity, the ones who show proof of their existence always eventually turn out to be anthropomorphized natural phenomena. The ones who don't, don't, and are thus pointless to argue about.",
			"time": 1566529841912,
			"files": "[{\"name\":\"spooks.jpg\",\"thumb\":\"a569dc782b3e6e37e9382de6c2cb48bd5166a81b-thumb.jpg\",\"size\":18413,\"type\":\"image/jpeg\",\"original\":\"a569dc782b3e6e37e9382de6c2cb48bd5166a81b.jpg\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		},
		{
			"id": "362fb511-dc83-46c3-9953-209d94b39588",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1362e22f-5ed4-431c-88dd-16a71c3d24d0",
			"body": ">>1362e22f-5ed4-431c-88dd-16a71c3d24d0\n>The judge did deny a prosecution probation request to bar Sears from publishing Your Ward News. Such a ban would violate the constitutional right to free expression, Blouin said.\n>\"Mr. Sears should be free to publish whatever he wishes, even if unpopular and objectionable, as long as his words do not offend the Criminal Code,\" Blouin said.\n\nYou know that one strawman of centrism that the left keeps pulling out of their ass where the centrist thinks we should kill half of the jews? Figures that Canada would use it as an actual political position about the influences of American Constitutionalism and European State Supremacy.",
			"time": 1566664943155,
			"files": "[]"
		},
		{
			"id": "0511ddbd-7d71-4a8d-bc8f-eaa5a06d6e06",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>1181fddc-ebc0-48d9-8a8a-30d45e34425c\nThe problem is that the barrier to entry is why this place isn't utter dogshit. Remember the internet before the Eternal September? It took a bit of knowledge and a bit of effort to get there, and as such, the people who showed up were usually willing to actually try once they were there. 4chan, being a website with a reputation in the early days of the internet, was in a similar position, but with the election of Trump and the proliferation of the Q meme, it's safe to say that they've had their Eternal September. I think that, the current process for coming here, (download program, find site, turn on torposting, get zeroid) is perfect: simple and easy, the only people who can fuck it up are people who know less than nothing and people who don't give a shit, which are the exact kinds of people we don't want.\nPeople don't just wander in and make awful posts because they have no clue what they're doing, and they also don't just pop over and drop a few shill/slide/spam posts because they can. Most trolls aren't actually that dedicated. Wall out the bottom 10% of effort and you wall out 50% of trolls.",
			"time": 1567098134907,
			"files": "[]"
		},
		{
			"id": "80303d3c-4900-4469-9c31-ca1644aa49e3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "ed4fff4d-1493-44d9-a4be-e0dccbcfff8a",
			"body": ">>ed4fff4d-1493-44d9-a4be-e0dccbcfff8a\nThis looks like a thread for me!",
			"time": 1567098244259,
			"files": "[{\"name\":\"moonman_jew_pizza.mp4\",\"thumb\":\"afb892ec1d5438a8af58e0f0546fee4baade58d6-thumb.jpg\",\"size\":10304082,\"type\":\"video/mp4\",\"original\":\"afb892ec1d5438a8af58e0f0546fee4baade58d6.mp4\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"},{\"name\":\"Right Wing Death Squad - Moonman.mp4\",\"thumb\":\"890ff6283675bfc434a07ceae9b500278a9f55f6-thumb.jpg\",\"size\":18309142,\"type\":\"video/mp4\",\"original\":\"890ff6283675bfc434a07ceae9b500278a9f55f6.mp4\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		},
		{
			"id": "96ba7166-29e6-4aab-b573-3005942ddc1a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f3419434-0eb7-4416-9d86-54997830109a",
			"body": ">>f3419434-0eb7-4416-9d86-54997830109a\nHajjis would be ten times as good as Jews, because they are as malicious and deceitful but they are also retarded.",
			"time": 1567098480000,
			"files": "[]"
		},
		{
			"id": "9349b02a-6165-4ab2-b3f1-21fbc2bfb74f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": ">>f44d3704-29c2-4b58-9c01-91d5db54d794\nYou are retarded. In the last century, as many presidents died in office as failed to get reelected. Add in Nixon, and less than half of the Presidents who were voted in and didn't see 8 years did so because they failed reelection. Incumbent advantage is huge. Many people have problems with Trump, but he's no Jimmy Carter. I think you fell for the Zognald shilling. Remember that war with Iran he was going to get us into, and didn't, like he did with Syria and North Korea? I find myself wondering how I'm the only person who remembers that that happened.\nAs for my predictions, Trump wins 2020, since it was a minor miracle that he won 2016 and the field is now even more in his favor as before. Republicans learn to stay out of his way faster than last time. The democrats will likely run someone like Hillary, but with less baggage and equally less draw. On the chance that they do take a big risk, it will be some Occasio-Cortez type who practically turns the field into \"people who like her\" vs \"people who's opinions actually get listened to\".\nThe alternative leftist movements broadly continue to play the wife in pic related, with the liberals as the husband. Wouldn't be the first time communists forgot that \"ally-of-convenience\" goes both ways. The alternative right movements get their shit together a little. Maybe some of them even start on the path to being important. We'll find out which ones did it, if any, in '24-'28.\nChina has probably hit the wall already. Systems like theirs tend to be good at keeping a lid on problems like they have, but they come out eventually. It will probably survive the next four years, and it might even seem stronger at the end, but the size of the problems that they need to sweep under the rug swiftly outpaces the size of the rug they have. Mao's disastrous reign, and his successor's poorly thought out ideas, might even put warlords back in power within the next few decades. Who wants to get back into dynastic politics should get reading, since Taiwan is still there.\nEurope will likely see no shakeups larger than Brexit, and they may not even see Brexit, we'll see how Boris handles it. If he fails somehow, the government might just throw out the referendum, but that is an unlikely reaction to an unlikely scenario. The rest of Europe will continue to stew in it's bitterness about being placed behind foreigners. Extend the timeframe a bit longer, and you will likely have some real issues, but I don't want to make concrete predictions beyond 2024. I've heard rumors of a massive reccession brewing. I can't say I know about that, but if it happens, add a few more points of European chaos into the models.\nAmerica will still be a democracy at the end of it all (say, at ~2030). Some of Europe might not, but America will. America has always been resistant to non-voting systems of government, and that still has a bit of life in it.\nTechnology is getting into territory where it's being made faster than it can be used. That said, barring any massive technological developments, '20-'24 will be like now except a bit *more*.",
			"time": 1567469733600,
			"files": "[{\"name\":\"sb6r6z1tfmp01.png\",\"thumb\":\"4cae82dff59e777a5f9a374497675acfbad31640-thumb.png\",\"size\":222037,\"type\":\"image/png\",\"original\":\"4cae82dff59e777a5f9a374497675acfbad31640.png\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		},
		{
			"id": "3e22123c-0efb-4dc1-b75c-1d5a2680fed6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": ">>76638a99-c145-467a-a7a5-1f45c7ed739e\nI remember things, too, asshole, and my memory says that Trump was grandstanding about how his generals were unable to explain how their strike plan benefited Americans. I also remember that we were supposed to simply invade Syria, and the most recent reports pin the number of men there at less than one thousand, which is not an invasion or even occupation force. The actual Syrian military is 140,000 strong, for comparison.\nNo amount of kvetching will change that that is what I saw happen. I'm a single-issue voter on firearms rights, so listen to me when I tell you that inventing reasons to dislike him is petty and stupid.",
			"time": 1567616182600,
			"files": "[]"
		},
		{
			"id": "b1617d2d-d642-4b83-a78a-42995be681aa",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f44d3704-29c2-4b58-9c01-91d5db54d794",
			"body": ">>a28d310d-9170-4b4e-9d5d-4ec27c6a0401\nhttps://www.businessinsider.nl/us-military-deployments-may-2017-5?international=true&r=US\nThat's just by looking up \"US troops in Syria\". More recent articles seem to say that the number went up to 2k, but while Trump requested a full withdrawal, Turkey threatened to do bad things, and so the amount was merely reduced to 1k. The reason why they are still there at all is to assist Assad, who I recall was considered /ourguy/ as far as that situation went.",
			"time": 1567648195800,
			"files": "[]"
		},
		{
			"id": "5ebdd7f0-c12c-40dc-890e-689caf568f66",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "62f3f571-cbd3-4b07-89f5-fe17303ca129",
			"body": ">>4584c7a2-be4a-45c4-9ece-1eb379f7db4b\nI fondly remember when the shilling turned from \"Trump is going to get us into war with Iran\" to \"If you don't want war with Iran, you're a coward\". Everyone was convinced that Bloompf would take it too far this time and anger everyone, and it didn't happen. This whole \"wars for Israel\" business didn't stick the last three times, it would be a waste of your time to discuss a hypothetical fourth.",
			"time": 1567648449095,
			"files": "[]"
		},
		{
			"id": "cfd72884-5b83-4cee-8630-087c409e79d6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "dd9949af-25a9-45d2-934f-59ce4de4af91",
			"body": ">>3f22016d-1ccc-4a24-819f-543632794640\nUsual goberment stepping\nIt's like drugs, where it gives them an excuse to look busy, except in this case it's also a way to clear out people the feds don't like (putting files on a computer is not hard).\n>>8959b33d-6ebe-4d7d-9f55-7005f960f186\nSupposedly, some VPNs are prevented from doing this by hosting in countries where the government has no legal authority to demand such information. Supposedly.",
			"time": 1567649044383,
			"files": "[]"
		},
		{
			"id": "b45a4e01-5cee-42b9-b70d-7d6696798dec",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "42710d75-7d2f-4231-bcab-14db1e43fae8",
			"body": ">>bab268c0-ef09-4889-a6fc-2e44b9bee9a9\nThat's lame. This site is fucking great.",
			"time": 1567979321600,
			"files": "[]"
		},
		{
			"id": "711284d6-7116-48de-b239-18616a8d5047",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b174a737-ac5a-4d32-b8c3-1e4172b2c220",
			"body": ">>b174a737-ac5a-4d32-b8c3-1e4172b2c220\n>In ZeroNet before rev4188 the wrapper template variables was rendered incorrectly.\nmissed it by *this* much",
			"time": 1568498410310,
			"files": "[]"
		},
		{
			"id": "79954e69-40f7-4f77-b2e8-f23c19ae482a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "112e3faa-c5fa-42bc-a1b1-8cd5aa78198b",
			"body": ">>71d482f0-2f9a-42ec-9188-00ef7bf27c8c\nNot sure it's a net good",
			"time": 1568498965764,
			"files": "[]"
		},
		{
			"id": "bb37caff-50de-4b6d-8351-b0b6c6fec8e8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>cd73b6ab-a827-41eb-8dfd-b221e79f812f\nGold being a way to store value in preparation for a collapse is a load of shit. You can always sell food or guns, but you can't eat precious metals, or defend your house or hunt with them. You might as well invest in fine wines and art pieces. Consider >>92b765e4-b509-47ee-b689-00ee33ec2926. Even in the picture, the first thing he does is trade his precious metals for ammo, which he could've gotten at a much better rate had he cut out the middle and bought ammo outright.\n>>974221c9-882d-4ba6-acaf-9c265da91256\nThanks for posting a second time to make the same complaint.",
			"time": 1568515878828,
			"files": "[]"
		},
		{
			"id": "0aa1353b-ea45-47e0-8306-c7d0d02408db",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>079f69ea-cbad-4191-b5fc-da4a5ef96a2e\nI think you should try to say that again. My reading of what you posted has you saying that you shouldn't invest in firearms because they are useful and take up space.",
			"time": 1568607963928,
			"files": "[]"
		},
		{
			"id": "d931d195-0312-4676-8afb-216e2c19784f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "cca67517-688c-4197-b4a9-ee2e4bbefb9b",
			"body": ">>cca67517-688c-4197-b4a9-ee2e4bbefb9b\nA Chinese scholar, hearing of Confucius's views, traveled to Confucius's school in order to ask him a question. When he found the old master sitting on the porch, the two began to speak to each other. Eventually, the scholar's curiosity could wait no longer.\n\"Master Confucius\", he said, \"I have heard that you claim that it is a sign of homosexuality to wipe one's ass. Did you really say that?\"\n\"I did say that\", said Confucius.\n\"But why?\" asked the scholar.\n\"Consider this well, scholar\", Confucius explained, \"A man who cleans his house is expecting a visit.\"",
			"time": 1569602112995,
			"files": "[]"
		},
		{
			"id": "01f20673-9bfd-4367-a189-d060f8901a2d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "85778ff8-7a0a-4b7e-bd28-d33dd8365c68",
			"body": ">>85778ff8-7a0a-4b7e-bd28-d33dd8365c68\nAs long as you don't need to hit the enemy\nAdmittedly, in most situations, just pulling out a gun at all is enough, but come on man, go the whole nine yards or don't.",
			"time": 1571346769320,
			"files": "[]"
		},
		{
			"id": "c73d5478-040d-40e1-9ff3-c85889920100",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "13f60fd4-76a9-4216-93ab-aadfe84b932b",
			"body": ">>13f60fd4-76a9-4216-93ab-aadfe84b932b\n>inb4 \"none lmao pedowood jews make all entertainment in the world explicitly anti-good-things\"\nRemember goyim, no fun allowed!\nAnyways, Birth of a Nation is good, I'm told. Also, Who Killed Captain Alex is just regular entertaining and kind of interesting from an abstract view, but not really political.",
			"time": 1571347655600,
			"files": "[{\"name\":\"9b8cb01f8aa721637eec9e4b17fda822fea9b82d.jpeg\",\"thumb\":\"52323c47b2334dc91657bd084d1a535e1fd7ff91-thumb.jpg\",\"size\":538713,\"type\":\"image/jpeg\",\"original\":\"52323c47b2334dc91657bd084d1a535e1fd7ff91.jpg\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		},
		{
			"id": "07996c4f-2aeb-4deb-82a6-a950fd662d9c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fcfc6d40-5f95-4627-b11f-3bd37a379066",
			"body": ">>fcfc6d40-5f95-4627-b11f-3bd37a379066",
			"time": 1575854902713,
			"files": "[{\"name\":\"IMG_0860.png\",\"thumb\":\"85b06e5685e8259870d9bbe867b89f894296cd3e-thumb.png\",\"size\":387138,\"type\":\"image/png\",\"original\":\"85b06e5685e8259870d9bbe867b89f894296cd3e.png\",\"directory\":\"1MNusCx15WzkQ5QMA2FuT7p7aPi3jiaG8p\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}