{
	"title": "crypBlogged",
	"description": "hacking at  /dev/urandom",
	"links": " hrm",
	"next_post_id": 6,
	"demo": false,
	"modified": 1473383064,
	"post": [
		{
			"post_id": 4,
			"title": "Lets talk about music managment",
			"date_published": 1473360760.778,
			"body": "In times of soundcloud, apple music, spotify and other streaming services, this sounds even more anachronistic than it did 5 years ago but I like to manage my music myself, with no central gatekeeper interfering for whatever reason. I should maybe add that I'm a DJ.\n\nI loved iTunes for a long time because of it's _Smart Playlists_ but we switched to _it's complicated_ years ago when the storeification started. Currently i'm using [clementine](https://www.clementine-player.org) but it is in a very sorry state, too.\n\nHere are some more thoughts I formed on ssb[*](http://localhost:43110/1ea6KbetUUnpvTqrTEJoxr6hh66uLbiMJ/?Post:3:ssb) before coming across ZeroNet, maybe it can offer new solution-spaces for the FS and DB section.\n\n# Physical Music Collection Management\n\nIdeally computing could help me aggregate all the information that is available on the net. For my musical taste that is:\n\n* Beatport - has follow artist/label, knows latest releases, snippets and store\n* Soundcloud - has follow artist/label, previews of tracks, sometimes in full.\n* Discogs - great catalog info\n* Archive.org - lots of CC music, netlables yey!\n* various music label rss feeds - podcasts, release info\n* various _I'll just leave this here_-sources\n\nNormalized access to these silos would allow a new system to spot a newly released track on beatport, which I liked the preview/demo of three month ago, when I heard it in a live-set recording (using audio fingerprinting, or simple text if the meta info was there, some sets come with track-listings).\n\nSince we (me and my music-mixing buddies) don't accept, not playing a track if the tubez don't feel like it, we _cache everything locally_. Leading to having multiple versions of the same tracks everywhere. Some from predb, some from soundcloud, some bought, some recorded from vinyl, you name it. Leading to spending lots of time on shuffling files from `boxA:messy/folder/structure` to `boxB:even/more/messy/friends/dump23/`, leaving havoc on each others hard-drives.\n\n# What I want:\n\n* A distributed catalog information database\n* A distributed file-system for tracks\n\nWhich would help me sort I'll visit $friend later, I want to show him everything I found since $lastVisit and other fancy things. Ideally this would sort itself out and vanish into thin air but the dark piracy cloud is hanging everywhere, of course..\n\n## For the DB:\nThere is so much distributed awesomeness going on right now, I really don't know what to pick. @mafintosh's hyperlog looks awesome but might be a bit bare for higher level needs. hood.ie also catches my spirit but I don't want my users to manage couchdb instances, nor I for them.\n\n## For the FS:\nDropbox was discarded because __LOL__, _Hi Condi..._ Last we tried syncthing but setting it up for multiple people isn't that easy and metadata conflics haunted us, too. My biggest hope is IPFS (content adressable, just cache favorites through pins) but it can't control access right now and I don't want my friends to get angry letters.\n"
		},
		{
			"post_id": 3,
			"title": "ssb",
			"date_published": 1473360661.852,
			"body": "I have been using [secure-scuttlebot](https://scuttlebot.io/)  for my decentralization needs recently and will continue to do so. It started as a twitter/forum thing and now there is a git(hub) clone ontop of it. Something I'd like to see here as well.\n\nYou can find me there as @p13zSAiOpguI9nsawkGijsnMfWmFd5rlUNpzekEE+vI=.ed25519\n\nPing me for an invite, if you want to take a look."
		},
		{
			"post_id": 2,
			"title": "ZeroMusings",
			"date_published": 1473360349.282,
			"body": "Interesting... Came here after listening to StealThisShow S02E01.\n\nFirst impression: Very impressed by the polished UI!"
		}
	]
}