{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1634119523,
			"title": "Binary Transparency",
			"body": "Binary transparency is related to binary executable files, for more info you can google split-view attack (a.k.a. split-world attack)\nI wish [this guy](https://twitter.com/BinTraDirectory) to do some work on it. I think if we increase his followers  it would encourage him. it passed some time without activity\nIt has a website too: https://bintra.directory but registration is not working\n\nI hope my post doesn't cause that he would be contacted by a government to make a deal and stop working",
			"added": 1634119522
		},
		{
			"topic_id": 1634477265,
			"title": "Comparison of Decentralized Social Media",
			"body": "http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:comparison-decentralized-social-media\nPlease complete it especially if you know other decentralized (blockchain) socials that support \"group\".",
			"added": 1634477262
		},
		{
			"topic_id": 1634478504,
			"title": "Immutable archive for firmware, ROMs, device drivers, software",
			"body": "An attempt for stopping split-view attack. In below page for every file you can create a post and enter it's official download link, checksum, magnet URI, google drive ... \n\nPage: https://discussions.app/c/binary_archive (On Telso blockchain)\n\n~~Sapien is blockchain based and support \"group\" so I selected it. If you have better option tell me\nhttps://app.sapien.network/t/binary_archive\nNote 1: You have to register to see the link\nNote 2: I'm not sure but from past I think the notification is not working~~\nNote: Sapien is very slow and I think it is not indexed by google, too.\n",
			"added": 1634478500
		}
	],
	"topic_vote": {
		"1636110611_1P52LQ4PSWFYvAUU7TPYJwLjHAdjaC3Ht": 1,
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1634478504_15PEof54VQE7mki8G8hYa5FgkCgpYgetSg": [
			{
				"comment_id": 1,
				"body": "Also a fork of this d-app that support proprietary software, too could help:\nhttp://quiark.github.io/AuditDog (Abandoned)",
				"added": 1634502560
			},
			{
				"comment_id": 2,
				"body": "> [cyberk1d](#comment_1_148jFFH43GX5qkcpTXmeRiTaYJahpiWrSW): I like the idea, but given the email and phone verification on sapien.network it's probably not the best repository for potentially \"illegal\" content.\n\nPhone verification is optional (for monetization). See my update I suggested an alternative",
				"added": 1634513990
			}
		],
		"1633740636_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 3,
				"body": "For anonymous internet access Lokinet is best option\nhttps://oxen.io\nhttps://lokinet.org",
				"added": 1634954995
			},
			{
				"comment_id": 4,
				"body": "> [xanadu](#comment_35_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Nah It's another crypto scam :)\n\nLokinet is one of few project in d-apps area that is fully open (and ready for use)\nWhat is your reason for your opinion? because currently only one that I can think of is being member of china cyber army",
				"added": 1636309128
			},
			{
				"comment_id": 7,
				"body": "> [doctorforesight](#comment_3_1Hiqq5zy6pScwUbR3wzLL2MrprBEDBfK9z): Better than Zeronet?\nNo and Yes \nLokinet provide anonymous clean-net access but ZeroNet can't be used for cleannet (Comparing to similar projects like Freenet or Maid network, ZeroNet has weaker anonymity even in its network)\nHowever ZeroNet has CMS and distributed storage, Lokinet (and I2P) have not. Freenet has them (it has a social media plugin which can be used similar to CMS) but very unusable due to installation error and other problems - I failed to use it)",
				"added": 1636730505
			}
		],
		"1634848133_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 6,
				"body": "Merge it please https://github.com/HelloZeroNet/ZeroTalk/pull/102",
				"added": 1636558878
			}
		],
		"1636121680_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 8,
				"body": "ZeroNet protocol is viewed same as BitTorrent protocol by government surveillance. Why it needed to be replaced?",
				"added": 1636731833
			},
			{
				"comment_id": 9,
				"body": "> [6283822](#comment_127_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): It's a new decentralised network with better features, network layer and lesser resource consumption, it can be compiled to IOT device level chips to servers, that may not be possible with current zeronet code.\n\nGreat",
				"added": 1636740350
			}
		]
	},
	"comment_vote": {
		"127_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"233_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1
	}
}