{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1603655918_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1595165517_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "> [somany](#comment_2_1LZGRUjvEkyyX4dKdGqTCxP1smz6tkph8B): I'm considering being a darknet only vLogger. I'll post on zeroNet+freenet+retroShare+bitchute+bitTorrent . I like to create multiple zeroID accounts [because I don't like to be tracked]. The decision is not final yet, so lets see..\n\nGood luck :)",
				"added": 1598040299
			}
		],
		"1604079393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 2,
				"body": "Hi there. Just luck I logged on ZeroNet after a while, I completely forgot I made 0sh.bit lmao. Sorry about that, I make a bunch of stuff. Thing is, according to this clearnet link ( https://namebrow.se/name/d/0sh/ ), someone stole the bit domain and put a bitmessage in it instead of the pseudo-DNS record. It's still working though (why?). I would have to wait for it to expire so I can renew it, isn't this how it works? I'll patiently wait for it to expire and then broadcast a registration, let's hope that works.",
				"added": 1604801712
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2675_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Can you resolve issues of concern, wipe the database and restart with a Name.YO TLD address?\n\nI am confused. Why would I wipe the database? Also, just tried Name.YO out, and gitcenter's 0sh.yo seems to work.",
				"added": 1604875500
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2678_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I thought by way of conversation that there was a security issue and thought that would mean a more secure database, if that makes any sense. Probably not.\n\nOh, sorry. I was talking about the domain problem. About the security aspect, yeah, I might rewrite the whole thing. There's no need to wipe the database though; it can be fixed, I think, without losing any data. I'll rewrite it when I have the time. Before that I'd have to learn again about how zites work, it's been 3 years without touching this technology :^)",
				"added": 1604890508
			},
			{
				"comment_id": 7,
				"body": "> [gitcenter](#comment_1471_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I've registered it long before to avoid domain squatting for sites that need domains, like link shorteners. I can transfer the 0sh.yo domain to you (manually) if you want me to do that.\n\nThere's no need, keep it :)",
				"added": 1605201421
			},
			{
				"comment_id": 9,
				"body": "Well, just lost the domain thing. I have absolutely no idea why it still works, pure wizardry. Haven't had the time to rewrite the site, it will happen... At some point.",
				"added": 1607435616
			}
		],
		"1604952415_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 5,
				"body": "I think you mean a program that makes malware undetectable by an antivirus. You're going to be disappointed: there are no crypters, at least none that work in the long term. You make your own when you need one. If you want to make malware undetectable, you need to make it yourself. Probably in assembly, as C adds some code overhead that sometimes will make easier for the AV companies to find a pattern and detect your binary as what it is. You should also consider making it polymorphic so that it mutates itself, which adds yet another layer of complexity. Stop whatever you are trying to do, and go learn C and assembly. It will be hard, but it's the only way. Maybe you get discouraged on the way and dedicate your time to doing good things. Good luck!",
				"added": 1605029174
			}
		],
		"1604988183_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 6,
				"body": "If I assume you can't just upgrade, you probably won't be able to. Find another way: if you can install Docker, you're all set, use nofish/zeronet; otherwise, you'll probably want to try a chroot jail.",
				"added": 1605065224
			}
		],
		"1605228744_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs": [
			{
				"comment_id": 8,
				"body": "Nice test bro",
				"added": 1605230917
			}
		]
	},
	"comment_vote": {
		"7_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": 1,
		"65_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"1_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"2_1LZGRUjvEkyyX4dKdGqTCxP1smz6tkph8B": 1,
		"58_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"1_1AvAWDBvU1R8GNZYiySpaQATAt1HxH4f3u": 1,
		"1_16NTbwavoMqnmh9FPkt74NBdUAci4oEo7B": 1,
		"1_1J6iUrzwEepf9B4AEMvHiWYr2oMFB4E749": 1,
		"1_1Ef2FUbiD5kqzq5NkSfj1VWHP3JS91zH4k": 1,
		"26_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"5_1G7yH3iZyr6CQY5NG2YcXCKmkbfXz83h1w": 1
	}
}