{
	"posts": [
		{
			"id": "1cc386c6-c176-49ac-9b76-ce35b208b365",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "41fae65e-1972-456c-b5f6-d64e45560986",
			"body": "test",
			"time": 1568581468138,
			"files": "[{\"name\":\"b26a7aa6845daeb0.jpg\",\"thumb\":\"ee7274d95e4df6ad453591e707605f7a988cc3ec-thumb.jpg\",\"size\":250562,\"type\":\"image/jpeg\",\"original\":\"ee7274d95e4df6ad453591e707605f7a988cc3ec.jpg\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "e84d608a-c6c4-46f4-8e61-6d009c426f64",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "9a586367-7402-4df1-bf32-d75a108cb2f0",
			"body": "I dunno, I get more. Full on Tor here.",
			"time": 1568730712528,
			"files": "[{\"name\":\"zero.png\",\"thumb\":\"1f148b0234b6f4822c0acc23669e0ce8540a5cd5-thumb.png\",\"size\":85056,\"type\":\"image/png\",\"original\":\"1f148b0234b6f4822c0acc23669e0ce8540a5cd5.png\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "ac182689-a01f-4596-af8c-825c7c74fa7b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "95f347b8-3d41-401a-b875-f700eabe4f3c",
			"body": ">>197dddd3-f7d9-4b2d-81f9-b72b79d4ba19\ncp is cp, regardless of how it was produced. That doesn't mean the act of looking at it should be able to ruin someone's life, as nobody is harmed. But deluding yourself into believing you're not a pedo for liking fictional cp is hypocrisy of the highest order.",
			"time": 1568786919535,
			"files": "[]"
		},
		{
			"id": "1f1d43dd-ec14-437b-95a5-968535164e29",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "95f347b8-3d41-401a-b875-f700eabe4f3c",
			"body": ">>6e023044-ffef-4251-b7a8-dfe5d75d78ea\nYou stupid nigger, if you reading comprehension isn't your strong suit you shouldn't be part of any argument involving freedom of speech. Once child porn is created, nobody else is being harmed by it. That's why your precious nippon didn't make distributing and looking at it illegal until the late 90s and 2014 respectively, after the West pressured it for decades.\nIf looking at a recording of real world harm causes more harm, graphic war or terrorist footage would be banned under the same principle. By extension, it's like saying loli artists who have made drawings referencing or recreating cp they watched perpetuate the harm of the original crime.\nA jpg file depicting real sexual child abuse is exactly has harmful as a jpg file depicting fictional sexual child abuse. They're bits. \nNext you'll probably start arguing that pedos looking at cp will crave to rape a kid, which was the main argument for politicians to ban possession and distribution of cp in the... whenever it was. But no, hypocrisy isn't important in this discussion at all, now is it? Slippery slope for thee but not for me. \n\nIf cp is on the blacklist, lolishota should be too. Stories included.",
			"time": 1568820702100,
			"files": "[]"
		},
		{
			"id": "57bcfbb5-a6cb-4c31-91e7-dfa92bda2222",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "142d5f87-51af-43c5-9051-5557af73e683",
			"body": "He always had very out there opinions about pedophilia. This one mail was just the latest example. It just few under the radar all those years because fsf didn't interact much with the mainstream.\n\nCan't expect a nuanced opinion about pedo stuff to be tolerated. I think Stallman knew that.",
			"time": 1569101673299,
			"files": "[]"
		},
		{
			"id": "9fec0878-d80c-4909-867b-979b8f8b6037",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1bca06d9-bc79-4527-96a1-2ef0c0c6a391",
			"body": ">>a5a3259b-c736-4374-ae3c-cfd504f3ec93\n>they dont care about cp\nThey never did, but they made it illegal and a normie boogieman in order to be able to shut down anything if need be. If they care about pixels showing kids getting hurt they'd ban war footage.",
			"time": 1569158038235,
			"files": "[]"
		},
		{
			"id": "a62b79e5-4675-4a5a-b06f-51cd9034aa4e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "af01dafe-0659-4c64-bc27-5e243d74b6d0",
			"body": "I wonder if you can condense that meme further and still retain the same effect.\nInstead of 'Islam is right about *', why not just spread 'Islam is right'. That encapsulates any subject matter a normie could possible imagine. Islam is right about pork. Islam is right about sex. Islam is right about alcohol.\n\nThough, I can see how spelling out these subjects makes for a bit of a bigger impact.",
			"time": 1569246501470,
			"files": "[]"
		},
		{
			"id": "9de47a6e-c3c8-4aa2-842e-0c7c0252d28a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "95f347b8-3d41-401a-b875-f700eabe4f3c",
			"body": ">>15ec876f-bb56-4273-a303-7e11b56ab104\nloli is just another word for fictional child porn, just like lolicon(the identity) is a euphemism for pedophile used by pedos in the West to sidestep the stigma. Funnily enough, Japan doesn't make any difference between those terms and uses them interchangeably. \nI'd call it fictional child porn, which is a clear descriptor to non pedos and also includes media of sexualized boys.",
			"time": 1569268683570,
			"files": "[]"
		},
		{
			"id": "08a4e9ed-83f1-430f-bcab-5359f7905309",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>f7f3bdf2-e8fd-4ce1-97e0-b7541a65af36\nHe's probably going to have a heart attack when he finds out all the major search engines, including the likes of ddg, now purge results for loli, sfw or otherwise. Not just blacklist, actually removing results.",
			"time": 1569364616200,
			"files": "[]"
		},
		{
			"id": "2b42d466-96d1-4b04-b519-00f658cf6c95",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5311feb9-80b8-482c-b2b1-37d87e1bc224",
			"body": ">>f1e417a6-a9ab-4b32-a651-1b71beb467c2\n>assuming I do",
			"time": 1569398399591,
			"files": "[{\"name\":\"1284700626109.jpg\",\"thumb\":\"daf9279af54d81be17133a723800770b5a4d569e-thumb.jpg\",\"size\":23539,\"type\":\"image/jpeg\",\"original\":\"daf9279af54d81be17133a723800770b5a4d569e.jpg\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "e872a54c-483f-4389-babf-965388f25ef1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "95f347b8-3d41-401a-b875-f700eabe4f3c",
			"body": ">>eb8c2aea-3fd6-4577-a499-bf090c5825ca\nHave you got any idea what's going on in Japan for the last 30 or so years?\nUp until the 90s, distribution and possession of CP was perfectly legal in Japan, and the only reason they eventually banned distribution in the 90s was because of the UN constantly pressuring them to do so along with many major Western countries. Until 2014 possession of CP was still legal in Japan, but again, the decade long pressure coming from the UN to ban anything involving child sexualization had them give in. 2006 and 2010 were other big push years for the UN, driven by incidents like rapelay and britney spears unknowingly cosplaying as a loli from a hentai manga. Risque child modeling that dance the line, and junior idol stuff are still a thing there, proving that the concept of pedophilia doesn't only have purely negative connotations in that culture. \nSince Japan has been culturally isolated and xenophobic for a long time some of their cultural values have been literally stuck at a place where the West was in the 60s. Sexually positive, but with that sense of privacy still intact. They never had a sexual revolution, or feminism, which was a large driving force in the west to ban child porn based on feefees and 'muh slippery slope'. Going forward, you will see Japan slowly enact the same moral standards that have been enshrined in the West for decades. It's not going to happen tomorrow, but there is no stopping it. Sexualizing childhood is still a big part of Japanese culture(for better or worse) and changing that requires people with the wrong mindset to die off and be replaced with a more enlightened peoplekind.\n\n>>25b4d638-fa3e-4411-82cd-e2f4f5bed119\nLoli is generally understood to be fictional child porn. A drawing of a 1000yo vampire in the form of a child fucking is still fictional child porn.",
			"time": 1569428033697,
			"files": "[]"
		},
		{
			"id": "18a46632-c980-474f-be84-62d17efc836d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4dedafae-793a-42dc-a493-fb2287fb2b1a",
			"body": ">>c495693a-ffde-495d-a55f-fb06b21198e2\nIt allows loli on /b/, that's why. Bing and Goggle had ramped up their purge of it when the UN declared it to be illegal in their eyes. DDG is just scraping anyway, so it's not like they actively censor. Use Yacy if you want a currently uncensored search engine, but be aware. It's not open source and run by Germans, which are notorious for spearheading online censorship. Then again, mastodon was also created by a kraut and has done good in terms of decentralizing people, but that's probably because it's open source. They too tried to ban loli in '17 IIRC, when japs made their own instance, but ended up not.",
			"time": 1569615886936,
			"files": "[]"
		},
		{
			"id": "463f48a7-70ce-42e7-9b1e-9f96a84442d0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "2e4c0ec8-a527-4199-9264-b7f30372aa68",
			"body": "No, it's not. 8chan's new name is 8kun and is not up yet.",
			"time": 1570648983288,
			"files": "[]"
		},
		{
			"id": "7298a7a3-60d5-42ca-8c21-5357913a7456",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "7536837e-2540-4780-9c6c-abf202c9435f",
			"body": "There are a couple of decentralized ones, but I haven't found any projects that arent proprietary and at least somewhat popular.",
			"time": 1571229928609,
			"files": "[]"
		},
		{
			"id": "20156b05-7411-4751-8bf8-7e03bd5ac8b8",
			"directory": "users/15agjuqYqSm75SoYXmXMNfBCTeVgXJkaMJ",
			"uri": "loli",
			"thread": "adc17008-353f-42a6-b1c3-5b12bf678682",
			"body": ">>b1706a0d-dccc-45b8-babe-21b12aea61cd\nYou'd need to write a how to access these databases for tech illiterates first, though.",
			"time": 1571491380766,
			"files": "[]"
		},
		{
			"id": "d507c947-8f23-4279-96dd-105bb6de17dd",
			"directory": "users/15agjuqYqSm75SoYXmXMNfBCTeVgXJkaMJ",
			"uri": "loli",
			"thread": "adc17008-353f-42a6-b1c3-5b12bf678682",
			"body": ">>b53cf541-067c-4b5b-b027-ada79b1a2c3e\nHuh, 1+ doesn't give me any results on its own. I had to access the other hubs first to get their results.",
			"time": 1571533226905,
			"files": "[]"
		},
		{
			"id": "2dd763f9-8acf-44ce-8aed-d6f093fc17d0",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "1120501a-1959-4a7d-8650-ff5a5fc8c70d",
			"body": "I like how when you bring up zeronet it often also leads to the discussion about cp, the main reason why it's been turned into this information boogeyman you can then redpill people about.",
			"time": 1571695223100,
			"files": "[]"
		},
		{
			"id": "971acbe4-1ce8-4611-9e70-39d4fa3833a2",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"body": "I just realized I haven't seen an instant messenger type site on zero. Sure, there's twitter clones and chat rooms, but is there something centered around DMs?",
			"time": 1571952118115,
			"files": "[]"
		},
		{
			"id": "423edb3c-2a60-4dbd-a40c-7d3c84962954",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>e8e68c36-2f0e-4570-a1f0-16e31667e91b\nSpeaking of Germany, didn't they pull a New Zealand a few days ago and threaten to prosecute citizens for sharing a video of a beheading that took place somewhere over there? Anyone got that vid?",
			"time": 1572472323957,
			"files": "[]"
		},
		{
			"id": "36eebfb4-c619-4afb-bd96-8e439c14f191",
			"directory": "users/1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W",
			"uri": "voat",
			"thread": "3f823d14-b661-4bea-b103-5105a9d34144",
			"body": ">>52d21fd2-2814-4672-9d23-51330820d9e0\nThat's the point though. You technically are, that's why the possession and distribution has been made illegal in the first place. Well, it's used like this anyway, the reason it was banned was another at the time. It's an easy way to shut down any medium under the guise of child protection, not that anyone here doesn't already know this. \nSeeing a thumb of a cp image isn't going to land you in jail, though, unless you are a threat to people above you.",
			"time": 1574009960402,
			"files": "[]"
		},
		{
			"id": "b70f2b62-03fd-4c1c-ab65-1c0e9be2b858",
			"directory": "users/1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W",
			"uri": "voat",
			"thread": "3f823d14-b661-4bea-b103-5105a9d34144",
			"body": ">>4fa9f3f6-e497-4022-86e4-d5631f458b27\nSorry about that. What I meant was what >>50185eb4-523f-4b28-b283-6491d016aec7 said, basically, but I also wanted to highlight the fact that CP has been demonized this hard and made illegal precisely because it gives the government a permanent foot in the door of any IT. Terrorist content is similar, though you have a more people defending that, and organized crime. Basically, the horsemen of the infocalypse.\n\nhttps://en.wikipedia.org/wiki/Four_Horsemen_of_the_Infocalypse",
			"time": 1574331706639,
			"files": "[]"
		},
		{
			"id": "bccaa268-228b-4bbf-840f-b6c6041ce496",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "c441556c-b5f7-4c2f-a04f-4825247720b3",
			"body": "I'm probably not getting back into Digimon until Konaka's Tamers sequel is announced. TOEI has the treatment already, so all I can do is wait.\nDigimon games, apart from some of the fighting game ones, have always struck me as very power creepy and linear, so I mostly played them for the story, anyway.",
			"time": 1574864469405,
			"files": "[]"
		},
		{
			"id": "3e429204-0e0d-4aa3-b003-d1686d93f73a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": "I havent looked into Distributed DNS services in a while, but last time I checked there werent any projects out there that a community could use to propagate DNS information. Maybe that has changed.",
			"time": 1575466163194,
			"files": "[]"
		},
		{
			"id": "c7e1546d-4a04-4355-b869-ce24a4484e61",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "b035e8d8-8751-45db-ad08-2a793b90c8eb",
			"body": "Two things supersede freedom of expression in the German constitution. The right of any one individual's dignity, and youth protection. \nSo basically, there is no real freedom of speech, since the limiting amendments are so broad that they can encompass almost anything at any time. It's literally \"Feefees\" and \"muh chillunz!\".",
			"time": 1577069389946,
			"files": "[]"
		},
		{
			"id": "3f81bca0-a64d-45b5-b542-000afb5d5e21",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": ">>819a78df-7609-4a5f-ac9d-4e16e8a9a42c\nI never stopped coming here. I just lurk cause I don't have shit to post.",
			"time": 1586689859490,
			"files": "[]"
		},
		{
			"id": "205cf3c7-df3e-405d-b33c-25031d268449",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>d5d21244-c559-4b8f-adbb-cabf42fe2fee\nWell, the way I see it is that /pol/ alone can survive on clear boards. It's loli that is getting every company to pull out. You can \"explain away\" what people perceive as racism with \"it's being misconstrued, it's political speech\" People have a much higher opinion of a kind of speech that they feel could influence society. \nIn the public mind porn on its own possesses no value to protected. Add to chat porn featuring children or depictions of such, and people's desire to defend it as speech, accept it, or even tolerate it goes out the window. \n\nPeople are creatures of habit, and if the inconvenience of not being able to post one kind of content, which in case of /v/ or /a/ culture is ancillary to the main content, they'll eventually accept the censorship and just deal with it. \nNow, if loli would be purged from literally everywhere on the net you'd have enough of an interest group creating momentum that can breathe live into a dead darknet site. Even then, though. Lots of loli artists aren't exclusive loli artists, and I bet that before a significant number of them go through the trouble of getting on the darknet, they'd just cease drawing flat, at least publicly.",
			"time": 1588164259717,
			"files": "[]"
		},
		{
			"id": "825ba655-60b1-4b9e-bed4-8b365f7cfdc7",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>4b9da910-1412-41e9-82b7-8c1b4b844064\nI'm saying that if you had two boards on two different servers, one /pol/ and one /loli/, /loli/ has a higher chance of going down first.\nIn the current case, it's one person who keeps complaining about registrars and hosts about both of these to strengthen their case, so you can't be sure, but from what I've seen posted by the owners of the bunkers loli is being pointed to as the back breaking straw more often, especially by the registrars. \n\nAlso, the daily stormer was only deplatformed a few years ago, while loli sites(or hentai sites hosting loli) had to deal with hosts and registrars pulling out since... well, for ever. It only picked up after social media started to explore in the late 2000s and has been accelerating ever since.",
			"time": 1588165102517,
			"files": "[]"
		},
		{
			"id": "7958beb1-3f5a-49ed-b1e5-f392da9aad4d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "efe98d98-f9ef-4665-93b3-4ea1821267b6",
			"body": "Always",
			"time": 1588167890875,
			"files": "[]"
		},
		{
			"id": "d37f32cc-c361-43b2-af3b-7fa67de768a5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "efe98d98-f9ef-4665-93b3-4ea1821267b6",
			"body": ">>c2df8aff-4283-420e-b14a-42f1a672d885\nCP laws doing their job.",
			"time": 1588199931641,
			"files": "[]"
		},
		{
			"id": "d7687e2e-7e1b-4bfc-ad36-42dc0064c255",
			"directory": "users/1GspYx9SbmgteWEQ8JqECSJJ7i6kbc5Yn7",
			"uri": "strek",
			"thread": "cb414dc0-010a-4ac7-b176-ded1a61cb4c4",
			"body": "Anyone got some self sealing stem bolts? \nAsking for a friend.",
			"time": 1588242229505,
			"files": "[]"
		},
		{
			"id": "d423123f-dc8f-452a-960c-ed0fc34738e9",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>1d5dc791-12d0-491c-93fd-aed73ff115bb\nHilarious to remember that voat, a then self proclaimed free speech alternative to reddit, had their servers in Germany at first, and when reddit started to ban pedo and hatespeech stuff in 2014/15 they got flooded with people posting that on their, forcing them to move.",
			"time": 1588258769940,
			"files": "[]"
		},
		{
			"id": "49e1da56-b639-4123-98ba-749333a0f092",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "5be9d853-37c3-43d9-82ed-1eeb4611847e",
			"time": 1588258829140,
			"files": "[{\"name\":\"degenewates.webm\",\"thumb\":\"63392e3285f0976c166636529f3618e73e44ee08-thumb.jpg\",\"size\":378251,\"type\":\"video/webm\",\"original\":\"63392e3285f0976c166636529f3618e73e44ee08.webm\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "22ffaa12-1e5d-4f70-9db1-0ef262322906",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>97aa77ad-5ee3-4855-83f6-b445cd3541c9\nI know very little about that. Back when Cripplekike was still in charge of 8chan he was looking into hosting from Kazakhstan, cause apparently they didn't have any laws against cp. That might have changed since then or he was talking shit, I dunno. Moldavia is another country I heard being thrown around.",
			"time": 1588261401042,
			"files": "[]"
		},
		{
			"id": "ea48a01f-d229-4f3d-8438-1adb90dee789",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"thread": "58d26be9-2906-4381-84f3-2590044cd9c1",
			"body": "You're good.",
			"time": 1588274026645,
			"files": "[]"
		},
		{
			"id": "fbc843d4-7658-4a4b-8ef3-2bed11437a7c",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>ce9c8728-4473-4b35-a3c7-e53bf475fdcf\nPeople tend to either forget about it, or don't even consider anything that requires installing additional software. Notice how he omitted mentioning that some of those board have onion access. \n\nAlso\n>complaining about loli being censored on a site that did it half a decade ago. \nHeh.",
			"time": 1588345836789,
			"files": "[{\"name\":\"scrombled.jpg\",\"thumb\":\"dd120eae146a6e1350cbed2cb994e4457a2cf3e2-thumb.jpg\",\"size\":60168,\"type\":\"image/jpeg\",\"original\":\"dd120eae146a6e1350cbed2cb994e4457a2cf3e2.jpg\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "2b618a47-0040-49de-acd0-4467913c85ac",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6e78c350-8ca0-449b-a81a-5d3eaa5a0192",
			"time": 1588981215125,
			"files": "[{\"name\":\"838a97d4abad7bb0209e2f48a260441c-videomp4.mp4\",\"thumb\":\"7359703fe1da5d631e1fc87f85596d605d827373-thumb.jpg\",\"size\":4302883,\"type\":\"video/mp4\",\"original\":\"7359703fe1da5d631e1fc87f85596d605d827373.mp4\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "2fb5ad8d-bd70-48df-9dc5-86450b1cc98f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6e78c350-8ca0-449b-a81a-5d3eaa5a0192",
			"body": ">>fd494962-0a66-4f83-86e2-a580af13888d\nCan you even get more than one cert? Do you have to manually move cert files and restart ZN to do so?",
			"time": 1589591811043,
			"files": "[]"
		},
		{
			"id": "93f2a15b-940d-4e52-abc7-516d61760844",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "6e78c350-8ca0-449b-a81a-5d3eaa5a0192",
			"body": ">>ecf68806-e367-4cfc-9db7-a35dd76027a2\nI know how to change IDs. I just cant create or change mine when I'm on zeroID. It locks me in to the current one here, which is why I was asking if you have to cheese it.",
			"time": 1589674110288,
			"files": "[]"
		},
		{
			"id": "aa0f7ca1-d577-47bc-8853-3dc1ddda6303",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "9ba27438-fe1b-498e-813b-8197307cbea9",
			"body": ">>b8d791f6-bfa7-4c8a-8d32-d8c9576ae201\nI was trying to come up a filter that would work on a trust based whitelist mode that would kick in when the site detects a spam wave(or if the user triggers it manually), but I havent quite worked the kinks out yet. No, I cant code for shit, but was just thinking about a solution that wouldn't require sacrificing anonymity.",
			"time": 1591493299500,
			"files": "[]"
		},
		{
			"id": "8f516d60-6a19-4cc8-bb8b-92306c92160b",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"thread": "121a685c-4360-414e-b18c-82c773b46c7b",
			"body": "works",
			"time": 1595272041991,
			"files": "[]"
		},
		{
			"id": "c9bd862b-c065-49d6-8384-240f9bf6aaee",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "a530d087-0ed3-408b-8f20-476cf507ab7c",
			"body": ">>f58daa80-16ce-474d-8333-ac19be367f28\nAny tech based on security and privacy is decried as honeypot.",
			"time": 1597186508522,
			"files": "[]"
		},
		{
			"id": "1c391c86-d36c-43ba-b110-44edb3e581a8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "da2b8b9d-f8f5-4ba2-ab88-d5d30d9de5bb",
			"body": ">>3ac69d0b-49fa-4d24-82c6-4fd45d830ce8\nAre you running on an HDD? That's one bottleneck.",
			"time": 1604148199672,
			"files": "[]"
		},
		{
			"id": "b7c448cc-4b94-43a1-9bbc-df9e1f17a33a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "d71c2202-a55e-4550-af8b-63f3ceec03bd",
			"body": ">>506326ee-a47a-442b-99e8-89bb71000e2e\nYes, people are here, and we can see you.",
			"time": 1605108581797,
			"files": "[]"
		},
		{
			"id": "2dd28caf-7970-4988-9c15-9bda1073f732",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "272ef67d-0ef4-4a9d-8249-e0becf7b323c",
			"body": ">>272ef67d-0ef4-4a9d-8249-e0becf7b323c\n>has anything the government or media claimed proved true\nGell Mann Amnesia takes care of any widespread distrust against the entire MSM complex, because people are prone to compartmentalize their doubts against presumed authorities when they talk about issues the people aren't personally familiar with. \n\nYou write some hit piece about a small group of people few are familiar with and might even have preconceived notions about, and it'll almost always land, regardless of whether every single consumer of said report has just watched or read something in the same publication that they know is false.",
			"time": 1608030891200,
			"files": "[]"
		},
		{
			"id": "7acd42aa-0e09-4bbf-b66d-9eeb6182fec7",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "c2c76494-2321-41dc-b88c-04568b92b864",
			"body": "Yeah, I don't get why people don't stick their heads together to develop a new standard for TCP, one that has encryption out of the gate. \nAll these projects with their buy in and low reach seem like get rich quick schemes by a couple of coders.",
			"time": 1609186428929,
			"files": "[]"
		},
		{
			"id": "33db3159-82cc-43d7-b157-99f460cd4a2a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "83f2cfdd-26e1-4030-a87b-1d34fc9d1375",
			"body": ">>2d73dd81-2039-408b-bdca-f602d98dd125\nIn some countries(EU specifically) its actually pretty damn hard to buy crpyto anonymously. You'd have to engage in money laundering to do that, cause new banking regulations demand pretty much all crypto sites to request legal ID documents for user validation. That law has passed last year or the year before that, I can't remember.",
			"time": 1610318823548,
			"files": "[]"
		},
		{
			"id": "39847fc9-9172-4142-a49c-5375dfc905fc",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"thread": "ad180d0b-653d-4042-b68a-6dc0df39d96b",
			"body": "maybe",
			"time": 1610753280830,
			"files": "[]"
		},
		{
			"id": "d8412e71-fd6a-4eee-aaa8-510b31e1679e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "39233f08-a69d-4ed2-bd90-d2f6cea21023",
			"body": ">>89c0bbde-dbaf-4bd8-9034-176dccf89fc2",
			"time": 1611891783650,
			"files": "[{\"name\":\"dc67eb25ac1a2b43e50469163faa10e7d784cced918ef79519645822751ddf14.png\",\"thumb\":\"e7a6fb55db7550342f67359461d6d7189e4a2b90-thumb.png\",\"size\":1689185,\"type\":\"image/png\",\"original\":\"e7a6fb55db7550342f67359461d6d7189e4a2b90.png\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		},
		{
			"id": "bcd18804-ee75-4dce-be21-3c72082dc89a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d16a0324-1918-435c-b3f4-817ebfe7ed56",
			"body": ">>f5fc3725-38ec-4671-bd85-885a400335bf\n>I've always been dismissive of these 911 \"truthers\". Now not so sure.\nWell...",
			"time": 1629748166741,
			"files": "[{\"name\":\"videoplayback.webm\",\"thumb\":\"0a4e7c8f1fa85ff9ef18ee3b64a0a158179811b4-thumb.jpg\",\"size\":6433251,\"type\":\"video/webm\",\"original\":\"0a4e7c8f1fa85ff9ef18ee3b64a0a158179811b4.webm\",\"directory\":\"13L8Wdtucfmopfw5jDrSekdz2snq47PSHz\"}]"
		}
	],
	"boards": [],
	"modlogs": []
}