{"cert_user_id": "naab@github", "next_comment_id": 3, "comment": {"1604064927_mirrored_ghost_github": [{"comment_id": 1, "body": "The technical issue with the \"expires after some amount of time\", is that a User able to delete the pad (the guy who created it, or maybe a set of persons) NEEDS to access the website some way, in order to publish the deletion to the network (after the time is elapsed).\nYou may authorize a group of persons to moderate (ie: able to delete files automatically), but you have to trust these guys. Or code a bot with admin rights doing the job.\n\nTo resume, it's not that easy to have an auto-deletion mechanism in a p2p system. \n\n(some will say that the least access content will disappear after some time in p2p, but that would be true if zeronet wasn't trying to download the whole site all day long. Because of this, all the unused content is still spread out.)\n\nThe solution may be a configurable TTL (time to live) or even a TSLV (time since last visit(or|ed) ?) for site files, so it can be handled by zeronet in the communication protocol right away. (which is not the case now).\n\nI want to open an improvement ticket about this.\n", "added": 1446477518, "modified": 1446478075, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/158#issuecomment-153112492", "source_type": "github"}, {"comment_id": 2, "body": "Edit : It's not possible to change the file sharing policy, \nbut you can set \"Optional files\" :\nIssue https://github.com/HelloZeroNet/ZeroNet/issues/163\n", "added": 1446479330, "modified": 1446484254, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/158#issuecomment-153122042", "source_type": "github"}]}, "next_topic_id": 2, "topic": [{"topic_id": 1604064992, "title": "Media referrer error...", "body": "Mistake...\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1446203505, "modified": 1446337624, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/211", "source_type": "github"}]}