{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "слабость и глупость бессменного лидера, привыкшего вуалировать мыслительную дейтельность манипуляциями привели очередного марионетку, близкого духовно вождю.. он имеет необходимые качества, жадность, расчетливость, садизм.. убийства - лишь одна из граней преданного до поры марионетки. Люди устали от войны, но эти весы единственный стоящий для них эталон.. ",
			"post_id": 4,
			"date_added": 1604522374
		},
		{
			"comment_id": 2,
			"body": "> [mokshanets](#comment_2_1GKrQRHFPjcCknywDMpF5wAycE3gTBiDZP): В 1998 году Чечено-Ингушскую республику начали называть республика Ингушетия. Укры-националисты - республика Ичкерия. И это одна и та же территория.\n\nвы это где прочли, позвольте узнать?",
			"post_id": 4,
			"date_added": 1604522444
		},
		{
			"comment_id": 3,
			"body": "> [deliriumgoddess6](#comment_1_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): Если бы не бабло, которое мы платим из своих карманов, эти нахлебники и террористы никогда бы не подчинились.\n\nэти, как вы сказали \"нахлебники\" уважают только силу и подчинится они готовы любому, кто их научит нагибать.. этот бог и есть суть их религии, как бы ее не называли.. сегодня это Ислам и именно ее последователи сеят огонь и страдания на сегодняшний день во всем мире. Мало образованные, ищущие бога и поучаемые алчными наставниками во имя Бога готовы на все.. веруя в ложь и творя страдания.",
			"post_id": 4,
			"date_added": 1604522750
		},
		{
			"comment_id": 4,
			"body": "> [gsdth](#comment_1_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW): закидали хочеков баблом те и успокоились а иначе хуй бы нам а не победа до сех пор бы еблись\n\nполитическая воля - единственный критерий и мера интесивности в достижении цели.\nПри работе по Крыму воля очевидна и результат ясен. После первых часов начала операции в Крыму не было других возможностей, кроме как уверенность в конечности намерения и невозможности повернуть вспять. Такая же ситуация была бы и с Чечней, после демонстрации силы - Чечня бы со слезами на глазах легла бы к ногам победителя.. и не стоит слушать фантазии обратного. Сегодня наместник центра \"лидер\" с известной фамилией творит беспредел по всей территории.. но никто ему и слова не скажет - пока есть поддержка и допущение его значимости.. пока не скажет лишнее слово.. и появится новый лидер.. а старого спустят в сортир истории.",
			"post_id": 4,
			"date_added": 1604523150
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}