{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "> [jager](#comment_12_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Antifa had a network? Where are researchers analyzing the data?\n\nI always wondered where this mysterious \"Antifa Network\" was... Not even on most the socialists or anarchists boards... Sophisticated terrorists to be sure. I guess all through Signal? Gimme a break. \n\nThank all the people at Archive Team that took the time and computer power to task pulling down Parler before it was shut down.",
				"added": 1610575761
			},
			{
				"comment_id": 4,
				"body": "> [deuxzaron](#comment_47_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Parler was a honeypot. Anyone who was dumb enough to use it gets what they deserve\n\nassume everything is a honeypot. Thats classic cybersecurity. Value privacy through anonmyity. No verifying phone numbers or a gmail (that knows EVERYTHING about you, if you use it).",
				"added": 1610642455
			},
			{
				"comment_id": 5,
				"body": "> [grouch0](#comment_12_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): Maybe this will give you a clue about how they organise https://www.millennialmillie.com/?wix-vod-video-id=a4ba9026c185447d96c6af6c1581e029&wix-vod-comp-id=comp-jx9p57yh Zoom seems to be their preferred communication system. You can watch them discuss tactics in that documentary.\n\ninteresting. thanks for the link, ill check it out. Do you feel a purposeful leeway granted via chinese run tech COs for socialist leaning organizations?",
				"added": 1610642555
			},
			{
				"comment_id": 7,
				"body": "> [grouch0](#comment_16_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt): It's a good video because it gives an insight into the world of the extremists directly from their own mouths. Slam dunk. [...]\n\nwhether a \"\"\"\"patriot (TM)\"\"\"\" or a \"\"\"revolutionary (TM)\"\"\" it is deeply ironic to be using a foreign country's tech infrastructure (with help from gov and silicon valley \"\"\"\"Traitors (TM)\"\"\"). I guess the original US colonies used british infrastructure? Jews used Nazi infrastructure?\n\nI settle for stuff that I can see the inner workings of. Or stuff thats obviously made with individuals rather than \"\"\"organizations,\"\"\"\" institutions, corporations, governments.",
				"added": 1610645459
			}
		],
		"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "If you have to choose a side... far left, far right, which would you choose?\n\nThat time may be coming faster than you think. And dont forget-\n\n\"If you are neutral in situations of injustice, you have chosen the side of the oppressor. If an elephant has its foot on the tail of a mouse and you say that you are neutral, the mouse will not appreciate your neutrality.\"\n-Desmond Tutu",
				"added": 1610578510
			},
			{
				"comment_id": 3,
				"body": "Thats my point. We are headed for a fork in the road. In fact half (third if you drop independents) of the population is straddling either side of the crossroad. Its Hegelian back and forth between which group holds power, each time controlling new institutions or destroying those that cant be controlled. \n\nSoon we will have to choose a side. Socialism or corporate/gov \"\"\"private-public partnership (TM)\"\"\" in fact they are largely the same outcome just with different processes. One is rooted in the social theory of neo-liberalism/globalism and the other in the social theory of libertarianism, free-market, yah?",
				"added": 1610642356
			},
			{
				"comment_id": 8,
				"body": "> [jager](#comment_18_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Because the far-left is like...what exactly?\n\nis that rhetorical? There is much nuance right? I think \"\"true far left (TM)\"\" is rooted in anarchism and socialism. Its all about rights of individuals (counter-intuitive, eh?). When there is a power differential between workers and their employers it leads to the problems the great socialist thinkers like Marx, accurately commented on (IMO). \n\nI think the \"\"\"far left ModErn LiBeRAl/P R O G R E S S I V E (TM)\" is rooted in collectivism, central planning, Keynesian economics, MMT. \n\nI feel antifa is largely made up... kinda like the dreaded ISIS. Just a patchwork and really not much organization. Though I have some researching to do on that. I feel nancy pelosi, biden, etc are the modern liberal. AOC/bernie/yang are somewhere between. The true far left dont have modern celebrities just personalities. Kinda like the \"\"\"alt-right (TM)\"\"\" has.",
				"added": 1610650203
			},
			{
				"comment_id": 9,
				"body": "> [jager](#comment_20_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Antifa is largely made up? Right. It is pure coincidence that they show up at the same time/place, same clothes, same weapons, and coordinated tactics. Pay NO attention to the antifa subreddit or their Telegram groups. Totally made up. If that is made up, then basically every identitarian affiliation is made up. What would it take for you to acknowledge it as an organization? A membership card or pin or something? [...]\n\nBut do you believe antifa is a threat to... anything? They seem to me not unlike 'occupy.' Theyre largely university students. Its essentially a LARP, no? I mean Ive personally observed these people at protests. The media makes it look big and scary. But in Hegelion way they do they same to the \"\"\"\"\"InSUrrECTiOnistS (TM)\"\"\"\"\" \"armed militias at 50 CAPITALS REEEE.\"\n\nMarx and others got some things right when they predicted how capitalism would end- an ultra elite ownership class and the rest of the population who hopefully are able to work or earn capital. The idea of \"means of production\" has merit IMO. We dont need one person to own a global network or manufacturing company. Likewise we dont need one person to have so much capital that they could equally purchase a global network or manufacturing company. \n\nI find that most people in the real world, at least in my neighborhood are pretty normal folks. Its gotten a bit polarized (understatement) but there is certainly a spectrum with a healthy percentage of critical thinkers in the middle. Even the extremists I can find common ground on.",
				"added": 1610657525
			}
		],
		"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN": [
			{
				"comment_id": 6,
				"body": "Actually Zeronet has been around for quite some time. 2015 according to wiki. And its had its ups and its downs in terms of user activity. \n\nI think it comes down to a few things when comparing platforms:\n1) How is the platform built? Blockchain, open source, centralized servers (AWS), clearnet, app, phone number required for sign-up?\n2) How active is it?\n\nZeronet fits 1 very nicely IMO. for 2 its on the less active side. But compare to Gab which is hugely popular right now but barely functions (Andrew and team are doing a great job considering the sudden influx). Gab runs on private hardware. \n\nZeronet is good to pop in once and a while if youre not actively using zites beyond ZeroTalk. Either it becomes popular organically or someday we may find ourselves grateful if other sites are shut down and Zeronet remains an option.",
				"added": 1610643708
			}
		],
		"1610714469_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 10,
				"body": "Zerobadger dont care. Free and open is great and with enough diversity of thought can be very resilient. \n\nBut yea theres also mass hysteria and other social ills that can cause problems to structures so youre right. \n\nHopefully the \"political fever\" will just be part of the cycle. I remember not long ago complaining that people didnt discuss politics enough",
				"added": 1610740349
			}
		],
		"1610678665_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "I personally have a hard time knowing what to believe is happening in DC. Its either elite, undercover navy seals getting ready to arrest all the pedos or its globalists getting ready to change the government to a socialist satellite of china. \n\nHey I dont care which one, id just like to know ahead of time.",
				"added": 1610740883
			}
		],
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 12,
				"body": "This may be aside the point so apologizes in advance.\n\nAnyone else think, its vaccine and back to normal or no vaccine and new normal.\n\nBut not both plz. Whats the point of a vaccine if Im going to have a chance of feeling sick for a day or two from it- and i have to get it multiple times a year... And in the end I still have to distance and wear a mask because I could potentially spread it even with the vaccine?",
				"added": 1610743696
			}
		],
		"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 13,
				"body": "> [mxh69420](#comment_55_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): ive thought about gab but even twitter has less toxic politics. i applaude them for standing for free speech but i also want good enjoyable content, not another political mess.\n\nIt takes more work but you can filter out content you dont wish to view. Twetch is great for that because you can #trolltoll, every posts costs money. \n\n> [volkon](#comment_4_1DWYNPAmxeKc5Brcs1Yi6oyjndj53kPeLP): With all due respect, fuck GAB. It is still censored in some aspects. Let's bring people to Zeronet. I am going to donate bitcoin to new users and current users at random.\n\nHey, yea I like Zeronet alot. But admittedly Gab is way more active.",
				"added": 1610920051
			}
		]
	},
	"comment_vote": {
		"17_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt": 1,
		"24_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1
	}
}