{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1585821873_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): What is \"delete any post button\"? You can already delete others' posts if you're an admin of the ZeroTalk. To do this, you hover someone's post or comment, click the pencil at the left and then press \"Delete\" at the bottom.\n\nare you referring to Original ZeroTalk or Your's ? I cloned the original one not able to do that.",
				"added": 1586840836
			}
		],
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "Feature Req : Dont show topic title twice in topic details view.\nWhy do we have show topic title twice, even in mobile view below title text is clipped and hidden.\nZeroTalk++ (testing) › [ CHANGELOG: ZeroTalk++ forum engine ]",
				"added": 1598694641
			},
			{
				"comment_id": 3,
				"body": "Feature Req : Move Topic to Specific Group.",
				"added": 1598694837
			},
			{
				"comment_id": 4,
				"body": "Ui Factor : In Dark Mode, header_menu_links are hard to read with white bg. Instead use .theme-dark .topic .background-color for bg.",
				"added": 1598696161,
				"modified": 1598696622
			},
			{
				"comment_id": 5,
				"body": "Bug : When I Create a Group with Title and Description, and get back to home page without posting any topic in that group, that group is not visible any where to post topics. Possible solutions i can propose, while creating a topic show an option to user, weather he want to post it in list of groups available. also, small tweak while creating topic is, show clearly whether he is creating group or topic and allow only admin or super user to create new groups setting.",
				"added": 1598697420
			},
			{
				"comment_id": 6,
				"body": "[ Feature Request ] : post/comment time in peer's local time and date.\n\nSince we are all located all over the world, there should be a mechanism to show post author/commenter time. This may be configurable to be hidden via settings to reduce cluttering.",
				"added": 1635670717,
				"modified": 1635670804
			},
			{
				"comment_id": 7,
				"body": "> [geekless](#comment_66_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): I guess the wrong dbschema.json.\n\nWhoa! How do I forgot to change  `dbschema.json` , thanks for pointing out. Never think of this while watching db related errors in console.",
				"added": 1635687363
			}
		]
	},
	"comment_vote": {}
}