{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1578136145,
			"title": "EU Copyright Law and Directive 2001/29/EC",
			"body": "[TorrentFreak](http://127.0.0.1:43110/1JNqdTGVATFWRLzzYwVu19CuWYus5VmoUS/) (TF) ran a piece late last month titled \"EU Court: Unauthorized Sale of Used eBooks Infringes Copyright\" citing a court ruling which helps clarify a single instance where it may not be appropriate to resell e-books. What they don't mention, however, is there are plenty of exceptions to the rules afforded to EU Member States as defined in the [Information Society Directive](https://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX:32001L0029:EN:HTML). Of particular interest is the following:\n\n> (c) in respect of specific acts of reproduction made by publicly accessible libraries, educational establishments or museums, or by archives, which are not for direct or indirect economic or commercial advantage;\n\nWhen one speaks of archives we should think about not just libraries and museums, but the architecture and longevity of ZeroNet. ZeroNet's architecture promotes censorship resistance and is itself an archive run by a community of peers without direct or indirect commercial advantage. Therefore, reproductions of original works of authorship, whether used or new, ought to be fairly well covered under EU law.\n\nAside from just archival purposes, Information Society Directive also suggests matters of \"public security\", such as Edward Snowden's new book, for example, are also potentially exempt from copyright law.\n\nPlease keep your machines secure. All peers play an important role in the preservation and sustainability of the ZeroNet archives. Uptime and active seeding may help the cause to free information which might otherwise be or become censored or restricted to the general public.",
			"added": 1578136144
		},
		{
			"topic_id": 1578621187,
			"title": "Tor with WireGuard",
			"body": "When one uses [WireGuard](https://wireguard.com/) to connect to ZeroNet over Tor interesting things happen. As I understand it ISPs cannot detect the Tor usage as a result of the WireGuard stream cipers and VPN providers cannot profile browsing behavior as a result of Tor.",
			"added": 1578621185
		}
	],
	"topic_vote": {
		"1578136139_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"1578316607_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1578131377_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 1,
				"body": "Please keep glowposting to a minimum. Thanks.",
				"added": 1578132862
			}
		],
		"1578136139_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 2,
				"body": "OP refers to the video titled \"Kefrens - Guardian Dragon - Amiga Demo (50 FPS)\" published on Dec 14, 2014 with the following description provided: \"This is Guardian Dragon by King Kefrens - Released at Lowlife Party (Static Bytes & Light) 1991\". The video file is available for download via NewPipe in MPEG-4@720p60 format at 121.28MB filesize.",
				"added": 1578136853
			},
			{
				"comment_id": 7,
				"body": "> [yuurei](#comment_5_1Jp9ptjBVwCUGKUesEkSGGCwfdT1pqsgqz): \"Rolling Down The Street, In My Katamari\" by Fearofdarkhttps://youtu.be/hzGmbwS_Drs\n\nThanks for providing the title with this one. Could you also provide the title for the other? Reason being is the links you're dropping here are tracking links and we'd prefer ones like OP which may be found via search.",
				"added": 1578157571
			}
		],
		"1578136145_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": [
			{
				"comment_id": 3,
				"body": "> [anon05](#comment_25_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): If it becomes popular it'll be possible to ban it using statistical methods like Tor bridges are in China.\n\nLike you said, nothing scales until it scales. If meek bridges aren't enough, I imagine WireGuard hitting the 5.6 kernel may lead to some interesting developments with regard to approachable, self-hosted encryption technology.",
				"added": 1578141091
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_395_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): I have yet to see a museum or educational establishment carry the latest title of some fictional ebook or Hollywood flik. But besides that, I always found it ironic that users are not willing to even initial seed the mediocre garbage that they share.\n\nPerhaps those individuals are consuming low-quality material and, therefore, it's better lost anyway. When we look at Snowden versus Assange only one of them responsibly disclosed what they had. If it were up to the [Information Society Directive](https://eur-lex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX:32001L0029:EN:HTML), however, it seems both caches would be free of copyright even outside P2P archives like ZeroNet or GNUnet. The reason for that, as implied in the directive, is \"public security\".",
				"added": 1578153013
			}
		],
		"1578154157_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": [
			{
				"comment_id": 5,
				"body": "And depending on your lean towards free software may also be interested in [GNUnet](https://gnunet.org). Unfortunately I cannot lay down any claims as to which is \"better\". Each I'm sure has its merit.",
				"added": 1578154956
			},
			{
				"comment_id": 6,
				"body": "> [anon05](#comment_28_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP): Can you give me a QRD?\n\nNot ready for prime time yet. That was my knee-jerk reaction to what I saw when I last tried it a few months ago. I'm also not certain if it meets your \"uncensorable\" requirement. If you want uncensored the best way I know to achieve that is to encode it into the Bitcoin blockchain.",
				"added": 1578155174
			}
		],
		"1578270893_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 12,
				"body": "Not once. Still waiting for someone to offer premium content upgrades on their Zite. As for OC, they used to have Bitcoin support but killed it and haven't brought it back. I'm fairly confident corn will be here long after they're gone.",
				"added": 1578315103
			}
		],
		"1578316309_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 13,
				"body": "Size and popularity are not useful measures of what makes a good JavaScript. Not only does that site miss the mark on design, it's full of trackers. That site wasn't memorable three years ago. Today it's just a dumpster fire.",
				"added": 1578317919
			}
		],
		"1578303373_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [],
		"1578439030_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 16,
				"body": "There are adapters to use microSD both in an SD card slot as well as a USB type A slot. If you're making a purchase online, consider buying a converter as well to make the microSD card useful in more machines. In 2030 you'll be measuring in tebibytes (TiB) and purchasing nanoSD cards instead.",
				"added": 1578481433
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 17,
				"body": "> [lightingball](#comment_3_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK): Nuclear weapons on the way.\n\nNot likely. The strike on the bases is being considered a small retaliatory incident. Once the details of the 737 manifest are known, however, the shit may hit the fan. If you hear about an AC-130 in use by the US, start buying bottled water.",
				"added": 1578481727
			}
		],
		"1578603520_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 18,
				"body": "You might enjoy reading Albert Wenger's book titled \"World After Capital\". In the opening chapters Albert explains whatever is scarce becomes the sought after commodity. Once land then to capital, scarcity has now shifted to attention according to Wenger. The entire book [is available](http://worldaftercapital.org/) in hypertext.",
				"added": 1578617545
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 26,
				"body": "> [sfs9](#comment_13_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): The internet of the early days certainly was not able to compete with the PornHub. Nor are the \"anonets\", unless You are after child porn.\n\nPornHub is the MySpace of Web porn, PayPal just stopped working with them entirely a few weeks ago and models are going to start jumping to smaller platforms were they don't need to create backup accounts of backup accounts due to unreasonable censorship laws like SESTA/FOSTA. [The writing is on the wall](http://127.0.0.1:43110/big.kopykate.bit/?Video=1528375058_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz).",
				"added": 1578662667
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 23,
				"body": "Behind Russia is China, who's currently suiting Russia up with the 5G networks Trump has vowed the Americans will deliver to the world first. Of course we all know that's not going to happen. So what's unfolding now is just a dog and pony show as \"leaders\" vie to sway public opinion in an effort to control the narrative.\n\nIran may not have the military power of the US but they do have the uranium enrichment methods and the centrifuges necessary to produce clean energy cheaply. And that's a very threatening prospect to any oil-dependent hegemony.",
				"added": 1578624950
			}
		],
		"1578622553_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 25,
				"body": "> [thorburn](#comment_25_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): The bank pulls a fast one and fools the average person in to believing the bank lends them money, and then they start charging them compound interest on their own money.\n\nFiat fraud started in China between 960-1279 [according to](https://www.forbes.com/sites/johntamny/2017/09/17/jamie-dimon-is-right-that-bitcoin-is-a-fraud-but-doesnt-know-why/) the author of Gaining Currency.",
				"added": 1578630818
			}
		],
		"1578668599_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 27,
				"body": "Can I get a side of fries with those plebx?",
				"added": 1578668591
			}
		],
		"1578708027_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 28,
				"body": "In case... he turns into a zombie. Limber up.",
				"added": 1578710449
			}
		],
		"1578741461_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": []
	},
	"comment_vote": {
		"7_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"397_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"126_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"130_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"6_1Jp9ptjBVwCUGKUesEkSGGCwfdT1pqsgqz": 1,
		"1584_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"14_1KRJTDNcfHhogWdZRoMSkfS1FZoCCPvjer": 1,
		"1667_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"1672_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"8_152JLSuJAhrKabbvowpHjq5W6TzpxmYW3w": 1,
		"103_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"25_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"19_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"68_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"654_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1686_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}