{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "The FAQs for ZeroNet says that *\"Mutisig website are possible\"* - I haven't reached that level yet, but a helpful tool to create multisig addresses and use them is already available on ZeroNet: [/18rFcp1uAZfKfvy28h3C7scHSaPLMdDLio](Multisignature P2SH).",
			"post_id": 5,
			"date_added": 1457209942
		},
		{
			"comment_id": 2,
			"body": "> [muja](#comment_2_17i7Y7r8nTaCfLbCAuaKyc4R5BbKZYU2Hr): That's right. But to allow people to clone, you also need to add \"cloneable\": true, to your content.json file.\n\nBut even then it is still possible to just go to your data folder and clone it manually, right?",
			"post_id": 9,
			"date_added": 1457224246
		},
		{
			"comment_id": 3,
			"body": "> [erkan](#comment_1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf): Ethereum is written wrong (the \"i\" in etherium should be an e)\n\nThanks - I've updated the post with the correct spelling - and now it puts things into even better perspective.\n\nCheers @erkan",
			"post_id": 6,
			"date_added": 1457255160
		},
		{
			"comment_id": 4,
			"body": "> [angristan](#comment_1_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7): The number of peers depends of the client, for instance, PLAY is not the site with most peers for me\n\nYeap, still figuring all this out. ",
			"post_id": 15,
			"date_added": 1457269494
		},
		{
			"comment_id": 5,
			"body": "> [sniffles](#comment_1_13789EsAe2nGCsJkr14ZdRbAauLjiZ7yPM): So lock your PC when you are away and others are present?  Seems like basic security to me.\n\nBut even if you lock your PC but someone else is accessing it with a different user on the same system, they can navigate to `localhost:43110` and get your identity.\n\nBasic, but how's the old saying goes? Better safe than sorry ^^",
			"post_id": 19,
			"date_added": 1457379567
		},
		{
			"comment_id": 6,
			"body": "> [leia](#comment_1_1KhY25ByJEu3Bmyp7JB5RXFHgoshW2pqX6): wut\n\nSup ^^",
			"post_id": 28,
			"date_added": 1457443817
		},
		{
			"comment_id": 7,
			"body": "> [nullpo](#comment_1_16Szsy1UtjiXpEevWVdUDrNfNTAZ9PLbcY): Thanks for great explanation!\n> \n> Oother zerosites can accept the nanasi accounts with this appended to cert_signers in data/users/content.json etc.:\n> \"nanasi\": [ \"16PmAP6z2MCJX9jNjvMrteMfnqX4KeDRNT\" ],\n> if the site creator doesn't mind accounts without uniqueness guarantee, and proofs of work or IP filters that (non-bitmessage) ZeroID can potentially provide.\n> But I don't recommend to use Nanasi account for other sites since I'm still doing experiments like changing user name generation method.And I made this while thinking about per-site accounts, which can be a privacy enhancement (than current usage of one account for all sites).\n\nWoah! even better!\n\nThe developer can decide what kind of certificates are acceptable, and easily accept unique ones that solves a different problem.\n\nAlso, please share more of your experiments :)",
			"post_id": 29,
			"date_added": 1457546145
		},
		{
			"comment_id": 8,
			"body": "> [teddydd](#comment_2_1GNdkBSxTw6SpRdGHxDCyfANXnwi7FG7rJ): i suppose link should be http://127.0.0.1:43110/tanakh.bit\n\nI fixed it - I guess that not everyone has the [chrome extension](https://chrome.google.com/webstore/detail/zeronet-protocol/cpkpdcdljfbnepgfejplkhdnopniieop?hl=en)... :)",
			"post_id": 32,
			"date_added": 1457735082
		},
		{
			"comment_id": 9,
			"body": "> [nnnnnnnnn](#comment_1_1CDkheadGbhxVvNCHn2nvH7GBDnwm5V8oi): kill all jews! Heil Hitler !\n> 88! gas the kikes!\n\nHitler is dead - tried to kill 6 million jews, succeeded, and yet failed miserably at the end.\n\nYou can heil him all you want, but the facts remain :)",
			"post_id": 32,
			"date_added": 1458904641
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"12": 1
	}
}