{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1_1JGx6kKGTzjRrxDB9PPbJ4AcSPdY7UkQwb": [
			{
				"comment_id": 1,
				"body": "Salut Toutoune, je vais tester tout celà dès que j'aurais accordé plus d'espace disque très prochainement. Je suis encore en phase de test sur ZeroNet hébergé sur un RPI3 qui héberge lui même un noeud TOR Middle. Mon but étant de savoir si mon RPI tiendra le coup à la longue. Pour le moment oui :p\n\nMerci pour ton taff ;)",
				"added": 1506359576
			},
			{
				"comment_id": 2,
				"body": "> [padtrique](#comment_24_19imiBWm39vSNQpp9a4y3zwHyasYJsMDp2): Bonjour, Un conseil pour vos Raspberry Pi: installez le système sur un disque dur via Berryboot ou autre ;)\n\nSalut, pour quelle(s) raison(s) exactement ? Actuellement cela fonctionne très bien sur microSD ?!",
				"added": 1506443848
			},
			{
				"comment_id": 3,
				"body": "oki je vais étudier la chose dans ce cas merci bien ;)",
				"added": 1506444491
			},
			{
				"comment_id": 4,
				"body": "Je vais plutôt me contenter de modifier le fichier cmdline.txt et fstab, puis jouer avec dd pour l'image root ;-)",
				"added": 1506445426
			},
			{
				"comment_id": 5,
				"body": "Perso, je lance zeroNet dans un screen que je détache par la suite... Je n'ai pas réussit à le lancer en mode \"daemon\", j'ai bien essayé le paramètre --silent, mais ça fait planter le terminal et le clavier.\nSi tu parviens à le faire démarrer automatiquement et correctement en cas de coupure, je suis preneur!!! Car j'ai bien ajouter la ligne de commande dans /etc/rc.local, mais ZeroNet renvoie systématiquement toutes les sorties à l'écran!!",
				"added": 1507018339
			},
			{
				"comment_id": 6,
				"body": "Salut, c'est pourtant bien la commande que j'ai mis, mais ça me renvois systématiquement les sorties à l'écran et ce sans même être logué... Aussi je suis obligé de mettre un \"sleep\" (pas pour moi lol) d'une minute environ le temps que mon noeud TOR se lance correctement, puisque ZeroNet utilise ses circuits...\nDonc pour le moment je le lance manuellement...",
				"added": 1507649424
			},
			{
				"comment_id": 7,
				"body": "\"Demain tout commence\" échec téléchargement fichier 947...",
				"added": 1507653670
			}
		]
	},
	"comment_vote": {}
}