{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"3_1EbPbm1iWibJ41UUk5ENKNHrW7pVH9ui81": [
			{
				"comment_id": 1,
				"body": "> Вакцинировались?\n\nПока нет. \n\n> Заставили или добровольно?\n\nНа предприятие, сначала, прислали распоряжение \"огранизовать\" возможность вакцинироваться для желающих. С указанием адресов, где это можно сделать.\n\nПозже (примерно через пару месяцев) пришло ещё одно распоряжение о том, чтобы предоставить наверх списки тех, кто вакцинировался.\n\nПока, больше ни чего не присылали. Сидим, затаившись и ждём, что будет дальше.",
				"added": 1627993524
			},
			{
				"comment_id": 7,
				"body": "Цели вакцинаторов - 100%-я вакцинация населения. И достигаться эта цель будет ЛЮБОЙ ЦЕНОЙ. Но такой процент достигнуть невозможно. Т.к. значительная часть людей принципиально не будет вакцинироваться из-за опасных побочных эффектов. По-этому вакцинация будет \"добровольной\" только на словах. И рано или поздно станет, сначала принудительной, а потом - насильственной.",
				"added": 1628354342
			}
		],
		"1_15UbkF42UTPuFGbvHgeGMm2mFfnoYEqCZ3": [
			{
				"comment_id": 2,
				"body": "Люди хотят анонимности, потому что понимают, что в тоталитарном и неправовом государстве это единственный способ свободно высказывать свою точку зрения, отличную от точки зрения власти и, при этом, сохранить свободу.\n\nАнонимность - это хорошая, а иногда единственная защита от сетевых неадекватов и \"сильных врагов\"  - врагов, способных доставить вам неприятности, против которых вы беззащитны. Например бандитов, \"обидчивых\" чиновников, агрессивных инородцев, мошенников и т.п.\n\nАнонимность нужна инсайдеру, сообщающему журналистам опасный разоблачающий контент, за который ему могут свернуть шею.\n\nАнонимность нужна юзеру, публикующему в интернете \"чувствительный\" контент (на который могут \"обидеться\" гос. органы, инородческие диаспоры, уголовники и пр.). Чтобы обезопасить себя, разорвав связь между контентом и его автором/публикатором.\n\nАнонимность нужна человеку, учавствующему в голосовании и знающему, что если он проголосует \"не так, как надо\", то у него будут проблемы с начальством.\n\nАнонимность нужна девушке, которая знакомится с парнем, но пока не знает, насколько он честный и можно ли ему доверять. Чтобы случайно не нарваться на неадеквата или секс-маньяка, который потом будет её травить  или караулить в тёмном подъезде с бутылочкой кислоты.\n\nВообще, ситуаций, когда сетевому юзеру приходится \"шифроваться\", может быть довольно много.",
				"added": 1627995288
			}
		],
		"1_1Grp3EacbhzH7M3myvcRM6vy3PwPrFMY2u": [
			{
				"comment_id": 3,
				"body": "> На данный момент, есть не мало работоспособных примеров пиринговых mesh-сетей (i2p, Tor, ZeroNet и etc.)\n\nЯ бы не относил Tor к пиринговым сетям. Tor просто подделывает IP-адрес источника трафика и шифрует его по дороге. Представляя собой по сути 3, включённых последовательно, бесплатных VPN-а. Больше он фактически ни чего не делает.\n\n> Какие преимущества пользователь получает взамен?\n\nОсновное приемущество P2P технологий - это цензуро- и вандало- устойчивое, распределённое хранение контента. За счёт отсутствия серверов, которые можно вывести из строя. За это приходится расплачиваться удобством работы - низкой скоростью, необходимостью постоянно находиться онлайн (чтобы обеспечивать связанность юзеров внутри сети и доступность хранимых данных), а так же местом на жёстких дисках.\n\n> Конфедициальность передачи данных (I2P, Tor?, ZeroNet?)\n\nКонфиденциальность - это, несколько, отдельная тема. Которая обеспечивается использованием шифрования, как при передаче, так и при хранении данных. I2P и Tor шифруют данные только при передаче.\n\n> Анонимность при взаимодействии в сети (I2P, Tor?, ZeroNet?)\n\nАнонимность обеспечивается приведёнными выше I2P, Tor, путём подделки IP-адреса, а так же принятием других мер по разрыву связи между контентом и его автором/публикатором. ZeroNet, по умолчанию, не анонимна. Для обоспечения анонимности нужно использовать дополнительные инструменты. Например, те же I2P, Tor.\n\n> Свобода публикации своих собственных ресурсов (ZeroNet, I2P, Tor)\n\nДа.",
				"added": 1627997628
			}
		],
		"9_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 4,
				"body": "Чувствует нечисть, в чём их погибель :) Жаль только, что эти сети мало используются в России. А сейчас как раз для них наступает самое время.",
				"added": 1628004334
			}
		],
		"3_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 5,
				"body": "> Неужели есть ещё наивные люди кто думает что это всё шуточки ?\n\nНеужели вы думаете, что вас ЗДЕСЬ кто-то услышит? :) \n\nВсё, что вы тут написали, в целом, верно. Но учтите, что человек действует в соответствии с информацией, которой он обладает. Подавлающее число людей ни чего не знает, ни про цели глобалистов, не про заговоры, не про истинные цели вакцинаторов, ни про всё то, что знаете вы. Потому что, либо сидят в зомбоящике, либо сидят в интернете, но читают не те сайты.\n\nТипичная ошибка всех т.н. \"быдлофобов\" и \"овощефобов\" в том, что они ошибочно считают, что \"если я что-то узнал, то это тут же узнали и все остальные\". Что, на самом деле, совсем не так.\n\nВот тут Вадим из Майами этот психологический феномен хорошо описал:\n\nhttps://www.youtube.com/watch?v=zLOJDX8KFVc\n\nТак что нужно понять следующее. Если люди ведут себя не так, как вели бы вы в данной ситуации, то это значит, что они просто не знают того, что знаете вы.\n\nВсё, что остаётся делать в такой ситуации, это заниматься просвещением людей (в первую очередь - близких и знакомых) и предупреждать их об опасности.",
				"added": 1628012689
			}
		],
		"1_14EzDCmg4n3iqQqG3rGyuXrY6oatRuzu5U": [
			{
				"comment_id": 6,
				"body": "На данный момент, ситуация с вакцинацией от Covid складывается примерно такая:\n\nВсе вакцины от Covid оказались не такими \"безвредными\", какими их рекламировали. Они дают очень тяжёлые побочные эффекты, вплоть до инвалидности и смертельных случаев. Из-за этого огромное число людей боятся прививаться.\n\nТе жидкости в ампулах, которые называют \"вакцинами от Covid\", ВАКЦИНАМИ НЕ ЯВЛЯЮТСЯ. Это специальные смеси, которые не имеют ни какого отношения к \"лечению и профилактике\" чего-либо, в том числе и Covid. В состав этих смесей входят различные токсичные, ГМО- и прочие компоненты. Целью создателей вакцин от Covid является ИЗМЕНЕНИЕ ГЕНОКОДА ЧЕЛОВЕКА.\n\nНет принципиальной разницы между иностранными и \"российскими\" вакцинами. Все они хоть и имеют различия в составе, но мало отличаются по своим вредоносным свойствам. Т.н. \"российские\" вакцины фактически делаются по тем же технологиям, что и иностранные.\n\nПопав в организм человека, ГМО-вакцина наносит сильнейший удар по имунной системе. В результате чего здоровье человека начинает капитально рушиться. Наиболее характерное осложнение - обширный тромбоз вен. Это, в свою очередь, приводит к массе других осложнений, вплоть до отказа внутренних органов. Всё это приводит к инвалидности и смерти через короткий промежуток времени - от нескольких суток, до нескольких месяцев, в зависимости от изначального запаса здоровья.\n\nВся так называемая \"пандемия Covid\" с последующей за ней \"вакцинацией от Covid\" является заранее спланированной спецоперацией глобалистов, проводимой совместно с западными фарма-компаниями и ВОЗ с целью сокращения населения планеты и постановки под тотальный контроль оставшихся в живых. Таким образом \"пандемия Covid\" является биологической войной.\n\nСуществует своеобразная \"партия борьбы с Covid\" - совокупность глобальных (ВОЗ, Big Farma) и внутригосударственных сил, лоббирующих процесс проведения вакцинации от Covid во всех странах, в т.ч. и РФ. Их целью является не \"борьба с вирусом Covid\", не \"защита населения от вируса\", не \"забота о здоровье людей\", а обеспечение 100% вакцинации всего населения планеты ЛЮБОЙ ЦЕНОЙ.\n\nТ.к. при вакцинировании населения происходят тяжёлые побочные эффекты и смертельные случаи, то огласка этих фактов может привести к срыву процесса вакцинации. В связи с этим, вакцинаторам необходимо любой ценой, как можно быстрее, заколоть как можно большее количество людей, пока они массово не догадаются о том, что их не \"спасают от вируса\", а убивают вакцинами (биологическим оружием).\n\nВакцинаторы предпринимают колоссальные усилия для увеличения количества вакцинированных. Процесс вакцинации сопровождается мощной информационной компанией, выполняемой в соответствии с принципами военной \"геббельсовской\" пропаганды. Вся официальная медицинская Covid-статистика фальсифицируется. Выдумываются всё новые и новые \"штаммы\" вируса Covid, один \"ужаснее\" другого. Любая информация от независимых экспертов, врачей и учёных, подвергающих сомнению \"опасность вируса\", \"необходимость вакцинации\" и \"безопасность вакцин\", подвергается жёсткой цензуре.\n\nЧтобы заставить людей вакцинироваться, пропаганда старается запугать их огромными цифрами заболевших и умерших. Для этого всем заболевшим ставится диагноз \"коронавирус\", даже если он заболел гриппом, пневмонией, ОРВ или другим заболеванием со схожими симптомами. Каждая смерть от любого, похожего на Covid, заболевания, классифицируется как \"смерть от Covid\". Каждая смерть от вакцины так же классифицируется как \"смерть от Covid\". \n\nТак как информация об умерших от вакцины успела просочиться в информационное интернет-пространство, то в обществе уже успела образоваться многочисленная группа населения, которая твёрдо решила не прививаться ни в коем случае. Это поставило под угрозу план 100%-й вакцинации. По-этому вакцинаторы постепенно перешли от стимулирования добровольной вакцинации к принудительным мерам. Не желающих прививаться \"отказников\" постепенно начинают прессовать, оказывая на них психологическое и административное давление, включая угрозы увольнения с работы. \n\nДля привитых были введены QR-коды, отсутствие которых у непривитых лишает их доступа к тем социальным благам, которые раньше были свободно-доступны для всех. В скором времени ожидается запрет для непривитых на доступ в продуктовые магазины и транспорт, что поставит их на грань выживания. Такие жёсткие меры применяются для того, чтобы всеми возможными способами превратить жизнь непривитых в кошмар и заставить их прививаться.\n\nДо сих пор непонятна ситуация и с самим вирусом Covid - существует ли он в реальности или нет. По одним версиям вирус Covid является разновидностью из группы \"коронавирусов\", которые обычно вызывают сезонные заболевания, наподобии простуды, гриппа или ОРВ и имеющим невысокую смертность и опасность. По другим версиям вируса Covid вообще не существует, а веру в его существование искусственно поддерживают при помощи пропаганды и фейковой статистики. В пользу этой версии говорит тот факт, что вирус Covid до сих пор не был выделен в лабораторных условиях (!!!). А без выделения вируса невозможно создание вакцины от него (тогда что же людям колят под видом \"вакцины\"?).\n\nЗначительная часть населения, в основном, понимает или догадывается, что вирус Covid был создан искусственно, с целью ведения биологической войны. Но до сих пор очень мало кто понимает, что в этой войне УБИВАЕТ НЕ ВИРУС, А ВАКЦИНА ОТ НЕГО.\n\n========\n\nВ качестве дополнительной информации рекомендую внимательно прочитать статью:\n\nА.Михайлов - \"Глобальная перестройка: вместо капитализма - рабовладение\" (https://cont.ws/@skobarj/1999728), чтобы понять, какую роль играет вакцинация от Covid в планах глобалистов.\n\nВ статье \"Рецепт создания страшнейшей пандемии в истории человечества\" (http://redko-da-metko.ru/2021/07/23/rezept-sozdaniya-strashneyshey-pandemii/) описываются приёмы лжи и манипуляции, с помощью которых можно создать иллюзию существования эпидемии болезни, которой нет.\n\nОчень много оперативной новостной информации по Covid, а так же по текущей ситуации в Мире лучше искать в Telegram-каналах. Например в этих:\n\nhttps://t.me/zloyecolog    Злой эколог\nhttps://t.me/associationofdoctors    Независимая ассоциация врачей\nhttps://t.me/parfentiev_club    ПАРФЕНТЬЕВ.КЛУБ\nhttps://t.me/SecretInsiderZ    Секретный Инсайдер\nhttps://t.me/kriknews_official    KRIKNEWS\nhttps://t.me/net_prinuzhdeniyu    НЕТ ПРИНУЖДЕНИЮ!\nhttps://t.me/nastikatube    NASTIKA\nhttps://t.me/amara_elskaya    О тенденциях в мире\nhttps://t.me/tselnozor    ЦЕЛЬНОЗОР",
				"added": 1628278067
			}
		],
		"1_1Fb5iVeVmyT53woPjVQ4vc86oxYmN6sfTK": [
			{
				"comment_id": 8,
				"body": "В сегодняшнее время почти все \"массовые расстрелы\" в школах и других людных местах устраивают спецслужбы. Чтобы вызвать антиоружейную истерию в СМИ и обществе. И протолкнуть \"антиоружейные\" законы.\n\nА после того, как население будет разружено, с ним можно будет делать всё, что угодно.",
				"added": 1628358947
			}
		],
		"1_13RFu1n9Bc3vCg8vWLtYhWux6WEoXvayxA": [
			{
				"comment_id": 9,
				"body": "> Как думаете, это попытка власти всех запугать и закрутить гайки ...\n\nДа. :) В тоталитарных государствах удержание власти осуществляется ЛЮБОЙ ценой. Включая насилие и беззаконие.",
				"added": 1628359216
			}
		],
		"1_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 10,
				"body": "> Такое лучше выкладывать на форуме рашатудей.\n\nХа-ха. На Рашатудэй вы такого ни когда не увидите и не услышите. Кремлёвский \"патриотизм\" исключительно толерантен к еврейскому вопросу. И вообще, он борется с \"американцами\", а не с глобалистами.\n\nЧем вообще отличается истинный патриотизм от \"казёного\" (государственного)? Для казёного патриотизма существуют запрещённые темы. А для истинного - нет.",
				"added": 1628360316
			}
		]
	},
	"comment_vote": {}
}