{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1561938559,
			"title": "Plans to coordinate ZeroNet with other opensource peer-to-peer platforms?",
			"body": "Is it even theoretically possible to coordinate ZeroNet with other opensource, distributed networks, like Blockstack and Freenet, so that anyone on any platform can get to websites on any other platform?\n\nSince I hit my 50KB limit on ZeroTalk, I can't post there.  So, I'm posting this question on NetTalk.  This 50KB limit is like being shadow banned on Reddit.  I can see my posts, but no one else can.",
			"added": 1561938558
		}
	],
	"topic_vote": {},
	"next_comment_id": 24,
	"comment": {
		"1558459108_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "The only democracy that will be harmed by an open and free internet is a pretend democracy.",
				"added": 1559735101
			}
		],
		"1528234320_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 2,
				"body": "37.235.1.174 and 37.235.1.177 are for FreeDNS located in Vienna Austria (out of reach of the US), and they don't log.\nhttps://freedns.zone/en/",
				"added": 1559737179
			}
		],
		"1561938559_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "Either you (styromaniac) didn't understand my question or I didn't understand your answer.  Let me rephrase my question.  Is it possible in the future that ZeroNet and other open source peer-to-peer networks could be linked together somehow (the way Friendica, Diaspora, and other peer-to-peer social networks are linked together now), so that if I'm running only ZeroNet on my computer, I can also get to Blockstack websites and Freenet websites.  I suspect the answer to my question may be \"no\".  But I was wondering, if all peer-to-peer networks could agree on a common format, would it be possible?",
				"added": 1561939971
			},
			{
				"comment_id": 4,
				"body": "Seems like, if the goal is to get more people on ZeroNet, then linking ZeroNet with other open source peer-to-peer networks is one way to do that.",
				"added": 1561940374
			},
			{
				"comment_id": 5,
				"body": "Yes, a protocol like ActivityPub could allow ZeroNet users to link to all other peer-to-peer networks, like Friendica, etc., that are already using it.  Then Freenet, etc. could join if they wanted to.",
				"added": 1561940710
			},
			{
				"comment_id": 6,
				"body": "Ok.",
				"added": 1561940898
			},
			{
				"comment_id": 7,
				"body": "Well, I guess it's something to keep in mind for the future.  This does seem like it would do a lot to increase the number of people on all peer-to-peer networks.",
				"added": 1561941122
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_7_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):  IPFS\n\nThat's good.  Seems like IPFS has some problems, but hopefully they'll be fixed.  Any idea about how the ZeroNet over IPS effort is going?",
				"added": 1562065919
			}
		],
		"1560773982_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "As far as anyone knows the FBI has compromised ALL publicly-available encryption and messaging programs.  The justified speculation is that is why the truecrypt people closed their company and gave their code to Veracrypt.  The only code that you can be sure doesn't have a backdoor is the code you write yourself.  I tried that myself , but  no one wants to use it, because it isn't zero knowledge.  I created a very simple message board that is encrypted with openssl, where the person who sends a message and the person who receives it are totally disconnected from each other, because there are no accounts.  Seems like this is what a lot of people would like to use, but they won't use it, because they don't trust me.  So, the only code you can trust to be uncompromised by the FBI or the programmer is code you write yourself.",
				"added": 1562259928
			},
			{
				"comment_id": 13,
				"body": "> [peerco](#comment_1_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): This is not only about the crypt self. [...]\n\nI'm not exactly sure what you're asking, so I'll just describe the way my https (TLS 1.2)  message board website works.  First, there is no logging of anything except that the message itself is recorded along with a message number (randomly generated and unique to each message) and a password chosen by the user (must be > 11 characters, etc.).  The person who writes the message transmits the message number and password to the message receiver through any other method that he wants, which depends on how secure he wants his message to be.  The person who wants to read the message goes to the website and enters the message number and password to see the message.  So, there is no way for a third party to know who the message sender or receiver are or how to tie the two together.  The message is automatically deleted two weeks after is is recorded, whether it is read or not.  People, didn't like my system for a number of reasons which just come down to them not trusting me.",
				"added": 1567438536
			}
		],
		"1561814117_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 12,
				"body": "Turning off javascript wherever possible helps.",
				"added": 1565213386
			}
		],
		"1521970229_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 14,
				"body": "Since Protonmail and Tutonota are now requiring phone numbers from new users, there is no reason to think that they have not been co-opted by a government.  There is no reason to ask for a phone number except to identify you.  The only reason to identify you is if they are spying on you.   Tutonota also requires phone numbers from old users, which is why I'm no longer using it.",
				"added": 1568419345
			},
			{
				"comment_id": 15,
				"body": "> [ssdifnskdjfnsdjk](#comment_92_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Before around 2 weeks i was registering tutanota.de mail account via Tor browser and phone number was NOT required. I am quoting from their FAQ page: \"Upon registration you do not need to provide any personal data (e.g. no phone number required).\"\n\nAll I can say is that the last time I tried to log on, they asked me for a phone number and wouldn't let me log on without it.",
				"added": 1568505247
			}
		],
		"1566405335_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 16,
				"body": "You can also get some live TV stations by putting OSMC (a KODI derivative) on a Raspberry Pi 3.  It's very easy to do and requires no additional hardware.  There is a long list of video plugins, most of which are not very good, if they work at all.  But, some are decent.  So far, I have not managed to get Netflix working.  That was why I was messing around with OSMC in the first place.  If anyone has actually done that (not just read about it), please let me know.",
				"added": 1569012848
			}
		],
		"1566288245_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 17,
				"body": "There are limits to how big hard drives can get.  I saw a new 120GB PNY SSD at a local store for $20.  That's pretty revolutionary.",
				"added": 1570307951
			}
		],
		"1572014442_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 18,
				"body": "I use several bootable Linux USB sticks instead of a single hard drive to separate: 1) general internet traffic from, 2) traffic where I enter passwords, and from 3) traffic that contains financial information.  I also have a dedicated USB stick for ZeroNet, and I use \"TOR Always\" mode, so I can follow clearnet links from ZeroNet posts.  With this method, the computer I happen to be on doesn't matter.  This is most similar to your #2.  Qubes never worked for me.",
				"added": 1572100535
			}
		],
		"1571814102_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 19,
				"body": "I'm interested.",
				"added": 1572100658
			}
		],
		"1578400898_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 20,
				"body": "Those are big time differences--enough to use the Raspberry Pi 4 with an SSD as a desktop computer.  Thanks!",
				"added": 1579028217
			}
		],
		"1579865522_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 21,
				"body": "I have three Raspberry Pi 3's.  I've been thinking of getting a Raspberry Pi 4, but I've been hearing it has problems.  What have been your experiences with it?  Is it worth buying?",
				"added": 1582595431
			},
			{
				"comment_id": 22,
				"body": "> [ssdifnskdjfnsdjk](#comment_127_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I think it may take at least half a year until they finish features like built-in USB booting. Some software like BerryBoot does ...\n\nThanks for the information.  I guess I'll hold off for a while until I have a real need for it.",
				"added": 1582679305
			}
		],
		"1595264976_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 23,
				"body": "I believe Sylpheed has been around since the 1990's.  It was being used on Damn Small Linux when I first found it around 2002 to 2004.  I enjoyed using Slypheed back then.",
				"added": 1597855087
			}
		]
	},
	"comment_vote": {
		"3_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"3_195oGGXB8AhwWSoXFHpbVT4TL4wLi1Af5e": 1
	}
}