{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Безопасно ли регистрировать Qiwi на левую сим-карту и использовать его?",
			"body": "Собственно говоря, тема полностью отражает суть, но я тут всё-таки поподробнее напишу.\nПонадобилось мне, значит, купить кое-что не очень легальное. Вещества, оружие, не важно, магазин хороший, но вещи в нём запрещённые. Суть в том, что оплата там либо криптовалютой, либо с Qiwi. А криптой мне из-за некоторых обстоятельств пользоваться очень неудобно, и вот поэтому мне в этом самом Qiwi нужен аккаунт, который я могу безопасно использовать.\nИ есть у меня, значит, симка, которую я ещё полгода назад купил с рук у мужика рядом с метро, и пользовался ей два раза. И вот если я на неё зарегистрирую Qiwi и с него оплачу, то какова вероятность, что ко мне приедут фэбосы?",
			"added": 1525103175
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1mGVkvn1kU9drvETUm8orvoBRppv4mNeQ": [
			{
				"comment_id": 1,
				"body": "> [deepstrelok](#comment_8_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh): либо с подмененным IMEI\n\nОб остальном я, конечно, догадывался, но за совет про IMEI и всё такое благодарю, об этом я не знал. Спасибо!",
				"added": 1525106232
			}
		],
		"1_16ViRrCEqRCH6tyZekTUzyLtYQTtNAW1RY": [
			{
				"comment_id": 2,
				"body": "Можно как-то в шиндовсе отключить запуск браузера при старте зеронета? А то сижу через Tor, а зеронет мне запускает тот браузер, который стоит по умолчанию, а это неудобно и опасно.",
				"added": 1525152966
			},
			{
				"comment_id": 3,
				"body": "> [balancer73](#comment_350_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): То ли сломано, то ли я что-то не так делаю.\nСкорее всего сломано. Пишут, что вроде как помогает в zeronet.conf писать open_browser = no (а не None). И это действительно помогает, потому что в таком случае не запускается ни зеронет, ни браузер, хах.\nЯ ещё пробовал ковыряться в start.py и zeronet.py, но это не помогло. Надо будет сейчас ещё на англоязычном форуме спросить, авось там помогут.",
				"added": 1525162621
			}
		]
	},
	"comment_vote": {}
}