{
	"next_topic_id": 10,
	"topic": [
		{
			"topic_id": 1616133587,
			"title": "If the Pentagon can subvert presidential authority on afghan evac > why not on pedogate???",
			"body": "https://www.zerohedge.com/geopolitical/how-us-military-subverted-afghan-peace-agreement-prolong-unpopular-war\n\nas said me, I am for INTEGRATION with the talibans ! it another whole concept... for later...\n\nthe point : so the dod breached the so called illusory fake \"chain of command\" with the illusory cic concept... \n\nyou can spin it how you want it...\n\nfact : trump wanted out, dod said no, dod won.\n\nokay... no problem with me on that...\n\nwhat about pedogate? If potus will can be discarded, why not fbi/doj/cia?\n\nwho are those fuckers, above american kids too?\n\nwhy not drone strike first the doj leader daughter AG Barr to get them to a funeral to then start the real clearing process?\n\nit has been done a thousand time in afghanistan...",
			"added": 1616133586
		},
		{
			"topic_id": 1616137845,
			"title": "Who are blinken, austin and sullivan?",
			"body": "1st we know that they too protect the pedos. fact.\n\nnext...\n\naustin : pedogen for raytheon. I agree the big black card is cool to hide this fact.\n\nblinken : seem to be completly mad !\n\nsullivan : no idea.",
			"added": 1616137843
		},
		{
			"topic_id": 1616138135,
			"title": "Rather than calling it the USA, I would hesitate between the waring state or the warring states...",
			"body": "they are at war against the world, and among themselves... the question is for how long...",
			"added": 1616138132
		},
		{
			"topic_id": 1616140056,
			"title": "Could israel survive a china - pedofeodalist usa war for taiwan?",
			"body": "that's the core question... my guess is yes at first, and then no... :). it's super easy to start the invasion of taiwan, then the mega fight with american occupied troops, less predictable... but once a winner is decided over this island, it's clear that the usa if it survives, as china mainland WILL, who will be backing israel? hehhehehe...\n\nand said taiwan is very close to the mainland, it's traditional china :). not an inch.",
			"added": 1616140052
		},
		{
			"topic_id": 1616140819,
			"title": "who was behind the league of nations?",
			"body": "https://en.wikipedia.org/wiki/League_of_Nations\n\nso demoNcrats... as always. I am curious which trick the pedofeodalists used to trick the american people to accept and not resists the entry in such a shit show !\n\nit makes no sense to have fought the king of england to then surrender and become a serf of the One world gov project of some perverts fighting plants based in NYC...\n\nthen it's funny how all those agendas are always colliding, creation of israel, ww2 etc... while america, as orginally intented could have been minding it's own business ! \n\nbut no... globo cops = facing the world... at least those who didn't betrayed. it's amazing how most of the greatest vicious traitors are in the five eyes.. canada, nz, australia... I guess uk has still a chance to find escape velocity once the disease is subjugated...\n\nand easy to metrics for the UK : plants of the creation - rape as warfare , but for now it's still denial.",
			"added": 1616140814
		},
		{
			"topic_id": 1616152950,
			"title": "my ccp dream? is that one day the tigers return naturally to china northern forests !!!",
			"body": "one day... one day... the first pawn of a tiger in china is way bigger than any step in the whole universe...",
			"added": 1616152944
		},
		{
			"topic_id": 1616154282,
			"title": "martin sieff is a fucking liar !",
			"body": "the war against china by the usa never stopped, they were too preoccupied by stalin russia (and followers) to have the energy to engage china. but as soon as they could, what did they do?\n\ncorner irak / sunnah and expand to afghanistan... those mega basises aren't made to fight talibans... 101 war...\n\nand the worst in all of this, they believe the successors of sun tzu don't see it... \n\njust lol at the arrogance of those serving the pedo feodal order.",
			"added": 1616154275
		},
		{
			"topic_id": 1616157900,
			"title": "pedogen keane speaks bout china :",
			"body": "prelude : clash, hostile start, power ! (okay finally someone who get that he will be drafted to die by pedogen who rape his wife while he is away).\n\nso now the pedogen keane :\n\n1. new admin new talk /// LOL mother fucking liar... your unitary regime pedo protecting cornerd by israel serving the pedofeodalists of the UNO / global agenda is exactly the same, muppets switching, more bail outs... \n\n2. xi , an experienced /// blah blah xi is just 1:1500000000 (more or less)... he has a full title mega long, aka comarade xijing ping !\n\n3. 2 major power /// fuck yourself pedo feodalist slave... EU is bigger than USA, Russia is gone on the moon or what, the Sunnah? yea yeah,... wait for it... even the persian are armed loaded, the indians? yeah... so your fucking shit to try to drag us in your crap to rape our children fuck off piece of shit, your kdis are dead... promised. marked for executions.\n\n4. continuity is encouraging /// so lol, contradictory term with above... it's a pedo feodal aristocratic order... nothing else. among others what was fought in iw1\n\n5. trump didn't do the pivot... and the real pivot was GWB and his struggle between israel needs and china cornering, believing that russia was dead (maybe as intented, you know those kgbers know their science).\n\n6. officials.. (don't remember)\n\n7. hk\n\n8. chinese of muslims faith coutner insurgency victory\n\n9. taiwan // lol\n\n10. // forgot tibet... al ready a first step...\n\n11. allies... just lol, we all hate you americans... pedos.\n\n12. cyber / spy... what? muppets.\n\n13. covid /// go fuck yourself with your plot to pretend trump didn't do it on himself, this pedo is so exposed... and he loved gmo (salmon and other shit) fuck it, fuck him and kill ivanka bitch.\n\n14. talk is good /// that the problem, they laugh at talk... they need 1m filled in a shoot out body bags... the no reatialiation program, then this filth will think and act differently otherwise, they will keep raping : IW2 is the answer !\n\n15. pushing back / he means like the hcildren he raped, aka no one must oppose american feodal lords.\n\n16. standing up to china // fuck you stand against the pedos fucking dead man (whose children will be killed).\n\n17. action must follow / just lol... as explain impossible to fight pla over taiwan and keep israel safe, we know which one will leads...\n\n18. nothing done ! wp great !",
			"added": 1616157892
		},
		{
			"topic_id": 1616163145,
			"title": "kill blinken before he reaches the EU",
			"body": "by eu forces ! good kill ! millions lives saved for one pedo !",
			"added": 1616163136
		}
	],
	"topic_vote": {},
	"next_comment_id": 44,
	"comment": {
		"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy": [
			{
				"comment_id": 1,
				"body": "> [reflektion](#comment_10_18nVP61UwksLSFKKqoFvYF4ULHvZhzv7A8): isn't this an option on pretty much every single online platform?\n\nNo, absolutely not ! On most it's other user who all co(h)encidentally follow the UNO / global agenda who decides who is allowed to participate and who isn't. Curiously they don't like a single word of criticism, you are only allowed to repeat their words. otherwise the other system have 0 mutting possibilities... there are often flood waves :):",
				"added": 1616132659
			}
		],
		"1616091369_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 2,
				"body": "> [deuxzaron](#comment_120_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): You do know you only have 50k characters right?\n\nyour own corpse will die, all the people you know will die, the sun itself, and you attach value to a username? what is wrong with you :).",
				"added": 1616132716
			}
		],
		"1615967547_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": [
			{
				"comment_id": 3,
				"body": "heretics !",
				"added": 1616132735
			}
		],
		"1616103694_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 4,
				"body": "> [5h1n1n9d4rkn355](#comment_14_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): There's no God. Only men, and their childish decisions endangering mankind.\n\nI see more only muppets not cleaning where required... it's another expression of the same problem...",
				"added": 1616132810
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 5,
				"body": ">Lavrov calls water blockade of Crimea ‘humanitarian crime’ at talks with PACE president\n\nhttps://tass.com/politics/1267741\n\nI personnally believe that those behind this decision, from the little guy who turned the swtich, to the guy who took the decision, shall all have their families massacred, and such for eternity. of course it doesn't mean to have to hurt collateral damages... just those specific individuals. to murder them, one by one, and their children.\n\nwhere do they hide? and what's the reason to not progress? if they want to be behave like \"parasitic predatory vermins\" as such they die.\n\nany form of kindness, mercy, reprisal to pedos is always a bad idea... never seen the movie where the girl can get the predator down, and rather than finish him to pulp, start to run out to get caught? it's such a classical scene... it's neuramaping trying. \n\nfor example, shot, pedo/predator fall, reaim, pop the head...now at least one enemy down, for good, if unsure a second...",
				"added": 1616133276
			},
			{
				"comment_id": 9,
				"body": "what makes the whole 1.10 lvs massacre unsolveable ? it's the pedogate wing of lvs... I can't image the slavery going on there... cancer+neurodenegerative.",
				"added": 1616138221
			},
			{
				"comment_id": 20,
				"body": "Dear Vladimir, what did we say about trolling senile people way back in the days ? heheheheh... reference to the live debate... just lol at the idea... it's not possible you know it... bidet admin is just a front for the pedo feodal admin represented by pedogenkeane who said don't listen to the words but actions ; i do : 2 arrests for esptein.",
				"added": 1616157294
			},
			{
				"comment_id": 21,
				"body": "otherwise the pedogen said : thug an dictator... you know what we say about pigeons in paris? not much :).",
				"added": 1616157325
			}
		],
		"1616133587_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 6,
				"body": "My new project is simple : to convert the giant military bases into madrassas of war ! And concretely it means keeping the giant basises but opening them to talibans teachers !!!\n\nwhy? first the talibans don't fight for money ! contrary to the so called official gov. And that's a major learning point.\nsecondly the talibans have proven to be winners and expert of wars and resistance ! American troops would learn so much in the true spirit of war ! and then be able to transpose those values to America itself !",
				"added": 1616135297
			},
			{
				"comment_id": 7,
				"body": "So if we think a little it's not the usa who attacked afganistan nor the talibans who attacked america... let's face it how many americans could find afghanistan on a map before 9.11? and how many talibans could find new york on a map? \n\nmy guess : is that the UNO / global agendas knows full well that one of their biggest most lethal firm and serious opponent in the word is the Talibans !!! the UNO global agenda hates ISLAM... at a point beyond anything believable. Why? because they want their own world new religion wrapped in pedo feodalism.\n\nand because of real muslims an attack on the quran is Djhad... aka holly way. and the UNO / global agenda doesn't want ISLAM to control afghanistan.\n\nso real american patriots should invite talibans speakers and teachers to speak on war, I hope they will find those who still can told the stories of the greeks... :). and then american patriots be able to liberate america from it's occupying child raping feodal class !\n\nof course it's an exclusive for american troops, all other foreign troops, from nato and co, are urged to live. \n\nthis is taliban country with american villages (the yuge basis) used as spring and indoctrination board to jump back to america and liberate it ! real talibans would have loved real america.",
				"added": 1616137751
			},
			{
				"comment_id": 12,
				"body": "yeah, it's clear it's not the usa which is at war with the talibans, but the UNO / global agenda, and their HATE for anything they can't control... good luck making the talibans renounce ISLAM... good luck... and have fun !\n\nso everything the usa says to the talibans is pure lie. they want to destroy islam, not because of america (A1) but because of their  treason to become UNO / global agenda enforcers...\n\nproblem is that the UNO / global agendas is INCOMPATIBLE with the US constitution and bill of rights... which should have been the \"sacred\" text of the usa... but for a bucks on wall street... they even trashed it.\n\nthe talibans won't trash the Quran... nope at all, they call themselves even students of it :). very pious, very humble...",
				"added": 1616140307
			},
			{
				"comment_id": 13,
				"body": "how to trust people who betrayed themselves and allowed their kids to be raped with full legal immunity... remember when the american senior command was saying it was for human rights reason they went to afghanistan? meanwile and at the same exact time american children were targeted, recruited and trained to become sex slaves for the same... and that's for those who weren't murdered in some kind of rituals...",
				"added": 1616140447
			}
		],
		"1616137845_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 8,
				"body": "is it really to know or search more when the important point is that they are like those before them... unable to arrest more than 2 people for epstein and 1 for weinstein... \n\na nation like that doesn't deserve to exists at all.",
				"added": 1616138079
			},
			{
				"comment_id": 10,
				"body": "I am sure that blinken was suprised to hear the \"tone\" of china... it's funny to think that a crumbeling nation having pedo running amok is even trying to dominate China... \n\nyou know pedoyankees, there are native elephants in china... and like the pandas... they know, the dragon is real :), and that's why you don't know there are elephants in china...\n\nand as the elephants did their best to behave, the instructions of the dragon were always very clear... the same as for the ducks...\n\n>In China, Asian elephants are under first-level protection.",
				"added": 1616138438
			}
		],
		"1616102046_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f": [
			{
				"comment_id": 11,
				"body": "the core problem of the pedos feodalists is that to defend taiwan they have to focus their whole war machine there, and of course it opens up all the other front line...\n\nthat's the problem of following the UNO / global agendas... the resistance is too wide spread, without adding all the previous conflicts.\n\nit's a classical problem of over extension.\n\nmeanwhile PLA can see taiwan... (i guess, it's not that far by a clear summer day :D) and there are big mountains... so...\n\na little querry : failed. can you see taiwan from the mainland? the point being it's not far... (otherwise, they wouldn't have reached it in the first place :D).",
				"added": 1616139612
			}
		],
		"1616146599_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA": [
			{
				"comment_id": 14,
				"body": "it fits !\n\n1913 fed act\n1920 japan enters SDN\n1937 war against china",
				"added": 1616152249
			},
			{
				"comment_id": 15,
				"body": ">To advocate a New Order was to seek freedom and respect for peoples without prejudice, and to seek a stable basis for the existence all peoples, equally, and free of threats. Hideki Tojo\n\nmy ass it was a cover serfdom to the western feodal power... ! what a liar !\n\n>Nevertheless, China was unfortunately unable to understand Japan's real position, and it is greatly to be regretted that the Sino-Japanese War became one of long duration. Hideki Tojo\n\nwhat the fuck, this man drunk too much sake!\n\n>From the point of the view of the nation's power, it was obvious that while we were fighting the Sino-Japanese war, every effort was to be made to avoid adding to our enemies and opening additional fronts. Hideki Tojo\nRead more at https://www.brainyquote.com/authors/hideki-tojo-quotes\n\nso now this fucker reconized that it was pure aggression?\n\ndid he ever came clean?\n\n>Thus, it was to seek true civilization and true justice for all the peoples of the world, and to view this as the destruction of personal freedom and respect is to be assailed by the hatred and emotion of war, and to make hasty judgments. Hideki Tojo\n\napprently not... a league of the nation servant, defeated. another one ! this is one of the most productive situation in the history of war of china ! so many ennemies... never warm a dragon for war :).  it's already a violation of rule 1.",
				"added": 1616152878
			},
			{
				"comment_id": 16,
				"body": ">The moment the first American soldier sets foot on the Japanese mainland, all prisoners of war will be shot.\nHideki Tojo \n\nahahah got nuked :).",
				"added": 1616152979
			},
			{
				"comment_id": 17,
				"body": "what I don't understand or can't accept is this arrogance and mepris for the sovereignty of china... from islets... unbelievable...",
				"added": 1616153055
			}
		],
		"1616152950_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 18,
				"body": "but maybe it will by the southern one... so that once again china regains it's status of cat paradise !",
				"added": 1616153107
			}
		],
		"1616154282_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 19,
				"body": "at one point drop the charade pedo yankees... drop it... conquered and owned and powned to have your own kids raped to serve tel aviv / uno global agenda...\n\nthe problem is that you don't get it... or it's USC an BOR supreme over usa, or there is no usa at all. which is the case now.\n\nand so rather than serve other people ambition why not wipe the real menace : THE UNO / GLOBAL AGENDA... \n\nthere then wait for recalibration... again and again...\n\nbut as long as this pedo feodal planetary dream is entertained by those imortal fundations the usa is gone...",
				"added": 1616154410
			}
		],
		"1616157900_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 22,
				"body": "too low iq this man, and he hides it with aggressivity !",
				"added": 1616158001
			},
			{
				"comment_id": 23,
				"body": "what would have been nice? to liberate meng... ahh no, the rule of law prevent it, the same rule of law which arrested her and give immunities to epstein... we get it... stop the crack !",
				"added": 1616158036
			},
			{
				"comment_id": 24,
				"body": "another imperial masterpiece :).",
				"added": 1616158289
			},
			{
				"comment_id": 25,
				"body": "go home america go home... or at least defeat the UNO / global agendas...",
				"added": 1616158327
			},
			{
				"comment_id": 26,
				"body": "I am curious if keane will be so arrogant and aggresive and confident after having eat alive his whole family? I bet you not... broken... we are gonna break you... witness program !",
				"added": 1616158373
			},
			{
				"comment_id": 27,
				"body": "nope it's survivor.... this one... special witness..",
				"added": 1616158383
			},
			{
				"comment_id": 28,
				"body": "those we can show the world and say : See?",
				"added": 1616158403
			},
			{
				"comment_id": 29,
				"body": "and what's fun mr keane is that all your game rest on lies and narratives as soon as the troops wake up from their fucking brainwashing, your kids are dead, and you know it !",
				"added": 1616158443
			},
			{
				"comment_id": 30,
				"body": "in PLA? no worry ! fighting for CCP? we are CCP !",
				"added": 1616158457
			},
			{
				"comment_id": 31,
				"body": "you have agencies\nwe have ministries :).\n\nyou face a very long administrative history, everythin was already tried... you know we kept the best only... what can you, remake the same mistake as 5000 years ago or those along the way? not very astute.",
				"added": 1616158649
			},
			{
				"comment_id": 32,
				"body": "surrender, go kill pedos.",
				"added": 1616158676
			},
			{
				"comment_id": 33,
				"body": "and to end with a question who are pedo feodalist aristocrat gen representative to the other outlet of american propaganda (abc, cbs, msnbc, cnn)? as pedos as keane?",
				"added": 1616159955
			},
			{
				"comment_id": 34,
				"body": "for sure... but who are they?",
				"added": 1616159963
			}
		],
		"1616163145_18BioUS1ntAqP4hN6pJJUjdCqUfKe1599i": [
			{
				"comment_id": 35,
				"body": "you can fuck american kid if you want, go away from US ! time to scantion american corporations ! and ruin them by denying them the largest single market in the world.",
				"added": 1616163357
			},
			{
				"comment_id": 36,
				"body": "I don't want submission, I want destruction + invesion ! time to ruin to suckers !",
				"added": 1616163375
			},
			{
				"comment_id": 37,
				"body": "and without the pedos uk it's way easier !",
				"added": 1616163385
			},
			{
				"comment_id": 38,
				"body": "they have spinned this kween, I am not sure she understand anything but her ways...",
				"added": 1616163404
			},
			{
				"comment_id": 39,
				"body": "death to americans ! sorry patriots but as you are unable to free yourself from the pedo feodalists and you seek to drag us in your useless wars... go away !",
				"added": 1616164029
			},
			{
				"comment_id": 43,
				"body": "those are fucking americans are demons !!!",
				"added": 1616165345
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 40,
				"body": "the cnn thing in brazil should be killed asap. one enemy less and a strong warning to el norte.",
				"added": 1616164779
			},
			{
				"comment_id": 41,
				"body": "most nations pay cnn to not get propagandized against... I am curious what targeted killing strategy yields.... I gues they can be made forced to whorship bolsonaro !!! easy... to try... who are the big shareholders? editors? go go go... the border is open ! so...",
				"added": 1616165048
			},
			{
				"comment_id": 42,
				"body": "why let those things dominate brazil? easier than to fight against the spice trade :).",
				"added": 1616165069
			}
		]
	},
	"comment_vote": {}
}