{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Principia\n\n Philosophiae naturalis principia mathematica (Princípios matemáticos da filosofia natural) é uma obra-prima de Sir Isaac Newton. A produção do tratado foi um divisor de águas na história da ciência, sendo considerada por muitos a obra científica mais importante já publicada. Quando produziu a obra, Newton (de 1642 a 1727) era professor de matemática no Trinity College, em Cambridge. Ela apresenta as bases da física e da astronomia, formuladas na linguagem de geometria pura. É uma obra dedutiva em que, a partir de muitas proposições gerais, as propriedades mecânicas são demonstradas em forma de teoremas. Seu conteúdo estabelece os fundamentos da hidrostática, hidrodinâmica e acústica, e sistematiza um método para o estudo da natureza por meios matemáticos. A obra foi escrita em latim, indicando seu público-alvo: especialistas em matemática e mecânica, astrônomos, filósofos e graduados universitários. Principia, como a obra é conhecida, consiste em três livros, precedidos por um capítulo preliminar de definições e outro que lida com axiomas ou as leis do movimento. As “definições”, oito no total, definem o vocabulário usado ao longo de todo o texto, e introduzem o conceito de espaço e tempo absolutos. O livro um, “Axiomas e as leis do movimento”, é sem dúvida a parte mais conhecida da obra. A primeira lei de Newton afirma que cada objeto continua fazendo o que estiver fazendo em seu estado de repouso ou de movimento uniforme, a menos que uma força seja exercida sobre ele. Assim, o estado de inércia se torna a primeira lei, ou o primeiro axioma. A segunda lei estabelece que a força resultante sobre um objeto é igual à taxa de variação de seu momento linear num referencial inercial. A terceira lei estabelece que todas as forças entre dois objetos existem em magnitude igual e em direção oposta. A dinâmica gravitacional como um sistema de atração recíproca se baseia nesta terceira lei. O livro dois trata do movimento dos corpos em relação à resistência e à velocidade. Nesta parte central da obra, o primeiro capítulo fala do movimento de objetos num vácuo, ou seja, o movimento de objetos que não encontram resistência. O livro três, “O sistema do mundo”, é onde são aplicados os princípios da astronomia elaborados anteriormente. Newton explora a derivação das leis da gravidade, as implicações para órbitas planetárias, a lua e os equinócios em sua relação com a teoria da gravitação, e o estudo dos cometas. Ele encerra o tratado com o texto do “Escólio Geral”, adicionado à obra da segunda edição em diante. Isso infere uma explicação racional para a existência de um ser superior e é famosa por sua declaração: “Eu não invento hipóteses”, sobre sua metodologia. Durante a vida de Newton, Principia foi publicada em três edições: a primeira em 1687, com uma tiragem de 300 a 400 cópias; seguida pela edição de 1713, revista, alterada e ampliada pelo autor; que por sua vez foi seguida pela edição de 1726, revista por Newton e editada por Henry Pemberton. A tradução para inglês de Andrew Motte só apareceu em 1729 (depois da morte de Newton). A edição francesa foi publicada em 1756, e foi traduzida pela marquesa de Châtelet, com adições do matemático Alexis-Claude Clairaut e prefácio de Voltaire. \n\n- https://gateway.pinata.cloud/ipfs/Qmc2fc67YJinan3r4Ao1f19pJYptxm1Lb4KCqunJhuY6gS",
				"added": 1576208679
			}
		],
		"3_1MLAfoPeV175YuQ7BjH9L4forwhaexDAd5": [
			{
				"comment_id": 2,
				"body": "#Coleção Os Pensadores | 22 livros para baixar (PDF)\n\nA Coleção \"Os Pensadores\" é uma coleção de livros que reúne o escol das obras dos filósofos ocidentais desde os pré-socráticos aos pós-modernos. Publicada originalmente pela editora Abril Cultural, entre os anos de 1973/1975 era composta de 52 volumes com as obras supracitadas e mais quatro volumes adicionais onde se lia a respeito da vida e obra de cada pensador.\n\n- https://gateway.pinata.cloud/ipfs/QmQfVL58v3ja6PDSynTpJMS6FyD7eDhMtwwqY8VDoZ2Yv2",
				"added": 1576209708
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 3,
				"body": "#Coleção Os Pensadores | 22 livros para baixar (PDF)\n\nA Coleção \"Os Pensadores\" é uma coleção de livros que reúne o escol das obras dos filósofos ocidentais desde os pré-socráticos aos pós-modernos. Publicada originalmente pela editora Abril Cultural, entre os anos de 1973/1975 era composta de 52 volumes com as obras supracitadas e mais quatro volumes adicionais onde se lia a respeito da vida e obra de cada pensador.\n\n- https://gateway.pinata.cloud/ipfs/QmQfVL58v3ja6PDSynTpJMS6FyD7eDhMtwwqY8VDoZ2Yv2",
				"added": 1576209767
			},
			{
				"comment_id": 4,
				"body": "#Livros de Norberto Bobbio\n\nNorberto Bobbio (1909-2004) foi um filósofo, militante político, ensaísta e professor italiano, considerado um dos mais destacados filósofos do século XX.\n\nNorberto Bobbio nasceu em Turim, Itália, no dia 18 de outubro de 1909. Filho de Luigi Bobbio, um médico cirurgião e de Rosa Cavilia, estudou no Ginnasio e em seguida no Liceo Massimo d’Azeglio. Em 1927 ingressou na Universidade de Turim no curso de Direito. Em 1931 licencia-se com a tese Filosofia do Direito. Estagiou em Marburg na Alemanha. De volta a Turim continuou seus estudos e em 1933 defendeu a tese “Husserl e a Fenomenologia”. Em 1934 obteve a livre-docência em Filosofia do Direito.\n\n- https://gateway.pinata.cloud/ipfs/QmNi7rQ3vNoABZXTE55rk5pyWC2mboaDGfAW6AEfY6iyFf",
				"added": 1576211355
			}
		]
	},
	"comment_vote": {}
}