{
	"next_post_id": 3,
	"next_comment_id": 14,
	"next_follow_id": 6,
	"avatar": "generate",
	"user_name": "Thorburn",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1597447212,
			"body": "#ShadowGate Millie Weaver (Millennial Millie) Arrested before she released her Shadow Gate Documentary earlier today. https://www.youtube.com/watch?v=5o8vb7SihZc#",
			"date_added": 1597447210
		}
	],
	"post_like": {
		"1HmMuCzHEsuB7BzrRDcCpmR1VR7d2sbYw2_1540793849": 1540847187,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1575593270": 1575934445,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1601878210": 1602021014
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Once the cashless society is fully established everyone will become a potential victim of control by financial institutions.\n\nEdit: Everyone needs to educate themselves about money, and how it's used to control them/us, before we reach the point of no return (2030?).",
			"post_uri": "1HmMuCzHEsuB7BzrRDcCpmR1VR7d2sbYw2_1540793849",
			"date_added": 1540847731
		},
		{
			"comment_id": 2,
			"body": "A bigger concern maybe the owners of the certificate authorities and whether they can be trusted?",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1542413327",
			"date_added": 1542757862
		},
		{
			"comment_id": 3,
			"body": "Can you provide links to historical projections and models presented by the highly suspect and very selective IPCC, where there is real world verifiable evidence which demonstrates the accuracy of those historical projections etc? I haven't seen anything that validates any of their past alarmist claims and predictions. The highly corrupt and dishonest Cambridge Climate Research Unit (CRU) contribute data to the IPCC, and the evidence in the Climate gate 1 & 2 email scandals shows how they willfully falsified and cherry picked data to support the narrative of the IPCC. Which begs the question - why would any rational thinking individual consider the IPCC as a reputable source with respect to anything based on reality?\n\nWhy do the IPCC always use terms like; predictions, models, may, could and possibly? Instead of using language such as; based on the scientific evidence, x shows that y will be the inevitable outcome if left unchecked? The reason they use such vague language is simply because their opinions aren't based on any real substance.   \n\nCould you explain how the so called impact of human Co2 contributions have any significance when only 0.04% of the Co2 in the upper atmosphere is attributed to human activities? Do you consider 0.04% a significant fraction of the sum? Do you seriously believe the reduction or complete elimination of such an insignificant fraction could possibly have any meaningful impact on the effects of Co2 levels?\n\nGiven the fact that Co2 is a primary element, required for the life cycle of plants and animals (all living things), does it actually make any rational sense to consider Co2 as the bogyman?\n\nDo you have links to maps with real world verifiable evidence of sea level rises that conform to the claims presented by the IPCC et al and their past doom ladened models and projections?\n\nIn another post of yours you reference the state of Internet Censorship spanning 149 countries. Does it strike you as strange that the counter arguments to the IPCC's claims fall under that regime of Internet censorship?\n\nCan you explain why only one side of the argument is presented by a tightly controlled and selected group of so called academics, NGO's, corporations and their controlled media outlets?\n\nCan you name three respected scientists/researchers who present a counter argument to the IPCC and the top three elements of the arguments they present in support of their claims? If not I can only assume that you haven't done your own due diligence, and you are ignorant of the real opposing position/s.  \n\nIs real science ever settled and closed to debate or should science continually question and test accepted theories and claims? What makes an accepted fact and who determined the acceptance of said facts?   \n\nIs it reasonable to accept scientific claims and opinions based upon the consensus of opinions by a select group, rather than evidence backed claims and studies that challenge the views and opinions of the official consensus?\n\nWho funds the IPCC and why? Why aren't the the alternative researchers funded by governments and why not?\n\nIf the claims of the IPCC et al are built on sound science and observable reality, why have major media outlets such as the BBC been repeatedly caught out falsifying news footage and stories etc. in support of the IPCC claims and the Co2/Global Warming (rebranded Climate change) agenda proponents?\n\nWhy do the state education systems only present information that supports the claims of one side of the argument to students, rather than presenting both sides of the argument for critical thought and reasoning? Could it be that the object of the state education system is geared to tell students what to think, as opposed to teaching them how to think? Why do schools discourage students from questioning the so called facts provided by the system, while rewarding them for regurgitating those so called facts unquestioned? Smells like a system of Indoctrination rather than one of education. \n\nIf the argument is built on a solid scientific foundation surely it would withstand any counter arguments without issue, while standing defiantly on scientific merit alone, without the need to force a one sided officially accepted narrative.\n\nWhy do the climate scammers continually appeal to emotion? An appeal to emotion is a logical fallacy as is an appeal to authority (ad verecundiam), or the appeals to ridicule often accompanying by ad hominem attacks which they also heavily rely upon, in the absence of a sound argument based on fact. Sophists require the use of such intellectually trickery in order to sell their flawed ideas, as their arguments cant withstand honest inquiry or debate, based on logic and reason, due to the lack of any verifiable and reasoned substance. For more on logical fallacies, and how to avoid the tricks of the sophists and intellectual fraudsters out to fool you see here https://www.triviumeducation.com/logic/some-fallacies/ .",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1585763998",
			"date_added": 1586794019
		},
		{
			"comment_id": 4,
			"body": "Lmfao, \"during a pandemic...during a pandemic...during a pandemic...\" The 'Pandemic' is a false narrative which is required in order to promote and sell mail voting to the masses. \n\nCare to explain how that is in the least bit honest?\n\nIt doesn't mention how open to fraud Mail voting is. It doesn't mention how the USPS has been in decline for decades before Trump and Co. were involved. It makes claims and cast aspersions which aren't legitimate etc. etc. etc. It doesn't cover election rigging, which is the primary reason for calling for mail voting. \n\nThat bs is direct from the cross party criminal cabal that wants to defraud and sellout the American public, which they have been doing successfully for at least the past 60 years 'n more.",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598139901",
			"date_added": 1598170800
		},
		{
			"comment_id": 5,
			"body": "@Realjohndoe: Continue to progress? The US has been in a steep state of regression for the past 60 years, just like every other Western nation! We will all cease to exist as we are all bio degradable...sorry to break it to you. ;)",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598139901",
			"date_added": 1598221480
		},
		{
			"comment_id": 6,
			"body": "You must think that young people are too retarded to understand how susceptible mail in voting is to fraud, and how it will be used to undermining the formation of a legitimately elected government. You just need to look at the most recent instances of mail in voting to recognise how flawed and corruptible the process is.\n\nThe only supporters of mail in voting are traitors and criminals who wish to exploit the political process, and rob the population of their nations wealth, and constitutional integrity.    ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598562184",
			"date_added": 1598653243
		},
		{
			"comment_id": 7,
			"body": "You must think that young people are too retarded to understand how susceptible mail in voting is to fraud, and how it will be used to undermining the formation of a legitimately elected government. You just need to look at the most recent instances of mail in voting to recognise how flawed and corruptible the process is.\n\nThe only supporters of mail in voting are traitors and criminals who wish to exploit the political process, and rob the population of their nations wealth, and constitutional integrity.    ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598642333",
			"date_added": 1598653286
		},
		{
			"comment_id": 8,
			"body": "Honest Voter Fraud discussion:\nhttps://www.youtube.com/watch?v=fi9waKP1LTU ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598642333",
			"date_added": 1598708019
		},
		{
			"comment_id": 9,
			"body": "Honest Voter Fraud discussion:\nhttps://www.youtube.com/watch?v=fi9waKP1LTU ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598562184",
			"date_added": 1598708046
		},
		{
			"comment_id": 10,
			"body": "@Realjohndoe: People aren't as stupid as you seem to think they are, so they can be the judge as to whether my verifiable claims are bullshit or not themselves. Mandatory in-person voting hasn't been the case as absentees have the option to vote remotely by mail on request. What makes you think I need work for a living?",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598562184",
			"date_added": 1598786273
		},
		{
			"comment_id": 11,
			"body": "@Realjohndoe: People aren't as stupid as you seem to think they are, so they can be the judge as to whether my verifiable claims are bullshit or not themselves. Mandatory in-person voting hasn't been the case as absentees have the option to vote remotely by mail on request. What makes you think I need work for a living?",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1598642333",
			"date_added": 1598786378
		},
		{
			"comment_id": 12,
			"body": "Lmfao! CNN must be the retards network of choice. She starts by mentioning masks and then claims HQC is nonsense. It says on the box that masks are useless against Cov-19, as they are generally and especially for particulates the size of so called viruses. Real doctors actually treating people have gone on record to state that HQC is effective when used appropriately in the initial stages. Anyone who actually takes CNN et al seriously deserves everything they get...fortunately more and more people have realised that MSM is total propaganda which cant be trusted.\n\nBullshit posts like this make ZeroNet no better than the fucking shit that's in the mainstream. It also makes your better contributions less credible. Just like FOX the truth is lost in the heaps of shit being pump out.\n\nWhy don't you fuck off back to facebook with this shit!?",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1601183911",
			"date_added": 1601194503
		},
		{
			"comment_id": 13,
			"body": "I don't find your posts offensive...I find them to be ill-informed and retarded for the most part.\n\nYour endorsement of that CNN trash is an excellent example which demonstrates that fact!  ",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1601183911",
			"date_added": 1601210070
		}
	],
	"follow": [
		{
			"follow_id": 3,
			"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
			"auth_address": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4",
			"user_name": "Geekless",
			"date_added": 1597942425
		},
		{
			"follow_id": 5,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71",
			"user_name": "zeromepro",
			"date_added": 1602021519
		}
	]
}