{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1567951156,
			"title": "Tracking Zite changes with Git",
			"body": "Since I'm paranoid I'd like to see what has been changed each time a Zite owner updates.\n\nInstalled Git\nAdded a .gitignore file in the zite's directory to block things that change frequently. So \"data/*\" usually goes in there depending on the individual setups.\nRan \"git init\" then \"git add .\" finally \"git commit\" in the zite's directory.\nAdd each zite's directory as a local repository in a gui git tool, like GitHub Desktop.\n\nThat should give me an easy way to check changes when a zite owner updates.\n\nI think it is a low probability that some \"agency\" would push out malware to a zite. They like to keep their exploits secret and sending one to every zite user in an update would effectively \"blow\" that exploit. Never know though...",
			"added": 1567951155
		},
		{
			"topic_id": 1568070326,
			"title": "ZeroNet and Bitcoin crypto?",
			"body": "The website says it uses Bitcoin cryptography and BitTorrent network. I see the BitTorrent part but is there some sort of blockchain that I'm overlooking?",
			"added": 1568070324
		},
		{
			"topic_id": 1568749254,
			"title": "KxoID and why GitCenter is cancer - KxoID hate thread",
			"body": "So GitCenter is over in another thread trying to get people using KxoID. glightstar was complaining about people messing up the thread with off-topic stuff, namely people crying fowl. So here is the official KxoID complaint thread.\n\nWhat is KxoID?: Alternative ID to ZeroID that is kind of abandonware. Why is it gay?: It includes default block lists for “anti jew” and “anti LGBT” users. Styled as opt-in, apparently there is a central authority that can push users onto these lists. Anything stopping the maintainer from making a change forcing these lists to be used? Apparently not.\n\nGitCenter doesn’t agree with this assessment. GitCenter thinks you don’t know how ZN works. GitCenter deflects with navel-gazing code references ← GitCenter says this is just more proof you don’t know enough to have an issue. GitCenter tells you that nofish is cagey and how suspicious he wants you to view that as. GitCenter wants to “help” ZeroNet development but suspicious, possibly malevolent nofish, doesn’t want that. GitCenter will prove how weak ZeroID is by flooding it from Tor nodes causing nofish to block Tor...now nobody can generate an ID that way.\n\nMy opinion is that KxoID is suspicious along with Name.Yo and whatever “helpful” ideas GitCenter comes up with. Productive work to help the network? Great. FUD-spewing along with add in ZN “features” with additional unknown centralized control? Not great.",
			"added": 1568749251
		},
		{
			"topic_id": 1569015162,
			"title": "Clean code examples for learning ZeroNet programming",
			"body": "Noob question here. Where is a good place to find clean ZN site code? Something before minification and not just the somewhat hard to read stuff in the zite's data directory. I feel like I'm missing something just looking through that stuff.",
			"added": 1569015158
		},
		{
			"topic_id": 1570496389,
			"title": "Leaving a fake identity for the “real world”",
			"body": "My current work is coming to an end. Ownership changes and my general unhappiness with the field (a specialized branch of IT) has made me sick of it. I’ve done it for many years and people liked my work but it was never very lucrative. Freedom and an easy work environment made it acceptable to me; but not loved. Many people pivot from one career to another. But in my case there is one little snag: nobody I work with knows who I really am.\n\nMany years ago there was a “misunderstanding” to which I overreacted. And by overreacted I mean I researched and built an entire fake identity. It was a real identity, it just wasn’t mine; baby who died soon after being born, that sort of thing.\n\nSo with that paperwork I have been partially living and working for many years. I’ve used my real identity for some day-to-day stuff. My fake is just for working and making money. But now I’m done, done with my field, done with my fake identity. It’s time to move on to the next great adventure.\n\nMy real identity is pretty clean, and now I know, safe to live under. No debts, but no education or work history either. No rental agreements, no credit card debt, no tax history...at all. Basically if I said I had been living in the gutter all these years giving blow-jobs to stock brokers to buy food, nobody could prove me a liar.\n\nI have my skills, but there are other industries they could apply to. I don’t have formal education but from what I see, if I had gone the formal education route I’d not be doing much better, and maybe worse. Financially my way makes more sense for what I have been doing.\n\nI’m pretty much going to have to reinvent myself from a blank page, with the positive and negative aspects that come with that.\n\nWhat do? I’m in brainstorming mode here.",
			"added": 1570496384
		},
		{
			"topic_id": 1574367198,
			"title": "Shooter manifesto verification idea",
			"body": "A mass shooter can't put too much detail in their manifesto since they will release them before the event. Too much detail = failed high score attempt. This makes it a bit hard to certify that a given manifesto is in fact the real deal and not just a cleverly worded forgery made after the fact. So what is needed is a way to 1) certify that a given document existed *before* a certain date and 2) certify that a given manifesto was written by a particular person for a particular event. This needs to happen in a way that is difficult for authorities to cover up, hard to fake after the event and protects the identity of the manifesto author till after the event.\n\nFor 1, there are time stamping services that record a cryptographic hash of a document and certify the time. Pros are that you don't have to release your full document to timestamp, just a hash of the file. Cons are, these are centralized services and can be forced to remove/modify data by authorities. I'm open to suggestions but there might be a way to make a time stamping service that works the same way as Blockchan did: data is stored to Ripple's XRP blockchain.\n\n2. Manifestos have to be general since they are released before an event, one can't say what they are planning on doing or who they are. But knowledge after the event could be used to verify a particular manifesto.\n\nSo, Timothy McVeigh could say: \"I am including an SHA256 hash of details to confirm this document. The format is: 'MM/DD/YY:FIRST LAST:CITY:REGION' without the quotes. After I am done and details emerge you can hash them yourself to confirm this document is genuine. SHA256: 8B58F2B855E3387ECE69F5D35E7F67FD6116722903F0F0B5CF530ABF2436206B\"\n\n\nPost event, people could confirm the manifesto: '04/19/95:TIMOTHY MCVEIGH:OKLAHOMA CITY:OKLAHOMA' when SHA256 hashed would match the hash included on the document. And since SHA256 is supposed to be one-way (though the NSA could likely build a massive pre-populated hash table and effectively \"crack\" it) it is only after an event that everyone would have the details to verify that a particular manifesto was related to a certain event.\n\nIs there a better way to achieve the same thing?",
			"added": 1574367192
		},
		{
			"topic_id": 1579312378,
			"title": "Virginia, The Base, and Fedposting",
			"body": "They rounded up some \"white supremacists\" with guns who were planning violence in Virginia, Monday. Members of a group called The Base. They had people posting bomb making stuff on their forums.\n\nBackstory: About a year and a half ago The Base appears out of nowhere, broadcasting the desire for new members, on the internet, with Fedposting-like language. I immediately think these are either idiots or Feds and pass. Fast forward to present time and they are getting rounded up and the State is getting a PR win.\n\nMoral of the story. Don't join groups where you are pressed to reveal your real identity or IP address. Feds can track that shit. If you want to plan to overthrow ZOG (or whatever you are into) do it with some type of security in mind. If you are planning on pulling some shit don't be exchanging info beforehand: just show up separately and do it. If you want to post about making bombs or bioweapons do it over something hard to trace: TOR onion sites, RetroShare over TOR or ZN over TOR.\n\nThe government is your enemy: act accordingly.",
			"added": 1579312371
		},
		{
			"topic_id": 1582876093,
			"title": "08chan limit",
			"body": "08chan hasn't been working right for me. I deleted the site and re-downloaded. Now I see a bunch of new posts. Good activity now. Not sure how long I've been running into that limit or what I missed. Just FYI for those who think 08chan looks dead.",
			"added": 1582876084
		},
		{
			"topic_id": 1583204943,
			"title": "Right and Left as the system collapses",
			"body": "People on the Right and Left are both unhappy with the system the way it is. People that lean Left, seem to participate in the \"system intensive\" path to success education→certification/licensing→ access to regulated industries and tax money. So medicine, law, education, etc.\n\nPeople that lean Right have a more entrepreneurial streak. Education is often viewed as an investment to fuel their more freewheeling “eat what they kill” economic mindset. Small business, construction, manufacturing, etc.\n\nAs the economy gets shittier both sides see the solution as being more of what they know; Left: more regulation and financial incentives/bailouts, Right: more libertarian-type reduction of regulation and bailouts.\n\nBut “creative” accounting and financial practices combined with outsourcing oversees harms the underlying economic system so that either solution is likely doomed.\n\nI’m rooting for Corona-chan and the Occupy Wall Street types.",
			"added": 1583204933
		},
		{
			"topic_id": 1610822564,
			"title": "Retroshare key swap thread",
			"body": "I'm trying out Retroshare in TOR only mode. Their initial \"bootstrapping\" chat server is down so am posting my cert here if existing users want to swap or new people want to try it out.\n\nCQEGAcGZxsBNBGADMCkBCADLKu53XbZfodm5eRrB/Z5xzxed+CZ8CfnmpF3tcpa8\nVaVANh8DEeul7fxKPrLLURglxIPJCT8U6deMmxoJmlidzGWraVqbHhZLamfI6LwW\nuaUEobjMcULiPAlak8N8t9WQCNkn2+kHL+SsqHFmRY/dLkLpTX5XV4X8xEQ57pXZ\n3QDF51PON1zHT32nvdRt4ew2d2ta2lStrZNFZJ/jJagnELtCmPZ/cpsSQFbxVjFA\nYZpRm3PJaigb7VzCZkXX38ve/lX5UWJPoUo0ZVkZ3IdvaYDs3rmRVASwcvZKRALI\nn8tdNYKLf+gs7poKnXwY6SQAVUT8crEWQwm2IdGaYYfDABEBAAHNJU1ldGFsbWFu\nIChHZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAmADMCkJEBAv\nbaBLpPYyAhkBAAD2qgf/Wz1MZcX2HuE8zJM+btbE/XgDQ2JjiorVl53tMcXN+1dt\n0WClRL6Wf1c7x4fxgek7+P4xBJUdnwZMtmWdNwmUhUE4VzOs+m04asC9eyY92fmA\nC/NSmc0KCttn/EwKB6qOAqWoKntsL3yUMEbXTyma/252YZM2FXXIcyTR4DJWvKfF\n/S+dsEM9en6QxaxJFKpWQ3XdapPaHeYIih1zqT9B27yOFQPTiuEzTXoydIKcVxCg\nVYs7X4qcn9Mac0N+uDmn+zyFS0DCebzf9CdXh1F/SWYB+v9hkcmvb5deGbix2VcG\noNVehqhKtT+ZpdmwGxzdJrEMc8qediu/MCS9l6npowgbcmx4cnJxb3c2a2lrd3d5\nZy5vbmlvbjo5ODc4BgtNeSBjb21wdXRlcgUQp0rIj0oTk6rodLdKHeVMGwcDX9a1",
			"added": 1610822553
		}
	],
	"topic_vote": {
		"1567995549_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1568062329_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1568768337_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": 1,
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1570416195_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1570819630_1DLLxLPEjC4xmHBo235fGQLC2dauvgiig6": 1,
		"1571718258_18Qiw35UQuh8sSnqksUbQQh1SGaC3HaAxm": 1,
		"1571938147_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1572654143_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1573751273_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": 1,
		"1573917795_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1573960157_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1574608682_1CYE9ryvvXCW4CJPX51T24BFD62cyrXNno": 1,
		"1576494373_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578066338_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"1578316607_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578875146_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1579391738_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": 1,
		"1584246912_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1587103405_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"1588786000_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"1589343359_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1592089664_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": 1,
		"1592140848_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": 1,
		"1611098873_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": 1,
		"1611350422_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1611693126_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": 1,
		"1612011009_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"1612049204_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": 1,
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1
	},
	"next_comment_id": 120,
	"comment": {
		"1567851023_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 1,
				"body": "You first...",
				"added": 1567851497
			}
		],
		"1567951156_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 2,
				"body": "Rewriting commit history won't effect this since it is making a separate local-only git repository. Commits won't match commits on some external site, it will just be whatever the local user decides it is.",
				"added": 1567969940
			},
			{
				"comment_id": 3,
				"body": "Ah I see what you are saying. Since the entire zite directory can be modified by the owner then they could theoretically make their own .git folder/contents and push it out as part of a site update. That should be visible as part of the recent history: it would show that someone other than the local user had done commits. But a better solution would be to keep the whole .git hierarchy outside of the zite directory. I wonder if git supports something like that. A good angle for research.",
				"added": 1567970656
			}
		],
		"1567971140_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 4,
				"body": "Sounds like a job for 08chan...",
				"added": 1567971873
			},
			{
				"comment_id": 5,
				"body": "> [reichardnixon](#comment_7_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): i guess we will find out when the screen cap gets published.\n\nSadly I don't think old-school fedposting will cut it anymore, that stuff is everywhere. You need some mass shooter to post his manifesto here before going on a rampage to really get media attention.",
				"added": 1567973865
			},
			{
				"comment_id": 6,
				"body": "Paywalled. Is there a way to read it in the clear?",
				"added": 1567975669
			}
		],
		"1567976103_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "I think that might be some subscription thing on NYT's side. Even when I follow the link from the Fox News page it gives me the same thing, FWIW.",
				"added": 1567976178
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 8,
				"body": "Too many normies who are scared by challenges to the status quo. Some say Saint Tarrant picked a pretty good target. But who is going to honk in public support of that?",
				"added": 1568158499
			}
		],
		"1568373932_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 9,
				"body": "أنا أحب لحم الخنزير! محمد حبيبتي مثلي الجنس.",
				"added": 1568400350
			}
		],
		"1568481715_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 10,
				"body": "Possibly. I've never gotten that far behind. Can you make a backup (to make sure and keep your 'data' directory) and install it over an existing installation?",
				"added": 1568485112
			}
		],
		"1568508391_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 11,
				"body": "Personally I'd set up a headless box on linux and just use SSH to connect in. SSH supports port forwarding so 127.0.0.1:43110 on the headless box can be mapped to port 4444 on your local machine. No need for UI password setup.",
				"added": 1568511722
			}
		],
		"1568557112_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 12,
				"body": "It depends on how many you are cooking for. A single person can make a large batch of some dish, say meatballs and sauce. Then just reheat a portion and make pasta fresh when they are ready to eat. Just figure out what you like to make/eat and practice making it till you are faster. Also learning to avoid measurements is a big time saver.",
				"added": 1568560527
			}
		],
		"1568563605_18ovpxcbbi1egaoeieJyxSzPDdRdpbYWsy": [
			{
				"comment_id": 13,
				"body": "Some \"clever\" network hardware like SonicWall will do this unless you switch to using Tor Bridges in config.",
				"added": 1568567581
			}
		],
		"1568749254_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 14,
				"body": "> [gitcenter](#comment_1030_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Please use either GitCenter (with a capital C) or Ivanq (my real nickname), but don't just capitalize the first letter. Anyways... [...]\n\nNoted and updated.\n\nI'm not techy enough to evaluate code. My threat model is less penetration tester and more feral raccoon. In human terms, if the milk from the refrigerator smells weird I don't take a drink just to make sure.\n\nIt sounds like the Kxo family has some disturbing interconnections. People are seeing blocklists and talk of people who don't like Jews being added to a \"list\" when checking out KxoID? That's just problematic in itself.",
				"added": 1568751907
			},
			{
				"comment_id": 15,
				"body": "> [gitcenter](#comment_1037_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Krixano has just shared KxoNet source code with me so I might continue working on it.\n\nThat could be promising. Also it looks like the script is trying to pull in vuejs.org stuff. Doesn't work when using Tor browser, they may have exit nodes blocked.",
				"added": 1568752988
			}
		],
		"1569015162_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 16,
				"body": "> [satoxyn1](#comment_113_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): If you're referring to official Zites, check https://github.com/HelloZeroNet?tab=repositories\n\nThat helps, thanks. But was thinking more broadly than just the zites there were part of the ZN project as such. Appreciate it though.",
				"added": 1569017043
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 17,
				"body": "In my mind muting is kind of pointless. Either there are few enough people for that to have an effect...and you'll run out of people to talk to. Or there are too many people and you're just trying to empty the ocean with a bucket. Plus people can just make new ids here so it isn't like Fedbook or something.",
				"added": 1569172901
			},
			{
				"comment_id": 18,
				"body": "> [randomshits](#comment_153_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): ...the 'Age of Daily Stormer' doesn't sound as toxic...  [...]\n\nWait. We'll get there :)  Probably ramping up to be more \"Age of Boogaloo,\" this time around.",
				"added": 1569189220
			},
			{
				"comment_id": 19,
				"body": "> [randomshits](#comment_154_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Oh and just an fyi, [...]\n\nThose lists look a bit out of date. Followed the ContentFilter Plugin link and it was dead. Also what do you mean by \"Matters of terrorism and cp are given much more strict treatment than a simple forum mute.\"??",
				"added": 1569204677
			},
			{
				"comment_id": 20,
				"body": "> [htgozn](#comment_265_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): Using drugs encloses you in a hugbox. [...]\n\nSome of the items in your list are not what many would think of as a \"hugbox.\"\n\nMy concept of \"hugbox\" would be muting people who I feel hold uncomfortable opinions, usually in a dismissive way: \"This user believes X. There is no merit to X. X is a total negative without value. Anyone who thinks X is wrong, stupid and possibly evil. <M>!\" See, that's a hugbox.\n\nIf I think X is evil I may be less likely to remove my exposure to that. In fact, it may be something I need to actively destroy and therefore want to know more about it so as to better attack and resist it.",
				"added": 1569269205
			}
		],
		"1569339653_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 21,
				"body": "I didn't know Brazil was bad. Redpill me on the Brazilian Question.",
				"added": 1569340000
			},
			{
				"comment_id": 22,
				"body": "> [dieinyourrage](#comment_3_1JYv14XBkng6zGFmkhkdyS3FmyvDUZgrRA): ... eventually drowning in delusion and rage.\n\nEventually?? Homie, I'm there now!",
				"added": 1569382935
			}
		],
		"1569840447_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 23,
				"body": "> [almostsoul](#comment_32_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m): Cyberpunk was relevant because the emerging spaces of critique new technology presented. This especially apparent in post-cyberpunk literature in the 90s. \n\nSee this always bugged me, the view of cyberpunk being some Big Deal(TM) literary genre. Its right up there with people talking about the ethical and existential implications of My Little Pony: Friendship is Magic. Just staaap!\n\nCyberpunk was fun and exciting. Yeah there were some social/deeper meaning but that was never special. Regular Science Fiction always had those elements, something meaty to overcome the cartoonishness of the setting. If you have a protagonist who gets visions from wires and a girlfriend that shoots neurotoxin laced needles out of her tiddies, you literally *have* to have some deeper point about individuality and how future technology impinges on human spirituality. Otherwise it just reads as stupid.\n\nAll the Cyber Punk(TM) fans just latched on to the literary aspects because otherwise they would just be enjoying something lowbrow like everybody else. They were/are avoiding their own existential horror: fun.",
				"added": 1569872790
			}
		],
		"1570025997_19AdL7EWPFiXiep63Ahacx21EibX5Khpkp": [
			{
				"comment_id": 24,
				"body": "> [qqqqqqq](#comment_7_149JsPomUWvpfHqaAPPZhdxu24FGnKVnCg): That being said, you guys do all know that by default ZeroNet logs every single IP address [...]\n\nNobody is keeping a log of my IP address on ZN. I run Tor only.",
				"added": 1570140032
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 25,
				"body": "One reason sites like Twitter and Facebook are successful is they push people into interacting. Current ZN Hello is pretty basic, just stuff you are following. But a more engaging way to set it up is to call out content that people want to interact with even if someone hasn't explicitly dug for it first:\n\nThis weeks most commented videos in KopyKate!\nNewest and most heavily seeded in ZeroUp!\nRecent and most liked posts in ZeroTalk!\nHot topics on 08chan!\n\nJust all of it right in people's faces (obviously that could be turned off if desired). But a welcome page that showcases popular content across ZN would make it feel more active and welcoming. Plus it would give incentive for people to make content that was popular enough to \"make the cut\" and be featured in that way.",
				"added": 1570243262
			},
			{
				"comment_id": 26,
				"body": "> [kusoneko](#comment_84_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5): I don't think that can be done with the way ZN works currently, as in you need to have downloaded the content to show it/call it out so... Difficult to do such a thing tbh.\n\nMaybe, but if whoever ran the \"popular content suggester\" thing did the downloading, ran some kind of automatic scraper/updater. They would just be pushing out links. If someone wanted to actually check it out then they would of course have to click the link and download the zite if they hadn't already.\n\nI'm thinking something along the lines of a pro-active search engine that keeps tabs on content on popular zites.",
				"added": 1570244684
			},
			{
				"comment_id": 27,
				"body": "> [reichardnixon](#comment_21_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): I have no idea how to find new sites on zero net unless some one posts a link.\n\n@reichardnixon Have you seen ZeroWiki yet?: http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/",
				"added": 1570248247
			}
		],
		"1570340092_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 28,
				"body": "Last time I tried Tox it made direct connections between users. Seemed like a big security hole. Has this been improved?",
				"added": 1570341672
			}
		],
		"1570425422_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 29,
				"body": "Tor was an intelligence project from the inception. This was never secret. \"Our\" glowniggers needed to hide from *their* glowniggers. So glowniggers had to build a glownigger proof system that was useful enough that lots of non-glowniggers would use it...for deniability.",
				"added": 1570426248
			}
		],
		"1570391956_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 30,
				"body": "I downloaded it, just got done watching. Verdict: pretty damn good movie. I was disheartened listening to some of the hot takes over the last few days; trying to pigeonhole the movie into some particular world view. It was a lot better than that.\n\nBeautifully shot (from what I can tell from the crappy cam copy I got). In a lot of ways it felt like a throwback to movies from earlier decades that were more comfortable working with deep or depressing themes. It starts very dark but keeps ramping up till the end. It sucked me in and by the end had me smiling right along with Joker.\n\nAnd what about people complaining that it is too sympathetic to the bad guy? Even the bad guy gets to be the hero of his own movie.\n\nBullies get payback\nBoomers get the pillow\nBackstabbers get front-stabbed\nDick-swinging cops get a beat down\nSmug, insulated assholes get shot\n...and our \"hero\" gets his coronation.\n\nAll the complainers on the internet seem really silly now. Even some people I liked didn't get it. They had to get upset and try to point fingers \"Oh, Joker isn't alt-right he is antifa!!\" Puh-leez. It's a movie dumbasses, stop projecting your own hangups. But sadly, some people who can't appreciate great films will see this and their own prejudices will trigger them. What will they get out of the movie?\n\nThey'll get what THEY FUCKIN' DESERVE!!\n\n10 out of 10. Would boomer-smother again!",
				"added": 1570431224
			}
		],
		"1570496389_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 31,
				"body": "> [zeronetuser3541](#comment_5_1ATpyKRza3N49rrjJFPznrUG9BN1i6e6Uq): Why would you not abandon your real identity and just assume the fake permanently? I see no advantage to your real identity\n\nMy real identity is actually me...and I'm nostalgic. Fake ID me was not doing anything really awesome anyway. I don't like my industry so I'm already planning to start over mostly blank anyway. If this whole situation wasn't illegal it would make a great bio page for reinvented real me. :)",
				"added": 1570497044
			},
			{
				"comment_id": 32,
				"body": "> [robione](#comment_322_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Join the CIA\n\nSmoked weed in the past. That is a deal killer for glowniggers. They don't hire actual criminals. Which sadly I am.",
				"added": 1570498425
			},
			{
				"comment_id": 33,
				"body": "> [robione](#comment_324_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Only if you say so. ID is clean. Just pass the poly.\n\nEhh. I know their requirements. If they don't want me then I don't want them. Even if I could pass their polygraph (and wanted to, which I don't) I wouldn't join. I'm not someone who would end up on the CIA memorial wall.\n\nBesides, they don't want me. They want Chad McChadderson, star quarterback and math whiz. If they want him to lie they will train him to lie.\n\nEdit: and how did we descend into CIA stuff anyway? I'm not even into that.",
				"added": 1570518210
			},
			{
				"comment_id": 34,
				"body": "> [robione](#comment_325_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Do you know how to build an ecommerce website?\n\nYeah could do that. But don't know what I'd have to sell. Would like to have my own products if I go that route, otherwise I'd just be kind of a bottom feeder with all the other sellers of Chinese drop shipped products. If I'm not building a brand then it seems a bit pointless.",
				"added": 1570558102
			},
			{
				"comment_id": 35,
				"body": "> [robinofdeath](#comment_17_1367VTupfj886Uk39iT4RjiSmrakiDYTga): whats wrong with keeping the fake id?\n\nJust prefer to be using my real name for everything. Also I haven't been really maintaining the fake, just enough to keep the work side going. Day to day I'm using my real for everything already; everything in my wallet is real name. And yes I'm careful to not drop my wallet at work. Whoever found it would have a real surprise. :)",
				"added": 1570567582
			}
		],
		"1571246742_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 36,
				"body": "I'm not really seeing the difference between this and RS. Better UI? I agree that RS's UI isn't great but that seems a bit excessive for a fork like this.",
				"added": 1571261732
			}
		],
		"1571488787_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 37,
				"body": "Not lately but I have had people trying to brute force SSH passwords before, it kind of looks like that. I solved it by turning off password-based login and only using keyfiles. The hackers got the message pretty fast.",
				"added": 1571503263
			}
		],
		"1571760514_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 38,
				"body": "Not a lot of people doing interesting stuff in commercial IT. Demand has caused a lot of people to get \"on-boarded\" that shouldn't have been. Behold Microsoft and their certification \"badges.\" People that measure their skills in \"badges\" dispensed by a corporation are just about who you think they might be.",
				"added": 1571787411
			}
		],
		"1571879273_173u2WzfNziqEAAY9WqPzAZSqxfHQqs1FC": [
			{
				"comment_id": 39,
				"body": "Funny thing is the top of the site looks like a regular online pharmacy but scroll down and it is all just straight street drugs.\n\n\"Uh, yes, I've been stressed at work. My doctor prescribed the Panamanian Devil's Crotch and high-powered blotter acid.\"",
				"added": 1571879780
			},
			{
				"comment_id": 40,
				"body": "> [edgelordofdecent](#comment_197_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): I love the site. It looks all professional then it just sells street drugs. This shit is kind of cool but something is glowing brighter than a lightbulb.\n\nFact A) OP choose \"Pill Cosby\" as a username...get it? lol. Fact B) OP didn't post an affiliate link, just a straight URL. An actual spammer would want to get \"credit\" on a real site. Not sure about glowies but seems probable that someone is having some sort of game here.",
				"added": 1571895251
			}
		],
		"1572348073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 41,
				"body": "I don't see \"Tilde servers.\" What would that even be? He does list an email address: vanevander(at)mayvaneday.art",
				"added": 1572372619
			}
		],
		"1572732591_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_1183_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's under UK jurisdiction, if I remember right.\n\nJust checked, that is true. New info for me. Wouldn't that mean they would need to comply with UK/EU hate speech laws?",
				"added": 1572733642
			}
		],
		"1572829588_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 43,
				"body": "The smart people used to be into computers when those were a developing thing.\n\nNow days those kind of people are into electronics, micro controllers, etc.",
				"added": 1572831137
			}
		],
		"1573361965_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 44,
				"body": "I usually use thepiratebay.org or limetorrents.info. Depends on the author, some will have book bundles under their name if popular enough.",
				"added": 1573362543
			}
		],
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": [
			{
				"comment_id": 45,
				"body": "Zite hosting is silly OP but I wonder about \"automatic seeding hosts\". How much could one charge to automatically seed (24/7) all of a customer's ZN data? So everything they insert: forum posts, zites, files, would always be available. Would be great for KopyKate videos, so many dead links.",
				"added": 1573764213
			},
			{
				"comment_id": 46,
				"body": "> [styromaniac](#comment_1251_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're not actually believing the guy will be legitimate, are you? [...]\n\nNo. But it did jog my brain into thinking about what a \"ZeroNet hosting provider\" might actually do.",
				"added": 1573764747
			},
			{
				"comment_id": 47,
				"body": "> [zerohostoffical](#comment_1_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT): Exactly the point. Plus it helps you jump start your seeds you to remove yourself as a seeder earlier on.\n\nSounds interesting. Is there a Zite yet? With price, features, etc.",
				"added": 1573790765
			}
		],
		"1574367198_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 48,
				"body": "> [undisclosed](#comment_68_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Why do you think anyone cares if a manifesto is genuine or not OP?  It's all theater anyway.\n\nMainly for the possibility you mentioned: quickly produced fake manifestos.",
				"added": 1574391719
			}
		],
		"1577103091_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 49,
				"body": "Did somebody say no racism? :(",
				"added": 1577122675
			}
		],
		"1578066338_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": [
			{
				"comment_id": 50,
				"body": "Great service, kudos!. Are you what some call a \"general practitioner\" or do you have a certain specialty?",
				"added": 1578113635
			}
		],
		"1578202687_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": [
			{
				"comment_id": 51,
				"body": "I think that compared to darkweb markets on TOR there is a bit of an uphill climb to getting something similar running on ZN. TOR darkweb users are familiar with that system and there is a momentum there. Professional markets on ZN would be a welcome addition but would suffer from lack of exposure at least initially. However my opinion is that ZN would be more secure in the long run for market/escrow operators due to not needing to run a 24/7 system on an onion site.\n\nAlso one needs to realize that all zite code is public and people can just \"clone\" a setup that they like and run their own version. Spending lots of money of zite development would lead to copycats using whatever code they wanted, and that would need to be taken into account.",
				"added": 1578204733
			},
			{
				"comment_id": 52,
				"body": "Some posters here are out of touch. Most market makers will just pay people to develop what they want. They are drug dealers, they have money.\n\nSilk road is old news, internet dark markets are still a thing. Check out the forums on Dread: http://dreadditevelidot.onion",
				"added": 1578264146
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 53,
				"body": "He \"backed down\" because a) no American causalities from the Iranian rocket attack and b) Iran messed up and shot down the Ukrainian airliner. Don't stop your enemy when they are busy hanging themselves.",
				"added": 1578626099
			}
		],
		"1578699066_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 54,
				"body": "ZN is mostly nerds, privacy activists and racists atm. Doubt there is any real muthas' here right now (not that I'm unsympathetic). Have you done research on Dread and OpenBazaar yet?",
				"added": 1578701256
			}
		],
		"1578779457_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 55,
				"body": "Sucky situation. Parents that actually charge rent to their kids are strange. Not that I'm ragging on your parents...",
				"added": 1578792083
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [
			{
				"comment_id": 56,
				"body": "Best solution: have so may kids that with deductions you don't pay taxes. Save the white race and avoid taxes at the same time.",
				"added": 1579202256
			}
		],
		"1579524634_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 57,
				"body": "In my opinion BDS is supported by \"Palestinians\"/Iran. It isn't just about criticizing Israel but supporting other Semites in the area. BDS would have the US paying reparations for supporting Israel. That doesn't work for me. It feels like some other intra-brown people conflict. I don't support BDS any more than I support Israel. Wish 'em both luck...over there...away from the US and our money.",
				"added": 1579555183
			}
		],
		"1579312378_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 58,
				"body": "Yup, The Base is run by Feds. Semi-confirmed.\nhttps://bigleaguepolitics.com/report-federal-asset-ordered-terror-attack-by-group-allegedly-conspiring-to-storm-virginia-capitol/\nUpside in this instance is my Fed-radar seems to have been accurate.",
				"added": 1579587054
			}
		],
		"1579763230_1JYGp4onxvJxFQovjVFrxjC4hpSSDzXEzi": [
			{
				"comment_id": 59,
				"body": "CV?",
				"added": 1579763367
			}
		],
		"1579803165_13HeCqSo3hr5Ady7E3fv17FQ8Pyi1VeeY7": [
			{
				"comment_id": 60,
				"body": "It is run by nofish I believe.",
				"added": 1579803728
			}
		],
		"1580020434_1Q3oCEsSUjRyGDFVTvS3Kq8qdp6TVCoGf6": [
			{
				"comment_id": 61,
				"body": "Seems pretty good when I used it. Probably the best use case is when you have a group of people who need their own kinda-private network. With the Tor integration your \"friends\" can even be people you don't know in real life.",
				"added": 1580022464
			}
		],
		"1580063953_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 62,
				"body": "Is your ISP already blocking Tor? You can set ZN to use Tor for everything, including tracker connections. Should bypass a tracker block.",
				"added": 1580070806
			}
		],
		"1581969527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 63,
				"body": "Why are we assuming this is a bad thing. We already know ZN is edgy what is the problem about taking that to a short film?",
				"added": 1581978246
			}
		],
		"1582173702_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 65,
				"body": "Doubt it. They recently got kicked off Twitter for spreading the \"rumor\" that Coronavirus was made in a lab. More mainstream media started reporting the same thing a couple of weeks later. Zerohedge is still banned from Twitter. :(",
				"added": 1582222883
			},
			{
				"comment_id": 70,
				"body": "> [aeldg7pg4b](#comment_26_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz): I have that paper from India's CDC. It's real. They make no claims other than 5ea unusual gene sequences. [...]\n\nAre you referencing the report where there were HIV sequences in Coronavirus? I believe that. My \"doubt it\" was in reference to Zerohedge being controlled by CIA and etc. If ZH was controlled opposition why would they be getting kicked off Twitter? I like ZH's Coronavirus reporting. Am I incorrect to feel that way?",
				"added": 1582599223
			}
		],
		"1582356450_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 69,
				"body": "Interesting. Any patterns in the people who disappeared?",
				"added": 1582356980
			}
		],
		"1582876093_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 71,
				"body": "> [kleio](#comment_35_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): Worth pointing out here is that the trackersfile mentioned is Syncronite.\n\nSyncronite? I'm running TOR only but am not familiar with the current ZN tracker best practices.  I'm a bit suspicious since it isn't the default way ZN works. Run down??",
				"added": 1582955834
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 72,
				"body": "A combination of self-respect, low sexual urge and pickiness. Many guys will do just about *anything* to get/keep a woman, really humiliating.  Many guys have surprisingly low standards: tattoos, single moms, argumentative women, etc. Society expects this behavior. Society does not like it when I don't fall in line.\n\nI'm not MGTOW and think relationships are fine but will have to pursue it in my own way. Possibly kidnapping....",
				"added": 1583983720
			}
		],
		"1584169815_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 73,
				"body": "Just FYI, using Tox is \"self doxing\" practically. The connections are encrypted but it uses direct IP connection between friends. So if I was on Tox (I'm not) and we connect then we reveal our IP addresses to each other.",
				"added": 1584201950
			},
			{
				"comment_id": 74,
				"body": "> [pexo](#comment_194_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): Well yeah, that's what p2p means, the same is true for BitTorrent or  ZeroNet. And like ZeroNet you can make tox anonymous by using it through tor.\n\nI use both BitTorrent and ZeroNet through tor. I have to get the torrent seeders without a tor proxy but can then switch it on and start the download. I've always used ZN with tor. Tor all the way is the best way. :)",
				"added": 1584208956
			}
		],
		"1584215413_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 75,
				"body": "> [xplosive](#comment_76_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): I do not know why ZeroMail have sent my messages to another account (nofishes). [...]\n\nnofish is the main (I guess) ZN developer. He also coded zerotalk so controls the configuration that allows users more space. I sent him a message a few weeks ago. Still no luck.",
				"added": 1584235865
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [],
		"1585516116_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [],
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 79,
				"body": "Opensource isn't really communism as people work on it pretty much when/how they want. Corporations love communism/open source as long as they can get *you* to pay for it. The \"I don't use open source because communism\" is just dumb propaganda for plebs. O.S. powers all those subscription firewall/appliance things they want to sell you nowadays; they just get some H1B visa holders to write interfaces/wrappers around it to conceal it's nature as much as possible. SSH in to get to a command prompt on those things and type \"uname -a\" to get the real story.",
				"added": 1588724844
			},
			{
				"comment_id": 80,
				"body": "For me:\n\nCommunism: Elite group exploits masses for their own comfort/status, deflects with fancy ideological talk.\nCapitalism: Elite group exploits masses for their own comfort/status, deflects with promising access to future higher comfort/status for said masses.\nSocialism: People that aren't awesome enough to exploit with Communism or Capitalism, fence sit and service their own comfort/status without promising too much.\n\nSo, @blurhy, what is your definition of communism?",
				"added": 1588793122
			}
		],
		"1588888253_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 81,
				"body": "Same deal here. Have ZeroMail-ed nofish a few times with no luck. Was thinking about asking if there is a way to delete my old posts to clear up room. Some of mine are far back and I can't find them from the ZeroTalk main page.",
				"added": 1588891495
			},
			{
				"comment_id": 82,
				"body": "> [turtles11181](#comment_3_1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M): The size limit on every zite is set by the user. You can do things on your own you know, you don't need to wait for someone else to do it for you.\n\nBut this isn't the zite size limit. This is the \"USED: ??k/50K\" indicator to the bottom right in the text entry areas for ZeroTalk.",
				"added": 1588900977
			},
			{
				"comment_id": 83,
				"body": "Basically I can delete individual posts and it frees up some of my 50k: my used stat goes back down. If I could find all of my old posts on ZeroTalk I could delete them. Thought there might be an easy way to mass delete my posts to free room.",
				"added": 1588970470
			}
		],
		"1591039498_1H6ZycKwvxf9U55ei8jXpaanmxDEK9Tbp": [
			{
				"comment_id": 84,
				"body": "There is 08chan \"the semi-official 8chan darknet bunker.\"\n\nhttp://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/\n\nIs that what you were meaning?",
				"added": 1591169084
			}
		],
		"1591995772_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 85,
				"body": "https://mod.haxor.fi/   -  web based mod player and collection of mods (click \"load song'])\nhttps://modarchive.org/   -  large mod music archive",
				"added": 1592018921
			},
			{
				"comment_id": 86,
				"body": "> [opisafag](#comment_37_1FRms99LhV6SmTBPxkNbr99GXGjf8na3k2): haxor.fi doesn't work for me\n\nWell crud. It is down. Worked yesterday.",
				"added": 1592180711
			}
		],
		"1592140848_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 87,
				"body": "The cops are shitty (though I think they are necessary in some capacity). I blame white people (my people). Here is why: whenever a white person has some negative interaction with the police *other white people* will assume they are in the wrong. So \"Well he shouldn't have been acting suspiciously!\" or \"Be a good person and that won't happen.\" or \"Well, they shouldn't have been breaking the law...that's what you get! <hurr durr>.\" When a white person responds like that to black people they flip out, not knowing that they behave the *exact same way* when the victim is white.\n\nIt has been infuriating trying to get through my fellows thick, white skulls for years that the police are a problem. Many have taken a big drink of the \"Officer Friendly\" Kool-Aid. Since Trump's election things might be changing and whites are starting to notice that cops often are enforcers for the crappy \"elites.\" \n\nFix it? Not sure. The legal system is pretty fucked but with income from fines police departments have an economic incentive to pursue bullshit against citizens: and the poorest citizens (of any color) are the least likely to be able to fight back and are the most profitable targets.",
				"added": 1592181586
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 88,
				"body": "08Chan: http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/",
				"added": 1592598290
			}
		],
		"1593864721_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 89,
				"body": "I had issues if posting from TorBrowser. Had to post with a regular browser. I could then view with TorBrowser like normal.",
				"added": 1593959261
			}
		],
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 90,
				"body": "> [edgelordofdecent](#comment_674_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D [...]\n\nHow is it dead? Works fine for me.\n\nAnyway, obviously we all need to be running ZN in tor only mode. I did that from the get-go. Even did my id registration through a proxy. I'm paranoid like that.",
				"added": 1605654334
			},
			{
				"comment_id": 91,
				"body": "> [sturmwaffle](#comment_6_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE): Hm. There doesn't seem to be a /pol/ section on this website. The rest doesn't seem that interesting.In any case, we need more of our people to come to zeronet websites, otherwise we'll never be able to fight back against censorship.\n\nThat is the first time I've seen that zite. But, yes, that one doesn't have a /pol/. I was under the impression that the one in my last reply (beginning 1DdPH...) is the real 08Chan and it does have a /pol/",
				"added": 1605769925
			}
		],
		"1605760904_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 92,
				"body": "I started out with \"Machine Learning, Data Science and Deep Learning with Python\". It is a Udemy course but is available on Bittorrent. Seems to be a good overview for beginners. Doesn't go really deep but I thought it was useful.",
				"added": 1605770274
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 93,
				"body": "> [kristof](#comment_4_13fsoiid6fkGt5ANKJWud9UYz2p2nCg4Sr): If you want a messenger really secure : https://briarproject.org/\n\nLooks interesting though I echo reichama's concern. Do people actually use it? I'm not seeing any public users that I could add, like I can with Telegram.\n\nAlso it looks like it only connects via TOR, which would be great but it doesn't seem to mention running TOR on my phone. So using public nodes or something?",
				"added": 1610819917
			},
			{
				"comment_id": 95,
				"body": "> [winder](#comment_2_1GEWPYr9ovEhKY1HxYbc2oZ6cP3h4SvTUv): Hi，could you give me an apk link to download?\n\nThey have an APK download page on their site: https://briarproject.org/installing-briar-via-direct-download/\n\nIf anyone wants to try out Briar here is my contact link: briar://aarh7llh3jas7azqasvxmlmvkjjbidpdoyk5xczlz44qm4ah72mcy\nNot sure if that is a one-shot link or if it can be reused by multiple people.",
				"added": 1610852679
			},
			{
				"comment_id": 110,
				"body": "> [sword000000](#comment_91_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): 1.Briar is currently the highest standard of secure communications\n\nGreat summary. I've been messing with Briar but not sure what the best way to simulate Telegram's groups is. It looks like users have to both swap keys directly to even connect, which makes bootstrapping a group with people only connecting over telegram harder. There are forums/groups but it looks like (and I could be wrong) the person who started the group needs to be online 24/7 to act as the group's hub.",
				"added": 1611333598
			}
		],
		"1610822564_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 101,
				"body": "I added papull, rolouzis and alex2030100. I'm getting unknown connections so if somebody has added me you may need to also post your key, either here or in ZeroMail",
				"added": 1610990752
			}
		],
		"1610913965_17DwXt69rTzQ2mdL3LPLSW9rfNWNQgKcxt": [
			{
				"comment_id": 96,
				"body": "I've been running it for a couple of days. Running it Tor-only. My cert:\n\nCQEGAcGZxsBNBGADMCkBCADLKu53XbZfodm5eRrB/Z5xzxed+CZ8CfnmpF3tcpa8\nVaVANh8DEeul7fxKPrLLURglxIPJCT8U6deMmxoJmlidzGWraVqbHhZLamfI6LwW\nuaUEobjMcULiPAlak8N8t9WQCNkn2+kHL+SsqHFmRY/dLkLpTX5XV4X8xEQ57pXZ\n3QDF51PON1zHT32nvdRt4ew2d2ta2lStrZNFZJ/jJagnELtCmPZ/cpsSQFbxVjFA\nYZpRm3PJaigb7VzCZkXX38ve/lX5UWJPoUo0ZVkZ3IdvaYDs3rmRVASwcvZKRALI\nn8tdNYKLf+gs7poKnXwY6SQAVUT8crEWQwm2IdGaYYfDABEBAAHNJU1ldGFsbWFu\nIChHZW5lcmF0ZWQgYnkgUmV0cm9TaGFyZSkgPD7CwF8EEwECABMFAmADMCkJEBAv\nbaBLpPYyAhkBAAD2qgf/Wz1MZcX2HuE8zJM+btbE/XgDQ2JjiorVl53tMcXN+1dt\n0WClRL6Wf1c7x4fxgek7+P4xBJUdnwZMtmWdNwmUhUE4VzOs+m04asC9eyY92fmA\nC/NSmc0KCttn/EwKB6qOAqWoKntsL3yUMEbXTyma/252YZM2FXXIcyTR4DJWvKfF\n/S+dsEM9en6QxaxJFKpWQ3XdapPaHeYIih1zqT9B27yOFQPTiuEzTXoydIKcVxCg\nVYs7X4qcn9Mac0N+uDmn+zyFS0DCebzf9CdXh1F/SWYB+v9hkcmvb5deGbix2VcG\noNVehqhKtT+ZpdmwGxzdJrEMc8qediu/MCS9l6npowgbcmx4cnJxb3c2a2lrd3d5\nZy5vbmlvbjo5ODc4BgtNeSBjb21wdXRlcgUQp0rIj0oTk6rodLdKHeVMGwcDX9a1",
				"added": 1610919810
			},
			{
				"comment_id": 97,
				"body": "My only issue with Tox is that it uses direct ip connections between peers (or did last time I've used it), so it basically leaks a person's identity.",
				"added": 1610979726
			},
			{
				"comment_id": 99,
				"body": "> [789hello](#comment_26_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL): You should try latern or shadowsocks mate .Set out the prefix proxy .\n\nI've used SocksCap in the past to force apps to use Tor. Not an expert on that stuff though.",
				"added": 1610980434
			},
			{
				"comment_id": 100,
				"body": "> [789hello](#comment_28_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL): sockscap is dead and don't use it for anony connect.\n\nYeah it has been a while since I've messed with it. Too bad since I trust the Tor network more than some other things that are out there. An app which just pipes data through Tor seems more secure than some app that uses it's own homebrew method. Same thinking about VPN providers, just don't trust them.",
				"added": 1610981986
			},
			{
				"comment_id": 112,
				"body": "> [sword000000](#comment_98_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): This is only the case if you are already connected with that other person. If you are not connected, your IP is cloaked by the Tor network.\n\nThat may be a new feature. When I tried it a couple of years back it was totally unaware of Tor. I had to do all kinds of strangeness to make it work over Tor. In fact I think the initial setup wouldn't work over Tor at all from what I remember.",
				"added": 1611513140
			},
			{
				"comment_id": 113,
				"body": "@snahpanon I added you",
				"added": 1611721548
			}
		],
		"1610974197_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 98,
				"body": "If all you are wanting to do is not trigger antivirus then 7-zip's built in encryption should work. Plus it is open source for whoever wants to unpack/decrypt it.",
				"added": 1610980132
			}
		],
		"1611017756_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg": [
			{
				"comment_id": 102,
				"body": "Does it say something like \"queued for X minutes\"?",
				"added": 1611019667
			}
		],
		"1611157835_1P49qK814LXkWtXWu9PvWEwDQC7iDagpGV": [
			{
				"comment_id": 103,
				"body": "> [quantumkitty](#comment_559_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Free trade helps spread democracy and world peace. [...]\n\nI disagree with that. That was the theory when people started moving manufacturing to China: that free trade and economic pressure would force democratic reforms there. Turns out giving assholes money doesn't pressure them into being decent, it just makes them assholes with money.",
				"added": 1611175324
			},
			{
				"comment_id": 104,
				"body": "And what are democratic reforms anyway? Allowing people actual democratic voting while giving corporations tons of money in the process just lets corporations and special interests game the system to their benefit. You end up with the shitshow we have here, where corporations bow to China and import cheap foreign labor and call anyone who has an issue with that racist.",
				"added": 1611175762
			},
			{
				"comment_id": 105,
				"body": "> [radiator](#comment_44_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): Of course. the commie reveals himself.\n\nA *real* commie would at least support the rights of workers wherever they are. Are we talking about IPhone manufacturers in China with suicide nets or their subcontractors in India not paying employees salary until they revolt and wreck the factory? What ever happened to Workers of the World Unite?\n\nNot having US workers compete with foreign \"scabs\" used to be a leftist position, strong unions and all that. Now its just muh-White Supremacy and social justice. True leftists/Communists have been effectively kneecapped. Same thing on the Right. Both sides just serve their kleptocrat masters.",
				"added": 1611176898
			},
			{
				"comment_id": 106,
				"body": "> [quantumkitty](#comment_566_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): So you admit that China is capitalist, and not communist? Interesting. [...]\n\nOh yeah. They have, as they say, communism with \"Chinese characteristics.\"",
				"added": 1611189524
			},
			{
				"comment_id": 107,
				"body": "> [jager](#comment_44_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): Companies who literally build their wealth on controlling your behavior have seen their stock increase by at least 40% during this period.\n\nRight, but some of this is in my opinion \"scared money\" racing to what they think is the safest harbor. You have some companies like Uber who run at a loss and can only afford to do so because of their rising stock prices. At some point that bubble is going to pop, or try to, before our rotten politicians (of either party) decide it would cause too much economic devastation and declare it \"too big to fail,\" and print money to keep their stock propped up.\n\nIt is a real sorry situation and will end badly.",
				"added": 1611189962
			}
		],
		"1611192483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 108,
				"body": "> [aim64c](#comment_63_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): A company I work for uses quite a few industrial cutting lasers.\n\nAh a fellow manufacturing person. IT integration here. A couple of years back a shop I worked at used Trumpf TruLaser cutters. I shudder to think what it would take to retrofit one of those things to open source controllers. The CAM software for those has pretty advanced output.\n\nThe issue is that many companies I am familiar with don't really want to pay their people much. And they *really* don't want \"experts\" around who's knowledge makes them hard to replace and who have leverage because of that. There are some good places to work but some crappy ones as well.\n\n\"Money people\" want cheap, easy to swap out laborers. Their pursuit of this has the effect of making it difficult to plan a future in that type of career. And our educated \"betters\" don't want to be exposed to that level of uncertainty, they are educated professionals after all. They live in fear of getting their hands dirty with practical work because they know how those people are treated.",
				"added": 1611199620
			},
			{
				"comment_id": 109,
				"body": "> [aim64c](#comment_65_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): Somewhere along the line, something changes about a company - and I find it's usually after the person who started the business gives up direct control \n\nYeah that happened at that one shop I was working at: the founder died. His kids were nice but not really the steely-eyed entrepreneur he was.\n\nOne thing I think may be driving some of the hostility is \"elite overproduction,\" coined by Peter Turchin. Basically too many elites and not enough elite positions. While tradespeople are stressing about outsourcing and immigration the higher-ups are stressing about all the other educated people they are in competition with. Makes them toxic and back-stabby.",
				"added": 1611207770
			}
		],
		"1611356502_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [
			{
				"comment_id": 111,
				"body": "A search engine of onions accessed from active TOR relays:\nhttp://gimpydtor2g4wfelfttr5lak25uzvtndfn7gbjq6alft32wxkiqc34yd.onion/",
				"added": 1611366013
			}
		],
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": [
			{
				"comment_id": 114,
				"body": "You could always make a WSB board on 08chan: http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/",
				"added": 1611799618
			}
		],
		"1612067157_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 115,
				"body": "Bunches of stuff on ZN in general is too sketchy to host. I have set my node to Tor-only mainly for this reason. Also keeping ZN and Tor Browser together in an encrypted volume. But I'm paranoid like that.",
				"added": 1612069170
			}
		],
		"1612141666_16k8inBJAVx1mvAyEES8eSMKywbGXNFTZ7": [
			{
				"comment_id": 116,
				"body": "Maybe I'll regret asking this but: buy what data?",
				"added": 1612142803
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 117,
				"body": "Also look up the CCR5-Delta32 mutation. It is more common in Whites who's ancestors went through the Black Plague. It can protect (partially) against that and also HIV (again, partially). One of the big reasons blacks may be hit harder by COVID is a result of fewer of them having that mutation.",
				"added": 1612419756
			}
		],
		"1612546234_1Phd1v4EgBWqCeAjGD7gtspkpFL8Z6GbkP": [
			{
				"comment_id": 118,
				"body": "I trust Lindell's sincerity but I'm got some questions. Where are they getting those MD5(?) hashes of when the votes changed? What are they even hashes of?\n\nEven if they are hashes of some \"smoking gun\" looking data, what is the chain of custody on that data? Just because you have a hash/\"fingerprint\" of a particular dataset doesn't mean it is authentic.\n\nAlso, how in the world did they get network monitoring capability around the voting machines?? Government agencies have that kind of access but they also have hardware support in the network operation centers. It isn't just some super special NSA software that anyone can run on their own computers.",
				"added": 1612650828
			}
		],
		"1612673874_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 119,
				"body": "The main file, I believe is users.json in the data directory. At one time I experimented with how much I had to save if I only wanted to backup my id. I don't really remember what I found out, and it may have changed since that was a few versions ago. If you have saved your id correctly and restore to a blank ZN install Zeromail should repopulate from the network. Some experimentation might be good.",
				"added": 1612677879
			}
		]
	},
	"comment_vote": {
		"187_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"171_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"188_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"107_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1035_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"121_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"1073_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"7_1DgsQGyxp1NPfxDHSUs3Efj8jPvfrGsYyd": 1,
		"52_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"121_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"218_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"202_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"254_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"32_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"39_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"24_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"20_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ": 1,
		"19_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ": 1,
		"10_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"274_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"66_1APZQJTjc6VivR8kW2YDfaPUFkx8vy43o8": 1,
		"442_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"17_1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT": 1,
		"170_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"197_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"14_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"71_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": 1,
		"1270_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"4_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": 1,
		"2_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"3_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"178_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"297_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"57_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"425_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"453_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"2_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": 1,
		"53_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"330_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"81_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"504_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"42_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"20_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"81_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"33_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"675_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"16_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC": 1,
		"96_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"38_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz": 1,
		"493_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"997_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"181_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_1GbAD8KRx8aHKRE4PZs8pT4xPVLUfrGMRc": 1,
		"26_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"9_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"7_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"10_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": 1,
		"27_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"535_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"457_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"518_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"519_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"78_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"74_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"34_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"79_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"72_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"15_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"11_14VqoVEkT68vis7i7gsKUqkDzKgDnVRA5Q": 1,
		"8_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": 1,
		"22_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": 1,
		"497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"13_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"6_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"2_1BhTd1ppRKVisQbCFA55Y3et5m8s9TsZr4": 1,
		"7_1HQ4quWYimR8MAAwvV7b8q8S1x5JebWcjp": 1,
		"57_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"2_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": 1,
		"4_13fsoiid6fkGt5ANKJWud9UYz2p2nCg4Sr": 1,
		"1_1mfioaRSaLiQMoBe3KsidCvexP3gRocg6": 1,
		"13_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2": 1,
		"18_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"26_1EQgeyAy9uQj8GCkPm7ha3jFdrj8Fz8pjL": 1,
		"3_1AY6jjpjDUdwjYSdDcKsWBdbS6rqKDBPMm": 1,
		"7_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": 1,
		"20_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": 1,
		"51_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"2913_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2914_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"44_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"567_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"46_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"63_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"65_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"4_174K6TcAsHBzCgA4Fqq9duYKdNaFPtSSUf": 1,
		"67_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"91_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"40_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT": 1,
		"10_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP": 1,
		"2_12t1vW5XuyAByGyqGYwhiZsusmnyKKwqfM": 1,
		"10_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": 1,
		"2_18VHvh6VPsP3eGRrbWGyzP2L1vkfBM3tDY": 1,
		"1_18MUc7bD3LDUQobuKHzmVeDeS4qE7wtoDe": 1,
		"16_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"10_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"28_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1
	}
}