{
	"next_comment_id": 7,
	"comment": [
		{
			"comment_id": 1,
			"body": "[ИМХО, конечно]\n\n>Копилефт лицензии, в частности GPL нарушают принцип 0. С этих принципов весьма заметно сходство с проприетарными лицензиями.\n>0 Доступ к информации - неотъемлемое право человека.\n\nЩито? Как копилефт мешает *получить доступ* к информации? Можно поконкретнее и с примерами? \n\n> Предложение. Использовать знак 〈c〉 или \\ вместо (с) в своих работах, если понимаете авторское право именно так.\n\nЧто вообще ничего (юридически) не означает, да и мало кому известно. А не лучше-ли использовать свободные лицензии, чтобы ясно дать понять о правилах распространения? Creative Commons, Разлицензия и т.д. чем не угодили?\n\n[Снова напоминаю, что ИМХО]",
			"post_id": 50,
			"date_added": 1475837061
		},
		{
			"comment_id": 2,
			"body": "[Напоминаю, что IMHO]\n\n> Копилефт лицензии требуют вирусности на производном продукте. Если это не соблюдается, это нарушение лицензии.\n\nЭто и так понятно. Вопрос в том, *как именно* это затруднит доступ к информации?\n\n> почти отказ от авторства\n\nРазлицензия и CC-0 этому соответствуют, но если (внимательно) посмотреть на другие лицензии линейки Creative Commons, то ви таки заметите, что они созданы для сохранения авторства и контроля за использованием произведений, чего не позволяет Общественное Достояние. Только у CC-0 нет пункта \"Attribution\" - указание авторства, не говоря уже о более ограничительных лицензиях CC.\n\n> купив бумажную книгу с копирайтом, человек может быть уверен, что книга распространяется так, как того хотел автор. А без копирайта, значит просто платит за бумагу. Ставить копирайт в противном случае же, это мошенничество\n\nПубликовать по PD - плохо, ибо отказ от авторства; публиковать под авторскими ограничениями - тоже плохо, ибо \"мошенничество\". Тебе не угодишь.",
			"post_id": 50,
			"date_added": 1476012686
		},
		{
			"comment_id": 3,
			"body": "> CC-BY «Attribution»\n> Эта лицензия позволяет другим распространять, редактировать, поправлять и брать за основу ваше произведение, даже коммерчески, до тех пор пока они указывают ваше авторство. Это самая разрешительная из предлагаемых лицензий. Рекомендована для максимального распространения и использования лицензированных материалов.\n\nЧем не лепота? Копилефта нет, отказа от авторства нет. ",
			"post_id": 50,
			"date_added": 1476013023
		},
		{
			"comment_id": 4,
			"body": ">Вот есть моя работа, я хочу продавать с сайта, но не хочу чтобы кто-то ещё имел возможность продавать.\n\nCC-BY-SA-NC - То же самое, но запрещает использование в коммерческих целях.",
			"post_id": 50,
			"date_added": 1476055914
		},
		{
			"comment_id": 5,
			"body": ">не хочу чтобы кто-то ещё имел возможность продавать\n>мне не нужен запрет использования в коммерческих целях\n\nСам себе противоречишь. \n\nUPD: Теперь я, кажется, понял. Думаешь, что после применения лицензии CC автор сам попадает под ограничения? Нет,  исключительные права остаются, автору нужно соблюдать лишь некоторые ограничения (всех не помню) - однажды применив лицензию её нельзя поменять; и нельзя лишать уже предоставленных прав, пока соблюдаются условия лицензии.",
			"post_id": 50,
			"date_added": 1476063543
		},
		{
			"comment_id": 6,
			"body": "> - Лицензии Creative Commons являются неисключительными. Правообладатель может разрешить использование своего произведения по лицензии Creative Commons и после этого заключить другой отдельный, неисключительный договор с кем-либо ещё, например, в обмен на деньги.\n\n> - Лицензии Creative Commons имеют силу в течение всего времени действия полученных прав (в большинстве стран — 70 лет с момента смерти автора). Если работа однажды лицензирована, то её лицензия уже не может быть аннулирована впоследствии. Нельзя запретить кому-то, кто использует произведение согласно лицензии, продолжить её использование. Правообладатель может прекратить распространение произведений по лицензиям Creative Commons в любое время, но те копии, что уже существуют, нельзя будет изъять из обращения и прекратить создание всё новых копий по лицензии Creative Commons.\n\n> - Каждая лицензия: сохраняет авторские права автора произведения; сообщает, что добросовестное использование другими людьми и права свободы выражения не затрагиваются данной лицензией...\n\n> - Каждая лицензия требует от пользователей произведения: получать разрешение автора на любое из вещей, которые автор решит ограничить — например, использование в коммерческих целях, создание производного произведения...\n\nНебось сами лицензии в глаза не видел, да?..",
			"post_id": 50,
			"date_added": 1476064206
		}
	],
	"comment_vote": {},
	"post_vote": {
		"48": 1
	}
}