{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Цензура ровестница государства",
			"body": "Несомненно, что желание властей контролировать информацию существует\nстолько же, сколько существуют феномены власти и информации вообще. Дела\nцензурные всегда проворачивались тайно, отчего история этого явления\nвыглядит довольно интригующей.\n\nЦензура — система государственного надзора за содержанием и\nраспространением информации, печатной продукции, различных произведений,\nа также частной переписки, с целью ограничения либо недопущения\nраспространения идей и сведений, признаваемых властями нежелательными.\nЦензура является неотъемлемой функцией любого государства, которое\nреализует систему запретов и ограничений, а также механизм пропаганды.\n\nСамо слово «цензура» пришло к нам из Древнего Рима (от лат. census), где\nозначало периодическую оценку имущества для разделения людей на сословия\nи распределения по праву пользования привилегиями. Однако, самые первые\nиз известных упоминаний цензуры относятся к ещё более раннему периоду.\nСреди них можно назвать уничтожение иудейским царём Иоакимом свитка\nпророчеств Иеремии (608 — 598 до н. э.) и сожжение в Афинах (480 — 410\nдо н. э.) книг философа Протагора о богах. Китайский император Цинь\nШихуанди пошёл ещё дальше, приказав сжечь все книги, кроме медицинских,\nсельскохозяйственных и научных чтобы защитить империю от предполагаемой\nопасности поэзии, истории и философии. Платон, в свою очередь, предлагал\nввести комплекс запретов, ограждающих людей от вредного влияния\nнекоторых художественных произведений.\n\nВ Средневековье наиболее жёсткой была цензура со стороны церкви, которая\nещё в V веке составила список запрещённых апокрифов Евангелия, а позже\nввела Индекс запрещённых книг и предварительную цензуру на все\nпроизведения. В эпоху Нового времени многочисленные философы Западной\nЕвропы критиковали цензуру, что в совокупности с рядом буржуазных\nреволюций привело к отмене или значительному смягчению предварительной\nцензуры к середине XIX в. во всех европейских странах…\n\nКроме Российской империи, где после убийства народовольцами Александра\nII контроль над информацией со стороны нового императора достиг поистине\nколоссального размаха. Это вызвало появление контрабанды книг и создание\nзарубежных библиотек неподцензурной литературы. Существует исторический\nанекдот повествующий о том, насколько сурова была цензура тех времён.\nОдна из государственных газет того времени написала о задержании на\nгранице контрабанды социалистических книг в империю, спрятанных в бюст\nцаря, и поплатилась за выпущенный в свет материал с опрометчивым\nзаголовком «Засунули книги в царя».\n\nГазетам тех времен приходилось перергистрироваться под новыми\nназваниями, чтобы продолжать легальное распространение. Так, партия\nБелорусская социалистическая громада, находящаяся на нелегальном\nположении, решает летом 1906 г. начать выпуск газеты «Наша доля». Из\nпяти вышедших номеров газеты, четыре были конфискованы властями, а позже\nиздание газеты было запрещено навсегда за «призыв к вооружённому\nвосстанию для смены государственного строя». Однако, уже через месяц, а\nпо некоторым данным ещё даже во время выпуска «Нашей доли», начался\nвыпуск другой газеты – «Нашей нивы».\n\nВ советское время в каждой области действовало специальное учреждение\nГлавлит, где вели учет секретных сведений местного значения и\nрегистрировали полиграфическую и множительную технику вплоть до печатных\nмашинок частных лиц. Каждая машинка имела отличительные черты шрифта,\nкоторые позволяли с точностью идентифицировать владельца.\n\nЕстественно во все времена цензоры стремились действовать тайно, заметая\nза собой следы. По заверениям белорусского историка Александра\nГужаловского, вообще удивительно, что до нас дошли некоторые материалы\nиз фонда с делопроизводством Главлита БССР за послевоенный период,\nпоскольку во времена перестройки республиканские главлиты получили из\nМосквы отмашку на утилизацию документации по своему усмотрению. Поэтому,\nесли с 1945-го по 1965-й год делопроизводство сохранилось достаточно\nхорошо, то под занавес СССР практически никаких бумаг нет. Ведь чем\nближе к концу 1980-х, тем больше шансов, что раскрытые архивы могут\nкого-то шокировать, а иным и подпортить репутацию.\n\nХарактерной выглядит позиция либеральных стран, выраженная в Европейской\nконвенции о защите прав человека и основных свобод 1950 года, согласно\nкоторой допускается ограничивать свободу прессы из соображений\nнациональной безопасности или для установления общественного порядка.\n\nХотя существование запретов значительно осложняет жизнь, это ещё вовсе\nне приговор. Внушительное количество запрещённых книг из прошлого,\nкоторые издавали и читали многе люди — отличный тому пример.",
			"added": 1554645904
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}