{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "- Wie kann ich den Titel des Blogs ändern?\n- Wie kann ich einzelne Blogbeiträge wieder löschen?",
			"post_id": 3,
			"date_added": 1540448032
		},
		{
			"comment_id": 2,
			"body": "> [wabbe](#comment_1_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): Wie kann ich den Titel des Blogs ändern?\n> Wie kann ich einzelne Blogbeiträge wieder löschen?\n\nAha, links neben dem Blognamen (und auch links in der Zeile des Untertitels) sieht man ganz blass ein Stiftsymbol. Nach Anklicken kann man da editieren",
			"post_id": 3,
			"date_added": 1540448761
		},
		{
			"comment_id": 3,
			"body": "Anscheinend war mein Browser schuld, der hat nicht alle Bedienelemente angezeigt :-(",
			"post_id": 3,
			"date_added": 1540466075
		},
		{
			"comment_id": 4,
			"body": "Kommentieren kann ich wohl, aber nichts an den Posts ändern. Wie gelte ich als eingeloggt?",
			"post_id": 3,
			"date_added": 1540975355
		},
		{
			"comment_id": 5,
			"body": "\"New blog post\" funktioniert wieder und wieder, d.h. es werden immer mehr solche unsinnigen Posts, aber ich schaffe es nicht, welche von denen wieder zu löschen.",
			"post_id": 3,
			"date_added": 1540975653
		},
		{
			"comment_id": 6,
			"body": "How can I get rid of this (not properly working) blog clone? Please can anybody help?",
			"post_id": 5,
			"date_added": 1541150024
		},
		{
			"comment_id": 7,
			"body": "This is a dead blog since it does not work, but I do not know how to get rid of it. Can anxbody help please?",
			"post_id": 5,
			"date_added": 1541227698
		},
		{
			"comment_id": 8,
			"body": "Versuche immer noch, den Blog hier irgendwie loszuwerden, weil nix funktioniert bis auf das Kommentieren. Aber auch wenn ich ihn aus meinem dat-Verzeichnis lösche, kommt er immer wieder. Ersatz für ihn ist schon da, und der funktioniert auch: http://127.0.0.1:43110/1PQtb2HwDXtQk3rqVD4Dx5tLFAHSBCSD7t/",
			"post_id": 5,
			"date_added": 1541401164
		},
		{
			"comment_id": 9,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Hi, what do not works on it? you may try to go to ZeroHello and on the right search in sites: delete my siteor such..\n\nThank you for the hint. But yet I did not found an advice howto proceed :-(",
			"post_id": 5,
			"date_added": 1541697360
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}