{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "openbazaar feb 2021",
			"body": "¿Como es posible que vaya a cerrar openbazaar ahora que el bitcoin va por fin a empezar a usarse de forma cotidiana?",
			"added": 1613796150
		},
		{
			"topic_id": 2,
			"title": "Manifestación global 20 de marzo de 2021. Ni si ni no ni blanco ni negro.",
			"body": "Habiendo visto el documental sobre \"el gran resteo\" tengo serias dudas sobre cual es el contenido de su mensaje\n\n¿Es simplemente quitarse la mascarilla y no vacunarse?\n\nNo conozco a nadie que esté deseando vacunarse o que no quiera llevar puesta la mascarilla lo menos posible\n\nEl video tampoco dice nada de la gente que sí que conozco que trabaja en hospitales y está flipando por una enfermedad que sí debe existir dadas sus experiencias.\n\nAsí que por un lado me parece cierto que existe un experimento con las \"vacunas\" pero también es cierto que existe un virus que hace algo más jodido que una gripe.\n\nLavarse y tener medidas de higiene \"como decía la abuela\" me sigue pareciendo buena idea, así como evitar toserle a alguien en la cara o ser tosido por alguien, lo cual con mascarilla es más facil en el metro o en un sitio cerrado. Y pasar la tarde en un parque o en la terraza de un bar me parece mejor que dentro de un piso pequeño o de un bar sin ventanas.\n\n\nLo del toque de queda y cerrar las cuidades a ciertas horas de la noche ya si que me parece una chorrada.\n\nPero este video me parece que en caso de que realmente exista un virus nuevo y un poco chungo, lo que puede conseguir con la manifestación del 20m y la idea de que no existe ninguna enfermedad, es esparcir más todavía esa enfermedad.\n\n\n\nque es realmente el enemigo? las vacunas, el virus? o las dos cosas?\n\n\n\n\nseguro que este video no forma parte de la manipulación global, negando el reseteo pero a la vez provocando que no se pueda contener ese virus, para facilitar que sí se pueda producir tal reseteo?\n\n\nno es equilibrado ni exagerar las medidas llevando mascarilla a todas horas o precipitándose a vacunarse con cosas experimentales, ni dejandose contagiar por no tener unas precauciones muy básicas y dejarse llevar por hacer botellones sin sentido práctico alguno\n\n\npara mí está claro que hacer fiestas y borracheras en este momento es insensato porque estamos en mitad de una guerra mediática donde se pone en juego la realidad misma\n\n\nasí que os sugiero que os reunáis para pensar un poco mejor todo lo que estáis pensando hasta ahora y encontremos juntos una alternativa de consenso que no signifique jugársela a vacunarse pero tampoco jugársela a reunirse para hacer tonterías\n\n\nlas personas de a pie estamos siendo demasiado estúpidas en ambos casos y si nos la están jugando por un lado también lo hacen por el otro\n\n\nhazlo por ti misma\n\n\nque esta adicción a télegram o a los medios y al movil no te impida pensar por ti misma ni te arrastre a un extremo o al otro\n\n\n[...]\n\nVisto en los canales de télegram de #burbuja3301\n\n\nhttps://elinvestigador.org/documental-big-reset-movie/\n\nEl documental «The Big Reset» es enemigo de la censura, e intenta hacer llegar al mayor número de gente posible las opiniones de personas muy preparadas que están siendo sistemáticamente silenciadas por no comulgar con el pensamiento único y obligatorio que nos están intentando imponer.",
			"added": 1615522676
		}
	],
	"topic_vote": {},
	"next_comment_id": 15,
	"comment": {
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 1,
				"body": "¿Y no sería posible, dado que hay gente suficiente que comparte estas apreciaciones, formar una sociedad colaborativa para darnos mutua asistencia en la consecución de objetivos comunes?",
				"added": 1592362156
			},
			{
				"comment_id": 2,
				"body": "Será necesario prestar atención a tsunami de mierda que se nos viene encima, pero más importante aún debe ser concentrarse en los objetivos comunes. Formar y difundir listados de tareas a realizar. Definir esos objetivos.\nDesde utópicos objetivos casi inalcanzables a pequeñas cosas y acciones cotidianas.\n\n¿De que se trataría?\n\nLa paz mundial. -- No aportar dinero ni energías al esfuerzo belicista. (Largos debates subyacen a cada punto). \n\nUn consumo responsable. -- Consumir activamente y aportar dinero y energía a aquellos productos o iniciativas que promocionan el cambio de sistema hacia algo mejor. Energías renovables. Comida producida en un entorno cercano que no necesite transporte.\n\nContaminar menos. Usar una bicicleta en lugar de un vehículo de combustión siempre que sea posible.\n\nPero sobretodo presionar para que más gente haga lo mismo. \n\nNo \"trabajar para el enemigo\". Buscar o generar empleo que no contamine. Abandonar empleos tóxicos. Buscar activamente alternativas. Fundar empresas cooperativas. por ejemplo No comprar en 'glovo' para que te traigan cosas a casa, sino fomentar que personas individuales se asocien y formen su propia cooperativa de trabajo que sustituya a 'glovo'.\n\netc etc etc. \n\nHay mucho por hacer. Como por ejemplo organizar o acudir a fiestas y encuentros donde divertirnos y hablar y conspirar para llevar a cabo cosas de este tipo.",
				"added": 1592362897
			},
			{
				"comment_id": 3,
				"body": "Usar zeronet y animas a más gente a hacerlo y abandonar facebook y youtube. Hacer uso de la tecnología para sustituir youtube por peertube. \n\n¿más ideas? Abrir un hilo para seguir escribiendo más aportaciones encaminar a solucionarlo todo?",
				"added": 1592362978
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 4,
				"body": "pro no basta con usar zerotalk? xD",
				"added": 1596674994
			}
		],
		"2_1MtnAW7x2y3YJjRxubqBkP47UVGpjScdtG": [
			{
				"comment_id": 5,
				"body": "es simplemente el futuro de internet",
				"added": 1613795569
			}
		],
		"1_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 6,
				"body": "for mobile only?",
				"added": 1613795775
			},
			{
				"comment_id": 10,
				"body": "for mobile only?",
				"added": 1613796064
			}
		],
		"1_1PD6ADNcGcQkAvVL9dcZVUTMwWSLmDFGmc": [
			{
				"comment_id": 7,
				"body": "¿por qué no usamos zeronet como mercado para comprar y vender cosas normales?",
				"added": 1613795886
			},
			{
				"comment_id": 11,
				"body": "¿por qué no usamos zeronet como mercado para comprar y vender cosas normales?",
				"added": 1613796085
			}
		],
		"1_15fFKEVL87t9KJRxh6M1SvHovNSbijK3c9": [
			{
				"comment_id": 8,
				"body": "para que funcione hay que mantenerlo activo unos días hasta que visitándolo, las usuarias comiencen a alojarlo.\n\nzeronet no funciona si lo desconectais",
				"added": 1613796004
			}
		],
		"1_16S1kZwDEtCc7iJLmiHt14TN53xjnXG7KK": [
			{
				"comment_id": 9,
				"body": "vamos a tener que hacer una página para que sirva de buscador o si no esto va a ser muy lento de distribuir",
				"added": 1613796051
			}
		],
		"1_178fkECLjaLXi4JhW8Yi8bZPL2J2jAJHVo": [
			{
				"comment_id": 12,
				"body": "http://127.0.0.1:43110/1ADVERTvh1AC7XhDBBkaEhL5wGkMuS9fwt/\n\nCarnival Classfields!",
				"added": 1613873572
			}
		],
		"2_151PYjK7U3iMqZMtdoVVSBQXrA55XghrVU": [
			{
				"comment_id": 13,
				"body": "¿por qué no subes el video aquí en lugar de poner enlaces externos?",
				"added": 1615522166
			}
		],
		"1_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E": [
			{
				"comment_id": 14,
				"body": "¿Conocéis algun generador automático de drum and bass?",
				"added": 1618051540
			}
		]
	},
	"comment_vote": {}
}