{
	"pages": [
		{
			"id": "f6352510-cefb-11e6-af8d-0ff8d264ef82",
			"body": "JSON (JavaScript Object Notation) é um modelo para armazenamento e transmissão de informações no formato texto. Apesar de muito simples, tem sido bastante utilizado por aplicações Web devido a sua capacidade de estruturar informações de uma forma bem mais compacta do que a conseguida pelo modelo XML, tornando mais rápido o parsing dessas informações. Isto explica o fato de o JSON ter sido adotado por empresas como Google e Yahoo, cujas aplicações precisam transmitir grandes volumes de dados.",
			"date_added": 1483149224417,
			"slug": "json"
		},
		{
			"id": "e23b2960-cefb-11e6-b9d7-e536ecced213",
			"body": "JSON (JavaScript Object Notation) é um modelo para armazenamento e transmissão de informações no formato texto. Apesar de muito simples, tem sido bastante utilizado por aplicações Web devido a sua capacidade de estruturar informações de uma forma bem mais compacta do que a conseguida pelo modelo XML, tornando mais rápido o parsing dessas informações. Isto explica o fato de o JSON ter sido adotado por empresas como Google e Yahoo, cujas aplicações precisam transmitir grandes volumes de dados.",
			"date_added": 1483149190902,
			"slug": "zite-lista-midia"
		},
		{
			"id": "3c676120-cefb-11e6-9874-b905df791cb9",
			"body": "O SQLite é um processo de biblioteca que implementa um auto-contido, sem servidor, configuração de zero, transacional SQL mecanismo de banco de dados. O código para o SQLite é de domínio público e, portanto, é livre para usar, para qualquer finalidade, comercial ou particular. O SQLite é o mais amplamente implantado banco de dados do mundo, com mais aplicações do que podemos contar, inclusive, vários projetos de destaque.\n\nO SQLite é um mecanismo de banco de dados SQL embutido. Ao contrário da maioria dos outros bancos de dados SQL, o SQLite não tem um servidor separado do processo. SQLite lê e escreve diretamente para o disco comum arquivos. Um completo banco de dados SQL, com várias tabelas, índices, triggers e views, está contido em um único arquivo de disco.",
			"date_added": 1483148912690,
			"slug": "sqlite"
		}
	]
}