{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1568379812,
			"title": "Niggers are inferior and i can prove it mathematically",
			"body": "What do we mean when we say inferior?\n\nHumans have evolved. They been evolving in a certain direction - at the start we have some kind of an ancient ancestor ape and at the end we have modern human. When I say that someone is inferior, i mean that he and his ancestors didnt make it as far as the other children. That, on the animal-human spectrum, he is somewhat closer to the animal. \n\nWhat i mean when i say race? There is such a thing as a genetic distance. How it is actually calculated is irrelevant in this case, the important part is that the greater the number, the higher the amount of differences in our subjects DNA.  On https://i2.wp.com/www.educationviews.org/wp-content/uploads/2017/06/race-and-genetic-distance.jpg?resize=688,549 we can clearly see that africans split off rather early on, being considerably further than the first white split. \n\nSo we have a portion of dna that all humans have in common, a part that all people of the same race have in common and a the part that varies from person to person. We can ditch the part all humans have from our consideration, because, well, its pretty irrelevant. We can also drop the part that varies from person to person because we are talking about the context of races here, even though im not saying that it cannot allow any individual to rise about his peers. Aaand we are left with the part that everybody of the same race has in common. \n\nNow what is the likelihood that all of these 'racial' portions are exactly equal? That none of them is inferior? Not even a little bit?Not very much. They are different, so one of them must be better than the other.\n\nWhich one it is though? With most races it would be a difficult to objectively point at any of them as the best one, however one of them very clearly falls behind all the others - niggers. Just think about what it looks like in Africa these days, even after somebody brought them things like modern technology or medicine. South Africa has one of the most fertile lands on the entire planet and somehow they still manage to die of starvation\n\nOr you know, how it looked when the colonists found them. Basically cave people\n\nSo yeah here it is. Feel free to point out any inconsistencies or whatever.",
			"added": 1568379811
		},
		{
			"topic_id": 1569169868,
			"title": "People who use the mute function",
			"body": "So you go to a place that was made to protect free speech and then you proceed to mute everybody whom you disagree with... Like whats the point then\n\nUnless the person is posting cp or something, maybe plebbit is the better option for you. There some faggy mod will protect your made up, cognitive-dissonace-protected reality for you.\n\nAlso fuck niggers",
			"added": 1569169866
		}
	],
	"topic_vote": {},
	"next_comment_id": 25,
	"comment": {
		"1567665977_19qgLZzDDt99bJW6GwBSXMHfMBo9kkLzGr": [
			{
				"comment_id": 1,
				"body": "no",
				"added": 1567673211
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 2,
				"body": "I recommend going for it\n\nDont forget to livestream the act",
				"added": 1567908693
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 3,
				"body": "> [sirius17](#comment_30_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3): I miss that too. These days I just block all the idiots and now it doesn't look too bad !\n\n>Goes to a platform designed for free speech\n\n>Mutes everybody whom he doesnt like\n\nwow",
				"added": 1568108099
			}
		],
		"1568379812_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 4,
				"body": "> [moodswing](#comment_7_1F8RgqojbeyvDmM4m2U1ALv6vvMSA4LsSF): Yeah, let's ditch a very important point that contradicts your idea....\n\nYeah youve completely misunderstood my point. The actual distance/difference is irrelevant, the important part is that there is one\n\nOf course, deciding which ones are the inferior ones is up to you. You might even point out that them being closer to apes somehow makes them better - im just saying that if its somebody its probably them\n\n>How do you differentiate between races\n\nYou might want to review the  link ive provided, its pretty clear from there",
				"added": 1568397226
			},
			{
				"comment_id": 5,
				"body": "> [absolutik](#comment_1_16QCqj5gquHrmpQqAfMRPt7BxqGDELvZ7g): Evolutionary fitness\n\nIm talking about inferiority though\n\nBy that logic ants are superior to us all because theres like a billion times more of these than humans",
				"added": 1568401070
			},
			{
				"comment_id": 6,
				"body": "> [absolutik](#comment_2_16QCqj5gquHrmpQqAfMRPt7BxqGDELvZ7g): There is only one measure of superiority in evolution, and that is survival. Anything else is just opinionated trash.\n\nThe definition of inferiority in the context of races is rather illy defined. If you decide to place the ability to breed like literal rats above all else, im not gonna stop you\n\nConsider this, however. Say we have a race of people that are retarded, violent and illiterate not because of socio-economic-whatever reasons, but because they dont have the mental capacity to do so. Also they are unable to understand that they cannot each have 10 children. So They are gonna breed like rabbits while while the other races understand that there is enough humans as it is and that 1-2 is enough\n\nYou would call the former the superior one?",
				"added": 1568439796
			},
			{
				"comment_id": 7,
				"body": "> [aim64c](#comment_56_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h): This is all interesting, and everything - but I must ask what the intent behind the analysis is.[...]\n\nAlthough im able to feel confident in claiming that as a race they are inferior, im not saying that this means that every last black is inferior to every last white by default - Im sure there are great people, hidden between them.\n\nWhere does this help me however is where the everage does matter. For example, we now know that miscegenation is bad. Or when they arent represented at colleges as much as some people would like them, its not because of socio-economic factors, its because they are retarded (which isnt that much of the stretch considering most of them would actually count as retarded using the old metric theyve moved for some reason). Also the police isnt racist, they are just being niggers",
				"added": 1568478296
			}
		],
		"1569089727_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "Many people are unable to read light letters on dark background so unfortunately light themes are gonna have to stay the default option (and, consequently, often time the only option) forever.\n\nI personally like dark themes more because it isnt so tiring on my eyes. Pure black (as in, #000000) is really ugly though",
				"added": 1569160887
			}
		],
		"1569169868_14APsrL3Vnc8mCdWoXwHh3HM7pzeUkkRd3": [
			{
				"comment_id": 9,
				"body": "> [randomshits](#comment_148_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): It is really simple...I will stand to protect your ability to say 'fuck niggers' , but that doesn't mean that I must be forced to hear your retarded ass say 'fuck niggers' That group is not my cup of tea, but I also realise that the world does not revolve around my flavour choice.\n\nWhy though. Do some particular combinations of characters trigger you or what? I dont get it. Whats so bad about it?\n\nIts always the same kind of people who do this: the 'woke' (for the lack of a better word) kind. Almost as if they are subconsciously protecting themselves against something. Does anybody have any better explanation? \n\nI couldnt care less really but its not like its exactly overcrowded around here",
				"added": 1569182970
			},
			{
				"comment_id": 11,
				"body": "> [caryoscelus](#comment_246_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Fuck you. What's the point of talking to you?\n\nIs everything i believe correct? Probably not. Do i know everything? Definitely not. Will any of this change if i only interact with people who nod to everything i say?",
				"added": 1569185875
			},
			{
				"comment_id": 13,
				"body": "> [caryoscelus](#comment_250_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Why should i care about you in the first place?\n\nYouve missed the point. Replace 'I' with 'you'",
				"added": 1569187660
			},
			{
				"comment_id": 15,
				"body": "> [caryoscelus](#comment_251_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE):  There is no reason to waste time trying to learn something off someone who starts discussion in a dumb aggressive manner\n\nif you say so",
				"added": 1569189363
			}
		],
		"1569149074_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 10,
				"body": "> [chergriog](#comment_5_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd): The only way to 'cure' pedophilia is to prevent it. Sterilize pedophiles before they breed. Because all human behaviours is genetic determined/inherited. \n\nIt is not. A lot of it is environmental. To say ALL of it is genetic honestly just shows that you dont have a clue what you are talking about. If i get hit in the head and turn retarded, was that genetics? If i consistently have bad experiences with something and consequently stop liking it, was that genetics?\n\nIn the case of pedos, the theory i like the most is that some parts of their brain failed to fully develop, which is supported not just by the fact that they have on average lower IQs, but also that the younger they like their 'partners', the higher the IQ penalty seems to be. They also seem to be very childish and playful (ive been observing them on former /b2/ and hell these are some fun people to be with). They genuinely like children - not just as sexual objects, but as partners and friends. As far as i know, they are able to genuinely fall in love with them. \n\nAs OP said however, lots of research needs to be done. Unfortunately any scientist who attempts to claim anything less than pedos being the highest form of evil there is is gonna get his asshole ripped by the mob. The taboo is doing more harm than good. Pedos need to not be afraid to come forward so something can be done. Locking them away is clearly not working. It seems to me there is some hidden reason they are being demonized so heavily. Literally every other kind of degenerate is getting at least some kind of love these days but not them. Hard to say what it is though\n\n> [randomshits](#comment_146_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): The truth is pedophiles are addicted to the predatory nature of their actions and their ability to groom an individual into tolerable and receptive acts of abuse.\n\nHoly shit you are retarded. Some are (especially women for some reason?) but most... not so much",
				"added": 1569184445
			},
			{
				"comment_id": 12,
				"body": "> [randomshits](#comment_152_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): If you partially agree with me would not that make me partially retarded?[...]\n\nI do not partially agree with you. Sadly you are entirely retarded\n\n>Maybe because an adult taking predatory action against mentally undeveloped children is one of the most heinous crimes imaginable?\n\nYou see thats the issue - most dont commit any actual crimes (besides observing some prohibited combinations of bits) and yet everytime the topic comes up, the popular course of action seems to be bullet in the head regardless of if they ever did anything. Its so odd honestly. I dont believe this is just human mentality at play here. Up until relatively recently (historically speaking) all women entered a state of semipermanent pregnancy the moment they were able to. Why do you think they are able to have children at fucking 12 or whatever.\n\nAge of consent varies a lot from country to country, from 18 all the way down to 14 in the case of western nations. If you fuck a 17yo somewhere in eastern europe you are perfectly fine. If you do that in the US legally you become a pedo and from that point forward your life is over. Even if you survive prison you are still fucked and might just as well just hang yourself. Its the fucking label that just triggers people to turn off all reason and just bring out the pitchforks.",
				"added": 1569186843
			}
		],
		"1569171713_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 14,
				"body": "I think that most of the time if you are the kind of person who finds his way to here of all places you will probably use the mute feature rather sparsely \n\nIf not... well its not like anything of value was lost",
				"added": 1569187945
			}
		],
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 16,
				"body": "Wait are you saying that yt actually sucks? I cant believe it, ive always saw them as the greatest company ever",
				"added": 1569357965
			}
		],
		"1569725313_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 17,
				"body": "Voat is full of them\n\nYou probably wont be able to get there right now so just wait for when they open registrations again",
				"added": 1570704056
			}
		],
		"1570845988_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 18,
				"body": "Yeah i gave up a long time ago so dont you dare getting my hopes up again",
				"added": 1570922352
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_1112_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Well, I didn't mention that high school is like a river of salmon. Hooking up gets a bit more difficult once that's over.\n\nYeah thats even worse. I didnt have a chance then so i sure as fuck dont have one now. \n\n>It's a combo of looking my best\n\nNow imagine not even your best is enough. Imagine nobody besides your close family ever expressed any emotion towards you besides 'eww' or maybe pity, that is if theyd notice you in the first place. You are not the first one to come to a place like this being like 'you can get out, just try' and then proceeding to flex with their sex life. I believe you mean well but you do not understand the problem, you in fact never will because you were never forced to come to peace with the fact that you will die a virgin. \n\nIts not even about sex anymore, at this point i just want someone to tell me she loves me and mean it.\n\nAny effort to change this however is a massive waste of time and, whats worse, a massive tax on my morale. Better focus my efforts on finding ways to be content with myself *without* a partner.",
				"added": 1570976321
			},
			{
				"comment_id": 21,
				"body": "> [12345679](#comment_36_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z): If you don't think of women as human beings you will fail. Show mutual respect. If you treat women like a thing and not a person then you reach full inceldom.\n\nOr, you know, you will end up an incel regardless of what you do so you might just as well do what you want\n\nAlso you do know that you can delete your posts, right?",
				"added": 1570986123
			}
		],
		"1570901775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 19,
				"body": "Thanks, especially for the firefox guide",
				"added": 1570924204
			}
		],
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 22,
				"body": "Who could have guessed",
				"added": 1571057267
			}
		],
		"1570044887_1KkYDy7vnYwccFCDugksbCb4izK5HTSDBd": [
			{
				"comment_id": 23,
				"body": ">0.001 shekels were deposited to your account",
				"added": 1571127912
			}
		],
		"1571325375_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 24,
				"body": "No mr agent, nobody here would ever want the death of anybody.",
				"added": 1571402886
			}
		]
	},
	"comment_vote": {}
}