{"cert_user_id": "Tomas-M@github", "next_topic_id": 2, "topic": [{"topic_id": 1604065299, "title": "Idea: webrtc", "body": "Hi. Just idea: using webRTC, browsers can communicate peer-to-peer. So there is no need to install any windows application, the whole thing can run in browser. However you would need to write the software in JavaScript.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1462250197, "modified": 1520551459, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449", "source_type": "github"}], "next_comment_id": 5, "comment": {"1604065299_mirrored_Tomas-M_github": [{"comment_id": 1, "body": "I agree with most of the objections, webRTC is shitty but it's the only thing available.\nJust a note, File storage quota in browser can be increased to unlimited if user confirms.\n", "added": 1462253581, "modified": 1462253581, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-216467909", "source_type": "github"}, {"comment_id": 2, "body": "Closing, since it was just an idea :)\n", "added": 1462253646, "modified": 1462253646, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-216468115", "source_type": "github"}, {"comment_id": 3, "body": "As far as I know, clients cannot generate the 4KB JSON itself. They need to connect to a STUN server in order to obtain the information. The JSON contains IP addresses of gateway, port, etc - basically the information needed for other computers to connect to it. As far as I know there is no way to avoid this step, the browser needs to connect to STUN server to get the data. There are public STUN servers provided by google and many others.\r\n\r\nLater, when clients have this 4KB JSON, they have to exchange this information so they know how to connect to each other. For that, there is usually another type of server needed (singalling server). But you may exchange the data between peers in any different way (users send it manually by email for example). There is example here: https://github.com/cjb/serverless-webrtc\r\n\r\nIn general, webrtc is not peer to peer per se, it needs some servers to setup connections between peers. However, once the client is connected to the p2p network, he can exchange data between peers directly without any additional server. As long as the client is on a type of network which allows this.", "added": 1480569566, "modified": 1480569577, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-264107081", "source_type": "github"}, {"comment_id": 4, "body": "One thing to add, as soon as the user is connected to other peers, he can use these peers to connect to other users (which are connected to the same peers), so there is no longer need for the signalling server in that case, if I understand it correctly. So the servers (stun and signaling) are only needed for initial connection of the client to the network.", "added": 1480577909, "modified": 1480577909, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/449#issuecomment-264138093", "source_type": "github"}]}}