{
	"next_comment_id": 68,
	"user_name": "Pexo",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1HBDi2cwDvZZSUfioMbQSNfPgvhCx7G4j_1532183158": 1532232486,
		"16iXynWL9gnhqh9phPRCKGMNVGy41mEu61_1532855819": 1532865841,
		"16iXynWL9gnhqh9phPRCKGMNVGy41mEu61_1532855910": 1532923149,
		"1ExWgzdNmaNg9VqYFZNVZGoKkfiHkvjpB2_1535660733": 1535663906,
		"1P6cEvA3RLuk9FGyNY9kCb9C8L231jVhiK_1536104179": 1536122542,
		"1HmMuCzHEsuB7BzrRDcCpmR1VR7d2sbYw2_1539498110": 1539548189,
		"17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH_1543230590": 1543258303,
		"1LN1GRYvbXGy75FqQsMCUfDaLCrDwUiRRj_1543740067": 1543766847,
		"1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1544179457": 1544205762,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1544793225": 1544820342,
		"1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb_1546374506": 1546447777,
		"1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651": 1546705073,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1547302241": 1547314303,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1548336321": 1548446554,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1549105940": 1549125993,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549628625": 1549651557,
		"16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1550050616": 1550173218,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1550229480": 1550253760,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1550393796": 1550431144,
		"16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1553690105": 1553710039,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1553847983": 1553887401,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1555759542": 1555786623,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1557256355": 1557339870,
		"15C1QHgbZtqgBQm8DY9MLkftgND9CZbbNY_1557212046": 1557340011,
		"16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1557200716": 1557340024,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1557586567": 1557680902,
		"1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz_1559101897": 1559152981,
		"1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz_1559099051": 1559152988,
		"1KoFQ8qs1bvxJ3XNAuT1yJYcXiUgzTnFn9_1559499564": 1559499642,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1561292710": 1561306925,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1561398528": 1561404857,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1562058115": 1562093182,
		"1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1562526998": 1562602081,
		"15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1562793730": 1562865591,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1566398075": 1566498456,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1567261612": 1567276041,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1567437658": 1567441574,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1567456154": 1567528616,
		"1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz_1567584593": 1567612635,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1567494784": 1567612839,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1567971679": 1568045080,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1567946355": 1568045133,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1569080801": 1569082958,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1569600568": 1569601668,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1571243728": 1571252077,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1575927370": 1575996313,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1576465879": 1576518806,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1578649807": 1578676173,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1578764613": 1578767171,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578713514": 1578767262,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578709994": 1578768016,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578771021": 1578846994,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578800403": 1578849127,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1578828099": 1578849318,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1579694898": 1579714754,
		"16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1581521268": 1581531388,
		"1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1582306388": 1582305971,
		"1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1582534949": 1582564514
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "`>Shadman`",
			"post_uri": "126w3qujTWkNgjDDZQ7Evq46ZkLkAr5WNB_1532706222",
			"date_added": 1532714099
		},
		{
			"comment_id": 2,
			"body": "Welcome to zeronet!",
			"post_uri": "1JgZEpmgVA515UnScuxdTEb8bT8g5oUFQW_1",
			"date_added": 1533974495
		},
		{
			"comment_id": 3,
			"body": "This is the single most dumbest thing I have red in at least two years. Really hoping this all will just kind of fall apart and not have too much of an impact on the kernel community as a whole. Things were looking so nice for the kernel, in the worst case this will shatter the kernel community and cripple it's process of becoming mainstream. And all that, just after Linus decided to take a break from kernel development to reflect on himself for a bit, I have a feeling, that this move has been going on behind the scenes, for some time now.",
			"post_uri": "1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh_1537592074",
			"date_added": 1537637975
		},
		{
			"comment_id": 4,
			"body": "@Bussdee: Out of interest: Why do you think they are not? Could you explain yourself? What do you think qualifies as art and why?\nOn a related note: Was that threat necessary?",
			"post_uri": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX_1539732434",
			"date_added": 1539798648
		},
		{
			"comment_id": 5,
			"body": "Greetings!",
			"post_uri": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX_1",
			"date_added": 1539798879
		},
		{
			"comment_id": 6,
			"body": "@leftside: \n>Normal kids\n'Normal' is a bit vague here, please define what kids you talk about specifically.\n>kids never wear such a costume.\nFirst of all, 'never' is way too much of an absolute statement. Second: If you are implying, that kids are never sexual and always pure and innocent, think again. At least 5% of all kids have done naughty things even before they enter elementary school, by the end of elementary school, this number is at least 29% for all kids. (These are not numbers I pulled out of nowhere, [this](https://clresearchblog.wordpress.com/2017/07/08/children-are-sexual-beings/)(Clearnet) is the source for this claim, as well as a lot of further information and citations on that and similar topics.)\n>You are just making ur sexual fantasy more and more specific and strengthening ur desire more and more by doing this.\nFunny, that makes it sound like people someday just decided to be that way. There isn't much to strengthen there. There really isn't a choice. In much the same way you can't just decide to be a pedophile from now on. You either already were or you weren't.\n>No one can choose his or her own genetic inheritance.\n>But anyone can cut or glue to fix it.\nPlease define 'it' in this context. What is 'it', that you would have to fix, in the case of pedophilia? The attraction to kids? The 'fact' that every pedo will hurt/assault/abuse kids at some point?\nOnes sexual preference is an integral part of their personality. You can't really change that without heavily altering your entire being. Like I and you said above, this isn't a choice.\nIn fact: I want you to get onto tor right now, get yourself some child porn and force yourself to cum to it. This will give you an idea of the other side. You'll likely will not enjoy it and feel empty after your done with it.\nNow imagine walking around and telling everyone how much you liked that and how fucking disgusting these pigs, these animals are, that dare to masturbate to (drawn) images of grown woman. All the while you are slowly dying inside, being forced to lie about yourself to anyone you care about and (to some extend) to yourself, as well. Having conversations where you agree, that this scum, these lesser things, should be shot/beaten/murdered out in the open, with no court needed, because who needs proof that they ever harmed anyone when, they are a worthless piece of shit and a parasite to society anyways. I mean even if they did nothing, who cares, killing them will just prevent an future assault, right? And even if they don't, the wicked thought of it is already justification enough. Having all your loved ones tell you how glad and proud they are that you are normal and not one of those abominations of nature.\nDoes this purely fictitious world sound good to you? Well it gets even better, since you are also not able to get help from anyone or anywhere. And aggressive statements like yours and @Bussdee: just worsen this situation.\nIn general a pedo sees himself faced with one of these four options on how to handle his situation:\n- Cope\n- Embrace what they are and come to terms with that\n- Embrace what people want them to be(monsters without morals)\n- Suicide\n\n>But some people don't fix it and rush down to the hell straight.\nNow this is implying, that pedos have no morals by default until they learn them. Why would you even think this? Pedophile literally means child loving. Would you rape your wife/girlfriend? Beat her into submission because you are that much more stronger then she is? Fuck her even though she's crying, begging you to stop and bleeding out of pussy and ass, because you are too big for her? This is not love. ",
			"post_uri": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX_1539732434",
			"date_added": 1540048790
		},
		{
			"comment_id": 7,
			"body": "@leftside:\n>But scientists found that people can suppress their inherited genes by choosing proper diets\nWhat?\n>and behavioral correction\nPlease define what you mean by that. Do you mean the pursuing of children? The attraction to kids itself? Because one is vague in definition and already avoided by many and the other is, as I said below, an integral part of your personality and as such not easily alterable without changing your very being.\n>Even though a kid was born as a pervert it doesn't mean that it's OK for him to keep it doing for himself\nWhy?\n>or to others in a society\nI (at least partially) agree with that, as long as you and 'others' are fine with what you're doing everything is alright in my book.\n>If a tree produces bitter apples, you will destroy it off ur farm and replace it with a sweet one. That's what NORMAL people do in nature.\nTrue, however you don't destroy people, that you don't like, based on their genetic makeup(which is also not visible to the naked eye). That's what NORMAL people do in society.\n\n@leftside:\n>That funny ancient statue has nothing to do with pedophilia\nMaybe not directly, but there is an argument to be made there: Where do you draw the line? Should ancient art that contains or revolves around naked children be not considered art either? If yes, then what does this art have, that separates it from the supposedly not-art in the op? Where do you stop prohibiting and where do you get an absolute judgement to justify the prohibition?",
			"post_uri": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX_1539732434",
			"date_added": 1540137782
		},
		{
			"comment_id": 8,
			"body": "So that's what it looks like without tor only mode. Wow, there are a lot more people there than the around 1000 people I thought are using zeronet right now.",
			"post_uri": "1L3kWGTi9tCFGLrt9EXGN55W1oNv7CU5Hj_1540179670",
			"date_added": 1540224510
		},
		{
			"comment_id": 9,
			"body": "@leftside: \n>Certain diets suppress the expression of certain genes by shielding it with enzymes.\nTo say that I'm really suspicious on that would be an understatement. Do you have anything to back this up?\nThe digestive tract usually destroys anything, that isn't recognized by the body. If that doesn't do it there is also your bodies defense system to destroy anything not have your 'signature'. Those molecules, that get around that are either toxins, drug or any compound that can cause cancer. Enzymes should not be able to permeate into the cell, much less, get to a point, where they can interact with the dna. Also these enzymes must somehow 'know' what genes cause pedophilia or pedophilic tendencies (or at least what they look like) in order to block them.\nBut it is entirely possible that I am wrong about this. Surprise me.",
			"post_uri": "15FLRaj1RkFWYVCFhGyF2dv1y3ix1UBxNX_1539732434",
			"date_added": 1540314931
		},
		{
			"comment_id": 10,
			"body": "@Eightyfour: \n@styromaniac@zeroid.bit: \nThe canvas element is an native HTML5 tag, that is designed to handle, process and export images. \nIt is basically a (browser)native way to manipulate and display images. It is a really powerful element and can be used for a lot of tracing methods, that can get around various protections your browser might set in place. Try searching 'canvas fingerprinting' to get more info on that. Since the Tor-browser is designed to protect you by default and the canvas element poses multiple threats at once the Tor-browser devs decided to just disable it entirely to grantee that correlation attacks cannot be done with canvas fingerprinting.\n\nZeroMe uses it to generate(render is the more appropriate word here) the blurred thumbnails, that you see before clicking the button, that downloads the image. If you are using the Tor browser all thumbnails will appear white.\nZeroMe also uses the canvas element to convert uploaded images into the right format(and I think it also removes metadata, but I'm not sure whether or not it actually does). If your browser does not support or in the case of the Tor-browser disabled the canvas element the it will just return an white image no matter what you do to it. This is why your uploaded images are white even if you click the 'download image' since the image that ZeroMe saved was extracted from the disabled canvas element, that because it was disabled returned only white.\n\nThere are ways around this, one that [millchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/) deployed, was to use code written in js to generate the images instead of using the canvas element. As a result you can use it just fine with the Tor-browser.\nOn a related note: The Tor-browser version 8.0 and higher broke the default way of doing BigFile-uploads, which may or may not be affecting ZeroMe as well. \n\nIf you are a developer you can read [this](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1) thread on millchan for the discussion as well as used libraries and read [it's source](http://127.0.0.1:43110/15qFg3C9mYTKEAQF678xczTPprbe7b6LMf)([clearnet version](https://gitgud.io/mcdev/Millchan)) if you want to fix the BigFile issue on your zite.",
			"post_uri": "191jbK3GNmVritcMymKkFuxyYFXxqv2xpC_1540352586",
			"date_added": 1540404951
		},
		{
			"comment_id": 11,
			"body": "Well, looks like we have a winner!\nI think you are the first one on ZeroMe that actually did upload CP here.",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541349181
		},
		{
			"comment_id": 12,
			"body": "@Colkurtz: I don't think he even is a pedo. Or are you @Badoolove: ?\nI guess he's just trying to make a point. Although I'm not sure what point exactly that would be.",
			"post_uri": "1FCUfGpjdJr6wcorndFhdKhYJ5EPaXSk7u_1541346116",
			"date_added": 1541359518
		},
		{
			"comment_id": 13,
			"body": "Hmm, the zite folder is empty(except for content.json), either he made a mistake or he decided to kill the PornographyBlocklist.\n@SSDifnskdjfnsdjk: Was that on purpose?\n\nEdit: Now that I think about it all his posts seem to have vanished. Even the ZeroMail contact I had for ssd is gone now. I think he deleted his account and wanted to completely vanish from ZeroNet. Did he live in china? Maybe what [nekololi posted](../Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB/1543097061) is the reason for that.",
			"post_uri": "17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH_1543230590",
			"date_added": 1543258298
		},
		{
			"comment_id": 14,
			"body": "Can confirm that.\n[This](/raw/148BsJjNwjHxSXDisaY6ErV6FJxp3bVd1M/) is the zite in question(I linked it with the /raw/-prefix, so js is disabled for index.html). The spamming users were: [triggerhappy@zeroid.bit](/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1D2PEmzJ8iuSPDtaSGCNVsW9wo5V1vVr9G/triggerhappy@zeroid.bit), [cuteboy@zeroid.bit](/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1Le7tgfrm5CkvfXV6BD42fCqdYzjfX6e5j/cuteboy@zeroid.bit) and [jakealvares@zeroid.bit](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1oxisdjwJyx85W8Dzk9zLRtMEaHNp7SGN/jakealvares@zeroid.bit)\nYou can mute them by clicking on the three dots at the top right corner of one of their posts and then pressing 'Mute user'.\nI think @Styromaniac: should be notified about this.",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1544179457",
			"date_added": 1544205610
		},
		{
			"comment_id": 15,
			"body": "@Thunder: \nI wanted to make it easier to mute them all at once. Should I remove the links?\n>do you believe anything will happen?\n>should we get the authorities involved? lol\nLike actual bombings happening because of that? No, but the zite did take oddly long to load and made some funny redirect and 'noscript blocking' attempts. Looks like a potential malware/js exploit/ip leak attempt to me. The heavy load on my system, while viewing the zite could also be an indicator for one of the speculative execution(meltdown and the such) attack implementations in js(these are able to read private keys from memory and cannot be easily fixed in software). Havn't really looked deep into that, though, so take what I say here with a grain of salt. Just wanted to be cautious here.",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1544179457",
			"date_added": 1544218796
		},
		{
			"comment_id": 16,
			"body": "I also think deepfakes won't affect democracy(at all). \n\nWhat I find more interesting is what implications it has in court, since at some point video and audio will become meaningless as proof.\nTo me, the amazing thing that is happening right now is, that the assumption:  \nIn order to see something on video, it must have taken place in real life  \nis no longer true and more than that is fundamentally broken.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1544563697",
			"date_added": 1544727623
		},
		{
			"comment_id": 17,
			"body": "@styromaniac@zeroid.bit: That bug was fixed some time ago, if you mute the difficult boards they will no longer be shown in the 'Recent posts' sections. I think you can also put the individual boards into the nopelist(as muted users) to hide only those, but I haven't tested that, yet.\n\n@leftside: Well currently there is a lot of activity in regards to Jessica Nigri and Angie Griffin as well as others (both are cosplay models, by the looks of it). There was that coincloud thing, that happened there some time ago, probably a lot I forgot and there are a few nice discussions going on there from time to time. Even with all that aside millchan is at the moment one of the most polished and bug free zites, I know(it also works on the Tor Browser Bundle, which is really nice).",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1544793225",
			"date_added": 1544820948
		},
		{
			"comment_id": 18,
			"body": "@Realjohndoe: Well, it's not really censorship, blocklists just display a warning to you, if you are about to visit a blocked zite. Also everything in the blocklist is public so you can always see and check whether or not the blocklist runner oversteps their boundaries and subsequently remove that blocklist(or make your own).\n\n@Nekololi: Wait, you mean as result of a bug or as result of that 3d guy, that misunderstood the purpose of /l/? Is that still that way(broken) for you?\nAlso are you still on /l/? I thought you left millchan altogether some time ago.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1544793225",
			"date_added": 1544905752
		},
		{
			"comment_id": 19,
			"body": "You can see them, if you go to:\n```\n[PathToYourZeronetDataDir]/1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1/filters/sites.json\n```\n`1LgqZfbtr6dukbjHdjWBEmmthq1shEv3y1` is the real address of `Styromaniac.blocklist.bit`\nThis will work for any blocklist in general.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1546020619",
			"date_added": 1546020469
		},
		{
			"comment_id": 20,
			"body": "@😀Leinariys😍: Well, I have an fanfiction/story zite planned(see [this](/Me.ZeroNetwork.bit/?Post/1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v/1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC/1545597889) post for more info). Since I'm still planning, there is no code to be written, yet, but if you have a good idea on how one could implement some feature, an idea for a nice feature, in general or want to help with coding once planning is done, feel free to let me know.\nNo money, though.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546641651",
			"date_added": 1546705404
		},
		{
			"comment_id": 21,
			"body": "I'm not sure if I understood you correctly.\n\nIs pic related your project? Looks like a kissanime-ish anime streaming zite.\n\n>As promised, I publish a story about the customer’s project (with his permission :-)))\n>Understood with loading video, and unfortunately at this tonight, until next weekend. (working on projects only on weekends)\n>What to do?\n\n?\n\n>I showed the message @Pexo: this and the customer liked the idea very much, but unfortunately, they don’t want to give me mockups (they don’t know how to draw, they only pay money) ((and without mock-ups it’s very hard to do something (therefore, the design is so poor)\n\nI'm also not great in doing mockups...\nAll my current planning efforts are going into how I best do the backend stuff: database structure, what is stored where on which hubs, defining what words mean what and so on.\nEdit:\n>Do you have a gif?\nNo ZeroMe does not allow gifs. You can use [ZeroUp](/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/), [IFS](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/) or [millchan](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/) to upload the gif and send me the link to it, if you want.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1546798029
		},
		{
			"comment_id": 22,
			"body": "@😀Leinariys😍: Now I see it, too.\nThe zite sounds pretty neat, be sure to tell me when your zite is done.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1546883522
		},
		{
			"comment_id": 23,
			"body": "Honestly, I never really got into Eromanga Sensei, which is weird, because it actually looked pretty good and I can't think of something I particularly disliked.",
			"post_uri": "1FUAj1BLo7uoG1XaRRtoacLgkSnSVTRsQB_1546996887",
			"date_added": 1547056852
		},
		{
			"comment_id": 24,
			"body": "@styromaniac@zeroid.bit: You can just post a dummy image, go into the folder where your profile is stored and replace the dummy.jpg with an gif after you made the post.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1547409797
		},
		{
			"comment_id": 25,
			"body": "@styromaniac@zeroid.bit: Probably to save space, I think. gifs tend to be big. But it probably just wasn't in his scope for ZeroMe.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1547413614
		},
		{
			"comment_id": 26,
			"body": "@styromaniac@zeroid.bit: Yeah, a couple of new features for ZeroMe would be nice.\n@Nofish: What's the roadmap after python3 is done?\nDo you think you can fit a bit more ZeroMe development in? \nWould you accept PRs for ZeroMe?\nThere are quite some things that would be nice to have on ZeroMe, like gifs, webm support and getting image upload to work on the Tor Browser Bundle.",
			"post_uri": "1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg_1546794460",
			"date_added": 1547414639
		},
		{
			"comment_id": 27,
			"body": "No, it will automatically give them to new peers as they appear.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1549468415",
			"date_added": 1549481649
		},
		{
			"comment_id": 28,
			"body": "Will there be elections? And if so, which voting system would you be using?",
			"post_uri": "1GooUE19488nDwG3TdkM8seYAHct4gjkq4_1549435937",
			"date_added": 1549482110
		},
		{
			"comment_id": 29,
			"body": "@Deliriumgoddesss: While that's not entirely untrue, one always needs to be careful when stating absolutes.",
			"post_uri": "15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL_1549405442",
			"date_added": 1549482236
		},
		{
			"comment_id": 30,
			"body": "@Deliriumgoddesss: \n\\>implying we are not already brainwashed by (((them)))\nWake up sheeple!",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1549376181",
			"date_added": 1549482705
		},
		{
			"comment_id": 31,
			"body": "@caryoscelus: \n@SSDifnskdjfnsdjk: \nDepending on where you live, it is common practice for an ISP to change your ip on a regular basis, so your static IP might not be as static as you think.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1549551372",
			"date_added": 1549567759
		},
		{
			"comment_id": 32,
			"body": "@leftside: \n@Nofish: \nWhile we're on that topic, please consider adding some way to escape new lines or accepting `\\n` to make empty lines.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1550150679",
			"date_added": 1550172154
		},
		{
			"comment_id": 33,
			"body": "@Deliriumgoddesss: Effective for what? You should **never** count on a free VPN provider to protect you from anything. Even some paid VPNs do not have any intention to actually protect you and will rat on you in the blink of an eye.\nIf you want reliable and free anonymity please use Tor and/or the Tor Browser Bundle. Here mathematics and careful design are the thing that protects you, not trust in some third party claiming to do that.\n\n\n@leftside: While this is annoying, it can also be used to your advantage. If you install an extension, that lets you modify http headers and set the `X-Forwarded-For` flag to some IP address, then the webserver(and more importantly the logs of that webserver) will think, that you are just a proxy and the original IP address was the random one you specified.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1550229480",
			"date_added": 1550254279
		},
		{
			"comment_id": 34,
			"body": "At the moment you can't, but in the future you will be able to. See [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/5@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) GitCenter issue for more info.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1550194435",
			"date_added": 1550254469
		},
		{
			"comment_id": 35,
			"body": "As a Tor only node:\n~150 of ~3800 peers\n\nKeep in mind that downloading large/many files will artificially inflate your peer count.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1551103745",
			"date_added": 1551123221
		},
		{
			"comment_id": 36,
			"body": "Only for new ones. If you click the triangle next to a thread you can choose to follow it.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1553599317",
			"date_added": 1553710623
		},
		{
			"comment_id": 37,
			"body": "There are not that many people here, I would hang around the `Everyone` page and follow people that you find interesting.",
			"post_uri": "1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD_1554745641",
			"date_added": 1554746257
		},
		{
			"comment_id": 38,
			"body": "What post do you mean? His most recent post?\nI only took a very brief look at them, but I don't think they are CP.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1555273883",
			"date_added": 1555356598
		},
		{
			"comment_id": 39,
			"body": "If only I had a choice.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1555666981",
			"date_added": 1555698221
		},
		{
			"comment_id": 40,
			"body": "I don't think I would feel good knowing that there was a lot of bad stuff I was sharing to begin with. But that's one way to look at that, I guess.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1555745004",
			"date_added": 1555786313
		},
		{
			"comment_id": 41,
			"body": "I've been meaning to ask: Does PeerMessage respect the connection settings(like `tor always` and so on)?\nAlso: Where is the repo for it?",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1555759542",
			"date_added": 1555786686
		},
		{
			"comment_id": 42,
			"body": "@Git Center: Neat, is there a repo for StreamZ?",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1555759542",
			"date_added": 1555788394
		},
		{
			"comment_id": 43,
			"body": "I'd say most of the time, actually.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1556668642",
			"date_added": 1556727379
		},
		{
			"comment_id": 44,
			"body": "@styromaniac@zeroid.bit: \n>I never knew why your dumb ass kept recommending Millchan to people.\n\nBecause Millchan currently is one of the most active(and content rich) zites on here. With chans(imageboards) being naturally pro freedom and heavily moderated on clearnet, it just kinda makes sense.\n>enjoy getting on a sex offender registry.\n\nI assume you refer to the bug, that caused millchan to sometimes download images from blacklisted boards. This to the best of my knowledge should be fixed, if it still happens **please report it to [/dev/](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/12NPW6WLFBLVivNGqijcfktARobftfLFAN:dev:b79fce8b-df0d-4ab4-a89e-4c37585aa6d1)** so it can be fixed. But that aside the you actually are more at risk here on ZeroMe, since avatar images are currently downloaded automatically(required). It takes only one guy on some popular hub to upload CP as his avatar and everyone that has downloaded that hub will then seed that image.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1556564853",
			"date_added": 1556728981
		},
		{
			"comment_id": 45,
			"body": "Reasonably fast, actually. Which is kind of surprising, since I effectively chained tor thrice.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1557665919",
			"date_added": 1557680675
		},
		{
			"comment_id": 46,
			"body": "I would also like to know that.\n@Nofish: ",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1557586567",
			"date_added": 1557680949
		},
		{
			"comment_id": 47,
			"body": "I made an account here!",
			"post_uri": "1LybGoL99LBuYE8ZtwgJC8dxkii3UmYKpo_1557567432",
			"date_added": 1557681052
		},
		{
			"comment_id": 48,
			"body": "@Mg0: +1\n@Whitehat13: It's actually pretty good.",
			"post_uri": "1L4bExNsLcQ3cUovePwQmvBoSVs1ufbC1y_1557836977",
			"date_added": 1557945488
		},
		{
			"comment_id": 49,
			"body": ">is using WhatsApp + interested in security? \nSyntax error.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1560779497",
			"date_added": 1560883589
		},
		{
			"comment_id": 50,
			"body": "@Realjohndoe: \n>Too toxic to even use as fertilizer..☠💀\nI'm absolutely not agreeing with that, but damn I really like that ~~sentence~~ insult.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1561394451",
			"date_added": 1561404095
		},
		{
			"comment_id": 51,
			"body": "Well [this](/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/view/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB/5@1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC) would probably be what you're looking for. I'm not sure when it actually gets implemented, though.",
			"post_uri": "16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm_1561469168",
			"date_added": 1561482348
		},
		{
			"comment_id": 52,
			"body": "I'm doing okay, I guess.\nGood to have you back!",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1562349206",
			"date_added": 1562354256
		},
		{
			"comment_id": 53,
			"body": "@Thunder: No sure if you were still around for it, but millchan now has a PoC [merger](/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/)([here](https://gitgud.io/millchan/merger/commits/master)(Clearnet) the source) version as well. I started to develop a moderating system for millchan got about one third of the way done before real life happened(it still does) and since about 3 months I couldn't find the time to finish it. As far as I know mcdev is pretty busy himself.\n\nAs far as zites go, I'm probably forgetting a lot, but [I2P+](/18UDHQbfX1A388SKvPHxXB1ZGFu9uRy1Kh) is pretty neat and [Pornstars as Kiddies](/13jS4xk2NK8vC6nH8SrGLNnEPqVFBNFXdT/) is more interesting then I thought (if you can get over the guy drooling over the toddler images)\n\nNoteworthy:\n- Keep away from `Natural Lust` on ZeroSites (ChildPorn)\n- Millchan got flooded with actually pretty active cosplay (softcore-) porn boards\n- I made some progress on [UFTS](/Talk.ZeroNetwork.bit/?Topic:1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC)\n- PedoHub is now comes in second(after moonhub, the current default) in terms of registered users\n\nThat's all I know, since I wasn't too active the past few months.",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1562349206",
			"date_added": 1562438051
		},
		{
			"comment_id": 54,
			"body": "@Thunder: AFAIK [Innocent childs room](/1J1epG5eMc4bsmh69UctBg4PHEe5B3kYHY/hubs.html) is still the most up to date list of hubs out there.\n>i suppose CP stuff still touchy topic on here\n\nI'm not sure I understood that. Was it ever not a touchy topic?\n>that shows they could be trusted with that\n\nI got to talk with mcdev a bit and can firmly say that he won't.\n\n\n@SSDifnskdjfnsdjk: \n>I am not sure why millchan dev not yet created some way for users to list all available boards and download those of interest.\n\nHe wanted to avoid having the obligatory CP-board on the frontpage and (I assume) to allow for 'private boards'(more like opt-in boards), where you only see a board if you somehow got it's address.\nI'm fairly certain that the final merger version will have a board index(maybe with an option to not be indexed on the board creation).",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1562349206",
			"date_added": 1562526597
		},
		{
			"comment_id": 55,
			"body": "@Thunder: \n>or else it defeats the point of merger hubs to begin with,\n\nThe main point, as far as I know, was to remove the trust that people have to put into mcdev and to make it possible for people to write their own *chan frondends (if they so choose to).\n>some people dont even want links to hubs deem questionable....\n\nUnfortunately it's more than not wanting to, in some countries knowing how to get CP(that includes links) is just as bad as owning CP in court.\nStupid if you ask me, but, well, I don't make the 'rules'.\n>any chance you have the one with the .bit one?\n\nIt's pretty outdated, but [here](/1GLndW2MJn7japuF3X2tbfBqgPMR52zaLQ) you go.",
			"post_uri": "1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K_1562349206",
			"date_added": 1562601734
		},
		{
			"comment_id": 56,
			"body": ">So, the only things that PyPy optimizes are\n\nAny archive/compression and all sqlite operations are significantly faster. Especially the sqlite speedups will be noticeable on bigger zites. ",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1569234619",
			"date_added": 1569258069
		},
		{
			"comment_id": 57,
			"body": "@Git Center: Never mind, my bad. I thought the values represented `time taken` and not `speed`.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1569234619",
			"date_added": 1569343569
		},
		{
			"comment_id": 58,
			"body": "@Git Center: I assume you mean /Benchmark.\nOh okay, so they are the relative slowdowns/speedups.",
			"post_uri": "1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di_1569234619",
			"date_added": 1569348980
		},
		{
			"comment_id": 59,
			"body": "@猫叉酱（小号）: +1\nAlthough I still don't understand why it was done this way.",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1576041242",
			"date_added": 1576090777
		},
		{
			"comment_id": 60,
			"body": "@Punkcoder: No, I mean why avatars are considered required files instead of optional ones. (Files that are marked as required are downloaded automatically by everyone that seeds the zite) ",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1576041242",
			"date_added": 1576171842
		},
		{
			"comment_id": 61,
			"body": "I may want to fuck children*, but at least I'm not a degenerate.",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578167672",
			"date_added": 1578334769
		},
		{
			"comment_id": 62,
			"body": "@styromaniac@zeroid.bit: The language is rust, Firefox is currently in the process of rewriting their codebase in rust, so that this doesn't happen anymore. The language itself was actually developed by mozilla.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1578649807",
			"date_added": 1578676131
		},
		{
			"comment_id": 63,
			"body": "@draugrdeathlord@zeroid.bit: All of my yes",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578709994",
			"date_added": 1578768232
		},
		{
			"comment_id": 64,
			"body": "@O0oo: There is [millchan](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA), the zite where 08chan was forked from, because of that millchan is a fair bit more up to date than 08chan is.\nCurrently the camgirl boards are the only really active ones, but keep in mind that there are probably a lot of people that lurk because of the low activity, so the best way to get more activity is to be more active. That goes for quite a lot of things, actually.",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578784236",
			"date_added": 1578848747
		},
		{
			"comment_id": 65,
			"body": "The smaller the boobs are, the closer your hearts will be when hugging.",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578800403",
			"date_added": 1578849571
		},
		{
			"comment_id": 66,
			"body": "@draugrdeathlord@zeroid.bit: It's a figure of speech, meaning 'I wholeheartedly agree with you'. ",
			"post_uri": "16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4_1578709994",
			"date_added": 1578849737
		},
		{
			"comment_id": 67,
			"body": "This is correct.",
			"post_uri": "1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS_1579107581",
			"date_added": 1579107130
		}
	]
}