{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1529424723,
			"title": "Feature: removal of the \"0 seeders\" songs",
			"body": "Hello, i have visited an music album on ZeroLSTN and found some songs claims to have 12 peers, BUT they do not play saying it was, skipped because of 0 peers.\n\nI have a worry that the initial seeder already deleted his/her ZeroNet folder, so these songs will be left there 4ever without being playable mayking the user experience worse because of album incomplete and not playing queues. How to solve it?\n\n- is there any way to allow automatic removal of the songs that long term does not have any seeders?\n- or internally maRking unseeded files for reuploading so there will be an option next to the song to upload alternative song and replace old or new uploads will somehow not complain about duplicate, but replace?",
			"added": 1529424722
		},
		{
			"topic_id": 1534583339,
			"title": "How to help ZeroLSTN by seeding all music files",
			"body": "If You are having good amount of free disk space (probably more than 100GB), you may help ZeroLSTN by downloading music and becoming a peer for others.\n\n1. Visit [ZeroHello](/) and type \"lstn\" into the search field that is above sites list\n\n2. You should see hubs that contains music (2010,2000,1990...) if you can not see it, visit [ZeroLSTN](/ZeroLSTN.bit) and play some music from the period you want to share..\n\n3. on ZeroHello, click the hub (2010,2000...) you want to share to open it, now drag & drop by mouse the (0) button to the left. (Note that apparently hubs under 1960 not contain any files, so you will not see the option.)\n\n4. in menu that appears scroll down and select \"Download and help distribute all files\" and set maximum size of the file to be downloaded (songs are usually up to 50MB (if in high .flac quality), .mp3 usually up to 15MB).\n\nit should start downloading files once there are peers\n\nThank you for helping distribute Zeronet audio library!",
			"added": 1534583337
		},
		{
			"topic_id": 1534612263,
			"title": "Content too large 170753482B > 10485760B, aborting task...",
			"body": "Hello, i have added some songs already, and today i added new album and when clicked to publish it, it says:\n\nContent signing failed\nContent too large 170753482B > 10485760B, aborting task...\n\nsame error appears when i try to edit some of the songs (they appeared in library and are playable, only not published to others i assume). The year of songs was 1995, i checked the hub, but i do not see i would be reaching any limit there. In hub (0) menu is: Identity address (limit used: 69.00kB / 976562.00kB)\n\n@ZeroLSTN can you please significantly increase my limit? Or such large content should not be uploaded yet?",
			"added": 1534612260
		}
	],
	"topic_vote": {
		"1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1529340445_1KF6VwFZn83rJDhgQMNigUao9EtLfzThG4": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1516760270_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_4_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I hope it is fixed now\nIt is, thank you.",
				"added": 1516959975
			}
		],
		"1518424138_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [],
		"1528385125_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 4,
				"body": "In my case i have been collecting music for years\nBest source for the music is Soulseek (http://slsknet.org), but you have to know which interpret you are looking for. The search will then return songs that match your search query. The download is P2P and usually fast.",
				"added": 1528387800
			}
		],
		"1529084834_1Md6YJNZX5yrdSaL9mmrKZNMAfULoXzMX2": [],
		"1529340445_1KF6VwFZn83rJDhgQMNigUao9EtLfzThG4": [
			{
				"comment_id": 6,
				"body": "Subscribbed, interesting to know this too.\n\n1. i guess you will appear like a regular peer/seeder. It is like that in case of ZeroTalk: [Anyone can explain zeronet debug.log connections regarding ZeroTalk new topic propagation?](/Talk.ZeroNetwork.bit/?Topic:1526907663_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)\nYou can actualy discover this yourself by analysing logs like i did in above linked post. Or maybe anyone already tried and knows the answer?",
				"added": 1529357718
			}
		],
		"1528064546_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": [
			{
				"comment_id": 7,
				"body": "Hi, please what are consequences of ticking \"This song is part of a compilation album\" checkbox? Assuming i am uploading an album (bunch of songs) or several albums that makes an \"compilation\"? Sorry english not native language for me.",
				"added": 1534886749
			}
		],
		"1534583339_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 8,
				"body": "@biglybt please kindly describe in detail the steps you did and ideally make a screenshot. Did you scrolled the (0) menu down? Anyone else have the issue?",
				"added": 1537181933
			}
		],
		"1547579440_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs": [
			{
				"comment_id": 9,
				"body": "Yes, same here @ZeroLSTN\nDoes the site become incompatible with current ZeroNet version?\n\nThe Firefox 64 developer console (F12 key) show this on console tab:\nContent Security Policy: The page’s settings blocked the loading of a resource at inline (“script-src”).\nContent Security Policy: The page’s settings blocked the loading of a resource at http://s3.amazonaws.com/publicjs/1f9b5d4c351a7d58ab.js (“script-src”).\nUnhandled promise rejection no such column: false all.js:56:33856 \nUnhandled promise rejection TypeError: \"ht is not a function\" all.js:56:33856",
				"added": 1548321182
			},
			{
				"comment_id": 10,
				"body": "OFFTOPIC POST:\n@klu9 yes, this is problem that there is no mechanism on many sites which would remove long term unseeded files. [KopyKate](/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh) can also be used to share music. https://rg3.github.io/youtube-dl/ and other downloaders can download audio only in webm format so it can be [added as a video](/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1547027714_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS) on a site like kopykate and also there is [IFS](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/) and [Kxovid](/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/), but none is easy to use as a media player (usually no playlist functionality, low number of content) so far.\nZeroLSTN is most close to nice music library site.",
				"added": 1548365853
			}
		],
		"1534612263_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 11,
				"body": "@insurgo: you can mention your blog address or try to check, modify the limit in content.json files of your site (i think this file will be somewhere in zeronet/data/yoursiteaddress/data/ sub folders). You can also search for \"content too large\" on ZeroHello, to find numerous tips on what to do.",
				"added": 1563489673
			}
		]
	},
	"comment_vote": {
		"4_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": 1,
		"18_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1_1LJMKSLPgM8fqQSMRrLzWB2DhVm1zoEVfZ": 1
	}
}