{
	"next_comment_id": 68,
	"comment": [
		{
			"comment_id": 1,
			"body": "Oh! Comments works now!",
			"post_id": 3,
			"date_added": 1475435203
		},
		{
			"comment_id": 2,
			"body": "> [alexs](#comment_1_1JEFK9PSB2KTgS6vAR5u9iuQZ4QiRMp4vw): Я бы не сказал что активность высокая - порядка 100-150 человек.\n\nПо сравнению с той же RetroShare тут просто аншлаг :)\n\n> А для хранения файлов было бы неплохо прикрутить ipfs.\n\nЭто удобно для фоток и файлов средних размером. Для хранения больших файлов IPFS фигово подходит. Тут бы было здорово интегрироваться с p2p-торрентами в браузере, типа https://webtorrent.io/",
			"post_id": 5,
			"date_added": 1476205490
		},
		{
			"comment_id": 3,
			"body": "> [renha](#comment_1_1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC): это как она так работает?\n\nНу, как. Поменял в одном месте, поменялось в других. Если офлайн — один фиг можно редактировать :)",
			"post_id": 9,
			"date_added": 1477390773
		},
		{
			"comment_id": 4,
			"body": "> [renha](#comment_3_1BidCEzNjETypKRCaRFQ6myvDo71o6FDyC): я думал вики не об этом\n\nНу так о чём хочешь, о том и будет :) Клонируешь себе и делаешь что хочешь.",
			"post_id": 9,
			"date_added": 1477402745
		},
		{
			"comment_id": 5,
			"body": "**httrack** тоже задачу не решает :-/\n\nПроблема в картинках, на которые ссылается страница. Т.е.:\n\n```html\n<a href=\"/full-image\"><img src=\"image\" /></a>\n```\n\nЕсли ограничиваться глубиной выкачивания `-r1`, то превьюшка качается, полная картинка — нет. Если ставить `-r2`, то выкачиваются, порой, тысячи файлов — вплоть до всего сайта.\n\nЕсли ставить фильтры по расширениям (`-* +*.gif +*.jpg +*.png +*.css +*.js`), то с `-r2` результат сносный. Но у картинок часто вообще нет расширения и этот метод не работает.\n\nЕсли ставить фильтры по MIME (`-mime:*/* +mime:image/* +mime:text/*`), то с `-r2` опять качается [почти] весь сайт, только что кроме картинок и html ничего не останется, но прочего итак мало. Если в mime убирать text/html, то, болезнь wget, не качается и та страница, которую сказали выкачать.\n\nБлин. Простейшая задача в рамках того, что уже умеют **wget** и **httrack**, но ни тот, ни другой, решить её не могут :D\n\n...\n\nВ общем, пока совсем забил на ссылающиеся картинки. Лучше иметь страницу с превьюшками и без полных картинок, чем не иметь ничего :)\n\nПримеры сохранённых страниц:\n\nhttp://gateway.ipfs.io/ipfs/QmVQzXn8pNGDMMdFneffktMKfrUFw7txFv6mBTo3SY71NM\n\nhttp://gateway.ipfs.io/ipfs/Qmb1Xxv8FoRhMYyqHWpc2hqiedWcS2sTy9eiwuqM5wFXBs\n",
			"post_id": 16,
			"date_added": 1479627416
		},
		{
			"comment_id": 6,
			"body": "Скрипт по добавлению страниц в IPFS начерно: https://github.com/Balancer/infonesy/blob/master/tools/pget",
			"post_id": 16,
			"date_added": 1479627610
		},
		{
			"comment_id": 7,
			"body": "> [viknet](#comment_1_15NKcuNBxibao8nCd8awsd5eCRRVVRB1uE): Тут основная проблема - непонятно зачем ZeroNet вообще нужен.\n\nНа данный момент это единственная активная и реально работающая децентрализованная не федеративная p2p-сеть :) Тут можно общаться и публиковаться без опасений блокировок ресурсов и без опасений того, что интересные ресурсы завтра исчезнут из сети.",
			"post_id": 17,
			"date_added": 1481092741
		},
		{
			"comment_id": 8,
			"body": "> [nicolaith](#comment_1_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): а просто два раза запустить, второй - с --no-clobber?\n\nТак задача не просто всё скачать, а чтобы оно потом в автономно юзабельном виде было.",
			"post_id": 16,
			"date_added": 1482493062
		},
		{
			"comment_id": 9,
			"body": "> [antignu](#comment_1_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Кроме простоты, это наверно ещё из-за заголовков.\n\nНу, в BBCode тоже активно применялся тег `[h]Заголовок[/h]`. Не все форумы его поддерживали, но в любом популярном можно сделать через custom bbcode.\n\n>BBCode больше распространен по форумам, где это не нужно. Зато богаче и понятнее.\n\nДля простого пользователя bbcode ничуть не более понятен, чем markdown :) Только для уже знающих html.\n\n>Так что вовсе не нужно \"везде переходить на Markdown\". Где-то он уместен, а где-то нет.\n\nНу, популярность его сама за себя говорит на графике google trends :)\n\n>А ещё в последнее время набирает популярность reStructuredText.\n\nТолько у узкой прослойки программистов :) У него практически нет преимуществ перед Markdown, но он явно сложнее. Если уж смотреть на альтернативы Markdown, то тут рулит AsciiDoc:\n\n- https://en.wikipedia.org/wiki/AsciiDoc\n- http://asciidoctor.org/docs/asciidoc-writers-guide/\n- http://www.methods.co.nz/asciidoc/\n\nНо у него очень мало шансов стать популярным. Не больше, чем у reStructuredText.",
			"post_id": 21,
			"date_added": 1483890217
		},
		{
			"comment_id": 10,
			"body": "> [antignu](#comment_2_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Практически любой форум имел редактор BBCode, что позволяло любому постоянному пользователю его выучить\n\nТак. Но Интернет постоянно растёт. И постоянно появляются новые пользователи, которым всё равно надо учить разметку с нуля. Поэтому более простые и наглядные языки разметки приживаются лучше.\n\n...\n\nBBCode так и не вышел за рамки форумов, а Markdown сегодня уже де факто самый распространённый стандарт для любой разметки кроме форумной. При этом форумы уже составляют очень небольшую часть общения в Интернете и Markdown уже начал проникать на форумы.",
			"post_id": 21,
			"date_added": 1483900045
		},
		{
			"comment_id": 11,
			"body": "> [antignu](#comment_3_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): И это собственно тоже не причина ему быть везде.\n\nКогда при прочих равных нужно выбирать между часто используемым в разных областях,  знакомым пользователям и простым средством с одной стороны и гораздо более редко используемым, узконишевым и усложнённым средством с другой стороны, то выбор обычно очевиден :D",
			"post_id": 21,
			"date_added": 1483903666
		},
		{
			"comment_id": 12,
			"body": "> [antignu](#comment_4_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Там же, где BBCode уже используется\n\nОчевидно, что «*при прочих равных*» уже автоматически подразумевает _новые_ проекты :) Поскольку, если уже есть проект с BBCode, то это _уже не равные_ с markdown условия.",
			"post_id": 21,
			"date_added": 1483946913
		},
		{
			"comment_id": 13,
			"body": "> [antignu](#comment_5_1JtVjiuh8wNNNS63aMT7sxjZx5jLtqGw4N): Не был бы столь уверен.\n\nЭто уже детали. Суть в том, что в целом в Сеть приходят всё более низко квалифицированные пользователи. Это и создаёт у некоторых впечатление, что пользователь тупеет :) Т.е. сугубо статистически это так, но не в персональных случаях: конкретные люди не тупеют :)",
			"post_id": 23,
			"date_added": 1484678676
		},
		{
			"comment_id": 14,
			"body": "> [tolstoevsky](#comment_1_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Email позволяет свести воедино намного более разношёрстный контент, нежели боты телеграма и паблики фкантактика.\n\nИ это плохо. Когда переписка идёт активная, то почта или валится в кучу сотнями сообщений или требует искусственной сортировки :)",
			"post_id": 23,
			"date_added": 1484726672
		},
		{
			"comment_id": 15,
			"body": "> [tolstoevsky](#comment_2_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): Вебчаты и гостевухи:-)\n\nНу, эти тут есть сразу в современном виде :)",
			"post_id": 27,
			"date_added": 1484736300
		},
		{
			"comment_id": 16,
			"body": "> [tolstoevsky](#comment_3_17ojMYQdaS8hyMgC3MB9gaTFmm4JJ4Hk1b): На это существуют фильтры типа  Sieve, например. \n\nВсё равно фильтры надо настраивать. Почта сама изначально не знает, к чему относится письмо. А внутри группы переписка вполне очевидно преимущественно идёт по теме группы :)",
			"post_id": 23,
			"date_added": 1484736410
		},
		{
			"comment_id": 17,
			"body": "> [zeroalx](#comment_1_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): В том смысле, что один логин для всех сайтов и всюду личные странички.\n\nНу, с одной стороны, единый логин — это только особенность реализации нынешних сервисов. Я на эту тему уже ругался :) Система-то позволяет работать с любыми идентификаторами, и локальные назначаются вообще автоматически. Но сервисы работают с одной системой.\n\nС другой стороны, нынешний Web тоже активно стремится к единому логину — через тот же Facebook или Google :)",
			"post_id": 27,
			"date_added": 1484759027
		},
		{
			"comment_id": 18,
			"body": "> [voland](#comment_2_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): А его как-то юстировать надо?\n\nЕго тестируют и калибруют при производстве, вроде.",
			"post_id": 29,
			"date_added": 1484925140
		},
		{
			"comment_id": 19,
			"body": "> [diomas](#comment_1_1PAnNhncRpwtUsy82YbLd7iBJHxTadBaUd): как это \"отношение цены в рублях к объёму ОЗУ и диска в Гб\"? объем диска и оперативка просто складываются?\n\nОтношение к произведению. Или, что то же самое, цену поделить на RAM и поделить на HDD.",
			"post_id": 30,
			"date_added": 1485369447
		},
		{
			"comment_id": 20,
			"body": "> [voland](#comment_3_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Хм, если под CloudAtCos понимается http://www.cloudatcost.com/ то таких цен у них нет\n\nДа, они сейчас этот тариф убрали, оставили только пожизненную покупку. Раньше у них в дополнение к пожизненной было $12/год при постоянной акции «скидка 50%» :) Так что было $6/год или $0.5/мес. У меня до сих пор там такой тариф. Хотя пользы мало, постоянно какие-то проблемы и отваливания. Так что только Tor/Squid там держу.",
			"post_id": 30,
			"date_added": 1485369574
		},
		{
			"comment_id": 21,
			"body": "Попался хостинг с очень вкусными дисковыми ценами (да и по обычным он в топе): https://www.time4vps.eu/pricing/",
			"post_id": 30,
			"date_added": 1485380672
		},
		{
			"comment_id": 22,
			"body": "> [dmi](#comment_1_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Так а чем не устраивает постгресовая репликация?\n\n- Postgres поддерживается существенно меньшим числом движков, чем MySQL\n- Postgres, насколько я в курсе, в плане сложных репликаций по-прежнему хуже MySQL\n- Postrges (как и MySQL) — пример классического централизованного сервиса для синхронизации которого с репликами требуется активное взаимодействие обеих сторон.\n\n>А остальное рсинком.\n\nОн тут вообще плох. По той же причине централизованного взаимодействия.\n\n> только там серваки надо брать железные и в одном ДЦ, типа хецнера\n\nВот. А речь идёт не только о свободной георепликации но и о выпадении узлов на произвольное время с последующим нагоном разницы. А приличные распределённые ФС очень плохо переносят даже георепликацию, не говоря уже о рассинхронизации :)",
			"post_id": 31,
			"date_added": 1487111275
		},
		{
			"comment_id": 23,
			"body": "> [dmi](#comment_4_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Вроде как в посте про частный случай речь идет, а сейчас универсальное решение обсуждать начали.\n\nОбщая задача на примере частного случая :) И, да, если частный случай рассматривать, то Postgres сразу отпадает, т.к. legacy-части системы к MySQL прибиты гвоздями :) Да и новые части, что с PDO, во многом требуют значительного перепахивания.",
			"post_id": 31,
			"date_added": 1487116260
		},
		{
			"comment_id": 24,
			"body": "> [voland](#comment_7_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Ну так это ж хорошо. Если б на головы все это рухнуло?\n\nНу так я ж и не говорю, что плохо :) Но смотрится круто.",
			"post_id": 38,
			"date_added": 1487678052
		},
		{
			"comment_id": 25,
			"body": "Я же потому и пишу «без плагина...» :) Среднестатистический пользователь ленив и не будет ставить плагин для того, чтобы увидеть картинки на каком-то левом сайте.",
			"post_id": 35,
			"date_added": 1487747194
		},
		{
			"comment_id": 26,
			"body": "> [zeroalx](#comment_4_1KzPxuhxTzgwGJozhLkZqXXcJYuZ6WiXSi): \n\nДа, 10-е годы — это уже почти «прошлое десятилетие» :) В принципе, для меня это «как вчера», но всё больше от молодёжи статей, типа  «как оно было в 2007-м году». Для них 2007-й, 10 лет назад, это как какая-то старая эпоха. Блин, а что тогда 1997-й? 1987-й? :D В этом году летом будет 20 лет моему первому сайту. В следующем — 30 лет моему первому программируемому устройству (МК-61)...",
			"post_id": 40,
			"date_added": 1488314682
		},
		{
			"comment_id": 27,
			"body": "> [mist](#comment_5_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Это смотря что понимать под \"нет красного\".\n\nТак и понимать :) В палитре нет цвета, который можно было бы оторванным от картинки назвать «красным». Разные сочетания серого и зелёного.\n\n> В палитре цвета красный есть, например.\n\nНет же. Вот тут справа палитра есть: https://pbs.twimg.com/media/C5uH9GVU0AAO78m.jpg\n\n",
			"post_id": 41,
			"date_added": 1488474326
		},
		{
			"comment_id": 28,
			"body": "> [mist](#comment_6_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Так в сером есть красный.\n\nНету. В сером цвете компьютера в RGB-модели есть значение красного канала. Но это не имеет ничего общего с _красным цветом_ :) Серый цвет — это не красный. Ни каким боком. При чём тут хотя бы можно натянуть сову на глобус того, что серый «природный» цвет может содержать красную составляющую спектра. Но возьми, скажем, спектрально чистый фиолетовый. Красного там нет вообще. Ни цвета, ни спектрально составляющей. А в RGB-модели красная составляющая там будет практически половинная.\n\nRGB-модель не имеет ничего общего с природными цветами и довольно мало общего с физиологией зрения. Она только обеспечивает информационную передачу цветового восприятия субъективно эквивалентного исходным цветам.",
			"post_id": 41,
			"date_added": 1488493441
		},
		{
			"comment_id": 29,
			"body": "> [mist](#comment_7_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): Но дисплеи работают именно с ней\n\nПри чём тут дисплеи? Такой же эффект будет и если распечатать картинку в CMY. И уж там красной составляющей не будет :)",
			"post_id": 41,
			"date_added": 1488533451
		},
		{
			"comment_id": 30,
			"body": "> [mist](#comment_8_17VmuVqxo9zqd17ysD7NVTdbYfkK3SxTcA): А бумага?\n\nТы про красную составляющую белого цвета? Один фиг, это уже и не красный цвет и не красная составляющая RGB :)",
			"post_id": 41,
			"date_added": 1488626335
		},
		{
			"comment_id": 31,
			"body": "> [dmi](#comment_10_1QCcM4agXg7FRWFzojQbbdLwvXBYzDk8P7): Если в спектре объекта есть хоть капелька красной составляющей, то, когда мы будем на него смотреть в красном диапазоне, то мы увидим засветку. \n\nЭто хорошо, но не имеет никакого отношения к понятию «красный цвет» :)\n\n>Не удивительно, что если в глазу есть отдельные \"красные\" колбочки\n\nОтдельных «красных» нет. Это уже софтовая обработка. И, повторюсь, это не имеет отношения к понятию «красного цвета». Хоть тресни, но серый, салатовый или фиолетовый цвета не являются красным цветом. Независимо от того, содержится ли там красная составляющая в RGB/CMYK. Как и независимо от того, возбуждает этот цвет L-колбочки или нет :)",
			"post_id": 41,
			"date_added": 1490024438
		},
		{
			"comment_id": 32,
			"body": "> [varakin](#comment_1_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Надо было ещё подпись автора сфоткать.\n\nПоскольку в комменты вставлять фото нельзя, вот, [отдельной записью](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:44:%D0%93%D1%80%D0%B0%D1%84%D0%B8%D1%82%D0%B8) :)",
			"post_id": 43,
			"date_added": 1494003129
		},
		{
			"comment_id": 33,
			"body": "> [varakin](#comment_3_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Ну, и подпись то, что надо :D\n\nЕщё бы понять, как её прочитать :D",
			"post_id": 44,
			"date_added": 1494042760
		},
		{
			"comment_id": 34,
			"body": "> [varakin](#comment_3_1BR2d8kCqCBaFWLQ9KXnNbJzLmcPJ3DdTL): Наверняка есть на просторах, как его найти теперь?\n\nГугл, поиск по картинкам рулит :) Это работа Василия Grino: https://34travel.me/post/angliya-ot-vasiliya-grino",
			"post_id": 44,
			"date_added": 1494060820
		},
		{
			"comment_id": 35,
			"body": "> [murka](#comment_1_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Потому давно перешел на всякие KeePassX\n\nПривязка к очередному сервису :) А если придётся внезапно где-то на левом чужом компе пароль ввести?",
			"post_id": 49,
			"date_added": 1494677222
		},
		{
			"comment_id": 36,
			"body": "> [zalex](#comment_1_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): Это не сервис.\n\nА что? o_O (Естественно, я имею в виду не *онлайн*-сервис, а локальный.\n\n> Ну твоя система еще лучше, даже на своём не всегда можешь ввести же :D\n\nЭто случается куда реже, чем надобность работать с посторонних машин :) В этом случае я *могу* забыть пароль. Но обычно, всё же, помню. А с KeePass без установки программы вообще не получится «вспомнить».",
			"post_id": 49,
			"date_added": 1494681366
		},
		{
			"comment_id": 37,
			"body": "> [murka](#comment_2_1NJRFrnoisi8yW8qJRXXaKXgBnXfUuZGfT): Я параноик и стараюсь не логиниться на чужих компах\n\nТебе хорошо. А мне — часто приходится :) Это не говоря о том, что только компов, с которых более-менее постоянно работаю сейчас штук 7-8 насчитал. Windows+Linux. А ещё к ним пара-тройка гаджетов под Android, откуда тоже логиниться приходится.",
			"post_id": 49,
			"date_added": 1494841991
		},
		{
			"comment_id": 38,
			"body": "> [radjah](#comment_1_1KMBUmz57LumMsDZfoZJkzZhXC6FVcZrik): А как же сякие кипасы и генераторы?\n\nВ комментах уже обсуждали :)",
			"post_id": 49,
			"date_added": 1503169446
		},
		{
			"comment_id": 39,
			"body": "> [paps](#comment_1_141e9kefECcifpcxtoyviANQw4fJRfq4jh): 3NE был редкостным говном :)\n\nВ его ценовой категории, по-моему, лучше ничего не было :) Это сегодня полторы сотни баксов почти карманные расходы. А в период популярности этого моника это было 2-3 месячных квартплаты :D",
			"post_id": 60,
			"date_added": 1507404374
		},
		{
			"comment_id": 40,
			"body": "> [runion](#comment_1_1Bm9NkdtYavTV3FvDtET1D6zjaJNa467YD): Мажоры  в 2002\n\nАдмины. Всего лишь админы :)",
			"post_id": 60,
			"date_added": 1509253885
		},
		{
			"comment_id": 41,
			"body": "> [promusik](#comment_1_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Если бы она была прямо по книге (я наивный юноша)\n\nНу, по Кингу невозможно делать хорошие и точные экранизации :) Слишком литературно-специфичные произведения. Впрочем, наверное, по любой крупной форме сделать хорошее и точное кино практически невозможно :D",
			"post_id": 71,
			"date_added": 1514971216
		},
		{
			"comment_id": 42,
			"body": "> [blinkel](#comment_1_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Достойное увеличения. Незнаю зачем, но мне тоже захотелось микроскопа)))\n\nА я камеру, таки, уже заказал :) Посмотрим, что получится.",
			"post_id": 72,
			"date_added": 1515174817
		},
		{
			"comment_id": 43,
			"body": "> [promusik](#comment_2_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Сейчас конечно зима, а так можно воды в соседней луже набрать, может там живности полно.\n\nОтветил с картинками :) — [Микроскоп. Кровь и что-то непонятное в воде :)](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:73:Микроскоп)",
			"post_id": 72,
			"date_added": 1515240125
		},
		{
			"comment_id": 44,
			"body": "> [blinkel](#comment_2_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Также интересно было бы взглянуть на воду из-под крана)\n\nНе, под краном найти что-то живое практически нереально. Даже в плохо очищенной воде микроорганизмы встречаются очень редко. А если хоть немного очищена, то вообще не встречаются :)",
			"post_id": 72,
			"date_added": 1515240183
		},
		{
			"comment_id": 45,
			"body": "> [promusik](#comment_3_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): На первом фото справа снизу один тип даже со жгутом, но это скорее всего мксор какой-то. Они не шевелились?\n\nШевеления не видел. Скорее всего просто мусор :)",
			"post_id": 73,
			"date_added": 1515322236
		},
		{
			"comment_id": 46,
			"body": "> [blinkel](#comment_3_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Еще не доехала камера? :)\n\nДоехала, испытывал :) Вот запостил: [Камера для микроскопа](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:79:Камера+для+микроскопа)",
			"post_id": 72,
			"date_added": 1516854451
		},
		{
			"comment_id": 47,
			"body": "> [tarakan](#comment_1_1K9LRqGZC7BkgT1SWaQDqmqZqxU1C2eNkR): А нахрена обратно воду закачивать от нее же?\n\nЧтобы получить вечный двигатель же :)",
			"post_id": 76,
			"date_added": 1517383405
		},
		{
			"comment_id": 48,
			"body": "> [blinkel](#comment_4_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Хорошие кадры, камера того стоила)\n\nЕсли найду софт, с которым у камеры можно выставлять произвольную выдержку, то будет второе ценное применение — в телескоп :) Сейчас туда зеркалку втыкаю, но у этого способа и свои плюсы, и минусы. Плюсы в том, что ISO выше и автономность полная, комп не нужен, минусы — износ затвора и большой вес на трубе, монтировка итак слабенькая :)",
			"post_id": 79,
			"date_added": 1517387579
		},
		{
			"comment_id": 49,
			"body": "> [nicolaith](#comment_2_1EA2A9K7M1agtM6gE2MWtiF26dYcaSLbh): наши подсолнечные семечки клюют - тока в путь!\n\nПодсолнечные там лежат, но жареные. Я пока в окрестностях сырых семечек нигде не нашёл :)",
			"post_id": 82,
			"date_added": 1517853443
		},
		{
			"comment_id": 50,
			"body": "> [blinkel](#comment_5_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): Красивые кадры)\n\nСпасибо :)",
			"post_id": 83,
			"date_added": 1518129444
		},
		{
			"comment_id": 51,
			"body": "> [dude](#comment_1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Сделай slow-mo захода на посадку :)\n\nТехнически сложно :) Невозможно же писать непрерывно с высоким FPS. Нужно придумывать какую-то активацию.\n\n> PS а козырек бы побольше сделал, чтоб снегом жрачку не засыпало.\n\nОт снега сбоку, один фиг, совсем не защитит. А от падения сверху защищает и эта. Я думал о козырьке ещё когда кормушку делал, но решил, что смысла нет.",
			"post_id": 84,
			"date_added": 1518276649
		},
		{
			"comment_id": 52,
			"body": "Чёрт. Опять черновик недописанный закоммитился :) Минут через 20 фотки добавлю.",
			"post_id": 87,
			"date_added": 1525593726
		},
		{
			"comment_id": 53,
			"body": "Вот, готово :)",
			"post_id": 87,
			"date_added": 1525594591
		},
		{
			"comment_id": 54,
			"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): О, идея. Надо сделать галку «черновик» для поста. Когда установлена, пост отображается только для владельца сайта.\n\nПроще тогда соответствующий тег, раз уж всё равно теги будут :)",
			"post_id": 87,
			"date_added": 1525600123
		},
		{
			"comment_id": 55,
			"body": "> [dorysan](#comment_2_1MHe9EDywJ7mrA52BikRPmbwQtQs1xNGEW): А мне повезло быть пионером последнего призыва :)\n\nА я чуть не стал комсомольцем последнего призыва. Но меня им так и не удалось заманить. Как раз в Мастодонте комментировал недавно :) — https://mastodon.wrk.ru/@balancer/100056278038547889\n\n(хотел ссылку на Френдику дать, где читать удобнее, но почему-то там не оказалось, хотя я сам на себя подписан и там, и там — какие-то проблемы межсетевого обмена).",
			"post_id": 89,
			"date_added": 1527079465
		},
		{
			"comment_id": 56,
			"body": "Перенёс записи из простого текстового файла и выложил на Google Docs. Сделал автоматический учёт курса. Также обновил и пополнил таблички. Но всё равно за это время накопилось много неточностей.",
			"post_id": 30,
			"date_added": 1527132071
		},
		{
			"comment_id": 57,
			"body": "> [geekless](#comment_3_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Не увидел в списке firstbyte.ru. Тарифы заманчивые, на счёт стабильности не в курсе.\n\n82 рубля за 384M RAM + 6G disk — удельно очень дорого. Получается price/ram/disk = 36, что будет худшим результатом в первой таблице :)\n\nТа же Аруба за €1 (72 рубля в месяц) даёт 1G RAM + 20G SSD.\n\n…\n\nВ Гуглодоках я обновил таблицу — у многих хостеров цены поменялись. Хотя принципиальных изменений нет, кроме того, что CloadAtCost больше не даёт помесячную оплату, а пожизненная — вопрос очень стрёмный :) На странице пока не обновлял, долгая история гуглодоки -> CSV -> Markdown -> ручное копирование :) Обновлю позже.",
			"post_id": 30,
			"date_added": 1527143061
		},
		{
			"comment_id": 58,
			"body": "> [geekless](#comment_4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): безлимитный 200Mbs 369 р. разве дорого?\n\nНе так, чтобы безумно дорого, но у Scaleway 1G/25G/200 unlim стоит €2, или 143 рубля по сегодняшнему курсу.\n\n> У того же FirstVDS хуже условия в этой ценовой категории\n\nКонечно. Он по таблице и получается очень невыгодным :)\n\n> Кстати, там есть на 100GB за эти же деньги\n\nПрямого аналога по памяти и винту нет, но есть среди безлимиток всё у того же Scaleway:\n\n- 2G/50G = 215 руб (кстати, есть VPS, а есть дедик ARM).\n- 4G/100G = 431 руб.",
			"post_id": 30,
			"date_added": 1527157019
		},
		{
			"comment_id": 59,
			"body": "Обновил таблицу.",
			"post_id": 30,
			"date_added": 1527165508
		},
		{
			"comment_id": 60,
			"body": "> [qiwi](#comment_1_1GP11T6BYKsTz63srBNo43iTjZaX461o3i): ого, ты старик! :)\n\nЯ суперстар! © :D",
			"post_id": 89,
			"date_added": 1527871266
		},
		{
			"comment_id": 61,
			"body": "> [voland](#comment_14_1ED5kEHUideKw92Ncess5yJmP4T2J5Aeqn): Вот так наверное и остается только ZeroBlog или блокнот...\n\nВ итоге я остановился на Телеграме + кросспостинг из него. Сейчас — готовые решения через IFTTT в Твиттер, Фейсбук и Mastodon.  Надо будет повозиться и сделать кросспостинг и в ZeroMe. А то у меня совсем этот микроблог заброшен :)",
			"post_id": 90,
			"date_added": 1529575023
		},
		{
			"comment_id": 62,
			"body": "Обновил первую таблицу и добавил [NFP Hosting](https://portal.nfphosting.com/cart.php?a=confproduct&i=0) via [@volkomorov@mastodon.host](https://mastodon.host/@volkomorov/100315114484214248). $12 в год за 2G RAM и 50G HDD — отлично. Но сам не щупал.",
			"post_id": 30,
			"date_added": 1530800042
		},
		{
			"comment_id": 63,
			"body": "Комментарий для теста картинки в ответе. Так с примерно того же ракурса Сокол выглядел в 2014-м:\n\n[![](https://gateway.ipfs.io/ipfs/QmUBeESNkbHX7B2cVaeeHvpuHVg1rrwqFP5vyK7h2BQFnL/CAM00193-800x.jpg)](https://gateway.ipfs.io/ipfs/QmWP1s9kiSoF7QfJvAi4PinSVqBWyscrof36KLd7e4Je4J/CAM00193.jpg)\n\nUpdate: ок, картинки тоже теперь можно вставлять :)",
			"post_id": 91,
			"date_added": 1531475508
		},
		{
			"comment_id": 64,
			"body": "> [iinhosin](#comment_1_1Gu5J44G3ur1Xnw2iZhZzHrgXUqrnHYbM3): а вовне ссылку на блог или на пост как бросить? Ссылка то содержит айпишник локальный типа.\n\nЕсть ZeroNet-прокси. Сайты обычного Интернета, которые предоставляют доступ к ZN. Они ненадёжны и часто выпиливаются, но, как временная мера для привлечения внимания годится.\n\nМеняешь `127.0.0.1:43110`  на адрес прокси, например, `www.zerogate.tk` — и ссылка становится доступной в обычном Интернете. Этот пост вместо\n\n[http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:90](http://127.0.0.1:43110/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:90)\n\nстанет:\n\n[https://www.zerogate.tk/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:90](https://www.zerogate.tk/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/?Post:90).",
			"post_id": 90,
			"date_added": 1532355435
		},
		{
			"comment_id": 65,
			"body": "Обновил таблицы только ради накопившегося изменения курсов. Из-за этого появилось некоторое несоответствие разделам, типа «до 300р», переделаю позже :)",
			"post_id": 30,
			"date_added": 1535887971
		},
		{
			"comment_id": 66,
			"body": "> [geekless](#comment_6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Отсутствует data/users/content.json\n\nА, чёрт, забыл его подписать после переименования сайта :) Пофиксил. Спасибо.",
			"post_id": 98,
			"date_added": 1539138731
		},
		{
			"comment_id": 67,
			"body": "Снова обновил таблицу по USDRUB=65,69 и EURRUB=75,05. Внёс изменения в тарифы Contabo. Печалька — Aruba больше не даёт сервера по €1/мес.",
			"post_id": 30,
			"date_added": 1540639603
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"32": 1
	}
}