{
	"posts": [
		{
			"id": "f05619a6-2b44-42ed-abf5-230d82345780",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "75811af1-83d5-4b97-a45f-6900d77748bd",
			"body": ">>75811af1-83d5-4b97-a45f-6900d77748bd\nThank you, fellow strelok. As the op of the 8ch /k/ thread, I was struggling to find a sufficient bunker to continue informing other streloks and I'm happy that the torch still shines for others.\n\n>>fc73c38d-d970-4d2b-bfbf-67735eb409d7\nYes and no. Having met a few streloks myself, we want to meet up to increase survival odds. IFF is for contacts already made or for more urban settings when wearing an icebreaker will encourage cooperation. More likely than not, your baofeng/cb/hf radio will be the best way to make contact for shtf. The IFF is for face to face or field operation ID. Nowhere is it implied that one should perpetually roll around in a flak and kevlar**, hasn't stopped me from wanting to though.**",
			"time": 1566775625197,
			"files": "[]"
		},
		{
			"id": "3b41a543-e0ab-4576-8e88-1e2cce027fbc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>d05790bd-2d6c-4c92-a5ca-c29b0d56eae4\n>>cdad1798-bec0-48c0-9c16-75bdbcdc39ae\n\nI went to 4ch first to get my fix, but goddamn its like a 100 noise:1 signal there, making it impossible to have a discussion. The shit reply cap of 300 makes keeping the rare conversation impossible. I noticed that the shilling/chat bots calm down around midnight est, but there's currently one sad schmuck that realised the bot shills can't reply to images in text, and caught some replying to retarded spoof data in filename, subject and name lines. Its like raking shit. I'm happy I've found you faggets.",
			"time": 1566776138134,
			"files": "[]"
		},
		{
			"id": "4fe50edd-9d57-4676-b629-99ed4a937151",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "d05790bd-2d6c-4c92-a5ca-c29b0d56eae4",
			"body": ">>5da2139a-0d5e-42ac-8118-f7a2a4b9b627\nIts maddening to think that most of social media are just chat bots or the agitprop or echo chamber variety. I'm just happy to see this place update with the few honest to God humans. Sadly, I'm missing /k/, /b/ and /christian/.",
			"time": 1567100197984,
			"files": "[]"
		},
		{
			"id": "f2c75bb6-55ee-46c4-af9d-d27f0bea700e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "75811af1-83d5-4b97-a45f-6900d77748bd",
			"body": "=='''REMEMBER TO LOAD UP ON BAOFENGS AND OTHER CHEAP CHINESE TRANSCEIVERS, THEY'LL BE ILLEGAL STARTING 1OCT19'''==",
			"time": 1567100334884,
			"files": "[]"
		},
		{
			"id": "7eec652d-d75c-4f39-8123-301d262abebe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>4a5d1ed4-dfcf-450d-8af4-320935c64917\nTesting using TOR. If it goes through, OP is a glow-in-the-dark CIA nigger.",
			"time": 1567295759583,
			"files": "[]"
		},
		{
			"id": "207be257-4a83-4534-a82b-55e28e4861ab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "k",
			"thread": "75811af1-83d5-4b97-a45f-6900d77748bd",
			"body": ">>58668ea5-d096-41cd-b674-f10708a9527e\nWho cares? No one should give a shit as you can easily handwave it away by saying you're there to rough it. Practice that radio craft with close friends or ham groups, as people will actively ignore/triangulate you if you sperg out on comms and interrupt nets out of protocol too much.",
			"time": 1567522179722,
			"files": "[]"
		},
		{
			"id": "760a4acb-9565-4ae0-a8e3-e7022f98a465",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ae61f59d-75fc-4817-a75c-dbfcf857e904",
			"body": ">>b9a7d833-3945-4972-81d3-76fb46e7529f\nBecause we're here discussing the corruption of art and fun for shekels, whilst you're being an escapist soyboy faggot who doesn't care that governments are corrupt, money is worthless, and we're careening towards the fall of babylon.",
			"time": 1567611133167,
			"files": "[]"
		},
		{
			"id": "b11e93cd-4844-40d5-89d7-d4de3042fc5e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"subject": "Orthodox Opinion",
			"body": ">>e554afc1-ac85-4caf-8b37-af56a1bb9f92\nUsing metaphysics. You don't have to argue for the existence of heaven when you know who Jesus, Paul, John are; So much so that you think of the evangelical (in the literal, not protty sense) people as the default. Even if you don't believe in heaven, the fact that ~2000 years after their life are continuously celebrated is insight as to what they mean by \"everlasting life\" and heaven. I myself, understanding this, is what compels belief in the supernatural, because the metaphysical \"shadow\" of Christian theology, which is founded in part by Grecian philosophy. Its why Christianity is so compelling because its founding fathers painstakingly arrived at the logical and metaphysical proofs for its supernatural claims. \n\nThe idea of Hell in and of itself is a convention of evangelizing the heathen nords in antiquity. Hel is the norse god of death, so her name and function were used for instructional purposes, which caught on. This is also true for the word hades, which is present in the kjv and the original greek. It was used as metaphor. Officially, the punishment for a heathen life is the separation from God, other than Jesus mentioning wailing, the gnashing of teeth, and allusions to a lake of fire, no theologian can truly say what form a \"separation from God\" entails. \n\nWhile I know that our motley crew have various opinions, just know that the jews have from the beginning have sought to bring down our religion. Think about the fact that protestantism arose from the same revolutionary spirit the jews are accused of, and owned the printing presses which printed out the vulgates necessary to foment dissent. Don't neglect the faith of your fathers solely to seem unique, as (((they))) bank on it to control your mind.",
			"time": 1567691204337,
			"files": "[]"
		},
		{
			"id": "1f1b0671-1393-41d1-9efa-db885f2a1ae3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ae61f59d-75fc-4817-a75c-dbfcf857e904",
			"body": ">>c966cb83-7188-410f-a59b-e6b3fbb27b1b\nStop being obtuse, all fiat ''CURRENCY'' eventually becomes worthless. You're about to live in such an eventuality. Enjoy your baby toys.",
			"time": 1567691764637,
			"files": "[]"
		},
		{
			"id": "c93fe5f8-37a7-4e0e-a850-34af09f0605b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "b",
			"thread": "7279efe3-3b83-42e3-aab7-fd71c5fa7976",
			"body": ">>7279efe3-3b83-42e3-aab7-fd71c5fa7976\nGit gud. **I wish there was a way to sage**",
			"time": 1567692052950,
			"files": "[]"
		},
		{
			"id": "4cb6b0fb-025b-4bad-876e-14f86f6e2810",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>57bacfae-0863-437d-a36b-edbc7c48ba31\n>Conflating neglect with understanding\n\nUnderstanding santa claus isn't real isn't neglect. You don't say the same thing about mathematics.\n\nJewish underpining =/= jewish. The only thing that Christianity takes from judaism is the chronology and the prophets. The core is philosophical and logical in the strict sense of the words. I get you wanna be a pagan larper, you're at your leisure. But understand that the philosophical foundation of both Greco-Roman and norse mythology is egotism, which naturally leads to solipsism. Where as Christianity is the culmination of stoicism, empiricism, asceticism, and objectivity, among other ideas. In fact, it is said that the Christian God is Objectivity itself. These ideas are the tools by which one best achieves not only individual, but also societal potential. There were no Christian wars of conquest with nords or romans, the ideas themselves were strong enough to conquer the world.",
			"time": 1567704778902,
			"files": "[]"
		},
		{
			"id": "482dbc43-5ef7-469c-b11a-5c8cf42a9009",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>6180b116-4ebf-4fad-afc9-ae242c1acfbb\n>omnibenevolent\nSuffering is something even Jesus endured. Don't conflate modern views of the faith with with its founding saints.\n>Universalist slave morality.\nIn the faith, only potential is universal. The faith acknowledges that we're all different, or else to make such a distinction would betray the notion. We are slaves to ourselves, it is only to being enslaved to God can we achieve our potential. \n>Your 3rd point\nBecause in essence their gods act the way men would wish to act or as personifications of ideas or capacity. Hermes is fast, Thor is strong,  polymorphing, invisibility, sexual charisma, etc. I argue that such mythologies were the original capeshit of today. mythologies never even attempted to establish social order outside of their creation myths: Its always mortals vs Gods. The myths themselves only established hierarchies among gods, not men.\n>Empiricism would necessarily demand a god that could be reached\nNot necessarily through the use of logic and metaphysics. Just as a higgs boson is known through its shadow, so do we through His creation\n>Christianity has no such teachings about the presence of their God in men's lives, for all the tales told in the Bible about the manifestations of the Holy Spirit.\nPaul went from a christian slaying moloch worshipping pharisee to having an encounter with Jesus himself. He even has to convince them later on that it wasn't a stunt on his side. Jesus walked among the high and low, manifesting himself to doubters after his resurrection. This says nothing of the many, as recent as 50 years ago, miracles performed by empowered monks and priests made saints.\n>Asceticism cannot happen in a religion which preaches against war\nPlease don't conflate desires for peace for literal pacifism, as there are canons establishing self defense, among other things.\n>Objectivity doesn't happen either...\nLet me put it to you like this: I'm a God, who only wants true believers. I allow even my own creation to deny, to their own detriment. Why would I then manifest myself obviously? I would betray myself to be so insecure and it prevents my own creation the freedom to deny me. I can create it, tell people I did, manifest myself to others for my purposes, ask them to spread the word, reel them in when they get too rowdy, and ask them to maintain order for their own sake. Can you honestly never remember a time in your life where if just one thing went different, you wouldn't be here to hit me with this babbys-first-fedora-tier stuff? The choice to believe is up to the individual.\n>Then why has Western society only gotten more and more degenerate since they were introduced?\nJews, dummy! Notice the lack of Christian monarchs in all of europe and eurasia.\n>Doubt\nUse the whole quote: \"...with nords or romans...\"",
			"time": 1567708353323,
			"files": "[]"
		},
		{
			"id": "60c2866d-65e9-4f8d-bee5-0ac1ca9f724d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "ae61f59d-75fc-4817-a75c-dbfcf857e904",
			"body": ">>4e649bd0-af0d-4c00-bce8-0e83a9c4dce5\nWell dude, when the guy who just a few years ago was all \"fuck moot, fuck cuckchan, free speech forever, etc etc\" a few years ago now is actively kiking against all of it and made himself moot2.0, it makes sense that we see him and his ilk for what they are: Traitors to a free society that allows you your baby toy escapism.",
			"time": 1567787550239,
			"files": "[]"
		},
		{
			"id": "45c79713-5a5e-448d-9690-47eb02333bee",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>33cb8904-01fd-4df5-8986-b0c58b8a14b1 (checked)\n>Jesus was God's benevolence coming down to \"save\" us...\nBy having all of his wrath directed on the only person on record to have never sinned despite having the chance. You can't go a day without kicking yourself for a past misstep.\n> A slave to himself is a master of himself also\nTell that to an addict. I guess you're the only man alive without vice?\n>3rd point\nThis is a contradiction at best. As I said, hierarchies were only among gods, not men.Chronos, zeus, hera, specific gods, demigods...\n>So what proof is there that the creation wasn't the bones and flesh of the jötunn Ymir instead?\nBecause it takes more faith to believe that than witnesses, compelled by their experiences, to discover and codify a symphony of logic and metaphysics. Or more succinctly, its why I'm not the one called a larper.\n>Yes, and? Jews are known for having personality cults based around charismatic rabbis\nExcept that in every case, those rabbi were exposed for the charlatans that they were. Why are you conflating jewish inventions with christian ones?\n>I bet you believe in the holohoax because people said it happened too.\nUnlike the holohoax, I don't have anything to gain from debating you like this. Paul should be a hint that you aren't the first edgy boy to hate on the cross.\n>But when have they ever opened themselves to the higher, spiritual aspects of war? Furthermore, where is such reference found in the Bible, the only truly Christian text?\nMany allusions to warfighting are made in the new testament. Jesus is said to bring a sword to the world, He himself made a weapon to chase the merchants from the temple, instructed his disciples to purchase swords, and only reprimanded peter against using the sword first. Not only that, but contextual exegesis of the gospel is where the christian concepts of self defense and war comes from. The concept of \"Just War\" is wholly a Christian one, stemming from the 5th century and evolving ever since.Technically, the conditions for such have been met for 70 years now, but it should go to show you just how far these jews go in suppressing the true faith from being practice.\n>Then how can we say God truly wants anything?...\nBecause he himself said it? It is his omnipotence that allows for his creation to choose him, because compelling or revealing himself would fundamentally discount your faith from wonder to entrapment. Your disingenuous \"why?\" questions only seem smart to you, until you realize that you ask those questions from ignorance rather than rhetorical purposes. I understand your ignorance,  questions such as these have answers in the text.\n>2nd to last point\nThat's really cute how you're pointing all of this out ex post facto. We don't even know the names of all the jewish families who are trying to finance our demise ''today'', with the power of the internet and cooperation. Yet somehow you think this would be an easier feat centuries ago.\n>Last point\nOlaf was a norse convert who chose to do that to his own people. He wasn't clergy and he wasn't coerced. The crusades started as acts of self defense. Just concede the point.",
			"time": 1567909407402,
			"files": "[]",
			"last_edited": 1567909431002,
			"subject": null,
			"capcode": null
		},
		{
			"id": "a40744c8-11ed-4a9d-95ff-59df83f51d47",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>9319dea5-5bfc-4610-a527-2ddb503bd546\nNegative, this was never even a problem until protties came along. Jesus' commission is Matt 28:19 \"go and make disciples of all nations...\" It was well understood that he asked that all individual nations, meaning people groups and not the modern definition, be evangelized those places. Nowhere in the new testament is it even implied that races are the same in terms of capacity, only in terms of possibility of salvation. Niggers, as lowly as they are, are still capable of heaven and canonization, if they live their lives for Jesus. Very few actually do, since the only nigger centric denomination is heretical since its phyletist. What happens even more regularly with low IQ groups is that they, without fail, will always try to mix their particular brand of animism with the faith. Going so far to morph their pantheon into saints, like central americans and the \"Santa Muerte\" and niggers who give pagan superpowers to the apostles and whatnot.",
			"time": 1568123001819,
			"files": "[]"
		},
		{
			"id": "8097d1f2-67ae-48b7-a826-5d490c2c0495",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "dc16d74e-4981-4a06-8b19-fd965624e443",
			"body": ">>6701bb2a-6979-4a56-b6aa-9264615538a7\n>Implying the shemitah didn't happen\nIf you look at the data from that time, a ton of fuckery was done to cover up what they had planned to happen. Think its a coincidence that the jews keep pumping and dumping the market before it crashes next year?",
			"time": 1568123893494,
			"files": "[]"
		},
		{
			"id": "ec86303a-281f-476c-8e74-0b03dc34652e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "5a9987f0-180c-433f-806f-dbffcf3c54a5",
			"body": ">>ec654e5f-4ae4-451a-a334-ecb3d47e613f\n>your race or your religion?\nMy religion lead to my race being supreme.\n>guilting white men over sins they haven't committed\nThe original sin is subjectivism, which is \"to be like a god.\" Meaning, having a point of view in contrast to objectivism, which God is.\n>In older traditions...\nAgain, the hierarchies were among the Gods. No religion (islam isn't a religion, its political doctrine in jewish rags) outright tells people how to organize and why it is to be. Even the jews just copied what they confronted.\n>...common decency\nStrawman.\n>Your point about rabbi\nYour original point is that other rabbi have claimed to be the messiah, and every single time they apostatized instead of dying for that believed. Own your arguments, let go of emotion.\n >Because Christianity is a jewish invention...\nYou're reiterating. Christianity is a new thing if only because it supercedes the precedent entirely. For example: Christians no longer sacrifice animals. You don't know enough about the faith to understand how you are wrong. Christianity is more Greek (and arguably Roman) than anything else.\n>Then why did you start, let alone continue?\nI'm already at the finish line, I'm waiting for you.\n>meme contradiction\nSee how easy that is?\n>Turn the other cheek\nUse the whole verse: But I tell you not to resist an evil person. But whoever slaps you on your right cheek, turn the other to him also.\n''Arguments against a reprobate are unfruitful, its better to end the discussion than waste words.''\n>carry a pack two miles instead of one\nIts a call to humility in the face of adversity. When there isn't a choice, why rebel when it means death? You can't do God's will dead.\n>I don't understand something so it must be wrong\nPersonal incredulity. I bet you came from a protestant, or worse, a heathen household.\n>Then where has it been attested in the Bible? \nFor someone who proves to be so ignorant about the subject at hand, and refuses to look, how is it my problem? Read it for yourself. \nhttps://infogalactic.com/info/Just_war_theory#Saint_Augustine\n>Only 70?...\nWhile true, you have to consider the criteria and argue that each criterion is met. Considering the state of the modern church, its why there's no movement in regards to mobilizing the lay.\n>Accusation of arrogance...\nStrawman, ad hominem, and personal incredulity. Look at what you write and the assumptions they rely upon. Think about that in the context of free will.\n>Given that...\nYou can say whatever you want. But considering your tenuous grasp of history, its hilarious that you think the same spain that committed a genocide against the jews wanted them in the first place. Its really easy to make all these spergy ex post facto statements, using ignorance as basis.\n>Accusation of pilpul\nHe wasn't under clerical orders for you to assert that I'm moving the goalposts. Review your own words\n>Crusades were against Europeans\nI guess those Romans sacked themselves? You have to be joking, are you really implying that people CHOSE to be muslims in their own lands?\n\nTry harder.",
			"time": 1568658234684,
			"files": "[]"
		},
		{
			"id": "b5a2fd8c-ef77-4894-8a9c-1a7eea09ad5d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fd5517ff-1c3d-4468-8897-7ea5345fa079",
			"body": ">>d052c0ac-21be-46b9-bf11-91c47680d433\n>Voat\n\nWhat the fuck is going on with that site, I lurked there but never made an account. Since the DDOS they haven't allowed any registrations and I'm sure they're the closest we had to an anti-reddit. Is there any way to ask the voat admins what the fuck is going on? I've emailed them without response, and all of their social media is fucking dead.",
			"time": 1570207129486,
			"files": "[]"
		},
		{
			"id": "c11c64b2-4590-4bff-aad6-8a5417b91966",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "fd5517ff-1c3d-4468-8897-7ea5345fa079",
			"body": ">>80cc8bca-f45e-450c-9b86-b4a32f698808\nIt wouldn't be so much of a problem if they at least let you lurk, but I'm completely shut out of the website without an account, and registration has been closed since 8ch went down. That place is legit, even if it was slow as hell and essentially regurgitated 8ch takes and links.",
			"time": 1570208217642,
			"files": "[]"
		},
		{
			"id": "d729b5ae-991c-45da-9116-4cbaf8855b7e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>3ab25b11-76d3-480a-8ef9-f04b4f3593ab\nNoice. But to be fair, cm is currently migrating boards, so its a matter of time until total functionality is restored. Can't wait, I love this place, but seems cm has a similar concept that uses tor like 0net.",
			"time": 1572962094296,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}