{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1632345620,
			"title": "Should i accept payments in Tether/USDT if i'm European ?",
			"body": "I principally pay everyting in €uro... some English advertising company offer to pay me in USDT/Tether stablecoin cryptomoney, should i take this form of payment, instead like Bitcoin ?\n\nI don't know any business or hosting companies accepting payments in crypto to use these USDT... do you have some recommendations ? Thanks !",
			"added": 1632345619
		}
	],
	"topic_vote": {
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1521980671_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1607912664_187kymsyr2UokvTuJMuSvFhhkL8v8AcX7A": [
			{
				"comment_id": 1,
				"body": "In which language ? JS ?\nSomething like : text.replace('<','>');  ?\n\nIf you're trying to pass this character to a server who will not be able to sanitize it, that's not really feasible if they already have something to sanitize users entries.",
				"added": 1608069716
			}
		],
		"1608854281_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "Same thing... one time i can access a forum, i reload the page.. it's gone & timeout..\nIt says you need to wait at least 30 minutes or more after launching it to collect adresses or peers or something like that.. but even if i give him hours i struggle with it to load anything.",
				"added": 1608857135
			}
		],
		"1609405437_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 3,
				"body": "Deleting it with an app that shred it multiple times (like really deleted, and recovery is impossible) in front of a notary or someone equivalent.. just after creating the website, but it's a bit overkill to pay for something like that.",
				"added": 1609418414
			}
		],
		"1609524025_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK": [
			{
				"comment_id": 4,
				"body": "Works good here.\n\nAlready visited it before, but didn't really like it since it seems to download way too much data (even if its metadata) for generating a preview thumbnail for the video.\n\nMy connection speed is at 100% during +10 minutes even if i don't click on any video, others sites are not like that.",
				"added": 1609525203
			},
			{
				"comment_id": 5,
				"body": "> [poutre](#comment_4_187XJ7rohVms73dqM2XftFNLuASoeTMU4X): Works good here. [...]\nAnd for your problem, try to remove/delete the site and then come back to it, i guess.",
				"added": 1609525260
			}
		],
		"1610152196_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 6,
				"body": "He joined an app called \"Parler\" and Google removed it from the store.. that's scary..\nI don't care about Trump or the app.",
				"added": 1610154514
			}
		],
		"1610356743_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 7,
				"body": "> [imblack](#comment_3_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY): Dark mode would be nice.\n\nThere's alreday one, go on the frontpage of ZeroNet ( http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Home ) click on the three dots near \"Hello Zeronet\", a menu should appear, you have a Theme category, and inside it a \"Dark\" option",
				"added": 1610409445
			}
		],
		"1610999130_1J46C7eJx1gagCBw898jtb8n3RCWp2EXQ1": [
			{
				"comment_id": 8,
				"body": "How do we block/mute someone here ?\nEdit : Found it, you can only do it on the posts list, not on the post itself.. -_-",
				"added": 1611002857
			}
		],
		"1620567834_173pXRMqj6vLLVMV92FuyxAJWmcD5mnQGh": [
			{
				"comment_id": 9,
				"body": "Just yesterday.. trying $DOGE for the fun of it, but i don't really want to put money in crypto for now (don't know which site to use to buy). Tried this thing to have some coins with the Folding@Home app to help research, don't know if it's gonna work.\n\nIf you have some to spare, just want to see a line on my wallet/transactions, any amount is OK, i'm curious/discovering the system, thanks everyone.\n\nDHcsifapmjMExKcAFALYUjf1CMAutMxBRf\ndogecoin:DHcsifapmjMExKcAFALYUjf1CMAutMxBRf",
				"added": 1620582950
			}
		],
		"1632251247_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 10,
				"body": "> [anonymouslogin](#comment_339_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Thank you. New ID too?\n\nIt looks like it's same ID, but the filename has changed.\nI put them both it the config form, don't know if it'll work, if i'm having trouble with trackers, i'll keep only the new one.",
				"added": 1632345906
			}
		],
		"1632345620_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": [
			{
				"comment_id": 11,
				"body": "> [antigov](#comment_1_1G43ZEBZNxHBg7YdpwRXjuGPsJbfxXtpoR): I would be cool with it. Its just like cash really but with you having to do extra work to get the assets you really want. The company is asking you to do this cuz USDT is a stable coin. This way they deposit money into an exchange and simply transfer it globally without worrying about volatility in the market. But... I you find yourself in a posistion where you have the ability to decide other payments. Then personally i would consider NANO over btc. I buy ASSETS not junk! And NANO is 100% far superior to BTC in every way. Its also free and instant transfers whereas BTC has mining costs. [...]\n\nI've been always getting paid in crypto (BTC), i started 2 months ago with them.\nThey're offering the USDT option recenlty but they've not pressed me to accept it, it's a second crypto option (BTC/USDT).\nSo yeah, no NANO either obviously.. i would've probably taken it too. Maybe if i try exchanges (buy/sell things, with a fee obviously)\n\nSooo.. i guess from your point of view, it's better if i take the payment in USDT (you really don't seem to like BTC, and i somehow understand it).\n\n(And i'm not a hosting company, but looking for one accepting this form of payment, most of my websites are hosted at OVH and don't know if they'll ever accept crypto)",
				"added": 1632347456
			}
		]
	},
	"comment_vote": {
		"392_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"4_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN": 1,
		"6_187XJ7rohVms73dqM2XftFNLuASoeTMU4X": 1,
		"7_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"14_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"15_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"1_17f8GjZyQQNfYkuSn9uF3hWbx9fSGfMYUL": 1,
		"1_1G43ZEBZNxHBg7YdpwRXjuGPsJbfxXtpoR": 1,
		"3_1G43ZEBZNxHBg7YdpwRXjuGPsJbfxXtpoR": 1
	}
}