{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1567661456_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1,
		"1567619378_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": 1,
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 1,
				"body": "> [schwifty](#comment_2_1AnyDvAnog1HqXEA4T8VARmoEcvLkjANEb): I'll assume OP is trolling but I'll play along \n\nDitto\n\n> [schwifty](#comment_2_1AnyDvAnog1HqXEA4T8VARmoEcvLkjANEb): The weird economics of monolithic internet services which are based on growth rather than market share are extremely tenuous. \n\nMonetary value is based on resource scarcity. Public data (including commercially shared data) have no natural scarcity because information is immaterial. Therefore such data have no sense of natural monetary value. There is not and there never will be an innate motivator for people to purchase such immaterial things except for people genuinely wanting to support the developer/writer/performer/publisher/artist/etc. Tenuous indeed, for many reasons. Hebrews gonna Hebrew.\n\n>[piracyisacrime]: You can't talk your way out of the justice that is coming to you.\n\nGood luck with enforcement, troll-kun. I'll make sure not to copy that floppy.",
				"added": 1567696361
			}
		],
		"1567661456_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 2,
				"body": "What's the difference between a feminist with blue hair and a mermaid?\n\nMermaids can actually sing and aren't fat.",
				"added": 1567696678
			}
		],
		"1567666768_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 3,
				"body": "Democracy is a real thing, but the things they call democracy today have no relation to the original idea. \"Democracy\" and \"Democratic\" today are Marxist code words. Marxists believe they represent the will and/or best interests of the working class/poor, so to them socialism is supposed to be democratic in the majoritarian sense. The phrase becomes redundant rather than contradictory because they live in a fantasy world where aristocracies can be prevented. They're special people with special ideas.",
				"added": 1567699970
			}
		],
		"1567571648_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 4,
				"body": "These sites were originally financed by glowniggers, and to a certain extent still are... FFS, Google's parent company is called ALPHABET. They're just advertising it at this point. Google and Facebook are the most ambitious intelligence gathering operations ever devised. The only thing I can think of that could even temporarily get them to willingly take the sites down would be a large-scale leak of damning videos of American politicians and bureaucrats doing the darndest things.",
				"added": 1567700891
			}
		],
		"1567619378_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 5,
				"body": "Thank you.",
				"added": 1567701259
			}
		],
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 6,
				"body": "> [caryoscelus](#comment_228_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): It's ironic to write that on decentralized net\n\nIs it? ZeroNet still relies on trackers for peering. DHT hasn't been implemented yet. You can make all the trackers you want, but how are the people who actually need them going to find them? Can people find your trackers fast enough to keep up with the rate at which the censors can take them offline? How long can this go on before people get fatigued with constantly having to update their tracker list? Can the network's current structure keep up with a multi-corporate barrage backed by mysterious US tax dollars? Do you want to find out?\n\n> [bigbadbob](#comment_576_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): In your opinion... What should people have done? What could people do?\n\nProtest in all the ways you know how. When people on the Right raise a fuss about free speech/freedom of the (printing) press, even your run-of-the-mill conservative, the narrative is that we're all just hate-filled, sexist White SupremaNazi incels looking for a place to openly plan mass shootings and harassment campaigns against innocent feminist journalists. Therefore nobody listens and politicians have no reason to listen either. Moderates/Left need to signal boost in order to break that narrative.",
				"added": 1567703039
			}
		],
		"1568199205_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g": [
			{
				"comment_id": 7,
				"body": "> [deunde](#comment_1_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g): many whose only intent is to trash ZeroTalk with hate speech\n\nHate speech is not necessarily trolling. Why are you surprised that suppressed ideas would eventually find their way onto a free speech platform?",
				"added": 1568206046
			},
			{
				"comment_id": 9,
				"body": "> [deunde](#comment_5_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g): if calling Hitler a great man or the new zealand shooter a holy person is free speech to you then FUCK FREE SPEACH\n\n>SPEACH\n\nIf you hate Hitler, then you're an ally to capitalism. Capitalism and Marxism are two sides of the same coin, in practice. Hitler was one of the few world leaders that actually managed to rout the beast out, a true lover of his people and friend of the working class.\n\nSaint Tarrant was also a lover of his people. If you can't see how love motivated his actions, then you're blinded by your own hate.",
				"added": 1568223055
			},
			{
				"comment_id": 10,
				"body": "> [deunde](#comment_7_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g): blah blah blah blah blah\n\nblah blah blah? Blah blah!",
				"added": 1568223259
			},
			{
				"comment_id": 11,
				"body": "> [aspidochelone](#comment_177_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Before, people believed in shit like \"rights\" and \"principles\" and \"freedom\".\n\nWhen a country's eligibility of citizenship no longer takes account of blood, the proper nation of that country has effectively been deprived its right to collective self-determination. In other words, true New Zealanders were already dead to rights, even if some of them didn't realize it yet. The Human Rights Act of 1993, now enshrined in the NZ Bill of Rights, fully substantiates this on its own. No other proof is needed. All people have been given the right to openly discriminate against and deprive the rights of people of European blood, but Europeans are put into a box and told that we can't retaliate.\n\nI would imagine that the people who are shocked by some young men not staying inside their box are also shocked by the audacity of the wind when they spit into it.\n\n> [deunde](#comment_8_16mvSmVfE3vjFTWzAd9hZFBoHE62TbtE8g): The only thing he has changed is ruining his own life \n\nThen why do you know his name?",
				"added": 1568235631
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 8,
				"body": "Link the archived version from now on. Especially when linking to WAPO. http://archive.is/YAZ5j\n\n>I just don't understand it. Why isn't there ever the kind of event that leads to a news story where a meme would come out \"Honk at 7 if she DESERVED IT!\"\n\nThere will NEVER be such a news story from any of the \"approved\" news networks. The tv/radio/magazine/newspaper media all became as centralized as possible the better part of a century ago, not long after WWII. There were a massive number of corporate buyouts and mergers that affect everything straight down to the local news level. Here's a video that was put out to attack Trump and Fox, \"Sinclair's Soldiers in Trump's War on Media\", and it's a perfectly accurate criticism. The thing is, the Democrats seem to have forgotten that they're guilty of literally the exact same thing with their own massive news networks. https://www.youtube.com/watch?v=_fHfgU8oMSo\n\nNot that I blame any of them. Keeping \"on message\" is what works. The problem is, who is deciding what \"the message\" is?\n\nBecause of the centralized and official nature of these very corporate structures, you will never hear \"they deserved it\" coming out of the media unless it's a story about Antifa beating up white people, destroying businesses, or tearing down America's history. The Republicans are too emasculated (and dominated by Neocon interests) to ever cross certain lines when it comes to political correctness. Both establishment Republicans and establishment Democrats have vested interest in maintaining the status quo.\n\nThe Democrats will only justify violence coming from the far left, and only when that violence is directed against an approved target. If Antifa or some other Marxist group tried to attack the UVA medical center, they'd be disavowed and the whole thing would be reported as the radical actions of \"fringe extremists.\" Or even more likely, certain sectors would try to muddy the water by claiming it was \"right wing extremists\" that wanted to attack a hospital because \"they hate babies and sick people\", knowing that most people won't fact check a few days after hearing about it.\n\nIf you want a media to be your ally, do what the Jews did and build a news network... One that puts out a meaningful message for a change. It's cheaper to do today than it's ever been. If you can't do it yourself, then put all of your might behind someone that's actually trying to. Don't think \"cameras and equipment\", think journalists and \"publishers\"/venues working together to reach more people. Consistently getting a single message to a large number of ears is what matters. It's basically magic.\n\nHere's some of what Uncle Adolf wrote about the press:\n\n>By far the most effective part in political education, which, in this connection, is best expressed by the word ‘pro- paganda,’ is that played by the press. The press is the chief means employed in the process of political ‘enlightenment . It represents a kind of school for adults. This educational activity, however, is not in the hands of the State, but in the clutches of powers which are partly of a very inferior character. \n\nThe following three paragraphs are from page 254 of the Stalag Edition.\n\n>But what sort of pabulum was it that the German press served up for the consumption of its readers in pre-war days? Was it not the most virulent poison imaginable? Was not pacifism in its worst form inoculated into our people at a time when others were preparing slowly but surely to pounce upon Germany? Did not this self-same press of ours instil into the public mind even in peace-time a doubt as to the sovereign rights of the State itself, thereby already handicapping the State in choosing its means of defence? Was it not the German press that understood how to make all the nonsensical talk about ‘Western Democracy’ palatable to our people, until an exuberant public was eventually prepared to entrust its future to the League of Nations?\n\n>Was not this press instrumental in bringing about a state of moral degradation among our people? Were not morals and public decency made to look ridiculous and classed as out-of-date and banal, until finally our people also became ‘modern’? By means of persistent attacks, did not the press keep on undermining the authority of the State, until one blow sufficed to bring this institution tottering to the ground? Did not the press oppose with all its might every move to give the State that which belongs to the State, and by means of constant criticism injure the reputation of the Army, sabotage general conscription and demand refusal of military credits, etc. — until the success of this campaign was assured?\n\n>The function of the so-called liberal press was to dig the grave for the German people and Reich. No mention need be made of the lying Marxist press. To it the spreading of falsehood is as much a vital necessity as hunting is to a cat. Its sole task is to break the national backbone of the people, thus preparing the nation to become the slaves of international finance and its masters, the Jews.\n\nSounds kind of like what we're dealing with today, doesn't it?",
				"added": 1568211423
			}
		],
		"1568493746_14iUZqEe5UECvSmywb1Q2x7mE1X1nf8nHU": [
			{
				"comment_id": 12,
				"body": "We use both because we're better than you.",
				"added": 1568494362
			},
			{
				"comment_id": 13,
				"body": "> [kidcourageous](#comment_226_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): The metric system is a jewish system of measurement \n\nHere I thought that Jews used base 6... With some extra zeroes.",
				"added": 1568502514
			}
		]
	},
	"comment_vote": {
		"69_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": 1,
		"91_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"106_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1
	}
}