{
	"title": "Pantopía",
	"description": "Posible en todos lados",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1480289009,
	"post": [
		{
			"post_id": 4,
			"title": "Velatropa, libres y sostenibles en la Ciudad de Buenos Aires, galos entre los romanos.",
			"date_published": 1480288739,
			"body": "Velatropa es algo más que un experimento social. Se trata de una aldea real en la que conviven más de cien personas y lo más sorprendente, ubicada en la misma ciudad de Buenos Aires.  El asentamiento se encuentra en los terrenos de la Ciudad Universitaria y ya tiene cuatro años de historia.\n\n---\n\nVelatropa, a unos minutos del Obelisco, se ha convertido en un espacio urbano en armonía con la naturaleza, donde quienes viven lo hacen en tiendas de campaña o en construcciones rudimentarias que ellos mismo han diseñado y construido con materiales reciclados.\n\nSi algo prevalece en Velatropa es el sentimiento de querer conectar con la Tierra, de encontrar el equilibrio mediante el intercambio de diferentes puntos de vista y de las tareas compartidas. Esta sociedad en la que no hay jefes, bien podría bautizarse como eco-aldea; incluso, recibe visitas los fines de semana para aprender de lo que se ha llamado la “convivencia alternativa”. Esos días, al caer el sol, plantan un árbol frutal  y ya cuentan con ciruelos, paltas y cerezos.\n\nSe nutre de jóvenes de entre 20 y 30 años de distintas nacionalidades y se organizan en dos consejos, que son los que toman las decisiones en reuniones programáticas que se realizan dos veces por semana. Esta aldea se ha convertido en un nodo ecológico de desarrollo sustentable, interdisciplinario y autogestionado por estudiantes de la UBA (Universidad de Buenos Aires).\n\nLa sintonía con la naturaleza es total: casas de adobe y desechos reciclados, reciclaje de basura para hacer compost y alimentar de vuelta a la tierra, talleres de huerta, bioconstrucción o anarquitectura (construcciones en los árboles)... todo desprende espiritualidad y, quizás por eso, comparte muchos signos con la civilización maya.\n\nSus huertas producen alcauciles, bananos, cebolla, apio, paltos, acelga y moras y es cuestión de tiempo que crezcan las primeras flores medicinales donde una vez sólo hubo escombros. Algunos de los que viven o, simplemente, trashuman del microcentro porteño a Velatropa, se desplazan siempre con bicicleta, disponiendo de un guardabicicletas comunitario.\n\nAunque siempre ha estado sobrevolando la amenaza de desalojo, éste nunca se ha producido y, de hecho, la propia UBA ha cedido una canilla de agua corriente que, sumada al panel solar para proveerse de luz, hace la vida más sencilla. En Velatropa no hay lugar para los excesos: está prohibido beber alcohol, sólo es posible fumar en un sector especial y todos son vegetarianos.\n\nEstos jóvenes, críticos con el sistema capitalista, eligieron vivir en un ámbito más creativo y menos consumista y ya han recogido firmas para que Velatropa forme parte de la reserva ecológica de  Ciudad Universitaria.\n\nSitio web de Velatropa   <A HREF=\"http://velatropa.org\">velatropa.org</A>   "
		},
		{
			"post_id": 3,
			"title": "Juntas del buen gobierno -Comunidades zapatistas-",
			"date_published": 1479854385,
			"body": "<center><i>Estamos trabajando para ofrecer contenidos originales así como videos, fotos y audios, contactar con los compañeros mexicanos de las comunidades autosugestionadas usando solo software  y sistemas libres no es muy complicado,  en este caso si contamos con compañeros cocientes de  esta necesidad.\n\nLa parte más complicada y trabajosa de este blog es ofrecer videos, audios y todo tipo de documentos, en formatos libres ya que muchos de ellos debemos convertirlos, luego está el asunto de como compartir media en zeronet, o al menos de manera libre y segura, estamos trabanado en ello y se aceptan sugerencias.</i></center>\n\n---\n\n*Copiapega de: http://www.nodo50.org/pchiapas/chiapas/documentos/jbg.htm  Escrito por un integrante de la Plataforma solidadira con los Zapatistas de Madrid*\n\nA raíz del levantamiento armado del EZLN el primero de Enero de 1994 y la jornada hacia finales del mismo año se declara la creación de 32 Municipios Autónomos Zapatistas en el estado de Chiapas, México. En el mismo año nace en Guadalupe Tepeyac el primer Aguascalientes y al año siguiente los demás: La Garrucha, Morelia, Oventik y Roberto Barrios, abarcando así todo el territorio zapatista (selva, altos y cañadas).\n\nLos Aguascalientes, transformados ahora en Caracoles, son lugares de encuentro entre la sociedad civil y el zapatismo. En ellos se celebran los “grandes” eventos zapatistas (Convención Nacional Democrática, primer encuentro intergaláctico); albergan reuniones, caravanas capacitaciones para promotores de educación y de salud y otros proyectos importantes como la ESRAZ (Escuela Secundaria Rebelde Autónoma Zapatista) o la clínica de Oventik.\n\nEl día 8 de Agosto nacieron junto con los Caracoles las Juntas de Buen Gobierno (en oposición al mal gobierno) y hay una por Caracol. En total son cinco que cubren todo el territorio Zapatista: J.B.G. “Hacia la Esperanza” Zona selva fronteriza, anteriormente La Realidad. J.B.G. “Corazón del Arco iris de la Esperanza”, antiguamente Morelia. J.B.G. “El Camino del Futuro”. Selva Tzeltal, antiguamente La Garrucha. J.B.G. “Nueva Semilla que va a Producir”. Zona norte de Chiapas, antiguamente Roberto Barrios. J.B.G. “Corazón Céntrico de los Zapatistas ante el Mundo”. Altos de Chiapas, Oventik.\n\nLas J.B.G. están formadas por representantes elegidos por mujeres, hombres y niñ@s de todas las comunidades zapatistas. Para hablar de que son y como funcionan las J.B.G. es necesario, al igual que cuando hablamos de Zapatismo, hacer una distincion entre las comunidades y el panorama internacional.\n\nDe cara a las comunidades podemos hablar de tres funciones fundamentales de las J.B.G. Por un lado un proceso de regionalización cuyo objetivo es fortalecer la unión y la coordinación entre las distintas comunidades, Municipios Autónomos y regiones, ya sea a nivel organizativo como también para los diferentes proyectos como pueden ser las cooperativas de mujeres, proyectos de educación, salud o agua potable.\n\nTambién es una respuesta a la Ley Indígena de Fox que aprobó el foto:la jornada Parlamento mexicano después de la Marcha de la Esperanza, donde parte de la comandancia Zapatista fue recibida en el congreso. Esta ley es una clara burla y no se corresponde con los Acuerdos de San Andrés firmados entre el Gobierno mexicano y el EZLN en 1995 y en muchos casos es peor a la ya existente (por ejemplo en Oaxaca) ya que las comunidades Indígenas pasan de ser Sujetos de Derecho a ser Sujetos de Interés, menoscabando el derecho de Usos y Costumbres o la elección de autoridades (entre otros), restringiendo así mas todavía algunos de los derechos adquiridos a lo largo de su historia.\n\nPor tanto la creación de las J.B.G. es la respuesta del EZLN al seguir construyendo autonomía hacia dentro -pero también hacia fuera, hacia el mundo- impulsando y fortaleciendo el autogobierno y la autogestión creando un nuevo marco jurídico en México que tiene a todos –desde intelectuales a gobierno y políticos- en un debate sobre donde queda esto en el mapa jurídico mexicano y que hacer al respecto.\n\nOtra labor de las J.B.G. es de alguna manera intentar compensar las diferencias en el nivel de desarrollo entre las distintas zonas.\n\nDe cara al exterior la creación de las J.B.G. significan una mayor coordinación y una recuperación del control sobre los proyectos de solidaridad internacional que llegan a las comunidades zapatistas. Se trata de que sean las comunidades las que decidan que proyectos y en que condiciones se pueden llevar acabo y cuales no, redistribuyendo los recursos según las necesidades de la zona y del momento.\n\nEstos cambios también afectaran a l@s Observadores Internacionales ya que se prevé un cambio en su funcionamiento –que presumiblemente será a través de las J.B.G.- aunque de momento se sigue trabajando, como hasta ahora, a través de Enlace Civil y el Centro de Derechos Humanos Fray Bartolomé de las Casas.\n\nPor tanto con el nacimiento de las J.B.G. se esta dando un fuerte impulso a la autonomía Zapatista y a la vez se sigue creando y construyendo “un mundo donde quepan muchos mundos”. "
		},
		{
			"post_id": 2,
			"title": "La mala educación o los curas en vez de enseñar robótica crean robots",
			"date_published": 1479845522.003,
			"body": "he publicado erroneamente en este blog,  leer aquí: http://127.0.0.1:43110/1EsymyEW97pFPJPQLqQairLdcDcVTxqKPR/?Post:17:La+mala+educaci%C3%B3n+o+los+curas+en+vez+de+ense%C3%B1ar+rob%C3%B3tica+crean+robots"
		},
		{
			"post_id": 1,
			"title": "Me gustan los horizontes lejanos pero no los que se alejan continuamente ",
			"date_published": 1433033779.604,
			"body": "Si, hoy comienza un blog anti-utópico, he leído Utopía de  “Sir Thomas More” y agradezco que las relaciones sociopoliticas descriptas en este libro como ideales queden del lado de lo onírico, de lo imposible, de lo que no ocurre en ningún lugar.\n\nEn este blog hablaremos de esos muchos lugares donde los humanos nos organizamos para vivir en armonía entre nosotros, el resto de los seres vivos y nuestro entorno. Donde nos relacionamos sin amos dioses ni estados, donde se reemplazan estos tres entes por respeto, colaboración y armonía. Desde las comunidades Zapatistas pasando por las huertas urbanas colectivas  de Detroit hasta los neojipis noruegos.\n\nEso es Pantopía, todo lo que no es Utopía. "
		}
	]
}