{
	"title": "★ reThink",
	"description": "decentralized autonomous\n  for open governance    ",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 2,
	"demo": false,
	"modified": 1459961353,
	"post": [
		{
			"post_id": 1,
			"title": "From Competition to Cooperation | Primavera De Filippi | TEDxCambridge",
			"date_published": 1433033779.604,
			"body": "https://www.youtube.com/watch?v=aYOPcHRO3tc&index=4&list=PLEuChFnzZLc0nXnc8NzC4puHJXZaAJzAW\n\nThe animal kingdom contains numerous examples of individuals cooperating with one another to achieve impressive outcomes without the need for planning, control, or even direct communication between agents – examples are bees, ants, and schools of fish. Humans, however, have only been able to achieve goals cooperatively through the imposition of organizational hierarchies, centralized coordination, and rules. Blockchain technologies offer a new approach, allowing us to achieve large-scale and systematic cooperation in an entirely distributed and decentralized manner. The application of this technology, however, has mostly focused on transaction-driven financial models like Bitcoin, but the Blockchain’s ability to transact and cooperate on a peer-to-peer basis, without relying on any centralized authority or middlemen, has many other applications. The Blockchain offers a new governance model with implications well beyond financial markets.\n\nPrimavera De Filippi is a permanent researcher at the National Center of Scientific Research (CNRS) in Paris. She is currently a research fellow at the Berkman Center for Internet & Society at Harvard Law School, where she’s investigating the concept of governance-by-design as it relates to distributed online architectures. Most of her research focuses on the legal challenges raised, and faced by emergent decentralized technologies – such as Bitcoin, Ethereum and other blockchain-based applications – and how these technologies could be used to design new governance models capable of supporting large-scale decentralized collaboration and more participatory decision-making.\n\nhttps://www.youtube.com/watch?v=aYOPcHRO3tc&index=4&list=PLEuChFnzZLc0nXnc8NzC4puHJXZaAJzAW"
		}
	]
}