{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1566909436,
			"title": "Photoshop contest",
			"body": "“If someone wants to have their photo taken with Hassan Rouhani, it’s not possible; it’s possible to do it with Photoshop,” the Iranian president said in an apparent reference to the idea of meeting with Trump.\n\nPlease do something with photoshop and Rouhani. \nI pledge 10 USD to the winner, the one who get more upvotes.",
			"added": 1566909435
		},
		{
			"topic_id": 1567461575,
			"title": "deepfakes are finally brought to the masses, thoughts?",
			"body": "ZAO app is apparently doing this https://www.theverge.com/2019/9/2/20844338/zao-deepfake-app-movie-tv-show-face-replace-privacy-policy-concerns\n\nhow will this impact the planet?\n\nimho: \na good impact will be that the internet - mainly ig and fb - will stop beeing used as a signalling system https://en.wikipedia.org/wiki/Signalling_theory (showing photos of you in the mountain, or the fancy bar, etc.) and will gradually return to the original idea of microblogging, so i see a really good outcome for this. \non the news side also, because principle of authority will be deadly wounded and so \"news corps\" will have an harder time getting the trust they need to survive.",
			"added": 1567461573
		}
	],
	"topic_vote": {
		"1540051200_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"1566876896_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1567013011_1JM6gfdXN5wnxLR2LmUuvx4216mtPzXmzB": 1,
		"1567450475_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1567461575_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": 1,
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 1,
				"body": "this is so stupid",
				"added": 1566700420
			},
			{
				"comment_id": 3,
				"body": "> [moneybadger](#comment_2_15dh9yJTSgewL53B9uMW7TTkJF7wHp1tge): yea it was that fukin mossad isralie \"art\" group gelatin that had full access to the floor that were hit a couple of weeks prior to the attack and were seen bringing in many boxes of fuse holders along some other suspicious activities. they are still around today and in 2005 have changed their name to \"gelitin\" and have relocated to  zionist hq  vienna austria. their website is gelitin.net. they are a group of 4 artist\n\nsure, i trust you, give me no references",
				"added": 1566727810
			},
			{
				"comment_id": 5,
				"body": "> [moneybadger](#comment_3_15dh9yJTSgewL53B9uMW7TTkJF7wHp1tge): what you want me to breathe for you also? I'm just giving you a bread crumb, find the way yourself\n\nif you don't think is the case to be kind with others you don't know how can you really argue flying planes into them is wrong? (anyway if you are into this kind of shit look also for 5 minutes at the image here https://en.wikipedia.org/wiki/The_Sphere and then look again at the fight club movie)",
				"added": 1566858514
			}
		],
		"1566595857_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 2,
				"body": "interesting",
				"added": 1566700910
			}
		],
		"1566815498_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 4,
				"body": "define \"political\", if it's political has to do with money, that's the short answer",
				"added": 1566856184
			}
		],
		"1566876896_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 6,
				"body": "you can start it time by time with the parameter `--size_limit`, or just change this line https://github.com/HelloZeroNet/ZeroNet/blob/py3/src/Config.py#L238",
				"added": 1566879273
			}
		],
		"1567013011_1JM6gfdXN5wnxLR2LmUuvx4216mtPzXmzB": [
			{
				"comment_id": 7,
				"body": "> [mg0](#comment_121_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Note that some books will only be available thru the TOR mirror of the site, so mind using the Tor browser bundle.\n\nsource? I never notice this (or example)",
				"added": 1567022584
			},
			{
				"comment_id": 8,
				"body": "https://unblocked.dk/#books",
				"added": 1567022627
			},
			{
				"comment_id": 9,
				"body": "> [mg0](#comment_122_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): ok, I tried looking for all the books I used to look for before, none are showing me the same banner as before but I'm sure it happened. by that time it didn't go by the name Z-library afaik, it was just b-ok and some books said that because of DCMA notices they had to disallow the download on the clearnet site and suggested to try the onion address of the site, in which the downloads were working.\n\nwell very peculiar, if it happens again just out of curiosity pls send me a zmail XD",
				"added": 1567042718
			}
		],
		"1566679861_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 10,
				"body": "> [hostfat](#comment_3_17ezFE1pdnXf9sFsoGvzZqxsZhX6DiQg4J): As I understand, this can happen everywhere, even on clearnet websites. [...]\n\nto avoid this you will simply need to add an option to disallow thumbnail download no big deal, it will be surely added.",
				"added": 1567463272
			}
		],
		"1567461575_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": [
			{
				"comment_id": 11,
				"body": "> [kaffie](#comment_1099_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Honestly as a girl it's kinda horrifying. And on the larger scale as well. Shit's gonna start hitting the fan and I don't think much of anyone is prepared.\n\nwhat does it changes exactly having an extra hole on this matter? can you explain? ",
				"added": 1567624150
			},
			{
				"comment_id": 12,
				"body": "amazing examples https://twitter.com/AllanXia/status/1168529623304396803\nfacebook trying to proactively fight the issue https://www.reuters.com/article/us-facebook-microsoft-deepfakes/facebook-microsoft-launch-contest-to-detect-deepfake-videos-idUSKCN1VQ2T5",
				"added": 1567650392
			}
		]
	},
	"comment_vote": {
		"3_17tQX9J2fScN9APmweSUnzEU4EfTG1ojYb": 1,
		"30_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"3_15dh9yJTSgewL53B9uMW7TTkJF7wHp1tge": 1,
		"3_17ezFE1pdnXf9sFsoGvzZqxsZhX6DiQg4J": 1
	}
}