{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1566725876,
			"title": "Central banks are printing money ...",
			"body": "and with that money the are buying crypto and precious metals and sell it back to you afterwards for a lower price.\n\nNever sell your cryptos / precious metals for fiat money",
			"added": 1566725875
		},
		{
			"topic_id": 1566815498,
			"title": "Why do stock markets react to \"political\" news ?",
			"body": "Since politicians are nothing but unreliable liars. Investors could simply ignore their statements.",
			"added": 1566815496
		}
	],
	"topic_vote": {
		"1566725876_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": 1
	},
	"next_comment_id": 13,
	"comment": {
		"1566725876_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 1,
				"body": "> [znnex](#comment_51_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): But what if it becomes cheaper than actual toilet paper? :)\n\nthen we can wipe our ass with it and at least have an ugly face printed on it :)",
				"added": 1566727516
			},
			{
				"comment_id": 4,
				"body": "> [eyeballgummy](#comment_2_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): btc is run by a computer algo, just like most of the fiat markets. btc is also run by the jews and they will draw a menorah in the chart just to prove you are mostly dumb fucking sheep every now and then. you can believe its legit buying and selling all you want, but the real fact is you know nothing about trading. For their is only two ways you will know the rich mans tricks, you are either born into the family who knows and keeps these secrets guarded or you have the time and observation to work it out for youself, you are neither!\n\nthanks for enlightening me !",
				"added": 1566740725
			},
			{
				"comment_id": 6,
				"body": "> [znnex](#comment_52_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): That person is definitely legit.slash ess\n\n:-D",
				"added": 1566755020
			},
			{
				"comment_id": 7,
				"body": "> [eyeballgummy](#comment_9_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): as legit as your inability to prove otherwise.\n\nyour posts are soooooooooooo eye opening\n\nthank you! thank you! thank you!",
				"added": 1566755156
			}
		],
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": [
			{
				"comment_id": 2,
				"body": "Most religions do promise\n\n- Eternal life in heaven for \"good boys\"\n- Eternal life in hell for \"bad boys\"\n\nWhat i always failed to understand: why do soooo many people have the desire to live forever? Living forever is fucking SCARY even in heaven",
				"added": 1566729245
			},
			{
				"comment_id": 5,
				"body": "> [eyeballgummy](#comment_1_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): Religion taught our masses education, hospitals, to read and welfare just to name a few.See western civilisation is a majority judeo-christion society. And you are a minority, a traitor and a heratic.being a christian myself, i would have no problem removing you so my majority culture can survive.\n\nbelieve in Jesus as much as you want, he's not going to help you\n\nif god really exists being kind and empathic is what matters to \"him\" , but that's something you are not capable of",
				"added": 1566741492
			}
		],
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 3,
				"body": "> [xcape2net](#comment_360_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I appreciate the well-thought-out response.  Perhaps we will just have to agree to disagree and watch to see what happens.   [...]\n\nIf you choose to remain in the fiat money system you will definitely lose. The Buffets, Dimons, Epsteins on earth will steal your money from you.\n\nBut with cryptos you have at least a chance to escape. Cryptos should be given a chance - as an investment.",
				"added": 1566739013
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 8,
				"body": "> [eyeballgummy](#comment_14_1J5Wtmn9wNyHworyYAXey4A3psfENk6U3M): Silver is worthless! The only reason you buy silver is if you dont know its worthless!\n\nif there is one thing that is worthless it is your opinion",
				"added": 1566807271
			},
			{
				"comment_id": 9,
				"body": "> [znnex](#comment_59_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): But what about all of the enlightenment :(\n\nGot it wrong. He is indeed very enlightening !\n\nPrecious metals and crypto are worthless it is waaaaay better to keep your money in a bank and lose it to inflation.",
				"added": 1566811194
			},
			{
				"comment_id": 12,
				"body": "they are also many greedy, weak minded fools selling their precious metals when the price rises back to central bankers, which buy them back with the fresh toilet paper they printed for it",
				"added": 1566827146
			}
		],
		"1566766301_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 10,
				"body": "the Aggressor here is not some random person entering your property , it is the Politician in Brussel :-D",
				"added": 1566813793
			}
		],
		"1566746537_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": [
			{
				"comment_id": 11,
				"body": "> [gitcenter](#comment_770_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): O_O He might not be a single person (conspiracy theories, yay), but he's real at least.\n\nhe's real , smart and a really attractive man ( btw. i'm straight ) \n\nnofish thanks for ZeroNet",
				"added": 1566821700
			}
		]
	},
	"comment_vote": {
		"59_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1
	}
}