{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "@zc456 @subpixel\n\n> Only the ASIC resistant currencies will survive\n\nHi, how as a noob can i discover whether certain crypto is resistant?",
			"post_id": 52,
			"date_added": 1519999225
		},
		{
			"comment_id": 2,
			"body": "Is there any reason why Bitcoin should not improve and become more usable cryptocurrency with low feed and quick transactions? Though some people say Bitcoin is not good and fast in adopting new things.",
			"post_id": 53,
			"date_added": 1520001884
		},
		{
			"comment_id": 3,
			"body": "> You'll be hopping from currency to currency once the because the network is non-existent outside of the miners because no one will be there to pay for the fees.\n\nI would welcome if you can try to talk about this more as i do not get that sentence.\n\nDo not try to push your friend into something, he will not like it. If you face some evidence that support your claim you may say it, but i would not push.",
			"post_id": 62,
			"date_added": 1527065163
		},
		{
			"comment_id": 4,
			"body": "> [zc456](#comment_8_1A6rok3j9w6paahtGoxrePy7SSkMz5A48s): there so many cryptocurrencies out there I find it hard to believe the networks would be active enough.\n\nYes, i have same opinion. I would pick low ranked (http://coinmarketcap.com/) coins only if it had web wallet/paper wallet and was looking significantly inovative, trustworthy and good discussion around. But i deposited only in BTC, LTC (minimum) and ETH. I have something in NAV and zCash but those two only because someone sent me money. I focus only on using BTC and ETH and also i will be looking into IOTA and Monero. For monero i think i have not found paper wallet that would seem trustworthy. Was interested about Stellite (introduced on ZeroTalk) though i do not trust Stellite per their social network behavior.",
			"post_id": 62,
			"date_added": 1527195603
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"50": 1
	}
}