{
	"next_topic_id": 50,
	"topic": [
		{
			"topic_id": 20,
			"title": "孟德斯鸠在《论法的精神》一书中写道：",
			"body": "“专制政体如土耳其的刑罚极为简单，只求结案。而在宽和政体下，即便是最卑微的公民，他的生命也是最可宝贵的，不经过仔细的审查，决不能剥夺他的荣誉和财产。共和政体下的司法程序也繁复。在共和政体下，人人平等；在专制政体下，也是人人平等。在共和政体下，之所以人人平等，是因为人就是一切；在专制政体下，之所以人人平等，是因为人一钱不值。”",
			"image": "",
			"added": 1494926219
		},
		{
			"topic_id": 27,
			"title": "ipfs使用方法介绍",
			"body": "ipfs使用方法介绍\n\n下载：\n\nhttps://dist.ipfs.io/#go-ipfs\n\n解压出来一个go-ipfs文件夹。将这个文件夹放到你喜欢的地方。我是放在C盘。\n\n1，先检查是否可用\n\n打开命令终端，输入命令：\n\nC：\\>go-ipfs/ipfs help\n\n出来一堆东西如图1，图2.这样就表示可用了。\n\n2，进行初始化：\n\nC：\\>go-ipfs/ipfs init\n\n出来一些东西如图3.初始化完成。\n\n3，输入这个命令：\n\nipfs cat /ipfs/QmYwAPJzv5CZsnA625s3Xf2nemtYgPpHdWEz79ojWnPbdG/readme\n\nC：\\>go-ipfs/ipfs cat /ipfs/QmYwAPJzv5CZsnA625s3Xf2nemtYgPpHdWEz79ojWnPbdG/readme\n\n出来一个欢迎界面如图4，表示成功了。\n\n4，输入“快速开始”命令\n\nipfs cat /ipfs/QmYwAPJzv5CZsnA625s3Xf2nemtYgPpHdWEz79ojWnPbdG/quick-start\n\nC：\\>go-ipfs/ipfs cat /ipfs/QmYwAPJzv5CZsnA625s3Xf2nemtYgPpHdWEz79ojWnPbdG/quick-start\n\n出来很多命令。图5显示一部分，其它很多命令我们不关心。\n\n\n5，另外打开一个命令终端，输入命令ipfs daemon。\n\nC：\\>go-ipfs/ipfs daemon\n\n显示如图6.这样就把所有的准备工作都做好了，可以开始上网了。\n\n6，打开一个浏览器在地址栏输入\n\nhttp://localhost:5001/webui\n\n浏览器显示如图7，图8，图9，图10.\n\n7，在图10的搜索栏输入：\n\nQmPEKipMh6LsXzvtLxunSPP7ZsBM8y9xQ2SQQwBXy5UY6e\n\n显示如图11.点击下载按钮就会看到一只猫咪。\n\n好了，其它的东西你自己去研究，我也是刚刚开始使用，还不是很明白这东西。",
			"image": "",
			"added": 1504768097
		},
		{
			"topic_id": 28,
			"title": "台湾人权活动家：共产党是不把人当人的党",
			"body": "“我们必须打造一种文化，珍视人类纯真生命的尊严和神圣，”美国总统特朗普星期四（2月7日）在年度全国祈祷早餐会上说。\n\n他的讲话被台下来自150个国家的数千位宗教领袖、政策制定者、工商界人士的掌声打断。\n\n“所有的孩子，不管是出生的，还是没出生的，都是按照上帝的神圣形象创造的，”特朗普说。\n\n更长时间的掌声和欢呼声在华盛顿希尔顿酒店的大厅里响起。\n\n掌声平息后，他继续说：“每个生命都是神圣的，每个灵魂都是上天所赐的珍贵礼物。”\n\n美国对华援助协会主席傅希秋是现场起立鼓掌的听众之一。早餐会结束后，他对美国之音说，总统的这番话“包含了对人权、自由的核心基石的尊重”。\n\n他说，特朗普也特别提到，本届政府的优先课题就是“捍卫、保护、推动宗教自由，不管是美国国内还是国际的宗教自由”。\n\n早餐会上的另一位主旨演讲者、非政府组织“国际公义协会”的创办人兼总裁侯嘉理（Gary Haugen）说，恐怕很少有人知道，当今世界的奴隶人数比人类历史上任何时候都多。\n\n“现代奴隶制比以往任何时候都广泛和残酷，”侯嘉理说，据估算，全球目前有4000万人被奴役，其中70%以上是妇女，每四名奴隶中就有一人是儿童。\n\n一天前，在华盛顿智库哈德逊研究所一场关注新疆问题的研讨会上，美国共和党籍联邦参议员汤姆·科顿（Tom Cotton）说，新疆自治区党委书记陈全国就是“中共政治局在西藏和新疆的奴隶主”。\n\n科顿说，在新疆，80万乃至数百万的维吾尔人正被拘押在“当代的古拉格群岛”。\n\n“台湾关怀中国人权联盟”理事长杨宪宏已经是第五次从台湾来美国参加全国祈祷早餐会。他对美国之音说，“奴隶制”这个词可能不足以描述共产党政权的邪恶。\n\n“我们认为共产党是不把人当人的一个党，”他说，“我们有时候很难理解共产党为什么用这种方法去对待别人，因为它没有把他当人。”\n\n杨宪宏是台湾资深媒体人，在中央广播电台主持一档名叫“为人民服务·杨宪宏时间”的节目。自2005年开播以来，他电话采访了海峡对岸包括刘晓波、高智晟、胡佳、陈光诚在内的许多著名维权人士。\n\n谈到为何长年推动台湾声援中国人权，杨宪宏说，他和盲人维权律师陈光诚曾达成过这样一个共识——你不把民主自由送到中国，它就把专制独裁送到台湾。\n\n“我很害怕，我为什么这么多年一直在中国的议题上这么努力，就是我相信这个事情。当我们没有把民主自由送进中国的时候，中国会把它最邪恶的东西送到你家，所以我们必须做，”他说。\n\n杨宪宏告诉美国之音，此番来美国，他感受到美国正越来越多地强调“人的基本价值”。美国政界高层近来的一系列讲话显示，触发美中紧张关系的不是单纯的贸易问题，而是两国在核心价值上的对立。\n\n“我认为川普和彭斯正用非常隐喻式的方法告诉中国，你不进行政治改革，你根本没有办法好好跟我谈所谓贸易问题，”杨宪宏说，“人权必须是两边谈判中最核心的价值”。\n\n来源：美国之音\n作者：萧雨，宁路",
			"image": "",
			"added": 1549605081
		},
		{
			"topic_id": 29,
			"title": "《春梦》 大师兄",
			"body": "梁家河子铺垫，\n福建浙江装蒜， \n背着书单，\n迈着歪步，\n跛脚走向世界。 \n可那知，\n天不作美，\n迎头撞见川普， \n春秋大梦犹在， \n却不料， \n日过三竿卷帘起，\n但只见， \n楼下换了人间。",
			"image": "",
			"added": 1559138254
		},
		{
			"topic_id": 30,
			"title": "这个迷团也解开了",
			"body": "川普上任初期一直感叹普京，习猪头这样的独裁者有很大的权力。\n\n很多人都据此得出结论，川普是个独裁者。当时我也感到奇怪，川普怎么会有这种想法，民主社会与专制社会是不同的，他应该明白的，怎么还会有这种想法，真是个大嘴巴，说话不考虑影响。\n\n直到这次大选，我才明白川普为什么会有这种感叹。\n\n川普早就知道美国的政治体系出了问题，是行政，司法，立法普遍性地出了问题。除非有独裁者的权力，无法改变这个现象。\n\n所以他才会有这个感叹。经过这次大选，我们也看到了结果，我也解开了这个谜团。",
			"image": "",
			"added": 1611631830
		},
		{
			"topic_id": 31,
			"title": "对美国公司之说有兴趣的人可以这样去了解",
			"body": "关于美国南北战争时期的一些事，应该可以查清楚的。南北战争时期，林肯确实遇到财政无法持续的问题，后来通过股票市场募集资金，最后才打赢了战争。这个在一般的美国历史书上就能读到的。我很久以前就读到过这段历史。\n\n林肯是通过发行战争债券募集资金的。\n\n如果能查到当时林肯到底发行了多少战争债券，战争的军费到底有多少？大概就能知道是否还有其它形式的借款与抵押。\n\n然后，当年的战争债券后来是如何偿还的，偿还了多少？这些应该都有资料可以查到的。\n\n知道了这些，就能够知道华盛顿特区抵押给国际银行家的说法是否确实。",
			"image": "",
			"added": 1611652107
		},
		{
			"topic_id": 32,
			"title": "这个谜团也解开了，不过又留下了一个新的谜团。",
			"body": "川普团队有两个人的离开应该大家都印象深刻，一个是班农，另外一个是波尔顿。我以前不关心美国的内政，所以班农为什么会离开我并不清楚，看网上一些说法好像是被幕僚挤走的。波尔顿的离开我知道原因，是在伊朗，委内瑞拉的问题上与川普有分歧。\n\n我当时很不理解，班农与波尔顿都是很强硬的鹰派人物，是川普的好帮手，川普怎么会让他们离开呢？尤其是波尔顿，不过是主张用军事手段解决伊朗与委内瑞拉的问题，川普主张斩首主要的成员，这分歧也不至于闹到分手吧。\n\n经过这次大选我才明白，其实川普与班农，波尔顿的分歧是在抽干沼泽。川普是要先抽干华盛顿沼泽，而班农，波尔顿并不了解川普的这个优先目标。\n\n那问题就来了，班农，波尔顿都是川普班子的主要成员，他们怎么会不知道川普的这个优先目标呢？难道川普没有与他们商讨过？\n\n川普一直在说抽干华盛顿沼泽，那么他的行政团队讨论过怎么抽干华盛顿沼泽吗？制定过具体的方案吗？目前看来川普的行政班子没有制定过抽干沼泽的具体方案，否则这次大选不会这么被动。\n\n难道川普打算以一个人的力量来抽干华盛顿沼泽？这太不可能，应该有其它团队，或者说有其它势力。\n\n那这个团队或者势力是哪些人呢？这是一个新的谜团。\n\n从川普就任初对独裁权力的感叹来看，应该是军方。因为川普不可能在美国拥有独裁权力，而能行使类似独裁权力的唯有军事管制。\n\n那么彭配奥是否知道川普抽干沼泽的计划？彭斯是否知道川普抽干沼泽的计划？这也是个谜团。\n\n彭配奥说过，在彭斯付总统的领导下完成了一次非常曲折的军事行动，这军事行动指的是什么呢？\n\n新的谜团等待解开。",
			"image": "",
			"added": 1611710444
		},
		{
			"topic_id": 33,
			"title": "美式民主已经走到头了，需要重新改造了。",
			"body": "这次美国的大选，让我们看到美国的宪政体制已经全面腐败了。\n\n自从美国这次大选以来，我就一直在思考，美式民主与中国以前的皇权体制的差别。其实这两种体制并没有多大的区别。美国的民主普选与中国以前的民主科举，也并没有多少本质上的区别。\n\n中国以前的皇权体制，一般都能维持200-300年，既然没有多少本质上的区别，美国的宪政体制经历了200多年，从时间周期上来说，也运行到头了。\n\n中国以前的皇朝，运行200多年后一定会出现皇朝更替，进行改朝换代。\n\n换一个皇帝与改朝换代有什么区别呢？表面看来并没有区别，一朝皇帝一朝臣，整个中央政府都改变了，为什么不解决问题？为什么旧皇朝还是无法运行下去？非得改朝换代？\n\n其实，旧皇朝无法运行下去的真正原因并不在皇帝，并不在内阁，也并不在律法，而是在官僚体制。\n\n一个皇朝运行了200多年，形成了一个非常稳固的腐败官僚体制，从上到下，遍布全国，即便是皇帝也无法动摇这个遍布全国的腐败官僚体制。必须进行改朝换代，通过革命的方式，才能彻底打破这个腐败官僚体制，重新建立一个新的官僚体制。\n\n这个才是中国旧皇朝不断发生改朝换代的真正原因，而且非常有规律。\n\n美国的宪政体制，与中国的旧皇朝体制并没有多少本质上的区别，运行了200多年，也形成了一个遍布全国的腐败官僚体制，只有彻底推翻这个旧官僚体制，重新建立新的官僚体制才能继续正常运行。\n\n或者，美国必须重新构建新的宪政体制，如川普提出的取消职业政客，社会才能继续正常运行。\n\n职业政客是一个必然腐败的职业。",
			"image": "",
			"added": 1612498004
		},
		{
			"topic_id": 34,
			"title": "不管是政务官僚还是政治官僚，只要是职业官僚就一定是一种腐败职业。",
			"body": "不管是政务官僚还是政治官僚，只要是职业官僚就一定是一种腐败职业。\n\n这是中国2000年的皇朝历史已经证明的。\n\n也是美国200多年的历史证明的。\n\n这与政治体制没有关系。不管这个国家的政治体制是民主选举的，还是科举考试的，都一样。\n\n是否能重建一种没有职业官僚的政治体制，就看美国这次的变革。",
			"image": "",
			"added": 1612505349
		},
		{
			"topic_id": 35,
			"title": "现在看来君主立宪制优于民主制",
			"body": "像美国这次大选造成的巨大争议，在君主立宪制下很容易解决，只要君主宣布解散国会，重新选举国会，总统，很简单就解决了。\n\n可是在美国这样的民主制度下，不动用军队就无法解决争议，可是军队介入又是一个很大的争议。\n\n成了没有一个解决途径了，争议只能一直存在下去。",
			"image": "",
			"added": 1612525038
		},
		{
			"topic_id": 36,
			"title": "用常识判断，川普支持者放心吧。",
			"body": "很多川普支持者现在都很焦急，听不到什么好消息。有些人甚至已经要大家接受现实，承认拜登当选总统。这个也引起了很大的争论。\n\n其实呢，川普支持者放心啦，我已经说过几次了，尽管放心。\n\n用常识判断就知道了。\n\n川普第一个4年总统任期中，一直在说排干华盛顿沼泽。如果川普只是一个人，那他如何排干华盛顿沼泽？即便是几个人，又如何排干华盛顿沼泽？\n\n如果川普只是一个人，华盛顿沼泽为何害怕他再次当选总统？\n\n显然川普是获得军方的支持的。\n\n为什么骄傲男孩，民兵都出奇地安静，连个小规模的抗议活动都没有？\n\n为什么川普已经不是总统了，民主党还要违宪弹劾？我根本就不关心弹劾的结果，无论这个弹劾是成功的，还是失败的。这个弹劾案的结果只有一个，参与弹劾的，将来不能再担任公职。\n\n拜登为什么要在假的白宫开会？如果白宫是在维修，那大大方方发个新闻，没有必要做个假的白宫嘛。\n\n如果白宫是在维修，那为什么还要铁丝网围住？\n\n这次大选是有外国干预，这个已经是明确的。外国干预美国选举，造成美国严重的宪政危机，军队可能无动于衷嘛？军队保卫美国的安全是不是也包括了维护美国宪政体制的安全，不被外国颠覆？\n\n用常识判断就知道啦。川普支持者放心吧。",
			"image": "",
			"added": 1612961635
		},
		{
			"topic_id": 37,
			"title": "现在很清楚了，这一切都能解释。",
			"body": "刚开始，看到民主党发疯一样的舞弊，我还以为是有很大的腐败要暴露了。后来看到司法部，CIA，FBI，都卷入其中，才感到，那是有比经济腐败更大的事要暴露了，但是猜不出到底会有什么事情要暴露。\n\n现在很清楚了，是太多的富豪，政客，官员，名流，精英，都卷入了与性侵儿童，虐待儿童，谋杀儿童有关的犯罪。\n\n这就能解释为什么会有这么大规模的选举舞弊，为什么会有这么多人参与，而且毫无顾忌，公开舞弊。而且还能动员10位前国防部长为他们站台。",
			"image": "",
			"added": 1613284335
		},
		{
			"topic_id": 38,
			"title": "支持川普的朋友，耐心等待最后的结果吧。没有任何可以担心的。",
			"body": "看到一个视频，是个老美半夜3点拍的。视频中有很多小孩子从白宫里出来。从画面中孩子的身高判断，这些孩子的年龄不到10岁，据说是军队在拯救地下隧道中的儿童。\n\n白宫的地下隧道中怎么会有这么多儿童？很奇怪吧。\n\n前几天我发过一个图片，白宫前面挖的乱七八糟的，像个大工地。其实这个图片不是现在的，好像是奥巴马当总统时期的。\n\n网上一直在说，拯救儿童的行动不是现在开始的，是川普总统上任之后就已经开始的，进行了几年了，拯救了很多儿童，很多都是在地下隧道中拯救出来的。\n\n几年来，有多少军人参与拯救？有多少军人知道这个行动？有多少军人知道这个罪恶牵连到大量的富豪，政客，精英，名流？\n\n美国50个州的国民卫队都有到华盛顿来参与戒严的。\n\n美国的军人受教育程度很高的，他们是有自己的判断力的，他们是有能力去了解真相的。他们当然会去了解为什么会有这么多的地下隧道，里面有这么多的小孩子。\n\n所以即使现在军队高层想停下来也没可能，无法阻止这些信息在军队中的传播。\n\n军队一定会把这个犯罪团伙，这个叛国团伙彻底铲除。\n\n支持川普的朋友，耐心等待最后的结果吧。没有任何可以担心的。",
			"image": "",
			"added": 1613292926
		},
		{
			"topic_id": 39,
			"title": "平叛进行的比较顺利",
			"body": "之前林武德律师要求大家准备2个星期的食物，饮水，等等，还说一些州可能会爆发战斗，要求大家留在家中。结果什么都没有发生。\n\n很多人认为林武德律师毫无根据乱发谣言。林武德律师自己也发了一个长文做了解释。\n\n不过，我认为，林武德律师原来的说法是有依据的，可能是军方原来对形势发展的判断。后来什么都没有发生，应该是平叛的进程比较顺利，比预期的顺利。\n\n平叛进行的比较顺利应该是与华盛顿大规模戒严有关，与50个州的几万国民警卫队进入华盛顿有关。\n\n几万国民警卫队进入华盛顿，应该都知道美国发生了什么事，军队自然不会被叛乱团伙利用，所以，平叛进程就比较顺利了。",
			"image": "",
			"added": 1613351402
		},
		{
			"topic_id": 40,
			"title": "2月16日下午唐纳德·川普发表声明",
			"body": "“挽救美国政治行动委员会”（Save America PAC)于2月16日下午发表唐纳德·川普声明。\n\n以下是声明全文中文大意：\n\n如果共和党跟随像参议员米奇·麦康奈尔（Mitch McConnell）的政治“领导人”，将再也不会得到尊重或强大。麦康奈尔（McConnell）对惯常做法、现状政策的投入，以及他缺乏政治见识、智慧、技巧和人格特质，使他迅速从多数党领袖变成少数党领袖，而且只会变得更糟。 民主党人和查克·舒默（Chuck Schumer）像小提琴一样演奏麦康奈尔（他们从未有过如此出色的表现），并且他们希望保持这种状态！ 我们知道我们的“美国优先”议程是赢家，而不是麦康奈尔的“环城公路优先”或拜登的“美国最后”议程。\n\n2020年，我赢得了有史以来任职总统中的最高选票，接近7500万。几十年来，第一次每位现任众议院共和党议员都赢得了胜利，并且我们翻转了15个席位，几乎让南希·佩洛西（Nancy Pelosi）失去了工作。共和党在98个党派议会中至少有59个赢得了多数席位，民主党未能将一个议会从红色翻转为蓝色。在过去两个选举期的“米奇参议院”中，我一人挽救了至少12个参议院席位，仅在2020年周期中就挽救了8个以上席位。接下来是乔治亚州灾难，我们本该同时赢得美国两个参议院席位，但麦康奈尔（McConnell）以600美元与民主党提供2,000美元刺激支票来应对。这是怎样做的？它成了民主党的主要广告，对他们来说是一个大赢家。然后，麦康奈尔把自己（美国最不受欢迎的政治家之一）放进广告中。佐治亚州的许多共和党人投票给民主党，或者没有投票，原因是他们对无能州长布莱恩·坎普（Brian Kemp），州务卿布拉德·拉芬斯珀格（Brad Raffensperger）和共和党的极大痛苦，因为共和党在2020年总统大选期间的选举诚信方面没有到该做的。\n\n这是乔治亚州和某些其他摇摆州的彻底选举灾难。 麦康奈尔什么也没做，而且永远不会做需要做的事情，以确保未来建立一个公正的选举制度。 他没有承担过，从未做过，也永远不会做。\n\n我唯一的遗憾是，麦康奈尔（McConnell）“请求”我的强烈支持和背书，在2020年肯塔基州大选的伟大人民面前，我给予了他支持。 他从1分升到20分，并赢了。他忘记得有多快。若没有我的支持背书，麦康奈尔将会输得很惨。现在，（支持）他的人数比以往任何时候都要低，他正在摧毁参议院的共和党一边，从而严重伤害我们的国家。\n\n同样，麦康奈尔（McConnell）在中国也没有信誉，因为他的家人拥有大量中国企业。 对于这种巨大的经济和军事威胁，他无能为力。\n\n米奇（Mitch）是一个沉闷、阴沉、不苟言笑的政治人物，如果共和党参议员要和他走在一起，他们将不会再获胜。 他将永远不会做需要做的事情，也不会做适合我们国家的事情。 在必要和适当的时候，我将支持拥护“让美国再次伟大”和我们的“美国优先”政策的主要竞选者们。 我们想要出色，强健，周全和富有同情心的领导。\n\n在病毒蔓延之前，我们创造了美国历史上最大的经济和就业人数，同样，在Covid病毒（中共病毒）之后，我们的经济复甦是世界上最好的。我们削减了税收和法规，重建了军队，照顾了我们的退伍军人，变得能源独立，修建了边境墙，并阻止了非法分子大量涌入我们的国家，不一而足。 现在，非法分子正在涌入，“基石输油管延长项目”正在被停止，税收将增加，我们将不再是能源独立的。\n\n这是对我们国家一个重要的时刻，我们不能让三流“领导者”来支配我们的未来，不能让这重要时刻这样过去！",
			"image": "",
			"added": 1613531904
		},
		{
			"topic_id": 41,
			"title": "这件事情非常奇怪",
			"body": "一艘超级巨轮在风平浪静的苏伊士运河中莫名其妙的搁浅了，把整个运河都堵住了，这么重大的新闻事件，全世界的新闻媒体都不关心，只有土耳其的电视台在谈论船上装载了什么货物。\n\n油管一个自媒体猪妹，发了个视频，谈到了这些，就被油管封了。",
			"image": "",
			"added": 1618737390
		},
		{
			"topic_id": 42,
			"title": "真的是“将军”哦",
			"body": "前几天，彭佩奥发了一张他在下国际象棋的图片，还有“将军”的文字。我当时也猜不明白他要表达的是什么，看了一些油管自媒体的分析，也没搞明白。\n\n昨天总算明白了，原来真的是“将军”哦。\n\n林武德律师直接“将军”拜登政府，直接“将军”美国的电视台，报纸，拜登这个美国“总统”是个犯了反人类罪的罪犯。\n\n白宫发言人有没有对林武德的指控发表声明？\n\n美国的电视台有没有报导这个新闻？美国的报纸有没有报导这个新闻？\n\n林武德律师在一个大型集会上公开指控美国“现任总统”是一个犯了反人类罪的罪犯，这不是一个林武德律师个人涉嫌诽谤的问题。\n\n白宫假装不知道吗？美国的大众媒体也都假装不知道吗？\n\n这真是的很难对付的“将军”哦。\n\n林武德律师还“将”了梵蒂冈，英国王室，克林顿，奥巴马，布什，比尔盖茨的“军”，他们怎么对付这个“将军”？全世界的媒体都假装不知道吗？\n\n这有意思了。\n\n即便这只是一个林武德律师个人涉嫌诽谤的问题，这些被“将军”的也应该对他提起诉讼。\n\n特别是拜登政府，应该给美国民众一个交代，到底如何面对林武德律师的指控。",
			"image": "",
			"added": 1618786081
		},
		{
			"topic_id": 43,
			"title": "我现在确信关于肾上腺素红的传说是真实的",
			"body": "本来我对从小孩子身上提取肾上腺素红的传说也是持怀疑的，因为这实在太匪夷所思。对林武德律师关于用性侵小孩子胁迫一些权贵的说法也是不敢确信的。\n\n现在林武德律师在一个大型集会上公开指名道姓指控梵蒂冈，英国王室，明白无误指控美国三个前总统，一个“现任总统”是反人类罪犯，居然没有一家电视台报导，没有一家报纸报导，当事人也不出来指控林武德律师诽谤，这实在太不可思议了，简直比肾上腺素红的传说还离奇。\n\n美国的新闻媒体不报导，英国的新闻媒体也不报导，梵蒂冈也装作不知道。\n\n宁可相信肾上腺素红的传说，也不能相信全世界的媒体都不知道林武德律师在大型集会上的指控。\n\n所以，我现在确信关于肾上腺素红的传说是真实的。\n\n既然关于肾上腺素红的传说是真实的，那么就不用太关注选举舞弊这种事了，严重性不能相比。\n\n那么，川普总统什么时候正式回归就不用着急了。拜登根本就不是“总统”还能当多久，而是什么时候上绞刑架。",
			"image": "",
			"added": 1618824735
		},
		{
			"topic_id": 44,
			"title": "大家需要密切关注的是这4件事",
			"body": "1，关于小孩子的\n2，关于美国公司\n3，班加西事件\n4，大瘟疫\n\n只要其中一件事真相被揭露，就是震动全球的。\n\n美国去年的大选都还比不上这4件事重要。",
			"image": "",
			"added": 1618828919
		},
		{
			"topic_id": 45,
			"title": "大揭露已经开始了，耐心等待更多的匪夷所思的事情被揭露出来。",
			"body": "枕头哥的网站开通了，是直播频道，正在大谈多米尼投票机与外国干预美国大选，其中主要是谈中国的干预。\n\n肾上腺素红都已经是确定的事了，干预大选其实已经没那么重要了，美国去年的大选，最严重的说也就是一场政变，或者说是勾结外国入侵美国，与肾上腺素红无法相比。\n\n我估计，枕头哥不了解肾上腺素红的事，林武德与福林将军才了解。\n\n不过，枕头哥迟早会让林武德到他的直播频道来揭露肾上腺素红的事。肾上腺素红牵涉到梵蒂冈，英国王室，多国政要，富豪，好莱坞，高科技公司，应该也牵涉到全球媒体界，肯定还少不了全球金融界，不知道有多少投资银行，共同基金会牵涉其中。\n\n大揭露已经开始了，耐心等待更多的匪夷所思的事情被揭露出来。",
			"image": "",
			"added": 1618890788
		},
		{
			"topic_id": 47,
			"title": "接下来，我想很可能是要抓参与选举舞弊与组织选举舞弊的人了。",
			"body": "最近没有看到关于小孩子的消息，应该这方面差不多都解决了，该抓的小人物应该已经抓了不少，有些大人物起诉书应该已经都准备了，在等待时机。或者有些已经秘密抓捕了。\n\n接下来，我想很可能是要抓参与选举舞弊与组织选举舞弊的人了。等选票的司法验证结束后要开始抓人的。而且肯定会有更多的州对选票进行司法验证。\n\n这么大规模的选举舞弊，肯定是有人组织的。抓这些人应该会公开的，因为这与匪夷所思的肾上腺素红不同。\n\n如果你还记得美军的直升机从富国银行运走了一批东西，应该对银行，金融系统的深层政府人物的抓捕也会进行的。\n\n我判断可能会在抓捕组织选举舞弊人员之后，也不好说。",
			"image": "",
			"added": 1620983169
		},
		{
			"topic_id": 48,
			"title": "互联网发展到今天，真正体现出了威力。",
			"body": "机构输给散户已经是全球性的局面了。这全因互联网打破了机构垄断信息，使得全球的散户可以自由交流信息。\n\n华尔街的精英本来人们以为都是些特别聪明的人物，现在也现了原形，不过尔尔。",
			"image": "",
			"added": 1622551446
		},
		{
			"topic_id": 49,
			"title": "川普真的会提前回归",
			"body": "我原来估计川普要到8-9月份才回归总统职位，现在网上也都在说川普8月份回归。当然也有说7月4日回归的。\n\n我现在认为川普肯定会提前回归。\n\n原来川普回来，最麻烦的是民主党又搞弹劾，不是弹劾会成功，而是民主党故意搞事，消耗大家的精力，时间。\n\n现在美国法警要查最高法院法官的旅行记录，看来要先动最高法院了。\n\n解决了最高法院的腐败分子，民主党就无法再乱弹劾了。\n\n川普提前回归的最重要的是要抓捕有组织的选举政变参与者，因为组织选举政变是联邦罪，应该由联邦司法部立案抓捕，这些人川普不回来不太好抓。\n\n这些人不可能由军方秘密抓捕，拜登的司法部不会抓捕。\n\n所以，川普肯定会提前回归。",
			"image": "",
			"added": 1623317018
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}