{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1589886834,
			"title": "Is crypto moving towards serving the existing power structure?",
			"body": "So the last time I looked into crypto was a couple of years ago. It seemed exciting for the reason that, it could facilitate the creation of decentralized organisations that could benefit the masses.\n\nI was thinking like Uber, Ebay, air B&B,  etc... but where the background functionality, personal data & transactions were governed by a crypto. Therefore this would be open source and community driven. And some real world companies could compete to offer the best GUI and gateway for money.\n\nOr for example BTC was going to be a viable alternative to the banking system.\n\nBut now that I've been looking into this again it seems that a lot of these crypto projects are moving away from that and towards helping the existing companies onto the block-chain. Or they have set up centralized companies that are the sole users of a smart contract they own.\n\nAm I wrong? Is what I was imagining unreal? Does none of this matter because these companies are about to implode anyway? who knows... or did I only write this because I wanted an excuse to contribute a post?",
			"added": 1589886833
		}
	],
	"topic_vote": {
		"1589887393_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": 1,
		"1589714892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": 1,
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1589887393_1DWCrTtmJ1g3gLgwENAmzG75QvTkmjmoFv": [
			{
				"comment_id": 2,
				"body": "Yea the bastards in western governments are laying the groundwork to blame Russia and china for their own short comings when dealing with this virus. Watch they are going to push the   narrative that the west suffered because china/Russia hid the severity of the virus... witch may be true however weather or not they did that is not why the west's healthcare systems or economy is failing. \n\nMedia always frame things as \"look at how bad that society is over there\", inferring that because their bad we must be good. What childish logic there can be to more than one asshole at a time... (rant over) ",
				"added": 1589889959
			}
		],
		"1589886834_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": [
			{
				"comment_id": 3,
				"body": "> [driud](#comment_49_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): No, you are not wrong; everything is moving in this direction. And it is geared to taking control of THIS.From the very beginning, it's the goal, take control.\n\nWhat do you mean \"from the very beginning\"... as in the verry beginning? the begining of BTC? or the begining of ETH?\n\nAnd I take it this also means you think what I had imagined crypto could be was unrealistic.",
				"added": 1589900982
			}
		],
		"1589714892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "you may find this video relevant... its about users on the internet loosing their individuality.\nhttps://www.youtube.com/watch?v=nRcdgXlpp1I&t=",
				"added": 1589922918
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 5,
				"body": "Create a ZeroNet twitter account and tweet out stuff like \"grab her by the pussy\", \"I'm gonna build the best wall. Believe me, I'm a tremendous wall builder\" & \"If she wasn't my daughter I'd sleep with her\"...\n\nSit back and let the media do the rest!",
				"added": 1589982895
			},
			{
				"comment_id": 6,
				"body": "> [cexy](#comment_9_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): *And, to all, PLEASE do not try to dismiss by pointing some exceptions in mentality or racial aspect in individual cases. We all know those exceptions only confirm the general rule.\n\nWhat do you mean by this?",
				"added": 1590011855
			}
		],
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 7,
				"body": "Porn is easily accessible on the normal internet. I assume the true value of this ZeroNet is that you can express yourself in an uncensored way  without the worry of things being removed. \n\nIf you encourage porn on here you will undoubtedly attract the porn that is usually censored and deleted from regular websites. Nobody wants that pedo shit on here.",
				"added": 1590099488
			}
		]
	},
	"comment_vote": {
		"3_16FFktck2XiA33aQcarrqPA8XzK3coaUBD": 1
	}
}