{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1630993404,
			"title": "Some Features of the sites",
			"body": "The data limit on \n[ZeroTalk++ ](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD)\nfor each user is 300 KB, which is enough for ordinary users to go for many months, even on serious topics! \nThe other site \n[All-Night Bookstore and Cafe ](http://127.0.0.1:43110/13gLfTixjjktySEGHBMnmrQu4qMJpoRuXw/?Topic:1628841436_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/A+Suggestion)\nadjusted the data limit from 50 KB to be 100 KB, which theoretically can run for many weeks for ordinary users without many ideas to express. \n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)\n[To Remember It More Easily…  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1625559291_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/To+Remember+It+More+Easily)",
			"added": 1630993403
		},
		{
			"topic_id": 1630995388,
			"title": "Data Space to go for a whole life?",
			"body": "[A Serious Question about Muslims and the War in the Middle East ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz/A+Serious+Question+about+Muslims+and+the+War+in+the+Middle+East)\nIt's good to see so serious topics are launched on Zeronet. \n\nAs \n[The 50 K limit ](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Some+Self+Contradictory+Problems)\ncan easily occur on serious topics, \nit's definitely suggested that the other site\n[Unlimit Talk  ](http://127.0.0.1:43110/1fznczNZUMEMvCiqSmCZGUiv5sVnRcsTD/?Topic:1630992481_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Unlimit+Talk+has+been+truly+upgraded+to+be+an+Unlimited+Talk+Forum)\n\nbe used to keep in-depth discussion on serious topics. \n\n3 MB of data space may be enough to keep about 600,000 words of content in pure Text format? \nFor most ordinary users, they may read more than 6 million words in a few years, but most of them can't write more than 600,000 words in a lifetime. \nSo the limit of 3 MB data space is enough for many people to go for a whole life on expressing their ideas!\n\n[Your Tomorrow can be Today's Hong Kong! ](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1632190431_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Your+Tomorrow+can+be+Today+s+Hong+Kong)\n\n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)\n[To Remember It More Easily…  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1625559291_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/To+Remember+It+More+Easily)\n\n",
			"added": 1630995386
		},
		{
			"topic_id": 1631012318,
			"title": "Excerpts of some fine content on Zeronet and the clear net",
			"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1591924953_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW\nThe U.S. Constitution is a failed experiment, like Communism\n... \nIt failed pretty much on day one, and it was a joke by the time of Lincoln, Wilson, or FDR. It has become a propaganda symbol for justifying government power - the very opposite of what it was intended!\n\n;;\nExcellent Comment: \nIt's not the constitution that's the issue, the problem is the criminals and traitors within Government and the Judiciary that are the problem. They fail to observe the constitution and the spirit of it, while the people fail to hold those individuals to account for their crimes against them.\n\nPeople need to be very careful of what they wish for because trashing historical founding documents could have very serious implications. Especially when the Traitors and criminals will be the ones drafting a replacement.\n\nIt should be obvious to anyone paying attention that there is a plan to bring down established systems of government all over the world. You cant have national governments and constitutions if you want one governing body to rule the world.",
			"added": 1631012315
		},
		{
			"topic_id": 1631162943,
			"title": "Permanent Freedom ...",
			"body": "[The Glory of Permanent Freedom vs Permanent Suspension of Trump's Account ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1631162511_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/The+Glory+of+Permanent+Freedom+vs+Permanent+Suspension+of+Trump+s+Account) \nBy comparison of some rules, it can be seen clearly that the freedom on Telegram doesn't go permanently. \nThere's a special innovation that genuinely supports Permanent Freedom of speech, which is the decentralized web (Zeronet https://zeronet.io/ is one example ) . \n\nFor example, a brave Russian writer nicknamed \"Balancer\" presented good insights on the Russian mindset and the turmoil they endured when the Soviet Union collapsed. \n\nHe was as brave as Victor Thorn, the author of Clinton Body Count \n( https://www.amazon.com/Hillary-Bill-Murder-Clinton-2008-05-03/dp/B01FIXXNHA ) \n \n\"Balancer\" died a few years ago, in mysterious style similar to the cases of the Clinton Body Count.  Though he was not so famous as Victor Thorn , his bravery and courage is similar.  \nMany netizens, especially Russian netizens seeded \"Balancer's sites\" voluntarily \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1631126622_1ATSif8GHYZiSgFWpQQ4dijmhV6iJyf4v7/This+Russian+author+died+years+ago+but+I+still+seed+his+zites \n**Webpages beginning with http://127.0.0.1:43110/ ...... can be visited by ZeroNet ** \n\nSo Balancer's works are always available for people to read, without the need of regular care by the owner or the support of traditional server (which runs in a central style, and requires payment of fees each year, besides appropriate management and maintenance of information once the dictators who keep the central servers change their rules). \nThis is just one of the most typical examples of Permanent Freedom on the decentralized web. \n\nA certain scale of insult has been imposed on former president Donald Trump as well (by the ridiculous label of \"False\" on the true account of Donald Trump). \n[A Small Insult on Former President is humiliation against millions of Americans ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:4_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Donald+Trump+Labeled+Fake)\n\n\nSo new means of Permanent Freedom should be cared about by professional people, especially authors or lawyers who handle sensitive data and documents. \n\nRemarks: \nBased on some Christian associates' feedback, though they haven't used Telegram for long, some public rules on Telegram operate just like tyranny style, for example, the default setting is that if an owner of an account hasn't logged online for half a year (the maximum extension is One year only), the account will self-destruct, which means that all the data can be destroyed in any way by the owner who controls the central server. \nBut the decentralized web works in a completely different way. With data transmission via Peer-to-Peer mode, each computer functions as a server for data stored in other computers. \nAs it's NOT a central server, large volume video may be not played so easily as the traditional web, however, messages in text and ordinary photo format can be presented effectively.  \n**The most important point is the feasibility of Permanent Freedom that is concerned by professionals, besides the special feature of security without even the need to verify user's phone number. **\n\nThe data security relies on a long chain of characters, like BitCoin encryption, unlikely to be cracked by any traditional technology.  \n\nIn short, by traditional web, all the works by the brave author \"Balancer\" may disappear totally once he physically disappeared.  However, on the decentralized web, \"Balancer\" glory lives eternally!",
			"added": 1631162939
		},
		{
			"topic_id": 1631867260,
			"title": "Massacre",
			"body": "The Massacre Competition  \n\nWhat’s going on is a Massacre Competition launched in many countries of the world. \n\nWhether God exists or not is in fact not the most important point.  The thing to be cherished is that at this stage of history, there’s still some space of reason that accommodates freedom of speech, as exhibited in some of the debate going on. \n\nWith only about 15% of Chinese people converted into Christendom, it already triggered big panic among the atheism regime, with Bible books taken off all shelves in stores ( https://www.rfa.org/mandarin/yataibaodao/gangtai/hx-04062018102004.html 圣经下架打压教徒 ); furthermore, organized activities through private family churches (also called as \"Underground Churches\" by the atheism government) may face curb-down oppression by the atheism gang as well ( 家庭教会被取缔https://www.rfa.org/cantonese/news/religion-09102018094123.html  ) .\n\n**Those matters mean that it doesn’t matter at all whether people like or hate Christendom.  **\n###For a jungle dictatorship system, all topics on religion should be totally banned.   \n\nThese things occurred much earlier than the event of Doctor Lee Wen Liang who emerged as a brave whistleblower about the danger of the Coronavirus. \n\nBut the logic is, if topics on religion can be totally banned, how can kind reminding messages survive without being totally silenced down?  That’s why the brave Chinese Doctor Lee Wen Liang had to disappear, just like many brave people in Hong Kong who have disappeared on the planet!  \n\nThe worse phenomenon is that after Hong Kong’s collapse, America is also downgraded to semi-jungle status.  \n\nFortunately, America’s constitution still keeps strong vitality, with certain sense of information transparency kept in the society, enabling people to organize up and fight back. \n\nThe vitality of America’s constitution will not be so easily destroyed, mainly due to the special system that protects Human Rights with Gun Rights, otherwise, America would have collapsed totally to hell jungle situation overnight, just like Hong Kong.",
			"added": 1631867255
		},
		{
			"topic_id": 1632190431,
			"title": "Your Tomorrow can be Today’s Hong Kong!",
			"body": "Some Christian associates stay in East Asia. They can see the situation more clearly than ordinary people who live in better society environment of America and Europe. The pity is that those people seem unable to realize that if they don't fight back, tomorrow's America and Europe will be today's Hong Kong! \n \nThe developer of a ZeroNet fork must be willing to endure death threats \nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1630497564_19AuD3C3VusewLWehweVi29XupaG5TkPVC/The+developer+of+a+ZeroNet+fork+must+be+willing+to+endure+death+threats \nThis is absolutely true! \n\nIt's estimated that Nofish was forced to quit due to some horrible threatening factors. \nThe point is that if freedom of uncensored speech is totally destroyed in the cyberspace, the so-called modern civilization in America and Europe will be totally downgraded to hell jungle as in East Asia. Some feeble information transparency could still enable people to better understand what a thousand years of darkness will be like — there will be not only unlimited mutations of virus, there will be unchecked crimes of \n[Organ Harvest ... ](http://127.0.0.1:43110/zybbs.bit/?Topic:7_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/A+Complicated+Topic)\nthat can make anyone disappear. \n\nThe big data supervision system of all people's health conditions can be used on some special purpose efficiently. \nIt's said that the stronger one's physique is, the more attractive their organs will be, so the more easily they will disappear.",
			"added": 1632190425
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1611829225_1JprRAdVNFB2etoYRTiT4pnx9qLme3yhB4": [
			{
				"comment_id": 1,
				"body": "[The Snowden Files ](http://127.0.0.1:43110/1DaXkbpBN7d9h78T5mjB2gTV9Ui46Bjwcv/)\n[Sites for Learning … ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1623818490_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Sites+for+Learning)\n[Truth and God ... ](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA/Truth+and+God)\n[Special Topics …  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624002662_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Topics)\n[50 K limit to be avoided! ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1624003018_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/50+K+limit+to+be+avoided)\n[Final Fantasy Special Songs … ](http://127.0.0.1:43110/1GupPNSnTxRq14Jk6crAQ4ceu8rdRoWLtx/?Topic:1624005163_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Special+Songs)\n\n[Gate of Heaven … ](http://127.0.0.1:43110/168x9d56MSBjrq6TYoDaSvxXSux3nPzw37/?Topic:4_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/Gate+of+Heaven)\n[50 K limit to be avoided! & code to enhance Browsing … ](http://127.0.0.1:43110/zybbs.bit/?Topic:6_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/a+Special+code+related+to+trackers)\n[Data Block or 50 KB Data Limitation issues ](http://127.0.0.1:43110/zybbs.bit/?Topic:1_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT/Some+Self+Contradictory+Problems)\n;;\n[To Remember It More Easily…  ](http://127.0.0.1:43110/1H1DB7PXNUNo8LNLYZZZKd5qaRadLg8Uzk/?Topic:1625559291_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p/To+Remember+It+More+Easily)\n;;",
				"added": 1630989214
			}
		],
		"1631012318_1MieUGUUVUxVmvuLNGcTXt9wVBSqpeztDT": [
			{
				"comment_id": 2,
				"body": "The Gettysburg Address by Abraham Lincoln\nFour score and seven years ago our fathers brought forth ,on this continent, a new nation, conceived in Liberty, and dedicated to the proposition that all men are created equal.\nNow we are engaged in a great civil war, testing whether that nation, or any nation so conceived and so dedicated, can long endure. We are met on a great battle-field of that war. We have come to dedicate a portion of that field, as a final resting place for those who here gave their lives that nation might live. It is altogether fitting and proper that we should do this.\n**But, in a larger sense, we can not dedicate -- we can not consecrate -- we can not hallow -- this ground. The brave men, living and dead, who struggled here, have consecrated it, far above our poor power to add or detract. ** \nThe world will little note, nor long remember what we say here, but it can never forget what they did here. It is for us the living, rather, to be dedicated here to the unfinished work which they who fought here have thus far so nobly advanced. It is rather for us to be here dedicated to the great task remaining before us -- that from these honored dead we take increased devotion to that cause for which they gave the last full measure of devotion -- that we here highly resolve that these dead shall not have died in vain -- that this nation, under God, shall have a new birth of freedom -- and that government of the people, by the people, for the people, shall not perish from the earth.\nAbraham Lincoln\nNovember 19, 1863",
				"added": 1631012404
			}
		],
		"1631979939_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg": [
			{
				"comment_id": 3,
				"body": "It’s derived from some excerpt of a special project focused on Science and Religion — Sir Isaac Newton’s answer to people’s question on their doubt of faith. \nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:6_1KjezDT16Z47VxZasHVX4LLTb91h94FKXg/Candle+May+Light+or+Be+Extinguished \nHe answered, “Sometimes I’ve absent-mindedly tried to light my candle with the extinguishing cover on. It wouldn’t work. It is not that the candle doesn’t work, but something I did blocked it from lighting.”",
				"added": 1632189179
			},
			{
				"comment_id": 4,
				"body": "> [obrien1984](#comment_1_14a6MrpmfdWZ9543vTNP8Co6Fa4S7M9Mq9): this is empty\n\nWithout a powerful system of Gun Rights, finest regulations of law could be empty, and discarded like a scrap of paper.  \nSo the Gun Rights system is the last resort for people to protect the constitution.",
				"added": 1632189773
			}
		]
	},
	"comment_vote": {}
}