{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1619276832,
			"title": "So I just restarted zeronet after a few years of never checking it",
			"body": "What did I lose? And when do I start seeing explosions?\n\n\nBy the way I left because you couldn't use zero without javascript, but it seems you still can't AFAIK\n\nEdit:\nAs of now a few websites don't show buttons, got a few errors here and there, but overall everything still works fine!\nGood software\n\nEdit 2:\nI also forgot I had to update the binaries from github, let's see how this works out",
			"added": 1619276831
		}
	],
	"topic_vote": {
		"1578081567_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1584569853_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1585207808_1KtNz7B6oMUBcPKCTZuSTbphZ2s7RTYCk1": 1,
		"1587573122_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"1587567790_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1587651983_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"1619072865_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"1619276832_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1
	},
	"next_comment_id": 18,
	"comment": {
		"1578064771_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 1,
				"body": "And if it doesn't it will return to normal after centuries of no human presence.",
				"added": 1578071572
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "Testy test",
				"added": 1578073072
			}
		],
		"1578135775_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 3,
				"body": "That's impossible nowadays, too many vulnerabilities and backdoors are found every day you simply can't stop updating your PC if you care about security.",
				"added": 1578165717
			}
		],
		"1578081567_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "> [peppefail](#comment_16_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): I think if the ww3 breaks out I would commit suicide\n\nWhy? Aren't you curious to see how this all ends? I'm dying to know.",
				"added": 1578165979
			},
			{
				"comment_id": 5,
				"body": "> [xcape2net](#comment_643_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): You say that because you're in one of the safest places on Earth to be if WW3 breaks out.  Remember, though, that the EM pulses will likely fry your computers too.\n\nGood thing my computer has his own tinfoil hat",
				"added": 1578166104
			}
		],
		"1583980969_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 6,
				"body": "> [xplosive](#comment_44_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): I fell in love with a woman in middle school (between 2007 and 2012) very deeply. She knew it, because she was the one, who asked, who (which woman) I like in the class. I told her the truth that I like (love) her, and I knew that she felt the same. Or so I thought. It was a true love at first sight. At least from my side. Then one day a new guy arrived in the class, and she started kissing and being with him from one day to another. Once I literally cried because of her. Some may think that it is not a man-like behavior, but I say that it is not a shame to express your feelings. We are all humans. After the school ended (in 2012), she switched to another guy, so she is changing her man as others change their socks. I saw that on Facebook. I have not seen her since the banquet.  [...]\n\nIt's fine to express your feelings, avoid the society bullcrap stereotype of \"The strong man that never cries\".\nMan who never cry are emotionally paralyzed because of some trauma.",
				"added": 1584105681
			},
			{
				"comment_id": 7,
				"body": "You know, this actually made me self-reflect, much more than I expected.\nI spent a good 20 mins thinking about this.\nHonestly, I have no idea.",
				"added": 1584106248
			},
			{
				"comment_id": 8,
				"body": "> [xplosive](#comment_59_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6): Is being single feels good or bad? Have you had a girlfriend/wife? Or have you ever been in a relationship? I am just/only curious. Being single nowadays feels good for me.\n\nMan, whatever you ever do in your life, you decide how you want to feel about it.\n\nBeing single allows me to fully work on my hobbies and passions, though it also brings a little loneliness.\nYeah, I had a girlfriend (I don't believe in marriages) but we left each other probably because we never talked about about each other's problems.",
				"added": 1584108229
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 9,
				"body": "Java developer here, just started my career :D\nI've always loved computers and technology (particularly I've always loved to discover how things work behind the curtains). I got here from looking at decentralized networks/forums since all the major social platforms are getting shittier and shittier (not just with privacy, but also with content) and  more hacking content/memes are getting banned from youtube, because of copyright or other bullshit.\nMust say, I like this niche Zeronet is. There aren't too many conversations about technology or cyber security, but you still can have decent conversations with techy people.",
				"added": 1584606062
			},
			{
				"comment_id": 12,
				"body": "> [wirufemo](#comment_1_1NQLduujQCfTpkQYFxmiZDtXwfqsJEKzJb): I study abroad, I am quite interested in computers and linguistics and I like to explore.I despise child pornography, snuff videos and other such degeneracy, and do my best to avoid or disable it (or find someone who can disable it or stop it from recurring.)\n\nNo jail for you sir, please continue browsing zeronet and have a nice day",
				"added": 1584726980
			},
			{
				"comment_id": 15,
				"body": "> [sfs9](#comment_66_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD): It is interesting, how book-burning is considered something bad, but when it comes to the digital version of book-burning, then the Western population really does not mind at all. I point out that the problem is not that people consider computers irrelevant and prefer paper-books. People understand very well that computers are the new book-shelves, and yet they do not mind digital censorship. [...]\n\nThis is a beautiful thought, thanks for sharing!",
				"added": 1584786041
			}
		],
		"1584569853_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 10,
				"body": "May I ask where did you get those stats?",
				"added": 1584606101
			}
		],
		"1584640277_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 11,
				"body": "And what is such event? I mean coronavirus is a pandemic, there have been a lot of pandemics through history.",
				"added": 1584642494
			}
		],
		"1584777793_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 13,
				"body": "Awesome!",
				"added": 1584780726
			}
		],
		"1584769181_13W2cW8ZhgjC9KJXzvPXyCkafHsiegKvyu": [
			{
				"comment_id": 14,
				"body": "There have been a lot of memes/posts about this on the subreddit /r/Sino, here is one:\n https://www.reddit.com/r/Sino/comments/fmarfx/food_for_thought/\n\nDirect link to image: https://i.imgur.com/LjdkDMv.jpg\nThere was even a bigger discussion when the virus started spreading but I can't find it.",
				"added": 1584781299
			}
		],
		"1584854478_1NrpsRRGN5SiUCgcTqaw2sJZnSv2CJQz3h": [
			{
				"comment_id": 16,
				"body": "\"Please turn JavaScript on and reload the page\"\nNo thanks bye!",
				"added": 1584893005
			},
			{
				"comment_id": 17,
				"body": "> [happyhippo](#comment_16_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly): \"Please turn JavaScript on and reload the page\"No thanks bye!\n\nbtw yeah I know zeronet runs in javascript",
				"added": 1584896286
			}
		]
	},
	"comment_vote": {
		"1_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"7_1MHt7kHieXeogoLntiLkqeBh1uVh9wW4Ly": 1,
		"64_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": 1,
		"66_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"7_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"444_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"70_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"731_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}