{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1524589266,
			"title": "Cannabis addiction.",
			"body": "What do you think are the first signs of a cannabis addiction ?\nI'm in my mid-20s and I smoke cannabis 3 or 4 times a week.\nSome weeks only 3 days: Friday evening, Saturday and Sunday.\nHowever, I also have weak weeks where I smoke 5 to 6 days straight.\nOn a normal weekend I spend about 50 euros for weed (5g for 3 Days).\nI do not consume alone most of the time.\nAt the weekend we always do something in a group. Some of my friends really consume much more than me. But that does not make it any better for me, i know.\n\nWhat worries me is that if I take a break from my weed consumption, I really enjoy drinking alcohol.\nSo if I stop smoking from Sunday to Monday. I often drink something on Monday evening.\nAs if my brain had to be intoxicated to switch off.\nAfter 3 days of consumption, I often can not sleep properly.\n\nI've been smoking regularly for about 1 1/2 years now,\nI am able to do my work. I am able to meet deadlines. I do not look like a stoner. \nBesides, I'm always on time.\n\nHowever, it seems to me that I am not yet addicted. Or at least only latently.\nBecause I can be sober for several weeks. At least if I have to (working stuff, etc).\n\nbtw: I smoke about 50/50 with tobacco. But im not smoking tobacco normally.\nCould it be that I develop a stealthy tobacco addiction ?\n\n\n\nWhat would you advise me ?\nAm I just imagining it or do I have a questionable consumption ?\nSeriously, is 5 grams a week too much (not the heavy Haze/Kush stuff, normal weed) ?\nDoes anyone have any experiences ?\nWhat could happen to me in the worst case ?\nDoes anyone have tips for safer use ?",
			"added": 1524589265
		}
	],
	"topic_vote": {},
	"next_comment_id": 13,
	"comment": {
		"1524589266_1KDRKDBSjdQmoGoQo3fdCHia7mp2Gmc8xt": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_229_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Wikipedia says \"Cannabis withdrawal symptoms can occur in one half of patients in treatment for cannabis use disorders. These symptoms include dysphoria (anxiety, irritability, depression, restlessness), disturbed sleep, gastrointestinal symptoms, and decreased appetite. Most symptoms begin during the first week of abstinence and resolve after a few weeks.[6]\"\n\nWell, I already know that :)\nHowever, I wanted to go a little deeper into the topic.\n\nDo you think a cannabis addiction is a serious danger, or about as dangerous as a caffeine addiction ?",
				"added": 1524591736
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_287_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The first signs of cannabis addiction are PTSD, epilepsy, osteoarthritis, wasting disease, cancer and acute anxiety disorder, to name a few. No, it's not addicting. It just helps people live.\n\nInteresting you say that cannabis is not addictive?\nPlease excuse me for being so direct. I'm serious about my questions.\n\nDo you think I should not worry about a possible addiction?",
				"added": 1524600245
			},
			{
				"comment_id": 8,
				"body": "> [homulilly](#comment_27_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Cannabis is not chemicaly addictive like drugs such as nicotine, alcohol and amphetamines, opiates or foods such as sugar, casein (found in dairy) and so on. However as disorders such as gambling, video game, or sex addiction prove, it is possible for people to become mentally addicted to activities even if they are not consuming an addictive substance. It is possible to be addicted to any activity/situation, including smoking marijuana in this sense. In your case I would try to kick the tobacco habit first as that seems the most likely substance you're consuming to cause an addiction\n\nThank you for your help. I will try to get away from tobacco. Do you know a good alternative for mixing w/ weed ?",
				"added": 1524637583
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_289_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Eat psilocybe mushrooms without drinking fruit juice and give it time to take effect before smoking cannabis. You'll feel so happy.\n\nIm not really into optics and stuff.",
				"added": 1524662244
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You won't hallucinate without drinking juice.\n\nIt seems like you have a lot of experience!\nCan you advice me about my weed consume ?\nDo you think 5g / week is to much ?",
				"added": 1524684256
			}
		],
		"1524566558_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 2,
				"body": "It's a win win situation ...",
				"added": 1524591891
			}
		],
		"1524592326_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 3,
				"body": "Oh dear, please read something about the economy.\nFor example Adam Smith or Ludwig von Mises. The freer the market the freer the people!\nTake a look at Venezuela. After a democratically elected socialism was introduced in Venezuela.\nThey literally eat zoo animals to stay alive!\n\nAbove all, food regulations lead to scarcity and civil war!",
				"added": 1524594255
			},
			{
				"comment_id": 4,
				"body": "> [glightstar](#comment_76_14K7EydgyeP84L1NKaAHBZTPQCev8BbqCy): No, a freer market doesn't directly mean that the people are freer, or at least not the majority.I mean, it is a good thing, but it doesn't work just like there never has been a really working communism after the development of it's idea (that sounds somewhat wrong in the formulation)... [...]\n\nI agree with you (so far) but it's easier to fight monopolies in a free-market economy.\n\nYou have 3 levels of freedom:\n\n1. The simple people are the market.\nEveryone can act as he wants as long as he does not forfeit the freedoms of others.\n\n2. The state works together with the elite.\nLarge corporations that have the necessary change can buy through lobbyism laws and thus eliminate the smaller competitors.\n\n3. The state is the market\nThe state has become a monopoly. We all know where this brings us.\nAll I'm saying is hunger, poverty, war and mass extinction.",
				"added": 1524596196
			},
			{
				"comment_id": 5,
				"body": "> [homulilly](#comment_24_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Austrian School economics are responsible for most of the evil in the modern world. Smith and Mises are irrational propaganda.\n\nFunny, as far as I know: Islam and communism are the biggest killers in history ...",
				"added": 1524598229
			},
			{
				"comment_id": 6,
				"body": "> [homulilly](#comment_25_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): Thats probably because you're reading and watching a bunch of propaganda and conspiracy theories and ahve a non-reality based view of the world. Basically, you've been brainwashed into a cult.\n\nI can't believe that. I see myself as a very questioning mind.\nBring me some decent arguments.\n\nBtw it's not conducive to a discussion if you consider your opponent inferior ;)",
				"added": 1524599778
			},
			{
				"comment_id": 9,
				"body": "> [fudingyu](#comment_25_19GRAaLSeEgXthxYKSpGAe3BjZc2LXNWZJ): Research political and economics and find solution compares important with revolution !\n\nLook at Venezuela. Look at the misery of what this unreflected revolution brings.",
				"added": 1524659051
			}
		],
		"1524710040_1F9qtxgSgbkeJX7NT2BARwR8XCn1XP4qPG": [
			{
				"comment_id": 12,
				"body": "I never understood why it's selfish, if you want to keep what you've worked out.\nBut it is all right if you do not work and still want to have something of people working hard.\n\nYou disgust me with your basic income !",
				"added": 1524817100
			}
		]
	},
	"comment_vote": {
		"229_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_15hSt4sAoz3kAHQH3sZV7D29hzbRSbYyjQ": 1,
		"288_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"230_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"26_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"27_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD": 1,
		"290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"15_14myhdHusLxmeHYieWEZfs221Q2or2iSbJ": 1
	}
}