{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1515509533_1PDNRLfMxyxUmEM7PnBy3tp2BdWPjyZ4Y5": [
			{
				"comment_id": 1,
				"body": "Here's an interesting article about FaceApp trolling (in Russian): http://4pda.ru/2018/03/09/350094/",
				"added": 1521056060
			}
		],
		"1565079726_1G18NbD6PndW29n1QkuFzo1dDpF7xcDBku": [
			{
				"comment_id": 2,
				"body": "What makes you think so?\n\n1. The gender dysphoria is still a diagnosis. In most of countries where SRS is allowed, the approved gender dysphoria diagnosis is needed to do it. One cannot get SRS simply because they dream to become the opposite gender.\n2. The medicine is not perfect, even though it looks so omnipotent nowadays. If you, for example, get appendicitis, it would be ideal to treat it, as appendix may be needed for something. But instead, the surgeons still cut the appendix. They do this also with more imporant organs, like pancreas. Doesn't it look more barbarish to you than \"cutting\" the dick? The half of humanity lives well without dicks from the cradle. Living without a pancreas is much harder.\n3. The point of gender dysphoria is the conflict between the mental gender and the biological sex. The medicine can't fix the first side of the conflict for now, but why not try to fix the second? Mental illnesses are still one of the most complex areas of medicine, as the human brain is hard to study, and even more hard to fix. SRS is only a kind of plastic surgery, not a rocket science. If you're not vindictive, watch some operation videos, they don't look complicated.\n4. People with the real gender dysphoria are terribly unhappy, up to suicide. A dick does not worth a life.",
				"added": 1567077196
			},
			{
				"comment_id": 3,
				"body": ">majority of you\nWhom \"you\"? I'm not a tranny.\n\nYou're probably disoriented by the femboys, sissies and the rest of major crowd that play with hormones (often illegal!) without a proper diagnosis, just because it's trendy and looks non-dangerous. That's just like aged people tend to call a \"programmer\" every computer user, because when they were young, computers were rare and only experienced technicians could work with them. Typical victim of stereotypes and prophanity.\n\n>male brain\nThat's a key point which makes all your further reasonings wrong. The reason of the real gender dysphoria is that due to development issues, usually the pathologies of fetal development, the brain gets formed according to the opposite sex. That's just a freakness, but unlike more perceptible freaknesses like cleft lip or misproportioned limbs, you can't just look and tell if a person is a freak. It needs a long medical supervision to tell if a person has a gender dysphoria.\n\nFreaks are just holy fools; what does your Bible tell about holy fools?\n\nUnfortunately, this kind of freaks can not be related neither to male nor female. As they have disorders of sexual development, they are non-binary. In some countries, like India and Thailand, a third gender is an acceptable cultural phenomenon for centuries. Abrahamic religions, however, don't have such a concept, which limits the perception of the world. If you're trying to \"fix\" a non-binary person, you're just making the same kind of sin that binary persons with no real dysphoria do when they decide to change their sex or agitate others to do it.",
				"added": 1576768438
			}
		]
	},
	"comment_vote": {}
}