{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"49_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz": 1,
		"13_12hbwWu8G1L7uo3MiLnNLkU4Sj4ZtPKQU8": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1_1ALwbRLVTnHkqz8mCtWrHV1AsZLFkRhJj2": [
			{
				"comment_id": 1,
				"body": "这是censorship这把双刃剑带来的结果，censor不一定是和政治相关，只要有任何强制的规则，那么就由这种规则提纯了其用户的对应品性。我们看见的大型公众网络所censor之下得到的是符合社会提倡的价值的，国内的更严苛，国外的更疏松。此时，被censor的部分不可避免地容易素质更高。中国网络将维护政府治下国家一片祥和和其他人们所共识的优良品性做了较强的绑定，就导致了在反对政府的人群中掺杂了更多游离在良好品行之外的人。小众文化、亚文化为什么容易污名化也是类似的道理。\n拿楼主所提到的例子来说，Twitter、Youtube在西方国家没有什么特殊访问限制，但是也是存在各种政治导流的，其浏览者反映的是接近其互联网用户的平均水品的内容（当然，乐于发声的总是走极端的人较多），因为其accessibility，想要粗略了解外国人对政治的评价的人往往也就止步于此；而所谓的讨论中文政治的论坛往往由于其合法性存疑而聚集了更多单纯享受逾越法度的乐趣的人。其言论与其说是经过深思熟虑的不如说是在尽情体验和表现自己的跳脱。可惜，想了解对中国政治的非官方看法无法通过公众网络直接进行，于是你付出了更多的effort，结果观察到的其实是平均水平劣化的群体，这样去比较中外网友的政治素养或许还是片面了。作为身在国外多年的人，实际上不要说付出等价effort了，Reddit、Twitter上稍微深入一些就能意识到许多外国人的政治素养也就那样。意识不到什么是自己政治形态中选举的意义，自己的权利和义务，人与人之间的权力边界。其表现出的基础逻辑素养甚至更差于同一平台上的中文用户。\n其实不要说政治了，且看Pornhub和其他小道色情网站的区别就能感受到：Pornhub看似也是没有限制的，但其实是会censor带有强迫色彩的视频的，而许多其他网站则不会。披着自由的外皮下这些网站汇聚了更多想要释放自己更邪恶欲望的人，而Pornhub则俨然成了大同之世。\n希望网友们不要管中窥豹只见一斑，偶尔翻墙一下就以为看尽天下事了，况且看得多不代表懂得多，真的有意愿去改变甚至颠覆，那么请提高学识，declarative knowledge不等于imperative knowledge。多想想更加普遍的情形，许多事不是只适用于政治，也不是只适用于国人。对现有政府存在反感未必一定要通过谩骂和扯谎来表现，正如政客辩论既可以保留一丝体面也可以如台湾政客那样小儿科，所以不要再为那些空洞、充斥负面感情色彩的言论开脱，发言者在做出这种言论时就应该有被驳斥的觉悟。",
				"added": 1607723731
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 2,
				"body": "> [admin1234](#comment_3_17LgB6f3uRGhzNMXzHFBj84uQshenTWU5a): 根本沒有所謂當西式中式。只有民主或者不民主。何必自欺欺人呢？這條問題應該問：共產黨極權統治下的中國人，會爲了民主反抗嗎？\n\n西方民主制度也不是能一概而论的，互相之间尚有争辩结果你却以为民主与否已经是一个well-studied problem，不太肤浅了吗？西方民主制度存在瑕疵并不是什么秘密，区别在于有的人认为这种制度下维护的部分比缺失的部分更重要，有的人则不这么认为而这种价值评判往往会有先入为主的偏见的。奴隶社会、封建社会、前工业化社会都曾有过自己的拥趸，都有人以为这是人类社会的最终形态，结果呢，我们现在所知的更像是再说只要是人建立的体制就不可能尽善尽美。所以说time and tide，还是要给不同的声音留下点余地，放开些视野。",
				"added": 1607726511
			}
		],
		"1_176pbcWqz7CnAvA1LGMinnYmoMgyuUL9qz": [
			{
				"comment_id": 3,
				"body": "把国家当作人一样的个体来评判，把政治博弈单纯当作几个国家领导人直接的利益纠纷是非常危险也非常错误的行为。",
				"added": 1607999950
			}
		]
	},
	"comment_vote": {
		"15_1ARf4SpYy1bTHXDAEyXVmEbxrcvVreUaNF": 1,
		"53_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"26_16j1WtLKAKpemCzA2suD1aaWfie2854o5T": 1,
		"6_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": 1,
		"95_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"2_14Wi9krKCytqtnF8naKLEKDVRpyDgJUezb": 1,
		"1_14Wi9krKCytqtnF8naKLEKDVRpyDgJUezb": 1
	}
}