{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1,
			"title": "Стелс P2P-трафик",
			"body": "Ребята у меня такой вопрос, насчет P2P-сетей: насколько их можно считать цензуроустойчивыми в принципе. Знаю также что интернет-провайдеры могут определять P2P-трафик. Мой вопрос заключается в том, насколько реально этот трафик то спрятать. Допустим, если товарищ Майор решит взяться за наш любимый зеронет, то как можно все это защитить от грязных рук власти.",
			"added": 1550600860
		},
		{
			"topic_id": 2,
			"title": "В чем таки разница между Mesh-сетью и P2P-сетью",
			"body": "Так в чем таки заключается разница между Mesh-сетью и P2P-сетью?",
			"added": 1550692925
		},
		{
			"topic_id": 3,
			"title": "Tribler",
			"body": "Хотел бы порекомендовать вам данную программу, потому как она представляет подобно зеронету независимое файловое хранилище файлов. В ней можно скачивать и раздавать файлы независимо от каких-либо торрент-трекеров. \n[Офф. сайт](https://www.tribler.org/)",
			"added": 1550766601
		},
		{
			"topic_id": 4,
			"title": "Добавление новых модераторов",
			"body": "Меня интересует возможность, а возможно ли как-то добавлять модераторов которые подобно владельцу зайта, могли бы удалять содержимое зайта и изменять количество места для каждого пользователя?",
			"added": 1552565976
		},
		{
			"topic_id": 5,
			"title": "Выборочное скрытие контента",
			"body": "Реально ли как-то выборочно удалять контент пользователя, при этом не мьютя его? В частности, я сейчас про миллчан.",
			"added": 1561827803
		},
		{
			"topic_id": 6,
			"title": "Почему так мало трекеров доступно?",
			"body": "Господа зеронетовцы. Недавно столкнулся тут с проблемой: в последнее время стало доступно мало трекеров. Как правило из 16 только 8 у меня находится в онлайн. Имеет ли это какое-то отношению к массовому наплыву аудитории в ЗН из ныне покойного 8чана. И как эту проблему можно пофиксить?",
			"added": 1566923730
		},
		{
			"topic_id": 7,
			"title": "Загрузка статичных html-страниц в ZeroNet",
			"body": "Существует ли возможность загрузить совокупность статичных html-страниц, которые были бы связаны между собой гиперссылками?",
			"added": 1567147209
		}
	],
	"topic_vote": {
		"2_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"16_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"3_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"2_1CcyypQrRYWvbXbeqv7PFEdLi1imtPw9QW": 1
	},
	"next_comment_id": 28,
	"comment": {
		"7_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": [
			{
				"comment_id": 1,
				"body": "> [l8](#comment_16_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Зачем?\nПотому что клиарнет стал уже полной помойкой который наполнен рекламой, троллями, ботнетами и прочими вкусностями, которые отсутствуют здесь.",
				"added": 1550403229
			}
		],
		"6_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": [
			{
				"comment_id": 2,
				"body": "Иначе говоря, как я понял, в РФ хотят сделать фаервол с применением технологии DPI? И если да, то как это отразится на **НЕ** клирнетовских сервисах вроде RetroShare, FreeNet, ZeroNet, I2P?",
				"added": 1550425441
			},
			{
				"comment_id": 3,
				"body": "> [promusik](#comment_60_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC): Так ZeroNet же не плохо будет работать почтовыми голубями! Флешка в конверт или вообще как хочешь, синкаешь там, возвращаешь обратно - синкаются все остальные внутри страны. Тупо, долго, но должно работать.\n> Вариант 2: один из пользователей обладает спутниковым Инетом - так через него может весь российский сегмент синкаться, но долго.\n> Вариант 3: выходы во внешний мир по любому должны быть... Ну просто даже для работы SWIFT и прочей хрени... Как Нефте-газовая отрасль будет общаться с потребителями в Европе? Правильно. Находим заинтересованного админа и он всё это синкает через этот канал. Ну или как вариант - можно использовать автоматические средства без ведома хозяев оборудования и админов....\n> Путей много. ZeroNet будет жить.\n\nЗачем столько мороки? Зеронет же можно через Wi-Fi/Bluetooth передавать. А если учитывать, что он теперь поддерживает CDJNS то в принципе единственный вариант остановить это - физически людей пересадить за все это.\n\n> [p2pnews](#comment_12_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i): иностранные диапазоны ip адресов заблокируют и хрен нам а не тор I2P тоже перестанет работать а те годы что в россии будут разносить менты так что zeronet срочно нужна поддержка dht\n\nDHT конечно тоже важен Зеронету, но даже сейчас он хоть и нуждается в трекерах, но скажем так трекером может стать изили любой человек, что уже как бы _без 5 минут децентрализация_ в сборе пиров.",
				"added": 1550497496
			},
			{
				"comment_id": 4,
				"body": "Ребята о чем речь? Если п2п еще может и возможно заблокировать, то mesh-сети никак. Невозможно. Разве что если товарищ майор будет ходить к каждому домой персонально и садить на бутылку забирая при этом компьютер и роутер.",
				"added": 1550600502
			},
			{
				"comment_id": 5,
				"body": "> [nononono](#comment_16_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Смешно ) Да никто не будет ходить к каждому персонально. Просто запретят меши одним днем и будут принимать чуваков с открытым вайфаем выборочно и показательно. Через месяц забудете как пишется \"меш\".\nНу знаешь, я в таких случаях люблю приводить пример даркнет-площадок. Вещества тоже в принципе запрещенны и за них могут посадить на бутылку. Что и делают в принципе с некоторыми товарищами. Но, даркнет маркеты будут продолжать существовать. И наоборот, спрос на них тоже будет расти. Почему? Да потому что включится так называемый [\"Эффект Стрейзанд\"](http://www.wikiwand.com/ru/%D0%AD%D1%84%D1%84%D0%B5%D0%BA%D1%82_%D0%A1%D1%82%D1%80%D0%B5%D0%B9%D0%B7%D0%B0%D0%BD%D0%B4) (ссылка в клиарнет). Только в данном случае имеет быть спрос на информацию и свободное общение.",
				"added": 1550605182
			},
			{
				"comment_id": 6,
				"body": "> [nononono](#comment_17_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Детский сад... Ровно потому что веществами сами менты и торгуют )Меши им нафиг не сдались, у них и так все хорошо в ТОРе.\nНу это уже совсем пушка, лол. Пруфы будут на это?",
				"added": 1550694702
			}
		],
		"2_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": [
			{
				"comment_id": 7,
				"body": "> [erert45](#comment_25_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi): Качаеш Rats on The Boat и никакие трекеры не нужныhttps://github.com/DEgITx/rats-search/releases\nКстати господа-крысы, я правильно понял, что если я в торрент-клиенте просто создам торрент какого-то файла и начну раздавать его и при этом **никуда** не выкладывая его, то он все равно будет доступен через поиск в этой программе?",
				"added": 1550766200
			}
		],
		"3_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 8,
				"body": "> [nononono](#comment_21_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Таких, собственно, не одна и не две.\nА какой еще тогда какой торрент-клиент который может полностью без трекеров работать?",
				"added": 1550779702
			},
			{
				"comment_id": 9,
				"body": "> [gluek](#comment_8_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Любой, получая пиры через DHT.\nТолько для начала тебе надо найти саму раздачу. Магнет-ссылку ту же например.\n> [gluek](#comment_9_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi): Вон там Tor своё OnionShare тоже обновили, тоже можно файлами обменяться без всяких трекеров:http://127.0.0.1:43110/1GLUEKWuPP6yu2HRRoG5CGcMk8rLTETQWK/?Post:7:OnionShare+2\nДа слышал-слышал. Только это скорее дропбокс. Здесь нельзя сделать как в типичных одноранговых сетях, было множество пиров. Только ты и получатель. Что-то вроде привнот только теперь можно любой файл и любого размера разшаривать.",
				"added": 1550856275
			}
		],
		"1_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX": [
			{
				"comment_id": 10,
				"body": "Думаю что скорее да, чем нет. Зеронет предлагает с одной стороны децентрализированный интернет, но при этом его юзабилити и порог вхождения на уровне Тора. Поэтому да, конечно будущее у него есть. У фринета же ровно как и i2p пороги вхождения куда выше. И юзабилити меньше.",
				"added": 1550918460
			},
			{
				"comment_id": 11,
				"body": "> [bxze](#comment_5_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt): Zeronet нет поддержки DHT \nКак надонят норм автору, то будет.\n>  нет не одного нормального сайта хотя на node js написать не так уж и сложно короче\nДжаст ду ит.\n> Zeronet блокируют иностранные диапазоны ip адресов \nНе видел ни разу.\n> тор работать перестанет трекеры зеронета тоже заблокируют \nДаже китай не смог заблокировать Тор, хотя он является самым развитым государством.",
				"added": 1550924054
			},
			{
				"comment_id": 13,
				"body": "> [akiiro](#comment_9_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd): Я прочитал здесь и в паре мест что Zeronet еще не полностью перешел на децентрализацию? \nДа, но уже очень близко находится.\n> Если у нас заблокируют что-то на западе, я не смогу зайти на сайты что я раздаю? и не смогу получать обновления того человека кто создал сайт и будет его менять?\nСможешь и то и другое.\n> Это так? если да, то вопросы, почему главный разработчик еще не сделал этого в чем причины? и планирует ли сделать?\nОн ждет доната на DHT. Посмотри на офф сайте зеронета. Там все хорошо расписано.\n> Как помню проект с открытым кодом, тот код что существует, в чем его затык чтобы завершить и сделать децентрализацию?\nМногим просто лень.",
				"added": 1551011957
			},
			{
				"comment_id": 14,
				"body": "> [tomoki](#comment_3_1EF8R99yQam8AB78HsPrwT9rBsnaUHsoFX): А он развивается? он ещё не умирает  но всё равно находится в стадии застоя и прими пожалуйста свои успокоительные таблетки\nЯ согласен с murzazade4. Если для зеронет мертв, то деинсталируй его тогда.",
				"added": 1551012040
			}
		],
		"1_1JN4Ck6cLfg81fNjkhDJMkkmKGwk3Dpih4": [
			{
				"comment_id": 15,
				"body": "> [fsat](#comment_19_1LB5A2qJU57xRuyJtUNWBNMnKTPkSmdF2h): ее тут нет так как сеть не является анонимной в ней нет шифрования zeronet это цензуроусточивая сеть а не анонимная\nЕсли пропустить через тор, то будет. \n> [krakodeal](#comment_10_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu): А кто тебе сказал что тут именно такой контент востребован?\nНу драгмаркеты уже тут присутствуют как бэ.",
				"added": 1551523293
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 16,
				"body": "> [gluckman](#comment_26_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): CJDNS сам по себе настраивается довольно просто. По сути это не сложнее обыного VPN только получается целая оверлейная сеть а не связть точка-точка\nОго, вот как. Можешь тогда описать мануал, скажем так, для относительного ламера для настройки CJDNS чтобы можно было зеронет через гиперборею юзать?",
				"added": 1551527971
			}
		],
		"1_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 17,
				"body": "Есть, просто русскоязычных нету. Поищи в каталогах зайтов.",
				"added": 1552128574
			},
			{
				"comment_id": 20,
				"body": "> [mistalero](#comment_58_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Искал, не нашёл.\nhttp://127.0.0.1:43110/143QwTJC1GuEu4TveFAzB4Qij7KMUD6ytt/?Home - ну вот кто-то создал форум для этого. При чем русский. Осталось только дождаться наплыва юзеров.",
				"added": 1552566316
			}
		],
		"2_1LC5DMsscdXDvXUFTvoUJ9yZ9J9g1NfMjT": [
			{
				"comment_id": 18,
				"body": "> [gluckman](#comment_20_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy): Ссылки на Retroshare приветствуются?  Или как?\nДа. Единственные два активно развивающийся проекты по децентрализированному интернету.",
				"added": 1552328088
			},
			{
				"comment_id": 19,
				"body": "> [zxfhu](#comment_4_1SsjXjnUsU16iPMcUWAZnJXhdFSuvUGgp): http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/http://127.0.0.1:43110/Sites.ZeroNetwork.bit/http://127.0.0.1:43110/picrandom.bit/http://127.0.0.1:43110/Me.ZeroNetwork.bit/http://127.0.0.1:43110/Blog.ZeroNetwork.bit/http://127.0.0.1:43110/1LdFFzqembYYuveCg2QaTKkLnXViRkD8d1/http://127.0.0.1:43110/19mXW2Uu8GpqqifpQ11dwf6JEGNiZEkj5S/http://127.0.0.1:43110/1JvjE44zqAhDiAxQFDRcfg8NLJo4z2Q9BL/http://127.0.0.1:43110/1P5Sybb44xTi6T6o5e2buZ8SR1zdsbX3Ae/http://127.0.0.1:43110/1PxNZqJ3R3aUt171foqtzbhgZZ6JaggaAi/\nТы бы хоть подписывал про что каждый сайт, а то я по публичным ключамбиткоин криптографии гадать не умею.",
				"added": 1552328234
			}
		],
		"7_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 21,
				"body": "Надо нажать на кнопочку там по рефрешенгу картинок. И пойдут обновления.",
				"added": 1555242596
			}
		],
		"5_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 22,
				"body": "> [anonymouslogin](#comment_25_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Требуемого вам механизма - нет, можно вести личный список Sample blocklist и включать его во время просмотра любого сайта\nА можно про него по-подробнее? Как это согласуется с выборочным удалением/сокрытием контента у себя?",
				"added": 1562600594
			}
		],
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": [
			{
				"comment_id": 23,
				"body": "Воу, хорош. А можно ли сделать также с бумажными книгами?",
				"added": 1566435957
			}
		],
		"6_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 24,
				"body": "> [fant](#comment_33_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): https://github.com/ngosang/trackerslist\n> Или сразу:\n> http://127.0.0.1:43110/ConfigTrackers filesLoad additional list of torrent trackers dynamically, from a filehttps://raw.githubusercontent.com/ngosang/trackerslist/master/trackers_best.txt\n> Всегда полный набор.\nСпасибо. Теперь стало намного лучше. У меня такой еще вопрос возник: а есть ли в сети зеронет зайты, которые собирают список трекеров и ты просто на него заходишь потом нажимаешь кнопку \"apply\" и оно автоматически добавляет новые трекеры. Тип как с зайтами с блоклистами.",
				"added": 1567146171
			}
		],
		"7_1Axcs3zkrrpHhBAAZMUhXEQZ4z6ahqqaS6": [
			{
				"comment_id": 25,
				"body": "> [caryoscelus](#comment_127_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Да. При условии, что ссылки относительные, оно даже будет работать\nА \"относительные\" это как?\n\nАлсо, посоветуйте граббер для статичных веб-сайтов, чтобы можно было сразу выбирать насколько углубляться при граббинге веб-страниц.",
				"added": 1567298469
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 26,
				"body": "Могу тупить, но это случайно не балансер?",
				"added": 1567343040
			}
		],
		"3_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 27,
				"body": "Вопрос: не могу установить плагин. Пишет что у меня старая версия, но я пробовал несколько раз обновлять через начальную страницу ЗероНета. Но нифига не получилось.",
				"added": 1567505197
			}
		]
	},
	"comment_vote": {
		"2_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"3_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"80_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"40_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"7_1LsU5cS8D3qjVLzgdwtcfdXtHEY8T2Gixi": 1,
		"8_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": 1,
		"1_1KUkif7CaEVu11iaBLNug6izd2kQ5ErH9p": 1,
		"9_1HYezdYcz7FDJpqf5ksWZjMUC6QgfivG8c": 1,
		"8_14xvWFMW9V4tC4ghQxvSvaoShAJ33YxPFb": 1,
		"42_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"28_12cph6CWZ5WbjQwzbSGK2wEPDdrFuirJgi": 1,
		"26_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"34_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F": 1,
		"22_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS": 1,
		"3_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": 1,
		"175_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"31_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"128_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"42_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1
	}
}