{
	"next_topic_id": 12799,
	"topic": [
		{
			"topic_id": 9,
			"title": "跟毛主席跳舞之前，还有一道特别的手续：",
			"body": "几乎每天晚上都有舞会——中南海、国务院紫光阁、三座门中央军委，都是一周两次。而去中南海，跟毛主席跳舞之前，还有一道特别的手续：门前有个盛消毒液的盆，每个人都要在里面洗了手才能进去。夜宵都很丰盛，有鱼有肉。这一切，对于处于困难时期每顿饭只买半个菜的女孩子们来说，都非常美好。有时候吃完夜宵还看电影，都是香港的左翼电影，夏梦主演的最多。",
			"added": 1494911377
		},
		{
			"topic_id": 13,
			"title": "#松林说史#中国人的忍耐令人吃惊",
			"body": "1920年，英国哲学家罗素应梁启超之邀来华，目睹了残破落后的中国，然而却独具慧眼地看到了中国人所具有的西方人没有的优点。罗素一生撰作甚丰，其洞见往往直指人心，发人深省，故而有评价这位老人具有“穿越时空的仁慧目光”。1922年，罗素归国后撰下《论中国人的性格》一文，颇有“穿越时空”之味。\n\n初来乍到中国，一定对那里显而易见的弊端感到震惊：乞丐成群，贫穷惊人，疾病横行，社会混乱，政治腐败。每个有正义感的西方人，无不首先强烈地期待中国人能革除这些弊端。中国理所当然地应进行改革。\n\n但是，中国人，甚至是那些本来可以避免充当不幸的牺牲品的人，对外国人的这种激情表现出无动于衷和麻木不仁的态度。他们就像等待苏打水的泡沫会自行消失一样，等待着中国现状中的弊端自行消失。而且，这种盲目的观望等待态度，也逐渐影响到被搞糊涂的外国旅游者的理智。\n\n等一阵愤恨过去之后，他们开始怀疑起自己原来一直确信无疑的信条是否正确。时刻提防不幸的可能降临，是不是一种真正的明智？放弃现有的欢乐，终月想着灾难的可能在某一时刻到来，是不是一种慎重？难道我们的生命应该在建造一座永远无法居住的海市蜃楼中度过？\n\n中国人对这些问题的回答持否定态度，因而他们能忍受贫困、疾病和腐败。\n\n中国也有抱负远大、雄心勃勃的人，只是不像在西方那样普遍。而且他们的抱负和雄心采取了不同于西方——并不优于西方的表现形式。他们选择了由偏爱享受权力而产生的一种形式。正是这种贪婪泛滥，导致了中国人由强变衰。金钱意味着能带来享乐，因而中国人把金钱作为强烈渴求的对象。\n\n中国人的“死要面子”，经常使在中国的外国人感到荒唐可笑。然而，中国人仅仅是要求实现与他们社会生活方式相一致的个人尊严。每个人都要“面子”，甚至连社会地位最卑下的乞丐也是如此。\n\n有一次，我认为我教的一些学生不像我期望的那样用功，我就像以前对我的英国学生那样谈了些看法。但我很快发现自己犯了一个错误。这些学生都很不自在地笑了。我对此感到很惊讶，后来我才搞清楚了其中的原因。中国人，甚至那些最文明的人远比我们西方人更讲究客套。\n\n没有比中国人的忍耐更令欧洲人吃惊的了。\n\n古老的中国本土文化已经变得几近僵死，其文化与艺术已不像过去那样具有生机，孔子的儒教已不再能满足现代中国人的需求了。凡受过欧美教育的中国人都认识到，他们需要外来的新因素来振兴他们的传统文化。因而，他们开始转向西方文明，渴望使中国传统文化得到新的活力。\n\n在我快要离开中国之前，有一位著名的中国作家诚恳地要求我谈谈中国人性格的主要缺点。我以犹豫的心情谈了三点：贪婪，懦弱，缺乏同情心。\n\n中国人的缺乏同情心，使每个西方人感到震惊。他们缺乏人道主义的冲动，而这种冲动促使西方用百分之一的精力，去安慰自己用百分之九十九的精力给他人造成的不幸。\n\n中国艺术正在遭受毁坏，取而代之的是拙劣的模仿欧洲的二流绘画。大多数受过欧洲教育的中国人，都对本民族的绘画缺乏审美能力，而且轻率地认为中国没有遵循绘画的透视法则。",
			"added": 1494935164
		},
		{
			"topic_id": 16,
			"title": "中国是一片还没有被人类的精神之光照亮的土地",
			"body": "“中国是一片还没有被人类的精神之光照亮的土地。在那里，理性与自由的太阳，还没有升起。人还没有摆脱原始、自然的愚昧状态。一切属于精神性的东西，都离中国人很远。”--黑格尔",
			"added": 1494943255
		},
		{
			"topic_id": 21,
			"title": "中国人真是猪",
			"body": "散步碰到某教授，说起禁美剧的事，他说：\"我们中国人真是猪，十三亿人，看什么不看什么，由几十个老头子决定，甚至一个老头子一个电话就能决定。不过我觉得，别说禁个剧，就算把网络全封了，我看大家也就是哼哼几下，马上转头吃潲水，兴高采烈看舌尖上中国。\"我说：\"您说得并不深刻。其实禁剧禁网都不算什么，就算禁了潲水，我们这些猪也会闷着头等死，你信不信？\"他怔了一下，大概想到了那饿死的四千多万人，异常响亮地回答：\"信！\"",
			"added": 1494979429
		},
		{
			"topic_id": 22,
			"title": "中共特科在得知顾顺章叛变后，决定对顾的家属秘密处决",
			"body": "中共特科在得知顾顺章叛变后，决定对顾的家属秘密处决，原因是其中一些人员事前在特科工作，并掌握党的某些机密，有动摇倾向，这个行动由周恩来负责执行，行动经过周密考虑，一是考虑到枪击声响惊动周围居民和杀人后血迹溅飞处理麻烦，而用绳索勒死全部家属，二是运尸体外出怕泄漏案情，采用处决其家属后直接在住宅庭院地下深埋并铺上水泥，因考虑到顾顺章幼女顾利群年龄只有4岁，周恩来派手下人员谭钟玉送回顾的家乡上海宝山，随后秘密行动开始，特科行动组人员即用事先准备好的麻绳对顾的家属逐个进行处决，并在庭院挖坑深埋。",
			"added": 1495013628
		},
		{
			"topic_id": 23,
			"title": "顾顺章的妻子被特科人员叫到里面问话",
			"body": "第二日，淞沪警备司令部会同戈登路巡捕房（位于戈登路康脑脱路、今江宁路康定路西北角口）探捕前往武定路修德坊6号发掘，同时附近派武装探捕巡守，先在天井北首近正屋处掘出麻袋包裹的男尸，尸身穿布背心，手脚用麻绳反搏，经辨认后为斯励尸体，后挖出3具尸体，认定为张杏华（顾顺章妻）、张陆氏（顾的岳母）、吴克昌（顾顺章嫂子的弟弟），斯励为国民党26军第二师师长斯烈的弟弟，以前为中共党员，顾顺章与斯励非常熟识的，某次顾在上海被当局拘捕，中共曾托其兄斯烈转告当局说情保出，所以两家常往来，中共特科估计斯励可能会随顾投诚敌方，所以采取此行动，当报纸披露案情后，其妻陈佩英（当年28岁）于11月24日下午一时赶到修德坊，见到刚被挖掘出丈夫的尸体后便号啕大哭，四时左右被陪来者劝回家，斯有二子，长子三岁，幼儿尚在襁褓中。\n\n《时报》记者根据斯励的妻子陈佩英的回忆和讲述，而写出新闻报道，称具体日期是在7月24日（这7月的月份记载，本文章考证有难度）下午三时，有人去闸北斯励家的，叫他外出有事，然后那天其丈夫出门后，一直没有归家，使她焦急万分，却无处打听到任何线索。现在案情已浮出水面，据调查披露，实际情况是在数月前，特科人员引诱斯励至武定路修德坊6号楼下，开始对他执行处决，四时左右动手勒毙斯励，深夜埋尸地下，同时特科人员以公务人员身份对斯家搜查。\n\n记者从特科叛逆人员那里获悉，顾顺章的妻子被特科人员叫到里面问话，说是你丈夫将来到了南京必定做大官，你是否也跟着他一起去呀？顾的妻子张杏华答道，我是嫁鸡随鸡嫁狗随狗，当然跟着他了。此话刚落，行刑人员即把绳索套住她头颈，猛力一勒，随即倒地毙命。",
			"added": 1495014111
		},
		{
			"topic_id": 24,
			"title": "中共特科假设她叛变会对中共组织极大破坏故决定将邹志淑勒死",
			"body": "邹志淑（女），浙江嘉兴人，负责地下党交通和掩护工作，尸体被挖掘前一段时期，有不知详情的人发现邹志淑怎么神秘失踪，据当时熟悉中共内部情况人士称，邹志淑可能工作不力，有违背党纪事宜，在平时言语中流露出动摇倾向，中共特科认为假设她叛变会对中共组织极大破坏，故特科决定将邹志淑也勒死，朱完白夫妇二人，朱是苏州工艺学校学生，朱完白二十余岁，长于词令熟悉英语，任党内翻译，在杭州工作是由党内某人介绍娶当地白相人之女为妻（其妻姓名不详，难以考证），婚后感情甚好，以至置党务工作不顾，至月末朱完白赴党部领薪金发生争执，特科人员恐其叛变泄密，将夫妇二人同时勒死，\n\n现在在上海市闵行区民政局中，关于邹志淑烈士的经历中讲到她是在“1931年4月被国民党特务杀害在爱棠新村”",
			"added": 1495014707
		},
		{
			"topic_id": 25,
			"title": "《王世德脱离共党紧要声明》",
			"body": "一九三二年一月十一日《申报》启事栏，王世德用真名刊登《王世德脱离共党紧要声明》，全文如下：\n\n鄙人于民国十六年加入共党。近两年来充任该党中央特务工作。因见于该党之倒行逆施，贻害社会，而复惨无人道，自相残杀，乃于前月向国民党悔过自新，从此脱离共党，谨此声明。再者，上月轰动一时之上海掘尸案，其告密之人名李龙章者，实即鄙人之化名。因该惨案确为共党首要周恩来、赵容等所为，而鄙人亦为当时参加杀埋之一份子，自向党国当局悔过自新后，即将该党此宗杀人藏尸灭迹之秘密残酷行为，悉行指出，故有此次骇人听闻之掘尸案发现。特此附带声明，使各界人士得以充分明了共党之罪恶。王世德谨启",
			"added": 1495014974
		},
		{
			"topic_id": 26,
			"title": "一千八百万知青下乡真相 周恩来策划多年 毁了几代人",
			"body": "笔者也是知青(乡龄八年)，一直关注“知青学”，但《失》书中一些数据仍闻所未闻，三十多年前的旧闻对我仍是新闻，一路发叹“原来如此!原来如此!”若非读到此著，将终身不了解这场运动的全局性信息。如从一九五六年起上山下乡就和解决失业“结合”起来了;一九六三年周恩来计划十八年内动员三千五百万知青下乡。上山下乡乃是中共政府在实践中摸索出来的解决失业之策──借助红色意识形态，将无法解决的失业大包袱甩给农村。",
			"added": 1495016280
		},
		{
			"topic_id": 33,
			"title": "中国律师事务所新职位：政治委员",
			"body": "微信公众号“天津律协”本周透露，天津市律师行业将在5月20日前“层层设立政治委员”。\n\n政治委员简称政委，一般指中国军队或警察机构中的党组织领导人。\n\n“天津律协”通报称，天津市非公有制经济组织和社会组织工委召开的“设立政治委员工作推动会”确认了在律师行业设立政委的消息，其目的是“推动全面从严治党向基层延伸，巩固扩大社会组织党的组织和工作覆盖成果”。\n\n通报引述天津市律协秘书长郑凤英的话称，将“按照市委决策部署，确保律师工作正确的政治方向，努力建设一支政治可靠、业务过硬的高素质律师队伍，以优异的成绩迎接党的十九大和市第十一次党代会胜利召开”。",
			"added": 1495126117
		},
		{
			"topic_id": 37,
			"title": "美国国际宗教委员会开展“宗教良心犯”营救项目",
			"body": "“宗教良心犯”首批关注名单上共有11位宗教人士，来自厄立特里亚、沙特、越南、中国、伊朗、俄罗斯和缅甸。其中两名来自中国，一名是维族作家古丽米拉·艾明（Gulmira Imin），另一位是达赖喇嘛指定的第十一世班禅根敦确吉尼玛。",
			"added": 1495162611
		},
		{
			"topic_id": 41,
			"title": "长沙检察院终于向律师承认级别不够，管不了江天勇案，",
			"body": "长沙检察院终于向律师承认级别不够，管不了江天勇案，律师再去湖南省高检，该院湖南省检察院同样坚决不收律师控告长沙市公安局局长唐向阳侵害律师执业权利的资料，陈进学怒而咆哮：你们还遵不遵守法律？怂蛋检察官们一溜烟全跑了，律师只能留置材料后离开。",
			"added": 1495170513
		},
		{
			"topic_id": 64,
			"title": "要徹底地堅信：民主，自由，文明，高雅，這些都跟支那人種無涉。",
			"body": "多餘的話！人類都已進入第二十二世紀了，這地球上還須用性命去拚民主的卑賤之地已寥寥可數，還他媽的說死也無法了解民主的民族算來也就是那一兩個極其低賤愚痴的人種。不必費力氣指望支那從良，那是絕對緣木求魚的事。要民主的支那人應該踴躍地參加已經民主化了的國家。\n要徹底地堅信：民主，自由，文明，高雅，這些都跟支那人種無涉。",
			"added": 1495528031
		},
		{
			"topic_id": 82,
			"title": "【斯大林说：“党什么事情都干得出来”。】",
			"body": "斯大林曾威胁列宁遗孀克鲁普斯卡娅，如果她不停止对他的批评，那么党会宣布她不是列宁的妻子。惊得克鲁普斯卡娅目瞪口呆，斯大林随即补上一句：“是的，党什么事情都干得出来！”一个是“什么事情都干得出来”的组织控制着一切，我们还要谈知识分子的社会责任，不觉得过于奢侈吗？",
			"added": 1495717144
		},
		{
			"topic_id": 83,
			"title": "为什么宪政主义的意识形态没有了？",
			"body": "看看清末时的意识形态﹐组党自由﹑地方自治是天经地义的﹐没有人可以抗拒这些。\"三人可组党\"﹑\"政府不能迫害反对党\"﹐这在清末和民初已经是中国人的意识形态了。那么为什么那么早宪政主义的意识形态已经有了﹐而现在却那么难？",
			"added": 1495717377
		},
		{
			"topic_id": 91,
			"title": "醍醐灌顶",
			"body": "有个美籍华人，有一天突然发起爱国心，回到祖国工作。政府把她竖为典型，后来此人生病，政府也特意安排到一个特供医院，发现护士唯独对她很冷淡。就忍不住问，有个护士说，你根本不够级别住我们这。此华人醍醐灌顶，出院后立刻离开祖国，再也没回来。呵呵，祖国。",
			"added": 1495813697
		},
		{
			"topic_id": 93,
			"title": "《人民的名义》真实剧情上演",
			"body": "湖南基础建设投资集团党委书记、董事长彭旭峰上任仅3个星期因受威胁贪腐事发被双规而从长沙经上海逃往美国，完全如同中国正在热播的《人民的名义》剧情，据媒体说人们不禁要问：谁通风报信放走了彭旭峰？谁提拔了彭旭峰？为何〝突然〞出逃？带走了多少资金？据报彭旭峰此前已向美国汇寄转移至少1亿5000千万美元赃款。",
			"added": 1495816025
		},
		{
			"topic_id": 101,
			"title": "索尔仁尼琴：不要靠谎言过日子",
			"body": "不为那意识形态僵尸涂脂抹粉，不为那腐朽的破衣烂衫缝补漏洞；听到发言者的谎言，荒诞无稽的空论或恬不知耻的宣传立刻离开会场、讲堂、剧院和电影院；不订阅和不零买报道失实或隐瞒重大事实的报刊杂志；假如我们连不参加撒谎的这点勇气都没有，我们真的一钱不值，无可救药了。",
			"added": 1496043950
		},
		{
			"topic_id": 104,
			"title": "【武长顺绿帽警帽一起戴，他的9个私生子仅3个亲生，他的二奶们被谁嫖了？】",
			"body": "武长顺被指涉贪金额高达74亿人民币、道德败坏，长期与多名女性通奸，除包养4名警花外，还与一名女艺人和数名女大学生非法同居，先后生育了九个私生子。\n\n武长顺被调查后，“经组织监定，九个私生子中只有三个是他亲生的。”有网友调侃道，“武爷戴着绿帽白为人家养儿子，担风险搞贪污，为九名私生子尽责尽力，这样的贪官真亏”",
			"added": 1496053757
		},
		{
			"topic_id": 108,
			"title": "苏联——生于不义，死于耻辱！",
			"body": "苏联起于十月革命，乃是在一战正酣之时，列宁受了德国人资助回国在国内宣传反战，瓦解军队斗志，向德国投降，这种事在我们中国人看来无异于俄奸，而在西方协约国盟友看来也是单方面毁约的不义行为，另外革命前号称要给民众广泛民主，成功后残酷镇压参与革命的孟什维克和小党派，不承认他们的权利。",
			"added": 1496123385
		},
		{
			"topic_id": 109,
			"title": "中共党组织到底是什么性质？ 一、它是一个非法组织…",
			"body": "中国共产党于1920年成立，1949年篡国建政，所谓“中华人民共和国”至今已有68年历史。68年间，中国国土沦陷，环境恶化，礼崩乐坏，人民更是日复一日地活在苦难中，死的死，逃的逃。但中共仍在世人面前恬不知耻地以“伟大光荣正确”、“人民的大救星”、“抗日英雄”等面具伪装自己，依仗其宣传机器的强大和精密竟也使不少人受骗，全然忘了这个党，这个组织是什么性质的党，什么性质的组织。 那么，中共党组织到底是什么性质？ 一、它是一个非法组织…",
			"added": 1496123670
		},
		{
			"topic_id": 111,
			"title": "戈尔巴乔夫、叶利钦宣布解散苏共声明：",
			"body": "1991年迫于全苏联人民强大的反共压力，戈尔巴乔夫和叶利钦在克里姆林宫共同宣布共产党为非法组织，简文如下：\n　　马列主义这一套荒谬的邪说经过七十多年的实验，从理论到实践上都是失败的。历史和事实都已证明这是彻头彻尾的祸害人类的荒谬邪说。 斯大林为了统治俄罗斯和世界，把社会主义制度和共产党不断推向世界各国。\n　　在世界的各个角落，只要出现共产党就会出现内战，饥荒和恐怖。为此，我们在克里姆林宫真诚地向全世界上受共产党迫害的人民和国家道歉。 现在我们郑重宣布：\n　　1、前苏联共产党的所有组织全部解散，从即日起前苏联共产党的任何活动都是非法的，并要受到法律制裁 。\n　　2、一切参与过暴乱的党徒立即到指定机关自首并听候处理。\n　　3、没收前苏联共产党所有财产并为俄罗斯国家所有。\n　　苏联总统 戈尔巴乔夫\n　　俄罗斯总统 叶利钦\n　　1991年12月17日23",
			"added": 1496148623
		},
		{
			"topic_id": 112,
			"title": "这个社会的不正常",
			"body": "这个社会的不正常之处在于，那么多的高官子女没一个是农民工，没一个是工薪阶层，没一个有正当职业，但却没有一个不腰缠万贯，没有一个不富贵奢华，没有几个不是外籍人士！更不正常的是，面对这种举世无双的不正常，感觉到不正常的民众，对这种不正常毫无办法，除了愤怒，毫无他法。尤其可悲的是很多正常的民众对这种不正常反而感觉很正常，并不惜大量口水教导你：不能改变这种不正常，只有努力去适应这种不正常！",
			"added": 1496149013
		},
		{
			"topic_id": 124,
			"title": "女作家土改小说遭左派文革式批判 真实的性酷刑惨烈无数倍",
			"body": "《开放杂志》曾经报道重庆师范大学的副教授谭松关于调查川东土改的调查。谭松教授表示：那些血腥惨烈的场面他自己也难以承受。一个地主媳妇交不出金银，被脱光衣服遭受碳烤活人酷刑，烤得乳房和肚皮往下滴油。他们强迫未婚女子脱裤分开两腿被人摸下身，将木块、铁条和脱粒后的玉米棒插进女人下体反复朝里捅。一位土改民兵连长李朝庚接受谭松采访说，土改时忠县有个未婚女子梁文华还未结婚，本身不是地主，因为是全县著名美女，就被十多个土改民兵抓去轮奸致死。",
			"added": 1496317926
		},
		{
			"topic_id": 130,
			"title": "老太太说：大陆这地方太野蛮了",
			"body": "陈丹青在他的文章里就说过，他的母亲享受美国的福利制度，每月可拿七百多美金的养老金。陈丹青给她在上海买了房子，可回来没几天，说什么要回美国。陈丹青问她为什么。老太太说：大陆这地方太野蛮了，我走路上电梯、上车或是去医院，后面总有人用力推我。而我在美国生活了二十年，只被人推了两次，回头一看，都是中国人推的…",
			"added": 1496454321
		},
		{
			"topic_id": 134,
			"title": "当年飞虎队成员里面有我一个朋友，我在电话里是这么告诉他的。",
			"body": "你作为北京人，你给广场的人送食品是义务，我无异议。但是要记住，不要多说话只做事。事实证明我是对的。广场周围几个派出所内外勤女警全部乔装出来街拍，冒充市民坐在飞虎队员摩托后座上套个人信息。后全北京派出所清查家里有摩托车的人。",
			"added": 1496471492
		},
		{
			"topic_id": 137,
			"title": "这份军事命令也就是屠杀令，必须公开。",
			"body": "八九六四这样大规模军事行动和使用机关枪坦克等正规军武器大规模屠杀手无寸铁的学生平民，必须有中华人民共和国中央军事委员会主席和副主席联名签署的军事命令，这份军事命令也就是屠杀令，必须公开。",
			"added": 1496477736
		},
		{
			"topic_id": 152,
			"title": "郭文贵爆料到现在，我相信很多推友，网友已经看不懂了。我也来说说吧，便于网友们了解。",
			"body": "现在的年轻人不了解郭文贵说的一些事情的时代背景，所以无法明白他说的一些事情。也难以了解郭文贵现在的一些表达。\n\n他弟弟的死，是他人生中的一件很大的事情，对他后来的人生有很大的影响，这是他反复强调的。所以要明白他说的一些话，明白他现在的一些表达，有必要先弄清楚这点。\n\n郭文贵很早出来做生意，那时一般人也包括他能做的生意无非是跑单帮，那时也叫投机倒把，或者摆小摊。我估计开饭店，饮食店他还没有那样的能力。个人承包企业更不可能。\n\n但是那个时代还有一些所谓的生意，上海人称为空麻袋背米的。就是倒卖钢铁，倒卖煤炭，倒卖汽油，倒卖车皮，倒卖化肥，塑料原料，南朝鲜的电子计算器，甚至还有马来西亚三合板生意，麻袋生意。号称的成交数量都是非常大的，非常疯狂。如何疯狂呢？我举个例子，如果那时你做生意，有人会向你要货几十万条麻袋，甚至几百万条麻袋。反过来，他也可以向你供货几十万条麻袋，甚至几百万条麻袋。也可能会有人向你要货马来西亚三合板一条船的供货量。反过来，他也可以向你供货马来西亚三合板一条船的供货量。有人会向你要货南朝鲜的电子计算器几个集装箱，反过来，他也可以向你供货南朝鲜的电子计算器几个集装箱。\n\n当时上海一个大学生毕业生的工资只有60块。一个万元户就吓死人的年代。开一个批发公司注册资金必须达到30万人民币的年代。你能想象那些所谓的生意有多疯狂。\n\n你明白了这个社会大背景，你就具备了明白他弟弟的死，及他后来为什么会坐牢的预备知识。而且你也具备了了解89年6-4民主运动的预备知识。\n\n当时有很多人卷入这种莫名其妙的“生意”，郭文贵才20岁，没卷入这种疯狂反而不正常。所以，他说的别人向他要几十吨，或者几百吨汽油，我一点不奇怪。他说的应该是真实的。但是这种“生意”他们肯定做不成的，对一个普通人，这是一种子虚乌有的生意。所以，只要有一方付出了保证金，他们后来一定会有纠纷。\n\n对这种事，说诈骗，那不是事实。那是交易双方都缺乏理智。所以，有人说郭文贵是因为诈骗坐牢的，有根据，但是却不是事实。不过看来郭文贵是收了别人的保证金。\n\n那么该说郭文贵弟弟的死了。对方一定是来要保证金的，而且对方还有点关系，能把警察一起叫来，还带着枪。这2个警察据郭说是喝醉酒的，这应该是来之前对方请客一起喝的。但是郭文贵收的钱应该已经还不出了，他已经又上了别人的当了。前面说了这是不理智的交易行为。当然也有可能他不想还，这种可能性低一点。\n\n这里可以看出，当时郭文贵在当地没有与政府之间的关系。这里特别要注意警察是带了枪，而且上了子弹。在那个年代，警察是不能随便把枪带出来的，更别说上了子弹。\n\n警察怎么会把枪带出来呢？我想与当时中共的一个运动有关系。那时中共有一个书记抓大案的运动，是全国范围的。估计郭文贵那个纠纷在当地是属于大案，当地的书记介入的。后来闹出人命了，这个案子变的不好处理了。\n\n后来又怎么把他抓起来了，坐了22个月的牢，这个不太好判断。因为中间怎么会断了一段时间。他弟弟这命案也不知道是怎么结的。他怎么又跑到东北去了。不过这些不重要，重要的是可以看出当时警方是要整他的，如果不是因为他弟弟意外死亡，他在当时被判5年不止。特别是在江泽民上台初期，抓了很多个体户，他要是赶上那时，可能得坐10年牢（这个我是对比我们一个邻居，他只是帮家乡社队企业介绍了一些业务，人家给了他一些好处，最多几千块钱。因为这人并没有任何权力，只是很普通的工人，就被判了5年。）那就不会有现在的富豪郭文贵了。可以说，郭文贵的一切都是他弟弟的命换来的。\n\n那么他弟弟的死对他会产生什么影响呢？郭文贵草根，没有文化，能有什么影响呢？我认为会有这样的影响：中共真TMD黑，共产党真TMD无法无天。不可能会影响他产生一种认识，中国需要法治，中国这种政治制度是有问题的。中国需要民主与自由。还可能会影响他的是，要结识有权力的人。不然会被人欺负。最多就是这样了。\n\n但是，郭文贵一直说他与军队有渊源。他父亲好像也是军队的。可是他父亲又是下放到东北去的。这个就不同了。军队的怎么会下放呢？他父亲又不可能与林彪案有关系。而且时间上也不对啊。\n\n可能的情况是他父亲是因为政治原因下放的。应该是会有出格的言论。那么这就有可能影响郭文贵。这样的话，他弟弟的死对他的影响就不会像一个草根，没文化的农民那样了。他还真有可能因为他弟弟的死就已经认识到社会制度的一些问题了。从他现在的言论中，反复说到以警反贪，以警治国，可能他在那时就已经认识到警察权力的制约问题了。当然应该是比较肤浅的认识。我认为直到现在，郭文贵在这方面的认识还是比较肤浅的。\n\n比如，当时警察显然过度执法了。可是，如果没有中共的书记抓大案，他敢把枪带出来吗？中共为什么可以发动书记抓大案的运动？他没有这样深层的思考。\n\n网友们了解了当时的这些社会背景，应该对郭文贵现在的一些表达就能比较容易的理解了。\n\n上面说了，了解了当时的社会背景，也就具备了解89年6-4民主运动的预备知识。当时那些非常疯狂的一些所谓的生意，真的都是子虚乌有的吗？不是的，其中很多还真有。但是那些生意都是高官子弟才能做的，都是要批文的。就是称为“官倒”，倒卖批文。这些就是引发89年6-4民主运动的原因之一。6-4民主运动中的一个主要诉求就是反“官倒”。",
			"added": 1496594709
		},
		{
			"topic_id": 156,
			"title": "中国人的逻辑",
			"body": "有人问他为什么崇毛，他说因为他没饿死。（他上小学，全班30几个同学，饿死得只剩下2位，他是其中之一）。问他为什么没有饿死，他说因为他爸妈全饿死了，他成了孤儿，得到共产党照顾，所以感谢毛主席。其实，这也是很多人的逻辑。",
			"added": 1496671487
		},
		{
			"topic_id": 161,
			"title": "拉梅尔教授的“民主时刻表”预言：到2025年，全球将铲除所有独裁者。",
			"body": "从目前局势来看，毫无疑问，无论是北韩的独裁、叙利亚的野蛮、伊朗的恐怖威胁，所有的专制政权其实都已到了穷途末路的历史尽头。前美国驻匈牙利大使、后担任《自由之家》副总裁的人权活动家帕尔默在2003年出版的《打破真正的邪恶轴心：怎样在2025年之前铲除全球最后独裁者》一书中指出：“独裁者是导致贫穷、恐怖主义、专制的主要原因，也是对美国及全球安全的威胁。所以，全世界所有人都应该致力铲除那些最后的独裁者。”\n帕尔默曾做过总统演说撰稿人，里根总统当年那段对共产主义盖棺论定的著名演说词就出自他的手笔：“苏联拒绝给自己的人民自由和人道尊严，那是对抗历史潮流的。我在这里描述的是长程的计划和希望：自由和民主的长征，将把马克思列宁主义扫进历史的垃圾堆。”\n这不仅是预言，更是对历史的回顾：1776年全球只有1个民主国家(美国)，今天全球已有130个国家多党选举。239年间，人类发生超过两千年的巨大的变化——这是历史的“华丽转身”，也就是李鸿章所说的“三千年未有之变局”，它雄辩地证明：全球民主是不可逆转的趋势，一切专制、极权体制，都将被历史埋葬，任何独裁者都会被刻在历史的耻辱柱上！转",
			"added": 1496724062
		},
		{
			"topic_id": 165,
			"title": "美国对联合国人权理事会发话：如不改革就退出",
			"body": "",
			"added": 1496767238
		},
		{
			"topic_id": 166,
			"title": "美国坚持践踏人权国家不应入选联合国人权委员会",
			"body": "联合国人权委员会召开第35届年会之际，美国驻联合国日内瓦人权委员会代表妮基哈蕾对该委员会现有组成成员提出批评，坚持任何践踏人权国家都不应被选入这个人权委员会。美国还反对该委员会年年开会都立案讨论以色列以及以色列占领土地人权问题。美国威胁退出联合国人权委员会。\n\n据法新社今天发自日内瓦消息，美国驻联合国人权委员会大使妮基哈蕾今天再次表达美国对联合国人权委员会的原则与立场，敦促该委员会进行改革。美国威胁，如果这个人权委员会不改革，美国将退出人权委员会。\n\n妮基哈蕾今天稍晚在日内瓦高等学院发表演讲，阐述美国对联合国人权委员会的立场。据妮基哈蕾批评，入选联合国人权委员会成员是一种荣誉和职责。美国主张任何人权纪录不佳的国家都不应当入选进入联合国人权委员会。\n\n不过，美国驻联合国人权委员会大使至今只明确点名委内瑞拉，美国批评委内瑞拉人权糟糕，并敦促委内瑞拉自己退出该人权委员会。\n\n人权委员会由联合国大会选举产生。目前该委员会有人权问题受到批评的中国与古巴担任成员。美国公开批评中国与古巴人权糟糕。\n\n美国敦促联合国人权委员会改革，使得这个机构更为有效更为负责任以及更为积极。美国要求人权糟糕的国家不应当被选入这个机构。美国威胁，如果人权委员会不进行改革，美国将退出这个机构。\n\n美国被选入人权委员会，任期到2019年。\n\n美国还多次批评这个机构对以色列的敌视立场，美国大使批评，以色列是所有国家中唯一一个被贴上7号标签国家，一年3次全体会议都被立案讨论以色列本土以及占领土地人权问题。\n\n美国国务卿蒂勒森今年年初曾给人权组织写信，敦促联合国人权委员会做出重要改革，以使美国能继续参与工作。\n\n美国大使妮基哈蕾今天表示，本届联合国人权委员会应当就不同国家的人权状况推出措辞强硬的决议，美国关注的国家包括叙利亚，刚果民主共和国，厄立特里亚和白俄罗斯的人权问题。\n\n来源：法广\n作者：小山",
			"added": 1496767677
		},
		{
			"topic_id": 170,
			"title": "中共古巴在列，美国坚持践踏人权国家不应入选联合国人权委员会。",
			"body": "联合国人权委员会召开第35届年会之际，美国驻联合国日内瓦人权委员会代表妮基哈蕾对该委员会现有组成成员提出批评，坚持任何践踏人权国家都不应被选入这个人权委员会。美国还反对该委员会年年开会都立案讨论以色列以及以色列占领土地人权问题。美国威胁退出联合国人权委员会。",
			"added": 1496798416
		},
		{
			"topic_id": 175,
			"title": "这他妈的是21世纪吗？",
			"body": "听一出版界朋友说：目前掌管审核大权的某领导，对民国深恶痛绝，所以民国题材书一概不让出版。我他妈的彻底醉了，举国出版听一个傻逼瞎指挥，这他妈的是21世纪吗？",
			"added": 1496812070
		},
		{
			"topic_id": 182,
			"title": "伤害了中国的感情",
			"body": "徐继畬（1795年－1873年），1849年根据自己在福建两广地区做地方官时通过与西方人的交往中获取到的知识，书籍而加以整理写了一本著名的书《瀛寰志略》。这本书是对全世界一些主要国家的地理、历史、政治的介绍。最有名的一段是徐继畬对华盛顿和美国政治制度的赞美。\n\n徐继畬说：“华盛顿像陈胜、吴广一样起义，并且割据一方，打下江山后，竟然没有自己坐江山，而是建立了一个天下为公的国家。谁当国家领导人，让人民来选，国家有什么事要干，要人民一起来商量。简直是破天荒。”\n\n就是这么段话，遭到了围攻。曾国藩说他“长洋人士气，灭自己威风。”晚清文学家李慈铭说他“不知轻重，伤害了中国的感情”。徐继畬也因为写了这本书被弹劾了，这本《瀛寰志略》在清朝也成为禁书。\n\n然而，这本书同时也传到了日本，却获得了不一样的命运。日本人从来没见过一本这么好的介绍世界的书，于是从1859年开始大量刊印，争相阅读。《瀛寰志略》在日本出现的时间比日本启蒙思想家福泽逾吉的作品还要早。这本书成了日本人的启蒙之书，让日本人知道了自己和西方世界的差距，也为日本开启了后来的明治维新之路。",
			"added": 1496902625
		},
		{
			"topic_id": 189,
			"title": "秋瑾女儿追踪杀母凶手知府贵福",
			"body": "秋瑾女儿追踪杀母凶手知府贵福，贵福躲到东北，她从南方追到东北，手刃此贼为母复仇，，六四被杀的据说上万，一万多父亲没一个为娃报仇的，，包括你们民运。。在美国干掉袁木有多可怕？五百家土共，你们杀过一个吗？捐款，研究，辱骂，，有过让土共流一滴血吗？没有民族血性，就有这样无耻的土共",
			"added": 1496997979
		},
		{
			"topic_id": 197,
			"title": "组织说她是特务",
			"body": "79年后，鲁迅孙子周令飞要去日本自费留学，国家觉得自费出国，有失国家体面。公费出国周令飞资格又不够，就这么尴尬着。后来说这样吧，你自费，但对外要说国家派遣的，于是去了日本，周到日本认识个台湾姑娘，组织说她是特务，你别留学了特么赶紧回来。周大怒，脱党，拎着游泳圈就跟姑娘飘台湾去了。",
			"added": 1497246475
		},
		{
			"topic_id": 198,
			"title": "杜月笙为何不回大陆",
			"body": "陈毅长电拉他回去\n\n一九四九年五月二十七日，国军撤出上海，是日杨虎、吴绍澍等自大西路引入共军。共产党指派陈毅为上海市长，陈毅上任以后所办的第一件事，便是“情词恳切”地公开致电旅港上海耆绅、金融工商领袖五大亨，是为杜月笙、陈光甫、李馥生、宋汉章和钱新之。\n\n由于长电之来，犹如石沉大海，陈毅心目中的五大亨，并无只字片语答复。陈毅还不死心。也可能是徐采丞在为他自己亟于脱离虎口，又耍了一记噱头，陈毅“派”他以上海市地方协会秘书长的地位与关系，专程跑一趟香港，迎迓杜、陈、李、宋、钱五大亨返沪。徐采丞抵达香港以后，其结果是他自己从此也不重蹈覆辙，他留在香港，不再回到黄浦滩。\n\n统战分子劝诱无功，陈毅的“笑靥迎人”又被杜月笙视若无睹，置之不理，共产党亟需杜月笙重返上海，于是，他们方始又施一计，派出杜月笙的一位老友，被李宗仁任为和谈五代表之一的章士钊。章士钊专程跑一趟香港，为共产党尽量争取可资利用的人物，其中最重要的一位，厥为杜月笙。\n\n章士钊“衔命而来”，力图“立功、报效”，他深知中共心目中主要目标何在，因此集中全力，先解决杜月笙的问题。到香港后，他便不时出入坚尼地台杜公馆，登堂入室，有时直趋病榻之侧，和杜月笙接席密谈，他分析天下大势，国际动向，尤其对他的同乡后辈毛泽东歌功颂德，捧得来肉麻之至。\n\n第一次长谈，杜、章之间，便有一段颇为精彩的对话，约略如下。\n\n当章士钊滔滔不绝，盛赞毛泽东是如何的尊老敬贤，求才若渴时，杜月笙很巧妙地接过他的话来，用非常关怀的口吻，问起章士钊：“章先生是决定在北平定居了，是吗？”怔了一怔，章士钊方答：“是的。”\n\n“章先生是否照旧挂牌做律师？”“这个——”顿一歇，章士钊只好老老实实地回答：“诚然，共产党统治下是用不着律师的，我不能再挂牌，不过……”\n\n这一次，杜月笙接口很快，他不等章士钊把话说完，便问：“章先生既然不能再做律师，那么，你有什么计划？是否想改行做做生意？”\n\n“做生意嘛，只怕制度也不容许，”章士钊被杜月笙逼得太紧，唯有直话直说，坦然吐露，却是接下去他又得意起来：“不过，毛主席当面告诉过我，我在大陆，一切有他负责。有了毛主席的这一句话，个人的生活种种，那还用得着担心么？”\n\n于是，杜月笙像在自言自语，他一叠声地说：“啊啊，只是生活不用担心，只是生活不用担心。”\n\n章士钊听后，顿即面红耳热，嗫嗫嚅嚅地支吾了几句，第一次长谈，自此草草结束。\n\n等到章士钊告辞离去，姚、孟二氏、儿子女儿，还有亲信诸人，都在等候消息。杜月笙坐久了，有点累乏，可是他仍然说出了两人之间所谈的这最要紧一段，然后他摇头苦笑地说：“章先生年纪一大把，做官的兴致高极！只要有官做，他跟谁都可以，但是他投了共产党毛泽东，却只说是保障他的生活。既然只为了生活的话，台湾、香港、美国……随便哪一个地方，也要比共产党那边的日子舒服得多。”\n\n讲过了这两件往事，在一旁凝神倾听的妻子儿女，心里都有了数目。照杜月笙的看法，章士钊自顾尚且不暇，他本身的欲壑始终不得一填，又怎能说服杜月笙？\n\n然而章士钊使命在身，他不能死心也无法死心，坚尼地台还得三日两头的来，有时候就在杜公馆吃中饭，和满座嘉宾、杜门中人同席用餐，说说笑笑，情景依稀当年，却是许多熟朋友间已有相当的距离，场面也显得尴尬来兮。\n\n劝人的反被人劝去\n\n章士钊要不断地往杜公馆跑，就无法避免和国民党的要人劈面相逢，相逢时更免不了有窘迫的场面出现。\n\n头一回是碰到多年交好的老朋友吴开先。晚饭过后，杜月笙邀章士钊、吴开先一同到阳台上歇凉，看香江夜景，任轻风拂面。当时，章士钊有点倚老卖老，忍不住地重弹旧调，尽在为共产党说好话，称夸毛泽东何等的礼贤下士，奖掖人才，他口口声声地作保证，只要杜月笙肯回大陆去，不论在何种情形之下，共产党绝对不会亏待杜月笙。\n\n吴开先在一旁听得忍无可忍，他一声冷笑，亦庄亦谐地加以驳斥：“章先生，你在骗什么人呢？我从民国十六清党之役算起，跟共产党交手了二十多年，共产党的真面目，难道我还不认得？老实不客气说，就讲有关共产党理论的书籍，只怕我也要比章先生多看两本。”\n\n章士钊窘透，当下强词辩解地说：“你这种说法，可拿得出事实、证据？”\n\n开先打个哈哈，再调侃地追问：“章先生，此地此刻只有你、我和杜先生。章先生你的这一套，究竟要骗我呢，还是要骗杜先生？”\n\n趁此机会，杜月笙哈哈一笑，替章士钊暂时解了围，同时也显示了自己绝不会轻易上当的决心。\n\n不断纠缠，常时登门，章士钊的这场牛皮糖攻势，要到几时方休呢？杜月笙不耐烦时，自有他的退兵之计。多一半也是出乎一片爱顾老友的诚意，一部分则在于早日结束这一场必无结果的冷战。渐渐地，在跟章士钊谈论之间，杜月笙开始反转来劝章士钊。他劝章士钊到台湾去，或者远走高飞，保全晚节，他苦口婆心地说：“最好早早脱离，图个清吉平安。”\n\n杜月笙不曾留章士钊蹲在香港勿走，那是因为他早已获知，共产党放章士钊出来办事的同时，即已在他身边布置了监视人员，除开上杜公馆，章士钊一直在监视之下。\n\n因此，他甚至于极其诚恳地对章士钊说，如果章先生决心脱离共产党的羁绊，无论是到台湾或者到外国，行程和安全问题，杜某人可以拍胸脯包管解决。\n\n章士钊不觉倒抽一口冷气，但是他无法发作，更不能提出任何抗议。几十年来杜月笙对章士钊的好处多矣，何况，杜月笙态度的诚恳，也令人不容置疑。\n\n恰好在章士钊和杜月笙反复辩论、不得结果的这一段时期，毛泽东在北京喊出了“人民民主专政”的口号。章士钊见这“六字真言”时连他也大不以为然。那日他到坚尼地台杜公馆去，座中偏有王新衡在，章士钊说民主与专政根本上是两极端之事，毛主席焉可混为一谈？王新衡于是便正告章士钊说：“章先生，我是到过俄国的，我懂得这就是列宁的基本理论，共产党所极力提倡的正是这个。他们跟英美国家不一样，‘民主’和‘独裁’在共产党是二者为一，混淆不清的。你莫听他们口口声声地喊‘民主’，其实他们的所作所为无一而非‘独裁’！”\n\n王新衡用醍醐灌顶之势，正是要唤醒章士钊的迷梦，因此杜月笙接下来便劝章士钊“倒向苏俄不如倒向英国”，何不就在香港住下，不要再去上共产党毛泽东的当了。章士钊听后默然，使杜月笙、王新衡都觉得，这一次劝他悬崖勒马，可能会得生效。\n\n可能是章士钊听过杜月笙、王新衡的循循善诱后，神情举止的变异使负责监视他的人起了怀疑。一日，章士钊在他的港寓，刚派佣人出去买东西，他正一人在家等候，监视人员推门进来，请他即刻登车回大陆。据章士钊家的邻居后来对杜公馆的人说：当时章士钊曾要求等佣人回来，作一交代，但是不准，章士钊又说要去楼上向某人辞个行，对方还是拒绝。于是，章士钊自此不告而别，他等于是给架走的。\n\n回北京后的章士钊，其后也曾出来到过香港几趟。除了做人民代表大会聊备一格的代表和文史馆副馆长，支几文干薪维持生活。",
			"added": 1497248848
		},
		{
			"topic_id": 200,
			"title": "〔援外其实是幌子〕",
			"body": "很多人对终国大规模援外痛心疾首，他们不知道，所谓援外，附加条件都是指定项目和承包公司的，大部分钱都流入了承包商-红色家族的海外账号！这是捞钱、洗钱、转移财产三结合的最爽快的方式！这也是为什么受援国人民并不感激的原因所在：他们得到的不过是一大堆假冒伪劣工程和环境污染，只有政客分享了一些赃款！～@张林",
			"added": 1497249247
		},
		{
			"topic_id": 205,
			"title": "布尔什维克凭证可以“公有化”10个姑娘",
			"body": "十月革命胜利后，苏联布尔什维克在各大城市里建立了社会主义政权，并实施“共产共妻”制度。到了20世纪90年代初，辉煌一时的前苏联瞬间解体，大量苏联布尔什维克的领袖们的私生活秘密以及革命历史上确实存在的共妻现象相继曝光。据十月革命史料显示，在当时，15至25岁的妇女必须接受“性公有化”，革命者可行使此权利，即可向革命机关申请许可证。布尔什维克凭证可以“公有化”10个姑娘。",
			"added": 1497284101
		},
		{
			"topic_id": 208,
			"title": "“党建全覆盖”是民营企业灭顶之灾",
			"body": "“党建全覆盖”是民营企业灭顶之灾\n\n在中国大陆，民营企业是非公有制企业的统称，亦简称“民企”或“私企”。\n\n前些日，一位私企老板见到我，满脸沮丧地说：“中国的私营企业肯定不会有好下场！我已经将厂子廉价转让了。”他是搞食品加工的，打拼了20余年，业务颇具规模，据说身价逾千万，怎么说不干就不干了呢？\n\n他说，对外讲是经营不善，实则是要逃避中共的“党建全覆盖”。他不是党员，上面要他申请入党，并承诺让他当书记。他说他是生意人，不信仰马列和共产，拒绝入党。厂里已有的3个党员，都是不善言语的粗壮工，不是当书记的料子，行业党委要给厂里派一个退休官员来当书记。他顶着不答应。他的想法很现实，厂里若建立了党组织，我的企业就改姓“党”了，“私产”就会沦为“党产”。由于他的顶牛，有关方面就给穿“小鞋”，设障碍，经营不畅。于是他一狠心就把厂子卖了。儿子在美国大学毕业，事业有成，并拿到了“绿卡”。他决定投靠儿子，移民美国求发展。\n。。。。\n\n“前事不忘，后事之师。”习近平对私营企业强制推行“党建全覆盖”，显然是毛泽东“资本主义工商业改造运动”（亦称“社会主义改造运动”）的重演或曰翻版。中共建政不久，急于改变经济窘境，在1953年至1955年期间，开展了一场席卷全国的社会主义改造风暴，通过所谓的“赎买”、“公私合营”等欺诈手段，将所有私营工商业及个人商贩，全部掠归国家或集体所有。1956年2月3日，时任中共广东省委第一书记的陶铸在资改工作座谈会上兴奋地说：“我们在很短的时间内就把资本家的全部财产拿过来，约计全省私营工商业的资金有一亿九千多万，现在被我们拿过来了，国家发了一笔洋财。一亿九千多万元相当于19多亿斤大米。广东年产大米是18亿斤，即几天时间被我们‘共’了一大笔财产。”（据互联网“疾风资料库”文章）从此，在中国大陆，私营工商业便断子绝孙了。前些年，电视剧《大宅门》，包括央视在内的多家电视台轮番热播很长时间。这是一部中国民营工商业的生存史的生动再现，看完这部40集电视剧，不少人发出这样的感叹：“中国民营工商业，没被满清王朝挤瘫，没被日本侵略者毁灭，没被国民党政府整垮，最终统统死在了中共新政权的手里。”\n。。。。\n2017年6月6日\n\n来源：民主中国\n作者：柴路",
			"added": 1497373626
		},
		{
			"topic_id": 212,
			"title": "近日，中共史上最有名的间谍金无怠之墓惊现北京",
			"body": "有网友近日在北京香山意外发现了中共史上最有名的间谍金无怠之墓。当年中共安全部北美情报司司长俞强声投诚美国，导致在美国潜伏30多年的金无怠身份曝光，由于俞强声的贡献，使整个中共在美国的间谍网几乎损失殆尽。金无怠曾希望中共以释放魏京生为交换条件其回国，遭拒绝后自杀。潘汉年生前说过：凡搞情报工作的，大多数都没有好下场。",
			"added": 1497439949
		},
		{
			"topic_id": 220,
			"title": "胡适先生评俄共：",
			"body": "俄共与纳粹是同一类政党，有严密组织，党员没有自由，有特务侦察机关监视人民的言论、思想和行动。“他们不惜用任何方式取得政权；既得政权之后不惜用任何方式巩固政权，霸住政权”。这类政权“绝对不承认，也不容许反对党存在。一切反对力量，都是反动，都必须彻底肃清铲除。”",
			"added": 1497543404
		},
		{
			"topic_id": 221,
			"title": "上访户报复杀村长一家四口 当局封锁消息不敢承认身份 200多警察抢尸",
			"body": "大陆再发生上访户怀疑不堪受压，采取极端行为报复官员的惨案，并且祸及妻儿。河南省周口市西华县一名村长一家四日前被杀，警方其后拘捕一名涉案的上访户。但官方为维稳而将凶案实情全面封锁，并出动大批特警抢走四名被害人的遗体。亦拒绝承认遇难者是村长的身份。",
			"added": 1497578114
		},
		{
			"topic_id": 227,
			"title": "共产共妻之延安乱象 不休元配扔孩子 都抬不起头来",
			"body": "1949年进城后，不少中共干部顶不住“糖衣炮弹”诱惑，蹬掉乡里原配，另娶地富女儿与城里资产小姐，号称“婚姻革命”。1953年，仅法院受理离婚案即达117万件...由于他们的行为，形成一种时兴的社会风气：凡是脱产在外边搞工作的男人，如若不跟农村里的媳妇闹离婚，就被视为落后、保守、封建脑瓜，就没脸见人，就在同志中间抬不起头来。",
			"added": 1497615771
		},
		{
			"topic_id": 239,
			"title": "华人男子入美国籍隐瞒共党身份，遭25万美元罚款。",
			"body": "",
			"added": 1497763698
		},
		{
			"topic_id": 253,
			"title": "他們決定先實現那血海",
			"body": "「他們相信天堂是有的，可以實現的，但在現世界與那天堂的中間卻隔着一座海，一座血污海，人類泅得過這血海，才能登彼岸，他們決定先實現那血海。」— 徐志摩\n1925年春，徐志摩遊莫斯科三天後發表於《晨報副刊》，當時中國的左翼力量為這篇文章放火燒《晨報》館。",
			"added": 1497938262
		},
		{
			"topic_id": 279,
			"title": "隐瞒了曾经是中共党员的事实，所以被控移民欺诈罪，",
			"body": "在美国归化入籍的中国男子林禄，被发现隐瞒了他曾经是中共党员的历史，因此被控移民欺诈，并且罪名成立。现在正面临最高5年徒刑以及25万美元（约合170万人民币）的罚款。\n据报道，林禄现年59岁，来自中国，已经入籍归化为美国公民。然而他被发现，在申请入籍的过程中，隐瞒了曾经是中共党员的事实，所以被控移民欺诈罪，而且罪名成立，现在正面临最高5年徒刑的惩罚，以及高达25万美元的处罚。",
			"added": 1498138927
		},
		{
			"topic_id": 291,
			"title": "王岐山说中国人一百年也开不了智，必须用皮鞭管理，此话代表了共产党人的世界观。",
			"body": "三年人为大饥荒，人相食，不准逃荒，不准开仓赈济，老百姓也不起来造反，所以陈云在遗训开首就讥讽：“中国人好管，饿死也不造反”；从此，中共看清了老百姓的奴性底牌。红二代最怕中国人开智，遂有金盾网络封墙。",
			"added": 1498274227
		},
		{
			"topic_id": 296,
			"title": "安邦成立之始",
			"body": "安邦成立之始，当时控股的原始股东是类似上汽这样的国有企业，但等到安邦进入快速发展和盈利周期之后，这些国企居然以低溢价退出，而没有享受到做大时的红利。这些国企在安邦风险最大时坚守，在摘果子时却毅然退出，将成果拱手相让给吴小晖，实在令人费解。\n\n很多国企充当了权贵家族的垫脚石。国企出钱搭平台，这个平台如果赚钱，国企就找理由退出，转让给权贵或其代理人；如果这个平台亏钱，亏的也是国家的，与权贵无关。",
			"added": 1498298426
		},
		{
			"topic_id": 298,
			"title": "“文革”时期也有潜规则",
			"body": "全公社的贫下中农推荐，就变成公社书记一人推荐。书记推荐谁，就看谁与书记关系最亲，就看谁的贿赂最有档次了。在能否上大学上，潜规则如此起作用，也是史无前例的。所以，“文革”期间，在上大学一事上，两种意义上的“史无前例”都有典型表现。若从性别上区分，则有男女之别。男知青要上大学，要以钱物通关，女知青则有时不免要献上身体。当然不只是上大学。下乡知青要上调回城，要请假回家，甚至仅仅是为免受刁难、欺侮，男也要献物，女也要献身。“文革”期间，被当地干部“潜规则”过的女知青，不知凡几。",
			"added": 1498302876
		},
		{
			"topic_id": 300,
			"title": "“我挑的不是山，是沉重的教育负担”",
			"body": "汪美红是一位挑山工。她每天挑着一两百斤的货物，走三千级台阶，共走了二十多万公里。自丈夫在十七年前死了之后，她就独自抚育三个子女成人，培养出两个大学生。受委屈的时候，就跑到丈夫坟上去哭。当人们在为她的坚强而感动时，她却愤怒了：“我挑的不是山，是沉重的教育负担”。",
			"added": 1498361376
		},
		{
			"topic_id": 301,
			"title": "【宁可认输！】",
			"body": "胡琏将军叹口气说：“当年我在沂蒙山区与共军作战，亲眼看见他们驱使老百姓带两手榴弹来冲锋；我守军用机枪扫射，眼见死的都是老百姓，自然不忍打下去，这时共军正规军就上来了。”我说：“这叫人海战术。”胡将军点头说：“我知道人海战术，但我们能用吗？我们宁可认输。”",
			"added": 1498362970
		},
		{
			"topic_id": 302,
			"title": "1776年7月4日，托马斯•杰斐逊起草的《独立宣言》在费城大陆会议上通过。",
			"body": "《独立宣言》开头就说：“在人类事务发展的过程中，当一个民族必须解除同另一个民族的联系，并按照自然法则和上帝的旨意，以独立平等的身份立于世界列国之林时，出于对人类舆论的尊重，必须把驱使他们独立的原因予以宣布。我们认为下述真理是不证自明的：人人生而平等，造物主赋予他们若干不可让与的权利，其中包括生存权、自由权和追求幸福的权利。为了保障这些权利，人们才在他们中间建立政府，而政府的正当权利，则是经被统治者同意授予的。任何形式的政府一旦对这些目标的实现起破坏作用时，人民便有权予以更换或废除，以建立一个新的政府……”在200余年的历史过程中，美国人民正是这样实践着他们的政治理念。",
			"added": 1498455716
		},
		{
			"topic_id": 308,
			"title": "美國學者薩爾克：“中國人的麻木冷血令世界震驚！”",
			"body": "",
			"added": 1498533067
		},
		{
			"topic_id": 314,
			"title": "有时候我根本不想回想我的祖国叫中国",
			"body": "有时候我根本不想回想我的祖国叫中国，不管它的经济多么强大，不管它的国际地位有多高，不管它的权力有多傲慢，只要有刘晓波这样的人存在，为了一篇文章，为了几十个字，可以失去自由这么长时间，这样的国家除了让我感觉羞耻，还有什么值得爱的地方呢！请你告诉我！！——何频（美国明镜集团总裁）",
			"added": 1498552669
		},
		{
			"topic_id": 317,
			"title": "敦请加拿大政府立即退出联合国人权理事会",
			"body": "中共政权这种连最基本的法治都没有的政权，居然能在人权理事会上提出“发展对享有所有人权的贡献”决议。\n\n这种闹剧可以收场了，纳税人的钱不是用来上演这种闹剧的。敦请加拿大政府立即退出联合国人权理事会。",
			"added": 1498584637
		},
		{
			"topic_id": 345,
			"title": "周永康下令在美国休斯敦杀人-休斯敦灭门案真相",
			"body": "早已在狱中服刑的中共前政治局高官周永康被曝出最新口供，称数年前发生的休斯顿灭门案来自于他的策划，不禁令外界释然的同时感到震惊。\n综合媒体7月1日报道，2014年1月底，即中国农历年的新年前夕，美国休斯敦西北社区一对中国移民夫妇和他们两个年仅9岁和7岁的儿子被发现惨遭杀害，4人头部均受到至少一次枪击，且陈尸家中不同房间多日。\n由于作案手法高超、行动隐蔽，致使案情扑朔迷离，当地警方一直未能获得有关犯罪嫌疑人和行凶武器的任何信息。\n据悉，案发地为当地高档住宅区，约有2,000户人家，风景优美，治安一向良好。由于案发当时没有人听到枪声，因此一直不为外界察觉。是男主人当年1月24日后一直没有正常到岗，引起公司同事注意并通知了警方。警方1月30日赶到其住宅，才发现了凶案现场。\n\n\n达到周永康这个级别的中共高官可谓个个罪行累累（图源：VCG）\n遇难的夫妇分别为50岁的工程师孙茂业和他49岁的妻子谢梅。\n如果不是周永康亲口对此案交代了策划经过，很可能这起震惊当地、并造成长期恐慌的灭门惨案永远迎不来被侦破的时刻。\n俄罗斯卫星网1日的报道称，孙茂业移民美国以前，在中石油工作多年，包括在周永康当领导时期。孙后来被派往美国购买石油开采和加工设备，这些任务的操作，使得他对周永康及其家人非法敛财的内幕有了一定了解。\n当中国的反腐运动开始触及到周永康这个层面时，周担心孙知道得太多于己不利，遂下令灭掉了孙及其全家。如今可以想见，正是来自中共顶级官员的命令，才能有极高的作案手段能让美国警方在侦破上束手无策。\n然而，虽然杀手做得天衣无缝，没有留下任何线索，但周永康在被判无期徒刑后，终于承认策划并实施了这起犯罪的事实。\n来源：多维新闻",
			"added": 1498886108
		},
		{
			"topic_id": 348,
			"title": "张育明：枪决赵紫阳父亲的大会 他装胃病不去参加",
			"body": "通过赵紫阳历史点滴 看共产党本质\n抗日战争初期，贺龙、吕振操、宋任穷等毛共头目从陕北过山西进入河北省，以西部太行山为根据地流窜冀中冀南大平原上，打着中央军第八路军旗号招兵买马，打劫城乡工商小康农家财产，还竟然配合日寇夹击或偷袭国民政府留在河北省境内的抗日军民鹿钟麟，张荫梧，丁树本等部队和政府机关，把河北省政府赶到洛阳城郊避难。时任黑北省教育厅长徐重远先生组织成立河北省流亡小学和中学以收养教育并培养落难青少年儿童。我就是1941年春被收留在流亡小学的学生之一。\n\n\n某日下午，邮差送给保定女师毕业的保定市国公街人蔡庆荣老师一封信，她一边读一边呼叫班敬先老师过来看看作为河南省滑县县长刘先生，她的丈夫写给她的信。这位刘县长在抗日战争前后在滑县一带领导地方武装支援抗日很有点名望，外号刘大麻子。我停止念书，静听班蔡二位老师说到，开封高中学生赵紫阳参加共产党，在豫北地区策反了好几百名地方民团青年参加了共产党八路军，河南省党部命令县长刘大麻子把赵紫阳逮捕起来送交洛阳河南省政府。刘县长令其通信员以找作为老中医的赵紫阳之父看病为名，通知赵紫阳逃出家门，如此救了赵紫阳一命。\n\n笔者1954年六年制大学医学本科毕业后由中央卫生部分配到河南医学院工作。真是无巧不成书，有一个南下老干部张科长是我们保定老乡，在赵紫阳家乡土改时，他是土改工作队队长。老张科长亲口对我说，他对土改运动中，利用当地所谓贫下中农积极份子，实际上都是不务正业，农村摔大娃（保定土话即不好好劳动又不安分守己的人）的流氓无赖任意吊打烧烤所谓地主分子，我实在受不了，干不下去。县委又派一个正队长，把他降为副队长，他才勉强干下来了。\n\n他举了一个例子，赵紫阳的父亲是一个很谦和的老头儿，是个老中医，又是教了一辈子书的私塾先生，一辈子一年四季都劳动，每天早晨起来背着粪篓到大街上拾大粪，还拿着本儿书念，工作队一再发动群众，但确实一点民愤都没有，真是一个和善对人的好老汉。\n\n但是县委硬是命令农村必须村村见血，要杀人口的百分之一，土地最多的地主就是无罪恶无民愤者也要杀，说这是为了推动革命，制造阶级仇恨，文件中还介绍党的中央委员陈郁亲手开枪把他的父亲枪毙了，共产党员都要向陈郁学习。\n\n枪决赵紫阳父亲的大会，他装胃病不去参加，要他签字，他说正队长一个人签字就可以了，批斗现场打死那么多人，有谁签字了？自从土改镇压以后，老张科长说他的心算寒透了，再也积极不起来了。",
			"added": 1498972857
		},
		{
			"topic_id": 357,
			"title": "美移民局：共产党员和拥共者都不能入籍",
			"body": "一名叫林禄的伊利诺州男子未披露他曾经加入中共以及为中共情报部门工作的历史，被控移民欺诈，被判一天监禁，罚款2万美元。此事引起许多大陆来美人士的关注。 美国移民局官员告诉大纪元，共产党员不能入境美国，不能成为美国公民，但是可以请求豁免。移民官员还说，倡导共产主义的人也不能入籍。 林禄是否将被剥夺公民身份？",
			"added": 1499052029
		},
		{
			"topic_id": 362,
			"title": "施剑翘为父报仇",
			"body": "脂肪女人：“天津有个泰安道，里面住着孙传芳。孙传芳杀害了军长施从滨，施从滨只有一个养女施剑翘。施剑翘决意为养父复仇，听说孙在天津，便携幼子前来，终于在居士林将孙传芳一枪毙命。当时佛堂大乱，施剑翘大喊为父报仇与各位无碍——施剑翘太狭隘了，共产党人的襟怀就不同，你们看刘源林豆豆。”",
			"added": 1499062960
		},
		{
			"topic_id": 376,
			"title": "美国独立宣言的故事",
			"body": "7月4日是美国独立纪念日，也是美国241岁的生日。1776年7月4号，北美13个英属殖民地发表独立宣言，正式宣告从英国独立。在美国生日这天，我们来认识美国最重要的立国文件之一：独立宣言。\n\n1760到1770年之间，英属北美13个殖民地和宗主国英国之间的关系越来越紧张，1775年，双方终于爆发列克星敦和康科德战役（Battles of Lexington and Concord），在北美殖民地于1776年7月4号宣告从英国独立时，北美殖民地和英国之间已进行了一年多的战斗。\n\n到了1776年，独立之声已经响彻云霄。约翰·亚当斯是推动独立的主要领导者之一。1776年6月11号，北美殖民地立法机构大陆会议任命“五人委员会”（Committee of Five）起草一份宣告殖民地决定独立的文件。这五人包括约翰·亚当斯（John Adams）、本杰明·富兰克林（Benjamin Franklin）、托马斯·杰弗逊（Thomas Jefferson）、罗伯特·李文斯顿（Robert Livingston），和罗杰·谢尔曼（Roger Sherman）。五人小组决定让当时32岁的杰佛逊起草独立宣言，后来再由小组成员对其进行修改。五人小组于1776年6月28日把独立宣言呈交给大陆议会。\n\n接下来几天，北美13个殖民地的代表对宣言草案进行激烈的辩论，大陆会议代表于7月2号投票通过独立的决议。在独立决议通过后，殖民地代表再对独立宣言的内容做最后的修改与辩论，于7月4日正式批准宣言内容，并在当天送到印刷厂印制，该宣言在接下来几天传遍了13个殖民地。7月8日，费城敲响了一口钟，召集居民来聆听独立宣言首次对公众的正式宣读。这口钟就是后来举世闻名的自由钟。\n\n目前独立宣言原件存放在美国国家档案馆圆顶大厅，供来自全世界的游客观赏。不过由于19世纪的保存技术拙劣，独立宣言上的字迹和签名已经相当模糊。今天这份文字清晰，一再被复制的样本是来自1823年威廉·斯通印刷厂的模具。\n\n每年，国家档案馆会在7月4日当天在档案馆前举办庆祝活动，请特别来宾和演员宣读独立宣言全文。\n\n独立宣言本身并没有分章节，但是现在一般学者把它分成五个部分。在前言中，殖民地代表表示，当一个民族必须解除其和另一个民族之间的政治联系，取得独立和平等的地位时，出于对人类公意的尊重，必须宣布他们不得不独立的原因。独立宣言内容最著名的文字在于序文部分：\n\n“我们认为下述真理是不言而喻的：人人生而平等，造物主赋予他们若干不可剥夺的权利，其中包括生存权、自由权和追求幸福的权利。为了保障这些权利，人们在他们之间建立政府。政府的正当权力是经由被统治者同意授予。任何形式的政府，一旦破坏上述目的，人民就有权改变或废除它，建立新政府；新政府所依据的原则和组织其权力的方式，都要最大可能地增进民众的安全和幸福。”\n\n殖民地代表在独立宣言的第三部分中列举英王乔治三世对殖民地人民权利和福祉犯下的二十多条罪状，第四部分是对英国的谴责，第五部分是总结，在这部分，殖民地代表正式庄严地宣布这些殖民地成为一个自由和独立的国家。\n\n独立宣言的最下方有56名代表的签名，第一个签名的，也是宣言上最明显的签名是大陆会议主席约翰·汉考克（John Hancock），另外著名的签名者还有美国开国元勋本杰明·富兰克林以及两名未来的美国总统托马斯·杰弗逊和约翰·亚当斯。\n\n过去两百多年来，研究独立宣言的学者不可胜数，不过独立宣言仍然有一些尚未破解的迷。比方说，在独立宣言左下方有一个相当明显的手印。这个手印究竟是谁的呢？是不是在1776年夏天时时，一位开国元勋在炙热的天气下签名时所留下的手印？还是印刷工人或其他接触过这份文件的人所留下的呢？这样的迷我们恐怕永远都无法得到答案了。\n\n来源：美国之音\n作者：张佩芝",
			"added": 1499180062
		},
		{
			"topic_id": 383,
			"title": "5亿美元贷款不知去向",
			"body": "问：昨天，斯里兰卡一名政府官员表示，斯里兰卡政府账目中由中方提供的用于汉班托塔港建设的5亿美元贷款消失了，目前不知道这笔钱的去向。能否告知中国政府提供的汉班托塔港项目贷款总额是多少？是14亿美元还是9亿美元？中方是否与斯方就不知去向的这5亿美元进行沟通？\n答：你提到的情况我不掌握，你可以向有关部门或企业了解。\n我能告诉你的是，汉班托塔港项目是由中方企业按照市场规则同斯方商谈并且开展的。近年来，中斯各领域务实合作不断深化，中方始终本着相互尊重、平等相待的原则，为斯基础设施建设提供贷款等力所能及的帮助，努力促进斯经济社会发展。",
			"added": 1499269101
		},
		{
			"topic_id": 400,
			"title": "爷爷省下馒头给他吃了，爷爷却活活被饿死",
			"body": "【天涯】我爷爷也是在1959年去世的。我爸爸说爷爷在最后一次住院回家时，给他带了馒头。那个馒头是医院里住院发的，爷爷舍不得吃，就带回家给爸爸。爸爸说，那个馒头的味道他这一辈子都没有忘记过，那成为他童年珍贵的回忆，并且也为此痛苦一生（爷爷省下馒头给他吃了，爷爷却活活被饿死）。",
			"added": 1499432626
		},
		{
			"topic_id": 431,
			"title": "据郭文贵透露，王岐山持有111套物业价值约3000万美元。",
			"body": "据郭文贵透露，王岐山自20世纪80年代后期以来一直秘密投资加州房地产，其持有的111套物业的价格，已经从购买时的3000万美元涨到了约20亿至30亿美元。\n\n郭文贵表示，他计划下周通过视频详细说明王岐山在美国投资的房产情况。这些房产包括位于华盛顿、东边的Bethesda、加利福尼亚州的洛杉矶、圣何塞、Cupertino、桑尼维尔、帕洛阿尔托、圣卡洛斯和旧金山住宅和公寓。该视频还将展示王岐山家族成员在加利福尼亚州萨拉托加拥有的一系列豪宅，这些豪宅的购买总价为1200万美元，今天的价值约3000万美元。",
			"added": 1499848215
		},
		{
			"topic_id": 434,
			"title": "土改杀地主，没有任何标准。每个村子都要杀，“户户冒烟，村村见红”。",
			"body": "当年杀地主是用枪顶着后脑勺，从背后斜着向上开枪。一声枪响，天灵盖便被打飞了，红色的鲜血、白色的脑髓，撒满一地。目睹者不由自主地浑身颤栗，二百多万地主人头落地，杀多了，吓怕了，反抗者都缩头了，中国的农民从此服服帖帖。",
			"added": 1499848674
		},
		{
			"topic_id": 435,
			"title": "1989年12月21日，齊奧塞斯庫對十萬人發表演說，",
			"body": "1989年12月21日，齊奧塞斯庫對十萬人發表演說，就在他口沫横飛之際，角落中突然響起噓聲。嘘聲之後是片刻的静默，静默之後即是十萬人的怒吼和攘袂而起的手臂。四天後，獨裁政府倒台，獨裁者身死刑塲。無人知道是誰發出的噓声，他也許不是勇士，但他的嘘聲改變了世界。",
			"added": 1499848792
		},
		{
			"topic_id": 439,
			"title": "顾维钧笑道：“贵党何时不是非常时期？”",
			"body": "1972年9月，出席第二十七届联大的章含之受毛泽东委托前来拜访顾维钧。顾维钧时年已85岁，但神智爽睿。当顾维钧得知毛邀其归国之意后，慨然回问：“我是毛点名的战犯，回去批判我吗？”章含之忙答：“那是非常时期。”顾维钧笑道：“贵党何时不是非常时期？”",
			"added": 1499869590
		},
		{
			"topic_id": 453,
			"title": "【笑不出来的笑话：】",
			"body": "饭局碰一法官，\n忍不住问他：“经常看到判决书说谁谁判刑几年，剥夺政治权利几年，是啥意思？”\n解释道：“剥夺政治权利就是剥夺人犯的选举权和被选举权，还有言论、出版、结社、集会、游行、示威的权利”\n当时俺就把酒喷了，\n我说：“法官，你本人有这些权利吗？”\n法官想了想说：我也没有！",
			"added": 1499962605
		},
		{
			"topic_id": 460,
			"title": "是中国人群结出的恶果",
			"body": "都会骂中国共产党是全世界最邪恶的组织，就好象这是一个真空组织一样，但你要强调这是中国人组成的组织，都特么没声音了，不是这个组织本身邪恶，这是中国人群结出的恶果，每一个中国人都是罪恶。",
			"added": 1500051766
		},
		{
			"topic_id": 468,
			"title": "让你见识一下流氓嘴脸",
			"body": "6月30日，中共外交部发言人说：1984年签署的【中英联合声明】已成历史文件，不再具有现实意义。\n7月13日，中共外交部发言人说：1943年签署的【开罗宣言】具有重要现实意义。",
			"added": 1500195928
		},
		{
			"topic_id": 487,
			"title": "亲历中共土改 五大酷刑尤以性酷刑惨不忍睹",
			"body": "当天要斗争的女地主被押解到会场之后，禽兽不如的刽子手们首先扒光其衣服，把她们调戏够之后，然后开始行刑。有的割掉乳房，有的割掉耳朵，有的豁开嘴巴，更有甚者，记得是堤口村的一例，竟往女同胞的阴道里塞玉米芯，直至折磨至死，其娘家就是我们镇东关的胡姓。上世纪九十年代的一天，和一个大我九岁的郭老太太聊天谈起土改之事时，她说，我见过割乳房，太可怕啦!",
			"added": 1500393092
		},
		{
			"topic_id": 492,
			"title": "关于将中国指定为汇率操纵国的总统令已准备好",
			"body": "美国经济学家裘蒂．谢尔顿，他负责川普政权交接团队中的货币政策，他表示关于将中国指定为汇率操纵国的总统令已准备好，但川普还没有签发。",
			"added": 1500484439
		},
		{
			"topic_id": 501,
			"title": "【红灯记原型真相】",
			"body": "李玉和原型是海伦车站党支书胡起，北京人，1926年入党。27年与妻被党派遣到哈尔滨工作。34年6月因叛徒出卖以反满抗日罪判刑10年，41年提前出狱。45年任中共阿城县长。50年任锦州铁路局长、大连铁道学院长。文革遭迫害，67年5月14日被红卫兵打成重伤后从6楼扔下活活摔死。 ​​​",
			"added": 1500557340
		},
		{
			"topic_id": 545,
			"title": "知青小红，习的初恋。",
			"body": "习发现怀孕后吓得躲回北京，小红挺着肚子上京寻夫，未果。回到陕西由习的老友73接应产下呈杰。再和73日久生情，80年又生贯军。此后，习王结盟，联手篡权，历经三十余载取得红色江山。习集皇权，王执党鞭，恩威并用窃国，窃官，窃民。终成窃国大业！",
			"added": 1501209945
		},
		{
			"topic_id": 546,
			"title": "1969年习下乡到陕北延川梁家河，第一家房东的女儿刘金莲。",
			"body": "习1975年才离开梁家河。刘呈杰应该是习和刘金莲的孩子，想办法弄到刘金莲的DNA,如果确认是刘金莲，全社会的黑社会都要去绑这个富婆了，不怕刘呈杰不付赎金！",
			"added": 1501210078
		},
		{
			"topic_id": 557,
			"title": "謝里夫總理表示：我沒貪污巴基斯坦人民一分錢，這些都是中國政府贈送的。",
			"body": "據路透社消息，巴基斯坦最高法院宣布，取消總理納瓦茲•謝里夫的任職資格。調查小組表示，謝里夫家庭無法解釋巨額資產來源。謝里夫已經接受法院裁決。\n謝里夫總理表示：我沒貪污巴基斯坦人民一分錢，這些都是中國政府贈送的。",
			"added": 1501440664
		},
		{
			"topic_id": 559,
			"title": "【中国承诺雇佣菲律宾保姆月薪1.3万元】",
			"body": "菲律宾劳动就业部昨天发布一份报告称，中国打算聘请菲律宾家政服务人员前往中国5个大城市就业，并承诺给予这些菲佣的月薪不低于1.3万元人民币。",
			"added": 1501500447
		},
		{
			"topic_id": 561,
			"title": "一百年前一位西方哲人对中国人的评价",
			"body": "中国人最缺乏的不是智慧，而是勇气、正直、和纯正的品性。这个评价，虽历经百年，如今依旧诊断出中国的综合症结。\n————孙海英",
			"added": 1501501600
		},
		{
			"topic_id": 563,
			"title": "1949年底毛泽东访苏，苏联外长维辛斯基向毛提出：",
			"body": "将在苏联境内拘留的一批在中国作恶多端的日本战俘由中国政府接收过去审判。对此毛明确表示：目前中国人民的主要仇恨集中在内战罪犯方面，如果先期审讯日满战犯，不审讯内战罪犯，则有不足之处。后中国决定对绝大多数日军战犯免予起诉，即行释放。",
			"added": 1501558302
		},
		{
			"topic_id": 569,
			"title": "习近平指示：谁反对习近平就按反革命罪论处",
			"body": "京西宾馆“光板桌”会议内容：\n1.不惜代价“保护”处于风口浪尖的高层领导\n2.不惜代价“清洗”党内异议人士\n3.不惜代价“应对”内外压力 \n4.不惜代价“镇压”19大前后一切不安定因素😈凡与中央对抗者，无论职位和政绩，均按反革命罪论处😈习放下狠话，然后去内蒙看“月饼”了。",
			"added": 1501637016
		},
		{
			"topic_id": 574,
			"title": "刘家驹指责中共篡改党史军史",
			"body": "中国军旅作家、曾长期担任『炎黄春秋』副主编、有“董狐笔”之称的刘家驹临终留下『千字留言』，指责中共篡改党史军史，“我曾渴望领导人中有良知者会向国人作出深刻的忏悔，可叹的是由期望、失望变成绝望”。",
			"added": 1501652199
		},
		{
			"topic_id": 582,
			"title": "微博“奉旨删帖” 在美遭集体诉讼",
			"body": "日前，美国两家律师事务所宣布，他们已经代表在2017年4月27日至6月22日购买微博公司股票的股东，向美国加州北区地方法院提起集体诉讼，指控微博违反了联邦证券法，该消息引发网友热议。有网民认为：“确实应该告……不能一边拿美国人的钱，一边搞独裁。”",
			"added": 1501810229
		},
		{
			"topic_id": 585,
			"title": "菲律宾和夏威夷都曾是美国的托管国，期间都有要求独立。",
			"body": "1946年美国帮助菲律宾举行独立公投，独立派以绝对优势胜出，菲律宾共和国成立。1959年夏威夷独立公投，多数选择加入美联邦，成为美国第五十个州，夏威夷“亡国”，百姓上街庆祝成为美国公民，放弃了“当家做主”的机会，成了“亡国奴”。",
			"added": 1501814181
		},
		{
			"topic_id": 591,
			"title": "四川大竹一村官遭枪手射杀，身中数十粒火药枪弹毙命，",
			"body": "四川大竹一村官遭枪手射杀，身中数十粒火药枪弹毙命，满身的弹孔令人毛骨悚然。进入2017年，匪共村官被杀已经好多起了，官民的矛盾已经上升到仇恨的地步了。",
			"added": 1501852278
		},
		{
			"topic_id": 594,
			"title": "1947年4月，刘少奇到晋察冀搞土改、斗地主，主张必须死人，",
			"body": "刘少奇说：“要以复查为中心，动员党政军民的力量搞个彻底，所谓搞彻底就是要死一些人，搞彻底了，负担重些，农民也甘心，扩兵也容易。”\n李子佛 @lizife\n@张鸣：当年刘少奇主持土改，地主要求主动交出土地换条命，不允许，非得经过斗争斗死了算。文革来了，刘也曾要求裸退回乡务农，但也不行，非斗死不可。刘在延安时期打造了毛和毛思想的无上权威，但，到了文革，他却被自…",
			"added": 1501924295
		},
		{
			"topic_id": 600,
			"title": "不管是习家、王家、邓家、李家等等，他们一整个盗氏集团，",
			"body": "不管是习家、王家、邓家、李家等等，他们一整个盗氏集团，相信他们比我们这些普通百姓更恐懼，因为他们已经没有了未来，中共如果倒了，他们的災難也就来了，相信就算去了火星也会把他们掏回來，他们唯一的就是暗藏自己的私生子，改姓更名，希望今后不被发现，未来政府会花很大的人力去挖他们⋯。",
			"added": 1502015329
		},
		{
			"topic_id": 613,
			"title": "当年在美帝的某一天。有人问亚伯拉罕·林肯，“做个政治家要有什么条件。”",
			"body": "亚伯拉罕·林肯回答说：“政治家要有出奇的记忆力，能够背诵古今中外的文学思想名著书单，very悠长，You know。”那个人又问：“假如没有这么好的记忆力，那怎么办？”亚伯拉罕·林肯说：“那肯定有提词器啊，傻逼！上面连拼音都能跟你准备好。”那个人再问：“那如果还是读错拼音呢？”亚伯拉罕·林肯坦然回答：“那就需要有一个强健的体魄，能够扛二百斤麦子走十里山路不换肩啊。大傻逼！”",
			"added": 1502164550
		},
		{
			"topic_id": 628,
			"title": "李源朝表弟全家出逃到德国",
			"body": "",
			"added": 1502451340
		},
		{
			"topic_id": 630,
			"title": "好讽刺",
			"body": "1951年，\n出生于河南农村的崔琦，\n被母亲送往香港求学，\n父亲在59年饿死，\n母亲背负里通外国的罪名，\n在68年贫病而亡。\n崔琦母亲去世时，\n其姐姐欲借铁锹一把埋葬母亲，\n磕头下跪求遍全村，\n却无一人肯借\n……\n而98年崔琦获诺贝尔物理学奖后，\n当地大张旗鼓地搞起了崔琦故居，\n并命名为爱国主义教育基地，\n邀请崔琦回国。\n崔琦表示：\n活着一步也不踏上故乡的土地。",
			"added": 1502468871
		},
		{
			"topic_id": 637,
			"title": "这是100多年前的一段话：",
			"body": "中国人忍受能力超绝，一切来自权力者、权威的打压，他们都默默忍受，成为故旧体系的良民。权力者只要给他们一丁点儿的光，他们便心满意足。他们乐天知命，不容易激动，象驼鸟一样轻而易举就消解苦难。中国人不缺智慧，不缺纯良、忍耐、务实和乐天的性格，他们真正缺少的是独立的人格和天然的良知。——雅瑟·亨·史密斯《中国人的性格》",
			"added": 1502546851
		},
		{
			"topic_id": 638,
			"title": "有時候我覺得，關於達賴喇嘛轉世是否延續，我完全都不在乎了！",
			"body": "但是北京的強硬派比我更加在乎。有時候我會開玩笑說，為了表示對達賴喇嘛轉世的重視，他們也應該也接受轉世的理論，首先應該找到毛澤東的轉世、鄧小平的轉世，然後才可以置喙達賴喇嘛的轉世，否則，相當好笑。 --十四世達賴喇嘛",
			"added": 1502559465
		},
		{
			"topic_id": 645,
			"title": "【铁丝穿掌】",
			"body": "文化大革命中，湖南省零陵县接履村张美银，因为家庭出身地主，其兄张迪光被用铁丝穿过手掌，拖往山上杀害。她向民间记录者恸诉：“你要把它写下来，你就是我的恩人！”。",
			"added": 1502677434
		},
		{
			"topic_id": 648,
			"title": "五月花号公约，1620年11月11日。",
			"body": "“……我们在上帝面前共同立誓签约，自愿结为一民众自治团体。为了使上述目的能得到更好地实施、维护和发展，将来不时依此而制定颁布的被认为是对这个殖民地全体人民都最适合、最方便的法律、法规、条令、宪章和公职，我们都保证遵守和服从。”————五月花号公约，1620年11月11日。",
			"added": 1502699637
		},
		{
			"topic_id": 651,
			"title": "毛是当时中国第一富翁",
			"body": "毛死后私人存折存款1.72亿元，当时被中央封存，数年后解凍，一半上交党费，一半由家属分配，即毛新宇及其女儿们分得八千六佰万人民币(注意是八十年代的钱)。所以北京市著名收藏家馬未都称毛是当时中国第一富翁。",
			"added": 1502769713
		},
		{
			"topic_id": 652,
			"title": "毛死后清点他的遗物时发现有线装书十五万册 皆是文革中从四类分子抄家中搜出的",
			"body": "毛死后清点他的遗物时发现有线装书十五万册，各式碑帖七干余件。皆是文革中从四类分子抄家中搜出的精品，专程送到北京康生处，由康送给毛、周、陳伯达等选留，工作人员说周一件未留，毛留最多。",
			"added": 1502769805
		},
		{
			"topic_id": 654,
			"title": "四名经常参与中国大使馆组织示威的华人持绿卡返美被遣返",
			"body": "美国华人社区近半个月爆4起有犯罪记录、持绿卡在美机场被原机遣返回中国的案例。这四名华人均为福建籍，在美持绿卡居住多年且有犯罪前科，从中国返回入境美时被海关拦阻。随后被送上飞机直接遣返回国。",
			"added": 1502783873
		},
		{
			"topic_id": 656,
			"title": "免签证国家",
			"body": "多米尼加除了对古巴、中国之外，对所有国家都免签；\n海地，除了禁止持古巴、哥伦比亚、中国普通护照者入境，对其他所有国家免签；\n圣文森特和格林纳丁斯，只对中国、多米尼加、伊朗、伊拉克等八个国家要求签证，其他都免签；\n像密克罗尼西亚就更加神奇了，似乎地球上就没有它不免签的国家，但对中国普通护照就是不免签。",
			"added": 1502784240
		},
		{
			"topic_id": 657,
			"title": "印尼反共，周恩来说，",
			"body": "“你们凭什么反我们，我们华人几百万，分分钟搞定你们”。原话大题是这个意思。结果变成反华。。。华人惨啊。。",
			"added": 1502786724
		},
		{
			"topic_id": 659,
			"title": "人民要是知道历史的真相，他们就会上街推翻这个政权！",
			"body": "中共把党史作为顶级机密封存起来，入党史馆的人不得携带纸笔。据说胡耀邦看了党史后曾拍桌大骂：人民要是知道历史的真相，他们就会上街推翻这个政权！",
			"added": 1502817645
		},
		{
			"topic_id": 664,
			"title": "有一名在纽约华社十分活跃并还担任某闽籍同乡会会长的郑姓男子",
			"body": "来美几十年，且拥有合法身份。但在4月底从福建办完生意上的事情飞回纽约入境时，被移民官员查出案底后当场被拒入境，之后他被送上飞机，直接被送回了中国。",
			"added": 1502942616
		},
		{
			"topic_id": 668,
			"title": "外国留学生来江苏学习每年可获得5万至9万元",
			"body": "江西14岁邓伟强因自家拿不出2000元借读费无法就学，于是他喊了一声：“我恨你们，我恨所有人！”跳水身亡，邓母也绝望自杀。\n江苏省教育厅日前发布《留学（微博）江苏行动计划》外国留学生来江苏学习每年可获得5万至9万元政府资助！",
			"added": 1502969084
		},
		{
			"topic_id": 670,
			"title": "【毛魔一生僅幹過3件好事】",
			"body": "1，他死了。2，他把他兒子弄死了。3，他把他那堆王八蛋戰友整個半死。",
			"added": 1503022143
		},
		{
			"topic_id": 671,
			"title": "【中共官员在澳大利亚的私生子们的爱国情怀】",
			"body": "为了抗议印度入侵中国边境，盗国贼在澳大利亚的私生子们组织了一场声势浩大的抗议游行，他们驾驶各色豪车巡游悉尼街头。车身均贴有五星红旗，配以中英文标语「犯我中华者虽远必诛」。组织者称此举：意义非凡，不为炫富。",
			"added": 1503022278
		},
		{
			"topic_id": 672,
			"title": "重庆永川区，一个开奥迪的26岁女子，",
			"body": "重庆永川区，一个开奥迪的26岁女子，与出租车剐蹭，交警判定女士全责，女士不服，晚上找人把出租司机打了，并找领导疏通。第二天到交警队处理，改为出租全责，司机发怒，当场手刃交警一名，并砍了女士40多刀，女士第二天毙命，司机被抓。",
			"added": 1503033709
		},
		{
			"topic_id": 674,
			"title": "陈独秀语",
			"body": "两千年官本位、权力本位的制度，塑造出了中国人的道德堕落：“外人之讥评吾族，而实为吾人不能不俯首承认者，曰“好利无耻”，曰“老大病夫”，曰“不洁如豕”，曰“游民乞丐国”，曰“贿赂为华人通病”，曰“官吏国”，曰“豚尾客”，曰“黄金崇拜”，曰“工于诈伪”，曰“服权力不服公理”，曰“放纵卑劣”：凡此种种，无一而非亡国灭种之资格”（陈独秀语）。",
			"added": 1503052300
		},
		{
			"topic_id": 675,
			"title": "多行不义必自毙，这就是共匪作恶多端的下场。",
			"body": "2013年12月29日下午4时30分许，深圳龙岗区横岗街道六约社区城管队长陈锦文在柜员机取钱时，遭到3人追砍。陈锦文全身有12处刀伤，其中左腿3刀、右腿4刀，右腿跟腱完全断裂，鼻子被砍掉成为哈密蚩。",
			"added": 1503052951
		},
		{
			"topic_id": 676,
			"title": "据原中共领袖王明披露，毛曾向王当面表态：",
			"body": "反正我们不能战胜日本人，为什么要和他们打仗呢？最好联日联汪打蒋介石。你看蒋在西南、西北还剩下那么多的地盘，如果打败了蒋，我们就能在西北得到一块地盘，那就算获得暴利了！我知道，你会说我执行亲日民族叛卖路线。我不怕。我不怕当民族叛徒！",
			"added": 1503121241
		},
		{
			"topic_id": 686,
			"title": "中国每年用“100亿美元推动外宣攻势”！",
			"body": "中宣部长刘奇葆澳洲之行的成果：英文版《中国日报》可以在象征言论自由堡垒的《悉尼晨锋报》上刊登副刊。之前中宣部与美国《华盛顿邮报》、英国《每日电讯报》和法国《费加罗报》也签署过相似的合约。",
			"added": 1503193917
		},
		{
			"topic_id": 691,
			"title": "副总理谷牧家族企业---1990年香江集团在深圳创业",
			"body": "“金海马商城”是国内家居电商第一平台。产业覆盖商贸物流、工业、健康产业、金融投资、教育产业、开发建设等几大领域。 1996年香江集团成为最早涉足金融业的民营企业，是广发银行、广发证券、广发基金、广东南粤银行、天津银行的主要股东钟小文 added,",
			"added": 1503278570
		},
		{
			"topic_id": 692,
			"title": "低端人沒錯呀！",
			"body": "1. 君主立憲不要\n2. 北洋聯邦不要\n3. 民國日中聯盟不要\n4. 蔣朝聯美不要\n5. 選了蘇聯共產黨\n這些低端人口是，該，該，該，該死 !",
			"added": 1503278665
		},
		{
			"topic_id": 695,
			"title": "江苏社科院的沈立人老人说：",
			"body": "他内弟是台湾的公务员，原来是坚定的统一派，十年前来大陆旅游，住在敦煌宾馆。一夜被赶出，说是要招待贵客，原来是某市长要来游览了。第二天看到来者阵容庞大，警车开路，沿途戒严。他对我说，回去再也不鼓吹统一了，不如维持现状，什么时候大陆实行民主法治后再说.",
			"added": 1503293636
		},
		{
			"topic_id": 701,
			"title": "少了市委书记这么多天没事",
			"body": "广州市委书记一职空缺41天，昆明市委书记一职空缺26天，三亚市委书记一职空缺超过7个月。目前，三市均运转正常。。。少了市委书记这么多天没事，要是少了环卫工三天城市就会腐烂发臭！因此，我觉得市委书记的作用远不及环卫工，你们认为呢？",
			"added": 1503410237
		},
		{
			"topic_id": 707,
			"title": "毛泽东等人到延安不久，就开始了第一轮换妻潮。",
			"body": "毛首先停妻再娶，抛弃贺子珍跟江青搞在一起；黄克功求婚不成，竟枪杀了年仅16岁的女学生刘茜，而且事后还大言不惭地反诬〝刘氏狼心恶毒，玩弄革命军人!〞邓力群趁李锐在延安整风时挨整之际趁虚而入，睡了其妻范元甄。这些都是当时延安流行的一种风气。",
			"added": 1503502626
		},
		{
			"topic_id": 708,
			"title": "日本",
			"body": "一位在日本的外国留学生生病了， 病的很重， 去医院看医生； 说自己没有钱， 能否开点简单便宜的药？ 日本医生说， “ 有没有钱是你的事， 治病救人是我的事；” 医院硬是把学生留下， 给他治好了病。",
			"added": 1503587973
		},
		{
			"topic_id": 709,
			"title": "四人帮倒台后，邓颖超急忙向华国锋提出要整理周恩来文件的要求。",
			"body": "她把周恩来在文革中所批示的文稿调来，经她过目之后监督烧毁，一如61年周焚烧大饥荒文字材料。这位与丈夫心心相印走过革命江湖的大脚老太太，十分清楚丈夫的作为经受不起历史的检验，若是留着白纸黑字的文件只是自取其辱。",
			"added": 1503848740
		},
		{
			"topic_id": 714,
			"title": "绘画天才乎？洗钱天才乎？",
			"body": "“中国脊梁”倪萍，在美国购买的已为公众所知的2套别墅，共计498万美金，约折合人民币3000多万，这么多资金，她是如何顺利转移到美国的？我们可以通过一个细节，略见端倪。倪萍学画五年，在国外举办画展，一幅蹩脚画可以卖500万，是谁在买？难怪有人惊呼：绘画天才乎？洗钱天才乎？",
			"added": 1503939266
		},
		{
			"topic_id": 724,
			"title": "歷史上的今天：",
			"body": "重慶談判，毛很害怕去，但斯大林來電堅持要毛去，他不敢不遵命，中貢許多要人回憶錄都提到當時延安各大員送毛上飛機時悲催氣氛，都估計蔣會軟禁毛。 1945年8月28日那天他剛剛出飛機，一露面就聲嘶力竭的一聲：蔣委員長萬歲！ （文聯主席夏衍回憶：他當眾高呼蔣介石萬歲，在場人都大吃一驚！）",
			"added": 1503997524
		},
		{
			"topic_id": 725,
			"title": "李光耀预言",
			"body": "邓访新加坡，看到修建一条河，需2年完工，邓说，在中国修建一条人工河只需8个月，我们年可动员十万民工，李光耀问每个工人多少报酬，邓说中国人觉悟高，只要说国家建设，就可不用任何劳动成本，李后来对里根说，邓的经济不考虑人的因素，中国经济改革只会让人民更苦，官僚更富！",
			"added": 1504022123
		},
		{
			"topic_id": 727,
			"title": "周恩來下令，封鎖口岸。",
			"body": "1962年6月1日，廣東百姓已在大饑荒中餓得奄奄一息，當時寶安縣要求省委放開到香港的口岸。陶鑄瞞著中央，默許了這一政策，並下令邊境警衛撤離，開放邊境，放一條生路給饑民。香港方面也以英女皇生日為由，特赦所有偷渡客。實施僅三天，幾十萬人滙集寶安，震動中央，周恩來下令，封鎖口岸。",
			"added": 1504022277
		},
		{
			"topic_id": 728,
			"title": "蔣中正退守台灣前，談到知識分子被蠱惑，農民阶階被煽動的時候，留下一句未卜先知之語：",
			"body": "他們不下十八層地獄不會覺醒，遲早會看到報應。——這句話應驗了半個多世紀，至今還在繼續應驗著。",
			"added": 1504055847
		},
		{
			"topic_id": 729,
			"title": "习先生可曾于日理万机之余，拨冗与身边人亲口讲过：",
			"body": "“再有那年那事儿（指8964），我就杀他五千万，到时连眼睛都不眨一下”？这是中共太子党联动西纠红卫兵薄熙来习近平宋彬彬等人的本性。",
			"added": 1504144519
		},
		{
			"topic_id": 730,
			"title": "巴拿马文件指出：",
			"body": "李小琳为不让承办律师行知道其为李鹏之女，便以香港护照进行背景审查。 李小琳与丈夫刘智源于欧洲小国列支敦士登成立名为“Fondation Silo”基金，为一间于英属处女岛开立的“Cofic Investments”有限公司单一股东。",
			"added": 1504158717
		},
		{
			"topic_id": 738,
			"title": "习近平上台以来各地敢于亮剑，频频亮剑。",
			"body": "《河南改造新农村》强拆民房，致两父子死亡 。北京昌平区强拆，当事人遭碾当场死亡。浙江温岭城管打死卖菜老人。",
			"added": 1504373017
		},
		{
			"topic_id": 747,
			"title": "都是跳楼自杀，蹊跷吧？",
			"body": "一个叫李保春，上海二军医大附属长海医院肾移植专家，07年44岁从医院大楼12层跳楼自杀；另一个黎磊石，南京军区总医院副院长、工程院院士、肾移植专家，10年84岁从自家14层跳楼自杀。都是军医，也都是肾移植专家，又都是跳楼自杀，蹊跷吧？",
			"added": 1504536667
		},
		{
			"topic_id": 748,
			"title": "我在北大校门口看到三个警察追着一位60多岁的上访老妇用警棍暴打。",
			"body": "老妇被打得大吐鲜血、大喊救命！当时在场的上千名学生、教授，竟然没人理睬！看到这场景，我上前阻止，警察指我骂道：洋鬼子，敢管闲事，连你一起打！那一刻我后悔了，我竟然来这样一个麻木变态的国家做访问学者。\n ——乔姆斯基",
			"added": 1504577690
		},
		{
			"topic_id": 750,
			"title": "中国富豪的宿命",
			"body": "他们不是在监狱里，就是在去监狱的路上。最早的牟其中是为第一代富豪，今年刚出狱。第二代富豪赖昌星逃亡被遣返继续服刑。第三代富豪袁宝璟被灭门，黄光裕还在狱中。第四代富豪如下图，想逃逃不掉了。",
			"added": 1504589434
		},
		{
			"topic_id": 781,
			"title": "汉源三年大饥荒纪实：",
			"body": "一开始是白天下种，到了晚上，所有饿得不行的大人小孩，就到地里把种下的玉米掏出来，吹一吹泥巴，就丢在嘴里生的嚼烂吞下肚里。后来工作组检查发现，所有下种的玉米都没有了，就想出用人粪便拌种，用煤油加桐油来拌种……但人一旦到了垂死挣扎的时候，就会不顾一切了……就到地里一粒一粒地把玉米种子掏出来先用河沙揉搓，再用开水烫一下就吃了……",
			"added": 1505112929
		},
		{
			"topic_id": 782,
			"title": "某年，以色列公交车遭遇恐怖袭击，死难者中有两名中国人。",
			"body": "但中国领馆撒手不管，因他们是偷渡者。以色列却不依不饶：偷渡者也是人，中国不管我们管。于是一查到底，找到其在福建的遗属，每人获赔70多万美金。\n听说后来的70万美金还被中国政府扣了18万美金的税收。——黄慧娴-律师",
			"added": 1505126641
		},
		{
			"topic_id": 785,
			"title": "因是海航的老板及拥有人身份，仍是个谜。",
			"body": "据美国传媒报道，投资银行高盛已经叫停为海航集团旗下的一家公司进行上市筹备工作，原因是海航的老板及拥有人身份，仍是个谜。华尔街日报引述内情人士报道，海航集团数个月前，已属意将旗下设于北京的Pacetera Techonology International（PTI）资讯科技外包公司的上市前期工作，交由高盛进行。",
			"added": 1505126945
		},
		{
			"topic_id": 793,
			"title": "北京母親帶女兒跳樓 女兒大哭：我自己跳",
			"body": "",
			"added": 1505198264
		},
		{
			"topic_id": 800,
			"title": "因习武而被\"涉恐\",被判20年",
			"body": "和田伊利奇乡阿热麦勒村书记证实21岁的村民阿布里米提.麦提亚森因习武而被\"涉恐\",被判20年。喀什麦盖提县西特东乡也有一批青年因聚一起锻炼而被抓。这些地方非运动员的维吾尔人锻炼,穿运动装,家里有拳击套等的都成为重点查处对象。",
			"added": 1505356075
		},
		{
			"topic_id": 802,
			"title": "薄熙来被囚之后，立刻发出威胁，",
			"body": "薄熙来被囚之后，立刻发出威胁，扬言如果判他死刑，他将在法庭上揭发胡锦涛、温家宝、胡春华等人毒杀十世班禅大师的罪行，并要求以谋杀罪对这群杀佛罪犯们实行逮捕，提起公诉。此言一出，中共庙堂震撼。中共遂以薄熙来之子的生命作为筹码，与薄熙来达成黑幕交易：留薄一命，薄则保持缄默。——袁红冰",
			"added": 1505388268
		},
		{
			"topic_id": 805,
			"title": "今天确实收到消息，联邦调查局开始对一批华人进行调查，",
			"body": "就是每次中共匪首们过来都去摇旗呐喊的那些人。一旦发现有隐瞒党员身份、瞒报大陆资产等等取得美国绿卡或者公民、申请占用医疗、福利等等马上遣返。 希望美国政府加大力度驱逐这些吃着美国福利给共匪唱赞歌的共特，把亲共分子踢回大陆最好",
			"added": 1505393386
		},
		{
			"topic_id": 807,
			"title": "看來姚依林家六四前到美國買了一百多套房產的三千萬美元就來源於此，",
			"body": "看來姚依林家六四前到美國買了一百多套房產的三千萬美元就來源於此，另瑞士大使告訴加拿大大使中央政治局委員都聯係過要轉移資產到瑞士，因爲是集體分贓集體轉移資產所以毫無忌諱也不怕丟人。越是拿錢多的越是在六四鎮壓上態度强硬堅決，姚依林就是這樣。",
			"added": 1505438951
		},
		{
			"topic_id": 811,
			"title": "北京富翁袁宝璟，妻子卓玛，2014年被指雇凶杀人，财产被孙，孟夺取。",
			"body": "雷洋因撞破孟及情妇王芳（鱼候妻子）和杨澜之事，了解袁宝璟相关情况，赵勇金三角赌洗钱，被李东（音）指使北京国安便衣格杀，导演其后公安（顶包的）公然电视撒谎，不予起诉。王珉，苏荣，李峰（17年01月入狱）等人知情被抓。",
			"added": 1505494905
		},
		{
			"topic_id": 819,
			"title": "人权组织发布全球奴隶指数：中国第二",
			"body": "現代奴役形式一半以上的受害者分佈在五個國家——印度1835萬、中國339萬、巴基斯坦213萬、孟加拉國153萬，以及烏茲別克斯坦123萬。\n現代奴役形式受害者比例最高的是朝鮮，占人口總數的4.37%，接下來是烏茲別克斯坦的3.97%、柬埔寨的1.65%，印度的1.4%，以及卡塔爾的1.36%。\n\n代奴役形式人均水平最低的國家——定義為總人口的0.02%及以下——有盧森堡、新西蘭、愛爾蘭、挪威、丹麥、瑞士、奧地利、瑞典、比利時、澳大利亞、加拿大、西班牙、英國、法國、德國和美國。（文明富裕國家無一例外都是自由民主國家。）",
			"added": 1505550035
		},
		{
			"topic_id": 820,
			"title": "王岐山在金融系统呼风唤雨时,有个高姓女友出身将领家庭，她对王非常倾慕，",
			"body": "王岐山在金融系统呼风唤雨时,有个高姓女友出身将领家庭，她对王非常倾慕，王岐山对她也是青眼有加,后来这位高女士离婚,前夫是解放军中将、某大军区副司令员 \n她是开国少将高厚良之女 高燕燕 \n儿子高建（1981年1月-）:2003年10月加入海航,2016年2月升任海航集团人力资源总监",
			"added": 1505562154
		},
		{
			"topic_id": 821,
			"title": "在1974年，一位女政治犯被處決了。",
			"body": "處決之後她的乳房被割掉，屍體被姦污這位女政治犯在臨刑之前，在這張手紙上寫下了這樣一句話，她說：「我向冰冷的鐵牆咳一聲，還能聽到一聲回音，而向活人呼喚千萬遍，恰似呼喚一個死人！！」。——袁紅冰",
			"added": 1505562191
		},
		{
			"topic_id": 830,
			"title": "上官長風‏",
			"body": "1964年某夜晚，寒風不斷從門縫灌進來，女人忙給孩子們塞緊被子。雖然已過了最艱苦期，但孩子還是吃不飽，餓得好不容易睡著，不想他們被凍醒。老公回來了，兩眼放光：早晨廣播聽了嗎？女人搖頭。老公搓著雙手：太好了咱們國家也有原子彈啦！女人的眼也一下子亮了起來，問：咱家能分幾個吃？",
			"added": 1505657319
		},
		{
			"topic_id": 841,
			"title": "当年在东北有这么一个故事，有一个老汉种地，养了几头骡子。",
			"body": "日本兵来征用了几天，骡子驮回来了几袋子小米；\n        后来国民党来了，骡子又被征用了几天，拖回来几袋子玉米；\n        再后来东北解放了，又被征用了骡子，然后牲口不见了…………",
			"added": 1505879079
		},
		{
			"topic_id": 848,
			"title": "画家高丽娟：",
			"body": "“如果能够出去，我连骨灰都不愿意吹到这里来，这块土地只会让我铭记生而为奴的耻辱！”",
			"added": 1505916909
		},
		{
			"topic_id": 852,
			"title": "零酷刑贸易联盟启动，中国被列为头号刽子手。",
			"body": "近60个国家星期一（9月18日）在联合国加入了欧盟主导的“零酷刑贸易联盟”，寻求终止酷刑和死刑工具贸易，包括电击警棍、有尖刺的警棍、致命鸡尾酒药剂.",
			"added": 1505977449
		},
		{
			"topic_id": 855,
			"title": "虚报持股结构，构成法律欺诈！",
			"body": "瑞士并购委员会要求海航澄清贯君和拜斯代表谁持股，2017披露三位创造人拥有可观股份，而2016年收购文件称没人能拥有3%以上的股份！该委员会要求在10.3号以前回复此问，否则虚报持股结构，构成法律欺诈！",
			"added": 1506076641
		},
		{
			"topic_id": 857,
			"title": "在中国，我们当然看的到饥馑。",
			"body": "一九六一年一月，中苏分裂，中国希望阿尔巴尼亚帮忙骂苏联的赫鲁晓夫，给了五亿卢布，还用外汇从加拿大买小麦送给阿尔巴尼亚。这一切都发生在大饥荒时期。阿尔巴尼亚代表希地说：在中国，我们当然看的到饥馑。可是我们要什么中国就给什么，我们只需要开开口。我感到很惭愧。",
			"added": 1506086520
		},
		{
			"topic_id": 863,
			"title": "赶走了蒋介石，这批人坐天下了，",
			"body": "可是没有学历，能力，自信，胸怀，学识，专业，良知。领导人没有一个法学家，建筑师，数学家，经济学家，除了打砸抢。和痞子流氓住进大观园一样的胡闹。\n这么大的一个国，这么多的人口，最后，在和平年代饿死整死的人比战争时期死的人还多。至今，还有上亿贫困人口。\n福利全世界最差，却号称社会主义国家，牛气冲天。",
			"added": 1506155390
		},
		{
			"topic_id": 864,
			"title": "红安，一个人口48万人的山区小县，",
			"body": "为上世纪的那场马列革命就付出了14万人的生命代价，那可都是些青壮年啊！悲剧的是：这些人中太多不是死于国军之手，而是死在自己人手里。死难的冤魂大多数都是用石头砸死，锄头挖死，大刀砍死。那是一种极为痛苦的死法！相比之下死于国民政府刑场的公开枪决到是一种“高级享受” 。",
			"added": 1506161267
		},
		{
			"topic_id": 866,
			"title": "三十年来联合国最勇敢的演讲",
			"body": "川普首次在联合国大会发言。 9月19日纽约，在联合国大会七十二届会议上，美国总统川普（特朗普）发表了极具震撼力的演讲，明确向国际社会表明了美国的外交立场，点名批评朝鲜、伊朗、委内瑞拉及古巴独裁政权等，受到100多个国家的与会领导人的支持和认同，被赞扬为「三十年来联合国最勇敢的演讲」、「明辨善恶」、「重建美国的世界领导地位」、「击中邪恶黑暗的心脏」等等。",
			"added": 1506162778
		},
		{
			"topic_id": 869,
			"title": "你拆个试试？我们穆斯林把你给拆了！",
			"body": "天津市城市规划，要拆除一座穆斯林的清真寺，天津市长亲自去找穆斯林大佬说道此事，说先给你们修建新的清真寺。等新清真寺建好之后，该拆除老清真寺了，当地穆斯林大佬对市长说：你拆个试试？我们穆斯林把你给拆了！当时就把这位牛逼哄哄的天津市市长给傻逼在当场了！然后他是一点办法也没有！",
			"added": 1506223897
		},
		{
			"topic_id": 870,
			"title": "李小琳排瑞士银行客户第五，邓家4.8万亿美元海外资产…",
			"body": "",
			"added": 1506251687
		},
		{
			"topic_id": 871,
			"title": "每年花费上百亿美金，天上地下刺探来的就两个消息：",
			"body": "前苏联克格勃曾经是世界上最大的特务组织，在国内有150万线人，在国外有25万谍报人员。这个组织每年花费上百亿美金，天上地下刺探来的就两个消息：一条是本国人讨厌他们，另一条是全世界讨厌他们。",
			"added": 1506321491
		},
		{
			"topic_id": 876,
			"title": "剛剛從墻內出來，墻內墻外兩重天。",
			"body": "去新疆旅遊，感覺就像是進了軍營，城市裡面是三步一崗五步一所，協警手持狼牙棒，軍警個個是荷槍實彈。朋友說新疆是瓜果之鄉，歌舞之鄉，我說那是過去，現在應該是軍警之鄉。",
			"added": 1506349729
		},
		{
			"topic_id": 878,
			"title": "地球上只有两个国家有过党校；纳粹德国和红色中国。",
			"body": "德国的毕业生叫纳粹，我们的叫书记。",
			"added": 1506424561
		},
		{
			"topic_id": 879,
			"title": "【光荣传统】",
			"body": "40─41年间我陪陈郁同志参观延安和平医院，一间大厅的大槽内浸泡着一具男尸，年约30余岁，护士长说：“这是医学解剖用的，原来有三具，他们都是反革命分子，是由康生批准处理的。”问：“他们被送来时是活人？”回答：“当然。以医病的名义送来，然后处理的”《峰与谷：师哲回忆录》",
			"added": 1506424999
		},
		{
			"topic_id": 881,
			"title": "中国的暗杀时代",
			"body": "在清末民初时期，政治暗杀事件风起云涌，如徐锡麟刺杀安徽巡抚恩铭、吴樾刺杀出洋五大臣、李沛基刺杀广州将军凤山、彭家珍刺杀良弼、汪精卫刺杀摄政王等等。革命党人前赴后继，而满清勋贵却惊魂失魄、整日惶恐不安。我们都知道，在辛亥革命前夕到1926年广州国民政府组织北伐的期间，革命党都没有一支真正属于自己的武装力量。\n\n然而，辛亥革命之所以能一举而功成，在很大程度上都是革命暗杀的功效。在暗杀如此风起云涌的背景下，各地的督抚早已不敢轻易得罪革命党人，即便发现了革命党人的活动，要不假装不知，要不“礼送出境”。汪精卫刺杀摄政王也是如此，并非出於满清勋贵的仁厚，而是满清已经渐渐失去了对天下的掌控。在此情况下，杀了汪精卫的话，日后其生活将更不得安稳。而进入民国时代，政治暗杀与血亲复仇更是枚不胜举， 如宋教仁、陶成章、陈其美、廖仲恺、孙传芳、王亚樵等等都死於刺杀。\n\n吴樾在其遗著《暗杀时代》一书中写道：夫排满之道有二：一曰暗杀，一曰革命。暗杀为因，革命为果。暗杀虽个人而可为，革命非群力即不效。今日之时代，非革命之时代，实暗杀之时代也。",
			"added": 1506428403
		},
		{
			"topic_id": 882,
			"title": "你是翻墙出来预言我会后悔来美国吗？",
			"body": "尹胜 Retweeted 闲人\n你是翻墙出来预言我会后悔来美国吗？我没有你想的那么天真，我从来也没有认为这个世界有完美的制度，我要的仅仅是不翻墙，写个文章不被抓，这已经很好了。下等公民好歹是公民，你呢？还是个奴隶。你翻墙出来说美国制度不好，这让我想起，吃屎的人说吃饭也要变成屎，你会后悔吃饭，不如直接吃屎。尹胜 added,\n闲人 @yindan3418\nReplying to @yinsheng74\n老尹，如果在美国呆更长时间了，你同样会觉得美国制度臭不可闻，因为沒有完美制度，再加上你在美国潜规则上是下等公民。",
			"added": 1506477214
		},
		{
			"topic_id": 886,
			"title": "我周围有些朋友的爷爷公公们在建国后，被拖出去就枪毙了的，现在他们都在使劲舔垬菊",
			"body": "当今许多活跃的底层脑残，在毛时代很多都是饥民，其爹妈有些还做了饿鬼，改革开放，拥抱文明，才过上能吃饱的日子。刚吃饱饭没几年，就又开始崇拜饿鬼制造者，且又回归胡折腾的本行, 而且代代相传，一群吹胡子瞪眼的二逼而已！",
			"added": 1506567177
		},
		{
			"topic_id": 887,
			"title": "网言失踪的武汉：",
			"body": "网传消息，除了林飞阳，还有钱昌、罗浩、曹兴、朱名虎等十多位年轻的大学生神秘消失，都是男性，都是20岁左右，大都是一米七到一米八左右的身高。记得中国每年器官自愿捐献的只有几千例，而官方却宣布每年约有上万例器官移植手术成功的报道，那么问题来了，这些多出的器官是来自哪里？",
			"added": 1506567254
		},
		{
			"topic_id": 891,
			"title": "美驻华大使馆莫伟堂说：",
			"body": "在中国，每年有成千上万冤民上访。有的被冻死饿死，有的被关进黑监狱，被强奸，被打成残废。他们经常到我们大使馆门前跪着，哀求我们帮助伸冤。太可怜哪！全世界都想不通，一个政府怎会这样的对待自己的国民？在我看来，中国大部分民众的国民待遇，连我们美国人的狗都还不如。",
			"added": 1506615322
		},
		{
			"topic_id": 893,
			"title": "海航集团的爆发模式",
			"body": "被打掉的大大小小的老虎，都有一个共同特点，那就是中纪委公布的贪腐金额远远低于坊间传闻，比如石油帮老大周永康，都说其家族贪腐几千亿，而实际金额只有两亿。通过郭文贵爆料才知道，原来绝大多数脏款都被王岐山、孟建柱、傅振华、孙力军瓜分了。这就是海航集团的爆发模式，就是盗国贼家族的暴富原因。",
			"added": 1506651530
		},
		{
			"topic_id": 895,
			"title": "【中国的国民收入排名是162位】",
			"body": "国內有些人总是认为当今中国在世界发展最好时期，他们的眼光看到的仅是中东的动荡，伊拉克的乱，印度贫穷。因為信息来源全部是新闻联播和官媒， 他们永远不知道2016年世界各国的国民收入排名表中，中国的国民收入排名是162位，远远落后伊拉克、印度，甚至低于阿富汗，他们实际上对世界一无所知",
			"added": 1506679745
		},
		{
			"topic_id": 897,
			"title": "镇压逃港潮，不是习仲勋是谁？",
			"body": "蛇口香港之间海面上漂浮的大量尸体，是谁造成的？广东公安的巡逻艇难道都是吃素的？深圳内陆之间的隔离墙和岗卡是谁设立的？这不全都是习仲勋干的吗？",
			"added": 1506787822
		},
		{
			"topic_id": 902,
			"title": "这酒叫做“剑南春”",
			"body": "文中提及的“爷爷”，家传有一酒窖酿酒，后来解放后公司合营，最终这酒厂变成了国营企业，再后来变成股份公司跟她家更是毫无关系除了招牌汉字是她爷爷写的。这酒叫做“剑南春”。",
			"added": 1506913722
		},
		{
			"topic_id": 903,
			"title": "【推特又爆武汉失踪大学生 黑手是谁？】",
			"body": "官媒对武汉数十名大学生失踪消息紧急辟谣刚一天，推特又爆出新的案例，一名父亲在武汉街头寻找失踪的儿子，还发现了献血包。这些父母失去孩子不但得不到政府的帮助，反而被删除消息、抓人、辟谣，这一连串的政府行为，引发民众联想，到底是谁在残害大学生？\n\n〝帮我找找孩子吧，没有你们的帮助，我们找不到啊！〞\n\n9月29号，推特又出现了一位父亲满街驱车寻找儿子的镜头。\n\n消息说，19岁的儿子考上武汉大学4个月后，突然从学校寝室失踪了，失踪时没有带手机，却发现了献血包，6个多月过去了，来自十堰的朱示忠夫妇没有发现任何蛛丝马迹。\n\n就在前一天，一篇寻找失踪年轻大学生的文章爆红网路。\n\n该文例举的40名在武汉失踪的青年，年龄都在20出头，除了5名只有联系电话外，其他的都有详细的失踪信息，其中有23名还附带了大学名称和专业等。",
			"added": 1506927981
		},
		{
			"topic_id": 905,
			"title": "这世上最廉价的自豪，就是爱国主义。",
			"body": "“这世上最廉价的自豪，就是爱国主义。因为爱国者自身一无是处，只能从爱国这一行为中获取自尊。而品性优良的人，眼光犀利，且忧国忧民，能够清晰地看到自己国家的种种缺陷。但是，懦弱之人一无是处，就只好死死抱住自己的国家，来获取自尊。也只有这样，可悲的爱国者才能隐藏自己的懦弱，才能内心充满感激地，肆无忌惮地，随时准备为自己国家的种种错误和愚蠢而强词夺理。”——叔本华",
			"added": 1506942454
		},
		{
			"topic_id": 907,
			"title": "中 国留学生章莹颖在美国失踪了，全中 国的媒体都在找。",
			"body": "中 国留学生章莹颖在美国失踪了，全中 国的媒体都在找。中 国留学生冯如奕在日本失踪了，全中 国的媒体都在找。中 国的大学生在武 汉失踪了，全中 国的媒体都失踪了！只有武 汉警方在找啊找，最后终于找到了发帖人，然后把他逮起来判个刑关进了牢房里，事情圆满结束。这样的媒体和警察在文明世界里被灭绝了！",
			"added": 1507074202
		},
		{
			"topic_id": 908,
			"title": "【美国博士举报孙宏斌涉嫌在美逃税隐瞒收入】",
			"body": "顾颖琼称，这封0.49美元的检举信最高会为他带来2000万美金（约合人民币1.3亿元）的奖励。美国税务局和联邦调查局联合调查后，所有补交的税，举报人可以拿到其中的15%到20%，上限是两千万美金。孙宏斌为美国国籍。在美国这些信息都是可以通过公开渠道查到。顾表示，“我在查询的过程中发现，孙宏斌在美国上报的收入仅有十几万美元，但媒体报道他是个亿万富翁，来往的都是像王健林、贾跃亭之类的大人物。我认为他作为美国公民，严重隐瞒了自己的收入”。",
			"added": 1507110249
		},
		{
			"topic_id": 909,
			"title": "拳头紧攥着一枚五分硬币……",
			"body": "“文革”期间，枪毙人公安机关要向家属收取子弹费，开着汽车抄家，要索取汽油费。一个年轻姑娘成了“反革命”，受尽凌辱后被枪毙，公安局寄来催款单，命家属速交五分钱子弹费。几天后，天下大雪，姑娘母亲在街上犯了心肌梗塞，倒在雪地里，拳头紧攥着一枚五分硬币……",
			"added": 1507206820
		},
		{
			"topic_id": 910,
			"title": "【张贤亮回忆大饥荒】",
			"body": "跑到兰州，兰州比劳改队还饿，满兰州站几千个要饭的。一个40多岁的男人拉着一个女娃娃，见人就问“你要不要”，原来要这个小姑娘卖淫。来了一个干部。那个时候，男人饿，都不能勃起啊，干部也饿，就全身摸摸，然后给那么一块小饼子。这一次我哭了……",
			"added": 1507206928
		},
		{
			"topic_id": 913,
			"title": "中國新聞網消息：",
			"body": "截至目前（2017年10月3日），南航已成功保障活體器官運輸保障任務超過500例，運輸成功率100％。",
			"added": 1507274931
		},
		{
			"topic_id": 914,
			"title": "美国的国会及行政当局中国委员会发表新一期年报，",
			"body": "批评中国在人权法治等领域全面恶化，尤其是宗教自由。委员会联席主席指出，有关实况，证明中国政府和国家主席习近平强调要在不同范畴带领国际社会的言论纯属虚言，不是一个负责任国家所为，呼吁美国及其他国家敦促中国改善人权和尊重法治。",
			"added": 1507290606
		},
		{
			"topic_id": 915,
			"title": "她以为这是在中国！呵呵 呵呵 呵呵",
			"body": "来自中国山东省的一个游客在餐厅吃饭因不合味道大骂餐厅服务员，后警察来协调并与警察吵起来想夺警察的枪，结果被当场击毙，经察明，死者姓陈，是山东省某县长的老婆，此次来美是同旅行社来美国旅游，她以为这是在中国！呵呵 呵呵 呵呵",
			"added": 1507417554
		},
		{
			"topic_id": 917,
			"title": "姚监复披露：",
			"body": "1966年8月5日卞仲耘被打死的当天晚上，邓小平女儿邓楠、邓榕找到卞仲耘丈夫王晶垚，告诉他以后只能讲卞仲耘是因高血压而死亡，不能讲她是被打死的。几十年后安全部门亦正式通知胡杰，纪录片《我虽死去》中不能收入邓楠、邓榕对王晶垚讲的“不能讲卞仲耘是被女学生打死的”那段话。",
			"added": 1507436921
		},
		{
			"topic_id": 921,
			"title": "民办枪毙",
			"body": "你一定听说过“民办学校”“民办企业”，但你听说过“民办枪毙”吗？在红歌唱得最响，毛思想执行最彻底的文革期间，江西瑞金出现了一个新名词，叫“民办枪毙”，就是各公社甚至是各大队，都有权处死“阶级敌人”，除了枪毙，还用刀、棍、活埋等手段。全县共“民办枪毙”300多人。",
			"added": 1507594478
		},
		{
			"topic_id": 922,
			"title": "老牛之友：【49后第一次大屠杀48周年祭】",
			"body": "时间：丁未元宵（1967年2月23日）。地点：青海省西宁市青海日报印刷厂。不是两派武斗，不是恐怖袭击，更不是外敌入侵。上午11时左右，在机枪冲锋枪扫射下，10来分钟，死169人，伤178人。随后近万人以反革命罪被捕入狱，全城笼罩在一片恐怖之中。",
			"added": 1507594523
		},
		{
			"topic_id": 933,
			"title": "维基解密网站：",
			"body": "一名曾参与1989年六四屠杀事件的38军士兵透露，中共军方当年确实曾下达格杀令，同时以100多名士兵遭学生杀害为由，诱骗奉调天安门的士兵开枪，造成上千名无辜百姓丧生。100名失踪战友后来全都出现了。该士兵休假期间，其服役单位透过地方官员传达命令，要求他保持沉默。",
			"added": 1507883023
		},
		{
			"topic_id": 934,
			"title": "赵远明：",
			"body": "1989年6月4日当天，冲在最前面的约一个营的士兵，最先开枪射杀大学生及围杀天安门广场上的学生和市民。事后上级领导高度表扬。回到军营后给每个人打针，说是预防传染病，之后让他们复员回老家。半年后，他们都患失忆症、神经病，死的死残的残。中共历来是卸磨杀驴，杀人灭口，以绝后患。",
			"added": 1507883061
		},
		{
			"topic_id": 935,
			"title": "（卡特的回憶錄）",
			"body": "1979年鄧小平訪美，時任美國總統卡特批評中國計劃生育不講人權。鄧小平說：“那我們每年給你幾千萬人，如何？”卡特聽後，沉默了（廣為流傳的中國版本）。美國版本：卡特總統聽完鄧的話後哈哈大笑地說：“我還是第一次看到一個國家的領導人，把國民當物品送來送去。”鄧聽後沉默了（卡特的回憶錄）",
			"added": 1507889698
		},
		{
			"topic_id": 941,
			"title": "共产党的脸皮真的很厚",
			"body": "中共19大开幕前，官方加强舆论宣传，新华社今天用英文发表社论，明确说中国的民主好过西方的民主。中国完全没有必要引进西方正在失败的民主。新华社的社评呼吁，西方国家需要深切反省其老化的民主制度，并指西方民主若不想彻底崩溃，就必须注入新生命、推倒重来。",
			"added": 1508312240
		},
		{
			"topic_id": 942,
			"title": "澳大利亚外长毕晓普(Julie Bishop)对在澳大利亚的中国留学生发出直言警告：",
			"body": "澳大利亚欢迎国际学生，他们是由于这个国家的“开放与自由”而来这里学习。她说：“我们国家为开发的环境和自由言论而骄傲，如果你要来澳大利亚，这就是我们法律。每个人都必须遵守。 ​​​",
			"added": 1508325581
		},
		{
			"topic_id": 958,
			"title": "【毛的根本错误】",
			"body": "不是反右、大跃进和文革，这些不过是现象和结果。他最根本的错误是：建立了史上史无前例的、空前绝后的、垄断一切资源和分配权的超极权制度，使得中华民族和中国人民100多年来追求自由解放的努力全部化为乌有，千千万万优秀儿女为民主进步而进行的抗争全部付之东流。——《炎黄春秋》",
			"added": 1508867607
		},
		{
			"topic_id": 966,
			"title": "【斯特劳斯夫妇】",
			"body": "先生说：“我绝不会在别的男人之前上救生艇！”太太说：“多少年来，你去哪我就去哪，我去你去的地方！”她把自己艇里的位置给一个女佣，把自己大衣给她。他们纪念碑上刻着：再多海水都不能淹没的爱…他们是《泰坦尼克号》中相拥等待死亡的老夫妻的原型：梅西百货创始人斯特劳斯夫妇。",
			"added": 1509085654
		},
		{
			"topic_id": 973,
			"title": "毛泽东永远是他们的教父",
			"body": "对很多红二代而言，尽管自己的父母被毛泽东整得七死八活，但毛泽东永远是他们的教父。",
			"added": 1509263130
		},
		{
			"topic_id": 976,
			"title": "“中国人没有信仰，如果说有的话，那就是做官。”",
			"body": "——这是200年前英国公使马戛尔尼说的一句话，这是令人振聋发聩的一句话，其意义胜过无数研究中国人煌煌巨著的总和。",
			"added": 1509286696
		},
		{
			"topic_id": 986,
			"title": "@Xun_authentic：我给各位形容一下什么叫“为老不尊”：",
			"body": "我爷爷那辈没在60年代被饿死，我爸爸那辈没在70年代被斗死，到了现在他们都觉得自己是国家的主人。",
			"added": 1509623209
		},
		{
			"topic_id": 987,
			"title": "看到一句很有哲理的话",
			"body": "“从野蛮步入文明需要几代人的努力；从文明倒退到野蛮只需出现一个伟大领袖！”",
			"added": 1509634116
		},
		{
			"topic_id": 989,
			"title": "邓小平大规模有组织谋杀年轻人",
			"body": "83年严打。我记得那时我哥哥的一个同学绰号“邓老六”的就因为斗殴被郭嘉恐怖主义这样谋杀了。那一年，有两万个年轻的生命因为青春期的躁动而被枪杀，包括西安一位搂脖子跳交谊舞而被定为流氓罪的一个女青年。除了这样被大规模有组织谋杀的年轻人，还有数万遭到残酷关押迫害的年轻人。",
			"added": 1509704354
		},
		{
			"topic_id": 990,
			"title": "人情冷暖，天壤之别！",
			"body": "国军特勤老兵陈小斌被囚虐大陆几十年，暮年申请赴台定居养老获批，台陆军司令亲自迎接。\n\n共军老兵王琪被俘滞留印度54年，归国无人理睬，悲凉之下凄惨再回印度，连机票都是印度驻华使馆购买的。",
			"added": 1509706277
		},
		{
			"topic_id": 993,
			"title": "原重庆市公安局长王立军的供词：",
			"body": "我们包装拼凑和策划了600多个黑社会，数万人被抓，数千人被判刑，数百人被判重刑和极刑，数十人是富豪，不仅老百姓一片欢呼，而且，官员全都闻风丧胆，顺从了薄熙来，更重要的是，我们以罚没追缴为借口，一下子搞到了1000多亿的民企财产。",
			"added": 1509855117
		},
		{
			"topic_id": 1000,
			"title": "《纽约时报》发表文章《不要对共产主义心存幻想》",
			"body": "作者BRET STEPHENS说，为什么熟知南非臭名昭著的罗本岛监狱的人，从未听说过古巴的松树岛监狱？为什么马克思主义在大学校园里和进步媒体上仍被认真对待？那些提出拆除美国内战时期南方邦联人物凋像这一合理要求的人，对穿着印有列宁或毛泽东像的体恤衫的“嬉皮士”有一丁点的内心反感吗？",
			"added": 1509941746
		},
		{
			"topic_id": 1004,
			"title": "网友向她推荐了1995年北京电影制片厂拍摄的故事影片《杨开慧》",
			"body": "有个做母亲的人向网友求援，说她的女儿正在读高中，成天和一些不三不四的社会青年混在一起，怎么劝说都没有效果。她想让网友推荐一部女孩子和流氓混在一起最后结局非常惨的影视剧给女儿看，借以警醒孩子。\n网友向她推荐了1995年北京电影制片厂拍摄的故事影片《杨开慧》。",
			"added": 1509977106
		},
		{
			"topic_id": 1009,
			"title": "当年江考察习近平，习家的腐败都搞清楚了他们放心了。",
			"body": "如果习家是干净的决不会将他放到这个位置上。王天成不愧为中国的政治学家，说出中共考察干部的第一原则。实际上是一个简单的逻辑，习如果是干净的这么会容忍腐败分子，腐败份子都是惺惺相惜的。以前我认为江选错了接班人，现在看来这个认识是错的。",
			"added": 1510158038
		},
		{
			"topic_id": 1014,
			"title": "甘肅省一處鄉下，甚至有一名母親在臨死前跟女兒說：",
			"body": "「我身上沒肉，只有心臟還有一點肉，我死後你把我的心臟吃了吧。」母親死後，女兒真的把母親的心臟給吃了，不久之後，女兒自己也被別人吃了。",
			"added": 1510224385
		},
		{
			"topic_id": 1019,
			"title": "【案例】",
			"body": "福建一商人被抓5天后企业倒闭，两亿财产被法院拍卖偿债，看守所关押456天，取保后确认肺癌晚期，死后法院裁定其无罪，国家赔偿14万元……——可见，爆料不虚！",
			"added": 1510662211
		},
		{
			"topic_id": 1029,
			"title": "【它们张狂到杀人无需掩盖证据】",
			"body": "流亡海外的新疆医师安华托帝日前在台演讲中共活摘人体器官。安华引述中国医疗杂志“两例心肺移植术”论文一段话：“供体入室后，按常规予以麻醉及插管”。摘死人器官何需麻醉及插管？这种耸人听闻的医学案例张狂地写在权威期刊上“实在太恐怖了！”说明活摘医师操刀无数，早已麻痹到忘记把“杀人证据”掩盖的地步。",
			"added": 1510795681
		},
		{
			"topic_id": 1046,
			"title": "史實：紅四方面軍在川北慘無人道的大屠殺:",
			"body": "據《四川月報》第五卷第五期記載，全縣已發現的屍窖據各方記載，通謂在五百窖以上，合計被殺人口在十二萬以上，至城區戶口全家絕口者一千八百餘戶，家主見殺者五千餘戶，花叢埡即有四十九坑之多。恩陽河方面，附近數十里中，亦...",
			"added": 1510978250
		},
		{
			"topic_id": 1104,
			"title": "杜魯多稱自貿協定是包含性別平等、環保、勞工權益章節的「升級版」",
			"body": "彭博社引述杜魯多昨日見記者時稱，自貿談判仍是中加「伙伴關係的下一步」，兩國仍有興趣推進。他前日稱，加方期望的是包含性別平等、環保、勞工權益章節的「升級版」自貿協定，而中方則對於首個與七國集團（G7）成員談判的自貿協定十分謹慎。\n\n加拿大《環球郵報》報道，加國國內對於與華合作亦有不同意見，認為可能會導致就業流失、中國貨品傾銷加劇等，對於中國司法環境和人權狀况亦提出質疑。",
			"added": 1512974634
		},
		{
			"topic_id": 1138,
			"title": "关于追赠义士杨佳先生为中国民主革命军将军衔的通知",
			"body": "杨佳勇士，华人勇气之楷模。为唤醒被土共奴役的中国大陆人，为感佩杨佳义士之勇气，为追念逝者，鼓励生者，警告作恶者，中国民主革命军特追认杨佳为大陆华人第一勇士，并追赠中国民主革命军将军衔。",
			"added": 1514167656
		},
		{
			"topic_id": 1151,
			"title": "吴淦获刑声明",
			"body": "在专制国度，能被专制政权授予“颠覆国家政权”罪名这个荣誉，是对一个公民最大的肯定，证明了这个公民没有做专制的帮凶，没有做奴民，起码他去捍卫争取了权利。梁启超说他与专制势不两立，我说不反对专制，我还是人吗？虽然他们想让我认罪和配合宣传来换取他们对我轻判，他们甚至答应只要我认罪，就可以判三缓三，都被我拒绝。我被判八年，我并没有悲愤与绝望，这是我自己主动选择的，因为反对专制就意味着在监狱的路上。我被判我依然乐观的，因为有了互联网，觉醒的人越来越多，为专制独裁送终的队伍会越来越壮大。企图想用监狱来恐吓追求自由民主的人，阻挡人类文明进程的人将不得善终。暴政是因为缺乏自信心，心虚恐惧的表现，是穷途末路、图穷匕见的表现。民众觉醒了，专制结束的时期还会远吗？\n\n我关押期间遭受了酷刑和各种非人虐待折磨，这不是个例，而是普遍现象。我呼吁国际社会能关注中国人权恶劣状况，关注中共对本国公民特别是对异议人士刑拘、罪名滥用、秘密关押、强迫上媒体认罪、强迫接受官方指定律师、酷刑虐待、剥夺各种公民权利等等严重侵害公民的暴行。\n\n此次参与迫害及酷刑虐待我的人员有：安少东、陈拓、管建童、姚诚、袁溢、王守俭、谢锦春、宫宁、盛国文、曹纪元、刘毅、蔡淑英、林崑。",
			"added": 1514301837
		},
		{
			"topic_id": 1157,
			"title": "川普今天在美国国会上说，中国政府就是恐怖主义国家",
			"body": "发怒了，在美国国会上说，中国政府就是恐怖主义国家，呼吁全球民主国家，立即和中国政府文化，政治，经济合作上的断交，如果有任何国家和中国政府有经济往来，就是支持恐怖主义。防止（中国）恐怖主义在世界的发展和渗透，川普在国会还演讲了，如何打击恐怖超级大国的问题，两议院全票一致通过。",
			"added": 1514472464
		},
		{
			"topic_id": 1172,
			"title": "吴淦（超级低俗屠夫）：致高墙外的诸君",
			"body": "首先感谢那些不离不弃的朋友。谢谢你们。一切尽在不言中，屠夫依然乐观，激情满怀。主要是因为有了你们这帮可爱的“疯子”。当然也感谢讨厌我，但没有落井下石的朋友，你们保持了做人底线。对于幸灾乐祸、落井下石的人，我会反省我自身不足和各种毛病。对于个别人突破做人底线的事，我也给予理解，只是希望不要再去做类似事情了。屠夫神经粗，别人就不一定了。做人底线、担当、言行合一很重要。\n\n希望外面诸君不管环境再怎么恶劣，也不要悲观，也不要沉默，更不能做帮凶。我们可以懦弱、胆怯，但绝不能漠视残酷的现实，违背基本的常识，去说胡话，说鬼话，幻想明君，道德劝说，想不劳而获。我们要传播真相、捍卫良知、尊重常识、鼓励勇敢。每个人都多多少少有缺点和局限，包括我。我认为多接受各种思想，多点理解，少点功利，少计较个人得失，多付出，多去做实在的事，都会有回报的。至少我感受到了，你们的支持和关注就是最好的证明。\n\n最后借用肖申克的救赎里一句话做结尾：有些鸟儿它永远关不住，它身上每片羽毛都散发着自由的光芒。\n\n时间仓促，致上最诚挚的感恩！有你们真好！坐牢不可怕，就怕出去后，还是那些人，还是一如往常，哈哈！\n\n吴淦（超级低俗屠夫）",
			"added": 1514729387
		},
		{
			"topic_id": 1185,
			"title": "中宣部特急指令：",
			"body": "鉴于伊朗发生不可描述之状况，即日起，全国所有媒体不得报道任何与伊朗相关的消息，更不能提及伊朗革命。责令网信办立即启动互联网意识形态控制第一预案，对互联网舆论提及伊朗革命者进行高度关注并跟踪，必要时可以采取关网、禁言、禁转、拘留等强制措施。",
			"added": 1514791871
		},
		{
			"topic_id": 1186,
			"title": "胡耀邦助手林牧晚年反思：",
			"body": "上中共三大當 走向煉獄。 1948年他奔赴延安，踏進那個深不可測的歷史騙局中，最終明白誤讀了中共那些表面的宣傳，誤讀了那些動人的口號，為此付出了整整一生的代價。他們多數人的經歷都證明這是一條通向煉獄之路，但已經沒有回頭路可走了。",
			"added": 1514792115
		},
		{
			"topic_id": 1198,
			"title": "联合国70个国家联署通过：上网是人权",
			"body": "",
			"added": 1514871149
		},
		{
			"topic_id": 1212,
			"title": "齐奥塞斯库同志怎么样了？",
			"body": "89年12月朱德老婆康克清在文件上看到齐奥塞斯库被捕，当即中风昏厥。第二天醒来第一句话就问陈慕华：“齐奥塞斯库同志怎么样了？”陈慕华做了个手势：“枪毙了！”康克清同志闻后俩眼一翻，老腿一蹬，又昏过去了。",
			"added": 1515122567
		},
		{
			"topic_id": 1295,
			"title": "整个中共高层就是一个共贪结构",
			"body": "邓家有保险，江家有电信，李家有电力，王家有海航，习家有吉利。习家的吉利汽车以目前市值计算，远超上海汽车、中国一汽和东风汽车，已俨然成为中国汽车行业的老大。今后10年吉利汽车将在姐夫的关怀下，作为中国电动车标准的制定和领航者，有望成为世界汽车的老大。",
			"added": 1516506552
		},
		{
			"topic_id": 1329,
			"title": "习主席心中的红太阳毛一世的阴暗喔醜的邪恶，令人发指😡",
			"body": "“毛从不洗澡，每去一地，有人为他挑选众多处女供他玩乐”\n“我在年轻女人体内清洗”\n“毛有性怪癖，感染上性病但拒绝治疗”\n“从不刷牙而牙全黑并掉落，仅以茶叶水洗”\n可见灵魂多么醜陋！就是个变态狂！习敬毛啥？",
			"added": 1517912365
		},
		{
			"topic_id": 1331,
			"title": "【不作恶挺舒坦】",
			"body": "我认识的一个处级警官，随旅行团去美后“沉底”。六年来一直在华人圈底层做按摩师，每小时90美金。现浮出水面，最近见移民官，顺利拿到Green card。六年不知去向，我问他这一路走来如何，他淡淡地说：不做恶挺舒坦。我听后汹涌澎湃。",
			"added": 1518187927
		},
		{
			"topic_id": 1332,
			"title": "CNN报道",
			"body": "中國涉嫌以骯髒手段（dirty tactics），行賄非洲多國官員甚至總統，雖然中國已在2011年制定海外反腐敗相關規定，以符合聯合國反腐敗公約，但完全沒有實行過。",
			"added": 1518252789
		},
		{
			"topic_id": 1335,
			"title": "马格尼茨基法案成员国增加为六个",
			"body": "拉脱维亚议会以60-3通过马格尼茨基法案，使马格尼茨基法案成员国增加为六个：美国，英国，加拿大，爱沙尼亚，立陶宛和【现在的】拉脱维亚",
			"added": 1518504580
		},
		{
			"topic_id": 1352,
			"title": "美國新聞網站《Axios》周日（18日）報導",
			"body": "美國總統川普去年11月出訪中國時，因為中國人員不准手持「核彈發射手提箱」（Nuclear briefcase）的美國軍官，隨川普進入人民大會堂，美、中雙方的保安人員因此大打出手，連白宮幕僚長凱利（John Kelly）也參戰。\n\n《Axios》報導，川普當天出訪北京，預定到人民大會堂與中國國家主席習近平會面。沒想到，中國國家安全局的人員試圖阻止攜帶「核按鈕」手提箱的美國軍官入場。\n\n一名美國官員急忙向白宮幕僚長凱利報告。凱利得知後趕過去，並走到提箱軍官的身旁，讓他繼續前行。凱利也大聲向這名軍官及周圍的美國官員說： 「我們進去」（we are moving in） ，隨即有中國維安人員抓住凱利的胳膊，凱利馬上甩開對方的手。 之後美國特勤人員上前抓住動手的中國維安人員，並將他壓制在地。\n\n《Axios》稱，雙方肢體衝突發生在一瞬間，中國人員沒有碰到手提箱， 後來中國的維安事務負責人向美國道歉，但要求美國人員不要對外張揚這起「美中大戰」。",
			"added": 1519087028
		},
		{
			"topic_id": 1354,
			"title": "● 讓人沉思的一段文字摘錄：",
			"body": "1945年，納粹德國覆滅前夕，一位納粹軍官回家探親，在臨行前，對他兒子16歲的威廉佩頓說：\n“什麼都是假的，只有個人的生命，家庭才是真的，沒有個人就沒有國家。生命對於我們個人來說只有一次，我們的個體消失了，國家對於我們就不復存在。\n沒有什麼值得我們犧牲，什麼國家甚麼主義都不值得我們個人去賣命去犧牲。如果我不能回來，你要照顧好你媽媽\"。\n說完交給威廉佩頓一把嶄新的來复槍。在那後來相當混沌的一段日子裡，小威廉不僅用這把來福槍打兔子，打野雞，養活了自己和母親，甚至用這把來福槍射殺了一名企圖強姦他母親的毛子散兵。\n聯邦德國成立後，威廉成了一名郵遞員，同樣用這段話教育他的孩子，那就是“生命之於偉大，除了自己自己的家，自己的家園，什麼都不值得犧牲”。",
			"added": 1519119825
		},
		{
			"topic_id": 1367,
			"title": "那一年，李小琳高考没有上榜，",
			"body": "屈就到华北电力大学读职专，之后，匪夷所思地转到清华大学电机系读硕士。在《电机原理》课屡次考试不及格，周明德教授就是不通融，最后电机系取消该课让她过关。",
			"added": 1519439644
		},
		{
			"topic_id": 1372,
			"title": "一位機械人的感嘆：除了廠房 工廠里沒有一樣是中國製造！",
			"body": "千萬不要為我們擁有美圖秀秀之類的時尚軟件就沾沾自喜，美國一整套PRO/E正版軟件要將近8000萬元！你連安裝都不會，別說使用了，什麼是差距？ 一位機械專業畢業的學生談到，在學校就知道中國製造業不發達，但沒...",
			"added": 1519451547
		},
		{
			"topic_id": 1379,
			"title": "英美报刊：习打造21世纪极权统治西方应捍卫民主",
			"body": "中国共产党宣布准备取消国家主席任期限制后，《华盛顿邮报》、《时代》周刊、《金融时报》等西方主流报刊纷纷发表社论和署名文章指出，中共领导人习近平想打造的21世纪极权统治，这不仅是对追求更大自由的中国人的挑战，更是对全球捍卫民主和人权的人们的挑战。他们呼吁西方国家捍卫民主体系。\n\n中国星期日（2月25日）悄悄宣布了一项新的修宪建议，实际上等于允许习近平无限期地在前台领导中国。\n\n西方媒体纷纷惊呼中国从此将再次走向“强人”统治的年代。它们在担心中国人的自由受到进一步限制的同时，还担心习近平对西方民主和自由体系的挑战。\n\n《华盛顿邮报》：极权以一种新的形式在中国生根\n\n美国《华盛顿邮报》2月26日发表题为《新形式极权主义在中国生根》的社论说，一种新形式的极权正在中国生根。\n\n这篇社论说，习近平五年前上台时，西方人希望中国共产党的统治会慢慢变成一个多元和法治，但是习近平政权走向了那个愿望的反面。\n\n社论说，取消对中国国家主席任期的限制，这意味着64岁的习近平将成为终身国家主席，中国重返毛泽东之后再没有出现过的个人独裁年代。\n\n文章写到，“忘记了毛泽东灾难性统治的教训，习近平正企图打造二十一世纪的极权统治模式，并把它作为世界其他国家效仿的榜样。他的挑战不仅是针对那些追求更大自由的中国人的，更是针对全世界捍卫民主和人权的捍卫者们的。”\n\n《邮报》的社论说，虽然毛泽东和斯大林的绝对独裁失败了，但是习近平却希望在人工智能等21世纪新技术的帮助下对内统治，并通过“一带一路”在全球建立影响，并输出自己的政治模式。\n\n社论说，在习近平对自由主义的人类治理模式提出根本挑战的时候，美国这个最大的捍卫者却因总统川普似乎不相信这种模式而被束缚了手脚，在没有白宫的帮助情况下，全世界明白并担心这样一个挑战的人们应该找到办法来捍卫自由民主体系。\n\n《金融时报》：西方必须指定连贯和一致战略，防止中国的干预\n\n英国《金融时报》2月27日发表题为《习近平揽权西方需明确回应》的社评说，中国取消国家主席任期限制，对全球产生影响。文章认为，对西方来说，中国的独裁统治对西方形成了一系列挑战。\n\n这篇社评说，尽管习近平表示北京不打算向世界其他地方输送“中国模式”，但是，中国政府也提议为世界的发展中国提供“中国方案”\n\n文章说，中国的“一带一路”将为全球80多个国家提供基础设施建设，北京把这个宏大计划打造成中国为发展中国家提供的有别于西方国家的发展计划。\n\n文章说：“这样的语言应该提醒西方领导人，习近平领导下的中国是没有意愿融入‘美利坚治世’的世界秩序的。他们计划在国际交往中制定自己的办法，遵循一种他们认为优于西方民主管理方式的模式，并将其作为一种特别的发展理念来推广。”\n\n《金融时报》的文章说，这样的现实给西方提出了迫切的挑战。西方应该一起努力，制定一个连贯和一致的中国战略。这个战略强调国际投资的互惠、保护知识产权，并捍卫美欧政治体系，以防止中国干预等核心利益。文章说，习近平的强人统治之路可能还很长，西方必须做出长期的准备。\n\n《时代》：习近平的“一人统治”应该让我们所有人担忧\n\n美国《时代》周刊也发表驻北京记者查理·坎贝尔的文章说，习近平的一人统治应该让我们所有人担忧。\n\n文章援引专家的意见说，考虑到中国在全球经济和全球体系中的重要性，很难不特别强调这件事对未来中国和全球的影响。\n\n文章说，习近平在国内大肆巩固权力的同时，也是在他在国际上越来越咄咄逼人的时候。习近平的标志性的“一带一路”倡议将大大推进中国在全球的地缘政治力量，而与此同时，美国总统川普却在质疑关键的同盟关系和国际机制，而这些一直是美国称霸的基础。\n\n文章说：“习近平毫无顾忌地改写中国四十年来的政治正统，这意味着北京在国外撕毁准则时也会毫不内疚。如果北京对某些国际准则有重大的影响力，而他们又认为这些准则限制了他们的利益。”\n\n《纽约时报》：习近平敢这么做，因为没有国家公开抗议\n\n纽约时报发表驻北京记者史蒂芬·李·迈尔斯的文章说，在习近平掌控下，中国加入全球威权回归趋势。\n\n这篇文章说，习近平等人采取这种举措的原因有很多，其中包括在这个由新技术加剧动乱、恐怖主义与战争的时代要保护自己的权利和利益，另一个重要的原因是几乎没有哪个国家可以站在有力的道义或权威立场上公开抗议，最显著的是美国。\n\n《纽约时报》的这篇文章说，习近平这种做法也是世界目前流行的“威权回归”的一个例子。这些人包括俄罗斯总统普京、埃及总统塞西以及土耳其总统埃尔多安。\n\n文章援引分析人士的话说，如果三十年前，习近平这么做，国际社会纷纷表示关切：“你是在偏离正道”。但是，现在，文章继续援引分析人士的话说“如今，国际社会谁会惩罚他呢？”\n\n\n来源：美国之音\n作者：斯洋",
			"added": 1519804271
		},
		{
			"topic_id": 1380,
			"title": "李书福购买奔驰股权一天两谎：",
			"body": "1）他亲口对媒体称没用国内一分钱，但第二天就被曝光绝大部分资金来自国内福建国资。2）他宣称投资奔驰有利于引进奔驰电动汽车技术，但德国媒体曝光李书福只是财务投资，接触不到奔驰企业经营管理。李书福说谎只是为了降低舆论关注从国内调集大量国资外汇私用，海航模式。",
			"added": 1519810263
		},
		{
			"topic_id": 1384,
			"title": "张高丽的夫人名字叫邓楠。他的儿子叫张景辉。张高丽是邓小平的女婿。",
			"body": "张高丽的妻子个人档案简历资料介绍：\n姓名：邓楠\n性别：女\n民族：汉族\n出身日期：1945年10月\n出生地：出生于河北涉县，四川广安人\n父亲：邓小平，邓楠是邓小平次女\n1969年毕业于北京大学物理系物理专业。1970年至1973年在陕西汉中地区劳动。历任中国科学院自动化研究所、半导体研究所研究实习员，国家科委政策研究室干部，国家科委政策局副处长、副局长，国家科委社会发展司司长。1991年11月任国家科委副主任、党组成员。1998年4月任科学技术部副部长、党组成员，2003年9月任科学技术部党组副书记。2004年10月起，任中国科协党组书记，2004年11月任中国科协书记处第一书记，2005年1月任中国科协副主席，2006年5月任中国科协常务副主席。",
			"added": 1519913104
		},
		{
			"topic_id": 1388,
			"title": "@本帮",
			"body": "下午出门时，在楼下碰到了物业清洁工老张，我已经十几天没见他了，便很俗的向他拜个年，还虚假的地问他回农村的老家了没有。老张迟疑了一下，面色尴尬地回我：那个家回不回的也无所谓了，反正家里也没人，我们俩都上来了，打份工帮孩子按揭房子。他话锋一转，突然问我：老哥，你有没有治疗脑血拴的土办法？我听罢愣住了：你这是？老张一脸哀愁道：我儿子上个月突然给拴住了，好歹捡了条命，现在还在医院住着，每天1000多，自费呢！刚得病时，一天3000多，这已经撂进去十几万了，你说后边该怎么办呢？我慌乱不知所措，就好像我的孩子得病了似的六神无主。老张说孩子现在可以颤颤微微的站起来，医院挂着胸牌的砖家每天来给他全身敲打一下，弯弯胳膊腿就是好几百，再加上打些莫名其妙的药物，就是1000多呢。我们这一个月的工资也就够他两三天的医药费，往下可怎么办啊？我感叹道：看来还是有医保好些啊？老张说孩子在上海打工时办过医保，转不过来。但是他算了一下，却并不感觉乐观。他说：如果有医保的话，每天的医药费就会上万了，回头扣掉能报销的，自费部分跟自己现在拿的也差不多。他这么一说，我可真的懵逼了。老张患脑血栓的儿子才28岁，有个4岁的女儿。老夫妻俩已经厚着脸皮把亲戚们都借遍了。老张接着说：往下要么把孩子接回家，他负责按照砖家的把式康复，要么就把按揭的房子卖了，继续往医院扔钱，钱花光了就带儿子回农村的老家一起养老，这一切都取决于媳妇的态度。他说完话，低头把地下的一个烟头熟练地扫进簸箕里，算是跟我告别了。我望着他略显佝偻的背影，一股莫名的惆怅涌上心头：春天来了吗？好生料峭！\n儿子的病正在毁掉一个美满的家庭！",
			"added": 1519963738
		},
		{
			"topic_id": 1389,
			"title": "经济学人：中国从专制走向独裁证明西方25年看走了眼",
			"body": "经济学人杂志最新一期的封面故事指出，中共修宪使得习近平可成为中国终身领导人，中国从专制走向独裁，证明西方过去25年看中国看走了眼，“证明了对中国25年的赌注失败”。\n\n封面故事以《西方如何看错中国》为题，内容指，中共中央建议修宪，废除国家主席连续任职不得超过两届的制度，令国际社会担心中国进一步走向极权。\n\n经济学人指出，中国在提出修宪后，已经由专制（autocracy）走向独裁（dictatorship），“这不仅是中国的一个重大变化，也证明了西方对中国25年的赌注失败”。\n\n报道指，在苏联解体后，西方国家欢迎了中国加入全球经济秩序。西方领导人认为，让中国参与世界贸易组织（WTO）等机构，将能令中国遵从二战后建立的一套规则，并希望经济一体化能鼓励中国演进成市场经济，随着中国经济越来越富裕，人民就会追求民主、自由、权利及法治。\n\n文章指在胡锦涛时期，大家仍然相信西方的下注会有回报，不过习近平上台后外界开始有所质疑，“今日这种幻想已经破灭”，习近平已将政治及经济推向打压、国家控制的方向。\n\n中国虽然愿意採用部分西方规则，但亦同时发展一套自己的平行制度。一带一路正是一例，除了为了发展中国西部，同时创建了一个中国资助网络，影响所有有份参与的国家，要求其他国家採用中国的一套解决争端的方法。\n\n经济学人认为，美国总统特朗普需要重新审视对华政策，“容忍不当行为，并奢望中国会变得更好，这是不合理的。西方勉强容忍中国滥权的时间越长，将来挑战他们的危险就越大”。而为了对抗中国尖实力，西方社会应设法揭穿独立基金会及学生团体与中国之间的联系。\n\n德国时代周报（Die Zeit）出版人委员会成员Josef Joffe 指，如果习近平变成终身制主席，中国将成为真正的极权主义国家，甚至是打破“国家越富裕就越愈走向民主”的政治规律。\n\n文章指当国家越富裕，中产在收入提高的同时，也对政治参与提出越来越多的要求。但在中国这个民主化的规律已失效，“在宪法中确立的，不是自由权利，而是极权统治”。\n\n\n来源：法广\n作者：甄树基",
			"added": 1520091994
		},
		{
			"topic_id": 1393,
			"title": "中国人是世界上最恶劣的人种",
			"body": "以前大批的中国人鼓动腐败，鼓吹有限腐败可以促进经济发展，鼓吹腐败是经济发展的润滑剂。\n现在又有大批的中国人鼓吹习近平终身制可以打破传统，可以实行政治改革，可以推动民主，法制。\n这种恶劣情形只会出现在中国人之中，而且是普遍现象，这只说明中国人是一个非常恶劣的人种。",
			"added": 1520322652
		},
		{
			"topic_id": 1395,
			"title": "有啥样的民众就有啥样的监管　俄总统互联网助理打脸中国人？",
			"body": "自由亚洲电台：俄罗斯总统助理格尔曼•克里明科在专访中强调，俄政府会对互联网进行管理，但不会有中国式的封闭互联网。并评论称“有什么样的民众，就有什么样的监管”。这位俄联邦总统互联网管理问题助理还补刀说：相对于中国、朝鲜、古巴以及世界上的其它一些国家，俄罗斯的互联网非常自由，起码没有像北京那样强制要求西方国家的诸如谷歌、脸书等互联网及社交媒体公司必须屈服于他们的要求。俄罗斯人可以自由的使用浏览谷歌、脸书并在上面发表任何评论，这是中国人所没有的自由。",
			"added": 1520391775
		},
		{
			"topic_id": 1399,
			"title": "中国这种品德恶劣的家伙铺天盖地，所以全世界都讨厌中国人。",
			"body": "以前，江泽民，胡锦涛掌权时，他们推波助澜，到处鼓吹腐败是经济发展的润滑剂，到处鼓吹适度腐败可以促进经济发展。\n\n现在，他们说江泽民，胡锦涛时代产生了大量腐败。\n\n这些无耻的，品德极其恶劣的家伙们，想把责任往江泽民，胡锦涛身上一推就没他们的事了。\n\n更可恶的是，他们现在又极力鼓吹习近平专制可以给中国带来法制与民主。他们又在极力鼓吹习近平专制可以铲除腐败。\n\n中国这种品德恶劣的家伙铺天盖地，所以全世界都讨厌中国人。",
			"added": 1520409923
		},
		{
			"topic_id": 1401,
			"title": "其中说道，美国五角大楼将让中国领导人明白，",
			"body": "一旦战争升级，美国将推翻共产党的领导并消灭其军事膀臂---中国人民解放军。美国国防部这样的说法和语调是本人30年来首次听到。",
			"added": 1520430690
		},
		{
			"topic_id": 1403,
			"title": "【入党做官】",
			"body": "这批土改根子实为痞子，他们为非作歹无恶不作。他们地无一垅，田无一块。他们最具革命的冲动，在梦里都想过着地主的生活、想着地主的老婆与闺女。毛畜的土改：共党利用流氓无产者，扒手、小偷、地痞、恶棍、流民…“解放”后纷纷入党做官，成为书记、委员、主任、乡长、村长，使农村基层领导彻底恶质化…这些人自私自利，吹牛拍马，伪装积极，拉帮结派，任人唯亲欺下瞒上，惟命是从，他们能力低下，欺压百姓作威作福。这些人最怀念毛泽东时代。",
			"added": 1520558563
		},
		{
			"topic_id": 1410,
			"title": "马克思对于鸦片战争的评价：",
			"body": "看来，历史要先让这些人民全部染上毒瘾，然后才能让他们从世袭的愚蠢中醒来。真的，中国人放弃鸦片，比德国人戒掉烟草更难。",
			"added": 1520770927
		},
		{
			"topic_id": 1411,
			"title": "卢梭对中国人的评价",
			"body": "卢梭：”中国人引以为自豪的那种士大夫文明，从本质上说，如果不是脱离现实的，便是把人民培养成奴隶和乡愿的工具。你们中国的孩子不会说他们自己的语言，却会作一些几乎连他们自己也看不懂的诗。孩子们不仅没有学到区别真理与谬误的本领，反而学会了一套善于诡辩的技能，把真理与谬误搞混，使人分不清真伪。什么叫崇高，什么叫正直，什么叫谦和，什么叫人道，什么叫勇敢，他们全然不明白。\n\n卢梭针对的是自古以来的中国孩子还没有学会数数，便先学作诗。有人认为这是种族歧视！对自己这个没出息的族群进行深刻反省，这也是种族歧视，那么这个族群的内心脆弱到什么程度？！也难怪毫无建树，毫无人格上尊严。",
			"added": 1520772055
		},
		{
			"topic_id": 1415,
			"title": "牠們崇尚文革，是因為牠們在那段黑暗舊時中嚐到了人肉的美味",
			"body": "問：習近平的父親以及他的家庭在「文革」中都受過迫害，為什麼他還會這麼認同「文革」？\n答：認為受迫害的一定不認同「文革」看似有一定的道理，但實際上缺乏仔細的認證和研究，至少對習近平與「文革」的關係缺乏了解。2016年在洛杉磯開了「紀念『文革』50週年」的研討會，研討會上有一個像我這樣年齡的在美國做「文革」研究的學人，他說他最近去了毛澤東紀念堂，想看看紀念堂是什麼樣。結果他發現去的人絕大多數是像我們這樣年紀，現在都六七十歲的人。他說，我當時產生的一個最強大的感覺是兩個字：「父親」。也就是說毛澤東是我們這一代人的父親。不管你否定也好，不管你肯定也好，那是一個歷史的客觀存在。習近平就是我們那一代人，我們都是在「毛澤東思想的陽光下」長大的。比如，毛澤東詩詞我是可以大段大段背的。有趣的是在中國2013年紀念毛澤東誕辰會議上，習近平有個講話，他那個講話和胡錦濤的講話和江澤民的講話有明顯的不同是：他引用毛澤東詩詞七次。現在中國領導人講話，不大有人會引用毛澤東詩詞的，只有誰會呢？只有紅衛兵，這是我們那一代人的文風，是我們那一代人「文化大革命」時寫大字報的文風。所以雖然習仲勛是他父親，但他的精神教父是毛澤東。當時大多數人都是這樣，只不過我們現在反叛了這個父親，而習近平沒有反叛。\n\n問：為什麼他不會反叛？\n答：回答這個問題必須對習仲勛、習近平在「文革」中的遭遇有一個比較完整的了解。一個人對一場政治運動的態度，常常是要總體來看，即要看他在這個政治運動中間是得利多，還是受損多。就習近平來說，他是得利多，受損少。習近平在「文革」初期，就讀的是八一學校，北京的八一學校，是軍隊幹部子女的學校，這個學校有兩個特點，一是紈絝子弟多，一些高幹子弟在那裡不好好讀書，習近平是因為功課差才送進去的。 他和薄熙來不一樣，薄熙來讀的是北京四中，是全中國最好的中學，是考進去的。所以為什麼薄熙來看不起習近平，因為八一學校大家是靠父母關係進去的，不通過擇優錄取的考試。八一學校還有一個特點，那裡的人浮躁，喜歡用簡單粗暴的方法解決問題，「文化大革命」期間就是武鬥。聶衛平有一本回憶錄《聶衛平圍棋人生》，回憶了當年他與習近平和劉震上將的兒子劉衛平參加武鬥的事情。薄熙來是老紅衛兵，習近平實際上是紅小兵。\n「文化大革命」中他得了什麼利呢？「文革」開始不久，習近平下了鄉，下了鄉以後他在那裡當了農村的支部書記，很快工農兵推薦進了清華。進了清華以後基本上一帆風順。按照習近平的水平，能進清華嗎？「文革」前八一學校的畢業生很少能考進清華的。「文革」結束，他父親就被解放出來工作了。實際上，習仲勛在「文革」期間不是最主要的被整對象，最主要的被整對象是劉少奇這個系統的。習仲勛是高崗系統的。1955年高崗饒漱石事件，是劉少奇要整高崗，是劉少奇要整習仲勛，而不是毛澤東。「文化大革命」恰恰把劉少奇給打到了。所以，「文革」期間，習近平他們家受到的只是一般性的衝擊，沒有殘酷到家破人亡。劉少奇派系的薄熙來的父親薄一波不同，薄熙來的母親是被斗到自殺的。\n此外還有更重要的一點。薄熙來執政的時候，中國社科院政治學研究所所長房寧和薄熙來在四川有一個對話。薄熙來不是唱紅打黑嗎？薄熙來說了一段推心置腹的話。薄熙來說，我的家庭我的經歷應當和毛澤東是有仇的，但是為什麼我現在還是要搞這一套呢？我想了半天，覺得還是這一套能夠救中國。當然，所謂「救中國」云云這些都是官話都是假話，如果把這句話翻譯成他心裡話就是，還是毛澤東那一套能夠幫助我掌權，能夠實現我的政治野心。習近平也是一樣的，現在他高處不勝寒。怎麼掌權更方便呢？還是毛澤東這一套。所以我常開玩笑，要說「文革」是否真的結束了，只要看要看天安門上的毛主席像拿下來沒有。\n\n牠們崇尚文革，是因為牠們在那段黑暗舊時中嚐到了人肉的美味、鮮血的甘甜、權力的快感，於是乎牠們再也無法抗拒食人的滋味……",
			"added": 1521047744
		},
		{
			"topic_id": 1420,
			"title": "王岐山在中共内的角色到底是什么？",
			"body": "前民主党副总统拜登的儿子和前民主党国务卿约翰克里的继子一趟中国旅行，就从“渤海金控”Bank of China’s Bohai Capital 拿了10亿美元。\n渤海金控，这可是和海航一起玩转中国金融游戏规则金融杠杆的重要后门，那么王岐山在中共内的角色到底是什么？负责对海外各国政要的腐败收买利益输送-兰金黄吗？",
			"added": 1521132930
		},
		{
			"topic_id": 1426,
			"title": "用生命证明了这并不是谣言",
			"body": "老舍50年代著文批判乔治·奥威尔发表的反乌托邦小说《1984》。因小说中描述：英国搞了共产主义，所有人无时不刻受到监视，稍有异议就会被悄悄弄死。老舍称整本书是彻头彻尾的谣言，还批评英国号称哲学家的罗素竟然给这书写了序。16年后老舍自沉太平湖，用生命证明了这并不是谣言。",
			"added": 1521343861
		},
		{
			"topic_id": 1439,
			"title": "閻錫山深刻分析中共佔領大陸：共匪造亂是集歷史的超歷史的",
			"body": "什麼是集歷史的？歷史上的造亂，統不如共匪的作法之廣大巧妙，所以說他是集歷史的。什麼是超歷史？他把人民無數量的財物土地，拿上算老賬的方法收沒了，分給一部分無產的惡霸，給他們一個大便宜，使這些惡霸成了和他血肉不可分.",
			"added": 1521978218
		},
		{
			"topic_id": 1462,
			"title": "导火索",
			"body": "海伍德是谷开来贩卖器官和尸体到国外的中间商，后来他害怕出事，打算收手，就跟谷结算1400万中介费，打算拿到这笔钱就带老婆孩子回英国。但谷不认账，随起杀心灭口。谷把料理后事的任务交给了王立军。王向薄熙来汇报此事，被薄一拳把耳朵打的半聋，耳朵里面流出水来。逐导致王生叛意。",
			"added": 1522476084
		},
		{
			"topic_id": 1482,
			"title": "这是一个非常现实的民族，这种现实的背后是令人发指的极端自私、极度冷漠和极其怯弱，",
			"body": "它少有为公义而担当的勇士，更多的却是明暂保身的懦夫。当然，这种现实的背后还有苟且、鼠目寸光和更多的愚蠢。由这种族群所构成的社会，不但是靠不住的，而且也必将是不断步入深渊、一个劫难连着一个劫难的，这便是它的宿命。如果我因此而被迫选择了自私的沉默，那么看着他们坠入地狱应是对我最好的补偿。【张剑】",
			"added": 1522737294
		},
		{
			"topic_id": 1484,
			"title": "二〇〇一年，格兰仕把法国的生产线搬到中国",
			"body": "在那之前，法国人一周只工作四天，一天生产线只开六小时。\n\n搬到中国后，工人一天三班倒，每周工作七天，发给中国人的工资却只有法国人的二十分之一，甚至是三十分之一。\n\n——这个故事告诉我们，中国连朝鲜都不如，是世界上剥削最严重的国家，没有之一。",
			"added": 1522764124
		},
		{
			"topic_id": 1505,
			"title": "【周孝正：最荒谬的事】",
			"body": "言论控制和思想审查是世界上最荒谬的事情：一小帮人对整个社会怀着无限的不信任，却要求整个社会对他们的判断力和公正心怀有绝对的信任！坦荡公开表达思想的人，必须由一帮藏在暗处的人，以秘而不宣的标准和不可告人的方式进行监控审查，这是一个社会理智丧失、思想蒙昧、道德沉沦、人性懦弱的主要原因！",
			"added": 1523020978
		},
		{
			"topic_id": 1508,
			"title": "據《東華續錄·同治朝》載：",
			"body": "清同治五年1866年初，英國駐華公使威妥瑪向總理各國事務衙門呈說帖，請中國停止凌遲這種極度野蠻、不人道的刑罰。\n直到1905年，在各國的外交壓力之下，光緒帝才勉強同意不再對中國人使用凌遲、梟首等酷刑…\n然而直到今天——中國人都將這段文明開化的歷史稱之為「屈辱史」",
			"added": 1523066300
		},
		{
			"topic_id": 1511,
			"title": "中国越境绑架似乎非常普遍，并有继续扩大蔓延至全球的趋势。",
			"body": "《外交政策》说：北京正加强实施强制遣返中国。中国富商，前中共官员，异议和维权人士都成为目标。...当局借这些事件向其公民传递这样一个信息：无论你居住哪里，都不能挑战中国共产党的权威。",
			"added": 1523179235
		},
		{
			"topic_id": 1522,
			"title": "中共認為有兩種人是必須要殺掉的",
			"body": "1950年代的“鎮壓反革命”中，每個縣有兩種人一定要殺掉：一是民國的縣長，二是1948普選產生的國大代表，貴州省“解放前”81個縣的縣長，無論起義、投誠或被捕釋放，全部被殺掉了。",
			"added": 1523369314
		},
		{
			"topic_id": 1581,
			"title": "ICE掃盪違反人權逃犯 4中國人被驅逐出境",
			"body": "美國移民及海關執法局(ICE)本周在全美15個大城進行執法和驅逐作業，逮捕33名涉及違反人權罪行的逃犯，包括四名曾參與強迫墮胎的中國人，這些人都將被驅逐出美國。",
			"added": 1524206808
		},
		{
			"topic_id": 1583,
			"title": "男童走失半年 再见成“干尸”",
			"body": "王志强于2014年10月2日中午从家中走出到夜未归。当时家人找遍全城。10月4日到派出所报警。2015年4月22日，王新红看到一则信阳市救助站儿童死亡消息他立即向信阳市救助站确认。不幸的是，死者是王新红丢失半年的儿子。",
			"added": 1524299601
		},
		{
			"topic_id": 1592,
			"title": "@wuyuren：九十年代与常州柴油机厂一位厂长聊天，他告诉我一个故事：",
			"body": "常柴引进德国流水线生产柴油发动机常常出问题，来自德国的工程师检查并运来德国产发动机放会议室，安静地运行可以继续开会，而楼下打开一台常柴生产，声音震耳欲聋，德国工程师总结了一句：一样的材料一样的流水线的产品，但你们缺的是良心。",
			"added": 1524499466
		},
		{
			"topic_id": 1620,
			"title": "王歧山在共党内部放狠话说：",
			"body": "不能给百姓钱，不能给百姓脸，不能给百姓自由，他越有钱越自由越反抗。必须对他们压迫压迫再压迫，剥夺剥夺再剥夺。百姓一旦有了尊严有了自由有了钱财，就是政府的威胁，就会反抗政府。只有让百姓在穷困中，在挣扎中，社会才是稳定的，执政才是安全的。",
			"added": 1525067987
		},
		{
			"topic_id": 1621,
			"title": "习先生可曾于日理万机之余，拨冗与身边人亲口讲过：",
			"body": "“再有那年那事儿（指8964），我就杀他五千万，到时连眼睛都不眨一下”？\n\n这是中共太子党联动西纠红卫兵薄熙来习近平宋彬彬等人的本性。",
			"added": 1525068056
		},
		{
			"topic_id": 1642,
			"title": "中華民族是停滯、平庸、屈辱、充滿偏見的民族。",
			"body": "孔多塞，一位繼伏爾泰之後的法蘭西思想家。他認為：\"中華民族是停滯、平庸、屈辱、充滿偏見的民族。\"他在《人類精神進步的歷史畫卷之概述》中說：\"如果人們想知道專制政府可以將摧殘人類的技能發展到何種程度，那根本不需要提起那些可怕的迷信，翻阅什么典章，只需要看一看中國就行了......\"",
			"added": 1525584347
		},
		{
			"topic_id": 1643,
			"title": "盛世奇景",
			"body": "本週，雲南昭通，17歲少年騎摩托撞傷7歲兒童，治療預計需要五六萬元。\n他把自己全部積蓄交給醫院（七八百元）後身無分文，從醫院十樓跳下身亡。",
			"added": 1525598888
		},
		{
			"topic_id": 1677,
			"title": "全世界四千多个民族，都有人生活在美国。",
			"body": "唯有最愚昧最野蛮的中国人，曾经两度激起所有人愤怒，遭到排斥并形成排华法案。\n却很少有华人深思，这是为什么？为什么全世界各民族都厌恶华人？我们意识到自身的劣根性了吗？我们什么时候才能有现代公民意识？",
			"added": 1526261582
		},
		{
			"topic_id": 1691,
			"title": "今天习近平被美国总统描述为爱在背后搬弄是非的长舌妇",
			"body": "这种评价在国际元首届罕见，也是中国领导人在国际上荣获得的最低贱名声，载入史册。",
			"added": 1526665566
		},
		{
			"topic_id": 1694,
			"title": "他回日本後毅然的加入了日籍",
			"body": "大阪有一中國人 ，半身癱瘓只能坐輪椅 ，他在日本多年 沒有感到任何不方便 ，有一年他回國 ，在大阪進了機場航空公司就專派一個人介護他 ，他買的是經濟艙 ，檢票時特意為他開綠燈和頭等艙人一起檢票 ，介護人一直把他送到座位上，可他到了北京下飛機时，沒人來幫忙⋯後來他回日本後毅然的加入了日籍。",
			"added": 1526791581
		},
		{
			"topic_id": 1698,
			"title": "他连国家都能煽动颠覆，怎么会没前途？",
			"body": "广东惠州黄文勋，因常年举牌宣讲民主宪政，被民间誉为“举牌五君子”之一。中共以“煽动颠覆国家政权罪”判他5年徒刑，2013年入狱，刑期至2018年5月13日。国保警察对黄文勋女友张爱嘉（实名：张益琼）说：他都煽动颠覆国家政权了还有什么前途？张爱嘉说：他连国家都能煽动颠覆，怎么会没前途？",
			"added": 1526912431
		},
		{
			"topic_id": 1731,
			"title": "一个日本人说：请原谅中国人的自私奸诈",
			"body": "一个日本人在自己博客中写道：“如果你觉得中国人奸诈且自私，请你原谅他们吧！那不是他们的本意。我们哪怕遇到再大的麻烦和困难，有国家作为依靠，而他们能依靠的只有自己。所以，请原谅他们。”闻之泪如泉涌。",
			"added": 1527514601
		},
		{
			"topic_id": 1740,
			"title": "历史上“阴门阵”最壮烈的一次现身",
			"body": "1900年，义和团包围使馆区，为了对付洋人的大炮，他们组织了一帮妓女脱光衣服，把阴部对准大炮，以此来对抗洋炮，这是历史上“阴门阵”最壮烈的一次现身，因为这种阵法对洋人的大炮没有一点作用，义和团被洋人大炮打得死伤惨重，一经受挫后便开始溃退。",
			"added": 1527657351
		},
		{
			"topic_id": 1743,
			"title": "斯坦福大学博士、北邮教授阚凯力",
			"body": "今天中国社会环境之恶劣，学校里的腐败的程度，已经远远超过了80年代。所以，我现在主张在国内上完初中就把孩子送出去。我们不是为了让孩子将来成名成家，即使做一个清洁工都可以。但是，要让他做一个好人，做一个快乐的人。",
			"added": 1527694992
		},
		{
			"topic_id": 1744,
			"title": "這是真正的巧取豪奪、掠奪式積累",
			"body": "英國女王伊利莎白的家底積攢了1000年，才3.8億英鎊。歐洲各國的實業家族經營二三百年，不過幾十億英鎊。中國的首富們二三十年就身價二百億英鎊，真的是改革開放四十年走了歐美二百年的路。",
			"added": 1527701288
		},
		{
			"topic_id": 1746,
			"title": "促進宗教自由，是川普政府的優先事項",
			"body": "美國國務卿蓬佩奧在國務院新聞發布會上表示，“宗教自由流淌在美國人的血液中。正如前總統詹姆斯‧麥迪遜（James Madison）所寫的‘良心是所有財產中最為神聖的’。”",
			"added": 1527742800
		},
		{
			"topic_id": 1752,
			"title": "30年前，第一批来到中国这片愚昧封闭的大陆的就是日本人。",
			"body": "他们带来巨额援助和设备，带来了电饭锅与电视机、卡式录音机。也带来除却苏俄东欧以外的电影电视节目。从《铁臂阿童木》到《聪明的一休》，从《排球女将》到《血疑》《阿信》《姿三四郎》，从《追捕》《生死恋》到《望乡》，日本的现代文明令所有的兲朝人为之惊叹。甚至当年的兲朝喉舌为了政治的需要还天天在鼓吹着一衣带水。可惜30年后，中国只有横店摄影棚里制造的日本，持续着义和团式的野蛮与荒唐。",
			"added": 1527828341
		},
		{
			"topic_id": 1758,
			"title": "1900年，清朝政府与义和团掀起排外运动。清廷发布告示称：",
			"body": "“杀一洋人赏五十两，洋妇四十两，洋孩三十两。”在这场冠以爱国名号的运动中，200多所教堂和医院被毁，241名外国宣教士遭到杀害，其中包括53个儿童。",
			"added": 1527876340
		},
		{
			"topic_id": 1779,
			"title": "据报道国内有“兴华会”在街头张贴标语要求“平反六四”",
			"body": "报道没指明“兴华会”是在一地区还是在多地区同时张贴标语",
			"added": 1528214831
		},
		{
			"topic_id": 1789,
			"title": "普京在俄罗斯内阁会议的一次半公开讲话令世界震撼！",
			"body": "普京公开回应国际社会。普京说： “我任何时候都清楚，我们的终极敌人是谁！当然不是美国 。 ”",
			"added": 1528337030
		},
		{
			"topic_id": 1792,
			"title": "大部分中国人所感觉的“幸福”，源于两点：1，对世界的无知。2，对现实的无视。",
			"body": "",
			"added": 1528352332
		},
		{
			"topic_id": 1799,
			"title": "新戴森球公司退休董事：",
			"body": "我再告诉大家一个真相，中国地，处以上的干部，几乎没有一个人的子女不出国留学的，尤其在经济落后地区。在国内贪污做得严谨的，子女出去了就不回来了，在国外购买房产，转移资金。在国内手脚比较脏的，子女会回来，等退休后再转移资金。\n\n“中国没有真正智商和能力上的竞争”，有的只有让【领导先走】。",
			"added": 1528432203
		},
		{
			"topic_id": 1857,
			"title": "国人钻空子占便宜令日本医院忍无可忍",
			"body": "由于日本医院“先看病后缴费”制度，导致很多“外国人”（具体哪国人参考赴日旅游外国人数量哪国人最多）在日本“免费看病”，今天政府通过决议，由厚劳省调查、收集全国医疗机关欠费离境的访日游客信息，通报法务省后将其列入“禁止入国”的黑名单。 “大部分时候不是别人歧视你，而是你的同胞太没有底线”。",
			"added": 1528990446
		},
		{
			"topic_id": 1862,
			"title": "刘少奇的小学同学杨健雄",
			"body": "中共建政之后，杨生活无着，好不容易筹集了一笔路费去京，杨到处宣扬同刘的特殊关系，说我去北京找刘要一个官来做。结果他在京呆了一个月，盘缠用光了，也没有见到刘。回老家不久就被以地主恶霸枪毙了。专案组从退休的公安局长那里找到刘的亲笔指令。",
			"added": 1529057968
		},
		{
			"topic_id": 1882,
			"title": "在美国的委内瑞拉前总统查违斯的母亲，最近被美国冻结她在美的所有帐户，並把她遣送回国。",
			"body": "据说不少中共老干部开始担忧了。那位说“天安门广场没有死一个人”的袁木还能在美国安享晚年吗？",
			"added": 1529549002
		},
		{
			"topic_id": 1987,
			"title": "中共高层从上个世纪八十年代就掀起了子女移民西方运动，邓小平家族带头。",
			"body": "多数选择“两头押注，最典型习仲勋家方案：四个孩子留习近平一个人当官，其他三个移民。2000年以后，这些已移民的官二代又杀回中国敛财，财富井喷。他们一刻都没有停止过向海外转移财富，习近平”荣登“巴拿马文件就是例证。",
			"added": 1531908426
		},
		{
			"topic_id": 2030,
			"title": "这些中国人呐！",
			"body": "养不起老的在为免除外国欠债感到自豪，看不起病的在为医疗方舟无偿巡医世界感到自豪，上不起大学的在为外国人来华留学不花钱还能领到数万元助学金感到自豪，买不起进口货的在为海关高税收感到自豪，坐不起高铁的在为高铁提速感到自豪，找不到工作的在为外企被迫撤离感到自豪······这些中国人呐！",
			"added": 1533265099
		},
		{
			"topic_id": 2039,
			"title": "河北黨官單位廁所被弔死 揣著死因證明",
			"body": "",
			"added": 1533526938
		},
		{
			"topic_id": 2044,
			"title": "四川眉山仁壽縣發生一起開車沖撞派出所殺警案",
			"body": "6日上午10時許，據稱一名被追捕中的男子突然駕車沖進富加鎮派出所，砍死2名警察，包括一名派出所所長。",
			"added": 1533698372
		},
		{
			"topic_id": 2056,
			"title": "因为习近平要复制王歧山的海航，为他妹夫争取汽车市场，不惜与美国开打贸易战。",
			"body": "由此造成老家伙们的孙子辈可能被赶出美国，资产被美国没收。这个矛盾是老家伙与习近平无法调解的矛盾。这个矛盾不是一句王沪宁误导就可以调解的，也不是牺牲一个王沪宁就可以调解的。",
			"added": 1533996590
		},
		{
			"topic_id": 2069,
			"title": "‪美国国务院成立【伊朗特别行动小组】要改变伊朗恶行！‬",
			"body": "不排除海豹突击队也在其中。‬记者问：如果中共继续从伊朗进口石油，美国是否会对中共采取制裁措施？‬伊朗特别行动小组组长说：‬‪从11月4日开始，如果中共继续，美国将会采取对中共第二套制裁方案！‬",
			"added": 1534509848
		},
		{
			"topic_id": 2072,
			"title": "【中国人真的跟猪一样，智商实在太低】",
			"body": "你问问你身边的人，有没有一个知道大难已经临头？有没有一个知道自己的财富很快就要灰飞烟灭了？有没有一个知道共产党要你“共克时艰”的含义？知道不知道是要你的财富来度难关？有的只是在发“中国梦”的傻逼，有的只是要干倒美帝的白痴。",
			"added": 1534689319
		},
		{
			"topic_id": 2084,
			"title": "美國參眾兩院以壓倒性多數通過了特朗普的外國投資審查更正法案",
			"body": "該法案其中一條是不允許設有共産黨党委書記的公司在美國的一切投資活動。這意味著將來像中興，華為，中移動，等等國企要全面徹出美國市場。這個會是比貿易战更影響深遠。",
			"added": 1535263235
		},
		{
			"topic_id": 2091,
			"title": "美国右翼媒体华盛顿时报发表文章鼓吹中美断交外交战略",
			"body": "最终将中美关系降格到1972年尼克松的水平-完全隔离。这个文章对中共政府的定性是\"不可调教\"用当年的纳粹德国来对比。这个信号非同寻常,可能意味着贸易战比想象得更加猛烈。",
			"added": 1535634690
		},
		{
			"topic_id": 2092,
			"title": "重磅：又是参议员馬可·魯比奧,准备提出法案",
			"body": "要求中国政府必须同意美国相关机构去审查和监管和审计在美上市的中国公司财务,否则将逐步清退所有在美上市公司,以保护美国的投资者。这个消息对阿里巴巴等一批制造虚假关联交易制造业务数据,哄抬股价的大陆IT公司来说,绝对是灭顶之灾了。",
			"added": 1535690952
		},
		{
			"topic_id": 2110,
			"title": "【美媒披露：美国官员曾密会委内瑞拉军方人士探讨政变】",
			"body": "美国多家主流媒体在周六报道，由美国总统特朗普领导的现政府曾数次与一些，反对委内瑞拉总统马杜罗的委军方代表举行秘密会晤，以听取他们推翻马杜罗政府，发动政变的计划。",
			"added": 1536515340
		},
		{
			"topic_id": 2118,
			"title": "美专栏作家、前中情局副局长Michael Morell近日在华盛顿邮报发文称",
			"body": "美国成功地紧急应对了9/11事件，现在必须战略转移，紧急应对中共威胁；他认为至关重要的是，美各政治派系要加强合作，制定和实施一项长期综合计划来应对北京挑战，如对此毫无准备，美将付出比9/11事件更沉重的代价。",
			"added": 1536813175
		},
		{
			"topic_id": 2124,
			"title": "共产党是通过部署大型常规军队而不是通过全国各地爆发叛乱来击败国民党",
			"body": "此外，他们的军队主要由苏联装备，主要从农民征兵，而不是踊跃的志愿者。事实上，在整个内战期间，在敌后，并没有一次是自发的亲共的民众叛乱，即使在1940年代末中共即将取得完全胜利时。",
			"added": 1537068729
		},
		{
			"topic_id": 2136,
			"title": "为什么我愿意，自己的孩子在西方成长？",
			"body": "因为从客观角度看，一个孩子长大以后成为一个普通百姓的几率是最高的，作为一个普通人，生活在西方要比生活在中国要好得多。因为在西方，上层社会只是比普通百姓拥有得更多，而在中国，普通人无论从肉体到思想，都被上层社会所拥有。",
			"added": 1537682475
		},
		{
			"topic_id": 2141,
			"title": "【如果你在美国找到任何中国宣传员，请告诉FBI】",
			"body": "根据“共产党控制法”（68 Stat.775,50 U.S.C.841-844），他们犯下了一项犯罪行为，将被处以最高10,000美元的罚款或五年或两者的监禁。",
			"added": 1537844178
		},
		{
			"topic_id": 2144,
			"title": "美国众议院委员会将在本月27日就中共残害宗教召开指控听证会！",
			"body": "焚烧圣经，摧毁教堂，关押百万新疆穆斯林等种种恶行。对外侵略来源于对内镇压。此次听证会重点讨论习近平邪恶思想及动机。还有，美国如何用强有力的手段来对付这种邪恶！",
			"added": 1537870019
		},
		{
			"topic_id": 2150,
			"title": "【西方专家要求用极权国家来形容中共国】",
			"body": "伦敦国王学院中国专家Ringen教授近日发公开信，呼吁西方的中国分析人员为中共党国正名，要求用极权国家来表述中华人民共和国，因为它具有一切极权主义特征，是彻头彻尾的极权；他认为名不正，分析则不清。这个提议很有意义，西方亲共学者政客常用软性词汇掩饰中共政权性质。",
			"added": 1538109014
		},
		{
			"topic_id": 2161,
			"title": "1905年，孙中山在伦敦拜访晚清的西学先驱者严复。",
			"body": "严复说：“以中国民品之劣，民智之卑，即有改革，害之除于甲者将见于乙，泯于丙者将发之于丁。为今之计，惟急从教育上着手，庶几逐渐更新乎！”可惜孙中山说自己是实行家，结果辛亥革命后的历史果如严复所言。",
			"added": 1538671927
		},
		{
			"topic_id": 2172,
			"title": "【习近平家族成员坐拥香港豪宅】",
			"body": "香港苹果日报爆出习近平家族在港拥有物业，市值达6.4亿港元。 本台记者造访其中一个物业，位于香港顶级富豪集中地浅水湾。翻查香港土地注册处资料，该物业在2009年以港币1亿5千万成交。业主名字是张燕南，持有香港身分证。这个名字跟习近平外甥女同名同姓。",
			"added": 1539185942
		},
		{
			"topic_id": 2178,
			"title": "如果您因言获罪，请不要害怕。",
			"body": "保存好拘留和处罚决定书，以行政诉讼名义复印全部材料。并搜集决定拘留您的分局局长个人及家人详细信息，把以上资料送到美国移民局或美国驻华使领馆，让他的全家永远别想进入美国。如果他的家属移民美国就更好了，他的财产将被永久冻结，他的家属将被遣返中国。",
			"added": 1539457146
		},
		{
			"topic_id": 2185,
			"title": "抓人、关人的，是渌口镇派出所副所长。",
			"body": "10月16日，株洲县育红小学三年级某班的27岁年轻女教师，被渌口镇派出所的几个警察，直接从教室带走，在审讯室里，被关押了7个多小时，下午三点左右才被放出。事情的起因是，班里的一个女孩因为迟到，老师让她在教室前面站了几分钟。\n\n没想到，这孩子很快给妈妈打电话，妈妈又给孩子爸爸打电话，孩子爸爸立刻开着警车，带着警察，闯进学校，将老师带到派出所。先说录口供，但只问了句“你知道我是谁的爸爸吗？”就将老师关了起来，然后，不闻不问。",
			"added": 1539886046
		},
		{
			"topic_id": 2202,
			"title": "父亲到死想不通",
			"body": "母亲说我出生的时间比预产期晚了十天，要不是我家那头老母猪，我还不一定能出来。当时我母亲正在猪圈里扫猪屎，挺着大肚子扫得很累，就撑着猪圈的石板墙想歇一歇。老母猪过来亲她的腿，她提起脚赶猪，没想到老母猪一抬头顶了她一下。老母猪这一顶，把我顶到了臭烘烘的猪屎堆里。母亲说，老母猪从来没这么顶过她，是不是它有意帮你快点出来呢？\n\n我生下来没有多久，老母猪就死了，据说是吃了我的胎盘，吸了母亲的经血。母亲说，我生下来时好奇地盯着看老母猪，好像我们认识似的，看得老母猪直往后退，不敢抬头，过几天就死了，死得莫名其妙。我后来想，我是不是来到这个世界顶替这头母猪的呢？这头母猪是不是我的前身呢？几十年过去，我发现我原来其实就是一头猪，或者说我是一头披着人皮的猪，过去的生活其实跟在猪圈里的生活没有什么两样。\n\n母亲说，我生下来时，有一天时间既没哭又没笑，眼睛冷冷的、呆呆的，不知在看什么。我母亲吓哭了，对着我的小屁股，打呀掐呀，我还是不哭，直到半夜父亲回家，我才哇的一声大哭起来。这一哭就哭到大天亮。\n\n我母亲并没有因为我终于活着来到人世而高兴，也没有因为我是一个儿子就高兴。其实当时母亲的眼里满噙着泪水。她用牙咬断缠在我身上的脐带，抓猪草清理自己的下身，然后坐在猪圈里发呆。老母猪吃完了母亲清理下身的猪草，舔食了猪圈地上的乌血，拱了母亲一下，母亲才回过神来，抱着我回家。\n\n我长大后问母亲，为什么要生我呢？母亲很无奈地说，没办法呀，那时也没实行计划生育。母亲说得非常难过，我听了也很不痛快。要是我老是呆在母亲肚子里不出来，要是母亲根本没有怀过我，要是母亲怀上我又把我打掉，总之，要是这个世界上没有我该多好，我也不会活得像一头肮脏的猪了。\n\n我现在不恨那头把我顶出世的老母猪了，我也不恨生我养我的父亲母亲了。我的父亲母亲并没有一点错。他们不但没有错，还生我养我，于我有大恩大德，我应该感谢他们才是。而且，如果没有以前像猪一样的生活，现在我哪能奋斗到大学副教授的身份，活得这么轻松自在呢？有人说，人的一生，幸与不幸是一半对一半，把不幸的日子过完，幸福就来了。\n\n我出生那天，母亲后来说，天热得把衣服脱光都不能解暑，太阳就像被泼了一盆经血，红得让人难受，红得让母亲看哪里都是红圈圈，都是猪圈里的经血，现在想想还要呕吐。母亲那天抱着我冲回家，一股脑儿地喝了五大瓢冷水还是感到热。母亲老来四肢酸痛，处处是毛病，一喝冷水就犯吐，我想跟那时喝冷水有很大关系。\n\n我当时确实不乐意出生，我母亲也不高兴我出生。当时父亲正站在生产队的批斗会，五花大绑着，低着头，曲着腰，接受着别人的教育。汗水在父亲的身上像虫子一样爬着，最初痒得令人想笑。虫子在身上爬多了，痒得久了，又难受得要命。父亲在口水、石子、讨伐声中蒸了大半天，直到太阳下山了，月亮上来了，别人轮番讨伐渴了、累了、饿了，才得以回家。父亲疲惫地走进屋，还没等母亲告诉他家中又添了一个讨饭的，就已重重倒在床上。\n\n父亲这一躺，正好躺在我身上，我哪受得了这一压，哇的大叫起来，母亲听到哭声才终于挤出一丝笑意来。父亲一惊，望我一眼，面无表情地朝一边一倒，又睡去了。\n\n我出生在一个地主家庭，这是我出世之前就已经意识到并且不愿意出世的原因。我一出生就注定要像猪一样生活，难怪我一出世，我家那头老母猪就死了，它不愿看到我一个大活人居然活得像它一样，它已预知到我将来的人生……\n\n生在地主家庭就是地主子女，上小学就不能带红领巾，在各种各样的表格上家庭成分一栏中就得填上地主。直到现在，我对地主一词都非常敏感，只要一提它就浑身发紧，神经紧张，惶惶不安。按说，地主子女仍然是人，不是狗，是人就应该平等。出身在地主家庭也不是谁愿意还是不愿意的事，父母是地主，跟他们的子女有什么关系呢？就算父母犯罪犯法，受处罚的应该是父母，而不应株连他们的子女呀。何况我的父亲母亲并没有犯罪违法。他们只是在大家都很穷的时候，自己富得快一点而已。谁不愿意日子过得好一点呢？然而在那种荒谬的时代，想过好一点也是有罪的。\n\n我的父亲母亲，甚至父亲的父亲母亲，我的爷爷奶奶，为了买那五十亩地不知流了多少汗水，节约了多少日子，吃了多少顿咸菜下苞谷稀饭，才终于攒到那么一罐袁大头。我的父亲母亲，甚至我的爷爷奶奶，既不偷也不抢，勤俭持家，乐善好施，连叫花子上门讨饭，自己不吃也要赏一碗，这样的人家在现在说应该评五好家庭呢。他们认为，我们靠劳动吃饭，不多言不多嘴，在哪朝哪代，不管当官的怎么换，不管哪个党执政，都应是正大光明的、坦坦荡荡的良民才是。\n\n父亲以前是个石匠，成年累月在外给人修房造屋，节省得吃碗羊肉汤都舍不得，一心想着买田置地，等结婚生子后让一家人日子过得宽裕一些。我母亲过门后，房修了地买了，日子照样过得紧巴。爷爷奶奶、父亲母亲节约成习惯了，有了点钱以后照样舍不得吃舍不得穿。母亲说，要是那时舍得吃舍得穿，吃了穿了，被判个地主富农，心里也还踏实些。既没吃成又没穿成，就被判成地主，土地被没收，房产被瓜分，时时刻刻被监督劳动，大会小会上挨批挨斗，父亲母亲、爷爷奶奶不甘心呀。爷爷奶奶伤心呀，后悔呀，哭呀，气呀，解放没多久就去世了。\n\n父亲在弥留之际还喃喃自语，为什么同样是共产党，四十年前不让人富，四十年后却鼓励人富呢？都是富，都是想把日子过好一些，为什么命运就相差十万八千里呢？为什么那个时候是错的现在却是对的？为什么靠劳动挣钱在那个时候就有罪而现在却是一件光荣的事？父亲至死也没想通。\n\n父亲背着枷锁过了半辈子。在生产队，别人不愿去修公路，让他去修；别人不愿在大雨中去守庄稼，守汽车，让他去守；别人不愿挑两百斤重的担子步行十几公里去缴公粮，让他去挑；别人不愿在大热天挑粪上山，让他去；别人早早睡了，让他每天晚上写思想总结，写交待书；天寒地冻的时候，别人在温暖的家中休息，让他去公社政治学习，接受人民政府的教育。\n\n父亲曾对母亲说，他做这些事的时候总在想，难道想把日子过得好一点真的是错的？难道大家都没钱、都穷就好吗？有一天，父亲似乎想通了，突然对母亲说了一句：“钱哪，魔鬼。”母亲莫名其妙地望着父亲，可他再没说话，一声接一声地叹息。\n\n父亲并没有想通，他还在为他的土地、房产惋惜。我们全家也都想不通。我的姐姐考上初中却不能读，哭得死去活来也没用，别人骂她赖蛤蟆想吃天鹅肉。她想不通，一头栽到古井里，再也没爬出来。姐姐死了不要紧，让全村人喝不上水，破坏社会主义建设才是罪不可赦。我的父亲母亲为此事在生产队的祠堂前罚跪两天两夜，当然免不了挨口水、石子、鞋掌子甚至巴掌。我们家的祖宗也被骂了不知多少遍，直到花钱重新掏了一口井才了事。\n\n我的哥哥，一个小时候聪明可爱的孩子，淘气、外向、仗义、不服输，经常被人打得鼻青脸肿，受的气最多，吃的苦最多，长到该成家的年龄却娶不到老婆，不得不入赘到大山里去，过着食不果腹、衣不遮体的生活。相比之下，我胆小，不多言不多嘴，不惹事不生非，骂不还口，打不还手，可还是没少挨打受骂。我曾有近二十个绰号，至今还记得一些，如屎斑鸠、苦檀神、地主仔、四类分子、屎弹子、周扒皮、刘文彩等等。\n\n命运把我变成了一头冷漠、自私、孤独、玩世，人见人嫌的肮脏的猪。我已经习惯脏猪一样的生活，而且常常自认为就是一头猪。在没人的时候，有时我学猪的嘶叫，甚至学着猪的样子拱地上新鲜的泥土，嗅一嗅土里别样的气息。做这一切的时候，我发现自己很开心，很痛快。我经常做梦，梦见自己变成一只活蹦乱跳的猪崽。我在睡梦中曾夜游到猪圈，被母亲从猪圈里拉回床上睡觉。这一切我浑然不知，直到后来我上了大学，带着女朋友（现在的妻子）回家，母亲把它当笑话讲给她时，我才知道。\n\n我母亲对我的女友说，我是猪变的，是猪精哟。我的女友看着我，笑得前翻后仰。我后来偷偷问我母亲，我真的在猪圈睡过？母亲没说话，眼泪直往外涌。\n\n我大学毕业，做了大学老师后，父亲才得以找池塘钓钓鱼，谦卑地接受乡人的招呼。他去世前经常对我说：“人要节欲。还是穷了好，钱这东西生不带来死不带去，要那么多干什么？”我知道，父亲话虽然说得通达，实际上他心里仍然没有想通过去一直没想通的事。原因是我入赘到大山里的那位哥哥，承包了几十亩山地，种水果发了，成了远近闻名的大款，可我父亲却怎么也不愿意踏进我哥哥的家门，甚至还当着全家的面，骂我哥哥不从他那里吸取教训。\n\n然而直到父亲去世，我哥哥也没有被揪斗，而且日子越过越红火，桑塔纳买了两辆，刚上高中的女儿被送到美国念书。我父亲把我哥哥骂了，打了，哥哥仍然不听，继续发家。父亲到死也没弄明白，为什么他不能想把日子过好一点而我哥哥却可以想，不但可以想，而且可以大胆做，没有谁把他怎么样。\n\n（选自《黑五类忆旧》第三期，2010-09-01）\n\n来源：黑五类忆旧\n作者：杰弗瑞",
			"added": 1540602236
		},
		{
			"topic_id": 2208,
			"title": "1962-65年，某国为输出革命公然办起红色恐怖组织训练营",
			"body": "1962-65年，某国为输出革命公然办起红色恐怖组织训练营，对外名称叫BJDX国际共产主义运动讲习班。乔森潘，德钦巴登顶，尤素福阿吉托罗甫，是同班的三大学霸，毕业后成了三大屠夫。",
			"added": 1540632027
		},
		{
			"topic_id": 2216,
			"title": "加拿大駐中國大使麥家廉表示：",
			"body": "在中國改善人權之前，加拿大可能不會與中國達成貿易協議。人權觀察指，有100萬維吾爾人被拘禁。麥家廉透露他最近跟其它國家的駐中國大使討論過中國對待人權的態度，他對中國政府能否改變其人權政策抱持悲觀的態度。",
			"added": 1540826359
		},
		{
			"topic_id": 2217,
			"title": "【一場追尾事故引爆網絡 網民留言直指中共活摘器官黑幕】",
			"body": "據新浪、網易、搜狐、人民網等大陸門戶網站報導的同一條消息，10月19日，滬蓉高速鎮江段發生一起轎車與客車追尾的輕微交通事故。警察到達事故現場後，追尾轎車上的一名男子主動告訴他，在其所乘坐的轎車後備箱裡，裝有一個器官轉運箱。箱裏裝有兩個剛從南京某大型醫院移植的活體腎臟器官！這兩個活體腎臟器官，急需要送至蘇州大學附屬第一醫院進行器官移植手術，必須分秒必爭。",
			"added": 1540826455
		},
		{
			"topic_id": 2225,
			"title": "你妈的，中华文明就是一个吹牛皮的文明。",
			"body": "长江以北，黄河以南，这片产生中华文明的贫困地区，为什么2000年来一直要追求大一统？这个地区的人为什么不想想如何改变自己生存的环境？为什么他们不想着让自己生活的好一点？ 2000年的历史，外部的人看他们就像疯子一样，整天你打我，我打你，没停过。 \n\n梁家河那个穷地方，也在长江以北，黄河以南这个贫困区域内。明明是穷的要死，却吹有什么大学问，还想走到世界舞台中心。 你妈的，中华文明就是一个吹牛皮的文明。",
			"added": 1541070270
		},
		{
			"topic_id": 2312,
			"title": "史密斯在《中国人的性情》一书中说",
			"body": "“中国人有着与骡子一样固执的性格，还有独特的屈从能力。 他们好比竹子，优雅，用途广泛，柔软易折，且中空，东风吹来，它弯向西。西风吹来，它弯向东。没有风时，它挺立不动。中国人并不缺智慧，不缺忍耐、务实和乐天的性格，他们真正缺少的是人格和良知。”",
			"added": 1542796798
		},
		{
			"topic_id": 2336,
			"title": "导致美国国会全票通过排华议案",
			"body": "美国在建设铁路时，各个族裔的工人工作一天十美元，唯独华人要求一天五美元，有的甚至要三美元，而且是自愿放弃休息日和工伤待遇，完全把自己贱卖。只要有华人的地方，其他的族裔就别想有工作干，华人的恶性竞争引发举国不满，导致美国国会全票通过排华议案。这段历史直到今天，依旧是中国的反美教材。",
			"added": 1543323402
		},
		{
			"topic_id": 2342,
			"title": "《讲一段真实的故事》",
			"body": "有一年，大约是九十年代中后期，我去南方的一个著名城市开会（为了模糊处理后面的信息，这里不说城市的名字）。会议期间安排参观一个著名的寺庙。有两件事让我出乎意料，甚至倍感震撼，至今难以忘怀。一件事是寺庙举办的文艺演出。出乎意料之外的是演员全是清一色的年轻貌美且气质高雅的尼姑。演出的节目竟然是英语话剧。虽然听不懂，但是英语之流利，发音之纯正，让所有与会者倍感震惊。据说，这是某佛学院的尼姑大学生。第二件事是我与一位英俊潇洒的年轻和尚的对话。一位甚至可以称之为美男子的气质超群的和尚，我好奇的问他，这么帅气的小伙子，为什么出家当和尚？他的回答直率得出乎意料：因为社会太黑暗。我说什么事让你这么认为？他说他是东北辽阳人，由于家庭发生突然不幸，考大学时受刺激，发挥失常，没有考好，差7分没有录取。我说不要说差7分，就是差1分，不录取合情合理，无可厚非，应该理解，应该平静。他说这个道理他懂，他对此没有意见。我问，那么对什么有意见？他说有几个家庭背景过硬的，差17分，27分都录取了。我半天无语。我突然好奇地问道：进入寺庙后，脱离了红尘俗世，感觉如何？他的回答绝对百分之百出乎我的意料：寺庙更黑暗！我急不可耐地问他：何出此言？他说，中国唯一不审计的单位就是寺庙。寺庙的香火钱无计其数。没有任何财务规章制度。香火钱的分配，全看你与方丈主持的关系。你没有看到他们都开高级进口轿车，出入高级酒店与会馆，生活花天酒地吗？没有任何机构监管他们，不仅没有人监管他们，他们的头上还有许多耀眼的光环。许多香客信众，还对他们顶礼膜拜。最后，他感叹，中国之大，竟然没有净土。",
			"added": 1543678795
		},
		{
			"topic_id": 2353,
			"title": "美中贸易谈判让我想起了100多年前中国民营企业挂日本旗，英国旗。",
			"body": "要是90天内能谈成，中国民营企业不是又要挂美国旗，日本旗，英国旗，德国旗了？\n还是黑格尔说的对啊，中国历史就是不断地重复。",
			"added": 1544088974
		},
		{
			"topic_id": 2362,
			"title": "从伊朗的情况看，三胖与美国僵持真的没有意义。",
			"body": "伊朗全国各地都在抗议示威，毛拉政权肯定会倒台，而且时间不会久。三胖现在就应该完全去核，让美国来拆除核设施，导弹设施，与美国换两套配电站设施。从中国，俄罗斯输入电力需要配电站设施。",
			"added": 1544555006
		},
		{
			"topic_id": 2390,
			"title": "中共镇压宗教自由 美议员：全球都应谴责",
			"body": "【大纪元2018年12月29日讯】（大纪元记者吴英编译报导）图尔松（Mihrigul Tursun），29岁维吾尔女子，在11月28日的国会听证会上说，在中共劳教所中遭到电击时，“我恳求上帝结束我的生命”。她三次被中共关押，逃离中国后于今年9月抵达美国首都华盛顿。\n\n美国会议员说，在中国有成千上万宗教信徒，和图尔松一样遭到中共迫害，全世界都应站出来谴责中共镇压宗教自由，包括对法轮功的打压。\n\n美国联邦众议院资深议员史密斯（Chris Smith）27日在《华盛顿邮报》发表专文说，对西方社会来说，这是一个“令人震惊的事情”，但是在中共一党专制体制下，这是“司空见惯的故事”。\n\n“中共威胁宗教自由，全世界不能忽视在那里所发生的事，我们都必须站出来反对这些侵犯人权的行为。”史密斯写道。\n\n文章说，半个世纪前，中国共产党发动了给中国社会带来灾难性影响的文化大革命，目标之一是消灭宗教。自此，中共一直没有放弃全面控制或摧毁宗教团体的意图。中共担心宗教信仰的力量会挑战其共产党执政的合法性，并且试图将宗教彻底地转变成该党的奴仆，采取被称为“中国化”（sinicization）的严厉政策。\n\n在“中国化”之下，所有宗教和信徒都必须遵守并积极地促进共产主义意识形态，否则将无法在中国生存。\n\n史密斯说，中共为了达到它的目的，在中国的宗教信徒遭到骚扰、逮捕、监禁或折磨，只有屈服中共者才能幸免。此外，包括《圣经》在内的宗教书籍被焚烧及教堂被毁。\n\n中共现在更变本加厉，颁布新规定要求宗教领袖在他们的礼拜场所安装面部辨识监视器、限制在线的宗教表达自由，以及禁止18岁以下者参加宗教仪式。\n\n据报导，中共官员还在重新编写包括《圣经》在内的宗教书籍，删除无神论共产党不想要的内容，并且为中国的基督徒启动了一项为期五年的“中国化”计划。\n\n史密斯指出，中共近期镇压宗教的努力波及了成千上万的人。最近几个月，新疆维吾尔自治区超过100万维吾尔族和其他穆斯林被拘留在所谓的“再教育营”，并且遭受酷刑及被迫放弃信仰。据报导，美国政府正在调查被关在拘禁营中的少数民族是否被迫生产出口到美国的货物。\n\n中国估计有1,000万到1,200万天主教徒。梵蒂冈对中共镇压宗教自由的反应令人不安，其似乎正在寻求一种妥协方式。9月，梵蒂冈官员签署了一项“临时协议”，容许中共当局有权力选择可以担任中国主教的候选人，再由教皇做最后的审查。\n\n香港退休主教陈日君（Zen Ze-kiun）9月时表示，这项交易是“梵蒂冈的完全投降”，并且是对信仰“令人难以置信的背叛”。\n\n史密斯在文中敦促梵蒂冈重新考虑与中共达成的协议，并指出为了反制中共领导层对宗教的镇压，美国和欧洲国家都已谴责中共，其它重视宗教自由的国家都应团结起来，谴责中共对穆斯林维吾尔族、基督徒、藏传佛教徒和法轮功学员的迫害。\n\n他说，他与参议员卢比奥已经敦促川普（特朗普）政府援引《全球马格尼茨基法案》（Global Magnitsky Act）制裁严重侵犯人权的中共官员，并且要求扩大对警察监视产品的出口管制，以及对因强迫劳动或拘留维吾尔人而获利的企业实施制裁。\n\n此外，史密斯及卢比奥提出《维吾尔人权政策法案》（Uyghur Human Rights Policy Act），并获得两党议员的支持。\n\n川普总统于12月19日签署《西藏旅行对等法》。根据该法，美国对于那些阻止美国人进入西藏的中共官员，可以对等地禁止他们入境美国；此外，国务卿应在90天内评估美国公民进入西藏的程度，并向国会提交一份报告。\n\n“根据这项法律，美国向北京发出强烈信息，即它需要遵守国际人权准则，而不仅仅是贸易”，国际声援西藏运动主席梅卡奇在其网站上发表声明说。\n\n责任编辑：林妍",
			"added": 1546164353
		},
		{
			"topic_id": 2391,
			"title": "蓬佩奥将出访巴西 与新总统结盟对抗中共",
			"body": "【大纪元2018年12月29日讯】（大纪元记者吴英综合报导）有“热带川普”之称的巴西新当选总统波索纳洛（Jair Bolsonaro）下周二（2019年1月1日）正式上任，美国国务卿蓬佩奥将率团出席他的就职典礼，并与其商讨对抗中共掠夺贸易行为的对策。\n\n美国国务院一名官员告诉媒体记者，国务卿蓬佩奥计划在下周一（12月31日）率团出访巴西及哥伦比亚，预计周二参加巴西新当选总统波索纳洛的就职典礼，并与其会面讨论双边贸易与投资议题，以及北京在南美洲的“掠夺性投资及借贷”问题。随行者包括美国国际开发署署长马克·格林（Mark Green）。\n\n该国务院官员说，中共在巴西的投资并未使该国受益而且违反公平贸易惯例，蓬佩奥将告诉巴西人民，美国和巴西在对抗中共方面具有共同利益。\n\n“我们都关心中国和中国进入其它国家市场的方式。然而，中国（中共）在积极进入他国市场时，通常不会想到要增进该等国家人民的利益。”他说。\n\n他强调，美国非常乐意与中国公司公平竞争，“我们想要的只是一个公平竞争的环境”。\n\n对于巴西新总统波索纳洛计划将该国驻以色列大使馆从特拉维夫迁往耶路撒冷，该国务院官员表示欢迎。\n\n以色列总理内塔尼亚胡（Benjamin Netanyahu）亦将出席波索纳洛的就职典礼，蓬佩奥将与其会面，这是美国总统川普（特朗普）决定自叙利亚撤军以来，美以两国首次官方会晤，以色列担心美国的撤军将扩大伊朗对该地区的影响力。\n\n这也是蓬佩奥第四次出访拉丁美洲，此行的另一个重要任务是联合在该地区的盟国对抗委内瑞拉。委国总统尼古拉斯·马杜罗（Nicolás Maduro）下个月开始为期六年的新任期，西方国家称委国之前的总统选举是非法的，马杜罗“将权力移交给自己”。\n\n本月稍早，马杜罗指责美国在波索纳洛和哥伦比亚总统伊万·杜克（Iván Duque）的帮助下策划了要推翻他的政变。\n\n由于经济困顿，马杜罗此前访问莫斯科寻求俄罗斯的支持，俄罗斯最近在委国部署了两架超音速轰炸机。蓬佩奥大力抨击，称俄罗斯和委内瑞拉的人民应该看到了这两个腐败的政府在人民承受苦难时，依旧“挥霍公共资源及压制自由”。\n\n该国务院官员拒绝透露美国是否准备与委内瑞拉断绝外交关系。\n\n根据哥伦比亚总统办公室发表的声明，蓬佩奥下周三（1月2日）将与该国总统杜克会谈，“继续加强双边关系，以及讨论委内瑞拉独裁统治引发的危机”。\n\n在恶性通货膨胀导致食品和药品短缺的情况下，大量委国人民逃到哥伦比亚。\n\n目前还不清楚蓬佩奥是否会与参加巴西新总统就职典礼的洪都拉斯总统胡安·奥兰多·埃尔南德斯（Juan Orlando Hernández）会面。川普总统28日发推文称，美国将切断对洪都拉斯，危地马拉和萨尔瓦多的援助。他说：有消息说，洪都拉斯正在形成新的大篷车车队，而这些国家对此“束手无策”。\n\n责任编辑：林妍",
			"added": 1546164459
		},
		{
			"topic_id": 2392,
			"title": "雷颐： 改开40年改革已死 清朝覆亡前两次改革教训",
			"body": "按：在今年“改革开放40周年”大会上，中共并没有如预期提出新的改革举措。大陆的知识份子及中共体制内人士都普遍认为“改革已死”，并对中国的前景感到焦虑与悲观。120年前，清朝开始了两次变法，均告失败，这其中有什么相似之处呢？\n\n政治体制是治理国家的基本制度，当一个国家的经济、社会状况发生根本性变化时，政治体制也要相应改革，不然就会制约、延缓经济和社会的发展。然而，由于政治体制改革是统治者的“自我改革”，尤其涉及统治者的重大利益，所以阻力巨大、困难重重。面对这种局面，改革者的策略往往是先易后难，想以非根本性的行政体制改革代替根本性的政治体制改革，多少弥补明显已不合时宜的政治体制之弊。这种思路自有其合理之处，不过，晚清两次以裁撤无用政府机构与冗员、将功能相近部门合并成几大部门的“行政改革”，并冀以此代替“政治体制改革”的实践，结果却是你死我活的政坛恶斗，先是光绪被囚、康有为逃亡，后是袁世凯几被围殴、慈禧甚至想要跳湖，均以失败告终。这两段“行政改革史”，实在是引人深思。\n\n第一次行政改革是戊戌变法期间的“变官制”。正是行政改革的“变官制”，成为镇压维新的戊戌政变的直接导火索。\n\n众所周知，维新派的兴起肇因于只要西方的坚船利炮、回避西方政治制度的洋务运动的失败。因此，他们提出政治体制改革才是国富民强之道。虽然他们对近代宪政民主的理解不尽准确，他们的主张也有种种矛盾含混之处，大体而言，在真正开始维新变法的百日维新之前，建立君主立宪制是其基本政治纲领。但就在他们鼓吹“开议院”、“兴民权”的同时，又对中国此时的国情民情能否立即实行宪政也不无怀疑，进而认为“凡国必风气已开，文学已盛，民智已成，乃可设议院，今日而开议院，取乱之道也。”1898年初，翁同龢等五大臣代光绪帝问康有为“宜如何变法”，康答曰：“宜变法律，官制为先。”梁启超也曾明确提出“变法必先变官制”这种行政改革优先、行政改革导入政治体制改革的思路。\n\n百日维新期间，维新进入实际操作，康有为等人的主张更加谨慎、现实，绝口不提君主立宪等政治体制改革问题。康有为在呈给光绪皇帝的《日本变政考》中明确提出现在开国会、立宪法为时过早，“中国风气未开，内外大小多未通达中外之故”，“民智未开，遽用民权，则举国聋瞽，守旧愈甚，取乱之道也”，他甚至主张“乾纲独断，以君权雷厉风行”。对于谭嗣同等少数“激进派”开议院的主张，康有为也“以旧党盈塞，力止之”。\n\n在第一次被光绪皇帝召见时，康有为建议“就皇上现在之权，行可变之事”，力主行政改革的“变官制”，而不是政治体制改革。其行政改革的主张也非常谨慎，甚至被批评为“保守”。其主要内容是“勿去旧衙门，而惟增置新衙门；勿黜革旧大臣，而惟渐擢小臣；多召见才俊志士，不必加其官，而惟委以差事，赏以卿衔，许其专折奏事足矣”；强调要“存冗官以容旧人”。他后来上折，提出了分别“官”、“差”的具体措施。“官”即官位，高官虚位让老臣旧官去做，使老官僚仍稳坐官位，不减俸禄，以减少他们的反对。“差”即差使，地位虽不如官高，但经办具体实事，所以重要差使一定要委派“才能”、即维新派人士担任。他认为许多不合时宜、已经无用的旧部门虽应裁撤，但如果现在裁撤必将激化矛盾，“今行之非其时也”，“稍革一二”非但无裨于事，反而会因此坏事。\n\n所以，百日维新期间光绪皇帝颁布的新政主要是经济、军事、文教方面的改革。在行政改革方面主要是启用了一些新人、新设了农工商总局，对行政改革起关键作用的“制度局”却因守旧派的强烈反对根本未能成立。他们原计划“既立制度局总其纲，宜立十二局分其事”；这十二局是法律局、度支局、学校局、农局、工局、商局、铁路局、邮政局、矿务局、游会局（专管游学与学会）、陆军局、海军局。\n\n虽然不撤旧部，但旧部官僚当然明白自己的实权将因新部之设而大打折扣，旧军机大臣怒曰：“开制度局是废我军机也！”表示宁可悖忤皇上圣旨，制度局也“必不可开”。一时“朝论大哗，谓此局一开，百官皆坐废矣”，京师甚至谣传康有为欲“尽废六部九卿衙门”。军机处和总理衙门干脆以“不必更立名目，转滋纷扰”为理由，拒绝开制度局。这些“旧臣”得到紧握实权的慈禧太后的坚决支持，根本不把“日日催之，继之以怒”的光绪皇帝放在眼中。设立制度局的主张，终成一纸空文。最终，只成立了个农工商总局。\n\n由于新设制度局遭到旧部群臣的坚决反对，而各项“新政”又需费孔急，朝廷财政一直困难，左支右绌，于是光绪皇帝只能不顾康有为不撤旧部的意见，谕令内阁，裁撤詹事府、通政司、光禄寺、鸿胪寺、太仆寺、大理寺六衙门，归并到内阁及礼、兵、刑各部办公。外省裁撤湖北、广东、云南三省巡抚，以总督兼巡抚事。裁东河总督，所办事宜归河南巡抚兼。各省不办运务之粮道，向无盐场仅管疏销之盐道及佐贰之无地方责者，均着裁汰。此令一下，朝野震骇，以为此举“大背祖宗制度”，皆请慈禧太后保全，收回成命，甚至有老臣在慈禧面前伏地痛哭。所裁衙门奉旨后“群焉如鸟兽散”，如太仆寺的印信、文卷立刻无人过问，甚至门窗都被拆毁无存，犹如经历了一场浩劫，以此作为对裁撤的抵制、抗议。\n\n简言之，百日维新的行政改革，主要就是启用了一些新人、设立了农工商总局、裁撤了部分闲散衙门这三项。然而，这些行政改革也使从京中的许多内阁大学士、军机大臣、六部尚侍，到地方上的一些督抚、将军大表反对，他们集结在慈禧太后周围，“不谋而同心，异喙而同辞”，使慈禧的政治力量空前强大。一些守旧大臣最终上书慈禧，请太后“训政”。在强大的旧官僚群体支持下，慈禧终于发动政变，对光绪痛斥道：“九列重臣，非有大故，不可弃；今以远间亲、新间旧，徇一人而乱家法，祖宗其谓我何？”表明了对“改官制”的愤怒之情，随后立即将百日维新期间“皇上所裁詹事府等衙门及各省冗员”悉数恢复，还恢复了被裁的广东、湖北、云南三省巡抚，而将新成立的农工商总局废去。\n\n所谓“维新”，在政治方面其实只是非常有限的行政改革，而且因触犯既得利益集团终以失败告终。\n\n几年后，立宪与革命这两个运动风生水起，渐成大潮，迫使慈禧也不得不宣布要实行政治体制改革的“新政”，并于1906年9月1日宣布预备立宪。而且，仅仅过了五天，即9月6日就颁布了改革官制上谕。显然，无论真假，慈禧这次也想走行政改革为先、政治体制改革在后这“先易后难”的“路线图”。\n\n这次改官制的要角，是掌握北洋大权，同时在中央兼参预政务处大臣、督办商务大臣、督办邮电大臣、会办练兵大臣等数项重职的袁世凯。自戊戌政变后，袁世凯深得慈禧信任，同时他以巨金贿买了实权在握的领衔军机大臣、庆亲王奕，而他在北洋的新政又颇有政绩。此次朝廷谕令包括袁世凯在内的十四位王公大臣共同制定改官制的方案，袁虽排名最后，但他因有奕支持，同时在负责官制改革机构“编制馆”的关键岗位安插自己的党羽，编制馆的所有文件起草和建议方案最后都要由他阅定。\n\n经过一个多月的准备，由袁主导的官制改革方案出台。由于是为立宪预备，所以对官制的改革较为全面。除合并了一些不太重要部门外，还将原来的内阁、军机处、吏部、礼部、都察院全都撤销，而新成立的机构则有资政院、行政裁判院、集贤院、大理院、审计院等，而最重要的，是成立新的、大权在握的“责任内阁”以取代军机处。袁世凯与奕议定，由奕出任未来的内阁总理大臣，他任副总理大臣，各部大臣由总理大臣推荐，内阁尤其是总理大臣、副总理大臣代替皇帝负责任，皇帝发布谕旨须经内阁副署，若未经内阁副署则不发生效力。这样，皇帝的用人和行政大权统归内阁手中。袁氏想掌中枢大权之野心，几不掩饰。\n\n此案一出，官场风波顿起，众臣几乎群表反对。反对主要来自两方面。一方是以军机大臣铁良、荣庆等为主角的满族亲贵。取消军机处，尽管他们可能另外任职，但权力毕竟要大大削弱。而且，袁有王公、贝勒、贝子等不实际干政，待上议院成立后让他们充当议员的设想，也使这些公、子们愤怒异常。在一次会议上，醇亲王载沣竟拔出手枪直抵袁世凯胸前大声说：“尔如此跋扈，我为主子除尔奸臣！”经奕调解，方才作罢。由于传说内务府也要裁撤，所有太监都要裁去，有次袁世凯下朝时百余名太监将他团团围住大声谩骂，有的甚至挥拳要打，几成围殴之势。袁世凯招架不住，急忙大呼奕过来为其解围。经奕百般劝解，并保证绝不裁撤太监，这些太监才愤愤而去。\n\n另一个主要的反对力量来自以瞿鸿禨、岑春煊、王文韶、赵炳麟等为要角的汉族大臣、御史。他们有的一直与袁争权，有的对袁结党营私愤怒已久，有的认为改官制是“用夷变夏”，有的则反而认为这次改制完全虚假。有人上折慈禧指出，袁世凯的“责任内阁”实际为少数一二总理大臣专权，也就是袁世凯专权，而外国君主立宪国的责任内阁之所以不能专权是因为有议院监督、限制，中国议院一时恐难成立，所谓“责任内阁”既不对皇上负责又不对议院负责，只是统揽了过去皇帝的权力。“立宪精神全在议院，今不筹召集议院，徒将君主大权移诸内阁，此何心哉！”还有人指出，袁之所以在没有成立议院时先成立使皇帝居于无权地位的“责任内阁”，主要考虑是一旦慈禧去世，光绪复出，也无法报戊戌之仇。光绪就曾当面对袁冷冷说道：“你的心事我全知道。”袁则不敢答话。\n\n这样，从王公亲贵、大小太监到大臣御史，尽管观点不同，但几乎全都反对袁世凯的改官制，不是到慈禧处哭诉哄闹就是不断上折，天天鸡飞狗跳。向来杀伐决断的慈禧此时居然也寝食难安，向人诉苦道：“我如此为难，真不如跳湖而死。”\n\n袁世凯可能过高估计了慈禧对自己的信任，在慈禧召见时竟然面奏要求朝廷令守旧大臣退休，结果招致慈禧怒斥，并将参劾他与奕劻的弹章交二人同看。此时，袁才知道自己已成众矢之的，局势非常险恶，慌忙以检阅新军南北秋操为名请调出京，以避锋芒。\n\n袁世凯离京后，慈禧命令其余厘定官制的大臣继续制定改革方案。11月6日，朝廷发布裁定中央官制上谕，少数旧部被裁并，但多数未动，只是改名，军机处仍旧保留而不设责任内阁。最重要的是，在实际所设十一部的十三个大臣、尚书中，满人占七席，汉人仅占五席，蒙古一席，以“满汉不分”的名义打破了“满汉各一”的旧例。虽然以前的“满汉各一”也是满人掌实权，但毕竟在形式上满汉平衡，汉族官员心理上更易接受。形式上的“满汉平衡”被打破，汉族官员的心理平衡也随之被打破。几年后，辛亥革命爆发，不少汉族督抚宣布独立，可能与此不无关系。\n\n这次官制改革，各路权贵、官员你争我夺，种种矛盾更加尖锐、激烈，导致政坛严重分裂。而且，还使人对清廷是否真准备立宪大起疑心，甚至有立宪派直斥其为“伪改革”，“徒为表面之变更”，“袭皮相而竟遗精神”，“竭数月之改革，迄今仍是本来面目，政界之难望，今可断绝”。远在日本东京的梁启超当时写信给康有为说，清廷宣布准备立宪时革命党力量即减弱，而官制改革一出，革命党势力便迅速扩张，也说明了这次行政改革的效果与清廷初衷正相反。事实无情地说明，这次行政改革完全失败。\n\n晚清这两次本想以行政改革推动或导入“宪政”的政治体制改革实践的失败，适足促人“逆向思维”：原以为行政改革只是局部性变革，阻力肯定要小于全局性的政治体制改革，当更容易，其实未必。行政改革将使某些部门和部分官员受益，而另一些部门和部分官员受损，受损部门和官员的抵制、反抗必然十分强烈。甚至保持原待遇不变，也不足以抵消无权的损失，对官员来说，权力大过一切，要裁撤一些部门和一些官员自然难上加难、难以执行。争斗的激烈程度，可能并不小于政治体制改革。而实行宪政的政治体制根本性改革是对从上至下政府所有部门、所有官员权力的监督限制，由于大家都“待遇平等”、一同受“损”，官员们的不满和反抗反可能会相对小得多。在宪政框架下，最高掌权者的权力也同样要受限，其他官员当更无话可说。但近代以来，清王朝一次又一次想以并无实效的行政改革代替政治体制改革，殊不知成本和代价其实更高；而最高的成本和代价，则是耽误了政治体制改革的时机而导致自己垮台。\n\n编辑：李广松😎日期：12-30\n来源：KZG\n作者：雷颐",
			"added": 1546190194
		},
		{
			"topic_id": 2397,
			"title": "恐遭报复 最高法法官发不自杀声明",
			"body": "【看中国2018年12月31日讯】（看中国记者黎小葵综合报导的）中国大陆爆出疑似司法黑幕。中国最高法院法官王林清30日公布一段自拍视频，讲述他多年前承办陕西省一桩价值千亿人民币的案子时，卷证资料竟离奇“失踪”，而办公室内的监视器也“同时故障”。他认为案件不单纯，特拍下这段视频免遭不测。\n\n12月30日流传出的这段王林清视频，他首先在视频中说明，他想透过将这段视频发给各大媒体，以保自己免遭不测，并留下一些证据。\n\n然后，他叙述起曾于今年2月被中央电视台报导过的，陕西榆林凯奇莱公司和西安地质勘查院的合作勘查合同纠纷案。他表示，他负责这起案件，案件发生在2003年，“当我写判决书的时候，我打开工作柜，准备拿出一审卷、二审卷的时候，我突然发现，厚厚一摞子一审案卷都在，而二审的一本正卷和一本副卷竟然不翼而飞了。”\n\n他说，“当时就懵了”，因为案件重大，他紧张得四处寻找，后来苦寻不得，只好向程姓庭长报告。\n\n程庭长得知后叫他回去再好好找找，他想了想，请庭长帮忙调取监视器，庭长前往警卫室调录影带，但回来却告诉他，监视器坏了。王林清在视频中说，“我一听，就感觉这个事情非常地蹊翘，监视器怎么可能说坏就坏，而且都是才刚安装的监视器。且我的办公室外有两个监控，坏了一个也不可能两个都坏。”\n\n王林清所说的陕西矿权争议案曾多次有过报导。简单说就是，陕西政府原本和“凯奇莱”公司签订合作开发契约，但在发现陕西山区蕴藏超过15亿吨煤的井田后，地方政府反悔，硬称这份合约无效。双方为了矿区所有权缠讼十多年。\n\n期间，凯奇莱的营业执照一度被撤销，凯奇莱法人代表赵发琦于2011年8月19日遭到榆林市公安局抓捕，在看守所关押133日。\n\n《中国经营报》引述多名知情者的消息称，2016年11月下旬，凯奇莱法定代表人赵发琦实名举报陕西省委原书记赵正永等人干预该案，之后，该案的二审卷宗在法官办公室内“丢失”。\n\n2017年12月，几经周折，中国最高法院判处凯奇莱胜诉”结案，同时要求西安地质勘查院支付凯奇莱违约金1365万人民币，凯奇莱不得上诉。\n\n如今王林清自拍的这段视频，让这起案件再度浮上台面。\n\n对此，前央视主持人崔永元也在微博发文质疑，“是外人盗走的？还是自己人干的？”网友也纷纷觉得事情不单纯，“连最高法院的法官都得采用非常规途径，绝望吗？”\n\n另有网友感慨说，“一个大法官都怕，小民何以？”“一个最高院的大法官都要发影片以防不测，看来这个案子水很深。”\n \n而最高法院第一时间斥责相关事件是谣言，但后来又改口声明，该法院将启动调查程序，疑似因舆论压力太大而不得不展开调查。\n\n公开资料显示，王林清，山东烟台人。先后毕业于烟台大学、北京大学和中国政法大学，分别获法学学士学位、民法学专业硕士学位和商法学专业博士学位，为中国社会科学院金融学博士后、中国人民大学经济学博士后，系中国政法系统首位“双博士后”。\n\n现任最高人民法院二级法官，兼任北京大学硕士研究生导师、教育部人文社科重点研究基地中国人民大学民商事法律科学研究中心研究员。",
			"added": 1546225665
		},
		{
			"topic_id": 2398,
			"title": "美中关系新变数：宗教",
			"body": "2018年12月31日\n美国之音\n\n在美国与中国在贸易和地区安全等问题上的纷争相持不下之际，两国关系再添新变数。\n\n专门报道政治问题的美国新闻杂志《政客》星期天（12月30日）发表报道说，宗教自由正在成为特朗普总统跟北京对抗的一个重要性正在增长的主题，而这一主题与美国的基督教领袖们合拍。\n\n在今年10月发表的有关美国对中国政策的演说中，彭斯副总统警告说，中国已经成为美国的一个危险的竞争者。虽然他演说的重点是中国的贸易政策和网络间谍活动等话题，但他也谴责了坚决奉行无神论的中国共产党。他指出中共政府拉倒十字架，焚烧圣经，监禁信徒。他说，“对中国的基督徒来说，眼下是危难的时代。”\n\n彭斯副总统在讲话中也谈到了中国当局对中国的佛教和伊斯兰教信徒的打压。\n\n《政客》杂志的报道说，本月中国当局抓捕中国知名的基督教牧师王怡和他的教会100多名信众得到美国基督教福音传教派媒体的广泛报道。几天之后，特朗普总统的国际宗教自由大使布朗贝克谴责中国当局对宗教信徒的镇压，并表示自彭斯副总统发表有关中国问题的演说以来，人们对宗教自由问题的担忧“只是进一步增加”。",
			"added": 1546239379
		},
		{
			"topic_id": 2400,
			"title": "茅于轼指美中根本分歧在于政治制度",
			"body": "美国与中华人民共和国建交40周年前夕，中国知名经济学家茅于轼接受了美国之音专访。茅于轼指出，美中之间的根本分歧在于政治制度不同。他认为近代以来，美国帮助中国颇多，但毛泽东时代中国百姓被引导反美。茅于轼说，现在情况发生了很大变化，中共领导人和大批中产阶级以上家庭将子孙送到美国留学，羡慕美国，另一方面，两国政治制度不同，中共担心自身政权不稳，因而美中关系“好不到哪去”。茅于轼表示，美国发起贸易战，是要迫使北京遵守贸易规则。\n\n茅于轼：说中美关系，我觉得全世界的列强，英美法德意日，美国对中国是最好的。美国没有侵占中国的土地，当然有一点赔款，后来退给我们了，办了协和医院和清华留美基金，所以美国对中国是最大的恩人，就是打败了日本。要没有美国扔两个原子弹，国民党打不过日本人。\n\n但是在毛泽东时代，他组织了几十次，还不止十几次，几十次全国性的反对美国的大游行。这个造成的影响是中国底层文化比较浅的人就认为美帝是中国的头号敌人。当然现在这个情况有很大变化，现在哪怕是最基层的人这样想的也不太多了。因为事实上中国很羡慕美国，中国中产阶级以上的人都把孩子送到美国去留学。这个很具体的说明了，中国向往美国，而且是跟美国友好的。\n\n今天的情况跟毛泽东时代很不一样。当然毛泽东为什么要反对美国呢？他不是不知道美国帮助中国打败了日本，但是他始终觉得，他所主张的专政跟美国的民主法制是对立的。他很怕中国人向往美国，否认他的政权。\n\n我们领导人的孩子也在国外念书嘛，所以中美关系应该说是比较正常。但是两个制度，经济制度的不同，还是很大的障碍。那中国的老百姓来讲，当然都希望我们有一个民主的社会，不是无产阶级专政，而且把这个希望看成美国就是我们的目标，这个情况是越来越明显了。\n\n所以我觉得中美表面上的贸易战打不下去的，当然有可能我有别的目标，我宁可对自己有损害，我要达到别的目标。现在我看中美的贸易战，主要还是美国认为中国不守规矩，我要制裁你，哪怕我自己受点损失，我也要制裁你。以后你守规矩了，那我们都好一点。\n\n中国和美国的矛盾，说到底是政治制度不同，互相都有看法。英国和美国，或者加拿大、澳大利亚跟美国，他们也有些摩擦，但不是政治制度的不同，他也不会担心你会颠覆我。但是中国和美国的关系是不一样的。\n\n中共害怕的是老百姓都喜欢美国的制度，对自己政权的稳固造成影响，这个是最根本的矛盾，其他都是小事。就好像美国、加拿大、澳大利亚也有矛盾，那都是小矛盾，但中美矛盾不是小矛盾，是大矛盾，根本制度上的区别，彼此都有戒心。那些（西方）国家之间没有戒心的，它是技术上的问题。我们这个问题不一样，所以中美关系好不到哪去。\n\n（根据电话录音整理，受访者观点不代表美国之音）",
			"added": 1546240107
		},
		{
			"topic_id": 2402,
			"title": "加拿大前驻华大使：我们必须认清楚中国的真面貌",
			"body": "加拿大前驻华大使马大维（David Mulroney）在加国报章地球与邮报以《我们必须认清楚中国的真面貌》为题撰文指出，中国为了孟晚舟一事报复，使两名加拿大人康明凯和斯帕沃尔失去自由，做法残酷却并非罕见，因为北京过去已多次以同样脆弱的借口，扣留过澳洲、英国和瑞典的国民。\n\n马大维指出，由中国违反伊朗制裁令、利用华为等企业窃取外国技术到践踏自己国家和外国公民的权利，让人们越来越清楚地认识到，中国是一个越来越不负责任的大国和伙伴，一个为了对自己有利而讹称遵守国际准则的国家。\n\n从2009至2012年出任驻华大使的马大维在文章中指出，长期以来我们应对一次又一次中国危机所采用的方法，都是在事后尽快恢复常态，但对中国的所为，却无任何足会伤害中国脆弱的感情，或促使其改变行为的言行。\n\n马大维说：“是时候需要一个新常态了。”\n\n在文章中，马大维指出，尽管美国总统特朗普一贯地用笨拙和令人沮丧的手法介入孟晚舟事件，声称如能帮助他在与中国的贸易谈判中取得更好的交易，愿意干预案件，但加拿大不应视美国和中国在道德上是对等的，与中国相比，加拿的利益和价值观与美国更为一致。\n\n马大维指出，特朗普的行为可能令人震惊，但他在美国受到政府部门、媒体和公民社会的有力制衡。然而，中国国家主席习近平拥有无上权力，他的说话在中国就是法律。\n\n马说：“我们的注意力经常很快就从关于中国强硬和压逼的新闻，转到那些描写中国的闪亮城市和超级富豪的故事，无法看到中国整体情况。”\n\n文章又指出，加拿大不能忽视中国，也不应该不尊重中国，但需要考虑在与北京打交道时，是否要看中国如何参与基于规则的国际秩序，还应该与盟国磋商，以便更好地保护政府和私人机构的敏感技术，更有效地抵御中国对民主政治制度的干预，以及更有效地促使中国在国内外尊重人权。\n\n马大维说，虽然加拿大政府目前最迫切的是要求中国释放加拿大公民，但事件也为加拿大创造了一个展示领导才能的机会。\n\n作者 香港特约记者 甄树基 31-12-2018",
			"added": 1546260334
		},
		{
			"topic_id": 2403,
			"title": "王炳章预感自己有生命危险",
			"body": "在中国狱中已经度过16年的王炳章向家人表示，他感觉自己有生命危险。中国现在威权专制越发厉害，又正遇上孟晚舟事件，王炳章在加拿大的弟弟王炳武说，家人很担心王炳章的安危，希望外界能为王炳章祷告。\n\n王炳武接受专访表示，王炳章的大女儿圣诞节前往监狱探视王炳章，他向女儿表示，感觉有生命危险。\n\n“王炳章亲自告诉他的女儿，他在监狱中有预感自己有生命危险。他特别说万一自己有什麽不幸的话，不是来自他的身体上的问题，不是健康问题，因为他的健康状况还是良好的，也不是来自监狱的管理人员，所以这点我们就不太清楚，我哥哥他在意味着什麽。”\n\n王炳武说目前无法得知更多信息，只能等着哥哥来信，看是否能多透露一些蛛丝马迹。通常王炳章写了家书後至少要三丶四个月才能送到，而且都是经过审查後才寄出的。\n\n正值发生孟晚舟事件，美国丶加拿大丶中国外交关系紧张，过去美加两国政府早已多次呼吁中国要释放王炳章，是否在此敏感时刻，导致王炳章生命出现危机感呢？王炳武说，是会因此更担心，但他不能就此把这些事情联系在一起。\n\n中国民主团结联盟发出声明关注王炳章境况，提到在被判处无期徒刑的彭明在监狱中不明原因猝死後，杨天水及刘小波又因长期关押迫害罹患不治之症辞世，王炳章的健康及生命安危更受关注。呼吁各界通力合作要求中国善待王炳章，让他平安归来。\n\n王炳武也表示，虽然营救王炳章多年无果，但家人从未放弃，深深感谢许多人长年来的支持关怀，并强调王炳章与他们一家人都是虔诚基督徒，相信神的守护，祈愿大家继续为他祷告。\n\n“我急切地丶迫切地要求听众能为我哥哥祷告，因为其他事情我相信我们做不了什麽。我本人也是基督徒，我相信通过祷告，通过神，王炳章会得到安慰，总有一天他会重见天日。”\n\n王炳章1982年获得加拿大麦吉尔大学医学博士，1983年创建海外第一个民运组织「中国民主团结联盟」，其後不断推展中国民主运动。2002年他在越南遭绑架至中国被逮捕，随後中国当局以在台湾从事间谍活动和领导恐怖组织的罪名判他无期徒刑，但台湾方面明确否认。16年来，王炳章一直都被狱方单独关押。\n\n2018-12-30\n记者:柳飞  责编：饶怡明  网编：景铭",
			"added": 1546261225
		},
		{
			"topic_id": 2407,
			"title": "两个北交大的学生",
			"body": "昨天，在北交大采访试验室爆炸事件。爆炸发生时，有三个孩子没能逃出来，一位博士，两位硕士。\n\n学校官网通告，院长免职，教授停止教学工作，配合调查。我和另一个年轻女记者去了他们生前所在的学院。教学楼大厅有宣传栏，我拍了照片。\n\n一对年轻的男女正好站在旁边，非常警惕地盯着我们。过了一会，他们气势汹汹地靠近，怒目圆睁，大声质问，“你们是什么人，为什么在我们的学校乱拍乱逛。\n\n我觉得诧异，对他们的情绪惊讶，大学是公共资源，本应该是自由之地。”你们是谁？这些宣传也，贴在这，就是公开的呀。“\n\n”我们是这里的学生！你们是谁？“\n\n”我们是记者。来采访试验室爆炸的事情。“\n\n”谁同意你来采访的？你的证件呢？“\n\n”难道不是先介绍你们的身份吗？况且，你们以为有资格查记者的证件吗？“\n\n男的大怒，非常失礼地暴跳如雷，”你们别走，我马上报警。“\n\n旁边的年轻记者害怕他一拳打过来。我说，不要害怕，让他报警，事情闹大了，刚好可以看见学院的领导了。\n\n旁边的女学生也非常愤怒地看着我们，”你们来找谁？你们的证件呢？谁同意你来了？\n\n其实，我觉得根本没必要跟这两个人纠缠，不过，他们的思维和用语让我想起文革里的年轻人。我毕业很多年了，对在读大学生的精神世界已经陌生了。我很好奇，想看看他们的反应会如何进行下去。\n\n“我想找你们的院长，不过你们的官网说他已经被免职了。如果，你们仅仅是学生，请找个老师下来吧。”\n\n那个男的，冲到我面前，把眼睛都瞪到极限。他像锅上蚂蚁，不停在我身边走，继续拨打电话。他们堵住了我们去电梯上楼的路。\n\n从旁边走出一个女的工作人员，拿着手机一直对着我们拍摄。\n\n后来，几个中年女老师从电梯下来。男学生和女学生非常愤慨地走过去，“这里有两个傻逼记者。”\n\n女教师把男学生拉近，“宝贝，你不是说去洗澡吗？\n\n她们一群人走进电梯，女教师回头白了我们一眼，”年纪轻轻的女孩，干啥不好呢？！“\n\n我们等着下一辆电梯，刚才那个女的工作人员跟着来。到了七楼，一个男的行政人员从办公室走出来，我问他关于官网的通告。他一开始态度很强硬，直接让我们离开，按了电梯。我没看电梯，转过身，大声斥骂他，”三个孩子都死了，你们就这样若无其事地赶记者。我来了你们交大采访，没看到你们对生命有基本的怜悯，你能让我感觉到，你对死者有一点难过吗？刚才，在一楼，两个自称学生的人，看到记者就是要赶我们走，要报警。你们的学生和老师，就这样对待这个事情吗？”\n\n他眼睛红了，泪水在眼眶里，一直没流下来。电梯来了，我们没进去，他也没坚持。就那样，站着说了十几分钟。我告诉他，北交大，无论师生，对遇难的孩子们，都不应该冷漠。生命在此，犯不着用官僚的政治思维去对待。\n\n后来，离开的时候，我想起2015年哈佛大学的学生们游行。我家的楼顶一直盘旋着直升飞机，警察在路边守卫，学生们在马路上满腔热血地表达。学校是学校，学生是学生，个体的独立思想，自由灵魂，在某个国度真的是缺乏土壤。不过，年轻人，在大学校园的年轻人，竟然异化至此，我真是始料不及。\n\n作者: 罗洁琪",
			"added": 1546269120
		},
		{
			"topic_id": 2408,
			"title": "习近平一生只接受过七年时间的正规教育(高新)",
			"body": "本专栏的上篇文章《习近平口误是水平问题，口吃就是健康问题了》的最末一段已经提示过了因为习近平最新一次的“口误“连连，外界媒体从习近平的“实际文化水平”再一次质疑起他的“清华博士学历”。从本篇开始，笔者将用系列文章依据在中国大陆“合法”资讯平台上或公开出版物中也大都能够查找到的公开信息，从习近平早年的真实基础学历一直介绍和分析到他的“清华博士“学历的真伪。\n\n只要对习近平的“文化和学历背景“稍有关心的人士都可能已经 知道，与同龄的众多”共和国红二代“一样，习近平的基础学历是从著名的高干子弟学校”北京八一学校“开始的。016年9月9日，习近平曾教师节之际到他的母校北京八一中学（文革前的原名是“北京八一学校”）“光宗耀祖”，被中共官媒连篇累牍地高调宣传了好一阵子。\n\n一篇《夜读：北京八一中学是怎样一所学校》的官媒文章介绍说：北京八一中学的前身，是成立于1947年的晋察冀军区荣臻学校。这所学校的初衷，是把随军的妇女、儿童集中组织、保护起来，使我党我军干部的子女有一个安全健康的成长环境，为将来新中国的建设培养人才。1947年3月1日，“荣臻学校”正式开学，当时设有小学部和幼稚园。此后，晋察冀军区机关、部队、晋察冀边区政府、中共中央直属机关，附近军政单位的子女陆续入学。1949年，晋察冀军区荣臻学校开入刚刚解放的北平，更名为“华北军区八一学校”。学校选择在原清朝礼亲王府、同仁堂乐松生花园旧址建设。新中国成立前后，各路解放大军，南下的、西征的、开赴祖国边疆的，以及调入中央和中央军委领导机关的大批干部年幼的孩子，均选择在“八一学校”读书。\n\n荣臻学校建校初期，主要是考虑解决晋察冀军区机关、部队子女，同时也包括干部供养（随军）的弟妹、侄辈、孙辈的入学、入托问题。然而，进城后荣臻学校（八一学校）迅速变成全党、全军子弟小学是始料不及的……。当时党和国家领导人和军队高级干部包括毛泽东、周恩来、朱德、任弼时、陈云、邓小平、彭真、董必武、李富春、习仲勋、张闻天、薄一波、刘澜涛、滕代远、吴玉章、徐特立、谢觉哉、彭德怀、贺龙、徐向前、叶剑英、粟裕、黄克诚、罗瑞卿、谭政、肖劲光、王树声、许光达等的子女亲属，也都在这所学校入学。解放军各总部、各军兵种、各大军区的领导干部的子女，还有国务院各部委、北京市、地方省委的领导干部子女全往里挤。孩子进入“八一学校”似乎已经成为一种“福利待遇”。八一学校管理严格，师资优秀，教学质量高，条件待遇优越，共和国的精英们纷纷将自己的后代放心地托付给这所学校。\n\n该官方介绍强调说：在实行供给制的年代，据说唯有八一学校的学生是享受排级供给标准。\n\n这里所说的“排级供给标准“，指的是当时的军队干部中各级军官的粮食和服装供给标准的初始级。按照当时的中共军队官衔制度，班长是所谓的“兵头将尾“，编制上与士兵无异，排长才算”干部“。也就是说，当年包括习近平在内的所有八一学校的”子弟“们都是吃喝穿，拉撒睡等生活和学习的全部开销，都是和军队干部一样，”国家包干“------现在的新名词叫”国库供养“。\n\n习近平还在读小学期间的1964年，八一学校由北京军区政治部移交北京市教育局，并更名为“北京市八一学校”，至于如今的名称“北京八一中学“是“北京市八一学校”在“文革“初被解散，日后又被”复校“才取的新名字。该文章还特别介绍说：这里还需要一提的是，当年的“八一学校”具有很大的包容性。有一部分犯有严重错误甚至罪行的干部，他们的子女同样可以在学校正常的学习和生活，丝毫没有受到歧视。这就是为什么1962年习仲勋被“打倒“之后，习近平仍然被允许继续留在该校，直到”文革“初该校被解散为止。\n\n当时官媒的这篇详细介绍文章发表时还特别配发了一张习近平本人提供的照片《1979年3月1日。习近平和当年的老师同学一起回到学校，参加庆祝建校32周年活动》，照片中的围绕一位貌似老师的一群年轻男性中的大部分都是穿军装戴军帽。习近平本人则是一件当时流行的草绿色军大衣和一顶与之相配的军绿栽绒棉帽。从照片时间上推算，当时的习近平的清华大学“学业“已近尾声，距他自己也成为”现役“军人的时间还有三至四个月的时间。\n\n和大部分当年八一学校的红二代一样，习近平“文革“前也是住校生。习近平2016年以总书记之尊再回“母校“的官媒阿谀文章之一《“老学长”习近平重回八一学校，有哪些少年回忆?》介绍说：习近平现身校园内第一站就奔向了图书馆内的校史展。这里珍存着大量的学校老档案，也记载了“老校友”习近平的童年和少年岁月。在馆内一幅学校上世纪50年代的平面图上，习近平认出了当年的礼堂、餐厅，甚至是他住过的宿舍楼。看到自己的学籍档案、与老师同学的合影，他感叹“非常怀念”。八一学校党委书记牛震云说，习近平对八一学校校史的了解，甚至超越了她这个研究校史的负责人。\n\n习近平的初中语文教师陈秋影曾在接受媒体采访时回忆，1965年秋季，习近平刚升入初中时，和他的一些小学同班学友都进入一(四)班学习。在班里，习近平的年龄稍小。\n\n说起来，1953年6月出生的习近平，按照中国大陆人正常的入学标准应该是七岁入读小学一年级，而按照他当年老师的回忆，1965年12岁进入初中，说明他习近平是6岁入读小学。他日后的中学同班同学聂卫平等人都是年长他一岁。\n\n聂卫平日后公开出版的个人回忆录中对习近平颇有着墨。他回忆说：在我的一生中，曾经遇到过四次险情。第一次还是在1968年，几月我记不清了，那时中学的红卫兵已经分化成好多派，有四三派、四四派、老红卫兵、联动、逍遥派等等，各派之间经常发生一些“派仗”。我本身属于逍遥派，对那些活动基本上不参加，最多是凑个热闹。这时我们班分来了两个学生，一个叫习近平，一个叫刘卫平，他们原是八一学校的，后八一学校因所谓“高干子弟学校”被解散，他们才被分到我们二十五中。习近平是习仲勋的儿子，他爸爸当时可是有名的大“黑帮”……。当时班上的人都看不起我们，也不敢沾我们，我们也看不起他们，但是和校外的老红卫兵联系很多，这主要是习近平和刘卫平的关系。\n\n一位当年在北京与比近平初中高一届的“老红卫兵“日后撰文回忆说：实际上，从1965年底开始，学习氛围就有所变化。在中学生中普遍流传的《青年报》、《中学生》等报纸刊物就紧跟不辍地转载人民日报社论及其他对《海瑞罢官》和“封资修意识形态”的批判文章。而学校里各门学科的课程则越来越“边缘化”了，政治学习开始猛增，用上课时间全校听广播，听社论，听重要文章，还时不时地传达文件。\n\n……1966年6月13日，中共中央、国务院批转教育部党组《关于改革高级中学招生办法的请示报告》，“废除现行现行高级中学招生考试办法，实行推荐与选拔相结合的办法招生”，“推荐与选拔必须突出政治，贯彻党的阶级路线”。同一天，中共中央、国务院发出《关于改革高等学校招生考试办法的通知》说是，”高等学校招生考试办法“基本上没有跳出资产阶级考试制度的框框，不利于贯彻执行党中央和毛主席提出的教育方针，不利于更多地吸收工农兵革命青年进入高等学校。这种考试制度，必须彻底改革。”\n\n五天后，人民日报全文发表了这两个决定，并发表社论《彻底搞好文化革命彻底改革教育制度》。社论说，改革招生考试制度是“彻底搞掉资产阶级教育路线的一个突破口。我们将从这里着手，对整个旧教育制度实行彻底的革命。”号召“初小可以学些毛主席语录，高小可以学更多的毛主席语录和“老三篇”等文章。中学可以学《毛泽东著作选读》和有关文章。大学可以学《毛泽东选集》。” 又说：“广大工农兵、革命干部和革命知识分子，已经下定决心，要把'伙同和怂恿那些反党反社会主义的资产阶级“专家”、“教授”，大量散布资产阶级、修正主义毒素的’牛鬼蛇神统统揭出来，把你们的老根统统挖出来，把你们的“威风”统统打掉，把你们的资产阶级的传家宝统统砸碎。”\n\n当时按照对如上文件和社论的理解，现有的课程要改了，现行的考试不要了。事实上的停课闹革命也就此开始了。在“党和人民政府“的伟大号召下，学生们开始贴老师的大字报，目标是平日要求学生严格一点的老师。学着人民日报社论的口吻，把那些老师斥为“散布资产阶级、修正主义毒素的牛鬼蛇神”，发誓要“把你们的老根统统挖出来，把你们的'威风’统统打掉，把你们的资产阶级的传家宝统统砸碎。” 老师只能对学生赔笑脸，说欢迎提意见。不仅师道尊严斯文扫地，还挨了臭骂和批判。至于到八月份“红卫兵”登上“造反有理”的舞台后，这些老师的遭遇就更惨了……。学生们每天到学校“参加文化大革命”，充其量只要带张报纸和一本《毛选》（那时候“小红书”《毛主席语录》还没有问世）。\n\n就是在这样既无天灾、也无战祸的年月里，开始了史无前例的停课闹革命……。\n\n“文革“前的中国大陆学制是小学六年，初中三年，高中三年。回顾完如上这历史的荒诞不经，结合前面引述的聂卫平和习近平初中老师回忆内容中的关于习近平早年“学历“的相应时段的介绍，得出的正确结论应该是：习近平并非外界媒体所挖苦的”小学毕业“甚至”小学肄业“。1965年入初中，正常情况下当然应该是1968年升入高中，但因为1966年暴发”文革“，随之有所谓”停课闹革命“运动开始，所以当时的习近平仅仅是按部就班地读完了初中一年级的课程。时间段是1965年8月底或9月初至1966年6月。也就是说：在习近平日后成为一名”无比光荣的清华大学工农兵学员“之前，他的实际或者说真实的基础学历是初中肄业，再精确一点说就是他当年实际接受的正规教育的时段不过是完整的小学六年级再加基本完整的初中一年级，满打满算是七年时间。\n\n在习近平的官颁正式简历中，说他是1969年1月参加工作。经历过当年“上山下乡”日后又回城工作，无论是直接回城工作还是通过完成“工农兵学员”的“学业”或者通过正常渠道考试入校继而完成大学，大专或者中专及技校学业再被“分配工作“从而享受”国家干部待遇“的人士都记得此前被从城市发配”上山下乡“的时间或长或短，日后都会被计算工龄。所以习近平所声称的1969年1月参加工作，其实是他1969年1月开始了”下乡插队“的生活。而从1966年6月至1969年1月的这段时间里，他习近平是否也参与过”红色恐怖“活动，笔者不敢又妄断，但其初中二年和初中三年的全部学习内容都是毛主席著作，也包括毛主席诗词和毛主席语录及人民日报社论则是肯定的。这就是为什么他习近平在请多公开场合里一旦”引经据典“就往往出错，而引用毛主席语录或者毛主席诗词时则全都是朗朗上口的原因，基础打得好！",
			"added": 1546308074
		},
		{
			"topic_id": 2416,
			"title": "Frankie Wong 張愛玲女士是我喜愛的作家之一，看到這篇報導，我更佩服她了！",
			"body": "大家都說李嘉誠跑路跑得最快，其實張愛玲纔算是最快的！……上個世紀五十年代，上海剛剛解放，丁玲代表紅色朝廷在上海召開了一場文藝工作者的聯歡會，張愛玲也在被邀請之列，當她穿着豔麗的旗袍走進會場時，丁玲臉色大變，把張愛玲拉到角落嚴厲訓叱道：“你看看大家都穿着軍裝和粗布衣服，你怎麼打扮得像資本家的貴婦人？\n\n”張愛玲愣了一下，二話不說走了。……丁玲以爲張愛玲回家換衣服去呢，誰知張愛玲回家後又二話不說，整理完行裝去了香港，永遠地離開了紅色大陸！……\n\n多年以後，張愛玲提到當初突然出走的原因時說，連穿衣服的自由都沒有，還會有其他自由嗎？不如離開痛快！……\n\n真是好眼光啊！張愛玲要是不跑路的話，也像冰心一樣被關在牛棚裏，關到傻了再放出來！\n\n附帶一提的是，當年甘為紅朝工具人的丁玲，後來也被老共修理得很慘很慘！\n丁玲做紅朝打手大約七年，後來就被鬥爭，下放到北大荒、坐牢都有她的份。\n算一算她神氣了七年，被修理批鬥的歲月足足有廿二年，真正是ㄏㄧㄚㄅㄞ沒落魄的久！",
			"added": 1546439492
		},
		{
			"topic_id": 2419,
			"title": "普京新年致辞：俄从未有帮手  也永远不会有",
			"body": "俄罗斯总统普京在新年致辞中表示俄罗斯从未有过“帮手”，俄罗斯专家再次警告，中俄无法成为伙伴。\n\n俄罗斯总统普京执政多年以来，每年都会在新年钟声响起之前发表电视讲话，作新年致辞。但普京2019年的新年致辞却引起了中国网友们的广泛关注，被解读为是公开诠释了中俄友好伙伴之间的真实关系。\n\n普京在新年致辞中说，“希望在新的一年里，俄罗斯各方面都能够变得更好。只有我们一起才能实现这一目标。我们从未有过帮手，也永远不会有帮手。”\n\n该消息被报道后，引起了很多中国网友的议论。一些网友留言说：“什么意思？太伤人了”；“这不是在扇北京的脸吗，太不给北京面子了”；“很明显，这又是一起指桑骂槐，含沙射影的辱华新年致辞，要抗议，谴责！”；“中共国也从未有过帮手，也永远不会有。”\n\n实际上，除了普京本人的致辞耐人寻味之外，俄罗斯朝野在新年期间的反思过去，展望未来过程中，反华思潮也愈演愈烈。一些俄罗斯专家公开宣扬说，“中国不是我们的伙伴！”。\n\n俄罗斯“国家新闻社”在12月29日发表文章，题目为“中国不是我们的伙伴！专家警告俄应警惕北京的扩张”。\n\n文章引述位于圣彼得堡的远东国家研究院负责人吉利尔•考特科夫的评论说：“有一段时间，我们的政府安慰自己，称中国是我们的战略伙伴和盟友。起码在媒体上是这么宣扬的。从一开始，真正看得清的人都警告说，中国不是我们的战略盟友，更不是我们的伙伴。两国之间的军事及政治联盟是不可能的。”\n\n他解释说，因为俄罗斯和中国的战略路径并不重合。中国金融机构很久以前就已经加入了以美国为主导的反俄制裁，中国银行拒绝向俄客户提供转账和金融服务已不再是秘密。今年，我们的一艘船想要去中国港口进行维修，他们以制裁为由拒绝了。这才是中国对我国的真实态度，因为它明白俄罗斯无法做出任何反击。\n\n俄罗斯专家还警告说，北京已经借着友好合作开始控制俄罗斯的媒体。考特科夫举例说，回头看看俄中伙伴关系，北京以廉价获得了俄罗斯的森林和矿产资源。而当超过60万个俄罗斯人签名呼吁停止砍伐森林并以低价出售给中国时，媒体上出现了西伯利亚的森林正在腐烂，而且因为火灾而损失惨重，所以卖给中国人还会有所收获等等消息，而这都是北京方面的授意。\n\n对于俄中之间不可能成为真正的伙伴的原因，俄罗斯著名的中国问题专家、汉学博士、历史学家阿列克謝•马斯洛夫评论说，还有更深层的原因。他说：“中国人对于民族仇恨的记忆力非常强，他们可以不公开说，但是永远不会忘记，那些被俄罗斯占领的领土也总是时不时地被提起。”\n\n俄媒体还报道说，一家中国官方媒体所作的民意调查显示，更多的中国人认为中美关系更重要，占63.5%；认为中俄关系很重要的仅有大约一半的37.6%；位于第三的是与欧盟的关系，占21.7%。\n\n来源：自由亚洲\n作者：刘新宇",
			"added": 1546487864
		},
		{
			"topic_id": 2421,
			"title": "川普签署《亚洲再保证倡议法案》",
			"body": "美国之音1月2日报道，美国总统川普12月31日签署2018年《亚洲再保证倡议法案》。\n\n该法案是加强美国在印度洋-太平洋地区领导地位的政策框架，提供整个美国政府在亚洲的长期战略，促进美国国家安全利益，通过贸易机会提振美国企业和工作机会，注入美国尊重人权和基本自由的价值观。\n\n法案特别鼓励美国高官访问台湾和美国对台军售。条文中称，美国总统应该定期向台湾出售旨在应对中共既有和未来可能的威胁的防御性武器，包括支持台湾发展并整合适度的不对称能力，把包括可移动、可存活及具有成本效益的能力融入军队。对于高官互访，条文中说，美国总统应该依据《台湾旅行法》，鼓励美国高层官员到台湾访问。\n\n前香港城市大学政治学教授郑宇硕说，从宏观角度来说，这个法案是美国应对中共在印太地区霸权的政策调整。\n\n阿波罗网林亿综合报道",
			"added": 1546530460
		},
		{
			"topic_id": 2422,
			"title": "美国代理防长首次闭门会议；告诫美军将领：要记住中共中共中共",
			"body": "法广中文网1月3日报道，据路透社援引美军知情官员透露称，美国国防部代理部长帕特里克·沙纳汉在周三的一次，与美军高级官员的闭门会议中发言称，尽管美军目前在叙利亚、阿富汗等此类地区与武装分子战斗，但不要忘了“中国，中国，中国”。。\n\n沙纳汉于周二正式出任美国代理防长，此前他曾在2017年3月被川普提名为副防长，于当年7月上任。\n\n该报道并没有对沙纳汉本人就中共的看法进行具体介绍，但有其他的官员将他描绘成美国国防部强化对中共态度的驱动者。这其中就包括在2018年的美国《国家安全战略》报告中，将中共列为美国的战略竞争对手。",
			"added": 1546530514
		},
		{
			"topic_id": 2424,
			"title": "遭美政府限制；盖茨旗下核公司将放弃中共头号央企项目",
			"body": "法广中文网1月2日报道，《华尔街日报》在周二报道称，因受到美国总统川普与中共当局在科技领域纠纷影响，微软联合创始人比尔·盖茨担任董事长的核项目公司泰拉能源（Terrapower），将放弃与中共核工业集团有限公司（中核集团）的合作项目。\n\n比尔·盖茨在上周六发文做年终总结时写道，他创办并担任董事长的美国核技术公司泰拉能源（TerraPower），现在不大可能在行波堆技术上继续和中核集团合作了。\n\n其遭到停止的原因则是，“美国这边最近发生了政策变化”。\n\n泰拉能源公司是由盖茨在2006年创办，致力于开展一种新的核电技术--行波堆（Traveling-wave reactor）的研究。行波堆是一种满足第四代核能技术要求和安全标准的金属燃料钠冷快堆，采用铀锆合金燃料，换料周期长并可以大量使用贫铀，机组可利用率设计值高于90%，具有高效利用铀资源、减少乏燃料卸出量等优势。\n\n这一项目将不能被继续进行下去。究其原因则是，美国能源部在2018年10月11日公布了《美国对华民用核能项目合作政策框架》。这一文件虽然没有禁止美国企业跟中国的所有核交易，但是要求高度保证用于合作的技术不会用于军事或者其他未经授权的目的。",
			"added": 1546530858
		},
		{
			"topic_id": 2425,
			"title": "北大教授热血长文引爆舆论场 直言中共应该退场了",
			"body": "董筱然 2019-01-3\n\n    北大教授郑也夫的一篇呼吁“中共淡出历史舞台，才是最体面的处理方式”\n    在网络热传。\n    该文针砭时弊的剖析了中共独裁的情况下就没有经济改革，呼吁现任领导人\n    和平的终结专制历史以及号召中国人都行动起来对长期的压制进行反击。\n\n【希望之声2019年1月3日】（本台记者董筱然综合报导）2019年注定是激流暗涌、高潮迭起的一年。新年刚刚过去3天，中国的知识分子已经开始冒险向中央投书，并直言中共40年来的所谓改革开放已经走到尽头，没有政治体制的改革一切都是空谈。这份感言一经上网火速遭删，引发关注。近日，北大教授郑也夫的一篇呼吁“中共淡出历史舞台，才是最体面的处理方式”在网络热传。\n\n郑也夫文章针砭时弊的剖析了中共独裁的情况下就不会有经济改革，呼吁现任领导人和平的终结专制历史以及号召中国人都行动起来对长期的压制进行反击。文章将晦涩难懂的历史和政治学知识用浅显易懂的方式呈现，意在告诉每个在历史转折点的中国人面临的选择。该文也是目前为止中国知识分子直言解体中共的最大尺度文章，让不少网民为这位北大教授捏了一把冷汗。\n\n政改难产之因\n\n1月3日，海外中文圈热传北京大学社会学教授郑也夫的长文《政改难产之因》。文章一开篇就点名中共历任党魁数次提到要推动政治体制改革却始终停留在口头的原因。\n\n他总结了中共领导人提出政改的言论包括：一，党政分离和政企分离；二，下放权力，避免权力过于集中；三，完善法制；四，开启社会政治协商。\n\n中共为何要提出政改呢？文章说，因为执政党首意识到：法治缺乏，权力滥用，社会经济生活不可能走上正轨。但为什么政改最终没有实施？因为中共党魁意识到，“政改的每一项内容都是在削弱他的政党”。\n\n    党政分离和政企分离，意味着党的权力旁落，党将失去对国家行政和社会经济的操控。\n    法制的健全，将限制执政党的行动范围，社会将不像过去那样被统治集团完全掌控。\n    真正的政治协商一旦开启，执政党的主张在争论中有落入下风的可能。为避免这样的\n    事情发生，执政党最终打造出自己说了算的徒具形式的政治协商。\n    在与党内党外对手的博弈中，决策者日益坚定地认为：要一直应对社会多样性、民主\n    化、自由化的趋势，统治集团内部也不能民主，必须权力集中。\n\n中共有望做出载入史册的事：淡出历史舞台\n\n文章说，在中共建政的70年来，已经给中国人民带来了巨大灾难。演化到今天，这个党已经不能为社会输送优秀的各级领导者，几乎完全丧失了自我纠错的机制。人们加入它就是为了做官，捍卫它也是为了维护既得利益。为了“保江山”，中共历任领导人对不同政见者的仇视与日俱增，危机的恐惧令自己失态。而当前，中共可以做的一项符合中国人民共同利益的事情，就是共产党“和平地”，即以避免暴力的、最少社会动荡的方式，淡出历史舞台。\n\n“三个代表” 代表谁的利益？\n\n中共前党魁江泽民提出的“三个代表”是中考和高考政治的必考知识点。“三个代表”声称中共代表了中国最广大人民的利益。郑也夫说，中共在执政期间，大多数政策方针都不代表广大人民的利益，而是强取豪夺人民利益。将人民私有土地变为国有，之后大搞地皮财政，各地政府高价将地皮卖给地产商，导致中国房价居高不下，无数公民成为房奴，进而形成国富民穷，怎么能说代表了人民利益？\n\n被逼着自上而下的改革仅有一次\n\n文章说，自上而下的改革是稀罕的东西， 因为上层的改革愿望、改革动力，只在稀少的时刻存在。作者只是在1978年看到一回，“只此一回”，但当时的改革原因是“不改革就亡党”。\n\n作者表示，亡党亡国常常放在一起说，但他认为，“不会有亡国的事情，殖民时代已经划上句号了，不再可能有亡国灭种的事情。面临的就是亡党，因为执政党把国家搞得那么糟糕，那么多人吃不上饭了。如果亡党怎么样呢？统治阶级将退出历史舞台。他们当然不愿意发生这种事情。所以就有了改革。是毛泽东（折腾）造就的。”\n\n台湾能民主 中国人却惯坏了中国共产党\n\n作者还说，台湾民主派多年打拼，造成多元局面，使蒋经国做出选择。统治者与被统治者互相塑造，恶性循环也是双方造就的。统治者的责任更大，但他的任性也是中国人逆来顺受造成的。中国人把共产党惯坏了，想走出恶性循环，只有弱势者站出来发声。\n\n他还说，没有外部的压力，没有强烈开放党禁、报禁的要求，中共领导人想这么做，他的同僚都不会同意。如果没有外因，连这样的认识和想法都不会进入他的头脑。“如果我们不发出声音，不施加压力，我们就不该、就不配看到专制政体的终结”。\n\n期待一位明智的领袖\n\n和平终结专制的历史，需要依赖于一位明智的领袖，不然就难有非暴力的转型。\n\n“只是作为党魁，带领该党走上这条路实在不易。吊诡的是，难处不在于党外有反对派，恰恰在于没有反对派。而没有反对派又是它自己造成的。没有打压不下去的反对派，他几乎就没有选择这条道路的理由。这也是笔者捅破这层窗纸的道理所在。”\n\n天下兴亡匹夫有责\n\n至于写这篇文章的目的，作者说，因为“ 天下兴亡匹夫有责”。“还有一个卑微的动因，就是让我还能看得起自己。多年来我涂抹了上百万字。如果最终在这个我想了许久的、关乎民族大业的问题上不置一词，我会看不起自己的。”\n\n作者最后表示，“我以为，我们今天还没走到将一切责任都推给政治家的时候。因为今天的书生还没有尽责。如果他们都忠实于自己的良知，都勇于讲出自己的看法，中国不会是今天的样子。”\n\n公开资料显示，郑也夫是北大社会学系教授，曾多次批评“糟糕的中国教育体制”、学界黑幕，著有《吾国教育病理》，及由他指导的学生调查论文的结集《科场现形记》。《吾国教育病理》一文的前言中，他表示这是愤慨之作，眼见中国教育居然走到这步田地，管理者解答中国教育困境又这么弱智，他决定出手诊病、开药方。\n\n郑也夫在民间有很高的声望，接触他的人对他的评价很高。他反对科研腐败，从来不申请国家给钱的课题项目。在北大官方网页关于其介绍的最后一项“奖励及荣誉”中，注明“不申请并拒绝任何官方奖项”。",
			"added": 1546531789
		},
		{
			"topic_id": 2426,
			"title": "敦促胡锦涛，温家宝，宋平三先生退出共产党！",
			"body": "日前在网络上看到宋平先生对习近平的倒行逆施十分愤慨，大骂自己当年瞎了眼，看错了人。\n\n我愿意相信宋平先生年轻时是怀着理想加入了共产党的，我还愿意相信胡锦涛先生，温家宝先生年轻时也是怀着理想加入共产党的。\n\n可是我近些年从网络上看到，其实早在100年前，共产主义兴起的早期，就有先知先贤们指出共产党的无产阶级专政一定会演变成共产党的一党专政，最后演变成领袖的个人独裁。这个在列宁的导师普列汉诺夫的遗言中写的很清楚，而且这还不是他一个人的论断。\n\n我不清楚你们加入共产党的时候，在听党课的时候有没有听过共产主义运动早期的这些争论，有没有听过第二国际与第三国际的分歧，也不知道你们的党课教材中有没有考茨基的《恐怖主义与共产主义》。\n\n但是我想，至少现在你们应该都知道这些了吧。不知道你们现在是如何看待这些论断与著作的？\n\n不知道宋平先生是学什么专业的，胡锦涛先生与温家宝先生都是理工专业的。理工专业都是实证科学，是要讲究实证的，一切理论是要符合实际的观察结果的。否则这理论就不能成立。\n\n百年来的共产主义运动，从实际实行的结果看，所有的共产主义政权最后都验证了从无产阶级专政到共产党一党专政，再到领袖个人独裁这个论断。没有一个例外。\n\n共产主义在中国近70年的实践，前30年完全实现了从无产阶级专政到共产党一党专政，再到毛泽东个人独裁。习近平上台之后，短短5年时间就再次实现了从共产党一党专政到习近平个人独裁。\n\n胡锦涛，温家宝两先生，我不知道你们是如何看待这个实证结果的？这样的观察结果，你们认为还不足以否定共产主义理论吗？\n\n既然共产主义这个荒唐的理论已经被实证否定了，那你们就应该果断退出共产党这个组织。以尊重科学与理性，尊重人类良知。\n\n如果你们认为实证结果已经足以否定共产主义这个荒唐理论，却还不退出共产党，那又说明什么呢？你们又想证明什么呢？\n\n在这样的实证结果下，你们还不退出共产党，那就很难取信天下人，你们年轻时加入共产党是怀着理想的。而且，你们也无法向自己的后人解释，自己为什么要加入共产党，为什么在共产党政权给人类造成极大的灾难之后依然不肯退出共产党组织。\n\n胡锦涛，温家宝，宋平三先生退出共产党吧！",
			"added": 1546576959
		},
		{
			"topic_id": 2427,
			"title": "佩洛西再任美众议院议长 主张强烈反共",
			"body": "【新唐人2019年01月04日讯】美国民主党人南佩洛西3日再次当选众议院议长。佩洛西属对华强硬派，主张强烈反共，被中共官方视为“敌对人物”。\n\n美国第116届众议院1月3日开始就职仪式，一众议员正式宣誓就任。民主党时隔8年后再次执掌众院，民主党领袖佩洛西选为美国众议院2019～2020年新一任议长。\n\n众议院共有435个席位，民主党在去年11月6日举行的中期选举中夺得235席，成为多数党，共和党则有199席。\n\n佩洛西在2007年至2011年期间首次出任众议院议长，为史上首位女议长。民主党此次推举资深党员佩洛西第2度出任众议院议长。\n\n佩洛西再次上任时说，我们肩负着重任，挑战等待着我们，它将是不易的。\n\n现年78岁的佩洛西是意大利裔美国人，自1987年起担任加利福尼亚州第八国会选区议员，2003年成为众议院少数党领袖，2007年1月4日，成为首任美国女性众议院议长。\n\n佩洛西担任众议员以来，一直以关注中国人权著称，被中共官方视为“敌对人物”，也被中共党媒列为美国对中共的“鹰派”之一。\n\n早在1989年六四事件发生时，她曾在天安门广场外静坐抗议，旨在为六四事件时期的中国学生提供庇护，中国学生的保护法案也是由她提出。\n\n1992年，佩洛西获中国民主教育基金会颁发第7届杰出民主人士奖。\n\n佩洛西也一直投票反对给中共最惠国待遇、中共申办奥运会等，在2007年6月12日，即以众议院议长身份发表声明要求美国介入调查中国厂商剥削童工。\n\n此外，佩洛西一直公开表示对法轮功的支持。\n\n2016年10月，世界各地的法轮功学员在美国旧金山市政厅前广场集会，谴责中共活摘法轮功学员的器官。佩洛西发去了表达支持的信件。\n\n同年12月，神韵艺术团莅临美国北加州4个城市演出，佩洛西给神韵发去贺信。\n\n2017年4月，首次“川习会”前，佩洛西曾致函川普，敦促他向北京提及中国人权问题，以支持中国那些因为宗教和政治信仰遭到迫害的人。\n\n2018年3月22日，川普总统宣布考虑对中国进口商品征收惩罚性关税时，佩洛西发表声明，支持川普政府“为美国工人和产品而战”，并呼吁美国政府采取更多行动来应对中共的“各种糟糕行为”。\n\n同年11月7日，美国中期选举大局已定后，川普给佩洛西打去了电话，就民主党赢得众院多数席位向她表示祝贺。\n\n佩洛西的发言人在推特上写道，川普“就她在获胜演讲中呼吁两党携手共进向她表达了感谢之意。”\n\n作为众议院议长，佩洛西正式上任后将为众议院制定立法议程。在接下来的两年里，共和党会以53比47的优势保持对参议院的控制。\n\n在美国中期选举后，就有分析说，遏制中共已是美国两党共识，民主党为了向世人表明其反共的信念，必定挥舞人权大棒敲打中共政权，民主党擅长政治施压，共和党惯用经济手段，双管齐下，中共政权的丧钟已经敲响。\n\n（记者李芸综合报导/责任编辑：李泉）",
			"added": 1546588484
		},
		{
			"topic_id": 2431,
			"title": "建议胡锦涛，温家宝，宋平三先生退出共产党，组建社会党。这样可能会给中国的分裂创造一个比较平稳的过渡，避免出现流血的暴力革命。",
			"body": "",
			"added": 1546661396
		},
		{
			"topic_id": 2432,
			"title": "境外的维吾尔独立军应该把军力尽快扩展到10000人以上的规模",
			"body": "",
			"added": 1546670252
		},
		{
			"topic_id": 2435,
			"title": "幸运的是有西藏，新疆两个地方，否则真的好无奈。",
			"body": "早几年我以为中国的情况是革命与改良赛跑，看哪个胜出。现在我发现我的判断完全错了。\n\n中国没有革命党，没有真的在为革命做准备的，都是他妈的说大话的。\n\n中共也没有任何改良，没有改良还倒退。当然，没有革命党中共当然没必要改良。\n\n现在我只能修正一下，中共是否会垮台要看房地产会不会崩盘，看地方政府的债务会不会爆发危机。\n\n我们只能坐等房地产崩盘，等债务危机爆发。\n\n不过幸运的是有西藏，新疆两个地方，否则真的好无奈。",
			"added": 1546698185
		},
		{
			"topic_id": 2436,
			"title": "执政70年带来太多灾难 北大教授促中共体面退场",
			"body": "法广消息：中国民间声望很高的北大教授郑也夫决定挺身而出，尽“匹夫之责! ” \n\n他在刚刚公开的『政改难产之因』一文中分析政治改革为什么在中国根本就没有发生？郑也夫文章开门见山，中共为何提出要政改？因为它意识到法治缺乏，权力滥用，社会经济生活不可能走上正轨。但是中共为什么没有实施政改：因为中共“党首”意识到，“政改的每一项内容都是在削弱他的政党”。 \n\n郑也夫指出，中共在其执政的大多数时间中，其方针政策不代表中国广大人民的利益。巧取豪夺，先将人民私有土地变为国有，然后大搞地皮财政，各地政府高价将地皮卖给地产商，无数公民成为房奴……\n\n作者认为中国共产党在其执政的70年历史中，给中国人民带来太多的灾难。演化到今天，“它几乎完全丧失了自我纠错的机制，它的性质已经彻底蜕变….加入它是为了做官，捍卫它是为了维护既得利益…对不同政见的仇视与日俱增，对危机的恐惧令自己失态。” \n\n在作者看来，有一项符合中国广大人民和执政党共同利益的事情，就是共产党和平地、即以避免暴力的、最少社会动荡的方式，淡出历史舞台。“我以为，今后中国共产党的领袖所能做出的唯一可望载入史册的大事情，就是引领这个党体面地淡出历史舞台。”\n\n但他认为，和平终结专制的历史，依赖于共产党的一位明智的领袖，不然难有非暴力的转型。作者认为，有什么样的统治者，就有什么样的被统治者，二者相互塑造，恶性循环是双方早就的。“得势者为什么要主动让权，改变现状呢？没有外部的压力，没有强烈的开报禁、开党禁的要求，执政党的党魁想这么做，都没法向同僚交代---同侪们会觉得老大有病了。”\n\n但作者同时指出，如果大家不发出声音，就不配看到专制政体的终结! 作者认为“天下兴亡匹夫有责”“今天的书生还没有尽责”。“如果他们都忠实于自己的良知，都勇于讲出自己的看法，中国不会是今天的样子。”",
			"added": 1546698820
		},
		{
			"topic_id": 2437,
			"title": "怀璧其罪的民营企业家",
			"body": "这几天上海似乎天气仍暖和，然而西北榆林看守所恐怕西风萧瑟了。我的当事人赵发琦的胡子恐怕越来越长了吧。\n\n赵发琦原本胡子刮得听干净，人也利落，毕竟是打过对越自卫反击战的老兵，且是军中的技术能手。战罢归来，赵戴过大红花，坐车不要票。人是聪明人，后来搞点建筑，积累些原始资金，之后，家乡榆林已经慢慢变成西北能源之乡，赵于是倾其所有1200万元，签合同，购买一个探矿权，幸运的是，他购买的探矿权，确实探出了巨大的煤矿资源，于是，幸运变成了不幸。他的厄运也开始了。\n\n因为，另外一个所谓的港商实际是官府背景的商人X看上了他的煤矿，于是，他原本的合同对方西安地质勘察院在省领导的批示下，毁约了，他就开始打官司，一审在陕西高院，老虎打盹，居然赢了一审，在二审最高法院期间，陕西省政府办公厅给最高法院发了一个带威胁味道的密函，称最高法院如二审维持，会引发国有资产流失，造成陕西的不稳定。在这期间，争议的煤矿已经给了有官府背景的港商，国有资产也变成了港资，最后就变成了另外一个私营公司。最高法院也顶不住压力，二审就发回重审，按照回到了陕西，赵发琦的公司立马就输了一审，只能上诉寄希望于最高法院的韧度。\n\n赵发琦的厄运才刚刚开始，陕西省长赵正永批示，要求省工商局查一下榆林赵发琦涉嫌诈骗省重大项目（其购买的煤矿），省工商局就责成榆林工商局查，榆林工商局就查出赵发琦的公司03年注册时未缴纳注册资金，由于其在04年全部补足了，于是对赵发琦的公司进行罚款，结果省政府认为罚款太轻，无法完成“为最高法院的审理提供证据”（政府文件中用语）的任务，于是，榆林市工商局就吊销了赵发琦公司（凯奇莱公司）的营业执照，釜底抽薪，最高法院打官司的主体都成问题了，因为，公司没了！\n\n这远没有结束，公安还没开始启动呢！\n\n在省长赵正永的明确批示下（要求公安厅查处，有证据），榆林市公安局开始通缉赵发琦，最后把他抓到，入狱。罪名是虚报注册资金罪，03年开的公司，04年补足全部资金，按照最高法院的司法解释，参与的股东、会计师事务所连民事责任都没有了，居然还能启动刑事程序。然而，经办人的回答就是，省里领导旨意。\n\n没有政府背景的企业家，万一侥幸得到一块优质资产，就和卞和一样，匹夫无罪，怀璧其罪。这种情况的发生，很少会在沿海，但，在西部，这已经不是第一次。山西将所有煤矿都国有化，重庆打黑中犯罪分子几乎都是民营企业家，这种情况，虽然不是说民营企业家一定都是好人，无疑民营企业家的人身、产权缺乏足够的法律保护，是客观事实。\n\n法治缺失后，做大的民营企业家都需要找靠山，靠山不但能提供保护，而且能帮助攻城掠地。赵发琦就是猎物，民营商人、官营商人在缺乏法律规则的狩猎场上，靠山也时常城头变幻大王旗，螳螂扑蝉，焉知黄雀是否在后？\n\n赵发琦经历的最残酷的战争，不是越战，越战，他毕竟手里有武器，身边有战友，背后有国家，而在和官府斗的竞技场，他，独自一人，没有武器，却想保护私有财产，对手却手握国家机器，麾下公检法工商无数。两者胜败，实在无需庙算！没有法治，就没有真正的私有产权！\n\n这未必不是王石、潘石屹们的命运？\n\n2011.10.16发表于21世纪网。\n\n作者: 斯伟江",
			"added": 1546738322
		},
		{
			"topic_id": 2439,
			"title": "王友群：2019中共退出历史舞台是天意？ 执政者何去何从",
			"body": "【希望之声2019年1月5日】（本台特约评论员王友群）\n\n进入2019年，北京大学教授郑也夫的一声呐喊，象一颗惊雷，震惊世界。\n\n郑也夫憋足气，铆足劲，喊出了自己压抑很久的心声：中共应退出历史舞台！\n\n他写道：“今后中国共产党的领袖所能做出的唯一可望载入史册的大事情，就是引领这个党体面地淡出历史舞台。”\n\n为什么？郑也夫认为：中共执政70年“给中国人民带来太多的灾难”。时至今日，“它几乎完全丧失了自我纠错的机制。它的性质已经彻底蜕变，早已不是一个信仰的团体，加入它是为了做官，捍卫它是为了维护既得利益”。\n\n确实，中共当政70年，给中国人民带来太多的苦难。“土改”、“思想改造”运动、“镇压反革命”、“三反”、“五反”、“反右”、“大跃进”、“四清”、“文化大革命”，“六四”、迫害法轮功等等，8000万中国人被迫害致死，可谓血债累累，罄竹难书！\n越来越多的中国人觉醒了\n\n郑也夫教授说：“天下兴亡，匹夫有责”。他之所以在2019年年初大胆站出来发声，还有一个“卑微”的目地，“就是让我还能看得起自己。多年来我涂抹了上百万字。如果最终在这个我想了许久的、关乎民族大业的问题上不置一词，我会看不起自己。”\n\n2019年元旦前夕，中国互联网上流传一份《中国百位公共知识分子发表“改革开放”40年感言》。比如，北京独立时评人蔡慎坤说：“改革不仅限于人人有饭吃，还要人人敢说话，不因说话而恐惧！改革还要让全民分享经济繁荣的成果，而不仅限于少数人掠夺敛财。”\n\n2018年12月31日，在中共掀起的反美情绪浓烈的情况下，中国著名经济学家茅于轼说：近代以来，美国帮助中国颇多，不但没有侵占中国的土地，还退还清政府的庚子赔款，办了协和医院和清华留美基金，如果没有美国扔两颗原子弹，国民党打不过日本人，所以，美国是中国最大的恩人！\n\n此前，茅于轼表示，他已多年不交党费了，算自动退党。他说：“我也想明白了，不想再留在党内了。知识分子中间很多这样的想法。”\n\n茅于轼还说，世界在变，国内国外，各方面的力量，都在朝着民主、法治、宪政、人权的方向变。愿意也好，不愿意也好，这是个客观事实。“你顺潮流，你就觉得治理很轻松，你顶着潮流，费力不讨好。”“领导人和中产阶级都把孩子送到美国去，就是这股潮流的力量在起作用。”\n\n去年12月20日，88岁高龄的著名经济学家吴敬琏，发表“十大改革忠告”，大声疾呼真刀真枪地进行市场化、法治化、民主化的改革。\n\n去年12月4日，原中央党校副编审邓聿文发表《给习近平的七个忠告》，呼吁“取消在民企、外企、社会和民间组织建立党组织”，对待不同意见或反对意见实行宽厚、宽容、宽松的“三宽”政策等。\n\n去年9月16日，在中美贸易战打得如火如荼之际，在北京钓鱼台国宾馆召开了“纪念中国经济改革开放40年暨50人论坛成立20周年学术研讨会”，盛洪等47人出席。多位专家从不同角度对中共的经济政策进行了尖锐批判。\n\n2004年11月，大纪元推出系列社论《九评共产党》，第一次将共产党反天、反地、反人类、反神佛的本质揭露得淋漓尽致。由此在全球范围内引发一场退出中共党、团、队大潮。据大纪元统计，已有3亿两千万中国人退出中共党、团、队。还有更多的中国人正在觉醒。\n\n2015年5月起，全世界已有20多万法轮功学员实名向北京最高法院、最高检察院控告迫害法轮功元凶江泽民；2015年7月起，全世界已有300多万不修炼法轮功的人签名举报江泽民。控告江泽民、举报江泽民、法办江泽民的呼声响遍全世界。这是人类有史以来从未有过的伟大壮举。\n\n2019年1月2日，习近平发表关于“统一台湾”的讲话后，台湾朝野上下立即表示反对。台湾大学法学博士曾建元说：“现在台湾人民可以做为中华民国的主人。如果实施一国两制，我们就变成共产党极权专制的奴隶；我们的选举也受到北京的控制；我们的人权在所谓的人大释法当中会不断流失。有点人格的、自主意识的人，可以接受把自己前途的决定权交给别人吗？我想这绝对不可能！”\n\n越来越多的外国人觉醒了\n\n2019年1月2日，美国代理国防部长沙纳汉说，将持续推进美国的《国防战略》，并且要记住，“中国、中国、中国”。这里，沙纳汉真正所指的是“中共、中共、中共”，中共现在是美国的最大威胁，中共是美国的头号敌人！\n\n去年11月，美国前财政部长亨利·保尔森当着中国国家副主席王歧山的面说：“美国在中国加入世贸组织问题上扮演了决定性的角色，但是，17年后的今天，中国经济的很多领域并不对外国竞争者开放。他们保留了对合资企业的要求、所有权的限制。他们利用技术标准、补贴、申请许可程序和各种规定等一些非关税的壁垒来限制贸易和投资。简单地说，这是不能接受的。”\n\n去年11月8日，一直被中共称为“中国人民的老朋友”基辛格访华时，会见了习近平等。基辛格向习近平等表达了三个观点：（1）北京需要超越自己的旧制度，才能真正引领亚洲；（2）中美关系正在从合作转为对抗；（3）中美双方都应该知道冲突的严重后果。\n\n去年11月29日，美国胡佛研究所发表213页的重量级报告，警告中共正在全面渗透美国政府、大学、传媒、智库、企业和侨界。这份报告由来自8个国家的32位中国问题专家撰写。其中许多人过去都是“亲中派”！原白宫亚洲事务高级主任麦艾文说：“这（份报告）证明了一整代中国问题专家的觉醒”。\n\n2018年，美国总统川普以贸易战为先导，从经济、政治、军事、外交、科技、意识形态诸方面发动对中共全方位的围堵。川普登高一呼，立即在世界各国引发强烈反响。加拿大、墨西哥、澳大利亚、新西兰、日本、韩国、马来西亚、印度、巴西、欧盟等都开始对中共大声说“不”！\n\n2018年12月1日，中国电信巨头——华为创办人任正非的女儿，华为副董事长兼财务总监孟晚舟在加拿大被捕，成为2018年岁末震惊世界的大事件。过去20年来，成千上万法轮功学员被非法抓捕、关押、判刑、酷刑折磨，许多人被迫害得妻离子散、家破人亡。中共高官没有一个人公开站出来说一句公道话。然而，孟晚舟被抓，中共外交、国安、公安、文宣等都有官员跑出来“捍卫”她的人权！\n\n孟晚舟何许人也？一个人有8本护照，包括香港护照和中国大陆护照；在中国大陆赚大钱，在加拿大买豪宅；拥有香港永久居民身份、中国大陆居民身份、加拿大永久居民身份；在中共一对夫妻只生一个孩子的计划生育政策下，她生了4个孩子；4个孩子都在国外念书；她在国外涉嫌犯罪，保释时请的律师团队和保安人员全是外国人。孟晚舟被保释的第二天，中共驻温哥华总领事佟晓玲便带着鲜花去她的豪宅拜访。孟晚舟被抓后，中共在中国大陆抓了13个加拿大人！\n\n孟晚舟所在的华为是家什么公司？是一家帮中共迫害亿万中国民众的公司。中共为防止民众了解国国内外的真实情况，搞了一个长城防火墙工程。中共为了监控民众搞了金盾工程、天网工程、雪亮工程等。华为是这些工程的积极建设者。华为还是中共渗透全世界的急先锋。在中国民众住房难、看病难、上学难、养老难、这样难、那样难的情况下，华为通过与中共政法、国安、外交、文宣等深度合作，坑了大把大把中国老百姓的血汗钱！\n\n从上述情况看，孟晚舟是中共权贵家族的一个典型代表。中共围绕孟晚舟所做的一切，都是在维护中共权贵家族的特权利益。中共权贵家族的特权利益与中国绝大多数民众和世界各国民众的利益是完全对立的。这也正是2018年以来越来越多的国家以“国家安全”为由围堵华为的原因所在。\n\n顺天而行者必得天助\n\n美国总统川普发动贸易战，要求很简单，就是中美之间公平交易。这个要求合情合理。然而，去年12月20日，中共少罗援在深圳竟然说，“美国最怕死人”，中共现在有东风21D、东风26导弹，“这是航母杀手锏，我们击沉它一艘航母，让它伤亡5000人，击沉两艘，伤亡10000人，你看美国怕不怕？”在中国经济正面临巨大危机时，中共少将罗援居然还在想着杀死10000美国人！\n\n中共的老祖宗马克思是撒旦信徒，怀着对神和全部现存社会制度的仇恨，煽动共产党人到处杀人放火，毁灭传统文化，祸害人类170年。20世纪80年代末90年代初，苏联东欧各国共产党政权，因为实行马克思的歪理邪说，犯下无边大罪，人心丧尽，迅速垮台、解体。之后，中共凭借高压与欺骗，又苟延残喘近30年。在江泽民当政或当“太上皇”的23年里，他在迫害法轮功的同时，以“贪腐治国”，将中共变成全世界最腐败的政党，同时将面积相当于40多个台湾的中国领土送给俄罗斯等国，已将中共拖入绝境。2018年以来，中共内忧外患，四面楚歌，国内觉醒了的人们和国外觉醒了的人们共同汇成解体中共的时代大潮。\n\n中共迫害法轮功已经20年了\n\n从1999年到2019年，中共迫害法轮功已经20年，到今天这场迫害还在继续。例如河北省怀来县北辛堡乡蚕房营村法轮功学员陈运川一家6口人累计被迫害人次：5人被迫害致死，3人被非法判刑，2人被非法劳教，5人被强制洗脑，39人次被非法关押，48人次被绑架，3人被迫流离失所，累计遭受各种类型迫害达105人次。目前，全家6口只剩下大女儿陈淑兰还活在人世。\n\n自2006年沈阳苏家屯法轮功学员被活摘器官的案例在全世界曝光之后，法轮功学员被中共残酷迫害的事实令举世震惊。2016年6月22日，加拿大人权律师大卫‧麦塔斯和加拿大前亚太司司长大卫‧乔高和美国资深调查记者伊森‧葛特曼，联合发布《中共强摘人体器官的最新调查报告》。经调查，3位作者估计，中国器官移植手术数量惊人，这些器官的主要来源是法轮功学员！\n\n20年来，法轮功学员及其家人就是在这样暗无天日的血腥迫害中承受着无休无止的苦难；20年的迫害，发生过许多震惊世界的惨案，桩桩件件，惨绝人寰！2018年，中美贸易战爆发，中国经济受到重创。国难当头之际，中共仍然没有停止迫害法轮功。据明慧网初步统计，2018年1至11月，被非法判刑的法轮功学员837人；非法庭审805场；被绑架的法轮功学员4483人；2016至2018年3年被非法判刑的法轮功学员达3105人！\n\n大纪元系列社论《魔鬼在统治着我们的世界》的结束语中写道：“神安排了中共最后的解体。中国的执政者和其他掌握权柄的人，如果有意解体中共，神为其安排好了所有的一切，包括未来天赋神授的真正权柄；相反，如果死抱中共不放，必定会在最后的过程中遭遇中共解体所带来的一切灾祸、魔难。”顺天则昌，逆天则亡。中国的执政者何去何从？就看他们自己的选择了。",
			"added": 1546769444
		},
		{
			"topic_id": 2440,
			"title": "刘正清被吊销律师证 为当事人辩护词曝光",
			"body": "【大纪元2019年01月06日讯】（大纪元记者方晓报导）中共广东省司法厅1月5日的听证会指广州维权律师刘正清曾在两宗案件的辩护词中，“发表了危害国家安全、恶意诽谤他人的言论”，对他处以吊销律师执业证书的行政处罚。刘正清拒绝出席听证会。\n\n港媒曝光了他对两宗案件的辩护词。辩护词均指中共处于独裁者末日的恐慌，令其鹰犬者借司法之名，行政治打压（迫害）之实。\n\n港媒《明报》报导，刘正清对该报说，“我都不想理睬这帮土匪流氓”。\n\n刘正清委托前维权律师隋牧青出席了1月5日的听证会。隋牧青之前亦被吊销律师证。\n\n隋牧青对港媒说，“危害国家安全”概念抽象，是“乱扣帽子”，而诽谤更是无稽之谈，“诽谤一般是捏造事实、对具体对象的诋毁，这里（辩护词）又没有具体对象”。\n\n隋牧青说，他在听证会中代为表达了反对意见，但预计中共仍会在数日内下达吊销证书的决定。\n\n现年55岁的刘正清从业多年。2018年12月刘正清收到通知，中共广东司法厅拟吊销他律师执业证的听证会将于2019年1月5日举行。刘正清说，他拒绝出席。\n\n广东司法厅指刘正清在2016年11月为新疆当事人张海涛、2017年6月为佛山当事人李艳明辩护时，发表了“危害国家安全、恶意诽谤他人”的言论。\n\n张海涛被以“煽动颠覆国家政权罪”和“为境外刺探、非法提供情报罪”判囚19年。\n\n李艳明是法轮功成员，被以“利用×教组织破坏法律实施罪”判囚3年。刘正清代理二人上诉案过程中，分别向两地法院提交了辩护词。\n\n港媒获得两份辩护词，报导说，两份辩护词措辞类似，均称“本案事实不清，证据不足，二审应公开开庭审理；一审违反法定程序，肆意玩弄法律，应发回重审”。\n\n辩护词说，“张海涛的所作所为是宪法赋予公民的合法权利，是实践宪法规定的公民权利的具体体现，对阻遏独裁者的疯狂集权、加速中国民主化进程功莫大焉！有益于中华民族的进步，不但无罪反而有功。”\n\n李艳明的辩护词中说“实践宪法规定的公民权利的具体体现”，其余说法相同。\n\n上述两份辩护词最后均说：“此案是独裁者末日的恐慌，令其鹰犬者借司法之名，行政治打压（迫害）之实；望智者不惑，勿步齐奥塞斯库（前罗马尼亚共产党总书记及罗马尼亚总统）及纳粹党徒之后尘。”\n\n刘正清是资深刑事辩护律师，近年来代理了大量敏感案件，包括广州维权律师唐荆陵被控煽动颠覆国家政权案；六四“天网”创办人黄琦案；武汉政治异见人士秦永敏案及新疆人权活动人士张海涛案等。曾为中国受迫害最严重的群体——法轮功学员辩护，曾因为勇敢辩护而在法庭上被逮捕。\n\n2018年底，刘正清律师可能被吊销律师证的消息传出后，包括谢燕益、祝圣武、丁家喜等25名律师联名发紧急呼吁书，表示“有理由怀疑此次处罚是彻头彻尾的打击报复行为，意图全面消灭敢言善辩的优秀律师”；“特别担心司法行政机关此次处罚将使律师职业失去基本作用”。\n\n近年来，中共当局持续打压人权律师。统计显示，自2017年9月开始，大陆各地已有十多名维权律师因发表批评政府言论、替委托人维权等各种政治原因受到吊销执业证、停止执业、律师年度考核被评“不称职”等惩罚，还有三家律师事务所被吊销营业执照。\n\n责任编辑：刘毅",
			"added": 1546769631
		},
		{
			"topic_id": 2441,
			"title": "两北大人谈中共退出历史舞台 死像会很难看",
			"body": "【大纪元2019年01月07日讯】（大纪元记者骆亚、张顿报导）北京大学教授郑也夫近日呼吁，中共应退出历史舞台。原北大毕业生王军涛对大纪元记者说，中共不会“淡出历史舞台”，它的死像会很难看；原北大教授夏业良认为，中共退出历史舞台，不会有什么“过渡期”。\n\n北大教授郑也夫近日发文呼吁，中国共产党应避免暴力、社会动荡的方式，和平地“淡出历史舞台”。他还在文章最后说：“我们今天还没走到将一切责任都推给政治家的时候。因为今天的书生还没有尽责。如果他们都忠实于自己的良知，都勇于讲出自己的看法，中国不会是今天的样子。”\n\n王军涛：多数知识分子不喜欢中共\n\n对此，大纪元记者采访了两名旅居美国的中国民主党全国委员会主席王军涛，北大前经济学教授夏业良。\n\n王军涛说，作为知识分子来说，对这个世界是有责任的。“像也夫先生站出来的这样的人太少了，我希望很多知识分子能够像也夫先生这样去想问题”，但仅仅用呼吁的方式是没办法结束共产党的专制统治，还要行动起来才行，还应组织民众去对抗暴政。\n\n在当今中共严控舆论，翻墙都要罚款、传唤的情况下，像郑也夫这样公开提出共产党退出历史舞台的知识分子可谓是凤毛麟角。\n\n王军涛说，其实，中国大多数知识分子都不喜欢共产党。他们虽然不愿意去把它讲出来，但是在私底下讲得很多，“我们私底下聊天的时候，我几乎找不到什么知识分子说共产党好话的”。包括一些五毛这种知识分子，他们也不喜欢共产党、不喜欢中国现状。\n\n王军涛：中共的死像会很难看\n\n几乎与郑也夫教授同时，大陆100多名公共知识分子在新年前夕也连署发表感言，质疑中共过去40年的改革是“假改革”，认为中共的“改革已死”等。王军涛说，这说明中国知识分子对大是大非还是明白的，而且他们也都希望中国能有一个变化，中国能够宪政民主制度。\n\n王军涛表示，现在很多老百姓都希望中共早日垮台，但中共不会“淡出中国历史舞台”。“中共政权要结束的话一定是一个非常难看的样子死去，它的死像会很难看。因为它做的罪行太多了。能够淡出都是属于那些基本上没做什么坏事或者在它还在执政的时候把这个坏事都弥补了。”\n\n夏业良：中共统治摇摇欲坠\n\n北大前经济学教授夏业良对大纪元记者说，体制内学者现在越来越失望，看不到中共改革的可能性、看不到改良的这种可能，所以他们也是越来越多地发出自己的声音，但中共当局基本上不会听得进去的，中共正朝着反人类、反文明的道路在疯狂地奔跑，正往悬厓下面跑。\n\n夏教授也谈到了目前外界谈论的中国社会“逢九必乱”的问题。他说：“乱不乱，我现在还不知道，但是逢九会出大事。”\n\n他还列举了过去“逢九出大事”的多起例子：1949年中共窃取政权；1959年大陆开始了为期三年的大饥殣，庐山会议中共打倒了彭德怀等；1969年中苏之间发生“珍宝岛战役”；1989年中共大屠杀六四学生及民众；1999年中共镇压法轮功团体等。\n\n夏教授认为，现在是2019年，大家希望中国能发生更大的变化，说不定中共的统治就会摇摇欲坠。他希望中国人能齐心协力朝这个方向去努力，希望2019年成为中国制度变革的一个开端。\n\n对于郑也夫教授等人说的中国社会会出现平稳的“过渡期”的问题，夏教授并不认同。他说，制度变革就是过去讲政治体制改革，从过去的一党专制过渡到民主机制可以用“过渡时期”，而中共一贯坚持一党独裁，所以没有什么“过渡时期”的问题。\n\n他说，现在要嘛就是一场变革，无论是暴力革命还是非暴力革命，变革之后如果要建立一个新的政权，那当然需要一段时间的磨合，但那属于“磨合期”不是“过渡期”。\n\n责任编辑：林诗远",
			"added": 1546841485
		},
		{
			"topic_id": 2442,
			"title": "中共有法治？ 老外笑掉大牙：幻觉当真相",
			"body": "【大纪元2018年12月28日讯】近日，从中共最高法院法官因档案被盗要拍短片以求自保引发海啸，到中共拘捕13名加拿大公民报复华为太子女孟晚舟在加被捕，而中共司法部4日称，“中国是法治国家，问题的处理都是依法进行的。”再次引舆论大哗。\n\n《苹果日报》评论说：“官员们念叨惯了中国是法治国家，就把这一幻觉当真相。但鸦片吸多了、上瘾了，不只有幻觉，更可能致命。”\n\n该评论说：“中共一边高叫依宪治国、依法治国，另一边又反对宪政，谓之为歪路、邪路；一边高叫中共要依法执政，另一边又加快把党的领导制度化、法律化，甚至修订《宪法》时恢复文革做法，把中共的领导地位写入《宪法》条文……”\n\n最高院有贼？一串问号无解\n\n而此前，中共最高法院的法官因档案被盗为求自保，拍短片在网络疯传。《金融时报》评论文章说：“当看到一名中国最高院的法官王林清通过网上流传的视频，描述一起法院内离奇的‘千亿矿权案’卷宗失踪事件，并为了保命而留下证据时，除了感到不寒而栗，难道不在心里打了几个大问号？”\n\n2018年12月26日，媒体人崔永元发微博称：“最高院有贼？！陕北千亿矿权案卷宗被盗两年至今无下落！！！”接下来，通过微博，他公开向最高法院最高领导挑战。\n\n《法制日报》随后报导，纵观此案的审判脉络，其背后博弈之残酷可见一斑。而这句貌似轻飘飘的“最高院有贼”，竟以四两之力引发中国司法审判领域史无前例的巨大“海啸”。\n\n报导认为：“引发‘海啸’的真正原因或是最高院的判决执行受阻，有成为‘司法白条’的可能。然而，到底谁有如此能耐可令最高院的判决成为‘白条’？”\n\n“陕西千亿矿权案”历经2006年陕西省高院一审、最高法院2009年发回重审，陕西省高院2011年再次一审推翻原判决及2017年最高法院二审改判。\n\n12月30日凌晨，向外界披露此事的最高法院法官王林清又在一段自述视频中露面，他指称核心问题不只是“丢卷”（二审的一本正卷和一本副卷却不翼而飞），而是卷宗被人拿走后“换卷”（部分卷宗回来了，但关键纪要没了）。然后，监控坏了。\n\n如果最高法院有内贼，而且可能涉及高层领导，那么应该由谁来调查？而美国司法独立的精神就是为了防范“监守自盗”。\n法院像“黑社会”法官怕丢命？\n\n《金融时报》文章说，王林清的视频可以说是目前把卷宗离奇消失案带到新高度的关键。他的陈述具有“证词”的力度。\n\n当一名最高司法机构的成员，竟然不相信机构程序的公正，要选择自我暴露来伸张正义，文章说，这显示他不但是怕“丢官”，更怕“丢命”。\n\n更可见（指使）拿走卷宗的人后台不但很硬，也很嚣张。王林清已经用他的行动投出了他对于司法制度的不信任票。文章说，最高法院的法官竟然会担心自己的人身安全，这给人的印象是法院运行的逻辑像“黑社会”。\n\n这是最高法院还是“黑社会”？\n\n先批、先判、后审 法院成摆设\n\n对于为什么要偷卷宗？崔永元说，卷宗失窃风波的关键是“先判后审”。其实，《金融时报》说，更确切地是，在“先判后审”之前还有“先批”！\n\n《民主与法治周刊》署名文章揭开副卷的神秘面纱。文中指出，“由法院副卷制度的规范史观之，副卷制度原先只是出于便利审判的考虑，后逐渐演化为各种权力干预的‘遮羞布’，并进一步被神秘化处理。”\n\n根据法院系统的潜规则，副卷包含了大量的“领导说了算”，将来有人查的时候就可以作为保护自己的掩护。《金融时报》说，背后的思维仍然是“人治”的社会，与专业、公开、透明的法治社会理想背离。\n\n党大于法 法治是自欺欺人\n\n实际上，中国《宪法》已经确立中国共产党的领导地位，确立中国特色的社会主义道路，即政权和制度，是不可动摇的《宪法》根本。\n\n可是，中共官方或官媒喋喋不休地谈到法治或存在的问题时，似乎中国还有独立于政府的“法治”。\n\n人民网在2017年1月18日发文表示“司法判决不能成‘白条’（论政）”，认为“政府成‘老赖’，裁判变‘白条’。但是近年来类似的问题并非孤例，无论是2010年陕西省国土资源厅以内部会议的方式否定生效的司法判决，还是去年陕西华阴市政府始终对送达的败诉判决置之不理”。\n\n《金融时报》说，“这些都暴露出某些行政机关‘以言代法’‘以权压法’的恶习，直指行政诉讼‘执行难’这一沉疴痼疾。”\n\n因为，中国强调的法院独立审判并非真正的司法独立，法院的审判仍会受到外部和内部权力的左右。当审判机制不改变，以“法治”之名行“人治”之实，副卷便成为权力的载体。\n\n文章最后说，不让黄鼠狼去看管鸡圈，这是洪荒以来所有文明的常识，大可不必假“国情”之名而反之。\n\n《苹果日报》更是说，谎言夺权、谎言建政、谎言治国是中共的特色，只不过不同阶段有不同的口号、不同的鸦片，“法治”就是新时代的新鸦片。\n\n责任编辑：孙芸",
			"added": 1546842118
		},
		{
			"topic_id": 2447,
			"title": "2019的中国和中国精英的百年教训（下）",
			"body": "2019年飞出的第一只黑天鹅，就是习近平突然升级武力解决台湾问题的恫吓，从而增加了台湾问题触发重大危机的可能。习一直想成就统一国家的“不世之功”，这是很多人都知道的，但他为什么要在这个时候，也就是在自己面临空前严重的内外危机和压力的时候，升级武统的威胁？他想对自己的内部和外部的政治敌人传递什么信息？我的看法是，习近平此举是想告诉他所有的政治敌人，他将不惜任何代价来保住权位，为此，他不怕战争、不怕革命，不怕天下大乱也不惜生灵涂炭。\n\n习近平发出这样的威胁，能保住自己的权位吗？当然不能，事实上，习的这种行为表明，他对自己能否长期掌权正在失去信心。但不容否认的是，他确实还有机会给中国和世界带来巨大伤害，而且，即使习近平失去权位，甚至共产党失去政权，中国在重建秩序的过程中也还会面临巨大的动荡风险。\n\n百年前的中国精英，为什么没能利用一战后对中国有利的外部环境，利用国内当时比较充分的政治自由，建立起法治和民主秩序？我认为对这个问题的深究，对应对中国未来的挑战是有价值的。\n\n很多人都知道五四运动发生在1919年，却可能不知道，这一年还是孙中山改组中华革命党为国民党，决心走列宁的俄国之路的一年，同时，这一年也是梁启超提出“联省自治”，推动地方宪政来建构现代国家的一年。“联省自治”的思路得到胡适、陈炯明、谭延闿乃至毛泽东等不少精英分子的支持，一度获得不错的势头，但最终还是输给了孙中山的选择。\n\n为什么会这样？苏俄的深度干预是重要外因，而中国精英对政治大一统的信仰，则是重要内因。孙中山批谭延闿搞地方自治太天真，不理解秦始皇以来的中国，地方自治就意味着国家分裂。而持这种信仰者，在今日中国的精英中依然大有人在。这种信仰带来的一大问题就是，夺江山可以没有道德底线，保江山也可以没有道德底线。今天习近平为了保住权位，要打台湾，与当年孙中山、毛泽东为了夺江山出卖国家利益，是同样的政治文化逻辑在不同时代的表现。\n\n百年历史证明，“走俄国人的路”是一条选择作恶的路，而主张地方自治的精英们选择的是一条少作恶、不作恶的路。百年前选择地方自治的悲剧英雄们之所以失败，不是因为他们做出了错误的选择，而是因为那个时代作恶（政治暴力）的空间太大。21世纪中国推动地方自治最大的机会，就是不作恶的选择空间比百年前大多了。但历史没有必然，大一统的政治文化惯性是巨大的。虽然中共垮台已不可逆转，但再度改朝换代的中国，会不会建构一种新的政治大一统，也就是一种高科技的奴役制度？\n\n孔飞力教授认为，中国晚清面临的挑战，不仅是一个“王朝衰落”的挑战，也是“文明没落”的挑战。中国经济虽然在21世纪再度崛起，但与政治集权的古老传统共生的中国病毒，不仅再次令中国社会溃败，也再次导致了政权的合法性危机；而且，这一次中国的内部危机危及到了全球秩序。这说明中国并没有摆脱“文明没落”的危险。这个庞大而古老的文明，既有可能借力全球化实现“伟大复兴”，也有可能把许多文明拉下水。\n\n来源：自由亚洲\n作者：梁京",
			"added": 1546960646
		},
		{
			"topic_id": 2453,
			"title": "世行看衰美中谈判 罕见警告贸战风暴:天要黑了",
			"body": "【新唐人北京时间2019年01月10日讯】北京的美中贸易谈判罕见延长一天，双方都在释放乐观信号，全球股市有反弹迹象。但很多人认为，美中根本矛盾难解，贸易战仍不可避免。美中谈判还没有结束，世界银行即发布报告，看衰全球经济增长，直言“天要黑了”。\n\n原定1月7日和8日举行的美中副部级贸易谈判，延迟到9日结束，截至目前仍没有发布公告。\n\n8日，全球最大的开发融资机构——世界银行公布《2019年全球经济展望报告》，报告封面标题直言“天要黑了”，看衰全球经济。报告明确表示，尤其是美中贸易战，对全球经济前景可能产生严重影响。\n\n与去年6月估值相比较，世银下修今、明两年全球经济成长率0.1个百分点，预估今年为2.9%、明年为2.8%。\n\n不过，报告还明言贸易战令美中“两败俱伤”，甚至将2020年美国经济增长率估值比中国多下调了0.2%个百分点。\n\n经济增长率是衡量各国政府执政成败的关键因素。因此，有关经济问题的博弈和舆论导向，可能掺杂各国政治斗争因素，甚至国家之间的政治角力。\n\n就在世银发布这份报告前一天（7日），其行长金墉(Jim Yong Kim)突然宣布辞职，此时距离他本届任期结束还有三年时间。\n\n世银虽然是国际金融机构，但自成立以来，行长一直由美国政府选择。金墉2012年获美国前任总统奥巴马任命为世银行长。日媒指，金墉辞职的原因是与现总统川普在气候变化以及世行资源分配的问题上意见不合，其中包括，金墉不同意川普政府有关大幅减少对中国贷款的要求。\n\n与世界银行完全不同的是，美中北京谈判9日结束后，双方都在释放“进展良好”的讯息。全球股市表现乐观。\n\n目前，中共陷入经济危局，想通过大幅让步终止贸易战。中央社引述《华尔街日报》消息指，中方准备增加购买美国商品和服务，部长级后续会谈将在下周登场。\n\n不过，路透社消息指，本次谈判双方虽然在在购买美国农产品、能源商品以及放宽中国市场准入等方面取得了进展，但在中共结构性改革以及如何保证北京遵守承诺等方面的分歧进一步扩大。《日经亚洲评论》消息也透露，在结构性改革方面，中共对国有企业的补贴问题是双方主要分歧之一。\n\n而根据两国首脑上月初达成的临时协议，美中90天谈判的核心就是中共结构性改革。白宫强硬派多次喊话，达成协议的前提是北京必须做出“彻底改变”，以保证美中公平贸易。但北京日前已公开表态，必须继续“加强党的领导”，“不能改的坚决不改”。\n\n外界多有分析指，如果北京进行彻底的结构性经济改革，必将动摇中共统治根基，因此在一些“关键问题”上很难做出让步，所谓90天谈判或许只是北京的一种拖延战术。\n\n两国若无法在3月2日前达成协议，美国将会把向2000亿美元中国商品加征的关税，从10%上调至25%，美中关税战就会继续升级。\n\n（记者栗捷综合报导/责任编辑：明轩）",
			"added": 1547100453
		},
		{
			"topic_id": 2456,
			"title": "长平：中共如何才能“落得个好死”？",
			"body": "专制政治对知识分子的羞辱，总是超过人们的预想。几乎就在一夜之间，中国主流舆论的氛围，就从“改革开放”主调转变成“四个伟大”颂歌。回头看，那些激情昂扬的“坚决不能让‘文革’重演”的口号，在很多情景中，不过是邓小平需要否定前朝以确立自身合法性的政治环境中，知识分子自欺欺人的历史反思表演而已。习近平发出前后三十年不能互相否定的伟大号召以来，“梁家河颂”、“用习近平思想指导数学”、“把十九大报告当佛经来诵读”之类“文革”旧戏毫无阻碍地重返历史舞台。\n\n所幸还有那么多学者良心不安，还有那么多知识分子勇敢抗议。新年前后，来自体制内的“我控诉”的声音达到近年来的历史高点。继清华大学教授许章润、中国人民大学教授向松祚等学者的直言批评之后，北京大学社会学系教授郑也夫在一篇发表于网络的文章《政改难产之因》中说：“今后中国共产党的领袖所能做出的唯一可望载入史册的大事情，就是引领这个党体面地淡出历史舞台。”他认为，“在其执政的70年历史中，这个党给中国人民带来太多的灾难。而演化到今日，其权力的结构和生态决定了它已经不能为中国社会输送优秀的各级领导者，它几乎完全丧失了自我纠错的机制。”\n\n这种尖锐的批判和谏言，将体制内知识分子的“我抗议”提升到一个新的高度，可谓振聋发聩。\n\n从“长治久安”到“落得个好死”\n\n长期以来，体制内知识分子对执政党的批评，都基于“长治久安”的逻辑。即便是要求承担历史灾难的责任，那也是针对领导集团中的某些个人，而不是整个执政党。这是古代政治斗争中“清君侧”的模式。\n\n上世纪七十年代的“四五”运动，人们要求清除“迫害周总理”的“人妖”，后来被定义为“四人帮”。后来，邓小平为了权力更新，以“功过三七开”的评价让毛泽东陪绑。\n\n到了八十年代，爆发了轰轰烈烈、可歌可泣的天安门民主运动，“反对腐败才能长治久安”仍然是一个主流叙事。“李鹏下台”乃至“邓小平下台”都可以喊，但是“打到中共”仍然是一个禁忌。来自湖南的“天安门三君子”鲁德成、喻东岳和余志坚，蛋砸天安门城楼的毛泽东挂像，贴出标语“五千年专制就此告一段落，个人崇拜从此可以休矣”，竟然被抗议学生扭送到派出所。\n\n“六四”血腥镇压之后，执政党的自我革新也就所谓“政治改革”仍然是体制内良心知识分子的热切梦想。两大进谏法宝是“市场经济”和“依法治国”。这时发生了冷战后时代的巨大变化，双手沾满鲜血的中共不仅没有受到历史惩罚，反而成为全世界“跪谏”的皇帝。全世界各界都变成了中共体制内知识分子，力陈“唯有改革开放才能长治久安”的道理。中共将计就计，成为全球化最大的受益者。\n\n如今，中共强化专制，世界开始反思，中国知识分子加倍受辱。\n\n郑也夫教授新论断高度在于，明确指出中共必须退出历史舞台，而不是千秋万代长治久安。他在文章中说，一件“符合中国广大人民和执政党的共同利益的事情，就是共产党和平地，即以避免暴力的、最少社会动荡的方式淡出历史舞台”。“结束专制符合中国广大人民的利益。但是流血和动荡不符合中国人民的利益。和平的大转型，符合共产党的利益，因为那是唯一的体面退出的路径”。\n\n也就是说，尽管仍然是为了朝廷考虑，但这次是希望它“落得个好死”。有人想到了中国古人的最高忠诚标准：武死斗，文死谏。\n\n“依赖于共产党的一位明智的领袖”？\n\n如果“长治久安”没有能够利诱中共政治改革，“落得个好死”就能吓倒它？郑也夫教授显然无法令人信服。\n\n郑也夫设想的“退出”路径是，给不同政治派别一个对话的平台，“搞真正的政治协商”。但在他看来，“要让这个统治中国社会70年的政党亲手结束一党专政，要有一段不短的过渡期。过渡期只能由共产党来看守社会秩序。……不然就难有非暴力的转型。”他还称，中共作自己的掘墓人，“依赖于共产党的一位明智的领袖”。\n\n艾晓明教授在社交媒体发表了一篇德国导演佩措尔德的故事片《不死鸟》的观后感，尽管没有点名，但仍被认为代表了一种对郑也夫教授的批评意见。\n\n艾晓明教授说，“正如昨天我和一位朋友所说，你能想象死难中的犹太人仰望上天说：请给我们一个好的希特勒吧？这是荒谬的。希特勒和犹太人是死敌，他就是他的本性自身。但是，如果你没有经历过被屠杀者的绝境，你要代言说神赐一个好希特勒吧；作为知识分子，这是不理性；作为一个人，这是不道德。作为一个时代的旁观者，这是荒谬的一部分。”艾晓明教授讽刺说，“这样，人们就转而去赞美各种安全线内的好意思。好来好去，也就是排队去屠宰场时自己给自己放点安眠曲而已”。\n\n体制内的希望在于支持体制外的反对力量\n\n不过，郑也夫教授看到了一个重要的因素：目前的“难处不在于党外有反对派，恰恰在于没有反对派的存在。而没有反对派又是它自己造成的。没有打压不下去的反对派，他几乎就没有选择这条道路的理由”。\n\n既然如此，又何必苦苦劝进？中国体制内知识分子最大的希望，在于呼吁开放报禁和党禁，支持体制外的反对力量。八十年代的学生运动中，人们可以谈论仍在体制内的反对者方励之和刘宾雁，却完全无视因提出“第五个现代化”、批评邓小平专制而坐牢的魏京生；今天，人们热烈赞颂郑也夫教授的勇气，却没有人提及因为参与推动“零八宪章”而死于狱中的诺贝尔和平奖获得者刘晓波，没有人知道彻底反对专制的“南方街头运动”。\n\n传颂郑也夫教授文章的人，也应该知道南方街头运动成员王默2015年11月在法庭的勇敢宣示：“颠覆任何执政党的执政权是每一个公民的宪法权利”，“在这里我郑重声明，一直以来我主观意愿上想颠覆的是中国共产党专政这个独裁政权”，因为“中共自1949年以来直接、间接迫害致死了1亿多国人生命，这样一个罪恶滔天的独裁政权是一个赤裸裸的反人类集团，它是有史以来全人类历史上黑暗、最邪恶、最残暴的政权”，“颠覆这个政权我没有罪”。\n\n来源：德国之声\n作者：长平",
			"added": 1547305659
		},
		{
			"topic_id": 2457,
			"title": "砍头文化层次丰富",
			"body": "中国历史教科书准备再修改方向，大力宣扬义和团的爱国精神，大陆更有权威人士最新发现：西方传教士选择在圣诞平安夜，屠杀手无寸铁的中国人民，强奸妇女，欺凌中国人，惨绝人寰。所以国家叫年轻人不要欢度圣诞节，是有历史根据的。\n\n但根据西方文明世界的历史论述，义和团和传教士的冲突，最可靠的，是参看当时在现场目击者口述。\n\n历史教科书和历史学家，搜集的资料、编写的教材，只是炒菜烹调，其间有加盐添醋的调味。但菜式的原材料（raw materials），若要天然真实的味道，必定是现场经历的人口述。\n\n清末幸好有大量西方侨民住在中国，他们的所见所闻，惊心动魄的写下来，虽然许多是小事，但格外有趣。\n\n一百年前，美国有一位牧师叫李遹声（Edmund Jenning），看见中国爆发拳匪恐怖主义，有感于这个蛮族，极需文明开化，毅然与妻女来中国江西安庆传教。\n\n他的太太名叫露丝，在中国留到北洋时代。北洋军阀，捉到贼匪，故意用很钝的大刀来砍头。有一天，露丝看见一个江洋大盗被杀头处决，砍了十五刀，方哀号惨死。\n\n露丝吓坏了，即刻去都督府交涉，质问：你们中国人有三千年文化，这一点我很尊重，斩头杀人，是你们的文化，文化多元，我也乐于大爱包容；但即使斩首，可不可以改用一把锋利的刀呢？\n\n都督府的书记领导人两手一摊：我们安庆全城，就是找不到一张磨得锋利的大刀。露丝大急，亲自写信到上海，托朋友去买一张锋利的大刀，急速运来江西，希望中国人的死囚，死得不那么痛苦。\n\n这位美国太太后来和传教士丈夫回到美国维珍尼亚州，出版回忆录，叫做“居华杂忆”（An American Sojourn in China），记述了这件小事。她不明白的，是用钝刀杀头，本是中国人死刑再细分的一层：凡列为重犯，或死囚家属对刽子手贿赂得不够的，刽子手那张刀，故意少磨几下而不锋利，或蓄意另用钝刀。\n\n如戊戌变法失败，“六君子”之中慈禧太后最恨谭嗣同，因为谭游说袁世凯发动兵变，在颐和园围捕慈禧。所以太后特别关照：在菜市口砍谭嗣同，须另换一把钝刀。因此共砍了二十多刀，谭嗣同的头方全断。\n\n美国白人的民族性，心地善良，喜打抱不平。这种生活的记录，就是最真实的历史，像有机的蔬菜，很生（raw），未经什么学者专家和教科书编辑加工。要了解一百五十年中国的真相，必须看外国人来华目睹经历的日记。其余一切由中国人述说之所谓历史书，必须存疑，至少打个七折收货。\n\n来源：苹果日报\n作者：陶杰",
			"added": 1547308181
		},
		{
			"topic_id": 2458,
			"title": "美方谈判中要求的结构性改革内容：",
			"body": "1,要求中方进行税收改革，间接税改为直接税，明明白白收税，大幅度降低税率。让人民清楚，让中外企业得到公平竞争机会。\nfairness opportunity\n\n2,国企放弃垄断，开放电力，电信，移动，石油市场，让老百姓不受高油价，高电费，高路费困扰，保证市场充分竞争。\nfully competition\n\n3,减少政府干预市场，取消各种检查，审批，收费。\nrelease government interruption\n\n4,大幅度改变劳工政策，提高劳工工资，容许工会存在并独立。independent union\n\n5,保证新闻自由和互联网自由。\nfree press&internet access\n\n6,建立完善知识产权保护体系，不强迫外方技术转让，不进行国际技术和知识产权偷窃。\nstop theft of intelligence property\n\n7,保护私有产权和保护民营企业家，不可以随意剥夺他们私有财产和限制人身自由。\nrespect individual rights\n\n8,取消对国有企业补贴和出口企业补贴。\nno unfair preference to state-Corp.",
			"added": 1547309133
		},
		{
			"topic_id": 2459,
			"title": "巴西的川普  象样的总统",
			"body": "川普当选美国总统之后，带动全球性风潮，很多民众都希望自己国家出现川普这种兑现诺言、勇于改革的领袖。在欧洲，匈牙利总理被视为“东欧的川普”。在南美洲，2019年元旦就职的巴西右派总统波索纳洛（Jair Bolsonaro）被誉为“南美的川普”；刚上任才10天，这位巴西川普就雷厉风行、大刀阔斧改革，一道道行政命令，让巴西立马“变天”。这之前左派掌权14年、陷入各种困境的南美最大国家，新年新总统带来的新景色不仅令世界瞩目，更给2亿多巴西人民带来激动，带来对伟大巴西的憧憬！\n\n在内政方面，巴西新总统强调两个拒绝：拒绝社会主义，拒绝政治正确！而这两项不仅是巴西，也是全球左派们热衷的。巴西新总统在2019年第一天，开门见山、开天辟地，明确宣布走市场经济（拒绝社会主义）；强调真实（不再政治正确）、强调保守主义（重视个人权利、道德理想）。\n\n波索纳洛曾是陆军上尉，并做过20多年的国会议员，他不仅保持军人的强悍和坚毅，并有很多政客都缺乏的坚定理念和信仰。他不仅宣誓带领巴西走一条与之前左派总统卢拉和罗赛夫（这两位前总统都因贪腐被判入狱）不同之路，而且在10之内，就宣布重大改革，主要体现在十大方面：\n\n削减政府雇员30%\n\n第一，削减政府雇员30%！左派们总是热衷大政府，扩大政府开支，增加雇员，使政府患上“肥胖症”。波索纳洛上任就把整个政府雇员削减近三分之一！这绝对是勇敢之举，展现他的小政府、大社会的理念。川普就职总统后，把美国最糟糕的机构之一国务院的经费和人员削减了三分之一；但只是国务院，并没有达到像巴西这样，把整个政府雇员砍去三成。所以“巴西的川普”，可谓青出于蓝胜于蓝！\n\n第二，任命了芝加哥学派的绝对自由意志论者（Libertarian）出任经济部长。这位新部长宣布，将改革过去四十年的经济体制，巴西要走三化：自由化、市场化、民营化。仅这项任命，就令投资者振奋，巴西股市随之大涨！\n\n第三，把土地开采放权还给农民，废除政府限制，不再像之前左派执政时那样，用保护原住民等理由限制农民自由使用（开采）土地。这是巴西农业走向自由化的松绑之举，受到广大农民的欢迎（但遭环保分子反对）。\n\n第四，削减政府预算。由于政府雇员解雇近三成，巴西政府预算将大幅降低。政府瘦身，将有利于降低官僚主义，节省纳税人资金，促使政府更有效率。\n\n高税收造成经济困境\n\n第五，简化税率、减税。减税还是增税，是走市场经济、还是国家控制，是右派、还是左派的重要标志。全球左派政府都热衷增税，用所谓向富人多征税，来均贫富，谋求社会平等。但实际上这是一条杀鸡取蛋的自我经济毁灭之路，同时也人为造成不平等。因为人的能力和条件不同，经济创造和收入自然不同。强求财富平等，尤其是通过政府强行高税收（不交税可能坐牢），就是共产思路。这种财富二次分配的左派做法，在全球造成的灾难和经济困境比比皆是。巴西新总统上任就提出减税，并简化税率，就是充分自由化，还给人民掌握自己财富的权利，等于信奉美国宪法原则：私有财产神圣不可侵犯！\n\n第六，改革退休金和福利制度。很多国家都有庞大退休金和高福利等问题。退休金和福利过高，会给国家带来重负，最后入不敷出，导致政府破产。巴西新政府致力改革退休金和福利制度，也是在重大问题上迈出关键一步！\n\n第七，致力国营企业私有化、民营化。这更是改革重心，也是经济复苏的关键。英国经济目前是整个欧洲最好的之一，主要得力于八十年代保守派首相佘契尔夫人在任11年大力推行市场化、民营化、私有化。美国经济一直是世界的火车头，也在于当年保守派总统雷根与佘契尔夫人联手，在美国也进行一场“紧身衣”改革，就是给政府缩身，推行小政府、大社会、减税，充分市场经济的政策。人类的经济铁律是：私有的不一定成功，但成功的一定是民营的，国有一定是灾难。美国国营比例是七大工业国家中最低的，只有5%，英国是10%。而法国等热衷社会主义国家，其国有企业资产额在法国总资产中高达70%。结果是：美国失业率目前3.9%；英国4.0%，法国多年都在10%左右，目前是9.3%。巴西新总统上任就推行市场经济，当然使巴西商界振奋，也令全球投资者瞩目，其股票大涨，就是因为人们预感有好的前景。\n\n第八，强力打击犯罪，给警方更大权力。在左派执政的过去14年期间，巴西治安每况愈下；2016年里约热内卢奥运会期间，全球媒体都报导了巴西治安之差。巴西右派新总统誓言反贪腐，打击犯罪，不再像左派政府那样，以所谓人权名义保护了罪犯，限制了警察执法。巴西新总统的新政，使警方振奋，令歹徒丧胆。\n\n第九，取消枪支限制，允许巴西人民自由拥枪。美国宪法第二修正案就是保证人民拥有枪支的权利。巴西的这项重大改革，也是走向美国建国先贤确定的个人权利至上的理念精神。巴西治安不好，人民拥有枪支权，更可保卫自己，反制罪犯。\n\n第十，把教育部的“多元教育局”整个取消。不再把纳税人钱用于“同婚”甚至“变性”等项目。波索纳洛任命了一位牧师担任妇女儿童部长，这位牧师部长上任就强调：男孩是王子，女孩是公主。意思明确：男人就是男人，女人就是女人，反对变性；强调道德，信仰，人类的基本文明和传统。\n\n亲美、警惕中共、联手以色列\n\n巴西新总统不仅内政改革，对外政策也令人耳目一新：波索纳洛总统宣布，巴西退出TPP（跨太平洋协议）谈判，等于跟美国川普一样，不再参加这个大锅饭式的群体组织。也宣布退出联合国移民问题全球契约（对这个契约有美国，以色列，捷克，匈牙利，波兰等国家投了反对票，强调拒绝非法移民涌入，捍卫自己国家主权和安全）。同时巴西要跟美国全面强化关系，今年3月波索纳洛总统将访美，与川普总统讨论美国在巴西建立军事基地。巴西对外政策是：亲美、警惕中共、联手以色列（巴西驻以大使馆迁耶路撒冷）、反制三个美洲的恶棍国家（古巴，委内瑞拉，尼加拉瓜）。巴西新总统非常推崇四国：以色列、美国、匈牙利、波兰；这四国目前都是保守主义政党执政，都重视军事国防，推行市场经济，强调道德力量。\n\n巴西新总统就职典礼，邀请到以色列总理纳坦雅胡、匈牙利总理、波兰总统、美国国务卿庞皮欧。但巴西外长事先就拒绝古巴、委内瑞拉、尼加拉瓜首脑来参加就职盛典。巴西新总统真可谓：是非分明、嫉恶如仇、军人本色，更是一个真正男子汉。在巴西内阁，启用了最多的将军，可谓目前全世界最强悍且理性的政府。\n\n台湾忽视波索纳洛来访\n\n去年年初民调就已显示，波索纳洛是异军突起的黑马。去年2月他以总统候选人身份访问了台湾，随后访问了日本和南韩。但他在台湾却被冷遇，外交部长李大维不见，经济部长不见，更别说蔡英文总统更没有见他。只是让他们一行参观了学校和企业等，台湾外交部一个次长宴请了他们。但中共方面却深知巴西总统候选人访问台湾的意义和份量，当时北京政府就发出抗议，因为这是巴西与中华民国断交之后，44年来第一次有总统候选人访问台湾。中共都认识到的事，台湾的外交部长和总统却不清楚（表现在不重视波索纳洛的来访），罪在李大维，背后是重用国民党党员担任外长的无能总统蔡英文！结果使台湾失去了跟南美洲最大国家的未来领袖建立私人关系的重要机会！\n\n波索纳洛的出现和当选，代表着巴西人民已受够了左派政府的无能和贪腐，他们选择了被称为极右派的总统，就是选择了保守主义价值，选择了自由市场经济道路，选择了个人权利至上的哲学理念，结果是选择了巴西的希望和未来！这是巴西人民的幸运，更是巴西人民的智慧和勇敢！\n\n相比之下，华语世界什么时候台湾会出现有胆识和能力的川普？什么时候中国会出现有自由主义理念精神的波索纳洛？一切要靠人民的觉醒和努力！\n\n（2019年1月10日于美国）\n\n来源：民报\n作者：曹长青",
			"added": 1547315954
		},
		{
			"topic_id": 2463,
			"title": "我为什么离开中国？——一个企业经营者的临别诤言",
			"body": "一、寻得桃源好避秦\n\n2018年初，我在从马来西亚回上海过农历春节的飞机上，用手机写了《大洪水会再来吗？——我的诺亚方舟》一文，百度上还能搜到。当时还没有修宪，也还没有贸易战，后来的局势发展印证了我的担忧。贸易战只是冰山一角，在经济层面中美会达成暂时的和解，但天朝利益集团与普世价值观及国际通行规则的冲突，仍将持续，根源不在一人一事，而在于权力来源于（且至今仍依赖）暴力的必然结果。\n\n三十多年改革开放积蓄了某些制度坚决不改的本钱，后发劣势积重难返，苏东模式窗口期已过。西班牙智利台湾社会能够和平转型，重要条件是其社会财富私有制占主体，公权力的含金量并不很高，民众意识觉醒后其恋栈代价超过弃栈。中国公有制仍占主体，且还在“做大做强”，公权力能够支配全民财富肆意妄为，毒性极强使人上瘾欲罢不能。因此除非奇迹出现，今后中国局势必继续恶化。多数人混混噩噩，部分人看得清但心存侥幸，所谓历史教训，就是很少人能真正从中吸取到教训。\n\n我天性不羁，侥幸有机会选择，危墙不立乱邦不居，今天我选择离开中国，到马耳他共和国居留学习一段时间，顺便拿一张可在欧洲漫游的永久通行证。许多朋友问我为何作此选择，现在我在飞机上，再用手机写几行字，作为回复，也算临别感言。\n\n二、中国经济滑坡已难逆转\n\n事关国运的首要问题还是经济。经济事关每一个人福祉，惰政、蠢政与恶政的不良后果，最终会通过经济问题显现出来。中美贸易战虽兹事体大，但美国民众日用品主要依赖发展中国家，目前大部分仍靠中国提供，近年内难被完全替代，美国政府得罪不起选民，中国政府目前内忧外患，手中本无多少筹码，因此贸易战双方必会见好就收（关于中美贸易战结局的分析，可参阅陈天庸、谢作诗2018年3月写的《中美贸易战：原因、性质及中国的应对措施》）。中国政府被迫降点关税，相当于给本国民众减点税刺激消费，对国家财政影响并不大。更大麻烦在于，贸易战平息后的中国经济，趋势极不乐观。网上我还没看到很详细的中国未来经济预判分析文章，在此说说我的看法。\n\n1、产业外迁最致命\n\n中国外资正以整个产业链相关企业群体外迁的规模逃离。广东胶鞋家俱等多个行业外资企业大量搬迁出境。三星、富士康、优衣裤、无印良品大幅减少中国工厂，耐克、阿迪达斯此前已将生产工厂转到越南。内资企业有条件的也在设法外迁。产业外迁的转折点并非中美贸易战，冰冻三尺非一日之寒，中国政府多年来动辄打民族牌，反日反美反西方，2016年韩国萨德事件激发中国大规模排外，都已让外资企业寒意彻骨。企业从谋划迁移到实际搬迁，至少需两三年，因此2019年起的今后三年，企业外迁潮会一年比一年猛，其后果比目前能预想到的将更严重。\n\n中美贸易战基本还只是嘴仗，美方关税制裁尚未大规模实施，目前并未真正导致中国企业外销成本大幅上升。川普的贸易战只是给外资企业离开中国增加了一个理由。别以为贸易战和解了，要迁移的外企就会留下来。导致企业外迁是因为中国的综合成本过高，首先是制度成本高，加上中国民族民粹主义泛滥，导致外企对中国未来预期不佳，安全感丧失。近来华为孟任女事件天朝昏招迭出，更增加了外资不安全感，必进一步加速外资逃离。\n\n产业外迁对人口众多的发展中国家后果是致命的。青壮劳动力无法贮存，人老了就成为社会负担。中国其他资源禀赋远不能与阿根廷相比，因此说中国将陷南美式的“中等收入陷阱”，太乐观了。看看委内瑞拉与津巴布韦吧，那才是未来中国的映像：暴政朽而不倒，民众苦海无边，年轻一代看不到未来，整个社会看不到改善希望。\n\n香港自上世纪八十年代开始产业外迁，到现在几乎没有了制造业，目前香港金融服务业走向衰退，社会便弥漫绝望气氛。台湾企业外迁程度比香港稍轻，也已导致台湾工人几乎二十年没加工资，年轻人起薪一直停留在台币22K。台湾每届候选人都喊拚经济，都没有起色。中国大陆与港台差距不可以道里计，世界贸易一体化时代，企业随时面对国际市场竞争，制造业企业对成本尤其敏感，民主社会政治家要用高福利讨好选民，专制政体要强力维稳，制度运行成本都很难降低，因此制造业企业只能不断地“逐水草而居”，迁到综合成本更低的地方才可续命。现在东南亚与印度的投资环境不断改善，综合成本已显著低于中国，在中国的外资企业不走就得等死。一些内资企业如果不能转移到成本更低的地方，也很难熬过今后几年。\n\n制造业企业搬迁是件伤筋动骨的事，因此产业一旦转移就不可能回来。中国外资企业产出占中国GDP四分之一以上，加上带动的相关产业，外资企业影响中国40%GDP，50%左右进出口额（可参照中国商务部《中国外商投资报告》，数据为2017年度统计数据）。再加上内资私营企业也已开始大量停产倒闭，今后三五年内，产业外迁将导致中国增加上亿失业人口。其中能够“回乡创业”的主要是五十岁以上的农民工，农村无法提供与城市类似的就业、工资与生活环境，青壮农民工大多数不会忍受农村的贫穷枯燥，农民工城里出生的二代，更是无法接受农村的生活环境。大批青壮农民工与城里出生的农二代，有城留不下，有村回不去，必成社会动荡之源。\n\n贫穷失业是培养民族与民粹主义的温床，民粹主义是专制的最得力帮凶，经济滑坡的后果，绝不只是节衣缩食的问题，首先必引发民粹主义泛滥，不患寡而患不均，中产以上阶层都将成为民粹靶子，再次打土豪分田地是必然会发生的事。唯有在经济未严重恶化前立即启动宪政民主，形成社会多元制约体系，方可制约民粹。中国如不立即开始宪政进程，民粹主义潮流今后几年内将淹没中国，义和团将沉渣泛起裹挟社会。\n\n宪政民主转型需要一定物质条件，饿殍遍野民不聊生时，暴力是暴民唯一懂得的语言，需求层次定律决定了宪政民主制度难以在整个社会普遍贫穷的阶段稳定建立与施行。宪政是君子之争，仓廪实而知礼节，衣食足而知荣辱，如待经济崩溃，民不聊生，宪政民主便是沙上建塔。\n\n经济搞不好，中国没希望。中国经济能否搞好？取决于2019年中国能不能发生颠覆性的制度改变，大幅降低民营企业综合成本。\n\n2、中国企业的成本高在哪里？能否降低？\n\n找准病因才能对症下药。多数学者说中国企业高成本来自高税负与过高的社保，因此大力呼吁减税与降社保缴费比例。其实不然。\n\n中国社保占工资比例近40%，这其实就是所得税，是企业的沉重负担。但中国除北上广深外的大多数地区，通常默许企业只按工人数量的30%左右交社保。\n\n中国税负确实高，尤其税收结构很不合理，生产流通环节而非消费环节承担了主要税负，极不利于促进企业增加积累扩大投资——对不同环节征税的调节效应是不一样的，税负从生产环节传递分摊到消费环节，是有成本的。\n\n流行的谬误认为投资、出口与消费是拉动经济的三驾马车，其实只有私企投资才是拉动经济的唯一动力，出口与消费是有效投资的结果，而非与投资并列的发展动力。中国高税收严重影响企业增加积累扩大生产，很不利于经济发展，减税是必要的。\n\n我自己经营企业，平时与企业家朋友相从较密，我总结民企老板面临的外部困难，普遍来说，约20%来自于重税，20%来自于干预用工自由的劳动法规与社保负担，还有60%左右，来自于官员以检查、整顿、罚款、责令整改、环评标准过高、强制限产、责令停业、拆违、赶人、限制经营范围、限制外来人口子女入学、购房等等各种限制与折腾带来的麻烦，让企业动辄得咎。税收与社保虽不合理，但只要规则清晰，企业还有个明确预期，可以部分规避或提前分散风险负担。唯有政府官员随心所欲的权力之手干预企业经营，以及官吏以执法为名的寻租滋事，如苍蝇防不胜防，最令企业经营者心力交瘁。应对这类骚扰的时间与精力，是企业经营者更大的成本。但由于这种成本难量化、难表述、难避免，学者与主政者常回避这类问题，视而不见。且政府还需养大批冗员以维稳，腐败是专制政体运行的润滑剂，“纵兵劫掠”也是养兵之法。因此官员权力寻租与蛮横折腾企业带来的负担与损失，虽危害更甚于高税收与高社保，现行体制下要想预防与避免，基本无望。\n\n政府官员权力寻租与瞎折腾，比高税收与社保更伤害企业。纪检监察显然解决不了这个问题，官员折腾企业，名义上都有法有据。政府部门高标准立法、选择性执法，让企业普遍处于违法状态，政府官员随时可上门刁难处罚，这是中国所有民企面临的常态。企业大油水多，上门刁难敲诈的官员越多。匹夫无罪，怀璧其罪。古谓灭门的知县，今有随意封门的胥吏。更糟糕的是民企面对公权力侵害毫无救济手段，只能束手待宰。\n\n这几年纪检监察扩权的结果竟是，企业受到的刁难并未减少，不花钱绝难办事，但如没有熟人介绍勾兑，企业愿花钱官员也不敢要，故现在找人花钱摆平官员的中间成本，常大于以前直接给官员红包的支出。另外，财务上如何处理这些用于打点的灰色支出，以防备纪检监察查处官员时以“涉案人员”为名带走企业老板长期羁押，又成为企业的另一麻烦。按刑诉法等规定，杀了人被抓捕24小时后律师便可介入会见，这几年常有企业主被纪委监察带走失联几个月，企业上下与家属竟无从查问下落。被中国纪检监察部门“协助调查”羁押所受的非人折磨，远甚于监狱，这成为很多中国企业家难摆脱的梦魇。有西律师多年前写的《中国企业家都在通往监狱的路上》一文，道出了中国企业经营者的辛酸，至今仍不断被转发。\n\n中国监察法缺乏程序正义，监察机关公然自谓属政治机关，而非司法机关，却可以羁押公民，且不允许律师会见，明显与现代法治相悖。厂卫滥权绝不可能带来吏治清明。恶法非法，监察法不改，中国与现代法治逾行逾远。\n\n官员财产公开与舆论监督，已被全球文明国家证明是最有效的防腐败手段，大数据时代让官员财产公开与接受社会监督，极为容易，天朝弃而不用，非要守着粪坑打苍蝇。当前官员权力寻租又越演越烈，我写文分析过，茅台酒价格可作为中国腐败指数，今年茅台涨价竟与监察委扩权几乎同步。古谓养贼自肥拥匪自重，这微妙关系，谁解其味。\n\n综上，公权力不受制约导致的官吏寻租与随意折腾，是中国企业最沉重的负担。民族与民粹主义增加外资的不安全感，是外资企业的额外成本。\n\n此外政府垄断土地导致高房价，垄断上游产业控制基础原料与燃料等价格，也是中国企业成本上升的重要因素，房价是劳动者的生活成本，也即是用工企业的人工成本，员工工资起码得能够维持其衣食住行。税费水电油气排污路费红包上游原材料等，市场各项成本是环环相加传递的，成本链条上任何一环的成本，也都是另一环的成本。\n\n中国政府对民企管束太紧攫取太多，当前中国民企外有东南亚印度等劳动力成本低廉的竞争对手，内有世界最昂贵政府的盘剥、行政干预与权力寻租，办企业辛苦还不挣钱，老板累死累活只是为政府与员工打工，不堪重负之下企业关门大吉将成燎原之势。即使没有贸易战，中国经济下滑的势头也已不可逆转。\n\n贸易战如持续下去，将重创中国制造业。当然我认为贸易战会暂时和解。但如不能由此带来中国政治制度改良，则中国的发展仍然是他国的威胁，外资企业与外来订单仍必大量转移到他国，中国的制造业实际产出将在今后五年内萎缩近半。\n\n（有人认为凭中国内需市场也可以大体维持现有经济规模，称中国即使少了对美国的出口，也只影响GDP几个百分点。无知之论。设想一个村里没了外出打工收入，各户将只能自耕自织自给自足，结果必是百业凋敝，也许只剩下一个水磨坊。打工收入是村里其他各业兴旺的前提与基础。外贸收入是人民币发钞之锚，而且有了稳定的外贸收入，才能带动配套产业与服务业等百业兴旺。现代金融与服务业，通常可将外贸收入通过信用放大与服务业传递，将经济GDP扩张数倍以上，中国经济目前年80万多亿人民币的GDP，约一半是靠每年2万多亿美元的外贸收入直接与间接拉动的。外贸收入才是推动中国经济多米诺的第一张牌。没有外贸收入，中国有效内需也将大幅减少——付得起钱的需求才是有效需求，没有基础收入，哪来有效内需？如果闭关锁国，中国会逐渐退化回到小农经济，经济大幅度萎缩，社会退步，被世界文明社会抛弃。）\n\n要降低中国企业成本，首先必须大幅降低中国制度成本。要维持中国经济规模，必须维持外贸规模，要维持外贸规模，首先必须留住外资企业。现在中国连内资都留不住，企业家人心惶惶，中国经济还能继续发展吗？退一步，中国经济还能维持现有规模吗？\n\n最关键是，2019年，中国会有制度方面的重大改变吗？如果没有改变，中国经济衰退及其后果将超过一般人想像。\n\n三、大洪水何时再来？\n\n安邦吴小晖被判处18年有期徒刑，安邦保险等部分被政府接管。明天系肖建华被从香港抓回，至今未获自由。万达王健林变卖资产。复星郭广昌的海外投资折戟。马云宣布2019年退任。马化腾刘强东穿红军装朝拜后公司股价大跌，此前刘强东称大数据可助二十年内实现共产主义，作为人民大学毕业生他应该知道共产主义就是消灭私有制，也许他内心已预见自己将被共产？无恒产者无恒心，几个月前强子妻女在侧仍酗酒出轨，很象是无恒心者今朝有酒今朝醉的心态使然。\n\n对他们来说，大洪水已经来了。\n\n很多学者与商人已感受到中国政治与经济的波涛汹涌。\n\n开网店的小店主应也有风雨交加的感觉了。电商法规定要求所有网店都办理营业执照并纳税，依我看这举措加强社会管治控制的意图远大于收税，因为向小微企业征税，其收益很可能低于征税成本。但与几年来大城市大规模封墙关店一样，这些任性专横又愚蠢的管控举措，断了升斗小民的生路，底层民众自谋生路，政府不支持还处处设限，这些管控措施破坏了市场的正常运行，人为加大了市民生活成本与经济运行成本，批量制造出更多困难群众。\n\n国家税务总局2018年11月27日发布的《重大税收违法失信案件信息公布办法》，规定欠税超10万元就上黑名单，经营者将被阻止出境、买房等（称“将纳税信用评价结果通报相关部门，建议在经营、投融资、取得政府供应土地、进出口、出入境、注册新公司、工程招投标、政府采购、获得荣誉、安全许可、生产许可、从业任职资格、资质审核等方面予以限制或禁止”）。\n\n2019年1月1日起施行的《中国人民银行关于非银行支付机构开展大额交易报告工作有关要求的通知》当日单笔或者累计交易人民币5万元以上，或转帐人民币20万元以上（含20万元），就将被列入大额可疑交易进行监控。\n\n大数据时代，人人都毫无隐私可言，有产者更如栏中猪羊，政府要清算处罚宰杀，易如反掌，到时谁能幸免？\n\n多数人将会一直到自己与亲友谋生无着、安全有忧时，才恍然发觉，原来自己周边已是洪水齐肩，无处可逃了。\n\n对2019年短期经济形势，许多人持审慎乐观。我对短期也不乐观，对长期更悲观。前几天央妈降准1%，据称可释放出15000亿人民币。经济滑坡时中国政府必按老套路继续大规模放水刺激经济，继续扩大公共投资以稳就业稳增长，但没有效益的投资就是消灭财富，许多政府低效项目建成后收益不够付利息，还须赔巨额运行与维护成本，成为全民负担。\n\n中国社会缺的不是钱，是挣钱机会。中国民企海外投资渠道被外汇管制政策堵死，国内有利可图的行业被国企垄断，民企各项成本太高，普遍不挣钱，这才是中国经济的病因所在。\n\n不除病因，只靠政府继续印钞放水扩大公共投资拉动经济，相当于进一步将社会财富向政府手中转移，稀释民众手中的财富。这样做的结果是进一步加强了政府掌控经济集中度，政府掌控的经济运行效率显然远低于民企效率，现行政策还在不断降低中国经济运行效率。这是饮鸩止渴挖肉补疮，放任中国经济陷入恶性循环。大印钞大通胀，是现行政策的最终必然结局。城市房产将成有产者最后保值工具，但同时不动产也将冻结有产者的财富，坐等官府清算盘剥。中国楼市的结局，我在《中国楼市何时跌》一文里预测过了。现在的中国经济就是一艘正开往深渊的太平轮。如果没有根本性改变，船毁人亡的结局谁也逃不过。\n\n四、社会动荡临界点：维稳者成为被维稳对象\n\n中国目前正处于社会经济与政治变化转折临界点，中国社会稳定与否，首先取决于经济能否稳步增长，至少不倒退。国际竞争激烈，各国经济发展如逆水行舟，不进则退，中国经济失速必使产业大量外迁，导致大量失业，引发社会动荡失序。\n\n问：中国社会全面动荡失序的临界点在哪？\n\n答：财政养不起庞大的吃公粮群体，大批维稳者成为被维稳对象之时。\n\n当前5600万退伍军人已成维稳对象，此前他们曾是维稳者。3000多万事业编制人员将是第二批被维稳对象，财政已无力长期供养他们，但他们中许多人已丧失自食其力的能力。\n\n待到经济下滑导致政府财政汲取严重不足时，协警与城管等部门中大批临时工将首先被裁，侥幸保住泥饭碗的，也只能拿微薄工资干脏活苦活，食之无味弃之可惜。\n\n从秦朝下级军官陈胜吴广到明朝官营驿站下岗驿卒李自成，捕快张献忠，一直到辛亥革命，社会鼎革首倡者主要是失意的体制内人员。所以一味扩充维稳队伍很可能是养虎为患，维稳需要政府财力支撑，一旦财政汲取不足，最有可能成为社会动荡主力的，往往正是原来的维稳者。不改良制度，只靠暴力维稳，一定是越维越不稳。\n\n中国资源贫乏人口老化，历年各种社会矛盾不断累积，社会原子化，缺乏士绅阶层，缺乏宗教信仰，社会一旦乱起来，必如负载过重的大货车坡道后滑，却没有刹车。中国须多少年才能走出乱治循环？大清后期幸有曾国藩左宗棠李鸿章等名将勉力维持，太平天国也乱了十四年，死人一亿多，现在体制内持续逆淘汰，恐怕难觅曾左李了。\n\n乱世社会动荡失序，人人都是受害者。兴亡皆是百姓苦，别指望社会动荡后一定会出现一个更好的社会。\n\n经济衰退社会动荡的中国，会回到丛林社会。手中有一点点权力与武力者，都将变本加厉盘剥民众，敲骨吸髓。同时自己也朝不保夕，时刻可能成为他人猎物。商人成为权力食物链的终端食物，各种变相的打土豪分田地政策将明目张胆，甚至获得大众欢呼喝彩。目前几个商界大佬已成笼中猎物。影视明星们粉丝无数，平时看似神通广大，但近半年来他们面对公权力各种关门打狗式的查税清算盘剥，噤若寒蝉束手无策，一些民众还拍手称快。如轮到你我，谁比商界大佬与影视明星们更有自保能力？\n\n经济下滑也将导致中国最大的中产阶层——干部阶层的生活水平全面下降，靠山吃山，到时候权力寻租现象将更加失控。中国纪委与现监察委，多年来以非法治的严厉手段管控干部，一方面对干部有相当的威慑作用，一定程度起到了抑制公权力寻租的效果；另一方面污染了法治的源头——现在干部是对法治最没有信仰敬畏的群体，做事消极怠工，对监察委畏而不敬，工作动力全靠高福利与灰色收入撑着。一旦干部的现有收入与高福利难以为继，铁饭碗成为鸡肋，那时官员将对纪委监察部门不敬也不畏，而政权维稳还需要他们，其权力寻租必更肆虐，法不责众，监察部门明知普遍贪腐也只能挣只眼闭只眼，且监察人员一样会利用权力寻租，既敲诈“肥鸭子”干部，也可能猫鼠合流，合谋敲诈关联的企业主，共同分赃。\n\n理论上，中国挟其经济体量与产业链完整，闭关锁国也可象康乾时代一样自给自足，只是那样的话，民众生活品质会退回到上世纪八十年代初。其中受影响最大的自然是中产阶层——而中国干部就是当前最大的中产阶层，到时必群体性抗命，对上阳逢阴违，对下纵容劫掠。非民选的官僚阶层，历来具有单向棘轮效应：有利于其扩权寻租的政令，如扩大投资、增加行业限制、加强对企业与民众管治，必变本加厉迅速落实，与此相反的事，必一拖二推三对抗，三令五申，仍难落实。\n\n官僚阶层有其自己利益与相对独立性，当前官僚阶层对邓式“改革开放”有共识，正明里暗里顽强抵抗极左派开倒车，在努力将倒开的车子拽住，往胡温时代的方向推。近来一系列自相矛盾的政策，就是激烈博弈的体现。但他们只是希望中国政局回到胡温时代，那个较现在相对自由宽容的年代——包括对官员腐败的宽容。而世界宪政民主潮流已浩荡向前，中国内外的环境也已发生重大变化，互联网加速了世界一体化，社会停滞即是倒退。\n\n“保卫改革开放”如被曲解为回到江胡时代，绝对解决不了上文所说的降低企业综合成本的问题。稳定压倒一切的维稳思维，解决不了执政党自身恶性膨胀的问题。中国现在的问题就是这种维稳思维的结果。执政者拿刀砍百姓容易，砍自己就下不了手，所以天朝多年口喊精兵简政，越减机构越臃肿，已成为中国社会不可承受之重。\n\n因此有学者提出“告别改革开放”，可以理解，但如何做到？保卫派与告别派的目标并无区别，应该怎么样，认识都一致。能够怎么样？不是越激进者就越高尚，不是越激烈就效果越好。动机不重要，行为客观效果更重要。能够一步飞跃当然好，如何做到？如不能一步飞跃，那么日拱一卒，积跬步致千里的渐进改良，不该被嘲讽。真正的改革开放是包括执政阶层在内的中国人共同利益所在，需要“咸与维新”。\n\n需明白当前中国只有两项选择：或前进过渡到民主宪政，和平转型；或退回到极权专政，最终走向崩溃。\n\n五、维稳四策\n\n我的许多朋友在国内建言抗争，知其不可为而为之，我对他们深怀敬意。2019年元旦前，我们近百位朋友以《中国百位公共知识分子“改革开放”四十年感言》为题，各人说了一句话。我只是小商人，不算知识分子，但与他们同气相求，也忝列其中说了句：有利于私有产权保护与自由市场经济的才是改革，改革方向应该是增加人的自由。\n\n中国如能避免动荡和平转型，是国人之幸。社会变革要以人为本，兴亡皆是百姓苦，什么主义不重要，民众福祉为重。从这个角度说，我是坚定的维稳改良派。位卑未敢忘忧国，在此我提出四点施政建议：\n\n1、实行宪政，接受普世价值\n\n2019年内召开政改会议，有序推进宪政民主。宪政即是限权，对政府限权，才能落实政府部门精兵简政。政府简政减人，才能对企业与民众减负。对民企大幅减负，才能稳经济。\n\n中国实行民主宪政，接受普世价值，才能真正融入世界，中国的发展才不会被视为对文明世界的威胁。中国才能发挥比较优势，在世界贸易分工体系中保持现有份额。如此执政者才是真正执政为民，造福全体国人。\n\n宪政是人类世界共同文明成果，没有什么地域性与特殊国情不能适应问题。二战后麦克阿瑟将几个美国年轻人关在一处密室里九天，完全按美国人思维捣鼓出一部日本宪法，七十多年来一字未改，助日本发展成了国民幸福指数居世界前列的现代国家。\n\n接受宪政首先是接受政治多元，明智的执政者要主动培养温和的反对派，促进社会和平转型，这样才能避免社会血腥冲突。没有永远的执政党，掌权时加于他人身上的，最终都会回到自身或后代身上。种瓜得瓜，与暴力统治相随的是血酬定律。\n\n思想自由与信仰自由，是宪政民主的基础。当前封号删贴压制言论自由，打压迫害基督徒与部分少数族群，严重侵犯人权，应当立即停止。信仰自由是基本人权，宗教是良善社会的稳定因素。\n\n拒绝普世价值，放着大路不走，非要“艰难探索”，非蠢即坏。如以一己之私绑架整个执政阶层一同走向深渊，终会被觉醒者抛弃铲除。从齐奥塞斯库萨达姆卡扎菲，独裁者的下场前车可鉴。中国体制内汇集了中国大部分精英，变革也是他们的迫切需要。有朋友预言，上如不主动改行宪政，二年之内，必有巨变。我不敢如此乐观，但我知道，现状绝不可能持续。如无良性巨变，开倒车结果大概率是车毁人亡，那时候所有人，要么成为施暴者，要么成为暴力的对象，一些人既是施暴者又是受害者，一切中产者，包括干部群体、白领与企业主，都将是暴民暴力指向的对象，现在的左中右，其实都属中产，到时统统玉石俱焚。\n\n实行宪政是兼顾利益受损者，保全既得利益者的万全之策。\n\n2、放开除军事工业之外的所有行业垄断。\n\n全面放开对银行、石油、通讯、移动、互联网、电力、铁路、高速公路、航空、煤、气、水、矿产、冶金、化工、医疗、教育、保险等所有行业的国有垄断，能释放巨大经济活力。\n\n中国实际有四大征税系统：国税地税社保已合并，算一家。国企其实是第二征税系统，国企垄断了民众躲不开的“国计民生”行业，国企垄断溢价具备税收特征：固定、强制、无偿。国企低效浪费，只会消灭财富，主政者应也很清楚，但国企是党产，是利益集团的小金库，国企亏损相当于征税成本，利益集团绝不会轻易交出的。土地财政是政府第三征税系统，现在地方政府卖地所得一年达五万多亿，少了土地财政，许多地方政府得停摆。四是可随意印钞发债的中央银行与财政系统。印钞通胀稀释民众存款购买力，掠夺升斗小民财富于无形，印钞是收铸币税，富人还可通过购房换汇抵御通胀，通胀最大受害者是穷人。\n\n去产能与环保风暴，去的是民营企业产能，保的是相对低效的国企，严重破坏社会生产力。现在面对经济滑坡，苛政略有缓和，但许多民企已元气大伤，肆虐不受节制的公权力如达摩克利斯之剑高悬民企头项，随时可让民企老板人财两空，何况政府从未承认做错，很多企业仍永远处于半违法状态，战战兢兢信心不再。\n\n只要仍坚持做大做强国有经济，民企就没有发展空间。裁判员坚持要下场踢球，那么游戏就无法继续。只有放开国企对上游行业的垄断，让利于民，中国经济才能恢复活力。\n\n3、放开对土地利用的过多限制，对土地功能松绑。\n\n土地是国民最重要财富，中国土地垄断为公有，已成为限制土地财富效应发挥的桎梏。土地私有是大方向，目前急需政府首先放松对土地利用的过多限制，以市场手段调节土地需求，放开对土地功能、容积率等等的过多限制，允许土地使用权由民企与民众个人自由交易，这样便可极大释放土地作为最重要财富的潜在价值，减少土地闲置浪费，为国民创造更多财富。\n\n2018年12月23日至29日举行的第十三届全国人民代表大会常务委员会第七次会议审议通过的《土地管理法》修正案草案，确定集体建设用地可以不经过征收，直接进入市场。为打破政府土地垄断开了一个口子。但这必与土地财政产生冲突，地方政府既是利益主体又是裁判员，岂会允许“农民集体”口中夺食？如废除土地财政，中国大多数地区的地方政府将立即停摆。如何才能让地方政府对这与己争利的法律让步，不会以公权力横加限制，使该法条规定的权利永远停留在纸面上？ ——必须大幅减少地方政府的事权，为地方政府减负。\n\n中国地方政府间的主动竞争，曾是推动经济发展的重要推力。这前提是土地既然已经被强制公有，那么通过地方政府间的竞争，竞相开发工业区，将农地转变为工业用途，释放土地级差收益，客观上也有助于初步明晰产权，地方政府与官员获利的同时，也推动了中国经济快速发展。在这方面各地方政府就是一家家公司，公司间竞争降低了投资者的初始进入成本。中国在基础设施建设与城市建设方面，“体制优势”是很明显的，中国城市建设的效率确实世界第一。但到现在，这个土地公有制基础上地方政府竞争的特殊红利，已经穷尽，土地成了政府攫取民众财富的重要工具，高房价透支了普通民众大半辈子的收益，企业员工的居住成本，就是企业用工的工资成本，高房价已成为民众与企业不可承受之重，公有制土地资源的配置低效浪费又显失公平，到了不改不行的时候了。\n\n释放土地利用方面的制度红利，对各方都是帕累托改进，目前地方政府与企业都有极大积极性，需要改变的是中央对土地利用的僵死控制，所谓18亿亩耕地红线，纯是拍脑袋决策，新的遥感数据显示，实际中国现有耕地超过23亿亩，拿出5%便足以满足工业化与城市化的需要，可大幅降低民众生活成本，降低企业综合成本，提高中国企业国际竞争力。\n\n4.取消户口限制，取消附加于户口上的特权。\n\n城市化趋势是大城市化，大城市大大提高经济与创新效率。中国严格控制特大城市的发展，逆大城市化，严重损害经济效率与创新效率。中国控制特大城市发展出于政治考量，担心经济滑坡后大量失业人员集聚于大城市，成为动乱之源。但人是活的，大规模回乡创业显然是骗人，农业劳动低效低收益，且中国农村劳动力一直严重过剩。\n\n取消大城市户口限制，允许国人自由在大城市购房、居住、就业、就学，取消附加于户口上的种种福利，让人力资源自由流动，便能极大释放经济活力。目前驱赶“低端人口”的种种做法，侵犯人权，损害经济，也不可能真正利于社会稳定。民以食为天，经济好社会自然稳定，经济不好，再严苛的限制也无法将农民禁锢于土地上，无法阻止农民为生存的各种抗争。\n\n以上这四条建议合起来就四个字：增加自由。\n\n经济发展、企业创新，都是私营企业自身的本能需求，本不需要政府太费力引导，真正保护好私有产权，放松土地利用限制，给民众更多自由，经济发展与创新都是必然的结果。而要真正保护私有产权，须先对政府限权，政府解除国企行业垄断与资本管制，把言论自由还给民众，这是产权保护的基础条件。贸易战与很多国际冲突，根源皆是价值观冲突，中国执政党如实行宪政，退一步便海阔天空。\n\n目前中国社会变革需要体制内外有远见的精英诚意合作。和平转型应当是体制内外精英协作的结果。宪政限权需要精英间相互尊重，充分榷商，求同存异。\n\n中国精英目前仍大多在体制内，体制内外的社会精英们，更清楚社会问题所在，更容易接受宪政。消灭了精英的社会，必定只剩下愚昧鲁莽无序。宪政的本义是接受多元利益主体和平榷商，体制内精英也是重要利益主体之一。社会和解需要博大胸怀，我们的祖辈父辈已流了太多的血，不要再流血，不要再使用暴力，靠暴力建立不起宪政民主——革命者付出的代价越高，越不可能放弃到手的权力，那时革命者又会成为另一专制者，屠龙者又会变成恶龙。任何权力都需要制衡，宪政不是夺权，需要的只是对公权力限权。\n\n如何让拿刀的手放下刀？当他们感受到没有威胁的时候。和平而坚韧的宪政民主改良主义者，是中国仅存的和平转型希望所在。如仍然简单粗暴地打压他们，则会错失中国的和平改良机会。执政阶层长期暴戾的施政过程，累积了太多的仇恨，如何平和主动地转型，解决权力和平交接的问题，是执政阶层的最大利益所在。台湾当年二二八的血腥记忆犹新，38年戒严白色恐怖，也不乏血债民怨，最终和平转型，四百万外省来的“统治阶层”，与本省籍民众和睦相处，台湾华人用宪政民主解决了历史清算问题，已为社会和解与平稳转型作了很好的示范。\n\n（我以后有时间再写一篇《和解与转型正义》，详细说说这个话题）。\n\n中国新的历史转折已经开始，我们都有幸亲历历史。是顺应潮流，推动社会和解与宪政转型，还是任性妄为，玉石俱焚？在中国这艘大船上的所有人，为了你的家人与亲人，为你自己与子孙后代，请担当起历史使命，从自己做起，拒绝倒退，践行宪政。释放善意，促成社会和解与良性转型。\n\n为政者，请放弃斗争思维，与世界和解，让民众自由。\n\n以上四条建议，任何一条都能释放巨大的发展潜能。如能在今后三五年内全部做到以上四条，中国仍大有希望。中国正面临越来越大的内外压力，如2019年天朝在这四个关键问题上仍逆流而动一条也不改，委内瑞拉与津巴布韦就是我们不远的未来。\n\n那么朋友们，自求多福，能离开的，及早安排。\n\n六、结语：地中海畔，春暖花开\n\n仍放不下家国情怀，倏忽间我已年过半百，世界还有多少未知值得探索，远方有多少风景值得拥抱。造物主创造了我们，是为了让我们享受生命、爱与安宁，不是为了让我们互相仇视怨恨互害。如果你在故国不能舒心如意，只能尝试去迁徙，去寻找，人类的历史就是迁徙史，天涯何处无芳草。\n\n我已能从飞机上俯瞰地中海的粼粼波光，我知道此刻中原大地正白雪皑皑寒风凛冽，而此时地中海沿岸恰是暖风和煦花开正妍。欧罗巴是上帝垂顾的地方，地理位置上，马耳他恰是地中海的“海心”，地中海数千年波澜壮阔的历史，凝结成马耳他这个天主教小国的祥和安宁，这里是基督教从中东传播到欧洲的第一站，仅半个新加坡大的欧洲小岛国，七千年文明历史赋予她建筑丰富内涵，蓝色海洋文明孕育了她的智慧与文化，英吉利帝国150多年的殖民统治带给她宪政法治与悦耳英语，地中海的蔚蓝衬映着马耳他当地特有石材砌成的历史建筑，色彩明亮而柔和。我正要降落到她的怀里。\n\n朋友们，以后欢迎你来马耳他找我游玩，地中海是维纳斯的故乡，永远波光潋滟风姿绰约，地中海美食与宜人气候世界闻名。人生几何，欢迎你抽空来地中海，与我把酒临风，纵论天下。我已先到一步，我在地中海马耳他岛，等待你来。\n\n注：我在香港飞马耳他的航班上，用手机写的此文草稿。现在我已到马耳他共和国，居住下来了。中国春节前夕，马耳他温暖如春。\n\n我们马来西亚的诺亚方舟也备好了，我与朋友们买的吉隆坡几十套房屋大部分已经由运营airbnb的公司经营管理，平时短租为主，随时可自用与接待朋友。但马来西亚国家的第二家园十年居留计划暂停了，估计马来西亚政府要重新评估第二家园居留计划了。我的十年签已近到期，如何续展待复。马来西亚是非移民国家，第二家园也只是十年居留许可。现在全世界都在逐渐对中国人关上移民大门，发达国家中目前只有地中海周边几个国家还在以较低门槛接纳移民，我选择再办个马耳他共和国永居，方便到欧洲其他申根国旅行。地中海温暖舒适，马耳他是英语国家，存25万欧元就可获得永居权，手续最便捷。一位野夫兄原大理山水间小区的邻居，现已移居马耳他，在马耳他一家律师所兼职做翻译，帮我申请了马耳他永居手续，免了我移民公司收取的中介费，帮我直接与马耳他共和国移民律师沟通，更便捷高效。我在文后给打个广告，表达谢意。马耳他还开放小孩留学家长陪读。要办马耳他移民与留学的，加这微信二维码，我的朋友们可免中介费，帮助直接快捷高效地与马耳他移民律师事务所及学校对接，办理移民与留学手续。有意办理马耳他移民与子女留学的，请扫此微信\n\n来源：博客\n作者：陈天庸",
			"added": 1547464297
		},
		{
			"topic_id": 2470,
			"title": "美专家：美国应切断部分中美经济关系",
			"body": "中国电讯龙头企业华为的总裁任正非近日对外辩解，华为从未替中国政府进行间谍活动。但美国方面对此似乎并不买账，有美国专家近日表示，美国应该切断部分同中国的经济关系，以防止技术盗窃。\n\n任正非的这番表态显示出，华为近来在国际上承受着巨大压力，尤其是来自美国的压力。但不仅是华为，去年以来，还有中兴、晋华等中国高科技企业受到美国的制裁和限制。这和当前的美中贸易战有直接的关系。\n\n美国政府在美中贸易战初期，就强调贸易战的目的之一是想制止中国企业的技术偷盗和强迫技术转让等不公平贸易行为。这些现象在美国国内早已引起普遍的关注，但如何对之作出回应，却有很多不同的争论。\n\n是制裁中国企业？\n\n美国企业研究所（American Enterprise Institute）资深研究员史剑道（Derek Scissors）和卜大年（Dan Blumenthal）近日在《纽约时报》发表文章，认为以关税为主要工具的全方位贸易战效果有限，而应该通过制裁相关企业，来切断部分同中国的经济关系。具体的制裁对象是因为技术偷盗和强迫技术转让等手段而受益的中国企业。\n\n自由至上主义学者夏业良对此表示了赞同，\n\n“这个主张是可以实施的，因为对有一些，这类型的企业实施一段时期的制裁，如果没有明显的改进，或者性质上没有发生根本的变化，那么以后就可以摒除他们。”\n\n还是关税贸易战？\n\n制裁中国企业的主张，对美国政府目前的政策提出了挑战。但此前，美国贸易代表莱特希泽已经表示过，关税贸易战要达到的效果之一，也是让美中两国的经济部分脱钩。这种脱钩的主要表现是，美国企业正在迁出中国。\n\n贸易战以来，有越来越多的美国企业打算，或正在试图把产业链迁出中国。根据去年年底，华南美国商会对在中国南部的219家美国公司的调查，其中64%的公司称，他们可能会把生产线移出中国，同时有超过70%的公司考虑延后或取消在中国的投资。\n\n美国南卡罗莱纳大学艾肯商学院讲座教授谢田也分析了关税贸易战所产生的这种效果，\n\n“产业链的外移实际上在贸易战之前已经开始，韩国、美国的公司都在撤出中国，而现在实际上在加速，美国的公司实际上在寻找替代中国的工厂。中国已经不再是世界工厂，实际上世界工厂已经转移到越南、柬埔寨和印度等国。”\n\n自损八百？\n\n但是，通过关税贸易战，让美中经济脱钩的方式仍有不少争议。曾担任美国贸易代表的前世界银行行长，罗伯特·佐利克（Robert Zoellick）近日在接受香港《南华早报》采访时指出，通过关税贸易战让美中经济脱钩有很大难度，因为这个过程会使美国蒙受损失，就像搬起石头砸自己的脚。他分析说，在美国计划增收关税的2000亿美元中国商品中，50%以上是工业生产的中间品。所以，关税措施会使美国经济成本加大。\n\n谢田认为，美国能够承受由此带来的损失，\n\n“对美国消费者来说，可能面临着消费价格稍微上涨一点，但如果不引起通货膨胀的话，也不会导致任何问题。但对中国来说，这就是一个毁灭性打击，因为产业链一旦迁出后，这个过程就无法逆转。”\n\n损失不大\n\n史剑道和卜大年在给纽约时报的文章中则主张，不通过关税，而是单独制裁相关中国企业，来切断部分美中经济关系，不会给美国带来太大的经济损失。中国退出后，会有美国的盟友国家马上补位。\n\n他们认为，对美国真正重要的是技术和知识产权得到保护。\n\n来源：自由亚洲\n作者：王允",
			"added": 1547619432
		},
		{
			"topic_id": 2483,
			"title": "税收去哪儿了？全国“书记”4890万人 一年花2.4万亿",
			"body": "【希望之声2019年1月17日】（本台记者郑清源综合报导）日前，中国大陆网络有一篇文章热传，作者测算出全国共有正副书记约4890万个，按每人每年年薪五万，即24000亿。四千多万专职书记的人口规模，相当于一个欧洲大国了。网友感叹，终于懂什么叫吃饭财政了。\n\n记者查了一下，这篇名为《中国“书记”大数据，触目惊心》的文章，数据最早来自时任北京大学新闻学副教授焦国标研究的成果，2005年他在BBC中文的一篇文章中还提到研究获得的主要数据。\n\n也许，是因为现在经济加速下行、民生凋敝、社会矛盾激化，人们再次聚焦于吞掉中国税收支很大部分的官员们身上了。\n\n中国“书记”共有4890万人？\n\n焦国标分析，自中共中央至村党支部，各级党组织共有现任正书记1630万，占国民总数的1.25%。其中全国行政系统（各级党委和政府）共有党委书记约107万多个，全国国有企业、集体企业和私营企业里共有党委书记约967万个，全国事业单位里共有党委 书记约400万个。三块正书记总计约1630万。如果按一正二副计算，全国共有正副书记4890万。\n\n在《中国“书记”大数据，触目惊心》文章中，作者也做了比较严格的测算，做了举例。\n\n他先计算了政府机构，因为中国各级政府是党、政两套班子，而政府机构共分中央、省、市、县、乡和村（城市里相对应的是社区居委会）六级，所以书记也分六级。按照官方公布的各级行政区划统计数量，他先得出全国有省委书记34个，市委书记333个，县委书记2861个，乡党委书记44067个，村委书记（村支书）663000个，城市社区居委会书记77000个。这一组数字加在一起，一共是787295个。\n\n然而，这只是很笼统的计算，实际上各级机构里面还有很多错综复杂的“褶皱”，而且还有很多事业单位和企业里面也有专职书记。他还计算了各级行政褶皱的里面藏着的书记和企业等的书记，称仅北京中央机构就有11480个书记：\n\n中央机构分中央和国务院两套班子，中央下设二十一个、国务院下设五十二个部级或副部级机构，加在一起是七十三个。这七十三个部级或副部级机构就有七十三个同级别的书记。\n\n此外，全国人大、全国政协、最高人民法院、最高人民检察院、团中央、全国妇联和全国总工会，这七个机构，各有其书记，共七个书记。与上述七十三个书记加在一起，一共是八十个书记。这七个机构，每一个机构的建制规模（不是指行政级别）都相当于一个部。\n\n这即是说，在首都部级规模的机构，共有八十个。每个部级规模的政府机构下面，各有从几个到几十个不等的局级机构。比如统战部下设九个局级机构，中国人民银行下设十八个局级机构，农业部是二十个，教育部十九个，卫生部十五个，劳动和社会保障部十五个，司法部十六个。\n\n外交部复杂一些，北京本部下设二十八个下属机构，另有二百多个驻外使领馆，还有十个驻外社团，加在一起总共约有二百五十个下属机构。平均按每部下设 二十个局级机构计算，八十个部共有一千六百个局级机构。一个局有一个局级书记，于是中央八十个部级机关里也就有了1600个局级书记。\n\n局下面设处，一千六百个局，平均每个局设八个处，就共有12800个处级书记。至于有些大处下可能还设科，这里就忽略不计了。\n\n80个部级书记，加上 1600个局级书记，加上12600个处级书记，一共是14480个书记。这即是说，仅首都北京中央机关里就有14480个党委书记。\n\n焦国标的BBC文章里面则对于事业单位的书记们做了说明，他分析：\n\n全国共有事业单位130万个，一个事业单位起码有一个书记，这就有了130万个党委书记。可是许多事业单位里并不是只有一个书记，而是有很多个书记。\n\n一所大学只是一个事业单位，可是里面的书记职务就是几十个，或上百个。比如清华大学里的二级机构有100余个，河南大学有二级机构62个，书记数目就分别是100来个和60来个。\n\n中国共有普通高校1552个，每个高校按50个二级机构计算，全国普通高校里二级党委书记就有77600个。再如中国社会科学院，只是一个事业单位，但是下面有8个职能部门和34个研究所，这样起码有42个二级书记。\n\n焦国标称他的数字就是这么一步一步分析来的，很复杂。\n\n吃饭财政，吃掉的不仅是“饭”\n\n中国的财政政策长期被认为是吃饭财政。吃饭财政预算的核心就在于解决政府供养人员的吃饭问题，包括财政供养人员的工资、奖金、各项福利以及公务人员的办公费用。\n\n中国庞大的党、政官员体系，特别是书记—这种与行政官员重叠多余的党官，更是消耗了大量财富。保守估计，4890万个书记，按每人每年年薪五万，即24000亿。而这还没有计算其需要配备的办事人员、办公场所、车辆和办公消耗等费用。\n\n这必然得地方政府财政收入越多，同时也导致政府根本无暇顾及普通市民的社会保障问题。\n\n中南财经政法大学教授乔新生认为，地方政府为了加快经济发展的步伐，通过设立平台公司从国有商业银行获取大量的资金，加快基础设施建设步伐。可是这样做的结果非但不会增加主要城市居民的实际收入，反而有可能会导致主要城市居民的生活成本不断增加。\n\n乔新生认为，要尽可能地把吃饭财政变成民生财政，一方面精兵简政，通过机构合并，大刀阔斧地砍掉国家机关，减少政府公务开支；另一方面必须尽快把财政收入主要用于解决普通居民的实际问题。\n\n去党留政才能解决根本问题\n\n中共在过去不同时期曾经讲过党政分开，但是最后都不了了之。\n\n例如，中共改革开放初期，“党政分开”一度是中共推进政治体制改革的热词，但是八九年之后，许多人指责“党政分开”等改革实际上等于放弃中共对政府、人大、司法、国企和事业单位的领导权，结果必然是架空中共的领导地位。从那之后，中共又开始强化党的统治。\n\n到了今天，中共的这种党政不分、党国不分，还滋生了严重的腐败、官僚、扯皮、对经济的乱伸手，造就了世界上最庞大的贪腐集团。\n\n历史学家辛灏年曾经指出，中共共产党不会改良，党政分开不能解决根本问题，去党留政才是根本出路，没有共产党才有新中国。\n\n责任编辑：宋月",
			"added": 1547783449
		},
		{
			"topic_id": 2485,
			"title": "唐明：「歡迎貴國給他們一個教訓」",
			"body": "歷史學者和作家張宏傑最近推薦一本「1860 年華北戰役紀要」（The North China Campaign of 1860），由當時英國隨軍翻譯 Robert Swinhoe 所著，已經譯作中文，其中一些細節非常值得玩味：\n\n第二次鴉片戰爭英法聯軍遠征中國，為數 2.5 萬人，軍糧是一個大問題，但是很快便迎刃而解。\n\n聯軍先後佔領定海、大連灣和煙臺之後，據有渤海灣作為基地，就在大本營外開闢市集，很快附近村民都聞風而至，頗具規模。除基本糧食蔬菜、水果之外，常常能買到上好的肉品，譬如羊肉和松雞，前者由 5 至 12 先令不等，後者只要兩三便士。\n\n由於聯軍軍紀嚴明，出手闊綽，信用良好，村民非常樂意來做生意。\n\n當然，偶然也會發生搶劫，據英國人記載，法軍曾搶過村民的豬隻，但受到軍法懲處，施以鞭打；軍隊裡不老實的劫匪，多數是從廣東和香港僱來的苦力。\n\n根據這本紀要：清兵出了名吝嗇、粗野，相比之下聯軍大方、有禮，因而深得村裡姑娘們的好感。村民還和這位翻譯主動攀談，大吐苦水： 「官兵欺壓百姓，大家叫苦不迭。為了趕走你們，朝廷強迫我們修建要塞。但我們深信，你們來此的目的只是通商，這對兩國都有利！」 可惜 Robert Swinhoe 沒有記載對方是甚麼人，但可見頗有頭腦和見識，能夠明辨是非好壞。\n\n村民看見聯軍善待俘虜，都十分震動，因為滿清對待英法俘虜，手段殘酷得多，因而村民都站在聯軍的一邊。聯軍取勝之後，村民紛紛歡呼： 「這次貴國真是給了那些官兵一個教訓！」\n\n當然，因為這本紀要出自英國人之筆，對聯軍肯定有溢美之詞，可信度要打一些折扣。但重點是，作者聞言大為困惑：何以中國人不擁護自家的政府和軍隊呢？\n\n當時歐洲已經經過拿破崙戰爭，現代民族國家的觀念深入人心，聯軍看到中國村民對戰爭的態度，和 40 多年前他們的父輩一樣，只關心有吃有喝，有熱鬧看就好，大不以為然，認為這是一種落後愚昧的觀念。\n\n聯軍士兵相信「國家興亡，匹夫有責」，顯然中國人不是。\n\n回顧歷史，當今的人也很鄙視清朝人的「民不知有國」，卻往往忽略了後面那句「國不知有民」。當年的英法聯軍也是如此，最關鍵的問題他們沒想明白：中國（或者說大清）並不是一個「民有民治民享」的國家，這個國家並不屬於國民，恰恰相反，國民倒是國家財產的一部分。\n\n官府和官兵不屬於國民，也不代表國民，當然不會為民服務，官兵無非擔正旗號的強盜，所以村民並不 care 官兵的勝敗和死活。而且，自由通商，開放市場，搬動的是官府的芝士，而獲益的是普通人，這個道理，一百多年前的清朝人也心如明鏡。\n\n這一切聽起來都很熟悉吧？\n\n因為直到今天，至少在香港，民意依然如此，因為最關鍵的問題沒有變過。「美軍來了我帶路」這種玩笑，並不是因為香港人不愛香港，天生軟骨頭，而是因為這個政府，沒有一丁點香港人能說了算，甚麼明日大嶼、垃圾收費、強積金，律政司的選擇性起訴，凡此種種，香港人都只能乾瞪眼，真箇吹脹。\n\n如果今天的香港人，依然和當年大沽村民一樣，由衷「戀殖」，難道不是有現實理由的嗎？只因為「洋人」比較講信用，大致公道仁慈，曾經為香港人的利益服務；正如村姑喜歡洋兵，也是經過比較而得出的必然結論：對方僅僅是出手大方，行為有禮，就足以令她們忘卻愛國的義務了。\n\n看，美國一旦放風檢討香港關係法，而令特區一班權貴臉色大變，前倨後恭，醜態百出，香港人也不禁拍手叫好，也是因為 「這次貴國真是給了那些官兵一個教訓啊！」",
			"added": 1547814847
		},
		{
			"topic_id": 2487,
			"title": "中共受多方讨伐 公安部长要求防范“颜色革命”",
			"body": "【大纪元2019年01月19日讯】（大纪元记者张顿报导）过去一年里，大陆退伍军人、疫苗受害者、P2P受害者等维权、抗暴群体事件此起彼伏，中共为了应对，可谓疲于奔命。步入2019年后，适逢中共镇压大陆各民族、团体的周年，中共高层接连喊“维护中共政权”。\n\n2019年，适逢中共窃取政权70周年、镇压西藏骚乱事件60周年、屠杀“六四”学生30周年、镇压新疆“七五事件”10周年、迫害法轮功20周年等诸多重大事件，大陆坊间再次传出“逢九必乱”之说。\n\n同时，新年之际，“六四”民运领袖王丹、吾尔开希、周锋锁等56人发表题为“重建记忆，再次出发”的联合声明，认为中国局势已经到了转型的关键时刻，希望中华民族凝聚起来，将中国民主宪政运动推上新的高潮。\n\n大陆上百名公知也发表感言，质疑中共的“改革开放”变成少数人掠夺敛财的手段，中国依然没有言论自由，他们认为中共只是假改革，中共的“改革已死”。\n\n北大教授郑也夫也刊文发难，批评中国共产党为中国人民带来太多苦难，“加入它是为了做官，捍卫它是为了维护既得利益”等，他呼吁中共退出历史舞台。\n\n面对沸腾的民怨，中共当局在日前召开的中央政法系统工作会议、全国公安厅局长会议上，都强调维护中共的“政权安全、制度安全”等。\n\n1月15日至16日，北京当局在召开中共中央政法工作会议上强调，维护中共国家“政治安全特别是政权安全、制度安全”，是包括中共公安部门在内的政法机关的首要任务。\n\n1月17日，中共召开全国公安厅局长会议，中共国务委员、公安部部长赵克志强调，中共公安机关要举全警之力，防范抵御“颜色革命”，保障中共“政权安全、制度安全”等。\n\n德国之声报导说，中共在这一会议场合上提及防范抵御“颜色革命”，是近年来的第一次。中共全国公安厅局长会议每年一月召开一次。\n\n中共此前也多次提到防范“颜色革命”，但都不是在中共全国公安厅局长会议上提出来的。\n\n如时任公安部长郭声琨2014年出席上合组织会议时，曾说要防止外部势力在其它国家“煽动颜色革命”；中共公安部2016年曾通过社交媒体发布宣传片，呼吁警惕“颜色革命”等。\n\n时政评论员李林一说，中共高层在如潮水般的反抗民怨中，已经感到中共政权已岌岌可危，随时都可能垮台，所有他们才不断地喊出防范“颜色革命”、维护中共“政权”。\n\n他说，遭到全球唾弃的中共政权，犹如一座孤零零地耸立在洪流中的危楼，不仅没有民众支持的根基，而且正受到来四面八方的洪水般的民怨冲击，如果中共高层还死守在红楼里，那只能是坐以待毙，随着红楼消失在洪流中。\n\n李林一说，其实《九评》编辑部发表的新书《魔鬼在统治着我们的世界》，已为中共当权者指明了出路：\n\n“神安排了中共最后的解体。中国的执政者和其他掌握权柄的人，如果有意解体中共，神为其安排好了所有的一切，包括未来天赋神授的真正权柄；相反，如果死抱中共不放，必定会在最后的过程中遭遇中共解体所带来的一切灾祸、魔难。”#\n\n责任编辑：周仪谦",
			"added": 1547870713
		},
		{
			"topic_id": 2497,
			"title": "军头赵克志宣示：",
			"body": "根据信息汇总研究预测今年国内将发生一场由民众自发重大政治变革运动，关系到八千万党员干部被清算被惩处的重大问题。公安干警必须加强危机防范意识，始终坚持党的领导，宁可山河破碎，血流成河，也不能改变党领导的社会主义制度。",
			"added": 1548046912
		},
		{
			"topic_id": 2501,
			"title": "吴敬琏：北京对经济控制加剧 恐重演苏联的失败",
			"body": "【希望之声2019年1月21日】（本台记者凌杉综合报导）中国知名经济学家吴敬琏近期在北京民间智库研讨会中表示，北京当局加紧控制国家经济的做法，正在唤醒人们1950年代计划经济的记忆，这削弱了社会对经济前景的信心。他警告，过度追寻对经济的控制，很可能会导致中共现政权走上苏联失败的老路。\n\n吴敬琏在上周由“洪范法律与经济研究所”组织的研讨会上，通过一个20分钟的视频，表达了上述担忧。他认为，政权过度追求对经济的控制很容易导致“裙带资本主义（在一个经济体中，与政府官员联系紧密的商业能获取绝对的偏袒）”的回归。这也容易让人们想起上世纪时，中国民众的私人资产被强制要求转让给中共官方的那段经历。\n\n吴敬琏认为，当前北京正在做的事正在偏离“市场经济”，当局的做法是在加紧对国民经济的控制，这意味着当局正在重演类似苏联计划经济的流程。\n\n前苏联的计划经济模式彻底将个体经济收归为国有，组织大规模生产，在1965年以后，苏联的计划经济体制改为全国统一供应物资，至解体前夕，苏联国民收入出现负增长，国民购买力严重下降，国内必须物资尤其是生活用品变得极度匮乏，苏联农产品消费市场在1990-1991年间彻底崩溃。\n\n吴敬琏提醒说，北京偏离市场经济，加剧控制经济的做法，最终将导致苏联式的计划经济类失败。\n\n吴敬琏的这个评论，是在北京对经济自由化的承诺日益增长的同时，加剧干预国内经济之际发表的。\n\n2018年，在经济下行压力加大的情况下，许多私企正在为生存挣扎，倒闭频发，而中共国控制的所谓国企、包括央企却创造了历史最好的利润水平。\n\n与此同时，民企被“国有化”的现象在2018年变得更加显著，各种消灭私有制的言论频出。到2018年9月11日，大陆“资深金融人士”吴小平更是发布言论称，中国私营企业已完成任务，应逐渐离场，该消息加大了民营企业主对“国进民退”的恐慌。该消息传出不久，英媒《金融时报》报道称，在2018的前9个月，至少10家民营企业被“国有化”。\n\n同时，中共政府在过去的二年中频繁发展国营与民营共同参与的“混合所有制”，并将履行类似“党支部”职能的人士派入民企管理层监管，强制让民企走上“党建引领企业发展”的道路。中共党报人民网在“加强民企党建 打造建艺精品”一文中声称，只有民营企业“时刻牢记党的事业”，才能在“社会主义市场经济”中乘风破浪。\n\n尽管由于经济随之严重下行，到了去年十月份之后，中共中央不得不推出了一些照顾民营企业的措施，但是外界认为这并没有逆转民营企业被歧视的局面。经济学家向松祚在2019年1月20日的一个演讲中认为，一方面民营企业家被伤透的心需要疗伤的过程，另一方面，“这些执行政策过程里面，有所谓的肠梗阻，根本执行不下去”。\n\n美国中国经济问题专家，彼得森国际经济研究所资深研究员的尼古拉斯·拉迪告诉德国之声，中国工商银行公布消息显示，近一段时间只有2%的贷款是颁发给小微私人企业，而这无疑对民企是重大打击，同时，自2017年起，私人领域的工业产值增量所占的比重已经越来越低，这无疑是国企正在占据经济主导的兆头。\n\n拉迪认为，近期中国私有经济所扮演的角色已经越来越弱，北京对经济控制显得加剧，这对中国的经济增长来说十分可怕。\n\n本月刚满89岁的吴敬琏目前担任中共国务院发展研究中心研究员。他是由国务院副总理刘鹤创立的“经济学家俱乐部”的重要成员。吴敬琏还与央行行长易纲、银行及保险监管机构负责人郭树清等人士有密切来往。他在去年12月因发表对中共当局改革的10大改革忠告，被指批评中共而遭封杀。随后，吴老先生在当局公布的100名对改革开放有杰出贡献的人士名单中缺席。\n\n责任编辑：宋月",
			"added": 1548127838
		},
		{
			"topic_id": 2502,
			"title": "向松祚2019年最新演讲：经济下行四大原因 谨防明斯基时刻",
			"body": "【希望之声2019年1月21日】（本台记者郑清源综合报导）2019年1月20日，向松祚参加斗牛财经举办的投资峰会，分析了中国2018年经济下行的四大原因，认为2019年要谨防明斯基时刻。\n\n他开篇点评了统计局最新公布的6.6%的GDP增长率，表示国内外经济学者都有研究，不做评论。接着他分析了中国经济下行的三大国内原因和国际原因—贸易战，认为2019年经济可能会比2018年稍好一些（此前向松祚引述中国权威机构发布的数据称GDP增长率1.67%或为负数），但是由于企业家被伤透的心还需要疗伤、债务增长模式/高杠杆、上市公司都不赚钱、缺乏创新等原因依旧，因此2019年不会有牛市，相反，债务灰犀牛却可能降临，明斯基时刻可能发生。\n\n向松祚演讲全文听打，小标题为本台所加：\n\n关于中国经济，我想现在有一个共同的词、一个共识，就是下行。中国经济下行是一个共识，从上到下，从总书记到总理、到中央经济工作会议，都在谈下行，而且现在的口径是“下行压力在不断的加大”。\n\n现在关于下行，我想主要有三个问题，第一个问题是我们2018年到目前为止，这个经济下行，下行到什么幅度，官方有数据，世界各国很多研究机构关心中国经济也有数据，我想很多国内的研究机构也有数据，但是大家没有一个共识，究竟是6以下，还是5以下，还是4以下，还是官方数据说的6.6，大家每一个人都可以去争论，这不是我今天要跟大家讨论的重点。\n\n那么第二个问题，我觉得需要回答，2018年为什么出现了如此大的下行压力？大家有没有思考过这个问题？我想这是今天我要跟大家分享的。\n\n第三个问题，是怎么办？经济下行到2019年，我想仍然是中国经济的一个关键词。股市的春天能不能会来呢？如果经济继续下行，股市怎么可能有春天呢？股市的寒冬将持续下去，甚至不排除跌破2000点。所以现在的关键问题，是我们要弄清楚，经济下行的原因在哪里，究竟是什么造成了2018年的经济下行，2019年我们有望遏制这种态势，扭转这种局面吗？\n\n那么，我首先试图回答一下经济为什么下行。\n\n中国经济2018年下行有四大原因，第一个是上上下下采取了债务扩张模式\n\n首先我想短期的，我认为2018年的经济下行，有四个原因。这是短期的原因，有三个是国内的，有一个是国外的。国内是哪三个原因呢？刚才水皮（注：《华夏经济时报》的总编）和叶檀，包括前面的张松（天瑞首席策略分析师），都谈到了，国内的三个原因是什么？\n\n第一个是我们金融去杠杆，防风险、严监管、去杠杆的政策，很多企业面临资金链的问题，资金链断裂。当然我们的央行行长、易纲行长，在去年的10的新华社、《人民日报》的联合采访中，已经明确说了，公开说了，我们的去杠杆的政策考虑不周，执行有偏离，去杠杆的效应叠加，造成的很多企业融资困难，资金链出现问题。但是大家想过没有，这是主要原因吗？虽然央行行长明确这样讲，但是大家千万不要以为这就是我们金融风险的、出现问题的主要原因，不是啊。\n\n为什么我们的企业杠杆这么高？负债这么高？我们过去这么多年来，不要说十年，过去五年以来，中国这些企业告诉扩张，资产扩张，负债扩张，靠什么扩张呢？是靠你的技术扩张的吗？是靠你的内生的增长动力扩张的吗？是靠你的利润、你的自有资金扩张的吗？当然不是，靠银行借钱，靠发债，靠影子银行。\n\n中国的债务规模恶性膨胀，膨胀到什么程度？我想今天没有任何一个人说的清楚，很遗憾，我作为一个经济学者，而且我在银行工作那么多年，我都说不清楚。\n\n前不久网上传，中金公司的老总朱云来，就是我们前总理（朱镕基）的儿子、大公子，我想他也不会随便讲话的，按照他的口径，中国现在的总债务已经突破600万亿！他是怎么统计出来的，我不知道，而且我有一次还问过他，他也没有解释清楚，但是他一直这么说，他不是第一次这么说，他多次这么说。他的结论很清楚，他说像中国这样，上上下下，政府、公司、个人，全部都通过债务的泡沫、通过杠杆在扩张，这样的经济模式能持续下去吗？如果能持续下去，那叫天理不容。\n\n我们很多企业通过债务的扩张，凶猛的扩张，哎，报表很好看呐，资产快速扩张，几百亿，几千亿，几万亿，请问赚钱嘛？\n\n第二大原因：中国股市，企业不赚钱，过去10年与1929年美国股市崩盘有的一比\n\n刚才水皮和叶檀提到股市，我下面还会提到股市。今天水皮谈的很好，为什么中国股市不行，都是证监会的责任吗？大家骂证监会。在美国，股市里面有几个人，不管是崩盘也好，不管是股市不行，有几个人骂SEC（美国证券交易委员会，United States Securities and Exchange Commission，缩写SEC））的？其实中国股市一个最根本的麻烦是，中国企业不赚钱。\n\n我前不久碰到江苏苏宁银行的董事长黄金老，这是我们一个多年的朋友，在一个座谈会上讲，他说我在苏宁，在江苏已经工作这么多年，我非常吃惊的发现，江苏已经是全国经济第一还是第二大省，净利润超过10亿的企业，找不到几家，凤毛麟角，他说我简直太吃惊了。10亿人民币算个什么啊？净利润。请问我们在座的各位，你们有几个在今天的A股里面，你能找到实实在在的、每年净利润能达到10亿的企业，你能找到几个？\n\n所以第二个根本的问题，是中国的资本市场。\n\n中国资本市场，去年一年跌掉30%，水皮是吧？跌掉30%，市值收水七万多亿（近14万亿，他后面随即做了纠正），如果按照过去10年算，我是研究金融史的，我看了一下，14万亿啊，中国过去10年的股市下跌啊 ，和1929年华尔街股市崩盘以后的10年有的一比：不就是绝大多数股票都被腰斩吗？1000多家、2000多家跌去70%，还有多少跌去80%，还有多少跌去90%，你看1929年股市崩盘10年不过如此啊。那这个背后的原因，我们待会儿再说。这是第二大原因。\n\n但是，对2018年的经济下行，这两个虽然很重要，但还不是最重要的原因。\n\n第三大原因：出现消灭私有制的各种杂音，这是最重要、最要命的原因\n\n最重要的原因，第三是什么？去年我们出现了稀奇古怪的各种杂音：消灭私有制。\n\n先是我们的人大的周大教授（注：指周新城，2018年1月份人民大学马克思主义学院教授、博士生导师周新城撰写了《共产党人可以把自己的理论概括为一句话：消灭私有制》），以前我在人大上课的时候，还上过他的课，80多岁了，突然跳出来要消灭私有制。\n\n紧接着，是《环球时报》的胡大总编（胡锡进）说，不着急，先暂时别消灭，以后再慢慢消灭。紧接着，是吴小平站出来说，你们民营企业的任务已经完成了，该退场了，走人吧，走人。\n\n当然还有更多的噪音，我就不说了。民营企业家的信心遭受重创\n\n我觉得这是造成2018年经济下行、最重要、最要命的原因。中央最高层幸亏算是发现了，11月1号，召开座谈会，再一次给企业家吃下定心丸。\n\n外部原因：中美贸易战\n\n一个外部原因，就是中美的贸易战，中美的贸易摩擦，这可以讲是一个黑天鹅。\n\n去年3月23号，特朗普（川普）在白宫公布301调查结果，其实中国当时没有多少人认识到这个贸易战对中国有巨大影响。我读了很多文章，3月23号以后，中国人差不多都变成了贸易的专家。过去我们学经济学的时候，觉得这个贸易理论不是那么简单，还挺复杂的是吧？用几何、用数学推来推去。3月23日以后，你发现世界上每一个人都成了贸易专家！\n\n但是我读了，只有一篇文章，我认为分析的很到位，而且很中肯的，就是复旦大学的华民先生。复旦大学华民先生，写过一篇文章，讲的非常清楚，中美两个国家如果出现贸易摩擦，贸易纷争，谁受的损失更大？会造成什么样的损失？但是我们很多人没有预计到啊。\n\n所以，2018年的经济下行，这四个原因，好像看起来都是黑天鹅似的，都是没有想到的。但是我想提醒在座的各位嘉宾思考一下，这四个原因背后的深层次的根源在哪里？\n\n当然我也没有时间，我也不好跟大家剖析这个背后深层的原因，你看起来好像是短期的，但实际上是长期的，背后的根源是长期的，所以中国经济下行有它长期的因素，不过是2018年这些短期的因素把它叠加起来。\n\n2019年怎么办？\n\n好。回答这个问题（2018年经济下行的原因）之后，那么紧接着就怎么办？\n\n2019年，前面讲的造成2018年的这四大因素，或者说这四个力量，还在不在呢？\n\n民营企业家的信心遭受重创，现在有复苏吗？有恢复吗？总书记吃了定心丸，这个药吃的怎么样？现在这个疗伤，疗的怎么样？我和江浙的企业家，珠三角的企业家接触的还是比较多的，我感觉现在最多恢复了30%。\n\n这个康复需要有过程的啊。我想通过国家最高领导人的这个讲话，就能把这个伤疗好？没有这么简单。物理学的原理早就告诉我们，世界上的事物是不可逆的，一旦你把这个杯子打破了，你想把我这个杯子复原，那是非常非常难的，这叫事物不可逆啊。两个人谈恋爱，你把我的心伤了，然后再想回到以前那个状态，不是那么容易的，是吗？我想这是人生最普通的道理。\n\n其实我们今天的国家来讲，就得深刻思考这个问题，为什么在2018年会出现这样的杂音，它的深刻的社会背景在哪里？改革开放，取得这么大的成就，它的最重要的历史经验是什么？改革开放，我们取得这么大的成就，最重要的历史经验不就是让企业家发展吗？不就是解除枷锁，让企业家能够自由发挥吗？\n\n刚才水皮提到的华为的任正非，阿里巴巴、腾讯，这些企业哪一个企业是省委书记规划出来的？是总书记、总理规划出来的？深圳这么多创新的企业，你问问……我在深圳工作过，我对深圳非常熟悉，你问问深圳的历任书记、历任市长、广东省的历任书记、历任省长，有哪一个他们规划过华为？有哪一个想到过腾讯会成为亚洲市值最大的公司，会搞出个微信？\n\n我在国资委讲课，我讲的非常直率，讲的他们非常不开心。我说你们讲国有企业做大做强，我说你们做大是很容易的。刚才是叶檀提到的，武钢和宝钢合一，行政命令，你们两个合并不就做大了吗？但是我说你们要做强，我看几乎不可能。三大电信公司，中移动、中联通、中电信，还有什么网通，那当年多么强大啊？可以好不夸张的讲，腾讯这一家公司把它们全部干垮了。今天这几家电信公司其实不需要的，你还需要吗？\n\n所以这是我讲的2019年第一个问题（给民营企业家伤透的心疗伤）能不能解决？我想解决了30%，我希望能够解决50%，好，那2019年就算有点希望。\n\n第二个问题，金融去杠杆，中央这几个月加大力度，这几个月连续出台各种政策，什么“三支箭”啊，什么“一二五”啊，各种政策出台，我相信也能起一点作用，这个作用我想能起一半。宣布的这么多政策，“三支箭”也好，“一二五”也好，不能全部发挥作用，为什么？因为我们这些执行政策过程里面，有所谓的肠梗阻，根本执行不下去啊。\n\n更重要的是什么呢？更重要的是，我们这么多年的告诉扩张，快速的加杠杆，客观来说，相当一些企业现在已经陷入了叫所谓的【资产负债表的困境】，叫资产负债表衰退什么意思啊？虽然监管部门通过优惠的政策，什么一二五，什么三支箭，但是很多民营企业其实已经没有能力再去融资、再去投资。\n\n所以，第一项政策，我认为能够起作用到30%-50%，这个疗伤啊，第二项政策，也许能够起到50-70%。第三项就是股市能不能起来？这是水皮、叶檀你们研究的重点。我不怎么研究股市，但是我在想，中国股市的核心问题到底在哪里？是监管政策出问题吗？是应该骂证监会，骂刘主席吗？\n\n刚才水皮说了很多数据。我经常引用的一个数据，2018年的上市公司的全部利润还没出来是吧？2017年的上市公司全部利润3.3万亿，上市的40家银行，加上上市的房地产公司，就这两个板块，拿走全部利润的三分之二，其它那些公司有什么利润可赚？我很同意刚才水皮所说的，很多上市公司的利润还是造出来的，全部都是应收账款。那在这样一个背景之下，中国股市要出现大牛市，我真不知道这个大牛市从哪里来？这我就真不懂了。\n\n有人说，美国的资本市场，美国的股市，过去十年牛市，从2008年金融海啸以后，从6100多点最高涨到26000多点，涨了四五倍，但是大家看一看，美国最赚钱的公司，基本上都是高科技、制造业公司为主体。中国呢？\n\n中国最赚钱的公司，第一名中国烟草总公司，我刚才去洗手间，还有几位同志躲在洗手间抽烟，感谢你们为国家做贡献。第二名是谁呢？中国工商银行，我们1144家中小板、创业板的公司，全部的利润比不上一个半工商银行。我就不明白我想这个问题，水皮、叶檀你们可以回答，我就不明白，这样一个利润结构，怎么可能有牛市？靠炒作啊？靠消息啊？靠忽悠啊？所以我想这样一个要素，2018年，2019年，我仍然是非常的谨慎，甚至可以讲是非常的悲观。\n\n那么第四个因素呢？\n\n第四个因素，就是中美贸易战。这是好消息。我想中美贸易战，在3月1号以前，应该能够达成协议，这个协议的基本框架，媒体都已经有过公布。这个我就不细说了，总之这是一个好事。美国至少会答应不会再追加新的关税，我想这是一个基本的条件。\n\n至于会不会把以前加的关税取消掉，那个2500亿不是都分别加了关税，是不是会取消掉？那现在还没有结论。我希望能够取消。但是这个可能性不是很大，就我了解的情况，但是最起码它答应不再追加新的关税，这是好事儿。\n\n所以这四个因素加起来，2019年，我的结论是什么？2019年，从经济的增速来讲，从2018年的基础上来说，我想可能要好一些。\n\n到底好多少？我很难判断。官方说，6.2，6.3，6.5，还有的说6以下，总之，各种说法都有，没有一个人能说清楚。都是猜。都是说嘴。所以我就嘲弄，我说为什么经济学家要做推测，我是不相信经济学家能做预测的。这不是我今天这么说的，我一直是这么说的。因为我的经济学告诉我们，经济学家是根本没有办法预测这个世界的。经济学家说自己能够预测这个世界，即使高估自己，也是作茧自缚。经济学家经常打自己的脸的。但是为什么要一个预测呢？因为大家需要一个预测。就像你到庙里去算命，那个算命先生一定会给你一个答案，这个答案是对是错不重要，因为你要一个答案，我就给你一个答案。至于是对是错，跟我没关系，把那个答案拿过去，我现在告诉你是6.2，至于最后是6.2、6.0跟我没关系，因为经济本质上是没有办法预测的，黑天鹅的事件可以天天出现。\n\n所以我认为，前面这四个因素，大家仔细分析。可能，我只能这么说，今年的这个情况，比2018年可能会有所好转，但是，我必须要加一个但是，我们在分析中国经济的时候，还有几个重大的灰犀牛和黑天鹅，我们可能还没有考虑到。\n\n房地产市场的集体性幻觉\n\n灰犀牛，有几个非常非常严重的灰犀牛。我就说一个。\n\n刚才叶檀说到房地产。房地产会不会成为2019年、2020年的灰犀牛？我不展开去说，值得我们高度的重视。对于个别城市，对于人口依然在流入的城市，也许房价能够稳定住，不会出现大幅下跌，但是中国有几个城市仍然存在人口的大幅的流入？\n\n现在中国老百姓的财富，官方的数字都这么讲，80%都已经是房地产，房地产的市值已经65万亿美元。65万亿美元什么概念呢？相当于世界全部发达国家GDP总和，美国加上全部欧洲，加上日本，还不到65万亿美元。我不知道现在上海全部房租的收益率有多少，全国的平均的收益率不到2%。更重要的是我经常问一个问题，我也经常看很多的报告，未来房地产的需求到底来自哪里？我想这值得深思的问题，我今天不展开这个去说。\n\n我在谈到中国房地产市场的时候，我经常说两个词，我只想说这个可能性，我不希望大家说我乌鸦嘴。我有两个词是什么呢，也是金融学的两个词，一个词叫做【集体性的幻觉】。什么叫集体性幻觉呢？当一个东西价格在上涨的时候，当大家希望它上涨的时候，你会找到一万个理由，你会找到一亿个理由去解释它，一定会上涨，一定会上涨，这叫集体性幻觉。\n\n当年日本就这样啊。\n\n水皮，不知道你买过一本书没有，当年日本股市火爆的时候，涨到35000点的时候，有一个日本的股票分析师，也是一个经济学者，写了一本书，叫做《日经指数十万点》。这本书在出版社、在印刷厂还没有出来的时候，日经指数最高涨到39000点，日经指数忽然轰然垮下。那么大家知道，经过这么多年，日经指数现在涨到多少（注：截至2019年1月19日，20719点）？当年这个人找了各种理由说日经指数能够涨到十万点。\n\n当年日本房地产是同样的结局。\n\n所以我们想，我们今天分析中国的经济，我今天的结论是，因为时间关系我不能再展开说这个事情，我们分析中国的经济，我们既要看到这些短期的、可以看见的确定的因素和不可确定的因素，我们更要防止陷入这样一种集体性的幻觉，自我安慰。\n\n我们今天看一看，2017年底、2018年初，各大机构的首席（经济学家）、各大机构发布的报告，大家现在拿出来看一看，和全年的结果对比怎么样？我想2018年这一年足以告诉我们，我们没有能力、没有任何经济学者有能力预测股市，更不用说预测个股，如果你能预测对，只能说碰运气，和抽签差不多，但是我们看到中国经济长期的问题，我们的眼光应该放到中国经济的长期问题。\n\n中国长期的问题是创新、真正的创造价值\n\n我前面讲的还是四个短期的问题，更长期的问题，刚才水皮提到的，中国的企业家也好，中国的投资者也好，什么时候能够把你的注意力，什么时候能够把你的精力，放到真正创造价值、创造财富上面来？\n\n我最后跟大家分享一个，我前一阵跟一些中国顶级的VC、PE投资者，好多都是校友、同事，在一起聊天。他们都说现在也进入了中国投资的冬天了，找不到多少投资的机会了。我就跟他们开玩笑说，你们所说的投资的机会估计是很少的，因为什么呢？你们心目中的投资机会，是今天投下去以后，半年以后最好估值变五倍，一年以后变十倍，两年以后变一百倍，然后马上上市套现。这样的投资机会在中国估计没有了，或者很少。\n\n但是我在想，刚才水皮盛赞华为。华为为什么是华为，如果华为当年引入财务投资者，引入那些想把估值半年以内做到十倍的财务投资者，如果华为急于套现，如果华为去炒房地产，如果华为想炒股票、去炒期货，去参股金融公司，它有今天的华为吗？\n\n叶檀提到光刻机，中国为什么造不了光刻机呢？光刻机公司的人公开的跟我们国家的顶级的专家讲，说我们可以把图纸都交给你们，你们也做不出来，你们永远也做不出来。为什么？说的这么气人，为什么？他说，我就说一条，光刻机里面有一个核心的部件，就是这个镜片，全世界只有一家公司可以做，就是德国的蔡司。这个公司的三代人就磨这个镜片，中国人能够做到吗？\n\n中国面临明斯基时刻\n\n中国人现在要求的是，我的市值马上要翻十倍，翻一百倍，我的身家在一年以内要翻十倍，翻一百倍，什么所以只好玩杠杆，只好玩债务，只好玩金融。但是，亲爱的朋友们，玩杠杆、玩债务、玩金融，最终是建立在沙漠上的海市蜃楼，很快要全面崩塌。这个崩塌，就是明斯基时刻。\n\n什么叫“明斯基时刻”？我在这里提醒各位，这个明斯基时刻就是周小川行长警告的。中国完全有可能出现明斯基时刻，不是我警告的，周小川行长多次警告，而且在人大会议上，分组讨论会上都讨论过。\n\n什么叫明斯基时刻？就是突然间有一刻大家突然间认识到，你所购买的资产可能都变得一钱不值，你会疯狂的逃走，我们的所有的金融是建立在对资产的信心、对机构的信心之上，当突然间有一天，所有人的对所有的资产，对什么股票、对房地产、对基金，对银行、对基金公司、对证券公司，对所有的一切都失去信心的时候，全部要夺门而出的时候，没有一个人能逃得出去，这叫明斯基时刻。\n\n所以为什么中央把防范金融风险，仍然列为2019年的三大攻坚战之首，是担心出现明斯基时刻。但是大家不要忘记了，2015年股市突然崩盘就出现过小规模的明斯基时刻。\n\n我衷心希望在2019年，大家首先要管理好自己的风险，谢谢各位。\n\n责任编辑：宋月",
			"added": 1548128140
		},
		{
			"topic_id": 2505,
			"title": "感谢“里根爸爸”和美国军队“拯救”格林纳达",
			"body": "1983年美军对格林纳达的\"暴怒行动\" ，在短短的4天时间里，解除了格林纳达的武装。格林纳达当地人普遍欢迎美军的出兵。除了成为“带路党”，很多格林纳达人还在自家房屋墙上粉刷了“感谢美国人”的标语。在后来的民意测试中，有97%的格林纳达人认为他们实际上被美国所拯救。\n\n1984年10月，出兵整整一年后，里根对格林纳达岛进行访问时，遇到了他就职以来最热烈的一次欢迎。林纳达岛上将近一半的人口走出家门，向他欢呼致意，高举“上帝保佑美利坚”的横幅，感谢“里根爸爸”和美国军队“拯救”格林纳达。里根后来在回忆录中写道：“在我的总统任期内，那也许是我感觉最好的一天”。",
			"added": 1548161899
		},
		{
			"topic_id": 3464,
			"title": "一位委内瑞拉爱国者的故事",
			"body": "2017年6月，委内瑞拉警官 奥斯卡·佩雷斯驾驶一架直升机飞越巴鲁塔（Baruta）市，飞机上带着一面旗帜，上面写“350自由”，指的是《委内瑞拉宪法》第350条，其中指出：“委内瑞拉人民……否认任何违反了民主价值……或侵犯了人权的政权、立法或权威。”\n\n奥斯卡说他想给人民带来希望。他热爱人民。他为人民而战。他们也热爱奥斯卡。但是奥斯卡被枪杀了，被委内瑞拉的安全部队恶毒地杀害了。",
			"added": 1550638610
		},
		{
			"topic_id": 4728,
			"title": "三胖可能还没有考虑好。不弃核，给中国当个棋子，可以长期坚持，但是一直贫穷，出门连个像样的飞机都没有，而越南一出手就买100多架先进飞机，相信刺激很大。完全弃核有点不甘心，但是完全弃核后的前景诱惑很大。朝鲜只有2000万人口，越南有1亿人口，而且朝鲜有南韩的协助，还可以直接上南韩股市筹集资金，显然比越南发展前景好。三胖还得想一想。",
			"body": "",
			"added": 1552401378
		},
		{
			"topic_id": 5254,
			"title": "奥巴马见过习猪头之后私下就与人说过，此人无法用正常语言沟通。现在美国的谈判团队说，是在与一批不正常的人打交道。",
			"body": "",
			"added": 1565138123
		},
		{
			"topic_id": 5262,
			"title": "香港人加油，争取联合国托管。",
			"body": "",
			"added": 1565437210
		},
		{
			"topic_id": 5271,
			"title": "习猪头杀5000万的机会来了，先在香港杀100万。",
			"body": "",
			"added": 1565658518
		},
		{
			"topic_id": 5272,
			"title": "七警案，又称暗角七警事件、七警打人事件",
			"body": "七警案，又称暗角七警事件、七警打人事件，乃于2014年10月14日香港雨伞运动期间，有七名警务人员将示威者及政治人物曾健超抬到添马公园一个暗角殴打之事件。\n\n2014年10月14日晚上，无线电视、苹果日报、亚洲电视和Now TV，以及香港警方的摄录队[1]，在添马公园海滨拍摄到七名涉案警察把双手已被手铐反锁背后的公民党成员、社工曾健超抬到添马公园一个政府泵房变电站外的阴暗角落。其后，曾健超在双手上铐无力反抗或自我保护的情况下，遭五名警察拳打脚踢近四分钟，另有两名警察负责把风。新闻片段播出后，香港警察滥用职权的暴力行为引发香港社会及外界哗然。\n\n2017年2月14日，法庭裁定七名涉案警员罪名成立，并于2月17日各判处入狱两年。",
			"added": 1565702708
		},
		{
			"topic_id": 5489,
			"title": "美国拟联合美洲国家 处理委内瑞拉危机",
			"body": "【新唐人北京时间2019年09月12日讯】美国国务院周三发表声明，美国将和委内瑞拉反对派政府组建的临时政府，以及其余10个国家，援引“美洲国家间互助条约”，采用政治、经济等手段，处理委内瑞拉危机。川普周三表示，委内瑞拉危机显示了社会主义制度的真实情况。\n\n美国国务院周三在声明中说：“（今天的行动）不仅证明该地区共同认为，尼古拉斯·马杜罗不仅是委内瑞拉民众遭受苦难的原因，他还威胁着该地区的和平与稳定。”\n\n美国国务卿蓬佩奥周三发推文确认，美国及其伙伴国家，将通过经济、政治等途径解决委内瑞拉危机。\n\n推文说：“美国连同11个伙伴国家一起援引“里约条约”，应对马杜罗给委内瑞拉及该地区，带来的政治、经济和人道主义危机。我们将考虑多边经济和政治选择，来结束混乱。”\n\n川普周三在白宫表示，委内瑞拉危机反映了社会主义的真实情况。\n\n美国总统 川普：“委内瑞拉情况非常糟糕，这显示了社会主义（的情况），我的意思是这显示了（社会主义下）会发生什么。一个国家50年前如此富裕，而今天他们连水都没有，甚至缺乏基本的食品。”\n\n川普表示，美国正联手巴西和哥伦比亚等国家，向委内瑞拉提供人道主义援助。\n\n川普还说，他不赞同刚被辞退的国家安全顾问博尔顿对于委内瑞拉的看法。\n\n美国总统 川普：“我认为他有些过火了，我想（事实）证明我是对的。我们一直在密切观察委内瑞拉。”\n\n委内瑞拉武装部队周二在哥伦比亚边界进行军事演习。\n\n哥伦比亚军方表示将密切关注事态发展。\n\n哥伦比亚武装军队指挥官 LUIS FERNANDO NAVARRO：“我们处于特别警惕状态，并密切观察。”\n\n哥伦比亚总统杜克还指控马杜洛，在委内瑞拉庇护一支哥伦比亚左翼、反对政府的武装力量。\n\n新唐人记者毕心慈、陈海月综合报导",
			"added": 1568454346
		},
		{
			"topic_id": 5499,
			"title": "美国打算排除中共 重建国际新秩序",
			"body": "【大纪元2019年09月15日讯】（大纪元记者吴旻洲台湾台北报导）美中贸易战近来出现缓和迹象，美中次长级官员即将进行协商、10月部长级贸易谈判；不过有专家分析，美国打贸易战走走停停并非为了贸易协定，而是想用实际行动向美国人证明，中共根本不会落实协定。专家还提到，2020年台湾的总统选举，攸关美中贸易战胜败，“谁赢得台湾，谁就是赢家。”\n\nAIA Capital 财富管理公司首席经济学家吴嘉隆接受《大纪元》访问时表示，美中贸易战开打至今可以看到，美国华尔街、媒体、学界、智库、硅谷、大企业、传统企业等，因为很多人拿了共产党的好处，所以一直在批评美国总统川普的作为，而川普则是透过贸易谈判与两次的“川习会”，证明中共是言而无信、不会遵守承诺的政权。\n\n吴嘉隆认为，川普其实早就规划好一整套“对中政策”的大战略，而第一阶段贸易战打打停停，根本不是为了谈贸易协定，只是想让美企有时间撤离中国，并向美国人证明，跟中共谈贸易协定根本没用，不仅谈的东西不会写进协议，内容也不会真的执行，就算协议真的通过了，中共也随时可能退出，“会执行也都是短期现象。”\n\n他分析，和平、理性的A计划破局、走不通之后，美国将会推出强硬的B计划，第一阶段要达成的目标就是“美中经济脱勾”。他表示，川普去年7月以来，接连对中国商品祭出多项关税制裁，目前最高是课征25%的关税，但这并非上限，过去川普在竞选总统时曾说过，他要对中国全部出口商品加征45%关税，“所以贸易战还有的走。”\n\n**经济围堵中共 美国设定六战场**\n\n他表示，在经济相当程度脱勾，美中经济你中有我、我中有你的现象降低之后，中共在国际贸易上，就会像当年的苏联一样被孤立，届时美国可能就会推出第二段的“经济围堵”策略，封杀中国经济成长的动力。\n\n他说，由于中国是出口导向国家，美国第一个战场是提高关税、不再提供出口市场，让中国经济成长的动力受阻；第二，中国经济增长多靠外资带进资本、技术、订单等，而香港是中国外来投资的窗口，有70%、80%的外资透过香港转进大陆，还有包括筹措美元资金、中共窃取技术也是透过香港。\n\n吴嘉隆分析，其实当贸易战再往下打，美国迟早都要把香港这个窗口堵起来，所以此时香港爆发“反送中”运动，中共不断升高打压态势、甚至还可能出兵镇压，其实反倒是自毁香港，推进美国大战略的整体进程。\n\n他说，过去中国经济之所以快速起飞，是因为美国于2001年时协助世界贸易组织（WTO），所以第三个战场是，未来美国可能会要求WTO把中国的开发中国家地位移除；第四，由于中国经济增长的动力来自于智慧财产权的窃取、强迫技术转移与国企补贴等等，所以美国会用贸易谈判进行结构性改变，把这些漏洞堵起来。\n\n他表示，美国大战略再往下打，第五可能会再设定“科技战”，禁止美国输出高科技给中国产品，还有“货币战”，禁止中国汇率贬值；第六个战场则是“金融战”，相较贸易战美中还互有输赢，金融战是美国绝对赢的战场，中国一点胜算都没有，只要美国宣布禁止中国银行进行美元结算交易，“中国经济就崩了”。\n\n**美国打算排除中共 重建国际新秩序**\n\n吴嘉隆表示，美国大战略第三阶段，则是美国国务卿庞佩奥（Mike Pompeo）2018年12月4日在布鲁塞尔上所提，“川普将建立一个由美国领导和民主支持的新的世界秩序。”\n\n他表示，美国要“重整国际机构，重建国际新秩序”，可能会要求欧盟、国际货币基金、世界银行与WTO把中共从成员国中剃除，若不执行美国就会宣布退出，重新组建一个新的关税同盟，并且规定只有市场经济体才能加入，由于台湾是市场经济体，所以可以加入，而中共不是，所以就不能加入。\n\n他说，美国还会要求联合国剃除中共，若联合国不肯美国也会宣布退出，重新组建民主国家联盟，台湾因为是民主国家所以可以加入，而中共不是民主国家，所以就不能加入。他认为，美国的第三阶段战略，很可能会在川普的第二任期开始执行。\n\n**台湾是美国核心利益 不可能让给中共**\n\n吴嘉隆认为，美国的这套大战略，台湾扮演关键性的角色，而台湾的重要性又远超过美中贸易战，而且2020年台湾的总统选举，更攸关美中贸易战的胜败，“如果美国的属意的人选输掉选举的话，这场贸易战美国就输了，若中共代理人赢得台湾选举的话，这场贸易战就是中共赢了，谁赢得台湾，谁就是赢家。”\n\n他解释，美国国防概念并非在自家门口设防线，真正的防线是设在第一岛链，过去苏联、纳粹德国都没有打到美国领土，唯有位于第一岛链的日本军国主义曾打到美国领土，所以当台湾落入中共手里后，第一岛链就会被突破，中共就可以横跨太平洋，直奔美国加州外海，届时芝加哥、纽约都会陷入长程州际导弹的攻击范围。\n\n他表示，只要台湾一丢，日本、韩国也可能会相继失守，后面就会产生“骨牌效应”，所以台湾其实才是美国的核心利益。\n\n责任编辑：玉珍",
			"added": 1568629175
		},
		{
			"topic_id": 5616,
			"title": "麦康奈尔：共产党是十几亿中国人悲剧根源",
			"body": "【大纪元2019年10月02日讯】（大纪元记者林燕编译报导）美国参议院多数党领袖米奇·麦康奈尔（Mitch McConnell）周二（10月1日）发表对中共篡政70周年的声明，指中共的行为不仅是十几亿中国人的悲剧根源，也在对周围的国家构成威胁。\n\n“在中国（中共）成立（篡政）70周年之际，我们应该停下来认识到在中国共产党统治下有数百万人失去生命。”麦康奈尔在声明中说。\n“谴责（中共）在香港对民主人士持续使用暴力”\n\n他批评中共对当代中国的监控就像回到毛泽东时代。“从监禁新疆维吾尔人的现代古拉格，到控制信息流动的高科技防火墙和审查制度，再到国家层面的广泛技术监视，以及共产党使用的其它社会和政治控制工具，习近平治下的中国看起来令人不安，像是毛时代中国的现代版。”声明中写道。\n\n麦康奈尔是资深共和党议员，是1992年推动国会通过《香港政策法》的元老，他非常关注持续17周的香港民主抗议活动，近期已多次公开警告中共，不要在香港事务上玩火。\n\n在周二的声明中，麦康奈尔再次表示，“我特别谴责（中共）在香港对民主人士持续使用暴力。”\n\n他指出，在中共建政70周年之际，其代理人本应当减少对香港抗议人士施用武力，因为抗议人士只是在寻求基本人身自由，但中共的代理人却反其道行之。“中共一向用武力压制异议。”麦康奈尔的声明中写道。\n\n“中国共产党的作为不仅是十（几）亿中国人的悲剧，他们本应受到北京领导人的更多尊重，并享有更多的自由。”声明说，“中国人的遭遇也是中国（中共）对邻国构成威胁的明证。如果这就是（中共）一个大国对待自己公民的方式，那么需想一下，它将如何对待外国人——那些落后于中国（中共）日益增长经济和军事影响之下的外国人。”\n\n周二香港警察首次对抗议民众真枪实弹，并导致一名18岁高中生胸部中弹送医，令北京竭力打造的“欢庆”蒙上阴影。美国国会多位议员发声谴责港府使用暴力，升级紧张局势。\n\n多名美国议员谴责中共 支持港人追求自由\n\n共和党参议员米特·罗姆尼（Mitt Romney）同日发表声明说，在执政（篡政）70年后，中国共产党继续猛烈的残酷镇压和审查制度。\n\n“独裁中国（中共）许是世上对自由的最大威胁。”他在声明中写道。\n\n罗姆尼指出，中国（中共）严重侵犯人权，特别是对香港抗议者使用暴力以及拘禁维吾尔人，这凸显美国迫切需要与盟友并肩合作、制定一项综合战略，以应对日益严重的中国（中共）威胁。\n\n共和党参议员瑞克·斯科特（Rick Scott）也推文说，当中国（中共）庆祝成立70周年之际，香港人仍每天都在为争取自由和人的尊严而奋斗。\n\n“他们的声音被（外界）听到，总有一天他们将重获自由。”他还附上“跟香港站在一起”的标签。\n\n在另一条推文中，斯科特更指出，“亲北京的警力在继续升级香港局势”。他表示，民主抗议者在争取他们的自主权以及人权，“中国（中共）本可以在某个时候结束这种混乱局面，但相反它们却进行严厉镇压”。\n\n到截稿时，有超过十位国会议员，包括民主党以及共和党的参议员、众议员发声明或推文关注香港局势，亦有议员称，10月1日不是中国的国庆日。\n\n责任编辑：林妍",
			"added": 1569989618
		},
		{
			"topic_id": 7130,
			"title": "有人说中国人是无辜的，别骂中国人，而是中共太坏了，讨伐中共！",
			"body": "这个问题我一直矛盾，直到香港反送中海内外病毒人的表演让我彻底对绝大多数国人失望！而这次冠状病毒让我豁然开朗，我保证我一说所有人全开窍！中共是冠状病毒，而中国人是病毒携带者，你们说二者能分清吗？禁病毒如何不禁携带者？",
			"added": 1583504689
		},
		{
			"topic_id": 7211,
			"title": "楼下保安员说：对于武汉导演常凯一家人的遭遇，无论怎样煽情俺都同情不起来。",
			"body": "作为资深的导演，对社会，人生一定有深刻的认识了。尽管如此，在临死的时侯，都不敢对导致兩家几乎灭门的罪魁祸首发出一点微词，沒有一点反思，难到不让人失望吗？有史以來死于人祸的奴才，脑残不计其数，咱们同情得过來吗？",
			"added": 1583833336
		},
		{
			"topic_id": 9784,
			"title": "突发：美国考虑宣布中国当局犯下反人类罪，正式定性种族灭绝，顶级选项或触发军事干预！",
			"body": "",
			"added": 1598412762
		},
		{
			"topic_id": 12760,
			"title": "托马斯·麦金纳尼（Thomas McInerney） 已退休的美国空军 中将，曾在美国总统和国防部长的领导下担任高级军事职务。 他在Telegram发布消息： 克里斯托弗-米勒不要再姑息沼泽地了！！！！。 中国的武器被运进来了。谁带来的？又是为了什么？",
			"body": "",
			"added": 1611065444
		},
		{
			"topic_id": 12761,
			"title": "麦克.亚当斯：部署在华盛顿的军营是容纳美国敌人的设施，很快变成军事法庭。华盛顿增兵及周边设置爱国者地对空导弹，是为了防止被拘捕的数千美国内部敌人，利用中共集装箱海运来的火箭驱动器，Club-K隐蔽导弹袭击，甚至电磁武器攻击华盛顿和美国电网。美国海军陆战队已部署在DC。",
			"body": "",
			"added": 1611065492
		},
		{
			"topic_id": 12771,
			"title": "總統川普發表告別演說：  “我們建立了我們國家歷史上最偉大的政治運動……本週，我們成立了新政府，並為它在保持美國安全與繁榮方面的成功祈禱。”",
			"body": "",
			"added": 1611123576
		},
		{
			"topic_id": 12774,
			"title": "林大律师刚刚在电报群发的信息（谷歌翻译）： 作为国家，我们身处未知海域，前方有一场风暴。  华盛顿越过特拉华河时，浓雾弥漫，他知道只有上帝能指引他们过河。 我们也得相信上帝，祂给了我们计划，并且处于控制之中。 上帝会将我们指引到当前动荡的另一端。 一切都会好起来。 等待主。",
			"body": "",
			"added": 1611123777
		},
		{
			"topic_id": 12796,
			"title": "军事法庭审讯希拉里 汉宁克将军提供录音证据：希拉里犯下叛国罪 勾结反美激进组织 导致外交大使 中央情报局承包商 海豹突击队队员牺牲",
			"body": "",
			"added": 1618558647
		},
		{
			"topic_id": 12797,
			"title": "军事法庭审判希拉里：希拉里出500万美金和竞选经理密谋暗杀川普总统 证据确凿",
			"body": "",
			"added": 1618726136
		},
		{
			"topic_id": 12798,
			"title": "军事法庭审判奥巴马总统顾问波德斯塔第二天: 从受惊吓的儿童的肾上腺中抽取血液 成千上万的富人正在使用这种产品 每次注射费用约为25万美元 每次输液费用约为42.5万美元 波德斯塔已接受了十几次输液",
			"body": "",
			"added": 1620604547
		}
	],
	"topic_vote": {},
	"next_comment_id": 112,
	"comment": {
		"1_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 1,
				"body": "> [booma](#comment_1_1Lamw1Fk5CrdjwLNPfkDBJH8C2znRuCcBL): 中间一片空白，好辣眼睛\n\n哈哈哈哈，还不知道怎么整它，我又没动这里。",
				"added": 1494844152
			}
		],
		"1_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 2,
				"body": "> [hewei](#comment_3_1QEZzE3GqevGQdjEtbjyVgzSa5xqyZcWYQ): 好用\n\n这个论坛不错，火狐，chrome都能打开，就是不能发图片，不过不发图片也没关系，图片可以发博客的。配合起来使用完全没有任何问题。能完全打破网络封锁。",
				"added": 1494938385
			}
		],
		"15_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 3,
				"body": "> [hewei](#comment_4_1QEZzE3GqevGQdjEtbjyVgzSa5xqyZcWYQ): 这是十分重要的区别。\n\n这个论坛比翻墙速度快多了",
				"added": 1494949267
			}
		],
		"1_1QEZzE3GqevGQdjEtbjyVgzSa5xqyZcWYQ": [],
		"28_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 5,
				"body": "> [windnight](#comment_1_1kuTABmFSjUCPWaaoXiyVGvNfoPXU6zMx): 然而人权律师的人脉和资本能和郭比吗？\n\n郭是个人，人权律师是群体，其实能量不比郭小，只是没老郭聪明，没打在7寸上。",
				"added": 1495097139
			},
			{
				"comment_id": 6,
				"body": "> [bingyuhuo](#comment_1_1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS): 硬的不吃，软的吃，看后续了\n\n两边都没有退路的，软的郭也不敢吃的。呵呵。",
				"added": 1495098076
			}
		],
		"29_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 7,
				"body": "> [hewei](#comment_5_1QEZzE3GqevGQdjEtbjyVgzSa5xqyZcWYQ): 司法独立国家，总统也不应该干预司法的，他闪电解除FBI局长的职务，涉嫌干预他自己通俄的调查。这在独裁国家，司法完全是听命于各级官员的，根本无独立和公正可言。\n\n看发展，川普真有可能被弹劾的，共和党中很多人不喜欢他。我认为这人没有政治理念。",
				"added": 1495102023
			}
		],
		"30_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 8,
				"body": "> [cuda](#comment_1_18Tac6A6tQLGhLRXbP7FafhV7NRbxaboVe): 看起来要出大事\n\n弹劾他副总统上位，好事啊。",
				"added": 1495112001
			}
		],
		"8_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 9,
				"body": "> [longzaowuzhu](#comment_1_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU): 其实，零网才是真正没有言论限制的地方！\n\n对啊，自己建一个群，3-5知己，随便说什么，别人都没办法删贴。",
				"added": 1495436445
			}
		],
		"58_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 10,
				"body": "> [1961796581](#comment_1_1AFRWyc1oHKCNuUwp63EZVMNfi8w4Caq4Y): 毕竟是我认识的同学，我们昆明天气是真的不差，其他的抛开不说，就单说什么出门就要带口罩，不然就会生病，真的把我们云南黑到没谱了，冲这点我觉得就有必要说一下。民主自由，还是让祖国慢慢发展吧，该有的总会有!\n\n中国哪个地方不黑？还需要别人来黑？",
				"added": 1495509364
			}
		],
		"77_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 11,
				"body": "> [von](#comment_1_1GgCkwN5dwEaPNNWCxkWUbbMEqYqEXgBV5): 当然! \n> 正确的说法是：大陆是中华民国的一部分。\n> http://127.0.0.1:43110/1free0blog.bit\n\n你这站点有很多节点，可是无法打开。是有问题还是什么原因？有人打开你的站点了吗？",
				"added": 1495681205
			},
			{
				"comment_id": 12,
				"body": "> [von](#comment_1_1GgCkwN5dwEaPNNWCxkWUbbMEqYqEXgBV5): 当然! \n> 正确的说法是：大陆是中华民国的一部分。\n> http://127.0.0.1:43110/1free0blog.bit\n\n打开了，不错的站点。",
				"added": 1495681333
			},
			{
				"comment_id": 13,
				"body": "> [von](#comment_2_1GgCkwN5dwEaPNNWCxkWUbbMEqYqEXgBV5): 那个不能链接打开，我检查下。\n\n已经打开了",
				"added": 1495681990
			},
			{
				"comment_id": 14,
				"body": "> [von](#comment_3_1GgCkwN5dwEaPNNWCxkWUbbMEqYqEXgBV5): 谢谢，欢迎评论。\n\n你是大陆民国派？",
				"added": 1495692332
			}
		],
		"80_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 15,
				"body": "> [gaogeny](#comment_1_15bXZnE87MuqorAFNpnt2cYiEMxK1VBy2z): 据说得了路遥文学奖。\n\n我家附近有个地主后代，原籍山东的。她家人死的很惨，她是知道的，与我妈谈起过。可惜她没什么文化，不能写下来。我们这里也没人采访她，记录地主受难历史。",
				"added": 1495697996
			}
		],
		"97_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 16,
				"body": "> [shutdownt](#comment_1_1G7FLTn8uh5A2kULk4FsQqv5Qpp6hMcz9C): 同样有想法，有什么高见和赚钱模式！\n\n我对办网站怎么赚钱始终没有弄明白，不然我比新浪，阿里巴巴都早弄网站了。但是人家办网站还真发大财啊。不过技术上我懂条件是否具备了。现在零网可以弄影视网站了，zeromux的技术没问题，我试过了，而且也不复杂，可以条件完全具备了。另外可以做机顶盒，这个怎么赚钱我明白，机顶盒卖出去就赚钱了。可是做机顶盒条件还不够，因为零网还没有解决直播的问题，机顶盒没有直播我认为市场不大的。",
				"added": 1495870037
			},
			{
				"comment_id": 17,
				"body": "> [shutdownt](#comment_2_1G7FLTn8uh5A2kULk4FsQqv5Qpp6hMcz9C): 根据传统的视频网站的盈利模式无非是广告会员的收入还有就是周边等一系列东西或许我们可以发邮件私聊一下http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=shutdownt\n\n我没有零网邮箱，而且我早就不打算创业了，那是年轻人的事。我现在只有一个理想，就是吴越独立建国。你可以找传统视频网站的人合伙创业，去年10月份关闭了很多机顶盒上面的影视应用，可以转到零网上。",
				"added": 1495871132
			}
		],
		"104_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 18,
				"body": "> [fra](#comment_1_1EkNaDDsXS4GM9hQeRwdwVZmSKMbZHitnU): 还没玩熟啊，哈哈！\n\n就这么玩，喜欢写文章的就做博客，喜欢做群拉人的就克隆论坛，零网论坛就相当于微信群。自己啥也不想做可以参与人家的论坛，或者看人家的博客。",
				"added": 1496055510
			}
		],
		"102_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 19,
				"body": "> [bingyuhuo](#comment_2_1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS): 能被黑吗\n\n这个太难黑，因为太多，如果几十万人用零网，该用多少五毛来捣乱？一台个人电脑就相当于一台服务器。",
				"added": 1496112292
			}
		],
		"130_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 20,
				"body": "> [hechaocheng2](#comment_3_1HYWELgixoPXKLEpsJaAuKuMT6GiRDfjdk): 这么黑国人啊？\n\n这是真的，你没有体会，我体会太清楚了。",
				"added": 1496495107
			}
		],
		"131_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 21,
				"body": "> [hechaocheng2](#comment_4_1HYWELgixoPXKLEpsJaAuKuMT6GiRDfjdk): 明天就是6.4了。你还敢发声？\n\n这个中共没办法删我的贴了，哈哈哈哈。",
				"added": 1496496431
			}
		],
		"121_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 22,
				"body": "> [wjy207](#comment_1_1CMyAn6Bkr7qgaV5dvPrCPeCQ38bHxcuVD): 国民的软弱成了他们的武器\n\n今年翻他们的天",
				"added": 1496542890
			}
		],
		"313_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 23,
				"body": "> [windnight](#comment_3_1kuTABmFSjUCPWaaoXiyVGvNfoPXU6zMx): 故意断章取义？还是说“human trafficking”一词不会翻译？\n\n这里不需要审查，也不需要用新华社通稿。",
				"added": 1498570457
			},
			{
				"comment_id": 24,
				"body": "> [windnight](#comment_4_1kuTABmFSjUCPWaaoXiyVGvNfoPXU6zMx): 别激动，这里没人审查，我就问问原文里的“human trafficking”一词去哪了，不会翻译可以查字典。如果是断章取义，这做法就和新华社通稿也没什么区别了。\n\n还是新闻联播比较适合你，别来我这里了。",
				"added": 1498577446
			}
		],
		"348_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 25,
				"body": "> [qxtlwf43](#comment_1_1Jt72S8NnQCXzKK5J5ZFVzrzyESUYoPXQr): 令人震惊，赵紫阳的父亲是土改时被共产党枪决的吗？\n\n好像还是赵签的字",
				"added": 1498992775
			}
		],
		"399_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 26,
				"body": "调查那些所谓“侨领”在中国的房地产，企业，将这些信息卖给郭文贵。",
				"added": 1499440472
			}
		],
		"414_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 27,
				"body": "> [gaoha](#comment_1_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 仔细讲讲呗\n\n我没有中共高层关系，这要郭文贵讲，他一定知道具体是谁砸的，我估计是周永康砸的，政治局常委就那么几个人嘛。就是希拉里访华时习傻逼躲着不出来那次。",
				"added": 1499685583
			}
		],
		"1_1PC7bQqwmGctCcdbLQ5xKnxSDMB4ZMiDaj": [],
		"1_1GafskHujd8mxBfad2r2STsymDXbqoySoi": [],
		"606_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 30,
				"body": "> [adofer](#comment_2_1PC7bQqwmGctCcdbLQ5xKnxSDMB4ZMiDaj): 汉奸！国内腐败和国外挑衅都要反击。不能因为柱子坏了就要把整个房子拆了，更不能开门揖盗。中国要的是托梁换柱。\n\n傻逼，我是吴越人士，跟汉有什么关系？",
				"added": 1502155576
			}
		],
		"635_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 32,
				"body": "> [gaoha](#comment_5_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 何频的点点今天事   秘钥无效\n\n好的，我去告诉他们一下。",
				"added": 1502622855
			},
			{
				"comment_id": 33,
				"body": "> [gaoha](#comment_6_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 更新了没？\n\n还没有，我昨天找了一下没找到原来的贴，可能是我忘了转，不过我记得我转过的，现在我再去找一下。",
				"added": 1502698034
			},
			{
				"comment_id": 34,
				"body": "> [gaoha](#comment_6_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 更新了没？\n\n已经告诉他了",
				"added": 1502698330
			},
			{
				"comment_id": 40,
				"body": "请推广使用",
				"added": 1505009723
			}
		],
		"531_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 35,
				"body": "大家帮忙建立节点，现在节点不够多，很难发布。",
				"added": 1503024486
			},
			{
				"comment_id": 42,
				"body": "现在很好啦，总算网络整畅通了。",
				"added": 1505379720
			}
		],
		"677_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 36,
				"body": "> [tgzs](#comment_1_1CLCrSjWeGei7XgoQW6LzZPKJybDdXnTuE): 楼主页面左边的视频，能不能只要一个？要这么多也行，能不能不要做成自动播放？一点进来乱七八糟的声音，然后再一个一个的停止播放，非常影响阅读体验\n\n这个自动播放我控制不了，什么控制代码都试过了，都不行。可以安装一个浏览器插件 no autoplay 来控制。",
				"added": 1503190912
			}
		],
		"705_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 37,
				"body": "> [yuzy](#comment_1_1FEMG579aFFui8M36TxAD3QpwzBFozeyrR): 没有内容啊\n\n是没啥内容，是一个图片的说明。",
				"added": 1503570910
			}
		],
		"1_1N9W28PpkEF8U7XdNPMz3f18TF3cwMRkCE": [],
		"765_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 39,
				"body": "> [pkfjbajqlqsi](#comment_1_15d9SMD5G9UX5Wrt7pAGD5TTGDZmDsQFq1): 标题为什么叫解放台湾呢？\n\n我也不知道，是转过来的。",
				"added": 1504839524
			}
		],
		"797_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 41,
				"body": "> [gaoh](#comment_13_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 这是昨天报平安视频吗？今天还没有更新到\n\n是有人从推特转到G+的",
				"added": 1505378442
			},
			{
				"comment_id": 43,
				"body": "> [gaoh](#comment_13_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 这是昨天报平安视频吗？今天还没有更新到\n\n你那边同步节点多吗？老郭的，我这里没以前好。",
				"added": 1505381894
			},
			{
				"comment_id": 44,
				"body": "> [gaoh](#comment_14_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 我这边能同步到12号的推特短视频，长视频截止到10号。基本很全了\n\n我这里现在连个节点都没有",
				"added": 1505390611
			},
			{
				"comment_id": 45,
				"body": "> [gaoh](#comment_14_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 我这边能同步到12号的推特短视频，长视频截止到10号。基本很全了\n\n你现在还能同步吗？",
				"added": 1505655608
			},
			{
				"comment_id": 46,
				"body": "> [gaoh](#comment_16_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 能同步到13号，15号的视频。我有个方法，频繁换装不同版本，就能看到最新资源\n\n我有一台电脑有13个节点，一台电脑有30个节点，可以同步数据，但是经常会没有在线节点，主要原因还是节点太少。",
				"added": 1505728394
			}
		],
		"854_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 47,
				"body": "> [gaoh](#comment_18_1GDKkWZRyuZRxH5QhVK7phucwmdmKsfEoj): 19号之后又看不到郭教练爆料了\n\n没有新的爆料",
				"added": 1506082882
			}
		],
		"20_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 48,
				"body": "> [zyizs](#comment_1_15YzNKu5gH2C2WGmy3usXKmqsx37CqqDie): 如何在zero建立下载点？\n\n这个不用翻墙的，没必要做下载点吧？",
				"added": 1507829126
			}
		],
		"941_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [],
		"940_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 52,
				"body": "郭文贵爆料可以下载观看了",
				"added": 1509242098
			}
		],
		"976_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [],
		"888_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 54,
				"body": "> [daheitian](#comment_1_1Lag7pfbM5eFgLm3g5YhescMXgdm4bLQsh): 希望博主能详细讲讲【梦雪，刘呈杰】的消息。谢谢\n\n我自己没有消息啊，我只是看到一些国内看不到的信息就转些过来。刘呈杰的爹应该是习，老郭不会随便爆料的。",
				"added": 1509627024
			}
		],
		"986_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [],
		"1005_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 58,
				"body": "> [zerogroup](#comment_1_12WSTdqNMmtLct48peM9QFDZEojTm9c3g3): 当权了，能没钱吗，\n\n这只是在香港，还有加拿大，澳大利亚，瑞士，巴拿马。。。",
				"added": 1510143307
			}
		],
		"1027_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 59,
				"body": "终于听到好消息了！\n美国国会勒令：在美国所有的中文媒体的记者和工作人员，全部注册为中国特工身分。\n\n原因是：他们被指控在美国从事间谍和政治宣传工作！\n\n这样一来，他们的人身自由将会被限制！",
				"added": 1510736486
			}
		],
		"12_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 60,
				"body": "这个是零网使用方法介绍",
				"added": 1510830830
			},
			{
				"comment_id": 65,
				"body": "使用方法介绍",
				"added": 1512189965
			}
		],
		"7_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 61,
				"body": "这个我还没有试过",
				"added": 1510831158
			},
			{
				"comment_id": 64,
				"body": "还没试",
				"added": 1512189893
			}
		],
		"9_18WuQsUbszu95sZDiKvrfswRnEpuB5WEQh": [
			{
				"comment_id": 62,
				"body": "这个是使用方法介绍",
				"added": 1510831339
			}
		],
		"1050_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 63,
				"body": "中國的社交網站全面封殺有關火警消息，「北京」、「西紅門」等字眼全被封鎖，搜尋亦只會出現「根據相關法律法規和政策，搜尋結果未予顯示」。",
				"added": 1511092993
			}
		],
		"1250_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 66,
				"body": "图片",
				"added": 1515995873
			}
		],
		"1257_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 67,
				"body": "图片",
				"added": 1515995903
			}
		],
		"1341_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 68,
				"body": "在这个视频站点上只要点击发布者，就可以进入他的频道。",
				"added": 1518780828
			}
		],
		"1344_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 69,
				"body": "> [howdnasa](#comment_1_1JpvBGTqs5YP68wSfhv1ZnqY9iAdpFEsU1): 建议导航字体颜色弄淡殿，这种颜色看着很泪眼，看不清\n\n好的，我试着调整一下，这个字体颜色与标题是关联的，所以有点麻烦。",
				"added": 1518877178
			}
		],
		"1345_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 70,
				"body": "> [fatherofgfw](#comment_2_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 有很多都也没有种子了\n\n再试试看，24小时在线的，最少有3个节点。",
				"added": 1518954057
			},
			{
				"comment_id": 71,
				"body": "> [gaoha](#comment_14_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 看了两个郭春晚，但是没看到刘成杰他爹是谁，郭春晚四个小时，应该还有一些没上传吧？刘他爹是谁？\n\n郭春晚我就上传了2个，刘他爹是谁，宝胜的视频里说初三爆料。老郭的原视频效果不好，我没传，传的2个是宝胜整理过的。",
				"added": 1518959591
			},
			{
				"comment_id": 72,
				"body": "> [gaoha](#comment_15_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 初三已过，老郭报刘成杰亲爹了吗？\n\n没看到新的视频",
				"added": 1519033259
			},
			{
				"comment_id": 73,
				"body": "> [fatherofgfw](#comment_3_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 很奇怪，为什么我看不到留言\n\n哈哈哈，留言跑到很下面去了，我也不知道为什么，也没时间去整它。",
				"added": 1519102579
			},
			{
				"comment_id": 74,
				"body": "> [gaoha](#comment_16_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 能分享点翻墙工具吗？翻不出去了现在\n\n吴越独立大论坛上我放了一个网页代理，不知道还能不能翻。",
				"added": 1519106969
			}
		],
		"1358_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 75,
				"body": "> [gaoha](#comment_17_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 有没有最新爆料视频？\n\n还没有",
				"added": 1519188370
			}
		],
		"1361_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 76,
				"body": "> [gaoha](#comment_18_13ud5ZroH4U48dmrTquAhVn9tsyaL1X7a5): 那个年代能拿出60万？\n\n估计那时候就敢这么嚣张，应该能拿得出。",
				"added": 1519292556
			}
		],
		"1363_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 77,
				"body": "> [fatherofgfw](#comment_4_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 问题是接收器哪里买？开放公测了？\n\n开发软件就可以了，将上传与下传分开，上传走VPN，下传走卫星。现在的设备就都可以用，不用新的接收设备。",
				"added": 1519391967
			},
			{
				"comment_id": 78,
				"body": "> [fatherofgfw](#comment_5_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 频段，角度？怎么搜星？\n\n我不是学无线电，通讯，雷达，网络这些专业的。",
				"added": 1519394733
			}
		],
		"1373_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 79,
				"body": "> [bingyuhuo](#comment_6_1V7usnfmabQXPSNC2zrCpF2ed2jDZaujS): 太折腾了，刚开始体验应该不会很好。\n\n这很简单的，如果google，twitter，facebook，真想进入中国市场，只需在中国上空发一颗定点卫星就进入了。不过现在的互联网公司已经失去了当年的互联网精神，他们宁可向中共乞求。",
				"added": 1519527926
			}
		],
		"1365_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 80,
				"body": "> [fatherofgfw](#comment_6_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 24小时一圈的话，一天之内信号有效的估计不超过1小时，更何况卫星在我背面呢？\n\n问题是我还没有看到，如果有1小时也够了，很多人能连到1小时，大家都可以用这1小时把资料从外面拿过来，放到零网上。",
				"added": 1519532325
			},
			{
				"comment_id": 81,
				"body": "> [fatherofgfw](#comment_7_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 我认为离开公测还很远，马斯克计划是12000颗卫星，那么按照第一期的话至少部署完毕1200，开放公测至少600颗\n\n只要这里能看到，有人会开发相关产品的。",
				"added": 1519533739
			}
		],
		"1398_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 82,
				"body": "> [fatherofgfw](#comment_8_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 很多没种。。。。还有，郭老七站点是你的么？http://127.0.0.1:43110/7ge.bit/\n\n能不能一个一个来，告诉我一下哪个没有种？郭老七的站点是东先生的，东先生已经为零网事业成仁了。",
				"added": 1520400422
			},
			{
				"comment_id": 83,
				"body": "> [fatherofgfw](#comment_9_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 首先，报一个bug，站长，你的网站都看不到留言，只能去zeronet首页看，这个是故意设置的么？\n> 其次，郭老七站的东先生是怎么一回事情？能否简介一下？\n\n留言一直跑到下面去了，我也不知道怎么搞的，克隆过来就这样了，没时间去管它，先让它去，这个不重要，先把重要的视频同步解决了。东先生我不认识，也不了解，只看到他很努力在推广零网，后来以身殉职，成仁了。",
				"added": 1520406043
			},
			{
				"comment_id": 85,
				"body": "观看",
				"added": 1521047869
			}
		],
		"1401_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 84,
				"body": "> [tonyhell](#comment_1_1JQjgRWefiGPXro1fZ8SeLwd1mnBSHqnET): 哪个地方说到？\n\n是英文的，我没时间翻，过几天应该有人翻的。",
				"added": 1520434113
			}
		],
		"1_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 86,
				"body": "我没用zerome",
				"added": 1521168346
			}
		],
		"1448_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 87,
				"body": "> [sanayi](#comment_2_1Aw6VfUrBMBqVswCWPi5k5bQZve9XP1Da9): 最明显的5月25日韩国进行全民投票（与选举不同）。\n\n你发在kopykate big上的视频我反复多次都没能打开，你有没有另外的电脑，试试看你自己能不能同步到另外一台电脑上。",
				"added": 1522149855
			}
		],
		"1461_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 88,
				"body": "> [nogcome](#comment_1_18MLehM7knaydQHSnPpRudZJJEKNMoWhk5): 无图无真相。。\n\n图在这里\nhttp://127.0.0.1:43110/18iNFjfBKNM2rM4Mov6ShR1Ygu9EihsHWt/",
				"added": 1522663329
			}
		],
		"1543_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 89,
				"body": "图片在这里\nhttp://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/",
				"added": 1523516042
			}
		],
		"1534_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 90,
				"body": "图片在这里\nhttp://127.0.0.1:43110/16LDCk5oggAfrnvSN9a7LkStWkqmozEtay/",
				"added": 1523516148
			}
		],
		"1598_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 91,
				"body": "> [anonymouslogin](#comment_3_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): 新的网站都是no peers found，如之奈何？\n\n我新做的站点【东突厥斯坦运动】你能打开吗？我这里能有40多个节点，左边的导航有链接。很多新站点没有节点，除了中共的网络封锁之外，我认为这些做站点的人也不会发布。",
				"added": 1524620182
			}
		],
		"1599_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 92,
				"body": "> [anonymouslogin](#comment_2_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): 北伐要再来一遍额\n\n老郭说到今年底要干掉他们一半，应该会有一些动作的。",
				"added": 1524620277
			}
		],
		"1662_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 93,
				"body": "> [anonymouslogin](#comment_11_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): 墙又高了一尺\n\n零网没问题",
				"added": 1526042361
			},
			{
				"comment_id": 94,
				"body": "> [anonymouslogin](#comment_13_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): 这墙好厉害，刚刚能上一会又不能上了。\n\n换个梯子啊。用零网就可以了，零网上新闻不少了，我发了很多视频，你都看不过来。",
				"added": 1526047134
			}
		],
		"1870_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [],
		"2083_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 104,
				"body": "> [sanayi](#comment_5_1Aw6VfUrBMBqVswCWPi5k5bQZve9XP1Da9): 登录在何处？\n\n不用登录，点击【言论自由】就可以发布高论。",
				"added": 1535262962
			}
		],
		"2_17epVpxBjScGeG2pggzQLkf8HsH3UWTcYK": [],
		"2137_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 107,
				"body": "> [tjm](#comment_1_19naVAHk8V5KPiEvmuJ75fwAs5KVZQv6KC): 想的太多了……白宫请愿了解一下\n\n白宫请愿要10万签名，能有10万人使用零网还需要美军帮助吗？",
				"added": 1537756619
			}
		],
		"1000_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [],
		"2367_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 109,
				"body": "特别是中国的股市是一个封闭的市场",
				"added": 1545113590
			}
		],
		"1621_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 110,
				"body": "现在机会来了，先在香港杀100万。",
				"added": 1565669079
			}
		],
		"5301_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 111,
				"body": "> [teacher](#comment_2_1NhjSMRJK1jeJ7hyqomCmpfLnZ8KkrTeJd): 你可以多转载一些新闻，现在墙越来越高了！\n\n我每天转一些短新闻，在聊天室【谈革命】，【自由人聊天室】，及论坛【墙内消息】。整篇的新闻我有时候打开不容易。",
				"added": 1567438173
			}
		]
	},
	"comment_vote": {}
}