{
	"next_comment_id": 16,
	"comment": [
		{
			"comment_id": 1,
			"body": "Witam; Miło że ktoś próbuje poprawić ZeroNeta. Zawsze to jakiś Plus, w tym środowisku. ",
			"post_id": 4,
			"date_added": 1582411472
		},
		{
			"comment_id": 2,
			"body": "Dzięki, za super wyjaśnienie całej sprawy; Kapitalnie napisane wytłumaczenie, Instrukcja, Jak to działa? Mam nadzieje że wszyscy zrozumieją o co chodzi? Każdy z użytkowników powinien to przeczytać. \nI otworzyć swój Port na Routerze. Mam pytanie? A co zrobić, jak ktoś nie może otworzyć Portu? Z przyczyn technicznych; Router ma zablokowane ustawianie Portów? ( znam taki przypadek w tym kręgu znajomych ). \nDrogi Router na kartę, ( karta internetowa , jest w Routerze ). Te pytanie, nasunęło się mnie przy okazji? Nie jest związane z tematem. Ale może ktoś, coś wie w tym temacie? Jak temu zaradzić?\nPozdrawiam.",
			"post_id": 5,
			"date_added": 1582413121
		},
		{
			"comment_id": 3,
			"body": "Te artykuły powinieneś umieścić na ; ZeroWiki. Bo tutaj , za jakiś czas, pójdą w zapomnienie. A tam, będą stanowiły dobrą odskocznię informacyjną. Po prostu, zrobić kopie. z tytułem; Podstawy obsługi ZeroNetu. Szkoda by było, żeby  te porady, gdzieś się zapodziały?\nPozdrawiam.",
			"post_id": 7,
			"date_added": 1582563753
		},
		{
			"comment_id": 4,
			"body": "Witam; za tą pracę którą wykonałeś, należy się tobie duża flaszka łyskacza. A jeśli jesteś nie pijący? To coś w zamian. Ogromną pracę wykonałeś, dla tych początkujących. Ja też osobiście na tym dużo skorzystam. To tak jak komuś, co słabo widzi? Zafundować bezpłatnie okulary. Wielkie dzięki. Należy Ci się Pomnik. \nPozdrawiam, wielki szacunek.",
			"post_id": 10,
			"date_added": 1582683812
		},
		{
			"comment_id": 5,
			"body": "Moje Gratulacje. Tak trzymać.",
			"post_id": 11,
			"date_added": 1582746974
		},
		{
			"comment_id": 6,
			"body": "Dobre, Ciekawe, Pożyteczne; Trochę tego jest sporo do zapamiętania, przyswojenia. Jeśli ktoś tego nigdy nie robił? Ale zawsze musi być ten pierwszy Raz. Dzięki za wysiłek, naprawy, poprawy, nauczenia czegoś, i Pozdrawiam. ",
			"post_id": 12,
			"date_added": 1583062718
		},
		{
			"comment_id": 7,
			"body": "Bardzo dobra sprawa i potrzebna; Znowu trafiłeś , w dychę. \nZ tymi palantami zawsze był problem, ciągle przeszkadzali; jak tylko mogli.\nNie omieszkam wypróbować. Trzeba to sobie zapisać i wydrukować, Jak podręczna instrukcja obsługi.\nPozdrawiam.",
			"post_id": 14,
			"date_added": 1583251448
		},
		{
			"comment_id": 8,
			"body": "Witam; A u mnie się wyświetla, Wersja 0.6.5 ( rev 3870 ): Aktualna.\nI nie chce się uaktualnić do nowszej? Co zrobić?",
			"post_id": 15,
			"date_added": 1583386030
		},
		{
			"comment_id": 9,
			"body": "Profesjonalnie opisane, Kiedyś myślałem o postawieniu własnego serwera. Ale wzrastająca Cenzura mnie zniechęciła, raz na zawsze. Zakupiony sprzęt leży odłogiem, i czeka na po resetową budowę informatyki. Jak przeżyję, i dożyję to będę budował. Temat jest ciekawy, szczególnie dla początkujących adeptów tej sztuki. Jedynie \"WIEDZA\" jest nie przekupnym materiałem,                                                          nie zniszczalnym, który chwilo jest zbędny; Ale przyjdzie czas, że tacy ludzie będą na wagę złota. ( posiadający Wiedzę, jak zrobić? ).\nPozdrawiam.",
			"post_id": 16,
			"date_added": 1585946369
		},
		{
			"comment_id": 10,
			"body": "To był od samego początku taki samobój. Miał polepszyć, ułatwić? A jak zwykle wyszło na \"NIE\". Zadam pytanie? Co daje proxy? Teoretycznie poprawia anonimowość; A jeśli Ja wiem że to jest fikcja? To po co to jest używać???\nPo mojemu ZeroNet, powinien być maksymalnie prosty, beż żadnych wodotrysków. Jeśli ktoś szuka Mercedesa klasy 500- To musi szukać w innym salonie samochodowym. Dlaczego, Siekiera jest dobra? Jest Dobra, bo jest prosta i niezawodna, i nie psuje się. Wszelkie rozbudowy techniczne i ułatwienia muszą się tak skończyć; czyli klapą. Ci co tutaj przychodzą? to wiedzą jak to obsłużyć, a ci co nie wiedzą? to tutaj długo nie zagrzeją miejsca. Dlaczego? Bo oni szukają wrażeń a nie rzetelnych informacji. Powiem krótko, społeczeństwo jest upadłe, bardzo niski poziom wiedzy i nie tylko. Jesteśmy rozproszeni na olbrzymiej przestrzeni, i do tego język niewolników / angielski /.\nja wiem 3/4, świata się nim posługuje. Ale to nie znaczy, że Ja mam do nich dołączyć, takich jest wielu. Ja nie jestem wyjątkiem. Wracając do meritum sprawy; Ja nie będę używał Proxy; Dlaczego? Bo to jest bzdura. Jak również parę innych bzdur? Prosty mały system bez fontann i fajerwerków. To jest czego ja szukam. Czy inni też tak myślą? Trzeba by było zapytać? Odpowiedź może powalić z nóg. Przykro mnie że nie wypaliło, że praca poszła na marne.\nJest takie powiedzenie; **\"Łaska pańska, jeździ na pstrym koniu\"**.\nPozdrawiam;\nPs. może spróbuj wprowadzić bardziej przyziemne ułatwienia?\n",
			"post_id": 17,
			"date_added": 1613062324
		},
		{
			"comment_id": 11,
			"body": "Ciekawe zmiany? szkoda że tak mało o tym wiadomo? Zawsze każde zmiany kojarzą się z czymś brzydkim. Pytanie pozostaje, czy one były niezbędne? Czy można było się bez nich obejść?  Nie chciałbym wyjść na marudera? \nAle Ja osobiście do zmian, jestem zawsze, byłem nastawiony negatywnie; dlaczego? Bo to mnie się kojarzy z ingerencją służb na trzy litery. \nMoże słabo ogarniam temat? jestem prostym człowiekiem. Chciałbym żeby ZeroNet był niezawodny i po za zasięgiem Cenzury.  to jest podstawa ZeroNetu,\npozdrawiam, i dzięki za wyjaśnienie.",
			"post_id": 18,
			"date_added": 1613140359
		},
		{
			"comment_id": 12,
			"body": "Super opisane, myślę że ta informacja będzie pomocna dla wielu , mniej doświadczonych kolegów. Pytanie, czy korzystać , czy nie korzystać? To już zależy do czego to chcemy używać? Ważne że możemy się nauczyć z tego korzystać. Zostało to pokazane i wytłumaczone.\npozdrawiam.",
			"post_id": 19,
			"date_added": 1613494985
		},
		{
			"comment_id": 13,
			"body": "Ta lista robi wrażenie; To pokazuje ile muszę się jeszcze nauczyć w temacie posługiwanie się Terminalem i Pythonem? Statystyka, która pokazuje praktycznie prawie same zera, To tylko oznacza jedno; Jest gorzej niż myślałem. Dużo znacznie gorzej. Dzięki za obszerne informacje i rzeczowe wytłumaczenie.\npozdrawiam.",
			"post_id": 20,
			"date_added": 1613516024
		},
		{
			"comment_id": 14,
			"body": "Czyli w pewnym stopniu jest anonimowy? Myślę, że to to jest dobra oznaka.\nKtóra sugeruje jakieś tam bezpieczeństwo? Dla osoby która dokonała danego wpisu. Ktoś kto prowadzi stronę to jedno? A drugie to ktoś, co umieścił jakiś tam tekst? Który ewentualnie może nie podobać się cenzurze politycznej.\nPolitykę zawsze mamy na pierwszym miejscu.\npozdrawiam. zawsze niepoprawny politycznie. Tak dla zasady.",
			"post_id": 21,
			"date_added": 1614107325
		},
		{
			"comment_id": 15,
			"body": "Dzięki za wyjaśnienie w detalach; Muszę to przeanalizować na spokojnie jeszcze raz. Wniosek jest taki, jesteśmy otoczeni i kontrolowani. Moje domysły były słuszne co do możliwości konkurencji? Wolność słowa istnieje tylko na papierze. Włączenie opcji \"TOR\", pozwala chwilowo ominąć przeszkodę kontroli. Ciekawe jest, na ile sam TOR, jest bezpieczny? Czy niema ukrytego podglądu. \nKażdy nowy pośrednik dodany do systemu? To podejrzenie o manipulację.\n Jak to mówią? Lepszy RYDZ, niż NIC.\nPozdrawiam.",
			"post_id": 23,
			"date_added": 1614426433
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}