{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1565966684,
			"title": "Decentralized 4chan",
			"body": "Do you know this other decentralized 4chan that you can use with Tor ?\nhttps://ndm-inf.github.io/BlockChan/anonymous",
			"added": 1565966683
		},
		{
			"topic_id": 1566038009,
			"title": "Dark Market adress ?",
			"body": "Since the shutdown of all the dark markets by the FBI i can't find any new market ! Do you know some ?",
			"added": 1566038007
		}
	],
	"topic_vote": {
		"1565966684_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1565661379_13Gu27WksygoMQzLpktTGzZTHumTN5pce1": [
			{
				"comment_id": 1,
				"body": "this website could help you --> https://ndm-inf.github.io/BlockChan/anonymous",
				"added": 1565966989
			}
		],
		"1565966684_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 2,
				"body": "> [trevorlaneray](#comment_65_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Whoof. Lots of good advice in there, on a cursory glance.Personally however, while I am a ProtonMail user, I'm still hesitant to use ProtonVPN.Still, ProtonVPN is indeed a better option than most VPN providers.\n\nBasically, as i know,  the two best VPN are NordVPN and ProtonVPN i use the second one !",
				"added": 1565967094
			},
			{
				"comment_id": 3,
				"body": "Ordinary i didn't use Images-Board on my dayli life, but this website called BlockChan is very new and actually it do the job --> work with tor --> no need to register --> Pictures stored on IPFS  / UI is pretty dark but with few contributions from the communities it could become a very powerfull for freespeech",
				"added": 1565967621
			},
			{
				"comment_id": 4,
				"body": "Which is why in a proliferation economy it will be necessary to leave it to the Hashtag to sort it out. Actually BlockChan plan to implement a research toolbar.",
				"added": 1565968487
			},
			{
				"comment_id": 5,
				"body": "> [xlk](#comment_65_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): I'm not trying to be offensive nor troll with what I am about to say, but you give me a very strong pretensive vibe. That is, I suspect you are a federal agent, journalist, or some other person that is here in an official capacity. This isn't about the VPN, it is that I just searched your name and all of your comments come across as superficial. They feel like the types of comments one would make if they knew they were to be subject to review.  [...]\n\nCompletly forgot that this kind of decentralized topics is full of Paranoaic folks :D",
				"added": 1565971391
			}
		],
		"1566034184_11TbhWmLbceRuHERFahR7cdrTSBN4MN4F": [
			{
				"comment_id": 6,
				"body": "Decentralized 4chan\nDo you know this other decentralized 4chan that you can use with Tor ?\nhttps://ndm-inf.github.io/BlockChan/anonymous",
				"added": 1566038360
			}
		]
	},
	"comment_vote": {
		"66_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3": 1
	}
}