{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1_17FpvmzYnpNwpzJ9BQDG2eymGCaTRhVasD": 1,
		"1_1HKWyoRuWbbxn9JishF47FMYDFkdoKfqw9": 1,
		"1_1BkRbLkwPydHn6UHzFyzJKMaBTcZmq44kh": 1,
		"1_1B1ZDVuFGG2UNTpmkz44Cs2Vk9QdNe4qcA": 1,
		"1_1BB1hdi575Fmj7yDAVxTBv1myPSeYraq1g": 1
	},
	"next_comment_id": 16,
	"comment": {
		"1_17FpvmzYnpNwpzJ9BQDG2eymGCaTRhVasD": [
			{
				"comment_id": 1,
				"body": "> [mylittlefox](#comment_1_1BG5BeNG1YRMiDD9HMT9cNadnh7tKqC6VS): Utilizando la red TOR, encontraran contenido audiovisual en grupos de chat como http://d3rcyeh5rh5qcgar7taco5yidg2t22bo6cyqab6sama2rpqp5e6fwtqd.onion/ Posdata: Sean buenas personas y no financien las redes de trata que además pueden ser estafados y posiblemente se lo merezcan.\n\nHa, como si puedieran ser buenas personas",
				"added": 1633652576
			},
			{
				"comment_id": 5,
				"body": "La piratería de este contenido audiovisual es la mejor manera de evitar empoderar a las empresas que se lucran de la trata de personas a la vez que se reduce la cantidad de violadores\nQue al igual que los videojuegos violentos reducen la violencia\nLas fantasías sexuales reducen el impulso sexual. siendo este contenido libre y gratuito la mejor lucha contra la generación de nuevo contenido",
				"added": 1633706189
			}
		],
		"1_1HKWyoRuWbbxn9JishF47FMYDFkdoKfqw9": [
			{
				"comment_id": 2,
				"body": "Tu pregunta es muy amplia para ser respondida, verifica estos hipervínculos.\nSigue mi consejo evita la desinformación\nhttps://www.who.int/es Información oficial\nhttps://www.chequeado.com/latamcoronavirus/ Información extra oficial para latinos ignorantes",
				"added": 1633704313
			}
		],
		"1_1BkRbLkwPydHn6UHzFyzJKMaBTcZmq44kh": [
			{
				"comment_id": 3,
				"body": "Es complicado pero consta de estos pasos\n1) Aprende desarrollo web  y crea una pagina estática con la siguiente información\n      1)Pruebas de que cuentas con el producto\n      2)Una direcion de mensajeria anonima y un monedero cryptografico\n2) agregala a la red tor o i2p es importante que entiendas las ventajas y desventajas de cada plataforma\n\nDate a conocer en la hidden wiki para eso tienes que crear una cuenta con un mail2tor que también puedes usar como sistema de mensajería si lo cifras con pgp\n\nTe dije que era difícil, lo que no te dije es que también es peligroso. avisame cuando vendas cuentas de netflix\njoven terrorista.",
				"added": 1633705214
			}
		],
		"3_1CnPKHcvEFghN8oAws7jbsrRCwVnA2Vjzb": [
			{
				"comment_id": 4,
				"body": "No, nunca va a pasar otra vez\nsolo con entender la razón por la que iniciaron\nTe vas a dar cuenta El por que https://yewtu.be/watch?v=35hzMt6d1mg",
				"added": 1633705653
			}
		],
		"2_1CnPKHcvEFghN8oAws7jbsrRCwVnA2Vjzb": [
			{
				"comment_id": 6,
				"body": "wow, alguien es tan estúpido para caer en eso ?",
				"added": 1633706293
			}
		],
		"1_1NMCFWDADxSq72B1HrpfTXX5doGjDpXfoG": [
			{
				"comment_id": 7,
				"body": "> [madredivina](#comment_1_1CnPKHcvEFghN8oAws7jbsrRCwVnA2Vjzb): te recomiendo que sigas las enseñanzas dadas por Samael Aun Weor el ultimo hombre consciente que salio de esta   raza... dejo varios libros gratuiros el que despierta la consciencia tiene poderes inimaginables pero debe aprender a eliminar los defectos psicologicos que hay dentro de su mente y despertar la kundalini  ...esa es la magia blanca\n\nOh, Siempre hay un pero.",
				"added": 1633706412
			}
		],
		"1_1544SHgCepYj6Sm4yr5nbjVCPjFSSmUu8G": [
			{
				"comment_id": 8,
				"body": "Hay muchas formas dependiendo el caso, pero ninguna solución mágica.\nsi estudiaras lo suficiente te darías cuenta que no puedo resolver tu duda sin mas detalles\nRemotamente te aseguro que nada Tienes que tener acceso local como a su computadora o smartphone.",
				"added": 1633706704
			}
		],
		"1_13Q2UEGNWBXLTi6rfZFb5y24PXWQjY3Njm": [
			{
				"comment_id": 9,
				"body": "1) Aprende a escribir\n2) descarga telegram\n3) busca cuentas en la aplicación\n4) Nunca habrás la cuenta en una navegador comprometido con tus datos personales y contraseñas\nOtra opción es comprar en la dark net base de datos filtradas aunque suele ser rentable para venderlas 100000 claves no te servirán de nada si solo quieres ver la casa de papel. Like si hacerte",
				"added": 1633707041
			}
		],
		"1_1B1ZDVuFGG2UNTpmkz44Cs2Vk9QdNe4qcA": [
			{
				"comment_id": 10,
				"body": "A) Tu propuesta carece de sentido por que las personas que ingresan a ZeroNet saben de antemano que pueden encontrar mas de una cosa desagradable.\n\nB) Ademas la censura existe pero de manera democrática al ser conexiones sin nodos centrales las paginas con mayores usuarios son destacadas, mientras que las que tienen menos pueden ser rastreadas y eliminadas por las agencias de inteligencia\n\nC) Ademas los países con mayor presencia en la globalización hacen responsable a los usuarios por el contenido que suben a la red.\n\nCuando tu entras a un sitio web en zeronet automáticamente lo compartes y por ese motivo vas a tener que declarar ante la justicia\n\ndepende de la regulación de tu país si poseer de contenido ilegal te condena o solo el comercio y el abuso infantil directo.\n\nPrefiero la segunda por que si tuviera enemigos políticos podrían craquear la computadora  para inculparme y así deteriorar la democracia de un territorio\n\nEspero criticas constructivas al respecto, gracias por su atención y lamento no haber sido mas directo",
				"added": 1633708555
			}
		],
		"1_1BB1hdi575Fmj7yDAVxTBv1myPSeYraq1g": [
			{
				"comment_id": 11,
				"body": "Aquí las mejores películas animadas de todos los tiempos\nhttps://invidious.kavin.rocks/watch?v=o-t03zBQF8s",
				"added": 1633708829
			}
		],
		"1_1MDWdnEwgisxd9KzPB8Aq7WimuBhhs9dX5": [
			{
				"comment_id": 12,
				"body": "La clave es 1234",
				"added": 1633709027
			}
		],
		"1_1EqEXyPWLtNFrFyCxAhb8bWLg2w8NET3CH": [
			{
				"comment_id": 13,
				"body": "FREETUBE un cliente privado de youtube para pc\nTe permite suscribirte sin cuenta de google\nhttps://proxy.metager.de/freetubeapp.io/?url=https%3A%2F%2Ffreetubeapp.io%2F&password=4a6fccc6f54ff95a6b8c1f456a3d7902e07be38f899ba88340cc609339eeec4d",
				"added": 1633709369
			},
			{
				"comment_id": 14,
				"body": "> [kitsunekashikoi](#comment_13_1Lcgu7HLmgq6xgUkbjVCaTvmW9xZhvhw8b): FREETUBE un cliente privado de youtube para pcTe permite suscribirte sin cuenta de googlehttps://proxy.metager.de/freetubeapp.io/?url=https%3A%2F%2Ffreetubeapp.io%2F&password=4a6fccc6f54ff95a6b8c1f456a3d7902e07be38f899ba88340cc609339eeec4d\n\nhttps://freetubeapp.io/ Sin proxy mas inseguro",
				"added": 1633709454
			}
		],
		"2_1MtnAW7x2y3YJjRxubqBkP47UVGpjScdtG": [
			{
				"comment_id": 15,
				"body": "> [5gp](#comment_5_178fkECLjaLXi4JhW8Yi8bZPL2J2jAJHVo): es simplemente el futuro de internet\n\nEl futuro de internet es IPFS pero siempre existirá la ZeroNet para los alternativos de todo tipo.",
				"added": 1633709865
			}
		]
	},
	"comment_vote": {
		"1_1Lcgu7HLmgq6xgUkbjVCaTvmW9xZhvhw8b": 1,
		"1_1BG5BeNG1YRMiDD9HMT9cNadnh7tKqC6VS": 1,
		"14_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": 1,
		"10_1Lcgu7HLmgq6xgUkbjVCaTvmW9xZhvhw8b": 1,
		"13_1Lcgu7HLmgq6xgUkbjVCaTvmW9xZhvhw8b": 1,
		"1_16hWJNrfBg343EHAeoYwgPXH6YpwPzf6Gp": 1,
		"4_1BG5BeNG1YRMiDD9HMT9cNadnh7tKqC6VS": 1
	}
}