{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1517355233,
			"title": "zchain - A way to create non-realtime game on ZeroNet inspired by blockchain ",
			"body": "base zite: http://127.0.0.1:43110/19j7vqt8gaAh9WFtnH3w8m97WakWANVwmN/\nGitHub: https://github.com/ImagicTheCat/ZeroNet_dev\n\nI'm just starting with this idea, so it's just a small experiment for now.\n\nConcept: \n* users can add blocks to their data file\n* the chain \"state\" is computed using the blocks after checking validity\n* blocks can have multiple children (two blocks pushed at the same time, cheating...) , ~~so at this point there is an arbitrary choice based on the hash order~~ (now blocks have a trust weight in function of the number of blocks in a chain and how much different people are pushing to this chain)\n\nIt's only about state integrity, users can \"reset\" the chain by removing or modifying a block (will invalid the following blocks). It's also possible to do a weight attack by spamming the chain to create a derived chain from a previous point in history.\nBut it's easy to imagine having a room owner whitelisting players to accept their blocks and have tools to detect cheaters or trolls. For example, if you make a chest game (it's more realtime but any turn based game with only one opponent would do the same), if a player try to cheat by modifying his previous moves, the game will rollback at the position before the modified move, I find this intuitive.\n\nI need to develop multiple experiments to see how well it can work.  And optimize storage/computation, like batching actions in a single block instead of having 1 block per action.\n\nInteresting to note that any change in the gameplay could invalid the previous blocks or simply update the whole thing like it was always here (I just added a salary system to the example without problems). This is definitely another way to conceive games/systems.",
			"added": 1517355232
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"1517355233_1Cz74bvSRgWqHaLCBUTrJPW7uvKyr8P8RC": [
			{
				"comment_id": 1,
				"body": "> [nullpointer](#comment_1_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): Sounds like a great idea. I wonder about the possibilities. I'll be keeping an eye on your project.\n\nI don't know if I will find time and motivation for that, but it would be nice to create a browser game with economy, maybe resources, and long term fight to see how it can scale with optimizations. When the project will be more mature, I will probably explain how to use the API so people can build things with it.",
				"added": 1517414774
			},
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_27_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): You have Math.random in your source - I assume that is just for test, because otherwise all peers will see different content.\n\nIt's a library generating random numbers based on a seed (alea.js), to show that it's possible to use random number generators in a game (but it allows clients to predict the next best bet so it's not very interesting for game-play values in competitive games, but can be used to have randomness in the game, like a procedural map).",
				"added": 1517419306
			},
			{
				"comment_id": 3,
				"body": "I'm thinking about game relying on time (building construction, troops travel time), it's possible to time-stamp each block with a unit of 10 minutes for example (to prevent the creation of invalid blocks by minor time offsets), so cheating on the timestamp will be restricted between the last block and the next block timestamps, which can be useless if the game is active.",
				"added": 1517436233
			},
			{
				"comment_id": 4,
				"body": "While debugging an issue, I removed all my blocks, but gitcenter became the chain start. Didn't expect that, but I think I will keep this behavior.",
				"added": 1517453717
			},
			{
				"comment_id": 5,
				"body": "> [nullpointer](#comment_4_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): The first game that came to mind was OGame. A browser strategy game where you need to collect resources, build defenses, attack players, etc. I have actually never played it myself, but got a friend who did. I'll ask him for some details. [...]\n\nI was thinking to this one too, I think it's possible and I wonder about the computation time of the chain if there are many players, but optimization is possible with a cache system.\nEdit: \nI have an idea, the zite owner or game owner could push a snapshot block at the beginning of the chain and mark it as the new chain origin, then all the old game blocks would be unused (and deleted by users at some point), resetting the chain (less computation, probably less disk space used) and saving the game state at the snapshot point (prevent the chance of a state reset if a very old block becomes invalid).",
				"added": 1517500845
			},
			{
				"comment_id": 6,
				"body": "> [samp](#comment_1_1BrWfc2d3PZKCUr6mg3brj9GvqVJpsRVw5): If you aren't careful, you might just wind up accidentally developing ZeroCoin.\n\nWould have been fun, but if in the concept it is a blockchain, the blocks are shared between users and are associated to a specific zite, so there is no guarantee about the data, no way to restore blocks, no way to valid blocks independently from the zite owner and no strong protection for transactions. It's only about user interactions and state integrity following the chain state rules.",
				"added": 1517533439
			},
			{
				"comment_id": 7,
				"body": "> [nullpointer](#comment_3_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): Sounds great. I'll be looking in to some game designs once your API leaves beta.\n\nI added a GitHub link with the zchain.js file synced with the base-zite file, with documentation.",
				"added": 1517538335
			},
			{
				"comment_id": 8,
				"body": "> [nullpointer](#comment_5_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw): Thanks. I'll look into it. Can't say I'll be having a game up and running in a few weeks though. Got my own zite to sort out first.\n\nNo problem, I will try to develop soon something basic but interesting enough to have active players and see how it performs.",
				"added": 1517667841
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_31_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Nothing new?\n\nNo motivation right now, but there is a project we started with a friend. http://127.0.0.1:43110/1FjgSoanBLFtHoUjKDFLkb3AN9MtVq9aM1/",
				"added": 1529170639
			}
		]
	},
	"comment_vote": {
		"2_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"3_1LTNeHLX2niwZ1Qsucq8YEe9Zwkvb7b4pw": 1
	}
}