{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1595539570,
			"title": "zeronet dedicated distro",
			"body": "Already made one, but it was no go zone concept. Not too heavy (18 MB in RAM with active zeronet sync through tor daemon) but too big 1.4 GB .ova virtualbox file (with zerotalk, zeroid and some others sync zites). Whole virtualbox concept is flawed IMHO.\n\nQuestions.\n\nZeronet dedicated distro: \n\nopenbsd vs linux (nosystemd, today at least 60 noncocked distros exist , thinking about alpine-linux, void, ) ???\n\nlIve cd, system running from usb flash      ???\n\nVirtualbox, KVM virtualization       ???          Bullshit IMHO\n\nDesktop environment ???            lightweight !!!!!!!!!!\n\nAppImage of Zeronet  ???   Yeah this could be new experience. \n\nDistribution on normalfags web??? I piss on githublabcockdick whatever we need your email to verify your ID. I have problem.\n\nMy vision (new vision) - lightweight fucker - alpine ( never use alpine package manager before so yeah) or similar running from  usb flash live instance with truecrypt,  encrypted by TC for sure. Whole HDD in pc encrypted with TC  ( or partition) with ZeroNet-py3 data folder.  Step by step TXT documentation for fags. Rock and roll. \n\nThe first prototype is nonsystemd linux (1.4 GB virtualbox *.ova,  3.5 GB after loading in virtualbox - 100 GB HDD space limit) with apt package manager, which zeroed problems with system (and zeronet) update, but even  uncucked nonsystemd distro now has many stupid dependencies and bloat.  In strip down activity it goes to apt fuckery, think it is still repairable. Still works.\n\nPros: Fags only need know how install virtualbox and load .ova file. \nCons: 1.4 GB for download, HDD limit (can be  expand) bigger ram usage, virtualbox is oracle cockhold soft -- remember network card driver leaks ???, KVM is not for fags - too complicated. \n\nLightweight distro with apt package will be great, but now most nonsystemd linux have own package managers. This bring problem with actualization - maybe new Zeronet version - new system version. But this bring problem with distribution to users.\n\nBring all ideas genlemen.",
			"added": 1595539569
		}
	],
	"topic_vote": {
		"1595862353_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": 1,
		"1595861716_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": 1,
		"1595903595_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": 1,
		"1596079219_1LVZEMhitcYT5Q7bw5Hy9qWURWK5UaSfd6": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1595539570_14DNyAMGhtRAujyha8zv5Gv6WNCEbotvcj": [
			{
				"comment_id": 1,
				"body": "> [edgelordofdecent](#comment_619_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Lxde, xfce are lightweight desktop environments\n\nlol. openbox, fluxbox or dwm are lightweight xfce is bloated crap and lxde is same :)",
				"added": 1595540632
			}
		]
	},
	"comment_vote": {}
}