{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1537122848_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "As long as it supports proxies that also handle DNS requests than number 2 is satisfied. This means that firefox, orfox and the tor browser all meet number 2. \n\nAnyway, to do this in the browser I think that most options have an option to disable dns-prefetch. In the above mentioned browsers this can be found in about:config. For chrome and chromium it can be done with command line switches but one can't easily apply command line switches in android.",
				"added": 1537176116
			}
		],
		"1536324263_14WGRwSbM55c5DuiSCME94BTj6GozZ48op": [
			{
				"comment_id": 2,
				"body": "> [swastika](#comment_4_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): You can add a peer manually to a site, like this: [...]\n\nDoes it favour local peers and if not can we set it to favour local peers?",
				"added": 1537469967
			},
			{
				"comment_id": 4,
				"body": "BTW, I'm not sure that private IPs should be blocked in Tor only mode, because private network traffic is likely more private than tor. Perhaps, there could be a list that one configures of ip address that are allowed in Tor only mode. This might be simmilar to the friend concept used in Freenets \"darknet mode\". \n\nA workaround might be to create a proxy for Tor that intercepts onion addresses of friends, and if they happen to be on the local network then connect via the local network instead of via Tor.",
				"added": 1537470742
			}
		],
		"1537239676_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 3,
				"body": "> [blurhy](#comment_154_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1536913855_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK/Credit+system+To+anti+spam+and+for+voting\n\nThe web of Trust system used on fms (Freenet Messeging system) is quite light weight. I suggest the trust system works as follows, each Hub is giving a trust of 50 out of 100 to start, each hub would have a Trust list of various identities. Users could also publish their own trust lists or subscribe to the trust list of other users. There should be a setting to subscribe to the trust list of other users which is not on by default. The reason being is because this will keep the size of the database smaller. Also it is my observation that the users of ZeroNet prefer more moderation than the people of Freenet. By making the default trust lists curated by Hub owners new users would be shielded from the types of content that is most likely to offend them, and they would have the option if they thought the hub owners were blocking people they shouldn't of subscribing to alternative trust lists and/or hubs.",
				"added": 1537470415
			}
		],
		"1537537878_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 5,
				"body": "> [flax](#comment_3_1Ap8wHPueMwX3Bcazwgbbpuu5C6ssSRSA): I don't really know much about math or cryptography but from what I understand it can predict prime numbers rather than the brute force method used today for cryptography, which is based on the random interval prime numbers occur at.\n\nIt just says that the nontrivial zeros lie in the line 1/2+it, but since t is a real number this gives you an uncountable number of possibilities. So the hypothesis in and of it's self doesn't narrow things down much. On the other hand perhaps some technique in the proof could make finding the zeros of the zeta function easier.",
				"added": 1537556764
			}
		],
		"1536913855_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 6,
				"body": "> [blurhy](#comment_111_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): captcha\n\nOn freenet when you solve a users captcha then you appear on their trust list. This allows other users to discover them. Freenet has to different WOT systems and both use a captha. There is WOT plugin, and a separate WOT system for fms (Freenet Messaging system). I strongly prefer the fms version because it is much lighter weight.",
				"added": 1537578128
			},
			{
				"comment_id": 7,
				"body": "> [trenta3](#comment_26_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): The paper I suggested gives different trust score to couples of users, so that the trusting really depends on the people you choose to trust and who do they trust. This means that if you do not trust the \"CIA subverting agents\" their votes will have very little to no effect to what you see.\n\nWhy couples of users? Why not either one or many instead. Certainly I see the advantage of a trust list maintained by multiple parties but at the same time it is more complex and requires more cooperation.",
				"added": 1537578336
			},
			{
				"comment_id": 8,
				"body": "> [d14na](#comment_57_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): Just want to mention another WOT reference. #bitcoin-otc worked very well in the early days of Bitcoin (before exchanges existed) online trading. [...]\n\nIf it is real number then > [d14na](#comment_57_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): Just want to mention another WOT reference. #bitcoin-otc worked very well in the early days of Bitcoin (before exchanges existed) online trading. [...]\n\"iirc, this system was +10, 0, -10, although +1, 0 or -1 would work just fine, if we're talking about real numbers and not integer values.\"\n\nIf we are talking about real numbers then the two ranges are essentially the same in terms of resolution but in reality we are talking about finite precision rationals.",
				"added": 1537578525
			},
			{
				"comment_id": 9,
				"body": "> [thunder33345](#comment_216_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): TLDR: we have different ideas in mind, my idea of trust score is how much i trust said person shall they vouch a \"moderation actions\" and how likely shall i my client follow through it\n\nexample: i vouch a moderation action to hide a content as spam, people who trusted me + multiple people who vouch the same only then the client would actually hide the content\n\nIt might be good to have more than one trust metric. For instance, I could assign a trust based on content quality and a separate trust value for spam. If the trust metric is single valued then for better or worse people will use it to hide content that they find offensive.",
				"added": 1537578674
			},
			{
				"comment_id": 10,
				"body": "> [trenta3](#comment_26_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @toyata Concrete examples of trust-based systems that can be subverted or have been?\n\n> @thunder33345 Sorry I can't understand what you are saying, except that even if you are \"for freedom\", you have a blocklist for spam. The current topic is about automatically create a different blocklist for each user based on their trust/distrust scores and maybe even not to seed content of blocklisted users (if others thinks they are not spam they will continue to seed it).\n\n> The paper I suggested gives different trust score to couples of users, so that the trusting really depends on the people you choose to trust and who do they trust. This means that if you do not trust the \"CIA subverting agents\" their votes will have very little to no effect to what you see.\n\nOne person can block a lot of bots, so even if you follow only one persons trust list and then they are quite active then that could significantly improve ones experience. Based on the bot percentage one could decide how many new users that they are willing to trust per day. Perhaps there could also be some kind of flood control based on trust values. One sets the number of new users they want to learn about each day, and there preferred way to discover new users is from trusted peers. \n\nAnyway, the more users trust-lists that one trusts the higher probability that one of the users will be someone that they don't want managing their trust lists. However, depending on the trust system it may be difficult for said user to either censor people or flood one with more bad peers. \n\n> That apart, this whole discussion really encorages me to create thausands of bots and spam here for the whole week. After that I think we should re-have such a discussion.\n\nObviously if that happens then everyone will be on board. However, I think that the hubs are moderated, which will mitigate this to a degree but there is obviously only so much moderation that one person can do in a day. Perhaps, we have a very vulnerable system but fortunately no one is exploiting these vulnerabilities yet. I think though that even if this message system is attacked, one could still chose to only follow the feeds of \"followed users\" and within those feeds, people could start sharing their trust lists in order to help mitigate the attack. \n\nThe ZeroNet Devs could even push an update that makes it so you automatically trust the trust lists of 10 people that you follow. They could have it all ready to go for when there is an attack but make it optional prior to an attack. Some reasons to delay making it the default is to simplify the messaging system for new users and to reduce the amount of computing resources needed.\n\nActually though, it would be good if an optional trust system was in place so everyone is ready for when it is needed.",
				"added": 1537580078
			}
		],
		"1537562855_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 11,
				"body": "> [homulilly](#comment_60_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): as long as you're fine with them having access to all your traffic\n\nWell, in that even, I hope the onion site isn't also using cloudflare for ssl encryption.",
				"added": 1537580626
			},
			{
				"comment_id": 12,
				"body": "> [homulilly](#comment_62_1JXekkVYJNdozXPFXZEA1AJXKjkWyFciTD): If they're using any of cloudflare's services (including this) they'ed have to be since none of cloudflare's functionality can work unless they mitm your site.\n\nWell, I hope that's not the case because that wouldn't be very hidden!!!!",
				"added": 1537685405
			}
		],
		"1536786377_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": [
			{
				"comment_id": 13,
				"body": "> [kaffie]\n\nanyway, why not tell us which facts (properly cited) in the Podesta emails that you find interesting and then if we also find them interesting we can look them up. I'm sure there are a tone of of stories about what PIZZA gate is and as it stands, the prevailing opinion is that said PIZZA shop is not guilty of any crime. On the the other hand the Podesta emails are well documented by wikileaks and are something that we can all refer to. We can discuss the Podesta emails without focusing on some twisted PIZZA rabbit hole plot. Let the facts lead us and not some cheesy tail!",
				"added": 1537691929
			}
		],
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": [
			{
				"comment_id": 14,
				"body": "> [blazar](#comment_54_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): Because it's not \"be nice\". The new CoC is also about \"You must behave as we said even outside the project. Even in totally private space.\". So pretty much fuck those who support that CoC. [...]\n\nWhy can't they fork it if they don't like the CoC though????",
				"added": 1537857398
			},
			{
				"comment_id": 15,
				"body": "> [blazar](#comment_57_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83): Why should they fork their own project due to SJW-nazis? Is it justice?\n\nIt seems that it would be more productive then bringing all of linux down.",
				"added": 1537858421
			}
		]
	},
	"comment_vote": {}
}