{
	"next_comment_id": 6,
	"comment": [
		{
			"comment_id": 1,
			"body": "¡Muy bien! \n\nYo estoy pensándomelo. Me gustaría montar un nodo más o menos fijo en la raspberrypi y acceder desde fuera de la intranet, aunque sea con clave/contraseña. Un poco al estilo de transmission-daemon, que permite definir accesos externos a la red local. ¿Es esto posible en ZeroNet?\n\nLo pregunto porque veo que has hackeado un poco el tema de blog original (a mi también me gusta oscuro) y supongo que conoces un poco mejor sus posibilidades.\n\nOtra opción que tienes es montar un ProxyZero para que tu blog se vea en la internet normal (yo estoy usando ahora bit.no.com:43110). Es algo que también quiero saber cómo se hace.\n\nSaludetes y suerte.",
			"post_id": 3,
			"date_added": 1449658460
		},
		{
			"comment_id": 2,
			"body": "> [shevek](#comment_1_1FKv8ekYrPvVxZASX4Rk6EYQYpASnHaiXn):\n> Yo estoy pensándomelo. \n\nJoer, qué digo, si hasta tengo un blog que me creé de la nada, sin instalar un solo programa en ningún sitio:  1DjxL7mt1yeK8Mt9dxcZ5UB52MvQMB97Pw\n\n",
			"post_id": 3,
			"date_added": 1449658947
		},
		{
			"comment_id": 3,
			"body": "> [raito](#comment_1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw): Gracias por tus comentarios. Yo también he pensado en montar algo así en uno de esos aparatitos, si compro uno lo haré. Por cierto, ¿creaste el blog desde bit.no.com u otro Zero Proxy o cómo?\n\nHola raito.\n\nDisculpa la tardanza.\n\nMi blog lo creé navegando a través del proxy bit.no.com Creo que visitando ZeroBlog te da la opción de crear el tuyo.",
			"post_id": 3,
			"date_added": 1451489496
		},
		{
			"comment_id": 4,
			"body": "Yo uso Vim esporádicamente. Quizá fue el primer editor de texto en CL que usé hace más de 20 años en un sistema AIX. Enseguida aprendí el truco de \"i\" para escribir y \"esc\" para volver al modo comando.\n\nPero odio este tipo de editores (como emacs) con una curva de aprendizaje tan brusca... y tan inútil: centenares de combinaciones de teclas que hay que memorizar y que sólo se usan en un editor determinado. Odio aprender cómo se copia-corta-pega texto en cada editor que uso. Si un editor usa Ctrl-C para copiar y Ctrl-V para pegar (lo más universal) entonces tiene una posibilidad de que lo considere para usarlo.",
			"post_id": 7,
			"date_added": 1451947253
		},
		{
			"comment_id": 5,
			"body": "En las últimas versiones de ZeroNet no consigo activar la conexión de ZeroNet a través de Tor en la Raspberry Pi\n\nHe instalado un repo que me permite actualizar Tor a la versión que usa ZeroNet, pero nada. Me sigue dando error de conexión :-(",
			"post_id": 10,
			"date_added": 1455577542
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {
		"3": 1
	}
}