{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1552807915,
			"title": "How does the zero net actualy work in regards to php and databases?",
			"body": "So i do get that its basically torrent for websites, but wouldnt that mean that php code and databases are user readable?",
			"added": 1552807914
		},
		{
			"topic_id": 1565185775,
			"title": "How does one deal with illegal content here?",
			"body": "Say someones a faggot and uploads cp. If i happen to download it, it gets shared from my computer, right? And if i dont notice it bunch of people can download it from me? So im a distrubutor at that point, arent i?\n\nSo what can i do to avoid such situation? Is it even encrypted or can everybody between me and the pedo see what is he sending to me? If somebody wanted to destroy the community, all he would have to do is to spam cp all over the place until everybody gets scared and leaves?",
			"added": 1565185773
		}
	],
	"topic_vote": {
		"1552788873_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 40,
	"comment": {
		"1552807915_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 1,
				"body": "> [satoxyn1](#comment_11_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): There's no \"server side\" (=php) code in ZeroNet, all user code is executed in browser and contain in .js files. The databases are user readable.\n\nSo things like private chats and such are impossible?",
				"added": 1552814388
			}
		],
		"1561669750_1QH31dTs9gcggfUp7PvFkW7kPohheUHARS": [
			{
				"comment_id": 2,
				"body": "I do have it but why would you want that? \n\nSeriously, im failing to see for what purpose could you possibly want to use that",
				"added": 1561940863
			}
		],
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 3,
				"body": "> [tempofunktron](#comment_1_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81): Depends on the zite. On Millchan and 08chan, you can mute the poster behind the CP posts, deleting all content sent from them and preventing it from being shared. [...]\n\nYeah but what if i dont notice the pedo\n\nIf somebody really wanted they can get me regardless of tor being used, not to mention that id be storing cp on my drive, so if my computer got seized for whatever reason im fucked",
				"added": 1565186857
			}
		],
		"1565288290_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "Holy shit they are quoting me\n\nI feel special now",
				"added": 1565288804
			},
			{
				"comment_id": 5,
				"body": "Hey Kelly, if you are reading this, you should know that you suck you filthy brainwashed NPC\n\nThanks for the mention though, the attention is greatly appreciated",
				"added": 1565290455
			}
		],
		"1565237461_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 6,
				"body": "The thing that really boggles my mind though is that if the nazis thought that all jews are parasites and must die, and had them all nicely rounded up in the concetration camps, why did they just let them sit around and fed them for six years instead of, you know, exterminating them and all\n\nThe holocaust really fits there, it really seems like something they would have done in the situation",
				"added": 1565294328
			}
		],
		"1565219322_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 7,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_615_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): how can you ban the wind?\n\nSay that anybody caught using the wind will hang",
				"added": 1565294477
			}
		],
		"1565292753_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX": [
			{
				"comment_id": 8,
				"body": "> [zerodud](#comment_18_1NFJShBdHywQbAzqKUVzAv4Qekh1BkXRR9): Same here, i had read about it but never found the need to use it.Its a shame 08chan is so basic in features, i guess in the future if its updated there won't be a need for a hosted chan anymore.Lets see if they dare to take down 4chan too, now THAT would be big for ZeroNet.\n\nMillchan is literally the same thing but newer\n\nDont share it with the pedos though\n\nhttp://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/",
				"added": 1565302170
			}
		],
		"1565338450_1Hbt9rJ8U9kpEFaxHAfLWzxWtKRYiEDb2G": [
			{
				"comment_id": 9,
				"body": "I like the new guys actually",
				"added": 1565343578
			}
		],
		"1565256550_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1": [
			{
				"comment_id": 10,
				"body": "> [zerowatchdog](#comment_9_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM): Additionally, I would like to see a user ranking based on \"likes\", posts and/or relationship (trust level). Maybe something like https://steemit.com/faq.html#Does_it_cost_anything_to_post__comment__or_vote but without crypto money. As a result it could be a kind of social self-regulated ecosystem. Limits trolls and haters, supports ZeroNet to gain value by good content.\n\nThats actually not such a good idea. Having a plenty of experience from both reddit and various imageboards, i find the communities with a complete lack of any karma system much more honest and straightforward. Users there are not afraid to say what they think out of fear of losing goodboy points. Opinions and ideas flow much more freely. \n\nYes, it does limit trolls and whatnot, it does bring its own set of issues however like karmawhoring and dissenting opinions being silenced by the sheer amount of downvotes leading to the platform devolving into a massive echo chamber and circlejerk.\n\nConsidering that 0net was made as an answer to the increasing amount of censorship, i think that this one should be passed on",
				"added": 1565351112
			},
			{
				"comment_id": 11,
				"body": "I really like the imageboard format actually.  Maybe you could blur the thumbnails beyond the point of danger of getting into trouble for it. If it looks like porn, simply dont open it.",
				"added": 1565351455
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 12,
				"body": "> [aspidochelone](#comment_23_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Back in the 1990s, the Human Genome Project was going and everyone with any knowledge of genetics was pretty sure how it would go.  They would find that intelligence is a multifactorial inheritance like height, with many genes affecting it a little bit.  The frequencies of each form of each gene (allele) would be worked out in each racial population, and eventually it would be found that one race was statistically a little smarter than the other -- but then, of course, we would know that certain people in each race have larger genetic advantages or disadvantages. [...]\n\nThis really makes one think, though: where does intelligence come from then if not from the dna? Why is the black bell curve 15 full IQ pointsbehind the white one? The data doesnt lie. Id argue that its for the same reason that cats arent as smart as humans - they simply didnt evolve as much in the brain department. \n\nHumans left Africa more than 120k years ago. Thats more than enough time for natural selection to give us things like lactose tolerance, turn our skin completely pale, change our skull shape and so on. Is it such a strech to add some extra IQ points on average? \n\nDarwin teaches us that natural selection is driven by the pressure of the environment. So, wouldnt 120k years of harsher winters, scarcer food, less fertile ground and god knows what else lead to a superior human compared to those who lived on easy mode in subsaharan africa?",
				"added": 1565352755
			}
		],
		"1565346520_1CN9rdrWkKbk8EmDSQNZZrwGmd8TvVbgjM": [
			{
				"comment_id": 13,
				"body": "You do know however that anything even slightly related to politics is heavily censored, right?",
				"added": 1565378423
			}
		],
		"1565492359_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 14,
				"body": "> [nickwa](#comment_320_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): The average IQ in the world is actually dropping. https://www.sciencealert.com/iq-scores-falling-in-worrying-reversal-20th-century-intelligence-boom-flynn-effect-intelligence\n\n\n\n>Norwegian\n\n>British teenagers\n\nId bet my left nut its the subhuman immigrants dragging the average down",
				"added": 1565518629
			}
		],
		"1565601077_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 15,
				"body": "So that everybody can feel same as shitty as you?",
				"added": 1565605199
			}
		],
		"1565583628_1C9SF8vbHqBVYVnqB7zzqZuNjuvXiUVUBv": [
			{
				"comment_id": 16,
				"body": "> [caryoscelus](#comment_191_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): That's a long-standing issue (cause it's considered feature). I think there was some fork of 0talk which had sane comment order, but changing the order here would require userscripts or something\n\nHonestly how hard would it be to fix that? Just print them out in reverse order?",
				"added": 1565605752
			}
		],
		"1565577175_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": [
			{
				"comment_id": 17,
				"body": "...Kelly?",
				"added": 1565618590
			}
		],
		"1565702979_1AbcdjqfVPUHJsKbvTjzCJJ5isjs7wRZxk": [
			{
				"comment_id": 18,
				"body": "Clone the millchan code and just disable the images?",
				"added": 1565706363
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 19,
				"body": "Id love to know how many people have muted this dude at this point",
				"added": 1565868357
			},
			{
				"comment_id": 21,
				"body": "> [undisclosed](#comment_46_13QmjccZb92J1V7RpF8dkz4VQtJShJwuHK): Dude has a logical argument, dispute it with reasoning or gtfo.\n\nIts a loaded question assuming that some fetuses deserve to be aborted more than others.",
				"added": 1565880609
			},
			{
				"comment_id": 22,
				"body": "> [theosis](#comment_50_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Atheists should be hanged.\n\nCreationists are mentally ill and need to be committed to mental hospitals",
				"added": 1565880705
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 20,
				"body": "> [gannarchism](#comment_4_1GKvSWUo9g1J3RscxqQJBrHm7ge8Pdcdb3): white genocide isn't real.\n\n>Whites projected to be a minority in their own country by 2050\n\n>its not real\n\nSomething doesnt add up here",
				"added": 1565868523
			}
		],
		"1565874585_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 23,
				"body": "Most of them keep their asses in africa",
				"added": 1565880939
			}
		],
		"1565899855_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": [
			{
				"comment_id": 24,
				"body": "Honestly if you dont use tor/vpn, there should be an unremovable red stripe at he top of every page you load, with your ip in huge bold letters",
				"added": 1565908187
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 25,
				"body": "Close the door on the way out",
				"added": 1565920846
			}
		],
		"1565927048_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 26,
				"body": "\\> this maybe?\n\n&gt; or this",
				"added": 1565979080
			},
			{
				"comment_id": 27,
				"body": "> [eighty4](#comment_26_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): > this maybe? [...]\n\nBoth of them worked, intersting",
				"added": 1565979110
			},
			{
				"comment_id": 31,
				"body": "> [sacksahne3000](#comment_2_1BxLYFVbJh8zSewFFx3gWYBHNs63u3vNg4):\n\n&nbsp;&nbsp;&nbsp; ▲\n&nbsp;▲&nbsp; ▲",
				"added": 1565995504
			}
		],
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 28,
				"body": ">The only way for us to find a virgin and serene wife is to create our own\n\nYou do realize that if you lower the age of consent to 12, she will just lose the virginity to another pedo and your dream of purity will be gone?",
				"added": 1565979287
			}
		],
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 29,
				"body": "> [qspitzer](#comment_66_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): you could also use a '\\' instead. they both accomplish the same thing (although the hair space character looks better when viewing from the ZeroTalk list)\n\nAlso you can use the & gt; entity (without the space)",
				"added": 1565979486
			}
		],
		"1565994187_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 30,
				"body": "Somebody needed a promotion\n\nIts ok, you can just say 'come check it out'",
				"added": 1565995382
			}
		],
		"1565985176_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 32,
				"body": "They cant win this. Chinese will win even if it means murdering every last one of them",
				"added": 1566046924
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 33,
				"body": "Why is buddha there\n\nor vomit or tentacles\n\nWhat the fuck kind of prude made that list\n\nIts not from pornhub though, i know for a fact that lots of these you will find",
				"added": 1566344064
			},
			{
				"comment_id": 38,
				"body": "> [numismatist](#comment_59_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): everybody stop looking at porn\n\nThats easy for you to say, you are not cursed with being a permanent virgin",
				"added": 1566499490
			}
		],
		"1566074416_1PGDKdsYUcJajEbqqgb91pJp1rUzznwGvU": [
			{
				"comment_id": 35,
				"body": "> [kidcourageous](#comment_18_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): Also there was a great flood, technically because Earth got ass-raped by a fuckton of comets...\n\n> Bible - there was a flood\n\n> Plato - there was a flood\n\nIt all fits together, how could i be so blind",
				"added": 1566498561
			}
		],
		"1566468563_1LPwiAHM9fBUSUR5iQNVizdVMniKhC11ju": [
			{
				"comment_id": 36,
				"body": "thats my favourite one :/",
				"added": 1566498900
			}
		],
		"1566461918_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 37,
				"body": ">it is proven\n\nYou wont have any trouble providing said proof then?",
				"added": 1566499112
			}
		],
		"1566475780_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 39,
				"body": ">jewgled chromium\n\n>the rest is from microcuck\n\nIts like purposely picking the worst option",
				"added": 1566499804
			}
		]
	},
	"comment_vote": {
		"873_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"50_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1
	}
}