{
	"title": "klu9's ZeroBlog",
	"description": "Just a user, not a coder.\nInterested in ZeroNet's potential for a web less vulnerable to:\n° regulatory capture (e.g. copyright laws dictated by lobby groups) \n° takedowns (e.g. DMCA, EUCD, Article 13, domain seizures)\n° blocks (e.g. ISPs, GFW)\n° net partiality (e.g. preferential treatment for privileged content providers)\n° corporate acquisitions, changes, neglect or demise (e.g. GeoCities, del.icio.us, Flickr, Tumblr)\n° individual change, neglect or demise (e.g. linkrot; webmaster losing interest, disappearing or dying)\n° money-making shennanigans supposedly justified by the cost of providing a service (e.g. advertising, tracking, privacy violations)\n° bloat (wait for a 10MB page to load just so you can read a 10KB article)\n° connection problems (as 0net can cache sites)\n\n[klu9's media share](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Home)\n[The Papers](http://127.0.0.1:43110/1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx/)\n[ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/klu9@zeroid.bit)\n",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 28,
	"demo": false,
	"modified": 1558998213,
	"post": [
		{
			"post_id": 27,
			"title": "WebP for comics with free tool CbxConverter",
			"date_published": 1558997360.643,
			"body": "[A post on ZeroTalk about uploading comics to ZeroNet](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w/Where+to+put+CBZ+files) led to discussion of alternative formats, like [DjVu](https://en.wikipedia.org/wiki/DjVu) (which I used to use to convert massive file-size JPG scans of textbooks into files that were a fraction of the size and used a lot less of my computer's RAM than PDF, and unlike JPG can contain an OCR/text layer).\n\nI thought \"Hey, maybe WebP would useful for comics.\" And it turns out that (obviously) I wasn't the first to think that. Many comic book viewing programs already support WebP.\n\nI tried converting a comic book page from JPG to WebP myself, using an image editor. But then I found there's a handy tool to convert entire comics to WebP.\n\n+ [CbxConverter](http://tomeko.net/software/CbxConverter/)\n\nCbxConverter is a small basic GUI program for Windows that takes 'standard' [comic book files like .cbz and .cbr](https://en.wikipedia.org/wiki/Comic_book_archive) (basically .zip and .rar files usually containing JPG scans), converts the image files inside from JPG to WebP, and produces a new .cbz with a significantly smaller file size. Just drag & drop the cbz/cbr onto the program and press \"Start conversion\". After a few minutes, you get a brand new .cbz file at a much smaller size, ready to read in your comic book viewer (in my case [SumatraPDF](https://sumatrapdfreader.org/)). \n\n![CbxConverter.0.12.2](img/CbxConverter0122.png)\n\nIn my brief testing, here's what I got with it.\n\n| No. | Type | Details | Size | Sample page |\n| - | - | - | - | - |\n| 1. | [Original cbr](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz2_1Mx5xcSVsv8mdsXtKwBPD8X1SEfzN2VR5u_item_6+type:archive) | containing jpgs | 60 MB | [Jpg: 1,630KB](optional/Batman-Damned-2018-001-006.jpg) |\n| 2. | Jpg | Recompressed Q:75 | only 1 page | [Jpg: 1,260KB](optional/Batman-Damned-2018-001-006.75.jpg) |\n| 3. | WebP cbz | Default (Quality:75) | 30 MB | [WebP: 821KB](optional/Batman Damned-2018-001-006-cbx-q75.webp) |\n| 4. | WebP cbz | Quality:50 | 21 MB | [WebP: 585KB](optional/Batman-Damned-2018-001-006-cbx-q50.webp) |\n| 5. | WebP cbz | Resize:66%, Quality:50 | 12 MB | [WebP: 322KB](optional/Batman-Damned-2018-001-006-cbx-q50-66pc.webp) |\n\n(Re 2, I extracted a jpg from original and manually recompressed it as jpg in my image editor at quality 75 to see how that would compare to CbxConverter WebP at 75. I only did that for one page.)\n\nI literally could not tell the difference between No. 1 (60 MB), No. 2, No. 3 (30 MB) and No. 4 (21 MB), at least viewing on my screen and at \"Fit Width to Screen\". Even at full size most of the time I couldn't tell the difference.\n\nCbxConverter 0.12.2 doesn't allow a free choice for resizing, just a selection of 66%, 50%, 33% or 25%. But with this particular comic, 66% is only a little under my screen's width, so it's a good size. In fact, in a few places it even looks a little *better* than the original (when the original is scaled to fit my screen's width). So for me, No. 5 (12 MB) is practically as good as No. 1 (60 MB). But less than one quarter the file size :)\n\n(For coders, the source is available at the bottom of CbxConverter's homepage.)\n\nNow if only I could find a nice handy tool like CbxConverter but to convert entire comics files to DjVu, so I could compare."
		},
		{
			"post_id": 26,
			"title": "Getting a vanity address for a zite",
			"date_published": 1557164500.812,
			"body": "Standard ZeroNet website addresses, being based on Bitcoin addresses, generally look like a long string of random numbers and letters, beginning with `1`. E.g this site's:\n+ `http://127.0.0.1:43110/`**1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L**`/`\n\nBut you may have noticed that a few are not entirely random. E.g. ZeroHello's has `1HeLLo` at the start:\n+ `http://127.0.0.1:43110/`**1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D**`/`\n\nYou can create an address with your own choice of characters at the start by using a software tool called *vanitygen*. So here I'll write about what I did to get a vanity address for a new zite.\n+ [Vanitygen homepage](https://en.bitcoin.it/wiki/Vanitygen)\n\nI based what I did mostly on this guide:\n+ [3x71nc7's Blog - How To: custom ZeroNet addresses using Vanitygen](http://127.0.0.1:43110/13x71nc7fju6afMqpEPfcu3Gx9Z5hNhH48/?Post:5:How+To:+custom+ZeroNet+addresses+using+Vanitygen+) (2016-02-27)\n\nHowever, maybe because that guide is a few years old, or perhaps because I'm just not good enough at all this stuff as the original writer, I found it a little confusing or inconvenient at certain points, and I ended up doing a couple of steps differently. (I thought I might find the issues clarified in the comments, but even though the page says there are 6 comments, I can't see any.)\n\n## **Part 1: Creating a vanity address**\n\nNote: I did this on Windows. There will be slight differences on other operating systems.\n\n### **1. Get *vanitygen* for your operating system.**\n\nAvailable through the links on [the Vanitygen homepage](https://en.bitcoin.it/wiki/Vanitygen). I'm on Windows so I used the vanitygen contained in [**this zip file**](https://github.com/downloads/samr7/vanitygen/vanitygen-0.22-win.zip).\n\n### **2. Open a terminal emulator / command (CMD) window, and direct it to the location of vanitygen.**\nAfter unzipping the file, I opened a command window. (\"Start\" > search `cmd`.) Then in the file manager, I copied the path to the vanitygen folder:\n+ `C:\\Users\\klu9\\Downloads\\vanitygen`\n\nand then in the Command window right-clicked and selected \"Paste\". (Ctrl+V doesn't work in the command window.)\n\n### **3. Enter the vanitygen program name and the pattern you want your address to begin with**, starting with the obligatory `1`.\n\nAll Bitcoin addresses have to begin with `1`.\n\nSo in my case I entered into the command window:\n+ `vanitygen64.exe 1Papers`\n\n![01vanitygen.png](img/01vanitygen.png)\n+ *Vanitygen, a few hours after it started working.*\n\nDon't make the pattern too long, as each additional character increases the time needed exponentially (e.g. if I had chosen `1ThePapers`, those three extra letters could have made the process last for *days*). Vanitygen requires a lot of processing power from your CPU, so before I started the process, I closed every other program.\n\n### **4. Wait while Vanitygen creates your address.**\n\nAt the start, Vanitygen told me it would take 10 hours to get 50% of the way to creating the address. In the end that was about how long it took to complete the process fully. During that time, the task manager showed my CPU being used at 99% the whole time. Obviously it's not ideal to do other tasks on the computer while vanitygen is doing its work, so plan this for a time when you won't need your computer for other things.\n\n![02vanitygen.taskmanager.pix.png](img/02vanitygen.taskmanager.pix.png)\n+ *Task manager showing CPU at 99% while vanitygen is working. [Full size](img/02vanitygen.taskmanager.pix.png)*\n\n### **5. Save the result.**\nAt the end of the process, the command window showed me:\n+ the pattern I had entered ( `1Papers` )\n+ the complete address it generated based on that pattern ( `1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx` )\n+ The private key (\"privkey\"). This is what you will need to \"prove\" you own this address.\n\n**Keep your private key safe and secret**. This is the only time you will receive it, and if you lose it, it's lost forever.\n\nThis part (creating the vanity address) was, although time-consuming, very simple and according to the guide I linked to earlier.\n\n![03vanitygen.result.png](img/03vanitygen.result.png)\n+ *Vanitygen showing the results*\n\n----\n\n## **Part 2: Using the address**\n\nI wanted to make a fresh blog based on [ZeroBlog](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/) but with the 1Papers address. Here's how **I** ended up doing it, which may or may not be the best way to do it.\n\n### **1. Create a folder with your new address.**\nSo in my case inside the folder\n+ `C:\\Users\\klu9\\Downloads\\ZeroNet-win-dist\\data\\`\n\n I created a new folder with the address name, resulting in:\n+ `C:\\Users\\klu9\\Downloads\\ZeroNet-win-dist\\data\\1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx`\n\n### A little confusion on my part\n\nHere's where that guide gets a little confusing for me. It says to go into the folder of an existing site and \"copy everything\". Really? *Everything*? I don't think I want *everything*. Wouldn't that make another version of the existing site with all its associated content and data? Whereas I want to make a fresh, empty site. If I copy *everything*, am I going to have to manually delete lots of stuff to make it a fresh, empty site? If so, which stuff? No answer there.\n\nE.g. I took a look at the folder for ZeroBlog (`\\ZeroNet-win-dist\\data\\1BLogC9LN4oPDcruNz3qo1ysa133E9AGg8`) and just its `\\data\\users` folder contains 2,606 files in 1,303 folders.\n\nSo \"everything\" would presumably include:\n+ all the posts made\n+ all media (images, videos etc)\n+ all data on users who've visited the zite\n+ other?\n\nSo, should I instead clone ZeroBlog from scratch and do something with the result? Would doing that create a new key that is then deprived from the pool of available keys?\n\n### **2. Clone ZeroBlog.**\n\nRather than copy everything from an existing site with data already in it, I decided to make a fresh clone of ZeroBlog.\n1. Go to the ZeroHello left menu\n2. Find `ZeroBlog`. (If you find lots of similarly named sites in your list, the one I chose was the one by ZeroNet creator @nofish:, whose URL is `http://127.0.0.1:43110/Blog.ZeroNetwork.bit/` when you hover over it in the ZeroHello left menu)\n3. Click on the three-dot menu to right of site name and select \"**Clone**\"\n\n![04.0zerohelloclonezeroblog.png](img/04.0zerohelloclonezeroblog.png)\n+ *ZeroHello, cloning ZeroBlog. [Full size](img/04.0zerohelloclonezeroblog.png)*\n\nThat created a fresh empty ZeroBlog with the following address:\n+ `16xTLL1n8pNfdEx8888CivfHGwFj926h8r`\n\nWhich opened automatically in my browser, showing the \"Congratulations\" message.\n\n![04zeroblog.clone.16xTLL.png](img/04zeroblog.clone.16xTLL.png)\n+ *New clone of ZeroBlog, with `16xTLL1n8pNfdEx8888CivfHGwFj926h8r` as its address. [Full size](img/04zeroblog.clone.16xTLL.png)*\n\n### **3. Copy everything from new blog folder into the folder of your vanity address.**\nSo in my case I copied everything from\n+ `C:\\Users\\klu9\\Downloads\\ZeroNet-win-dist\\data\\16xTLL1n8pNfdEx8888CivfHGwFj926h8r`\n\ninto\n+ `C:\\Users\\klu9\\Downloads\\ZeroNet-win-dist\\data\\1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx`.\n\n\n### **4. Open the new address in your browser.**\n\nI opened http://127.0.0.1:43110/1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx/ and got the \"Congratulations\" message. Yay :)\n\n![05zeroblog.clone.1papers.png](img/05zeroblog.clone.1papers.png)\n+ *New clone of ZeroBlog, with `1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx` as its address. [Full size](img/05zeroblog.clone.1papers.png)*\n\n### **5. Open the new site's sidebar.**\nClick and drag the ZeroNet icon (near the top right of the page) to the left, and let it go.\n\n![06zeroblog.clone.1papers.sidebar.1.png](img/06zeroblog.clone.1papers.sidebar.1.png)\n+ *Initial sidebar. [Full size](img/06zeroblog.clone.1papers.sidebar.1.png)*\n\n### **6. Scroll down the sidebar and click \"This is my site.\"**\n![07zeroblog.clone.1papers.sidebar.2.png](img/07zeroblog.clone.1papers.sidebar.2.png)\n+ *Sidebar, lower down. [Full size](img/07zeroblog.clone.1papers.sidebar.2.png)*\n\nMore stuff will now appear below in the sidebar.\n\n\n\n### **7. Edit your site's details in the site sidebar.**\nIn my case:\n+ SITE TITLE > The Papers\n+ SITE DESCRIPTION > UK newspapers blog mirror\n\nThen I clicked \"**Save site settings**\".\n\n![08zeroblog.clone.1papers.sidebar.3.png](img/08zeroblog.clone.1papers.sidebar.3.png)\n+ *Sidebar, additional features after clicking \"This is my site\". [Full size](img/08zeroblog.clone.1papers.sidebar.3.png)*\n\n### **8. ???**\nHere the guide gives an instruction that was unclear for me.\n> Open content.json with a text editor and check that no domain it set.\n\n> If it is, delete it.\n\nI don't know what/where such a domain is, but my site works, so I guess I'm OK.\n\n### **9. Add the private key.**\nThe guide's next step says to shut down ZeroNet and then run a terminal / command window to sign the site. But the sidebar has a button for this. (Maybe it didn't back when the guide was written three years ago.) The sidebar also has a link \"ADD SAVED PRIVATE KEY\".\n\n(What about the identity address? 15i1fCD9BLVurrTuaN2boWoMX2urQd3CBe. That seems different from my usual.)\n\nI clicked the add private key button and entered my private key.\n\n> Private key saved for site signing.\n\nThe button changes to a message \"Private key saved.\" And also now there is a link \"FORGOT\". Oh, so maybe there *is* a way to recover your private key if you forget or lose it?\n\n![09zeroblog.clone.1papers.sidebar.4.key.png](img/09zeroblog.clone.1papers.sidebar.4.key.png)\n+ *Sidebar, entering private key. [Full size](img/09zeroblog.clone.1papers.sidebar.4.key.png)*\n\n### **10. Sign and Publish your new site.**\n\nI clicked \"Sign and Publish\". At first no reaction, but then some messages appear.\n> Content publish failed.\n\nI've come to expect when creating a brand new zite. Basically it's because of the next message...\n\n> No peers found, but your content is ready to access.\n\nA brand new zite has no peers yet, hence the \"Content publish failed\" message. Once a few peers visit the site, that shouldn't be a problem any more.\n\n![10zeroblog.clone.1papers.sidebar.5.png](img/10zeroblog.clone.1papers.sidebar.5.png)\n+ *After signing & publishing. [Full size](img/10zeroblog.clone.1papers.sidebar.5.png)*\n\n\n### **11. Reload your new site and start using it!**\nAt first I couldn't edit my new blog, but upon reload I could, and did a few basic things:\n+ Changed blog title and description.\n+ Made an [\"About this blog\"](http://127.0.0.1:43110/1Papers8S7fe6LEsa7BwVVywWVbMpUjgwx/?Post:1:About+this+blog) post.\n+ Added link to the About post in the blog description.\n+ Already automatically \"Following\" but only posts (which I already know about; I'm the one making the posts). So I also selected \"Comments\" to make sure I'm notified of those in my ZeroHello feed.\n\n![11thepapersabout.png](img/11thepapersabout.png)\n+ *Final result: about page with new blog with new address, following comments. [Full size](img/11thepapersabout.png)*\n\nAfter doing the above steps and adding some content, I publicized the new site a few ways to get some peers for it. \n+ I made posts about it on my existing blogs and on ZeroMe.\n+ I added it to a couple of \"site promotion/directory sites\", in my case [ZeroSites](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/) and [ZeroCentral](http://127.0.0.1:43110/1Dt7FR5aNLkqAjmosWh8cMWzJu633GYN6u/). There are more ways, like [New 0Net Sites](http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/) and getting your zite's address into a ZeroNet proxy like [0net.io](https://0net.io/) or [ZeroNet's Meta Proxy](https://zero.acelewis.com/).\n\n## **Conclusion**\nWell, that's how **I** ended up creating and using a vanity address, and it seems to be working. Let me know if I made any mistakes."
		},
		{
			"post_id": 25,
			"title": "A rant ;) about intellectual property",
			"date_published": 1556316509.029,
			"body": "Today, the 26th of April, is World Intellectual Property Day. So I made a bit of a jokey post about it on ZeroMe.\n+ [WIP Day post](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1556287235)\n\nThat led to some comments there, including a bit of a rant ;) from me that I'd like to post here (with a few small tweaks & corrections), as it sort of sums up my views on the issue.\n\n---\n---\n\nMy main issue with copyrights & patents is not that they exist at all, but that certain lobbies have taken a short-term limitation ([14 years in the beginning](https://en.wikipedia.org/wiki/Statute_of_Anne)) that was originally created by government for the public benefit (to encourage promulgation of knowledge, back when that was uncertain and expensive) and turned it into a near-eternal (e.g. author's life + 75 years!) private benefit for rent seekers* (in an era when we've never had less need for expensive publishers / gatekeepers / middlemen getting their cut), and have sold governments on the idea that copyrights & patents are all about \"justice\" for \"creators\", with the principle of public benefit completely hijacked (only what's good for the IP lobbies is good for the public, apparently).\n\n`*` I say rent seekers and put \"creators\" in quotation marks because often IP doesn't really benefit the actual *creators* but instead companies who didn't create anything, like patent trolls, or companies whose business model is centred around screwing over an unending conveyor belt of young & naive hopefuls. E.g. record companies with plentiful lawyers & accountants and years of institutional experience who get teenage musicians who don't know any better to sign multi-year contracts handing over their copyrights and/or royalties until their \"investment\" in the artist has been paid off.\n\nAn example: De La Soul's 1989 album \"*3 Feet High and Rising*\" isn't on Spotify because the band is pissed off that their old record company wants to garnish the band's (already miniscule) royalties from it, claiming De La Soul still owe them money on it... 3 ***decades*** after it was released and sold millions of copies, earning the record company a fortune in the process. \n+ [BBC News - De La Soul's music was about to debut on streaming - then the band complained](https://www.bbc.com/news/entertainment-arts-47414260)\n\nAnd if I remember correctly [The Return of the Jedi still hasn't technically made a profit, according to Lucasfilm's accountants](https://en.wikipedia.org/wiki/Hollywood_accounting). So no profit sharing for the actors.\n\nIn my humble opinion, trademarks are not as big a problem, as they don't seem to restrict the public from using / enjoying knowledge (books, music, medicines, inventions etc); as far as I can tell, they mainly just stop shitty businesses capitalizing on the marketing material (product names, logos, slogans, etc) of other businesses. But maybe there's a case against them too.\n\n---\n\n(And notice how IP lobbies' propaganda always talks about respecting \"creators\", glossing over the fact that, by definition, intellectual *property* benefits *proprietors*, not creators. Sometimes the owner of the copyright or patent and the creator/inventor of the work are the same person, but very often they are not.)\n\n"
		},
		{
			"post_id": 24,
			"title": "ZeroHello search & ZeroMe issues",
			"date_published": 1555862807.46,
			"body": "ZeroHello, the \"start page\" of ZeroNet, has a search box near the top, to look for content on:\n+ any ZeroNet site you're connected to\n+ a specific site, by adding the search query `site:sitename`\n\nBut I've noticed that when I do a general search there, it never returns results from ZeroMe. At least not from \"official\" ZeroMe, i.e. Me.ZeroNetwork.bit. But it does find ZeroMe posts through the alternative ZeroMe site/interface, Peeper.\n\nI mentioned this in a comment on ZeroMe:\n+ [Can anyone lists the advantages (and disadvantages, if any) / features of the alternative interfaces for ZeroMe:](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1555700549)\n\nAnd kxobot pointed out that ZeroHello search *can* find results from Me.ZeroNetwork.bit, but only if you search that site specifically.\n\nFor example, if I do a ZeroHello search for just \"favicon\", I will get results from Peeper, ZeroTalk, people's blogs etc. From all over ZeroNet *except* for Me.ZeroNetwork.bit.\n\nHowever if I do a search for \"favicon site:ZeroMe\", I *do* get results from Me.ZeroNetwork.bit. The same results that it found on Peeper.\n\nSo that's odd. But it may seem irrelevant whether the results come from Peeper or Me.ZeroNetwork.bit. But often in the past, when I clicked on a result from Peeper, a Peeper page would open but the content (post, comments etc) would not appear. Now that I'm experimenting further, I realize the content does appear on Peeper pages, it just takes longer to show up than it does when I load a Me.ZeroNetwork.bit page.\n\nHopefully one day ZeroHello search will include results from Me.ZeroNetwork.bit among the rest."
		},
		{
			"post_id": 22,
			"title": "Remember to follow your blog's comments",
			"date_published": 1554570051.256,
			"body": "I just remembered, thanks to only now noticing some week-old comments on my [media share blog](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Home), that these ZeroBlogs (regular and MyZB both I think) will automatically follow *posts* on your blog (so you will see notifications of those in your ZeroHello feed) but not *comments*, so you will *not* receive notifications of those.\n\nYou have to remember to manually follow comments in order to receive notifications. In your blog's left-hand menu, click on the button that says \"Follow\" or \"Following\" and tick \"Comments\".\n\n![ZeroBlog.follow.comments.8bit.png](img\\ZeroBlog.follow.comments.8bit.png)\n\nI also ticked \"Username mentions\" as well just in case, even though I don't really understand if it's necessary if \"Comments\" is ticked."
		},
		{
			"post_id": 20,
			"title": "Experimenting with images: WebP",
			"date_published": 1553882671.417,
			"body": "When experimenting with replacements for animated GIFs ( [part 1](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:14:Experimenting+with+alternatives+to+GIFs,+part+1) & [part 2](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:15:Experimenting+with+alternatives+to+GIFs,+part+2) ), I (re)discovered the WebP format.\n+ [Wikipedia - WebP](https://en.wikipedia.org/wiki/WebP)\n\nI looked into the animated version (like GIF), but it can also be used for still images, like JPG. There are claims it can make an image the same quality as JPG but with a file size up to 30% smaller.\n\nI wanted to post a link to an image in a ZeroMe thread.\n+ I did a DuckDuckGo image search\n+ found the image I wanted (an illustrated book cover for [*Stig of the Dump*](https://en.wikipedia.org/wiki/Stig_of_the_Dump) ) and saved it to my hard drive\n+ uploaded it to ZeroUp Unlimited\n\nand then promptly realized \"WTF?!?! ***647KB***! For that little JPG!?\"\n\nHere it is:\n![Stig - original JPG](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882393-stig.revealed.jpg)\n***[stig.revealed.jpg - 647KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882393-stig.revealed.jpg)***\n\nI opened the JPG in [Paint.net](https://en.wikipedia.org/wiki/Paint.net) to recompress it and hopefully reduce the file size a lot. I clicked \"Save as...\" and then adjusted the quality settings.\n\nNormally even just the default quality setting of 90 is enough to make a significant reduction in file size. Sometimes I take it down to 75. Only rarely, perhaps with a really large image-size, high-quality photograph do I take the quality setting down further, to maybe 60 or 50.\n\nHere's what happened with this JPG:\n\n|Qlty | File size | Note |\n| --- | --- | --- |\n| 90. | 632KB... |  \"Well that didn't do much!\" |\n| 75. | 608KB... |  \"Nor that\" |\n| 50. | 589KB... |  At this point, I can hardly believe how little the file size is reducing |\n| 25. | 574KB... |  \"Seriously???\" |\n| 0. | 553KB... |  I have never taken the setting down all the way to zero on any file... and yet this damn (small) JPG is still over half a megabyte! | \n\nBut just the other day I installed the [WebP plugin for Paint.net](https://forums.getpaint.net/topic/21773-webp-filetype-2019-01-25/), so I decided to give that a go.\n\nHere's what happened:\n\n|Qlty | File size | Note |\n| --- | --- | --- |\n| 90 | 84KB | \"Damn! I didn't even need to do any special tweaks.\" |\n\n<a href=\"http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553886268-paint.saveas.webp\">\n  <img src=\"http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553886268-paint.saveas.webp\" alt=\"Paint.net - saving image as as WebP\" style=\"width:560px;height:400px;border:0;\">\n</a>\n***[Paint.net - saving image as as WebP](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553886268-paint.saveas.webp)***\n\nI looked and looked and at normal viewing size, I can barely tell the difference between the 647KB JPG and the 84KB WebP. The WebP is only ***13%*** the file size of the JPG. (Changing through the Presets like 'photo', 'drawing' etc barely made any difference in file size.)\n\n![Stig - original JPG](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882393-stig.revealed.jpg)  ![Stig- WebP](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882551-stig.revealed.webp) \nLeft: [stig.revealed.jpg - 647KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882393-stig.revealed.jpg) | Right: ***[stig.revealed.webp - 84KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553882551-stig.revealed.webp)*** \n\n### **Conclusion**\n**Obviously this kind of saving wouldn't happen on every type of image, but it still seems we really should be using WebP instead of JPG, especially here on ZeroNet where we're trying to save bandwidth and storage space.**\n\nOne issue with WebP compared to JPG. By default, in my browser (Vivaldi), if I click on the URL for a JPG, the image opens in the browser. But If I click on the URL for a WebP, the browser *downloads* it and then opens it in the default local viewer for that file type. **EDIT: Apparently this is an issue specific to how ZeroNet on Windows treats WebP, and an issue has been filed on Github. See [this post on ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1554160326_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs).**\n\n*PS this is also my first experiment with markdown tables. Nice to have the feature but I wish the spacing & alignment were better. And side-by-side images too! Although I couldn't get the captions to align with the images using markdown table syntax.*\n\n*PPS I forgot that hotlinking images can be an issue on ZeroNet. Just because I can see the images hosted on ZeroUp Unlimited doesn't mean other people can. So I put a link to the source under each image. I've got to remember to be careful about that.*"
		},
		{
			"post_id": 19,
			"title": ".mhtml format for saving webpages",
			"date_published": 1553558942.545,
			"body": "**.mhtml** is a format that saves an entire webpage's content (including images etc) in just one file. It's been around for years. I remember saving webpages in .mhtml back when I was on dial-up. It's also basically how e-mail messages can have fancy formatting, images etc.\n+ [Wikipedia - MHTML](https://en.wikipedia.org/wiki/MHTML) \n\nJust in case you got a security warning when getting any .mtml files I've shared, let me say it: **I'm not trying to harm your computer.** .Mhtml is just the easiest way I know to save and share webpages. If you're unsure, please scan the file with an anti-virus.\n\nI've been using .mhtml to save and repost the BBC's \"The Papers\" blog on my other blog [klu9's media share](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Home), which has large images of UK newspapers' front pages, but only for one day. After that the BBC website deletes the images, for copyright issues I believe. You can compare the mhtml file I saved with the clearnet page from the BBC, from which all the images have already been removed.\n+ [My .mhtml](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop%29.mhtml)\n+ [BBC clearnet](https://www.bbc.com/news/blogs-the-papers-47688601)\n\nFor me, I save the page as .mhtml in the Vivaldi browser. And when I open the file in the file manager, it opens in Vivaldi straight away. (Oddly, it also appears as a download in Vivaldi's download panel.)\n\nBut when I open the .mhtml from within the browser (e.g. from posting it on ZeroNet), Vivaldi gives me a security warning about this file type and will only open it if I click \"Keep\".\n\n(Why is a webpage saved as .mhtml considered inherently dangerous? Why is it any more dangerous than a webpage served as .html calling in God-knows-what resources? Someone better qualified than me can maybe tell us why.)\n\n.mhtml been around for years, and browser support and treatment of the format has varied over the years. It seems it's not as easy and widely supported as it used to be. But I, as just a dumb user, have found no quicker & easier way to save and repost an entire webpage. I just click \"Save Page as... MHTML\" in my browser and then upload it to [ZeroUp Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/) and that's it. I don't have to fiddle around creating folders in my zite, deal with HTML coding or wonder if key content (like images) will break/disappear.\n\nBut as it seems there are issues with .mhtml nowadays, here I'll test it out a little in different browsers (on a Windows desktop):\n\n\n### **Chrome**\n<a href=\"img/mhtml.chrome.png\">\n  <img src=\"img/mhtml.chrome.png\" alt=\"mhtml.chrome\" style=\"width:556px;height:453px;border:0;\">\n</a>\n+ Chrome does not open the link but treats it as a download.\n+ It gives a warning message, saying this kind of file can harm your computer.\n+ I can see no way within Chrome to open the .mhtml file in Chrome itself (it only offers to open it in my OS's default program for .mhtml, Vivaldi).\n+ But if I right-click on the .mhtml file in the file manager, I can choose Chrome and it opens just fine.\n\n**Summary**\nChrome can open .mhtml, but it will download it first, give you a security warning and, once you select \"Keep\", then you can open it in Chrome.\n\n\n### **Firefox** (Quantum)\n<a href=\"img/mhtml.firefox.png\">\n  <img src=\"img/mhtml.firefox.png\" alt=\"mhtml.firefox\" style=\"width:608px;height:496px;border:0;\">\n</a>\n+ Firstly a brief ZeroNet error message pops up.\n> Connection with UiServer Websocket was lost. Reconnecting...\n\n+ But after a couple of seconds it says\n> Connection with UiServer Websocket recovered.\n\n+ Firefox does not open the link but treats it as a download.\n+ It gives a dialog box to choose\n+ + whether to open or save the file\n+ + if to open it, what program to open with... and Firefox is not in the list of options. If I choose \"Browse\" and then find firefox.exe, it pause for a while and then sends me back through the whole \"what do you want to do with this file\" dialog box.\n+ If I save the file, like Chrome, it will open in my default program, Vivaldi.\n+ + But if I right-click on the .mhtml file in the file manager, Firefox is not in the list of available options.\n\n**Summary**\nFirefox Quantum (i.e. recent versions) treats .mhtml as a file to download, and refuses to open it all.\n\n\n### **K-Meleon**\n<img src=\"img/mhtml.kmeleon.1.png\" alt=\"mhtml.kmeleon.1\">\n<a href=\"img/mhtml.kmeleon.2.png\">\n  <img src=\"img/mhtml.kmeleon.2.png\" alt=\"mhtml.kmeleon.2\" style=\"width:536px;height:391px;border:0;\">\n</a>\nK-Meleon is based on an older version of Firefox.\n+ Just opening my 0net blog in K-Meleon gives those \"websocket connection lost / recovered\" messages.\n+ those \"websocket connection lost / recovered\" messages happen again when I click the .mhtml link.\n+ Just like Firefox, it gives a dialog box: \"What should K-Meleon do with this file?\" With one difference: K-Meleon is among the options to open the file with.\n+ But if I try opening it with K-Meleon that way, it opens a blank tab and that dialog box comes up again. And if I again choose open with K-Meleon, a new blank tab and new dialog box open again. And that can go on and on.\n+ The same happens if I try going through the file manager, right-clicking on the file and choosing Open wth... K-Meleon. Blank tab and a dialog box again.\n\n**Summary**\nK-Meleon treats .mhtml as a file to download, and makes you think it will open it but doesn't.\n\n\n### **Safari**\nAs if!!!\n\n\n### **Internet Explorer**\nIs that still on my computer? What do you know, it is!\n<a href=\"img/mhtml.ie.png\">\n  <img src=\"img/mhtml.ie.png\" alt=\"mhtml.ie\" style=\"width:535px;height:443px;border:0;\">\n</a>\n+ IE just opens the. mhtml as it would any other webpage. No dialog boxes, no security messages, no treating it as a download. It just plains opens it the way it's supposed to.\n\n**Summary**\nInternet Explorer just works! Who'd have believed it?!\n\n\n## **Conclusion**\nSo it looks like .mhtml is not ideal for serving a saved webpage to other people: their browser may not support it, and they may get spooked by security warnings. I just wish I knew of a way as easy as .mhtml for saving and reposting. (Another advantage: I just share it via an upload site like [ZeroUp Unlimited](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/), so it doesn't take away from my blog's limited space and I don't have to learn about things like optional files just yet.)\n\nAny (preferably easy) suggestions would appreciated. Perhaps even one that combines with the other thing I'd like to do, which is automate the process of saving The Papers blog article (on day of release, with images at maximum quality) and republishing it on ZeroNet.\n\n### **What happens when *you* open an .mhtml file?**\nLet me know what happens for you, and what browser & operating system you're using."
		},
		{
			"post_id": 18,
			"title": "Links with brackets in markdown and ZeroBlogs",
			"date_published": 1553461165.234,
			"body": "Sometimes you want to link to something that has brackets `(...)` in the URL or the file name.\n\nE.g.\n+ `https://en.wikipedia.org/wiki/Matrix_(protocol)`\n+ `http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop).mhtml`\n\nBut this can be problematic on ZeroNet: in several places (this blog here, ZeroMe) when I tried to post the link in [MarkDown](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:markdown) (the easy code for website formatting, used here on ZeroNet and elsewhere), the result was a broken link that **displayed** the closing bracket rather than making it part of the link.\n\nE.g. If I wrote in markdown:\n+ `[Matrix](https://en.wikipedia.org/wiki/Matrix_(protocol))`\n\nThen the page would show:\n+ `Matrix)`\n\nAnd the link would be:\n+ `https://en.wikipedia.org/wiki/Matrix_(protocol`\nwithout the closing bracket. So clicking it would result in an error page.\n\nFortunately @glightstar: found the solution:\n+ [Percent-encoding](https://en.wikipedia.org/wiki/Percent-encoding)\n\nThis is when you use `%` plus some numbers to represent certain characters to make sure the browser realizes it's part of the URL.\n\nSo to make sure links with brackets work, replace the URL's closing bracket `...)` (but not the markdown tag's closing bracket) with `%29`. E.g.:\n+ `[Matrix](https://en.wikipedia.org/wiki/Matrix_(protocol%29)`\n+ `[UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop).mhtml](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop%29.mhtml)`\n\nAnd that should give you the properly displayed, properly working links below:\n+ [Matrix](https://en.wikipedia.org/wiki/Matrix_(protocol%29)\n+ [UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop).mhtml](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/UK.Newspapers.Front.Pages-2019.03.24.Sunday-BBC.News.(for.desktop%29.mhtml)\n\nNote: this problem also happens when using the WYSIWYG editor in regular ZeroBlog to add a link with brackets, as I discovered when making [this post on klu9's media share](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Post:4:UK+Newspapers+Front+Pages+-+Sunday+24th+March+2019). In the little popup box, make sure to replace the closing bracket with `%29`.\n\nFor some reason, it doesn't seem necessary to replace the *opening* bracket with percent-encoding.\n"
		},
		{
			"post_id": 17,
			"title": "Tags on My ZeroBlog",
			"date_published": 1553367085.482,
			"body": "I like the idea of tags for digital content like blogs (I know, I know: very 2000's of me). And, in contrast to regular *ZeroBlog*, *My ZeroBlog* (from which this blog is cloned) has tagging built in.\n\n+ (See [this post](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:13:This+is+not+a+ZeroBlog) for a little more on the issue of the difference between *ZeroBlog* and *My ZeroBlog*.)\n\nSo for fellow newbs, here are a few points I've noticed about tags on My ZeroBlog.\n\n### **Tags don't need commas to separate**\n**Just use spaces to separate tags.**\nOut of habit from other blogging platforms, I put commas and spaces between tags, like so:\n+ `0net, newb, blog`\n\nBut *My ZeroBlog* was treating the comma as part of the tag. I think that meant if the tag was the last in the list and had no comma after it (like \"0net\"), it would be treated as a different tag from one with a comma (like \"0net,\"). So once I realized the issue, I had to go back and clean out all the commas. So now when I put in several tags, it should be:\n+ `0net newb blog`\n\n### **Multi-word tags have to be done as one word**\n+ The above point about spaces & commas means multi-word tags (like \"social media\") have to be done as one word (like `socialmedia`). Otherwise, your post will get tagged with `social` and also with `media`.\n\n### **Tags are case-sensitive**\n+ `P2P` and `p2p` are treated as different tags. So always keep the case consistent.\n+ In the \"[TOC by tag](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Toc=tagAll)\" (i.e. list of all tags on your blog), tags starting with uppercase letters are all listed above tags starting with lowercase letters. (At first glance I thought the list was not alphabetized... until I noticed it *is* alphabetized, but twice: first tags starting with uppercase listed alphabetically, then tags starting with lowercase listed alphabetically.)\n\n![MyZeroBlog.tag.index.png](img/MyZeroBlog.tag.index.png)\n+ [Full size](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/MyZeroBlog.tag.index.png)\n+ My tag index, after I'd cleaned up some things but before cleaning up others. Note the dual alphabetization (first uppercase, then lowercase) and case distinction (`P2P` and `p2p` are treated as different tags).\n\n### **Sometimes tags appear replicated**\nEvery now and then when I'm working on and viewing this blog, a post's tags seem to multiply and replicate. (At least for me, I don't know if that happens to visitors.)\n\n![MyZeroBlog.tag.overload.png](img/MyZeroBlog.tag.overload.png)\n+ [Full size](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/MyZeroBlog.tag.overload.png)\n\nBut don't worry: it's just a temporary effect that disappears when you refresh the page :)"
		},
		{
			"post_id": 16,
			"title": "Getting more space on ZeroTalk",
			"date_published": 1553356655.695,
			"body": "Sites on ZeroNet that allow other people to do things (like make posts, comments, upvotes etc) have a limit on the space they allow users for that content and activity (to prevent spamming).\n\n[ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/), the principal forum on ZeroNet, by default allows new users just 100KB. You can see how much space you've used up just below the comment box, saying something like `USED: 80.7K/100K`.\n\nWhen you get close to that limit, a message will appear there telling you to contact **nofish** (the admin of ZeroTalk and the creator of ZeroNet itself) to request an increase. His name links to his [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/) address.\n\n![ZeroTalk - running out of space.png](img/ZeroTalk-running.out.of.space.png)\n[Full size image](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/ZeroTalk-running.out.of.space.png)\n\n**But don't use ZeroMail: it won't work.** (It didn't for me, at least.) Instead use [ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/). Write a request there mentioning him and make sure you format his name with `@` and `:` before and after, so that the message will appear in his [ZeroHello](http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/) notifications feed.\n\nE.g.\n> [**@nofish:** Please raise my limit on Zerotalk. Thanks.](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1553203658)\n\nUsing ZeroMail, I still had no response or increase in space limit after 12 days. But within 1 day of doing it via ZeroMe, I didn't get a response but my limit was raised. To 200KB.\n\nSo I guess I'll be having to do this again in another few months :)"
		},
		{
			"post_id": 15,
			"title": "Experimenting with alternatives to GIFs, part 2",
			"date_published": 1553118256.446,
			"body": "In [Part 1](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:14:Experimenting+with+alternatives+to+GIFs,+part+1), I posted a brief experiment making and comparing (the file size at least) alternatives to animated GIFs. Part 2 is about getting these image & video formats to display on a ZeroBlog, and to do so in a way just like animated GIFs, i.e.\n+ Displays automatically\n+ Plays automatically\n+ Loops automatically\n+ No control bar obscuring part of the image\n\n----\n\nBecause this blog here is not a regular ZeroBlog, I cloned ZeroBlog to create a sandbox for experimenting. It's here:\n+ [klu9's ZeroBlog sandbox](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Home) (it might be a while before there are other peers in order to view the zite)\n\n----\n\nI'll summarize the results so far here.\n\n**Key:**\n+ **WYSIWYG**: Using ZeroBlog's WYSIWYG editing mode to insert the file into the blog post (ZeroBlog's editing mode automatically taking care of copying the file to the right folder and then inserting into the blog post the code to display it).\n+ **Manual**: The blogger manually copying the file to the right folder and then manually writing and inserting the code (either Markdown or HTML) to display it.\n\n### **Animated GIF** (1.97MB)\n+ WYSIWYG: **Failure**. Converted to still JPG.\n+ Manual: **Success**. Using markdown code.\n+ [View post](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Post:3:Manually+inserting+a+GIF+into+a+ZeroBlog+post)\n\n### **Animated PNG** (1.57MB)\n+ WYSIWYG: **Failure**. Converted to still JPG.\n+ Manual: **Success**. Using markdown code.\n+ [View post](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Post:4:Inserting+an+Animated+PNG+into+a+ZeroBlog)\n\n### **Animated WebP** (280KB)\n+ WYSIWYG: **Failure**. Converted to still **WebP**.\n+ Manual: **Success**. Using markdown code.\n+ [View post](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Post:5:Inserting+an+animated+WebP+into+a+ZeroBlog+post)\n\n### **MP4** (324KB)\n+ WYSIWYG: No \"Insert video\" option.\n+ Manual: Success... apparently... at first. Upon reload, **Failure**. It displays a still image. In order to play, the user has to right-click on the still image, select \"Show controls\" and then press play. Using HTML code.\n+ [View post](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Post:6:Inserting+an+MP4+into+a+ZeroBlog+post)\n\n### **WebM** (113KB)\n+ WYSIWYG: No \"Insert video\" option.\n+ Manual: **Failure**. Using HTML code. Just a big empty space. The HTML code keeps getting modified somehow.\n+ [View post](http://127.0.0.1:43110/15mQd6kBRzriaVEjdELujex2YKFfWaA8JQ/?Post:7:Inserting+a+WebM+into+a+ZeroBlog+post)\n\n## **Conclusion**\nSo while WebM is the smallest file size, I can't make it work on a ZeroBlog. MP4 appears to work at first, but upon reload is a failure (on 3 out of 4 criteria).\n\nAlso, even if I could get videos working on ZeroBlog, they might get blocked by browser extensions or settings that prevent autoplaying video.\n\nSo at the moment, I'm favouring lossy WebP, which:\n+ works (manually at least)\n+ gives a small file size (smaller than MP4)\n+ can be inserted with markdown code (rather than HTML)\n+ won't be blocked by video autoplay blocking methods\n\n(I might also try out posting these formats on other ZeroNet platforms, e.g. MyZeroBlog {like this blog here} or even cloning [GifTime](http://127.0.0.1:43110/1Gif7PqWTzVWDQ42Mo7np3zXmGAo3DXc7h). After all, it's got \"Gif\" in the name, and it publishes mp4s).\n\n"
		},
		{
			"post_id": 14,
			"title": "Experimenting with alternatives to GIFs, part 1",
			"date_published": 1552751589.45,
			"body": "As we all know, [GIFs are evil](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm/1550063744). :)\n\nApart from issues like frame rate and limited colours, the main problem for us ZeroNet users is size: animated GIFs can easily have file sizes measuring in multiple megabytes. That's a problem when ZeroNet is based on ordinary users giving up their own disk space, bandwidth and data allowances to host and share everyone's zites.\n\nBut animated GIFs are ***fun!!!*** They automatically display, and move, and loop. All with no annoying sound! How to have all the fun of animated GIFs without all the bloat?\n\n+ **Here in part 1**, I'll briefly check out some alternatives to GIFs, and how to make them. **In part 2**, I'll discuss trying to get these moving image formats to display in a blog on ZeroNet.\n\n## The GIFs\nI recently made [a post on my ZeroBlog \"klu9's media share\" about a comedy movie](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Post:3:Monty+Python's+The+Meaning+of+Life). A great opportunity for some funny moving images!\n\nI found a couple of animated GIFs online I wanted to include in my post. But the file sizes were rather large: one was 543KB, the other 1.97MB. With only a few more posts like that, my blog would very quickly use up its default 10MB of space allowed on other users' hard drives and would start nagging people with \"Set Limit to {X]MB\" messages.\n\nHere are the original GIFs, shared on ZeroUp Unlimited to avoid using up my zite's 10MB.\n+ [Monty.death.gif - 543KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1552758773-monty.death.gif)\n+ [Monty.Python.Every.Sperm.is.Sacred.gif - 1.97MB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--OriginalGIF.gif)\n\n## The Alternatives\nOver the years, I'd heard of alternatives to GIFs, mainly video formats like .mp4 and .webm. (After all, what is an animated GIF but a form of short video?) Online image hosts like [imgur](https://www.imgur.com/) and [giphy](https://www.giphy.com/) automatically convert animated GIFs to video formats to save space and data traffic.\n+ [Wikipedia - Video alternative to GIF](https://en.wikipedia.org/wiki/Video_alternative_to_GIF)\n+ [Wikipedia - MP4](https://en.wikipedia.org/wiki/MPEG-4_Part_14)\n+ [Wikipedia - WebM](https://en.wikipedia.org/wiki/Webm)\n\nThere are also formats originally designed for still images but which also have animated forms too: PNG and WebP.\n+ [Wikipedia - PNG](https://en.wikipedia.org/wiki/Portable_Network_Graphics)\n+ [Wikipedia - WebP](https://en.wikipedia.org/wiki/WebP)\n\nFirst off, I thought I'd try converting the desired GIFs to WebM. There are command-line tools that can do this kind of conversion, like the Swiss Army Knife of video that is [FFmpeg](https://ffmpeg.org/). But I'm a bit command-line phobic so I searched for a more GUI-fied option.\n\nThere are plenty of [online converters](https://duckduckgo.com/?q=convert+gif), where you upload the GIF to a website, it converts it and then you download/save it back to your hard drive. That's probably the easiest option for just one or two GIFs.\n\nThere are also offline programs you can use on your computer, which often have the ability to convert whole batches of files. As I have a bunch of GIFs saved on my hard drive that I eventually want to convert, I've decided to investigate both options.\n\n### WebM\nSome DuckDuckGoing led me to [WebMConverter, a.k.a. WebM for Retards](https://gitgud.io/nixx/WebMConverter). Surely that'll be simple enough even for me! I downloaded, unzipped and ran it, at which point it told me it needed some other software called Avisynth and promptly opened [a webpage to download it](http://avisynth.nl/index.php/Main_Page#Official_builds). After getting lost trying to find a 64-bit installer, I just went with [the first link for 32-bit](http://sourceforge.net/projects/avisynth2/).\n\nOnce Avisynth was installed, I could run WebMConverter. I chose the 543KB GIF (monty.death.gif) as the Input file.\n\nThere are a few tabs and a heck of a lot of options available in WebMConverter but I only changed one setting: in the **Encoding** tab > **General**, I changed from **Constant** to **Variable**. I did this because of the easy-to-understand explanations.\n> **Constant** - This will make your video have a specific file size, and suffer low quality to match that size.\n> **Variable** - This will make your video get the size it deserves to look good.\n\n![WebMConverter](img\\WebMConverter.png)\n[Full size](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/WebMConverter.png)\n\nOnce that was done, I clicked **Convert**. In just a second or two the job was done and I clicked WebMConverter's **Play** button to see the result. It was good. Then I went to check the file size... 16KB! Whoa!!! It reduced the file size by a factor of **33**!!!\n\nHere's the result on ZeroUp Unlimited:\n+ [monty.death.webm - 16KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1552759261-monty.death.webm)\n\nI did the same with the 1.97MB GIF (every.sperm.is.sacred.gif), a more complicated image, and WebMConverter produced a video that was only 113KB. A reduction by a factor of *only* about 20; still great!\n\n### The Others: MP4, PNG, WebP\nLater I went ahead and also converted that larger GIF to MP4, animated PNG, and animated WebP for comparison.\n\n+ For MP4, I uploaded the GIF to [giphy](https://giphy.com). Once the [GIF's hosting page](https://giphy.com/gifs/EqOc3PnWWaXNja2rVw) was displayed, I clicked on \"Media\" to the right of the image, which led to an [MP4 page](https://media.giphy.com/media/EqOc3PnWWaXNja2rVw/giphy.mp4). (For some reason I couldn't do anything with it there but I was able to right-click on it, open in a new tab and then save it.)\n+ For animated PNG, I used a GUI tool called [gif2apng_gui](http://gif2apng.sourceforge.net/).\n+ For animated WebP, I used an online converter, [ezgif.com](https://ezgif.com/gif-to-webp) and chose the option \"Lossy\" in order to get a smaller file size.\n\n## The Results\nHere are all five versions of the larger file (every.sperm.is.sacred) shared on ZeroUp Unlimited:\n+ [Source GIF: 1.97MB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--OriginalGIF.gif)\n+ [Animated PNG: 1.57MB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--Animated.PNG.png)\n+ [MP4: 324KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--MP4.mp4)\n+ [WebP (lossy): 280KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--AnimatedWEBP.webp)\n+ [WebM: 113KB](http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Monty.Python.Every.Sperm.Is.Sacred--WEBM.webm)\n\nRemember when comparing the quality:\n+ I am not an expert on any of these formats or converting between them. I did little or no tweaking of options.\n+ The starting point were GIFs I found online. You'd probably get better results starting from the original video.\n\n## The Conclusion\nSo it looks like WebM is the best alternative to animated GIF, at least when it comes to file size.\n\nIn part 2, I'll look at the next step: getting the image/video into a blog post."
		},
		{
			"post_id": 13,
			"title": "This is not a ZeroBlog",
			"date_published": 1552421668.314,
			"body": "When I first got started on ZeroNet, I saw quite a few \"new and improved\" claims about zites (better, more features etc). At that point I cloned [MyZeroBlog](http://127.0.0.1:43110/19k2nhubaYsDJNPHL6iNs3D2K9Mgj66P4R/), based on such claims.\n\nBut then after a few more days I realized a lot of claims were unsupported by evidence or just plain out of date. So I wanted to see if it was possible to change to [regular ZeroBlog](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/), as it was clearly receiving regular maintenance and updates. I couldn't really tell if anyone had improved MyZeroBlog since 2016.\n\nI started a topic on ZeroTalk, [**I cloned one blog, can I change to a different one?**](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1546099537_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs), and followed some advice there.\n\nI thought it had worked, basically because the blog didn't die and the two formats are so similar. But [now that I've started another blog](http://127.0.0.1:43110/1NEuAUKgUoY6fnXeXBaonjrDfNbfpQpdMp/?Home), cloned directly from ZeroBlog, I realize whatever it was I tried did **not** change this blog here from MyZeroBlog to regular ZeroBlog. I now realize it's still a MyZeroBlog.\n\nAnd that explains why, when I'm editing a post, I don't get the blue circle giving a WYSIWYG editor & functions that @Geekless: mentioned, allowing image upload and enlarging, an issue I lamented in my post [Experimenting with uploads: images](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:4:Experimenting+with+uploads:+images). I have to do it all manually, dropping files into the **/img** folder and then making a link for the full size image.\n\nOn the other hand, MyZeroBlog *does* allow tagging. There are probably other differences too.\n\nNow that I'm invested in this blog here (my bad), **does anyone know of a way to add the WYSIWYG editor to a MyZeroBlog?** Or at least the image upload and enlargement function?\n\nAny help appreciated."
		},
		{
			"post_id": 12,
			"title": "Build a database of media metadata on ZeroNet",
			"date_published": 1551989740.236,
			"body": "I'm posting here an unfinished draft of an article that got ***way*** too big and for which I was way underqualified. But the issue came up in a ZeroTalk thread:\n+ [movie hash collaborative site possible ?](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1551558721_1CVzc6Q13qL6MskGL9Ni7os6GjforTAHmb/movie+hash+collaborative+site+possible)\n\nThat thread gives the gist of it, and my post was becoming too much about idea #2 (importing Bitzi Bitpedia database, which I realized probably wasn't useful, what with most people nowadays preferring high definition x264/x265 encodes rather than DivX .avi's). So as I'm probably never going to get round to completing this article (research, corrections, screenshots, links, cutting it ***way*** down), I'll throw the draft in here in case anyone's interested.\n\nI've put the unfinished bits in `code` style.\n\n---\n# Short version\nWhat do you think about:\n1. a program that makes it easier to submit media file metadata (and perhaps the files themselves) to a searchable, browseable database from which people could download the files, either via p2p like BitTorrent / ed2k / G2 or through ZeroNet itself, perhaps in combination with IPFS\n2. kickstarting that database with a Bitzi datadump \n\n# Long version:\nAnyone remember **Bitzi**? They were the folks who gave us **Magnet URIs**, those strings of letters & numbers, often presented as just a clickable image of an old-fashioned horseshoe magnet, that will get your download client (usually a BitTorrent client nowadays) to start looking for and downloading a file.\n\n`Magnet URI image`\n`plain text magnet URI`\n\n(A URI isn't a link to a *location* like an URL, a place where a file is located. Instead it's an *ID* for a file, and will try to get the file with that ID no matter where it's located, for example on any of the computers participating in a peer-to-peer file sharing network. A URI is an example of metadata, information about a file.)\n\n### Bitzi, Bitpedia, Bitcollider\n\nBitzi invented Magnet URIs *and* had an online database of file checksums & Magnet URIs that users could contribute to,  and the database was published with a Creative Commons licence. They offered their own tool, **Bitcollider**, to make it easy to hash files, produce checksums and upload the Magnet URIs to their site. Just drag files onto Bitcollider and it would hash them and open up their site, Bitzi's **Bitpedia**, in your browser to paste & submit the metadata for the files. Things like file size, resolution, bitrate, as well as hashes / checksums. It would provide Magnets with Tiger Tree & SHA1 hashes as well as other hashes for several p2p filesharing systems, e.g. ed2k hashes for eDonkey 2000 & eMule.\n\nIn addition to submitting metadata & Magnets, visitors to the site could browse and search among existing metadata. When they found a file they were interested in, they could see a few details (file name, size, checksum etc) and if they wanted the file, they could just click on the Magnet URI, their preferred download program would open and it would (hopefully, depending on available sources) start downloading.\n\n(A hash or checksum is a way of uniquely identifying a computer file. The file is run through a mathematical process/formula (it is hashed) and results in a string of numbers and letters that is unique and which no other computer file can produce. That at least is the hope; some formulas are better, while others can produce the same checksum (called a \"collision\") for two different files if there are only small differences. Famous examples of good hashing methods are SHA1, Tiger Tree and MD5. A Magnet URI can contain one or more different hashes.)\n\n### The Demise of Bitpedia\n\nWhile I submitted many hashes there back when I was mostly using Kazaa Lite and eMule, unfortunately the site slowly died and finally closed in 2013 (by which time I'd sort of forgotten about it, as I was spending my filesharing time on dedicated p2p websites and indexers with fancy extra stuff like commenting, forums, screenshots etc... you know, exactly the kind of site that gets taken down by legal action & intimidation on a regular basis). \n\nThere must have been drawbacks compared to the likes of forums such as Sharereactor (for the ed2k & kad networks), FastTrack Central (for the FastTrack network of KaZaA, Grokster etc) and The Pirate Bay (for BitTorrent), but it's been so long (and the Wayback Machine doesn't replicate enough of the experience) that I can't remember. \n\nOne thing was that it wasn't very \"sticky\": it was transactional: submit or get a magnet and leave. No real sense of community or forums.\n\nBut I suspect the biggest reason was because (I believe, I'm not sure) BitTorrent became so dominant, and BT cares about more than just the file ID (unlike the other p2p systems common in the 00's) but also the tracker, folder contents & location etc, leading to \"fragmentation\". With BitTorrent you need a magnet of the **entire torrent**, not just a file on its own. (The torrent is the little file ending in *.torrent* that contains information about the file you really want to get.) A magnet for a torrent is data about data about data: so it's not metadata, it's meta-metadata. A file-only magnet (\"plain\", \"neutral\", \"universal\"), simple metadata, would work with KaZaA or eMule or others but wouldn't with BT. And magnets for .torrents of files would not work for other p2p apps and not work for other (e.g. private) trackers. Please correct me if I'm wrong.\n\n`META: Give example workflow of each.`\n`+++ A magnet of an avi. Pure and simple. Works with anything... except BitTorrent.`\n`+++ A magnet of a torrent of an avi (perhaps its folder, maybe an .nfo file in the same folder, and probably also the tracker for finding and connecting to peers with those files). Works with nothing except BitTorrent and the right tracker if you can access it (e.g. either it's public or it's a private one that you're a member of). Torrent magnets might place the tracker details directly into the magnet. E.g. !!!`\n\nBitpedia had to have a separate field from the regular \"universal\" file-only magnet for \"Torrent download\" and it was often empty. (And in theory, it would have had to have a different magnet link for every single instance of a torrent of that file, as every little difference in folder, tracker etc would mean a different .torrent file and thus a different checksum; the other p2p apps were satisfied with just one single universal file identifier.) Whereas other sites like The Pirate Bay, Suprnova etc were dedicated to BitTorrent and their .torrent files (and later magnets of .torrents) had all those extra details necessary for a successful bittorrent download. \n\nSo I think as other apps declined and BitTorrent rose, Bitpedia became useful to fewer and fewer people.\n\nInterestingly, unlike other sites with magnets of copyrighted material that shut down, I don't think any legal threats or action were behind the demise of Bitpedia. That may or may not be relevant to running a media database zite on ZeroNet.\n\n### Database, datadumps, new beginning on ZeroNet?\n\nBut Bitpedia did have loads and loads of \"universal\" file-only checksums & magnets. And apparently they offered full datadumps (download of their entire database).\n\nHere's one: https://old.datahub.io/dataset/bitzi\n\nAny new filesharing database needs to attract users, but users won't spend long on a media database that's practically empty: \"I can't find anything I want here. I'm leaving!\" And thus they won't stick around to make their own contributions to the database, leaving it empty. (A bit like ZeroTorrent ;) It's a bit of a chicken and egg situation. But a Bitzi Bitpedia datadump could be a handy way to populate/kick start a metadata database on ZeroNet.\n\n+ http://web.archive.org/web/20131209222254/http://bitzi.com/bitpedia/\n+ http://web.archive.org/web/20091211184946/http://bitzi.com:80/stat/bitprints_week_100\n+ http://web.archive.org/web/20080605233412/http://bitzi.com:80/stat/tag\n\n\n### Example\nI used the magnet from [this Bitpedia page on the Internet Archive](http://web.archive.org/web/20130913032141/http://bitzi.com:80/lookup/ADE2HDOI75PZB2NR6CVB7BEJJL4C37TW\n) and:\n+ Good news: The file *Transformers[2007]DvDrip[Eng]-aXXo.avi* started downloading almost immediately, so this data still works!\n+ Bad news: The file *Transformers[2007]DvDrip[Eng]-aXXo.avi* started downloading almost immediately, so... I'm getting a really crappy movie! :)\n\nHere's the [magnet](magnet:/?xt=urn:sha1:ADE2HDOI75PZB2NR6CVB7BEJJL4C37TW&xt=urn:kzhash:0641b44dd39435abdeaf3d079fe335aa4106a6d44f3a48aa7c84eae954db204333443956&xt=urn:tree:tiger:ULG2BHO3HFK4KVQQA5D42QBIRFU6CRPOFMNG6UY&xt=urn:ed2k:f921df1c57b2011f795f245c94ce70da&xl=943955968&dn=Transformers[2007]DvDrip[Eng]-aXXo.avi).\n\nHowever it should be noted it didn't work with uTorrent, which just gave an error \"Couldn't parse Magnet URI\". It did work with Shareaza, which found a source on its own G2 (Gnutella 2) p2p filesharing network. (also the magnets on the Magnet URI sourceforge page??)\n\n`META: find and compare with torrent and torrent magnet from torrent indexer for same file.`\n\n\n### Age of Metadata\nObviously a Bitpedia datadump won't have metadata for any media produced after 2013, or any new digital versions since then (e.g. another rip in a new codec or file format). But it would still have it for lots of stuff from before 2013 that people would stll be interested in. And don't forget: that older stuff might never be released in a newer format. So many things released on VHS never made it to DVD, and so many things on DVD have never made it to Blu Ray or streaming. So while someone looking for Transformers might not be happy finding a result in standard definition .avi, there are so many other files people will be looking for that they'll be glad to find any working result.\n\n**And perhaps the data dump could be run through a program that checks to see if a file still has sources on some tracker or p2p network or on ZeroNet. Any without sources could be excluded from upload to a new public ZeroNet database.** (PS the more I think about this, the more necessary it seems; people would get pissed off if 99% of the files in the database had no sources.)\n\n### Why not just scrape a torrent site?\nThat could be one useful option, especially if it's to populate a public-tracker-BitTorrent-exclusive database, like [ZeroTorrent](http://127.0.0.1:43110/ZeroTorrent.bit/). But the torrent magnets /checksums are magnets/checksums of torrents, not the files themselves (if I've understood correctly). You're not getting metadata about the files but about the .torrent for the files. So they wouldn't be useful for any form of filesharing other than BitTorrent, unlike the \"universal\" magnets and checksums of Bitpedia.\n\nFrom what I've read so far, ZeroNet distributes data based on BitTorrent but doesn't interact with & download from non-ZeroNet trackers. So a torrent-specific magnet / checksum wouldn't be able to get the file over ZeroNet, nor split/swarm the download from multiple sources across public torrent trackers and ZeroNet. Whereas Bitpedia's \"universal\" file-only checksums and magnets could be useful for getting files within ZeroNet, IPFS, `(I2P?), (ed2k?), (Kad?),` Gnutella, G2, `(DC++?)`, HTTP and so on and even systems not yet invented (I believe, I'm not technically expert on this.)\n* `(I believe there's an eMule mod specifically for I2P.)`\n* `(I believe eMule can't handle a magnet unless it specifically includes an ed2k hash because that's all the ed2k networkwas designed to transmit. Gnutella & G2, and probably others too, are satisfied with the magnet just having generic hashes like SHA1 and Tiger Tree.)`\n\nAlso, torrents are for Christmas, other networks are for life! :) What I mean is media files shared via BitTorrent (with their fragmentation across different .torrent files, trackers public and private etc) are often great for a short time but then reach a point of no seeds relatively soon.\n\nWhereas files through other filesharing systems can still be found years later, even if they are slower. Remember my example above: a six-year-old magnet for an 12-year old movie? No problem for non-BT. That's especially useful for rarer files. `((In fact I think the BT client BitComet tries to overcome .torrent demise with its own unique techniques.))` E.g. I tried to get a TV series  broadcast once and never released on DVD. Through BitTorrent, it was \"0 seeds\" only a few months after broadcast. Every tracker and site I could find. I even clicked the torrent magnets any way and let them run in my client for a few weeks: always 0 seeds, 0kb downloaded. Eventually I turned to eMule and got all the episodes there without fail. (Of course, it took ***months*** to get those rare files, but at least I got them.)\n\n### Something like Bitpedia & Bitcollider but for ZeroNet\nI think it could be great to have something like the Bitcollider combined with `(ZeroNet // ZeroNet plus IPFS?)`. Just drop a file onto the app, it hashes the file and it opens a submission window with a lot of key details already there (obviously checksum, size, name but also details like resolution, codec etc) and then click, you've submitted it to a ZeroNet database or filesharing hub. Easy!\n\nHey, Bitcollider was open source! I wonder how easy it would be to modify it for a working site/zite?\n\n`Could it be Metalinks links instead, combining regular P2P, ZeroNet, clearweb HTTP, IPFS etc?`\n\n## What do you think? Please comment.\n\nPS I wonder... if magnet URIs had been invented a year or two earlier, would we ever have had .torrent files? Or would BitTorrent have used magnets from the start and just download based on nothing more than the direct file-only metadata and we wouldn't have had this issue at all?"
		},
		{
			"post_id": 11,
			"title": "Interview with Rabble re Twitter, IndyMedia, Secure Scuttlebutt",
			"date_published": 1551734644.677,
			"body": "Here's a two-part interview with Evan Henshaw-Plath (a.k.a. Rabble, a.k.a. \"Twitter employee #1\") and who is now involved with the decentralized platform (/ZeroNet competitor?) [Secure Scuttlebutt](https://www.scuttlebutt.nz/).\n\nIt's from [*Steal This Show*](https://stealthisshow.com/), a podcast about P2P, decentralization, copyright issues etc, made by [Jamie King](), the director of [*Steal This Film*](https://en.wikipedia.org/wiki/Steal_This_Film) about The Pirate Bay. Steal This Show is released via filesharing news site [TorrentFreak](http://127.0.0.1:43110/1JNqdTGVATFWRLzzYwVu19CuWYus5VmoUS/)\n\n### Steal This Show - 2019-02-05 - Software will Eat the World, with @Rabble - Part 1\n<audio controls>\n    <source src=\"http://127.0.0.1:43110/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-02-05--software-eats-the-world-part-1-with-rabble.mp3\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio>\n+ [IFS page for this audio](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_item_1+type:audio) (click this if the embedded player doesn't work for you)\n+ [Clearnet source](https://stealthisshow.com/s04e11/)\n\n### Steal This Show - 2019-03-01 - Software will Eat the World, with @Rabble - Part 2\n<audio controls>\n    <source src=\"http://127.0.0.1:43110/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-03-01--software-eats-the-world-part-2-with-rabble.mp3\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio>\n+ [IFS page for this audio](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_item_2+type:audio) (click this if the embedded player doesn't work for you)\n+ [Clearnet source](https://stealthisshow.com/s04e12/)\n\n### Description:\n> a two-part interview with [@Rabble](https://about.me/rabble) (Evan Henshaw-Plath) — activist technologist, co-founder of [IndyMedia](https://en.wikipedia.org/wiki/Independent_Media_Center), and one of the originators of Twitter. We discuss the origins of Twitter in the protest organisation tool [TxtMob](https://en.wikipedia.org/wiki/TXTMob); Evan’s work developing Indymedia and the early days of tech’s interaction with activism; how social media is continuing to mutate politics, for better and worse; how the sorting algorithms developed by Big Social are becoming indelibly embedded in our world — and finally Evan introduces the subject of part two: Silicon Valley’s hidden mission to restructure the world’s institutions via software.\n\n---\nIt's a fascinating interview, offering firsthand insights into the odd mishmash of 1960s & 70s social and cultural values of northern California that are encoded in the DNA of Silicon Valley tech companies and which as a result shapes the lives of everyone around the world today affected by those platforms.\n\nIn part 2, they go more into decentralization and federation, what attracted Rabble to Secure Scuttlebutt, his finally getting getting involved in its development, and the challenges involved in making it scalable, sustainable (through enabling encryption of content that only paid subscribers can access) and tolerable (through federating and segregating: *we don't want to connect to neonazis, they don't want to connect to us, but we can both get on our with own thing among our own friends*).\n\nI am not a lefty (so parts of this were not easy listening for me), but Henshaw-Plath is clearly a clever and eloquent person with a lot of experience in these fields and a lot of interesting things to say on these topics. (The interviewer King does go on sometimes with his own less interesting thoughts.)\n\nMore on Henshaw-Plath: [Al Jazeera - Rebel Geeks - Steal from the Capitalists](https://www.aljazeera.com/programmes/rebelgeeks/2015/11/technology-steal-capitalists-151110150718814.html)\n\nLet me know in the comments what you think (and if the embedded audio worked for you)."
		},
		{
			"post_id": 10,
			"title": "Experimenting with uploads: audio",
			"date_published": 1551546967.455,
			"body": "Here I'm going to upload some audio files to [IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er) (the \"Intergalactic File Server\", a zite for uploading, storing, finding, and playing many kinds of files) and then try to embed them in this blog post here.\n\n## Part 1: Uploading to IFS\n\nIf you are new to IFS, it can be a little unclear how to upload stuff there. There is no nice, obvious \"Upload\" button like on other sites, e.g. video zite [KopyKate](http://127.0.0.1:43110/big.kopykate.bit/). (There is also no help or info on IFS about what the zite is or how to use it!) From an old ZeroTalk thread (IIRC), I found out you have to create a \"channel\" first, then upload to your channel.\n\n(Some of the info here may be incomplete because some time has passed between me first going to IFS, and me writing this post.)\n\n![IFS - ID menu](img\\IFS.my.menu.png)\n\n1. Go to [IFS](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er)\n2. Log in (choose your ID to use there, e.g. `klu9@zeroid.bit`)\n3. Click on your ID button top right and click \"My Channels\".\n4. Click the big plus sign to create a new channel. (You might have to choose a \"Cluster\" first, and \"Grant Merger\" with it. And no, I don't know what a \"cluster\" is. Maybe something like a hub on ZeroMe...?)\n5. Give your channel a name and description.\n6. On your channel page, click \"Upload\" (or drag files onto the upload area).\n7. You can set some details of the file (e.g. \"audio\", \"misc\")\nFiles will upload.\n(I notice no option at this point to describe the files.)\n8. Click on an uploaded file to view its individual page.\n\n![IFS - file page](img\\IFS.file.page.png)\n[Full size image](img\\IFS.file.page.png)\n\nHere are the IFS pages for the files I uploaded:\n+ [Steal This Show - 2019-02-05 - Software will Eat the World, with @Rabble - Part 1](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_item_1+type:audio)\n+ [Steal This Show - 2019-03-01 - Software will Eat the World, with @Rabble - Part 2](http://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:1Mz1_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_item_2+type:audio)\n\nOn a file's individual page on IFS, you can\n+ play the file on the page, in the embedded player at top\n+ see info about the file: name, number of peers, size, etc\n+ vote the file up or down\n+ delete the file (if you are the uploader, presumably)\n+ download the file\n+ see an \"Embed Code\" that can be copied (I will try using this in a moment)\n+ comment on the file\n\nAlso, just under the embedded player, it says \"Download finished!\" I guess this is because I have the whole file already on my computer.\n\nAs there is no option to provide a description of the file, I made a comment about it. I kept it short, because nowadays I'm wary of running out of space for things like comments on zites. (The IFS comment window doesn't indicate space used, so I opened the zite's side panel to see how much space is allowed to me for things like comments, but the \"IDENTITY ADDRESS\" section there said \"0KB/0KB\"... so I don't know what the limit is. Maybe unlimited?)\n\n## Part 2: Embedding the audio here on my blog\nIFS handily provides an \"Embed Code\" on a file's page, with a blue \"Copy\" button.\n\nI clicked the \"Copy\" button and pasted the code in my blog post.\n\nHere's what the code looks like:\n`merged-CDN/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-02-05--software-eats-the-world-part-1-with-rabble.mp3`\n\nAnd now for the embed (fingers crossed!) **Damn!** Pasting that code does **not** embed the audio on my blog, it just puts it as plain text on the page. (I thought it looked a little \"bare\"; it's just an URL rather than code.) I guess it needs some HTML around it. I first thought of tweaking the HTML code I used for video in [my post about embedding video](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/?Post:8:Experimenting+with+uploads:+video), but I DuckDuckGoed (DuckDuckWent?) \"html embed audio code\" and found this page [W3schools - HTML5 Audio](https://www.w3schools.com/html/html5_audio.asp) which gives the following example code:\n`<audio controls>`\n  `<source src=\"horse.ogg\" type=\"audio/ogg\">`\n  `<source src=\"horse.mp3\" type=\"audio/mpeg\">`\n`Your browser does not support the audio element.`\n`</audio>`\n\nAs the files are .mp3's, I'll get rid of the line about .ogg format, and change the \"horse.mp3\" part to the embed code from IFS for my file, which looks like this:\n`<audio controls>`\n    `<source src=\"merged-CDN/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-02-05--software-eats-the-world-part-1-with-rabble.mp3\" type=\"audio/mpeg\">`\n`Your browser does not support the audio element.`\n`</audio>`\n\nEdit: That didn't work either. The audio players were displayed, but the Play button was greyed out. SSDifnskdjfnsdjk analyzed what was going on in the web page (pressing `F12` in the browser) and saw that the final URL produced was too long. It seems changing `merged-CDN` to `http://127.0.0.1:43110` might work.\n\nSo the code now is:\n`<audio controls>`\n`    <source src=\"http://127.0.0.1:43110/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-02-05--software-eats-the-world-part-1-with-rabble.mp3\" type=\"audio/mpeg\">`\n`Your browser does not support the audio element.`\n`</audio>`\n\nAnd now for the embed, attempt #3!\n\n**Steal This Show - 2019-02-05 - Software will Eat the World, with @Rabble - Part 1**\n<audio controls>\n    <source src=\"http://127.0.0.1:43110/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-02-05--software-eats-the-world-part-1-with-rabble.mp3\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio>\n\n**Steal This Show - 2019-03-01 - Software will Eat the World, with @Rabble - Part 2**\n<audio controls>\n    <source src=\"http://127.0.0.1:43110/1MzV32sv55VSD5Vr7u3mcMPsX2oG9PHusr/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/Steal-This-Show--2019-03-01--software-eats-the-world-part-2-with-rabble.mp3\" type=\"audio/mpeg\">\nYour browser does not support the audio element.\n</audio>\n\nHopefully you can see the embedded audio players and use them to play the mp3's! It's possible you might have to \"Grant merger\" with IFS for the audio to load. Please let me know what happens for you in the comments.\n\n(I wish IFS would give the **full** code with **full working** URL to embed the file. It would have saved a lot of trouble.)"
		},
		{
			"post_id": 9,
			"title": "Quick test with Apertium offline translator",
			"date_published": 1551387164.764,
			"body": "On ZeroTalk, I've been participating in the topic [Is there a program for Linux that will translate language that will run on your computer without going to the cloud to do it?](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1548909076_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE) Basically it's about offline machine translation, as online tools like Google Translate are a serious privacy concern. (See that thread and [this video](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1549142235) for more.) And about trying to find an option that is preferably open source and that can run on Linux.\n\nI decided to give one option a quick try: [Apertium Simpleton UI](http://wiki.apertium.org/wiki/Apertium_Simpleton_UI) (henceforth \"ASUI\"), a simple GUI version of the [Apertium](https://en.wikipedia.org/wiki/Apertium) machine translation engine, available for several OSes.\n\n---\n## Installing\n+ I downloaded and extracted the version for my OS. (I'm on Windows for now so I went with the Windows file.)\n+ I ran it, and the built-in package installer opens.\n+ I clicked \"Install\" for \"Required Core Tools\".\n\nIt started downloading, and completed I think.\nBut the Package Installer list still showed a clickable \"Install\" button next to \"Required Core Tools\". So, thinking maybe all it had done was download and I still needed to do something to actually make it install, I clicked the button again.\n\nBut it started downloading all over again. I clicked \"Cancel\", which worked... for a second and then the download started again. I tried \"Cancel\" a few more times, and always the download would restart after a second. So I just let it download again.\n\nAnd still the Package list is the same as before, with the clickable \"Install\" button. Oh well, let's just proceed anyway. (But really there should be some change once the file has installed, like removing the item or making the button unclickable, or just changing \"Install\" to \"Installed\".) (EDIT: I noticed that the next time I opened the Package Installer, the buttons for items that I had already installed were now relabelled \"Reinstall\".)\n\n![Apertium Simpleton package installer](img/Apertium-Simpleton-package-installer.png)\n[Apertium Simpleton package installer - full size image](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/Apertium-Simpleton-package-installer.png)\n\n---\n## Languages\nThe next step was to choose and install language packs, which are made for specific language pairings. The package list only gives two- or three-letter codes for the languages, so I made sure I had this webpage open: [Apertium Wiki - List of language pairs](http://wiki.apertium.org/wiki/List_of_language_pairs), which explains the codes.\n\nI already knew from a little reading & online practice that Apertium is funded by Spanish government bodies, and that Spanish or Catalan is often used as a bridge language (i.e. an intermediate language to go through, a workaround when the software doesn't have packages to translate directly between two specific languages).\n\nSo for those reasons, and because I'm familiar with this language pairing for verification purposes (i.e. I can check if the translation is any good), I downloaded the `apertium en-es` package for English and Spanish.\n\n(By the way, the app, the core files and the language pack were all a lot smaller than I expected. The Apertium folder was just under 25MB. The language pack downloads were just a couple of megabytes each. They are unpacked and stored elsewhere. In Windows, it was in `C:\\Users\\klu9\\AppData\\Roaming\\Tino Didriksen Consult\\Apertium Simpleton` and subfolders, which took up 114MB.)\n\nI closed the package installer and looked at the main program. There was now an \"eng-spa\" displayed at the top left, with a \"Run\" button next to it.\n\n---\n## Translating\nIn ASUI's top window, I typed\n> Hello World\n\nand clicked \"Run\".\nAfter a second or two, the bottom box displayed\n> *Hola Mundo*\n\nSuccess! At least, success with an extremely tiny basic sample.\n\n![Apertium Simpleton - Hello World](img\\Apertium.en.es.hola.mundo.png)\n\nSo next sample:\n> Let's try a longer sentence.\n\nAfter a couple of seconds, the bottom box showed:\n> *Dejado es probar una frase más larga.*\n\nOh dear. The last part is alright: \"*una frase más larga*\" does mean \"a longer sentence\".\n\nBut the first half is gibberish.\n1. {`\"Let's\" + basic verb form`} is the way that the English language creates a first-person-plural imperative.\nBut \"*Dejado*\" is the past participle of the verb \"*dejar*\", with, yes, the sense of \"let\", \"allow\" but also \"leave\", \"abandon\", \"give up\". And it is *never* used in Spanish to make a a first-person-plural imperative the way \"Let's\" is used in English.\nSo what Apertium has given here is something sort of with the meaning \"Given up\" or \"[is] allowed/ [is]left / [is] abandoned\".\n2. {`´s`}is a contraction in English. Here it's a contraction of \"Let ***us***\" (remember, we're making a first-person plural imperative, hence \"us\".) But Apertium has apparently interpreted it as a contraction for \"is\" (third person singular form of the verb \"be\") and has given us \"*es*\" (third person singular form of the verb \"*ser*\")\n3. `probar` is the infinitive form of a verb that can have the meaning \"to try\". So the meaning is OK, but the grammar is wrong.\n\nSo all together, \"*Dejado es probar una frase más larga*\" sort of gives us \"Given up is to try a longer sentence.\"\n\nA better translation would be like:\n> *Probemos una frase más larga.*\n\nI'm very disappointed. \"Let's (verb)\" is very basic stuff, the kind of thing that people learn in their first few months of English as Second Language classes. Moreover, I'm going from English, a well-known, major language that's official for both the EU and the UN, to Spanish, which is not only another well-known language major language that's official for both the EU and the UN but also one relevant to the Apertium makers themselves. And yet Apertium has thrown a complete wobbly over something so simple. It's given me the kind of thing that gets posted on social media for a laugh. Why has no one at Apertium caught this before now? This does not bode well.\n\nTo confirm whether or not this is limited to just ASUI, I try the online instance of Apertium at https://apertiumtrad.tuxfamily.org/tradtexte.php , and (once I ticked \"Direct translation\") it produced the exact same result. :(\n\nI try a few more sentences, ones from this article.\n> I'm very disappointed.\n\n> *Soy muy decepcionado.*\n\nSpanish has two verbs, *ser* and *estar*, that can both be translations of the English verb \"be\". *Soy* is the first person-singular of *ser*. But to describe an emotional state, the verb *estar* should be used. So it should really be *Estoy muy decepcionado*.\n\n> This does not bode well.\n\n> `Esto  no *bode bien.`\n\nApparently, prefixing with an asterisk `*` is Apertium's way of saying it doesn't know the word and has just left it in the original language.\n\nAt this point I notice: there's no \"Back\" or history function in Apertium Simpleton UI, so when I want to find previous translations, I can't and have to run them all over again. A small point, but an issue nonetheless.\n\n> I try a few more sentences, ones from this article.\n\n> *Pruebo unos cuantos más frases, unos de esta prenda.*\n\nThat's not ***too*** bad... until the last word. \"Article\" is a word that can have several meanings, and that's the kind of thing that can throw even human translators, and can only be determined by context. It's an area where advanced machine translation like Google Translate has been getting *much* better over the years. In this case, I meant \"article\" in the sense of a piece of published writing (which would be *artículo* in Spanish), but Apertium has translated it in the sense of an article/item of clothing, hence \"*prenda*\".\n\nOne small issue is that, in the English original \"ones\" refers back to \"sentences\". So in the Spanish translation, it should be \"*unas*\" (feminine plural) both times, to match \"*frases*\" (feminine plural).\n\nAlso it's more natural in Spanish to put \"*más*\" after \"*frases*\". But you would still be understood (at least up until it throws out \"*prenda*\".)\n\nSo this tells me that when the meaning is ambiguous, \n1. It does not offer options (like a CAT would). It just picks one.\n2. It can pick the wrong one. And if the user doesn't know the languages involved, they would not even know it.\n3. Less importantly, it's not good at matching grammar of words in different places of the sentence (e.g. feminine plural article to match feminine plural noun).\n\nBy now, I've noticed that Apertium Simpleton GUI has no option for translating through a bridge language.\n\nOn https://apertiumtrad.tuxfamily.org/tradtexte.php for example, there is no direct translation between English and French, but it can use Spanish as a bridge language to go from English to Spanish and finally to French.\n\nBut good news! Apertium Simpleton UI doesn't just access the \"Validated\" class of language pairings (listed under \"Trunk\" on [Apertium Wiki - List of language pairs](http://wiki.apertium.org/wiki/List_of_language_pairs)) that the website uses, but also the other less mature classes of language pairs, listed under \"Staging\", \"Nursery\" and \"Incubator\". And so the Apertium Simpleton package installer offers `apertium en-fr` as an option. Let's try that!\n\nAfter using the package installer to download the English-French package, the ASUI top left button now shows `en-fr` by default, and the dropdown menu now shows a range of option for both French & English, and the previously installed Spanish & English pairings.\n\n> I try a few more sentences, ones from this article.\n\nAfter a few seconds:\n> *Je tente @a few @more phrases, #un de #ce article.*\n\n![Apertium Simpleton - English to French](img\\Apertium.en.fr.menu.png)\n\nOh boy. I guess the `@` prefix means it hasn't even tried to translate the word (although why en-fr uses `@` but eng-spa uses `*`, I don't know). And we're not talking difficult, obscure words, just \" a few more\".\n\nThe `#`... I don't know. Maybe at a guess it means that the word gender & number is variable depending upon context. (Masculine *un* (singular) / *uns* plural, feminine *une* (sing.) / *unes* plural). I can understand why it does that. But it should know the right form of \"*ce*\" to match the French word *article* rather than consider it an uncertainty.\n\nThere is no built-in explanation of symbols or help file in Apertium Simpleton UI. The \"File\" menu contains only one option: \"Exit\".\n\n## Comparison with online translators\nBefore concluding, let's check what's produced by online translators.\n\nKey:\n+ ASUI= Apertium Simpleton UI.\n+ ATF = [Apertium online at Tuxfamily.org](https://apertiumtrad.tuxfamily.org/tradtexte.php).\n+ GT = Google Translate.\n+ PNMT = [Pure Neural Machine Translation demo from Systran](https://demo-pnmt.systran.net/production#/translation).\n+ (+) = good\n+ (X) = bad\n+ (/) = so-so\n\n### English to Spanish\n+ **English: Hello World**\n+ ASUI: Hola Mundo (+) \n+ ATF: Hola Mundo (+) \n+ GT: Hola Mundo (+) \n+ PNMT: Hola World (X)\n\n---\n+ **English: Let's try a longer sentence.**\n+ ASUI: Dejado es probar una frase más larga. (X)\n+ ATF: Dejado es probar una frase más larga. (X)\n+ GT: Probemos una oración más larga. (+) \n+ PNMT: Intentemos una sentencia más larga. (+) \n\nRe GT: \"*oración*\" is a valid alternative to \"*frase*\".\nRe PNMT: The verb *intentar* is another way to say \"to try\", so \"*Intentemos*\" is a valid alternative here.\n\n---\n+ **English: I'm very disappointed.**\n+ ASUI: Soy muy decepcionado. (/)\n+ ATF: Soy muy decepcionado. (/)\n+ GT: Estoy muy decepcionado. (+)\n+ PNMT: Estoy muy decepcionado por eso. (\"I'm very disappointed by that.\" Why PNMT has added \"by that\", I've no idea.) (/)\n\n---\n+ **English: This does not bode well.**\n+ ASUI: Esto no *bode bien. (X)\n+ ATF: Esto no *bode bien. (X)\n+ GT: Esto no augura nada bueno. (+)\n+ PNMT: Esto no es un buen augurio. (+)\n\nBoth GT and PNMT have gone for options that do not exactly parallel word-for-word the structure of what I wrote (subject + negative verb + adverb) but are good ways of expressing what I meant.\n\n---\n+ **English: I try a few more sentences, ones from this article.**\n+ ASUI: Pruebo unos cuantos más frases, unos de esta prenda. (X)\n+ ATF: Pruebo unos cuantos más frases, unos de esta prenda. (X)\n+ GT: Intento unas cuantas oraciones más, las de este artículo. (/)\n+ PNMT: Intento algunas frases más, algunas de este artículo. (+)\n\nRe GT: \"*las*\" for \"ones\" in the final clause to me implies *all* the sentences in the article, not just some. It's more like \"the ones\", not just \"ones\".\nRe PNMT: it's gone for \"*algunas*\" in both clauses, a valid option.\nBoth GT & PNMT went for \"*Intento*\", a valid alternative to \"*Pruebo*\".\n\n### English to French\n\n+ **English: I try a few more sentences, ones from this article.**\n+ ASUI: Je tente @a few @more phrases, #un de #ce article. (X)\n+ ATF: J'essaie quelques *cuantos plus phrases, uns de cette pièce. (X)\n+ GT: J'essaie quelques phrases supplémentaires, celles de cet article. (+)\n+ PNMT: J'essaie quelques phrases, celles de cet article. (/)\n\nRe ATF: ATF allows using a bridge language, and I selected Spanish to get from English to French, which is how we ended up with \"**cuantos*\" in there. The rest of it seems fine though, with \"*cette pièce*\" as a valid way of translating \"this article\" is the sense of a piece of writing. Although the final clause's \"*uns*\" (masculine plural) should probably be \"*unes*\" (feminine plural) to match the gender of \"*phrases*\".\nRe PNMT: I see nothing to give the idea of \"more\".\nMy dictionary says both verbs \"*essayer*\" and \"*tenter*\" can be used for \"to try\".\n\n\n\n## Conclusion\nWell, this has been just a very quick test of Apertium Simpleton UI as an alterntive to Google Translate. Here's a summary.\n\n**The good points**\n+ Offline and private\n+ Free-libre / open source\n+ Free-gratis (both the app and the language packs)\n+ Multi-platform (Windows, Linux, Mac)\n+ Built-in package manager for language packs\n+ Quick and easy to install the app and the language packs\n+ Easy to use\n+ Relatively small (App 25MB. Two language packs: only about 4MB to download, about 114MB when unpacked)\n+ Light (using only 15MB of RAM)\n\n**The major bad points**\n+ Very limited choice of validated language pairings (e.g. not even English-French).\n+ The quality of translation for the validated language pairings (e.g. English-Spanish) ranges from \"just about acceptable\" to \"absolutely awful\".\n+ The quality of translation for the unvalidated language pairings (e.g. English-French) is even worse, with many words not even translated.\n+ Doesn't even allow the option to use a bridge language (e.g. English to Spanish to French), to try to get better results for unvalidated language pairings.\n\n**The minor bad points**\n+ Many of the language packs are updated infrequently\n+ No built-in help or info\n+ Only uses two- or three- letter codes to indicate languages\n+ No history or back function\n+ No automatic detection of input language\n+ No immediate update in package installer to show a package has been successfully installed\n+ Can take a few seconds after pressing \"Run\" to translate sentences (whereas Google Translate is instantaneous, not even a click required).\n\nOverall, ASUI is ***not*** yet a replacement for a good quality online machine translation service like Google Translate. The *minor* bad points I can overlook, but the *major* bad points are showstoppers, for me at least.\n\nSo I guess we need to keep looking. If you know of, or find, another option for offline, free-libre, multi-platform translation, please let us know in the comments or the [ZeroTalk thread](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1548909076_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE)."
		},
		{
			"post_id": 8,
			"title": "Experimenting with uploads: video",
			"date_published": 1551296769.124,
			"body": "So now I'm going to upload video to Zeronet and hopefully embed it in my blog.\n\n<video src=\"http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551122501-How.to.Disappear.Completely--Lilly.Ryan--Linux.Conf.Au.2019.mp4\" controls=\"\" width=\"600\" height=\"400\"></video>\n\nSource (click this link if you can't see the video here): [How.to.Disappear.Completely--Lilly.Ryan--Linux.Conf.Au.2019.mp4](http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/?Video=1551122501_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs)\n\n## Part 1 - Getting a video\nI saw a video on YouTube I wanted, but also knew YouTube likes to block downloading of videos.\nAt first I tried a download manager I already have installed, [uGet](https://ugetdm.com/). But:\n+ the download speed was capped at 30kbps\n+ it was getting the video in 360p, even though higher resolutions were available.\n\nI remembered a tool I'd heard of over the years, called [youtube-dl](https://github.com/rg3/youtube-dl). It's a command line tool, and I prefer GUI programs, but I thought I'd give it a try anyway.\n\n1. I got youtube-dl.exe (for Windows) from https://github.com/rg3/youtube-dl\n2. I watched [this short video tutorial](http://127.0.0.1:43110/big.kopykate.bit/?Video=1551131515_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs) for a quick idea of how to use it.\n3. I downloaded the video by writing the following in the CMD window:\n`youtube-dl.exe \"https://www.youtube.com/watch?v=LOulCAz4S0M\"`\nThat got me the video in 720p.\n(In Linux, you don't even need the `.exe`or the quotes around the URL, apparently.)\n\n---\n+ There's also a GUI tool based on youtube-dl, called [youtube-dl GUI](https://github.com/MrS0m30n3/youtube-dl-gui), which I also used for subsequent downloads. See this [ZeroMe post with a little more on youtube-dl and youtube-dl GUI](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551139681) including video tutorials.\n+ @deliriumgoddess: mentioned a simple online tool to grab individual videos off YouTube and other sites: [Savefrom.net](https://en.savefrom.net/)\n\n## Part 2 - Uploading the video\n1. I moved the file to another folder and renamed it, so that the name was more informative and to eliminate spaces, which can complicate linking.\n2. I went to 0net's equivalent of YouTube, [KopyKate](http://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh), and clicked the Upload icon at top right of the page.\n3. I gave the video a title and description.\n4. I saw there was the option to upload a thumbnail. I took a screenshot and tried uploading. I got the following error message:\n> Max image size: 25kb (Tip: use GIMP or online compression tools to reduce resolution/quality!)\n5. In an image editor, I made adjustments to the original screenshot (572kb png), cropped and compressed until it became a 24.8kb jpg. (I probably should have just resized the image, as it's going to be a thumbnail.)\n6. I clicked \"Publish\".\n> Content published to 5 peers\n7. I turned off BitTorrent, so that all my (rather limited) upload bandwidth was dedicated to Zeronet and seeding the video.\n\n## Part 3 - Posting the video\nThe video was already on KopyKate, visible in the \"Airing Now\" section (which displays the latest uploads). But I wanted to post it elsewhere.\n\n1. I made [a post about the video on ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551124392), giving the URL for the KopyKate page (as videos cannot be embedded in ZeroMe posts). Here's the [markdown](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:markdown) I put in my ZeroMe post:\n`[How to disappear completely](http://127.0.0.1:43110/big.kopykate.bit/?Video=1551122501_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs)`\nThis ZeroMe post quickly informed people about the video, drawing viewers and thus peers who can seed the video to other people, so that I (with my crappy bandwidth) wouldn't be the only source for too long. After 2 days, it's already got 10 peers.\n2. To embed it here on my blog, I created a new post and, after trying something else, put this html:\n`<video src=\"http://127.0.0.1:43110/big.kopykate.bit/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551122501-How.to.Disappear.Completely--Lilly.Ryan--Linux.Conf.Au.2019.mp4\" controls=\"\" width=\"600\" height=\"400\"></video>`\nAnd here it is without the URL for my video (to ease copying and pasting). Put the URL for your video between the quotes after **video src=**.\n`<video src=\"\" controls=\"\" width=\"600\" height=\"400\"></video>`\n\n---\nI originally tried the following markdown **which did not work**:\n`![How to Disappear Completely - a talk about facial recognition and how to beat it](http://127.0.0.1:43110/big.kopykate.bit/data/users/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551122501-How.to.Disappear.Completely--Lilly.Ryan--Linux.Conf.Au.2019.mp4)`\n\nIn a [ZeroTalk topic about this](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1551299295_131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs) @kai0: recommended using the HTML code, and that worked!\n\n@gluek: & @toyata: brought up an important point. Because of the way that Zeronet works, if a visitor to my blog has never visited KopyKate before, a KopyKate-hosted video will not load for them here on my blog. So it's probably a good idea to always provide a direct link for any embedded video hosted on another zite.\n\nOriginally, I used all the code @kai0: gave, but @SSDifnskdjfnsdjk: pointed out that the video auto-played when loading my blog (I hate that, but didn't realize because I have an extension to prevent that). So I cut out `autoplay=\"\"`.\n\n@gluek: mentioned some techniques to host a video on my own zite (not KopyKate) involving [optional files](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:optional-files) which @ssdifnskdjfnsdjk: goes into more here: [ZeroTalk - How to create static site with big streamable videos](http://127.0.0.1:43110/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/?Topic:1545035786_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS)\n\nBut that's an experiment for another day. Right now, I'm just glad I can embed a KopyKate video in my blog post.\n\nThanks to everyone who gave feedback and advice, here, on ZeroTalk and [ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1551374324).\n\n\n"
		},
		{
			"post_id": 6,
			"title": "Big comparison of secure / anonymous / decentralized / private communication systems",
			"date_published": 1550278861.696,
			"body": "The folks behind [**secushare**](https://secushare.org/introduction), a [GNU Project](https://en.wikipedia.org/wiki/GNU_Project) to make a secure, private communications and filesharing system, have over the years written up a big comparison of various programs, networks, protocols and more with a focus on security, privacy, anonymity, decentralization etc. It is a very long but fascinating read (that even I, as a non-developer, was able to mostly understand. Mostly.)\n\n+ Original Link: \n[**secushare.org - Capability Comparison**](https://secushare.org/comparison)\n+ My mirror here on ZeroNet: [Capability Comparison](data\\SecushareComparison\\Capability Comparison.htm)\t\n\nIt's organized into sections around the following uses:\n+ Social Networking\n+ File Exchange\n+ Instant Messaging\n+ Asynchronous Messaging (E-Mail)\n+ Telephony and Video Conferencing\n+ Chatroom Idling\n\nIt covers areas like:\n+ https://en.wikipedia.org/wiki/Secure_communication\n+ https://en.wikipedia.org/wiki/Anonymous_P2P\n+ https://en.wikipedia.org/wiki/Anonymous_blog\n+ https://en.wikipedia.org/wiki/Private_peer-to-peer\n+ https://en.wikipedia.org/wiki/Friend-to-friend\n\nIt gives their definitions of key terms like:\n+ [centralized](https://secushare.org/centralization)\n+ decentralized\n+ distributed\n+ [federated](https://secushare.org/federation)\n\nIt assesses these systems on the above and on issues like security, privacy, and scalability, and at the end of each section offers a \"BEST CURRENT PRACTICE RECOMMENDATION\".\n\nJust a few of those mentioned in the comparison that might be of interest to ZeroNet users: **cjdns, I2P & I2PBote, RetroShare, BitMessage, Matrix/Riot, Secure Scuttlebutt, Telegram, Tribler, Wire**. But no mention of ZeroNet :/\n\nAnd it is very, **very** opinionated :) While some are praised, and some mentioned only in passing, most come in for criticism: lots of scathing criticism! Who knew darknets could be so bitchy! Maybe it's a good thing they don't discuss ZeroNet :)\n\nWhile the comparison is very informative, it mentions **so** many things but offers only a few links with more info. I know about or have heard of a lot of them, but also a lot were new to me. So I'm putting here a big list with links for most of these systems, protocols, programs, principles, and vulnerabilities. You can use it to find out more as you read the comparison or just scan the list so as understand what they're talking about... or to see if your favourite is in the comparison and brace yourself for the drubbing they give it. (There's a lot more interesting stuff on the [secushare website](https://secushare.org/).)\n\nMost links go to clearnet Wikipedia.\n\n---\n### Issues, principles, vulnerabilities, threats\n+ [deniability](https://en.wikipedia.org/wiki/Plausible_deniability#Use_in_computer_networks)\n+ [distributed hash table (DHT)](https://en.wikipedia.org/wiki/Distributed_hash_table)\n+ [end-to-end encryption (E2EE)](https://en.wikipedia.org/wiki/End-to-end_encryption)\n+ group encryption\n+ [Five Eyes](https://en.wikipedia.org/wiki/Five_Eyes) - cooperation among intelligence agencies to spy on each other's residents\n+ [forward secrecy](https://en.wikipedia.org/wiki/Forward_secrecy)\n+ link/URL encryption (other people seeing the URLS you visit is a key identity-revealing vulnerability as seen in [this DEFCON video](http://127.0.0.1:43110/peeper.bit/?Post/1AbRRDveQD5EFtmXxBqQfS1guUWXxytMJZ/131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs/1549142235))\n+ [Logjam attack](https://en.wikipedia.org/wiki/Logjam_(computer_security%29)\n+ [Man-in-the-middle attack](https://en.wikipedia.org/wiki/Man-in-the-middle_attack)\n+ [metadata protection](https://en.wikipedia.org/wiki/Metadata#Telecommunications)\n+ [moderating forums](https://en.wikipedia.org/wiki/Internet_forum#Moderators)\n+ [multicasting](https://en.wikipedia.org/wiki/Multicast)\n+ [PRISM](https://en.wikipedia.org/wiki/PRISM_(surveillance_program%29) - US surveillance of internet traffic\n+ [PubSub](https://secushare.org/pubsub) - system for multicasting\n+ relays\n+ [Sybil attack](https://en.wikipedia.org/wiki/Sybil_attack)\n+ Unobservability\n+ [Untraceability](https://en.wikipedia.org/wiki/Digital_footprint)\n\n---\n### Programs, networks, protocols, services, companies etc\nMost in the list have some focus on privacy, security, anonymity, decentralization etc, and most are open source. (I've italicized a few that might be of special relevance to: me or ZeroNet users or this comparison from secushare.)\n+ [Adobe Flash](https://en.wikipedia.org/wiki/Adobe_Flash)'s RTMP and RTMFP protocols\n+ [*BitMessage*](https://en.wikipedia.org/wiki/Bitmessage) - e-mail alternative\n+ [*BitTorrent*](https://en.wikipedia.org/wiki/BitTorrent) - filesharing protocol\n+ [Briar](https://en.wikipedia.org/wiki/Briar_(software%29) - mobile instant messaging\n+ [Bubcon](https://play.google.com/store/apps/details?id=com.bubcon.messenger&hl=en_US) - mobile instant messaging\n+ [Buddycloud](http://buddycloud.com/) - instant messaging\n+ [ChatSecure](https://en.wikipedia.org/wiki/ChatSecure) + [Orbot](https://en.wikipedia.org/wiki/Orbot) - mobile instant messaging over Tor\n+ [*cjdns*](https://github.com/cjdelisle/cjdns/) - alternative to DNS system, which is where a lot of censorship/blocking happens\n+ [crypto.cat](https://en.wikipedia.org/wiki/Cryptocat) - instant messaging\n+ [Diaspora*](https://en.wikipedia.org/wiki/Diaspora_(social_network%29) - social network\n+ [DSNP](https://en.wikipedia.org/wiki/Distributed_Social_Networking_Protocol) - social network\n+ The [EFF](https://en.wikipedia.org/wiki/Electronic_Frontier_Foundation) and its [secure messaging scorecard](https://www.eff.org/deeplinks/2018/03/secure-messaging-more-secure-mess)\n+ Facebook\n+ [*F-Droid*](https://en.wikipedia.org/wiki/F-Droid) - open source Android app store\n+ [*Freenet*](https://en.wikipedia.org/wiki/Freenet) - P2P network\n+ [Friendica](https://en.wikipedia.org/wiki/Friendica) - social network\n+ [*GNUnet*](https://en.wikipedia.org/wiki/GNUnet) - P2P protocol\n+ [Google Allo](https://en.wikipedia.org/wiki/Google_Allo) - mobile instant messaging\n+ [Google Hangouts](https://en.wikipedia.org/wiki/Google_Hangouts) - communications platform\n+ [Human Connection](https://human-connection.org/) - social network\n+ [*I2P*](https://en.wikipedia.org/wiki/I2P) - network\n+ [I2PBote](https://en.wikipedia.org/wiki/I2P#Email) - e-mail alternative using I2P\n+ [*IRC*](https://en.wikipedia.org/wiki/IRC) - chat protocol\n+ [Jingle](https://en.wikipedia.org/wiki/Jingle_(protocol%29) - voice protocol\n+ [Jitsi](https://en.wikipedia.org/wiki/Jitsi) - IM, voice, video calls\n+ [Maidsafe/SAFE Network](https://safenetwork.tech/) - P2P web with cryptocurrency\n+ [Manyverse](https://www.manyver.se/) - mobile social network on Secure Scuttlebutt\n+ [*Matrix*](https://en.wikipedia.org/wiki/Matrix_(protocol%29) (cross-network communications) & [*Riot.im*](https://en.wikipedia.org/wiki/Riot.im) (chat & filesharing on Matrix)\n+ [Moxie Marlinspike](https://en.wikipedia.org/wiki/Moxie_Marlinspike) - developer of the Signal protocol used by Signal, WhatsApp etc\n+ [Movim](https://movim.eu/) - social network over XMPP\n+ [Mumble](https://en.wikipedia.org/wiki/Mumble_(software%29) - voice\n+ [Nightweb](https://sekao.net/nightweb/) - discontinued, social blogging over I2P and BitTorrent\n+ [OMEMO](https://en.wikipedia.org/wiki/OMEMO) - encryption extension for XMPP\n+ [Onionshare](https://onionshare.org/) - filesharing\n+ [OTR](https://en.wikipedia.org/wiki/Off-the-Record_Messaging) - encryption extension for XMPP\n+ [OwnCloud](https://en.wikipedia.org/wiki/OwnCloud) - Filesharing / hosting\n+ [PGP](https://en.wikipedia.org/wiki/Pretty_Good_Privacy) - e-mail encryption\n+ [Pond](https://github.com/agl/pond) - [e-mail alternative over Tor](https://medium.com/@undercomm/secure-communication-pond-4985bfe85a2c)\n+ [*PSYC*](https://about.psyc.eu/) and its social network [*psyced*](https://about.psyc.eu/psyced) - chat, IRC alternative. Apparently PSYC clients can connect to PSYC, IRC and XMPP all at the same time. (I think some of the people involved in PSYC are also involved in secushare.)\n+ [*RetroShare*](https://en.wikipedia.org/wiki/RetroShare) - P2P communications & filesharing with friends only\n+ [Ricochet](https://en.wikipedia.org/wiki/Ricochet_(software%29) - instant messaging\n+ [*Secure Scuttlebutt*](https://www.scuttlebutt.nz/) - decentralized network\n+ [*secushare*](https://secushare.org/) - future program for filesharing & communication\n+ [*Signal*](https://en.wikipedia.org/wiki/Signal_(software%29) - mobile communications\n+ [SILC](https://en.wikipedia.org/wiki/SILC_(protocol%29) - conferencing, IRC-like protocol\n+ [SilentPhone](https://en.wikipedia.org/wiki/Silent_Circle_(software%29) - mobile voice & messaging for business subscribers\n+ [Skype](https://en.wikipedia.org/wiki/Skype) - voice, video, instant messaging\n+ [Snapchat](https://en.wikipedia.org/wiki/Snapchat) - mobile messaging\n+ [SocialVPN](http://ipop-project.org/learn/#socialvpn) - network connection with friends, based on XMPP and [IPOP](http://ipop-project.org/about/)\n+ [SureSpot](https://en.wikipedia.org/wiki/Surespot) - mobile instant messaging\n+ [*Telegram*](https://en.wikipedia.org/wiki/Telegram_(service%29) - mobile instant messaging and voice\n+ [Threema](https://en.wikipedia.org/wiki/Threema) - mobile instant messaging and voice\n+ [*Tor*](https://en.wikipedia.org/wiki/Tor_(anonymity_network%29) - network\n+ [Tox](https://en.wikipedia.org/wiki/Tox_(protocol%29) - instant messaging protocol\n+ [*Tribler*](https://en.wikipedia.org/wiki/Tribler) - BitTorrent filesharing with decentralized search\n+ [*Twister*](https://en.wikipedia.org/wiki/Twister_(software%29) - a microblogging platform... that is peer-to-peer, uses Bitcoin blockchain for ID and BitTorrent for distribution. Now what does that remind me of...? ;)\n+ [WebRTC](https://en.wikipedia.org/wiki/WebRTC) - audio & video conferencing protocol\n+ [WhatsApp](https://en.wikipedia.org/wiki/WhatsApp) - mobile instant messaging and voice\n+ [*Wire*](https://en.wikipedia.org/wiki/Wire_(software%29) - mobile instant messaging and voice\n+ [*XMPP*](https://en.wikipedia.org/wiki/XMPP) - protocol for messaging"
		},
		{
			"post_id": 5,
			"title": "New blog post",
			"date_published": 1549928183.87,
			"body": "Blog post body"
		},
		{
			"post_id": 4,
			"title": "Experimenting with uploads: images",
			"date_published": 1546445857.658,
			"body": "Let me try including an image in a post.\n\n![Screenshot of Common ZeroBlog](img\\common zeroblog screenshot 2019-1-2.png)\n[Full size 970x448, 13.4KB](http://127.0.0.1:43110/1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L/img/common%20zeroblog%20screenshot%202019-1-2.png)\n\nI did this by placing the image in the `img` folder my blog's folder, which in my case is located at:\n* `C:\\Users\\Klu9\\ZeroNet-win-dist\\data\\1Ctjcvfovq6d1JWEGvM1JovCym4H6Es33L\\img`\n\nAnd then putting in this blog post the markdown image tag:\n* `![Screenshot of Common ZeroBlog](img\\common zeroblog screenshot 2019-1-2.png)`\n\nThat shows the image, but at reduced size. I can't click on it to see it at full size. I wonder if there's a way to do that.\n\nEDIT: Added link to full size, per SSD's suggestion."
		},
		{
			"post_id": 3,
			"title": "A summary of ZeroNet for newbs (like me)",
			"date_published": 1546442949.397,
			"body": "So someone on ZeroTalk made a post:\n> [Im brand new and i dont really get this. How does this all work???](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1546138183_12NqXRG5Ur6HzBsgR2kgPxmcWGhR9sxSLi)\n\nI gave a reply which I *think* sums it up:\n> It's like you've just expanded your internet to include another piece: now with ZeroNet installed, you can also surf ZeroNet sites and download ZeroNet files. You can also make your own ZeroNet site (quickly & easily) without having to worry about finding (and paying) a host, because just by having ZeroNet turned on, we are all helping each other out with hosting and getting sites and files: we don't depend on companies doing it for us (for a price: either our money or our privacy).\n\n> As a bonus, you can (with a few simple steps) do all this in a way that can't be blocked or tracked by third parties like governments, big data marketing companies etc.\n\n> That at least is my summary, but I'm also new here. Welcome!\n\nIs that about right? Any (newb-suitable) changes you'd make?\n\nEDIT:\nSuggestion from Styromaniac:\n> we are all helping each other out with hosting and getting sites and files\n\nto\n>visitors help out with distributing important files from sites they visit and optional files they elect to download\n"
		},
		{
			"post_id": 2,
			"title": "My first post on my ZeroNet blog",
			"date_published": 1546119407.645,
			"body": "(Or should I say \"zlog\"? Or \"bl0g\" with a zero?)\n\nSo far ZeroNet (on Windows) has been a lot easier than I imagined a web alternative (darknet, decentralized web, whatever) would be.\n\nI've installed it, done the basics, learned a few things, and run into some problems too, but no showstoppers. I know I have a lot more to learn but so far it feels within my ability range if I put some time into it. And other users are proving to be a great help.\n\nSo thanks ZeroNet and here's to a bright 2019."
		}
	],
	"tag": [
		{
			"value": "0net",
			"post_id": 2
		},
		{
			"value": "0net",
			"post_id": 16
		},
		{
			"value": "ZeroTalk",
			"post_id": 16
		},
		{
			"value": "newb",
			"post_id": 16
		},
		{
			"value": "space",
			"post_id": 16
		},
		{
			"value": "0net",
			"post_id": 15
		},
		{
			"value": "newb",
			"post_id": 15
		},
		{
			"value": "upload",
			"post_id": 15
		},
		{
			"value": "video",
			"post_id": 15
		},
		{
			"value": "images",
			"post_id": 15
		},
		{
			"value": "newb",
			"post_id": 14
		},
		{
			"value": "0net",
			"post_id": 14
		},
		{
			"value": "images",
			"post_id": 14
		},
		{
			"value": "upload",
			"post_id": 14
		},
		{
			"value": "0net",
			"post_id": 13
		},
		{
			"value": "newb",
			"post_id": 13
		},
		{
			"value": "blog",
			"post_id": 13
		},
		{
			"value": "0net",
			"post_id": 10
		},
		{
			"value": "newb",
			"post_id": 10
		},
		{
			"value": "upload",
			"post_id": 10
		},
		{
			"value": "audio",
			"post_id": 10
		},
		{
			"value": "IFS",
			"post_id": 10
		},
		{
			"value": "language",
			"post_id": 9
		},
		{
			"value": "translation",
			"post_id": 9
		},
		{
			"value": "software",
			"post_id": 9
		},
		{
			"value": "review",
			"post_id": 9
		},
		{
			"value": "0net",
			"post_id": 8
		},
		{
			"value": "video",
			"post_id": 8
		},
		{
			"value": "upload",
			"post_id": 8
		},
		{
			"value": "KopyKate",
			"post_id": 8
		},
		{
			"value": "0net",
			"post_id": 6
		},
		{
			"value": "anonymity",
			"post_id": 6
		},
		{
			"value": "communications",
			"post_id": 6
		},
		{
			"value": "filesharing",
			"post_id": 6
		},
		{
			"value": "p2p",
			"post_id": 6
		},
		{
			"value": "privacy",
			"post_id": 6
		},
		{
			"value": "security",
			"post_id": 6
		},
		{
			"value": "socialmedia",
			"post_id": 6
		},
		{
			"value": "decentralization",
			"post_id": 6
		},
		{
			"value": "federation",
			"post_id": 6
		},
		{
			"value": "0net",
			"post_id": 4
		},
		{
			"value": "newb",
			"post_id": 4
		},
		{
			"value": "upload",
			"post_id": 4
		},
		{
			"value": "images",
			"post_id": 4
		},
		{
			"value": "0net",
			"post_id": 3
		},
		{
			"value": "newb",
			"post_id": 3
		},
		{
			"value": "0net",
			"post_id": 12
		},
		{
			"value": "filesharing",
			"post_id": 12
		},
		{
			"value": "p2p",
			"post_id": 12
		},
		{
			"value": "newb",
			"post_id": 17
		},
		{
			"value": "0net",
			"post_id": 17
		},
		{
			"value": "blog",
			"post_id": 17
		},
		{
			"value": "tags",
			"post_id": 17
		},
		{
			"value": "p2p",
			"post_id": 11
		},
		{
			"value": "SSB",
			"post_id": 11
		},
		{
			"value": "decentralization",
			"post_id": 11
		},
		{
			"value": "federation",
			"post_id": 11
		},
		{
			"value": "socialmedia",
			"post_id": 11
		},
		{
			"value": "tech",
			"post_id": 11
		},
		{
			"value": "0net",
			"post_id": 18
		},
		{
			"value": "newb",
			"post_id": 18
		},
		{
			"value": "blog",
			"post_id": 18
		},
		{
			"value": "markdown",
			"post_id": 18
		},
		{
			"value": "links",
			"post_id": 18
		},
		{
			"value": "newb",
			"post_id": 19
		},
		{
			"value": "web",
			"post_id": 19
		},
		{
			"value": "file",
			"post_id": 19
		},
		{
			"value": "upload",
			"post_id": 19
		},
		{
			"value": "newb,",
			"post_id": 20
		},
		{
			"value": "images",
			"post_id": 20
		},
		{
			"value": "0net",
			"post_id": 22
		},
		{
			"value": "newb",
			"post_id": 22
		},
		{
			"value": "blog",
			"post_id": 22
		},
		{
			"value": "0net",
			"post_id": 24
		},
		{
			"value": "newb",
			"post_id": 24
		},
		{
			"value": "ZeroMe",
			"post_id": 24
		},
		{
			"value": "search",
			"post_id": 24
		},
		{
			"value": "0net",
			"post_id": 26
		},
		{
			"value": "newb",
			"post_id": 26
		},
		{
			"value": "URL",
			"post_id": 26
		},
		{
			"value": "blog",
			"post_id": 26
		},
		{
			"value": "images",
			"post_id": 27
		},
		{
			"value": "comics",
			"post_id": 27
		},
		{
			"value": "newb",
			"post_id": 27
		},
		{
			"value": "0net",
			"post_id": 27
		}
	]
}