{
	"title": "NullPipe\nZero Blog",
	"description": "echo $RANDOM | /dev/null",
	"links": "- [Source code](https://github.com/HelloZeroNet)\n\n[PoC || GTFO](http://127.0.0.1:43110/blog.nullpipe.bit/pocorgtfo.html)\n\n[DEF CON](https://defcon.org/)\n\n[JS DemoScene](http://127.0.0.1:43110/blog.nullpipe.bit/jsdemoscene.html)\n\n[ZeroMail Me](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=nullpipe)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1470820068,
	"post": [
		{
			"post_id": 12,
			"title": "Looking for ARGS",
			"date_published": 1470650594.331,
			"body": "With Mr Robot season 2 in full swing my love for alternate reality games(ARG) has been rekindled. Especially when it referenced the famous [Cicada 3301](https://en.wikipedia.org/wiki/Cicada_3301) ARG. Are there any fans of ARG's here on zeronet? And if so what are your personal favorites?"
		},
		{
			"post_id": 11,
			"title": "Adding video's from IPFS to your blog",
			"date_published": 1465650457,
			"body": "Adding video files to the zeroblog without having to increase the limit of zeroblog every time is actually pretty easy.\nFirst of all download and install [IPFS](https://ipfs.io/docs/install/) and follow [Getting Started](https://ipfs.io/docs/getting-started/). Make sure you have a daemon running.\n\nSo let's say we have a video we want to show in a player. In this case I found a video online.\nYou can add it to ipfs by running the following command:\n<code>ipfs add \"{path to file}\"</code>\nYou get a message stating: \n<code>added {hash} {name of file}</code>. You need the hash part from that message for the blog post. \nSo how do we put video files in the blog? We just use a [video](http://www.w3schools.com/html/html5_video.asp) tag from html5 like so:\n\n<code>\nvideo width=\"320\" height=\"240\" controls src=\"https://ipfs.io/ipfs/{hash}\"\nor \nvideo width=\"320\" height=\"240\" controls src=\"/ipfs/{hash}\"\n</code>\n\nReplace the {hash} with the hash you got  You can just put the html code in a blog post and save it.\nResult:\n<video width=\"640\" height=\"480\" controls src=\"https://ipfs.io/ipfs/QmTca4A43f4kEvzTouvYTegtp6KobixRqweV12NrvwwtFP\"> </video>\n\nNote: In a few days from now you can hopefully also choose to upload the file to https://www.ipfs.video/ and grab the hash from there or link to that directly without having to install ipfs.\n\n\n\n\n\n"
		},
		{
			"post_id": 10,
			"title": "Decentralized Web Summit",
			"date_published": 1465414689,
			"body": "There is currently a very interesting livestream at https://www.youtube.com/watch?v=Yth7O6yeZRE\nabout the thoughts on what the next steps of the web should be.\nSome of the talks are related to ZeroNet, NameCoin, IPFS and other great systems.\n\nAmong the presenters are some absolute greats like \nVint Cerf, Tim Berners-Lee, Brewster Kale and Cory Doctorow.\n\nFor more info see https://www.decentralizedweb.net/"
		},
		{
			"post_id": 8,
			"title": "Domain",
			"date_published": 1462001701.686,
			"body": "The .bit domain is finally here. The entire registration took took about 4 hours instead of 3. So I was getting a little worried by the 4th hour since the initial transaction wasn't accepted a single time yet but it all worked out. Providing the zeronet information was easier than I expected."
		},
		{
			"post_id": 7,
			"title": "First day on zeronet",
			"date_published": 1461872792.278,
			"body": "After my first day on zeronet I must say it's still kind of a maze to me.\n\nI'm slowly figuring out how to work with this blog. It's not a usual way of working for me. I'm used to just coding things and then pushing them to a server so editing on the fly seems a bit strange as I want to get under the hood of the thing immediately. If somebody can point me in the right direction on how to push updates without having to create/edit directly on this page let me know.\n\nOn the other hand I've already learned a lot of things. I finally (and hopefully) got some things linked to IPFS which was new to me. But it's cool to discover new tech and this seems to work pretty nicely. The web UI could use some more work on the files list department but the console also gets the job done.\n\nThe next goal for tomorrow will be setting up the domain. In the meantime feel free to check out the [PoC || GTFO](http://127.0.0.1:43110/17j8Y5EyKdnotYb1Q3ngnPmb3ES3AV3fiy/pocorgtfo.html) section which features a mirror of a popular netzine on proof of concepts which have a really interesting way of including their proof of concepts inside their pdf files by using polyglots. If they are new to you be sure to check out [this](https://www.youtube.com/watch?v=Ub5G_t-gUBc) presentation of 31c3 by Ange Albertini"
		},
		{
			"post_id": 5,
			"title": "Looking for new ways to share files?",
			"date_published": 1461782409.167,
			"body": "Demonsaw might be just the thing you're looking for. It's anonymous, there is zero logging or identifyable information going over the line and you're able to configure the crypto algorhythm and key sizes yourself.  It uses a mesh network and no login is required to use it.\n\nThe nice thing here is that it offers \"Social Crypto\".  This means you can link to files on the internet and use that as entropy for crypto routines. Anybody that has the same setup for their crypto routines can communicate and share files with each other. This also means you can switch to new url's within seconds when needed.  \n\nLearn more at https://www.demonsaw.com/. I suggest you watch [this video.](https://www.youtube.com/watch?v=lTngMxmymX4) There will be more news coming in may from HackMiami."
		},
		{
			"post_id": 1,
			"title": "Help out ArchiveTeam to preserve the internet!",
			"date_published": 1461733579,
			"body": "An ongoing problem in the current day and age is that a lot of websites are going dark without prior notice. They don't care about their end users. The internet is part of our digital history and we shouldn't be so careless about it. \n\nThis is where archiveteam comes in. They DO care about the internet as we know it and the content that is being created every day. Their team is made up by a bunch of rogue archivists and volunteers that have a common goal: archive all the things before they get taken offline. \n\nNow the good thing is that YOU can help out as well. They have created pre-configured VM's they call ArchiveTeam Warriors. These VM's can be used by people that want to help out archiving but don't necessarily have the technical knowledge. Running a warrior is simple and doesn't cost you anything more than a tiny bit of disk space, come CPU power and a bit of bandwith. Please help out where you can and run a warrior for the team. Help preserve the internet. Have a look at their wiki at http://archiveteam.org/.\n\n"
		}
	]
}