{"next_topic_id":4,"topic":[{"topic_id":1606864324,"title":"so what happens when this 50k bar goes full?","body":"does it just say i cant post anymore? do i allocate more space to it or something? do i have to delete stuff? im at about 25k rn.","added":1606864323},{"topic_id":1610507385,"title":"be ready for a bunch of new users","body":"this post is long so i moved it [here](http://127.0.0.1:43110/18yGvCe258KjiWaPhEjDy9MWLudQGVQgts/?Post:1) to free up some space","added":1610507383},{"topic_id":1617695664,"title":"a small mod to get a tiny bit more space out of zerotalk","body":"zerotalk for some reason encodes its data in pretty printed json. if you change it to encode in ugly json you get smaller data.json files, which means you have more space to speak with.\n\nstep 1. enter your zeronet directory\nstep 2. go into data/1TaLkFrMwvbNsooF4ioKAY9EuxTBTjipT/js\nstep 3. open the all.js file\nstep 4. ctrl+f for `JSON.stringify`\nstep 5. remove the `, void 0, '\\t'`\nstep 6. save\nstep 7. refresh zerotalk if its still open, or if you wanna be extra sure, clear your cache and restart your browser\n\nnext time you post something, your profile will shrink and you can get a bit more to say\ni was at exactly 50k, now im at 47.7k\n\nnofish come back pls","added":1617695661}],"topic_vote":{"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC":1,"1604568906_1KE9L799k2C9gX1Pcn3jWXWtCDY8Tr9csU":1,"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T":1,"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4":1,"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj":1,"1607182920_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1607365168_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE":1,"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj":1,"1607215052_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1607308202_14ttzKsh79te1T458HZGExH6Ghr13njvMr":1,"1607575526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1608025556_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx":1,"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN":1,"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN":1,"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj":1,"1610525949_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3":1,"1610524611_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E":1,"1610573261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1610627966_12fCWwfnxJDBdHDfUeocZTaopYmsvJadbP":1,"1610594001_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1610682330_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN":1,"1610793134_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg":1,"1610924622_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1610227365_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1610273837_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH":1,"1611330261_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT":1,"1611308558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1611288998_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH":1,"1615798999_1CGMXiw7HrbX9mU3grKaK6TA87AcDdLSXy":1,"1617668482_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX":1,"1616953116_15cApprVFcr1skAkWssq5aAXKa7pDwJJve":1,"1617745493_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"1617356637_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2":1,"1612011009_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT":1,"1616727565_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG":1},"next_comment_id":98,"comment":{"1605228744_1BMRs7eu9rH13ZmjhkXfdQpfNturyNDkYs":[{"comment_id":1,"body":"hi","added":1605647153}],"1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt":[{"comment_id":3,"body":"look out: before making a statement like this, you must be ready to fight. things will get bloody, thats what happened in 1776.","added":1605654265}],"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA":[{"comment_id":4,"body":"> The destruction of the human DNA.\nvaccinations dont touch our dna. vaccinations are doses of the virus modified in a way where the virus is very weak. the immune system sees this weak virus, fights it off, and then comes up with a way to destroy the real thing. its like parents giving their kids chicken pox so if their kid gets chicken pox again they will fight it off faster.","added":1605654507},{"comment_id":9,"body":"> [jesuschrist](#comment_13_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): Covid is the an undeniable conspiracy theory.\n\nill deny it being a conspiracy theory right here and right now, i know people who got it. trying to fake a virus this bad to the entire public is impossible.\n\nif you got proof that you were told to pretend its real and you have it or something, ill take it, but if you dont, covid is real.\n\n> If you come onto my property and force it upon me you will be killed.\n\ni will say you have the right to do that. you may hold your beliefs that the vaccine is a great enough danger to your life, and you may defend yourself from it. but other people have that same right.\n\nmost of us know that covid is deadly, so if you come onto our properties, and force covid on us, we have the same right to defend ourselves from you. that means store owners, church owners, school owners, shooting range owners, you name it. so youre gonna have to stick to places that let you in.","added":1605836725},{"comment_id":10,"body":"> [driud](#comment_165_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): These are not vaccines.This is an injection that has the \"DNA\" alternator hidden in it.There is a change in human DNA.A human-like mutant arises.That is the purpose of these vaccines.\n\nwhat if that apple you ate yesterday, is not an apple, but it has dna mutators on it too? sounds crazy, right? thats because i made it up. anyway, do you have any proof that they are making dna mutators instead of vaccines? or was it something you made up?\n\nor that water youre drinking? what if it had high levels of the chemical called dhmo, or dihydrogen monoxide? did you know that thousands of people die from dhmo every year? did you know that they make yoga mats with dhmo? did you know that dhmo is used as a fire retardant? did you know dhmo makes metal rust faster? did you know that dhmo gets passed down through babies? did you know dhmo is a greenhouse gas? did you know that its legally required to be in your water pipes? maybe you drink bottled water, but guess what? its in your water bottles too! its also in rivers, oceans, your food, and even in the air! you breathe dhmo all day, every day.\n\ndihydrogen monoxide. if you break it down that spells out 2 hydrogens, 1 oxygen. or H2O. or water itself. yeah thats right. people drown. they make yoga mats with water. they pour water on fires to put the fires out. water rusts metal. water vapor is a greenhouse gas. babies are born with water in their bodies. if they didnt put water in your pipes, your water company cant call it a water pipe, could they? bottled water companies cant call it a water bottle, could they? rivers, oceans, food, and air would be pretty dry without water.\n\n[(clearnet wikipedia page) this was a real thing that tricked people](https://en.wikipedia.org/wiki/Dihydrogen_monoxide_parody). if you cant break down what you say, youre spitting nonsense.","added":1605837989},{"comment_id":16,"body":"> [dv1](#comment_24_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): Keep Calm, get vaccinated and Carry On, do not question anything, just enjoy life, TV , work and family. talk about sport, believe in god, you are safe. And remember, US reach the moon in 1969 !\n\n> [dv1](#comment_24_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): Keep Calm, get vaccinated and Carry On, do not question anything, just enjoy life, TV , work and family. talk about sport, believe in god, you are safe. And remember, US reach the moon in 1969 !\n\noh, now youre the one telling me not to question anything?","added":1605926374}],"1604697444_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX":[{"comment_id":5,"body":"i hope you choke on your uncooked pizza rolls. leave the kids alone.","added":1605655012},{"comment_id":18,"body":"> [anonynous38883](#comment_13_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): This message is for All stupid anti pedo if you dont know how to use Whonix and how to secure your self is not my problem .. Nothing will stop me .\n\nyeah. you post your cp as you wish, we post our disgust as we wish. cp is wrong, its bad, its evil.","added":1605926768}],"1595502249_1BFC6WPRFTMXJzb687o2bvFhgt3HLci1v7":[{"comment_id":6,"body":"i really believe that you are looking at the wrong problems. theres bigger problems for us to solve right now. still, ill give this a go.\n\n1. the muslim woman has the right to refuse service for any reason.\n2. i dont care about gender balance. i want good politicians. taking gender, identity or biological, into your choices for politicians is always wrong.\n3. idk, this is up for the people at berkeley to decide. im not of berkeley.\n4. this question dont make sense. \"if 0/0 is undefined, how come x=4 works in the equation x*0=0?\"\n6. hell no. its just a complaint. i agree with them too, because a trans woman has a mans body. a mans body is different from a womans body, which means performance will differ. still, its up to the eventholders, because its their event and they can do what they want with it. if the eventholder rejects it, the biological women can hold their own events and run prizes.\n10. blind. were judging people by their music, not by their skincolor, right? trying to force diversity is just as racist as segregation.\n\nthe rest go too far into race politics, they assume i believe stuff i do not believe. race politics are way too chaotic for anybody to solve problems and for me to think about. all i want is for us all to come together, because thats how we move forward as people.","added":1605659979}],"1605824826_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26":[{"comment_id":7,"body":"lmao again?\nanyway yall if they somehow pass this just keep using telegram and stuff unless they actually get backdoored. remember: in telegram only secret chats are e2e encrypted. regular chats and groups arent. signal is always e2e and with whatsapp we dont know for real because closed source.","added":1605829766}],"1604477660_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX":[{"comment_id":11,"body":"> [anonynous38883](#comment_1_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): thanks for your reply , is appreciated ... We are a Community of Child lover in the deepweb (tor) and we be there too.. if you dont want to see anything like that leave freedom place (zeronet) or block us You can add to black list.. Bye\n\nhow sad, somebody came here calling it freedom place yet calls us out for calling them out for posting cp on it. yall aint just littering freedom place with trash. yall are the trash on freedom place itself.","added":1605838207}],"1590855688_13ynUw2jD5FnBomqnq5vENr5ioWY7VEtTA":[{"comment_id":12,"body":"till we get a good zeronet alternative, 4chan. its got a good userbase without the ccp owning the platform, the information, your words, and yourself.","added":1605838327}],"1605473599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":13,"body":"i aint worried about him. if the dems in office were able to slow donald trump down, the reps can slow joe biden down.","added":1605838412}],"1598683262_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T":[{"comment_id":15,"body":"> [xcape2net](#comment_785_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): This is one more reason that everyone should be using a REAL computer, preferably with an opensource operating system.\n\nstill waiting for a real unbackdoored cpu that aint from 2006, raptors seem pretty good but expensive","added":1605838852}],"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4":[{"comment_id":19,"body":"theres some people who actually dont care, and im fine with them. even though it hurts those that do care, its their choice. but most people really dont know at all and would care. that leaves the few who wanna get away from google but cant leave behind their favorite youtubers, or youtubers who wanna get away from google but cant leave behind their fanbase.\n\ni dont think zeronet is anywhere near ready to replace google or facebook, even leaving out zeronets tiny userbase. it can get there, but it will take a lot more development. same with the other distributed services. but we do have federated options that are ready. mastodon and matrix can replace twitter and discord easily rn.\n\nso if we want to bring privacy to the world, we need to give zeronet something new that obliterates the market. something that google couldnt dream of making for themselves and selling data with.\n\nbut as we go talking privacy and stuff, we need to remember. our iphones and androids have backdoors everywhere. pinephones are coming out, but they arent ready for people who never touched linux outside of android and chrome os. and even our pcs. unless you wanna spend $8000 on a raptor talos, or find a laptop from 2006 or whenever before intel me or amd psp started getting jammed into our processors, you got backdoors.\n\nsometimes people think privacy is for the paranoid that the government is gonna leak their browser history. well, maybe im paranoid. the government says that this anti privacy bs is for national security. and maybe it is. but why fight for national security if it kills the nation and everything it stands for? privacy is a part of the nation, we must feel safe in our homes. the government doesnt need to know i was watching roblox porn. they have no right to know i was watching roblox porn, and national security does not depend on it.\n\nthe government has violated my trust, and im sure they violated yours too. i aint taking any of this nothing to hide nothing to fear crap from a government that wiretapped the country without a single warrant and recorded everything we ever said, and tried to stop that secret from getting to us by any means necessary when a hero named edward snowden showed us what was happening, and still has yet to pardon him. the government is the threat to national security and i hate them. they are just as evil as the terrorists they are fighting.\n\nwoah i ranted hard. sorry about that guys.","added":1606284112}],"1605962988_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji":[{"comment_id":20,"body":"good links, but remember: these sites dont save you from toxic politics. because the platforms with wide userbases are owned almost always by the toxic left, free platforms get flooded by the toxic right. gab for the most part is known to be that site for \"racist nazi pedophiles\", and it keeps getting deplatformed for \"hate speech\" by even mozilla, a company that is supposed to stand against censorship of any kind. disgusting. and when people defend it they suddenly hate black people? what is this, 1692 salem?\n\nthe rest of the time, if, lets say dream took his minecraft manhunts off youtube and put them on lbry.tv or something, he would lose maybe 95% of his viewers because theyd be too lazy to move with him to lbry.tv\n\ni just want to see a free platform that doesnt abuse its users but isnt nothing but toxic politics of either side :(\n\nanyway, if we want to move people away from these dumb abusive platforms and bring them over here on zeronet, we need to make something entirely new. something that doesnt exist on centralized platforms, maybe something that cant even exist on centralized platforms. then people will have a reason to move, and all our other stuff will see a good userbase.","added":1606707594},{"comment_id":21,"body":"> [nekololi](#comment_497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): lean away from centralized services and more towards federated and decentralized solutions. i promise you will see a day where gab and parler, for example, take up the task to censor whatever they consider problematic or undesireable. remember that twitter, too, once heralded itself as a free speech platform.\n\nmight even be very *different* censorship, like reddit after being bought by the ccp","added":1606707802}],"1516327946_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv":[{"comment_id":24,"body":"ugh, comparing iqs again. i can hear albert einstein rolling in his grave.","added":1606863218}],"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4":[{"comment_id":25,"body":"i have stuff to live for. not really pleasure. its just a task god has given me to do through my life on earth.","added":1606863388}],"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV":[{"comment_id":26,"body":"what did you expect? its a free network. as disgusting as their opinions might be, they have a right to hold it. the toxic left owned platforms, like twitter, rejected their ideas, so this is the only place where they can exercise their rights to free opinion. of course theyd be here.\n\nif you dont like free networks or privacy, leave. oh yeah, dont forget to stop seeding, because it only helps us out. if you want to stay on a free network, you must accept others, because, well, i mean we cant exactly kick you off either, so go ahead. post all the toxic crap you want, you have every right to your opinion too.","added":1606864383}],"1607182920_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":27,"body":"\"china will win\" -china\n\nlmao glhf commie losers","added":1607235077}],"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj":[{"comment_id":28,"body":"this comment is big so i moved it [here](http://127.0.0.1:43110/18yGvCe258KjiWaPhEjDy9MWLudQGVQgts/?Post:2) to save room","added":1607401674}],"1607365168_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE":[{"comment_id":29,"body":"this is toxic politics. both sides do this to reasonable people like you and me. whats important is we recognize that theres these kinds of people on both sides, and instead of outcasting their side, we outcast those kinds of people. this is TERRORISM! do we outcast regular muslims who just want to be at peace with the rest of the country? no, we outcast isis.","added":1607402174}],"1607222817_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3":[{"comment_id":30,"body":"dna mutation kits are not stable at all yet. for one of these kits to change an already fully built brain, and even pick up and trigger on an em signal, to inject a specific thought? not believable at all. so im gonna stop you right there.","added":1607453800}],"1607308202_14ttzKsh79te1T458HZGExH6Ghr13njvMr":[{"comment_id":31,"body":"> [mentosonmobile](#comment_8_1LKV9xTJGWsmvJNHYC5Y7KPSiUY48AmKMH): He literally had a stroke.\n\nf","added":1607454572}],"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":[{"comment_id":32,"body":"well, its not all that great in my opinion. kinda clunky. but its a fun network to play with, and its even free from censorship. so ive been hanging around here for a while and i love it. its just that we should try to get something better going.","added":1607454909}],"1607575526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":33,"body":"pretty much the exact same as your thoughts. more people on zeronet is always better. just like tor becomes stronger with more users.","added":1607628242}],"1610487411_1Etm6vDz6ED5oGHsXGFpCDb3PNw8shgdx":[],"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa":[{"comment_id":35,"body":"nice lmao","added":1610503390}],"1610506203_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN":[{"comment_id":36,"body":"- check out zerome, find some blogs, just have fun!\n- post some stuff around, maybe post a zerotalk board about something on your mind\n- put up a blog of your own if you want\n- overall just click around","added":1610507371}],"1610501785_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN":[{"comment_id":37,"body":"why dont you change that? we aint anywhere near as big as twitter, but with your help we could get there. post some stuff!","added":1610507463},{"comment_id":40,"body":"> [baker](#comment_2_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN): I'll see what I can do\n\nthats the spirit!","added":1610512805}],"1610509513_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3":[],"1610507385_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx":[{"comment_id":39,"body":"> [styromaniac](#comment_2866_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You and the shift key aren't good friends. [...]\n\nARE YOU SURE? WE ARE ABSOLUTELY BEST FRIENDS! lmao ty :))))))))","added":1610512722},{"comment_id":43,"body":"> [quantumkitty](#comment_531_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): I went through a socialist phase in the past.. but have quit politics altogether recently. [...]\n\ni think you have it all figured out. thats actually really good thinking.","added":1610523354},{"comment_id":44,"body":"> [svein](#comment_3_1G8R3VmkwNea83EtZmgWpNXQhmfophuxa6): Zer0net doesn't seem fully decentralized. It seem that it use tracker (which are still centralized servers, even if anybody can host one) and not the DHT protocol (which IS decentralized and replace trackers).\n\nthen i guess its time we moved zeronet to a dht, id start writing some pull requests but i have no idea how dhts work so i have to figure that out first","added":1610523791}],"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":41,"body":"are you just gonna let them take it? theres people in this world that hate freedom. they hate it, they hate the idea of it, they hate the existence of it. they want to be in control of what people say. they also want to tie you down, and force you to make tshirts and solder electronics and stuff. if they cant do that, they want to kill you. and they dont wanna just shoot you and let you die quickly. they wanna put you through as much pain as possible as you die just because you love the very thing they hate the most: freedom.\n\nare you really gonna give them what they want? *no.* you better make them go through hell before they can take us down, just like if they were coming to your house to take you away right now, you better shoot back.","added":1610518593}],"1610350298_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW":[{"comment_id":42,"body":"i use ubuntu 20.10. for anything privacy or security, something linux based is what you want. id run arch but im not smart enough.\n\nDO NOT RUN WINDOWS. MICROSOFT IS SUPER AGGRESSIVE WITH THEIR SPYWARE RN. I DONT EVEN TRUST IT FOR GAMING ANYMORE.\n\nabsolute ideal? go for 100% open source software and run it on 100% open source hardware. but open source hardware is not in reach of many. power9 is the best rn but its expensive. so most of us make do with things like intel+me_cleaner, or amd with psp disabled in bios.","added":1610519267}],"1584198532_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6":[{"comment_id":45,"body":"> [skytw](#comment_10_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf): With the American cyberspace downgraded to semi-jungle level, the number of peers should further increase rapidly on Zeronet?\n\nnope but censorship did only hit just now\n\nChina 237 peers\nUnited States 216 peers\nCanada 41 peers\nItaly 37 peers\nRussia 28 peers\nAustralia 25 peers\nUnited Kingdom 24 peers\nJapan 20 peers\nBrazil 20 peers\nGermany 19 peers\nFrance 18 peers\nNetherlands 16 peers\nTaiwan 13 peers\nUkraine 10 peers\nOther 94 peers","added":1610524304}],"1610525949_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3":[{"comment_id":46,"body":"i lost my support for donald trump with how badly he handled covid. but he still did a better job while he thought covid didnt exist than gavin newsom, who knew covid exists. how tf that even possible?","added":1610560798}],"1610611550_1ASwoyvUC5DBAECJFQ7WqZVazYdo1HKiDp":[{"comment_id":47,"body":"http://127.0.0.1:43110/1Mr5rX9TauvaGReB4RjCaE6D37FJQaY5Ba/ kinda works but it aint decentralized","added":1610654370}],"1610594001_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":48,"body":"rtx is also for suckers because nvidia hates open source. they dont release source code drivers. they wouldnt release binary drivers for linux until valve stepped up, with these drivers being total garbage. they put extra firmware signing features, making open source alternative drivers impossible and making their cards defective by design.\n\nand on windows machines ive worked on, geforce experience makes you sign up with your email before you update your drivers. WHY SHOULD I HAVE TO HAVE AN ACCOUNT TO DOWNLOAD AND INSTALL NEW DRIVERS???????? probably spyware junk. im sorry nvidia, your cards are awesome, maybe if you didnt design them to suck i could support them better. now i wish i never bought my nvidia graphics card.\n\namd drivers aint open source either but they at least let open source alternatives stand and run well. sorry for the rant but i just really hate nvidia.","added":1610656528}],"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz":[{"comment_id":49,"body":"> [smashbuckler](#comment_64_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Please, no \"realtrumps\" in ZeroNet. Go elsewhere.\n\nyou dont own the network. welcome to zeronet. love him or hate him, hes here to stay.","added":1610735692}],"1610690590_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":50,"body":"> [quantumkitty](#comment_546_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Is it a problem? [...]\n\nim at 49.5k help pls\nyeah i think im gonna have to delete a bunch of stuff\n\nedit: haha look at my 41.7k\nedit 2: i just cloned zerotalk but i cant figure out how to raise limits. im hoping to raise the default limits much higher than 50k. i see the max_size things in data/users/content.json but it just does nothing. its here if you want it http://127.0.0.1:43110/1EARsQrEV4pqMnYRVECG9zenfnaGi5qzUT/","added":1610735821}],"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj":[],"1610682330_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":52,"body":"im running zeronet on my old laptop with a 1tb ssd and it seeds all day, then i can connect with ssh, is nice","added":1610739262}],"1610876302_14xmVmzUMAx4egBicMbRNkqkrrgRgLFgYg":[{"comment_id":53,"body":"up for me rn. if 4chan goes down its gonna be a bigger disaster for sv than it will be for us but they might do it anyway. we just need to be ready.","added":1610911005}],"1610874256_1f14ZYyzStz4VrDw3o8Ta6x89t27CXsNN":[{"comment_id":54,"body":"its already tencent, i know its gonna do something fishy but i didnt think it would go so far itd read your OTHER browsers. disgusting. im already starting my move away from reddit.","added":1610912994}],"1610813974_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS":[{"comment_id":55,"body":"ive thought about gab but even twitter has less toxic politics. i applaude them for standing for free speech but i also want good enjoyable content, not another political mess.","added":1610913189},{"comment_id":59,"body":"> [nq8](#comment_13_1BfSkii33q8CigGRGQaae1kG3CgeJBd8NN): It takes more work but you can filter out content you dont wish to view. Twetch is great for that because you can #trolltoll, every posts costs money.  [...]\n\nyeah but theres just not enough content there. but ill check out twetch","added":1610934487}],"1610793134_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg":[{"comment_id":56,"body":"no more google play for me. im all fdroid where i can.","added":1610913276}],"1610924622_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":57,"body":"> [scotcyguy2](#comment_63_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): I am quite frankly tired of this reductionist argument of anyone questioning vaccines being called \"anti-vaxx\" and then just ignored...it's the exact same tactic as the man made climate change debate where if you ask any questions you get labeled a denier and the person sticks their fingers in their ears and will not listen any more.\n\nits so true. it doesnt help either sides case, just makes things more likely to break out into real and violent fights.\n\nand to raise more ideas, think about all the censorship on twitter and reddit and stuff. its all in the name of \"stopping racism\" and \"stopping hate speech\". bruh, you know what banning racists does? it makes racism worse! now theres absolutely no way to talk some sense into the racist. now, all the racist wants to do is head out and shoot some black people.\n\nor we could do what daryl davis does [clearnet wikipedia](https://en.wikipedia.org/wiki/Daryl_Davis). he, an african american, finds kkk members, and instead of screaming \"RACIST RACIST RACIST\" and punching them in the face, he befriends them and gets them to quit. hes gone as far as posting bail for a kkk leader, who was facing charges for shooting at counter protesters at unite the right, and taking him to a black history museum.\n\nhes got a whole collection of kkk robes from klansmen he befriended. tell me, all you people who have the power to ban people and have used it to ban racists, how many kkk robes do you have as trophies?","added":1610934210},{"comment_id":58,"body":"> [pocketsand](#comment_2_1EhHXjjm6YW8dha25g67GmZtqV2BhPTigU): I got sick for a month after my last vaccine 14 years ago. I never took anyone after and never will, no matter what.\n\nthey do that.\n\nvaccines are just a dead or harmless version of the virus that works as target practice for your immune system. that sickness was just your immune system learning how to fight the real thing.","added":1610934338}],"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX":[{"comment_id":60,"body":"yall still spamming zerotalk with your dumb links? bruh we didnt want to watch kids get raped the first time you shared.","added":1610934973}],"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4":[{"comment_id":61,"body":"i cant trust either side anymore. kanye west 2024 i guess","added":1610935169}],"1610273837_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[],"1611103567_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v":[],"1611215074_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH":[{"comment_id":64,"body":"this is something like the holocaust","added":1611256431}],"1611330261_1HwJB2bpiPPTctCtysK3198pKjMBY28vAT":[{"comment_id":65,"body":"if you dont trust google play, signal can be built from source!\nhttps://github.com/signalapp/Signal-Android","added":1611340531}],"1611308558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":[{"comment_id":66,"body":"only reason i could kill somebody is to stop them from hurting me or someone else. even then id be slow to pull the trigger.","added":1611341862}],"1617668482_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX":[{"comment_id":67,"body":"you should probably post your session id directly, the owner of pastebin could hijack your session id and replace it with their own to read everything you send.\ni mean they probably wont, but we need to stop trusting companies like this when we dont need to.\nmine is `057b9307dc57ef44c4b63cbcf37d1643f4af2bf157bbe445e7cd79bb33cb69b109`","added":1617695820},{"comment_id":75,"body":"> [ihaphleas](#comment_45_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A): I'm trying it out ... seems a bit too slow for real IM ... but I like it. [...]\n\nlokinet seems like just a regular alternative to tor, though a good one. just not a decentralized application network kind of thing like zeronet is.","added":1617748394},{"comment_id":79,"body":"> [5h1n1n9d4rkn355](#comment_25_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): I'll seriously take that into consideration. Nothing is safe anymore on the clearnet.\n\nsad but true","added":1617827883},{"comment_id":82,"body":"> [5h1n1n9d4rkn355](#comment_24_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): Is there a lokinet for mobile?\n\nloki needs tun/tap. i think you have to root your phone to get it working, you probably also have to modify it to run on android.","added":1617828839}],"1616777685_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG":[{"comment_id":68,"body":"thanks, do you know any more about this?","added":1617696806},{"comment_id":70,"body":"> [missinguser](#comment_6_19CcB8NQHjyzj4TH9vKYm92xNPaUBg7hmv): Intel me and amd psp, it s sad to see if u want privacy u need old cpu from 2011. Or wait for arm linux or riscv but the only place they are produce and use in desktop is china so......\n\napple m1 looks good but secure boot :(\nif they backdoor arms we better raise hell","added":1617697533},{"comment_id":73,"body":"> [oscarwilde](#comment_5_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG): ARM is no good also, as my Raspberry Pi and Google Pixel have shown (besides every iPhone and Android from family). [...]\n\nTHEY GOT A BACKDOOR IN OUR PIS? WTF","added":1617747825}],"1617430409_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX":[{"comment_id":69,"body":"i had similar thoughts earlier today, i posted about them here http://127.0.0.1:43110/1DKufvpWHv1C8E5vrp18gD946ixLn46Haa/?Post:3:the+election","added":1617696864}],"1617244448_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu":[{"comment_id":71,"body":"theyre probably just salty about rewind","added":1617745485}],"1617745493_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":[{"comment_id":72,"body":"i bid op good luck with his lawsuit","added":1617747757},{"comment_id":80,"body":"> [jeff](#comment_109_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Into the trash it goes.\n\ndamn lol","added":1617828224}],"1616231596_1CQzPmMXnfH3eJvpKGNfsVnUXxiHZM3jp2":[{"comment_id":74,"body":"> [ssdifnskdjfnsdjk](#comment_1013_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS):\nis nofish still alive? i mean if a government tracked him down and disappeared him they would probably replace him with a fake instead of leaving him to rot.","added":1617747981}],"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31":[{"comment_id":76,"body":"its just a mess. i cant trust either side right now, and this includes infowars.","added":1617749041}],"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31":[{"comment_id":77,"body":"again? when they tell you to turn in your guns, dont turn them in. the people that do turn theirs in are the reason why gun grabbers get away with what they do. hell, if you have the balls to, mill the $20k cut in your ar lowers and turn them into m16s. if the atf comes after your dogs for these cuts, they are just free target practice.\n\nmore to it on my blog [here](http://127.0.0.1:43110/1DKufvpWHv1C8E5vrp18gD946ixLn46Haa/?Post:3). the post is about the election, but it has good instructions on how to not fall for government bs without falling into conspiracy either.","added":1617749350}],"1615948566_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS":[{"comment_id":78,"body":"there are no servers or clients. just trackers and peers. i myself run zeronet on a separate box and ssh into that machine whenever i wanna connect to zeronet so im always serving content.","added":1617749428}],"1617695664_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx":[{"comment_id":81,"body":"> [styromaniac](#comment_3044_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I see no change yet.\n\nmaybe all.js is still cached in your browser. try clearing your cache, ill add that as a step","added":1617828653},{"comment_id":83,"body":"> [styromaniac](#comment_3045_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That might have been the issue. Now I have more space.\n\nthanks for finding that out for me :)","added":1617828977},{"comment_id":95,"body":"> [styromaniac](#comment_3046_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Hey, you think I could do this with ZeroMe Luna?\n\nas long as you can find where it generates pretty printed json and change it to ugly print. if you pass me a link to zerome luna i could probably make a patch for you","added":1617834102}],"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT":[{"comment_id":84,"body":"ra ra rasputin","added":1617829670}],"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT":[{"comment_id":85,"body":"lets not do that. they are still free press, so by killing them you censor the world.","added":1617829780},{"comment_id":94,"body":"> [certy](#comment_1_1qNWEDofNoMxA5vQoWoDeC6fZ5Dt6Wgif): Would you consider the Reich Ministry of Public Enlightenment and Propaganda (nazi propaganda) as free press? [...]\n\ni would. as bad as nazis are, *nobody* should have their opinions silenced. if nazis say \"kill jews\", we should say \"no\" instead of silencing them. let people think for themselves damn it.\n\nthe problem the nazis had with free speech is that they silenced anybody who spoke out themselves. with violence. but all you need is a gun in your hands and friends by your side. now, they better think before they come for you.","added":1617833397}],"1617373305_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N":[{"comment_id":86,"body":"> [ixp](#comment_2_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX): Why does everyone on the decentralized net or any privacy respecting protocol always either a socialist or an \"orange man bad\" repeating NPC\n\nthis is a place where people are free to speak their minds. we need to accept them with open arms, because if we dont, were no better than twitter.","added":1617830010}],"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31":[{"comment_id":87,"body":"cool place, i love their guns. the russians already perfected the ak and somehow israel still bettered it with the galil. and the uzi is a masterpiece of its own.","added":1617830143}],"1617356637_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2":[{"comment_id":88,"body":"if you go offline, your site will be down. you need to find some peers first. if somebody opens up your site, they will become a peer, and then they will be ready to serve your site if you go down.\n\nif you want to get some peers quickly, you can post a link to your site [here](http://127.0.0.1:43110/1LtvsjbtQ2tY7SCtCZzC4KhErqEK3bXD4n/). people run bots that automatically seed new sites posted here.","added":1617830428}],"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi":[{"comment_id":89,"body":"> [vaxxnazisdiez](#comment_6_14Nm7cvqnd7BwCaztj3wnCSPsBzJcefsif): \"new\" satellite tech can see at least 60 feet below ground... the question is how to bury an AK while it being invisible to sat scans (which are automated btw).\n\ndont worry about crazy tech like that. just train with your friends, and if the government comes for your guns, fight back. people that lose these fights are almost always alone. when the british came for ours in 1776 (shot heard round the world), we won even though we had no training because we outnumbered them greatly. but with just a little bit of training and a few friends, you can take on whoever they send.\n\n(dont stay at the same place though. you dont wanna get sieged like waco did)","added":1617830826}],"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy":[{"comment_id":90,"body":"all we need is for zeronets codebase to get fixed. we still have no dht and it still uses v2 onions.","added":1617831831},{"comment_id":96,"body":"> [deuxzaron](#comment_130_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): \n\ni dont think hes still here. either way, forking could really help zeronet grow, so we can get new features","added":1617864743}],"1616149523_1Hokap9vnjUTCeaQS91AQqUqW8Qry4rJTA":[{"comment_id":91,"body":"hes a fan of free speech. twitter will hate him no matter how he pushes free speech. but yes, he does need decentralized web, hosting providers are not free speech friendly enough.","added":1617832012}],"1616102046_19ZHrfy96SuEuPsko2NXoDtRLW8unYEP7f":[{"comment_id":92,"body":"> Do you think the american patriots are still enough in control to be able to deploy a (counter)-normalization plan?\nif we are still standing, we are ready. we could be in concentration camps, we will find a way to take the whole thing over.\n\nthe question is, do you want to be free? because i want to be free.","added":1617832137}],"1615243619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":[{"comment_id":93,"body":"> [transcoder](#comment_26_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH):\n\nhell yes. good reason to remember, no matter who these people are, or what their opinions are, we need to stand for their free speech. we wouldnt get a chance to put our own ideas out there if we didnt.","added":1617832782}],"1622967007_1Hkb9FSSux5SJFvuaQ5SKFnievTujtAsZt":[{"comment_id":97,"body":"i lost you on \"opposing the secondA isn't a political opinion, it's a declaration of war.\" opposing 2a sounds like an opinion to me, yet one i dont agree with.\n\nmost anti gunners really do think it makes our country safer. im pretty sure theres some big group of people (probably ccp) who are pushing these arguments because they want to disarm and enslave us, and i would go to war with them. but i cant point any fingers without evidence. until then, we need to make as many people as possible comfortable with guns so nobody falls for their crap anymore.\n\nso if you have any friends who have never shot before, teach them how to shoot. thats how we save gun rights.\n\nthis post makes anti gunners *more* anti gun, not less. this just confirms the idea that were just a bunch of crazy nazi rednecks or whatever they see us as. it makes them less likely to hear us out.","added":1624136323}]},"comment_vote":{"11_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU":1,"2_1DMAiK5GgQzieWiy24LKz6NDkHJo8m5CLU":1,"2_1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9":1,"4_1N2VV3mbu9KLbSxTpedj9JvaQ51v9vNEN3":1,"411_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z":1,"770_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"32_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz":1,"2_1JZbocH3UaB6JHum2Vaja7uuG7n3xexcib":1,"4_14qehPmJvdCxmQ3Dfs5gEHovBXxPhTgzcQ":1,"1_1bKh5D7jgCbhCLTjQwxUCeovri6TF1Laj":1,"41_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1":1,"11_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA":1,"1_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv":1,"10_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA":1,"106_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3":1,"1_1DdEtpoQv5f7ia3TvzqGGdosvmqeZnQf4k":1,"37_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji":1,"1_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK":1,"2_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv":1,"3_13Vz54JPp7uho5FaMyyi9hv7yi8zJHVhkv":1,"9_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1":1,"3_1An8FiAnbsUrwMrfo33rsHAzk9xiH8BR8w":1,"121_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK":1,"7_1KMBnDqDvwP1ydqV8Y95r1TXAFePSY2sXw":1,"43_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF":1,"785_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"6_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh":1,"5_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh":1,"23_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA":1,"698_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5":1,"497_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB":1,"3_1HAkWtoENzu446QLtTYyhBq2QvKi8CoxHq":1,"29_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G":1,"805_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"218_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X":1,"10_16fvyFvBWz9rDSRtHF54mMqTwVqhUpj5eE":1,"20_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie":1,"806_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"498_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB":1,"1_13mmdCzrmjQfAnqg2MEpbzaVGuqjDzjq8s":1,"1_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF":1,"118_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q":1,"699_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5":1,"1_14uzskV637ZrWJZeVfRgnvafyMdZebPvJk":1,"3_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE":1,"1_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4":1,"1_1HQX3G6q3TbDXHAvTrw6z8hC46Kd1Hw3yK":1,"15_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie":1,"2_1EsY6PtroZ2DyaVt6mTFPtZQqxaJ1hwJG1":1,"56_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji":1,"81_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF":1,"1_1KnGxS2ij8nfG2qxbrQ6Xz91nBU7XGCYri":1,"1200_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj":1,"51_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue":1,"55_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji":1,"48_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp":1,"499_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB":1,"10_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV":1,"3_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF":1,"1_1MZZaGmjyTYFX9fJy77rQxapqUkVHP4ET8":1,"562_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5":1,"1_1L2ZwsfRArS2LcgnNbDy8JK3rYVSgATMmz":1,"138_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU":1,"2208_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"2739_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"8_1EUxRrUu6DfuFtYfeuGJUc4GdTLGj4dunH":1,"2758_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"20_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4":1,"1_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt":1,"1_1GmSP4jfJEvcrTYaDmsfocWCXETGPghSDH":1,"29_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie":1,"2772_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"2759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"8_1LKV9xTJGWsmvJNHYC5Y7KPSiUY48AmKMH":1,"209_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z":1,"3_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG":1,"2742_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"113_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8":1,"814_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"2748_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"8_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT":1,"5_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT":1,"1_15cQMmBd5VDA4Ye4Aq2xcmXhuPd8w8vrJ6":1,"58_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt":1,"2864_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"530_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"2863_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"200_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH":1,"201_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH":1,"16_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG":1,"5_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem":1,"4_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem":1,"2866_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1_1HTq4kQHPnoraXvBWYZiNYYZGCpadSXhG6":1,"2_12BSeHrHaz9gyid4AFkYdFYRcmFsSQkGAN":1,"11_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh":1,"1_1JXjCUdKqR7B3c9f4SB2qBpWeawpGTwztW":1,"531_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"1_1AwyDwjc1hftxycY2WXYjhwZWQdwEAsB1J":1,"5_12eVhxNAYFPJi5rUnbHwbmKPnqAniJs7SA":1,"3_1G8R3VmkwNea83EtZmgWpNXQhmfophuxa6":1,"12_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E":1,"15_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu":1,"2_1CZpqLp5gdPKoBD3XJEAfDLAj1bjt96Wqd":1,"6_1DjoJoSQPYTUcaJck51X5rDxXtEBYmtUtR":1,"10_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf":1,"33_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ":1,"13_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E":1,"2_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N":1,"16_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg":1,"2867_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"2_1BhTd1ppRKVisQbCFA55Y3et5m8s9TsZr4":1,"3_1P49qK814LXkWtXWu9PvWEwDQC7iDagpGV":1,"1_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz":1,"4_1G8R3VmkwNea83EtZmgWpNXQhmfophuxa6":1,"14_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E":1,"532_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"17_1CrFEcv59gAFWe7w5wbKxCYJg3sDg48tUt":1,"6_1BfSkii33q8CigGRGQaae1kG3CgeJBd8NN":1,"28_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX":1,"2883_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"546_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"5_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN":1,"11_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr":1,"20_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E":1,"2893_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"13_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr":1,"6_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg":1,"1_1FShm8myz7QdwVusvyAFEp1w6GbzutxQzZ":1,"90_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W":1,"2_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp":1,"1_19VWa1kVLsX39JouRxwaeWscwktU3VAS3k":1,"60_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp":1,"2903_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"63_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX":1,"1_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8":1,"6_1Q1XaWRtj7SGymmyrop2PSmM35kHckmHjf":1,"2_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs":1,"2_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne":1,"16_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk":1,"18_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk":1,"12_1GADa2BPHWBsTH5Z6JmjcoWRsPMPVuuNzG":1,"36_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE":1,"13_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N":1,"64_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue":1,"62_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt":1,"3_16rNb85qZo2wJiF8MjPKqLTm1DTkYiRLgz":1,"561_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu":1,"2_14bm4C2yZgQkeB6SYLABAPwDboQFH3igtU":1,"2906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"1_1JAEofCheCShtrxW95ALsAvXEmafn6nppb":1,"32_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a":1,"1_18VHvh6VPsP3eGRrbWGyzP2L1vkfBM3tDY":1,"2921_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"3018_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"839_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz":1,"1_17UB3tahbjdq9AJ4x42XCq1K8Bta2iy54h":1,"112_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N":1,"45_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A":1,"25_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX":1,"109_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT":1,"1_1HLrjtGEat9GB6HSJRmm2ivRbvSnQy6F37":1,"3044_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"3045_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"2_15FbScWG2wGbwWdjTCfaq8rHHutm4uMrBX":1,"2_1Qq4LP4T9LVbrnWLcUiQCXkMXJfPR1TTG":1,"109_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N":1,"57_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S":1,"26_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH":1,"3022_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd":1,"131_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy":1,"1_14pSxPyLcN166TsqVnVQK8ZPLwdzHTkdki":1,"116_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8":1}}