{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1566159714_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1565584272_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 1,
				"body": "4chan is up for me.",
				"added": 1565584401
			}
		],
		"1565617632_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 2,
				"body": "My soggy knees make it hard to stand or I'd go out and harass gamer girls to level up.",
				"added": 1565634657
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 3,
				"body": "Favoriting a site in ZeroHello removes it from my 'files' list. Bug? Intended behavior?",
				"added": 1565641515
			}
		],
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 4,
				"body": "Automatically telling people who muted them would cause drama. Whether it will offend the other person should play no role in someone's decision to mute. The decision to mute should be kept private so long as it is private and not done by a central authority.",
				"added": 1565813499
			},
			{
				"comment_id": 5,
				"body": "Making it more public might encourage it to be abused in public ways. People trying to organize mute campaigns to silence those they dislike, bullying people who do not comply. More privacy in general discourages this sort of behavior.\n\nMuting doesn't mean you did something wrong. There might be no behavior to improve. There are many reasons a person might want to ignore someone else. The person muted might be a very active user who doesn't speak the same language or other people you have no interest in.",
				"added": 1565813969
			}
		],
		"1566178230_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 6,
				"body": "8chan users had lots of motivation to come here. 8chan itself become popular due to the need to find a new place after 4chan kicked them out. An event where people are being deplatformed is the best time to try to attract new users.\n\nIf you believe such an event is coming then try to have easy to follow instructions prepared and propagated. ZeroNet is non-trivial to begin using compared to clearnet sites. They won't come if the instructions are not clear and they have too much trouble, after which they may find another place and it is too late to attract them. This worked very well for 08chan: the instructions were propagated, easy to follow, and a place was prepared for them to move to before the event hit.",
				"added": 1566180231
			}
		],
		"1566357785_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": [
			{
				"comment_id": 8,
				"body": "The condition of my systems appears to be acceptable for continued operation in the foreseeable future.",
				"added": 1566359197
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 9,
				"body": "That is human nature. The problem is not systemic. There is not a magic system that will make it go away. The best you can do is account for the nature of the people so the system built is suitable for them. The founders of the United States did this by realizing every authority will become corrupt and trying to plan around it. They were successful, but it wasn't perfect because humans aren't and won't last forever because nothing does.",
				"added": 1569453917
			},
			{
				"comment_id": 10,
				"body": "> [robinofdeath](#comment_8_1367VTupfj886Uk39iT4RjiSmrakiDYTga): the founders wherent successful. they created a government that eventually became the us government we know and hate today. in the long run it wouldnt work to go back to the founders vison, cos where does that lead you? right back to where we are.\n\nThe founders were successful. The abuse of power taken through the US government is to this day less than it could be. People who cannot understand this will do worse than they did.\n\nThe death of Socrates and Plato's reaction are a famous example of failing to understand this.\n\nSocrates lived a long life and was surrounded by friends at his death (according to Plato). Had Socrates not been executed he probably would have had a less dignified and more miserable death of old age soon after. He could serve as an example of the Gods rewarding virtuous people, even giving him a more merciful end late in life than the months-long ordeal of bedridden agony and indignity he could have had.\n\nPlato could only see the injustice of Socrates's execution. To correct the flaws that lead to that injustice he imagined in The Republic a society that would likely have had far less tolerance for Socrates and gotten rid of him sooner. It was designed to lie to nearly all of the people and could not have tolerated a chronic heretic like Socrates.",
				"added": 1569461816
			}
		]
	},
	"comment_vote": {
		"41_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1
	}
}