{
	"next_comment_id": 12,
	"user_name": "Eightyfour",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549331607": 1549391413
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "ZeroNet isn't just about censorship resistence, it's also about content persistence. As long as people within the network care about a site it won't go down.\n\nAnother benefit is free and easy hosting, perfect to experiment with.\n\nOffline availability of content can also be useful in remote location or locations with unreliable internet.",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549129097",
			"date_added": 1549223611
		},
		{
			"comment_id": 2,
			"body": "@Klu9: page load time is not always an advantage of ZeroNet, it depends on the situation. Eg. ZeroMe loads slower than Twitter if you download all hubs, even though I will never need most of this data. Social media within ZeroNet needs a serious rethink. But for sites such as blogs, this is a clear advantage.\n\nI think there's a lot ZeroNet could learn from the way RetroShare does social networking, but it's hard to imagine how these ideas could be implemented within the framework of ZeroNet (and whether that's something we want in the first place).\n**Archiving old content** Retroshare has a per-client-per-circle setting for how long you want to keep content. People can choose to keep it forever, or just a couple of days. The way ZeroMe is currently implemented this isn't really possible, but it's worth thinking about.\n**WOT** A Web Of Trust layer in ZeroNet could allow eg. searching hubs you don't have but a friend does by letting them do the search and send you the results. We're not really at a point where this is necessary, but it might help with scaling in the future.",
			"post_uri": "1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u_1549129097",
			"date_added": 1549325524
		},
		{
			"comment_id": 3,
			"body": "@ssdifnskdjfnsdjk@zeroid.bit: it's going to get even worse. there's new counter-terrorist legislation on the table in the EU that looks to be an even worse censorship nightmare than the copyright directive. And chances are we'll be stuck with both of them.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549319066",
			"date_added": 1549329263
		},
		{
			"comment_id": 4,
			"body": "We should be moving towards ZeroNet+IPFS.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549253754",
			"date_added": 1549331155
		},
		{
			"comment_id": 5,
			"body": "I've got Anthy on one computer and Mozc on another. I'll let you know which one I prefer when I've used them enough to know myself.",
			"post_uri": "1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp_1549331607",
			"date_added": 1549391392
		},
		{
			"comment_id": 6,
			"body": "Shouldn't it say:\n`+++ MON MAR 32 03:11:50 UTC 2019 +++`?",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1554088927",
			"date_added": 1554136159
		},
		{
			"comment_id": 7,
			"body": "Phones are not really ever secure, anywhere. Many apps spy, so avoid installing any. Then there's the binary blobs, they're unlikely to steal your users.json, but you never know. If you're in china I definitely wouldn't trust it.",
			"post_uri": "1Ekf2tGQLhG3iifFsuUk9RcBPx26cQmCD1_1554306299",
			"date_added": 1554383127
		},
		{
			"comment_id": 8,
			"body": "@styromaniac@zeroid.bit: Everyone on the internet is male in my book, because I don't care. I just refuse to have to look up what someone's real gender is or have to ask them or type \"him/her\" etc. Everyone male problem solved. On top the internet is rampant with people who lie to get attention, money or special treatment. Treat everyone based on their actions and not proclaimed gender: problem solved!",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557088633",
			"date_added": 1557184369
		},
		{
			"comment_id": 9,
			"body": "@KxoBot, I like a lot of the work you are doing here but you're really acting ridiculously rn. Even out of context those remarks you took from me don't look bad. Duende was being an asshole so I responded in kind and I have nothing against QW, he just took one joke too seriously.\nYes, you are being a drama queen and this post shows it. Not only are you engaging in drama, you're trying to get more people involved in the drama as well.\nAs for the post I made that got me involved I was just remarking that in 6 months of me being here there's been pretty much no drama to speak of and now over the past couple of days there's been plenty, I didn't even take sides, just remarked that it was happening. Is that hypocritical of me?\nI dunno and don't care, I like some drama as entertainment from time to time. Is it productive for ZN though? No.",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557292748",
			"date_added": 1557303459
		},
		{
			"comment_id": 10,
			"body": "@KxoBot: Good, we both don't care about the drama or each other. btw I'm not stooping to their level, I'm at their level and not stooping to yours. Not everything has to be productive, I don't go on the internet to be productive. I go on the internet to relax. The same is true for ZN.\nPro-tip: tone down the condescension.",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557292748",
			"date_added": 1557304588
		},
		{
			"comment_id": 11,
			"body": "And what was the murder rate on the early internet?",
			"post_uri": "174zuaSY2Fh9K6ZVFHe3EP45wnAsvAghGd_1557371306",
			"date_added": 1557419206
		}
	]
}