{
	"next_comment_id": 4,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [calmaquesse](#comment_8_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv): Вы действительно пондяли достаточно важную тему, Леонид. Пожалй, выскажу, что думаю по этому поводу я.\n> Сколько бы редким оно не было, доверие в отношениях между людьми - по сути, в ЛЮБЫХ отношениях - необходимо. Вопрос лишь в уровне доверия, который может различаться. \n> По этой причине именно доверие является самым ценным ресурсом в обществе. Те общества, в которых доверие между членами выше (по данным социологической науки это, если не ошибаюсь, скандинавские страны - около 60% населения считают, что их окружают хорошие люди, которым можно безусловно доверять - для сравнения, по данным социологии в Москве таких всего 1%) более успешны, чем те, в которых оно минимально. \n> Таким образом, сама по себе постановка вопроса \"не доверять никому\" предполагает полную изоляцию от любых посторонних людей, которые в этом сценарии непременно являются источником непредсказуемых угроз. Что, само по себе, действительности не соответствует. Сам факт того, что мы живем в обществе, говорит о том, что оправданное доверие существует. Быть может, его немного - ценный ресурс - но оно несомненно существует.\n\nкак было сказано в одной из серий сериала Mr.Robot: \"..Без доверия людей не обмануть..\" мне кажется, на сегодняшний день самым важным решением проблем взаимоотношения людей - это повышение уровня доверия через оцифровку репутации в целом  - компетенции в частности, а так же возможность использования доверия  без посредника/арбитра/гаранта, а не китайский вариант последних лет с их социальным индексом",
			"post_id": 7,
			"date_added": 1525981969
		},
		{
			"comment_id": 2,
			"body": "мои любимчики из Briar недавно вышли из бета-тестирования и выкатили новую версию своего мессенджера, наслаждайтесь https://sourceforge.net/projects/briar/",
			"post_id": 6,
			"date_added": 1526066397
		},
		{
			"comment_id": 3,
			"body": "Главная проблема анонимности криптовалют заключается в в точке вывода в фиат. Все остальное не существенно, пока ваши фантики находятся в блокчейн-сети. \nВот пример того, как через отслеживание обменных операций накрыли американских барыг: https://www.justice.gov/opa/pr/first-nationwide-undercover-operation-targeting-darknet-vendors-results-arrests-more-35 ",
			"post_id": 8,
			"date_added": 1530350050
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}