{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Linux Manjaro",
			"body": "Cosas que voy descubriendo de este sistema operativo",
			"added": 1484931790
		},
		{
			"topic_id": 2,
			"title": "Linux Antergos",
			"body": "Información y comentarios sobre este sistema operativo",
			"added": 1486590534
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1_1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs": [
			{
				"comment_id": 1,
				"body": "Esta información me vino bien:\n\n \nEn el post anterior les comentaba como fue mi proceso de instalación de Manjaro Linux, pero la cosa no queda nunca ahí, ya que siempre hay cosas por hacer después de instalar un sistema operativo y dejarlo como a uno le gusta. Pero antes, es esencial conocer los comandos básicos, que a diferencia de los que venía utilizando “apt-get, apt, aptitude, etc”, Manjaro al ser una derivada de Arch utiliza los comando “pacman -S, pacman -R, yaourt -S, etc”. Pero para esto hay que entender bien la diferencia de PACMAN, AUR y YAOURT.\n\nPacman\n\nAsí como cualquier distro Gnu/Linux, el software proviene de binarios. Para poder gestionar los binarios en Manjaro (al estar basada en Arch) se utiliza pacman para poder gestionar estos paquetes, es decir instalar, desinstalar, actualizar entre otras tareas. En el caso de una instalación, pacman baja los paquetes de los repositorios de Arch y realiza las tareas necesarias para instalar una aplicación. Los repositorios de Arch se dividen de la siguiente manera:\n\n    Core: Contiene los paquetes esenciales del sistema, como el kernel Linux o las herramientas de GNU.\n    Extra: Contiene paquetes que no son esenciales pero que son importantes como entornos de escritorio y programas.\n    Testing: Un repositorio especial donde se encuentran paquetes en estado de pruebas, que mas tarde se trasladaran a Core o a Extra.\n    Community: Contiene los paquetes del AUR que han sido más votados por la comunidad de usuarios y adoptados por un Trusted User(usuario que el equipo de Arch considera de confianza).\n    Community Testing: Contiene paquetes de AUR en estado de prueba para ser luego transferidos a Community.\n    Multilib: repositorio centralizado para usuarios x86_64, para dar soporte más fácilmente a aplicaciones 32-bit en ambientes 64-bit.\n    Multilib-testing: con paquetes de prueba para multilib.\n\nAUR\n\nAUR (Arch User’s Repository) es mejor conocido como los repositorios de la comunidad, es un servicio que otorga el equipo de arch. Esta pensado para hacer que cualquier persona pueda subir sus paquetes y distribuirlos de forma organizada. Si el paquete es votado y aceptado por un “Trusted User“ pasa directamente al repositorio Community (ver arriba).\nYaourt\n\nYaourt es una complementación de pacman que facilita la gestión de los paquetes AUR. Esta utilidad descarga, compila e instala los paquetes del repositorio AUR.\n\nAhora que ya hemos visto las diferencias de Pacman, AUR y Yaourt podemos pasar al tema de los comando, para ser sincero todavía estoy aprendiendo a manejar este sistema, si me equivoco, le pido a los usuarios mas avanzados con este tipo de distros que sepan entender y me ayuden en los comentarios, serán bien recibidos.\nComando básicos\n\nA continuación les dejo una lista con los comandos que más se utilizan (o por lo menos en mis caso son los más utilizados) después de instalar Manjaro, obviamente antes de cada uno de ellos es necesario poner “sudo” para usarlos como superusuario.\n#Instalar paquetes\n\npacman -S “paquete” #Instala un paquete.\npacman -Sy “paquete” #Sincroniza repositorios e instala el paquete.\n# Actualizar paquetes\n\npacman -Sy #Sincroniza repositorios.\npacman -Syy #Fuerza la sincronización de repositorios incluso para paquetes que parecen actualizados.\npacman -Syu #Sincroniza repositorios y actualiza paquetes.\npacman -Syyu #Fuerza sincronización y actualiza paquetes.\npacman -Su #Actualiza paquetes sin sincronizar repositorios.\n# Buscar paquetes\n\npacman -Ss “paquete” #Busca un paquete.\npacman -Si “paquete” #Muestra información detallada de un paquete.\npacman -Sg “grupo” #Lista los paquetes que pertenecen a un grupo.\npacman -Qs “paquete” #Busca un paquete YA instalado.\npacman -Qi “paquete” #Muestra información detallada de un paquete YA instalado.\npacman -Qdt #Muestra paquetes huérfanos.\n# Eliminar paquetes\n\npacman -R “paquete” #Borra paquete sin sus dependencias.\npacman -Rs “paquete” #Borra paquete y sus dependencias no utilizadas.",
				"added": 1484931872
			},
			{
				"comment_id": 2,
				"body": "¿Qué hacer después de instalar manjaro?\n\nAcá estamos de nuevo, luego de la crónica sobre como llegue a manjaro y la (algo larga pero útil) reseña sobre los comando básicos, vamos a seguir adelante con el post instalación de manjaro, es decir como hacer para instalar aplicaciones/programas. Algo que nunca viene mal si recién vienes aterrizando en estas tierras.\n\nComo modo de guía, me base en la guía sobre post instalación de ubuntu 16.06 que hice hace algún tiempo pero buscando los comandos para manjaro, por suerte en la red podemos encontrar eso sin mayor problema.\n\nLo primero que debemos hacer en Manjaro es actualizar el sistema operativo, pero antes de realizar las actualizaciones, debemos configurar los repositorios para elegir los más rápidos según nuestra ubicación, de esta manera realizaremos más rápido los procesos de actualización e instalación de software, para esto basta con un simple comando en la terminal:\n\nsudo pacman-mirrors -g\n\nActo seguido, nos pedira el password de administrador y nos queda esperar a que termine para, ahora sí, actualizar el sistema.\n\nVamos a actualizar el sistema y los repositorios, en caso de que no lo hayamos hecho recientemente:\n\nsudo pacman -Syu\n\nUna vez actualizado el sistema y los repositorios, nos ponemos manos a la obra:\n\n<<< Diccionario en español para LibreOffice/OpenOffice\n\nEn caso de no contar con el corrector ortográfico en español, es posible agregarlo a mano de la siguiente manera:\n\n    Ir al centro de extensiones de LibreOffice\n    Buscar los diccionarios en español\n    Descargar el diccionario de tu preferencia (el general o el específico de tu país). Con esto ya tendremos un archivo OXT.\n    Abrir LibreOffice/OpenOffice, selecciona Herramientas > Extensiones y hacé clic en Añadir, vamos al directorio donde se encuentra el archivo descargado y lo instalamos.\n\nInstalar códecs, Flash y fuentes adicionales:\n\n<<< Codecs\n\nAl igual que ubuntu o linux mint, en manjaro los codecs propietarios no vienen instalados de forma predeterminados por problemas legales, es por eso que cada usuario debe instalarlo (si así lo desea) para hacer uso de ellos. Abrimos terminal y escribimos:\n\nsudo pacman -S gstreamer0.10-{{bad,good,ugly,base}{,-plugins},ffmpeg}\n\n<<< Flash plugin\n\nsudo pacman -S flashplugin\n\n<<< Fuentes adicionales\n\nPara instalar algunos paquetes de fuentes interesantes, como las fuentes de Microsoft (esenciales para la web), ejecutamos lo siguiente:\n\nsudo pacman -S ttf-ms-fonts ttf-dejavu ttf-bitstream-vera artwiz-fonts\n\n\n<<< Instalar aplicaciones\n\nEn mi caso suelo utilizar mucho la terminal, ya que me he acostumbrado a su uso en Linux mint y lo prefiero porque es más rápido que cargar la ventana de “Pamac” y ejecutar las instalaciones, así que solo dejare los comandos que utilice.\n\n\n<<< Soporte para archivos comprimidos\n\nCon estos componentes podremos descomprimir formatos como .rar o .zip sin problemas. Para instalarlos:\n\nsudo pacman -S rar unrar zip unzip unace sharutils arj\n\n\n<<< Instalar Simple Scan\n\nLo primero que opte por hacer fue instalar Simple Scan ya que con esa aplicación (desde linux mint) podía hacer andar el escáner de la impresora multifunción que tengo, una hp 3515.\nPara esto es necesario instalar la librería que te permite escanear y acto seguido instalar Simple Scan.\n\nsudo pacman -S sane\nsudo pacman -S simple-scan\n\n<<< Google Chrome\n\n¿Que decir que no se haya dicho de este navegador archi conocido?\n\nyaourt -S google-chrome\n\n<<< Skype\n\nYa se que hay opciones libres como Ekiga, pero la verdad aunque nos duela es que lo necesitamos muchas veces por trabajo o por costumbre.\n\nsudo pacman -S skype\n\n\n<<< Soundconverter\n\nEste es un excelente convertidor de audio que lo utilice en un post anterior sobre cómo convertir m4a a mp3, pero no solo sirve para esos formatos, te invito a conocerlo.\n\nsudo pacman -S soundconverter\n\n<<< Clipgrab\n\nEsta aplicación nos permite bajar videos y audio directamente de YouTube, Vimeo, Metacafe, Dailymotion entre otros.\n\nsudo pacman -S clipgrab\n\n<<< Clementine\n\nEste es un reproductor y organizador de biblioteca musical que surgio como fork de Amarok.\n\nsudo pacman -S clementine\n\n<<< JDownloader2\n\nGestor de descarga para servicios de alojamiento como Mega o mediafire, uploaded, etc. Con él podemos acelerar el proceso de descarga.\n\nyaourt -S jdownloader2\n\n<<< Openshot\n\nEditor de vídeo muy completo. Nos da la posibilidad de agregar efectos, sonidos, etc.\n\nsudo pacman -S openshot\n\n<<< Gimp\n\nGimp es un editor de imágenes bastante potente con el que puedes retocar tus fotos sin mayor complicación.\n\nsudo pacman -S gimp\n\n<<< Inkscape\n\nEditor de imágenes vectorial.\n\nsudo pacman -S inkscape\n\n<<< Transmission\n\nsudo pacman -S transmission-gtk\n\n<<< Nylas N1\n\nNylas N1 es un cliente de correo electrónico Open source y multiplataforma. (Versión Pro de pago)\n\nyaourt -S n1\nsudo pacman -S zenity",
				"added": 1484931921
			}
		],
		"7_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 3,
				"body": "Manjaro, of course.  \n(De Arch operating system). Es Rolling Release : )",
				"added": 1484932474
			},
			{
				"comment_id": 4,
				"body": "Me pasé a Antergos : )\nTambién está basada en Arch y es Rolling Release. Es de origen español y está en varios idiomas. Es software libre y de código abierto. Viene mas pelada de programas que Linux Mint después de la instalación, luego la puedes personalizar a tu gusto. Me funciona correctamente y me instaló todos los drives gráficos, de tarjeta de red, sonido etc sin problemas.\nManjaro tiene soporte multi-kernel y otras prestaciones interesantes (sólo me falló en Spotify (resuelto), Clam-Tk, Comodo Antivirus y problemas en la estabilización de la pantalla HDMI-Nvidia). Antergos tiene una relación más directa con Arch. ¿Cuál es mejor? Pues para gustos colores. Manjaro con KDE tiene un escritorio moderno, el de Antergos es más simple pero mejor ordenado (recomiendo Cinnamon; en la instalación puedes elegir entre varios).\nPara usuarios que vengan de Windows, o que como mucho hayan probado Ubuntu o Linux Mint, hay que reconocer que en Manjaro y Antergos no hay un \"centro de descarga de software\" tan visual, con iconos, simple, detallado, con opiniones de usuarios, etc  como los de estos sistemas operativos. Puedes descargar desde Pamac-Manager o Octopi que son estupendos gestores de paquetes, fáciles de utilizar pero poco detallados, ¡hay que conocer el nombre exacto de lo que se quiere instalar!\n(* Existen ciertas aplicaciones que sí tienen una interfaz gráfica más agradable, con información, iconos, etc que nos pueden ayudar, como \"discover\" o similares, pero claro, no es lo más ortodoxo.)\n(Precaución con lo que se instala desde AUR no está verificado su correcto funcionamiento.)\nA veces queremos instalar ciertos programas que no aparecen en los repositorios oficiales de Manjaro o Antergos, cosa no muy recomendable, y si tenemos conocimientos de Ubuntu, Linux Mint o similares esto es muy fácil (los .deb, ...) pero en estos dos la cosa es un poco más complicada ya que hay que prepararlos para su instalación.\nTambién los comandos de la consola o terminal son diferentes de los de Ubuntu o similares.\nQuizá Antergos es mejor para seguridad y Manjaro para estabilidad.",
				"added": 1485022669
			},
			{
				"comment_id": 5,
				"body": "> [facineroso](#comment_4_1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs): Me pasé a Antergos : )También está basada en Arch y es Rolling Release. Es de origen español y está en varios idiomas. Es software libre y de código abierto. Viene mas pelada de programas que Linux Mint después de la instalación, luego la puedes personalizar a tu gusto. Me funciona correctamente y me instaló todos los drives gráficos, de tarjeta de red, sonido etc sin problemas.Manjaro tiene soporte multi-kernel y otras prestaciones interesantes (sólo me falló en Spotify (resuelto), Clam-Tk, Comodo Antivirus y problemas en la estabilización de la pantalla HDMI-Nvidia). Antergos tiene una relación más directa con Arch. ¿Cuál es mejor? Pues para gustos colores. Manjaro con KDE tiene un escritorio moderno, el de Antergos es más simple pero mejor ordenado (recomiendo Cinnamon; en la instalación puedes elegir entre varios).Para usuarios que vengan de Windows, o que como mucho hayan probado Ubuntu o Linux Mint, hay que reconocer que en Manjaro y Antergos no hay un \"centro de descarga de software\" tan visual, con iconos, simple, detallado, con opiniones de usuarios, etc  como los de estos sistemas operativos. Puedes descargar desde Pamac-Manager o Octopi que son estupendos gestores de paquetes, fáciles de utilizar pero poco detallados, ¡hay que conocer el nombre exacto de lo que se quiere instalar!(* Existen ciertas aplicaciones que sí tienen una interfaz gráfica más agradable, con información, iconos, etc que nos pueden ayudar, como \"discover\" o similares, pero claro, no es lo más ortodoxo.)(Precaución con lo que se instala desde AUR no está verificado su correcto funcionamiento.)A veces queremos instalar ciertos programas que no aparecen en los repositorios oficiales de Manjaro o Antergos, cosa no muy recomendable, y si tenemos conocimientos de Ubuntu, Linux Mint o similares esto es muy fácil (los .deb, ...) pero en estos dos la cosa es un poco más complicada ya que hay que prepararlos para su instalación.También los comandos de la consola o terminal son diferentes de los de Ubuntu o similares.Quizá Antergos es mejor para seguridad y Manjaro para estabilidad.\n\nActualización:\n\nAntergos no instala los drivers originales NVIDIA sino unos de software libre, esto me dió problemas en mi tarjeta gráfica en juegos 3D.\nManjaro si permite, durante la instalación, seleccionar drivers propietarios. Aún así la pantalla vibraba en juegos 3D.\nOpenSuse no permite durante la instalación seleccionar  drivers propietarios. Luego gracias a Instalación 1-click es fácil instalar el driver propietario. Con la aplicación llamada \"YaST2-Instalación en un click\" (en mi caso falló, pero no es lo normal : )\nHay otras opciones de instalación de drivers en OpenSuse.\nhttps://es.opensuse.org/SDB:C%C3%B3mo_instalar_el_controlador_gr%C3%A1fico_de_NVIDIA\nMuy bueno el Gestor YaST de OpenSuse, sólo por el ya merece instalar esta distribución, pero no es para usuarios domésticos.\n\nSino te quieres complicar con la instalación de drivers propietario (Nvidia) las mejores son: Ubuntu y Linux Mint. (Esto no es como Windows, te puedes cargar el SO por una mala actualización)\nZorion OS también (pero tiene versiones de pago).\n(StreamOS- sólo sirve para jugar no como sistema operativo genérico).\nSabiendo, se pueden poner en todas las distribuciones Linux, pero si lo haces mal te quedas con una pantalla en negro.",
				"added": 1485355265
			}
		],
		"1_1EPhZoJxikVTvLohs92tqxsqYRT2YmJKFH": [
			{
				"comment_id": 6,
				"body": "La más parecida a los antiguos windows:\nZorin (Free Download)  https://zorinos.com/\nThe 64 bit version is recommended for most computers.\nOlder machines with less than 2GB of RAM may only be compatible with the 32 bit version.\nPara la versión Zorin OS 12 Ultimate piden una donación de €19 pero es la misma que la otra sólo que con más software. (Software que tú manualmente puedes ir instalando y dejarla igual)\n\nLa distribución sencilla para utilizar en tu pc diariamente.\nLinux Mint                   https://linuxmint.com/download.php\nEs algo más diferente que la otra de Windows, aunque esto depende realmente del escritorio (interfaz gráfica que incluye diseño de menús, pestañas, flechas del ratón, etc). Buen soporte y foro con usuarios hispanohablantes para ayudar.\n-------------------------------------------------------\nDicho esto:\nEscritorios de mayor a menor consumo de cpu y ram:\nxfce > mate > gnome > cinnamon > Kde  > Kde Plasma (2gb de ram mínimo)\n\nXFCE:\nSystem requirements:\n512MB RAM (1GB recommended for a comfortable usage).\n9GB of disk space (20GB recommended).\n1024×768 resolution (on lower resolutions, press ALT to drag windows with the mouse if they don’t fit in the screen).\n\nNotes:\nThe 64-bit ISO can boot with BIOS or UEFI.\nThe 32-bit ISO can only boot with BIOS.\nThe 64-bit ISO is recommend for all modern computers (Almost all computers sold in the last 10 years are equipped with 64-bit processors).\n\nTe recomiendo descargar por torrent y comprobar el Hash. Instalar por dvd o pendrive con la aplicación recomendada (suele haber varias y a veces unas funcionan bien con unas distribuciones de Linux y otras con otras).\nDurante la instalación seleccionar Instalar software/drivers/codecs propietarios sino quieres tener problemas especialmente en los juegos 3D",
				"added": 1485893206
			},
			{
				"comment_id": 7,
				"body": "> [cer](#comment_2_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Te recomiendo Lubuntu. Buen soporte para hardware extraño, posiblemente la distro con mas programas y la mayor comunidad.\n\nSí, es ligera y perfecta para ordenadores viejos.",
				"added": 1486324482
			}
		],
		"8_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 8,
				"body": "Vikingos, Juego de tronos, Narcos, Mr. Robot",
				"added": 1486325142
			}
		],
		"8_17pnj2wEu5qFeRtQErmLVtCBvYuocGum82": [
			{
				"comment_id": 9,
				"body": "Creo que ya ha salido la versión estable. Es el más bonito pero el que más consume.",
				"added": 1486325271
			}
		],
		"2_1F2PXhSgvJJvhpJzVmE2eEpgoUbDt4k1gk": [
			{
				"comment_id": 10,
				"body": "Helouuu!!!",
				"added": 1486325397
			}
		],
		"2_1DunM8CUWAxBcf3RWvweEke85AMqhVoTUs": [
			{
				"comment_id": 13,
				"body": "\"Antergos, anteriormente Cinnarch es una distribución GNU/Linux basada en Arch Linux; su creador es Alexandre Filgueira, y es una distro rolling release, la cual es la evolución del proyecto inicial llamado Cinnarch, donde se contaba con el entorno de escritorio Cinnamon por defecto. Antergos da la libertad de elegir a los usuarios entre diferentes entornos de escritorio y montajes.\nEl nombre viene de la palabra en gallego para ancestros, para mostrar que \"muestra un enlace del pasado con el presente\".\n(Wikipedia)\n\nEs un sistema operativo Rolling Release (Liberación continua - se refiere a un sistema de software en constante desarrollo; esto en lugar de un modelo de desarrollo estándar de liberación que utiliza versiones de software que deben reinstalarse sobre la versión anterior). Esta basado en la mejor distribución Linux: Arch.\nEl creador original es un español que ha pasado a ser un pequeño equipo internacional. La distribución se puede instalar en muchos idiomas, y se pueden seleccionar durante la instalación con Cnchi installer hasta 7 escritorios (6 de ellos gráficos), además de otras opciones de personalización. Lamentablemente no permite la instalación de los drivers gráficos propietarios pero esto se puede hacer posteriormente, si sabes y con mucho cuidado : )(Con la versión KDE es casi imprescindible).\nViene con menos software preinstalado que Manjaro pero esto puede ser una ventaja si te gusta personalizarla al máximo. \nEl instalador de programas es pamac (GUI) muy eficiente, ligero y sencillo, aunque siempre se recomienda, a ser posible, instalarlo por yahourt (consola de comandos).\nPuedes instalar LibreOffice (sino viene ya instalado) y todos los demás programas habituales. Antergos bebe directamente de los repositorios de Arch. Por ello siempre está actualizada aunque las rollings releases puedan no ser las más estables.\nSu web tiene un foro en varios idiomas donde suelen responder en pocas horas tus preguntas con profesionalidad.",
				"added": 1486591909
			}
		]
	},
	"comment_vote": {}
}