{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#Isaac Newton: O Último Mágico\nIsaac Newton - um brilhante matemático Racionalista ou um mestre do Ocultismo? Essa biografia inovadora revela um Newton eremita e tirano, um herege e um alquimista. Imagens mágicas se combinam com actores e especialistas para trazer à vida o maior génio científico Britânico em suas próprias palavras.\n\n- https://ok.ru/video/494891305505",
				"added": 1546153566
			},
			{
				"comment_id": 4,
				"body": "#O CÉU DE OUTUBRO\nNo final dos anos 50, o adolescente Homer Hickam (Jake Gyllenhaal) vive em uma cidade onde a mineração é a maior empregadora local. Ao saber que os russos colocaram o satélite Sputnik em órbita, Homer começa a sonhar em também colocar um foguete seu em órbita. Logo ele convence alguns amigos a participarem do projeto e, com o apoio de uma professora, dá início ao projeto que irá mudar sua vida para sempre.\n\n- http://thevid.tv/v/q4fiui4mx4n6aott6oe0/",
				"added": 1546154337
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 2,
				"body": "#Lost\nUm avião cai em uma ilha deserta e logo um grupo de passageiros precisa lutar para sobreviver. Liderados pelo médico Jack Shephard (Matthew Fox) e pelo misterioso John Locke (Terry O'Quinn), eles irão descobrir que o local esconde perigosos segredos. Com o passar do tempo, são reveladas informações sobre o passado dos sobreviventes, como Hugo 'Hurley' Reyes (Jorge Garcia), Sayid Jarrah (Naveen Andrews), Kate Austen (Evangeline Lilly) e James 'Sawyer' Ford (Josh Holloway).\n\n- https://megaseriehd.com/series/lost/",
				"added": 1546153680
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 3,
				"body": "Toda a Escritura é divinamente inspirada, e proveitosa para ensinar, para redargüir, para corrigir, para instruir em justiça;\nPara que o homem de Deus seja perfeito, e perfeitamente instruído para toda a boa obra.\n\n- 2 Timóteo 3:16,17",
				"added": 1546153743
			}
		]
	},
	"comment_vote": {}
}