{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1
	},
	"next_comment_id": 16,
	"comment": {
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 1,
				"body": "#O paradoxo dos buracos negros quânticos - Leonard Susskind\n- https://sci-hub.tw/10.1038/nphys429",
				"added": 1544478654
			},
			{
				"comment_id": 2,
				"body": "#Modelos analógicos de gravidade\n- https://sci-hub.tw/10.12942/lrr-2011-3\n- https://sci-hub.tw/10.1023/A:1020180409214",
				"added": 1544478720
			},
			{
				"comment_id": 3,
				"body": "#Buracos de minhoca atravessáveis com violações de condição de energia arbitrariamente pequenas\n- https://sci-hub.tw/10.1103/physrevlett.90.201102",
				"added": 1544478841
			},
			{
				"comment_id": 4,
				"body": "#Propriedades dos universos em expansão - Stephen Hawking\n- https://doi.org/10.17863/CAM.11283",
				"added": 1544478901
			},
			{
				"comment_id": 9,
				"body": "#Os buracos negros produzem radiação térmica, como esperado em termos teóricos? Será que esta radiação contem informações sobre sua estrutura interna, tal como sugerido pela dualidade Gauge-gravidade, ou não, como implícito no cálculo original de Hawking? Se não, e os buracos negros podem evaporar, o que acontece com as informações armazenadas neles (mecânica quântica não proporciona a destruição da informação)? Ou será que a radiação para em algum ponto de deixar vestígios do buraco negro? Existe outra maneira de sondar a sua estrutura interna, de algum modo, se tal estrutura existe mesmo?\n\n- https://sci-hub.tw/10.1103/PhysRevD.72.084013",
				"added": 1544481111
			},
			{
				"comment_id": 10,
				"body": "#Gravitação semiclássica\n- https://sci-hub.tw/10.1007/3-540-58339-4_19",
				"added": 1544481124
			},
			{
				"comment_id": 11,
				"body": "#Catástrofe do vácuo\n- https://sci-hub.tw/10.1119/1.17850",
				"added": 1544481137
			},
			{
				"comment_id": 12,
				"body": "#Gravidade quântica de loop: uma visão externa\n- https://sci-hub.tw/10.1088/0264-9381/22/19/R01",
				"added": 1544481238
			},
			{
				"comment_id": 13,
				"body": "#Geometria Quântica e suas Aplicações\nEm física teórica, geometria quântica é o conjunto de novos conceitos matemáticos generalizando os conceitos de geometria cujo entendimento é necessário para descrever os fenômenos físicos em distâncias de escala extremamente pequena comparáveis ao comprimento de Planck. Nestas distâncias, a mecânica quântica tem profundo efeito sobre a física e muito mais.\n\n\n- https://web.archive.org/web/20180624232820/http://cgpg.gravity.psu.edu/people/Ashtekar/articles/qgfinal.pdf",
				"added": 1544481462
			},
			{
				"comment_id": 14,
				"body": "#Teoria-M\n- https://sci-hub.tw/10.1103/physrevd.55.5112",
				"added": 1544481702
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 5,
				"body": "#A Teoria De Tudo\nBaseado na biografia de Stephen Hawking, o filme mostra como o jovem astrofísico (Eddie Redmayne) fez descobertas importantes sobre o tempo, além de retratar o seu romance com a aluna de Cambridge Jane Wide (Felicity Jones) e a descoberta de uma doença motora degenerativa quando tinha apenas 21 anos.\n- https://ok.ru/video/290643446288",
				"added": 1544479024
			},
			{
				"comment_id": 15,
				"body": "#HÉRCULES EM NOVA YORK\nHércules (Arnold Schwarzenegger) está cansado da vida no Olimpo, lar dos grandes deuses gregos, e resolve descer à terra para experimentar a vida de um mortal. Vivendo em Nova York, ele se envolve com empresários de luta-livre e encontra um verdadeiro amor. Só que ele vai enfrentar a fúria do seu pai, Zeus, que deseja trazê-lo para casa e castigá-lo por sua desobediencia.\n- https://openload.co/embed/sApybra8n30",
				"added": 1544484978
			}
		]
	},
	"comment_vote": {}
}