{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"2_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": 1
	},
	"next_comment_id": 27,
	"comment": {
		"1_149VTGbqfHkDvZqrsWxSHJ81hqoMNa799J": [
			{
				"comment_id": 1,
				"body": "Думаю, это все не очень надежно, да и шуму много.",
				"added": 1494669088
			},
			{
				"comment_id": 4,
				"body": "> [darktrader](#comment_1_1MhRBhXLcV6iYDAnH1D9CN434ZsABfdAm): А разве банить нельзя в зеронете?\nМожно самостоятельно игнорить кого-либо в пределах всего зеронета для себя, можно банить на своем зайте и можно забанить на уровне регистратора. Но никакого более общего бана  нет.",
				"added": 1494792394
			},
			{
				"comment_id": 6,
				"body": "> [blinkel](#comment_2_146TtiD5mHz4MyBzfsYc4gi2QKQ8jMi1nR): То есть бан в зеронети есть? Если не трудно можете привести пример, я что-то не до конца  понял :)\n\nИгнор есть. Идешь на страницу ID находишь нужный ник и добавляешь в игнор. Его сообщения для тебя будут скрыты на всех зайтах, но только для тебя.\n\nВ пределах зайта, администратор тебя может забанить, внеся ограничения в content.json сайта. Но только на своем сайте, на других это не скажется.\n\nИ последний вариант - регистратор может удалить запись о твоем ID, и тогда это скажется на всех зайтах, где ты пользовался с этим ID. Самое узкое место сейчас, почти везде используется ZeroID.",
				"added": 1494975655
			}
		],
		"1_14cKggGNbHgLq1W4XYs56i2B3KciGwpurk": [
			{
				"comment_id": 2,
				"body": "Надо в зеронет доступ по паспорту, ага.",
				"added": 1494669255
			}
		],
		"1_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": [
			{
				"comment_id": 3,
				"body": "> [hanamemo](#comment_10_149VTGbqfHkDvZqrsWxSHJ81hqoMNa799J): Очень жаль, но лоль нету. Отпишу как найду > billysw: Эх... Излазил ваши вики, а лоль не нашёл... Зачем нужна анонимная платформа, если нельзя фапать на лоль...\nКак ты искал? Да покарает тебя loligod за твою невнимательность. https://0proxy.ml/1CmDyfVXZvUGFfY6cUQagCpkqzazSsBdaP/",
				"added": 1494669590
			}
		],
		"1_1JXr7HXJit5v32121p1bfa9ezhurhc2ZPG": [
			{
				"comment_id": 5,
				"body": "допустим",
				"added": 1494876287
			},
			{
				"comment_id": 9,
				"body": "вот зероконфа в зеронет https://0proxy.ml/1E6iPAg5TRRKRKd2sr2fzhuvkH58DXiDeY/",
				"added": 1495132394
			}
		],
		"1_1BGconZDFECxudsuKsBnkXpX1iqKbUWMku": [
			{
				"comment_id": 7,
				"body": ">Проблема в том, что тут всю планету менять надо. «Остановите Землю, я сойду…»\n\nВот пожалуй чего не надо, это не надо нытья. Мы живем в довольно интересное время заката интернета в его текущем виде. Время сетевого нейтралитета подходит к концу, но мы уже довольно избалованы этим периодом. Но нужно понимать, что так получилось случайно, никто не делал для нас такой интернет и не собирался, и тем более не мы его таким сделали. Так же, не кто не будет для нас его защищать от нападок государств и иных сил. \n\nВот если взять такое сравнение: здания разрушаются под влиянием факторов окружающей среды, кроме того, могут происходить явления вроде землетрясений, что ускоряют процессы. Но мы же не обижаемся на природу, на такое положение вещей. Мы просто принимаем это как данное, и то что здания разрушаются со временем — это несколько не угнетает людей. Так же и с интернетом. Видна его деградация, и можно увидеть каких-то конкретных лиц стоящих за этим. Но не стоит сильно концентрировать внимание на лиц в этом участвующих. Это те же самые слепые силы природы. Нет никакого глобального координатора действий по уничтожению интернета или стороны, которая от этого что-то получит. Люди стремятся контролировать, это часть человеческой природы. Это может каждый наблюдать даже ограничившись только своей жизнью. Чем больше у человека власти, тем больше простирается его влияние. И если какой-то сегмент интернета будет подвержен влиянию, он под него попадет в конце-концов. И в бездействии все будет только хуже со временем.\n\nЕсли такое воздействие на интернет нас и огорчает, то это потому-что он достался нам в готовом виде. Это потребительский подход. Почему, без усилий с нашей стороны, для нас что-то должно оставаться таким как было. Довольно глупо на это надеяться. Но разве сейчас нет технических средств противостоять цензуре? Они есть. Да, они не очень удобные, но они такие, какие мы создали. Или кто-то их должен был сделать для нас? Государства? Государства должны разрабатывать неподконтрольные им системы? Или может компании, монетизирующие активность пользователей в сети и рекламу. \n\nЯ нахожу [эти](https://youtu.be/B8Kb_n2_HcY?t=2138) слова Илона Маска очень мотивирующими, если заменить \"Возобновляемая энергетика\" на \"децентрализованные сервисы\". Да, будущее за децентрализованными системами, но от участия или неучастия зависит время, через которое это будущее придет. Ждать — это не лучший способ его приблизить.\n\nДаже тор — уже значительный инструмент для защиты сетевого нейтралитета. Закроют границы? Пользователей одной страны все равно достаточно много, чтобы поддерживать значительную и богатую контентом сеть. Даже только при наличии off-grid сетей с использованием wifi и bluetooth, все равно, в плане качества связи, ситуация будет лучше чем всего несколько десятилетий назад. Будет доступно не 1 млн книг, а только 100 тыс? Это действительно такая большая разница? Не будет информации о каких-то событиях в мире? Все равно нет ничего значимее научных открытий, которые несмотря на полную доступность довольно долго проникают в сознание масс. \n\nВот что действительно вредно, так это оказываться под влиянием информационной манипуляции, того, что формирует сознание и искажает восприятие окружающей действительности. И если ради удобства продолжаем пользоваться преимущественно такими площадками, при наличии защищенных альтернатив, то какое-то нытье выглядит не только бессмысленным, но и лицемерным.",
				"added": 1495049168
			},
			{
				"comment_id": 10,
				"body": ">в интересное время\nпросто акцентировал внимание на том моменте времени, когда интернет уже начал испытывать его влияние и вовсе оказался не такой свободной сетью, а новая волна устойчивых сервисов ещё не пришла. Конечно не что-то уникальное, и дальше так будет. Но может показаться, что вот прям все и дальше только упадок. Да, упадок, но это все уже предвидели раньше.  И то что оно сейчас ударило, кто виноват что массы не прислушивались к предупреждениям, глупо надеясь что ничего плохого не произойдет, а теперь сплошь завозмущались. \n\n>И в формировании Рунета в определённой степени принимал непосредственное участие с 1997-го.\n\nПринимать участие можно по-разному. Но хорошо, теперь я знаю кого винить в отсутствии шифрования и луковичной маршрутизации повсеместно на сетевом уровне :)\n\n>RetroShare/SSB Patchwork\nА вот и нет. Они больше ориентированы на F2F, последний вообще исключает какие-то точки воздействия одних людей на других.",
				"added": 1495157165
			},
			{
				"comment_id": 26,
				"body": "> [floppydrive0](#comment_2_1MREdcZdDjmPyVL8YH53wPfzjc6FX9aJ8b): Ну всё народ, разбегайтесь :)\n\nОй всё, боюсь.",
				"added": 1496951016
			}
		],
		"1_1KGjw62VbKqGtehKJ1MA6cF6s8KmAQY8ha": [
			{
				"comment_id": 8,
				"body": "Нет никаких пиров. все эти 16 — это те, кто ткнулся туда в надежде получить зайт.",
				"added": 1495097191
			}
		],
		"1_1Anoh6Rexrn9FDhBgntUXUx3CYatV2LPZY": [
			{
				"comment_id": 11,
				"body": "говнопиар скама",
				"added": 1495434626
			},
			{
				"comment_id": 12,
				"body": "> [quir](#comment_12_1Atfgt7nWJaiJZzjRiTwgoPTK24qS6uz2h): А чем Wire плох?\n\n1. Установить защищенное соединение через централизованный сервер без сверки ключей? Они видимо как-то по своему понимают слово защищенный.\n2. Не нашел кнопочки Pricing. Кто там танцует все, даже если предположить то что он и вправду защищенный.\n3. ToS.\n4. Долго сервис с такими условиями существовать не сможет. Так как сервис централизованный, целью является привлечение пользователей, после чего будут менять ToS, и не в сторону угодную пользователям. \n5. Сырая веб-поделка, безопасность пока весьма условна. Вставки внешнего контента, например с ютуба. Может привести к утечке IP через правильную ссылку.",
				"added": 1495459314
			},
			{
				"comment_id": 24,
				"body": "Но пожалуй стоит уходить от сервисов. Даже тех, что в настоящий момент и удовлетворительные.",
				"added": 1496441396
			}
		],
		"4_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf": [
			{
				"comment_id": 13,
				"body": "> [azriel](#comment_4_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv): что это такое?\n\nhttps://www.linux.org.ru/forum/talks/13356365#comments",
				"added": 1495474807
			}
		],
		"2_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 14,
				"body": "Злую Таню смотри. Вот.",
				"added": 1495895081
			},
			{
				"comment_id": 17,
				"body": "Эти названия я знаю (не все). Твое имя очень стараюсь не смотреть и ждать появления в хорошем качестве. Тут как-раз официальный перевод новеллы на английский появился, надо бы почитать.",
				"added": 1495997996
			},
			{
				"comment_id": 19,
				"body": "> [kodomoneko](#comment_2_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9): А, кстати, смотрю сейчас \"из нового мира\", советую. А ты чего кроме злой Тани  скажешь?(Анилибрия топ)\n\nShinsekai Yori одно из самых любимых. Психопаспорт ещё (только там есть момент про тор, но не про зеронет). Странно, что такая хорошая антиутопия с аллюзиями на современность при отличной графике и обилии шок-контента и вообще всяких красивостей обходится стороной. ",
				"added": 1496007967
			}
		],
		"4_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 15,
				"body": "Беспредел порождает власть.",
				"added": 1495896403
			},
			{
				"comment_id": 16,
				"body": "> [azriel](#comment_9_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv): давайте станем властью!\n\nДавайте. Только нас потом казнят.",
				"added": 1495919441
			}
		],
		"5_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 18,
				"body": "Есть один способ, не проверенный. Проверю, отпишусь если рабочий.\n\n>боюсь боли\nА вот это плохо. Для меня всегда это проверка осознанности поступка. Боль имеет смысл только как средство сохранения жизни, и если человек действительно всё, то боль не должна пугать. Нет, я конечно не к чему не призываю, это больше требование к самому себе. Хотя и отговариваю, в какой-то степени, да. Суицидники же в основном хорошие люди (кроме позеров), наоборот тех других нужно убивать, которые имеют наглость хотеть жить. Да и вообще, суицид — явление больше социальное и альтруистическое, может порой стоит забивать на мнение людей и действовать только в личных интересах, по крайней мере не в интересах ближнего окружения. Расширять круг общения стоит, потому-что в узких сообществах, ~~вроде зеронетовского~~, обычно сплошная чернуха и безысходность, и вообще страшные вещи творятся.\n\nНо опять же, извиняюсь за попытку на что-то повлиять, действуй на свое усмотрение. Я просто люблю вставить ИМХО, где не следует.",
				"added": 1495999050
			},
			{
				"comment_id": 20,
				"body": "> [kodomoneko](#comment_1_1LnS3n9i1bx5FLKgVCXR9cvRJzGxDfByg9): Я потерял аккаунт hanamemo когда форматнул телефон прежде чем взорвать петарды на шее.\n\nА я говорил, что петарды не тема. Сразу надо было делать вдоль. И вообще облиться бензином предварительно и делать все вдали от воды.",
				"added": 1496008292
			}
		],
		"1_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi": [
			{
				"comment_id": 21,
				"body": "https://bits.media/news/rost-kapitala-fonda-efiriuma-sdelal-ego-bogateyshey-blokcheyn-kompaniey-v-mire/",
				"added": 1496043606
			}
		],
		"1_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 22,
				"body": "Ваш нереален, мой реален. Вот.",
				"added": 1496441070
			}
		],
		"2_1MtHivMhw3meNqxTrQbunuQAEfi73JZbhw": [
			{
				"comment_id": 23,
				"body": "> [azriel](#comment_21_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv): да хули вы такие скучные............................................................................................................................................\n\nЧтобы тебя позлить. Фан без причины уныл, а значимых причин в этом мире нет. Смирись.",
				"added": 1496441258
			}
		],
		"1_1DBfLoawZi3AW5fTJ4yDo9rtpcZsQ2h828": [
			{
				"comment_id": 25,
				"body": ">получается по сути проекты делают одно дело, но в обном реализованно лучше одно, а в другом - другое\nНет. IPFS — это только P2P файлообмен и перманентная адресация. ZN ничего особого в этом плане не представляет.\n\n>вот думаю не соль.тсяли эти 2 проеката?\nНе сольются. На IPFS завязано довольно много проектов в разработке. Нет никакой необходимости сливаться именно с ZN, да и вообще с чем-либо.",
				"added": 1496937392
			}
		]
	},
	"comment_vote": {
		"1_12LouRw6UdUKP6W5r1uezDiEJd1w1MfcXe": 1
	}
}