{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Массовый взлом FirstVDS",
			"body": "https://geektimes.ru/post/280688",
			"added": 1474485027
		},
		{
			"topic_id": 2,
			"title": "Как настроить админа на ноде.",
			"body": "Сервер работает с плагином Мультюзер, как наделить одного юзера правами на управление сайтами?",
			"added": 1552386057
		}
	],
	"topic_vote": {},
	"next_comment_id": 16,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Не понимаю как перевести zeroid.bit логин...",
				"added": 1455828884
			},
			{
				"comment_id": 2,
				"body": "Разобрался. Надо ввести master_seed. Теперь прокси в сеть не шарит как я понимаю. А ещё подрезал себе красивый ник )",
				"added": 1455829183
			},
			{
				"comment_id": 3,
				"body": "> [nippletwister](#comment_149_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): http://127.0.0.1:43110/1K5CGPwisBNFoWRThY9ZLfeJVqN757aLkeПоследние два вопроса.\n\nАга, так и сделал. Теперь полноценная быстрая русская (московская) прокся есть.",
				"added": 1455829415
			},
			{
				"comment_id": 4,
				"body": "@shift тут очень крутые прокси, твистеру этого не хватает",
				"added": 1455829636
			},
			{
				"comment_id": 5,
				"body": "Сижу на dev и не думаю слезать с неё. У меня чаше бывает наоборот, когда в дев быстро правят баги, а коллеги на стабильной или бете мучаются.",
				"added": 1455947037
			},
			{
				"comment_id": 6,
				"body": "> [nippletwister](#comment_163_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): А напомни адрес твоей прокси, я её в FAQ добавлю.\n\n[Прокся](http://wrewolf.com:43110)",
				"added": 1456230857
			}
		],
		"4_15de5wZ71q8iQGhEmBkJnRKx37Defn5XoL": [
			{
				"comment_id": 7,
				"body": "да ладно, толпами на международные эвенты собираются.\nА уж про упорков которые прошли московскую бьюти дважды я молчу )",
				"added": 1510734371
			},
			{
				"comment_id": 11,
				"body": "> [balancer73](#comment_222_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Это ничтожно от того количество, которое могло бы играть :) Потенциал этой игры при грамотной реализации — миллионы, если не сотни миллионов пользователей.\n\nС другой стороны сообщество игроков более дружное",
				"added": 1510741687
			}
		],
		"3_185VocY2UzPnrNaMJnWTob2VvFLpRkrVCv": [
			{
				"comment_id": 8,
				"body": "> [balancer73](#comment_216_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Тогда сразу в отстой. Блокчейновые мессенджеры при активном использовании сообществом жрут память как грязь. Что Twister, что Bitmessage уже малоюзабельны. У первого сам блокчейн уже гик весит, второй просто ресурсов жрёт как не в себя при долгой работе, хотя блокчейн пока относительно небольшой из-за малой популярности.\n\nНу твистером пользуюсь с практически с первых версий. Одно время даже собирал сборки для винды. Но идеально он для меня как серверное решение на моём сервере. И доступ к нему по паролю. Трафика в месяц прокачивает порядка 100Гб.",
				"added": 1510734561
			},
			{
				"comment_id": 9,
				"body": "А про телеграмм, то там \"безопасны\" только секретный чаты, но это по сути равносильно безопасности WhatsApp в обычных чатах (при условии отключения авто-бекапа переписки в облако)\n\nTox хорошо, но насколько я знаю проблема переноса аккаунта стоит до сих пор.\n\nА тут есть люди из Retroshare?",
				"added": 1510734715
			},
			{
				"comment_id": 10,
				"body": "Оно крашит не зависимо от релизов. Бывают которые не крашат, бывает которые почти не текут )\nНо в целом там полезное только a'la IRC чатик",
				"added": 1510741606
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_224_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Чатиков полно разных, в том числе и анонимных :)\n> У RS киллер-фича — анонимный обмен файлами и коллекциями. Но из-за особенностей реализации (падучесть, невозможность работать на безголовом сервере) киллерфича никак не выстреливает, по крайней мере у меня :)\n\nна безголовом успешно работает. есть веб интерфейс достаточный для чатиков и настроить связи со всеми нужными сертификатами. а вот падучесть да, только в цикле запускать, но потом гемор с вводом пароля сертификата запуска",
				"added": 1510832677
			},
			{
				"comment_id": 14,
				"body": "> [balancer73](#comment_225_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Чатики — это не работа :) Работа — это хотя бы файлы и форумы.\n\nскачивать файлы можно было и в первой версии версии веб интерфейса, чаты появились много позже.",
				"added": 1511172711
			},
			{
				"comment_id": 15,
				"body": "> [balancer73](#comment_226_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Раздавать файлы и форумы можно?\n\nскачанные раздаются, а вот индексирует ли nogui клиент папку загрузки не проверял, думаю индексирует.\nПро форумы не могу сказать, не пользуюсь. Они в обычном то клиенте у меня тупят (мало коннектов).",
				"added": 1511190683
			}
		],
		"1_1BghwqwD4SJaigm7kQjxvgTyEdxZgzWhSS": [
			{
				"comment_id": 13,
				"body": "Веб и Android дев\nКвадрокоптеры и всё что с ними связано\nSlackline",
				"added": 1510832789
			}
		]
	},
	"comment_vote": {}
}