{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "LoliGuide - A Brief Guide into The World of Lolicon",
			"body": "http://127.0.0.1:43110/1LoLis8K1kohYduZuwsFc1wt3PFsbZMMUn/",
			"added": 1514010866
		},
		{
			"topic_id": 2,
			"title": "nekololi's GalleryHub",
			"body": "http://127.0.0.1:43110/1Nekos4fiBqfcazyG1bAxdBT5oBvA76Zmo/",
			"added": 1532902442
		}
	],
	"topic_vote": {
		"1_1BNmjz9tBLY3M1tq2z7DKvA1LjFXYsmLd9": 1,
		"3_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1
	},
	"next_comment_id": 12,
	"comment": {
		"30_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "its really pathetic how some autistic screeching is enough to scare someone to remove a site from their list of sites they personally enjoy",
				"added": 1487036824
			},
			{
				"comment_id": 2,
				"body": "*bloop*",
				"added": 1487037112
			},
			{
				"comment_id": 3,
				"body": "i can't be held accountable for the itchy mouse fingers of others! but don't worry, if there's a loli video site i'm going to sperg and link it without telling people what it is.\n\nthat is the reason why i have made my way to this strange new network. spreading loli and good tidings is my purpose in life and i aim to at least put in a minimum amount of effort.\n\nthank you again for your expressions of gratitude and for following the link! have a pleasant day!",
				"added": 1487436829
			},
			{
				"comment_id": 4,
				"body": "> [loligod](#comment_9_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp): nekololi I don't agree with this. Don't link to my sites without marking it appropriately. Most of them are adult in nature and should be marked as such.\n\no-okay boss",
				"added": 1487552848
			}
		],
		"2_1Hv2SAkcMHkNRHTsdLZ6jg8neGtCZrTEr2": [
			{
				"comment_id": 5,
				"body": "a lot of the ideas expressed in this site have no basis in fact or reality and are not very coherently conveyed. no discussion of morality takes place, either, so it really is just a bunch of bad information, some of which i'm convinced the site owner just came up with on his own while he sat in his armchair. he is clearly not well versed in the topic he purports to teach others about. if one is interested to learn more about pedophilia it would be better to just ask a pedophile and dig through the bias.",
				"added": 1513961583
			},
			{
				"comment_id": 6,
				"body": "like i stated, the author does not seem to know what he's talking about. he states things like \"Pedophilia as explaind in the definitions section of this page is sexual attraction to prepubescents. This is defiened as a mental disorder.\" and then goes on to say \"Pedophilia in my eyes can be either illegal or legal.\"\n\n\nIn a first world nation with any semblance of human rights, having a mental disorder, or having a sexual attraction to something simply can't be illegal, so if pedophilia can be \"legal or illegal\" then it's very difficult to understand what the author thinks pedophilia is.\n\n\nis it a sexual attraction to children?\nis it expressing to other individuals one's sexual attraction to children?\nis it the act of an adult having sexual contact with children?\nis it the act of viewing possessing child pornography?\n\n\nwithout a clear, consistent definition, you can't say whether something is moral or immoral, legal or illegal, right or wrong. without that definition, it's not really possible to have a conversation or a debate about anything.",
				"added": 1514082181
			},
			{
				"comment_id": 7,
				"body": "> [missesrobot](#comment_2_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB): It shouldn't be illegal to be a pedophile. It should remain illegal for adults to engage in sexual acts with children under 16.\n\nthank you. that's an important distinction to make. i just wish the person purporting to educate others on such a difficult, nuanced subject would take as much care.",
				"added": 1514083197
			}
		],
		"1_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 8,
				"body": "no sickness here. only pure love. thank you for your compliments!",
				"added": 1516466454
			}
		],
		"2_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": [
			{
				"comment_id": 9,
				"body": "contains lolicon. i must have forgotten to put this here when i started it. please enjoy!",
				"added": 1532902502
			}
		],
		"1538246564_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 10,
				"body": "your site doesn't seem to function when i block requests to your clearnet-hosted bitcoin miner. you might want to tinker with your code a bit more.",
				"added": 1538255017
			}
		],
		"1599589629_1HWmMKD3nNGY9bRJq5yZ8sRVcvPbtgzbRw": [
			{
				"comment_id": 11,
				"body": "ok but you have to pay me first and then i'll hack it later when i feel like it.",
				"added": 1599601237
			}
		]
	},
	"comment_vote": {
		"2_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1
	}
}