{"cert_user_id": "jsxof@github", "next_comment_id": 7, "comment": {"1604067608_mirrored_ZeroNetTickBot_github": [{"comment_id": 1, "body": "@TheBlackBearEatsYou Doesn't this vote apply to previous contributors though? Also, I think that your contribution is too small to be considered copyrightable, making the whole situation a bit similiar to the \"Is hello world copyrightable\" problem.\r\n\r\nBy the way, I think you didn't state what happens to new contributions. I believe it'd be great to avoid that problem by stating that new contributions can be relicensed (?) because that might impose some problems here.", "added": 1576583618, "modified": 1576583618, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566575333", "source_type": "github"}, {"comment_id": 2, "body": "After reading through your discussion, I'd like to point out some facts. To begin with - no, that MIME type detection code isn't copyrightable, as although it has the exact same idea, it has a different form.\r\n\r\n> Copyright does not cover ideas and information themselves, only the form or manner in which they are expressed. For example, the copyright to a Mickey Mouse cartoon restricts others from making copies of the cartoon or creating derivative works based on Disney's particular anthropomorphic mouse, but does not prohibit the creation of other works about anthropomorphic mice in general.\r\n\r\n~ Wikipedia", "added": 1576584157, "modified": 1576584173, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566579449", "source_type": "github"}, {"comment_id": 3, "body": "@copyrightable There have been many cases where someone tried to copyright code as small as \"Hello World\" and failed to do so, due to the problem I've described.\r\n\r\nBy the way, I'd personally recommend to report @copyrightable @TheBlackBearEatsYou and @freesoftwareforall , because these accounts seem to belong to the same person and stylographic analysis clearly indicates it.\r\n\r\nI'll try to contact someone with more experience in this matter now to confirm my suspicions.", "added": 1576584896, "modified": 1576585056, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566584924", "source_type": "github"}, {"comment_id": 4, "body": "@copyrightable  By excluding a particular problematic part of code from collective work, copyright placed upon it no longer functions in your copy, even if you replicate its functionality with your own code.\r\n\r\nIf you want real-life examples - the 4.3BSD licensing case exactly expresses that. AT&T showed that they infringe copyright laws by including proprietary software, so they removed it altogether and rewrote it from scratch, just basing on idea of that code.", "added": 1576585777, "modified": 1576585777, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566591366", "source_type": "github"}, {"comment_id": 5, "body": "@copyrightable First of all, I don't know who you're referring to, but although my github account has been made quite recently, my email address and other accounts are a lot older than that. I've had a github account with my real name some time ago, but I abandoned it in 2017 for the same reason why others don't wish to talk with you - some users harassing other users for the sole purpose of pushing through changes.\r\n\r\nSecond - read what I just said, because you didn't understand it. We can't relicense your portion of code, but we can remove it, and 4.3BSD licensing case explicitely indicates that.\r\n\r\nThird - Try to lower your tone. No one's going to take you seriously if your idea of discussion is that you're 100% right and there's no place for change.", "added": 1576586072, "modified": 1576586107, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566593603", "source_type": "github"}, {"comment_id": 6, "body": "@copyrightable It's still either GPLV2 licensed or under no license. Again, please read about the 4.3BSD case.\r\n\r\nI believe it's the right time to leave this discussion for some time, since now I'm getting personal attacks in other places from @copyrightable for just asking about a few simple things. I'll report his other accounts though, and I urge you to do so too.", "added": 1576586932, "modified": 1576586932, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/2273#issuecomment-566600169", "source_type": "github"}]}}