{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1580338543,
			"title": "Dericious (yup - pretty bad)",
			"body": "http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/data/users/15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi/src/80ae8606330d2268239f11aefc2120287328eef5.jpg",
			"added": 1580338542
		},
		{
			"topic_id": 1580432007,
			"title": "Citizen Journalist Exposes The Brutal Truth: China Is Losing The Battle In Wuhan",
			"body": "https://www.zerohedge.com/geopolitical/citizen-journalist-exposes-brutal-truth-china-losing-battle-wuhan\n\nThe virus has been downplayed here, yet the death toll in China keeps climbing. Wonder if we'll ever know the truth? In a fashion timely enough so we can take whatever precautions are available.",
			"added": 1580432005
		}
	],
	"topic_vote": {},
	"next_comment_id": 18,
	"comment": {
		"1580136283_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "I fear you are correct. While I like the idea of cryptocurrency and it's separation from governments, it's just to abstract...too far removed from the physical world of value.\n\nUnderstand that scarce materials have their \"store of value\" problems too - but that's as good as it gets.",
				"added": 1580139399
			},
			{
				"comment_id": 2,
				"body": "> [thorburn](#comment_33_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): It doesn't get much more abstract than the current banking system. Most people are already happy accepting zeros and ones in the digital realm as a cash replacement. Most people have no real concept of what Money is or how it's created etc. To add to the problem there are now two generations of people who have had virtually no experience of dealing with real tangible cash fiat or otherwise. They have been trained to deal with electronic payments, vouchers and tokens of one sort or another. Their concept of ownership has also been distorted...Steam for example removes the ownership of real tangible goods in the form of a boxed game that you can sell and loan etc. like you would a physical book. [...]\n\nPoint made. But when you read the accounts from Argentina...the takeaway is \"strong currency & low value precious metals\". No one discusses digital currencies...\n\nUltimately the only real store of value is sturdy shelter no one can take from you, extensive food stores, and enough other supplies so you can wait things out until \"spring\" comes again.\n\nHave a feeling weapons and ammunition would hold their value too.",
				"added": 1580150169
			}
		],
		"1580186317_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 3,
				"body": "Dunno...sounds like more \"monkeys throwing feces on the internet\" :(",
				"added": 1580188145
			}
		],
		"1580225894_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u": [
			{
				"comment_id": 4,
				"body": "Hurts everyone. Pushback is long overdue.",
				"added": 1580228818
			}
		],
		"1580225807_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u": [
			{
				"comment_id": 5,
				"body": "Watched a video last night from 1979. Leonard Nemoy narrating how the coming ice age would soon overwhelm us since glaciers in Canada were on the move.\n\nOur current cult may be as flawed as the cult of '79, or the poor measurement quality these conclusions depend on. There are only 20ea calibrated weather stations in the United States.\n\nhttps://en.wikipedia.org/wiki/Fooled_by_Randomness",
				"added": 1580229164
			}
		],
		"1580270036_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 6,
				"body": "Just what is the malfunction of these politicians who believe otherwise? If you had a corporate CEO handing out shares and diluting ownership - that guy would be hanging so fast journo heads would spin.\n\nCITIZENS should take it very personal when politicians import immigrants. Their rationales are garbage, and the karma they deserve extreme.",
				"added": 1580335411
			}
		],
		"1580261433_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u": [
			{
				"comment_id": 7,
				"body": "It's not a big secret. California is just a big open prison run for the benefit of state employees. Bloated payroll, bloated salaries, bloated pensions. High taxes for everyone else. Their cokehead government is a bottomless pit.",
				"added": 1580335697
			}
		],
		"1580240024_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": [
			{
				"comment_id": 8,
				"body": "Didn't watch, but this concept is funny as hell.",
				"added": 1580335778
			}
		],
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "Zeronet was a serious effort. Might be difficult to top it.",
				"added": 1580335874
			},
			{
				"comment_id": 13,
				"body": "> [ranshit](#comment_78_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Attack attempt or popularity spike? :)\n\nHe's currently under threat for a DCMA takedown request sent to Youtube. It's getting to the point where ANYTHING under threat of censorship is wisked away to ZeroNet. \n\nNow, no one can take him down. Checkmate Google. You don't matter any more.",
				"added": 1580601087
			},
			{
				"comment_id": 14,
				"body": "> [ranshit](#comment_74_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): What scared poor pitiful souls.  [...]\n\nI agree with your sentiments totally. What a bunch of fraidy cats we've become.",
				"added": 1580601149
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_661_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Quantumkitty, the tone of your post suggests it's a foregone conclusion that ZeroNet is about to die.  I am not leaving, and I don't see something better to go to.  I expect ZeroNet to be around for a while more, perhaps years and years.\n\n(shrug) Investing more and more into it. Won't be long before I grab another 10 or 14TB drive and this time assign it to Zeronet seeding. Don't know if SciHub would fit on a drive that size, but if someone does the work setting it up - least I could do is seed it.\n\nThere was a big stink last epidemic when information was witheld. They are trying to rectify this time around via cleanet bitorrent. But that always puts people at risk to these DCMA clowns - so it's not a long term solution. Zeronet is.",
				"added": 1580693700
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 10,
				"body": "Here's the problem with this theory. All of us have contact with government. Governments are parasitic organisms which rigorously select for the least capable.\n\nGiven that the CCP has been in power so long - it's doubtful such sinister competence exists among them. \n\nThe CCP is a diseased old whore waiting for it's thrashing by Chinese citizens..... They have bigger problems tan spreading epidemics which would be their doom.",
				"added": 1580403198
			}
		],
		"1580253527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 11,
				"body": "Delta Chat looks very interesting.",
				"added": 1580422172
			}
		],
		"1580422438_1LyfppYhaZN1PyhrN6TM8hTkEX6BHMBX6u": [
			{
				"comment_id": 12,
				"body": "Changed that channel long ago. Both parties are intensely hated here. If you think Trump is worse than the Dems - you can vote against him.\n\nOtherwise please STFU.\n\nIf you REALLY wanted to please citizens - throw a party. Let us hold every Congressman and Senator under water until they breath no more. Then start anew with a limit of 1 term.\n\nThey turn into slime quickly once they are sent to Washington. Haven't witnessed a single exception.",
				"added": 1580426664
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 15,
				"body": "> [aspidochelone](#comment_347_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): The number one thing to miss is the crowd on Usenet.  I mean, those forums were HIGHLY ACTIVE and while there were some censors skulking around with \"forged cancels\" even then, they were late to the party.  If ANYONE ON EARTH had been willing to do necessary technical upgrades to that forum - basic, basic shit like excluding posts cross-posted to more than two newsgroups from servers, opposing those attempts to censor, while finding and condensing duplicated postings - we could have kept swine like Facebook and Reddit at bay for another decade.\n\nAgreed, and many of those people had solid/specific expertise they were willing to share.\n\nUsenet was really, really good for problem solving.",
				"added": 1580611713
			},
			{
				"comment_id": 16,
				"body": "> [anonymouslogin](#comment_81_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I miss the widespread freedom of speech that existed in the beginning.\n\nAgreed. Now seems that federal workers have discovered a new way to get paid - by censoring everyone else. Our new parasitic overlords. Nothing to do - but paychecks to collect.......",
				"added": 1580674183
			}
		]
	},
	"comment_vote": {
		"81_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	}
}