{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1541148554,
			"title": "Kunterbunt",
			"body": "Just created (by cloning) this blog: http://127.0.0.1:43110/18SUBtcYrBuCKBAnDzaMResafL2JeD2hhQ/?Home",
			"added": 1541148553
		},
		{
			"topic_id": 1542892944,
			"title": "Maybe anybody can help with a Zeronet blog problem",
			"body": "* I had cloned a blog and called it Kunterbunt\n* Some days later I experienced trojan infection from an external Zeronet site which I could not get rid of.\n* So I saved my users.json file and erased all zeronet folders and re-installed Zeronet\n* Then I copied my saved users.json fild back to the new folders\n* Since then I cannot edit my blog Kunterbunt\n* And: from another computer at home I can access Kunterbunt and can add new entries to the blog.\n* But: Although I clicked on Kunterbunt \"update\" on both computers I cannot see the new blog entry on the computer where I re-installed Zeronet: http://127.0.0.1:43110/18SUBtcYrBuCKBAnDzaMResafL2JeD2hhQ/?Post:12:Schnell+mal+ein+Buch+schreiben:+NaNoWriMo\n* What am I doing wrong?",
			"added": 1542892942
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1523121756_1AYaudumvgqdyrJs42jyAG9FUUmGHsoiFh": [
			{
				"comment_id": 1,
				"body": "Repair Café: https://repaircafe.org/de/",
				"added": 1523204935
			},
			{
				"comment_id": 2,
				"body": "> [wabbe](#comment_1_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj): Repair Café: https://repaircafe.org/de/\n\nhttp://kaputt.ga/",
				"added": 1523205004
			}
		],
		"1525079754_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 3,
				"body": "Ho jes, ankaŭ Esperantistoj estas  ĉi tie :-)",
				"added": 1525080815
			}
		],
		"1535213599_1CF7NrguXy6cEycDkSRd3CUFekLurYZpor": [
			{
				"comment_id": 4,
				"body": "> [eibriel](#comment_68_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Since gods existence is a matter of faith. And faith does not require rationale.And you cant contradict a non rationale believe with rationality.Then any answer to your inquiry will be based on faith. [...]\n\nQuite right. What we need instead is a discussion about how believers and nonbelievers can coexist. Look e.g. at the blog posts between Andrew Murtagh and Adam Lee.",
				"added": 1535265179
			}
		],
		"1539101626_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 5,
				"body": "It needs a lot of work still to develop nice apps for Solid. Let's do it.",
				"added": 1539148665
			},
			{
				"comment_id": 6,
				"body": "> [shibeotp](#comment_3_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): It needs a lot of time to be SOLID xD\n\n. . .  and enough of knowhow . . .",
				"added": 1539157502
			},
			{
				"comment_id": 7,
				"body": "> [shibeotp](#comment_5_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): I would prefer to have the possibility to have my data in a server at home,\n\nNo problem I think. You can install your own POD server at home.",
				"added": 1539185279
			},
			{
				"comment_id": 8,
				"body": "> [ornataweaver](#comment_21_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Thank you for introducing it. https://www.inrupt.com/blog/one-small-step-for-the-web\n\nThere you can chat with Tim Berners-Lee and his fellows about the idea and how to have a first try on Solid: https://gitter.im/solid/chat",
				"added": 1539325084
			}
		],
		"1540357812_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 9,
				"body": "Then please have a look at a project which tries to remedy this: https://solid.mit.edu/",
				"added": 1540378987
			}
		],
		"1540443278_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 10,
				"body": "The Solid Project from Tim Berners-Lee tries to build another structure: https://solid.mit.edu/",
				"added": 1540446414
			}
		],
		"1542892944_1HiF6gUThBQQqghUPLxc7h2uupMJxwGbzj": [
			{
				"comment_id": 11,
				"body": "Thanks to all for the hint: \"my site\" did it! Now I can edit the blog from computer A. My added post from commputer B got lost this way, so I have to write it again. And also strange: On computer A I added this topic here to Zerotalk. But: Your comments I see only on computer B. Computer A sees 0 comments yet :-(\nSo I write this from computer B.\nAnd: It's a pity but I forgot which external site had the trojan :-(\n",
				"added": 1542898881
			},
			{
				"comment_id": 12,
				"body": "And one more question: On Computer B on the left side of the screen I have a mask: \"Filter: Site name\"\nThis mask is absent on computer A. Can I configure that?",
				"added": 1542899769
			},
			{
				"comment_id": 13,
				"body": "> [kai0](#comment_722_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): 很旧的版本没有\"Filter: Site name\"，更新了版本就会有\"Filter: Site name\"的。\n\nAh, thank you. On computer A (without Filter) I have re-installed Zeronet very recently. Maybe I got an older version of the software there? Where can I find the freshest one?",
				"added": 1542902793
			}
		]
	},
	"comment_vote": {}
}