{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 12,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Привет всем... зеронет конечно оригинальный, но я так и не понимаю зачем он нужен простому смертному пользователю? Вся эта поделка очень напоминает FIDONet только на веб-технологиях.",
				"added": 1457507460
			},
			{
				"comment_id": 2,
				"body": "> [nippletwister](#comment_282_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Во имя децентрализации.\n\nА децентрализация для чего? )",
				"added": 1457508819
			},
			{
				"comment_id": 3,
				"body": "на форуме нужна уведомлялка что кто то написал ответ )",
				"added": 1457508934
			},
			{
				"comment_id": 4,
				"body": "> [leinariys](#comment_45_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Парни загрузил самый польшой каталог рутрекера 80 мегобайт и это писац) осталось ещё 400 мегабайт загрузить , надо?Оно кому-то надо?\n\nТебе честно сказать? Или соврать? )))",
				"added": 1457512785
			},
			{
				"comment_id": 6,
				"body": "> [vlad20012](#comment_123_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): (facepalm)\n> Дифф коммита глянь, там кода до смешного мало (20 строчек? А остальное - замены англ текста на ключи и сами лагн-файлы). Какие нах библиотеки... Разработчик ZeroNet просто хочет сделать это уровнем ниже - на самой ZeroNet-ноде, на питоне то есть.\n\nЯ делал локализацию для сайтика тоже у меня всё просто. 2 html шаблона rtl/ltr + json с переводами... умещается логика код до 10 строк.",
				"added": 1457593522
			},
			{
				"comment_id": 10,
				"body": "И всё таки... я считаю что главная цель сетей подобного рода (зеронет и остальные), это распространение контента который по некоторым причинам в государстве N распространять запрещено. Вспомним о многострадальной России и время когда появился список запрещенных сайтов. Но к сожалению и в подобных сетях нужна цензура того что находится в публичном доступе. Так может нужна торрент сеть которая позволит скачивать запрещенный контент которого не так уж много.",
				"added": 1457673005
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 5,
				"body": "Поисковик нужен по сайтам, чем наверное я скоро и займусь.",
				"added": 1457593145
			},
			{
				"comment_id": 7,
				"body": "> [gomzik](#comment_271_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): любопытно, как именно ты собираешься это делать? Мы уже обсуждали варианты, готов поделиться\nдумаю у поисковика должна быть совершенно другая архитектура, типа распределенный поисковик, то есть каждый сайт должен иметь локальный движок поиска к которому могут делать запросы другие поисковики. Получается что основной поисковик должен агрегировать результаты запросов. Децентрализации вместо распределенности тоже можно добиться перекинув алгоритм агрегирования в локальный поиск.",
				"added": 1457595820
			},
			{
				"comment_id": 8,
				"body": "> [gomzik](#comment_275_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Может быть ему самое место в ядре зеронета в виде плагина?\n\nнеа... не думаю... видишь ли сайты бывают разные... у одних по классике инфа статична, у других вытаскивается из БД по запросу. Те сайты у которых инфа статична могут пользоваться стандартным поиском аля сфинкс и хранить индекс в специальной БД, для тех у которых контент в упрятан БД логично сделать свой поиск по базе которая уже есть. (зачем делать краулер с исполнением js и выуживать инфу из страниц? ах ну да морфология же, но из-за этого поиск не станет уж сильно плохим) Единственное что должно быть общим это API. И с динамикой сайтов гораздо больше чем со статикой.\nда и потом в плагин поиск запихнуть можно, но тогда вы получите некую монополию ) всё таки нельзя делать связи слишком сильными )",
				"added": 1457597898
			},
			{
				"comment_id": 9,
				"body": "так как скриптовый язык для поискового движка может оказаться не  подходящим по многим причинам, то возникает вопрос можно ли подгружать бинарники?",
				"added": 1457608610
			},
			{
				"comment_id": 11,
				"body": "У меня есть некий движок на js + mongodb в котором есть некий функционал... понятно что движок отдает динамически html и статику... существует ли некий способ зеркалить сайт в зеронет без написания нового движка? может тупо складывать html на диск и раздавать? )",
				"added": 1458029563
			}
		]
	},
	"comment_vote": {}
}