{
	"next_comment_id": 60,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550585223": 1550654587,
		"1FoF2X7ojEyYGSdodLHw5416YfZC42LKUy_1550683671": 1550733227,
		"17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1550997552": 1551007556,
		"17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ_1551033418": 1551064979,
		"18R6oJZCus9T4yo3u26jvzdd2MR4x5TDRo_1551033610": 1551086560,
		"1JE8s9TmNmetxTZJpUVPbRJkFpW4F1a9vk_1551187289": 1551228731,
		"1Mxifa1mKj8HCCrV4vVW3f9TykoDLTVBVj_1553605713": 1553664882,
		"13Y3q2oMKcgwoMkA5MmMxDRgJoTDeR79TE_1553709109": 1553736808,
		"1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L_1564406865": 1564407946,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1564708984": 1564718045,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1565163630": 1565167747,
		"1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160244": 1565167904,
		"14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81_1565327583": 1565335279,
		"1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1565383586": 1565421267,
		"13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1565465506": 1565494153,
		"1NW2qmNpkD239orTXpjH8NpRLTL7CLHUx_1565837970": 1565859662,
		"13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1566584075": 1566629287,
		"1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ_1566877060": 1566953616,
		"13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N_1628512218": 1628542010,
		"13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1_1631278786": 1631286111,
		"13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1_1631383566": 1631384129
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Yes and no. You can't \"ban\" someone off of zeronet itself. However, you *can* ban people from posting to your own sites. In terms of ZeroMe, you can be banned from posting on certain hubs (that ban you), but you can always just make your own hub and keep using the service.\n\nYou can't \"ban\" anyone from simply looking at a site. And you can't \"ban\" people from sites that aren't yours. So no matter what, zeronet is a haven for free speech.",
			"post_uri": "1DccAuEVfpyANY3pgJUA9GF5YYXdJ7DHxZ_1548675979",
			"date_added": 1549547456
		},
		{
			"comment_id": 2,
			"body": "The stream file is hosted on a clearnet web server, accessed using ipv4 (no domain name). It auto-dls/plays when you visit the page.\n\nTechnically not a ZN radio. It still delivers the actual stream itself over clearnet.",
			"post_uri": "1E4pHuWqYkTKxPxQUCC5g1zi8AJp3PU5ZT_1549584994",
			"date_added": 1549593532
		},
		{
			"comment_id": 3,
			"body": "@Zboy: That'd be neat. My comment though was also to help alert people that it does indeed still connect to clearnet.",
			"post_uri": "1E4pHuWqYkTKxPxQUCC5g1zi8AJp3PU5ZT_1549584994",
			"date_added": 1549595068
		},
		{
			"comment_id": 4,
			"body": "I'm transsexual (which some people just call \"really fucking gay\"), and have homosexual siblings and cousins. It's pretty clear that it's all genetic/innate/etc. and runs in families.",
			"post_uri": "1AuCQWseU47SCFMkoMegjodqDC3X2V7cJ_1550104309",
			"date_added": 1550163569
		},
		{
			"comment_id": 5,
			"body": "Because right-wing people are authoritarian capitalists? I thought that was obvious.",
			"post_uri": "1QL2MB3JUZRgBHwGZgjQpEewBomhFZrrxX_1550731029",
			"date_added": 1550732956
		},
		{
			"comment_id": 6,
			"body": "@Ticker: \n>(and being capitalist would actually be reason for them to be here, what with Socialism being the Authoritarian taking of their earned money to be used for people who don't [or can't] do jack shit).\n\nYou umm... do realize that there's no way to make money on zeronet, right? bitcoin donations, maybe. But other than that not really anything. We don't even have stores or subscription services on here.\n\n>But even they're more for free speech and open Republic on a fundamental level when compared to SocJus Socialist/Communist/Anarcs who think hate speech is a thing that should be banned but refuse to define it because definitions are tools of the patriarchy to limit their emotional spewing into the neither reaches of the universe.\n\nummm the opposite, hun. Right-wing conservative countries like syria, saudi arabia, malaysia, etc. crack down on freedom of speech, and are highly censored. China and Russia are good examples as well (both having highly censored internets, and being highly capitalistic and authoritarian).\n\nAnarchists are the breed you find here on zeronet and other decentralized platforms. We're against copyright (which is capitalist censorship), money in general, private property, government, etc. All rightwing ideals.\n\nWe're also against communists and socialists who you won't find here at all because they can't have control. Which is also why you don't find capitalists here, nor rightwing authoritarians. Turns out you can't prevent people from copying your book/movie/tv show/music/etc if the technology is free and open.\n\n>where they'll force one side to slow down for the rainbow-haired gimp who couldn't compete otherwise, \n\nWhere is \"competition\"? It just doesn't exist in today's society unless you force it to exist. So in anarchist groups there's no such thing. Which is why everything is collaborative.",
			"post_uri": "1QL2MB3JUZRgBHwGZgjQpEewBomhFZrrxX_1550731029",
			"date_added": 1550898290
		},
		{
			"comment_id": 7,
			"body": "You need to add ticker@zeroid.bit.",
			"post_uri": "15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2_1550963172",
			"date_added": 1551013606
		},
		{
			"comment_id": 8,
			"body": "@Quantumworld: You call people brain dead, yet you claim a nazi supports communism? Do you even think?",
			"post_uri": "15A62tSppi8Gt85JGm5B5WDxWDgZA8wXh2_1550963172",
			"date_added": 1551062639
		},
		{
			"comment_id": 9,
			"body": "@SSDifnskdjfnsdjk: Comments to a post appear on the same hub as the post is on. Given sans3 is on moon hub your comment was posted to moon hub.",
			"post_uri": "1KkQmWnbZatijrNzgs4qtyyYcAXyEt3qgr_1551040809",
			"date_added": 1551064960
		},
		{
			"comment_id": 10,
			"body": "@SSDifnskdjfnsdjk: There's two ways zeronet will download sun hub and it's content.\n\n1. You visit a sunhub user's zerome profile, and there's a button to click to download it.\n\n2. You visit the sunhub zite directly and it'll download like any other zite.\n\nEach zerome hub contains: user profiles+posts+followed users (the stuff you see when you visit someone's profile), and then the comments on posts that were posted to that hub. So for instance if you check the ~~sunhub~~ *moonhub* folder you'll see all of these comments are in there. That way people only need ~~sunhub~~ *moonhub* to see the entire conversation here, rather than needing several different hubs.\n\nEdit: These comments and that post are posted to *moon hub* as sans' profile is on moonhub. The same applies for any hub though.",
			"post_uri": "1KkQmWnbZatijrNzgs4qtyyYcAXyEt3qgr_1551040809",
			"date_added": 1551086387
		},
		{
			"comment_id": 11,
			"body": "@Sans3:  The TL;DR is:\nTo see status posts (direct things that show up in feed): Download the hub the user is in.\nTo see comments: Download the hub of the post that the comments are in response to.",
			"post_uri": "1KkQmWnbZatijrNzgs4qtyyYcAXyEt3qgr_1551040809",
			"date_added": 1551149121
		},
		{
			"comment_id": 12,
			"body": "ãŠã¯ã‚ˆã†ã€‚æ—¥æœ¬èªžã¯åˆ†ã‹ã‚Šã¾ã›ã‚“ã€‚ã”ã‚ã‚“ãªã•ã„ã€‚ðŸ™",
			"post_uri": "1JE8s9TmNmetxTZJpUVPbRJkFpW4F1a9vk_1551187289",
			"date_added": 1551229058
		},
		{
			"comment_id": 13,
			"body": "@SSDifnskdjfnsdjk: Generally speaking, the ZeroMe method of using hubs is *inefficient*. It's bad because it largely locks you into a single hub, which kind of defeats the purpose. Other merger styles (zerolstn, kxovid, zeroexchange, IFS) are much better in that they don't designate a \"home hub\" for you. And as a result you can post on all of the hubs equally. Eliminating the need to \"migrate\".",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1551484544",
			"date_added": 1551586213
		},
		{
			"comment_id": 14,
			"body": "@Quantumworld: [Here](http://127.0.0.1:43110/0hub.bit/) is a good list. Hard to say what the most popular are. Probably redhub and bluehub which were the originals that everyone had joined. Though that's been changing, so perhaps not with the most active users. Definitely get kaffiehub if you haven't.",
			"post_uri": "1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE_1551484544",
			"date_added": 1551587120
		},
		{
			"comment_id": 15,
			"body": "They're regular RARBG torrents.",
			"post_uri": "15SpA2pA6hoUAmPrz5rp75goP4cXxw7tau_1552378502",
			"date_added": 1552391105
		},
		{
			"comment_id": 16,
			"body": "@ulrichard: It's exactly the same issues as if you regularly torrented. Namely that copyright holders can watch the torrent to look for downloaders or seeders, and then send mass copyright infringement notices to the IPs they see. A VPN gets around it fairly easily. Or just have an ISP that doesn't give a fuck.\n\nThe benefit of getting the magnet links on zeronet is that the site hosting the links won't ever be taken down (similar to how piratebay is often taken down).",
			"post_uri": "15SpA2pA6hoUAmPrz5rp75goP4cXxw7tau_1552378502",
			"date_added": 1552450422
		},
		{
			"comment_id": 17,
			"body": "@Realjohndoe: I'm laughing so hard. I can confirm that I'm not religiously jewish. My beliefs are more in line with gnosticism. Racially my family is german/sicilian. Sicilians being genetically similar to ashkenazi jews, who generally have a similar descent. As for my comments on the linked post... I like to think that I just have common sense.\n\nAs for my response to the post here, I made a response elsewhere that someone had posted the same thing. I'm not a jew no worries :P",
			"post_uri": "1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde_1553701169",
			"date_added": 1553737020
		},
		{
			"comment_id": 18,
			"body": "Race or Nationality?",
			"post_uri": "168U14Pf84QJCPCuS1YqGwBhrAdy75p7sx_1553871749",
			"date_added": 1553931809
		},
		{
			"comment_id": 19,
			"body": "You can use ZeroNet without trackers.",
			"post_uri": "1EFLroGh9zMMx1bAuzhLvjLDnTyqQLwqdC_1554973809",
			"date_added": 1554975948
		},
		{
			"comment_id": 20,
			"body": "You can use a php backend server in the same way you can normally: ajax calls to a regular centralized site. That's how ZeroID registration works (the ZN site makes a call to a centralized backend site, which then signs your cert).\n\nYou can check the ZeroID source on how that works.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160524",
			"date_added": 1565167840
		},
		{
			"comment_id": 21,
			"body": "I think it's gotten to the point where LGBT people don't actually want to call themselves LGBT to avoid the nonsense going on.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160113",
			"date_added": 1565167952
		},
		{
			"comment_id": 22,
			"body": "It's basically twitter, yeah.",
			"post_uri": "1BnrT37VaWnaNq4db7oBMygsaGZr7JSeb4_1565158776",
			"date_added": 1565167979
		},
		{
			"comment_id": 23,
			"body": "@caryoscelus: Yup. Of course a lot of people are super cautious here. And it's generally bad manners to do such things without explicitly letting the person know. After all they use ZeroNet to *get away* from that sort of thing.",
			"post_uri": "1GTypPCKjKG5gD1Leey2crVW92uj3krsLt_1565160524",
			"date_added": 1565232263
		},
		{
			"comment_id": 24,
			"body": "@Realjohndoe: Each user profile page shows a person's post history and the users they're following. There's also a bio section where you can write a bit about yourself. On the front page there's several kinds of feeds to look at (everyone, your followed users, etc.)",
			"post_uri": "1BnrT37VaWnaNq4db7oBMygsaGZr7JSeb4_1565158776",
			"date_added": 1565232554
		},
		{
			"comment_id": 25,
			"body": "@Realjohndoe: Smartphone support is in a weird place right now. I think it's *technically* supported, but a lot of websites aren't developed/designed for it.",
			"post_uri": "1BnrT37VaWnaNq4db7oBMygsaGZr7JSeb4_1565158776",
			"date_added": 1565247533
		},
		{
			"comment_id": 26,
			"body": "big.KopyKate.bit is the largest and most active video sharing site on ZN. There's also some site called \"youtube\" that mostly has porn vids if you're into that.\n\nKxovid is technically superior since it's a hub system (something we desparately need in a video site).",
			"post_uri": "1HUrXNQjRheQouoqpwcxoxokEBTyvFeq1M_1565204350",
			"date_added": 1565259886
		},
		{
			"comment_id": 27,
			"body": "The CP is in it's own space though. I haven't really seen any posted out in the open on public sites, which is nice. So it's easy to avoid.",
			"post_uri": "1MprJ7cBPUTpDquydwCvZGQAbGos8371aa_1565198490",
			"date_added": 1565259938
		},
		{
			"comment_id": 28,
			"body": "@Jaoheah: Have you considered the solution to the CP problem isn't censorship, but instead proper medical treatment of those with disorders like pedophilia?",
			"post_uri": "1J5gxnLCkgiMHbFZ3AyAgHkoGzkRHteAMC_1565184453",
			"date_added": 1565260004
		},
		{
			"comment_id": 29,
			"body": "The easiest way is to copy the entire data folder over to the new machine. But the bare minimum is the data/users.json file, which holds all of your private keys. You might want to transfer filters.json and mutes.json as well (which store what they say).\n\nCopying the entire ZN folder also works.",
			"post_uri": "19qr3Xycuk6r4S55Yjwb4vddHR3gjqR5zA_1565312869",
			"date_added": 1565313994
		},
		{
			"comment_id": 30,
			"body": "Technically this is p2p web, not internet. A p2p internet is called a mesh network, which zeronet is compatible with.",
			"post_uri": "185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD_1565275044",
			"date_added": 1565314081
		},
		{
			"comment_id": 31,
			"body": "Works for me on firefox. Reminder that you *can* write your own frontend for zerome if you wish to do so. There's an alternative ZeroMe client available called Sakana: http://127.0.0.1:43110/sakana.bit/",
			"post_uri": "18jmm5K92icHYrBzbvG4wo6NtPZEVMoTBP_1565287916",
			"date_added": 1565314146
		},
		{
			"comment_id": 32,
			"body": "I've been banned from twitter 3 times and am effectively permabanned. I own my own zerome hub so I can't be censored. Truly refreshing to be able to speak my mind without censorship.",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565263100",
			"date_added": 1565314223
		},
		{
			"comment_id": 33,
			"body": "@Montecarlo: The only problem is lack of content. Small community = not much to read/watch/look at/comment on. But ZN is just far superior to the clearnet.",
			"post_uri": "1Avp8UHcU4e2F3LDSh66sRhs9G5zmbnQ7u_1565257260",
			"date_added": 1565314322
		},
		{
			"comment_id": 34,
			"body": "Underwhelmed because all the services are the same stuff?\n\n@Tumbleweed: Site owners can still delete your post. For instance, watteau selected moonhub, so the moonhub owner (likely nofish) can delete the post/ban the user/etc. In this case you commented on a moonhub post so your comment is also prone to that moderation. You yourself have selected redhub, which is where your direct posts are held. redhub is ran by nofish for sure and is one of the older hubs.\n\nYou can get around this by making your own hub or going to one that lacks censorship. For independent sites, the only person who can delete posts is the site owner (ie your own personal blogs and such).",
			"post_uri": "1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o_1565267633",
			"date_added": 1565315220
		},
		{
			"comment_id": 35,
			"body": "@Port220irq5dma1: Yes. Think of your zeronet \"account\" more like a collection of public-private key pairs stored on your own computer. You don't \"login\" to anything. Instead you just sign content with your private key.\n\n*Do* note, however, that your downloaded sites *won't* sync between machines (unless you manually do it or have a script to copy the stuff over). Likewise any mutes/blocks/etc. won't transfer either. If you register new ids none of those will transfer (though you can re-copy the users.json file, or visit the site with the same master seed key).\n\nBut reading and posting will work simultaneously from as many machines as you'd like. Only the individual configurations won't sync, unless you have something syncing your files on your own.\n\nFor example say you copy your users.json file to your phone, which also runs zeronet. Your phone can now post on using your existing zeroid, as can your desktop/laptop. But then if you go on your phone and register a KaffieID, that creates a new keypair on your phone, but that doesn't sync to your desktop/laptop. You can transfer it by hand again, and on your laptop/desktop if you have the same master seed (which you should if you followed the example), visiting the KaffieID site will generate the same public/private key pair for the site, and thus you can recreate the cert. \n\nIf you visit a new site on the phone, the new site will not pop up on the desktop client. And vice versa. You can manually transfer these as well. Same for blocks, mutes, etc.\n\nZeroNet *does* have a \"multiuser\" mode, password screen option (to prevent people from accessing your webportal). So that you can host ZN on your private server, set it into these two modes, and then login to your zn instance from many devices and have everything synced. This is similar to how zeronet proxy services work (they set up multiuser mode and then point the client portion outwards and allow people to use their node to log in). In this case the instance is a single node, so when you update that node, your info is updated across all devices.",
			"post_uri": "19qr3Xycuk6r4S55Yjwb4vddHR3gjqR5zA_1565312869",
			"date_added": 1565316785
		},
		{
			"comment_id": 36,
			"body": "@Port220irq5dma1: Sorry it's a bit much. I'm someone who tends to be as clear/verbose as possible. And yeah once you stick around enough it all kinda clicks and becomes awesome.\n\nI've been wanting to make like a ZN tutorial series or something. Newb guide. To help educate people on ZN and how everything works.",
			"post_uri": "19qr3Xycuk6r4S55Yjwb4vddHR3gjqR5zA_1565312869",
			"date_added": 1565318137
		},
		{
			"comment_id": 37,
			"body": "@Zetanbali: Yes. You only need the users.json file. That will backup/restore your public/private keys, zeroid, etc.",
			"post_uri": "19qr3Xycuk6r4S55Yjwb4vddHR3gjqR5zA_1565312869",
			"date_added": 1565333826
		},
		{
			"comment_id": 38,
			"body": "I'm pretty sure I'm the IRL mascot ðŸ¤£",
			"post_uri": "1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz_1565316257",
			"date_added": 1565335340
		},
		{
			"comment_id": 39,
			"body": "That's adorable",
			"post_uri": "1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6_1565383586",
			"date_added": 1565421280
		},
		{
			"comment_id": 40,
			"body": "Dead network. Most people are here on zerome, or posting on zerotalk.",
			"post_uri": "1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw_1565378487",
			"date_added": 1565421316
		},
		{
			"comment_id": 41,
			"body": "Relative links break for people who directly visit .bit urls. For instance my navbar says http://me.zeronetwork.bit/, so a relative url for something like kaffie.bit would end up as: http://me.zeronetwork.bit/kaffie.bit.\n\nLinking is so fucked rn, we really need a standardization so that we can stop this 127.0.0.1:43110 nonsense.",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1565845412",
			"date_added": 1565859643
		},
		{
			"comment_id": 42,
			"body": "@Kid Courageous: one solution could be to auto-detect links in the form of http://zero/address and http://domainname.bit and auto-change them to http://127.0.0.1:43110 unless the user has specified that they support those. ",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1565845412",
			"date_added": 1565870718
		},
		{
			"comment_id": 43,
			"body": "@Kid Courageous: Yes. There already exist browser modifications to support zero://, http://zero/, http://zeroidname.zeroid, and http://domainname.bit style addresses. I have all three set up on my machine. The problem is doing such a link would break for people who don't have it set up, and there's no way to automatically set it up. See: http://127.0.0.1:43110/kaffie.bit/test.html\n\n@Crazylime: See the page I linked. I have a .pac file that sets it up.\n\n@Pigpog: See my earlier comment why relative links don't work for all users.",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1565845412",
			"date_added": 1565915417
		},
		{
			"comment_id": 44,
			"body": "\\>using bloated webtools\n\nI like how ZN basically requires people to make lean sites, rather than bloating with needless frameworks/libraries.",
			"post_uri": "1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n_1565979807",
			"date_added": 1565993487
		},
		{
			"comment_id": 45,
			"body": "Yes. You can use any zeronet site without an internet connection, including zerome. However it naturally won't sync up with online peers if you aren't online.\n\nEdit: You won't be able to download new optional files that you hadn't downloaded prior to going offline. Since they aren't dl'd with the site (hence the name optional).",
			"post_uri": "1Kyj16jmYkWYC6qQH768VKanJzUzGDUGk_1566037353",
			"date_added": 1566040623
		},
		{
			"comment_id": 46,
			"body": "surgery is intense, but in many cases it's needed.",
			"post_uri": "1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw_1566135685",
			"date_added": 1566184394
		},
		{
			"comment_id": 47,
			"body": "Hanafuda cards are cool, and the games are fun too.",
			"post_uri": "13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx_1566584075",
			"date_added": 1566629310
		},
		{
			"comment_id": 48,
			"body": "I'd love to see a properly decentralized wiki. Not just a mirrored or federated one. There's stuff like zerowiki and kiwipedia, but I find they aren't really that easy to use/maintain/etc. Maybe it's just better to download wikipedia and keep an offline copy for myself?",
			"post_uri": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm_1599743078",
			"date_added": 1600005625
		},
		{
			"comment_id": 49,
			"body": "@Downdaemon: Imagine being so much of a capitalist that you hate libraries.",
			"post_uri": "13BPoV1vrcCrka2HVvGEFwfmVdMwe6Jk1N_1628512218",
			"date_added": 1629246086
		},
		{
			"comment_id": 50,
			"body": "Most people are just on zerotalk and zerome it seems.",
			"post_uri": "1Nkp9MvxzF5YN2uhu3pm5SaMkGTDfC1Urs_1631047606",
			"date_added": 1631077153
		},
		{
			"comment_id": 51,
			"body": "@Rats: ZeroNet was a lot more active a few years ago. But interest has kinda died down.",
			"post_uri": "1Nkp9MvxzF5YN2uhu3pm5SaMkGTDfC1Urs_1631047606",
			"date_added": 1631085519
		},
		{
			"comment_id": 52,
			"body": "@Rats: Yeah. zerolstn I think has lacked peers for a while now. For video streaming the only thing that really works is kopykate, and most videos on there are pretty dead. I've tried both services back when they were well seeded and it really felt like the future. amazing stuff. Just needs more people. The question is, how do you get people to stick around? Chicken&Egg problem.",
			"post_uri": "1Nkp9MvxzF5YN2uhu3pm5SaMkGTDfC1Urs_1631047606",
			"date_added": 1631087763
		},
		{
			"comment_id": 53,
			"body": "@Rats: [Here's a seeded video.](http://127.0.0.1:43110/big.kopykate.bit/?Video=1541884826_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2) If you want to try it.",
			"post_uri": "1Nkp9MvxzF5YN2uhu3pm5SaMkGTDfC1Urs_1631047606",
			"date_added": 1631087825
		},
		{
			"comment_id": 54,
			"body": "That's odd. It should just work as expected...",
			"post_uri": "1FfhKMAy1xwaRvaofCgaaMuRMa7M7iWkFx_1631134409",
			"date_added": 1631137435
		},
		{
			"comment_id": 55,
			"body": "The regulars are still here. But zeronet is fairly inactive.",
			"post_uri": "1FfhKMAy1xwaRvaofCgaaMuRMa7M7iWkFx_1631131737",
			"date_added": 1631137463
		},
		{
			"comment_id": 56,
			"body": "Hello, and welcome :)",
			"post_uri": "1MNS6x5mgB2bnaQZLpZrtnbq4aWCGsh7rD_1631266844",
			"date_added": 1631286150
		},
		{
			"comment_id": 57,
			"body": "Since zerome is a merger site, you can clone and modify the client without losing access to the data/posts/userbase :)",
			"post_uri": "13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1_1631383566",
			"date_added": 1631384116
		},
		{
			"comment_id": 58,
			"body": "@DarkAsNight: The only documentation is [here.](https://zeronet.io/docs/site_development/zeroframe_api_reference/#plugin-mergersite) Which quite frankly is massively unhelpful. Fortunately if you only plan to modify zerome, you can just edit existing code rather than try to recode an entire zerome client from scratch. All the hubs are shared using the 'zerome' type, so any merger site that uses that same type will get the same data. So you can just clone zerome and be good to go.",
			"post_uri": "13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1_1631383566",
			"date_added": 1631386790
		},
		{
			"comment_id": 59,
			"body": "Hello. Yes I can see your posts just fine. ZeroNet is just low activity atm.",
			"post_uri": "13JuGiUNQFGijiA5NWsKsgv8YWBus5NvV1_1631478690",
			"date_added": 1631489083
		}
	]
}