{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Bug Windows 10",
			"body": "Comme expliqué dans \"Le virus informatique\" n°31, il y'a donc un bug dans Win10. En effet, lors d'une installation de mise à jour système, il suffit d'appuyer sur shift+F10 et ça ouvre une console administrateur.. Je n'ai pas testé vu que je n'ai pas cet OS sur un quelconque PC mais ça me fait rire quand même!\nBonne journée!",
			"added": 1488637321
		},
		{
			"topic_id": 2,
			"title": "Retrouver son site",
			"body": "Bonjour, j'ai plusieurs comptes Zeronet et chaque compte possède un Zerosite... Je m'y perds du coup... Je voulais savoir si c'etait possible d'associer l'identifiant et l'adresse du site. \nQuelqu'un a une idée pour organiser ça? :D\nMerci",
			"added": 1489352211
		},
		{
			"topic_id": 3,
			"title": "Bonsoir les zeronautes!",
			"body": "Je commence un blog et n'hésitez pas à le visiter pour le faire vivre ou survivre lol\nhttp://127.0.0.1:43110/1HfjNqZwpy8CMDb6cWb1cmUm1XFU9pJYFS",
			"added": 1496093061
		},
		{
			"topic_id": 4,
			"title": "Play en Francais avec index",
			"body": "Bonsoir à toutes et à tous! Voilà, vous êtes nombreux à vouloir une sorte de Play en version FR. Je voudrais me lancer mais je ne sais pas programmer. ALors j'ai pensé à cloner le zerowiki FR, comme ça, j'apporte les liens torrents et quelqu'un pourrait éventuellement y apporter sa contribution en fabriquant l'index. Cloner le wikiFR est donc plus participatif ;) A bon entendeur",
			"added": 1496699450
		},
		{
			"topic_id": 5,
			"title": "Il faut partager, SVP",
			"body": "http://127.0.0.1:43110/122nvvhftBeZq9a47WAdg9RpkzLeWTJuw5/",
			"added": 1496781531
		},
		{
			"topic_id": 6,
			"title": "Changement de domaine pour Nextorrent",
			"body": "Comme toutes les 2 semaines, le site change de nom de domaine. Maintenant c'est: \nwww.nextorrent.tv",
			"added": 1509201542
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1_1NBeJDtKxJ7Hm1fQDmV7yfRQhQe23ABH16": [
			{
				"comment_id": 1,
				"body": "C'est vrai que l'activité francophone n'est pas folichonne... Mais je pense que Zeronet, c'est aussi le partage de connaissances, notamment pour des liens ou des sujets de téléchargement ;)",
				"added": 1491747288
			}
		],
		"2_17RJyBwfCuCAHTLwpirMuzvzN1zCe9845K": [
			{
				"comment_id": 2,
				"body": "Je connais PADAMALGAM ça fait 2 ans que j'en prends mdr! Toujours les mêmes de toutes manières ;)",
				"added": 1492801500
			}
		],
		"4_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": [
			{
				"comment_id": 3,
				"body": "Bon j'ai commencé en clonant le zerowiki FR. J'espère que vous pourrez le modifier ;)",
				"added": 1496699817
			},
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/122nvvhftBeZq9a47WAdg9RpkzLeWTJuw5/",
				"added": 1496699830
			}
		],
		"5_1DfbbkYCasRTA1gQmJpRRA5TwwudFeMLUT": [
			{
				"comment_id": 5,
				"body": "j'ai crée un lien en passant par un proxy que le site soit accessible plus rapidement et complet surtout! \nhttps://zero.acelewis.com/#122nvvhftBeZq9a47WAdg9RpkzLeWTJuw5/",
				"added": 1496905830
			},
			{
				"comment_id": 6,
				"body": "Et bien, je compte les rajouter manuellement.. Je ne sais pas comment faire pour que ça soit automatique. Je peux aussi mettre le VOSTFR si tu veux ^^",
				"added": 1497449049
			}
		]
	},
	"comment_vote": {}
}