{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "Saludos y mi blog personal",
			"body": "Hola a todos en ZeroNet, soy un usuario que lleva casi 2 meses aquí en la red y un día me aburrí un poco, así que cree un blog personal para divertirme un poco.\nPuedo aceptar temas para hablar y dar mi opinión aunque no creo poder aceptarlos todos.\n\nEstoy bastante emocionado con esta red y pienso en quedarme como inmigrante internauta durante varios años. Tranquilo que traje los pasaportes de ZeroID, jajajaja.\n\nOs dejo el enlace aquí para verlo:\nEl blog de XarpSanty\nhttp://127.0.0.1:43110/1MRLwSk8b7RfuhcrY94mqEU6rBXWXj5NHq/\n\nMuchas gracias por leerlo y nos vemos!",
			"added": 1531257849
		},
		{
			"topic_id": 2,
			"title": "Cypherpunk == ZeroNet?",
			"body": "Es una duda que me surgió sobre el movimiento Cypherpunk y me pregunté de que si tiene relación con el proyecto ZeroNet.\nTiene o no tiene relación esta red con el movimiento?",
			"added": 1533076315
		},
		{
			"topic_id": 3,
			"title": "Geeks y Hackers (Fanáticos de Informática) en ZeroNet?",
			"body": "Como en casi todos los proyectos relacionado con descentralización y libertad de información, en sus comienzos hay un montón de geeks y fanáticos programadores interesados en esas ideas. Me gustaría saber cuánto de vosotros sois parte de ese grupo social.",
			"added": 1535113832
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"36_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92": [
			{
				"comment_id": 1,
				"body": "Soy nuevo en GNU/Linux y uso Ubuntu 18.04 LTS.\nAunque conozco un poco los comandos básicos.",
				"added": 1531256641
			}
		],
		"1_12YXQ7Mi4nWmAKfHytZqaLvKGp3kwi7MXi": [
			{
				"comment_id": 2,
				"body": "Lo que se puede hacer es mandar el sitio a la \"blacklist\"\nEs decir, una lista negra para la páginas de dudosa moralidad.\nPara \"dañar su reputación\", por decirlo de alguna manera.\nEse botón se encuentra al lado del \"eliminar\" cuando das click en las opciones para las páginas que visitas",
				"added": 1531261752
			}
		],
		"1_17cCGZMuKMeJf9unUeRoQFR7bFqqMaHUwD": [
			{
				"comment_id": 3,
				"body": "> [jlxip](#comment_16_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): ¿En serio recurres a ZeroNet para que te hagamos un trabajo?\n\nEso mismo pensé también",
				"added": 1531261925
			}
		],
		"1_14j8h49SqGcHkidtc9SV2ffV9vdfimxKVF": [
			{
				"comment_id": 4,
				"body": "> [eibriel](#comment_16_1BYU9zV786auJ29dF3HMAQYhxA2WgN4ofi): Intente entrar pero no pude, me dice que \"no se han encontrado pares\". Tenes el puerto abierto? Estas usando Tor?\n\nSi uso tor. Eso lo evita?",
				"added": 1531266361
			}
		]
	},
	"comment_vote": {
		"3_1CyQdj779DH9yTm2RucJkjfShqa6wUD1fN": 1,
		"2_1CE988vNrjMaHMtGCgNx5mnvfrZryaeCqt": 1
	}
}