{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1619072865,
			"title": "Operation Trojan Horse",
			"body": "Everyone knows that youtube and reddit have become homes for inorganic psyops pushed by very powerful people who manipulate what information you see, thus controlling how you view the world. I propose that we start using the algorithms of these websites against them to redpill the unwashed masses. Here's how it works\n\nReddit:\n1.) Find posts that are gaining traction.\n2.) Write a comment that is popular with the narrative, ideally funny.\n3.) After becoming one of the top comments edit your post to reflect how you really feel.\n4.) Watch as other normies then agree with your real opinion simply because you have updoots.\n\nYoutube:\n1.) Find propaganda Channels: I.e Vox, CNN, Bloomberg.\n2.) Click the bell to be alerted of new videos.\n3.) On new videos write a comment that is popular with the narrative, ideally funny.\n4.) After becoming one of the top comments edit your post to reflect how you really feel.\n5.) Watch as other normies then agree with your real opinion simply because you have updoots.\n\nIdeally edit your post to contain facts to inform and shape peoples opinions instead of 'lul fuck niggers'.\n\nAlso before you say this won't work on reddit, reddit moderation watches new comments coming in on posts as opposed to edited meaning this will go under the radar.",
			"added": 1619072864
		},
		{
			"topic_id": 1622433900,
			"title": "\"when 'science' becomes a cult\"",
			"body": "interesting article I think a lot of you would like to read now that there has been a sudden influx of libshit ideologues who think science is this magical field that agrees with every dogmatic idea they hold and that us plebiscites simply cannot question it lest we be heretics to the almighty gods of science and numbers.\n\nhttps://evolutionnews.org/2020/10/when-science-becomes-a-cult/",
			"added": 1622433898
		}
	],
	"topic_vote": {
		"1619072865_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1
	},
	"next_comment_id": 51,
	"comment": {
		"1610509513_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 1,
				"body": "no, there is no need for government control anymore. Just let mega businesses consolidate their power and collude to restrict people's freedom, that way nobody can say the government is oppressing you. It's really ironic too because the same fuckwits who make the argument of \"big tech can restrict the flow of information because they're a private company\" lose their shit when they hear about a catholic bakery that won't serve gay wedding cakes or when chick fil a said they don't want to serve openly gay people",
				"added": 1610514401
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 2,
				"body": "> [barbados](#comment_11_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): Let those treasonous fucks crawl back to Stormfront\n\nI should let you crawl back to reddit faggot",
				"added": 1610514564
			}
		],
		"1610729754_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Qanon isn't real you fucking moron, it's a stupid ass psyop propogated on 8kun (formerly 8chan) by Jim Watkins's son.",
				"added": 1610755866
			}
		],
		"1610604027_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": ">I noped out of following Jimmy Dore's podcast the minute I saw those Qanon peeps in the comments coming in and recruiting people from the Far Left as well\n\nif a bunch of Qboomers are watching Jimmy Dore, a democratic socialist, wouldn't this mean they're the ones getting recruited by the far left?\n\n>Mind you, this is a group that even Alex Jones considers to be too extreme\n\nno, it's not that they're \"too extreme\", it's that literally none of the shit they have said ever came true. 4 years of boomers jacking themselves off about \"HOLY FUCK YOU GUYS ITS GONNA HAPPEN THEY'RE GONNA ARREST HILLARY IT'S ON HANNITY NOW\" and absolutely nothing ever fucking happened. No sealed indictments, no arrests, absolutely nothing.\n\n>Does that mean I'm going to support your efforts to replace neoliberalism with another form of anthoritarianism? Fuck no. \n\nnone of us need your permission to be here, faggot",
				"added": 1610756151
			}
		],
		"1610601117_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": ">jreg would be proud\n\nreddit moment",
				"added": 1610761620
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 6,
				"body": "> [radiator](#comment_33_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): can you provide articles showing this? I don't see them leaving you alone just because you tell them too. I would LIKE to believe it, though.\n\nI don't think he has one. I'm no expert but this sounds like a bunch of sovereign citizen legal mumbo jumbo that has no bearing in the real world. No, saying \"I don't stand under authority\" doesn't make you immune to being detained",
				"added": 1610761731
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 7,
				"body": "Oy vey goyim this vaccine is perfectly safe, that's why we're going to make it so you can't be part of society if you don't take it. Side effects? Multiple layers of random genetic code being injected into your body? Nonsense, trust the experts!",
				"added": 1612239403
			},
			{
				"comment_id": 8,
				"body": "> [zeroseed4](#comment_51_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): You can critic the efficacy of covid vaccines due to short follow up but not the vaccine at all! Vaccines are the best wespons we have against infections diseases and they can eradicate some lethal ones Like tetanus snallpox or poliomelitis without inducing patogen resistence! (Within 10 years antibioticics Will be useless due to resistances...maybevwe Will have vaccines only...)\n\nthose vaccines work NOTHING like the COVID \"vaccine\" and you know it, stop bullshitting",
				"added": 1612239454
			}
		],
		"1612173389_1P99tURa4T43muCjSejqPrYHsi9km7g2X6": [
			{
				"comment_id": 9,
				"body": "åŠ¨æ€ç½‘è‡ªç”±é—¨ å¤©å®‰é–€ å¤©å®‰é—¨ æ³•è¼ªåŠŸ æŽæ´ªå¿— Free Tibet å…­å››å¤©å®‰é–€äº‹ä»¶ The Tiananmen Square protests of 1989 å¤©å®‰é–€å¤§å± æ®º The Tiananmen Square Massacre åå³æ´¾é¬¥çˆ­ The Anti-Rightist Struggle å¤§èºé€²æ”¿ç­– The Great Leap Forward æ–‡åŒ–å¤§é©å‘½ The Great Proletarian Cultural Revolution äººæ¬Š Human Rights æ°‘é‹ Democratization è‡ªç”± Freedom ç¨ç«‹ Independence å¤šé»¨åˆ¶ Multi-party system å°ç£ è‡ºç£ Taiwan Formosa ä¸­è¯æ°‘åœ‹ Republic of China è¥¿è— åœŸä¼¯ç‰¹ å”å¤ç‰¹ Tibet é”è³´å–‡å˜› Dalai Lama æ³•è¼ªåŠŸ Falun Dafa æ–°ç–†ç¶­å¾çˆ¾è‡ªæ²»å€ The Xinjiang Uyghur Autonomous Region è«¾è²çˆ¾å’Œå¹³çŽ Nobel Peace Prize åŠ‰æšæ³¢ Liu Xiaobo æ°‘ä¸» è¨€è«– æ€æƒ³ åå…± åé©å‘½ æŠ—è­° é‹å‹• é¨·äº‚ æš´äº‚ é¨·æ“¾ æ“¾äº‚ æŠ—æš´ å¹³å ç¶­æ¬Š ç¤ºå¨æ¸¸è¡Œ æŽæ´ªå¿— æ³•è¼ªå¤§æ³• å¤§æ³•å¼Ÿå­ å¼·åˆ¶æ–·ç¨® å¼·åˆ¶å •èƒŽ æ°‘æ—æ·¨åŒ– äººé«”å¯¦é©— è‚…æ¸… èƒ¡è€€é‚¦ è¶™ç´«é™½ é­äº¬ç”Ÿ çŽ‹ä¸¹ é‚„æ”¿æ–¼æ°‘ å’Œå¹³æ¼”è®Š æ¿€æµä¸­åœ‹ åŒ—äº¬ä¹‹æ˜¥ å¤§ç´€å…ƒæ™‚å ± ä¹è©•è«–å…±ç”£é»¨ ç¨è£ å°ˆåˆ¶ å£“åˆ¶ çµ±ä¸€ ç›£è¦– éŽ®å£“ è¿«å®³ ä¾µç•¥ æŽ å¥ª ç ´å£ž æ‹·å• å± æ®º æ´»æ‘˜å™¨å®˜ èª˜æ‹ è²·è³£äººå£ éŠé€² èµ°ç§ æ¯’å“ è³£æ·« æ˜¥ç•« è³­åš å…­åˆå½© å¤©å®‰é–€ å¤©å®‰é—¨ æ³•è¼ªåŠŸ æŽæ´ªå¿— Winnie the Pooh åŠ‰æ›‰æ³¢åŠ¨æ€ç½‘è‡ªç”±é—¨",
				"added": 1612239558
			},
			{
				"comment_id": 11,
				"body": "> [dragondant](#comment_5_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): Please delete this. Your words have nothing to do with this subject.  [...]\n\nsuck my cock cheng",
				"added": 1612251823
			},
			{
				"comment_id": 12,
				"body": "> [dragondant](#comment_6_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): ZeroNet is a great software, it gives people the most precious freedom. But some people don't deserve it.\n\nOOOOOOOOOOOOOOOOOOOOHHHHHHHHHHHHHH FUCKIN ROUNDEYE GI JOE KEEP INSURTING THE GRORIOUS PEOPRE'S COMMUNIST PARTY OF CHINA FUCKIN GI JOE AMERICAN",
				"added": 1612287147
			},
			{
				"comment_id": 13,
				"body": "> [dragondant](#comment_7_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): Covid: New lockdowns for England and Scotland ahead of 'hardest weeks'https://www.bbc.com/news/uk-55538937 [...]\n\n0.2% death rate says otherwise",
				"added": 1612327637
			},
			{
				"comment_id": 14,
				"body": "> [dragondant](#comment_8_1P99tURa4T43muCjSejqPrYHsi9km7g2X6): Well, you do have the right to think it is a scam. But please remember this post, in case one day you find that it is not a scam, you need it.\n\nif it's not a scam why is china fully opened up now while our economies get strangled?",
				"added": 1612386743
			}
		],
		"1611445407_1PqZH7rna6K4Ea76MnFgyHqRCa4fTst2cC": [
			{
				"comment_id": 10,
				"body": "yes goyim, the (((WHITE PEOPLE))) in power",
				"added": 1612240378
			}
		],
		"1612481231_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "let me guess you're trying to make the \"government requires you to get a seatbelt so getting injected with multiple layers of random genetic code is basically the same\" argument right?",
				"added": 1612508367
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 16,
				"body": "reminder you have to get multiple doses of this vaccine that alters your genetic code \n\nyour RNA controls the coding, decoding, expression, and regulation of your genes. Just because it doesn't alter your DNA doesn't mean it's harmless. If anything the advocates for this vaccine are engaging in total pseudo science and I don't know how you retards sleep at night telling yourself this shit.",
				"added": 1614929967
			},
			{
				"comment_id": 19,
				"body": "> [zeroseed4](#comment_87_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): Welcome! From now your thread Will be trending topic as mine! ðŸ˜Š (I do Pfizer vaccine) ðŸ¤£\n\npajeet? Is that you?",
				"added": 1614930339
			},
			{
				"comment_id": 22,
				"body": "> [zeroseed4](#comment_93_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N): After vaccine inoculation some have Fever and feels weak...its normal. This should disappear within some days\n\nyou said that a few days ago. It's not going away, congratulations on turning yourself into a GMO you fucking moron",
				"added": 1615258473
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 21,
				"body": "> [5h1n1n9d4rkn355](#comment_2_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): Bloodshed is not the answer. Never was in the first place.\n\nbloodshed is definitely the answer, the ship of peaceful reform sailed a long long time ago",
				"added": 1615258204
			},
			{
				"comment_id": 23,
				"body": "> [dingleberry](#comment_2_1JAn6MYwzZFPfg9cQ8Y6j1vUHVmr5hvXLM): It sounds like a bad idea.  Sure, I don't watch those underqualified news anchors, but either way, creating a kill list is not a good.  If anything, we should engage them in the free exercise of debate, not murder.  Minds will not change if people are killed because of the script they are given to read.  Understand the people who write the stories as CNN are not the same people as the eye candy they have on camera.  Even the writers are told what to write by management, which is dictated by the DNC and other left wing extreme organizations in the propaganda machine.\n\nThese people don't want to debate you, they want to get rid of your right to disagree with them. You think these people live my a moral and ethic code? They've killed countless of millions of people around the globe with their lying and only serve to do further damage to our people and our civilization should their activities presist, they don't give a flying fuck about ethics and playing fair. These people want you broke, dead, your kids raped and brainwashed, and they think it's funny. There is no 'rank and file\" in the media, even the lowest staff of these publications that write dogshit editorial pieces nobody wants to read, want anyone who doesn't think like them to live in a world of misery until they submit and conform to their ideology. The modern world we live in is the most nightmarish combination of Brave New World and 1984 all wrapped into one package.",
				"added": 1615258626
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_3018_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Murder will only flip the tables against us all.\n\nThe tables are ALREADY set against you, don't you fucking get it? The boiling frog effect only works if the temperature is slowly turned up over time, our only option out is to accelerate the chaos. In other words, we must force the chef boiling the frog in the pot to frantically turn up the temperature so the frog realizes he's being cooked alive and reacts accordingly. Make sense? Now I myself do not plan on participating in this should some media personalities get killed but I'm not gonna act like these motherfuckers don't have it coming. This is what happens when you tell people that they will own nothing, have no privacy, live at the whims of the state and the ruling class, and be perfectly happy with it.",
				"added": 1615259216
			},
			{
				"comment_id": 26,
				"body": "> [5h1n1n9d4rkn355](#comment_4_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): then you are lost.\n\nno YOU are lost if you think you can vote and protest your way out of the great reset",
				"added": 1615286753
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 25,
				"body": "No, he's the leader of a mafia state he inherited during the chaos of the Yeltsin administration. If you worship Putin because you want \"fuck america\" points and hate the US government, you're a fucking moron. Lots of complaints about the government here are made by Russians against the Putin government as well (shit tier foreign policy, elitism, political corruption, etc.)",
				"added": 1615259486
			},
			{
				"comment_id": 29,
				"body": "ah, I see this thread has become a place to shill and dicksuck the Russian mafia state. Let me put this very simply to you: Russia is not anti NWO, they don't give a fuck about free speech, they don't give a fuck about freedom, and they don't give a fuck about the white race or ZOG or whatever nazi shit you care about. Russia censors websites all the time for abitrary reasons and as of now is building their own internet infrastructure so they can implement a great firewall just like in China, yet there are retards on here who have the audacity to defend these governments on a platform that was quite literally built for resisting censorship. Russia's corruption is worse than, if not just as bad as the corruption of oligarchs in the west. The grass is not greener on the other side just because they oppose your government, stop buying into this fallacy",
				"added": 1619240347
			},
			{
				"comment_id": 30,
				"body": "> [roaringturtles](#comment_100_1LQt9gDDNMnknHDQ43S4WYaXxocLyFzpVd): We don't ask putin anymore to be the muscle of Russia, However we now ask them (putin and those around him) to be beyond the brain of Russia, the coaches, to raise, help, coach and humble while promoting those who will come after them.  [...]\n\nyou're probably some white american tankie LARPing about Russia being the best place to live but have never actually been there. The average Russian makes $600 a year and has to grow their own food because they can't afford to buy it. Broke ass nigga keep coping",
				"added": 1619253386
			},
			{
				"comment_id": 33,
				"body": "> [slfsrvingpltcn](#comment_103_1B7Rs1nGkNUzS2ccFdn34ANbxS2KVb2mTE): independence, sovereignty, self reliance, rugged individualism, clean healthy food from the creation... that reminds me of the great principles of a formerly great nation... which could it be?\n\nimagine thinking societies that rely on centralized state/oligarch control give a fuck about any of those things. The entire purpose of marxism or even the neo-feudal state capitalism of countries like China is to eliminate the needs of the individual and having a benevolent state take care of the collective's needs for them",
				"added": 1619312951
			}
		],
		"1615243619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 27,
				"body": "ah yes, another shitty editorial piece from a shitty news publication filled with misconceptions and inaccuracies on internet political culture because the poor sap who wrote this article had to meet a deadline",
				"added": 1615286989
			}
		],
		"1619113988_14E5dZE7svnmyJGuhStVqtuFGrXkXBeGWv": [
			{
				"comment_id": 28,
				"body": "Malcom X was a based ally of white nationalism who believed in separate ethnostates. In fact George Lincoln Rockwell, the founder of the American Nazi Party, was great friends with Malcom X and encouraged his followers to go to Nation Of Islam rallies",
				"added": 1619169560
			}
		],
		"1616224608_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 31,
				"body": "Florida keeps getting more based by the day. If you think covid lockdowns are still for your safety you're fucking retarded. Those who would sacrifice their liberty for security deserve neither and will lose both",
				"added": 1619253651
			}
		],
		"1619121928_19AuD3C3VusewLWehweVi29XupaG5TkPVC": [
			{
				"comment_id": 32,
				"body": "so because the US is a surveillance state we want an even more intrusive surveillance state to become the new hegemon? This is really stupid...",
				"added": 1619253758
			}
		],
		"1619820771_1HtGhiVHZwMd5UW9SyW6uWb91Tsy4gcxo1": [
			{
				"comment_id": 34,
				"body": "what is this incomprehensible schizobabble and why do you post so much?",
				"added": 1619906087
			}
		],
		"1620517463_14zfKTGjNZghaPkrUSobubLZTx6XoVXjJK": [
			{
				"comment_id": 35,
				"body": "> [deuxzaron](#comment_142_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): centuries of book burning? centuries ago most people didn't know how to read so book burning would've been useless\n\nask the library of alexandria abut that one",
				"added": 1622431067
			}
		],
		"1621790517_1BDov7xo2ezh8RNpumtUozsEv9C4yJAF9d": [
			{
				"comment_id": 36,
				"body": "> [deuxzaron](#comment_156_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): Learn that Marx was right. Stop working for someone else and seize the means of production. If you work for someone else you're making money for them. Work for you and make money for you. The wealthy are ALL socialist. They want you to work so they can make money from YOU\n\nTranslation: Give up everything you know and love for our bullshit revolution that almost always fails and fucks over the masses in pursuit of an un-natural concept of \"equality\"..... oh wait sorry is it \"equity\" that's popular with dipshits like you now, the affront to the natural order that is equality wasn't enough for you right? Now we have to purposefully put down the capable to prop up the weak, right?",
				"added": 1622431668
			},
			{
				"comment_id": 37,
				"body": "> [elr23423nksdasd](#comment_8_1KFTNuxkQipsabR2q9XhxxTTtqn9QiSxeP): I was only responding to your question of why it's all about marxism. What it actually is doesn't even matter, it's what people think it is, and it was shaped by propaganda. [...]\n\nok so let me propose you a scenario: the government needs resources from an area for some kind of project, but that area is inhabited by villages and communities of natives and acquiring those resources would mean the destruction of their homes and their way of life. Do you settle this with a vote where everyone in the cities votes that those resources must be acquired with the only people opposing it being the natives?",
				"added": 1622431886
			}
		],
		"1622273887_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": [
			{
				"comment_id": 38,
				"body": "FUCK JANNIES \nFUCK JEWS\nFUCK TRANNIES\nFUCK NIGGERS\n\nI HATE THE ANTICHRIST!",
				"added": 1622431941
			}
		],
		"1622105491_1NH9evu6V4qeiyppRGkdUkTk87eM82oMdE": [
			{
				"comment_id": 39,
				"body": "> [epistemic](#comment_6_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): Wait, do you seriously believe in the Biblical god and angels?Bwa-hahahaha.Do you also believe in King Arthur? Unicorns? Dragons? Faery Folk? The Loch Ness Monster? Big Foot?Hahahahahaha.\n\nman you must think you're a genius huh? So what do you say about all of the scientists who believe in intelligent design? \n\n\"yeah bro let's kill religion it's so evil, we don't need morals or community, we just need mass consumption, hedonism, and utilitarianism amirite?! Let's all just sacrifice our souls on the altair of globohomo to make our lives like 5% more efficient, that's my idea of a utopia!\"",
				"added": 1622431997
			}
		],
		"1621828480_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 40,
				"body": "\"You all claim the mainstream is part of some big conspiracy and keep claiming something will happen, but it never does\"\n\nwere you just in a coma for the entire past year, retard?",
				"added": 1622432162
			},
			{
				"comment_id": 41,
				"body": "> [scotcyguy2](#comment_92_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Ad hominem attacks, appeals to authority and claims of legitimacy because of consensus have nothing to do with the scientific method. [...]\n\nyep, people say \"trust the science\" as if science isn't an open ended process that is ever changing and requires constant debate and disagreement to advance. If we just \"trusted the science\", never questioned it, and always assumed it was correct we would still believe in things like alchemy and turning silver into gold rather than building particle accelerators or exploring space.\n\nIt's really telling of the state that the so called \"humanist\" atheist/skeptic movement is in when Richard Dawkins, who used to be the figurehead of that movement 10 years ago has now been ousted from it because he dared to say we shouldn't give HRT to 5 year olds and maybe chopping your cock off and replacing it with a rotting axe wound isn't super healthy",
				"added": 1622432491
			},
			{
				"comment_id": 43,
				"body": "> [sabretooth](#comment_17_1CQJfkvNg44WkoH6xCTj6XkuxA9zRMLYSU): No, seriously, this shitposter needs to back to 4chan.\n\n\"NOOOOOOOOOOOOOOOO YOU CAN'T JUST CALL PEOPLE NIGGERS ON MY CIVIL MIXNET!!!!!!!\"\n\noff yourself faggot",
				"added": 1622432701
			}
		],
		"1622402090_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 44,
				"body": "> [anon46344](#comment_1_1KhfhSvSnonDqSgVk8B6Cg5WE2u2ZGLqCr): Fuck the anti pedo\n\nfuck your mother, faggot",
				"added": 1622432769
			}
		],
		"1621513388_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD": [
			{
				"comment_id": 45,
				"body": "People like OP think science is just some set in stone ideology that always agrees with them rather than the constantly changing process that it is. If science was always correct and we never questioned it, we would still believe in things like alchemy and turning silver into gold rather than building particle accelerators, going to the moon, inventing the internet and smartphones, etc. I think it's fair to say that the Atheist/skeptic movement of old has been hijacked by brainless SJW shitlibs who insist that you listen to their list of dogmas, rather than old school atheist skeptics like Richard Dawkins or Hitchens who insist that every authority should be questioned and held to account, and that societal dogmas must be broken by empiricism.\n\nlike Christopher Hitchens literally did an entire segment empirically proving why women are not funny and Dawkins has said many times that tranny surgeries and giving HRT to kids is unhealthy, that shit would NEVER fly with the modern day circlejerking reddit \"I FUCKING LOVE SCIENCE\" types like OP\n\nScience and academia are now starting to more closely resemble an ideology than the constantly evolving processes and institutions that they are meant to be, and that is EXTREMELY dangerous for fields who's main goal is supposed to be searching for the truth no matter the cost. It's no wonder why there is a massive replication crisis when major scientific journals are publishing pieces talking about radical ideological causes like the nature rights movement and prioritizing \"diversity of black trans midgets in wheelchairs in the academics\" over the search for the ultimate truth that their field is supposed to be engaged in.\n\nWhat's really ironic about people like OP is they will insist that you trust the science and say things like \"heh studies show that liberals and leftists are shown to have higher IQs!\" Then when you bring up racial IQ studies and the bell curve they will immediately flip to \"NOOOOOOOO THAT DOESNT COUNT IQ IS PSEUDO SCIENCE ITS RACIALLY BIASED TOWARDS MUH HECKIN POCS!!!!\"\n\nBTW just a friendly reminder that this is an experimetal vaccine technology unlike any other vaccine we have used in history and it has never been used before to cure diseases or viruses, you are willingly participating in one of the largest clinical trials in world history for a vaccine that hasn't even yet been approved by the FDA and doesn't even protect you from getting covid, let alone the fact that lots of CDC officials are refusing to take it. So much for \"muh science\" though amirite OP?",
				"added": 1622433399
			},
			{
				"comment_id": 46,
				"body": "> [zeroplissken](#comment_3_1K1Y6kTYm7QXpmvbZiCAdzB5w7jCwBkird): care to share some data showing any of the covid 19 vaccines don't protect?\n\nAsk Bill Maher",
				"added": 1622433426
			},
			{
				"comment_id": 47,
				"body": "> [atheistamerican](#comment_21_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH): this is what happens when you fall for fake news. You get called out on ZeroNet for falling so hard for it that you've started posting it as fact on decentralized services because you've been kicked off all the centralized ones that didn't agree with your bullshit fake news posts.\n\n\"if it doesn't agree with my ideology it must be fake, reddit told me so!\"",
				"added": 1622433481
			}
		],
		"1621843317_1C9uMp36YAt8RV6cf9jPoarY7LPnnzSZ4h": [
			{
				"comment_id": 48,
				"body": "> [thefather](#comment_5_1QF6hFgijw5BqUeyY9hRPmH7qxcaRvgCyM): The best way to make an economy flourish is to ensure a high degree of order/low degree of crime. Why bother working hard when you can just steal? Why start a shop when it will be robbed? Why provide insurance to a business at a fair price if you know that business will be vandalized? [...]\n\nngl if Bolsonaro became a full on integralist that would be extremely based. At least he relaxed gun laws and has made it easier for the Brazilian people to defend themselves from criminals, it's been a long time coming. Self defense is a basic human right and the only way for you to protect yourself from the anarcho tyranny of the modern world",
				"added": 1622433716
			}
		],
		"1621555984_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 49,
				"body": "> [jeff](#comment_118_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Unfortunately, we're not dealing with vaccines here. You are not being inoculated with an inactivated virus which would allow your body to create a normal immune response. Instead, your cells get a recipe to create only one particular component of the virus, the spike protein. This applies to both the mRNA and virus vector shots. How long will your cells continue to churn out spike proteins? Who knows? Will it result in Antibody Enhanced Disease? For some people, it looks like it already has. Again, we're not being offered a vaccine here. We're being coerced to participate in a mammoth medical experiment. [...]\n\n\"NOOOOOOOOOOOOOOO BUT THIS IS PSEUDOSCIENCE SNOPES SAID SO!!!!!!!!!!!\"",
				"added": 1622433756
			},
			{
				"comment_id": 50,
				"body": "> [croatame](#comment_25_19RaaMJeGXcJzLxeKXWH9pynfjgmm33VZS): It's painfully obvious that glowies are on zeronet.\n\n\"hey kid you should do a mass shooting and blow up federal buildngs. What? Federal agents? Take your meds schizo!\"",
				"added": 1622433991
			}
		]
	},
	"comment_vote": {
		"13_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"3_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"5_1KNLne2PbRUL1WrWuN7u71DgBRhwvK5dxu": 1,
		"9_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"8_13GmZWNCZqPELbMy6ujquVGqYz77wiQ5RY": 1,
		"3_1EhHXjjm6YW8dha25g67GmZtqV2BhPTigU": 1,
		"8_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN": 1,
		"16_1CYV6U3zKjHQp6mTkHEFKjXmu3xX7BA2iK": 1,
		"109_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": 1,
		"71_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"2_1JaCh1fv2Bhik1mTnzXWaNknaWvTewPAx7": 1,
		"27_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"4_1GR6BoYa5pEFXXiotPDBWNU8juqWAJSyFf": 1,
		"92_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"12_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1,
		"4_1CPMi1adhz1sh7dLTfbppPztkoH6wUUsS8": 1,
		"118_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"9_16AJ9b5xA1cGPoWqrCQSi1TiNR3Hp8ASiE": 1
	}
}