{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1515603525_1AJ7ycQQz14iRht5CYH4KmvE549VZhArNc": 1,
		"1515887744_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1515462495_1P7ZF1U5tMb3BKzp6jxWzz37VqGg2XiMhs": [
			{
				"comment_id": 1,
				"body": "One thought: *Maybe it would be more fun to just do this in real life.*\n\nProgramming is already kindof like magic. There are daemons (in unix) and people talk with rocks (mobile phones). It is like techno-shamanism + mages already.",
				"added": 1515505111
			}
		],
		"1515406093_19JaWgyGYxHJqHompjtVxJscBdoDAs2Ayj": [
			{
				"comment_id": 2,
				"body": "It makes me sad that CP is a thing on zeronet.",
				"added": 1515505327
			},
			{
				"comment_id": 3,
				"body": "> Click the heart on ZeroHello and you'll see a few features that will be implemented with enough funding directed at each.\n> Blacklist sharing is coming regardless.\n\nClicked that heart-button and saw that you have like 10 bitcoins for 2018 already. How is that not enough? :)",
				"added": 1515505550
			}
		],
		"1515603525_1AJ7ycQQz14iRht5CYH4KmvE549VZhArNc": [
			{
				"comment_id": 4,
				"body": "ZeroNet + I2P is a better fit than ZeroNet + Tor.\n\nThere are two different i2p implementations. The oldskool java i2p and the russian i2pd written in C++. You should really check out i2pd, its potential for bandwidth is larger than the oldskool java version. Plus it is much more light-weight.\n\nThere is nothing that stops ZeroNet from being a network running on top of all three networks. I2P, Tor and the plain vanilla internet. Maybe it is a good idea not to put all eggs in one basket.\n\nThe future of peer-to-peer and public mesh networking lies *completely* in the darknets. We need the cryptonets to exist.\n\nOr else there will be only corporate bullshit and dragnet surveillance everywhere. *And I refuse to live in that world.*",
				"added": 1515610398
			},
			{
				"comment_id": 6,
				"body": "> missesrobot\n\nI tried talking with people about surveillance and that we can't have that. The vast majority of Everyone agreed with me. But they don't really give a fuck. If it turns out that they have to spend 5 minutes working with understanding some weird technical issue to make it work, its already game over for a lot of people. But most people just don't truly give a fuck.\n\nIf asked to choose between voting for a politician that says they will form policies that might be positive for the payments on the house morgage, versus someone that promotes some whacky idea of cryptography and tinfoil dragnet surveillance... Well. *Who do you think they will vote for?*\n\nThat is simply not going to happen.\n\nThe idea of crypto-anarchism is simple though: You don't have to convice anyone that your math is right if it is right. You just win. Game over. No fuckin debates.\n\nI am will not try to convince anyone that we should not have dragnet surviellance. That is fucking pointless. *Shut the fuck up about it.*\n\nInstead, I am spending my weekends writing software.",
				"added": 1515783864
			},
			{
				"comment_id": 8,
				"body": "What you are descibing is the act of some totalitarian and truly orwellian police state. The only action any decent human being could take if one finds oneself in such a place, is to *revolt*. Look for likeminded people to form small groups with, and *take action to destablizing and ultimately overthrow the regime*.\n\nIf that is actually what is happening where you live (USA!??!) then fuckin join the resistance. Don't just talk.\n\nBut I think you are overreacting a bit.\n\n> And what do you think is the reason some governments don't do that?..\n\nThe reason is that, in a real democracy, your fellow men would on avarage need to actually think that cryptography is *bad* for it to be illegalized. You would need to venture quite far from living in a democracy, until you actually end up in a world where having a encrypted conversation with remote peers would be actually illegal. *That is quite extreme.*",
				"added": 1515924528
			}
		],
		"1515722999_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [],
		"1515887744_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 9,
				"body": "The default mode network.\n\nPsychedelics can be used to *forcefully* stop being in the default mode. Meditation is perhaps the gentle way into it. The effects being that one experience everything as if one experince it for the first time. You actually see everything and notice the details that you would normally ignore because they are always there. Every single leave, stone, crack and imperfection comes into mind and focus, truly as if one sees the world for the very first time, with the eyes of a newborn. The entire world turns into the most beautiful experience one can have. Hello LSD.\n\nIn my humble oppionion, using psychedelics is for most people the only way to jolt the mind into the realization that there are other ways to experience the world, than the current one. I certainly would not have realized that without the usage of drugs. I was too stubborn for that to have happened by just meditation and to be honest, I guess I would not have even tried meditation without first experiencing IT via psychedelics. Drugs helped me with gaining those perspectives.\n\nI think the fear comes from the minds ego being temporarily dissolved. Ego-softening give hints of what lies beyond and it scares the shit out of the ego-bound mind.\n\nI can't really say anything good about cannabis. It does not work for me.\n\nBut I do think you are on to something.\n\nhttps://www.hooktube.com/watch?v=FAcTIrA2Qhk",
				"added": 1515962220
			}
		],
		"1515623884_1J2cXfbx97JL1iQihCMateocuHzRnA4jDu": [
			{
				"comment_id": 10,
				"body": "Saudi Arabia is a fuckin toy for the Sauds (like literary those whos surname is 'saud'). They treat their citizen like property, beheading people just for raising their voice against the elite, shopping off your hand just for being accused of theft after a trial by some religious fanatic where you have no right to a lawyer. Shit like that, and worse. \n\nGiving away citizen to that robot just for kicks fits into that pattern. These guys are not to be trusted.",
				"added": 1515964301
			}
		],
		"1516673349_1EqzMve3ZFTvmF8H2v2iebeLvcZJPnSbig": [
			{
				"comment_id": 11,
				"body": "Here are some reason why you should never actively try to learn anything related to windows:\n\n* Linux exist and is really good.\n* They replace windows every few years with something new, often without keeping backwards-compatibility. That means that your knowledge about windows systems slowly is destroyed by the people that build windows. Instead of releasing one thought-through and good version of the software, their *intention* is to sell you a completely new product in a few years that breaks backwards-compatibility in subtle ways.\n* Windows is a graphical shell without anything under it. It is just shiny buttons meant for people that don't give a fuck and/or don't want to learn anything new. By putting the GUI in the first room, they undermined our (i.e. the programmers) abilities to control the operating system with our software instead of having to *manually* click on buttons and so on.\n* Windows is being built by a huge mega-corporation with a dubious ethic history. They are Not The Good Guys.\n* Windows is closed source.\n\nI have never met anyone who could counter my arguments against windows with anything better than \"we are stuck in this swamp, we have to use it.\" \nMost people don't give a fuck or just laugh at me and idiotically ignores the subject - these are always people that have *never* tried anything but windows/Mac: *The lost consumers.* One can not help them.\n\nMy final point is perhaps the most important one:\n* Even Microsoft is giving up on windows. They are incorporating Linux in windows - and bet they will probably eventually just let windows be a thin GUI-layer on top of Linux.",
				"added": 1516795097
			}
		],
		"1516622092_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 12,
				"body": "There is no well-defined Anonymous group/organization and there NEVER HAS BEEN.\n\n*Anonymous is not like that.*\n\nThe thing with anonymous is that anyone can be Anonymous. There is no leadership. No one is in control. There is just a bunch of people that take action and DO STUFF, as opposed to just shitting on their sofas like retarded consumers. There is no official channel. You can not \"join\" anonymous. \n\nYou can be Anonymous by just being anonymous.\n\nDO YOU UNDERSTAND?\n\n\"Anonymous\" means that you have no identity. You can not \"join\" the no identity-concept. There is no official channel and it is not possible to contact someone or something that have *No Identity*.\n\nDO YOU UNDERSTAND?!!!!111",
				"added": 1516809798
			}
		],
		"1516279757_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [],
		"1529033869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 14,
				"body": "Well transhumanism is all nice and sweet, until you realize that EVERYTHING that transhumanism is about will happen even if there was no transhumanists around. You don't need transhumanism - because all you need to do is just wait for the technology to come. It will happen by itself.\n\nTranshumanists are just the cheerleaders for Science and technology.\n\nAll their papers and news magazines are filled with utopian buzzword-dreams. If you talk with someone that says they are a \"transhumanist\" then all that means is that they talk wide-eyed and impressive about science and tech. Seriously!\n\nIf you really want science and technology to happen even faster, its FUCKING POINTLESS to cheer about science and technology. Instead you should just become an engineer, do you post-doc at some sciency university, or whatever. Something. Cheering helps very litte.",
				"added": 1529259747
			}
		]
	},
	"comment_vote": {}
}