{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1528080332,
			"title": "Microsoft acquire Github. Time to host repositories on ZeroNet.",
			"body": "https://www.linuxjournal.com/content/microsoft-reportedly-acquire-github\n\nMicrosoft now owns the biggest service of free and open-source community. Why keep hoping from one service to another only to find out it got sold to some corporate giant? Why not create own repository on own computer which anyone can access even if your computer is not on after you have some seeds.\n\nGitCenter is great collaboration tool. Though freenode have a very good history but still an IRC service can also be created on ZeroNet very easily. After all ZeroNet is build for real-time dynamic content. Why depend on some other service when everyone can have complete control over own computing.\n\nI think most people don't use ZeroNet because they do not know the power of it. It takes time to realize how great ZeroNet is and how many things can be easily done using ZeroNet. Or may be most not even heard about ZeroNet?",
			"added": 1528080331
		}
	],
	"topic_vote": {
		"1528064284_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1528088389_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"1528117771_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo": 1,
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1528399014_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1531129038_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1527723582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 1,
				"body": "> [vanadium](#comment_5_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): Is there a way to report bugs to nofish(the dev) from inside zeronet?(I don't have a github account)I've written to him through a comment on ZeroBlog now.\n\nCode is also hosted within ZeroNet by nofish using Git Center. You can report issues there - http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB",
				"added": 1527774812
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 2,
				"body": "We cannot ban child porn without creating tools that can be used to ban everything. What we can do is 'block' child porn and prevent it from spreading. We should have blocklists as are in ad blockers. There can be blocklists of malware, spam, porn, gore etc. Anyone can apply these blocklists but no one can be forced.\n\nBut I do hope those who hurt children get punished.",
				"added": 1527775956
			},
			{
				"comment_id": 3,
				"body": "> [thunder33345](#comment_105_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): How will it be made is the question, most people worries about centralization of trust in said blocklist provider\n\nIn most ad blockers you can add link to text file hosted on web urls and local computer. Text files are downloaded and updated every day. Every url is scanned and blocked if found in list.\n\nWe should host blocklists on ZeroNet websites. This way anyone should be able to host own blocklist and also use others blocklist too.\n\nBut there is a caveat. What if someone post something on user generated content website like ZeroMe or KopyKate? We can have blocklist of content hashes and  users too. Since we download hash of a file before downloading file itself, we can make blocklist per file and user also. No ZeroNet website need to individually add block feature. It will work by default for all ZeroNet websites.",
				"added": 1527785364
			}
		],
		"1528080237_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": [
			{
				"comment_id": 4,
				"body": "ZeroNet is already very good at sharing large files, look at ZeroUpload and KopyKate for example. Some tweaks need to be done in my opinion to improve it, but its better than IPFS. Problem is that many times the uploader don't seed long enough and goes offline. ZeroNet do not yet persistently try to download when uploader comes back online but just give up altogether. This is a minor issue not a major challenge.",
				"added": 1528081242
			}
		],
		"1528117771_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo": [
			{
				"comment_id": 5,
				"body": "Wait for WebAsembly to become mainstream. Compiled binaries which you cannot read. For a software to be free, its source code need to be available and license should permit unrestricted usage including modification and re-distribution. With most JavaScript pages we had source code available but without free license.\n\nEven if we don't care about copyright and legal crap, still the ability to use software freely like you described may gradually diminish.\n\nBest we can do is to ask all web developers to make their software available under a free license and host source code somewhere. Otherwise refuse to load their pages with JavaScript enabled.",
				"added": 1528135962
			},
			{
				"comment_id": 6,
				"body": "Than even database can be stored in a secret format which only their proprietary software can understand. After years of reverse engineering efforts by many, we are still not able to read .docx format as good as Microsoft Office does.",
				"added": 1528136133
			}
		],
		"1528080332_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": [
			{
				"comment_id": 7,
				"body": "> [xianc78](#comment_25_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ): GitHub is just cancer anyway. It's centralizing a decentralized protocol. You were meant to host repositories on your own servers but GitHub decided to combine it with social networking features and create one place to store and host all your code.\n\nEven their server code is proprietary. They never had the spirit of FLOSS. Its funny how many websites host their server code on GitHub when even GitHub keep its backend code private. Gmail centralized the decentralized email network and GitHub centralized the decentralized version control system.\n\nMain reason I think is that starting cost for GitHub and other centralized services is zero. People can just sign up and start without worrying about setting up and maintaining the system. For me ZeroNet and tools build on it like GitCenter and ZeroBlog do just that. Anyone can immediately host their service on own computer within minutes. I don't feel same for many centralized tools here like certificate authorities and KopyKate. Everyone should host their videos on own website and embed it on other websites. No need to give control over your content to someone else. Maybe some day someone can force KopyKate to delete its website and than everything will be gone. This is not the problem with some other p2p technologies where there is no central service like RetroShare and BitTorrent. We don't need a YouTube of ZeroNet. We need that no one need a YouTube and can host their videos, blogs, code or photos on own website.",
				"added": 1528170061
			},
			{
				"comment_id": 8,
				"body": "Federated web require even more centralization to make improvements like CDN but ZeroNet and BitTorrent have implicit CDN system from day one. The closest peer to you would be fastest. Fetch most data from the fastest peer and distributed load among entire network.",
				"added": 1528170282
			},
			{
				"comment_id": 9,
				"body": "> [krixano](#comment_471_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The solution to the centralization on ZeroNet thing is merger zites. Git Center uses them very well for this type of thing. So do a few others, but some don't I don't think (e.g. ZeroMe). [...]\n\nYou are spot on! Merger zites is the way to go.\n\nCan you give example of somethings that need to be centralized? If you are talking about certification than we can have proof-of-work for certificate authority less accounts. Spam accounts can be easily blocked. It would take few hours for spammer to create account but just few seconds to block it and remove their posts. With shared blocklists, spam account can be blocked from everywhere. It would be in spammers interest to better spend such resources somewhere else.",
				"added": 1528208275
			}
		],
		"1528399014_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 10,
				"body": "I am no programmer either but I think I understood most part of it. It is so well written that even a non programmer can understand. I like that you have described in human language every code that you have written.",
				"added": 1528478543
			}
		],
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 11,
				"body": "Based on what I have read, every website is sandboxed and should not be able to access local storage. That is why websites are either loaded inside iframe with javascript enabled or raw with javascript disabled. Javascript on ZeroNet websites are usual javascript as on any other website and not core of ZeroNet. Core of ZeroNet is written in python and websites access ZeroNet via web service created, by default at http://127.0.0.1:43110/.\n\nBut just like any other software, ZeroNet may have security bugs as well. ZeroNet is mostly made by one person and there has not been any security audit of it. Even very popular software like Chrome and Firefox also have security vulnerabilities.",
				"added": 1528479450
			}
		]
	},
	"comment_vote": {
		"462_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"466_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"25_141zS75MupoDVjN4p7ivG9pXUXjAm9jLBQ": 1,
		"471_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"172_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"25_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": 1,
		"117_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"171_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}