{
	"next_post_id": 2,
	"next_comment_id": 3,
	"next_follow_id": 5,
	"avatar": "generate",
	"user_name": "Frankwalter",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Utente ZeroNet casuale",
	"post": [
		{
			"post_id": 1,
			"date_added": 1591806501,
			"body": "Ciao ZeroMe!"
		}
	],
	"post_like": {
		"18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV_1": 1591891271,
		"1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115": 1591891347
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I have always used large amounts of ECC RAM in my PCs, from 16 gb to 128 gb. Clearly I needed it for \"work\", but I also used them for daily use. Lately, the workstation broke down, I got tired and didn't want to fix it. So I decided to do all my work in the cloud, and pay by the hour and that I would buy a mediocre laptop (700 euros) as a gateway to the cloud, to experiment a little in the cloud and a little on the local and for home use. I was also worried about the 8 GB of ram, but in the end I bought a laptop anyway and I must say that I never had any problems, neither on linux with kde which consumes 500 mb of ram in idle, or on Windows 10, even if it consumes 25% in idle, plus it must be said that OEM consumed 35% of ram, shameful, but with the debloat scripts I fixed it. It can go very well beyond home use, even doing \"extreme\" multitasking, keeping heavy programs open, visual studio code, fl studio, firefox with 70 tabs open, simultaneously. I have not been able to freeze it, or otherwise make it produce a minimum sign of lag. However, good software also runs on 512 mb of ram.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591892603
		},
		{
			"comment_id": 2,
			"body": "@Lajos Nagy: Mainly I work with artificial intelligence, but for this 16 GB they are enough and they advance even if you work with CPU, and also for training rental of GPUs from Vast.ai. However very often I happen to compile large quantities of code, even verilog. And here if you have so many cores to exploit as in my case, a lot of RAM is a must. Especially with FPGA languages that are very slow to compile. ECC RAM is really cheap, so I didn't bother and went wide enough. The cloud is scalable and above all to compile things it is fantastic.",
			"post_uri": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv_1591791115",
			"date_added": 1591908309
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1KEuyiDgNFzafkwHyRbDJX8sHXAGq41dLv",
			"user_name": "Lajos Nagy",
			"date_added": 1591891350
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1JFrMnwLU4hCgcZe5KVkq9SK3DjvLEqUZ5",
			"user_name": "GNUfan",
			"date_added": 1592743218
		},
		{
			"follow_id": 4,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "13SFxfKtzbvyUWADdNZs3oKh1YSJwmohWm",
			"user_name": "lavaphox",
			"date_added": 1594372827
		}
	]
}