{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1528403484,
			"title": "Cannot create a new site OR disable Tor Only mode: \"This function is disabled on this proxy!\"",
			"body": "Every time it says: \"This function is disabled on this proxy!\" \"This function is disabled on this proxy!\"\nWhy is this happening? How can I fix it?",
			"added": 1528403483
		},
		{
			"topic_id": 1528403696,
			"title": "How does Tor only mode work? How safe is this platform?",
			"body": "From what I understand, you cannot torrent off of tor because it sends your real IP in the 'get' request. ZeroNet functions like Bittorrent from what I understand. Isn't everyone seeding the sites they visit with their real IP then? And also, isn't Javascript considered to be a huge security risk? And isn't Zeronet Alpha/ Beta software? I just don't see how it is all that safe. I mean I love the idea and think it should be expanded and continued, but I am skeptical. Especially seeing people in China talking openly about Tienanmen (and all power to them), I worry about their safety.",
			"added": 1528403694
		}
	],
	"topic_vote": {
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1528352699_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "\"Jesus would have never approved of homophobia, the war on drugs .. the violence in gaza .. mass incarcerations.. televangelists flying around in private jets.. etc.\"\n\nI agree completely. But you know, killing yourself will not solve that at all. Jesus loves you. The cross you see on top of Christian churches? What was that originally? It was a symbol of Roman state terror against political dissidents. The weapon of the oppressor was turned into a weapon of the oppressed, and now it is in the hands of the oppressors again. Who will change that, who else but you? Not by violence or wrath, but by love, the holy spirit, and revolutionary spirit.\n\nYou do not see the point of living yet at the same time you point out these grave social ills. I mean if you are planning on killing yourself, why not just live another day and another day after? Why not just keep going a little bit more and at the same time, speak, write, and fight against these horrible injustices? What do you really have to lose if you plan on dying anyways? And I do not know what happens when you commit suicide. Even when you are Christian many think it is a mortal sin. I do not know if hell exists with absolute certainty, but I certainly do not want you to go there! I have seen hell myself and it is a terrible place!\n\nYou know, several years ago I was in your shoes. I was hospitalized. I thought I was broken beyond repair. There is this old art called Kingsuti. Where you take a broken piece of pottery and glue it back together with gold infused paste. In the end, the pottery when put back together is more beautiful than it originally was. Right now you are a broken vase. Years ago I was a broken vase too who felt there was no hope for me in the world. And here I am now. So it is with me, so it can be with you. Of this I am absolutely sure. Will it be a struggle? Yes. It always is. But if you hang in there you will find that this state you are in has the potential to forge a newer, better version of yourself, someone so much stronger and more beautiful than you are now.",
				"added": 1528401078
			}
		],
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 2,
				"body": "> [nekololi](#comment_206_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): zeronet isn't bitorrent. but javascript is definitely sketchy as fuck.\n\nI mean it looks pretty, it definitely makes the darknet look like NOT crappy 90's craigslist. But at the same time... I wouldn't seriously rely on it for strong anonymity.",
				"added": 1528420447
			}
		],
		"1528403484_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 3,
				"body": "> [htgozn](#comment_180_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): ... are you the owner of the proxy you are attempting to add a site to?\n\nAs far as I know, I am not using a proxy. I am using a VPN to connect to ZeroNet, and ZeroNet is in Tor only mode. So basically it is only going from my PC to my ISP to my VPN entry node to my VPN exit node to Tor (3 to 6 relays depending on how Zeronet is configured) to ZeroNet. I did not manually configure a proxy.",
				"added": 1528420559
			},
			{
				"comment_id": 6,
				"body": "> [thunder33345](#comment_122_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you need to add --multiuser_localsee more on my guide of how to use multiuser\n\nWhere do I put \"--multiuser_local\" exactly? On what file?",
				"added": 1528515701
			}
		],
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 4,
				"body": "> [realjohndoe](#comment_6_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): Individuals have the power to mute users or sites with content they individually find objectionable. Personal #freedom and true #feespeech really has some of you people terrified, #AWESOME!!!..😂\n\nI don't think it's as much \"muh freedoms\" as it is \"I don't want to click this link even by accident and end up arrested for 'uploading' CP (vis-a-vis ZeroNet's design) and end up going to prison for like 10 years\". If people do that, good for them I hope they get caught. But as for me? Apparently even having the option to, OF MY OWN FREE (emphasis on the word 'free' here) WILL, have a CP based community blacklist makes me \"anti-freedom\". I don't necessarily want to open every single \"porn\" link (and it would be a bad idea to open any of them in my view) and say \"yes this site definitely has 0 CP so I won't blacklist this site in particular\". Why? Because in doing so I would be downloading and uploading it, which last I checked is a felony in most developed nations. This is ethically (not just legally) unacceptable, not just for me but for countless others. I agree with OP here.",
				"added": 1528421226
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 5,
				"body": "\"This function is disabled on this proxy!\" everytime I try to create a site!",
				"added": 1528421672
			}
		]
	},
	"comment_vote": {
		"176_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2": 1,
		"82_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"120_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"118_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"7_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs": 1,
		"39_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"1_1MLUqSEnxsRvThQEP2wqWeTFBAk9oTD4iB": 1
	}
}