{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Anonimato",
			"body": "Sei que muitas pessoas que estão aqui são como eu que querem o anonimato, então estou criando esse tópico para que aqueles que já têm um conhecimento mais avançado sobre o assunto compartilhe conosco.\n\nObs: Não apenas anonimato na network, mas também pela sociedade em geral",
			"added": 1515878081
		},
		{
			"topic_id": 2,
			"title": "Necessito de auxílio sobre criação de sites/ plataformas",
			"body": "Pretendo criar uma loteria com alguma altcoin, que a princípio é a htmlcoin, mas não tenho conhecimento sobre programação e nem muito dinheiro para contratar alguém para fazer isso por mim. Será que os zeros poderiam me ajudar? Pode ser uma plataforma pronta que fizesse isso, ou que precisasse apenas de algumas atualizações (preferiria mesmo algum bot no telegram que fizesse isso). Funcionaria assim:\n\n- Os interessados comprariam um (ou mais) ticket(s) com alguns números que o comprador escolheria (algo em torno de 10 números de 100 possíveis).\n- De todo o valor arrecadado, 70% iria para a premiação, 5% para uma doação anual para algum projeto que envolvesse a tecnologia da altcoin, 5% para um sorteio mensal, 10% para um sorteio anual e 10% da arrecadação para mim.\n- Nos sorteios mensais também haveria uma porcentagem para o sorteio anual, doação e para mim. Já no anual, seria 90% de premiação para o sorteio anual e 10% para doação de bolsas de estudos ou de algo do gênero (dependendo do valor ganho). \n- Obviamente, nos sorteios mensais a premiação seria 90% do arrecadado + o que foi arrecadado durante o mês, o mesmo é para o anual.\n- Os sorteios comuns seriam semanais \n\nAlgum dica de por onde começar? Lembrando, preferencia por bots no telegram",
			"added": 1515878920
		}
	],
	"topic_vote": {
		"1_1MsRqGycqgcFB4BfGfaBgVyjEymkAkaUt1": 1,
		"1_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": 1,
		"2_1N6X9m31AXzLQkGcA4yaD4xknsdujJCwMA": 1,
		"1_1N6X9m31AXzLQkGcA4yaD4xknsdujJCwMA": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1_13Cqt2MSFS6eu4cbVuByZBuULrEAcZAqFG": [
			{
				"comment_id": 1,
				"body": "Antes de pensar no impeachment, precisamos pensar em algo bem antes do impeachment: as eleições de 2014, 2010 e assim por diante. Pense nas eleições, Dilma e Lula defendiam amplamente os números que eles conseguiram, números esses que iam desde bolsas de estudos até pessoas atendidas pelas UPA's, ou seja, em todas as eleições ambos focaram suas campanhas em números que conseguiram. Então, por que com a economia e derivados seria diferente? Dilma claramente usou as pedaladas fiscais para benefício próprio durantes as eleições, eleições essas que poderiam ter outros resultados caso a mesma não houvesse utilizado dessas técnicas. Por outro lado, já é vazado áudios e conversas que demonstram que o voto de uma grande parte dos deputados foi para \"para a sangria\" da operação lava-jato. Com isso, acredito que o impeachment ao ponto de vista jurídico está correto, porém ao ponto de vista político não.\n\nTentei resumir o máximo do que eu penso sobre o assunto.",
				"added": 1515876949
			},
			{
				"comment_id": 2,
				"body": "Sei que está atrasado, mas para o país está sendo bom e ruim. Bom pois o governo está diminuindo seu poder em alguns aspectos e cortando gastos que levariam o país a uma quebra gigantesca (exemplos são a reforma da previdência e a reforma da CLT). Ruim pois em outros aspectos o governo tem aumentado seu poder, principalmente o judiciário, além dos gastos astronômicos do presidente Temer.",
				"added": 1515877303
			}
		],
		"1_18RRskLscCYm1uQzfdnBaEN4B1PVNBo9aX": [
			{
				"comment_id": 3,
				"body": "Pessoal devia se juntar mais, acredito que só assim para fazer a rede crescer.",
				"added": 1515877370
			}
		],
		"69_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 4,
				"body": "É basicamente um site porno, seria mais interessante algo que não fosse uma cópia do youtube, mas sim um site que se adaptasse melhor a rede.",
				"added": 1515877479
			}
		]
	},
	"comment_vote": {}
}