{
	"next_post_id": 2,
	"next_comment_id": 2,
	"next_follow_id": 1,
	"avatar": "jpg",
	"user_name": "Cuki",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Gnarly ZeroNet blob of sugar\n\n@cuki@uwu.social\n@instagram.com/cukimonstah",
	"post": [
		{
			"post_id": 1,
			"date_added": 1594039241,
			"body": "Hello ZeroMe!"
		}
	],
	"post_like": {
		"16B2kbgd9t38JMZx3U4ADd7WQHAvR3ZEU9_1594013110": 1594039376,
		"1JfAyi1JV5YaBjNZ9Jfu73TVR9Jeg7H5re_1593779967": 1594039908,
		"12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq_1593899624": 1594040393,
		"19J2Ft42BgLYFGnSsSxHAzkHb2Uv8ZtCky_1601794452": 1602728646
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Realjohndoe: I think it's better to expose/expand/advertise/whatever things like this with a more general approach rather than the privacy and censorship focus it has, as most general users sometimes seams to get kinda scared when you put privacy with a bold emphatic font in front of their eyes.\n\nWe care about privacy and censorship; sites like facebook care about their business success, and they're not shouting what they care, but what people want and they can offer, and currently a larger user-base (and thus social reach) is way more preferred for most people than fair ethical play.\n\nI believe that if we manage to get in influential actors with a numerous user tail we can get early adopters more quickly than focusing in something that, even if most of us think is indispensable as is our privacy and free speech (and I think most people would say they find it an important thing), can't be provided due to the lack of users in the platform, and thus lack of usability. \n\nZeroMe is easy to use, simple and clean, but not simply reachable, with a quite zero(not literal) active user-base, and not advertised or linked virtually anywhere (worth mentioning also that ZeroNet's social network accounts hasn't had any activity since October 2018, and thus, way less diffusion, and latest blog posts on popular sites discourages ZeroNet's use at all)",
			"post_uri": "12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq_1593899624",
			"date_added": 1594043725
		}
	],
	"follow": []
}