{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 17,
	"comment": {
		"1628395676_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 1,
				"body": "> [gitcenter](#comment_1502_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Yes.\n\n\n> [6283822](#comment_113_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe): uniqueness of public address and domain in linked with pattern, here is an example [...]\n\nIs this comment answers your query ?\nNote: replied from another device thus different Id.",
				"added": 1628793784
			},
			{
				"comment_id": 2,
				"body": "> [gitcenter](#comment_1503_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Not really....\nZeroName is decentralised to save and share domain names to network, but for retrieval part, it doesn't, consider zeroid, here user has to submit username to register, but it's just a random address creation, if you lost a zeroid keys, we cannot recover zeroid, but if we use CNS-gen, will have some data to recover the id from that data. I just say, blockchain is not necessary, but CNS don't stop you to use it, instead of manual logic, you can use blockchain to record domains.",
				"added": 1628834066
			},
			{
				"comment_id": 3,
				"body": "> [gitcenter](#comment_1505_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I see. That's a nice idea, but it's somewhat orthogonal to the problem we were discussing.\n\nCurrently CNS is in initial stage, thus time will improve the product accordingly for further needs.",
				"added": 1628845698
			}
		],
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 4,
				"body": "You may agree or not 50%-70%+- active peers are ZeroNet Mobile users, we need to make websites more mobile friendly. And promote ZeroNet on other places as much as possible.",
				"added": 1628863329
			}
		],
		"1629038529_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 5,
				"body": "> [gitcenter](#comment_1514_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I too [...]\nI don't want to make an another or better vanitygen. The goal of the project is to create a better replacement for namecoin domains.",
				"added": 1629043121
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_3220_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): How long does your system usually take for five digits?\n\nWe can not estimate this, as complete random madness for address generation of btc. some times we may search for a domain, but in mean time generator may find another in less time, this will happen most of the times. Eg: when i search for \"zeron\" \nresults :\n```\nresult : zerox took : 69 secs, pattern: E\nresult : zerox took : 69 secs, pattern: ZR\nresult : zeroj took : 91 secs, pattern: ZF\nresult : zerow took : 400 secs, pattern: RE\nresult : zerok took : 612 secs, pattern: -4\nresult : zerok took : 612 secs, pattern: CO\n```\n\nObserve those results as, all are 5 letter domains, so we don't get smaller domain(option will be provided in future),\nno private/public key will be outputed, as they are not necessary(i will provide an option to show them).\n\nEstimated Avg Time for 5 letter domain will be around 5-10 mins with cpu. This time is based on manual testing by me, while implementing the code.",
				"added": 1629044528
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_3224_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): small Independent Blockchain of our own [...]\n\nExactly, this is my thought, CNS-gen only provides integrity with patterns for an address, blockchain maintainers then use this data to store the data.",
				"added": 1629130073
			},
			{
				"comment_id": 9,
				"body": "Yeah because, we don't have any integrity in vanity addresses, they just give us flexibility.\nAn Example would be, without going to ZeroHello Page, find which one these below is ZeroHello Address\n```\n1HeLLo4rGB3ZWaRfR3ApMg488eUZnHfxJN\n1HeLLo4uzjaLetFx6NH3PMwFP3qbrbTf3D\n1HeLLo45Hr2wrRynAqNjdtNU4NsyQMruWL\n1HeLLo4dPRDrGCRrfUED1mEE4msUHVxUVF\n1HeLLo4dR2JFPspYm8o6eVM98ZBAbU613D\n1HeLLo4bHvwBbf8S3Et589MzAcZRpCmi3d\n```\nbecause they all starts with 1Hello, we will not able to differentiate them, this is the problem with tags. If someone takes this as a weapon and use this, the problem will becomes huge.\n\nSay for example, someone hacked my google account(don't worry it's 2FA protected), without my knowledge released an update to ZeroNet Mobile and replaced the default ZeroHello Page in the App, Whole ZeroNet Mobile users will seed that site in instant speed.",
				"added": 1629132287
			},
			{
				"comment_id": 10,
				"body": "> [gitcenter](#comment_1524_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Namecoin--it guarantees that ZeroNetwork.bit ...\n\nCNS will store these addresses generated by CNS-gen as namecoin with/without blockchain, making sure that they are unique. if other providers like to integrate CNS functionality into their system, they can query CNS to get integrity of those addresses.\n\nRemember CNS and CNS-gen are 2 different things, where CNS is a Service provider to Store the domains.",
				"added": 1629136014
			},
			{
				"comment_id": 12,
				"body": "> [gitcenter](#comment_1526_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Please elaborate. [...]\n\nBitcoin Addresses: Completely Random.\nVanitygen: Gen a Semi Readable Address but don't have integrity in them.\nCNS-gen: Gen a Address with a pattern linked to domain\nNamecoin: Will add any valid btc to its blockchain. even those by CNS-gen\nCNS(or Other Impl): Only Accepts BTC Address, which are valid with domains linked with patterns.\n\nProblems of Namecoin:\nWe cannot integrate namecoin into every client, because of it's blockchain size, \nnamecoin is hard to mine or buy for most of people, this is one of the reason my site doesn't have valid .bit address.\nnamecoin will only has one extension for domain.\n\n\nCNS will give flexibility to providers to provide custom extensions.\nSuppose on internet, a user wants to register a domain with \nmywebsite.com, but if someone already registered that domain, he has an options like mywebsite.in/.org/.co...\nbut namecoin will has .bit domain only, no one tried to create other blockchains, i know .eth etc exists but they are not for btc.\n\nCNS implementations will have their own extensions, for example name.yo will have .yo extension for CNS space, where name.yo will become provider for .yo domains.",
				"added": 1629140386
			},
			{
				"comment_id": 13,
				"body": "Consider ZeroName\nHow many of you, use .bit domains ?\nZeroName has currently 7528 domain now.\nDo you know that, there are 1081 domains in them pointing to single address 14VnXCD5dNjcTkc87GMnhizwJ3Rf2Qbrxq ?\nSimilarly 1NAMEr1kPi3WcT1shaVL6ozYF5bU9oDVG9 has 798 domain names registered.\nSimilarly 1GirLS7mNQNLjJUVwgWvKTkam8z31fhQ5R has 767 domain names registered.\nSimilarly 15GAu5QYg34TLzD4b2WMpZSid9S2K6M54h has 247 domain names registered.\nSimilarly 1MaGiC7b8zqNwL3BvN6ZAzwZVPQ3tjF5hw has 115 domain names registered.\nSimilarly 1GirLyURo4TcYDx6vP3Tp7KVZoRRhtGWFA has 177 domain names registered.\n\nsome useless stuff also exists like \"empty\" has 16 domain names registered.\n\nDon't you think, this is some kind of spam in every client.\n\nOut of 7528 domain, only 1937 address are unique.\nCNS address spaces will avoid these type of issues as well.",
				"added": 1629142657
			}
		],
		"1629131195_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 8,
				"body": "> that it's very broken.\nIn what sense ?",
				"added": 1629131521
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_3227_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It just doesn't work. It says \"downloading,\" but fails to install.\n\nFrom Play Store ?",
				"added": 1629136204
			},
			{
				"comment_id": 14,
				"body": "Most of those bugs, will be fixed by latest beta. Play Store takes days to publish an update. It's already 3 days since update is submitted still not available for users. Once I consider beta had no issues reports by users update will be rolled to all users.",
				"added": 1629146355
			},
			{
				"comment_id": 15,
				"body": "> [zeroseed6e](#comment_28_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj): This new beta includes the v3 patch?\n\nYes.",
				"added": 1629297238
			},
			{
				"comment_id": 16,
				"body": "Try Latest beta from github releases.\nhttps://github.com/canewsin/zeronet_mobile/releases/tag/v0.8.1-beta-14",
				"added": 1629297627
			}
		]
	},
	"comment_vote": {}
}