{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1567289433_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 1,
				"body": "hopefully her parents share your enthusiasm, otherwise you're going to be disappointed.",
				"added": 1567410840
			}
		],
		"1567301440_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 2,
				"body": "this is some kinda shitty pasta right, tell me that's what it is",
				"added": 1567410935
			}
		],
		"1567260953_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 3,
				"body": "wartime propaganda. i'm sure someone will come along soon to dispute me, but hey, occam's razor. germans being highly efficient HUMAN BEINGS make it highly unlikely they had some sinister \"evil\" agenda to just wipe out 6 million people, with no explanation ever forthcoming from jews as to why.\n\n>be german\n>want to wipe out 6 million bagels\n>quick adolf give me a good reason\n>uh hrmm uhh ohh I got it, they have awful food!\n>say no more senpai\n>himmler, get me the tickle machine of death",
				"added": 1567411204
			},
			{
				"comment_id": 5,
				"body": "> [memesadler](#comment_113_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S): You can also point out that one of the most common citations is the Nuremberg Trials, which are bad evidence as there wasn't really much aside from Germans getting their balls literally busted by Jewish Americans to confess to the 6 million number. Electric dance floors and holocoasters aside.\n\nyeah, that last bit about the krauts having their nuts placed in a vice, while hung from the ceilings upside down and howling like wild beasts is something I won't soon forget in my mind. you will confess to pretty much anything at that point.",
				"added": 1567412349
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 4,
				"body": "You don't follow CIA leaks? It's already been confirmed Earth is inhabited by exo-humanoids, but they aren't classified as such because of their relationship with our planet being longer than humans have been in existence, thus they aren't called extraterrestrials but rather intraterrestrials. They have bases all over the planet and have been around for hundreds of thousands if not millions of years. They may not be native to our planet the way we are, but this context is something we as humans see rather obtusely, because in the larger context of the universe, many species disregard such ideas as native homeworlds, since life can and will spawn and replicate in any hospitable environment. The greys are foreign, but have been here longer than us, making our claims of ownership here null.",
				"added": 1567412217
			}
		],
		"1566944519_1587xjW5S4aJd1JKmLEsv1WRruZoWXokX9": [
			{
				"comment_id": 6,
				"body": "The purpose of living is objectively to learn, and this is self-evident in the many experiences that you, as the user, are capable of choosing to experience and not experience. Pleasure/enjoyment are chemical rewards that prompt you along the path of learning, not the motive to learn nor the ultimate reward for learning from any particular experience. The reward is the experience itself, and it can manifest itself in any form, pain, pleasure, sadness, horror, etc.\n\nTo isolate one particular sensation, which itself is widely understood as a tool for goading along the less intelligent who will continue existing for more and more momentary flashes of pleasure, is an unfortunate neglection, intended or not, of every individual's manifested will.",
				"added": 1567427288
			}
		]
	},
	"comment_vote": {}
}