{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1527351127,
			"title": "Can we still reasonably enforce an ban on child porn?",
			"body": "Seeing, that decentralized networks are on the rise now, I think think is an interesting question to think about and one that has to answered fairly soon. \n\nI personally think we should no longer ban child porn since enforcing that ban is:\n1) Really expensive\n2) Does not solve the problems it(the ban) intended to solve.\n3) Leads to more and more extreme surveillance measures, because anonymous and decentralized systems are slowly getting more and more traction(freenet, gnunet, tor, i2p, ipfs, blockchains, zeronet just to name a few).\nOpinions on that(and the question)?\n(Credit for raising that question to me: @CoinCloudGuy)",
			"added": 1527351126
		},
		{
			"topic_id": 1529178927,
			"title": "Zeronet on tails",
			"body": "Does anyone know (or can figure out) how to use zeronet within [tails](https://tails.boum.org/)(clearnet!)?\nI've just seen a post on millchan asking the same question and I couldn't find much about it.\nThe only things I found where [this](https://github.com/HelloZeroNet/ZeroNet/issues/610)(clearnet!) issue on github and [this](https://www.reddit.com/r/zeronet/comments/3o536u/any_chance_of_zeronet_working_on_tails_debian/)(clearnet!) post on the zeronet subreddit, both of which are unsolved and 2 years old. I don't know nearly enough about the inner workings of zeronet or tails to do anything, but the ability to install it on an tails flash drive, would immensely increase the anonymity and security of zeronet.",
			"added": 1529178925
		}
	],
	"topic_vote": {
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": 1,
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"1529178927_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": 1,
		"1530777929_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 1,
				"body": "Wow, I was prepared for a pretty hefty backlash, I did not expect you people to agree with me on this. \n\n> [coincloudguy](#comment_6_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ): It is nice to see, that I can inspire people enough to think about and question this more.\nYour arguments were convincing, it doesn't make sense not to change my mind, if I find no counter argument against something.\n\n> [deepfake](#comment_18_1M3M7mVoyXYtWz3aq6BG4fP2fwjdv7Rxj1): the decentralization does not make anyone safe, videos saved in zeronet is not encrypted, just do a media search to your computer and you'll see what I mean.\nNot by default anyway, but the point is it is really hard(near impossible) to take it down and with tor as anonymization people don't know who downloaded it only that it has been downloaded.\n\n> [thunder33345](#comment_99_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): yes, if party consented to such action in good faith that they made the choice voluntarilyi dont see how this can go wrong, in my own book if everyone consented there's nothing morally wrong in that said action(of course consent is harder to enforce then arbitrary long lines of stuff to enforce) [...]\n> [styromaniac](#comment_33_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It should be about consent. The arbitrary age barrier is ridiculous. If you're 18 and you date a 17 year old, statists will call you a pedophile. [...]\nThat is a thing that many overlook, if you were to legalize child porn rape would still be illegal.\n\n> [nzrcbotnet001](#comment_25_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f): Then again, I wouldn't go out there on the streets with a sign saying 'legalize child porn'. That would be, very stupid.\nTo me, that is part of the problem of making child porn as illegal as it is today.",
				"added": 1527404448
			},
			{
				"comment_id": 2,
				"body": "> [blazar](#comment_29_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83)\n>The only efficient way to ban child porn is to punish the makers IRL.\nHowever this assumes that the makers are the root of the problem. I've been following CoinCloudGuys path these past few days and I'm quite unsure whether or not the makers of child porn are the root, now. Because while child abuse(like in hurting them) cannot be tolerated and must be destroyed, I (in theory!) can certainly imagine ways of making child porn that would not do any harm to the child. Neither physical or psychological.\n\n>In ZeroNet you can block zites and users personally for you. It will cut down at least a part of possibilities of distribution.\nBut wouldn't that solve nothing, since (kind of by design of zeronet) the people seeding a zite will be those, who use it. Therefore and since the distribution between pedophiles is the main focus anyways, not the distribution between pedophiles and normal people(after having spend some time researching pedophilia and pedophiles this kind of sounds really insulting, now), that wouldn't really accomplish anything, I think.\n\n> [styromaniac](#comment_37_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):  \n>I've lived my life being looked at as a pedophile\n>I'd have dated those born as late as Denise\n(I'm assuming that, whoever Denise was, she was somewhat young)\nSo are you a pedophile, then? Or rather: Do you see yourself as a pedophile?",
				"added": 1527618223
			},
			{
				"comment_id": 4,
				"body": "> [blazar](#comment_30_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83)\n>But psychological part is very complicated.\nI'm confused. Do you mean the psychological effect on the child or the psychology in perceiving what constitutes as a child? If you mean the psychological effect on the child, than read the answer I gave to thunder33345 in this post, since I explained my thoughts on that there.\n\n> [blazar](#comment_30_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83)\n>ZeroNet is technology providing a natural way to organize community based network. So the question of censorship must not be solved by centralized way and will. Every user can contribute own effort to make ZeroNet better. Thus healthly self-moderated community is the key to the solution of the problem.\nWhat problem does it solve exactly? Wouldn't that just force the pedophile community and the normal community further apart? Since like pineapples said, there is no way to remove/censor childporn from zeronet:\n> [pineapples](#comment_5_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i think that the only thing a zeronet user can do about cp is to not seed it. if you stumble across it remove the zite from ur data folder or block it so that you dont accidentally visit that zite again. those who wish to view it and make it always will find a way to do so, therefore there is no point in trying to censor it. its a difficult issue to deal with and given the way zeronet works, there is no way to censor it on this platform\n By refusing to talk to each other(or rather listen to them) wouldn't this only worsen the situation?\n\n> [blazar](#comment_30_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83)\n>The only thing will remain is to catch pedophiles IRL.\nDo you mean catch those who attack children or in general? Because if you meant in general, to say that would be difficult would be an understatement. As far as I know pedophilia is kind of like a gentic(?) thing that you're born with, I've seen estimates that the percentage of pedophiles inside any given population range from 0.04% all the way up to around 25%. Assuming that applies to the worldpopulation, that would, on the low estimate, mean catching 2.8 million people and somehow deal with them(or god forbid, dispose of them). On top of that you would need to deal with 0.004 times whatever the global birth rate is of people, since pedophilia seems to something you're born with.\n\n\n> [thunder33345](#comment_102_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K)\n>Yes but what about consent? yes you can do that without any harm on them but what will they think in the future?\nThe more I think about this the more it fascinates me. If I think back to my childhood, my relatives(parents, cousins...) would have me do weird things(from the perspective of 8 year old me) pretty often, like leaning an instrument or how to play tennis and I didn't understood why I had to do these things/go there twice or thrice a week and subsequently didn't want to. After some time I really enjoyed being there and doing them. I had fun doing the very same things I previously hated doing/didn't know existed. Now, to me, it wouldn't really be that far of a stretch to extend this to sex as well. That is, to see sex as some kind of free time activity a kid can do, just like tennis, playing instruments, art classes or what else there is for kids. I'm not saying that all kids will like it, it would depend on their personality, some kids won't like it and move on to piano or tennis. What fascinates me by this is: Imagine yourself being a kid again, would you have minded joining a 'sex-club'? Would you regret it now if you had done so?\nFor me, I think, the answer is no, I wouldn't have minded that. That of course is not to say I would have enjoyed it, but I really don't think I would have regretted it.\n\n> [thunder33345](#comment_102_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K)\n>where people take pictures of them and share onto the internet without asking them?\nThat would be shitty, no question, but there are also the cases in which they where asked and agreed, or where they uploaded the images themselves, like styromaniac said:\n> [styromaniac](#comment_33_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There's no reason that minors should be on a sex offender list just because they took a nude selfie. Non-consensual porn would still be illegal.\n(this text is only for separating the quotes)\n> [thunder33345](#comment_102_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K)\n>You might be able to not cause harm onto them but that dosent mean it's all good, there's more to conder\nThere is always more to consider, as blazar said, psychological part is very complicated, but I'm not quite sure whether these would be edge cases or the general rule.\n\n\n> [styromaniac](#comment_47_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Make ZeroNet illegal and every user is labeled as a sexual abuser of children.\nIn that regard I have the exact same opinion as CoinCloudGuy: This shouldn't be possible, at all, some string of ones and zeros should not, ever be able to render an entire network unusable. This is a problem with blockchains more that it is here(at least for now), but I absolutely agree with him here.\n\n> [styromaniac](#comment_43_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Denise is the owner of KopyKate.\nOk, thanks for telling me.\n\n> [styromaniac](#comment_44_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd)\n>But hey, it's mostly men who are treated like that, so what do I care?\nThat's something I noticed, as well and I can't figure out why that is. Maybe because women are generally viewed as motherly/mothers?",
				"added": 1527753602
			},
			{
				"comment_id": 7,
				"body": "> [thunder33345](#comment_103_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K)\n>i wont consent people taking picture of me and sharing it onto the internet\nI'd see no harm and would allow it, but I guess that is more of a personality difference than anything else.\nOtherwise I absolutely agree with you and have actually nothing more to add to that.\n\n>(one side note i like about this place is we can have civil discussions on quite controversial topic without fear of anything(since it's decentralized) and most times people can keep their cool and dont resort to throwing insults but respond with rational constructive arguments)\nI think the reason on that is(at least in part), because this community is still pretty small and only has few active members. I'm sure that we'll see a shift in politeness once Zeronet gets some real traction(I'm talking like 20,000 new users per week traction). But yeah, this is nice, being able to talk calmly with other people about (especially)this matter.\n\n> [blazar](#comment_31_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83)\n>I mean psychological determination of pedophile and reasons of such deviant behavior. This is the most important subject for today because radical pedophilophobia is dangerous phenomenon for people just like another witch hunt.\nI agree, to further add to this I'd like to quote what CoinCloudGuy said somewhere else:\n>to me, the very concept of banning data is laughable. Banning of any kind of data, leads to logical conclusions, that can only be described as dumb, it is borderline impossible to enforce and mathematically guaranteed to fail, at about any point in the chain of actions, that need to take place, to ban some piece of data. And in case of CP, this gets extra stupid, because of unnecessarily(and unreasonably) high punishments, the, more than fuzzy, definition on what CP even is and the fact, that the lack of reason, forces people to have to just accept some absolutes(like all pedos are threats to children and so on), for no reason other then, they have to be true in order for the CP ban and the hunt for it, to even be plausible\n(If someone wants the source (or me quoting the rest) of his post I will give it to you. It's just that I don't want to give the place this was posted on attention, as it is a pedophile-forum)\n\n>Psychological effect on the child is complicated question too but generally it comes from physical effect (and probably from observation of a physical effect). Moreover: there are a lot of adults with infantilism and some childs with adult world view.\nI agree with that, as well.\n\n>ZeroNet is just technology - not a network. Social problems should be solved not with technology in general.\nAgain, I agree with this.\n\n>I mean arresting criminals and preventing crimes.[...]\n>If pedophile community will stay away from the normal one then it will be much more easy to identify and catch them.\nAre you saying that pedophile==criminal therefore we must catch them all or am I misinterpreting you(because I think I am)?\n\n>Also distribution of a child porn will not use resources of normal community.\nI don't think it would've anyway, since the only people seeding a zite are those who use it. So the only way, that resources of the normal community would be used is if someone visited an childporn zite, did not delete it immediately after realizing what it was and forgot about it.\n\n>There must be more reliable ways.\nYou mean as in identifying pedophiles?\n\n>Anyway strong and healthly community is the solution.\nMaybe, but what exactly would a 'healthy community' be?\nAnd more importantly: How would it(ideally) react to the pedophile community?\nIgnoring? Banning? Smiting? Understanding? Discussing?\n(This sounds a bit aggressive the way I worded that, but I didn't intend for this, to be aggressive in any way toward you, I was just wording my thoughts about it.)\n\n\n> [styromaniac](#comment_48_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd)\n>I can imagine that change to age of consent will lower the bar for how victims are treated after the fact to how adult victims are treated.\n>\n>So the problem is bigger than an age group.\nI never really thought about that. However that is injustice anyway, because the law for that would work and would be fair, if only enforced(so this would be 'Law: intact' and 'Enforcement: broken' instead of 'Law: broken' and 'Enforcement: intact'), it makes it different kind of issue and therefore is somewhat of a mood point in this context(however definitely not to be ignored either), I think.\n\nOn the issue with the blocklists:\nI agree with @thunder33345 here:\n>While on clearnet it's acceptable that only few person have control of the \"block list\"here, it's not the same, if i disagree on you blocking the site, i will just fork yours and advertise mine with reason why you should use mine not his, and then all hell will break loose, we will end up with millions of blocklist because everyone disagree with everyone on if one which sites should be blocked or not. Which is why i think this wont work without some sort of self/community moderating system\nand @quantumkitty here:\n>Here's another way to look at it: You can't undo child-abuse by simply deleting a file. The abuse has already been done.\nand here:\n>The only thing that will ever work on ZeroNet is a moral deterrent. Ultimately, ZeroNet is a place of self-responsibility. People here are expected to control themselves, not control others.\nIn addition to that I'd like to add: Default blocklists are, however, a type of censorship, which is exactly what we wanted to avoid in the first place. \nThere is also the problem of where to stop blocking stuff. Just Videos? Images? Audio? What about lolicon? Also block out discussions between them? And why stop there? Why not also block 'that annoying Nazi stuff', that will eventually wash it's way here? Why not the 'communism nonsence'? Why not...\nI think you see what I'm getting at. Finding a spot to stop blocking is really hard and justifying why there and not just one step more to others is even harder than that. \nAnd than there is also the problem, that moral is primarily taught/learned, not something you are inherently born with, which means, that whatever is defensively crossing lines for you, is not crossing anything for the person next to you.\n\n\n> [quantumkitty](#comment_91_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Ultimately, ZeroNet is a place of self-responsibility. People here are expected to control themselves, not control others.\n> [quantumkitty](#comment_92_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Which is why - if you really want ZeroNet to remain free - you should think about bringing back old school vigilante hacking.\nBut these to statements directly contradict each other...\nOr did I misunderstood you?\n(What I got from it: We do not control others, only ourselves <=> We will attack them)\n\n\nOn a (kind of related) side note: I feel like there is an argument to be made here, that once a piece of privacy enhancing, secure communication software(the ones made, to protect those in need of protection) is published, pedophiles are consistently the first ones to use them(for examples see: I2P, Freenet, Tor, Zeronet(or rather BitTorrent in general), IPFS and so on).",
				"added": 1527881293
			}
		],
		"1527723582_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": ">Bug?\nIt does look like it, I had to reinstall the zeronetbundle(and transfer the data-directory and so on) in order to get the update to rev 3468.",
				"added": 1527747626
			},
			{
				"comment_id": 5,
				"body": "Is there a way to report bugs to nofish(the dev) from inside zeronet?(I don't have a github account)\nI've written to him through a comment on ZeroBlog now.",
				"added": 1527754287
			},
			{
				"comment_id": 6,
				"body": "> [xinyi](#comment_1_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f): Code is also hosted within ZeroNet by nofish using Git Center. You can report issues there - http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/issues/?1P4w4Rvh4vS9r6G5xTiSh8qEW87EKZtnJB\nThe last commit on there was on Apr 29 2018. This repo seems abandoned, unfortunately.\n\n> [styromaniac](#comment_50_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd)\nSide note: I wish the updater only updates to stable revisions unless the user elects to install unstable revisions.\n\n> [vanadium](#comment_3_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL): It does look like it, I had to reinstall the zeronetbundle(and transfer the data-directory and so on) in order to get the update to rev 3468.\n\nOk, I figured out what is happening: In the past the update-button would just be downloading the latest version from github, which is always the latest and most recent rev. ~~Some update (probably rev3465) changed that, instead of github~~ If you have visited and downloaded [this](http://127.0.0.1:43110/1UPDatEDxnvHDo7TXvq6AEBARfNkyfxsp) zite before, the new version is downloaded from there. This is good, since zeronet now only requires external clearweb sites if you are installing it(where it will still download the latest version from github). This leads to that weird situation, that you press update on a freshly installed rev3470 and it 'updates' you to rev 3465.",
				"added": 1527825836
			}
		],
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 8,
				"body": "There has been some talk about this all the way back in 2015. I think this has even been a goal in the donations page. But (as far as I know) the implementation got really hard to do and halted until now. str4d did some work on the i2p branch but there has not been any commit since Jul 30th 2016. But I agree i2p would make zeronet MUCH more resilient.",
				"added": 1528487824
			}
		],
		"1529178927_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 9,
				"body": "> [defrag](#comment_4_1FBFntSrJYhDuQhSsr1duVRGa45DyWnAem): Zeronet isn't another Tor lol.I don't really think it would increase it so much.\n\nJavascript is currently the single biggest security volubility on zeronet right now(and it is required to be activated in order to use zeronet), which would be completely negated by using tails(ignoring all the security and anonymity improvements that tails already brings out of the box).\n\n> [solved](#comment_20_1KY1YYCNH5sDor7yu19jEr5yMtiZ5QyWwu): it seems it should work normally. Tails already has TOR, so you don't need to run another TOR within zeronet. The github issue says they made it work in the end\n\nIt doesn't work for me and the github issue also concludes that it doesn't work:\n>If the exact reason could be identified I could follow up with Tails to[...]\n>and restarted Tor, but that didn't help. It's likely multiple changes are required [...]",
				"added": 1529263525
			}
		]
	},
	"comment_vote": {
		"60_1J6csQA9K9NZaYUiCG5C2XQRF85yB5PGaJ": 1,
		"98_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"6_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": 1,
		"29_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"30_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"102_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"5_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"47_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"45_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"44_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"43_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"6_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": 1,
		"92_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"91_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"106_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"105_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"49_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"103_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1,
		"31_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"48_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_15kHQPHwsB18wZyPVftd49ZBdncgdTmA4f": 1
	}
}