{
	"title": "中国正在被“染黑”",
	"description": "本博客只有一篇博文，如若认可，望能帮助传播。",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 9,
	"demo": false,
	"modified": 1531356955,
	"post": [
		{
			"post_id": 8,
			"title": "中华民族正陷入被“染黑”的险境",
			"date_published": 1531341807.761,
			"body": "_内容摘要：在推行“一带一路”政策之前中国就已经存在一定数量的黑人，他们大多数属于非法滞留，他们也已经给中国社会带来了困扰，而随着“一带一路”政策的持续推进，中国的黑人问题将会因此加速和加剧。_\n\n　　近几年，我们频繁地看到包含“中国对非洲援助”“中非合作交流”等字眼的新闻见诸报端，这几年中国对非洲投入了大量的贷款和投资，甚至2017年的一部热门电影《战狼2》也是以中国对非洲的援助和投资作为大背景拍摄的。而这种种国家行动的背后则是中国政府大力推行的“一带一路”政策，其目的是试图增加自身在非洲的影响力。\n\n　　非洲，一个黑人占绝大多数的地方，那里经济落后，那里的人习性也落后。而在非洲土地上的两大宗教分别是伊斯兰教和基督教。关于非洲的发展，西方有过很多讨论，FT中文网2017年在《非洲：中国雄心的试验场》的报道里提到“欧洲和美国把非洲视为一个令人担忧的不稳定、移民和恐怖主义的来源——当然这里还有宝贵的矿产。”但是中国政府却无视这些不利情形带着大量的贷款和投资积极投身进入，随之而来的还有“中非友谊”“中非交流”。这里不探讨这些国家行动对非洲发展的影响，而是反过来看这会对中国社会可能带来什么影响。​​​​​\n\n　　随着中国的大力援助和投资以及和非洲的往来变得密切，必然会增强非洲黑人向中国的流动，而他们很有可能把黑人问题也一起带入中国。美国的黑人问题人人都有所知晓，他们好吃懒做，秉性粗鄙，信仰极端宗教，犯罪率高。黑人问题给美国社会带来了不小的困扰，而中国似乎正主动寻求这种困扰。\n\n　　其实中国开始对非大肆援助之前就存在一些黑人问题：改革开放以来，随着中国经济的繁荣，便有着一定数量的非洲黑人来中国淘金做生意。珠三角是他们的首选，而广州则是他们的聚集地。只是之前来中国的非洲黑人数量不算太多，聚集地也比较集中，所以大多数民众对中国的黑人问题没有什么感知。\n\n　　如果有关注广州黑人问题的人应该多多少少看到过带着这些字眼的新闻“黑人在中国如何玩弄女人”“黑人一过边检便撕毁护照，以便让中国政府无法遣返”“非洲黑人在中国和中国女人结婚生子”“在中国的黑人非法滞留的占大多数”“和黑人恋爱感染艾滋病”。例如凤凰网2018年的一篇报道《被称为“小非洲”的广州，黑人数量破50万》，搜狐新闻2018年转载荆楚网（楚天都市报）的一篇报道《两名武汉女大学生被同一黑人感染艾滋病》。\n\n　　广州黑人的问题其实一直是比较让人担忧的，他们的到来必然会给汉人社会带来某些影响甚至是改变。而近几年中国政府的“一带一路”行动为这一趋势插上了翅膀，使中国的黑人问题变得让人无法再忽视。\n\n　　2018年7月12日曝出的“无锡职业技术学院以及川北医学院为黑人留学生腾挪宿舍事件”以及其他高校陆续曝出的黑人留学生得到区别于中国学生的优厚待遇、高额助学金等新闻得以让更多的人们关注到非洲黑人进入中国的问题。我相信近几年大家都能感受到在中国的非洲留学生开始增多，如果说这只是众多学校在主动招收非洲留学生并给予优厚待遇而背后没有政府的积极推动显然是说不过去的。非洲黑人留学生的增多也开始给社会带来问题，如天涯社区2017年的一篇爆料《一黑人留学生拦着妹纸要号码，加后各种骚扰猥亵，被妹纸曝光！》爆料中的微信截图显示一名黑人留学生赤裸裸的对中国女学生进行性骚扰。\n\n　　当政府无视大量黑人进入中国可能会给中国社会带来问题，而大肆搞“一带一路”“中非友谊”“中非交流”，这无异于在玩火。人的社会是盘根错节的，当一定数量的黑人进入中国，融入中国社会之后，在这个社会中就可能再也分不清此和彼，“黑色”就会成为中华民族的一部分。基于黑人的习性，黑人天生自带的缺点以及他们的宗教信仰，我不认为这是一件可以让人乐观的事情，而且当一个外来族类要进入并可能要融入中华民族的时候，我认为每个中国人都应该有知情权，每个中国人都应该关心和讨论这对我们的社会将意味着什么，以及更重要的我们能我们的民族和社会做些什么。\n\n　　最后说一下可能有人会对文章里如此赤裸裸的表达对黑人的评价感到不妥，觉得“政治不正确”，我倒认为有碍于“政治正确”而不能发表真实的看法，甘愿让“政治正确”把自己约束起来才是最大的悲哀。这某种程度上无异于作茧自缚。大家看看欧洲人的政治正确为他们带来了什么，大量的难民去到他们的国土，不知恩图报，好吃懒做，抢劫强奸，那些难民还振振有词地说：这都是他们的主赐予他们的。还好在中国这类政治正确还未有形成，以欧洲为前车之鉴，我们应该明白没有这种政治正确的束缚应该是我们的优势而不是劣势。\n\n引用：\n\nFT中文网：《非洲：中国雄心的试验场》\n[http://www.xinrongnews.com/qq/20180224-d-970958.html](http://www.xinrongnews.com/qq/20180224-d-970958.html)\n[http://www.ftchinese.com/story/001073027?archive](http://www.ftchinese.com/story/001073027?archive)\n\n纽约时报中文网：《非洲人欢天喜地踏上中国投资的列车》\n[https://cn.nytimes.com/china/20170209/africa-china-train/](https://cn.nytimes.com/china/20170209/africa-china-train/)\n\n凤凰网：《被称为“小非洲”的广州，黑人数量破50万》\n[http://news.ifeng.com/a/20180306/56494119_0.shtml#p=1](http://news.ifeng.com/a/20180306/56494119_0.shtml#p=1)\n\n荆楚网（搜狐新闻转载）：《两名武汉女大学生被同一黑人感染艾滋病》\n[http://www.sohu.com/a/231251880_790649](http://www.sohu.com/a/231251880_790649)\n\n今晚报微博：《强迫学生腾好宿舍给留学生？无锡高校回应：正常调整》\n[https://m.weibo.cn/detail/4260626601732133](https://m.weibo.cn/detail/4260626601732133)\n\n唐纳德说微博：《四川南充某学校让大一新生腾地方给留学生住并且还在群内威胁学生不搬就会断电...》\n[https://m.weibo.cn/detail/4260588710112963](https://m.weibo.cn/detail/4260588710112963)\n\n天涯社区爆料：《一黑人留学生拦着妹纸要号码，加后各种骚扰猥亵，被妹纸曝光！》\n[http://bbs.tianya.cn/post-funinfo-7447867-1.shtml](http://bbs.tianya.cn/post-funinfo-7447867-1.shtml)"
		}
	]
}