{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1615234594,
			"title": "OMG I just exploded a full bottle of wine !!!",
			"body": "carnage ! rampage, blood bath !! and just a bottle full... short story... the cork was stuck. I used maximum pressure tactic. sadly the bottle, from my hand in a ultimate push, ricochted on the kitchen countertop... the bottom of the bottle had a sudden loss of integrity. sadly, gravity won, and all flown... \n\nIt was a mess ! but I loved it. after cleaning, next bottle up!  more care, already drunk ! time for a liquor ! more power ! jet fuel :).",
			"added": 1615234593
		},
		{
			"topic_id": 1615237176,
			"title": "Where is Mary Daly, the daughter of former AG Barr who protected the pedos?",
			"body": "clear net : \n\nhttps://heavy.com/news/2019/04/mary-daly-william-barr-daughter/\n\nhttps://www.cnn.com/2019/02/13/politics/barr-family-justice-department-moves/index.html\n\n\nso who will take the kill? do you agree it's a fully legitmate kill and necessary to bring order to the republic by reducing the number of Domestic enemies roaming? opinions?\n\nHow to find her? does she has children? what are the names and locations of the others daughters of former AG barr? where is the daughter of Miken Pence?",
			"added": 1615237174
		}
	],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 1,
				"body": "> [scotcyguy2](#comment_81_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Don't be so angry...just ignore them and they will go away\n\nno they won't. if they don't die, we don't live.\n\n> [bigbadbob](#comment_1251_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Just turn off your tv and go outside?\n\nfirst their addresses.\n\n> [5h1n1n9d4rkn355](#comment_2_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX): Bloodshed is not the answer. Never was in the first place.\n\nalways has. How where the childrapists defeated in North Korea? By saying to them to leave the Yallu River? How was Hitler defeated?\n\n> [testaroo](#comment_1_16CnipWrmQT4vDor6t2G7QRwartbUcDmMg): send them email and ask them for that.. tell them you want to give them some beer  [...]\n\nkids to rape would work faster.\n\n> [edgelordofdecent](#comment_803_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Like they would do that? These people see everyone else as peasants and would be disgusted if they had to hang out with the people who watch their shit.  [...]\n\nKill list was just an expression... you don't understand funny words :). Where do they live?\n\n> [cassiusalexis](#comment_15_1NNwWFmE4CJdrUJT1yS8fNgZK79t1dV3mN): They're not the problem, the ones to blame are well above them.\n\nThis is the biggest intellectual mistake that the opponents want you to believe. To kill the american forces invading north korea you get mcarthur or each soldier between you and him? same for hitler, or any war in history. even the cartels operate like this... no need to kill the president of mexico when no man dare to become police cops.\n\nto be \"western press\" aka state operatives will be seen worst than being a nazi soon.\n\nonce none dare to become propagandist for the childrapists, the will have to talk themselves, directly.\n\nit's called disintermediation. ",
				"added": 1615228579
			},
			{
				"comment_id": 4,
				"body": "dear styromaniac,\nWe are in a state of war for the survival of Mankind. let's review your arguments : \n\n1. zn negative light? worst than the various pedos hosting around ? no, next.\n2. a counter coup, aka indenpendence war 2, isn't terrorism, it's our NATURAL BIRTH RIGHT as written in the INDEPENDENCE DECLARATION. so no, next.\n3. they are killing us, by lying to us, by protecting the pedo child rapists (epstein, all associates of weinstein), they are conducting us to wars in the holly sands of ISLAM or against RUSSIA and CHINA, they cover for the election theft, constant bail out, three tier justice system etc. so no, next.\n4. We glow as the flame of liberty. Our main battle group is the People Liberation Army of China, our second battle group is the Tsar of Russia. Our third battlegroup is ISLAM as divided as it may be. our 4th little people with little hats :D. so no. \n5. watch list? Of course, they will obey me, if they aren't execute for treason. I didn't commited treason. those are just pixels. I don't write them.\n6. we don't have the same means. you are a slave. I am not. next.\n7. wrong, killing them is fun. I like multitaping and children burning alive.\n8. I don't plant to kill. I don't have skills. I just nuke.\n\nhave a nice day.",
				"added": 1615234459
			}
		],
		"1609874864_1KCXLUdxYKm5ukuc8s6kWaAdz6A7Hi8GQE": [
			{
				"comment_id": 2,
				"body": "> [transcoder](#comment_10_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): XMR FTW. BTC is not a good coin to use for the time being\n\nbtc main / xmr one of the back up ! easy to change real p2p dex like bisq.",
				"added": 1615230717
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 3,
				"body": "shit bags from the WHO... nothing else.",
				"added": 1615230752
			}
		],
		"1615234594_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 5,
				"body": "I was still holding the bottomless emptied bottle. All good - all clear - only wine ! moar !",
				"added": 1615234701
			},
			{
				"comment_id": 6,
				"body": "No, I had only 2 left of those bottle... 1 is gone... the problem was the corkscrew... it's a cheap one in plastic. And for old bottle, with dry corks it doesn't go far enough, so I forced it a little... meaning that my grip was weak to try to remove the cork. I used the said strategy... but as the my pull force was yuge, there was a reboud... the counter was hard... the sudden loss of integrity and fluid was interesting... fluid blood bath ! \n\nit's the cleaning that's less funny :).\n\nyeah weak bag... specially when the bottle is colder than the ambiant air with condensation... treasonous, even with hands... :). and it slipped.",
				"added": 1615237030
			}
		],
		"1615237176_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [
			{
				"comment_id": 7,
				"body": "If I wanted to find her, to kiss her, where should I look online? do you think she has a facebook/instagram? maybe she roams tinder with a secret account? who knows?",
				"added": 1615237232
			},
			{
				"comment_id": 8,
				"body": "mugshot : https://heavy.com/wp-content/uploads/2019/04/mary-daly-william-barr-daughter.jpg?quality=65&strip=all&w=780",
				"added": 1615237654
			},
			{
				"comment_id": 9,
				"body": "https://www.linkedin.com/in/mary-daly-bab2b43/ profil",
				"added": 1615237680
			},
			{
				"comment_id": 10,
				"body": "wedding announcement : https://www.nytimes.com/2007/05/13/fashion/weddings/13BARR.html",
				"added": 1615237721
			},
			{
				"comment_id": 11,
				"body": "knock out game?",
				"added": 1615237743
			},
			{
				"comment_id": 12,
				"body": "remember she laughed when her daddy supported those who raped our kids with impunity... she was happy to serve the pedostate. the state of the enemies of mankind... one day one day...",
				"added": 1615237792
			},
			{
				"comment_id": 13,
				"body": "how to find her home?",
				"added": 1615237813
			},
			{
				"comment_id": 14,
				"body": "\"Mr. Daly, 31, is a litigation associate in the Manhattan office of Mayer, Brown, Rowe & Maw, a Chicago law firm. \"\ncool we have an addy to track.",
				"added": 1615237893
			},
			{
				"comment_id": 15,
				"body": "1221 Avenue of the Americas\nNew York, NY 10020-1001\nUnited States of America\n+1 212 506 2500",
				"added": 1615237920
			},
			{
				"comment_id": 16,
				"body": "time to call for a drone strike... predator in the air 3.2.1....",
				"added": 1615237947
			},
			{
				"comment_id": 17,
				"body": "or maybe as they say a random baseball bat will do it... poor guy... so she will go to the funeral... hehehe...",
				"added": 1615237991
			},
			{
				"comment_id": 18,
				"body": "ied the future tomb?",
				"added": 1615238003
			},
			{
				"comment_id": 19,
				"body": "how to get her real address? because I have nothing aginst mr daly... he wil hire a new wife, with such a job, no worry for him ! a younger !",
				"added": 1615238059
			}
		]
	},
	"comment_vote": {}
}