{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1566970108,
			"title": "Geek Community",
			"body": "Looking for like minded individuals who need a community. Please only reply if you are interested in a hobby. All nationalities and knowledge levels are welcome. Looking forward to starting this.",
			"added": 1566970107
		},
		{
			"topic_id": 1567114756,
			"title": "Unable to Push to GitCenter Repo.",
			"body": "I am using the GIT bassh commands to push my local repository to my gitcenter repository but it keeps failing. I have already committed the files and included my readme.md as well as my gitignore file. it keeps telling me that my remote location has not been added. I attempt to add my remote location by using command 'git remote add --master --mirror=push http://127.0.0.1:43110/18SneSP24*********************\n\nat which point it gives me the syntax of adding a remote location again. What am i doing wrong?",
			"added": 1567114754
		},
		{
			"topic_id": 1567466763,
			"title": "Chocolately",
			"body": "I would like to introduce everyone here to Choclately. The missing package manager for  windows. Check it out. To install Chocolately for use with cmd.exe, use \n' @%SystemRoot%\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -NoProfile -InputFormat None -ExecutionPolicy Bypass -Command \"iex ((New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1'))\" && SET \"PATH=%PATH%;%ALLUSERSPROFILE%\\chocolatey\\bin\" '\n\nIf you are a powershell user you can, use\n' Set-ExecutionPolicy Bypass -Scope Process -Force; iex ((New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')) '\n\n Make sure you have administrator privs. This package manager is similiar to brew.sh for Mac. \n\nThose of you using Mac if you would like to check out Brew.sh, simply open a terminal and, use\n' /usr/bin/ruby -e \"$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)\" '\n\nYou can find documentation on these programs at their sites. \nChocolately= https://chocolatey.org/\nBrew.sh=https://brew.sh/",
			"added": 1567466760
		},
		{
			"topic_id": 1567473518,
			"title": "Post Apocalypse",
			"body": "*EDIT*\nI have decided too turn this POST into the brainstorm section of the POST Apocalypse. Instead of the scenario actually happening let us create a scenario that we will then later on play out. ",
			"added": 1567473514
		},
		{
			"topic_id": 1567613355,
			"title": "P2P Music",
			"body": "I miss the old days of p2p file sharing. I used to ove mp3rocket. Nowadays it is only about how to get it downloaded form youtube which poses it's own set of problems. Does know of a current p2p music platform? Or are we stuck with youtube downloaders? What about a decntralized p2p file network we can host ourselves? something that does not allow the use of trackers or atleast will not be infested with producers, and studio trackers?",
			"added": 1567613350
		}
	],
	"topic_vote": {
		"1567466763_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1,
		"1567473518_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": 1
	},
	"next_comment_id": 50,
	"comment": {
		"1566970108_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 1,
				"body": "> [qspitzer](#comment_76_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): It might be better to create a \"Group\" instead of a \"Topic\" so that people can have different conversations that all fall under the umbrella of \"geekery\"\n\nI don't plan on holding the group through the ZeroTalk forum. The Topic is only to get people interested and start the process. I am currently working on something that will be used when i get people who are interested.",
				"added": 1566999828
			},
			{
				"comment_id": 2,
				"body": "> [tempofunktron](#comment_8_14HL4TtDqn72eNpfEQE5WSYjRsYDr2pZ81): You're gonna have to be a bit more specific as to what kind of \"geekery\" you mean\n\nIs it not obvious? Geekery. Anything pertaining to being a geek. There are no specifics as i am usin geek in the loosest and most general way possible. IF you require specifics before you want to join then that is fine. There are no specifics. Just looking for geek minded individuals.",
				"added": 1566999899
			},
			{
				"comment_id": 3,
				"body": "Haha. No definitely not a scam. I am not going to tag anyone specific here as there are quite a few posts i would like to address. Definitely no anti-communists although i do not agree with communism. This group is just something that i want to start with people who are like minded. Basically anyone with the mindset required of those that want the anonymity of Zeronet and so they go searching for it. It is just a group of geeky people who have the hobby of exploring, experimenting, and sharing the findings with others that may hep them further their own project. Definitely not a scam. I more than happy to go more in depth but i prefer to be asked specific questions. If you want to know something more specific by all means send me a Zeromail, (thought i have not figured out how to associate my ZeroID with Zeromail. Seems that they are two completely different things.) You can also post here and i would be willing to answer your questions. As for other suggestions i will look into them. Thank you all. \n\nP.S. Please if anyone knows how find users on Zeromail or how to figure out their usernames to send them mail, let me know. I tried using ZeroID's but they don't show up.",
				"added": 1567092783
			},
			{
				"comment_id": 4,
				"body": "> [znnex](#comment_71_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Definitely definitely for SURE not a scam. Rest assured! Rest your vulnerable head... [...]\n\nI love how you can be nothing but sarcastic. It is very refreshing. But sometimes sarcasm is not what is always  needed. Please do not reply anymore if you are not interested in providing anything useful to the conversation. However if you are interested in joining the group sarcasm would make for a great addition to the group.:)",
				"added": 1567103671
			},
			{
				"comment_id": 5,
				"body": "> [homegrown](#comment_14_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX): I'm interested. Mail me\n\nI sent you a mail using Zeromail. Hope to hear from you soon.",
				"added": 1567103699
			},
			{
				"comment_id": 6,
				"body": "> [gitcenter](#comment_813_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): @redneck: ZeroMail IDs are the same as ZeroID, uh, IDs. For example, I'm gitcenter@zeroid.bit, so if you want to send me a mail, use gitcenter as username.\n\nThank you GitCenter. I got it fixed. It is the same. The problem was a misconfiguration in my content.json file that was not allowing Zeromail to call the users.json file. Zeromail did not know who i was and could not call up my mailbox. I fixed it though.  It is working now.",
				"added": 1567104688
			},
			{
				"comment_id": 7,
				"body": "> [holeyhouseofair](#comment_79_1CHaf5xV3RY8BaoknhfQBNKAYycPwjjc57): I would be interested in this\n\n@holehouseofair I completely understand where you are coming from . I can not promise there will not be rules, but i can promise the rules have nothing more than having to do with protecting the other members of the community. You know, the basics, respect, and so on. Other than that really no other rules. If you can respect you can follow the rules of the group. As for the basis and the goal of the group is to get a group of people together that enjoy doing the same thing, (i.e. geekery in general) to collaborate, share ideas, help with projects, and basically have a community based group all involved in the same thing. The reason i can not go into specifics is because this group is not controlled by one person, there is not a leader or president or anything. It will be driven by the members themselves. The members of the group will determine what goes in the group. Through communication and collaboration. \n\n> [znnex](#comment_73_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): Weirdo.\n\nNice. LMAO.",
				"added": 1567105041
			}
		],
		"1567114756_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 8,
				"body": "**EDIT** I finally got it to set the remote location. Now i have it saying that the master  branch upstream is not set. I send 'git push --set-upstream remote_path_repo master' and it freezes and does not push anything.",
				"added": 1567116085
			},
			{
				"comment_id": 9,
				"body": "> [gitcenter](#comment_816_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): ZeroNet http:// URLs cannot be pushed to. If you read the \"Beginners Guide\" or at least clicked the \"clone\" button instead of copy-pasting the URL without thinking, you'd find out the solution. [...]\n\nThat is the problem. I have already pushed to path_to_directory as well and it says access denied. i used command prompt to change the permission of the directory and that doesn't seem to work either.",
				"added": 1567176985
			},
			{
				"comment_id": 10,
				"body": "> [sargantaneta](#comment_3_19RpRPxZRcw6AvSLb4RuxqP5zgLjAzWC56): i have problems (permission denied) to push using gui git software, but works perfect from console.\n\nI am not using gui git. I prefer commandline for anything that i use if i can help it. That carries over from my Archlinux days.",
				"added": 1567185879
			},
			{
				"comment_id": 11,
				"body": "> [gitcenter](#comment_836_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Linux permissions are probably the issue. What's the output of ls -la path/to/zeronet/data/18SneSP24*********************?\n\nNo that is not the issues either. I wish i was using linux but my machine freezes on every linux distribution so i am using Shitdows. Lol.",
				"added": 1567463281
			},
			{
				"comment_id": 12,
				"body": "I have finally got my commit and branch and everything set. It finally allowed me to successfully push using git push. But hen i click sign and publish changes it says content upload failed, and my files do not appear in my repo on GitCenter",
				"added": 1567465749
			},
			{
				"comment_id": 13,
				"body": "Here is what it looks like after pushing:\n\nC:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git>git push C:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git\nfatal: The current branch master has no upstream branch.\nTo push the current branch and set the remote as upstream, use\n\n    git push --set-upstream C:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24*************\\**********.git master\n\n\nC:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git>git push --set-upstream C:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git master\nEverything up-to-date\nBranch 'master' set up to track remote branch 'master' from 'C:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git'.\n\nC:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git>git push C:\\Users\\****************\\Documents\\ZeroNet-win-dist-win64\\data\\18SneSP24****************\\****************.git master\nEverything up-to-date\n\nBut when I try to sign and publish changes it says Content Publishing Failed!",
				"added": 1567466389
			}
		],
		"1567455450_17qQYX5qjxUoLZd1WmQVZFVqNFtZLXFLV3": [
			{
				"comment_id": 14,
				"body": "If they are a pedophile how are they innocent? A person who thinks it is okay to perform sexual acts with a minor is someone who is just sick in the head.",
				"added": 1567467044
			}
		],
		"1567473518_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_534_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Wouldn't that literally be talking to myself?\n\nI see your point. But for the sake of the experiment let us say that each person who contributes to this topic is in their own little parallel universe of loneliness. Each user gets their own avatar which is \"them\" in their own little parallel. This way everyone can still talk about it but also have their own avatar that can not talk to each other",
				"added": 1567473861
			},
			{
				"comment_id": 16,
				"body": "> [bigbadbob](#comment_535_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): did we ruin the experiment by talking to each other?  but anyways,  How did everyone die?  im trying to imagine this scenario.\n\nNo you did not. You merely helped me to further the experiment. LOL. Various ways of death, looting, rioting, sickness, lack of medicine and medical services, the usual panic scene. Imagine your own town or the closest smallest city you have. Use that as a base and draw from that.",
				"added": 1567474942
			},
			{
				"comment_id": 17,
				"body": "> [iloveguac](#comment_9_1A2bJUxDcvDbsZ1ttC1fSgy6J74ghfmpxU): If there was still electric and water why would people die in a week. You can live for about three weeks without food.Anybody that has an electric stove would still be able to cook, not sure what happened in this scenario, but microwaves might still be working. Was there some sort of nuclear fallout, in which case aren't we probably all doomed? OP needs more data before we can properly role-play here.\n\nSee post about reasons for death. Usual panic scenario. I am not saying EVERYONE is dead. You just THINK they are. You havent left the house, apartment, condo, tent, etc since the second day when the rioting began. It has been quiet for two days now. You are running out of food.",
				"added": 1567475037
			},
			{
				"comment_id": 19,
				"body": "> [moor](#comment_203_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): i would explore carefully, search every corner, make notes about resources and their expiration dates. and hopefully, eventually, find survivors and plan some sort of community, that would help with survival and rebuilding whatever we need to rebuild. just very very boring. no mad max kinda of bullshit.\n\nMoor, i like your way of thinking. I did not see your comment before i changed the post. That;s okay though. i would love to have your input on brainstorming as well.",
				"added": 1567476114
			},
			{
				"comment_id": 20,
				"body": "Who would like to start? What year is it> The season. Weather? Event? Ideas anyone?",
				"added": 1567476156
			},
			{
				"comment_id": 21,
				"body": "> [bigbadbob](#comment_537_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I got one... same kinda scenario.  forget the details.  you are inside and hungry and need to go out to get food.  But there are slaughter bots everywhere... What do?  You have electricity and household stuff\n\nHmmmm. Tough. Have we figured out any of the slaughter bots weaknesses? ",
				"added": 1567476450
			},
			{
				"comment_id": 22,
				"body": "> [bigbadbob](#comment_538_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): they are electronic and drone like\n\nIn that instance i would have to say that i would strip some wiring from appliances that are no longer needed, using batteries and copper wiring as well as a switch i removed from radio, a capacitor from the power cable to my laptop and my soldering kit, i would build a quick charge EMP discharge pack. It would only be good for about 3 or 4 whacks depending on the size and amperage of the batteries but it may work. Only problem is i would have to find a way to limit the radius or then build or have prebuilt (which in real life i do have one prebuilt) faraday cage to protect my electronics. The microwave can work in a pinch if needing a wuick faraday solution. ",
				"added": 1567476692
			},
			{
				"comment_id": 23,
				"body": "> [moor](#comment_206_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): would do something similar, less brainy ('cause i can't), how would analyze the perimeter? how would you charge them with your weapon?\n\nMoor it is an EMP device. I don't need to see or be seen by the bots for it to work. It shoot out a large radius of Electromagnetic Pulsating Energy that shorts out anything that can carry and electrical current.",
				"added": 1567476934
			},
			{
				"comment_id": 24,
				"body": "> [bigbadbob](#comment_540_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): i bet you have a microwave:)\n\nI do but in real life i have actually built a Faraday cage using copper and lead and weaving it exactly into a pattern designed to catch radio magnetic frequencies and grounding them outside the house.",
				"added": 1567476984
			},
			{
				"comment_id": 25,
				"body": "> [bigbadbob](#comment_541_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): would tinfoil work for anything other than hats? perhaps a suit for flir detection?\n\nAbout the only useful thing tinfoil would be good for is to use as a blanket. Turn the shiny part in towards your body, and it would reflect your body heat back at you. Better to line the inside of jackets and shirts with it. Maybe even spare blankets.",
				"added": 1567477067
			},
			{
				"comment_id": 26,
				"body": "> [bigbadbob](#comment_542_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): perhaps the slaughter bots would detect heat signatures to find targets\n\nNow here is a good reason to have tin foil lined clothing. \n> [moor](#comment_208_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): we still have a problem, where to go after you've used your EMPs? for instance, on Dawn of the Dead (2004), girl runs away from recently undead family, gets out from the bathroom window, goes to her car, drives...\nFind the nearest piece of defensable land. We will of course have to hit somehwere and stock on food but get us out to land and i can set up snares, rabbit traps, transpiration traps and so on.",
				"added": 1567477334
			},
			{
				"comment_id": 27,
				"body": "> [bigbadbob](#comment_543_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): personally i would stay near my emp weapon and only go out wrapped in tinfoil to find a quick snack lol\n\nContrary to popular belief it would not be hard to hide our heat signatures once we get in a vehicle. For example, you said it was cold and we were freezing. Imagine the vehicle has a heater. We turn the heater on and attempt to make it as close to 98.6 ass possible. It would be uncomfortable eventually but it would keep us safe. As you said they are programmed simply so they would not be able to tell the difference between a few degrees.",
				"added": 1567477453
			},
			{
				"comment_id": 28,
				"body": "> [moor](#comment_210_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what about human like figures? can they hear sounds? would the bots, for instance, shoot through a door if it though it hear a human behind it?\n\nAgain contrary to popular belief the bots would not be able to perceive our sound as greatly as they would need to to analyze the difference in human intonation. If they are programmed simply it is because they do not have the memory storage to hold the massive amounts of data needed to analyze and recognize EVERY human voice on the planet, not to mention the filter programs need to cancel out background noise and so on.",
				"added": 1567477659
			},
			{
				"comment_id": 29,
				"body": "> [moor](#comment_211_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): alright, lets see, they shouldn't be too dumb, they would check out some sort of human like noise (if loud enough).\n\nHmmm. I know this is a little redundant but i think it would not be too hard to convert the vehicle to an EMP resistant vehicle and use the renewable resource of the alternator and the battery to generate a constant EMP field around the vehicle. We wouldn't be able to to generate too large of a field. Most likely about 300 feet radius all around the vehicle. That wouldn't fix them being able to shoot use through the doors but the massive amounts of energy generated by the field would cause a buzzing sound that would interfere with their ability to hear us. And the added effect of literally killing them if they got close enough to it. \n\nAgain get us to this piece of land and we can slowly build a barb wire fence that i could use to surround the property in an EMP field. O find one with an intact barb wire fence.\n\n I could build RF suits with portable EMP field generators. These suits would also have heat reflection and such. With the EMP field killing the bots left and right i could gather a few dead ones and examine their inner workings. Find a way to make it safer. ",
				"added": 1567478214
			},
			{
				"comment_id": 30,
				"body": "> [moor](#comment_213_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH):  how do you keep them out?\n\nEasy, the fence would do the trick. They couldn't come within 20 feet of it before shorting out and collapsing. \n\n> [moor](#comment_213_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what about large-scale scavenging?\n\nThe car takes care of that. As for gas again the suits. Of course we couldn't hold them off forever using EMP. not if they are covering the entire planet But we could at least be safe for awhile. Long enough for me to be able to come up with new weapons. I may be able to hide the body's heat signature by creating a semi-conducting chip that draws the heat of the body from the most escape parts, (i.e. the head, the feet, the hands, and store or at least dissipate. If i can at least get something small enough without the need for electricity i can at least cause a distortion in the way our heat signature is generated. Instead of hiding it completely making it seem blurred or less human like. As for weapons, they are not hard to construct with the whole world of electronic scrap laying around. Trapping them wouldn't be too hard either. We could create a quick switch building controlled remotely from the house. Generate enough human noise to draw them in, then shut the doors and turn on the static interference, it wouldn't kill them rather than blind and deafen them. We could then safely observe their behavior. \n\n> [moor](#comment_213_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH):  how far away from a major city is far/good enough? how high the terrain should be for what reason?\nTerrain would be the bigger problem. The higher the terrain the more electricity needed to generate a field of such magnitude. As for major city, we would want to be at least within a few miles. It is the best of scavenging. Certain structures such as skyscrapers would make it difficult for them to find us. And almost anything around us can be used to shield our body heat in a pinch. Some better, some not so much.",
				"added": 1567478953
			},
			{
				"comment_id": 31,
				"body": "> [moor](#comment_214_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): huh that does it i guess. any plot twist? i mean, just something to stir it up a bit.\n\nSorry i can't help it. I am a little bit of a prepper and researcher. LMAO. How about you come up with another scenario?",
				"added": 1567479413
			},
			{
				"comment_id": 32,
				"body": "> [moor](#comment_215_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): what if the bots were jews? you just need 10 shekels, 10 shekels  and they wouldn't bother you for, say 1 day, 10 shekels a day, would one get tired of that?\n\nWell we could also say that the bots were redneck, just toss em a beer and they your best friend. :D",
				"added": 1567479518
			},
			{
				"comment_id": 33,
				"body": "Bots or anything small and electronic are pretty much easy to take care of.",
				"added": 1567479581
			},
			{
				"comment_id": 34,
				"body": ">moor\nSure. We could do something supernatural. What are you thinking> Ghosts, aliens, demons, hell hounds, parallel universes, time travelers,",
				"added": 1567479961
			},
			{
				"comment_id": 35,
				"body": "I am gonna head right out of here. It is getting late but i should be back on tomorrow. Keep the conversation going. :)",
				"added": 1567480205
			},
			{
				"comment_id": 36,
				"body": "Come on now. Nothing since i was gone? LOL. Alright let's try this. In 2045 humans have learned to travel across parallel dimensions. This also allows for time travel. By doing so they have sparked anger from the devil wh send his hellhounds to take all the souls he can get? What you think?",
				"added": 1567612961
			},
			{
				"comment_id": 42,
				"body": "> [bigbadbob](#comment_564_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I think I'm still waiting for data:(\n\nHaha. I am running out of ideas. I am hopinng we can all come up with scenarios or data for each idea and either debunk or add onto it.",
				"added": 1567618091
			},
			{
				"comment_id": 44,
				"body": "> [bigbadbob](#comment_566_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): my first idea is to make a new id,   ask git for one of his many.  or delete more posts.   or possibly go outside and forget about it, lol\n\nSo no one know where nofish went? Well, his name states it all.",
				"added": 1567619241
			},
			{
				"comment_id": 45,
				"body": "> [bigbadbob](#comment_567_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I doubt he is actually M.I.A.  just my little real life apocalyptic zeronet scenario,  lol\n\nOH NOOOOOOOOOOOOOO!!!!  Nofish is M.I.A.!\n\nI thknk Zeronet just divided by zero.",
				"added": 1567619988
			}
		],
		"1567613355_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 37,
				"body": "> [satoxyn1](#comment_104_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): All music is generally transferred over Bittorrent, on private music trackers like https://redacted.ch/ and https://orpheus.network/. You still can find lots of music on Direct Connect, eDonkey2000 and Soulseek.\n\nI have tried soulseek. It seems to no longer want to connect to the network.",
				"added": 1567616407
			},
			{
				"comment_id": 38,
				"body": "> [satoxyn1](#comment_107_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Works fine for me, tried it right now. Make sure you've downloaded the latest version from http://www.slsknet.org/news/node/1\n\nAh! Different program. I have tried this one before but it wanted to loging and i could not find out where to register.",
				"added": 1567617150
			},
			{
				"comment_id": 39,
				"body": "> [satoxyn1](#comment_108_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): The registration is automatic, just type the username and the password you want. If there's no such username, it will automatically register you with the password you typed. If that fails, you'll need to choose another username.\n\nill try it out again thanks.",
				"added": 1567617471
			},
			{
				"comment_id": 40,
				"body": "By the way if anyone here is interested in creating a small group p2p network let me know.",
				"added": 1567617512
			},
			{
				"comment_id": 41,
				"body": "> [satoxyn1](#comment_109_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): What do you mean?\n\nEven using the most basic of bittorent clients wee can start a small p2p based network share that does not rely on external trackers. It would be small as we start out small, only allowing the upload and download and sharing of the files we currently have on our computers, but as the network grows we can then have more content available. I can create a Zite where we can upload our hash files and torrents we create for our shareable directories and either create or find usable trackers that have no correlation to the ones used by companies attempting to track copyright infringement. There are quite a few false reports of copyright infringement and i wish to negate this.",
				"added": 1567617751
			},
			{
				"comment_id": 43,
				"body": "> [satoxyn1](#comment_110_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq): Maybe what are you looking for is a f2f (friend-to-friend) network. Try RetroShare. I always want to spread my data as much as possible, so I'm not really interested in f2f networks.\n\nNo. I agree with you. I also want to spread my data as far as possible. But it is getting a little too difficult anymore with all the censorship. I want to create my own network from the ground up using currently available networks or protocols.",
				"added": 1567618190
			},
			{
				"comment_id": 46,
				"body": "> [schwifty](#comment_1_1AnyDvAnog1HqXEA4T8VARmoEcvLkjANEb): I've always just used uTorrent over Tor for bittorrent. thepiratebay.org and limetorrents.info work fine but use adblock of some sort. [...]\n\nI am not looking to download from central torrent scrapers. I will be creating my own zite that users can upload there hash files and torrent files to. The torrent files will only have trackers that ARE private or atleast not trackers currently in use right now.",
				"added": 1567647868
			},
			{
				"comment_id": 47,
				"body": "> [peerco](#comment_30_14mdo8Vynym8XLbab1YXoNhLndUGT3t1zi): attenzione (italiano)YT DL -> YT USER (!!!anon dl via tor does it too!!!) [...]\n\nAutomating it can be difficult yes but i hate sifting through the bullshit and covers to find the song i want only to download it and find out that someone has added their own \"custom\" shit or at the end they added credits. I don't have the time to manually edit each file as it comes through.",
				"added": 1567648781
			},
			{
				"comment_id": 48,
				"body": "> [numismatist](#comment_90_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): I've looked into taking the video title with Python and sticking it in the tag but the problem is most videos aren't tagged properly according to my specific mode of autism so I'd have to redo them anyway.\n\nMac is the easiest to tag MP4 files with. I convert all my files to MP4 anyway as it is the most universally recognized format/codec. \n\nAs for the rest, we are starting to get off topic.",
				"added": 1567650533
			}
		],
		"1567815493_14vGy5BMcRS26xrfaVZfcTuVm8XTaZv3mi": [
			{
				"comment_id": 49,
				"body": "Hey man, \n@bracken\nLook i am not going to give you experiences or anything like that. But i do know how it is to lose someone so close to you. That means so much. It feels like your life is already over. Like nothing is worth living for. I do not know who you are. But i know what you are going through. Please, i will not tell you not to do it because already you are not sure and i do not want to push you towards doing it. I am sorry you do not have many friends. I want to thank you for posting your problem here and asking for help. Please know that even though i do not know who you are i will grieve if i find out you committed suicide. Please, if you need a friend, i am here, No strings attached, i do not want anything in return, just please reach out to me before you make this decision. Allow me to talk to you, and become your friend if you will let me. Send me a Zeromail @redneck\nI sincerely hope to hear from you buddy. Trust me, i know how much it hurts. I was there. I contemplated sucicide myself.",
				"added": 1567983383
			}
		]
	},
	"comment_vote": {}
}