{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 1,
				"body": "> [robione](#comment_330_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Yes, not usually an issue, but you can \"pipe\" your mail through a gmail account and have it sanitized that way too.\n\nThe idea would be to avoid google sneaking on all your emails.",
				"added": 1571965575
			},
			{
				"comment_id": 2,
				"body": "> [merithtk](#comment_28_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): ctemplar, sure its centralized, but its ENCRYPTED\n\nI think you got lost in the conversation.",
				"added": 1572036880
			}
		],
		"1572189025_1A1dg5C3Yo1WWTTiLV5bWVWhLohjvdPUaL": [
			{
				"comment_id": 3,
				"body": "Isn't it now proprietary? Just use syncthing instead.",
				"added": 1572699743
			}
		],
		"1573145923_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 4,
				"body": "It wouldn't make much sense. On ZeroNet you are  supposed to put large files on IPFS. You could make a search engine, torrent databases are usually small in total size and you can always split it by time or tags.",
				"added": 1573154205
			},
			{
				"comment_id": 5,
				"body": "> [merithtk](#comment_79_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): I meant like writing a more native Bittorent Client for Zeronet, even if it functions just like ZeroUp [...]\nA Bittorrent client is the software you have in your computer that downloads the files described in the .torrent file. It wouldn't make much sense to have a native client for zeronet, it would just be a normal client, written in JS, that runs in your browser.\n\n> It would function kinda like that and ZeroUp, but it allows you to add external torrents\nJust a database with search functionality is easy to implement.\n\nEDIT: By that I mean a database to which people can upload their torrents.",
				"added": 1573155627
			}
		],
		"1572640590_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 6,
				"body": "digbt was a DHT crawler/search engine. You could run your own crawler and database or just look for something using those keywords. skytorrents.lol is one option.",
				"added": 1573156413
			}
		],
		"1572974675_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 7,
				"body": "> [wank3r](#comment_4_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q): how do I quote someone? Noob here\n\nLike this :)",
				"added": 1573161703
			}
		],
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 8,
				"body": "Sites are downloaded through multiple connections and after the first visit only updates are downloaded, not the entire thing.",
				"added": 1573161815
			}
		],
		"1572987956_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 9,
				"body": ">tfw no autismo-chan waifu",
				"added": 1573166668
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 10,
				"body": "vegana and bobs",
				"added": 1573166738
			}
		]
	},
	"comment_vote": {
		"34_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"35_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"13_1Q5QuuT62rrmmMVZ2yXg3LgRHwhUJtugkr": 1
	}
}