{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "РКН против всех",
			"body": "Сабж.",
			"added": 1524480938
		}
	],
	"topic_vote": {},
	"next_comment_id": 33,
	"comment": {
		"5_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 1,
				"body": "Генерал-майор в шинели громко плакал в докладной\nТеррористы охренели, нет зацепки ни одной.\nЗавели себе девайсы — интернет, секретный чат.\nИ попробуй догадайся, с кем о чем они журчат.\n\nГде ни сунься — всюду шифр. Ни отмычек, ни ключей.\nЛишь вагон арабских цифр! И причем, неясно чей!\nКак ловить бандитов буду? Никаких зацепок нет\nЕсли шлет Аслан Махмуду зашифрованный пакет.\n\nНам бы прежних инструментов! Чтобы мы в сетях могли:\nИ проверить документы, и назначить патрули\nИ явиться с понятыми — всех на сайте мордой в пол.\nКто такой? Прописка? Имя? Как давно сюда пришел?\n\nАдреса друзей и близких? Что в карманах, ё-моё?\nГде шкатулка с перепиской? Доставай, прочтем её...\nКончилась эпоха Холмса с появлением сети!\nМы бессильны! Мы сдаемся! Как нам следствие вести?\n\nНам работать трудно очень! Не хватает важных мер!\nНужно больше полномочий. Всех админских, например.\nРаскрываемости нету! Показатели в нуле!\nВот бы сети интернета запретить по всей земле!\n\nВы ж поймите, это важно! Вот вам докладной листок...\nИ сморкался в камуфляжный влажный носовой платок.\nИ так искренне, так чисто прозвучал его доклад\nЧто кивали журналисты.\n\nА потом случился ад.\n\nКак вулкан потухший, в жерло получив морской воды\nВышел Холмс, который Шерлок. И вломил ему пизды.\nВстал как призрак из могилы, из музея Бейкер Стрит.\n«Ах ты ж йобаный мудила!» — он на кокни говорит.\n\n«Я всю жизнь проползал с лупой! Под дождем! В говне! В грязи!\nПодними свою залупу да по кнопкам повози!\nУ тебя зацепок нету?! Ах ты сраный пидарас!\nНу а платежки?! Билеты?! Кучи электронных баз?!\n\nВам же треки пишут соты, где носили телефон!!!\nСука, блять, иди работай! Недоволен, сука, он!\nЯ искал следы руками! Ты зажрался, стыдоба!\nУ тебя там гроздья камер смотрят с каждого столба!\n\nКто и с кем ходил в подъезды! Кто проехал по шоссе!\nКто, куда во сколько ездил — с номерами, сука, все!\nУ тебя народ как дети: трижды в день без выходных\nПостят фоточки в соцсети — погугли хотя бы их!\n\nУ тебя провайдер каждый видит на любой из хат\nКто чего качал из граждан: порнохаб или джихад!\nБлять, ему работать плохо! Много цифры! Век не тот!\nМне бы так в мою эпоху, ебанутый идиот!\n\nИшь, сидят по кабинетам да растят на попе жир!\nСлишком много интернета! Страшный неуютный мир!\nЧем внедрять бойцов к бандитам, да учить язык фарси\nОн сидит себе, пиздит он! Шифры, блять, ему неси!\n\nЧто просить назавтра будем? Охуели, дайте две!\nМикрофоны в жопу людям? Ключ от мыслей в голове?\nБлять, вернуть таких констеблей к нам на землю из кино\nМожно лишь суровой еблей да маканием в говно.\n\nВам совсем заняться нечем! В жопе сажа, бля, горит!»\nШерлок Холмс, закончив речи, улетел на Бейкер Стрит.\n\nГенерал-майор платочком вытер божию росу:\nЕсли все согласны, точка, утверждать проект несу.\nА у нашего отдела стало больше важных дел:\nЗаведем на Холмса дело, чтобы много не пиздел.",
				"added": 1524376715
			}
		],
		"1_1L4c3c1p78xUx8DAxZvqCnj84WjLpcEECY": [
			{
				"comment_id": 2,
				"body": "В варианте чебурашки обход блокировки только через сторонний канал связи же. Спутниковые интернеты стоят мягко говоря дохуя.",
				"added": 1524376819
			},
			{
				"comment_id": 3,
				"body": "> 3-5 тыс. в месяц за мегабит\nИ там ещё и лимит на объём трафика. Как вариант раскидать оплату на несколько человек (мелкопровайдер, да) - ну может быть. Для себя - да ну нахер такие цены. Ещё стоит учитывать что контент все жирнее и жирнее, много через такую дырочку на волю не протащить.",
				"added": 1524383867
			},
			{
				"comment_id": 8,
				"body": "*nekoneko*\nА нафига, собственно?",
				"added": 1524843902
			}
		],
		"1_1LUMCFAnp4YvKKufrot9Weq15gDvRrQUCu": [
			{
				"comment_id": 4,
				"body": "И нахера оно ненужно? Любой пользователь zeronet вполне способен поднять это все и сам, без мокропись и тем более не на винде.",
				"added": 1524405976
			}
		],
		"1_1CGy56bX4ZWvSysz7x2S1SzDk2TkfNdpZ3": [
			{
				"comment_id": 5,
				"body": "Ну, гуглу обрезали 118 адресов из 915 известных. Часть из них капча, часть - гугл плей. Некоторые жалуются.",
				"added": 1524488015
			},
			{
				"comment_id": 6,
				"body": "Потихоньку подползаем к 18М заблоченных адресов.",
				"added": 1524488076
			},
			{
				"comment_id": 7,
				"body": "Там гуляла инфа что на РКН собрались жаловаться в прокуратуру, за эти их массовые блокировки. Интересно, хоть какой-то эффект будет? Мне почему-то хочется чтоб они вообще всё позабанили, иначе эту систему пятничных очередей не сломать.",
				"added": 1524496525
			}
		],
		"1_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv": [
			{
				"comment_id": 9,
				"body": "Не флоппинет, а уже флешконет скорее. Дискеты сейчас хрен найдешь уже, даже в магазинах на складах уже ничего нет.",
				"added": 1525248301
			},
			{
				"comment_id": 10,
				"body": "Напоминаю что 5 Вт это мощность среднестатистической рации. Проблемно засечь её только в глухомани, а так, в городе её километра на полтора в эфире слышно (дальше уже постройки мешают). Единственное что в плюс - их дохрена  и выбрать нужную целая проблема. А вот в дерёвне/пгт - запросто.",
				"added": 1525248555
			},
			{
				"comment_id": 11,
				"body": "**calmaquesse**, вполне представляю. Но дело в том что действующая власть имеет ресурсы для обнаружения. Разумеется обнаружат только часть передатчиков, но у кого есть желание играть в рулетку? А со спутниковым телевидинием проблема решается просто - запретить и всё. А нарушителей оштрафовать на 100500 рублей и дать условно годик. Даже если такой пострадавший будет один на населенный пункт это создаст достаточный инфорезонанс чтоб остальные владельцы как минимум задумались \"а не ну его нахуй?\".",
				"added": 1525250670
			},
			{
				"comment_id": 12,
				"body": "Ну и спутниковое тв это все таки немного другое - там же приём, передачи то не завезли. Приемопередающее оборудование оно дороже будет.",
				"added": 1525250752
			},
			{
				"comment_id": 13,
				"body": "Кстати, направленные передатчики почти всегда на диаграмме направленности сигнала имеют ответвления - так что они ещё и по бокам бывает фигачат и взад.",
				"added": 1525251094
			},
			{
				"comment_id": 14,
				"body": "Вообще ящитаю в городе нужно мутить лазерные коммуникации (в невидимом человеку диапазоне). Ещё интересно смотрелся LiFi, но световое загрязнение не даст нормально работать. Обнаружить или задавить лазерную линию без точной информации о месторасположении (вплоть до сантиметра) нереально.",
				"added": 1525251457
			},
			{
				"comment_id": 15,
				"body": "Для сумашедшей скорости у этого оборудования цены кусаются.\n\nhttp://www.koruza.net/specs/\nhttp://www.koruza.net/order/",
				"added": 1525251778
			},
			{
				"comment_id": 16,
				"body": "**strellok**, само собой. Все дело всегда в деньгах. Но что-то мне подсказывает что не будет никакого кндр-ссср у нас в ближайшее время. С 50% вероятностью в ближайшие года 3-4 вся эта пиздобратия вместе с остатками денег испарится куда-нибудь.",
				"added": 1525251926
			},
			{
				"comment_id": 17,
				"body": "КНДР не потянут. На пару тройку регионов в европейской части страны - ну может быть. Остальное никак. Только Москвабад с Питерстаном чего по ресурсам перекрыть встанет.",
				"added": 1525252060
			},
			{
				"comment_id": 18,
				"body": "Я вот наверняка окажусь в северном Китае. Они конечно те ещё вояки, но тут скорее и захватывать особо ничего не надо будет.",
				"added": 1525252238
			},
			{
				"comment_id": 19,
				"body": "**balancer73**, потому и вероятность только 50%. Как в том анекдоте про блондинку и динозавра.",
				"added": 1525255172
			},
			{
				"comment_id": 20,
				"body": "> США\n> свобод\n\nЛол.",
				"added": 1525274044
			},
			{
				"comment_id": 21,
				"body": "Путин пожалуй действительно худшее что случалось с Россией, раньше хотя бы пытались изображать какие то приличия. А так называемые элиты сейчас даже не изображают работу, не то что делать хоть что-то полезное. Дети чинуш все в медальках (стих про казачка.txt) предприятия понаотжимали и нихуя не делают, только на ютубе выступают да на машинках катаются. Нужна вам такая элита? Мне вот нет. А их зачистка даже будет благом.",
				"added": 1525274311
			},
			{
				"comment_id": 22,
				"body": "Сегодняшний уровень жизни имеется не благодаря действующей власти а скорее вопреки. Единственная их заслуга - они не сильно мешали развитию, по крайней мере года до 12.",
				"added": 1525278360
			},
			{
				"comment_id": 23,
				"body": "Тех кто хочет в СССР довольно много - просто память людей устроена так что проблемы по большей части занимаются. А при Сталине хуй стоял (с). Я к ним не отношусь - большего днища в современном мире чем плановая экономика ещё поискать надо (кроме пожалуй отсутсвия экономики как таковой, но это не считается).",
				"added": 1525278575
			}
		],
		"1_1GrBMt4edCQVq6UVg6HXS3Qj31kP5sv8LV": [
			{
				"comment_id": 24,
				"body": "**balancer73**, вот ты писал что зарплаты у учителей сейчас выше чем в совке (при пересчете). Всё далеко не так. Высокая зарплата есть \"по больнице\" в показателях, потому что у директора и завучей зарплата ~120к, а у учителей больше 20к бааальшая редкость. В регионах учителя реально работаю за копейки - у меня среди учителей/преподавателей довольно много знакомств. Даже те кто работает в ВУЗах получают довольно мало - чтоб получать 30к это надо иметь дофига часов преподавания, иметь стаж лет в 15 и неплохо бы ещё ученую степень повыше.",
				"added": 1525315238
			},
			{
				"comment_id": 25,
				"body": "Про ВУЗы даже статейка есть местной газеты. https://www.infpol.ru/news/society/129046-reyting-samykh-bogatykh-rektorov-vuzov-buryatii/",
				"added": 1525315397
			},
			{
				"comment_id": 26,
				"body": "**strellok**, Навального я тоже не поддерживаю. Внезапно, правда? Он неплохо устраивает цирк, но надо не царька менять а всю систему целиком. Проблема с людьми стоит крайне остро, да. Все кто мог бы занять руководяще-координирующие должности во власть не хотят ни за какие шиши. А те кто есть - пидорасы во всех смыслах.",
				"added": 1525315929
			},
			{
				"comment_id": 27,
				"body": "При прямом пересчете может сумма и большая, но если исходить из цен (например продуктовых) получится куда меньше.",
				"added": 1525331446
			},
			{
				"comment_id": 28,
				"body": "![различия](http://img1.reactor.cc/pics/post/%D1%80%D0%B5%D0%B2%D0%BE%D0%BB%D1%8E%D1%86%D0%B8%D1%8F-%D0%BF%D0%BE%D0%BB%D0%B8%D1%82%D0%B8%D0%BA%D0%B0-4449607.jpeg)\n\nВ тему срача",
				"added": 1525331889
			},
			{
				"comment_id": 29,
				"body": "Это я тупой или markdown картиночки тут не работают?",
				"added": 1525331931
			}
		],
		"3_1Gb5utcUxwfaHdDxr2d93QVfXEELYiawiE": [
			{
				"comment_id": 30,
				"body": "Можно, разрешаю. Мешай по вкусу.",
				"added": 1532105088
			}
		],
		"2_16LkVPwKk9BRw1dzV241FPrPCcmw7effZo": [
			{
				"comment_id": 31,
				"body": "Шариат с кадыркой в москвабаде? Легко.",
				"added": 1539663434
			},
			{
				"comment_id": 32,
				"body": "А все остальные отделятся нафиг, как минимум ДВ и Сибирь точно. За Урал хз, но вот все что восточнее запросто.",
				"added": 1539663495
			}
		]
	},
	"comment_vote": {}
}