{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1613142823,
			"title": "The Great Reset has Begun",
			"body": "New executive order signed by POTUS Joe Biden now gives banks the ability to base loans and account possession on social credit scores. This is a plan for the big banks to team up with big tech to start putting Trump supporters in Ghettos, maybe not physical but digital. You might not be able to have a plastic credit or debt card, these are controlled by Mastercard and Visa. Understand if you posted a pro-Trump or pro conservative message on social media, you will be the target. The great reset is to begin implementing U.N Agenda 2021, essentially reducing the world population to less than half of what it is now by 2032. Hidden under the \"Green Agenda\", life will start getting much harder for those who are opposed to the elites.\n\nI intend to start a zite to document these issues.  Be aware, you social media is already graded by A.I. determining how likely you are to vote for conservatives, who are now deemed to be enemies of the state. \n\nPlease comment.",
			"added": 1613142822
		}
	],
	"topic_vote": {
		"1612458385_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"1612481231_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1612458385_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 1,
				"body": "This is a witch hunt, they will be finding all the \"R\"s in the ranks and branding them with a scarlet letter.  I'm sure they will reduce the force to only people who are sheep and can be controlled by the Democrats.  They are scared of free thinking individuals, if you group think, your in, otherwise you will be removed.  Probably planning on a lot of dishonorable discharges over the next few weeks.",
				"added": 1612493301
			},
			{
				"comment_id": 3,
				"body": "> [radiator](#comment_55_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): yes, but to what end? so we can go to war with a bunch of pussy hat wearing freaks? or something more sinister, like a domestic war?\n\nThis is about control, and it's more than just a domestic type of control.  Globally this is also being done in nation after nation, control the people.  The pussy hat wearing freaks are just sheep, they follow the leaders, but Americans are a threat to the \"new\" way of life.  First they have to clean out the ranks of people they can't control.  Remember they are calling people who want the Constitution enforced, White Nationalists.  They define the terms, and what they are calling nationalist, are people who want our country back.",
				"added": 1612497288
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_2950_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe Qanon is right about this, but I've seen a lot of what I call BS from them as well. [...]\n\nSix people died is questionable.  3 of them were Capital Police, 2 of those capital police committed suicide.  1 person was shot, 1 person had a heart attack, and 1 person fell from a wall. The only capital police officer to die was beat with a fire extinguisher... but even then all the deaths are very questionable.",
				"added": 1612497600
			},
			{
				"comment_id": 5,
				"body": "> [radiator](#comment_56_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): hey, their words, not mine. AOC was almost killed. cowering in her office. across the street. where there was no violence. sacasm off now.\n\nTed Cruz and Josh Hawley almost killed her in her office.",
				"added": 1612497673
			}
		],
		"1612481231_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "This is oligarchy foot in the door, all those items are mandatory because big insurance carriers forced government to restrict freedoms. When riding a horse, there is no restriction, when riding a classic vehicle there is no requirement for seatbelts.",
				"added": 1612493437
			}
		],
		"1612410452_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 6,
				"body": "Turns out many elderly people are dying after receiving the vaccination.  There are reports from Italy where entire nursing homes of people who survived COVID19, get the vaccination and they are all dying.  Consider this, it's not technically a vaccination, it's a RNA virus that reprograms your immune system.  if 99.9% of people are recovering from Covid19, why do we need a vaccination?",
				"added": 1612497898
			},
			{
				"comment_id": 7,
				"body": "Today I heard of the second person in my circle of friends who died from the vaccination.  He was 43, a total health nut, and he works in the medical profession.  Got the second vaccination, and died 4 hours later of massive heart failure.  He leaves behind a wife and two little girls.  He was too young to die like that, but they told his wife it wasn't related to the vaccination. The other person I knew who died was 57 and it was 3 days after the vaccination, she had bleeding in the lungs.  Not sure but I really think the vaccination is worse than the virus.",
				"added": 1612873371
			},
			{
				"comment_id": 8,
				"body": "> [dulosxristos](#comment_6_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio): Turns out many elderly people are dying after receiving the vaccination.  There are reports from Italy where entire nursing homes of people who survived COVID19, get the vaccination and they are all dying.  Consider this, it's not technically a vaccination, it's a RNA virus that reprograms your immune system.  if 99.9% of people are recovering from Covid19, why do we need a vaccination?\n\nYou are right, it's not a vaccination.  After my friend died, I started reading, it's this idea of gene programming dreamed up in the same labs that this virus came from.  Do not take the vaccination, something much more nefarious is going on here.",
				"added": 1612873574
			}
		],
		"1613222411_16MefQT334xhNV3vHqjhZ1uPzrS6i4rw6S": [
			{
				"comment_id": 9,
				"body": "Many will say there isn't enough government, or the wrong government.  They will say medicine is too expensive, or it should be free.  They will say we aren't educated enough, or we need more education.  So what most people will say is they need more government, more free drugs, and free education, but to what end?  Honestly I just want to be left alone... What is wrong with the world today?  It's me!  I am a sinner, I've broken God's laws, and I am the person who's too scared to do something about the wrong I see in the world.  Shure I'll rant and complain, and tell you.. Over there that's what's wrong, but what am I going to do to make it right.  I stay in my house and believe what a bunch of lying sons of bitches tell me.  What's wrong with America, I'm scared shittless that the communist are running the country and I think they will target me for death.  They probably will, but will I stand like the men at the Alamo and die for what I believe?  I hope I can say yes, but the answer is most likely no.",
				"added": 1613238082
			}
		]
	},
	"comment_vote": {
		"55_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"56_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"91_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"57_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"23_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"6_17g1WUAj8QighQjcBVMrhFxWVN5bAKBYio": 1,
		"16_163UBLKC6u68qLy8ymG8dQKzE4KXLm75yY": 1,
		"15_163UBLKC6u68qLy8ymG8dQKzE4KXLm75yY": 1,
		"16_17TcbznXf7nXLMxHnZY8W4GAv4AbDE7WV9": 1
	}
}