{
	"next_comment_id": 52,
	"user_name": "Kaffie",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"post_like": {
		"19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935": 1492842091,
		"1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256": 1493203787,
		"1DCGj2KSETY8iSiwGFaxBJzEGFKjfBEBXK_1495171242": 1495209747,
		"1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT_1495329299": 1495330335,
		"1BaWTqUEUujxJcXvoXZhLU8TnNb1NMGJmM_1500360710": 1500377175,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1500395523": 1500415233,
		"1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1501023886": 1501032624,
		"1AABRF6MEZpwihXdJSPNdygREjis6LzD2w_1500976477": 1501032716,
		"1AABRF6MEZpwihXdJSPNdygREjis6LzD2w_1500376145": 1501033641,
		"1ETuSwJzNdmHMoywaV2NCyZfC4ChiVUJqc_1501387222": 1501416603,
		"1LgKvgvUjJkkbrNVYKyDdvSacyTXJuwmMG_1502525574": 1502532580,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1536688886": 1536716976,
		"1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1536827820": 1536830621,
		"1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1565568203": 1565578331,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1566808724": 1566811964,
		"184rhnxM89SU1gDuPEaQPjynfytkRtSEVd_1601018514": 1601022954,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1601410687": 1601630268,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1624961191": 1625195992,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1626810882": 1626828167,
		"13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1632073175": 1632090353
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Border0464fred: is correct. ZeroNet (in terms of technology) is decentralized for searching for peers, and distributed for content. Zites themselves (in terms of management/authority) are centralized with the exception of merger sites, which are federated/decentralized.",
			"post_uri": "1HxiFjyEUfLeqvXza7TqV1h4mpo167JnrL_1492072219",
			"date_added": 1492097183
		},
		{
			"comment_id": 2,
			"body": "I liked this but can't really speak. I use mac >_<",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492842110
		},
		{
			"comment_id": 3,
			"body": "@Kito: I hate the proprietary side of it, but I love the UI. Kills me. And when I think of switching off I just feel like I'm wasting money.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492921937
		},
		{
			"comment_id": 4,
			"body": "@Rythyrix: I've played with Linux a bit. Both in the past and more recently. It's just switching my primary OS that stings a bit haha. I'm too used to the convenience.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492933676
		},
		{
			"comment_id": 5,
			"body": "@Rythyrix: When I played around with it, I tried Xubuntu which was nice. Xfce is probably one of the nicer linux UIs I've tried. As for getting into linux long-term, I'd really like to go with arch. It's more my style, but looks like a nightmare to get into.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492935493
		},
		{
			"comment_id": 6,
			"body": "@Rythyrix: Ideally I'd like a setup of stuff where I know what's on my machine, understand how everything works, have as little as possible and keep everything super simple, and ultimately have a quick setup and migration time. So if I ever need to hop on a new computer I can setup real quick and go. Arch might not be the best for that though now that I think of it. I played a lot with liveboot usbs for this reason. Just plug into any computer and you've got your workstation. That idea appealed to me a lot",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492936639
		},
		{
			"comment_id": 7,
			"body": "@Rythyrix: Yeah, it's unfortunate. I feel like I'm still messing around a lot with what things I use/need/etc. and how I go about doing computer stuff. Trying to find an ideal workflow and all that.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492947037
		},
		{
			"comment_id": 8,
			"body": "@Rythyrix: Only problem with VMs is that most computers can't handle them real well and the virtual os runs real slow. I've tried it. Though that *is* how I've played with linux.",
			"post_uri": "19APmBDZBVPHNXw2eM5b7vBgzLiKG4U2ck_1492804935",
			"date_added": 1492955836
		},
		{
			"comment_id": 9,
			"body": "[Here you go.](/ZeroTorrent.bit/) That's zerotorrent which is the most popular torrent site on here. You can find streamable movies and TV shows for free over on zeronet's video streaming site [kopykate.](/kopykate.bit) There's also [zerotv (tv shows)](/1BEJbnufyav7TK23ADTs2Qi2UJeKSGDzw6/) and [play (movies)](/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/) if regular torrenting is more your thing.\n\nEdit for hacker/evil shit you're not gonna find that here. Go on Tor sites.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493117620
		},
		{
			"comment_id": 10,
			"body": "Enjoying it? More goodies on the way ;)",
			"post_uri": "1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256",
			"date_added": 1493203349
		},
		{
			"comment_id": 11,
			"body": "@DElUSiON: Look at me, I should be working on the auto-tagger and updating the index, and all I wanna do is add fun new features.",
			"post_uri": "1eQKH8VcGoV17tUEfCHad8pMix9qR8aVu_1493200256",
			"date_added": 1493204003
		},
		{
			"comment_id": 12,
			"body": "@Kito: There's a good reason for that. ZeroNet is not an anonymization network. You *can* get anonymity if you use tor, but other than that...  You're not really gonna find the stuff you're thinking of here. Perhaps a [hacker forum?](/14Z5ps3D5tpFbd1TUnqF7xjAtBW5yFuJRb) No one here cares about being super edgey.  Pretty much anything you want can be found on the clearnet too (except black markets and CP). What exactly are you looking for? There's not a secret internet or anything.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493278029
		},
		{
			"comment_id": 13,
			"body": "The actual scene is much better, tbh.",
			"post_uri": "19KFM4xs3UxrJoveyPf1FUWi3XVhR3zzAp_1493468215",
			"date_added": 1493473190
		},
		{
			"comment_id": 14,
			"body": "@Kito: There is no content that you can get on different web platforms than you can on the clearnet. Except for highly illegal things like CP or drug markets. Given that ZeroNet, like most other P2P software, is *not* an anonymization network, there's no reason for those things to be on here.\n\nAs for why one 'needs' zeronet, that varies. I think most people here are here for one of a few main reasons:\n\n1. Want to take control over their own data. Major organizations are making this less and less so. Decentralized/P2P software like ZeroNet helps fight that.\n\n2. Reduce reliance on major organizations. This one is mostly political/economic. You remove the ability of major organizations to control how you use the web, as you're no longer reliant on them.\n\n3. Avoid censorship. This is what most chinese people are here for. To get around the filters/censorship their government forces on the internet.\n\n4. Simply wanting to help develop new tech, and enjoying the decentralized web.\n\nThe main reasons to be here are *not* content. But do please enlighten me what other alternative web platforms you use explicitly for content you can't get elsewhere. AFAIK all you'd go for is CP and drugs. Since that's the only stuff not on clearnet.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1493946350
		},
		{
			"comment_id": 15,
			"body": "@Kito: Well right off the bat there's NASA, ICANN, Google, DOD, etc. You can see just the organizations for the root servers [here.](https://www.iana.org/domains/root/servers) You can find quite a bit of info on [wikipedia.](https://en.wikipedia.org/wiki/Internet_governance) And that's just for DNS and governing. For actual maintenance you've got your ISPs, and all the other hidden companies that you don't see that manage things. For just the web itself you need to look at things like host servers, namely stuff like IBM, amazon, etc.\n\nLast I checked, the average person like your or me has *0* influence over these organizations and what they decide to do with the web. Which of us decided to make .google a tld? I certainly didn't. Who says you need to be an official registrar to register domain names? I didn't. Who agrees that a single organization (ICANN) gets to allocate and sell IP addresses? Not fucking me, that's for sure.\n\nAre you comfortable with these companies essentially having 100% control over the internet and web? I personally don't. ZeroNet fixes that for the web side of things. cjdns/hyperboria fixes that for the IP side, and meshnets fix it for the hardware side. Once these systems are in place, you can have a truly free and distributed web uncontrolled by corporate/government goons.\n\nNext time you use a clearnet site, do a bit of research. Install an extension to detect how many services are tracking you. Look at how many ads phone home to different major organziations. Then look at your network traffic. If you used a domain name, look at where it's coming from: your dns, their root server, etc. For your internet, look at your ISP, followed by who they peer with. If you spend money, watch that and see where it goes. It's horrifying.\n\nIf you're just looking for content, you're better off just using the clearnet. It's popular as fuck and has more and better content than any alternative can provide. I can't give you a personal reason to stick around zeronet. Personally, I use it because of these political issues. As well as the fact that I value my control over my own data. I also love the fact that it's distributed/decentralized and is completely resistant to any attackers. This means I'm safe to do as I please without worrying about anyone meddling. I also see it as the future of the internet and web, which is why I support it.",
			"post_uri": "12YRGB3FqA45xAdU5ZE9wfGBeRQXxYPKme_1492808350",
			"date_added": 1494048037
		},
		{
			"comment_id": 16,
			"body": "[Lots of bitcoin brainwallet sites.](/kaffiene.bit/?q=wallet&i=Kaffiene%20-%20Full) Nothing called 'zerowallet' from what I've seen though.",
			"post_uri": "19yRyR57LxFjbzieSEhvyvhe4heSo7KrLa_1494026821",
			"date_added": 1494077037
		},
		{
			"comment_id": 17,
			"body": "I've yet to see an ethereum app that I'd actually use day-to-day. Whereas ZeroNet I use basically daily. It has a long way to go to win me over.",
			"post_uri": "15vJjtekghtind7a1xjLBFN96PSXDx9mso_1494559241",
			"date_added": 1494582494
		},
		{
			"comment_id": 18,
			"body": "Pedo crap? Or are you one of those over-reacting types that somehow thinks hentai/drawn stuff is bad? I need to know whether it's worth blocking.",
			"post_uri": "1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT_1495293506",
			"date_added": 1495330404
		},
		{
			"comment_id": 19,
			"body": "@Happyrabbit: I went to investigate. I didn't see anything worth freaking out about. Just regular porn you can find on clearnet. No CP or anything. Perhaps I missed it? I just checked the first couple pages of the russian board, and the first page of /b/. So perhaps it *is* just the hentai you were freaking out about -_-.\n\nThere's a huge difference between legit CP that should be blacklisted and never linked, and just loli/hentai that some users find unappealing. It's important to keep people safe without being oversensitive about it.",
			"post_uri": "1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT_1495293506",
			"date_added": 1495331117
		},
		{
			"comment_id": 20,
			"body": "@Happyrabbit: It's fine. It's just people tend to react in ridiculous ways which is why I asked for clarification. Legit CP is important to block and blacklist. Whereas hentai and other drawn materials are perfectly fine, even if you personally don't like them.",
			"post_uri": "1Hd7H8VUbdieey29AGC2xLxedDiPdM7JTT_1495293506",
			"date_added": 1495331686
		},
		{
			"comment_id": 21,
			"body": "So umm... it doesn't look very much like a 'decentralized internet' to me. Looks like the storage is centralized on dropbox/google/ms servers. Looks like it's running a blockchain for usernames. Aaaaannnnd that's about it. The one 'demo' app is available [on clearnet](https://helloblockstack.com/) which means it has a centralized server backing it.\n\nDo you actually use this yourself? What for? Because to me it looks like more undeveloped hype garbage. Keep in mind you're posting this on a platform that actually works and has users (ZeroMe on ZeroNet) that accomplishes the very thing this app tries to do and fails miserably at.",
			"post_uri": "1DLHbq2nvwpgU4xT3ajhABAW1Lfn3zTZhe_1495583719",
			"date_added": 1495587658
		},
		{
			"comment_id": 22,
			"body": "There's a lot of chinese users here. We need more english content haha. Feel free to post in whatever you're more comfortable with. Or both maybe?",
			"post_uri": "1FuGMieoJz22RY6XVqwh8oLq6Vw92txJHu_1496319168",
			"date_added": 1496375810
		},
		{
			"comment_id": 23,
			"body": "Personally, anything I create for the public, is *for* the public. They should feel free to do whatever they like with it. I'd like credit for my work, but that's about it. I can't control what people do, and it'd be hypocritical for me to do so. So they're free to do what they like.",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1499726897",
			"date_added": 1499730719
		},
		{
			"comment_id": 24,
			"body": "@Tomas CaseyWilcox: Of course, that attitude and mindset comes with the nasty side effect of being poor af because you provide everything for free lol.",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1499726897",
			"date_added": 1499731266
		},
		{
			"comment_id": 25,
			"body": "@Tomas: I've just seen time and time again the community suffering because someone decided to be an asshat and try to exert control over what they made.",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1499726897",
			"date_added": 1499732271
		},
		{
			"comment_id": 26,
			"body": "hubs are a special type of site that just explicitly hold data/content for special sites called 'merger sites'. ZeroMe is one such merger site, and has hubs to store the posts/profiles/etc. To add a hub, either just directly visit the address, or visit a profile that uses the hub and click \"download hub\".",
			"post_uri": "176km3WA4wh3qhGU2cEUH6LhMFZAKt9v2f_1500059410",
			"date_added": 1500063578
		},
		{
			"comment_id": 27,
			"body": "@Deprekholia: They aren't communist lol. They *say* they're communist. In reality they're authoritarian and capitalistic.",
			"post_uri": "176km3WA4wh3qhGU2cEUH6LhMFZAKt9v2f_1500037832",
			"date_added": 1500063632
		},
		{
			"comment_id": 28,
			"body": "@Sphinx: \"The one thing that confused me ts that visiting a hub site for the first time, just gives the message \" Please use ZeroMe to browse profiles on this page. \" \"\n\nThat means you directly visited the hub, which you shouldn't do unless you're just downloading it. You need to use ZeroMe to show the profiles/posts. The hubs by themselves do nothing.\n\n\"But now I added them all with http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Create+profile\"\n\nNoooooooo. Don't tell me you clicked \"join hub\" on all of them?! D: You might've just fucked up your profile big time. If they're on that page you already have them downloaded/added! Follow [my guide](/blog.kaffie.bit/?Post:25:How+to+change+your+ZeroMe+Hub&) on how to fix that.\n\n\"Hubs could be used for something like \"subreddits\"? If you don't add it you don't see the content?\"\n\nCorrect. In fact, this has already been done over at [ZeroVoat](/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/). Although multiple hubs/data sites haven't been added to the gui yet (it's done in the dev version of the site though). Different hub/data sites will hold different subreddits/channels, and then you can post in them.\n\n\" Merger Sites diplay content from Hubs. And users sync not only the merger site, but also partial contents from the hubs.\"\n\nUsers sync the whole hub. Unless the files are marked optional. But users don't need to have every hub. Just the ones they want to follow.",
			"post_uri": "176km3WA4wh3qhGU2cEUH6LhMFZAKt9v2f_1500059410",
			"date_added": 1500099368
		},
		{
			"comment_id": 29,
			"body": "@Sphinx: Yeah. There needs to be a big warning sign when I user goes back to the create profile page. Since if you try to join a hub like that it really messes things up. Hubs should be auto-downloaded if you visit a user's page on that hub. If you visit the hub directly it's already downloaded, and you can view it just fine in ZeroMe. There's no need to *ever* return to the create profile page.",
			"post_uri": "176km3WA4wh3qhGU2cEUH6LhMFZAKt9v2f_1500059410",
			"date_added": 1500104295
		},
		{
			"comment_id": 30,
			"body": "@Fuckthequeen: Wow really? I get asking for english on an english forum like ZeroTalk, where the point is literally to discuss things (in english). However this is just a random ZeroMe profile. He can write in whatever language he wants. Don't like it? Just block/mute or just stop seeding the hub.",
			"post_uri": "16VmDEsN8skG81mNGCSP7VZGoVNCVXK6Pp_1500627977",
			"date_added": 1500637734
		},
		{
			"comment_id": 31,
			"body": "I'd appreciate it though tbh.",
			"post_uri": "1A6rok3j9w6paahtGoxrePy7SSkMz5A48s_1501023886",
			"date_added": 1501032652
		},
		{
			"comment_id": 32,
			"body": "Is OpenBSD for desktops as well? Or is it just a server thing? I've been wanting to get off Mac for a while, but I'm not sure what would be best (w/e distro of linux, bsd(?), something else). Thoughts?",
			"post_uri": "1AABRF6MEZpwihXdJSPNdygREjis6LzD2w_1500376145",
			"date_added": 1501033700
		},
		{
			"comment_id": 33,
			"body": "No need, cortana *is* the joke.",
			"post_uri": "1HGr5q2yEov55cZf7NE5qBkJvTVSJZVM6g_1501081987",
			"date_added": 1501118554
		},
		{
			"comment_id": 34,
			"body": "Where did you find all these pics of me? /s\n\nI'm def a hikki/neet tho.",
			"post_uri": "1ETuSwJzNdmHMoywaV2NCyZfC4ChiVUJqc_1501387222",
			"date_added": 1501416635
		},
		{
			"comment_id": 35,
			"body": "Shibuya is so damn cool. I wanna go there one day.",
			"post_uri": "1LgKvgvUjJkkbrNVYKyDdvSacyTXJuwmMG_1502525574",
			"date_added": 1502532573
		},
		{
			"comment_id": 36,
			"body": "We need IPv6 support already so we can run it over cjdns. Very eager for this. @nofish:",
			"post_uri": "1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF_1536213154",
			"date_added": 1536229389
		},
		{
			"comment_id": 37,
			"body": "Worked fine.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1555519413",
			"date_added": 1555589369
		},
		{
			"comment_id": 38,
			"body": "Users.json is only your public/private key pairs. That's it. If you keep that and then revist/relogin to sites, they'll work as normal. Your old posts should still be kept if you actually published them (and other people have them which you redownloaded). The rest of the data folder is some other config stuff, and all of the sites you dl'd.",
			"post_uri": "18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im_1565492799",
			"date_added": 1565494103
		},
		{
			"comment_id": 39,
			"body": "@Chinchin: Yes. When you post things, it gets published to a site, and so anyone who has that site will host that content. So if you delete all your stuff except your keys, then when you restart and visit the sites you previously did, you'll redownload the stuff people are hosting for you.",
			"post_uri": "18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im_1565492799",
			"date_added": 1565494708
		},
		{
			"comment_id": 40,
			"body": "Normally that sort of bug happens when you try to \"switch\" hubs and do so in an imperfect way. ZeroMe doesn't exactly have the best design as users are \"locked into\" a particular hub, and there's quite a few places this is set.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1566060647",
			"date_added": 1566101552
		},
		{
			"comment_id": 41,
			"body": "Ahhh that's me. My mind just glitches out and I'm just entirely unsure of what to do. Like why tf did you put a dish in the sink??? Should I remove it? But now it's soaked? Should I wash normally and ignore it? But then there ends up with a buildup of water in the sink or on the existing dishes in there.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1566317388",
			"date_added": 1566347250
		},
		{
			"comment_id": 42,
			"body": "People just skip it and sign up on conditions they don't know.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1566808724",
			"date_added": 1566811984
		},
		{
			"comment_id": 43,
			"body": "This has been around for ages. You can enable push notifications for your browser. Sites explicitly ask you this when you use them. IE a \"do you wish to receive push notifications from our site?\" you're free to decline.\n\n*ALL* push notifications work in the way that you're freaking out about. Your phone? Guess what it connects to sites/services to receive the push notifications. Now browsers can do the same if you allow it. But they won't do it without permission.\n\nFor example, if you enable it for reddit, firefox will send a notification when you receive a reply/dm. Very handy.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1566917577",
			"date_added": 1566953493
		},
		{
			"comment_id": 44,
			"body": "Default browser (firefox) has track/ad blocking, switch to chrome that has less blocking and it goes through. I have this problem and it's obnoxious af. I end up doing all the captchas on chrome and it makes things a mess having to use two browsers.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1572111659",
			"date_added": 1572607645
		},
		{
			"comment_id": 45,
			"body": "Spam to make a point, though the point kinda failed miserably.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1581209444",
			"date_added": 1581504220
		},
		{
			"comment_id": 46,
			"body": "I feel like the patreon model is best. Fans can support their favorite creators spending as much as they'd like either recurring or not. No need for ads. And everything created can be released publicly free/foss/etc. Likewise it allows creators to spend more time working on something even if it may not be released right away, and still have funding nonetheless. Good for projects that might take a while. Many small donations leads to decent pay where fans only pay a little.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1599418690",
			"date_added": 1599574888
		},
		{
			"comment_id": 47,
			"body": "@Realjohndoe: Keep in mind that using the tor browser on zeronet doesn't really help much. It would only anonymize any clearnet links. Since everything else is a local file on your computer. Instead you have to configure the ZN client itself to use tor. ",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1599588574",
			"date_added": 1599637862
		},
		{
			"comment_id": 48,
			"body": "@caryoscelus: with pateron people can \"subscribe\" to automatically regularly give donations, and in some cases get early access to content (which is released for everyone else later). Patreon also allows people to just do a 1-time donation. Ultimately I find it to be best as a subscription donation model which patreon is focused on helps provide a consistent income while also allowing work to be public (either right away, or after a delay). There's also options for \"goals\", ie \"$x/month and we'll do Y\" which helps incentivize donations. Ofc you don't need patreon to have this model, but patreon just makes it really easy to set up. Manual donations don't have automatic monthly donations (putting on the burden on the fan, rather than on the payment processor). For comparison, I had some bulk donations through bitcoin one or two times, but I get a regular small payment from patreon each month. Makes patreon overall the better option. 1-time donations always seem a bit weird at really low $ amounts like $1-2, but with a monthly thing it's a lot more normal. Perhaps that's just my perception of it though. Very flexible while also encouraging regular small donations, and having a flexible reward system and larger goals for your base. A simple donation button doesn't do any of that and tends to encourage fewer but larger donations (leading to less overall). That's been my experience doing both methods. \n\nI think brave's model could end up doing well as well. Having automatic donations to visited sites/channels/etc so the donation amount is based on how much you view the content. But I don't have experience with that one.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1599418690",
			"date_added": 1599923159
		},
		{
			"comment_id": 49,
			"body": "@Ansho Rei: As it stands, each zeronet site already has a bitcoin address, which is the address of the site. And there's a donate button in the sidebar. I've actually received donations in this manner, which was a little weird but it actually worked. Same goes for your zeroid account (as you have a public key and private key which indeed are bitcoin addresses). If brave's cryptocurrency uses the same address algorithm, then they should work as brave addresses as well which would make it easy to implement on brave's end. Might be worth asking them about.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1599418690",
			"date_added": 1600005892
		},
		{
			"comment_id": 50,
			"body": "Yeah I really hate the new android firefox. It's obnoxious. I can't easily access my history and synced tabs, tab management in general is kinda awful. I don't know why they moved the navbar to the bottom which makes it kinda awkward. The whole thing has become clunkier tbh.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1602438855",
			"date_added": 1602599324
		},
		{
			"comment_id": 51,
			"body": "It just goes by frequency. Whoever posts most often ends up there.",
			"post_uri": "13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE_1626810882",
			"date_added": 1626828203
		}
	]
}