{
	"next_post_id": 8,
	"next_comment_id": 3,
	"next_follow_id": 5,
	"avatar": "jpg",
	"user_name": "Concept7",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Explorateur de concepts",
	"post": [
		{
			"post_id": 1,
			"date_added": 1619932107,
			"body": "Hello ZeroMe!"
		},
		{
			"post_id": 1619932254,
			"body": "**VISIONS DU FUTUR : LE POINT DE VUE D'UN JOUEUR D'ÉCHECS**\n\nCommentaire à l'épisode 400 -- Visions of the Future[^i^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote1sym) du <https://www.corbettreport.com/>\n\nEN BREF\n\nLorsque l'on adopte le point de vue d'un joueur d'échecs, concevoir des futures possibles n'est envisageable qu'à moyen terme. Le plus urgent est de prendre conscience, comprendre et parer le dernier mouvement qui mettra l'Humanité en état d'échec et mat.\n\nLe coup de grâce idéal serait à l'image de la pandémie actuelle, un problème-réaction-solution[^ii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote2sym), assené à l'occasion du vingtième anniversaire du 11 septembre[^iii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote3sym) sous la forme d'attentats bioterroristes sur différents points du globe[^iv^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote4sym).. un scénario catastrophe à la SongBird ! [^v^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote5sym)\n\nTout comme Bill Gates avait prévenu en 2015 que « si quelque chose [devait] tuer plus de 10 millions de gens dans les prochaines décennies, ça [serait] probablement un virus hautement contagieux plutôt qu'une guerre. »[^vi^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote6sym), il a également annoncé cette éventualité deux ans plus tard[^vii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote7sym).\n\nLa beauté diabolique de ce scénario, c'est que les centaines de millions des gens[^viii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote8sym) ne mourront pas des conséquences de ces attentats bioterroristes mais de la tempête cytokinique causée par le vaccin[^ix^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote9sym), et pas directement. Des familles désemparées conduiront les membres de leur famille dans des hôpitaux sous équipés[^x^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote10sym) où les médecins seront eux-mêmes malades, les aides-soignants malades[^xi^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote11sym).. Face à cette situation dramatique, le président Macron devra « faire des choses dures [...] parce que les circonstances l'exigeront ».[^xii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote12sym) Le gouvernement déclarera la loi martiale[^xiii^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote13sym), [l'armée sera sollicitée dans les prochains mois sous de faux prétextes[^xiv^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote14sym)] établira des camps pour accueillir les personnes malades[^xv^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote15sym) et autorisera leur suicide assisté[^xvi^](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote16sym).\n\nCette vision du futur est à court terme, celle des prochains mois.\n\nDans cette carte en cours d'écriture, nous explorerons le long terme, soit les dix prochaines années, si jamais les événements venaient à se passer de la façon décrite.\n\nCette vision est celle du joueur d'échecs, c'est-à-dire celle de l'individu qui tente de comprendre la tactique de son adversaire, de donner un sens aux événements avant d'avancer ses pièces. Mais ce n'est pas la seule.\n\nCette hypothèse vous paraît-elle probable ?\n\nArgumentez en commentaire..\n\n[i](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote1anc) Corbett. *Episode 400 -- Visions of the Future*. 24 Apr. 2021, <https://www.corbettreport.com/future/>.\n\n[ii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote2anc) Corbett. *Episode 047 -- Problem Reaction Solution*. 22 June 2008, <https://www.corbettreport.com/episode-047-problem-reaction-solution/> .\n\n[iii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote3anc) Collins, Courtesy of Harper. \"ABC Reviendra Sur Les Attentats Du 11 Septembre Pour Leur 20e Anniversaire.\" *Ladepeche.Fr*, 6 Aug. 2019, <https://www.ladepeche.fr/2019/08/06/abc-reviendra-sur-les-attentats-du-11-septembre-pour-leur-20e-anniversaire,8349136.php>.\n\n[iv](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote4anc) Regalado, Antonio. \"It's Fiction, but America Just Got Wiped out by a Man-Made Terror Germ.\" *MIT Technology Review*, 30 May 2018, <https://www.technologyreview.com/2018/05/30/2746/its-fiction-but-america-just-got-wiped-out-by-a-man-made-terror-germ/>.\n\n[v](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote5anc) \"SONGBIRD Trailer (2021).\" *YouTube*, 29 Oct. 2020, <https://www.youtube.com/watch?v=gXlOSEafzhY>.\n\n[vi](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote6anc) Gates, Bill. \"Transcript of 'The next Outbreak? We're Not Ready.'\" *TED Talks*, <https://www.ted.com/talks/bill_gates_the_next_outbreak_we_re_not_ready/transcript?language=en#t-38140>. Accessed 5 Jan. 2021.\n\n[vii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote7anc) \"Gates: Millions Could Die from Bio-Terrorism.\" *YouTube*, 23 Feb. 2017, <https://youtu.be/6QmH3SCX0Ro?t=6>.\n\n[viii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote8anc) Research and data: Hannah Ritchie, Esteban. \"Coronavirus (COVID-19) Vaccinations - Statistics and Research.\" *Our World in Data*, <https://ourworldindata.org/covid-vaccinations>. Accessed 1 May. 2021.\n\n[ix](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote9anc) \"Dr Louis Fouché : Le Défi de La Parité et de La Vérité Sur Le Covid-19.\" *YouTube*, 26 Feb. 2021, <https://youtu.be/Wz7zuUIza8w?t=1439>.\n\n[x](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote10anc) Cuordifede, Célia. \"Deuxième Vague à l'hôpital: 'On a Encore Moins de Moyens Qu'en Mars Dernier.'\" *Marianne*, 1 Oct. 2020, <https://www.marianne.net/societe/sante/deuxieme-vague-a-lhopital-on-a-encore-moins-de-moyens-quen-mars-dernier>.\n\n[xi](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote11anc) A, DICOM_Marie. \"La Stratégie Vaccinale et La Liste Des Publics Prioritaires -- Ministère Des Solidarités et de La Santé.\" *Ministère Des Solidarités et de La Santé*, 1 May 2021, <https://solidarites-sante.gouv.fr/grands-dossiers/vaccin-covid-19/publics-prioritaires-vaccin-covid-19>.\n\n[xii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote12anc) \"Entretien Exclusif : Emmanuel Macron Répond à Brut.\" *YouTube*, 4 Dec. 2020, [h](https://youtu.be/IvkewyupR_8?t=8580)[ttps://youtu.be/IvkewyupR_8?t=8580](https://youtu.be/IvkewyupR_8?t=8580) .\n\n[xiii](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote13anc) \"Loi Martiale --- Wikipédia.\" *Wikimedia Foundation, Inc.*, 1 Mar. 2012, <https://fr.wikipedia.org/wiki/Loi_martiale>.\n\n[xiv](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote14anc) Rhouma, Myriam. \"Vers Une « guerre Civile » En France ? L'inquiétante Tribune Des Généraux Fait Bondir.\" *SaphirNews.Com | Quotidien d'actualité Sur Le Fait Musulman En France*, <https://www.saphirnews.com/Vers-une-guerre-civile-en-France-L-inquietante-tribune-des-generaux-fait-bondir_a28042.html>. Accessed 1 May. 2021.\n\n[xv](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote15anc) Michelon, Vincent. \"'Va-t-on Créer Des Camps d'internement ?' : Les Députés Divisés Sur l'isolement Des Cas Covid.\" *LCI*, 25 Nov. 2020, <https://www.lci.fr/politique/va-t-on-creer-des-camps-d-internement-les-deputes-divises-sur-l-isolement-des-cas-covid-2171056.html> .\n\n[xvi](http://127.0.0.1:43110/1GEW2M5UinZxEM6tuE5rikTstpwRjpj5wP/?Post:3#sdendnote16anc) *Proposition de Loi Visant* *à**é**tablir Le Droit* *à* *Mourir Dans La Dignité*. <http://www.senat.fr/rap/l20-402/l20-4024.html>. Accessed 1 may. 2021.\n\nSource image : <http://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u/Chronologie%20dune%20plandmie_21.S17.6.zip>",
			"date_added": 1619932252,
			"meta": "{\"img\":\"900,637,feddddeecdcafffccabcbbbabb9e88eccebbfddb77d98c98,012133120442567861240250111110379444A0BC27DEDDFABA2751133A040114020004\"}"
		},
		{
			"post_id": 1619933268,
			"body": "Les Suresnois-es : nouveaux cobayes de la technopolice\n======================================================\n\nLa mairie de Suresnes a accepté que la start-up locale [XXII](https://technopolice.fr/xxii/) analyse les moindres faits et gestes, sur la voie publique, des suresnois-es : durant un an et demi, l'entreprise sera libre d'utiliser les images de vidéosurveillance de Suresnes pour développer des algorithmes de \"détection de comportements suspects\" dont elle sera propriétaire.\n\n**Ce sont ainsi les données personnelles de toute une population qui sont offertes à une entreprise privée dans le seul et unique but d'enrichir les actionnaires d'une entreprise de surveillance de masse**.\n\nLes vies quotidiennes de dizaines de milliers de personnes offertes aux actionnaires de la technopolice\n-------------------------------------------------------------------------------------------------------\n\nPour XXII, cette opération est une aubaine. **Comme le révèle la convention de partenariat, obtenue grâce à une demande CADA diffusée sur le forum [technopolice](https://data.technopolice.fr/fr/entity/qfqn9izd0g), leur produit phare de surveillance urbaine, [XXIISmartCity](https://www.xxiismartcity.fr/), semble en effet loin d'être finalisé**. Décrit dans la convention comme étant encore à un stade « expérimental » , il est aussi indiqué que le pourcentage d'erreurs des algorithmes mis en place sera « dans la mesure du possible ». inférieur à 10%. En d'autres termes, XXII a un besoin urgent d'améliorer ses solutions avant de les commercialiser plus largement.\n\nOr, comme l'[expliquait](https://www.suresnes.fr/wp-content/uploads/2021/04/PV_10-fev2021.pdf) le maire de Suresnes en conseil municipal, « *le problème de nos entreprises françaises est qu'elles n'ont pas accès à des bases de données, des bases d'images, des bases d'événements suffisantes qui leur permettent d'exercer aussi rapidement leurs algorithmes* ».\n\n**On comprend alors le besoin pressant de XXII de trouver une population cobaye** qu'elle puisse observer sans restrictions, à toute heure du jour et de la nuit.**Silhouettes humaines, déplacements, stationnement, objets** , les algorithmes de XXII ont besoin de tout analyser pour mieux « apprendre ». Transformés en véritables rats de laboratoires, les Suresnois-es verront leur vie quotidienne disséquée afin d'apprendre aux machines ce qui distingue un bon d'un mauvais rat...\n\nQuel réel bénéfice donc pour Suresnes à utiliser un produit expérimental dont le fonctionnement même n'a pas été testé ? En conseil municipal, **le maire [insista](https://www.suresnes.fr/wp-content/uploads/2021/04/PV_10-fev2021.pdf) à plusieurs reprises sur le fait que l'opération contribuait au développement d'une entreprise locale, les locaux de XXII étant situés dans la ville, comme si cela pouvait justifier que ses actionnaires s'enrichissent en devenant propriétaires de la vie privée des autres habitants.**\n\nLes ressources publiques au service de la technopolice\n------------------------------------------------------\n\nLe cadeau offert par la mairie à XXII ne s'arrête pas là. Pour faciliter le travail de XXII, la convention prévoit trois choses : la présence, sans limite de temps, d'un opérateur de XXII au sein du CSU (centre de supervision urbain), l'engagement de la collectivité de faire remonter toute information nécessaire au projet ainsi que l'existence d'un comité technique, en partie composé de membres du CSU, qui devra se réunir « aussi souvent que nécessaire pour favoriser le bon déroulement du projet ».\n\nDurant le temps de l'expérimentation, **XXII bénéficiera ainsi de la collaboration active d'agents publics, transformés pour l'exercice en bêta-testeurs** chargés de renseigner les bugs et erreurs présentes dans les produits de XXII. En parallèle, XXII pourra se servir du CSU de Suresnes comme d'un véritable laboratoire au service de ses équipes techniques.\n\n**Cette mise à disposition de ressources publiques au profit de XXII facilitera grandement une des principales difficultés rencontrées par les entreprises développant des algorithmes de vidéo-surveillance automatisée : la labellisation de leurs bases de données**. Imaginons par exemple que XXII souhaite tester un algorithme de détection de sans-domicile-fixes. Outre la nécessité d'accéder à des flux vidéos, il faut aussi qu'un opérateur puisse valider si les alertes transmises par leur algorithme sont correctes de manière à les corriger si nécessaires. La convention permettra à XXII de réaliser cette opération soit grâce à la présence de son opérateur sur site, soit via les remontées d'informations des employés publics au sein du CSU.\n\n**Tout aussi dérangeant, la convention prévoit que XXII pourra utiliser le CSU de Suresnes comme d'un véritable show-room**. Il est ainsi prévu que la start-up puisse inviter des clients à l'intérieur-même du CSU de la ville pour qu'elle puisse faire la promotion de ses solutions de surveillance vidéo.\n\nUn flou absolu quant aux algorithmes déployés et sur l'avenir des données des Suresnois-es\n------------------------------------------------------------------------------------------\n\n**Enfin, la convention ne permet pas de savoir avec précision quels seront les algorithmes déployés.** S'il est évoqué la notion on ne peut plus vague de « détection de comportements suspects », il est plus loin fait référence à un algorithme de détection de « maraudage». Dans le même temps, il est indiqué à plusieurs reprises la possibilité pour XXII, en accord avec la mairie, d'installer de nouveaux algorithmes.\n\nIl est par ailleurs mentionné à différents endroits que **XXII sera propriétaire des bases de données utilisées pendant l'expérimentation**. Il est tout particulièrement écrit que XXII est copropriétaire des « résultats » de l'expérience, ces derniers étant notamment définis comme les « connaissances, variables, [...] base de données » obtenues pendant la durée de la convention. Ce flou entretient des doutes quant au transfert à XXII des séquences vidéos utilisées pour le développement de leur logiciel.\n\nFabriquer l'acceptabilité de la vidéosurveillance\n-------------------------------------------------\n\nLa ville de Suresnes et l'entreprise XXII représentent l'archétype de ce contre quoi nous luttons : la collusion entre les politiques et les industriels de la sécurité, qui, pour donner le change politiquement, déploient des dispositifs liberticides et déshumanisants. Ce type d'expérimentation cherche à fabriquer « l'acceptabilité sociale » -- comme ils l'appellent -- de la vidéosurveillance automatisée.\n\nXXII a beau tenter de se dédouaner de toute velléité sécuritaire, la surveillance qu'elle impose à ses habitant-es est bien réelle. **Encore une fois, il s'agit de technologies intrusives, imposées sans débat, à toute une population. Nous refusons une société dans laquelle les habitants et habitantes des villes voient leur vie épiée et exploitée comme une vulgaire matière première utilisable pour le développement de technologies malsaines. Où les êtres humains ne sont finalement plus considérés que comme une masse de données à monétariser ou des corps à contrôler.**\n\nArticle original : “Les Suresnois·es : Nouveaux Cobayes de La Technopolice.” Technopolice, 29 Apr. 2021, https://technopolice.fr/blog/les-suresnois%C2%B7es-nouveaux-cobayes-de-la-technopolice/. ",
			"date_added": 1619933265
		},
		{
			"post_id": 1619933926,
			"body": "3 Things You Don't Know about Euthanasia\n========================================\n\n###### Rosemary Frei, via [her website](https://www.rosemaryfrei.ca/)\n\nThe cadence is increasing of jurisdictions introducing, normalizing and expanding laws allowing doctors to help people commit suicide.\n\n**Is this purely in the service of relieving unbearable physical or mental suffering? Or do other factors predominate?**\n\n**I used to believe the former, but my recent re-examination of the issue suggests the latter is more likely.**\n\nOn March 17, 2021, [Bill C-7](https://parl.ca/DocumentViewer/en/43-2/bill/C-7/royal-assent) came into effect across Canada. The new law significantly increases the proportion of the population eligible to undergo physician-assisted death (PAD). C-7 expands PAD eligibility to, for example, people whose death is not reasonably foreseeable.\n\nOn March 18, [Spain](https://www.cnn.com/2021/03/18/europe/spain-euthanasia-law-scli-intl/index.html) passed federal legislation that for the first time allows PAD there; it goes into effect in June.\n\nThe same thing has happened in New Zealand: the federal '[End of Life Choice Act](https://www.health.govt.nz/our-work/regulation-health-and-disability-system/end-life-choice-act)' goes into effect in November.\n\nAnd on April 8 the [French federal parliament](https://www.thelocal.fr/20210407/french-mps-to-debate-legalising-euthanasia/) debated whether to make euthanasia the law of their land. The majority of the parliamentarians favour legalizing euthanasia. However, the law [was not passed](https://www.sudradio.fr/societe/yael-braun-pivet-euthanasie-nous-souhaitons-continuer-au-dela-de-larticle-1/) because there wasn't enough time for them to go through the thousands of amendments proposed by legislators who oppose PAD.\n\n(Other terms for the act of doctors helping people commit suicide include physician-assisted suicide, voluntary assisted suicide and medical assistance in dying. And the difference between euthanasia and PAD is the latter requires patients to request it.)\n\nOther countries, such as the UK, are similar to France: active euthanasia is illegal but most residents and physicians approve of it. Therefore in these countries many physicians perform euthanasia [without being punished](https://www.inbrief.co.uk/human-rights/euthanasia/) and there is a considerable [push to legalize it](https://www.politics.co.uk/reference/euthanasia/).\n\n[Holland](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2949557/) and [Belgium](https://www.researchgate.net/publication/322854307_Euthanasia_in_Belgium_Legal_historical_and_political_review) were the first countries to decriminalize euthanasia and PAD, bringing their laws into effect in 2002. In [Luxembourg](https://guichet.public.lu/en/citoyens/famille/euthanasie-soins-palliatifs/fin-de-vie/euthanasie-assistance-suicide.html) a similar assisted-death law came into effect in 2009.\n\nAll three countries allow people to undergo PAD if they have a serious medical condition, disability or psychiatric disorder, whether their death is imminent or not.\n\nFor the last few years years Holland has been moving towards voting on legalizing PAD for people 75 years of age or older who are ['tired of life.'](https://www.dutchnews.nl/news/2020/07/euthanasia-law-proposed-for-healthy-over-75s-who-feel-their-lives-are-complete/)** And there has been a steady and very significant increase in the overall number of people undergoing PAD in **[**Holland**](https://www.catholiceducation.org/en/controversy/euthanasia-and-assisted-suicide/we-were-wrong-says-former-regulator-of-dutch-euthanasia.html)** and  **[**Belgium**](https://www.ieb-eib.org/en/study/end-of-life/euthanasia-and-assisted-suicide/belgian-euthanasia-increases-by-89-in-four-years-382.html)**.**\n\nPAD currently can also be legally performed in five other countries, either across the whole country or in parts of it: [Canada](https://parl.ca/DocumentViewer/en/43-2/bill/C-7/royal-assent), the [US](https://www.deathwithdignity.org/assisted-dying-chronology/), [Australia](https://end-of-life.qut.edu.au/euthanasia), [Germany](https://www.courthousenews.com/german-court-scraps-ban-on-assisted-suicide/) and [Switzerland](https://www.mydeath-mydecision.org.uk/info/options/assisted-suicide-switzerland/).\n\nIn the US each state can decide whether PAD is permitted there. [So far,](https://www.deathwithdignity.org/assisted-dying-chronology/) eight states plus Washington, D.C. have legalized it. Similarly, in [Australia](https://end-of-life.qut.edu.au/euthanasia) it's a state issue; so far the state of Victoria has brought into effect a law allowing PAD and on July 1 the state of Western Australia will follow suit.\n\nIn Canada PAD was first legalized federally in [2016](https://senate-gro.ca/new-laws/bill-c-14/). Now [Bill C-7](https://parl.ca/DocumentViewer/en/43-2/bill/C-7/royal-assent) expands PAD by, among other measures:\n\n-   no longer requiring a 10-day 'reflection' period between the time a person whose natural death is reasonably foreseeable consents to PAD and when they receive it;\n-   allowing people who have a very serious illness or disability but whose natural death is not imminent to access PAD as long as they meet certain conditions (previously, PAD was only allowed in people whose natural death was reasonably foreseeable);\n-   allowing PAD for people who have previously requested it, been found eligible to receive it and their natural death has become reasonably foreseeable but they've [lost the capacity to consent](https://parl.ca/DocumentViewer/en/43-2/bill/C-7/royal-assent); and,\n-   starting in 2023, [no longer banning](https://openparliament.ca/bills/43-1/C-7/) PAD for people who have a mental illness alone, and no other underlying medical conditions or disabilities.\n\n**The government and mass media largely paint all of this as** **giving more people more right to choose how and when they end their lives**.\n\nPro-PAD groups and opinion leaders refer to it in positive terms such as 'right to die' and 'death with dignity.'\n\nOther institutions have an overt pro-PAD position; among these is the [Hastings Center](https://www.thehastingscenter.org/briefingbook/physician-assisted-death/) in the US.\n\nAnd additional influential groups and organizations --- [Wikipedia](https://en.wikipedia.org/wiki/Assisted_suicide), for example --- have a more subtle but definitely detectable pro-PAD slant in the information they provide to the public about PAD.\n\nMost of the individuals and groups that oppose PAD do so on religious grounds.\n\n**But there are at least three facts that most people don't know about physician-assisted death.**\n\n*\n\n1\\. **Expanding PAD is a serious potential threat to people with **[**disabilities**](https://www.msn.com/en-ca/health/medical/barbara-kay-wider-access-to-assisted-dying-in-canada-will-be-catastrophic-for-the-disabled/ar-BB1dElu4?pfr=1)**, dementia and Alzheimer's.**\n\nThat's because what the vast majority of these people want and need is good care and services -- but those services are becoming very hard to access, particularly in this era of Covid.\n\nMost countries' PAD laws require health-care providers to inform people of available services for relieving their suffering as alternatives to PAD and to offer referrals to professionals who can provide these services. But those laws don't also require that the services be made accessible to all of these people, via increased government funding.\n\nAnd there already have been [documented](https://www.cbc.ca/news/canada/newfoundland-labrador/doctor-suggested-assisted-suicide-daughter-mother-elson-1.4218669) [cases](https://nationalpost.com/pmn/news-pmn/canada-news-pmn/new-proposed-assisted-dying-law-is-racist-says-disability-rights-activist) of people with disabilities being pressured to undergo PAD.\n\nThat's why many disability advocates oppose expansion of PAD.\n\nCatherine Frazee, a professor at Ryerson University in Toronto and a leading disability advocate, gave [powerful testimony](https://www.youtube.com/watch?v=kKh7SHtB244) to the Canadian parliamentary Standing Committee on Justice and Human Rights' Bill C-7 hearing in November 2020.\n\nShe told hearing attendees that the Quebec Superior Court's [2019](https://www.canlii.org/fr/qc/qccs/doc/2019/2019qccs3792/2019qccs3792.html) [decision](https://www.canlii.org/fr/qc/qccs/doc/2019/2019qccs3792/2019qccs3792.html) allowing disabled Quebec resident Jean Truchon to undergo assisted death even though his death was not reasonably foreseeable -- which the Canadian federal government [used as a springboard to create Bill C-7](https://www.justice.gc.ca/eng/csj-sjc/pl/ad-am/c7/p1.html#fn1-rf) --- does not in fact translate into the need to make it easier for disabled people to kill themselves.\n\nFrazee said that, rather, \"**the deprivations of institutional life that choked out his [Truchon's] will to live [and resultant request for PAD] were not an inevitable consequence of disability.\"**\n\nKrista Carr, executive vice-president of Inclusion Canada, has voiced a similar sentiment.\n\n*\"This bill has got to be stopped, or it will end the life of people. It will end the life of way too many people with disabilities who feel they have no other options,\"* she's quoted as saying in a [February 8, 2021,](https://nationalpost.com/pmn/news-pmn/canada-news-pmn/new-proposed-assisted-dying-law-is-racist-says-disability-rights-activist) [Canadian ](https://nationalpost.com/pmn/news-pmn/canada-news-pmn/new-proposed-assisted-dying-law-is-racist-says-disability-rights-activist)[Press](https://nationalpost.com/pmn/news-pmn/canada-news-pmn/new-proposed-assisted-dying-law-is-racist-says-disability-rights-activist) article.\n\n*\n\n2\\. **In 2014, **[**Belgium**](https://www.bbc.com/news/world-europe-26181615)** became the first country to expand PAD to apply to **[**people as young as one year old**](https://www.bbc.com/news/world-europe-26181615)**.**\n\nIn Holland, ever since its PAD law went into effect in 2002, the country has allowed assisted killing of children --- in cases where they're considered to be incurably ill --- of as young as 12. And the Dutch [government](https://thehill.com/blogs/blog-briefing-room/news/521499-netherlands-to-allow-for-physician-assisted-death-of-incurably) is now [considering](https://thehill.com/blogs/blog-briefing-room/news/521499-netherlands-to-allow-for-physician-assisted-death-of-incurably) following Belgium's lead and lowering that minimum age to as [young as one](https://www.dutchnews.nl/news/2020/10/coalition-agrees-to-support-active-termination-of-life-for-younger-children/).\n\nThis expansion wouldn't involve a change in federal law in Holland. Instead, it would be done via changes to the '[Groningen protocol](https://www.nejm.org/doi/full/10.1056/NEJMp058026).' This set of guidelines was created in 2004 for the killing of newborns and infants with very serious illnesses or deformities such as spina bifida.\n\n*\n\n3\\. **There is [significant](https://www.bbc.com/news/world-europe-51322781) [controversy](https://www.psychiatrictimes.com/view/apa-position-medical-euthanasia) about allowing assisted suicide for people who have a psychiatric disorder alone and no other conditions.**\n\nCurrently only Holland, Belgium and Luxembourg permit this, as part of their original assisted-death laws.\n\nUnder Bill C-7, Canada will allow it in 2023.\n\nThe Canadian Psychiatric Association (CPA) released a [position statement](https://journals.sagepub.com/doi/10.1177/0706743720919299) last year saying it:\n\n> did and does not take a position on the legality or morality of MAiD [medical assistance in dying] as this is a decision reflecting current Canadian ethical, cultural and moral views.\"\n\nThis prompted two former CPA presidents to [post](https://www.webcampaign.org/)[ an open letter](https://www.webcampaign.org/) to Canadian psychiatrists highlighting that the CPA did not engage its membership in a consultation process before releasing its position statement.\n\nThe two past presidents asked the CPA to:\n\n> revisit the Statement by temporarily withdrawing it, to allow for a proper engagement process and development of evidence-based recommendations to inform any future Position Statement on MAiD.\"\n\nThe CPA did not do this.\n\nThe American Psychiatric Association released its PAD position statement in [2016](https://www.psychiatry.org/File%20Library/About-APA/Organization-Documents-Policies/Policies/Position-2016-Medical-Euthanasia.pdf). It states, in whole:\n\n> The American Psychiatric Association, in concert with the American Medical Association's position on medical euthanasia, holds that a psychiatrist should not prescribe or administer any intervention to a non-terminally ill person for the purpose of causing death.\"\n\nThe [American Medical Association](https://www.ama-assn.org/delivering-care/ethics/physician-assisted-suicide)'s Code of Medical Ethics states, in part, that:\n\n> Physician-assisted suicide is fundamentally incompatible with the physician's role as healer, would be difficult or impossible to control, and would pose serious societal risks. Instead of engaging in assisted suicide, physicians must aggressively respond to the needs of patients at the end of life.\"\n\n*\n\nIt certainly makes one wonder why the public isn't given all of this information.\n\nInstead, the rush to expand access to PAD around the world in the name of humaneness is holding sway.\n\nOriginal article : “3 Things You Don’t Know about Euthanasia.” OffGuardian, 16 Apr. 2021, https://off-guardian.org/2021/04/16/three-things-most-people-dont-know-about-euthanasia/. ",
			"date_added": 1619933922
		},
		{
			"post_id": 1620001651,
			"body": "**VISIONS OF THE FUTURE: A CHESS PLAYER'S POINT OF VIEW**\n\n**IN A NUTSHELL**\n\nWhen one adopts the point of view of a chess player, conceiving possible futures is only possible in the medium term. The most urgent thing would be to become aware of, understand and prevent the last move that would put Humanity in a state of checkmate.\n\nThe ideal coup de grace would be like the current pandemic, a problem-reaction-solution[^i^](#sdendnote1sym), delivered on the twentieth anniversary of September 11[^ii^](#sdendnote2sym) in the form of bio terrorist attacks on different points of the globe[^iii^](#sdendnote3sym).. a SongBird disaster scenario! [^iv^](#sdendnote4sym)\n\nJust as Bill Gates warned in 2015 that \"if something [were to] kill more than 10 millions people in the next few decades, it [would] probably be a highly contagious virus rather than a war. »[^v^](#sdendnote5sym), he also announced this possibility two years later[^vi^](#sdendnote6sym).\n\nThe diabolical beauty of this scenario is that the hundreds of millions of people[^vii^](#sdendnote7sym) would not die from the consequences of these bio terrorist attacks but from the cytokines storm caused by the vaccine[^viii^](#sdendnote8sym), and not directly. Distraught families would drive their family members to under-equipped hospitals[^ix^](#sdendnote9sym) where the doctors themselves are sick, the nurses sick[^x^](#sdendnote10sym).. Faced with this dramatic situation, Presidents  would have to \"do tough things [...] because the circumstances [would] require it\".[^xi^](#sdendnote11sym) The government would declare the martial law[^xii^](#sdendnote12sym),  [the army would be called upon in the coming months under false pretenses[^xiii^](#sdendnote13sym)] would establish camps to accommodate those who are ill[^xiv^](#sdendnote14sym) and allow their aided suicide[^xv^](#sdendnote15sym).\n\nThis vision is the chess player's one, meaning the individual who tries to understand his opponent's tactics, to give a sense to the events before advancing his pieces. It is not the only one but one of the darkest.\n\n[i](#sdendnote1anc) Corbett. *Episode 047 -- Problem Reaction Solution*. 22 June 2008, <https://www.corbettreport.com/episode-047-problem-reaction-solution/> .\n\n[ii](#sdendnote2anc) Pozarycki, Robert. \"Plans to Mark 20th Anniversary of 9/11 Attacks Begin to Take Shape in NYC | AmNewYork.\" *AmNewYork*, 11 Mar. 2021, <https://www.amny.com/new-york/manhattan/plans-to-mark-20th-anniversary-of-9-11-attacks-begin-to-take-shape-in-nyc/> .\n\n[iii](#sdendnote3anc) Regalado, Antonio. \"It's Fiction, but America Just Got Wiped out by a Man-Made Terror Germ.\" *MIT Technology Review*, 30 May 2018, <https://www.technologyreview.com/2018/05/30/2746/its-fiction-but-america-just-got-wiped-out-by-a-man-made-terror-germ/>.\n\n[iv](#sdendnote4anc) \"SONGBIRD Trailer (2021).\" *YouTube*, 29 Oct. 2020, <https://www.youtube.com/watch?v=gXlOSEafzhY>.\n\n[v](#sdendnote5anc) Gates, Bill. \"Transcript of 'The next Outbreak? We're Not Ready.'\" *TED Talks*, <https://www.ted.com/talks/bill_gates_the_next_outbreak_we_re_not_ready/transcript?language=en#t-38140>. Accessed 5 Jan. 2021.\n\n[vi](#sdendnote6anc) \"Gates: Millions Could Die from Bio-Terrorism.\" *YouTube*, 23 Feb. 2017, <https://youtu.be/6QmH3SCX0Ro?t=6>.\n\n[vii](#sdendnote7anc) Research and data: Hannah Ritchie, Esteban. \"Coronavirus (COVID-19) Vaccinations - Statistics and Research.\" *Our World in Data*, <https://ourworldindata.org/covid-vaccinations>. Accessed 1 May. 2021.\n\n[viii](#sdendnote8anc) \"The Coronavirus Vaccine Uncensored | Robert F. Kennedy Jr. & Del Bigtree.\" *YouTube*, 22 May 2020, <https://www.youtube.com/watch?v=HuMbRBTZhCY>.\n\n[ix](#sdendnote9anc) Boehm, Eric. \"America Doesn't Have Enough Hospital Beds To Fight the Coronavirus. Protectionist Health Care Regulations Are One Reason Why.\" *Reason*, 13 Mar. 2020, <https://reason.com/2020/03/13/america-doesnt-have-enough-hospital-beds-to-fight-the-coronavirus-certificate-of-need-laws-are-one-reason-why/>.\n\n[x](#sdendnote10anc) \"Categories of Essential Workers: COVID-19 Vaccination | CDC.\" *CDCMinusSASstats*, 8 Apr. 2021, <https://www.cdc.gov/vaccines/covid-19/categories-essential-workers.html> .\n\n[xi](#sdendnote11anc) \"Entretien Exclusif : Emmanuel Macron Répond à Brut.\" *YouTube*, 4 Dec. 2020, [h](https://youtu.be/IvkewyupR_8?t=8580)[ttps://youtu.be/IvkewyupR_8?t=8580](https://youtu.be/IvkewyupR_8?t=8580) .\n\n[xii](#sdendnote12anc) control, Authority. \"Martial Law - Wikipedia.\" *Wikimedia Foundation, Inc.*, 27 Sept. 2020, <https://en.wikipedia.org/wiki/Martial_law>.\n\n[xiii](#sdendnote13anc) *France: 20 Ex-Generals Warn Macron of Chaos, Civil War*. <https://www.aa.com.tr/en/europe/france-20-ex-generals-warn-macron-of-chaos-civil-war-/2218775>. Accessed 2 May 2021.\n\n[xiv](#sdendnote14anc) Broze, Derrick. \"The CDC Is Planning Quarantine Camps for Americans | The Conscious Resistance Network.\" *The Conscious Resistance Network*, 9 Nov. 2020, <https://theconsciousresistance.com/the-cdc-is-planning-quarantine-camps-for-americans/> .\n\n[xv](#sdendnote15anc) \"3 Things You Don't Know about Euthanasia.\" *OffGuardian*, 16 Apr. 2021, <https://off-guardian.org/2021/04/16/three-things-most-people-dont-know-about-euthanasia/>.\n",
			"date_added": 1620001646
		},
		{
			"post_id": 1628468471,
			"body": "Don’t guess about the future. Shape it.\n\nI.\n\n“You don't need to predict how everything will play out.\n\nJust master the next step and continue moving in the right direction.”\n\n​II.\n\n“Prediction depends on events outside your control.\n\nCreation depends on events within your control.\n\nDon’t guess about the future. Shape it.”\n\nSources : \n- https://jamesclear.com/3-2-1/july-8-2021\n- https://www.pxfuel.com/en/free-photo-omuba\n",
			"date_added": 1628468465,
			"meta": "{\"img\":\"900,675,224335446533545767667977654765a87ca9db9323432865,00111111000111111100011222211013122445101325677800197ABCA1000DE8FF810000398ED000\"}"
		},
		{
			"post_id": 1628553397,
			"body": "OPPORTUNITIES\n\n“Every opportunity is attached to a person. Opportunities do not float like clouds in the sky. They’re attached to people.\n\nIf you’re looking for an opportunity — including one that has a financial payoff — you’re really looking for a person.”\n\nSources : \n- https://jamesclear.com/3-2-1/july-22-2021\n- https://flic.kr/p/7yh8gF",
			"date_added": 1628553390,
			"meta": "{\"img\":\"900,599,100222a86dcb999bbafff554776edc665cb9b98aa9443864,01234125651074489639A799BC63D9E4692F3696E8B3CB9299AD539992D8566939B547\"}"
		}
	],
	"post_like": {
		"17UQp77opheXMS88oZdedCisHVZx6Waqs3_1629349917": 1630042742
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@mxh69420: :) Just enough to get started",
			"post_uri": "12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u_1620001651",
			"date_added": 1620110110
		},
		{
			"comment_id": 2,
			"body": "I agree with your comment on terrorism. It's going to be the next crisis Humanity is going to face. In my post in May http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/12ECmMn6jBG8mXqziiAt5s9S8mbtmsL71u/1620001651\nI was thinking of bioterrorism as a way for governments to gain even more power over populations. \nHave you looked into CyberPolygon?\nhttps://cyberpolygon.com/",
			"post_uri": "17UQp77opheXMS88oZdedCisHVZx6Waqs3_1629349917",
			"date_added": 1630043034
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx",
			"user_name": "mxh69420",
			"date_added": 1620110387
		},
		{
			"follow_id": 3,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "18V3yAk827Q61WfYormvHGbKgDx3cs3kyu",
			"user_name": "Atdandotnet",
			"date_added": 1620208173
		}
	]
}