{
	"next_comment_id": 9,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [patrickjnr](#comment_2_1AKkccczQm6CbsjiKZAaFpx21i3AU3Kmgp): PORN?!\n\nIt's what the Internet is for! xD",
			"post_id": 9,
			"date_added": 1499727573
		},
		{
			"comment_id": 2,
			"body": "> [binchan2](#comment_1_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): Very useful! Thx for sharing this!For learning languages, there is a method called Direct Method https://en.wikipedia.org/wiki/Direct_method_(education) , you may already know or be interested in it :)\n\nDon't think I've heard of this. Least not by name. Thank you!",
			"post_id": 5,
			"date_added": 1499927832
		},
		{
			"comment_id": 3,
			"body": "> [krixano](#comment_1_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): You can publish it to the repo index so other people can easily see the repo from there, and can star it.\n\nWorking on it!",
			"post_id": 31,
			"date_added": 1512090358
		},
		{
			"comment_id": 4,
			"body": "> [binchan2](#comment_2_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): First time know PoC and it sounds wonderful. Thanks for sharing!\n\nYou're welcome! Glad I could help spread the word.",
			"post_id": 50,
			"date_added": 1519976804
		},
		{
			"comment_id": 5,
			"body": "> [subpixel](#comment_1_1LnZaBceMgTZ3FvCo69ZzuyhYpHxfUNH3F): ASIC resistant PoW is not energy-efficient. The flaw is mining itself.\n\nYou still got to generate money somehow. The SAFE network is based on supply and demand of the network rate combined with a certain rank.",
			"post_id": 52,
			"date_added": 1519995528
		},
		{
			"comment_id": 6,
			"body": "> [ssdifnskdjfnsdjk](#comment_1_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): @zc456 @subpixel\n> \n> Hi, how as a noob can i discover whether certain crypto is resistant?\n\nIf it's based on Proof of Work, then it you'd have to check the algorithm. Monero is based on CryptoNight algorithm - which is Proof of Work-based but takes steps to make it ASIC resistant. \n\nFor others, it's based on the hashing function: Proof of Stake and Capacity are two different methods that don't have to worry about ASICs. They still have their flaws but they're easier to fix.",
			"post_id": 52,
			"date_added": 1520000372
		},
		{
			"comment_id": 7,
			"body": "> [ssdifnskdjfnsdjk](#comment_2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Is there any reason why Bitcoin should not improve and become more usable cryptocurrency with low feed and quick transactions? Though some people say Bitcoin is not good and fast in adopting new things.\n\nIt all depends on the developers, unfortunately. Look what happened with Segwit how it lead to the events that created Bitcoin Cash.",
			"post_id": 53,
			"date_added": 1520145887
		},
		{
			"comment_id": 8,
			"body": "Sorry for any confusion.\n\n> [ssdifnskdjfnsdjk](#comment_3_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I would welcome if you can try to talk about this more as i do not get that sentence.\n> Do not try to push your friend into something, he will not like it. If you face some evidence that support your claim you may say it, but i would not push.\n\n\n> [binchan2](#comment_3_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h): It's not worth losing an old friend because of this kind of things..\n\nAll I wanted him to do is try out Monero. That's it and he has basically taken over the wheel since then and all I can do is facedesk. I haven't discussed my frustrations with him because, you're right, it is silly to loose a freind over something like this.\n\n> You'll be hopping from currency to currency once the because the network is non-existent outside of the miners because no one will be there to pay for the fees.\n\nI'm sorry this part was confusing, @ssdifnskdjfnsdjk. I realize it was a bit of bold claim based on no evidence but it's just a fear of mine. It's just there so many cryptocurrencies out there I find it hard to believe the networks would be active enough.",
			"post_id": 62,
			"date_added": 1527117120
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}