{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1565142251_19kyqLzQKf2Ba6ABfAsZqXjTvg33LdcPQP": 1,
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1565795636_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 1,
				"body": "Disable the proxy in the tor settings for 127.0.0.1:43110 and then you should be able to use TOR instead of your current browser.\nEnjoy.",
				"added": 1565796326
			},
			{
				"comment_id": 2,
				"body": "> [crazylime](#comment_99_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n):ZN has good starter docs, but by the time you finish it and begin to play, you'll have more questions than answers\n\nAbsolutely, the starter docs are very bad / incomplete. Unfortunately, they're not as easily editable as Wikipedia right?",
				"added": 1565805239
			},
			{
				"comment_id": 5,
				"body": "> [bvcfbfbcbcvd](#comment_29_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Disabling the proxy in Tor Browser will turn it into a normal Firefox, won't it? That sounds like a horrible advice...\n\nRead my entire message boomer",
				"added": 1565818320
			},
			{
				"comment_id": 6,
				"body": "> [bvcfbfbcbcvd](#comment_30_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7): Firefox ignores localhost for proxies on its own, though... And why do you call it \"TOR\"?\n\nPlease uninstall Zeronet, thanks.",
				"added": 1565819205
			}
		],
		"1565811143_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 3,
				"body": "Just create a new ZeroID, there's no way to tell what your new ID is. Unless you act like a boomer and he catches on.",
				"added": 1565813701
			}
		],
		"1565814656_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 4,
				"body": "This message means Zeronet is not running. It probably crashed, I'd reinstall it from scratch. Save your ../data/users.json and paste it into the new install if you want to keep your ID, otherwise you'll have to make a new one.",
				"added": 1565815842
			}
		],
		"1565847129_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": [
			{
				"comment_id": 7,
				"body": "> [nickwa](#comment_363_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): If you really want to legit destroy ZeroNet. Get a spare HDD, encrypt, destroy the whole thing, then physically destroy the HDD. If you want to be 100% sure, just wipe it about 6 times, put a magnet on it, burn it, then piss on it.\n\n\"C. Destruction is not detectable, so you are not charged with destruction of evidence.\"",
				"added": 1565863297
			}
		],
		"1566248008_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH": [
			{
				"comment_id": 8,
				"body": "> [08admin](#comment_14_1KSUcqHRcq26pF5vJ2297jrNcAzkNvLtSH): Best I can say is patience.  It took a good 20 minutes of loading and fiddling to get it to work for me.  There's also a manual update path you can do from the clearnet site 08ch.net\n\nI just removed the guides on how to install the millchan update as it was integrated to the site...\nShould I put them back?",
				"added": 1566251117
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_914_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): a guide is here, i hope it will be left there as it is quite useful guide on how to upgrade a code using git\n\nYes I know, im the one running the 08ch.net page. I had exactly this on the site aswell. However now that this is no longer needed I removed it.",
				"added": 1566296740
			},
			{
				"comment_id": 10,
				"body": "> [somerando](#comment_3_1BRQUkyDA6VNhSC3KDLfmuyVKMP3LkwpkG): I would have liked to use 08chan, but the second I saw the \"Child Porn\" board I deleted it, since I don't know how 08chan handles data distribution as far as boards go, especially for thumbnails.Am I fine as long as I just don't click on the board? I just don't want this shit on my drive.\n\nYes you will be fine if you dont click on it and dont select \"help distribute all files\".\n\nI'm working on a 08chan download with a preconfigured blacklist, keep checking 08ch.net :)",
				"added": 1566299922
			}
		]
	},
	"comment_vote": {
		"2_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"8_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"1_1GSRSdEwbEHiMPaKe1R2ndmym83ZFz8Neo": 1,
		"299_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	}
}