{
	"next_comment_id": 51,
	"user_name": "Geekless",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535840722": 1535850802,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1548924540": 1548948743,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549102056": 1549109813,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549104943": 1549109817,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549271102": 1549351813,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549431187": 1549435861,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199": 1549509764,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549506716": 1549509844,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549539176": 1549539394,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549539539": 1549539466,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549682316": 1549684189,
		"131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_1562183710": 1562203661,
		"1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR_1579532128": 1583941474,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1585309198": 1585309095,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661": 1597922119,
		"1ufDwJisEDriKQxYJSz2HuUhgqAG15JyL_1594568893": 1598113985
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "Great work! Thank you, Krixano, and thank you, @gitcenter for the plugin!\nIt is what I've been thinking about for long time, since I got to ZeroNet.",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535624559",
			"date_added": 1535694297
		},
		{
			"comment_id": 2,
			"body": "How the race condition between the multiple trusted clients is solved?",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535705293",
			"date_added": 1535705038
		},
		{
			"comment_id": 3,
			"body": "Hmm, but [ZeroMe user registry](http://127.0.0.1:43110/1UDbADib99KE9d3qZ87NqJF2QLTHmMkoV/data/userdb/content.json) allows only zeroid.bit and zeroverse.bit. Does it mean kxoid users are missing from the search results etc?\n",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1535947032
		},
		{
			"comment_id": 4,
			"body": "@Krixano: It looks like they are also missing from the Activity feed too. When I click \"Followed users\", I can see \"caryoscelus started following Krixano\" in the feed. And when I click \"Everyone\", that line disappears.",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1535965556
		},
		{
			"comment_id": 5,
			"body": "@Krixano: thank you for the explanation! :)",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1535914162",
			"date_added": 1536030151
		},
		{
			"comment_id": 6,
			"body": "\"No peers found\". But your old blog works fine.",
			"post_uri": "15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG_1548950112",
			"date_added": 1548950999
		},
		{
			"comment_id": 7,
			"body": "seems to work now",
			"post_uri": "15dMbdM7c2RT9RhNTJRqzc4vYSvrSJvxyG_1548950112",
			"date_added": 1548956739
		},
		{
			"comment_id": 8,
			"body": "@Kaffie: sorry for the offtopic, but I sent you a message via ZeroMail, please read",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549104943",
			"date_added": 1549112950
		},
		{
			"comment_id": 9,
			"body": "@Kaffie: \n\n> I'm pretty anti-blockchain. I fail to see how it can be a truly decentralized solution when it requires huge centralized mining pools and a constant internet connection.\n\nYeah!\nIt's just the \"money makes money\" principle. Who controls big money can run huge mining pools and make yet more money. It has nothing to do with real P2P technologies, that are for usual people, not corporations.\n\nCorporations tend to grow larger and larger, and now it is not even completely clear who actually controls whom: governments control corporations or corporations control governments. But the both things crave to control all the people.\n\nIt's just a matter of time, when a large enough corporation will take control over 51% of the mining power and all your bitcoins get controlled. Or maybe it has already done in a silent way.\n\nThe only thing you can trust, more or less, is pure math, that is cryptography. Blockchain is not about cryptography! It is about \"who has the power to write the history\".",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549102056",
			"date_added": 1549114776
		},
		{
			"comment_id": 10,
			"body": "@Kaffie: Received it. If you don't mind, I'll post my response to a forum and send you the link.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549104943",
			"date_added": 1549119655
		},
		{
			"comment_id": 11,
			"body": "@Pexo: \n> Well spamming users can be muted and at some point won't find their files propagated anymore.\n\nYou still keep and distribute files of the muted users, they are just not shown to you in the UI.\n\nSo that's the problem.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549255260",
			"date_added": 1549343669
		},
		{
			"comment_id": 12,
			"body": "What is great about certificate-based domains is that you still have a chance to resolve the domain even if the database of the certificate provider is not available for some reason. Just scan the data folder and find a file that is signed with the certificate.\n\nBut it is not implemented in my proof of concept yet.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549259960",
			"date_added": 1549350677
		},
		{
			"comment_id": 13,
			"body": "\"We need a crypto to pay for a hosting\", my ass! I host 600+ zites, they take ~3.1G, and no one should pay a cent for that. Just do something useful, interesting or funny, and people will host it, share it and promote it. For free.\nIf you want to push some bullshit to people, sure you have to pay money to compensate the negative cost of your \"products\".",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549271102",
			"date_added": 1549353203
		},
		{
			"comment_id": 14,
			"body": "@Kaffie:\n\n> Tor support absolutely is not why ZeroNet is used more than IPFS. I fail to see any benefits in it tbh.\n\nTor is a great tool, and what about me, I'm a big fan of ZeroNet because of the Tor support, amount other things. Apart from the fact that it is an anonymization tool, it can be used as a kind of VPN, and it is also great for bypassing NATs and handling incoming connections without having to tunnel ports from a VPS. (Of course, incoming connections are not to IP addresses, but to onion addresses, but since ZeroNet is distributed with Tor included, it's totally transparent.)\n\nBy the way, here in my location, I still have no IPv6 support, and my ISP just doesn't care.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549271102",
			"date_added": 1549353570
		},
		{
			"comment_id": 15,
			"body": "@Kaffie: That is the case only for providers without published private key and known to play fair. Certificates for providers such as kaffie.bit should not be used for domain routing. I guess there should be the default white list in the plugin, and user can manage it as well.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549259960",
			"date_added": 1549362044
		},
		{
			"comment_id": 16,
			"body": "@Nofish: What should be the right behaviour when the application gets a file update, that is blocked by the content filter?\n\nShould it respond with the default \"ok\" code and silently ignore the file, or should it send some error code?\nThe former silently reduces the network connectivity, without any way for the sending node to know that it should try sending the update to other nodes.\nAnd the latter probably makes fingerprinting techniques possible.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549255260",
			"date_added": 1549362909
		},
		{
			"comment_id": 17,
			"body": "@Kaffie: We are doomed to some kind of centralization by Zooko's triangle.\nActually, it's a fundamental problem, that limits abilities for decentralization of any system.\n\nIf a system is okay with meaningless addresses, it can be decentralized at any scale. And if we want to use a naming system, we have to get back to a centralized provider, that actually **assigns** names and guarantees their uniqueness.\n\nWe can also try making the naming system federative, which means we move to the \"decentralized\" part of the triangle and leave the \"secure\" part. More federative centers, more points of failure. More federative centers, more chances of naming conflicts and misconfigurations of client applications as well.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549259960",
			"date_added": 1549364449
		},
		{
			"comment_id": 18,
			"body": "@Quantumworld: \n\n> Communism looks good on paper but when used in real world applications it is a horrid and brutal system of control.\n\nI can tell you, what we had in comminist/socialist USSR was a naive and helpless system of control, compared to the modern ones, no matter if it is the system of USA, China or Russia.\n\nWe now deal with dark forces, that go from inside of humans, and are now almost not limited of anything, since technologies are the modern magic. The more powerful technologies people have, the more powerful evil we face with.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549102056",
			"date_added": 1549365728
		},
		{
			"comment_id": 19,
			"body": "I should think about automating the process of importing mute lists into the ban list on my sites.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549510566
		},
		{
			"comment_id": 20,
			"body": "@Quantumworld: \n\n> I hate running a block list from other peoples lists. \n\nI hate that too, and I usually don't trust people enough to follow their mute lists.\nNow it's the first time I've enabled a 3rd party mute list. Kaffie is a well known ZeroNet user, so I guess I can trust the list this time.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549506716",
			"date_added": 1549511109
		},
		{
			"comment_id": 21,
			"body": "@Quantumworld:\n\n> There needs to be a delete option for zerome\n\nYou are switching between liberal and totalitarian views so fast, so I'm a little confused.\n",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549506716",
			"date_added": 1549511564
		},
		{
			"comment_id": 22,
			"body": "@Kaffie: \n\n> Ideally in the future mutes will delete the content from your machine and not distribute any from those users.\n\nLooks like that won't be implemented until Nofish finishes porting the code base to python 3.\n",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549506716",
			"date_added": 1549511819
		},
		{
			"comment_id": 23,
			"body": "@Kaffie: \n\n> Not sure how you'd do it.\n\nIt requires for the admin (or anyone who can modify `data/users/content.json`) to be online, of course.\n\nThe idea is that the site engine reads the mute list and modifies the `permissions` section. Moreover, since the file has no strict format, there can be additional fields there, clearly stating the ban reason and the source list.\n\nSo many features that can be implemented on top of the current ZeroNet core, and so little time...\n\nRight now I'm stuck with redesigning ZeroBlog internals from the God-object antipattern into a flexible component model. I hope to unify ZeroBlog and ZeroTalk engines into an single framework, but I have some troubles designing the architecture...",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549513862
		},
		{
			"comment_id": 24,
			"body": "@Quantumworld:\n\nbeing a jerk and being a bot are totally different matters :D",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549513969
		},
		{
			"comment_id": 25,
			"body": "@Quantumworld:\n\nThere will be, for sure. I guess the first ones will be from China or Russia.\nPersonally, I'm not planning to use mute lists to block just random jerks. But bots.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549514219
		},
		{
			"comment_id": 26,
			"body": "What about the timer idea, I like it.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549514367
		},
		{
			"comment_id": 27,
			"body": "@Kaffie: I can not see the ban entries on your hub: http://127.0.0.1:43110/12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv/data/users/content.json",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549530249
		},
		{
			"comment_id": 28,
			"body": "@Kaffie: \n\n> the normal method doesn't allow auth_address bans, only name bans.\n\nWhy not? I tryed using auth_addresses instead of names in the `permissions` table to set limits, and it worked just fine.\n\nThe code: https://github.com/HelloZeroNet/ZeroNet/blob/master/src/Content/ContentManager.py#L484",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549530573
		},
		{
			"comment_id": 29,
			"body": "https://github.com/HelloZeroNet/ZeroNet/commit/4efcfa8bf49a1d9ce9b6b8095b4cd92d30c70d74",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549530738
		},
		{
			"comment_id": 30,
			"body": "@Kaffie: I tried rebuilding the database, and it had no effect. Maybe that's an issue of the merger feature. It's implemented as a plugin, so maybe it badly operates with the core parts.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549532055
		},
		{
			"comment_id": 31,
			"body": "Looks like whitelists are the only solution. I cannot see any other reliable way.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549532248
		},
		{
			"comment_id": 32,
			"body": "I renamed the spammer's data file and rebuilt the database. Now the comments, related to your hub, diappeared.\n\nI've not checked out the sources yet, but here's my guess what happens:\n\n1. In the core engine, the ban check prevents data from both receiving over the network and getting into the database.\n2. But it doesn't delete the affected files automatically.\n3. The merger feature ignores the ban check and uses all the files to build the database.\n\nSo ban on hubs works more like freeze.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549509199",
			"date_added": 1549533028
		},
		{
			"comment_id": 33,
			"body": "@leftside: \n\n> @Geekless: Stackexchange runs such a kind of system though each forum has different intensity on the policy.\n> .\n> But as u guys know, that white list easily makes newbies pissed off.\n> .\n> Careful arrangements of rules will do the job.\n\nThe rules work in the Clearnet (more or less), since the registration on a site has a cost. It's a captcha, the need of unique email address for each account (which means captcha again), premoderation of new users, ban by IP, etc.\n\nSo an automated attack has some real cost, which not every evil person's ready to pay.\n\nHere in ZeroNet, an account is just a sequence of random letters, and no preliminary checks are possible. Your site either has non-zero limit for \"unknown\" accounts and allows posting for everyone, or not.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549533591
		},
		{
			"comment_id": 34,
			"body": "@leftside: \n\n> I meant, reputation or score system of stackexchange for a new user to have the right to post more than n posts a day or a week and so on..\n\nWhat prevents an attacker from creating 10000 accounts per day and posting n\\*10000 posts?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549534572
		},
		{
			"comment_id": 35,
			"body": "@leftside: \n\n> REGEX FILTER~! :)\n\nRegEx filter prevents an attacker from creating accounts at ZeroID? Hmmm, do we speak the same language?\n",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549534760
		},
		{
			"comment_id": 36,
			"body": "@leftside: \n\n> It's none of my business how many IDs the spammers are creating. It's something to do with ID providers' side. Even though they made 1M IDs in an hour, if they don't shit on my site, it doesn't matter.\n\nIf they do, it's your business. And since nothing stops them, they for sure will do.\n.\nIt is only a matter of time, when our new friend from the government gets to some automation tools.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549535272
		},
		{
			"comment_id": 37,
			"body": "@Polar🍀☘️🌿🌾🌴: PeakID seems to be a nice idea. I was thinking about running my own ID provider as well, but without hard dependency on Google. We should provide more alternatives.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549529668",
			"date_added": 1549538482
		},
		{
			"comment_id": 38,
			"body": "Ahaha!\nWhen I went to school, I once asked my English teacher, why all the \"to be\" exercises had the indefinite article after the verb. She had thought for a while and answered: \"I can not think of any case, when there should be _the_ there.\"",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549539176",
			"date_added": 1549539401
		},
		{
			"comment_id": 39,
			"body": "ROFL :D Why me?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549539539",
			"date_added": 1549539490
		},
		{
			"comment_id": 40,
			"body": "@Kaffie: It works perfectly. I see no spam at all on this ZeroNet instance, which is subscribed to your list. Thanks!!",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549539539",
			"date_added": 1549539745
		},
		{
			"comment_id": 41,
			"body": "iframe Зеронету нужен только для разграничения прав доступа. Ну найдём другой способ, будем гонять через SOCK5 прокси с разбивкой по доменам.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562646532
		},
		{
			"comment_id": 42,
			"body": "@If0: Разграничение прав работает на по доменам, а ZeroNet отображает все сайты на одном домене. С точки зрения браузера, это один большой сайт. Поэтому сайты грузятся в iframe, а обёртка обеспечивает изоляцию. Если через прокси грузить сайты по адресами вида http://blabla.zero/barbaz, то blabla.zero будет считаться именем домена, и вопрос решен.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562656304
		},
		{
			"comment_id": 43,
			"body": "@If0: Нужен не просто DNS, а полноценная обработка доменов на стороне узла ZeroNet.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562659150
		},
		{
			"comment_id": 45,
			"body": "@If0: Как выяснилось, в ядре поддержка есть.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562663885
		},
		{
			"comment_id": 46,
			"body": "@Kids:\n\n> Про разграничение прав между доменами - понятно, но там не обычное разделение: авторизация/мержи/и т.д., без iframe это не будет работать изолированно. Или планируется полноценный переход на api с запретом js?\n\nПочему не будет? Как раз по \"реальным\" доменам (как их видит браузер) будет проще. Мерджи и т.п. выполняются на стороне ZeroNet.\n\n(Возможно, я что-то не учитываю.)\n\n> Где можно потыкать? Хотелось бы как с .onion , чтоб всю зону завернуть в прокси.\n\nЮзеры не хотят всю зону в прокси, они хотят какие-то странные костыли с обработчиками протокола: https://github.com/HelloZeroNet/ZeroNet/issues/2087\nЯ не понимаю, что им надо, честно говоря.\n\nПотыкать можно начиная с этого бага, лол: https://github.com/HelloZeroNet/ZeroNet/pull/2089\n\nВидимо, код никто никогда не отлаживал. Это работало на машине того, кто запилил фичу год назад, и с тех пор никто её не проверял.\n\nПока план такой:\n* Востановить работоспособность прокси для *.bit (в PR выше)\n* Востановить работоспособность прикси для http://zero/<address> (Знаю, где баг, не успел исправить еще.)\n* Запилить плагин для cert-based доменов. (Старый набросок для py2 у меня есть, переделать будет не сложно.)\n* Запилить обработку адресов адресов биткойн в нижнем регистре, как предложил @gitcenter. (Вот тут будет много мелкой возни.)\n* Запилить в ядро обработку суффикса .zeronet (по сути всё, что требуется, при обнаружении суффикса - его молча отбрасывать и оставшийся кусок маршрутизировать по обработчикам как обычно). Тогда получится настроить одновременную работу с ZeroNet и с остальным вебом. (Хотя целесообразность этого под сомнением)\n\nВ целом всё пока выглядит даже проще, чем реализовать DHT. Работу над DHT я пока забросил, на этой неделе нет времени на вдумчивый код.",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1562819938
		},
		{
			"comment_id": 47,
			"body": "@Kids:\n\n> Всё дело в плашке, которая появляется при запросах выбора профиля и подобных. Если её инжектить в страницу без iframe, то сайты смогут вмешаться в её работу.\n\nЭто на работоспособность сайта не влияет, на удобство - да. В качестве костыля можно использовать перенаправления на админский интерфейс, аналогично тому, как делается межсайтовая авторизация в вебе.\n\nВсё дело в подходе: если у некоторых свербит в заднице от iframe, то пусть берут и переделывают, либо валят пилить собственный нуль-нет. А если вопрос в том, что теоретически гугль может прикрыть iframe с концами - то да, надо иметь план Б про запас, но пока вопрос не горит.\n\n> Юзеры хотят the pseudo-TLD .zeronet\n\nЭто хорошие годные юзеры.\n\n> Но встаёт вопрос по обработке ссылок (прямые/относительные), есть какое-то готовое решение?\n\nПереключаться между разными типами ссылок основные движки сайтов умеют. Остальным придётся научиться. В любом случае, переделывать придётся и те, что умеют - там всякие частные случаи вылазят...\n\n> А какой в этом смысл?\n\nСмысл в том, что механизмы обработки хоста в режиме проксирования написаны с ошибками, и их надо чинить. \n",
			"post_uri": "1BkWiFaG1jeXVB4PDstZhRLjDLiVsBRKW8_1562430013",
			"date_added": 1563016355
		},
		{
			"comment_id": 48,
			"body": "Welcome back!",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1597919661",
			"date_added": 1597922214
		},
		{
			"comment_id": 50,
			"body": "Well, in theory, an owner of ZeroMe hub where your profile is located can ban you. But you can run your own copy of ZeroBlog to be completely uncensorable.",
			"post_uri": "1JEkT4fCm1xo9HX4KPHLJM341j9M1bVYBa_1598269826",
			"date_added": 1598272362
		}
	]
}