{"next_paste_id":10,"next_comment_id":0,"paste":[{"paste_id":0,"description":"Armas biológicas | Nerdologia","body":"Takahashi, Hiroshi, Paul Keim, Arnold F. Kaufmann, Christine Keys, Kimothy L. Smith, and Kiyosu Taniguchi. \"Bacillus anthracis bioterrorism incident, Kameido, Tokyo, 1993.\" Emerg Infect Dis 10 (2004): 117-20.\nStern, Jessica. \"The prospect of domestic bioterrorism.\" Emerging Infectious Diseases 5, no. 4 (1999): 517.\nThomas, Stephen B., and Sandra Crouse Quinn. \"The Tuskegee Syphilis Study, 1932 to 1972: implications for HIV education and AIDS risk education programs in the black community.\" American journal of public health 81, no. 11 (1991): 1498-1505.\nSingh, Jerome Amir. \"Project Coast: eugenics in apartheid South Africa.\" Endeavour 32, no. 1 (2008): 5-9.\nFeng, Wang, Yong Cai, and Baochang Gu. \"Population, Policy, and Politics: How Will History Judge China's One‐Child Policy?.\" PoPulation and develoPment review 38, no. s1 (2013): 115-129.","language":"text/plain","encrypted":false,"added":1624316437},{"paste_id":1,"description":"A One-Time Pad variant without the key distribution problem (https://github.com/RentedWiryValley/Sciences/blob/main/Cryptography/FSOOTCP.md)","body":"## Finite-State (Open) One-Time Combined Pad\n\n#### Introduction\n\nA One-Time Combined Pad (OTCP) is a One-Time Pad (OTP) that's constructed by the combination (XOR) of multiple OTPs. Like OTP, OTCP has perfect secrecy if the pads are kept secret (and the other conditions are met).\n\nFinite-State One-Time Combined Pad (FSOTCP) and Finite-State Open One-Time Combined Pad (FSOOTCP) are a construction of OTCPs that cannot practically be reestablished by an adversary even if the raw OTPs are not kept secret.\n\nThe basic form of FSOTCP/FSOOTCP is as follows:\n\n1. Generate `N` OTPs.\n2. Index the pads, i.e., `0`, `1`, ..., `N-1`.\n3. Determine the target entropy (`T`), e.g, `128`, `256`, and so on.\n4. Find the minimum number of pads needed (`K`), which is the minimum number that satisfies `log₂(N! / K! / (N - K)!) ≥ T`.\n5. Generate `K` unique random numbers that range from `0` to `N-1` inclusive.\n6. Select the pads of which the indexes are equal to the unique random numbers.\n7. Combine (XOR) all selected pads to get the final OTP.\n\n\\* The `K` unique random numbers are the secret key.\n\nFSOTCP is when the raw OTPs are kept secret. FSOTCP has perfect secrecy.\n\nFSOOTCP is when the raw OTPs are disclosed. FSOOTCP has truly provable security.\n\nThe secret key can be reused with new raw OTPs in both FSOTCP and FSOOTCP.\n\nSince the secret key can be reused and the pads can be shared publicly in FSOOTCP, it can be said that FSOOTCP has solved the key distribution problem of OTP, at the cost of perfect secrecy.\n\nThe resulting pad of an FSOTCP/FSOOTCP is random, not pseudorandom.\n\n#### filexor\n\nThe project filexor in SoA is an implementation of FSOTCP/FSOOTCP in a slightly tweaked form. It performs a buffer-wide \nbitwise circular shift on each selected pad with the number of bits shifted being the index of the pad within the selection. The shift has two immediate effects:\n\n1. It makes the order matter, which effectively switches the selection from combination to permutation.\n2. It makes reused pads not cancel each other out, of which the complication is to be studied.\n\nWhen a pad is reused in filexor, it is XORed by a bitwise-shifted version of itself. It is uncertain at this stage whether there is any loss of entropy/randomness. Two extreme possibilities are as follows:\n\n- The loss of entropy/randomness is disastrous. If this is the case, pads cannot be reused. The overall result is permutation without repetitions. Subsequently, the minimum number of pads needed must satisfy `log₂(N! / (N - K)!) ≥ T`.\n- There is no loss of entropy/randomness. If this is the case, pads can be reused, which effectively switches the selection from permutation without repetitions to permutation with repetitions. Subsequently, the minimum number of pads needed can be calculated as follows: `K = Ceiling(T / n)`, where `n = log₂(N)`.\n\nEither way, the number of pads needed, i.e., the size of the secret key, is reduced.\n\n#### Endless FSOOTCP\n\nAlthough FSOOTCP has solved the key distribution problem of OTP, sharing files of gigabytes or more, even publicly, is most likely not ideal. A practically endless sequence of random numbers with pads of limited lengths can be created with the following algorithm:\n\n1. Export the resulting pad's numbers as usual up till the size of the remaining numbers at the end of the pad is the same as or close to the size of the secret key.\n2. Use the remaining numbers as the new secret key on the same pads to form a new FSOOTCP.\n3. Repeat 1 and 2.\n\nSimilar to filexor, a tweak can be introduced to reduce the size of the secret key. Besides buffer-wide bitwise circular shift, there are other options, such as integer-wide bitwise circular shift and byte-level shift based on the index of the pad within the selection.\n\nAlthough it is clear that the resulting pad of the first round of an Endless FSOOTCP is random, whether those of the remaining rounds are random or pseudorandom is to be decided. Regardless, an Endless FSOOTCP can withstand state compromise extensions.\n","language":"text/plain","encrypted":false,"added":1624560483},{"paste_id":2,"description":"Salmos 51","body":"Tem misericórdia de mim, ó Deus, por teu amor; por tua grande compaixão apaga as minhas transgressões.\nLava-me de toda a minha culpa e purifica-me do meu pecado.\nPois eu mesmo reconheço as minhas transgressões, e o meu pecado sempre me persegue.\nContra ti, só contra ti, pequei e fiz o que tu reprovas, de modo que justa é a tua sentença e tens razão em condenar-me.\nSei que sou pecador desde que nasci, sim, desde que me concebeu minha mãe.\nSei que desejas a verdade no íntimo; e no coração me ensinas a sabedoria.\nPurifica-me com hissopo, e ficarei puro; lava-me, e mais branco do que a neve serei.\nFaze-me ouvir de novo júbilo e alegria; e os ossos que esmagaste exultarão.\nEsconde o rosto dos meus pecados e apaga todas as minhas iniqüidades.\nCria em mim um coração puro, ó Deus, e renova dentro de mim um espírito estável.\nNão me expulses da tua presença, nem tires de mim o teu Santo Espírito.\nDevolve-me a alegria da tua salvação e sustenta-me com um espírito pronto a obedecer.\nEntão ensinarei os teus caminhos aos transgressores, para que os pecadores se voltem para ti.\nLivra-me da culpa dos crimes de sangue, ó Deus, Deus da minha salvação! E a minha língua aclamará à tua justiça.\nÓ Senhor, dá palavras aos meus lábios, e a minha boca anunciará o teu louvor.\nNão te deleitas em sacrifícios nem te agradas em holocaustos, se não eu os traria.\nOs sacrifícios que agradam a Deus são um espírito quebrantado; um coração quebrantado e contrito, ó Deus, não desprezarás.\nPor tua boa vontade faze Sião prosperar; ergue os muros de Jerusalém.\nEntão te agradarás dos sacrifícios sinceros, das ofertas queimadas e dos holocaustos; e novilhos serão oferecidos sobre o teu altar.\n\nSalmos 51:1-19","language":"text/plain","encrypted":false,"added":1626360446},{"paste_id":3,"description":"Sem Clima - Uma República Controlada pelo Agronegócio (https://yewtu.be/GoPn0IoouvM)","body":"Sinopse:\n\nDe Olho Nos Ruralistas lançou seu primeiro documentário: “Sem Clima – uma República controlada pelo agronegócio”. Qual a relação entre a bancada ruralista e as mudanças climáticas? Ou, pensando no Acordo de Paris: com o Congresso que temos o Brasil será capaz de cumprir o acordo?\n\nPara tentar responder a essas perguntas o observatório entrevistou, durante sete meses, parlamentares e especialistas no tema. A equipe foi até Brasília conversar com os próprios ruralistas, mas acabou expulsa da sede da Frente Parlamentar da Agropecuária, uma mansão no Lago Sul. Por quê?\n\nDesde o impeachment de Dilma Rousseff, em 2016, os ruralistas - que já tinham grande espaço no governo - se fortalecem ao ponto de indicar representantes em diversos postos chave do Executivo. Do Ministério da Agricultura ao Ministério da Justiça, passando pela Casa Civil. O poder político do agronegócio se multiplica.\n\nComo eles têm agido no Congresso e no Executivo? Que leis estão aprovando, que projetos (relativos a desmatamento e terras indígenas, por exemplo) podem ameaçar os compromissos assumidos pelo Brasil? E o que pensam os parlamentares e lideranças críticos desse modelo ruralista?","language":"text/plain","encrypted":false,"added":1626641517},{"paste_id":4,"description":"Não Perca Tua Fé - Rick e Renner","body":"Deus tá vendo a tua luta\nO teu choro ele escuta\nEntão não perca a tua fé\n\nEle conhece a tua história\nNão vá desistir agora\nNão perca a tua fé\n\nEle tarda mas não falha\nE no fim dessa batalha\nVocê vai ser vencedor\n\nEntão não perca a tua fé\nAcredite você é\nUm Escolhido do Senhor\n\nSe acalme, se controle\nPorque Deus tá no controle\nConduzindo a tua vida\n\nE você só tem que crer\nQuando Deus tá com você\nNão tem batalha perdida\n\nSeja crente, seja forte\nPorque não existe sorte\nE capaz todo mundo é\n\nSeja firme e persistente\nEncare a vida de frente\nE não perca a tua fé\n\nSei que você está cansado\nSe sentindo humilhado\nMas não perca a tua fé\n\nCoração está pulsando\nVocê está vivo, respirando\nEntão não perca tua fé\nTantas são as provações\n\nSaiba que as decepções é que nos fazem crescer\nDeus sabe do teu coração\nSeu choro vira uma oração\nEntão não perca tua fé\nSe acalmem se controle\n\nPorque Deus está no controle\nConduzindo a tua vida\nE você so tem que crer\nQuando Deus tá com você\nNão tem batalha perdida","language":"text/plain","encrypted":false,"added":1626960565},{"paste_id":5,"description":"Tá Chorando Por Quê? - Amanda Wanessa","body":"Tá chorando por quê?\nSe você tem um Deus\nQue cuida de você, oh, oh\nE jamais te esqueceu\n\nEle sabe de tudo\nQue você está passando\nE mandou te dizer\nQue Ele está cuidando\n\nLembra de onde você veio\nE aonde que você chegou\nLembra de todos os livramentos\nQue você já passou\n\nNem era para você estar aqui\nMas Deus falou assim\nEsse aí, vou levantar\nE onde colocar a mão, Eu vou abençoar\n\nNão chore\nQuem cuida de você não dorme\nLevanta\nTem muita gente que te ama\n\nDeus mandou te dizer, que vai acontecer\nDeus mandou te falar, que tudo vai passar\n\nLembra de onde você veio\nE aonde que você chegou\nLembra de todos os livramentos\nQue você já passou\n\nNem era para você estar aqui\nMas Deus falou assim\nEsse aí, vou levantar\nE onde colocar a mão, Eu vou abençoar\n\nNão chore\nQuem cuida de você não dorme\nLevanta\nTem muita gente que te ama\n\nDeus mandou te dizer, que vai acontecer\nDeus mandou te falar, que tudo vai passar\n\nNão chore\nQuem cuida de você não dorme\nLevanta\nTem muita gente que te ama\n\nDeus mandou te dizer, que vai acontecer\nDeus mandou te falar, que tudo vai passar\n\nDeus mandou te dizer, que vai acontecer\nDeus mandou te falar, que tudo vai passar","language":"text/plain","encrypted":false,"added":1626974568},{"paste_id":6,"description":"A ascensão de Alexandre, o Grande | Nerdologia","body":"FONTES\n\nAlexander the Great at War: His Army, His Battles, His Enemies, organizado por Ruth Sheppard: https://amzn.to/3frjbjU\nAlexander the Great: A Very Short Introduction, de Hugh Bowden: https://amzn.to/2WKHse9\nAlexandre, o Grande: Um homem e seu tempo, de Thomas R. Martin e Christopher W. Blackwell: https://amzn.to/3C7NrtL\n\nSAIBA MAIS\n\nA Ancient History Encyclopedia sempre tem muito material interessante: https://www.worldhistory.org/\nA editora Osprey, especializada em História militar, tem diversos livros sobre Alexandre, como The Wars of Alexander the Great: 336-323 BC: https://amzn.to/37gK9Gp\nBiografia ilustrada Alexandre o grande e sua sede de fama, de Phil Robins: https://amzn.to/2VantFx\nManual de História antiga do professor Norberto Luiz Guarinello: https://amzn.to/3CdYphe\nPodcast In Our Time sobre Alexandre: https://www.bbc.co.uk/programmes/b06d9bkx","language":"text/plain","encrypted":false,"added":1628133455},{"paste_id":7,"description":"A Biologia do Venom | Nerdologia","body":"Heil, Martin. \"Host manipulation by parasites: cases, patterns, and remaining doubts.\" Frontiers in Ecology and Evolution 4 (2016): 80.","language":"text/plain","encrypted":false,"added":1628202774},{"paste_id":8,"description":"Poderes de regeneração do Deadpool | Nerdologia","body":"- Brockes, Jeremy P., and Anoop Kumar. \"Appendage regeneration in adult vertebrates and implications for regenerative medicine.\" Science 310, no. 5756 (2005): 1919-1923.\n-Seifert, Ashley W., Stephen G. Kiama, Megan G. Seifert, Jacob R. Goheen, Todd M. Palmer, and Malcolm Maden. \"Skin shedding and tissue regeneration in African spiny mice (Acomys).\" Nature 489, no. 7417 (2012): 561-565.\n-Brockes, Jeremy P., and Anoop Kumar. \"Comparative aspects of animal regeneration.\" Annual review of cell and developmental biology 24 (2008): 525-549.","language":"text/plain","encrypted":false,"added":1628202841},{"paste_id":9,"description":"Porque a história do Thanos não faz sentido | Nerdologia","body":"DeWitte, Sharon N. \"Mortality risk and survival in the aftermath of the Medieval Black Death.\" PloS one 9, no. 5 (2014): e96513.","language":"text/plain","encrypted":false,"added":1628206571}],"comment":[]}