{
	"message": [
		{
			"body": "alors, que cache le gouv avec sa campaigne anti plantes de la création? pendant que les enfants se font traffiquer à des fins sexuelles, que la violence publique règne, les occupants se sont lancés dans une campaigne contre le marché des psychoactifs? Une excsuse pour renforcer l'état d'occupation? ",
			"date_added": 1615365842700
		},
		{
			"body": "11Puis Dieu dit: Que la terre produise de la verdure, de l'herbe portant de la semence, des arbres fruitiers donnant du fruit selon leur espèce et ayant en eux leur semence sur la terre. Et cela fut ainsi. 12La terre produisit de la verdure, de l'herbe portant de la semence selon son espèce, et des arbres donnant du fruit et ayant en eux leur semence selon leur espèce. Dieu vit que cela était bon.",
			"date_added": 1615365914800
		},
		{
			"body": "la prétendue laicité n'est elle pas sensé également protéger les libertés religieuses? Ou seulement servir d'arme pour asservir, afin d'obtenir une soumission totale aux diktats de l'état d'occupation?",
			"date_added": 1615366159900
		},
		{
			"body": "rdv à 18h tous les jours. hf c u soon.",
			"date_added": 1615366175100
		},
		{
			"body": "Un autre angle pour aborder la question, comme je ne crois absolument plus au concept de morale or d'éthique, est la notion de propriété privée. La propriété privée est un des fondements d'une économie de marché. En quoi un état peut-t'il s'arroger le droit de décider quelles plantes de la création est légale ou illégale? N'est-ce pas pour l'état de vouloir prendre la place de Dieu? ",
			"date_added": 1615367599000
		},
		{
			"body": "@knard zerotalk anglais, pour le reste c'est mort par la censure. Fais attention, aucun zsite avec des possibilités d'y mettre des images, sans t'en rendre compte tu peux te retrouver a seeder du contenu pedopornographique (voir insérer sur ton ordi par les pds). fais gaffe... on est en zone d'occupation #warfare",
			"date_added": 1615367693300
		},
		{
			"body": "Test - live 30 sec",
			"date_added": 1615395556100
		},
		{
			"body": "Enfin l'aspect le plus affligeant est la restruction à de la liberté d'expression. Comment peut-on être aussi inférieur inllectuellement pour imposer une censore sur un tel sujet. C'est de l'obscurantisme. ",
			"date_added": 1615395633200
		},
		{
			"body": "demain peu-être. a+",
			"date_added": 1615395711600
		},
		{
			"body": "Peut-être qu'au fond Eric Zermour a raison, en disant que la culture occidentale était basée sur l'abscence de contradiction? Qu'illustre-t'il mieux ce concept que la lutte acharnée contre des plantes de la création? A la fois violation d'un droit primitif de disposer de ces plantes du créateur, un irrespect absolu du doit de propriété et le tout construit sur une censure intolérable? bon au fond, ils doivent exploser. en avant, vous verrez les pensions cuts à la grècque, vous allez kiffer les anciens, je vous parle pas d'inflation que vous n'arriverez pas à combattre. non... regardez, ça va me faire rire :). have fun !",
			"date_added": 1615407060700
		},
		{
			"body": "GDP californie : 3.1 trillions vs france 2.7... on voit tout de suite les losers... la drogue, la drogue, la drogue... pffff... LOOOOOSSSSSSSSSSSSEEEEEEEEEEEEEEEERRRRRRRRRRRRSSSSSSSSSSSSSS !",
			"date_added": 1615476999100
		},
		{
			"body": "c u soon :) ca va etre epic fail... jusqu'au jour... ",
			"date_added": 1615477172000
		},
		{
			"body": "moi ce que je pense, c'est que la flicaille francaise elle a besoin de se prendre des bons de ak avec des xm1158... voila ! genre le truc qui blasten bien, et surtout des bonnes campagne familiales, genre ouverte de l estomac la pondeuse a la maison... oui oui monsieur, on collabore on meurt. c'est la loi. suffit d'arreter ces connards au \"parlement\", ils vont pas dans les cités, eux... ou pas longtemps... ",
			"date_added": 1615477350500
		},
		{
			"body": "et une carlotte d'ornllas tu lui eclates la tete jusque cela soit une bouille par terre, comme ca cette petite pute de merde elle fermera sa bouche de merde pour tjrs.",
			"date_added": 1615477433100
		},
		{
			"body": "cul",
			"date_added": 1615477444200
		},
		{
			"body": "ras",
			"date_added": 1615477446000
		},
		{
			"body": "quand ces putains de parents ils vont à ces funeraills, spray... avec les anciennes munitions qui servent à plus rien.",
			"date_added": 1615477492500
		},
		{
			"body": "et la les petits connards de vip, ils vont commencer a réflechir, parcqu'elle a pas le meme discours avec copains \"branchés\" de \"paris\".",
			"date_added": 1615477529700
		},
		{
			"body": "et si tu me dis que c'est violent ca c'est que t as pas encore recu du bon RPG sans \"triump ou je sais pas le nom\" et les petites equipes mobiles a coup de mortier, pas les feux d'artifices et le tout avec les bons IEDs... ouuuhhh ca c'est cool, pour safe and secure un petit access point... ou way point ou mieux exit point :).",
			"date_added": 1615477617300
		},
		{
			"body": "mais vous voulez la guerre... la guerre vous avez ! enjoy ! connards.",
			"date_added": 1615477649000
		},
		{
			"body": "parce qu'on va dire non a l onu ou ca non, un pays plus petit que la californie qui veut se meler des affaires du monde? c'est quoi cette blague! ",
			"date_added": 1615477687700
		},
		{
			"body": "et le petit coup t' as besoin de flicailles, regardes la violence mon petit mouton, connard, on sait que c'est en lieu avec le vaxx nazi / white genocide... mais oui mais oui... on est pas si con (pas comme vous). j'ecrirai bien ridcule lettre par lettre mais j'ai peur de faire une erreur , pas d edit pas de censure.",
			"date_added": 1615477765100
		},
		{
			"body": "et vous avez fait quoi les sales flics et co avec le vote de la constitution europeenne? ahh oui, les connards s'occupent que des petits cons qui vendent du shit de merde, mais les grosse trahision, la on reste au chaud... pourtant y a pas de ak, juste des nail guns :).",
			"date_added": 1615477850800
		},
		{
			"body": "et Jean-Luc Brunel,ils sont ou ces potes? alors? ca pete un peu la, ou on fait les petites bites? faudrait pas exposer des collègues, esprit de corps, hein, faut bien les completer les retraitres.... ah que j'adore la guerre, on peut tuer du flics, ils devraient le mettre au dod recruiting center, ca marcherait du tonnere !",
			"date_added": 1615478006600
		},
		{
			"body": "tu peux en faire de la poussiere et de la cendre... mettre des trous partout (une fois que le shuffling est autorisé, pas avant).",
			"date_added": 1615478041500
		},
		{
			"body": "hey hey !",
			"date_added": 1615482006900
		},
		{
			"body": "another try, another day !",
			"date_added": 1615482021800
		},
		{
			"body": "franchement je regrette qu'on ait pas plus de kill cams de mars 2003 en irak... hmmm... hmmm... rien n'est plus cool que de blaster une station de police... qu'elle soit en irak ou sur la lune, rien contre la police irakienne... rien du tout ! courage meme :)",
			"date_added": 1615482076500
		},
		{
			"body": "mais t'en que des gens comme charolotte d'ornellas voudras dire ce que je dois mettre dans mon corps OU PAS (comme des plantes de la création), j'espere pouvoir la tuer legalement un jour... j espere qu'elle sera maman, comme ca je la forcerai a manger ces enfants. et a les digerer... rappelles toi connasse... c'est la que tu as fait ton destin... je demandais juste a etre libre et de gerer et disposer de ma vie, comme je l'entends, et pas comme toi... ne m en veut pas, de toute maniere je m'enfou. comme une oie... ca va bien finir par renter... et pas moyen que ca sorte, si c'est le cas, nouvelle passe.",
			"date_added": 1615482229100
		},
		{
			"body": "et c'est pas de la haine, juste de l'amour pour la liberté.... peut etre, ou la guerre, va savoir !",
			"date_added": 1615482250400
		},
		{
			"body": "y aurait pas eut les pedos, comme j'en aurais rien a foutre... vous pouvez meme pas imaginer.",
			"date_added": 1615483272400
		},
		{
			"body": "LoL, j'ai bien rigolé avec le negros sur i24fr... hhahaha. quoi sale negre, je peux parler la langue de mes ancetres? tu crois que tu m'a colonisé autant? et bah t'as peut etre raison fils de pute ! mais...",
			"date_added": 1615526896800
		},
		{
			"body": "tu vas pour nous niker en israel. on te butera comme un chien. simplement. voila voila ! eretz, nothing else. et le jordianien, un jour, on va le fumer, pour garder et preserver la derniere mosquée sur terre... tu crois pas? tu verras... ",
			"date_added": 1615526947900
		},
		{
			"body": "tu pas nous niker en israel..",
			"date_added": 1615526956900
		},
		{
			"body": "c'est tout alors ces chiens de merde, ils peuvent chier ce qu'ils veulent, ca changera pas... ",
			"date_added": 1615526979400
		},
		{
			"body": "tu controles la langue ou pas? comment on dit negres dans le slang de tel aviv?",
			"date_added": 1615527003100
		},
		{
			"body": "fucking somalis?",
			"date_added": 1615527015700
		},
		{
			"body": "hahahah",
			"date_added": 1615527022100
		}
	]
}