{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1576584251,
			"title": "i'm feeling alone...",
			"body": "the clearweb don't understand me...maybe here is different?\n\nNowdays all people value you only by looking how many money you have, if your house/car is big and other stupid things like the brands of your clothes or the photos in your instagram profile. I can have all these things...but i hate the appearance (that deceives) and prefer to share my ideas or try to learning or research something new...the beauty of curiosity also without any direct gain! (i think that i'm like a child...that he marvels by looking at the stars)\nZeronet is the new web...where (maybe) the appearance and the identity is not more important than ideas... there is anyone here like me?",
			"added": 1576584250
		}
	],
	"topic_vote": {
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1577969769_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1
	},
	"next_comment_id": 26,
	"comment": {
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 1,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1318_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you sound like a religious\n\nno. i'm atheis. why you think i'm a religious?",
				"added": 1576587546
			},
			{
				"comment_id": 2,
				"body": "> [nerdy](#comment_1_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf): no. i'm atheis. why you think i'm a religious?\n\natheiest...and hate all churches",
				"added": 1576587663
			},
			{
				"comment_id": 3,
				"body": "> [randomshits](#comment_307_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): There are many christian organisations who go out into the world and do really good work for their community like feeding the hungry and ensuring those who are without decent cloths are given some. There are many who even have followers who donate money & items which are then given to the children of needy families so they don't feel left out for the holidays. [...]\n\ni respect all people that help others with their actions, also in the churches! (not only christian)  I don't respect who manage the churches at high levels (that parasite priests and all other people under them).\n\n...but maybe you're right: i must begin to heve more empathy...to understand the others. but how i can do it? i don't know why most people do nothing until you give money or reputation... why don't do a thing only for the pleasure to do that?  like the child that take pleasure looking the sky...and adult can look to the world and try to improve it with his free work",
				"added": 1576604076
			},
			{
				"comment_id": 4,
				"body": "> [randomshits](#comment_308_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): Then your anger should be focused at the Catholic Religion as a 'priest' is a title that is strictly used by the Catholic faith. Non Catholic but still christian churches have pastures & ministers, they don't identify as priests\n\nmany priest, pastures and ministers make good things...they are all respectful people (the same for muslim or any other religion). i hate who use religions to accumulate money or power. if religions are used for good thing for me is not a problem.\n\nAnyway this is off-topic; i write this post because i feel alone...and i'm searching someone that understand me and can give me an advice",
				"added": 1576609584
			},
			{
				"comment_id": 7,
				"body": "> [fke13](#comment_55_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz): Simple: attend a university or some study group. Don't hang around wrong people, go find the intellectuals. The universities do not need to be the expensive ones, there are actually good universities in the U.S., where the tuition fee is about 15k$/year or even less, it just takes a little while to find them. I have found some truly awesome lecture videos from pretty much unknown universities.  [...]\n\ni worked in various research groups in my university....but i left that life because of economic advantages of working in other environments and because i was not happy about researches was conducted (sponsor interferences, \"hazing\", etc...) anyway thanks! :)",
				"added": 1577001362
			},
			{
				"comment_id": 9,
				"body": "> [buizelxd](#comment_6_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v): may be true but it's more like a community here more connected\n\ni think that who manage the clearnet (facebook,. google, etc...)  filter who are different from masses because its concepts don't allow them to get money as nude pics, instagram semi-nude pics, paid content and stupid memes. Intellectuas actually exist in clearnet but are isolated! All this by using filter bubbles. For its nature zeronet can't allow filter bubbles to exist in its network!\n\nhttps://en.wikipedia.org/wiki/Filter_bubble",
				"added": 1577527791
			},
			{
				"comment_id": 10,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1415_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): There is no \"primeval purity\", it's all religious verbiage.\n\nProbably you in future (or now?) can't write your trolling comments on facebook, instagram, youtube etc... because of filter bubles managed by some puritan assholes that don't want trolls, racism, piracy, nude, etc... a day you will thank all us! ...for now i thank you to exist! ♥ :D",
				"added": 1577697518
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 5,
				"body": "> [reichardnixon](#comment_88_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr): well this was an easy mute. Bye!\n\nhow can i mute an user on zeronet?",
				"added": 1576706141
			},
			{
				"comment_id": 6,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1337_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): you can't you're stuck into hellUnicorn\n\n:D :D :D Love this network! It remembers me the old forums! :D :D :D",
				"added": 1576742367
			}
		],
		"1577009989_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 8,
				"body": "i should offend you...but maybe you will like this... :D",
				"added": 1577023547
			}
		],
		"1577569682_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1412_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): ARTIFICIAL INTELLIGENCE DOESN'T EXIST.  [...]\n\nI already told... \"I LOVE YOU!\" ♥ :D\n\nI worked with AI software in the past and i totally agree with h3! All AI approaces (from multiple regressions to deep neural networks) can be approximated to complex functions that CORRELATE input and outputs! For every imput i will give the more probable/frequent output observer by the software during its training...but this approach have some issues:\n\n-the training sample ALWAYS  represents the reality? Who decide how this sample is build? If i want that my system give a specific output for specific inputs i can manipulate it?\n\n-More frequent is ALWAYS RIGHT? The movie that all see necessary is my favourite? The web page that all see always represent what i think? If all told me to \"throw yourself into the well!\" i will do this? :D AI SEE THE WORLD  AND PEOPLE ONLY AS COVARIATES! (who set this covariates?) and NOT ALWAYS THE MOST FREQUENT OPINION IS THE \"RIGHT\" OPINION! Surely this view of the world is the best for Google Ads...if someone search often a certain thing i will show it in banners! -> IS MORE PROBABLE that the user buy it! :)\n\nThe human brain don't work only by using correlations and statistics! Also other factors are used to make a decisions and that factors cannot be managed by an actual machine! (emotions for example). And also an human must \"train\" for decades before make an average decision...with a range of different data that any machine can manipulate! \n\nAI for me can be a good help for decision-making or for \"intelligent\" searches on the web...but users should choose to use this algorithms or not and also choose how this software work, with the ability to set all variables as he want! Thid probably is tecnically possible on an open system like ZeroNet, but we should avoid to re-create the static and closed algorithms of the clearweb...or the filter bubbles will be behind us, ready to take our asses! :D",
				"added": 1577698662
			}
		],
		"1577571372_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 12,
				"body": "I already told... \"I LOVE YOU!\" ♥ :D\n\nI worked with AI software in the past and i totally agree with h3! All AI approaces (from multiple regressions to deep neural networks) can be approximated to complex functions that CORRELATE input and outputs! For every imput i will give the more probable/frequent output observer by the software during its training...but this approach have some issues:\n\n-the training sample ALWAYS represents the reality? Who decide how this sample is build? If i want that my system give a specific output for specific inputs i can manipulate it?\n\n-More frequent is ALWAYS RIGHT? The movie that all see necessary is my favourite? The web page that all see always represent what i think? If all told me to \"throw yourself into the well!\" i will do this? :D AI SEE THE WORLD AND PEOPLE ONLY AS COVARIATES! (who set this covariates?) and NOT ALWAYS THE MOST FREQUENT OPINION IS THE \"RIGHT\" OPINION! Surely this view of the world is the best for Google Ads...if someone search often a certain thing i will show it in banners! -> IS MORE PROBABLE that the user buy it! :)\n\nThe human brain don't work only by using correlations and statistics! Also other factors are used to make a decisions and that factors cannot be managed by an actual machine! (emotions for example). And also an human must \"train\" for decades before make an average decision...with a range of different data that any machine can manipulate!\n\nAI for me can be a good help for decision-making or for \"intelligent\" searches on the web...but users should choose to use this algorithms or not and also choose how this software work, with the ability to set all variables as he want! Thid probably is tecnically possible on an open system like ZeroNet, but we should avoid to re-create the static and closed algorithms of the clearweb...or the filter bubbles will be behind us, ready to take our asses! :D",
				"added": 1577698731
			},
			{
				"comment_id": 13,
				"body": "I already told... \"I LOVE YOU!\" ♥ :D\n\nI worked with AI software in the past and i totally agree with h3! All AI approaces (from multiple regressions to deep neural networks) can be approximated to complex functions that CORRELATE input and outputs! For every imput i will give the more probable/frequent output observer by the software during its training...but this approach have some issues:\n\n-the training sample ALWAYS represents the reality? Who decide how this sample is build? If i want that my system give a specific output for specific inputs i can manipulate it?\n\n-More frequent is ALWAYS RIGHT? The movie that all see necessary is my favourite? The web page that all see always represent what i think? If all told me to \"throw yourself into the well!\" i will do this? :D AI SEE THE WORLD AND PEOPLE ONLY AS COVARIATES! (who set this covariates?) and NOT ALWAYS THE MOST FREQUENT OPINION IS THE \"RIGHT\" OPINION! Surely this view of the world is the best for Google Ads...if someone search often a certain thing i will show it in banners! -> IS MORE PROBABLE that the user buy it! :)\n\nThe human brain don't work only by using correlations and statistics! Also other factors are used to make a decisions and that factors cannot be managed by an actual machine! (emotions for example). And also an human must \"train\" for decades before make an average decision...with a range of different data that any machine can manipulate!\n\nAI for me can be a good help for decision-making or for \"intelligent\" searches on the web...but users should choose to use this algorithms or not and also choose how this software work, with the ability to set all variables as he want! Thid probably is tecnically possible on an open system like ZeroNet, but we should avoid to re-create the static and closed algorithms of the clearweb...or the filter bubbles will be behind us, ready to take our asses! :D",
				"added": 1577698804
			}
		],
		"1577589368_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 14,
				"body": "Totally agree! It will be an interesting experiment! :)",
				"added": 1577698881
			}
		],
		"1577567502_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 15,
				"body": "For me the best solution is a system where anyone can decide in an open way the \"algorithm\" to use for content searches and moderation. In that way anyone can experiment the \"best\" option or change or point of view at any moment! (and avoid any filter bubbles) This is possible only in decentralized system like zeronet...because of this i lile this platform! :)",
				"added": 1577699191
			}
		],
		"1577633593_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 16,
				"body": "I like zeronet because people like you can write anything without the fear to be banned or censored!  :D\n\nThe western world are populated by \"alone\" people.... i talked about my situation in another topic, but i think that this concept are \"universal\": we all compete between us instead collaborate, all search for money and career instead for others....but we do this because we are forced! If you don't \"kill\" your colleague at work you will be sacked or you can't have a bigger salary because he will \"steal your work\", for the same reason anyone really teach anything to the students...that can \"steal\" my position! In that way society will not improve! Without cooperation we will sink in a dark hole without end!\n\nBut western society want this... alone people buy more to compensate loneliness! :(",
				"added": 1577699765
			}
		],
		"1577708242_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 17,
				"body": "you're too pessimist!\n\n\"I've been banned from every group I've been into (including family).\nNow I reign over all of them:\" \n\n\"As I said, I'll have my cocktail next to me, to see it all, and 'Enjoy The Show'.\"\n\n\"Today I exult \"seeing this\"...:\nfor 'I see all those who struggle wih their fantasy reality fall apart'.\nI see their universes crumble before them, and they're not ready. Are not ready 'BECAUSE HAVEN'T WORKED'.\n\nIt's a 'PLEASURE TO LOOK AT':\n\n    a True Jubilation.\"\n\n....maybe your pain is the cause of this sadism? you like this discussion?  i hope to don't become like you during my life...and because of this i will help you\n\n\"I am not 'in conflict with this world': I know that the human biological species cannot change,\nand is incapable of 'questioning' itself. And I have known 'this' for 'more than forty years'.\"\n\nlets deceive a younger person...i think that the world changed in better during the entire history long 4 Myears...if we want we can become better and better!\n\nJesus said,\n\"Those who seek should not stop seeking until they find. When they find, they will be disturbed. When they are disturbed, they will marvel,\nand WILL RULE OVER ALL.\" \n\nYou cite Jesus?! OH MY GOD! :D :D :D You don't hate christians? :D maybe you aren't what you're writing...\n\n\"And you still don't understand 'your destructive power'.\"\n\nZeronet could be very destructive...but i hope that good people are more powerfuls than bad ones. who will be right?",
				"added": 1577713955
			}
		],
		"1577728351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 18,
				"body": "try to censor anyone here (also bigotry) is an oxymoron...zeronet is better than clearnet because anyone can decide what share or not...a \"god\" that can decide above others (Aether style) is not the best option for me!",
				"added": 1577734037
			},
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_1538_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Most of us share the same enemies here.\n\nbut here you can decide different from others if you want ...YOU are the boss! :)",
				"added": 1577734193
			}
		],
		"1577733894_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 19,
				"body": "totally agree! Here there isn't filter bubbles or contentID that limit the artists! Maybe a streaming community created using webtorrent?",
				"added": 1577734125
			},
			{
				"comment_id": 21,
				"body": "> [draugrdeathlord](#comment_84_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): I was curious about streaming with webtorrent, is such a thing possible ?\n\nhttps://en.wikipedia.org/wiki/WebTorrent\n\nAlso BiglyBT have a streaming feature for video files and on zeronet some zites use streaming. Probably this feature will work well with a seedbox and non-HD files...anyway in my opinion is interesting",
				"added": 1577736717
			}
		],
		"1577824395_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 22,
				"body": "\"I don't want Generation Alphas to inherit a narcissistic, individualistic world in which your value is determined by Likes and Followers.\"\n\nDivide et Impera...people when not united don't fight against the system that stole their future...only if we stop fighting each others for a god job of for the last ipad we will save...\n\nFor Video Games: luckly some indie titles are very enjoyable and there are many modding communities that create and share new things (not material as 3d prints, but always creative things, that they don't cost as a 3d printer), but i'm sad to see that Steam destroyed the Open Source Gaming transforming all gaming in lucrative activities, also bad ones like F2P or DLC-filled games",
				"added": 1577882144
			}
		],
		"1577969769_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 23,
				"body": "i love you! :D",
				"added": 1578034946
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 24,
				"body": "I LOVE HIM... DON'T BAN! :D :D :D \n\n(the best feature of zeronet is that none can silence anyone! :D ...and with my upvote h3.. gain 11 likes! :D )",
				"added": 1578665872
			}
		],
		"1578831365_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 25,
				"body": "“I am Andrew Ryan, and I am here to ask you a question. Is a man not entitled to the sweat of his brow?\n\n    'No,' says the man in Washington, 'it belongs to the poor.'\n    'No,' says the man in the Vatican, 'it belongs to God.'\n    'No,' says the man in Moscow, 'it belongs to everyone.'\n\n    I rejected those answers. Instead, I chose something different. I chose the impossible. I chose…\n\n    Rapture.\n\n    A city where the artist would not fear the censor,\n    where the scientist would not be bound by petty morality,\n    where the great would not be constrained by the small.\n\n    And with the sweat of your brow, Rapture can become your city, as well.” \n    ― Andrew Ryan\n\n...Return to play h3!  :D",
				"added": 1578834580
			}
		]
	},
	"comment_vote": {
		"6_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": 1,
		"1415_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1412_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1608_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1
	}
}