{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "¿Qué es Bitcoiners? El ecosistema de noticias para el mercado de criptomonedas",
			"body": "**Bitcoiners** es un ecosistema de noticias para el mercado de criptomonedas, blockchain, proyectos en desarrollo y economía global. Bitcoiners establece un vínculo directo al estado de la noticia y el mercado financiero con una interacción social con bases en la educación financiera y las criptomonedas. Esta plataforma busca ser una inspiración e incentivo monetario para los creadores de contenido y empresas que tengan la necesidad de acercarse más a la comunidad de usuarios del mercado de criptomonedas. Bitcoiners como plataforma busca ser la primera en su estilo en la comunidad de habla hispana en el mercado de criptomonedas e inversores con la mayor integración de desarrollo en marcas, aplicaciones y noticias.\n\n---------------------------------------\n\nÉste ecosistema de noticias ha desplegado su propia criptomoneda, Bitcoiners (BNS), y tiene la facultad de ser un activo digital donde los medios informativos como blogs, revistas, videos o cualquier medio informativo que promueva el mercado financiero de criptomonedas, blockchain y noticias en general, puedan apoyarse en Bitcoiners como un medio digital descentralizado, privado y que respalde la libertad de expresión, esto según el concepto que cada quien tenga de la libertad. Con Bitcoiners el incentivo por la información se extiende a todos los medios de noticias en Internet e incluso fuera de ella, donde también se establece como un activo refugio para el mercado digital y financiero.\n\n---------------------------------------\n\n**¿Quieres saber más sobre nuestra plataforma?** Puedes visitar los enlaces oficiales de Bitcoiners donde podrás disfrutar de todos nuestros productos y servicios.\n\n---------------------------------------\n\n**PLATAFORMAS OFICIALES**\n\n* 1) [Revista](https://www.bitcoiners.news/)\n* 2) [Red social](https://red.bitcoiners.news/)\n* 3) [ICO](https://ico.bitcoiners.news/)\n\n---------------------------------------\n\n**REDES SOCIALES**\n\n* 1) [Twitter](https://twitter.com/bitcoinersnews)\n* 2) [Facebook](https://www.facebook.com/bitcoiners.news/)\n* 3) [Instagram](https://www.instagram.com/bitcoiners.news/)\n* 4) [Telegram](https://t.me/mitnickmarkets)\n* 5) [YouTube](https://www.youtube.com/c/Bitcoiners)\n* 6) [Discord](https://discord.gg/QzCaBXE)\n* 7) [Bitcointalk](https://bitcointalk.org/index.php?topic=2437975)\n* 8) [Podcast](https://mx.ivoox.com/es/podcast-bitcoiners_sq_f1481717_1.html)\n\n---------------------------------------\n\n**RECURSOS BITCOINERS**\n\n* 1) [GitHub](https://github.com/bitcoinersnews)\n\n---------------------------------------\n\n**Bitcoiners** es un proyecto diseñado para abordar los desafíos del mercado financiero, de criptomonedas y medios sociales mediante la combinación de los mejores aspectos del mercado digital en base a la noticia y la inclusión del gremio periodístico como un todo en el ecosistema Bitcoiners. La interacción con la comunidad presenta oportunidades de generar oportunidad de empleo a profesionales, estudiantes y potenciales creadores de contenido para los usuarios en Internet, buscando de esta forma que la noticia tenga un concepto más dominante como medio descentralizado, con libre expresión y que pueda proporcionar más confianza en los valores de la educación financiera.\n\n---------------------------------------\n\nDentro de Bitcoiners, los clientes obtienen recompensas en tiempo real de su comunidad y la aprobación de proyectos que puedan ser un estado potencial en la masificación del mercado de criptomonedas. Bitcoiners como plataforma de noticias quiere llegar a más personas en el mercado financiero e incluso lograr una mayor proyección de la plataforma con la revista Bitcoiners en otros idiomas en otros países, de esa manera las contribuciones tendrán un mayor impacto en el mercado y en la educación desde Internet.\n\n---------------------------------------\n\n*Que la tendencia alcista les acompañe*",
			"added": 1519087224
		},
		{
			"topic_id": 2,
			"title": "Criptomoneda Bitcoiners (BNS)",
			"body": "## CARACTERÍSTICAS DE BITCOINERS (BNS)\n\n|Información                          |Descripción                         |\n|-------------------------------|-----------------------------|\n|Criptomoneda            |Bitcoiners            |\n|Ticker            |BNS            |\n|Precio del token en ICO            |1 BNS = 0,1 USD            |\n|Total de tokens            |500.000.000 BNS            |\n|Algoritmo            |Bitcoiners            |\n|Tipo de ecosistema            |Prueba de participación (PoS)            |\n|Uso en las casas de cambio            |Disponible            |\n|Transacciones            |Privadas            |\n|Participación (PoS)            |10% anual            |\n|Tiempo de maduración            |8 horas            |\n\n---------------------------------------\n\n## MÁS ELEMENTOS DE LA CRIPTOMONEDA BITCOINERS (BNS)\n\n---------------------------------------\n\n* **500 millones:** La cantidad de unidades nunca podrá exceder los 500 millones de bitcoiners.\n* **Sin censura:** Nadie puede prohibir o censurar transacciones válidas.\n* **Código abierto:** El código fuente de Bitcoiners siempre debe ser accesible para todos.\n* **Sin permiso:** Nadie puede impedir la participación en la red.\n* **Pseudoanónimo:** No se requiere identificación para participar en la red Bitcoiners.\n* **Permutable:** Cada unidad es intercambiable.\n* **Pagos irreversibles:** Las transacciones confirmadas no pueden ser modificadas ni eliminadas. La historia es imborrable.\n* **Prueba de participación (PoS):** Bitcoiners (BNS) genera intereses anuales del 10%, incrementando el valor de la moneda en los usuarios y en el mercado.\n\n---------------------------------------\n\nPara reservar monedas **Bitcoiners** (BNS) puedes ingresar a la ICO en su versión web donde podrás utilizar la plataforma de pago **CoinPayments** para realizar la reserva.\n\n---------------------------------------\n\n* [ICO Bitcoiners](https://ico.bitcoiners.news)\n* [Whitepaper](https://ico.bitcoiners.news/bitcoiners-whitepaper-es.pdf)\n* [GitHub](https://github.com/bitcoinersnews)",
			"added": 1519087756
		}
	],
	"topic_vote": {
		"2_1GnVm4a2SUb17nCvszF9soRUPk1MPgN3Fy": 1,
		"1_1GnVm4a2SUb17nCvszF9soRUPk1MPgN3Fy": 1
	},
	"next_comment_id": 2,
	"comment": {
		"2_1GnVm4a2SUb17nCvszF9soRUPk1MPgN3Fy": [
			{
				"comment_id": 1,
				"body": "La criptomoneda Bitcoiners (BNS) podría implementarse en los foros de ZeroNet como incentivo de pago a los contribuyentes. Pronto vamos a salir a exchange al finalizar la ICO el 28 de febrero. Si tienen ideas con gusto pueden dejar sus comentarios.",
				"added": 1519087917
			}
		]
	},
	"comment_vote": {}
}