{"cert_user_id": "AFlowOfCode@github", "next_topic_id": 2, "topic": [{"topic_id": 1604065355, "title": "Feature request: Prompt to seed or not seed site upon view", "body": "I think it would be useful to be prompted whether or not you want to seed the site when you visit it, rather than automatically seeding everything you come across. \n\nAfter spending some time browsing there are a lot of dead / default sites etc that I don't want to seed at the moment. Then I must go through a rather lengthy process of selecting delete then moving to top right of screen to confirm delete for each one.\n\nThis would be solved by simply asking if a user wants to seed the site they are currently visiting.\n", "parent_topic_uri": "1604062980_users_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di", "added": 1465583389, "modified": 1496314354, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/492", "source_type": "github"}], "next_comment_id": 4, "comment": {"1604065355_mirrored_AFlowOfCode_github": [{"comment_id": 1, "body": "I understand where you're coming from, but the analysis and response to my request is a little misguided, and attitude more than a little preachy. If I wasn't interested in the concept of a distributed web, why would I even be using Zeronet? There's certainly nothing there that couldn't be leached from the regular web!\n\nThe comparison to torrents is null. Does anybody seed all the torrents that they come across? I'm assuming you constantly seed 1000s of torrents you aren't interested in simply because they're out there, including ones that actually have no legitimate content... of course you do, right? Give me a break.\n\nThe fact is that people are going to choose what they want to seed and what they don't. Making it easier for users to make that decision is not going against the philosophy of the distributed web. If distributed web is going to scale beyond the minuscule state it currently is in, not every user is going to want to seed the whole thing, nor every single page they visit. Perhaps it's doable now, but if there ever is enough content to in any way compare to the regular web, it's not going to be practical or realistic.\n\nI think your suggestion about preferences is good. Maybe it is better to have seeding on by default, but also have the ability to set an option enabling you to be prompted about seeding each new site you visit. Note I didn't say simply \"turn off seeding by default\". I want the option to be presented. Maybe the prompt should be done when you navigate away from a site, or close a tab. Or maybe it just won't work--I'm open to hear thoughts, arguments, ideas.. in discussion form, preferably from people in a calm state of mind who aren't trying to shoot ideas down from their ivory tower. \n", "added": 1465669616, "modified": 1465669616, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/492#issuecomment-225395432", "source_type": "github"}, {"comment_id": 2, "body": "I'd also like to point out there currently exists a global \"Size Limit\" option, so it is already assumed people will be selectively seeding which sites they want. If it could be implemented well, there is merit in making it easier to make this selection rather than retroactively deleting in order to choose. \n\nIf somebody wants to browse content without seeding, as far as I can tell there's nothing stopping them from setting the limit to 1mb. This renders blustery displays of philosophical force against enhanced options irrelevant.\n\nI could see something like switching on the preference to be prompted, and then a little button appears near the zero button that simply says \"seed?\" (or suitable icon) & upon clicking it shows a green check mark and then vanishes.\n", "added": 1465671400, "modified": 1465671400, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/492#issuecomment-225396701", "source_type": "github"}, {"comment_id": 3, "body": "\"Don't seed any sites I visit\" already exists, via the Size Limit option. I am merely suggesting an additional way of choosing--the concept relates to user experience. It's definitely minor and low priority but would be more relevant in a scaled network. And lets hope that the network does scale! \n\nI'm just putting the idea here for the record--I trust the project contributors to make their own decisions about what's worth doing and what's not and I'm not personally attached to whether they implement it or not. It's just an idea. Yours are interesting and deserve their own dedicated threads, if you haven't made them already. \n", "added": 1465698451, "modified": 1465698451, "source_link": "https://github.com/HelloZeroNet/ZeroNet/issues/492#issuecomment-225411027", "source_type": "github"}]}}