{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Comunidad libertaria en español",
			"body": "Aquì podràs encontrar libertarios y anarquistas unidos bajo las oscuras fosas de la darknet:\n\n                                    Libertarios.onion\nhttp://127.0.0.1:43110/1Q6A6kU9ANraKESRKyrPXAuDvQrwfSYPh9/",
			"added": 1635431400
		}
	],
	"topic_vote": {
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1_1AjU4hpCEwmv9H6yMN167Spjqt35yrsqAb": [
			{
				"comment_id": 1,
				"body": "Pues golpealo xd",
				"added": 1635291218
			}
		],
		"1_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 2,
				"body": "Bueno como tal como tal, no. No he encontrado aquì tal cosa, pero podrìas ir a 0porn y buscar la categorìa de \"impopular\". Ahì vi deepfakes de niños. Me da asco, aunque como es lo que buscas pues bueno, ahì tienes mi grano de arena.",
				"added": 1635291356
			},
			{
				"comment_id": 7,
				"body": "Y bueno y no sè xd, no me gustan ese tipo de cosas, \npero en zerotalk en inglès vi que alguien hacìa spam de\nello y copìe el mensaje porque a alguien podrìa interezarle, \nno descarto que pueda ser una trampa del fbi probablemente. Pero ellos \nadjuntan especificaciones para entrar en el sitio mediante tor. \n(adjunto los links y el mensaje en el siguiente post).",
				"added": 1635294289
			},
			{
				"comment_id": 8,
				"body": "> [vivitrap17](#comment_7_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): Y bueno y no sè xd, no me gustan ese tipo de cosas,pero en zerotalk en inglès vi que alguien hacìa spam deello y copìe el mensaje porque a alguien podrìa interezarle,no descarto que pueda ser una trampa del fbi probablemente. Pero ellosadjuntan especificaciones para entrar en el sitio mediante tor.(adjunto los links y el mensaje en el siguiente post).\n\nTHE ZONA IN ZERONET We are in tor too.. for child lover.. free child porn site and in zeronet we bould a database of cp!.. you need to use like whonix to fallowo their guide to install zeronet inside to seed a site or access.. protect your\nip over tor .. zeronet over tor !! .. in our topic link of the zona.. we share some guide!\n\nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/guides1.html",
				"added": 1635294330
			},
			{
				"comment_id": 9,
				"body": "> [vivitrap17](#comment_8_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): THE ZONA IN ZERONET We are in tor too.. for child lover.. free child porn site and in zeronet we bould a database of cp!.. you need to use like whonix to fallowo their guide to install zeronet inside to seed a site or access.. protect yourip over tor .. zeronet over tor !! .. in our topic link of the zona.. we share some guide!\n> http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/guides1.html\n\nAquì te dejo el link que usè para descargar whonix \n(me lo descarguè no para ver esas mierdas, que asco xd. \nSino porque Edward snowden dijo que era bueno usarlo \npara la privacidad, pero que deberìa ser usado dentro \nde linux para màs seguridad(como ubuntu que es gratis):\n\nhttps://yewtu.be/watch?v=7yY3joWs3rg\nhttps://yewtu.be/watch?v=wKBprBism0I",
				"added": 1635294401
			},
			{
				"comment_id": 11,
				"body": "> [vivitrap17](#comment_9_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): Aquì te dejo el link que usè para descargar whonix(me lo descarguè no para ver esas mierdas, que asco xd.Sino porque Edward snowden dijo que era bueno usarlopara la privacidad, pero que deberìa ser usado dentrode linux para màs seguridad(como ubuntu que es gratis):\n> https://yewtu.be/watch?v=7yY3joWs3rghttps://yewtu.be/watch?v=wKBprBism0I\n\nAquì tienes el link para descargar ubuntu gratis(es el sitio oficial asì que no viene con virus):\n\nhttps://ubuntu.com/download/desktop\n\nAquì tiene un video de como instalar ubuntu si es que tienes una computadora con windows ya instalado:\n\nhttps://yewtu.be/watch?v=6-rUBlTj0yI\n\nEn la particiòn cerciorate que si vas a intalar completamente un solo sistema operativo, tengas en cuenta que se elimina windows, aunque claro, puedes tener windows y ubuntu(linux) en el mismo sistema, peros si tu pc no es lo suficientemente potente puede que te vaya lento. En mi caso usè una computadora distinta para ambos sistemas. en una tengo windows y en la otra linux.\n\nPara instalarlo necesitaràs hacer una particiòn, que es como separar un poco del almacenamiento usado en el sistema operativo windows, para poder instalar ubuntu. No te preocupes por la cantidad que le dès, cuando reinicies el pc luego de la instalaciòn tendràs la opciòn de eliminar todo el almacenamiento ocupado por windows para asignarlo a ubuntu. PERO NO DESPUES DE INSTALAR COMPLETAMENTE UBUNTU. Ya que si no asignaste todo el almacenamiento para ubuntu y dejaste una parte sin ocupar, no podràs asignarla a ubuntu teniendo ubuntu ya instalado y tendràs que volver a instalar ubuntu, pero esta vez desde ubuntu no desde windows, que es aùn màs dificil que hacerlo desde windows xd.\n\ny Aquì te dejo un link para cuando ya tengas instalado ubuntu.\n\nUbuntu sigue recopilando informaciòn, pero se puede desactivar(se llama telemetria). Hace unos años se descubriò que vendìa esa informaciòn a amazon. cuando ya tengas instalado ubuntu recuerda meterte a opciones y desactivar todas las opciones que violan tu privacidad. Oh y cuando estès recien iniciando el sistema te pedirà poner una ubicaciòn, obviamente pon la que no es tuya, como por ejemplo turkia, alemania o japòn.\n\nhttps://yewtu.be/watch?v=Jgbc6FIF78U",
				"added": 1635294485
			}
		],
		"1_143N4eNqa9axJbroSdZfz8RLtPkJeS2HcE": [
			{
				"comment_id": 3,
				"body": "Y bueno y no sè xd, no me gustan ese tipo de cosas, pero en zerotalk en inglès vi que alguien hacìa spam de ello y copìe el mensaje porque a alguien podrìa interezarle, no descarto que pueda ser una trampa del fbi probablemente. Pero ellos adjuntan especificaciones para entrar en el sitio mediante tor. (adjunto los links y el mensaje en el siguiente post).",
				"added": 1635291518
			},
			{
				"comment_id": 4,
				"body": "> [vivitrap17](#comment_3_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): Y bueno y no sè xd, no me gustan ese tipo de cosas, pero en zerotalk en inglès vi que alguien hacìa spam de ello y copìe el mensaje porque a alguien podrìa interezarle, no descarto que pueda ser una trampa del fbi probablemente. Pero ellos adjuntan especificaciones para entrar en el sitio mediante tor. (adjunto los links y el mensaje en el siguiente post).\n\nTHE ZONA IN ZERONET We are in tor too.. for child lover.. free child porn site and in zeronet we bould a database\nof cp!.. you need to use like whonix to fallowo their guide to install zeronet inside to seed a site or access.. protect your ip over tor .. zeronet over tor !! .. in our topic link of the zona.. we share some guide!\n\nhttp://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/guides1.html",
				"added": 1635291579
			},
			{
				"comment_id": 5,
				"body": "> [vivitrap17](#comment_4_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): THE ZONA IN ZERONET We are in tor too.. for child lover.. free child porn site and in zeronet we bould a databaseof cp!.. you need to use like whonix to fallowo their guide to install zeronet inside to seed a site or access.. protect your ip over tor .. zeronet over tor !! .. in our topic link of the zona.. we share some guide!\n> http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/guides1.html\n\nAquì te dejo el link que usè para descargar whonix (me lo descarguè no para ver esas mierdas, que asco xd. Sino porque Edward snowden dijo que era bueno usarlo para la privacidad, pero que deberìa ser usado dentro de linux para màs seguridad(como ubuntu que es gratis):\n\nhttps://yewtu.be/watch?v=7yY3joWs3rg\nhttps://yewtu.be/watch?v=wKBprBism0I",
				"added": 1635292258
			},
			{
				"comment_id": 6,
				"body": "> [vivitrap17](#comment_5_1EG6GFgfm34d2nJPZZq64xuUvAMcPR5VUc): Aquì te dejo el link que usè para descargar whonix (me lo descarguè no para ver esas mierdas, que asco xd. Sino porque Edward snowden dijo que era bueno usarlo para la privacidad, pero que deberìa ser usado dentro de linux para màs seguridad(como ubuntu que es gratis):\n> https://yewtu.be/watch?v=7yY3joWs3rghttps://yewtu.be/watch?v=wKBprBism0I\n\nAquì tienes el link para descargar ubuntu gratis(es el sitio oficial asì que no viene con virus):\n\nhttps://ubuntu.com/download/desktop\n\nAquì tiene un video de como instalar ubuntu si es que tienes una computadora con windows ya instalado:\n\nhttps://yewtu.be/watch?v=6-rUBlTj0yI\n\nEn la particiòn cerciorate que si vas a intalar completamente un solo sistema operativo, tengas en cuenta que se elimina windows, aunque claro, puedes tener windows y ubuntu(linux) en el mismo sistema, peros si tu pc no es lo suficientemente potente puede que te vaya lento. En mi caso usè una computadora distinta para ambos sistemas. en una tengo windows y en la otra linux.\n\nPara instalarlo necesitaràs hacer una particiòn, que es como separar un poco del almacenamiento usado en el sistema operativo windows, para poder  instalar ubuntu. No te preocupes por la cantidad que le dès, cuando reinicies el pc luego de la instalaciòn tendràs la opciòn de eliminar todo el almacenamiento ocupado por windows para asignarlo a ubuntu. PERO NO DESPUES DE INSTALAR COMPLETAMENTE UBUNTU. Ya que si no asignaste todo el almacenamiento para ubuntu y dejaste una parte sin ocupar, no podràs asignarla a ubuntu teniendo ubuntu ya instalado y tendràs que volver a instalar ubuntu, pero esta vez desde ubuntu no desde windows, que es aùn màs dificil que hacerlo desde windows xd.\n\ny Aquì te dejo un link para cuando ya tengas instalado ubuntu.\n\nUbuntu sigue recopilando informaciòn, pero se puede desactivar(se llama telemetria). Hace unos años se descubriò que vendìa esa informaciòn a amazon. cuando ya tengas instalado ubuntu recuerda meterte a opciones y desactivar todas las opciones que violan tu privacidad. Oh y cuando estès recien iniciando el sistema te pedirà poner una ubicaciòn, obviamente pon la que no es tuya, como por ejemplo turkia, alemania o japòn.\n\nhttps://yewtu.be/watch?v=Jgbc6FIF78U.",
				"added": 1635293879
			}
		],
		"1_12uS7AbHMQEc4YKxoPpASsmDSy6fRtEhrw": [
			{
				"comment_id": 12,
				"body": "> [miguelarcangel](#comment_1_1GnBi3rZt2uhSFeqfy56AHBNicno2Ymao6): Hola que tal a todos , acabo de llegar or aquí, estoy curioseando un poco en ZeroNet pues llevo bastante tiempo sin conectarme , espero conocer gente operativa , en fin un saludo a todos\n\nYo soy alguien operativo, he estado subiendo comics porno en español dentro de 0porn una linea de 0chan. Aquì tienes los 3 links, el del comic, el del 0porn y el de 0chan respectivamente:\n\nhttp://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc/?/hen/thread/008598426851317b77c6fe6fbb5366ea/6fbb5366ea\n\nhttp://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc/\n\nhttp://127.0.0.1:43110/1NZNtZQZHQRJXafvJpmY5jgqwRaCEZMsUc/?/hen/",
				"added": 1635294855
			},
			{
				"comment_id": 13,
				"body": "> [thewhitelion](#comment_1_1BB1hdi575Fmj7yDAVxTBv1myPSeYraq1g): ZeroNet es una red de internet descentralizada, donde los usuarios se conectan a través del protocolo p2p. Está desarrollada en python y su licencia se acoge al modelo de software libre. Su semilla inicial está situada en Budapest, Hungría.\n> Link:https://wikipedia.org/wiki/ZeroNet\n\nBasado B), serìa bueno que hicieras  un sitio explicando esto en forma de posts.",
				"added": 1635294904
			},
			{
				"comment_id": 14,
				"body": "> [0zerocool](#comment_1_1LE2njrjGa79MspGNE6onbiYnsziLf64PH): Hola que es zero y cual es su rol?\n\nZeroNet es una red descentralizada similar a la web de usuarios peer-to-peer, creada por Tamas Kocsis en 2015. La programación de la red tiene su sede en Budapest, Hungría; está construido en Python; y es completamente de código abierto. [2] En lugar de tener una dirección IP, los sitios se identifican mediante una clave pública (específicamente una dirección bitcoin). La clave privada permite al propietario de un sitio firmar y publicar cambios, que se propagan a través de la red. Se puede acceder a los sitios a través de un navegador web normal cuando se utiliza la aplicación ZeroNet, que actúa como un servidor web local para dichas páginas. [2] Además de usar criptografía bitcoin, ZeroNet usa rastreadores de la red BitTorrent [3] para negociar conexiones entre pares. [2] ZeroNet no es anónimo de forma predeterminada, pero admite el enrutamiento del tráfico a través de la red Tor. [4]\n\nEl sitio web de ZeroNet y el rastreador de bittorrent están bloqueados en China continental. [5] Sin embargo, a pesar de la censura, todavía es posible acceder a ZeroNet desde detrás del Gran Cortafuegos de China, incluso a través de Tor, arrancando Meek y conectándose directamente con sus pares.\n\nLa viabilidad de los sitios web en línea de igual a igual se había planteado como hipótesis durante algún tiempo, y The Pirate Bay sugirió que construirían una red, así como BitTorrent Inc., que creó el Proyecto Maelstrom de código cerrado. [2] Otra aplicación, Beaker Browser, utiliza el protocolo de archivos P2P DAT para permitir la creación, el alojamiento y el servicio de sitios web sin necesidad de un servidor. [6]\n\nA partir de 2016, no había forma de eliminar una página de ZeroNet que todavía tenía sembradoras, [2] por lo que estas páginas eran inmunes a los métodos de terceros para eliminarlas, incluidos los avisos de eliminación de DMCA. [7] De forma predeterminada, los sitios tienen un límite de tamaño de 10 megabytes, pero los usuarios pueden otorgar permiso a un sitio para utilizar más espacio de almacenamiento si lo desean.\n\nEl desarrollo se ha detenido. [8]",
				"added": 1635295159
			},
			{
				"comment_id": 15,
				"body": "> [kilder](#comment_1_1FQanm3smFBzY1CQ4WV82eyfqemfsESBoS): hola saludos Ecosistema P2P de Utopia - Utopia P2P Ecosystem\n\nNo entiendo que es utopia p2p ecosystem, podrìas explicarme? , encontrè un video en ruso al respecto diciendo en forma de pregunta ¿es una estafa?. Pero me diò fatiga traducirlo AAAAAAA.\n\nAquì te adjunto el vìdeo, si quieres ser mi amigo busca @vivi_trap17 en instagram, dile que vienes de la deep web y quieres hablar con el momos. (que soy yo xd)\n\nhttps://yewtu.be/watch?v=-h8Kt58t7io",
				"added": 1635295544
			},
			{
				"comment_id": 16,
				"body": "> [valencia38](#comment_1_12TBAgAmCoLeaH1xfgE3MJgoa9riJ8pA7C): hola que tal?\n\nTodo bien y vos? xdxdxd",
				"added": 1635295765
			},
			{
				"comment_id": 17,
				"body": "> [cartunss](#comment_4_1AjU4hpCEwmv9H6yMN167Spjqt35yrsqAb): hola es un placer , formar parte de esta web . Os pido ayuda .\n\nQue tipo de ayuda necesitas?, si necesitas orientarte dentro de los sitios te recomiendo usar zerosites, un anexo de sitios disponibles divididos por categoria.\n\nhttp://127.0.0.1:43110/Sites.ZeroNetwork.bit/",
				"added": 1635296753
			},
			{
				"comment_id": 18,
				"body": "> [albina](#comment_1_1KNu7f1Nn6eDV5RKyXXqF27FLc3L8kTE2r): hola a todos!algien ha \"hecho\" PCR negativo\n\nno xd",
				"added": 1635297542
			},
			{
				"comment_id": 19,
				"body": "> [cl4ud10](#comment_5_17KBErLZFLA8ktw9qqoCZvA4Xy8RNfPB5j): Tómese un jarabe !!\n\nXd porque dijo tosa",
				"added": 1635297841
			},
			{
				"comment_id": 20,
				"body": "> [jovenlobo](#comment_1_1PwVbk1HfNwaqSfMynofezsVnj9XxD6fi5): Hola a todos y a todas! Quería saber si hay usuarios de Zero Play que me puedan confirmar si el sitio está actualizando. La última actualización que me aparece es del 25 de noviembre de 2020 y hace tiempo no aparecen nuevas películas.\n\nBuenardo me voy a meter xd",
				"added": 1635298039
			},
			{
				"comment_id": 21,
				"body": "Comunidad libertaria en español\n\nAquì podràs encontrar libertarios y anarquistas unidos bajo las oscuras fosas de la darknet:\n\n                                    Libertarios.onion\nhttp://127.0.0.1:43110/1Q6A6kU9ANraKESRKyrPXAuDvQrwfSYPh9/",
				"added": 1635431704
			}
		],
		"1_1B1ZDVuFGG2UNTpmkz44Cs2Vk9QdNe4qcA": [
			{
				"comment_id": 22,
				"body": "> [kitsunekashikoi](#comment_10_1Lcgu7HLmgq6xgUkbjVCaTvmW9xZhvhw8b): A) Tu propuesta carece de sentido por que las personas que ingresan a ZeroNet saben de antemano que pueden encontrar mas de una cosa desagradable.\n> B) Ademas la censura existe pero de manera democrática al ser conexiones sin nodos centrales las paginas con mayores usuarios son destacadas, mientras que las que tienen menos pueden ser rastreadas y eliminadas por las agencias de inteligencia\n> C) Ademas los países con mayor presencia en la globalización hacen responsable a los usuarios por el contenido que suben a la red.\n> Cuando tu entras a un sitio web en zeronet automáticamente lo compartes y por ese motivo vas a tener que declarar ante la justicia\n> depende de la regulación de tu país si poseer de contenido ilegal te condena o solo el comercio y el abuso infantil directo.\n> Prefiero la segunda por que si tuviera enemigos políticos podrían craquear la computadora  para inculparme y así deteriorar la democracia de un territorio\n> Espero criticas constructivas al respecto, gracias por su atención y lamento no haber sido mas directo\n\nB) que comentario más genial y especifico acabas de poner, no he encontrado mucha información de como funciona zeronet pero me gustaría si es que puedes, hacer un video o un post al respecto, ya que entuyo que eres un intendido en el tema",
				"added": 1637619499
			}
		],
		"2_1L3gLHdxExJ1LT3z6PKLuzsynvf81oF5z4": [
			{
				"comment_id": 23,
				"body": "Gracias por este post",
				"added": 1637619621
			}
		]
	},
	"comment_vote": {
		"1_1BB1hdi575Fmj7yDAVxTBv1myPSeYraq1g": 1,
		"1_1LE2njrjGa79MspGNE6onbiYnsziLf64PH": 1,
		"1_1FQanm3smFBzY1CQ4WV82eyfqemfsESBoS": 1
	}
}