{
	"posts": [
		{
			"id": "07bc4a88-a1e3-4337-85dd-7cf86b1c6838",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": "Is it possible to access the older self-signed threads in any way?",
			"time": 1573364542680,
			"files": "[]"
		},
		{
			"id": "39a0bcee-1b6f-4c39-bba3-c5c407653afd",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "fb46f435-c49f-4b1b-9c4f-e5c49be71e6a",
			"body": ">>46262ba4-c218-48e1-95b1-110387dd2c3e\n>  less attack surface than Tor browsing.\nLager.  Tor Browser (or firefox) still exposed and lots of options for de-anonymizing attacks.  On top of that, the attack surface of zeronet itself which can leak your clearnet IP and what content you're seeding if it's compromised.\n\n> We also need to get the EFF more sharply focused on the 4th amendment. It should be damn near impossible to enter homes, and judges should grant perhaps 3ea warrants per year. That would lift the threat of wingnut content being used as an excuse for seizing hardware.\nI say let's take anti-free-speech to it's logical end.  Shut down the shithole site that let someone livestream a mass shooting.  Some nobody site I think, just rebranded to FACEBOOK now.\nAny site that gives prestige status to terrorists needs to be wiped out, which of course means bye twitter.\n>> 1086\nThe big risks to be aware of in zeronet are things like identity correlation: your node has a tor endpoint but you publish your own content until it gets mirrored.  In a system like freenet you never host your own content, it's always distributed to the global filesystem.  I haven't gone deep enough on zeronet for a practical attack but assume that everything you do in zeronet can be grouped together - even if you create alternate identities it's probably trivially to match them technically, on top of the chance that you make a mistake and post under the wrong one.",
			"time": 1573511303191,
			"files": "[]",
			"last_edited": 1573511689191,
			"subject": null,
			"capcode": null
		},
		{
			"id": "483d3f37-bf28-4179-9a01-d5b3d2526d78",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>adb355f9-e0e8-481d-a74a-63bc20bc6766\nself-signed identities are just that, ones that you create yourself and post with.  People were starting to spam with them which is why they're not allowed anymore.\n\n>>c70243c4-407a-44f8-abd2-448148d62f81\nyou pushed an update?  The lower-postcount boards are still empty for me and when I update it says Updated!\n\nE: And I did it again and posts appeared this time.  Thanks!\n\nSince I'm here - is there a way to see posts/boards by a particular user?  I can go into the datafiles and read their json directly but I was looking for a way to do it inline.",
			"time": 1573511960991,
			"files": "[]",
			"last_edited": 1573512163691,
			"subject": null,
			"capcode": null
		},
		{
			"id": "19b29d61-9fac-4243-ace9-30654b96878d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c13a92f0-34e5-4a30-83c9-b9d89b593ee6",
			"body": ">>903fdc9a-e45d-49d3-a47f-62b90635e80c\nNo, not really.\n\nThe problem is that you can solve any problem by throwing more hardware at it, so it takes days for a mobile user to be registered to post while a jackass can use a stolen card to spinup a bunch of amazon GPU instances and make tens of thousands of spam identities in an hour.\n\nProof of work has been conclusively demonstrated to be steaming garbage by the various coins.",
			"time": 1573588805893,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}