{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1576507403,
			"title": "You still need the Internet to acess the 0net",
			"body": "With data connection, internet Ap, wifi, vpn, whatever you call it.\n\nStill need internet to go to 0net. Still waiting for a mesh network.\n\nIt just provides a layer of Privacy or Anonymity but sacrifices alot of functions. \n\nInternet is pretty much like Mcdonalds offering you FAST CHEAP TASTY food, but guess what, It is UNHEALTHY. \n\nSo some guys decide, hey you know what, we will open a public kitchen where anyone can come in and COOK BY THEMSELVES  and enjoy there own meal. Well, turns most of us, we dont know jack shit about cooking, and end up having a food fight. \n\nFor those few selected who actually do know how to cook a meal, well they enjoy. Thats it. Fewer of those decide to share that meal for free. Other few start teaching how to cook.\n\nObviously all this is done on a good motive and solve real world problems. We need people to start using these tools and  solve problems. Risks always involved.\n\nI'm done ranting. Roast me.",
			"added": 1576507402,
			"type": "group"
		},
		{
			"topic_id": 1577196707,
			"title": "Anyone from India?",
			"body": "Let us know if you can access this place?",
			"added": 1577196705
		}
	],
	"topic_vote": {
		"1576415295_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1576442383_1PDryjn9XzJ6pR6M98ST8EvdYheXV8gAQS": [
			{
				"comment_id": 1,
				"body": "Oh yes I'm in.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n/s",
				"added": 1576506370
			}
		],
		"1576768836_1Tr8KpfPw9HXit4dC5U6Eiu3nV5pd5Cnf": [
			{
				"comment_id": 2,
				"body": "Yeah we all have slow days, whatever. Not much to do.\n\nSummoned up on 0net few days back. Nothing much going here other that pron and chiold pron.\n\nSee you around.",
				"added": 1576843188
			}
		],
		"1577196707_12yk6fSLY85rKGkemD5wSDAiNvcXG9pqHe": [
			{
				"comment_id": 3,
				"body": "> [speedbroken](#comment_2_1B5o3toxJWGnTZLHCXf6cfvaFeeC1WLqMh): Chinese here; just curious how censorship is in India...I don't seem to have ZeroNet peers in India though.\n\nNot much is censored in India. I'm talking about main stream india... not sure about certain conflict areas like kashmir and assam.\n\nHowever, due to current protests, government have reduced the access to Internet. Not sure if it is censored or not.\n\nAlso pubg mobile is illegal to play in a certain state. Yes illegal.",
				"added": 1577198382
			}
		]
	},
	"comment_vote": {}
}