{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 34,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "niggers tongue my anus",
				"added": 1610230281
			}
		],
		"1610154957_1HesgY39DUQrf3M1WCn6q66f69VRRJc57E": [
			{
				"comment_id": 2,
				"body": "> [bimmyql](#comment_9_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): This place is cool and surprisingly active for what it is. Is ZeroTalk the most active discussion forum on ZeroNet?\n\n0chan was pretty active last night, fewer posts today but still posts nonetheless. Pretty impressive for an 8chan refugee site that hasn't been used since 2018",
				"added": 1610230384
			},
			{
				"comment_id": 5,
				"body": "> [savuth](#comment_7_1BkXMCkwtTN6xTcZEEfMRPhvHJHaeUPH7E): So, are we going to make a 4chan website on zeronet?\n\nalready exists http://127.0.0.1:43110/0chan.bit/",
				"added": 1610234250
			},
			{
				"comment_id": 11,
				"body": "> [bimmyql](#comment_34_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): Do you not see how coming here to say NIGGER NIGGER NIGGER is helping your enemies? I'm just curious about how stupid you people actually are.\n\noh noes are they gonna send it to vice news and call us nazis?!?!?!?! what will we ever do?!?!?!?!??!?!?!!?!?",
				"added": 1610355307
			},
			{
				"comment_id": 12,
				"body": "> [bimmyql](#comment_35_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): They'll associate the decentralized internet movement with your shitposting, and ruin it for the rest of us. Since you idiots aren't the ones who understand the technology or maintain it, eventually you'll get unplugged too when we give up on your lost cause. So, maybe shut the fuck up for once in your life? idk. [...]\n\nyou people say this as if corporate media won't try to make any kind of alternative technology look bad to the public period. Yeah dude we gotta have good optics on a p2p platform where people share child porn, blow it out your ass",
				"added": 1610359111
			},
			{
				"comment_id": 15,
				"body": "> [bimmyql](#comment_36_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): We literally do though, and especially because of that. Are you conscious of how backwards your argument is? [...]\n\nOh noes I hope I don't break le zeronet by calling people niggers, that would be a damn shame!\n\n> [bimmyql](#comment_38_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): I guess you're saying that I ought to be equally concerned about CP and \"political dissidence\" (see my earlier posts, dissidence isn't what I'm criticizing). Sure? I'm not seeing how your post is more than a kind of rhetorical-effect answer.\n\nwhat I'm saying is you're getting your panties in a big twist over people calling each other niggers while people use this platform to share vids of people fucking children to death on video. Get your fucking priorities straight dude",
				"added": 1610389919
			},
			{
				"comment_id": 17,
				"body": "like there are already threads on here of people linking to their CP sites, why don't you put your energy into complaining about them? People accidentally downloading CP because they don't know what they're doing and then getting busted by the cops is gonna be a much more pressing issue than anons saying mean words to each other and advocating fascism",
				"added": 1610390837
			},
			{
				"comment_id": 21,
				"body": "> [quantumkitty](#comment_526_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): You probably fap to interracial and tranny pr0n tho\n\nThere has to be a name for this kind of fallacy by now I just don't know what it is",
				"added": 1610402325
			}
		],
		"1610231360_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW": [
			{
				"comment_id": 3,
				"body": "instruct friends and family on how to download and use it safely",
				"added": 1610231433
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "Everyone should realize by now that lockdowns have just been a thinly veiled way for our leaders to rig the economy in a way that only benefits the oligarchs and mega corporations",
				"added": 1610232179
			},
			{
				"comment_id": 8,
				"body": "> [barbados](#comment_1_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): If people would stop spreading disease, there would be no need for more lockdowns. Get over yourselves\n\ngood goy, just obey your government and it will all be over soon, they will return all those rights they took away don't you worry, your government cares about you!",
				"added": 1610311119
			},
			{
				"comment_id": 9,
				"body": "> [barbados](#comment_9_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): Please list off all the rights I lost in 2020. I'm a minority, I already have no rights. Governments don't give a fuck about me, and the virus doesn't care who is government.  [...]\n\nCovid 19 death rate is literally lower than the flu, keep coping nigger",
				"added": 1610341273
			},
			{
				"comment_id": 10,
				"body": "> [jager](#comment_10_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX): For any government intervention to be permitted, it needs to be definitively (not potentially) supported by data. The data does not support lockdowns. \n\n>\"NOOOOOO DUUUDE BUT THE SCIENCE BRO, THE SCIENCE!!! DID YOU SEE THE SCIENCE?!?!?! IT ALL AGREES WITH EVERYTHING I SAY AND IF YOU DISAGREE YOU'RE ANTI SCIENCE!!!!!!!!!\"",
				"added": 1610341466
			}
		],
		"1610193120_1KkgEcvzK3mbVZGBTFLgkwy7WDjdfVSURj": [
			{
				"comment_id": 6,
				"body": "> [quantumkitty](#comment_520_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Yes, keep using anti-authoritarian spaces to propagate authoritarian ideas. Well spooked, my friend!\n\nour authoritarian ideas get censored though so we have to use spaces like these",
				"added": 1610309751
			},
			{
				"comment_id": 26,
				"body": "Wasn't James Mason a pedophile?",
				"added": 1610407715
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 7,
				"body": "> [bicklevov](#comment_4_18tBB7LRsGcCYkAU5fNDwTMADzVzHFa5rm): yeah.....? I sure hope so. perhaps it puts pressure on platforms like this to evolve and grow\n\nthe problem is if the platform gets too big websites will start taking up entire hard drives",
				"added": 1610309829
			},
			{
				"comment_id": 24,
				"body": "> [imblack](#comment_6_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY): I wonder if the founders of Google received the same treatment as Gab, when they started. Threats towards the CEO and his family, smeared as a Neo-nazi for years (check out the wiki, it's absurd) just because he allowed the right to speak as well (the left is equally as vulgar, so the justification for censorship is purely based on political reasons)\n\nGoogle was not targeted and smeared as neo nazis or anything of that sort obviously but when they were starting out they did have some beefs with the dinosaur media of that era, like when Viacom sued youtube in 2007 and lost",
				"added": 1610407208
			},
			{
				"comment_id": 27,
				"body": "> [imblack](#comment_8_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY): A legal matter vs personal assaults and threats. Which one seems more reasonable?\n\nthis is a rhetorical question?",
				"added": 1610407749
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 13,
				"body": "When Trump is finally out of the picture are you guys finally gonna realize the government doesn't give a shit about you?",
				"added": 1610360329
			},
			{
				"comment_id": 29,
				"body": "> [steeljacket](#comment_30_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): I don't think there is any evidence he won, but only because off a mountain of circumstantial, statistical, historical, and not-quite-certain evidence that the election was ballot stuffed. So we just have to live with Biden until he croaks, then it's boogaloo time. [...]\n\nboogaloo time will happen under Biden. Lots of Americans losing trust in the democratic process plus a uniparty state that will fuck over millions of americans and rob them is gonna galvanize lots of people against the government",
				"added": 1610409984
			},
			{
				"comment_id": 33,
				"body": "> [barbados](#comment_18_1EzoDvaFqLcYTBBTSFhLuHoF6C5L8x2GVg): Did you not see all these asshats live streaming themselves and tweeting about breaking into a secure area? Or all the ones now getting arrested for leaving pipe bombs behind? The boogaloo threat has been debunked; No one cares that a bunch of overweight mayoskins might rush a barricade and have a stroke.\n\nshill harder faggot, things will only get worse ",
				"added": 1610592857
			}
		],
		"1610354654_18DohwbEgQT6xm3fBQWYMkdq35CwK7Pre3": [
			{
				"comment_id": 14,
				"body": "just use zeroid lol",
				"added": 1610360521
			}
		],
		"1610223531_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 16,
				"body": "> [biznizman](#comment_2_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne): Post your community links if you must, but DON'T FOR THE LOVE OF JESUS TAPDANCING CHRIST DON'T LINK TO ANY CONTENT!!!! [...]\n\ngee it's almost as if that's the whole point of these faggots spamming their kiddie porn links on zeronet",
				"added": 1610390603
			},
			{
				"comment_id": 18,
				"body": "> [anonynous38883](#comment_38_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): Is Recommended to use The Whonix .. with whonix all pass over Tor.. and Zeronet you cannot download Cp by Accident .. you need to on the link if you see cp you can remove .. is possible to explain in case of arrest that . Remember zeronet say No ip to trace is use the same techno.. of Bitcoin wallet .. the public key..  [...]\n\nyeah I'm gonna trust the pedophile's advice on how to not accidentally download child porn, suuuuuureeee.\n\n>hey goy download my trojan it's safe don't worry!",
				"added": 1610391070
			},
			{
				"comment_id": 20,
				"body": "> [anonynous38883](#comment_39_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): You are paranoid is Crazy if you cannot secured your self fine leave zeronet and tor . [...]\n\nFucking poo in loo indian pedophile faggot, learn to speak fucking english",
				"added": 1610397127
			}
		],
		"1610369492_1uRiXAhYBVhxWPxZuFH8zDssbSapKHVcW": [
			{
				"comment_id": 19,
				"body": "some Qboomer on bitchute said it so it must be true",
				"added": 1610391453
			},
			{
				"comment_id": 31,
				"body": "> [luky](#comment_1_1DMqyu7PvGCW5gc1KaCGNGVFhWqARTSjem): Shit is going to get real boys. My buddy has a dad who had a vision from Christ. I'll past the TLDR [...]\n\nBOOM BOOM BOOM\nNIGGERS TONGUE MY ANUS\nREGIME CHANGE IN IRAN\nWWG1WGA\n-Q",
				"added": 1610424623
			}
		],
		"1610391633_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 22,
				"body": "> [dv1](#comment_61_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): time to move to I2P + Orchid ?\n\nhow the fuck do I use i2p, I've been trying to figure it out for over a month and can't.",
				"added": 1610402393
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 23,
				"body": "> [baduser](#comment_9_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr): How is that? These troons don't even try to pass and they're ugly. Their little \"fight for equality\" only makes it harder for real (biological) women to achieve anything be it sports or IT. Look, we have \"\"\"women\"\"\" in our team, we're fucking diverse! No, you have fags and troons and maybe a woman secretary or a janny.\n\nTroons try to infiltrate women's spaces all the time. IIRC a little while ago there was a lesbian subreddit that got infiltrated by troon mods and the mods got pissed that none of the dykes liked troons and only wanted other women and shut down the entire sub for \"hate speech\". Really goes to show the insanity and entitlement of these fucking weirdos",
				"added": 1610406712
			},
			{
				"comment_id": 25,
				"body": "> [imblack](#comment_7_18qiRCPPp2agguoC3nc7mL21hLZrfTjPWY): The CIA has also started to prefer diversity over competence. Check out their new logo and you'll see what I mean.\n\nMORE *clap* FEMALE *clap* DRONE *clap* PILOTS!",
				"added": 1610407432
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 28,
				"body": "all of these shitty little alt tech platforms that ask for your phone number and other personal info are fucking honeypots, I have no idea why boomers keep falling for this shit",
				"added": 1610409854
			}
		],
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 30,
				"body": "the only problem is we have to hope that once the network gets popular certain (((BAD ACTORS))) don't try to taint everything with fucking kiddie porn and get people in trouble",
				"added": 1610424514
			}
		],
		"1610438350_17VhNL7f9QRGPz9fV6wjCfY1qzFBnVybZa": [
			{
				"comment_id": 32,
				"body": "here's your (you) faggot",
				"added": 1610440747
			}
		]
	},
	"comment_vote": {
		"12_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"13_1AFhyYZbtHxkfMi9FCBnbJt5L8Rpt9X2Dn": 1,
		"11_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"1242_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"1_1BBH2zzYFaYBWqtCjFQ9nAtFsudzTX1eZY": 1,
		"2_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"7_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"21_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": 1,
		"9_1347SNK9HoT2GmRTi48RBZpFCdDxHgoFvs": 1,
		"2_1FyqmCtkdbdtpwcHeWskTZf1enxU3s3fdo": 1
	}
}