{
	"next_comment_id": 22,
	"comment": [
		{
			"comment_id": 1,
			"body": "The leader of the Sputnik project at Dell himself promised that he would look into the issue. So I have hope again.\nI had to order from the business (non consumer) section to find the developer edition. This one is different in almost every country store. In the swiss store for example, the developer edition is available in the business and in the consumer section.\nThere is a checkbox in the order form if it is for export. Being honest, I checked it. Since the checkbox exists, I assumed the stuff sometimes makes it out of the country.\nI'm curious at what their explanation will be.\n",
			"post_id": 10,
			"date_added": 1473198320
		},
		{
			"comment_id": 2,
			"body": "> [arnebolen](#comment_1_1AjxW1N844WRpscEFSotfsqLXsQurz83xc): Next time you need a laptop suitable for Ubuntu you may want to consider a laptop from System76.\n\nDo they accept BitCoin?",
			"post_id": 10,
			"date_added": 1474572503
		},
		{
			"comment_id": 3,
			"body": "> [pano](#comment_1_18MU6kDzUbMymkvuH69xJF8gcbt3DBpm6c): Thanks a lot Richi for this mystical Trip!It was a blaaaast!cu!pascal\nWelcome to ZeroNet. Cool ;-)\n",
			"post_id": 11,
			"date_added": 1475004735
		},
		{
			"comment_id": 4,
			"body": "> [weakish](#comment_2_1GnJD7CXskmG8GywMbTvbP12wneCFW9XzR): \"diver support for linux kernels\" s/diver/driver/\n\n:-) thanks, corrected.",
			"post_id": 13,
			"date_added": 1475494133
		},
		{
			"comment_id": 5,
			"body": "I found a cool site with the internals:\n[iFixIt](/15GkfLucJq422VrCKPCq6XKdoxz7ZWSS7U)\nNow I'm thinking about opening it up and disconnecting the internal microphones. But I think I'll wait for the warranty to expire first.",
			"post_id": 13,
			"date_added": 1477135604
		},
		{
			"comment_id": 6,
			"body": "How fitting, other people have even worse problems with this crap: http://www.bbc.com/news/technology-38301548",
			"post_id": 18,
			"date_added": 1481709781
		},
		{
			"comment_id": 7,
			"body": "> [ks](#comment_2_14TDWFVHuTXNcg8pp6LRr7v9ZcfbFsMSyx): You could have said “Hi!” on your way through Denmark! ;)\nCould have been an option if we drove all the way around through Sweden. But this way it was not really on our route. The transit days were long enough already. Maybe next time.\n",
			"post_id": 26,
			"date_added": 1502208944
		},
		{
			"comment_id": 8,
			"body": "Holiday trips spell trouble for the future of life on Earth.\nCarbon emissions from tourism are rising at an alarming rate.\nhttps://www.nature.com/articles/d41586-018-05108-x",
			"post_id": 26,
			"date_added": 1525763118
		},
		{
			"comment_id": 9,
			"body": "For a discussion on this topic see: \nhttps://forums.tesla.com/forum/forums/charging-strangers-house",
			"post_id": 31,
			"date_added": 1532588577
		},
		{
			"comment_id": 10,
			"body": "I wonder how many owners use gMail for their Tesla account...\nhttps://www.telegraph.co.uk/technology/2018/09/20/google-admits-hundreds-companies-read-gmail-inbox/\nGoogle admits it lets hundreds of other companies access your Gmail inbox",
			"post_id": 28,
			"date_added": 1537534410
		},
		{
			"comment_id": 11,
			"body": "Thanks fro sharing your story.\nI think smell from the mouth is harder to detect by the person himself. My wive sometimes tells me that I have bad smell from the mouth, when I didn't drink enough, had garlic, or am about to get sick. I don't realize it myself in these situations. We made it a habit to tell each other if we detect something like that. \nWe both switched to deodorants without aluminium not too long ago. Unfortunately they are not as effective. But usually when we are unsure, we ask each other. Most of the times the other person doesn't pick up anything. When I'm unsure and my wive is not around, I still have an older, more effective deo in the car.\nThe situation in the office improved a lot this week. I can still smell some sweat sometimes, but only from short distances. If it stays at this level, I am happy.",
			"post_id": 34,
			"date_added": 1544124874
		},
		{
			"comment_id": 12,
			"body": "> [quantumworld](#comment_2_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I don't trust parachutes motorcycles and helicopters. Everything else I am fine with. Like super fast cars. Maybe some day I will beat 221 mph. That's 355 k. Cops were not out that day.. lol\n\nWow, what penalty would you get, if the cops catch you with speeds like that? In Switzerland, they would confiscate the car. And the fine would likely be a double digit percentage of your yearly income. In Germany no problem at all in most places, al least if there is no traffic.\nThe best day to have no traffic is the 25th of December.",
			"post_id": 35,
			"date_added": 1545130148
		},
		{
			"comment_id": 13,
			"body": "> [quantumworld](#comment_3_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): The fine in the US would be allot. It was a nice Sunday morning and I had a very long flat highway. I will never do that again but it was very fun. Road conditions were perfect and so was the weather. I also drive the road 3 times that morning to make sure that the road was ok and nothing like a pot hole could cause any problems. Planning is everything when you go that fast or you will end up in a wreck.\n\nWhat car was that?\nThe fastest I drove was about 20 years ago. I drove roughly 245 km/h on an Italian highway with a Rover 827. \nI don't think I drove faster than 200 after that. I was touching just short of 200km/h a couple of times with other Rovers and with the Jaguar XJS, but not exceeding.\nLast year I drove 190 km/h with a Tesla S on a German highway. The kids shouted \"faster faster\" from the back seat. But then my wive woke up and freaked.\nBut I can feel the velocity much better when speedflying. Even if it's rarely more than 120km/h. ",
			"post_id": 35,
			"date_added": 1545138243
		},
		{
			"comment_id": 14,
			"body": "I wonder how many owners use Outlook for their Tesla account...\nhttps://motherboard.vice.com/en_us/article/xwndwn/microsoft-outlook-msn-hotmail-breach-cryptocurrency-bitcoin",
			"post_id": 28,
			"date_added": 1556603794
		},
		{
			"comment_id": 15,
			"body": "This is already the 10th flight on the new glider:\nhttps://www.strava.com/activities/2334893374\nSo far all of them genuine \"run and fly\"",
			"post_id": 36,
			"date_added": 1556797515
		},
		{
			"comment_id": 16,
			"body": "@leftside: Screwing customers is the kind of smart that only works one time. There are instances where customers would not come back anyway, and there are an increasing amount of customers that don't mind of being screwed. But I still believe it is better to act in the interest of the customer.\n\n",
			"post_id": 41,
			"date_added": 1569305661
		},
		{
			"comment_id": 17,
			"body": "@leftside  The brake pads are pressed against the disc mechanically, but the activation is electronic. \nI found a drawing, and added it to the end of the post. Inserting it here in  the comment didn't work.",
			"post_id": 42,
			"date_added": 1570993100
		},
		{
			"comment_id": 18,
			"body": "Yes, English is not my native language. Thanks for the corrections. I will integrate them later.\n\nThe output of the commands was too big to paste here. You can find them on [NullPaste](/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_0)\n",
			"post_id": 45,
			"date_added": 1575405639
		},
		{
			"comment_id": 19,
			"body": "> [fuseteam](#comment_1_1HzEA51FqLgAzbCHovLw9PoPBgVZ3ZMiTz): hey just wanted to tell you that there is a QR scanner on UT called Tagger\n\nI used tagger all the time on UT. But now I need something similar on PureOS.",
			"post_id": 45,
			"date_added": 1575613499
		},
		{
			"comment_id": 20,
			"body": "Speaking of Skype: https://www.theguardian.com/technology/2020/jan/10/skype-audio-graded-by-workers-in-china-with-no-security-measures",
			"post_id": 48,
			"date_added": 1578687959
		},
		{
			"comment_id": 21,
			"body": "Haha, just one day after I wrote this, a door handle failed. Contacting technical support through phone or eMail no longer works, and the function to book an appointment was removed from the website. They want the customers to book appointments through their app. But the app is available for neither the Librem5 nor UBPorts. At least the service center is not far from where I work. Going there in person also worked best in the past.",
			"post_id": 50,
			"date_added": 1579267781
		}
	],
	"comment_vote": {},
	"topic_vote": {},
	"post_vote": {}
}