{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"1613138654_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 1,
				"body": "> [0628](#comment_14_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan): It would be a good solution! [...]\n\ntry zerome it's a twitter clone... but becareful there are images... aka you should avoid it, or wait that the western pedos are overturn and all those lowclass pedos are arrested and that it become safe again to surf the web !",
				"added": 1616592196
			}
		],
		"1616599033_1BsALUkhotDeqP9x5KLNLAn7Hepw3KRa3Z": [
			{
				"comment_id": 2,
				"body": "> [bats](#comment_97_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): This topic really belongs here ( http://127.0.0.1:43110/15oXfMAMMKT59vVuqdXxjD7Mv24BmCyafu/ ).\n\n+1 zerotalk music <3 !",
				"added": 1616622120
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 3,
				"body": "nice progress...\n\nborder agents = silenced.\nusd on his dead bed to be replaced by the UNO SDR.\nsmall arms almost gone according to the small arms treaty following sandy hook... \n\nUNO success !!!\n\nwhat's fun is that I believe the pedogen and the pedochildrapists feodalists really believed they would be able to transition themselves into the UNO and be able to rape the world...\n\nsadly, they failed !\n\nheheheheh...\n\ntreason by low iq traitors :).",
				"added": 1616622284
			},
			{
				"comment_id": 4,
				"body": "it's crazy to think that they, the mickeys (military and spies) have betrayed the usa itself, for their own pensions and salaries...\n\nthey are despicable.",
				"added": 1616654346
			}
		],
		"1615548817_13PRLtXnYDj2ovZW1NeDJpE9ZnCpW51tPg": [
			{
				"comment_id": 5,
				"body": "then I guess it will be the mickeys (military and spy) purge, to remove all who still believe there is a country formerly known as the usa with the 2ndA... it's clear the OK is one of their prime attack focus, however they fear more the last pockets of beliefs inside the so called active (those who technically are vippedodefenders).\n\nthe usa doesn't exist anymore, it's the UNO running the show.",
				"added": 1616654476
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 6,
				"body": "\"new\" satellite tech can see at least 60 feet below ground... the question is how to bury an AK while it being invisible to sat scans (which are automated btw).",
				"added": 1616654628
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 7,
				"body": "personally I would have hesitated to vote for :\n\nhttps://rappeh.org.il/en/\n\nbut I wouldn't really trust them, I mean, I understand their opposition to vaxx nazism, but otherwise... I am not sure they understand the concept of a DMZ :).\n\notherwise :\n\nYamina or Yisrael Beiteinu !\n\nwhy? because I am a big fan of bebe policies ex vaxx nazism but to keep him grounded (honest) I would have prefer one of the two... furthermore I am a fan of Ayelet Shaked and I don't doubt the faith of avigdor.\n\nfurthermore, it's not because I want to find and kill the few israelis involved in pedogate (maybe less than 1k? or like 200... at max to my guess) that I don't support the jewish state !\n\nI don't see the problem to be against pedo (and those enabling them) and supporting nationhood on the ancestral land for the jews ! \n\nand that means that if one day, idf / mossad / shinbeth have to be defeated it would be to give back the land to the jews :D !\n\nagree or not I don't care !\n\nfinally, I like very much that IDF / MOSSAD / SHINBETH / Most jews with a brain would fight to death for israel, not for the pensions or salaries like the worthless traitors and subhumans in the usa.\n\nthat's great, and worth more than all the shekels in the world !\n\nso, let's get real : electricity prices and the hell smokes from leviathan, who makes the bucks, who gets the shaft ? I have heard that israelis telecos were a highly profitable business...\n\nI am not collectivists, however regulatory / market capture isn't my type of market...\n\nwhat else? traffic jam ! there is often no choice but to ceaze and destroy the homes of those who were too close to the old road... that's for me one of the real reason of the collapse of ROME... we needed wider road, but those next to some were too powerfull to be moved... afterall I understand them, when half their estate would be taken for the road, where will they end up but the outskirts?",
				"added": 1616655285
			},
			{
				"comment_id": 8,
				"body": "furthermore I would invite alyssia keys... she wants to talk about gaza... first she must see... I guess she pretend to be a though girl, gear up, let's tour her... and then the replays... then we can start to talk about WAR !",
				"added": 1616655471
			},
			{
				"comment_id": 9,
				"body": "and if she doesn't want, a snoop lion will end like a twopack... holed.",
				"added": 1616655502
			},
			{
				"comment_id": 10,
				"body": "you know because I think those niggas to used to rape, plunder and loot america, have forgotten, their hoods... shitholes... and so when they think that because they rule over the american goyim, those filths having surrender their land they can come and join the parties on the shores with their threats, they fucking desillusionals.\n\nand it would be nice to remind them of their origins.",
				"added": 1616655598
			},
			{
				"comment_id": 12,
				"body": "myself I am convinced that syrians will one day (those left alive) understand and accept and realize that it was a bad idea to oppose the return of the jews... hates can be beated by war :).\nhttps://www.banned.video/watch?id=605bddab164b285e1e736396\n>Syrian Girl Responds To Colorado Shooter And Biden Administration Occupying Middle East\n\nshe is almost there... what can you say, suffer more... until you honestly capitulate, surrender and accept and recogine eretz and then blooming again...\n\nyour choice... death or israel.",
				"added": 1616655988
			},
			{
				"comment_id": 13,
				"body": "booohoooo booohhhoooo... pfff",
				"added": 1616655997
			}
		],
		"1616487804_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 11,
				"body": ">Syrian Girl Responds To Colorado Shooter And Biden Administration Occupying Middle East\nhttps://www.banned.video/watch?id=605bddab164b285e1e736396\n\nI think it starts to sink in deep, you wanted war with Eretz... I hope you enjoy it ! damascus...\n\nonce upon a time in aleppo (love to soap btw), once upon a time in mossul... soon once upon a time in damascus?\n\nno, who said it was in a hurry? not me...\n\nadmit, surrender, capitulate, or enjoy the show :)\n\nthat's life\n\nthey wanted to throw all the jews to the sea, to kill them all...\n\nthey lost.\n\nnothing else.\n\nbut I guess still more pounding to really understand it...\n\nor syria or eretz...\n\nchose , we have.",
				"added": 1616655841
			}
		]
	},
	"comment_vote": {}
}