{
	"next_comment_id": 13,
	"comment": [
		{
			"comment_id": 1,
			"body": "Serieux? l'extreme droite n'en as jamais eu rien a foutre des SDF, qu'il considére comme de la merde... mais maintenant que c'est devenu un argument anti-migrand (exu etant des sous-merde pour le facho moyen...) ça y est on appelle les SDF \"les nôtres\"...\n\nquelle hypocrisie ! quelle puanteur !\n\non pourrais mettre tout les clandestin voir tout les migrants dehors qu'il y en aurais toujours que pou votre gueule, quand on ne veux pas partager, qu'on est intolérant on trouve toujours quelqu'un sur qui cracher !\n\nsurtout qu'entre le migrants et le SDF je peux vous dire que ceux qui ont la mentalité la proche de la votre c'est plus les migrants !",
			"post_id": 14,
			"date_added": 1504202216
		},
		{
			"comment_id": 2,
			"body": "putain mais il pourrais s'appeler Capucine, Ayate, Raj ou même Bobak que je m'en carre, et si il devient le premier vrais président, le premier qui veut faire le bien et soit au service du peuple, qu'il agit intelligemment, et bien qu'il s'appelle Pierre, Moktar ou Dylan qu'est-ce qu'on s'en fout !\nce serat le meilleur président de tout ce siècle!\n\nvous détester tellement les arabes et ce sans aucun fondement que les prénom arabes vous révulse, mais ce ne sont que des prénoms ! ",
			"post_id": 12,
			"date_added": 1504203000
		},
		{
			"comment_id": 3,
			"body": "à gerber ton truc gros!",
			"post_id": 9,
			"date_added": 1504203056
		},
		{
			"comment_id": 4,
			"body": "liberez votre esprit et venez rejoindre le camp nauséabond de ceux qui on la haine et la paranoïa bien percher... ici pas de demi-verité ou de demi mensonges commes dans les médias, pas de xénophobie caché dérriere des discours boiteux, nan de vrais bon gros menssonges, et de la bonne grosse haine des famille !\n\nmonde de merde.",
			"post_id": 8,
			"date_added": 1504203310
		},
		{
			"comment_id": 5,
			"body": "nan mais faut savoir? ont veut de la laïcité ou pas?\nah non j'y suis la laïcité c'est bon pour les arabe ! les truc qui font tchouk-tchouk dehors ! mais  les signes religieux bien de chez nous ça on y touche pas !!! \n\npitoyable...\n\net les kebab greg alors? ça compte comme quoi? c'est halal ou pas halal alors?",
			"post_id": 6,
			"date_added": 1504203463
		},
		{
			"comment_id": 6,
			"body": "c'est comme dans le 16 eme ! y'as que des blanc oO sacrebleu !\n\nnan mais sérieux, ces vieux débat puant sur ZERO?! y'as pas plus intelligent à faire sur une plateforme libre que ça???\n\nles mecs qui parlent des aides, toujours les même, le bon gros Gérard dans sa BMW 318i vitres fumées, qui fumes des malback ou des gauloise à la gueule de ses chiards, et se plein quand il voit les famille noir ou arabe se casser le cul pour pouvoir aller en vacance...\n\nbéh ouais, mais t'en as rien a foutre en vrais des vacances de tes mômes parce que si c'etait le cas, tu te bougerais pour qu'ils en ai! quitte a revendre ta caisse de merde qui coute un bras en essence (surtout vu comment tu roule) en piéce et en assurance, comme ça tu fera moins tache au resto du cœur ou a la caf...\n\net oui le directeur d'ecole à une clio neuve, mais c'est lui qui à les aides ? ah non... c'est le noir qui lui a la vieille clio de 1995... pauv con tu mélange tout.\n\nsi c'est si facile de vivre avec les aides t'as qu'as essayer! \ntu verra qu'en même temps que tes aides augmentes avec le nombre de gamins qui tu as à charge, les emmerdes et les frais augmentent aussi parce que les gamins tu peux pas les nourrir avec des megots et de l'huile de vidange de BMW gros.\nben ouai, coute les couche, les makrout, les babouch qu'il faut changer tout les six mois parce que les pieds d'arabe grandissent vite!\n\nt'es tellement bon en math quand tu calcule les revenus des autres, pourquoi tu te fait pas comptable sinon? ça paye bien! t'as vu les comptable? tout les été a la mer, tout les hiver a la montagne et ça roule en merco, en porche ect.... \n\nnan toi tu préfère t'en prendre a ceux qui sont dans la misére, tu voudrais qu'il le soit encore plus, pour que tu puisse te sentir mieux !\ntu te pose pas la question de savoir ou l'argent va dans sa globalité! si je te dis que 95% des richesse sont accaparé par 5% de la population ça t'en touche une sans bouger l'autre!\nnan c'est forcement le pauvre qui se goinffre, le pauvre qui pue, qu'est pas comme nous qui est bizzarre qui a 36 femme, 10 gamins par femme ect...\n\nmoi j'en ai marre de voir le cerveau de mes compatriotes se dégrader, j'en ai marre de les voir étaler leur merde sur internet au lieu de chercher à trouver des moyen de nous en sortir tous !\non cours a la catastrophe, on vis en surcit, on détruit tout et on ruine tout, pour le profit, parce que le systeme le veux parce qu'on nous a conditionner a vivre ainsi et c'est pas de la faute aux noir ou aux arabes ! ouvres vraiments tes yeux ducon et rend toi compte de la merde qu'il y a toujours autour et de celle qui tu crache a longeure de temps !\n\nla gale elle est dans ta tête et elle fait des galerie partout putain !\nprend un bouquin, donne toi des coup ! claque tout la tête contre un mur, je sais pas, fait ce que tu veux mais arrete !",
			"post_id": 4,
			"date_added": 1504204677
		},
		{
			"comment_id": 7,
			"body": "d'endurer quoi ducon???? c'est le retour du choix qui à été voté ! parce que pour tout ceux qui n'aime pas la viande, qui sont végétarien, boudiste, juif ou musulman ou autre, il est normal d'avoir le droit de manger quand même! \n\npour quelle foutu raison certains gamins pourrait se gaver de bon gros cochon et d'autre se contenterais de banger le pain et le yahourt tout en se faisant engeuler quand ils ramenne leur assiéte non touché????\n\npour quelle foutu raison ça te pose un probleme ducon ??? hein???",
			"post_id": 16,
			"date_added": 1504353352
		},
		{
			"comment_id": 8,
			"body": "tu y as été toi? nan parce que si tu veux de la viande tu en trouve sans problème, qu'elle soit \"hallal\" ou pas ça change rien, hallal c'est juste une étiquette comme 'le label rouge' qui sert a des musulman comme ma belle sœur à savoir que c'est bon peur eux.\n\nça change rien à la viande en elle même hein... \net un pays musulman ça n'existe pas. c'est comme un pays chrétien.\nc'est un pays a majorité musulman mais yas des endroit au maroc, en algerie et surrement d'autres encore, ou tu trouvera des français, même des églises des prêtres et des abbé qui pourront produire leur cochon et le manger. \naprès ptet qu'il y a des pays de tarré comme les Emirat ou l’Arabie saoudite ou la charria ou c'est surement pas une bonne idée d'essayer...\n\nmais on est pas un pays de tarré, on est le putain de pays des droit de l'homme, la nation de la laïcité et du respect des autres et de leurs droit, donc j'en ai rien a foutre que dans d'autres pays on soit pas aussi libre et je pense qu'on devrais jamais niveler par le bas. \n\npourquoi est-ce qu'on devrais faire comme dans les autres pays??? \nen inde tu mange \ntu sait que la bas c'est avec la main que tu te torche? alors quoi faut faire pareil en france???\nsi tu regarde autour de toi juste pour pouvoir faire la même merde tu ferais mieux de te crever les yeux et retourner dans ton lit. surtout si quand regarder ce qui se passe autour de soi est une façon de dire regarder la vérité a travers un prisme déformer de haine et de xénophobie...\n\ndes gamins qui n’ont pas envie de manger de porcs, y'en as pleins, y'as pas besoin d'être musulmans, je suis pas musulmans, je m'en suis toujours foutu de a religion mais j'aurais rêver d'avoir a manger à la cantine pour moi, pour ne pas être obliger de me contenter de pain ou de carottes rappé...\n\net toi tu est scandalisé, tu demande combien de temps tu va devoir endurer un progrès pour les gamins???\nforcement que j'ai l'insulte facile, ton blog est une insulte a l’intelligence, tu pourris un projet tout neuf de réseau libre et non censuré pour mettre des trucs aussi nul que ça, et ta haine gratuite sans fondement ne peux que provoquer des retour virulent...\n\n\n",
			"post_id": 16,
			"date_added": 1504619293
		},
		{
			"comment_id": 9,
			"body": "ben oui, la meilleurs solution est encore de leurs laisser un terrain, propre sains et sur lequel ils auront plaisir a rester les quelques temps qu'ils resterons",
			"post_id": 19,
			"date_added": 1504900039
		},
		{
			"comment_id": 10,
			"body": "c'est pas une preuve ça, c'est du blabla... y'as même pas la moitié des infos t'es pas serieu putain",
			"post_id": 37,
			"date_added": 1517186480
		},
		{
			"comment_id": 11,
			"body": "ptet qu'il as gardé un mauvais souvenir d'un prêtre qui rentrer un peu trop souvent en communions avec son innocence étant enfant...",
			"post_id": 41,
			"date_added": 1517186599
		},
		{
			"comment_id": 12,
			"body": "DTC",
			"post_id": 40,
			"date_added": 1517186622
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}