{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1615874098,
			"title": "the spinster of the wh has gone loonie on PRC (people republic of china)",
			"body": "I mean the guy wants to conquer : tibets, xinjang, taiwan, hk... \n\nwhy not Beijing?\n\nahahahah...\n\nthose mofos can't arrest a few pedos, can't defend their own kids, and they wish to fight the Chinese War System? lol...\n\nsadly, I truely believe that this day will come, and the massacre of those ocucpiers of america will be a good thing for the world.",
			"added": 1615874097
		},
		{
			"topic_id": 1615876645,
			"title": "destroying and murdering all the state operators of the uk doesn't mean to be against brexit!",
			"body": "both aren't mutually exclusive !",
			"added": 1615876643
		},
		{
			"topic_id": 1615877274,
			"title": "any low iq american vet here?",
			"body": "serving for pedogate? proud?",
			"added": 1615877271
		},
		{
			"topic_id": 1615878411,
			"title": "the first priority target in any country is us embassy and consulat installation...",
			"body": "if you don't raid and pulverized those things and the demons in it, you are a little bit lost...",
			"added": 1615878407
		},
		{
			"topic_id": 1615880049,
			"title": "UK & US Slam China's Breach Of Hong Kong Handover Treaty \"For Third Time\"",
			"body": "https://www.zerohedge.com/geopolitical/uk-us-slam-chinas-breach-hong-kong-handover-treaty-third-time\n\nlol the pedostates can't accept the border of china? of course, they rape kids with IMPUNITY, so what to expect from demons?",
			"added": 1615880044
		},
		{
			"topic_id": 1615880217,
			"title": "since the takeover from pedotrump, what is pedo alan dershowitz doing?",
			"body": "already fled to israel? how many kids has this filth?",
			"added": 1615880211
		}
	],
	"topic_vote": {},
	"next_comment_id": 35,
	"comment": {
		"1615869992_1EFczXC2qdKix14Dr4EZ7WaxFC65u4K3ie": [
			{
				"comment_id": 1,
				"body": "I smell dead children...",
				"added": 1615873962
			},
			{
				"comment_id": 2,
				"body": "most fbi agents are active participants in pedogate, at least the cover up. they will be killed. but not by americans, too weak, too coward, too shitty, only talk...",
				"added": 1615873995
			},
			{
				"comment_id": 9,
				"body": "funny how this filth setup a lot of pishing website, but his wiki is erased... so who knows the name and location of his kids? nice primary targets ! he will be less aggressive after a few funerals ! does he has borthers or sisters? nice kills too !\n\ncontact.",
				"added": 1615874725
			}
		],
		"1615850687_139pHaxesZa11czwptXVY62ZrNWUh4NxRQ": [
			{
				"comment_id": 3,
				"body": "join the zerotechtalk...\nhttp://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/",
				"added": 1615874183
			}
		],
		"1615839546_18w7xHq6PfLBDhcTqJSMkgvqYEYiKWEtjS": [
			{
				"comment_id": 4,
				"body": "Like all men who have won wars, I truely believe that the propaganda operations of the enemies are entirely legitimate targets, like all the unborn of the enemy side. However I believe too that sometimes, and even often, the propaganda is so stupid that it would be a mistake to remove a source of errors in the enemy hearth.",
				"added": 1615874300
			}
		],
		"1615449081_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 5,
				"body": "Everything is going well ! normalization protocols in motion. It's simple what ever side cnn chose, support the other.",
				"added": 1615874360
			},
			{
				"comment_id": 27,
				"body": "yeah the message must be hammered : we didn't burn our own factories, we are as angry as you workers !",
				"added": 1615879985
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 6,
				"body": "why not support a fully blown civil war in ireland? bringing real weapons and munition + specialists support to create a full blown civil war by supporting both side with the aim to spill it over to london? It would be fun if the children of prince williams are killed in a blast ! I mean , do we want russia to be free? didn't we saw ukraina? Isn't the necessary bloodbath in syria enough illustration?\n\nbattlefield inversion ! let's kill the last cop alive in the uk. the last one...",
				"added": 1615874483
			},
			{
				"comment_id": 7,
				"body": "or they respect our sovereignty or we destroy them.",
				"added": 1615874518
			},
			{
				"comment_id": 8,
				"body": "I guess, in less than 3 months, there can be a real full blown armed CW. islands have + and -, specially when it comes to drifting gears... not even a breach on national water... ohh look : modern AKs !",
				"added": 1615874592
			},
			{
				"comment_id": 12,
				"body": "what would be an acceptable surrender of the uk? execute prince andrew and everyone at the bbc involved with jimmy saville... publicly. on traflagar square.\nyou have to humiliated and exposed for what you are, to have a chance to rebound.",
				"added": 1615875076
			},
			{
				"comment_id": 13,
				"body": "I think that ireland can be a sublime battlespace for a really armed, equipped and trained guerrilla warfare operations.\nall this greeneries and the sea... the sea... the open world of trading !\nfurthermore with pro death squad roaming against mi5/6 child rapists to protect the insurgents from their own stupidity... i guess it's not over ambition to think about taking over london... a little back up of the scottish... and it's a done deal. london fall.\nstupid nazis.",
				"added": 1615875194
			},
			{
				"comment_id": 14,
				"body": "what would be nice is to find a settlement with turkey on their new southern border... so that bashar can move to the river (full on air defense) and redeployement is possible to ireland and uk... battlefield inversion... if london is burning, they won't be able to plan their take over of russia... maff.",
				"added": 1615875314
			},
			{
				"comment_id": 19,
				"body": "each country according to it's tradition ! how to hunt with out a rifle? what is the most modern sport hunting rifle allowed in russia? lol :) bear hands :).",
				"added": 1615878353
			},
			{
				"comment_id": 21,
				"body": "how many operational aks are there in russia?",
				"added": 1615878551
			},
			{
				"comment_id": 22,
				"body": "I believe the answer is unknown... I wouldn't be surprised if all was accounted, specially the long term storage, even those forgotten, it's above the billion... maybe between 250m 2b... somewhere... already made I mean.",
				"added": 1615878669
			},
			{
				"comment_id": 23,
				"body": "personnally I don't think that the western ruling class, it's leo and secteams can be saved. pedogate immunity is beyond anything I could ever imagine... you know force vaxxed with genocide, white genocide etc... I can get it... but pedogate immunity... i have no words but to want to kill them. they have to be. they can't live anymore.\n\nimho.",
				"added": 1615878875
			},
			{
				"comment_id": 24,
				"body": "for me it's a civilization crysis. former su was a political and social collapse... aka transition. but there were bad people, like everywhere, who took advantages of it, but I don't think even for those that a pedogate situation could have emerged. I want to believe their is a wide spread dignity among the russian people. the westerners lost it... I hope.\n\nand if you think, it was in the turmoil that the bad elements revealed themselves during SU collapse, in the west, it was even during a war ! imagine that meanwhile soviet troops are engaged in afghanistan, the su ruling class was raping kids? no way! \n\nyou see the shock?",
				"added": 1615879061
			},
			{
				"comment_id": 25,
				"body": "it's beyond hollowing it out ! it's rotting, purification... an still the \"journalists and press\" so called free, protects the pedos... they don't have the time to investiage a single flylog of pedoisland but they have the means to go to the prison system... I mean...\n\nthey have to be killed and will.",
				"added": 1615879178
			},
			{
				"comment_id": 26,
				"body": "who is the julie ehead of russia?",
				"added": 1615879217
			}
		],
		"1615806111_1GDKPE25cR59ZjSitNhm1KgDf4T2Fim8tz": [
			{
				"comment_id": 10,
				"body": "for the low iq : trump like bibi are fully framed by pedogate ! what would sahara or melania say seeing their husbands raping kids? (maybe not bibi, bibi only watched epstein friends do it).",
				"added": 1615874809
			},
			{
				"comment_id": 11,
				"body": "and that's what I find astute, is using low iq arrogant framed fake christian in the usa, say to them maga, make miga and protect the rapists... americans are dumb enough for that.\n\nI hope PLA wins flawlessly. !\n\nps imagine if all the mothers of china pray for PLA :). btw, they will.",
				"added": 1615874900
			}
		],
		"1615441502_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 15,
				"body": "yeah I know ! 30 was for 12hours... so maybe 2gr each hour? that's exactly the topic. thanks for your inputs ! so what is the bioavailable processeable hourly quantity?",
				"added": 1615876744
			}
		],
		"1615876649_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 16,
				"body": "pedogate, feodalism, constant lies (calling us conspirationist while it's FACTUAL), add bailouts for them... etc.\n\ntrust is gone.\n\nthey are the enemies.",
				"added": 1615876795
			}
		],
		"1615877274_13NUR82XkTvkw1czsyrPxcFG6Njuvx7CSt": [
			{
				"comment_id": 17,
				"body": "normally you are the type of shit dogs to be proud of yourself, america america... and then you saw pedogate and like shit your did nothing... lol... heroes my ass full on zeroes.\n\nremember if active mess with PRC sovereignty, you will be drafted with your kiddies :D. heheheheh.\n\nvictory belongs to us : china = scs taiwan xinjang etc... did I forget HK? lol.\n\nmaybe you want to be more involved in ukrainia to fight big bad putin? lol\n\nterrorists !",
				"added": 1615877380
			},
			{
				"comment_id": 18,
				"body": "what's funny is the proximity with the nazis... reliance on over complexed gears and an incapacity to breach the corrupt chain of command... and like them, the path is clear ! defeat. finally, never too soon.",
				"added": 1615877468
			},
			{
				"comment_id": 32,
				"body": "https://www.zerohedge.com/geopolitical/fresh-rocket-attack-hits-iraqi-base-housing-american-troops\n\ncool, I hope many of the pedoprotectors died ! but I don't bet on it... like vermins, they know well to hide, afterall they are pedos too !",
				"added": 1615880533
			},
			{
				"comment_id": 33,
				"body": "how many kids to you think they kidnapped in irak and afghanistan to feed the pedos?",
				"added": 1615880585
			}
		],
		"1615878411_13NUR82XkTvkw1czsyrPxcFG6Njuvx7CSt": [
			{
				"comment_id": 20,
				"body": "remember that's where they plan to rape, loot and kill your kids... demons. but don't forget it's not americans (look those are bovines unable to do anything with out their previous reserve status)... it's the occupation forces, aka FED coats !",
				"added": 1615878475
			}
		],
		"1615880049_13NUR82XkTvkw1czsyrPxcFG6Njuvx7CSt": [
			{
				"comment_id": 28,
				"body": "rapes has become their mindset in all facets of their lives... for the FED coats of course.",
				"added": 1615880084
			},
			{
				"comment_id": 29,
				"body": "the rest are bovines. noisy but even cows have more selfestem as those conquered and brainwashed sheeple.",
				"added": 1615880118
			},
			{
				"comment_id": 34,
				"body": "> [medic](#comment_1_12UPSeQdVngKkv89xa16hYBNLyVVqbWnjM): They seem very insecure about all of this.\n\nyes, they know that their feodalism won't last much longer... fed coasts are really bad people. how did they turn like this? drugged? chipped? brainwashed like nazis?",
				"added": 1615894436
			}
		],
		"1615880217_13NUR82XkTvkw1czsyrPxcFG6Njuvx7CSt": [
			{
				"comment_id": 30,
				"body": "it was nice to see him all the time on pedofoxnews. but since pedotrump is gone... so is pedodershowitz... what did he do to harvard kid with pedoelerian and all the others filth like pedosummer ? bad for sure... lol. conquered.",
				"added": 1615880282
			},
			{
				"comment_id": 31,
				"body": "but don't be violent sheep ! lol.",
				"added": 1615880291
			}
		]
	},
	"comment_vote": {}
}