{
	"title": "WaveBTC",
	"description": "Team Bitcoin\nWAVE Trophy 2018",
	"links": "*   [Our gallery](/1EHrpXd3f6CyKooBFtpLhdFk5C3bqFhyg1)\n\n*   [WAVE Trophy](http://www.wavetrophy.com)\n\n*   [Road Book](/1GDnDwmjFZ9uLgQ9xFdBsn9yfTuZn8mje/Road_Book_Group_4/index.html)\n\n*   [Bitcoin Association CH](https://www.bitcoinassociation.ch)\n\n*   [bitcoin.org](https://bitcoin.org)\n\n*   [Tesla Referral](http://ts.la/ulrich5885)\n\n*   [Personal Blog Richard](/ulrichard.bit)\n\n*   [ParaEasy paragliding](http://paraeasy.ch)",
	"next_post_id": 26,
	"demo": false,
	"modified": 1626868116,
	"post": [
		{
			"post_id": 25,
			"title": "New blog post",
			"date_published": 1626868116.573,
			"body": "Blog post body"
		},
		{
			"post_id": 24,
			"title": "Hodl Rallye",
			"date_published": 1539257662.799,
			"body": "While listening to a Bitcoin podcast last week, I learned about the [HodlRallye](https://hodlrally.com/). My first reaction was: \"cool, a rallye to raise awareness for Bitcoin\".\nHodl is a common meme in the crypto currency space. It comes from a famous misspelling of the word \"hold\". It means holding on to your precious coins, and only letting go in exchange for something you need.\nI even considered participating for a split second. But upon closer inspection there are many reason why I won't.\nTo begin with, I don't want to be part of a rallye with mainly polluting pimp cars. And then the whole thing is a bit too decadent for my taste. It is going from one party to another with models that are part of the fun. I fail to see how this helps increase adoption of Bitcoin."
		},
		{
			"post_id": 23,
			"title": "WAVE Austria",
			"date_published": 1537529705.576,
			"body": "WAVE Austria starts today. \n\nhttp://www.wavetrophy.com/route-programm-au"
		},
		{
			"post_id": 22,
			"title": "The WAVE is over",
			"date_published": 1529267803,
			"body": "We had a great week of driving. We successfully demonstrated that there is no more reason to pollute for transportation.\nSorry for not writing more on this blog. At some of the evenings during the WAVE, we were too tired to write blogs after attending the talks. During the remaining evenings we preferred to hang out with the other participants rather than sitting alone in front of a computer.\nI will write a larger post about the whole experience. In the meantime, you can watch the daily videos on [https://www.youtube.com/channel/UC0jW6rsqfNxANXCASXz7VNQ](https://www.youtube.com/channel/UC0jW6rsqfNxANXCASXz7VNQ)\nFor those of you running your own ZeroNet instance, the videos are also available on CopyKate:\n[day 1](/big.kopykate.bit/?Video=1529497359_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 2](/big.kopykate.bit/?Video=1529497508_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 3](/big.kopykate.bit/?Video=1529497559_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 4](/big.kopykate.bit/?Video=1529497786_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 5](/big.kopykate.bit/?Video=1529497983_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 6](/big.kopykate.bit/?Video=1529498259_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 7](/big.kopykate.bit/?Video=1529498327_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 8](/big.kopykate.bit/?Video=1529498389_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ) [day 9](/big.kopykate.bit/?Video=1529498440_1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ)\n\nStay tuned..."
		},
		{
			"post_id": 21,
			"title": "Smile and WAVE, Boys! Halfway Through the WAVE!",
			"date_published": 1528751707.203,
			"body": "**[CHARLES] The past few days have been an incredible eye-opener. Driving through the pristine, stunning Swiss countryside, we visited a myriad of companies doing incredible work.**\n\n**One of them was Maxon Motors. Maxon makes electric motors of all shapes and sizes. From powerful and reliable power units for the Mars rover, to tiny, millimeter scale motors for minute actuation. Their factory was a textbook example of clean, efficient mechanical engineering. With their continued work in other fields like bicycles, prosthetics and general robotics, it's a wonder we haven't already heard of them back in Singapore. OEMs really don't get the visibility they deserve.**\n\n**We also stopped at various towns across northern Switzerland, joining exhibitions, speaking to locals, showing off our cars and spreading the electric work. It's difficult for me as a non-German speaker, but I enjoyed the expos all the same. Our Bitcoin stickers definitely piqued some interests, and it's always interesting to talk about how electric mobility relates to other future technologies.**\n\n**These experiences are great in their own right, but if there's one key takeaway, it's the people I've met here at the WAVE. A blend of sustainable technology advocates, engineers, entrepreneurs and climate change activists present themselves here at the event, and all of them have something different to bring to the table. From hearing stories of technology and engineering before my time, and discussing the future of our planet, all while enjoying the picturesque Swiss mountains, what could be better?**\n\n**We're only halfway through, and I can already tell the WAVE Trophy is an experience I won't soon forget. Here's the continued race to our Electric future, and the survival of humanity.**"
		},
		{
			"post_id": 20,
			"title": "The first WAVE day",
			"date_published": 1528488386.55,
			"body": "Compared to Charles journey, my trip to Zurich was rather boring. I went there early enough to have time to wash the car. It should shine like new for the WAVE. Also putting the stickers onto a layer of dirt wouldn't be so cool. In addition I went to test the destination charger at Jelmoli.\nAfter picking up Charles at the train station, we headed straight to Winterthur. One of the main takeaways from the introductory talks was that eating meat is not good for the climate. \nAfter causing a local traffic jam, we were ready to go. Not long after leaving we drove straight into a thunderstorm. We arrived in Affoltern before the rain. But soon after, it caught up. In the big tent we had delicious meat from the smoker. It might be not so good for the climate, but it sure was good for our bellies.\n"
		},
		{
			"post_id": 19,
			"title": "Winter Is Coming",
			"date_published": 1528447656.682,
			"body": "Wow, it’s been quite the journey getting to Winterthur, with tight legroom and tighter transfers. Hectic layovers aside, all this travelling has left me thinking deeply about the carbon footprint we leave behind at every leg.\n\n**First Leg: Singapore - Dubai - Frankfurt**\nI boarded an Emirates 777 from Changi and set off on my way to my layover in Dubai. The flight was uneventful, and I got lots of work done. There’s so much time spent idling/watching movies/reading on a plane. It was nice to feel productive for a couple of hours. 7 hours later, and we arrive in Dubai.\n\nIt was a 1h 20m layover, which sounded leisurely. I took my time getting into the transfer terminal, only to find out my flight was in an entirely different building. Thanks to the stellar design of Dubai International, the only way to get there was by a little airport bus, with an awful frequency. The ride itself took over 20 minutes, and it was clear that I was running out of time.\n\nI had to sprint to my boarding gate, which was already on its last call. I barely made it, and it was sheer good fortune/efficient logistics that my luggage made it as well.\n\n**Second Leg: Karlsruhe - Basel - Zurich**\nOne might imagine German trains are precise, punctual, perfect. Much to my dismay, my first train was 20 minutes late. This wouldn’t be too bad, except that my transfer was also 20 minutes. Snap.\n\nThere isn’t much else to this story, except having to sprint 3 platforms within 2 minutes while hauling my enormous suitcase. Now on to the serious stuff.\n\n**Jet-setting Glamour - But at What Cost?**\nA whirlwind life of world travel, new experiences and incredible sights isn’t all peaches and cream. Tight layovers and terminal sprinting aside, how much are we damaging the environment with every trip we take? The global travel network is an incredible enabler of communication, commerce and cooperation, but it simply won’t be sustainable at the rate we’re going right now.\n\nA few hundred grams of carbon every time we take a trip doesn’t sound like much, but with the sheer volume of traffic daily, it absolutely adds up. We must think of novel modes of mobility. Public transport, fuel-efficient engines and car-sharing are all great initiatives. But for humanity to continue to thrive without bleeding our planet dry, we need a paradigm shift in the way we think about travel.\n\nHere at the WAVE Trophy, it would be naive to say that electric cars are the penicillin to our plague. They too suffer from high cost of manufacture, pollutants from batteries and electronics, not to mention the source of their power is often fossil fuels. They’re a step in the right direction, and the importance of starting the global conversation cannot be underestimated.\n\nThe problem of sustainable travel must grow to be in the consciousness of the everyday traveller. With sufficient advocacy, awareness and action, our dreams of a stunning, clean, utopian future are assured for generations to come."
		},
		{
			"post_id": 17,
			"title": "Range anxiety",
			"date_published": 1527795762,
			"body": "When I talk to people who drive fossil cars about electric mobility, range anxiety is always something that comes up rather quickly. It is also something that worried me a bit in the beginning. Electricity is everywhere, but if there is no fast charger, it can take a while to juice up. After driving an E.V. for a bit, range anxiety vanishes pretty quickly. The navigation system does an amazing job planning the required charges. It is also stunningly accurate calculating the state of charge at the destination. You get used to have a coffee or toilet break while the car charges on long distance trips. You also plug in the car while having a meal. After a while it becomes natural, and you don't even think about it any more.\nTwo weeks ago we went for a small hike and barbecue on the Zugerberg. When we returned to the parking area, a blue car which was parked just next to ours was about to leave. I had the impression they looked somewhat awkwardly at us. Later I found out that somebody slammed their door against the fender of my car. I found remains of blue paint on the dent. The moron just left, and didn't even leave a note.\nMy insurance approved to pay for the repair. So my neighbour who works in a car body repair shop, took the car right from home. He told me it would take three days to fix it. A full repaint of the fender and the scratched door was necessary. The insurance would also cover a loaner car. But I just used my vintage sports car again after a while, since I still have it.\nDuring the three days I drove the Jaguar to work last week, I had more range anxiety than with the Tesla. Funny isn't it? When the fuel gauge indicated low and the warning light came on, I started calculating in my head how far I would still get. I started worrying if I had my wallet with me and enough money to pay for the gasoline. Instead of just plugging in at home over the night, I had to actually drive to a gas station. When I arrived there to fill the tank with toxic liquid, I had to wait next to the car and inhale the fumes until it was done. At least it was not freezing nor raining. I almost forgot in the past year how expensive fossil fuels are."
		},
		{
			"post_id": 16,
			"title": "Are  batteries a fire hazard?",
			"date_published": 1527158695,
			"body": "Every time an electric car burns down after an accident, it is on the front page of the newspapers. Fossil cars burn all the time, yet these incidents are reported in passing, if at all. This imbalance led to some comments suggesting electric cars posed a fire hazard. This is quite ironic, given the fact that fossil cars carry around large volumes of highly flammable liquids. For a battery to catch fire, a severe structural damage is necessary. For gasoline in contrast, a pipe leaking onto an overheated exhaust pipe or a thrown away cigarette might already be enough. But gasoline powered cars have been around for long, and usually don't blow up like in the movies. People are so used to them that they think they developed a sense for the risks involved.\nElectric cars are still new to a lot of people. New things that have the potential to change habits, are frightening to some people.\nSo lets have a look at the psychology behind the different perspectives. Fear is highly irrational. For example, who is not afraid of sharks? We have been trained for decades to be wary of terrorists. There are multiple studies to put these fears into perspective:\n\n*   [Trump fears terrorists, but more Americans are shot dead by toddlers](https://www.theguardian.com/commentisfree/2017/feb/08/trump-muslim-terrorists-gun-violence-america-deaths)\n*   [You’re 55 Times More Likely to be Killed by a Police Officer than a Terrorist](http://washingtonsblog.com/2015/03/youre-55-times-likely-killed-police-officer-terrorist.html)\n*   [Asteroids a bigger risk than shark attacks, odds indicate](https://www.reviewjournal.com/news/nation-and-world/asteroids-a-bigger-risk-than-shark-attacks-odds-indicate/)\n*   [You’re more likely to be fatally crushed by furniture than killed by a terrorist](https://www.washingtonpost.com/news/monkey-cage/wp/2015/11/23/youre-more-likely-to-be-fatally-crushed-by-furniture-than-killed-by-a-terrorist/?noredirect=on&utm_term=.d200aa21bf88)\n\nWith the fear part sorted out, lets look at the numbers about burning cars:\n[Brennende Elektroautos](https://e-move.at/news/brennende-elektroautos/?cn-reloaded=1)\n_**Per billion kilometers driven, there are 90 burning fossil cars vs only two electric cars!**_\nWhat is left to do for us, is to make E.V.s better known. That would reduce the fear of the unknown, thus reduce those unfunded claims. This is actually the mission of the WAVE trophy. Bringing electric mobility to the people, and demonstrate how practical it has become over the years."
		},
		{
			"post_id": 15,
			"title": "How clean are electric cars really?",
			"date_published": 1527054351,
			"body": "Here is a nice article about different studies coming to different results about how much cleaner electric cars are, than the ones with combustion engines. It is in German:\n[http://www.danzei.de/elektroautoguru-6-wie-sauber-ist-ein-elektroauto-wirklich-welche-studie-hat-denn-nun-recht-video/](http://www.danzei.de/elektroautoguru-6-wie-sauber-ist-ein-elektroauto-wirklich-welche-studie-hat-denn-nun-recht-video/)\nI like the sentence towards the end: \"People buying a Tesla today invest in a cleaner future for all of us. People buying a fossil car throw the money into the past, which will never lead to clean and sustainable mobility.\"\n\nStill my favorite study in this field is the [Well to wheel](https://www.teslarati.com/energy-expert-says-tesla-electric-vehicle-industry-here-stay). It looks at the energy efficiency from how the propellant is sourced and transported until it powers the wheel. The differences are gigantic. With renewable energy in Switzerland, I expect the number to be above 60."
		},
		{
			"post_id": 14,
			"title": "Bitcoin pizza day",
			"date_published": 1526986718,
			"body": "Eight years ago today, the first reported exchange of bitcoin for a consumer product - a pair of Papa John's pizzas - took place.\n[https://www.coindesk.com/he-paid-how-much-coindesk-releases-bitcoin-pizza-day-price-tracker/](https://www.coindesk.com/he-paid-how-much-coindesk-releases-bitcoin-pizza-day-price-tracker/)\nHappy bitcoin pizza day to all of you"
		},
		{
			"post_id": 13,
			"title": "Public evening events",
			"date_published": 1526893388.743,
			"body": "During the WAVE Trophy there are four evenings with interesting public talks:\n[http://www.wavetrophy.com/networking-schweiz](http://www.wavetrophy.com/networking-schweiz)​​​​​​​\nThey are free to attend. Somehow I didn't catch that aspect last year, when I was just following the tour casually online."
		},
		{
			"post_id": 12,
			"title": "WAVE route on the car browser",
			"date_published": 1526845519.648,
			"body": "My car received a couple of over the air software updates lately. The change logs only showed minor improvements. Then somebody at a [STOC](https://teslaclub.ch) meeting told me that the long promised browser update finally arrived. So I went to the car today to check if I also have the improved browser. Page loading times are still not impressive, but it was able to load a couple of pages that caused problems in the past.\nOne very useful site is the road condition report from [TCS](https://www.tcs.ch/de/tools/verkehrsinfo-verkehrslage/aktuelle-lage.php). It also shows what mountain passes are closed which the navigation system doesn't know.\nAnother web site that didn't load before was the one of the [WAVE Trophy](http://www.wavetrophy.com/route-ch2018). Also this site loaded flawlessly today, albeit a bit slow the first time.\n![WAVE Trophy website in the Tesla browser](data/img/TeslaBrowserWaveRoute.jpg)\nThank you Tesla for making our cars even greater over time!\n\nI read from lots of people who use the in car browser almost never, because they were not satisfied with its performance. But I use it actually quite a lot. The explanation might be unexpected at first. Part of the reason to buy this car was to save money in recurrent expenses. Yes it was a huge upfront investment. But we save big time with running costs. The most obvious is the electricity vs. fossil fuels. For the 40'000km I drove in the first year, I payed about CHF 600 for power. With gasoline it would have been about ten times more. Another saving opportunity is that I no longer have a mobile phone data plan. I have wifi at home and in the office. On the road the car has internet and allows me to browse all the info I need."
		},
		{
			"post_id": 11,
			"title": "Spending Bitcoin while charging the car",
			"date_published": 1525286386,
			"body": "When I go some place new, I always check out what Bitcoin accepting venues there are. I usually try to prioritize shops that accept crypto currency.\nWhen I drive some place far away, I have to charge the car on the way. No big deal, usually I can eat, drink or go to the toilet. All those activities, I prefer not to perform in the car while driving anyway. When I'm done, the battery is charged enough to continue the journey.\nBut how cool would it be to combine the two. If there was a restaurant that accepts BTC next to a supercharger, I would eat there for sure. Unfortunately finding this information manually is a hassle. That is how the idea was born to write a simple script to correlate charging stations and Bitcoin shops. I did it only quick and dirty. It could be improved a lot, but I'm not sure that is necessary.\nYou can visit a map with the correlated locations on ZeroNet: [Bitcoin shops at car charging stations](http://127.0.0.1:43110/197RQPCjQg48T5ByLhTh9eZPPyNKR3kfS1/)\nIf you want to have a look at the script that compiles the list or improve it, you can do so at: [bitcoin_supercharger.py](http://127.0.0.1:43110/197RQPCjQg48T5ByLhTh9eZPPyNKR3kfS1/bitcoin_supercharger.py)\nMaybe I will also add the stops of the WAVE to see if there are BTC shops nearby..."
		},
		{
			"post_id": 10,
			"title": "The team name \"Bitcoin\"",
			"date_published": 1524825857,
			"body": "In case you wonder why somebody would advertise for Bitcoin, let me explain. In the past, to make a non cash payment, you had to rely on multiple companies. Each one of them cut a slice of the transaction to make a profit. Companies are for-profit organizations that have a budget for advertisement. Bitcoin in contrast is a peer to peer protocol that cuts out the middlemen, and makes payments as secure and cheap as possible. Because there is no centralized organization that profits from the transactions, there is no central marketing budget. So, like with open source software, we rely on word of mouth and user advocates.\nStarting as team Bitcoin was already my idea last year, but I was too late to find sponsors who would pay the participation fee. I just kept the name for this year's tour. Charles might be more a fan of Ethereum, but I think most people need to understand Bitcoin first, before they could appreciate smart contracts.\nI have been a vocal Bitcoin promoter for seven years. When I first learned about Bitcoin, it was a revelation. It was something that I waited for, without knowing. Back then it was a technical experiment, and I feared it would fail to gain adoption, as so many innovative cool new projects do. I thought that what the nascent project needed the most, was places where it could be actually used to pay for goods or services. That is how I started accepting BTC for paragliding tandem flights in mid 2011.\nThe main appeal to me is that there is now, for the first time on the internet, a payment mechanism that works directly and reliably. When credit cards were designed, the Internet was not around for another couple of decades. When PayPal was founded, they intended something very different from what it has become. Only because it is a centralized organization, it was vulnerable from external corruption. ApplePay and the likes just add on top of the mess.\nTo participate in the Bitcoin echosystem, no approval is necessary. It is open access, open innovation, open source! It is incredibly liberating to be able to open as many accounts as you want to compartmentalize your finances, without paying ever more fees. It is incredibly reassuring to know a merchant receives the money instantly, and you can prove it easily. Also for the merchant it is a big relief not having to worry about chargebacks. The payment is instant and direct. The five different third parties in the chain, that all want a cut, and that all can fail the payment, are no longer involved.\nThe secondary value proposition of Bitcoin is the store of value. While nobody can steal from you when you take a bit of care, it would be nice if the actual value would be a bit more stable. Unlike traditional currencies, no small group of powerful individuals can decide to de-value their nations currency, to fund their wars. It is a currency whose value is determined on the open market. Because Bitcoin is still young and much smaller than ordinary currencies, the lower liquidity causes the price to move more than what we are used to. Unfortunately those swings scare off some people, even when it usually averages out well in the end. Instead the volatility attracts a different kind of people, namely speculators. And the speculation is how Bitcoin is usually portrayed in the mainstream media. This is why it is still important to promote the primary use case for Bitcoin.\nBitcoin brings freedom and self-sovereignty to the people. But freedom has never been granted without the people demanding for it. Gatekeepers and rent-seekers in the current system don't want to loose their grip. A lot of fear, uncertainty and doubt was spread about Bitcoin lately. So we need to do something to make not only the name known, but also what it stands for. This is why I put a BTC sticker on my car."
		},
		{
			"post_id": 9,
			"title": "Schlattli Mobility day",
			"date_published": 1524424560,
			"body": "Yesterday we visited the [eMobility day](https://ebs.swiss/wp-content/uploads/2018/03/Flyer_mobilitaetstag.pdf) at the station of the worlds [steepest](https://edition.cnn.com/travel/article/worlds-steepest-funicular-railway/index.html) funicular.\nThe kids went straight to the Model X, and reiterated how they like it better than the S. I got to test ride a Renault Zoe, a [KTM e-Ride](https://www.ktm.com/e-ride/) and an electric bicycle, that was handed out to me by my cousin. I also wanted to have a closer look at the [Hyundai Ioniq](https://www.hyundai.ch/de/model/ioniq-electric.html), but it was constantly occupied.\nAt the EBS booth, we saw the guys who will also [participate in the WAVE](http://ebs.swiss/wave2018/). They told me that our team was recently featured on Facebook. As I'm not on centralized social media, I could only get a glimpse of that post."
		},
		{
			"post_id": 7,
			"title": "Hi Everyone!",
			"date_published": 1522991191.827,
			"body": "![17361746_1422958384413237_8853562216092776675_n.jpg (701x416)](data/img/post_7_17361746_1422958384413237_8853562216092776675_n.jpg)\n\n[Charles] Hi guys! Excited to be posting here for the upcoming Wave Trophy 2018! Richard has kindly setup our team blog on ZeroNet, a fantastic P2P platform for the decentralised web, powered off Bitcoin. Definitely in line with our theme of embracing future technology.\n\nI love cars - anything to do with mobility intrigues me. I've had the privliege of working with a wide range of vehicle in my work, but I've never driven an electric vehicle cross-country before - exciting!\n\nWe're in the process of procuring sponsors for our charge across Switzerland. Any help with expenses is a big help, particularly since I'll be coming from Singapore.\n\nI'll be posting more regularly now, as the team prepares for the competition. More updates soon!\n\nCharles"
		},
		{
			"post_id": 5,
			"title": "BTC sticker and new tires",
			"date_published": 1522355398.786,
			"body": "Today the car received the big BTC sticker on the hood. And because I can pay with Bitcoin at [Streit Imports](https://www.streit-imports.ch/), I also bought new summer tires and pressure sensors from them. It was rainy today, that is why a nice picture will follow later.\nI bought other stuff with Bitcoin as well in preparation for the WAVE lately. For example a high power extension cord from [Elektro Zollinger](https://elektro-zollinger.ch) and rally name stickers from [Red rock decals](https://www.redrockdecals.com/rally-driver-name-tag-sticker-decal-two-names?nosto=nosto-page-category1).\nPaying with crypto currency is so easy, reliable and hassle free. I really don't want to go back to clunky insecure credit cards, paypal or whatever unreliable means there were in the past.\n\n![installing the BTC sticker](img/sticker.jpg)"
		},
		{
			"post_id": 4,
			"title": "Briefing",
			"date_published": 1521370613.506,
			"body": "Today was the briefing for this years WAVE events. It is the first year with two tours. One is in June along the Grand Tour of Switzerland, the second is in September through Austria. We will participate in the Switzerland tour.\nIn the morning we had a factory tour at [Kyburz](https://kyburz-switzerland.ch), the maker of the [eRod](https://kyburz-switzerland.ch/en/erod) and many smaller electric vehicles. Some people could also test drive the eRod, but the seats were limited.\nAfter the lunch in the canteen of one of the tour sponsors, the tour director Louis Palmer went trough all the important points for the participants.\nView some [pictures in our gallery](/0gallery.bit/?!/g/1EHrpXd3f6CyKooBFtpLhdFk5C3bqFhyg1/wave0briefing). Should you get a strange error message, first click on [our gallery](/1EHrpXd3f6CyKooBFtpLhdFk5C3bqFhyg1) to start seeding my 0gallery hub."
		},
		{
			"post_id": 3,
			"title": "The Team",
			"date_published": 1520454174.745,
			"body": "|                                       |                                     |\n|---------------------------------------|-------------------------------------|\n| ![Richard](img/TeamRichardUlrich.jpg) | ![Charles](img/TeamCharlesWong.jpg) |\n| **Richard Ulrich** | **Charles Wong** |\n| Software Developer for CAD | Autonomous car developer |\n| Switzerland | Singapore |\n\nWe met last November at the [Hack4Climate](http://hack4climate.org) in Bonn Germany. Together with four other guys we were in the same team and [made it to the finalists](/1EwAh4KUfGgRw1re7uyrmTUWKZYV9SHVcW/?Post:27:The+mother+of+all+hackathons).\n\n![Hack4Climate at the UN Climate Conference](img/TeamUnoClimate.jpg)"
		},
		{
			"post_id": 2,
			"title": "The Car",
			"date_published": 1520452448.089,
			"body": "We will participate at the WAVE Trophy with a brown Tesla Model S 85 from late 2013\\. [I bought it in early 2017](/ulrichard.bit/?Post:20) for roughly 61 Bitcoin.\n\nIn the meantime I drove it for almost 40'000 km. Last year it served us extremely well for our [family road trip to Norway](/norwegentesla.bit). We also completed two family ski holidays with the car. It has currently 133'000 km on the clock and still feels like new.\n\nIt has a rated range of 502km which translates to real world average of 400km in summer and 330km in winter. I never drove it to below 5% charge and I usually charge it to 80% every night.\n\n![Tesla in Galtenebnet](img/TeslaBisisthal.jpg)"
		},
		{
			"post_id": 1,
			"title": "Blog created",
			"date_published": 1487627779,
			"body": "On this site, we will blog about our experiences during the WAVE Trophy 2018.\n\nThe best way to read our blog is to install [ZeroNet](https://zeronet.io/) and the [zero protocol handler](https://zeronet.mpa.today/kaffie.bit/test.html) in advance. After doing so, you can browse directly to [zero://wavebtc.bit](http://127.0.0.1:43110/wavebtc.bit).\n\nAlternatively, the blog is also reachable through a ZeroNet proxy such as e.g. \n[http://zeronet.ulrichard.ch/wavebtc.bit](http://zeronet.ulrichard.ch/wavebtc.bit)\n[https://zero.acelewis.com/#wavebtc.bit](https://zero.acelewis.com/#wavebtc.bit)\nThe links may not work every time. The second one randomly redirects to different proxy servers, some of which can be temporarily down, or don't allow adding new sites. If you get an error, just try again, or even better install ZeroNet.\n\nZeroNet doesn't need a server to work. So we don't have to neither buy hosting nor surrender control of our data. You are not tracked when you read our blog. We can edit our blog offline, and synchronize it to the the peer to peer network, when we have internet connection again. This is especially valuable on a tour where we won't have reliable internet connection everywhere."
		}
	]
}