{
	"next_topic_id": 14,
	"topic": [
		{
			"topic_id": 1565519074,
			"title": "You have a friend in prison for many years and can send him a letter with copy-paste from 0net, what do you send?",
			"body": "Is there something on 0net that you think someone in prison for years should know?",
			"added": 1565519073
		},
		{
			"topic_id": 1565523603,
			"title": "If you do crime, you get prize",
			"body": "People are organizing to send hygiene goods to Tarrant and who knows what else.\nWomen send money to rapists.\nKill some guy in prison? Your family outside gets perks.\n\nCrime pays off.",
			"added": 1565523601
		},
		{
			"topic_id": 1565716215,
			"title": "Discord Banned 1397 Accounts and 159 Servers Because of Tarrant/Christchurch",
			"body": "*...on the evening of March 14th when our Trust and Safety team began receiving reports that a disturbing and violent video had just been live-streamed in Christchurch, New Zealand. At first, our primary goal was removing the graphic video as quickly as possible, wherever users may have shared it. Although we received fewer reports about the video in the following hours, we saw an increase in reports of 'affiliated content'. We took aggressive action to remove users glorifying the attack and impersonating the shooter; we took action on servers dedicated to dissecting the shooter's manifesto, servers in support of the shooter's agenda, and even memes that were made and distributed around the shooting.*\n\n*Our team worked around the clock to thoroughly review each report, educate users about the harm of this content, and remove any content that violated our Community Guidelines. Over the course of the first ten days after this horrific event, we received a few hundred reports about content related to the shooting and issued 1,397 account bans alongside 159 server removals for related violations.*",
			"added": 1565716212
		},
		{
			"topic_id": 1565916354,
			"title": "Chomsky favors the estate tax and massive income redistribution--just not the redistribution of his income",
			"body": "One of the most persistent themes in Noam Chomsky's work has been class warfare. He has frequently lashed out against the \"massive use of tax havens to shift the burden to the general population and away from the rich\" and criticized the concentration of wealth in \"trusts\" by the wealthiest 1 percent. The American tax code is rigged with \"complicated devices for ensuring that the poor--like 80 percent of the population--pay off the rich.\"\n\nBut trusts can't be all bad. After all, Chomsky, with a net worth north of $2,000,000, decided to create one for himself. A few years back he went to Boston's venerable white-shoe law firm, Palmer and Dodge, and, with the help of a tax attorney specializing in \"income-tax planning,\" set up an irrevocable trust to protect his assets from Uncle Sam. He named his tax attorney (every socialist radical needs one!) and a daughter as trustees. To the Diane Chomsky Irrevocable Trust (named for another daughter) he has assigned the copyright of several of his books, including multiple international editions.\n\nChomsky favors the estate tax and massive income redistribution--just not the redistribution of his income. No reason to let radical politics get in the way of sound estate planning.\n\nWhen I challenged Chomsky about his trust, he suddenly started to sound very bourgeois: \"I don't apologize for putting aside money for my children and grandchildren,\" he wrote in one e-mail. Chomsky offered no explanation for why he condemns others who are equally proud of their provision for their children and who try to protect their assets from Uncle Sam. Although he did say that the tax shelter is okay because he and his family are \"trying to help suffering people.",
			"added": 1565916350
		},
		{
			"topic_id": 1567571648,
			"title": "Someone should live stream a suicide on Youtube and Twitch",
			"body": "Then we record it and stream the thing over and over until the site(s) get targeted by the glowniggers the way 8chan was. Make them taste of their own medicine.",
			"added": 1567571643
		},
		{
			"topic_id": 1567646630,
			"title": "Satisfied Yet?",
			"body": "First they:\nBanned us from Facebook\nPurged us from Twatter\nand 86'd is from YouTube\nBut you did nothing because you're not a Russian Bot\nThen they cane for the Daily Stormer but you did nothing because you're not a Nazi\nTHEN they took down\nWikileaks\n8 Chan\nand Encyclopedia Dramatica\nAnd you did nothing because you're a pussy\nNow what will happen when they come for you Anon",
			"added": 1567646624
		},
		{
			"topic_id": 1567851023,
			"title": "How to Be Happy",
			"body": "1- Grab a big knife.\n2- Plunge it into your stomach.\n3- cut sideways.\n4- start pulling your intestines out.\n5- get a friend to chop your head off with an axe",
			"added": 1567851016
		},
		{
			"topic_id": 1567862360,
			"title": "Someone is Spamming Nembutal Ads on Medium",
			"body": "In every fucking language, these fuckers will take any and all customers.\nFor further inquire they offer a phone number attached to a chat app that I would rather not name.\nWhich is nice, because if you use that app, you really should kill yourself.\n\nIf they die from the venom or die from destitution after being scammed, either way the future looks bright.",
			"added": 1567862352
		},
		{
			"topic_id": 1568139498,
			"title": "Kiwi Farms was Hacked",
			"body": "Site is down until Josh can reinforce the security.",
			"added": 1568139489
		},
		{
			"topic_id": 1568204751,
			"title": "Why women get more pretty when with facial bruises?",
			"body": "It's like something from ours ancestors teaching us something important.\n\nWithout a shadow of doubt, it is the best make-up a woman could wear.\n\nIf I was a woman I'd ask for men to beat me in the face once in a while.",
			"added": 1568204741
		},
		{
			"topic_id": 1569711666,
			"title": "A Chat About 0net Spotted in the Wild",
			"body": "11:58 AM - _mastro: God I feel so guilty about the CP \n11:58 AM - _mastro: I wish it didn't turn me on to see that shit \n11:59 AM - _mastro: It's not just regular child porn either, it's hurtcore now \n11:59 AM - _mastro: I just like to see children suffer :( \n11:59 AM - _mastro: Oh well, no point in thinking about it too much \n11:59 AM - _mastro: Time to load up ZeroNet and find some more, lol!",
			"added": 1569711655
		},
		{
			"topic_id": 1573297973,
			"title": "If you’re gonna commit suicide don’t tell anybody",
			"body": "They’ll try to talk you out of it. Just do it. Not saying I want anyone to commit suicide. Just saying. It’s landed me in jail before.",
			"added": 1573297961
		},
		{
			"topic_id": 1574501795,
			"title": "Did Osama Bin Laden learn Calculus?",
			"body": "Do terrorists need to learn calculus? Does it make them more effective?",
			"added": 1574501782
		}
	],
	"topic_vote": {},
	"next_comment_id": 20,
	"comment": {
		"1565530789_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 1,
				"body": "> [technomage](#comment_1_1GZydtKP7qkz7wdtk5o5RWgZDKu43VKSGL): If on windows, stop the zeronet service\n\nYou are fucked in the head.",
				"added": 1565532571
			}
		],
		"1565529446_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 2,
				"body": "That BLACKED guy needs more helicopters, don't you understand.",
				"added": 1565533592
			}
		],
		"1565777168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 3,
				"body": "Put my jaw to good use eating and drinking a lot.",
				"added": 1565790995
			}
		],
		"1565767588_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": [
			{
				"comment_id": 4,
				"body": ">licensed\ngay",
				"added": 1565791631
			}
		],
		"1565969344_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 5,
				"body": "Her hole will go back to what it was if she does not have sex for a while. No harm done.",
				"added": 1565973974
			}
		],
		"1568153469_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 6,
				"body": "Why does not ebola-chan strike the wicked?",
				"added": 1568157450
			}
		],
		"1568498469_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 7,
				"body": "Faggot pedophile commie Jews are not welcome. Take Thunberg, diddle her in swedistan and fuck off forever.",
				"added": 1568501983
			},
			{
				"comment_id": 8,
				"body": "> [defconzero](#comment_15_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE): killing kids\n\nKids die everyday, who cares. Fuck them, fuck everybody.",
				"added": 1568617691
			},
			{
				"comment_id": 10,
				"body": ">The biggest thing to watch is to ensure that Richard does **NOT** stay with anyone you care about. In both instances of which I am aware, [names omitted], the homeowner actually burned the sheets after Richard left. Simply throwing them away was insufficient.",
				"added": 1570337173
			}
		],
		"1570059860_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 9,
				"body": "My fist can connect to your bowel if you want.",
				"added": 1570062636
			}
		],
		"1572464062_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 11,
				"body": "Get good, faggot.",
				"added": 1572468381
			}
		],
		"1572403703_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 12,
				"body": "He is dog food now.",
				"added": 1572468490
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 13,
				"body": "Jump from a high building.",
				"added": 1573303767
			},
			{
				"comment_id": 14,
				"body": "> [kaar4bears](#comment_31_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr): If I happen to fall onto grass, car, human etc\n\nFalse propaganda from antis. Physics don't lie. If it is high enough for your weight, you die.",
				"added": 1573306678
			},
			{
				"comment_id": 15,
				"body": "Not going to repeat myself.",
				"added": 1573306847
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 16,
				"body": "Rwanda was the first in Africa to make a smartphone.\nGuess what else happened in Rwanda? A massacre that killed a lot of niggers.\nCould it be that they killed the subhumans that were holding them back?",
				"added": 1573922300
			}
		],
		"1574102813_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 17,
				"body": "Did the boy became a cop and apprehended the senile? That would be more interesting.",
				"added": 1574106533
			}
		],
		"1574118268_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": [
			{
				"comment_id": 18,
				"body": "I am dead and buried.",
				"added": 1574118299
			}
		],
		"1574115241_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 19,
				"body": "I die, but from my dead body a beautiful tree grows.",
				"added": 1574118381
			}
		]
	},
	"comment_vote": {}
}