{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1609237597_12fYGWhHCWeiKavtMcRyHppHvH9RJF8ViC": 1,
		"1610594001_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610573261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1610594001_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "I can't even imagine it. I'm not classy, but sure ain't low class enough to comprehend that level of wannabe chimp-with-a-gimp-proud-to-be-loud low class. \"Ch'na took are jerbs!!!\" ; nope, your free market wheeling and dealing jet setting cunt republican crapitalist scumbag corporations and republican lawmaking enablers FUCKING GAVE THEM AWAY. Corps didnt want to make 2‰ less profit, so they gave them to the free market, aka G-Ds PlAn. Fuck off trumpians, you have misplaced fervor and zealotry, not critical thinking skills, or any thoughts at all, besides maybe sucking dogshit off of trumps limp micropenis, after he just accepted your life savings as a donation, and made a sterile donation to your moms dog's ass. Have fun in your walled off red hellscape your kind will inevitably congregate to, after secession from the US, all your dreams will come true! Just look at the UK, a shining example of red raw power making progress against the vile blue sewage leaking from every electronic device. Go to your own country you stupid fucking cunts, and suck a dead dogs ass, itll taste sublime, cuz youll be free...FREEEEEDDDDOOOOMMM",
				"added": 1610596490
			}
		],
		"1610509513_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 2,
				"body": "Machiavelli is rolling in his grave, this isnt a deep conspiracy flash of insight, its the start of a kamala dominatrix fanfic, and you end up in her dungeon underneath the trapdoor in trump towers adult diaper changing room at TruDumps resort and spa. The d is silent, but you low class cretins wouldnt know about that. Try again with a little more fear, uncertainty, doubt, and malignant incompetence and you may hit it spot on",
				"added": 1610597198
			}
		],
		"1610573261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "I think the real show begins when his (p)residency at the shite house ends (silent p; for nothing accomplished except metamorphic malignant mental-retardation, making monstrous multitudes march, meandering and mulling multiple meals, mutating from mild moron, to medium moron to maximum, to mean megalomaniacal maggot, munching through the minds of our most malleable manbabies, making a militant mass of mind-addled, mung breathed mutineers, that need to be mangled and marked within the free marketplace of ideas, where foolish pseudopatriots stride ahead boldly, where few have gone before with such tarnish and rot, and survived)  \n\np.s. Fuck off traitorous scum, ónce and for all",
				"added": 1610598974
			}
		]
	},
	"comment_vote": {}
}