{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Certifica cualquier archivo digital o contenido web en la blockchain",
			"body": "Una plataforma real de prueba de existencia en la blockchain www.hashingdna.com/es",
			"added": 1575317404
		}
	],
	"topic_vote": {
		"1_14tvQQLMmtDF2Wd7NozrVmymbi2qdDqpC2": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": [
			{
				"comment_id": 1,
				"body": "Hola bitbit2, \nllevo en internet desde el año 1995, en ese momento yo tenia 15 años, aunque quizas a ti te gusten incluse más jovencitos aún.Recuerdo con mucho afecto aquellos dias, donde se estaba fraguando a gran velocidad,  un cambio de paradigma tecnologico como fue internet. Habia una libertad y hasta gran grado de anonimato, muy similar al que crees que tienes ahora. La técnologia era fantastica, pero el uso que le han dado las personas tiene sus luces y sombras, evidentemente tu frecuencia mental no esta en la sombra, sino en la más perversa de las oscuridades.\nLo más aterrador, és que alguien que sufre la enfermedad mental de excitarse con pobres victimas que son niñós y por lo tanto, no estan formados, ni fisica ni mentalmente y que arrastraran un trauma de por vida, lo frustrante, es que 24 después de usar internet, proyectos totalmente legitimos como zeronet, se vean ensuciados por gentuza como tu. En su dia internet fué en sus  inicios, algo que se vendió la idea a la gente, a través de los medios de la epoca mendiante ingeniería social, amplificando las sombras en lugar de las luces de la tecnologia, ya que estaba lleno de gente muy peligrosa, pedofilos, maleantes, etc, y és cierto que los hay, pero no és cierto que este lleno.\nPor suerte, hay mucha más gente buena que mala en este mundo, pero la perversa realidad és que los malos soys los que jodeis a los demas.Igual que ha pasado con el bitcoin, toda la maquinaria propagandistica de la banca tradicional ha hecho bandera de las sombras en lugar de las luces de la técnología.\nTe imagino a ti, en una solitaria habitación, con tu falta de autoestima, tu perversa cabecita como habrá dado con proyectos como zeronet? No habrá sido por una inquietud técnica no, quizas simplemente estés en un grupo de pervertidos en telegram, ya que en whatsap ya no os es seguro, donde compartis cualquier tipo de deleznable material, pensadote que estais tecnicamente protegidos, tranquilo, és cuestión de tiempo que la gentuza como tu acabe donde se merece. Pues todas las cautelas técnicas que crees que has tomado, no te serviran de nada el dia que tu instinto depravado te delate, y formes parte de la corrección necesaria de tantas cosas a corregir que tenemos pendientes aqui, en el planeta tierra, tu mente, és una de esas correcciones necesarias.\nNo quiero un internet controlado ni censurado, pero si tienes un problema mental, que no solo te afecta a ti, sino que destroza de por vida a las victimas que la sufren, o ponés de parte en corregirte, o serás corregido por los que no aceptamos la existencia de gentuza como tu. Nunca una frase tan breve como la tuya, me habia hecho, teclear tanto. Ojalá la buena gente, que és mayoría, conozcan y usen herramientas como esta para organizarse y hacer un mundo mejor.",
				"added": 1575157659
			}
		]
	},
	"comment_vote": {
		"1_14tvQQLMmtDF2Wd7NozrVmymbi2qdDqpC2": 1
	}
}