{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1530191313_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1530187949_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "Thank you for this. Added.",
				"added": 1530492314
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 2,
				"body": "ZeroTalk should have parent comments like Reddit. ZeroTalk seems much more chaotic than Reddit.",
				"added": 1530492484
			}
		],
		"1530568658_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Blocklists are fucking A+ Thank the Devs for this. Added to my list.",
				"added": 1530589243
			}
		],
		"1530089348_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 4,
				"body": "> [mansoner](#comment_3_1ZhXpghGRhcPhb4kebuHhj1EUdLHkdPFG): In the official law children have no rights, because they have owners. Why? Because owners are responsible for actions of the children. In realty You can be responsible ONLY for other person actions IF you tell him to do something (give an order or even ask them to do something for you). In any other case You can't be responsible for actions of any other being (like another human, dog, bird or whatever). In our country we just kill family members of people who think someone can be responsible for someones other actions \"just like that\" (in worst case scenario of course). So You have to choose between \"the owner method\" (the owner can do ANYTHING with people/animals he owns), or \"the proper\" method (where the responsible is the person giving the order). You Can of course \"go by the law\", but I don't recommend it. The police won't help You and we will find Your family anyway.\n\nWhat? Children certainly have rights. That is why we rightfully take children away from neglectful/ abusive parents. Children do not have \"owners\". They are independent human beings with minds of their own. But they are young and immature, and should be protected from certain things. They do not have the ability to consent to drugs/ alcohol/ sexual activity. Children have privacy rights, but to what extent? Less than an adult certainly, they NEED to be taken care of and raised with good ethics and life lessons, not to mention food and other rights. Kids have the right to a certain level of independence from their parents, a right that grows as the child grows. Online? Everyone has the right to privacy and anonymity. Fuck mass surveillance. It is a right as neglected for children as much as it is neglected for adults.",
				"added": 1530591371
			}
		],
		"1530647351_12W2w5y4HAkMJ7hZhmfUv2SYVe28s5tVwy": [
			{
				"comment_id": 5,
				"body": "Sounds like a scam but okay",
				"added": 1530667223
			}
		]
	},
	"comment_vote": {}
}