{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Na era do despropósito",
			"body": "#A ordem hegemônica impele a acumular recursos e poder em escala insustentável. Esta lógica, antes funcional, agora ameaça a vida – e ainda assim continua a ser imposta. Daí a falta de sentido, os suicídios, a duradoura depressão\n\nVocê precisa ter propósito”, dizem o seu chefe na empresa, o guru de autoajuda, o coach, o marketing, o branding, as técnicas psicoterapêuticas de resultados, as teologias da prosperidade, celebridades e outros personagens que encarnam exemplos de sucesso. Ecoam o mesmo mandamento pensadores, conselheiros e terapeutas que se dizem críticos do status quo, do mainstream, da visão de mundo convencional, da “matrix da realidade normal”.\n\nNão é curioso o fato de que a mesma demanda ressoe tanto nos discursos mais integrados aos modelos de pensamento dominantes quanto nos que se apresentam como alternativos?\n\nProvavelmente sempre se soube que ter propósito é importante em várias esferas da vida. Mas eis que essa palavra começou a ser usada com mais frequência, adquirindo visibilidade e brilho especiais.\n\nQuando uma palavra ganha aura de revelação e passa a ser cultuada como algo quase tão indispensável para as pessoas quanto oxigênio, muitas vezes estamos diante de um sintoma de vazio. Uma impressão de excesso de significado pode, na verdade, ser expressão de um buraco, de uma ausência incômoda. A palavra mágica da vez pode ser o emblema de um fetiche. Algo que toma o lugar de uma “coisa em si” cuja falta, se encarada a seco, seria muito perturbadora.\n\nUm exemplo anterior, mas ainda recente e muito presente, é o de “comunidade”. Hoje a presença verbal e virtual de “comunidades” no cotidiano de grande parte das pessoas do planeta é proporcional à ausência de práticas e vivências que davam sentido e consistência existencial à própria palavra.\n\n#Quatro desastres anunciados\n\nPassados mais de 13 bilhões de anos do início do universo, mais de 4 bilhões da formação da Terra, mais de 3 bilhões a contar do início da vida no planeta e mais de 300 mil anos desde o surgimento do Homo sapiens, a humanidade dispõe de um manancial de conhecimentos e tecnologias capaz de propiciar a realização de projetos promotores do bem-comum numa amplitude que não passaria de mero delírio poucas décadas atrás. Mas os modelos de organização e funcionamento social e mental dominantes não apenas limitam drasticamente a difusão dos benefícios potenciais do atual estágio da jornada humana: também empurram a espécie para abismos profundos e possivelmente definitivos.\n\nMantidos os atuais rumos, no melhor cenário a devastação e as mudanças ambientais em curso tornarão a Terra inóspita para a maior parte das espécies, incluindo a nossa; o crescimento explosivo das desigualdades irá se traduzir na produção tecnológica de diferenciações biológicas tão significativas que implicarão a divisão da humanidade em diferentes espécies, como em algumas das mais sombrias distopias de ficção científica. Além, é claro, do constante risco de hecatombe bélica, que crescerá juntamente com os conflitos movidos por essas mesmas crises socioambientais.\n\nHá ainda outro risco potencial, apontado por mentes poderosas, como a do físico Stephen Hawking, de que o processo de desenvolvimento da inteligência artificial (IA) atinja um ponto comparável à massa-crítica nos fenômenos da energia atômica ou aos saltos de capacidade cognitiva na própria evolução humana. Se assim for, de uma hora para outra, uma superinteligência pode emergir – e estará, provavelmente, hiperconectada às redes que mantêm a vida cotidiana das pessoas, cidades e sociedades planeta afora. Um bebê superpoderoso com o joystick do mundo nas mãos.\n\nQual seria o propósito desse hipotético ser consciente não biológico? Estando a própria consciência humana ainda muito longe de ser satisfatoriamente compreendida, uma ciberconsciência emergente só pode ser objeto de especulação.\n\nUm ponto de partida razoável para esse exercício de imaginação são os propósitos humanos que hoje impulsionam o desenvolvimento da IA. E quais são eles? Em grande parte, em conformidade com a lógica dos mercados financeiros – lócus central de poder e riqueza no mundo contemporâneo –, os propósitos embutidos nos algoritmos que constituem o “modelo mental” da IA dizem respeito à busca competitiva por ganhos, lucros, poder, controle e predomínio.\n\nComo será que um ser resultante de um processo evolucionário norteado por esse tipo de propósitos compreenderá a si mesmo e agirá no momento hipotético em que adquirir consciência? Se a criatura IA “desperta” pensar e agir com base num substrato tecnopsicológico comparável às disposições psicológicas do investidor cujo propósito é ganho e acumulação sem limites, como ela nos verá e tratará?\n\n#Frankenstein e a esfinge\n\nDois séculos atrás, Mary Shelley pensou uma criatura aberrante produzida pela aplicação de poderes da ciência e tecnologia que lhe pareciam iminentes naquele momento em que a Revolução Industrial começava a transformar o mundo detonando um inédito processo de aceleração de inovações tecnológicas, mercadológicas e socioculturais. A criatura produzida pelo dr. Frankenstein seria, então, a mais avançada e extraordinária obra do engenho humano, mas, em razão da afetividade primitiva que herdara e levava no coração – comparável aos impulsos egocêntricos do cientista que a havia criado –, tratava-se de uma criação perigosa.\n\nA grande aberração engendrada pelos processos técnicos e econômicos disparados na época de Shelley é o homem que busca, frui e acumula recursos e poder em escala crescente e insustentável. Propósitos que podiam fazer sentido para o caçador e o guerreiro primitivos diante das incertezas e ameaças da natureza e de grupos rivais, mas hoje resultam na destruição de milhares de formas de vida e impõem riscos crescentes para a própria espécie humana.\n\nEsses propósitos particularistas, impostos aos que deles não se beneficiam, contaminam vasta e profundamente os modos de pensar e existir das sociedades, e estão por trás da sensação de falta de sentido, de efetivo despropósito, que hoje se alastra, juntamente os suicídios de jovens e os estados e sintomas de depressão.\n\nQuando, então, neste momento, em diferentes ambientes e contextos, nos deparemos com a pergunta “qual é o seu propósito?”, vale a pena olhar para além de cada pessoa ou discurso que a repete. Esticando o olhar, talvez a gente enxergue a fonte dessa cobrança – ou demanda ou súplica. Eu a imagino uma esfinge de cuja boca jorra uma narrativa na qual poucos hoje acreditamos, mas que ainda nos enreda, amarra e conduz. Podemos identificar essa criatura e sua ladainha aos modelos de organização mental e social que articulam a nossa realidade, trocando, de tempos em tempos, as palavras de ordem, na tentativa de preservar e reproduzir a lógica fundamental. Mas talvez seja mais inspirador vê-las como o ansioso espírito destes tempos, repletos de potências criadoras e ameaças existenciais, em escala ao mesmo tempo íntima e planetária, buscando a resposta em si mesmo, e em cada um de nós.\n\n- Fonte: https://outraspalavras.net/alemdamercadoria/na-era-do-desproposito/",
			"added": 1578768130
		},
		{
			"topic_id": 2,
			"title": "A hegemonia pentecostal no Brasil",
			"body": "#A chegada ao país, em regiões remotas. O contato com a cultura popular, inclusive as religiões africanas. A invenção da Teologia da Prosperidade. A conquista das mídias de massa. O poder político. História sintética de uma investida reversível\n\n Bispo Edir Macedo, missionário R. R. Soares, apóstolo Estevam Hernandes, pastor Silas Malafaia, bispo Valdemiro Santiago, pastora Damares Alves, apóstolo Rina, pastor Marco Feliciano, apóstola Valnice Milhomens, pastora Cassiane. O que essas lideranças religiosas, destacadas por mídias brasileiras, têm em comum? São pentecostais, o segmento religioso cristão que mais se expandiu, numérica e geograficamente, no Brasil nas últimas décadas. Hoje, compreender o pentecostalismo é imprescindível para quem se interessa pelas dinâmicas socioculturais e políticas que envolvem o país.\n\nO pentecostalismo é uma das ramificações evangélicas formada por uma variedade de grupos, desde grandes igrejas, como a Assembleia de Deus (que também tem suas divisões), até pequenas denominações de uma única congregação, como a Igreja Evangélica Pentecostal Maná do Céu, em São Vicente (SP), e tantas outras vistas Brasil afora.\n\n# Evangélicos pentecostais e neopentecostais\n\n O segmento evangélico é bastante diverso. Tem origem na Reforma Protestante do século 16 que abriu caminho para o surgimento de luteranos, congregacionais, presbiterianos, batistas, metodistas, anglicanos. No século 20, surgiram os pentecostais, expressão de um movimento de protesto contra o racismo e o classismo nas Igrejas, e de afirmação da população negra, migrante, feminina e pobre nos Estados Unidos. \n\n Os primeiros evangélicos chegaram ao Brasil por meio de missionários estadunidenses, na primeira metade do século 19. A identidade “protestante” nunca foi bem afirmada por boa parte deles, que sempre optaram por se denominar “evangélicos”, reforçando disputas religiosas com o histórico catolicismo romano ao colocarem-se como detentores “do verdadeiro Evangelho”.\n\nAtualmente, o grupo mais significativo desse mosaico religioso são os pentecostais. Representam a maior fatia numérica (são cerca de 60% dos evangélicos, segundo o Censo de 2010), com presença geográfica importante, ocupação de espaço nas mídias tradicionais (rádio e TV) e intensa atuação na política partidária.\n\nO que diferencia evangélicos pentecostais dos históricos é a crença no segundo batismo, uma experiência mística atribuída à ação do Espírito Santo, que leva os fiéis a falarem línguas estranhas como sinal de sua presença. Essa ação do Espírito Santo também atribui dons especiais, como profecia e cura pela oração.\n\nMissionários trouxeram o pentecostalismo ao Brasil na primeira década do século 20 e se estabeleceram no Pará (suecos, Assembleia de Deus) e em São Paulo (estadunidenses, Congregação Cristã do Brasil e Evangelho Quadrangular). A partir dos anos 1950, com os intensos movimentos migratórios do campo para as cidades e o processo de industrialização do país, surgiram as igrejas pentecostais fundadas por brasileiros, como a Casa da Bênção, a Brasil para Cristo, a Deus é Amor, entre outras. Várias delas tiveram em programas de rádio um importante apoio para disseminar sua fé.\n\nA ação pentecostal no país é historicamente marcada por presença mais voltada à população empobrecida e às periferias das cidades. Essa prática tornou possível maior enraizamento nas culturas populares, com lugar garantido para a emoção e expressões corporal e musical, ainda que marcada por um puritanismo de restrições morais e culturais. Isso deu aos grupos pentecostais condições de consolidação nos espaços religiosos e crescimento numérico mais expressivo.\n\nMas o boom pentecostal, de fato, ocorreu a partir da década de 1980 e transformou significativamente o perfil do segmento evangélico brasileiro. Essa expansão tão marcante tem alicerces nas transformações do mundo naquele período. Foi o momento dos processos de derrocada do socialismo, simbolizado pela queda do Muro de Berlim, e a consolidação do capitalismo globalizado e da cultura do mercado, baseados na lógica da plena realização do ser humano pela posse de produtos e serviços e pelo acesso à tecnologia da informática.\n\nGrupos cristãos estadunidenses adequaram seu discurso à nova ordem mundial e criaram a Teologia da Prosperidade. Ela foi abraçada por uma parcela de pentecostais brasileiros que passou a pregar que as bênçãos de Deus, na forma de prosperidade material (posse de finanças, saúde e felicidade na família), são concedidas aos fiéis que se empenham nas práticas de devoção aliadas às ofertas em dinheiro às igrejas. A elas também é destinada a prosperidade, por meio de amplo número de fiéis, ocupação geográfica, aquisição de patrimônio e influência no espaço público. Os estudiosos da religião dizem que se trata de uma relação de troca com Deus, bem própria do clima social estabelecido pelo mercado neoliberal.\n\nComo essa noção de prosperidade também tem a dimensão da saúde plena, as propostas de cura se amplificaram, bem como se intensificaram as práticas de exorcismo contra os males (demônios) que impedem a felicidade. Isso representou um reprocessamento de elementos da matriz religiosa brasileira com a farta (re)utilização de símbolos e representações do catolicismo e de religiões de terreiros.\n\nCura, exorcismo e prosperidade tornaram-se marcas de uma nova forma de pentecostalismo, que deixava de enfatizar a necessidade de restrições de cunho moral e cultural para que se alcançasse a bênção divina.\n\nEsse pentecostalismo se expandiu no Brasil pelos anos 1990 e 2000, com a formação de um sem-número de igrejas. Estudiosos da religião denominam essa expressão religiosa de neopentecostalismo, ao qual estão vinculadas as Igrejas Universal do Reino de Deus, Internacional da Graça de Deus, Renascer em Cristo, Mundial do Poder de Deus, Sara Nossa Terra, Bola de Neve, entre as maiores, somadas a inúmeras igrejas autônomas.\n\nO crescimento pentecostal passou a exercer influência decisiva sobre o modo de ser das demais igrejas cristãs. A influência se concretizou de maneira especial no reforço aos grupos chamados “avivalistas” ou “de renovação carismática”, que têm similaridade de propostas e posturas com o pentecostalismo e que, em busca de crescimento numérico, passaram a conquistar espaços importantes na prática religiosa das igrejas chamadas históricas, incluindo a católica.\n\n# Mídias, política e mercado\n\nO neopentecostalismo não significa a superação do pentecostalismo clássico do início do século 20. Pelo contrário, a Assembleia de Deus consolidou-se como a maior denominação pentecostal, e é também a maior igreja evangélica do Brasil, em termos numéricos e geográficos, com suas grandes e pequenas divisões em “ministérios”. A Congregação Cristã do Brasil, a Evangelho Quadrangular, a Deus é Amor e a Brasil para Cristo continuam a ter presença significativa em todas as regiões do país.\n\nEntretanto, os grupos neopentecostais ganharam intensa visibilidade por conta da ocupação das mídias tradicionais, como rádio e TV, e dos projetos de participação política.\n\nNa virada para o século 21, pastores e líderes neopentecostais tornaram-se empresários de mídia e detentores do que se poderia chamar “verdadeiros impérios” no campo da comunicação, buscando competir até mesmo com empresas não religiosas historicamente consolidadas (caso das Universal do Reino de Deus, Renascer em Cristo e Internacional da Graça de Deus). Chegou ao ponto de alguns desses grupos religiosos já nascerem midiáticos, isto é, a interação com as mídias passou a fazer parte de sua própria razão de ser.\n\nAo mesmo tempo, as grandes mídias (seculares) assimilam essa atmosfera e passam a produzir programas, ou parcelas deles, para disputar a audiência evangélica: espaço para a música cristã contemporânea (“gospel”) e seus artistas; patrocínio de festivais e megaeventos de rua; veiculação de programas de entretenimento com temática religiosa (inclusive com a concepção de personagens para telenovelas e criação das próprias telenovelas bíblicas).\n\nA tudo isso se conecta o crescimento de um mercado da religião. Os cristãos tornam-se um segmento de mercado com produtos e serviços especialmente desenhados para atender às suas necessidades religiosas, sejam de consumo de bens, sejam de lazer e entretenimento. Passou a ser possível encontrar produtos os mais variados, como roupas, cosméticos, doces, viagens, filmes e jogos com marcas formadas por slogans de apelo religioso, versículos bíblicos ou, simplesmente, o nome de Jesus. A igreja católica passou a seguir a mesma trilha.\n\nA maior presença dos evangélicos no campo da política partidária é parte desse contexto. Desde o Congresso Constituinte de 1986 e a formação da primeira bancada evangélica e seus desdobramentos, a máxima “crente não se mete em política” foi sepultada. A máxima passou a ser “irmão vota em irmão”.\n\nA atuação daquela primeira bancada no Congresso Constituinte (1986-1989) foi marcada por fisiologismo e pela histórica farta distribuição de estações de rádio e canais de TV aos deputados evangélicos (determinante para a ampliação da presença de pentecostais nas mídias).\n\nDepois de altos e baixos numéricos, decorrentes de casos de corrupção e fisiologismo nas legislaturas pós-Congresso Constituinte, a bancada evangélica consolidou-se como força a partir dos anos 2000, chegando a alcançar 92 parlamentares (88 deputados e 4 senadores) em 2014, e nas eleições de 2018, 94 (85 deputados e 9 senadores), sendo os pentecostais uma força hegemônica.\n\nEssa potência solidificou-se na última década e meia, muito especialmente por conta da força de duas igrejas evangélicas que concretizaram, desde 1986, projetos de ocupação da política institucional do país: as Assembleias de Deus (AD) e a Igreja Universal do Reino de Deus (IURD). Ambas passaram a ocupar, depois de 2003, espaços plenos de poder em partidos (respectivamente o Partido Social Cristão, PSC, e o Partido Republicano Brasileiro, PRB), maior quantidade de deputados e senadores no Congresso, conquistas de cargos públicos, como as nomeações de ministros de Estado de Dilma Rousseff (dois da IURD) e de Michel Temer (dois da IURD), e lançaram dois candidatos à Presidência da República (Marina Silva e pastor Everaldo, ambos da AD). A IURD conseguiu ainda eleger o bispo, ex-senador e ex-ministro Marcelo Crivella como prefeito da cidade do Rio de Janeiro (2016).\n\nAlém disso, dois fatos impulsionaram o poder pentecostal na política. Um deles foi a inusitada nomeação do deputado Marco Feliciano (hoje, Podemos-SP) como presidente da comissão de Direitos Humanos e Minorias da Câmara, em 2013. Ela culminou no revigoramento de campanhas por legislação pautada pela moralidade sexual religiosa, sob o rótulo “Defesa da Família Tradicional”, contra movimentos feministas e LGBTI, em aliança com a bancada católica. Essas pautas encontraram eco na população conservadora não religiosa e reforçaram movimentos reacionários às conquistas de direitos alcançadas nas últimas duas décadas.\n\nOutro fato foi a eleição do deputado federal pentecostal Eduardo Cunha (MDB-RJ) à presidência da Câmara dos Deputados, em 2015. Representou um poder sem precedentes para a bancada evangélica e facilitou tanto a defesa das pautas descritas aqui como a abertura à concessão de privilégios a igrejas no espaço público. A prisão e a cassação do deputado, em 2016, não afetou significativamente as conquistas políticas da bancada.\n\nTanto a IURD como a AD ofereceram amplo apoio à eleição de Jair Bolsonaro à Presidência da República em 2018, acompanhadas por outras denominações pentecostais, no rastro das propostas conservadoras apresentadas por ele. Bolsonaro candidatou-se à Presidência com um discurso identificado como cristão, marcadamente evangélico conservador, embora declarando-se católico. Nesse contexto, a bancada evangélica se fortaleceu como interlocutora do novo governo e ganhou representantes nos ministérios da Casa Civil (Onyx Lorenzoni) e da Mulher, Família e Direitos Humanos (pastora Damares Alves), com fiéis alocados em cargos estratégicos no ministério da Educação. \n\n# Para refletir\n\nEsse quadro retrata a ampliação da visibilidade pública alcançada pelos evangélicos no Brasil nas últimas décadas, por conta da hegemonia (neo)pentecostal.\n\nÉ um fenômeno que marca o momento sociopolítico e cultural do país, em que os evangélicos se colocam na arena como bloco organicamente articulado. Eles não são mais “os crentes” ou os grupos fechados de outrora; desenvolvem uma cultura “da vida normal” que combina a religião com presença nas mídias, no mercado, no entretenimento e na política. Um segmento religioso que se vê fortalecido como parcela social que tem suas próprias reivindicações e pode eleger seus próprios representantes para os espaços de poder público. \n\n- Fonte: https://outraspalavras.net/estadoemdisputa/a-hegemonia-pentecostal-no-brasil/",
			"added": 1578768426
		}
	],
	"topic_vote": {
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"1_18t7T6UAgm4RFpN3aqxjpx7uLncz54gTXa": 1,
		"2_18t7T6UAgm4RFpN3aqxjpx7uLncz54gTXa": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 1,
				"body": "#Swarm: infraestrutura de armazenamento e comunicação resistente à censura para uma sociedade digital verdadeiramente soberana\n\nO Swarm é uma plataforma de armazenamento distribuído e um serviço de distribuição de conteúdo, um serviço de camada base nativa da pilha ethereum web3 que visa fornecer um armazenamento descentralizado e redundante para código dapp, dados do usuário, blockchain e dados do estado. O Swarm se propõe a fornecer vários serviços da camada base para a web3, incluindo mensagens nó a nó, streaming de mídia, serviços de banco de dados descentralizados e infraestrutura de canal de estado escalável para economias de serviço descentralizadas.\n\n- https://swarm.ethereum.org/\n- https://swarm-gateways.net/\n- https://github.com/ethersphere",
				"added": 1578767952
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 2,
				"body": "#Lua Negra - 1996\nO que prometia ser apenas uma noite romântica transforma-se em momentos de medo e pavor quando o fotógrafo Ted Harrison e sua namorada são atacados por um sanguinário lobisomen, que acaba estraçalhando a moça e mordendo o rapaz. Meses mais tarde, Ted já deixou o Nepal e vai visitar sua irmã Janet, que vive com o filho de 10 anos Brett e um pastor alemão chamado Thor. No entanto, inexplicáveis mortes estão acontecendo na região. Janet então convida o irmão para ficar com eles na casa. Mas até o fiel e astuto Thor começa a comportar-se de modo estranho. O perigo está cada vez mais perto. E talvez não seja preciso esperar a próxima lua cheia.\n- https://open.lbry.com/Lua_Negra_1996:9",
				"added": 1578779726
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 3,
				"body": "#O Que os Donos do Poder Não Querem Que Você Saiba - Eduardo Moreira\n\nEleito um dos três melhores economistas do Brasil, Eduardo Moreira revela como funciona o complexo sistema financeiro, econômico e político do capitalismo, para que o leitor possa tomar as rédeas do seu dinheiro e da própria vida. O autor desvenda as estruturas que regem o poder, e denuncia as maneiras pelas quais alguns poucos privilegiados influenciam opiniões para manter a ordem vigente.Uma obra esclarecedora que apresenta, como o próprio autor provoca, \"as coisas como elas são\", oferecendo ferramentas para se fazer as perguntas corretas com autonomia, sem cair nas tantas armadilhas de falsas premissas cujas verdades os donos do poder não querem que você saiba.\n\n- https://gateway.pinata.cloud/ipfs/QmQj7648Qkc8hgrThZD9UAGtQdUakyHVwMXJjVj8rXPKQP",
				"added": 1578781208
			},
			{
				"comment_id": 4,
				"body": "#Máquina do Tempo – Mário Novello\n\nMáquina do Tempo – “Por que não podemos voltar ao passado?” Esta questão pairou durante muito tempo sobre a cultura ocidental, sem que uma resposta racional, simples e convincente nos fosse concedida.\n\nEm Máquina do tempo, o físico Mário Novello apresenta como os cientistas, com o auxílio da teoria da gravitação de Einstein (a chamada Relatividade Geral), têm equacionado o problema.\n\nO autor realiza a delicada tarefa de tornar a resposta a essa questão compreensível para um público de não-especialistas. E exerce com brilhantismo uma dupla função: informar aos leitores que não são físicos o estado atual de nosso conhecimento sobre viagens não-convencionais no tempo; e produzir um inventário crítico capaz de fornecer aos estudiosos do assunto um roteiro para análises mais aprofundadas.\n\n“Mário Novello é um cientista e, como tal — entre a sofisticação da matemática e as alternâncias do movimento da física, por exemplo — se apropria de curvas do tempo que violam nossas certezas, que envolvem a questão temporal: a de que um corpo só pode viajar para o futuro afastando-se do passado. À diferença do pensamento antigo, que subjugava o tempo às variáveis do movimento, existem curvas aceleradas que tornam possível a um observador que se movimente sobre elas retornar ao passado.\n\nUma série crescente de dificuldades teóricas liberta o tempo — afirma o pensador moderno Mário Novello, com seu sonho de um Universo centrado, labirintos de luz, para uma viagem quase sem fim do espírito, em que círculos e demonstrações da matemática misturam-se com o desejo do tempo, com o desejo de tempo puro, um pouco de tempo puro.”\n\n- https://swarm-gateways.net/bzz:/6394120ff0211badbbd5e54d3df9c8950939689d79e846bbe6c8515017451bec/Maquina_do_Tempo-Mario_Novello.pdf",
				"added": 1578784970
			},
			{
				"comment_id": 5,
				"body": "#Do Big Bang ao Universo Eterno – Mário Novello\n\nDo Big Bang ao Universo Eterno – Nas últimas décadas do século XX, os cientistas produziram uma descrição da história do Universo segundo a qual, há poucos bilhões de anos, uma grande explosão teria dado origem a tudo o que existe. Esse modelo conhecido como big bang parecia incontestável, assumiu o papel de verdade científica, ganhou as páginas de jornais e revistas, povoou os livros didáticos e as telas de televisão.\n\nO premiado cosmólogo Mário Novello demonstra agora, para o grande público, que os cientistas produziram uma teoria da criação equivalente a diversos mitos religiosos. E analisa as condições que tornaram possível o surgimento de outros cenários e teorias, entre eles o do Universo eterno dinâmico, em que sua origem não teria um começo determinado no tempo.\n\n- https://swarm-gateways.net/bzz:/907511aec796e64a7c34b6b864cf485ac14e0105d81d7079125dc46e8003e224/Do_Big_Bang_ao_Universo_Eterno-Mario_Novello.pdf",
				"added": 1578785186
			}
		]
	},
	"comment_vote": {
		"4_18t7T6UAgm4RFpN3aqxjpx7uLncz54gTXa": 1,
		"5_18t7T6UAgm4RFpN3aqxjpx7uLncz54gTXa": 1
	}
}