{
	"posts": [
		{
			"id": "57aa7d4e-6048-46cb-abd3-ed069777fa9a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f372c3ca-5dd0-462b-a5ba-adf29ef11ce7",
			"body": ">>6031dadd-b1d1-41af-88ee-094c38a18600\n\nYou can extract the list of all nodes from the directory servers.\n\nExample: https://cable.ayra.ch/ip/filter.php?list=tor.tor.Exit",
			"time": 1566080920400,
			"files": "[]"
		},
		{
			"id": "b1bb9a2b-eab6-4623-866c-b53afc89c2fe",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "f372c3ca-5dd0-462b-a5ba-adf29ef11ce7",
			"body": ">>4fb820fc-7192-4a8b-b194-4ac07d8f8bda\nThat's not possible. Tor clients need to build circuits so they have to know where to connect to.\nExit nodes are not the only one that are public. Open my previous link without the parameter (remove \"?\" and everything after) and you can chose the list.",
			"time": 1566131343600,
			"files": "[]"
		},
		{
			"id": "4098091d-050e-4eef-ab0b-58acbec087fb",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": ">>6d6b9269-6c18-47de-bdb6-50e87d07d768\nYou can edit your hosts file or even run your own dns server (see \"technitium DNS\" and \"pihole\"). You can also use a different DNS network (see openNIC)\n\n>>3e429204-0e0d-4aa3-b003-d1686d93f73a\nNamecoin is the closest thing we have.",
			"time": 1575489586633,
			"files": "[]"
		},
		{
			"id": "08e1929f-68a8-4148-bead-4ea61352f27d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": ">>2e92e073-c078-4466-a04d-400c1513a6b4\nOnion addresses are harder to take down than a zeronet site. To take down an onion permanently, you have to find the real server. Iirc this has only ever happened because the owner of the onion was stupid and/or run outdated software, never due to a flaw in TOR.\n\nZeroNet on the other hand does not tries to hide the address of people. By looking who publishes changes first, you can pretty quickly narrow down who owns the site (especially with how few peers there are currently), then seize that host and now you own the private key to publish an update that essentially replaces the content with nothing. If you hide your ZeroNet host behind TOR you might as well start using TOR directly.\n\nWant to start mirroring TPB? Download https://thepiratebay.org/static/dump/csv/torrent_dump_full.csv.gz\n\nThe file is generated every Sunday at 00:00 UTC. Inside is a CSV file with Date;Hash;Name;Size (in this order and format). The hash is a Base64 of the SHA1 torrent hash. This can be automated. If you prefer an SQLite database, check https://github.com/AyrA/opb\n\nBecause the exporter was coded by an idiot, Torrents whose inforhash starts with 00 are not exported.",
			"time": 1575490216733,
			"files": "[]"
		},
		{
			"id": "e77f49ba-e0af-488b-86ca-81e9e56f1161",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": ">>0964f582-d2c9-4473-bc93-292a85049618\n\nThe reason these sites are still running is not because they're supposedly hard to take down, but because nobody gives a shit about zeronet due to the tiny user base it currently has.\n\nTaking down a zeronet site basically only requires you to take down the host of the owner which is easy to find unless the person remembered to configure zeronet to only use TOR. If the owner connects once without TOR, it's over.\n\nIf you get your hands on the private key, you can trivially wipe the site. If the key is deleted by the owner, nobody can modify the site and people might still be able to post content. All they have to do is to slowly pick people in various countries that they can get to and hand out severe punishments. This puts a deterrent on running ZeroNet and will slowly diminish the user base until the illegal content shared on it is no longer of any relevance.\n\nan onion address on the other hand is impossible to connect to/from via regular internet, which renders it safe by design. You need to find the host via other means, which is outright impossible unless the owner does something very stupid.\n\nAdditionally, there's also the question of how safe ZeroNet itself is. TOR has been battle tested for over a decade now. ZeroNet hasn't had a single audit as of now. Since all pages run on on the same IP and port, there's no browser protection against malicious sites getting full access to your zeronet instance. The security depends on a handful of people coding something that can go horribly wrong very quickly in a flawless manner. At least one contributor admits that the API might not be as safe as it appears: https://github.com/HelloZeroNet/ZeroNet/issues/2312#issuecomment-561752823",
			"time": 1575563013133,
			"files": "[]",
			"last_edited": 1575563253233,
			"subject": null,
			"capcode": null
		},
		{
			"id": "9596c41f-a5f1-4ebb-9f1b-b2ec50ee73c6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": ">>e77f49ba-e0af-488b-86ca-81e9e56f1161\n\nZeroNet also depends on JavaScript. Any site where a user can submit content is at the potential risk of executing user supplied code if it has not been very carefully crafted to not allow any form of arbitrary code execution. This is unlikely to be the case but we will see what the future holds.\n\nIf an attacker manages to inject JS, gathering the private key becomes trivial (there's an API for it in ZeroNet). With the key, the attacker gets free reign over the site and can do whatever the fuck he/she pleases, including adding code to it that tries to detect the real IP of a client. This puts you into this entire \"the owner of the site has to be very fucking smart\" region again. TOR browser on the other hand discourages the use of JS entirely.\n\nZeroNet is far away from being as secure as an onion service (and it's also limited to a web browser). The purpose of ZeroNet is to be decentralized and not to be untraceable.\n\n>>dd3b104b-a5c0-4771-886a-06d7708db2a4\n> Don't onion addresses just hide where your server is anyways?\n\nNo. They do multiple things:\n\n- Hide the server location\n- Hide the client location\n- Serve as encryption certificate (you can't pretend to be an onion unless you have the private key)\n\nThe second point is important. If a server is compromised, you can't trace users with it (unless again, they have JS enabled). The TOR browser protects against many types of deanonymization methods.\n\n> If all connections lead to the same server it's possible to find the server through statistical methods even when using Tor, although it's a lot of work\n\nThat's why onion services by default create multiple so-called rendezvous points.\nYou also can't know if a packet is for an onion service or not because a tor node only ever knows the previous and next hop. All traffic is sent inside so called cells. Those cells are padded as needed to always be the same size.\n\nThe tor project itself doesn't even knows how many onions are there and how much traffic they use. They can merely make statistical guesses.",
			"time": 1575564227133,
			"files": "[]"
		},
		{
			"id": "dad97a56-02bf-4e0f-abe0-18a74226bf2f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4169f70f-f5ef-4916-9880-7c29e2917ea7",
			"body": ">>45c726d5-1457-428d-b2bd-45dab70d878c\n> but it lacks the advantages of zeronet , tor still relies on 1 server many clients idea\n> which is quite stupid , again , if the onion server is taken down , it's all over \n\nSites are taken down by governments because they do illegal stuff so being anonymous is an important part and as of now, only tor provides this in an environment that is mature enough.\nA tor site only goes offline if you don't backup the onion key. You can have a backup server somewhere that starts serving the onion as soon as the original disappears. I want to reiterate that not a single onion service has been taken down unless the owner was stupid, which would be the same for zeronet (owner is stupid, gets caught, the private key is used to erase the site or implant a script to track users and expose them)\n\n>  if devs could somehow overcome the firewall , i think i2p will be better than both\n\nTell i2p to use tor as a proxy then. I personally recommend to not use i2p because their dns system is controlled by the developers.",
			"time": 1575638870619,
			"files": "[]",
			"last_edited": 1575638896019,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}