{
	"title": "Vladz'ения",
	"description": "Уходим в  p2p",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 5,
	"demo": false,
	"modified": 1482225954,
	"post": [
		{
			"post_id": 4,
			"title": "Переход в распределённые сети",
			"date_published": 1482225748.513,
			"body": "Как вы пользуетесь p2p в повседневной жизни, не считая скачивания кино пиратской бухты?\n\nУ меня, к примеру, Resilio (бывший BitTorrent Sync) полностью заменил облачные хранилища как бэкап и передача файлов между устройствами."
		},
		{
			"post_id": 3,
			"title": "Правда о рейтинге благонадёжности в Китае",
			"date_published": 1482122048.392,
			"body": "Недавно в интернете (как вообще, так и в [российском сегменте](http://www.furfur.me/furfur/freedom/freedom/215159-surveillance)) циркулировали слухи о \"_системе кредитного рейтинга_\" для пользователей интернета в Китае. Лейтмотивом этих статей были Большой Брат, тоталитаризм, глобальная слежка и прочий Оруэлл. Давайте разберёмся.\n\n### Краткое содержание слухов\n\n*   Система будет обязательно для каждого гражданина КНР;\n*   Привязывается к национальному ID (身份证);\n*   Рейтинг выражается в очках (_от 350 до 950_);\n*   Управлять системой будут совместно **Tencent** и **Alibaba**;\n*   Учитывается как покупательская способность, так и политические взгляды;\n*   Действия друзей понижают и ваш рейтинг тоже;\n*   Рейтинги публичны, можно посмотреть рейтинг любого гражданина (чтобы, например, не общаться с диссидентами или сочувствующими, которые понизят ваш рейтинг);\n*   За покупки рейтинг повышается, _за компьютерные игры — понижается_;\n*   Доступны разные бонусы: за 750 очков можно получить визу в Сингапур;\n*   ...и тому подобное.\n\n### А на самом деле?\n\nВнимательный читатель уже заметил интересную деталь: неужто две яростно конкурирующие между собой компании _—_ местные мастодонты интернет-бизнеса _— _будут управлять системой вместе? Конечно, у них есть пример сотрудничества — объединение приложений вызова такси Didi Taxi (嘀嘀打车) и Kuaidi Taxi (快递打车) в единую компанию **[Didi Kuaidi](https://www.techinasia.com/infographic-didi-kuaidi-uber/)** для совместной борьбы с иностранным **Uber**. Однако в остальном ни о каком сотрудничестве речи не идёт. Доходит до смешного: в популярнейшем китайском мессенджере [WeChat](https://blog.wtigga.com/china_social/) заблокирована возможность поделиться ссылкой из Taobao на мобильном клиенте. Ответ на поверхности. Журналисты, в силу плохо переведённых китайских новостей, смешали в кучу сразу несколько понятий:\n\n1.  **[社会信用体系](https://chinacopyrightandmedia.wordpress.com/2014/06/14/planning-outline-for-the-construction-of-a-social-credit-system-2014-2020/)** (англ. **Social Credit System**) — **государственная** система кредитного рейтинга граждан;\n2.  **[腾讯信用](http://wxy.qq.com/)** (англ. **Tencent Credit**) — система рейтинга компании **Tencent**;\n3.  **[芝麻信用](http://www.antgroup.com/page/zmxy.htm)** (англ. **[Sesame](http://bkrs.info/slovo.php?ch=%E8%8A%9D%E9%BA%BB) Credit**) — часть финансовой системы **Ant Financial**, относится к группе компаний **Alibaba**.\n\n### 社会信用体系 — государственная система кредитного рейтинга\n\n**Будет являться обязательной для всех после 2020 года.** О её создании заговорили в 2014 году. [Документ](https://chinacopyrightandmedia.wordpress.com/2014/06/14/planning-outline-for-the-construction-of-a-social-credit-system-2014-2020/) с пространным описанием системы стал доступен несколько месяцев назад. Есть много слов о _«поддержке искренности и порицании неискренности»_, преданности государству, но из конкретики есть лишь дата запуска в обязательном порядке для всех граждан страны— **после 2020 года**. Конечно, партия хотела бы иметь о гражданах абсолютно все возможные данные, и, теоретически, и строить рейтинги доверия на основе этих данных. Но практически всё, что циркулирует сегодня в сети на тему государственной кредитной системы, лишь домыслы и предположения.\n\n### 腾讯信用 Tencent Credit\n\n[![2_tencent](https://blog.wtigga.com/wp-content/uploads/2015/12/2_tencent.jpg)](https://blog.wtigga.com/credit-system-in-china/) **Не является принудительной для всех граждан.** Компания **Tencent** является одним из гигантов среди [китайских технологических компаний](https://blog.wtigga.com/china_social/). Её самые известные продукты — мессенджеры [QQ и WeChat](http://magazeta.com/2015/11/chinese-messengers/), которые являются де-факто стандартом электронного общения в Китае не первый год. Короче говоря, Tencent — это про общение в интернете и компьютерные/мобильные игры. А в мобильный мессенджер WeChat встроена вторая по популярности платёжная система в КНР — [WeChat Wallet](http://magazeta.com/2015/10/digital_wallets/). Она пользуется особым спросом во время китайских праздников, потому что позволяет в весёлой форме отправлять любые денежные суммы друзьям (это явление достойно отдельной статьи). В онлайн и офлайн магазинах ей тоже [можно рассчитываться](http://magazeta.com/2015/10/digital_wallets/) вместо пластиковой карты. [![tencent_service](https://blog.wtigga.com/wp-content/uploads/2015/12/tencent_service.png)](https://blog.wtigga.com/credit-system-in-china/) Рейтинговая система от Tencent не содержит ничего сверхъестественного: чем больше вы тратите денег или делаете вкладов через платёжные инструменты QQ или WeChat, чем больше кредитных и дебетовых карт к счетам вы привяжете, чем более правдивая информация о вас в профиле (включая адрес места проживания при оплате коммуналки), тем выше рейтинг. Что она даёт, пока не очень понятно. Залогиниться с компьютера нельзя. С телефона можно, но при попытке узнать свой рейтинг появляются ошибки. Из очевидного  — б**о**льшая сумма для получения кредита на покупки у Tencent. Ни о каких визах или банковских кредитах речи не идёт.\n\n### 芝麻信用 Sesame Credit от Alibaba\n\n[![1_zhima](https://blog.wtigga.com/wp-content/uploads/2015/12/1_zhima.jpg)](https://blog.wtigga.com/credit-system-in-china/) **Не является принудительной для всех граждан.** Крупнейшие торговые площадки Китая — **Taobao** и **Tmall** — принадлежат **Alibaba** наравне с популярнейшей (более 80% рынка!) системой онлайн-платежей **Alipay**. Помимо покупок товаров в интернет-магазинах, она позволяет рассчитываться в обычных магазинах, покупать билеты на самолёт, платить за воду и электричество, переводить деньги друзьям — все функции перечислить просто невозможно, каждый день появляется что-нибудь новое. Оплата [с помощью звука](https://blog.wtigga.com/alipay-wallet/) — вообще что-то из области фантастики. [![alibaba_service](https://blog.wtigga.com/wp-content/uploads/2015/12/alibaba_service.png)](https://blog.wtigga.com/credit-system-in-china/) Не так давно стала доступна функция **蚂蚁花呗 (Huabei)**, которая открывает некое подобие овердрафта на счету Alipay, позволяя совершать покупки от 600 юаней, а рассчитываться за них через 2-3 недели после получения товара. Месячный лимит зависит от многих факторов: возраста аккаунта, активности на Taobao, количества привязанных банковских карт и тому подобное. Проникновение сервисов Alibaba в жизнь китайских граждан просто огромно. Разумеется, обладая такими обширными данными о поведении пользователей, становится возможным оценивать степень доверия к тому или иному пользователю. Способы повышения рейтинга те же, что описаны у Tencent: тратьте деньги, возвращайте вовремя кредиты, платите за свет и воду (чтобы Alipay знал, где вы живёте). Взамен, кроме повышенного овердрафта, вам обещают обслуживание без очередей в банке, какие-то скидки, премиальные номера в отелях... Короче говоря, приятно, но ничего революционного. Кстати, конкретное кол-во очков всплывает именно в \"Кунжутном кредите\". Являясь по задумке системой рейтинга платёжеспособности граждан, фактически 芝麻信用 продвигает использование кошелька Alipay в обмен на бонусы партнёров, что нравится далеко не всем. Например, приоритетная регистрация на рейс в Пекинском столичном аэропорту для тех, кто набрал больше 750 очков, в глазах некоторых структур выглядит некорректным использованием.\n\n### Ну вы поняли?\n\nСмешались кони, люди. В изложении огромного количества журналистов все три системы слились в одну сущность, приправленную страхами от незнания Китая и кусочками личной паранойи. За покупку игр никто не понизит овердрафт по кредитке, а знакомый с оппозиционными взглядами не помешает взять ипотеку (да и не просто в Китае найти оппозиционеров в реальной жизни). Частные компании продвигают свои финансовые инструменты, и для их поддержки создали рейтинговые системы. Они не взаимозаменяемы, не взаимодействуют между собой и не помогут (и не помешают) при оформлении займа в обычном банке. А до внедрения государственной системы есть ещё несколько лет. Поживём-увидим. Та же статья на моей любимой [воскресшей Магазете](http://magazeta.com/2015/12/chinese-netizen-rating/) и [на Geektimes](http://geektimes.ru/post/267030/). // [blog.wtigga.com](https://blog.wtigga.com) - Заметки белого тигра - Vladimir Zh //\n\n** Спасибо, что дочитали. Мне очень нужны пиры для проверки работоспособности сети, поэтому я репостнул сюда свою старую статью.\n\nНапишите в комментах, какой я мудак, или какой я молодец и как я должен жечь ещё."
		},
		{
			"post_id": 2,
			"title": "OMG super\n",
			"date_published": 1482115305.746,
			"body": "Blog post body"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}