{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1,
			"title": "IPFS VIDEO TEST by loligod",
			"body": "http://127.0.0.1:43110/16pz3DbSRyz7D7e3qsxWMq98Z8VztJZN4j/",
			"added": 1481882962
		},
		{
			"topic_id": 2,
			"title": "OniiChan - Image Board",
			"body": "http://127.0.0.1:43110/1BuPsjT1AC5vjoAd4PmJMt4TaZvh3cgKNX/",
			"added": 1481884968
		},
		{
			"topic_id": 3,
			"title": "IPFS Videos",
			"body": "http://127.0.0.1:43110/16pz3DbSRyz7D7e3qsxWMq98Z8VztJZN4j/",
			"added": 1482468009
		},
		{
			"topic_id": 4,
			"title": "[NSFW] LoliTube - Youtube for Lolis",
			"body": "Hello fellow pervs! I made a new IPFS video site. This time for loli hentai.\n\nhttp://127.0.0.1:43110/1CmDyfVXZvUGFfY6cUQagCpkqzazSsBdaP/\n\nYou will need to have the IPFS daemon running to be able to watch the videos. Let me know about a loli hentai series you want added. :D",
			"added": 1485145808
		},
		{
			"topic_id": 5,
			"title": "LoliGod's ZeroMux Test",
			"body": "http://127.0.0.1:43110/1H813wQMZaCaHS8scsvVZwfoYK3KdW1YVG/",
			"added": 1485653417
		}
	],
	"topic_vote": {
		"1_137PNA5gLgCTLZTBtzUqCmMoZ752NQGQSJ": 1
	},
	"next_comment_id": 11,
	"comment": {
		"30_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 1,
				"body": "Another IPFS video site: http://127.0.0.1:43110/16pz3DbSRyz7D7e3qsxWMq98Z8VztJZN4j/\nOnii-Chan: http://127.0.0.1:43110/1BuPsjT1AC5vjoAd4PmJMt4TaZvh3cgKNX/",
				"added": 1485152910
			},
			{
				"comment_id": 2,
				"body": "> [sirenyc](#comment_266_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): (Can I just watch if I have IPSF installed?)\n\nYep. You need IPFS running to be able to watch the videos.",
				"added": 1485235650
			},
			{
				"comment_id": 3,
				"body": "> [cuntwagon](#comment_26_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): Why is onii-chan loli trash on here but 0chan is not?  Fucking pedofiles I swear.\n\nHaving an open and censorship resistant internet means that there will be access to controversial topics. I can understand where you are coming from *if any of my sites included child pornography*. But none of them do. Getting hot and bothered by harmless 2D animation is immature. \n\nI mark all my work. sirenyc properly put a 18+ mark. Nobody is forcing you to visit any of my sites. You do it of your own volition. If you feel uncomfortable seeing a link then maybe you should stick to your censored internet. \n\n > [sirenyc](#comment_271_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Removed Link!\n\nI find it interesting how you intend to make a list of Zeronet Sites but willingly censor links when anybody get their panties in a twist. Why would anybody take a second look at this list when they know it's actively censored and they won't be able to get the complete picture? I know things are controversial, but, if you're going by US legality here, my sites are completely legal while all the pirating and torrenting sites are not. I respectfully ask you to reconsider the removal of links. It makes no sense devaluing your list, censoring things, on an anti-censorship network. If people don't want to see something they don't need to click the link. Regardless it's not going anywhere.",
				"added": 1485388309
			},
			{
				"comment_id": 4,
				"body": "> [cuntwagon](#comment_27_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): I was originally complaining more about the fact that some pedo board was included on the list while the general-use imageboard was not.\n\nThat is what I initially thought when I read your comment. But the moment you said \"Fucking pedofiles I swear.\" I thought I needed to chime in being that you were talking about my sites. \n\n> [cuntwagon](#comment_27_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): That said, I am not a fan of pedophiles and I do not want to see their stuff on lists like this. \n\nI think this is where our disagreement is. You see animated 2D children as child porn and I do not. Nobody was hurt in the making of a 2D image and as such it's not logical to associate it with the harm child porn brings. \n\n> [cuntwagon](#comment_27_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): There is a big difference between the censorship on the surface web and sirenyc taking pedo stuff off of this list.\n\nI disagree. Censorship is censorship no matter what form. Being anti-censorship only means something when no party is blocked. You can't pick and choose what you want in an anti-censorship stance. It doesn't work that way.\n\n> [cuntwagon](#comment_27_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): Anyone can make their own list here. If you want to make your own interesting site list and include pedo stuff along with mainstream content then that is fine and it is within no one's right or power to stop you.\n\nVery true. But upkeep is horrendous and honestly I'm too busy building amazing sites for zeronet to commit enough time to do a good job. Maybe in the future if sirenyc doesn't reconsider. \n\n> [cuntwagon](#comment_27_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf):  If I start seeing too many pedo links here or other places I may start taking steps to stop hosting those links, but for the moment I feel that helping share them does at least keep you people from spamming the rest of us into oblivion with child pornography.\n\nUmm... what? There might be a little bit of misinterpretation here. Are you saying that you **host the pedo links you are so opposed to**? It just doesn't make any sense. You do not need to feel any need to host things you do not want to host. Believe me I rather you stay to yourself.\n\n\"You people\" seems like it's an us VS them scenario. We are all in this together. I am not battling you in a hit of hell but trying to address your flawed, hateful, and incoherent logic. Once again our disagreement is how we perceive child porngraphy differently. \n\nNever once did I even suggest spamming. You are attacking a straw man.",
				"added": 1485394367
			},
			{
				"comment_id": 5,
				"body": "> [cuntwagon](#comment_28_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): Oh and if you're going to argue this you might as well take it all the way home and say that it's immature to complain about digital photos of child abuse since no one is being physically harmed by the photo continuing to exist. \n\nWhat you are forgetting is that a child was harmed in the making of that photo. Just because it doesn't do immediate residual harm when people look doesn't discount that the act in making it was a crime. That alone makes it illegal. \n\n> [cuntwagon](#comment_28_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): While I agree with you in principle, the reality is that this stuff is banned basically everywhere civilized and no one has any use for it except for the creeps who get of on it and the creeps who get off on catching them. \n\nIt being 2D animation or child porn? If I need to make the case I would say civilized countries like the US and Japan, who do not outlaw 2D animated porn, are cherry picked examples. Regardless if you feel that no one has any use for it your logic is deeply flawed. If you say that virtual depictions of serious offences like child molestation should be banned then wouldn't the same need to go for violent video games or any recent action movie?  \n\n> [cuntwagon](#comment_28_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): I don't know what the solution is for you people, but I know that you are a huge liability to projects like zeronet.  I am all for the freedom to possess any kind of information you can get your hands on.  I just don't want to get v& for someone else's sick fetish.\n\nUs VS them scenario again. I do agree that if people post illegal stuff there will be some stigmatization. Tor is a great example of this. Full of drug market places and oh child porn too. But there is also whistleblowing networks, ways for individuals to combat state censorship and propaganda, and various others. There is a trade off for privacy but the societal benefit is well worth it.",
				"added": 1485396055
			},
			{
				"comment_id": 6,
				"body": "> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): It is logical because while loli stuff isn't technically illegal in as many places the consequences for being associated with it are basically the same.  That is the same kind of harm to me.\n\nLet me understand this. You are saying that a person should be guilty of an offence by some kind of association without reason? That doesn't sound too civilized to me. Once again our disagreement comes up. Loli hentai or any kind of animated porn not matter how extreme does not cause any harm to any person.  \n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): No party is blocked when sirenyc choses not to list your site any more.  You are now arguing for the right to force someone to make speech that they don't want to.  You have your own ability to speak for your website.\n\nMaybe blocking wasn't the correct word. Though when you try to define something you shouldn't' use the same word. sirenyc removing the links is exactly what censorship describes. You complained, he removed. I'm not forcing him to do anything. I said \"I respectfully ask you [sirenyc] to reconsider the removal of links.\" Whether he does it or not defines if he is for censorship or not. To me, not putting what he finds on the list is just doing a disservice and hurting the exact reason to have a list like this. \n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): There is nothing hateful here. I feel bad for you guys.\n\nReally? Because I'm feeling a lot of incorrectly placed hate.\n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf):  Whether its biological or environmental or both you are attracted to children.  Some of you abuse your own kids or those of others, while some just draw pictures of it and wax poetic on the internet about how we're all bigots who are oppressing children and the kind adults who want to fuck them.  \n\nThe biological or environmental argument is so broken people used it in the 1970s to remove rights for homosexuals. Maybe it's just beyond your comprehension to understand that maybe just maybe I'm not a piece of shit that wants to hurt a child. \n\nYou said \"I understand the difference between loli hentai and cp\", it does not seem like you do. Never once did I say I was going to hurt a child and never once did I argue for support of child molestation. You are building a straw man to once again attack. \n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): Again, I don't even think posession of cp itself should be a crime\n\nYour arguments against lolicon hentai are so inconsistent. So now you are ok with people possessing child porn? The first sentence of the same message you said \"It is logical because while loli stuff isn't technically illegal in as many places the consequences for being associated with it are basically the same. That is the same kind of harm to me.\" in response to my \"it's not logical to associate it [loli hentai] with the harm child porn brings.\"\n\nSo if you are ok with the harmful elements child porn brings, which I think we both agree is way worse than loli hentai,  then why even speak up against \"loli trash\" and have this discussion with me?  Just because you \"do not want to see their stuff on lists like this\"? It just seems counter intuitive.\n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): but producing it sure as fuck is and if you are attracted to children you need some serious help.\n\n100% man! I guess it's good that I don't find those snot filled immature children attractive but only fictional representations based in fantasy settings. OH wait are we attacking that straw man again? Sorry I forgot. Once again I haven't even suggested any support for harming children and if you read my first response on the message below you'll remember that I've defended the ban on possessing child porn because the act in making it was a crime. \n\n> [cuntwagon](#comment_29_17AcmbLffN1gjfsTf6Jy8K2aBPdMaSBrrf): I was referring to how without containment areas you guys will spill over into what is supposed to be a clean place and shit all over our five seconds of freedom because of your paraphillia.\n\nThis argument is called a Slippery Slope fallacy and has no marret.",
				"added": 1485400256
			},
			{
				"comment_id": 9,
				"body": "> [nekololi](#comment_3_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i can't be held accountable for the itchy mouse fingers of others! but don't worry, if there's a loli video site i'm going to sperg and link it without telling people what it is.\n> that is the reason why i have made my way to this strange new network. spreading loli and good tidings is my purpose in life and i aim to at least put in a minimum amount of effort.\n> thank you again for your expressions of gratitude and for following the link! have a pleasant day!\n\nnekololi I don't agree with this. Don't link to my sites without marking it appropriately. Most of them are adult in nature and should be marked as such.",
				"added": 1487551011
			},
			{
				"comment_id": 10,
				"body": "> [nekololi](#comment_4_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): o-okay boss\n\nThanks <3",
				"added": 1487554644
			}
		],
		"1_1FWBt5nWNGEBAycxo5yp34ZsEHrfTJxdF4": [
			{
				"comment_id": 7,
				"body": "> [technoshaman777](#comment_7_1DTUNWykvXLbxZud5a8gJsq7DxmxcGk52E): I have IPFS installed and still can't get this to work. Anybody else figure it out?\n\nUnlike Zeronet (where when you visit a page you automatically distribute) IPFS relies on individuals choosing to pin files to help distribute the data. This site doesn't seem to have anybody distributing all the content anymore (at least right now). As such your IPFS daemon can't resolve to the files or download the images or videos.  \n\nYou can see all the hashed files here: http://localhost:8080/ipfs/QmeC2QgeLCQ8LmCFmhsJJm3S7GVsFch46D8RqFPyzK88Sz/\n\nIf you can resolve to anything, that's great, there might be still hope. You can try to pin the files [**by clicking here**](http://localhost:5001/api/v0/pin/add?arg=QmeC2QgeLCQ8LmCFmhsJJm3S7GVsFch46D8RqFPyzK88Sz&recursive=true) <- Might not finish.\n\nAll the content I upload to IPFS is seeded and pinned by various parties. This keeps the availability up and gives the file time to organically distribute. I also try to make it as easy as possible for individuals to pin the files from easy to press buttons or links. ",
				"added": 1485458494
			}
		],
		"4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": [
			{
				"comment_id": 8,
				"body": "> [grandpa](#comment_1_1DSiY7oNYWw4W5JZPQXwc5gk8YTA1sg8s8): no videos load...they just spin forever.\n\nThe IPFS daemon takes some time to resolve. [Pinning the Videos does help](http://localhost:5001/api/v0/pin/add?arg=QmYjn3GJgq2RQf94UW4CwC7i3moBJR539jEKQWA2y3aYee&arg=QmVTiFyeA7z4spBxTgbPUCiurUHMTxK7G8GKqt67fCzToo).",
				"added": 1486247840
			}
		]
	},
	"comment_vote": {
		"3_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"4_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"6_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"5_1EpY11syeaKbwRSNqv9tU1ZxoU1moJA9Bp": 1,
		"4_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1
	}
}