{
	"title": "gg Chinese homepage",
	"description": "My ZeroBlog.",
	"links": "- [one word a day](http://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u)",
	"next_post_id": 28,
	"demo": false,
	"modified": 1468139284,
	"post": [
		{
			"post_id": 27,
			"title": "Human Things",
			"date_published": 1468109335.788,
			"body": "http://127.0.0.1:43110/1DAsuVKSW18i7c8q2r86RjMTHtP6KrgYue"
		},
		{
			"post_id": 26,
			"title": "Learn Chinese through musing and meditation",
			"date_published": 1466522128.461,
			"body": "http://127.0.0.1:43110/1PX3oLdr7e9sgh9xzpMxX6PPMo4zYDFR9J"
		},
		{
			"post_id": 25,
			"title": "Guys, let's have a sensible Chinese name",
			"date_published": 1466328987.888,
			"body": "I have met many foreigners living and doing business in China. They all have a Chinese name. But some of the names they chose for themselves are not really proper, sounds funny, or out of proper context. By out of proper context I mean their names sounds distinctly not resonating well with who their background. For example, if you are a high rank business official, you probably do not want to sound like to have name that typically a peasant gives to his son. If you are the head of Coca Cola you do not want to name your 7-up sounds like die 7 times, or name your Coke as gassed water, go check any bottle on China market yourself, they still name themselves that way. \n\nSo here I will provide you with this free service, if you care to drop your name here, I will carefully pick you a good Chinese name. \n\nHere is the naming link:\nhttp://127.0.0.1:43110/1NuGh3wgr1jT9Rr22TWBE7Lsku4NQ5JgaM/"
		},
		{
			"post_id": 24,
			"title": "We ask again: what is the best way to learn Chinese?",
			"date_published": 1466313213.7,
			"body": "Chinese are complex, mostly out of your life context. As a result learning Chinese with a traditional thinking is hard. And that is why extremely few foreign people are able to master Chinese. \n\nHere are some basic assumptions I think make sense before you try to learn Chinese:\n\n- your purpose of learning Chinese should not be effective communication; even for Chinese, given they know some English, Chinese is not the most effective tool for communication; it is cumbersome, complex, obscure in many ways and situations;\n- your purpose should be aesthetics, philosophy, intellectual curioisity, and mental experiment; when you think this way, Chinese becomes fun to examine and learn;\n- your focus should be words; sentence, grammar, thought, let's pospone these to very very later stage of study"
		},
		{
			"post_id": 23,
			"title": "Read things that deeply worry people",
			"date_published": 1466313135.175,
			"body": "http://127.0.0.1:43110/1Me3yUx7DBtyEZJdYRVoZ3KrhKcjD2ynyR"
		},
		{
			"post_id": 22,
			"title": "Read Startup News in Chinese",
			"date_published": 1466070284.768,
			"body": "http://127.0.0.1:43110/1CxrqkwYmb5wZeZb72Qgt9KNU51edVZjkK"
		},
		{
			"post_id": 21,
			"title": "Learn Chinese through a Chinese investment fund company",
			"date_published": 1465889958.781,
			"body": "http://127.0.0.1:43110/1DVV8GAnVqQXSYsZnmqahMdvKWBCyoohzk"
		},
		{
			"post_id": 20,
			"title": "Learn Chinese in a place where only men go",
			"date_published": 1465817601.449,
			"body": "http://127.0.0.1:43110/18heQUQn3qURXw2Pjsqd1nK2XeaXg8cVCm/"
		},
		{
			"post_id": 19,
			"title": "Learn Chinese in the real financial market - here is the stock market, updated everyday",
			"date_published": 1465810839.022,
			"body": "http://127.0.0.1:43110/1L4qH53mbciqNSQwmoYBUHWHbcz6BipuHa/"
		},
		{
			"post_id": 18,
			"title": "Play safe : China Personal Consulting Group",
			"date_published": 1465742293.838,
			"body": "There is no interest bigger than your personal interest.\nhttp://127.0.0.1:43110/16ZZtXJFCyVqcWMj7tcisNE4wXvP54t2UJ/"
		},
		{
			"post_id": 17,
			"title": "Naming in Chinese is a big thing",
			"date_published": 1465735544.454,
			"body": "Naming in Chinese is a big deal, a matter of life and death. It is ludicrous, but it is true. Let’s take a look of two classic examples. \n\n7-up: till today it is named the same, a Chinese name that sounds like die 7 times. It is probably still on market, but it never goes anywhere, far from its overseas soft drink market share.\n\nGoogle: well, the almighty google picked itself a name something like 谷歌, that is a bad choice. Why? The first word is ok at best given its particular business context, but not the second word, that is a bad choice. The result, it was kicked out of China, and is still out of China today. That is a 200 billion dollar mistake.\n\nThat is why a service like the following makes great sense: it may save you fortune.  \n\nhttp://127.0.0.1:43110/1HPZEWuf1PVVuMCAJZaz4B425wJnhUQd6Q/"
		},
		{
			"post_id": 16,
			"title": "How Chinese should be learned and used?",
			"date_published": 1465700712.126,
			"body": "The more I think about it the more I tend to agree the purpose of Chinese (i mean the language) is not supposed to be used to communicate the usual way, the way like we use English everyday. \n\nChinese language is not designed for typical communication purpose. If you actually try to write a message and see how long that takes you know what I mean. It was invented for the kings, recording their things, their wills, their whatever big things as final, official, fixed, untouchable and unchangeable. It was along the same idea of the great wall. It is good, It is bad.\n\nSo if you are serious about reliable and efficient communication, then English is the way to go, all Chinese speak English anyway, like the whole world does.  But still, Chinese is useful, very useful. I am not just touting things like when we use Chinese, they function as emoticons, facilitate our communications, stimulate our minds, remind us a long ago history and far away land. No, these are not what I intend to say.\n\nWhat I mean is, Chinese in its language design embed some fundamental truth, things that were abstracted out by these 5000 years ago designers who learned from their forebears. Every Chinese word carries a message, a lesson, a truth. 3000 Chinese words commonly used are 3000 pieces of common senses. \n\nHere is just one example - \n\nhttp://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u/?Post:26\n\nThis message has long been forgotten. When Chinese learn Chinese or being taught Chinese, this message is typically ignored. We will restudy every word and again let these words speak their messages aloud.\n"
		},
		{
			"post_id": 14,
			"title": "China Business Center",
			"date_published": 1465626283.085,
			"body": "here are a few services related to doing business with Chinese companies or doing business in China...\nhttp://127.0.0.1:43110/1HPZEWuf1PVVuMCAJZaz4B425wJnhUQd6Q/"
		},
		{
			"post_id": 13,
			"title": "How good is your Chinese?",
			"date_published": 1465611393.689,
			"body": "as a check of your actualy chinese capacity, i copy a few words written as a motto by a girl i am wooing as the title of her blog:\n\n不乱于心，不困于情，不畏将来，不念过往。如此，安好！\n\nshe wrote in simple but perfect chinese about her belief, her future outlook, and her action plan. if you can understand it, even with the help of a chinese dictionary, your chinese is good, good enough one day to pursue a lettered cihnese girl purly on your letter capacity rather than by your western background that by the way so far is far more effective than any literature.\n"
		},
		{
			"post_id": 12,
			"title": "How should we understand Chinese as a people?",
			"date_published": 1465483251.742,
			"body": "it is a tough question. but it is more likly just a start for more tougher questions. it is worth ask now because more and more peoples on both side of the great wall need to address it. let's first raise a mark here, we should come back later for this topic.\n\nnot many people ask these questions, not academic institutes of all kinds around the world, they are too concerned about the political correctness. not chinese people themselves, because given their culture and tradition and this and that and so on and so off, they dare not, bother not, care not.\n\nso let's see who will ask. "
		},
		{
			"post_id": 11,
			"title": "To understand Chinese people, take a look of their language",
			"date_published": 1465480641.773,
			"body": "ultimately, language defines people who use the language. it is clear people who speak both chinese and english think very differently than people who speak either only chinese or only english. so if we want to truly understand chinese people, we need to look into their language. i have often found poeple themselves do not really know themselves as they have assumed. their language truly show us who they are."
		},
		{
			"post_id": 9,
			"title": "Here is a lesson plan based on one day a word strategy",
			"date_published": 1465353806.896,
			"body": "http://127.0.0.1:43110/1CLk59DiVXedfaEo5MFffABWhyi8J1Gb1u"
		},
		{
			"post_id": 8,
			"title": "One learning strategy: one day one word",
			"date_published": 1465353717.259,
			"body": "it is like learn to appreciate an artistic painting. to start with, i recommend one day a word. "
		},
		{
			"post_id": 7,
			"title": "gg Chinese Q&A ",
			"date_published": 1465353184.361,
			"body": "If you have any Chinese problems, go here - \nhttp://127.0.0.1:43110/15pMgAGE6YM418a4YZp8jb7co1KjGNWqq9/"
		},
		{
			"post_id": 6,
			"title": "Is it hard to learn Chinese",
			"date_published": 1465351709.63,
			"body": "Based on our observation, it is indeed pretty hard for foreigners to learn and master Chinese, particularlly if you do not live in a Chinese denominated environment. What makes the learning Chinese easier? Maybe find a Chinese gf, that will be very helpful."
		},
		{
			"post_id": 5,
			"title": "Do we need to set a goal",
			"date_published": 1465350656.095,
			"body": "probably not. particularly, let's try not to set too high a goal. Chinese words are funny looking small pieces of art. so we can start by learning some artistic drawings, in our case, Chinese words."
		},
		{
			"post_id": 4,
			"title": "Who will teach",
			"date_published": 1465350608.546,
			"body": "all teachers here are common folks, volunteers."
		},
		{
			"post_id": 3,
			"title": "How we are going to do it",
			"date_published": 1465350550.939,
			"body": "use whatever tools we have here, maybe start from writing, writing some conmmonly used Chinese words."
		},
		{
			"post_id": 2,
			"title": "What we do here",
			"date_published": 1465350437.638,
			"body": "- let's learn some Chinese here\n- the tools are not perfect yet, but we can have a simple start and some fun\n- language is just language, let's use it to enrich our live, for example, make some new friends"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}