{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroWiki em português",
			"body": "Alguém que conseguiu criar/clonar um site poderia criar uma versão em português da ZeroWiki? Além da versão em inglês, há em espanhol e francês, mas não há em português",
			"added": 1475296039
		},
		{
			"topic_id": 2,
			"title": "ZeroWiki em Português",
			"body": "127.0.0.1:43110/1QJ8rDLmn4CE2VXpMotAi7bDryRmNLM7Rm",
			"added": 1476581680
		},
		{
			"topic_id": 3,
			"title": "Erros de tradução no ZeroTalk",
			"body": "O ZeroTalk em português está escrito \"hóras\" ao invés de \"horas\", a abreviação dos meses e o formato das datas estão em inglês",
			"added": 1477004458
		},
		{
			"topic_id": 4,
			"title": "Popularização da ZeroNet",
			"body": "A ZeroNet apesar de ainda ser um serviço de nicho, tem se popularizado um pouco: deepdotweb.com/2016/12/24/zeronet-disrupting-world-wide-web-kptx\nSe você quiser ajudar também, é só contribuir melhorando essas listas de zites: 127.0.0.1:43110/1QJ8rDLmn4CE2VXpMotAi7bDryRmNLM7Rm/?Page:lista-de-zites",
			"added": 1482697842
		}
	],
	"topic_vote": {
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": 1,
		"1_1GCBbTCjGZsJL7BqdRx13gEbueEnY6gsMm": 1,
		"1_1Ehiyjqsa14WZrfsmRq54cA1jBXuhcTyjE": 1,
		"36_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"34_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"43_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"4_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1
	},
	"next_comment_id": 17,
	"comment": {
		"1_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 1,
				"body": "> [sirenyc](#comment_130_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/\n> Da para clonar e traduzir =)\n\nEu tentei clonar, mas a minha operadora não permite abrir a porta para upar um zite na ZeroNet",
				"added": 1475340326
			},
			{
				"comment_id": 2,
				"body": "> [kosherx](#comment_7_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY): Não, porque em primeiro lugar, já teria um site wiki pronto pra seção em PT-BR. Todos os usuários que chegassem aqui e não soubessem inglês (muito poucos, eu sei, mas pode ser que hajam alguns) iriam encontrar o wiki em PT-BR, leriam e a partir daí, poderiam até complementá-lo lá justamente porque eles não são fluentes em inglês.\n> E em segundo lugar, basta ver quantas línguas existe no Zerotalk, atualmente 7. Todos os usuários destas 7 línguas editando o mesmo ZeroWiki? Não vai dar certo. Seria mesmo melhor bifurcar os ZeroWikis, igual os Zerotalks são bifurcados, um pra cada língua.\n\nAcredito que criar uma wiki em PT-BR seja importante no futuro, então já é melhor criar agora para já acompanhar a versão em inglês.\nPara bifurcar a ZeroWiki original(em inglês) teria que falar com o dono, ou criar uma cópia e modificar, o que exigiria algum conhecimento de programação, isso pode ser sugerido no 127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:zerowikiissues",
				"added": 1475341361
			},
			{
				"comment_id": 3,
				"body": "> [sirenyc](#comment_131_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): Não precisa ser um clone do site, se alguém tiver tempo de criar um site simples e organizar o conteúdo já esta de bom tamanho =D\n\nClonar é mais fácil, depois disso só precisa criar a página inicial e os artigos",
				"added": 1475357742
			},
			{
				"comment_id": 4,
				"body": "> [sirenyc](#comment_133_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ): =D \n> Não posso criar por que ja tenho o ZeroTV para fazer as atualizações . =/\n\nVocê conhece alguém que pode?",
				"added": 1475369314
			}
		],
		"1_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 5,
				"body": "Daqui a pouco vão querer banir ou supertaxar até mesmo a Netflix, mas eles já tem uma solução: guiadobitcoin.com.br/executivos-da-netflix-querem-que-o-bitcoin-se-torne-moeda-global-e-adotarao-uso-dela",
				"added": 1476930737
			}
		],
		"2_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": [
			{
				"comment_id": 6,
				"body": "Se puderem, editem preferencialmente a lista de zites, na minha opinião, é uma das partes mais importantes da ZeroWiki",
				"added": 1477004681
			}
		],
		"2_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 7,
				"body": "> [ninjapi](#comment_5_1EcTBTYsro4Vr5ea5NahkseWCK883quWM1): Pelo amor de deus... Essa é a coisa mais estúpida que alguém pode fazer.\n> Limitar gastos nas áreas de educação e saúde é um retrocesso. Históricamente investimos bem mais em educação e saúdo do que a inflação todo ano. Parar isso porque? Parar por 10 anos para ver depois o que fazer? Ridículo!\n> Salário mínimo congelado e somente seguindo a inflação? Não vejo como isso pode ajudar alguém. No final como sempre só se fode quem já não tem dinheiro :(\n> Quero só ver o que vem depois com a Reforma Trabalhista e a Reforma da Previdência.\n\nTrabalhar como MEI é um grande sonho meu",
				"added": 1477004829
			},
			{
				"comment_id": 8,
				"body": "> [brkaka](#comment_32_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Eu discordo. Por que não diminuir os salários do Judiciário, Legislativo e Executivo?\n\nEle não disse ser contra isso",
				"added": 1477004961
			},
			{
				"comment_id": 10,
				"body": "> [brkaka](#comment_35_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3): Verdade, mas o raciocínio de que \"quem é contra a PEC241 é contra o brasil\" induz a pensar que essa é uma medida necessária para tirar o Brasil da crise. Meu argumento foi uma tentativa de demonstrar que há outras medidas muito mais simples e menos danosas à sociedade.\n\nQuais medidas seriam essas?",
				"added": 1477006803
			}
		],
		"1_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": [
			{
				"comment_id": 9,
				"body": "Mais outro aqui. ZeroWiki em português: 127.0.0.1:43110/1QJ8rDLmn4CE2VXpMotAi7bDryRmNLM7Rm",
				"added": 1477005262
			}
		],
		"1_1M5V8ZLTgr8rR7gkAWhCMD7iAsnjFBqL63": [
			{
				"comment_id": 11,
				"body": "O servidor de DNS Dyn sofreu o maior ataque DDoS da história e deixou mais de 60 sites fora do ar, entre eles: PayPal, GitHub, Pinterest, Reddit, Netflix, Disqus e Box, além das páginas dos veículos CNN e New York Times",
				"added": 1477354409
			}
		],
		"1_1GCBbTCjGZsJL7BqdRx13gEbueEnY6gsMm": [
			{
				"comment_id": 12,
				"body": "A MegaNet diferente da ZeroNet, é descentralizada até a estrutura física. Eu super apoio a ideia, assim como apoio a ZeroNet, pois a MegaNet protege mais ainda a internet por nos tornar independente de provedores de internet que estão subjugados diretamente ou indiretamente por governos ao redor do mundo.",
				"added": 1482438583
			},
			{
				"comment_id": 13,
				"body": "youtube.com/watch?v=jzeBaizybgs\nNesse vídeo há um projeto abandonado, nem sei se é funcional, mas se não me engano, tem o funcionamento parecido com o da MegaNet. Se eu tiver errado, me corrijam",
				"added": 1482438812
			},
			{
				"comment_id": 14,
				"body": "Aqui há alguns exemplos de redes mesh: en.wikipedia.org/wiki/Mesh_networking#Examples",
				"added": 1482439586
			}
		],
		"3_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": [
			{
				"comment_id": 15,
				"body": "> [chiarellirj](#comment_1_19Nu5Zmct48eJvwV2Qg7xeioQu8y6eau1z): Será que um dia os anarquistas terão, pelo menos, um território livre para colocar em prática suas ideias?\n\nAo invés de esperar pela política, porque nós mesmos não saímos do estado através do agorismo?",
				"added": 1482454244
			}
		],
		"43_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": [
			{
				"comment_id": 16,
				"body": "Isso é um sinal para a Netflix fazer igual a Steam e começar a aceitar Bitcoin ou qualquer outra criptomoeda",
				"added": 1482454602
			}
		]
	},
	"comment_vote": {
		"106_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"1_13f8nNpQz9u338SU9GVdAfnuFYX1emaNfv": 1,
		"3_1Q9afAmMzsUdnbwDztrFp16dbfQC1Fve3Y": 1,
		"16_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"11_1FM9FnEJ1i4NLEUjxAZ8GqSzGM6M9aKuSZ": 1,
		"51_1Kkc5j5xrEJevvV6sBqCrW93dscMVGbcDY": 1,
		"12_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"13_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"14_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"20_17GoSBQa419SCrJkj4djvTAgRFCDWHKuM3": 1,
		"174_19sggoAZ4hcorrrfWoFWP9rwfpVsL29cnZ": 1,
		"15_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1,
		"1_19abhEkL2342qmxGZafGa7AUHmSxvrDArv": 1,
		"2_19abhEkL2342qmxGZafGa7AUHmSxvrDArv": 1,
		"3_19abhEkL2342qmxGZafGa7AUHmSxvrDArv": 1,
		"16_1PbCor9kCtnKaZAPnrxENbcraKtAEq8wA1": 1
	}
}