{
	"next_topic_id": 16,
	"topic": [
		{
			"topic_id": 1565373491,
			"title": "How much do independent programmers like Nofish earn?",
			"body": "I'm curious how much people who do these kinds of projects make. Zeronet, Fopnu(from the maker or Tixati and Winmx), etc. I mean, here they have these intercontinental platforms connecting thousands of people. Are they rolling in cash?",
			"added": 1565373490
		},
		{
			"topic_id": 1565806779,
			"title": "Censorship on Zerotalk????",
			"body": "There is a thread titled \"Nigger hate thread\". I noticed after I posted on it that it didn't update its position to the top of the list and thought it queer. Now, I see it has been commented on multiple times since then, the latest eight hours ago and yet on my Zeronet homepage, it lists the last update as having been one day ago. Meanwhile, within the Zerotalk zite, it is properly listed as eight hours ago. Thread suppression? Conspiracy? Aliens? You decide!",
			"added": 1565806777
		},
		{
			"topic_id": 1565823101,
			"title": "Poll: What's Worse...",
			"body": "Having sex with an underage girl à la Epstein or incest with an adult offspring?\n\nNow, let's set some rules and say it's consensual in either case. Also, let's put the underage girls as being post-pubescent but under eight-teen. Also, let's say in both cases the offender knows the situation; that is, no long last family or being tricked at a bar by jail-bait.\n\nSo, which one is worse? And please elaborate...",
			"added": 1565823098
		},
		{
			"topic_id": 1565912574,
			"title": "If all White Supremacists converted to Judaism...",
			"body": "Would they go around talking shit about the Goyim to every Jew they could find?",
			"added": 1565912570
		},
		{
			"topic_id": 1565914638,
			"title": "oh schnapp",
			"body": "",
			"added": 1565914633,
			"parent_topic_uri": "1565912878_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM"
		},
		{
			"topic_id": 1565914721,
			"title": "Religion",
			"body": "This community is for the discussion of religion",
			"added": 1565914715,
			"type": "group"
		},
		{
			"topic_id": 1565914757,
			"title": "Test 1",
			"body": "Ignore",
			"added": 1565914750,
			"parent_topic_uri": "1565914721_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565914793,
			"title": "Test 1",
			"body": "Ignore",
			"added": 1565914785,
			"parent_topic_uri": "1565914721_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565914918,
			"title": "Politics",
			"body": "This community is for the discussion of politics",
			"added": 1565914909,
			"type": "group"
		},
		{
			"topic_id": 1565914934,
			"title": "Test 1",
			"body": "Ignore",
			"added": 1565914924,
			"parent_topic_uri": "1565914918_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565914946,
			"title": "Test 2",
			"body": "Ignore",
			"added": 1565914935,
			"parent_topic_uri": "1565914918_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565914998,
			"title": "/B Random",
			"body": "You know what this community is for",
			"added": 1565914986,
			"type": "group"
		},
		{
			"topic_id": 1565915014,
			"title": "Faggots",
			"body": "Troll here",
			"added": 1565915001,
			"parent_topic_uri": "1565914998_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1565915750,
			"title": "Shit, so many good topics wasted on the main board.",
			"body": "I guess we will just need to make our long march over to here.",
			"added": 1565915736,
			"parent_topic_uri": "1565914998_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp"
		},
		{
			"topic_id": 1566158336,
			"title": "Feminism",
			"body": "What is it? What are its goals? Why should one be for or against it?",
			"added": 1566158321
		}
	],
	"topic_vote": {
		"1565820689_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"1565915181_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"1565922813_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W": 1,
		"1565920867_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1
	},
	"next_comment_id": 93,
	"comment": {
		"1565095300_1PnHUGmQkYq4NKZBxFp8o1Wb1ZZijeeYvF": [
			{
				"comment_id": 1,
				"body": "White guy from the U.S. here. Came to China a decade ago and never left. \n\nFuck Hong Kong. A bunch of liberal faggot kids that don't know their dicks from their assholes. China is great, you can do whatever the fuck you want; just don't cause trouble. These Hong Kong faggots are going to all be arrested and have to call mom and dad to come get them out of jail. 8====>",
				"added": 1565205557
			},
			{
				"comment_id": 2,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_598_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): h3bhkj5gqz4n3pjm\n\nNot bad. Where I live, population over 15 million, things are a bit slow. People go to work, take care of their kids, go out to a bar to have a drink with friends or whatever. It's like small town America, but people generally keep their bullshit to themselves instead of making a cause out of everything like back home. Maybe Shanghai or Shenzhen is more exciting but I haven't made it out that way yet.\n\nIt's a good place to have a family, though. I remember going out with friends one night and getting a bit drunker than I'd care to be. On the way back, I cut through an unlit small alley. Now remember, this is in the center of a city that rivals New York or Los Angeles in size. Anyway, up ahead there was a group of guys in black leather jackets smoking. So, I'm thinking to myself that they'll probably cause some trouble with me the lone white guy walking drunk as hell pass them. I get up to near them and one turns to me and makes eye contact, smiles and lets out a half assed hello. I wave and smile as I walk by and they all start laughing. Seriously the safest place you'll ever go. No melon munchers nor bean biters. I love it here, but that's just my experience. Some people come and don't care for it.",
				"added": 1565208094
			},
			{
				"comment_id": 3,
				"body": "> [watteau](#comment_3_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): The protesters are very brave and have scored some sort of victory [...]\n\nIf you give a leftist even an inch, they double down in their rabidity. Despite how the Western media makes it sound, China isn't North Korea. Hell, I've never been so I don't even know if North Korea is really like that. But I sure as hell know what life is like in China and it really isn't bad at all. Boring? Maybe. Orwellian? Hell no. All of this nonsense about protecting their rights and such is fabricated horse-shit. \n\nIf you lead a movement of jackasses blocking businesses and the rest of the majority sane population from living their lives, you are a problem and not a solution. All they will accomplish is forcing China's hand like with Xinjiang. Is that what Hong Kongers want for themselves? Definitely not. \n\nStop the shit, get a job, find a girl, have some kids and carry on. There's no boogeyman except for the one they'll make for themselves.",
				"added": 1565208730
			},
			{
				"comment_id": 4,
				"body": "> [hdidnothingwrong](#comment_4_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): There are numerous ways of getting in trouble in China.  A lot of people resent westeners a hatred which is fed by almost every movie that the government produces. [...]\n\nSo full of shit. Man, I've been here ten years. My wife is Chinese, my two sons are Chinese. I speak fluent Chinese. I've dealt with Chinese police and government workers on so many fucking occasions. You are a liar and a piece of shit. Do your part to make the world a better place and jump off a high place.",
				"added": 1565281430
			},
			{
				"comment_id": 5,
				"body": "> [hdidnothingwrong](#comment_6_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): Sorry to hear that. [...]\n\nLawl, you're a comedic genius. \n\nAnd yes, I can comment on where specifically you are spreading disinformation:\n\n\"There are numerous ways of getting in trouble in China. A lot of people resent westeners a hatred which is fed by almost every movie that the government produces.\"\n\nThere are numerous ways of getting in trouble in any country, it's called breaking the law. A lot of losers from the West come here and think they should be treated as some type of royalty because of their misconception of China as a poor country. This jackasses think they can go around smoking joints and working illegally and then are so shocked to find out that China doesn't need to put up with their shit.\n\n\"In the nightclub scene a lot of Chinese hate westeners for taking the prettiest women. They'll approach you offer to buy you drinks and when you are quite drunk, then they'll kick the shit out of you.\"\n\nMost Chinese women I see with foreigners in clubs are ugly skanks, like the white trash that date black guys. No one is jealous. I've watched another American guy come into a club drunk as hell and started trying to hit on some guy's girl. The guy asked us to handle him and we told him to calm down. He kept making an ass of himself and the dude knocked him across the face. What a poor Westerner, the Chinaman should have just let himself be cucked, right? Faggot. Also, offering you free drinks? Those evil fucks.\n\n\n\"Then there is the government and the police themselves. They're behind most of the crimes. If you displease somebody in government, for any reason, they can make life very hard for you. The authorities themselves will vandalize your property, kill your pet, etc. The Communist system has no feedback mechanism so there is no where to complain.\"\n\nI don't even know how to reply to this bullshit. With the club thing, at-least I had some basis of understanding where you could be coming from. This is straight up pulled from someone's ass.\n\n\"If you want to communicate with others, all communications are heavily monitored by state agencies. If you go to church and make friends there, the government will be deciding who you are allowed to be friends with and what you can talk about. If they don't like who you are talking to they'll block all telephone or chat communication.\"\n\nYeah, it's terrible. A government monitoring their people's online activities. No Western government would ever do some shit like that... *cough.... As for deciding who you are friends with, more poorly written fanfiction on your part. People here are friends with whomever they choose to be friends with. I have friends on all political spectra, even some Chinese who disagree with the government.  :O < (that's me making a shocked face). If you've been arrested for causing public disturbances, yeah, I could imagine you being kept from social media. But fuck those people anyway.\n\n\"China is not a good place. If you stay there long enough, you'll realize that.\"\n\nYeah, ten years here. A buddy of mine has been here fifteen. All I've realized in that time is that a lot, not the majority mind you, but a lot of faggot foreigners that come here seem to think they are owed something by China and its people. When they realize Chinese men and women aren't just waiting to be cucked by foreigners, they pout and complain before moving to the Philippines or some other shit country where they'll be treated as special.\n\nSo yeah, again, you are a liar and a piece of shit. Also, fuck Japan, but that's a whole other discussion.",
				"added": 1565366794
			},
			{
				"comment_id": 6,
				"body": "> [watteau](#comment_20_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): Great Britain has a moral obligation to take an interest in the welfare of the Hong Kong citizens.\n\nYou're right. They should help the PLA denounce all of these dickwads causing trouble for the working men and women of Hong Kong.",
				"added": 1565367102
			},
			{
				"comment_id": 7,
				"body": "> [hdidnothingwrong](#comment_7_1LW31sbmLZebhhgTx2bhzeUNYbZ5cYnBfe): If you are not jealous why do you sound like an r/happa or asianmasculinity poster?\n\nI don't know, maybe it's because my two boys are Chinese and I don't like the idea of a bunch of faggots, faggots from countries that are actively letting themselves be destroyed through their own cuckoldry, hating on them. Maybe I like how China protects itself from the liberal bullshit that I think is destroying my people and I'm not about to stand by while the West vilifies them and tries to shove this cancer down their throats. \n\nI don't know why I feel this strong impulse to defend China, my adopted home, but maybe it has something to do with that.",
				"added": 1565369013
			},
			{
				"comment_id": 10,
				"body": "> [watteau](#comment_55_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o): https://www.bbc.co.uk/news/av/world-asia-china-49317261/hong-kong-protests-violence-erupts-in-train-stations [...]\n\nOr don't block escalators. Fuck them, I hope the pellets hit them in their little shriveled nuts.",
				"added": 1565637066
			},
			{
				"comment_id": 14,
				"body": "> [nicehat](#comment_4_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw): Stirring up shit in HK is one of the few things that the seeeyeayyyyyy is doing that is legit what they were created for lol. I like that china exists but they really need to stay in their place.\n\nThe West blew it. Do you really want to fuck up China, one of the last places where men control shit, so the whole world will be under the influence of Cuckywood? Be smart, jump ship. The United Faggots of America are doomed.",
				"added": 1565640035
			},
			{
				"comment_id": 15,
				"body": "> [nicehat](#comment_5_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw): I see your point I am just not willing to concede that the US is that far gone yet. As for china there are better patriarchal cultures to model after if it cam to that.\n\nhttps://thesocietypages.org/socimages/files/2012/11/117.jpg\n\nRead it and weep. Also, remember half of that 47% projection for 2050 are women. Throw in all the white knights and social justice warriors and think long and hard about what your endgame is and what you get for blocking China. \n\nOnce I learnt Chinese, I fit in here like white on rice. They value education, they value hard work, they value reason and logic, they value basically everything the West did up till the point the West decided it was more important to embrace diversity and empower the women than to encourage critical thinkers and hard workers.\n\nPlus, I think of it like this: what are you fighting for? Your people, your blood, right? In the U.S. it's taught that authority is an enemy, that smart white men are always the villains, and that being a hard worker or a good students makes you a loser. It's like some bizarro world. My blood is with me, and it came with me to China and it runs through the veins of my Chinese sons. My blood is now Chinese blood and it's going to thrive. That's how I see it.",
				"added": 1565642256
			},
			{
				"comment_id": 16,
				"body": "> [nicehat](#comment_6_1LPjWhB47YZwaWoSQH1d2tnj2E3JnMU2cw): \n\nYeah, I've met a few Poles and Hungarians over here. They're alright. Besides Chinese, most of my friends are Slavs; Russians and Ukrainians, or Brits. Good folk. The Americans that come to China are generally faggots; such as this one cunt here who was arguing that only whites could be racist (she was white, obviously).\n\nAs for Balkanization, I think it will never be allowed to happen. In the next twenty years or so, America will have it's last White male president. After that, the country and military will be controlled by leaders that will need to use you as a means of keeping the GDP acceptable. Read about Catalonia in Spain. \n\nThe obsession for the far East, that's more a Japanese thing. China is like Detroit in its heyday; industrial and with opportunities to get a good job. Japan is like L.A., full of faggots. They attract different types. I never planned to marry a Chinese nor settle here; things played out that way, but I just came for a job.\n\nBut about the cutting bait, I don't think it will ever just be an obvious moment. It'll happen slowly over decades. In-fact, it seems to me, the water in the pan is already at a boil.",
				"added": 1565646563
			}
		],
		"1565373491_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 8,
				"body": "> [chinchin](#comment_15_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im): The programmers of that kind depend on either donations or on one-time-jobs they get from their own contacts.Or they just have a normal job.\n\nYes, I understand they are not generating any revenue through their platforms as they are free of ads and of cost. What I mean to ask is how much do programmers of their caliber typically earn through their day-jobs and contracts. Simply, how much is their time worth?",
				"added": 1565374407
			},
			{
				"comment_id": 9,
				"body": "Actually, I'm just curious how much it would cost to hire programmers to make an app like Fopnu or Zeronet for me.",
				"added": 1565374650
			}
		],
		"1565601555_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 11,
				"body": "They're a bunch of rioting pubescents that have been brainwashed by faggots.. Their parents have failed and should shoot them in the face before proceeding to try again for mentally functional offspring. If these cucked HKers want to be America's bitch, I have a big white American cock waiting for them on the mainland. Come TASTE the freedom.",
				"added": 1565638421
			}
		],
		"1565638539_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 12,
				"body": "I think all governance is inherently unstable. In any system, a few player will, whether through skill or circumstance, come to dominate the game. As the players that control the wealth can naturally buy power, they will seek to protect themselves and their winnings. As the cycle repeats, other players slowly find themselves locked out of being able to play and win, that is, of obtaining true upward mobility. Eventually, the vast majority of people realize they are by then slaves to the elite and set about to change the system (possibly through violence), once again, into one in which they have the potential to win the game. Then, the it all repeats. \n\nAt-least, that's how I see it.",
				"added": 1565639427
			},
			{
				"comment_id": 13,
				"body": "And communism? The same, except skip immediately to the slavery part.",
				"added": 1565639555
			}
		],
		"1565678144_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 17,
				"body": "They're great. I think they keep white folk on their toes and keep us from getting too soft. Every liberal I have ever met has been raised devoid of contact with actual blacks (maybe some contact with cream of the crop types) and as such is a complete faggot. Food for thought.",
				"added": 1565701100
			},
			{
				"comment_id": 20,
				"body": "> [dtek](#comment_5_14BhfodWhzPjujQB97t8A5R4r59T7iqopJ): violent rape music?\n\nNo, the violent rap music was just something to listen to while he was doing his raping. I'm the same actually, I listen to Beethoven while doing my light reading, Mozart whilst cooking and always violent rap while raping. It really puts you in the mood for some good ol' fashioned rape.\n\n-edit test-",
				"added": 1565814171
			},
			{
				"comment_id": 21,
				"body": "> [fuhrer](#comment_5_17FPf2gMpv4fcnV5dRnKqj56JVagtkGNSF): I was waiting in line at the grocery store and an annoying nigger was behind me raping to his violent rap music he was listening to on his cell phone speaker.\n\nI would have found it quite annoying if someone was raping my behind as well.",
				"added": 1565814564
			},
			{
				"comment_id": 30,
				"body": "I think it is safe to say that whites are inherently more intelligent than sub-Saharans. Northern Africans, such has the Moors are not \"black people\". In-fact, northern Africa is the birth-place of Western civilization. Ashkenazi Jews, a Semitic people related to North Africans with European admixture have been ranked the highest I.Q. ethnicity many times at around 116. Sub-Saharans have I.Q. ratings between 60 and 80 with the later scores being from those trying to disprove they have a low I.Q. and despite their inherent bias, still coming up with only 80.\n\nNow, does any of this imply that they are less human or less deserving of equality and fair treatment? I definitely think not. However, I do have a problem with glorifying thug culture. In-fact, I think it has been Hollywood and popular music that has perpetuated this culture onto the black American man. They've been fed that to be black they have to be thugs. They've been fed a hatred of selling out or being an \"Uncle Tom\". These ideas, I do not believe, came from within but were seeded to them and re-enforced to sell them as \"the other\" in music and film.",
				"added": 1565866941
			},
			{
				"comment_id": 33,
				"body": "Mesopotamia and Ancient Egypt have the earliest recorded civilizations in the Western world. Greece continued their legacy before the torch passed to Rome and finally to the Germanic world. The Greek alphabet is derived from Phoenician which is a Semitic alphabet from Lebanon that was itself derived from Egyptian hieroglyphs... from... Northern Africa... So, yeah.",
				"added": 1565873515
			},
			{
				"comment_id": 37,
				"body": "The problem is that our Western model of civilization doesn't fit with their inherent natures. Their reproductive strategy and our own is fundamentally different in one extremely important regard: family structure.\n\nBlacks, whether \"oppressed\" in the Americas or from royal families in Africa, all have certain traits in common in choosing a mate. Have you noticed their taste for large women, their taste for strong women, for financially independent women? Why? Well, those traits make perfect sense if you intend to mate with a female and then leave and not help raise the resultant child. A big woman must have food resources, a strong woman can protect her offspring and independent women will not need your help raising a child.\n\nWhites, Asians and Arabs on the other hand also generally share a certain taste in women: thin, dependent and physically weaker than ourselves. Why? We enter into a contract with them whereby we provide protection and support and they offer exclusive access to their vaginas and commitment to maintaining our households. \n\nWestern and Eastern society both relied on this model. We rear our children with attention and the division of labour between man and woman has allowed us to improve our lots from one generation to the next. With this advantage, blacks have no hope of competing in our Western and Eastern civilizations. It's sad but true.",
				"added": 1565893040
			},
			{
				"comment_id": 48,
				"body": "Reminds me of a buddy of mine. He was going on and on about how Jews control everything. I asked him why don't the white supremacists get together and help each other take over Hollywood, the media, et cetera. He said it's impossible, the Jews are too smart and it's too late.\n\nI stopped him looked him dead in the eye and asked what the hell he was doing in China; he should be in Israel finding a Jewish wife considering how much respect he has for them. He walked out and hasn't spoken with me since...",
				"added": 1565910499
			}
		],
		"1565689573_1JjyvqhjWDqSncWvSoGxAGKr4SNXr1Kwpi": [
			{
				"comment_id": 18,
				"body": "My political views are best described as: Assimilated conservative white guy's thoughts on XiJinPing's thought's on Socialism with Chinese characteristics for a New Era. Once you understand that, I'm as easy to read as a road-sign.",
				"added": 1565701378
			}
		],
		"1565806779_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 19,
				"body": "Strange, for me it is still listed as having been updated one day ago on ZeroHello and at the top of the list on ZeroTalk. Maybe it's a bug, I edited my comment immediately after posting to fix a spelling error. Maybe that corrupted my timestamp or something?",
				"added": 1565807285
			},
			{
				"comment_id": 22,
				"body": "So, after I posted again to the thread, it is now functioning correctly. Go figure",
				"added": 1565814661
			}
		],
		"1565777168_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 23,
				"body": "I haven't left home in days and have only left bed to piss and get food from the refrigerator. And further, the perfect time to get out, yesterday, already passed me by. Woe is me.",
				"added": 1565814917
			}
		],
		"1565817854_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 24,
				"body": "Not today, C.I.A.",
				"added": 1565818997
			}
		],
		"1565820689_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 25,
				"body": "Nice math, too bad it will never see the light of day. They have their narrative and it is what will be pushed: \"Steve King is a loony pervert!\". The sad thing is that the vast majority of people are completely retarded and the validity of his point holds no merit to them. Most popular movie prediction for next year: Ass ( from Idiocracy )",
				"added": 1565821312
			},
			{
				"comment_id": 26,
				"body": "> [aspidochelone](#comment_58_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): I have seen two stories in which a father and daughter were prosecuted for incest.  There is no doubt in my mind that a father who takes advantage of his daughter, even one who is nominally over 18 and an \"adult\", is committing an extreme abuse of power that can be criminally penalized.  The notion of prosecuting the daughter utterly sickens me, even before her confinement to a location leaves her vulnerable to murder.  (Katie Pladl)  To me, prosecuting her is the same sickness as laws against homosexuality, and giving her baby, if she had one, a special exemption from abortion laws meant to preserve human life is to say it is an untermensch that should be exterminated for genetic inferiority.  Yes, the risk of genetic disease in incestuously conceived infants is much higher.  But those babies who DON'T have a genetic disease have had their DNA \"wrung out\", so to speak, and we now know they don't carry harmful recessive genes in full randomly chosen one-fourth of their genome. [...]\n\nYeah, I also find the whole concept pretty disturbing. However, I don't believe it is the power dynamic that offends, more an instinctual repulsion to the idea of mating with your own offspring. For example, a man, in sleeping with a slave of his, doesn't elicit any of the raw disgust that the concept of incest does for me. I think it's simply evolution telling us that we'll fuck up our offspring and lower their reproductive fitness.",
				"added": 1565822333
			},
			{
				"comment_id": 29,
				"body": "> [aspidochelone](#comment_63_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): @iloveguac:  two recessive alleles for genetic disease need to \"meet up\" in order to kill the unlucky inheritor and remove themselves from the gene pool.  Incest makes more of them meet up, but this is something that would have happened anyway at some point.  So if you assume we're going back to the Stone Age, nothing of value is lost.  If you think we are headed to gene therapy utopia in two generations, maybe it's a nasty thing to do.  But even if it is a nasty thing to do ... how does it compare to old men siring babies (higher mutation rate) or old women delivering them (more Down syndrome)?\n\nIt's a numbers game. I think that's why historically cousin luvin' was fairly acceptable, incest between siblings was looked down upon and incest between parent and offspring has always been considered sickening. Parents and offspring share 50% of their chromosomes. \n\nAlso, old men siring babies has never been a problem.",
				"added": 1565865559
			},
			{
				"comment_id": 35,
				"body": "> [aspidochelone](#comment_68_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Parents: AB CD -> children AC AD BC BD.  Dad shares 50% of genome (A or B).  But children also share 50% on average (AC shares A with AC, AD and C with AC, BC: note you have to count AC-AC as a possibility because there's nothing to keep the random passage of genes from repeating)  So both parent-child and brother-sister are \"first order relatives\".  Parents are only more sickening because of the abuse of power and abandonment of the parent's role, not genetics.\n\nWhile it is possible for siblings to be 100% related, it is also possible for them to be 0%. I think appearance would be one indicator and I'd find a sexual pairing of siblings that looked similar to be more off-putting than a pairing that were very different in appearance. \n\nWhat are your feelings about Woody Allen marrying his adopted daughter? He was in a parent-role, but then abandoned it for a romantic role. If we assume that there was no abuse when she was a minor, do you still feel it is contemptible?",
				"added": 1565875214
			}
		],
		"1565823101_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 27,
				"body": "Okay, let's go with Epstein at 15.",
				"added": 1565827117
			},
			{
				"comment_id": 28,
				"body": "So, you are walking down the street whilst minding your own business. Suddenly, to the left of you, Epstein is banging a 15 year old. Shocked, you turn to the right. What's that? Steve King with some girl. Oh my god, she has an I.D... it's his adult daughter. You pull your trusted gun from the holster and see there is just one bullet....",
				"added": 1565827491
			},
			{
				"comment_id": 31,
				"body": "> [unadu](#comment_11_16tiWQCvXDH6r8GWNGUzvvnAHqN89eX72W): Post-pubescent but under eight-teen is just 16 or 17. With maybe 15 depending on the girl....... What Epstein did is pretty much prostitution, none of those girls did it because they thought that hes hot and he got their panties wet, and he needed fresh meat again and again... sick fuck should hang.. [...]\n\nSo, you believe soliciting a prostitute is a crime deserving of death? Also, puberty typically completes by age 14 for females, some complete before and some after. Actually, I remember reading that it is completing earlier and earlier for some reason and many suspect it is the sexualized media we are being exposed to.",
				"added": 1565867277
			},
			{
				"comment_id": 32,
				"body": "> [ratsmack](#comment_14_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): Day before girl reaches age of consent... you're a Pedo. Day after girl reaches age of consent... you're golden. [...]\n\nActually, pedophilia is defined as the attraction to a *pre*-pubescent girl. As puberty typically starts around age 10, to be an actual pedophile you would have to be attracted to girls younger than that. But, my question wasn't about pedophilia, it was about incest with an adult vs sex with an underage but post-pubescent girl.",
				"added": 1565867519
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 34,
				"body": "I previously subscribed to this same view, but am not so certain anymore. While there are more abortions happening amongst the poor, they also have a much higher reproductive rate in general. In other words, a poor woman may get pregnant ten times, abort eight of them and still have twice the children of a middle income woman who has been pregnant twice and aborted once. \n\nI think it is best to consider class much as how a racist considers race: there is very little mixing between income stratum. Also, their lot in life is largely owed to their genetic potential. So, the priority should be on reducing abortions for the in-group high-income women and also increasing their rate of reproduction in general. If the out-group women have more children as a result, it does not affect the in-group negatively and is a source of exploitable labor.",
				"added": 1565874074
			},
			{
				"comment_id": 38,
				"body": "> [shiok](#comment_3_1D8TyrF6WYHSWMPSwRCmDR868WxaTihFjA): Everybody has the right to abort. Every parent has the right to not let his/her child suffer because of foretold illness. No parent in this world would ever want to send his/her child off before they do. And no parent would want to worry for their child's survival after they pass away. Not to say parents willing to risk it are not doing the RIGHT thing. Because this is the point, there is no RIGHT thing, it is only a choice.  [...]\n\nWhat about parents that abandon, traffic, murder or do other selfish things to their children for their own gain? Will it be a no true Scotsman reply? I disagree with you and say, yes, some parents simply don't want children because they think it'll cramp their style or put a hole in their pockets. \n\nIf the child has been confirmed to carry some disease, I agree that to end it may be the best choice.",
				"added": 1565894083
			},
			{
				"comment_id": 40,
				"body": "What about so called \"After Birth Abortion\"? Is that my right as well? Where's the red line? And where's my hairline?",
				"added": 1565896927
			},
			{
				"comment_id": 43,
				"body": "> [eighty4](#comment_22_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX): Creationists are mentally ill and need to be committed to mental hospitals\n\nNew Agers are even worse.",
				"added": 1565902938
			},
			{
				"comment_id": 44,
				"body": "> [edgelordofdecent](#comment_53_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Have to hang them because you can't refute them. Lol creationists resort to violence because they can't argue.\n\nI think that pattern holds regardless of political persuasion. It makes sense though; history is written by the victors of violent confrontations, not those who had better arguments.\n\nIs it morally wrong for the ugliest man on Earth to resort to rape if he knows he will never reproduce consensually? 'Tis not, sayeth I!",
				"added": 1565903973
			}
		],
		"1565889331_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 36,
				"body": "\n\nI just read through a few of this guy's posts and am starting to suspect trolling.",
				"added": 1565891935
			},
			{
				"comment_id": 41,
				"body": "Look, if I block someone, they should be blocked from everyone, their lives should be destroyed and they should basically just die. I'm special and important and people need to defer to my omniscience. Don't you know my parents told me I'm super special? Know who you're dealing with, you arrogant cunts.",
				"added": 1565898794
			},
			{
				"comment_id": 46,
				"body": "> [xcape2net](#comment_306_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I hear you.  I came here after being shadow banned on Reddit without explanation.  I'm not saying 8Chan people don't have every right to be here.  I'm just saying that they have darkened the friendly atmosphere that used to be here.  And, some people have apparently chosen to leave because of it.\n\nIn which way? Is it the sarcasm? I don't know much about forum etiquette, I've never been on either Reddit nor 8Chan and as such didn't realize this place would be considered dark or unfriendly. Actually, to me, the people on this site seem to be fairly reasonable and the few trolls are decent and serve to keep things lively.",
				"added": 1565909143
			}
		],
		"1565888794_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 39,
				"body": "> [theecollector](#comment_38_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): yeah im on IOS dont have shit 😕 this is one of those rare times that android is better than IOS... common devs hook us up with a zeronet for IOS i refuse to own another android!!\n\nGet a Huawei, the UI is similar to IOS",
				"added": 1565894470
			}
		],
		"1565542665_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 42,
				"body": "OK!",
				"added": 1565902861
			}
		],
		"1565880498_1CyoFuqywpEgKYPHjQUui3TJQuEDqNqThN": [
			{
				"comment_id": 45,
				"body": "> [theecollector](#comment_37_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU): ok i just a few mins ago came to this realization... hear me out and give feedback!! [...]\n\nThat's how to government here used to take care of problems, sweep it under the mat till everyone forgot about it and it was taken care of. They'd tell the papers and news stations not to mention this or that. Or to just report facts and not take a stand on the issue. I mean, yeah, it works. Surprisingly, they've started to change recently. I think television has a way of radicalizing people. When the television avoids taking sides on major issues, it leaves people to consult their family and friends. And, I think, this creates more nuanced and natural feelings toward issues.\n\nBut yeah, that's media censorship. It's never been the case here, so long as I've been here anyway, that you weren't free to discuss whatever you choose in private or with your friends and associates. I think censoring person to person topics is a really bad idea and would create a lot of resentment in the populace.",
				"added": 1565906427
			},
			{
				"comment_id": 63,
				"body": "> [nickwa](#comment_366_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): They started doing that recently because they have been more free than the stupid big tech companies, ironically. The only way for people to fight the monopolization with Google is to use Chinese services that are actually more free. Only 2nd option is to use crypto, because apparently places like Bitchute cannot use any payment processors from MasterCard and the like. And then you get mad when the government tries to step in to stop these blatant monopolizing companies?\n\nSome Chinese services are pretty great, but the search engines suck ass for English results.",
				"added": 1565949405
			}
		],
		"1565908709_1KUSKrffaR1sfLwxZUXUPshLpKhh5PXWm7": [
			{
				"comment_id": 47,
				"body": "Seriously though, no one was rude to you. I didn't see a single person even swear at you. Meanwhile, you've been calling everyone cunts non-stop. This is not trolling nor anything like that, but I truly think you need to calm down and stop thinking so highly of yourself. There are going to be people who disagree with you, who joke with you and who don't think everything you have to say is all that significant. Accepting that is part of being a grown up, man. I hope you get there.",
				"added": 1565909992
			},
			{
				"comment_id": 52,
				"body": "> [bigbadbob](#comment_290_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I wonder if he is gonna have a bunch of questions on how to uninstall the software..\n\nHe'll call us cunts when we tell him to just delete the folder.\n",
				"added": 1565914336
			},
			{
				"comment_id": 58,
				"body": "> [kaffie](#comment_1036_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): The only government we got here is the chinese one.\n\nLol",
				"added": 1565937784
			},
			{
				"comment_id": 72,
				"body": "> [fucknigggers](#comment_1_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): No, Richard, it's 'Linux', not 'GNU/Linux'. The most important contributions that the FSF made to Linux were the creation of the GPL and the GCC compiler. Those are fine and inspired products. GCC is a monumental achievement and has earned you, RMS, and the Free Software Foundation countless kudos and much appreciation...\n\nLol, I like the name change at the end to Fuck Niggers, but keeping him as Richard",
				"added": 1565976030
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 49,
				"body": "> [styromaniac@kxoid.bit](#comment_107_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3): This pedarast does not represent us.\n\nHe'd technically be a pedophile, not pederast. Pederasty is gay pedophilia towards little boys. \n\nInteresting fact: according to Plato, what separated the civilized Greek man from the barbaric Germanic people were Greek Pederasty, Nude sports and Philosophy.",
				"added": 1565910681
			},
			{
				"comment_id": 68,
				"body": "> [0rbit4l](#comment_9_1PVDwMjZ8jDs5sbGH3q92xNNHR8iHCC4ya): Shadman\n\nI just looked that up to get the reference. Fucking bastard, I'm burning my hard drive now.",
				"added": 1565972939
			}
		],
		"1565912574_1BGMdmnUwq2Bz94TfyZLwHTGTA5kprbsvg": [
			{
				"comment_id": 50,
				"body": "Great, just so long as that we is the exclusive, and not the inclusive, we. \n\nAs...\n\n\"We are the tip of the spear. \"\n\nSounds dangerous, count me out.\n\n\"We are the real niggas.\"\n\nI'm not really a \"nigga\" at all, I think I'm Germanic or something. \n\n\"We are making a difference. \"\n\nWhat difference? \n\n\"We will change the world. \"\n\nOh shit... Well, don't fuck it up.\n\n\"We will overthrow tyranny\"\n I'm arguable a supporter of tyranny in your eyes. \n\n\"We will fight the system.\"\n\nI like the system. \n\n\"We will bring down the New World Order.\"\n\nThe same one you make after fighting the system?\n\n\"God Bless you brethren.\"\n\n I'm an atheist, sorry.\n\n(Welcome though, I'm just joshing you about)",
				"added": 1565913488
			}
		],
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 51,
				"body": "I married a virgin. Well, she wasn't a virgin when I married her, but she was when I met her. Pretty traditional values too. Eighteen when I met her, so I guess your argument isn't universal.\n\nBut yeah, I do see your point (about the rights thing not the 12 thing). I'm not against arranged marriages. Also, I think female rights is something every man, on the basis that he is a man alone, should be against. At-least, rights comparative to our own. The truth is that power is derived from force. Women lack force and derive their power from males offering it to them. Traditionally, this was the father and then the husband. In today's society, it is \"woke\" white knights that have been brainwashed into short-term non-strategic behaviour freely giving their force to defend these women who then abuse this power and give nothing back to the male.",
				"added": 1565913991
			},
			{
				"comment_id": 54,
				"body": "> [kaffie](#comment_1032_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh): Truly amazing that you didn't even read the post. The argument was for an age of consent at 18 and an age of marriage at 12. So they wouldn't be fucking a 12 year old. That said, I still don't really see the argument. People that young really don't have a full grasp on life, let alone enough information to determine a partner for the rest of their life.\n\nI think the argument is the females shouldn't be the ones deciding their life partners. They should be married off before they begin having sexual relationships to prevent their promiscuity. It's what Muslims do and what our ancestors did. I mean, it works. Is it moral? I don't know. I am pretty selfish and probably am not a going to offer an unbiased response.",
				"added": 1565916044
			},
			{
				"comment_id": 59,
				"body": "> [edgelordofdecent](#comment_55_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): You want involuntary marriages arranged for little kids at a young age. Just because muslims do it does not make it justified. This might as well be considered rape.\n\nNo, I was clarifying my interpretation of the OP.  While I am empathetic to the concept, I am not promoting it.",
				"added": 1565938195
			}
		],
		"1565914749_1D9oYXWZH2S55PeoCFDKTqq8roNXqZqP7n": [
			{
				"comment_id": 53,
				"body": "test",
				"added": 1565915055
			}
		],
		"1565915750_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 55,
				"body": "Faggots, tell me what happens when you go to your gay porn sites.",
				"added": 1565916206
			},
			{
				"comment_id": 56,
				"body": "I see, if you love cock then please post a bunch of random shit in the next message.",
				"added": 1565916789
			},
			{
				"comment_id": 57,
				"body": "Just as I surmised...",
				"added": 1565916830
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 60,
				"body": "Thanks",
				"added": 1565938236
			}
		],
		"1565946923_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": [
			{
				"comment_id": 61,
				"body": "Benny Lava is in.",
				"added": 1565947267
			}
		],
		"1565940672_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": [
			{
				"comment_id": 62,
				"body": "They invented the White man. It was an experiment by a mad scientist of theirs named Yakub. It's on Wikipedia.\n\nhttps://www.finalcall.com/artman/publish/Perspectives_1/article_9878.shtml",
				"added": 1565947510
			}
		],
		"1565966684_1HnEYBLwyqrym7tJhQgrdyRGQ2W1dkJMsD": [
			{
				"comment_id": 64,
				"body": "What the hell is this, ProtonVPN propaganda? I feel I'm being sold a time-share!",
				"added": 1565968914
			},
			{
				"comment_id": 65,
				"body": "> [trevorlaneray](#comment_70_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Heh, I feel ya. We are kinda coming across as shills for their VPN service...\n\nI'm not trying to be offensive nor troll with what I am about to say, but I suspect you are a federal agent, journalist, or some other person that is here in an official capacity. This isn't about the VPN, it is that I just searched your name and all of your comments feel like the type one would make if they knew they were to be subject to review. \n\nJust saying, I'm probably wrong and no hard feelings. You're a very polite person.",
				"added": 1565970349
			},
			{
				"comment_id": 66,
				"body": "> [trevorlaneray](#comment_72_12eXcQ1ojAbyCoCcMQ3JAKi73wgcJrjow3): Ahhhh, god, I've got the giggles again. Yeah, no, I'm just a script-kiddy computer enthusiast. [...]\n\nYeah, I just realized you seemingly go by your actual name. Is that you at the .com? That's pretty trusting; putting all of your personal information out there like that. \n\nAnyway, you're an interesting character for a semi-anonymous site like this and I apologize for derailing the thread.",
				"added": 1565972085
			}
		],
		"1565969602_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": [
			{
				"comment_id": 67,
				"body": "Shit, I'm leaving China to find a true communist country!",
				"added": 1565972558
			},
			{
				"comment_id": 69,
				"body": "> [russianspy](#comment_10_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): I bet you live in hong-kong anyways...Prostitution cannot exist under communism....Meaning that there is no hoarding of resources that leads to exchange as a necessary general rule of the economy. [...]\n\nThe mainland.  But wait, so there is no service industry in communism?",
				"added": 1565973429
			},
			{
				"comment_id": 70,
				"body": "> [russianspy](#comment_12_1A3LTcwaXGFQJb7KDN4rbgYzNFQdAWEXa9): That's actually dope as fuck. How do you get onto zeronet with the government blocking the interbutts? Do you use a bridge through tor?DeleteAlso, yeah, I mean, you haven't studied marx in school? I know the Chinese government is repressive, but, they make yall read marx I though.\n\nYeah, some things are blocked like Google and Facebook. Torrents work fine and Zeronet didn't have any trouble. Tor needs a bridge. \n\nI wasn't raised here, came over ten years ago. Politically, kids just learn national pride and civic duty stuff at my older son's age. Maybe there's some Marxism in middle or high-school, but again, I'm sure it'll mostly just be more civic duty lessons.",
				"added": 1565974154
			},
			{
				"comment_id": 71,
				"body": "> [fucknigggers](#comment_6_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG): How does prostitution in chink land work?\n\nIt's more like an escort service here; you have a girl arranged for you over your cellphone, no road-side whores. Well wait actually, I heard some Africans were offering their services road-side in Beijing and Shanghai. They've probably already been deported though. MCGA!",
				"added": 1565974680
			},
			{
				"comment_id": 73,
				"body": "> [defconzero](#comment_4_1C4sZqqLnExKmkEWXvxtcHyPWE7ogzfjCE): It's more like the hot chick is chained to a wall and gets fucked by the CP elites, they throw you into a concentration camp, harvest your organs, and buy a Lamborghini with the proceeds.\n\nThat's only done to NPC faggots. You should stay away, though.",
				"added": 1565990359
			},
			{
				"comment_id": 74,
				"body": "> [223556](#comment_141_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9): Unlike you virgin worker niggers I would be a chad card carrying member of the highest elite of the party.Might get drunk and give away crimea idk\n\nNow I'm stuck looking at Chad memes, jackass",
				"added": 1565993014
			},
			{
				"comment_id": 77,
				"body": "If man is inherently greedy, a system that rewards greed would have no bias towards greed. Only the most capable would succeed within said system, not the most greedy.\n\nLet's change the word greedy to calorie -dependent; all animals are calorie -dependent. Animals that have a stronger tendency toward calorie -dependence are not rewarded more than animals without a tendency toward calorie -dependence as the later doesn't exist. We are all equally calorie -dependent and those that can satiate their desire reproduce their DNA and those that don't die. \n\nAll life is greedy. ",
				"added": 1566115712
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 75,
				"body": "https://study.com/academy/lesson/average-age-of-marriage-throughout-history.html\n\n\"Still, while marriageable age was rather young, not everyone married at that exact age. For instance, in ancient Rome, a society who did keep extensive written records, someone was considered eligible for marriage at age 14. For many families, this was the perfect time to arrange a marriage for your daughter and son, but for some families, there could be an advantage to waiting. If a child had political, social, or economic opportunities, there could be advantages to holding off on their marriage for a few years until they achieved a greater political, social, or economic position. So, ages of marriage varied widely across the modern world, but on average were still young by our standards. \"\n\n\"One of the first times we see a major concern about the age difference between couples is in England in 1275 CE. In a law prohibiting rape, it was also declared illegal to 'ravish a maiden' within a certain age, with or without her permission. That age was determined by jurist Sir Edward Coke to mean the age of marriage, which at the time was 12. This still seems young, but it's one of the first times we see a strict age limit placed on marriage or sexual interaction. This was the beginning of our modern association between the age of marriage and age of consent.\"\n\nAge of Consent in European & American History. Portugal, Spain, Denmark and the Swiss canons, initially set the age of consent at 10-12 years and then raised it to between 13 and 16 years in the second half of the 19th century. Historically, the English common law set the age of consent to range from 10- 12.\"",
				"added": 1566113334
			},
			{
				"comment_id": 80,
				"body": "I think it comes down to female empowerment. The earlier a female is married off, the less empowered she will be. In our modern cuck society, the need for female empowerment is axiomatic, it's a-priori. As such, anything that would threaten that empowerment is deemed socially offensive to the highest degree. White knights are here to threaten you with death should you question this.",
				"added": 1566157523
			},
			{
				"comment_id": 87,
				"body": "https://teapartcommunity.s3.amazonaws.com/file/pic/photo/2018/06/14fc1dddf8fd049402d2649a0e0019c8_1024.jpg",
				"added": 1566161473
			}
		],
		"1566074416_1PGDKdsYUcJajEbqqgb91pJp1rUzznwGvU": [
			{
				"comment_id": 76,
				"body": "What the fuck did I just read?",
				"added": 1566114002
			},
			{
				"comment_id": 92,
				"body": "Slavs are fucking awesome. The Slavs that come to China are much higher class than the Westerners that come here. YYYuge difference. Also White as fuck, many are blondes and most have blue eyes.",
				"added": 1566171526
			}
		],
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 78,
				"body": "Studies show light alcohol consumption to be beneficial in many regards. One way in particular is that it lowers mortality risk. I think it's a reflection of a teenage world-view to associate drinking with drinking to intoxication. Adults, excluding drunkards, general don't drink to intoxication. It's simply a social catalyst that brings us together.",
				"added": 1566156517
			},
			{
				"comment_id": 79,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): who wants that ?\n\nlol",
				"added": 1566156892
			},
			{
				"comment_id": 81,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_800_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): well said, it takes courage to step out the pack. congrat.\n\nThe \"pack\" within this thread is completely on his side of this debate, save my comment and one other. He isn't stepping out of the pack, he is rallying the mob.",
				"added": 1566158566
			}
		],
		"1566158336_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": [
			{
				"comment_id": 82,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_801_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it was an enginering (mental) tool, works on some, the most gullible.\n\nYeah, I agree. It seems to not just serve no beneficial purpose for me, but to actively work to disenfranchise me. Yet, it seems many people expect I should embrace it.\n\nIs there anyone here to defend it? I'd like to hear the other side of the debate.",
				"added": 1566158837
			},
			{
				"comment_id": 83,
				"body": "> [bigbadbob](#comment_332_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I'm for equal human rights.  Any things beyond that like protected groups or special interest groups is no longer equal rights.  The government is too big when they have time to make silly laws to goat people against each other.  IMOWhit that said... I think feminism was a movement that should be over awhile ago.\n\nWhy stop at human? Why not equal rights for chimps and dolphins? For cats and dogs? \n\nI know this seems like a loaded question, but it is truly how I perceive the notion that I should have some empathy for the plight of female equality. They are not me so why would I want to help their group, especially when by doing so I am hurting myself?",
				"added": 1566159008
			},
			{
				"comment_id": 84,
				"body": "> [ascetic](#comment_1_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): All beings, or at the very least, all humans should be granted the right to move away from a situation that causes them suffering, otherwise non-consensual situations/acts upon an individual are implicitly \"okay\". Women shouldn't be controlled against their will anymore than men should be controlled against their will, however it is prudent to recognize the differences psychologically between men and women, and how people react to both the sexes. Look up \"Women are Wonderful Effect\" to see how biased most people are for women. This plays out practically in the fact that women have a natural social advantage over virtually all men, but then they also want the social advantages men have created via society WITHOUT the responsibilities that go along with it (They want equal pay, but don't want to take stressful/dangerous jobs, they don't want to be eligible for the draft, they want gender quotas in jobs and universities of their choice instead of it being merit based, etc). [...]\n\nSociety controls us against our wills daily. You can only eat, smoke, watch, do or say what has been allowed you by your government and social norms. All rights are given or taken in response to force. Men have force, females don't. Their only rights are the ones we give them. So, why do we give them rights that disadvantage ourselves? It seems mad to me.",
				"added": 1566159348
			},
			{
				"comment_id": 85,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_804_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): it's more easy for a woman to get fucked than for a ma n to fuck:so they have 'more physiological power' and they know it.we live in a pagan world, my friend, intelligent sensitive person don't match in it, don't waste your time understand it, there's no sense.\n\nI disagree. In-fact, I feel quite confident that I could walk out my door and \"fuck\" every female I wanted and they couldn't stop me. The only ones who could, would be the men that came to their rescue. The only thing stopping any healthy man from doing anything he likes to any woman he likes are other men.",
				"added": 1566159878
			},
			{
				"comment_id": 86,
				"body": "> [ascetic](#comment_2_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): You are right, we are controlled very much everyday, however that does not make it morally \"right.\". In my view the axiom of morality is consent. I believe it is this axiom because it is the most universally agreed upon sensation by virtually all beings. If someone hurts you physically[...]\n\nAs a young child, I was a vegetarian for this reason; thinking it horrible to take an animal's life just to satiate my hunger. But then I realized that those animals are just as selfish. What gives plants the right to intercept beams of light and use them for selfish gain? But they do. And herbivores eat the plants and carnivores eat the herbivores, all in one big cycle of selfish entitlement. \n\nHow naive and hypocritical, I think, for me to believe myself above all other things in this universe that I would be capable of living without taking non-consensually from the world.",
				"added": 1566160578
			},
			{
				"comment_id": 88,
				"body": "> [ascetic](#comment_3_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): It is not about  being \"better\" than others who do not follow your lifestyle, its about trying not to be a part of the cycle of suffering in whatever capacity you are capable of. Of course the logical conclusion of this is suicide [...]\n\nExactly! The end result of believing in equality is that one should kill themself. As such, it seems to me that equality is a philosophical dead end that one shouldn't indulge in. We are selfish, greedy and we take what we can and compromise where we must. I can understand compromise between two men; I won't take your wife out in the bush and you won't attempt and possibly succeed in killing me. By why do we compromise with females? I really don't understand it. They have no leverage over us.",
				"added": 1566161846
			},
			{
				"comment_id": 89,
				"body": "> [ascetic](#comment_6_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): I believe your argument assumes that there are no women capable of killing or tricking you. Women on average aren't as physically strong as men, this is true, however a gun doesn't discriminate by gender, or any number of other tools, or methods.\n\nMen make guns. We can control whether women have access to them. Hell, we can control whether they have the ability to even leave the house.",
				"added": 1566162214
			},
			{
				"comment_id": 90,
				"body": "> [ascetic](#comment_8_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): What is your justification for the oppression of women? Is it not similar to how men are now being oppressed by the current system?\n\n\nBecause it benefits me. I believe that is all the justification life needs.\n\nIs it morally wrong for the least desirable man on Earth to be a rapist?",
				"added": 1566162416
			},
			{
				"comment_id": 91,
				"body": "> [ascetic](#comment_9_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka): So you do not believe in morality, you only believe in actions and consequences?\n\nI believe morality is subjective and the universe is ultimately nihilistic, but have a bias toward the continuation of my genome as a sort of immortality which I have a strong desire for even if it is ultimately meaningless in a universe that is finite.",
				"added": 1566162959
			}
		]
	},
	"comment_vote": {
		"1_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"601_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"2_1FyfBkqqtg7QWDqA7uNEafZXefshJdXCXd": 1,
		"4_19ZG8i1DSwiuRsvwUS8EsAgHXYK2tBtQKv": 1,
		"15_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"222_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"16_18HYVwCAgri1SgiYZcEZMehKoXZo6Eg7im": 1,
		"97_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"21_19ap87HAEURSwtoLGDMkzczAHmqMTRQpC5": 1,
		"58_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"97_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"2_1PdL5a2fRqGoQZi4NNh1EzLpcZbMV7HX3y": 1,
		"32_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": 1,
		"283_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"33_16YKCPxCUyjP3zF1CNtsWCHu44ToaNZJYM": 1,
		"22_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"105_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"109_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1036_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"40_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"36_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"69_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"4_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"1_112M71AbhUCyq3M7k8PLDRdELuQKGCExYG": 1,
		"18_17zkACeRCDqPEswrUFFZxJf3NuwtskPrzR": 1,
		"2_12Bbhe4jdraWQvCFQiAc14iDcbwC5HD9kp": 1,
		"141_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"9_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"76_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"28_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu": 1,
		"798_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"37_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"14_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"77_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"335_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"334_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": 1,
		"9_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": 1,
		"11_13ifSHXbs2RtyHF4qkn4GrJ3krWEAAGmka": 1
	}
}