{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 2,
			"title": "dl de séries,films et jeux",
			"body": "slt tous le monde, je vais partager les sites que j'utilise. Ils sont réputés et vous n aurez aucune merde.\n\nhttps://the-eye.eu/public/\nc'est une archive qui regroupe un paquet de choses vous l'utiliserais pas au quotidien mais en explorant vous trouverez 2-3 trucs sympas\n\nhttps://torrminatorr.com\nUn forum de jeux hacks. Vous trouverez un bon paquets de jeux et c'est mon way to go pour les jeux gogs. Vous aurez besoin d'un compte\n\nhttps://fitgirl-repacks.site\nsi vous connaissez pas, c 'est triste. C'est un site de repack qui vous permetra de dl les jeux plus rapidement au pris d'une installation plus longue.\n\n\nhttps://www.zone-annuaire.pro\nUn site pour dl les series et films du moment. \n\nPour les téléchargement direct si vous en faites un paquet n'hesité pas a tester jdownloader2, il peux passer les captcha optimiser le processus et peux reprendre quasie tous les téléchargement. Ne vous fiez pas a l'interface java qui tourne pas tres fluide, le reste fonctionne nickel.\n\nhttps://jdownloader.org/download/index\n\n",
			"added": 1617629027
		},
		{
			"topic_id": 3,
			"title": "Est ce que ici aussi c est un mec solo qui a creer plein de compte qui parle tout seul",
			"body": "en vrais je comprend pas la tonne de shtpost qu il y a en vrias c est juste un mec qui spam les shitpost parceque vue le ton je veux pas croire qu un acumulation de connerie peux venir de plus d une perssone",
			"added": 1618106615
		},
		{
			"topic_id": 4,
			"title": "la lettre des generaux a macron",
			"body": "voter avis sur la question ?",
			"added": 1619868546
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1_14aDTiiNuSgDzJgow7wNDaf3fUWewAtmsa": [
			{
				"comment_id": 1,
				"body": "il existe des listes qui ban les pire trucs comme celle ci\nhttp://127.0.0.1:43110/13CgSQeywg2ius5pjXVCk7dKUCRkz5xvW3/\nc'est facile a utiliser",
				"added": 1613286483
			}
		],
		"2_1KJWwT67jevaZZMQmcspiJToGt63sxkwrj": [
			{
				"comment_id": 2,
				"body": "C'est ultra pratique pour une installation et le management d un media serveur, tu met plex, radarr sonarr etc ......\nje suis pas un expert j ai un peux du mal avec la gestion des fois mais c'est quand même extra simple de faire des opérations de bases",
				"added": 1614874727
			}
		],
		"3_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 3,
				"body": "> [raspberryman](#comment_1_14MwVNhncWYiZU9ryjL5vgubn52YkXSSej): C'est un mec qui ne sait pas quoi faire de sa vie lol\n\nca fait iech de se faire poluer comme ca quand l'outil est bon ",
				"added": 1618438518
			}
		],
		"4_13rk7ENn3AgdqRXgeGQozHD5TGQQCnLyhc": [
			{
				"comment_id": 4,
				"body": "> [capitolist](#comment_1_14qms1ie29avLq4ZABX7zUvwdrntW8KYHc): Ils ont raison de dénoncer ce qui ne va pas.Après,  les militaires n'oseront jamais se retourner contre leur gouvernement...\n\nen vrais c pour ca que c'éttais principalement des retraité, mais y a toujours un echo, peux impoorte la suite elle dependra de ce qu'ils on fait",
				"added": 1619905852
			}
		]
	},
	"comment_vote": {
		"1_14MwVNhncWYiZU9ryjL5vgubn52YkXSSej": 1
	}
}