{
	"next_comment_id": 3,
	"comment": [
		{
			"comment_id": 1,
			"body": "Las policias ya tienen una imagen muy mala en general, por abuso, corrupcion, violaciones a los DD.HH., falta de preparacion profesional en casi todas las areas que les competen, etc.\n\nY eso no va a cambiar mientras no se de una profesionalizacion integral, permanente, tanto a nivel de formacion como con los temas salariales... pasando por un sistema de control interno y en especial que la ciudadania posea los canales y las herramientas que le permitan tambien ejercer una labor controladora y a la vez de defensa.\n\nHe leido historias muy penosas de la mayoria de los paises latinoamericanos y España... si tambien de ahi... \n\nNo puede ser que la policia se halla convertido en enemiga de las personas.",
			"post_id": 11,
			"date_added": 1480863761
		},
		{
			"comment_id": 2,
			"body": "Es logico pensar que a mayor estabilidad economica, mas son las probabilidades de que la poblacion reduzca sus problemas.\n\nDe hecho, en la declaracion de los DDHH se afirma que todos tenemos derechos a bienes y servicios basicos. Si estos fueran garantizados realmente entonces me puedo imaginar que solo muy pocos estarian dispuestos a arriesgar su situacion por obtener un poco mas de manera ilegal o que tuviera motivos para caer en las dependencias de cualquier tipo (alcohol, drogas, etc.). Aun asi esto no garantiza que desaparezcan los males... pero es claro que los reduciria enormemente.\n\nHasta ahora solo se habian dado trabajos de investigacion sicologica y social en el sentido contrario, es decir, investigando a grupos de riesgo, que seguian cayendo en la escala economico-social, como en aquellas regiones donde se pierden grandes fuentes de trabajo (ej. Potosi en Bolivia o Chicago en USA)... y para nadie sorprendia que todas las alarmas salten.\n\nEl problema que plantea este nuevo estudio, y que en la actualidad puede ser decisivo, es determinar si seran solo las politicas publicas las responsables de garantizar esos recursos; o si por el contrario sera un trabajo tripartito: empresariado, sector  publico y organizaciones socio-educacionales.\n\nSi los empresarios se los libera de esta responsabilidad, la carga que tendria que asumir el Estado seria insostenible a mediano y largo plazo para el 90% de los paises.",
			"post_id": 13,
			"date_added": 1481703113
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}