{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "YouTube retira vídeos sobre criptomoedas do ar sem aviso prévio",
			"body": "O YouTube tem sido a maior plataforma de vídeos ao redor do mundo há mais de uma década e, ao longo dos anos, já teve alguns problemas com seus criadores de conteúdo. De acordo com o Bitcoinist, embora a maior parte desses problemas tenha raízes em problemas reais envolvendo a natureza do conteúdo publicado, a plataforma atualmente está investindo contra conteúdos envolvendo criptomoedas sem razão aparente.\n\nSem aviso prévio, o YouTube recentemente removeu diversos vídeos envolvendo criptomoedas de quase todos canais dedicados às moedas digitais. Eles não investiram apenas contra potenciais golpistas e desconhecidos, mas também contra influenciadores conhecidos.\n\n- Fonte: https://www.criptofacil.com/youtube-retira-videos-sobre-criptomoedas-do-ar-sem-aviso-previo/",
			"added": 1577215074
		},
		{
			"topic_id": 2,
			"title": "O tempo médio de vida de uma página da web",
			"body": "https://gateway.pinata.cloud/ipfs/QmT8ZdbtCr2UZgYQuF1jTqTDwFTppfnuMkCiMyS3swSCgy",
			"added": 1577215564
		},
		{
			"topic_id": 3,
			"title": "Rumo a uma era digital obscura?",
			"body": "Boa parte da informação gerada nesta era será inacessível para as gerações futuras pela deterioração dos dados, a obsolescência tecnológica ou as leis do ‘copyright’\n- https://gateway.pinata.cloud/ipfs/QmNesv2SEDoE2DgY4rRW7zwcbSnCpDJo6E762erXc5esJM",
			"added": 1577220756
		}
	],
	"topic_vote": {
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"2_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"3_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": [
			{
				"comment_id": 1,
				"body": "#Plataformas de vídeos descentralizadas\n- https://d.tube/\n- https://lbry.tv/\n- http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD/",
				"added": 1577215189
			},
			{
				"comment_id": 5,
				"body": "> [caropc1v5](#comment_16_1A3waYKZyT69Wd7kEGQwiZk9Tf9cZFDtiv): bom, como já venho avisando o povo , é só usar plataformas REALMENTE descentralizadas, das que li sobre como funcionava a unica qu vi ser descentralizada é a zeronet.\n> Pois o mesmo usa o poder do protocolo torrent , bitcoin, tor e etc, para pertmir CADA UM MANTER uma cópia do que gostar e o unico que tem 100% de controle sobre o site que postou é o DONO.\n> Isto se o mesmo não deletar a private key para tornar IMPOSSIVEL, tirarem do ar o site :)\n> Se alguém souber de outras redes que os USUÁRIOS, são quem mantem os conteudos, por favor postem aqui, pois as que li sobre, se dizendo descentralizadas, tinham sites na main net, e isto já é centralização.\n> Fora que o conteudo era mantido sabe-se deus por quem, pois o povo tem que lembrar que TUDO tem um custo e liberdade , o custo é este , que temos na zeronet, que é de nós mesmos gastar um pouquinho do nosso espaço em disco para manter coisas que REALMENTE gostamos.\n\n#DTube funciona com IPFS, que permite manter arquivos no dispositivo do user. E o LBRY tem um aplicativo que roda no Desktop.",
				"added": 1577220470
			},
			{
				"comment_id": 6,
				"body": "> [parebrun](#comment_5_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg): DTube funciona com IPFS, que permite manter arquivos no dispositivo do user. E o LBRY tem um aplicativo que roda no Desktop.\n\nMas, se não quiser utilizar o DTube, pode ficar somente com o IPFS.",
				"added": 1577220648
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 2,
				"body": "#Hidden Tear - criando ransomware simples\n- https://gateway.pinata.cloud/ipfs/QmVGNAFQFLPJoVLWkra37bHVnwRTQ4tU8XHWiUwm1PUomU\n\n#Ransomwares - Código Fonte\n- https://gateway.pinata.cloud/ipfs/QmQ5kv8N1FePh9fkY9BvhYbimqAAzb5UAovoEY5JxqVsiy",
				"added": 1577215688
			},
			{
				"comment_id": 3,
				"body": "Ransom malware, ou ransomware, é um tipo de malware que impede os usuários de acessarem seu sistema ou arquivos pessoais e exige o pagamento do resgate (ransom) para recuperar o acesso. As primeiras variantes do ransomware foram desenvolvidas no final da década de 1980, e o pagamento deveria ser enviado via correio tradicional. Hoje, os autores do ransomware demandam que o pagamento seja enviado via criptomoeda ou cartão de crédito. \n\n- Fonte: https://br.malwarebytes.com/ransomware/",
				"added": 1577215826
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 4,
				"body": "#Bisq: uma rede de troca de bitcoins segura, privada e descentralizada\nA Bisq é um programa par-a-par de código aberto que permite que você compre e venda criptomoedas em troca de moedas nacionais. Nenhum registro é necessário.\n- https://bisq.network/pt-BR/\n- https://github.com/bisq-network",
				"added": 1577217322
			}
		]
	},
	"comment_vote": {
		"3_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"2_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"1_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1,
		"4_1GtgZLiq7JSw8qUNPGjzvpp3hFQgHaCicg": 1
	}
}