{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [kai0](#comment_1_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv): your video no peer\n\nHelp if I get online more XD",
			"post_id": 4,
			"date_added": 1538879369
		},
		{
			"comment_id": 2,
			"body": "> [leftside](#comment_1_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): She's smiling but will notice it will last forever as a trauma..\n\nUnfortunately, I think it was more of a \"I'm still alive?!\" smile  ",
			"post_id": 4,
			"date_added": 1538879426
		},
		{
			"comment_id": 3,
			"body": "> [leftside](#comment_2_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That shows that she didn't realize what happened to her at that time.\n\nExactly! Hopefully she learned from her mistake and is still plugging along.",
			"post_id": 4,
			"date_added": 1538881080
		},
		{
			"comment_id": 4,
			"body": "> [leftside](#comment_3_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): your posts are too lack of the summary of the contents.\n\nThanks for the feedback. I'm still figuring a way to provide information about the current event during the battles. I'm attempting to avoid any biased opinion of the conflict/war and only critiquing what the video is being presented (mainly poor training, leadership issues, logistics, ect). \n\nWith this specific video, I was more interested about the colourization and \"rarity\" of the footages. Also most of the clips where less than a couple of seconds long. \n\nI want my readers to be informed about the specific events, but I want them to \"choose\" their own side and not be swayed by the writer(s) text.",
			"post_id": 8,
			"date_added": 1539023092
		},
		{
			"comment_id": 5,
			"body": "> [leftside](#comment_4_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Sometimes biased opinion helps people focus on ur topic.\n\nI'll agree, but good journalism is presenting information as it happened :)",
			"post_id": 8,
			"date_added": 1539053049
		},
		{
			"comment_id": 6,
			"body": "> [leftside](#comment_5_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): People are not smart enough to distinguish it good or bad.You have to bias their butt heads in any way.See what happened to the last USA election.There's still idiots who believe in Pizza Gate.\n\nSure, maybe for news other current events. But soldiers are not fighting for a political/religion cause, they are fighting for the man beside him. War has no agenda, no bias, no reason. War is just war.",
			"post_id": 8,
			"date_added": 1539054087
		},
		{
			"comment_id": 7,
			"body": "> [leftside](#comment_6_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Soldiers without agenda are like the those who decided to become zombies or killing machines for the contracted period. Every was or battle has its own reason. And sadly most of the reasons are so stupid and worthless for most people except those who triggered the blood shedding tragedies.\n> Wise soldiers always do the battle in the always winning side for the justice.\n\nWar is always tragic. Any life wasted is bad. But unless you have enlisted or have seen action, civilians don't understand. Sure, there might be a reason a soldier enlists in the military (protect their country, serve their nation, protect their family/friends, ect), but insurgents/terrorists are not soldiers. \n\nI can guarantee that no professional soldier wants to kill someone. They are not zombies or killing machines, they are human just like you or I. Talk to a few combat veterans, ask them if they don't think about their experience often. Who is the winning side? One's terrorist is another's freedom fighter. ",
			"post_id": 8,
			"date_added": 1539060094
		},
		{
			"comment_id": 8,
			"body": "> [leftside](#comment_7_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Zombies and killing machines don't know what themselves actually are.Both the terrorists and the patriots are just serving false leaders and sacrificing themselves for false justice. I can't understand how easily they believe in those imperfect human beings. \n> I'm a pro-USA, but it's hard to find any justice in USA's invasion to Iraq and side-supporting Syrian rebels. Don't mention Vietnam war. She has lost most times. Soldiers died but leaders got richer. \n> Are you absolutely sure they could insist honor in front of the God?Not all, but most of them are like just having thrown their lives for nothing.\n\nWhich invasion of Iraq? Israel has supported the FSA as well, I don't agree with it either. Plenty of people have died for \"nothing\", it shows who the real warriors are in this pussy generation.",
			"post_id": 8,
			"date_added": 1539099233
		},
		{
			"comment_id": 9,
			"body": "> [leftside](#comment_8_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): No leadership.. Thanks for the data!\n\nXD Could have summed up all of ISIS in two words ",
			"post_id": 10,
			"date_added": 1539651235
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}