{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Библиотеки",
			"body": "приветствую! есть ли в zeronet библиотеки с книжками?",
			"added": 1505450003
		}
	],
	"topic_vote": {},
	"next_comment_id": 14,
	"comment": {
		"3_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 1,
				"body": "сентябрь жеж все в школе.",
				"added": 1505450427
			}
		],
		"2_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": [
			{
				"comment_id": 2,
				"body": "мессенджер не для анонимусов и социофобов. чтоб добавить контакт нужна личная встреча.",
				"added": 1505450549
			}
		],
		"1_1NqdiKbdh9vUx8pz3SndCSMkAa6gwyQLfy": [
			{
				"comment_id": 3,
				"body": "которая превратится в распределенную систему наблюдения",
				"added": 1506938150
			}
		],
		"1_1PQSdkCfwKLKT4pWEpf33BkjvYX78wj1kJ": [
			{
				"comment_id": 4,
				"body": "йцукен",
				"added": 1506938242
			}
		],
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 5,
				"body": "> [undyingfirewall](#comment_1_19EafLn9zvTAsjnKmJU9HRgyUFPSuqaa3S): Всем привет. Слышал здесь кто-нибудь про Фидонет?Сеть на анонимная, но тоже децентрализованная и тоже за свободный обмен информацией. А ещё она очень старая и сейчас перерождается, то бишь модем уже не нужен--- Hotdoged/Android\n> \n> Origin: We will stand for Everfree (2:5023/24.2868)\n\nфидонет- вовсе не анонимная сеть. во всяком случае такой какой её помню. в 90-00  анонимности не было. регистрация под своими реальнымиименами, телефон опять таки пробивался. фидо была иерархически распределённой сетью. современный аналог наверное будет федерации",
				"added": 1508820219
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_199_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Кхм :) Тут два противоположных искажения :D\n> \n> Технически сеть была вполне себе анонимная, подмешивай в транзитный трафик любую анонимную инфо, любой её примет. А вот организационно, в FIDO-конференциях, все авторы, как правило, подписаны реальными именами. Но это просто принятое правило. За нарушение которого возможны наказания, но правило — не техническое.\n> \n> Сеть не только не децентрализована, она имеет жёсткую иерархическую структуру и строго управляется :) Она является распределённой, но жёстко централизованной :)\n> \n> \n> \n> А я был 2:5020/1262.5 :)\nну не жестко. собравшись командой можно было попросить для себя отдельный сетевой номер и жить со своей версией устава.",
				"added": 1508820374
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_201_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Думаю, что современного популярного аналога нет. Но это точно не федерация. В федерации может накрыться любой сервер и на сети это не скажется. Роутинг организуется внефедеративными протоколами. ФИДО была более жёсткой и отказ любого из многих узлов мог привести к отказу всей сети. Только отказ конечных узлов с их поинтами не сказывался на сети.\n\nПомнится когда отвалился  бэкбон, никаких больших проблем это не доставляло. обычно нода связана с еще нескобькими нодами или сеями.  Фидонет вполне нормально переживало состояние сплитбрэйн,  и это не сильно влияло на её функционирование, благо сисопы оперативно организовывали новые канал обмена. Но вот отвал ноды доставлял не мало проблем свои поинтам. согласет теперь вижу что аналогия с федерацией не совсем уместна, т.к. в случае федерации крушение узла прописки не несет проблем связанности конечных потребителей. \n\nфидо живо ещё?",
				"added": 1508907116
			},
			{
				"comment_id": 8,
				"body": "> [balancer73](#comment_204_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Живо, но жизни в нём меньше, чем даже в ZeroNet :)\n\nу меня сравнимое впечатление с эхоконференциями фидо было когда читал форумы retroshare.  а форумы в freenet  напоминали мне больше usenet.",
				"added": 1508925017
			},
			{
				"comment_id": 9,
				"body": "у меня есть подозрения к клиентскому приложению retroshare. когда я загрузил работой свой комп под li ux так, что интерфейс начал подтормаживать, я заметил что открытое окно retroshare себя периодически скрывает и снова показывает, чего небыло замечено в работе других qt приложениях. Я задумался, почему так может быть и пришел к выводу, что retroshare скрывает себя на мгновенье чтобы сделать скриншот эткрана. В то время когда интерфейс отзывчив, таких морганий не заметно. Это всего лишь мой домысел, который на пару с параноей не дает мне воспользоваться этим приложением но как мне убедиться, что это не так, что программа не снимает скриншоты?",
				"added": 1508925259
			},
			{
				"comment_id": 10,
				"body": "> [stre10k](#comment_13_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx): Как это не несет? Если узел диаспоры или мастодонта ляжет, на котором я зарегистрирован, я уже ничего не напишу и не прочитаю. Я только могу найти и зарегистрироваться на другом узле. Что в случае с фидо решалось так же - нахождением другой ноды. Так что это похоже на федерацию, только еще с иерархией.\nя имел в виду идеалтную федерацию. гдесервера только занимаются регистрацией и управлением клиентов а клиенты почти равноправны на всех узлах федерации неважно откуда он зашёл (узлы федерации обмениваются учетными данными клиентов)",
				"added": 1508925426
			},
			{
				"comment_id": 11,
				"body": "> [stre10k](#comment_14_15M1vyCVTK2Tcrs9jxTLZ9PLGWmmNr1vJx): По моему это описание не федерации. Есть примеры?\n\nну к примеру Российская федерация. ...\n\nшутка. названиесети  не помню но чтото всплыло из реализации. \nБыла система, где сервера имели токены подписанные федеративным ключом. При регистрации , сервера сами подписывали ключи своих клиентов. такая подпись являлась идентификатором клиентов и принималась на любом сервере федерации. если ключ сервера подписавший клиента был валидным. далее идет серверная магия. где сервера анонсируют между собой авторизовавшихся клиентов,маршруты(луковичная маршрутизация там вроде не применялась), выбирают оптимальный для клиента сервер (по нагруженности и лэтенси). передают клиентам идентификаторы других серверов, что позволяет клиентам входить в сеть даже если сервер на котором он регистрировался будет недоступен. както так.\n\nесли в процессе работыкакой либо сервер уйдет в даун, то клиент перескакивает на другой досупный сервер. это делало приложение.",
				"added": 1509078767
			},
			{
				"comment_id": 12,
				"body": "> [balancer73](#comment_205_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Это не федерация, это обычная децентрализованная сеть — клиент же в этом случае может работать через любой узел сети, не обязательно «его» серверу падать :)\n\nтогда я точу услышать ваше определене/ описание федерации",
				"added": 1509168283
			},
			{
				"comment_id": 13,
				"body": "> [balancer73](#comment_207_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Так примерно: http://127.0.0.1:43110/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:4:Виды+социальных+сетей+с+точки+зрения+распределённости\n> Конкретно федеративными являются уже упомянутые тут E-Mail и XMPP. А из социальных — Diaspora. Movim, все виды StatusNet (GNU Social и Mastodon).\n\nтеперь ясно. спасибо.",
				"added": 1509862780
			}
		]
	},
	"comment_vote": {
		"199_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"201_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"10_18axiYZiLiocSo5t3DENyUUU8TRciz2mDn": 1
	}
}