{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1529023524,
			"title": "Systemwide Tor on OS X",
			"body": "I am trying to use TorBar but it is v0.5.3 which is a few years old. Does anyone know of an update or a more recent build or tor implementation for OS X?",
			"added": 1529023523
		}
	],
	"topic_vote": {
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"1528353432_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1528088389_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 1,
				"body": "ZeroGit anyone?",
				"added": 1528803150
			}
		],
		"1528771197_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "> [quantumkitty](#comment_140_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): https://www.youtube.com/watch?v=5LqVBkYZhYI\n\nand every one of those camera clicks wasted....",
				"added": 1528803423
			},
			{
				"comment_id": 3,
				"body": "> [wildrunning](#comment_2_16jxbpwWm7DbyFCRhQ4FNirjuLsenv26Lk): and every one of those camera clicks wasted....\n\nIMHO...",
				"added": 1528803451
			},
			{
				"comment_id": 6,
				"body": "Yes I agree and want disarmament but I struggle to believe the bullies will just relax and go away. So we get back to someone has to be the almighty power to be able to keep the bullies down... that used to be the US until they became the bullies. Then other countries start to buy arms to defend them selves and the process restarts.\n\nIt's a sad situation. And, IMHO it wont get better untill we can figure out what causes bullying.   Equal sharing of the whole planet? I think that would be the start. But then we get into hoarding.....",
				"added": 1528850344
			}
		],
		"1528776246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "Well in US it is the top Banks and their stockmarket trading mates.... they took a massive social handout at the recent bailout. It was not their first and it wont be their last. Remember the catchcry.... \"too big to fail\".  It would seem they forget all that when people say ok you lot need to break up. \n\nFunny that, except when it isn't.",
				"added": 1528849818
			},
			{
				"comment_id": 5,
				"body": "> [marketforce](#comment_9_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): And who's going to pay for the leftist wet dreams, eh? [...]\n\nThe trouble with the right is that they forget their moto when it comes to picking up social handouts like healthcare, maternity leave, weekend off, annual leave etc etc. I pointed this out to a right winger not so long ago..in the medicare office, and the looks of indignation were astounding. The funny thing is I never seem to get look of understanding and acceptance or even acknowledgement. Hmmmmm",
				"added": 1528850055
			},
			{
				"comment_id": 7,
				"body": "> [marketforce](#comment_8_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): so... are people already willingly throwing money at you?\n\nActually they do. One just needs a really really good honest idea. For example look at science research. They demonstrate the experiment, come up with what might be possible and get a grant to continue. Also the starup culture although fraught with hype, the best ideas shine through and are often overfunded. Same on Kickstarter, Fundme and others. Yea some of these don't deliver but that is true in all of life.  Your resume is also a good example. You demonstrate the value of your ideas and work esp in past employment/endeavours. Prove it via references and you are typically put into a pool of possible/probable hires.\n\nAt home, when you have a great idea for say dinner, family and friends will usually pitch in to bring it about.",
				"added": 1528850862
			}
		],
		"1529023524_16jxbpwWm7DbyFCRhQ4FNirjuLsenv26Lk": [
			{
				"comment_id": 8,
				"body": "Thanks @KM199. Is it possible to set exit points and include exclude countries with the Brew loaded Tor?",
				"added": 1529026570
			}
		],
		"1529033869_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 9,
				"body": "Technology...aka computers were to have liberated us from the drudgery of work. Have they? No, of course not. People work longer hours and are way more stressed. What job security? Tech has enabled the rich to exploit the poor in third works countries at a huge loss to the local population. So yeah, sure all these wonderful tech things on the surface sound amazing but in the hands of rich and their corporations who can afford them? My guess is at best just a few. So what is this fight oppression you speak of? These will be the new tools of the oppressors and the fees will be astronomical. \n\nYes the gov's indeed do fear educated and active citizens especially the right wing extremist and their cousins conservatives who just want the status quo reinforced so the rich can get super rich from the labour of everyone else.\n\nJust look at the smart phones.... just another tool for both the super rich and the govs to spy and profit from you but now they can do it everywhere. Internet? Same. Let\"s face it why are you using ZeroNet?",
				"added": 1529035081
			}
		]
	},
	"comment_vote": {
		"2_1UxLMJWV5HPYCdUaFUrBPk11m3bjHQqQT": 1,
		"97_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"91_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1
	}
}