{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1541360464,
			"title": "Thoughts about Freenet?",
			"body": "I'm just trying to consider, which distributed internet has more promising future.\n\nZeronet is younger, but faster. What are your thoughts?\n\n\nP. S. I wrote [a little longer explanation on FMS](http://127.0.0.1:8080/forumviewthread.htm?messageuuid=7CF42AF0-087E-48A8-9468-D6B5CA57ED93@jM799hsHkHDRGpAzkacV95gifNdGBP4vucAgPc6E#7CF42AF0-087E-48A8-9468-D6B5CA57ED93@jM799hsHkHDRGpAzkacV95gifNdGBP4vucAgPc6E) about the differences between Freenet and TOR:\n\n> Freenet and TOR solves two completly different goals.\n> \n> As of writing (and for a long probably) there ary many more users using Tor so Tor is more effecient (and faster). But don't hang up reading right now! (Please read at least the first sentence of each paragraph.)\n> \n> Tor is made for anonym internet access. It's built on top of the regular internet and just hides your identity. Additionally you can even serve websites using Tor, making it possible to hide yourself as a content provider too.\n> But anyways, Tor provides the same features as the internet, except that that's a little slower.\n> \n> Freenet is made for anonym distributed hypermedia hosting and access. So you can not use custom ports or even Javascript (i.e. client-side dynamic content) with Freenet, or communicate directly and instantly with the content provider (i.e. server-side dynamic content) (though indirectly possible, see FMS). In contrast you gain free storage and hosting for your content and complete anonimity. In my opinion the biggest advantage is that nothing can be taken down with force.\n\n> Freenet is far more complex, so it's in its early stages even if that is far more older.",
			"added": 1541360463
		}
	],
	"topic_vote": {
		"1523293279_1CmmSnd99UGinNpZ6FMAxPXSf973S253Pr": 1,
		"5_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1534205182_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": 1,
		"1540796902_148DXj745fSuMtCnbh3uJnb3Tm4ZbdabJY": 1,
		"1552782364_14JMe2K9H9F9DwFi2s6tuwiQT66FY7H1dg": 1,
		"1518072989_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1541360464_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_283_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My thoughts are that this question had been asked a hundred times before.\n\nSorry, found no search option. (Is it my bad?)",
				"added": 1541444064
			},
			{
				"comment_id": 2,
				"body": "> [eightyfour](#comment_14_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): They also use dat:// urls (which looks better than ZNs localhost:port/url, but it requires their special browser while we can use any browser we want. It's very similar to ZN apart from that.\n\nTechnically it's possible (and should be easy) to implement a protocol which simply means one should _proxy_ the request to `127.0.0.1:8888`, but I think that's not needed at the moment...",
				"added": 1541444345
			},
			{
				"comment_id": 3,
				"body": "Huh, it looks like we should simply start a campaign.",
				"added": 1541444388
			},
			{
				"comment_id": 5,
				"body": "> [timmo](#comment_5_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC): So.. I just took a look at FreeNet and I see that it's using Java RE. I don't think that's a good solution.\nUmm, ZeroNet uses python. Is it better then?\n\n> [timmo](#comment_5_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC): In regard to mapping localhost, or 127.0.0.1 this could be done by patching an entry to the hosts file on Linux, and MacOSX. I think it can also be done on Windows, but I'm not sure how to do that.\nWell, there's a [hosts file on Windows](https://en.wikipedia.org/wiki/Hosts_(file)#Location_in_the_file_system) too, but I meant creating a protocoll. Anyways, it can be easily prettified, but maybe later.\n\n> [timmo](#comment_5_1QCMg6ZqmUAFd1MGyc2g2j6NDep2GANfAC): The potential for ZeroNet is great right now, especially with all the Censoring of Twitter, FB, etc... What's required is lots, and lots of promotion, marketing, press releases.\nFreenet has the same great potential too. It not even distributes internet, but makes _completly_ anonym (better than that tor/i2p+ZeroNet), but has much fewer content and users. Why?",
				"added": 1541530827
			},
			{
				"comment_id": 6,
				"body": "I think ZeroNet can collapse: There's no real motivation for users to seed. In Freenet, they should seed, or they won't get enough bandwidth.",
				"added": 1541580650
			},
			{
				"comment_id": 7,
				"body": "> [thunder33345](#comment_307_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): isnt it same thing can be said for bittorrent?it lends it's own fate in it's user and it still mostly survived till this daythere's 0 incentive to seed, only thing one would choose to seed is out of obligation to do soand people are still seeding regardlessthough in your defense seeding as of now is \"forced\" upon user(which i dont believe in said philosophy(enforcing will onto users for the betterment of the group), i believe that if user want to seed, they will do it, if they dont they wont) [...]\nIn most trackers / torrent sites, the users who don't seed back enough get a punishment. On more open sites (for ex. TPB) one can experience slower speeds. When ZeroNet reaches more people, I'm sure that we'll reach the not-so-enthaustic people, who doesn't give a fuck about other users and will buy softwares which disable seeding and/or delete sites immediately and so on. (For ex. sequential download at simple torrents.)\n\nHmm, the idea of paid to seed isn't so bad: Maybe we could redeem our seed deficit with money, so buying ratio from other seeders? This should be worked out!\n\nI'm using ZeroNet just 3 days ago, and I think, I have a solution for mobile usage (BTW tried to run it using Termux, but the 2GB RAM on my Nexus 5X is barely enough): I simply run a server at home with continous internet access and huge storage, and I connect to it over an SSH tunnel. It's simple and clean, since the official ZeroNet client opens a webserver at http://localhost:43110",
				"added": 1541586624
			}
		],
		"5_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 4,
				"body": "I think Freenet. My reasons for that:\n- Anonymity enhancements, for ex. warning on opening external links, no JS\n- Forced shared content hosting: Sites can't be traced with DDoS, because you don't even know what site are you hosting\n- And at least, Freenet is built with anonymity in mind: Not by just putting together two modules (ZeroNet and I2P).\n\nAlthough in my opinion Freenet is built by enthusiastic nerds (sorry Freenet devs) and/so is not profit oriented, so it has more security.",
				"added": 1541445628
			}
		]
	},
	"comment_vote": {
		"1_16ExhLrK3XmMRhe7XWHJYHdJZa6JnzHr6R": 1,
		"14_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"285_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1KZFFk8e3mYd9dbbdaw4fZRgyRWHfvkX3e": 1,
		"307_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}