{
	"next_comment_id": 13,
	"comment": [
		{
			"comment_id": 1,
			"body": "Gracias por agregar mi blog! ^^",
			"post_id": 209,
			"date_added": 1478857822
		},
		{
			"comment_id": 2,
			"body": "Muy buena información!\nHace un tiempo probé el primer método, pero por alguna razón no podía pasar de la pantalla de la contraseña desde Firefox Android, así que no seguí probando...",
			"post_id": 217,
			"date_added": 1479410996
		},
		{
			"comment_id": 3,
			"body": "Interesante, algún día lo voy a probar!",
			"post_id": 219,
			"date_added": 1479494990
		},
		{
			"comment_id": 4,
			"body": "Medio offtopic, pero como hacés para calcular el \"leído por última vez hace X minutos\"? Es storage local?",
			"post_id": 220,
			"date_added": 1479614291
		},
		{
			"comment_id": 5,
			"body": "Vi la peli, y me gustó mucho. Está bien narrada y no me da la sensación que se calle nada.\nEs interesante que muestran a Snowden como un patriota modelo jaja",
			"post_id": 275,
			"date_added": 1480547991
		},
		{
			"comment_id": 6,
			"body": "+1 a las redes Mesh :D",
			"post_id": 280,
			"date_added": 1480864923
		},
		{
			"comment_id": 7,
			"body": "Creo que en principio no es una señal tan mala el hecho de que haya menos usuarios nuevos por día. Simplemente puede ser que ya se estén alcanzando todos los potenciales usuarios.\nLa cantidad de mensajes en ZeroMe es lo que habría que medir...\n\nPorque siempre está el factor novedad que hace que las cosas \"exploten\" y después se estabilicen...",
			"post_id": 283,
			"date_added": 1481368211
		},
		{
			"comment_id": 8,
			"body": "En latinoamérica también hay un resurgimiento de los NeoNazis, en Argentina por ejemplo hay una ciudad (Mar del Plata) donde hay una concentración preocupante que se dedica a agredir a las minorías. Y para peor al asumir el nuevo gobierno en el país muchos de estos sectores sintieron que su ideología era validada.",
			"post_id": 291,
			"date_added": 1482107068
		},
		{
			"comment_id": 9,
			"body": "Listo! agregado a mi Chatbot: http://127.0.0.1:43110/1AeCt2VSk9NR1nGvegkunUpDvHtgsJ5dNj/\n\nMi consulta, ¿Por qué en accepted_domains hay solo 2 IDs y en cert_signers hay 4?\n\nGracias!!",
			"post_id": 295,
			"date_added": 1482262993
		},
		{
			"comment_id": 10,
			"body": "> [cer](#comment_46_1JHQA9oFkFpFFRiscyT4N71AKLWg46pQ92): Lo que realmente importa es la linea \"accept_any\": true\n\nPerfecto, gracias por la explicación",
			"post_id": 295,
			"date_added": 1482268542
		},
		{
			"comment_id": 11,
			"body": "Freenet es un gran proyecto, lo he probado mas de una vez e incluso he creado un par de FreeSites, pero lamentablemente la cantidad de recursos que consumo hace imposible que tenga funcionando la red continuamente. Es algo que las soluciones P2P van a tener que ir solucionando, y calculo que con la mejora de las PCs irá mejorando. Algo similar me pasa con IPFS.",
			"post_id": 294,
			"date_added": 1482547685
		},
		{
			"comment_id": 12,
			"body": "Wow! Excelente tutorial!",
			"post_id": 297,
			"date_added": 1482900673
		}
	],
	"comment_vote": {},
	"post_vote": {
		"145": 1,
		"208": 1,
		"217": 1,
		"219": 1,
		"297": 1,
		"313": 1,
		"323": 1
	}
}