{
	"title": "The Vagina",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1465047525,
	"post": [
		{
			"post_id": 7,
			"title": "so as you can see, vagina is growing",
			"date_published": 1465047253.176,
			"body": "yes, it is growing. \n\nvagina will be an agressively growing entreprise. more to come, soon. stay tuned.\n\nhere are some projects Vagina is working on - \n\n- Vagina health care \n- Vagina software and games\n- Vagina media and communications"
		},
		{
			"post_id": 6,
			"title": "Vagina English",
			"date_published": 1465042823.433,
			"body": "certain issues - \n\n- sound effect is critical, we need sound to make it work well\n- beautiful teacher has to be recruited."
		},
		{
			"post_id": 5,
			"title": "this idea might work, if taught by a teacher like her.....oh...... ",
			"date_published": 1464964774.62,
			"body": "http://127.0.0.1:43110/16faLxtAU4uCBfnRmMUi4kf7NFMfduphd6/?Post:9:NO.66\n\ni love her, let her be the english teacher.\n\nwho has her contact humber? i would like talk to her to become the Vagina English CEO and head teacher.\n\njust imagine the logo i could design out of her vagina.....man, oh, so great....beyond my language and manhood"
		},
		{
			"post_id": 4,
			"title": "english is hot....what if we start a english training company named Vagina English?",
			"date_published": 1464963815.497,
			"body": "just a ugly thought. but it might work here on zero, why not?"
		},
		{
			"post_id": 3,
			"title": "Should vaginas somehow be better managed?",
			"date_published": 1464272395.422,
			"body": "well, that is an open source question. the big challenge is the lack of quality vaginas probably throughout the world."
		},
		{
			"post_id": 2,
			"title": "This is the place to get started; how come? I will show you.",
			"date_published": 1464183685.77,
			"body": "Why I say for Chinese the right place to start modernize is the Vagina? Here are some starting thoughts - \n\n1. vagina in Chinese (I mean language) is fucking bad tasting; i think we mostly agree vagina is a beautiful thing and desirable place to be; but in Chinese, its word does not lend any sense of beauty; sounds more like a sink where the sewage goes; that is fucking wrong;\n2. it is getting redculously difficult for Chinese to date a Chinese; why? probably too many men and too few beautiful women and some of the most beautiful women here love white people; so what should we do? vagina is a problem! without that man can never be confident and stay focused; work, life, modernation of the country will be in jeopardy;\n3. without good vagina, where come the enough next generations to compete with all these crazy people from around the world? "
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}