{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1597510017,
			"title": "PRiVYERA Blog",
			"body": "http://127.0.0.1:43110/1EXn8GVoEW2LpXqQiSn4xFm5zLnkNPpsY/",
			"added": 1597510016
		},
		{
			"topic_id": 1597526246,
			"title": "Demonsaw is provided without installers, as a stand-alone application so that it can be run from or stashed anywhere you want. Just download the version you need for your operating system, extract it somewhere, and launch Demonsaw. How it Works  This section will be a rough overview of how Demonsaw works, how it is designed to protect you, and will hopefully take some of the confusion out of the network. Communication  TL;DR;      Clients do not communicate with clients, Demonsaw is not peer to peer.     All client communication goes through message routers and data routers.  If you were to sniff your local traffic and peer into the Demonsaw communication, you'd see TCP traffic that looks just like HTTP web traffic... but with encrypted payloads. Clients can pass user-agent strings, making them appear more like a web browser. Demonsaw routers can listen on any port you want, including 80 and 8080, and can even redirect actual web browsers to another website with a 301 permanent redirect.  In essence, Demonsaw clients and routers are both behaving as both an HTTP server and a client, allowing them to send messages and data back and forth all while looking like normal web traffic. Crypto  TL;DR;      You specify the security of the crypto handshake, you control your level of protection.     At minimum, your communication is wrapped in two layers of crypto.  Demonsaw allows you to choose your own level of security through cryptography, both through the first handshake with a router and through the use of groups setup with social cryptography. Demonsaw uses Diffie–Hellman key exchange to connect securely, but allows you to define the prime size, cipher, key size, hash type, salt, and how many iterations.",
			"body": "http://demonsaw.com",
			"added": 1597526244
		}
	],
	"topic_vote": {
		"1594086007_1CTfEpEsVkNb5Lqs2y9zJJBmZ9kfYmCeoP": 1,
		"1597526246_166cC3iVpxLQrFXrkoHRbJ7r6RB4ckJshz": 1,
		"1597510017_166cC3iVpxLQrFXrkoHRbJ7r6RB4ckJshz": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1597510017_166cC3iVpxLQrFXrkoHRbJ7r6RB4ckJshz": [
			{
				"comment_id": 1,
				"body": "https://matrix.to/#/!pSGfadHIYhJKxgASCX:privy.ws/$jHt4g5PIfx3Yl3ew9Bw_u2ZTKxpmv9dUJDDyfMjG0V0?via=privy.ws&via=t2bot.io&via=matrix.org our matrix channel / room .",
				"added": 1597520107
			}
		]
	},
	"comment_vote": {}
}