{
	"title": "Ru.Zerro",
	"description": "Zerro's blog",
	"links": "Ничего\n\n- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 51,
	"demo": false,
	"modified": 1475827940,
	"post": [
		{
			"post_id": 50,
			"title": "Принципы авторского права",
			"date_published": 1475822541.746,
			"body": "Не могу принять той порочной практики, которая распространена в области применения законов об авторском праве в настоящее время. Правильная трактовка не должна противоречить главному принципу:\n\n0 Доступ к информации неотъемлемое право человека.\n\nИсходя из этого требования, авторское право может пониматься следующим образом:\n---\n1. У автора есть неотъемлемое право на свою работу.\n2. Автор может определить условия использования своей работы.\n3. Условие использования, нарушающее принцип 0, недействительно.\n4. Условие использования производной работы, нарушающее условия исходной работы, недействительно.\n5. Авторские условия не являются объектами авторского права.\n6. Любой человек в праве знать, что работа распространяется на условиях авторского права. \n7. Введение человека в заблуждение относительно авторских условий недопустимо.\n\nПро таком определении, получаются следующие следствия:\n\n1. Копирование, хранение, чтение и передача информации не могут быть запрещены.\n2. Знак копирайта не может быть использован на копии нарушающей условия распространения.\n3. Авторское право может быть делегировано на авторских условиях.\n4. На работах являющихся общественным достоянием не может быть знака копирайта.\n\nНекоторые интересные следствия:\n\n1. Большая часть изданной информационный продукции несовместима с пунктом 0 и по пунктам 3 и 7 не должны использовать знак копирайта.\n2. На правах делегирования, они могут переиздать продукцию с приведением условий в соответствие с принципами авторского права.\n3.  Копилефт лицензии, в частности GPL нарушают принцип 0. С этих принципов весьма заметно сходство с проприетарными лицензиями.\n4. Вирусные условия возможны. \n5. Делегирование авторских прав может быть бессрочно и с возможностью делегировать дальше, а не переходит в обязательном порядке в общественное достояние после смерти автора.\n6. Специальные лицензии, чтобы позволить людям право читать, не требуются. \n7. Возможно распространение работы на коммерческих условиях, без преследования людей за распространение. \n8. Автор защищен от преследования со стороны издателя за распространение. \n\nПредложение. \nИспользовать знак 〈c〉 или \\<c\\> вместо (с) в своих работах, если понимаете авторское право именно так."
		},
		{
			"post_id": 49,
			"title": "DPoS",
			"date_published": 1475673731.698,
			"body": "**Данный пост не является рекламой BitShares. Мне интерес представляет именно алгоритм консенсуса**\n\nОткрыл для себя DPoS. Как-то BitShares оставался вне моего интереса, думал, ну платформа для создания ассетов, ну с биржей, ну на своем блокчейне. Не они одни такие: Omni, Counterparty, NXT. Копнуть глубже как-то не было причины. DPoS мне попался на глаза в Lisk, но этот проект я вообще не считаю достойным внимания, и тоже потому не глядел. Постепенно как-то про BitShares попадалось, то одно, то другое. Сначала, что блок в 3 секунды. Ну мало ли как извращаются. Потом попалась статья, про попытку внедрить терминалы оплаты в магазины, и они будут давать возможность оплаты в различной валюте. Подумал, что одна кривая попытка, вроде терминалов Dash. Проблему масштабирования то никто не отменял. И тут читаю у них на сайте, что сеть способна облужить до 100000 транзакций. Не понял, стал читать. Оказывается причина тут как раз в Delegated Proof-of-Stake.\n\n---\n\nЧто такое DPoS и чем оно отличается от других алгоритмов. Системы, подобные биткоину, открыты для участия в процессе формирования блоков любым участником. Если ты находишь блок с хэшем удовлетворяющим условию, то он включается в цепочку блоков. Вероятность найти блок пропорциональна майнинговой мощности, у кого её больше, тот чаще находит блоки. Чтобы повысить вероятность нахождения блока, майнеры объединяются в пулы. В итоге основная часть майнинга распределена между основными участниками, согласно доли в майнинговой мощности. PoS работает аналогично, но приоритет в формировании блока отдается пропорционально доли монет в сети. Dash использует PoW майнинг с мастернодами. Мастерноды дополнительно подписывают блоки, а назначаются случайным образом из списка мастерной. Чтобы стать мастернодой нужно внести залог в 10000 Dash. DPoS  это чистая сеть мастернод, где мастернод обычно ограниченное количество, например 100, где мастерноды выбираются пользователями, согласно доли своих монет.\n\nЧто это дает. В сети с ограниченным количеством участников, распространение блока происходит быстрее. Кроме того, участие в формировании блока происходит не по твоей доле, а по количеству голосов за тебя. Таким образом мастерноды всегда конкурируют за качество обслуживание, и в целом это приводит к повышению уровня. И ещё. В такой сети пользователям нет необходимости загружать блокчейн, это целиком на плечах мастернод, а для пользователей нужен только быстрый легкий клиент.\n\nВ какой-то степени это похоже на классические централизованные сервисы, где организация предоставляет услугу, только здесь услугу предоставляет децентрализованная оргарнизация (DAO) со свободным входом. Чем это интересно мне. Тем что вообще многие сервисы можно преобразовать к подобному виду, что повысит их качество. Например, можно представить аналог Telegram, организованный таким образом. Где пользователи платят небольшие комиссии за пользование, но имеют хороше качество сервиса, с e2e шифрованием, без возможности давления на организацию со стороны правительств. \n"
		},
		{
			"post_id": 48,
			"title": "Почему ZeroNet так важен сейчас",
			"date_published": 1475505049.374,
			"body": "Я сильный противник цензуры. Коммуникация - важнейший аспект существования общества. Возможность обсуждать, договариваться и приходить к соглашению по любым вопросам. Придти к соглашению, это значит разрешить конфликт, значит, что он больше не будет требовать и отнимать на себя внимание и время. Цензура, это важное препятствие на этом пути. Это вмешательство в процесс обсуждения или даже препятствование его началу. Часто истоки цензуры лежать в желании некоторых людей сохранить состояние конфликта, т. к. имеют от него выгоды.\n\n---\n\nМожет показаться, что цензура, это самоорганизация общества. Но это не так. Выгоды от цензуры всегда получают отдельные личности или организации, а не общество в целом. Те кто в этом заинтересован, манипулируют общественным мнением, и цензура тут является инструментом такой манипуляции. Таким образом, цензура порождает ещё большую цензуру, если этому не противостоять.\n\nИ на самом деле общество противостоит цензуре. Всегда противостяло, и через это противостояние оно развивалось. Именно вопреки цензуре люди пришли к современному миру. К миру больших государств, а не маленьких общин находящихся в состоянии войны друг с другом.\n\nИнтернет сделал большой вклад в борьбу с цензурой, он позволил преодолеть расстояние, ограничения отдельных групп, привел к большей открытости в обсуждениях. Но сейчас, в том виде, в котором он существует, он уже достиг потолка своего потенциала и начался обратный процесс. Это проявляется в следующем:\n\n1. При желании создать собственный сайт у человека возникнут значительные трудности. Это затратно, сайты с малыми ресурсами не могут противостоять DDoS атакам.\n\n2. Получение статического IP, домен, аренда VPS анонимно сопряжено с большими трудностями и затратами. \n\n3. Государства стремятся отстроить свои границы в интернете.\n\nВ настоящее время идет общий подъем интереса к нецензурируемым системам, неподконтрольным единоличному управлению. Однако, многим из них ещё только предстоит появиться. Но нет смысла ждать вечно, если есть что-то, что можно использовать уже сейчас, этим нужно пользоваться. Не нужно отсиживаться в фейсбуке и ждать когда появится идеальная социальная сеть. К тому времени вы уже подстроитесь под правила и забудете о том, что вам было когда-то важно. Те инструменты, что есть сейчас, не нужно их избегать. Пусть они не идеальные, кривые и в итоге останутся тупиковым звеном эволюции, не нужно их избегать. Будте подвижны. ZeroNet вполне годен для этого сейчас."
		},
		{
			"post_id": 46,
			"title": "Децентрализованной революции не случилось, Ethereum провалился",
			"date_published": 1466227016.334,
			"body": "Случилось следующее. Воспользовавшись уязвимостью смарт-контракта инвестиционной платформы [TheDAO](https://daohub.org), некто вывел более 3 миллионов Ether с баланса контракта. Несмотря на то, что никакой ошибки не произошло в работе самой сети Ethereum, основная комманда разработчиков проявила исключительную избирательность по отношению к смарт-контрактам, работающим на базе Ethereum, а так же всем тем, кто использует Ether просто в качестве криптовалюты, и предложила хард-форк в целях возвращения средств вкладчикам в TheDAO. Что же именно это означает и почему это плохо.\n\n---\n\n## Ошибки в работе сети не было\n\nХочется особо это подчеркнуть. Потому-что сейчас на волне паники не всем это ясно. Уязвимость была только в коде контракта TheDAO. Ввводить, выводить и держать Ether на балансе контракта — это не запрещено, это естественный функционал системы. Пользоваться уязвимостями контрактов тоже. Предполагается, что есть инструмент, который предоставляет широкие возможности, но как людям его использовать — это их дело.\n\n## Некоторые контракты равнее других\n\nTheDAO далеко не единственный смарт-контракт в сети, даже из существующих. Да, он был самым дорогим, с самой большой суммой на счету. Но это из-за безответственности организаторов TheDAO. \n\n\n## Действия в угоду инвесторов\n\nХард-форк — это действия в угоду инвесторов. Получается что сеть идет на уступки тем людям, которые пришли поведясь на рекламу и те, кто планирует заработать на росте курса. А не тех людей, кто действительно разобрался и проникся основной задачей сети, быть опорой для децентрализованных приложений. "
		},
		{
			"post_id": 44,
			"title": "О тьюринг-полноте смарт-контрактов",
			"date_published": 1464361823.179,
			"body": "Часто можно услышать упрек в сторону тьюринг-полных смарт-контрактов Ethereum. Что это дает меньшую безопасность, чем при их отсутствии. Что неограниченное количество несет с собой и неограниченное число проблем. Многие платформы, для которых контракты не обладают тьюринг-полнотой, выдают это за преимущество. Но это не совсем так, как они пытаются это выдать. И я хочу показать тут, что использование тьюринг-полных контрактов дает даже большую безопасность. \n\n---\n\nПервое, смарт-контракты в Ethereum выполняются в изолированном окружении EVM (Ethereum Virtual Machine). Они изолированны от всего кроме блокчейна, а конкретнее кроме своего storage, и вносить изменения куда-то ещё непосредственно не могут. У EVM существенные ограничения по используемой памяти, и сложности вычислений.\n\nВторое, взять блокчейн-платформы для более узких применений, допустим криптовалюты вроде биткоина. Алгоритм обработки приложения \"криптовалюта Bitcoin\"  является частью самой реализации клиента. Да, написанном так же на тьюрин г-полном языке. Да, в работу алгоритма возможно внести изменения через изменения в клиете. Это наверняка негативно повлияет на репутацию, но это возможно. В случае, когда код применения описан смар-контрактом, то он уже не изменяем, после того как отправлен в блокчейн. Когда таким образом отделен узел клиента от конкретного применения, и когда таких применений много, то очень сложно повлиять на работу контрактов через изменения в коде клиента. \n\nКонечно, в случае контрактов может быть множество проблем связанных с реализацией самих контрактов. Но это не является проблемой безопасности платформы, а лишь разработчиков контрактов. Когда среда исполняет то что ей велено, это не является ошибкой, даже если не это подразумевалось тем, кто писал инструкции. \n\nДопустим есть некоторая малопопулярная криптовалюта реализованная в виде смарт-контракта Ethereum, и аналогичную, созданную на полностью своем специализированном блокчейне, например как форк биткоина. И в этом случае реализация на Ethereum будет намного надежней, чем форк биткоина. Потому-что Ethreum не выделяет твой контракт из множества других. Это будет довольно сложно сделать, не нарушая работу всей сети. У малопопулярного форка атаку можно произвести непосредственно получив доступ к репозиторию кода клиента."
		},
		{
			"post_id": 1,
			"title": "Улучшенная версия ZeroNet",
			"date_published": 1433033779.604,
			"body": "Может не совсем улучшенная версия, а скорее более универсальное решение. Мысль пришла, когда я натолкнулся на ограничения ZN, которые выражаются в том что предлагается некоторая определенная структура сайта, а кроме того, он выводит поверх сайта, при открытии через браузер, свой интерфейс.\n\n---\nДумаю, что возможно возможно более универсальное решение. Если  ZeroNet  использует как криптографию биткоина для верхнего уровня имен, не используя блокчейна, то можно так-же использовать нечто вроде смарт-контрактов Ethereum, то же вне блокчейна. Блокчейн хорош когда нужно синхронизировать некоторое состояние сети между всеми узлами. Но он мало эффективен в случае небольшого количества узлов, так как в этом случае легче подлежит атакам, сложнее запускается под конкретную задачу. Хотя такие инструменты сейчас в разработке, например Intel Sawtooth Lake, они могут оказаться недостаточно универсальными. Впрочем, ZN демонстрирует, что в некоторых случаях жить можно вовсе без блокчейна. \n\nВыглядеть это может примерно так. Изначально создается файл, например init, в котором описываются правила допустимых обновлений. В идеале это некоторый язык программирования, для наибольшей гибкости. Этот файл создается один раз и больше не изменяется. Для большей гибкости часть правил может быть вынесена в другие файлы, для того чтобы в дальнейшем было возможно изменять основные принципы обновлений. Хэш файла init и является адресом каталога в сети. Все дальнейшие обновления распространяться должны так же как в ZN, но они должны удовлетворять правилам описанным в init-файле. Все несоответствующие им обновления игнорируются.\n\nЭто дает широкие возможности для различных применений. Можно, например, вести каталоги (или сайты) с полностью анонимными сообщениями, без необходимости в каком-либо идентификаторе или подписей сообщений. Либо наоборот вести сложную систему уровня доступа, в зависимости от поведения пользователей: администраторы, модераторы, объем сообщений доступный пользователю, и т. д."
		}
	]
}