{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1610789179,
			"title": "Has anyone noticed all the Heads of State that quit this month?",
			"body": "Russia, Netherlands, Germany, Italy, Israel, Vatican City, Estonia, Kuwait, Moldova, Finland, Malta.\nI'm trying to find a common thread, but it's bordering on clown world agenda resignations.",
			"added": 1610789178
		},
		{
			"topic_id": 1610984695,
			"title": "US Capital building on fire.  COGCON 2",
			"body": "https://twitter.com/disclosetv/status/1351189906173911046",
			"added": 1610984693
		}
	],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"1610527542_1NmKMF3LcKAxo5mCnGY1pctz343nW5Sxb3": [
			{
				"comment_id": 1,
				"body": "Socialism and Communism are the same thing.  The only difference is one lies about taking your property, and the latter doesn't.  Both are left wing.  Right wing extremism is anarchy.  Right wing is small government.  You can't have totalitarianism with no fucking government.  You can't have fascism(a bundle of sticks) with 1 stick.",
				"added": 1610787831
			}
		],
		"1610760100_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": [
			{
				"comment_id": 2,
				"body": "They are declaring bankruptcy to liquidate their assets without New York taking it all.  They are moving their HQ to Texas.  It's an asset protection measure.  It's what you do in totalitarian regimes.  You burn it down and run.  Even though I am an Endowment Member, I am no fan of their conduct for the last decade.  They've done nothing to protect the second amendment but pretend the slope isn't slippery.  GOA and the Virginia Citizens Defense League are much better organizations.  You step on a hair of their dick, and they sue the fuck out of you.",
				"added": 1610788067
			}
		],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "Signal is a DARPA spin off.  Which means it's CIA.  Jack Dorsey(Twatter Commie) endorses it.  That's enough reason for me to not get within a mile of that platform.",
				"added": 1610788304
			}
		],
		"1610984695_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": [
			{
				"comment_id": 4,
				"body": "NEW: At 10:20am, Hill staffers received the following text per \n@ArdenFarhi\n:\n\n“All buildings within the Capitol Complex: External security threat, no entry or exit is permitted, stay away from exterior windows, doors. If outside, seem cover. USCP”\n10:26 AM · Jan 18, 2021·Twitter for iPhone",
				"added": 1610985174
			},
			{
				"comment_id": 5,
				"body": "Apparently homeless encampments are detonating propane tanks around the capital.  Police say there are many propane tanks around the capital building.  False alarm.  Homeless people detonate propane tanks into a cloud of hellfire all the time.",
				"added": 1610990895
			},
			{
				"comment_id": 6,
				"body": "Apparently homeless encampments are detonating propane tanks around the capital.  Police say there are many propane tanks around the capital building.  False alarm.  Homeless people detonate propane tanks into a cloud of hellfire all the time.",
				"added": 1610990902
			}
		]
	},
	"comment_vote": {}
}