{
	"title": "pzmw's blog",
	"description": "Just everyday things",
	"links": "- Send me a message on [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=pzmw)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1469916487,
	"post": [
		{
			"post_id": 5,
			"title": "Aedes aegypti",
			"date_published": 1469916141.048,
			"body": "Over the last few months I have probably murdered 100 or so mosquitoes.\n\nI feel great.\n\n---\n\nThese fuckers are coming from everywhere. You can't stand still for a few minutes before they decide to touch you and suck your goddamn blood.\n\n**FUCK THAT**.\n\nIt's bad enough that they exist, but now they want to pull their parasite bullshit on me? Hell no.\n\nHere's what happened today:\n\nLike most slow nights at home, I smoked some weed, watched a few episodes of a few shows and tried not to think about this tragedy that is the human condition. Then one of this fuckers passed by my ear.\n\n**Why, man?** That's like the most inconsiderate thing an insect could do. I'm there having a great time, rewatching *Mr. Robot* and this asshole decides to fuck with me. Well, it forgot that I am the human, not it. It forgot that I am the one who can count to tent - OR COUNT AT ALL!\n\nSo I stopped VLC, waited for the fucker to fly around me and when it touched my beautiful bare skin... **BAAM**. Right in the goddamned fucker!\n\nBut I'd be bullshitting you if I said that I'm winning this war. No. They are many and even if my jihad against them is powerful, even if my rage is **OVER NINE THOUSAND**, I'm still losing.\n\nLosing, for it does not matter how many of them are falling, they always come back. It doesn't matter if I close my windows, wear long clothes, turn on a fan and pretty much try every kind of anti-insect bullshit that the world can serve us, they still come.\n\nIt's become a kind of tradition. Whenever one of these parasite motherfuckers show up in front of me I feel obligated to end its life. Often one firm slap against whatever surface the sick fucks are touching is all it takes to make the world a better place. After that I wash my hand while having a sick grin on my face.\n\nI feel great. But I know that this war is far from over.\n\nI leave you now while toking another joint, but always remember: \n\n> All that is necessary for the triumph of evil is that good people do nothing."
		},
		{
			"post_id": 4,
			"title": "Anarchism",
			"date_published": 1462030175.041,
			"body": "It's all about freedom, friendship and democracy.\n\nI think that anarchism is a tendency in human development, a principle among those who accept it, that says that any kind of authority or hierarchy must justify itself. If they can't justify their authority then they are illegitimate and must be dismantled.\n\n---\n\nAnarchists seek freedom from oppressive systems of control, whether they be the state, capitalism, racism, sexism, or religious institutions.\n\nThe people involved and interested are the ones that judge the justification of those forms of authority and/or hierarchy. If they are not acceptable then they should be dismantled or restructured.\n\nIn principle that's an idea that, I think, most people would agree with. The disagreements start because different people will have different definitions of what kinds of authority are acceptable. That is completely fine for a free society and the discussions that come from it must happen.\n\nIs wage slavery an oxymoron? Is representative democracy working? Is the current *free market* really free? What else can be questioned?\n\nI would love to hear your opinion about any of this, even if you disagree with me; specially if you disagree with me."
		},
		{
			"post_id": 3,
			"title": "Giving a fuck",
			"date_published": 1460334691.171,
			"body": "Yesterday I found that one-in-a-million person.\n\nShit, that's lame, let me start again.\n\n---\n\nYesterday (09 April) was my friend's birthday. I was at her party, drinking some beers, talking about shit, cracking jokes; having a great time.\n\nWe were talking about religion, god and stuff but all in a very friendly way. Then came this chick, out of nowhere, looking like she was lost.\n\nShe was standing next to our table, as were other people, and listening what a guy was saying. I don't remember exactly but it was probably some bullshit about inconsistencies in the bible.\n\nThe chick, out of nowhere, said something like this:\n\n> I think the debate about religion has reached a dead point. It has all become a sort of intellectual masturbation and imposition of morality. Why can't both sides just **chill the fuck out** and enjoy what we have? Why bother with religion if life is great? Why bother with atheism if god does not exist?\n\nThat is very close to what she said, I don't remember the exact words but I know that it was pretty close to that.\n\nMy... huh... girlfriend? girl friend? girl that is also my friend? well, a friend that I am involved with. Fuck, what a stupid term *involved* is.\n\nWell, my *friend* said something like:\n\n> I kind of agree but I think that not talking about those things just lets the taboo about god and religion grow. The less we talk about it the more delicate people get about it.\n\nAt this point everyone was watching the chick. She had that **fucking smile** that killed me. I can't even describe it. Well, let me try.\n\nIn her smile there was happiness, drunkenness, understanding and beauty. Man, I look like a romantic little bitch right now but I gotta tell you; she was captivating.\n\nThe chick responded with something funny that I can't fucking remember. I know it was not a direct answer but everyone liked.\n\nThis *friend* of mine is one of a kind as well. I mean, I don't want you to think that I'm saying this just because she is *my* friend but maaan. That chick gets what she wants and enjoys what she gets. (wow, gonna trademark that sentence real quick, be right back)\n\nMy *friend* asked the chick what she likes and she said, with that **goddamn** smile: \n\n> I like many things.\n\nJust by remembering this shit I get turned on. **Holy shit**.\n\nWe kept talking for a while, going from politics to the singularity and then back to religion and finally sex. I could see that my *friend* was probing this chick.\n\nMy *friend* \"stole\" a kiss from her and the chick's reaction was **amazing**. She kept her eyes closed even after the kiss and she bit her **GODDAMN LIPS**.\n\nI wanted to kiss her as well but I didn't want to just do the same as my *friend* did, so I kissed her (*friend*) instead. Remember, I was drunk. But that kind of made sense.\n\nDuring that long as fuck kiss, the chick moved her hands in my leg and I stopped with my *friend* and gave the chick one **DAMN** kiss. I mean, I don't like to brag and shit but maaan. I felt like we were in sync. I knew what I had to do and how to do it. While I touched her skin I felt my body beg for her. Not ecstasy; clarity (Mr. Robot reference).\n\nThis is not sex, just a hot kiss.\n\nI calmed myself down. I think that sex is a lot better when the desire builds up (and also I knew that we couldn't fuck there) so I smiled at my *friend* and had a sip of her drink.\n\nAt this point the party was starting to die out. My *friend* lighted a joint and the three of us started smoking some good ol' weed. After a few minutes my friend that was throwing the party came with her girlfriend and we all smoked right there.\n\nShe told us that she met this chick at college and that they quickly became friends (I think that's an euphemism she used because of her girlfriend; they probably had something).\n\nAfter the joint burnt out and we talked some more, we (*friend* and I) invited this chick to come home with us, but she said that she had some bullshit agreement with her dad to always come home after parties. Maybe she was bullshitting us but I don't think so. I will meet with her tomorrow, let's see!\n\nSo I got her number and went to my [cockroach-infested little house](http://127.0.0.1:43110/1LfW2jrhzPF1pFSy5yQRMaVPvoNhsZMTBE/?Post:1) with my *friend*, talking about the chick all the way there.\n\nThe moral of the story, kids, is that happiness is only real when shared! (Into the Wild reference)."
		},
		{
			"post_id": 2,
			"title": "Sex",
			"date_published": 1459274275.782,
			"body": "I like sex. I really do. All kinds of sex, really. Anal, oral, vaginal. I'm all for it. I fuck with women and men.\n\nSex is not wrong. It's one of the best forms of entertainment. And since it's so good, why not do it with whomever is interested?\n\n---\n\nI'm not suggesting you to fuck with that homeless dude close to your house, just suggesting you to be open to possibilities.\n\nAfter you get the idea that sex is something good and normal, the next thing you'll realize is that \"homosexual\" sex is also good and normal. What I'm talking about here is mostly called *Pansexuality*.\n\n[Wikipedia](https://en.wikipedia.org/wiki/Pansexuality):\n\n> **Pansexuality**, or **omnisexuality**, is sexual attraction, romantic love, or emotional attraction toward people of any sex or gender identity. Pansexual people may refer to themselves as gender-blind, asserting that gender and sex are insignificant or irrelevant in determining whether they will be sexually attracted to others.\n\nI also reject monogamy. Polygamy fits perfectly with this idea; why would you fuck one person when the whole world is out there, waiting to be fucked?\n\nThere's only one caveat: I think I would never be in more than one \"serious relationship\" if the people involved were not aware. Even though I think that *sharing is caring*, I understand that some partners could not share that view and get understandably let down by what they would think is cheating.\n\nBut who says I'm looking for anything serious out of life?"
		},
		{
			"post_id": 1,
			"title": "Roaches",
			"date_published": 1456710979,
			"body": "They are the worst.\n\nHave I told you about the time that I had to kill a roach at 2 in the morning?\n\nFuck, where should I start. Ok, here we go.\n\n---\n\nThere was I, browsing gun wild, doing my thing online, and then I decided to smoke a bowl and go sleep. \n\nReasonable, right? Right.\n\nWhile I like to smoke, I don't like my small-ass house to reek of weed, so I normally blow the smoke to the window.\n\nThere was I, having a great time, listening to some random 8tracks playlist and drinking a cold-ass glass of water... when I see a ***HUGE***, god damned, black motherfucking roach walking on the table close to the window and going behind it. \n\nI immediately stop smoking, close the window and make my life's *goal* to murder that *fucker*.\n\nAt that time, it's around midnight.\n\nWith the window closed, I go to the kitchen (closing the door of my room behind me), pick a broom that in foresight I should call **The Orphan Maker**, and go back to my room closing the door as well.\n\nImagine this situation. There I was, high as fuck, angry as fuck, holding a broom and knocking on the furniture for the *fucker* to get out.\n\nBut of course, like most *fuckers*, this one is also an *asshole*.\n\nI then move my table around and, to my surprise, the *fucker* is nowhere to be found.\n\n**Fuck.**\n\nThen the best ***[high idea](https://www.reddit.com/r/highideas/)*** of the night comes to me: spray deodorant and the *fucker* will get out, suffocating.\n\nNo deal.\n\nAt this point the *fucker* was thinking something like:\n\n> just keep hiding and that stupid human will give up and then I'll walk on *its* mouth\n\nFuck, what an asshole.\n\nAfter a whole deal of frustration, I gave up. Opened the door, put the broom back in the kitchen and when I got back... **JACK FUCKING POT**.\n\nThat damn thing was walking like a *chump*, all proud of itself. I quickly picked the broom and **BAAAM**.\n\nI hit that bad boy so hard that I even heard its children crying. Sweet.\n\nAfter cleaning that whole mess from my goddamn floor, I was happy. That was the victory of humanity over an insect. Showing that even when we, Humans, give up on something, we always win, eventually.\n\nI put the no-longer-*fucker* in a plastic bag and for some reason (the weed) I decided that I would not use my bathroom trashcan for it.\n\nI opened the door and when I was moving to the garden, I KID YOU NOT, there was a weird ass lizard (a small one, they are common here) just hanging out in front of my door. \n\n**FUCK THAT**.\n\nI threw the bag outside and closed the door.\n\nGoing back to my room I though of this high joke:\n\n> I was catching a roach and ended up with one lizard, two elves and three Jehovah's Witnesses.\n\nI smoked another bowl (hell yeah) but now from the \"living room\"'s window and then I slept.\n\nHappy as a motherfucker.\n\nThe dead roach can be found [here](data/pages/roach.html), it ain't pretty."
		}
	]
}