{
	"next_comment_id": 11,
	"comment": [
		{
			"comment_id": 1,
			"body": "> [zeropyro](#comment_2_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): and actually he was blocking me from write on him forum\n> Man you are not 100%!!!\n> If sombody can not read the information.Then start spamming multiple time some sh....! In another service.Then do not surprise to get BANNED!\n\nI would not be in the mining, I would be happy to remove you from here if you make clear that there is a cryptominer on your site, and allow users to adjust the hardware donation.\n\nI know you can do it with coinhive, if a user can decide, then I have nothing against it and I'll remove you from here.",
			"post_id": 2,
			"date_added": 1549045648
		},
		{
			"comment_id": 2,
			"body": "> [geekless](#comment_2_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Sure. And it is you who wants to run a miner on my hardware, not me.My time is not so cheap to spend it for reading sites that tell me how I should process data on my hardware, whether I should turn AdBlock on or off, etc.\n> I can potentially get around your silly splash screen, but I prefer to play fair game. You are not nice to your visitors, so I won't be your visitor. So I blacklisted your site.\n\nif you have a laptop you encounter battery problems with miners, that coinhive works on phones too... and why? i dont want loose battery life, i pay the energy that is used on my pc",
			"post_id": 6,
			"date_added": 1549240344
		},
		{
			"comment_id": 3,
			"body": "> [zeropyro](#comment_6_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): And how much encounter battery problems? Are you tested? Its make more problems than the non stop running apps? How much faster the battery is discharged? Have you caused visible problems the miner? How long does it take to charge the battery compared to other pages? Because if you have no specific TRUSTED information, you can misinform others half-truths. From which others can filter out untrue things.Because it didn't caused me any extra problems in (mobile,laptop and PC).\n\ni've tested that, in fact, whenever I'm on your site beyond the alarm of avg when I control the activity management, the thread used to load your page gives me the sign of battery draining. - i have a screenshot about that.\n\nyour site use the 40% of an i7 7700hq and it is ALOT! \n\nThere are other ways to finance, and you're currently using one of the worst for the users, ok it's not advertising, but you kill all your mobile phone users (phone & laptops).\n\n",
			"post_id": 6,
			"date_added": 1549290626
		},
		{
			"comment_id": 4,
			"body": "> [zeropyro](#comment_7_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): Pyrotechnics are a sensitive theme,the are many assholes who whant shut down,smear,mole this services. Actualy there are the visitor and the user. The visitor just visit the site and add nothing to the page. All service will be gaurantated online if i have the zites and files. Not important to be 24/7 online. Who needs it, get all content. Im only interest the users,and not the visitors. This is a small community, outsiders from this community i don't care. Who doesn't like it, there is the delete button. The FAQ telling everything correctly in the forum. The users are read it and accepted. If you don't like it, you can go simple elsewhere.I don't know, and I don't want everyone to be in to please. No one is forcing the visitors to use the service. And no one force it somebody have problems keep to use it. Things don't work like that way,a stranger  user open the site and 2 minutes later he want to  tell (or force) the stuff how to run the service! Or a sombody want tell the users what to do,or what not to do! This point my way, or hi way.The C&P community is trust-based, the first comments count a lot. Who doesn't part of the community,then don't want to anything from the community. The administrator's job is to protect the members. It is not the stuff duty to be nice everyone who is visit  the services.If somebody have problems to use a service his disk space,CPU usage then why use the service?! If not used then what's his problem? The service and description are 100% correct and trusted! The source code of the services are open source.The descriptions give all possible help to the users.Everyone can see the code its not contain any harmful thing.\n\nI'm not questioning your work, but I'm questioning how you try to make money on it, a user who does not use antivirus, who did not go through your site's Terms of Service, finds the battery dying in 1 hour, of 3 hours and 30 that even my pc can promise me.\n\nok, it is your job is precious, and all that, but let the user decide how much and if donate for your work.",
			"post_id": 6,
			"date_added": 1549290848
		},
		{
			"comment_id": 5,
			"body": "> [geekless](#comment_1_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Here is what it says me:\n> Welcome!\n> It looks like you're using an ad blocker. That's okay. Who doesn't?\n> But without advertising-income, we can't keep making this site awesome.\n> \n> Lol, okay. Deleted and blacklisted it.\n\nthis is the fastest way, precisely for this I'm working, I want at least the user can choose whether to contribute to the page or not.\nprecisely for this reason, I apologized, and I tried a dialogue, but in any case he actually is currently in my  public blacklist.\n",
			"post_id": 6,
			"date_added": 1549291412
		},
		{
			"comment_id": 6,
			"body": "> [anonymouslogin](#comment_1_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): The progress is slow! 0Net have many z-site.This bolg contains nothing.Stucked some websites.\n\nthe empty sites, do not fall into the field of elements that should be banned, because one day maybe they will be populated with an excellent site",
			"post_id": 6,
			"date_added": 1549291566
		},
		{
			"comment_id": 7,
			"body": "> [quantumworld](#comment_1_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I have looked over your ban list and about 10% of the sites you have on your ban list are linked to political censorship. I would put a warning in your ban list that you sensor political speech and content from users you think are offensive. Also several sites you said that there were active bit mining applications and I found nothing to back that up at all. No html references to any program that was bit-mining in the background and no processes doing that.  Needless to say your ban list is disturbing to me that you feel it is your obligation to pick and choose what content others can see or not see. Everyone has a delete button and a block and ban button on Zeronet. Use it when you feel it is necessary.  I would rename your ban list to say suggested ban list.\n\nmy banlist contains only elements, which can be risky for users and computers, for example someone who has created a site selling guns, but for example porn +18, sites containing guides, useful sites even if they contain things of politics do not fall within the field of ban",
			"post_id": 6,
			"date_added": 1549291813
		},
		{
			"comment_id": 8,
			"body": "> [geekless](#comment_3_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Lol.\n> Here in Russia, we have a saying: Три дня я гналась за вами, чтобы сказать, как вы мне безразличны - I've been chasing you for three days just to say how much I don't care.\n\nif he does not care, he will still remain on my list of ban, both he as user and his site, here in zeronet assume that users are trying to create a new internet, and a guy who prefers to earn than keep his free and active page for me should not be present, especially if he does not think about his users (in 15 minutes he consumed a 20% battery), and this also prevents you to spend a lot of time on his page.",
			"post_id": 6,
			"date_added": 1549292389
		},
		{
			"comment_id": 9,
			"body": "> [geekless](#comment_4_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): The forum doesn't work.data/users/content.json cannot be downloaded.\n> I guess you didn't sign the file or so...\n\nactually i'm not hosting using fiber, in 4 hours the forum will go up again",
			"post_id": 10,
			"date_added": 1549293240
		},
		{
			"comment_id": 10,
			"body": "> [zeropyro](#comment_6_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV): And how much encounter battery problems? Are you tested? Its make more problems than the non stop running apps? How much faster the battery is discharged? Have you caused visible problems the miner? How long does it take to charge the battery compared to other pages? Because if you have no specific TRUSTED information, you can misinform others half-truths. From which others can filter out untrue things.Because it didn't caused me any extra problems in (mobile,laptop and PC).\n\ni've tested that, because windows now say to me which app is using so much battery, so yes, i know who is draining my battery.",
			"post_id": 6,
			"date_added": 1549293489
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}