{
	"title": "DDP Microblog",
	"description": "Unter Volldampf!",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 14,
	"demo": false,
	"modified": 1520544178,
	"post": [
		{
			"post_id": 13,
			"title": "Der Lacher des Tages",
			"date_published": 1520544000.025,
			"body": "[Handelsblatt, 08. März 2018](http://www.handelsblatt.com/my/unternehmen/mittelstand/familienunternehmer/dennis-und-dustin-dahlmann-pioniere-der-e-zigaretten-szene-kaempfen-gegen-tabaksteuer/21038484.html?ticket=ST-7124935-IGEekY7YAc3EoqEIXB9R-ap1) (Bezahlschranke):\n\n**Pioniere der E-Zigaretten-Szene kämpfen gegen Tabaksteuer**\n_Die Innocigs-Gründer engagieren sich in Brüssel und Berlin für ihre Branche und loben, dass die GroKo Tabakwerbung weiterhin erlaubt._ (Quelle: [Handelsblatt](http://www.handelsblatt.com/my/unternehmen/mittelstand/familienunternehmer/dennis-und-dustin-dahlmann-pioniere-der-e-zigaretten-szene-kaempfen-gegen-tabaksteuer/21038484.html?ticket=ST-7124935-IGEekY7YAc3EoqEIXB9R-ap1))\n\nJau… die **Pioniere**… und die Erde ist eine Scheibe…\n\nDemnächst schreiben sie auch noch “Marcell D’Avis, der Pionier des Internet” (wer sich nicht erinnert, das war der “Leiter Kundenzufriedenheit” bei 1&1 in den Werbespots)…\n\n**Also die Schlagzeile ist echt der Lacher des Tages!**"
		},
		{
			"post_id": 11,
			"title": "Nach Ungarn",
			"date_published": 1518629847.838,
			"body": "Gestern ist die Dampfdruck-Presse “umgezogen”… zu einem neuen Hoster in Ungarn ([Fullhosting](https://www.fullhosting.hu/)) und hat (die .de Domain bleibt mir natürlich erhalten) auch eine Domain mit “.hu” bekommen.\n\nAnsonsten bleibt alles beim alten, ist ja klar. Also am besten Lesezeichen/Bookmarks aktualisieren. Wer https:dampfdruck-presse.de ansurft, bekommt diesen Hinweis angezeigt und wird zum neuen Ort weitergeleitet.\n\nHier geht's direkt zur [Dampfdruck-Presse](https://dampfdruck-presse.hu)."
		},
		{
			"post_id": 10,
			"title": "Apfelkompott-Nachschlag",
			"date_published": 1503604675.089,
			"body": "Liegt schon über ein halbes Jahr zurück… der „Bratapfel-Artikel“ der Süddeutschen Zeitung… und auch mein Artikel dazu: [Der Zipfel, der Zapfel, der Kipfel, der Kapfel…](http://127.0.0.1:43110/15NETkTzVm3Pi9re24HsKgAuDBdS5ZBXwB/?Post:18:﻿Der+Zipfel,+der+Zapfel,+der+Kipfel,+der+Kapfel…)\n\nDamals kritisierte ich, dass die SZ in ihrem Artikel der sogenannten „Studie“ zu chronischer Bronchitis bei Jugendlichen extrem viel Platz eingeräumt, der Autor vermutlich aber nur die Fakenews Pressemeldung dazu gelesen hat.\n\nIch habe auch auf zwei Artikel hingewiesen, die diese Studie schon zerpflückt hatten.\n\nHeute nun erschien ein Artikel zu eben dieser „Studie“ und der Auswirkungen in der Presse und Öffentlichkeit bei esanum, auf den ich hier gerne hinweisen möchte. Sehr lesenswert und verständlich geschrieben! (Und eine kleine Anklage über den Umgang der Presse mit Studienergebnissen.)\n\n[E-Zigarette und chronische Bronchitis: Wer ist hier auf dem Holzweg?](https://www.esanum.de/today/posts/e-zigarette-und-chronische-bronchitis-wer-ist-hier-auf-dem-holzweg)"
		},
		{
			"post_id": 9,
			"title": "Der Ton macht die Musik",
			"date_published": 1503604513.033,
			"body": "Kritik und freie Meinungsäußerung sind richtig und wichtig, das weiß ich sogar als „Tiefbegabter“ ([Zit. Prof. Dr. B. Mayer](https://archive.is/JgYRg)). Hilfreich ist, wenn man als Kritiker und Meinungsäußerer nicht nur lesen, sondern auch verstehen kann."
		},
		{
			"post_id": 8,
			"title": "Ein Märchen vom „schwarzen Schaf“",
			"date_published": 1503604257.719,
			"body": "Was „durfte“ ich heute im freien Web*) lesen?\n\n>„schwarze Schafe“ sensibilisieren die Politik strengere Maßnahmen zu ergreifen. Woher kommt denn zum Beispiel die 10ml / 20mg pro ml Grenze? Weil solche Sachen wie „welcher Shop verschickt 72mg/ml in Kanistern?“ mitbekommen haben. Die Damen und Herren der Politik lesen auch Posts mit.\n\n> Quelle: http://www.dampfertreff.de/t158759f209-Dampfinspektor-de-Aktion-Dampfer-unterstuetzt-eure-lokalen-Haendler-2.html#msg3091494\n\nDamit sich diese Märchen nicht in den Köpfen festsetzt, mal eine Mitteilung:\n\nNEIN, die 10-ml-20-mg-Regelung ist KEINE Erfindung der deutschen Gesetzgebung! Sie resultiert aus der Richtlinie 2014/40/EU (TPD2). Und die „Macher“ dieser Richtlinie sind auch nicht auf den Trichter gekommen, weil sie in Foren und SN von „schwarzen Schafe“ Diskussionen über hochkonzentrierte Basen mitgelesen haben, denn zu der Zeit, als die Grenzwerte auf EU-Ebene festgelegt wurden, waren Kanister mit Hochprozentigem gar kein Thema im Netz. Klar gab es solche Angebote (meist außerhalb der EU und sehr selten), aber in so ziemlich ALLEN Foren und auch in vielen SN-Bereichen war schon die bloße Erwähnung von Basen mit mehr als 32/34/36/38 mg/ml (je nach Plattform) verboten und wurde sanktioniert (und die Posts wurden gelöscht), weil alles, was höher dosiert war, als in Europa handelsübliche Liquids, aus Gründen des „Gesundheitsschutzes“ nicht diskutiert werden sollte.\n\nDas war auch die Zeit, wo sich kaum jemand an solches Zeug herangetraut hat und schon bei 32er Basen ein Vollkörper-Schutzanzug mit 3 mm dicken Gummihandschuhen empfohlen wurde, weil noch der Irrglaube vorherrschte, ein paar Tropfen auf der Haut würden einen in wenigen Minuten umbringen (heute wissen wir, dass Nikotin bei weitem nicht so giftig und brisant ist… aber das hat mit diesem Thema nichts zu tun).\n\nNEIN, die 10-ml-20-mg-Regelung ist NICHT zustandegekommen, weil überall über 72er oder gar 100er Basen in Großgebinden diskutiert wurde, sondern resultierte allein durch die falsche Einschätzung der Toxität von Nikotin. Aufgrund der fehlerhaften Werte wurde kalkuliert, dass das Trinken von 10 ml 20er Liquid oder Base gerade mal noch so zu überleben ist. Da wäre es egal gewesen, ob irgenwo über 10-Liter-Kanister 72er diskutiert wurde.\n\nNEIN, die „schwarzen Schafe“ (wer auch immer die sein sollen und was auch immer sie dazu macht) haben NICHTS mit der 10-ml-20-mg-Regelung zu tun.\n\n================\n\n*) Genau DAS Internet,dass wirklich jeder auf der ganzen Welt ohne irgendwelche „Anmeldung“ lesen kann und das auch fleißig von Suchmaschinen und Bots gecrawlt wird. Bei mir flog der Text über den Feedreader ein.\n\nArchiv: [https://archive.is/LrwmB](https://archive.is/LrwmB)"
		},
		{
			"post_id": 7,
			"title": "Zwei appe Beine und ein apper Arm…",
			"date_published": 1503592033.585,
			"body": "…sind besser als wie zwei appe Beine und zwei appe Arme!\n\nAlso freue sich jeder, dem nicht beide Beine und Arme abgehackt werden, sondern wem ein Arm gelassen wird!\n\nBlödsinn?\n\nJau, finde ich auch!\n\nBlödsinn ist auch _„Diese Produkte sind zweifelsfrei weniger gefährlich als Zigaretten“_ als **„Kehrtwende“** zu bezeichnen, wie gerade in einem bekannten Online-eCarport geschehen.\n\nGibt keine Kehrtwende und kein Umdenken in Deutschland, was das E-Dampfen anbelangt. Das zeigt sich durch die einseitige [Kampagne](http://xraucher.org/allgemein/%ef%bb%bfstimmungsmache-als-wissenschaftliche-debatte-ueber-fakten-getarnt/) der vergangenen Wochen von „Wissenschaft im Dialog“ und in der [Propagandaoffensive](https://archive.org/download/saveway_use_Bfg/bfg.png) des BfG auf Facebook.\n\nInzwischen beschleicht mich auch das Gefühl, der Drecks-Meinungsartikel von Wallasch ist vielleicht nicht einer spontanen Laune entsprungen, sondern war irgendwie „beauftragt“."
		},
		{
			"post_id": 6,
			"title": "Rosa Brille abnehmen!",
			"date_published": 1503591713.902,
			"body": "Wiedermal werden ein paar Äußerungen aus dem lieben, guten dkfz. bzw. vom ABNR als „neue Töne“ mit der Perspektive eines „Umdenkens“ gefeiert. Ok… mit einer rosa gefärbten Brille mag es so aussehen… aber wenn man die abnimmt, erkennt man die subtile Vorgehensweise.\n\nWenn Dr. Mons sagt:\n\n_„Denn die ganzen krebserregenden Stoffe einer normalen Zigarette entstehen beim Verbrennen. Im Dampf einer elektrischen Zigarette fänden sich „so gut wie keine“ dieser Gifte.“_ … dann klingt das auf den ersten Blick gut… aber „so gut wie keine“ ist die erste Einschränkung:\n\n_„Man kann bislang nur vermuten, dass der Dampf für Nichtraucher weniger schädlich ist als Passivrauchen.“_\n\nWas sagt dieser Satz aus? Genau… Passivdampf ist **WENIGER** schädlich, als Passivrauch. **ABER**: Passivdampf ist trotzdem **GEFÄHRLICH**. Die Aussage steht da… ohne wissenschaftlichen Beweis.\n\nUnd wenn „[Monika](http://127.0.0.1:43110/15kGBwgr43ri1xuzB18ZfYvQUirYyPPePc/?Page:monika)“ raushaut:\n\n_„Diese Produkte sind zweifelsfrei weniger gefährlich als Zigaretten.“_ … dann sollte man sich wieder fragen, was der Satz denn aussagt: Dampfen ist **WENIGER** gefährlich, als Rauchen. **ABER**: Dampfen ist trotzdem **GEFÄHRLICH**. Auch die Aussage steht da… ohne wissenschaftlichen Beweis.\n\nWie weltfremd muss man eigentlich sein, wenn man meint, bei dkfz. und ABNR habe tatsächlich ein Umdenkprozess eingesetzt… es ist erst wenige Wochen her, als eine (vermutlich) vom dkfz. und „Moni“ gesteuerte Propaganda-Kampagne wieder schöne Fakenews über das Dampfen in die Öffentlichkeit getragen hat ([Stimmungsmache als wissenschaftliche Debatte über Fakten getarnt](http://xraucher.org/allgemein/%ef%bb%bfstimmungsmache-als-wissenschaftliche-debatte-ueber-fakten-getarnt/))"
		},
		{
			"post_id": 5,
			"title": "Nicht aufregen… ist doch nur ne Meinung!",
			"date_published": 1503591574.867,
			"body": "Ein Meinungsmagazin enthält…\n\n- Kommentare\n- Kritiken\n- Glossen\n- Kolumnen\n- Essays\n\nDiesen Publikationsformen ist eins gemeinsam: sie geben lediglich die Meinung des Verfassers wieder. Wenn also ein Wallasch einen großen Eimer gequirlte Scheiße in einem liberal-konservativen Meinungsmagazin veröffentlicht, dann mag der Inhalt manchem stinken… es ist aber seine Meinung und die äußert er frei. Darf er… die Meinung muss man nicht teilen… aber ist auch kein Grund zur Aufregung… ignorieren bedeutet, dass man die Scheiße nicht riechen muss.\n\nSelbst wenn der Artikel Lügen oder Fehler enthält, werden daraus keine „Fakenews“, weil es eben… na?… genau!… keine NEWS sind.\n\nAlso „Arsch jeleckt und wechjesteckt!“ ￼;)\n\n================\n[https://archive.is/dGJQo](https://archive.is/dGJQo)"
		},
		{
			"post_id": 4,
			"title": "Comparaison n’est pas raison",
			"date_published": 1503591424.784,
			"body": "Wenn eine allwissende Müllhalde™ Äpfel mit Birnen vergleicht, dann ist ihre kleine Welt gleich wieder heile… die Zwitscher vögeln, die Summen bienen und das Blau ist strahlend himmel.\n\nUnd als Feier eines solchen kleinen Selbstbetrugs kann man dann locker auch noch ein „Support Gewinnspiel“ machen… das bringt Klicks und dem Werbepartner*) Einnahmen.\n\n================\n*) [Pepe und die Kneifzange](https://dampfdruck-presse.de/%ef%bb%bfpepe-und-die-kneifzange/)"
		},
		{
			"post_id": 3,
			"title": "Faktencheck: Die Debatte – 5% Krebsrisiko",
			"date_published": 1503591264.151,
			"body": "Beim Faktencheck durchgefallen: Die Debatte – E-Zigarette – weniger schädlich, aber nicht gesund\n\n[Wissenschaft im Dialog – Krebsrisiko der E-Zigarette nur fünf Prozent des Krebsrisikos beim Rauchen herkömmlicher Zigaretten](http://vapeattack.xraucher.org/2017/07/wissenschaft-im-dialog-krebsrisiko-e-zigarette/)"
		},
		{
			"post_id": 2,
			"title": "„Dampfer“-Petitionen",
			"date_published": 1503590799.968,
			"body": "Derzeit laufen wieder zwei Online-Petitionen, die politische Ziele rund um das Dampfen erreichen wollen.\n\nEs spricht auch nichts gegen solche Petitionen (selbst wenn sie nicht durch „offizielle“ Petitionsmechanismen realisiert werden), denn sie signalisieren dauerhaft nachvollziehbar, dass ein Interesse in Teilen der Bevölkerung besteht.\n\nAber bitte… bevor die nächste Petition startet… tut Euch selbst einen Gefallen (also die Petenten/Initiatoren) und macht Euch die Mühe, das Anliegen sorgfältig auszuarbeiten und wählt eine Plattform, mit der möglichst viele leben können.\n\n1. Den richtigen Adressaten wählen! Änderungswünsche z. B. bezüglich der TPD2 müssen an die EU gerichtet werden. Einzelne Mitgliedsländer sind die falschen Ansprechpartner.\n\n2. Keine rechtlich oder tatsächlich völlig unmöglichen Forderungen stellen. Der Wunsch, bestimmte Regelungen der TPD2 z. B. aus dem TabakerzG zu streichen ist sinnlos, weil der Gesetzgeber verpflichtet ist, den durch die TPD2 gesteckten Rahmen umzusetzen. Wo hingegen Gestaltungsspielraum vorhanden ist, sind eigenständige Verschärfungen oder Regelungen, die nicht aufgrund der TPD2 erfolgten. Ansonsten… dann Punkt 1 beachten. ￼\n\n3. Eine seriöse Petitionsplattform wählen. Change.org und Avaaz sind vermutlich die bekanntesten Plattformen, weshalb sie oft – ohne viel Nachzudenken – gewählt werden. Change,org ist aber aus Gründen des Datenschutzes eine schlechte Wahl ([BigBrotherAward 2016](https://bigbrotherawards.de/2016/wirtschaft-changeorg) / [Datenschutzrechtliche Bewertung](http://www.netzwerk-datenschutzexpertise.de/file/121/download?token=kMixMG1B)) und Avaaz ist auch eher zwielichtig, weil sich die Organisation an Dingen beteiligt, die mit einer Petitionsplattform wenig zu tun haben (z. B. direkte Unterstützung einer Konfliktpartei in einem Bürgerkriegsland – [Avaaz in Syrien](http://www.spiegel.de/politik/ausland/aktivisten-gruppe-avaaz-in-syrien-die-journalisten-schmuggler-a-818361.html). Wenn solche Plattformen gewählt werden, so hält es viele davon ab, mitzuzeichnen (ich gehöre auch dazu). Gedankenlosigkeit bei der Auswahl ist fahrlässig.\nEine gute Alternative, die auch gut funktioniert, ziemlich sauber agiert und auch bezüglich des Datenschutzes ordentlich arbeitet, ist [OpenPetition](https://www.openpetition.de/).\n\n4. Wenn der Petitionstext steht… SUCHT Euch jemanden zum Gegenlesen! Jemanden, der auf Rechtschreibung und Audruck achtet. Die Idee und Forderung kann noch so gut sein… voller Fehler schreckt sie vom Mitzeichnen ab und kommt auch beim Adressaten nicht gut an."
		},
		{
			"post_id": 1,
			"title": "Jetzt NEU: 25% mehr Inhalt gratis…",
			"date_published": 1433033779.604,
			"body": "Neee… ist jetz Quatsch… also das mit den fümmenzwansisch Bruzent.\n\nAber es gibt was NEUES: **Pepes DDP Microblog!**\n\nDas ist ein Blog, dessen Blogposts nicht in der [Dampfdruck-Presse](http://127.0.0.1:43110/15NETkTzVm3Pi9re24HsKgAuDBdS5ZBXwB/) auftauchen sollen. Das Blog ist für kurze Statusmeldungen, Infos, Kurzmeldungen zu Projekten etc. vorgesehen, die jetzt wirklich keine „großartigen“ redaktionellen Artikel sind.\n\nFür solche Infos werde ich nicht immer Posts in den Sozialen Netzwerken absetzen und auch keinen Newsletter verschicken… Wer auf dem Laufenden bleiben will, abonniert einfach den RSS für Pepes DDP Microblog."
		}
	],
	"tag": [
		{
			"value": "Dampfdruck-Presse",
			"post_id": 1
		},
		{
			"value": "Microblog",
			"post_id": 1
		},
		{
			"value": "Kommentar",
			"post_id": 2
		},
		{
			"value": "VapeAttack",
			"post_id": 3
		},
		{
			"value": "Faktencheck",
			"post_id": 3
		},
		{
			"value": "Äpfel",
			"post_id": 4
		},
		{
			"value": "Birnen",
			"post_id": 4
		},
		{
			"value": "AllwissendeMüllhalde™",
			"post_id": 4
		},
		{
			"value": "Kolumne",
			"post_id": 5
		},
		{
			"value": "Meinung",
			"post_id": 5
		},
		{
			"value": "Tichy",
			"post_id": 5
		},
		{
			"value": "Wallasch",
			"post_id": 5
		},
		{
			"value": "ABNR",
			"post_id": 6
		},
		{
			"value": "DKFZ",
			"post_id": 6
		},
		{
			"value": "MaPöLa",
			"post_id": 6
		},
		{
			"value": "Monika",
			"post_id": 6
		},
		{
			"value": "Mons",
			"post_id": 6
		},
		{
			"value": "BfG",
			"post_id": 7
		},
		{
			"value": "Campagne",
			"post_id": 7
		},
		{
			"value": "MaPöLa",
			"post_id": 7
		},
		{
			"value": "Monika",
			"post_id": 7
		},
		{
			"value": "Propaganda",
			"post_id": 7
		},
		{
			"value": "WissenschaftImDialog",
			"post_id": 7
		},
		{
			"value": "Begrenzung",
			"post_id": 8
		},
		{
			"value": "Nikotin",
			"post_id": 8
		},
		{
			"value": "schwarze",
			"post_id": 8
		},
		{
			"value": "Schafe",
			"post_id": 8
		},
		{
			"value": "TPD2",
			"post_id": 8
		},
		{
			"value": "Meinungsäußerung",
			"post_id": 9
		},
		{
			"value": "Krtitik",
			"post_id": 9
		},
		{
			"value": "lesen",
			"post_id": 9
		},
		{
			"value": "Tiefbegabter",
			"post_id": 9
		},
		{
			"value": "verstehen",
			"post_id": 9
		},
		{
			"value": "Bratapfel",
			"post_id": 10
		},
		{
			"value": "Bronchitis",
			"post_id": 10
		},
		{
			"value": "esanum",
			"post_id": 10
		},
		{
			"value": "Nachtrag",
			"post_id": 10
		},
		{
			"value": "fullhosting",
			"post_id": 11
		},
		{
			"value": "hu",
			"post_id": 11
		},
		{
			"value": "ungarn",
			"post_id": 11
		},
		{
			"value": "Lacher",
			"post_id": 13
		},
		{
			"value": "Presse",
			"post_id": 13
		}
	]
}