{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Je suis scié. Ou est la faille ?",
			"body": "Salut à toutes / tous.\n\nJe suis scié par cette techno. En quelques minutes j'avais quelque chose de complètement décentralisé installé sur ma machine, et je peux vous parler et laisser des messages ici, auxquels vous allez répondre...\n\nEn plus d'avoir la technologie de distribution des fichiers, il y a les applications qui fonctionnement au poil, et qui sont même assez sympa visuellement !\n\nOu est la faille ? :)",
			"added": 1456702047
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1_1C5FkFSP767q8TLNBLQvgCfsfWMviZ7evG": [
			{
				"comment_id": 1,
				"body": "Plusieurs choses qui me viennent en tête:\n\n- L'accès au réseau via Tor permet d'anonymiser ton adresse IP pour la connexion aux autres pairs et le téléchargement des données. Tor rendra un peu plus lent l'utilisation, mais en pratique je ne vois pas tellement la différence. Dans l'idéal, il faudrait que l'ensemble des personnes qui servent du contenu ZeroNet soient accessible depuis un service caché Tor !\n\n- Par rapport aux failles de JavaScript et des browsers. Une bonne pratique est de créer un nouveau profil Firefox, qui ne permet pas les connections en dehors de 127.0.0.1:43110 (ZeroNet), ce qui limite le nombre d'attaques possibles pour dé-anonymiser le traffic. Ca ne protège pas plus des exploitations de failles de sécurité du navigateur, mais permet de rester anonyme (très utile).\n\n- Après quelques discussions avec l'auteur de ZeroNet, il semble que la limitation de taille de la base de données est en fait une bonne idée: cela permet de choisir ce que l'on souhaite accéder et de découper les contenus en fonction de leurs appartenance. Par exemple, si on prends Wikipedia, l'idée serait d'avoir des sites différents en fonction des catégories.\n\nQuelques pointeurs ici également: https://blog.notmyidea.org/retours-sur-un-atelier-zeronet.html",
				"added": 1461064136
			}
		],
		"1_18ZfPCaU1pYAeos3A7YhZVgtsmXqXeRRW7": [
			{
				"comment_id": 2,
				"body": "Salut, et merci pour ton post, je cherchais justement les quelques failles de ZeroNet, et je suis ravi de voir tes trouvailles.\n\nJe vais tenter de répondre point par point :)\n\n1) Je vois ça comme une phrase de bootstrap. Implementer une DHT au lieu d'un tracker ne semble pas poser de souci technique majeur, et c'est (comme dit ailleurs) une volonté de l'équipe de dev. Laissons leur un peu de temps, ou mettons la main à la patte si on veut que ça avance plus vite, mais je ne vois pas ce point comme étant bloquant. Il est d'ailleurs possible de specifier l'utilisation d'un tracker maison, ce qui peut etre pratique de temps à autres.\n\n2) L'utilisation de la blockchain namecoin est tout à fait optionelle, et on laisse donc la possibilité aux auteurs de publier leurs sites sans utiliser les domaine .bit. Je suis tout à fait d'accord avec le fait que l'utilisation d'un point central va complètement à l'encontre de l'idée d'une blockchain. Tu parle du souci d'avoir ce comportement par defaut, et je ne suis que moyennement d'accord: les utilisateurs / integrateurs (distro) qui souhaitent avoir un comportement completement décentralisé par rapport à la résolution de nom peuvent avoir l'ensemble de la blockchain sur les machines clientes.\n\n3) Je vois surtout ZeroMail comme une application de démonstration, qui montre ce qui est possible de faire avec cette technologie. Techniquement, il me semble par contre impossible d'avoir quelque chose qui se passe d'une autorité centrale pour pouvoir ajouter des messages. Si c'est le cas, c'est à mon avis un point bloquant!\n\n4) Le fait que ZeroID soit effectivement quelque chose de centralisé est effectivement un problème. J'ai du mal à comprendre en quoi ZeroVerse résoud ce souci (j'ai l'impression que ZeroVerse rends l'enregistrement anonyme, mais je ne comprends pas en quoi il re-decentralise la solution).\n\nJe pose un lien supplémentaire, que je trouve interessant: http://127.0.0.1:43110/zerosecurity.bit",
				"added": 1461066040
			}
		]
	},
	"comment_vote": {}
}