{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1561066486_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 1,
				"body": "I recommend something like Tails (although Kodachi linux might be good as a last resort), or (as you mentioned) a flavour of linux in an SD card. Hopefully this is a valid loophole. This means that hiding it in a camera is possible. I wouldn't recommend Tails, since there is no software compatible with it. I recommend something common like Ubuntu or Debian, since they have much more software made for them. I must also mention that my high school blocks Tor connections, so I have to use meek-azure because no other bridges work. Try and use obfs3/4 when possible (leaving the meek-azure bridges available for people in china). They will no longer see anyone on Tor if you use obsf bridges.\nHopefully this works. Please keep us updated.",
				"added": 1561183459
			},
			{
				"comment_id": 7,
				"body": "> [qspitzer](#comment_15_1Hc87xHmLsZyaGTQYnx2UmQPKwE1EmgxKX): https://www.supremecourt.ohio.gov/rod/docs/pdf/0/2009/2009-Ohio-6426.pdf [...]\n\nIt's still worth hiding stuff.",
				"added": 1561209696
			}
		],
		"1560807628_1HiSNH8Uh5LSRjqxtrZrBUEquny9DNwzxZ": [
			{
				"comment_id": 2,
				"body": "Use Tor with a bridge.",
				"added": 1561183654
			}
		],
		"1560684873_1AqPs23HT3V8rwqey5F5bXsLMUZUmcMnep": [
			{
				"comment_id": 3,
				"body": "I feel like someone mixed some dogshit with Zeronet and Chrome.",
				"added": 1561184101
			}
		],
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 4,
				"body": "Big boi hackermans and \"access granted\" on laptops, being typed on very fast by a hooded figure. And pedos. And addicts.\nWhile there is a fair bit of CP and drugs, darknets get an bad rap.",
				"added": 1561184911
			}
		],
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": [
			{
				"comment_id": 5,
				"body": "Who doesn't?",
				"added": 1561185091
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 6,
				"body": "Just exploring Tor alternatives.",
				"added": 1561201427
			}
		],
		"1561032588_1CubdeDePywZpDx99J81tZSjJDNDGCzfzS": [
			{
				"comment_id": 8,
				"body": "Well they were the ones who created the WannaCry ransomware. The virus was then leaked, before causing billions of dollars worth of damage. They also approached Nils Torvalds (father of Linus Torvalds, who created Linux) to ask him to backdoor Linux. These are just two of many leaks, and only from the NSA. The list goes on.",
				"added": 1561252450
			}
		]
	},
	"comment_vote": {
		"1_1PNJZzvokVc1fVcA3U6hXfRPSZLcEfYJAc": 1
	}
}