{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1
	},
	"next_comment_id": 15,
	"comment": {
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 1,
				"body": "> [xhozt](#comment_2_1Fce2D4NGP2ec4YSse1mtGjFmhBBCy2Fzp): Violence has solved more conflicts than any other force in history. We have learned nothing from ww2 so we will repeat it. Day will come when its going to be another showdown between the our way our people only crowd and the rest of us... If ya want to make some real progress in mean time remove all safety labels from everything for one year.  Thats how to clean up a gene pool fair and impartial.\n\nMas> [xhozt](#comment_2_1Fce2D4NGP2ec4YSse1mtGjFmhBBCy2Fzp): Violence has solved more conflicts than any other force in history. We have learned nothing from ww2 so we will repeat it. Day will come when its going to be another showdown between the our way our people only crowd and the rest of us... If ya want to make some real progress in mean time remove all safety labels from everything for one year.  Thats how to clean up a gene pool fair and impartial.\n\nSome people actually read safety labels?",
				"added": 1572963872
			},
			{
				"comment_id": 2,
				"body": "NO MURDERS.  BAD FOR PUBLIC RELATIONS!",
				"added": 1572964094
			}
		],
		"1573157871_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 3,
				"body": "‘Climate gate’\n\nIn 2009, thousands of documents were leaked from the University of East Anglia Climatic Research Unit (cru). They revealed years of data manipulation, suppression and fraud by prominent climate scientists. The massive scandal, nicknamed Climategate, revealed three main themes: First, many scientists privately admit to each other that parts of the data are flimsy and require manipulation if they are to support the idea of severe man-made climate change. Second, many leading climate scientists see climate change as more of a political cause than a scientific pursuit. Third, many such scientists hide underlying data if it does not support the cause.\n\nIf the science is sure and settled, why would this manipulation and antiscientific behavior be needed to “prove” it? Climategate has been called “the worst scandal of this generation” and “the biggest scam in history.” Yet it was downplayed by climate activists dismissed as “irrelevant.” and whitewashed or ignored by most media and politicians.\n\nBut are they irrelevant? In one leaked e-mail, climatologist Kevin Trenberth wrote: “The fact is that we can’t account for the lack of warming at the moment and it is a travesty that we can’t.” In another, cru chief Phil Jones wrote to climatologists Michael Mann, Raymond Bradley and Malcolm Hughes: “I’ve just completed Mike’s nature trick of adding in the real temps to each series for the last 20 years (i.e. from 1981 onwards) … to hide the decline.”\n\nIt was use of this “trick” that had enabled Mann to produce the now infamous “hockey stick” graph. Gathering data from ice cores, tree rings, lake sediments and corals, his crew graphed global temperature over the past thousand years. Their graph showed a long, mostly flat line for the years from 800 to 1900 (the handle of the hockey stick), then a sudden upward spike (the upturned blade). It seemed to pin warming firmly on industrialization and became a fixture of global warming alarmism.\n\nBut the problem is that the graph was the result of manipulation—or, as Jones said, a “trick.” Mann had massaged the data to get rid of a pesky time of pre-industrial warmth called the Medieval Warm Period (occurring from about a.d. 1000 to 1300). This was followed by the Little Ice Age, lasting until the late 1800s. Does this mean 20th century warming could be largely a natural recovery from those cold years? Mann’s trick, which buried around seven centuries of climate history, tries to silence such questions.\n\nIn 2011, Climategate 2.0 broke. A new batch of 5,000 e-mails was leaked to the public showing the same themes as the first batch. “I have been talking w/ folks in the states about finding an investigative journalist to investigate and expose [skeptical scientist Steve McIntyre],” wrote Mann in one leaked e-mail. “The trick may be to decide on the main message and use that to guid[e] what’s included and what is left out [of IPCC reports],” wrote Jonathan Overpeck, (coordinating lead author for the most recent climate assessment by the United Nations Intergovernmental Panel on Climate Change (IPCC)), in another. They also discussed, among other public-relations matters, how to deal with skeptical editors and how to suppress unfavorable data.\n\nhttp://www.passionforliberty.com/2013/08/09/climategate-part-one-overview-tree-rings-and-the-divergence-problem-data-manipulation/-&- http://www.passionforliberty.com/2013/08/19/climategate-coverup/\n\nProf Phil Jones said- “The scientific community would come down on me in no uncertain terms if I said the world had cooled from 1998. OK it has but it is only 7 years of data and it isn’t statistically significant.”\nPhil Jones @uea Tue Jul 5 15:51:55 2005\n\nI found this brilliant introduction to the emails extremely useful and interesting.\nOver 100 emails are featured with explanatory notes.\nSo much for this being a case of a few emails taken out of context.\nThe more emails that you read and the more contexts that are given, the worse it all looks…\n….. http://www.lavoisier.com.au/articles/greenhouse-science/climate-change/climategate-emails.pdf\n\nClimategate, what’s going on?\n\nHere’s a 2 page artical from 2012\n\nThis  (wikileaks.org) archive presents over 60MB of emails, documents, code and models from the Climatic Research Unit at the University of East Anglia, written between 1996 and 2009.  (prior to a redaction & deletion process, triggered by a Freedom of Information request – If everything is kosher, why would CRU want to hide stuff ?)\n\nThere’s also a List of additional reading on the more info page.\n\nIt is a measure of the intellectual corruption of the mainstream media that this wasn’t the scandal of the century. But then again I forget, due to the eye watering amounts of money involved, “the science silence is settled” !!",
				"added": 1573158368
			},
			{
				"comment_id": 4,
				"body": "https://realclimatescience.com/2017/11/the-history-of-the-modern-climate-change-scam/",
				"added": 1573158400
			},
			{
				"comment_id": 5,
				"body": "http://www.avaresearch.com/articles/crooks-liars-idiots/the-global-warming-scam\n\n\nhttps://archive.org/details/ExposingAlGoresGlobalWarmingScamPart2",
				"added": 1573158681
			},
			{
				"comment_id": 6,
				"body": "https://www.verywellmind.com/an-overview-of-the-dunning-kruger-effect-4160740\n\nAnyway, people are too stupid to understand what's going on in this world. And therefore too easy to control.",
				"added": 1573158760
			},
			{
				"comment_id": 7,
				"body": "http://educate-yourself.org/cn/The-Hidden-Tyranny1976.shtml#top    <======================Source\n\n\n\nFROM EDUCATE YOURSELF.ORG\n\n\n\nTHIS IS NOT THE ENTIRE ARTICLE...... CLICK ON THE LINK ABOVE TO READ THE REST OF THE STORY.\n\n\n\n[Editor's Note: The amazing admissions made by an arrogant, 29 year old Zionist Jew named Harold Wallace Rosenthal, administrative assistant to Senator Jacob Javits of New York, in a paid interview with conservative Christian editor Walter White Jr. in a single day in July of 1976, has probably done more public relations damage to the world domination plans of International Jewry than all of the books, pamplets, and lectures exposing the dire subversive threat of the World Conquerors. At last, we have the singular rarity of a Zionist insider spilling the beans on Zionism's most carefully guarded agenda, exactly as they were elucidated in the Protocols of the Learned Elders of Zion, taught to the Zionist elect in French Masonic lodges more than 100 years ago. Rosenthal's hubris expired less than a month later when he was murdered at the EL Al terminal of the Istanbul airport on August 11, 1976 (archive here) on his way to Israel, in what Walter White describes as a Mossad arranged hyjacking show, blamed on the PLO, designed to take out Rosenthal for revealing too much.\n\nNot all Jews are part of the Zionist takeover agenda. It's both foolish and simplistic to blame ordinary Jewish people who are outside of the warped, radical, and demented mind set of Zionist zealots, for the evil machinations of cabalists and their masonic henchmen to destroy America and its Christian ethos. Responsible, thinking people must focus their attention on the individuals who are - through word or deed - actually aiding and abetting the Zionist takeover game plan in some fashion, and not play into the hands of Zionist trolls who want to incite racial animosity and bigotry in order to play their \"anti-Semite\" card and ridicule legitimate opposition to Zionist subversion.\n\nThe Jade Helm military exercies currently taken place in the USA, in violation of the Posse Comitatus Act of 1878, are rehearsals for the coming bloodbath, chaos, and martial law upheaval that the servants of Zion have been planning to create in America for well over a century in order to destroy, once and for all, the shining light of the American Republic and its Christian people. All of our current \"news\" events are the product of Zionist planning, subversion, and agitation: from the promotion of homosexuality, to the Supreme Court decison on gay marriage, to the latest, staged church shooting in Charleston, South Carolina. It's all scripted and planned to destroy America from within, without risk to life or limb of even one Zionist infil-traitor.\n\nThe recordings of Rosenthal and White were never made public, as agreed upon when the interview was first arranged. Part One is part of the transcribed text that White made public in 1977, while Part Two was not released until 1983.\n\nI've embedded a Youtube video of the Rosentahl interview, along with an MP3 audio download of the audiobook. Not all words are pronounced with perfect diction with this electronic voice rendition, but the audio is reasonably easy to understand. \"W\" refers to comments from Walter White and \"R\" refers to comments made by Rosenthal. Aliyah is mispronounced as \"Allah\". The word \"all\" is mispronounced as separate letters- \"A-L-L\", etc.....Ken Adachi]",
				"added": 1573159039
			},
			{
				"comment_id": 8,
				"body": "Not the jew, not the masons:\nthe people/beings behind them.\n\n\nDo you not think you response is a cop out??  Try a little harder than that.  \n\nTHERE ARE NO JEWISH WATCHDOG GROUPS (ADL, JIDF, JDL, AIPAC, SPLC, HA-BAD LUBAVITCH  ETC...) WHO WILL NOT REFUTE THIS DOCUMENT.  NOT ONE GROUP OUT THERE WHO DARE TOUCH IT WITH A TEN FOOT POLE.",
				"added": 1573159697
			},
			{
				"comment_id": 9,
				"body": "Proof is in the pudding.....",
				"added": 1573159779
			},
			{
				"comment_id": 10,
				"body": "> [blahblah69](#comment_18_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): agenda 21 says it all. if that takes hold we are literally done.\n\nNow would be a really good time to start studying up on them.  Jesus Christ, The Word, education,  discipline are everything.",
				"added": 1573159919
			},
			{
				"comment_id": 12,
				"body": "http://educate-yourself.org/cn/The-Hidden-Tyranny1976.shtml#top \n\nTHERE ARE NO JEWISH WATCHDOG GROUPS (ADL, JIDF, JDL, AIPAC, SPLC, HA-BAD LUBAVITCH ETC...) WHO WILL NOT REFUTE THIS DOCUMENT. NOT ONE GROUP OUT THERE WHO DARE TOUCH IT WITH A TEN FOOT POLE.",
				"added": 1573160055
			},
			{
				"comment_id": 14,
				"body": "http://educate-yourself.org/cn/The-Hidden-Tyranny1976.shtml#top\n\nTHERE ARE NO JEWISH WATCHDOG GROUPS (ADL, JIDF, JDL, AIPAC, SPLC, HA-BAD LUBAVITCH ETC...) WHO WILL NOT REFUTE THIS DOCUMENT. NOT ONE GROUP OUT THERE WHO DARE TOUCH IT WITH A TEN FOOT POLE.",
				"added": 1573160265
			}
		],
		"1573159148_11553Fm1cV9cYruFuVX5eLkXUMthjJUe6q": [
			{
				"comment_id": 11,
				"body": "Who knows.  Try not to boo anyone away who is new here.....",
				"added": 1573159976
			}
		],
		"1573086875_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 13,
				"body": "So why post the video if you are calling ZERONET a, \"reprehensible sewer of free speech\" in the first place???????  Why even link the hack MSM here???",
				"added": 1573160196
			}
		]
	},
	"comment_vote": {
		"2_1FwdBw6nyF1YWZN6j6MgnwHVoG3ssAN5CY": 1,
		"18_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1
	}
}