{
	"posts": [
		{
			"id": "94ccdeae-9834-46dc-9aa3-eff306b12fb6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "d2a54715-8738-42c5-8c34-473fc2c30ff6",
			"body": ">>661f1fbd-ac42-42a5-a5d4-82ed7dc9ae9c\nSo is life. We live in a very lame cyberpunk future.\n\nNow, back to FF XIV. What changes do you want for the jobs for 5.1? For my part, MNK's changes in 5.05 were good, but some of them may be a bit strong (Riddle of the Earth) while leaving SSS, Tornado Kick and Anatma practically useless, as now keeping your stacks is way easier. I'll say turning them into regular oGCD skills may be the solution, but I'll prefer if they had further function beside damage, even if it is not related to GL, but can't think of anything good. SMN is great for me, but is getting a lot of hate, I fear big changes are on the way. For my part, I'll like if SE fucking fixed the pet's AIs already so Bahamuth and Phoenix prioritize attacking before moving so we stop losing so much DPS. Also wouldn't mind if Ruin II was a bit stronger and the timing of Tri-disaster wasn't as awkward, it feels pretty bad to enter trance when Tri is like less than 15 seconds away from coming out of cooldown, or having to manually apply DoTs when there are less than 10 seconds for Wyrm Trance. For SCH, I wish they gave us back some more skills. At this point I have given up in them coming with interesting downtime for SCH, so at least SB damage rotation should do.\n\nEdit: oh, also, would like if SMN's potencies were increased. Their damage feels too low for what is supposed to be a core element of the class. Egi Action being only Ruin IV generators bothers me, I like the interaction between Egi and summoner, but I'll like them being more important. Also wouldn't mind them being turned into Demi with a buff to their attacks, but that is too much to ask.",
			"time": 1565137483400,
			"files": "[]",
			"last_edited": 1565139969900
		},
		{
			"id": "04094aaa-cf78-4127-9ef4-ae620e6689ed",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "cb42250b-cca5-4546-acd5-1d4824d241ff",
			"body": "bump",
			"time": 1565332440300,
			"files": "[]"
		},
		{
			"id": "c6f98faa-62be-4240-9f72-c6ea65a7eb61",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "4b721eef-4524-4a56-ae86-cd244a505868",
			"body": "bump",
			"time": 1565332473200,
			"files": "[]"
		},
		{
			"id": "f67a4a0b-031d-447a-a0c8-26cb60ab71e1",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "99262f5e-d862-4156-a769-7c730810f9f6",
			"body": "bump",
			"time": 1565332512100,
			"files": "[]"
		},
		{
			"id": "10633cfc-2cb5-435d-bb0d-f0c1828ffcd6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "d98a9b80-3c8e-4a20-854a-affd4ccf16e8",
			"body": "bump",
			"time": 1565332552000,
			"files": "[]"
		},
		{
			"id": "0706b8ca-2e27-48e7-9dd1-97488ca38cd6",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "503cd9c3-b8e4-4ece-8125-031ed5183717",
			"body": "bump",
			"time": 1565332557000,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}