{
	"next_comment_id": 10,
	"comment": [
		{
			"comment_id": 1,
			"body": "آپدیت جدید: برای پست های طولانی دکمه بیشتر بخوانید اضافه کردم، البته این ویژگی بود توی خود زیروبلاگ و کافیه بعد از پاراگراف اولتون دو خط --- رو بنویسید تا درست بشه",
			"post_id": 14,
			"date_added": 1629122181
		},
		{
			"comment_id": 2,
			"body": "> [0i](#comment_4_1PoAiovhP7W2NpPcbQrBkx3mmroK2fMDJw): بسیار عالی و آموزندهمخصوصا نکاتی  که توی پرانتز میاری\n> تشکر\n\nمرسی، خواهش میکنم.",
			"post_id": 19,
			"date_added": 1629292573
		},
		{
			"comment_id": 3,
			"body": "آپدیت‌های 27 آگوست 2021:\n\n1. فونت فارسی و خوانا وزیر اضافه شد.\n\n2. طول نوشته ها کمی بیشتر شد.\n\n3. مشکل به هم ریختن ظاهر نوار سمت چپ در صفحه‌نمایش های کوچک حل شد.\n\n4. اندازه فونت ها برای خوانایی بیشتر کمی کوچک تر شدند.",
			"post_id": 14,
			"date_added": 1630081298
		},
		{
			"comment_id": 4,
			"body": "آپدیت‌های 28 آگوست 2021:\n1. مشکل overflow(سرریز) متن در دکمه لایک حل شد.\n2. تاریخ جلالی(شمسی) اضافه شد، حالا به جای n هفته قبل و ... تاریخ فارسی و شمسی رو مینویسه.\n3. یک سری مشکلات ظاهری در صفحه‌نمایش های کوچک حل شدند.",
			"post_id": 14,
			"date_added": 1630167469
		},
		{
			"comment_id": 5,
			"body": "> [0i](#comment_5_1PoAiovhP7W2NpPcbQrBkx3mmroK2fMDJw): عالیزیرو نت فارسی  مدیون شما هست\n\nمرسی (:",
			"post_id": 24,
			"date_added": 1632053444
		},
		{
			"comment_id": 6,
			"body": "> [dongfangbubai](#comment_2_15MX2DqTKCcwEzZbHc3UBJXh4tP6H2H1DD): البته من تست کردم راست به چپ و فونت وزیر و... فعال نبود برای من.\n\nممنون بابت اطلاع رسانی، فونت وزیر کار نمیکنه ولی راست به چپ رو چک کردم دیدم درسته(البته فقط برای زبان هایی که راست به چپ نوشته/خونده میشن کار میکنه و بقیه نوشته ها از چپ به راست هستن).",
			"post_id": 24,
			"date_added": 1632473248
		},
		{
			"comment_id": 7,
			"body": "> [dongfangbubai](#comment_2_15MX2DqTKCcwEzZbHc3UBJXh4tP6H2H1DD): البته من تست کردم راست به چپ و فونت وزیر و... فعال نبود برای من.\n\nمشکل فونت وزیر رو حل کردم، یک بار کش مرورگرتون رو پاک کنید تا css جدید لود بشه...",
			"post_id": 24,
			"date_added": 1632474056
		},
		{
			"comment_id": 8,
			"body": "> [dongfangbubai](#comment_3_15MX2DqTKCcwEzZbHc3UBJXh4tP6H2H1DD): ممنون برای پیگیری آپدیت کردم و کش رو پاک کردم هنوز فونت دیفالت رو میاره\n\nمشکل راست به چپ حل شد؟\nمرورگرتون چیه؟ با یک مرورگر دیگه امتحان کنید، من با تور، فایرفاکس و brave تست کردم و نشون میداد.",
			"post_id": 24,
			"date_added": 1632483171
		},
		{
			"comment_id": 9,
			"body": "> [dongfangbubai](#comment_4_15MX2DqTKCcwEzZbHc3UBJXh4tP6H2H1DD): مرورگر دیگه فعلن ندارم ولی با MS Edge هم نشون نمیداد.کل زیرومی رو هم پاک کردم و دوباره نصب کردم و نشد.\n> در مورد راست به چپ، اون قسمت نوشتن پست جدید هم فونتش وزیر شده و هم راست به چپه اما وقتی پست ارسال میشه فونت وزیر نیست و وقتی Editش میکنم هم فونت وزیر نیست و راست به چپ هم نیست.\n> فکر کنم CSS های اون بخش ها رو هم باید تغئیر بدید :)\n\nکس دیگه ای هم این مشکل رو داره؟\nبرای من با هر مرورگری تست کردم فونت وزیر و راست به چپ درست بود.\nبازهم چکش میکنم فردا شاید مشکل رو پیدا کردم...\nاگر هم خودتون مشکل رو پیدا کردید که از چی بوده بگید کد رو اصلاح کنم.",
			"post_id": 24,
			"date_added": 1632507379
		}
	],
	"comment_vote": {},
	"post_vote": {
		"7": 1
	}
}