{
	"next_topic_id": 3,
	"topics": [],
	"next_message_id": 7,
	"comments": {
		"1@148": [
			{
				"comment_id": 1,
				"body": "Ok, here's my problem, I have two test sites I created\n\n~removed~\nhttp://127.0.0.1:43110/test.theblocklist.bit\n\nI have them both signed and Zeronet says \"Full connection on port 15441\" and both sites state \"Seeding - no peers\"\nwhich is expected because no one knows of my sites.\n\nBut to test to see if they worked, I took my secondary laptop, put it on my phones hotspot to grab a diffrent network address from the host machine and made attempts to connect to the site.\n\nOn the laptop it stated No-peers found even though my host machine is seeding and eventually it said 1 peer found but it still errored out on pulling the content.json on my laptop while I had my host machine seeding the content the whole time.\n\nAny suggestions?",
				"added": 1430291080
			},
			{
				"comment_id": 2,
				"body": "> [nofish](#comment_105_2): Both working for me!\n\nGuess it takes time for population, woke up this morning and I have peers now, thanks.\nTime to focus more time into this. =)",
				"added": 1430322238
			}
		],
		"1@107": [
			{
				"comment_id": 3,
				"body": "^ Thanks 4 This ^",
				"added": 1430340150
			}
		],
		"3@105": [
			{
				"comment_id": 4,
				"body": "@salvotnt\nI enjoyed your blog so much I went ahead and registered a namecoin domain for you.\nanimeblog.salvotnt.bit\n\nIf you get / have a namecoin wallet, post your address and I'll transfer the domain to you. =)",
				"added": 1430343027
			}
		],
		"3@2": [
			{
				"comment_id": 5,
				"body": "I would like to see the 0 in the top right bring up a menu of favorite or stared sites with the ability to take you to your front page.\n\nFront page shows every site visited / seeding would be nice if the 0 showed your favorite ones. Just IMO",
				"added": 1430345613
			}
		],
		"2@148": [
			{
				"comment_id": 6,
				"body": "Is there any commands available to sign a site with only one command\n\n'python.exe zeronet.py siteSign MYSITE'  \nworks but haults at the step to enter my key to continue, and \n'python.exe zeronet.py siteSign MYSITE MYKEY'  only errors out.\n\nI'm pulling up the python prompt programmatically and it will be a pain if I have to stream input So is there any way to sign a site with one command? Or could you easily implement this in the next update?",
				"added": 1430631873
			}
		]
	},
	"comment_votes": {
		"105@2": 1,
		"10@70": 1,
		"18@131": 1,
		"50@62": 1,
		"15@105": 1,
		"13@105": 1
	},
	"topic_votes": {
		"1@107": 1,
		"3@105": 1,
		"3@2": 1
	}
}