{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1618547645,
			"title": "[Failed state] France",
			"body": "Various topics...\n\nÉric Zemmour : no force, no intelligence, but knowledge.\n\nin short it means it's a little weak man unable to apprehend and understand what wasn't already predigested to him, and he hides his lack of intelligence, by an with humor.\n\nA good example of educated (knowledgeable) people typical of the failed french regime.\n\nmost of the others don't even possess the knowledge, even if biased and only centered over and in france historical past.\n\ndon't get fooled, bitches :).\n\n(I wasn't, I just had never interests in a failed state history :), but for personal reason (video games) decided to explore this side, and I should have stuck to the food :D, at least I can spit it out, if it's... to be spitted).\n\nps france is one of the easiest state to regime change and take over, as said, if zemmour is one of their bestm if not the, just imagine the rest :).\n\nthey ain't made in iron nor of light :).",
			"added": 1618547644
		},
		{
			"topic_id": 1618547913,
			"title": "The art of boycotts - guides, helps, experience sharing...",
			"body": "today it's day one of my french tv total boycott ! those filthy propagandists won't steal my time, and subconsciously lower me to their pathetic level.\n\nday one, will appears strong, but temptations will be even more, and \"accidental zapping may always happen\" is an excuse of the weak. vigilance, extreme, until the habit dies.\n\nand you? in a religious duty filling or simply renouncing to something negative to you?",
			"added": 1618547911
		},
		{
			"topic_id": 1618578079,
			"title": "[Kill list] Foxnews",
			"body": "An example of the personals that the murdoch family employ to wage psywar on america... we know mr murdoch, we know, all too well, shall have stayed in australia, and never dared to mind here, to enslave us, in your crap. Happilly, you will never be able to foment and conspire against China, because there, your kind are meat.\n\nGeraldo Rivera > I hate this guy so much... He could be executed 10 times for me.\n\nnext\n\nJuan Williams > this guy like the previous is one of those traitors those should be executed 100x... I hate him so much, he is soooo dumb, and always break the flow of the 5... Always out of touch, always lying for Obiden shit... go way... but first the shakles to field... fucking slave.",
			"added": 1618578076
		}
	],
	"topic_vote": {},
	"next_comment_id": 142,
	"comment": {
		"1618547913_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 1,
				"body": "A thing I consider important is -- critical time of probable weakness --. It means to be conscious when expected temptation will present itself, and have already a strategy in place and some tactics in case of failure. \n\nFor example right now I may be tempted to zap on a french tv, and as I consciously think about it, I will try to be careful to not fall on this trap, and for example be active in my choice of tv watching. \n\nIt means that I won't avoid the medium of perdition, or time vampire but think about something else, like a animal channel or russian news :). Who knows... but careful.\n\ngl&hf.",
				"added": 1618551353
			},
			{
				"comment_id": 4,
				"body": "almost perfect, I sadly drifted two times on euronews, but not enough to even understand what they were talking about... why euronews too? because it's based in Lyon, and as it's in france, it's tainted.",
				"added": 1618553961
			},
			{
				"comment_id": 22,
				"body": "I failed... or more exactly I wasn't careful... wanting to zap from some corporate narrative, I used my muscle memory and end up on a french news(=propaganda) channel, moreover in a state of panic I moved to the next channel, which is too a french (news=propaganda) channel, finally I was able to escape from this braintrap.. the whole event lasted maybe 2 secs, at worst, but it was already another proof that vigilance must be maintain at all moment, or resaid, attention, the failures will strike when not expecting... the time vampire is a dangerous machine...\n\nit may happen again, but at least I wasn't exposed much :)",
				"added": 1618583774
			},
			{
				"comment_id": 28,
				"body": "What a success, mentally I feel way better than when I watched this shit! one thing I love with moneytv(s), is that, yes, there is a lot of corporate narrative, but it's always possible to check the price independently, and I have never seen cnbc or bloombergtv lie about the price. I have seen both gone completely ape shit crazy to remove trump, political, but on the economical side... they are trapped :)\n\none fun storry is when they tried on the onset of the panedemic to do some perception management, at the end of the day they were so proud of themselves... and then it moved :). And no words of them could matter, just commenting the flow :).\n\nso conclusion : great day 1 ! how long? till the revolution/liberation? heheheh.",
				"added": 1618602471
			},
			{
				"comment_id": 29,
				"body": "Why it sank me to watch them? For example I know that CNN is enemy media, but there is no doubt, even if fully biased, they have at least great image and visual from foreign places (like the recent tour in ukraine, or afghanistan or many others). On the contrary those french \"news\" channels have moved to the anger / talking head model... And they are sooooo dumb. beyond anything imaginable, linking to my nutrional theory with excessive sulfite in their diets... and such an incapacity to understand the world current map, and I don't mean it physically... it's such a vulgarity, such a pathetic self serving crowd, of worthless individuals, unable even to apprehend their own weaknesses. valueless, but as fertilizers. they may write without mistakes, however their expression isn't very advanced, and worst of all, it's the hoplessness... between the immgration support, the constant looting, the high tax rates, the lack of democracy, this self serving state, their war on plants, the eu integration and worst of all their cult of the uno... and the whole with their inability to understand any of it... and even worst their inability to understand market dynamics... there almost only 1 or 2 okay... like the fat with the small glass on a clone of cnbc (bfm business) and on the same channel the brown air guy, who gets it... (often a white shirt), appart them... it's the collapse.",
				"added": 1618602830
			},
			{
				"comment_id": 135,
				"body": "great great !",
				"added": 1618614771
			}
		],
		"1618389476_1Mx9Lz182swtKLQBaBRfvjH9kr3tmUoFaH": [
			{
				"comment_id": 2,
				"body": "Would it be possible that the iranians in teheran have a systematic food deficiency?or nutrional lack of something?",
				"added": 1618551590
			},
			{
				"comment_id": 3,
				"body": "or inversely maybe an excess of something, like for example I have a theory the french are intoxicated by https://en.wikipedia.org/wiki/Sulfite",
				"added": 1618551681
			}
		],
		"1616487037_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 5,
				"body": "One thing important to remember about the msn campaign against us county police, is the ambition of the Obiden regime to first consolidate all american local police forces into the federal police (part of their take over of the usa strategy, aka full total forever control) but more importantly to then transfer the whole auhority to the UNO.\n\nI guess it's because at first the UNO tried to take over each city police force, one by one, under the guise of the \"great\" city program, however they failed due to a too massive patriotism and worst a lack of time to waste on the UNO training, and how irrealistic it is... \n\nyes, yes, you are at war, you were regime changed, and I guess goons like \"kerry\" seek forever proconsulship... I am sure that happened too in far away roman province, when one proconsul refused or find excuses to not leave his post, most of the time due to income stream problems... \n\nthat's typically when the praetorian guard and those before them had to move the object. It was always fun when the sec team of this forward operator (the proconsul) where faced with those tasked by ROME to remove him, and them if they opposed, which they most of the time didn't...\n\nthey knew, they would killed, traded, or used as actors in some entertainment form :).\n\nand yes I saw the end of keane yesterady, poor man... you know dude, if trump is a pedo, which I highly believe (like 90% certitude), you could have ARRESTED and EXECUTED him, but if it was because this guy wasn't bowing to your authority, he was just following the constitution, and yes, I understand, lazy and greazy state operators may be surprised by the speed required to move in NYC building industry... \n\nDO.\n\nyou have a lot of inner soul searching and thinking to do, yes, you the pedogens who so proudly went on tv during the regime change operations... keane, mattis, the one with his mini suit case, at least odierno didn't fall that low... suckers.",
				"added": 1618554421
			},
			{
				"comment_id": 10,
				"body": "Personally, I think that right now it's the REAL BLM... I mean by this that in the summer it the was the ground forces of obiden in action, you can see it by the level of professionalism and support they got, be it from the msn, or the violence deployed, with the goal of swamping the trump regime.\n\nHowever I have an initiative that could derail their projects... it's called the \"digital town hall project\". the goal is to have by county / city a .onion forum only accessible with torbrowser and a passcode send by mail (a new one each month) to all legal resident, so that they can log, anonymously, and express their opinions in a non censored format, with total free speech, even insult, threats etc, so that their opinions can be first understood, acted, and discussed.\n\nI know that it's the anathema to the projects of the Obiden regime, which only sees us as rocks with legs, that they will mold as serfs for their great utopia. However it's necessary, in the sense that live town halls are great, but due to the nature of oral speech, aren't the most conducive way to handle policies, be it from fear or the simple nature of speech... (one can't speak over the others).\n\nmy 2 cents.\n\nand it would take 10 min to setup for a non moronic it team, there could even be a blueprint quickly made... aka an open source software which directly send even the passcodes... no need to recode 4000 times the same system, unless to create fake work (could use single key keyboard spaced by mile to even increase the head counts of the social staff).\n\nps each user of the same city / county has the same pass, no way to know who is who, the quick question is for them to secure a user name, maybe a second pass that they input themselves? details :)",
				"added": 1618556812
			},
			{
				"comment_id": 11,
				"body": "you know that you will have to execute maxine waters? https://www.zerohedge.com/political/shut-your-mouth-maxine-waters-blasts-jim-jordan-during-angry-exchange-fauci\n\nI believe you don't, weaklets, serfs, dociles domesticated taxcattles...",
				"added": 1618557032
			},
			{
				"comment_id": 12,
				"body": "pedogen honoré hard at work I guess or a looting op going bad ? \n\nhttps://www.zerohedge.com/markets/mass-casualty-incident-fedex-facility-indianapolis",
				"added": 1618557082
			},
			{
				"comment_id": 13,
				"body": "\"we will have succeed when no one knows what the facts on the ground are\" The cia\n\nhttps://www.zerohedge.com/political/us-intelligence-officially-walks-back-claim-russia-paid-bounties-us-troops-afghanistan\n\nsadly, they forgot that then even for the most idealist regarding the american project, when trust is gone, there is only the shadow of allegiance remaining...\n\nprotecting pedos... to that low this gov department felt... with their great worker : former Ag Barr... shame on him for eternity... at least the fruit didn't felt far from the tree, this time.\n\nIs the daughter as corrupt as her father and grand father? that's the question...",
				"added": 1618557214
			},
			{
				"comment_id": 20,
				"body": "Another high priority project, is fundamentally to disintermediate the social media and legacy media from the public discourse.\n\nby their censorship, they are both, the killers of western democracies, making my little \"annoymous local political password protected forum accessible only by .onion\" an imperial necessity... \n\notherwise, this whole idea of republic / democracy has absolutely no meaning in practice.\n\nAnd that's why CCP Rulezzzz, because fundamentally, it's Prc... P... so you hate western filths? heheheh... if IDF is idf strong, let's say, we play in another universe :). Don't threaten on US.\n\nPLA4EVA !",
				"added": 1618578328
			},
			{
				"comment_id": 21,
				"body": "Fundamentally jerry nadler shit in his pants, was 100% right, it was the organized ground forces of obama, so yes, no protests nor riots, but preparatory moves for the regime change.",
				"added": 1618578398
			}
		],
		"1618412687_18KNX9hqqZ2ssi7DYGLcRNSCcwjQTMjc4Q": [
			{
				"comment_id": 6,
				"body": "What will be her next move? how to front trade her?\n\n\"Front running is considered as a form of market manipulation and insider trading because a person who commits a front running activity expects security's price movements based on the non-public information. However, some forms of the front running, such as index front running, are not illegal. Examples of Front Running\"",
				"added": 1618554706
			},
			{
				"comment_id": 7,
				"body": "and does she has a parking for her bad trades like hitlary and her legendary cattle trading?",
				"added": 1618554751
			},
			{
				"comment_id": 8,
				"body": "btw she must be executed bear hands. smashed smashed smashed until her whole skulls explode against the wall... don't hurt yourself (I mean against the wall :D).",
				"added": 1618554809
			},
			{
				"comment_id": 9,
				"body": "and do you think brokers of congress share their trades? I guess in-house for sure, I mean, it's almost free money :). Who are the brokers of the pelosis btw? IB?",
				"added": 1618556540
			},
			{
				"comment_id": 14,
				"body": "https://www.cnbc.com/2021/01/19/doj-will-not-charge-sen-richard-burr-for-covid-stock-trades.html\n\nof course... they can even rape kids legally... I mean it's lawlessness for them, a doobie to jail for thy.",
				"added": 1618557579
			},
			{
				"comment_id": 15,
				"body": "Four senators were accused of insider trading, three are ...\n https://www.msnbc.com/rachel-maddow-show/four-senators-were-accused-insider-trading-three-are-clear-n1215381\nThe Justice Department is closing investigations into three U.S. senators for stocks trades made shortly before the coronavirus market turmoil, but is continuing a related investigation into GOP ...\n\nahahahah. you are so dumb and played, it's not even foolish, it's beyond pathetic, it's ridicule... laughing stoke of the awaken world.",
				"added": 1618557655
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 16,
				"body": "> [peppefail](#comment_2_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): ISRAEL IS NOT A LEGITIMATE STATE\n\nI love to hear your opinion :). Good luck defeating the IDF :) and have fun !",
				"added": 1618569178
			},
			{
				"comment_id": 19,
				"body": "how intermediated is the israeli democracy? I mean here in the west, there is full intermediation, I mean by this the legacy tv and the social media, both censuring makes the participation of the people IMPOSSIBLE, how is it in israel? I guess facefuk and the others digitalnazi censors anyone or only on certain subject or maybe they don't dare? I don't know, I ask...",
				"added": 1618578171
			},
			{
				"comment_id": 42,
				"body": "so the assassinations of the icc? plowing? nuking? fucking goyim who have dared to threaten those who prevent in the end in the sea? it's not tolerable, because they plan \"moves\" ala meng... heheh...",
				"added": 1618604119
			},
			{
				"comment_id": 43,
				"body": "and me, I want to punsih, burn and raze the village in africa where she comes first... first... burn her retreat, and show her the cost of war.",
				"added": 1618604162
			},
			{
				"comment_id": 44,
				"body": "everyone, where she comes from must die. 1.",
				"added": 1618604191
			},
			{
				"comment_id": 45,
				"body": "we start ot raise the stakes, they want to play, welcome to the middle east ! welcome !",
				"added": 1618604208
			},
			{
				"comment_id": 46,
				"body": "on those muderers, are on HER.",
				"added": 1618604228
			},
			{
				"comment_id": 47,
				"body": "to have dared to think about it.",
				"added": 1618604236
			},
			{
				"comment_id": 48,
				"body": "and that's why we crucified some people, to spare their chilren, as it was a clear and calm way to enjoy the destruction of those who opposed us.\n\nof course, most had a usage found for their corpses...\n\nthe game supply chain...",
				"added": 1618604307
			},
			{
				"comment_id": 49,
				"body": ":) kill them.",
				"added": 1618604316
			},
			{
				"comment_id": 50,
				"body": "and fundamentally that the thing that make me angry with zemmour, is that there is no negociation, they are non exitent military combatant... that's it.\n\nyou have a problem with idf, you come to the battlefield.\n\nthat's made for that.",
				"added": 1618604374
			},
			{
				"comment_id": 51,
				"body": "but if you pretend to hide yourselves, behind, legitimacy, un treaty, I call your bluff... death squad, and will see the next move of the enemies.",
				"added": 1618604414
			},
			{
				"comment_id": 52,
				"body": "and it will be to the graveyard, to burry their kids. step 1.",
				"added": 1618604427
			},
			{
				"comment_id": 53,
				"body": "and as they CAN'T ideologically (it's an atheist religion), understand, that they have no say over the land of israel, they have to be treated as enemy combatant... that's it... I don't see anything annoying or new... that's life...",
				"added": 1618604510
			},
			{
				"comment_id": 54,
				"body": "you want a state or your don't.\nwith a state comes enemies...\nlife...",
				"added": 1618604550
			},
			{
				"comment_id": 55,
				"body": "then I agree it's another thing to threaten PLA...",
				"added": 1618604566
			},
			{
				"comment_id": 56,
				"body": "and attention, remmeber the P... 1.",
				"added": 1618604603
			},
			{
				"comment_id": 57,
				"body": "just remember, by standers, today, fighting the chinese military state, is fighting the people of china...",
				"added": 1618604761
			},
			{
				"comment_id": 58,
				"body": "and that's where it's get interesting for your little jews, unable to have a continuous 5000 years occupation (the friendly term for an integrated mutiple combat matrixes)... remove the icc... yeah yeah... one problem less. the chinese military commissions... it's another universe...",
				"added": 1618604921
			},
			{
				"comment_id": 59,
				"body": "conclusion : ACTION !",
				"added": 1618604933
			},
			{
				"comment_id": 60,
				"body": "what I want : is to hear the ICC , all those academics, all those supporting this scam, to capitulate and surrender, to expose and humilate themselves... but for that they have to reveal their real intentions, to expose and explain their ambitions, and so, maybe only so, won't they have to burry their kids.",
				"added": 1618605000
			},
			{
				"comment_id": 61,
				"body": "because let's face it, idf encumbered, and it's the sea... and it's a polite image...",
				"added": 1618605028
			},
			{
				"comment_id": 62,
				"body": "and it makes a lot of water to split this time :).",
				"added": 1618605052
			},
			{
				"comment_id": 63,
				"body": "so I want all those icc judges, all the toilet cleaners there, to feel death, to go to their kids funerals, in waves... I want them so beaten down that the survivors will leave by themselves this shit, and burn it down, in fear and rage of what we will do to them...\n\nremember, contrary to all those around, they will never be neighboor, and don't forget, those kuffars will never judge islam... we won't allow it.",
				"added": 1618605146
			},
			{
				"comment_id": 64,
				"body": "and you understand what I mean...",
				"added": 1618605173
			},
			{
				"comment_id": 65,
				"body": "but no...",
				"added": 1618605179
			},
			{
				"comment_id": 66,
				"body": "btw the icc could very useful to show the neighborhood how unrestricted war is done :)... it will make some smile :).",
				"added": 1618605326
			},
			{
				"comment_id": 67,
				"body": "personally, I apply the dresde doctrine... in short, call the lahaye in the netherland, tell them : you wipe by tonight all presence of this icc from your territory and you live in peace.",
				"added": 1618605436
			},
			{
				"comment_id": 68,
				"body": "and that's one thing I reproach to weak nation, like israel, is to be unable to solve front lines fast, aka to be able to just open a quick one, flash it, and move back... too much thinking, planning etc... at one point, action.",
				"added": 1618605506
			},
			{
				"comment_id": 69,
				"body": "but know one thing little yahoodis, you surrender to the uno / icc etc... you lose your rights to stay... it's only logical... your little refuge, thorn in our side, waiting the real judgement, but surrendering to them? we have to wipe, you understand, it's only logical... because you would have become a springboard for the infidels to attempt to divide us and then conquer us...",
				"added": 1618605634
			},
			{
				"comment_id": 70,
				"body": "attention...",
				"added": 1618605651
			},
			{
				"comment_id": 71,
				"body": "it's a though neighboorhood that you called your promised land... or resaid a lot of things have happened since gen titus the great...",
				"added": 1618605743
			},
			{
				"comment_id": 72,
				"body": "but don't worry, I am realistic, I don't say to you to conquer and occupy the icc... no, just to wipe it... like sergio montemello agents were or in more funnier way based on the targeted killing of all family members of those involved until they surrender... remember it's UNrestricted there.",
				"added": 1618605832
			},
			{
				"comment_id": 73,
				"body": "enemy territory (And I LOVE the netherland, such a free country, but again, the enemy of mankind are smart and astute enough to hide there, expressly hoping to profits from this good rating, but... we see through the scam..., even if the dutch are unable or too poor to be able to free themselves from this occupation).",
				"added": 1618605911
			},
			{
				"comment_id": 74,
				"body": "first I want to kill all the children of all the personals involved in the icc. \nstep 2, I want to kill the children of all academics worlwide who support the icc (the most important)\nstep 3 interviews of those at their funerals : so was it worth it?\nand then see, if they become more rageous, time to eliminate the corrupted animals.",
				"added": 1618606089
			},
			{
				"comment_id": 75,
				"body": "but one thing, as they are very dumb, it's important to send them a funeral notice, your child was killed because of your support for the icc.",
				"added": 1618606159
			},
			{
				"comment_id": 76,
				"body": "and a little greeting, or something like this... for the lulz.",
				"added": 1618606175
			},
			{
				"comment_id": 77,
				"body": "or a smiley, it's faster and will cost less :).",
				"added": 1618606198
			},
			{
				"comment_id": 78,
				"body": "for me, the icc win = shoa 2.0. or at least a step in this direction...",
				"added": 1618606237
			},
			{
				"comment_id": 79,
				"body": "in short they want to take away the sovereignty of israel (or any other nation stupid enough to fall in their scams) by being able to RULE over the soldiers...\n\ndo you think pilatus would have tolerated a judean to rule over roman troops? where are we? roman troops themselves had the full authority of ROME to handle such filths themselves... full trust...",
				"added": 1618606316
			},
			{
				"comment_id": 80,
				"body": "more pressing matter, like sewer staturation :)... when they all go pee at the games after a nice killing spree... heheh...",
				"added": 1618606344
			},
			{
				"comment_id": 81,
				"body": "cool question, who was the highest \"authority\" judean killed by Rome? hehehe...",
				"added": 1618606400
			},
			{
				"comment_id": 82,
				"body": "applauze, chop chop, next one !",
				"added": 1618606418
			},
			{
				"comment_id": 83,
				"body": "at first I believe there were really confident... who was the most arrogant against Rome at the time? heheheh... and inversely who were the most realist?",
				"added": 1618606488
			},
			{
				"comment_id": 84,
				"body": "today, I hope that the ICC is the judeans of the time...",
				"added": 1618606525
			},
			{
				"comment_id": 85,
				"body": "and think about it, what is the second letter after the P? it's L...\n\nmental... first... the mindcaptives... poor them, not us. never.\n\npla4eva.",
				"added": 1618606607
			},
			{
				"comment_id": 86,
				"body": "i spin all this, but i was told that it was this week that the great reply was to be expected, I don't have access to the necrological page of lahaye (is that?) hagues, or what ever they call it... \n\nthey remove icc, great, they don't, what will you do? surrender? ignore and get captured ungeared? we watch... and rate :).",
				"added": 1618606833
			},
			{
				"comment_id": 87,
				"body": "that's pot meet kettle? from the narrative to reality? we will see...",
				"added": 1618606862
			},
			{
				"comment_id": 88,
				"body": "I guess that's the difference between POWER and the illusion of power... first they talk, then they met the front lines of rome... and they die :), another time... same story :).",
				"added": 1618606943
			},
			{
				"comment_id": 89,
				"body": "me I believe, that you are big enough to win against the icc, flawlessly, and even armlessly. but it must be hard...",
				"added": 1618607024
			},
			{
				"comment_id": 90,
				"body": "but it means for some of your tribes to foreclose their ideas of a world ruled by nohaid laws or what ever their jwo fiction was... remember ... the 3rd letter... A.",
				"added": 1618607084
			},
			{
				"comment_id": 91,
				"body": "and an s... or many...",
				"added": 1618607096
			},
			{
				"comment_id": 92,
				"body": "we aren't like american goyim brainwashed, weak and faithless... don't forget, rome is gone...",
				"added": 1618607132
			},
			{
				"comment_id": 138,
				"body": "it's really fun... because it's the moment, you will have to purge... or israel is a free independent state and forget all jwo / noahid law world take over, and live, or israel dies and dissapears with the rest of this nwo... heheheh... your call, your destiny, your survival...\n\nwe don't joke :) never have, never will...",
				"added": 1618614991
			},
			{
				"comment_id": 139,
				"body": "don't forget we are still right now in the infancy of the ircg training, we need first to check their nutrition... and they better be ready for a shift, no kiddoes, we won't mandate pork, nor mandate anything, just say what should... you would be better advised to follow the recs... it's TCM... it's older than you can imagine,... but rest assured their road is still way ahead of them... and yours?\n\nicc or not?\n\nwe know that the icc won't capture the mullahs without a giant fight... type schism :).",
				"added": 1618615115
			},
			{
				"comment_id": 140,
				"body": "where is zariff? sucked by western decorum? hahahaha... who knows :).",
				"added": 1618615187
			}
		],
		"1618298888_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 17,
				"body": "> [peppefail](#comment_1_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ): https://www.ildolomiti.it/cronaca/2021/video-coronavirus-proteste-e-autostrada-bloccata-vogliamo-riaprire-non-ne-possiamo-piu-lottiamo-per-i-nostri-figli\n\nmen like draghi need to feel the heat of rifles discharged in the head of their children to regain composure and attention otherwise, they believe their little play will make it...\n\nthis is the arrogance of those who need to die to wake up.\n\n:)",
				"added": 1618569288
			},
			{
				"comment_id": 18,
				"body": "however don't get me wrong, I am really horrified to theorize such things. However how to believe those people even have consciousness? that's the fundamental point, if they want to threat us as their personal proprieties, there come a time, they must be reminded that we are HUMANS, as such, killing them (as they don't have consciousness) is certainly the most efficient way to get the next wave to understand that their \"comedia dela politica\" is game over.\n\nOr they behave, as the posts they wanted requires, aka we aren't their capitves even less their serfs, or they learn by dying...\n\nMoreoever, I am really curious to know how the most aggressive form of peaceful protests works in practice, I mean highway blockage, I guess it's harder for the double agent or state instigators to infiltrate the protests, as they so normally do, making even peaceful protest an impossibility in the west.\n\nFurthermore, I believe they lost contact with the ground, because\n\n1. everyone around them lick their asses, ohhh mr president, so great, red carpet, lucurious dinners and stay etc...\n2. and worst even the press is fully behind them, hoping to be able, for themselves and their sponsors to ride the gravy train.\n\nWestern democracies are really dying...",
				"added": 1618573723
			}
		],
		"1618583185_1P7A6cCSYV4EdGzGfKT64SLp2FGevvmgZ9": [
			{
				"comment_id": 23,
				"body": "zerotalktech : http://127.0.0.1:43110/1EfLnw7GDXbZfJmGNoXGQ4XkuHGWkRZTMq/",
				"added": 1618583981
			},
			{
				"comment_id": 24,
				"body": "and zerotalkmusic : http://127.0.0.1:43110/15oXfMAMMKT59vVuqdXxjD7Mv24BmCyafu/",
				"added": 1618585507
			},
			{
				"comment_id": 26,
				"body": "What I don't understand is why not use the torrent protocol? What is wrong with it? It works.",
				"added": 1618601833
			}
		],
		"1618591816_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 25,
				"body": "WSB talk : http://127.0.0.1:43110/1NYRa6RcLLqTPg4JEnGeUc99XVDUqWSjKu/ \n\nDiamond handers, YOLO and above all :\n\nAPES\nTOGETHER\nSTRONG !!!\n\nbtw if you ain't happy you can always short it :).",
				"added": 1618601792
			}
		],
		"1618547645_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 27,
				"body": "What I find most interresting is that in a sense the Obiden regime is using the same playbook as the pedo sex slave mitterand... at least I find a lot of parallel between those 2 treasonous admins.\n\nMy opinion is that it's impossible to talk with those people, they know full well what they did. I liked particularly the japanese girl who went to Paris, hoping to see french men wearing small caps, carrying their bread sticks, and she ended up in a mix between bamako and marakech.\n\nWhat's the most dramatic is the upkeep that those invaders generate, in the sense that they consume now most of the state funds, and as such reduce the native population to tax cattle to sustain the exponential breeding rate of those invaders.\n\nWhat leads that VIOLENCE is the only way forward, is how they furthermore took FULL control of the justice system to achieve their population replacement and white genocide.\n\nAnd what angers me the most, is that I CAN NOT go to their countries... So they wanted their independence, in reference to the colonial past, very well with me, only the same, from my side.\n\nFundamentally there isn't much difference with Germany, they are just a little bit behind in the replacement / genocide / fiscal ruin... but they have tried the blueprint 1.0... so those who believe they will own and pawn germany forever, may better wake up, before ending in ashes...\n\nThen on the \"our country\", That's debatable, how much do you know YOUR ancestors, rather than the acts and pasts of people who despised, ruled and exploited, those who would have been YOUR ancestors? so you still have a nationalist idealism narrative to handle...\n\nFree speech... but I don't like you as an individual, you are a bad person, maybe like your ancestors...",
				"added": 1618602297
			}
		],
		"1617873274_1Nv7HrYvwPjyGyx6iUG7KZrj4TNduUBcah": [
			{
				"comment_id": 30,
				"body": "> [houtje](#comment_58_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): sounds good; take a look here; there are some more ideas being discussed to counter spam and illegal content. The goal is limit (ideally forfeit) centralized power. Using A.I. to combat bots and spam seems like a good idea.https://github.com/HelloZeroNet/ZeroNet/issues/2746Also take a look at what this guys said:https://boards.4channel.org/g/thread/81133794#p81172364\n\nwhat a load of crap, I MUTE WHO I WANT, END.",
				"added": 1618602879
			},
			{
				"comment_id": 106,
				"body": "> [houtje](#comment_60_1HV7aMJLo3XMuij1h17kP12ZYvp1Y8EzvA): user can choose whether or not they want to enable these filters, blocklists or AI. It's always your choice. That's the whole point of place like this. Don't worry.\n\nexactly , everyone does has he wishes :).",
				"added": 1618611272
			},
			{
				"comment_id": 107,
				"body": "I just say that if you don't know who the AI bans, you may miss some interesting content to you :).",
				"added": 1618611295
			}
		],
		"1618578079_1Gg1sTkqAaXfMmVVG6yghf3FF8D3RJuChf": [
			{
				"comment_id": 31,
				"body": "What I find ultra despicable in this most hated family in the universe : the murdoch, is how they selected their psywarfare agents ( juan and geraldo)... one your trash him your are anti blacks, the others anti mexicans...\n\nI hope that one day, the murdochs will be clashed in the west. I refere a lot about the serie, on roger ailes, at least ep 1 (before the show went on a weinstein redux)... I mean those murdochs hate america, shall be hunted down, in comparison the talibans, they are patriots ! \n\nif you think about it, the american founders, would have drafted the talibans and vice versa... really? guns rights? God given, Religion? the way you see fit... that's maybe the only confrontation, as the talibans, are clear... 1. \n\nand then I compare to this hainous australian family... And I am sure they are behind the harrassement of the uk monarchs... \n\nI hate the murdochs.\n\nso fuck you geraldo go die, and same for juan... slave, for ever.",
				"added": 1618603143
			},
			{
				"comment_id": 32,
				"body": "personally I would hunt down the murdochs... enemy list, high priority, capture alive or dead.",
				"added": 1618603236
			},
			{
				"comment_id": 33,
				"body": "I have a profound and sincere hate for those people.",
				"added": 1618603263
			},
			{
				"comment_id": 34,
				"body": "parasitic vermin.",
				"added": 1618603287
			},
			{
				"comment_id": 35,
				"body": "I am in total disagreement with their worldview. And sadly their visions isn't compatible with mine of the USA... afterall it's not my problem...\n\nthe murdoch, they can rule the west if they wish, they better understand, where Russia begins, and if they dare to mess with us (China), they will end up being killed, and all their agents... we don't care... bring it on... we have pigs to feed... \n\nanother clear illustration of how lost the cia and all american intelligences are just cucks.\n\nthat's it...\n\na good example, is the girl... \"how but you know it, how to compartimentalize your brain with what's classified, speaking to the most toxic female in the world (marry harf)...\". I mean what the fuck, those girls don't belong... at least one is fine on tv... the other? what the fuck do they have between their ears? \n\nthere is a point the psychological difference are so yuge, that there is seriously no way for a peaceful coexistence, and even less a political future. \n\nit's not possible. one must die or leave.",
				"added": 1618603602
			},
			{
				"comment_id": 36,
				"body": "you call them the left, but it's a fucking lie (that zemmour explained about a vote in the french parlement with a side for the king the other against)... its' a fucking global take over along the UN charter, decoy to foster the permanent feodal aristocartic with some pedochildrapists of the west, against foremost the native population of the west, with the ambition to expand this colonial authoritarian wrapped in for your own good totalitarian system to the whole world.\n\nthey can not be human... they lost their consciousness, they are vermin parastic, useless, weight and waste. remove, erase... delete... wipe... gone...",
				"added": 1618603857
			},
			{
				"comment_id": 37,
				"body": "and the murdoch their support for the pedos... they will pay.",
				"added": 1618603904
			},
			{
				"comment_id": 38,
				"body": "all the grand children of the Murdoch, are marked for execution, you sided with dershowitz, they died, this moment, so not to hurt your shitbag, no, so that all the others like you will think... no money will bring them back to life. none.",
				"added": 1618603957
			},
			{
				"comment_id": 39,
				"body": "and that's the cost/price of victory, and you know it full well... you are just too coward, weak and faithless...",
				"added": 1618603993
			},
			{
				"comment_id": 40,
				"body": "and if you thought about it, it's nothing, 100k , 200k and it's done... deads, yeah. but you don't want... perfect... america was a failed idea.",
				"added": 1618604034
			},
			{
				"comment_id": 41,
				"body": "for example we want the execution of the whole ICC, live.",
				"added": 1618604060
			},
			{
				"comment_id": 108,
				"body": "Frankly, there is a cool fun dynamic in the \"five\", specially watters, gutsfeld, one of the two blonde (the dwarf or the \"cia\" imposter (more cookies please, and did you check the printer?)...\n\nbecause recently it was just so again full on roger desillusion... this warmongering... so stupid.\n\n1. sanctions, what scantion? we don't give a shit, you aren't exceptional, neither the center of the world (happilly) (ps sanctions are technically an ACT OF WAR).\n2. crymoo was liberated and VOTED !!!!!! SELF DETERMINATION\n3. we don't play, it's not your move, our move... we do what ever we want !\n4. what else stupid this muppet said, ahhh, go away from the sea, the real enemies of america are in D.C....\n\nthis \"breit\" seems massively dumb... level juan and geraldo but still below the \"kennedy\"... her... she so worthless, not even worth a mention in the kill list... we pity her :).",
				"added": 1618611576
			},
			{
				"comment_id": 109,
				"body": "maybe breit we could gear you up and drop you on the frontline... you are soo courageous... let's see...",
				"added": 1618611604
			},
			{
				"comment_id": 110,
				"body": "pedofoxnews played a yuge role in the downfall of america into the sandpits... I guess it was the plan, send troops die far away, meanwhile with dershowitz rape kids? I guess roger ailes reality was watereddown or it was the only \"clean\" one in this dent of traitors?",
				"added": 1618611708
			},
			{
				"comment_id": 111,
				"body": "I think you are a clear reflection of the ultimate ubris, that you could destroy america while conquering the world... its' not possible.\n\nyou can come with words, smiles or crosses, we don't give a shit : this is the border of china, you are now warned.",
				"added": 1618611777
			},
			{
				"comment_id": 112,
				"body": "by destroying I mean, looting, plunder, rape, and exploit while enserfing... aka total shame and treason.",
				"added": 1618611827
			},
			{
				"comment_id": 113,
				"body": "and question short documentary, one of the losiest channel on earth... at the image of all the production of the murdochs...",
				"added": 1618611880
			},
			{
				"comment_id": 114,
				"body": "and a duration of ads... I mean it's mostly ads...",
				"added": 1618611914
			},
			{
				"comment_id": 115,
				"body": "I am curious what would have said a paul revere for example on your business...",
				"added": 1618611948
			},
			{
				"comment_id": 116,
				"body": "shame, treason, self serving, parasitic, demoralizing, working with the enemies...",
				"added": 1618611982
			},
			{
				"comment_id": 117,
				"body": "kill it.",
				"added": 1618611986
			},
			{
				"comment_id": 118,
				"body": "and that expose the very low quality of your audience...",
				"added": 1618612029
			},
			{
				"comment_id": 119,
				"body": "\"boomers\"",
				"added": 1618612053
			},
			{
				"comment_id": 120,
				"body": "but I find interesing how you walk this fine line, of... \"we are better than you, but we try to pretend we are with you, in a way that you won't see how we will fuck you\"... something like this...",
				"added": 1618612157
			},
			{
				"comment_id": 121,
				"body": "and weak... so weak... not even able to execute live on air dershowitz... that would have been fun :).",
				"added": 1618612178
			},
			{
				"comment_id": 122,
				"body": "in short you are very uncompetitive (in term of talents) and I guess your cost structure is way too expansive, even if still justified by the returns, but in short... you are in an uncompetitve field... degenerate.",
				"added": 1618612246
			},
			{
				"comment_id": 123,
				"body": "and a little last remark, don't forget russia is home, before you were even a nation... so watch out... we don't intent to surrender, to anyone.",
				"added": 1618612313
			},
			{
				"comment_id": 124,
				"body": "and frankly as nation, and what you represent, you are even too weak to even be considered... stay away.",
				"added": 1618612448
			},
			{
				"comment_id": 125,
				"body": "and remember, you have what I call a commerical army... we nuke. get it? nuke is just a word... until you realize what it concretely means...",
				"added": 1618612509
			},
			{
				"comment_id": 126,
				"body": "you think your skycrappers are strong? I loved how thorough the investiagations and reports on 911 were... great job, like for pedogate...",
				"added": 1618612555
			},
			{
				"comment_id": 127,
				"body": "and we are back at who will live, rather than who won't die... why not the juan and geraldo (of course the lulzers make the cut :D).",
				"added": 1618612587
			},
			{
				"comment_id": 128,
				"body": "it would be so ironic that the tools become the survivors...",
				"added": 1618612649
			},
			{
				"comment_id": 129,
				"body": "for me the most amuzing idea about the msn is their ideas they could move markets :), they forgot who paid them, even if they are even sometimes, just a line in spreadsheet, whose even business remains unknown... \"medias\". some may have \"legacy\" before and splitted...",
				"added": 1618612739
			},
			{
				"comment_id": 130,
				"body": "ahahah",
				"added": 1618612744
			},
			{
				"comment_id": 131,
				"body": "there is a cool movie illustrating what I think about \"breit\" and the others \"vets\" having been lured and betrayed for money and fame... it's about a guy (soldier) darfted, removed from his unit, to become some kind of thing they move around to parrot and pretend... like a prop... funny, and then he was all bad about it, because he finally understood that all the fiction he was tasked to represent was a lie... I don't remember exactly the war...",
				"added": 1618612929
			}
		],
		"1618604090_19xhtyj7LfruJTijwdhgR7yocsLVrLgSuP": [
			{
				"comment_id": 93,
				"body": "do you know judith?",
				"added": 1618607192
			},
			{
				"comment_id": 95,
				"body": "go die, you want to centralize us to \"save energy\"... go die... you have no chance to defeat us :).",
				"added": 1618607492
			},
			{
				"comment_id": 96,
				"body": "dear joana, I am for reducing your calorie consumption, to skin you... i will stop just before the systematic irrecoverable organ failure, I hope you will enjoy this leaning diet... are you fat?",
				"added": 1618607578
			},
			{
				"comment_id": 97,
				"body": "it will just last longer.",
				"added": 1618607597
			},
			{
				"comment_id": 98,
				"body": "and I will force you to take cold bath, to depleted your stored available energy... you will see... it's worst than \"water boarding\".",
				"added": 1618607637
			},
			{
				"comment_id": 99,
				"body": "I say worst, but no, because you will just fall asleep when what you have between your hears will shut down :).",
				"added": 1618607696
			},
			{
				"comment_id": 100,
				"body": "can we kill all your relative and loved one to \"save energy\"? why not?",
				"added": 1618607770
			},
			{
				"comment_id": 101,
				"body": "show us... walk the talk..",
				"added": 1618607780
			},
			{
				"comment_id": 102,
				"body": "but don't worry, we know, that we are at war :), we will win, again :).",
				"added": 1618607895
			}
		],
		"1618323031_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 94,
				"body": "I found the PM, very... excellent standing, japan is proud (at least until the balcony).... I mean, I can't imagine how disturbing it is to watch this regime from the inside (I mean usa), but rest assured : PLA 4 EVA (just for all things to be clear) and this tritium? that's the real challenge... more awareness would have maybe helped...",
				"added": 1618607453
			},
			{
				"comment_id": 103,
				"body": "the contrast is vivid between pro japan vs the farce... anyway... :). modern japan has a lot of problems... all internals...",
				"added": 1618608746
			},
			{
				"comment_id": 104,
				"body": "blah blah blah we don't give a shit >>>>>>>>>>>>>> TRITIUM what a LIAR !!!",
				"added": 1618608817
			},
			{
				"comment_id": 105,
				"body": "what a shame... unable to focus, what did we teach? everything is like forgotten :).",
				"added": 1618608845
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 132,
				"body": "hey erin, your kids are dead ! you said : consoler in chief, we should be outraged... I was what pedogate finnally? Noo... you want to take our AR for your bosses to rape us more...\n\nyour kids are dead.\n\nthank you for your work in damning them\n\nyou will see....",
				"added": 1618614651
			},
			{
				"comment_id": 133,
				"body": "you will cry.",
				"added": 1618614671
			},
			{
				"comment_id": 136,
				"body": "the great reset, will end up in great regrets...",
				"added": 1618614840
			},
			{
				"comment_id": 137,
				"body": "no dirty slave bitch : It's OUR GOD GIVEN RIGHT ... the 2ndA.",
				"added": 1618614860
			},
			{
				"comment_id": 141,
				"body": "seriously, I guess what happen to erin... she saw real money, she took a mortgage to high for her, and tried to play the \"jones\" end up at cnn to serve the uno, and will lose it all because of that... :). stupid move.",
				"added": 1618615539
			}
		],
		"1615101046_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 134,
				"body": "ahaha amazing ! <3 ! however due to my boycott, I zapped on aljazeerha and saw the vermin (zelinksi) in paris??? real or not? I don't know... zapped again... didn't want to see this filth of ... unnamed.",
				"added": 1618614740
			}
		]
	},
	"comment_vote": {}
}