{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "This forum software would be worth debugging. The best forum software what i found jet on 0Net. But everyone is copying the code of existing bugs. Development has stopped and it would be good if someone continued. This is still the original untouched code. But the original page has unfortunately gone.\n\nhttp://127.0.0.1:43110/14Famoc8KJoS5T9WCSbzxGAmA6TfXcdSPD/\n\nHave 3 bug: \n\n1.Bug:  If you post a topic with lage description. The description characters does not shows correctly. With the original ZeroUp this is working perfectly. Try upgrage the code from original ZeroUp.\n\nTry ro make a large topic.\n\nLike topic name:\n\n99999999999998888888888888877777777777666666666666655555555544444444443333333332222111111111\n\nThe last characters are not showing: 111111111\n\n2.Bug: The search function can not search the users comments, only can search the topic words.\n\nAnother functions are fine. Great zite, hope you guys fix this bugs.\n\n3.Bug:  video embedding issues from another zites.\n\n\n\nFeatures:\n\n- Search egnie\n- Video and picture embedding\n- File upload (In a well-designed way)\n- Have a Mail To This User option which is a useful thing (see the right option when you select a user)\n- Ranking method option under Start Topic button\n\nKnows everything we needs, only existing bugs should be fixed.\n\nIn ZT++ the users can't upload files. There is no internal search engine to search keywords in comments, topics. No private mail option to the user. And this is standard option in all modern forum software.  These Features could be integrated to ZT++ too.",
				"added": 1598167708
			},
			{
				"comment_id": 3,
				"body": "It could be a fix: If the original ZeroTalk clone the users create a Topic Groups then the themes are no longer followed in this topic groups. And if anyone comments in this groups then the comment will not appear in ZeroHello news feed.",
				"added": 1598172320
			},
			{
				"comment_id": 4,
				"body": "Bug: Creating New Group insaide the topics in subgroups are not auto following and not shows in Zero Hello menu when a user post a new topic. See the following button in subgroups are in (Follow in Newsfeed) state and not followed. But in the startpage are Followed state for all users who visit the site. This way not shows new topics insaide the groups in Zero Hello newsfeed. Users not see the new topics, whats new in the forum and can not react them insaide the subgroups. New topics this way only followed in the main page. In the startpage this function are working fine, but insaide the topic groups are not. So the whole forum will be less popular this way. The new content is thus very difficult to find in the forum if it is divided into categories.\n\nThe problem:\n\nIn Zero Talk++ auto followed (see green follow button) all topics in the startpage for all users. When a user create a group insaide the topics are not auto followed for another users. Only the creator follow the topics in the group. But another users can not follow the new topics insaide the subgroups. \n\nIn the startpage all topics are auto followed for all users, in topic groups are not. The correct setting will be default in start page and all subgroups are in „Following” state and in the topics „Follow in Newsfeed” state default way this setting for all users. And insaide the current topic if the user post a comment then auto followed the topic. This setting would solve this problem.",
				"added": 1598779855,
				"modified": 1598779971
			}
		]
	},
	"comment_vote": {}
}