{
	"title": "Мемуары Balancer'а",
	"description": "Буду записывать, пока ещё память жива :)",
	"links": "*   [Balancer's Blog](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)\n*   [Храм информационного фронтира](/1LnBdExztQKGSb3wnnchtczk9dyzJQtUp4/)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1546031375,
	"post": [
		{
			"post_id": 20,
			"title": "ДР: 22.10.1998",
			"date_published": 1543859289.19,
			"body": "Упустил момент 20-летней давности :) 22 октября 1998, общага. Отмечаем моё 25-летие :D\n\n![Scan-120418-0034_resize.jpg (1024x641)](data/img/post_20_Scan-120418-0034_resize.jpg)"
		},
		{
			"post_id": 19,
			"title": "Радио-86РК и Орион-128. Продолжение",
			"date_published": 1542102007.884,
			"body": "Начал писать ответ на коммент [в предыдущей записи](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:18:Радио-86РК.+Мой+первый+самодельный+ПК), но он быстро набрал пару экранов текста, так что решил вынести отдельным постом, да ещё проиллюстрировать :)\n\n> [ethereal](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:18#comment_1_16nkBHuqRkit6TnaEfuJiGi6UEJJ6eCzds): Я всегда немного завидовал тем, кто застал всю эту романтику.\n\nЯ сам с ностальгией вспоминаю то время. Быть на фронтире и осознавать прелесть этого — это круто :D Отчасти что-то подобное и в ZeroNet сегодня можно наблюдать. Не факт, что оно выстрелит, но что-то в той атмосфере тут есть.\n\n> Наверное, радость после сборки сего чуда была запредельная, и перед тобой открывался целый огромный мир ИТ.\n\nРадость была несколько размазанной месяцем кропотливой отладки (в отсутствии-то инструментов!). Я доходил до уровня, когда пришлось делать аппаратную плату пошаговой отладки процессора (нажал кнопку — процессор выполнил команду), а состояние шин адреса и данных, как писал в заметке, проверял светодиодом… Так что сперва выявил наличие битых модулей памяти, после чего отобрал 16кбайт рабочих (хотел делать 32кбайт) и, наконец, всё заработало :D Помню, когда на телевизоре увидел промпт «РАДИО 86РК», ломанулся на кухню, звать маму — хоть с кем-то поделиться! Это ж надо понимать, что тогда даже Интернета с социальными сетями не было. Даже телефона. Деревня, где ближайший человек, одноклассник, кого это хоть как-то могло заинтересовать, обитал в получасе ходьбы, в соседнем посёлке :)\n\nВыглядело это так. Только с поправкой на старый советский пузатый телевизор «Рекорд 340» в качестве монитора :)\n\n![radio86rk.jpg (400x232)](data/img/post_19_radio86rk.jpg)\n\n* * *\n\n> И да, кстати, как вы прошивали в ПЗУ операционную систему?\n\nГотовую 565РФ5 покупал. Как и все элементы схемы. Я тогда поступил в Москву, в МХТИ. Первый семестр осваивался, накопил со стипендии 145 руб, на втором семестре спустил их на компоненты. Но в Москве во время учёбы заниматься отладкой того, что сразу не завелось, было сложно, так что дождался лета и на каникулах после первого курса увёз комп в деревню. Там и допилил :) При чём в итоге обратно в Москву его не повёз, а, вернувшись в Москву, сразу взялся за новый, более мощный комп, Орион-128.\n\n![orion-final.jpg (760x553)](data/img/post_19_orion-final.jpg)\n\n![IMG_3543.JPG (640x480)](data/img/post_19_IMG_3543.JPG)\n\n_(фотки все не мои — если Радио-86РК, как я писал, у меня до сих пор должен быть где-то в деревне, если мама не выкинула, то Орион-128 в конце эпопеи я продал со всей инфраструктурой)_\n\nУже с графическим экраном, 128/256кбайт оперативки.\n\n![zoo__scr1.gif (771x499)](data/img/post_19_zoo__scr1.gif)\n\nИ даже CP/M с дисководом :)\n\nВот с «Орионом» я сжульничал. Там был полный ад в плане схемотехники. Если Радио-86РК был предельно простым за счёт активного использования СБИС, мелкой логики почти не было, зато всё на дорогих специализированных контроллерах, то Орион-128 был колебанием в другую сторону. Там всё, кроме процессора и параллельных портов было на мелкой логике. В результате Радио-86РК состоял из 29 микросхем, а Орион-128 из чего-то около сотни. При чём там на мелкой логике был сделан сложнейший тактовый генератор, который одной схемой обеспечивал тактовку процессора, регенерацию памяти и весь видеовывод. Он у меня не завёлся :) Я изводил метры миллиметровки, исписывая диаграммами и графиками, чтобы понять, в каком месте глючит, но огромное количество обратных связей так и не позволило разобраться с ним. Так что я почесал-почесал репу, продал эту плату на запчасти/допиливание и купил готовую :)\n\nПотом посадил всё это в крутой корпус от МС-0511 и принялся обвешивать его периферией и расширениями.\n\n![MC0511.jpg (1200x848)](data/img/post_19_MC0511.jpg)\n\nКстати, вот те клавиши, от которых я пёрся тогда и которых сильно не хватает в современных клавиатурах :) Они были очень мягкие и чувствительные. Такие же были у меня потом на всех компах до перехода на PC.\n\nПервым делом, конечно, упомянутый выше дисковод.\n\n![_1992__.__12.djvu.jpeg (658x900)](data/img/post_19__1992__.__12.djvu.jpeg)\n\nЯ с ними, кстати, так насобачился, что потом продавал эти контроллеры на Тушинском радиорынке. Очень выгодный был бизнес. Спаял контроллер за полчаса-час, сдал на реализацию (я даже сам не продавал), с вырученных денег закупил новых комплектующих, а на разницу неделю безбедно живёшь до следующих выходных :) К сожалению, рынок скоро насытился, я, наверное, и десятка их не спаял — видимо, не так много было покупателей :D\n\nПотом познакомился с CP/M, ставил специальную «Z80-card», это когда плата с Z80 втыкалась в гнездо процессора КР580ВМ80А. А раз стоит Z80, то сам Бог велел попробовать адаптировать игры от ZX-Spectrum! Архитектура видеосистемы на Спекки была совсем другая. Но, вот разница в тогдашних подходах. После того, как стало понятно, что в лоб программы под новый экран адаптировать сложно (хотя и такое делали некоторые) я задумал сделать видео-плату, совместимую со Спектрумом. Типа, подцепил такую, и спектрумовские игры будут работать на «Орионе» как на родном Спектруме. Начал прорабатывать плату и… понял, что в итоге проще и дешевле собрать готовый Спектрум. Тот же «Ленинград-2», например. Что я буквально в течении одного-двух вечеров после осознания этого факта и сделал. Рука уже была набита :D Так началась моя ZX-эпопея, закончившаяся после монстра ATM Turbo (тоже CP/M, 256 кбайт оперативки — кстати, её до сих пор развивают, там и HDD давно, и флешки :))\n\nА вот ПЗУ я в те времена сам так никогда и не прошивал. Была всегда пачка чистых, шёл к мастерам на рынок и у них шил за какую-то копеечку :) Первые свои прошивки я стал делать только в последние годы, вернувшись после пары десятков лет простоя к этой теме уже на уровне Arduino/etc :)"
		},
		{
			"post_id": 18,
			"title": "Радио-86РК. Мой первый самодельный ПК",
			"date_published": 1541078673.952,
			"body": "Аналогично предыдущей заметки [про МК-61](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:17:МК-61.+Мой+первый+программируемый+калькулятор), сохранение исходников от [перевода на английский](/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/?Post:24:Radio+86RK+—+My+first+self-welded+computer). Аналогично, сорри, за упрощённую стилистику для гуглопереводчика :)\n\n…\n\nЭто пока не полноценная статья, а короткая заметка для комментария в ZeroMe :) Может быть потом напишу подробнее. Первым компьютером, который я сделал своими руками, был Радио 86РК.\n\n![Radio86RK.jpg (1200x771)](data/img/post_18_Radio86RK.jpg)\n\nЯ начал его делать в конце 1990 года, а запустил его летом 1991 года. У меня оказались неисправны два модуля памяти, а у меня не было ни осциллографов, ни каких-то ещё инструментов… Я даже состояние шин данных и адресов определял с помощью пробника из светодиода :) Но проблему удалось обнаружить и вскоре компьютер заработал. У него было 32кбайта оперативной памяти, текстовый экран 64x25 символов и магнитофон в качестве носителя программ.\n\n---\n\n![BARMEN.RK-1.png (936x600)](data/img/post_18_BARMEN.RK-1.png)\n\n![ALIAZ1.RK-2.png (936x600)](data/img/post_18_ALIAZ1.RK-2.png)\n\nМагнитофона у меня не было, поэтому после каждого включения игры и другие программы я вводил вручную байт за байтом в 16-ричном виде :)\n\n![IMG_1048.JPG (800x598)](data/img/post_18_IMG_1048.JPG)\n\nКогда дома включался холодильник, то компьютер зависал из-за броска напряжения. Не спасали никакие батареи конденсаторов. Так что при работе холодильник приходилось выключать :D Зато с этим компьютером я впервые освоил программирование в машинных кодах. Я писал на бумажке программу на ассемблере 8080 (советский аналог — КР580ВМ80А), переводил вручную эту программу в машинные коды, расставлял адреса переходов и в таком виде вводил программу в память компьютера…\n\nХотя сейчас мой Радио 86РК ещё где-то хранится у мамы в деревне, я давно его не видел и его фотографий у меня нет. Всё, что выше — это нагуглено в Интернете. Корпус у меня был такой, как на этом фото. Только клавиатура была другая, с тугими маленькими кнопками :)\n\n![maxresdefault__1_.jpg (1280x720)](data/img/post_18_maxresdefault__1_.jpg)"
		},
		{
			"post_id": 17,
			"title": "МК-61. Мой первый программируемый калькулятор",
			"date_published": 1541077740.105,
			"body": "В свете [заметки про 30-летие программирования](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:16) я отвечал на [англоязычные комментарии](/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1540979421) и писал заметки про [МК-61 (eng)](/144W6itCd6jUqHDx5SDjbFaRdTnh4gRBBA/?Post:87:MK-61.+My+first+programmable+calculator.) и [Радио 86РК (eng)](/1ApsfuUfnyJm19qZguDzzqj7se41Ggxzrt/?Post:24:Radio+86RK+—+My+first+self-welded+computer). Чтобы оригинальные тексты не выкидывать, зафиксирую их тут :) Хотя обороты там немного упрощённые под гуглопереводчик.\n\nЛетом 1988 года мои соседи в деревне выкинули сломанный микрокалькулятор. Я его починил и начал эксперименты. Я вспомнил, как в одном из журналов читал про микрокалькуляторы самостоятельно делали какие-то многочасовые расчёты. Это меня завораживало, то, что какие-то устройства могут делать сложные вычисления без участия человека. И я сразу попытался сделать то же самое со своим калькулятором. Увы, меня ждало разочарование. У меня была простая модель, которая делала считала только четыре арифметических действия и операции с процентами. А в примерах в журнале были какие-то намного более сложные устройства. Я начал разбираться, какие для этого нужны микрокалькуляторы и погрузился в мир программирования. Что определило мою будущую судьбу :D Осенью того же 1988 года я устроился на работу школьным лаборантом и на первую же зарплату, ровно 30 лет назад, купил себе первый программируемый гаджет — микрокалькулятор МК-61 :)\n\n![mk61-5.jpg (970x728)](data/img/post_17_mk61-5.jpg)\n\n15 регистров с плавающей точкой, RPN и память команд на 102 операции. Не много? Но это был целый огромный мир. От математических трюков и сложных целочисленных расчётов до огромного числа игр, на которые я потратил сотни, а, может, тысячи часов :)\n\nИгры выглядели примерно так:\n\n* * *\n\n![fh.jpg (437x484)](data/img/post_17_fh.jpg)\n\nИгровой процесс выглядел как-то так:\n\n![kb_3_5.jpg (790x562)](data/img/post_17_kb_3_5.jpg)\n\nМоя тетрадь с программами в то время выглядела так (специально сейчас отконвертировал в PDF и выложил в свой ZeroUp).\n\n[Старая тетрадь](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1541076780-PMK.pdf) (PDF, 2Мб).\n\n**Update:** Очень большую роль в продвижении программируемых калькуляторов сыграли публикации про «Кон-Тики» в журнале «Техника-молодёжи». Это была целая фантастическая повесть про любительский перелёт с Луны на Землю на не предназначенном для этого аппарате :) Каждая история сопровождалась программой на микрокалькуляторе, с помощью которой можно было ощутить себя в шкуре героев произведения. [Тут можно почитать в PDF в ZeroNet](/1J8rt5k5QPLmAtRw5QAGmgKxi4qC7Lk166/data/users/1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw/1541076887-kon-tiki.pdf) (PDF, 10Мб).\n\nНо я учился программируемым калькуляторам по «Науке и жизни», так как «ТМ» у меня не было. Только с год спустя на одной из олимпиад познакомился с товарищем из райцентра, у которого были ВСЕ материалы из ТМ. Это было круто! Я сутками напролёт рубался в «Лунолёты» :)"
		},
		{
			"post_id": 16,
			"title": "Программирование. Начало. 30 лет спустя :)",
			"date_published": 1540966016.614,
			"body": "Сегодня [30.10.2018] сообразил, что этой осенью **ровно 30 лет** (точную дату история не сохранила), как я начал программировать :)\n\nСперва [собственный МК-61](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:17:МК-61), купленный на первую зарплату.\n\n![1507802438169320379.jpg (1200x900)](data/img/post_16_1507802438169320379.jpg)\n\nЧуть позже — БК-0010 в техникуме в райцентре, куда я раз в неделю из своей деревни ездил заниматься :)\n\n![__-0010_.jpg (1024x768)](data/img/post_16___-0010_.jpg)\n\nИ нарезка из моих ответов по этому поводу в соцсетях :)\n\n…\n\n![1392326314_pmk5.jpg (1024x683)](data/img/post_16_1392326314_pmk5.jpg)\n\nНа скрине со статьёй — это «Техника — молодёжи». Но я учился по «Науке и жизни», ТМ у меня не было.\n\n![01.jpg (254x336)](data/img/post_16_01.jpg)\n\nТолько с год спустя на одной из олимпиад познакомился с товарищем из райцентра, у которого были ВСЕ материалы из ТМ. Это было фантастикой. И в прямом и в переносном смысле :) Я сутками напролёт рубался в «Лунолёты» :)\n\n![52.jpg (764x274)](data/img/post_16_52.jpg)\n\nЯ особенно от Л-3 пёрся. Изводил уйму миллиметровки, выстраивая траектории перелёта с Луны на Землю :) Впрочем, в Л-2 (орбитальный облёт вокруг Луны) тоже много играл. Я сильно ужал его код, команд до 70 или меньше и делал на его основе разные варианты игр, типа обстрела инопланетной базы на орбитальном облёте :)\n\n…\n\nПервым толчком к компам у меня была [поездка в калининградский универ на олимпиаду](/1BFvnf2QHmMsjZ8dnfT89WfW8mVX7FrQj7/?Post:7:Бифуркация+в+сторону+компьютеров).\n\nВторым толчком была находка сломанного калькулятора. Я его починил, вспомнил, как в НиЖ читал про всякие многочасовые расчёты, начал разбираться и понял, что тут нужен совсем другой калькулятор :) А тут, как раз, на работу устроился. Ну и на первую же зарплату купил МК-61.\n\nЧуть позже в ту же осень, ко мне друг приехал из райцентра и сказал, что их на информатику стали в техникум водить, там есть компьютерный класс. И не нужно ли за меня спросить, может, меня пустят. Я сказал, «конечно», и уже через неделю-две впервые сидел за БК-0010 :)\n\n…\n\n> Я тоже с БКашки начинал, хорошо печатать научился - каждый раз заново программы набирать после включения.\n\nТаким был мой первый собственный, самопаянный Радио 86РК. Компьютер был, а магнитофона своего не было. И каждое включение холодильника комп завешивало. Никакие гроздья конденсаторов не спасли :) Приходилось выключать. И ещё соседи на своих ТВ по 4 каналу видели мой экран :)\n\n…\n\nНадо бы по всем этим ключевым моментам отдельные заметки/статьи сделать :)"
		},
		{
			"post_id": 15,
			"title": "Смотри также",
			"date_published": 1540379295.875,
			"body": "- [Россия 1990-х](/1JvjE44zqAhDiAxQFDRcfg8NLJo4z2Q9BL/) — немало моих воспоминаний о соответствующем периоде."
		},
		{
			"post_id": 14,
			"title": "Casio PV-S450 — первый КПК",
			"date_published": 1537695562.285,
			"body": "Тут, наверное, позже будет большая запись, поскольку этот КПК был моим первым гаджетом этого класса и очень запомнился :)\n\nВ то время я уже активно использовал форумы, так что первые впечатления и много последующей работы [там сохранилось](http://forums.balancer.ru/tech/forum/2002/01/t15496--casio-pv-s450-vot-kupil-sebe-kpk.html) :) Update: ага, ещё у меня на сайте [целый раздельчик](http://www.airbase.ru/computers/pv/) был.\n\nКПК был тогда серьёзным конкурентом Пальму (как платформа платформе) и жаль, что проиграл войну. Но, учитывая, как потом сложилась судьба самого Пальма, не так и страшно :D\n\n![22188913_1SZ.jpg (1000x1000)](data/img/post_14_22188913_1SZ.jpg)\n\nГлавным бонусом, возвращаясь ретроспективно, является очень высокая энергоэффективность. 160 часов работы от пары AAA батареек.\n\n* * *\n\nЭто было так круто, что я даже не перешёл на аккумуляторы. Банально не выгодно было их покупать и заряжать, когда батареек хватало на месяцы работы :)\n\nТакже выдающимся был стартап PDA-приложений. Они реально из любого положения (выключено/игры/чтение) мгновенно запускались при нажатии на тач-кнопки. Мгновенно — это значит мгновенно. Быстрее тех 200-250мс, задержку которых мы фиксируем восприятием :)\n\n![1060856.jpg (1200x900)](data/img/post_14_1060856.jpg)\n\nОчень удобной была виртуальная клавиатура. ЖКД был таким тонким, что изображение казалось нарисованным на поверхности. И был очень мягким, отзывчивым на малейшее касание. Плюс общее юзабилити клавиатуры. Как итог — очень быстрый и удобный ввод. Я тогда тексты в заметках набивал не задумываясь килобайтами. После перехода на PocketPC в плане ввода был чудовищный даунгрейд. Я очень-очень долго переживал из-за этого. По скорости ввода (но не удобству) на уровень Casio PV вышел только свайп-ввод под Android.\n\nСофт и данные все хранились в энергонезависимой памяти, так что, в отличие от Пальма, полный разряд машинки не приводил ни к каким потерям.\n\nЗвук был очень примитивный, простая пищалка. Так что не смотря на продвинутый 80186 процессор, игры были только очень простые, всякие головоломки и т.п.\n\nГлавным применением гаджета было чтение книг. Жаль, что флеш там был только на 4Мб, но в виде архива это позволяло затащить туда до десятка книжек.\n\n![IMG_3037-1280.jpg (695x900)](data/img/post_14_IMG_3037-1280.jpg)\n\nИменно тогда я начал много и активно читать на ходу. Бумажные книги были неудобны для повсеместного ношения, а тут — книга всегда под рукой, где бы ты ни был. Это было круто! :) Минус был только один — при плохом освещении нужно было включать подсветку. Она была там очень классная, на высоковольтной люминесценции, но жрала батарейки как не в себя — время работы падало почти в 10 раз, до 17 часов. Так что при плохом освещении чтения я избегал :)\n\nНа фото выше, кстати, шрифт выставлен крупный. Я читал, ЕМНИП, в режиме 17 строк по ~24-26 символов :)"
		},
		{
			"post_id": 13,
			"title": "Первый Linux",
			"date_published": 872789774,
			"body": "> С какого дистрибутива началось ваше знакомство с Linux?\n\n1997 год. Интернета у меня ещё нет, но есть самодельная локальная сеть в общежитии на два корпуса и полтора десятка компьютеров. И FIDO по ночам. В локалке активно играем в Team Fortress. Под это дело даже смогли выделить отдельный сервер — старенькую 486DX2-66\\. Под Windows 95\\. И этот сервер начинал тормозить, когда в игре оказывалось более 6 игроков. Кто-то где-то слышал, что под Linux сервер тянет игроков больше. Возникает вопрос, что делать. Какой брать дистрибутив, где брать... Как ни удивительно, но на Митинском радиорынке ничего подходящего не нахожу. Коллективный разум в FIDO советует, что брать дистрибутив надо такой, какой стоит у ближайшего Linux-гуру. Ближайший Linux-гуру тут же, в FIDO, знаменитый когда-то Женя Двуречинский. Еду к нему в Гласнет (ага, «[поп, глаз нет](https://lleo.me/arhive/humor/serafim.htm)» ©) и получаю пару свежих, только что перекаченных в Москву диска с новеньким Red Hat 5.8 (или 5.6? Уже не помню точно).\n\n![x95options.png (640x480)](data/img/post_13_x95options.png)\n\n_(скриншот взят с [https://linuxgazette.net/165/laycock.html](https://linuxgazette.net/165/laycock.html))_\n\nПриезжаю домой, вычищаю жёсткий диск, устанавливаю без проблем. Хотя долго потом вспоминал особенности локализации, когда «finish» перевели как «финский» и такой кнопкой заканчивались все диалоговые окна :) Система установлена, грузится, я в консоли. И встаёт вопрос «что дальше?». Linux я ещё никогда в глаза не видел, Интернета нет, книг нет, сеанс в FIDO только ночью... Когда-то в начале 1990-х кто-то мне говорил, что в UNIX вместо «нормальной» `dir` используется команда `ls`. Это уже даёт пищу для размышления. `cd` работает как ожидается. Можно начать хоть как-то изучать систему. Но это мало. Ничего не понятно. Пробую команды из DOS, но все почти работает не так как надо. Например, `type` не выводит на экран содержимое файлов. По наитию набираю `set`, вижу ожидаемый выхлоп переменных окружения и глаз там успевает зацепиться за буквы `mc`. Недавно где-то краем уха слышал, что «_нортон под Linux называется m...какой-то коммандер_». Жму `mc` и вижу спасение в виде двух синих панелек :) С их помощью быстро нахожу `/usr/share/doc` и дальше всё как по маслу. Назавтра мы уже бегали по сети под Linux-сервером. И, действительно, он не тормозил, даже когда в игре было до 12 человек! :)\n\nТак начался мой путь в мир Linux...\n\n_— 18.08.2017\n— Записано в ZN: Aug 28, 2018 21:36:14_"
		},
		{
			"post_id": 12,
			"title": "Электроплитки и пожарная безопасность",
			"date_published": 740160000,
			"body": "Дело было в 1993-м, кажется, году. Уезжая на лето по домам из общежития комнату тогда требовалось сдавать. Вещи личные обычно оставляли в камере хранения общежития (просто отдельная выделенная складская комната), но многие оставляли их по друзьям, которые лето проводили в общаге. И был среди нас знакомый К с ИХТ-факультета. Он уезжал, а я оставался. Товарищ сбагрил мне среди прочего хлама отличную электроплитку. Дело в том, что у меня была типичная такая советская закрытая электроплитка, ватт на 600, которая едва грела. Чайник кипятила, наверное, полчаса. Жарить на ней было — мучение. Выглядела она примерно так:\n\n![294722214_2_1000x700_elektroplitka-sssr-zarya-novaya-fotografii.jpg (933x700)](data/img/post_12_294722214_2_1000x700_elektroplitka-sssr-zarya-novaya-fotografii.jpg)\n\nУ товарища же был прекрасный экземпляр со спиралью (хоть и закрытой тоже) в виде трубчатого элемента, которая сильно раскалялась и на которой всё закипало просто мгновенно:\n\n* * *\n\n![1_9_33807867.jpg (1920x1080)](data/img/post_12_1_9_33807867.jpg)\n\nВ первый же день после его отъезда, я решил эту плитку испытать в вопросе зажаривания куриной ноги.\n\nЗадумано - сделано. Плитка включена, на плитку — сковородку, туда масло, кинута куриная ножка... Обнаружилось отсутствие соли. Я пошёл за солью на этаж вверх к Стасу, который тоже оставался на лето. Взял соль, возвращаюсь…\n\nЧувствую ещё на подходе к моему коридору вонь горелого жира. В самом коридоре - заметный дым. Открываю дверь — там гарь столбом... Картина маслом!\n\nНа полу стоит плитка, с раскалённым до ярко-жёлтого каления нагревательным элементом. На ней шипит сковорода. С периодичностью секунд в 5 крышка сковороды подкидывается вскипевшим маслом, вырывается огромный клуб масляного пара, который тут же взрывается при контакте с раскалённой плиткой. Крышка падает, цикл повторяется. ШшШшшШшшШшш-ПУХ!-шшШшшШшшШшш-ПУХ!...\n\nКурица оказалась с одного бока обугленная до состояния угля, а с другого - сырая. Нищему студенту в 1990-е не престало привередничать, так что несколько волокон съедобного мяса я оттуда выковырнул, но больше этой плиткой с целью жарки не пользовался :D И, да, вопреки фотографии, та плитка — не регулировалась по степени нагрева :)\n\n*May 29, 2018 03:00:42*"
		},
		{
			"post_id": 11,
			"title": "Сегодня мне 25!",
			"date_published": 909065942,
			"body": "На дворе 22 октября 1998 года.\n\n![____________.jpg (1200x801)](data/img/post_11_____________.jpg)\n\nДень рождения. Мне исполнилось 25 лет :) Типичное для тех времён проведение мероприятия и типичный стол. Приготовлением блюд, в том числе рубанием салата, занимался сам :D"
		},
		{
			"post_id": 10,
			"title": "Нейросетевая адаптивность",
			"date_published": 707060206,
			"body": "_Вот эту историю точно пару раз где-то расписывал, но сейчас всё перерыл — не нашёл :-/ Одна из вещей, зачем нужен этот блог :)_\n\nЧем позже что-то вспоминаешь, тем выше вероятность ошибиться с датами. Но было это дело на «Поиске» (советском аналоге PC XT), а его родители Стасу купили то ли в конце второго, то ли начале третьего курса. Значит, где-то 1991—1992гг.\n\nОпуская воду — повадился у нас в общаге люд играть у Стаса на компе. Играть много, плотно, сменяя друг друга круглые сутки. А Стасу и поучиться иногда надо, и поиграть тоже хочется. А человек он мягкий, просто выгнать и запереть дверь не может. Он даже как-то периодами мне комп отдавал (мы в разных комнатах жили), когда надо было навёрстывать упущенное в обучении. К нему тогда никто не ломится. А я все выгоню, скажу, «мне самому надо» и давай программировать или играть :)\n\nСловом, мучился он мучился и кому-то из нас в голову пришла светлая мысль.\n\n* * *\n\nЯ написал небольшой резидент, который проверяет статус NumLock. Если он включен (а его такой статус был в BIOS нами по дефолту прописан), то через несколько случайных минут комп зависает. Выключен — ничего не делается. То есть пока сам сидишь, во время загрузки компа NumLock выключаешь и работаешь спокойно. А кто не знает, тот этот момент упускает и комп скоро виснет. Так позависает народ в играх, позависает, да удручённо и уйдёт восвояси. А комп — свободен.\n\nНо вскоре (и недели не прошло) как-то сидит у Стаса и сидит часами, то ли Серёга П., то ли Андреич… Играет целый день, хоть бы что. Мы в недоумении, может, резидент заглючил, или ещё чего — при нём же не проверишь :) К вечеру приходит ещё народ играть. Кто-то начинает комп перезагружать, а тот, целый день игравший, ещё и поясняет — _«стой, надо NumLock выключить! А то комп почему-то с ним постоянно виснет!»._ Приплыли :) Пытливый разум обнаружил эмпирически условие работоспособности компа :D\n\n![soviet_pk_3_16_b.jpg (742x1000)](data/img/post_10_soviet_pk_3_16_b.jpg)\n\nВот так наш «Поиск» почти выглядел. И монитор такой же, из цветного ТВ, и блоки расширения. Только что дисковод был сдвоенный и ещё HDD на 20Мбайт был :)\n\n_28.05.2018_"
		},
		{
			"post_id": 9,
			"title": "Первый домашний Wi-Fi",
			"date_published": 1208801387,
			"body": "Взял сегодня роутер WL-500gP v2\\. Asus превратился в области роутеров в полное г. С прошивкой по умолчанию элементарно невозможно ввести параметры PPTP, выдаёт ошибку там, где её быть не может. Т.е. налицо продажа машинки с багованной фирмварей. Перепрошил на прошивку Олега с [http://oleg.wl500g.info/](http://oleg.wl500g.info/) - всё завелось, Корбина подцепилась сразу.\n\nДругое дело, что пока система недоступна снаружи (Firefall выключен, порты переброшены - фиг там) и КПК по Wi-Fi никак не хочет цепляться :)\n\nUpdate: Ага, всё, Wi-Fi добил. Пишу с КПК для теста. Кстати, Опера 9.50 для КПК - это просто бомба. Такого удобства браузерного на КПК я ещё не видел. Вот только батарейку Wi-Fi кушает не по-детски: 100+мА против 5мА у того же Синезуба...\n\n_(Это был мой первый домашний Wi-Fi, via [FBR](http://www.balancer.ru/g/p1505781))_"
		},
		{
			"post_id": 8,
			"title": "Мой распорядок дня...",
			"date_published": 884618934,
			"body": "```\n\nВ виду того, что часто меня ищут днём,\nдля тех кто в танке, в письменном виде\nудостоверяю:\n\nВ 10:00 я ухожу на работу и взвращаюсь в\n\n18:30 - 19:00.\n\nОбычно в 20:00-21:00 я ложусь спать до\n\n00:00-01:00, и в 4:00-5:00 до 7:00-9:00.\n\nТак что поймать меня наиболее реально в\n\n19:00-20:00\n\n01:00-03:00\n\n08:00-10:00\n\n===============================================\n\nP.S. Блин, что за жизнь ... Ни минуты покоя\n\n...\n\n```\n\n*(из архивов X-Net)*"
		},
		{
			"post_id": 7,
			"title": "Бифуркация в сторону компьютеров",
			"date_published": 548965364,
			"body": "Предположительно, это был 1987-й. И, предположительно, это была поездка на областную олимпиаду, скорее всего — по химии. Как это было принято на советских олимпиадах, нас таскали по разнообразным экскурсиям. В том числе и по разным кафедрам Калининградского университета (КГУ). Водили и на кафедру физики. Показывали лазеры, голограммы... Эффектно. Но больше всего меня поразила демонстрация компьютера. Нет, не тупого терминала. А открытой стойки, увешанной проводами. У основания стойки нечто само по себе крутилось и двигалось, занимаясь какой-то работой в себе. Годы спустя вспоминая, я пришёл к выводу, что это был открытый, без корпуса, 8\" дисковод. Но тогда эта целеустремлённая самостоятельная работа устройства без видимого участия человека меня поразила до глубины души. И я начал знакомиться со всем, что касалось компьютеров :D Так была пройдена очередная точка бифуркации... Шаг влево, шаг-вправо — и история могла бы пойти совсем другим путём.\n\n![sm1420-1.jpg (1404x1091)](data/img/post_7_sm1420-1.jpg)\n\n_25.05.2018_"
		},
		{
			"post_id": 6,
			"title": "Знакомство с HTML",
			"date_published": 788950800,
			"body": "Дело было, вероятно, в 1995 году. То ли с компьютерной выставки, то ли ещё откуда-то у меня образовался компакт-диск с какой-то фигнёй. Фигня там была совершенно неинтересная и потому в памяти не отложилась. Но зато документация к этой фигне была в совершенно новом для меня формате - `.htm`. А для просмотра её прилагался какой-то совсем непонятный вьювер — «NCSA Mosaic».\n\n![NCSAMosaic.jpg (600x627)](data/img/post_6_NCSAMosaic.jpg)\n\nМне тогда были очень интересны новые форматы данных, поэтому, естественно, я сразу полез смотреть в эти незнакомые `.htm`. И я был просто поражён и очарован таким изящным решением. Взять простой текст и разметить его специальными метками, открывающими и закрывающими своё действие (слова «теги» я тогда не знал). Я сходу, конечно, вычислил работу тегов `<b>...<b>` или `<i>..</i>`, нашёл заголовки, понял, как работают ссылки и картинки. Начал составлять такие документы сам. Разметки найденной в документах мало, Интернета ещё не было, литературы по HTML — тоже :) Я разбирал двоичный код Mosaic для поиска в нём тегов. Нашёл `<tt>...</tt>`, `<code>`, `<pre>` и прочее. Что-то понял, что-то не понял... Но моя жизнь изменилась уже навсегда :D Когда через год у нас появилась локальная сеть, я уже начал делать первые сайты (интересно, когда руки дойдут выложить остатки сайта X-Net для истории?), а ещё через год, когда появился Интернет, выложил туда [свой первый сайт](http://www.airbase.ru/misc/first-step/), продолжение которого в виде Авиабазы живёт до сих пор. Ага, уже больше 20 лет на момент написания этой записи :D"
		},
		{
			"post_id": 5,
			"title": "Первое цифровое фото",
			"date_published": 799372800,
			"body": "В середине 1990-х в стране стали набирать популярность международные компьютерные выставки. Интернета тогда не было, журналы всё интересное не охватывали и сходить на такую выставку было зачастую единственным способом узнать что-то новое в IT. Ну и, конечно, посмотреть/пощупать чудеса враждебной техники :D\n\nПервый раз мы с друзьями пошли таким образом на [Комтек-95](/18i1Ra9wePfmwhMCyhmLXXShxcSha5YAns/?Post:9:Завершилась+выставка+Comtek-95). Это было офигенно. Мы тогда только ползали на 386-х, а тут были 486DX2-66 массово и первые Pentium, телевизионные платы в ПК, OS/2 Warp… И, фантастика, цифровые фотокамеры, с которых тут же можно было распечатать и заламинировать фото :) Так появилась моя первая цифровая фотка :D\n\n![20110804-1147-img_0391.jpg (1200x801)](data/img/post_5_20110804-1147-img_0391.jpg)\n\nПрогресс в IT тогда был фантастический. В мае мы облизывались и кусали локти на 486DX2-66 как на что-то очень крутое. А осенью того же года у меня в общаге уже был DX4-120 :) В 1995-м на Комтеке большинство компов не имели сетевых соединений, а в 1996-м у нас уже была локальная сеть в общаге."
		},
		{
			"post_id": 4,
			"title": "«Лабиринт отражений» и жизнь",
			"date_published": 926051846,
			"body": "Что-то из моих фидошных записей попадало в юмор :) Типа, вот:\n\n[http://www.kulichki.com/news/Miscellanous/m044.html](http://www.kulichki.com/news/Miscellanous/m044.html)\n\n```\nFrom kron.ru@usa.net Fri May 7 07:37:26 1999 \nFrom: \"Roman =KRoN= Karshiev\" \nNewsgroups: fido7.su.sf-f.fandom \nSubject: ЛО и жизнь... \nDate: 5 May 1999 12:06:52 +0400 \n\nc:\\>deep.exe \n\nОткрываю сейчас банку с килькой в томате, а там - одни головы... :-[ ] \n\n...Глубина-глубина, я не твой... \nkron.ru@usa.net \nhttp://avia.da.ru \n​​​​​​​```\n\nИнтересно, что тогда, в мае 1999-го я в ФИДО писал уже не со своего поинта, а через Интернет."
		},
		{
			"post_id": 3,
			"title": "О доступности первых ПК в конце СССР и начале РФ. Speccy, БК-0010 и компания",
			"date_published": 662688000,
			"body": "_Писалось для [http://4pda.ru/2017/04/30/341146/#comment3800916](http://4pda.ru/2017/04/30/341146/#comment3800916)_\n\nСпекки был очень доступен. Я сам паял и продавал их около 1991..1992 годах по цене где-то в четверть средней месячной зарплаты. И даже в «дорогие» времена конца 1980гг. он стоил рублей 150\\. Меньше месячной средней зарплаты и раза в 4 дешевле, чем БК-0010\\. На сегодняшние деньги это что-то около 22..25 тыс. рублей.\n\nБК-0010 стоил 550 рублей до конца 1980-х, а в конце 1980-х (точно год не помню) подорожал до 650 рублей. Вот это была серьёзная цена. Мы с другом только на 1-м курсе в 1990-м вскладчину смогли взять б/у БК-шку. 720 р за БК+магнитофон+монитор.\n\n![У нас с товарщем Stas.Esq была именно такая комбинация клавишной версии БК-шки и монитора «колокольчик»](data/img/post_3_BK0010.jpg)​​​​​​​\n\n> да дофига, а зачем монитор? на телеке хуже картинка была?\n\nА мы в общагу брали, ТВ не дешевле бы вышел :) А тут — целый комплект. Потом этот монитор (мы с товарищем позже поделились, мне монитор и магнитофон, ему — БКшка) мне ещё много где служил, и Орион-128 с ним работал, и АТМ-Турбо. С последней его где-то в 1993-м и продал, перейдя уже окончательно на 386 :)\n\n![Именно такой магнитофон был у меня носителем программ дольше всего](data/img/post_3_magnitofon_kassetnyj_elektronika_302_1_sssr_1989_g.jpg)​​​​​​​\n\nС 1980-го по 1989-й средняя зарплата в СССР выросла с ~120 до ~190 рублей..\n\n* * *\n\nЯ в 1988-м получал порядка 120 будучи сельским школьником :) ~92 или 98, уже не помню, минималка за лаборанта + 10р за ведение кинокружка + 20 р. за ведение информатики (насчитывали на старушку-математичку, а вёл я — мне деньги, ей — стаж).\n\nДа я сам помню, как мелким пацаном, глядя в список вакансий в районной газете «Знамя Ильича» считал приличными зарплаты, начиная где-то от 300-400 руб :) Мама, учителем, в это время где-то 170 получала и это было реально не много :) И даже когда стал получать свою зарплату, то считал её семейной..\n\nОторвался только когда уехал учиться в Москву. Стипендия была 55 рублей (35 сама стипендия + 20 за военную кафедру) и я с первого же семестра накопил 145 рублей денег, которые и потратил на свой первый Радио-86РК :) Переплатил страшно, покупая детали в государственных магазинах. ВГ72 за 22.5 рубля. Две линейки РУ6 по 2x50 рублей — вот уже и львиная доля денег. Год спустя открыл для себя Тушинский радиорынок, так там цены были в 10 раз ниже. Кусал локти :D\n\nХотя, нет, не в 10\\. Но раза в 3-4 — точно :)\n\nКР580ВМ80А в магазине стоил около 13 руб. А на радиорынке 5 рублей новый и 3 рубля со слегка помятыми ногами :).\n\nВот сколько стоила линейка РУ6 на рынке — уже не помню...\n\nСильно зависело от конкретного времени. Где-нибудь в 1986 купить было почти нереально, в 1988 они стали появляться, в 1990 их стало много и по совершенно доступным ценам, а к 1992 наступило затоваривание, и производить стали очень много и популярность начала падать, так что многие их стали продавать... Я выше писал, что к этому времени продавал их по цене что-то около четверти средней зарплаты. Цена деталей + сколько то процентов за работу, не помню уже свой навар, но шиковать не выходило уже — конкуренция... :)\n\nИнтересно, что этого класса гаджетов сегодня в принципе больше нет. Чтобы нажать кнопку питания и через пару секунд писать сразу код прикладной программы :)"
		},
		{
			"post_id": 2,
			"title": "Как =KRoN= и GAW МК-85 ломали",
			"date_published": 694224000,
			"body": "Как только мы обзавелись калькуляторами МК-85 (вот, [тут у меня тема на форуме](http://forums.balancer.ru/tech/forum/2011/01/t80156--mk-85.html)), сразу захотели влезть в его машинные потроха, чтобы вылезти за пределы ограничений Бейсика.\n\n[![](https://gateway.ipfs.io/ipfs/Qmf15WncNn77UTpHmLC25xqhpHjtGEzd3uJfwBiNtbEM9k/filevEOysl-800x.jpg)](https://gateway.ipfs.io/ipfs/QmWSHEYfuM8Bg9rEhpSHkN9sgL9YvkVsExcmGKREu8f1Lk/filevEOysl.jpg)\n\nУ меня тогда очень рука была набита всякой ЕГГОГ-ологией на МК-61, так что я через (вероятно) несколько месяцев случайно наткнулся на уязвимость в работе оператора `INPUT` и смог забраться в память. И даже вытащить почти всю прошивку в HEX-виде.\n\nДальше стояла задача расколоть систему команд процессора.\n\n* * *\n\nТут нужно отметить, что во времена СССР почти вся специальная вычислительная техника имела собственные процессоры со своей системой команд. А часто и совершенно невообразимой архитектурой. Так что я был готов пойти по стопам [Шампольона](https://ru.wikipedia.org/wiki/Шампольон,_Жан-Франсуа) и попытаться расколоть систему команд неизвестного мне процессора по готовому коду в ПЗУ.\n\nДолго ли, коротко ли… не помню, сколько я с ним провозился. Вычислил переходы, вызовы подпрограмм, ещё что-то. И понял, что объём работы, на самом деле огромный. Так что даже особо и не напрягался, тем более, что у моего МК-85 и без того задач было очень много.\n\nЗадачей анализа системы команд процессора занимался и мой товарищ, GAW. Но он отнёсся к вопросу как-то прохладнее и мы работали каждый сам по себе. И вот однажды, он появляется (кажется, это было после каких-то очередных каникул или праздников и он уезжал на них домой в Тверь) и огорошивает меня тем, что знает систему команд процессора МК-85 o_O Он пошёл другим путём. Простым и очевидным, с которого меня сбил зоопарк советских микропроцессоров. Он просто пересмотрел все известные ему системы команд. Начал с x86, кажется, а со второй попытки, опаньки, внезапно убедился, что МК-85 работает на архитектуре DEC :) Самое смешное, что я тогда систему команд DEC знал наизусть. Но, как и все люди, в восьмеричном виде. А дампы ПЗУ МК-85 анализировал в шестнадцатеричном :) Стоило бы мне хоть один кусочек кода расписать в восьмеричном виде, как система команд была бы мгновенно опознана.\n\nНо всё хорошо, что хорошо кончается :) А вот дальше GAW совершил настоящий подвиг, который меня восхищает до сих пор. Он **вручную дизассемблировал 16 кбайт ПЗУ** МК-85 и записал это дело в тетрадку. Ручкой. В ТЕТРАДКУ! Это офигенный объём работы :) Мои представления о человеческих возможностях тогда были основательно пересмотрены. Я бы не осилил, наверное. Когда-то я вручную дизассемблировал 2 кбайта ПЗУ «Радио 86РК», и это мне казалось реально крутым :)\n\nВот этот эпохальный труд в формате DjVu:\n\n[http://balancer.ru/computers/mk/mk-85/files/MK-85_BIOS_GAW.djvu](http://balancer.ru/computers/mk/mk-85/files/MK-85_BIOS_GAW.djvu)\n\n(позже переложу в ZeroNet)\n\nПотом он написал простейший монитор, который позволял вводить в память МК-85 свои программы и МК-85 был подчинён полностью :) Надо заметить, что мы тогда могли запускать программу на Бейсике как кусок машинного кода. Но была тонкость — программа должна была выглядеть как вводимая Бейсик-программа. А ввести можно было не все символы. Поэтому задача усложнялась требованием написания программы-монитора так, чтобы она состояла только из символов, которые можно было ввести штатными средствами. Но GAW эту задачу решил.\n\nА потом весь наш задел так и оказался не востребованным. Дело было, вероятно, в 1992 году (надо бы попробовать уточнить) и наши интересы уже переключались на персональные компьютеры :)\n\n## Ссылки\n\n*   [Топик ZeroTalk «Ветераны компьютерной техники»](/1BpFtPez7mSiShtXfb4wPfMT1dZTuRybfZ/?Topic:1525338963_1Q3H2Xz99MAWiuPV5pj6QbmCCU6KdZaKTv#comment_187_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw), для которого писалась эта запись, да и вообще появилась идея блога.\n*   [Тема форума МК-85](http://forums.balancer.ru/tech/forum/2011/01/t80156--mk-85.html), сравнение с западными ровесниками и т.п.\n*   [Воспоминание на форуме Balancer.Ru](http://www.balancer.ru/g/p2342186) (14.01.2011)\n*   [Воспоминание на форуме Balancer.Ru](http://www.balancer.ru/g/p956243) (09.11.2006)\n*   [Воспоминание на форуме Balancer.Ru](http://www.balancer.ru/g/p177223) (11.05.2001)\n*   [Древняя страница сайта](http://www.balancer.ru/computers/mk/mk-85/)"
		},
		{
			"post_id": 1,
			"title": "Hit the road Jack!",
			"date_published": 1433033779.604,
			"body": "Давно была мысль как-то централизованно и в одном месте записывать всякие истории и воспоминания. Годы идут и многое уже забывается, какие-то события путаются в датах. Частично на своих форумах писал под тегом «мемуары». И эти записи, порой, здорово помогают вспомнить детали. Но это не так удобно. Да и грозит потеряться когда-то, если форумы не смогу/не захочу поддерживать больше :) А вот ZeroNet тут — это прекрасный инструмент. Надо, конечно, будет допилить ZeroBlog до варианта с тегами, чтобы можно было фильтровать по темам, но пока итак сойдёт.\n\nОдно только смущает — порядок записей. Было бы интересно вести их в хронологическом порядке. Тем более, что ZeroBlog позволяет осуществлять записи задним числом. Но тогда новые воспоминания будут теряться в глубине старых. Может, попробовать вешать сперва под датой написания, а потом, через какое-то время «опускать их в прошлое»?\n\nНу, поэкспериментирую :)\n\n## TODO\n\n- [ ] Разобрать тему http://forums.balancer.ru/community/2014/03/t26375--memuary.html"
		}
	]
}