{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1_13aWDscP5H1StNteAMmAFfvE1DGdrstCwC": [
			{
				"comment_id": 1,
				"body": "Я сам точно не знаю, но мне кажется, что на смену опытным работникам нашей реальности пришли персоны, которые обучались по некому подобию Ютуба от очень \"профессиональных\" учителей-самоучек, которые тоже обучались по \"Утубу\". И ходят пара-тройка персон, которые говорят \"Ну чего же вы творите! Ну было всё нормально нафига полезли исправлять?!  Вот это сюда... А это к этому! \". А им отвечают: \"А-ну, пошли отсюда, вон нас как много, мы-то лучше знаем\". А люди в в своей реальности с ума сходят....\n\nУ меня голова недавно \"клина словила\". Ходил по комнате туда-сюда, а потом такой думаю \"Пойду-ка я пешком в другой город!\". И так клинануло, иду по дороге в другой город, смотрю на небо, а там слева синие облака, а справа - красные. И мне тогда почему-то вспомнилось, как цвета России - снизу красные, а чуть выше - синие.  Пригляделся в облака - а они как головы с лицами! Красные напряженно смотрят на синих, а синие на красных. \n\nКогда я шел по правой стороне - красных \"становилось\" больше. И тут меня как мысленно проглючело, что я влияю на ситуацию в \"стране\". И перешел на левую сторону - синие стали восстанавливаться! Да так, что красных становилось очень мало. \n\nНу и как ты думаешь, читатель, какое мое гениальное решение было в данной ситуации? Ну-да, \"правильно\" - пошел по середине дороги! По середине дороги, Карл! Это еще не всё..\n\nОблака кроче рассеялись. И стали голубыми - почти - белыми. Ну я такой думаю: \"Вот я молочага! Ситуацию-то как разрулил!\". Обратно возвращаться уже не хочется, да и странная какая-то местность. Явно когда на машине или автобусе ездил - не так было. Пошел дальше.\n\nИду, такой, иду... И понимаю, что дорога ведет всё время налево. Иду ну минут 20-30. И понимаю, что не помниться мне, чтобы такая дорога была, уже отчетливо! Остановился. Думаю, если под таким углом заворот дороги, то я просто иду по кругу. Слышали, наверно, многие, есть такое выражение \"мы ходим кругами\". ХЗ, может это после таких вот внезапных путешествий?.\n\nДай, думаю, посмотрю в лес. Птички летают... Смотрю в глубь леса, а там какая-то неведомая зверушка, лучше наверно даже зверь или даже тварь! Сидит неподвижно и только рот открывает. По цвету похожа на моржа-ждуна. И мне не страшно, думаю, как так приглючело так. Пригледелся получше, а это... по-прежнему какая-то тварь которая силит и рот открывает. Ну я думаю - в лес не надо идти...\n\nИду дальше. Вероятно мне надо менять свой образ жизни: не за компом с утра до вечера сидеть работать, а потом прийти домой и снова за комп залипнуть. Пришло в голову, что надо больше в лес ходить, типа грибы собирать или ягоды, ай да и на рыбалке тоже круто. И как только подумал: хуякс! и дорога \"разруливает\" меня на прямую. Типа вот оно решение! \"Ну круто-то как\" подумал я.  Посмотрел назад - из ниоткуда образовалась остановка! Поворачиваю голову обратно вперед - передо мной знак пешеходного перехода и зебра расчерчена - типа давай на остановку вставай, и езжай обратно. А я думаю: Во-первых я кошелек тупо с собой не взял, во-вторых \"Какой нафиг автобус?!?! \". Пошел дальше.\n\nКстати из машин по дороге ездили только уазики, нивы и такси! Не останавливались, да и я не \"голосовал\".\n\nЗатем показалась красная сова по обе стороны дороги на небе. Тут чот мне страшно стало, но я дальше.... Потом вторая сова, затем третья! Я не отступаю... Совы \"рассосались\". За ними закат, да и такой, как будто вулкан \"разлился\" и вся картина издалека напоминает лицо японки. А я настырный. Иду дальше. Не обратно же возвращаться к совам мля ). А японка симпотичная;) всяко приятней на небе японку видеть, чем сову страуебищную! Иду - японка рассосалась. \n\nЗатем на небе из белых облаком прглючивается лицо человека, но вот только похож как чертей рисуют, вот такое же лицо. И другие лица на него смотрят - тоже белые. облака стали похожи на дым и дорога так за угол заворачивает - в сторону пекла. Я поумал, что типа черти меня слопать захотели - я дальше...\n\nПотом все рассосались. Я пришел до другого города, но не до того куда планировал. Какие-то парни встретились, грят куда идешь? Я \"туда-то туда-то\". Ты, грят, чего? Пешком собрался? - Ага!\nЧот поговорили, я говорю, я пошел дальше, а то вы мне чот зубы заговариваете. Да и они какие-то быдловатые, хотя не злые.\n\nИду дальше, а там воротины стоят с надписью \"Если едешь дальше, то иди - обратно дороги нет\". Щас точно формулировку не вспомню... Ну вот что то вообще стремно стало, ведь и идти то не особо и хотелось... И что там впереди?!?! Путеводителя-то нет для почему-то решивших куда-то пойти в другой город o_O.\n\nПостоял, подумал - Я же еще в этом мире не всё сделал - Куда собрался-то? \n\nИ пошел обратно...\n\nTo be contined...",
				"added": 1534353060
			}
		]
	},
	"comment_vote": {}
}