{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1606080511,
			"title": "90% of people on ZeroNet are crazy racists & conspiracy theorists that should be monitored",
			"body": "Seriously.\nI'm also willing to be a number of you are pedos too.\nThe only thing I see on here from day to day are posts about conspiracies and suspicious posts that look like answer requests from human traffickers.\nI'm not very pro-Government because I think they could do a better job in relation to organization and justice but don't due to too much respect for tradition and because they care more about power than justice... BUT I'm glad that there's a 100% chance they're monitoring ZeroNet, FreeNet, LokiNet, TheOnionRouter Network etc.\nMost of you post racist and paranoid propaganda, and it the same crap parroted by idiots that horde weapons while talking about revolution.\nYou want a revolution? Learn about logical fallacies. Learn about respecting minorities.\nLearn about justice FOR OTHERS, you paranoid selfish schmucks.\nAnd for the Government agents watching, regardless of what you think of me, thank you anyway.\nPS: There's no such thing as security or secrets, and in a world without privacy, there's only honesty and accountability.",
			"added": 1606080510
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1593986698_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 1,
				"body": "But there is difference between hate speech and the following:\nharassment\nslander\nthreatening behavior\nfraud\nobstruction\netc.\nThe problem is that hate speech is often tied to these concepts as well, and really, really stupid people often do the latter rather than the former, and cry about how their rights to violate other's rights have been violated.",
				"added": 1595121755
			}
		],
		"1599735028_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "Good. The world doesn't need hate or secrets. Out with the snakes I say.",
				"added": 1600656981
			},
			{
				"comment_id": 7,
				"body": "Look at all these unwise man-children whine and cry about their dystopian fantasies. You are never going to be jailed for having a simple negative opinion about politicians. If you stockpile weapons while talking about coups while going on crazy rants, then yeah, any rational government may take a look at you. If you act like a crackpot, talk like a crackpot, and try to get attention like a crackpot, don't be surprised when they lock you up for being a crackpot. Crackpots are the one's that shoot up places while screaming about conspiracies. Calm down.",
				"added": 1601072596
			},
			{
				"comment_id": 9,
				"body": "So people on here claim there is somehow Black supremacy in a nation that is 98% White, has a history of slavery and segregation until very recently?\nSeriously?\nYou do realize there are people alive today that lived with Institutional Segregation, right?\nAt what point does asking for equality become \"supremacy\"?\nWhat area are Blacks controlling the lives of Whites in America?\nWhat? In language and behavior because White's aren't allowed to harass and obstruct Blacks anymore?\nThat's equality not supremacy.\nAnd the fact the phrase \"Black Lives Matter\" offends you and you equate it with terrorism? It speaks volumes of your actual intentions and motivations.\nSaying \"racism ended because legal segregation ended\" is completely irrational.\nAnd \"decades ago\" isn't long ago.\nAnd the hatred for Israel? \nI wonder who it is in Israel that you have a problem with?\nWow. Keep showing your racism motivations.",
				"added": 1606079989
			}
		],
		"1599753836_1K58h2FWDHY6khgbecX1UqFXh2vgGkMKXq": [
			{
				"comment_id": 3,
				"body": "Who the hell is dumb enough to click on links in the comment sections off ZeroTalk?",
				"added": 1600657046
			}
		],
		"1599713077_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 4,
				"body": "Gia is a dumb anti-science site used to peddle bullshit to dumb people that should know better.",
				"added": 1600657386
			}
		],
		"1599583363_1HWmMKD3nNGY9bRJq5yZ8sRVcvPbtgzbRw": [
			{
				"comment_id": 5,
				"body": "The only time I have heard of this sort of thing is when Indian scammers claim the Government is going to arrest them unless you pay them, and then they say something else suspicious like \"oh we take itunes gift cards\".\nYes, such a stupid scam exists. Google it.",
				"added": 1600657496
			}
		],
		"1598301398_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 6,
				"body": "How is it that people still don't grasp what a quarantine is?\nAre there still stupid people out there that don't know how viruses work?\nPeople do understand that in order to stop the spread of a virus you have to limit contact.\nYou're all a bunch of Typhoid Marys.",
				"added": 1600659470
			}
		],
		"1601060514_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 8,
				"body": "There is no such thing as the illuminati you jackass.\nOriginally it was a Bavarian society that promoted critical thinking and science that planned on infiltrating other fraternal orders with the intent of pushing them from nonsensical beliefs in the supernatural to reason and logic per the Age of Enlightenment, hence the name which means enlightened ones.\nIt was outlawed in late in late 1700s because Bavaria banned all private fraternal organizations, most because of the crap private fraternal organizations were trying to pull with manipulating elections.\nIt only got a bad rap because George Washington, the only religious extremist among the founding fathers (Google \"Ascension of George Washing\"), had a panic attack about atheism coming to America, and he wrote a shitty letter about the prospects of the Illuminati being among the ranks of his organization, the Freemasons.\nThe only possible Illuminati member would have been Benjamin Franklin, but he wasn't an atheist, he was a Deist, and thought the Universe or Mathematics was \"God in Expression\".\n-\nBlack Lives Matter is an organization that seeks to draw attention to racism issues in America.\nThey are not part of the White, European Freemasons or Illuminati.\nAs far as discussing Western Values, you're acting as if they're thousands of years old and any attempt to criticize Western Values is tantamount to evil intentions.\nPlenty of Western Philosopher have criticized Western ways of life, from Socrates and Diogenes to Descartes and Popper. In fact, almost any educated mind is aware of the flaws in Western Value Philsophy.\n\nStop being such a boot-licker.\nThomas Jefferson himself said a civilization should go through rebellions every three years.\nThat's actually what we based our Presidential Term limits on; it's easier that way so we don't have to go through the hassle of rebuilding.",
				"added": 1601073443
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 10,
				"body": "I'm also willing to *bet a number of you\nWell, that's an unfortunate typo.",
				"added": 1606080581
			}
		]
	},
	"comment_vote": {
		"2_14R8NGXDuP5koiN9SV1cnkRFx4fqorAS4g": 1
	}
}