{
	"title": "河冰的博客",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 11,
	"demo": false,
	"modified": 1515554675,
	"post": [
		{
			"post_id": 10,
			"title": "我们是如何判断一个人美不美呢？",
			"date_published": 1515554609.123,
			"body": "一个人长的美，单纯从视觉方面来看，一方面是因为这个人的五官排列比较均匀，符合一些比例，而另一方面，重要的一方面，是因为这个人的长相符合你大脑中的“平均相貌”。\n\n那什么又是“平均相貌”呢？这就要从人大脑的“人脸识别系统”讲起：从一个人出生看到第一张脸，并且从意识上能区分这是“人”起，人脑就开始建立“人脸识别系统”，目地就是为了识别“人”，大脑会把见到的人脸都存储起来，然后在后台抽取这些脸的共同点，然后形成“平均相貌”，随着见到的脸越来越多，每个人大脑中“平均相貌”就越接近，这就是为什么大家对美有一些一致的看法。其实“平均相貌”在你见到最初几个人时就开始形成了，所以当你见到一个人时，大脑就自动用看到的脸跟大脑中的“平均相貌”比较，越是符合“平均相貌”的脸，大脑就会产生愉悦感，就感觉这张脸就越美，越是距离“平均相貌”远的，就越丑。这就是为什么人会觉得有的人美，有的人丑，只是因为美的人相貌接近“平均相貌”。\n\n还有个重要的因素就是“熟悉”，越是接近“平均相貌”的脸，大脑就越是觉得这个人“熟悉”，也就越是接近平常认知范围。“熟悉”的东西是可控的、安全的，“不熟悉”意味着不可控、不安全，这是人类进化出的预警意识。\n\n记得小时候很少看到外国人，第一次看到是，心里会想外国人怎么都这么丑，那是因为你的“平均相貌”是在身边中国人中形成的，随着见到外国人越来越多，你大脑中的“平均相貌”也会调整，慢慢看着外国人就顺眼了，甚至会觉得有的外国人美。\n\n所以说喜欢看长的美的人其实是正确的，这是为了保持大脑中“平均相貌”不会出差错。\n\n最后想说的是，其实这是一篇伪科普，文章中观点没有经过科学实验论证，只是我的推论及臆想，大家姑妄看之吧。"
		},
		{
			"post_id": 7,
			"title": "新年的意义",
			"date_published": 1514942388.277,
			"body": "又是一年的最后一天，大家在这一天里怀念过去，也在这一天里憧憬未来，只是，2018年新年的第一缕阳光，仍然会和2017、2016、2015年甚至过去许多许多年里每天的第一缕阳光一样，也仍然会和未来许多许多年里每天的第一缕阳光一样，准时的从东方出现，只不过，这缕阳光照射着的，每天都会有不同，时光亘古不变，而生命稍纵即逝，有些生命消失在过去，而有的生命，已经急不可待的准备在未来出现。生命有始终，时间才有意义。\n\n人一生中可以看到三万个左右的日出，但是感受新年第一缕阳光的次数，大部分人不会到一百次，我不想记住我看了多少次日出，也不想记住有多少次新年的阳光曾经照射到我身上，我只想确定，每次新年的第一缕阳光照射在我胸前的时候，阳光和心都是温暖的，这才是意义所在！就像每一个黑夜都会过去，每一个黎明都会到来！​​​​"
		},
		{
			"post_id": 6,
			"title": "还不太会，学习中……",
			"date_published": 1514359917.269,
			"body": "好多功能都不了解，到处找资料学习中，请来的客人多多指导！谢谢！"
		},
		{
			"post_id": 5,
			"title": "在苟且中追寻诗和远方",
			"date_published": 1514358878.531,
			"body": "        近几个月来，高晓松的一句话刷爆了网络：“生活不止眼前的苟且，还有诗和远方。”赞成者有之，反对者有之，嘲讽者有之，追捧者有之。更有人将苟且与诗和远方对立起来，以为既然苟且，便不能诗和远方，有了诗和远方，便容不得苟且。\n        每个人对这句话的理解不同，便有了不同的态度，基于小编自己的理解，我对这句话还是赞成的。\n        人除了物质生活，还是有精神追求，精神生活的，这也是人和动物最重要的区别，周星驰有一句话：“做人如果没有梦想，跟咸鱼有什么区别。”一个没有精神生活的人是不可想象的，追求精神生活，是人的本性。\n        诚然，生活的本质是琐碎而庸常的，每天奔走在柴米油盐之间，周旋于钢筋水泥之中，有时也不得不低三下四，委曲求全，常常搞得手忙脚乱，身心俱疲，活的如此苟且。但是这并不能阻止我们在精神上的追求，有的人喜欢看书，有的人喜欢听歌，有的人喜欢养花，也有人喜欢摄影。这都是在庸常生活中的一种精神追求，一种诗和远方的体现。\n        其实，真正的诗和远方，就来源于你在琐碎中能自得其乐，在苦难中不失信念，在庸常中追求不凡，在苟且中活出芬芳，更源于精神和灵魂的独立。\n        所以，诗和远方，就是一本喜欢的书，一首好听的歌，是每日辛苦照料后的一次花开，每次跋山涉水后的一张照片，是你把馒头做成一朵花，是汗流浃背时哼着一首歌……，是你不屈服不沉没于日常苟且的生活中，而对精神的不懈追求和提高。\n        最后，借用《约翰·克利斯朵夫》里的一句话：\n        **真正的光明，决不是永没有黑暗的时间，\n        只是永不被黑暗所掩蔽罢了。\n        真正的英雄，决不是永没有卑下的情操，\n        只是永不被卑下的情操所屈服罢了。**\n\n```\n                                            河冰\n\n                                            2016年6月23日\n```"
		},
		{
			"post_id": 4,
			"title": "不想被忽悠，就该这么做！",
			"date_published": 1514358466.183,
			"body": "```\n    我国古代有句话“夏虫不可语于冰”，意思大致是：夏天的虫子不可能和它们谈论冰冻的事，是因为受到生活时间的拘限。小编最近看一本通俗哲学书：《一头想要被吃掉的猪》，里面也有一个类似故事：非洲的好多原始部落里的人，一生都生活在部落的范围，所以有一位从外边世界回来的族人告诉他们，存在冰这种水的另一种形态，水是可以变成晶莹剔透固体的样子，像钻石一样，但是他们是不会相信的，因为他们从来没见过冰，他们的认知范围决定了他们会把这个人的话当成谎话，当成忽悠。\n    我们生活的范围比非洲的那些人大多了，有很多的途径可以扩大自己的认知范围，但是大部分人最终还是禁锢在自己的知识范围内，所以难免会有认知上的偏差和限制，也就难免被别人忽悠。而想要不被忽悠，唯一的途径，就是提高自己的认知水平，扩大自己的知识范围，形成自己独立思考的能力。\n    互联网时代，信息传播速度快、范围广，每个人都可以是信息发布者，所以难免良莠不齐夹私活，鱼龙混杂带忽悠，比如小编自己认定的几大忽悠：成功学、鸡汤文、厚黑学（权谋术），以及每天微博、微信圈内传播的那些“你要如何如何，人生便会如何”、“记牢多少多少条，世上便无难事”之类的文章，而要鉴别这些信息，也只有一条途径：提高自己的认知水平，扩大自己的知识范围，形成自己独立思考的能力。\n    读书，就是扩大自己认知范围最重要的途径，当然可以自己去实践认识，比如非洲的那些人，可以出去外边世界，去看看冰。但是大部分时候，我们不具备这样的条件，而书籍，就是别人经验的总结，是别人认知范围的传递，而且更系统、更全面。\n    所以如果非洲的那个人告诉他的族人：“来来，一人一块金币，我给你们一块冰，很神奇，可以治百病。”的时候，那些看了书的族人或许就会说：“切，不要忽悠，要不要我给你讲讲水的化学结构！”\n    想不被忽悠，就来看多书！何况我国古代还有一句话：“书中自有黄金屋，书中自有颜如玉。”\n    人生残酷，且行且珍惜！\n\n         河冰\n\n         2016年6月8日\n```\n\n（测试文章）"
		},
		{
			"post_id": 3,
			"title": "HELLO ZERONET ！",
			"date_published": 1514029727.008,
			"body": "Blog post body"
		},
		{
			"post_id": 2,
			"title": "河冰的博客",
			"date_published": 1514029571.181,
			"body": "Blog post body"
		},
		{
			"post_id": 1,
			"title": "Congratulations!",
			"date_published": 1433033779.604,
			"body": "Your zeronet blog has been successfully created!"
		}
	]
}