{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Liberdade NÃO PODE TER LIMITE.",
			"body": "vamos lutar contra a as mentiras\ncomo ?\nclaro\nLIMITANDO O QUE TODOS podem falar\ne quem limita ?\nhá estes santos aqui\nELES vão dizer para TODOS o que é ódio  ou não\nok\nsucesso\n\nNÃO EXISTE MEIA LIBERDADE , e vejam bem, estou defendendo a liberdade falar a merda quiser e NÃO A LIBERDADE DE FAZER, como estes marginais , que saem matando pessoas por ai.\n\nPermitir o cara falar a merda que for é uma coisa , FAZER É OUTRA, pois é bem simples, o vagabundo que TENTAR, tem que ser morto, caso queria atacar pessoas PACIFICAS, como por exemplo, as pessoas das mesquitas, da El Paso e etc\n\nNão quero dizer que não tem maluco marginal, no islã, TEM E MUITOS, mas não acho certo tirar a liberdade de TODO MUNDO, porque tem imbecil que fala merda e as pessoas tem que entender também que , o que pode ser uma merda ou bobagem para mim, pode não ser para você.\n\nE ai quem define o que é certo ou errado, eu tenho 100% de certeza que as definições vão ser arbitrárias e vai servir somente para o estado nos controlar como fazem NA CHINA em massa, com seu povo.\n\n NÃO CONCORDO COM NEM UM TIPO DE CENSURA.\n\n\n============================================\ntexto traduzido, google translator\n\nO Memorial do Holocausto em Berlim. Uma lei alemã que proíbe a difamação contra partes da população é frequentemente usada para punir atos como a negação do Holocausto. Crédito de crédito Fabrizio Bensch / Reuters\n\nO massacre de 22 pessoas em El Paso, um ataque anunciado em um manifesto cheio de ódio sobre uma \"invasão\" de imigrantes, reavivou o debate sobre os limites da liberdade de expressão, protegidos pela Primeira Emenda nos Estados Unidos.\nMas na Europa, onde a história provou que as ameaças domésticas podem ser tão devastadoras para a democracia quanto as do exterior, a liberdade de expressão, embora um direito constitucional, vem com certas ressalvas. Restritas no escopo e ligadas a ameaças específicas, essas limitações baseiam-se na premissa de que a proteção de certos ideais, como o bem público ou a dignidade humana, pode justificar a restrição do que os indivíduos podem dizer.\nUm direito constitucional, mas limitado\nA liberdade de expressão é consagrada constitucionalmente tanto na Alemanha quanto na França, assim como nos Estados Unidos. Mas há uma diferença importante.\n\"A grande nuance entre a Primeira Emenda e os textos europeus é que os textos europeus permitem possíveis limitações\" no discurso, disse Emmanuel Pierrat, um advogado francês especializado em questões de publicação e liberdade de expressão.\nA liberdade de expressar uma opinião em \"fala, escrita e imagens\" é garantida pelo artigo 5 da Constituição alemã , juntamente com a liberdade de imprensa. Mas o mesmo artigo adverte que essa liberdade pode ser limitada por “leis gerais, disposições para a proteção de jovens e o direito à honra pessoal”.\nNa França, o artigo 10 da Declaração de Direitos Humanos e Cívicos garante que ninguém pode ser “perturbado por causa de suas opiniões, mesmo as religiosas”, desde que não perturbe a ordem pública. O Artigo 11 chama a liberdade de comunicar pensamentos e opiniões “um dos mais preciosos direitos do homem”, mas acrescenta que a lei pode determinar casos em que essa liberdade é abusada.\n[ Reações internacionais descreveram a epidemia de tiroteios em massa da América como violência em um país em guerra consigo mesma. ]\nMesmo nos Estados Unidos, as proteções da Primeira Emenda, embora vastas, não estão sem nenhuma restrição. Jornalistas, por exemplo, devem rotineiramente trabalhar dentro dos limites das leis de difamação e difamação e, como o famoso exemplo diz, as pessoas não são necessariamente livres para gritar falsamente “fogo” em um teatro lotado.\nImagemUm memorial para as vítimas do ataque terrorista do lado de fora da sala de concertos Bataclan em Paris em 2015. Os ataques terroristas na última década moldaram atitudes em relação à liberdade de expressão na França e em outros lugares da Europa.\nUm memorial para as vítimas do ataque terrorista do lado de fora da sala de concertos Bataclan em Paris em 2015. Os ataques terroristas na última década moldaram atitudes em relação à liberdade de expressão na França e em outros lugares da Europa. Crédito Tomas Munita para o New York Times\nNecessidade histórica\nAs restrições na França e na Alemanha estão parcialmente ligadas às experiências traumáticas sofridas por ambos os países nas sangrentas guerras do século XX. Outras tendências históricas e ameaças mais recentes, especialmente o extremismo islâmico violento e a expansão da internet e das mídias sociais, também moldaram a legislação.\n“Incitação ao ódio” é um crime na Alemanha que se refere a qualquer forma de violência ou difamação contra partes da população, incluindo agressões à dignidade humana. A lei é freqüentemente usada para punir atos que nos Estados Unidos seriam protegidos pela Primeira Emenda, como negação do Holocausto ou promoção de ideologia de extrema-direita. Nos últimos anos, a lei tem sido usada contra pessoas que postam comentários odiosos sobre judeus ou estrangeiros nas redes sociais.\nA lei alemã também proíbe a exibição pública de símbolos de organizações proibidas, como a suástica nazista ou a saudação de Hitler de braços rígidos. Essas leis datam da fundação da democracia do país após a Segunda Guerra Mundial. Disputas recentes levantaram a questão de saber se elas podem ser exibidas, mesmo quando riscadas.\n[O tiroteio renovou o debate sobre como combater o terrorismo doméstico.]\nNa França, o ato de negar publicamente o Holocausto também é uma ofensa, assim como o ato de negar publicamente outros crimes contra a humanidade. As leis francesas punem a difamação ou provocação ao ódio ou violência com base em raça, religião e outros fatores.\n“Divulgar” mensagens que são “violentas” ou que poderiam “prejudicar seriamente a dignidade humana” e que pode ser visto por um menor também é uma ofensa. A líder da extrema direita, Marine Le Pen, está sendo processada por essa acusação, depois que postou fotos da violência do Estado Islâmico no Twitter.\nAtaques terroristas na última década também moldaram atitudes em relação à liberdade de expressão na França e em outros lugares da Europa , com algumas leis recentes punindo o incitamento ao terrorismo, ou mesmo a justificativa pública do terrorismo.\nO manifesto publicado pouco antes do tiroteio de El Paso - que elogia um atirador que matou 51 pessoas em duas mesquitas na Nova Zelândia - seria provavelmente considerado difamatório na França com base na raça, um incitamento ao ódio racial e à violência, e um incitamento à e justificação do terrorismo. Na Alemanha, provavelmente seria visto como incitamento e, portanto, contra a lei.\nMais amplamente, as leis da França podem restringir a liberdade de expressão em casos de difamação, calúnia, difamação e privacidade. Isso é em parte por causa do contexto histórico da Revolução Francesa, de acordo com o Sr. Pierrat.\n\"Estávamos saindo da monarquia absoluta, então precisávamos de uma liberação da fala\", disse ele, uma preocupação compartilhada tanto na França do século XVIII quanto na América. Mas a proliferação na França de panfletos incendiários anônimos tornou os franceses muito mais cautelosos com a livre liberdade irrestrita do que os autores da Constituição americana, disse Pierrat.\nNa Noruega, onde um pistoleiro matou 77 pessoas em um ataque de 2001 que defendeu em um manifesto de 1.500 páginas contra o que ele considera a tomada da Europa por muçulmanos, a liberdade de expressão também está consagrada na Constituição, mas discursos de ódio ou incitação à violência é um crime.\nEm 2015, o governo, percebendo que o discurso de ódio estava restringindo o discurso público, criou uma estratégia para vários ministérios combaterem sua ascensão.\nReining em mídias sociais\nOs países europeus e a União Européia, de forma mais ampla, estão mais dispostos a regulamentar o que é dito sobre as mídias sociais e outras plataformas de internet, que são principalmente a criação e o domínio de poderosas empresas de tecnologia americanas.\nPreocupada com o fato de as plataformas de mídia social estarem se tornando um terreno fértil para o discurso de ódio, a Alemanha aprovou uma lei em 2017 que exigia que as empresas operassem plataformas de mídia social para remover comentários ou postagens ilegais, racistas ou caluniosas 24 horas após sua aparição online. Os infratores enfrentaram multas de até US $ 57 milhões.\nHeiko Maas, ministro da justiça da Alemanha na época em que a lei foi redigida, descreveu-a como \"não uma limitação, mas um pré-requisito para a liberdade de expressão\", garantindo que \"todos possam expressar sua opinião livremente, sem serem insultados ou ameaçados\".\n[O presidente Trump enfrentou novas críticas pelos ecos de sua própria retórica no manifesto de El Paso . Leia nossa análise.]\nEm um amplo discurso político no início deste ano, o chefe da agência de inteligência doméstica da Alemanha, Thomas Haldenwang, pediu o aumento do patrulhamento da comunicação digital, incluindo as mídias sociais. A lei alemã permite que os funcionários pesquisem dados na esfera digital em face de certas ameaças, incluindo o terrorismo doméstico.\nParcialmente inspirado pela lei de discurso de ódio da mídia social da Alemanha, o Parlamento da França recentemente começou a debater um projeto similar .\n\"Não há razão para comentários que não sejam tolerados em um ônibus, em um café ou na escola - basicamente, na 'vida real' - devem ser tolerados em um site ou rede\", disse Laetitia Avia, membro da câmara baixa da França. do Parlamento que está patrocinando o projeto, disse em junho.\nImagem\nCidadãos franceses marchando após o ataque de 2015 à revista satírica Charlie Hebdo, alguns segurando cartazes que formam os olhos de seu editor morto, Stéphane Charbonnier. Crédito Charles Platiau / Reuters\nFronteiras nem sempre são claras\nLiberdade de expressão artística é também um direito constitucional, que tem sido usado repetidamente para testar os limites de quão longe um indivíduo pode ir. Mais recentemente, a sátira provou ser um palco para um debate em torno das fronteiras do que é aceitável e do que é prejudicial.\nNa Alemanha, um poema repleto de palavrões tirando sarro do presidente Recep Tayyip Erdogan, da Turquia, levou o comediante Jan Böhmerman ao tribunal e provocou uma disputa diplomática entre Berlim e Ancara. Embora Böhmerman tenha sido impedido de repetir certas linhas de seu poema, os promotores retiraram as acusações contra o satírico de insultar um líder estrangeiro, alegando que a hipérbole era permitida em nome da arte.\nNa França, embora os limites do discurso odioso sejam amplamente favorecidos, há também um forte apoio ao debate público aberto e à sátira mordaz, como mostra a manifestação pública de apoio à liberdade de expressão após os ataques ao semanário satírico Charlie Hebdo em 2015 .\nMas esse equilíbrio às vezes é difícil de encontrar. O comediante francês Dieudonné M'bala M'bala , por exemplo, tem repetidamente entrado em conflito com as leis anti-discurso de ódio da França, mas seu caso também desencadeou debates sobre se algumas das disposições - em alguns casos, as autoridades foram longe como proibir preventivamente seus shows - eram contraproducentes e excessivos.\nNa França, o Sr. Pierrat disse: \"A liberdade de expressão pára onde ela começa a invadir a liberdade dos outros.\"\nTalvez ciente das diferenças culturais e legais que existem entre a França e o mundo anglo-saxão em relação à liberdade de expressão, o governo francês publicou em 2015 um guia em inglês chamado “Tudo o que você precisa saber sobre liberdade de expressão na França”.\nA liberdade de expressão, diz o guia, é um dos maiores valores da França. \"Mas essa liberdade tem limites\", acrescenta. “Racismo, anti-semitismo, ódio racial e justificação do terrorismo não são opiniões. Eles são ofensas ”.\nSiga Melissa Eddy e Aurelien Breeden no Twitter: @meddynyt e @aurelienbrd .\n\nfonte : https://archive.fo/4NcDF#selection-333.0-365.25\n\n========================================================================\n\noriginal em inglês\nThe massacre of 22 people in El Paso, an attack announced in a hate-filled manifesto about an immigrant “invasion,” has revived debate about the limits of free speech, protected by the First Amendment in the United States.\nBut in Europe, where history has proved that domestic threats can be as devastating to democracy as those from abroad, freedom of speech, while a constitutional right, comes with certain caveats. Restricted in scope and linked to specific threats, these limitations are based on the premise that protecting certain ideals, such as the public good or human dignity, can justify curbing what individuals are allowed to say.\nA constitutional, but limited, right\nFree speech is constitutionally enshrined in both Germany and France, as it is in the United States. But there is an important difference.\n“The big nuance between the First Amendment and the European texts is that the European texts allow for possible limitations” on speech, said Emmanuel Pierrat, a French lawyer who specializes in publishing and free speech issues.\nFreedom to express an opinion in “speech, writing and pictures” is guaranteed under Article 5 of the German Constitution, alongside freedom of the press. But the same article warns that this freedom can be limited by “general laws, in provisions for the protection of young persons, and in the right to personal honor.”\nIn France, Article 10 of the Declaration of Human and Civic Rights guarantees that no one can be “disturbed on account of his opinions, even religious ones,” as long as they do not trouble public order. Article 11 calls the freedom to communicate thoughts and opinions “one of the most precious rights of man,” but adds that the law can determine cases in which that freedom is abused.\n[International reactions depicted America’s mass shooting epidemic as violence in a country at war with itself.]\nEven in the United States, First Amendment protections, while vast, are not without any restriction. Journalists, for instance, must routinely work within the bounds of libel and defamation laws and, as the famous example goes, people are not necessarily free to falsely yell “fire” in a crowded theater.\nImageA memorial for the victims of the terrorist attack outside the Bataclan concert hall in Paris in 2015. Terrorist attacks over the past decade have shaped attitudes toward free speech in France and elsewhere in Europe.\nA memorial for the victims of the terrorist attack outside the Bataclan concert hall in Paris in 2015. Terrorist attacks over the past decade have shaped attitudes toward free speech in France and elsewhere in Europe.CreditTomas Munita for The New York Times\nHistorical necessity\nThe restrictions in France and Germany are partly linked to traumatic experiences suffered by both countries in the bloody wars of the 20th century. Other historical trends, and more recent threats, especially violent Islamic extremism and the expansion of the internet and social media, have also shaped legislation.\n“Incitement to hatred” is a crime in Germany that refers to any form of violence or defamation against parts of the population, including assaults on human dignity. The law is often used to punish acts that in the United States would be protected by the First Amendment, such as denial of the Holocaust or promoting far-right ideology. In recent years, the law has been used against people posting hateful comments about Jews or foreigners over social media.\nGerman law also prohibits the public display of symbols from banned organizations, such as the Nazi swastika or the stiff-armed Hitler salute. These laws date back to the founding of the country’s democracy after World War II. Recent disputes have raised the issue of whether they can be displayed, even when crossed out.\n[The shooting has renewed debate over how to combat domestic terrorism.]\nIn France, the act of publicly denying the Holocaust is also an offense, as is the act of publicly denying other crimes against humanity. French laws punish defamation or provocation to hatred or violence on the basis of race, religion and other factors.\n“Disseminating” messages that are “violent” or that could “seriously harm human dignity” and that could be seen by a minor is also an offense. The far-right leader Marine Le Pen is being prosecuted on that charge, after she posted pictures of Islamic State violence on Twitter.\nTerrorist attacks over the past decade have also shaped attitudes toward free speech in France and elsewhere in Europe, with some recent laws punishing the incitement to terrorism, or even the public justification of terrorism.\nThe manifesto published shortly before the El Paso shooting — which praises a gunman who killed 51 people at two mosques in New Zealand — would in France probably be considered defamatory on the basis of race, an incitement to racial hatred and violence, and an incitement to and justification of terrorism. In Germany, it would likely be seen as incitement and therefore be against the law.\nMore broadly, France’s laws can be restrictive of free speech in cases of defamation, libel, slander and privacy. That is in part because of the historical context of the French Revolution, according to Mr. Pierrat.\n“We were coming out of the absolute monarchy, so there needed to be a liberation of speech,” he said, a concern shared both in 18th-century France and America. But the proliferation in France of anonymous incendiary pamphlets made the French much more wary of unfettered free speech than the framers of the American Constitution, Mr. Pierrat said.\nIn Norway, where a gunman killed 77 people in a 2001 attack that he defended in a 1,500-page manifesto against what he viewed as the Muslim takeover of Europe, freedom of expression is also enshrined in the Constitution, but hate speech or incitement to violence is a crime.\nIn 2015, the government, realizing that hate speech was curbing public discourse, created a strategy for various ministries to combat its rise.\nReining in social media\nEuropean nations, and the European Union more broadly, have been more willing to regulate what is said over social media and other internet platforms that are mostly the creation and domain of powerful American tech companies.\nWorried that social media platforms were becoming a breeding ground for hate speech, Germany passed a law in 2017 that required companies operating social media platforms to remove illegal, racist or slanderous comments or posts within 24 hours of their appearance online. Violators faced fines of up to $57 million.\nHeiko Maas, Germany’s justice minister at the time the law was drafted, described it as “not a limitation, but a prerequisite for freedom of expression,” by ensuring that “everyone can express their opinion freely, without being insulted or threatened.”\n[President Trump faced new criticism for the echoes of his own rhetoric in the El Paso manifesto. Read our analysis.]\nIn a broad policy speech earlier this year, the head of Germany’s domestic intelligence agency, Thomas Haldenwang, called for increased patrolling of digital communication, including social media. German law permits officials to search through data in the digital sphere in the face of certain threats, including domestic terrorism.\nPartly inspired by Germany’s social media hate speech law, France’s Parliament recently started debating a similar bill.\n“There is no reason that comments that would not be tolerated on a bus, in a cafe or in school — basically, in ‘real life’ — should be tolerated on a website or network,” Laetitia Avia, a member of France’s lower house of Parliament who is sponsoring the bill, said in June.\nImage\nFrench citizens marching after the 2015 attack on the satirical magazine Charlie Hebdo, some holding signs that form the eyes of its killed editor, Stéphane Charbonnier.CreditCharles Platiau/Reuters\nBoundaries are not always clear\nFreedom of artistic expression is also a constitutional right, one that has been used repeatedly to test the limits of how far an individual can go. Most recently, satire has proved a stage for a debate around the boundaries of what is acceptable and what is hurtful.\nIn Germany, a poem laced with profanity making fun of President Recep Tayyip Erdogan of Turkey landed the comic Jan Böhmerman in a courtroom and provoked a diplomatic dispute between Berlin and Ankara. Although Mr. Böhmerman was prevented from repeating certain lines of his poem, prosecutors dropped charges against the satirist of insulting a foreign leader, on the grounds that hyperbole was allowed in the name of art.\nIn France, while limits on hateful speech are broadly favored, there is also robust support for open public debate and biting satire, as shown by public outpouring of support for free expression after the attacks on the satirical weekly newspaper Charlie Hebdo in 2015.\nBut that balance is sometimes hard to find. The French comedian Dieudonné M’bala M’bala, for instance, has repeatedly run afoul of France’s anti-hate speech laws, but his case has also set off debates over whether some of the provisions — in some cases, the authorities went as far as to pre-emptively ban his shows — were counterproductive and overreaching.\nIn France, Mr. Pierrat said, “Freedom of expression stops where it starts to encroach upon the freedom of others.”\nPerhaps aware of the cultural and legal differences that exist between France and the Anglo-Saxon world regarding free speech, the French government published in 2015 an English-language guide called “Everything you need to know about freedom of expression in France.”\nFreedom of expression, the guide says, is one of France’s highest values. “But this freedom has limits,” it adds. “Racism, anti-Semitism, racial hatred and justification of terrorism are not opinions. They are offenses.”\nFollow Melissa Eddy and Aurelien Breeden on Twitter: @meddynyt and @aurelienbrd.\nMelissa Eddy reported from Berlin, and Aurelien Breeden from Paris.",
			"added": 1565231852
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1E77t7FwBywxsGtnhZwve3moB1AbNaaxfv": [
			{
				"comment_id": 1,
				"body": "USE \nKaffieId is a fully decentralized Id Provider - Id Signature creation happens locally, on the computer doing the registration. Because of this, KaffieId does not ensure unique usernames.\n\n===================\n\nO KaffieId é um provedor de ID totalmente descentralizado - a criação da Assinatura de ID ocorre localmente, no computador que faz o registro. Por causa disso, o KaffieId não garante nomes de usuários exclusivos.\n\nhttp://127.0.0.1:43110/1K3tM7irQqSX4Hx3JvNgkimkQzY6jPtBfz/",
				"added": 1564639852
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 2,
				"body": "The Big Bang Theory S02E20 Dub\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1565222177_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT",
				"added": 1565225137
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 3,
				"body": "Liga da Justiça T02 E01 - Crepúsculo - Parte 1 Dub\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1565686521_1NwrEqNkark7rqYFZatB1pLPmwz1TA6mDT",
				"added": 1565688706
			}
		]
	},
	"comment_vote": {
		"1_1NMiZdtd3ht5fRxUVLndtGXSvqyH6BzD7": 1
	}
}