{
	"posts": [
		{
			"id": "2b53f2d9-e7ec-410d-aaec-796bb4ea3715",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"subject": "Baldur's Gate I & II and CRPG's combat.",
			"body": "So I have recently playing Baldur's Gate, have installed TuTu and both games with all expansions. The music, the style and the story so far are enjoyable, but I seem to be unable to get into the combat system of the game. I must preface saying, that I'm have practically no knowledge of DnD, but I find combat very dull. Melee is little more than auto-attacks, thiefs outside of finding traps, stealth and lockpicking doesn't look that interesting nor fun. Mages seems to be the only classes that are interesting in combat and actually have any kind of significant player input. I tried to play a bit of BG II to see if at higher level things were better, but while Mages were pretty cool, Thiefs and Fighters were almost the same, with only things like the Berserk's Enrage and Kensai's Kai being mildly interesting. I understand positioning is an important part of the melee classes game play,but so far it has been little more than putting them on the front lines, some times kitting them a bit for my ranged fighters to pick the enemies one by one. Also I know usable items and multiple weapons help spice up the game play a bit, but is still seem so far it basically boils down to letting the character auto-attack while Mages do all the work.  The character building, items and the like so far looks very interesting, but combat itself feels too simple and boring to me. I feel pretty bad for this though, seeing as in places like RPGCodex praise this game greatly, while throwing shit at games like Divnity Original Sin 2 that, while very flawed, I though had a decent combat system that actually was fun and require a little of though while still giving you a lot of freedom to build your character, yet I fail to understand what makes BG's combat better. Is there something I'm missing? Perhaps I haven't arrived to the good parts yet. Is it a case of the combat system being \"fair\" for its time, while the real fun is in building your character? Or perhaps do I just have shit taste when it comes to combat in RPGs?\n\nAlso, what CRPGs have the best combat systems? What makes it good? Of the modern CRPG, which ones have the best combat system?",
			"time": 1565630746900,
			"files": "[{\"name\":\"220px-Baldur's_Gate_box.PNG\",\"thumb\":\"ec22b9096bb180eca825f65c6427f57592465e0f-thumb.png\",\"size\":124694,\"type\":\"image/png\",\"original\":\"37fd533a3d149382a827302e182529262e8c853f.png\",\"directory\":\"1HSxxYq9odKHMvLqsvLRrupQhaEXDpBARo\"},{\"name\":\"CRPGs.png\",\"thumb\":\"6aae9644f23e2e1abc41b5d5e9f2d443d4cae297-thumb.png\",\"size\":305349,\"type\":\"image/png\",\"original\":\"ca298ec0e24c6a44b4786a7a5fad2aabd2cdcaa9.png\",\"directory\":\"1HSxxYq9odKHMvLqsvLRrupQhaEXDpBARo\"}]"
		},
		{
			"id": "df862592-ebf0-4d9b-b0ce-2f6f9ab1840e",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "5160ecf2-b5ae-4ff1-80bc-b384b7ed27c6",
			"body": "Just playing old videogames and watching a couple of movies. Just chilling this summer.",
			"time": 1565638608500,
			"files": "[]"
		},
		{
			"id": "a2109a92-7990-4722-b8a4-15c0e0a6b071",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "v",
			"thread": "2b53f2d9-e7ec-410d-aaec-796bb4ea3715",
			"body": ">>56534037-acdb-4b4e-8ac1-11004de42658\nThanks, I guess the game may not be for me after all, but perhaps I'll try to play it more and see if I start to like them more. It's true that people often praise their writing when speaking of these games, but I just can't get into them if I do not enjoy the game play.\n\nI may try Underrail, looks pretty fun. Already played Age of Decadence, it was alright, really liked the branching story and character building, but it has its issues. Combat was alright, and I enjoy that it was very focused on melee, letting you choose different ways to attack depending on your weapons and your proficiency with them, going from light to strong attacks, but also aiming specific parts of the enemy to try and disarm them, wounding their legs, blinding them and so fort to gain advantage in battle, as well as being able to push the enemy around. Frankly, if Baldur's Gate had something similar it would go a long way to make it more interesting in my opinion. Sadly, the combat lacked many options that for example, Baldur's have with its magic system and magic equipment, and I think the combat system of AoD would have been much better if it was squad base like other RPGs. Also many of the stats and skills like stealth were very disappointing on the fact that they didn't alter how you played the game. They were merely used for \"skill checks\" at different points, so you didn't really move around behind enemies backs or ambushed enemies in combat, stealth had no real game play effect. Many of the stats where like this which is quite a shame. Still quite an interesting game, but not quite amazing.\n\nEdit: By the way, how is the new Pathfinder game? I heard its pozzed to a certain extend, but also I heard good things about it. I'm on the fence about trying it out. How good is the combat and character building?",
			"time": 1565706912000,
			"files": "[]",
			"last_edited": 1565707362200
		}
	],
	"boards": [],
	"modlogs": []
}