{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "A extinção do conhecimento",
			"body": "Admito que talvez haja um certo exagero no título dessa crônica. Talvez, por enquanto, ainda haja mesmo um certo exagero, sim. Mas apenas por enquanto – poder-se-ia dizer de modo previdente e sensato. Talvez ainda – frise-se o ainda – se possa falar que isso que vivenciamos e experimentamos hoje é “somente” uma desvalorização do conhecimento. Tudo bem. Mas, e aí está o risco, todo processo de extinção principia com a desvalorização, descaso ou descuido para com determinada coisa, valor ou espécie. Não é fato?\n\n“Mas o conhecimento, o saber, não se extinguirá nunca!” – exclamaria indignado você, leitor exigente e arguto. Sim, talvez você esteja correto, mas a minha preocupação de fato, daí talvez haver um calculado “exagero” nessa minha assertiva, é a de que o acesso ao conhecimento torne-se algo cada vez mais raro, difícil, restrito e de interesse tão-somente de uns poucos “eleitos”, “iniciados” ou membros de certas seitas, confrarias ou castas – o que, de certo modo, já ocorre hoje. Tenho medo de que o saber torne-se algo exclusivo de sacerdotes e a cultura alvo de interesse só de antropólogos, arqueólogos ou “paleontólogos”. Entende o que digo?\n\nA cada geração que passa, verifica-se uma progressiva desvalorização do saber. A minha geração, por exemplo, há uns vinte e poucos anos, já era criticada por ser “alienada”, por interessar-se pouco por livros, pelas coisas da arte e da cultura e pela observação e discussão dos acontecimentos à volta. Isso já ocorria com a minha geração, que é a dos indivíduos que eram adolescentes na década de 1970, e certamente aconteceu com gerações anteriores à minha. Imagine então se analisarmos as gerações que estão surgindo agora – e as que ainda estão por vir! Um desastre!\n\nNo ano passado, visitando a casa de um sobrinho de uns 28 anos, que morava à época com mais dois jovens da sua geração, pude observar que aquela casa, por ser a casa de jovens de classe média, tinha de tudo em termos de eletrodomésticos e aparelhos eletrônicos sofisticados, mas, pequeno detalhe, não tinha livros. Nem um sequer.\n\nDe uns anos pra cá, entrevistando jovens candidatos a vagas de estágio na Fundação em que trabalho, sempre lhes pergunto sobre seus hábitos de leitura e fico estarrecido ao constatar que hoje ele praticamente inexiste entre os jovens. A resposta, da quase totalidade dos entrevistados, sobre quantos livros leu nesse ano ou no ano anterior é elucidativa: ZERO. Os jovens hoje simplesmente não lêem! Só a título de curiosidade, vai aqui mais uma informação, a média per capita de consumo anual de livros no Brasil é de menos de 2 por habitante – incluindo-se aí os didáticos que são distribuídos pelo Governo. É mole, não!?\n\nNo livro “Farenheite 451” de Ray Bradbury, uma obra de ficção publicada em 1953 (adaptada para o cinema em 1966 por François Truffaut), temos o exemplo de uma sociedade totalitária em que a leitura era considerada um crime e, por isso, todos os livros eram incinerados – daí o título do livro que alude à temperatura em que o papel entra em combustão. Nesse contexto, e como uma forma de resistência, surgem os homens-livro, espécie de eremitas ou “marginais” que viviam isolados, refugiados nos campos a recitar trechos de livros, e até mesmo obras inteiras, em longas caminhadas, à semelhança dos passeios peripatéticos de Aristóteles e dos epicuristas.\n\nSabe-se, decerto, que o conhecimento não está presente somente nos livros, que o preço dos livros estão proibitivos e que ainda faltam bibliotecas públicas em muitas cidades etc. e etc., mas isso não justifica tamanha inapetência para a leitura. Sabe-se também que há outras formas de difusão do saber, sim, novas tecnologias – como a internet. E outras, nem tão novas assim, como a TV. Mas será que essas tecnologias estão sendo utilizadas verdadeiramente como instrumentos de difusão e democratização do conhecimento? Mais ainda: será que essas novas tecnologias estão ao alcance de todos? Ou será que estamos caminhando para uma sociedade como a descrita na instigante, virtuosa e antológica ficção de Bradbury, onde os homens apartados do conhecimento eram presas frágeis e indefesas da manipulação e dominação totalitárias? Será que o homem do futuro, o jovem de hoje, pode realmente prescindir, como pensa, do saber que repousa nos livros e na tradição? \n\nJá pensou que espécie de médicos, engenheiros, advogados, políticos, psicólogos, jornalistas estão sendo formados hoje? Já pensou que tipo de professor que estamos formando hoje!? Veja bem, justo os professores que são, ou pelos deveriam ser, como outrora já o foram, os “mestres” ?\n\nJá pensou o tipo de sociedade que estamos construindo?\n\n\nN.A – Texto extraído do livro “Balão de Ensaios – poesia e engajamento”.\n\n- Fonte: https://www.cartamaior.com.br/?/Editoria/Midia/A-extincao-do-conhecimento/12/10494",
			"added": 1548356253
		}
	],
	"topic_vote": {
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"1_1A2AJCxA3n4QjikssyECqWMk8xBYniBpWa": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"1_1Ef3hPWXWuh9Geq8SS2bFRknCRt3p6RLtM": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 1,
				"body": "#Fahrenheit 451\nEscrito após o término da Segunda Guerra Mundial, em 1953, Fahrenheit 451, de Ray Bradubury, revolucionou a literatura com um texto que condena não só a opressão anti-intelectual nazista, mas principalmente o cenário dos anos 1950, revelando sua apreensão numa sociedade opressiva e comandada pelo autoritarismo do mundo pós-guerra. Agora, o título de Bradbury, que morreu recentemente, em 6 de junho de 2012, ganhou nova edição pela Biblioteca Azul, selo de alta literatura e clássicos da Globo Livros, e atualização para a nova ortografia. A singularidade da obra de Bradbury, se comparada a outras distopias, como Admirável Mundo Novo, de Aldous Huxley, ou 1984, de George Orwell, é perceber uma forma muito mais sutil de totalitarismo, uma que não se liga somente aos regimes que tomaram conta da Europa em meados do século passado. Trata-se da “indústria cultural, a sociedade de consumo e seu corolário ético – a moral do senso comum”, segundo as palavras do jornalista Manuel da Costa Pinto, que assina o prefácio da obra. Graças a esta percepção, Fahrenheit 451 continua uma narrativa atual, alvo de estudos e reflexões constantes. O livro descreve um governo totalitário, num futuro incerto, mas próximo, que proíbe qualquer livro ou tipo de leitura, prevendo que o povo possa ficar instruído e se rebelar contra o status quo. Tudo é controlado e as pessoas só têm conhecimento dos fatos por aparelhos de TVs instalados em suas casas ou em praças ao ar livre. A leitura deixou de ser meio para aquisição de conhecimento crítico e tornou-se tão instrumental quanto a vida dos cidadãos, suficiente apenas para que saibam ler manuais e operar aparelhos.\n\n- Download: https://anonfiles.com/kcX565r6b5/Fahrenheit_451_-_Ray_Bradbury_pdf ou https://mega.nz/#!3nJUQIIZ!yMCuVVKZYP8TolLq6jboba0MBqxh-erUKGPaXHNpYdw\n\n- SHA-256: 7007b5cc93e798e95b468fe8076fe551935727f2b737ece74aaf6dbf752db606",
				"added": 1548352947
			},
			{
				"comment_id": 2,
				"body": "#1984\nAo lado de “A Revolução dos Bichos”, o livro “1984” é um dos mais famosos de George Orwell. A obra já ganhou versões de filmes, minisséries, quadrinhos, traduções para 65 países e uma polêmica fama, que não é à toa! Em seu último romance, o autor criou um personagem chamado Winston, que vive aprisionado em uma sociedade completamente dominada pelo Estado. Essa submissão ao poder, é relatada, inclusive, na rotina desse personagem, que trabalha com a falsificação de registos históricos, a fim de satisfazer os interesses presentes. Winston, contudo, não aceita bem essa realidade, que se disfarça de democracia, e vive questionando a opressão que o Partido e o Grande Irmão exercem sob a sociedade. A inspiração do livro vem dos regimes totalitários das décadas de 30 e 40 e, é assim, sob a ótica da ficção, que o autor faz com que seus leitores reflitam sobre o sistema de controle, que depois de tanto tempo ainda é muito questionado.\n\n#A importância de ler 1984\nO livro é considerado um clássico moderno. Ele questiona, de diversas formas e em vários momentos, os excessos delirantes do poder. Além disso, embora tenha sido publicado em 1949, mostra-se muito atual ao tratar de questões atemporais, que atingem todos que o leem, independentemente da idade, sexo, cor ou classe social. É por esses motivos, dentre outros, que “1984” é tido como um livro indispensável para o entendimento da história moderna e é altamente recomendado para empresários, funcionários de diferentes segmentos e universitários de diversos cursos. O livro não é só uma crítica ao totalitarismo, mas também um alerta sobre o nível de submissão dos indivíduos.\n\n- Download: https://anonfiles.com/s3ob73rebe/1984_-_George_Orwell_pdf ou https://mega.nz/#!W3ZAHYjR!ISm6M-d5Ukoctzt66j2_QVKGCLWiC-ng5ZCFiFnIBp0\n\n- SHA-256: 48d72dc12e3a2045c41914cefc7b82ea218483d46fc6e5aa7911dba56a2e1555",
				"added": 1548355249
			},
			{
				"comment_id": 4,
				"body": "#O Céu É de Verdade - o Impressionante Relato do Menino Que Foi Ao Céu e Voltou Para Contar\nO céu é de verdade conta a história real de Colton, um menino que, aos quatro anos, quando passava por uma cirurgia de emergência, viveu uma experiência inusitada: seu espírito foi transportado ao céu, onde viu coisas extraordinárias, inclusive o trono do próprio Deus. O garoto também assistiu aos procedimentos médicos e viu o pai orando na sala de espera. No primeiro momento, a família agiu com incredulidade diante do relato, mas logo as evidências de que o menino falava a verdade se tornaram claras — Colton conheceu a irmã que fora abortada, segredo guardado a sete chaves pela família. Narradas por seu pai, mas frequentemente nas palavras do próprio Colton, as experiências relatadas em O céu é de verdade revelam a realidade e a esperança do Paraíso e do Criador.\n\n- Download: https://anonfiles.com/d24579r4bc/O_Ceu_e_de_Verdade_-_Todd_Burpo_pdf ou https://mega.nz/#!W6ZkwKAY!bOrG_xWCESmhbCeLN9iahUJDR4Vo_DXh_WGGr4kZ9Jc\n\n- SHA-256: 94aa785738bbc3ddd12e649e3f9aaf14508ae49a1b0d5ba186ac4d98e77ea5be",
				"added": 1548358734
			},
			{
				"comment_id": 5,
				"body": "> [fahrenheit451](#comment_4_1A2AJCxA3n4QjikssyECqWMk8xBYniBpWa): O Céu É de Verdade - o Impressionante Relato do Menino Que Foi Ao Céu e Voltou Para Contar\n> O céu é de verdade conta a história real de Colton, um menino que, aos quatro anos, quando passava por uma cirurgia de emergência, viveu uma experiência inusitada: seu espírito foi transportado ao céu, onde viu coisas extraordinárias, inclusive o trono do próprio Deus. O garoto também assistiu aos procedimentos médicos e viu o pai orando na sala de espera. No primeiro momento, a família agiu com incredulidade diante do relato, mas logo as evidências de que o menino falava a verdade se tornaram claras — Colton conheceu a irmã que fora abortada, segredo guardado a sete chaves pela família. Narradas por seu pai, mas frequentemente nas palavras do próprio Colton, as experiências relatadas em O céu é de verdade revelam a realidade e a esperança do Paraíso e do Criador.\n> \n> Download: https://anonfiles.com/d24579r4bc/O_Ceu_e_de_Verdade_-_Todd_Burpo_pdf\n> SHA-256: 94aa785738bbc3ddd12e649e3f9aaf14508ae49a1b0d5ba186ac4d98e77ea5be\n\n#[Akiane Kramarik](https://akiane.com/)\n\nAkiane Kramarik (Ilinóis, 9 de Julho de 1994) é uma artista, poetisa e criança prodígio nascida nos Estados Unidos.\n\nSendo, inicialmente, uma autodidata em pintura artística, Kramarik começou a desenhar aos quatro anos de idade, pinta desde os seis e compõe poesias desde os seus sete anos. Seu primeiro autorretrato foi vendido por dez mil dólares.\n\n#Como ela mesma diz, sua arte é inspirada nas visões do céu, bem como em sua ligação com o Criador, a qual costuma incluir paisagens, vida selvagem, pessoas.\n\nUma das suas pinturas mais conhecidas, é uma pintura chamada \"Príncipe da Paz\": um retrato de Jesus que Akiane pintou quando tinha 8 anos.\n\nE isso, supostamente, foi inspirado nas verdadeiras feições de Jesus.\n\n#Curiosamente, essa imagem de Jesus coincidiu com a visão de Jesus que Colton Burpo teve. Quando Colton viu pela primeira vez a pintura de Akiane, ele afirmou que o rosto de Jesus era o mesmo que ele havia visto durante a sua suposta visita ao Paraíso. \n\n- Pintura \"Príncipe da Paz\": https://web.archive.org/web/20180506035552if_/https://akiane.com/wp-content/uploads/2016/09/HiRes-PrinceOfPeace.jpg?x92557",
				"added": 1548359147
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 6,
				"body": "#Amados, não creiam em qualquer espírito, mas examinem os espíritos para ver se eles procedem de Deus, porque muitos falsos profetas têm saído pelo mundo.\n#Vocês podem reconhecer o Espírito de Deus deste modo: todo espírito que confessa que Jesus Cristo veio em carne procede de Deus;\n#mas todo espírito que não confessa a Jesus não procede de Deus. Esse é o espírito do anticristo, acerca do qual vocês ouviram que está vindo, e agora já está no mundo.\nFilhinhos, vocês são de Deus e os venceram, porque aquele que está em vocês é maior do que aquele que está no mundo.\nEles vêm do mundo. Por isso o que falam procede do mundo, e o mundo os ouve.\n#Nós viemos de Deus, e todo aquele que conhece a Deus nos ouve; mas quem não vem de Deus não nos ouve. Dessa forma reconhecemos o Espírito da verdade e o espírito do erro.\n#Amados, amemo-nos uns aos outros, pois o amor procede de Deus. Aquele que ama é nascido de Deus e conhece a Deus.\n#Quem não ama não conhece a Deus, porque Deus é amor.\nFoi assim que Deus manifestou o seu amor entre nós: enviou o seu Filho Unigênito ao mundo, para que pudéssemos viver por meio dele.\nNisto consiste o amor: não em que nós tenhamos amado a Deus, mas em que ele nos amou e enviou seu Filho como propiciação pelos nossos pecados.\n#Amados, visto que Deus assim nos amou, nós também devemos amar-nos uns aos outros.\nNinguém jamais viu a Deus; se nos amarmos uns aos outros, Deus permanece em nós, e o seu amor está aperfeiçoado em nós.\nSabemos que permanecemos nele, e ele em nós, porque ele nos deu do seu Espírito.\nE vimos e testemunhamos que o Pai enviou seu Filho para ser o Salvador do mundo.\nSe alguém confessa publicamente que Jesus é o Filho de Deus, Deus permanece nele, e ele em Deus.\nAssim conhecemos o amor que Deus tem por nós e confiamos nesse amor. Deus é amor. Todo aquele que permanece no amor permanece em Deus, e Deus nele.\nDessa forma o amor está aperfeiçoado entre nós, para que no dia do juízo tenhamos confiança, porque neste mundo somos como ele.\nNo amor não há medo; pelo contrário o perfeito amor expulsa o medo, porque o medo supõe castigo. Aquele que tem medo não está aperfeiçoado no amor.\nNós amamos porque ele nos amou primeiro.\nSe alguém afirmar: \"Eu amo a Deus\", mas odiar seu irmão, é mentiroso, pois quem não ama seu irmão, a quem vê, não pode amar a Deus, a quem não vê.\n#Ele nos deu este mandamento: Quem ama a Deus, ame também seu irmão.\n\n- 1 João 4:1-21",
				"added": 1548359665
			},
			{
				"comment_id": 7,
				"body": "#\"Não se perturbe o coração de vocês. Creiam em Deus; creiam também em mim.\nNa casa de meu Pai há muitos aposentos; se não fosse assim, eu lhes teria dito. Vou preparar-lhes lugar.\nE se eu for e lhes preparar lugar, voltarei e os levarei para mim, para que vocês estejam onde eu estiver.\nVocês conhecem o caminho para onde vou\".\n#Disse-lhe Tomé: \"Senhor, não sabemos para onde vais; como então podemos saber o caminho? \"\n#Respondeu Jesus: \"Eu sou o caminho, a verdade e a vida. Ninguém vem ao Pai, a não ser por mim.\n#Se vocês realmente me conhecessem, conheceriam também o meu Pai. Já agora vocês o conhecem e o têm visto\".\n#Disse Filipe: \"Senhor, mostra-nos o Pai, e isso nos basta\".\n#Jesus respondeu: \"Você não me conhece, Filipe, mesmo depois de eu ter estado com vocês durante tanto tempo? Quem me vê, vê o Pai. Como você pode dizer: ‘Mostra-nos o Pai’?\n#Você não crê que eu estou no Pai e que o Pai está em mim? As palavras que eu lhes digo não são apenas minhas. Pelo contrário, o Pai, que vive em mim, está realizando a sua obra.\nCreiam em mim quando digo que estou no Pai e que o Pai está em mim; ou pelo menos creiam por causa das mesmas obras.\n#Digo-lhes a verdade: Aquele que crê em mim fará também as obras que tenho realizado. Fará coisas ainda maiores do que estas, porque eu estou indo para o Pai.\n#E eu farei o que vocês pedirem em meu nome, para que o Pai seja glorificado no Filho.\n#O que vocês pedirem em meu nome, eu farei\".\n#\"Se vocês me amam, obedecerão aos meus mandamentos.\n#E eu pedirei ao Pai, e ele lhes dará outro Conselheiro para estar com vocês para sempre,\n#o Espírito da verdade. O mundo não pode recebê-lo, porque não o vê nem o conhece. Mas vocês o conhecem, pois ele vive com vocês e estará em vocês.\nNão os deixarei órfãos; voltarei para vocês.\nDentro de pouco tempo o mundo já não me verá mais; vocês, porém, me verão. Porque eu vivo, vocês também viverão.\nNaquele dia compreenderão que estou em meu Pai, vocês em mim, e eu em vocês.\n#Quem tem os meus mandamentos e lhes obedece, esse é o que me ama. Aquele que me ama será amado por meu Pai, e eu também o amarei e me revelarei a ele\".\n#Disse então Judas ( não o Iscariotes ): \"Senhor, mas por que te revelarás a nós e não ao mundo? \"\n#Respondeu Jesus: \"Se alguém me ama, guardará a minha palavra. Meu Pai o amará, nós viremos a ele e faremos nele morada.\n#Aquele que não me ama não guarda as minhas palavras. Estas palavras que vocês estão ouvindo não são minhas; são de meu Pai que me enviou.\n\"Tudo isso lhes tenho dito enquanto ainda estou com vocês.\n#Mas o Conselheiro, o Espírito Santo, que o Pai enviará em meu nome, lhes ensinará todas as coisas e lhes fará lembrar tudo o que eu lhes disse.\nDeixo-lhes a paz; a minha paz lhes dou. Não a dou como o mundo a dá. Não se perturbem os seus corações, nem tenham medo.\n\"Vocês me ouviram dizer: Vou, mas volto para vocês. Se vocês me amassem, ficariam contentes porque vou para o Pai, pois o Pai é maior do que eu.\nIsso eu lhes disse agora, antes que aconteça, para que, quando acontecer, vocês creiam.\nJá não lhes falarei muito, pois o príncipe deste mundo está vindo. Ele não tem nenhum direito sobre mim.\nTodavia para que o mundo saiba que amo o Pai e que faço o que meu Pai me ordenou. Levantem-se, vamo-nos daqui! \"\n\nJoão 14:1-31",
				"added": 1548360037
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 8,
				"body": "#Gosick\nA história de GOSICK acontece no ano de 1924 em uma pequena nação européia, a fantasiosa Saubure. O anime se concentra em Kazuya Kujo, o terceiro filho de um Soldado Imperial Japonês, que está estudando por intercâmbio na Academia Santa Margarida, onde as lendas urbanas e histórias de terror são assunto comum. Lá ele conhece a Victorique, uma garota linda e misteriosa que nunca aparece nas aulas e passa todo o seu tempo na biblioteca, devorando todos os livros ou resolvendo mistérios que os detetives não conseguem resolver. Acompanhem Kujo e Victorique enquanto eles se esforçam para resolverem todo o tipo de mistério assustador.\n\n- https://www.superanimes.site/anime/gosick",
				"added": 1548361234
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 9,
				"body": "#Conscientização sobre a Segurança da Informação\nEsta apresentação aborda os principais tópicos de Segurança da Informação com o intuito de conscientizar os usuários de internet sobre os riscos que estão expostos e os cuidados que devem ter dentro ou fora de uma empresa.\n\nUm conteúdo ideal para a realização de palestras sobre segurança.\n\n- https://web.archive.org/web/20181228041209/http://www.100security.com.br/downloads/100security.pdf",
				"added": 1548361307
			},
			{
				"comment_id": 12,
				"body": "#Websites devem usar o HSTS para garantir a segurança\nHSTS significa HTTP Strick Transport Security, essa tecnologia não é nova, ela já vem sendo desenvolvida desde 2010. O HSTS foi criado para permitir que sites possam se declarar acessíveis apenas de forma segura utilizando o protocolo HTTPS, isto ajuda a minimizar problemas que ocorrem nos sites mistos que oferecem tanto acesso HTTP quanto HTTPS. Neste tipo de site, normalmente ocorre um redirect para HTTPS no primeiro acesso do usuário.\n\nSites mistos sofrem devido a falhas de implementação do HTTPS ou dos desenvolvedores, este tipo de coisa ocorre primeiro pois o HTTPS é protocolo antigo, já tem mais de 18 anos, e claro que não previu em sua criação a maioria dos cenários de internet que temos hoje. O outro problema são os desenvolvedores que nem sempre seguem as boas práticas de desenvolvimento e segurança.\n\nDevido ao uso misto de HTTP e HTTPS em alguns sites, atacantes podem explorar brechas de implementação e tentar então comprometer estes sites.\n\n- https://www.eff.org/deeplinks/2014/02/websites-hsts",
				"added": 1548368462
			},
			{
				"comment_id": 16,
				"body": "#[SecurityCast] WebCast #59 - Como ficar anônimo na Internet usando ferramentas\n- https://youtu.be/XR1Gco0c5Rk",
				"added": 1548378987
			},
			{
				"comment_id": 17,
				"body": "\"Total\" Anonimato com VPN no Kali Linux [Fácil]\n- https://youtu.be/NtkQ-2vV3oU",
				"added": 1548379087
			},
			{
				"comment_id": 18,
				"body": "#Camuflando IP com SoftEther VPN Gate - Fábrica de Noobs\n- https://youtu.be/d-2LKCAW7es\n- GitHub: https://github.com/SoftEtherVPN/SoftEtherVPN.git",
				"added": 1548379151
			},
			{
				"comment_id": 19,
				"body": "#Redes da Deep Web\nTutoriais de acesso para as principais redes da Deep Web.\n\n- https://www.youtube.com/playlist?list=PLIevgZoV2cAgMYes2vNpoChDsKXPzxGTM",
				"added": 1548379286
			},
			{
				"comment_id": 20,
				"body": "#Encriptar arquivos com GnuPG no Linux \n- https://youtu.be/LbO9pPiyslo",
				"added": 1548379699
			},
			{
				"comment_id": 21,
				"body": "#Como esconder arquivos no computador com o VeraCrypt\nConheça o VeraCrypt, uma ferramenta que permite que você crie volumes criptografados no seu computador, pen drives criptografados e até partições e discos inteiros.\n\n- https://youtu.be/v1AlnuB8Jcs",
				"added": 1548379857
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 10,
				"body": "#O CÉU É DE VERDADE\nTodd Burpo (Greg Kinnear) é o pastor de uma igreja em Nebraska, que conta com uma congregação bastante fiel. Casado com Sonja (Kelly Reilly), ele enfrenta uma situação complicada quando seu filho, Colton (Connor Corum), precisa ser operado às pressas devido a uma apendicite. Após se recuperar, o garoto diz ao pai que anjos vieram cantar para ele durante a operação. Todd pergunta mais sobre a experiência e fica espantado quando Colton lhe diz que viu situações que ocorreram quando o garoto não estava desperto. Convicto de que o filho visitou o paraíso, Todd passa a questionar sua própria fé naquilo que pregava até então.\n\n- https://ok.ru/video/43097721486",
				"added": 1548367592
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 11,
				"body": "#Chromium\nO Chromium é um projeto de navegador da Web de código aberto iniciado pelo Google, para fornecer o código-fonte para o navegador Google Chrome proprietário.\n- https://github.com/chromium/chromium.git",
				"added": 1548367834
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 13,
				"body": "#WISDOM OF THE CROWD\nApós o assassinato de sua própria filha, o inovador tecnológico Jeffrey Tanner (Jeremy Piven) cria um centro de crowdsourcing de ponta a fim de desvendar o mistério acerca do crime que tirou a vida dela. Do seu projeto também pode vir a solução de outros casos ocorridos na cidade de São Francisco, nos Estados Unidos.\n- https://megaseriehd.com/series/wisdom-of-the-crowd/",
				"added": 1548369529
			},
			{
				"comment_id": 14,
				"body": "#O JUSTICEIRO\nO crime não dura quando Frank Castle está por perto. O veterano de guerra é impiedoso na sua guerra contra malfeitores, alimentada pelo ódio gerado quando sua família foi pega no fogo cruzado durante um tiroteio entre mafiosos.\n\n- https://megaseriehd.com/series/marvel-o-justiceiro/",
				"added": 1548369801
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 15,
				"body": "#Charlie Shrem diz que somente o Bitcoin pode sobreviver à uma guerra nuclear\n- https://www.criptomoedasfacil.com/charlie-shrem-diz-que-somente-o-bitcoin-pode-sobreviver-a-uma-guerra-nuclear/",
				"added": 1548370490
			}
		]
	},
	"comment_vote": {
		"3_1Migqh7ByHiWFh2qktJX7hHva3rCrmdnEE": 1,
		"12_1A2AJCxA3n4QjikssyECqWMk8xBYniBpWa": 1,
		"10_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1
	}
}