{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Serval Mesh",
			"body": "[Serval Mesh](http://developer.servalproject.org/dokuwiki/doku.php?id=content:servalmesh:main_page) é um aplicativo para Android que fornece rede em malha altamente segura, chamadas de voz, mensagens de texto e compartilhamento de arquivos entre telefones celulares usando Wi-Fi, sem a necessidade de um SIM ou qualquer outra infraestrutura, como torres de celular, pontos de acesso Wi-Fi ou Internet Acesso.\n\n- GitHub: https://github.com/servalproject\n\n#APK: \n- https://web.archive.org/web/20171104064141/http://developer.servalproject.org/files/Serval_Mesh-0.93.apk\n- https://swarm-gateways.net/bzz:/8f0b5ee99bc67da24b0e060b7c1912eb1284730714158d8401e66946827e0563/Serval_Mesh-0.93.apk\n\nSHA-256: 9ccc3ccc084a7a4e0566ad0f9bdfe1e46027f5eb83d4d10002abdd752b7ddf84",
			"added": 1586717284
		}
	],
	"topic_vote": {
		"8_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": 1,
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": 1,
		"1_15Kc28L45CwtxdgZAHVsdps3FAdR8duodE": 1,
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": 1
	},
	"next_comment_id": 8,
	"comment": {
		"8_1Fq63vG8QieyxsBj1oEgBYoS2WYufkNfxu": [
			{
				"comment_id": 1,
				"body": "#Rede Darknet\n- https://swarm-gateways.net/bzz:/aed986f9cce0997978cf6acfe1cd83bed9e77eccba35b26d4101120240fa7b75/darknet_network.pdf",
				"added": 1586711141
			}
		],
		"1_1DJf8DgxdWYpZ1GMguWfX6mPGybGtjA5Sv": [
			{
				"comment_id": 2,
				"body": "#Criptomoedas | Blockchain\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd/Criptomoedas+Blockchain",
				"added": 1586711556
			},
			{
				"comment_id": 3,
				"body": "#Projeto na Venezuela desenvolve conexão para a rede do Bitcoin baseada em ondas de rádio\n- O projeto venezuelano Locha Mesh está desenvolvendo dispositivos para garantir que regiões atingidas pela crise possam usar criptomoedas em tempos de escassez de internet e eletricidade.\n\nUma equipe venezuelana está desenvolvendo o Locha, uma rede descentralizada que não depende da internet para fazer transações com Bitcoin (BTC). O sistema, baseado em ondas de rádio, nasceu em resposta a frequentes interrupções de eletricidade e internet na Venezuela.\n\nO Locha Mesh é um projeto de código aberto liderado por Randy Brito, membro da organização Bitcoin Venezuela.\n\nA empresa está desenvolvendo dois dispositivos, chamados Turpial e Harpia, que [permitiriam](https://web.archive.org/web/20200117065525/https://twitter.com/randybrito/status/1217985415556345857) a qualquer pessoa se conectar à blockchain do Bitcoin usando ondas de rádio de longo alcance. Turpial é a versão mais simples do transmissor de rádio, que funciona em distâncias de um a dois quilômetros nas áreas urbanas. O Harpia é um módulo de rádio mais limitado para uso em computadores pequenos, como um Raspberry Pi.\n\nAmbos os dispositivos foram desenvolvidos para serem portáteis e operar com energia da bateria. Sua aplicação não se limita ao BTC - qualquer outra blockchain como a do Monero pode ser integrada ou até mesmo sistemas de mensagens e transferência de arquivos como o [IPFS](https://ipfs.io/).\n\n#Alternativa realista para a Internet\nOs dispositivos Locha Mesh funcionam fornecendo um método alternativo de transferência de dados para a Internet.\n\nSeu principal caso de uso é para situações críticas, como na Venezuela e no Irã, onde problemas de infraestrutura ou restrições governamentais geralmente [levam](https://web.archive.org/web/20191126051521/https://www.cnet.com/news/irans-internet-has-been-shut-down-for-days-amid-protests/) a longas interrupções na Internet.\n\nMas, embora a incapacidade física para realizar transações seja um aspecto, a resistência à censura é outro. Brito elaborou uma [discussão](https://repo.getmonero.org/monero-project/ccs-proposals/merge_requests/115) com os membros da comunidade Monero:\n\n- “Estamos criando algo para as situações em que você não tem Internet, devido à falta de infraestrutura, censura direcionada ou caso deseje manter-se anônimo, para não expor seu endereço IP de casa / telefones vinculados à sua identidade. \"\n\nApesar de vender seus próprios dispositivos, a Locha [visa](https://github.com/btcven/locha.git) tornar possível para os entusiastas da tecnologia recriarem um transmissor compatível com malha. O software é de código aberto e acessível a todos.\n\n#Desafios da adoção\nUma fraqueza existente da proposta da Locha Mesh é que ela ainda requer acesso à Internet em algum momento da rede para se conectar aos nós mundiais de criptomoedas. Embora, mesmo durante o desligamento da Internet no Irã, alguns tenham permanecido conectados à rede mundial, não está claro se uma rede Locha permaneceria funcional.\n\nFalando ao Cointelegraph, Brito explicou que a rede não dependeria necessariamente de nós conectados à Internet via telefone fixo. Usuários com antenas parabólicas também seriam capazes de atuar como gateways e retransmitir os dados dentro da malha Locha.\n\nQuando perguntado se os usuários em países em crise como a Venezuela poderiam comprar e acessar o dispositivo, Brito respondeu:\n\n- “Não esperamos que o preço seja tão alto, nosso objetivo é tornar o dispositivo Turpial o mais portátil e acessível possível. Será possível comprá-los de qualquer país, em locais onde não pode ser enviado, teremos muita documentação para que as pessoas possam criar seus próprios e talvez algumas pessoas desejem colocar alguns de nossos dispositivos Turpial nesses lugares pode não ser capaz de alcançar a nós mesmos. \"\n\nNo entanto, o progresso da equipe ainda é lento. Espera-se que um dispositivo pronto para produção seja concluído até o segundo trimestre de 2020, após o qual se espera um atraso adicional na configuração da fabricação. A equipe está atualmente buscando financiamento, com Brito observando que recursos adicionais acelerariam o desenvolvimento:\n\n- “Achamos que sim. Com mais financiamento, poderíamos chegar a um hardware e software prontos para produção mais cedo, assim como pudemos obter nossas próprias revisões de hardware e os firmwares de software necessários com os investimentos e doações que recebemos ao longo 2019. ”\n\nFonte: https://cointelegraph.com.br/news/venezuelan-team-working-on-bitcoin-mesh-network-based-on-offline-radios",
				"added": 1586711974
			},
			{
				"comment_id": 4,
				"body": "#Inventor cria rede de dados de longa distância usando o rádio amador e IPv4!\n\n- Ele conseguiu enviar dados via IPv4 até 300 quilômetros com hardware fácil de montar!\n\nUm inventor conseguiu criar uma rede de dados de longa distância usando o famoso e antigo rádio amador. Segundo F4HDK, codinome do inventor, ele gosta de criar coisas a pelo menos 15 anos. Assim, ele revela que estava analisando um protocolo chamado de NBP, que é utilizado para criar rede de dados através de links de rádio amador.\n\nO NBP foi desenvolvido por volta do ano 2000, a ideia de sua criação foi de substituir o protocolo AX.25, que era usado em links digitais até a década de 1980. Então, o F4HDK descobriu que poderia criar um protocolo ainda melhor, com um design moderno, mais fácil e barato de implementar fisicamente.\n\nO resultado disso foi o NPR (New Packet Radio). O novo protocolo suporta IPv4 da internet, e permite que os dados sejam transmitidos a uma velocidade de 500 Kbps. Para isso, ele também precisa utilizar a banda de rádio amador UHF de 70 centímetros. Ele confessa que 500 Kbps não é tão rápido se comparado as grandes empresas, mas é uma iniciativa barata e fácil.\n\nInicialmente, ele considerou utilizar diferentes bandas de frequência para as conexões de uplink e downlink: os downlinks teriam usado o padrão DVB-S, originalmente desenvolvido para televisão digital por satélite. Os uplinks usariam uma variação do FSK (chaveamento com mudança de frequência) para codificar dados.\n\nMas, a complexidade envolvida na sincronização do uplink e do downlink era muito alta. Então ele resolveu usar um rádio equipado com um FPGA (field-programmable gate array). Note que no relato, ele conta que já tinha alguma experiência com FPGAs, graças a um projeto anterior, no qual havia implementado uma CPU personalizada completa usando um FPGA do Altera Cyclone 4. O objetivo era fazer toda a modulação e desmodulação usando o FPGA, mas novamente o método era muito complexo. E conta que perdeu quase dois anos perseguindo essas idéias até perceber que não tinha mais o que fazer.\n\nEntão, em um daqueles momentos “porque eu não pensei nisso antes”, ele lembrou dos chips ISM (industrial, científico e médico). Esses são transceptores projetados para operar em faixas estreitas de frequência de rádio que foram originalmente alocadas para fins de não comunicação, como aquecimento por RF.\n\nNo entanto, a banda ISM também se tornou popular nas comunicações, porque normalmente não é necessária uma licença para seu uso. Na África, Europa e Norte da Ásia, há uma banda ISM dentro da faixa de 70 cm de radioamadorismo a 434 megahertz; portanto, os chips comerciais ISM estão disponíveis para essa frequência.\n\n\nE assim, ele resolveu construir o seu hardware em torno do transceptor IS4463 [PDF] ISM: que segundo ele, é barato, flexível e disponível em muitos módulos e placas, e pode lidar com uma taxa de dados brutos de até 1 megabyte por segundo. Ele foi projetado para aplicações de curto alcance, que não é grande coisa mas funciona.\n\nPara alcançar distâncias razoáveis, você precisa de um amplificador para fornecer mais potência de RF. Para o seu plano NPR, ele precisava de um amplificador que também pudesse alternar rapidamente entre transmitir e receber. Encontrou alguns amplificadores externos de 20 watts amplamente disponíveis para rádios de mão projetados para o padrão DMR (Digital Mobile Radio) desenvolvido na Europa. No padrão DMR, o equipamento de rádio deve ser capaz de lidar com um ciclo completo de transmissão/recepção dentro de 60 milissegundos. Estabeleceu um tempo de ciclo mínimo de 80 ms para a NPR com esse objetivo em mente.\n\nO transceptor ISM está conectado a um microcontrolador Mbed Nucleo STM32 L432KC, que usa uma CPU Arm Cortex.\n\nEste microcontrolador, por sua vez, está conectado a uma interface Ethernet e cuida de todos os detalhes da execução do protocolo NPR. Qualquer PC ou rede conectado vê o link de rádio como apenas outra conexão IPv4 sem a necessidade de instalar um software NPR específico.\n\nO modem NPR pode ser configurado através deste link ou através de uma conexão USB. O custo total do hardware é de cerca de US $ 80, e um parceiro, a Funtronics, disponibilizará kits para compra on-line. Se você deseja construir um modem do zero, instruções detalhadas e o software do protocolo NPR estão disponíveis na página do projeto Hackaday.\n\nO protocolo NPR é baseado em um modelo de hub e spoke, no qual um modem central vincula vários modems clientes. Atualmente, pode haver até sete modems, embora há planos de expandir isso para 15.\n\nA distância máxima teórica entre um modem cliente e o modem central é de 300 quilômetros. Esse limite surge porque o NPR usa uma técnica gerenciada de acesso múltiplo por divisão de tempo (TDMA), na qual o modem central e os clientes transmitem na mesma frequência, mas em momentos diferentes, com o modem central determinando quando cada cliente pode transmitir e fazendo ajustes de agendamento para levar em conta atrasos devido à distância. O ciclo completo de transmissão/recepção está entre 80 ms e 200 ms, dependendo do tipo exato de modulação e taxa de dados escolhida.\n\nA criação do protocolo NPR foi uma parte muito divertida do projeto para ele: a ideia de poder decidir como os dados devem ser compactados e organizados dentro dos quadros de rádio e como os modems NPR devem interagir entre si foi extremamente nostálgica.\n\nMas depois de mais dois anos, era hora dele parar de trabalhar sozinho, então compartilhou a NPR com a sua comunidade local de rádio amador na França. No final de 2018, começaram a testá-lo no mundo real e em pleno funcionamento.\n\nJá alcançaram distâncias superiores a 80 km e agora estão recebendo ajuda da comunidade amadora global, especialmente na Alemanha. Atualmente, o NPR está sendo usado para acessar redes locais de rádio amador de alta velocidade existentes em locais que não podem ter os links necessários para os sinais de 2,4 e 5,6 gigahertz.\n\nEmbora seja utilizável, ele diz que é o primeiro a admitir que a NPR é uma tecnologia jovem e provavelmente precisa amadurecer mais. Além de aumentar o número de clientes que podem ser suportados por um modem central, ele ainda tem várias melhorias em mente, como adicionar suporte à priorização de QoS (qualidade de serviço), para que o NPR possa ser usado para transmitir voz digital; permitindo que os quadros Ethernet sejam transportados diretamente; e separando frequências de downlink e uplink.\n\n- Fonte: https://web.archive.org/web/20200412172102/https://sempreupdate.com.br/inventor-cria-rede-de-dados-de-longa-distancia-usando-o-radio-amador-e-ipv4/",
				"added": 1586712277
			},
			{
				"comment_id": 6,
				"body": "#Serval Mesh\n- http://127.0.0.1:43110/1LULE6frq3kw2vbhe4i6ArUTo4YT99Czbj/?Topic:1_15Kc28L45CwtxdgZAHVsdps3FAdR8duodE/Serval+Mesh",
				"added": 1586719614
			}
		],
		"1_15Kc28L45CwtxdgZAHVsdps3FAdR8duodE": [
			{
				"comment_id": 5,
				"body": "#Briar\n- https://briarproject.org/\n- https://code.briarproject.org/briar/briar.git\n\nBriar é um aplicativo de mensagens desenvolvido para ativistas, jornalistas e qualquer pessoa que precise de uma maneira segura, fácil e robusta de se comunicar. Ao contrário dos aplicativos de mensagens tradicionais, o Briar não depende de um servidor central - as mensagens são sincronizadas diretamente entre os dispositivos dos usuários. Se a Internet estiver inoperante, o Briar pode sincronizar via Bluetooth ou Wi-Fi, mantendo as informações fluindo em uma crise. Se a internet estiver ativa, o Briar pode sincronizar através da rede Tor, protegendo os usuários e seus relacionamentos da vigilância.",
				"added": 1586718949
			}
		],
		"3_1JENLe77ZY3BqSQEDkQ4iVNh5o21ipdXH9": [
			{
				"comment_id": 7,
				"body": "#The Pirate Bay na rede [Onion](https://www.torproject.org/): http://piratebayztemzmv.onion/",
				"added": 1586720855
			}
		]
	},
	"comment_vote": {}
}