{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1581620394,
			"title": "Tox thread and NetTalk group chat, share IDs, make friends and love life",
			"body": "[Tox](https://tox.chat/) is a p2p message protocol with several client implementations. Some fact about it:\n1. It is secure and decentralized. It supports text chat, group chat, audio, video and file transfers;\n2. It supports tunneling through tor;\n3. The p2p part uses DHT and asymmetric encryption;\n4. On the lower level users are identified by a hash like string but you can use naming servers to get a name like \"lala@toxme.io\";\n5. I used to think it was an abandoned project but it actually only went through a friendly fork and now is being developed by [TokTok](https://toktok.ltd/index.html);\n6. It's probably available on your distros repositories, search for \"qtox\", the main GUI desktop client. \n\nIn this thread we share our tox ids and a list of interests:\nMy ID: D8694C15E1CA4D492F2C01F10DC792D5985BC1FBE469023DF0835906188B0D6AC9F2A518E64A\nInterests: \nTechnology in general but mainly programming, AI, data science, free software and privacy;\nMath/Statistics and science;\nLanguage learning, French ATM.\n\nI created a NetTalk tox group. Add me and ask to be put into it if you want to.",
			"added": 1581620393
		},
		{
			"topic_id": 1603487455,
			"title": "youtube-dl taken down by DMCA (backups provided)",
			"body": "See for yourselves: https://github.com/ytdl-org/youtube-dl/releases/download/2020.09.20/youtube-dl-2020.09.20.tar.gz\n\nI made a IFS mirror, it has the pypi wheel (installation file), the tar.gz (that you can just extract and run) and the git repo.\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_15cApprVFcr1skAkWssq5aAXKa7pDwJJve_item_2+type:archive\n\nPlease toggle: \"Help distribute added optional files\" to help distribute the files.\n\nUPDATE: @youtube-dl put it on git center: http://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1CXohM8XBz3mUGUR8w9CYXqdYt5JzfoPfi",
			"added": 1603487453
		},
		{
			"topic_id": 1603603506,
			"title": "How to find out which user signed a zite?",
			"body": "What fields do I look for in the contents.json and user.json to?",
			"added": 1603603503
		}
	],
	"topic_vote": {
		"1585210798_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1520866054_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_122_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): is it easy not to be scammed on that site? I am aware that in my country inter-bank payments can be reversed..Btw, per their TOS they may also require identity documents once users pass certain trade volume limits, during trade disputes, fraud investigations, and to ensure account ownership. [...]\n\nYour country might have  a localbitcoin clone. I use mine's. TOS might differ then.\nYou could get around those limitations by using multiple accounts and trading small volumes at a time. In fact, you should always trade small volumes at a time.\n\nI looked into bisq some time ago. I don't remember why I didn't use but it seems fine.\n\nPS.: Check if whichever service you are using has support for multisig escrow.",
				"added": 1581619309
			},
			{
				"comment_id": 2,
				"body": "I just tried to login into localbitcoins.com and they are asking for my full name and phone number. I guess I will start using bisq.",
				"added": 1581635279
			},
			{
				"comment_id": 3,
				"body": "Thanks. I will check those links and I will post my opinion on bisq after I use it.\nBut beware that they mention in the FAQ and the dispute resolution guidelines that they may require identifying information to resolve disputes.",
				"added": 1581696050
			},
			{
				"comment_id": 4,
				"body": "Rant: \nIdk what goes through people's head. It must be shit.\nBanks ask for a shit load of personal information because they are highly regulated and they can give you loans and a credit card. It amazes me how anyone can think it's reasonable to give all that information to a literally-who that runs a website from the other side of the world.\nHolly shit it's shear stupidity.\nAs my mom used to say: \"Don't give any personal information on the Web. You can never really know who is on the other side.\"",
				"added": 1581696392
			},
			{
				"comment_id": 8,
				"body": "You can actually run a full bitcoin node on modest hardware. I synced in a few days with a mobile i3 from 2012, 4GB of ram and a SSD.\nThe bottleneck to syncing is IO, not CPU. All you need is an SSD or preferably a ramdisk.\nSince the blockchain is over 200GB you will probably want to prune it. You can prune it down up to 550MB. The most important directories that should be either on the SSD or the ramdisk are `blocks/index` and `chainstate`.\nI don't think chainstate went over 4GB during my sync. `blocks/index` is like 100MB.\n\nAfter the initial sync catching up is fast. If you only re sync once a week it should take less than 30 minutes.",
				"added": 1586127449
			},
			{
				"comment_id": 9,
				"body": "> [ssdifnskdjfnsdjk](#comment_131_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): 40% drop in Bitcoin price: https://www.blockchain.com/charts/market-price?timespan=all [...]\n\nI'm planning on doing the same soon.",
				"added": 1586127769
			}
		],
		"1581620394_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 5,
				"body": "There are but I'm not comfortable with inviting people to groups I didn't create myself or that are not explicitly public.\nI can put you in the NetTalk group if you want.",
				"added": 1581696773
			},
			{
				"comment_id": 6,
				"body": "> [sdfsdgasdew](#comment_1_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du): accept my adding request\n\nSorry. I've been offline for a while. Your request is not showing up, try sending it again.",
				"added": 1586126731
			}
		],
		"1585233010_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 7,
				"body": "It would be nice to a good have a privacy respecting site. Neither google, yandex or bing work well with tor. I think tinyeye is not privacy respecting and gives bad results in general. Idk about infrigement.report but my hopes are not high.",
				"added": 1586126919
			}
		],
		"1603487455_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": [
			{
				"comment_id": 10,
				"body": "> [claude](#comment_2_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): only a matter of time before youtube tweaks their DMCA and all the current copies of youtube-dl become useless. might as well download while one can\n\nYou mean their API? Youtube-dl works for other sites too.\n\n> [slondrex](#comment_1_1AMDCwJEDNWWiP3KVp5M9vCCaj91tefBbB): Has the project itself said what they're doing next?\n\nNot that I'm aware of.",
				"added": 1603599350
			},
			{
				"comment_id": 11,
				"body": "It seems they have not given up: https://yt-dl.org/",
				"added": 1603651904
			}
		],
		"1532695200_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 12,
				"body": ">No victim was named at trial.\nDidn't he put a hit on someone?",
				"added": 1604955296
			},
			{
				"comment_id": 13,
				"body": "I'm not disputing that they were making an example of him and that prohibiting drugs is wrong.",
				"added": 1604955451
			}
		]
	},
	"comment_vote": {}
}