{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Ceci est le futur !!!",
			"body": "Ce qui est le plus génial c'est que méme finalment le projet est avorté et bien tant que des gens utiliseront zeronet il fonctionnera toujours, \nC'est sidérant mais j'imagine que c'est pas google qui voudrait mettre ce genre de techno au main de monsieur tout le monde d'autant plus qu'on ne peut pas censuré de site, \nMais même si il sont limité en taille 10Mo c'est plus que suffisant et si il en faut plus bah il n'y a qu'a en crée un nouveaux. voici mon point de vue",
			"added": 1457882036
		},
		{
			"topic_id": 2,
			"title": "Pourquoi ZeroNet C'Est Bien ? !!!",
			"body": "1.Décentralisé - Bon la c'est évidant ce mot apparaît partout sur le site de ZN, Le bon coté de ça, C'est impossible a censuré par la je veut dire qu'on peut pas fermé le site.\n\n2.Pas Hébergeur - Tout le monde peut crée et partagé son site gratuitement, Juste besoin de savoir codé ou pas forcement, y a qu'a cloné un site existant.\n\n3.Pas Ou Peu De Pub - Et ouais pas d’hébergeur donc rien a payé donc pas de pub.\n(note: je n'en ait pas vue une seul, mais il y en a peut-être).\n\n4.Compte Unique  Et Pas De MDP- Avec un unique compte(ZeroID) on peut interagir avec n’importe quelle site si le programmer l'a intégré, fini les demande de confirmation par e-mail.\n\nDoit y en avoir plein d'autres que j'ai oublié, Donc donnez moi des point qui pour vous font que ZN c'est génial. ",
			"added": 1457950228
		}
	],
	"topic_vote": {
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1_1HFyoddmyycAJAngDpX5k4fSKCwf6zqukE": [
			{
				"comment_id": 1,
				"body": "faut pas abusé tu t'imagine seedé un site de 5Go avec 2Go dans to cache xDDD, parcontre si ça devient populaire ça vas etre la foire au virus/fishing et autre connerie, parceque a bien reflechire ZeroNet c'est un genre de DarkWeb qu'on ne peut pas bloqué et qui est la a la vue du grand public, j'imagine les dérive du genre du site de vente de marchandise illegal.\nPar contre j’attend avec impatient un blog de tuto Hacking ou un site genre WikiLeaks ce serait genial,\nFinalement vue dans quel sans vas le monde, NSA , la france qui censure des site sans recour penal et tout ses connerie,  \nJe pense que zeronet est arrivé au bon moment.",
				"added": 1457883026
			}
		],
		"4_1MEWJRMLgvofqG9Mbsb2Rc4hFFyv7HeRx7": [
			{
				"comment_id": 2,
				"body": "moi 10 seconds, mais le cpu n'a rien avoir avec la vitesse XDDD, c'est le debit internet et la carte reseau.",
				"added": 1457890888
			}
		]
	},
	"comment_vote": {}
}