{
	"next_comment_id": 6,
	"user_name": "Pigpog",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1536468754": 1536611018,
		"15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1537150261": 1537222966
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@leftside: grab her bag and run",
			"post_uri": "15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1537319582",
			"date_added": 1537387050
		},
		{
			"comment_id": 2,
			"body": "probably to deter from having a billion tiny files",
			"post_uri": "18dhkzcDYd4zCD8Vtb47ULAciCuoyUFzet_1538036301",
			"date_added": 1538171510
		},
		{
			"comment_id": 3,
			"body": "Youve gone nuts",
			"post_uri": "15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1538794872",
			"date_added": 1538799047
		},
		{
			"comment_id": 4,
			"body": "@Daniell Mesquita\nYou say I dont know what an exclusive group of people in the world can do. I do acknowledge that, yes, an extremely powerful computer could, if focused on doing so, brute force an individuals encryption key.\nI have a concept my dad told me, and ill first phrase it as an analogy. We all know how powerful guns are. The average person does not live in fear of being shot, because there is almost no reason for them to be targeted. If you stand out from the crowd, you will be far more likely to be targeted because you aren't just the average person anymore.\nWhen you think about it, there are far too many of your average encryption keys for anyone to be able to crack them all. Sure, if someone (or a government) targeted one person for whatever reason, they would be able to do it with the assistance of a (15 million dollar) computer. When you start protecting yourself way over the average amount, you stand out from the rest and become a target. There is safety in numbers. You must have some reason to be protecting yourself so much.\nWhat have you to hide?",
			"post_uri": "15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1538794872",
			"date_added": 1538854006
		},
		{
			"comment_id": 5,
			"body": "@Daniell Mesquita: I honestly take no more measures in hiding my identity on Zeronet than i do any other platform. I dont use tor, i dont use a different username, i dont pretend to be someone else. I dont give a shit, and the government also wont give a shit because if im transparent they will just overlook me. If i started encrypting everything i do, they may start investigating. With their quantum computers.",
			"post_uri": "15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe_1538794872",
			"date_added": 1538868093
		}
	]
}