{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1,
			"title": "shutting down zites? right....",
			"body": "I dont know who this foreign actor is typing in japanese here- but good luck with the idea....this is designed explicity to NOT be taken down- as a \"free\" and \"democratic\" \"republic\" or \"federated\" as it were internet. So take your kp and leave it at home. Take your drug dealing and leave it at home, most of us dont want you here. everything else, I find is fair game. It wouldnt suprise me if NK is using zero but Kim needs to behave or go. I didnt like NK missile antics in 06 and I dont like them now. That said, if the people want to come here(zero), I have no problem. The idea of zero is decentralized. Only the bitcoin part could ever be, and recent coins are masking and preventing even that(cryptonote).The more fair a coin is to mine(machinecoin), the more decentralized in my book that it can be. Wrong coin, maybe but- bit is the leader and easier to get right now. And it seems that may be changing.",
			"added": 1496200749
		},
		{
			"topic_id": 2,
			"title": "kicking the jsons once a while",
			"body": "im noticing that kicking the json in the pants once and a while seems to work out bugs in distribution...go and change something, save it, then sync..",
			"added": 1507081093
		},
		{
			"topic_id": 1512360950,
			"title": "anyone need nmc blockchain?",
			"body": "i might have to get some discs first but I have the blocks. it makes resolving sooo much easier. I know syntax too...just copy the formulae with your zite address instead of mine. nmc payments are like piss and really we need more nodes up..",
			"added": 1512360947
		},
		{
			"topic_id": 1518188055,
			"title": "bad peers",
			"body": "is anyone else getting bad peers or peers using random ports other than what they should? what causes this? I thought 0net was strictly 15441. also explodie tracker is down.",
			"added": 1518188051
		},
		{
			"topic_id": 1518191648,
			"title": "inbreed stupid or a case of airline abuse?",
			"body": "anyone catching this headline?: florida female told to flush hamster(little fluffy thing) as emo support animal. FOXNEWS says she did it.\n\nfisrt of all- any airline (emo support or otherwise) telling me I cant fly with a hedgehog- a CARRY-ON ITEM and charging me an extra $150 for said carry-on is getting a dose of thier supervisor. \n\nsecondly- you refuse..I dont care if its a non refundable ticket...your comping my ticket back.\nthirdly- ill never fly w you again. I put my money where my mouth is.\n\nbut the audacity of airlines to even ask such atrocious actions should be no less than investigated by secret service, FBI, and ASPCA agents. so who gets the creulty chrage- the airline or the AHEM.. dyke?\n\nclearly if your that stupid to go along with a WRONGFUL ORDER of another you didnt deserve the thing anyhoo. This said- this is beyond wrong.\n\nairlines have been taking advantage of people trying to fly w loved ones just to make a buck. THEY decided that wo a emo support ticket that persons not having dogs or cats- which are more problems- and limited at that to 5 per flight--- was needed.\n\nso people went hog wild, I take it but...this is INSANE! as if the peacock wasnt bad enough..airlines are blaming bad patrons YET AGAIN!\n\nand a hedgehog isnt a rodent. Its an insectivore.\nsouthernhedgehogs.bit or .org.\n\nI had issues with southwest in long island. never flew with them since. never will again until policy changes.",
			"added": 1518191643
		},
		{
			"topic_id": 1527629170,
			"title": "just me or is contents json being a uknowwhat?",
			"body": "its supposed to autoscan and hash-if you have msgpack installed(nice depends issue there) and supposedly works but I keep getting live errors when browsing stating contents.json is detecting missing files(moved or removed files). if contents.json is supposed to rescan-a its not doing thru the web interface and b- imgetting old errors for some reason. we shouldnt have to edit this file by hand.",
			"added": 1527629164
		},
		{
			"topic_id": 1541565435,
			"title": "commnuity standards and IP bans?",
			"body": "how about some common decency..we start banning h8 groups, and isolationists zionists like racist bigots that think theyre better than anyone and promote a more universal common community? the odd cussword and reasonable porn- we know are more of expression than anything. most people here are mature enough to go with the flow. this is not the place for your racist bull. If you cant graduate from h8- GET LOST. HITLER LOST, the VRIL will get whats theirs. END OF STORY.",
			"added": 1541565428
		},
		{
			"topic_id": 1558529155,
			"title": "removing bigots",
			"body": "there is horrendous influx of bigots and hate groups- even infecting other peoples UNRELATED posts. THIS NEEDS TO STOP- and we need a way to stop it.",
			"added": 1558529147
		},
		{
			"topic_id": 1601418179,
			"title": "ZeroGIt at GitCenter",
			"body": "doesnt the format of this presume that we need others to publish - a big problem when first starting out? This is why we started 0List and mirroring other peoples zites...problem rears its ugly head again- you cant publish a git repo until someone comes along and mirrors you.\n\nAnyone need Lazarus/fpc graphix libs? working on pulling the code up here. Builds. src is WIP. Uses SDL1 and 2. Partial GL help for LAzarus.\n\nhttp://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/repo/?1ChucjfZdweRfaBvXPi6aaZWExZVMRjvkb@master\n\nand can someone tell me how banned coins such as name- can be bought /xferred to pay for domains? maybe we need to enable independent cpu mining of name- (or some other coin)? Its fine if you have a domain- but what if you want a new one?",
			"added": 1601418170
		},
		{
			"topic_id": 1621394876,
			"title": "0Net windows vs...",
			"body": "Is it jsut me- or has 0net taken a hit lately? usually I see more peers on nix vs windows...lately not only that but meerNodes are needed to sync yall(your) zites-- and were showing ZERO tracker sync repeatedly, an ongoing issue. I dont know who implemented this- but we need to push for trackerLESS states--peers can be compromised or attacked, or unreachable. If anyone else is seeing this, please report it to the devs. Im on Win10 atm, I usually use Debian/ubuntu.",
			"added": 1621394866
		},
		{
			"topic_id": 1621395315,
			"title": "Windows glitches",
			"body": "specifically to 0net- Im finding the following glitches remain:\nPrivate key not released to user for syncing. Now it becomes stored somewhere on zite creation..but where? Users will need this data--data can only be provided to us it seems - from a commandLET shell window---but theres not commandLET-python libraries are here...but no python script either,its an EXE file. This is wrong. Users should have a similar experience on all OSes.\n\nIts the shell scrypt that spews out the private keys on creation--but theres no script to run. If one transfered OSes- your private keys would get lost somewhere on windows. Youd be locked out of future edits.\n\nmeek/meer trackerless is required on windows(maybe its my shitty spectrum lines but...)\nTor is some effort as well but it does work on windows- most of the traffic seems to be on tor.\n\n(those complaining about hosts(0 peers)- post to the new zite blog and background the process for a few hours so we can see you. we cant mirror what we dont see...anyone worth a damn is tracking new zites..cmon, be fair to others...theyre hosting YOU...)",
			"added": 1621395304
		}
	],
	"topic_vote": {},
	"next_comment_id": 44,
	"comment": {
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "we should have sticky this somehow.",
				"added": 1493343154
			},
			{
				"comment_id": 41,
				"body": "> [g4us69jk](#comment_7_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2): Got a link to this? I'm guessing the content or at least the stuff you have uploaded is stored in a json in a user folder with your ID as the name. You could go into there and change it manually and then publish it that way. Have had to do that with a few sites on here since some places just have a post and no edit option.\n\ndoes work removing your own zite either. You lose the domain , if you bought one- now people are swarming to a non existant zite. Editing the json file doesnt work.",
				"added": 1603226241
			}
		],
		"1_1CMYxdit4qq9QGk9DYRu2ruRPd2YDGckH8": [
			{
				"comment_id": 2,
				"body": "indie= a lot more of that unfortunately but you can mute ppl now. The election didnt help. of course I could be accorrs the pond in tennessee.",
				"added": 1493343212
			}
		],
		"3_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 3,
				"body": "havent but-that only works if governemnts are in control of the internet. US gave that away years ago. DARPA would have to re-own the content, not just have DCMA takedown notices issued. In some other countries, japan-for example this is not the case. Governments, not just telephone companies own the internet. More to the point, the telecoms could shut you down instead of big govt.",
				"added": 1496270037
			}
		],
		"1_1FRsFWqkx5TVyRqy9Xr3XoshYDDZHXSQvz": [
			{
				"comment_id": 4,
				"body": "I h8 to b a dick but if you were looking for it properly, you would know already where it is and how to get in. Ive found three variants without trying. Nice job uncle sam. and no its not here.",
				"added": 1496445549
			}
		],
		"1_17WG9sFaQoZCyRT7m89WAa23Ma4WYPifMH": [
			{
				"comment_id": 5,
				"body": "OS firewall probly or ISP interference.",
				"added": 1496510732
			}
		],
		"1_1KyYXcw24hndmkCoxyhJtHJ1Ch7EUqoSQ1": [
			{
				"comment_id": 6,
				"body": "like they said, you have to manually set it up-technically that stealing, make sure you have GPL-ish permissions before you steal code..I usually check but there are a \"few\" workarounds...most of the stuff I clone is open...",
				"added": 1504390242
			}
		],
		"23_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 7,
				"body": "yes and no..and can we pleeease fix the color code crap? I cant see my text w dark ubu themes..",
				"added": 1507080914
			},
			{
				"comment_id": 8,
				"body": "I have 4+gb isos id like not to have as optional but torrented DLs..wo chewing my bandwidth al the time.",
				"added": 1507080969
			}
		],
		"27_1H5UJ7LneToGqYqJ9fbLnu1Ko2pxTpchof": [
			{
				"comment_id": 9,
				"body": "thats because others have it and are sharing it. you are only needed to make updates w your key. once live and people have a copy...theres no taking down a zero zite.",
				"added": 1507081188
			}
		],
		"1512179082_17ffrcHNzbFoUe81PyMEagQdv2DGNRLFcE": [
			{
				"comment_id": 10,
				"body": "to me its more of a logic puzzle. can you solve for x - y i dunno...with what you have? do you trip notifications/flags to get there? or do you need more (code)?",
				"added": 1512360667
			},
			{
				"comment_id": 11,
				"body": "there is a money hack--its called working, being disabled or in some sort of business that doesnt scam people.",
				"added": 1512360705
			}
		],
		"1511956110_1AZYSfyeKjZbAN9BPYYFf1FCSm9ujLXMcu": [
			{
				"comment_id": 12,
				"body": "no. I wil tell you why. zero is different and distributed. i2p is not. if you go offline so does your i2p. not so with the zeronet.",
				"added": 1512360743
			}
		],
		"1511733600_1L4sP574Uy8x8Jv5Uob6nfsDSEGqMLuqa3": [
			{
				"comment_id": 13,
				"body": "anyone have keys? we can dump, like wii is aes256...but has a master key unlocked- which is how we can use the dumps and dump the wii. wii-u is somewhat different and different keys. blue-ray is 3 key system dumphd forums has more detail.",
				"added": 1512360807
			}
		],
		"1512360950_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 14,
				"body": "oh-and upgrade your drive to bdrom for gods sakes...its not that expensive for your computer.",
				"added": 1512360981
			}
		],
		"1518182702_13vv2eRHS2KMArxEo1rKh4xQGogjJNhKr4": [
			{
				"comment_id": 15,
				"body": "that will purge every zite you have",
				"added": 1518186896
			}
		],
		"1518056723_19WW28sn46rz9h15xf6NCELPdzxZ2YhbyB": [
			{
				"comment_id": 16,
				"body": "u do have a point. its the country- nobody cares abt anyone else except the fiat dollar. if you cost me money in any way- youre fired, made homeless, denied pension or benefits...etc..",
				"added": 1518187198
			}
		],
		"1517558605_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 17,
				"body": "video- try lbry.io \nmirors: I find jekyll works better. headache with hard coding a theme but easiest. php doesnt work well here but a cache static copy might(WP, drupal, joomla). openbazaar and similar are down or dark often. yes I do think twood be wise. wikipedia is over 50GB...how large a DL do you want to cache?",
				"added": 1518187350
			}
		],
		"1517556000_1KNSf9nhRFUc52aeX947CRwWTUGPPnZdyQ": [
			{
				"comment_id": 18,
				"body": "I think the zites that have heavy use should tween old content unless they have an archive section. everything large should be made optional content. I dont like the idea. Do you like losing nodes on stuff you host?",
				"added": 1518187420
			}
		],
		"1517552108_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 19,
				"body": "true but 0net isnt designed for mobile. Its designed for always on connections like dsl or cable which dont limit in most areas now in USA. even sat connections have hell.",
				"added": 1518187476
			}
		],
		"1518191648_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 20,
				"body": "no offense to females but if yer that stupid...",
				"added": 1518191813
			}
		],
		"1518515398_14UupgrdnT7Y8vMES7aqUFgD1fC5RYNrh8": [
			{
				"comment_id": 21,
				"body": "its not hard and python (here) can host instead of just serving data. Ive seen the simple code in python for that. HORNET wasnt cancelled, postponed maybe--stalled...as most projects are. The issue is who will support it or code it. sounds like you want some data out on port 80 via python or similar..while running apache is overkill- python CAN do this. There was an acme hook somewhere that ran an instance of nginx even though there was an instance provided in python. no- but like here, you host others data...",
				"added": 1518638616
			}
		],
		"1527247257_1LACNkKD9QUoF28kSzmcv2hojVmTs2qTwZ": [
			{
				"comment_id": 22,
				"body": "nothing but peers, sorry.",
				"added": 1527626450
			}
		],
		"1527243612_1R67TfYzNkCnh89EFfGmXn5LMb4hXaMRQ": [
			{
				"comment_id": 23,
				"body": "only top link posted here is working. nice.",
				"added": 1527626540
			}
		],
		"1527629170_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 24,
				"body": "also can someone explain this site:ziteADDR:none crap? I keep seeing it in the console. If theres no errors, shouldnt this read success, not failed?",
				"added": 1527629252
			}
		],
		"1527718057_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 25,
				"body": "yes it should-C devs are lazy. Python is derived C. Ive got another one for you! #chompOnTHis You cant remove a package because theres no way to remove or install it and pkg manager refuses to budge. GH updates Are patches-you misunderstand versioning systems. Yes, I agree--lightyears to go in the get-the-stupid-out dept.",
				"added": 1527718254
			}
		],
		"1537956104_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 26,
				"body": "jekyll and most flatCMSs work- getting a db site working here is a pain. still trying to wrap my head around the zero database...elephant wont work(PhP) because you are hosting, not serving. could python -therefore jekyll open a server? yes. Ive looked at the code- it assumes incorrectly in most circumstances hosting itself is an issue-its not. sometimes, thought python tries to open an already existing connection on same port. bad code.",
				"added": 1538561668
			},
			{
				"comment_id": 27,
				"body": "because IT CAN be done- even when python is hosting or holding one door open. even the same door.",
				"added": 1538561693
			}
		],
		"1541232786_1Ga7vs5ZV73jbTSMR77FuZi8KWt2MnBSvb": [
			{
				"comment_id": 28,
				"body": "fuck you- get off my internet...whutADick.",
				"added": 1541565071
			}
		],
		"1541030608_1CrzoomCXRHkg6vqaRXwffoMkWMjkDurf4": [
			{
				"comment_id": 29,
				"body": "how abt no h8 allowed! go take your IP and shove it, bro.",
				"added": 1541565135
			},
			{
				"comment_id": 30,
				"body": "fuck you- get off the platform.",
				"added": 1556394874
			},
			{
				"comment_id": 31,
				"body": "bigot",
				"added": 1556394884
			}
		],
		"1558513165_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 32,
				"body": "how abt a bugfix for site size when json file needs to be updated? having a hard time with it- it shouldnt need to be manually edited- except for minor .bit domain edits.",
				"added": 1558522542
			}
		],
		"1558291815_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 33,
				"body": "theres a few lines of code- that is one important one that most WP devs have to pay to add to their sites. I use jekyll.",
				"added": 1558528753
			}
		],
		"1557456427_1DgRMcgsHLQfLfsXGKkFVnSoFtEYPpnkeb": [
			{
				"comment_id": 34,
				"body": "its XML actually- 500GB worth. make the content optional. editing at all via updates will be impossible without zeroblog api rewrite- jekyll doesnt do it and php relies on another live webserver at IP x.y.z.a which is running normal services(apache,etc)",
				"added": 1558529073
			}
		],
		"1590241272_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 35,
				"body": "perhaps but recent HP and similars require it to utilize the internal wifi and optane.",
				"added": 1590456303
			},
			{
				"comment_id": 36,
				"body": "> [monsterjazz](#comment_35_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp): perhaps but recent HP and similars require it to utilize the internal wifi and optane.\n\nand for the record- 19 breaks UEFI bioses...dont tempt fate on a notebook.",
				"added": 1590456454
			}
		],
		"1590404236_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 37,
				"body": "like 20% hike in nashville,tn I hear.",
				"added": 1590457305
			}
		],
		"1601128933_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 38,
				"body": "put your js, html, and css into the folder created by 0net- then update and sync.",
				"added": 1601415585
			},
			{
				"comment_id": 39,
				"body": "theres 10 active sync nodes somewhere- add your zite to the list as a request. keeps me online. chomping-at-the and southernhedgehogs",
				"added": 1601415645
			}
		],
		"1603055077_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 40,
				"body": "projecgt stargate. look up Mr Ed Dames. Nothing new. Offices are still there at Ft meade from years ago. I was at the base in 03.",
				"added": 1603224087
			}
		],
		"1605027510_15BPbETpjWmZoVdS4YGMg4qWiguXi1ASGz": [
			{
				"comment_id": 42,
				"body": "just for talkoing that sort of smack, im banning you",
				"added": 1605484544
			}
		],
		"1620417095_17ufjt7e9DRsavS6AADWoGpiutSp8iD32f": [
			{
				"comment_id": 43,
				"body": "> [xcape2net](#comment_853_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): True.  However, as recent events have highlighted, what the NSA has today, Internet thieves will have tomorrow.  And we really have no way of knowing what they have until they have possibly had it for years.  This is a complicated issue.  I feel that Truecypt is still the safest way to go, but if you want to chose Veracrypt, who am I to dissuade you.\n\nVera fix es few holes in the logic- it doesnt fix stupidity in storing data. Your data leaks everywhere- the OS, the HDD spare sectors...and most people dont encrypt CDROM data(it can be done). Physical access always means hosed/compromised. Stay on decent part of the net- update only thru trusted sources- youll mostly be fine. TC has never been cracked- theres a few password hash weaknesses, some are addressed in VC. Setup aes-si cpu instructions if you need speed but you need more modern computer- TC can run on older macs(7.0), nix, windows.GOST is an option but windows flags the subdriver. Bitlocker suffers from a manufacturer bug when drives can be decrypted easily- thats why msft switched to software implementation(force it on)- linux can piss thru the encryption it seems(ive not tested but people claim to be able unlocker drives). Same with TM encryption on mac. Id trust TC/VC/GOST more than anything that ships with the OS.",
				"added": 1621394687
			}
		]
	},
	"comment_vote": {}
}