{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1603292539_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1,
		"1603147210_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": 1,
		"1603297511_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 2,
				"body": "> [qarmy](#comment_4_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Feel free to inquire with the #FBI for more information regarding what was done to me... [...]\n\nYes, unfortunately though, the reverse engineering process that took place was questionable morality wise.\n\nHowever, now that people understand that had you not done what you did, then they would all still be asleep...\n\nJust like Sleepy Joe Biden...\n\nHehe :)\n\n#IntelligenceAgent",
				"added": 1598231674
			},
			{
				"comment_id": 3,
				"body": "P.S. Dietz Nuts -R- Meat Nuts... xD",
				"added": 1598231822
			},
			{
				"comment_id": 4,
				"body": "#GoFuckaDuck\n\n(The Intelligence Community Gets It... Hello again boys and gals!)",
				"added": 1598231930
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 5,
				"body": "Vote for OTB or you ain't black... xD\n\n#Trump2020",
				"added": 1598475351
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 6,
				"body": "> [thorburn](#comment_120_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Oh dear, what's up peaches? Do I have an opinion that you don't agree with?\n\nFairly certain that @krombopulusmike simply didn't feel like taking the time out of his very busy schedule to dignify a censorship loving fuck boi such as yourself with a well articulated response. He's probably busy adding you to his conspiracy theory chart or whatever the fuck he's over there doing lmfao!\n\nThis thread is hilarious! \n\nFinally some humor here on ZN!",
				"added": 1598710061
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 7,
				"body": "> [edgelordofdecent](#comment_667_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Guy named qarmy. No wonder I am not seeing his posts. He was one of otbtechnologies's alts, yes?\n\nPretty sure that was just a theory. I know he had two of his IDs linked, but I don't think qarmy was linked to him. The way this is shaping up though, it seems like otbtechnologies has replicated what occurred between \"Q\" and Donald Trump though at this point. That was resultant of the fact that a ton of leftists insulted his intelligence.\n\nPretty sure he just turned himself into a conspiracy to spite you all.\n\nJust my guess though. I could be entirely wrong, but if not his plan is definitely working in his favor at this point.",
				"added": 1603297380
			}
		]
	},
	"comment_vote": {}
}