{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Nuevo Wiki en español",
			"body": "He creado [ZeroWiki ES](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/) para orientar a los usuarios nuevos. La idea es que lo vayamos ampliando entre todos.",
			"added": 1470787882
		}
	],
	"topic_vote": {
		"1_13U9mRgV3bdkXiNXjMZeBWTcSHZjgNmk2z": 1
	},
	"next_comment_id": 5,
	"comment": {
		"2_1GtJqyJRsuZhmxVtw5USgvqGbUmVH7EmBD": [
			{
				"comment_id": 1,
				"body": "Tengo que decir que no estoy nada de acuerdo. ZeroNet aporta una **tecnología** y al ser p2p sobrevivirá mientras:\n1. No salga otra tecnología que la reemplace\n2. Haya al menos un usuario compartiendo contenido\n3. Sigan haciéndolo tan bien con la *usabilidad*\n\nEstá claro que habrá sitios que \"mueran\" debido a la falta de *peers*, y eso permite una evolución del contenido y de la utilidad de esta red. Por otro lado, está en pañales, acaba de nacer y hay mucho por hacer.",
				"added": 1470785684
			}
		],
		"4_1HcK5Hw1rPZeYdgTmqJGrVG2tSyR9Ke2Gt": [
			{
				"comment_id": 2,
				"body": "Si borras un sitio los contenidos locales también se borran. Se guardan en la carpeta data/ y el nombre coincide con el identificador de la página. Cuando creas un Sitio lo puedes editar directamente desde ahí (bueno, hay que firmarlo y todo eso).\n\nYo también prefiero alojar los sitios yo mismo. Poner un límite inicial de 10MB está bien para hacer sostenible la red. He hecho un uso intensivo estos días y me ocupa 250MB",
				"added": 1470787625
			}
		],
		"1_163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg": [
			{
				"comment_id": 3,
				"body": "> [rapapobre](#comment_27_1K6HCsJskZENYG42GR7ocJXg9WjFbEq9hc): blogs en español_en la lista de los sites de los usuarios hispanohablantes, se deberia situar una sinopsis de la tematica q tratan en el mismo, no solo el nombre del usuario.\n\nSería muy interesante poner lo que comentas. Con que cada usuario lo hiciera con el blog que más le gustara pronto se llenaría de contenido. Principalmente he llenado la Wiki con información rápida. Si tengo un rato la iré ampliando.\n\n> [prexxett](#comment_20_1QAKp4SUFSkGdqsgEH47rWRJkAMLf5YH4b): Yo he añadido algún enlace pero aunque se supone que es en español veo difícil que algunos no sean en inglés.\n\nEntiendo lo que dices, la idea de esa página en concreto es fomentar los sitios en español, por lo que voy a colocar tus enlaces en [la otra página general de enlaces](http://127.0.0.1:43110/1FwbupJhHcnFWGXuu3bn5VxcRVW9tx2tDQ/?Page:lista-zites). Gracias por el aporte.",
				"added": 1470853391
			}
		],
		"3_1EZG8eDkCFvNkYxpHmr2WbGWcSxAsRfqTT": [
			{
				"comment_id": 4,
				"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1RedkCkVaXuVXrqCMpoXQS29bwaqsuFdL/163sF1Kdsd5LdpjAXDKBshdEBNJH6PUqvg/zeronauta@zeroid.bit",
				"added": 1471399829
			}
		]
	},
	"comment_vote": {}
}