{
	"title": "Калининград",
	"description": "Глазами Balancer'а",
	"links": "*   [Блоги Balancer'а](/1MaQ4W5D6G52TpBfPACU9k9QcB1DxvHZ5v/)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1535546260,
	"post": [
		{
			"post_id": 7,
			"title": "Какие здесь автомобили…",
			"date_published": 1535541909.766,
			"body": "… мы о таких уже забыли …\n\n![20180801_131204.jpg (1200x801)](data/img/post_7_20180801_131204.jpg)​​​​​​​"
		},
		{
			"post_id": 6,
			"title": "Родина К.О.",
			"date_published": 1535541754.467,
			"body": "Давно убедился, что Калининград - родина Капитана Очевидность. Вот вам **Кафе «Столовая»** :) Нечто подобное тут встречается постоянно…\n\n![20180801_111119_01.jpg (1057x900)](data/img/post_6_20180801_111119_01.jpg)"
		},
		{
			"post_id": 5,
			"title": "Полторы дюжины яиц",
			"date_published": 1535541331.278,
			"body": "Отмечал ранее [в других соцсетях, с фотками, может и сюда затащу потом задним числом] про любовь в Калининград (и  в области) к дюжинам и полудюжинам яиц вместо привычных нам десятков. Вот ещё вариант - полторы дюжины.\n\n![photo_2018-08-21_23-25-03.jpg (1006x1280)](data/img/post_5_photo_2018-08-21_23-25-03.jpg)"
		},
		{
			"post_id": 4,
			"title": "Культурный код",
			"date_published": 1535535776.993,
			"body": "![20180726_142833_01_01.jpg (1107x900)](data/img/post_4_20180726_142833_01_01.jpg)\n\nНа самом деле, позже, я так и не смог оценить на глаз частоту встречаемости. И «шаурма», и «шаверма» тут встречаются примерно поровну. Не отстают от них и «дёнер» с «кебабом». Разве что только тверской и аутентичной «шавармы» ни разу не видел :D"
		},
		{
			"post_id": 3,
			"title": "Стимпанк-хоррор",
			"date_published": 1535535003.453,
			"body": "Такой, вот, арт сумрачного прусского постсоветского гения поставили недавно на калининградском автовокзале :) В прошлом году ещё не было.\n\n![20180727_154039_HDR_01.jpg (853x900)](data/img/post_3_20180727_154039_HDR_01.jpg)"
		},
		{
			"post_id": 2,
			"title": "Знакомство",
			"date_published": 1535533815.729,
			"body": "Первый раз я в Калининград приехал (погостить), вероятно, в 1979-м году. В 6 лет. Что запомнилось тогда — это впервые в жизни увиденный цветной телевизор у двоюродного дяди. Я целый вечер смотрел всё подряд, а когда стали прощаться и надо было уходить из гостей, я расплакался. Вообще, я был спокойный и послушный ребёнок и плакал мало. Но тут, видимо, цветной телевизор меня поразил до глубины души :D\n\nА уже летом 1980-го мы с мамой переехали в Калининград на постоянное проживание. Поселились в Гвардейском районе, в Яблоневке, где я и пошёл в первый класс. Фотоматериалов по Яблоневке у меня мало, но с тем, что есть, наверное, тоже надо будет в отдельный блог.\n\nВ 1987-м переехал в Михайлово Гусевского района, где и жил/учился я до 1990-го года, когда по окончании школы умотал в Москву. С тех пор в Калининграде и области бывал только редкими наездами. Но фоток и впечатлений накоплено много, так что накопилось на целый блог :)"
		},
		{
			"post_id": 1,
			"title": "О блоге",
			"date_published": 1748652979,
			"body": "Всё никак не привыкну к, на самом деле, очень удобной ZeroNet-концепции «один ресурс — один зайт». Опять ломал голову, как бы мне получше вести тематические ветки в основном блоге в отсутствии нормальных тегов. Например, делиться своими фотками, отзывами, впечатлениями о Калининграде. Потом сообразил — сам же советую регулярно делать клоны зайтов под конкретные задачи :) Так что, очевидно, что и под Калининград можно тупо завести отдельный блог. И аналогичный будет под Михайловку с Гусевым. Так что — с очередным меня почином :)\n\nДругие ссылки для ознакомления:\n\n*   [Топик «Калининград» на форумах Balancer.Ru](https://forums.balancer.ru/society/2014/05/t73712--kaliningrad.html)\n*   [Твиты с тегом #Калининград в Твиттере @Balancer73](https://twitter.com/search?l=&q=%23%D0%9A%D0%B0%D0%BB%D0%B8%D0%BD%D0%B8%D0%BD%D0%B3%D1%80%D0%B0%D0%B4%20from%3Abalancer73&src=typd)"
		}
	]
}