{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"57_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": 1,
		"58_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": 1,
		"101_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": 1
	},
	"next_comment_id": 5,
	"comment": {
		"13_1965fNDmmvHB3LFPmAHkb9vqBN484QEM2a": [
			{
				"comment_id": 1,
				"body": "ZeroMe = 电台\n可以收 / 发帖子\n\nHub = 频道\n一个帖子只能发一个频道，但可以同时收听多个频道\n频道不能直接用，必须要用电台",
				"added": 1517305165
			}
		],
		"38_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 2,
				"body": "More irony: http://blog.jobbole.com/41073",
				"added": 1517805208
			}
		],
		"105_1FCUxdEX5AU1HWZnph7spBmsgFeeWMzXTz": [
			{
				"comment_id": 3,
				"body": "> 鲁迅是汉奸？\n\n无所谓。你国烂又不是鲁迅一个人造成的。\n\n> 如果大陆现在是日本在管，大概更好点？\n\n可能。\n\n> HolyINS注：说的有道理，但是为什么现在从学生课本撤除鲁迅的文章呢？莫非这是高级黑？鲁迅指出中华民族的阴暗面，但没找到出路，是因为缺乏基督信仰！\n\n为什么非得信仰“基督”？“基督”可是和“犹太”、“伊斯兰”一个路子的。",
				"added": 1518516047
			},
			{
				"comment_id": 4,
				"body": "http://jiliuwang.net/archives/68712\n\n\n“贼于众” 者的汉奸之谥 ——驳鲁迅媚日说\n思想 2 个月前 (12-06) 321 激流网 0\n\n提要：近年来，除了以大幅删减中小学教科书中的鲁迅作品为代表的去鲁迅化思潮之外，鲁迅媚日的传言在新媒体上的广为流传也对鲁迅的形象与历史地位造成了较大冲击。这种传言虽然是捕风捉影的妄断臆测，却严重干扰了广大公众对于鲁迅的人格、立场及其思想史意义的客观认识，学术界有必要予以认真对待和有力回应。本文对影响舆论甚大、以妖魔化鲁迅为导向的 “原型” 网文作了解析和驳斥，以期有助于正确认识鲁迅作为精神界战士的批判精神及其对抗日的态度。\n\n“贼于众”者的汉奸之谥 ——驳鲁迅媚日说-激流网\n\n胡风在纪念鲁迅逝世五周年的专文中描述说，自抗战全面爆发后，“大家都被卷进了其大无边的兴奋里面，特别是热情而纯洁的青年人，觉得自由和光明已经得到了，一切黑暗和污秽都成了过去的回忆。” 在这样一种近乎狂热的美好幻觉中，“似乎鲁迅的斗争道路也已经过去了，因而鲁迅这个名字也似乎和沉醉在炮火声里的他们隔得非常遥远。” 有人于是提出了这样的疑问：“如果鲁迅先生还活着，你想他是怎样的情形呢？” 对于这个极具文学史、思想史份量的问题，有人天真地感叹道：“如果鲁迅先生还活着，该多么高兴啊？” 但作为鲁迅密友的胡风却悲观地认为：“如果鲁迅真的还活着，恐怕有人要把他当作汉奸看待的。”[1] 胡风的这一观点看似唐突，其实有着相当的现实依据，而当今甚嚣尘上的鲁迅媚日说，更是印证了他的悲观判断的历史预见性。\n\n至迟从 2002 年开始，华文网络上开始流传鲁迅媚日、鲁迅是汉奸的言论，较有代表性的网文为清水君的《鲁迅——汉奸还是族魂？》（2002 年）、憨子的《为什么你们对鲁迅那么宽容？》（2006）、张生的《其实鲁迅是汉奸》（2012）。[2]这些文章被反复转载，影响舆论甚大，可以说是妖魔化鲁迅的 “原型” 网文。\n\n清水君于 2002 年发表的万字长文《鲁迅——汉奸还是族魂？》是一篇声色俱厉、火力全开的讨鲁檄文，其震荡之大，流传之广，堪称当代鲁迅媚日说及解构鲁迅思潮的 “定调” 之作。此文从鲁迅对国民党政权的仇视、对传统文化的否定、对国民素质的悲观、对日本人的友善及对抗战的消极等多个方面加以攻讦，试图彻底瓦解鲁迅的 “民族魂” 地位和爱国者形象。不过，该文还不敢得出鲁迅是汉奸的结论，只是语带保留地表示：“（鲁迅）如果不是汉奸，最少，他是一个亲日的‘堕落文人’，是一个大汉奸的亲哥哥！”四年后，署名为 “憨子” 的《为什么你们对鲁迅那么宽容？》一文连这一点保留都舍弃了，而是大言炎炎地下判语说：“鲁迅是中国最媚日（的）一个文人，他的很多行为放在独立于文学等条件下——从国家安危民族团结抗日这个角度来说，他是最大的民族敌人、最典型的汉奸无疑。”其后署名为 “张生” 的《其实鲁迅是汉奸》一文沿袭这一观点指控说，“魯迅是一名不折不扣的漢奸。”\n\n综观以上指斥鲁迅媚日的网文，其主要论据有三：其一，鲁迅在国家存亡之际，痛批本国政府与本国文化，意在瓦解国人斗志，为日本人张目；其二，鲁迅对抗战态度消极，没有抗日言论；其三，鲁迅与日本渊源甚深，关系暧昧。\n\n关于第一点，清水君的主要控诉如下：\n\n“从北伐之后到抗战之前的十年，是中国迅速医治封建创伤民族贫弱恢复健康保存体力的十年，是厉兵秣马整肃军纪强化国防扩大外交备战强敌的十年！然而，这一切的一切，你能从鲁迅的文章中看到吗？你能从鲁迅的几百万言所谓大作中看到日本的杀气腾腾迫在眉睫的威胁吗？你能从鲁迅的几百万言所谓大作中看到国民政府的哪怕是一个积极的进步吗？”\n\n“相反，我们看到的，是鲁迅对国民政府的一切活动都无不尽冷嘲热讽挖苦诬蔑之能事，讽刺‘新生活运动’，讽刺文艺界‘国防文学和抗日文学’的口号…… 甚至，鲁迅的作为，是在讽刺中国一切的一切，包括中药中医，包括传统文明和儒家文化，包括历史辉煌和科学贡献，包括衣食住行，没有一样看上眼的，什么，‘决不看中医’，什么‘中国的书缝里，只写着两个字：吃人！’甚至，要彻底废除中文，什么‘中文不灭，国无希望’！\n\n憨子的言论与其相似：\n\n“鲁迅那个时代是什么时代？是日寇觊觎已久，随时准备灭亡中华的时代，他都在干什么？在给国民政府添乱、跟日本人勾勾搭搭、给中国人民泄气。同时代的日本人在干什么？在宣扬自己的国民是神的子民、在宣扬天皇是神；德国人在干什么？在鼓励自己的民族是世界最优秀的人种、在论证自己的民族是伟大的民族；美国人在干什么？在宣扬自己上帝的孩子，是自由的火种。战场上鼓声是干什么的？是鼓舞振奋士气用的。鲁迅在战场上干什么？在说中国人是劣等种族、有劣根性、五千年的文化是吃人的、中国的医术是骗术、要以最大的恶意揣度中国人……”\n\n张生的判语更是诛心之论：\n\n“鲁迅为了配合日本大东亚共荣圈的宣传，写大量文章攻击政府、诋毁中国，宣传亡国理论。在鲁迅笔下中国的文化等同于垃圾，中国书只会害人杀人！”\n\n以上说法无不振振有词，却多有荒谬不实、时空错乱、断章取义之处，需要细加辨析。首先，鲁迅并未对 “包括传统文明和儒家文化，包括历史辉煌和科学贡献”（笔者按：“传统文明” 包含了 “儒家文化”，“历史辉煌” 又包含了 “科学贡献”，所以不应并举）在内的“中国一切的一切” 全部予以否定和讽刺，也并未 “对国民政府的一切活动都无不尽冷嘲热讽挖苦诬蔑之能事”。作为一个以改造国民性、涤除专制愚昧思想、推动中国的现代转型为使命的精神界战士，鲁迅对中国的历史与现状进行了持续不懈的全方位反思与批判，主要表现为两个方面，一是对传统文化中一切有悖于民主、科学、人道精神却阴魂不散的因素予以揭示和抨击，二是对现实社会中一切摧残民族肌体、压抑个性解放、阻碍中国向上发展的丑恶现象掷以匕首和投枪，所谓“论时事不留面子，砭锢弊常取类型”[3]，正是其众多杂文的根本特质。但是，鲁迅绝不是一个文化虚无主义者，更不是一个刻意抹煞历史和现实中的美好价值、以攻击时政与旧文化换取利益的文棍。诚如钱理群先生所言，“作为学者的鲁迅，和作为杂文家、精神界战士的鲁迅是有区别的。…… 把鲁迅的学术著作，他的《中国小说史略》、《汉文学史纲要》和鲁迅的杂文里面对传统文化的批判对照起来看。可以发现，作为学者的鲁迅，他站在一个学术立场上，他对传统文化有相当多的肯定。你看《汉文学史纲要》就知道，他对老庄、对屈原都有肯定……”[4] 从《中国小说史略》可见，他对《红楼梦》、《金瓶梅》《聊斋志异》、《儒林外史》等古典小说的艺术造诣均有言简意赅的高度评价，如他盛赞《聊斋志异》“描写委曲，叙次井然，用传奇法，而以志怪，变幻之状，如在目前”[5]，又称许《金瓶梅》作者洞达世情，笔法高超，“或刻露而尽相，或幽伏而含讥”。[6]他在《汉文学史纲要》中对《史记》所作赞语 “史家之绝唱，无韵之《离骚》”[7]，更是广为传诵。在充分肯定传统中国的文学成就以外，鲁迅还格外推崇墨家精神、汉唐魄力、魏晋风骨等刚健伟美、有助于振作国民的精神气质，他饱含深情地评论说：“我们自古以来，就有埋头苦干的人，有拼命硬干的人，有为民请命的人，有舍身求法的人，…… 虽是等于为帝王将相作家谱的所谓‘正史’，也往往掩不住他们的光耀，这就是中国的脊梁。”[8] 一个对中国历史文化有深刻洞见、为世人标举 “中国脊梁” 的思想家，却被诬为否定 “中国的一切”，甚至是“亡国理论” 的鼓吹者，真是荒谬绝伦。这类妖魔化鲁迅的观点不是出于无知或判断力的缺陷，就是别有居心。此外，鲁迅对当政者的种种腐败、颟顸、钳制言论自由、戕害人权民生的行径的确进行了不懈地揭露和批判，但他都是以客观事实为依据，且以推动中国进步为目标，既无 “诬蔑” 之意，亦无 “诬蔑” 之实。而且，他在 “几百万言所谓大作” 中所批判的当政者，并不限于 1928 年北伐战争后才取得统治权的国民政府，还包括晚清政府、北洋政府（1912-1928），尤以批判北洋政府为多，这就足以彰显鲁迅的批判锋芒始终指向统治阶层，并未受党派之争所左右。\n\n其次，鲁迅固然以揭示、批判国民劣根性为其毕生使命，但他从未说过中国人是 “劣等民族”，他对“中国脊梁” 的盛赞，正寄寓着他对同胞的肯定与期许，更何况，他对国民劣根性的批判，是以医治国人的灵魂为目的，决不是灭自家威风，长别人志气，更不是为 “亡国理论” 作铺垫。如果鲁迅真像憨子所说的日本人、德国人那样，一味“宣扬自己的国民是神的子民”，一味“论证自己的民族是世界最优秀的人种”，以此“鼓舞振奋士气”，那他不是法西斯主义者，就是狂热的民族主义者。这是以另一种形式陷鲁迅于不义。\n\n其三，鲁迅对中医、中文和所谓吃人历史的批判是有其特定历史语境和特定内涵的，绝不能断章取义。在新文化运动的浩荡大潮中，鲁迅主张废除文言文（不等于中文）、推行白话文，是为了普及文化、教育，也是为了摆脱 “古老鬼魂” 的影响以利民族新生 [9]，决不是否定中国的语言和文化。他对中医的批判固然有偏颇之处，但他的出发点是弘扬科学精神，并不是逢“中” 必反。他对吃人历史的批判，原话出自 1918 年发表于《新青年》的《狂人日记》：“我翻开历史一查，这历史没有年代，歪歪斜斜的每叶上都写着‘仁义道德’几个字。我横竖睡不着，仔细看了半夜，才从字缝里看出字来，满本都写着两个字是‘吃人’！”[10]这是狂人的呓语，不能等同于鲁迅本人的观点。但是，这段话确实深刻揭示了中国历代统治阶层的虚伪与暴虐，切中肯綮地证明了推翻专制王朝的正当性与必要性。其用心，依然是推动中国的变革与进步，决不是“诋毁中国”，更不是“宣传亡国理论”。\n\n关于鲁迅对抗战的态度，清水君指控说：\n\n“很难置信，在这样一个枕戈待战的时代，在这样一个百废俱兴经济腾飞的时代，鲁迅的眼里没有日本的武士刀在屠杀和正在准备大屠杀，鲁迅的眼里没有国民政府竭尽全力于内外交困中挽狂澜于既倒的努力！鲁迅的百万雄文中没有一个字眼的抗日言论！”\n\n“我们不明白，文艺家身为时代的记录者和表演者，怎么可以对日本的巨大威胁无动于衷？当时军队在备战，人民在奉献，艺术界发起‘抗日赈灾义演’、‘慰军演出’、‘抗日话剧’，文学界虽然有‘国防文学’、‘抗日文学’之争，但都是在尽国民的责任，为什么所谓的‘族魂’却这样冷酷无情地讽刺嘲讽这一切的努力？”\n\n所谓 “鲁迅的百万雄文中没有一个字眼的抗日言论” 简直是信口雌黄，肆意诋毁。对于鲁迅的抗日立场，可以找到许多例证，《友邦惊诧论》固然已颇具说服力，但更有代表性的则是《答徐懋庸并关于抗日统一战线问题》。鲁迅在这篇文章中指出：\n\n“向全国人民所提出的抗日统一战线的政策，我是看见的，我是拥护的，我无条件地加入这战线，那理由就因为我不但是一个作家，而且是一个中国人，所以这政策在我是认为非常正确的，我加入这统一战线，自然，我所使用的仍是一枝笔，所做的事仍是写文章，译书，等到这枝笔没有用了，我可自己相信，用起别的武器来，决不会在徐懋庸等辈之下！其次，我对于文艺界统一战线的态度。我赞成一切文学家，任何派别的文学家在抗日的口号之下统一起来的主张。”[11]\n\n“文艺家在抗日问题上的联合是无条件的，只要他不是汉奸，愿意或赞成抗日，则不论叫哥哥妹妹，之乎者也，或鸳鸯蝴蝶都无妨。但在文学问题上我们仍可以互相批判。”[12]\n\n此外，对于日本人的宣传王道，他讽刺说：王道只是霸道的另一形式，“以谈霸道为羞”的孟子如果生在今天，也要 “羞谈王道的”[13]；对于日本人的宣传尊孔，他指出这是侵略者想用孔夫子做敲门砖，并断言侵略者试图以尊孔来欺骗中国人民是一定不会成功的[14]；对于 1932 年日寇发动的淞沪战争，他控诉道，在这场战争当中，日本侵略者屠杀了我们许多的孩子和全部的俘虏[15]。1933 年，鲁迅先后撰写了《天上与地下》、《大观园的人才》、《诗和豫言》三篇杂文抨击对日态度暧昧、立场“似战似和、亦降亦守” 的汪精卫，讥嘲其 “半推半就假作娇痴”，有如“老鸨婆哭火坑”[16]，又援引汪精卫本人的诗句“此辈封狼从瘈狗” 怒斥其甘做日寇帮凶。[17]\n\n对于清水君信口开河，诬称鲁迅从无抗日言论，有人当面质疑他说：“你说鲁迅不抗日，我终于找到《友邦惊诧论》，其中有‘日本军占领了东三省……’一句，不是抗日的吗？”[18] 清水君辩称：\n\n“很高兴━━你‘终于’找到了鲁迅似乎‘抗日’的一句言词，但是，请你再仔细推敲，这篇文章中的所谓‘友邦’是指谁？文章的主旨是骂谁的？我想只要不是傻子，都能看出鲁迅文中所指的‘友邦’是主要是指美国及国联，而借‘友邦’惊诧不惊诧，所骂的，是中华民国；至于提到‘日本人占领东三省’一句，则完全是用来证明美国及国联的‘虚伪’、中华民国政府的‘无能可耻’！这才是鲁迅的真正意思。”[19]\n\n这真是强盗逻辑。如果鲁迅对 “日本人占领东三省” 无动于衷，又怎么会愤怒斥责美国及国联的“虚伪”、中华民国政府的“无能可耻”？\n\n其次，清水君对文学史的常识也不甚了了。他两次提到所谓 “国防文学和抗日文学” 的口号，斥责鲁迅讽刺这两个口号，并将其视为 “鲁迅对国民政府的一切活动都无不尽冷嘲热讽挖苦诬蔑之能事” 的证据之一。这真是让人啼笑皆非。事实是，文学史上只有 “国防文学” 与“民族革命战争的大众文学”这两个口号之间的论争，一个由周扬提出，一个由同为左翼文论家的胡风提出，简称 “两个口号” 之争，并没有所谓 “国防文学”、“抗日文学” 之争，而且，无论是 “国防文学”，还是“民族革命战争的大众文学”，实质都是“抗日文学”。鲁迅支持“民族革命战争的大众文学” 这个口号，认为它有助于 “推动一向囿于普洛革命文学的左翼作家们跑到抗日的民族革命战争的前线上去”。[20] 这恰恰证明了鲁迅的抗日立场和 “不分阶级和党派，一致去对外”[21] 的大胸襟、大智慧。清水君等人斥责鲁迅 “冷酷无情地讽刺嘲讽” 一切抗战努力、在日寇入侵时“给中国人民泄气”，真不知道是无知，还是判断力有问题？\n\n关于鲁迅与日本的关系，憨子指控说：\n\n“每次国家有难，他首先想到的是往租界日本人家里躲，这都是有据可查的。他的密友内山完造是个日本特务头子，以上海为根据地，以鲁迅这样的中国文人朋友做掩护，不知道为日本皇军侵华做了多少铺垫和准备。1932 年日本军入侵上海——也就是凇沪抗战（也叫 128 事变），鲁迅挟全家老小躲到外国租界日本人内山完造的书店里……”\n\n张生则援引一位 “研究者” 的观点指出：\n\n“1906-1909 年鲁迅滞留东京历史很值得怀疑，没职业也没家庭资助，但在东京却过着富裕悠闲的生活，雇日本女佣，还资助二弟留学。资金何来，推测是日本特高科发工资，密探留学生动向。直到特高科派他去中国另有任务，才离开东京。一二八抗战爆发，他躲到特高科驻上海的联络站内山书店。”\n\n不过，张生本人也意识到 “不能仅凭鲁迅在日本经济来源不明和日本间谍关系密切就认定他是汉奸”，所以他以更骇人听闻的臆测与曲解来 “完美诠释”“一个汉奸的准确定位”：\n\n“为了报答日本主子，凡是对日本有利的事情，鲁迅都是大力支持。凡是对中国有利的事情，鲁迅都大力反对。…… 中国青年动辄被日本人杀戮，不是因为日本人残酷残忍，而是因为我们不认真！我们的大水也没有日本的水温柔，总之中国甚么都不如日本！鲁迅认为日本人是注定要像蒙古人那样征服中国的。”\n\n对于内山完造是日谍、鲁迅和他关系密切有汉奸之嫌的言论，鲁迅本人曾愤怒地驳斥说：“至于内山书店，三年以来，我确是常去坐，检书谈话，比和上海的有些所谓文人相对还安心，因为我确信他做生意，是要赚钱的，却不做侦探；他卖书，是要赚钱的，却不卖人血：这一点，倒是凡有自以为人，而其实是狗也不如的文人们应该竭力学学的！”[22]且不论鲁迅的 “确信” 是否有盲点，但根据谁指控谁举证的原则，那些指控鲁迅替日本作密探或打手的人必须提出确凿证据，如仅凭臆测作出判断，则纯属诛心之论。\n\n对于清水君从鲁迅杂文中 “提炼” 出来又被张生 “复制“的“中国青年被日本人杀戮是因为我们不认真”、“中国的大水不如日本温柔”、“日本人是注定要像蒙古人那样征服中国的” 等“媚日反中”的观点，只要放回原文的语境，就可以清晰地看出鲁迅的本意和 “鲁黑” 们曲解的“功力”。\n\n所谓 “中国青年被日本人杀戮是因为我们不认真” 之说，见于鲁迅的杂文《今春的两种感想》，原文如下：\n\n“昨年东北事变详情我一点不知道，想来上海事变诸位一定也不甚了然。就是同在上海也是彼此不知，这里死命的逃死，那里则打牌的仍旧打牌，跳舞的仍旧跳舞。打起来的时候，我是正在所谓火线里面，亲遇见捉去许多中国青年。捉去了就不见回来，是生是死也没人知道，也没人打听，这种情形是由来已久了，在中国被捉去的青年素来是不知下落的。东北事起，上海有许多抗日团体，有一种团体就有一种徽章。这种徽章，如被日军发现死是很难免的。然而中国青年的记性确是不好，如抗日十人团，一团十人，每人有一个徽章，可是并不一定抗日，不过把它放在袋里。但被捉去后这就是死的证据。还有学生军们，以前是天天练操，不久就无形中不练了，只有军装的照片存在，并且把操衣放在家中，自己也忘却了。然而一被日军查出时是又必定要送命的。像这一般青年被杀，大家大为不平，以为日人太残酷。其实这完全是因为脾气不同的缘故，日人太认真，而中国人却太不认真。中国的事情往往是招牌一挂就算成功了。日本则不然。他们不像中国这样只是作戏似的。日本人一看见有徽章，有操衣的，便以为他们一定是真在抗日的人，当然要认为是劲敌。这样不认真的同认真的碰在一起，倒霉是必然的。”[23]\n\n这段文字将 “九一八” 事变后上海抗日青年的 “不认真” 与日军杀害抗日青年的 “认真” 态度作了讽刺性的对照。上海抗日青年的 “不认真” 体现在练操没有恒心和马虎对待操衣、抗日徽章等物品，以致于严峻的抗日形同 “作戏”。与此相反，日本人在镇压抗日青年时却极为“认真”，凡有徽章、操衣者，虽然“并不一定抗日”，通通捉走杀害。很显然，鲁迅的本意是对“招牌一挂就成功” 的“招牌主义”做事风格与中国青年对待抗日的儿戏化态度加以揭示和批评，决不是赞赏日本人的认真 “杀人”，更不是对中国青年的惨遭屠戮冷嘲热讽。“鲁黑” 们之所以将 “中国青年被日本人杀戮是因为我们不认真” 之说看成是媚日言论，一方面是断章取义，另一方面是读不懂鲁迅的反讽语气和 “哀其不幸，怒其不争” 的悲愤心态。\n\n所谓 “中国的大水不如日本温柔”，出处是《我要骗人》中的如下一句：\n\n“诚然，两三年前，是有过非常水灾的，这大水和日本的不同，几个月或半年都不退。”[24]\n\n如果单看这一句，确实容易让人误会鲁迅有媚外心理，连一场水灾都要牵扯到中日优劣，可是如果看了后文，读者当能明白鲁迅的本意是批评当时政府的腐败无能、视民如草：\n\n“但我又知道，中国有着叫作‘水利局’的机关，每年从人民收着税钱，在办事。但反而出了这样的大水了。我又知道，有一个团体演了戏来筹钱，因为后来只有二十几元，衙门就发怒不肯要。连被水灾所害的难民成群的跑到安全之处来，说是有害治安，就用机关枪去扫射的话也都听到过。”[25]\n\n所谓 “日本人是注定要像蒙古人那样征服中国的”，出处是《民族主义文学的任务和运命》。在这篇杂文中，鲁迅提出了这样的观点：“在亚细亚的黄人中，现在可以拟为那时的蒙古（即成吉思汗时期的蒙古）的只有一个日本。”[26] 乍一看，鲁迅似乎真是在礼赞日本人的剽悍和种族的优胜，也真是在期待日本勇士如蒙古人般征服中国。可是读完上下文后就可以明白鲁迅其实是在嘲讽黄震遐等中国 “民族主义文学家” 所希望的是“（蒙古元帅）拔都的统驭之下的‘友谊’，不是各民族间的平等的友爱”：\n\n“拔都死了；在亚细亚的黄人中，现在可以拟为那时的蒙古的只有一个日本。日本的勇士们虽然也痛恨苏俄，但也不爱抚中华的勇士，大唱‘日支亲善’虽然也和主张‘友谊’一致，但事实又和口头不符，从中国‘民族主义文学者’的立场上，在己觉得悲哀，对他加以讽喻，原是势所必至，不足诧异的。\n\n果然，诗人的悲哀的豫感好像证实了，而且还坏得远。当‘扬起火鞭’焚烧‘斡罗斯’将要开头的时候，就像拔都那时的结局一样，朝鲜人乱杀中国人，日本人‘张大吃人的血口’，吞了东三省了。莫非他们因为未受傅彦长先生的熏陶，不知‘团结的力量’之重要，竟将中国的‘勇士们’也看成菲洲的阿剌伯人了吗？！”[27]\n\n在鲁迅看来，当时的黄震遐之流虽以中国 “民族主义文学家” 自居，其实是 “殖民地顺民”，他们所主张的“友谊”，是殖民者和被殖民者的“友谊”。[28] 这样的 “友谊” 和日寇所标榜的 “日支亲善” 一样，都是麻醉中国人抗争意志和民族独立意识的谎言。在 “墨写的谎言” 背后，则是 “朝鲜人乱杀中国人，日本人‘张大吃人的血口’，吞了东三省” 这一桩桩 “血写的事实”。只要读懂了鲁迅的本意是揭露和批判打着“民族主义” 旗号的 “宠犬派文学” 和打着 “亲善” 招牌的殖民者，就不可能得出 “在鲁迅的眼中，日本人是注定要像蒙古人那样征服中国的” 这样的结论。此外，鲁迅笔下的 “日本勇士” 云云，分明是反讽，清水君却大惊小怪地批评说：“日本的‘勇士们’，亏我们的‘族魂’喊得出！”，真是让人啼笑皆非。综观 “鲁黑” 们对鲁迅观点的种种误读、曲解，除了刻意丑化、哗众取宠等主观意图之外，恐怕还得归因于学识、理解力的不足。\n\n胡风在鲁迅逝世一周年之际撰文总结鲁迅精神说：“鲁迅一生是为了祖国的解放、祖国人民的自由平等而战斗了过来的。但他无时无刻不在‘解放’这个目标旁边同时放着叫做‘进步’的目标。在他，没有为进步的努力，解放是不能够达到的：在神圣的民族战争期的今天，鲁迅的信念是明白地证实了：他所攻击的黑暗和愚昧是怎样地浪费了民族力量，怎样地阻碍着抗战怒潮的更广大的发展。为了胜利，我们有努力向他学习的必要。”[29]诚如胡风所言，鲁迅作为一名不惜 “贼于众” 的精神界战士，一生以推动中国的进步为使命，他对传统文化、国民劣根性与时政时弊的批判，都是以民主、科学、自由、平等等现代精神为指南，意在催生一个健康强健、高度文明的新中国。对他而言，救亡与启蒙，民族解放和社会进步，民族独立和人的觉醒是辩证统一的。如果不能深刻地认识鲁迅精神，就不能理解他为什么在民族危亡之际依然坚持启蒙与批判，也就不能理解他为什么在中日对垒之时还会对日本的长处加以肯定。他的汉奸之谥，正是他 “贼于众” 的代价，也是理性爱国主义的代价。\n\n注释：\n\n[1] 本段落五则引文均见于胡风《如果现在他还活着——纪念鲁迅先生逝世五周年》，《胡风全集》第 2 卷，670 页，武汉：湖北人民出版社，1999。\n\n[2] 清水君的网文见其博讯博客（http://blog.boxun.com/hero/qingshuijun/70_1.shtml），憨子的网文见其天涯博客（http://blog.tianya.cn/post-26041-8719113-1.shtml），张生的网文见博客中国（http://kmzj13888.blogchina.com/1286866.html）。本文所引用的这三位写手的观点如出自这三篇网文，为免注释繁琐，不再一一注明出处。\n\n[3] 鲁迅《伪自由书 · 前记》，《鲁迅全集》第 3 卷，423 页，北京：人民文学出版社，1973。\n\n[4] 钱理群《话说周氏兄弟》，116-117 页，济南：山东画报出版社，1999。\n\n[5] 鲁迅《中国小说史略》，219 页，北京：人民文学出版社，1952。\n\n[6] 鲁迅《中国小说史略》，189 页。\n\n[7] 鲁迅《汉文学史纲要》，《鲁迅全集》第 10 卷，581 页。\n\n[8] 鲁迅《中国人失掉自信力了吗》，杨义选评《鲁迅作品精华》第 3 卷，324 页，北京：三联书店，2014。\n\n[9]鲁迅《写在 <坟> 后面》，鲁迅《坟》，278 页，北京：人民文学出版社，1980。\n\n[10] 鲁迅《狂人日记》，杨义选评《鲁迅作品精华》第 1 卷，11 页。\n\n[11] 鲁迅《答徐懋庸并关于抗日统一战线问题》，《鲁迅全集》第 6 卷，533-534 页，1973。\n\n[12] 鲁迅《答徐懋庸并关于抗日统一战线问题》，《鲁迅全集》第 6 卷，535 页。\n\n[13] 鲁迅《关于中国的两三件事》，《鲁迅全集》第 6 卷，21 页。\n\n[14] 鲁迅《在现代中国的孔夫子》，《鲁迅全集》第 6 卷，319 页。\n\n[15] 鲁迅《我要骗人》，《鲁迅全集》第 6 卷，486-488 页。\n\n[16] 鲁迅《大观园的人才》，《鲁迅全集》第 4 卷，541 页。\n\n[17] 鲁迅《诗和豫言》，《鲁迅全集》第 5 卷，272 页。\n\n[18]清水君《就 <鲁迅——汉奸还是族魂？> 一文答读者问》（http://blog.boxun.com/hero/qingshuijun/71_1.shtml）。\n\n[19]清水君《就 <鲁迅——汉奸还是族魂？> 一文答读者问》。\n\n[20] 鲁迅《答徐懋庸并关于抗日统一战线问题》，《鲁迅全集》第 6 卷，538 页。\n\n[21] 鲁迅《论现在我们的文学运动》，《鲁迅全集》第 6 卷，590 页。\n\n[22] 鲁迅《伪自由书 · 后记》，《鲁迅全集》第 4 卷，597 页。\n\n[23] 鲁迅《今春的两种感想》，《鲁迅全集》第 7 卷，812-813 页。\n\n[24] 鲁迅《我要骗人》，《鲁迅全集》第 6 卷，489 页。\n\n[25] 同上。\n\n[26] 鲁迅《“民族主义文学” 的任务和运命》，《鲁迅全集》第 4 卷，303 页。\n\n[27] 同上。\n\n[28] 鲁迅《“民族主义文学的任务和运命”》，《鲁迅全集》第 4 卷，302 页。\n\n[29] 胡风《关于鲁迅精神的二三基点——纪念鲁迅先生逝世一周年》，《胡风全集》第 2 卷，502 页。\n\n为了能够更好地服务于关注网站的老师和朋友，激流网现推出会员制度：详见激流网会员办理方案\n\n为了避免失联请加 + 激流网小编微信号 jiliu1921",
				"added": 1518520980
			}
		]
	},
	"comment_vote": {}
}