{
	"next_comment_id": 17,
	"user_name": "Eightyfour",
	"hub": "1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a",
	"post_like": {
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1540815703": 1540858168,
		"14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1541353260": 1541352464,
		"1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1541519916": 1541519273,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1542119726": 1542123433,
		"1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1549015413": 1549026892,
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1551186749": 1551206417,
		"131Seivv6aH8vnohPmYPcPwPfZ1a5ubMMs_1553710453": 1553734187,
		"12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1554334907": 1554385738
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "someone abusing people's sense of morality for personal gain, who would've thought?",
			"post_uri": "13BRGFtvaQ4ERHh8vtYMZC1mK4FaeSBvvw_1540858853",
			"date_added": 1540861844
		},
		{
			"comment_id": 2,
			"body": "@Mv00ðŸ°ðŸ¶ðŸ’¡: >Animal Firm, by George Corpwell",
			"post_uri": "1BphMmzmrPc3zawVj6ES9va18a6PxJqb47_1541519916",
			"date_added": 1541765575
		},
		{
			"comment_id": 3,
			"body": "To reach people using Medium, what better platform than Medium. I doubt writing \"Why Medium is bad\" on ZeroNet would convince anyone not already convinced of that position.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1542119726",
			"date_added": 1542123511
		},
		{
			"comment_id": 4,
			"body": "I really like eating meat, and the government can tear my last steak from my cold dead jaws. But I eat vegetarian about 2-3 days in a week, in part because I prefer to cook vegetarian food over meat (I'm a bit lazy when it comes to cooking), but also because it's probably healthier for me and for the environment.",
			"post_uri": "1PSaHi14Xh4Kjo3yyjDgbRtj4YLQgWV4QJ_1546510193",
			"date_added": 1546645402
		},
		{
			"comment_id": 5,
			"body": "And I really appreciate the absence of mobs going after people left and right for the littlest things. This remains a  generally friendly and polite place even though there's people with wildly differing opinions. (that will sadly change when it gets popular)",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1548032160",
			"date_added": 1548278593
		},
		{
			"comment_id": 6,
			"body": "@Kaffie: IPFS isn't a ZeroNet rival and I imagine we'll have some form of convergence in the future (there's no reason why I shouldn't be able to download and host zeronet content through IPFS as well!) One of the other important reasons why ZeroNet is used more is Tor support.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549271102",
			"date_added": 1549330125
		},
		{
			"comment_id": 7,
			"body": "I don't care about the whole life vs abortion thing, both sides have good and bad arguments. But I find it hilarious just how far some people are willing to push it. There was that US politician talking about how if a baby is viable but born early it can still be aborted after birth because it's within the third trimester.",
			"post_uri": "14ytAKDfNjArMTqGecTi7ginG3aZTsRAum_1549280348",
			"date_added": 1549330480
		},
		{
			"comment_id": 8,
			"body": "@Kaffie: @Geekless: without Tor support you lose Chinese users, a lot of M-E users, probably Russian users too. On top of that there's plenty of users who don't need Tor but still value the option of using it being there (eg. they are worried about the future state of internet freedom in their countries). Sure, when things get worse the other networks might start implementing anonymization, but being ahead of the rest on that front is definitely a plus.\n.\n@FraYoshi: True, comparing ZeroNet and IPFS is unfair to both as they solve different problems. I was thinking about Dat/Beaker for my comparison.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549271102",
			"date_added": 1549372701
		},
		{
			"comment_id": 9,
			"body": "Yeah, it's really neat. I was thinking of making a game engine to play the game, but I'd have to first understand the game's rules and they're not laid out very clearly for now.",
			"post_uri": "1FKuNsExQML7APuNmkCV8uzB5pKupcmnck_1550250739",
			"date_added": 1550250385
		},
		{
			"comment_id": 10,
			"body": "I got banned from yt for mocking hillary, which was probably for the best because now I need to move completely to alternatives and it makes me even more determined to undermine the GAFAM globalist tech elites",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1551087133",
			"date_added": 1551206606
		},
		{
			"comment_id": 11,
			"body": "As much as this shows shoddy and unethical practices by the BBC, hate speech is a stretch. Those jokes probably had no malice behind them: the real issue is that the BBC would've used the same jokes coming from Tommy as proof of his alleged racism and homophobia. The most ridiculous part was that about the cannibals, Tommy should've left that part out, it drags the good points he presents down.\nAlso, have you read this? https://www.rt.com/op-ed/452511-social-media-censorship-bans/",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1551263813",
			"date_added": 1551264789
		},
		{
			"comment_id": 12,
			"body": "Welcome aboard and abroad!",
			"post_uri": "1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa_1554228134",
			"date_added": 1554236705
		},
		{
			"comment_id": 13,
			"body": "I'll upload some OC soon, won't be anything mindblowing.",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1554334907",
			"date_added": 1554430190
		},
		{
			"comment_id": 14,
			"body": "You don't have a CoC. That's what makes it awesome. No authoritarian shits to tell you what you can or can't say.\nThe owner of a zite can ban people from it, and each user can block users (or use blocklists made by others) to get rid of whatever it is they don't like. Let the crazies shut themselves in their echochambers. If the owner of a zite becomes censorious you could clone it and start a new one, or you could make a plugin that downloads \"blocked\" ids files anyway. Currently there have been no such cases so no one has had to do it, but we could.",
			"post_uri": "1Ks4pQJ9m3x6romdR28XTr8nbdNNLaspEa_1554509273",
			"date_added": 1554578077
		},
		{
			"comment_id": 15,
			"body": "@Duende: you too retard",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1548032160",
			"date_added": 1555888126
		},
		{
			"comment_id": 16,
			"body": "does Streamz have chat yet? Looking forward to be able to watch older streams because right now I seem to be missing all of them...",
			"post_uri": "12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu_1555809761",
			"date_added": 1556040389
		}
	]
}