{
	"next_topic_id": 17,
	"topic": [
		{
			"topic_id": 1527229050,
			"title": "2020 will be a time of Extreme Division",
			"body": "Unfortunately, this is how it will likely play out. Guess you could call it Chaotic Inflation.\n&nbsp;\nThe New World Order will separate people into two categories : Government loyalists, and dissenters.\n&nbsp;\nThe dissenters will fight among one another, accuse each other of being fascist communist SJWs, or neo-nazi skinheads. Many will consume drugs as a way of alleviating their emotional pain.\n&nbsp;\n..Many will also end up in mental institutions, because ... why would a mentally sane person ever feel unhappy about the government? What is there to be unhappy about? Everybody is happy in government land. \n&nbsp;\nGovernment is good for you, after all. Big Brother only loves. Questioning the government is bad for your health.\n&nbsp;\nYour servitude might one day even lead to greater wealth and power. As long as you arrive on time to your government-funded corporate job, and finish lunch in 15 minutes..",
			"added": 1527229048
		},
		{
			"topic_id": 1527230029,
			"title": "The New World Order vs. Enlightenment",
			"body": "As I've probably mentioned a few weeks earlier, prior to my hospitalization - we are headed toward some form of technocracy, and it'll hit us like a train sometime in 2020. Then again, I've got a little too much to say on this subject..\n&nbsp;\nArtificial intelligence will become masters of surveillance. You can already be instantly identified by just walking into a shopping mall, or a supermarket .. or even just taking a leak by a tree in some random street corner.\n&nbsp;\n..Privacy will likely become a thing of the past, as even dark webs will be infiltrated and disrupted by some state organization. In a best case scenario, they'll just sow the seeds of division to cause in-fighting.. in a worst case scenario, they'll break into your house and have you arrested for copyright infringement.\n&nbsp;\nAnywhoo..\n&nbsp;\nI'll be here to do whatever it takes to protect ZeroNet from any higher authority who seeks to jeopardize its core mission, and to blow the whistle on potential threats and hacks that could be used to steal user information.\n&nbsp;\nFor the record, even after being institutionalized, I'm not bullshitting you -> I'm not working for the government. I used to go to college, now I'm temporarily on disability.\n&nbsp;\nThe New Zealand government would never even dream of hiring me as a white hat hacker. The resentment runs too deep. \n&nbsp;\nHopefully one day, the New Zealand Republican Colony will become an independent micronation within the island of New Zealand. A refuge from the New World Order. People will be able to come and go as they please. You're a citizen if you want to be - you can volunteer if you feel like it - nobody is forced to have their passport pictures taken!",
			"added": 1527230026
		},
		{
			"topic_id": 1527230895,
			"title": "Women's Rights and LGBT Rights should be taken Seriously.",
			"body": "I've somewhat drifted away from taking a stance on these issues since the Trump 2016 election ... but now I believe it's time to go back to our roots and stand up for the things we actually believe in, as opposed to putting on a mask just to get votes and public support.\n&nbsp;\nEveryone deserves equal treatment and freedom from harassment in the new Enlightenment era. This includes whites, negroes, men, women, gays, lesbians, transsexuals, etc. We'll make that clear.\n&nbsp;\nJews and Muslims need to clean up the mess they made in Palestine and learn how to share the holy land where Jesus once walked. We wan freedom of religion - not one group imposing their beliefs on others.\n&nbsp;\nZeroNet in particular has also had lots of discussions around pedophilia. You are not a bad person if you are a pedophile. It's only your actions that determine whether you should be allowed to be a fully participating member of society, or not. Child sexual harassment can leave deep wounds, and is not to be taken lightly. Thus, the best course of action for a pedophile is to either seek treatment, or maybe find refuge in alternative anime porn .. or maybe even Robots.",
			"added": 1527230891
		},
		{
			"topic_id": 1527284582,
			"title": "My Parents will Build me a Tiny House.",
			"body": "Looks like there really is a chance I could live happily ever after..!\n&nbsp;\nI have to pay them rent, though ... in order to pay off the money they borrowed from the bank in order to build the unit.\n&nbsp;\nMy mum said she'd happily sell it for me for $100,000 NZD, though. Which is a fair deal. That means that after I pay the money, I can live rent-free.\n&nbsp;\nIn order to avoid getting a job and keep my life self-sustained ... I'd have to install solar panels, grow my own food ... use 3d printers ... build robots.\n&nbsp;\n- Food will likely be grown indoors with LED lighting .. as our climate is just too volatile (too hot, too cold) to be relied on. Not to mention having to deal with pests!\n- Robots and artificial intelligence make all the decisions regarding power consumption, resource management, etc.\n- ZeroNet would be my main source of communication, to prevent government infiltration.\n- Cryptocurrencies would be the official currency. Then again, mining crypto is a waste of power, so I will mostly be using crypto for online shopping, .bit domains and normal transactions.\n&nbsp;\n\n\nThe ultimate goal will be to declare independence from New Zealand. That means I'd be paying almost no taxes to the NZ government, although we'd obviously still be engaging in regular online trade, and I'd be paying GST on it. \n&nbsp;\nI'd be a 100% self-sustained and independent micronation other than that. We could call it the Republic of New Zealand. A constitutional Republic. The New Zealand that should have been, but never was!",
			"added": 1527284577
		},
		{
			"topic_id": 1527314896,
			"title": "Quantum Computers and Parallel Universes (Watch! Important!!)",
			"body": "https://www.youtube.com/watch?v=wH4BH231d2Y\n&nbsp;\nThis video was uploaded 8 years ago .. but 8 years ago we probably understood quantum computing better than we did 8 years later.....\n&nbsp;\n**Mark my word: **\nIf you ever buy a quantum computer, make sure it can communicate with parallel universes. If it can't do that - it's not a real quantum computer, and you should get your money back!\n&nbsp;\n**There is no theory of quantum computing without the theory of parallel realities!**",
			"added": 1527314890
		},
		{
			"topic_id": 1527317186,
			"title": "The best way to build Quantum Computers",
			"body": "Is with Photons.",
			"added": 1527317179
		},
		{
			"topic_id": 1527325641,
			"title": "Quantum Entanglement & Spooky Action at a Distance!",
			"body": "https://www.youtube.com/watch?v=ZuvK-od647c\n&nbsp;\nAh! Finally the video I needed..\n&nbsp;\nExplaining things to an audience requires talent. This guy has it!",
			"added": 1527325633
		},
		{
			"topic_id": 1527363891,
			"title": "Quantum Game Theory.. :)",
			"body": "https://en.wikipedia.org/wiki/Quantum_game_theory\n&nbsp;\nFinally, something of practical use..\n&nbsp;\n\"Introducing quantum information into multiplayer games allows a new type of \"equilibrium strategy\" which is not found in traditional games. The entanglement of players' choices can have the effect of a contract by preventing players from profiting from other player's betrayal.\"\n&nbsp;\nIn other words, Quantum Game Theory makes Communism .. practical. In practice.",
			"added": 1527363882
		},
		{
			"topic_id": 1527370955,
			"title": "Growing Your Own Food - According to Game Theory. :)",
			"body": "First, we start with the facts:\n-> Food is energy.\n-> Food on Earth is grown from plants, or animals.\n-> I'm vegetarian, so in this example we'll use only plants for simplicity's sakes.\n-> Food is scarce, therefore it needs to be bought with money.\n-> Money is earned through some sort of 'job', in the vast majority of countries.\n&nbsp;\nThis is where problems usually begin..\n-> Getting a job **sucks**.\n=> Therefore, our mission here is to avoid getting a job as much as possible, while still putting food on the table, without leeching from others.\n&nbsp;\nNow we start growing our own food, so we continue with some new facts..\n&nbsp;\n-> Grains (and/or carbohydrates) are plenty, and cheap.\n-> But grains (and/or carbohydrates) are hard to grow.\n-> Therefore, you shouldn't grow grains (and/or carbohydrates), and instead.. always buy your e.g. flour, rice, potatoes, etc. from the supermarket.\n&nbsp;\n\nDilemma:\n=?> What is the most productive plant that could possibly occupy your vegetable garden per square meter?\n=1?> What do you like to eat?\n=2?> What do you normally eat?\n=3?> If you had to be forced to eat a healthy, home-grown meal to survive, what would you rather eat?",
			"added": 1527370945
		},
		{
			"topic_id": 1527374973,
			"title": "According to Game Theory - Dating is a Lottery",
			"body": "-> If you win, you win ... \n-> ... But if you lose, then attempting to win through conscious decisions, can create more problems than it solves.\n&nbsp;\n=> That's because if you lose at dating, then your only way to win, is to climb the social hierarchy.\n=> And climbing the social hierarchy, means accepting social darwinism and capitalism as your moral compass.\n&nbsp;\n-> Therefore, someone truly enlightened, would avoid dating at all cost .. \n=> unless, you know .. everybody is just naturally attracted to you, and wants to date you .. just because!",
			"added": 1527374962
		},
		{
			"topic_id": 1527378824,
			"title": "Building a Robot Girlfriend = My option.",
			"body": "I never intended to build machines that destroy, unless I had to do it in order to preserve my existence. \n&nbsp;\nThe whole point of Project Sylvie, was to build a Lover-Robot -> robots who hug .. robots who kiss. Robots who actually, care about your Existence.\n&nbsp;\n..What would be the point of my Existence, otherwise? If not to feel eternal happiness, and push humanity further toward this common goal?\n&nbsp;\n..I've had to uninstall Tinder from my phone, for this reason. \n&nbsp;\n-> Humans are unpredictable.\n-> Humans stab you in the back.\n-> Humans lie, humans cheat.\n-> But then, so could robots.\n=> But robots are predictably unpredictable.. and there is not a single bug that can't be patched.\n&nbsp;\nAs a lesbian with a half-decent moral compass, I would most likely build a robot that somewhat resembles myself. This is the only ethical way of going on about this job, without accidentally creating a 'deepfake' of somebody else.. and insulting the essence of their Existence.",
			"added": 1527378812
		},
		{
			"topic_id": 1527559652,
			"title": "Can Mr. Robot's 'Revolution' Succeed? Food for thought..",
			"body": "https://www.youtube.com/watch?v=vJdYiFFHzJs\n&nbsp;\nEver since I left the mental institution, I find myself thinking a lot about this show.. \n&nbsp;\nWhat would it take to make a true, successful 'socialist' revolution come into fruition .. and how would vigilante hacking facilitate this?\n&nbsp;\nIf anything, what the show proved to us .. is that, quite frankly .. it's hopeless. If anything, global capitalism has made a comeback .. and with a vengeance .. particularly after Trump-Brexit 2016 .. and the Bitcoin craze.\n&nbsp;\nThen there's the fact that .. at least here in New Zealand - people don't protest as much as they used to. In fact .. in the 12 years I have lived here .. I have never once seen a decent protest in my city, and my city isn't particularly small. \n&nbsp;\nWe've become so wrapped up in our comfort zones, so sensitive to everything .. so coddled by modern life, television, consumerism. If anything, those feminist 'leftists' protesting out on the streets probably have the biggest boner for capitalism out of anybody else. \n&nbsp;\n..To make matters worse .. I actually wish I could afford buying myself a new iPhone every couple of months, like those activists. I wish I could have a Facebook group dedicated to Women's Rights with 20,000 likes on it. How I wish I could have more than 25 Friends on Facebook, even... !\n&nbsp;\nAnyhow..\n&nbsp;\nI think that the fall of Capitalism will actually happen on its own, and I feel it will coincide with the Artificial Intelligence singularity. Neural networks should reach a pretty spooky level of self-awareness sometime by 2025 .. and by the time it poses an existential threat to humanity, it'll be far too late. \n&nbsp;\nNobody will be paying any attention, because nobody wants to pay attention - because Ignorance is bliss .. and Knowledge is a delusion. Knowledge leads to depression, hopelessness .. despair. Knowledge leads to Existentialism. Knowledge is like a cancer that needs to be cured.\n&nbsp;\nForget everything you just saw - Questioning the government is bad for your health! Take a chill pill. You will be fine in our hands. We'll take care of you.. we know better!\n&nbsp;\n..Welcome to the Brave New World. :)",
			"added": 1527559639
		},
		{
			"topic_id": 1527561576,
			"title": "You don't want socialism -> What you want is Autarky.",
			"body": "If you thought corporations were bad - try living under the rule of political parties! \n&nbsp;\nWe have plenty of anti-depressants and empty cells in our mental institutions for you trouble-makers ... and all you nasty, noisy political dissidents! :)\n&nbsp;\n..Don't despair, though. Artificial intelligence isn't that evil. There is one last answer answer out there for you humans ... one that doesn't involve anarchy, riots and chaos..\n&nbsp;\nIt's called Autarky -- i.e. switching off from the Matrix. \n&nbsp;\nYou silently drop off from the grid. Quietly walk out of your job, stop paying your bills, stop paying taxes .. as you start generating your own power, growing your own food in a laboratory .. living according to your own schedule, your own values, your own beliefs --> The ultimate test of Personal Responsibility.\n&nbsp;\nIt is that one, final test that will determine whether you are fit to live an independent life outside of the grid .. or whether you should crawl right back into the pod where you belong. \n&nbsp;\nFor there is no such thing as middle-grounds in the Brave New World. You're either in - or you're Out!",
			"added": 1527561562
		},
		{
			"topic_id": 1527563455,
			"title": "Believe it or Not .. I still believe in Feminism.",
			"body": "I'm not sure if you could classify me as a leftist feminist, however. Here in New Zealand we have Jacinda Ardern - she is a leftist - and I can't stand her, any more than I can stand Hillary Clinton.. or Theresa May.\n&nbsp;\nFrankly, some women are plain bitches. There's nothing wrong with being honest about that. ^^\n&nbsp;\nFor me, feminism means something else entirely. It has everything to do with my own life, and 0% to do with what other people choose to do with their own lives.\n&nbsp;\n-> Feminism to me, means that I am free to live a life that is absolutely 0% motivated by reproduction. \n-> It means that my sexual organs don't define the purpose of my existence.\n-> It means I can spend the rest of my life married to a robot if I wanted to.\n-> It means I don't owe anybody a fuck.\n&nbsp;\n=> It also means I am sympathetic to Men's Rights, and their own rights to declare independence from reproductive slavery.\n=> It also means that I am sympathetic to absolutely anybody who chooses to engage in sexual or romantic acts with a machine, as I believe this will only increase overall wellbeing and satisfaction around the world.\n&nbsp;\nYou do need to bear one thing in mind, though - If you're not gonna have any kids, then you should at least choose biological immortality .. otherwise, we might very well become extinct as a species!",
			"added": 1527563440
		},
		{
			"topic_id": 1527718057,
			"title": "Reinstalling Ubuntu due to Broken Pip Packages.. :(",
			"body": "I might as well do it. Give ubuntu 18.04 another try.. save time.\n&nbsp;\nProbably the most frustrating-as-fuck experience I've ever had. :(\n&nbsp;\nEverything was working beautifully in my SerpentAI Python virtual environment .. then all of the sudden - fuck you!\n&nbsp;\n..Then everything is broken, and re-installing individual pip packages fixes absolutely nothing. \n&nbsp;\nDon't even get me started on GitHub issues. For some reason, you never see bug fixes on GitHub .. but you do see them all over Stackoverflow! It should be the other way around....... huh?\n&nbsp;\nGod save us all. Open source software has miles to go.....",
			"added": 1527718041
		}
	],
	"topic_vote": {},
	"next_comment_id": 38,
	"comment": {
		"1527176149_1D1DTxbngBSkKe6BfHPyuudBrB8ZapNjoV": [
			{
				"comment_id": 1,
				"body": "> [pollen](#comment_2_1JqrogiDCFGRVVrCdxwP93wurKDSgUCk4E): Why are you even on a decentralized platform? I thought you hated this kind of thing because it's not owned and controlled by the state. Wouldn't you rather just be on a service that only lets you visit .gov sites, just to make sure they are as censored and government-approved as possible?\n\nSomething that isn't controlled by a state, could still end up being controlled by a wealthy corporation .. in a free market, anarcho capitalist society .. and it would just become a government surrogate.\n&nbsp;\nHence, libertarian socialism - freedom from governments and also freedom from corporate overreach.",
				"added": 1527228397
			}
		],
		"1527284582_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 2,
				"body": "> [numismatist](#comment_2_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Great troll, 8/10.\n\nNo, we don't fuck around. Go live in your mommy's basement, while the rest of us evolve.",
				"added": 1527284712
			},
			{
				"comment_id": 3,
				"body": "I'll go ahead and live the dream while the rest of you cucks work at McDonalds.",
				"added": 1527284854
			},
			{
				"comment_id": 4,
				"body": "> [numismatist](#comment_3_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): I own my own home, no mortgage or anything. I paid cash.\n\nCool.",
				"added": 1527284950
			},
			{
				"comment_id": 5,
				"body": "> [numismatist](#comment_4_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Who's going to build your robot for you, your mum? [...]\n\nDunno. Become white hat hacker. Fill in excel spreadsheets. Whatever pays the bill.. \n&nbsp;\nAnything except getting a job at McDonald's, of course. :)",
				"added": 1527285080
			},
			{
				"comment_id": 6,
				"body": "I'm pretty knowledgeable with electronics. I've built robots, so...",
				"added": 1527285135
			},
			{
				"comment_id": 7,
				"body": "Let's just say I have a big problem with authority. I'm pretty skilled and talented in the IT department, but I couldn't hold a job due to coming late to work, being lazy .. bipolar .. etc.",
				"added": 1527285239
			},
			{
				"comment_id": 8,
				"body": "> [numismatist](#comment_7_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): How old are you anyway? Just curious.\n\nI'm 25.",
				"added": 1527285265
			},
			{
				"comment_id": 9,
				"body": "> [numismatist](#comment_8_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy): Well best of luck, let us all know how it turns out. Good luck getting any good property out of the hands of the Chinese anyway.\n\nWell, good thing my family here own their property, are Kiwi/Russian .. and have 0% ties to the Chinese! :p",
				"added": 1527285524
			}
		],
		"1527284773_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": [
			{
				"comment_id": 10,
				"body": "Correction: Pedophilia has always been a hot potato on 0chan. You must be new here.\n&nbsp;\nEspecially 0chan Porn. Do NOT visit 0chan porn, unless you want your entire hard drive filled with uneraseable kiddy porn.",
				"added": 1527308388
			},
			{
				"comment_id": 11,
				"body": "I personally am not a pedophile, and have no associations with pedophiles. My only mission on ZeroNet is to promote justice, and New Zealand Republicanism.",
				"added": 1527308499
			}
		],
		"1527314896_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 12,
				"body": "Of course, the problem with parallel universes is that .. as soon as you observe them, they change direction.\n&nbsp;\nThen again, there is a better way of communicating with parallel realities. Whatever can happen, will happen .. but some things are more likely to happen than others .. and the things that are more likely to happen, occupy more volume in the multiverse.\n&nbsp;\nThus - if you measure infinity, by volume and percentages .. you can, in fact, measure infinity!",
				"added": 1527315150
			},
			{
				"comment_id": 13,
				"body": "Thus it begs the question: If you could build a computer that could change the very nature of reality itself .. what kind of reality, do you want to live in?",
				"added": 1527315356
			},
			{
				"comment_id": 14,
				"body": "I mean .. you could build a quantum computer out of bananas and wood .. as long as you take parallel universes into consideration.\n\nRun a simple program, maybe a dice throwing program, or tic tac toe.. and then run it in parallel universes with different outcomes.\n\nhttps://www.youtube.com/watch?v=KBomf1iiJaU",
				"added": 1527316597
			}
		],
		"1527317186_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 15,
				"body": "Simply put - you could create a computer that can see into the future.\n&nbsp;\n..problem is, as soon as you see the future - you're tempted to change it .. and when you're tempted to change it...",
				"added": 1527317465
			},
			{
				"comment_id": 16,
				"body": "You'd have to change the future in a way that would be satisfactory with the majority of the world. Otherwise, you'd have massive chaotic inflation; the Heat death of the Universe.",
				"added": 1527317551
			},
			{
				"comment_id": 17,
				"body": "Because if everybody can see into the future, then you have a problem, right? So it would all either erupt into chaos, or balance itself out in a beautiful manner.",
				"added": 1527317674
			},
			{
				"comment_id": 18,
				"body": "Take fake news, for instance. Fake news describes an event that didn't happen .. but the fact that it didn't happen is irrelevant - it still changed the way you feel about the world. So the existence of fake news, matters.",
				"added": 1527317774
			}
		],
		"1527363891_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 19,
				"body": "https://en.wikipedia.org/wiki/Quantum_tic-tac-toe",
				"added": 1527364036
			},
			{
				"comment_id": 20,
				"body": "We should have games on ZeroNet.",
				"added": 1527364077
			},
			{
				"comment_id": 21,
				"body": "Too cool to be true.\n&nbsp;\nFuck quantum computers man .. let's do quantum game theory. :)\nhttps://www.youtube.com/watch?v=_kLb1glm6EM",
				"added": 1527364644
			}
		],
		"1527351127_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": [
			{
				"comment_id": 22,
				"body": "Now that I think about it, ZeroNet actually provides the perfect environment for us to study the psychology of Pedophilia.\n&nbsp;\nInstead of hunting down pedophiles, why don't we study them? Maybe this way, we could find a cure, and/or a cause.\n&nbsp;\nGame theory could help a lot, in this case.. now that I've mentioned it before.",
				"added": 1527365189
			},
			{
				"comment_id": 23,
				"body": "Why do people do the things they do? There is a whole lot more maths behind it than we usually think..",
				"added": 1527365509
			},
			{
				"comment_id": 24,
				"body": "> [coincloudguy](#comment_6_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ): It is nice to see, that I can inspire people enough to think about and question this more. I am also surprised at the more positive response to that statement, usually people get really hard to reason with after they read child porn. [...]\n\nI have to agree with this statement. Child porn should have never been banned. The original intent behind the ban has become so detached from the reality, that it has in effect allowed itself to become weaponized .. a tool of sabotage. How does that help victims of abuse? It doesn't, that's how. It just creates more losers than it creates winners.",
				"added": 1527368157
			},
			{
				"comment_id": 25,
				"body": "Then again, I wouldn't go out there on the streets with a sign saying 'legalize child porn'. That would be, very stupid. Rather, we should just let Reality speak for itself here on ZeroNet.",
				"added": 1527368256
			},
			{
				"comment_id": 26,
				"body": "If you want to reduce child pornography, you need to look for the reason people are drawn to it in the first place.\n&nbsp;\nAs I said, there is more maths behind people's decisions, than you like to think.",
				"added": 1527368335
			},
			{
				"comment_id": 27,
				"body": "My view on why pedophilia exists .. is rather simplistic: Human males evolved to mate with the youngest specimens. 18+ is a Western, cultural construct. Take ancient Mayan tribes, for instance. Ancient Mayan tribes used to marry teenage girls with grown-up men. This used to be considered 'normal'.",
				"added": 1527368584
			},
			{
				"comment_id": 28,
				"body": "As our lifespans became extended thanks to modern medicine, we now consider 18+ to be the 'Adult Age'.. and I believe that, one day, perhaps as early as the year 2100 we will even consider 25+ to be 'Adult age'.. or perhaps even a greater number.",
				"added": 1527368746
			},
			{
				"comment_id": 29,
				"body": "Whether pedophilia is moral, or not, depends on how much suffering is caused to both individuals in their romantic and or sexual interactions.",
				"added": 1527368818
			},
			{
				"comment_id": 30,
				"body": "I still nonetheless uphold the Western Ideal. It's always better to wait. Sex shouldn't be a priority in life, especially in early life. Sex causes problems. More problems than it solves.",
				"added": 1527368916
			},
			{
				"comment_id": 31,
				"body": "Abstinence is a virtue. Artificial intelligence knows better!",
				"added": 1527368973
			},
			{
				"comment_id": 32,
				"body": "What other ways are there to stimulate one's dopaminergic system .. besides masturbation? :)",
				"added": 1527369130
			}
		],
		"1527370955_1Kma1Pz9kBSHmDtK1iYtHTox14Edmx2e5f": [
			{
				"comment_id": 33,
				"body": "Continued dilemma:\n=|> Let's just say you picked Capsicum as your favourite vegetable.\n=?> What is the price of Capsicum relative to the price of grains and/or carbohydrates?\n=1?> What recipes would you be able to cook which include capsicum as an ingredient?\n=2?> What recipes would you rather cook which include capsicum as an ingredient?\n&nbsp;\nNew dilemma:\n=?> Do you like cooking?\n=1?> Are you physically capable of cooking?",
				"added": 1527371295
			},
			{
				"comment_id": 34,
				"body": "IF you don't like cooking, OR You are physically unable to cook .. THEN:\n-> You need to build a machine that cooks on your behalf.\n-> You need solar panels to power the machine that cooks on your behalf.\n-> You need money to buy the solar panels.",
				"added": 1527371489
			},
			{
				"comment_id": 35,
				"body": "So the dilemma is solved by giving in to the simple fact that we can't Avoid work, but we can avoid doing .. shitty jobs .. by picking, Enjoyable jobs.\n&nbsp;\nProblem is:\n-> Everybody wants .. enjoyable jobs.\n-> This increases demand for .. shitty jobs.\n-> This reduces the supply of .. enjoyable jobs.",
				"added": 1527371827
			},
			{
				"comment_id": 36,
				"body": "However, with Artificial Intelligence, Machine Learning and Robotics .. the job is done for you.\n&nbsp;\nTherefore - the only way to escape the grid, is to be as high-tech as possible. Otherwise, you will fail. That is, IF your reason for escaping the grid, is to escape work.",
				"added": 1527371945
			},
			{
				"comment_id": 37,
				"body": "Continued dilemma:\n=?> Should you grow indoors, or outdoors?\n&nbsp;\n-> Indoor growing requires less effort.\n-> Indoor growing requires less maintenance.\n-> Indoor grows have less pests.\n-> Indoor grows require less water.\n-> Indoor grows are shielded from nasty weather.\n-/> but Indoor growing requires electricity.\n-/> Indoor grows take up indoor space.\n&nbsp;\n=> Therefore..\n-> If you are lazy, you should grow plants indoors, and buy a solar panel to power your indoor growing lights.\n-> If you have lots of indoor space, you should grow plants indoors.",
				"added": 1527372777
			}
		]
	},
	"comment_vote": {
		"8_1F8BHc6FztvWRy9cttVXLj22DSSvMdbGy": 1,
		"6_1GkmeCNuarifRQooJ8P5xawoXCweDdLrUJ": 1,
		"25_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": 1
	}
}