{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1538004633,
			"title": "Legality Questions",
			"body": "Hey everyone! I had some questions that I hope someone can answer. Based on my understanding of the technology behind Zeronet, when you visit a site you download it to your computer and begin seeding it to others. Is that correct? If so, for how long does your device continue seeding the site? \n\nI'm concerned about the legal liability inherent in this project. If someone made, for example, a zeronet site that hosted copyrighted content what would my liability be if I visited it without knowing what it was? Would I, without full control, be legally liable for not only storing copyrighted content, but also distributing it? \n\nI am not expecting answers to the legal questions, just more on how the technology works and everyone's opinions on whether this could lead to legal issues.\n\nThanks all!",
			"added": 1538004632
		},
		{
			"topic_id": 1538061780,
			"title": "Echobot not working",
			"body": "Echobot is not returning my messages on zero mail. Any ideas on why this is?",
			"added": 1538061778
		},
		{
			"topic_id": 1541914175,
			"title": "Warhammer 40k pdfs",
			"body": "Don't know if there is a warhammer community of zeronet but I am really looking for pdfs of the 8th edition core rules and various armies. Anyone know where to download from?",
			"added": 1541914172
		}
	],
	"topic_vote": {
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": [
			{
				"comment_id": 1,
				"body": "This is a beautiful post",
				"added": 1538004695
			}
		],
		"1537816041_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 2,
				"body": "The European Union stomps on the sovereignty of all European states. It would be so much more palatable if European citizens had more of a direct voice in the trans-national government. \n\n*Praise the God-Emporer*",
				"added": 1538004909
			}
		],
		"1538004633_1Ny31DdkRx1wcA8bv2Uiybbex8YCXcYQTN": [
			{
				"comment_id": 3,
				"body": "How do you delete sites from your client? I may be inclined toward regular purges.",
				"added": 1538004991
			},
			{
				"comment_id": 4,
				"body": "> [krixano](#comment_559_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): In ZeroHello, you can click the 3 dots next to the zite and click delete. You can also drag the 0 button on the top right to the left, scroll down, and there's a delete button there.\n\nThanks for this! Also the drag to the side thing gives some cool info.",
				"added": 1538005993
			},
			{
				"comment_id": 5,
				"body": "So merger sites are the ones that automatically cause users to seed their content? How do you tell if a site is a merger or a hub?",
				"added": 1538010521
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_130_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Example:  Pretend there is a merger video sharing site, I create a hub and jam pack it full of tranny porn. Unless you visit the hub, it's as good as nonexistent to you. You won't seed the hub nor content, having never visited it, and the content won't be indexed, having never visited it.\n\nSee this is what I am concerned about though. I navigate to a site unknowing that there is bad content there.... Do I suddenly have all that bad content on my computer?",
				"added": 1538051749
			},
			{
				"comment_id": 8,
				"body": "> [krixano](#comment_561_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): Yes. You download a zite when you visit it. You also seed the zite. unless the illegal content uses optional files, then you must manually \"seed\"/download that file (depending on how the zite implements it). For example: Videos on KopyKate Big are not automatically downloaded. You have to manually do it through the zite. [...]\n\nThank you for the detailed explanation. This is extremely helpful and I really appreciate it. In regards to stopping users from hosting illegal content I actually have an idea about that. Maybe you could give some input on my idea.\n\nWhat if, by default, instead of downloading entire sites you just downloaded parts of the data. Similar to how raid 0 drives stripe data across multiple disks you would have all the data for a website and its content divided between several peers. This would mean that you couldn't access sites while offline, BUT in theory all of the information you are hosting and serving is just junk ones and zeroes until combined with info held by other peers. I think that this would alleviate my concerns over legal liability and make zeronet even more private.\n\nIn practice it might look like this:\n\nUser 1 visits a webpage consisting of a video and some text about the video. In order to open that page zero net reaches out to peers a, b, and c. Each of these peers holds a small piece of data that makes the text, video, and code that makes the site work. This info gets put together by zeronet and displayed for User 1. User 1 soon leaves the website and the a and b sections of data get automatically wiped from his computer. He now becomes a c peer and serves the c part of the content to other users.\n\nSo what do you think? Would this be possible? Useful? Impractical? I'm really interested in getting anyone's thoughts on this.",
				"added": 1538060441
			},
			{
				"comment_id": 9,
				"body": "> [styromaniac](#comment_131_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Nopelist\n\nThanks! This is super helpful!",
				"added": 1538060473
			},
			{
				"comment_id": 10,
				"body": "> [thunder33345](#comment_239_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): while it could be possible it's draw backs should be noted: [...]\n\nThere should def be an option to save all info for certain sites or all sites if you choose. There is def a problem with some wasted resources here but I don't think the loss is too great. Also I am more concerned about seeding illegal content than downloading it tbh. Usually disseminating illegal content is a more severe crime.",
				"added": 1538062576
			}
		],
		"1536955600_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 7,
				"body": "Super phishing. Thanks for the warning!",
				"added": 1538051947
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 11,
				"body": "Everyone can still be pursued. The victims are still looking to sue the estate. The FBI could get warrants to search everything with virtually no contest.",
				"added": 1565523404
			}
		]
	},
	"comment_vote": {
		"2_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"48_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"131_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"561_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1,
		"241_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": 1
	}
}