{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1537922327,
			"title": "ZeroTalk says 4 files failed to update",
			"body": "What do I do about this?",
			"added": 1537922326
		}
	],
	"topic_vote": {
		"1537922327_1CV5o7cZSe9c3WZuCWpDain5zweerM842E": 1,
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1537592624_1CthCNo2eADyWkShCTBTVKGHy3WNXcj6Fh": 1,
		"1537805203_18CYChXXbhpzpNMTtoDLD5ARMEdddhkSsR": 1
	},
	"next_comment_id": 7,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "test!!",
				"added": 1537922022
			}
		],
		"1537652215_1BwLxLCsQ2D6WCnjtawEvPnTYNzH3CBaYg": [
			{
				"comment_id": 2,
				"body": "> \"1. Powerful and Continuing Nationalism - Fascist regimes tend to make constant use of patriotic mottos, slogans, symbols, songs, and other paraphernalia.\"\n\nYeah, but so do non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n\n> \"2. Disdain for the Recognition of Human Rights\"\n\nOK, this is reasonable, depending of course on how \"human rights\" are defined.\n \n> \"3. Identification of Enemies/Scapegoats as a Unifying Cause - The people are rallied into a unifying patriotic frenzy over the need to eliminate a perceived common threat or foe: racial , ethnic or religious minorities; liberals; communists; socialists, terrorists, etc.\"\n\nWhat about conservative Republicans as enemies/scapegoats? Why aren't they on that list too?\n \n> \"4. Supremacy of the Military - Even when there are widespread\ndomestic problems, the military is given a disproportionate amount of government funding, and the domestic agenda is neglected. Soldiers and military service are glamorized.\"\n\nAgain, this is also the case in non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n \n> \"5. Rampant Sexism - The governments of fascist nations tend to be almost exclusively male-dominated. Under fascist regimes, traditional gender roles are made more rigid. Divorce, abortion and homosexuality are suppressed and the state is represented as the ultimate guardian of the family institution.\"\n\nAgain, this is also the case in non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n \n> \"6. Controlled Mass Media - Sometimes to media is directly controlled by the government, but in other cases, the media is indirectly controlled by government regulation, or sympathetic media spokespeople and executives. Censorship, especially in war time, is very common.\"\n\nOK, this is certainly happening. But it is the Leftists who are doing it.\n \n> \"7. Obsession with National Security - Fear is used as a motivational tool by the government over the masses.\"\n\nAgain, this is also the case in non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n \n> \"8. Religion and Government are Intertwined - Governments in fascist nations tend to use the most common religion in the nation as a tool to manipulate public opinion. Religious rhetoric and terminology is common from government leaders, even when the major tenets of the religion are diametrically opposed to the government's policies or actions.\"\n\nAgain, this is also the case in non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n \n> \"9. Corporate Power is Protected - The industrial and business aristocracy of a fascist nation often are the ones who put the government leaders into power, creating a mutually beneficial business/government relationship and power elite.\"\n\nAgain, this is also the case in non-fascist nations, so this tells us precisely nothing about what makes fascist nations different from non-fascist ones.\n\n> \"10. Labor Power is Suppressed - Because the organizing power of labor is the only real threat to a fascist government, labor unions are either eliminated entirely, or are severely suppressed.\"\n\nYou see, comrade, we tell them we're just here to improve wages and working conditions, then once we get into power, we throw all dissenters in the gulag.\n \n> \"11. Disdain for Intellectuals and the Arts - Fascist nations tend to promote and tolerate open hostility to higher education, and academia. It is not uncommon for professors and other academics to be censored or even arrested. Free expression in the arts and letters is openly attacked.\"\n\nBoth sides are doing this.\n \n> \"12. Obsession with Crime and Punishment - Under fascist regimes, the police are given almost limitless power to enforce laws. The people are often willing to overlook police abuses and even forego civil liberties in the name of patriotism. There is often a national police force with virtually unlimited power in fascist nations.\"\n\nNow here we have finally hit upon something which I think is somewhat unique to fascist states in the modern world, and that is extreme police powers.\n\nOf course, it is important to sharply distinguish this from an ordinary, reasonable desire to fight crime where crime is a serious problem. Somehow, I don't think that's on the mind of the kind of idiots who are writing and sharing this.\n \n> \"13. Rampant Cronyism and Corruption - Fascist regimes almost always are governed by groups of friends and associates who appoint each other to government positions and use governmental power and authority to protect their friends from accountability.\"\n\nYou mean like the cliques that control Leftist-dominated institutions.\n\n> \"14. Fraudulent Elections - Sometimes elections in fascist nations are a complete sham. Other times elections are manipulated by smear campaigns against or even assassination of opposition candidates, use of legislation to control voting numbers or political district boundaries, and manipulation of the media. Fascist nations also typically use their judiciaries to manipulate or control elections.\"\n\nComplaining about elections is a loser strategy, especially when it's your own side which argues against voter ID.",
				"added": 1537923510
			},
			{
				"comment_id": 3,
				"body": "> [mcleanben](#comment_2_1CV5o7cZSe9c3WZuCWpDain5zweerM842E)\n\nTL/DR: Nazis are bad. Commies are worse.",
				"added": 1537923622
			}
		],
		"1530451214_12rREqqdMUPsAPuMR1p87Zj8TS4YocoUCX": [
			{
				"comment_id": 4,
				"body": "Is alcoholism genetics?\n\nIt certainly does run in families.\n\nBut it doesn't activate without environmental triggers.",
				"added": 1538325198
			},
			{
				"comment_id": 5,
				"body": "A few preliminaries:\nFirst, everyone should understand why this question is being discussed on ZeroNet. It's because gays have such a vice grip on corporations and governments that in certain countries, like Canada, even discussing this in public can get you fired and possibly even brought up on human rights violation charges for maximum irony. This happens because gays, as a political force, do not care about anyone else's rights and freedoms at all. This means simply that, generally speaking, gays are bad people, and we've proven this before we've even talked about sex at all based solely on their political activism and it's chilling effects on freedom of expression.\n\nSecond, before we can establish whether homosexuality is caused by genetics, we need to ask a more basic question first: \"What is homosexuality?\" This is much more difficult to answer than it sounds. People who don't think about it will respond, \"Homosexuality is sexual attraction to members of the same biological sex.\" but sexual attraction is a very complicated thing. It depends on circumstance. If I'm not sexually attracted to 80 year old gramdmas, then am I not sexually attracted to \"women\"? Turns out, ordinary men aren't sexually attracted to \"women\" in general -- they're actually sexually attracted to a select group of women who lack physical abnormalities between the ages of about twelve to late thirties, which is the age range where many women can try to fake looking like they're age 18-24 and not faking. Any of these numbers can certainly be questioned but I hope my point is clear: Nobody's attracted to all women and nobody's attracted to all men.\n\nBut then again, given chemical stimulants and a scientifically manipulated environment, it may be possible to cause anyone to become sexually attracted to literally anything. Let's assume we amend our definition to deal with these realities: \"Homosexulaity is a sexual attraction occurring without intentional manipulation or artificial stimulants towards some members of the same biological sex.\"\n\nThen we have to talk about degrees. What degree of sexual attraction is required? It isn't a simple on-off for ordinary men. A plain woman may not cause sexual arousal doing nothing, but may cause this by acting in a certain way, while an especially attractive woman may cause sexual arousal without doing anything. It may be possible that an especially skilled seductive individual may be able to cause sexual arousal in anyone based on how they act, regardless of sexual preference. Would the existence of such a person prove that everyone is a homosexual?\n\nThis is a very complex question and it's stupid to just dismiss it.",
				"added": 1538744093
			},
			{
				"comment_id": 6,
				"body": "It is common knowledge that homosexuals generally support gay activism, so much so that when one doesn't, it's news.",
				"added": 1538749347
			}
		]
	},
	"comment_vote": {}
}