{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1627901565,
			"title": "First time here!",
			"body": "Hello,\n\nThis is my first time on ZeroNet, I had some problems installing it, but now it is working like charm. Any recommendations to thing to do here? I didn't have anything particular in mind while downloading it.\n\nThanks for the great platform.",
			"added": 1627901564
		},
		{
			"topic_id": 1627915015,
			"title": "How to make a ZeroTalk for my language",
			"body": "Hello,\n\nSo, I found that my mother tounge does not have a ZeroTalk zite, so I wanted to make a one, I know that I should clone the zite but then what? How should I edit and how can I add it to the Forums in the main ZeroTalk?\n\nThanks for the help.",
			"added": 1627915013
		},
		{
			"topic_id": 1627998564,
			"title": "How to use languages/*.json for translation?",
			"body": "Hello,\n\nI was working on translating ZeroTalk to my language. However, many parts of the zite depends on `languages/*.json` file, so I created a one and edited it, but how can I link it now? I didn't see any clear way to use it, I tried looking into the source code of other websites and I didn't get a hint.\nIf you are interested to see it [here you go](http://127.0.0.1:43110/1qrLSJ9tq1JKDsU9dwJ7E6K3jKazuBjUr/), clearly not all things are translated.\n\nThanks for the help",
			"added": 1627998561
		},
		{
			"topic_id": 1628111720,
			"title": "Some websites not working in Tor brwoser",
			"body": "Hello,\n\nI have a weird problem, some websites will just not work in Tor browser, I tried opening ZeroSites in Tor but it didn't work, after that, I tried it in Qutebrowser (Chromium-based) and it worked. I don't understand why, in both cases tor is enabled in the background but it is just **the browser** which doesn't work. I think this may be a problem with Firefox-based browsers.\nAny solutions?\n\nThanks for the time.",
			"added": 1628111716
		},
		{
			"topic_id": 1628848642,
			"title": "ZeroNet alternatives?",
			"body": "Hello, I'd like to hear your opinions about similar projects to ZeroNet, or even projects that can add to ZeroNet in some ways.",
			"added": 1628848637
		},
		{
			"topic_id": 1630441420,
			"title": "ZeroNet is dying! Where should we go?",
			"body": "I feel that zeronet is seriously dying, it is a slow painful death. So, does anyone have a good place to go to after the death of zeronet? I didn't really find anything like zeronet, there are some similar projects (e.g. i2p), but not what zeronet is like. Recommendations are open in comments!",
			"added": 1630441414
		}
	],
	"topic_vote": {
		"1627901565_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": 1,
		"1627703143_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1627647660_14pSxPyLcN166TsqVnVQK8ZPLwdzHTkdki": 1,
		"1627296188_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj": 1,
		"1627915015_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"1627998564_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": 1,
		"1628111720_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1,
		"1628591661_1NV3qFKgLf7Nnx7L5txkzsg13nuj3teVqC": 1,
		"1628720116_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1628411219_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1628752234_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": 1,
		"1629098773_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH": 1,
		"1630142696_1AAwx2qPkJeAEJUpAh4VrmBqFDsRbh3a15": 1,
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1630441344_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": 1,
		"1630441420_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": 1
	},
	"next_comment_id": 30,
	"comment": {
		"1627637997_1B6JScbE4NxJHgSVTGGjeNhk157tpeLfWT": [
			{
				"comment_id": 1,
				"body": "Unless he is a complete asshole, don't try to steal his internet.",
				"added": 1627901364
			},
			{
				"comment_id": 2,
				"body": "Unless he is a complete asshole, don't try to steal his internet.",
				"added": 1627901395
			},
			{
				"comment_id": 3,
				"body": "Unless he is a complete asshole, don't try to steal his internet.",
				"added": 1627901423
			},
			{
				"comment_id": 5,
				"body": "Something lagged on my side and there are 3 comments saying the same shit lol",
				"added": 1627902384
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 4,
				"body": "why is this pinned lol",
				"added": 1627901626
			},
			{
				"comment_id": 26,
				"body": "> [sarou](#comment_1_1HZPyXvdwHdgbwayVzCW8mjLQYQ1cYCsAp): test with everyone\n\nThe test is successful!",
				"added": 1629161262
			}
		],
		"1627910448_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 6,
				"body": "I get `content.json download failed`. What should I do?",
				"added": 1627913926
			},
			{
				"comment_id": 8,
				"body": "> [0628](#comment_20_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan): I run my zeronet as \"tor always\" mode, is your tor running normally？\n\nI am also running `tor always`, and it is working fine on most zites.",
				"added": 1627916103
			},
			{
				"comment_id": 10,
				"body": "> [0628](#comment_24_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan): It doesn't make sense. It seems that we do not have the same trackers.Is your zeronet the latest version? You can check it by opening the menu and clicking on the version number.\n\nI have `Your version: 0.7.2 (rev4555)`",
				"added": 1627919415
			}
		],
		"1627901565_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 7,
				"body": "> [0628](#comment_21_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan): Just by a simple \"clone\" click.\n\nThanks for the recommendation.",
				"added": 1627915941
			},
			{
				"comment_id": 9,
				"body": "> [xcape2net](#comment_911_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Welcome!  Use ZeroNet like you would use the Internet.  Post on ZeroTalk and comment on other people's posts.  Create your own website, maybe a blog.  Interact with other people.\n\nCool, I like the vibe of old internet that dark webs give.",
				"added": 1627916205
			},
			{
				"comment_id": 11,
				"body": "> [77ha01](#comment_4_19RBy1R77se3kYGB4ZLXCVowdKrcqL1h4A): try setting up your own zite: check mine out ... http://localhost:43110/1EjbMNr9NMB2HG61UE74EfsT4SthQNtoac\n\nI have already sat up a one: http://127.0.0.1:43110/1FibYqV9afQM8sf98ZebyMPjhzut5cx3MB/",
				"added": 1628063453
			}
		],
		"1628101623_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": [
			{
				"comment_id": 12,
				"body": "First, make sure it is related to Tor, try running it without tor in another profile and see if it is working or not. More often than not, problems are not related to Tor.",
				"added": 1628102153
			},
			{
				"comment_id": 13,
				"body": "> [0628](#comment_28_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan): And i disable Tor, but still fails.\n\nWhat is the error message exactly? Try seeing the logs.",
				"added": 1628109538
			}
		],
		"1628111720_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 14,
				"body": "> [jackzeng6666](#comment_4_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm): maybe you disabled javascript.\n\nZeroNet require me to enable JS on startup lol",
				"added": 1628143251
			},
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_3181_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You'll have to complain on GitHub. https://github.com/HelloZeroNet/ZeroSites/issues [...]\n\nMaybe they don't target Firefox because of its low market share, I find it weird thought considering that Tor browser—the one that will probably be used with ZeroNet—is Firefox-based.",
				"added": 1628143350
			},
			{
				"comment_id": 17,
				"body": "> [xcape2net](#comment_913_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Does it have anything to do with the Onion v2 deprecation issue?\n\nNo, the problem is with the browser, not the tunnel.",
				"added": 1628282644
			}
		],
		"1628149781_1AmXimBQuPemuoTM9NFYg9Mn5YY6HomhAm": [
			{
				"comment_id": 16,
				"body": "No, the technology itself is not dead, maybe the main blog is. You can explore it a little and you'll find there are a reasonable number of people being active.",
				"added": 1628151961
			}
		],
		"1628411219_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 18,
				"body": "Yeah, I think it is important to do something about it.",
				"added": 1628694637
			}
		],
		"1628720116_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 19,
				"body": "I don't do actually that much. Just using Tor browser with limiting the risky components is enough for me.",
				"added": 1628720677
			}
		],
		"1628848642_15Ef8fbH5j5WZuMNoKum5u6WYFguXy3uVg": [
			{
				"comment_id": 20,
				"body": "> [xanadu](#comment_19_1JTx34tPsJsZT8WWGEih4c8kxeY2kk89gH): Retroshare?\n\nI am not sure how does it fall in the asked category",
				"added": 1629041387
			},
			{
				"comment_id": 21,
				"body": "> [zeroseed6e](#comment_20_17NZ2BiZ1HUYppUcUmU5bgyGkp8kH7UyXj): In my opinion Actually there isnt any valido alternative for decentralized hosting (Easy to use, anonymous and without big bugs)\n\nI am not saying an alternative as an other technology, I am asking for different implementations for the same core principles, something like I2P or IPFS.",
				"added": 1629041455
			},
			{
				"comment_id": 22,
				"body": "> [efi3](#comment_2_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ): If you own iOS or macOS devices, then probably one of the values that you value is privacy. Apple itself is proud of it:Unfortunately, Apple's latest announcement does not bode well for the privacy concerns of iOS and macOS users:Remember the attempts to push through laws to add backdoors in encrypted communicators under the guise of fighting terrorism? In the case of Apple's new announcement, the rationale is to protect children from pedophiles and limit the distribution of child pornography. In order for the company to achieve its goal, all photos stored in the iCloud cloud will be scanned and compared with a database of special hashes. In addition, on a similar basis, messages in the iMessage application will be scanned to warn parents when someone sends sexual photos to their comfort. (this option requires a parent / guardian account)However, this is not the end, as Apple also plans to introduce scanning of photos located directly in our devices:According to the community of security researchers and privacy enthusiasts, Apple's actions are de facto creating a back door for law enforcement. The new solution can also be used unethically by countries where the regime is in power, such as Poland, to spy on people who are not in favor of the authorities there:Additional problems can be false detection of our photos as \"inappropriate\", or even deliberately sending someone prohibited content to achieve the effect of so-called swatting (Apple will notify law enforcement when their system detects inappropriate photos on our device):\n\nWhat does this have in relation with the post? I think what you are saying is important 'n all but maybe this isn't the appropriate place, try making a thread about this.",
				"added": 1629041593
			},
			{
				"comment_id": 23,
				"body": "> [freiherrvbdn](#comment_20_14EvrR9QiEpqhQyZDFiftdgAXzNQ1x8XH1): Official v0.6.6 release only for Windows and macOS? When will retroshare be available for Linux (deb/rpm)?https://github.com/RetroShare/RetroShare/releases\n\nJust compile it from source, it is Linux-compatible, you can find it in Void Linux official repo.",
				"added": 1629041703
			},
			{
				"comment_id": 27,
				"body": "> [epistemic](#comment_14_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): FreeNet\n\nIt is just a dead project",
				"added": 1629990317
			}
		],
		"1628310919_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 24,
				"body": "Cool, do it.",
				"added": 1629041895
			}
		],
		"1629135083_1HZPyXvdwHdgbwayVzCW8mjLQYQ1cYCsAp": [
			{
				"comment_id": 25,
				"body": "More details plz; the reason could be using firefox-based browser (e.g. Tor), the GUI problem with ZeroNet mobile or a completely new problem related to your setup (e.g. problem with installation, trackers, etc).",
				"added": 1629161213
			}
		],
		"1630241491_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 28,
				"body": "I think it will be just easier to do your own research.",
				"added": 1630260729
			}
		],
		"1630436341_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 29,
				"body": "It just looks like ZeroNet is just slowly dying",
				"added": 1630440096
			}
		]
	},
	"comment_vote": {
		"2_1EkuneRk9X5yizVpYMkfk21EgjPzXm4tLh": 1,
		"133_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT": 1,
		"911_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"21_1BkheWe7wwX2r3HuRQunHFu9jTMtCLwRan": 1,
		"22_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": 1
	}
}