{
	"title": "DASH = Digital Cash",
	"description": "SnowHater",
	"links": "- [Dash.org](http://www.Dash.org)\n- [Forum](http://dashtalk.org)\n- [DashWhale](http://dashwhale.org)\n- [VoteTracker](http://dashvotetracker.com)\n- [Blog about ZeroNet](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:70:The+first+year+of+ZeroNet)",
	"next_post_id": 8,
	"demo": false,
	"modified": 1459760598,
	"post": [
		{
			"post_id": 7,
			"title": "Голосования на базе децентрализованной репутации",
			"date_published": 1459760471.085,
			"body": "Мои посты про изменения механизма голосования натолкнули меня на другие мои же мысли из далекого 2014 года о децентрализованном управлении организацией. Изменением механизма голосования я хотел добиться защиты DGBB (системы управления и финансирования) от так называемых ДАШкитов. Но дейсвтительно ли в них есть большая угроза? Действительно ли система управления станет эффективнее, если возрастет её децентрализация (распределение мастернод по инвесторам станет более равномерным)? Тут я не уверен.\n\n---\n\nЧем определяется качество управления организации? Скоростью её развития. Развитие - это рост влияния организации во внешней среде. Простые люди охотнее начнут пользоваться DASH в случае феноменального роста влияния этого сообщества в мире, возьмите например США и их доллар. Упрощенно, в нашем мире денег, влияние может быть выражено в суммарной капитализации и суммарном количестве членов организации. Так вот, я утверждаю, что успех DASH будет пропорционален куммулятивной доле владельцев мастернод, которые наиболее благотворно влияют на скорость развития сети. Чем эффективней человек развивает организацию, тем больший вес должен он иметь при принятии общих решений.\n\nКаким образом оценить эффективность каждого конкретного человека? Нужен некий рейтинг. Он может выставляться централизованно, либо децентрализованно (все ставят оценки друг другу). Второй вариант мне видится более предпочтительным, хотя реализовать его сложнее. Давайте немного пофантазируем, что может входить в состав такого рейтинга/репутации.\n\n- Количество DASH под залогом (покупая и замораживая DASH, человек увеличивает общую капитализацию и несет определенные риски. На первом этапе развития криптоденег - очень важная составляющая в репутации).\n- Количество и качество оказываемых сети услуг (например, поддержание мастерноды в работе, майнинг).\n- Количество приобщенных активных членов (по приглашению от данного пользователя).\n- Количество и качество разработанного Software/Hardware для организации.\n- Количество и качество публикаций, рекламы.\n- Количество и качество выставок, публичных выступлений.\n- Количество и качество юридических услуг, услуг лоббирования.\n- Количество и качество найденных партнеров, заключенных выгодных соглашений.\n- Объем продуктов, купленных за DASH. Оборот бизнеса в DASH.\n- Высланные пожертвования минус полученные.\n- Рейтинг на DashTalk и др. подобных ресурсах.\n- Длительность нахождения в сообществе (дата регистрации).\n- Другое.\n\nCписок получился внушительный. И наверняка я что-то упустил. Можно подискутировать насчет отдельных пунктов, разбивки по пунктам и весу каждого пункта в интегральном рейтинге, но наверняка можно таки прийти к консенсусу по поводу формулы его вычисления. Формулу можно изменять/дорабатывать по решению DGBB. Награда за новые блоки может распределяться пропорционально рейтингу каждого члена сообщества, при этом 10%, как и сейчас, может поступать в общий котел. При дальнейшем росте организации скорее всего будут появляться подотделы (министерства) DGBB, вес в голосованиях которых будет определяться другой пропорцией составляющих репутации. Например, в PR-отеделе при принятии решений наболее весомой будет именно пункт репутации, связанный с количеством и качеством созданных человеком публикаций и рекламы.\n\nОсновным отличием репутации от обычных криптовалют является то, что её нельзя пересылать другим пользователям и нельзя ею торговать. Она жестко привязана к человеку (ID). По сути, в текущей реализации системы управления репутация уже неявно используется при принятии решений о финансировании предложений. У мастернод явно вызывают больше доверия коренные разработчики или люди, которые уже доказали сообществу свою квалификацию и порядочность.\n\nИнтересные проекты на данную тему из Ethereum:\nhttp://boardroom.to/\nhttp://backfeed.cc/\nhttp://colony.io/\nhttps://dashtalk.org/threads/golosovanija-na-baze-decentralizovannoj-reputacii.8294/"
		},
		{
			"post_id": 6,
			"title": "Governance based on decentralized reputation",
			"date_published": 1459760140.488,
			"body": "I think DASH is more than just a currency, it is a decentralized collaborative organization (DCO) with its own currency. What is main metric of organization governance quality? Its progress rate. Progress means stable influence growth in relation to the outside world. Regular people would more likely use DASH in case of phenomenal power growth of its DCO, take USA and US dollar for example. Simplified this power can be measured by overall capitalization and members number.\n\n---\n\nI believe that in order to achieve effective decentralized governance the voting power of each individual should be tied to his/her contribution to the progress of DCO. How can we measure this contribution? We need some rating (score) here. It can be gained either by authorities (core team) in a centralized manner or by ongoing mutual evaluating each other. The second choice (decentralized reputation) is better for DCO, despite that it is harder to be implemented. Let's fantasize a little about possible components of such decentralized reputation (DR).\n- DASH collateral amount (an individual which buys and freezes some DASH rises overall capitalization and takes some risks. At the beginning of DCO growth it is very important component of DR).\n- Amount and quality of network services provided (masternode maintaining, mining, etc).\n- Amount and quality of software/hardware developed.\n- Amount and quality of publications, ads created.\n- Amount and quality of exhibitions, presentations participated in.\n- Amount and quality of lawyering and lobbing services delivered.\n- Amount and quality of partners founded, beneficial contracts made.\n- Amount of products bought via DASH. Business revenue via DASH.\n- Donation sent minus donation received in DASH.\n- Amount of new active members invited (referral program).\n- DashTalk reputation (and similar projects).\n- Age of contributing (time passed from the date of registration).\n- Other.\n\nGuess we have big list here. We can argue about some items in the list or each item weight in integral score formula, but we definitely can come to a consensus about the formula eventually. This formula can be modified/improved trough DGBB (decentralized governance and budget system). Block reward could be distributed to individuals in proportion to their integral score of DR. 10% of it could be delivered directly to DGBB as it is now. With further progress new subsidiary departments (ministries) of DGBB will likely to come. Individual voting weight will be based on different set (or different proportion) of DR components in each department. For example in Law/Lobby department the most powerful DR component would be 'amount and quality of lawyering and lobbing services delivered' and so on.\n\nThe main difference between DR and regular cryptocurrencies is that you can't send your DR scores to others, you can't buy or sell it. It is tied strictly to individuals (or IDs). As you can note in the current implementation of DGBB reputation is already used indirectly. Masternodes are more likely vote 'yes' for proposals made by core developers or other people, who has shown their commitment and qualification to the community already.\n\nInteresting projects on this topic from Ethereum:\nhttp://boardroom.to/\nhttp://backfeed.cc/\nhttp://colony.io/ \nhttps://dashtalk.org/threads/governance-based-on-decentralized-reputation.8296/\n\n"
		},
		{
			"post_id": 5,
			"title": "Power decentralization in DASH (Децентрализация власти в DASH)",
			"date_published": 1456905197.711,
			"body": "Вообще, вся эта наша [битва с мельницами](https://dashtalk.org/threads/jakoby-sozdali-asic-dlja-dash.8091/page-6) напомнила мне про мои же старые мысли по поводу идеальной децентрализованной валюты. Только теперь я понимаю, что мысли начинают оформляться в какое-то более строгое обличие.\n\nЯ думаю, сейчас уже многие начинают понимать, что DASH - это не просто криптовалюта, это - децентрализованная организация. В чем заключается основная децентрализация в DASH? Я думаю, что она даже не в майнинге и не в распределении награды за блок, я думаю что высшая степень децентрализации, которая достижима в организации - это децентрализация в принятии решений (планировании) и их последующем исполнении, т.е., фактически, децентрализация власти внутри организации. Вот то, чего на самом деле хотят люди. С одной стороны в случае внешней угрозы, такая организация может действовать как одно целое и легко отразить атаку, а с другой стороны все люди, которые входят в эту организацию не чувствуют себя ущемленными, и видят что система справедлива - она вознаграждает каждого в соответствие с его вложением в общее дело. Организация всегда открыта для входа и выхода.\n\n---\n\nКак понять, что обычная организация здорова и развивается? Критериями могут быть рост её общего влияния в мире, которое, в свою очередь, заключается в суммарной капитализации и суммарном количестве ее членов. Как же оценить развитие децентрализованной организации? Да точно также, только к последним двум пунктам должен добавиться рост децентрализации власти!\n\nВот такие три направления роста (лебедь рак и щука) у нас получились. Каким путем развития пойдет DASH? Посмотрим.\n\nОчень-очень грубо прикинем текущее распределение мастернод (степень децентрализации власти) среди членов DASH-сообщества. Всего 3500. Допустим, первый владелец имеет их 700 штук, второй - 500, третий - 300 и дальше по убывающей с длинным-длинным хвостом по 1-2 мастерноде или даже долями в одной мастерноде (как у меня). Всего пусть будет 1000 человек.\n\nТак вот, главный вопрос: какое распределение мастернод вы хотели бы увидеть через 5 лет? Потому что от этого распределения зависит реальная децентрализация власти в DASH. Для простоты счета предположим, что общее число мастернод за 5 лет не изменится (нам важно лишь относительное соотношение).\n\nХотите ли вы через 5 лет увидеть такой ряд: 2000, 1000, 300, 195, 1, 1, 1, 1 - всего 8 человек?\n\nИли такой ряд: 300, 200, 100, 50, 20, 20, 10, 10... 1, 1/10, 1/10 -\nвсего 10000 человек?\n\nВы скажете, что ответ будет зависеть от того, кто на него отвечает! Владельцу 700 мастернод больше по душе будет первый вариант, а вот простому Васе из хвоста второй вариант придется по вкусу больше, ведь он внушает в него надежду на светлое будущее.\n\nА я с вами не согласен! Оба владельца должны выбрать второй вариант, если хорошенько подумают над этим вопросом. Все дело в том, что из \"уравнения\" убрана цена самой монетки DASH. А вот если её добавить, то тут то и произойдет основная магия! Владелец 300 мастернод через 5 лет может оказаться богаче владельца 700 мастернод пятью годами ранее. Более того, несмотря на то, что его влияние (власть) внутри организации сократилась, его влияние (власть) во внешнем мире наоборот выросла! А произошло это за счет того, что выросло общее влияние организации в мире. А поскольку давно подмечено, что общее влияние организации пропорционально квадрату от числа ее членов, то очевидно что цена монетки должна расти быстрее чем будет происходить снижение доли влияния каждого члена внутри этой организации.\n\nВ общем, возможно я это все слишком путано написал. Тут надо будет мысль причесать, но основная идея в том, что DASHу, чтобы развиваться быстрее нужен не столько поток фиатных денег (так называемых инвестиций) извне, сколько постоянный приток живых людей. Причем не важно, богатых или бедных. Но как их привлечь, этих людей?\n\nВы скажете: \"Окей, нужно просто сделать кучу удобных сервисов по денежным переводам, покупке товаров и т.п., работающих через DASH, и тогда люди сами прибегут к нам\". А вот и нет! Не прибегут. Таких сервисов в мире уже навалом, и работают они гораздо эффективнее чем децентрализованные системы! Прежде чем делать что-то для своего потенциального клиента, не хотите ли вы изучить его для начала? Что это за человек вообще, и что ему от вас может быть нужно. Так вот, знаете, какой основной продукт, который хотят \"потреблять\" пользователи криптовалюты? Открою вам тайну: они хотят потреблять децентрализацию власти! Да, да, они хотят пользоваться именно этой услугой, и даже готовы за это дело приплачивать, занимаясь майнингом такой валюты иногда даже себе в убыток.\n\nТаким образом, все что требуется от DASH для успеха, это заставить людей вне организации поверить, что если они вложатся в эту валюту сейчас, то через пять лет они увидят распределение мастернод в ней ближе ко второму варианту, чем к первому.\n\nКак этого достичь? Вот на этом вопросе и должно быть сосредоточены основные усилия сообщества. Централизация майнинга, однако, нас к этой цели не приближает.\n\nЕсли в кратце, то основной смысл должен быть в том, чтобы автоматически снимать часть монеток у той стороны, которая победила в голосовании и перераспределять ее в сторону тех, кто проиграл. Ведь решения принимали все вместе, все обсуждали, все тратили свое время. Но вся организация целиком может пойти только в одном, выбранном направлении, т.е. в итоге кто-то решением останется удовлетворен, а кто-то - нет. Поэтому, каждое принятое решение должно стоить его защитникам некоторого количества власти (монет). Если решение было адекватное, то в итоге выиграют все за счет роста цены на монету. А если решения были не адекватны - то больше всего будут страдать их сторонники. А вот голосовавшие в свое время против будут в менее худшем положении и материально и с точки зрения власти внутри организации. Таким образом, даже если ты недоволен принимаемыми решениями, тебе нет стимула выходить из организации.\n\nУ системы наверняка можно найти много косяков, если вдаваться в детали. Потому я специально в них не вдавался, чтобы меня не поймали на слове, ведь деталей я не знаю. Но основной посыл - искусственое перераспределение средств. Хочешь порулить? Пожалуйста, плати деньги. Если твои решения мудры, то выиграют все, и народная любовь тебе обеспечена. Если ты завел организацию в тупик, больше всего пострадать также должен ты. Стратегии а-ля \"наворовать и смыться\" или \"наворовать, подняться, и рулить вечно\" тут не сработают.\n\nБез такой системы, ИМХО, Dash обречен даже с полностью децентрализованным майнингом. Хотя, в глубине души надеюсь, что я таки не прав. "
		},
		{
			"post_id": 4,
			"title": "Change X11 Proposal begins! (Началось голосование за смену алгоритма майнинга DASH)",
			"date_published": 1456785182.744,
			"body": "Итак, мы таки сделали это! Было размещено [открытое голосование среди мастернод](https://www.dashwhale.org/p/change-X11) по поводу возможной смены алгоритма майнинга X11 из-за появления ASICов. Так что всех неравнодушных владельцев мастернод прошу активно поучаствовать в голосовании, ведь на его проведение было затрачено аж 5 монет DASH, что эквивалентно 20 долларам США или порядка 1500 рублей казенных российских денег. А уж сколько времени было потрачено на разработку и шлифовку народной петиции! К данному событию очень подохдит сие полотно)\n\n![image](img/iu.jpg)\n\nГрафик динамики голосования [тут](http://dashvotetracker.com/history.html?ProposalID=21)."
		},
		{
			"post_id": 3,
			"title": "Money that everybody can issue is the best money (Russian article by nik443 from dashtalk.org)",
			"date_published": 1456764718.16,
			"body": "**Самые лучшие деньги – те, которые могут печатать все!**\n\n**Вступление**\nСтолкновение с игнорированием недоступности майнинга рядовому пользователю среди большого количества RU сообщества крипто валюты Dash, заставило меня искать нестандартные способы доказать важность этого самого майнинга для популяризации и выбора большинством пользователей валюты, которых уже не одна сотня. Сразу скажу, что полностью согласен с мнением, что для монеты майнинг не может быть самоцелью; не считаю, что крипто валюта сделана «для того чтобы майнерам лучше жилось» и т.п. бессмыслицам. Под универсальными устройствами я подразумеваю обычный персональный компьютер (в основном, конечно, на практике используется видеокарта) который есть у каждого, а под «специализированным устройством» - ASIC.\n\n---\n\n\n**I.\tОпыт «золотой лихорадки» на Биткойн**\nТе, кто пришел в наши ряды позже и не застал славные времена «золотой лихорадки» в Биткойне, когда в него еще не вторглись ASIC и майнинг был доступным любому счастливчику, узнававшему что появились новые - самые лучшие в мире, не принадлежащие ни одному правительству деньги и что эти деньги можно печатать самому, не могут понять на сколько это захватывающе. Печатать свои деньги мог каждый желающий! И чем больше человек приходило печатать свои деньги – тем «почему-то» выгоднее всем становилось! По формуле: «от каждого – по его способностям, - каждому по его труду». \nТак как майнинг на универсальных устройствах накладывал много физических ограничений на «жадин» предпринимателей, которые майнили несколькими десятками видеокарт - то тех, «бездельников» людей кто майнил одной-двумя домашними видеокартами, было всегда на порядки больше и растущий курс «удовлетворял» всех. Никакая организация не смогла бы выкупить и запустить больше универсальных устройств чем всегда будет в распоряжении всех остальных людей планеты. \nПосле прихода «узкоспециализированных устройств» для майнинга — ASIC — перекос мощностей в пользу последних «предпринимателей» стал громадным, и конкуренция стала невыносимой для «каждой домохозяйки». ASICи в Биткойн довольно быстро устранили конкуренцию в майнинге и монополизировали его. Децентрализация, мечта о лучших деньгах принадлежащих всем и одновременно не подконтрольных ни каким организациям и группам, более справедливом распределении богатства, незаметно ушла. Вот вам и падение курса. \nДа, несомненно, многих из вновь узнававших о криптовалюте очаровала анонимность, бесплатные транзакции, полный контроль над своими средствами, предсказуемая и ограниченная эмиссия, в отличие от прежних денег, зависящих от произвола и непредсказуемости так часто приходящих к власти популистов и некомпетентных правительств. Но… это все намного меньше будоражит и привлекает, чем возможность «печатать собственные деньги» !!! Новички уже не знают, что так можно было делать с криптовалютой и просто «не думают» об этом! \nУвлеченные профессионалы мира криптовалют сосредоточены на важных технических фишках — скорости и анонимности транзакций, удобстве ПО, рекламе, расширению инфраструктуры, внедрению новых и улучшению старых сервисов и прочих полезностях. Но спросите любого — хотел бы он печатать собственные деньги если бы мог? Уверен, что хотели бы все! \nГде-то даже делали опрос: «что для вас важнее: электронная почта или деньги?» который показал, что для людей важнее деньги! Даже если о своих каких-то желаниях не принято говорить на каждом шагу — это не значит, что их нет. Еще пример, во времена, когда на торрент трекерах был рейтинг то его почти не возможно было повысить нормальными фильмами, музыкой, книгами и прочими хорошими вещами. Его быстро можно было повысить только закачав на винт порнофильмы!!! Но ведь их никто не обсуждает? Все обсуждают «нормальные» фильмы, книги, музыку, искусство и науку.\n Вот и гадают теперь «аналитики» почему это рост курса Биткойна когда-то остановился и пошел в низ, придумывают сотни причин, а об этой не упоминают. Так же не знали и мы в сообществе Dash - почему курс столь привлекательного технически и соответственно «инвестиционно» Dash внезапно после продолжительного роста вдруг ни с того ни с сего пошел вниз и майнить видеокартами его стало не выгодно? \nМонета обладает отличными техническими характеристиками, разработчик и почти вся команда в отличии от многих сразу же после запуска проекта не побоялись и «деанонимизировались» - поставили на карту свою личную репутацию что в деле, связанном с инвестициями для многих очень важно. Командой впервые в истории придуманы революционные технологии, такие как механизм децентрализованного самофинансирования из блокчейна, децентрализованного принятия ключевых решений инвесторами – держателями мастернод, делающие этот проект самым независимым, невероятно устойчивым и выгодно его отличающим среди массы других замечательных криптовалют. \nВсе нужное для успеха Dash уже есть. И, казалось бы, что когда система доказала свою жизнеспособность, команда положительно зарекомендовала себя на деле уже не один раз то со временем все это должно вызывать только больше доверия и инвестиций в проект. Но вот майнить на видеокартах ставало все менее выгодно…\nЯ, как и очень многие, рискнули и перешли в эту новую валюту из существовавшего на то время уже пять лет и доказавшего свою жизнеспособность и преимущество над всеми известными до этого формами денег Биткойна именно по причине той самой возможности «печатать свои деньги», которая была тогда в Dash и которой не стало в Биткойне. Загадка остановки роста курса и невыгодности майнинга Dash последнее время разрешилась на днях... \n\n**ІІ. Предыстория Dash**\nДва года назад Эван Даффилд при разработке Dash придумал новый, более совершенный алгоритм майнинга, в том числе с целью несовместимости с существующими на тот момент сетями и ASIC. Никто не подозревал, что кто-то сможет так быстро разработать ASIC на новый алгоритм, тем более никак его не анонсировав. Так как система прозрачна, то нужные сигналы, конечно, поступали вовремя и предположения стали появляться, но они были проигнорированы, так как большинство решило, что это «ботнет», который был обнаружен в пиратских копиях игры Grand Theft Avto 5 и майнящий Dash. Все приняли его за «глиняного болвана» без злого умысла захватившего большую половину мощности сети, тут же сливающего добытые монеты, естественно, сильно «давя» на рыночный курс. Но все оказалось хуже… \nКакие-то, судя по всему не очень переживающие за судьбу и децентрализацию криптовалюты в целом, и Dash в частности, «предприимчивые» рвачи с завода разработчики чипов выпустили эти самые ASIC на Dash и «втихую» майнили минимум последний год, да еще и не удосужившись распределить мощности по разным пулам... \n\n**ІІІ. Блеск и нищета ASIC**\nБольшая мощность ASIC – это жалкая уловка. Хоть ASIC и обладают намного большим хешрейтом, чем универсальные устройства, они никак не увеличивают защиту сети, так как эти «большие мощности» оказываются у намного меньшего количества участников, которым легче концентрироваться, вступить в сговор и использовать эти большие мощности как им захочется. Универсальные же устройства хоть и обладают меньшим хешрейтом по-отдельности, но они есть у всех и на много порядков лучше рассредоточены. Но работать они заинтересованы при условии отсутствия в игре специализированных устройств и вместе дадут намного большую скорость. Каждый выход нового поколения ASIC убирает с поля большую часть игроков, потому что каждый раз повышается ценовой порог для входа в игру и многие уже не в состоянии войти в гонку на новом, более мощном и дорогом оборудовании – это неизбежный путь к централизации. \nСейчас пока ASIC – эта опухоль в Dash – не сильно разрослась и можно прикинуть масштаб проблемы. Выброшенные на продажу на днях 100 ASIC уже обладают половиной мощности сети. Опыт Биткойна показывает, что раз распродаются эти ASIC, то производитель уже вовсю запускает майнинг на новых, еще более мощных; и, возможно, уже реальных людей с видеокартами в нашей сети не осталось. \n\n**IV Примеры из реальности**\n1 ASIC на 500Мхеш/с алгоритма Х11 равняется по скорости хеширования как раз моим 22 фермам на ГПУ. Да, я редкий крипто-энтузиаст и не совсем «нормальный» майнер)). Если же брать нормального человека со средней видеокартой, допустим HD7850, то этот ASIC заменит минимум сто таких «нормальных» майнеров. Вот и получается, что один ASIC выкидывает из игры около 100 «живых» майнеров, что в процентном отношении от всей «криптовалютной тусовки» составляет, по моим прикидкам, не меньше половины. Половина заинтересованных майнингом криптовалюты пользователей выбывает таким нехитрым образом из Dash!!! В реале, по крайней мере пока, среди моих знакомых вообще все криптовалютчики – майнеры. То есть, если бы весь мир состоял из «моих знакомых» - то с приходом ASIC и невозможностью криптовалюту майнить, она бы вообще бы никому не была интересна. \n\n**V. Польза от «живых» майнеров**\nПри всем сказанном выше, нельзя сказать, что я и мои знакомые майнеры – неполноценная «крипто валютная тусовка». У нас есть кошельки Dash, и мы даже несколько раз на своей шкуре прочувствовали делали свои финансовые взаимозачеты «по назначению» расплачиваясь в DASH при отказе интернет-банкинга хваленого и самого крупного в Украине «Приват-Банка». То есть опыт использования, понимание ценности и того, зачем крипто валюта нужна, у майнеров есть; не надо думать, что они все сплошь прям глиняные болваны которым отведена чисто техническая роль «обслуги». Дальше – больше. Например, даже у такого редкого криптоманьяка как я, фермы разбросаны по 3 городам в радиусе 300км! Ни в одном помещении нет больше одного компьютера (это все тоже «полезные» физические ограничения – при всем желании без кондиционера на двух мощных компьютерах в одном помещении майнить тяжело). Чувствуете разницу в децентрализации при той же скорости что и у одного ASIC, стоящего в одной точке? \nА что если, не дай Бог, под личиной демократа к власти придет дерьмократ и бросит вызов свободному обществу? И начнут сбываться опасения, которые за семь лет истории криптовалют ни разу не сбывались и все уже успели расслабиться? Первые, кто могут прекратить деятельность, это крупные майнинговые центры, и, даже если у кого-то в гараже еще в это время останется «специализированное устройство», он поспешит от него избавиться. \nДругое дело – универсальное устройство, которое есть у каждого и часто даже не одно – компьютер. Где искать? Что предъявлять? Кого закрывать и куда? (еще одно «нужное» физическое ограничение – всех не пересадишь). Ни один сумасшедший диктатор ни при каких обстоятельствах не сможет разрушить такую децентрализованную сеть. Хочется развеять иллюзию, присущую высказываемому иногда мнению - «меня не интересует криптовалюта в которой больше 1% майнеров». В сознании не должно быть никаких ненужных аналогий, например, с нашим отсталым сельским хозяйством и намного более эффективным Западным, в котором занят малый процент рабочих. В валютной сети чем больше участников - тем она лучше, без исключений. \nДа, для успеха в правильной «криптовалютной тусовке» обязательно должны быть талантливые разработчики, программисты, пиарщики, инвесторы и т.п. «цвет общества», но майнеры – очень важная часть именно из-за преобладающего количества и чем их больше – тем лучше для всех. Так же как, например, издатель, издающий книгу, заинтересован в максимальном количество читателей.   \n\n**VI. Неоцененность психологии майнинга на универсальных устройствах в наступлении «революции»… **\nПечатать собственные деньги для человека мне хочется приравнять к какому-нибудь инстинкту человека… И то, для некоторых деньги стоят на первом месте, а потом уже инстинкты… основные. Майнинг привлекает в криптовалюту сильнее, чем любые технологические фишки и не нужно это игнорировать! Наша «революция» быстрее наступит «снизу», ведь «… не из всякой революционной ситуации возникает революция, а лишь … когда к объективным переменам присоединяется субъективная, именно: присоединяется способность революционного класса на революционные массовые действия…». Мы работаем над тем, чтобы к нам в т.ч. «сверху» спустились богатые инвесторы, раздули курс, и мы все счастливо (независимо ни от кого, удобно, надежно и безопасно) пользовались нашей самой лучшей в мире валютой. Но… «Лишь тогда, когда „низы“ не хотят старого и когда „верхи“ не могут по-старому, лишь тогда революция может победить». \n«Большой инвестор» не придет пока мы сами большинством не начнем пользоваться ею. Он заметит нас, когда увидит, что многие уже пользуются другой, более лучшей валютой чем та, которая есть у него, и он либо захочет присоединиться, либо будет спасать свои доллары последним от полного обесценивания. Иначе кому будут нужны старые «плохие» деньги если они будут лишь у него да «единиц» других «долларовых миллиардеров»?\n\n**VII. Роль майнинга в знакомстве с криптовалютой.**\nМайнеры – уже пользователи криптовалюты, участвующие в революции, так что их большое количественное наличие лучше всего приближают этот переломный момент, когда начнутся соревнования «успей избавиться от доллара и трансформировать сбережения в криптовалюту»!  Я видел «модель» таких соревнований на Украине вживую и больше никогда не доверюсь никаким государственным деньгам как средству сбережения! \nСлава Богу, что я знал о криптовалютах давно и не пострадал. За считанные месяцы популисты, пришедшие к власти на лозунгах борьбы с бедностью, тупо включили печатный станок и обесценили казавшуюся большинству стабильную валюту на 50%, что стало неожиданностью и шоком для всех!!! Кроме меня)) К сожалению, люди пока не знают, что такое криптовалюта, и, естественно, они все кинулись куда знали - к ближайшему валютному обменнику или «меняле» за такими же бумажными, но «надежными» долларами США и, естественно, уже по «нормальным» рыночным законам обрушили сами себе национальную валюту, за каких-то полгода, еще на 300%!!! Глава НБУ с экранов зомбоящика так и сказала: «Во всем виноваты спекулянты и те, кто покупает валюту, повода для обесценивания гривны нет!» Но от этого курс гривны «почему-то» не поднимался... Я знаю человека который два года не мог забрать свои деньги из «лопнувшего» в 2008 году банка и который вновь доверил свои деньги банку в 2011 году. Ирония в том, что этот банк опять «лопнул», похоронив его нервы и мечты о беззаботной старости. Этого бы не случилось, знай бы он о криптовалюте…\n\n**VIII. Личная «конспирологическая» гипотеза без претензий на истину и поиск виновных…**\nПостепенное осознание революционных возможностей криптовалют заставляет меня в «фоновом» режиме для себя искать разгадки, почему доллар США после известного всем «кидалова» отказа от взятых на себя обязательств золотого обеспечения и включенном печатном станке, с того времени никак не обесценится вопреки прогнозам многих экспертов в т.ч. и таких авторитетных и патриотических американцев как, например, Роберт Кийосаки. Мое краткое знакомство с ситуациями где правительство США ставило своих людей у власти после демократических революций проворачивался «фокус» с шоковой терапией по резкому обесцениванию национальной валюты на сотни процентов к доллару, показалось мне очевидным ответом. После такой деятельности правительств, напоминающей опыты Академика Павлова, люди свою валюту уже не считают серьезным средством сбережения, а ее роль окончательно начинает занимать «магический» и «непоколебимый» доллар. \nЧто будет, если это «бумажное волшебство» некуда уже будет экспортировать, чтобы поддерживать рост спроса на «волшебную» бумагу? Он «наконец-то» начнет обесцениваться по такому же сценарию, как и все те нацвалютные фантики которые он заменил. Причем губил он их постепенно, в разных местах и в течении нескольких лет, а вот при остановке роста и качке в обратную сторону вся эта внезапно обнаженная от «волшебства» бумажная денежная масса из «под матрасов» всех этих «уверовавших» в доллар стран хлынет на рынок одновременно!!!\nПосле такого инцидента, других «волшебных бумаг» или их аналогов в разных формах, отличных от золота и серебра, человечество уже не примет, и средства рано или поздно начнут «перетекать» в криптовалюту - как уже существующую и лучшую из всех возможных денег в нашем уже наступившем цифровом веке интернета. \nИ хоть идеального перераспределения богатства не получится (так, чтобы всем поровну), но оно уже сильно сгладит перекос в распределении богатств, который существует сейчас во многом из-за того, что существующие «хозяева денег» хитро заменили настоящие деньги бумажными и незаметно подчинили весь остальной мир своим правилам и власти. \n\n**IХ. Пойдет ли Dash по стопам Биткойн и смирится с приходом ASIC?**\nЯ свой выбор из Биткойна в пользу Даш сделал именно из-за того, что там тогда еще была эта самая вожделенная многими возможность «печатать собственные деньги». Естественно, все остальные преимущества для меня тоже были очень важными. \nНапечатав когда-то своих денег на Биткоине и устав от того, что они ни как на меня не «работают», а со временем денежную массу путем добывания новых Биткоинов «размывают» ASIC, давя на курс и выкинув за борт при этом все остальное большинство, я перелил свои средства в Dash, чтобы воспользоваться новой уникальной и не требующей даже наличия «универсального устройства» возможностью печатать деньги -  запустив мастерноду Dash. Это оказалась для меня вторая по важности привлекательность Dash. Она не так широко доступна, как классический майнинг компьютером по причине более высокого «инвестиционного порога входа», но зато привлекательна простотой и удобством для «крупных инвесторов» которые больше любят играть «по-крупному» чем быть «просто шахтером»)). \nОчень плохо, что в Dash востребованную многими возможность печатать свои деньги забрали монополисты ASIC. \nНадеюсь, после прочтения этой статьи, где я попытался поднять вопрос недооцененной важности «майнерской кухни в ее стратегической части» криптовалюты Dash, сообщество воспользуется своей уникальной возможностью нашей сети – децентрализованным принятием решений операторами Мастернод и сменит алгоритм майнинга, чтобы вернуть эту привлекательную и в тоже время важную для децентрализации и роста сети возможность каждому печатать собственные деньги и впустит на свое привлекательное инвестиционное поле огромную армию майнеров. \n\n**Х. Действительно ли это так важно?**\nТот, кто еще сомневается в привлекательности идеи «печатать собственные деньги», посмотрите на заголовки и содержание бестселлеров книг по инвестированию. Из последних прочитанных мною, особо запомнилась замечательная книга Роберта Кийосаки «Заговор богатых. 8 новых правил общения с деньгами».  Открываем, смотрим на содержание и… больше всего нас привлекает глава 8 – «Печатайте собственные деньги».\n Основной посыл книги о том, что доллар США после 1971 года и отвязки его от золота больше не может выполнять роль денег. Доллар теперь – ненастоящие деньги, которые пригодны лишь для игры в монополию. Кстати, в этой игре есть интересное правило - «У банка деньги закончиться не могут – если у банка закончились деньги, то нужная сумма просто пишется на листочке бумаги» …\nКогда читал эту книгу, то возникло чувство, что Эван Даффилд перед созданием Dash консультировался с самим Робертом или как минимум прочел все его книги. Потому, как гениально придуманная концепция поощрения операторов мастернод в инвестиционном плане полностью соответствует тому, что обязательно всем инвесторам советует Роберт Кийосаки в своих книгах и на семинарах – созданию «денежного потока». Из известных мне криптовалют только у Dash есть такая возможность - создания денежного потока при инвестировании своих DASH в Мастерноду. Кстати, в основных других крипто валютах инвестиционный принцип сводится лишь к «приросту капитала» - то есть покупки актива с надеждой на повышение его в цене. От инвестиций в «прирост капитала» Роберт советует воздерживаться. \n\n**ХI. На сколько умны производители ASIC для Dash?**\nИсходя из придуманного Эваном Даффилдом гениального и одновременно простого метода поощрения операторов мастернод, отсутствует, по крайней мере при текущем курсе Dash, экономическая целесообразность разработки и покупки ASIC. Цена ASIC сейчас сопоставима с покупкой 1000DASH которые необходимо держать в «замороженном» состоянии у себя на кошельке, чтобы получать вознаграждение как оператору Мастерноды. При этом ликвидность Мастерноды в разы большая, чем ликвидность ASIC – средства с мастерноды могут быть в любой момент «разморожены» его обладателем и потрачены. Но… кому придет в голову убивать курицу, которая несет золотые яйца? \n\n**ХII. А что думаете о ASIC Вы?**\nМожно практически воспользоваться блокчейном Dash для проведения анонимного опроса-голосования всех, кого волнует тема открывшегося существования ASIC для майнинга Dash путем перечисления минимальной суммы в 1duff на один из двух моих Dash адресов:\nXgmJji8S3rbCKDuPhav567Kyrhpr8AZRzE голос за смену алгоритма с целью ухода от АСИК майнинга \nXquEjhf1KvzkPX2Jw4596GYioSL2TN7knW голос за продолжение в Dash майнинга на ASIC\nТак как это моя первая статья, то с целью понимания, стоит ли в будущем пытаться еще отнять Ваше драгоценное время, предлагаю оценить ее по пятибалльной шкале, где 1duff – наименьший бал, а 5duff – наивысший бал отправив Вашу «оценку через блокчейн» по адресу Xf5VCvcYUDc77aukK2dBxTAd1s5YLjKUcG  \nСпасибо, Всем удачного инвестирования!!!\n\t\n**ХIII. Благодарности **\nХочу поблагодарить всех уделивших время обсуждению этого вопроса, а особенно члена РУ-сообщества Dash - Qrowz за отстаивание своей принципиальной позиции по поводу недопустимости продолжительного ASIC майнинга в Dash. Qrowz - старожил криптовалютного мира, универсал - вопреки ошибочному мнению о невозможности быть и майнером и инвестором одновременно он является успешным в обеих этих областях. К нему прислушиваются и обращаются за советом многие как новички, так и бывалые участники развивающегося криптовалютного мира. Он, как и я, во времена золотой лихорадки не потерял голову и не поддался на искушение печатать свои деньги, нарушая законы экономики и здоровой конкуренции «специализированными устройствами», сулящими по началу баснословный доход, но доступные не всем. Он выбрал Dash, разглядев в нем технический, а соответственно и инвестиционный потенциал, уникальные инвестиционные возможности Мастерноды, лучшую самофинансируемую, децентрализованную автономную организацию, лучшую команду разработчиков и т.п. И, конечно же, расстроен вторжением в нашу экономику ASIC. Его непредвзятые и обоснованные до мелочей посты касательного этого вопроса можно почитать на разных форумах, в том числе и в русской ветке форума https://dashtalk.org/threads/jakoby-sozdali-asic-dlja-dash.8091/page-6#post-85570.\n\n"
		},
		{
			"post_id": 2,
			"title": "Dash's Incredible 2015 (And A Gaze Into The Crystal Ball's 2016) ",
			"date_published": 1455620040,
			"body": "Special thanks to babygiraffe for his time and effort.\n\nThe passing of a year is a time of unusual rituals around the world, both to celebrate the arrival of the new year, and to predict what that year might entail. The Spanish eat 12 grapes at midnight – one for each month of the coming year. Sweet ones portend a great month while sour ones predict less favorable ones. The Danish have a propensity to leap from chairs at the stroke of midnight, though I'm guessing this doesn't do much to predict fortune in the coming year, unless someone ends up in the emergency room. The Chinese go all out, celebrating for 10-15 days, though their new year occurs somewhere between mid-January and mid-February every year.\n\n![image](img/EvanDuffield.png)\n\n---\n\nDespite all the differences around the world of when and how a new year is celebrated, almost all cultures seem to encourage taking stock of the year just past and making resolutions – or at least predictions – for the next one. As I take stock of this past year personally, it includes some good things and some bad things. The biggest change is that I got engaged and married to my best friend, so 2015 was clearly a great one – certainly one I will always remember. Dash was a big part of my 2015, too. \n\nAt times, it may have seemed that 2015 was \"The Year Of The Troll\" as we fought the urge to respond to an incessant organized campaign of misinformation. When you look past the noise, however, and look at our accomplishments and the market's response, it is clear that 2015 was nothing short of incredible.\n\nIt's worth recalling that Dash is very young for a top-ranked crypto-currency; Bitcoin is over 5 years older. Given where the Dash project is and what has been accomplished already, it is easy to forget that this is Dash's very first full calendar year in existence. And yet, by almost any objective measure, Dash is doing amazingly well.\n\nPrice is certainly one objective way to measure our success. While we've repeatedly stated that price appreciation is not an explicit goal of the project, the team believes price appreciation will result from a well-executed strategy.\n\nDash finished 2014 at $1.91 vs. $3.31 at the end of 2015. Investors have made an astounding 73.3% return. Masternode operators have enjoyed additional rewards throughout the year for their efforts to support the network… Masternode operators that retain their Masternode payments easily achieved over 100% returns. These results compare favorably to Bitcoin's 36.9% return for 2015.\n\nIn terms of market cap, the numbers are even more amazing. We have grown from $9.54 million to $20.18 million, or 111.5% due in part to the growth in the number of coins. Our market cap growth also compares favorably to Bitcoin's 50.7% increase.\n\nIn terms of market cap ranking, we finished 2014 ranked as the #12 crypto-currency, below Dogecoin, Peercoin, Bitshares, Stellar, Nxt, MaidSafeCoin, Counterparty, and yes, even below Paycoin. Today, we have solidly secured the #5 position in the rankings, overtaking all of the previously mentioned coins. \n\nSo it appears that the market is beginning to value our achievements and market potential. When you take stock of the accomplishments the Dash community has delivered, it is understandable why. We have the most active and engaged community in crypto. Our community is filled to the brim with contributors helping in a myriad of ways as their time and talents permit, something you just don't see to the same extent with other coins. There is a strong feeling of comradery, respect, ownership, and appreciation in this community that attracts professional, hard-working, passionate advocates to our project. In addition, there seems to be a real spirit that we are doing something special and transformative that has the potential to literally change the world and people's lives for the better.\n\nSo just what has the community achieved this year? Like I said earlier, it's truly amazing. There are so many incredible accomplishments, that I am forced to abandon prose in favor of a long bulleted list (that kot compiled… thank you kot!). Even at that, I am certain that many things have been missed, large and small. However, it is worth highlighting some of our key accomplishments.\n\nWe had our first Dash-themed music video, which I have to admit, was not hard on the eyes. But, as much as you might have enjoyed that video, we are not all about marketing hype around here. We actually deliver innovation and are building out an amazing ecosystem surrounding ground-breaking technology, so I suppose I should highlight those things as well. \n\n![image](img/InstantX.png)\n\n First, we extended the use of our second network tier to perform more than simply mixing services. In February, we added InstantX, which allows instant confirmation of transactions, the first solution of its kind in the crypto space. In the same release, we migrated all of our code base to branch from Bitcoin instead of Litecoin. This allowed us to incorporate many recent improvements incorporated into Bitcoin.\n\nIn March, we changed our brand from Darkcoin to Dash, which helped better position us for the mass market and align or brand with the broader capabilities we bring to the market besides anonymity.\n\nIn May, we released the first ever voting by blockchain solution, which enabled yes / no voting on questions posed to the community. I believe the first vote was on whether that famous dress was black and blue, or white and gold. Clearly, the dress was white and gold. In August, we released the broadest set of changes ever deployed in a single release, consisting of some 21,000 new lines of code. It included decentralized governance and a budgeting system, yet another set of firsts in crypto… and that, it seems, has changed everything. \n\nThe core team and community are now as empowered as ever. No longer is Dash beholden to the whims (and undue influence) of benefactors to try an idea. Anyone can submit a proposal, receive funding, and implement an idea if they can convince the community of its value. Plus, Masternode owners can more freely support good ideas, because they know that everyone else will be sharing in the burden of funding an initiative right along with them, rather than riding their coattails.\n\nAs a result, starting in September, Dash has funded many amazing initiatives and truly accelerated its growth. We have purchased a new domain name, funded attendance at Bitcoin meetups and conferences, funded sponsorships, enabled a small salary for our developers and other contributors, engaged a public relations firm, and initiated integration with Lamassu ATMs to name but a few.\n\nLooking at this longer list of achievements, I am truly in awe and thankful to the community.\n\n##Achievements \n###Technical / Development\n\n- Stable implementation of the 2nd tier\n- Added InstantX instant transactions: https://www.cryptocoinsnews.co/darkcoin-now-supports-instant-transactions/\n- Blockchain based governance and network-funded budgeting system: https://www.cryptocoinsnews.com/dash-implement-decentralized-governance-system/\n- Upgrade from Litecoin to Bitcoin Core codebase\n- Release of the Dash wallet version 11\n- Release of the Dash wallet version 12\n- Added support for multi Masternode configurations from a single wallet\n- Improved DarkSend speed and efficiency\n- Implementation of the project governance framework\n- Improvements to Masternode payment frequency\n- Implementation of the Electrum-Dash wallet (together with TREZOR implementation): https://dashpay.atlassian.net/wiki/display/DOC/Hardware Wallets\n- Implementation of the Apple iPhone wallet: https://dashpay.atlassian.net/wiki/display/DOC/iPhone - DashWallet v.0.8.8\n- Implementation of the Android wallet: https://play.google.com/store/apps/details?id=hashengineering.darkcoin.wallet\n- Launch of Dash Evolution (3rd Tier, decentralized social data storage, social network functionality, an identity system, a decentralized API):https://www.dash.org/evolution\n\n\n###Marketing\n- Re-branded Darkcoin to Dash!\n\n- New website coinciding with rebranding. More content, new design and multilingual (Chinese, Russian and Spanish) dash.org domain purchase\n- Launched new website design project\n- Creation of \"What is Dash?\" video and translated it to 20 languages: https://www.youtube.com/watch?v=0GACaNvBlwc\n\n\n- Presentation at Barcelona Bitcoin Meetup: https://www.youtube.com/watch?v=wj-5sBFHQAU\n\n\n- Dash keynote in October and next two sessions in November and December\n- Dash as a sponsor of Bitcoin Wednesday\n- New contacts and relationships taken from the event\n\n- Presentation at FinTech Amsterdam: https://www.youtube.com/watch?v=wIvcQIdSbIY\n\n\n- LaBITconf 2015 in Mexico: https://www.youtube.com/watch?v=bqWjAGfegIQ\n\n\n- Evan's keynote during the conference\n\n- New contacts and business relationships with key crypto industry representatives\n- Tennis open advertisement\n- Multiple community videos and marketing campaigns\n- First Dash music video: https://www.youtube.com/watch?v=8EZ8U5F8V1U\n\n###Business Development\n\n- Establishment of new relationships\n-       Bitcoin Wednesday\n-\tLaBITConf relationship and participation in the conference\n-\tKoinbanx relationship established during conference in Mexico\n-\tNorth American Bitcoin Conference in Miami\n\tTransform PR - they will support our PR and marketing efforts\n- Merchants and services\n\t- Initiated project of Dash integration with Lamassu BTMs\n\t- Trezor hardware wallet for Dash\n\t- Genesis Mining https://www.genesis-mining.com/ (offering cloud mining services for Dash)\n\t- Additional merchants, for more details go to: https://dashtalk.org/threads/merchant-directory-listing-updated-oct-2015.3445/\n\n###PR/Social Media\n\n- Extended Social Media Pages:\n\t- 13 Pages (daily updates)\n\t- 4-5 Chat Groups (incl, Slack, Telegram, IRC,....)\n- China (as they can not access dash.org)\n\t- Banner Ads on 8btc\n\t- 8btc Community/ Wallet download page / Dash Section/ translations (100% News)\n\t- Extended Social Media (QQ Group's)\n\t- www.dashpay.cn ready but not launched yet\n- Spain\n\t- Banner Ads\n\t- Translation / Publishing News / Giveaway\n\t- Extended Social Media (FB page)\n- Portugal\n\t- Banner Ads\n\t- Translation / Publishing News / Giveaway\n\t- Extended Social Media (FB page + Telegram Chat Group)\n- Russia\n\t- http://dash.org.ru\n\t- Translation / Publishing News / a lot of community PR\n\t- Extended Social Media (FB page)\n\t- Wiki + YouTube (Guides)\n\t- YouTube 502 subscribers, 56,132 views, 120 Videos (incl different languages + Subtitles)\n\t- Dash Wiki (99% up to date, incl Guides, Videos, Explanations, Help, Q n A,....)\n\n###Organizational\n\n- Dash Strategy: https://dashpay.atlassian.net/wiki/display/OC/Dash Strategy\n- Mission and Vision statement: https://dashtalk.org/threads/dash-mission-and-vision-statement.4998/\n- New core team members: moocowmoo, fulltimegeek, balu, __kot__ and many others\n- Migration to Slack and defined roles in our virtual organization\n\nKudos go out to the entire community. This list is truly awe-inspiring when you consider the amount of work that went into each of those accomplishments. The list of community members that deserve accolades this year would extend to pages, and I would truly struggle where to draw the line. You know who you are. I would be remiss if I didn't specifically recognize the vision and commitment of the founder of our project, Evan Almighty. We are lucky to have a leader with as much vision and commitment as he brings to this project.\n\nA basic overview of Dash Evolution\n2015 was not without its challenges, however. The price sank to as low as $1.16 in January, which may have rattled a few believers. For those that have stuck with this project, it has been rewarding both monetarily and otherwise. Another challenge was the trolls, which weren't all bad. They frequently bumped our BCT thread and provided endless entertainment for those of us that didn't put them on ignore. We've also needed to focus on improving our deployment process for major releases, which has markedly improved already. Bitfinex dropping Dash was a disappointment. At the time, volumes were pretty low, so I can't blame them for a tough business decision. Time will tell if it was a wise one.\n\nAs we turn our attention to 2016, we have many challenges ahead; many we can't even predict. However, it is fair to say that we are as competitively positioned as any point in our history to continue dealing with our challenges, delivering on our strategy, and capturing market share.\n\nTo me, it is plainly obvious why. I don't think any sane and knowledgeable person would argue that what Bitcoin needs right now – more than anything else – is more security. They already possess the equivalent computing power of over 100 Googles to secure their network. Meanwhile, I continue seeing headlines like \"Bitcoin Foundation's Days May Be Numbered\". Yet Bitcoin – and virtually every other coin out there – continues to explicitly allocate 100% of the network rewards toward that solitary purpose in the form of mining.\n\n##Dash Evolution will revolutionize cryptocurrency.\nDash offers a differentiated solution to the crypto market, one that allocates the network's resources more efficiently than any other coin, and has the governance in place to change that allocation as needed to address other needs, such as development, marketing, business development, legal, or any number of other priorities. We are currently 0.32% the market cap of Bitcoin, but I don't see how we could stay there.\nConsidering the sustainable competitive advantages we possess, and the differentiated solutions we offer end-users, I believe Dash will capture sizable markets serving use cases that our network is particularly well-suited to address.\n\nI will stop short of making any specific predictions for 2016. Although the title above promises a crystal ball, alas I do not have one. To be fair, I have already made more of a prediction than Fernando did in Dash's first birthday post from last January. It read, \"…there is no telling what [Dash] will achieve by its 2nd Birthday\". Besides, predictions have a funny way of later making you look quite stupid.\n\n![image](img/980x.jpg)\n\n##A graphic for Dash coffee mugs\nInstead, I will end with my new year's resolution, one that I do not intend to break. I am increasing my commitment to the Dash project. I will apply substantial time, skills, and resources towards its success in the coming year. I am starting my 2016 commitment with a self-funded trip to Miami, additional responsibilities on the core team, and purchasing another masternode. In a sense, I am also ending with a call to action… I hope to inspire many of you to also find at least one more way you can contribute. Find some additional time in your busy schedule, vote on the proposals, introduce Dash to people you meet, or start your first masternode. If we all made contributions large and small, what will we be saying at the end of 2016? What will the world be saying about us at the end of 2016? Time will tell.\n\nNow go eat 12 grapes. I hope each one is the sweetest you've ever tasted. Happy New Year everyone!\nThanks, babygiraffe!\n\nOriginal post is here: https://www.rebelmouse.com/dashisdigitalcash/dashs-incredible-2015-and-a-gaze-into-the-crystal-balls-2016-1541690085.html\n"
		},
		{
			"post_id": 1,
			"title": "Welcome to the first unofficial P2P-blog about DASH!",
			"date_published": 1455619819,
			"body": "Here, in this lovely P2P/serverless network (aka [ZeroNet](http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D)), I will be repost some smart people's materials about [DASH](http://dash.org) from regular web. Or, maybe, I will post here my own thoughts about this lovely cryptocurrency."
		}
	]
}