{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 6,
	"comment": {
		"1516116767_1NGfyDWZU2Y6czRKmXuCTntsf5sbf7pX2P": [
			{
				"comment_id": 1,
				"body": "The Expanse for sure, season 3 cannot come soon enough ! (I maintain a zite with tiny encodes of the show here : http://127.0.0.1:43110/16VPSqtCYkueRqxJCfs6rFQrAQzEwEm3HG/)\n\nStranger things is another favoite, along with Westworld\n\nAlso not sci-fi but techy : Halt and Catch fire but I've trouble finding the episodes",
				"added": 1516389487
			}
		],
		"1516541399_1FFFPdGUQvWPFf4cxmqrGwdKgra3Eu4UhM": [
			{
				"comment_id": 2,
				"body": "Correct me if I'm wrong but just like regular Bittorrent, the peers IP's are not something \"secret\", you can yourself get a list of the peers you're talking to here : http://127.0.0.1:43110/Stats\n\nThese are not linked to a ZeroID though.",
				"added": 1516542207
			},
			{
				"comment_id": 3,
				"body": "> [strange](#comment_1_1FFFPdGUQvWPFf4cxmqrGwdKgra3Eu4UhM): Okif zeroid can't see the ip of the bad actor, how can fight spam? this isn't clear to me\n\nWhich spam are you referring to ?\n\nIn any case, I do think it's ZeroID's job to censor/ban users (that's a concern but the same concern exist on every decentralized network by design)\n\nAlso, you can mute users on ZeroID page, never used the feature myself so I don't know it it would help you.",
				"added": 1516547534
			}
		],
		"1528428020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 4,
				"body": "You could already do that now by having your ZeroNet data directory mounted as \"tmpfs\" (aka RAM disk)",
				"added": 1528439332
			}
		],
		"1560862969_1FqSXCYG7aTFqtAbtRi1qQ7ZEprgpdEd75": [
			{
				"comment_id": 5,
				"body": "Because it's the best P2P Web network and I find it very cool :) \n\nThat said, yeah meaningful content that cater to your tastes might be hard to find but there's hidden gems here and there",
				"added": 1560874512
			}
		]
	},
	"comment_vote": {
		"4_18cuVo4ak3NDVwhTCXE5WtUc4q5ZXYYMu1": 1,
		"564_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"9_19j4HEkZ4ibE71PyzCvarBgznoXsePnUtT": 1,
		"431_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY": 1
	}
}