{
	"posts": [
		{
			"id": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "Looks like ZeroID began banning Tor exit nodes",
			"body": "Welp. End of the line then.\nIt was good till it lasted I guess.",
			"time": 1567211451200,
			"files": "[]"
		},
		{
			"id": "953677c4-68a3-4602-980c-aa28b8871ebc",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": "Oh, and another thing. The message \"Please try again later\" that it gives out isn't present in the only published source code for the zite (https://github.com/HelloZeroNet/ZeroID).\nSo technically it's not even free software anymore.",
			"time": 1567212582200,
			"files": "[]"
		},
		{
			"id": "eb3fa1bb-7969-4aaa-adcb-24aa0c6f034d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>5feeb599-061a-4ede-a56d-d366c3902bfd\nI don't know if nntpchan allows Tor, but it's a (supposedly) decentralized imageboard that's missing from that list.\n>>b0a96ab3-0acf-471e-a9bd-bfd3b01f3243\nnofish (the creator of ZeroNet and owner of ZeroID) seems to have changed the parameters in the throttling algorithms, making it impossible to generate new IDs from Tor Browser (and Tor IPs in general).\nIf you generated your ID using a normal web browser and not Tor Browser, then depending on how much information he saves, nofish might have logs linking your ID and your IP address at the time you created your ID. Which would allow the Police to know who you are in real life. And given that the NSA records everything going through the Internet, it's likely they too know who you are.",
			"time": 1567273374100,
			"files": "[]"
		},
		{
			"id": "63e77f2e-1794-4a17-b7c2-ef06955d05ab",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>5236d1b2-cd2d-4c30-ace1-143695e8da09\nSure, but then again if they ever decide to come for dissidents they'll probably come first for those who they know for sure want to gas the jews or whatever rather than somebody who just is known to use Tor. Not that most of us haven't said bad things on the clearnet in the past, but still.\nAnd in more practical terms, this thwarts my efforts of making truly anonymous posting here possible (as opposed to forced namefagging), which I was trying to achieve by generating new IDs through Tor before every post. You need to do it through Tor to get many IPs, because due to the aforementioned throttling you can only generate so many IDs per day with a single IP. But the Tor blocking seems to have been done by grabbing a list of exit nodes, because I can't believe people are trying to generate so many IDs through Tor that all exit nodes have been banned even if the cooldown period has been increased.",
			"time": 1567274739700,
			"files": "[]",
			"last_edited": 1567274870884,
			"subject": null,
			"capcode": null
		},
		{
			"id": "72710970-c1ba-4d27-a720-3c8e250d7260",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"subject": "HAPPENING - Gitcenter creator criticizes nofish for security vulnerabilities",
			"body": "== Gitcenter creator spills the beans on nofish ==\nA user named gitcenter, the creator of the ZeroNet based code repository that goes by the same name which hosts many ZeroNet related and other projects, and finder of multiple serious security vulnerabilities on ZeroNet, has published [a thread on ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1567261498_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/ZeroNet+security+and+why+I+behaved+weird+recently) where he explains why he has \"behaved weird recently\" and links to a page referencing recent security vulnerabilities (some of which he himself has found) and explaining why he believes nofish hasn't acted quick enough to solve them and to prevent more vulnerabilities in the future, and asking for ZeroNet's development to become more decentralized and transparent.",
			"time": 1567276454984,
			"files": "[{\"name\":\"I warned them.jpg\",\"thumb\":\"10d75c9d6f2f474269635c94e5db05bc52db06db-thumb.jpg\",\"size\":2526441,\"type\":\"image/jpeg\",\"original\":\"10d75c9d6f2f474269635c94e5db05bc52db06db.jpg\",\"directory\":\"1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw\"}]",
			"last_edited": 1567280292546,
			"capcode": null
		},
		{
			"id": "d0351abe-c728-40f5-8a60-06af07b02102",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>165311ed-8ae3-4008-a59c-3a728b12dba6\nYes. But if you just share your private key so others are able to sign posts as you, then they would also be able to edit and delete posts, and you would get muted if they get muted. But look, there already are many ways to make anonymous posting possible while managing spammers. The problem is I and others have looked into it (including Millchan's developer) and right now none of them are possible without modifying ZeroNet itself. It can't be done at the Millchan level because ZeroNet offers no way of removing or replacing pre-existing IDs, even for self signed certs.\nUntil nofish changes the API to make this possible it would have to be done as a plugin that each user has to install manually on his ZeroNet folder.",
			"time": 1567276950446,
			"files": "[]",
			"last_edited": 1567277059846,
			"subject": null,
			"capcode": null
		},
		{
			"id": "905c14a1-b052-47be-9f99-32a6554b2634",
			"directory": "users/19sthK5YaBfwDD1rLzUF2r4xp7AK3gLuyt",
			"uri": "pr",
			"thread": "22efc631-3645-4cbc-b335-bba20b02789d",
			"body": ">>22efc631-3645-4cbc-b335-bba20b02789d\nI wish there were enough people on here to run programming challenges. That one time when there was a programming challenge on 4cuck and I ended up trying to race other anon to see who could write the fastest code and ended up modifying the compiler's asm output was quite fun.\n/tech/'s programming threads were shit though, just rustrannies and functional programming circlejerk stuff. But modifying leafpad to implement all of MS notepad's obscure features (utf16, insert date, .LOG) to show the rustrannie we (C programmers) were better programmers than them was fun enough I guess.",
			"time": 1567278113770,
			"files": "[]",
			"last_edited": 1567278283190,
			"subject": null,
			"capcode": null
		},
		{
			"id": "094d967b-7512-4634-bba9-292ad1ed1519",
			"directory": "users/19sthK5YaBfwDD1rLzUF2r4xp7AK3gLuyt",
			"uri": "pr",
			"thread": "22efc631-3645-4cbc-b335-bba20b02789d",
			"body": ">>15c340c2-354a-4cbc-a502-a7279781ba3d\nMaybe you could just summarize the data yourself and feed that minimal set of points needed to make the chart to the library.",
			"time": 1567278859190,
			"files": "[]"
		},
		{
			"id": "30d25593-2368-4afd-920e-f1cb9ae097f3",
			"directory": "users/19sthK5YaBfwDD1rLzUF2r4xp7AK3gLuyt",
			"uri": "pr",
			"thread": "22efc631-3645-4cbc-b335-bba20b02789d",
			"body": ">>aa0c83a8-de70-4b8d-8e51-21805f81a923\n>>45d67c29-961f-4977-bf1b-19a980dfd8a2\n/prog/ might've been better",
			"time": 1567279231290,
			"files": "[]"
		},
		{
			"id": "c590396c-9416-4c00-99b6-23297b04bbb5",
			"directory": "users/1FuDmNBcouieQ24JV21jvSbyH3kZNh1JZr",
			"uri": "test",
			"body": "== What fuckery are you guys up to? ==\nI just saw a post on this board that changed the username in real time and then disappeared milliseconds later. Wtf?",
			"time": 1567286117313,
			"files": "[]",
			"last_edited": 1567286131813,
			"subject": null,
			"capcode": null
		},
		{
			"id": "4131dfa1-cee3-45e6-965a-e61bc7a91563",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>1367c527-f5f0-4986-a1d0-127b4ad3a1b9\nWhy? **I know you're just trolling and won't post on this thread again**",
			"time": 1567295696353,
			"files": "[]"
		},
		{
			"id": "5727a023-9aaf-4326-a2a8-23b9e398c3d3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "beb0042a-c847-478f-9315-7b6df7ee6b39",
			"body": ">>7ec2eb71-2005-42e7-9939-3b0932669739\nya it worked",
			"time": 1567295762927,
			"files": "[]"
		},
		{
			"id": "6b5a2d67-2335-493d-9c8b-450d338fddcf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>7eec652d-d75c-4f39-8123-301d262abebe\nWhat is broken with Tor is not posting on here. What is broken is generating '''new''' ZeroID certs in Tor Browser. If you have Tor set to Always but use Firefox or some other browser to generate ZeroID certs, it will still work (because the request is going over the clearnet).\n>>b4a23216-a5b7-47d7-82a5-60d59218db04\nLook, if you have any any concrete concerns with this thread, then I'll address them.\nOtherwise I'll just say people indiscriminately calling each other shills and glowniggers for no reason was harming 8chan before it was shut down, and it's going to harm this zite if you continue doing it on here.",
			"time": 1567297511727,
			"files": "[]"
		},
		{
			"id": "3e302f9c-ee28-48f3-bdcb-96ada3ada30f",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>4a4c7859-03d5-4c28-8bae-82eba4898041\nIt's because of the IPs. The reason I noticed it in the first place was because my ID generation script (which goes through Tor but doesn't use a browser at all) began failing. In fact it's possible nofish modified ZeroID precisely because he learned about the existence of that script, but I have no proof of that.\nIn any case there's not necessarily a bad intent behind the breakage. The function of ZeroID is precisely throttling the generation of IDs, so a change in the throttling policies could make all Tor exit node IPs to be \"used up\" too fast, so to speak. But I doubt it's because of that, because there shouldn't be so many people generating new IDs through Tor Browser for that to happen. I suspect he specifically blocked all Tor exit nodes while leaving everything else the same.\nAnyway, there's no way to know what he did. ZeroID seems to be running largely on unpublished code now, since the last public version of the code is from 2017 and doesn't seem to have any kind of throttling at all, and neither does it have the message returned by the API now (\"Please try again later\").",
			"time": 1567299648877,
			"files": "[]"
		},
		{
			"id": "2faba07c-5c3d-4868-8773-386842ec4947",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>4e0fdc50-f919-4698-aede-8d1b7a1b620c\nWell I don't know what you did but it's still broken for me. Maybe try a couple more times and report again?",
			"time": 1567309764713,
			"files": "[]",
			"last_edited": 1567309797813,
			"subject": null,
			"capcode": null
		},
		{
			"id": "a58bc65b-9c46-4d1c-844f-01502e193f7d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>21e4a49c-4c77-461f-9d27-0e03eb461ab3\nNope. I actually did that before trying just now (and I'm pissed off because I had to let go of all my open tabs).",
			"time": 1567310057105,
			"files": "[]"
		},
		{
			"id": "52ca8e9e-e96b-4729-98c3-70d40b732d4d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "c7efbd2c-9a13-4386-b72d-73436fbefd25",
			"body": ">>b64a1930-3063-4e64-bbfa-119e7741d137\n(I'm the same guy posting with a different cert)\nFirst off, I'm not the site owner, so you'd have to take your concerns with him (he's called Acid, also posts under the id 08admin) to the right thread. I just offered to do some coding for him, but right now we're kind of stalled for various reasons.\nSecond, what you're talking about exists (I'm not sure about your link, but it exists as a branch in Millchan's repo) but it doesn't work. Even if you generate a new cert it won't change auth_address, which is the main thing that identifies you. I'm pretty sure of this because the programmer of Millchan himself and another developer called pexo have told me it's impossible to replace auth_id addresses right now with the API ZeroNet offers.\nThird, the reason he switched to ZeroID was because of the spam attack. The switch itself has nothing to do with ZeroID blocking Tor.",
			"time": 1567314149510,
			"files": "[]"
		},
		{
			"id": "65b469f3-79c3-407f-a4f4-1c6103dcd4bf",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": "Guys... I think I know what happened\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q/Will+this+thread+become+the+most+commented+on+ZeroTalk",
			"time": 1567315128900,
			"files": "[]",
			"last_edited": 1567315413341,
			"subject": null,
			"capcode": null
		},
		{
			"id": "3abe5f46-1cf0-466c-8364-4b8e5e1c61d5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>862cef70-46b8-4019-ad35-494eb4d150c2\nWell, I mean... ZeroID is still likely running on closed source code.",
			"time": 1567316012310,
			"files": "[]"
		},
		{
			"id": "d9c50a58-5913-4a85-94d2-174c34b65ebf",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"body": "== ZeroTalk attacked with spam ==\nBrace yourselves I think they might be coming for us. **Spill the beans, which one of you fuckers did it**\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1567156332_1BDuQk2j7RCQKqK4xyPzNLsrNDH6kAXF2q/Will+this+thread+become+the+most+commented+on+ZeroTalk",
			"time": 1567316183342,
			"files": "[{\"name\":\"1469253770157.jpg\",\"thumb\":\"d1f510910ddc1eec6089140e7c85f2272a9166e4-thumb.jpg\",\"size\":561745,\"type\":\"image/jpeg\",\"original\":\"d1f510910ddc1eec6089140e7c85f2272a9166e4.jpg\",\"directory\":\"1LJKApYYKVaWk5d7EFbcvRnFyqe13SkFCw\"}]"
		},
		{
			"id": "542398c5-9555-4c8b-b5fb-ee40f867ed5a",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>3abe5f46-1cf0-466c-8364-4b8e5e1c61d5\n>I'm certainly not an expert in ZN internals but isn't all the code that is run on the client side in the data directory for each Zite?\nSure, but ZeroID has a backend component that normal zites don't.\n>Aside from wanting to know what code is run on the server backend for future reference, do we even care from a security standpoint? I'd be more worried about bugs in ZN's core code.\nIf the publicly available code is shit, it would make it much harder to set up a custom CA yourself. And if they begin doing fuckery like actually blocking Tor, it would be harder to prove it without access to the code (admittedly they could have a custom version for themselves and publish another version to the world, although that would be extra effort).\nBut you are right that it doesn't really have any serious security implications AFAIK.",
			"time": 1567317442000,
			"files": "[]",
			"last_edited": 1567317480200,
			"subject": null,
			"capcode": null
		},
		{
			"id": "43fb4b6e-04b5-4658-bfc8-acbd9690765d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>542398c5-9555-4c8b-b5fb-ee40f867ed5a\nI hope that guy doesn't decide to point his spambot towards here btw. He would rekt us tbh. Wish the admin was around so we could preemptively blacklist his ids.",
			"time": 1567317791400,
			"files": "[]"
		},
		{
			"id": "e4c96911-e8d2-4cb7-ab5e-eef7a7994402",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": "Nevermind. He's the gitcenter guy.",
			"time": 1567318855946,
			"files": "[]"
		},
		{
			"id": "a1f8bdbb-a024-4a6d-a4b9-7d6676ada3e5",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>2677b217-471b-43d0-84e9-7d8c8094ef3a\nI don't see it as him showing off. He's trying to show how brittle the current system is to push nofish to be more open to contributions from the outside, which is probably a good thing. This will help us by proving ZN needs a better API for authentication related things, which would allow anonymous posting in the future, or even allow sites to ask the user to install plugins, which would allow site owners to add any functionality that is missing in the official ZeroNet client software.",
			"time": 1567322999745,
			"files": "[]",
			"last_edited": 1567323151245,
			"subject": null,
			"capcode": null
		},
		{
			"id": "cf639906-a4bc-4ecb-8f67-6dc486100b11",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>5165b3bb-2397-44bd-b079-867dcbbf1539\nYeah, exactly.",
			"time": 1567326233725,
			"files": "[]"
		},
		{
			"id": "9a37caf0-6db4-4a09-b4c7-b260f853adf3",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>cd4e952a-e9ff-4962-9809-4f6691de5177\nI don't know why you would think that. What the government would do is to block Tor connections quietly without telling anyone about it, not make a false claim that could be debunked in 2 minutes.\n>>29ed4316-0024-4c3b-9ebd-33b1a300ab27\nPython and javascript are safer than C(++) because they prevent illegal memory access exploits. What is dangerous is the web browser API but that can't be helped if you want web sites.\n>>21baf98f-5657-49e2-8b3a-dca11cba6482\nLike what? He said many things. If you're talking about blocks then torrents are blocked by many ISPs. If  you're talking about de-anonymization then it has happened with Tor (admittedly not by breaking Tor itself as far as we know), Freenet and i2p.",
			"time": 1567360762566,
			"files": "[]"
		},
		{
			"id": "fb94abd0-8d22-4773-95a3-a432f7d86d78",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>37104d57-1d28-4826-8796-1055fcf57f32\nOh, yeah, the stuff about the ASICs is total baloney. They might do that to crack weak passwords for actual terrorists and such, but they're not going to aim that at us. Unless it was to achieve something juicy like, say, get control of nofish private keys, but those keys aren't going to be protected by a weak password anyway, they're protected by a full length random key.\nBut it's true that they are already tapping all the data on large datacenters located in the 5 eyes. Supposedly in every facility hosting routers for the Internet backbone there's a room where all the cables go through that has NSA's classified equipment in it and obviously none of the regular personnel has access to that room.",
			"time": 1567362175941,
			"files": "[]",
			"last_edited": 1567362357341,
			"subject": null,
			"capcode": null
		},
		{
			"id": "03db29b0-0f93-4fbe-98e9-6d9164422a83",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>cc7f9e3b-387f-4054-8f30-e2a5869a3bc3\nI don't know. But I imagine a lot of the connections go through the US anyway.\n>>bec4e4ce-ffff-4723-afbd-cab1cac04579\n>Have you ever studied zero point energy\nNo, but it sounds like bullshit.\n>and analogue computers essentially giant ASIC's using non digital parts?\nOh boy. Here we go again. There's a thread on old 8chan where we discussed that and I exposed my thoughts on why analog computers wouldn't be practical and you'd be better off with a digital one for most things. You can go dig up the archives if you care.\n>I wasn't talking about ASIC's for decypting I was talking about using dedicated computers, like ASIC's, to find zeronet traffic and block it or modify it as it passes through the datacenter.\nOh, ok. I don't think they need ASICs to find and block ZeroNet traffic. China does that already for a lot of services, presumably with off the shelf hardware. Now, modifying it is another matter, since that would probably require breaking the encryption depending on the details of the protocol and in what ways you want to modify the data.",
			"time": 1567365185829,
			"files": "[]"
		},
		{
			"id": "d0d8485d-2581-46c5-98e6-2e1995b00826",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>cb4df8ee-c0bf-4a6b-8d4d-f9a7b7533db4\nThat means the javascript interpreter is vulnerable, not that the code running on the javascript interpreter is vulnerable.  What language do you think the javascript interpreter is written on? What language do you think pycryptodome is written on? It's not Python.",
			"time": 1567366851800,
			"files": "[]"
		},
		{
			"id": "061734b4-0dd1-4c81-a15b-60bfbb472422",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": ">>299832f9-dfe8-45c7-b530-aca4013f247b\nPython and js programs don't get translated to C, they get turned into bytecode or compiled just in time. And you're still making the same category error that you were before. The binary-level bugs allow javascript programs to do things they shouldn't be able to do, not data the program is handling to do things it shouldn't be able to do (except maybe very exceptional cases).",
			"time": 1567375720053,
			"files": "[]"
		},
		{
			"id": "39e6df09-105c-40ab-83f8-5d5de354e08d",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "4a5d1ed4-dfcf-450d-8af4-320935c64917",
			"body": "The Python or js program is interpreted or JIT compiled by a program written in C or some other language (possibly after being converted to some form of bytecode). But the Python program is never converted to C.\n>>59b042be-065b-46f3-a642-a53257a2bd37\n>Exploit:HTML/Expascii.gen is Microsoft's generic detection for malicious web pages that contains code that exploits a vulnerability in the way that ASCII characters are interpreted in Internet Explorer\nIs Internet Explorer written in Javascript or Python?",
			"time": 1567380140053,
			"files": "[]",
			"last_edited": 1567380320753,
			"subject": null,
			"capcode": null
		},
		{
			"id": "ce749466-9a9c-4079-b729-3a77cda496af",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "063c2667-e53a-40ef-877a-d9eb8f31ded6",
			"body": ">>12a54436-cf2a-4394-878b-fbe3a14af95a\nZeroNet might be going through Tor, but the javascripts in web pages can still call any IP they want. You need to use Tor Browser to fix that.",
			"time": 1567395147867,
			"files": "[]"
		},
		{
			"id": "7779e471-caf7-4eb9-9fa2-3bf324dd6ad8",
			"directory": "users/14r48CcSSyoNo1PNhy6uWriqpopMUfqfUX",
			"uri": "tech",
			"thread": "17f22a9d-8c86-440d-a727-262dcc4af749",
			"body": ">>ed6de680-bc8a-4ebc-9210-113109b4d75a\n>is derived from\nHow? What is the function or algorithm used?\n>Why use ZeroIDs you could just make self signed ones. This way we don't rely on nofishs server being online and non-discriminatory.\nYeah, I meant \"right now\" as in \"without even need the admin to change anything\". But you are right that it would work better with self signed certs.\n>so a observer will notice these non-random routing patterns after a while\nYeah... Theoretically I suppose they could establish multiple circuits and only request sensitive stuff from the ones that happen to go through their desired servers and harmless stuff through the others, but I'd be surprised if they went through so much effort, considering that CIA agents ([supposedly](https://www.youtube.com/watch?v=BwGsr3SzCZc)) used off the shelf phones and put them in potato chip bags thinking that would block the signal. In any case, I was under the impression the way they use Tor was mainly for online intelligence gathering (infiltrating online communities and such) and not for communication with agents in the field, which if we're to believe that talk seems to be done mostly by using burner phones.",
			"time": 1567452761071,
			"files": "[]",
			"last_edited": 1567452823371,
			"subject": null,
			"capcode": null
		}
	],
	"boards": [],
	"modlogs": []
}