{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1540059449,
			"title": "Настройка системы, прошу помощи!",
			"body": "Всем привет!\n\nНазрела такая проблема. У меня, да и не только у меня есть необходимость использовать Windows. Не везде возможно воткнуть Linux/FreeBSD, да и виртуалка с ними внутри винды зачастую - не самое оптимальное решение.\nВозник вопрос - я хочу вычистить с компа всю шпионящую и тормозящую заразу по максимуму. Как виндовую так и прочую, которая рано или поздно проникает и начинает рассылать всякую телеметрию куда не следует.\nЗдесь не стоит вопрос аболютной паранойи. Я ищу адекватные кейсы и прошу у вас помощи в этом.\n\n\nЯ начал прикидывать схему, получилось такое:\n\n1. Варианты дистрибутивов. Выбор.\n\nПервый - сборка nCore Windows, на основе 2003 серверной винды, сама XP уже RIP. Шустрая, пойдёт для медленных и старых железок. Классика. \nВторой - Windows 2k8r2, либо Win7 Embedded. Что то что то, конфигурируется как хочешь, минимум дерьма. Но есть обновления, уже есть \"защитник\" Windows.\nТретий - Windows 10*. Windows 2016*\n\nС первым и вторым - всё понятно. Где есть возможность и необходимость - ставим и конфигурируем, опыт есть да и не только у меня.\nТретий вариант - со звёздочкой (!!!), с ним всё очень сложно.\n\nКак быть? \nМногие производители для ноутов не выпускают дрова под 2k8 и семёрку. Да и для обычного железа всё реже и реже. Остаётся 10-ка и 2016 Server.\nВсе знают про тулзы которые удаляют и блокируют шпионские функции от M$, но они иной раз возвращаются обратно. Как избавиться от этого дерьма? На серверной 2016 такая же херь происходит?\nМожет кто с Embedded виндой разбирался? Вариант на неё перелезть? И взлетит ли на ноутах?\n\n2.Оптимизация и приложения для чистки винды от шпионских функций. \nЯ использую DWS, может есть что получше?\nОтключаю Windows Defender, это источник головной боли. Защиту обеспечить я могу руками, использовать постоянно антивирус - не вижу смысла. Тот же Kaspersky - еще ётот анальзный зонд, превращающий систему в лагодром.\nДелаю разовые проверки для душевного спокойствия.\nКак вы решаете эти проблемы?\n\n3. Браузеры. Я имею ввиду - хром, яндекс браузер, IE, и прочий скам. \nЯ предпочитаю Firefox, но иногда юзаю хромиум - доверия ему больше чем хрому.\nСтавлю набор аддонов - uBlock, HTTPS Everywhere, UserAgent Switcher. Кто-то предлагает всегда использовать NoScript, но я устал возиться с настройками для каждого второго сайта. Может кто знает как настроить его чтобы не ебаться? \nЕсть ещё Ghostery, но он у меня вызывает подозрения. Плюс он тупо тяжёлый.\n\n4. Игры и приложения. Origin, Steam, Xbox. \nС ними я не знаю что делать, они лезут везде куда надо и куда не надо. Прошу помощи. У меня нет мыслей.\n\n5. Телеметрия и обновления в отдельных приложениях.\nЛезу в настройки при установке или после установки и ручками отключаю всё что могу. Туда же идут и опции \"автоматическое обновление\". Обновляюсь руками. Нет, не устаю. Проблем не вижу. Рекомендую этот кейс.\n\n6. Мессенджеры. IRC, Jabber, Tox (хотя кто его использует?) - тут всё ясно.\nTelegram - использую прокси, всё ок.\nWhatsapp - веб, https - ок.\nSkype - жопа. Как только я режу при помощи DWS всю шпионскую херню, Skype перестает работать. Чтобы он начал работать - приходится из hosts убирать часть заблокированных хостов. С этого момента начинается цирк с конями - лезут виндовые обновления, проверки, включается всякое говно, windows defender, рвутся шутихи, из монитора лезут клоуны с барабанами, медведи на велосипедах, скачут акробаты, входят слоны на задних лапах, орут мартышки...\n\n7. Приложения которые бесконтрольно \"стучат\" наружу. Здесь мне начинает припекать по-максимуму. Отследить что от меня что-то долбится я могу при помощи Wireshark, но это придётся записать дохренища трафика а потом копаться в этом, плюс неясно какое же приложение куда долбилось. Я конечно, могу на уровне сетевого шлюза это отследить, но опять же - какое приложение долбилось наружу?\nЕсть идеи?\nУ меня одна мысль - использовать встроенный виндовый файрволл с настройками фильтрации для приложений. Но я не умею это готовить. Кто-нибудь обладает опытом как это грамотно настроить? Подскажите.\n\nЕсли соберём набор кейсов для решения вышеописанных проблем, я готов взяться за написание скрипта, который будет делать всё нужное. И это будет очень круто и здорово.",
			"added": 1540059448
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1540059449_1GuMwrY73dDra7CzWWTNpVL9d6PVGb31E1": [
			{
				"comment_id": 1,
				"body": "слетела нумерация, извините",
				"added": 1540059599
			},
			{
				"comment_id": 2,
				"body": "Я не ищу полной анонимности, я про это уже сказал. Я хочу по максимуму выкосить то что лезет куда-то без моего ведома и согласия. Да и полной анонимности не бывает.",
				"added": 1540063216
			},
			{
				"comment_id": 3,
				"body": "> [anotherneko](#comment_1_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Можно поступить наоборот: поставить linux основной системой, а на нем виртуалку с виндой. Это решит проблему с драйверами даже на антикварные системы и покроет более чем 90% специфических рабочих кейсов. Так же если для работы не нужен интернет, то можно его просто не заводить на виртуалку, что на корню решит проблему шпионажа. [...]\n\nЯ уже написал про это. Речь идёт о железе где стоит винда и надо с ней что-то сделать.\nТам где можно поставить линукс - всё давно поставлено настроено и работает, но увы, это не везде возможно.",
				"added": 1540064207
			}
		]
	},
	"comment_vote": {}
}