{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "ZeroNet - Terminal Linux em x86-64",
			"body": "- wget https://github.com/HelloZeroNet/ZeroBundle/raw/master/dist/ZeroBundle-linux64.tar.gz\n\n- tar xvpfz ZeroBundle-linux64.tar.gz\n\n- cd ZeroBundle\n\n- Comece com ./ZeroNet.sh",
			"added": 1563730412
		},
		{
			"topic_id": 2,
			"title": "YouTube-to-IPFS",
			"body": "#Esta ferramenta pode copiar vídeos do YouTube para o sistema de arquivos inter-planetários (IPFS)\n\n- https://github.com/99fk/YouTube-to-IPFS",
			"added": 1563748763
		},
		{
			"topic_id": 3,
			"title": "Como Sobreviver a um Colapso na Ordem Social",
			"body": "Às vezes, até mesmo os governos podem ser forçados além de seu ponto de ruptura. Um bom exemplo é o caos que se seguiu em Nova Orleans na ausência de ação do governo local ou de uma resposta federal eficaz oportuna no rescaldo do furacão Katrina. Em tempos difíceis como esse, as pessoas são obrigadas a cuidar de si mesmas e de suas famílias por qualquer meio necessário. As dicas a seguir vão ajudar você e seus entes queridos a sobreviver a um colapso da ordem social até o momento em que a ajuda possa chegar, ou, se não aparecer ajuda, prepará-lo para a meta de longo prazo de reconstrução da sociedade no rescaldo.\n\n- https://pt.wikihow.com/Sobreviver-a-um-Colapso-na-Ordem-Social",
			"added": 1563752418
		}
	],
	"topic_vote": {
		"1_15vFuhNGd4CqJZ3opcvjV2WP1x3SxgkKrU": 1,
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": 1,
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_15vFuhNGd4CqJZ3opcvjV2WP1x3SxgkKrU": 1,
		"3_15vFuhNGd4CqJZ3opcvjV2WP1x3SxgkKrU": 1
	},
	"next_comment_id": 12,
	"comment": {
		"3_1CRBWHy3yPiavkJiSey48SQsMW3vtvCVhE": [
			{
				"comment_id": 1,
				"body": "#HASHER na ZeroNet.\n\n- http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1562634059_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK/Quickly+and+easily+cipher+decrypt+convert+hash+data+and+number+systems\n- http://127.0.0.1:43110/1FrvGG1JhEe7Y7zMzcTDP5ThMj49hpcLxL",
				"added": 1563730968
			},
			{
				"comment_id": 6,
				"body": "#Criptografia que não pode ser hackeada\n\nOs pesquisadores acabam de lançar um código criptográfico à prova de hackers - programas com o mesmo nível de invencibilidade que uma prova matemática.\n\n- https://www.quantamagazine.org/how-the-evercrypt-library-creates-hacker-proof-cryptography-20190402/\n\n- https://github.com/project-everest/hacl-star/blob/fstar-master/README.EverCrypt.md",
				"added": 1563731833
			}
		],
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 2,
				"body": "#Os personagens mais inteligentes dos animes\n\n- https://archive.fo/egGQr\n- https://archive.fo/mjfRD",
				"added": 1563731096
			},
			{
				"comment_id": 3,
				"body": "#10 Animes Que Desafiam Sua Inteligência\nAnimes quebra-cabeças, de lógicas que lhe fazem pensar na realidade das coisas, que lhe obrigam a dizer “o que é isso? o que aconteceu?” e exigem que você use toda sua inteligência para entender a história.\n\n- https://archive.fo/votTw",
				"added": 1563731200
			},
			{
				"comment_id": 4,
				"body": "#Animes com protagonistas absurdamente fortes\n- https://archive.fo/bIotY\n- https://archive.fo/iIiut\n- https://archive.fo/7GeeP",
				"added": 1563731459
			},
			{
				"comment_id": 5,
				"body": "#10 Animes com protagonistas que parecem vilões\n- https://archive.fo/XGOZS",
				"added": 1563731543
			},
			{
				"comment_id": 9,
				"body": "#Arslan Senki\nA Capital Real de Ectabana no próspero reino de Pars, uma cidade de esplendor e maravilhas, governada pelo invencível e temível Rei Andragoras. Arslan é o mais novo e curioso príncipe de Pars que, apesar de seus esforços, não parece ter o necessário para ser um bom rei, como seu pai. Ao fazer 14 anos, Arslan parte para sua primeira bataha e perde tudo enquanto a névoa sangrenta da guerra abre alas para chamas abrasadoras, levando à queda de seu glorioso reino. No entanto, é o destino de Arslan ser um governante e apesar dos testes que ele enfrentará, deve embarcar agora numa jornada para recuperar seu antigo reino.\n\n\n- https://www.superanimes.site/anime/arslan-senki",
				"added": 1563748371
			},
			{
				"comment_id": 10,
				"body": "> [narsus](#comment_9_15vFuhNGd4CqJZ3opcvjV2WP1x3SxgkKrU): Arslan Senki\n> A Capital Real de Ectabana no próspero reino de Pars, uma cidade de esplendor e maravilhas, governada pelo invencível e temível Rei Andragoras. Arslan é o mais novo e curioso príncipe de Pars que, apesar de seus esforços, não parece ter o necessário para ser um bom rei, como seu pai. Ao fazer 14 anos, Arslan parte para sua primeira bataha e perde tudo enquanto a névoa sangrenta da guerra abre alas para chamas abrasadoras, levando à queda de seu glorioso reino. No entanto, é o destino de Arslan ser um governante e apesar dos testes que ele enfrentará, deve embarcar agora numa jornada para recuperar seu antigo reino.\n> \n> https://www.superanimes.site/anime/arslan-senki\n\n#Arslan Senki 2\nSegunda temporada de Arslan Senki.\n\n- https://www.superanimes.site/anime/arslan-senki-2",
				"added": 1563748411
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 7,
				"body": "#Seu smartphone seria poderoso o suficiente para te levar até a Lua?\n\nAinda que você não seja velho o suficiente para ter visto o primeiro pouso do Homem na Lua, é bem fácil de achar na internet imagens de uma das maiores proezas da humanidade. E, uma das coisas mais curiosas se pensarmos no dia de hoje é: o poder computacional do computador a bordo da Apollo 11 — espaçonave que levou os astronautas até a superfície lunar em 1969 — não chega nem aos pés de um celular intermediário que pode ser encontrado em qualquer esquina.\n\n- https://canalte.ch/T71D1",
				"added": 1563732384
			},
			{
				"comment_id": 8,
				"body": "#Algoritmo consegue fazer descobertas científicas nunca antes feitas por humanos\n\nUm algoritmo de aprendizado de máquina foi capaz de fazer descobertas científicas completamente novas, nunca antes conquistadas por cientistas humanos, analisando estudos já existentes.\n\nSegundo estudo publicado na Nature no último dia 3 de julho, pesquisadores do Laboratório Nacional de Lawrence Berkeley, na Califórnia, ultilizaram um algoritmo chamado Word2Vec para fazer a análise de documentos científicos. Com a verificação, o algoritmo revelou previsões de possíveis materiais termoelétricos que fazem a conversão de calor em energia, sendo usados para resfriamento ou aquecimento.\n\nA descoberta foi feita sem que o algoritmo soubesse a definição de termoelétrica e sem receber treinamento em ciência de materiais. Foram usadas apenas associações de palavras para fornecer candidatos para futuros materiais termoelétricos.\n\nUm dos pesquisadores do estudo, Anubhav Jain, afirmou que o algoritmo é capaz de ler qualquer artigo sobre a ciência dos materiais e fazer conexões que, até então, nenhum cientista foi capaz.\n\n- Pesquisa: https://sci-hub.tw/10.1038/s41586-019-1335-8\n- Código: https://github.com/materialsintelligence/mat2vec",
				"added": 1563732539
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 11,
				"body": "#Genghis Khan - O Imperador do Medo\nPor que Genghis Khan foi o único homem capaz de criar o maior império da história? O filme desvenda o mistério do grande conquistador muito além dos diversos mitos que ainda o envolvem. Qual o segredo de seu nascimento? Como ele foi capaz de criar o maior império do mundo? Qual era o seu objetivo ao continuar sua busca pela dominação do mundo depois de ter realizado seu sonho de unificar sua terra? A chave para esses mistérios se esconde no drama humano dos amores e ódios de Genghis Khan como filho, marido e pai. Agora, o herói vai emergir da história que o escondeu por tanto tempo...\n\n- https://invidio.us/OmSUdyVHsOA",
				"added": 1563748498
			}
		]
	},
	"comment_vote": {}
}