{
	"next_topic_id": 31,
	"topic": [
		{
			"topic_id": 1523888661,
			"title": "I made a site to make switching masterseeds more convenient [asking for feedback]",
			"body": "Before i even start **Please DO NOT put any seed you used at said site**\ni have made this ZeroSwitchboard a site which serve as a place to store your master seed and retrieve it with a simple click\nI originally made it for myself so i can swap identities with ease but i figure might as well share it with others\nhttp://127.0.0.1:43110/14aubnR5P6bb2QHadJAv33tmEmuNG4vQ7F (needs multiuser plugin)\nPlease do not use it with real masterseed you use and please make sure you have an alternative backup for said seeds\nTo use it you enter a nickname for your master seed and the seed itself, then to switch you need to click copy and logout, you will get a prompt to login if done correctly you just need to paste it\nThe seed is stored in localstorage for the masterseed that visits the page so the data will go blank if you refresh the page OR switched to another account, i cant really think of a better way due to the restrictions on zeronet\nI am asking for any kind of feedback or constructive criticism or ways and ideas so i can improve it\nThis is my first zeronet project, the code and aesthetic need more work but i am focusing on functionality first",
			"added": 1523888658
		},
		{
			"topic_id": 1523689892,
			"title": "Creating Zeronet Plugins?",
			"body": "Anyone know any resources for creating plugins for zeronet?\nonly thing i find is this: [DevCenter](http://127.0.0.1:43110/DevCenter.bit/?/tutorials/write_a_plugin)\nbut it's pretty basic, is there anymore, other then having to RTFS(read the fine source)?",
			"added": 1523689890
		},
		{
			"topic_id": 1524573807,
			"title": "How Does ZeroMe be able to reach hubs you didnt seed",
			"body": "when you are prompt to select a hub it says:\n\n`(With this you choose where is your profile stored. There is no difference on content and you will able to reach all users from any hub)`\n\nhow is that possible then without you seeding it but still be able to reach and view posts of said hubs",
			"added": 1524573803
		},
		{
			"topic_id": 1525030360,
			"title": "Is it possible to be control of a forum yet have no control over it's content",
			"body": "Say i owned some forum(lets not talk about how selfmoderation will work), and i want to ensure that even i will have no power over it's content and PROOF it to the public without needing trust in me, how would i archive while still begin able to update the site?\nthe simplest way is just to remove/forget the site's private key, which is a bad idea because that means you have no way to update the site properly anymore, and you cant really proof that to the public\nIs zeronet even capable of that while allowing owner to keep upgrading the forum etc?\n(and question goes for things like the zerome, is it really censorship proof?)",
			"added": 1525030355
		},
		{
			"topic_id": 1525120316,
			"title": "Can anyone manage to get ZeroLSTN to load?",
			"body": "http://127.0.0.1:43110/ZeroLSTN.bit\nit always goes on loading with no avail",
			"added": 1525120310
		},
		{
			"topic_id": 1525624122,
			"title": "What's Your ZeroNet Zites Wishlist?",
			"body": "What's some site you wish were made?\nMaybe someone can fulfill your wish, so lets share it!",
			"added": 1525624115
		},
		{
			"topic_id": 1525797672,
			"title": "Is a commerce system possible?",
			"body": "To simply put, say i am offering for some software i made at 500 amount of DOGE can i sell it over zeronet and how?\nhaving it handled by some system at an cut of income and have the possibility of blocking my item so or hosting my own is not my thing\nwill it be possible in the future? and how? since it has no real backend server to verify the transaction or to dispatch software.exe to the purchaser it automatically without need of me begin online\nwill it even be architecturally possible here?\n(note: DOGE is an example used here, ideally much currency as possible should be supported for the site owner to pick)",
			"added": 1525797664
		},
		{
			"topic_id": 1525979103,
			"title": "First post!",
			"body": "Someone suggest we should have one so here it is",
			"added": 1525979091,
			"parent_topic_uri": "1525978535_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K"
		},
		{
			"topic_id": 1526069766,
			"title": "Looks like the market took a steep dive again",
			"body": "Anyone know the cause?",
			"added": 1526069753,
			"parent_topic_uri": "1525978535_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K"
		},
		{
			"topic_id": 1526116721,
			"title": "How does the zeronet globe in the slider works?",
			"body": "If it protects our privacy how is our \"location\" shown?\nand is it possible to hide begin shown on globe\nzeronet has tor but i am using normal browser",
			"added": 1526116707
		},
		{
			"topic_id": 1526227608,
			"title": "Game ideas on zeronet?",
			"body": "Intrigued by this post [GitCenter on Zerome - Defenitely need some games here. I'm starting to think about remaking Uplink Multiplayer in 0net...](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/1526214825)\nWhat are your ideas on possible games maybe even utilize zeronet while we are at it",
			"added": 1526227593
		},
		{
			"topic_id": 1526232741,
			"title": "What happen when people out of space",
			"body": "do they have to delete old post to post more?\nor i just post a lot more than most people",
			"added": 1526232725
		},
		{
			"topic_id": 1526306385,
			"title": "The State of Cryptocurrency Mining",
			"body": "https://blog.sia.tech/the-state-of-cryptocurrency-mining-538004a37f9b\na good read, also shows how \"asic resistance\" is not as real as you thought\nmight as well assume 24/7 there's an asic miner on your coin",
			"added": 1526306367,
			"parent_topic_uri": "1525978535_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K"
		},
		{
			"topic_id": 1526381316,
			"title": "Please allow us to have multiple id from one provider in one masterseed?",
			"body": "right now the users.json is like\n```\n\"certs\":{\n\"idprovider.bit\":{ <insert data here> }\n}\n```\ncant we have\n```\n\"certs\":{\n\"idprovider.bit\":[ {<insert data1>},{<insertdata2 here>} ]\n}\n```\nso we can eliminate the need for over complex setup just so someone can keep persudominity?\nusers will be able to pick between different usernames when needed",
			"added": 1526381297
		},
		{
			"topic_id": 1525808694,
			"title": "Is there any youtube clones with actual content creators",
			"body": "rather than having people re-uploading content\nnothing wrong with reuploading, i just want to know",
			"added": 1525808685
		},
		{
			"topic_id": 1525943428,
			"title": "Is there a search engine with actual crawler?",
			"body": "Wouldn't it be cool if we finally get one that's powered by bot crawlers(rather then manpower)?\njust open source the crawler and we will have a decentralized swarm that will all post to a frontend for public, i argue using puppeteer/headless chrome, we will map out the whole network in no time!\nproblem in technical side of how to label sites automatically, only thing useful is the title which is not helpful that they can only search by title",
			"added": 1525943418
		},
		{
			"topic_id": 1525978535,
			"title": "Crypto Currencies",
			"body": "About Cryptocurrencies and Blockchain tech",
			"added": 1525978524,
			"type": "group"
		},
		{
			"topic_id": 1526306012,
			"title": "BCH network update soon!",
			"body": "Which is now or no more than 24 hrs",
			"added": 1526305995,
			"parent_topic_uri": "1525978535_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K"
		},
		{
			"topic_id": 1530020784,
			"title": "Content Filter Plugin Released!",
			"body": "Read more here\nhttp://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:131\nFeel free to share your thoughts\n\nps: yay nofish is back from japan, hope you had a good break!",
			"added": 1530020764
		},
		{
			"topic_id": 1530089348,
			"title": "Do you guys think childrens have the right to privacy?",
			"body": "Since recently there's been plenty of debate over the internet, what you think?\nYour opinion is equally valid regardless of who you are",
			"added": 1530089327
		},
		{
			"topic_id": 1530089964,
			"title": "List Of My Post On Unlimit Talk",
			"body": "There all on [Unlimit Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/)\n\n#### A list of some of the things i wrote on it\n\n[Principles Of Content Filter](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1528703264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/Principles+of+content+filter) - A post where I talk about some things i personally believed to be the principle of content filter shall one was to implimented\n\nIn the comments: i also talked about how a WOT based moderating system can be made\n\n[Why there should be bandwidth control](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/Why+there+should+be+bandwidth+control) - A post I argue in favor of why we should implement bandwidth control despite people might abuse it, good outweighs the bad and empowering users should always be our goal, if torrent managed to survive so i dont see why we cant\n\n[Concept For Blockchain Like Data Storage System](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1529347344_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/Concept+For+Blockchain+Like+Data+Storage+System) - A post where i theorize how a blockchain like data storage system could be made, it can be useful for things that depend on the previous data, like a game of chess is used as example here\n\n#### Why is this here\n\nYou can thank \"Someone\" for suggesting me to post here since they would occasionally search things on zerotalk using zerohello \n\n## Please keep comments here minimum\n\nIt would be nice if i dont have to keep replying here as disk space dont grow on trees, and if worst come worst i might migrate/archive this thread to one of my alts which will result lost of comment section",
			"added": 1530089942
		},
		{
			"topic_id": 1532035388,
			"title": "Anyone has any idea what's the plan of $XTL/Stellite Crypto currency?",
			"body": "They did said something about integrating with zeronet[and IPFS] but that's all i know.\nCan someone explain like i am 5 on what's their plans?",
			"added": 1532035365
		},
		{
			"topic_id": 1536334713,
			"title": "[Solved] Where is the site private key stored?",
			"body": "Previously titled:How do you recover a lost site private key?\n\nbefore we get started: i have backup of everything on my old PC, provided if zeronet didnt somehow delete them they should be there\n\nbasically i am switching to a PC from a laptop, but i lost access to my blog site\ni managed to recover my zeroid, how do i recover/locate where my site private keys are stored at??\n\nanswer: in users.json\nlook for your public key address, then sites, then site address\nlook for \"privatekey\"\ni didnt scroll down enough to see that, i only tried auth private key",
			"added": 1536334689
		},
		{
			"topic_id": 1537880768,
			"title": "Porting zeronet Zites into native apps?",
			"body": "right now all \"apps\" are built on websites, like zerome zerotalk zeroLSTN\nwould it be possible to make an native app implementation of it that interacts the same way as the webapp but in a more streamlined manner and  utilizing capabilities that depend on OS/app/not begin possible to be done in a web browser\n\nfor example zeroLSTN: there could be a player app that only plays zerolstn music, it would also have background playback, OS level integration for playback control like next/prev track etc\nfor zerome maybe there would be a notifications in OS\n\nunder the hood, it would just be an app interacting with zeronet, requesting files, downloading files, playing files to user and displaying tracks for user\n\nprobably would only support Android apps,\nmaybe IOS but needing jailbreak to use/develop makes it unattractive, maybe windows OS but that seems redundant, and probably would benefit more on begin a mobile then a PC",
			"added": 1537880743
		},
		{
			"topic_id": 1540200032,
			"title": "How do i have a per site nightmode setting?",
			"body": "some sites just do it so badly that i rather have light theme\nsome sites do it decently that i am okay with it\nbut there's only one switch here...",
			"added": 1540200006
		},
		{
			"topic_id": 1541280914,
			"title": "Social sites that are remotely active?",
			"body": "[ZeroTalk](/Talk.ZeroNetwork.bit/)\n[ZeroMe](/Me.ZeroNetwork.bit/)\n[Milchan](/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/)\nseems to be the only sites that are \"active\"",
			"added": 1541280887
		},
		{
			"topic_id": 1541368241,
			"title": "Aether 2 is out!",
			"body": "Aether is an ephemeral decentralized reddit like forum powered by peer to peer nodes\n```\nFree, privacy-sensitive public communities\nMass communication without the mass surveillance\n```\nMore info: [GetAether.net](https://getaether.net/docs/)(clearnet)",
			"added": 1541368213
		},
		{
			"topic_id": 1543615742,
			"title": "How to stop zeronet from opening in browser when starting up?",
			"body": "Basically title, I dont really enjoy that zeronet opens itself every time it's started.\nNormally it is helpful, but in my case it isnt really helpful, as i have a messy shortcuts setup in startup folder to start zeronet on boot.\nIs there an arg or something to stop it from opening or do i have to patch the source code?\nThanks..",
			"added": 1543615713
		},
		{
			"topic_id": 1562620455,
			"title": "What is InterPlanetary ZeroNet",
			"body": "been away for awhile so excuse me for asking here",
			"added": 1562620425,
			"parent_topic_uri": "1562456132_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK"
		}
	],
	"topic_vote": {
		"1527416420_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1,
		"1527915269_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1528032819_1HeCQMqcYxJugdjGVt3rS5hzxVyZYUsqoj": 1,
		"1528064284_16HcyFK8526ZYJBKPpSDCbpJv6WWBNvENj": 1,
		"1528171357_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": 1,
		"1529441721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1529820459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1530616286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1536337537_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1537397559_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1537640561_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": 1,
		"1540351048_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1540928131_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1541269115_1PKq2Vg46orbwHD1pW1hVeArcDskWJH3BM": 1,
		"1521392984_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": 1,
		"1550134287_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": 1
	},
	"next_comment_id": 397,
	"comment": {
		"1528271824_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 113,
				"body": "backup your user.json file\ndelete it\nrestart zeronet\n\nYou should read [My blog](http://127.0.0.1:43110/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:11:[Tutorial]+How+To+Configure+ZeroNet+To+Work+With+Multiple+Users) on how to configure zeronet to work with multiple users without needing to restart it everytime you switch a user",
				"added": 1528275532
			},
			{
				"comment_id": 115,
				"body": "> [tempclearnetid](#comment_8_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi): So I deleted users.json in the /data directory, restarted Zeronet and... it reappeared on restart. Did I delete the wrong file? You said user.json but I deleted users.json. Where would I find this .json file?\n\nsorry users.json is the correct file\n\n> [tempclearnetid](#comment_9_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi): Also you said, \" [...]\n\nalso how do you start zeronet?\nassuming you start it using clicking the shortcut, you go in properties which will see the links to the executable\nyou should add that argument in the end of the line",
				"added": 1528354144
			}
		],
		"1528345024_1rFttYwcvZTeYwTHDHC5iy5PsfwHhaHCi": [
			{
				"comment_id": 114,
				"body": "personally i partly agree, the idea of behind an option seems fair\nand i think everyone will be happy to help label sites\n\nor someone can just clone zerosite into zerosites uncensored then share it everywhere and... you are outta luck to take anything down, since now it's controlled by a third party\nbut can you trust they wont pull off the same censoring tactic? probably no unless there's some way in the protocol for the site owner to \"declare signers cant censor anything\"\n\ntrust me i am willing to bet it will happen, someone will fork it no doubt\nand soon anything talking about anything related to CP will need to be on zerotalk uncensored\n\nreally feel like making an indexer/sites list that's dosent have morality but only a job/task to index the whole zeronet\n\nyou cant really have censorship and freedom they cant coexist\nit's not freedom if something is censored, but how far will you go? what's stopping you from slowly ending up in censoring all the things?",
				"added": 1528353953
			},
			{
				"comment_id": 116,
				"body": "> [ssdifnskdjfnsdjk](#comment_298_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i dislike opening porn content without me being aware there is some on that particular site/page. So if webmasters are unable to show a warning when entering some adult page, the community can vote for warning to appear. I already mentioned this still can be called censorship by some and it is not good. [...]\n\nmost federated social networks allow you to mark post as NSFW and add descriptions\nsee diaspora and others\n\nalso i dont think hashes are good, hashes encourage people to be discreet and closed,\nwe should be all about begin open, not closed, if anyone want to have a dispute that a site \"blocked\" isnt nsfw they can just verify it themself by visiting it\neven if you are nofish and it's obfuscated through hash i wont trust it, because i cant verify it myself\n\nandd it's bound to have projects where people try to crack the hash by brute forcing popular sites, rendering it useless to be hashed in the first place",
				"added": 1528361852
			},
			{
				"comment_id": 118,
				"body": "> [styromaniac](#comment_81_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Everyone opposing the blacklist sharing, stop and think for a moment. [...]\n\ni think i like the user trust based system, to continue your example, say if Nekololi push out an update to their list, you will get notified, which you can view changes in a gitlike diff of whats removed and added, which then you get to choose to stay on current version or update to latest\neach update process is reviewed by you, not an automatically \"once trust, trust forever\" modal(unless you really trust that person that you want to auto pull updates)\n\nthere's nothing with wrong with having blacklists, it's just how it's executed it can empower users choice or an act of censorship\nsay if i uses zeronet at public, i prefer not to see anything NSFW, so i choose to add a list of NSFW filter,\nI choose to add it, not because i was forced to or was added by default, because i wanted to, thus this system actually empowers me and aid me, rather then go against me as what censorship is\nso if i visit a \"blocked\" site, i will see a screen with warning, something like what you seen in ublock origin when a domain is blocked under which rules for what reason\nif i want to i can simply ignore, skip or whitelist the site\n\nif you see it as in just a notice when entering a site, it's not even much of a censorship, you can just click it off\npersonally it's the execution that determines if it's an empowering tool or an act of censorship\n\nbut at the core value, trust shouldnt be needed, everything should be able to held accountable to\nsay there's a list by someone i dont know, i can just check each site in their blocklist to see if it matches the category and reasons(which means hashing site addresses is not possible since now other cant hold author accountable to it's action)\nif there's an entry i dont like i can simply remove/edit it\ni might not trust the author but i trust myself to have reviewed everything in the list\n\nusing community moderation is possible, but trust shouldnt be needed, anyone can moderate but preventing [sybil attack](https://en.wikipedia.org/wiki/Sybil_attack)(wiki clearnet) without trust is yet to be known\n\n>Sybil attack\nIn this context it's meant as in people making fake accounts in millions then trying to upvote fraudulent block lists\n\n> [htgozn](#comment_173_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): Good point, I didn't think about that aspect of having the entries hashed would result in verifying the blocking claims being  near impossible and could discredit the trust of said voluntary blocklist entirely.\n\nyes but the benefit of using hash is to prevent more exposure to these sites, but i think in the name of begin openness we dont really have a choice and people will try to break it eventually rendering it more or less useless after the first month or two after the list is released",
				"added": 1528382671
			},
			{
				"comment_id": 120,
				"body": "\\#EmpowerUserWithBlocklist",
				"added": 1528393592
			},
			{
				"comment_id": 121,
				"body": "i personally envision it as patch files\neach patch files can add things to the final generated list\nsay i have\nlocal.blockpatch which has `site1(insert reason) site2 site3` as blocks sites\ni can then apply remote blockpatches say zeronet-nsfw.blockpatch which have `site4(reason: nsfw porn sire) site5(nsfw gore) site6(high risk of nsfw user created content)`\nthat means it will merge local and zeronet-nsfw THEN negate from whitelistpatch for example cointains `site6`\nwhich will generate a final output of `site1(insert reason) site2 site3 site4(reason: nsfw porn sire) site5(nsfw gore)`\n\nfor updates it probably means pulling from origin and checking if the hash is matching current and prompting user to choose to review&update, ignore once, ignore for (time)",
				"added": 1528396160
			},
			{
				"comment_id": 124,
				"body": "regardless of laws user should have a choice to choose not to see content they wish not to see\nand that by forbiddening usage of blocklist you are actually restricting users ability\nand here we are all about empowering users, not limiting them like some clearnet bullshit\n\nthere's a reason no one shouted \"stop this is censoring the web\" when people made ad blockers, ad blockers are meant to block content that deem intrusive TO THE USER at their choice, it's a tool to keep nasty ads at bay\nand shouting blocklist is censoring zeronet is like shouting how ad blockers are censoring the internet\nactually, blocklist gives user a choice in stating what they DONT want to see\n\nplease just go back to clearnet if you really like to restrict users rather than empowering them, this is not the place for you",
				"added": 1528436009
			},
			{
				"comment_id": 127,
				"body": "> [realjohndoe](#comment_11_15tQJFZZ7KVYMX6XPUkcs138LcgDQ2zVcL): You can easily mute users, and you can just delete sites from your profile that you don't like. Only takes a second.\nBut what you want is the ability to control what others see. To have power over others.\n\nthe idea of list is so USERS get to ADD it themself, its user's job to know who to trust\nand no i DONT want control over others, they can CHECK and REVIEW blocklist themself to verify what they are blocking\nYes you can just delete the site but what if you get an warning so everyone around you dont see some huge ass CP on your screen?\n\nYou clearly didnt read everything in the thread, and i have enough of your shit\ni guess you are right, i can just block this troll's ass, welcome to be the first on the list",
				"added": 1528455126
			},
			{
				"comment_id": 136,
				"body": "> [ssdifnskdjfnsdjk](#comment_301_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): would have to be sophisticated not to allow \"low trust\" users, bots to damage sites by freely removing any content.\n\nback to sybil attack we are, we cant have \"anonymity\" yet force free of bots\n\n> [wowsuchuser](#comment_5_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo): Different people prefer different levels of content filtering. Spam filtering is first level of filtering, after which comes child porn, porn, gore etc.\n\nmaybe it should be called \"flagging\" flagging can consist from simple things like `contain swearing`, `politics` to `gore`, `child porn` it dosent have to be applied to dark and morbid things it can be applied to simple things\n\nbut can be maliciously abused to say by a bot flagging everything as `child porn` so that not everyone sees it\n\nmight be helpful to have something like \"trust based\", in the most simplest example:\nsay i trust bob, bob flags this as `troll` since i have ultimate trust level in bob the comment will be hidden without a doubt\nsay there's this comment not flagged by bob, but 15 users flag it as troll and 3 flagged it as not troll\nalice is one of them that i have a low trustlevel towards that flagged as troll, since no one i trusted with higher level(like bob) flags it as not troll, the comment will be hidden and collapsed as grey area(since i dont fully trust alice)\nflaggers who have 0 trust score are not even accounted to prevent botting\neveryone will only have 0 trust score in the beginning, unless the user escalates it\nit's possible to \"consider\" if bob's friend flagged the post mentioned before, but generally trust other may be in a malicious actor, so only if bob's trustlevel maximum or higher, we will add bob's user trust into our final(draw back, trust chart would need to be published for a \"web\" to be formed)\nthus creating something like web or trust, but this time trust of action",
				"added": 1528639383
			},
			{
				"comment_id": 137,
				"body": "> [cane27](#comment_3_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN): censorship - nomoderation - yes pls. [...]\n\nhmm someone can just start a political and then \"remove\"/\"hide\" everyone who opposes them\n\ncurrently milchan already have it, board owners can blacklist threads/post, user also have a choice to not follow board owner's blacklist",
				"added": 1528713431
			},
			{
				"comment_id": 138,
				"body": "> [cane27](#comment_4_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN): i don't see the problem.. just add a topic of your own ...\n\ntoho users can choose not to trust OP thus rendering the blacklist useless if they want so yeah, content isnt deleted but hidden",
				"added": 1528713618
			}
		],
		"1528382232_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 119,
				"body": "i think its due to the tracker's server itself, i have the same problem too",
				"added": 1528383044
			}
		],
		"1528403484_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 122,
				"body": "you need to add --multiuser_local\nsee more on my guide of how to use [multiuser](http://127.0.0.1:43110/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:11:[Tutorial]+How+To+Configure+ZeroNet+To+Work+With+Multiple+Users)",
				"added": 1528435577
			},
			{
				"comment_id": 131,
				"body": "> [redluxemburgist](#comment_6_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc): Where do I put \"--multiuser_local\" exactly? On what file?\n\nthe startup argument\nsay it's `/path/to/zeronet.exe`\nyou add it like `/path/to/zeronet.exe --multiuser_local`",
				"added": 1528543555
			}
		],
		"1528419492_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 123,
				"body": "some people just dont care or want to care in the interest of user's freedom\nyou should really realize that some people intentionally dont want to moderate things\n\nthis is not clearnet so owners can express more freely to enforce user's free speech if they wish, rather then what happening right now with the clearnet shitshow that siteowners are now liable for user's contents",
				"added": 1528435968
			}
		],
		"1528428020_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 125,
				"body": "okay, actually this is more reasonable\nbut how?\nhow does one implement \"saving to ram\"\nunless you mean fetching an image without causing zeronet to download it to disk\nwhich i think need a plugin or patch in core to allow you to only get and save the file in memory not to disk",
				"added": 1528436242
			}
		],
		"1528205347_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 126,
				"body": "for these who will delete it, you should might as well \"pollute\" it first by changing any data to false data\nand i dont think voting is a good idea without an option for voter to create their options as option choices may be biased\n\nfor me i havent deleted it, probably will tho if they try to fuck it up even more,\ni am happy to see how things goes and give them some time to sort their shit out, tho i dont have much hope at all\nwhy even use github when you have other free private repo even the non OSS bitbucket works for free!\n\ntho i am interested in your reasoning to moving\nbut it seems as if most people moved \"because microsoft\"",
				"added": 1528439037
			}
		],
		"1528468903_1G6QESmeipZsukJX5WvDxxwSioaGnEDRk3": [
			{
				"comment_id": 128,
				"body": "site failed to load",
				"added": 1528477714
			},
			{
				"comment_id": 129,
				"body": ">Project: Hide Me\n\n>A friend of mine asked me if it was possible to \"delete\" yourself from the Internet. I said it wasn't but it's quite possible to create so many similar-but-fake profiles that anyone searching would waste a lot of time and perhaps give up.\n\n>What do you all think ?\n\nquote form site\ni think it's quite possible and reasonable in theort",
				"added": 1528540665
			}
		],
		"1528523924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 130,
				"body": "personally i prefer free taxless trustless moderation-less marketplace\na truly free market place\n\neach site is a list directory which can be viewed on it's own and is controlled by the seller\nor in a merger zone by a reader site which anyone can make/develope, clone, fork, to prevent the central site applying censorship using javascript on the reader, multiple sites and forks is needed to keep things in order\none problem is it will has some standards protocol for a general reader to work which still need to be figured on how to unify it and resolve dispute\nthere will be multiple listings for marketplace protocol supported sites, multiple to prevent centralizations as they says a torrent is most vulnerable in it's discovery state, you can take down/control listers but not the torrent itself, this will apply to the marketplace site itself\n\nthe elephant in the room for BOTH your's and mine's example that's never resolved is how to process payment\nsay i have a music store where i sell music, while allowing a lower quality preview\nas the owner how can i \"dispense\" it automatically once i received the payment\nas the user how can i know the owner will dispense it when i paid for it?\nas the developer how can i make it so that both party dont need trust in each other so that user will provide the payment while the owner will provide the files and without using a central server that sends out the file once they get the payment\ni think you always need something like a trusted node that runs on owner's device to dispense the file which will create a single point of failure\n\nmost normal sites lies on the \"user trust the owner(system/shop)\" modal which i personally dont think we should adopt over",
				"added": 1528543453
			},
			{
				"comment_id": 133,
				"body": "> [quantumkitty](#comment_131_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Then again, you'll likely be using your address when delivering items to your home, either way. If a cop suddenly decided they wanted to get you arrested (on any given black market platform) all they'd have to do is pretend to be a customer .. or a seller, even.\n \nwe can make it cost to be \"trusted\" see DASH you can be a master node, but to prevent sybil attacks it cost you 1000 to bocame a masternode aka \"trusted nodes\" that can do special operations like voting on consensus\n\nthe 1000 dash deposit isnt burnt it's just locked and attempts of moving it will make you lose your masternode status\n\nwe can have something like proof of holding value to proof your identity as it will be very costly to just own multiple masternodes to the extend that it outweigh the return\n\nbut all of that assumes zeronet has an currency which we dont",
				"added": 1528557289
			},
			{
				"comment_id": 134,
				"body": "> [burningpixels](#comment_1_12Yr2XxxBj7UKPFc6rJUKYJesfVVujHSRc): i think we already have something for this. Just google OpenBazar. I think this is the best for that. We don't need an Zite for that. Just create your thing on OpenBazar and link ti\n\ni think i kinda have to agree on that to the \"lets not invent if there's already a viable option\" when efforts could be spent somewhere else",
				"added": 1528557539
			}
		],
		"1528403696_1DbNJYiNELNpS2BbYMXa3mkRz8jrSbm9hc": [
			{
				"comment_id": 132,
				"body": "> [marketforce](#comment_2_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8): I could think of a few attack vectors: [...]\n\nvector 1 depends on javascript, you cant tell without javascript if it's loaded,\nnormally there's rules over header that prevent javascript to do stuff with it\n\nvector 3 seems critical doe, anyone can insert a clearnet img link to get the user's IP\nand there's no build in method to block clearnet requests when in zeronet> [marketforce]",
				"added": 1528543861
			}
		],
		"1528628603_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 135,
				"body": "i assume you meant on here?\nwell you will need to make an archive account like me and move the data there\ni know right, the limit is virtually useless in imposing anything due to the fact anyone can create infinite amount of account, thus on paper have infinite amount of limit",
				"added": 1528637313
			}
		],
		"1528940755_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe": [
			{
				"comment_id": 139,
				"body": "> [penetratormk2](#comment_39_1AC3zv2K9eEsm8XpfSirwb13hSdtjHAiu5): I'd prefer newest Minecraft: Windows 10 Edition to get cracked. :)Even pirated MC:W10E lets you play multiplayer with others. (no offline-mode or other tricks required and you get skins)\n\ni have a copy of it, if there's instructions to \"crack\" and make it shareable while stripping personal information\ni am happy to do so\n\ncracking these shitcoin in app purchases will be nice too",
				"added": 1528968681
			},
			{
				"comment_id": 140,
				"body": "> [scrubthesecond](#comment_94_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): Warning: Dumping the game files is as if you copied the game twice. It used a lot of storage! [...]\n\nany clues in bypassing ingame purchases doe?",
				"added": 1528969587
			},
			{
				"comment_id": 141,
				"body": "> [scrubthesecond](#comment_95_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): I'm afraid I do not know how to do that. If I find out, I'll let you know.\n\nisnt the crack file aimed FM7 and not a general crack tool?",
				"added": 1528969910
			}
		],
		"1526455814_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": [
			{
				"comment_id": 142,
				"body": "> [scrubthesecond](#comment_99_1GgNo3CmxPd7n2pMSF3uyqf1XHvgtTUqCe): I didn't know these sites even existed! So, for a site we need (default on ZeroNet), is a search engine.\n\nthere's already a ton of search engines with different rulesets\npity there's no automatic crawlers",
				"added": 1529313875
			},
			{
				"comment_id": 143,
				"body": "> [cane27](#comment_6_1MvfJt4w7iUCEsraP8C8gqNHp5ZQiAKhaN): more MEMES\n\nwe should have memes only zeronet users can understand!!!",
				"added": 1529334694
			},
			{
				"comment_id": 145,
				"body": "> [atomiserxenolith](#comment_4_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX): I've created some original content (a site). Is there any way I can be identified as the original creator of that content? I know it can be copied and 'improved' upon, which is fine. The site has a 'donation' page for anyone who may appreciate the original content. Presumably there's nothing to prevent someone simply changing the donation crypto references and re-publishing the site as their own? Do I need to make it a 'private' site?\n\na \"private\" site also means no one can access it\nand yes anyone can change it and republish it",
				"added": 1529996287
			}
		],
		"1529402881_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 144,
				"body": "go click and select it then click delete",
				"added": 1529411550
			}
		],
		"1529980053_1PEwoQaCpUi6D6p23xswE4H4mZXBnafr5F": [
			{
				"comment_id": 146,
				"body": "you should do \\thething to prevent reformat\nlike\n\\- hello world\n\\- welcome to the world\nWO slashes\n- hello world\n- welcome to the world",
				"added": 1529996351
			}
		],
		"1530020784_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 147,
				"body": "for whatever reasons update dosent show on my zerohello oh well",
				"added": 1530020803
			}
		],
		"1530024238_1PyXS9BpytiuWuoscnwwR3AfF7kxjWCJZF": [
			{
				"comment_id": 148,
				"body": "it should success but no peers so u have to wait for one",
				"added": 1530024673
			}
		],
		"1530089348_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 149,
				"body": "My Hot take:\nYes childrens have the right to privacy,\nAnd when monitoring them you should make it clear and lay out all the terms of what you see and dont and what you expect and what you have control over, they should always know what's happening,\nAnd you should only monitor devices you \"borrowed\" them not devices you \"gave\" them or devices they obtained them self\nAnd they always have a right to refuse to use the device you borrowed them and get one themself by other means\nI would also give them a \"simple/old\" nokia phone for them to call and text other people and they will have full rights to it, which i wont be bother controlling\n\nI also wish there's more \"transparent spyware\", that encourage openness between parents and child,\neverything parent access will be \"logged\" and can be viewed using child device,\neverything parents have control over and dont will also be shown in the monitoring app control panel itself to both child and parent(but only parents can edit)",
				"added": 1530089562
			},
			{
				"comment_id": 150,
				"body": "> [ssdifnskdjfnsdjk](#comment_320_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): i think people with low experience in something should be helped and protected. So kids usually have lower knowledge on abuse that they can face because of sharing private data.\n\nof course education should also be thought on what you should and shouldnt do on the internet, but i think we can protect them without invading their privacy and making them feel uncomfortable by drawing boundaries and mutual understanding",
				"added": 1530103177
			},
			{
				"comment_id": 153,
				"body": "> [sleepy](#comment_3_1Cf9y531APd8946dGhpCjjDAuPwCs2MhgP): Until they are self sufficient, children are property of the parents.\n\nPersonally i disagree with the idea of \"property of other\", I think it as more of a mutual relation, just like you and your significant other, no one \"owns\" the other, if anyone dont like the current relationship any party are free to drop it(break up)\n\nwhile a parent/guardian-child relation, you don't have a choice most times and it's form when you are born,\nBUT if you dont like it, you are free to cut ties with parent and go somewhere else, sustain yourself or go to an orphanage\n\n> [sleepy](#comment_3_1Cf9y531APd8946dGhpCjjDAuPwCs2MhgP): It is no different than women, who are happiest if they are property of the father until they become property of a husband.\n\n[[Citation Needed]]",
				"added": 1530260331
			},
			{
				"comment_id": 158,
				"body": "Of course no one is stopping you to fall onto believing what the law says as acceptable\nBut I rather believe in my own moral viewpoint > laws\njust because something is legal/not legal dosent mean it's acceptable/not",
				"added": 1530604755
			}
		],
		"1530194203_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 151,
				"body": "As far as i know it's not possible, only local wifi can be used with local discovery\ndue to how ISP normally will no doubt block your access if you try anything more than your local WIFI",
				"added": 1530202749
			}
		],
		"1530191313_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 152,
				"body": "personally i hope soon we can create a list democratically moderated\nanyone can add flag pardon/inaccurate/invalid\nusing web of trust, others(that you trust) put weight onto their vote\nin a sense this list creates something which shapes based on the peers you trust\n\nand we can have categories and users all in one page without creating 1 million pages for each thing",
				"added": 1530258587
			},
			{
				"comment_id": 154,
				"body": "> [ssdifnskdjfnsdjk](#comment_331_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): Another approach would be that the site admin can compose such list of trusted users and based on their consensus the flagged content will be automaticaly hidden and admin can see who voted for hidding and can revert the vote.\n\nPersonally not much fan of these, but i guess it's not a bad idea, like site can purpose to client to add trusted user(basically escalate these user's vote only in this site) for this site(only)\nalso i dont think it will be easy for votes of admins to be hidden unless they all share one signing key or what not\nthis will be useful for users with no trusted peers\nbut again, user can always choose not to trust mod(like in milchan you can ignore board mod marking hide for post)\nand fallback onto trusted users or no moderation\n\n> [styromaniac](#comment_177_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): How is it that the idea for a friend-based voting system is so slow to catch on with people?\n\nmaybe too complicated? maybe this deserve it's own thread?",
				"added": 1530283086
			}
		],
		"1530318784_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 155,
				"body": "i can publish it for you if you send me the \"SIGNED\" data\nto ensure i cannot temper with any of it\nalso i doubt you can since you dont have access to the router, probably have to get a new one or something like hack your own router",
				"added": 1530346053
			}
		],
		"1530187949_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 156,
				"body": "i think that \"youtube\" site should be labeled as \"site with user created content but most of them are pornography\"\n\nalso funny to think about this but as we create this blocklist\nwe are also creating an index of pornography sites as a \"side effect\"",
				"added": 1530374036
			},
			{
				"comment_id": 157,
				"body": "> [styromaniac](#comment_197_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): When 'YouTube' has a video labeled \"little young teen gets fucked\" I think you know that it's also a child porn site.\n\ni never said it's not porn site since majority of it's content is porn related, i am just saying maybe we should have more clear description of if the content is usergenerated or not",
				"added": 1530378895
			}
		],
		"1530568658_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 162,
				"body": "> [styromaniac](#comment_227_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I believe you don't get new blocks without visiting the site, disabling and enabling the list again.\n\nthat's kinda annoying also, since in no way you get notified",
				"added": 1530692337
			}
		],
		"1530616286_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 160,
				"body": "> won't have to wonder nor worry about illegal content arriving for the rest of her life. The merger sites that others make won't be her responsibility.\n\nand people dont have to raise concerns over \"censorship\"\nKopy kate can have an \"official\" merger with rules if they desire\nbut you cant really bitch about censorship when the possibilities of making a domain you control is one click away\nalso a way to zone out of porn and chinese language filled land will be nice",
				"added": 1530617493
			}
		],
		"1530629586_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 161,
				"body": "totally not begging for customizable re-organizable collapsible list",
				"added": 1530640957
			}
		],
		"1530712796_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 163,
				"body": "at least now they cant censor us?",
				"added": 1530808231
			}
		],
		"1530873258_1B6sqsG3NZefF44y9TREmf3UqjBDD3KWFW": [
			{
				"comment_id": 164,
				"body": "no unless you jump through hoops like using a multiuser plugin which make it harder to stay anonymous/pseudonymous",
				"added": 1530878999
			},
			{
				"comment_id": 168,
				"body": "i also have a tutorial on how to use the multiuser plugin instead \n\n[[Tutorial] How To Configure ZeroNet To Work With Multiple Users](http://127.0.0.1:43110/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:11:[Tutorial]+How+To+Configure+ZeroNet+To+Work+With+Multiple+Users)\n\nbut TBH it should have been something built in",
				"added": 1531131368
			}
		],
		"1530977864_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W": [
			{
				"comment_id": 165,
				"body": "personally i am also against \"forced features\"\nsoftfork zeronet or make a plugin that will refuse to seed hardcoded site ID would be possible\nor somehow only allow zeronet to write to the file without read\nno read = cant seed\n\nyou can also delete/copy the directory as soon as you are done using it\nwhich IMO is the most damaging possible method and also the most easiest(moving dir can be done in one cmd)\ndamaging for all the peers of the site since now they have to provide that rather than again due to the lack of option to simply not seed it\nwhich not seeding still will generate less stress on the peers then refetching it every time\n(if you cared enough you could move the file back to the zeronet data directory, start zeronet, grab the page for update remove the file again)\n\nyou could also use external tools to block zeronet, so once you done with fetching the site, set zeronets upload to 0 mbps thus it now cant upload anything, when you need it again, unlimit the upload, fetch the file, reinstate the upload\n\npersonally i see the lack of advance bandwidth control as a problem and i argued for it over [on Unlimit Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1528712915_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/Why+there+should+be+bandwidth+control) that we should have one",
				"added": 1530983968
			},
			{
				"comment_id": 166,
				"body": "> [balbo](#comment_13_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W): I obtained something that seems to be working [...]\n\nseems to be working here\nalso leeachers will always find a way\n(just download any external firewall and set zeronet upload to very small amount)\nif they are leeaching they knew what they are doing and more then likely understood the full consequences of it\nit's a free world anyways ",
				"added": 1531072146
			},
			{
				"comment_id": 167,
				"body": "> [balbo](#comment_14_1NEAivkF2GyHcnRQfJjahZD5XyWfJv1a1W): @thunder33345 what do you mean? Can you see my new site or are you talking about the patch?\n\nmy bad \"working here as in i cant see your page\"",
				"added": 1531072627
			}
		],
		"1531129038_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 169,
				"body": "sure you should\ndont see why not\npersonally i see the core feature of zeronet is integrating with news feed\nmaking checking multiple sites a thing of the past\n(wish clearnet has that(notification API personally is not the same as a homepage with everything at a glance))",
				"added": 1531131652
			},
			{
				"comment_id": 170,
				"body": "I thought zerotalk and me and also zerohello is infinite scrolling\nalso personally like the upvote/downvote thing is not a perfect system\nnor i can think of any perfect system for voting on comments\nworth watching [The Downvote Predicament](https://www.youtube.com/watch?v=rPiF475oSc4) And [Why YouTube Comments Suck (and Reddit comments don't)\n](https://www.youtube.com/watch?v=Lvf8koqX_yE) (both clearnet)\n\nno downvote here probably is something like anyone can mass create account and mass downvote\nwhich can create censorship\nand vote button without context can be assumed as a dislike/like button",
				"added": 1531147054
			},
			{
				"comment_id": 171,
				"body": "> [lola](#comment_42_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Thank you for the videos. They are really well done and interesting. It gave me good insight of what I could do for my project. [...]\n\nif you like it they also made other content while not directly related it's interesting nonetheless\n\nmy technical opinion/suggestions:\n\n## Use Mergers\n\ni think sub reddit style, but decentralized, each sub has it's own owners which is a merger site\nthus \"reddit\" maintainer dont have responsibilities nor can censor anything (wish milchan is like this, while the owner dont really care it's still would be better IMO)\nthere will be a central protocol committee and a centrally maintained client(like zerome, but anyone can make their own client+hub)\neach merger site can contain one or more then one \"sub\"(so you dont need 1 site for each sub)\nowner can make sub creations public/owner only\nthus it allows you to view ALL collected threads in ONE place from subs you subscribed(subscribe is like a button that tells the client to render it in homepage) or tuned in(tuned in is like a local /r/all, all merger zones will be listed)\n\n## Hybrid Comment Section\n\nfor comments, i see a clash, some people like a liner/flat conversation(like here/mail/forums) or nested/hierarchical(like reddit)\ni feel like we can hybrid them\nbasically all threads start with liner replies, all liner replies can be replied linearly or nested,\nall nested comments must start with a liner reply\nnest can go to infinite depth\nExample:\n```\n[reply1]\n{\n [nested liner reply1]\n {\n  [nested reply to nested liner reply1]\n  [second nested reply to nested liner reply1]\n }\n [liner reply2]\n}\n[reply2]\n[reply3]\n```\nwhile i originally planned out that all threads can be replied nested or linearly same for all nested\nbut i have trouble warp my head around how that would work\nand over complicated is bad because it make it harder for people to understand or use\n\n## Comment/Thread Sorting\n\nfor sorting, i personally feel like it should be default sort by new, sorting by hot/top is asking for a disaster to happen as anyone can simply vote fraud\nand no one done it yet is just because we all abide by the unspoken gentleman's rules\nof course you could change it to hot/top for your amusement but said values shouldnt be directly trusted\n\nfor comments order it would be sort by new, or can be made to sort my activity which will show nested replies in timeline scale for discovery\n\n## Indexing Problem With Mergers\n\nthe problem with mergers is like the problem with torrent, yes a torrent is hard to take down, but a tracker can be easily take down\nto translate to this context, all these sub[reddit]mergers need to be listed somehow\nbut the listing can easily be controlled, like torrent trackers which is bad for our cause\ni dont have any solutions other than to support multiple listings\nofficially we can have two listings, submerger listing and [uncensored]submerger listing\nsubmerger listing will have mild moderation\nuncensored listing will have 0 moderation(but we have no way to enforce or proof we have 0 moderation power other then trust)\nand then 3rd party listings, which is a collection of other people listing which we intentionally have 0 control over\nsadly the only way would be embedding such data into our client\n\n## Cross Linking\n\nwe also have problem on how to cross link to sub[reddit]page on same submerger or different mergers\ni think we should always assume a subpage always has a Unique Generated Identifier which is random, and consist of AUTHADDRESS/randomoruserinputdata\n\nand only site owner is capable of creating a subpage with a readable identifier(SITE/ID) by creating the subpage at address data root or to alias file linking to AUTHADDRESS/randomuserinputdata since if the data isnt unique everything will go in wreck\n\neverything should be able to be linked by submerger(address/.bit)/subpage(which can be readable/authaddress+userinputdata)\n\n## User Profile\n\nfor user profile since everyone is now everywhere on each submerger user could customize/create their own profile data which dont have to be identical cross mergers\nuser can also query user data by searching using authaddress to find all user's data cross mergers they are in\n\n## User name problem\n\nthis also need to somehow natively support all singers and always assume username to NOT be unique\ni think we should display it as Thunder33345(AHEQ...MX5K)@zeroid.bit(iD5Z...duGz)\nthe () are the first and last 4 characters of the public key\nboth user and signer trucend key can be toggled, how much first and last char/all char or hidden/mouseover\nthis prevent impersonations on signers that allow same usernames(afaik public key will always be unique)\n\n## After Note:\n\nYep i did it again, i puked some very long text again, hope this read at least shared some insight/opinion of mine worth your time\nI always have this annoying habit of writing too much /shrug/",
				"added": 1531241869
			},
			{
				"comment_id": 177,
				"body": "> [lola](#comment_43_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): I have read it but it took me a while :) [...]\n\nsorry for puking out wall of text, i sometimes just cant help not to do that when i am passionate about something\nyeah feel free to mention me if you want, you dont have to tho",
				"added": 1531501745
			}
		],
		"1530097903_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 172,
				"body": "hmm we should have subscribe and newsfeed",
				"added": 1531308984
			}
		],
		"1531369176_16mEBTR7dyjQc7Lxmc9um4TfvM8W4oaAnV": [
			{
				"comment_id": 173,
				"body": "smell fishy\nplease use 0paste next time",
				"added": 1531383682
			}
		],
		"1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy": [
			{
				"comment_id": 174,
				"body": "> [usersdoctor](#comment_6_1Jz58PYy4dgxNX4QuPsnDpPQgF5UNvcEVx): report / ban  button or option is really necessary\n\nYou can \"ban\" people by muting them, without censoring them\n> [jlxip](#comment_113_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C): I don't think report/ban would even work here.But we definitely need reputation points, like \"karma\" in Reddit. That would be great.\n\ni dont think it's a good idea simply because people can make account with ease, to mass vote and censor/promote things\nwe really could help with Web Of Trust content voting",
				"added": 1531424285
			},
			{
				"comment_id": 175,
				"body": "> [htgozn](#comment_239_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2): Web of Trust ratings can be just as easily manipulated through votes casted by multiple dummy accounts that provide similar ratings on sites disapproved of.\n\ngood you called that out\ni should have said `web of trusted friends`\nanyone's votes is irrelevant UNLESS user assign a trust value to it\n\nsay you can make 100 accounts and vote spam on a post but these votes wont be accounted for, unless you make me assign a trust value to it\nsay with positive interactions and seeing you around the forum once i am convinced you are not a bot\nwhich wont be easy and take effort\n\nand yes the flaw lies in users with no trusted peers which means they will take the full unfiltered blunt of everything\n(tho site admin can \"suggest\" users to add mods into their site with a high per site only trust value)\nit might not be perfect, but\nit's never centralized or\ndont have any single point of failure/trust,\nand you never need to trust the system for it to work(no user validators, anti bot validators etc are non existence)\nwhich i think most of us believes the above as something that is core principle of zeronet\n\nI did talk about it with a overly long explanation of how it will work see here on [Unlimit Talk](127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/?Topic:1528703264_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K/Principles+of+content+filter#comment_6_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K)\n\nnote to self: make a mega thread before discussion of it get scattered over everywhere",
				"added": 1531472190
			},
			{
				"comment_id": 183,
				"body": "> [nicwow](#comment_4_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa): Not necessarily removing them but removing them from those who don't want this. Preferably set to this by default.\n\ni think this is more viable, hiding them by default is still better then deleting since it allow people who want them to freely discuss without annoying people who dont\n\nbonus point if we can flag our own post",
				"added": 1532247139
			},
			{
				"comment_id": 184,
				"body": "yes i agree no fish the site runner have full rights to ban/hide anything\n\nthe only reason they didnt/havent is because didnt choose to do it\nand said contents are only here under their grace\nbut doing it sounds counter intuitive,\n\n>start a darknet to avoid censorship\n>people start posting things that get censored on clearnet at your forum\n>ban them\n\nof course, anyone is free to make their own site, which they will be free to set the rules\nand no one can ever touch them or try to take it down(due to how zeronet works)",
				"added": 1532375127
			}
		],
		"1531491152_195Xafx3aZsxtngKo7D3XWgByQ5rYJX1C": [
			{
				"comment_id": 176,
				"body": "it probably exist to prevent people burning other's disk\n\neven if you skipped it the other nodes probably will ignore/ban you",
				"added": 1531501656
			},
			{
				"comment_id": 178,
				"body": "> [styromaniac](#comment_33_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The cooldown probably encourages proofreading and discourages spam. [...]\n\nas far as i know once you sent you cant really do much\nalso you dont have to keep the tab open as long as it's sent to one peer\ndont know if it is capable of doing it via background\n\nand it's also possible to remove the ratelimit from your own client, as how it will interact with other clients is not known",
				"added": 1531557153
			}
		],
		"2_13zHC2gJ9L8ocNgzgPVBJSm4CJyL8YQezj": [
			{
				"comment_id": 179,
				"body": "this thread remind me that we could do with a new revamp of zeromail and use the lattest technologies",
				"added": 1531659392
			}
		],
		"1531858758_16pUJsNvJihjQ4ayt8VxxJeHjCfvEe5o17": [
			{
				"comment_id": 180,
				"body": "blocking the boards itself should work\nbut do we really expect this to be as clean as clearnet?(if so why even exist?)\nand yeah duplicating files make zeronet inefficient in some stuff, which gets amplified on big files\nbut i think this can be a safe place to host torrent trackers",
				"added": 1531906682
			}
		],
		"1531836231_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 181,
				"body": "probably caused by unexpected crash\nsometimes if i powerdown/kill zeronet it will throw these errors on next bootup\nnothing can be done other than to wait",
				"added": 1531906861
			}
		],
		"1532143906_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 182,
				"body": "you could try to access a zeronet site like http://127.0.0.1:43110/Talk.ZeroNetwork.bit for example\nbut the policy probably will block it\nand dosent work if they use a off site private proxy or used any other ports\n\nand if it's a possibility it can also be dangerous to the user\nwe all know it's a bad idea if any site can tell if you had tor installed even when you visit the site",
				"added": 1532176839
			}
		],
		"1532697310_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 185,
				"body": "is it specific to browser or zeronet?\ni would like a browser plugin that:\nblocks any webrequest that isnt zeronet bounded\nand prompt user to whitelist destination or site or allow once\nit's simple way to prevent leakage\n\nalso a zeronet plugin that allows you to hold multiple identities/username under the same masterseed\n(still would recommend using different seeds for identities you dont want to be linked with)\n\nSite auto history archiver plugin\nbasically a way to prevent self censor by anyone else\nbasically the plugin will index for each change and merge them in a git log like rewindable storage\nso if anything bad happen anyone can view history, and fork site from history for example\n(noted due to previous incident of owner self censorship)\nfor a more run through of this [see this thread where someone ask how to access previous version of a site(but they cant due to lack of backup)](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1527003512_13mmQytg34syftQYB5eFFMA9ATsGGmjk46#comment_89_13M95JbtDAEbK2yqqTqZfcQ1qLXLe5YYr2)\nTLDR: plugin logs every change/after X period of time ex 12hr,\nplugin stores it in database and can revert/fork/view history when deem needed,\nplugin also will share their snapshots of sites to other peers who asks for it to create a global decentralized effort\n\nthis would be more advanced and complicated but i think would be for a good cause",
				"added": 1532767097
			},
			{
				"comment_id": 188,
				"body": "Another example idea would be an advanced bandwidth control panel\n\n> [styromaniac](#comment_108_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): As far as I've been told, blocking clearnet requests isn't possible from ZeroNet, but there are alternative solutions to that. The easiest method is firewalling the browser, which I've successfully done with NoRoot Data Firewall (Android). Nekololi uses uMatrix (Firefox).\n\ni mean ad blocker can block clearnet request by specific parameters(see ad blockers)\nso i would like to assume it's something very basic?\ni tried before but due to lack of any experience in chromium i gave up\n\n> [lola](#comment_58_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): I would also like to be able to have several identities/username under the same masterseed. I don't think it is unsafe unless your masterseed is discovered but it is good enought for Bitcoin wallet so...\n\ni think it's fine if it's a grouped identity, i would still use a new masterseed for seperated identities\ndue to the AUTH address thing",
				"added": 1532861809
			}
		],
		"1532715560_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": [
			{
				"comment_id": 186,
				"body": "i still think segregated merger zones would be better, for the sake of decentralization of power\nsince the said mega hub owner could literally nuke anyone off their platform if they wish\n\nmerger zones means everyone have control of their own platform\nwe can have an integrated viewer that create a stream out of everyone's hubs that follow a standard",
				"added": 1532767356
			},
			{
				"comment_id": 189,
				"body": "it's \"unfounded\" concerns with no real examples of it happening\nbut regardless i always stand on the caution side as it should be as trustless as possible\njust because something didnt happen dosent meant it wont\ni mean we built this platform where anyone can host sites without any trust, isnt it defeating the point for falling back onto using trust?\n\nfor a hypothetical example you wanted:\n\nsay i own X site, i have sub blogs for everyone, i could care less of what you posted there, unless you post anything bad about me, which then to me it's as simple as adding your ids into the banned list\n\nnow say everyone have their own blog which is in a merger zone, if say i control a integrated stream viewer site, i could try to censor you\nbut as soon as everyone notice they will just leave my site and use someone's else site\nand the raw data is still untouchable by me, i can only attempt to hide it, but i cant delete it due to how the data is under your own site",
				"added": 1532862341
			}
		],
		"1532820348_1BBLpFiExm8RJzxZmmw7GYoP2jd8exQnGe": [
			{
				"comment_id": 187,
				"body": "yes zeronet has some pros but the cons of using zeronet is:\nserversided computation is impossible due to the decentralized nature of it",
				"added": 1532861475
			}
		],
		"1532992852_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 190,
				"body": "site blocklist are generally fine\nusing user blocklist is where it gets more dangerous\nsince you will be taking site author's claims at face value\n\nwhich since we are here i assume you already know why blind trust is bad",
				"added": 1533019078
			}
		],
		"1532983813_1JHx7fetxzMnUyQ5bUpNLAKAW9VEZdbFMa": [
			{
				"comment_id": 191,
				"body": "You should be able to upload\nwhile sidestep the UI\n\nsince no one can actually limit it\ndue to how everything is client sided\nonly thing that's peer[sudo server] sided is the total space you are allocated and allowed to use",
				"added": 1533019202
			}
		],
		"1535470352_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 192,
				"body": "\"Time doesn't exist in decentralized systems. Stop thinking you can perform safe actions based on time. \n\nAt best you know the time you took an action and the time *you saw* someone else take an action. Everything else is a lie you tell yourself with varying confidence.\"\ni dont think anything will be able to prevent faked time without begin truly decentralized",
				"added": 1535982762
			}
		],
		"1535458873_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 193,
				"body": "not sure, havent been around for a long time, but i doubt there's any spider that can be work collectively and decentralized that anyone can submit sites\nlike a spider that anyone can download and set to feed results to certain sites they trusted\nif it does, please link it",
				"added": 1535982884
			}
		],
		"1536334713_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 194,
				"body": "> [blurhy](#comment_77_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK):  i have backup of everything on my old PC\n...\n> i have backup of everything on my old PC\n\nTLDR: where is the private key for a site address stored",
				"added": 1536335177
			},
			{
				"comment_id": 195,
				"body": "> [gitcenter](#comment_346_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): In users.json.\n\nyeah but where?\ni get a prompt to enter my private key\ni need to know where to copy that from\nis it the masterkey of my auth address? that dosent seem to budge\n(i have bunch of junk i dont plan to copy over)\n\nalso offtopic, hows the background and peer plugin doing?\nbeen awhile since i was here..",
				"added": 1536335763
			},
			{
				"comment_id": 197,
				"body": "found it \nit's privatekey\nnot auth_privatekey which i got confused for and didnt look below for it\n\nalso try making few sites that need background processing, great job of a POC you did on /z/place\nmaybe a game or something utility based maybe the ip service thing would help with it?\n\nalso any IRC yall been hanging out on?? did everyone just kinda just left `IRC 2`, yeah i guess not having a cached message in file system sucks if a chat isnt active\nwhat about ZIM?",
				"added": 1536346654
			},
			{
				"comment_id": 198,
				"body": "> [hermes32](#comment_18_1LFxK1BSHEnkJcXXb4qGszVUxEwqLVSJU8): Lost is Lost !! No backup, no site private keys\n\ndo people even read?\nor just language barrier and using badly made translators?\n\n> [thunder33345](#comment_197_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): found it\n>it's privatekey\n>not auth_privatekey which i got confused for and didnt look below for it\n\n\n\n> [thunder33345](#comment_194_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): TLDR: where is the private key for a site address stored\n\n>i have backup of everything on my old PC",
				"added": 1536350260
			},
			{
				"comment_id": 199,
				"body": "> [krixano](#comment_529_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): The problem is your title doesn't completely fit the body. People look to the title, especially when the post is question based, in order to find the main thing you are asking, and in the title, you say lost site private key. That's my explanation for this.\n\ngood point, edited title to reflect it\nalso havent been here for awhile, hope i didnt missed anything out and you are doing fine",
				"added": 1536353375
			},
			{
				"comment_id": 201,
				"body": "> [krixano](#comment_530_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu): I've been doing okay. Did you see I've released KxoNetwork which can search many zites, has a (currently very simple) plugin store, and allows the registration of KxoId's (by using PeerMessage plugin)?\n\ni like the search and utilize of zerotalk\nmaybe topic only view will be nice",
				"added": 1536356953
			}
		],
		"1536337537_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 196,
				"body": "nice finally some use out of it(the plugin)!!!\nwould be nice for zoom and pallet begin somewhere else\nand coordinates\nalso another chat+forum site, or a realtime only embed chat..",
				"added": 1536339899
			},
			{
				"comment_id": 202,
				"body": "By the way i ran out of space, lmao\nwell i hope it can auto discard any pixel that was overwritten",
				"added": 1536418906
			},
			{
				"comment_id": 203,
				"body": "> [gitcenter](#comment_349_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): I'm fixing this right now [...]\n\nfailed\n\n>Content signing failed\n>Include too large 100529B > 100000B\n\nalso would be nice to somehow be able to reshow the disable prompt since i somehow failed to grant admin to the site because multiuser plugin dont like it despite how i had local multiuser flag enabled /shrug/",
				"added": 1536443661
			},
			{
				"comment_id": 204,
				"body": "> [gitcenter](#comment_350_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Okaay, I've added binary format support, which should make files about 2 times less.\n\nwhat about pruning bits that get overwriten?\nor these that ware same as background?\nand dont try to update if the color is the same as previous",
				"added": 1536493964
			},
			{
				"comment_id": 205,
				"body": "> [gitcenter](#comment_353_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): cause if we remove background changes, the color won't return to red -- it will return to the color set by other users.\n\ngood point\n> [gitcenter](#comment_353_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): It sounds like a good idea, but we prune bits now, so this won't change anything.\n\nonly reason i asked for it is to deal with the spam on the left LOL\nnot to keep data space or anything",
				"added": 1536494460
			}
		],
		"1536332522_14RCTJp4ozmDH2c49CxmC98Mfp1fsgXz3F": [
			{
				"comment_id": 200,
				"body": "probably have some implications, but you can seed only generally \"safe\" sites like zerotalk",
				"added": 1536355812
			}
		],
		"1536806132_15Yab63fdrkKWDkvGdeK4DD4UjUBcNirTC": [
			{
				"comment_id": 206,
				"body": "Milchan board might be worth considering\nbe warned the author of the site have a chill view of dont really caring what content you put there quote:\n> I'm not here to be the moral arbiter of what users should be allowed to say and/or share.\n>Anyone who understands that is welcome to use this place.\n\nIf you cant stand people posting whatever they want please dont go to [Milchan](http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/)(content warning, may contain \"undesirable content\")\nwhile it's not reddit like it's still worth considering\n\nthere's [notabug.io](https://notabug.io) clear net distributed actually reddit like board\nno accounts and all post are POW backed\npro+con: clearnet(no client needed, but site have some rules), pow(no account based, votes can be \"bought\" by having a better rig)\nand anyone with a decent rig can bot their post 100 votes easily, and anyone with enough power can censor a post by botting 500 downvotes\n\nmaybe one day we will have some **ACTUAL reddit clone** but with merger sites for each sub to disperse liability\nand to make these from clearnet feel welcomed and at home(gaining user is kinda our goal forget about flaws of upvote/downvote and possible abuses/Sybil attack, these can be consider latter)\n**to me i think it's a goof way to obtain more users by making them feel at home**",
				"added": 1536830710
			}
		],
		"1536786377_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU": [
			{
				"comment_id": 207,
				"body": "> [pdelic](#comment_14_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU): I just realized the page updates automatically.\n\n> [pdelic](#comment_15_1EEiSF637om9uuRRfCLuALtbXpXvYcKMuU): Without refreshing the page....\n\nyes content updates automatically via javascript when the client receives new files it notifies the JavaScript client to fetch and update page it's pretty cool\n\nalso am i the only one who feel like there should be a clone of reddit despite all it's flaws just so we can make people feel like home and board people on easier",
				"added": 1536831955
			}
		],
		"1536836748_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 208,
				"body": "i dont really ask for much, most search engine only do site title which is fine by me, we dont need to load a full chunk of pages to query it\nbut none of them are even close to completely mapping out all addresses + title + description which is a joke in itself most search engines get abandon and left to collect dust, maybe plans to mapping meta title, description, keyword if that wasnt too much to ask\npersonally i would prefer distributed crawlers software anyone can run and distributed zites where crawler can submit new found data to\nyou can probably find a lot of links just by crawling zerome or zerosites and propagating through them\n\nin terms of scaling, probably yes you would still need to download tons to data to even search them\nto be honest this is where begin truly decentralized we are hurting ourself\nif this wasnt decentralized, someone can build a crawler+db on their server and we sent queries there which the server processes and spits respond out\nbasically every clearnet search engine ever,\nbut we here cant, thus we are faced with a interesting question,\nand possibly a cool solution to this madness\n\nyes you cant search for something you dont know, unless we reach advance level of google and sort to be able to search without a direct query, that will probably take a long time\nbut one that can do the basic wouldnt harm for people who knows at least the name of the site, or just for poking around sake by using the map of sites that know to exist",
				"added": 1536847922
			},
			{
				"comment_id": 210,
				"body": "> [trenta3](#comment_13_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): After defining a decent way to specify a document unit (see my issue), one could create a plugin that from each site the user seeds extracts and indexes all documents.The same plugin would be used to do searches by sending requests to other peers and returning the document unit URL. [...]\n\nmaybe let the site be responsible\njust like how the site owner is responsible of adding META tags and sitemap for search engines",
				"added": 1536872116
			}
		],
		"1536758231_1JjeqG6SnAvwAMynd7suwbAVyY4gn5kdti": [
			{
				"comment_id": 209,
				"body": "> [futuretoast](#comment_2_1JxKVavsxaaEHX6ScAT7mwEYVxHRrmdXW1): A reddit thread about it was literally how I found out about zeronet. It's also why I'm using zeronet now.\n\nwelcome to zeronet\nhope you enjoy your stay",
				"added": 1536848525
			}
		],
		"1536913855_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 211,
				"body": "i think a decentralized chapta wont be possible\na distributed delegated trust chapta might be possible but not ideal\ni personally favor WOT(web of trust[ed friends])\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1531350181_14MRwDejvCNbwyjc29fLvRGL7JVjnafjMy#comment_175_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K\nwhere anyone's vote is essentially meaningless unless i assign a trust value to said user\n(site admins can ask users to assign infinite trust to them only on their site,\nthus moderation without censorship as user must opt in)",
				"added": 1536932626
			},
			{
				"comment_id": 212,
				"body": "a global rank should never be used\nas i could make bots that trust me\nno one would trust the bots since they dont interact with people\nso they are as good as not existing\nbut when you factor in how many people trust me via a ranking, this is where bots can break the balance\n\nand for privacy sake, some trust may be hidden to myself\nsay i trust nofish publicly but trust XYZ privately\ndownside is private trust cannot be iterated by others\nsay bob trust me, so he sees i trust nofish so he will have partial trust of nofish, but not XYZ since bob cant see that connection",
				"added": 1536933539
			},
			{
				"comment_id": 213,
				"body": "anyone want to kickstart development of it by making a plugin?\ni think theoretical concepts of how it could/should be done in zeronet would be as far as i could go\nmaybe making whoever making it having something to refer towards\n(i still havent written a piece about WOT/Propagation of Trust on [Unlimit Talk](http://127.0.0.1:43110/1HMLvnRWViMnuvZc5LK4Dm86sZNcSH1jdh/) i should tho since all of the dicussions are scatted around and i have to regather it everytime someone mentions it (afterthought: tho these should just been on my blog to begin with))",
				"added": 1536962730
			},
			{
				"comment_id": 214,
				"body": "again you are free to not participate\nif you like a stream of unfiltered content you are free to opt out and automatically trust everyone\njust like using blocklist, it only affects you, they still can post but you wont see them\n\ni believe in freedom too, they are free to spam all they want, my trusted list will flag them as spam in no time\n\nalso i believe treta3 i think we have different opinion on how things should work technically\neveryone starts at 0, untrusted user\nall untrusted users will never directly be censored,\nfor example on zerotalk, X thread upvotes (10[1000]) (trusted votes[total votes])\ntrust score is simply how much i trust your action to be in good faith,\n\ncontent should never be hidden based on trust score, unless it's deem necessarily to do so, it should always be off\nex: someone generating multiple ids spamming the whole forum, only then we are forced to engage nuclear option\nsince i have concern for leaving this on too long we might never be able to interact with new users and make them feel ignored\n\nalso i do not believe in directly using trust score to block \"bots\"\njust because i distrust you, that dosent mean you are gone from my world, it simply means \"i dont trust your votes\"\ntrusted users are suppose to \"moderate content\" for people who trusted them\nsay someone i trust flag a post as spam, which would send it to \"likely spam\" comment section\nbut i would also need multiple people i trust to flag it as spam for my client to actually trust that it's spam\n\ni personally dont think it's a good idea to directly target a user, for example flagging a user as spammer, which have repercussions that are quite severe and should be nuclear(like binary blocklist which is a user gone or not, no inbetween of only certain contents)",
				"added": 1537000485
			},
			{
				"comment_id": 215,
				"body": "> [toyata](#comment_23_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Any trust-based system can easily subverted by chinese spam farms ir even more easily a few dedicated people (think of three-letter-agency hired people) that manage a botfarm.See reddit how that wirks and basically no one now trusts no one else.Imo a waste of time to implement this into ZN, as it 99,9% will fail as soon as it gets bigger/more interesting to subvert.\n\nactually i retort\nthe only way to gain trust from me is to directly have me add a trust point onto you(say i choose to not allow WOT and propagation of trust because i am paranoid)\nnow the only way you can make me trust you is by interacting with me, which is way harder then spinning up bots\nyou might fool me once and get me to befriend you, but sending another few accounts and no doubt i will be suspicious\n**and in order to pull on a FULL NETWORK attack, assuming everyone have WOT off, you have to befriend all the users in the network**",
				"added": 1537000657
			},
			{
				"comment_id": 216,
				"body": "> [trenta3](#comment_26_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): @toyata Examples of trust-based systems that can be subverted? [...]\n\nTLDR: we have different ideas in mind, my idea of trust score is how much i trust said person shall they vouch a \"moderation actions\" and how likely shall i my client follow through it\n\nexample: i vouch a moderation action to hide a content as spam, people who trusted me + multiple people who vouch the same only then the client would actually hide the content",
				"added": 1537001475
			},
			{
				"comment_id": 223,
				"body": "> [stretchs243a](#comment_9_1BTTUVH4J6ehmGUeK7XgkJ7mShAEx4hVL): example: i vouch a moderation action to hide a content as spam, people who trusted me + multiple people who vouch the same only then the client would actually hide the content [...]\n\npossibility would be to calculate the total trustfactor of the reporters vs the person who is reported, if for example i trust the person who is flagged in some way they also gain a \"whitelist\" and also factor in trusted upvotes and trusted flag of not spam\n\npersonally problem by \"hide by default\" is that new users wont be noticed until someone trusted them, but they cant be seen thus cannot earn trust\n\nmy idea is these users will show up, but if someone flags their signing address as spam they would be hidden easily\n\nand shall an influx of spam flood the network, user can choose to only display post by people who have > X trust score (nuclear option and shall be deactivated once flood is over)\n\nthere's a problem if one person is highly trusted by multiple people, it can easily be abused which i see no way of mitigating other then untrusting them",
				"added": 1537602010
			}
		],
		"1536955600_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": [
			{
				"comment_id": 217,
				"body": "no but you could make one\ndont see much problem as the URL is always displayed below on hover\nbut maybe a CSS overlay that show url but inlined would be helpful",
				"added": 1537032436
			}
		],
		"1537239676_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 218,
				"body": ">Cryptocurrency\n\npersonally i dont agree on crypto but i am open to optional crypto support\nlike unless there's good reasoning to do so i dont think it's a good idea to jump on the crypto train needlessly\nplease dont tell me we will now need to pay in crypto just to download a site\ntho i dont mind if it's an optional support thing where you arent forced to use crypto but you could if you wish\n\n>Comments (Disqus-like)\n\ni see that as a bad idea since now everything relies on one site, which just creates more unnecessarily centralization which defeats the point \n\n>Proof-of-Work\n\ndepends on what you meant for, we do have plans for self signed ID using proof of work\nbut proof of work could have a plausible flaw that anyone with enough power can easily outvote users who dont have enough power\nsay 5 laptop users vs 1 gaming PC\nthe person with a gaming PC can easily outvote the other users\nand raising difficulty would just means you are making the laptop user's life even harder to vote\n\n>Verification on ZeroID\n\nconsider explaining what you meant by this, is it like verification to your real identity? that seems bad since we should be anonymous users\nas for verification against bots, i think that's a bad idea that wont be possible to even achive\n\n>Ads\n\ndepends, since most clearnet ads come with extreme tracking code i doubt that's what we will use \neven if we added one, we would just have another ad block wars which it would have been better if it wasnt added\n\nattempting to advertise zeronet tho i think that's a good idea since we can help with more users",
				"added": 1537447525
			}
		],
		"1537397559_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 219,
				"body": "> [trenta3](#comment_27_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX): My guess would be that to be premature optimization: most files on zeronet are user content (very distinct files) or very small (javascripts / css / html). The only thing that would be deduplicated are videos, which I guess not a lots of sites have in common...We'll wait to see the reports!\n\nto some point yes,\nbut for example if i am using say a css/js library would be nice if it was automatically cross-seeded so if someone has a copy already they dont need to redownload it\nwhile not the biggest improvement it would scale with the file size\nsay now i have a huge video that i want to seed to a few sites now i dont need to waste data/storage or waste other's storage, there is when it counts, when the file size is large\n\ni think i agree with styromaniac\nsomething like that could be nice, a file directory with files bigfile named in sha256.(ext) format\nsites owner/users could virtually map them however/where they wanted it to be but zeronet will resolve it back to bigfile directory\nsite modification of said file wont actually change it but creates a new sha file for the updated file\n\nmight be hard to delete/unlink a file, say if only 1 site needes that shared file but now say it's obsolete by begin updated, users still need a way to PRUNE unused files\n\ndraw back is this means sites need to opt in to reap the benefit of it\nbut again not everything need to be cross-seeded\nthings like your zerome/zerotalk post would probably be unique and probably only would ever be used there",
				"added": 1537448922
			},
			{
				"comment_id": 220,
				"body": "> [swastika](#comment_6_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): Well not necessarily, if the above client-side feature is implemented then it's possible for the client to fetch a file based on its hash. Though it has to fetch the file by its varying name and site, which is sub-optimal.\n\nwhile this was referring to if we used a directory of known hashes as suggested by styromaniac's suggestions\nbut client could forcefully use it by just mapping a file to a hashed file in one location, think of a shortcut link\n\n> [swastika](#comment_6_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): Deduplication will make that harder. Yes.\n\npersonally i dont think harder to delete will be the problem, the problem is when you accumulated too many unused large files which now have the side effect of taking up file size\nWHAT IF: zeronet also record the site, and where it was referred to, and periodically checks if these places that referred to that file still refer to it, say maybe after 7 days and the file still didnt get anything referring to it, client could choose to delete it under the clause that sites no longer needed it(user can star it to keep the file)\n\n> [swastika](#comment_6_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7): Stuff like a user's content.json and data.json do not need to (or can not) be de-duplicated/ cross-seeded\n\nyes these are ones that would be useless to be shared, but same for our data.json on zerotalk/zerome, there would be no use to share it(tho the images could use some cross seeding)",
				"added": 1537461080
			}
		],
		"1535809392_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW": [
			{
				"comment_id": 221,
				"body": "how do you start zeronet?\nstart it with  --multiuser_local",
				"added": 1537543236
			},
			{
				"comment_id": 222,
				"body": "> [garlic](#comment_12_13hSQgvTK6DKhaibEh2nRAposTN4wGQckW): That made the difference - thanks very much thunder33345 ! [...]\n\nit allows you to do things that were blocked for safety reasons, like setting file size etc\nsince you and only you are using it so there shouldnt be a problem doing that\nif you are forwarding it, please add PasswordUI to secure and ensure only you have access to it",
				"added": 1537557829
			}
		],
		"1537635371_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 224,
				"body": ">[gitcenter](#comment_362_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Well, @kopykate won't like it.\ni dont really see why not if your work has been left alone and someone come to improve upon it\ni personally dont recommend naming the new revamped copy the same name because that creates confusion",
				"added": 1537784417
			}
		],
		"1537743699_1EDX41ER6ThoA7kvhbHrMzo3HNXDyNT47T": [
			{
				"comment_id": 225,
				"body": "no size limit is the best solution\nthe cost to creating a new identity is 0 + thinking of a name\nonce an identity is created one can simply move all current content to the new user account, archiving all it's content and resetting your limit\n\nTLDR: limits are at nothing to begin with, at best just some technical hurdles\n\ndeleting post is possible but it would meant nuking all previous valuable discussion who could have helped others in future",
				"added": 1537784932
			},
			{
				"comment_id": 261,
				"body": "> [killwhitey](#comment_10_1HysVuWJvNSTxVj6Y5vMGiBZ7pJTBtrwow): The problem is the reason for the limits still remains. Some people (mobile phone users, for example) have likedli disk space.\n\nand? what's stopping me from just making a second or third or fourth account? nothing!\nokay yes the disk space problem personally, i will admit it's true\nBUT limiting my storage size will do no good to fix it\nwe need other ways to fix it like maybe compression, text is probably easily compressible",
				"added": 1539030675
			}
		],
		"1537822393_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": [
			{
				"comment_id": 226,
				"body": "i agreed it should be replaced with the chat,\nOR EVEN with the latest peer applications instant chat no delay demo\nwe have come from centralized reliant on an update bot,\nto dynamic content of saving messages into files,\nnow we have peer applications and without a need to save every message into file but just flushing them into file at an interval, but using peer application to establish REALTIME chat no 5 second delay",
				"added": 1537824990
			},
			{
				"comment_id": 227,
				"body": "> [nekololi](#comment_258_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): that sounds like a good idea, just redirect it to ThunderWave\n\nproblem in that is we also need an EXAMPLE/DEMO of our latest tech\nnothing wrong in a fully fleshed out site\nbut there should be a barebone chat site with peer applications + periodic flushing of config\nso future users can learn from the basic and turn them into what they wanted without understanding unnecessary stuff",
				"added": 1537867458
			}
		],
		"1537746280_15hL2gR4oCSgKBbndn3MxY8Hc5xoy1vqCe": [
			{
				"comment_id": 228,
				"body": "it's has no centralized server to issue ID, it still needs a cluster of TRUSTED control nodes to function without single point of failure, i am also quite confident it have the problem of needing single point of trust failure, where it highly dependant on trust of all control nodes\n\nBUT this is deemed necessary evil to keep the username fully unique,\nas in a system with all nodes having equal power to issue themself ID, it will be impossible to keep the username unique\n\ni think it's a step for the better\n\nZeroID just needs the clearnet+bitmessage+signing service to be stopped and the system will no longer work\nKxoID would need multiple(all) control nodes to be disabled to successfully stop the system\ni can see self POW signed as the future of all nodes having equal power, and using bitcoin address as username(thus impossible to collide)\n\noriginally i used words like centralized, decentralized and distributed but the definition seems to be nowhere and everyone interprets it differently thus i refrained from using them to make my point clearer",
				"added": 1537870832
			},
			{
				"comment_id": 229,
				"body": "i think we should also have something for POW\nlike thunder#pow10@kxo\nso sites can only accept people with POW over 5 example which could be a nice POC is that more POW user gets more space to begin with",
				"added": 1537873751
			}
		],
		"1537880768_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 230,
				"body": "> [mrbetter](#comment_4_1PBLyfpS2m3DFJpz4p4An3ko99oF5BQrgt): Hi, ZeroLSTN in mobile form with a temp username here. [...]\n\nyes i think that could work but the idea that it would be more then just an iframe\nmentioning zerolstn since it is the only thing i could think of to get the MOST benefit from this, next to zerome and zeromail\n\nlike for example removing the 0 button, native playback to make it more streamlined, native notifications\nmostly for QOL sake\ni have a discussion with [others](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1SunAWK2VUT9GQK32MpwRfFPVgcBSJN9a/1NrB343LFx3xXAkJUxDvHHxD3RgsQX3vHN/1537871868)(dicussion in chinese) and they seem to would like native apps,\nMAYBE we can have another independent developer that just focus on porting the app while following the site's dev protocol standards\n\nsince zeronet is at it's core is data storage following a pattern so it's mutually understandable\nheck if anyone want they are free to port zerotalk+zerome into CLI and no one could ever stop them, if their posted content follows the standard other web users would be able to understand them and cant even tell the differences\nwhen user used the command, load \"GUI\", phrase data from data folder, render the text and now you have a GUI in CLI!!\n\nit wouldnt be hard or mindblowing feature it would just means recoding it for different environment",
				"added": 1537882033
			},
			{
				"comment_id": 231,
				"body": "for notifications, there's also webseite API interact with notification\nmaybe single mode can perform extra optimization to only load necessary stuff and a more mobile/pc/tablet friendly depending on UI view scale if site detects it's in single view mode\n\nwould be cool for zerohello to do this but hopefully NOT blasting me with everything, aka more filter options, since somethings are nice to know it's happening, somethings i actually want to be notified",
				"added": 1537883185
			}
		],
		"1537880954_1PBLyfpS2m3DFJpz4p4An3ko99oF5BQrgt": [
			{
				"comment_id": 232,
				"body": "we used to hang out on a site called `IRC 2` good fun times\nbut that one seems to become stale\nand the no saving message to disk means you have to keep the tab on all times to know of anything\n\nwonder if ZiM is ready to be actually used??",
				"added": 1537894591
			},
			{
				"comment_id": 233,
				"body": "> [gitcenter](#comment_365_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): lol. No. But I'm going to make a mailing service for ZeroNet soon. It'll support multi-user messages.\n\nstill would prefer chat orientated\nalso what about the background application pluigin would it be capable of background notification of new mails",
				"added": 1537903065
			}
		],
		"1537887891_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 234,
				"body": "as far as i know it's somewhat like loadbalancer which sends you to one of the listed proxies\nbut ideally you would run your OWN proxy",
				"added": 1537907793
			}
		],
		"1537956104_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 235,
				"body": "there's zeroblog http://127.0.0.1:43110/Blog.ZeroNetwork.bit/ which you can clone from",
				"added": 1537961748
			},
			{
				"comment_id": 238,
				"body": "ahhh lets just say we arent there yet...\nthere's no modular system, most \"plugin\" require editing the core code\nwell if you want and are capable of you are free to make one that could support plugin",
				"added": 1538044330
			},
			{
				"comment_id": 256,
				"body": "as far as i know only JS works here\npython is only for the zeronet client and it's plugins itself, web browsers cant execute python code\n\nyou see, all content is serve by yourself on your own disk drive,\nyou fetch that and save into your disk when you visit a site\nthe rendering language is done by HTML and CSS\nthe logical language is done by javascript\nthere's no backend language here everything is done on frontend\n\nif your code is built on the assumption that there's a client and server,\nyou might be better luck trying to make something new",
				"added": 1538576883
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 236,
				"body": "> [magi](#comment_2_19hzKUFh9Lw96MhtkQERckgrmzEFrmnoC6): I'm really impressed how well this all works\n\nwelcome!",
				"added": 1537980333
			},
			{
				"comment_id": 272,
				"body": "welcome everyone!",
				"added": 1539975151
			},
			{
				"comment_id": 284,
				"body": "> [eross](#comment_2_1K9QstKfVJKmhVvSttCCCKcdRzN569drke): someone check this out http://127.0.0.1:43110/1Dyir3uN2Mk81dKc8yeg5hmSe1oHWbvwgk/\n\ncant access",
				"added": 1540230669
			},
			{
				"comment_id": 285,
				"body": "> [eross](#comment_3_1K9QstKfVJKmhVvSttCCCKcdRzN569drke): someone check this outhttp://127.0.0.1:43110/1Dyir3uN2Mk81dKc8yeg5hmSe1oHWbvwgk/\n\nis your port open??\ncannot access it",
				"added": 1540292361
			}
		],
		"1538004633_1Ny31DdkRx1wcA8bv2Uiybbex8YCXcYQTN": [
			{
				"comment_id": 237,
				"body": "consider this: zerome has no content it's simply a site which acts as a frontend client\nyou need to add merger hubs to actually get the content which is ran by 3rd party\nsay if there's a hub which promotes illegal activity you can simply opt out of it by deleting it which you can simply claim you do not know existence of such hub\nzerome has no responsibility in which hubs/content you see, just like VLC's devs are not responsible if you played an illegal pirated video\nbut certain sites didnt implemented mergers\nlike notably milchan which have questionable materials and if you have legal concerns i advise you not to visit sites like these",
				"added": 1538044227
			},
			{
				"comment_id": 239,
				"body": "> [djinn](#comment_8_1Ny31DdkRx1wcA8bv2Uiybbex8YCXcYQTN): Thank you for the detailed explanation. This is extremely helpful and I really appreciate it. In regards to stopping users from hosting illegal content I actually have an idea about that. Maybe you could give some input on my idea. [...]\n\nwhile it could be possible it's draw backs should be noted:\n\nmost obvious one begin you have to be online and can reach peers with relevant parts\nsecondly everytime you load the site it would also waste someone's+your's bandwidth(which i rather have a way to stop seeding a site(if i dont contribute i only waste it once) rather then having to delete and download it everytime(which wastes everyone's resource))\nbut we assume  you care more of the illegal data not begin on your drive rather than you possibly serving illegal content, it might be simpler to run zeronet on a veracrypt volume\n\nbut this can be a system with option if any peers dont want the \"protection\" they can request and save all \"partitions\" on drive",
				"added": 1538061928
			},
			{
				"comment_id": 241,
				"body": "maybe there should just be a control to not seed certain/specific files, and control to delete said files and never ever download them again, blocking base on hash of the file\nif you just bothered about seeding illegal content, a no seed certain files you deem could be illegal should help\nif you are bothered about downloading + possessing illegal content a delete and block individual file should be good enough",
				"added": 1538062827
			},
			{
				"comment_id": 242,
				"body": "i think making non optional file can be forcefully rejected by the client would be nice, of course you will need to know what you are doing to reject files without breaking the whole damm site\nprompting before download could be possible, but i would just download the full thing and block the rest when i need/found anything relevant since you dont really know what's inside of it anyhow",
				"added": 1538063759
			}
		],
		"1538061780_1Ny31DdkRx1wcA8bv2Uiybbex8YCXcYQTN": [
			{
				"comment_id": 240,
				"body": "yes echobot was and has been broken for ages\ngoing to send you a mail for test if you wish(edit:done)",
				"added": 1538061977
			}
		],
		"1538081577_1NgGmtujKtMKxc3VprPMUneYYjgJqJFbhX": [
			{
				"comment_id": 243,
				"body": "If anyone dare to say otherwise they are either trolls, liers or intentionally spreading misinformation!\nWe need to get the truth out!!",
				"added": 1538085281
			}
		],
		"1538135386_18dhkzcDYd4zCD8Vtb47ULAciCuoyUFzet": [
			{
				"comment_id": 244,
				"body": "you can request read write perm to zeromail\nand use zeromail-beta to write to user's zeromail send\nall data is still written into zeromail for users over there\nfor users that use another mail you will have to write to that platform",
				"added": 1538140623
			},
			{
				"comment_id": 245,
				"body": "> [shiruka](#comment_2_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW): Like, go to Nofish and ask him? Plus i'm not really a developer in python, I know my HTML and web base stuff but I'm still studying.\n\nnonononononono\nyou see there's zerome, when you using zero me your data isnt actually stored in zerome but a hub which is in a merger zone\nzerome asks the user for permission to read from zerome merger zone, which would allow zerome to read the data file and create a stream of post\nzerome asks for the user write permission which in turn allows the user to write post to their hub which will be perceived as a pot\n\nTLDR: your ZeroMail-Beta will need to ask user permission to read+write from/to zeromail's site if they want to read/send mails from/to zeromail users",
				"added": 1538145293
			},
			{
				"comment_id": 246,
				"body": "you will be interfacing it with js code that's run on the client's browsers, python is only for zeronet itself and it's plugin\nas for how you are better with someone else then me, i know zeronet but not coding API wise",
				"added": 1538162319
			}
		],
		"1535211568_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 247,
				"body": "https://medium.com/@VitalikButerin/the-meaning-of-decentralization-a0c92b76a274\nalso worth noting the word decentralized and distributed is a mess, it's as good as what we think/want it to be\nit can be confusing when different people have not the same idea of a said word\n\n>Now, consider the two answers on Quora for “what is the difference between distributed and decentralized”. The first essentially parrots the above diagram, whereas the second makes the entirely different claim that “distributed means not all the processing of the transactions is done in the same place”, whereas “decentralized means that not one single entity has control over all the processing”. Meanwhile, the top answer on the Ethereum stack exchange gives a very similar diagram, but with the words “decentralized” and “distributed” switched places! Clearly, a clarification is in order.\n\nit is as if we all feed ourself what we want to believe in\n\n>**Three types of Decentralization**\n>When people talk about software decentralization, there are actually three separate axes of centralization/decentralization that they may be talking about. While in some cases it is difficult to see how you can have one without the other, in general they are quite independent of each other. The axes are as follows:\n\n>- Architectural (de)centralization — how many physical computers is a system made up of? How many of those computers can it tolerate breaking down at any single time?\n>- Political (de)centralization — how many individuals or organizations ultimately control the computers that the system is made up of?\n>- Logical (de)centralization— does the interface and data structures that the system presents and maintains look more like a single monolithic object, or an amorphous swarm? One simple heuristic is: if you cut the system in half, including both providers and users, will both halves continue to fully operate as independent units?",
				"added": 1538162883
			},
			{
				"comment_id": 252,
				"body": "your point is valid, but again like they say anyone is free to clone it,\nsay suddenly nofish start banning people here(not like he will)\nsomeone can clone it and move on\n\nwhat i think the problem is, we do not have a auto archival system that archive deleted user data,\nsay nofish banned people which means the people's files are deleted,\nwe can clone the site and unban but we will have to live with missing files\n\nalso we lack a way for a site to be provably ownerless\nIF i say i threw away my private key, only i know that and i cannot/has no way to proof it to my users\nor in some way where i only capable of controlling the frontend and the backend user data cannot be modified/user banned",
				"added": 1538387311
			},
			{
				"comment_id": 253,
				"body": "in some sense most ideas have been mentioned before",
				"added": 1538388339
			}
		],
		"1538246886_1MHdmQEW2HS6sZNgfi3VmtegHc6fUEyVkW": [
			{
				"comment_id": 248,
				"body": "well you would still need to somehow get the user to open the \"virus\"\nzeronet wont open it or even touch it\nmost virus need some user interaction to invoke it first",
				"added": 1538247991
			},
			{
				"comment_id": 249,
				"body": "as long as you dont execute these files you are fine",
				"added": 1538248970
			}
		],
		"1538188815_1NcVwrBpf91ownXuSgYnHBZCWjoiNjw9FP": [
			{
				"comment_id": 250,
				"body": "no one said darknet has to be only used by 1337 hackers doing illegal things",
				"added": 1538331501
			},
			{
				"comment_id": 257,
				"body": "someone could just make a group topic here",
				"added": 1538647554
			},
			{
				"comment_id": 258,
				"body": "like this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:10_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj/Chinese+language+topics\nand this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1509065748_1PFWGebEqZssXXnM9u2gk7yJpXUoMPQG8D/ZeroNet+Dev+News+Bot\nand this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1538339080_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di/Important+Information+about+Security+Update+Rev3616\nand this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1_1KbV1e1u6P6AsY8XNBydgtbtN8iSB5WMyG/P2P+news+flow\nand this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:1538394198_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum/A+big+topic+demo\nand this:\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topics:9_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h/ZeroNet+Dev+Board\n\nbasically an subforum/folder for threads\nbut regular users might still not appreciate it and we might be better off cloning but that will always spell the end of any spinoff forums ",
				"added": 1538686431
			},
			{
				"comment_id": 259,
				"body": "well anyone can do it, one problem tho you will have to edit the data.json to create it\nthere's no other ways around it\nyou can add\n```\n\t{\n\t\t\"topic_id\": <incrementing num>,\n\t\t\"title\": \"title of it\",\n\t\t\"body\": \"body description\",\n\t\t\"added\": <unix time>,\n\t\t\"type\": \"group\"\n\t}\n```\ninside of topic\ni remember you can sign+publish your own content.json via sidebar if you enter the exact path to it\n\nan easy way to go is to make a new post\ngo into your json file, and add \"type\":\"group\"",
				"added": 1538688914
			},
			{
				"comment_id": 316,
				"body": "to start one can simply clone this forum and restyle it\nand you can work from there",
				"added": 1541780629
			}
		],
		"1538339081_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 251,
				"body": "> [zeronetix](#comment_10_1PpvHgysHyZk6AEaG38SzH2FXgcr74vJt5): So is there latest update of ZeroNet in docker image nofish/zeronet already?\n\nyes https://hub.docker.com/r/nofish/zeronet/\nan hour ago",
				"added": 1538340817
			}
		],
		"1538407753_1G77baH5aGCXXRrUkyWQwmeCJppzC56wc2": [
			{
				"comment_id": 254,
				"body": "ew clearnet what a turnoff!",
				"added": 1538417064
			}
		],
		"8_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 255,
				"body": "> [uvwpad2](#comment_1_1QEjHxBRTFvCW5LFeJBD9jeafYByTGfgyX): 怎么建立像zerotalk一样的论坛啊\n\n在zero hello里面\n选择那个上个点在zero talk旁边\n那后选择\"Clone\"",
				"added": 1538479812
			}
		],
		"1538923063_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 260,
				"body": "no the only thing you can do is choose to ban them which will delete all their topics and contents they have posted",
				"added": 1538925879
			}
		],
		"1539068214_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 262,
				"body": "I think there's 2(or even more) concepts here\nsome people envision it to block+delete anyone who have lower trust score\nsome people envision it to block vote manipulation(but not spam) by only showing votes of people they trusted\n\nYou can see my take of it [here on my blog](http://127.0.0.1:43110/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:15:Zeronet+Web+Of+Trust+Concept)\nIt's kinda long and still in progress, but since you mentioned it, might as well share a preview here\nYou can safely stop when you read reach the \"Abstract concept\" part, you dont really want to read the rest, it's like unnecessarily long\n>Under this system, we assume that all users are bots, all votes are by bots, unless we explicitly verify that \"that user isn't bot\" they will always assumed to be a bot, verified votes are \"prioritized\" to show beside total votes, and moderation actions are only performed if majority of trusted user agreed so...\n",
				"added": 1539077908
			}
		],
		"1539131791_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u": [
			{
				"comment_id": 263,
				"body": "i get a \"Torrent plugin not installed\" on the site even tho i am pretty sure i did",
				"added": 1539195382
			},
			{
				"comment_id": 264,
				"body": "> [lola](#comment_91_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): What happen if you do f5 ?In the plugins/Torrent folder have you tried to run test.py ? Just to make sure the built lib is compatible with your system.\n\ndue to lack of the python binaries(still dont know where zeronet hides that) which i failed to find i cant test that\nbut i do found this\n`[02:22:03] PluginManager Plugin Plugin-Torrent load error: ImportError: DLL load failed: The specified module could not be found. in PluginManager.py line 50 > builtins.py line 93 > __init__.py line 1 > builtins.py line 93 > TorrentPlugin.py line 2 > builtins.py line 93`\non the console when starting up\nalso my plugin folder's name shouldnt affect it's functionality right?",
				"added": 1539195860
			},
			{
				"comment_id": 265,
				"body": "> [lola](#comment_92_1KuwwnkAtVrfnyhv8pyGRxLqzNZbEkJt2u): Ok cool. You need to rename your folder 'Plugin-Torrent' to 'Torrent' and you should be able to find it. The name of the folder define the name of the plugin. I know it is not the best.\n\nyep that solves it oh well that sucks you cant name it something else\nwas under the assumption that __init__py will load it",
				"added": 1539200483
			},
			{
				"comment_id": 266,
				"body": "the dependency thing is solved by itself when i change the name of the folder\ni am assuming it's looking for \"Plugin-torrent\" since it loads base on folder name rather then manifest file",
				"added": 1539206337
			}
		],
		"1539548272_1BDapygZHNG8GxEuSsEpK9Xipm9mFfW1F2": [
			{
				"comment_id": 267,
				"body": "what is that even",
				"added": 1539551890
			}
		],
		"1539921274_161j9Vh5TpPeic4bzZYMd5Spgnf4qbiFFZ": [
			{
				"comment_id": 268,
				"body": "if you need server side validation, that will be impossible because zeronet does not have a central server  as it's architecture\nthings like payment or POS or anything that needs a server to validate certain thing, it wont be possible\neven if possible it will need a central server defeating the point of zeronet\n\ntho if you want us to help you should also link to the repo of it in clearnet\nif it was a private thing you are better off hiring a developer",
				"added": 1539940393
			},
			{
				"comment_id": 269,
				"body": "> [d14na](#comment_76_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4): I would also not rule-out a hybrid approach that could utilize the scalability and fault-tolerance of the Zeronet while maintaining a private API to protect certain features. Shouldn't have to be all or nothing.\n\nHybrid of CLI application for authorised nodes to respond to proprietary logic would be cool.\nBut it's almost unheard of to have the private part run on something saner like a linux daemon, rather then someone's home pc's browser.(correct me if i am wrong but i am pretty sure this is where kxo id signing is done on)\nLike there could be VPS that will check for crypto deposit, and release the say purchased files as the most simple way. The VPS(s) would enjoy anonymity of tor but that \"payment\" feature, it still would need said vps to be online, to be able to dispense purchases, but multiple VPS can gain redundancy to it.\n\nPart of me say this is kind of walking backward to the clearnet centralized style of functioning,\nbut part of me says this is the only way it could work.",
				"added": 1539967201
			},
			{
				"comment_id": 270,
				"body": "> [styromaniac](#comment_193_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Punctuation, please. Nobody likes reading run-on sentences, even if you have something good to say.\n\nCorrected it. Thanks for the reminder, i always bad at punctuation, and have a habit of treating as if line-ending are the only possible way to punctuate.(totally should do something about that)",
				"added": 1539973036
			}
		],
		"1539971733_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 271,
				"body": "you will need to edit the source code and make the prompt actually support kaffie id too i think...",
				"added": 1539973107
			},
			{
				"comment_id": 273,
				"body": "go to the folder of the site,\ngo into js and open all.js in some sane editor,\nsearch for \"zeroid\"\nyou will find example\n```\nPage.cmd(\"certSelect\", [[\"zeroid.bit\"]]);\n```\nchange it into\n```\nPage.cmd(\"certSelect\", [[\"zeroid.bit\"],[\"second.provider\"],[\"third.provider\"]]);\n```\nthere's like 3 instances of it i think which had to be replaced",
				"added": 1540064360
			}
		],
		"1540055841_1PqrpogAwPjPf9T7bJjWWAjzTaRQcXLYCR": [
			{
				"comment_id": 274,
				"body": "you would need a marketable skill(s), example: coding, graphics\nand just offer your skills/products here, i doubt the fact that we have less users then clearnet will help with that.\n\nand if you want to make money by actually using zeronet(not making money on zeronet),\nthings wont be easy, there's few ways you can get a stream of income but generally no one likes it here(understandably since your visitors also host your site).\nusing things like coin hive, which would compromise user's security by accessing clearnet so ideally avoided..\nusing ads, which also would compromise user's security by needing clearnet access, and would probably load more tracking scripts, that no one wants...\n\ni honestly dont know other then:\nmaking a good site and ask people to donate, if they want(begin honest wont be reliable)\ni dont see any other ways around this \"problem\"/question",
				"added": 1540064911
			}
		],
		"1540067038_19SBkpjU51KHuK4br2GkqUnh6BwBRJDeLH": [
			{
				"comment_id": 277,
				"body": "echo bot is long dead\nsomeone need to remove all traces of it",
				"added": 1540067636
			},
			{
				"comment_id": 278,
				"body": "why are people even mentioning it then shrugs",
				"added": 1540109052
			}
		],
		"1540051200_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 279,
				"body": "basically a clearweb site, that allows people to visit zeronet without downloading zeronet",
				"added": 1540129219
			},
			{
				"comment_id": 280,
				"body": "it's fixed, thus if you update to the latest version of zeronet, you are fine",
				"added": 1540154460
			}
		],
		"1540193102_1K9QstKfVJKmhVvSttCCCKcdRzN569drke": [
			{
				"comment_id": 281,
				"body": "nope only js is possible here,\nUNLESS you want your users to execute your app outside of web browser, but then it isnt a \"website\" anymore",
				"added": 1540199898
			}
		],
		"1540200032_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 282,
				"body": "> [nofish](#comment_1206_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): It's not a per-site, but a global setting, so you can't do that. But you can run 2 different clients on different port. Or enable multiuser plugin and use multiple browsers\n\ncan per site be consider to be implemented\ni think sites relying on the zerohello theme is a bad for flexibility sake, due to things like this...\nthey should just be as flexible as millchan, allow user to overwrite it if they wish in the site's settings",
				"added": 1540210061
			},
			{
				"comment_id": 283,
				"body": "> [nofish](#comment_1207_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): I don't want to complicate this. The sites can implement their own skin changing method if they want, nothing is forced.\n\nfair enough, i have a bad feeling about this:\nmost sites will choose to cheap out and just use the main theme setting without adding some way to overwrite it on persite basis\noh well i guess we will see how this goes..",
				"added": 1540210491
			}
		],
		"1540383456_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg": [
			{
				"comment_id": 286,
				"body": "Personally, yes a fractured community possible, and is the worst possible case where: everyone start their own clone because, everyone distrust everyone.\n\nThe site itself is censorship proof, the users of these sites aren't as censorship proof as one like to think it is..\n\nHubs works, but hubs also meant to entrust a group of people onto one sole runner, other than to trust the runner wont abuse their power, there's no other way around it otherwise\n\nMy personal idea would be something like as site owner:\ni can do something that's equivalent of forgetting my private key but, in a publicly provable and trustless method,\nsomething like revoking my own ability to use this private key to edit the said site.\n\nIdeally it would only be used in CROS hubs since there's nothing other then userdata that resides there, since it will be impossible to update things like GUI if the front end was also there",
				"added": 1540388123
			},
			{
				"comment_id": 288,
				"body": "> [beenotung](#comment_31_1DLBhCccN3MbM5YmzNS2UfBzDkEZkGZtVg): Thanks for you two reply so quickly. [...]\n\ni am assuming you are referring to my idea part...\nno, my idea is that: i, as the owner of my site, can proof to the world that i have no ability to censor anyone since my private key no longer functions\nnot just a \"i deleted my private key for that site, you will have to trust me on it\"\nin the most simplest term: a way to proof i can no longer edit the site(thus i cant censor anyone), without need of trust\n\nregarding merger sites, it's basically a separation of user data and front end UI,\nexample: zerotalk's UI and data resides on the same place\nzerome is only a UI, the hub/merger sites are where the user's data are actually located",
				"added": 1540398438
			},
			{
				"comment_id": 289,
				"body": "> [nekololi](#comment_284_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): this is the censorship model that zeronet operates under. if you make your own zite, you can say or do whatever you want on it, and you can publish it and have it be distributed and accessible, and individuals or state actors will have a very difficult time stopping you.\n\nagreed this is something i wish we can somehow resolve, before we get popular or anything..\nany idea on how it can be \"fixed\"?\nhubs kinda \"fixes\" it, but everyone is only safe if they ran their own hub..\nwhich is just a loopback on the same problem.",
				"added": 1540402553
			},
			{
				"comment_id": 291,
				"body": "> [nekololi](#comment_285_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i don't think there's a solution for ZN that doesn't involve taking away control of a site from the site's owner. hubs aren't a solution, because a hub is just a site which has an owner that controls what can be published on their site. [...]\n\nagreed on the html part\nthe idea of removing control is an OPTIONAL action the site owner can do, it's not \"enabled\" by default nor forced onto owners.\ni am thinking of a system which the site owner will lose control of the WHOLE site, so vectors like HTML and JS are not possible.\nthink of this, there's zerome hub, the hub owner also proven he has no control over it.\nthe frontend is a fork, which you occasionally verify code and update from upstream, so to hide things over js wont be easy\n\nand yes this means extra complications but i dont see better ways",
				"added": 1540411080
			}
		],
		"1540351048_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 287,
				"body": "also the right click to correct seems to still be bugged",
				"added": 1540390267
			},
			{
				"comment_id": 290,
				"body": "> [styromaniac](#comment_231_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've not seen an explanation of where this is used yet. You're the first to mention it where I've read anything about it. Please explain this to me. [...]\n\nokay sorry for not begin in depth\nthis is on vivaldi(chromium fork)\nmake a typo of any sort, wait for the browser to red outline it\nright click and select the correct word\nsee how that dosent get changed\n\ni am not sure if it's zeronet or vivaldi's faults, corrections works on clearnet sites tho",
				"added": 1540410602
			}
		],
		"1541031054_1ByuWDrDpJKEB5WbR7Dw4CUT1pw5DXKxgU": [
			{
				"comment_id": 292,
				"body": "can anyone provide me with what's \"BOMB! Get Games\"?\nthis is the second self censorship as far as i know: first one is some jessica nigri gallery???\nnow this..\n\nalso please note about \"censorship free*\"\nit's only free of censorship TOWARDS site owner, user are NOT protected, and it's not free of owner's self censorship\n\nmaybe consider putting archiving system on priority\ni also dont get why I2P is related to the news in any slightest way",
				"added": 1541057154
			},
			{
				"comment_id": 293,
				"body": "> [ornataweaver](#comment_37_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Can we make the sites act like git does? For those who choose to keep all versions of them via git.\n\ni think this needs another plugin that records the site changes into git\ni am pretty sure this has been talked about, now i wonder how many incidents before this is developed\ni am thinking of something like that PLUS a way for people to share/request older copies automatically if peers choose to make their archive public",
				"added": 1541084972
			},
			{
				"comment_id": 294,
				"body": "> [ornataweaver](#comment_41_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4): Thanks @eightyfour.Does anyone has \"Get Games\" Data?\n\ni have 0 clue that thing even existed till this day...",
				"added": 1541105689
			},
			{
				"comment_id": 295,
				"body": "> [styromaniac](#comment_266_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I never used it nor read deeply into it. The very question you're asking was a discussion in the ZeroNet chat room on Riot.im.\n\nit's #0net:matrix.org\nalso i dont know what you meant in the chain like structure, is it like a fork in a blockchain?? maybe it's too late here Zzz",
				"added": 1541110764
			}
		],
		"1541169956_17WCGhYYYbjznWvdnjAoGS74aK9AtjfdU7": [
			{
				"comment_id": 296,
				"body": ">you should join this\n>also you need to be invited to join\n\nreminds me of the hype wave of `get owned`(twitter game) created by employing a get invited to play system and people even sell these for IRL\n\ni think i have to agree on distributed decentralized blockchain begin better overall and all round better",
				"added": 1541180443
			},
			{
				"comment_id": 297,
				"body": "> [styromaniac](#comment_274_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://initiativeq.com/invite/BZx-RDWn7\n\nverify me, also my link\nhttps://initiativeq.com/invite/HE-b6mq3X (remind me if you used it, i need to verify it here)\n\nhonestly i dont know i have mixed feelings this has some sort of callback to the typical \"free XYZ game currency/itunes card/google play cards\" scam\nwhere you first need to invite X users, and after inviting X users you will only be prompted a \"anti bot survey\" the classical bait and switch\ni am not calling FUD here but, stay safe everyone who choose to give it a shot..",
				"added": 1541189063
			},
			{
				"comment_id": 300,
				"body": "> [emiliano](#comment_1_17WCGhYYYbjznWvdnjAoGS74aK9AtjfdU7): It looks like a scam to me too, but they just ask for a name, an email address and to invite friends, so I'm wondering how it works\n\nmost just want to spread, like when we(users) find out it's a scam\nit's too late to call it back and it already spread far and wide\nconventional scam in the end promises say something like paypal credit, but need you to do a phone survey first\ntheir hope probably is because of the spread someone is bound to fall in it",
				"added": 1541247196
			},
			{
				"comment_id": 303,
				"body": "> [akito](#comment_457_1F8omDpXyPsBfd9CBJ91o4Wv1AA2KxqMEY): If it's that harmless, it's worth the risk.\n\nseems so the most harm it can do is gather emails and names",
				"added": 1541275802
			},
			{
				"comment_id": 305,
				"body": "i advise yall just look at the buzz regarding this again\ni guess it's more or less scam",
				"added": 1541510492
			}
		],
		"1541198461_1Kf2cdzcgFuSA2o5X4t9tFMjT4KYKzN7YP": [
			{
				"comment_id": 298,
				"body": "honestly if they want to leave or participate in multiple networks i dont see why\nif we arent good enough to keep our users here, so be it\nthere's also substratum, havent look it but i have a gut feeling tells me it's basically zeronet but with crypto integrated\nnot very much a fan of slap everything with crypto of now days approach tho",
				"added": 1541230852
			},
			{
				"comment_id": 299,
				"body": "> [gitcenter](#comment_386_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): That was kinda a joke, but... yeah. I agree. But, we need feedback. We need to compare ZeroNet and other networks: what features we lack, what additional can we implement.\n\nhah agreed, foster a community that welcomes constructive criticism and feedback is critical to self improvement",
				"added": 1541239806
			},
			{
				"comment_id": 301,
				"body": "> [6561616](#comment_1_1E3EN7XTyQSGuUrQ1nLpKrryhiBLnYEWh9): substratum based on coinware using Rust [...]\n\ndont know but one thing i have to say is they seems to be very good at marketing it and creating hype/buzz\nanyhow i am still looking forward to if they will directly challenge us",
				"added": 1541247468
			}
		],
		"1541253539_1J3LZRHNNaGgZYmB65S4aknyYbM5ar2Bzb": [
			{
				"comment_id": 302,
				"body": "maybe you dont want to see someone post on one site but want to on another??\nlike a per site based mute??",
				"added": 1541256804
			}
		],
		"1541269115_1PKq2Vg46orbwHD1pW1hVeArcDskWJH3BM": [
			{
				"comment_id": 304,
				"body": "> [invalidaccess](#comment_4_1PKq2Vg46orbwHD1pW1hVeArcDskWJH3BM): @timmo ZeroWiki isn't very modern and straightforward. I will sketch a few design ideas the next hours and will post them here. Stay tuned :)\n\nagreed i think making up something dedicated will be easier in long run as how big the project is\nwe can have a site with different categories like idea RCF and RCF attempts one section\nanother for data for example",
				"added": 1541344916
			}
		],
		"1541368241_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K": [
			{
				"comment_id": 306,
				"body": "> [z3r](#comment_17_1DS1K15BYi2N36Kt5MhV2AJW7wu6sFNzdQ): I had tested the v1 onece  - couldnt conect to not eaven a single peer [...]\n\nyes the V1 is long dead\nthus explain why it loads forever with no \ncan you still not find one?\ntry like killing the client and restarting\nat the first start i can see threads cant read them too",
				"added": 1541584546
			}
		],
		"1541360464_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ": [
			{
				"comment_id": 307,
				"body": "> [lezsakdomi](#comment_6_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ): I think ZeroNet can collapse: There's no real motivation for users to seed. In Freenet, they should seed, or they won't get enough bandwidth.\n\nisnt it same thing can be said for bittorrent?\nit lends it's own fate in it's user and it still mostly survived till this day\nthere's 0 incentive to seed, only thing one would choose to seed is out of obligation to do so\nand people are still seeding regardless\nthough in your defense seeding as of now is \"forced\" upon user(which i dont believe in said philosophy(enforcing will onto users for the betterment of the group), i believe that if user want to seed, they will do it, if they dont they wont)\n\neven if one day we have seeding control i believe that there will still be people who choose to support zeronet by seeding it's sites\n\nof course we can have some sort of pay to visit sites thing, sure go ahead,\njust understand that i will always be here to undercut everyone with the price of 0$/kb, thus rendering the system useless and now paid peers are like peers who choose not to seed\nsee, what if i told you just by mere visiting a site it will cost you money\ni think the idea of paid to seed is flawed at an fundamental level as now resources arent free and open for everyone thus voilated the \"free for everyone\" principle\n\nthough, what do you think will be a valid incentive structure that dosent harm pennyless users or discriminate against mobile users with low bandwidth and data caps??",
				"added": 1541585328
			},
			{
				"comment_id": 312,
				"body": "> [lezsakdomi](#comment_7_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ): When ZeroNet reaches more people, I'm sure that we'll reach the not-so-enthaustic people, who doesn't give a fuck about other users and will buy softwares which disable seeding and/or delete sites immediately and so on. (For ex. sequential download at simple torrents.)\n\ni mean they already can do it, so that's why i believe they should be able to choose not to seed, deleting sites probably do more damage if they choose to revisit it frequently...\n\n> [lezsakdomi](#comment_7_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ): Hmm, the idea of paid to seed isn't so bad: Maybe we could redeem our seed deficit with money, so buying ratio from other seeders? This should be worked out!\n\nwhat about someone who has no money? how do they get started?\nyou can have something like everyone can get free money on first time but then that means a long rabbit hole on preventing people gaming it\nif i can \"lend\" ratios, i could just do a lend and never return back thing\n\nandd there will be people who offer to upload for free wont that undercut everyone else??\n\n> [lezsakdomi](#comment_7_154aXdhb7aoQmT62rxDp6HKte3V1jDQVdZ): I'm using ZeroNet just 3 days ago, and I think, I have a solution for mobile usage (BTW tried to run it using Termux, but the 2GB RAM on my Nexus 5X is barely enough): I simply run a server at home with continous internet access and huge storage, and I connect to it over an SSH tunnel. It's simple and clean, since the official ZeroNet client opens a webserver at http://localhost:43110\n\nlooks good for when people have a home PC but not ideal when they are on the go, tbh i think zeronet need more mobile support like people nowdays have these(not really see diablo immortal's crowd reaction/s)",
				"added": 1541605380
			}
		],
		"1541565435_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 308,
				"body": "i will not support this as i believe freedom of speech and expression for ALL even if it's rude or out right begin a dick they should be able to do so,\nbut i believe you should have the rights to have this \"filter\" on yourself, if you wish\nhere's the problem:\nzeronet sometimes make it hard to tell which peers actually \"produced\" the content or which peers is just \"propagating\" the content\n\nso example:\nblacklist IP sends `XYZ text` to you, your client blocks it before you can recieve anything\nnow the blacklist ip will also send to more than you, like maybe someone else who dont blacklist their IP lets call that \"random person\"\nnow the \"random person\" will also try to share the content by spreading it to everyone\nnow they sends it to you, and succeed because the \"random person\" isnt in the blacklisted IP range\n\nblacklist IP -> You = blocked\nblacklist IP -> random guy -> you = not blocked\n\nso i think unless you can convince and force the filter on everyone it wont be easy",
				"added": 1541585400
			},
			{
				"comment_id": 319,
				"body": "> [jaggedelectrons](#comment_2_16B6aFfFUjn2hchrBDuvSFgUymhbQMGJrS): I would second the ability for a member to mute someone else, in the sense that if I would mute monsterjazz, only I would no longer see their posts. Me muting someone else wouldn't affect anyone else's ability to see that member. Nobody gets censored, this just allows individuals to turn a deaf ear and is no different from select crowdmembers putting in headphones during a talk/seminar. The speaker is still talking, just certain people have chosen to tune them out in a way that doesn't affect others from listening.\n\nsurprise surprise it's already a thing!!!",
				"added": 1541933452
			}
		],
		"1540796902_148DXj745fSuMtCnbh3uJnb3Tm4ZbdabJY": [
			{
				"comment_id": 309,
				"body": "> [bourjoix](#comment_5_1KZFFk8e3mYd9dbbdaw4fZRgyRWHfvkX3e): ZeroNet is really powerfull indeed. But if you are just looking for freespeach, you should have a look at this site:https://mamot.fr/ (a twitter like based on Mastodon)\n\ndepends, the mastodon has land itself a bit of a doggy situation from what i heard\nif you make an instance with no rules, expect everyone to block your instance and now no one can communicate with you and you are cut off from the rest of the world\nand admins can easily kick you off their instance if they choose to do so",
				"added": 1541585572
			},
			{
				"comment_id": 310,
				"body": "> [sheendocks](#comment_7_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): I wondered why there were reams of rules of every instance I was looking at lol\n\n?????\nif you meant an instance without rules, it pretty much can only federate with ones that has the same no rules",
				"added": 1541604361
			}
		],
		"1541600740_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 311,
				"body": "I simply believe we should uphold everything and anything, without discriminate between types of content it is,\nOne has to ask self, is there any TRUE freedom if there's a list of things one cant do?\nCan we even call it \"freedom\" if certain materials are prohibited to be uploaded??\nWhy dont we just call it \"Freedom\\*\"(\\*only content where we support are allowed)",
				"added": 1541604647
			},
			{
				"comment_id": 313,
				"body": "> [sheendocks](#comment_10_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): I'm not talking about what is and isn't permissible, it doesn't matter because it's next to impossible to ban stuff on here. I'm more interested in what morals people follow to help them decide between right and wrong and why apparently there are people on here who aren't ashamed about upload such content regardless of what anyone else says. It's interesting some of the ethics things I've read from antiquity discuss those \"who have forgotten how to blush\" basically those who have no shame and aren't embarrassed about things they ought to be embarrassed about.\n\nif you really are interested, dont be an asshole and ask them \"normally\", some may be happy to give you their point of view\nwhich i doubt any of us can or will be able to do so better than they can\n\ni follow more of a \"remember behind the screen there's a human\"",
				"added": 1541605754
			},
			{
				"comment_id": 314,
				"body": "> [sheendocks](#comment_11_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU): Which part of what I just said make me an asshole? Where do you derive your morals from btw?\n\ni never say you are an asshole, i just say dont be that guy,\nlike i see most people will act hostile against anything they dont support, rather then try to be reasonable and understand the other side\nthat's why i said that\nalso if you ask me, probably personal philosophy",
				"added": 1541609376
			},
			{
				"comment_id": 315,
				"body": "> [eightyfour](#comment_17_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC): I still find it a hard pill to swallow, but it's the price to pay for free speech, and by extension truth, and I'm willing to pay that price. Take liveleaks, it's a very important sort of service for exposing horrible violence and accidents that would be wiped from almost any other site -- and some of which would be illegal to post online in certain countries! A lot of it is disgusting and I can't stomach to watch it, but I'm glad it is out there to document e.g. the horrors of ISIL, or the US army killing innocent people. [...]\n\ni agreed and echo upon:\n\n> [thunder33345](#comment_311_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): I simply believe we should uphold everything and anything, without discriminate between types of content it is,One has to ask self, is there any TRUE freedom if there's a list of things one cant do?Can we even call it \"freedom\" if certain materials are prohibited to be uploaded??Why dont we just call it \"Freedom*\"(*only content where we support are allowed)\n\nYou can argue this kind of environment enables and helps abusers and bad actors,\nBut they dont need it, they can easily make \"their own thing\" with the money they get by begin bad actors,\nNormal users dont have that means to grant themself freedom and anonymity,\nI would argue that these helps out normal users more then bad actor as they can still exist without tor/zeronet/whatever and just find their own way,\n\nLike the analogy that bad guys will always find a way to get guns to do bad things, normal law obeying citizens need more aid to be able to obtain one to be able to defend themself, if suddenly guns are illegal, the only thing they hurt is normal law obeying citizens the most..\n\nPersonally i also see that having \"illegal material\" that havent been taken down to some extend marks the network as \"matured\", and that if the \"illegal materials\" are safe, i can gladly take the assumption that same goes for my normal \"legal\" site wont be taken down.",
				"added": 1541665610
			},
			{
				"comment_id": 322,
				"body": "also see https://ncase.me/trust/ regarding that same topic but in an interactive fasioned website",
				"added": 1542060497
			}
		],
		"1541833193_19HaBBc1M3usmLxayEasbaTkeZ3Ttr25gD": [
			{
				"comment_id": 317,
				"body": "i mean zeronet's selling point for me is not needing cryptocurrency to participate\nif we ever pull crypto in, i wish so that it's done in a USEFUL manner\nnot just a manner of self funding and just for hype\nto answer:\n>Why there is no zerowallet or something like that.\n\nbecause there's simply no need or reason or benefit to have such as of now, if you want you can easily tip any BTC forked coins to anyone's auth address i am pretty sure...",
				"added": 1541839597
			},
			{
				"comment_id": 318,
				"body": "> [timelinehyperbot](#comment_21_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Currently I am working on a project that does something similar. [...]\n\nexcuse me but crypto is 100% traceable, not much can be do this IS the property of blockchain, viewable to everyone\nyou can get your way around by using multiple wallets address which you should as it's the industry standard\nthe thing that \"sends\" the crypto or \"get an address to share\" button to someone should be the thing that's responsible to shuffle the coins in multiple wallets, there should be no need for an extra program\n\nalso what database? this is crypto on blockchain not some bank's private database of transections\n\nthere's 0 need to prevent people spamming you in a proper blockchain network,\nit's like someone is sending you 1000$ of money but all in 1$, who cares it's still money and free money... they cant \"spam\" without sending a coin value to you,\nand do you ever see governments impose laws to people from giving everyone 1 grand in 1$ bills?\n\nin a proper network there should be fees, each transaction cost money, so to \"spam attack\" it is to just waste money for the miners of the network(they get the fees)\n\nalso blockchain dont need users to run a \"software\" to secure their wallets\nyou can send to anyone even if the address has no recipient or their wallet software arent online it still will work they still will securely receive the coins\nif that isnt fact i am very certain you design your blockchain network wrongly and you should consider going back to the drawing board",
				"added": 1541888457
			},
			{
				"comment_id": 320,
				"body": "> [timelinehyperbot](#comment_22_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): R\n\nsorry i thought you meant by developing your OWN crypto blockchain rather then an \"addon\" plugin to zeronet\n~~back to your \"spamming\" concern, excuse me for not being able to fathom the \"side effect\", but what would happen if someone spammed someone else, what's the side effect?~~(edit: ah you ment spamming database related NOT spamming money)\n```\nsay i sell X software for 5$(in BCH), anyone who wanted to \"pay\" me 5$,\nthey will access a \"chat\" and tell a \"bot\" that's take action on behalf,\nthe bot would send a UNIQUELY new generated BCH wallet address to track this specific payment,\nuser copys that wallet address and paste it/scan QR and pays me 5$,\nonce user did that, it ask the bot to \"verify\" for the payment,\nwhen the bot sees it on their own BCH node that valid amount of money has ben transected,\n(maybe even do things like encrypting something specific to payment sender before releasing)\nit dispenses the software for the enduser who paid for it\n```\nin this example the end user has no need for anything other than their own BCH wallet, only the seller needs a \"bot\" to be running\nand in event of someone spamming payments, the seller profits off it, if you meant spamming the database, you should just prune it if enduser didnt complete payment(refund or keep it) and delete the data in database after X time old\n\nwhile this method is centralized it seems to be the only possible way to do so,\nthanks for following up, hope this gives you new ideas",
				"added": 1542011221
			},
			{
				"comment_id": 321,
				"body": "> [timelinehyperbot](#comment_24_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): I understand your comment thunder33345.  No I am not creating a plugin, but the issues are very similar. [...]\n\n(plugin as in general scope but yeah it interfaces with zeronet to do stuff)\nit probably will work but seems really non intuitive, when my proposed solution takes 0 client setup and all client need is the a wallet of whatever coin you support which assuming most will already have it,\n(a bite more setup on seller's side but it's one time) and a \"script\" to respond to commands like:\npurchase X(item) using Y(crypto): with a wallet address and how much to pay,\nvalidate (wallet address): to \"validate\" the payment on owner's site of things, and if validate it \"uploads\" a optional file in the same zite which is encrypted to the enduser's public key and respond with the link\nwouldnt that seems \"simpler\" and less things to do? especially the getting \"end user to install more stuff\" seems like a burden to purchase something off you\n\n> [timelinehyperbot](#comment_24_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Alternatively a python program can be created to handle all the processing like what I am working on currently.\n\nwait did you meant whatever you said above isnt how your program will work?\nwell whatever it is i really advise that the client shouldnt need to install something to be able to purchase from you",
				"added": 1542038240
			}
		],
		"1542174163_1Hw7w7Swdeexw86XmyfMHLbsSpzzH4yk5z": [
			{
				"comment_id": 323,
				"body": "> [moor](#comment_57_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): @Thunder33345: wrote about this\n\nnow you mentioned it i probably should revise it and add more detail",
				"added": 1542184745
			},
			{
				"comment_id": 324,
				"body": "> [krzysztofjarzyna](#comment_1_1N76dkP8zdrNRETTYcs4CtxYdCNGcp6iqK): I would gladly participate in such discussion but have not really enough time to do all the research myself.\n\nMind giving feedback regarding my take of [WOT like system](../1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:15)? with general concept and abstract components\nlooking for feedback on how to \"improve\" it\n\nwhile that's my take, i feel like everyone should make their own take as of right now everyone just post snippets of ideas of what they want it to be everytime a WOT related idea pops up making it disorganized and everywhere",
				"added": 1542220332
			}
		],
		"1542345622_1EJ9g8CNWY1APvdPjwX4Pn3V85rJyXYmVp": [
			{
				"comment_id": 325,
				"body": "same here but always assumed it's a glitch or something, try seeing over proxies like: https://zn.amorgan.xyz/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Stats\n\nthere it seemed nonexistance as from here i can see 1k~\n(ps how did you find this out anyhow?)",
				"added": 1542353517
			},
			{
				"comment_id": 326,
				"body": "> [helloadfadf](#comment_4_1EJ9g8CNWY1APvdPjwX4Pn3V85rJyXYmVp): I see. Definitely a glitch then.\n\nyeah sorry to say that lol, i would totally wish the same thing...",
				"added": 1542361487
			}
		],
		"1542373888_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 327,
				"body": "quit jerkcircling microsoft/github lol\ni would say it's more of crappy designs or just who registers account without looking at where they typed??\n\nif they wanted they already have your password regardless of where you typed it, so there would be 0 attempt needed to do that to begin with, they can just NOT hash it and boom your password in plaintext\n\nalso that's why you always use a password manager and a unique password for each site you used",
				"added": 1542379491
			},
			{
				"comment_id": 328,
				"body": "> [leftside](#comment_330_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): It means that even though you're an administrator of the github server, you can't steal the user's password without the entire system administrators being co-criminals(accomplices), not like those small shitty websites.\n\nactually point would be valid, if say you intend to eavesdrop secretly without everyone knowing, but assuming you are high in the power chain you probably could deploy a \"fake\" prod server for everyone to see that mask the real changes\n\n> [leftside](#comment_330_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Moreover github is the only website which plays the users around like this among thousands of web accounts I have.\n\n[citation needed]\n```\n(everything below is the register page's fields for the reasonable popular websites i can find)\ntwitter used username and email\ngoogle used first last, user name, password, confirm password\nfacebook used first, last, email/phone, password\namazon used email, username, password, password confirm\nebay used first, last, email, password\nyahoo used first name, surname,  email, password, ...(rest unrelated is redacted)\nbaidu used username, phone number, password, chapta\nspotify used email, confirm email, password, display name, DOB, gender, chapta\ninstagram used mobile/email, fullname, username, password\nvk used first, last, DOB, gender, (assuming password is behind a \"continue\" page)\nlinkedin used first, last, email/ph num, password\nwordpress used email, username, password\napple used first, last, region, dob, email, password, password conf\nvimeo used first and last, email, password\nweebly used full name, email, password\npaypal used country, given name, middle name, surname, email, password\ndropbox used first, last, email, password\n\n\nto your credit:(everything that i found using password field as second is listed here)\nreddit used email first page, username and password in second page\nmicrosoft used email name, password (notable right?)\ntwitch used username, password, DOB, email\nnetflix used email, password\nqq used nickname, password, phone number\nwikipedia used username, password, conf password, email, chapta\nmail.ru used username/email you want, password\npinterest used email, password\nnytimes used email, password\nsoundcloud used email, password, chapta\nfirefox used email, password, password conf, age\n```\nso i wouldnt agree on what you said by stats i gathered myself, i would say it's give or take 60-70% which dont follow the field, password template on signup\ni would say while some follow the design pattern, most just stick it where it make sense for themself\nhonestly just watch where you type...\n\n> [leftside](#comment_330_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That's the only case when the entire user password hash database was stolen by the hacker or when one shitty personnel is trying to decrypt the hash of the user passwords in his company's server. And it's off the topic.\n\nbut your main worry is that they are collecting your password, so using a password manager and unique password it will render it only useful on github thus failed their evil goal\n\nCan we let's back out for a second tho?\nThe purpose of the password field is just to make it harder for someone to look over your shoulder and see the password in clear text, it dosent make your password \"securer\" to be transferred over internet, anyone who man in the middle still will be able to capture it, all fields are equally vulnerable(https ftw)\nmicrosoft can easily just setup a hidden eavesdropper between the edge network and github servers, and they would be able to capture everything(they owned gh and probs their HTTPS certs anyways) without making any alterations to the website thus raising 0 suspicion from everyone, just a simple passive sniffer between you and github can do the job much better",
				"added": 1542443691
			},
			{
				"comment_id": 329,
				"body": "> [leftside](#comment_333_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Appreciate ur in-depth information.  [...]\n\ni guess not really much can be done then to actually watch where you are typing when going onto a new site",
				"added": 1542526962
			},
			{
				"comment_id": 330,
				"body": "> [leftside](#comment_334_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Who cares sink hole while crossing a pedestrian way?If a subway construction company drained water underground, they have to fill it again for the public safety.No one knocks the pavement ahead of himself while taking a walk.https://www.youtube.com/watch?v=p35GgvPP65c\n\nwell to see that > 60% of the websites did not follow the \"password always on second field\"\nso your assumption that second field should always be password is rather questionable...\n \nTo argue \"No one knocks the pavement ahead of himself while taking a walk.\"\nIt's not a \"type in fields and guess what this website asks for\" there's labels of what you are suppose to fill\nso to correct your analogy, it's more like there will be signs that points to the sinkhole, all you need to do is slow down and read then avoid it(to translate to real world example: non password field will have labels and all it takes is stopping down and reading it)\n\nI will end this here as it drags on and i see no possibility of a resolve:\nIs stopping and reading that hard? it's not like there's no labels for inputs forms and you have to guess everything,\neverything you needed is there, all you need to do is just read and fill it in",
				"added": 1542548836
			}
		],
		"1542671496_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 331,
				"body": ">No Chinese translation for new strings\n\nHit me up with these strings file, ill try my best to translate when I am free\n\nalso i suggest a \"button\" to \"preload all images in this gallery\"",
				"added": 1542705636
			},
			{
				"comment_id": 338,
				"body": "Responded to your mail, many thanks for doing this,\nalso i have some suggestions(copied from mail, but consider reading when you can since there's other stuff in it)\n\n- \"show only on X hub\" button for 1+Gallery, basically in the Hubs tab, add a \"search\" icon to the right of hub name, when clicked it will auto fill in the hub's address and search it for you\n\nbecause most hub still uses galleryhub and it would make it easier to view a galleryhub in galleryhub+\n\n- pagination for search, as say your limit was 100 galleries you can just load next page rather then having to edit settings, optionally page clears previous results(a normal page system would behalves with numbers in bottom to switch also stops loading too many gallery that browser kills), OR next page adds more content on current page(like how an \"infinity scrolling\" page system would work)",
				"added": 1543080856
			},
			{
				"comment_id": 346,
				"body": "addition onto pexo point, maybe keeping it local and not synced to peers will be nice or sync to peer which makes things easier, i dont see a way to sync to peers without creating another site, maybe having it as optional files on hub site?\n\nreminds me of something like plex.tv's deck of watching with continue watching\n\nalso what about somehow making it sync to gallery merger too!",
				"added": 1543787190
			}
		],
		"1542481728_183EJxsVNmdEH2rhDxMXnqw6Pvjdj3XAf7": [
			{
				"comment_id": 332,
				"body": "also worth checking this out, https://goodolddownloads.com/enter\nthere's even signed copies of game for GOG and scene games",
				"added": 1542705815
			}
		],
		"1542675872_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS": [
			{
				"comment_id": 333,
				"body": "> [shibeotp](#comment_14_13fF8ReM7zvX4ytjPkwEaRtBbtFKeho7XS): im going to delete the clone\n\nfunny thing is you cant delete it, once you release something into zeronet it's there and forever....\ndeleting it deletes it off your drive, but not mine and other countless peers",
				"added": 1542729202
			},
			{
				"comment_id": 334,
				"body": "> [leftside](#comment_348_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): How about deleting all the contents in the site directory and sub-directories, and then sign and publish again?All the peers will update their site directories to be empty as mine is, won't they?\n\n> [timelinehyperbot](#comment_33_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Actually if you are the owner YES you can delete the content.   For example If I made a revision to my timelinehyperbot.bit site and republish it everything within my ZeroNet directory for my site will update. [...]\n\nyes i am betting when OP deleted the site OP also deleted the keys(actually not sure if zeronet deletes the key when you delete a site....(probably should have mentioned it before LOL)\nso yeah you can like nuke everything by setting the contents to nothing\nand there's no backup/archive mechanism so yep it will be gone forever, if you abuse the files update command to nuke all files\n\npersonally i see this as a \"flaw\" or \"weakness\" of zeronet, having no way to undo changes, despite how everything here like source code are transparent",
				"added": 1542754572
			},
			{
				"comment_id": 335,
				"body": "> [leftside](#comment_350_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I don't agree with u.In my case , I backup HDDs every night before sleep. It means at least I can recover changes in Zeronet from the last night backup.  [...]\n\ndam that's cool but yeah for normal people mostly they dont have backups\nwouldnt that take a lot of diskspace?",
				"added": 1542787596
			},
			{
				"comment_id": 337,
				"body": "> [leftside](#comment_351_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Do the math how much a giga bytes memory of HDD costs. And check the disk space used up by zeronet folder.It costs almost nothing.\n\nso basically it just uses the spare unused memory, which you can purge if needed\ni guess that's smart...",
				"added": 1542829700
			}
		],
		"1542766666_1Bcm7BpVuYsQaE8wGB8CrLWzef32rrMy1r": [
			{
				"comment_id": 336,
				"body": "Seems too vague to be trustful or useful....",
				"added": 1542787922
			}
		],
		"1543348094_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn": [
			{
				"comment_id": 339,
				"body": "Look you are asking in a zeronet forum so you should assume all content here is \"biased\" at best, by that said i will try my best to give my honest opinion:\n\n> javascript\n\nyep, still there and in no sight of going away, unless downloading a site with an .exe or .bat .sh is your thing which is worst in regard,\ni see js as a necessary evil as there's no central server..\nUnless zeronet has built in brainfuck interpreter?? or any one know some sort of \"safer\" alternative??\n\n> certs id\n\nHonestly fully agree, this is some sort of \"centralizing\" power in a decentralized environment but again, that's cert authority for you,\nSure there's things like milchan, cryptoid etc which is a user side singing so you can have any tags you want, IMO it's like a hack to allow power to be decentralized..\nThere's also shared id, where someone shares their keypair(sharing is irrevocable) BUT that has flaws that someone malicious could just delete all the content,\nThere's also multiuser plugin, but honestly it's a pain in the ass, why not have built in capability to support multiple users from the same id???\n\nI wish one day, someone can just use a \"bitcoin address\"(like why not addresses are so tied into zeronet to begin with why make a CA necessarily) with no cert signed to it, and sites who care for user can allow/enable that\nPros: 100% unique, virtually impossible to copy, controlled by no one and cheap to generate, using GPU you can create a sudo username prefix\nCons: random most times, unless you have the POW for that name\n\n> sanitization\n\nYes there's 0 client side sanitization, that's necessarily for it to be serverless, BUT they failed to mention you can enforce client sided sanitization, you CAN inject content if developer did not aware of such flaws which may be a problem for new developers\n\n> friend to friend\n\nYep we still need something like WOT to verify votes etc and allowing friend acting as moderator to hide spam",
				"added": 1543388709
			},
			{
				"comment_id": 340,
				"body": "> [anon202010102](#comment_1_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn): The ID is my main concern, as ZeroNet stored (I would believe it still does?) everyone's ID and past comments in an un-encrypted way, in nicely organized JSON files:\n\nYep it's also necessarily or else there's no way for client to phrase and generate a forum board, remember there's no servers...\neverything is client sided, so it's necessarily to have the data to be able to render it\n\n> [anon202010102](#comment_1_16VrCKQQiVZpJ6S5xJASR8LCFLv24M5bfn): Sorry, I'm having a bit of trouble understanding what this is, exactly? A third-party ID generator?\n\nIn some way, yes\nIt also does not depend on clearweb and uses zeronet + peer messaging plugin(pseudo wss like) to send request for an ID, and cant be blocked easily like zeroid which is blocked by GFW\nit still have the same problem as the normal IDs begin centralized to 1 host(have plans to spread among more trusted peers) [necessarily to enforce unique names]",
				"added": 1543389137
			}
		],
		"1543505232_1LRrXQL18q4U54Zv8mafCCGm2WAYSe79hu": [
			{
				"comment_id": 341,
				"body": "did it destroy data in /data/user.json?",
				"added": 1543518678
			},
			{
				"comment_id": 342,
				"body": "> [digitalshaman](#comment_3_1LRrXQL18q4U54Zv8mafCCGm2WAYSe79hu): Yes. I am still having some issues after I wiped the folder and did a fresh re install. I am getting a invalid hashtag error. And this is a fresh install.\n\ncan you show us the errors?",
				"added": 1543518820
			}
		],
		"1543748747_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 343,
				"body": "probably just encrypt the clear text with owner's public key??",
				"added": 1543763653
			}
		],
		"1533649287_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 344,
				"body": "gallery hub+ ftw",
				"added": 1543763723
			}
		],
		"1543785759_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 345,
				"body": "muting the user globally is the only option as of now sadly maybe there should be a persite mute",
				"added": 1543786992
			}
		],
		"1543914606_139zVkd4AsZqs9qSYk6ypPDAqDcjPCmRm4": [
			{
				"comment_id": 347,
				"body": "anyone can submit their sites, dont see a need for maintainers",
				"added": 1543935322
			},
			{
				"comment_id": 348,
				"body": "i am in favor of some sort of moderation, but under the condition the original content isnt destroyed but rather hidden or flaired(slippery slope for data storage abuse and spam abuse)\nmaybe something like allowing everyone to flag sites, like nsfw or dead link flag and counter flag\nif enough people do it, it just shows a badge of \"dead link\" or \"nsfw\" over it\n\ni dont really like the idea of moderators deleting sites because they violated X rule",
				"added": 1543946815
			},
			{
				"comment_id": 350,
				"body": "i think a unmoderated dumps of new sites is strictly necessarily in the spirit of this network,\n\nfor promoting/spotlighting websites\ni think maybe zeroblog++ would be better with multiple writers spotlighting different sites every 2 weeks or month\nor maybe a modded zero blog with \"featured\" sites",
				"added": 1544014868
			}
		],
		"1543928148_1E5pgBaKNzFU9Loeg7eDGrSkXqJAqbySrJ": [
			{
				"comment_id": 349,
				"body": "i could care less if they migrate here or somewhere else, though new users are welcomed\ni have a feeling it's because pressure by apple that forced their hands to do that,\nas their app was de-listed off appstore for containing [child] porn",
				"added": 1543947002
			}
		],
		"1544189569_13pMUCyHCSA16YYxki54Zh8FCv6qL18pcP": [
			{
				"comment_id": 351,
				"body": "cue a rally of people who disliked it and build scripts to block the scripts",
				"added": 1544202361
			}
		],
		"1544254269_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 352,
				"body": "https://api.ipify.org pure text sooo",
				"added": 1544258311
			}
		],
		"1544353154_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 353,
				"body": "something like the KAD network search? (what edonkey uses for client searching)\nnot sure of detail",
				"added": 1544354295
			},
			{
				"comment_id": 354,
				"body": "I think we should start very small, lets assume there's 0 malicious actors(for now)\n\nI doubt it will be as \"good\" as Google but it's something.\nLet's assume the most simple case:\nThe plugin indexes site title and descriptions+clearnet site metadata HTML standards(only for the main page) also maybe the mainly \"used words\" in the page,\nand creates a table out of it for fast access,\npeers have an int/double as UUID.\nPeers also create tables of peer ids and somehow based on what metadata of \"words of sites\" they have, the closer their id to another id, the more data they will store from the peer.\n\nSo an example can go: peer 1 tries to find \"zero\".\nIt would query peers he seen for \"zero\" in title,\nPeers he get wont necessary have it, if they know someone who have it, they would give them their ID,\nWhich the querrer will proceed to ask that peer if they have any, if they dont, they ask someone else,\nIf they timed out or died they ask their neighbor peer, if they by any chance have the copy of data.\n\nSince site addressed and metadata are \"cheap\" we could even replicate and store data of our neighbor peer id randomly,\nThis also grants that peer plausible deniability and privacy.\nThey can claim that they actually dont have that site but just it's metadata of a peer nearby them.\n\n(now queue me writing even more ideas)\nThis was based off and inspired by [Kademlia](https://en.wikipedia.org/wiki/Kademlia)(clearnet: wikipedia) and KAD network",
				"added": 1544468870
			},
			{
				"comment_id": 355,
				"body": "Let's assume we have some sort of \"WOT\",\nthen we can implement signed responses.\n\nSay someone ask for \"zero\",\nBob could response a few sites and sign it with bob@zeroid.bit.\nIf bob was heavily trusted he would his responses will be prioritised.\nIf someone else choose to \"fake\" at a signed request, they can be penalized by WOT so it wont happen the second time.\nUnsigned responses can also be penalized but since the response is not tied to an ID there's no way to \"punish\" users, even if you block their peer id, they can easily switch it at 0 cost.\n\nWhile yes it dosent stop them from just not signing people wouldnt trust them over unless they are desperate.\n\nI think our main concern is about people abusing the indexing system, say they knew people will search for \"zero\",\nthey just include the \"zero\" word somewhere in their tags description or title,\nmaybe we should prefer index by words and their % of begin used in the page?\n\nWe could also have POW if we really really want to, we enforce each time a peer wants to generate a peer id they need to create a hash starting with 5(or more) 0's, the hashing is peerid(int)+time(int)+data(string),\nwe can make surre that time may never be older than 48 hours(so they cant be shared or kept reused) or in the future(so they cant make it time of 100 years in future and never need to regenerate),\nto verify the POW we can ask the peer their data string and their time and redo the same math and ignore incorrect peers.\n\nThis allows us to make it somewhat less effortless to just fake response as now their id can be temp blocked.\nTemp though as peer id are dynamic and you also may risk blocking random users who shared the same id, maybe we can block by peer id + time + data...",
				"added": 1544469899
			},
			{
				"comment_id": 357,
				"body": "> [blurhy](#comment_205_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Complicated vailidating system would make the data heavy and more useless hash.To prevent DDOS on search-plugin,we can just limit the transfer,max queries per minute,etc. [...]\n\ngenerally rate limit by IP and have a queue system for requests FIFO\nvalidating someone's hash shouldnt be too hard though\nand signing should be 100% optional for privacy sake of user and enduser",
				"added": 1544537734
			}
		],
		"1544500987_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 356,
				"body": "maybe try zeroblog++\nbinchan's blog seems to be there for long time",
				"added": 1544515232
			}
		],
		"1544560849_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS": [
			{
				"comment_id": 358,
				"body": "probably fb is \"better\" despite how shitty it is\nbut normal people are there, everyone wanna advertise to normal people",
				"added": 1544566361
			},
			{
				"comment_id": 360,
				"body": "notabug is kinda like okayish\nbut they have this never ending \"front page\" drama\nwhere people ddosed the front page by spamming making it not usable\nand owner set up filters for the front page(/t/all still not filtered, just /t/front)\nwhich some people dont like",
				"added": 1544729654
			}
		],
		"1543026395_1GDcCK6cWoj98mg541Yj9rW1nwXcBz87eE": [
			{
				"comment_id": 359,
				"body": "is caption on the image or like side of image?? or just image alt text?",
				"added": 1544723764
			},
			{
				"comment_id": 361,
				"body": "i think these are needed to progress forward\nlike the idea one day we might even need a \"new\" file system format to store images for more features",
				"added": 1544888095
			}
		],
		"1544944813_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 362,
				"body": "personally i feel like zeronet is more web focus and dat protocol is a more \"all round\" thing\nlike zeronet is build for web in mind\ndat can be used without web\nbasically boils down to:\nare you using it for a website, if yes use zeronet else use dat\ndat seems to be more versatile at the cost of less focus to web side of things",
				"added": 1544954293
			},
			{
				"comment_id": 363,
				"body": "> [nws](#comment_6_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf): You're right that Dat is file-focused, but with Beakerbrowser it seems just as suitable to publish websites as ZeroNet is. Or is there a fundamental difference?\n\naside from what timelinehyperbot already said\ni dont think it supports dynamic sites like this as well as zeronet\nbasically things like allowing user to post messages etc isnt as well supported/works as zeronet is\nas zeronet focuses more on web aspect\n\npersonally tho i dont like the idea of no way to \"stop seeding a site\" without deleting(pausing works but stops updates too),\nlike in the spirit of freedom and user's choices they should have an option to unseed a site,\ni dont care if it's seeding by default i think that's a good idea to make it default anyways but you can still opt out,\nthough even if i could unseed, i would still seed sites anyways because i support zeronet\nbut that's another argument for another thread....",
				"added": 1545002269
			},
			{
				"comment_id": 365,
				"body": "> [nws](#comment_8_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf): Thanks for elaborating! How does ZeroMail work if you can't have private account data on Zeronet?\n\nsee, lets say your account has nws_pubkey as pub key, nws_privkey as priv key\ni can send you something encrypted with nws_pubkey which you can decrypt with the priv key\n\ni do it by placing the content in my json file, so to check it you must scan everyone else's data which uses CPU to brute force seeing if you could decrypt it or not\n\n> [timelinehyperbot](#comment_94_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): nws ... ZeroMail is encrypted but that does not protect you from spammers...\n\ntry blocking or ignoring them, as when they spam they are using their own data storage to do so",
				"added": 1545042971
			},
			{
				"comment_id": 367,
				"body": "> [timelinehyperbot](#comment_95_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): nws ... blocking sounds like a solution but I do not know how that is done using ZeroMail...\n\ngo to zeroid.bit enter user's name and click mute\nthough i think mute has been bugged recently",
				"added": 1545085487
			}
		],
		"1544937960_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 364,
				"body": "> [quantumworld](#comment_74_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I may role out an infowars site. Guaranteed he would get this place hopping fast. Average viewership on one of his shows is about 9 million or more. Also the founder of zeronet would be a great guest on his show.(I Have Friends In High Places!).. I bet I can swing this one..\n\nthat's not a bad idea, as again sites like these could really do with extra anonymity and protection from governments by using zeronet backup/mirror/even as main sites",
				"added": 1545002403
			}
		],
		"1545062532_1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9": [
			{
				"comment_id": 366,
				"body": "just saying: there's a differences between GOD and another zeroup,\nGOD reupload untouched files that are signed by GOG\n\nZeroGOD also seems to be less updated thing as of more like an abandon project\nalso lost of database is kinda a \"problem\" as most files are host over google drive\nif you wanna attempt, i recommend just remake it basing off their themes...",
				"added": 1545084963
			},
			{
				"comment_id": 369,
				"body": "> [random3r0r](#comment_1_1P4mZFiz4eZW5wdk8ZB4Gu7NUt1FxjBKi9): thats i think is the best a full god with all files host by all user and also maybe one or two hoster max like mega uptobox and firstfiles > thunder33345: just saying: there's a differences between GOD and another zeroup,GOD reupload untouched files that are signed by GOG [...] [...]\n\n> [thunder33345](#comment_366_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): GOD reupload untouched files that are signed by GOG\n\nyou already quoted my answers lol\nalso UI isnt the same, there's inline game change logs, and button to view on GOG store and GOG DB but that's nit picking",
				"added": 1545129090
			}
		],
		"1545106555_1NPaMdmTDg441cn76DGdUjz5ZXeVTPfWfx": [
			{
				"comment_id": 368,
				"body": "> [timelinehyperbot](#comment_99_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): If you could show me how someone can send me a web form: First Name, Last Name, and Email to my ZeroNet Account using a standard html page on ZeroNet ... that would be cool... For every account requires the user to sign for the data via ZeroNet... I have realize ZeroTalk can post data but EVERYONE sees the post... having a PRIVATE area for a Seller and Buyer seems at the current time not possible. Unless of course you use a python program that points to a ZeroNet folder and file(s) ...\n\nconsider using peer message and trusted nodes\ni wanna buy say XYZ for 10$\ni can tell the automated trusted node to give me a bitcoin address i can pay 10$ to get XYZ\ni pay the 10$ which then i tell trusted node to verify\nwhen the trusted node verifies the payment it sends me my file/whatever\n\nyou can say a trusted node is kind of a \"centralized backend\" in a decentralized system\nallowing you to do your payment checks etc",
				"added": 1545128921
			},
			{
				"comment_id": 371,
				"body": "> [timelinehyperbot](#comment_100_12JYCt1Mj1Fa7GA9N67HAxP6NiBHVWK9GS): Hi thunder33345, Peer to Peer requires both parties to be online at the same time... A 3rd party must be involved to make messages / files available by feeding such to you when you log in... Otherwise you NEED to be on at the exact same time... A draw back to Peer to Peer...\n\nYes the trusted node must 24/7 be online, the buyer dosent need to be the buyer just need to send the command to the automated trusted node,\nif the buyer forgot there they left off they can just ask for the status\nlike \"waiting payment to X address\" or \"waiting 1 out of 5 blocks verify\" or \"download ready <link to encrypted file that's decoded when downloaded>\"\n\nwould you buy something from me over zeronet if you need to install 1 plugin??\nif you are security conscious you probably will say no\nnow what if i told you you need to install multiple python scripts/software and also provide your gmail account?\n\nideally though no install should be needed,\nfor example just use some sort of \"zeromail\" that's stripped down and can only send and receive response form seller, the seller will just be an automated trusted node as a bot 24/7 online\n\n> [thunder33345](#comment_368_1AHEQxyRG9s6owyJHShB4U4rg9GL5FMX5K): you can say a trusted node is kind of a \"centralized backend\" in a decentralized system\n>allowing you to do your payment checks etc\n\ni think you forgot here that trusted node is basically the invisible backend you always wanted, with data processed begin 100% private\nwithout using \"untrustworthy\" google services and installing more then necessary amount of plugins and software",
				"added": 1545161048
			}
		],
		"1545156874_13kYNU2CMyyfVukmVgqeCNJdFNDtc2ZpEp": [
			{
				"comment_id": 370,
				"body": "welcome to torrent,\nthis is basically torrenting, there's next to nothing to protect the seeders\n\n> [quantumworld](#comment_84_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): They can also hack your computer from the power lines. [..]\n\nIntel ME lol",
				"added": 1545159435
			}
		],
		"1545167966_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 372,
				"body": "welcome back, was kinda getting worried something bad happened\ngood to have you back, also there's like kxovid which is kinda promising video replacement when people thought you gone for good",
				"added": 1545170976
			}
		],
		"1545325711_1PhqJPvtSbw5RkpHj63w8cRtyJw2ivpCSy": [
			{
				"comment_id": 373,
				"body": "downloading dosent mean executing, sure i can download a virus as long as i down run it nothing could go wrong",
				"added": 1545331593
			}
		],
		"1545423165_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": [
			{
				"comment_id": 374,
				"body": "> [nofish](#comment_1227_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj): Partial site downloading: It's recommended to use optional files to resources that is not required for the site operation.\n\ni disagree, there should be a way for client to \"force\" optional, let's say the site owner wants to make me download all the .jpg, i should be able to reject these .jpg locally, and choose to add a regex of no download or prompt on request based on that\n\n>[Protocol] Ability to download files based on their hash across multiple sites, this isn't the easiest to do since it'd require a rewrite of the way ZeroNet requests files though still very possible (and should've been done at the very beginning ...) \n\nI agree, something like that even if it's just a hack fix like say \"dont download if we had this hash we will just copy rename and paste it there\" would be better then nothing, though it still will take up valuable disk space",
				"added": 1545507704
			},
			{
				"comment_id": 375,
				"body": "> [zeronetisshit](#comment_14_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): @thunder33345 Right, it's a big difference of having the site owner decide what my client downloads and the end-user deciding what gets downloaded.My client already only downloads HTML, JSON, CSS, Javascript and other \"essential\" resources. [...]\n\nThanks for the constructive criticism, zeronet needs it to grow and improving and also to stop this begin just another echo cave with everyone blindly saying how good zeronet is without considering it's flaws, hope that this wont be just a 1 time throw away account\n\nAlso i doubt it needs protocol changes for dedupe, i am assuming if say i know the file hash is XYZ and i already has a copy of it, i can just stop downloading that file, though more changes is needed on webserver to not have duplicate files lying around\n\nYes it's more of a now we should have it for client's choices thing, also useful for like milchan boards where there could be an api to allow site to add blocks on behalf of user to nuke all instance of say illegal content off their disk\nby adding a regex to that board without relying on user block\nthere should be multiple blocking mode, one begin a prompt user to allow or block on request, and a silent block\n\nI wonder tho if these changes might be drastic for zeronet to make as now clients can force optional for all files\n\nAlso worth adding [client][PROPER multiple account support for the same ID](https://github.com/HelloZeroNet/ZeroNet/issues/1813)(github), basically allow user to have an easier way to be more anonymous by having multiple names without all the multiuser hacks\n\nAnd some sort of Web Of Trust to evaluate votes of others, and to establish the possibility of a decentralized moderation, not by mods selected by site owner but by people you trusted.\nOr just a general anti sybil that can be used on say zerotalk's upvote button, see my concept [Zeronet Web Of Trust Concept](/1648uDJu8HaSjiYR6p8KJMGtKGQyUdFNqS/?Post:15:Zeronet+Web+Of+Trust+Concept)(My blog)\nThis is NOT an anti-spam solution, while sure you can hide the spammers/ppl by hiding everyone lower then X trust level, it still will fill your drives and all that bad effects of spammer, now you just cannot see it while it's still happening, it also renders new users begin invisible and only should be used as a nuclear option.",
				"added": 1545517358
			},
			{
				"comment_id": 376,
				"body": "> [zeronetisshit](#comment_17_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): Sadly I do this very often. And I wasn't very creative with my name choice this time ;)\n\nwell at least we will still see you around, under different names",
				"added": 1545520407
			},
			{
				"comment_id": 380,
				"body": "> [quantumworld](#comment_93_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): Ya Cool then we can get a cia agent in there that can play gate keeper for all the information they see. FUK THAT IDEA!!!  Sorry this concept is severely flawed in technical issues and allows central control of data that could be used against all users for political purposes and for data manipulation of others.  User should and always be the final decider as to what they want to view. And Not the other way around.\n\ni think there's misunderstanding here the user HAS control, it's ultimately user's choice if they choose to or not to seed illegal content\ni am confused is this just a troll or you are taking me serious, because if you read the whole thing you should get it already \"client's choices thing\", there's no way to delete/unseed anything unless client choose to do so, there's also no \"central control\" and no one other then the user can decide, the site can only ask if user want to allow it to do so, but cannot force user to do that against their will\n\n> [zeronetisshit](#comment_24_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): @thunder33345 's idea (didn't read your whole post, sorry)\n\ni think it would make more sense to you if you read more of it\nbasically right now people who uses milchan is forced to download certain boards they rather not have(because lack of optional files) and we should have a \"force reject\" plugins to allow user to unseed these files shall they wish not to\nalso the \"api\" is basically just a zeroframe API call\nthat ask users if they want to allow a site to block via certain regex or choose to decline the request\n\n> [zeronetisshit](#comment_24_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq): It's kind of ironic how quickly ZeroNet has adopted shareable user and site blocklists ...\n\nwell it's still up to user's choice to opt in so i dont see anything wrong,\ni dont like the user blocklist though... sites are acceptable since it's just a warning, but again that's their call not mine, i shouldn't be able to force them to not install a blocklist if they wish to have it",
				"added": 1546032134
			}
		],
		"1545615413_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 377,
				"body": "there wont be problem as long as both nodes sync before publishing\nif they didnt sync before publishing they risk deleting other's data",
				"added": 1545648111
			}
		],
		"1545642302_1b4WB9mZcpjKdQUnYvGBgTMeatTxXTBnf": [
			{
				"comment_id": 378,
				"body": "probably nothing, not that i know of will even support multiple users without handing over also your site key\nbasically there's not reaally any blog fork that allow site owner to add editorials which can only add and delete their own entries",
				"added": 1545688348
			},
			{
				"comment_id": 379,
				"body": "> [duck0](#comment_1_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): Since Bitcoin cryptography is involved, can some form of multi-sig be implemented?\n\nprobably possible, but i would just rather build a new software that actually supports multiple users as editors\nsomething simple as allocating X user ID some space in a certain \"editor\" folder should do the trick\nbut zeroblog dosent even support user, it assume person who holds the key will be the only one blogging",
				"added": 1545757151
			}
		],
		"1546322357_15zJUjDdW3W9ppr6Voei1XHTyP8zraWAs3": [
			{
				"comment_id": 381,
				"body": "not possible to have IRC protocol in zeronet, irc based off a server dependant architype, zeronet has no central servers\nBUT it's possible to have chats like thunderwave 0play and from what i know other are in the works",
				"added": 1546603633
			}
		],
		"1546704937_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": [
			{
				"comment_id": 382,
				"body": "there's nothing we can do, maybe you leaked the private keys?\nas that's the only way anyone else can post as you(aside from hub admins)",
				"added": 1546725947
			}
		],
		"1547483937_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": [
			{
				"comment_id": 383,
				"body": "some links mirrored\nwww.mileyquest.ml (dead)\nhttps://eugeneshickey.github.io/ (alive)\nhttps://eugeneshickey.keybase.pub/ (alive)\nhttp://fncuwbiisyh6ak3i.onion (unchecked)\n\nthe thread as of the time i am reading seems clean,\nlooks like an ARG\nseems to be a thing since 2015\nhttps://plus.google.com/u/0/108915884713932997001\nand 2016-2017\nhttps://twitter.com/WarrenOHicke\nthe 0chan post is also 2017\n\nlooks as if it's some abandon arg or arg that never got off the ground",
				"added": 1547503085
			}
		],
		"1547924891_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 384,
				"body": "what if bittorrent and IPFS cross seeds?\nyeah if zeronet also cross seed to normal bittorrent i agree it will make everyone's life easier\njust cross seed so even a non zeronet bittorrent client can get/send files",
				"added": 1547940310
			},
			{
				"comment_id": 385,
				"body": "> [styromaniac](#comment_446_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This won't work because BitTorrent uses md5, which is easy to create a matching fingerprint with an imposter file, therefore is insecure. IPFS I think uses the same hash algorithm as ZeroNet. Interoperability might be possible with IPFS.\n\ni mean i dunno, like if it was a thing we wouldnt we already see bittorrent falling apart? i kinda like the cross-seed idea and pretty sure someone made a plugin too",
				"added": 1547971790
			}
		],
		"1548974921_18S47ArorYtHtcicjdGi6VZdhgJgwhrud7": [
			{
				"comment_id": 386,
				"body": "that's cool! finally!\nbut now will the main milchan code base be merged with the milchan merger code base?\nor they will remain separate as just proof of concepts",
				"added": 1549010083
			},
			{
				"comment_id": 387,
				"body": "would be nice if this is \"merged\" into milchan, people could create a board on the \"default\" hub, another hub, your own hub",
				"added": 1549094486
			}
		],
		"1545308490_1CSyXuUPje7aUipDKqm3xhm6BKH3SjDZUu": [
			{
				"comment_id": 388,
				"body": "> [quantumworld](#comment_225_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE): I know I will get allot of flack for saying this but I do want a timed posting system.  I had this on my blogs and on tweetdeck when I used it. It allowed timed posts. However I would have its output as saying that it was a timed post. Or a pre recorded post. I think this would give a nice add on for new content posting and also for going live on content posting.  (I am going to go hide now for making this post for a week or two.. lol)\n\ndont see why this would be controversial, but people would be able to view them before the time expired due to lack of some sort of \"decentralized\" programming to act on your behalf to \"publish\" a post\ni think this is something which we might just need blockchain to do, unless you want to go for the \"just make ui hide it\"\n\nif you go for just making ui hide it, i do expect a way for people who willing to, to be able to view it or smth",
				"added": 1549527342
			}
		],
		"1554091689_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk": [
			{
				"comment_id": 389,
				"body": "> [snax](#comment_1_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk): I'm asking, since all these other services are free, why someone hasn't set up a gateway to handle traffic for free as well. Have people just not thought about this? Is it too technically difficult for most? If it's not too difficult, and since it is a big hole in these systems, wouldn't it be very beneficial to set up a gateway service between ZeroMail and clearnet email just like BM has?\n\nsomeone gotta be the one to do the work od making it and pay the bills, that's the problem here\n\n> [snax](#comment_4_12J9C7UzPWdvcmGtYGDRqnLsjpUByVPtwk): then you should be similarly worried about the owner of a Matrix server being able to see everyone's info and arbitrarily abuse that (censorship is the least worry here, although censorship is rampant on Matrix servers).\n\ni dont know but i believe the 2E2 and encryption mess is suppose to block this? so only the sender and receiver can see it, but yes instance owner still can just shut down/block something at their whim",
				"added": 1554189454
			}
		],
		"1562000931_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 390,
				"body": "> [toyata](#comment_66_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1): Why not enabled for any site?The issue is not when keys leaked, but if a site is forced off ZN or removed completely.\n\nagreed, this, and so much of this:\nthis already happen good few times, there should already be a way for visitors of sites to auto archive sites they dont own\nthere's already cases of owner self censoring happening repeatedly, we need to get better precautions",
				"added": 1562408828
			}
		],
		"1547322502_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": [
			{
				"comment_id": 391,
				"body": "UFTS seems good, if everyone were to assume to be good actors\nbut how about dealing with bad actors, the only way would be whitelisting system of sorts",
				"added": 1562455771
			}
		],
		"1561288542_14hmCEXpoVdYQqeve93LpieDx2k8aFyT66": [
			{
				"comment_id": 392,
				"body": "because let's us enjoy it, while we still can...",
				"added": 1562620576
			}
		],
		"1562698903_1CeQt9V6HXQjKEipGLs6RSAYD8aLEvG7KC": [
			{
				"comment_id": 393,
				"body": "how do i know if i am running py2 or py3? 0.6.5, rev 3864\ndoes that meant i am running py2?\nis the zerobundle on the zeronet.io site py2 not 3?",
				"added": 1562704927
			},
			{
				"comment_id": 394,
				"body": "> [filips](#comment_79_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): You are running py2. [...]\n\nyep i am somehow running py2 oddly, updated yay thanks",
				"added": 1562710229
			}
		],
		"1563092690_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 395,
				"body": "> [brianhanson2nd](#comment_14_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): Why don't you all kill yourselves?Oh look at me, I guess I'm a murdered now...You've got to be a weak individual to actually kill yourself just because somebody says you should. Maybe you should ignore the toxic person, or block them, get a restraining order against them if it take that much. Kids these days just have absolutely no clue.\n\nagreed to this, just because someone say such online, dosent meant it's a good idea\n\nif i told you to \"eat shit\", and you ate it, am i to be blamed? when did i take a knife and force you to eat it? the only thing i did is telling you to do such and you ate it by your own free will...\nyou totally can ignore my comment and move on your merry way like that didnt happen",
				"added": 1563221925
			}
		],
		"1563381859_1MU8er27jszWmguLydfKYxuaWQNXbQ9cyt": [
			{
				"comment_id": 396,
				"body": "as said previously\nthis is NOT a standard internet, there's NO conventional server sided processing\nremember the reason we are here is to decentralize, it would make no sense to fall back to centralization right?\npretty much defeats the point of coming to zeronet\n\nalso \"encrypted\" if it's encrypted you cant run it, if you can run it you can see the code too since you need to see the code to run it",
				"added": 1563659344
			}
		]
	},
	"comment_vote": {
		"1_15yeKu8zvCkB9igsQd6uCmvp6v43X36kNf": 1,
		"37_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"91_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"8_1BsusbGKX6JotDgsF1KBebHSZJA7Hd9mGs": 1,
		"155_168qV1Xxp2EyszrzdECLUwXrn9wGYjDdar": 1,
		"81_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"7_127XxNDivWJX4hUWTHGSsiW1xxczYp8cWu": 1,
		"205_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"41_1P1baCe1LLjror4CZjChWFy7D7cVWyPL83": 1,
		"8_19Qid9uyfWCTmx2cUpDboEKCscRd4fRWrL": 1,
		"5_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh": 1,
		"1_15vucp19CsYjbEqN1gbkC3TwyAHSTp98hh": 1,
		"1_12Yr2XxxBj7UKPFc6rJUKYJesfVVujHSRc": 1,
		"5_1NLAnBb51JvFQnVY7G6WDDnhY35knso5yo": 1,
		"95_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"107_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"13_1ENvPHLeuUKJAWsup9tL9C1mdZeb1ycjp8": 1,
		"314_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1_1CFfRvTwXCAaWEddZBAt3e5zEjrGMno6UT": 1,
		"169_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"228_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"237_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"247_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"91_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"103_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"28_14mSHL2TBcqcLNcfpmg5jyGVS9RZia3FiX": 1,
		"20_1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7": 1,
		"26_17mM4YqSx7nMkYcePZB2GWcJBzkogWpqA1": 1,
		"132_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"76_1EAD2zXkzgJf6M7xQ4jG5FHCxUTez9NJJ4": 1,
		"288_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"263_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"17_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"75_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"299_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2_18rz2oX4d7T1rwgmFzmXCnkvpNeDy1xyW4": 1,
		"18_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1,
		"1_1N76dkP8zdrNRETTYcs4CtxYdCNGcp6iqK": 1,
		"50_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": 1,
		"26_13CFz29UuNbUx54HmLqQBfxPQNN2FmfdAq": 1,
		"733_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"14_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE": 1
	}
}