{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1,
			"title": "TEPA (metatv) est mort",
			"body": "RIP.\nhttps://www.youtube.com/user/MetaTVofficiel/videos?view=0&sort=p&flow=grid",
			"added": 1573851902
		},
		{
			"topic_id": 2,
			"title": "4 ans de prison ferme pour le militant anti-pédocriminalité Stan Maillaud ",
			"body": "L'ancien gendarme Christian \"stan\" Maillaud, devenu lanceur d'alerte au sujet des réseaux pédocriminels, vient d'écoper de quatre ans de prison ferme au tribunal de Saintes. Tandis qu'aujourd'hui en France, les pédomanes prennent très régulièrement du sursis avec la clémence des magistrats et la vicieuse notion de consentement des victimes, Stan Maillaud se retrouve quand à lui mis aux fers pour avoir voulu enquêter sur les abominations...\nLe procès qui s'est déroulé le 31 janvier s'est conclu par une marche vers la prison de Saintes suite au délibéré.\nCompte-rendu du procès : prochainement sur Pedopolis.com\n\nProcès en appel : prochainement à la cours d’appel de Poitiers\n\nRappel : Joël Le Scouarnec est le pédocriminel aux 350 victimes (minimum), chirurgien à Jonzac et en Bretagne, il est incarcéré dans la même prison que Stan Maillaud à Saintes. Il sortira de prison probablement avant Stan Maillaud.\nLiens clearnet: \nhttps://www.agoravox.tv/tribune-libre/article/apres-proces-de-stan-maillaud-a-la-84790\nhttps://www.youtube.com/watch?time_continue=1&v=IXEy6phhs5w&feature=emb_logo\nhttps://www.youtube.com/watch?v=KvFDcHn5ltg",
			"added": 1580824427
		},
		{
			"topic_id": 3,
			"title": "META TV - Francis Cousin - Pour comprendre l’œuvre de Karl Marx",
			"body": "Vidéos censurées de Youtube (chaîne du défunt TEPA censurée).\n\n\nhttps://ipfs.globalupload.io/QmVP9FdjvqbNXEMQKyuTtnTtKoybbeEN85qCgndSXPBHyj\n\nhttps://ipfs.globalupload.io/QmfLz87jrnqkKoBhDKARcSnbDkkvpM2RzRxxsNRMzJmaNK\n\nhttps://ipfs.globalupload.io/QmVki1Z7Z4FBqdDhjFo3su5S5PofoLQm4AJ7Zs3r7zUDtg\n\nhttps://ipfs.globalupload.io/QmWi7uYNsSidQyphHrxQpBCJdV94JK3JvS4PkrHQJf3fG5\n\n\nhttps://www.youtube.com/c/Aufhebung/videos\n\n\n",
			"added": 1595792743
		}
	],
	"topic_vote": {},
	"next_comment_id": 21,
	"comment": {
		"1_13eeXNBJGKwigVYRxwb84VnS6adJ8o2BXx": [
			{
				"comment_id": 1,
				"body": "C'est pas mal pour avoir des infos sur le moyen orient. Quand les médias récitent leur propagande habituelle. ",
				"added": 1565532367
			}
		],
		"9_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 2,
				"body": "Ecoute, la diversité, c'est la nouvelle France. Toi, tu es la france rance, la vieille france. C'est normal que l'on te charge à mort pour les impôt. ",
				"added": 1565876942
			}
		],
		"6_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 3,
				"body": "> [pourlafrance](#comment_3_1EFj6nP5R6sojS54fGXu6ZcgcXRZCiS9mw): Ah les enculés de CRS de Macron... Que vont-ils dire à leurs enfants quand ces derniers n'auront pas de retraite??? On ne les voit pas matraquer autant dans les cités! Quand ce sont des bougnoules, ils ne doivent rien faire.. Ils feraient mieux de se rebeller ces abrutis\n\nLes policiers ne sont intéressés que par leurs intérêts directs personnels. Leurs primes, leur grade. Ils n'en ont rien à foutre des classes laborieuses. 80000 flics (40000 CRS + 40000 policiers) ont tapés sur les gilets jaunes. Quasiment aucun ne s'est rebellé. Ils ont eu de bonnes primes. \nPetite anecdote, à Athènes, c'était les escalves qui opéraient le rôle de policiers. En effet, les citoyens libres ne se rabaissaient pas à effecter la tâche de flic, qui était considérée comme une infamie. Source clearnet: http://www.cliohist.net/antique/grece/class/cours/chap7.html",
				"added": 1580825042
			}
		],
		"1_1L1eZF78D44Lv2HtmxcKMXrYPAHA1KUkfW": [
			{
				"comment_id": 4,
				"body": "> [thetruth](#comment_1_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): BITCHUTE est malheureusement une opération militaire (CIA, MOSSAD, ZIONIST) comme GOOGLE, YOUTUBE etc.Same same but different ;-)\n\nEn effet, Bitchute censure, faites quelques tests de vidéos sulfureuses, et vous verrez que vous tomberez sur une page du genre \"vidéo censurée dans votre pays\". \nNan sérieusement, la seule solution, ça reste le web décentralisé. ",
				"added": 1580825444
			},
			{
				"comment_id": 18,
				"body": "> [theredmage](#comment_1_1PA1rtXT7NGujaer2Q3cqPJcEBosC3yeqe): \n>Peertube\n\nJe n'aime pas trop les platformes semi-décentralisées comme peer-tube. Pourquoi ne pasa aller jusqu'au bout avec une platforme totalement décentralisé?\n> [heyuwah](#comment_1_18fqELjSG8r1KQw9KibFiv31mtRNzZnXg8): Pour du décentralisé, je vous propose de jeter un oeil sur LBRY.Jusqu'ici, ça me semble correct.\n\nLBRY est plein de vidéos super intéressantes qui ont étés supprimées de Youtube et autres. Ce qui est bien, c'est que LBRY a un site, mais aussi une application, qui apparemment ne peut pas être censurée, et open source.  Je me demande si les développeurs peuvent procéder à une censure du contenu sur l'application. \nSinon il y a IPFS, mais je n'ai  pas encore vu d'applications permettant d'accéder au contenu. Juste des sites web qui renvoient au contenu. ",
				"added": 1590179970
			},
			{
				"comment_id": 19,
				"body": "> [gotexx](#comment_5_17Z8aUjWp2GECRJJUr4NXvE8byWXg68s8A): En quoi Peertube est semi-centralisée ?\n\nBen je connais pas trop mais tu as des instances, hebergées par des volontaires,  et chaque instance est connectée aux autres. En gros tu n'as pas autant de noeuds que d'utilisateurs. C'est pas comme les torrents ou chacun seed et leech. Peertube semble assez facile a censurer. Si tu censures toute les instances, c'est fini. Alors que pour du vrai pur peer to peer, comme LBRY,  il faudrait literallement censurer tous les peers, ce qui est virtuellement impossible. La seule attaque possible serait de bloquer le flux au niveau du FAI. ",
				"added": 1590764783
			},
			{
				"comment_id": 20,
				"body": "> [1plus1](#comment_1_1BGo4on9K4yQ18eAg2PaGXZ6oCQLb2oXpd): C’est payant de publier des vidéos ?\n\nHélas oui. Il y a IPFS, mais c'est limité à 25 MO pour du gratuit. Pour plus de contenu il faut payer aussi, mais de ce que j'ai compris c'est un forfait illimité. Genre tu paie une fois, et après tu peux uploader autant que tu veux dans la limite de 100 MO. \nAprès le problème de Zeronet c'est que c'est gratuit, mais il n'y a pas grand monde qui veux seeder...\nLe P2P ne marche que lorsqu'il y a un grand nombre d'utilisateur. Comme les torrents. C'est le paradoxe, c'est non censuré et gratuit, mais il faut être nombreux pour que ça marche, et vu que ça commence peut nombreux, les gens préfèrent des alternatives payantes mais plus efficaces. C'est une des raisons pour lesquelles freenet et Zeronet sont des semi-échecs. Personne ne veut seeder beaucoup de videos. Zeronet aurait du, à mon avis, demander aux utilisateur d'allouer une quantité définie de disque dur et de bande passante, un peu comme freenet, et ensuite stocker divers contenu dans cette espace \"commun\". Un peu comme freenet. Le problème de freenet était sa lenteur, et surtout le fait que les données s'effaçaient après un certain laps de temps, si le fichier uploadé sur le réseau n'est plus régulièrement consulté. \nIPFS semble être à mis chemin entre le système de serveur central, et le pur peer to peer. C'est des noeuds qui hébergent le contenu, avec redondance je crois.  Ils vont bientot sortir une coin (Filecoin), qui permettra de motiver les noeuds à héberger du contenu. Donc oui, ce sera payant, mais probablement pas beaucoup. De plus, il y aura je crois un moyen de miner la pièce filecoin, et aussi un système de reward, du genre si les gens aime ta vidéo, ils peuvent te donner des coins, ce qui te permet d'en poster plus. \nJ'aime pas trop le système de torrent pour les vidéos, car il faut systématiquement beaucoup de seed pour que ça marche. Or certaines vidéos intéressantes ont du mal à maintenir leurs seeds au fil des années. ",
				"added": 1595807336
			}
		],
		"2_19m6uJTaNtvf8AKht82FE8ctxMYaBXcu4": [
			{
				"comment_id": 5,
				"body": "Il n'y a pas de virus.\nhttps://lbry.tv/@Merovingian:6/david-icke-covid19-interview-banned-by-youtube-:e\nDe plus, vous vous trompez concernant les marionetistes. Le système créer les marionetistes, et non pas l'inverse. Il faut faire attention à ne pas se faire avoir par une inversion de la causalité. Abolition de l'Etat, de l'argent, de la valeur d'échange, de la propriété privée des moyens de production, de la hiérarchie. C'est ça, ou ça continue. ",
				"added": 1586356333
			}
		],
		"1_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 6,
				"body": "https://collections.nlm.nih.gov/catalog/nlm:nlmuid-101438298-img\n\nQuoi t'es pas convaincu? \n\n> [vikingharvester](#comment_1_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav): https://www.infowars.com/la-doctor-uses-hydroxychloroquine-and-zinc-to-treat-covid-19-patients/\n\nDécevant je pensais que les pays nordiques étaient plus libres. Mais bon pas très étonnant non plus. ",
				"added": 1586450951
			},
			{
				"comment_id": 7,
				"body": "> [vikingharvester](#comment_7_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav): \n> je suis curieux en quoi c est pas etonnant pour toi?\nBen étant donné que les pays-bas, pays nordique, ainsi que la suède ne sont pas confinés, je pensais qu'ils étaient un peu moins moutoniers. \nMais bon le NWO est un peu partout c'est clair. ",
				"added": 1586806602
			},
			{
				"comment_id": 8,
				"body": "Vidéo sur la 5G, la maladie du Corona, la 5G, le hoax des Virus à l'origine des maladies:\nhttps://lbry.tv/@psychoNWO:9/FAKE-Corona-Virus---5G-:5",
				"added": 1587142235
			}
		],
		"1_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 9,
				"body": "Plutôt pour. Mais bon il est vrai comme le dit Francis Cousin que cela ne solutionera aucune crise puisque  le système dans son intégralité est moribond. Même si la gestion du système est en  démocratie directe, si ce système est mourrant, une gestion en démocratie directe n'y changerais rien. \nEnfin bon au moins ça éviterait les décisions les plus débiles prises par l'hyperclasse, du genre mariage pour tous, état d'urgence qui dure un an alors que le dangé était écarté, vaccinations obligatoires alors que le peuple n'a rien demandé,  quarantaine de deux mois obligatoire même pour les bien-portants pour une grippe, déploiement de la 5G alors que aucune étude n'a été faite et que de nombreuse personnes critiquent les dangers sur les humains, les oiseaux (cryptochromes) et les abeilles, etc...\nC'est sur que la (((démocratie))) représentative est le pouvoir total de l'Etat profond. La démocratie directe en revanche laisserait une marge de manoeuvre au peuple, et pourrait aussi le responsabiliser, contrairement à actuellement, où les peuples occidentaux sont des bébés qui écoutent et applaudissent le berger qui les conduit à l'abattoir. \nMais encore une fois, c'est l'intégralité du système Capitaliste qui entre en phase terminale (baisse tendencielle du taux de profit). Donc n'importe quelle économie politique, quelle soit fasciste, nationale socialiste, royaliste, républicaine, Bolshévique,  ou même démocratie directe, peu importe, rien ne pourra sauver le Capital. Les carottes sont presques cuites, et il faudrait plutôt songer à un nouveau mode de production. ",
				"added": 1588447621
			}
		],
		"2_1FMwKKEcagXLLH4zWJf7BbKnFCL7eusmav": [
			{
				"comment_id": 10,
				"body": "Sérieux les oiseaux et les abeilles ne supportent pas la 5G. Cela perturbe leur cryptochromes (sorte de boussole), et ils se mettent à tomber au sol et mourir. Si on met la 5G partout et internet par satellite déployée de manière massive (Starlink: 30000 satellites), il n'y aura presque plus d'oiseaux. C'est ça que vous voulez pour le monde, des vidéos 4K, directement sur le smartphone, mais plus de nature? C'est vraiment nécessaire de regarder des vidéos en ultra HD sur son smartphone ou sa tablette? Moi en tout cas, c'est pas suffisant je sais, mais je reste en 3G sur mon smartphone. De toute façon je regarde jamais de vidéos dessus, et en 3G ça consomme moins de batterie. Toutes ces ondes sont en train de modifier la résonnance de Schuman de la terre. L'hyperclasse parle du (((réchauffement climatique))) tout le temps, mais jamais des ondes qui sont déployées depuis la radio en 1918. Normal: inversion systématique du vrai et du faux, du bien et du mal, de ce qui est dangereux et de ce qui est inoffensif.",
				"added": 1588448767
			},
			{
				"comment_id": 11,
				"body": "> [f0gxr39100]\n\nLes ondes 5G à 60 GHz ont un effet sur les molecules d'oxygène qui absorbent 98% de l'énergie de l'onde. Il est possible que cela rendent alors la molécule d'oxygène plus difficile a absorber par l'hémoglobine, d'où les effet de difficulté respiratoire à Wuhan, à Milan, et sur le paquebot Diamond Princess, endroits massivement équippés de la 5G. \nUne autre possibilité est que à 60GHz, la molécule de O2 se transforme en O3 (ozone), et que l'ozone étant toxique à la respiration, vous imaginez la suite. ",
				"added": 1588524894
			},
			{
				"comment_id": 12,
				"body": "> [f0gxr39100](#comment_23_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ): Bonjour à tous,\n> à lire pour avoir des informations clairs et sérieuses sur le sujet concernant la France :https://www.anfr.fr/international/negociations/grands-dossiers-dactualite/5g-mobile/L'ANFR ne fait pas du tout mention de projet d'exploitation de la bande 60 GHz, mais \"peut-être\" de celle des 70 GHz dans  le futur.73\n\nLe fait que la bande ne 60GHz ne soit pas utilisée commercialement, ne veux pas dire qu'elle n'est pas utilisée à des fins militaire, à partir des antennes 5G,   par exemple pour d'éventuelles plans de réduction de la population, contrôle des foules, ou d'individus ciblés, création de maladies (Corona?), fabrique du consentement en rendant l'individu plus maléable etc...\nDésolé d'en apprendre à certains, mais oui, il existe un Etat profond en France (et ailleurs). Ca fait 50 ans qu'ils étudient intensémment les ondes, et depuis leur découverte qu'ils s'y intéressent. L'état de leurs connaissances est vraisemblablement très en avance par rapport à ce que la science \"officielle\" nous présente.  Si la science grand public (ouvrage magnétobiologie), commence à peine a découvrir des liens entre les ondes et les tissus vivants, ainsi que la disparition des abeilles et des oiseaux (études faites sur les cryptochromes), il est évident que la science militaire a connaissance bien plus en détail des effets de ces ondes, notamment sur le corps humain. ",
				"added": 1588628843
			},
			{
				"comment_id": 14,
				"body": "> [fallfield](#comment_5_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX): \nou dans les zones blanches. \n+1. La 5G est vraiment mauvaise. Et je préfère vivre dans un bled paumé avec un ADSL pourri que en ville avec une quantité d'onde astronomique. \n\nC'est probablement le plus grand scandale sanitaire depuis le tabac. Et contrairement aux pesticides, on ne peut pas y échapper. \n\n",
				"added": 1588826900
			},
			{
				"comment_id": 15,
				"body": "> [fallfield](#comment_7_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX): A mon avis, moindre que les technologies nucleaires (tchernobile, fukushima, etc) ou que les technologies de manipulations du vivant (OGM), avec les antennes, il suffit de les eteindre pour contenir les dommages.\n\nCertes, mais elles seront éteintes quand? Dans de nombreuses décennies, dans un monde post Capitaliste. En attendant, elles vont faire disparaître les oiseaux, les abeilles, et affaiblir et tuer des millions de gens. ",
				"added": 1588893372
			}
		],
		"4_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 13,
				"body": "Il n'y a pas plus inversé qu'un procureur. ",
				"added": 1588826663
			}
		],
		"6_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 16,
				"body": "Définition: Le capitalisme désigne un système politique et économique reposant sur la propriété privée, notamment des moyens de production, le libre échange sur des marchés et la libre concurrence.\n\nCroire que le marché n'est pas responsable est une illusion. Le cronie -capitalisme n'est pas un capitalisme dégénéré, mais le devenir naturel du Capitalisme dans sa phase terminale.  Il ne pouvait pas en advenir autrement. Surtout si on prend en compte le fait que le Capitalisme conduit naturellement à la concentration extrème du Capital, et la création d'une hyperclasse de banquiers, services secrets, multinationales, armée. \nIl n'y a pas de corruption du Capitalisme. Le Capitalisme est la corruption. Un système basé sur la propriété privée des moyens de production, donc à l'exploitation de ceux qui n'ont rien d'autre à vendre que leur force de travail, par les propriétaires des moyens de production, aussi appelé la classe Capitaliste. A partir du moment où la société est divisé en 2 classes (Capitalistes/prolétariat), il est logique qu'une classe essaie de dominer et d'asservir l'autre. La classe Capitaliste tire littéralement sa force de l'exploitation de la force de travail de milliards de travailleurs, qui n'ayant pas eux même de moyen de production, étant sans moyens de production, est obligée de vendre sa force de travail aux Capitalistes en échange d'un salaire, pour pouvoir se loger et se nourir. \n\n>Je me trompe ou vous souhaitez une economie centralisee et plannifiee (qui tournera au totalitarisme authoritaire a l'expression de la moindre dissention avec le programme)?\n\nNon. Pas une économie centralisée et plannifiée. Pas d'économie du tout. Abolition de l'économie. Abolition de la société de classe. C'est ça, ou on continue le cirque dont tu parle: vaccins, 5G, etc... On continue? ",
				"added": 1588982355
			}
		],
		"2_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": [
			{
				"comment_id": 17,
				"body": "Pas vraiment de sources d'information. Je ne me renseigne plus que sur les boards, type 4chan. Je m'en fous de la propagande médiatique, même \"dissidente\", qui reste dans le giron,  la périphérie de la propagande mainstream. Cela reste de l'économie politique. Vouloir réformer un système qui est en phase terminale, et que rien ne peut sauver. \nSinon, vite fait:\nAgoravox.fr et agoravox.tv\nLesmoutonsenrages.fr\nvoltairenet.org\nEdit: J'oubliais la chaine youtube Guerre de classe, une des rares chaînes youtube qui a du sens. Mais les vidéos sont à un rythme mensuel. Donc s'il se passe un \"évenement\", vous devez attendre quelque semaines pour avoir un éclairage sur le sujet. Bon c'est pas plus mal, en l'état actuel des choses, rien ne presse, et au moins ce n'est pas du spectacle. ",
				"added": 1589131219
			}
		]
	},
	"comment_vote": {
		"17_1FSfeha2tbwLR8Y7md6z2XfkCeYJPgdLnJ": 1,
		"5_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": 1,
		"2_1P7LTsBAh2TppwNAJY3iK5Zori5cxaLors": 1,
		"1_18fqELjSG8r1KQw9KibFiv31mtRNzZnXg8": 1,
		"2_18fqELjSG8r1KQw9KibFiv31mtRNzZnXg8": 1
	}
}