{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1528776246_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 1,
				"body": "but then they wouldn't be progressives... they would be one of the good guys...",
				"added": 1528851888
			}
		],
		"1528337779_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "Generating wealth is important. It is how we pulled ourselves up out of the mud as a species. Competition is important it is how we as a society separate the wheat from the chaff. Greed is important, it motivates us to compete and generate wealth which are important for previously mentioned reasons. These are all virtues. However consumption is a vice. Living on debt and beyond our means is a vice. Being greedy to a point that is unbalanced is a vice. \n\nThe life style you describe of living off of 200 dollars per week is nice. Of course it is nice. That is because it is selfish. Selfish things usually feel good. \n\nIt sounds like you overworked yourself, which is also not good, that sounds like a lack of selfishness. Before you were not being selfish enough now you are being too selfish. Life is all about balance. Find balance and find happiness.",
				"added": 1528852675
			}
		],
		"1529456113_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 3,
				"body": "You do realize that these are UNDOCUMENTED immigrants. No one knows which children go with which parents. One would need DOCUMENTS in order to know that. Should the immigration officials just hand children over to anyone who says that they are the child's parent? Does that sound wise to you? No, well then some sort of separation period would be needed in order to figure out whats what since we cant just figure it out by looking at the documentation. You didn't think of that did you. You waked out ideologues never use your fucking heads. It's all just emotion and outrage. You are going to get us all killed before it is all over.",
				"added": 1529590715
			}
		],
		"1529820459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 4,
				"body": "You can really tell at the end of the second clip that the wachowski brothers were talking to us, telling us that the matrix is real, that we live inside of it, that we need only to see it for what it is in order to escape it, and, of course, giving a big f you to the cryptarchy.",
				"added": 1529880532
			}
		]
	},
	"comment_vote": {
		"1_1EijxsAumeeuw6ojPjHc9KKwUfH6ryhbJc": 1,
		"3_1EijxsAumeeuw6ojPjHc9KKwUfH6ryhbJc": 1
	}
}