{
	"next_topic_id": 8,
	"topic": [
		{
			"topic_id": 1590742559,
			"title": "Don't upload too much files together on IFS!",
			"body": "After i uplouded hundreds of mp3 in this zite my old channel uploading become slower and slower until it broke. I opened a new channel with a new zeroid to resolve this problem (i will upload groups made of only ten files in future, awaiting for complete peer contacting every time before uploading the next group):\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:15f1_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz",
			"added": 1590742558
		},
		{
			"topic_id": 1596356568,
			"title": "Thanks Storymaniac!",
			"body": "I'm testing your zites syncronite and IFS mobile... and works great! By using syncronite i've almost eliminated my sync problems and IFS mobile is good also on desktops! \n\nI also added syncronite to my seedboxes and trackers...this should improve all the network!\n\nThere is a plan to further develop IFS mobile? (i heard that original IFS was abandoned) Many asked me for a function to create vid and audio playlistes",
			"added": 1596356566
		},
		{
			"topic_id": 1603655918,
			"title": "Coronavirus and China",
			"body": "Can i ask here to chinese users what is the Covid situation on china? Is True that there isnt a COVID widespread like in Europe and USA or this is only propaganda?",
			"added": 1603655915
		},
		{
			"topic_id": 1604495423,
			"title": "new 0net-preview blocklist",
			"body": "My previous version of my blocklist broke, because of this i created a new one. you can add it to your client by using this URL:\n\nhttp://127.0.0.1:43110/1DcASQRfEQbXRW8zk2fLse9bZrZ5pheof4/\n\nThis list will be added to my proxy and my seedbox to block illegal content on it. Please report to me (via zerotalk or zeromail) any illegal stuff/user that you will find on https://0net-preview.com. In this proxy also the following blocklistes are enabled (you can contact also these users if i'm offline):\n\n-Kaffie's spamlist\n-MOAB (storymaniac)\n-untrusted blocklist (oncatcoaster)\n-nominer (thunder33345)\n-chinese spammers (null)",
			"added": 1604495419
		},
		{
			"topic_id": 1605013344,
			"title": "Creating new trackers for zeronet",
			"body": "I see that My seedbox and my proxy, that have also the tracker plugin Enabled,  work also as tracker perfectly... But many other trackers are offline for me and this can cause the difficult sync of the network reported in last days. Actually loading new files on Ifs is useless because often the streaming dont work. And I believe that creating many new trackers by using different vps with different IP addresses can help the entire network. My plan is to create At least 10 new trackers by using some cheap vps. What do you think about this? Do you suggest me some hosting companies around the world that offer cheap vps?",
			"added": 1605013339
		},
		{
			"topic_id": 1606980382,
			"title": "Nofish please update zeronet bundle!",
			"body": "If you download zeronet from https://zeronet.io you Will get the 0.7.1 Version of the software. Can you update to the last one?",
			"added": 1606980376
		},
		{
			"topic_id": 1607096892,
			"title": "Copyleft music and videos on IFS",
			"body": "I uploaded on IFS many copyleft mp3s and vids, freely downloadable and playable for everyone! Give you a look, you will not be disappointed!  By listening these songs you will understand how the music industry is unfair with many less famous artists to privilege some few very rich ones! We should show to the world that a free network like zeronet is not only illegal content (that can be blocked by single honest users), but also a way to give justice to many people \"censored\" in clearnet by social medias and filter bubbles! \n\nCCS 1: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g\n\nCCS 2: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz\n\nCCS 3 http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1HqiP9ViLcqETTvaPV8suLs1fJz6SEfHmf\n\nCCS 4: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1DzPfp7v56y2BkWwmyU5jkcwRdYHDRauCP\n\nCCS 5: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1Be5WM8C9uMQmCPfFMbwHBdusYy63MFezv\n\nCCS 6: http://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:channel+id:15f1_1MFcfz6wNtEmFcKEHgJ2DBWGVCZM4tqAtv",
			"added": 1607096885
		}
	],
	"topic_vote": {
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1
	},
	"next_comment_id": 46,
	"comment": {
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 1,
				"body": "These censor-wars are simply hawful! None should decide what others can view or not for all people of this world! If you want to fight fake news you should inprove public schools instead use the ban hammer! Only in that way we can guarantee the freedom of all and stopping fake news...but in that way the elitè can't control masses!\n\nBecause of this we need better schools and decentralized networks like zeronet!",
				"added": 1590742277
			}
		],
		"1595606009_191qyhaRxXEx1bdtG65iQvFddtXBjgo6j3": [
			{
				"comment_id": 2,
				"body": "IFS mobile works great for me also on PC!\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/",
				"added": 1596356348
			}
		],
		"1596356568_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_2513_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're welcome. [...]\n\nneither am i...maybe i should study! :)",
				"added": 1596394872
			}
		],
		"1600266690_13sQUup3LrR7Y6E7eXxGLZzMVkvK2fyWKG": [
			{
				"comment_id": 4,
				"body": "I can create some h24 tracker nodes by using some cheap vps. In these nodes i can Host ifs without any file only to make the sync of the file list more efficient and i can use syncronite.  All nodes Will have a clearnet IP and a tor IP. Will be located in different countries and by this any pc on the network should have the complete file list. This should work?",
				"added": 1600686165
			},
			{
				"comment_id": 5,
				"body": "I created a new vps vith a canadian IP address + tor and when i tried to Connect to ifs i saw only some of the last files published. The site sync perfectly when i activated the tracker function. Who had sync problem could repeat the test above? Maybe the problem is the low number of trackers Active in the network. If this is the problem i could manage other similar \"ifs trackers\" in different countries to fix this",
				"added": 1600716266
			},
			{
				"comment_id": 6,
				"body": "> [smashbuckler](#comment_5_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): First link is playing for me (Reverend Gary Davis), but last two links are not available for me to see.In console I have the error message: [...]\n\nI created a new tracker that maybe could fix this. Can you try to download the missed file?",
				"added": 1600716367
			},
			{
				"comment_id": 7,
				"body": "> [smashbuckler](#comment_7_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Nope, still the same error with loading spinner and console error. I even tried from my other machine with other identity and access point - still the same.\n\nMy vps sync when i enabled the tracker plugin. Maybe this can work also in Your machine. Could you try this?",
				"added": 1600798768
			},
			{
				"comment_id": 9,
				"body": "> [smashbuckler](#comment_11_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt): Do I need to additionally download this plugin from somewhere? If so, where? I go to \"Plugins\" section, where I can see the togglers of all the plugins available to me. I can see \"AnnounceBitTorrent\", \"AnnounceShare\", \"AnnounceZero\" and so on, but nothing with the title \"tracker\". [...]\n\nEnable announce bittorrent. This should fix... For me worked is not an \"official\" fix. I think you can disabile it after correct sync",
				"added": 1600969265
			}
		],
		"1601116187_1PyrAjbZiHyfW7jSWeUpDPSeMU7sAJ5HSs": [
			{
				"comment_id": 10,
				"body": "I prefer ifs. Kopycate can be the best option but the auto-preview can pose a treat if you share thumbs of illegal stuff",
				"added": 1601190497
			}
		],
		"1603127653_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 11,
				"body": "Im agree with this. Maybe is a good idea also to add some famous zites created by The community like syncronite ifs big kopikate zerotalk++ zerotorrent and millchan",
				"added": 1603131299
			}
		],
		"1603122234_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 12,
				"body": "You tried to search for a specialist to help you? Maybe this could help. Other helps are walking between the nature ot thinking that Your work here is useful (maybe the big internet Will not thank you... But Im serching for a Developer to improve some zites here). If you want you can also talk with us! :)",
				"added": 1603131807
			}
		],
		"1603117313_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 13,
				"body": "You can Host Your video files on Ifs and link them in Your zite",
				"added": 1603132343
			}
		],
		"1603476273_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 14,
				"body": "Maybe we can create different zeronet installers that use different versione of zerohello and with others zites included  in home page (owned by us or created by other users different from nofish) that also uses different users manager from zeroid (for example tha kaffie Version). Im not a programmer but maybe this can be done easily. What do you think?",
				"added": 1603482506
			},
			{
				"comment_id": 15,
				"body": "> [gitcenter](#comment_1414_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): This simply does not work. Others have tried this. People have created forks, cloned ZeroTalk for different topics, etc. -- but no one uses them because https://zeronet.io references the official distribution, everyone links to nofish 'es sites, and he refuses to add any mentions of external services to ZeroHello.\n\nCan you publish some links to these forks here? Maybe i can give move visibilità to them by using my website and my proxy. Also another good idea can be publish the source code of these forks on github",
				"added": 1603485181
			}
		],
		"1603504012_1CNbp1ekMfWRzS6QeEYMoD9UxHgmnwznb9": [
			{
				"comment_id": 16,
				"body": "You can run zeronet on a dedicate server/vps hosted near you or try to access zeronet via tor. This should fix this. You can also use my proxy https://0net-preview.com",
				"added": 1603517140
			},
			{
				"comment_id": 17,
				"body": "> [mentos](#comment_15_1DruyFehQkemWTK5XKuFRpXb3tz89FFaVK): Off-topic, how can you integrate TLS to ZeroNet? I've really wanted to do that, because I want to use ZeroNet from my dedicated server, but found nothing.\n\nIm using caddy server",
				"added": 1603558371
			}
		],
		"1603608731_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 18,
				"body": "In my opinion the best option is to develop zeronet with a Linux like approach, where multiple distro-like Versions owned by different devs could keep the project alive in case the main dev leave the project or dont want to add some features. At first in my opinion we should create different forks of zerohello with more zites. These forks must be included in different installers created for different usages. The Second things to to is to fix the zites already online (for example ifs needs the features to seed specific Channel or the ability to Switch from download and streaming) and lastly we should also fork the core of the project, but i my opinion we must keep the retrocompatibility with the original project (for example using plugin). When an user Will want to access a zite that require a specific plugin (like streamz) a specific webpage must inviate him to download the specific plugin/installers. Im not a programmer but i can publish these forks on zeronet's Wikipedia page and in my websites",
				"added": 1603614921
			},
			{
				"comment_id": 19,
				"body": "> [gitcenter](#comment_1433_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Please, do not fragment the network even more. Please, let's with one fork for now and split further only if it's really necessary.\n\nThere is no need of fragmentation. Different installers 99% cases Will have only different zites on zerohello to promoter them. Like Debian based distros that are always Debian with some different software. For example some users wil be happy to access millchan where  others prefer ifs. While who want to use zerotalk without limita Will want zerotalk++ This is not a Battle between different Versions but only a strategy to promoter more hidden zites",
				"added": 1603615121
			},
			{
				"comment_id": 20,
				"body": "> [gitcenter](#comment_1434_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Okay, no problem then -- if these installers all use the same core code and just have some plugins enabled/disabled.\nCorrect. This is my idea!",
				"added": 1603615327
			}
		],
		"1603893360_1Avzdjh9nPaxNw5XoJwQz3veJEYSxu1wfd": [
			{
				"comment_id": 21,
				"body": "Zeronet rule! :D",
				"added": 1603894029
			},
			{
				"comment_id": 22,
				"body": "Setting up a seed box Will help files to be seeded more efficently also when the seed box go offline because during the first upload you can reach more users in different time zones with an h24 node and because of this is more probable that Your zite Stay online. Big files like videos Will require a permanent seed box because not always someone Will see the entire vid on Ifs or kopikate. On millchan anyone can seed an entire Chan and this help seeding also without any seedo box. In my opinion if zites like ifs or kopikate Will have an option to auto seed an entire Channel or single vids without streaming them the network Will gain much more seeds",
				"added": 1603913648
			}
		],
		"1604219688_15HwpjShZKp2dpMuZqFaariQtJvMawYLVq": [
			{
				"comment_id": 23,
				"body": "Fork of zerohello with new launcher and fix connectivity",
				"added": 1604238684
			},
			{
				"comment_id": 24,
				"body": "> [schiz0@kxoid.bit](#comment_61_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): I agree with you\n\nThis is a good option... But in my opinion we should include zerotalk++ om zerohello",
				"added": 1604238826
			}
		],
		"1604751153_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": [
			{
				"comment_id": 25,
				"body": "I can confirm this problem.  the upload of new files on IFS often stop, almost always new IFS installations can't find all files published on the zite and lastly also zerotalk fails to sync, problebly because of the recent growing of the networks trackers are overloaded? Some time ago i tried to create a new tracker with syncronite to improve the sync...but i failed to obtain some results (my proxy and my seedbox already have the tracker plugin enabled).\n\nThis problem is due to an overload of the trackers or is a code problem? In your opinion i could fix this by creating a dozen of new trackers for the network? addind to zeronet a dht service could improve the situation?\n\nThe creation of this \"tracker network\" can be optimized by using different hosting companies for clearnet connections? (with different tracker ip addresses?)",
				"added": 1604866335
			}
		],
		"1605013344_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 26,
				"body": "> [xcape2net](#comment_799_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Are you aware of Syncronite ?\n\nIm using syncronite and this zite improve a bit the sync... But for me the problem persist",
				"added": 1605018768
			},
			{
				"comment_id": 27,
				"body": "I activated 3 new trackers on dedicate vps and i see an improvement of the sync and a ping time reduction in other trackers. Tomorrow syncronite should spread more the new trackers. Tell me if Your sync problems are fixed.",
				"added": 1605033054
			},
			{
				"comment_id": 28,
				"body": "> [xcape2net](#comment_801_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I won't ask what country you are in, because that would be an invasion of your privacy.  But, you may be in a country where the government intentionally blocks trackers.  If that is true, they will sooner or later block your new trackers.  I don't know, but you might have more success by using Tor bridges.  That is something to try if your government does block trackers.\n\nNo privacy violation. Im from italy.  I dont believe this whas an intentional Block but i my opinion was only an overload of the trackers. This can be demostrated also because the new tracker are consuming a large amount of bandwidth and now The sync for me is working perfectly",
				"added": 1605078737
			},
			{
				"comment_id": 29,
				"body": "> [xcape2net](#comment_802_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I have been noticing a growing number of ZeroNet users over the last couple of months.  Over 16000 peers were on line when I checked yesterday.  A few months ago, it was more like 3000-5000.  I wish I knew which zites the new users are on, because they are not on ZeroTalk.\nI think also ifs is used by many... But is almost impossibile to estimated the exact number of peers because any client sees a different number, anyway i see a Great increment of italian peers (from a dozen to an average of 60-70)",
				"added": 1605171473
			},
			{
				"comment_id": 30,
				"body": "I Notes that after creating my 3 new trackers the sync works but it becoming slower... Maybe more volunteers should create new trackers!",
				"added": 1605173107
			},
			{
				"comment_id": 31,
				"body": "> [xcape2net](#comment_803_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): What is ifs?\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/",
				"added": 1605199770
			}
		],
		"1605473599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 32,
				"body": "We should increase the number of trackers and the content of the network as soon as possible. Probably in the near future we Will see a mass migration to decentralized networks like zeronet and we should be ready to welcome these newcomers. We can ask the pirate crews and partes to open new trackers and create here new bunkers for their activities? The 8chan community here is still alive?",
				"added": 1605515382
			}
		],
		"1605447723_17MgqBZ2gQDGo47QBfgfmVdNNW8xV4HShY": [
			{
				"comment_id": 33,
				"body": "No peers",
				"added": 1605515447
			}
		],
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 34,
				"body": "Old news. But now 08chan is Active on zeronet?",
				"added": 1605533647
			}
		],
		"1605530541_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 35,
				"body": "Zeronet used without always  tor mode is not anonymous as reported many Times here and in its website. If some stupid People did illegal things and didnt use Tor is not a problem of zeronet",
				"added": 1605533788
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 36,
				"body": "Actually ifs is the only platforn that guarantee a very good audio streaming and a good quality video streaming behind tor and full decentralized. Probably most YouTuber want Money and because they  think that YouTube is a way to gain money, and here there is no Money, they dont want to Stay here.  Anyway we are the last line of defense for anyone is oppressed by strong powers and anyone is censored by filter bobbles like most creative commons artists. Actually this is one of the few places where anyone is really free to talk to everything and share anything. More the clearnet become oppressed and controlled  and more this place Will gain visibility. We should be ready for this, the winter is coming....",
				"added": 1605794838
			},
			{
				"comment_id": 37,
				"body": "> [ryuyu5](#comment_20_1F4duoki9FzLS8ck49rNWYv5tYtCru96XS): On the ZeroNet You may want to visit the zitehttp://127.0.0.1:43110/18Pfr2oswXvD352BbJvo59gZ3GbdbipSzh/ [...]\n\nPersonally i prefer ifs to kopy kate because:\n\nNo video preview that can be a danger if someone upload illegal things\n\nIfs allow also audio streaming and file sharing",
				"added": 1606139099
			},
			{
				"comment_id": 40,
				"body": "> [caropc1v25](#comment_14_1MSprhw31RwydrtYRHGJvbd5H9Lb2JsDxU): Do you know him Big Kopy Kate 2 http://127.0.0.1:43110/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD  ?\n\nThe same opinion from the other kopy kate",
				"added": 1606333733
			}
		],
		"1606272311_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 38,
				"body": "To create a tracker Simple Enable the tracker plugin in a zeronet client hosted on a vps or dedicate server 24 h 7d uptime",
				"added": 1606318037
			},
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_2721_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That is incomplete information. I want to know how to make a .onion tracker.\n\nMmm... Maybe you must only torify all connection? This should work? Anyway torified clients should connect also to clearnet trackers and there isnt any risk managing a tracker",
				"added": 1606329278
			}
		],
		"1606980382_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 41,
				"body": "> [sword000000](#comment_25_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Which operating system?\n\nI think all release. Sure Windows and linux",
				"added": 1607019414
			},
			{
				"comment_id": 42,
				"body": "> [styromaniac](#comment_2744_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): https://github.com/HelloZeroNet/ZeroNet/issues\n\nThanks!",
				"added": 1607019431
			},
			{
				"comment_id": 43,
				"body": "> [sj29msn5kz0ldmn](#comment_16_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): what kind of question is that? Mac and Windows are proprietary malware, so only Linux is worth spending effort and time developing for. Also BSD, but maybe zeronet dont support it yet\n\nZeroNet is written in python. Multiplatform",
				"added": 1607033856
			}
		],
		"1607096892_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 44,
				"body": "> [schiz0@kxoid.bit](#comment_79_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): I think it could be useful a sort of user/channel feed\n\ni created many channels because after uploading hundreds files on a channel the newer uploads broke. Only the last channel will gain more music (if i will not forced to create a new one for the same reason)",
				"added": 1607101910
			}
		],
		"1607816193_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 45,
				"body": "> [styromaniac](#comment_2794_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): This wasn't a problem just today. It had been a problem long before, so lets not point fingers.\nZeroNet suffers of sync problems some time ago due to the lacking of trackers. Now this should be fixed but sometimes also new trackers could fail due to eccessive overload",
				"added": 1607850064
			}
		]
	},
	"comment_vote": {}
}