{
	"posts": [
		{
			"id": "cc198278-9a0b-46a3-8b9a-3c45638e761b",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "323e4cef-1d65-4775-9635-dbf46b83286d",
			"body": ">Abortion. The idea is horrifying ....\nThe act is, too. Why are you invoking just the idea? Do you not want to get into those messy specifics, or pictures, or videos, for some unspecified reason? These are known things, and can be found by anyone willing to do even a modicum of digging.\n>But the universe is probably nihilistic. It doesn't care if humans live or die.\n>So forgive many of us from noting that we DON'T want such women to ever have children and that we DON'T want to support someone's unwanted nigger babies (as we now do with Floyd's left behind monsters).\nIs your english shit, or did you intend to make the argument \"hard vaccuum and inert matter don't care, so I should not be held to a higher standard\"?\nThat argument is retarded. I mean, trying to utilize that reasoning will actually retard your ability to reason. Your ability to reason, using this notion, will be diminished. It's nonsensical.\n\n>Short of civil wars to clear the culls or \"should have been culls\" - what would you have us do?\nHow about you leave them the fuck alone until one causes significant offense, and then judge the offender based upon his actual fucking actions, collectivist?\n\n>Humans are animals.\nCool story, let me know when the squirrels develop a space program.\n\n>Behavior is often inherited. This is an ugly truth to grapple with. But there is no escape.\n>often\n>no escape\nYou need to step past your cognitive dissonance, anon. Let me rephrase the shit you just wrote.\n>This is only a probability, and that is an ugly truth, so now I'm telling you that it is an absolute.\nSee how you slid from accepting reality to outright denying it? You even managed to initially phrase it as though a struggle took place, instead of a dismissal. As though significant intellectual effort had been expended, rather than the laziest dereliction of thought.\n\n>Planned parenthood allows defectives to self select themselves for slaughter.\nNo, because that baby isn't the person making the decision to self terminate. You've lumped that unborn infant in with someone else, and pretended the agency of both is equal - which is patently ridiculous. That baby is being terminated based on the decision of someone else. Which means, to reflect reality, we need to rewrite your statement.\n>Planned parenthood allows defectives to select others for slaughter.\nWell, that seems a bit less fucking noble, defective.\n\n>In light of recent events, shameful thoughts DO cross the public mind.\nIn light of Planned Parenthood existing for decades, and recieving taxpayer funding right up until the Supreme Court ruled that people with compunctions against abortion wouldn't have to PAY TAXES if abortions were being funded with said taxes, shameful thoughts have been in the public mind for quite some goddamn time. The people who set up publicly-funded abortions in the US were voted in, remember, and the people that got appointed were appointed by those voted in.\n\n>Humans presently have no predators to cull the species.\nFifty million dead babies would suggest otherwise.\n\n>More ugly. Abortion is profitable for doctors. It's a quick buck. Wouldn't you like doctors to be subject to such temptations so you can be sure to avoid such creatures?\nNo. I'd like it if doctors knew it was unacceptable to murder people. Similarly, I don't want my neighborhood to have a violent pedophile living in it. I don't care if \"everyone knows\" he's a violent pedophile, I care that he's free to hang around where kids play, instead of being institutionalized or otherwise removed from society, when it's already established that he, personally, through his own actions, is a violent pedophile.\nCreating a society that accepts certain forms of murder as legitimate doesn't create a society where such forms of murder don't take place. That society just invents new language to make the murder seem more palatable to addle-pated retards and otherwise reasonable people who don't have the time or inclination to think it through.\n\n>Kinda like knowing who not to hang around should the price of hamburger get too high?\nI wouldn't hang around you.\nYou're an abortion apologist, and putting forth the notion that knowing who's willing to commit abortions is a good indicator of who shouldn't be trusted.\nYour own argument is that you shouldn't be trusted.\n\n>This is valuable information. Could save your life.\nThis is garbage information.\nYou've supported the position of holding some people responsible for things others have done, and at the same time supported the position of NOT holding other people responsible for what THEY THEMSELVES have done.\nIt is the most agonizingly fucking stupid thing I've read today.\nIn fairness, I've only been up a few hours.\n\nThat's uncharitable. You did get one thing right.\n>More ugly.",
			"time": 1597354651300,
			"files": "[]"
		},
		{
			"id": "eab36e25-d7d2-4e1e-b191-72604faf80a8",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "323e4cef-1d65-4775-9635-dbf46b83286d",
			"body": ">>cc198278-9a0b-46a3-8b9a-3c45638e761b\n>cont'd\n>This is valuable information. Could save your life.\nThis is garbage information.\nYou've supported the position of holding some people responsible for things others have done, and at the same time supported the position of NOT holding other people responsible for what THEY THEMSELVES have done.\nIt is the most agonizingly fucking stupid thing I've read today.\nIn fairness, I've only been up a few hours.\n\nThat's uncharitable. You did get one thing right.\n>More ugly.",
			"time": 1597355289287,
			"files": "[]"
		},
		{
			"id": "8bce6f4a-88cf-4988-af55-c390a205b586",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "323e4cef-1d65-4775-9635-dbf46b83286d",
			"body": ">>e63c2807-b76e-4e3f-82a8-18a1849e0b02\n>(yawn) You are clearly one of those \"absolutes\" talkers with a right way and a wrong way to do everything.\nClearly. Are you one of those post-modernists, who insists reality is subjective, and so there is no right or wrong, and only that you feel ways about stuff?\n>Must be difficult to bend this messy world into your worldview?\nNot in the least. It's pretty much recognition of personal agency, combined with cause and effect. Reality supports it quite well, right out of the box.\n>Damn frustrating I would think.\nIt isn't, and given your intellectual lassitude, I'm not surprised you'd make that assumption.\n\n>Well, here's a bet.\nNo thanks. I don't believe you'd pay out, since you've already argued against personal accountability.\n>If most people saw this kid's rap sheet\nWhat a shock, the colloctivist appeals to popularity.\n>they'd at least question the efficiency of this late term abortion (16yrs) vs a planned parenthood clinic.\nAnd if time wasn't, as yet, functionally linear, or we could know the future with absolute certainty, that'd be a rational differential to measure.\nBut it is, and we don't, so it isn't.\nVideo isn't loading, so I honestly can't speak to this particular case. If you'd appended a name - other than the NBC host's - I'd look it up.\n\n>Six people to subdue him? \nSix people being needed to subdue a man is fairly normal, without lethal force or existing restraints. Ask a hospital orderly, sometime.\n>Multiple incidents beforehand? Geez how much had we already spent on this basket case?\nFar too much, assumedly. Imagine if we'd actually addressed reality, instead of pretending he was a totally different person or assuming guilt prior to birth.\nBut to play the odds, I'd guess he probably would have benefited from having a second parent in his household and at least one of those parents dedicated to full time parenthood, as well as not being shoved into a state institution - including a public school.\nSince that's a degenerative cycle that's been picking up speed for generations now, I'm not sure how to solve it. But given that it was caused by reality-denying retards that wanted to engineer society instead of leaving people the fuck alone to get on with their lives, I'm willing to bet that handing more power to reality-denying retards who want to engineer society won't actually result in a solution.\n\n>And what about the cost to victims once you turn him loose at 18? Maybe we need better lifecycle accounting?\nEntirely on board with holding people accountaable for things they've actually done, collectivist.\nI just insist they actually have done them, rather than an imagined act that takes place in your magical thinking.\n\n>I don't like the baby killing that goes on at planned parenthood, but\nYou're willing to defend it continuing, which makes me think you're either stupid or full of shit to open your line with this.\n>as long as we have perfectionist morons like yourself attempting to impose their \"systems\" on an imperfect world - maybe PP is as good as it gets.....\nNot imposing a system. Literally advocating for \"deal with reality in an ongoing basis.\" It occurs pretty organically. You can observe babies working it out on their own by waving keys in their face.\nBy contrast, you're arguing pre-emptive death for person A based upon what group Y has done, which person A has not - as an unborn infant - taken part in.\n\n>This kid was trouble. Would likely have always been trouble. If I knew more about his case, would probably be thankful he is gone.\nYou've already presented the argument that it would have been better to snuff him in the womb, so your disingenuous pathos - that attempt to evoke compassion - is worth less than the dead guy's dick cheese.\nAt least dick cheese could be used for fertilizer, in a productive endeavour.",
			"time": 1597476558117,
			"files": "[]"
		},
		{
			"id": "0fdcf37a-5a18-464c-baae-cfd2647798ce",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "323e4cef-1d65-4775-9635-dbf46b83286d",
			"body": ">>e63c2807-b76e-4e3f-82a8-18a1849e0b02\n>>8bce6f4a-88cf-4988-af55-c390a205b586\n>cont'd\n>Even wild animals have been known to destroy their defectives.\nThey also destroy perfectly functional offspring. What point are you failing to make, here?\nYou're upset I wouldn't buy that you shouldn't be held to the standard of inert matter and hard vaccuum, so now you want to be held to the standard of an animal with questionable awareness?\nFuck off. You get the same standard of personal accountability I apply to everyone.\nI do note that's twice now you've tried to tell me I should hold you less accountable than I do third world savages though, because that's fuckin' funny.\nAlways a different rule for you, right? Because you're... different, somehow. You're... chosen.\nYou certainly write like you believe that.\n\n>You look at those looters and see people to save.\nNo, I see looters that really ought to be getting shot by the people whose property they're stealing, and livelihoods they're destroying.\n>I just see missed opportunities to stop them.\nI don't think people need to be stopped from doing things they haven't done. After they've done them, or while they're in the process of doing them - absolutely. I just insist a murder have taken place, before I start looking for a murderer.\n\n>Your innocent defectives will destroy the lifeboat.\nYes, I know you will. Collectivists always do, because they insist on treating people the way they would like people to function, instead of the way people actually do function - as individuals.\nThat inherent disconnect from reality just means the bigger the problem collectivist thought tries to address, the more flailingly useless it becomes, and the more horrific the results.\nCollectivism works quite well in an immediate family, because that family DOES have tightly intertwined interests, needs, and property. They actually CAN function, as a collective.\nMake it a small town, and you begin to see serious problems, because the mayor's interests are entirely unaligned with the outlying farmer's.\nMake it a small nation, and you see bodies piling up as the collectivists in charge try to force people to act like a hive mind under their control, and large complex systems like an economy can't benefit from the localized micro-corrections of people looking out for their own interests, due to the centralized control.\nMake it a large nation, and those piles become mountains.\nBut by all means, I'm sure this time you'll get collectivism to work.",
			"time": 1597476709496,
			"files": "[]"
		},
		{
			"id": "40693e35-5519-4e76-847a-5b6be0671c05",
			"directory": "users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v",
			"uri": "pol",
			"thread": "323e4cef-1d65-4775-9635-dbf46b83286d",
			"body": ">>6c314cff-ae89-4746-a28d-a72841142d1b\n>What's this really about?\nSocialists being a cancer upon society.\n>Are you mommy's little accident?\nLet me know when you're finished moving the goalposts, socialist.",
			"time": 1597499863868,
			"files": "[]"
		}
	],
	"boards": [],
	"modlogs": []
}