{
	"next_comment_id": 5,
	"comment": [
		{
			"comment_id": 1,
			"body": "Perhaps Go rather than dart?",
			"post_id": 28,
			"date_added": 1507914439
		},
		{
			"comment_id": 2,
			"body": "> [ekaterina](#comment_45_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): No, it's Dart alright, but you'd think that it would be Go since it is so much more popular outside of Google. It's going to be interesting to see if Google will finally manage to make Dart popular with this move, they've apparantly tried and failed for years and some people already thought it dead but now they're back in full force on making it popular. But it's of course totally possible that they give up at some point and just go with Go. Ha! Go with Go :D\n\nYou know far more about this subject than me and spend more time considering the \"what\" and \"how.\" Dart programmers will likely thank you; I prefer Perl, Mathematica, Maple and the like, :)\n\nBest of luck with your project.\n\nIs mise le meas.",
			"post_id": 28,
			"date_added": 1507919685
		},
		{
			"comment_id": 3,
			"body": "> [ekaterina](#comment_47_1Mk5sVKeCrwMc3wSD11jM7DZTiqF5D9BaD): Thanks! I'm still learning everything myself, I just watched a lot of Google Developer videos and interviews with Google employees on the Dart team over the past week, that's the only reason why I know a little about that stuff in the first place :)\n> Haven't used many languages yet, so I don't know Perl and the others you mentioned, it's just a hobby for me, I don't have a degree or anything and Mathemathics never returned any of my calls in school. JavaScript + CoffeeScript is what I'm most comfortable with, or rather was, haven't done much programming over the last year. Looked a bit into Go and Python before (Python would be neat to know since that's what ZeroNet is written in), but most of that still goes way over my head. With Dart I might be able to start writing some small apps for my Android phone now which would be cool! :)\n\nYou may find an MIT project, App Inventor, of interest. Simply, a Web based GUI interface to a programing environment for Android. You do not use a programing language, more like assembling a puzzle where the pieces represent program constructs. http://appinventor.mit.edu/explore/front.html\n\nIs mise le meas.",
			"post_id": 28,
			"date_added": 1507944838
		},
		{
			"comment_id": 4,
			"body": "A question, as I know very little about Dart. Based on your experience, why use Dart rather than Javascript?\n\nIs mise le meas.",
			"post_id": 29,
			"date_added": 1509316364
		}
	],
	"comment_vote": {},
	"topic_vote": {}
}