{
	"title": "Anna Christina Valentine's Blog\n",
	"description": "My ZeroBlog.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 24,
	"demo": false,
	"modified": 1503128780,
	"post": [
		{
			"post_id": 23,
			"title": "@AnnaKendrick47 is a high profile prostitute.\nHi, I think I should write about this too….",
			"date_published": 1503072862.521,
			"body": "Given that the real Anna, was murdered, it must be known that @annakendrick47 is a high profile prostitute who found her way from strip clubs to hollywood in order to cover a murder.\n\nHer list of sexual encounters go from hollywood agents, to sport stars to politicians. one of the politicians is Obama.\n\nSeveral NFL and NBA players too.\n\n### The original Anna “Marie” Kendrick was not a prostitute, not in a million years. again… everything was carefully planted and planned so the truth about these people won’t go out. but it has anyway. you just have browse the people who follow @annakendrick47 in twitter…. many many of those people had paid sexual relationships with her.\n\n### there is even photos where she is using her finger in her vagina in while filming “Drinking Buddies” in what it seems to be a close sexual encounter between the Director of the movie and @annakendrick47\n\n**She Fucked sport players, politicians, charlie sheen, leonardo dicaprio and Barak Obama** including several casting couches and is guilty of fraud, minors abuse, illigal pornography,, **that landed her right up to white house due her connections to the Pizza gate and child abducting and child pornography scandals in Washington.**\n\n![Capture2.PNG (1070x632)](data/img/post_23_Capture2.PNG)"
		},
		{
			"post_id": 14,
			"title": "Anna Kendrick died in 2009",
			"date_published": 1502022424.158,
			"body": "Born:1985 Dead:2009\\. by forced overdose and gunshot. short after her murder, her life and identity stolen by several people in Hollywood. running fake accounts by the username @annakendrick47 Profession: Actress Born: Portland.\n\nAnna Kendrick actress from Portland is having her identity stolen by 3 different doubles running the online accounts @annakendrick47 . The Original war murdered by forced overdose on drugs in 2009 while filming up in the air or soon after.\n\n<canvas width=\"75\" height=\"55\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/600/1*ZHmFxBQIbziO0j3wlXjhug.jpeg)\n\n<canvas width=\"57\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*5mijY5-r69yXR4QpAVg5BQ.jpeg)\n\nDue her refusal to participate in and with people related to Masons and Scientology activities she was erased completely. Murdered and her body disappeared.\n\nThis was one of the last photos of her, which is believed is her dead body.\n\nThose photos were specifically taken to make her look like drunk and high on drugs. but actually those photos are the last time of the agony of her death.\n\nSoon after dying she disappeared from camera for around 3 years and all her information on the web was erased and replaced with doubles.\n\nthe next photos are the photos of the doubles in what is a mayor world wide scam.\n\n…………………………………………………………………………………….\n\n<canvas width=\"60\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*3DYTy-_AxTJf6FZBuWItMg.jpeg)\n\n<canvas width=\"50\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*PxI1sYG8o0roZOc84FJN0w.jpeg)\n\n<canvas width=\"64\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*XD46OIlGqaW_qogA1saxKA.jpeg)\n\nThe NEXT photos are from fake people stealing the identity, doubles of the real anna kendrick, who now run all her marketing image and appear in movies. known as @annakendrick47\n\nmagazines\n\nWikipedia\n\nsuper market.\n\nThis person IS NOT Anna Kendrick.\n\nThis person has been paid and used to stage and cover murder.\n\nThis person is/was old time prostitute.\n\nThis person has had best plastic surgery doctors to look alike the Real Anna Kendrick\n\n///////////////////////////////////////////////////////////////////////////////////////////////////////////////\n\n………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………….\n\nThe next ones, are the real photos of Anna Kendrick, also known as Marie, who’s identity has been stolen by Scientology and Hollywood after her murder.\n\n<canvas width=\"57\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*lFzE67TxiGrxt_L_QOrmeg.jpeg)\n\n<canvas width=\"45\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*r7F3s9SNs8gvPQJ_Pr1JeA.jpeg)\n\n<canvas width=\"45\" height=\"75\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*_ZrieUyeyvCaG6oOX8_39w.jpeg)\n\nThis is the real Anna Kendrick from Portland Maine.\n\n………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………………\n\nAll traces from her were erased. And double have been taking her identity after 2009 when she also began “dating”(planned scam) Edgar Wright.\n\nNo history of her is to be found before that date. why? because all has been staged by rich people from Hollywood.\n\nThe accounts twitter and Instagram are fake, but actually verified.\n\n<canvas width=\"75\" height=\"47\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/400/1*qZKeHLGYyStg0QHG76TVpQ.jpeg)\n\nProving further more the incredible scam this has become.\n\n@annakendrick47 accounts are all fake.\n\nThat is not the real Anna Kendrick.\n\n<canvas width=\"75\" height=\"25\"></canvas>\n\n![](https://cdn-images-1.medium.com/max/800/1*Frl7I_LMTwdhFcA9YLQagQ.jpeg)\n\n[http://ripannakendrick.tumblr.com/](http://ripannakendrick.tumblr.com/)\n\n![Capture.PNG (700x628)](data/img/post_14_Capture.PNG)"
		},
		{
			"post_id": 5,
			"title": "Hello, I feel like writing.",
			"date_published": 1502002366.398,
			"body": "Hello.\n\nThis place should grow up over the time. I don't know for how long this network has been around, but seems fine by me.\n\nTor is too damn obscure for me, and the free net is just too damn idiotic.\n\nAnyway,  if there is some particular topic you would like me to write about. you can ask me in the comments and I will try to post about it with most quality I am able to do it.\n\nHave a great day. : ) XoXo"
		},
		{
			"post_id": 3,
			"title": "The Earth is actually Flat.",
			"date_published": 1501782178.585,
			"body": "Given recent events I feel the need to return. I am writing this time. This article is confusing, so read carefully.\n\n![flat-earth-1.jpg (748x392)](data/img/post_3_flat-earth-1.jpg)\n\nAfter the course of several years I have gained some knowledge in some topics that would like to share with you, \n\nLet  me talk to you about the truth.\n\n1.- And as you may have heard before.The Matrix. we do NOT live in a computer simulation as many would make you believe. but we do live inside electro mechanical bodies, meaning robots. your assumption is correct. we are robots thinking ourselves humans. the war is over and machines won.\n\n2.-There is no way to out of the Matrix. the matrix is by design this way, a computer simulated game that interlaces with reality, meaning that. some of us are humans some others are not human and some others are artificial intelligence. at first glance everything seems the same to us.\n\n3.-No, There are 3 types of intelligence in this world. positive, negative, neutral. and they might present to you as something beyond ordinary. for explanatory purposes I will call it Black, Red and White.\n\n3.a: White: Humans., actual living consciousness souls who are capable of feelings like love, hate and rage. we are linked and mixed with the other two.\n\n3.b: Red, Neutral Artificial intelligence. its purpose is to keep the balance between between AI entities and Humans, has no feelings, and appears to us as random acts of help  or dismal.\n\n3.c Black. Artificial intelligence agents, better known as men in black. this people usually have tendencies to wear dark suits or black color clothes. their objective is avoiding people waking up of the Matrix.\n\n4.-We are code. therefore we live inside a enclosed system. there is no outer space, we are literally characters like in the green code in the matrix movie, but, what does this mean for us?. it means, this. we are conscious living machines (White). and we live in a flat earth.\n\n5.-What is a flat earth?: it’s a land and waters that is not a globe. as example, you can’t touch a letter written on  piece of paper., but you know what it means. “pearl” means a rounded white crystallized natural jewel. but can’t touch the world pearl, so the actual jewel is a materialization of the word “Pearl”, just written in a 2 dimensional code.\n\n6.-You may or may not be able to measure the thickness of a flat line. it’s simply infinite. driving to obvious conclusion that might shock you.\n\n7.-WE LIVE IN A 2 DIMENSIONAL WORLD. yes. we do  live in the matrix, but not a computer simulation, and yes, the world is flat, and yes we are 2 dimensional beings and we have been lied for at least 5 centuries or more.\n\n8.-  “______________________________________________________________”\n\nthat is I, quoting  our world. it is static, flat and 2 dimensional. do you want to see it from above?.\n\n![SunAnimation-300x300](https://saorikidoblog.files.wordpress.com/2017/03/sunanimation-300x300.gif?w=720)\n\nextended in infinitely, with no way out. we are the only existing universe, but still not the only existing reality.\n\n9.-There is only left and right. like there is only day and night. it is impossible to go up in a flat plane., it is impossible to go down in a flat plane. meaning the Z axis does not exist. unlike X axis and Y axis. sorry, that is the truth. otherwise, wonder yourself why you can’t reach the sun with your own hands.\n\n10.-Not going to put all proof here, it is a matter of you doing research and realize you are being lied. There is no 3d world. there is no globe, there is no outer space and of course there is no time.\n\nSorry for ruining your life."
		},
		{
			"post_id": 2,
			"title": "Hello. This is my first entry.",
			"date_published": 1501771651.411,
			"body": "I've been a long time internet \"Freenet\" and some \"DarkWeb\" users, both are not particularly interesting to me. Internet is not the same thing it was on the 90s, now it's ruled by governments and corporations. Also have had several horror stories in freenet., ZeroNet think I. could be the next big thing. Working on pears and seeders, it will never be taken down or blocked.\n\nI would like to know more about it. if anyone has useful links, please post them. I need to know how exactly works and how can I post my own website here.\n\nHave a great day.\n\nAnd maybe, just thinking about it, it would be better this place not to boost in popularity, so the waters keep calm, becoming viral is actually bad. I found this network by pure luck.\n\nCheers.\n\nAnna Christina Valentine."
		}
	]
}