{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1590015602,
			"title": "nofish posts... are they even made by nofish!?",
			"body": "Is there a shred of evidence that Tamas the original author of the first zeronet code is still in control of his nofish user? \n\nDid he speak live at anytime recently? [blog link](http://127.0.0.1:43110/Blog.ZeroNetwork.bit/?Post:152#Comments) Does he even answer messages?",
			"added": 1590015601
		},
		{
			"topic_id": 1590076293,
			"title": "ZeroNet is FBI honeypot.",
			"body": "Another take? The FBI regularly weeds out anyone with intelligence. Most FBI agents want to keep their bullshit jobs. So calling attention to Arabs not wishing to land aircraft is a very career limiting move. \"White nationalism\" is under scrutiny ONLY because those people tend not to blow themselves up. Change that, and those FBI agents will develop a sudden overwhelming interest in jaywalkers. Or those who fail to return library books.\n\nQuote taken from [this](http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D/?:users/13E1NfoEM9eYfxk3mZQTLW5qYBekTp5W7v:pol:0).",
			"added": 1590076291
		},
		{
			"topic_id": 1590079338,
			"title": "ZeroNet under attack? Threads on ZeroTalk disappear?",
			"body": "> [z0net](#comment_45_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): How so? I think you must have me confused with another user\n\nI AM CALLING IT OUT!!! There are two options:\n\n1. Your [z0net](.) identity has been stolen and damage is being done under your name.\n2. You are not who you want us to believe.\n\nWhere are MY PREVIOUS POSTS FROM [THIS THREAD](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS/Pedogate+2020+Film+Link+savethechildren)? Who deleted them or who sabotages ZeroNet!!!!?????\n\nZeronet user 'z0net' on March 8, 2020  has offended and wished mass death on Ancient Persian people! Persians are often highly intelligent classy people who are very liberal and politically aware. z0net simply defecated on their Farsi ZeroTalk forum. This is no different than throwing Child Porn at new zeronet users from USA or Europe and causing great harm to our zeronet community and future of zeronet! [read the post in question](http://127.0.0.1:43110/1PyJqA1V8wFemvEJ2FeJ8CmVnEtR2nngNp/?Topic:1583706915_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS)\n\n[haxxer@zeroid.bit](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/) claims to be the creator of Farsi Iranian ZeroTalk. Did user haxxer took good care or the Farsi language Iranian ZeroTalk? [read the post with this claim](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/1576055595)\n\nIran is a society of 100 mln people some very skilled programmers and could have an incredible input into development of our platform just like we the westerners can have.\n\nI DEMAND YOU BOTH RESPOND! Pass the link or mention it to whoever you see fit.",
			"added": 1590079335
		},
		{
			"topic_id": 1590653153,
			"title": "Stefan Molyneux 1 mln youtuber has a brain tumor doesn't stop rumbling!",
			"body": "https://www.youtube.com/watch?v=c_m-snVrJsk\n\nLet this be a warning to all you spiritual gangsters and tricksters at FBI CIA NSA.",
			"added": 1590653149
		},
		{
			"topic_id": 1590685152,
			"title": "Cool topics and missing zeronet post.",
			"body": "http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1BLueGvui1GdbtsjcKqCf4F67uKfritG49/16LvuB65gAqLXgy5Pg9UNE6soj6E5huquN/1532182391\n\n'The truth about zeronet' topic and missing posts.\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1509171908_1AWwhg4EiWAVttfQboJZ4wJfX3WawfJT3h/Yet+another+ZeroNet+Dev+Resources+Index#tutorials-learning-resources",
			"added": 1590685147
		}
	],
	"topic_vote": {
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"1589566423_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1562198429_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1589742530_19ZUAyEjVPBC7EDfQoBfaugohL6HzE1qWt": 1,
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1590020097_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1590345225_14X7YqX1gTpjnnsLEbLfk1V3Wjs8tNztaA": 1,
		"1590155483_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"1590686514_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"1590404236_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": 1,
		"1591804075_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": 1,
		"1596020021_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1596305258_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": 1,
		"1596534058_12kkzRK2n9vRvQLcycbGZNsD3vqzWe1Jeh": 1
	},
	"next_comment_id": 50,
	"comment": {
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 1,
				"body": "> [blurhy](#comment_490_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Exactly, my purpose was to provoke you guys with the word 'communism'.\n\nProvocation of this kind is good! What we should learn from this is that sociopathic socio-engineers hijack words, twist them in their propaganda and they have their connotation that's hard to ignore. There is a lot of words that were skewed and some of them is due to churches but also academia and their agendas.",
				"added": 1589465781
			}
		],
		"1587403903_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 2,
				"body": "> [zaron](#comment_83_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): 5G uses the frequency range between 25Ghz and 39Ghz tho..\n\nCan't confirm nor deny but it could be another half truth that is meant to confuse people. 5G means as much or as little as 'mobile phones'.",
				"added": 1589474215
			}
		],
		"1589369580_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Could you explain how lockdown would get Nvidia staff to invent more? I don't think I get it......",
				"added": 1589476212
			}
		],
		"1573689881_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": [
			{
				"comment_id": 4,
				"body": "root2elroy >\nporly designed ai or a really poor joke",
				"added": 1589634243
			}
		],
		"1589945996_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 5,
				"body": "Love you guys and gals for attitude. I honestly think you are fucking great for trying. We are simply not sly and sophisticated enough. Also it's best to hit your enemy out of surprise. Our enemy is obsessively watching us here. I speak code almost. \n\nZeronet is the  most exciting thing i have ever came across. But we are smart and can spend several ours figuring out what can be done here, the potential. There were people here in bigger numbers in the past. They disappeared. I am slowly starting to see why and am wiling to undertake great long term work to change that. In the past the problem was trying to work with people with ego issues. A pack of vicious ones is needed. No goofiness. You get me?",
				"added": 1589982455
			},
			{
				"comment_id": 6,
				"body": "@sabutai you are the samurai\n\nCan't possibly say if this one particular thing will work or not. And yet, an open mind. I allow and approve of the following methods: deception* , lying, provocation, exploitation, use of false identity ... and it develops like the series in mathematics. I also want you all to take great pleasure every time you use those. Remember that your enemies have no problem directly cutting communication between people. Fact: they violate private accounts and secretly change settings, delete and hide messages (essentially delete) and give fake answers and results while charging money for it. To say that surely people simply don't care is not true! \n\nI have seen with my own eyes entire online communities obliterated mercilessly in cold blood. Those people will hack or blackmail without a flinch. \n\nThis is all a fair game.   \n\nHowever nobody should be stupid enough to just openly walk around with their tag on the back and make any of such things. Under the radar is the key.\n\n* *examples click bait, ambiguous statements, double speech.",
				"added": 1589987825
			},
			{
				"comment_id": 7,
				"body": ".... and you can also zeromail me. I zeromail people here and they either have no habit or do not want to use it.",
				"added": 1589988958
			},
			{
				"comment_id": 8,
				"body": "> [aassddff](#comment_48_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): For what? For doing propaganda for Zeronet?\n\nAnd what do you think? Do say.\nYou are absolutely right about the users.json! (speaking from experience)",
				"added": 1589999012
			},
			{
				"comment_id": 9,
				"body": "> [aassddff](#comment_49_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): I do not aprove of lies and deceiving. (...) from stumbling upon bad stuff.\n\nGood you spoke up. I used be like you in the past. Upright straight shooting person. That was until I found out INTEL is mass raping billions of computers with their secret ALL_ACCESS_MEMORY inside chip system never mentioned on packaging or manual and how Google YouTube deletes millions of files a minute in secret putting 'a liberal smile' to all that.  Our parents are by most part white european decent christians and were brainwashed to be 'God fearing' never lie never steal never lust people and work for every piece of bread you eat. Do not murder - that was upgraded to being docile loss accepting having a dreadful fear of any killing*. Our enemies have a culture of despising hard honest work and entitled themselves to running multi-generational big business on deceit and dishonest speculation. All that with religious zeal. They rape and mutilate their children and engage in international human and organ trade. \n\nThere is no point whatsoever in inviting people to platform that is glitching and failing. They will go away. We have to investigate what features are missing and what needs fixing. Easy to say harder to do. This has to be constantly dealt with and I feel I have a duty to help. \n\nPeople worked hard in the past to promote zeronet and sifted through the many weeds and brought the wheat here. Those people just suddenly disappeared. Skip back the 1st paragraph to get a hint what could have caused it. So like in the parable the birds came and ate them up. The soil was good. \n\nThere are issues with zeronet glitching weird shit happens here. I am not blind I see people complaining about basic things mysteriously not loading here on zeronet. I have recorded bizarre zeronet behavior in person. I know of people who got their computers disabled because they figured stuff out and started sharing it openly. You do understand some people will simply be unable to continue after shit like that!? \n\nWhere is nofish? Who is making the latest zeronet versions? I mean he does TED talk, audio interview, seems a normal cool guy passionate about work and zeronet and suddenly 2 years ago he  goes hiding?  Folks this shit is serious.\n\nI was never meant to be on zeronet. NEVER!!!! The CIA and alike got rid of a user from a service and somehow missed a message to me with a contact that was the only way I could ever end up on zeronet. Fluke or glitch is not the word! \n\nI was recently totally convinced any attempt to promote zeronet on likes of facebook is a complete waste of time as AI will eat any growth. And then I was convinced it is actually worth trying. The numbers are however still shitty.\n\nThe vast majority of people on mass social media are not fit mentally to have any useful and beneficial input anyway. They are new world order meat suits and are proud of it. We only want top half of say 110-130 IQ or higher. These are huge numbers!  (market in greedy banker mind). Using trickery and click bait to get bigger numbers of followers only to skillfully and in a sly manner advertise zeronet to be then likely banned to cause a streissand  effect is something that I totally approve of. I approve of it.\n\nI know of bad karma. I more than believe it. Top elites also believe it and always make sure people openly agree to terms and conditions and willingly engage in their products so they do not die from all their deception. I do not seek to satisfy my greed. I only want zeronet in whatever version or form to be big and strong enough so evil fuckers can never fully censor people from freely exchanging crucial information that can protect and save them. (I know libremesh needed too) \n\nI hate fascism or forcing people into anything. I believe we should form into groups that promote zeronet the way they see fit and compare who is getting best results. No point in doing that from same IP so we can be seen here by enemy spies.\n\nAnd again, a circle, we need to have zeronet stability at least somewhat under control right now. Help and assistance to new users is essential. Of course there will be trolls send here who will be like 'Hello... CHILD PORN, You censor and persecute people too? <crying like a bby for show>\n\n* *And, to all, PLEASE do not try to dismiss by pointing some exceptions in mentality or racial aspect in individual cases. We all know those exceptions only confirm the general rule.",
				"added": 1590010828
			}
		],
		"1590041703_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": [
			{
				"comment_id": 10,
				"body": "More bullshit about Russians. More distractions. If a woman a teacher has sex with a 17 year old student she gets arrested. However if a married person has an affair with 100 people and it breaks the family with children USA calls it middle age crisis. Sick hypocrites! Twisted minds! \n\nFood has so much hormone boosters 7-9 year olds might try to make sex witch each other. So we put parents who were in the next room into prison or address the root problem?",
				"added": 1590060156
			}
		],
		"1589339553_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 11,
				"body": "Please people send me zeromail to confirm connectivity between us still exists. Author and however else is willing. Regards!",
				"added": 1590060370
			}
		],
		"1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 12,
				"body": "> [z0net](#comment_45_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): How so? I think you must have me confused with another user\n\nI AM CALLING OUT!!! There are two options:\n\n1. Your user identity has been stolen and damage is being done under your name.\n2. You are not who you want us to believe.\n\nWhere are MY PREVIOUS POSTS FROM THIS THREAD? Who deleted them or who sabotages ZeroNet!!!!?????\n\nZeronet user 'z0net' on March 8, 2020  has offended and wished mass death on Ancient Persian people! Persians are often highly intelligent classy people who are very liberal and politically aware. z0net simply defecated on their Farsi ZeroTalk forum. This is no different than throwing Child Porn at new zeronet users from USA or Europe and causing great harm to our zeronet community and future of zeronet! [read the post in question](http://127.0.0.1:43110/1PyJqA1V8wFemvEJ2FeJ8CmVnEtR2nngNp/?Topic:1583706915_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS)\n\n[haxxer@zeroid.bit](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/) claims to be the creator of Farsi Iranian ZeroTalk. Did user haxxer took good care or the Farsi language Iranian ZeroTalk? [read the post with this claim](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Post/1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2/1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk/1576055595)\n\nIran is a society of 100 mln people some very skilled programmers and could have an incredible input into development of our platform just like we the westerners can have.\n\nI DEMAND YOU BOTH RESPOND! Pass the link or mention it to whoever you see fit.",
				"added": 1590063092
			}
		],
		"1590020097_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 13,
				"body": "Terrie Rizzo, chair of the Florida Democratic Party, released a statement on Tuesday calling for an investigation.\n\n“Allegations that Florida’s government may have tried to manipulate or alter data to make reopening appear safer is outrageous. These kinds of actions are dangerous and, frankly, should be criminal,\" she wrote.",
				"added": 1590071481
			},
			{
				"comment_id": 14,
				"body": "> [commandantecero](#comment_33_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): And it turns out it wasn't her project, wasn't her code, and she was the one insisting that questionable data be used.\n\nSo is this........ FAKE NEWS?  Nooooooooooooooooooooo.......",
				"added": 1590071629
			},
			{
				"comment_id": 16,
				"body": "> [z0net](#comment_48_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): Poor woman, with honest ambitions of helping the world, fired for doing what is right.\n\nIs this your post or what? \nhttp://127.0.0.1:43110/1PyJqA1V8wFemvEJ2FeJ8CmVnEtR2nngNp/?Topic:1583706915_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS\nThanks",
				"added": 1590080580
			}
		],
		"1590079338_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 15,
				"body": "> [styromaniac](#comment_2207_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Take your pills.\n\nIs it true or not true? It's very simple, boyo.",
				"added": 1590079591
			},
			{
				"comment_id": 17,
				"body": "And I get hard deleted in this thread too!? \n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1587283149_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3#comment_10_1C16NYLAnRJ2yppe3aYWT8K2D5sZB4A2u2\n\nI wasn't that pissed in months. You rat faced gremlins!\nThis is full on zerg alien invasion of ZeroNet! ",
				"added": 1590087034
			},
			{
				"comment_id": 18,
				"body": "> [styromaniac](#comment_2211_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Maybe nobody likes you.\n\nWill you list me in the MOABites nation like in the old testament, for ethnic cleansing? Forget me. What about the rest of the posts and those users? Fuck them MOABites too?",
				"added": 1590088481
			},
			{
				"comment_id": 31,
				"body": "> [styromaniac](#comment_2302_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): In regards to Cexy, probably not. Cexy had been making up lies the entire time they've been posting. Cexy is closer to hell than the rest of us.\n\nYou have it so coming. Karma deals quick and light. Or slow and big.",
				"added": 1591249768
			},
			{
				"comment_id": 32,
				"body": "They all need to play a lawyer game and people sign 'terms and conditions' so they get no bad karma. War massacres get brainwashed nation support. Karma hits the fooled invading nation more than conspirators. Western nations are collapsing and it's their karma for lack of morality, socialism and decadence. Notice also some people's gear is exploding in their faces. Thats karma for megalomania. The known conspirators will get more desperate and will use 'terms and conditions' less and will go more for direct malice. Increased negative karma imminent. Giant boom in the end, as was the case with all empires.",
				"added": 1591298169
			}
		],
		"1590447717_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 19,
				"body": "> [xcape2net](#comment_737_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): [...] Oh, and Covid-19 will kill 7% of the earth's population, nearly 500 million people, over the next 12 months.\n\nOnly those with heart failure, no immune system due to pharma and junk. Chemtrails and all plethora of EMF constantly biting on peoples vitality levels.\n\nSorry to say, but it's a survival of th fittest as well as of the most wicked people.",
				"added": 1590479818
			}
		],
		"1590241272_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 20,
				"body": "> [styromaniac](#comment_2235_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): \"Wśród nich, oprócz wspomnianego unikalnego identyfikatora, mogą się pojawić przecież choćby adresy IP. \" ... roughly translates into \" This can reveal your IP address. But you advice it as good for hardware support? You sound a lot like Apple and Microsoft!\n\nSo you don't mind that? Gee, I think people should consider carefully your zeronet 'act of kindness' IT department. You also see no problem with 'newer versions' of zeronet made by [since 2018] faceless and voiceless @nofish Koscis? \n\nYou also say that we are 'dropping old zeronet sites' as they are no longer supported. Zeronet 0.6.5 doesn't even say it's out of date. Is new zeronet a hijacked clone? Where is the glitching people recently complain about coming from? \n\nI think I am so going on MOAB. Uuuuuups :o",
				"added": 1590481857
			},
			{
				"comment_id": 21,
				"body": "> [zaron](#comment_101_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Just installed ZorinOS 15.2 and you can opt out during installation\n\nIf you are an advanced IT person you can do so much especially with Lin Distro.\n\nMost people need something that is private by default. Even fool proof! Never make ZorinOS a 1st recommendation then!",
				"added": 1590561222
			}
		],
		"1590376016_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "Styromaniac is alot like Sargon on youtube. 75% wholesome and the remains are jubirish mental flip overs psy-op. Sargon is sabotaging british nationalists who took a stand against nwo.\n\nJust watched Vaush. thanks @draugrdeathlord !",
				"added": 1590648087
			},
			{
				"comment_id": 24,
				"body": "> [styromaniac](#comment_2264_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Psy-op?... Really?... [...]\n\nPsy-op is your 'I am here to help'. There was a man who used to cut a lawns he said to a man 'I am here to help'. Later this man was shocked over what was done to his young daughters. You are telling us to 'abandon old zites and accept IP leaks for hardware support'. You are here to 'help' and are telling us 'to bend over' for a 'filthy stranger without kiss'. LOL\n\nSo waht happened to all those active users on zerotalk? They are having 'software compatibility issues?.",
				"added": 1590683523
			},
			{
				"comment_id": 25,
				"body": "> [styromaniac](#comment_2267_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Once again, you are lying. I only said what I do personally, not recommend.\n\nYou said in new zeronet 'some old zites not supported'. Ludicrous.",
				"added": 1590683824
			},
			{
				"comment_id": 26,
				"body": "> [styromaniac](#comment_2267_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Once again, you are lying. I only said what I opt into personally, not recommend. [...]\n\nLet me restate that; \nYou are telling us to get over the censorship and have no problem with leaking keys to own privacy. You sound nothing like a sound IT expert. You make psy-op 'I personally have no issue and am here to help with this tech'. Incredible!",
				"added": 1590684273
			}
		],
		"1590536017_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 23,
				"body": "> [mg0](#comment_318_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): I have an ipv4 tunnel over an ipv6 distributed vpn for accessing one of my instances.\n\nHi there! Any news in zeronet zite dev or js related?",
				"added": 1590672105
			}
		],
		"1590192659_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 27,
				"body": "You remind me of a moral lady on steroids that just heard a kid talking bad about her fav local pastor XD\n\nPeople who used 0net for long know you deleted the post i linked but you can't make the link go away. The comments left there by you were an idiotic desperate attempt to make weak minded people mute me. You are a liar, lied several times while I believed you, and a disgusting racist.",
				"added": 1590755579
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 28,
				"body": "The thread so thought provoking. Humbling even.\n\nLove zeronet!",
				"added": 1590756053
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 29,
				"body": "> [edgelordofdecent](#comment_551_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): People need to blow the cops brains out when they are doing this shit if you want to see change.\n\nAre you Trumps agent to operate along his false flag? 'You loot we shoot' provocation? The cops who murdered this black man were agents who deliberately postponed medical help which was there.\n\nNow the mixed race team of sociopathic cops in the rhetoric changes to 'White Cops' murdering 'Innocent Blacks'. They need to control the Headlines and imagery get everybody roaring and freaking out like fight dogs and off you go into the civil war. Whatever cv-19 didn't do this hopefuly just might. \n\nWhoever falls into this trap is either DUMB or DISGUSTING.......\n\nor both",
				"added": 1590928831
			}
		],
		"1591167020_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 30,
				"body": "jesuschrist!",
				"added": 1591170896
			},
			{
				"comment_id": 34,
				"body": "> [zaron](#comment_131_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Go to the temple and flip over the money changers tables. Wait for the Romans to come. Boom! Crucified.\n\nMade my day.",
				"added": 1592086297
			}
		],
		"1591900871_19Nh4E7nU8DstH29eriZNvAxg6nHuXCrqk": [
			{
				"comment_id": 33,
				"body": "> [zaron](#comment_127_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Right now? Look in the past. Humans don't like each other much. Most you can do is live your life\n\nOnly when they are brainwashed.",
				"added": 1591946613
			}
		],
		"1592059237_1QPc2ZGPDgxrTJc4jMdEH4XrEb7gQBs4t": [
			{
				"comment_id": 35,
				"body": "> [xpyxel](#comment_2_15ebtdT12VepdkSH4fX5qkRdXkM5Kpf7t8): Amen to that, I like the no password part of it as well, using bitcoin to login to things\n\nNo password yet further from corporate spies!\n\n> [eltheal](#comment_15_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf): without it having more user base and higher traffic it will not mean anything\n\nI found one of the best materials here. On the crapnet I might be too exhausted flicking through tones of trash b4 I even get to the stuff that might be on zn on the top of the list. Unless people learn how to install and use a thing called... wait for it... LINUX distro there can be no serious decentralized peoples system of payments and communication. Windows adn android you can have as much freedom as chickens in cages from getting their heads chopped off.",
				"added": 1592086838
			}
		],
		"1592177736_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW": [
			{
				"comment_id": 36,
				"body": "CAPSLOCK ALL: Either retarded or old broken keyboard. Bizzare dumb hatred bullhorned: sociopath on payroll or aibot. \n\nBoth are FAILED creation and cannot be fixed / helped.\n\nEDIT: Wait, didn't you read old testament in the synagrees? 'Arrogance precedes the fall'?",
				"added": 1592222002
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 37,
				"body": "> [pharaon](#comment_1_1gn57j2UokAkXvA1VyhkHvKZvg59RoXuW): Can't live forever if there is no food.\n\nSure pharaon wisely took all the grain from the people and in famine took all gold as payment for it. Sure we all seek model heroes to feel inspired. Have a nice day.",
				"added": 1592225594
			}
		],
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 38,
				"body": "Dumb people are most places majority. Financial hubs however, cities, filled with them, are obscenely over-priced, and any freeminded productive person will face a fascist financier legal shoe on their neck first minute of their honestly earned success. A woman attracted to such a productive intelligent man will leave him first time she will get a periodical tantrum correlated with the financial fascist confiscating his wealth of which tiny portion will be given to her as a bribe when she applies for a social welfare [love&share]. Not all women fall for it, but most. Most places are full of resources in that sense. They end up so miserably, because the higher value men can't keep those places theirs as you say and they are then taken over by twats and lowlifes in THE suits.",
				"added": 1592385357
			}
		],
		"1592307347_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 39,
				"body": "> [styromaniac](#comment_2341_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): http://127.0.0.1:43110/17gCoQDCAAoQkzKRiajFNUAhnVD2gSNmuC/?:17wWFMe7AyJx4qvFLfoepvQnGHTfcPG8N9:0\n\nStyromaniac, you filthy bastard! No shame.",
				"added": 1592402443
			}
		],
		"1592432175_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 40,
				"body": "loving you,\nunbelievably weak minded undercover,\nseriously I am disappointed I expected this to be far more tough and challenging mentally and emotionally. \ncowboy job!",
				"added": 1592467523
			},
			{
				"comment_id": 41,
				"body": "> [z0net](#comment_84_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): Cexy is a disinfo agent. I've known this for quite a while. Block and move on, I suppose.\n\nCareful with the falseaccusations sweeties. You are not on a central server. Things can get _stuck_ online. Honestly I lost interest in addressing either. But if you keep smearing projecting I have a mirror here handy.\n\n> [styromaniac](#comment_2354_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I'm not frustrated anymore and never was at cexy, but I knew that it was time to improve MOAB. [...]",
				"added": 1592721609
			}
		],
		"1595854660_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 42,
				"body": "It's probably a waste of time judging by the username and slogans.",
				"added": 1595860908
			}
		],
		"1595800278_1G8RD4XVsFK1eJZQCV42moboev12debJDS": [
			{
				"comment_id": 43,
				"body": "Can you post on zerome or elsewhere in ZN? Congrats!",
				"added": 1595861038
			}
		],
		"1595854374_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 44,
				"body": "> [zeronetbackups](#comment_4_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): Backup for people having trouble with buggy zeronet... [...]\n\nLOL XD",
				"added": 1596036255
			}
		],
		"1596096685_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 45,
				"body": "Yandex.com\n\nNot recommending. Only stating it exists.",
				"added": 1596099127
			},
			{
				"comment_id": 47,
				"body": "> [driud](#comment_73_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): \n\nswisscows.com\n\nNot recommending. Only stating it exists.",
				"added": 1596288931
			}
		],
		"1596271000_17wuRqVdrEjPJodfBWTDRZA12L3iLwPNrB": [
			{
				"comment_id": 46,
				"body": "Seed on zn. I will seed it 24/7 if it helps zn. Thanks\nBTW. It's more complicated than that.ENTER: S.A. kingdom.",
				"added": 1596286196
			}
		],
		"1596305258_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 48,
				"body": "This is incredible. Thanks",
				"added": 1596316752
			}
		],
		"1611909944_1HTbdyz4zToxkxfmuYYfNVN1Y3U2yeki1N": [
			{
				"comment_id": 49,
				"body": "zeroseed4 you has interdimensional wisdom you can never understand! (mr India)\n\nIf I was your boss I would smack your face now. (go on back off, delete it)",
				"added": 1611922749
			}
		]
	},
	"comment_vote": {
		"2_16oxEAGbLsyEkLH9z6uDBWCLMMUkURTkAp": 1,
		"10_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"42_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"46_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"47_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"33_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"538_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"320_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"61_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": 1,
		"322_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"323_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"13_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": 1
	}
}