{
	"next_topic_id": 7,
	"topic": [
		{
			"topic_id": 1,
			"title": "Что Вам мешает быть счастливым ?",
			"body": "Я тут задумался чего мне не хватает для полного счастья?     \n\nВ результате пришёл к следующим возможно странным выводам.  \n\n1. Хотел бы жить в более тёплом климате.  . \n\n2. Рядом должно быть тёплое море.  У нас есть море. Но Балтика далека от понятия \"тёплое\"  \n\n3.  Пока больших проблем со здоровьем нет, но хотелось бы закрыть досадные мелочи. \n\n4. Хотелось бы жить в демократическом правовом государстве.  Чтобы была уверенность что тебя не посадят за \"неправильное\" мнение.  Чтобы была уверенность что твой голос хотя бы посчитают. \n\n5.  Несколько больше времени на свои увлечения.\n\nВы что по этому вопросу думаете?",
			"added": 1561328543
		},
		{
			"topic_id": 2,
			"title": "Рабочая газета Факел.  Все номера",
			"body": "",
			"added": 1561383368
		},
		{
			"topic_id": 3,
			"title": "Как защитится от посадки за посты в ВК",
			"body": "В Санкт-Петербурге силовики задержали жителя Новгорода Владимира Тимошенко, который ранее провел два года в колонии за пост в соцсети «ВКонтакте». Как пишет в своем телеграм-канале глава ассоциации «Агора» Павел Чиков, по предварительным данным, теперь Тимошенко вменяются в вину призывы к экстремизму из-за поста, написанного раньше того, за который его судили.\nПо словам Чикова, о задержании Тимошенко сообщила его жена, которая поставила в известность о случившемся адвоката «Агоры» Виталия Черкасова. «Его задержали полтора часа назад. Сказали, что из ФСБ Новгорода. Запретили звонок жене и мне. Сейчас к супруге Тимошенко домой приехали эти самые оперативники ФСБ, опрашивают ее по очень старому посту мужа во „ВКонтакте“. Интересно, что он был опубликован еще раньше, чем тот, за который Владимир два года провел в колонии. Оперативники сообщили жене, что Тимошенко вменяют публичные призывы к осуществлению экстремистской деятельности (статья 280 УК РФ). Сейчас Владимира должны привезти домой, вероятно, для проведения обыска», —приводит Чиков рассказ адвоката.\nЗа пост в соцсети Тимошенко был осужден в конце ноября 2017 года. Он был признан виновным в возбуждении ненависти к социальной группе «служащие учреждений и институтов государственной власти» (часть 1 статьи 282 УК РФ). По версии следствия в январе 2015 года Тимошенко, находясь в колонии Новгородской области, надиктовал своей невесте по телефону и попросил опубликовать с его страницы во «ВКонтакте» текст о «ситуации на Украине», «силовом репрессивно-карательном аппарате» России и ее президенте.\n\nЧто тут можно сказать?\n\n1.1 \n\nУдаляйте ВСЕ посты из vk.com.\nВСЕ - значит реально все а не только то, что было на вашей стене. Удаляйте реально всё.\n\nНайти старые посты можно при помощи google.com и yandex.ru <ваше имя> site:vk.com. Придётся потрудится поискать вокруг найденных коментариев другие. Есть и другие способы. Например найти все упоминания человека можно так: https://vk.com/feed?obj=1&q=&section=mentions\n\nИЛИ\nИтак:\n1) Для начала нам нужно узнать ID-страницы, комментарии которой мы хотим найти. Это все очень легко делается, я думаю вы справитесь.\n2) Далее используем данную ссылку. Вместо \"СЮДАИД\" вставляем ID пользователя, вставляем в строку браузера, нажимаем Enter и получаем то, что нам нужно.\nhttps://vk.com/feed?obj=СЮДАИД&q=&section=mentions\n\n1.2\nУдалить свои посты из групп где вас заблокировали также возможно не всегда. Через API vk.com\nесли группа открытая, зайди в неё режиме «инкогнито» (Chrome, Ctrl+Shift+N) или «приватного просмотра» (Firefox, Ctrl+Shift+P) и скопируй ссылку на нужный комментарий. Она имеет вид http://vk.com/wall-X_Y?reply=Z, где -X — owner_id, Y — post_id и Z — comment_id. Если группа закрытая, придётся влезть в неё другим аккаунтом или попросить скинуть нужную ссылку кого-то из участников. Затем заходишь на страницу http://vk.com/dev/wall.deleteComment, вставляешь полученные параметры в соответствующие поля и выполняешь запрос. Параметр owner_id нужно указывать именно с минусом.\n\nСрок давности за пост идёт только с момента его удаления. Считается, что пока экстремисткий пост висит это для щиеся преступление. Примерно как храннеие запрещённых веществ или оружия.\n\nvk.com позволяет восстановить удалённую страницу в течении СЕМИ МЕСЯЦЕВ.\nЕсть и хорошие новости:-) vk.com получае от полиции и ФСБ много запросов и по рассказам может отвечать на них месяцами.\nНапомную, что удалять страницу можно только после удаления всех постов, записей на стене, фотографий, аудиозаписей, документов, разговорв и запроса в ВК копии всех своих данных подписанных ил pgp ключём (эту копию кладите на зашифрованный том а его в тайник - на случай если будут фальсифицировать улики)\n\n4.\nПосле удаления из ВК - чистим историю броузера, кэш. кукисы, скаченные файлы.\nЕсли кто ещё не знает в альтернативных потоках Windows и расширенных атрибутах в Linux могут сохранятся URI откуда был скачен файл.\nМожно ещё \"потерять\" sim карту и телефон, но это уже на любителя.\n\n5.\nНи в чём не сознаёмся. Отвечем на вопросы только в присутствии СВОЕГО адвоката\nОбязательно заказываем свою экспертизу вменяемых вам материалов на экстремизм и в случае положительного для вас результата (т.е. экстремизма нет) приобщаем к делу (суд не может отказать в приобщении)\n\n6.\nЕсли vk.com всё же нужен регистрируемся на левую sim вставленную в левый телефон, который дома и на работе не используете и с собой во включенном состоянии не возите.\nХодим через Tor",
			"added": 1561458183
		},
		{
			"topic_id": 4,
			"title": "Забастовка крановщиков в Казани и успешные забастовки медиков",
			"body": "А тем временем в Казани началась забастовка крановщиков.  Бастуют члены МПРА - межрегиональный профсоюз рабочая ассоциация.\n\nС начала года также трижды  бастовали врачи скорой помощи - в Нижегородской, Пензенской, Орловской облостях.\n\nВсе три \"итальянские забастовки\" врачей и персонала скорой помощи завершились победой медиков. Требования бастующих выполнены.\n\nМедики добившиеся победы - члены профсоюза Действие\n\nUPD1\n\nК списку побед медиков добавляется Тольяти\n\nhttp://medrabotnik.org/news/italyanskaya-zabastovka-skoroj-pomoshhi-tolyatti-srabotala-eshhe-ne-nachavshis\n\n\n",
			"added": 1563980941
		},
		{
			"topic_id": 5,
			"title": "Поздравления с праздниками",
			"body": "Будем же уважаемые зеронетчики поздравлять друг друга с праздниками!",
			"added": 1565556407
		},
		{
			"topic_id": 6,
			"title": "Профсоюз ИТ работников",
			"body": "Коллеги, друзья, создаём профсоюз работников ИТ.  \n\nСейчас создание профсоюза находится в стадии инициативной группы.  В планах создание большой гильдии ИТ работников которая сможет защищать трудовые права и интересы работников а в будущем, при росте численности и силы союза заниматься и более серьёзными вопросами, например противодействии цензуре.\n\n\nБолее конкретно.  Мы создаём демократический, \"боевой\" союз работников изначальное ориентированный на активную защиту прав и интересов. \n\n\nМы будем защищать права и интересы не только в судах. \n\nНаш основной инструмент - забастовка.\n\nЗабастовка отлично приводит в себя и зарвавшегося боса и может остановить работу системы интернет-цензуры.\n\nПрисоединяйтесь!\n\nhttps://vk.com/itunion_info\nКонтактная почта: itunion@protonmail.com\nСервер на Дискорде: https://discord.gg/rfZF3Vz",
			"added": 1565952888
		}
	],
	"topic_vote": {
		"2_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": 1,
		"4_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": 1,
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"5_1BXrm8Bwf3e4DPasJ5L3txhjqhmwhcVdtm": 1,
		"1_19gRLjtUrPaPWE4KP4SsSmN5tb2VAizRwA": 1,
		"3_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": 1,
		"1_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": 1,
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": 1,
		"1_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": 1,
		"2_14JmpT6tbroLtkGYQMAkUJHQLRmqWk2pxz": 1,
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": 1,
		"2_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_1Kgy2CdXdjNQSjK6pkLasWjmza9KQ1uZE4": 1,
		"1_1DR9EVmTR2KA8mJXmzTknbEAUzveKLRJut": 1,
		"1_19ZhwcuwoeA9ciSFZHvF5Joew3pZpCUUzh": 1,
		"2_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"1_1B1waSUNg8146uRLQncLdRNwCF2ttSrAtk": 1,
		"1_1e2mHauMGG8GgSDvaaPrNanxvaxwpGQRV": 1,
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"4_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"5_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"6_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"1_1MhiMP1PsbfA5VATp5RBz5bxmttVssCAYK": 1,
		"3_16ub71RfMGUoih2scMmudMUdiuJubCWWFb": 1,
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": 1,
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": 1,
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": 1,
		"1_19vb3KdkTdVe3RCfqVvSPHSLZg1jZu6T6k": 1,
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"2_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": 1,
		"6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": 1,
		"8_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"1_1GuuFYgC7KRWLzw9Q4wEJsiLyJMimFcxAN": 1,
		"2_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": 1,
		"1_1HVtb9ohKcH19u1Cp3WrwTJipYdm1P6ceE": 1,
		"1_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2": 1,
		"1_1JAiKS3giLzSw1YQWZPVAct377nyiApDW2": 1,
		"1_1NxH7JC6pHRkfyzg8fX7bKwdbEA3gCnkuk": 1,
		"2_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": 1,
		"3_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"1_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"1_1JJoeimWbdW8iRd5dpgE7CJ5gAQVGphQFB": 1,
		"2_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg": 1
	},
	"next_comment_id": 137,
	"comment": {
		"4_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": [
			{
				"comment_id": 1,
				"body": "Теоритически для уголовного преследования необходимо доказывать вину в распространении противозаконного контента. Но учитывая особенности работы полиции в России есть большая вероятность посидеть в СИЗО  и на зону отправится, да и вина бывает в форме неосторожности.  Опасность есть и она вполне реальная.                                                                                                                                                                                     Поэтому крайне рекомендую:                                                                                                                                                                           1. Используйте ZeroNet поверх Tor или размещайте ZeroNet на VPS за границей, лучше купленной на левуе имя. Соединйтесь с ней как минимум по ssh а лучше через tor или i2p скрытй сервис.                                                            2. Установите ZeroNet на зашифрованном томе, можно на зашифрованной флешке или сетевой шаре (особо хорошо в сочетании с VPS). Шифруйте с ключевым файлом, ключевой файл на отдельной флешке которую можете всегда сломать или выбросить (лучше в завале других внешне неотличимых файлов, например фотографий близких)                                                                                                                                                                                           3. Не посещайте явно противозаконные ресурсы:-)                                                                                                                         4. Заведите отдельный \"пустой\" экзеиляр ZeroNet                                                                                                                                        5. Ни в чём не сознавайтесь, ни что не подписывайте без адвоката                                                                                                              (а если занимаетесь чем-то сколь-либо опасным, то адвокат у вас уже должен быть и его ФИО, номер в реестре зазубрены, телефон в быстром наборе, и подписанный вами адвокатскоий ордер у него в кормане:-))\n",
				"added": 1561250006
			},
			{
				"comment_id": 3,
				"body": "> [geekless](#comment_122_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Например, этот. :D\n\nНа этом форуме практически ничего преступного нет.",
				"added": 1561315428
			},
			{
				"comment_id": 17,
				"body": "> [if0](#comment_45_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Нюанс заключается в слове \"практически\". Вы просмотрели каждый комментарий в каждом топике данного форума? А ведь вы их все сидируете в этот самый момент... И если не используете прокси, то тов. майор может скачать этот форум с вашего IP и заполучить прямое доказательство факта распространения некого контента.\n\nЯ с Вами согласен, что возможность подобной ситуации крайне существенна.  Такова практика. Считается что любой репост уже распространение.  Репост правда требует от человека осознанных действий, ZeroNet же распространяет информацию без прямого волеизъявления пользователя.  Для уголовного права это должно быть существенное отличие.  Увы в России качество уголовного судопроизводства ниже плинтуса.  А помимо уголовного права есть ГК и административный кодекс. По поводу ГК было решение тогда ещё Высшего Арбитражного Суда о том, что для наступления гражданской ответственности наличие вины необязательно. Решение было по поводу распространения пиртчины в торрентах.  К ZeroNet оно применимо полностью. Административный кодекс также допускает объективное вменение,  чем ЦПЭ пользуется.  Но по административному правонарушению по счастью нельзя выписать ордер на обыск или прослушку.",
				"added": 1561325792
			},
			{
				"comment_id": 20,
				"body": "> [if0](#comment_47_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Выходная нода Tor также \"передает и распространяет контент без прямого волеизъявления\" ее владельца. Только здесь аргумент: вы предприняли осознаные дейтвия по ее поднятию, осознавая, что она \"может распростанать\". Аналогия: находясь за рулем транспортного средства вы не имели намерения причинять увечия несовместимые с жизнью переходящему перед вами пешеходу. \n> \n> Все хуже: в форуме может присутствовать тред вербовщиков из запрещенной организации - тогда это будет гарантированная уголовная статья. Привлекут не их (они знали и использовали прокси), а кого легче и быстрее поймать - очердного \"мамкиного любителя свободы\", который прочитал про ZN и бросился сломя голову его запускать.\n\nВаша аналогия НЕ верна. Автомобиль - источник повышенной опасности.  ZeroNet - нет.  Поэтому если подходить строго юридически пользователю ZeroNet скорее грозит гражданская внедоговорная и административная ответственность, но не уголовная.  Это в теории.  Реальное правосудие в России давно в разобранном состоянии. Верховный Суд два раза выскал постановления по делам об экстремизме и на оба постановления суды и прокуратуры не обращади внимания.  И несмотря на тотальное игнорирование его же постановлений Верховный Суд не отменил ни одного приговора по экстремистким статьям, даже когда они были вынесены с жесточайшими нарушениями его же постановлений.",
				"added": 1561329225
			},
			{
				"comment_id": 23,
				"body": "> [if0](#comment_49_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Видать у них была разнарядка, спущеная сверху - вынести определенное количество приговоров по оределенным статьям, с целью показательного запугивания. Вот если бы против самих судей могли возбуждать дела за нарушение судопроизводства, причем с полным пересмотром всех их дел.\n\nВ судах разнорядки нет.  Причина в другом       \n\n1. Судьи в России назначаются чаще всего из состава прокурорских работников или что совсем плохо - секретарей судов. Секретарь не может стать нормальным судьёй. Просто совсем разные качества личности.  Судей вышедших из адвакатуры почти нет.    \n                                                                                                                                               \n2. Процесс отбора в судьи федеральных судов закрытый.  Формально их назначает Президент, но реально он опирается на мнение специальной комиссии где главенствует ФСБ.  ФСБ формально проверяет прошлое кандидата и докладывает Президенту, но вот сохраняет ли это ведомство для себя компромат на судью - вопрос интересный.\n\n3. Судьи очень зависят от председателей судов. Председатели это отдельная каста в судейском сообществе. Это и есть основной механизм влияния на судей.\n\n4. Судей наказывают за пересмотренные вышестоящей инстанцией дела.\n\n5. Судьи очень загруженны.\n\n6. Вопросы социального обеспечиния судей, например вопрос с служебным жильём это постоянная чехарда, то дают то не дают.  Это усиливает зависимость судьи от председателя.                                                                                             \n\n7. Назначение судей с испытательным сроком позволяет отсеивать тех кто не очень управляем председателем суда.                                                                                                                                                                                                 \n\nПрактически основные проблема из за пунктов 1, 3-7. Пункт 2 скорее относится к политическим делам.",
				"added": 1561356522
			},
			{
				"comment_id": 28,
				"body": "> [if0](#comment_52_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Кратко резюмируя - полный беспросветный мрак, без намека на надежду выхода из порочного круга. Откуда возмется незваисимый суд, если он под колпаком гэбистов (которые все сильнее наглеют в последнее время) и ключевые решения выносятся \"по звонку\".\n\nДа это политический вопрос.  Любая разумная реформа судов упирается в политический вопрос - кому это нужно. Текущему режиму в России это точно не нужно.  Возможно но не факт, что это будет нужно последующему режиму т.к. это скорее всего будет буржуазная демократия или классическая буржуазная диктатура. Вот в первом случае нормальные суды и потребуются. Во втором случае это также возможно но в ограниченном объёме. Поживём увидим.",
				"added": 1561383599
			}
		],
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 2,
				"body": "> [if0](#comment_41_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Это шутка такая? Ставить и не беспокоится о приходе тов. майора который обнаружит на нем переписку членов зпрещенных организций, оскорбления власти и прочие призывы, которые вы лично публично распространяете...\n\n1. Шифруйте диск.  Да все знают, но не все делают.\n\n2. Используйте (шифрованный!)  RAM диск.  В случае чего просто ребутаете машину (а может и сами ребутнут)\n\n3. Для шифрования используйте ключевой файл или даже набор файлов которые можете уничтожить например сломав флешку. Да и сам ключевой файл должен лежать в куче других файлов\n\n4. Если уж у вас организация - распределите ключевые файлы между доверенными участниками. Кворум ключей.\n\n5. Чистите историю. Нужно хранить только, то, что реально нужно.",
				"added": 1561278595
			},
			{
				"comment_id": 45,
				"body": "> [geekless](#comment_146_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Сломать флешку? Так и представляется сцена из фильма, где хакеры дружно кидают носители информации в микроволновку, а сами сбегают через секретный коридор ровно за секунду до того, как группа захвата выбьет двери.\n> В реальной жизни попробуйте сломать флешку за секунды, пока вам выбивают дверь. Не корпус, а чип.\n\nМолоток держите под кроватью - ломает норм.  Я раньше делал так, брал SD, октрывал корпус и держал молоток рядом. Если что можно прямо по чипу попасть.\n\nМожно зажигалкой чип погреть.  Зажигалка хороша тем что вопросов в общественном месте не вызывает.\n\nЕсть ещё лайфхак. Нанимаете нормального адвоката. Нормального блиять!  Если приходят с обыском, требуете чтобы его позвали.  Тут есть важный момент, вы должны помнить не только ФИО и телефон, но и номер в реестре, ещё должен быть у вас городской телефон, смартфоном воспользоваться не дадут, а у адвоката должен быть постоянно с собой ваш адвокатский ордер.\n\nТак вот пока обыскивают флешка у вашей подруги или жены или сестры или кто там есть женского пола. Это важно потому, что для личного досмотра требуются сотрудники того же пола. Вас досмотрят с большей вероятностью\n\nПотом приходит ваш адвока и ваша подруга или эена отдаёт ему флешку со словами - ой Сёрженька, прошлый раз вы у нас были и забыли!\n\nАдвоката просто так досмотреть и обыскать уже нельзя. Вернее можно но потом гемор у полицаев будет.",
				"added": 1561458529
			},
			{
				"comment_id": 46,
				"body": "> [if0](#comment_46_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Анонимно? В Чебурнете?!  %-)))\n\nДа можно и такое. Можно поламать чужой сервак, можно через арендованный ботнет загрузки сделать и постаивтьс воё ПО, можно на левую sim завести карточку и оплатить ей, можно админа подкупить наликом. Да блять полно способов если головой работать.",
				"added": 1561458638
			},
			{
				"comment_id": 48,
				"body": "> [if0](#comment_43_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Речь, вообще то шла о рисках, сопровождающих поднятие \"у себя дома\" публичного сервера для Matrix, который должен работать постоянно и хранить данные, необходимые для его работы...  А не о безопасности переписки в нем или любом другом мессенджере.\n\nТогда вообще не парьте голову. Если не хотите становится героями и готовы просто отдать логи и пр - придут спросят отдадите.  Ну может на особо дубовых ментов попаёте обыск устроят, кавордак дома и несколько часов беседы в участке  и сервак отнимут. Если будите сотрудничать последствий не будет.",
				"added": 1561458886
			}
		],
		"1_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": [
			{
				"comment_id": 4,
				"body": "> [midnight](#comment_1_1D6npYBZc43Bv1a62Fg689SDcFdthJSFt): Почему \"Вы\" постоянно ругаете Путина?Почему вы ничего не говорите про медведева? Губеров в своих регионах? и других чиновников?Когда Путин ездил по регионам и проводил встречи, почему не спрашивали про окуевших чиновником/глав?Почему вы не прочитали конституцию ведь там пзд полный, к примеру \"президент не имеет права не подписывать\"(107 ст. 3 часть). и комментарии типа \"нах он нужен тогда\" или \"груди-ниный или собачка смогли бы\" это просто слова девочки-далбае№а.\n\nВсе они пидорасы",
				"added": 1561315663
			},
			{
				"comment_id": 5,
				"body": "> [nononono](#comment_61_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N): Никак нет.\n\nТоварищ капитан, Вас повысили до майора сегодня.",
				"added": 1561315700
			},
			{
				"comment_id": 85,
				"body": "С утверждением вынесенным в название темы спорить сложно.  Вопрос в том что же делать с этим печальным фактом.  \n\nЗЫ\nЗамечу что в соседних странах дела обстоят не сильно лучше",
				"added": 1564869585
			},
			{
				"comment_id": 105,
				"body": "> [zerg0](#comment_10_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): Это можно легко предотвратить. Выбираем бабу ;-)\n\nКрасивую.  А то у нас часто портреты президента вешают. Пусть хотя бы будет приятно для глаз:-)",
				"added": 1565111608
			},
			{
				"comment_id": 108,
				"body": "> [if0](#comment_201_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А потом окажется, что это мужик, поменявший пол :-) Вот все обламаются...\n\nнадо сделать как при выборах Папы Римского. Там кардиналы сидят без штанов - чтобы всем был виден пол потенциального Папы, а то говорят веке в 9-ом по ошибке женщину выбрали а она ещё и забеременела:-)",
				"added": 1565117069
			}
		],
		"6_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 6,
				"body": "> [richarddik](#comment_1_18NR6h5bG2eKpwirFLvF8rg57LipdgSQEY): демократия это амерский торговый бренд.\n\nЭто не так. Демократия один из видов политического устройства общества.  Очень хороша тем, что при прочих равных устройствах позволяет учитывать интересы гораздо большего количества членов общества чем недемократические формы политического устройства того же общества.",
				"added": 1561315912
			},
			{
				"comment_id": 7,
				"body": "> [jsitr](#comment_4_16ub71RfMGUoih2scMmudMUdiuJubCWWFb): исторически так сложилось ну это в россии еще со времен красных когда они  убили царя и его белых сторонников и с этих времен у нас вся страна красная режимная зона\n> а вообще тут всем похуй на политику вам нужно идти на политические формы http://127.0.0.1:43110/Sites.ZeroNetwork.bit/ раздел Politics\n\nВ СССР при всех его особенностях учитывались интересы большего количества жителей страны чем во времена монархии.",
				"added": 1561316008
			},
			{
				"comment_id": 19,
				"body": "Автору темы увы нужно учится. Меньше ЧСВ.  Меньше политики. Вы не спаситель Отечества и дежурным за Россию Вас никто не назначал.  Займитесь сиситематическим изучением гуманитарных наук. Начните с Флобера и Тойнби.  Адама Смитта не обделите вниманием.  Фукетида не забудьте.  И Вы гарантированно придёте к успеху. Найдёте способ установить демократию в России. Я не ёрничаю.",
				"added": 1561326365
			},
			{
				"comment_id": 21,
				"body": "> [if0](#comment_51_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Она в первую очередь учитывает интересы властной элиты, которая спланированными манипуляциями, возможными благодаря мощному финансовому ресурсу, формируетет так называемое \"общественное мнение\", выгодное для себя. При этом создается видимость \"учета интересов большинства\", потому что, как раз такое виденье было целью направленной фабрикации.\n\nЭто одна из мифилогем \"патриотической общественности\" в России. Если бы демократия, например в США была бы сугубо фейком то не было бы там ни аболиционисткого движения, ни постоянной борьбы за те или иные вопросы свободы и права, например Циммерман не стал бы распространять свои алгоритмы.\n\nВы путаете иллюзорную \"управляемую демократию\" в стиле современной России и демократию вообще.\n\nЯ понимаю психологические основы этой мифологии. Трудно себе признаться что есть люди живущие более свободно. \nЗЫ Кстати США в плане социальных прав далеко не в переди планеты всей\n",
				"added": 1561355806
			},
			{
				"comment_id": 22,
				"body": "> [if0](#comment_50_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Демократия - недостижимая утопия, как коммунизм или социализм. Она всего лишь ширма для удобства легитимации узурпированной у народа власти.\n\nсъездите в США или хотя бы в Финляндию в период выборов в местный совет. Возмите небольшой городок и понаблюдайте как выбирают мера или городской совет. Потом сравните с выборами в аналогичном городе в России.\n\nЗнаю тяжело признаться себе, что точно такие же люди добились гораздо большего уважения к себе и учёта своих интересов.\nНо лучше горькая правда.",
				"added": 1561356029
			},
			{
				"comment_id": 24,
				"body": "> [geekless](#comment_125_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Меньшего, чем если бы РИ нормально эволюционировала в национально-буржуазное государство наподобие Франции, а не этот красный уголок.\n\nЭто было невозможно.  Российская Империя имела слишком большие феодальные издержки, слишком низкую платёжеспособность населения для формирования достаточного внутреннего рынка,  не было доступа к внешним рынкам и при этом ведущие державы уже вступили в стадию империализма.  Возможно если бы удалось избежать участия в WWI РИ и эволюционировала так как вы описали, но избежать этого было практически невозможно. Нужен был доступ к морским путям т.к. нужны были рынки.  Но наличие больших остатков феодализма делало РИ нежизнеспособной в условяъх мировой войны.\n\nВ результате WWI распалась не только Российская Империя. Распалась и Австро-Венгерская монархия и Турецкая Империя. Германия стала республикой а в от Британии отделилась Ирландия и произошло восстанвие в Южной Африка.\n\nЕсли уж Германия не могла безболезненно пройти это испытание, то надеется на подобное в отношении РИ было бы верхом наивности.",
				"added": 1561382636
			},
			{
				"comment_id": 25,
				"body": "",
				"added": 1561382652
			},
			{
				"comment_id": 26,
				"body": "> [if0](#comment_59_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Как можно сравнивать выборы с голосованием?\n> Да, люди добились большего уважения к себе, но они по прежнему ни чего не решают, не имеют слова и веса, им разрешают вмешиваться только в какие-нибудь несущественныек локальные вопросы в своей деревне, на этом демократия заканчивается. Да можете идти маршем и выступать на площадях, только для людей реально решающих вопросы на государсвенном уровни, эти выспупления воспринимаются, как анекдот про гей-парад. Сколько уже Желтые Жилеты буянят, а что толку?\n\n1. В России граждане не ни на что влиять даже на уровне мунициполитета.  Неплохо было бы с чего-либо начать\n\n2. Наличие демократии не обозначает автоматическго торжества добра или воли большинства.  Демократия даёт такой шанс, но не гарантию. Правящие классы, несмотря на свою малочисленность очень организованны и могущественны, поэтому даже в условиях демократии народу следует постоянно бороться за свои интересы. Как только это борьба народа ослабивает или народ от неё отказывается, тут же его интересы приносятся в жертву интересам буржуазии.  Демократия это всего-оишь способ вести эту борьбу легальным, мирным путём. Не восстанием или террором а  в области выборов, референдумов и судебных процессов.",
				"added": 1561383150
			},
			{
				"comment_id": 27,
				"body": "> [if0](#comment_60_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \"Красный уголок\" жив до сих пор, вернее сказать - его специально созданная мифологизировнанная копия, и продолжает во всю гадить, сбивая людей с толку. Так устроена человеческая память: хорошее, яркие моменты жизни лучше запоминаются, чем неприятные. Людям хочется чем-то гордиться. Когда нет возможности гордиться настоящим, начинают излишне усердно \"избирательно вспоминать\" прошлое. Тем более в то время проходила молодость - лучшее время в жизни. Уголок продолжит гадить в мозг, пока к власти не придет поколение которе не только само не родилось в ту эпоху, но и не было рождено  воспитанно теми, кто успел застать то время в разумном возрасте.\n\nЕсть объективные цифры показывающие огромное превосходство СССР над РФ или над странами запада.  Вы в курсе, что в США нет бесплатной медицины или высшего образования?  В СССР это была норма как минимум с начала 50-ых. Вернее даже раньше, но тогда не охватывало всю страну.",
				"added": 1561383268
			},
			{
				"comment_id": 29,
				"body": "> [geekless](#comment_134_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): США живо, а СССР уже нет -- была ли по Сеньке шапка с бесплатными медициной и ВО? Промышленность СССР активно заимствовал с Запада, но во многих областях сформировать собственной инженерной и научной школ не смог, так и оставаясь на искусственной вентиляции легких до самого распада. Устойчивой воспроизводимой культуры, кроме культуры гэбистов, в СССР так и не завелось.\n\nВ истории уже были случаи когда продвинутое общество погибало по своим внутренним причинам уступая место более архаично общественной конструкции.  Примеры - итальянские города-государства эпохи Возраждения.  Балтийская Ганза.  Зарождавшейся в Испании и Италии капитализм в начале эпохи трансокенаских плаваний.  Все эти очаги будущего погибли уступив место новой волне феодализма.\n\n\nБыл ли способен СССР поддерживать экономически и высокие социальные блага и гонку вооружений?  Да был способен.  Причины падения этого общества столь же необычны как и его природа.  До СССР в мире не было социалистических обществ и поэтому даже его создатели - РСДРП(б) не знали с какими сложностями оно столкнётся.  \n\nПадение Венецианской Республики или Флоренциии или распад Ганзы не стало концом капитализма. Падение СССР также не является запретом на существование в будущем других социалистических обществ.",
				"added": 1561384062
			},
			{
				"comment_id": 30,
				"body": "> [geekless](#comment_139_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Я не утверждаю, что социалистический строй по своей сути эволюционно менее приспособлен, чем капиталистический, но у меня нет и оснований полагать обратное. Пока все реальные исторические примеры будто бы подтверждают эту закономерность. В то же время, сама природа человека, насколько я её понимаю, подталкивает к капитализму, но не к социализму. Для социализма с человеческим лицом, а не с гэбистами, нужен такой существенный сдвиг в социальных навыкахз и культуре абсолютного большинства граждан, что сложно даже фанатазировать, сколько столетий для него потребуется.\n\nВ течении этого столетия, вернее в ближайшие 20-25 лет уже сможем наблюдать новое социалистическое общество.\n\nОснование социализма - не психологические и не моральные а экономические.\n \nКонкртено следующие - конечность количества людей на планете => конечность рынков => падение нормы прибыли / устремление периода окупаемости любого проекта в бесконечность\n\nМожете посмотреть новости о сопернечестве UK и Германии в конце 19-го начале 20-века и поискать аналогии в современности.\n\n\n> «Продались за джинсы и 100 сортов колбасы»?\n\nНеспособность руководства СССР одновременно снижать уровень отчуждения труда, управлять вложениями в условиях когда период возврата инвестиций стремился в бесконечность и ограниченности трудовых ресурсов (людей в СССР было всего 250 миллионов).\n\nНа самом деле и сейчас нет моделей которые гарантировали бы принятие корректных управленческих условий в подобной обстановке.",
				"added": 1561385193
			},
			{
				"comment_id": 31,
				"body": "> [if0](#comment_67_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Именно. Людям приходится доказывать, что они плохо живут, с ними поступают по скотски, но они еще упираются и доказывают вам обратное: у нас все - хорошо, там у них - намного хуже. Пусть будет так, как есть, а то вдруг станет хуже...  Вот он - \"красный уголок\" в действии.\n\nЭто абсолютно нормальная психологическая реакция людей действующая  в любом обществе.",
				"added": 1561385253
			},
			{
				"comment_id": 38,
				"body": "> [geekless](#comment_141_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Экономические основания следуют из характеристик человека как экономической единицы — как он принимает решения, чем руководствуется. Поэтому пока человек то, что он есть, что-то тут фантазировать смысла нет.\n> Если же говорить о других объективных факторах, влияющих на экономику:\n> \n> То как из этого следует переход к социализму?\n> \n> Если перевести с марксистской тарабарщины на простой язык, то же самое и получится. Людям надо было 100 сортов колбасы и Жигули 6-й модели, а не вот это всё. \"Людям\", кстати, означает и руководству государства тоже, они же не инопланетные роботы вне экономической модели.\n> А ограниченность трудовых ресурсов ставит крест на утопиях, которые рассматривают сферическое производство в вакууме.\n\n1.  При переходе отрабовладения к феодализму изменения \"природы человека\" не потребовалось. ТОчно также при переходе от феодализма к капитализму.\n\nИзменяются условия - меняется поведение людей\n\n2.  \n> То как из этого следует переход к социализму?\n\nПравящий класс более не будет способен принимать никаких решений т.к. любое решение приводит к ухудшению его положения - клинч власти и управления\n\nРабочий класс в этом клинче не участвующий,  умирать не планирует и поэтому становится единственным субъектом кто может вести нормальную деятельность.\n\nЗдраствуйте перед вами социалистическая революция.  Прямо по Ленину - верхи не могут, низы помирать не хотят.\n\n\n3. Если бы вы вместо гордого заявления о \"тарабарщине\" утрудились бы ущнать что же такое отчуждение труда - поняли бы о чём речь.\n\nОтчуждение это не только изъятый прибавленный продукт, но прерващение человека в инструмент, приложение к неодушевлённому предмету и такой же предмет.\n\nПрибавленный продукт в СССР никто в прибыль не обращал. Проблема отчуждения в СССР состояла в массовом производстве в котором человек действительно становился частью машины.  Но октазаться от этого массового производства было нельзя т.к. требовало с одной стороны больших вложений с неясными перспективами с другой стороны вело бы к падению производства.\nПри этом правительство не могло позволить снижать зарплаты рабочим - оно же правительство коммунистической партии но должно было выруливать между необходимостью вложения  средств в новые производства, желательно инновационные а значит рискованные (неясно было заработают они или нет) и поддержанием текущего массового производства.\n\nВот между этими требованиями они и не смогли сделать выбор. Возможно конкретно для СССР его и не было.\n\nВ результате обилие денег на руках привело к дефициту т.к. цены повышать также было нельзя - социализм же (в условиях капитализма то же самое ведётк  банальной инфляции).",
				"added": 1561387239
			},
			{
				"comment_id": 40,
				"body": "> [if0](#comment_73_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Не один прогрессивный строй не построится без определенного уровня самосознания каждого члена общества. У человека - животная, хищническая природа, от которой не так просто уйти, она время от времени проявляется и сильно влияет на поступки. Каждый член общества должен осознать, что в случае, если его поступки не будут направлены на благо системы, то система перестанет работать должным задуманным образом и он сам от этого в перспективе проиграет. Причем это понимание должно прийти самостоятельно, а не из страха перед наказанием за нарушение правил. Ну и разумеется сама ситема не должна провоцировать людей на нарушение или поиск лазеек и обходных путей, поощряя неравенство, несправедливость и всего прочего, способного подорвать исреннее доверие к системе.\n\nВот сейчас все осознают вред например корпоративной коррупции для себя в некой далёкой перспективе?\n\nТем не менее капитализм существует и от корпоративной коррупции погибать явно не спешит.\n\n\n\n\nТочно такая же ситуация будет и с социализмом.  Да будет большое количество сторонников коммунистических  идей.  WWIII обеспечит очень чёткое понимание многими людьми своих витальных интересов.  Но также будет и большое количество людей для кого это будет странной и непонятное реальностью.\n\nДа и новые социалистические страны будут разными.",
				"added": 1561388184
			},
			{
				"comment_id": 42,
				"body": "> [geekless](#comment_143_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Описание того, что капитализм живучее социализма.\n\nПо этой логике федоализм живучее капитализма.  И действительно вон весь Средней Восток в него погружается. В России Кавказ там уже.  \n\nЕщё немного подумав вы откроете Второе Начало термодинамики и подобно немецким философам 19-го века предскажите тепловую смерть вселенной.\nЭто конечно неплохо, что Вы думаете своей головй, но отркывать своим умом всё что было до этого открыто человечеством немного неэффетикно.  Жизнь  у нас одна и она кортокая:-)",
				"added": 1561457850
			},
			{
				"comment_id": 43,
				"body": "> [geekless](#comment_144_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Фактически, вы описываете понятное явление: крах корпорации в условиях неэффективного управления. Если рассматривать СССР как предельный случай мега-корпорации, которая загнулась на основе обычных законов рынка, то всё ясно. Если наполнить это мистическими заклинаниями по Марксу, получается небывалое явление. Но зачем, если бритвой Оккама можно порезать избыточные теории.\n\nТак и есть.  Но это не проблема т.к. ошибки можно и не повторять.  Вот для капитализма в силу конечности рынков сбыта вообще нет никакого будущего. Даже если капиталистическим обществом будут управлять не совершая ни одной ошибки оно всё равно обреченно.",
				"added": 1561457933
			},
			{
				"comment_id": 60,
				"body": "> [sf24](#comment_5_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb): Есть способ, дождаться когда те кто наверху постареет, отупеет, умрут а дети их совершат ошибку.Тогда можно их сместить и уничтожить, дальше вам нужно годами изучать управления людьми и передать все своим детям. И это не все вам так же нужно закрепить людей за своими потомками а не за собой, если вы это не сделаете ваши типо друзья, браться, или типо коллеги сместят вашего наследника и поцапаюца или решат все между друг другам. Это будет до тех пор пока не придет другой человек и не сделает все правильно.Например что сделал Путин эта хуета, как только он свалит все его окружения и все что он создавал начнут вести переговоры между собой а не перед новым президентом. В итоге мы имеем много богатых людей которым насрать на людей, и на страну.\n\nВсё верите что придёт кто то и сделает всё правильно?  \n\nЯ вам секрет открою. Ни кто не придёт и не сделает вам хорошо. Просто всем похую на вас.  Вот ходят бабки молятся в церковь а у Гундяева яхты строятся. Вы точно такой же просто у бабок есть Христос а вы своего мессию даже и не знаете.",
				"added": 1561469236
			},
			{
				"comment_id": 69,
				"body": "> [fuckyiu](#comment_3_1EFVSP6542BBE2eEaqirrGCFUm4LsuUbha): Русские рождены рабами. Иван где родился, там и пригодился.\n\nмайдаун?",
				"added": 1563980747
			},
			{
				"comment_id": 70,
				"body": "А тем временем в Казани началась забастовка крановщиков.  Бастуют члены МПРА - межрегиональный профсоюз рабочая ассоциация.\n\nС начала года также трижды бастовали врачи скорой помощи - в Нижегородской, Пензенской, Орловской облостях.\n\nВсе три \"итальянские забастовки\" врачей и персонала скорой помощи завершились победой медиков. Требования бастующих выполнены.",
				"added": 1563980907
			},
			{
				"comment_id": 83,
				"body": "> [zeronetuser152](#comment_5_1sZ7tME4BoDRu1pzCykhMWeh9EtNJk2JE): А зачем тебе это нужно? Демократия не нужна России, лол\n\nРаскройте секрет как вы сумели опросить 140 миллионов жителей России?\n\nСоциологические службы, уверен за большие деньги купят вашу методику социологических исследований",
				"added": 1564869261
			},
			{
				"comment_id": 93,
				"body": "> [zerg0](#comment_13_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): Хмм... Античные греки сильно удивились бы\n\nНе только они но и римляне,  карфагеняне, жители ганзейских городов, Новгорода и Пскова, Венеции и Флоренции, Франции и Нидерландов.\n\nПричины отрицания демократии психологически понятны. Тяжело признаться себе что твоя страна обычный бантустан из 3-го мира управляемый диктатором.\nОбидно.",
				"added": 1565039527
			},
			{
				"comment_id": 96,
				"body": "> [if0](#comment_193_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Диктаторы с неба не падают... Сама возможность прихода диктатора к власти означает, что большинство населения не возражает против диктаторских методов управления в стране и внешней политике. Каждый народ заслуживает своего правителя.\n\nУвы но законы управляющие общественными явлениями столь же строги как и законы физики.\n\nПричины приводящие к той или иной политической организации общества кроются в экономики и практически никак не управляются народом.\n\nНельзя волевым усилием изменить политическую организацию общества произвольным образом. \nЕсли даже провести такую операцию практически (например опираясь на силу иностранной державы), то как только внешнее давление будет снято политическая организация вернётся в одно из \"разрешённых\" для данной экономической организации состояний",
				"added": 1565044656
			},
			{
				"comment_id": 97,
				"body": "> [if0](#comment_194_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Да что же такое надо сделать с экономикой своей страны, что бы людям захотелось стать терпеливыми рабами, да еще искренне любящего своего диктатора, который измывается со своей кликой над ними?\n\nВы употребляете очень много оценочных суждений. И весьма зря называете соотечественников (?) рабами - это и неправильное использование строго термина и просто глупая гордыня.\n\nЕсли говорить про Россию то основой диактуры в ней является три фактора\n\n1) Высокие цены на нефть и газ (они взаимосвязанны) в середине 0-вых.\n\nКвазифеодальная рента изымаяемая высшим слоем правящего класса с нефтенных компаний и Газпрома стала экономической основой дикататуры\n\n2) Те же самые газовые и нефтяные сверхдоходы позволили народу иметь довольно высокий уровень благосостояния.\n\"Крошки с барского стола\" падали как в корман провинциального бюджетника так и в карман столичного креакла.  Так или иначе но все получили немного достатка.\n\n3)  В массовом сознании было зафиксированно два момента - \"ужасные 90-ые\" (они были реально ужасны) + надежды на то что благосостояние будет и далее подниматься (а оно поднималось все 0-ые, пусть и сперерывами на кризис 2008-го)\n\nЗЫ\nНа последок - в Европе диктатуры подобные современной диктатуре в Россиии не редкость.  Испания, Португалия, Эстония, Польша, Греция, Италия - многие страны пережили подобное",
				"added": 1565045524
			},
			{
				"comment_id": 98,
				"body": "> [if0](#comment_195_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А как еще называть людей имеющих рабское мировозрение, как не рабами? Стоит различать причины и следствия. Причина  - кроется в головах, а уже потом от туда переносится на быт, эконмику, политику и все остальное.\n\n1) Первична именно экономика.  Все остальные сферы человеческой жизни подчиненны именно ей.\n\nВернее сказать даже так - основа всего есть производство материальных благ. Вот это фундамент любого общества.  Политика, исскуство, религия, мораль и т.п. есть лишь надстройки над этим фундаментом.\n\n2) Вы безосновательно делаете оценочное и нечёткое утверждение.  Раб - крайне точный юридический и научный термин. \nВольное употребление точных терминов ведёт к неверным выводам.",
				"added": 1565047342
			},
			{
				"comment_id": 99,
				"body": "> [if0](#comment_196_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тогда как называть таких людей? Подскажите, пожалуйста, научно правильный термин.\n\nПросто люди.\n\nОни ничем не хуже вас.  \nПомести вас в провинциальный моногород без возможности выбраться от туда (представьте у вас нет диплома, вы например моляр, что кстати неплохо + жена + пара детей + престарелые родители + ипотека)  и вы с удивлением обнаружите скоро, что вас намного сильнее интересует вопрос где взять деньги чтобы отправить сына в школу чем вопрос сколько же будет ещё править Россией старый ботоксный тиран:-)\n\nПрошу извинить за невольный переход на личности, у меня нет мысли оскорбить Вас.\n",
				"added": 1565047817
			},
			{
				"comment_id": 100,
				"body": "> я был с самого своего рождения и не допускал мысли, что можно строить свою жизнь как-то по другому\n\nВполне возможно что у мечты о другой жизни были бы, но вот сил осуществить их - нет\n\n> \"Просто люди\", когда их садят на черенок от лопаты - сопротивляются, а не пытаются прикинуть необходимое количество смазки для смягчения процесса, заведомо приняв неизбежность его вставления, терпя и приспосабливаясь к \"новым ощущениям\", убеждая себя, что \"так надо для моего блага\"\n\nНе всегда и не везде.  Прямо сейчас идёт забастовка крановщиков в Казани.  Это не первая и не самая многочисленная забастовка в истории постсоветской России.  Были забастовки в тысячи человек.\nВ либеральных СМИ о них пишут намного меньше чем про митинги в Москве. \nВ официальных СМИ не напишут никогда.\n\nО множестве забастовок и даже беспорядков мы узнаём после того как всё завершилось. Например зимой была забастовка на рудниках на Камчатке.  Недавно была голодовка (плохой метод - не советую так делать) на хлебном заводе недалеко от Москвы.  Были бунты в тюрьмах, о них мы узнаём часто через месяцы.\n\nПодавляются выступления \"простых людей\" намного жёстче чем московские митинги.\n\nВ Казахстане была зверски изнасилована и убита дочь профсоюзного активиста.  Во время беспорядков в Жанаозене убито множество людей. Мы даже не знаем сколько точно.  Казахстанская ГБ просто охотилась  и жестоко расправлялась со всеми кто пытался рассказать о произошедшем журналистам.\nПрофсоюзных активистов там просто пересажали в тюрьмы\n\nВ Омске на профсоюзных активистов натравили бандитов. Активистам угрожали убийством детей.\n\nТо что Вы не слышали про эти события ещё не значит что их не было.",
				"added": 1565050754
			},
			{
				"comment_id": 101,
				"body": "> тысяча, которую \"реально приперло\" и которой \"нечего терять\", поэтому она отважилась пойти на перекор системе   \n\n-   бастуют (притом успешно) совершенно не те кому \"нечего терять\".\n\nПростой пример - текущая забастовка крановщиков в Казани.  Крановщики как раз зарабатывают больше других строителей, это \"элита\" стройки.\n\nУспешные массовые забастовки это всегда \n\nа) Забастовки квалифицированных рабочих\nб)  В основе забастовки лежит уже созданная организация и имеется чёткое руководство\nв)  Много молодых рабочих.  Возрастной водораздел сейчас проходит примерно по 35 лет и постепенно сдвигается вверх\n\n> не способна изметить мировозрение миллионов, \n\nМеняется притом в положительную сторону.  Количество забастовок растёт.  Профсоюз врачей Действие вырос в 2,5 раза за последний год.\n\n> на согласии и покорности которых держиться диктатура.\n\nДиктатура держится на экономике.  Согласие или несогласие народа роли не играет\n\n> Но почему-то на очердном \"голосовании\" большинство галочек ставится в пользу диктатуры. \n\nРезультаты голосования почти по всей стране подделываются в больших маштабах. По этому вопросу есть  хорошие статистические исследования, даже статьи на habr.com.  Если бы выборы в Думу были подсчитаны честно, то ведущей фракцией там была бы КПРФ (возможно народ и в ней бы разочаровался, но это отдельный вопрос)\n\nКроме того на выборы допускают только безопасных для власти кандидатов.  Пример - того же Навального не допустили на выборы президента в 2018-ом году.  Хотя казалось бы его шансы были очень малы, но решили и их не давать\n\n> Даже если бы и слышали, то большинство лишь \"немного посочувствует\", да и благополучно забудет, вернувшись к своим делам,  которые для них куда важнее (ипотека, дети, престарелые родители) \n\nЭти дела действительно намного важнее политики.  Люди не должны жить ради политики.\nНаоборот - политики (по крайней мере левые) должны работать для людей\n\n> чем какие-то активисты в тюрьмах, \n\nИ поэтому нужна хорошая многочисленная оргнизация, которое ко всему прочему не забывает о своих членах оказавшихся в тюрьмах,  помогает им.\n",
				"added": 1565083142
			},
			{
				"comment_id": 106,
				"body": "> Подделать можно 10-15%, но ни как не 50% или более.\n20%  было накинуто на выборах в думу в 2012-ом (могу перепутать год).  Есть примеры участков где из 15000 проголосовавших вброс сотавлял 500 голосов т.е. 30%\n\n> Идти и потрить бюллетени, коль нет кандидата или пункта \"проив всех\", что бы узурпаторы не могли бахвалится на каждом углу о своей \"легитимности\" и \"народном выборе\". Не пришел - значит - поддержал режим.\n\nНе выйдет.  Биллютееней заранее печатают больше чем голосов, заранее заполняют их и вбрасывают.\n\n> Не надо ради нее жить - надо хотя бы иметь порядок в голове - уметь отличать правду от лжи, видеть манипулирование и оценивать последствия от своего действия или бездействия - освободившись от всего, что составляет основу рабского мировоззрения. Только тогда политика не ударит в спину в \"самый неожиданный\" момент.\n\nВы требуете от людей качеств профессионального политического аналитика или сотрудника разведки.\n\nПопробуйте без доступа к интернет опросить своих знакомых, интересующихся политикой, о структуре экспорта из России - вы увидите как \"плавают\" в одном из основных политических вопросов.\n\nДля понимания - экономика России часть мировой экономики и структура экспорта фактически определяет структуру правящего класса страны. \n\n > Да кто же наверху допустит прямую угрозу своей власти?\n\nВсе и допустят. Они сейчас заняты своими делами и не обращают внимания на то что происходит в стране.",
				"added": 1565112048
			},
			{
				"comment_id": 107,
				"body": "> Там не подделывают\n\nТам как раз подделивают массово, грубо доходило до вбросов под камеру",
				"added": 1565112137
			}
		],
		"8_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": [
			{
				"comment_id": 8,
				"body": "> [tster2x](#comment_7_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF): нихрена он не безопасен эльбрус тоже вроде как в таиланде делают вернее сам кристал так что в нем из российского только название\n\nДелают в Тайване. \n\nВ плане безопасности:\n1. Оригинальный Instruction Set - машинный язык\n2. Машинный язык изначально содержит целый ряд фич в целях обеспечения безопасности. Средства против buffer overflow и т.п.\n\nЛожка дёгтя - Linux не поддерживает все фичи  Instruction Set\n\nЗато свой компилятор Си, что тоже полезно в плане безопасности",
				"added": 1561316364
			},
			{
				"comment_id": 9,
				"body": "> [deliriumgoddess6](#comment_76_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde): да хотя бы поразмышлять. А то его рекламировали на днях, хотя и давно разрабатывается.\n\nСтоит как чугунный мост. Публичных эмуляторов нет. Что убивает идею изучения сабжа на корню.",
				"added": 1561316439
			},
			{
				"comment_id": 18,
				"body": "> [qpchangoku](#comment_7_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3): Гавно учитывая характеристики и техпроцесс\n\nКстати вы тут зря так.  Тактовая частота для него не тот показатель на который стоит смотреть.  Это не Risc и не CISC, тут  ближайший аналог Itanium.  При наличии корректного компилятора он должен показывать очень большую производительность,  компилятор у МЦСТ свой есть. Выполняет ли он это условие или нет увы не знаю.  Цена на изделие убиывает всякий интерес в плане личного изучения.",
				"added": 1561326084
			}
		],
		"1_1FHnuq52Et74p1YGGFtGd2xrKTUBjEqjbm": [
			{
				"comment_id": 10,
				"body": "PROMT на изолированной виртуалке. Можно пиратский",
				"added": 1561317855
			}
		],
		"1_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": [
			{
				"comment_id": 11,
				"body": "> [ozago](#comment_1_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8): Ребята..!! А пользователь сохранится в данной сети или прйдется нового регистрировать после каждой переустановки операционки?\n\nДля сохранения сертификата достаточно вытащит один json файл из папки ZeroNet.",
				"added": 1561318142
			}
		],
		"1_1MhiMP1PsbfA5VATp5RBz5bxmttVssCAYK": [
			{
				"comment_id": 12,
				"body": "> [drop](#comment_2_1BRQVZ4JEHjbNx3vyA5FyFjvM3GYSw7c7U): это что еще за выписан с правом прописки ? у нового собственника может старый родственник приехать и прописаться ? )\n\nМожет оказаться что в покупаемой квартире зарегистрирован постоянно человек о котором вы не знали. При определённых обстоятельствах - если зарегистрированный несовершеннолетний или инвалид или если зарегистрирован давно - выписать его невозможно.",
				"added": 1561318470
			}
		],
		"1_1Ku6DJ6bJHACK1VxwWZusvZ2KsseirHg6n": [
			{
				"comment_id": 13,
				"body": "Пиры ещё вроде есть, но мало. Есть ли дизнь там - хз",
				"added": 1561318618
			}
		],
		"2_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp": [
			{
				"comment_id": 14,
				"body": "Так Россия вполне успешне к нему т.е. капитализму и идёт.  Сейчас по сути единственное отличие России от любой иной страны переферийного капитализма - слой мафизи присосавшихся к газовой трубе.  Есть большая вероятность что скоро их не станет и мы сможем видеть капитализм без всяких местных особенностей.",
				"added": 1561318768
			},
			{
				"comment_id": 15,
				"body": "> [murzazade4](#comment_17_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Нельзя внести в конституцию изменения?Где-то в конституции есть запрет на капитализм?В америке тоже читали карла маркса. Там уничтожать свой капитализм даже и не подумали.Только мы на поводу у немцев.\n\nТак США и не была переферийной страной с кучей феодальных пережитков и в WWI учавствовала так себе.  Меньше внутренних проблем т.к. не было остатков феодализма, меньше нагрузка в виде мировой войны, которой на их территории не было,  соответсвенно и не состоялась там социалистическая революция.",
				"added": 1561318948
			},
			{
				"comment_id": 86,
				"body": "> [zeromix](#comment_1_1Q9y2ZBsvFt1zn821WTMoC2dSfoZ6zNP6X): Нет у нас капитализма, пора уже это понять. Любой более менее крупный бизнес под контролем государства: прямым или косвенным. Малый и средний бизнес который во всех развитых странах является существенной долей в бюджете, занимает у нас 21%. В развитых странах 50 %. Нас душат, нам не дают работать, а если ты и прорвался в высшую лигу, то у тебя могут отобрать.\n\nПрочитайте пожалуйста до конца - longread как сейчас модно говорить:-)\n\n\nКапитализм (о чудо!) бывает и государственным.\n\nДля понимания - устройство капитализма в англо-саксонских странах с их публичными обществами и множеством миноритарных акционеров ( в США даже небогатые люди покупают акции, я не хочу пока обсуждать рациональность этого)  и капитализма в Европе с их госуподством банков как владельцев промышленных концернов  бывает очень разное.\n\nЕсли вы желаете доказать что в России нет капитализма или что он некий \"неправильный\" или \"особенный\" - обратите вниамние на доклад Алекса Фека из Сбербанк CIB (исследовательское подразделение Сбера)\n\nАлекс очень аккуратно и с цифрами показывает формальную убытоность многих проектов Газпрома.\n\nЭто можно рассматривать как существование в этих отраслях способов извлечения прибавленного продукта более хараткерных для феодализма чем для капитализма",
				"added": 1564870165
			},
			{
				"comment_id": 88,
				"body": "> [if0](#comment_179_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): \"Олигархический феодализм\", эффективность бизнеса при котором определяется степенью приближения к самодержцу, в чьих руках единолично сосредоточены государственные ресурсы, которые административно (а не рыночно) перераспределяются между вассалами-олигархами ради сохранения стабильности.\n\nПроблема НЕ в нерыночных механизмах\n\nРынок начинает сдавать позиции под властью монополий в любом развитом капитализме.  Монополии возникли ещё в конце 19-го века.\n\nТут самое главное в способах изъятии продукта в пользу представителей правящего класса.\n\nПри феодализме это строго рента.  При капитализме рента и квазирента (монополий) также бывает но никогда не становятся единственным механизмом. Всегда присутствует коммерческая прибыль и ссудный процент\n\nВ докладе Фека как раз показыватеся что рента стала для владельцев Газпрома доминирующим способом извлечения профита.\n\nНастолько доминирующим, что строго в цифрах проекты Газпрома убыточны.  Они извлекают из корпорации средства быстрее чем она получает выручку (НЕ прибыль!)\n\nЭта ситуация естественно не может продолжаться вечно.",
				"added": 1564871903
			},
			{
				"comment_id": 90,
				"body": ">Сейчас процесс образования монополий усугубляется. Монополия куда эффективней, они сливаются с государством, поэтому антимонопольное законодательство работат избранно и формально.\n\nВсё так, всё как Ленин описывал в своей статье про империализм ещё почти сто лет назад\n\n\n> \n> Прибыль при такой схеме не важна, потому что убытки регулярно компенсируются за счет госресурсов.\n> \n\nТолько не государственных а общественных. Вспомните слова известной премьер-министра Великобритании - нет никаких государственных денег, есть деньги налогоплатильщиков....\n\n> Но она может длиться годами и даже десятилетиями - насколько хватит \"подтягивания поясов\" и общего терпения.\n\nВ любом случае этот срок конечен и судя по опыту \"первого русского капитализма\" 19-го, начала 20-го века врядли может быть более полувека, притом что как минимум половину этого срока мы уже прошли",
				"added": 1564873217
			},
			{
				"comment_id": 91,
				"body": "> [if0](#comment_182_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): В этой стране так не принято считать. Когда кого-то в подворотне пытается ограбить гопник, то он сопротивляется и отбивается по мере возможностей, а когда тоже самое, или того хуже, делает власть, все считают, что это нормально, никто не робщет и даже в мыслях не допускает, что надо \"дать сдачи\".\n\nУ меня есть некоторый опыт общения с профсоюзными активистами из Европы, они описывают туже самую проблему.  За время существования \"социального государства\" народ там также очень разучился отстаивать свои права.\nТоже часто говорят зачем мне это, будут проблемы или что нужно честно работать.  Аргументов много находят\n\nТам конечно легче в том смысле что рабочии всё же понимают что они именно продают свой труд и очень хорошо понимают, что всё что мы потребляем создаётся людьми труда а не менеджерами.\nВ Европе нет тотального неверия людей в свои силы.\n\nНо проблемы и уних тоже очень большие.\n\n> \n> Еще бы дожить бы до окончания исторического периода...\n\nДожить вполне реально, даже если вам сейчас 50.  Здоровый образ жизни.  Отказ от фастфуда,  регулярные осмотры у врачей,  спорт.\n\nГлавное что это время можно не просто ждать но активно приближать.",
				"added": 1564874368
			},
			{
				"comment_id": 132,
				"body": "> [freemurzik](#comment_1_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Это брехня. Госбюджет на финансирование армии есть в любой стране и это государственные деньги. \n\nмесье не слышал про каперов  или про ЧВК?  \nАрмии далеко не всегда существуют за счёт бюджета\n\n\n>Вам пытаются внушить мысль, что Армия должна следовать не конституционному порядку, а интересам капитала. \n\nконституционный порядок, законы и приказы и есть выражение воли правящего класса т.е. устремлений капитала (в случае капиталистического общества)\n\n>Такая позиция превращает армию в вооруженных бандитов на службе капитала. \n\nТак оно и есть.  \nА вы что думаете армия защищает народ?  Жители Донбаса передают пламенный привет зашивающей их украинской армии:-)\n\n>Существует только государственная армия, которая получает именно государственные деньги\n\nпро каперов  или про ЧВК писал уже выше.\n\nВ докапиталистические эпохи так совсем всё интересно было в плане финансирования армии",
				"added": 1566219291
			},
			{
				"comment_id": 133,
				"body": "> [freemurzik](#comment_3_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): ЧВК и другие вооруженные отряды за пределами конституции - банды.\n\nмесье возможно следует изучить политическую историю.  Существуют и конечно же существовали страны в которых письменной конституции не было и нет\n\nБолее того, даже в случае государства с письменной конституцией правящий класс при необходимости отменяет действие отдельных её положений (ограничивающих его власть) путем введения чрезвычайного положения в  той или иной форме.\n\nПример - база тюрьма Гуантанамо - в ней действие конституции США было временно отменено.\n\nИли Германия после принятия закона о чрезвычайных полномочиях в 1933\n\nИли Аргентина или Чили во времена правления военных. Или современная Украина или Россия.\n\n> \n> Конституционный порядок - он и есть конституционный порядок признанный на международном уровне. Какой-бы он не был.\n\n1) Любой закон не более чем выраженная определённым образом воля правящего класса\n\nЗаконность есть признак силы а не справедливости\n\n2) Исполнение этой воли основано на аппарате насилия называемом \"государство\"  а не на международном признании\n\nКакая разница что думают в соседнем государстве если правящий класс способен добиться исполнения своей воли в своей стране?\n\nЧто бы правители соседнего государства или государств не думали единственный случай когда это имеет значение - когда они способны силой добиться выполнения своих желаний.",
				"added": 1566243558
			},
			{
				"comment_id": 136,
				"body": "> [freemurzik](#comment_4_1Hf1J4EgxwcaRqhrbLgSNZxeH2jfxa741C): Тогда, это просто территория или временно неподконтрольная или утратившая конституционность. Разве не бывает конституционной монархии?\n\nВаше исходное утверждение было - \"...ЧВК и другие вооруженные отряды за пределами конституции - банды...\"  из него следует что любая военная организация не опирающаяся на нормы конституционного права есть банда.  \n\nМоё возражение состоит в том что существуют государства БЕЗ письменной конституции но с армиями (которые не банды) и вообще говоря существуют не правовые государства.\n\nВы с чего-то решили вспомнить про конституционные монархии, где очевидно конституционное право всё же в некой форме существует.",
				"added": 1566426639
			}
		],
		"1_14MeN6afdY8nQxnW2CzM61mVjtrSind1uY": [
			{
				"comment_id": 16,
				"body": "RIP.  Очень печально.",
				"added": 1561319053
			}
		],
		"2_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 32,
				"body": "> [if0](#comment_68_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Что-то название не очень приличное...\n\nЧем же оно неприлично?",
				"added": 1561385598
			},
			{
				"comment_id": 33,
				"body": "У меня проблема с загрузкой PDF файлов.  Есть какой-либо способ их удобной загрузки в ZeroNet?",
				"added": 1561385686
			},
			{
				"comment_id": 34,
				"body": "> [if0](#comment_69_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): На английский манер не совсем благозвучно.\n\nБудем считать что это Fack в адрес капиталистов",
				"added": 1561385707
			},
			{
				"comment_id": 35,
				"body": "> [jcactus](#comment_7_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa): ZeroUp unlimited: http://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/\n\nБлагодарю!",
				"added": 1561385815
			},
			{
				"comment_id": 36,
				"body": "Попробую опубликовать все номера на ZeroUp unlimited",
				"added": 1561385972
			},
			{
				"comment_id": 39,
				"body": "> [geekless](#comment_142_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Там можно быстро упереться в ограничение размера метадаты, это только в названии он unlimited.\n\nТогда видимо создавать мне отдельный сайт. Что наверное даже правильно и хорошо.",
				"added": 1561387303
			},
			{
				"comment_id": 94,
				"body": "> [zerg0](#comment_12_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3): А что за рабочая газета Фекал? И где номера?\n\nГазета рабочего движения России. Выпускается группой активистов из Омска и ряда других городов.  Регистрации как СМИ не имеет. Раздаётся бесплатно и через интернет.\n\nТемы статей - способы борьбы за права и особенно отстаивание трудовых прав.  Профсоюзы, конфликты с работодателями,  трудовое законодательство,  история рабочего движения и пр\n\nВсё руки не дойдут выложить все номера тут в ZeroNet сегодня сделаю\n\nВ ВК можно найти тут https://vk.com/fakel_mrg",
				"added": 1565039791
			},
			{
				"comment_id": 95,
				"body": "> [jcactus](#comment_8_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa): пиров 0 у тебя\n\nВсё руки не доходили",
				"added": 1565039823
			},
			{
				"comment_id": 102,
				"body": "Номер 1\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565085494-%20-%201.pdf\n\nНомер 2\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565085622-%20-%202.pdf\n\nНомер 3\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565085671-%20-%203.pdf\n\nНомер 4\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565085726-%20-%204.pdf",
				"added": 1565085773
			},
			{
				"comment_id": 103,
				"body": "Номер 5\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565085846-Fakel_5.pdf\n\nНомер 6\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086005-Fakel_6.pdf\n\nНомер 7\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086067-Fakel-7--print.pdf\n\nНомер 8\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086285-Fakel-8-pechat.pdf\n\nНомер 9\n\n127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086376-Fakel-9-5.pdf",
				"added": 1565086425
			},
			{
				"comment_id": 104,
				"body": "Номер 10\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086457-Fakel-10.pdf\n\nНомер 11\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086483-Fakel-11.pdf\n\nНомер 12\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086519-Fakel-12.pdf\n\nНомер 13\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086616-Fakel_13.pdf\n\n\nНомер 14\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086687-Fakel_14.pdf\n\n\nНомер 15\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086728-Fakel15.pdf\n\n\nНомер 16\n\nhttp://127.0.0.1:43110/1CiXRY9ATZSoZqBzwMfXEMsKtPRt2aQoF2/data/users/1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e/1565086820-Fakel16.pdf",
				"added": 1565087033
			},
			{
				"comment_id": 112,
				"body": "Возраждена инициатива по созданию профсоюза работников ИТ - https://vk.com/itunion_info",
				"added": 1565481115
			}
		],
		"2_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": [
			{
				"comment_id": 37,
				"body": "Да годный журнал",
				"added": 1561386113
			}
		],
		"1_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 41,
				"body": "> [caryoscelus](#comment_68_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Как раз таки шаги обычно понятны: закончить учёбу, найти партнёра противоположного пола, \"нормальную\" работу, пожениться, детей завести и т.п. А результат: ну типа всё хорошо будет. Вроде как-то так люди обычно и живут, не вдаваясь в тонкости того, что же именно такое это счастье\n> \n> Всё равно, должен быть критерий, по которому можно сказать, что может называться счастьем, а что нет. Понятно, что допустим для каждого счастье будет достигаться разными способами, но если между самим по себе счастьем одного человека и счастьем другого нельзя найти общего смысла, то и непонятно зачем такое понятие. Кто-то может сказать \"когда меня бьют молотком по пальцам, я испытываю острое счастье\". Если у слова \"счастье\" нет общего смысла, то как определить, заблуждается ли этот человек по поводу значения слова, или и вправду что-то такое испытывает? И вообще, может ли счастье быть одномоментным, или обязательно протяжённым во времени?\n\nКритерий прост - мнение самого человека",
				"added": 1561389741
			},
			{
				"comment_id": 50,
				"body": "> [caryoscelus](#comment_69_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): Человек может не знать, что значит \"счастье\". Или из какого-то контекста может вообразить, что \"счастье\" значит конкретно то-то и то-то, и потом использовать (и понимать) это слово только в этом (возможно частично верном, возможно вообще неверном) смысле. Мнение такого человека должно быть иррелевантно по отношению к языку вообще\n\nВолне может быть.  Может и не задумываться о счастье и не заниматься саморефлексией.  Мы пока ограничимся теми кто задумывается и рефлексирует.",
				"added": 1561459372
			}
		],
		"6_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 44,
				"body": "А что за сайты были?",
				"added": 1561457976
			},
			{
				"comment_id": 47,
				"body": "> [geekless](#comment_147_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Все не помню, неполный список:\n> \n> http://127.0.0.1:43110/1MiS3ud9JogSQpd1QVmM6ETHRmk5RgJn6E/\n> http://127.0.0.1:43110/1CVmbCKWtbskK2GAZLM6gnMuiL6Je25Yds/\n> http://127.0.0.1:43110/14c5LUN73J7KKMznp9LvZWkxpZFWgE1sDz/\n\nА что за тематика?",
				"added": 1561458686
			},
			{
				"comment_id": 49,
				"body": "> [geekless](#comment_148_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Каталог сайтов, соцсеть типа хабра, видеохостинг.\n\nЛичное скорее всего что то.  Жаль не застал. Может родные заебали мол какой фигнё страдаешь. Нужно бабло поднимать а ты тут творчеством занялся. Может испугался чего. А может быть решил начать летом новую здоровую жизнь:-)",
				"added": 1561458984
			}
		],
		"7_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 51,
				"body": "Это свойство можно  использовать и на пользу.  Для того, чтобы доказать авторство сообщения придётся доказывать НЕ вмешательство владельца сайта. Редко у кого на персональном компьютере задействованна система аудита гарантирующая отслеживание всех действий системного администратора:-)  \n\nНа этом же принципе можно строить защиту от уголовного и возможно гражданского и административного преследования за раздачу зайтов.",
				"added": 1561460724
			},
			{
				"comment_id": 52,
				"body": "> [geekless](#comment_149_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): В теории, в идеальном суде.\n\nНа самом деле нет. Я видел оправдания зая явную пиратку выложенную в интранет - шару.  Как показывает практика тут главное не оставлять на самотёк.  \n\nПрактический алгоритм в данном случае следующий:\n\n1. Находим эксперта.  Экспертом в данном случае может быть криптограф, математик или программист. Лучше всего если он преподает в университете и имеет учёную степень. Должен знать английский и python.\n2. Заключаем договор на экспертизу.\n3. Важным является набор вопросов для экспертизы. Если например обвиняют в распространении экстремисткого контента то список вопросов такой:\n\n\n- возможно ли утверждать что автором данного сообщения является гражданин такой-то или что оно было создано и отправлено с его ip или с устройств ему подконтролных.\n\nТут я полагаю, что обвиняемый всё же успел удалить свои ключи\n\n- возможно ли утверждать что сообщение после публикации НЕ было изменено кем-лио, в том числе администратором сайта\n\nВот на этот вопрос и будет отрицательный ответ:-)\n\nКогда заказывать экспертизу?  Сразу же!\n\nКогда приобщать к делу - решает адвокат. Зависит от конкретнх обстоятельств.\n\nЕщё учитывая сложность дела нужно сразу же ходатайствовать о рассмотрении тройкой судей или с участием присяжных если у вас такое право есть.",
				"added": 1561463017
			},
			{
				"comment_id": 53,
				"body": "В качестве идиотской идеи. Можно добавлять в свои сообщения подписанную приватным ключём контрольную сумму.",
				"added": 1561465287
			},
			{
				"comment_id": 55,
				"body": "> [geekless](#comment_151_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Если данные подписаны владельцем сайта - да. А если там подпись пользовательского сертификата, и владение этим сертификатом конкретным лицом уже доказано, нужна дальнейшая защита.\n\nСчитаем что мы заранее удалили свой cert",
				"added": 1561466064
			},
			{
				"comment_id": 56,
				"body": "> [geekless](#comment_150_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Идея не идиотская на самом деле. В моих далеких планах реализация возможности подписывать отдельные ветки внутри JSON прямо средствами движка форума. Каждая сущность (\"комментарий\", \"топик\") будет иметь подпись, которая \"слетает\" при вмешательстве админа. Ядро не дает API для этого, нужно будет запилить плагин. Пока идёт миграция на 3-й питон, нет смысла браться за плагин, но после стабилизации кодовой базы можно попробовать.\n> Ну и подписывание сообщений в явном виде, как в обычном email, тоже никто не отменял. :)\n\nВижу коммерческую ценность Вашей идеи. Форум для ведения коммерческих переговоров.",
				"added": 1561466127
			},
			{
				"comment_id": 58,
				"body": "> [geekless](#comment_153_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Круто. Под таким углом я не смотрел.Тогда необходима также поддержка хабов, чтобы каждая сторона могла безопасным образом сохранять копии сообщений других сторон в качестве доказательства.\n\nТут есть над чем подумать. Меня лично привлекает идея распределённых репозитариев исходного кода.  Можно подумать ив сторону распределённой системы согласования и  утверждения договоров или юридически значимых документов. В жизни такая проблема встречается часто.",
				"added": 1561466862
			}
		],
		"3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 54,
				"body": "> [sf24](#comment_1_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb): Простым пользователям можно не боятся писать страшные коментарии, их никто не посадит всем пофигу, а то что вы придумали с обходом сообщения это все дурь, когда вы заходите вк вашь ip связывается со всеми аккаунтами которые вы когда то писали вк, более того даже если вы меняети ip ваши данные компьютера так же записываются в плодь до разрешения экрана. И если даже ip отличается то рядом будет показывать схожие настройки отправителя, какие данные там прописываются. Начиная от провайдера и заканчивая каким браузером вы пользуетесь.Так что если кому то надо вас найдут, но вопрос кому вы нужны, даже если вы популярный человек который хочет что то написать и при этом не спалица, в любом случии публикация от левого аккаунта не даст результатов, потому что мало людей знает кто это.\n> Можно конечно использовать платную рекламу что бы распространить информацию но тогда все кто распространял информацию будут привлечены к ответственности, их начнут спрашивать кто вам заплатил и т.дА их аккаунт могут совсем заблокировать что угрожает ихней карьере в интернете.И подводя итоги, какая информация в России может вызвать резонанс, всем насрать, интернет давно стал помойка и тут дела не решаются уже все знают, если кто то кречит то это просто крики но не действия.Дела решают те у кого есть деньги или большое количество людей, например глобалисты, кто держит сеть чего либо. А люди, что люди, это рабы которые работают за еду, если вам повышают зарплату монополисты повышают цены на еду увеличивая наценку в 200%\n\nКак показала практика применения 282-ой статьи под её каток как раз и попадали воосновном простые люди. Политических активистов среди пострадавших было немного. Вернее сказать ЦПЭ старательно обходил людей связанных политическими или общественными организациями.\n\nРазные логи имеют разные периоды хранения и разное удобство доступа.",
				"added": 1561465941
			},
			{
				"comment_id": 59,
				"body": "> [sf24](#comment_4_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb): Почему боком Давыдовича посадили никто даже не пикнул, это легко делает, вначале водят по судам пока деньги у вас есть потом вы опускаете руки и сидите спокойненько.Никто за вас заступаться  не будет, максимум родственники но они разве что то могут сделать.В России правит мафия это все знают, пока вы дорогу не переходите можете хоть воровать, но если перешли у вас проблемы\n\nПопробуйте посадите работника либеральной газеты:-)\n\nБудет ли кто-то заступаться зависит от вашего окружения. Математическое сообщество и студенчество МГУ сумело прератить издевательства над Мифтхаковым. Да он сидит в СИЗО но его не убили не запытали.\nГод назад остановили запрет МПРА. \nВ этом году в двух регионах медики бастовали, тоже угрожали что экстремистами объявят. В Пензенской области бастовали, там где дело Сети идёт и людей ФСБ пытало.  Знаете кто победил?  Медики.\nСейчас ещё ожидается забастовка в Орловской области.\n\nДобро пожловать в новую реальность.",
				"added": 1561468762
			},
			{
				"comment_id": 61,
				"body": "> [sf24](#comment_6_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb): да это ужасно, но я рекомендую тогда тем кто что то хочет опубликовать меньше об этом говорить и больше действовать, например не нужно писать об этом или опубликовывать от своего имени.1 это ничего не даст, только проблемы2 у вас может быть плохая репутация в будущем, особенно если вы куда то захотите попасть, вас проверят кто вы и что вы.Значит что касается эффективной борьбы против власти, так это действия, вначале вы внедряетесь туда куда вам нужно попасть, это можно сделать разным способом, но не думайте что это сойдет с рук, надо заранее учитывать что вас поймают. Дальше все просто как только вы завладение информацией с доказательством, не нужно орать на всю страну, первое что вам нужно подумать какую выгоду вы получите или можете получить. Именно выгода вам поможет протолкать дело дальше а окружения которое присоединяется вы им так же говорите что поделитесь если победите. Именно тогда когда все будут знать что вы это делаете ради денег а не ради каких то аномальных целей типо за народ за демократию или за еще какую то хуйню.Именно из-за этого вас не смогут посадить, потому что к вам претензий нету, если че не нравится пусть попытаются купить вас. А сколько это будет стоить и сколько враги народа должны потерять это уже вам решать. Если же вы ведете себя как дурачек без выгоды пытаетесь чет доказать, именно так взрослые и будут думать, какой то дурак, они даже денег вам не дадут думая что вы растрезвоните всем кому попала что вам еще и деньги обещали. Так что не будьте дураком делайте все ради цели и скрывайте ее чем другим в данном случае деньгами. Говорите прямо я все делаю за бабки вопросы есть, вопросов нет.А то что вас купить нельзя не ваши проблемы пусть платят больше или им пизда\n\nБоже, хотя я атеист - сколько же дури в головах у людей!\n\nНу куда ты попасть собираешься?   В участковые мусора?  Ну не возьмут тебя туда и что?\n\n\nВот мне почти сорок. Чего мне опасться что меня куда то не примут на работу?  Топ-менеджером Газпрома или губернатором мне не быть. Не стать мне и прокурором или судьёй. Как был я корпоративным юристом так и буду. \nМожет в разработчики ПО уйду если скучно станет или лифты буду ремонтировать. Люблю паять.\n\nУ большинства людей нет блистательных перспектив кем то стать. \n\nДаже если в многороде живёшь, в крайнем случае уедешь.\n\nЕдинственный путь реально бороться за свои права - коллективное действие. Внедряться ты никуда не внедришься или станешь шестёркой.\n\nЕщё раз добро пожаловать в реальность.",
				"added": 1561470806
			},
			{
				"comment_id": 62,
				"body": "> [sf24](#comment_8_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb): Главное правила не сливайте важную инфу если не готовы довести дело до конца, особенно как делает навальный тупо сливает инфу а эти люди просто закрывают свои дырки где они лаханулись, но вы не думайте что он просто так эту инфу сливает, просто ему бабки скорее всего уже заплатили за это.\n\nНавальный своими расследованиями создаёт себе имидж борца с коррупцией.  Имя. Известность.  Сейчас он не участвуя в выборах один из известнейших политиков в стране.  \nЕщё раз замечу - даже не участвуя в выборах.",
				"added": 1561471455
			},
			{
				"comment_id": 65,
				"body": "> [ngc](#comment_3_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L): Вк хранит все что было написано/залито/сохранено минимум 6 месяце после удаления. Лучше делать левый ак и сидеть через TOR VPN и тп.\n\nВосстановление страницы доступно в течении 7 месяцев",
				"added": 1563980531
			},
			{
				"comment_id": 66,
				"body": "> [if0](#comment_135_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Ради чего такие сложности?\n\nНапример для профсоюзной агитации. В принципе для любой пропаганды и агитации которая может быть всопринята соответствующим образом",
				"added": 1563980591
			},
			{
				"comment_id": 67,
				"body": "> [fuckyiu](#comment_8_1EFVSP6542BBE2eEaqirrGCFUm4LsuUbha): Хватит общаться на русском, чмохи. В Москве выходит оппозиционная газета «The Moscow Times”, на английском. Никого не сажают. И да, сидите дальше во втентаклике, чмохи.\n\nМеньше пафоса.  Сама идея хорошая. Полиция английский не обязательно знает и \"эксперты\" также",
				"added": 1563980654
			},
			{
				"comment_id": 68,
				"body": "> [syntia](#comment_73_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): \"...сообщила его жена...\" Сильно же она его любит. А вообще любому квази-демократическому режиму  свойственна фашисткое лицемерие в виде псевдо-заботе о безопасности народа в лице однопартийной верхушки \"Русвермахта\".\n\nверрмахт это армия была в Германии и ЮАР (на языке африканес) а не партия",
				"added": 1563980705
			},
			{
				"comment_id": 74,
				"body": "> [syntia](#comment_75_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM): Добро пожаловать на Wire Desktop для Linux. Там пока открыто ЧЕКистская погань не сует своё \"зоботливое\" жало. Вот репозиторий: https://linuxmint.com.ru/viewtopic.php?t=994\n\nБлагодарю.  Почитал Wire выглядит весьма неплохим решением.  \n\nЛично мне вопрос интересен в плане организации профсоюзных первичек.\n У нас уже были случаи утечки переписки через ВК - ФСБ/Полицию и ещё большой проблемой являются стукачи сливающие данные членов организуемой первички работодателю.",
				"added": 1564308346
			},
			{
				"comment_id": 78,
				"body": "> [ngc](#comment_4_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L): по истечению 7 еще 6 минимум хранят.\n\nВидимо уже не on-line т.к. учётку восстановить больше нельзя.\n\nЕщё ВК сейчас ОРИ - организатор распространения информации  а ОРИ подключают к СОРМ.",
				"added": 1564422992
			}
		],
		"1_12XPYvUFzmczXdTy4GJxB1WGrnwrdpTCqD": [
			{
				"comment_id": 57,
				"body": "Зато не тонем!\nИ вообще говно предмет интересный. Пока не трогаешь воняет ощутимо меньше.",
				"added": 1561466187
			}
		],
		"1_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": [
			{
				"comment_id": 63,
				"body": "> [anistar](#comment_3_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP): Если сайты не будут работать переводчики не смогут зарабатывать на рекламе, если они не зарабатывают то и перевода не будет.Пойдут работать в другую компанию и делать что то другое.Так что да все очень плохо.\n\nУвы рунет и русская культура в целом от блокировок и цензуры умирает.  Помните был такой сайт Луркмуар?   По сути он объединял русскоязыную культуру рунета. Теперь он заморожен.",
				"added": 1561814623
			}
		],
		"4_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 64,
				"body": "Зайт для коллективного рисования картинок\nЗайт для совместной работы над текстами\nБиблиотека русских книг",
				"added": 1561814869
			}
		],
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 71,
				"body": "> [swashbuckler](#comment_8_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Почему бастуют и какие требования выдвигают?\n\nПолностью требования бастующих следующие:\n\nКоллективные требования крановщиков города Казань\n\nРуководителям строительных компаний г. Казани от объединения «Крановщики Казани»\n\nУважаемый руководитель!\n\nВ настоящее время на строительных объектах Казани сложилась критическая ситуация: наблюдается повсеместное нарушение требований трудового законодательства, массовое нарушение правил техники безопасности, низкая заработная плата, не соответствующая тяжелыми условиями труда и ответственности нашего труда.\n\nИсходя из этой ситуации, мы требуем\n\nНемедленного наведения порядка в сфере безопасности труда и исправности оборудования. Все работы с использованием башенных кранов должны производиться исключительно с соблюдением всех требований и стандартов безопасности и охраны труда, а также санитарных правил и норм, в том числе к микроклимату на рабочих местах.Сегодня на строительных объектах повсеместно нарушаются правила техники безопасности (ТБ), что ведет к возрастанию аварийных ситуаций и риску несчастных случаев различной тяжести, вплоть до летального исхода. Кроме того, очень часто не соблюдаются санитарные правила и нормы, регламентирующие условия труда на рабочих местах. Особенно это касается микроклимата и температурного режима на рабочих местах.\nПолного и всестороннего соблюдения норм Трудового Кодекса РФ. Все работники должны быть трудоустроены исключительно с соблюдением всех норм Трудового Кодекса и иных норм законодательства РФ, иметь официальные трудовые договора, обладать необходимой квалификацией, проходить обучение и проверку знаний, необходимых для допуска к выполнению работ. Полностью исключить привлечение к работам и проникновение на строительные объекты посторонних лиц.В погоне за прибылью работодатели часто стали привлекать для работ на строительных объектах работников без законного оформления трудовых отношений и с нарушением иных норм законодательства РФ. Кроме того, часть привлекаемых работников не обладают необходимыми знаниями и квалификацией, а также не проходят обучение для того, чтобы в законном порядке быть допущенными к выполнению работ, к которым их привлекают работодатели. Это создает угрозу не только для качества работы, но и самое главное, для безопасности, сохранности жизни и здоровья людей.\nОбеспечение трудовых прав и гарантий на уровне не ниже гарантированного ТК РФ. Особенно в вопросах продолжительности трудового дня. Мы обращаем внимание, что наши требования вполне укладываются в рамки, которые законодательно гарантированы работникам в России согласно ТК:- соблюдение установленных Трудовым Кодексом РФ нормальной продолжительности рабочего дня и рабочей недели, неукоснительное предоставление всех необходимых перерывов для обеда и отдыха;- соблюдением законного порядка добровольного привлечения к сверхурочной работе и работе в выходные дни с дополнительной оплатой в размере не ниже установленного в ТК РФ; В настоящее время работодателями массово нарушаются трудовые права работников, даже непосредственно гарантированные Трудовым Кодексом РФ.\nУстановить оплату труда машинистов башенных кранов на уровне не ниже 500 рублей в час (после выплаты всех налогов) за основное время работы.Уровень оплаты труда машинистов башенных кранов на данный момент не соответствует квалификации, требованиям к качеству работ, ответственности и того риска, которому подвергаются работники данной профессии. Из-за низкой оплаты и необходимости обеспечивать жизнь себе и своим семьям, крановщики идут на вынужденные переработки. Переработки приводят к повышенной утомляемости, износу организма и снижению внимания, создающим предпосылки для возникновения аварийных ситуаций и несчастных случаев, угрожающих жизни и здоровью как самих машинистов, так и окружающих людей.\nОбеспечить для всех крановщиков без исключения обязательное страхование жизни и здоровья машиниста башенного крана от несчастных случаев на рабочем месте.Профессия машиниста башенного крана связана с высокой степенью риска, в том числе для его здоровья и жизни, а также вредными условиями труда.\nОбеспечить машинистов башенных кранов, не имеющих своего жилья, служебными квартирами (в случае, если у них имеется такая потребность). Включить специалистов данной профессии в программу льготного приобретения жилья («социальную ипотеку»). Ежедневно машинисты башенных кранов участвуют в строительстве огромного количества жилья. В то же самое время многие из них не имеют своего жилища.\nОплаты суточных и командировочных в соответствие с требованиями ТК РФ. Достаточно часто наша работа связана с командировками. Но при этом наши работодатели очень часто не оплачивают нам командировочные и суточные, чем нарушают нормы ТК и ухудшают условия нашего труда.\nМы требуем установления почасового тарифа для каменщиков и монолитчиков в сумме не менее 300 рублей в час после выплаты всех налогов. Также требуем перевода их в дальнейшем на оплату труда в виде оклада, что позволит избежать нарушений технологических процессов, в связи с попытками ускорения строительства объектов различного назначения.\nМы требуем обеспечить полномочным органам работников возможность полноценного контроля за соблюдением трудового законодательства, безопасных условий труда, а также выполнения всех достигнутых соглашений и договоров между работниками и работодателями.\n\nМы наделяем полномочиями вести переговоры, принимать решение о начале коллективного трудового спора и проведении коллективных действий, в том числе забастовок выборных лиц из представителей нашего сообщества, Профком МПРА, иных представителей МПРА.\n\nДля предотвращения остановки работы кранов предлагаем связаться с выборными представителями до 8:00 24 июля.\n\nПредставители профсоюза МПРА в Казани:\n\nЮрий Шарипов +79047693165, +79370032077\n\nВладимир Водолазов +7 960 046-54-10",
				"added": 1564208810
			},
			{
				"comment_id": 72,
				"body": "> [l0stedmind](#comment_5_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy): Держу кулачки за рабочих, надеюсь что у них всё получтся\n\nВы вполне можете помочь рабочим как минимум двумя вещами\n\n1. Расскажите по случаю знакомым, друзьям, родным коллегам о конкретной забастовке.\n\n2. Изучить самому и рассказать другим как правильно организовывать забастовки\nЭтому кстати учат на семинарах МПРА и КТР есть и соответсвующая литература\n\nОчень часто люди совсем ничего не знают о том что такое забастовка. Мне например встречается часто что люди путают забастовку и митинг.\n\nОчень часто люди не понимают что такое профсоюз.  Обычно вспоминают совершенно бесполезные \"советские\" профсоюзы, которые путёвки распространяли, а о современных \"боевых\" союзах таких как МПРА,  Действие, Учитель, Новопроф и пр - совершенно не знают ничего.\n\nПросветительской работой Вы очень можете помочь рабочему движению",
				"added": 1564209126
			},
			{
				"comment_id": 75,
				"body": "Забастовка продолжается. Подробности возможно узнавать тут: https://vk.com/public184723446\n\nСайт профсоюза МПРА пока вот в таком виде - https://vk.com/mprasu",
				"added": 1564308630
			},
			{
				"comment_id": 76,
				"body": "> [if0](#comment_140_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Подмайорский вконтактик? Не банят?\n\nАдминистрация ВК как ни удивительно никаких враждебных действий не предпринимает.\n\nБыл случай слива переписки из профсоюзного чата которую ВК передала в ФСБ или полицию (подробностей увы не знаю) работодателю.\n\nВесной прошлого года пытались запретить МПРА через суд  как иностранного агента (все профсоюзы стараются взаимодействовать с рабочими организациями в других странах), но Верховный Суд отменил решение о ликвидации.\n\nВ Санкт-Питербурге был случай давления на членов профсоюза медиков Действие - там руководство составило список по публичным данным из группы в ВК и потом проводила \"индивидуальные беседы\" о том что они должны выйти из союза\n\nЕщё пропагандисты из Калуги сняли фильм \"Механника профсоюза\" где нас называли агентами Украины, исходя из цветов флага КТР делали выводы о нашей связи с украинскими националистами (что бред конечно).\n\nСейчас есть планы воссоздания официального сайта МПРА.\n\nФСБ и ЦПЭ безусловно следит за профсоюзами как за МПРА так  и за другими.",
				"added": 1564422691
			},
			{
				"comment_id": 79,
				"body": "Обстановка на 31 07 2019:\n\nНа данный момент часть работников пытаются заменить. Нанимают пенсионеров, неквалифицированных работников. Известно, что на \"Ак Барс Строй\" на объекте ЖК \"Мой Ритм\" наняли неопытного работника. Однако пришлось быстро снять - человек не умеет работать.\n\nЗамена специалистов может привести к авариям. Так, недавно, по анонимным источникам, в Москве мигрант без соответствующей квалификации сбросил с 10 этажа строителя.\n\nТяжесть вины в проишествии лежит, прежде всего, на работодателе. Они нанимают неквалифицированных работников, думая, что достаточно обучить командам \"вира-майна\" (вверх-вниз). А как же поворот? Каретка? Принципы работы в стоительстве они не знают, не говоря уже о инструкциях по технике безопасности. Что даст виравать-майновать, пока не знаешь всего остального?\n\nТакие эксперименты вредят и самой крановой фирме. Достаточно вспомнить случай с Екатеринбургской фирмой ЗАО \"Рента-кран Урал\", где попытались заменить опытных работников на неопытных. Неопытные работники не берегли технику, стало много поломок и в результате их пришлось быстро убрать.\n\nМожно с определенностью сказать, что работодатели сами себе роют яму, отказывая требованиям квалифицированных специалистов.",
				"added": 1564581098
			},
			{
				"comment_id": 80,
				"body": "> [fant](#comment_17_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ): Пока ее не попросили. А не просят пока потому что не интересно. А как только, так сразу. Мгновенно.\n\nМы даже не сомневаемся. \n\nКак уже писал администрация ВК уже слила как минимум раз наш чат.  Есть сведения и о других случаях, но не проверенные.\n\nНасколько знаю в процессе возрождение сайта МПРА и само собой мы как можно шире применяем более безопасные средства общения - Telegram, WhatsApp и пр.\n\nСмотрим и в сторону тру даркнета.  Это одна из причин моего присутсвия в ZeroNet",
				"added": 1564868834
			},
			{
				"comment_id": 81,
				"body": "Медики в Тольяти угрозой итальянской забастовки заставили выполнить свои требования.\n\nhttp://medrabotnik.org/news/italyanskaya-zabastovka-skoroj-pomoshhi-tolyatti-srabotala-eshhe-ne-nachavshis\n\nЭто успех наших товарищей из профсоюза Действие",
				"added": 1564869057
			},
			{
				"comment_id": 87,
				"body": "> [if0](#comment_176_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): ZN - это не тру даркнет, i2p куда трушнее. Да и заркало сайта в нем куда проще поднять, что врядли получится в ZN с его \"зайтами\".\n\nМы разные технологии рассматриваем.  Опять же у нас в сети есть две задачи которые нужно решать разными средствами\n\n1. Распространение информации о таком способе защиты своих прав как профсоюз и забастовки\n\nКак организовать союз, тут есть свои тонкости, какие есть тактики забастовки - тут много тонкостей\n\n2. Координация своих действий в безопасной среде.",
				"added": 1564870363
			},
			{
				"comment_id": 111,
				"body": "Увы неутешительные вести - работодатели сумели заменить примерно 30 из 40 бастующих крановщиков.\n\nЗабастовка продолжается.  Говорить о победе работодателей пока рано.\n\nПрактически удалось заставить почти всех работодателей отремонтировать аварийные краны (таких было много) и началася процесс оформления строителей работавших \"в чёрную\"",
				"added": 1565480966
			}
		],
		"1_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": [
			{
				"comment_id": 73,
				"body": "Не обращайте внимание на этого фрика. Человеку хочется внимания.  Не нужно давать ему внимания.",
				"added": 1564308210
			},
			{
				"comment_id": 82,
				"body": "> [zeronetuser152](#comment_4_1sZ7tME4BoDRu1pzCykhMWeh9EtNJk2JE): А почему хохлы тут?\n\nЭто человек с психологическими проблемами.  Хохол он или русский сказать невозможно. Человеку одиноко, ему не хватает радости в жизни. Поэтому занимается таким вот вандализмом на форумах.\n\nДля его же блага не обращайте на его посты внимания",
				"added": 1564869169
			},
			{
				"comment_id": 109,
				"body": "> [kotmatroskin](#comment_1_182MGW7kapycveWALsbSrQFakkVFqKvS5D): Да правильно, в общем, как говорил Буковский - две бомбы по Лубянке и нет 80% мирового терроризма. Сами жить не умеют и другим жизнь портят.\n\nЯ всегда говорю - дайте \"либералу \"или майдауну высказаться публично и он покажет все глубины своего интеллекта\n\nМусье познакомит нас со списком научных исследований о терроре которые он прочитал?\n\nPS\n\nслово \"либерал\" я написал в кавычках чтобы отделить персонажей проживающих в xUSSR и называющих самовольно себя этим гордым именем от либералов истинных, существовавших в Великобритании в 19-ом и начале 20-го века.",
				"added": 1565480743
			}
		],
		"1_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 77,
				"body": "Предлагаю начать укрепление ZeroNet с малого\n\n1. Создать трекер на территории России на случай отключения внешних связей\n\n2. Сделать мост в RetroShare и обратно.  \n\nСообщения с этого форума должны отображаться в специальный форум в RetroShare и наоборот. Аналогично с чатами и с электронной почтой.\n\n",
				"added": 1564422883
			}
		],
		"1_1JAiKS3giLzSw1YQWZPVAct377nyiApDW2": [
			{
				"comment_id": 84,
				"body": "Безусловно когда-нибудь завершится.  Когда-нибудь не будит ни бесноватых нацистов на Украине ни олигархической тирании в России, ни правления Уолл-стритт в США. Безусловно человечество повзрослеет и построит общество основанное на свободе равенстве и братстве.",
				"added": 1564869496
			},
			{
				"comment_id": 89,
				"body": "> [if0](#comment_180_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Скорее оно истребит само себя, чем повзрослеет. Уже пытались строить: и равенство, и братство, только задуманное не вышло, а каждый раз получалось наоборот.\n\nПочему вы считаете что не вышло?\n\nЧеловечество вполне демонстрирует прогресс.  Он не быстрый, в том смысле что изменить общество это не сайт поднять, на такие вещи требует больше сил и времени и главное это дейтсвие коллективное.\n\nПримеры хотите?  Пожалуйтса\n\nСША.    Отцы основатели США сумели создать демократическую республику восстав против пусть ограниченной но монархии.\n\nРоссия - у нас уже более ста лет нет сословий,  есть всеобщее школьное образование. При том что ещё в конце 19-го века были и сословия, и идея всеобщего начального образования вызывала яростное сопротивление верхов (циркуляр \"о кухарских детях\" помните?)\n\nМир вообще - рухнули все колониальные империи\n\nРабство считается вне закона и осталось только в самых дремучих уголках\n\n\nСоциальные права. На примере России\n\nУ нас есть ежегодный отпуск.  Ещё сто лет назад его не было. В США и сейчас нет.\n\nвосьмичасовой рабочий день.  Опять - сто лет назад его не было. Скажим спасибо анархистам которые за него боролись, почитайте ситорию праздника 1-го мая",
				"added": 1564872672
			}
		],
		"1_1NxH7JC6pHRkfyzg8fX7bKwdbEA3gCnkuk": [
			{
				"comment_id": 92,
				"body": "Посмотри содержимое user.json например grep -ом.  Ищи строки содержашие слово seed,  одна из них будет \"правильный\" seed для твоей учётки.  Придётся перебирать",
				"added": 1564963227
			}
		],
		"2_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": [
			{
				"comment_id": 110,
				"body": "Хорошая идея",
				"added": 1565480816
			}
		],
		"1_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2": [
			{
				"comment_id": 113,
				"body": "> [wrewolf](#comment_181_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Добавил русские пиры к себе, мой адресtcp://89.108.86.124:39321\n\nПрошу подсказать как корректно настроить публичный пир",
				"added": 1565481246
			},
			{
				"comment_id": 134,
				"body": "> [wrewolf](#comment_186_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): Сорян за долгий ответ, не часто захожу, хотя постоянно поднята нода.Нужно добавить строчку tcp://89.108.86.124:39321 в массив Peers в файле конфигурации.А настроить свою внешку, это пробросить/открыть порт, указанный в конфиге в\n> Listen [\n>    tcp://89.108.86.124:39321\n> ]\n> Например так у меня настроено\n\nСпасибо большое!\n\nА в плане секций конфига где роутинг и как я понял привязка ключей к маршрутам описывается - есть какие советы?",
				"added": 1566307799
			}
		],
		"3_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": [
			{
				"comment_id": 114,
				"body": "Я наблюдал похожую проблему в tor-броузере при отправке по ZeroNet почте сложной html страницы",
				"added": 1565556049
			}
		],
		"5_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 115,
				"body": "Начнём же!\n\nПоздравляю всех мусульманских коллег на нашем форуме со славным праздником Курбан Байрам!",
				"added": 1565556442
			},
			{
				"comment_id": 116,
				"body": "> [if0](#comment_203_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): А может, все же не стоит религиозные праздники сюда тащить?\n\nПочему не стоит?  Свобода совести тем и прекрасна что она действительно как для атеистов так и для верующих разного толка",
				"added": 1565565252
			},
			{
				"comment_id": 117,
				"body": "> [x418synth](#comment_3_1EFhXfFwH97coL14ZYb1WCUPaHemXJby2y): И тут веруны. Приехали, лол.\n\nесть тут веруны или нет науке неизвестно. Это просто поздравление",
				"added": 1565630795
			},
			{
				"comment_id": 124,
				"body": "> [if0](#comment_205_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Потому что так называемая \"свобода совести\", которая преподносится, как некое достижение свободы, всегда толкуется в сторону верующих, а не атеистов. Чувства верующих оскорбить легко, и понести за это порицание или наказание, но при этом чувства атеистов оскорбить практически невозможно... \"Свобода совести\" - показательный пример двойных стандартов, культивируемых в современном обществе.\n\nВы переносите ситуация из современной России с 148-ой статьёй УК на всю историю человечества.\n\nЭто совершенно неверная генерализация.  Исторически свобода совести действительно появилась впервые именно как свобода в выборе религии.  Это была очень прогрессивная идея особенно на фоне идей Вестфальского мира - \"...чья власть того и вера....\"\n\nНо уже в американской революции в Биле о правах она определяется в том числе как свобода от выбора религии вообще \n\n....\nСтатья I.\n\nКонгресс не должен издавать никакого закона относительно установления какой-либо религии, или воспрещающего свободное исповедание всякой религии, или ограничивающего свободу слова и прессы, или право народа — мирно собираться, а также просить правительство о прекращении злоупотреблений. \n...\n\nВот в таком виде эта свобода и понимается в большинстве стран мира.  \n\nОпять же в большинстве таких стран НЕТ аналога 148-ой статьи УК РФ.\nЕсть законы против осквернения религиозных сооружений и предметов как в ФРГ но сами по себе \"чувства верующих\" никак не защищаются особо. Что правильно.",
				"added": 1565950300
			}
		],
		"5_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 118,
				"body": "По сути действительно хорошая вещь для связывания нескольких локальных сетей в одну ipv6 сеть.  Расшаривания файлов,  организации удалённого терминального доступа,  общей телефонной сети и так далее\n\nВторое назначение - средство преодоления цензуры. Ставим yggdrassil себе дома и ставим на удалённой VDS,  идём на VDS по RDP осматриваем свободный интернет.  \nВсё то же самое работает и по tor и по i2p\n\nКак транспорт для ZeroNet ну а ZerNet  - тут сами выдумывайте, у меня пока в процессе создание распределёного хранилища исходного кода и собранных артефактов для CI/CD\n\nДополнительный слой прозрачного шифрования для WiFi - для связи внутри одной сети\n\nУдалённое управление множеством VDS через ansible/taktuk и пр\nСтавим везде yggdrassil и в инвентарный файл пишим в инвентарные файлы ipv6 адреса\n\nСтабильность - норм,  накладных расходов больших вроде нет.",
				"added": 1565642363
			},
			{
				"comment_id": 119,
				"body": "> [zerolespero](#comment_32_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): Очень ресурсоемкое решения, лучше используйте linux. (vps  с windows обычно весьма дороже)\n> \n> Арендуем самый дешевый vps/vds с linux за бугром\n> Ставим Openvpn(Любой протокол позволяющий пускать трафик через наш vps)\n> наслаждаемся свободным интернетом\n> можно разместить публичную ноду yggdrasil\n> \n> PS остраня нетерпимость к windows\n\nВсё так, с небольшими \"но\"\n\n1) RDP намного менее требователен к качеству связи чем проброс X через ssh или VNC\n\nпомогает правильный подбор шифров используемых на ssh сервере и опция -Y вместо -X\n\nещё можно nx использовать\n\n2) Предложенная Вами схема с VDS как OpenVPN сервером имеет один большой недостаток - она уязвима перед \"ковровыми банами\" - ситуациями когда роскомнадзор банит целую подсеть или блок адресов за наличие в ней mtp proxy или чего-то похожего\n\nyggdrassil, tor,  i2p в этом плане предпочтительнее т.к. позволят получить доступ к такой vds даже при её попадании в бан  \nОкно в свободный интернет остаётся в этом случае открытым",
				"added": 1565689617
			},
			{
				"comment_id": 120,
				"body": "> [mistalero](#comment_86_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): Не нашёл готовых сборок под windows, компилировать самому из исходников?\n\ncygwin или Linux sybsystem for WIndows",
				"added": 1565731570
			},
			{
				"comment_id": 121,
				"body": "> [zerolespero](#comment_33_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL): не понимаю необходимость графики (опционально)\n\nДля запуска броузера например\n\n> \n> есть механизмы маскировки openvpn под https. Если вы используете vps один или с небольшой группой людей, то шанс блокировок минимален. \n\n\nРассматривается случай именно ковровых блокировок как весной 2018-го.  Когда роскомнадзор просто банит посети найдя один mtp proxy не разбираясь что в подсети",
				"added": 1565731686
			},
			{
				"comment_id": 123,
				"body": "> [mistalero](#comment_87_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54): В IE отобразилась страница без ссылок на загрузки, только потом догадался в  другом браузере открыть.\n\nВы осторожнее так. Плохо это или хорошо но web стандарты быстро развиваются и стоит только разработчикам прекратить поддержку броузера как через несколько лет он не открывает приличную часть сайтов",
				"added": 1565949894
			}
		],
		"6_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 122,
				"body": "> [murzazade4](#comment_44_1KN63pGpSyVmdeKdcnDGH8zevtQMKAt8Wp): Что именно вы называете \"русским языком\"?\n\nОчевидно что это язык на котором вы написали вопрос на который я отвечаю и на котором я пишу ответ\n\nhttps://ru.wikipedia.org/wiki/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%B8%D0%B9_%D1%8F%D0%B7%D1%8B%D0%BA",
				"added": 1565949785
			}
		],
		"6_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 125,
				"body": "> [l8](#comment_19_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP): Вот если честно, доверия к профсоюзам, которые не могут осилить учебник русского языка — примерно ноль; ничего личного.\n\nПредложите ваш вариант этого текста. Я с удовольствием заменю им свою мазню",
				"added": 1566021664
			},
			{
				"comment_id": 126,
				"body": "> [if0](#comment_207_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Для таких целей эффективнее будет что-то на подобии \"красных бригад\", чем \"профсоюз\"... :))))))\n\nмы регулярно сталкиваемся с людьми которые так говорят.  Профсоюз по их словам путь неэффективный, но вот если они получат в руки оружие - уж тут то они всем покажут!\n\nВ реальности они продолжают ничего не делать и в профсоюз не вступают и (что хорошо) террористами не становятся. \n\n> А если серьезно, то хотелось бы для начала узнать процент недовольных условиями труда и уровнем ЗП среди работников ИТ, а так же выяснить каким боком здесь цензура?\n\nЗависит от ИТ специальности.  Исследование показывает, что чем более простая специальность - тем больше недовольных.  Среди разработчиков их почти нет.  Наоборот среди работников поддержки и монтёров до трети.\n\n> Профсоюзное движение эффективно только при массовости, сознательности, решительности и дисциплине (чем в реалиях обладают считанные единицы),\n\nвсё именно так, поэтому создание профсоюза это непростой процесс\n\n> а главное - наличии смелых, инициативных и авторитетных лидеров, лишенных политических амбиций и желания личного обогащения (кого и вовсе - днем с огнем не сыщешь), \n\nА вот это уже неверно.\n\nПрофсоюз демократическая организация и каждый член союза проходит необходимое обучение, где получает представление о методах и тактиках работы союза.\n\nИдеальное состояние  профсоюза - способность любого его участника руководить организацией. Понятно что это идеал, но к нему стремимся и от синдрома \"лидеров\" избавляемся.\n\nЛидеры не нужны. \n\n> которых сразу всех пересажают, купят или запугают, как только они попытаются заявить о себе... На этом ваши \"игры в профсоюз\" сразу же бесславно закончатся.\n\nпро лидеров уже было сказано выше.  \n\nВ реальности опасность посадки или убийства существует.  Для её уменьшения разумно применять три меры\n\nа) Не наживать себе лишних врагов и не вступать в несколько конфликтов одновременно\n\nб) Знать стандартные методы посадок и террора и контрмеры. Иметь своих адвокатов и юристов,  использовать методы конспирации и ИБ, иметь оружие самообороны\n\nв) Массовость профсоюза.  Массовость резко сокращает риски как для членов руководящих органов так и для всех остальных участников союза\n\nНу а против подкупа хорошо действует демократическая организация.  В ситуации когда решения принимаются всеми участниками или их выборными представителями, когда все понимают цели и методы действия союза устраняет опасность превращения лидеров (их просто нет) в козлов-провокаторов.",
				"added": 1566022883
			},
			{
				"comment_id": 128,
				"body": "> [if0](#comment_208_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Просто возможные риски от примыкания к настоящему, реально борящимуся профсоюзу (а не формальному, не имеющего никаго влияния),  ни коим образом не компенсируется возможными приобретениями в процессе сложной и неравной борьбы, с неизвестным результатом. На такое способны не просто \"выходящие из зоны комфорта\", а спосбные реально пожертвовать своей жизнью и судьбой своих близких, имеющие идеалы и живущие ради них. Чем выше общий средний уровнь жизненого комфорта, которое способствует всеобщему обыдлению, тем меньше людей, имеющих идеи, способные сподвигнуть их отказаться от своего привычного образа жизни. Нельзя вступить на путь реальной борьбы \"формально\", нужно быть готовым в любой момент лишиться своей работы, получить физические травмы или даже увечия, подвергнуться травли и запугиванию или вовсе сеть в тюрьму из-за какой-нибудь спланированной провокации или подставы. \n\nВы путаете профсоюз с политической партией.   Это просто массовая психиатрическая эпидемия.  Примерно каждый второй начинает вести разговор про \"идеалы\"  и далее.\n\nПрофсоюз решает вполне конкретные проблемы\n\nа) Повысить зарплату\n\nб) Защитить от увольнения\n\nв) Обеспечить безопасные условия труда\n\nВ мечтах нам конечно хотелось бы иметь политическое влияние и например остановить повышение пенсионного возраста, но это мечты иногда далёкие планы.\n\nЛюдей в профсоюз приводят не \"идеалы\"  а материальные потребности. \n\nНапример дать пизды (буду писать прямо) охуевшему директору которые решил уволнять людей просто так или понизил зарплату или ввёл систему штрафов.\n\nЕсли люди объединились чтобы вырвать у такого козла свою зарплату - вот профсоюз.  А идеалы - оставим их другим.\nИз всех идеалов важен только один - один за всех и все за одного.\n \n\n> И когда это монтеры и поддержка стали ИТ специалистами? Ими являются, как минимум, люди с высшим инженерным техническим образованием.\n\nВсегда были.  Важен общий работодатель а не корочки - дипломы и интеллигентская спесь.\n\nПрактика к стыду нас, людей с дипломами говорит что чаще всего профсоюз предают именно такие как мы а не грубые работяги. Такая печальная правда.\n\n> \n> Абсолютно не согласен. Вы описываете некую абстрактную идеалистически-утопическую ситуацию. Требуется не \"просто знать методы борьбы\", пройдя какое-то там обучение, а иметь смелость им следовать, не страшать последствий от своих действий, для чего нужны живые примеры, а не теория. \n\nИх есть у нас - гуглим МПРА.  История этого союза это череда забастовок.  \n\nНе нравятся грубые промышленные рабочие - профсоюз Действие.  За этот год этот союз медиков провёл как минимум три успешные итальянские забастовки.\n\nЕсть и более тонкие ребята из профсоюза Учитель, аккуратно уменьшающие отчётность учителей там где они пристуствуют. Без суеты и внешних конфликтов.\n\n> Одного врага в виде карательной государственной машины хватит с лихвой. \n\nА не надо лезть в конфликту в которых ты заведомо проигрываешь.  Думаем головой, по крайней мере пока есть такая возможность.  Выбору целей, анализу противника также учат в процессе профсоюзного обучения.  Разведка и аналитика часть работы.\n\n> Откуда эта массовость возмется в условиях регулярно проводимого показательного-назидательного государственного террора?\n\nГосударство обычно не вмешивается в конфликты внутри частных компаний. Мы не лезем в политику и не воюем с государством.\n\n> Массовость должна быть на деле, а не в \"группе  ВК\", которая дружно разбежиться, как только жаренным запахнет, при этом отдуваться за всех придется вам лично, как организатору.\n\nУже проходили. Даже не раз. Даже известны типичные ошибки и способы их избежать.  Правда учится народ не любит и всё так же наступает на  грабли, хотя и пореже чем раньше.\n\n> Все считают, что лучше \"немного потерпеть\", чем в однчасье поломать свою жизнь и жизнь свои близких, став \"борцом за...\"\n\nзарплату,  отмену увольнения, безопасные условия труда.  НО \"НЕ с системой\".\nДон Кихотов не держим. Есть печальные опыт работы с идиотами и идеалистами.\n\n> Любые игры в демократию закончатсяь в тот миг, когда самые активные участники попадут под настойчивый прессинг \"предложений от которых нельзя отказаться\"...\n\nопять же проходили. Органы не всемогущие, какой то процент агентуры есть всегда, иногда их знают иногда нет, но демократия внутри профсоюза всё же действует - идиотские и слишком нелогичные идеи агентов влияния очень легко заметны. \nЕщё раз - профсоюзное обучение проходят все и все начинают хотя бы примерно понимать что полезно союзу что нет.",
				"added": 1566157961
			},
			{
				"comment_id": 129,
				"body": "Вижу что по какой-то неизвестной мне причине вы в том числе не понимаете что такое профсоюз.\nЭто реально просто беда.  Очень много людей с  кем беседовал пытаются рассуждать как вы.\n\nПрофсоюз это просто. Менеджер увольняет рабочего - профсоюз говорит \"только попробуй - врубим итальянку!\",   менеджер понимает, что \"итальянка\" это провал плана.  Рабочий остаётся на работе.\n\nДиректор не повышает зарплату рабочим в течении года. Профсоюз говорит - или повышаешь или бастуем.  Директор понимает что если сейчас будет забастовка, то сорвётся выполнения заказа от важного клиента (профсоюз естественно специально выбрал момент) - идёт на переговоры.  Результат - рабочим повысили зарплату.\n\nНа заводе забастовка.  Рабочие во время забастовки НЕ получают зарплату. У Ивана заболел сын, он идёт в профсоюз, рассказывает о болезни сына и получает из обшака помощь.  \n\nВ ИТ компании директор увольняет разработчиков и сокращает зарплату тестировщикам.  Профсоюз начинает забастовку .  Сисадмины прячут бэкапы и устраивают сбой на проде.\nДиректор носится в панике грозится всех засудить к нему приходит человек из профсоюза и предлагает мир на разумных условиях.. Результат - нет сокращений, у всех прежняя зарплата, yandex.ru работает (это вымышленное совпадение)\n\nВ городе Затрищенске полиция прессует профсоюзного активиста - подбросила наркоту и грозит посадить его.  Профсоюз пока слаб для забастовки. Тогда профсоюз обращается к товарищам в Москве и просит о помощи. В город Задрищенски приезжает московский адвокат и правозащитник (ведь в его организацию поступило пожертвование от профсоюза), федеральная либеральная газета пишет статью о репрессиях в Задрищенске.\nИтог - активиста отпускают\n\nВ городе Пёсбурге закрылся ресторан.  Работников выгнали без выходного.  Они идут в профсоюз.  Профсоюз договаривается с ними что если им удастся вернуть не выплаченную зарплату и выходное - они сделают в кассу союза взнос как члены союза.  \nПрофсоюз находит истинного владельца ресторана. Им оказывается грузинский еврей уехавший в Израиль.  Дурзья профсоюза в Израиле рассказывают всей бизнес-тусовке что этот господин - гнида и денег давать ему опасно. У бывшего владельца ресторана нет больше кредитов на новый бизнес, все знакомые как то странного на него смотрят, в сети распространяется информация о том что он должен денег работникам.\nВы понимаете с какой радостью он согласился вернуть зарплаты и выходное, когда получил из далёкой снежной России такое скромное предложение:-)",
				"added": 1566160775
			},
			{
				"comment_id": 130,
				"body": "Все описанные мной кейсы взяты из практики.  Изменены только детали указывающие на место, время и личности участников.\n\nПрактически повышение зарплаты независимые профсоюзы в России добивались несколько раз.\nСамый последний случай - ликвидация Фольцвагеном завода во Всеволжске.  Там рабочим сразу предложили от 5 до 12 окладов по сокращению, при положенных трёх.\nЧто забавно МПРА считает этот случай поражением.\n\nМедики - Действие как уже писал только в этом году победили в трёх забастовках.\n\nБывают и поражения. Бывает пытаются людей потом выжать с работы.  Иногда успешно иногда нет. Меня например так и не смогли уволить после организации забастовки. \n\nПро все профсоюзы не скажу, в МПРА сейчас порядка 5 тысяч человек.  Под репрессии лично попадали наверное человек 200. Из них удалось уволить работодателям половину.  \n\nУ медиков в Действии сейчас около 2500 человек. Под репрессиями было человек 300.  Там уволенных побольше будет до 2/3  если не больше.  \n\nТочно также как в МПРА более всего страдали люди из небольших первичек, там где работодатель не боялся забастовки.\n\nОпять же во всех случаях которые знаю сценарий почти один и тот же -  слишком раннее проявление союза перед работодателем. Люди вместо того чтобы искать новых членов, тихо агитировать,  изучать теорию и копить кассу решили что могут выступить сразу.\n\nБыли и просто клинические случаи когда в силу отсутствия обучения люди не знали, что можно не отвечать на вопрос работодателя о членстве в профсоюзе или соврать в ответе.  Работодатель  вызывал \"подозреваемых\" на беседу и потом просто увольнял за честный ответ.\n\nБыли случаи когда первичка организовывалась в виде публичной (!) группы в ВК.  Даже стукача не надо - просто заходили в группу и смотрели кто в ней состоит а потом увольняли.\n\nБыл случай когда небольшая первичка сама проявилась выставив пикет  перед офисом работодателя!\n\n\nЕсли убрать подобные (перечислил не все) тупейшие ошибки то на мой взгляд опасность сокращается на порядок",
				"added": 1566171845
			},
			{
				"comment_id": 131,
				"body": "> [swashbuckler](#comment_10_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): И сюда говно в уши заливают... Профсоюзы, вконтактик, дискордик, новости великой РФии...Зеронет загнётся из-за людей, которые приносят всё тот же мусор, которого полно в клирнете. А полно его потому, что мусор - в головах.\n\nЧто вы здесь предлагаете обсуждать?\n\n> Вы обсуждаете не то и не там, ultraviolet. Защищать права рабов внутри капиталистической системы - это сильно.\n\nВаши предложения?",
				"added": 1566219050
			},
			{
				"comment_id": 135,
				"body": "> [swashbuckler](#comment_12_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Предложения? Ну, смотрите: вы предлагаете \n> \n> А чем вас не устраивает уже существующий проект https://roskomsvoboda.org/ ? \n\nТем что это НЕ профсоюз.  и Пиратская Партия также НЕ профсоюз.\n\nУ профсоюза есть то чего нет у них - он может путём забастовки сделать больно как бизнесу так и правительству (если он конечно большой).\n\nГипотетическая забастовка работников Ростелекома или нескольких региональных провайдеров остановила бы внедрение цензуры.\n\nА представьте забастовку работников РЖД - тут можно прямо выдвигать требования к правительству, например вернуть обратно пенсионный возраст\n\n> \n> Громкие слова: \"демократический\", \"боевой союз\", \"защита прав/интересов\". Звучит как лозунги типа \"летим, сломя голову и уделываем всех\". \n\nЭто НЕ лозунги а способ организации союза. \n\nОбъясняю - профсоюз НЕ орган власти. Он не может заставить что либо делать своих участников. Единственный путь сделать например забастовку состоит в том чтобы участники профсоюза были за неё.  \nПока большинство как миниумм членов профсоюза не готовы бастовать - забастовки не будет. Как только они изменят решение - будет забастовка\n\nФинансируется профсоюз также только своими участниками (гранты обычно вредны).  Собрать деньги насильственно нельзя.  Чтобы люди отдавали деньги они должны видеть что отданные средства пойдут на полезные дела и иметь возможность влиять на то какие же проекту будут финансироваться\n\nВот вам и демократические основы профсоюза.  Без демократии он просто не работает или превращается в фикцию (советские профсоюзы такими и стали)\n\n>Технологиям и процессам внутри системы плевать на ваши забастовки. Бастуют грузчики, потому что им не платят или у них нет работы? Так стоит задуматься, почему так происходит и подумать, почему беспилотные дальнобойщики справляются с задачами дальних рейсов лучше, чем водители, которым нужно спать, кушать и получать вознаграждение.\n\nМечты прекрасны но на дорогах пока нет ни одной подобной машины.\n\nВодителей - гастарбайтеров я вижу много но вот роботов как то не очень.  Догадываетесь почему?\n\n> Я клоню к тому, что вашим основным инструментом лучше бы выбрать образование. Чтобы бастовать, много ума не нужно. \n\nА вы не подумали что рынок труда конечен?\n\nМожно конечно изучать новые фреймворки и языки программирования, только вот это соревнование со своими же коллегами - ИТ работниками\n\nКонкуренция между работниками снижает зарплаты. \n\nЗачем нам усиливать эту конкуренцию?\n\nДля повышения зарплат нам нужно монополизировать рынок труда и диктовать с помощью нашей монополии - профсоюза условия работодателям, а не устраивать \"забеги задротов-ботаников\"",
				"added": 1566420553
			}
		],
		"2_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 127,
				"body": "Спасибо!\n\nМожно подробности - с какими сложностями встретились и как побороли?",
				"added": 1566023209
			}
		]
	},
	"comment_vote": {
		"1_1Dk2yqfYUheHV7BhNX53EPrXisN341NpXb": 1,
		"34_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"35_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"44_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"1_1PR4t74Qa3uWZuAUyPs6yPZm2kzuQdN3q7": 1,
		"3_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"2_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"41_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"4_1Ep8V723YpoKTnLooL85oyUiEZC4p1uK6A": 1,
		"4_1G8uRPFZNoeU4PejqGuL8yBAA22ymDh41M": 1,
		"61_1PhoZA8X2sfRe548Hmt7g8CzieVBLzBz1N": 1,
		"4_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"1_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": 1,
		"4_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": 1,
		"29_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"26_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"8_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": 1,
		"20_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"1_14F7aQfZ8Vq1cbnVrj7HybMy8MtWhwP7o2": 1,
		"59_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"21_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"27_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"1_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": 1,
		"3_1532gmVR6nUwMS85i4JTgiqQY1rn44pkd3": 1,
		"75_1GDzVsFoYamHqWcYBcuvVWFCAt3Y5yPNde": 1,
		"26_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"3_1AuVGLDjx35QmYxQ69dzgtuuYxpBWtuF1t": 1,
		"18_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"14_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"2_1EHrBqNZLu3He8t98otjqezt5jRE8euGSA": 1,
		"1_1DR9EVmTR2KA8mJXmzTknbEAUzveKLRJut": 1,
		"3_19uSFyTp3RDUX5TU1JLXLwfur81Dm4CGKE": 1,
		"64_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": 1,
		"1_18muKLaf4a57uvG72BowfBmVm3Mc15Gyh7": 1,
		"1_1NEipL4NsY5HP3QumkWJewYJwFtvgwMxu8": 1,
		"16_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"2_1MhiMP1PsbfA5VATp5RBz5bxmttVssCAYK": 1,
		"3_1MhiMP1PsbfA5VATp5RBz5bxmttVssCAYK": 1,
		"1_1PxCUjGhDFJ4K5r2zvJtHsXqaMvPuQobTJ": 1,
		"164_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"31_17cZ8sioZ4oz5eGwE6Qck5Ds1USPoWEXkZ": 1,
		"41_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"26_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd": 1,
		"9_1LGLe311PAqQm63B2A1MnFctPm8W25XC1i": 1,
		"22_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt": 1,
		"25_1AVvhHkYNzTBg2T3CGqBSeJsC7aybAPTGd": 1,
		"4_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"78_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"3_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"77_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"76_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"2_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"42_13kHXBodQf1zHGQ66harDbXAQvvJh5zr3Y": 1,
		"24_1JiK5WEkTENpbRTnLELf5AaVt1M6qghEEy": 1,
		"1_1LcayBWpKzDyA4nrzDMyK6cURLZ5kP6Xk9": 1,
		"1_1KAa1EUZMdE2zFEGZjUJqDzmYteGZEX8PH": 1,
		"18_1EuiXCvBRfV3qrJTyi4KPcnj9iEppALsrt": 1,
		"45_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"7_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": 1,
		"70_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"142_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"68_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"72_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"152_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"3_13cUGKo7xDkrGpNN22TQPAwMhdginKHhDb": 1,
		"153_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"72_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"3_18Pv6KgZ4tNPHBLMxtDZbH7j4Hi6rpwEvP": 1,
		"85_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"19_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"71_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"176_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1,
		"13_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"14_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"16_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": 1,
		"84_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"3_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": 1,
		"135_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"9_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"1_17AzrzCCUAMaosbteZ5CFE1JFiKgFDK2BZ": 1,
		"75_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"8_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"5_1NLPDTeR1u6wktAeKpWY9rgyEgdnBjYbWy": 1,
		"138_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"75_1CmBmdEsp9mKh34RfukgkgnBY8cqwp6jqM": 1,
		"8_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"17_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"90_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"140_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"17_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"8_1LJo4LufkNKRJYCHFB2SftfPiBvyGN8nw2": 1,
		"176_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"178_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"13_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"12_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"8_1B5kPsVmi5Uy9dDuZau6Fo2LwR9deN6LXa": 1,
		"10_1LqR5zxKufzzvmkbbrTHdbn3cHRsefLTz3": 1,
		"19_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"20_1GrTv5QgmApo9jMgoWFFq1RwUpQWqtbhnQ": 1,
		"201_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"181_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"3_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"2_1Ee72Vmn581qKBm6umMgNBT4DEN4z6r1L": 1,
		"7_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"2_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"117_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"1_1ASCQijy53wv55RL1QPcCvSkZ5wbSeXeBb": 1,
		"204_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"118_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE": 1,
		"72_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2": 1,
		"182_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1,
		"32_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"86_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"33_1ENawU15w53hf4C8M5LL6xhJhuqRhvxVyL": 1,
		"174_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7": 1,
		"5_1J3zHeRQJosJJJhd4RRondHRyfSVGnCmNv": 1,
		"87_12ETjYdAqyFq3T1LxfE4NwKwWkB1D4QZ54": 1,
		"19_15bXfYrgn11ULbJ71nHqDrERcxNotpYsqP": 1,
		"207_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"12_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"14_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"13_1Hv6XQPZGmAkb47zJy7ednE7gBRCCJCQYp": 1,
		"208_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"186_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp": 1
	}
}