{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 195,
	"comment": {
		"1_14NydP2LLY59TBYtWn61qJPuR7w7HizwjG": [
			{
				"comment_id": 1,
				"body": "Кто знает, русские торренты в зеронет завезли?",
				"added": 1457150586
			},
			{
				"comment_id": 2,
				"body": "> [esteban](#comment_7_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): А так ли надо. Торрентов в интернете хватает. Если всё подряд сюда нести, то, к примеру, база рутрекера более 4 Гб. Другое дело - небольшое и хорошо оформленное, вроде Play. Но это всё равно не интересно. \n> Можешь зайти на zerotorrents и добавить русский торрент туда. Будут тебе в зеронете русские торренты.\n\nНу так на PLAY как добавить раздачу?",
				"added": 1457177619
			},
			{
				"comment_id": 3,
				"body": "esteban: надо отдельный ник мутить и потихоньку магнеты, например, с рутора перетаскивать :)",
				"added": 1457178202
			},
			{
				"comment_id": 4,
				"body": "> [shift](#comment_108_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ты можешь клонировать play и наполнить его русским контентом, если тема интересна готов статью написать\n\nбыло бы замечательно, пока только официалку читал. еще непонятно: при логине отображается \"select account\" и выбрано \"unique to site\". Это я понимаю уникальный привязанный только к одному сайту логин? И он почему то не прокатывает, только zeroid",
				"added": 1457178476
			},
			{
				"comment_id": 5,
				"body": "http://127.0.0.1:43110/1K2jQdBFNFUHhGrAv8g9Z2Ln4BNcQdqhBb/Movies.html уже добавляют русские торренты",
				"added": 1457178639
			},
			{
				"comment_id": 6,
				"body": "еще кстати, идейное развитие PLAY: добавить web-torrent client на js. Только тогда раздачи надо будет ловить :)",
				"added": 1457178848
			},
			{
				"comment_id": 7,
				"body": "что за медуза, я не в теме :) да и грани. Слэнг чекистов?",
				"added": 1457179107
			},
			{
				"comment_id": 8,
				"body": "грани заблочен, а медуза - выглядит как простой новостной сайт или нужно копать глубже?",
				"added": 1457179308
			},
			{
				"comment_id": 9,
				"body": "а почему грани блочат?",
				"added": 1457179362
			},
			{
				"comment_id": 10,
				"body": "понятно, кстати интересно почему рутрекер сюда не перебазировался, а начал двигаться в сторону i2p?",
				"added": 1457179545
			},
			{
				"comment_id": 11,
				"body": "ну у них темы на форуме были по этому поводу, и да, скорее всего так и есть. Тут надо движок переделывать, а они еще и оправдываются, мол i2p не шпионит и проверен",
				"added": 1457179826
			},
			{
				"comment_id": 12,
				"body": "а чем принципиально .lib и .bit отличается от .org и .is? не нужно настоящие данные вводить?",
				"added": 1457179889
			},
			{
				"comment_id": 13,
				"body": "> в общем много вопросов и страшно в открытом инете задавать их...\nа что страшного-то? Какие вопросы интересуют, что аж страшно? :)",
				"added": 1457189821
			},
			{
				"comment_id": 14,
				"body": "ахах, только что на хабре увидел скриншот, сделанный буквально этим днем :)",
				"added": 1457195691
			},
			{
				"comment_id": 15,
				"body": "и у меня флаг - черно-белый и такое отображение непонятно как сделать",
				"added": 1457195758
			},
			{
				"comment_id": 16,
				"body": "если пашет тор - то видит беспорядочные соединения с непонятным (для него) содержимым. Если тор не пашет, то видит тоже непонятные сообщения (считай шифрованные) только с другими адресами",
				"added": 1457196232
			},
			{
				"comment_id": 17,
				"body": "https://zeronet.readthedocs.org/en/latest/faq/ полезно кстати почитать",
				"added": 1457196477
			},
			{
				"comment_id": 18,
				"body": "ну там написано все доступно, переводчик в помощь, если что спрашивай здесь",
				"added": 1457196653
			},
			{
				"comment_id": 19,
				"body": "новостями можно назвать оф блог",
				"added": 1457197037
			},
			{
				"comment_id": 20,
				"body": "> [shift](#comment_113_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): К слову - соединения таки шифрованные внутри zeronet так, что установить что передают юзер - нельзя но по идее насчет какого сайта  - можно. Но это не задача этой сети имхо, прятать такую информацию.\n\nкаким образом? заголовки, я думаю, тоже шифруются",
				"added": 1457198622
			},
			{
				"comment_id": 21,
				"body": "> [authh](#comment_1_12bryZKis7YztRSaiyHsqSM1Z1gg4UNhpR): КСТАТИ КТО СДЕЛАЕТ РУССКУЮ ВИКИПЕДИЮ В ЗЕРО НЕТЕ?ВОТ ТУТ ОБРАЗ РУССКОЙ ВИКИ НА 15 ГБ\n> http://www.kiwix.org/wiki/Main_Page/ru\n\nты сделаешь",
				"added": 1457240464
			},
			{
				"comment_id": 22,
				"body": "> [authh](#comment_1_12bryZKis7YztRSaiyHsqSM1Z1gg4UNhpR): КСТАТИ КТО СДЕЛАЕТ РУССКУЮ ВИКИПЕДИЮ В ЗЕРО НЕТЕ?ВОТ ТУТ ОБРАЗ РУССКОЙ ВИКИ НА 15 ГБ\n> http://www.kiwix.org/wiki/Main_Page/ru\n\nhttps://ru.wikipedia.org/wiki/%D0%92%D0%B8%D0%BA%D0%B8%D0%BF%D0%B5%D0%B4%D0%B8%D1%8F:%D0%9A%D0%B0%D0%BA_%D1%81%D0%B4%D0%B5%D0%BB%D0%B0%D1%82%D1%8C_%D0%BA%D0%BE%D0%BF%D0%B8%D1%8E_%D0%92%D0%B8%D0%BA%D0%B8%D0%BF%D0%B5%D0%B4%D0%B8%D0%B8\nвообще полезно было это почитать перед тем как написать",
				"added": 1457249839
			},
			{
				"comment_id": 23,
				"body": "скорее бы сделали обратную прокрутку (по времени), а еще лучше начинать с непрочитанного",
				"added": 1457263643
			},
			{
				"comment_id": 24,
				"body": "http://127.0.0.1:43110/zaphods.bit/RM.html",
				"added": 1457264026
			},
			{
				"comment_id": 25,
				"body": "классный план, прям идея миллионов :) На каком пункте реализация стоит?",
				"added": 1457273271
			},
			{
				"comment_id": 26,
				"body": "если серьезно, то \n1. зеронет нужен как способ доставки магнет ссылок\n2. и 3. Люди УЖЕ придумали https://webtorrent.io/ осталось только приделать к зеронету\n4. тут уже сложнее, так как все русские трекеры жлобят свои базы\n5. ненужно",
				"added": 1457273605
			},
			{
				"comment_id": 27,
				"body": "> [leinariys](#comment_2_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Как можно повлиять на генерацию имени для сайта?Что бы команда siteCreate выдала адрес в начале которого заданное значение например 1KINO2siuvhdifh\n\nнасколько помню нужно много-много хэшить, чтобы получить необходимое тебе совпадение",
				"added": 1457273665
			},
			{
				"comment_id": 28,
				"body": "> [esteban](#comment_51_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Рутрекер же не жлобит.\n\nжлобит, либо ссылку на архив в студию (находил оф ответ рутрекера о том что официально архив они раздавать не будут, только самостоятельно можешь качать по файлу за раз)",
				"added": 1457275523
			},
			{
				"comment_id": 29,
				"body": "> [vlad20012](#comment_4_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): WebTorrent - протокол с торрентом несовместимый сам по себе. Для него нежны транзитные ноды (которые умеют и Torrent, и WebTorrent), да и для зеронета это бесполезно. Достаточно залинковать libtorrent и добавить в API несколько функций\n\nвы вообще про что, какая несовместимость протокола с торрентом? курил что ли, и на страницу не ходил, там джаваскрипт, который ты вставляешь себе на страницу и усё",
				"added": 1457275577
			},
			{
				"comment_id": 30,
				"body": "https://webtorrent.io/faq сразу бы сюда посылал",
				"added": 1457275710
			},
			{
				"comment_id": 31,
				"body": "основывался на \"новостях\" опеннета, так что верить им теперь нельзя, обманывают :) почиткал фак и все-таки вы не правы:\n1. ну заменили TCP на webrtc, и? если много народу будет пользоватся именно webrtc то это не проблема\n2. плагины в браузеры - зло по многим причинам",
				"added": 1457275898
			},
			{
				"comment_id": 32,
				"body": "> [esteban](#comment_53_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): http://rutracker.org/forum/viewtopic.php?t=4824458\n> на самом видном месте, в разделе обхода блокировок.\n\nну классно, значит поменяли своё мнение",
				"added": 1457276202
			},
			{
				"comment_id": 33,
				"body": "hashshop.i2p кто-нибудь там был? Пишут что там более полная версия в том числе с закрытыми раздачами",
				"added": 1457276454
			},
			{
				"comment_id": 34,
				"body": "а меня смутил аттрибут \"cloneable\": true Каким образом хозяин может ограничить копирование сайта, если просматривая его, я копирую его",
				"added": 1457283495
			},
			{
				"comment_id": 35,
				"body": "> [authhh](#comment_3_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): ФЕОДАЛЫ МОНОПОЛИСТЫ БЛОКИРУЮТ ЗНАНИЯ И ИНФОРМАЦИЮ!\n\nсам то много протеинов насчитал? :)",
				"added": 1457283542
			},
			{
				"comment_id": 36,
				"body": "> [authhh](#comment_5_1H3Sa4xyMVGuVEsKraM6qLAL1y8dmLANeg): МНОГО, МЫ СОЗДАЛИ ВСЕ РЕСПРЕДЕЛЕННЫЕ СЕТИ И ZERO NET, НАС НЕ УПОМИНАЮТ НАС БОЯТСЯФЕОДАЛЫ ОХУЕЛИ ВКОНЕЦ, КОГДА ЗА ЖИЛЬЕ НУЖНО БРАТЬ ИПОТЕК КОГДА ЗА ЕДУ НУЖНО ПЛАТИТЬ\n> ВСЕ ПРОБЛЕМЫ СОЗДАЛИ ФЕОДАЛЫ МОНОПОЛИСТЫ - ЧЕЛОВЕЧЕСТВО НЕ ИМЕЕТ НИКАКИХ ПРОБЛЕМ ИЛИ ДЕФИЦИТА РЕСУРСОВ, ВЕСЬ ДЕФИЦИТ СОЗДАН ФЕОДАЛАМИ МОНОЛИСТАМИ  ДЛЯ ПРИБЫЛИ\n\nа че SETI@HOME не упоминаешь? много пришельцев нашли с его помощью",
				"added": 1457283752
			},
			{
				"comment_id": 37,
				"body": "> [esteban](#comment_57_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): БОИНК РАБОТАЕТ, ВСЁ ТОРМОЗИТ НЕ МОГУ НИЧЕГО ПИСАТЬ В ЗЕРОНЕТ, ЧТО ДЕЛАТЬ?\n\nТАК И ДОЛЖНО БЫТЬ",
				"added": 1457283769
			},
			{
				"comment_id": 38,
				"body": "пока",
				"added": 1457283850
			},
			{
				"comment_id": 39,
				"body": "| Rosetta@home Free for academic and non-profit use, proprietary license available for commercial use \nи тут проприерасты :(",
				"added": 1457283905
			},
			{
				"comment_id": 40,
				"body": "Результаты вычислений Rosetta@Home не доступны напрямую. Так же, нельзя использовать результаты вычислений собственного компьютера.[3] Однако они используются для большого количества научных публикаций.[4] \n\nПрекрасно, я считаю",
				"added": 1457283988
			},
			{
				"comment_id": 41,
				"body": "на основе SETI хоть статьи никто не пишет, да и не продает инфу",
				"added": 1457284033
			},
			{
				"comment_id": 42,
				"body": "а тип не унимается :)",
				"added": 1457289601
			},
			{
				"comment_id": 43,
				"body": "где там проголосовать за модерацию? :D\nприкольно появляются чужие редакции коментариев, моргнул и пропустил момент :)",
				"added": 1457289641
			},
			{
				"comment_id": 44,
				"body": "> [coyc](#comment_1_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): есть вопрос такого характера: мой ip же скрывается тором, ведь так?\n\nлучше wiresharkа на твой вопрос врятли кто ответит",
				"added": 1457289764
			},
			{
				"comment_id": 45,
				"body": "> [coyc](#comment_3_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): в чем суть тора тогда в данном случае\nв том что провайдер с бОльшим трудом сможет забанить тор, нежели порты зеронета, да и техники так более изощренные",
				"added": 1457289954
			},
			{
				"comment_id": 46,
				"body": "если просто юзать тор браузер, будет не совсем то, что происходит при так сказать нативном использовании тора, посредством скрытых сервисов",
				"added": 1457290004
			},
			{
				"comment_id": 47,
				"body": "об этом написано в faq",
				"added": 1457290019
			},
			{
				"comment_id": 48,
				"body": "на самом деле разработчики об этом думают, и делают. А на данный момент нужно отключить все кроме 127.0.0.1",
				"added": 1457290080
			},
			{
				"comment_id": 49,
				"body": "и убедиться в консоли что соединений окромя тора нету",
				"added": 1457290096
			},
			{
				"comment_id": 50,
				"body": "ну и wireshark окончательно должен подтвердить",
				"added": 1457290114
			},
			{
				"comment_id": 51,
				"body": "> [gomzik](#comment_224_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Да, я вот тоже смотрю на этот проект не как способ анонимности, а как способ убежать от всяких роскомнадзоров и прочих шлюх, которые банят неугодный контент\n\nбоюсь что без анонимности не далеко убежишь :(",
				"added": 1457290143
			},
			{
				"comment_id": 52,
				"body": "офтоп: при каком резерве свободного места надо обращатся в отдельную ветку? как прижмет или можно заранее? :D",
				"added": 1457290200
			},
			{
				"comment_id": 53,
				"body": "> [gomzik](#comment_225_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Дополнительный слой в виде тора есть, пожалуйста, пользуйтесь. Для меня тут все же первично не себя скрыть, а добраться до желаемого без затруднений.\n\nну так насчет анонимности я ж не спорю",
				"added": 1457290239
			},
			{
				"comment_id": 54,
				"body": "> [gomzik](#comment_226_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): в первый раз лучше позже, чтобы админ опознал, адекват ли ты или нет :)\n\nда уж, по-моему тут критерий адекватности: постишь ли ты про протеины и иллюминатов :)",
				"added": 1457290293
			},
			{
				"comment_id": 55,
				"body": "причем заметил что соединений по тору больше нежели обычных, видимо это специально",
				"added": 1457290371
			},
			{
				"comment_id": 56,
				"body": "> [vlad20012](#comment_19_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Много людей ставят \"только Tor\", поэтому с ними можно соединиться только так\n\nопция --tor allways или как-то там?",
				"added": 1457290449
			},
			{
				"comment_id": 57,
				"body": "еще интересно откуда authhh берет тексты, ну не сам же сочиняет, то есть я к тому что это уже кто-то написал и где-то опубликовал",
				"added": 1457290499
			},
			{
				"comment_id": 58,
				"body": "> [vlad20012](#comment_20_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): В ZeroHello справа вверху есть кнопочка. Enable Tor for every connections (slower)\n\nя ее не тестил, что она делает?",
				"added": 1457290526
			},
			{
				"comment_id": 59,
				"body": "> [coyc](#comment_6_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): попробовал зайти через режим инкогнито - ip не изменился, как трудно жить\n\nмдя, а почитать что же за режим инкогнито не судьба?",
				"added": 1457290543
			},
			{
				"comment_id": 60,
				"body": "> [coyc](#comment_6_1MP1bWn8gCMWSENXFX5urMY6XHXUscryHo): попробовал зайти через режим инкогнито - ip не изменился, как трудно жить\n\nесли прокси будешь юзать или впн то изменится",
				"added": 1457290570
			},
			{
				"comment_id": 61,
				"body": "> [vlad20012](#comment_21_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): ZeroNet будет работать только через Tor\n\nя не про это, я вижу два варианта:\n1. отключается все соединения кроме 127.0.0.1:9050\n2. соединения сживыми адресами идут посредством проксирования тора",
				"added": 1457290638
			},
			{
				"comment_id": 62,
				"body": "> [vlad20012](#comment_22_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Второй вариант\n\nпроверил?\nна самом деле мне больше первый вариант нравится",
				"added": 1457290727
			},
			{
				"comment_id": 63,
				"body": "ахах, не успел грохнуть свой камент :)",
				"added": 1457290757
			},
			{
				"comment_id": 64,
				"body": "> [vlad20012](#comment_23_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Черт, я перечитал и не понял ничерта =DЧем эти варианты отличаются вообще? ZeroNet коннектится только через тор, значит только его порт юзается. И все соединения через тор идут. Они не противоречат друг другу\n\nжаль, на самом деле из описания зеронета, скорее всего второй вариант. Еще раз: либо ты соединяешься посредством hidden services с другими такими же сервисами(отвязанными от реальных адресов) либо соединяешься посредством 3 хопов с реальниками",
				"added": 1457291031
			},
			{
				"comment_id": 65,
				"body": "> [vlad20012](#comment_25_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Каждая нода ZeroNet поднимает свой Tor hidden service\n> Каждая нода ZeroNet соединяется с другими нодами как через Tor hidden service, так и напрямую на хост: порт\n> Можно отключить то или другое в настройках.\n> \n> Какие еще вопросы?\n\nгде отключаются хост:порт?",
				"added": 1457291061
			},
			{
				"comment_id": 66,
				"body": "> [zeroatom](#comment_49_18ZDpdQ46CeSAwf39kn6UBPpVrHp9bMMhF): Я удаляю старые коменты, чтобы писать новые, потому что лимит не позволяет иначе. Так все делают? :)\n\nнет, но скоро я начну так делать :)",
				"added": 1457291084
			},
			{
				"comment_id": 67,
				"body": "> [gomzik](#comment_229_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): попросите shift, он вам даст еще места\n\nшапка какая? \"дай места!!!\"? :)",
				"added": 1457291140
			},
			{
				"comment_id": 69,
				"body": "> [vlad20012](#comment_28_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): ZeroHello http://127.0.0.1:43110/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/Правый верхний угол жмешь, второй пункт\n\nи опять возвращаемся: проверял самостоятельно?",
				"added": 1457291288
			},
			{
				"comment_id": 70,
				"body": "> [vlad20012](#comment_31_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Нет, не проверил, я читал блог разрабочик, там так написано.\n\nссылку не потрудишься прикрепить? :)",
				"added": 1457291556
			},
			{
				"comment_id": 71,
				"body": "> [nippletwister](#comment_268_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Финансирование проекта буксует, имхо. Я несколько раз предлагал разрабам запилить какую-нить монету для финансирования проекта, но они отказываются, говорят, мол, хочешь помочь - делай донат.\n\nну по сути они правы, у них и так работы много, а еще пилить велосипед для своей валюты",
				"added": 1457291590
			},
			{
				"comment_id": 72,
				"body": "кстати тут пользователей линукса много?",
				"added": 1457338150
			},
			{
				"comment_id": 73,
				"body": "> [gomzik](#comment_233_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Я такой. Правда не как сисадмин, а как девелопер, который регулярно сидит на линуксе\n\nдистрибутив какой, если не секрет?",
				"added": 1457340850
			},
			{
				"comment_id": 74,
				"body": "> [gomzik](#comment_234_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): ArchLinux\n\nо, как :) тогда скажи какой пакет ставил (zeronet/zeronet-git) или в домашнюю папку?",
				"added": 1457342004
			},
			{
				"comment_id": 75,
				"body": "и заодно пашет ли у тебя тор",
				"added": 1457342014
			},
			{
				"comment_id": 76,
				"body": "вон оно что :D вообще надо в фичреквест дописать нормальную работу приложения, чтобы все данные сайта жили в домашней папке, при том что сам бинарник может обитать в /usr/bin",
				"added": 1457342995
			},
			{
				"comment_id": 78,
				"body": "мне кажется или народу поубавилось?",
				"added": 1457352810
			},
			{
				"comment_id": 79,
				"body": "или все празднуют? :D",
				"added": 1457352826
			},
			{
				"comment_id": 80,
				"body": "не знаю, адрес в углу - это класс",
				"added": 1457353277
			},
			{
				"comment_id": 81,
				"body": "походу пора -tor allways врубать",
				"added": 1457353299
			},
			{
				"comment_id": 82,
				"body": "и носкрипт в догонку",
				"added": 1457353440
			},
			{
				"comment_id": 83,
				"body": "давай потестим на этом сайте :)",
				"added": 1457354447
			},
			{
				"comment_id": 84,
				"body": "или на сайте PLAY, там нагляднее будет",
				"added": 1457354471
			},
			{
				"comment_id": 85,
				"body": "ну вообще я там все истыкал",
				"added": 1457354692
			},
			{
				"comment_id": 86,
				"body": "и протестил tor always и он, кто бы мог подумать, проксирует соединения до реальников посредством 3 хопов",
				"added": 1457354725
			},
			{
				"comment_id": 87,
				"body": "> [leinariys](#comment_29_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Чтоб помнили, что следят)\n\nда ладно, если б он только мне отображался, можно легко сделать так, чтобы он сохранялся :D",
				"added": 1457355353
			},
			{
				"comment_id": 88,
				"body": "а че не в новом сообщении? экономим?",
				"added": 1457355552
			},
			{
				"comment_id": 89,
				"body": "и что значит \"Япошка с обложкой\"?",
				"added": 1457355570
			},
			{
				"comment_id": 90,
				"body": "вспоминается фильм \"такси\", где автомобиль стартовал на слове \"ниндзя\" и глох на \"япошка\" :)",
				"added": 1457355616
			},
			{
				"comment_id": 91,
				"body": "> [gomzik](#comment_248_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): и да, ваши флажки не работают в моих линуксах http://i.imgur.com/E0Q1U0r.png\n\nу меня черно-белый флажок",
				"added": 1457363004
			},
			{
				"comment_id": 92,
				"body": "> [vlad20012](#comment_57_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Да ничего особенного. Как обычно \"и так норм\"https://github.com/HelloZeroNet/ZeroNet/issues/331\n\nThe domain plugin is optional and not restricting it by site domain would allow to recover your ID even if ZeroID site is disappear for some reasons.\nчетне похоже на \"и так норм\"",
				"added": 1457364416
			},
			{
				"comment_id": 93,
				"body": "> [vlad20012](#comment_59_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Хотя я и не исключаю, что и правда и так норм\n\nтак над каким сайтом то работал?",
				"added": 1457364636
			},
			{
				"comment_id": 94,
				"body": "что сделать то хотел на основе зеронета",
				"added": 1457364672
			},
			{
				"comment_id": 95,
				"body": "а зачем распределенной (с закосом на анонимность) сети централизованная авторизация?",
				"added": 1457364768
			},
			{
				"comment_id": 96,
				"body": "и с точки зрения децентрализации тоже не рассматриваешь?",
				"added": 1457364815
			},
			{
				"comment_id": 97,
				"body": "так разработчики же писали, что это тестовый, в (далёком?) будущем таких zeroid будет много",
				"added": 1457365061
			},
			{
				"comment_id": 98,
				"body": "и в идеале на каждом сайте своя ID",
				"added": 1457365074
			},
			{
				"comment_id": 99,
				"body": "а разве это не авторизация своего рода? :)",
				"added": 1457365189
			},
			{
				"comment_id": 100,
				"body": "пошло веселье :)",
				"added": 1457368319
			},
			{
				"comment_id": 101,
				"body": "теперь 30 кб - совсем издевательство",
				"added": 1457368344
			},
			{
				"comment_id": 102,
				"body": "> [shift]\n> \n> Так у тебя же больше должно было стать\n\nя про умолчания для новичков",
				"added": 1457368852
			},
			{
				"comment_id": 103,
				"body": "интересно а аудио тоже теперь можно вставлять?",
				"added": 1457368883
			},
			{
				"comment_id": 104,
				"body": "чет тебя колбасит, сообщение то появляется то удаляется",
				"added": 1457368959
			},
			{
				"comment_id": 105,
				"body": "может обновляться надо?",
				"added": 1457369037
			},
			{
				"comment_id": 106,
				"body": "зря ты это написал, ща набежит любитель протеинов",
				"added": 1457369220
			},
			{
				"comment_id": 107,
				"body": "> [vlad20012](#comment_94_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Так, у кого еще были проблемы с в хроме с \"Message wrapper_nonce error, please report!\"? На хабре многие об этом писали. Я нашел причину: это FriGate.\n\nхромиум, проблем нету, да и фригейт не юзаю",
				"added": 1457412604
			},
			{
				"comment_id": 108,
				"body": "https://zeronet.readthedocs.org/en/latest/site_development/zeroframe_api_reference/\nэто всё что ли?",
				"added": 1457412854
			},
			{
				"comment_id": 109,
				"body": "> [gomzik](#comment_258_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): фригейт не юзаю, проблма есть\n\nну действуй как обычно: отключай все плагины, расширения, ставь по новой браузер, удаляй все личные данные (браузера). В таком порядке",
				"added": 1457427627
			},
			{
				"comment_id": 110,
				"body": "ну и сам зеронет не мешает чаще обновлять: уже rev949",
				"added": 1457427676
			},
			{
				"comment_id": 111,
				"body": "> [qw](#comment_6_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Не подскажите, как можно обновить? Выскакивает ошибка \"Connection with UiServer Websocket was lost. Reconnecting...\". Вероятно, что проблема не в браузере Google Chrome и не в его дополнениях, попробовал их отключить. В браузере Microsoft Edge та же проблема. Запуская файл \"zeronet\", как администратор, он начиная загружаться закрывается. И как вообще узнать, какая версия установлена?\n\nсамый простой способ: удалить и заново поставить, ТОЛЬКО!!! не надо забывать бэкапить users.json, иначе придется по-новой регаться в Zeroid и под новым именем",
				"added": 1457430152
			},
			{
				"comment_id": 112,
				"body": "http://127.0.0.1:43110/Stats открывается? там много полезной/интересной информации, включаю версию",
				"added": 1457430207
			},
			{
				"comment_id": 113,
				"body": "ща заметил что этот сайтик использует базу data/users/zerotalk.db это последствия \"Clone\"?",
				"added": 1457430313
			},
			{
				"comment_id": 114,
				"body": "или все сайты на основе zerotalk в одну базу записываются?",
				"added": 1457430339
			},
			{
				"comment_id": 115,
				"body": "> [qw](#comment_7_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Да, открывается, спасибо. У меня rev949, но почему тогда возможность обновить показывается в меню? Баг?\n\nстранно, конечно, может и баг, но я бы переустановил и посмотрел воспроизводимость :)",
				"added": 1457430603
			},
			{
				"comment_id": 116,
				"body": "пропадут",
				"added": 1457431022
			},
			{
				"comment_id": 117,
				"body": "> [qw](#comment_9_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Странно, количество пиров вдруг очень резко уменьшилось, в 10 раз! Ни одного пира из Северной Америки! Или это у меня какой-то сбой?Обновление:Отбой. Действительно сбой или сеть подгружалась\n\nсразу после перезапуска, количество пиров будет увеличиваться, может уйти целый день, чтобы число дошло до 1000 (на ZeroHello)",
				"added": 1457433933
			},
			{
				"comment_id": 120,
				"body": "> [shift](#comment_178_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): Ну так папка то его, а название БД я не менял\n\nа если сейчас поменяешь? :)",
				"added": 1457434270
			},
			{
				"comment_id": 121,
				"body": "> [vlad20012](#comment_95_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): \n\nне вижу, чтобы сливался",
				"added": 1457434301
			},
			{
				"comment_id": 122,
				"body": "> [vlad20012](#comment_100_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Если юзать Tor - никак. А так список всех находящихся у тебя файлов публикуется на трекер\n\nкакой еще трекер?",
				"added": 1457451167
			},
			{
				"comment_id": 125,
				"body": "> [esteban](#comment_61_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот, уже есть демонстрация загрузки контента через ipfs. Нужен запущенный демон, чтобы работало. \n> http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:9:Streaming+with+IFPS\n\nплодим сущности",
				"added": 1457452046
			},
			{
				"comment_id": 126,
				"body": "> [vlad20012](#comment_101_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): В общем-то на разные. Вот полный список:\n>             \"zero://boot3rdez4rzn36x.onion:15441\",\n>             \"zero://boot.zeronet.io#f36ca555bee6ba216b14d10f38c16f7769ff064e0e37d887603548cc2e64191d:15441\",\n>             \"udp://tracker.coppersurfer.tk:6969\",\n>             \"udp://tracker.leechers-paradise.org:6969\",\n>             \"udp://9.rarbg.com:2710\",\n>             \"http://tracker.aletorrenty.pl:2710/announce\",\n>             \"http://explodie.org:6969/announce\",\n>             \"http://torrent.gresille.org/announce\"\n\nпогоди-ка, то ест ькаждый раз когда я посчу сообщеньице, оно в первую очередь рассылается на эти хардкоденные трекеры? чет, помоему не так",
				"added": 1457452104
			},
			{
				"comment_id": 128,
				"body": "> [qw](#comment_14_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): И как этот хэш попадает к предположительному майору?\n\nда погоди ты со своим майором :)",
				"added": 1457452557
			},
			{
				"comment_id": 129,
				"body": "> [vlad20012](#comment_104_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Не само сообщение, а информация о том, что это сообщение у тебя есть. Т.е. его хэш (или что там в ZeroNet юзается для адресации, точно не знаю) и твой ip:port. Протокол точно такой же как в обычном bittorrent, никаких изменений. Таким образом трекер всегда знает, какие файлы у тебя находятся\n\nну так трекеры то захардкоденные? или как выбираются?",
				"added": 1457452576
			},
			{
				"comment_id": 130,
				"body": "> [vlad20012](#comment_105_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Захардкодены, да\n\nэто уже как-то напрягает, ибо захардкоденные дефолты - зло",
				"added": 1457452674
			},
			{
				"comment_id": 131,
				"body": "> [esteban](#comment_61_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот, уже есть демонстрация загрузки контента через ipfs. Нужен запущенный демон, чтобы работало. \n> http://127.0.0.1:43110/1CiAFnnf6kb2G1GzDV1FhttTWNxCa4mShn/?Post:9:Streaming+with+IFPS\n\nкстати, если нету ipfs то можно воспользоваться ipfs.io проксей\nтолько эта прокся загнется от сотни желающих позыркать блюрейку :D",
				"added": 1457453463
			},
			{
				"comment_id": 133,
				"body": "> [gomzik](#comment_259_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Там специальные трекеры, которые подмешивают рандомные айпи адреса. Но в целом же не реально сделать нормально соединенную сеть без узла для \"загрузки\\bootstrap\" хотя бы в первый раз и в качестве резервного способа.\n\nпро бутстрап то никто не говорит, та же i2p все равно бутстрапится с хардкод адресов, хотя может и без них, но долго",
				"added": 1457453745
			},
			{
				"comment_id": 134,
				"body": "> [leinariys](#comment_41_1K1pq5seXVvcwGGVLRdCFiF2J1QoFdNCJg): Более 240000 магнит ссылок РУТРЕКЕРАПополнение продолжается!http://127.0.0.1:43110/1BrodevWLcCZNwcdQK9v2FknSBUhK281oT\n\nrutrekere :D",
				"added": 1457489664
			},
			{
				"comment_id": 135,
				"body": "> [nippletwister](#comment_281_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Вышла новая версия, ребята - 957\n\nи что нового?",
				"added": 1457536385
			},
			{
				"comment_id": 136,
				"body": "Не люблю расстраивать людей, но вышла 966 уже :)",
				"added": 1457536430
			},
			{
				"comment_id": 139,
				"body": "Publish new content only to 3 passive peers\nProxy security updates Please update if you running one!\nKeep only 10 peers per site\nКто пояснит о чем речь?",
				"added": 1457536999
			},
			{
				"comment_id": 141,
				"body": "и еще: как помочь руссифицировать zeronet?",
				"added": 1457537071
			},
			{
				"comment_id": 142,
				"body": "Кстати, у кого-нибудь есть такой глюк? Способ воспроизведения:\n1. Открыть zeroboard\n2. пролистать вниз сообщения (можно и не листать)\n3. свапом сдвинуть панель, с глобусом\n4. задвинуть панель обратно\n5. попробовать промотать историю zeroboard'а\n\nОжидаемое действие: пролистывание сообщений должно работать\nа у меня скрол просто замораживается, только обновление страницы решает проблему",
				"added": 1457537797
			},
			{
				"comment_id": 145,
				"body": "и везде один и тот же коммент \"ахах, изобрели фидо/фринет\"",
				"added": 1457539066
			},
			{
				"comment_id": 146,
				"body": "кстати requeruku (или как его там) выкладывает на торрентах русские раздачи http://127.0.0.1:43110/192dZ1EG5tU7PnCfuwGMDEBrr2eLqvs4t3",
				"added": 1457539204
			},
			{
				"comment_id": 147,
				"body": "ничего не пропало",
				"added": 1457662053
			},
			{
				"comment_id": 148,
				"body": "Rev989 (скоро переполнение будет :D) Save users file on newsfeed follow, Local mode in Multiuser plugin to disable restrication and save users data to disk",
				"added": 1457701808
			},
			{
				"comment_id": 149,
				"body": "у них 99 issues, кто-нибудь нафигарьте сотую",
				"added": 1457701857
			},
			{
				"comment_id": 150,
				"body": "https://github.com/HelloZeroNet/ZeroNet/issues/145 чет как-то тухло",
				"added": 1457701994
			},
			{
				"comment_id": 151,
				"body": "> [shift](#comment_230_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): еще http://127.0.0.1:43110/Debug\n\n\"No error! :)\" дебажненько",
				"added": 1457715738
			},
			{
				"comment_id": 152,
				"body": "> [kostanew](#comment_92_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC): @shift как ты думаешь, есть смысл разделить флудилку на темы? Например техническое обсуждение, философия ZeroNet, прочее? Я уже замучался искать советы, которые мне дали 4 дня назад...\n\nнужно обсуждать технические темы НЕ во флудилке",
				"added": 1457784028
			},
			{
				"comment_id": 155,
				"body": "> [vlad20012](#comment_188_14nEeyHKvuhBchZp4N4eSwYVNAzvYfwKQF): Знаете, я, пожалуй, поставлю себе телеграм https://geektimes.ru/post/273142/Если это такая PR-компания, то она определенная удалась\n\nставь, разрешаю",
				"added": 1458751978
			},
			{
				"comment_id": 156,
				"body": "> [zerro](#comment_6_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Вот в том то и дело. Довольно много народу проходит, а никто не задерживается. Хотя все условия есть.\n\nнеправда Ваша, а вообще контента надо больше, чтобы хомяки подтянулись",
				"added": 1460469762
			},
			{
				"comment_id": 157,
				"body": "так а русский аналог PLAY так и не появился? :)",
				"added": 1461169042
			},
			{
				"comment_id": 158,
				"body": "да и вообще всего 40 чуловеков осталось на ru-zerotalke",
				"added": 1461169078
			},
			{
				"comment_id": 159,
				"body": "> [zerro](#comment_11_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): А чем русский play от нерусского отличаться должен? Фильмы другие?\n\nналичием РУССКИХ аудио-дорожек, не?",
				"added": 1461169728
			},
			{
				"comment_id": 160,
				"body": "> [gomzik](#comment_5_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Автоматически? Вряд ли. Можно конечно тупо все данные из базы данных вытянуть да использовать полнотекстный поиск, но учитывая то, что зеронет весь в себе, самостоятельный, без дополнительных зависимостей, то писать подобный велосипед как-то не рационально. Поэтому скорее всего сам сайт должен сообщить, как именно по нему искать.\n\nпопробовал поискать, видимо полнотекстовый поиск по всей локальной базе",
				"added": 1461169786
			},
			{
				"comment_id": 161,
				"body": "> [shift](#comment_273_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7): На обычном сейчас 200 судя по hello, видели, китай себе огромный форум запилил\n\nнет, не видели",
				"added": 1461170120
			},
			{
				"comment_id": 162,
				"body": "> [zerro](#comment_13_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): 200 -- это те кто когда-либо открывал сайт, необязательно вообще понимающие русский язык даже.\n\n\"обычный\" - это, я так понимаю, английский",
				"added": 1461170181
			},
			{
				"comment_id": 163,
				"body": "> [gomzik](#comment_12_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Хаха! работает!\n> Сейчас отписался от всего зеротолка, вбил \"абракадабра\" в поиск и оно нашло мое сообщение. Вобщем если сидируешь, то поиск работает. Как-то так.\n\nименно про это и говорится в пресс-релизе в блоге офф разработчика",
				"added": 1461248570
			},
			{
				"comment_id": 164,
				"body": "Кто-нить в курсе zeronet + ipfs во что-нибудь вылилось у кого-нить? :)",
				"added": 1461248604
			},
			{
				"comment_id": 165,
				"body": "https://github.com/fastcast/fastcast наткнулся только что. \n\nFeatures\n\nStreaming audio and video content\nUtilises a peer-to-peer network, so that you can stream high quality audio and video\nPowered by WebTorrent: a streaming torrent client for the browser",
				"added": 1461296061
			},
			{
				"comment_id": 166,
				"body": "> [gomzik](#comment_13_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Как видишь, это было не для всех очевидно, вот я эксперементально и проверил\n\nкрасава, много экспрессии :)\nчто скажешь про fastcast?",
				"added": 1461320457
			},
			{
				"comment_id": 167,
				"body": "походу народ разошелся :( (до следующей публикации на хабре)",
				"added": 1461495743
			},
			{
				"comment_id": 168,
				"body": "https://ipfstube.erindachtler.me/v/QmU1GSqu4w29Pt7EEM57Lhte8Lce6e7kuhRHo6rSNb2UaC",
				"added": 1461496115
			},
			{
				"comment_id": 169,
				"body": "> [wrewolf](#comment_128_18iELxgQf2hpjFuBofjEJyuvVazJt2ekSp): а что на хабре писали?\n\nда, давненько уже",
				"added": 1461597893
			},
			{
				"comment_id": 170,
				"body": "http://127.0.0.1:43110/1FUQPLXHimgCvYHH7v3bJXspJ7bMBUXcEb/\n\nYoutube для зеронет",
				"added": 1462271838
			},
			{
				"comment_id": 171,
				"body": "> [nippletwister](#comment_322_1PvAyLAB5H1JKbiFjx95ZJXrNJVyWxs5Hf): Чето не работает этот ютуб у меня.\n\nу меня работает \"Синтел\"",
				"added": 1462432472
			},
			{
				"comment_id": 172,
				"body": "вот только ошибка висит, дескать 1 файл не загружен",
				"added": 1462432492
			},
			{
				"comment_id": 173,
				"body": "> [zerotesterr](#comment_1_1Eor3LzydijptCuDjvkmNwiY8RT86HzM38): жива\n\nуверен?",
				"added": 1464273421
			},
			{
				"comment_id": 182,
				"body": "Почему у ru-zerotalk отображается \"1 file update failed?\"",
				"added": 1466007616
			},
			{
				"comment_id": 183,
				"body": "> [zerro](#comment_48_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Вот тут недостаток, когда владелец сайта забивает, некому лимиты поднимать. Вообще идея с лимитами довольно фейловая. Лимиты должны быть по времени.\n\nтем ценнее каждое слово :)\nP.S. можешь удалять свои старые сообщения",
				"added": 1466776677
			}
		],
		"4_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 68,
				"body": "\"золотой рудник скоро иссякнет!\"\nнужно больше пространства на комментов :D",
				"added": 1457291234
			}
		],
		"3_1LJP7tDoGnWNppUGJoNS8cJbmYTS1TecCC": [
			{
				"comment_id": 118,
				"body": "> [qw](#comment_3_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): Прикольный сайтНе ZeroNet, но интересно: Визуализация работы Tor'а\n\nофигет, германия тором пользуется да и вся европа",
				"added": 1457434034
			},
			{
				"comment_id": 119,
				"body": "ПАРИЖ - АМСТЕРДАМ - и непонятная точка посреди поля",
				"added": 1457434131
			},
			{
				"comment_id": 124,
				"body": "> [qw](#comment_10_1BrZRJjjXHj5J3vMBKsDuoxjYfUzvE7APh): splitfire, там ноды стоят.\n\nв поле стоит нода? :D",
				"added": 1457451377
			}
		],
		"1_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D": [
			{
				"comment_id": 123,
				"body": "> [akademic](#comment_4_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D): Запилил за вечер раздел Кино с Рутрекера:http://127.0.0.1:43110/1MoAyNQAaTbMFmTCTMiRz7uHV9KzeEZL8W\n> Пока только 400 фильмов.Понятно, что в таком виде не юзабельно.Надо разбираться с БД и делать поиск.\n\nлиха беда начала :) как сделать магнеты, это лучше посмотреть на PLAY",
				"added": 1457451319
			},
			{
				"comment_id": 127,
				"body": "> [akademic](#comment_6_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D): На play всё классно. Но объединять автоматически релизы по фильмам та ещё задачка.Есть мысль сделать это по imdbid, если он прикреплён к релизу.\n> Но первое с чем надо разобраться - это с БД и как сделать поиск. Остальное потом.\n\nв любом случае, удачи",
				"added": 1457452309
			},
			{
				"comment_id": 132,
				"body": "> [akademic](#comment_6_1AiNe41vBkiiNKYomPUcxQLV4prbq1gi7D): На play всё классно. Но объединять автоматически релизы по фильмам та ещё задачка.Есть мысль сделать это по imdbid, если он прикреплён к релизу.\n> Но первое с чем надо разобраться - это с БД и как сделать поиск. Остальное потом.\n\nкстати, тут есть идея вместо торрентов, попробовать использовать ipfs. Очевидные проблемы:\n1. человек с установленным ipfs мало (на винде есть проблемы с установкой и использованием)\n2. из людей, из пункта 1, хранящих крупные файлы еще меньше",
				"added": 1457453681
			},
			{
				"comment_id": 137,
				"body": "> [esteban](#comment_62_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Вот то есть ты предлагаешь webtorrent. Но закрываю я страницу и что, кто раздавать будет.\n\nну вот скачал я торрент клиентом файл, посмотрел и удалил, кто раздавать то будет?",
				"added": 1457536668
			},
			{
				"comment_id": 138,
				"body": "> [cypher](#comment_4_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Нет, не webtorrent, а обычный torrent, как расширение/ плагин для самого zeronet. Сколько хранить и сидировать просмотренный фильм - отдельный вопрос. Кто-нибудь знает как работает popcorn time в этом смысле?\n\nза плагин сразу НЕТ. Только начали избавляться от flash, java, так нет нас ничему история не учит, ибо кто будет:\n1. Поддерживать разные платформы (винда, линукс, мак, андроид, виндофон, айфон)\n2. Браузеры на десктопах неукоснительно отказываются от плагинов",
				"added": 1457536764
			},
			{
				"comment_id": 143,
				"body": "> [cypher](#comment_9_1DvD5pHwaCarvCYZhC67qV3QsfqgifZBA1): Я имел в виду нативную поддержку, а не опциональную. Плагин в данном случае - это просто модуль\n\nтогда понятно, и логично",
				"added": 1457538942
			},
			{
				"comment_id": 144,
				"body": "> [cypher]Да и вообще, то, что мы тут теоретизируем никак не повлияет на то, как это будут делать. Надо уж тогда на англоязычной борде об этом писать.\n\nтам топиков про это не видел",
				"added": 1457538991
			},
			{
				"comment_id": 181,
				"body": "скорее мертв :)",
				"added": 1465713481
			}
		],
		"3_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 153,
				"body": "> [boboro](#comment_2_1ETS4SugYbzwSEDicAhhvrLKrMCaAzeXqq): VLC думаю будет по урлу крутить\n\nой ну вы че! сейчас любой современный браузер нативно умеет и мп3 и огг и h264/h265",
				"added": 1458660082
			},
			{
				"comment_id": 154,
				"body": "> [esteban](#comment_87_1FZxKCwPzn7rvLaNi2rE7QHwvyq14XVWzi): Плеер есть, нет музыки.\n\nну так музыку накидают пользователи",
				"added": 1458699280
			}
		],
		"1_1Ae4VAbPLC6ZzSEBoVBS76M8URVBJ9Fwqx": [
			{
				"comment_id": 174,
				"body": "В оф блоге пишут, что следующая задача - соц сеть. И насколько я понял, основная задача сделать endless сайт, то есть сайт будет подгружать содержимое других ресурсов",
				"added": 1464513917
			},
			{
				"comment_id": 175,
				"body": "Насчет децентрализации: есть же zerotorrent в котором каждый может добавить торрент (действует такое же ограничение как и на этом форуме - 50 кб). То есть для начала дать каждому по возможности на один залив, а далее увеличивать квоту",
				"added": 1464514037
			},
			{
				"comment_id": 177,
				"body": "видимо это будет что-то типа странички со симлинками на другие странички",
				"added": 1465103674
			}
		],
		"1_152TBfcfUevahy1x3s5QQ1KswF1DGdVvpP": [
			{
				"comment_id": 176,
				"body": "Класс! Рекламить ф2ф сеть внутри п2п сети :) Ну создай че ж ты, только сначала закорешись с кем-нить, а то ничего не получится",
				"added": 1465065157
			},
			{
				"comment_id": 178,
				"body": "> [zerro](#comment_44_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): А где рекламить. Тут ближе по градусу деградации.\n\n>> деградации\nлучше в рекламу не суйся, не твое :)",
				"added": 1465103730
			},
			{
				"comment_id": 179,
				"body": "> [zerro](#comment_44_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): А где рекламить. Тут ближе по градусу деградации.\n\nа по теме: чтобы пользоваться ретрой надо как минимум иметь друзей в ней, так как сеть закрыта сама на себя (можешь для начала чат ботов поставить и посмотреть кто в чатах сидит)",
				"added": 1465103790
			}
		],
		"1_1DXxyNnRKTvzUcuvQhTu8uWSXSNYL4oVc6": [
			{
				"comment_id": 180,
				"body": "> [motoarhangel](#comment_4_16q5L1YCzxvXNa3YPVyqnqyhtNNRu4CHDS): В подтверждение моим словам. Братишка собирался в депутаты из народа. 2 красных диплома. Был опыт в гос. службе. Знаете что ему сказали? Если у тебя нет хотя бы 3 мил. даже не лукайся.)))) Вот Вам и государство. Кому мы нужны, скоты да бродяги?\n\nа кто ему сказал то?",
				"added": 1465103873
			}
		],
		"3_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 184,
				"body": "> [gomzik](#comment_15_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): заглядываю иногда\n\nчет раньше активнее был, вообще раньше здесь веселее было",
				"added": 1469973512
			},
			{
				"comment_id": 191,
				"body": "> [gomzik](#comment_16_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Я хочу вернуть те времена!\n\nнужна реклама и/или контент",
				"added": 1470758335
			},
			{
				"comment_id": 194,
				"body": "> [gomzik](#comment_23_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): рано для рекламы пока. Вот ZeroMe появится - вполне может быть инфоповодом. Мол твиттер для всех, никто не забанит и т.п.\n\nбыл же твистер, или что с ним не так?",
				"added": 1470901417
			}
		],
		"1_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ": [
			{
				"comment_id": 185,
				"body": "GET OVER HERE!!! :)\nчто за косяк с 1 file update failed?",
				"added": 1469973609
			},
			{
				"comment_id": 186,
				"body": "> [gomzik](#comment_17_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): где?\n\nНу у меня отображается \"1 file update failed\" и уже давно",
				"added": 1470674121
			},
			{
				"comment_id": 187,
				"body": "> [gomzik](#comment_19_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): Он вроде сначала в отпуске был, а сейчас по-идее должен заниматься ZeroMe. Может в глубокий дев ушёл?\n\nвообще автор видимо допилил, ждем обнов :)\nhttps://github.com/HelloZeroNet/ZeroNet/issues/232",
				"added": 1470674240
			},
			{
				"comment_id": 188,
				"body": "> [gomzik](#comment_20_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): это я понял. А где? :)\n\nhttps://ipfs.pics/QmaPiP9G7cSBBUUNwMvPtyvyYr8rcTMrzb3amw3PxmA2g8 - вот, еще понятнее уже никак :D",
				"added": 1470758012
			},
			{
				"comment_id": 189,
				"body": "> [gomzik](#comment_21_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): в ишью написал, что если не найдет багов, то завтра будет анонс. Написал он это 13 часов назад на текущий момент. Ждем-с.\n\nинтересно, как он назовет в итоге",
				"added": 1470758080
			},
			{
				"comment_id": 190,
				"body": "> [gomzik]\n\nещё: missing file\ndata/users/1B9Ua5UViP8q2ncwgM8SbzvkrkWUqRG4qj/data.json",
				"added": 1470758177
			},
			{
				"comment_id": 192,
				"body": "> [gomzik](#comment_22_1F6BMqittjWUStzUbRXm2kG2GQ3RdBLqFQ): А, ну так не я ж держатель этого форума :)\n\nа кто?",
				"added": 1470843828
			},
			{
				"comment_id": 193,
				"body": "ZeroMe релизнулся !!!",
				"added": 1470901381
			}
		]
	},
	"comment_vote": {}
}