{
	"title": "3x71nc7's Blog",
	"description": "Just another Blog",
	"links": "[Picture Blog Demo](http://127.0.0.1:43110/1PicDemof2Prf9G1QWAaDgyATFQnaqHhKa)\nbitcoin: \n1NGTwnUJ746fTQhJr\npm9v7K6NHcke6j1yw\n![image alt](img/btc.png)\n\nlitecoin:\nLU6WWRKHBs93EtAq\n3aqQEksoZEPujLhetL",
	"next_post_id": 7,
	"demo": false,
	"modified": 1458830514,
	"post": [
		{
			"post_id": 6,
			"title": "Trying out WebP images",
			"date_published": 1457188700.753,
			"body": "After seeing them used on [hashtag_trashbag's](http://127.0.0.1:43110/1HzKesHsWG3N96CfW9eC2aL9VKY7EDm2Zj) Blog i was intrigued by their small file size.\nUnfortunately they don't work natively on Firefox.\nI did a little research and found [webpjs](https://webpjs.appspot.com/), a script that converts webp images so they can be viewed on any browser.\n\nUsing it is really easy: Just include the script in your index.html and it converts all webp images inside <img> tags.\nSadly this means they can't be used on ZeroBlogs, as the html is generated by a script when loading the page.\nSo I just created a page by hand to try them: [PicDemo](http://127.0.0.1:43110/1PicDemof2Prf9G1QWAaDgyATFQnaqHhKa)\nNote that the page will freeze while converting the webp images, because the script is rather slow.\n\nFinal thoughts: Though the small filesize is nice(all images on the page are 1,8M together), the lack of native support and the slow conversion using a script makes webp unpleasant to use. A Blog focused around posting images would be better of just using regular .jpg files.\n\nPS: I might write a program that automatically adds pictures to a Blog similar to the one shown here. \n "
		},
		{
			"post_id": 5,
			"title": "How To: custom ZeroNet addresses using Vanitygen ",
			"date_published": 1456593440,
			"body": "This Guide shows how to get custom ZeroNet addresses like this Site has (\"3x71nc7\" in the address).\n\n---\n#Installation \n\n###**Linux**\nFirst install git and all other dependencies:\n```sudo apt-get install git libssl-dev libpcre3-dev ```\nNow clone the Sourcecode from Github and compile it:\n```\ngit clone https://github.com/samr7/vanitygen.git\ncd vanitygen\nmake\n```\n\n###**Windows**\nDownload the Zip-file from <a href=\"https://github.com/downloads/samr7/vanitygen/vanitygen-0.22-win.zip\">here</a> and extract it.\nThat's all\n#Usage\nOpen up a terminal/command-prompt and cd into the vanitygen directory.\nThen run ```./vanitygen 1YourAddress``` on Linux and ```vanitygen.exe 1YourAddress``` on Windows. \nThe program will then try to find a address containing your specified part.\nNote that all addresses have to start with 1. \n\nOnce vanitygen is done it will output a Address and a Privatekey.\nMake sure to save both.\n\n#Creating a ZeroNet site\nOpen up your file explorer and navigate to ZeroNet's data directory.\nOnce there create a new folder named after the address you got from vanitygen.\nTo keep it simple we are just gonna copy another site for now. So go into the folder of another site and copy everything.\nThen go into the folder of your website and paste all the files in.\nOpen content.json with a text editor and check that no domain it set.\nIf it is, delete it.\n\nShut down ZeroNet if you have it running and run the following command in the main directory of ZeroNet:\n**Linux**\n```python zeronet.py siteSign yourAddress```\n\n**Windows**\nInside the ZeroNet folder execute this command:\n ```..\\Python\\python.exe zeronet.py siteSign yourAddress```\n\n.\nOn both Operating Systems you will be prompted to enter your Privatekey.\nBy entering the Privatekey you \"prove\" that you are the owner of the Site by signing it.\nIf somebody else gets your Privatekey they can then modify you page, so keep it secret.\n\n#Admiring what you did\nStart ZeroNet back up, open your Webbrowser and go to 127.0.0.1:43110/YourSitesAddress. \n\nIf you cloned the ZeroBlog site you can now simply modify your Site using the Webinterface after dragging the 0 in the Top right to the left, scrolling down and switching the \"This is my Site\" switch. After modifying your site you can publish it by pressing the \"Sign & Publish\" button in the lower right.\nYou will be asked for the Privatekey again.\n\nIf you didn't clone the ZeroBlog site you have to manually sign it as explained in **Creating a ZeroNet site**.\n\nIf you notice any mistakes or have any problems, feel free to comment.\n\n\n"
		},
		{
			"post_id": 4,
			"title": "I noticed a mistake",
			"date_published": 1456523312.926,
			"body": "After cloning the ZeroBlog page I didn't look in the content.json where the domain is set. \nSo the link to my page on the Zeronet front-page is actually the .bit address of the ZeroBlog.\n\nI have fixed it now, but to get my site displayed correctly on your front-page you have to delete it and visit it again.\nSorry for the inconvenience"
		},
		{
			"post_id": 3,
			"title": "A shoot 'em up game I made",
			"date_published": 1456519020,
			"body": "It is written in Python 3 using Pygame for rendering.\nThe Code is on <a href=\"https://github.com/TimseineLPs/SmupGame\">Github</a>.\n\nRun this on any Debian-based Linux Distro to install the dependencies:\n```bash\nsudo apt-get install python3 mercurial\nhg clone https://bitbucket.org/pygame/pygame\ncd pygame\nsudo apt-get install python3-dev python3-numpy \\\n libsdl-dev libsdl-image1.2-dev \\\n libsdl-mixer1.2-dev libsdl-ttf2.0-dev \\\n libsmpeg-dev libportmidi-dev \\\n libavformat-dev libswscale-dev libjpeg-dev libfreetype6-dev\n\npython3 setup.py build\nsudo python3 setup.py install\n```\nAfterwards you can delete the pygame Folder.\nNow install git and get the code:\n```bash\nsudo apt-get install git\ngit clone https://github.com/TimseineLPs/SmupGame.git\n```\nNow cd into SmupGame and run\n```python3 main.py```\nto run the game\n\n![image alt](img/smup.png)\n\nYou move your ship with the arrow keys and shoot with the space bar.\n\nAll the sprites are self-made using <a href=\"http://www.piskelapp.com/\">Piskel</a>.\n\n\n"
		},
		{
			"post_id": 2,
			"title": "Hello World!",
			"date_published": 1456512902.767,
			"body": "Welcome to my Blog where I will post stuff."
		}
	]
}