{
	"next_topic_id": 6,
	"topic": [
		{
			"topic_id": 1578145206,
			"title": "Dr. Tony Martin - The Jewish Onslaught",
			"body": "Dr. Tony Martin's seminal work The Jewish Onslaught is crucial in understanding the true role of Jewish People in American Slavery.\n\nhttps://infogalactic.com/info/Tony_Martin_(professor%29\n\nVideo:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w/Dr%20Tony%20MartinThe%20Jewish%20Onslaught.mp4\n\nSame Talk but better quality:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w/Dr.%20Tony%20Martin%201%20-%20The%20Jewish%20Onslaught%20(1993).mp4\n\nAlternative Forum talk by Dr. Tony Martin in November 8 2000:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w/Dr%20Tony%20Martin%20on%20his%20book%20The%20Jewish%20Onslaught360.mp4\n\nDr. Tony Martin - Institute for Historical Review Talk June 2002:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w/Dr.%20Tony%20Martin%20Jewish%20Involvement%20in%20the%20Slave%20Trade%20-%20Institute%20for%20Historical%20Review%20Talk.mp4\n\nThe Jewish Onslaught: Despatches from the Wellesley Battlefront, Dover, MA: The Majority Press, 1993 (ISBN 978-0912469300).\n\nBook:\nhttp://127.0.0.1:43110/1uPLoaDwKzP6MCGoVzw48r4pxawRBdmQc/data/users/19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w/Tony%20Martin%20-%20The%20Jewish%20Onslaught_%20Dispatches%20from%20the%20Wellesley%20Battlefront-The%20Majority%20Press%20(1993).pdf.zip",
			"added": 1578145205
		},
		{
			"topic_id": 1578339291,
			"title": "ThuleanTube",
			"body": "Backup of ThuleanPerspective Videos that were censored on YouTube\n\nhttp://127.0.0.1:43110/19wJBqzsVDCnEVwcRp6Ntj4NMuBBRdCKXy/\n\nHelp seed.",
			"added": 1578339289
		},
		{
			"topic_id": 1578343451,
			"title": "ZeroUp needs a mute or block function",
			"body": "ZeroUp doesn't have a mute or block function it seems. It would be very convenient if it had filtering so we could self-curate posts.",
			"added": 1578343448
		},
		{
			"topic_id": 1578679223,
			"title": "Reaction emojis on posts and comments on ZeroTalk similar to Discord.",
			"body": "https://discordjs.guide/popular-topics/reactions.html#custom-emojis",
			"added": 1578679219
		},
		{
			"topic_id": 1578685610,
			"title": "Best 3D Zeronet Zite so far. Check this out:",
			"body": "http://127.0.0.1:43110/sleepnowinthefire.bit",
			"added": 1578685605
		}
	],
	"topic_vote": {
		"1577743477_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": 1,
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1577903734_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1578145206_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"1578339291_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"1578343451_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"1578439030_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578679223_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"1578831365_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1578969458_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1580358922_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1
	},
	"next_comment_id": 73,
	"comment": {
		"1577903734_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 1,
				"body": "Interesting. Check out Dr Tony Martin.",
				"added": 1578144639
			}
		],
		"1578145206_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 2,
				"body": "> [frosthammer](#comment_24_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): A-Grade content here. Anyone who does not know Dr. Tony Martin should read what he says or watch his many lectures.\n\nI'll upload all his other lectures I can find as well. They'll soon disappear if we don't archive them.",
				"added": 1578148359
			}
		],
		"1578276020_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": [
			{
				"comment_id": 3,
				"body": "> [draugrdeathlord](#comment_229_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): 🖕\n🖕",
				"added": 1578283556
			},
			{
				"comment_id": 4,
				"body": "> [draugrdeathlord](#comment_235_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): 🖕\nmutual respect",
				"added": 1578328783
			}
		],
		"1578339291_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 5,
				"body": "> [frosthammer](#comment_25_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): Seeding this. Please upload his older stuff.\n\nThanks^ I'm uploading as I get time. Want to finish the 2019 videos first.",
				"added": 1578339448
			},
			{
				"comment_id": 18,
				"body": "> [frosthammer](#comment_28_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): If you knew anything about him you'd understand how much against abrahamic faiths and any faith that proselytizes he is.\n\nAtheisttards are cringe. Varg is literally against Abrahamic religions and imperialism in all forms.",
				"added": 1578431181
			},
			{
				"comment_id": 19,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1562_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): ironically I already talked to the guy months ago, but like all religious people, the last thing 'he wants to hear; is reason'.  [...]\n\nAs opposed to the fervent religiosity you're spamming. much atheism religion. Muh biased academic science. Please go to your Richard Dawkins shrine and hang another fedora upon it, neckbeard.",
				"added": 1578431270
			},
			{
				"comment_id": 34,
				"body": "> [draugrdeathlord](#comment_263_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Instead of placing the videos in the zite and mark as optional files you embedded them fom bitchute ?\n\nThey are hosted in the zite. But are tiny. 6MB for a 4min video with 128kbps audio.",
				"added": 1578444439
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 6,
				"body": "Porn is degenerate, but you cannot be censorship free if you ban. It is the entire point of decentralisation. Just block and mute the users that post porn.",
				"added": 1578341665
			},
			{
				"comment_id": 7,
				"body": "> [styromaniac](#comment_1595_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's more like whack-a-mole than a simple solution.\n\nThat's the inherent point of decentralisation.\n\nZeroUp doesn't have a mute or block function it seems.\nOpen a ticket on the git:\nhttps://github.com/HelloZeroNet/ZeroUp/issues\n\nIn the meantime just create a blocklist of the hashes that post porn:\nThe Zerowiki has a section on it:\n\nhttp://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists",
				"added": 1578341990
			},
			{
				"comment_id": 8,
				"body": "> [styromaniac](#comment_1596_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Any sentence that starts with \"Just\" assumes ease instead of difficulty. [...]\n\nJust Clone and make your own ZeroUp where you remove all the porn and whatever you don't like. Decentralisation has no call to authority.",
				"added": 1578342427
			},
			{
				"comment_id": 9,
				"body": "A good way to do this would be a NSFW switch that is off by default. If you don't want to see it, flip the switch. Any post that isn't properly labelled or wrongly labelled or spam gets assigned NSFW parameter automatically.",
				"added": 1578342685
			},
			{
				"comment_id": 10,
				"body": "> [styromaniac](#comment_1597_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): those\n\n\nThat burden is on you. Not on any authority. We are decentralised here. There is no way to make a call to authority. No one is under any obligation to moderate any content. That burden is entirely on you. ",
				"added": 1578342756
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_1599_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): No it's not.\nCuration and moderation is always censorship. If you are not willing to accept that burden then go back to the normal internet where everything is moderated including your free-speech. \n\nI see it as far more acceptable to say what I want without censorship and moderate what I see myself than having that done in a top down method, wiping my opinion with it. Stay rather and help us figure this out in a censorship free way.",
				"added": 1578343261
			},
			{
				"comment_id": 12,
				"body": "> [styromaniac](#comment_1600_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): \"Aww, yeah. I love that hot young pussy\" is not speech of any importance.\n\nI don't want to see that either. But who gets to decide who sees what? I trust no one with moderation but myself. No one should be able to decide what you want to see but yourself.",
				"added": 1578343526
			},
			{
				"comment_id": 13,
				"body": "> [styromaniac](#comment_1602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): By the way, Kopy Kate still has the Christ Church shooting video posted multiple times despite the admin saying that they would delete it for their own legal safety.\n\n\nThat burden is not on them. You're making another call to authority again. Stop trying to tame the Wild West. You cannot have the free if you do not take the wild with it. ",
				"added": 1578343625
			},
			{
				"comment_id": 14,
				"body": "> [filips](#comment_399_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): It would be good to have more levels than just \"NSFW\" and \"OK\". For example, some spammy/shitty content might still need to be labelled as \"not so OK\" content, but it is definitely not so bad as CP or malware. [...]\n\n\nWho is going to sit and moderate everything? I don't want admins deciding what I can see. Self curation/moderation filtering is the only way. We could share these filters with each other, but the option should always lie with us.",
				"added": 1578343888
			},
			{
				"comment_id": 15,
				"body": "> [draugrdeathlord](#comment_241_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Free speech doesn't mean we must allow porn in the middle of town square. [...]\n\nWhile porn in the town square is degenerate, the act of \"allowing or not allowing nudity\" is a centralised authority making that decision. Zeronet is decentralized. The solution to your problem lies with easier to use filtering controls so you can decide at your own disgression.",
				"added": 1578346941
			},
			{
				"comment_id": 17,
				"body": "No rules at all, ever. Decentralization means no moderation or censorship. Even of the things you don't like. If you're not happy with that, go back to reddit where you can do the opposite of what we do here. No one is a mod here. There is no authority. I hope you see only porn until you grow a spine and learn to filter what you look at yourself instead of asking others to do it like a dumb boomer in front of a TV.\n\nFucking jannisaries is what you are.",
				"added": 1578430840
			},
			{
				"comment_id": 28,
				"body": "> [filips](#comment_402_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): And then some new user come to ZeroNet. And what's first thing they see? Spam, porn, shitty \"kill yourself\" and \"fuck niggers\" posts, maybe even some malware or CP. Of course they will then continue using it...\n\nJust like reality. Go to reddit if you want a nice clean and censored forum.",
				"added": 1578437075
			},
			{
				"comment_id": 29,
				"body": "> [quantumkitty](#comment_367_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Not true. If I run out of data space I have to ask NoFish to raise my limit here on ZeroTalk.. it's his zite. I can always start my own, but then I won't have as many people to talk to ... so....\n\nNot true. Nofish wrote the code. The decentralised nature of Zeronet has no authority or moderator. I could clone this zite right now and he would be powerless. The entire point of decentralization is not to have an authority. All authority is corrupted eventually. Why do you want to turn this into the the censored centralized internet?\n\nLook what happened to steemit. Learn that lesson. They censored posts and everyone abandoned the platform. ",
				"added": 1578437306
			},
			{
				"comment_id": 30,
				"body": "> [filips](#comment_403_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Or you can create your own ZeroNet forum where you will allow all those shitty things.\n\n\nOr you could create your own zeronet forum where you can not see those shitty things.",
				"added": 1578437347
			},
			{
				"comment_id": 31,
				"body": "> [filips](#comment_402_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): And then some new user come to ZeroNet. And what's first thing they see? Spam, porn, shitty \"kill yourself\" and \"fuck niggers\" posts, maybe even some malware or CP. Of course they will then continue using it...\n\nJust because people are not allowed to say something, does not mean they don't think it. Just because you prevent people from saying something with rules and censorship does not stop them from thinking it. Reality is messy, dirty and ugly. If you want to clean that up, you have to censor people. Which is what the normal centralised internet has become. If you want to speak your mind you have to take the good with the bad. The minute Zeronet becomes censored, the additional burden of decentralisation becomes irrelevant and we might as well go back to a centralised structure. \n\nie. any censorship or moderation instantly makes Zeronet irrelevant.",
				"added": 1578437841
			},
			{
				"comment_id": 32,
				"body": "> [filips](#comment_404_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): 10\n\n\nMethinks you're just upset that you cannot censor anything here. \n\nhahahaha\n\nhttps://i.kym-cdn.com/photos/images/newsfeed/000/913/758/a12.jpg",
				"added": 1578437897
			},
			{
				"comment_id": 33,
				"body": "> [styromaniac](#comment_1625_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): /*Keep complaining about people taking personal responsibility over their sites*/ [...]\n\n\"They're posting things I don't like, please someone cover my eyes so I can't stop gawking, I cannot possibly do it myself\"",
				"added": 1578438868
			},
			{
				"comment_id": 35,
				"body": "> [styromaniac](#comment_1626_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): We know you love CP, but there's no excuse to be a moron.\n\nGo self copulate yourself, jannisary.\n\nYou're as degenerate as the content of your slander. Why are you projecting your interests onto others?",
				"added": 1578460426
			},
			{
				"comment_id": 36,
				"body": "> [draugrdeathlord](#comment_267_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Is defending CP a hill you want to die on ?\n\nWhy is it that when jannisaries cannot censor they seethe so much.\n\nCope and seethe jannie. You are powerless here. \n\n",
				"added": 1578460573
			},
			{
				"comment_id": 37,
				"body": "> [duck0](#comment_183_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5): lol @ all the astroturf, no, your (((tricks))) do not work here lmfao\n\n\nLook how they ad hominem, when they cannot censor. They have no power here.  I think their palms must be worn through from their vigorous hand rubbing.",
				"added": 1578460939
			},
			{
				"comment_id": 38,
				"body": "> [hferbwauif](#comment_56_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): If the owner kept the code for the site encrypted, the site wouldn't work. I'll point out this is the kind of people who is encouraging censorship on a decentralized platform. [...]\n\n[citation needed]\nwhat are you even talking about. Encrypted site content. If the zite was encrypted you would not be able to view it in the first place, not even talking about copying it. All code is client side on Zeronet. You can clone anything. Even this zite. The only thing encrypted is the ZeroID signed posts. The moment you encrypt a zite, no one will be able to view it. \nIf you can view it, you can clone it.\nWow the astroturf is laid on thick here. Cope and seethe, you can't censor.",
				"added": 1578507337
			},
			{
				"comment_id": 39,
				"body": "> [ranshit](#comment_9_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): After giving a mute to barnstokkr and duck0  for their OT spam, here is my view on the matter. [...]\n\nThere is no authority on Zeronet. Even if you thought censoring anything was a good idea it will not be implemented. Cope and seethe more. Your astroturf is powerless in a decentralised model.",
				"added": 1578507481
			},
			{
				"comment_id": 42,
				"body": "> [ranshit](#comment_14_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): The choice to avoid sex & porn and to keep it off of some sites such as ZeroTalk is not censorship, it's called maintaining the direction of the site owner. Ergo the \n\nLuckily its not up to you. You didn't ban shit. You can't. Still there and uncensored.",
				"added": 1578601057
			},
			{
				"comment_id": 43,
				"body": "To anyone who can't moderate what they see themselves and constantly make calls to authority to moderate for them, here, get yourselves some horse blinkers. Now you can only look in a tunnel ahead of you. Moving your eyeballs is too high a goal for the likes of you. \n\nhttps://upload.wikimedia.org/wikipedia/commons/2/28/Horses_2.jpg\n\nFuck jannies.",
				"added": 1578601330
			},
			{
				"comment_id": 44,
				"body": "> [styromaniac](#comment_1663_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): They certainly don't support mine. They're closet pedos. You can tell in their anger.\n\n\nWhy are you projecting your degenerate interests on others? It goes with neuroticism and hand rubbing. You can't stand that you cannot censor others. Seethe and cope.",
				"added": 1578601511
			},
			{
				"comment_id": 47,
				"body": "> [styromaniac](#comment_1668_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You say I'm pro censorship. And no, I'm not a pedophile.\n\nI know, and neither am I.",
				"added": 1578605639
			},
			{
				"comment_id": 49,
				"body": "LIke I said. An NSFW toggle at the top would sort all this out. And yes I'm going to backpedal and think we should not allow NSFW content on ZeroTalk if it doesn't have an NSFW flag. The poster should know to categorise his post properly, or it ends up with a SPAM flag.\n\nI'm in favour of flagging porn, there should be a dedicated toggle or section for that. As long as we NEVER censor political dissidents in ANY way. Right or Left.\n\nAnd no content should ever be removed, only flagged to a section so if someone wants to really view it, they still can.",
				"added": 1578678685
			},
			{
				"comment_id": 50,
				"body": "We need these on ZeroTalk:\n\n1. Embedded images, audio and video on ZeroTalk? \n\n2. thumbnail images\n\n3. Discord-like unicode reaction emojis to posts. ",
				"added": 1578678728
			}
		],
		"1578343451_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 16,
				"body": "> [nekololi](#comment_422_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): n\n\nI think it does, but it should have the 3 dot menu like here on ZeroTalk where you can mute/block another user. Or better filtering controls.",
				"added": 1578349983
			}
		],
		"1578266325_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 20,
				"body": "Democracy does not exist. If you think that any voter is actually represented by the controlled opposition that is put before them, you're naive. Stop falling for the scam every election. Did you think that the power structure will actually allow you to remove them with a simple voting majority? The West is under occupation. If you want to know who the occupiers are, look at who you're not allowed to criticise. Wake up.",
				"added": 1578431840
			},
			{
				"comment_id": 21,
				"body": "> [fib](#comment_63_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): And then what? I get pummeled by authorities every time I try to do anything unwanted or exercise freedom of any kind, then I must show up to their courts or am pursued for imprisonment and captivity. [...]\n\nCorrect. Every legal course of action will consequent in zero change.",
				"added": 1578432466
			},
			{
				"comment_id": 22,
				"body": "> [fib](#comment_64_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): I'm going to write a letter to Kim Jong-Un to send dank weed.\n\n\nPeople deserve the government they have. If you're not willing to bend the future to your will, do not be surprised when nothing changes if your only effort into the future is a ceremonial X on the voting ballot. You haven't done anything significant to effect change. Insurrection is all that works.",
				"added": 1578432640
			},
			{
				"comment_id": 23,
				"body": "> [draugrdeathlord](#comment_255_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Well this can get pretty controversial fast !! [...]\n\n\nDon't argue or try to convince anyone. Force them. \"emotion for the many and reserve reason for the few\".\n\nThe media needs to be grabbed by the neck and drowned. Don't engage with it on their terms. Crumple the paper tiger up.\n\nThere is no political solution. Accept this. Protests are ceremonial. ",
				"added": 1578432889
			},
			{
				"comment_id": 24,
				"body": "> [draugrdeathlord](#comment_256_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): If the protests are big enough y'all can make change. We only need a small percentage of people to fuck shit up and society falls apart, the sheep will follow the wolf's that force change.\n\nProtests are purely ceremonial and staged by those in power. \nDon't be naive.",
				"added": 1578433175
			},
			{
				"comment_id": 25,
				"body": "> [fib](#comment_65_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): I bend the future to my will and build community, gardens, my tech business, and open source software in preparation for the failure of government.  [...]\n\n\nThis^ \n\nI believe the best way forward is to allow civilisation to collapse. I'm pro- any solution where we end up with more indigenous trees. \n\nPlant trees.",
				"added": 1578433259
			},
			{
				"comment_id": 26,
				"body": "> [draugrdeathlord](#comment_257_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Why ? Because in the modern age the establishment injects bad actors to subvert the movement from within ? Or is it because they have modern weapons that can put down a revolution in under an hour ? [...]\n\n\nOppressive governments were always more powerful than the insurrectionists. They were always better equipped. You have better resources now than all your ancestors combined. Better access to information than all of them ever had. Resources and equipment is irrelevant if you don't know how to use it. \n\nThe best course of action is to stop being a consumer and to buy everything used. Have a large family who look just like you. Become self reliant. Barter everything you cannot buy used. Make the rest yourself. Learn skills and how to make things yourself. Plant trees and make a permaculture forest. Stop giving them tax.",
				"added": 1578433655
			},
			{
				"comment_id": 27,
				"body": "> [draugrdeathlord](#comment_261_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Agenda 21 is taking care of everything you just said. So you will fail, regional areas are been rendered incapable of supporting agriculture and the water is been corporatised. [...]\n\nSadly true, yes, but there is still a way we could live outside of cities. Cities are cesspits of empire. And empire is the scourge of humanity.",
				"added": 1578436939
			}
		],
		"1578492498_13m1obyzHx5Ai7zvpJtCBvy81LGHLBrtKZ": [
			{
				"comment_id": 40,
				"body": "Your parents are ashamed of you",
				"added": 1578508229
			},
			{
				"comment_id": 41,
				"body": "\"killfascists\" lol I'd be surprised if you could muster the guts to kill anything. you posted cringe bro. upgrading Richard Dawkins for an Antifa membership won't make your fedora collection go any better with your neckbeard.",
				"added": 1578508542
			}
		],
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 45,
				"body": "> [muhwaycism](#comment_51_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): They're dissenting against the filthy goy commoners that dare question their R0thschild kikel overlords, that's what. How dare you filthy goyim try to run your own countries? Also, advice for bluepills and those who are new: the \"alt-right\" is a shill movement to try to get out in front of an organic reaction. It's an old technique of the juden. \"The best way to control the opposition is to lead it,\" as they say. As for the censorship, \"fortunes, like mushrooms, grow best in the dark.\" [...]\n\nWell said",
				"added": 1578601825
			}
		],
		"1578272360_1G6SeTLb1v6LQfgg7ee4VuGQ61wkNVqdzz": [
			{
				"comment_id": 46,
				"body": "Miss Varg.",
				"added": 1578601993
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 48,
				"body": "Decentralization does not respect calls to authority.",
				"added": 1578606589
			},
			{
				"comment_id": 59,
				"body": "Lol You can't ban people on a decentralized network. h3bhkj5gqz4n3pjm might be irritating as fuck. But you cannot ban him.",
				"added": 1578786897
			}
		],
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 51,
				"body": "Expecting women to work is the greatest destroyer of the nuclear family. That and that the state prefers women to be single mothers. \n\nA wife should be nurturing, not have the ability to support you. Putting food on the table is your job. This is a biological reality. Breaking from this ancient biological routine will leave you empty.\n\nHowever I fully realise how the corrupt legal system is and it essentially begs women to take everything from you if you provide for them. You need to be careful. Never discuss finances with your wife. Never put everything in a property that she can legally take in a divorce. Never keep everything in one place. When you buy a house, put it in your parent's name so she can't take it, and don't tell her. Pretend like you are renting it from your parents. It will allow you to save as well. Stash money away. Bitcoin. Never divulge your true finances. There should be nothing to take.\n\nMy best tip would be to find a wife who is nurturing. Avoid the \"intellectual girls\". In reality they are stupid and they will never be men. Stop trying to make women into men. Women who are nurturing are the epitome of a mate. Look for how she is towards animals and kids. A honourable nurturing woman is an asset worth more than all the money in the world. \n\nStart with someone who is quality. Are her parents still together? Does she want kids? Does she love being nurturing? Does she have no mental hangups and able to raise your kids? \n\nThink about how it will be when you are old one day. You need a legacy. Children are an extension of yourself. It is the most important thing you can do. Metaphysical immortality.\n\nI would suggest moving out of the city and into nature. Become self sufficient and entirely reduce your utility bills if you can. It won't be easy but learning skills are the real assets you have in life. None of that shit in the city at an office job is real. They are made up and fake. Rural areas are essentially empty now and just full of old people as everyone is moving to the cities. Depending on where you are, you can buy half an acre of land for less than a new flagship phone. Cities are cesspools and if you live in a cesspool you will become a part of it. It is only going to become even more expensive. \n\nEven if it is old agricultural land, plant some fast growing trees and turn it into a permaculture forest. Avoid the monoculture way. \n\nhttps://en.wikipedia.org/wiki/Permaculture\n\nUse the earth's static temperature 2 meters down to thermoregulate your home. It is the best insulation you can find. Heating/Cooling bills are wasteful and a result of working against nature. Build your house into the ground and fill it over with a thick layer of soil. And drain it properly. Two shipping containers placed side by side in a mound is better than any HVAC system. Warm in winter and cool in summer. \n\nThere are so many things you don't really need. And to be honest you will be happier without them. Don't let your things rule you. You don't need half of the shit you're paying for. They're not worth the grind it takes to keep buying that shit.\n\nWhile we are on this point I will also add that you should always try to buy everything used as to not generate extra taxes that will be used against you. Always pay in cash and in person. Try keep the paperwork to a minimum and anonymous. Some things are obviously not possible, but many things are just as good used as new, for eg. tools, vehicles and electronics. Always keep an eye out for good items used. Haggle on the price and learn to recognise what items are worth. Avoid retail shops like the plague. Support the small guy in cash. A high quality used item is worth far more than a new low end item. Usually high end items also have all the parts available so you can cheaply replace cosmetic parts to make it look new. \n\nFor eg. A used high end Hilti Cordless Drill vs a new cheap Ryobi. \nA used high end Dell Latitude vs a new cheap laptop. \n\n\nThe long term savings you could gather instead of wasting it on utilities and other pointless possessions in a city is essentially years off of your life. Rather spend it on building skills for eg. Welding, Carpentry, Machining, Plumbing, Irrigation, Livestock Husbandry, HVAC, Electrician, Electronic and Mechanical Repair. These are jobs that actually matter and people will pay you anywhere you are to do them, or even barter you food. You can teach yourself how to do these by practising. YouTube can teach you how to do anything. There are millions of books and research papers available on any subject. Be an autodidact. Teach yourself. Don't fall for the suburban trap. It is soul crushing. \nThese skills will save your life one day when civilisation falls. Read here about why you need to get out of the cities:\n\nAnti Tech Revolution Why And How by Ted Kaczynski\n\nhttps://archive.org/details/KaczynskiAntiTechRevolutionWhyAndHow_201803\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w_item_2+type:book\n\nGood luck.",
				"added": 1578687467
			},
			{
				"comment_id": 54,
				"body": "> [mg0](#comment_215_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Concealing money that aggressively is sound if you plan to divorce a lot, like famous actors for which marriage seems to be nothing but a show. Putting some wealth off your direct access (in a cousin's account) is truly a wise decision but not because it stops wife from taking it through divorce, but if you take bad decisions or sign fishy contracts then you could at least have something left to start anew when broke. Legal system does just too much for women in a separation, and I think that's because of the conventional nuclear family of worker male and housewife female so women get some wealth until they get a way to make it on their own (they normally get children custody as well). But if you are going to doubt so much of your wife, why are you marrying in the first place?\n\nI agree. None of us are good judges of character. Especially when young we have no idea how to read people's intentions. It will only come with age. And a lot of the time we realise what we actually want later in life. Some people are really good at hiding their flaws and the true personality only comes out later. It is always good to be prepared. Have a contingency plan in place. You never know what could happen. It could save you from the banks taking everything from you if the market crashes and we head into a depression and all your clients or business dries up or you get fired. Or you become disabled. Be prepared in such a way that if the debt collectors come calling you are not worth that much on paper. If you are smart with your finances like this, then in the end you have more money in retirement. If she turns out to be a good person you will have lost nothing. Only gained the peace of mind knowing you are prepared. It is generally a good practice to never keep your eggs in one basket of ever show your hand entirely.",
				"added": 1578706852
			}
		],
		"1578522999_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 52,
				"body": "Do you really want it to be automated?",
				"added": 1578690748
			}
		],
		"1578686431_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 53,
				"body": "Stop supporting FIAT accepting institutions. Credit cards are retarded and the worst payment method.",
				"added": 1578699099
			}
		],
		"1578705469_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 55,
				"body": "> [mg0](#comment_217_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): Point of Sales are key pieces of software for almost any selling commerce from tiny grocery stores to walmart like warehouses. ; )  ; )\n\n🤔",
				"added": 1578709180
			}
		],
		"1578685610_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 56,
				"body": "> [fractalzoomer@kxoid.bit](#comment_5_1GhYmYygr9AwgLDix4ge5AAQiMa4voJGuC): This site makes requests to the clearnet to cdnjs.cloudflare.com, maxcdn.bootstrapcdn.com, and use.typekit.net. [...]\n\nit would be better to have them local that way I agree.\nyes you can, just find the scripts, fonts and resources and map the location to local zite folder. \n\nthink there's only like 3 scripts for the UI, fonts, and then bootstrap:\n\n<script src=\"https://use.typekit.net/jrj6out.js\"></script>\n\n<link rel=\"stylesheet prefetch\" href=\"https://maxcdn.bootstrapcdn.com/font-awesome/4.6.3/css/font-awesome.min.css\">\n\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/jquery/3.1.0/jquery.min.js\"></script>\n\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/gsap/1.19.0/TweenMax.min.js\"></script>\n\n<script src=\"https://cdnjs.cloudflare.com/ajax/libs/three.js/r78/three.min.js\"></script>\n\nWas only because I was lazy not anything malicious. \nThey're standard packages. \nThose typeset fonts are also unnecessary. Just use open source fonts. \nCalling out to clearnet is unnecessary and it should be kept local on a zite. \n\nWill see what I can do when I have time. ",
				"added": 1578709314
			}
		],
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 57,
				"body": "There is only one organizational system that works. The indigenous organisation of ethnic blood. If we do not have Philia, no system will work. UBI would be a dream come true if we had Philia. \n\nIn 300BC, Aristotle said it best:\n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w_item_3+type:image",
				"added": 1578786450
			},
			{
				"comment_id": 61,
				"body": "> [bigbadbob](#comment_867_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): where I am... Running off into the wild and building a cabin is illegal:(\n\nthen move. no one is holding you back.",
				"added": 1578809232
			},
			{
				"comment_id": 62,
				"body": "> [thorburn](#comment_26_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Communism doesn't work!\n\n\nCapitalism/Communism are both globohomo ops that kill ethnic cohesion and the ability of a people to determine their own future, themselves. It also wrecks nature. You're under occupation, wake up.",
				"added": 1578809372
			},
			{
				"comment_id": 63,
				"body": "> [driud](#comment_24_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Po angielsku nie da się tego wytłumaczyć.Trzeba być, Słowianinem.Wtedy wszystko jest proste, albo staje się proste.Wystarczy troszkę wiedzy na ten temat.Jak zamieszkać w lesie? [...]\n\nPlant it and make your own out of cheap ruined agricultural land.",
				"added": 1578809582
			},
			{
				"comment_id": 64,
				"body": "> [bigbadbob](#comment_870_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): If only that were true.  I'm stuck in a tar pit for now.  Where on earth could a person claim land and build a cabin without  hassles?\n\nif you need help with that, perhaps you don't deserve a piece of land? There are many pieces of land for less than a flagship phone if you bothered to look.",
				"added": 1578965628
			}
		],
		"1578779457_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 58,
				"body": "Metaphysical reincarnation carries the accumulated resources of your ancestors. It is the reason why having children is the most important thing any human can achieve. A legacy. \n\nTo quote stanza 75 of the Havamal:\n\"Cattle die, and kinsmen die, thyself too soon must die, but one thing never, I ween , will die; fair fame of one who has earned.\"\n\nThose who willingly give up their lineage only make it easier for mine. Even if you forfeit, you are still playing the game.",
				"added": 1578786773
			}
		],
		"1578738929_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 60,
				"body": "Agriculture and its products only make weak men. Meat and dairy are the food of gods.",
				"added": 1578786998
			}
		],
		"1578969458_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 65,
				"body": "Good luck. Hope it goes really well.",
				"added": 1579055420
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 66,
				"body": "> [styromaniac](#comment_1712_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've lost the most money to a white guy. I guess I should be racist against white people.\n\nok retard. now go into the hood and put your retardation to the test and see who robs you. \nprejudice is a heuristic. pretending otherwise is refusing to learn from experience.",
				"added": 1579055563
			},
			{
				"comment_id": 67,
				"body": "> [thranduil](#comment_1_1aM8yaYxud13xs1AgNiHT25aEBCotLVrT): Don't be a racist fuck. Every race has thieves\n\n\n13 do 50, retard",
				"added": 1579055605
			},
			{
				"comment_id": 68,
				"body": "> [upqxhzppexdl2d9t](#comment_30_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w): That's awesome. I love when racist faggots get robbed by the people they think they are superior too.\n\nok retard\nwhy is racism wrong?",
				"added": 1579055656
			},
			{
				"comment_id": 69,
				"body": "> [styromaniac](#comment_1714_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Racism goes both ways. You might get racist friends, but also fewer friends being like that.\n\n\"ooh racism is unpopular\". \"racism is wrong\"\nWhy?\nhow does it feel when you agree with the power structure on worldview.\ndoes this mean:\na. you're such a good person\nb. you're a retard that goes along with everything you are told. \n\nWhy is racism wrong?",
				"added": 1579055869
			}
		],
		"1578995205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 70,
				"body": "Don't get discouraged. The real reason why people will buy through you is advice, service and knowledge. Most people are not interested in buying stuff from AliExpress and dealing with customs import and tracking packages from China etc. Keep going.",
				"added": 1579063368
			},
			{
				"comment_id": 71,
				"body": "> [aassddff](#comment_4_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): In some ways, yeah. Humans in regions with plenty of resources (such as the natives in my country, Brazil) might have not \"\"evolved into a civilization\"\" (I dislike how this term is usually used, but anyway) at the same rate as Europeans did not because Euros are superior, but because having plenty of the base resources (food and water, mainly) means you don't need as much technology to have a decent life. [...]\n\nCivilisation and agriculture is a disease. There is only a future for us if we focus on reforesting the planet and severely reducing populations worldwide, outside the west specifically. \n\nhttp://127.0.0.1:43110/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:item+id:15f1_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w_item_2+type:book",
				"added": 1579063591
			},
			{
				"comment_id": 72,
				"body": "> [ranshit](#comment_40_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): Where I live, Amazon employees are given $12 an hour to fold boxes as automation takes care of the rest.Of course they will get fired & rotated before the three month mark before federal benefits requirements kick in.\n\n\nfuck amazon",
				"added": 1579063632
			}
		]
	},
	"comment_vote": {
		"24_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"2_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"229_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"25_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"5_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"26_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1617_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"53_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": 1,
		"27_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"28_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1_1EkArqAKrAVpqX8Yv1v733LkQs3JYx46zP": 1,
		"32_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": 1,
		"29_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"312_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"183_17bfQv5PQW9FZ4akChr7ECfqP2SKuAXwM5": 1,
		"1575_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"12_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1,
		"405_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"51_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU": 1,
		"13_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"1_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": 1,
		"367_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"25_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG": 1,
		"215_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"1674_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"152_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"397_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"398_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"24_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"27_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"26_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1
	}
}