{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "UNIVESP",
			"body": "# O canal para quem quer saber mais e aprender sempre! A Univesp TV  é uma das ferramentas de tecnologia de informação e comunicação da Universidade Virtual do Estado de São Paulo (Univesp), e visa a formação integral do cidadão. \n\n- https://www.youtube.com/channel/UCBL2tfrwhEhX52Dze_aO3zA",
			"added": 1529630971
		}
	],
	"topic_vote": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": 1,
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"1_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"1_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1
	},
	"next_comment_id": 23,
	"comment": {
		"1_143rJdjVFSDvLjUqr2Fp22h1ve8M8H6ipT": [
			{
				"comment_id": 1,
				"body": "#Conjectura de Collatz\nEsta conjectura aplica-se a qualquer número natural não nulo, e diz-nos para, se este número for par, o dividir por 2 (/2), e se for impar, para multiplicar por 3 e adicionar 1 (*3+1). Desta forma, por exemplo, se a sequência iniciar com o número 5 ter-se-á: 5; 16; 8; 4; 2; 1. A conjectura apresenta uma regra dizendo que, qualquer número natural não nulo, quando aplicado a esta regra, eventualmente sempre chegará a 4, que se converte em 2 e termina em 1. Essa sequência em questão também pode ser chamada de Números de Granizo ou Números Maravilhosos. A explicação destes últimos nomes está em \"como o granizo nas nuvens antes de cair, os números saltam de um lugar ao outro antes de chegar ao 4, 2, 1\".\n\n- https://web.archive.org/web/20180621200250/https://preprint.math.uni-hamburg.de/public/papers/hbam/hbam2011-09.pdf",
				"added": 1529611430
			},
			{
				"comment_id": 2,
				"body": "#Conjectura Oesterlé–Masser ou conjectura abc\n- https://web.archive.org/web/20160303200337/http://klein.sbm.org.br/wp-content/uploads/2013/04/A-Conjectura-abc-1.pdf",
				"added": 1529611485
			},
			{
				"comment_id": 3,
				"body": "#Número primo de Sophie Germain\nUm número primo p é um número primo de Sophie Germain se 2p + 1 é também primo. São famosos porque Sophie Germain provou que o Último Teorema de Fermat é verdadeiro para estes números. A existência de um número infinito de tais números primos é uma conjectura, ou seja, uma afirmação não provada.\n- https://web.archive.org/web/20180621200756/https://impa.br/wp-content/uploads/2017/07/31CBM-P_FSBento.pdf",
				"added": 1529611731
			},
			{
				"comment_id": 4,
				"body": "#Números primos gêmeos\nSão pares de números primos ímpares consecutivos, ou seja, cuja diferença é igual a 2.\n- https://web.archive.org/web/20180621201238/https://www.ime.unicamp.br/~ftorres/ENSINO/MONOGRAFIAS/Isabela_TN17M1.pdf",
				"added": 1529611988
			},
			{
				"comment_id": 5,
				"body": "#\"É impossível para um cubo ser escrito como a soma de dois cubos ou uma quarta potência ser escrita como a soma de duas quartas potências ou, em geral, para qualquer número que é uma potência maior do que a segunda, ser escrito como a soma de duas potências com o mesmo expoente”.\n- Pierre de Fermat",
				"added": 1529612093
			},
			{
				"comment_id": 6,
				"body": "#Espiral de Ulam\nÀ primeira vista, números primos (aqueles que só podem ser divididos por 1 e por eles mesmos) são distribuídos sem qualquer ordem entre os números inteiros. Contudo, em 1963, enquanto rabiscava em seu caderno (!), o matemático Stanislaw Ulam percebeu que, se números inteiros forem organizados em uma espiral, números primos sempre caem em linhas diagonais. Esse padrão não é em si tão surpreendente (todos os números primos com exceção do 2 são ímpares, e as espirais se alternam entre pares e ímpares), mas um detalhe gera curiosidade: eles tendem a se agrupar mais em determinadas diagonais do que em outras, independentemente do número que você coloque no começo da espiral – há teorias que procuram explicar o fato, mas nenhuma foi confirmada ainda.\n\n- https://web.archive.org/web/20180621195404if_/https://hypescience.com/wp-content/uploads/2013/01/415.jpg",
				"added": 1529612195
			},
			{
				"comment_id": 7,
				"body": "#Os números racionais são infinitos, mas contáveis ou enumeráveis\n\n# Os números racionais são números que podem ser expressos como frações, por exemplo, 1/2, -7/5, 22/23, 2/1, e assim por diante. Qualquer número que não possa ser representado por uma fração de dois números inteiros é considerado irracional, como “pi” e “e”.\n\n# Um conjunto contável ou enumerável é um conjunto de números que a gente pode contar quantos elementos tem, mesmo que sejam infinitos. Outra maneira de dizer isto é que você pode colocar todos os elementos do conjunto em sequência: se você faz isto, já está “enumerando” o conjunto – um elemento será o primeiro, o seguinte será o segundo, e assim por diante. Os números primos, por exemplo, podem ser colocados em sequência e são, portanto, enumeráveis.\n\n# O conjunto dos números racionais é um conjunto deste tipo, e a prova disso foi feita pelo matemático russo Georg Cantor (1845-1918). Isto é contra-intuitivo: pense em quantas frações você pode escrever que tenham valor absoluto entre 0 e 1. Se você pensou correto, deve ter dito “infinitas frações”. Mas dá para “contar” ou colocar em sequência todos os infinitos números racionais que existem? É esta a afirmação de Georg Cantor, e ele provou isto matematicamente.\n\n# O que Cantor fez foi usar um conjunto que é infinito, mas enumerável, o conjunto dos números naturais (todos os números inteiros maiores ou iguais a zero ou, em linguagem matemática, N = {0, 1, 2, 3, …}). Ele demonstrou que qualquer conjunto que pode ser relacionado diretamente ao conjunto dos naturais é, também, um conjunto enumerável, como aquele é. Em linguagem um pouco mais precisa, ele mostrou que dá para criar uma função bijetora que relacione os números racionais e os números naturais, e, assim, os racionais são enumeráveis.\n\n# Uma das maneiras de provar isso é criar uma tabelinha de numeradores e denominadores:\n\n- 1/1 1/2 1/3 1/4 …\n- 2/1 2/2 2/3 2/4 …\n- 3/1 3/2 3/3 3/4 …\n- 4/1 4/2 4/3 4/4 …\n\n# Em seguida, comece a anotar os números segundo diagonais, eliminando os que podem ser simplificados para outra fração que já foi contada (2/2, 3/3, 4/4 e outros iguais pode ser simplificados para 1/1, por exemplo). O resultado é uma série de frações em ordem, ou seja, enumerável:\n\n- 1/1, 2/1, 1/2, 3/1, 1/3, 4/1, 3/2, 2/3, 1/4…",
				"added": 1529613189
			},
			{
				"comment_id": 8,
				"body": "# Conjectura de Poincaré\n- https://web.archive.org/web/20180621190644/http://w3.impa.br/~viana/out/cpcg.pdf",
				"added": 1529613320
			},
			{
				"comment_id": 9,
				"body": "#Conjectura dos primos gêmeos\n-  A conjectura dos números primos gêmeos afirma que existem infinitos números primos gêmeos, mas até hoje tal afirmação ainda não foi provada. Matemáticos acreditam que esta conjectura é verdadeira, baseado apenas nas evidências numéricas e raciocínios heurísticos envolvendo a distribuição probabilística dos números primos.",
				"added": 1529614872
			},
			{
				"comment_id": 10,
				"body": "#Postulado de Bertrand\n- O postulado de Bertrand, também conhecido como teorema de Tchebychev, por ter sido demonstrado por Pafnuti Tchebychev, diz que, se n > 3 é um número natural, então existe pelo menos um número primo p tal que n < p < 2n-2,que pode ser escrito elegantemente por n < p< 2n.",
				"added": 1529615805
			},
			{
				"comment_id": 11,
				"body": "#A indecidibilidade do problema generalizado de Collatz\n- https://web.archive.org/web/20180621213857/https://ipfs.io/ipfs/QmTETnKWeg22ig3GdKJx4aZ7NL2w5hiPwyj6BhgAC3CDbt",
				"added": 1529617184
			},
			{
				"comment_id": 13,
				"body": "#Problemas Decidíveis e Problemas indecidíveis\n- https://web.archive.org/web/20180621214633/http://www.ufrgs.br/alanturingbrasil2012/presentation-RuyQueiroz-ptBR.pdf",
				"added": 1529617731
			},
			{
				"comment_id": 15,
				"body": "#Um Mínimo Sobre A Função Zeta de Riemann\n- https://web.archive.org/web/20180622011025/http://denebola.if.usp.br/~jbarata/Notas_de_aula/arquivos/nc-cap08.pdf",
				"added": 1529629927
			},
			{
				"comment_id": 18,
				"body": "#Geradores de números pseudoaleatórios | Ciência da Computação | Khan Academy\n- https://youtu.be/f4sE1r3UL4E",
				"added": 1529631629
			},
			{
				"comment_id": 19,
				"body": "#Teoria dos números\n- https://www.youtube.com/playlist?list=PLxI8Can9yAHcfxDjfTmU-t7XC1w2GVwc_",
				"added": 1529631998
			},
			{
				"comment_id": 20,
				"body": "#A Teoria Algorítmica da Aleatoriedade\n- https://web.archive.org/web/20180622015139/http://www.uff.br/cdme/arquivos/volchan-2002.pdf\n\n#Introdução aos Números Pseudo-aleatórios\n- https://web.archive.org/web/20180622015335/http://www.inf.pucrs.br/~smusse/Simulacao/PDFs/GeradorAleatorios.pdf",
				"added": 1529632525
			},
			{
				"comment_id": 21,
				"body": "#Enovelamento de proteínas\n- https://web.archive.org/web/20180622022816/http://leandro.iqm.unicamp.br/leandro/shtml/folding_slides.pdf",
				"added": 1529634652
			}
		],
		"2_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 12,
				"body": "#Uma lei da física além dos poderes da Matemática\nO trabalho mostra que é matematicamente impossível sair dos componentes básicos da matéria e derivar seu comportamento macroscópico.\n- https://arxiv.org/abs/1502.04573",
				"added": 1529617453
			},
			{
				"comment_id": 14,
				"body": "#Problemas em aberto da física\n\n- Porque é que a massa prevista do vácuo quântico têm pouco efeito sobre a expansão do universo?\n\n- Podem mecânica quântica e relatividade geral serem realizadas como uma teoria quântica de campos totalmente coerente? O espaço-tempo é fundamentalmente contínuo ou discreto? Seria uma teoria consistente envolver uma força mediada por um gráviton hipotético, ou será um produto de uma estrutura discreta do espaço-tempo em si (como na gravidade quântica em loop)? Há desvios em relação às previsões da relatividade geral em escalas muito pequenas ou muito grandes ou em outras circunstâncias extremas que fluem para uma teoria da gravitação quântica?\n\n- Os buracos negros produzem radiação térmica, como esperado em termos teóricos? Será que esta radiação contem informações sobre sua estrutura interna, tal como sugerido pela dualidade Gauge-gravidade, ou não, como implícito no cálculo original de Hawking? Se não, e os buracos negros podem evaporar, o que acontece com as informações armazenadas neles (mecânica quântica não proporciona a destruição da informação)? Ou será que a radiação para em algum ponto de deixar vestígios do buraco negro? Existe outra maneira de sondar a sua estrutura interna, de algum modo, se tal estrutura existe mesmo?\n\n- A natureza tem mais de quatro dimensões de espaço-tempo? Se sim, qual o seu tamanho? As dimensões são propriedade fundamental do universo ou um resultado emergente de outras leis da física? Podemos experimentalmente \"ver\" sinais de maiores dimensões espaciais?\n\n- A teoria da inflação cósmica está correta, e em caso afirmativo, quais são os detalhes desta época? Qual é o campo hipotético do inflaton que causa esta inflação? Qual é o campo inflator hipotético que deu origem à inflação? Se a inflação ocorreu em um ponto, é auto-sustentável através da inflação de flutuações da mecânica quântica e, portanto, cursou até algum lugar incrivelmente distante?\n\n- O que é a matéria escura? Do que ela é constituída?\n\n- Há razões físicas para esperar outros universos, que são fundamentalmente não observáveis? Por exemplo: existem \"histórias alternativas\" na mecânica quântica ou \"muitos mundos\"? Há \"outros\" universos com leis físicas resultantes de formas alternativas de quebrar a simetria aparente das forças físicas em altas energias, possivelmente longe demais devido à inflação cósmica? É justificada a utilização do princípio antrópico global para resolver dilemas cosmológicos?\n\n- Porque a gravidade é uma força tão fraca? Ela se torna forte para partículas apenas na escala de Planck, em torno de 10^19 Gev, muito acima da escala eletrofraca (100Gev, a escala de energia dominante na física de baixas energias). Por que estas escalas são tão diferentes de um para o outro? O que impede que as quantidades em escala eletrofraca, como a massa do bóson de Higgs, de obterem correções quânticas da ordem da escala de Planck? A solução seria supersimetria, dimensões extras, ou apenas sintonia fina antrópica?",
				"added": 1529618292
			},
			{
				"comment_id": 16,
				"body": "#Curso de Física-Matemática\n- https://web.archive.org/web/20180622011432/http://denebola.if.usp.br/~jbarata/Notas_de_aula/capitulos.html",
				"added": 1529630147
			},
			{
				"comment_id": 17,
				"body": "#Ruído térmico\n- https://web.archive.org/web/20180622013301/https://www.physics.utoronto.ca/~phy224_324/experiments/thermal-noise/Thermal-Noise.pdf",
				"added": 1529631239
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 22,
				"body": "#Mil poderão cair ao seu lado, dez mil à sua direita, mas nada o atingirá. \n- Salmos 91:7",
				"added": 1529634807
			}
		]
	},
	"comment_vote": {
		"1_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"4_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"5_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"10_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"11_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"14_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"5_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"8_1P7XWfLKfZiM8ob59bB1GvCYeXujKdWKSk": 1,
		"15_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"17_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1,
		"22_1PS1WacNKavuUoPkJa7vMqMKzcsqn4Atjc": 1
	}
}