{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Vine amargado el otro día y he escrito esto sobre la situación en España",
			"body": "Nos encontramos en un momento de la historia en el que las líneas entre el bien y el mal por fin se han podido definir en los casos más graves. Sin embargo como ocurrió en las grandes sociedades e imperios de la antigüedad hemos caído en la variedad de grises que no son tan evidentes.\n\nGracias a ellos el poder sigue repartiéndose entre aquellos sedientos del mismo, mientras que la clase media está desapareciendo en un silencio total. Los partidos políticos comprados por aquellos que deberían enriquecer a esta clase están dejando que se extinga.\n\nVosotros estáis perdiendo poder. Es una realidad de la que vengo a advertiros pues os aseguro que en lo que queda de siglo y si la automatización sigue su camino a la velocidad actual el poco poder que os queda va a desaparecer. No entendéis el funcionamiento de los mercados, y no os equivoqueis, el dinero es el poder.\n\nLa forma de operar del sistema actual consigue pasar desapercibida y apartar de cualquier tipo de lucha a los que son inteligentes, aptos y curiosos premiandolos con dinero. Pero no demasiado, ya que podrían en ese caso entrar en el juego de poder.\n\nPrimando convertir en marionetas controladas a todos aquellos que no gestionan la riqueza o el poder.\n\nY esto es fácil de comprobar, fijaos en las personas que os rodean. Aquellos que realmente tienen dinero trabajan directa o indirectamente para estas empresas, grandes corporaciones o personas con dinero que sin que os deis cuenta os venden la idea de que los problemas son vuestros:\n\nLa contaminación existe porque vosotros contamináis.\nLa economía va mal porque os endeudais.\nHay corrupción porque “¿Quien no lo haría?”\n\nEn resumen os echais la culpa y genera malestar en la sociedad. Y no os equivoqueis, este malestar si es real. Y está siendo manejado indiscriminadamente por estos actores sedientos de poder.\n\nPor eso desde hace tiempo da igual a qué partido político votéis en España. Probablemente todos ellos tendrán detrás alguno de estos actores con su propia agenda oculta.\n\nDesde hace tiempo los problemas reales de España están siendo ignorados deliberadamente creando polarización entre los ciudadanos a favor de estos actores de poder.\n\nEl paro.\nLas pensiones.\nEl exceso de burocracia.\nLa enorme carga fiscal para ser autónomos o crear empresas.\nLa descentralización administrativa que hay en el país.\nLa carencia de recursos en el mundo judicial.\nEtc…",
			"added": 1572716260
		},
		{
			"topic_id": 2,
			"title": "Únete a Artemis",
			"body": "¿Cansado de la vida? ¿Quieres participar en algo superior y dar forma a tu mundo? Únete a Artemis, la única sociedad de gente habilidosa que defenderá tus intereses y los de todos sus miembros. Nunca dejamos a nadie atrás y nos ayudamos entre todos.\n\nhttp://127.0.0.1:43110/17FGkPsZcCXWgNNrjKYNf9C75onx2w2rB5/",
			"added": 1577635673
		}
	],
	"topic_vote": {
		"2_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": 1,
		"2_1PAQSnwf9cZr1qTjjVq2g35ZH2B6HijFbZ": 1
	},
	"next_comment_id": 14,
	"comment": {
		"1_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 1,
				"body": "Lo he probado y no va mal.",
				"added": 1572716443
			}
		],
		"2_1HrQ48VceWqeGu9qmC2Y8VxUsGNSJwbNiV": [
			{
				"comment_id": 2,
				"body": "Esta muy bien, pero me da la sensación de que hace falta algo para organizarse, como una página con comentarios o movidas similares.",
				"added": 1572717087
			}
		],
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 3,
				"body": "> [selfsigned](#comment_20_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ): Para un resumen no está mal.Creo que te centras demasiado en el problema y poco en lo que puedes hacer tú por cambiarlo. \n\nComo dije, vine amargado y solté eso. Hoy ya menos amargado... si que creo que hay maneras de solucionarlo. Y la primera es que la gente que consideramos inteligente (Que sea capaz de ver el problema en su totalidad) empecemos a unirnos y a formar sociedades para controlar a los borregos. Y tambien atacar a los medios de comunicación usando su propia medicina.\n\nEn ese ámbito hay bastantes youtubers que ahora se estan empezando a hacer famosos que luchan día a día contra el falserío de mucha gente de \"bien\" que intenta imponer sus ideas (social justice warriors y demás fauna).\n\nSin duda uno de los frentes es ese. Y podríamos decir que empezamos a plantar batalla.\n\nEn otro de los frentes, que es el tema económico y como bien explicas tu de gente que ni siquiera es capaz de pensar cuando no llega ni a fin de mes. Creo que la batalla se ha perdido. Es mas que evidente, y ahí compañero no soy capaz de vislumbrar ninguna salida a corto plazo. El individualismo fomentado por la sociedad y el desconocimiento de la gente en temas económicos son bestiales. ¿Te puedes creer que mucha gente no sabe ni qué es la inflación y como cada año pierden de media un 2% de su dinero ahorrado? Ni tampoco saben como pueden hacer para no perder esedinero usando el propio sistema... (Y todo esto sin entrar en temas de impuestos de un estado que lo único que hace es sangrar a la clase media).\n\nPorque la clase baja está jodida y tienen ayudas, pero la clase media está totalmente desprotegida. Y los ricos cada vez se hacen mas ricos y las ventajas fiscales están para ellos, no para los pobres ni para la clase media (Tampoco es culpa de ellos, es que han comprendido bien el sistema y se aprovechan de el).\n\nLa verdad es que todo este asunto bien merecería una página en zeronet. Para empezar a luchar contra el mal que vemos todos los días, para iluminar a la gente y que salgan de las tinieblas.\n\nMe pasaré por este post de vez en cuando. Si queréis seguir la conversación sin problema...",
				"added": 1577568395
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 4,
				"body": "Yo creo que hay cosas que debes estar haciendo mal. La verdad es que en lugar de despotricar podrías preguntarnos algo específico y veremos si podemos ayudarte. Eso si, con paciencia que al menos yo no me meto aquí todos los días y supongo que los demás tampoco. Pero cada X tiempo me meto a leer.",
				"added": 1577569114
			},
			{
				"comment_id": 6,
				"body": "Yo no se donde véis los fallos. ¿Podéis enumerar los fallos que habéis visto?",
				"added": 1578339339
			}
		],
		"1_1PDryjn9XzJ6pR6M98ST8EvdYheXV8gAQS": [
			{
				"comment_id": 5,
				"body": "> Creo que todos podemos ganar dinero si esto se globaliza\n\nSobre todo tu.",
				"added": 1577615402
			}
		],
		"1_14Zkn3U1zMYVvFqV2PaoJEwiELxuq4mZDj": [
			{
				"comment_id": 7,
				"body": "Sería mas ameno que uno de nuestros días normales.",
				"added": 1578339454
			}
		],
		"1_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 8,
				"body": "Con el propio TorBrowser podéis acceder a toda la red Tor, es decir... si lo estais usando ahora mismo entrad a este enlace:\n\nhttp://zqktlwiuavvvqqt4ybvgvi7tyo4hjl5xgfuvpdf6otjiycgwqbym2qad.onion/wiki/index.php/Main_Page\n\nEs la hidden wiki.",
				"added": 1578602851
			}
		],
		"1_1PC9v6PXWN9ec4XaBAHRGET679siEEqFUN": [
			{
				"comment_id": 9,
				"body": "Es verdad y además nos va a joder la economía.",
				"added": 1583949006
			}
		],
		"2_1PAQSnwf9cZr1qTjjVq2g35ZH2B6HijFbZ": [
			{
				"comment_id": 10,
				"body": "¿Has probado a escribirles?",
				"added": 1586101918
			},
			{
				"comment_id": 13,
				"body": "http://127.0.0.1:43110/17FGkPsZcCXWgNNrjKYNf9C75onx2w2rB5/",
				"added": 1587340421
			}
		],
		"4_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 11,
				"body": "Sociedades secretas como Artemis podrían ser una solución, son descentralizadas y funcionan mediante Ethereum, IPFS y demás http://127.0.0.1:43110/17FGkPsZcCXWgNNrjKYNf9C75onx2w2rB5/\n\nLo que hay que hacer es organizarse en cientos de miles de miembros, y entonces podréis hacer algo. La individualización de la sociedad tramada por los gobiernos impide precisamente esto. Es una guerra que perdimos hace muchos años y más con la aparición de internet. Pero bueno, en las manos de la gente está que solo sea una batalla perdida.",
				"added": 1587308066
			},
			{
				"comment_id": 12,
				"body": "https://www.vozpopuli.com/economia-y-finanzas/Gobierno-controlar-deporte-botellones-garajes_0_1346865937.html\n\nCada vez da mas asco todo, la verdad. Que los policías hagan comentarios como \"esto es un cachondeo\" cuando es evidente que se han eliminado todos los derechos. Lo que es un cachondeo es que estemos así.",
				"added": 1587338491
			}
		]
	},
	"comment_vote": {
		"20_1F599yb2J8DmRn8nAxyN7e9MRuaU6QZfkZ": 1,
		"1_13duupsgVkMn9rp5oEwsvR5HvdJCNmwcZB": 1,
		"1_14tvQQLMmtDF2Wd7NozrVmymbi2qdDqpC2": 1,
		"2_18Aa65ctnkVLNyt6UB8djy7LB9DGBZ9uXL": 1,
		"5_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": 1,
		"3_15i8WB3wdpSqpuzVetqgsQLvNvhe3aeKtN": 1,
		"7_15i8WB3wdpSqpuzVetqgsQLvNvhe3aeKtN": 1
	}
}