{
	"next_topic_id": 13,
	"topic": [
		{
			"topic_id": 1,
			"title": "欲火高升",
			"body": "山青水秀、桃红柳绿，这是一个春光明媚的季节，青年男女都结伴郊游，我\n久处于城乡，实在不忍辜负大好时光。学校放春假一周，遂与美云商议去郊外踏青，美云也欣然同意，丽云当然更\n不会放过这一个游乐的机会，因为大姐与小舅妈的感情最为融洽，所以又邀\n请小舅妈参加。小舅妈与我的关系始终在最高度的机密下保持着，这都亏小莺机警的从中拉\n合，所以才能瞒住美云她们三姐妹的耳目，到现在还是人不知鬼不觉的继续\n着。不过，小舅妈的态度却不大同于往昔了，双颊红润丰腴，眼波流动含情，笑\n语如珠心胸开朗，往日的神情抑郁落落寡欢，再不复现，尤其爱对镜梳妆，\n淡扫蛾眉脂粉薄施，一袭淡黄色的旗袍，使她年轻十岁，女人的心就是这般\n不可捉摸。这天，天气暖和，小舅妈偕同彩云姐妹，带着ㄚ头小莺、小芙，乘着马车出\n城而西，我骑着那匹白马车后随行，陈公馆的女眷出游，气派不同凡响，游\n人都自动闪开让路。城西的小孤山为本市有名的风景区，山上遍植桃李杨柳，每到春季，桃红柳\n绿、燕舞莺歌，为仕女游乐的好去处，山上设有茶座酒楼，专供游人歇憩，\n为一所天然的大公园。我们到了目的地，停车下马步向桃林，落红缤纷、香气袭人，丽云、小莺、\n小芙三个女孩子如脱笼之兔，嘻嘻哈哈的追逐于花丛之中，小舅妈、彩云、\n美云到底显得庄重文静，仅在花下漫步徜徉，或伸出白嫩的素手，摘取她心\n爱的花朵，戴在鬓角或衣襟，人面桃花相映成辉，竞艳斗丽！陈公馆的夫人小姐们，个个天香国色、风姿绰约，把一般郊游的女客比得黯\n然失色，更引起游人的评头论足窃窃私语。她们六人分作二批，或花间起舞、或草上小憩。在此情形下，我这唯一的男\n士反而无立足知地，坐卧不宁起来。我说道：“小舅妈！你们在这里玩，我和李贵骑马去玩玩。”小舅妈亲切的叮咛道：“当心点，不要摔倒，早点回来，免得让人挂念。”美云低低责骂着我：“你总是不能安静一会。”这时仆人李贵已牵过我的马匹，我蹬跨上马向小孤山后奔驰而去，李贵也骑\n了匹马紧紧跟着，游女们抢惶让路，我露出得意的笑。一阵奔驰后，马儿渐渐顺道缓行，我觉得有点口渴，这里并无茶座，适置桃\n花林中闪出两间茅舍，柴门半掩，乍见门后有一佳人，翠衫青裙，娉娉婷婷\n，看她非常面善，但我又不敢唐突冒认。那丽人如燕语莺声喊着我，但我仍想不起在哪里见过面。“咦！表少爷，你怎么到这里来了？”“你是”她妩媚的一笑说：“我是妙蝉呀！”“蝉姐姐！你怎么如此的打扮呀！”“快到里面来，我跟你讲！”“好！你先等等，我和仆人交代一下。”我慌忙找来李贵，告诉他我遇见一位同学，邀我到他家玩玩，明天才回城，\n要他先回去和小舅妈讲一声，李贵走后，我即刻跑回茅舍，妙蝉正依门等候\n，我上前抱住她的纤腰，在她粉颊上吻个香道：“蝉姐！你好吗？”“冤家！你把姐姐想死了，快里面坐。”她转身带上柴门，拉着我向里走。那是一座精致的小庭院，蔷薇深处蝴舞蜂\n飞，靠后一厅两舍，布置得窗明几净一尘不染，较之那珠栏雕砌，真是别具\n情调。她让我坐在藤椅上，递给我一杯香茶，我搂起她的腰，让她坐在我腿上，轻\n揉着她的酥胸。“蝉姐姐！快告诉我，到底是怎么回事呀！”她盈盈欲泪不胜凄楚，我怜爱的吻着她：“唉！说起来话长，想不到姐姐今生还能见到你！”“好姐姐！别伤心了！”“自从你那次离开我后，我朝思暮想、日夜痴等，总看不到你的影子，几次\n想进城去找你，但我这种打扮，而且侯门深似海，我又不敢去，哪知你一去\n无音息，害得我茶饭不思、颂经无心，渐渐的面黄肌瘦，一病不起！\n”“姐姐！都是我害了你！”“我的病来得突然，当然瞒不住妙慧，在她再三的追问下，我才把我和你的\n关系告诉她，妙慧除了同情我外，也没有办法安慰我，只有劝我死了这条心\n，有钱的阔公子不会把我这个苦命人放在心上的，这样的一病病了两个月，\n药石无效，我想一死方休，但又想见你最后一面，所以又舍不得死\n”说着，她的泪水夺眶而出。“好姐姐！你为我受苦了！”“我得的病是心病，当然不是药物可以治好，多亏得妙慧百般的安慰我、服\n侍我，我的病才算慢慢的有了起色。这条小命又拣回来了。这时我已瘦得不\n成人形了”她已经泣不成声，无法再说下去，我紧搂住她，吻着她的泪水，吻住她的樱\n唇，吮着她的香舌，香香的、甜甜的，以热烈的吻来消弥她胸中的积怨。“好姐姐！我对不起你！”“这也不能怪你，因为我自己明白实在配不上你，况且你身边有的是鲜花似\n的美女，哪能想到我这苦命人。”“姐姐！我也想你呀！”“傻孩子！姐姐想你是牵肠挂肚、刻骨入髓的，你想姐姐是肤浅表面的，过\n一下就烟消云散了！”“蝉姐姐，以后又怎样了呢？”“以后，我的身体慢慢好了，我与妙慧经过这一场风波，真是情逾姐妹，无\n话不谈了，我们非常厌倦那枯寂的尼姑生活，老是想找机会出来，摔掉那件\n灰袍，再不伴青灯古佛了。“本来嘛！像姐姐与妙慧这般天仙似的美人，若是陪泥菩萨过一生，岂不是\n太可惜了吗？”“小冤家！你寻姐姐开心！”她娇羞的打了我一下，风情万种令人销魂，我轻轻的解去她的衣扣，露出红\n色的亵衣，手由衣衫下端摸上去，那对结实而富弹性的大乳房，被我满满的\n握住，凝滑柔软，不忍释手。“小鬼！你不老实，我不讲给你听了。”“好姐姐，我不动了，你快讲嘛！”我仍不放手轻轻的捏着奶头。“后来机会到了，老师父归西了，新当家的还没有来，妙慧与我商议着逃走\n，我们携带细软就离开了观音庵。”“怎么又到这里来了呢？”“庵里不是有一位烧火的洪妈妈吗？她无儿女的也很可怜，我们事先与她商\n议好，她带我们先住在她侄女家，然后拿钱在这里买点田、盖了房子\n啊唷你又用力揉人家了，我不讲了。”“好姐姐，揉一揉有什么关系，那么小气！”她白了我一眼，清轻的吻着我的脸颊，又继续说道：“在这里住下后，我与妙慧每天绣花，洪妈妈在后面种菜，我们三人相依为\n命，生活倒也宽裕，心里就是放不下你这冤家，每一想到你，我就难过了半\n天。”“好姐姐，别难过了，我这不是来了吗？”这时，她的亵衣已被我脱掉，那圆鼓鼓的玉乳，巅巍巍的脱颖而出，尖尖的\n乳头已被我捏得红红的竖立起来，我张口吮住那鲜红的葡萄粒，伸手撕去她\n的罗裙。“看！又毛手毛脚的，姐姐被你揉得心里发慌！”“姐姐！好姐姐！让我亲亲嘛！”“美喔！馋嘴！”她“噗吃”媚笑了，不再拒绝。“妙慧到哪里去了，怎么不见她人？”“跟洪妈妈一起进城卖花去了，天黑就回来。”“现在妙慧脱掉灰袍，人不知变成什么模样？”“标致的很，又白又胖，两个大乳房有好几斤重，屁股圆圆的像锅盖那么大\n，走起路来巅巍巍的真迷人，每次跟洪妈妈进城卖花，都卖得特别快，而且\n价格又高。”她像是故意揶揄妙慧，说着自己竟“嗤嗤”的笑起来。“蝉姐姐！你若进城卖花一定比妙慧卖得更快更贵，说不定回不来，连你人\n都被买走了。”“啐！我从来都没去卖过花，有一次与洪妈妈进城买布料跟绣花线时，有好\n多臭男人都死盯着人家，讨厌死了。”“谁教姐姐长得好看，臭男人才爱看呀！洪妈妈保险没有人看她。”“小鬼！讨打！”\n她轻轻的在我颊上拧了一把，“嗤嗤”的娇笑，我趁势把脸藏在她的怀里，\n咬住她的乳头吸吮起来。放在她阴胯间的手也开始上下活动，揉着她的阴毛\n、捻着她的阴核，扣得她“格格”浪笑。“小鬼！别整姐姐了，你肚子该饿了吧！让姐姐弄饭给你吃。”她挪动一下身子准备离去，我哪还能容她脱身，上前紧抱住她死也不放。“好姐姐！我不要吃饭，我要吃你身上的白肉！”“吃了半天，姐姐的奶奶都被你吃痛了，还没吃够吗？”“我要吃你下面的肉！”“啐！冤家！真折磨人！”我抱起她就要起身，两腿已被她压得麻木，不由“啊唷！”一声又坐下来，\n她吃惊的搂住我：“弟弟！怎么样了？”“我的腿被你压麻了，不能动弹。”“快别动！让姐姐替你按摩一下好了。”她离开了我的怀抱，端了一个矮凳子坐在我身旁，抱起我的小腿放在她膝盖\n上，握着粉拳轻轻地在我大腿上捶着、按摩着，非常舒服。她胸前的双乳随\n着她的一捶一捶而抖动着。“弟弟！可好一点吗？”“嗯！”我只顾望着她的双乳出神，把大腿麻木的事早忘记了，她见我没有回答才发\n觉我的眼神有异。“坏死了！不给你捶了。”她掀起我的腿，拉住衣襟掩住双乳，就要起身离去，我赶紧一步抱起她的娇\n躯走入卧室。“好弟弟！吃过饭再来吧！怎能急成那个样子？”“不嘛！现在我就要！你不是想我吗？好姐姐！”“唉！真缠死人。”我轻轻的把她放在床上，脱去她的衣衫，一副白嫩嫩香喷喷的玉体马上现在\n眼前，我迅速的脱去衣服，粗壮的阳具已硬得直抖，猴急的搂住她的娇躯，\n颊上、唇上、粉颈上、玉乳上，如雨点般的吻个不停。“姐姐！亲姐姐！急死我了。”“小鬼！快上来嘛！姐姐在等着你呢！”她搂住我双腿夹住我的胯下，把我翻到她身上，自然的张开两腿露出肥嫩的\n阴户，粉手握住我坚硬的阳具导入她的阴户，粉臀一挺，粗壮的阳具即滑入\n大半，暖暖的滑滑的，紧紧的包着我的阳具，我再一挺，阳具整根没入，她\n掀起粉臀扭动柳腰，摇、晃、磨、挫，阴户内一紧一缩的吸吮着我的龟头，\n异常的美妙。我抖擞精神九浅一深、横插直捣，插得她浪叫连连。“好弟弟！美死姐姐了喔美死了”“亲弟弟！姐姐舒服极了姐姐丢了”“哼哼哼”我的元气正旺抽送更猛，直仝得她花容失色钗横发散，浪叫渐渐低微，只有\n呻吟的份儿，一股股的阴精如决堤之洪水汹涌而至，灼烫着我的龟头，我不\n禁热血上腾，一阵阵热精射入她的花心。她双腿夹住我的阴胯，不让我动弹\n，我们都欲仙欲死、心花怒放、你贪我恋不忍分离。她双颊转红娇艳欲滴，宜嗔宜喜如怨如诉，我俩互吻着紧抱着，疯狂的滚在\n一起。“好弟弟！姐姐美死了！你是姐姐的心肝，姐姐不能再离开你了！”“好姐姐！我又被你浪出火了，再来一下吧！”“傻孩子！不能贪多，好好的躺着，姐姐弄饭去，吃了再玩吧！”“不嘛！我要再抱抱你！”“好弟弟！听姐姐的话，姐姐再给你亲亲好了！”她送上红唇，我一阵热吻才让她离房。妙蝉姗姗出房,舒畅的躺在床上闭着眼，如梦如幻，六七个倩影都涌上脑海\n。妙蝉娇俏放荡热情如火，星眸流露着如饥如渴的目光，有一股吸人的魅力，\n让人不能自持。陈妈淫荡冶良，一身细皮白肉堆绵积雪，乳波臀浪，走路浑身乱颤，使人眼\n花撩乱，只要一粘身就会销魂蚀骨欲仙欲死。小莺像一朵含苞待放的蓓蕾，婷婷袅袅，浑身充满处女的幽香，心眼玲珑善\n解人意，投怀送抱小鸟依人，是一朵解语花使人遣愁忘忧。丽云人高马大，浑身充满活力，一肌一肤都富有弹性，热情放荡，从不娇揉\n造作，那对结实的大乳房搂在胸前，如两只火球一般的灼着人的心灵，像一\n杯烈性的酒让人一醉不起。彩云温柔纯良清丽娴淑，双目中散放着慈祥的光辉，犹如三春时的旭阳，温\n暖着人的身心，娇怯怯的教人见而生怜。我更喜欢依偎在她的怀里，享受着\n她的爱抚，那母性的慈蔼使人依恋。小舅妈端庄持重，是观音大士的化身，虽为半老徐娘，但美人并未迟春，白\n皙润腻光滑凝脂，我爱偎依在她酥胸之上，如处温柔乡中，含蓄妩媚风情万\n千，移裘荐枕曲意承欢，使人如浴春风如沾雨露，徐娘风味胜雏年，实非欺\n人之谈。美云艳冠群芳，丽质天生，眉如远山横黛，目似秋水盈彻，唇若点丹齿若含\n贝，体态轻盈如细柳迎风，软语娇笑似黄莺出谷，多情而不放荡，温柔而不\n轻佻，她把情与爱、肉与美揉合在一起，全部注输在我身上，她是我的未婚\n妻，我敢谢上苍对我的厚赐。我正在呆呆的出神，不知妙蝉何时进来，双手捧着一碗汤坐在床沿上，她笑\n盈盈的望着我：“睡觉了没有？该饿了吧！快起来先喝点鸡汤。”她放下手上的汤扶我起来，我懒散的偎在她怀里，望着她痴笑，她一手环抱\n着我，一手端着汤碗送到我嘴边。我吃了一口道：“唷！好烫啊！不信你尝尝！”她尝了一口道：“不太烫嘛！”“我要吃姐姐嘴里的汤！”“小鬼！我就知道你不怀好意，把嘴凑过来，我喂你！”她果然喝了一口汤，鲜红的小口慢慢的把汤渡入我嘴里。“嗯！好香啊！我还以为是块鸡肉呢！”“啐！少贫嘴！再来”我俩在愉快中喝完鸡汤。“好姐姐，让我再玩一次吧！你看人家又翘了！”我抓住了她的手，要她抚摸我的阳具，惹得她“嗤嗤”的娇笑。“怎么这样性急，会累坏身体的，待会儿妙慧回来了，等我们吃过饭后，今\n晚睡在我这里，姐姐让你玩个痛快！”“那妙慧怎么办呢？”“让她和我们睡在一起不好吗？她的工夫才大呢！保险要你的小命。好了！\n快穿好衣服等她回来了，不笑你才怪呢！”她替我穿好衣服，二人又揉作一团。正在兴高彩烈之际，忽然门外传来叫门\n声，妙蝉急忙起身，整理一下凌乱的床铺，拉我到外厅坐下，她穿过庭院奔\n向大门，一会儿她拉着一位紫衣丽人，二人低声交谈着进来，不用说这就是\n妙慧了。妙慧一身紫衣，娇躯丰腴略肥，银盆大脸满如秋月，星目盈盈犹如一泓秋水\n勾人神魂，两条粉臂洁如鲜藕，柔若无骨摇摆有度，紧身的春衫裹着那颤巍\n巍的大乳房，更显得乳沟分明，肥大浑圆的屁股在罗裤中隐隐突起，扭扭搭\n搭的肥肉儿乱颤，两条粉腿塞满了裤脚，显得格外性感，令人欲念顿生。妙蝉一阵风似的跑到我面前，拉着我的手迎了出去。妙蝉道：“仲平！看那是谁来了？”妙慧道：“唷！好少爷，是那阵风把你吹来的？可把我这大妹子想死了！这么个小白\n脸，怎不教人着迷呢？”我道：“慧姐姐！你好吗？”妙慧道：“嗯！小嘴多甜呀！怪不得大妹子为你要死要活的！”妙蝉道：“好啦！我们等着你吃饭呢？”她俩忙着端菜拿汤，偌大的一张八仙桌，七大八小摆得满满的，除了一些腊\n味、素菜外，还有一只肥鸡，妙蝉的烹饪技术相当高明，样样菜都是色香味\n俱全，算得上一位才貌双全的巧妇。饮食间，她俩都在拣鸡腿腊肉向我的碗里堆，其实这些大鱼大肉我早已吃腻\n了，还不如青菜豆腐来得可口，我把鸡肉又分送给她们。“小鬼！你怎么又这个还给我，难道不喜欢我？”我道：“蝉姐姐！我很喜欢吃青菜，你做的青菜比肉还好吃！”妙蝉听我在夸赞她，她喜孜孜的道：“青菜是洪妈妈种的，只要喜欢吃以后我就煮青菜给你吃！”妙慧两眼飘着我，一语双关的道：“大少爷一定是吃腻了油腥，所以来这里吃点野味，调调口味。”在笑语风声中结束了这顿晚餐。“仲平！让蝉姐姐陪你到客厅谈谈，我去洗个澡。”妙慧姗姗离去，妙蝉拉着我走进妙慧的卧房，房内布置得非常别致，枕被、\n床罩、罗帐、一衣一物全是粉红色，香喷喷的像是新娘的洞房，置身其中使\n人绮念横生。妙蝉道：“慧姐姐的床很大，我时常和她睡在一起。你先在这里休息一会，我去换妆\n马上就来。”\n过一会儿，妙蝉晚妆初罢，一头青丝梳得高高的髻儿，鬓间缀着一朵白兰，\n一袭薄薄的春装，粉红的绣花软鞋，明眸浩齿素颜映雪，一种成熟的少妇风\n味令人心情勃动。我咬着她的耳朵求欢：“好姐姐，我想”她打了我一下，笑得花枝招展道：“你好馋嘴呀！”“谁叫姐姐长得这么美，惹得人家发火呢？”我涎着脸向她撒娇。她无意拒绝，宜嗔宜喜的对我媚笑，我连忙抱起她，按\n在一张檀香大椅上，掀起她的粉腿，也不脱衣服仅将她的罗裤拉下一半，露\n出雪白的粉臀及鲜红的阴沟，我从裤扣中掏出阳具，轻轻的插入阴户中，贴\n着她的粉颊，吻着她的红唇，一阵馥郁的幽香沁入肺腑，令人昏昏欲醉。她星眸含情樱唇露笑，翠蓝色的紧身春衫腰身狭小，裹得曲线毕露，浅浅的\n领口短短的衣袖，露着雪白的粉颈及似藕的玉臂。那香软绸滑的衣衫内裹着\n秾纤适度的娇躯，搂在怀里令人神魂飘荡。虽然我俩都穿着衣裳，但比赤身\n相戏更有一番情趣。正在你贪我恋之际，妙慧浴罢归来。“唷！大妹子，怎么那样着急，不容我回来就偷嘴！”妙慧仅披一袭轻纱，薄如蝉翼，丰乳、肥臀、纤腰、粉腿，隐隐约约可看大\n概，真是妙态横生，我拔出阳具，扑向妙慧，反手扯去轻纱，柔玉温香抱个\n满怀。我将妙慧推倒在床上，双手抓着她那大如木瓜的巨乳，凑上嘴就一阵猛吸狂\n啃，弄得妙慧忍不住的叫出声来：“小鬼！你喔你好狠呀姐姐被你吸\n吸光了嗯舒服极了”妙慧嘴巴叫嚷着，而且不停的挺着大胸脯，好像久逢雨露，急需要男人的滋\n润似的。我腾出一只手来，往妙慧的阴胯摸去，原来妙慧已经春潮泛滥淫水直流。我\n见机会成熟，立即提枪上马，妙慧主动的用手扶着我的阳具对准自己的阴户\n，我一挺腰“咕”一声到底。妙慧娇叫着：“啊喔小鬼！轻轻一点。”可能是妙慧久未经人道，一时不能适应，于是我放缓抽送的速度，以一种温\n柔而细致的韵调慢慢地向里推送。我感觉到妙慧的阴户里，一紧、一松的在颤动着，宛如婴儿在吸乳般不停地\n吸吮着我的龟头，这是从前未曾有过的感觉，真是令人消魂。我兴奋的说：“好姐姐！你的阴户与众不同”妙慧道：“那就快闭上眼享受一下吧！”她的阴户一紧一缩自然的吞吐着，阴精津津的润浸着我的阳具，我的精水也\n徐徐流着，这样也会使阴阳调和，我俩偎依相抱，完成一场含蓄性交。“好姐姐！还是这么硬怎么办？”“嗤嗤！”她格格地笑着。我向她撒娇道：“人家硬得难过嘛！姐姐让我抽动一下吧！”“傻弟弟！别着急嘛！姐姐会让你软的！”她的阴户加紧的收缩了，一吸一吮吞进吞出，使得我的龟头像被牙齿咬着的\n一般，整个阴壁都活动了，我浑身麻酥酥的如万蚁钻动，热血沸腾如升云端\n，一股热精如泉涌般的射进她的花心，她也一阵颤动的泄了阴精。“小鬼！还硬不硬？”“好姐姐！太美了！你的里面怎么会这样的动法，是向谁学的？”她娇笑连连，羞而不答。“是向谁学的？为什么不说话？”“傻瓜！这岂能学得来的吗？天生我就是这样的呀！”“为什么蝉姐姐不会这样的功夫？”“蝉ㄚ头也有她的妙处，紧、小、水多，难道你还没有体会到？”“蝉姐姐虽然妙，但总不及姐姐的美，我愿永远插在里面！”此时的妙慧春意荡漾媚态横生，她美极了！娇极了！我紧紧的搂在怀里，爱\n在心里，我热情的吻住她，她默默的承受着，多情的抚摸着我的全身。“小鬼！你的性欲太强了，真不是一个人可应付得了的。”她怜爱的看着我，目光内充满安祥、慈蔼，以往的淫荡全找不到了，这时她\n宛如一个娴淑的妻子。妙蝉冲了进来说：“唷！怎么又黏上了，真是男贪女恋！”妙蝉晨妆初罢，蛾眉淡扫脂粉薄施，一袭白色窄窄的春装，越显得花容雪肤\n，她笑吟吟的看着我与妙慧。我道：“蝉姐姐！你怎么一大早就跑走了？”妙蝉道：“我这样作不好吗？给你们俩留个机会呀！”“来！再睡一会儿吧！”我一把将妙蝉搂在怀里，在她颊上吻个香。妙蝉道：“还睡呢？看太阳已晒到屁股了，起来吃点东西！”妙慧道：“真的该起来了，让蝉姐姐给你穿衣服吧！”她给我穿上衣裳，扣着钮扣，等拿起裤子要向腿上套时，发现我腿根处，粘\n粘的一片玉津，她轻轻的打我一下道：“看看这是什么东西还留在身上，教慧姐姐给你吃掉！”妙慧正在穿衣裳，听妙蝉一说掉头向我腿根看去，她不禁羞得红了脸，在枕\n下取出一块红纱向妙蝉道：“小妮子！一点亏都不吃！”二女都“嗤嗤”的笑了。穿好衣服，我们携手步出卧室，庭院中阳光普照空气清新，我迎着旭日作一\n个深呼吸，顿觉精神振奋，再看身旁的二女人比花娇，我们都满足的笑了，\n内心充满了兴奋、幸福，眼前现出美丽的远景。",
			"added": 1568726863,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "洗浴中心玩小姐",
			"body": "现在全国各地都有很多洗浴中心。这些场所基本上同时提供两种服务：一是正规的洗浴、按摩服务；二是提供特服，也就是玩小姐了。\n我很喜欢这些场所。洗个澡，找个漂亮技师（都不叫小姐了，叫技师，有意思）玩一下，最后来个正规按摩放松一下，太爽了。\n现在将这些经历与各位淫友分享一下。\n＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊\n我所在的城市有很多洗浴中心，一般是两大类：一类是装修豪华，气派，小姐，不对叫技师，也漂亮，但是价格高；一类是装修普通，技师么样子一般，但价格便宜。还有一类数量不多，但我十分喜欢，这类洗浴中心，装修普通，但技师漂亮、服务周到、认真，很投入，价格比第一类低一些，有些还要高。\n现在花钱找小姐玩，漂亮的很容易找，但一般对你都是应付了事，希望速战速决。好些的装模作样叫两声，差的连叫都懒的叫，玩起来特没劲。\n我说的第三类就不一样，每次都很认真，投入，玩起来特爽。下面我就将我的经历讲一讲，与给位淫友分享一下。\n一、金玉良缘\n这个洗浴中心在我市的繁华地段，但门头很小，不惹人注意。上周一晚上到哪里爽了一把。\n去了以后，简单的洗洗，就去了休息大厅。在大厅喝了杯茶，简单休息一下后，就直接来到了贵宾房，就是单间。\n一会，一个技师敲门进来，身高１．６米左右，身材一级棒，尤其是胸部丰满、结实，样子么马马虎虎，不算难看。\n像所有的技师一样，她轻声问我，“先生，可以为您服务么？”\n我点点头，她转身将门锁上。\n“先生，您想做什么项目呢？”\n这里的项目我已经烂熟，但我还是喜欢她们在报一边，尤其是那些刚做不久的报项目时还有些害羞，看上去很爽。\n“你一个一个介绍一遍吧。”\n“好的，先生这里主要有：１５８元的欧式，主要是胸推、打飞机、足疗、送浴资；２９８元的泰式，主要是：胸推、臀推、漫游、冰火、打炮，送浴资、足疗、搓背；３９８元的帝王浴，主要是泰式＋鸳鸯浴；５９８元的双飞燕，主要是连个技师做，项目与泰式一样。先生，您做那一项？”\n“先做个欧式，如果好，再改别的项目。”\n“好的先生，我先报钟。”\n她转身拿起电话报钟，我从她身后搂过去，左手摸她的胸，靠，确实有弹性；右手掀起她的短裙，隔着内裤摸她的阴部。\n她没有表示反对，只是轻声说：“等一下，报完钟，再摸。”\n我没有管她，继续。\n她报完钟，转身轻轻推开我，“先铺一下床。”\n在床上铺好纸床单，（靠，自从洗浴中心火了以后，直接带动了这些一次性纸内裤，纸浴衣、纸床单、一次性牙刷等相关产业的发展。所以说色情业可以带动其它很多相关行业的蓬勃发展，绝对应该规范的发展，不能简单的制止。题外话，不说了。）然后开始为我脱衣服。\n我站起来，她将浴衣带子解开，为我脱衣。在脱短裤时，我的小弟弟早就翘起来了。\n“真大啊！”\n这里不是夸张，我的小弟弟确实很大。\n她站起身来，开始脱衣服。先是上衣，然后是短裙，最后是胸罩（做欧式，内裤是不脱的）。身材确实好，尤其是乳房，很结实，不下垂。\n“好了，你先趴下，小心点。”\n我小心的趴在床上，她分开腿，跪坐在我的腿上，在我后背倒上油，然后用手在我后背轻揉。\n“你是哪里人啊？”\n“威海。”\n山东的，有些失望，一般说来山东的女孩服务水平一般，湖南、四川啊很不错。\n“来这里多少时间了？”\n“一个月。”\n靠，每个技师都是这么说，不过一般说来小姐在一个洗浴中心确实不会做很长时间，主要是脸一熟了，那些回头客就不点她了。\n说着话，她已经将胸部也摸上了油。她转个身横趴在我身后，开始用她的乳头在我后背轻轻推揉。\n可以感觉到，她的乳头已经硬了，在我后背轻轻滑过，有些痒，感觉很爽。\n过了一会开始趴下身，用整个乳房开始推揉，两团热乎乎的，有弹性的肉在背上不停的揉搓，小弟弟立刻兴奋了。\n我将左手费力的伸到后面，摸她的大腿，向上分开内裤，摸进了她的阴部，她没有表示反对。我大拇指按住她的阴蒂，中指轻轻地插入她的阴道，里面暖暖的，有些湿，然后开始轻轻抽插。\n“你多大了？”我边玩边问。\n“你猜。”\n“２２。”\n“差不多，２１。”\n“高中毕业？”\n“不是，中专，幼师。”\n“那怎么出来做这个了？”\n“幼师钱太少了，啊……轻点……”\n到很实在，５、６分钟后，她跪倒我的脚后，开始推我的屁股，大腿与臀部间有个起伏，她的胸在推到哪里时，特舒服。\n“大哥，舒服么？”很快就混熟套近乎了。\n“还行。”\n又推了５、６分钟，她开始为我按摩屁股，她在我屁股上到满油，两只手在屁股上开始轻揉，感觉特痒，有点受不了，开始扭了几下屁股。\n她左手成掌，开始在我的屁股沟上揉、搓……靠、太爽了，过了一会，用大拇指在我的肛门上轻轻按了几下，我轻轻哼了一下。又过了一会，她将手从两腿间向前摸我的小弟弟，我将双腿抬起，好让她能全部摸到。\n她轻轻在我的小弟弟上抚摸，套弄，轻揉我的两个卵蛋，太他妈的舒服了。\n“大哥，推前面吧。”\n“好。”\n她跪骑在我的身上，在我胸部倒上油，然后用手揉开，最后轻揉我的两个乳头。太舒服了，我的手也没有闲下，开始揉她的乳房。她闭上眼睛，看上去很爽的样子。\n过了一会，她趴下身开始用胸在我的上身推揉。５、６分钟后，她跪低身，再乳房上涂上很多油，然后用乳房夹住我的小弟弟，开始让胸部上下动，使我的小弟弟在她的乳沟里抽查，真是太舒服了，差点就射了。\n我轻声说：“慢点。”\n她动作慢了下来，然后跨坐在我腿上，用手上下套弄我的小弟弟：“大哥，做别的项目么？”\n“好。”想都没有相就答应了下来。\n她用右手有节奏的上下套弄我的小弟弟，左手轻捏我的卵蛋。笑意盈盈地对我说：“大哥，做个帝王浴吧，我保证陪好你。”\n帝王浴，３９８元，靠，我月收入的１／５，太贵了。我犹豫着不知道说什么好。这个时候她趴下身来，用乳房在我的胸口不停的蹭来蹭去，同时伸出舌头舔我的耳朵，并不停说：“大哥，做一个么，好不好。”\n我头脑一热，“好，做一个。”\n“谢谢大哥，”她立刻欢呼雀跃起来，“你等一下，我再报个钟。”\n“喂，前台么？我２３号，客人０１５号，帝王浴。”\n我摸着她丰满的胸部，心疼着我的钞票。３９８元应该可以做很多事情啊，至少半个月的伙食费，或者一双不错的皮鞋。靠，还是挣的太少了，如果一个月挣１万，现在就可以抱两个妹妹了。\n“大哥，我们换个房间，来，我帮你穿衣服。”\n她帮我穿上短裤，可小弟弟还很翘，短裤前面形成了一个小帐篷。“哪个房间啊？”我问了一句。\n“大厅旁边。”\n靠，要经过大厅，我这样怎么出去啊。“沉鱼厅不行么？”我问。\n“不行，桑拿房坏了。”穿完衣服，她不管不顾地挽着我的胳膊就往外走，搞得我到很不好意思。\n走出房间，来到休息大厅。大厅人不是很多，有男有女，只是瞟了我一眼，就没再多看，原来都习惯了，我的心情顿时大为放松，手于是就很自然的搂住了她的腰。\n来到了云溪厅。进了屋，锁上门，我迫不及待的搂住她，开始亲她的脸。她很配合，积极迎合着。我手伸入她的内裤，不停的揉搓她的阴部，她拉下我的短裤，轻弄我的小弟弟。\n过了一会，她推看我，笑着说：“等一下，先脱了衣服。”\n很快两个人就都脱光了衣服。\n“先洗一下吧。”她打开淋浴开始清洗我身上的油，我的手则不停的在她身上摸来捏去。很快洗到小弟弟了，她用手轻揉着，抬头冲我笑了一下，然后低下头，将我的小弟弟含入口中。靠，怎么搞的，不带套就来，不会中标吧。我十分想将小弟弟从她口中退出，可不带套的感觉就是比带套要好。先爽了再说。\n我将她的长发拢到脑后，这样可以清楚地看到我的小弟弟在她的口中进进出出，感觉特爽。她口交的技术很好，有想射的感觉。我抓住了她的头，让她慢了下来，最后将她的头稍向后仰，用手固定住，开始将小弟弟在她的口中抽插。她闭着眼，轻声的哼着。为了３９８元，我也得好好玩玩，有些小气，没办法，没有钱啊。\n在她的口中抽插了大概五分钟，我停了下来。她站起身，对我说：“来，大哥，躺上面。”我被她扶着躺在了床上（就是做搓背的那种床）。\n她拿来一罐冰的雪碧，喝了一口含在口中，然后低下身，开始用舌头舔我的脸。冰凉的、软软的舌头滑过脸颊，感觉爽级了，身体有些软软的感觉。顺着脸她从我的肩舔到胳膊，手。\n“舒服吧。”她笑着问我。\n“太爽了。”我摸着她的乳房。\n她重新喝了一口雪碧，开始一个、一个的吸我的手指，真是淫荡啊。不过我喜欢。\n两手吸完后，她又含了一口雪碧，开始舔我的胸部，重点是两个乳头。她不停的吸着，轻咬着。这个小骚货，挺懂得男人啊。我闭着眼享受。\n很快就到了大腿、小腿。这时她起身拿了个塑料薄膜，盖在我的脚趾头上，然后吸我的脚趾头。靠，做过这么多漫游，头一次有人吸脚趾头，真是爽啊。看不出来啊，一个看上去挺老实、挺清纯的女孩竟然这样淫荡。今天有福气啊。这样下去，看来肛门她也会舔啊。\n（三）\n吸完脚趾头后，她抬头看着我，笑着说：“大哥，翻个身，做后背。”我小心地翻身，趴下，生怕弄伤了小弟弟。她看我小心翼翼的样子，直笑。\n笑、让你笑，等一下插死你，啊！好爽。在我正想着怎样玩她的时候，她开始舔我的后背。柔软的舌头在我的后背不停的舔着，雪碧冰凉的感觉刺激着我的神经，小弟弟越来越涨，很快大腿、小腿也被她一一舔过。\n“大哥，等一下，我去拿东西。”\n“好。”我胡乱应了一声，还在回味着刚才舒服的感觉。\n很快，她便拿着两个一次性纸杯回来了。我抬头看了一下，一杯是热水，一杯是冰块。冰火，我喜欢。\n“大哥，抬腿。”她让我将两腿支起，屁股向上抬。靠！这个动作也太难看了，怎么与女孩被插时候的姿势有些相像。刚想表示反对意见，只见她将一张塑料薄膜盖到我的屁眼上。靠！真的来么，这里可从来没有被舔过啊，我热切的期盼着，同时又将屁股向上抬了抬。\n她拿起一块冰，放在口中，咬碎，然后低下头，开始舔我的屁眼。先是用舌头在屁眼周围舔，之后开始舔屁眼，她用舌头将口中的冰块用力的向我屁眼里面推。一股冰凉的感觉从屁眼开始在整个下半身扩散。啊，我忍不住开始哼起来。\n那种感觉太美妙了，很难用语言形容。我闭着眼睛享受着，身体开始扭动起来。很快冰化了，她起身，喝了一口热水，又开始舔我的屁眼。很快一股暖意又从屁眼周围扩散开来。太刺激了，感觉比小弟弟做冰火还要刺激。\n几个回合下来，我已经爽的不行了。她又含了一口热水，左手在我的小弟弟上套弄着，右手摸着我的卵蛋，然后低下头，一口含住了我的小弟弟，开始不停的吮吸我的小弟弟。一股热流顿时将我的小弟弟温暖起来。看着小弟弟在她的口中进进出出，那种感觉真是爽啊。\n很快她又拿起冰块，放入口中，咬碎。然后开始吮吸我的小弟弟。由热到冷的刺激，让我忍不住有想射的感觉。我极力的控制着，但还是感觉到有些东西从小弟弟流出。靠，不会这就射了吧。哎，小弟弟还很硬么，没有事啊。啊，爽的我又开始哼了起来。\n她抬起头，将口中的水吐掉，然后用手指在我的龟头上摸着，笑着对我说：“什么东西流出来了。”。\n“啊，没什么，什么都不是，继续。”靠，真他妈的丢人，以前好像没有这种情况啊。\n她一脸坏笑，又含了一口热水开始吮吸我通红、发胀、硬挺的小弟弟。啊，想射的感觉终于控制住了，我开始玩她的乳头。随着我不停的挑逗，可以明显感觉到她的乳头在变硬。\n很快一杯热水、一杯冰块用完了，这表示这冰火已经结束。她拿出一个安全套，问我“戴上么？”我点了点头。她将安全套撕开，取出套子，分出正反，然后含入口中，用口、舌将套子戴了小弟弟上。靠，居然还有这等本领。以前只是听说过，可从来没有见过，原来真的可以啊，今天这个帝王浴做的确是值。",
			"added": 1568727977,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "山村的婶子",
			"body": "（一）\n在城里的，可是校领导找我谈话，说我在学校期间成绩不突出，对领导也不是很尊敬，这样呢，留在城里的名额就没有我的分了。好在我这个人天生乐观，也不怎么在乎，心想，有本事的话，有什么可怕的呢，大不了去别的城市。可是毕业那天我却傻了，原来全班３０多人只有我分的最差，去本市的一个县城下属的一个村小学，校长语重心长地对我说，支援农村建设，是最伟大的了，我操他妈，他怎么不去伟大呢。我后来才知道，学习还不如我的学生早就走了后门，只有我傻乎乎的。想一下，自己也２５岁的人了，怎么就这么不开事儿呢，没有办法，七月中旬，我就带上了自己的东西，坐上了去乡下的汽车。\n（二）辗转了好长时间，到了县城，在县城又等车，等了２个多小时，才有一辆小客车，我也不管那么多了，心想，今天怎么也要去看看那。车里面都是农村人，看着一个个脏兮兮的，我就倒胃口，而且还有一股酸味，好在我在大学的时候寝室的味道也好不到哪儿去，就这么将就吧。到了小张村，已经是下午５点多了，按着老师告诉的地址，我来到了村大队委员会。进门的时候，只看到门口有个打更的老头，我便走过去跟他说，“大爷，我是城里来的老师，请问，５小学怎么走啊？”那老头看了看我，道，“你就是城里来的老师啊，乡长跟会计等你一下午，也没见你过来，寻思你今天不来了呢，走，我带你去会计他们家，暂时还没给你安排住的地方，你知道，咱农村，条件不好。”我没说什么，心里实在是委屈极了，心想，我真他妈的是国家的好青年啊！跟着老头出发了，别看他岁数大，走得挺快，还帮我扛着一大包行李。大约半个多小时吧，就来到了李会计家。一进门，老头就吵吵道，“李大脖子啊，城里的老师来了，让我给你接回来了！”原来农村人都是有外号的，一个岁数不比老头小多少的小老头出来了，一出来就拉住我的手，“你是张老师？我们可把你等来了，我们小张村多少年了，可算来个有水平的老师，还是大学生！”我说，“李大爷客气了，我才毕业，没什么经验的。”李会计连忙说，“谦虚个啥，咋的还比不上我们村这些土豹子？”寒暄过后，我就进了会计家。一进门，看到一个妇人在那里生火，我年轻的心不禁一阵悸动，那妇人的屁股实在是太大了，又大又肥，看我进屋了，连忙站起来，说，“张老师来了，进屋！”我看她的脸，又禁不住一阵悸动，好秀丽啊，虽然满是沧桑感，却有一种成熟女人特有的韵味，让人百看不厌。令我吃惊的还有她的胸部，也是肥大异常，虽然前面垂了下来，但是却别有风骚，任何人看到都忍不住摸一把。我决定在这里做点文章，就问李会计，“李叔，这位怎么称呼啊？”李会计答道，“这是我媳妇儿，姓王，你叫她婶子吧。”我点头说，“婶子你好啊。”妇人的脸一下子红了，说，“你看人家城里人，多会说。”闲话少说，一转眼我们就吃过饭，虽然饭菜质量恶劣，但是我饿了一整天，也觉得很可口。吃饭的时候我不时盯着王婶那一对肥嘟嘟的大奶子看，我看得很隐蔽，没有人察觉。吃饭的时候我知道了村里的安排，学校要９月份才开学，村里暂时也没有安排我的住处，李会计家比较宽敞，就决定先住他家，村里一个月给他２００块钱补贴。我不知为什么，觉得这样的安排，实在是很如意，虽然如意的事情好少。\n（三）晚上我住在他们家的另一个房间，原来没有人住的，所以里面发霉，好在我适应能力特强，根本就不当回事儿，夜里的确很难入睡。我身高１７９厘米，体重１３０斤，要说也是个标准小伙子，长得也不赖，可惜大学就知道整天跟同学们胡混，对象也没找，学习也不好（跟现在很多在校大学生很像把）。２５岁了，还是个小伙子。不知怎么了，看到王婶儿，我的心就被抓住了，不仅仅是欲望，看到那女人秀丽的脸庞，我竟然有了爱的冲动。就这样，辗转反侧，直到３点多才睡着。\n面的白胸罩，我想，原来乡下女人也用上了这种高级货啊，她看我醒了，就笑着说，“我都进来看好几次了，你都睡着，就没招呼你。你们城里人都这么晚起来啊？”我笑了笑，不好意思从被窝里钻出来，因为我只穿着小内裤，而且早上鸟儿是比较硬的，让王婶看到多不好啊，就说，“婶子，你先出去一下，我穿上衣服的。”王婶笑着说，“有啥不好意思地，你才多大。”我就把裤子拿到被窝里穿，穿好了才光着膀子出来。王婶把洗脸水都给我打了进来，长这么大，第一次让人伺候，还真有点不习惯。李会计这时候以经上班了，家里只剩下我跟王婶，我们就聊天打发时光。本来我对于陌生人是不怎么说话的，可是由于我喜欢这个婶子，便千方百计的聊着。原来她叫王春秀，今年３８了，有２个儿子，都进城修车去了。我说，“孩子才多大啊，就进城干活了？”王婶说道，“有啥办法啊，农村地这么少，那俩大劳力闲着干啥啊，也不小了，一个２０，一个１７了。”我说，“婶子，你结婚真早啊？”她笑笑说，“农村不都是这样么！”王会计原来也是个读书的，后来文革期间被下放到他们村里，一直也没娶媳妇。最后好歹找了小他１５岁的王春秀，本来没有人给他的，可是王春秀出身也不好，那时候也只有对付了。好在两个人婚后倒是和和气气的，看起来挺幸福。转眼就到了中午，王婶开始生火做饭，我假意帮她弄柴火，却猿心意马的，王婶撅着她肥美的大屁股在那里烧火，我猫着腰，一下子头撞在她的屁股上，把她撞了一个跟头。我一下子扶起她，手不小心（真的是不小心）碰到了她木瓜一样的大奶上，不过马上拿开了。王婶脸有点红，说，“你这个愣小子，怎么不小心点呢？”我说，“真对不起啊，王婶，我这个人就是这样，我太该死了。”王婶笑着说，“你以后小心点就好了。”不久，李会计回来了，我们就在一起吃饭。吃完了，李会计又急冲冲地赶回了乡里。农村的下午实在是太热了，我只好脱下衬衫，穿起背心。王婶热得也很难受，竟然偷偷地把乳罩取了下来。我又来到她屋子，她正在炕上躺着看电视。看我进来，没有准备，大白胸罩还在旁边放着，她连忙起身，把胸罩掖在被底下。我觉得有点脸红，但是马上鼓励自己，这么爽的事情，你怎么不知道抓住呢！我有一句没一句地跟王婶搭话，她也没觉得有什么不妥当，因为毕竟穿着花衬衫。其实她出了好多汗，衬衫透明了，两颗大奶头示威一样地抖搂着，黑黑的，充满成熟女性的诱惑。我渐渐地把持不住，老二翘了起来。本来我想隐藏的，可是转念一想，为什么不打破这层窗户纸呢，我故意躺在了炕上，那里自然撅了起来。\n（四）正聊天呢，王婶往我这里一看，脸一下子红了，头一下子低了下来。就问，\n“李老师，你处对象了么？”我吃了一惊，心想这老娘们是猛，就说道，“还没有呢，在城里光顾着学习了。”王婶又问我，“没有合适的么？”我说，“婶子啊，跟你说实话吧，我不怎么喜欢小姑娘，反而喜欢成熟的女人。”王婶很吃惊，看着我说，“为什么啊？”我说，“我也说不好啊，就是这样。”王婶不吱声了，也不知道她在想什么。过了一会儿，我困了，就躺在炕上睡了过去。梦里面，王婶光着肥美的身子，大屁股一扭一扭的，对着我跳舞，两个大奶子像西葫芦一样往我大鸡巴上靠，那个骚样子，我实在是受不了。不知道什么时候，我醒了过来。一看钟，才睡了１个多小时。我起身看，王婶已经不知道哪儿去了。我一看机会挺好，连忙翻看被底下，那个诱人的胸罩还在那里，我连忙扣在脸上，深深地亲着，这时候我忽然听到门响，王婶回来了！吓得我连忙把胸罩塞在自己的裤子里，大鸡巴已经不听话地走出了内裤，龟头贴着胸罩，软软的。王婶进屋就说，“李老师你起来了，我刚才洗衣服，你有没有啥衣服要洗，都给我。”我红着脸说没有，王婶笑了笑，就翻被底下，明显，她是要洗奶罩。我连忙跑了出去，也不知道会有什么后果。王婶满脸疑惑地走了出来，也没好意思说什么，我也不敢说话了，就回屋看书。一会我发现，窗前的绳子上挂满了衣服，最让我奇怪的是有两条长长的，白色却黄黄的带子，不知道是什么东西。忽然想起，那就是女人来事儿的时候所用的月经带吧，城里人已经没有人用那个了。我一下子兴奋起来。我心想，王婶，你的大肥逼为我敞开一次吧！这仅仅是时间的问题。夜里，我偷偷地起身，来到了院子，刚准备偷王婶的月经带，却听到他们屋的门响，我连忙躺在在篱笆旁边，借着阴影藏起来。原来是王婶，她光着上身，两个葫芦一样的大肥奶挂在胸前，穿着一个大裤衩，可能农村人都是这样的装束吧，她还没睡醒，迷迷糊糊地来到我的前面，一下子扒下大裤衩，白花花的大屁股就冲着我的脸，我拼命往她屁股中间看，可是什么都看不清。她“哗哗”地开始撒尿，农村女人撒尿都有激情，那么响，我想，真的很够劲啊，这就是传说中的性爱女战士。一分钟左右，她才完事儿，抖了一下大骚逼，就穿上裤衩，回屋去了。我等了一会儿才起身，把一条月经带取了下来。我轻手轻脚地回到房间，用月经带缠住了自己的鸡巴，用力地磨着。心想，这就是婶子的肥逼啊，这么骚，婶子，我好爱你啊！\n（五）接下来的１０天里，我基本上没有什么机会，而且我这个人比较害羞，也不敢再有什么大胆的举措。这天接到了家里人的来信，说让我回去一趟，我心说好郁闷。听到我要回家一趟这个消息，王婶跑到我屋里来神秘地跟我说，“大兄弟，（称呼变了啊）婶子求你个事儿。你们城里有卖卫生棉的，你给婶子买回点来，干啥的你就别问了。”然后塞给我５块钱。我心说，我傻逼啊，我不知道干啥的。但是嘴上自然不会这么说。只是谦让说，“给婶子买点东西还要啥钱呢。”给推了回去。回到城里，我第一件事儿就是去商店，来到卫生用品专卖，买了２０块钱的卫生棉，营业员用奇怪的眼神看着我，我淫性浓浓，哪管得了这么多。接着我又来到新开的内衣商店，一进去才大开眼界，原来内裤可以做成绳子的！胸罩也是前开式的，我一急眼，买了５件小绳子一样的内裤，还买了女用的催情药。为了婶子，我是大出血啊！家里也没什么事儿，我第二天就赶回了乡下。回到婶子家，正好得知李会计有个美差，进城去学习一个月，说是学习，主要是溜达，这把李会计美的，根本就把我忘在脑后。一大早就跟着村里的腐败干部们出发了。这下我自由了。婶子看我回来，就把我拉进屋里，我看到她已经换上了一件白背心，竟然带着我偷走的那个胸罩！我的脸一下子紫红紫红的，羞得不知道怎么地好。还好王婶没说什么，就问我，“卫生棉你给我买回来了么？”我说，“王婶吩咐的，我就是死了也要去干啊！”王婶吃了一惊，我也吃了一惊，这明显是不自然的回答啊。我把一大包卫生棉交给了王婶，她羞羞地接了过去，放在炕上。我装傻一样地问道，“好婶子，这是干啥用的？”王婶抿嘴笑着说，“你不懂，别问了。”我说，“婶子最好了，就告诉我吧！”王婶毕竟是乡下妇女，就说，“女人来事儿的时候用的，你个大小伙子，打听这个干啥！”我不好意思吱声了。\n（六）好不容易熬到了傍晚，我们吃饭的时候，我偷偷地向菜盘里加了大剂量的催情药，我故意说这个菜我不喜欢吃，婶子也不客气，就都吃掉了。接下来还是看电视，县里的电视台没有什么节目，就放香港的录像，正好是个鬼片，我们都入迷地看着，忽然有一个恐怖的镜头！王婶“啊”地一声吓了够呛，我奇怪，怎么催情药没有用呢？王婶的脸不知怎么开始变红了，她跟我说，“大兄弟，我好热。”我说，“那你穿凉快点呗。”王婶说，“那你出去一下，我换衣服。”一分钟左右，王婶招呼我进去。原来她脱了裤子，换上了一条黄裙子，很旧的，不过很短，衬衫也脱掉了，穿着白背心。一般的女人这样的装束是正常的，可是王婶的大奶实在惊人，黑奶头看得一清二楚，奶子的形状也很迷人，她却不怎么知道。恐怖片看完了，很吓人，特别是在农村的夜里。王婶说，“大兄弟你要看你就看吧，我先睡了。”就开始铺被。我心想，完了，看来今晚上没戏。就知趣地走了出去。回到炕上，翻来覆去睡不着。大鸡巴硬邦邦地，不知怎么办才好。忽然我心生一记，我们不是看完恐怖片了么，我就吓唬她，看她怎么办。我悄悄地走了出去，在她的窗口下，轻轻地敲着。王婶果然紧张地问，“谁啊？”我不吱声，接着敲。王婶吓得不行了，连忙喊，“大兄弟！快过来！有鬼啊！”我偷偷跑进去，拿着内裤包装盒，进了王婶的屋子，问，“咋的了？哪儿有鬼啊？”王婶脸上绯红，估计是春药起作用了，也吓得不行。说，“我听到有人敲窗户，问他也不吱声，是不是鬼？”我说，“哪儿来的鬼啊，（只有色鬼）婶子别怕，咱俩唠会儿嗑就好了。”王婶说，“好啊，婶子今天不知道咋了，心绷绷直跳。”我盯着王婶的大奶头子直发呆，王婶不好意思了，说道，“大兄弟，你瞅啥呢！”我回过神儿来，连忙说，“没啥，没啥的。”夜黑，风高，大奶，独处。这会让人犯罪的。\n（七）呆了一会儿，两个人都没话。我忽然间鼓起勇气，说，“王婶，我进城给你买了一个礼物，你要么？”婶子看了看我，你还给我带东西了？给我看看。我闭着眼睛把包装盒递了过去，王婶迫不及待地打开一看，马上吵吵着，“哎呀妈呀，大兄弟，你咋给婶子买裤衩子呢？你咋这样呢！”我说，“好婶子，我觉得你这么漂亮的人，应该穿好看一点！这是美女应得的啊！”王婶脸红红的，说道，“啥啊，这多羞人，你让婶子咋穿啊？”我说，“好婶子，你现在就穿么，要不然你太对不起我的一片心了！”王婶低头想了一会儿，说，“大兄弟，我明白你的心，你偷婶子的奶罩，带子，我都知道，可我寻思你个大小伙子，咋能看上我这个老娘们呢，你就是图个新鲜。”我一下子趴在炕上，跟王婶说，“王婶，你不知道么，我第一眼就爱上你了啊，你是个美人，王婶，我好爱你啊！”王婶惊呆了，半天说不出话。我也兴奋了，无师自通地说，“婶子，你看在我的一片心上，今晚就穿我买的裤衩，让我看看吧，好么？”王婶想了一会，钻出被窝，拉上窗帘，说，“大兄弟，你人长得俊俏，又年轻力壮的，婶子不是死人，婶子为啥照顾你这么好？婶子今晚就不要脸一把，穿上你给的衣服吧！”说完她慢慢地脱下肥大的裤衩，一股浓郁的臊气扑面而来，我努力地闻着。王婶没有遮挡，把我向往已久的大肥逼展示给我，稀疏的阴毛，肥大的阴唇，红黑色的阴肉，都一览无遗。王婶红着脸，穿上了一件绳子内裤，由于婶子的逼太大，那小绳子都勒进骚逼里，外面只能看到大阴唇。她穿完了，说，“好兄弟，看够了吧，婶子要睡觉了。”这可能么？笑话。我喘着粗气说，“好婶子，我想亲你一口。”婶子说，“亲吧。”把嘴儿驽了过来。我也没多想，一下子咬住了王婶骚烘烘的大阴唇上！我没命地亲着，也不管有多么脏，舔着里面的阴肉，婶子一下子倒了下来，我一把抱住，拉开她的小背心，嘴在她的西葫芦奶子上啃着，大奶头啃的都是印子。婶子嘴里憋着，她不敢叫，因为怕人知道。我亲得差不多了，就来亲王婶性感的大嘴。王婶连忙挡住，说，“都是骚味，你漱漱口。”我急忙出去喝水，好好地漱了口，王婶在里面说，“给我打一盆水来。”我马上照办，把水端进屋里。王婶已经一丝不挂了，她幽幽地看着我，说，“大兄弟，你就欺负婶子吧，你既然这样，婶子也不要这老脸了。给婶子洗洗下身。”我笑着说，“婶子还真腼腆，什么下身，那是婶子的小逼啊。”王婶说，“啥都好，给婶子好好洗洗，都是尿。”我拿了毛巾，沾了清水，轻轻地擦着婶子肥厚的大逼，一边擦还一边抠着，马上，逼里就淫水泛滥，滑溜溜的。婶子闭着眼睛，轻轻地说道，“大兄弟，你就是婶子命中注定的男人，我这些天就知道要出事儿，想避免，又不想，弄得婶子每天湿乎乎的，今天终于被你欺负了！”我说，“好婶子，我是爱你啊，要不然，我才不会这样大胆呢。”接着我洗到了婶子的屁眼，我先抠抠，婶子笑着说，“你这坏小子，你扣屎哪？”我说，“婶子的屎都香。”我一点点地抠，扣的婶子直叫唤，说，“好兄弟，别整了，婶子让你干，婶子把大喳给你吃，婶子大逼都是你的，别扣了，大兄弟！”我一边口一边说，“好婶子，你最爱我哪儿啊？”婶子回道，“哪儿都爱！”我说，“不行，还得扣，到低爱哪儿？”婶子说，“真哪儿都爱啊，爱你大鸡巴！”我一下子就听到了想听得答案。就住手了。都清洁干净了，婶子淫荡地躺在炕上，肥奶在胸前耷拉着，大骚逼也示威似的冲着我。\n（八）疯狂了，２５年的童子身，就在这里终结了。我用大鸡巴头磨着婶子的逼口，婶子在下面吵吵，好兄弟啊，快操你姐吧，操死才好哪！我不管，接着引逗。她一下子推开我，起身抓起我的大鸡巴就塞进口里，一口口地吸入，吐出，唾沫润滑着我的龟头。我拼命坚持着，好在没有射，我又推倒她，挺起硬邦邦的大鸡巴，就塞进了王婶的大逼，两手摸着她的大肥奶，奶头子让我揪得通红。我说，“好婶子，你也成小姑娘了，奶头都红了。”王婶说，“去你的，你咋这么坏，看我捏碎了你的两个蛋。”我说，“婶子别的，那我怎么孝敬婶子了。”大约有１０多分钟吧，我觉得龟头一热，在婶子逼里射出阳精，湿乎乎低，也不知道射出了多少。婶子紧紧地抱住我，说，“大兄弟，你爱不爱婶子？”我说，“婶子，我爱你，我爱你大骚逼啊！”王婶疯狂地喊道，“大兄弟，我的逼以后就是你的，屁眼也是，大喳也是！”我趴在婶子的身上，仍然狠命地揉着她迷人的大奶，也许是因为强烈的刺激吧，马上我的鸡巴又硬了起来，婶子一下子站起来，让我躺在炕上，她用肥肥的屁股坐在我的脸上，黑黑的大屁眼打开，冲着我的嘴，说，“你要是爱我，就给我舔屁眼，要不然，我就告诉乡里，说你强奸我！”我说，“婶子，就是你不告诉我我也要舔！”我用舌头轻轻地舔着那美丽的大屁眼，那屁眼也很听话，自己一张一合低，配合着我的舌头。婶子那边也不老实，她用舌头轻轻地舔着我的卵子，我们就这样缠绵着。忽然，婶子又站了起来，说，“大兄弟，你打我！”我吃了一惊，怎么还有这种要求？可是婶子已经爬在炕上，撅起屁股，靠，屁股实在是太大了，像个洗脸盆一样。屁眼黑黑地看着我，骚逼大开，我也来了兴致，用巴掌在她的肥臀上拍打，她叫唤着，“你没吃饭哪！用力打！去，拿根筷子，塞我屁眼里！”我在性的氛围中为所欲为，马上找了根筷子，想都没想塞进婶子的屁眼，婶子叫了一声，“我好爱你啊，大兄弟！你是我老头！我让你操死我！”我听着这些，一下拔出筷子，用硬挺的大鸡巴塞进了婶子的大黑屁眼，好紧啊！婶子被突然袭击搞愣了，但是不愧是性爱战士，马上开始享受。疯狂中我不知道干了多长时间，只觉得嫂子的屁眼被我越干越松，大奶子让我抓了又抓，她的淫水淌了一次又一次，我们就在疯狂中昏昏睡去。第二天，我觉得鸡巴上暖暖的，起来一看，原来身子穿着裙子，没穿内裤，骑在我身上用肥逼磨我龟头呢。看我醒了，大嘴一下子亲上来，说，“好哥哥，你太坏了，昨天干得我屁眼子到现在还疼呢。”我说，“好媳妇，你也够骚的了。”婶子趴在我耳边轻轻地说道，人家说，“两个人要在一起，就要喝对方的尿，你快点撒尿，尿在碗里，婶子也尿，我用咱俩的尿做饭，咱俩吃了，就再也不分开了。”我一听有点犹豫，但是一想，尿的主要成分还是水，有点含氮废物，对身体没害的，就找来碗，在碗里尿了一泡尿，自然装不下，剩下的婶子不由分说，一下子用嘴裹住我的鸡巴，把剩下的尿咕噜咕噜喝了。睡了一个晚上，我也来劲了，一下子按倒婶子，嘴凑在她逼上，喊道，“我的小嫂子，你尿啊！”婶子的逼真听话，一下子尿了出来，浇我一头一脸。",
			"added": 1568728148,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "回家的火车",
			"body": "在度过了一个枯燥无味的大学第一学期的时候，我坐上了回家的火车。\n也许是暑期吧，火车出奇的爆满，我费了九牛二虎之力才勉强的挤上了火车。座位是没的了，更倒霉的是站到了车门口，想着两个小时的车程，我不觉更烦了起来。在车门即将关的时候，一个年约十八九岁的女孩跑了上来，上来后舒了口气道：”总算赶上了！“我定睛瞧了一下这个女孩，她穿了一件白色汗衫，胸前隐约可见她乳白色的胸罩，她的两只乳房不能算很丰满，但却极其坚挺，绽放着青春的气息，听她讲话的口音象是乡下的。”乡下女孩总是好占便宜。“\n于是我心中升起了罪恶的念头。\n我望了望周围，背对着我的是一个老大爷，旁边站着一少妇，不过也是背对着我，由于车挤，她的臀部不是摩擦着我，更激起了我强烈的性欲。\n我先升出一只贼手，轻轻的触碰了一下她的丰臀。她似乎也是以为车挤，而没有做出反应。我于是放大了胆子，把整个手掌按到了她的屁股上，一阵消魂的感觉进入我心里。她已明白是怎么一回是，但却只是皱皱眉头。\n我于是将手活动开来，在她的屁股上使劲柔捏，她已经面红耳赤了，脸上露出了恐惧的神色。我于是更贴近了一些，将一只手伸入了她的汗衫内，抚摩着她动人的肉体，也许是刚出完汗吧，她身上仍很湿。我将左手伸向了她胸前，她那对坚挺的乳房就这样被我肆意柔捏起来了。我索性解下了她的乳罩，两只手同时行动起来。我听到她开始喘着粗气，但却不敢吭一声。\n我用手指夹住她的乳头，她的乳头很大，在我的强烈刺激下，更加坚挺了。我感到我的阴茎已经将我的裤子顶得很高，于是我索性拉下了拉链，取出了我的小弟弟，此时我的小弟弟足有十四五公分。而龟头则已胀得通红。\n我拿回一只手将她的内裤拉下。然后抚摩着她的阴毛。她的阴毛很粗，想必是又黑又长。我顺势又进一步，撩开了她的裙子将阴茎插入了她裆间，我不知当时哪来的胆子，硬是将阴茎往她的阴道里插。她坚守着最后一块阵地，最后却将两腿夹着我的阴茎，阻止我更进一步，我的龟头触碰到她的阴蒂，而淫水则一股股的从她的阴道内流了出来，我感到了极大的刺激，只觉一阵快感，一股精液喷射而出，全喷到了他的裙子上。\n正当我抽回阴茎准备穿裤子的时候，猛的发现旁边的少妇正回头瞧着我。她冲我嫣然一笑，突然就伸手抓住了我的阴茎，我一时还没回过神来，她却大胆的将我的阴茎含进了嘴里了，并且用力吮吸起来。她翻开了我的包皮，用舌头拼命添着我裸露的龟头，我的小弟弟又挺了起来。这次似乎更加长。这风骚的少妇看来也很吃惊，然后又将自己的短裙掀起。脱下了黑色的内裤，我用手忍不住去摸她早已湿淋淋的阴道，和那坚停异常的阴蒂，她引导我的阴茎进入她体内，我俩于是就这样干了起来。我的手当然没闲着，搓捏着她那双硕大的奶子。闻着她诱人的体香，听着她淫荡?\n旁边的女孩似乎目睹了这一切，垂着俏脸，手却擦着我流下的精液。",
			"added": 1568728324,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "火车上的故事",
			"body": "我要说的一次是我前个月我在。\n我在那几天心情很不好就一个人做火车到老家去看奶奶，一上车我就发现了两个够劲的：一个嫂子，一个象小家碧玉的MM。我就喜欢这两中的，顿时就要有点硬了，我故意挤到那嫂子模样的旁边，车上人好多，一排做了4个人，我把她挤得紧紧的，很舒服啊，她的大腿很有弹性的，又软。天快黑了，我发现那个小家碧玉做在我后面，在不知不觉中我的小鸡鸡就硬了年轻的时候总是很冲动的，天气热，坐在小嫂子旁边我的鸡鸡把裤子顶得好高，没办法，幸好人多也没人注意的，我总想摸那嫂子的屁屁，就是有点不敢啊，天要黑的时候那嫂子不知怎么出去上WC一去一回，看到我顶得很高的裤子，用他的屁股把我蹭了两下，好爽，我就胆大了，我悄悄地把手伸到她的腰后面，在捏她的大屁股，脚在下面去探她的腿，开始我还试探，发现她不太愿意的，我就把他往里面挤，干脆就一把手伸到她的下面我靠，好软哦，只有一点点的湿，她不敢看我装做如无其事地看外面，周围很多人，我感觉她在抖双腿夹紧，不让我往里面进，我也没办法啊，不敢太搞哪个了，不过她的下面开始湿了，我弄她的阴毛很稀的，慢慢得她要揣吸，呼吸很急，我的一个手指都插进去了，还有点紧的一会她就很湿了。不过没一会她就挣脱了我，下了。我手上还有她的味道，真是不爽啊，我的鸡鸡要爆了。\n天很快就黑了，我开始注意那个小家碧玉，她的身材一般，却很若人爱的。\n到半夜的时候机会出现了我，发现那小家碧玉去上厕所，我就马上跟过去，忍不住就从后面摸住搂她的小乳房，她突的一叫幸亏是晚上半夜一两点的时候，她一头钻进厕所就把门反锁了，我气极了，没办法，我就蹲在一边角落里。\n在我就要不想等的时候她出来了，还偷偷望了一下，她没看到我！她出来了，还整了整百色的裙子，转身想走了，我一把冲起，捂住她的腰，她的嘴，把她掳到侧面的阁间里面，我用腿压住她的阴部，埋头就咬啊，亲啊，她的咪咪虽小却是往上翘的，我的手插到她后面死捏她的屁屁，好爽啊，她还反抗，我就想吻她，她两边扭，我想这样下去不行，我狠狠把她的裙子往下扯，在就是内裤，她想叫救命，却不太敢，是怕丢人吧，我终于把她的内裤扯下了一点，我有点使劲的拔她的阴毛，手指往她阴道里轻插，捎带着好咬她的左右乳房，是少女的那种，好柔、有沁香的。一会我就把我早就等得不耐烦的棒子杀进去，好紧啊，阴道把我夹得紧紧地，实在是....我不知道会怎样我发觉她哭了，我也收到了影响，在火车的摇晃里做爱很爽，啊，随着有规律的摆动，我把她按在壁上，一个劲的抽插，她开始呻呤了叫了几声，又怕是不好意思了，我不了解站着还有什么姿势，好遗憾，想口交的可是她哭了，我不知道怎么办了，就扶她到座位上坐着，和她说话她不理我，我只好抚摩她，这时候她到不反抗，我不停的吻她的脸她的脖子，她的胸膛，她的豆萁眼，她的大腿.....我把她的手拉到我的鸡鸡那，她轻握了一下，很不好意思的，我说“你试试啊”她稍微的的笑了，埋头试探的添了几下，我乘她不注意往她口一塞，好爽啊，她的嘴很小我在里面很自在\n哦！\n后来她睡在我的怀里了，好幸福啊，可是第二天我醒来的时候，她已经不见了！\n我在也没有见到她了，我仍然想念她身上的味道！",
			"added": 1568728359,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "那是一个暑期",
			"body": "那是一个暑期，因为长假，想去游览祖国的大好河山。也可考验一下自己独立生存的能力，于是就背起行囊闯天下去了。\n我从一个城市流浪到另一个城市，这期间增加了很多阅历。有一次我在一个小镇的旅馆住宿，看到了这样一场戏：那是我半夜上厕所，走过一个半掩着门的房间，听到里边有女人发出的“嗯嗯”的声音，好奇心使我想看一看发生了什么事，我小心的推开房门，尽可能不发出声音。我看到一个光着身子的男人前后摇动着，他的鸡巴在一个鲜红的小穴中进出，只见进去时整根没入，小穴深深的陷入，出来时小穴向外翻，一个女的半躺在床上，两只腿高高搭在男人肩上，屁股随男人的摆动而上下，看的我的‘二弟’硬硬的。只见那男的动着动着突然加快了动作，女的叫声也大了起来，还“啊、啊”的叫。这时，那男的扒在女的身上，动也不动，女的也双手紧抱着男的，一会儿，那男的起身，随着他起来，女的小穴中流出乳白色的液体，鸡巴也小了很多。这时那女的说了句“门都没关上。”吓的我干紧走了。但从这以后，我就到处找书，学了不少这方面的知识，只是没有实践的机会。\n不觉假期就快到了，我从西北的一个小城回家，好不容易才上了火车。这是一列慢车，每站都有不少人上来。我因为车厢里味太难闻，就挤到了车门口。突然觉得肘子碰到一个软软的东西，我回头一看，一个女孩红着脸站在我身后，原来她也闻不了车厢里的味，跟着我挤了出来。因为跟的太紧，不小心被我碰到胸口了。通道的口在我身后开着，把车门口这地方隔成一个小天地。因为车太慢了，我无聊的和那女孩聊起天，她说她姓马，叫英子，今年十七岁，因为听人说大城市钱好挣，就出来打工了，这是第一次出门。整聊着，火车又到了一站，又上来了一帮人。我都快被挤扁了，好不容易火车开出站，通道门再一次隔开，我突然觉的胸口被两个软软的东西顶着，这才发现自己刚才是紧紧的压着英子，只见她红着脸，低着头，不好意思看我。我不觉心中一动，小弟弟竟慢慢硬了起来，英子也发现我不但没松开，小腹下面竟感觉有个硬硬的东西顶着，这是从来没有过的感觉，惊慌的抬起头来看我，我看着那红润的嘴唇，猛的低下头亲了上去，英子从没经历过这种事情，一下子呆住了。我根据书上说的，轻轻的咬着她的嘴唇，先慢慢的，然后用舌头去舔开她的牙齿。这时她好象发觉什么以的乱摇头，我只好用双手紧紧抱着她的头，只见她“呜呜”了几下，我的舌头还是侵入了她的口中，她也一下子不叫了，用双手紧紧抱着我的头，这时我空出一只手悄悄的从她背部向下滑，在她的股沟间轻轻滑动，而前面我的小弟弟紧紧的贴着她的小腹。这时她好象清醒了过来，头向后昂着想要离开我，我借机亲上她的脖子，在我的亲吻下，她口里一边说不要，一边紧紧的抱着我。我顺势咬上了她的耳垂，只觉的她身子一颤，把我猛的向外推，一边说不要。我放弃了亲她，但还是紧紧的抱着。我问她，刚才有什么感觉，她什么也不说。但也不再推我了。我问她是不是从来没有被男孩子这样过，是不是想知道下边顶着她小腹的硬硬的是什么东西，她一边摇头说不要，一边好奇的向下看。我说，看是看不到的。说完我拉着她的手向下摸去，她一边动着说不，手却顺着我向下，这时我拉下拉链让她的手进去，她那软软的手刚碰到我硬硬的、热热的小弟弟时，猛的一缩，说不要。我拉着她的手，把它硬按了上去，然后用双腿紧紧挟住。不一会儿，她就不动了，而我的小弟弟从裤子里放出来后，刚好顶在她小腹下凹下去的地方，隔着裤子我也感觉到了那里的热度。英子一脸的惊慌，不知道怎么办。这时，我想起书上写的，把手从她的裤腰上摸了进去，贴着皮肤摸着她的屁股，她说着不要，一边去拉我的手，这时，我另一只手从她的胸口摸了进去，搓着她的乳房，她一下子不知怎么办了，哭着说不了要。我在她耳边轻轻说，这不是很好，你一会儿就会体验到做女孩的好处了。这时我的一只手慢慢的挖着她的屁眼，一只手搓揉着她的乳房，不一会儿，她的乳头变硬了，而下边我感觉到更热了。我看着她的脸，只见眼中的泪水还在，只是多了一些媚态。我说，要我停手也行，只要她让我的小弟弟舒服了，她只好点头答应。我放开她，让她用手去安慰我的小弟弟，用双手不停的套动，可是好象不见效果。“用你的舌头来”，我一边用手抚摸着她的乳房一边说。“不行，”她说。我说，不行的话我来舔你。这话吓了她一跳，只有说不会。我说，你吃过棒冰没有，就象那样慢慢舔。在我的威吓下，她只好用舌头慢慢舔着，在她的舌头下，我的龟关一颤，好象越来越硬了。我要她把龟头含在嘴里，她也做了，这时，我觉的小弟弟要炸了，看着含着我的小弟弟的她，我猛的一把拉起，她张着嘴不知怎么回事，我一边用口对上她的口，一边拉下了她的裤子，她挣扎着，但这更让我兴奋，我用一只手抓住她的两只手，把她的裤子拉到膝下，我用手摸她的阴户，嫩嫩的象水豆付，外边有几根软软的毛，中间有一条缝，还是湿湿的，我用手指摸进缝中，感觉到里面暖暖的，很是舒服，而上边有一个小豆豆，我用手指搓揉着它，那缝里就有水流出来。这时，英子也不动了，好象是认命了。我用龟头对了几次，对进不去，好象因为龟头的热量，英子又流出了不少水，最后，我用手扶了一把，龟头才进入那缝中，英子嗯了一声，向后缩了缩，但后边是厢壁，我用力向前顶着，只觉的龟头很紧的进入一条缝中，不一会儿，感觉到有个东西担在前面，我一用力，只听英子啊了一声，我问怎么了？英子不出声。我也不敢动了，过了一会儿，只觉的那里面湿湿的，不断有水出来，英子不停的动着屁股，我说怎么了。英子红脸不说，只是屁股向前顶了顶，我小心的把鸡巴全部顶了进去，看见英子一脸的痛苦的样子，我感到很难过，可是鸡巴被夹的紧紧的好舒服，过了大约五分钟，英子又开始磨屁股了，随着她的左右摆动，我也不客气的出击了。我紧紧抱着她的屁股，前后摆动着，只见她开始随着我的摆动也前后运动着。我低下头，看见我的硬棒在阴户中出来时，带出鲜红的阴唇，进去时，又带了进去，这种刺激让我很兴奋，很快就在英子里面射了。我紧紧的抱着她几分钟后才分开，我问她，好不好。英子哭着不说话，我知道女孩子是一定要哄着的。我说，女孩怎么都是一回事，是我的错，可是刚才谁先摇屁股的。英子不说话。我一边说，一边抚摸着她的身体，不一会儿，我的小弟弟又有反应了。这时，英子也不哭了。我说，你看，它又起来了。来给你消气来了。英子用手恨恨的拈了一把，我让她用嘴来亲亲，她说，才不呢，可是还是用嘴去舔了。我看见先前射进她体内的精液顺大腿流，我说一会一定让你吃饱。",
			"added": 1568728400,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "欲望列车",
			"body": "看着站台上拥挤的人群，诗晴微微皱起眉头。每天朝九晚五的ＯＦＦＩＣＥ工作，上下班\n拥挤的人潮，这样平凡的日子……诗晴一直坚信，自己不会永远属于这样的生活。\n虽然不是明星般的美貌，诗晴也曾经是大学里男孩们注目的对象。⒈⒍⒌的苗条身材、\n修长的双腿和纤细的腰肢、清丽的相貌和含羞知性的性格，诗晴的意识中，觉得自己更应该是\n个高傲的公主……\n诗晴并不是那种虚荣而浅薄的女孩。当同龄的漂亮女孩都忙着攀龙附凤的时候，诗晴的\n大学时光都是在课堂和图书馆里度过的。\n羡慕财富而去依附于陌生男人，诗晴认为那是最愚蠢的做法。青春的美丽转眼即逝，陌\n生男人的心轻浮而又善变，诗晴要凭着才干和努力，开创自己的财富和事业。美丽而威严的总\n裁、独立又性感的女人，是诗晴心中的梦想。\n毕业后加入了这家跨国大公司，当然只能从最下面的职员作起，诗晴立刻开始了自己的\n奋斗。\n丈夫是快毕业时才认识的同学。也是毫无背景和依附的普通人，可是诗晴欣赏的是，他\n和自己一样，有坚持苦干的毅力和决心。虽然不是贵族的后裔，我们一定会成为贵族的祖先。\n为着这个目标，丈夫新婚三个月后就去他公司的海外分部工作，到这个月已经快一年了\n罢。最苦的地方有最大的机会，诗晴毫无怨言的支持着远方的爱人。虽然如此，但夜半醒来的\n时候，诗晴有几次也突然感到无边的寂寞。窗外月光如水，轻抚身边空荡荡的床，诗晴忽然发\n觉全身都在鼓胀，发烫。越是拼命不让自己去想，诗晴越不由自主地想起那新婚三个月的甜蜜\n的疯狂……丈夫是诗晴洁白的生命中唯一的陌生男人。\n那些疯狂的夜晚，诗晴第一次知道，自己的身体里，竟蕴藏着如此让人迷醉的快乐。这\n种时候，诗晴会禁止自己再想下去。实在无法入睡，诗晴干脆打开公文包，用第二天的工作来\n占住自己的头脑。\n一个人的日子很孤单。但是诗晴过的很平静。平时公司里不乏男同事挑逗诗晴，诗晴一\n概回应以淡淡的拒绝。虽然诗晴不能否定自己偶尔夜半的迷乱，但是诗晴坚定的认为，自己应\n该忠实于爱情。女人，一生都应该坚持自己的纯洁。贞洁的身体，只能属于爱人。\n自己是个古典的女人罢，诗晴的嘴角，浮起一丝淡淡的笑意。\n古典的诗晴，并不知道，危机已经潜伏在她的身后。\n进站的车打断了诗晴的思绪，诗晴半麻木地拥在人潮中挤向车门。据说沿线有交通事故\n，今天的车晚点了⒉０分钟，又是高峰时间，人多得上车都困难。背后人群涌动，一支手几乎\n环在诗晴腰上，用力地将诗晴拥推向车内。就在上车的瞬间，另一支手迅速地撩起诗晴的短裙\n，插进诗晴修长的两腿之间。\n「啊……」突然的袭击，诗晴发出短促的惊呼，可是诗晴的声音完全淹没在周围的嘈杂\n中。\n还来不及作出反应，诗晴已身不由己地被人流拥入车厢。后续的人群不断挤进，环抱着\n诗晴腰部的手有意控制，诗晴被挤压在车厢的拐角处，面前和左侧都是墙壁。人群一层层压过\n来，背后的人已经完全密合地贴压住诗晴曲线优美的背臀，诗晴被挤压在墙角，连动都不能动\n，裙内的手已经覆上了诗晴圆润滑嫩的臀峰。\n为了避免超短裙上现出内裤的线条，诗晴一向习惯裙下穿Ｔ字内裤，也不着丝袜。对自\n己信心十足的诗晴，总认为这样才能充份展现自己的柔肌雪肤，和修长双腿的诱人曲线。因此\n而近乎完全赤裸的臀峰，无知地向已全面占领着它的入侵的怪手显示着丰盈和弹力。\n「色狼！」几秒钟的空白后，诗晴终于反应过来。可是这要命的几秒钟，已经让陌生男\n人从背后完全控制了诗晴娇嫩的身体。\n诗晴不是没有过在车内遭遇色狼的经历。通常诗晴会用严厉的目光和明确的身体抗拒，\n让色狼知道，自己并不是可以侵犯的对象。可是现在，诗晴在背后的陌生男人巧妙地控制下，\n即使想用力扭头，也无法看到背后。\n周围的墙壁和身侧的人群，也彷佛色狼的合谋，紧紧地挤住诗晴，使诗晴的身体完全无\n法活动。而且，今天这个陌生男人如此大胆的直接袭击，也是诗晴从来没有遇到过的。\n一时间，诗晴的头脑好像停止了转动，不知道怎样反抗背后的侵袭。空白的脑海中，只\n是异常鲜明地感受到那只好像无比滚烫的手，正肆意地揉捏着自己赤裸的臀峰。有力的五指已\n经完全陷入嫩肉，或轻或重地挤压，好像在品味美臀的肉感和弹性。\n左手抓着吊环，右手紧抱着公文包，诗晴又急又羞，从没有和丈夫以外的陌生男人有过\n肌肤之亲，此刻竟被一个陌生男人的手探入了裙内禁地，诗晴白嫩的脸上，不由地泛起一片绯\n红。\n端庄的白领短裙下，丰盈雪白的大腿和臀峰正被陌生的大手在恣情地猥亵。浑圆光滑的\n臀瓣被轻抚、被缓揉、被力捏、被向外剥开、又向内挤紧，一下下来回揉搓，诗晴的背脊产生\n出一股极度嫌恶的感觉。可是要驱逐那已潜入裙下的色手，除非自己撩起短裙……\n诗晴无比羞愤，可被紧紧压制的身体一时又无计可施。全身像被寒气侵袭，占据着美臀\n的灼热五指，隔着迷你Ｔ字内裤抚弄，更似要探求诗晴更深更柔软的底部。\n「够，够了……停手啊……」诗晴全身僵直，死命地夹紧修长柔嫩的双腿。\n就在这时，背后的陌生男人突然稍微离开了诗晴的身体，紧扣在诗晴腰部的左手也放开\n了她。\n「莫非……」诗晴从被紧迫中稍稍松了一口气，难道突然间有了什么转机？\n完全没有喘息的机会，随着车启动间的一晃，诗晴马上明白自己想错了。那支左手又紧\n扣住了诗晴。这次，有充裕的时间来选择，那支手不再是隔着诗晴的套装，而是利用她左手上\n拉吊环，从被拉起的上装和短裙之间探入，扣住在诗晴裸露的纤细柳腰，滚烫的掌心紧贴诗晴\n赤裸的雪肤，指尖几乎已经触到了诗晴的胸部。\n陌生男人的身体同时再次从背后贴压住诗晴的背臀，诗晴立刻感觉到一个坚硬灼热的东\n西，强硬地顶上自己的丰臀，并探索着自己的臀沟。\n「太过份了……」诗晴几乎要叫出来，可是诗晴惊讶地发现，自己竟然叫不出声音。\n初次遭遇如此猛烈的袭击，纯洁的诗晴全身的机能好像都停滞了。从上车到现在，也许\n只有半分钟吧，诗晴却彷佛遭遇了一个世纪的噩梦。\n坚挺灼热的尖端，已经挤入诗晴的臀沟。陌生男人的小腹，已经紧紧地从后面压在诗晴\n丰盈肉感的双臀上。从过去的经验，诗晴立刻知道，背后陌生的陌生男人，正开始用他的阴茎\n淫亵地品尝她。\n「下流……」诗晴暗暗下着决心，决不能再任由陌生的陌生男人恣意玩弄自己纯洁的肉\n体，必须让他马上停止！\n可是……和过去几次被骚扰时的感觉有点不一样……透过薄薄的短裙，竟会如此的灼热\n。双腿根部和臀部的嫩肉，在坚挺的压迫下，鲜明地感受着陌生的阳具的进犯。粗大，坚硬，\n烫人的灼热，而且……柔嫩的肌肤，几乎感觉得出那陌生的形状。\n陌生的，却感觉得出的龟头的形状！已经冲到口边的呐喊，僵在诗晴的喉咙深处。\n刚才陌生男人放开她，原来，是去打开裤链，掏出了他的阴茎！现在，陌生的陌生男人\n是用他赤裸裸的阴茎，从背后顶住了她。如果叫起来，被众人看到如此难堪的场面……只是想\n到这里，诗晴的脸就变得火一样烫。\n刚刚提起的勇气，立刻就被陌生男人这肆无忌惮的淫行击碎了。如果扭动身体，还可能\n被对方认为是在享受这种触感，诗晴想不出抗拒的办法。\n「够了……不要了……」心砰砰地乱跳，全身都没有了力气，诗晴几乎是在默默地祈求\n着背后那无耻的袭击者。\n可是陌生男人的进犯却毫无停止的迹象，潜入裙内的右手早已将诗晴的内裤变成了真正\n的Ｔ字形，赤裸的臀峰在揉搓和捏弄下，被迫毫无保留地展示着丰满和弹力，又被用力地挤压\n向中间。诗晴知道，陌生男人是在用她丰盈的臀部的肉感，增加阴茎的快感。\n诗晴嫩面绯红，呼吸急促，贞洁的肉体正遭受着陌生男人的淫邪进犯。充满弹性的嫩肉\n抵不住坚挺的冲击，陌生的阴茎无耻地一寸寸挤入诗晴死命夹紧的双腿之间。好像在夸耀自己\n强大的性力，陌生男人的阳具向上翘起成令诗晴吃惊的角度，前端已经紧紧地顶住诗晴臀沟底\n趾骨间的紧窄之处。\n最要命的是，诗晴不像一般的东方女性腰部那么长，修长的双腿和纤细的柳腰，臀部的\n位置像西方女性一样比较高。过去诗晴一直以此为傲，可是现在，诗晴几乎要恨自己为何会与\n众不同。一般色狼从后侵袭，最多只能顶到女性臀沟的位置。可是对于腰部较高的诗晴，陌生\n男人的阴茎高高上翘，正好顶在了她隐秘的趾骨狭间。\n隔着薄薄的短裙和内裤，陌生男人火热坚硬的阴茎在诗晴的修长双腿的根部顶挤着。两\n层薄薄的布根本起不到作用，诗晴感觉着陌生男人那粗大的龟头几乎是直接顶着自己的贞洁花\n蕊在摩擦。从未经历的火辣挑逗，诗晴的心砰砰乱跳，想反抗却使不出一点力气。粗大的龟头\n来回左右顶挤摩擦嫩肉，像要给诗晴足够的机会体味这无法逃避的羞耻。\n「好像比老公的龟头还要粗大……」突然想到这个念头，诗晴自己也吃了一惊。正在被\n陌生的色狼玩弄，自己怎么可以有这种想法。\n这样想的时候，一丝热浪从诗晴的下腹升起。被粗大滚烫的龟头紧紧压顶的蜜唇，也不\n自主地收缩了一下。\n「不行！……」诗晴立刻禁止自己的这个一掠而过的念头。\n想到爱人，诗晴好像又恢复了一点力气。诗晴努力着把腰部向前，试图把蜜唇从陌生男\n人的硬挺烫热的龟头上逃开，陌生男人没有立刻追上来。\n还没来得及庆幸，双腿间一凉，陌生男人又压了过来，这下诗晴被紧压在墙壁上，再没\n有一点活动的馀地。\n诗晴立刻发现了更可怕的事，陌生男人利用诗晴向前逃走的一瞬间，在诗晴短裙内的右\n手把诗晴的短裙撩到了腰上。这回，陌生男人的粗大阴茎，和诗晴的裸露的大腿和臀部，完全\n赤裸地接触了。\n诗晴全身的肌肉，一下子完全绷紧。像一把滚烫的粗大的火钳，陌生男人的阴茎用力插\n入诗晴紧闭的双腿之间。这次比方才更甚，赤裸的皮肤与皮肤、肌肉与肌肉，诗晴鲜明地感受\n到陌生男人的坚挺和粗大。\n诗晴觉得自己的双腿内侧和蜜唇的嫩肉，彷佛要被烫化了一样。一阵阵异样的感觉，从\n诗晴的下腹扩散开来，就像……接受老公的爱抚……\n「天呐……」\n陌生男人的腿也贴上来了，左腿的膝盖用力想挤进诗晴的双腿间。陌生男人也发现了诗\n晴的腰部较高，他想把诗晴摆成双腿叉开的站姿，用阴茎直接挑逗诗晴的蜜唇。\n绝对不能那样！发现了陌生男人的淫亵企图后，诗晴用尽力气夹紧修长的双腿。可是，\n没一会儿，诗晴就发现自己的抵抗毫无意义。\n把诗晴紧紧地压在墙壁上，一边用身体摩擦着诗晴饱满肉感的背后曲线，一边用小腹紧\n紧固定住诗晴的丰臀。陌生男人微微前后扭腰，在诗晴拼命夹紧的双腿间，缓慢地抽送着阴茎\n，品味着诗晴充满弹性的嫩肉和丰臀夹紧阴茎的快感。\n「啊……」发现自己夹紧的双腿好像在为陌生男人提供臀交，诗晴慌乱地松开双腿。陌\n生男人立刻乘虚而入，左腿马上插入诗晴松开的双腿间。\n「呀……」诗晴发觉上当，可是，被陌生男人的左腿插入中间，双腿再也无法夹紧。\n陌生男人一鼓作气，右手改绕到诗晴的腰前紧搂住诗晴的下腹，右腿也硬插入诗晴双腿\n之间，两膝用力，诗晴「呀」的一声，两腿已被大大地分开，这下诗晴已经被压制成彷佛正被\n陌生男人从背后插入性交的姿势。\n陌生男人的阴茎直接顶压在诗晴已成开放之势的蜜唇上，隔着内裤薄薄的丝缎，粗大灼\n热的龟头无耻地撩拨着诗晴纯洁的蜜唇。\n「不要啊……」诗晴呼吸粗重，紧咬下唇，拼命想切断由下腹传来的异样感觉。\n陌生男人的阴茎好像比一般人要长，很轻易地就能蹂躏到她的整个花园。随着陌生男人\n的缓慢抽送，巨大的火棒一下又一下地压挤着诗晴隐秘花园的贞洁门扉，彷佛一股电流串过背\n部，诗晴拼命地掂起脚尖，差一点叫出声来。\n陌生的阴茎不知满足地享用着诗晴羞耻的秘处。压挤到最深的部位，突然停止动作，那\n是蓓蕾的位置，像要压榨出诗晴酥酥麻麻的触感，粗大的龟头用力挤压。\n「啊！不……不行！」诗晴的内心深处暗自发出惨叫声，身子轻微地扭动，彷佛要闪避\n对重要部位的攻击般，猛烈地扭动臀部，然而粗大的龟头紧紧压住不放。\n「那里……不行啊！……」诗晴拼命地压抑几乎要冲出口的喊叫声，在满载着人的车厢\n里竟遭到这样的猥亵……憎恶、屈辱、即使如此仍无法表达内心的羞愤与绝望。\n色情的侵犯并没有停止，紧箍住纤细腰肢的左手继续进袭，趁着列车摇晃之际，从诗晴\n背后绕过腋下的左手，缓缓地往上推起诗晴的丝质胸罩。\n「不要啊！竟然明目张胆地侵犯……！」\n自尊心作祟无法求救，害怕被人看见如此窘迫的模样，诗晴左手放开吊环，企图隔着套\n装拼力阻止陌生男人的手，可是诗晴的力气终究无法抵敌强悍的入侵者。\n「啊……」诗晴低声惊呼。还没来得及作任何反应，陌生男人已经将她的丝质胸罩向上\n推起，胸峰裸露出来，立刻被魔手占据。柔嫩圆润的娇小乳房马上被完全攫取，一边恣情品尝\n美乳的丰挺和弹性，同时淫亵地抚捏毫无保护的娇嫩乳尖。\n「呀……」诗晴急忙抓住胸前的魔手，可是隔着外衣，已经无济于事。\n陌生男人彷佛要确认丰胸的弹性般贪婪地亵玩诗晴的乳峰，娇挺的乳房丝毫不知主人面\n临的危机，无知地在魔手的揉捏下展示着自己纯洁的柔嫩和丰盈。指尖在乳头轻抚转动，诗晴\n能感觉到被玩弄的乳尖开始微微翘起。\n「千万不能啊！」诗晴俏脸绯红，紧咬下唇，拼命地用力想拉开陌生男人的色手。\n像有电流从被陌生男人的玩弄的乳尖在扩散，自己怎能对如此下流的猥亵有反应……可\n这怎能瞒过老练的色狼？陌生男人立刻发现诗晴的敏感乳尖的娇挺。见诗晴死守胸乳，于是腰\n腹微微用力，占据在诗晴那紧窄的方寸之地的粗大坚挺的龟头，再度挤刺诗晴的蜜源门扉。诗\n晴全身打了个寒颤，毛骨悚然，粗大的龟头好像要挤开诗晴紧闭的蜜唇，隔着薄薄的内裤插入\n她的贞洁的女体内。\n诗晴拼命向前逃，可惜前面是坚硬的墙壁。顾此失彼，陌生男人阴谋得逞，诗晴樱桃般\n的娇嫩乳尖瞬间完全落入色手。不断地肆虐着毫无防卫的乳峰，富有弹性的胸部不断被捏弄搓\n揉，丰满的乳房被紧紧捏握，让小巧的乳尖更加突出，更用拇指和食指色情地挑逗已高高翘立\n的乳尖。\n诗晴满脸绯红，呼吸急促，头无力地倚在死命抓着吊环的左手臂上，更显得雪白的玉颈\n颀长优美。敏感的乳尖在陌生男人老练的亵玩下，一波一波地向全身电射出官能的袭击。贞洁\n的蜜唇被粗壮的火棒不断地碾压挤刺，诗晴绝望地感觉到，纯洁的花瓣在粗鲁的蹂躏下，正与\n意志无关地渗出蜜汁。\n得意地猥亵着身前成熟俏丽的职业女郎，品味着女郎羞愤交加、拼命忍耐性感冲击的娇\n姿，陌生男人的脸几乎紧贴上诗晴的玉颈耳边，开始对诗晴进行更大胆的挑逗和更无耻的蹂躏\n。耳边传来粗重的呼吸，陌生男人嘴里的热气几乎直接喷进了诗晴的耳朵。巧妙地利用身体隔\n断周围人们的视线，陌生男人开始吮吸诗晴的耳垂和玉颈。\n抓住吊环的手指因用力而发白，睁不开眼，诗晴死咬住唇忍受着这情人般的却邪恶的爱\n抚。陌生男人腰上用力，粗大的龟头慢慢地在诗晴的蜜唇上滑动，突然猛地一顶。\n「啊……不要……」诗晴喉咙深处发出几乎听不到的祈求。\n注意力集中在来自身后的攻击时，陌生男人早已潜伏在诗晴下腹的右手，探进Ｔ字内裤\n的边缘，抚上诗晴光洁细嫩的小腹，探向诗晴隐秘的草地。\n「那里……绝对不行啊……」右手抱着公文包，左手要去救援，又被陌生男人插入腋下\n的手拦住。两手都无法使用，诗晴只有死命地把下腹向前贴住墙壁。\n根本无法抵御强悍的入侵者，铁蹄顺利地践踏上从不对外开放的草地，又从容地在花丛\n中散步。猥亵地轻咬住柔嫩的耳垂、用力捏握丰挺的乳峰、小腹牢牢压住诗晴的腰臀、更加粗\n涨的阴茎紧紧顶压在诗晴的花园口，然后，右手向草地的尽头开始一寸寸地探索。\n被死死挤压在墙壁上双腿被大大撑开的诗晴，贞洁的圣地早已全无防卫。陌生男人并不\n急着攻占端庄的白领女郎最圣洁的谜谷，而是慢慢地玩弄已无路可逃的猎物，恣情地享受着眼\n前这冰清玉洁的美丽女郎。当贞洁的圣地被一寸一寸地侵入那羞愤欲绝的挣扎，更能满足陌生\n男人的高涨的淫欲。\n诗晴的口中发出嘶哑的呜咽声，然而，混杂在列车行驶声音纷扰的环境中，声音根本就\n听不见。整个身子血脉贲张，脑中空白一片，急促的喘息声，身体火热。高跟鞋内的美丽脚趾\n因用力而扭曲，可是想夹紧双腿的努力完全徒劳。\n「啊……」诗晴喉底哽住低呼，全身僵硬，火热的指尖缓慢而不可抗拒地侵入了。\n诗晴曲线优美的背僵直成一条绝望的弓，从未向第二个陌生男人开放过的纯洁禁地，正\n开始被那卑污的陌生手指无耻而色情地亵玩着。一直坚持到今天的贞操、从小就小心翼翼地保\n护着的纯洁，竟在这大庭广众之中，被这陌生的陌生男人如此无耻地猥亵、蹂躏。\n连面孔都还没有看到，根本不知道是谁的陌生男人，如此下流无耻的动作。拼命想切断\n那里的感官，可是身体固执地坚持工作。娇嫩的蜜肉不顾主人的羞耻和绝望，清晰地报告着陌\n生的指尖每一寸的徐徐侵入。芳美的草地已被攻掠到尽头，苦无援兵的花园门扉已落入魔掌。\n卑鄙的指尖灵活地控制，无助的门扉被色情地稍稍闭合，又微微拉开。\n「不要……啊……请不要做这样下流的动作……」心中哭泣般的求告毫无效用，贞洁的\n门扉被摆布成羞耻的打开，稚美的花蕾绽露出来，好像预见自己的悲惨，在色迷迷的侵入者面\n前微微战抖。\n要品尝端庄女郎的每一分韵律，火烫的指尖正轻轻掠抚过久无访客的纯嫩花瓣。电流直\n冲每一根毛孔，诗晴娇躯轻颤，蜜肉不自主地收缩夹紧。夹紧的是大胆火辣的陌生的指尖。指\n尖轻挑，湿热柔嫩的花瓣被迫再次羞耻地绽放。不顾廉耻的攻击全面展开。\n「够……够了呀……不要在那里……」\n粗糙的指肚摩擦嫩肉，指甲轻刮嫩壁。花瓣被恣情地玩弄，蜜唇被屈辱地拉起，揉捏。\n拼命想扭动腰身也无法逃离，羞耻的秘处完全被猥亵的手占据，诗晴几乎已经无法保持端庄的\n容颜。粗大的手指挤入柔若无骨的蜜唇的窄处，突然偷袭翘立的蓓蕾。诗晴下腹部不自主地抽\n搐了一下。火热的手指翻搅肆虐。不顾意志的严禁，纯洁的花瓣屈服于淫威，清醇的花露开始\n不自主地渗出。\n立刻发现了强自镇定的女郎的身体变化，陌生男人轻咬诗晴的耳垂，把火热的呼吸喷进\n诗晴的耳孔。左手捏捻乳蕾，右手指尖轻轻挑起花露，示威般地在紧窄幽谷四处涂抹。每一下\n好像都涂抹在诗晴已经要崩溃的羞耻心上。\n被陌生男人发现自己的性感……花唇被一瓣瓣轻抚，又被淫荡的手指不客气地向外张开\n，中指指尖袭击珍珠般的阴蒂，碾磨捏搓，要逼娴静的淑女暴露深藏的疯狂。\n嫩面发烧，两腿发软，诗晴死死地抓着吊环，双眼紧闭，咬牙抵抗一波波快感的冲击。\n强自坚持的端庄掩不住短裙内的真实，两片蜜唇已经被亵玩得肿胀扩大，娇嫩欲滴的花蕾不堪\n狂蜂浪蝶的调引，充血翘立，花蜜不断渗出，宛如饱受雨露的滋润。\n成熟美丽的人妻狼狈地咬着牙，尽量调整粗重的呼吸，可是甜美的冲击无可逃避，噩梦\n仍在继续。两腿间窄窄的丝缎被拨向一侧，觊觎已久的粗大火棒从边缘的缝隙挤入Ｔ字内裤里\n。\n「啊……」诗晴差点压抑不住惊恐的低呼。\n像有火球在秘部爆炸，疯狂般的羞耻冲上心头。蜜唇被异样的火烫笼罩，赤裸的粗大肉\n棒紧贴同样赤裸的花瓣，丑恶的龟头挤迫嫩肉，陌生的角和迫力无比鲜明。无知的Ｔ字内裤\n又发挥弹力像要收复失地，却造成紧箍侵入的肉棒，使肉棒更紧凑地贴挤花唇。\n陌生的肉棒丝毫不容喘息，缓慢而不容抗拒地开始抽动于诗晴那紧窄的方寸之地。火烫\n的坚挺摩擦花唇，龟头鲜明的角刮擦嫩肉，前后的抽动中，尖端轻触饱满翘立的花蕾，花蕾\n被坚硬火热的触感不由自主地颤动。彷佛坠入寒冷的冰窖，诗晴的思考力越来越迟钝，相反地\n感觉越发清晰。像有火焰从身体的内部开始燃烧。\n「这个陌生的男人……当着这么多人的面……竟敢这么下流地玩我……我连他长什么样\n子都不知道……」\n紧窄的幽谷中肉蛇肆虐，幽谷已有溪流暗涌。陌生男人正在拥挤的人群中，以无耻的猥\n亵，公然地对纯洁高傲的白领女郎，进行精神上的强奸。全身的贞洁禁地同时被淫亵地攻击，\n整个人被炽热的男性官能所吞噬。诗晴的全身被羞耻，屈辱和欢愉的电流所包围，矜持的贞操\n几乎已经全面崩溃。单凭吊环已经无法支撑整个身体，站立都感到困难，诗晴虚脱般的倚靠着\n背后陌生男人的身体，才勉强不倒下去。\n「各位乘客请注意∶由于前行列车行车的时间延误，以致于本列车将减缓行车速度，耽\n误您宝贵的时间，本列车全体同寅致上无限的歉意，希望能取得您的谅解……」\n车厢内无情的播音声，在诗晴的脑海中轰隆隆作响，更何况连喘口气，换个心情的时间\n都没有，陌生男人的进犯变本加厉。\n「嗤……」轻微短促的裂帛声，立刻淹没在播音声、人们的抱怨声和车行的声浪中。\n如果有人留意，一定会非常奇怪，角落里那位端庄的白领女郎，刚刚还满面绯红，此刻\n已是俏脸煞白。没人知道，强做矜持镇定的美丽女郎，端庄的标准白领裙装下，正忍受着怎样\n的色情猥亵和蹂躏。\n利用这千金难买的短暂纷乱，陌生男人攻入在诗晴内裤里的大手，抓住Ｔ字内裤的中间\n部份，用力一撕。闷绝的一声低哼，诗晴窒息般僵直。薄薄的内裤丝缎被从裆部完全撕断，高\n质地的布料立刻发挥弹力，从小腹和臀部前后收缩回腰间，Ｔ字裤变成了围在纤腰间的一条布\n带。隐秘花园失却最后的一点屏障，完全赤裸地暴露出来，清晰地感觉空气的凉意，但马上被\n火热的肉棒占领。\n「竟然当着这么多人，撕掉我的内裤……」\n连眼睛都睁不开，诗晴两腿夹紧，握紧吊环和书包，全身打颤，为前行列车的延误暗自\n诅咒不已。\n所有的藩篱都已被摧毁了，赤裸裸的陌生阴茎直接攻击诗晴同样赤裸裸的蜜源，男性的\n感触强烈刺激着官能，诗晴拼命调整急促的呼吸，压抑着喉咙深处微弱的娇喘。\n人声鼎沸喧嚷车厢内的一隅，秘密的淫行如火如荼。陌生男人的左手，仍然耐心地占据\n着那娇嫩而坚挺的胸部去揉弄。诗晴全身觉得战栗，最初的嫌恶在令人恐怖地消失，宛如被爱\n人轻抚的那种甘美的感觉竟丝丝泛起。\n陌生男人的右手移动在她的蜜源和腰腹，时而是那小巧的臀部，苗条而舒展并且饱满的\n大腿，在端庄的白领短裙下，毫无顾忌地摸着。诗晴扭动着身子，纯贞的她此时也已明了陌生\n男人的意图。他并非是那种单纯的色情狂，很显然地，陌生男人不仅想要猥亵她的身体，还要\n彻底玩弄和蹂躏她纯洁的精神贞操。\n诗晴扭过脸去，在无意识之下，将身体扭曲，想要逃避这恐怖的噩梦。陌生男人肆无忌\n惮地抓起诗晴那似乎是能捏挤出汁液的丰满臀峰。\n「呜呜……」缩成一团的诗晴，雪白的颈子微微战栗，性感的红唇紧紧地咬着。\n而陌生男人的色手又已袭上胸乳肆虐，从乳罩中被剥露出来的小巧娇挺的嫩乳，好像诗\n晴苗条纤细的身段上翘起着两个饱满的小丘，和臀部一样地呈现完美无缺的半球形，陌生男人\n粗大的五指，由下往上抄起那两个肉球尽情地揉弄着。\n「哦……」诗晴心里直打哆嗦。\n被陌生的男子粗鲁地揉弄胸部，而那揉弄的方式已并非是一种爱抚，倒不如说是蹂躏，\n一种年青的发情野兽一样饥渴的蹂躏。是一个身长且手掌也很大的陌生男人，诗晴的小巧乳房\n，已被抚弄得饱饱满满的。陌生男人的唇由颈部一直吸到耳根处，一支手继续蹂躏着双乳，而\n另外一支手也摸到腹下来了。\n「啊……」全身好像被一阵寒气所侵袭，诗晴拼命地想蜷起自己的大腿。\n滑向下腹的粗大手指，挤入狭谷抚弄着顶部，开始探索那更深更软的底部。用手掌抓住\n顶端，四支剩下的手指开始揉搓位于深处的部份。诗晴紧紧地将两脚夹住，可是陌生男人的双\n腿插在中间，羞耻的蜜唇只有无奈地忍受色情的把玩。已经更加涨粗的的火棒乘势夹击，脉动\n的硕大龟头紧紧顶压在水汪汪的蜜洞口磨碾。\n身为矜持高傲的白领女郎，或者是被视为才德兼备的公主的女学生时代，诗晴纯洁的身\n体，从未被陌生男人这样子下流地猥亵过。至少在现实中，诗晴决不会允许有人对她做出这种\n动作的状况，做梦也没有想到过，居然在挤满人的车厢中，众目睽睽下，会遭到这噩梦般的蹂\n躏。\n但现在居然有一个完全不相识的陌生男人，随心所欲地对她的身体做出如此恶心的侮辱\n，抚弄那被公认的美乳，凌辱她的屁股，并且肆无忌惮地猥亵她隐秘的圣洁花园，那简直是最\n卑鄙恶劣的侵犯。如果一定不能逃脱，诗晴宁可选择在她意识不明时被侮辱，即使要怎么侵犯\n都可以，总好过像现在这样眼睁睁地被蹂躏，被陌生男人恣意地享受她那被羞耻和污辱所苦时\n的容貌。如果抵抗而挣扎的话，反而中了陌生男人的计，增加他从她身上得到的淫趣。虽然那\n么想，但任由陌生男人的手侵入衣服底下的肌肤恣肆火辣地品玩时，诗晴又惊恐地发现，官能\n的防线已经被色情的蹂躏下越来越薄弱。\n粗大的指头直深入那看似无骨的花唇的窄处，将它翻开并继续深入更深的地方，最敏感\n的小珍珠被迫献出清醇的花蜜。爆炸般的眩晕冲击全身，诗晴的视野也开始变得朦胧。诗晴闭\n起眼睛，深锁眉头，死命地咬着嘴唇。\n自己的下体被陌生男人的手指随心所欲地玩弄着，尽管自己也不能否认陌生男人熟练而\n富技巧的挑逗，心中却非常的不甘心。已经快有一年没有被男人抱过了，即使是自己的丈夫也\n没有。而肉体居然要在这大庭广众之间，被一个来路不明的陌生男人用指头去恣意侮辱。\n诗晴那充满了品格且知性的美貌显得有点扭曲。娇嫩性感的玫瑰红唇不自觉地微张轻喘\n，两个奶子饱涨得像要撑爆开合体的职业女装的束缚，充盈的乳尖顶起薄薄的丝缎上衣，露出\n娇挺的轮廓。\n陌生男人的左手搓揉丰满的奶子，右手尽情的玩弄诗晴肉感的臀峰，巨大肉棒在诗晴下\n体那紧窄的方寸之地插进拉出，又用嘴撩开诗晴披肩的秀发，淫亵的热唇抵住诗晴白嫩的脸颊\n。\n「呜……」诗晴微微地抖动着身子。\n那是一种似有似无的接吻，陌生男人像那样地反复做了几次，然后回到背后去，用嘴撩\n开诗晴的头发将她的耳朵露出来。从脸颊逼近耳根时，麻痒的感触使诗晴禁不住颤栗。当陌生\n男人的唇轻抚着的时候，诗晴的大腿挟得愈紧。只有几次的亲吻而已，诗晴惊恐地发现，自己\n冰一样僵挺的身体，竟像要渐渐地化开来了。\n「啊……」亳无防备的耳朵被侵袭，身上起了甜美的快感。那被轻吹着的耳朵，每当陌\n生男人的唇一接近时，体内的愉悦之源的花芯，就会燃烧起来，而且那极愉快的感觉，也会传\n到诗晴那两支修长的大腿上去。\n（大概是幻觉吧！）诗晴觉得不可思议，眼前的事恍如梦境",
			"added": 1568728532,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "记得那是2001年的时候",
			"body": "记得那是2001年的时候吧，是将近10月份的天气，不冷不热的。那天是星期天，好象上街买东西的人很多。我那天在2.7区买完需要的东西后来到金博大去玩电玩，大概到了下午6点多钟的时候，我该回去了，当然是挤公交车了，我最讨厌坐公交车了，几乎没有一次坐到座位的，唉，没办法啊，我又没有自己的汽车现在。不过这次我却改变对公交车的看法了。原因大家应该先知道几分了吧。\n在站牌等车的很多，等了一会终于等到那一辆可恶的汽车了，已经有很多的人了，大家一拥而上，我几乎是被脚不沾地被挤上去的。到了车上我已经是一头的汗水了，好辛苦啊，唉，连站的地方都少啊，金鸡独立吧！（事情开始了）\n随着汽车的开动，人群摇动起来，我被挤的快窒息了，不过这时候我忽然觉得我的小弟弟被挤压的开始有点蠢蠢欲动了，我这时候才开始注意我前面的一个人，一个女人，一个少妇，一个有点姿色的少妇，唉，安慰一点了，在这样“艰苦”的环境里面还有个同命相连的靓女在我旁边，我真该满足啊。我的小弟弟正好挤压在她的很有肉感的丰满的屁股上面，由于汽车的摇动她的屁股在我的小弟弟上面摩擦不停，我的小弟弟很不争气的坚硬起来，强烈的跳动开来。我心情极度的紧张，不知道该怎么办才好，唉，现在想我那时侯真是不争气啊，怕什么，有点男人的气概吗，上吧！！！！\n我一手抓住扶手，一手放到下面，开始小心的触碰她的丰臀，由于紧张我的嗓子有点发干。用车摇动的力量，我的手掌一次一次的摸到她的屁股，好软啊，我的小弟弟现在已经是很坚硬了，紧紧的顶着她的屁股沟，在那里来回顶撞，她好象有点感觉了，回过头看了我一下，皱了一下眉头，可是没什么其它的反映，我这时候忽然一阵心动，真是所谓的“色胆包天”啊！！！我用手大胆的按在她的屁股上，用力捏了起来，还用我坚硬的小弟弟使劲的碰她，反正人这么多，也不会有人看到。这时候我发现她微侧着头斜着眼睛望我看，好象很生气的样子，不过她越是这样我越是起性，我干脆用两只手搂住她的屁股抚摩，把她的屁股往我小弟弟上拉，她有点很不自然的低下了头，我开始大胆了起来，我把她慢慢的转了过来，让她正面对着我，她看着我，显出少妇所有的丰韵的羞涩，这时候我的小弟弟是正好对着她的下面，感觉有点突起对着我的小弟弟，我知道那是什么。她的紧身上衣包裹着她成熟硕大的乳房，拥挤使那一对大奶子贴在我的胸前，柔软中有带坚挺，摇动使得她波涛汹涌，在我的胸前一浪胜过一浪，我真是好幸福啊，一边抚摩她的屁股，一边享受着她的乳房的撞击，她的脸红的很，开始喘气了，我借助拥挤伸一只手去摸她的乳房，那一对大乳房在我的手的用力的揉捏下变的扁了，它微闭眼睛，好象很享受，她可能是怕人看见，就把身体往我这里靠近，我激动异常，搂住她，紧紧的，她干脆就靠在我的身上，我乘机把手从她的衣服下面伸进去，摸到她的胸罩，质感不错，我继续把手伸到她的胸罩里面终于摸到一对大大的坚挺柔软的乳房。我\n肆意的揉捏它，她已经闭上了眼睛，我接着把她的手往我小弟弟那拉，拉开我的裤连，她慢慢的把手伸进去，我知道她已经配合了。她用手握住我已经硬起来的小弟弟，开始上下套弄，一阵阵的快感传来，我兴奋异常，加紧揉搓她的乳房，她也开始加快了套弄的频率，我们就这样有将近10分钟的时间，最后我忍不住射出了一股烫烫的精液，全都被她握在手里，可是我的小弟弟还没有软下去。她从她的皮包里面摸出一张纸，把她手上的精液都檫去了，丢在地上，然后她把我的小弟弟又揉捏了一会，就把它放回我的裤子里面了，给我拉好裤连，我的手还在她的衣服里面，不想拿出来。她示意我她该下车了，我才把手拿出来，在她的屁股上又捏了一把，还在她的阴部摸了一会，到站了她比我先下，我真有点舍不得她走啊，她没有回头就下车了，我看见她在搓她的手，呵呵，好刺激啊。\n先到这吧，以后有机会再写我的经历，希望有河南的女性最好是郑州的和我来联系啊，29832155。",
			"added": 1568728626,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "当我是个高中生时",
			"body": "当我是个高中生时，我都是通车上学的，那时我家的那一线公车并没有学生专车，所以\n就坐一般的普通车。既然是普通车，当然也有一般上班族搭乘，而且我所搭乘的这线公车的座\n位是跟火车一般，一排一排的，中间是走道。通常在早上上班尖峰时刻都是拥挤不堪的，而我\n读的学校也不错，人也长得斯文，至少不会太讨人厌！所以这些外在条件都是我最佳的掩护。\n各位读者可能会以为我是个无恶不做的色狼，那您们可就错了！我对同年龄的小女生其\n实没啥兴趣，通常只是被那些小女生倒追罢了！我反而对一些成熟的上班族很爱慕。\n从候车的站牌一大堆女人中，我很欣赏一位上班族的大姊姊，她的气质优雅穿着合身，\n她总是由一个人骑机车载她来等公车，看她抱着那个人的样子，我想那个人不是男朋友就是她\n老公。原先我对她并没有太大的动作与意图，只是很喜欢看到她而已，连带的对她的仪态穿着\n都很注意。\n有一天上车时，大家通常是不排队的挤成一团，而我不巧刚好挤在她前面，由于人多，\n所以大家都往前挤，自然她也被迫向我推挤，我也不知怎么回事？突然间所有的神经都集中在\n我背部，因为她一手提着皮包，手指的部分顶着我的臀部，另一只手拿着车票顶住我的肩膀，\n我想她是在护着她的胸部吧？\n我突然被一个女人的手背抵住屁股，又因为推挤而磨擦移动，就勾引起我的意念。其实\n我是可以闪过她的，可是我却也不愿放弃这个机会，我灵机一动，猛然转身瞪她一眼，然后眼\n光扫向她那提着皮包的手┅┅她这时已经会过意了，很显然，她觉得很不好意思。\n等上了车，我就找机会堵在她前面，跟她面对面站着，我故意装着很不高兴的样子放肆\n的看着她，而她也很腼腆又尴尬的低着头。然后随着上车的人愈来愈多，我跟她的距离也愈加\n靠近，终于还是贴在一块儿了。我想是心理因素吧？！她原先的保护姿势都不见了，她放开手\n提包，只把手握住肩在肩上的提带，反而是我的手抱着书包抵住她的下腹部，随着行车的摇晃\n，我的手掌背一直在磨擦她的下腹部。\n我是很心虚，但也是很舒服！而她的反应只是把红着的脸转开，人家说∶得寸才会进尺\n！我还把手指伸直，直接去磨擦她下腹的凹陷处。我其实紧张大于快感！说真的，没摸到什么\n，也没感到一般Ａ书上写的那么离谱！不过我可以确定的是∶她是真的害羞而不是装的！\n由于我比她早下车，我在要下车之前，趁着人潮的移动，我在书包遮掩下，反面张大我\n的手掌，从她的臀部一片一片的抚摸过去，我感觉到她内裤的边缘与屁股的所形成的线条，以\n及两片凹凸的臀部，哇！好爽这一整天我都陶醉这个情境里！\n隔日再看到她时，两个人都有些尴尬，我也就不好把视线放在她身上。当车来，我就奋\n勇挤上车，也争到一个坐位，她的手脚比较慢，当她上车后已经没位子了！她站的地方离我的\n位子只差一排，所以我可以看的到她，我发现她的目光也落在我身上，还好是不带恶意的！所\n以我就开始用我那斯文且又不太会惹人厌的目光聚集在她身上。一趟路下来，看得她心慌意乱\n的，好不自在！\n往后的几天我都同样的会在车上搜寻她的目光，我想她也似乎习惯我这样子看她。有一\n天我故意想耍她，当我知道她就站在我附近时，我从头到尾都没看她一眼，直到我要下车时，\n才稍微看到她那用疑惑的眼神在看着我，哈！她还是蛮在乎的！\n之后有一天傍晚放学后，当我上车时很意外的看到她也在车上，当时车上也没有什么人\n，空位也还有，不过我还是走到她的座位旁站着，而她的旁边靠窗的位子是空着的。她看我站\n着不动有一阵子，她就挪向靠窗的位子，我还是没动，她可能觉得蛮糗的，她歪着头看我一下\n，然后拍拍椅子要我坐下，我就不客气的坐下来了。\n位子不大，所以会靠在一起，其实我是故意的，我把书包放在大腿上，手就似有似无的\n放在她跟我的大腿之间，我缓慢的移动手掌抚摸她穿丝袜的大腿，摸得她一下子并腿、一下子\n交叉大腿。最后她可能受不了，伸手抓住我的手，这时我也只好乖乖的把手放好！我看她脸红\n脖子粗的喘息瞪着我，但她的眼里却又透露出暧昧的眼神。\n这时我把手从她的背后伸到她的背部，我用手指抠弄她的胸罩肩带，她又扭来扭去的闪\n避着，我又尝试去拨她胸罩的背扣，她可是吓坏了！她小声的说∶「你不要太过份！」\n我心虚的说∶「我哪有？」同时收手交叉抱胸，然后在手臂的掩护下，用手指去碰触她\n的罩杯部份，虽然隔着胸罩，不过还是可以感到乳房的柔软。\n虽然之前我曾摸过我大姊的乳房，不过对外人而言这是第一次，感觉很新鲜也很紧张，\n我当然很渴望能尽情的掌握她的乳房。我想了一会儿，就假藉要开车窗，就略为站起身去开车\n窗，当我一手开窗时，另一手就趁虚而入的握了她的一只乳房，我简直爽死了！而她紧张的一\n边整理她的衬衫，一边提防被人看见，她的不安我可以理解，反正我的目的达到了，我的嘴角\n泛起得意的微笑。\n她喘息的说∶「你胆子好大！怎么可以这样子┅┅」\n我还是一样带着得意的微笑，并不搭腔，反正也快到站了。就在我快下车之际，我在她\n耳边轻声说∶「我想要你的内裤！」\n她听了有些惊慌的说∶「你再讲！」\n我说∶「要不然你明天不要穿内裤！」\n她生气了∶「你还讲」以后就把脸转向窗外不再理我。\n她也没下车，为什么我也不知道，反正我就带着胜利的微笑回家了。\n隔天早上等车时她绷着脸不甩我，上车后也不理我。我仔细观察她的裙子，想找出她内\n裤的痕迹。啊！好泄气，她有穿内裤！不过当我要下车时，她递给我一包７－１１的塑胶袋，\n我好紧张！\n到校园里的僻静处，我拿出来看，是一条粉紫色的三角裤！式样蛮保守的，是洗过的，\n所以香香的，还有一张纸条，写着∶「我妈的！色鬼！」\n这一天当中，我几乎每节下课都往厕所跑，到底干些什么？您们自己想吧！\n放学后，我尽量赶在她之前到我的站牌处等她，等好久终于等到她下车，她看到我有些\n错愕，随即便露出诡谲又俏皮的笑脸说∶「你妈妈能穿吗？」我说∶「姊姊，别闹了啦！」\n然后慢慢的胡乱的聊聊。\n随后她说要再转一班车回家，我调皮的跟她耍嘴皮说∶「我要你穿的这一件啦！」她说\n∶「别闹了！在外面ㄋㄟ，怎么可以？」我指了指对面的加油站，她也看了一阵子，然后说∶\n「你等一下！」她就走过马路到对面加油站的厕所里。\n约７、８分钟吧！看着她走回来了。哈哈！她走路的姿势好奇怪，明明没刮风，她还是\n抓着裙摆，脚还是内八字。当她拿给我时说∶「没洗，不干净耶！」不过我看她还穿着丝袜，\n就问她∶「你还穿丝袜ㄋㄟ！你是怎么脱的？」她说∶「要你管！」还敲了我的头！\n接着她说要回家了，还交代不可以跟踪她，否则以后就别想看到她。我要她留下电话，\n她不肯，她倒是记下了我的。\n当晚她打电话来跟我聊了好久，她对于我跟我大姊的事很感兴趣，她说她读国小的弟弟\n也会翻她在浴室换下来的内衣裤，吓的都把自己的内衣裤晾在自己房间里┅┅\n自此每天早上我们都会很自然的聊几句，表面看起来好像是姊弟一般，其实聊的内容都\n是些限制级的。我们曾很认真的谈到我们这种关系，我们都同意这是舒缓生活压力的方式（藉\n口）。\n当我要大学联考前一个月吧，她说再不久就要调动职务，以后没有什么机会见面了。我\n很紧张的约她在公车站牌见面，见了面之后我们聊了很久，我要求她跟我上宾馆，好说歹说她\n都不肯，连喝杯咖啡饮料都不肯。我记得当时我是红着眼框求她，最后她只答应再送我一件内\n裤，然后我们就一起到对面的加油站去。\n我要求跟她一起进去，起初她不肯，我又提起我大姊的例子，还真有效喔！她答应了！\n接着我们就忙着选择要进男厕或女厕？最后选了男厕，因为男厕有两间，男生进厕所大都是小\n便，比较少用到厕间，安全而且比较干净。\n进去后，她把裙子撩起来，她让我自己动手脱，是纯白色的内裤，还是很保守的式样。\n当我脱她内裤的时候，我看到她的阴毛好少，我想摸她的阴唇，她不肯，她小声的告诉我，她\n仍是处女，只能看不能摸。其实在拉扯之间也摸了好几次了，只不过她没办法接受我的爱抚。\n拿了她的内裤以后我就抱着她不放，我用脸磨擦着她的胸部，她也抱着我的头怜惜的说\n∶「你跟你姊姊也是这样吗？」我点点头，然后手伸入她的Ｔ恤内，抚摸着她的胸罩，摸到胸\n罩的背扣就趁她不注意时打开了！\n她没想到我会脱她的胸罩，她开始挣扎！刚好这时有人进来小解，她也不敢再出声音，\n我就更肆无忌惮的搓揉她的乳房。\n她的乳房跟大姊差不多，但我大姊的奶头颜色比较淡，我看她眉头纠结在一起，很兴奋\n也好像很难过，我也将她的奶头含入嘴里，我不禁想起大姊的奶头，我真的好怀念喔！所以我\n格外珍惜眼前的机会。\n我一面舔吸她的乳头，还一面用手抚摸她的阴部，直到她的脚都软了┅┅我舔够了之后\n，很体贴的帮她扣好胸罩，拉好Ｔ恤，这时她喘嘘嘘的靠在墙壁看着我，我也不知道她是否有\n高潮？\n我意犹未尽的掏出我的阴茎，要她握住它，她不大敢看，只是闭着眼睛握着它。我抓住\n她的手，引导她帮我手淫，由于两人都很紧张，所以我没多久就射精了！\n整理好之后，确定没外人进来，我们用最快的速度「逃」出加油站！然后很有默契的一\n左一右的各自离开！当晚我的心情糟透了，拿着那两件内裤不断的自慰，直到「精」疲力尽才\n睡着。\n隔日是我最后一次看到她，在等车的时候，她告诉我，其实是因为她要结婚了，而且是\n要嫁到南投，今天要去办交接┅┅我只是强忍心中的不舍倾听着，也没说什么，想不到她用很\n小音量的声音告诉我∶「我今天没穿┅┅而且以后只要想起你，我都会这样子┅┅」（这就是\n后来我时常要我老婆不穿内裤外出的原因吧！）\n（(希望年龄大的女人联系我，小女孩就不要了，小女孩是不懂性爱的《虽然我也不是很大）",
			"added": 1568728700,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "在北京至衡阳的K185次列车上",
			"body": "事情发生在火车上，在北京至衡阳的K185次列车上，我上车的时候，车厢里基本上都空着，\n有一半的座位都闲着。我为了车上的10多个小时的路程，故意走的车厢的末尾，在一张三人\n座的位置上躺了下来，准备好好的睡上一觉，随着火车的进行，不断的有人下车，当然也有人\n上车了，不然，整个车厢里连一个漂亮女人都没有，那里还有我这个故事啊。当火车走到邯郸\n的时候。上来了几个年轻的女士。我也没在意。还是继续睡我的觉。谁知道，其中有两个女人\n径直走到我这边来了，也许是看上了我对面的那张三人座了。我躺在椅子上，眯眼看了几眼，\n其中一个看起来有30来岁了，很丰满的样子，估计孩子都不小了。另一个比较年轻，看起来也\n就\n24，5岁，后来才知道他25岁，呵呵，比我大两岁，还不错。样子很标致，又有一股成熟的女\n人味，看来我这次的火车上的旅行不会那么闷了。谁知道，接下来发生的事，更是让人难忘。\n我继续躺着，其实并没有睡着，我偷偷的观察他们，大家别误会，我不是职业色狼，只是出\n与男性的本能喜欢欣赏美女罢了。过了一会，那个年轻的在我的对面的椅子上躺了下来，年纪\n大点的，坐在她的旁边。他们也不再聊天了，闭上眼，开始睡觉。我觉得自己没什么睡意了，\n就起来，跑到火车隔断里去抽烟。等我回来的时候，发现那个年纪大点的，已经坐在我的位置\n上，爬在桌子上睡觉，她见我回来，起身要给我让坐。我示意她继续睡觉。我坐在过道的外手\n。由于这么坐着时间长了会很累，于是我就把脚搭到了对面的椅子上，随着火车的颤动。我的\n脚总是无意中碰到对面那个年轻女子的腿，开始我并没在意，有时还会不好意思的躲避一下。\n但我注意到，她并没有在意我每次的触摸。于是我突然有种冲动。决定用脚挑逗一下她。这\n个时候，已经是夜里2点多了。火车上的灯很暗，而且多数人都在睡觉。我放开了胆子，开始\n进行我的计划，我先是用右脚轻轻的触摸她的小腿。当然这需要火车的配合了，不能太过直接\n了，总是时有时无的触摸。过了一会，我的整个脚就已经全部挨在了她的小腿上。她并没有醒\n过来，也许她已经醒来了，但她并没有一丝的躲避，于是我开始进行，第二步计划。我的左脚\n也搭在了她的椅子上，如果我再向前伸上10厘米的话，就会挨到他的大腿根步。这个位置应该\n是很敏感的吧。我不能操之过急，要一步一步的来，继续用前面的办法，我先用脚根挨到了她\n的大腿。并且也是时有时无的，随着是火车的颤动，我的右脚一直没有离开她的小腿。配合着\n我的左脚的行动。一点一点的挪动着，终于，我的整个脚都已经挨到了她的大腿。在我整个挨\n到他大腿的时候，她动了一下，并且\n向后挪动了一下，逃开了我的脚。但她只是大腿离开了我的脚，小腿还在我的掌握中。我不\n甘心，继续用我的左脚向前移了几厘米，又挨到了她的大腿，这次她还是躲了一下，但她只是\n向后挪动了一下，又回来了，自己用她的大腿挨的我更近了。呵呵，原来她并没有睡着，也许\n正像我一样，享受着这种刺激。我的脚在她的腿上轻轻的抚摩着。并没有很放肆，只是规律\n行的抚摩着，我的左脚已经离她的大腿根部不远了。随着火车的颤动，我终于达到了他的大腿\n根部，用大脚趾挑衅似的的动了她两腿中间一下。他颤抖了一下，然后向后躲，我继续跟进。\n又挨到了她的大腿，这个时候，她突然伸出手来，伸到了牛崽裤里，先是用手轻轻的抠了一下\n两腿中间。然后在裤子里，用手轻轻的弹了我的脚几下，看来他是不希望我太放肆了。不过，\n没关系，起码我知道。刚才她一直是醒着的，并且像我一样，享受着这种刺激。我稍微离开了\n一下。右脚还是她的小腿之上，并且趁着她刚才挪动的时候，已经成功的占领她小腿中间。她\n这次并没有反对，而且还用力夹住了我的脚。呵呵，其实在这也不错，起码脚不会很冷了。\n在右脚的帮忙下，我的左脚又来到了她大腿根部。我没有放肆的触摸她的大腿，只是轻轻的挨\n着，随着火车的颤动，逐渐加重力度。呵呵，我终于来到了他的两腿中间。轻轻的在那里划过\n。他浑身颤动了一下，并且向后挪动了一下。在我还没来的及向前跟进的时候，她又回来了。\n并且用他的大腿压住了我脚的，这个时候，他把盖在身上的大衣向下拉了拉，刚好能盖上我的\n左脚。并且妞动了几下屁股。呵呵，真是天祝我也。我遇到了一个色女。我继续用我的脚抚摩\n着她，这次，是用脚趾了，我轻轻的抠动着他的大腿根，一下一下的挠着她，并且，已经进军\n到他的两腿中间了，我感到一股热汽包围着我的脚，原来她那里已经湿了。我用脚趾逐步进军\n，时重时轻的抠动着她敏感部位。她开始只是被动着接受我的抚摩，到后来，她两脚夹我的更\n紧了，并且自己轻轻的妞动着。她继续闭着眼。轻轻的咬着下嘴唇。两腮已经泛起了红色。看\n这个时候，她的女拌醒过来了，起身要去厕所，我收回我的脚。让她过去。她也睁开了眼。\n我向她微微一笑，她也红着脸对我一笑。我拿出一只烟，点上抽了几口，她咳嗽了几声，并对\n我说，呆会你去厕所里抽吧。\n我说，为什么啊，你怕呛啊？他说，是啊，而且我呆会也要去厕所。呵呵，现在就是再笨的\n人，也会明白她话里的意思了。她在邀请我一起去个没人打扰的地方啊。呵呵，看来这次旅行\n真是不赖！\n她的女拌回来了，我起身，去隔断抽烟。各位看官，如果你也遇到像我这样的遭遇，千万别\n掉以轻心啊。没准。这两个人就是看上了你的包了。呵呵，还好，咱们的旅途经验还算丰富。\n我起身离开的时候，把随身带的包拿起来了。剩下的包。里面只不过是书，还有点吃的。你就\n是把包都拿去了，也值不了几个钱的。呵呵，到后来我才知道，自己是多滤了，我碰到的真\n是艳遇。我在火车隔断里还没抽几口烟的时候，她就已经跟着过来了。在旁边的洗漱池里弄湿\n了头发，拿出把梳子，开始梳头，对着镜子对我说：“先生到那啊”\n“啊，我到武汉，去考试.你到那啊”\n“我到郑州”\n“哦！去出差啊”\n“是啊，很累的”\n“像你这么漂亮的女士出这么远的门，就不怕遇到色狼了吗”？\n“哦？小色狼？你不是在说我吧？我可对你什么都没做过啊”。\n“还说什么都没做过，你都把人家……”说到这的时候，她低头整整了上衣，并且低头盯着\n我两腿中间。\n哇！！厉害，那么直接的眼神我还是第一次看到。\n“我把你怎么了？”我用手在她的脸上一划而过。“你还是那么漂亮啊，我没对你做什么吧\n？”\n“你？！”她伸手在我胸口捶了几下。\n“不要……，不要嘛，我的朋友会看见的”说着竟然自己走到了厕所里，门并没有锁……",
			"added": 1568728754,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "我真的错了吗？？？？？？？？？",
			"body": "国庆前，我们办公室接到通知，要参加外地的贸易活动，用了两个晚上的时间把材料准备好\n，一大早，市长便安排我和组织部的吴敏到外地打前站，因为办公室的车辆吃紧，所以我们便\n决定坐火车。由于忙了两晚上，累的不的活！我们便买了两张卧铺票，临走时姜市长叮嘱到：\n“小建，把吴敏照顾好，莫让她吃亏哦！出了问题唯你是问！”\n在此把小敏介绍给大家。吴敏是组织部里的头号美女，是审计局长的千金。81年出生，身高\n171CM，绝顶清纯的少女,明艳不可方物,生得一副鹅蛋脸,两条柳叶眉儿,一对眼睛,澄清得和秋\n波一样,不高不低的鼻子,好似玉琢成的,樱桃小口,不够一寸,脸上肌肤,白里透红,红中透白,润\n腻无比,简直吹弹得破,额头上覆盖几根稀疏的刘海,越显出无限可爱,一头乌溜俏丽的短发,梳\n着小小的瓣子,辫根圈着花环,爱穿浅蓝色折裙，裙下露出一对玲珑小脚,晶莹剔透,十分好看\n,穿的雪白袜子,红色拖鞋,走起路来,腰身绰约,步履妖娇,加上妆饰雅洁,脂粉未施,真称得上俏\n丽甜净四字.，用同事们的话来讲：前凸后敲腿子长。平时在大院里一副谁也不愿意打理的样\n子，也不谈男朋友，我们一帮年轻人都眼馋的要死！哈哈！\n10点多钟的时候，我们两人上了火车,到了自己的位置一看还不错，是个小包厢，挺干净的上\n下铺，旁边坐的也是一男一女，好象是情侣的样子，样子挺亲密的。友好的打声招呼后，我就\n说：“小敏，你睡上铺吧，上面轻静点！”她点点头便把她的包包往上边放，然后就往上铺上\n爬，正好她绷的紧紧的屁股对着我的脸，没想到她的屁股这么丰满！我正看的出神，听到她说\n到：“帮我一下，没看到我使不上劲吗？讨厌！”我赶快用手扶着她的大屁股往上推，尻！好\n软！瞬间鸡吧就硬了！真想立刻就叉进去。可惜时间太短暂了，她很快的爬上去，翻身坐着张\n着红仆仆的小嘴出了一口气，我注意到她的脸红了，大概没有男人碰过她的屁股吧！我看着她\n把东西整理好后就说：“我昨天晚上没睡，想睡一下，你有事就叫我好吗？”说完我就坐到她\n的下边开始整理床铺，车厢里的空调开的太大了，我决定把衣服脱掉睡，免的下车时感冒。我\n左右看看，跟本没人注意，对面的两人也相互抱着开始打盹。哎！真他妈的幸福！我脱掉外套\n只穿着背心和四角裤用被子一盖便开始睡！却忘了上铺还有一个未经人事的MM（虽然感到有目\n光扫射），随着火车的前进，想着和吴敏的大屁股，我很快的进入了梦乡。（春梦了无痕，在\n“哎！小建，快起来，吃饭吧！”我猛的一怔，往起一坐，好香的嘴巴，原来小敏她喊了我\n几遍了，我都没听见，所以才趴到我耳边喊，谁知道正好被我占了便宜！我按捺不住情欲顺手\n把她往怀里一拉，丰满的身子一下倒在我的身上，我硬棒棒的鸡吧狠狠的抵在她的屁股上，她\n惊叫到：“你怎么呢？”我不知道怎么回答，反正都这样了，便盯着她的眼睛说：“我要你！\n我想你很久了！你知道的！”，她羞涩的抵下头说：“你真大胆，坏透了，从没人对我这样。\n你真的要我吗？你以前怎么不对我讲？”我见她没有反对便不客气的把她拉到我的被子里，她\n紧张的浑身发抖说：“在车上有人看见。”我左右看看，对面的两人早就吃饭去了，便哄到：\n“没人，没事的。现在只是我和你的时间。”敏低头不时看看我，她留意到我阳具的变化，脸\n更加的红润了。\n小敏不安的躺在我的怀里，神情显的有些恐慌，我反身轻压在她身上，她显得很害怕，我轻\n轻抚着小敏的秀发，对她说∶“小敏，你放轻松，我会对你好的！”\n小敏慢慢平静下来，她紧紧地搂着我，她抬起头，我看着她清澈的双眼，我吻了她。“嗯～\n”她轻轻发了一声，这一声对我来说不是一个“鼓励”吗？\n我轻轻的把她抱在怀里，两个人面对面贴在一起，她玲珑起伏的身段，前凸后翘的身材，豪\n乳紧贴着我的胸部，让我呼吸急促了起来，我在她耳边说“你好香喔！皮肤好嫩。”我开始吻\n她的唇，软软的。双手自然地扫着她的背和她那丰盈的美臀。然后开始亲吻她的耳垂，我的\n唇舌一步步的往下移动，她也呼吸急促的回应，火般的热情几乎把我熔化，两人舌头不住纠缠\n我的舌尖意乱迷迷的在她嘴刮擦，在牙缝间如同小泥鳅一样执拗的钻撬着，胡乱的在上边刮\n擦，在牙缝间如同小泥鳅一样执拗的钻撬着。很快难以遏制的喘息让她的牙齿分开了一条小缝\n儿，香热的口气登时笼罩了我的舌尖，我近乎野蛮的把自己挤了进去。她的上下牙在我因用力\n而撮圆的舌肚上紧紧地划过。我立刻感觉到自己正躺卧在她绵软滑热的丁香瓣上，高度的紧张\n使她的舌头不知所措的畏缩着，我的舌尖在她津液的缠裹下，紧紧的钻进她舌下，一股纯粹味\n觉上的绵软香热让我贪婪的随即上翻，本能的想与这鲜嫩的肉体纠缠为一体。\n我开始肆无忌惮的侵犯着她的口腔的每一个角落。紧张迷乱的似乎已经进入催眠状态的她笨\n拙地执行着。我的整个嘴都挤进了进去。她湿热的双唇几乎贴到了我的鼻子，牙齿刮擦着我的\n人中，我的嘴舌完全笼罩在香热、潮湿、粘滑之中。我的嘴撮住了她绵软娇嫩的舌尖，用牙齿\n轻轻地咬住，将自己的舌头在上面亲呢的摩擦着。猛的，不可抑制的侵占欲望，让我将她将进\n三分之二的舌头吸进了口中，根部用牙齿紧紧地咬住。我的舌头与她紧密的贴附在一起，在她\n憨憨的呻吟中搅拌着，吸吮着。她的声音就是这样发出来的，就是现在在我口中尽情享用的绵\n软肉体，她的伸缩抬降，发出的声音每一个音符都会命令到我的灵魂。\n我的舌头在她的白白的脖颈上猖狂着，侵袭着她从未开发过的领地。我的手大胆的放在了那\n个突出的部位，我本想，也许，素来传统的她不会让我得逞的，小敏竟然娇哼了一声，幸福的\n闭上了眼睛。她急促的呼吸将一阵阵体热扑在我的脸上。我们陶醉了。。。。\n吴敏的胸部很伟大，两团肉球挤出了深深的乳沟，透过薄薄的丝织品，我清晰的感觉到了她\n乳罩的轮廓，以及那其中包裹的丰腴坚挺的肉体。使人想一探究竟。蕾丝缕空的半罩杯隐约露\n出诱人的两点，平滑的肌肤构成罩杯外圆鼓鼓的曲线。我发现她的胸罩是前开式的，扣子就在\n乳沟的下方。我解开了她胸罩的扣子，一对饱满丰腴的双峰迫不及待的跳了出来，顿时让我目\n瞪口呆∷尖挺的乳头带着令人垂涎的粉红色，乳晕的大小适中，浑圆的乳房并不因为失去了胸\n罩的支撑而改变形状，最让我忍不住的是这对大乳房的肌肤充满了弹性，手指摸在上面的感觉\n舒服极了！我的手不禁握住这硕大的奶子，这至少有⒊⒌Ｄ以上的尺寸，一个手掌都无法掌握\n住。我稍使了点力搓揉，小敏就发出荡人心弦的淫叫声。摸捏了好一会，两粒小葡萄般的乳尖\n在我掌中渐渐发硬了，我隐隐感到勃起的鸡巴在里面一跳一跳，手掌摸捏着她嫩滑的乳房，鼻\n子嗅着她胸前散发出来的阵阵乳香，眼睛享受着她脸上充满快意的表情……\n我用手指挑拨一下，夹起她的乳头，俯低头张口把其中一颗含进嘴里，用舌头轻舔，小敏“\n嗯”地一声，双手捧住了我的头，搔弄着我的头发。吴敏右乳房的乳晕还长了颗黑痣，当我用\n嘴唇含夹起这根黑痣时，也牵拉起她敏感的乳晕肌肤，使得她搔弄我头发的手因快感而使力抓\n着我的头皮。我的手没有闲着，顺着她的肩滑下，再爱抚着她坚挺的乳房。然后，我使劲拉下\n她的裤子，一件白色的卫生内裤就露了出来，她的内裤是丝质的，摸起来很光滑，隔着薄薄的\n布料，还能感觉得到饱满的阴阜。在她的内裤上面揉撮，少女的淫声果然吸引人，特别是由小\n敏口中呼唤出来，更加令我进入疯狂状况！为了要她叫的更大声，我不断的搓弄着敏如的阴\n隔着内裤都感觉到阴户的幼滑，阴蒂也充满弹性，就连分泌出来的爱液也散发着清香宜人的\n味道。这香味以及手指间黏黏的感觉使我的情绪更加错乱，使我更加疯狂的搓挤着小敏的阴\n核。不停的上下摩擦着嫩穴的裂缝。\n整只手紧紧的扣住，加重了揉捏的力道，强烈的驱动她的欲火，我的双手像蛇般的在她背部\n臀间游移。此时我的双手早已偷溜进衣物的阻隔之外，直接在她光滑白析的皮肤上肆虐游移，\n揉捏她的臀部。两人身体还是紧贴，我的性征早已雄伟直挺挺的顶着她，让她全身更火热发烫\n。一种莫名的冲动，让我把她的手紧紧按在了自己的双腿之间。“啊，不~~”她毫无思想准备\n，轻轻地惊叫着，手本能的想回缩去，但被我紧紧地按在原地。这是我们认识以来，她第一次\n触摸我的下体。“不~~，我不想~~”她低声的呢喃着，“来，摸摸看吧~~，你会喜欢的~~”我\n轻轻地搂住她的腰肢，在她的脸颊上轻轻地吻了一下，她的脸火烫烫的。尽管扭捏，她的手指\n还是笨拙的抚弄起来，我的阴茎不可遏止的挺立起来，隔着短裤在她的动作下起伏着。\n“来吧，直接摸摸~~”我的手抚摸上了她胸前坚挺丰满的隆起。伸进我的背心，她尖尖的指\n尖儿迟疑着划过我的腹部，电流般酸麻感几乎让我身体痉挛。她的手有一点点冰凉，慢慢地伸\n入，实实在在的触摸，隔着我的内裤，她的手覆盖在坚硬的勃起上。\n“好硬啊？！象铁~~”她轻轻地惊叫着，“不~不了~~我，我不想~~”。\n被撩起的欲望，使我无法忍耐。我抓住她的手，撩开自己内裤的边缘，将她按了进去。裸露\n的龟头立刻摩擦到了她湿热的掌心。\n她的手探索着握住了我滚烫的柱状勃起。我无法用文字来形容我那一瞬间的感受，似乎我的\n灵魂都被她攥住。纤细的指，绵软的掌心，携裹着湿热和温暖，合围着充满着欲望的，用于侵\n入女性身体的肉柱。我曾经不止一次为她而兴奋，为她的一个害羞的笑，为她身体上的一条曲\n线。我感觉那都是淫荡的，亵渎的。而现在，一切都是现实而又美好的。\n“唔~~”紧裹的包围开始轻轻地摇动起来。她有些困惑的将食指伸出来按在龟头系带位置，\n轻轻地揉。瞬间，快感直接冲上了我的太阳穴。快感的尖锐几乎让我感觉到了她指纹的纹路。\n我调整了她的每一根手指，然后毫无反抗能力的坠入到包容全身的快感中去，肉棒在她的手中\n看着她红通通的脸，听着她短促的踹息声，感受着她起伏的胸脯，我觉得很幸福。我要给她\n我的爱！紧接着，我再一次不顾一切的扑向她，狂吻着她的脸，耳，唇，舌，她也努力的配合\n着。在浓重的踹息声中，白皙的乳球，粉嫩的乳晕，坚挺的乳头，我一把抓去，居然一只手还\n抓不下。虽然我心潮澎湃，但是我还是尽量的克制住自己，左手搂住她的背，右手托起她的一\n只乳房，把她的身体稍微向后倾一点，用舌尖舔起了她的乳晕来，“啊！……啊……啊”她忍\n不住叫出了声，她的叫声令我更加兴奋，我把抱她的手换成右手，然后左手抓住她的乳房捏了\n起来，而她右边的乳房我则是用嘴去咬她的乳头，轻轻的，一下一下的，她跟着我咬她乳头的\n节奏呻吟着……\n记得有人说过∷胸部越大的女人，对乳房的爱抚就越敏感。小敏就是最好的证明，手指稍微\n滑过她饱满乳房的肌肤，就能引起她极大的快感，身体产生强烈的反应，扭动她那美得摄人的\n娇躯。\n接着，我的手开始往下探，我发现她的内裤已经有一点湿了，但是我并不满足，于是用中指\n找到她的阴蒂，轻轻的抠着，当然，嘴也没有停下来，继续在她的两个乳头间忙碌着，“恩…\n…恩……啊……哦……”，她的呻吟声一浪高过一浪，内裤也越来越湿了。“快点！哦……快\n来！啊……”，显然她已经不行了，但是我并没有很快进入她的身体，我要给她最美的快乐！\n由于刚才的爱抚，小敏的爱液已经润湿了她的内裤，隐约地可以看见内裤下美丽的部分。我\n动作缓慢却很有效率地除下她的内裤，小敏也很能配合，当我脱拉到她的膝盖部分时，小敏屈\n起了膝，让我能轻易地将内裤完全脱下。\n她的双腿，慢慢往两边分开，两条细长美腿向外伸张，轻轻抖动，夹在中间尽头的是饱满阴\n户，阴埠上长着乌黑而又柔软的曲毛，她的阴毛很浓密，阴阜像个小包子似地鼓起，拱得高高\n的大阴唇随着大腿的撑开，被带得向两边半张，露出鲜艳夺目的两片小阴唇，黏着几滴浅白的\n爱液。\n我的手指接触到她的私处时，小敏的身体像是触电般颤抖了一下，左手也伸过来想阻止我，\n但是我温柔却坚定地拨开了她的手，继续探索她的桃源地。我分开了那两片保卫最后防线的肉\n壁，意外地，小敏的阴道口很小，阴核早已外露突出，像粒粉红色的珍珠。她的小阴唇在我的\n抚摩之下，开始发硬，往外伸张得更开了，我用指头将小阴唇再撑开一点，露出淫水汪汪的阴\n道口，洞口浅红色的嫩皮充满血液，稍稍挺起，我用手指在阴道口打转，让她不断涌出的淫水\n流在手上，又浆又腻，然后再带到阴蒂，蘸在越挺越出的小红豆上，把整个阴户都涂满黏黏滑\n滑的淫水。她阴户一挺一抬，全身肌肉绷得紧紧，双手几乎把垫布也抓破了。\n以前看过些色情小说，像这样的情形是会被描写成淫荡女子的表征。我摇了摇头，把杂念赶\n出脑中，现在我面前的是一个美丽而且全裸的绝色美女，正等着我的“宠幸”。于是，我继续\n上下其手，对着她的乳房和阴部施展我的功夫。\n看到她光滑的大腿，汩汩流着淫水的阴部，剧烈起伏的胸部，和涨得通红的脸，听到她的娇\n喘，我再也忍不住了。我把她的修长的腿放下，挺起我那早就硬得不能再硬的骄傲，把她的大\n腿根部放在我的膝盖上，龟头在她的阴蒂上一下一下的摩擦着，“哦……也……哦哦……啊\n……”，“不要啊……你在干什么~~~~~我不行了……哦，……”，我把龟头轻轻的放到她的\n“小建，不要再动了，我受不了呢，人家好痒，想要了。”她皱着眉头，脸色潮红，呼吸急\n促的说。\n我挑了挑她的乳头，这动作引起她再次扭动身子，娇喘吁吁，我笑着说：“你要什么呀？”\n“讨厌，人家???人家要????”我捏着乳房的动作时而轻，时而重，使得她的呼吸越\n来越急促，一句话说得声音越来越小??\n“要干嘛？”\n“人家??人家就是要你干我嘛?????”\n我几乎不太能相信我的耳朵，平时高高在上，堂堂的组织部干事，竟然会说出这样淫荡的话\n！不过这句话好熟，好像是刚看的电影中女主角的台词。\n“赶快来嘛，人家好想要你进来??进来这儿????”她将手伸到私处，用手指分开了那\n两片神秘的肉瓣，露出了阴道口???小敏一丝不挂地躺在床上，从掀开的被褥里裸露出她诱\n人的曲线，光滑的身体此刻满布着汗珠，连紧翘的乳房上都油亮亮地泛着一层汗液。小敏呈大\n字型躺着，从我趴着地方正好可以看见她两腿间那粉红色的嫩穴。我忍不住了，脱下内裤，亮\n出了我的武器，笑着说道：“你要我的这东西吗？”\n“对??对??就是这个??赶快来干我???”她微睁的眼看到我坚挺的阳具，兴奋地说\n。把她微闭的大腿也渐渐地打开，挺起阴部，露出了粉红的穴肉。敏感到我那里正在颤抖，\n知道我已经准备进入，我知道她的心中充满紧张，连忙用手抓住了她的细腰，顺势对准了小\n穴口，用力挺腰，猛地刺去。把阳具硬挺了进去。\n“啊！好痛！好痛??”她忽然痛苦地叫着。\n我一惊，难道她是处女？的确，我的阳具在阴道口遭到很大的阻碍，我以为是她的阴道比较\n紧，或是她尚未完全湿润，难道先前的淫态并不是因为她曾有过的性经验？\n我抚着她的脸问道：“你是第一次吗？”\n她似乎是忍着极大痛苦，幽怨的看着我说：“你还说这样的话，人家把自己的处女给了你，\n你还说这种糟蹋人家的话。”说着说着，眼角微微地湿润起来。\n我感动了，刚才以为小敏早已不是处子，没想到她真的保留了第一次给了我。因为我一直以\n为漂亮的女人很早就被人干。我捧着她的脸说：“好，是我的错，为了补偿你，我就让你达到\n快乐的顶峰。”说着，我稍用点力，下半身向着她的腰压下去，我的阳具又插入一些。\n“好痛！”她痛苦地闭起眼睛。睁开眼时，已经流出了眼泪。我也不大好过，小敏的阴道实\n在太紧了，夹得我的阴茎也很痛！处女的第一次对男女双方来说，都得忍受些痛苦。\n她大力地吸着气，似乎这样可以减少些痛苦，眉头紧皱，咬着嘴唇，看得出她是忍受着极大\n的痛楚。我让她的身子完全躺下，我则移起上身，用手把她的双脚分得很开，这样应该可以减\n少些她的痛。\n过了一段时间，她痛苦的表情渐渐舒缓，我顺势慢慢深入，遭受的阻碍也没有起先的那么大\n。从她越来越沉重的呼吸，和逐渐展露欢愉的表情，可以看出她已经脱离处女的痛苦，开始能\n享受成熟女人的肉体快乐了！\n她阴道内的爱液越来越多，我的阴茎已经可以顺利地抽送自如，于是我可以开始享受这种活\n塞运动带给我的快乐，和征服女性肉体的成就感。那种龟头被阴道里层层皱皮磨擦的舒畅感\n觉，确非言语所能形容，全身的感觉神经都集中在男女性器官接触的几寸部位，一抽一送都引\n起莫名的美快，一进一退都带来无比的欢愉。性交就像不停产生爱欲电流的发电机，把磨擦产\n生出来的震撼人心电流往双方输送，然后聚集在大脑中，储到了一定程度，便燃起爱火花，爆\n发出让人如痴如醉的性高潮。我忘掉一切，脑空如洗，净心体味着抽送中传来的一阵一阵快\n感，领略着和她灵欲交流中所得到的爱情真谛。虽然反复又反复做着同一动作，但受到的刺激\n却越来越强，双眼望着阴茎的大龟头在她阴道不停地出出入入，把不断流出的淫水磨成无数\n的细小泡泡，黏满在整枝阴茎上，白花花的遮盖在上面，弄得面目全非。阴茎和窄洞之间的缝\n隙，淫水还在继续涌出，她开始忍不住气呼呼的要娇吟起来，\n“啊……啊……”娇呼声。长长的阳具挺向子宫，她感觉被她扶摸过的龟头正在她小腹内跳\n动。虽然还没完全进去，但是顶在子宫的酥麻感让她自动缩紧小穴。我的阳具被她的阴道紧紧\n挟住后产生不可言喻的快感，不禁扭动屁股搅拌了几下，慢慢地往外抽出，只见长长的阳具闪\n着晶莹的淫水。待龟头抽至穴口时，我缓缓地插入那淫热多汁的小穴，龟头顶押着子宫转了几\n下，然后再慢慢抽出。我缓缓推进，又缓缓撤退，感觉到她的肌肉一寸一寸被我的全长伸展着\n，又一寸一寸地回复着。她双眼紧闭，享受着这种近乎撕裂的快感，和推进最深处时对着核点\n的刺激。\n这样重复几次后，她也忍不住暗自抛臀吸穴，被我揉转子宫时也会哼出“喔唔……喔唔……\n”的浪声，水汪汪的杏眼流转着迷蒙的水光，粉脸泛出桃红色的艳姿，那副羞赧中带着淫荡的\n旖旎春色令我再也不能把持，我狠狠地向前一击。“啪答！”阴阜撞击声。她被干得仰起下颔\n，蹙紧着眉心吐出了一阵鼻音的呻吟。\n“嗯……”（好深哪……这样干我会受不了的……子宫好酸……）\n小敏这时抬起因兴奋而颤抖的一条大腿，硬梆梆的肉棒就在她大腿之间进出的抽送着！小敏\n的反应也很激烈，身体慢慢拱起腰部几乎悬空，喘息声越来越紧密大声。此时，淫荡的她充\n满野性的诱惑力。\n全身的重心集中在长条阳具的前端当作支撑，我气喘嘘嘘地挑下乳白色奶罩的肩带，逼迫她\n暴露雪白的酥胸，（啊呀……好迷人的奶子呀……）。敏如急速地喘息着，我则两手又接过紧\n握住她的乳房，然后以指尖轻微地搓揉着敏如娇艳欲滴的乳头。那乳头一受到刺激，渐渐变\n得更为硬挺、更为肿胀，令我又爱又恨，不停地用嘴又吻又咬。\n“啊！啊！好┅┅好！”小敏也兴奋了起来，满口荡语地唤喊而出。\n我高高架起她修长玉腿，用足力气一下快似一下地猛抽狠送，十指掐住像布丁在晃动的乳房\n，拼了命插着她的粉嫩小穴。阳具不断地攻击她前后摇动的身体，她咬着牙忍受从子宫传来的\n震撼力，只是“嗯……嗯……”地哼，淫水不停地喷泄，我也感到她的淫水间歇地溅到我的大\n腿，一面干着她一面喘着气对她说：“你……你真是个尤物啊……”\n“嗯……嗯……不要停……我……喔……唔……快受不了了……哦……”\n随着我的抽送，我的睾丸也不停地撞击着小敏的美臀，小敏的身体也应着我的抽送晃动着，\n一对乳房像钟摆一样来回摇摆，她的双手紧攥着我的背，双眸微闭，眉头紧皱，朱唇轻启，\n自喉中挤出让人销魂的呻吟声。下体不断涌出的淫液把她和我的阴毛都弄得一片潮湿。粗大\n的阴茎与紧窄的阴道壁之间的剧烈磨擦刺激着二人体内的潜在淫欲┅┅\n只听见两人交合处发出“唧唧唧”的淫汁声响，我像拉风箱一样上下挺动屁股，快速奸淫着\n她。我忽地抱住她的大腿压向酥胸，想来个更深入的姿势。这时，我看见她那闪着晶光的淫水\n正缓缓涌出插着阳具的粉嫩阴户，滑过臀沟滴落在床上……\n我接着把阳具深深插入她的穴里，一抽一送时比起先前的摩擦感还要刺激。而这种压着金元\n宝的姿势也让她觉得那根炽热的炮管正毫不留情地往她阴道深处猛烈攻击，好像每一下都深深\n地戳进了子宫。\n“哦呵……哦呵……哦……太深了……我会死掉的……哦唔……唔……饶了我……”\n听见她那种娇声求饶的浪语，我更是发了疯地玩起狂蜂戏蕊的淫招。\n“呼……呼……爽吧……说呀……说呀……”\n“嗯……是……我……好爽……”她现在已经被干得欲仙欲死，她只能像个金元宝似的任我\n尽意冲刺，淫水还外泄不止。\n我卖力的抽插着，只听到“噗滋、噗滋”、“唧咕、唧咕”的插穴声在狭小的空间不断地回\n响，像在鼓掌回应着我卖力的抽插。“啊┅┅啊啊┅┅啊┅┅啊啊啊┅┅！啊啊啊┅┅啊啊\n啊┅┅！啊┅┅！”并交杂着小芸的浪叫声，形成了诱人悦耳的性交乐章。而我是伟大的指挥\n，利用着胯下的指挥棒，操控全局！\n她胸膛开始剧烈地上下起伏喘息着。我逐渐加快冲刺的速度，一次又一次地顶碰她的核点。\n撞击的力道传递到她的上身，泛红的双乳也随着韵律，来回弹跳着。我低下头去，张大了口，\n尝试捕捉她弹跳不已的乳峰。一次，两次，终于攫住了她怒涨的桃红。\n瞬时间，她再也克制不住，双腿圈住我的腰部，大声的呼喊请求着更多的欢愉。“噢！噢！\n噢！???干我！???噢！???干我！??用力的干我！???”\n“嗯┅┅嗯┅┅嗯┅┅嗯┅┅喔┅┅！”小敏无意识地疯叫着，我则猛戳动下身，并欣赏着\n她那陶醉的表情，感到更加兴奋、更加满足，棒子充血至极点了。\n我加快冲刺的速度，心知撑不了多久。有心要缓上一缓，小敏的乞求和呻吟却让我慢不下来\n。我一次又一次地刺入她的深处。她的双腿紧紧的夹着我的腰，抬高了臀部迎合着我的撞击。\n以近乎垂直的角度，对她的娇躯一波波地蹂躏着。\n我这时已经血管燃滚，龟头开此颤抖不停，戳插的速度加快，屁股的劲道更为加力。小敏也\n伸手抱着我，我前后的来回抽动，她则扭转着屁股配合着我戳干的节奏。\n我冲刺的速度提升到极点，我的肉棒被刺激得成了一只发了疯的狂龙一般，开始激烈地戳干\n小敏那又滑又有伸缩性的润阴道。汗珠从我额上流下，汇聚在我的下巴，一滴滴地溅散在她布\n满晶莹汗滴的胸脯。小敏陷入半狂乱的状态，她的头激烈地左右摇晃，双手用力搥打着床面。\n“噢！???噢！???”我知道我已经到达我的极限了，在下面任何一秒钟我都会彻底地失\n控。我使出疲惫肌肉里仅存的一点力量，一面粗暴地亲吻她的乳房，一面重重地对她施以最后\n数击。\n“啊啊啊┅┅啊┅┅啊┅┅啊┅┅喔┅┅！”每一次都使小敏都发出痛苦和快乐混在一起的\n哀怨啜泣声。小敏也以夹紧屁股的肌肉，挺起淫穴作为回应。她早已迷失了，因为身体涌出来\n的快感让她没有时间考虑自己的回应，她只能本能的回应着我的抽插。\n突然间，小敏尖叫一声后，她停止动作，寂然无声，全身随即僵硬，身体粉碎般的强烈高潮\n袭击着她的大脑，全身都不断的颤抖，身体在无意识地猛烈地哆嗦着。在她体内深处，一圈\n肌肉套紧了我，剧烈地痉挛着。“哦……哦……嗯……好酥……哼……要泄了……要泄了……啊……”\n这时她的阴道急速收缩，我那根阳具好像也被紧紧挟住不能抽动，只感到被高温的柔软物团\n团包围，接着就有股黏液喷向龟头，阴道肌肉一紧一松，裹着我的阴茎在抽搐，一下子，阴茎\n像被温柔地按摩、龟头像被猛力吸啜，令尿道变成真空，引曳着我体内蠢蠢欲动的精液，牵扯\n出外。凭谁也难抵受着这样的刺激，我顿时丹田发热、小腹内压、龟头酥麻，身体不由自主地\n跟她一样发出颤抖，盘骨力抵她阴户，龟头和子宫颈紧贴，马眼在子宫口大张，随着突然而来\n的一个快乐大哆嗦，阳具在温暖的阴道里跟随脉搏跳动，一道浓热的精液顷刻就如万马奔腾般\n倾巢而出，从尿道里直射向她阴道深处。\n我的屁股一挺一挺的，我射————深深地将一注注白浊的液体射入她持续地痉挛的体内。\n任那喷出热浆的阴茎，在她体内把一股又一股的精液尽情地输送。无比的快意将大脑充塞得爆\n满，对外界所有一切全没反应，全身神经收到一个信号：就是高潮时那种休克般的窒息感觉\n。\n而她被我挤压得动弹不得，自己也正达到高潮，张着嘴角吐出仅余的气息“噫……”可以听\n见她微弱的声音，那是子宫被我热热的精液喷射时的感动声。她的小穴深处也一吸一吸的，要\n把我的精液吸干似的。\n我们都无力起身，只是互拥着汗流满身的对方，我趴在她的身上，和她一起喘着气。她轻抚\n着我的头发，时而用力抱紧我，用手轻拍着我的背，像个母亲在抚慰着小婴儿一样。\n过了许久，她轻轻地推开了我，从摆在一旁的皮包中拿出了面纸，擦拭着她身体里的我的精\n液，又温柔地帮我擦去我阴茎上残留的精液和血迹。她移动身子，露出了原本被她的臀部遮住\n，床上的一摊暗红色血渍；那是她的处女之血。小敏不发一言地擦拭着上面的血，而后，我们\n又躺了下来。我抚摸着她的长发说：“我真的想不到你是第一次。”小敏用手指着我的鼻子说\n：“少来，我知道你不是第一次干这种事，对不对。”我点点头，这并不是秘密，在她之前我\n有过满多的女人。\n她将头仰起，湿润的嘴唇封住了我的嘴，不等我有所反应，又很快的移开双唇。我抬头看着\n她的脸，突然我看见了她眼中那若隐若现的泪水。她猛的抱着我，吻我，紧紧的抱我。我手无\n举措，看着她的眼神。我不知道我什么时候有那么大的勇气，把她搂在我的怀里，发狂的吻她\n，吻她的脖子，眼睛和秀发……\n她开始轻声地啜泣。我默名的感到一阵心疼。我真的错了吗？？？？？？？？？",
			"added": 1568728944,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "这是我去年暑假刚开学时",
			"body": "这是我去年暑假刚开学去广州教函授课（我不是教师，是研究生）回长沙时在火车上与一位\n姓南的河北女孩子的一段半真半假的经历，真实发生了的是做爱前的那段，假的是做爱的过程\n了，因为其实我们是硬卧，只相互抚摩和亲吻了，性交是不敢的。而性交过程的描写和上次我\n在这里发表的与我正在读研的师姐那段一样，也是通过一些原英文小说翻译改写的，这是因为\n本人对于性爱过程非常喜欢欧化描写，想想自己写没有这么完美，便通过改译让大家欣赏。希\n望大家指教！（本人警告各位淫民：性交可能会“中招”（也就是染上性病），因此大家不要\n轻易和不熟的人做。\n而乱伦可能会搞出人命，更万万不可去搞。此文不禁转贴，但请保留以上一段。）\n＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊＊\n被吸引是必然的，在初次见面的一刹那。\n我从未见过如此精致如此快让我想和她身体接触的女孩。不仅仅是因为她的穿着，不仅仅是\n因为她那一丝不苟的发型，也不仅仅是因为她有一副凹凸有致的妙曼身材……还包括她那细腻\n生动的五官，和浮动在嘴角的浅笑，以及近乎妩媚的风韵。\n这是个宁静的傍晚，我刚刚上了从广州到长沙的火车，在软卧包厢里，她是我正对面的\n铺，车上人不是很挤，包厢里就我们两个，就那样开着门，面对面坐在床上。夕阳的余辉从窗\n外撒进来照在她的脸上，我突然觉得有些口干舌躁。\n“你好，你是到哪里？”\n她说道，“我到郴州，公司的业务。你呢”\n“我是回长沙的，我还是学生。”\n她突然把面孔仰起来，飞快地瞥了我一眼，然后目光又转向地面。可就在电光石火的瞬间，\n我有被电流击中的感觉！\n在谈话中我得知她叫南杏儿，今年20岁，在广州工作，是河北人。\n随后我们在这里坐了数个小时，谈天说地，无话不谈。天渐渐晚了，车窗外面一片深蓝\n依须可以看到一些房屋的影子。\n“恩，有些晚了，我想躺会儿”她突然露出一付非常古怪的眼神，她的脸上满是掩不住\n的调皮。\n“我还不想睡，我想和你聊，我可能喜欢上你了。”很奇怪的，我一下子胆子大起来了\n。\n她象是没有听到，把头转向窗外。\n也许是因为穿着过大的Ｔ恤，她胸罩的肩带已经跑了出来。\n我看着她，只想着亲吻她那微微裸露出来的肩膊。\n我咽了一下口水，她可能看到了，把头转过来，却只微微笑笑。\n我有些尴尬，说到：“说了这么久话，口倒干了。”\n她只是笑笑，我又看得醉了。\n她突然指指外面说，“看啊，大家都睡了，外面灯也灭了，不如睡觉把。”\n说完，她便自顾自地睡下去了，脸朝着我的方向，看着我。门还是开着的。\n我看看四周，只有隔壁有两个人，也早早的睡了。黑暗中，她的眸子闪烁着动人的光芒。\n我的下面已经硬了起来，在裤子前搭了一个小小的帐篷。而她的眼睛却正对着我的那里，她\n的脸一下子红了，把眼闭了起来。我的心突然狂跳起来，我做出了一个我从来不敢想的决定，\n我不但没有躺下或把被子盖在我的阴茎上，却把屁股往前挪了挪，我的阴茎离她的脸更近了，\n（南杏儿的脸紧靠在下铺朝我这边的床沿，我则坐在我这边的床沿），我几乎听得到自己的呼\n吸声，我喘息着，盯住她那微微露出的肩膀，我发现她突然打开了眼，脸红得吓人，马上又把\n头转到另一边了。我很泄气，觉得自己很流氓，一时不知如何是好，可是这时，我的心又开始\n疯狂的跳动起来，她居然突然又转过来了，眼睛虽然闭起来了，嘴角却挂着一些笑容，脸还是\n红的，我觉得她的脸甚至向前又移动了一些，我一下子又兴奋起来。我躺下了，脸和她靠得很\n紧，当然这样子我会很难受，因为我身子都几乎伸出一半了，我感觉到她呵出的热气，我下面\n涨得好难受，我看着她，心里蓬蓬乱跳，时间象是停止了，我脑子里一片空白，我不知道下一\n步我要干什么，我甚至都不知道自己想干什么，我只知道我很快乐，很兴奋，也不知道过了多\n久，我颤斗着伸出了我的手，放在了她的手上，好温软的一双手啊，我感觉自己已经无法呼吸\n了，她的气息却变得沉稳了，居然打开了眼睛，\n看了我一眼，我看不清她的表情，只是觉得很紧张，忙把手挪开了。她笑笑，我的天，她居\n然笑了，然后她坐起来，我紧张极了，我觉得自己象是被发现的罪犯，可是没想到，她只是说\n了一句：“你也睡不着吗？”又躺下了。我一下子激动起来，挣扎着看看了外面有没有人看见\n，又几乎只用了5秒钟就把门关掉了。。一回来把嘴亲过去了。在我印上南杏儿的嘴唇时，她\n的头向后仰着。我当时觉得自己太幸福了，我几乎快要死了。在确定没有任何人能看到我们时\n，柔情似水的她斜靠了过来，将自己丰满的胸膛压在我的身上。接下来是一次又一次的热吻，\n贪婪的我们彼此交换着唾液，而她则兴奋地低叫着。\n气氛变得很奇怪，在我的嘴唇来到了她衬衫的边缘处时。\n大而篷松的衬衫再也遮不住她那美妙无比的高隆处，单钮扣的胸罩暴露在我色欲的目光\n下。\n不放过每寸肌肤，我用舌尖慢慢地勾划着她软绵绵隆起处的曲线。\n她的肌肤尝起来有点咸，但是混杂了她少女乳香味后，却反而变成格外迷人的味道。\n背部有些酸痛，就在衣服一步步滑下裸露出她娇嫩的肌肤时，低低的呻吟也自她的樱唇\n中传出。我不由担心的看看外面，虽然这时门也关了，但我还是下意识地用手轻轻挡在她的嘴\n边了。\n在我的舌尖透过胸罩刺激她敏感的部位时，她那低低的呻吟马上变成压抑地欢叫。\n紧抱住我，她的手自动地将那富有弹性的罩杯拉到一边，将整个胸部暴露在傍晚火车略\n带有凉意的冷气中，而那可爱的小樱桃从天真无邪的粉红变成激情如火的深红。\n我贪婪地吸啜着，迫不及待地想品尝南杏儿纤细的娇体的滋味。\n无声地脱下胸罩，两人的身体几乎是立刻纠缠在一起。\n仿佛象被某个淫欲的神仙在冥冥中指引，我交叉双腿盘坐，而她则将双腿伸至他的臀部\n，坐在我的大腿上。\n就坐在我勃起的欲望间，她汹涌而出的蜜液很快地便将她纯棉制的小三角裤打湿。\n这个动作是如此的细微，又带着一丝丝莫名的悸动。\n我的唇自她的乳房移向雪白的颈部，她发出受到惊吓的低喘。\n在冷冷的空气中，湿润的皮肤变得相当的敏感，而就在我轻咬她的后颈时，她就被电殛\n般地颤抖着。她靠近了我，就在她紧贴在我的胸膛上时，我一只手将她的脸的按了过来，而另\n一只则偷偷拉开她三角裤的松紧带滑入其中。\n炎热的手指滑过她娇嫩的肌肤，慢慢地向下向下，直至最终没入她的臀部间的裂缝之中\n。\n我搂住她的脖子，就在两人微张的嘴唇间，如跳舞般的舌头不顾一切地彼此缠绵着。\n而在此同时，我的手指在她肥沃的花园中努力地工作着，呻吟逸出她的嘴唇，但旋即被\n更热烈的亲吻所压抑。\n洋溢着春情，她收缩良好的膣肉让我惊喜莫名。\n她坐了下来，边数着数边用我那坚挺的阴茎狂野地磨擦她的阴蒂。\n我的阴茎在她眼前跳跃着，她突然伏下身去，将我的阴茎完全吞入她饥渴的口中。\n龟头的马眼处传来一种特殊的气味，她用舌尖轻舔着并品尝那流出来的液体的味道。\n她的动作带给了我极大的震憾，让我深深地迷失其中。\n过不了多久，她停止了吸啜他的阴茎，再次坐上了我。\n有点衣衫不整，但是她却泰然自若地坐在我的上面。\n被某种神秘的力量所控制，我们含情脉脉地对视着，同一时刻，她渗出蜜液的洞穴已对\n准了我的鸡巴。非常平滑并且缓慢地，我俩的身体终于结合在一起。\n被强行分开的膣肉紧紧地回缩着，就在她一坐到底时，她的臀部与我的胯骨猛然相撞。\n我极力地挺上想要取悦于她，而她则双手按在我的肩膊上猛扭着蛇腰。\n圆润的臀部再加上无懈可击的曲线，甜美的犹如一个美梦般的，让我心旌神摇。\n缓慢但总是逐步加快的舞步，深深地互吻并品尝彼此口内的芳香与美味，沉醉在爱河的\n两人互相熟悉彼此的身体。我的手指强力地压挤着她的臀部，好象是要让她将双腿分得更开，\n又好象是为了让两人的身体更为紧贴。随着她上上下下，我的阴茎在洞穴内横冲直撞，搞得她\n下体变得更加地火热。动作越来越快，我俩的呻吟更为大声起来。我先前怕被发现的心情消失\n了，只剩下兴奋。。\n我的身体猛烈地震荡着，灼热的液体灌满了她隐秘的洞穴，并引发了她的高潮。\n我俩拥抱得紧紧的，似乎连一丝缝隙也不能存地他们中间。、\n激情并令人神颠倒的时刻，两人就象被温暖的海水浸泡一般懒洋洋地不想动弹。\n我们幻想着这一时刻永恒，但是最终它还是令人遗憾地过去了。\n坐在那里好一会儿，我们仍是含情地对视并温柔地亲吻。\n一切都平静下来，而他们也知道是必须结束的时间了，因为她马上就要到目的地了。\n我们分开身站了起来，互相为对方穿着衣服，我们什么也没有说，因为我们都很清楚这\n是我们的第一次亲密也是最后一次的亲密接触。我们享受了彼此，虽然有一天，我们会忘记对\n方的样子，可我知道，我们都永远会记得我们有过一次完美的接触，纯粹快乐毫无其它目的的\n接触。\n上次在性虎上发表文章以后，不少男女朋友都加了我，十分高兴的是我已和一名长沙的网友\n见过了，虽然有些局促，但是很开心，最可贵的是她能理解我而没有索取我的联系方式，体现\n了一夜情纯粹追求性快乐的精神，在这里我想感谢这位叫杏儿的朋友，谢谢她给予我的信任和\n快乐，所以在文章里把南小姐取名叫南杏儿，这是我的私心希望大家谅解。对于男性朋友的热\n情，本人深表谢意，但是请不要再加我，其中理由不再多说。女性朋友最好是湖南的，还有本\n人已有女友，感情很好，不想在性上牵涉感情，望谅解。QQ79970800说明是性虎的朋友就行，\n我一般在周日晚上8点到10点上网。",
			"added": 1568729161,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}