{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "[Desktop Software] The Tor Browser Bundle Thread",
			"body": "Tor Browser Bundle - Add your Downloaded hashes here:\n\nIntro:\nTor prevents people from learning your location or browsing habits.\nTor is for web browsers, instant messaging clients, and more.\nTor is free and open source for Windows, Mac, Linux/Unix, and Android",
			"added": 1469578665
		},
		{
			"topic_id": 2,
			"title": "[Android Software] ChatSecure Encrypted XMPP Messenger",
			"body": "ChatSecure is a free and open source messaging app that features OTR encryption over XMPP. You can connect to your existing accounts on Facebook or Google, create new accounts on public XMPP servers (including via Tor), or even connect to your own server for extra security.\n\nUnlike other apps that keep you stuck in their walled garden, ChatSecure is fully interoperable with other clients that support OTR and XMPP, such as Adium, Jitsi, and more.",
			"added": 1469585458
		},
		{
			"topic_id": 3,
			"title": "[Operating System] Tails Linux 2.5",
			"body": "Tails is a live operating system, that you can start on almost any computer from a DVD, USB stick, or SD card. It aims at preserving your privacy and anonymity, and helps you to:\n\n\n    use the Internet anonymously and circumvent censorship;\n    all connections to the Internet are forced to go through the Tor network;\n    leave no trace on the computer you are using unless you ask it explicitly;\n    use state-of-the-art cryptographic tools to encrypt your files, emails and instant messaging.\n",
			"added": 1470248640
		},
		{
			"topic_id": 4,
			"title": "[Desktop Software] Tox Secure P2P Instant Messenger (qTox 64-Bit) Windows",
			"body": "The Tox Project\n\nTox began a few years ago, in the wake of Edward Snowden's leaks regarding NSA spying activity. The idea was to create an instant messaging protocol that ran without any kind of central servers. The system would be distributed, peer-to-peer, and encrypted end-to-end, with no way to disable any of the encryption features; at the same time, the protocol would be easily usable by the layperson with no practical knowledge of cryptography or distributed systems. Work began during the Summer of 2013 by a single anonymous developer (who continues, to this day, to remain anonymous). This lone developer put together a library implementing the Tox protocol. The library provides all of the messaging and encryption facilities, and is completely decoupled from any user-interface; for an end-user to make use of Tox, they need a Tox client. Fast-forward a few years to today, and there exist several independent Tox client projects, and the original Tox core library implementation is nearing completion (in terms of features). Tox (both core and clients) has thousands of users, hundreds of contributors, and the project shows no sign of slowing down. Recently, a group of some of the project's major contributors have formed The Tox Project, an organization built around the protection, promotion, and advancement of Tox and its development.",
			"added": 1470366277
		}
	],
	"topic_vote": {
		"2_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"8_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1
	},
	"next_comment_id": 24,
	"comment": {
		"1_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 1,
				"body": "Windows Version 6.0.2_en-US.exe (Downloaded July ‎26, ‎2016, ‏‎11:34:33 PM)\nWindows MD5: D4B74112374B75B38A8174B1D37086FE\n\n\nPlease add your own hashes for the latest Windows version, as well as other operating systems. The cross-referencing of hashes by different people around the world should be enough to ensure integrity of the file.",
				"added": 1469578915
			},
			{
				"comment_id": 3,
				"body": "Don't forget that we need at least 3 verification's of the same version of the software. And by version, I mean that specific operating system. So Tor Browser Linux and Tor Browser Windows count as different versions. Similarly 32-bit and 64-Bit count as different versions.\n\nSo I think we need at least 3 independent verification's of a specific version of software to gain confidence that this is the original authentic software without a MITM attack affecting it's integrity.\n\nAlso do you think we should standardize on SHA-256 and MD5? Let me know your thoughts. I'm not an expert on this matter. Also I am using Hashtab for Windows as my hashing software. Hashtab's options also let you choose many diffe types of checksumming protocals, including SHA-256.",
				"added": 1469586606
			}
		],
		"2_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 2,
				"body": "ChatSecure APK Version 14.2.3 (Downloaded on 27th July 2016 at 03:15AM)\nSHA-256: 36D7D71C8A2115BDD2BD63BB639AF286EE3242CCE11CDB5C53378D1A7F35528E\nMD5: 746BE611A420D8C9E5E2C3C2AB6748C2",
				"added": 1469585834
			}
		],
		"2_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 4,
				"body": "Here is the website which links to the verified software (work in progress): http://127.0.0.1:43110/12oGb8xBjLYz23CGJxRQyzZ6mGybZokEKt/",
				"added": 1469587286
			}
		],
		"5_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 5,
				"body": "VeraCrypt Setup 1.17.exe (Downloaded on Jul 21, 2016, 16:28 GMT)\nSource: https://veracrypt.codeplex.com/releases/view/619351\nMD5: 90DDE977F561342D99EADAE410F9607C\nSHA256: 3CF0101F1C0CB2A07BF1F7294470F7F16536A4BF2C79805F380C955172476D05",
				"added": 1469934384
			},
			{
				"comment_id": 6,
				"body": "So we have two verifications for the Windows version. I verified it twice. Once by downloading it through my normal Browser, and the second time by downloading it through the Tor Browser. Got same checksum.\n\nWe need 1 more verification from somebody else so that we can put a green tick next to Veracrypt on the Repository site.",
				"added": 1469934486
			}
		],
		"3_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 7,
				"body": "tails-i386-2.5 (Downloaded on Aug 03, 2016, 15:58PM GMT)\nSource: https://tails.boum.org/torrents/files/tails-i386-2.5.torrent\nSHA256: AC1E5C08DBA8FD6CDB4149DE9956821247BDC9E991A000EC8838B8C613575578\nMD5: BA9A9A00DECE730A6C97CB2BB3527990",
				"added": 1470248710
			},
			{
				"comment_id": 17,
				"body": "> [negabit](#comment_3_1ELrvskr1xGbmZpbTWS9mC9U8fBouk1Em2): If we do Tails it'll have to be a magnet link, not a direct download. Sharing a file that big like this would be a nightmare.\n\nYeah I agree. We should do it as a magnet link. But we could try hosting the Tails Browser-based downloader/verifier. Tails, of all software, is high up on the list of NSA targets for MITM attacks and the dreaded FoxAcid. Surprised we never thought of it earlier.",
				"added": 1470367050
			}
		],
		"13_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 8,
				"body": "KeePass-1.31.zip (Downloaded on Aug 03, 2016, 19:30 GMT)\nSource: http://sourceforge.net/projects/keepass/files/KeePass%201.x/1.31/KeePass-1.31.zip\nSHA256: 6156E1F412659A05B829D0E203881F5721239C9E1434E3C1A3F57ED7CACA8C1F\nMD5: A22B67DC26A3E9A9B1DECC19847BF52F",
				"added": 1470249091
			}
		],
		"12_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 9,
				"body": "veracrypt-1.17-setup.tar.bz2 (Downloaded on August 03, 2016, 19:36 GMT)\nSource: https://veracrypt.codeplex.com/wikipage?title=Downloads\nSHA256: 5B4E7EB9D327D62F1F49CEF92F534FBC5E08CB252B2912C8E223EFAB6E0B128F\nMD5: E227D22F15E898DDB8DACF0494194DB4",
				"added": 1470249448
			}
		],
		"11_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 10,
				"body": "VeraCrypt_1.17.dmg (Downloaded on August 03, 2016, 19:39 GMT)\nSource: https://veracrypt.codeplex.com/wikipage?title=Downloads\nSHA256: FA62B0E84F993DC2C58966E4EEF91D8FDD3710913F78D62AA352E12187259F89\nMD5: 17E8851F25965542F431C515B395B6E5",
				"added": 1470249606
			}
		],
		"7_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 11,
				"body": "BleachBit-1.12-portable (Downloaded on August 03, 2016, 19:41 GMT)\nSource: https://www.bleachbit.org/download/file/t?file=BleachBit-1.12-portable.zip\nSHA256: 95767E40C22C9FE974D34941A6B08E24AB1CD50C7F00902B2A20AFC01EED67BC\nMD5: BE5E40FA0E0191FA9DCA3B4262C4F51D",
				"added": 1470249753
			}
		],
		"6_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 12,
				"body": "gpg4usb-0.3.3-2 (Downloaded on August 03, 2016, 19:44 GMT)\nSource: https://www.gpg4usb.org/gpg4usb-0.3.3-2.zip\nSHA256: 3C9643B219EF0D8BA6D69CEDEFBCA815E22107F92DCB1003314CC539FC984F1C\nMD5: AC624516B04F50A97780C89BC7D70A64",
				"added": 1470249942
			},
			{
				"comment_id": 13,
				"body": "Can we edit the title and make it clear this is the Windows version of GPG4USB?",
				"added": 1470311682
			},
			{
				"comment_id": 14,
				"body": "> [zeroexef](#comment_23_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): The .zip file actually covers all OSes\n\nGreat, thanks!",
				"added": 1470358422
			}
		],
		"4_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": [
			{
				"comment_id": 15,
				"body": "setup-qtox (Downloaded on August 05, 2016, 03:43 GMT)\nSource: https://build.tox.chat/view/qtox/job/qTox_pkg_windows_x86-64_stable_release/lastSuccessfulBuild/artifact/setup-qtox.exe\nSHA256: 8FDDEDE1AC9F51E8D73CB76B5F5B5C0BB10A45C6D9B9228D2BD2FE8A873D5A70\nMD5: 98D87BB174A5B83410EF634827446B58",
				"added": 1470366447
			},
			{
				"comment_id": 16,
				"body": "If anyone wants to add me on Tox, my username is: jhkduis9\n\n\nI want to test some of the features out. It sounds too good to be true. It uses P2P, so there is no central server gathering metadata. It's end to end encrypted and uses forward secrecy. It allows routing through Tor (https://wiki.tox.chat/users/tox_over_tor_tot), it allows Group Chats, it allows filesharing and it allows voice and video calls. It seems like an excellent collaboration platform. Is it capable of offline messaging too?",
				"added": 1470366678
			}
		],
		"4_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 18,
				"body": "> [zeroexef](#comment_22_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): Good point. I hadn't thought of that. I suppose that the safest way to do all this would be to completely automate the site then throw away the key, but that comes with some obvious problems as well. As it stands I am currently keeping the key on an encrypted drive using Veracrypt's Serpent(Twofish(AES)) and a 25+ character password. As far as I can tell this is the best I can do. Any further recommendations?\n\nPerhaps the site keys can be shared amongst a few trusted people and everytime a site modification has to be made, it first has to be discussed among the key owners?\n\nWould there be an automated script which can log which ZeroNetID made a particular change (so we can trace a source of malicious edits)?",
				"added": 1470367256
			},
			{
				"comment_id": 19,
				"body": "> [zeroexef](#comment_24_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf): The simple answer is I don't know. I don't think there's currently a way to do that, but I could always spend a few hours at some point seeing if I'm able to.It would be really helpful if somebody else with programming experience could look into making a script to do the auto checking. I'm thinking maybe a cron job that checks through the JSON files of ISRtalk and writes to a json file in zeroISR?  Gahh but that means I have to change the was zeroISR is made.Long story short, I'm not sure. Totally open to suggestions.\n> \n> As for the shared key, I don't know how I feel about that. On one hand if we distributed and a single admin decided they where mad, they could destroy the entire site. On the other, if I am the only one able to access it, I could do the same thing (Not that I would of course, but I understand that you're all putting your trust in a complete stranger). Also, and far more likely, at some point I'm bound to get bored/busy with something else and stop working on this project. What do you all do then? I guess you could clone the site, but then the issue of getting people to move arises.Again, not sure. What do you all think?\n\nI'm not sure how Bitcoin cryptography works but would there be a way for multiple private crypto keys to write to document/website on zeronet, in the same way that a PGP message can be decrypted by multiple recipients if their public key was included in the initial encryption of the message?\n\nThat way, multiple people can write to a zeronet document whilst having different keys. And it would be possible for the content.json to log exactly which private key made the last change.\n\nMaybe i'm 100% wrong on this.",
				"added": 1470415286
			},
			{
				"comment_id": 22,
				"body": "> [imurx](#comment_10_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo): Did something happened with the site that no one is talking now?\n\nI think we are busy with the ZeroMe at the moment. I am still trying to get a .bit domain for this place. I think zeroexef has been away for a few days too?",
				"added": 1471028059
			},
			{
				"comment_id": 23,
				"body": "> [imurx](#comment_11_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo): I was thinking about the .bit domain too, I went to mine bitcoin with what i can, but Im not getting any good thing\n\nYeah I find that mining Satoshi points in order to get a Bitcoin payout every Sunday is too laborious. So I tried going to a Bitcoin ATM machine today to buy some Bitcoin anonymously. But turns out my phone just had a picture of the QR code and the code was not linked to a Bitcoin wallet on my phone. So the ATM machine did not recognise my bitcoin address and let me buy bitcoins. So i'll try again tomorrow lol\n\nThe ATM type I encountered was a Lamassu Bitcoin ATM. But the camera was not recognising my Bitcoint public key QR code. Probably because I just right-clicked and saved the image of the QR code from Warpwallet but did not link it to a Bitcoin wallet(?). I dont know.",
				"added": 1471110324
			}
		],
		"14_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": [
			{
				"comment_id": 20,
				"body": "My Tox ID: D93BE2E777E39986290E542A90778BBC214DD5F6591D14264B975703F3BDE64FC39429A7E983\n\nHere is the guide to use Tox over Tor. By the way, if your status doesn't turn Green after you tried changing your port to 9050, try changing it to port 9150:\n\nhttps://wiki.tox.chat/users/tox_over_tor_tot",
				"added": 1470415591
			}
		],
		"2_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": [
			{
				"comment_id": 21,
				"body": "syncthing-windows-amd64-v0.14.3.zip (Downloaded on Aug 07, 2016, 02:38 GMT)\nSource: https://github.com/syncthing/syncthing/releases/download/v0.14.3/syncthing-windows-amd64-v0.14.3.zip\nSHA256: 4FA638658B995F4560D04369715E01B7B4A406706503A517CBE7D29580BEC33B\nMD5: EB57F1C23C77395508AF5FA98C5E54B4",
				"added": 1470533977
			}
		]
	},
	"comment_vote": {
		"1_1CMjV2r4EBpFt8VCcWWZKDysZXPcPExRNN": 1,
		"1_1M1NydTaLaFMVasfnksZtezUoqoiJTdmjE": 1,
		"1_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"2_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"7_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"15_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"3_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"4_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"6_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"23_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"19_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"3_1ELrvskr1xGbmZpbTWS9mC9U8fBouk1Em2": 1,
		"18_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"22_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"26_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"4_1GervYZoP82e8X1Rgc4wyMkJY2zSsJuq8t": 1,
		"20_17VwZEfWSUWb5RHkK9m1odnDdBfvjTL6Cp": 1,
		"24_1CSc14JKdGAQJfQsfCLrduhB6zU4oEMwBf": 1,
		"10_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1,
		"11_14J8mC3K7k5Ygx22uu9LUzGWnBoDAQdyDo": 1
	}
}