{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1579004517,
			"title": "Wiedza-Historia-Hitler i wojna.",
			"body": "2020.01.14.03.text-Wiedza-Historia-Hitler i wojna.\n\n-Hitler i wojna.\n\nGdyby nie nasz ukochany sojusznik obecny, oraz Watykan nie byłoby Hitlera u władzy a tym samym II Wojny Światowej.\nNie było by potęgi Hitlera gdyby nie pomoc, dostarczona z zewnątrz.\nJaką „ HITLER POZYSKAŁ”, ( łaskawie ). Oraz pożyczkę, czyli. KASE NA ZBROJENIA.\nInnym pośrednikiem pomiędzy wielkim biznesem a nazistami został absolwent Uniwersytetu Harvarda, Ernst „Putzi” Hanfstaengl, pół-Amerykanin, z bogatego środowiska handlarzy sztuki, i wydawców. „Putzi” ( niem. śliczny, bobas, milusi ) był w istocie podwójnym agentem, pracującym dla Hitlera, i dla USA. W latach 20. przedstawił wschodzącą gwiazdę NSDAP wpływowym ludziom z monachijskiej śmietanki, wydawcom, przedsiębiorcom i wysokim oficerom.\nHanfstaengl opuścił Niemcy w 1937 roku, a właściwie uciekł obawiając się niektórych ludzi, z kręgu Hitlera. W ciągu kilkunastu lat szpiegował nazistów na potrzeby Amerykanów i Brytyjczyków oraz pośredniczył w zagranicznym finansowaniu NSDAP. Dwunasty kanclerz Republiki Weimarskiej ( w kryzysowych latach 1930-1932 ) Heinrich Brüning z katolickiej Partii Centrum napisał w pamiętnikach, że już od 1923 roku. Hitler otrzymywał duże sumy z zagranicy. Miały one przechodzić przez szwajcarskie i szwedzkie banki.\nByć może jakimś tropem w tej sprawie jest spotkanie Hitlera z amerykańskim attaché wojskowym, kpt. Trumanem Smithem, do którego doszło w 1922 roku w Monachium.\nOficer wywiadu USA , nie był rzecz jasna jedynym amerykańskim zwolennikiem Hitlera. Innym, zdecydowanie bardziej znanym, okazał się Henry Ford. Przemysłowiec, założyciel Ford Motor Company i ojciec produkcji masowej, a oprócz tego zdeklarowany antysemita, obdarzył wodza NSDAP prawdziwym uwielbieniem.\nW 1938 roku, za zasługi dla III Rzeszy, Hitler uhonorował Forda Krzyżem Wielkim Orderu Orła Niemieckiego, czyli najwyższym odznaczeniem przyznawanym cudzoziemcom. Z kolei Amerykanin do tego stopnia podziwiał Führera, że na urodziny zwykł mu wysyłać czeki na 50-100 tys. reichsmarek. Zażyłość obu panów utrzymywała się przez wiele lat, nawet wówczas, gdy świat wiedział już o mordach popełnionych na cywilach..\nKoncern Ford Motor Company wybudował fabryki w Berlinie i Kolonii i zasilał kiesę NSDAP sporymi datkami. Ale amerykańskie pieniądze nie tylko tą drogą płynęły na konta hitlerowców. Dla przykładu spółka IG Farben w 1930 roku sfinansowała prawie połowę kosztów kampanii wyborczej NSDAP do parlamentu. Koncern powstał pięć lat wcześniej z połączenia (dzięki dolarom Rockefellera) sześciu największych niemieckich firm chemicznych. W przyszłości stał się kluczowym elementem niemieckiej machiny wojennej ( produkował m.in. cyklon „B”). Używany podczas wojny.\nW latach dwudziestych ogromne pieniądze pożyczały za oceanem zakłady stalowe Kruppa, a amerykańskie firmy zakładały przedsiębiorstwa w Niemczech. Należący do rodziny Du-Pont General Motors wykupił z kolei zakłady Opla w Rüsselsheim koło Frankfurtu nad Menem, zaś J.P. Morgan kontrolował niemieckie radio i przemysł elektrotechniczny (AEG i Siemens). Kilka lat później wszystkie te firmy złożyły się na wyborczy budżet Hitlera. I pomogły mu zapewnić zwycięstwo, które przesądziło o losie Europy.\nGdyby nie banki, Ameryki, i Anglii, to nie było by II WOJNY ŚWIATOWEJ ?\nTo tylko wierzchołek góry lodowej. Prawdziwym hitem tematu, jest, są, także personalne, i systemowe powiązania , pomiędzy bankami amerykańskimi i niemieckimi. To tędy płynęły fundusze na militaryzację Niemiec. Plus oczywiście zgoda, przyzwolenie, na Anschluss Austrii, to około. 40- ton złota. Plus zgoda na przyłączenie części Czechosłowacji, ( drugą cześć, „Zaolzie” przejęła Polska ). To rozwój ciężkiego przemysłu zbrojeniowego.. Z drugiej strony, finansowanie lewicy która neutralizowała socjaldemokrację, co utworzyło miejsce dla „NSDAP”\n.\nTyle w temacie wypowiada się Historia, plus dokumenty w archiwach. Gdyby nie życzliwość i wsparcie finansowe? To nie doszło by do takiej hekatomby.\nPytanie? KTO, SPOWODOWAŁ, DRUGĄ ŚWIATOWĄ-\nTo pytanie, jak zwykle pozostawiam bez odpowiedzi. Sami musicie, sobie na to pytanie odpowiedzieć. Możliwości macie wiele, jak to mówią, „Do wyboru i koloru”\n.\nPozdrawiam.",
			"added": 1579004516
		}
	],
	"topic_vote": {},
	"next_comment_id": 11,
	"comment": {
		"1578775053_17aRabPTNknRHnYR5v5gjvXcccuiGmChet": [
			{
				"comment_id": 1,
				"body": "Czesc, calkowicie zgadzam sie z przedmowca. Dodam od siebie, im nas wiecej, tym lepiej. Sprawnie dzialaujacy ZeroNet, to polowa sukcesu, Do zwyciestwa.",
				"added": 1578779461
			}
		],
		"1598022031_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 2,
				"body": "Ciekawe czy to działa? Jeśli tak, to jest rewelacja. Dlaczego wszędzie jest cicho na ten temat?",
				"added": 1598022707
			},
			{
				"comment_id": 3,
				"body": "Panowie @kapec i @driud. Ja jestem dorosłą osobą, i sama potrafię ocenić co jest dobre a co jest złe dla mnie i mojej rodziny. Od dawna nie korzystam z usług służby zdrowia. Bo to, nie służy mnie i mojej rodzinie. Zwykły weterynarz jest dużo lepszy od profesora lekarza. Weterynarz, który leczy rasowe konie. Bo takiego mam znajomego. Jego wiedza sprawiła, że podjęłam się nauki o ziołach. To dzięki niemu , dzisiaj zajmuję się ziołolecznictwem.\nLekarzy omijam szerokim łukiem. Szczególnie tych mocno utytułowanych. To są farbowane lisy. I dla pieniędzy zrobią wszystko. Wiem, bo pracowałam w służbie zdrowia, i odeszłam z stamtąd.",
				"added": 1598184330
			}
		],
		"1595964603_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 4,
				"body": "Słyszałam, co nieco na ten temat. To może być prawdziwe. Realnie jest wytłumaczone.",
				"added": 1599308346
			}
		],
		"1612049550_1HxF6zesCAqUtGzUYJ8WpE1TnLFsnQZw8s": [
			{
				"comment_id": 5,
				"body": "Panowie, nikt tutaj nie wspomniał o rozwijającym się wschodzie? Tam budują wszystko niezależne i od nowa. Nowe procesory, które przewyższają zachodnie , Yandex, który zastępuje google, i youtubę, Proszę sprawdzić jak to działa.\nJa osobiście korzystam z tych możliwości . Znalazłam tam super tłumacza języków i stron. Nie potrzeba się rejestrować, ani logować. Wszystko anonimowo, więc czego jeszcze można od nich chcieć?. Poprawność tłumaczeń też jest na wysokim poziomie, porównanie do google, to zadupie prehistoria. Może trzeba tam poszukać DNS-a.\nTo co zostało wymienione, to zgniły zachód. A może Chiny coś mają ciekawego? Sprawdzał ktoś może. To tak jak z Windowsem, każdy GO instaluje, a potem narzeka na świat. Że jest zły i niedobry. Że go szpiegują, podsłuchują, iyp.",
				"added": 1612120799
			}
		],
		"1615135071_1JkK5cZ229ocJ6uXrwHSYERvnq4cV2EiqZ": [
			{
				"comment_id": 6,
				"body": "To powala z nóg, czekam na drugą część. Dziękuję za umieszczenie tego materiału. To się moja rodzina zdziwi, jak się tego wszystkiego dowie.\nJeszcze raz Dziękuję.",
				"added": 1615141675
			}
		],
		"1616448209_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": [
			{
				"comment_id": 7,
				"body": "Tak działa Mafia, która rządzi Światem. Wszyscy są umoczeni.,",
				"added": 1616448910
			}
		],
		"1618538921_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 8,
				"body": "Szkoda czasu na Ubuntu.",
				"added": 1620842187
			}
		],
		"1621556211_1GggQzyJGUJQsTbYSHbjXi6YD98uzbVU2b": [
			{
				"comment_id": 9,
				"body": "*pomyślisz o obaleniu dyktatury*\nTo po prostu wyłączą tobie zasilanie, i powiedzą awaria systemu.",
				"added": 1621672423
			}
		],
		"1621774948_13nWT12swm7bcHPN7rNNCfUi8Bf5qycHSB": [
			{
				"comment_id": 10,
				"body": "Mała kropla drąży skałę. Niech Bażant widzi, że ludzie to widzą? I nie zapomną. Mogą kiedyś rozliczyć, chociaż to akurat jest mało prawdopodobne.",
				"added": 1621777450
			}
		]
	},
	"comment_vote": {}
}