{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"5_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1,
		"1_1Q2MDUJ54Qon73LRsrTovcweNsnRhpBcb8": 1,
		"1_1AAtVzfGMaNhYDCRcK66ZccerTxy5UPqqT": 1,
		"1_1FwhwYBwon26Z5aWnpnQteWspmprCBuPTj": 1,
		"6_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5": 1
	},
	"next_comment_id": 8,
	"comment": {
		"1_1Q9jUKoBpVsFgd3sWwURapdFnJcWcei7MU": [
			{
				"comment_id": 1,
				"body": "> [ripvapor](#comment_2_1PDo28BRpH6kZpuX2TwQHVAXC1XNNPPXpr): ¿Donde están todos los archivos locales? O sea, donde se guardan, para borrarlo todo, claramente\n\nArriba derecha en el circulo con el 0 dentro, si arrastras se muestra un menú. En \"Ficheros\", te sale a la derecha \"Open site directory\"",
				"added": 1525361967
			}
		],
		"1_1FwhwYBwon26Z5aWnpnQteWspmprCBuPTj": [
			{
				"comment_id": 2,
				"body": "dep fc",
				"added": 1525437488
			}
		],
		"1_1JJkfbPoQhrmjk6SpHWNf4MEEEWAwFv1C2": [
			{
				"comment_id": 3,
				"body": "> [ojeteman](#comment_1_1HgbbsEjzFFMur1kLqBmoj16V8rUYmyTyU): No sabría decirte, soy más de Xbox.\n> Espero haberte ayudado.\n\nLa hostia que malo.\n\nPor cierto, hay un sitio que se llama ZeroSites http://127.0.0.1:43110/Sites.ZeroNetwork.bit/ y ahi se muestran las paginas, entre ellas Play http://127.0.0.1:43110/1PLAYgDQboKojowD3kwdb3CtWmWaokXvfp/",
				"added": 1525440379
			}
		],
		"1_1AAtVzfGMaNhYDCRcK66ZccerTxy5UPqqT": [
			{
				"comment_id": 4,
				"body": "> [rotter](#comment_18_17S5FgSs8aAVn11ZtHGpiskwmGbH4oRgJ5): 0chan está muy bien pero al final no deja de ser un imageboard, no? Quiero decir, creo que zerotalk, que es todo lo cutre y limitado que puedas imaginar, es más foro que 0chan. También ocupará más espacio para todos con imágenes, etc. Todo es hablarlo o esperar que ZeroTalk se vaya desarrollando.\n> Nadie dijo que la libertad sería glamurosa.\n\nTienes razon, lo idea, seria mezclar 0chan y ZeroTalk. Me refiero a hacer un ZeroTalk con subforos en cuyos posts se puedan incrustar imagenes.",
				"added": 1525440549
			}
		],
		"1_19fU8RcgGQeeZ5uENZCvDLN6Rd1DaXRXCo": [
			{
				"comment_id": 5,
				"body": "Cual es el problema? Tor esta tambien para Mac\n\nQuieres decir que en lo de \"Tor\" arriba derecha de ZeroHello te da error o cómo, shur?",
				"added": 1525456266
			},
			{
				"comment_id": 7,
				"body": "> [patrullazero](#comment_2_12TyaKw4g16ddPsGsSzoHXHSRLXCEEQ6UH): ¿Estás en Windows o Linux? En Linux tienes una carpeta que se llama ZeroNet. Ahi hay un archivo en python que se llama start.py. Lo abres con un editor de texto y verás que hay unas lineas que dicen:\n> def main():    sys.argv = [sys.argv[0]]+[\"--open_browser\", \"default_browser\"]+sys.argv[1:]    zeronet.main()\n> Prueba a dejarlo así:\n> def main():    sys.argv = [sys.argv[0]]+[\"\", \"\"]+sys.argv[1:]    zeronet.main()\n> Si no funciona, vuelva a ponerlo como estaba. Yo no lo he probado.\n\nLo acabo de probar y no me funciona. Y me he pasado un buen rato buscando una manera, pero nada de lo que he cambiado parecia afectar al programa.\nDe hecho he probado a borrar el start.py que has mencionado y ZeroNet funcionaba como si nada.\n\nEdit: Segun la documentacion, se puede configurar lo de open_browser (https://zeronet.readthedocs.io/en/latest/faq/#is-it-possible-to-use-a-configuration-file), pero lo he intentado y no me ha funcionado, a lo mejor lo he hecho yo mal. A ver si alguien lo soluciona.",
				"added": 1525506364
			}
		]
	},
	"comment_vote": {}
}