{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1619252102,
			"title": "Advice Guide - The paths i found to improve mental health / destress / cognitivity / consciousness / productivity",
			"body": "copying this for you from my reddit post\n\nIt all starts with one thought: How to improve? The things i found on my way asking this question are published in this post. I always tried to follow current research and not all of this could be your way of the path. I will update as soon i got new insights and im open for science backed answers that can extend the list. Feel free to contribute and enjoy life.\nPoint 1 is freshly discovered, maybe it gets extended soon\n\nside note: most mentioned methods also improve autophagy , cleaning your cells from trash\n\n\n1. Nutrition:\n\nDo's=\n- Eat some Olive oil or/and Nuts , prevents high insulin\n- use the intermidity diet. 16 hours not eating / 8 hours eating- will keep your brain running and insuline low!\n- eat egg yolks and curcumin (turmeric) , they increase neuroplasticity \n- omega-3 fats (fish) intake, as well as l-theanine (tea)\n- vape nicotin inside an e-cigarette  , isolated nicotine helps boosting memory and learning whilst having harmful ingredients in normal cigarettes\n\nDon'ts=\n- Dont use preperates to cover brain or health needs! some of them are unhealthy cause they provide to much of a normaly healthy ingredient making you sick at the end\n- Dont eat high carbs! Things in your brain cant work nicely when the body produces to much insulin caused from carbs\n- dont drink cow milk, it blocks folate receptors and decreases methylation, which are improving your neuronal build (neurogenesis) , Goat’s and sheep’s milk products are usually fine—unless you have an autoimmune disease.\n\n\n2. Daily Routines\n\n- breath trough your nose : The benefits of nasal breathing are associated with how this breathing purifies, heats, moistens, and pressurizes the air. These changes to the air increase oxygen absorption by approximately 10-15%.\n\n- You all may know it : Meditation. A daily session of meditation , even in doses of 5-10 minutes per day can improve mood, destress, helps fokus\n\n-- Phone tools=\n- Mesmerize - with visual , audio and breath stimulation\n- Brain.fm - i prefer those sounds as they are binaural, bringing your head in a synchronized state with the selected mindset\n\n- Cold Showers : It releases anti-depressants and is an stress trainer. so its a good prevention if you seem to have a lot stress. i recommend to start cold and change it to warm later.\n\n- Brain training - also classical advice and a hot science topic as some scientists beliefe you just get better in the tasks , my opinion is if the brain gains neuronal connections , its a very good choice/thing. the average brain starts to slowly reduce unused parts at an age of 25!\n-- Phone tools= \n- Neuronation\n- Brain Wars\n- Nonogram King\n- Sudoku4two\n- Futoshiki\n- Hex2048\n- Loop: Energy\n- I Love Hue too\n\n- Sleep - sleep is used to store information in your long term memory, dont lose it! study shows that uncovered sleep can be restored in the next 2 days\n\n- Exercise physically - a healthy body keeps your mind running. dont try to overuse alcohol (healthy amount: 0,5 l each day on 5 days a week) and keep distance from drugs even if you think they provide you a brighter sight of how things are, they change your neuronal connections\n-- 10 minutes a day running will help to release neuronal builders and strengthen your allready existing neurons\n\n- Games - yes even games can help you, especially action games cause they fasten your cognitivity\n-- Phone Tools=\n- Dragon Fly\n- Death Worm\n- Fruit Ninja\n- Temple Run\n- Sonic Jump Fever\n- Smash it\n- Zombie Smasher\n- Race the Sun\n- Metal Madness\n- Mobile Legends\n- Jetpack Joyride\n- Real Boxing\n- Dead Target\n- Dancing Road\n- Shellfire\n- Kickflight\n- Overdrive\n- Bomb Bots Arena\n- Into the Dead\n\n- Learn : The more you remember the easier you will keep information, but be aware- the brain slowly fades unused information when it gets new input. Ask yourself before learning what it may help you with in the future to stay more motivated\n-- Phone Tools=\n- Audio Now\n- StudySmarter\n- Coursera\n- StoryShots\n- Deepstash\n- 12 Min\n- Inshorts\n\n- Plan your work : we are most productive in little time frames, this covers also learning. Dont multitask, if you excluded all unnecessary distractions, you can enter the highly effective flow state. motivate yourself when imagining why you do something. Theres no reason to think \"i cant\" , instead think \"i dont\". failure is the key to sucess , learn from it\n-- there are many proven methods to take care of the little time frames, here are two examples =\n- 25 minute , followed by 2 minute break , repeat 3 to 4 times until you choose a larger break of around 15 minutes\n- 90 minutes , followed by a 10-15 minute break\nthis also helps when doing things you dont like or if you are procrastinating - brain sends a pain reaction 20 minutes of time , if you overcome that period you will teach yourself its not that bad\nsurprisingly the same time span (20 minutes) is needed to decrease your focus, breaks will help you getting new information processed\n\n- Use your subconsciousness : Things become sticky when you repeatly hear or see them. Try to take a look on motivational short notices over the day\n-- Phone Tools=\n- Unlock your Mind\n\n\nAt the end i will leave you with a phone tool for stress prevention, called \"Skills\".\nI didnt mention the many self advice i got from book summarys and podcasts, to keep it informal mostly. Hope this helped you, have a nice one and dont forget to leave comments",
			"added": 1619252101
		}
	],
	"topic_vote": {
		"1619252102_16dVbybDseQBQnxdJDuQhCzYAij8iR8YEc": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1619252102_16dVbybDseQBQnxdJDuQhCzYAij8iR8YEc": [
			{
				"comment_id": 1,
				"body": "> [jpeer](#comment_3_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8): Nice summary. [...]\n\ngood point , i missed to add tea , currently allready using it daily for its benefits",
				"added": 1619302211
			},
			{
				"comment_id": 2,
				"body": "> [steakfries](#comment_47_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7): cow milk? otherwise thanks for the great post ! I will return :).\n\nyou are welcome. currently discovering the benefits of hearth-brain coherence trough meditation but i guess thats something thats an earn from regular practicing so not worth mention it here",
				"added": 1619407270
			}
		]
	},
	"comment_vote": {
		"3_1JMgYVF1m2q5WmTzMt38fheBfogLL3Uwq8": 1,
		"47_1EHQRReAygrSqdjF6A2EQp3tCBMyZYRCu7": 1
	}
}