{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1567787270_1BumxHqxXBHScLoq1wAJqiFZXJ4c1DcewG": 1,
		"1568918753_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": 1,
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1568918753_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": [
			{
				"comment_id": 1,
				"body": "> [aspidochelone](#comment_196_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): Concept: this reality is one of a large series of Days of Creation, parallel universes in which there \"are\"/\"were\" parallel versions of ourselves.  Causality violations in our universe lead to multiple potential solutions, of which conscious beings select one based on the perpendicular time with these other universes.  Question: in dreams, in fantasy, in recollection, can people access their parallel universe memories, including in some cases technologies and philosophies not presently known in this universe?  Do there exist transdimensional organizations, of which some of ourselves may already be associated, which can infiltrate and project to this universe? [...]\n\nI clicked on this thread whilst high and was not prepared for this. I hope I check this out sober too, seems kinda mindblowing.",
				"added": 1568940040
			}
		],
		"1568941688_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 2,
				"body": "> [styromaniac](#comment_1051_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): That's when you should have fun in the sandbox that is this world, as long as you're not risking a plague. Play and you'll discover something.\n\nI probably shouldn't play too much in this sandbox, I have a habit of finding game breaking bugs. Wow... that came out waaaaay more depressing than I thought.",
				"added": 1568992502
			}
		]
	},
	"comment_vote": {
		"1_115Sw9YQ3LgmK219Z3feoTbc8JxECrKC4r": 1,
		"196_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"5_1ATbMGy3hSpTHeHfkmX6kNRn2kbRT7fTHY": 1,
		"2_19WVEMLEDso1JfM3bnHXsjHVEQ1dr3VpvQ": 1,
		"961_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"22_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"43_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1,
		"21_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": 1,
		"1050_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"199_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1051_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"45_16PfVSZrUZuwTgs7wBt1t3ZK9rsvdskoe5": 1
	}
}