{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1556123202,
			"title": "What is https://zeroid.qc.to/ @nofish",
			"body": "@nofish: I'm getting a message when trying to register zeroid on chrome that this url is a phishing site. Additionally, going to this url directly in chrome and firefox both give a phishing warning.",
			"added": 1556123201
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1555759517_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [],
		"1556123202_19DYn6cniSuoTXfWAHkFPDcEtim51Bgg8B": [
			{
				"comment_id": 2,
				"body": "> [filips](#comment_7_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): How did you get to this URL? [...]\n\nVia the *real* zeroid zite. Also, a website can have multiple url's... therefore I was just asking if nofish also created this url or not.",
				"added": 1556126103
			}
		],
		"1556254561_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": [
			{
				"comment_id": 3,
				"body": "> [caryoscelus](#comment_147_13oRBYqNeUr6Tvgt4KkAT9FT4XRiKFBjnE): I think it's more logical to apply it to both. Although it may be easier to check with zites, i see no reason to treat it differently. [...]\n\nMinified code is still code. Let me clarify anyways: this blocklist only applies to zites and it's source code. If someone takes someone else's source code and minifies it, it still has to follow the rules of the license - they're still using the source code.\n\nAnyways, I mostly just wanted to point out that this is **not** a Blocklist for all copyrighted material, like videos, music, etc.",
				"added": 1556296721
			},
			{
				"comment_id": 4,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_71_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): Trojan horse for decentralized servers.  [...]\n\nDefinition of a Trojan:\n> A Trojan horse or Trojan is a type of malware that is often disguised as legitimate software. Trojans can be employed by cyber-thieves and hackers trying to gain access to users' systems. Users are typically tricked by some form of social engineering into loading and executing Trojans on their systems.\n\nDefinition of Malware:\n> software that is specifically designed to disrupt, damage, or gain unauthorized access to a computer system\n\nSo... This blocklist does what it says it does, it doesn't (and can't) disrupt, damage, or gain unauthorized access to your computer, there's no trickery involved, and the Blocklist only works if you manually click to enable it. How exactly is that a Trojan?\n\nAlso, I don't think you get the concept of what an **optional** Blocklist is or is supposed to do...",
				"added": 1556556347
			}
		]
	},
	"comment_vote": {
		"4_19DYn6cniSuoTXfWAHkFPDcEtim51Bgg8B": 1,
		"685_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}