{
	"title": "QianChen",
	"description": "Knowledge with Practice.",
	"links": "[一起探索零网的世界罢](https://zeronet.io/)\n\n[ZeroNet新手用户必看](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/?Post:34:ZeroNet%E6%96%B0%E6%89%8B%E7%94%A8%E6%88%B7%E5%BF%85%E7%9C%8B)\n\n* * *\n\n*   [ZeroMe](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/14RCzbGAdhe1aGTVUS97CazugJN6DG7yS2/qianchen@zeroid.bit)\n*   [Home](http://127.0.0.1:43110/qianchen.bit)​​​​​​​\n*   [区块链世界生存指南](http://127.0.0.1:43110/qianchen.bit/?Post:7:My+reaction+to+listen+%3C+A+Concise+Guide+to+survival+in+the+world+of+Blockchain+%3E%E5%90%AC%E3%80%8E%E5%8C%BA%E5%9D%97%E9%93%BE%E4%B8%96%E7%95%8C%E7%AE%80%E6%98%8E%E7%94%9F%E5%AD%98%E6%8C%87%E5%8D%97%E3%80%8F%E6%9C%89%E6%84%9F)\n\n*   [Thanks](http://127.0.0.1:43110/qianchen.bit/?Post:2:Thanks+for+leading+me+into+the+ZeroNet+world)\n\n* * *\n\n[Mail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/?to=qianchen)\n\n* * *\n\n*   [交换友情链接](http://127.0.0.1:43110/qianchen.bit/?Post:5:Welcome+linked+to+each+other)\n\n*   [行动派](http://127.0.0.1:43110/guixiang.bit/?Home)\n\n*   [陈佳的博客](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/?Home)\n\n*   [大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/?Home)\n\n*   [Cundhi](http://127.0.0.1:43110/1G8pzbZbQ65dWE6Lm6N71eFfCogaobXd6S/?Home)\n\n*   [FreeSpece](http://127.0.0.1:43110/freespece.bit/?Home)\n\n*   [The World of Codegass](http://127.0.0.1:43110/codegass.bit/?Home)\n\n*   [Shutdown](http://127.0.0.1:43110/shutdown-t.bit/?Home)\n\n*   [Shutdown-z](http://127.0.0.1:43110/shutdown-z.bit/?Home)",
	"next_post_id": 15,
	"demo": false,
	"modified": 1501749034,
	"post": [
		{
			"post_id": 14,
			"title": "什么是专业？",
			"date_published": 1501748907.923,
			"body": "“真正重要的东西，肉眼是看不见的，只有心灵才能洞察。”——《小王子》\n专业的人与非专业的人是有明显区别的，我们知道10000小时定律，我们知道刻意练习，我们知道需要通过思考和技能的锻炼变得专业。但什么是专业？它的本质，或者专业是如何形成的？\n\n* * *\n\n## 专业素养\n\n我敬仰的吴军老师在『得到』的“硅谷来信”第280封信“专业和业余的区别”中说是更专业是“优秀且稳定”。具体提到五点：\n\n*   首先，好的专业人士要在任何情况下为工作本身着想，他们不会因为看到患者是个瘾君子，态度就和对待一个社会名士有所不同，也不会因为最近自己的一些家庭变故就影响自己的工作。\n*   其次，专业素养意味着遵守流程和行业规范。即有章法。\n*   第三点，是否有专业素养体现在是否愿意花功夫寻找更好的答案，而不是交差了事。\n*   第四点，专业人士常常有完整的领域知识，或者说掌握了成体系的知识，而业余人士常常只掌握了一些知识点。前者因此具有分析问题，解决为止问题的能力，后者常常只能应用所知的一些知识。\n*   最后，就是具有专业素养的人是在动态中进步的。\n\n这些我非常认同，这是一个专业人的专业素养所包含的要素。\n\n此外，吴军老师也在第54封信“写道五级工程师和职业发展。”中提到工程师的五个等级：\n\n*   第一级：能独立解决问题，完成工程工作。\n*   第二级：能知道和带领其他人一同完成更有影响力的工作。\n*   第三级：能独立设计和实现产品并且在市场上获得成功。\n*   第四级：能设计和实现别人不能做出的产品。\n*   第五级：开创一个产业。\n\n这将专业的级别和阶梯都勾勒出来了。\n\n可我依然无法清晰明白什么是专业？它根本的不同，哪怕是明白根本不同的某一类比？用一个词、几个词或一句话形容“专业”，或是在我大脑中有一幅描述专业的画面。\n英文翻译专业得到两个词：Speciality，Professional。前者偏向是特长，后者偏向职业的。专业就是形成自有模型的手熟尔？\n\n## 灵感\n\n另一个我所敬仰的是90后百度营销部副总裁李靖，李叫兽。他在『混沌大学』中用3小时阐述了他对营销的思考与研究后得出的需求模型。\n他讲到的一点让我极有启发，所说的意思是做营销重要的不是营销活动，而是用户的需求，但很少有人真正明白需求是怎么形成的，导致营销的失败。\n随后他将需求分解为：缺乏感、目标物、能力。\n又对用户缺乏感的研究又分了五个视角：任务、时间、关系、群体、角色。\n又对视角中进行了心理细分，如群体视角下对应的心理有：渴望、从众、回避、融入（群体喜好与是否在群体之中两个维度的四分）等。\n我随即就将内容用思维导图的形式粗略表达出来：\n\n![xq.png (1917x1051)](data/img/post_14_xq.png)\n\n在『混沌大学』李叫兽演讲的结尾，讲述飞机起飞真正重要的是因为重力和空气动力学；刹那间我脑中浮现出一幅人体经络图，又出现一张汽车透视图。哦！是透视！是洞察！是拆解、组合、应用；是小王子的那句话：“真正重要的东西，肉眼是看不见的，只有心灵才能洞察。”\n真正的专业是透视、洞察、拆分，深度越深，越专业。正如专业的外科医生看到的病人不是常人所见的身体，而是肌肉、经脉、血管、脏器，还有脏器中的结构组织，甚至有其形成原因的掌握，病变的机理与处理等等等等。\n而我就在产品与营销的交界处，从“需求”本身深入，在心理学、管理学、经济学的结论基础上，结合工作并锻炼形成自己的专业及培养专业素养罢。"
		},
		{
			"post_id": 13,
			"title": "我的买车方式：贷款，但不走车贷，全款购车",
			"date_published": 1500976414.219,
			"body": "选好车，具体就要谈价钱和付款方式了。\n付款4s销售经理期望的是贷款，因为贷款除了利息，和全款相比，需要多支付盗抢险、贷款手续费、延保、续保押金；还得在4s店交购置税和代理上牌。网上也有人说GPS安装费用，加起来在4s店里贷款比全款多支出近万元。而全款只需要支付裸车钱与保险费就可以提车了，购置税和上牌可以自己办理。\n\n* * *\n\n这里还是需要着重说明下保险，有交强险、车船税、商业险；前两项没得选，按道理商业险可以选择自己交，但一般4s店为了佣金，和店内自营的保险，都会让用户店内购买商业保险，否则不卖车。\n商业保险有：车损、三者、司乘、盗抢、划痕、玻璃、自燃、涉水、无第三方特约、不计免赔。我买了车损、三者、司乘、玻璃、无第三方特约、不计免赔 ；没有买盗抢、涉水、自燃、划痕。盗抢现在的治安盗抢风险已经非常小；涉水只要操作得当，不在水里重新发动就不需要；自燃我相信日产的车不会；划痕，可以第二年再保。而当时司乘和玻璃是4s店自营的保险，300+810（2年玻璃险）。\n\n我是全款购车，但也没有那么多钱，我需要从其他地方贷得款项来购买，这就需要对比不同贷款的利率。在不考虑外部环境如通货膨胀之类，拿出了excel用IRR函数算了一下不同贷款方式的内部收益率。\n\n> 内部收益率(Internal Rate of Return (IRR))，就是资金流入现值总额与资金流出现值总额相等、净现值等于零时的折现率。\n\n简单来解释就是年化利率。\n下表就是不同贷款模式的年化利率（下表直接用IRR公式算出来是按月的，再×12就是年化的）。\n发现4s店贷款利息是比较高的就算是无息，算上手续费年化利息直逼10%。而银行信用卡电话说的贷款更是门道，说是手续费每月0.57%，但都是按借款总额来算，每个月还需要还本金，换算下来年化利息直逼13%。支付宝的借呗我是每天万三，换算下来11%也比信用卡好。最优的还是套现，但是不合规，每月千六，换算下来年化7%。\n当然如果没有更好的渠道，车贷给的选择还是不错的，不想折腾来钱的话就顺从4s店罢。\n\n![0.png (1133x742)](data/img/post_13_0.png)\n\n我选择全款买车原因是不想被4s店限制，不支付额外费用近万元。提车快。资金来源是贷款，比车贷要优惠。\n另外，我一开始跟4s店是说要贷款的，后来说明全款，价格变动不升反被谈下去1千并赠送底盘装甲（类似车底喷胶漆）、倒车雷达（只有影像没雷达）、贴膜、行车记录仪、脚垫、拖把和储物箱。"
		},
		{
			"post_id": 12,
			"title": "《源泉》首读感想：生命的意义是创造我自己",
			"date_published": 1499822231.857,
			"body": "书为：THE FOUNTAINHEAD 源泉\n作者：Ayn Rand 安·兰德\n出版社：重庆出版社\n\n这是公司安排读书季时书单中的一本，起初我并不在意，但从开始读到读完，几乎是一气呵成，让人欲罢不能。原因可能正是书中作者在一九六八年五月于纽约写的“二十五周年再版前言”所指出的：\n\n> 人类或其他任何活着的实体，在生命之初不是放弃，不是自我唾弃，也不是对自己的存在进行诅咒。那些都是需要一个腐败和堕落的过程的，这一腐败过程的速度因人而异。有些人刚碰到压力便放弃了；有些人出卖和背叛了自己的意识；有些人不知不觉地慢慢熄火了，却从来不知道自己何时已经失去了这种意识。然后，长者们蜂拥而止，百折不挠地教导他们说，成熟就是摈弃个人见解：放弃了价值观，他们便获得了安全感；失去了自尊，他们便具有了实践的可能。此时，所有这一切意识都消失殆尽了。然而，少数人坚持了下来，继续前进，深知这种热情是不可背叛的；同时，他们学会了如何使这种热情具有一定的目的，他们修整它，使之成形，并最后实现它。但是，无论前途如何，在人生之初，他们便开始寻求生命的无限潜能和人类的髙贵身影。\n> 并没有多少路标可寻。《源泉》是其中之一。\n> 《源泉》之所以具有如此恒久的魅力，其中一个根本的原因就在于——它是对青年志气的认可，同时它歌颂了人类的光荣，显示了人类的可能性有多大。\n\n* * *\n\n借用百度百科（与wikipedia相差不大）介绍下安·兰德：\n\n> 艾茵·兰德（Ayn Rand，1905年2月2日－1982年3月6日），原名“阿丽萨·济诺维耶芙娜·罗森鲍姆”（俄语：Алиса Зиновьевна Розенбаум），俄裔美国人，20世纪著名的哲学家、小说家和公共知识分子。她的哲学理论和小说开创了客观主义哲学运动，她同时也写下了《源泉》（The Fountainhead）、《阿特拉斯耸耸肩》（Atlas Shrugged）等数本畅销的小说。\n> 她的哲学和小说里强调个人主义的概念、理性的利己主义（“理性的私利”）、以及彻底自由放任的市场经济。她相信人们必须透过理性选择他们的价值观和行动；个人有绝对权利只为他自己的利益而活，无须为他人而牺牲自己的利益、但也不可强迫他人替自己牺牲；没有任何人有权利透过暴力或诈骗夺取他人的财产、或是透过暴力强加自己的价值观给他人。她的政治理念可以被形容为小政府主义和自由意志主义，虽然她从来没有使用第一个称呼自称过、而且相当厌恶第二个称呼。\n> 兰德的小说所要表达的目标是要展示她理想中的英雄：一个因为其能力和独立性格而与社会产生冲突的人，但却依然奋斗不懈朝她的理想迈进。\n\n## 生命的意义\n\n我读了《源泉》有一概括性的理解：\n**生命的意义**来源于**自我创造**，就像弓赋予树枝的意义；人本身的意义就是通过个体**独有的思考的能力**，为**满足自己**而成为创造者，而非满足他人成为依赖者。\n借用『得到』订阅专栏“武志红的心理学课”的开篇句式：“生命的意义是成为你自己”。我将“成为”改成“创造”，把“你”改为“我”，就是：“生命的意义是创造我自己”。创造是自发地去主动构建自己的意义。\n\n## 我所理解的主人公们\n\n霍华德·洛克：坚定的创造者，面对社会的反对和打击，坚持并最终获得社会认可。\n亨利凯·麦隆：中道崩殂的创造者，面对社会的反对坚持着，甚至疯狂，直到遇到接班人洛克。\n多米尼克·弗兰肯：创造者，融入社会让自己痛苦，最终脱离依赖，脱离痛苦。\n盖尔·华纳德：落败的创造者，面对社会提供依赖，获得事业成功；但在找回自己的路上被社会钳制而落败。\n埃斯沃斯·托黑：追求权力的依赖者，通过控制人们思想使人们依赖他，他的权力也依赖于被控制的人们。\n彼得·吉丁：追求认可的依赖者，通过依赖获得人们所给的荣誉或称认可；依赖人们而出卖自己的灵魂，一直被他人所左右，不顾自己的内心，最终人生变得毫无意义。\n\n其中多米尼克·弗兰肯是我最难理解的人物。起初以为是做自己不愿意做的事而感到痛苦，但她是主动的，不理解；直至阅读到“《人类简史》《未来简史》作者尤瓦尔·赫拉利采访录”，才知道她是因为洛克与现实有了联系，但又无法做到像洛克一样不在乎其他人，只得主动进入现实中的连接而承受痛苦。\n赫拉利：分辨什么是虚构和现实最好办法是痛苦 （suffering）。（感谢零网“三家村”[http://127.0.0.1:43110/platoer.bit/?Post:34）](http://127.0.0.1:43110/platoer.bit/?Post:34）)\n\n> Q:你在《人类简史》这本书中提到的最重要的一个概念就是 “虚构故事”（fiction），智人得以区别于其它人种的关键正是虚构故事的能力，而智人社会正是建立于共同信仰的虚构之上。你对虚构的定义也与大多数人理解的不太一样，不仅局限于宗教信仰，更涵盖了从金钱到政府的现代社会中诸多常见概念。这一理论是从何而来？ 如你所说，虚构在智人演化史上已成为不可或缺的一环，那么如果历史可以重来，或者存在另一个平行宇宙，你认为虚构还有如此的重要性么？\n> A：我对于虚构的理解基于科学研究，同时也受到冥想的影响。冥想使我能够区分现实和人类大脑建构出的虚幻故事。不过我想强调的是，虚构对于所有人类社会来说都是至关重要的。\n> 如果没有那些长期信念 —— 比如人类对于天堂的观点 —— 很难想象大规模的人类社会如何能运转起来。我们应该保留那些有用的虚构，同时学会区分虚幻与现实。在历史长河的大多数时间里，人们已经太过习惯于虚幻的故事，比如国家、比如神、比如金钱，以至于无法分辨出真正的现实。\n> 生活于公元前三千年的埃及人，在法老陵寝上刻下了太阳神——拉。\n> 如何分辨什么是虚构，什么又是真实的现实？最好的测试是痛苦 （suffering）。如果你想知道一件事是否是真的，问问自己：“它会感到痛苦么？”\n> 宙斯的神庙被烧毁的时候，宙斯没有遭受痛苦。银行破产的时候，银行没有遭受痛苦。国家在战争中受挫时，国家并没有遭受痛苦，真正遭受痛苦的是国民。投资者在股灾中失去所有财富的时候，他遭受了痛苦。母牛被迫与其新生的幼崽分离的时候，它遭受了痛苦。这才是现实。\n> 痛苦也可能来源于我们对虚构的信仰。比如，对于某一国家或宗教的信仰可能引发战争，而战争的结果是不计其数的家破人亡。战争的原因是虚构的，但痛苦是 100% 真实的。这也是为什么我们需要努力分辨哪些是虚构的故事，哪些是真实的现实。\n> 虚构故事很关键。如果没有诸如金钱、国家、公司等等人类虚构出的故事与规则的话，复杂的人类社会肯定无法运转。然而这些故事都只是工具而已。不要让这些工具成为我们的目标或尺度。如果我们忘记这是虚构故事的话，我们也会看不清现实。\n> 摘自《人类简史》《未来简史》作者尤瓦尔·赫拉利采访录\n\n## 创造者与依赖者的争斗\n\n我大脑中创造者与依赖者一直以来都在争斗着。\n我从小所接受的观念都是像彼得·吉丁一样，让自己遵从他人的想法，获得生活所必须的，也任其侵入我的人际边界，让我感到舒适。\n\n但我一直有种潜在的一股劲让我反抗，这属于“脑后有反骨”。表现出来就是倔，不顾一切地做我认为对的事情；当然我认为对的不全是对的。这是方法和能力的问题，试错交了“学费”，还是我父母替我出的。\n\n就这样在舒适和反抗中不断地切换，而个人能力停滞不前。\n\n原因就是没有自己真正想要创造的自己。至今也不是非常明确。\n\n然而前些时间从『得到』吴军专栏中听到他的精神导师“富兰克林”其中的一点：从改善身边开始；我想这也是吴军养成自律的原因罢。\n\n所以对于创造者与依赖者的争斗，对于现在的我，理性上创造者完胜；从目标、方法、行动上，试着采用“富兰克林”的可复制性的目标：从改善身边开始、培养更好的品格。也采用他的方法，或想办法做到，并坚持行动。\n\n富兰克林的品行/美德：\n\n> 1.  节制：食不可饱，酒不过量。\n> 2.  慎言：只讲对人对己有益之言，不说无聊琐碎的话。\n> 3.  条理：让拥有的每件东西都各有其位，让要做的每件事情都各有其时。\n> 4.  坚毅：一旦决定做一件事，就马上义无反顾地去做。\n> 5.  节俭：将钱用在于人于己有益的事情上，杜绝浪费。\n> 6.  勤奋：不耽误任何时间，总是在干有用的事情，终止不必要的行为。\n> 7.  真诚：不采用任何有害的欺骗行为，想问题和说话都要公平公正。\n> 8.  正直：绝不做损人利己之事。\n> 9.  适度：避免极端，避免别人对你产生怨恨。\n> 10.  清洁：绝不允许身体、服装和居所不洁。\n> 11.  心静：不为琐碎之事，寻常之事，和不可避免之事萦绕。\n> 12.  贞洁：不过度行房事，也不因男女关系损害和他人的关系。\n> 13.  谦卑：以耶稣和苏格拉底为楷模。\n\n吴军又添3条：\n\n> 1.  已所不欲，勿施于人。\n> 2.  守诺，守时。\n> 3.  一次只做一件事。\n\n方法是每周培养一点，注意自己记录做不到的（自我及时反馈），周而复始。\n\n| 周次 | 美德 | 解释 | 周日 | 周一 | 周二 | 周三 | 周四 | 周五 | 周六 |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- |\n| 1 | 节制 | 食不可饱，酒不过量。 | --- | --- | --- | --- | --- | --- | --- |\n| 2 | 慎言 | 只讲对人对己有益之言，不说无聊琐碎的话。 | --- | --- | --- | --- | --- | --- | --- |\n| 3 | 条理 | 让拥有的每件东西都各有其位，让要做的每件事情都各有其时。 | --- | --- | --- | --- | --- | --- | --- |\n| 4 | 坚毅 | 一旦决定做一件事，就马上义无反顾地去做。 | --- | --- | --- | --- | --- | --- | --- |\n| 5 | 节俭 | 将钱用在于人于己有益的事情上，杜绝浪费。 | --- | --- | --- | --- | --- | --- | --- |\n| 6 | 勤奋 | 不耽误任何时间，总是在干有用的事情，终止不必要的行为。 | --- | --- | --- | --- | --- | --- | --- |\n| 7 | 真诚 | 不采用任何有害的欺骗行为，想问题和说话都要公平公正。 | --- | --- | --- | --- | --- | --- | --- |\n| 8 | 正直 | 绝不做损人利己之事。 | --- | --- | --- | --- | --- | --- | --- |\n| 9 | 适度 | 避免极端，避免别人对你产生怨恨。 | --- | --- | --- | --- | --- | --- | --- |\n| 10 | 清洁 | 绝不允许身体、服装和居所不洁。 | --- | --- | --- | --- | --- | --- | --- |\n| 11 | 心静 | 不为琐碎之事，寻常之事，和不可避免之事萦绕。 | --- | --- | --- | --- | --- | --- | --- |\n| 12 | 贞洁 | 不过度行房事，也不因男女关系损害和他人的关系。 | --- | --- | --- | --- | --- | --- | --- |\n| 13 | 谦卑 | 以耶稣和苏格底为楷模。 | --- | --- | --- | --- | --- | --- | --- |\n| 14 | 已所不欲，勿施于人 | --- | --- | --- | --- | --- | --- | --- | --- |\n| 15 | 守诺，守时 | --- | --- | --- | --- | --- | --- | --- | --- |\n| 16 | 一次只做一件事 | --- | --- | --- | --- | --- | --- | --- | --- |\n\n就按此法创造自己的品格，并以改善自己，改善周边为目的，想办法做到。\n\n## 文章截取\n\n最后请容许我大段截取文末霍华德·洛克在法庭上的“申辩”内容：\n\n> \"几千年前，最早的人类发现了如何生火。他很可能就是被烧死在他教会他的兄弟们如何去点燃的树桩上。他被认为是一个与人类所害怕的恶魔打交道的坏人。然而此后，人类就有了火来取暖，来烹煮食物，来照亮他们的洞穴。他给他们留下了一份意想不到的厚礼，而且他把黑暗逐出了地球。经过了数个世纪以后，出现了发明车轮的第一个人。他很可能就是在他教会的兄弟们建造成的车架上被处以车裂的极刑。他被认为是一个冒险闯入禁区的越轨者。但是，从此，人类就有了跨越任何界线和范围的能力。他留给了他们未曾想到的厚礼，而且，他也打开了世界之门，开辟了通向世界的条条道路。\n> \"那个人，那个桀骛不驯、前无古人、后无来者的第一个人，站在人类有关自己起源的记载的每一个传奇的开端。普罗米修斯被锁在岩石上任凭秃鹰撕裂啄食——因为他从众神那里偷来了火种。亚当被判罪去受苦——因为他偷吃了智慧树上的果实。无论是什么样的传说，在人类的记忆深处的某个角落，人类知道它自身的光荣是与那第一个人分不开的，而且清楚，那个人为他的勇气付出了代价。\n> \"经历了多少个世纪，总会有人在新的道路上迈出宝贵的第一步，而他除了自己的先见和洞察力之外并没有任何别的装备。他们的目的各不相同，可是他们都有这样一个共性：他们迈出的那一步是第一步，那条道路是前人所没有走过的，那种想像力和洞察力不是模仿和剽窃而得来的，然而，他们得到的答复却是仇恨。那些伟大的创造者们——那些思想家、艺术家、科学家、发明家——在他们那个时代都是特立独行的。每一种伟大的新思想总是最先遭到反对。每一种伟大的新发明都被指责。第一台发动机被认为是愚蠢的。飞机曾被认为是异想天开。动力织布机被认为是罪恶的。麻醉被认为是不道德的。可是那些具有原创力、想像力和先见的人们继续勇往直前。他们斗争，他们忍受痛苦，而且付出代价。但他们赢了。\n> \"绝没有一个创造者是受到要为他的兄弟们服务的渴望所驱使，因为他们的兄弟们摈弃了他给予他们的礼物——那个礼物打破了他们日常生活中偷懒的惯例。他的真实便是他惟一的动力。他以自身的真实和自己的方式完成他个人的工作。一部交响曲、一本书、一台发动机、一种世界观、一架飞机或者一座建筑——那是他的目标和他的生命。重要的不是那些听众、读者、操作者、信徒、飞行员和住户，不是那些创造物的使用者，而是创造本身。是创造出来的事物，而非别人从中获得的好处。是那种赋予真实性以具体形式的创造。他抱守着自己的真理，将其置于一切之上，与所有人的意愿相违背。\n> \"他的洞察力，他的力量，他的勇气均来自他个人的精神。然而，个人的精神就是他的自我。是他的意识的本质。去思考，去感受，去判断，去行动一这便是自我的功能。\n> \"创造者并非无私。他们力量的全部秘密就在于——它是自给自足的，自我激发的，自我创造的。那就是奋斗目标，干劲和活力的源泉，是生命力——一种最原始的动力。创造者并不服务于任何人和任何事物。他一直是为自己而生存。\n> \"而且只有通过为他自己生存这种形式，他才能成就荣耀人类的伟大创举。这便是成就的本质。\n> \"除了通过自己的心智进行思想之外，人类便无法生存。他赤裸裸地来到这个世界。他的大脑就是他惟一的武器。动物是靠武力获得食物。人类并没有尖牙和利爪，也没有犄角触须和强健的肌肉。他的食物必须由他自己种植和捕猎而来。要种植，他就得有一个思考的过程。要捕杀猎物，他就需要武器，而为了制造武器又是一个思考的过程。从最简单的必需品到最髙深的抽象宗教活动，从车轮到摩天大楼，我们现在所具有的一切特征和我们从中发展的可能都来自于人的单一的属性——他的理性思考的功能。\n> \"但是，心智是个人的属性。并不存在所谓集体的大脑这样的东西，并不存在所谓集体的思想。由一群人所达成的一致只不过是一种妥协，只不过是从许许多多个人的思想中推断出来的一个结果而已。它只是再次推论的结果。首要的行动——推理过程本身——必须由每一个人来独自进行。我们可以将一顿饭分给许多人来吃。我们却无法在一个集体的胃里去消化这顿饭。没有一个人能用自己的肺来代替别人呼吸。没有哪个人能用自己的大脑代替别人去思考。人类身体和精神的所有功能都是他个人的东西。它们无法分享和转移。\n> \"我们继承了别人的思想成果。我们继承了那个车轮。我们制造出了马车。马车又变成了汽车。汽车又变成了飞机。但是，在整个这一过程中，我们从别人身上接受下来的只不过是他们思考的终极成果。前进的动力便是将前人的成果当做材料，利用它，创造出下一个成果。这种创造才能是不能给予他人的，也是不可能从別人那里获得的，更不可能与人分享，去模仿和剽窃。它属于单一的、个体的人。这种创造力所创造出来的东西是创造者的财富。人能相互学习，可是所有的学习只是材料的交换而已。谁也无法将思考的能力给予他人。然而，这种能力却是我们生存下来的惟一手段。\n> \"人类生来就没有被赋予任何东西。他们所需要的一切都必须得经过自己的生产而来。而且，在这个世界上，人类面临着他们最基本的选择：他只能在两种方式中任选其一——一是依靠他自己的头脑独立工作，还是像那些依靠别人的大脑来生存的寄生虫一样。创造者进行发明创造，而寄生虫则剽窃和模仿别人。创造者独自去面对大自然，而寄生虫则通过媒介面对大自然。\n> \"创造者所关心的是征服自然，而寄生虫所关心的则是征服他人。\n> \"创造者为他的工作而生存。他并不需要任何其他的人。他的首要目的存在于其自身，而寄生虫则是通过间接的方式来生存。他需要别人。别人成了他首要的动机。\n> \"创造者的最基本的需要就是独立。他理智的心灵在任何形式的强制之下都是无法发挥其作用的。它是不能被抑制和束缚的，不能被奉献给或者不能屈服于不管什么样的理由。它在功能上和动机上要求完全的独立。对于一个创造者来说，所有的与他人的关系都是从属性的。\n> \"那些二手货的基本需要就是保证他同他人的关系，以便得到别人的喂养。他将关系放在第一位。他宣称人类生存就是为了服务于他人。他鼓吹利他主义。\n> \"利他主义就是要求人为了他人而活着，而且将他人置于自我之上的一种学说。\"绝没有哪个人是为了他人而活。他不可能跟他们分享自己的精神，就像他不可能分享他人的身体一样。但是那些二手货却一直在把利他主义当做一种剥削他人的武器，而且将人类的道德原则的基础颠倒过来。人类被教会了各种毁灭创造者的箴言和戒律。依赖一直被当做一种美德灌输给人类。\n> \"那个试图为他人生存的人便是一个依赖者。他是一个自觉主动的寄生虫，而且他创造出那些需要他供养的寄生虫。利他主义在概念上也是不能令人信服的。现实中与之最接近的实例便是那种生来就是为了服务于他人的人——奴隶。如果说肉体上的奴役是令人厌恶的，那么精神上的奴性就更加令人厌恶了。那个被征服了的奴隶也还有一丝半点的荣誉感留存于心中。他还具有曾经抵抗过和认为自己的处境是邪恶的这种优点。但是，那种在爱的名义下自愿地使自己成为他人的奴隶的人，就是最低级最下贱的动物——他使人的尊严受到屈辱，而且他贬低了爱所具有的价值。然而，这正是利他主义的精髄。\n> \"人类一直被教导着去接受这样一种观念——人类最高的美德不是获取，而是给予。然而，如果没有被创造出来的东西，人是无法给予的。创造要先于分配——否则便无物资可分配了。创造者的需求先于任何可能的受益人。然而，我们却被教导着要去崇拜那些二手货——这些人并没有创造出任何东西，却大把地挥霍金钱，将施舍物发放给他人，其慷慨程度连创造出这种礼物的人都望尘莫及。我们称赞这是一种慈善行为，却对创造和成就不屑一顾。\n> \"人类一直被教导着以减轻他人的痛苦为第一要旨。可是痛苦是一种疾病。人要是碰到这种疾病，就尽一切努力来给人以安慰和帮助，以此作为检验美德的最髙标准，这无异于使痛苦成为生活中最重要的组成部分。那么人类一定希望看着别人痛苦——以便他们可以表现出美德。这就是利他主义的本质。创造者与这种疾病无关，而与生命力有关。他们的工作已经消灭了一种又一种形式的疾病，无论是人们肉体上的还是精神上的，他给痛苦中的人以更多的慰藉，其程度之高，令任何利他主义者难以想像。\n> \"人类一直接受这样的观念——听从别人的意见是一种美德。但是创造者恰恰是那个唱反调的人。人类接受的教导是——随波逐流是美德。但是，创造者正是那个逆水行舟的人。人类被教育说团结在一起是美德。但是，创造者恰恰就是那个特立独行的人。\n> \"人类被教导说，自我就是邪恶的代名词，而无私就是美德的最髙境界。可是创造者便是绝对意义上的自我主义者，而那个所谓的无私的人正是那个没有思想、没有感受、没有判断、没有行动的人，这些功能都只属于自我。\"\n> \"这种本质的颠倒是最可怕的。问题的关键一直被人曲解，人类到头来别无选择，也便没有了自由。就像善恶这两个极端一样，摆在人的面前的是两个概念：自我主义和利他主义。自我主义被理解成为了自我而去牺牲别人。而利他主义则被理解成为了他人而牺牲自我。而这种观念使人无可挽回地与他人拴在一起，他除了选择痛苦之外，一无所有：要么为了他人自己忍受痛苦，要么为了自我使他人蒙受痛苦。如果再加上一条，人必须在自我牺牲中发现快乐，陷阱便已经设好了。人被迫把受虐当做他的理想——他若不想成为一个受虐狂，便只能成为一个施虐狂。这是对人所犯下的最大的欺诈罪。\n> \"正是凭借这种手段，依赖和痛苦被作为人生的基础而永远存在下来。\n> \"真正的选择不应该在自我牺牲和支配他人之间进行，而在于选择独立还是依赖，选择创造者的准则还是二手货的准则。这是最根本的问题。它是一个选择生还是死的问题。创造者的准则是建立在允许人类生存这一理性需求的基础之上的，而二手货的准则是建立在无法生存的心理之上的。一切出自人类独立自我的动机都是善的。一切出自对于他人的依赖的动机都是邪恶的。\n> \"自我主义者并不是为自己牺牲他人。他超越于以任何方式利用他人的需求之上。他并不是通过他们来发挥作用的。他在任何基本的事情上都是与他们无关的。\n> 无论是他的目标，他的动机，他的思想，他的欲望，还是他的力量的源泉，都与他们无关。他不是为了他人而存在的——他也并不要求他人为了他而存在。这是人与人之间惟一的兄弟情谊和相互尊重的形式。\n> \"人的能力高低因人而异，可基本原则是不变的：一个人的独立程度以及他对于工作的那种原始的、发自内心的热爱，决定着他作为一个工作者的才能和作为一个人的价值所在。独立是人类衡量美德和价值的惟一尺度。是一个人的修养以及他将自己创造些什么，而不是他拥有什么或者为他人做过什么。个人的尊严并没有什么替代品。除了独立之外并不存在衡量个人尊严的标准。\n> \"在所有的得体的人际关系中，并不存在谁为谁作出牺牲的问题。一名建筑师需要客户，可那并不是说，他将自己的工作服从于他们的愿望。他们需要他，但是他并不是为了他们给予他一份委托书才去修建一幢房子的。当人们的个体利益一致的时候，当他们双方都希望交换他们的劳动时，他们才会全体一致地为了他们共同的利益自由地交换他们的劳动成果。如果他们并不希望如此，不能强迫他们与他人进行交易。他们有更深层次意义上的追求。这是人与人之间惟一可能的平等关系。除此之外，任何其他的关系都是一种奴隶同奴隶主，或者说受害者跟刽子手之间的关系。\n> \"没有任何工作是通过大多数的意见集体完成的。每一件创造性的工作无不是在单一的个人的思想的指引下完成的。一名建筑师需要许许多多的人来承建他设计的房屋。但是他并没有请求他们为他的设计进行表决。他们通过自由的协议而共同协作，而他们每一个人在行使各自的职能时都是自由的。一名建筑师使用他人生产出来的钢筋，玻璃和混凝土。但是，在他动用那些材料之前，它们仍然只不过是钢筋，是玻璃和混凝土而已。他用它们所建造的房屋便是他个人的成果，是他个人的财产。这是人与人之间惟一的得体的合作模式。\n> \"人世间首要的权利便是自我的权利。人类首要的使命就是对自己尽职尽责。他的道德戒律绝不是将自己的首要目标强加于那个叫做他人的人身上。假如他的希望根本是要不依赖他人的话，他的道德职责就是去做他所希望做的事情，包括他的创造能力的全部领域，他的思想以及他的工作，但是并不包括歹徒和恶棍，利他主义者和独裁者。\n> \"是人则独立思考，独立工作。是人则不能掠夺、剥削或者统治支配他人——要独立。掠夺、剥削和统治是以受害者为前提的。它们本身就包含着依赖他人。它们就是二手货。\n> \"统治者并不是自我主义者。他们绝无任何创造性可言。他们完全是通过他人而存在的。他们的目标就在于他人的屈服，在于奴役活动本身。他们如同乞丐、社会工作者以及匪徒和盗贼一样无法自立。至于他们是靠何种形式依赖他人，那无关紧要。\n> \"可是人们却被教导要将这些二手货——将那些专制君主们，皇帝们和独裁者们当做是自我主义的代表。通过这种骗局，唆使人们去毁灭自我，毁灭他们自己，毁灭别人。这一骗局的目的就是要毁灭创造者，或是控制他们。这两者是一回事。\n> \"从人类的历史一开始，这两种对抗就面对面地存在着：创造者和二手货。当第一个创造者发明了车轮时，第一个二手货便作出了反应，顺理成章地捏造出了利他主义。\n> \"创造者，尽管遭到否认、遭到反对、受到迫害、受人剥削和利用，却在继续前进着，以自己的精力负载着整个人类向前发展。二手货们除了为人类的发展过程设置障碍之外，没有丝毫贡献。这种对抗赛还有一个名字：个人主义对集体主义。\n> \"一个集体——一个种族，一个阶级，一个政权——这个集体的共同的利益就是每一次专制统治的借口和所谓理由。历史上每一种罪恶滔天的丑行都是以利他主义动机的名义犯下的。可曾有哪种自私的行为能够敌得过凭借利他主义的原则所施行的大屠杀呢？其过错究竟在于人们的虚伪，还是在于利他主义的本质呢？最可怕的刽子手就是最真挚的信奉者。他们相信通过断头台和行刑队能实现完美社会。没有人对他们的谋杀提出过质疑，因为他们的屠杀打的是利他主义的旗号。人们接受了人必须为他人作出牺牲这一观念。演员在不断地更换着，但是悲剧的程序依然未改变。一个起于对人类的爱的宣言，终将以一片血海而告终。只要人们相信如果某一种行为是无私的，那它便是善的这样一种观念，那么，这种悲剧就会继续上演。这种观念允许利他主义为所欲为，并且允许它强迫它的受害者们去承受痛苦。集体主义运动的领袖们并非只图私利，而只不过是观察其结果。\n> \"人们惟一可能彼此行使的善举和得体关系的惟一声明就是：不许干涉！\n> \"现在观察建立在个人主义原则之上的社会结果吧。这就是我们的国家。人类历史上最高尚的国家。这是一个具有最伟大的成就，最伟大的繁荣和最伟大的自由的国度。这个国家不是建立在无私的服务，自我牺牲，放弃自己的权利或者任何一条利他主义的戒律之上的。它是建立在个人有权追求幸福之上的。追求个人的幸福。不是任何他人的幸福，这是个人的、关乎自身的、利己的动机。看看其结果吧，问一问自己的良心吧。\n> \"这种冲突古已有之。人类明明已经快要找到真理了，但却每每又遭到毁灭，一种文明又一种文明相继衰落。文明就是朝着一个个人的社会前进的过程。野蛮人的存在都是公开的，受制于他所在的部落的法律约束。文明就是一个将个人从其间解放出来的过程。\n> \"而今，在我们这个时代，集体主义，这个二手货和二流子的信条，这个古老的怪物，又冒出来橫行霸道。它将人们推到了一种前所未有的、最粗鄙下流的层次。它造成了史无前例登峰造极的恐怖。它毒害了每一个心灵。它已经将欧洲的大部分吞噬。它正打算将我们的国家卷入旋涡。\n> \"我是一名建筑师。我深深地明白与这种教条借以建立的原则以及随之而来的是什么。我们即将走向一个我自己无法生存于其中的世界。\n> \"现在你们知道我为什么要炸毁科特兰德大楼了。\n> \"是我设计了科特兰德项目。我把它交给了你们。我又毁灭了它。\n> \"我之所以毁灭了它，是因为当初它的存在并不是出于我自愿的选择。它是一个双重的怪物。无论从形式上还是含义上都是如些。我不得不将它们都毁灭掉。其形式已经被两个自以为有权进行改进的二手货擅自修改，而他们要改动的却是他们无法创造和没有能力和资格去创造的东西。他们之所以觉得有权这么干，凭借的是那种普遍的默契——公众舆论认为出于利他主义的目的可以视任何权利而不顾，而且认为我的抗争是无法与之匹敌的。\n> \"我同意设计科特兰德工程不是出于任何别的原因，只是为了看到它按照我所设计的原样修建起来。那是我为自己的工作所幵的条件。我却没有得到应有的承诺。\n> \"我不怪彼得·吉丁。他也没办法。他与他的老板们签订了一份契约，但它却被弃之不顾。他许下诺言说，他所提供的建筑会按照我的设计去修建。这个诺言没有得到信守。一个人对于他的作品的热爱以及他捍卫它的权利现在竟然被当做一种含糊笼统和可有可无的东西。你们已经听到执行检察官说过了。为什么那些建筑被破了相？没有什么理由。这种行为如果不是因为某些自以为他们有权染指任何人的不论是精神还是物质财富的二手货的虚荣心的话，就绝不会有什么其他理由。是谁允许他们这么做的？并不是那几十个当权者们中的某个人。没有人愿意允许或者阻止这样的事。没有一个人该对此负责。没有一个人该受到责备。这正是一切集体行为的本质所在。\n> \"我并没有得到我所要求的报酬。可是科特兰德的所有者却从我身上得到了他们需要的东西。他们需要让人来设计一份设计图以修建一个尽可能成本低廉的工程。他们发现其他人中间没有一个能令他们中意。我具有这个能力，而且做到了。他们从我的工作中获取了利益，并且迫使我将它当做一份厚礼拱手送出去。但我并不是利他主义者。我不会奉送这种性质的礼物。\n> \"有人说我将穷人的家园炸毁了，可是他们忘了一点，要是没有我，那些穷人就不可能有这样一个独特的家园。那些关心穷人的人不得不来求我这个从来不被关注的人，以便能够帮助穷人。有人认为未来租户的贫穷给予了一个他们支配我作品的权利，并认为他们的需求构成了我生活的权利，认为我把任何要求于我的东西贡献出去是天经地义的事情。这就是那种正在吞噬着全世界的二手货的信条。\n> \"我到这儿来，就是想说，我并不承认任何人有权占有我生命中的任何一分钟，任何人也无权占有我的精力的任何一部分，也没权利占有我的成就中的任何一部分。无论是谁作的这个断言，无论他们的人数有多么庞大，或者无论他们有多么需要。\n> \"我希望到这儿来说明我是一个人，我并不是为了他人而存在的。\n> \"我非得说出来不可。世界正在这种无节制的自我牺牲中死去。\n> \"我想到这儿来说明，一个人的创作的整体性比任何慈善的努力都更为重要。正是不懂得这一点的人在毁灭这个世界。\n> \"我是想来这儿阐明我的看法的。我并不愿意依赖其他任何人而存在，也丝毫不理会任何人。\n> \"我不承认我对任何人负有什么责任，只有一条是例外的：尊重他们的自由并且绝不参加任何一个带有奴役性质的团体。如果我的国家不复存在了，我愿意把我在牢狱中所度过的十年贡献给我的国家。我将在感激中度过这十年——回忆着我的国家曾经的样子。那将是我所做出的最忠诚的行动一是为了我曾经的国家。那是我的忠诚行为，拒绝在这个已经将它取而代之的国度工作。\n> \"这也是我对于每一位曾经生活过并且被迫遭受过痛苦的创造者表示忠诚的行为——他们各自人生遭遇的罪魁祸首正是应该为我炸毁的科特兰德大楼负责的那种势力。也是对于他们所被迫度过的每一个孤独的、遭受否定的、饱受挫折和侮辱的备受煎熬的时刻，以及对他们所打赢过的那些战斗献上我的忠诚。对于每一位知名创造者，对每一位生活过、奋斗过，以及对那些还没有来得及得到承认便已经死去了的创造者表示并献上我的忠诚。对每一位身心都遭到毁灭的创造者的忠诚。对亨利·凯麦隆的忠诚。对斯蒂文·马勒瑞的忠诚。对某个不想被提到姓名，但是坐在这间法庭上，并且也知道我所说的是他的那个人，献上我的忠诚。\"\n\n还有托黑向吉丁所表述他的目的情节：\n\n> \"你让我感到恶心。\"托黑说，\"天哪，你多让我恶心，所有你们这些虚伪的感伤主义者都让我感到恶心！你跟随着我，你滔滔不绝地吟诵着我教给你的东西，你从中渔利——可是你却连向我承认你在做着什么事情的美德都没有。当你一看到事实的真相，你的脸色就发青。我想那是顺乎自然的事情，而准确地说，那正是我的主要武器——可是天哪！我对此厌倦了。我必须躲开你一会儿。那正是我为自己的一生上演的一出戏一是为了像你这样的小庸才上演的。为了保护你的感伤情调，你的故作姿态，你的良心和你所没有的内心宁静。那就是我为了我所要的东西而付出的代价——不过至少我还知道我必须付出这个代价。而且我对这个代价，或者说这笔交易，也并没有抱任何幻想。\"\n> \"你想……想要……什么，埃斯沃斯？\"\n> \"权力，皮迪。\"\n> 楼上房间里传来脚步声，有人在快活地蹦来跳去，天花板上仿佛有那么四五下敲击的声音。吸顶灯的灯座丁当作响，吉丁顺从地抬起头来，接着转回来，看着托黑。托黑脸上挂着一丝几乎是漠然的微笑。\n> \"你……过去总是说……\"吉丁口齿不清地开口要说，却又停住了。\n> \"我一直是这样说的。清清楚楚，明明白白，而且是公开坦率地说的。如果你不听，那并不是我的过错。当然，你是能够听到的，你只不过是不想听而已。对我来说，你这样做反而更安全些。我说过我有统治他人的欲望，就像所有我精神上的前辈们一样，不过我比他们要幸运些。我继承了他们劳动的果实，而且我将成为那个亲眼目睹着这一伟大的梦想变成现实的人。我现在就看到我身边的这种现实。我认识到这种现实的存在，可是我不喜欢它。我原来也没想喜欢它。获得愉悦的感觉并不是我的目的所在。我将得到我的能力所賦予我的满足感。我要成为统治者。\"\n> \"对……谁进行统治？\"\n> \"统治你，统治全世界的人。惟一的问题是操纵杆。如果你学会了如何去控制一个人的思想，那你就同样能够控制整个人类。是思想，彼得，要靠思想去控制，而不是凭借皮鞭和棍棒，更不是战火或火炮。所以说，恺撒们，阿提拉们，以及拿破仑们都是傻瓜，所以他们都不能长久地统治。我们能。彼得，思想就是那种无法统治的东西。必须要摧毁它。砸进一根楔子，伸手把它攥住——那个人就是你的了。你不必使用皮鞭——他自己就会将鞭子拿来，求你抽打他。上好他背面的发条——他自己的机械装置便帮你把工作全做了。利用他来对付他自己。想知道是怎么做到的吗？看看我有没有对你撒过谎。看你是不是没有把这一切听进去，将它们变成你自己的东西，可是你不想听，所以罪责在你，而不在于我。支配人们的思想的办法有很多。就举一个例子来说——要让人觉得他很渺小。让他自觉有罪或内疚。扼杀掉他的抱负和正直。要做到这一点是很难的。连你们中间最坏的人都要以他自己曲折的方式探索他们的理想。通过内心的腐败来摧毁一个人的正直，然后再利用其腐败来击垮他自身的正直。把它导向一个破坏所有人的正直的目标。宣扬和倡导无私奉献。告诉人类说他必须为了他人而活着。告诉他说，利他主义便是最高的理想。没有一个人曾经达到过这种理想，将来也没有哪一个人能达到。他身上的每一种生存动机都在呐喊着来对此表示抗议。可是，难道你不明白你所取得的成就吗？人类意识到了他的无能为力——他无法达到他所接受的那些崇高的价值观——而这就使他有负疚感和罪恶感，让他觉得自己本性卑劣，一文不值。既然最髙理想是遥不可及的，他便放弃了所有的理想，所有的渴望和抱负，放弃了一切个人的价值观。他认为，自己宣扬那种他无法付诸实践的东西是出于迫不得已。可是一个人不可能做半个好人，或者说做个大体上诚实的人。要维护他的正直，需要进行一场艰苦的斗争。明知道那是腐败，为什么还要去维护它呢？他的思想放弃了自尊，而此时，你便可以将他玩弄于股掌之间，而他则会对你俯首贴耳，惟命是从。他会很高兴听命于你因为他无法信赖自己，他觉得没有把握，内心是不纯洁的。这是其一。还有一种方式。毁灭人的价值观。扼杀他能够辨别伟大或者成就伟大的才能。伟大的人是无法对其进行支配和统治的。我们不想要任何伟大的人，不过不要否认伟大这一概念本身。从他的内部去毁灭它。伟大的都是罕见的，执拗的和特立独行的东西。设定放之四海而皆准的关于伟大成就的标准，向所有人开放，包括那些最差、最无能的人——那样你便将所有人内心的自强不息的动力阻断了，无论他是伟大的还是渺小的。你把一切努力都抬髙身价，达到优秀和完美的动机和诱因完全阻断了。嘲笑洛克，而将彼得·吉丁奉为一名伟大的建筑师，便已经将建筑学的概念摧毁了。抬髙洛伊丝·库克的身份，便等于摧毁了文学。捧红海尔·爱克，就等于摧垮了戏剧。赞美兰斯洛特·克鲁格，那样你就已经摧毁了出版业。不要动手去捣毁所有的神殿——那样你会吓坏他们的。将平庸之辈也安置在神殿里，将他们供奉起来就可以了——通过这种方式，那些神殿就已经被你夷为平地了。还有一种方式。以嘲笑来提髙你的杀伤力。笑声是人类快乐的工具。要学会将它当作一种杀伤性武器来使用。将它变成一种讥笑。简单至极。告诉他们去嘲笑一切。告诉他们幽默感是一种无限制的美德。不要让人的思想中留存任何神圣的东西——那样它的思想对他来说就不再神圣了。毁灭他内心深处对英雄的敬畏之心，你就已经将人类心目中的英雄悉数扼杀了。因为人是从来不拿讥笑当真的。他会俯首听命，而且他的顺从永无止境——任何事情都成——什么事都不要太当真了。还有一种方式。最重要的途径。绝对不能让人们感到幸福。幸福感是自我包容和自给自足的。有幸福感的人是无暇顾及你的，对你来说也是无用的。幸福的人都是自由的人。要在生活中将他们的快乐感毁灭掉。剥夺那些对他们来说是至关重要的，或者弥足珍贵的东西。迫使他们认识到个人的渴望这一简单的事实都是一种罪恶。使他们处在这样一种境地——在这里，说\"我想要如何如何\"不再是与生俱来的权利，而是一种可耻的丢脸事情。利他主义在其中是大有用武之地的。不幸的人会自动找上门来。他们需要你。他们会找你来寻求慰藉，.寻求支持，寻求逃避。大自然是不允许有真空存在的。掏空人的思想——所得的空间就任凭你来填补了。彼得，我不明白你为什么竟然看起来如此震惊。这是一切方式中最老掉牙的一种了。回顾一下历史吧。看看从亚洲到欧洲的伟大伦理和道德体系吧。他们宣扬的不都是对个人快乐的牺牲吗？在所有的错综复杂的冗长的措辞后面，它们不都是有一个共同反复的主题——牺牲、自制和自我否定吗？难道你还没有理解它们的主题曲——'放弃，放弃，再放弃'吗？再看看当今的道德风气吧。一切令人愉悦的东西一从香烟到性，到野心和获利的动机，统统被认为是堕落的和有罪。只要一且证明某样东西能使人快乐——那样东西就已经要被诅咒了。我们已经将快乐跟罪过紧紧捆到一起了。我们一直将快乐与罪恶联系在一起。所以我们已经扼住了人类的喉咙。将你的新生儿扔进一个自我牺牲的大熔炉里面，躺在一张撒满钉子的床上，到沙漠里去苦修，去抑制肉欲，不要跳舞，星期天不要去看电影，不要企图致富，不要吸烟，不要喝酒。那完全是一条对幸福的封锁线。这是个伟大的封锁线。傻瓜们以为这种性质的禁忌只不过是胡说八道。有些东西积淀了下来，有些却留了下来。可是在荒唐之中总是存在着一个目的的。不要费心地去检验一个愚蠢的念头——仅仅问问自己，它要达到的目的。宣扬牺牲的道德体系最终都发展成为超级大国，而且统治着数以百万计的人。当然了，你得将它包装起来。你必须告诉人们说，通过放弃一切使他们幸福的东西，他们将达到一种更髙级的幸福。你无须对此十分了解。只要使用冠冕堂皇的词语就够了。'普遍的和谐'、'不朽的精神'、'神圣的目标'、'天堂和极乐'、'人种优越'。彼得，都是内部的腐败。那只是一切的一切中最最古老的方式。这种滑稽戏已经上演了好几百年，而且人们还在不断地为之前赴后继，赴汤蹈火。然而，对此道德标准的检验是如此简单：你仅仅去听一听任何一位先知的宣讲，如果你听他提及牺牲——赶紧逃跑。比逃避一场阴谋更快地逃跑。原因如下：有人献祭，就有人享用祭品。有人提供服务，就有人享受服务。谁对你宣扬牺牲精神，对你大讲特讲奴隶与主人，谁就是那个被服务的对象——而且他打算成为奴隶主。不过，如果有人告诉你说你必须幸福，说幸福是你与生俱来的权利，说你所要尽的第一天职便是对自己负责——那便是一个不控制你灵魂的人。那个人对你一无所求。可是真让他任其所为，你准会发疯地大叫起来，大声咆哮着说他是个自私的魔鬼。所以，这个骗局才得以延续许多世纪。不过在里面，或许你也发现了点问题。我说过：'它是合乎情理的。'你明白吗？他们手里掌握着对付你的武器。理性。你必须很有把握，确保剥夺掉他们的理性。斩草先要除根。可是要当心。不要搞一刀切，不要公开彻底地否定理性，绝对不要完全公开地否定任何东西，得饶人处且饶人。不要公开说理性是邪恶的——尽管有些人已经这样做了，而且还取得了令人瞠目的成绩。你只要说理性是有限度的就行了，对他们说也有超越理性的东西。那是什么呢？你对此也不必讲得十分清楚。这个领域是无穷无尽的。\"直觉\"、'感觉'、'启示'、'具有神性的直感'、'辩证唯物主义'。如果你在某一个关键的地方被人抓住了破结，而且有人告诉你说，你的哲学没有意义——你也要以不变应万变。你就告诉他一还存在超乎理性之上的东西。说——在这个领域，他不能仅仅去思考，他必须去感受。他必须相信。只要吊销了理性的执照，鬼知遣你在乱弹什么琴。无论你什么时候需要，随时可以翻云覆雨。你已经将他置于手掌心了。你能控制得了一个有思想的人吗？我们不需要任何有思想的人。\"\n> 吉丁在地板上坐下来，就坐在梳妆台的旁边。他已经感觉到有些疲倦，而他只是将腿蜷缩了起来。他并不想放开梳妆台。靠着它，他感觉到安全，仿佛它仍然保卫着那封他已经交出去的信一样。\n> \"彼得，所有这一切你都听过了。你已经看到我实践了十年。你看到全世界到处都在这么做。你为什么还唾弃它呢？你没有权利坐在那里，怀着吃惊的正人君子的优越感瞪眼看着我。你就身处其中。你也有份儿，而且你必须继续走下去。你害怕看到它会造成什么后果。我可不怕。我来告诉你。那就是未来的世界。是我所希望的世界。那是一个顺从的世界，也是一个团结的世界。它是这样的，在这个世界里每个人的思想并不属于他自己，而一种是去猜测邻居的心思，而他的邻居也并没有自己的思想，而只是一种去猜测下一个邻居的企图。如此反复，彼得，全世界都是这样。因为每一个人都必须与他人的意见一致。在这样一个世界里，没有人会拥有自己的欲望，而他所有的努力都是冲着满足邻居的欲望这一目的去的，而这个邻居除了去满足下一个他们个人不存在的愿望之外，并没有任何的愿望，全世界都是如此，彼得。因为所有的人必须为所有的人服务。这个世界里没有人会为了类似金钱这样单纯的动机而工作，工作的惟一目的是那个无头的怪兽——声誉追随者们的支持——他们良好的评价——那些无权发表任何评价的人们的评价。活像一只章鱼，全是触须，而没有脑袋。判断力，彼得！没有判断力，只有投票处。以一种接近零点的平均——因为就不允许有个性存在。拆掉了马达的世界，只有一个靠手来起搏的心脏。我的手——极少数其他的像我一样的人的手。那些人很清楚，是什么使你们推选他们——你们这些伟大的、极好的普通人。当称你为普通人时，你并没有愤怒地跳起来反驳，这个渺小的普通的人，你已经喜欢并接受了这个称谓。你将髙居于殿堂之上，受人供奉和崇拜，你，那个渺小的人，这个令所有过去的统治者忌妒得辗转反侧、惶惶不安的，你这个绝对的至高无上的造物主、穆罕默德和耶稣的化身。人民的心声。一般人、平常人和大众。你知道'自我'一词的反义词吗？彼得，就是平庸之辈，就是喜欢讲陈腔滥调的人所创造的。可是就连陈腔滥调有时候还得有人来创造和发明。我们来进行这个发明和创造。人民的声音即上帝的声音。我们将享受无限的服从——来自那些除了谦恭之外一无所长的人。我们会称之为'服务'，会为服务颁发奖章。这将使人人奋勇争先，看谁服从得更多更好。除此之外将不会有别的区分的标志。没有别的个人成就可言。你能在这副图景中看到霍华德·洛克吗？看不到？那就别浪费时间来问愚蠢的问题了。一切不能被控制的东西必须消亡。而如果那些偏执狂坚持他们的出生是偶然现象，那他们也将活不过十二岁。当他们的大脑开始发挥作用时，他会因为感受到压力而爆炸。那种压力形成了一个了真空。你知道被带到阳光底下来的深水海洋生物的命运吗？未来洛克们的命运就是那样。你们其余的人就会微笑着服从。你注意到低能儿总是微笑吗？人类的第一次皱眉就是上帝第一次触摸他的额头，那是思想的触摸。可是我们将既没有上帝也没有思想。只有通过微笑来进行的投票。自动控制杆——统统都在说'是'……现在，如果你再稍微聪明一些——譬如，像你的前妻一样——你就会问：我们是什么人？是统治者们吗？我将怎样，埃斯沃斯·蒙克顿·托黑？而我就会说，是的，你说对了。你将会和我一样如愿以偿。我除了让你感到满意之外别无他求。撒谎、讨好，奉承你、称赞你，使你的虚荣心得到满足。去做有关人民和共同利益的演讲。彼得，我可怜的朋友，我是你所认识的中最无私的。我还不如你来得独立，而我刚才还在强迫你出卖你的灵魂。你至少还利用过别人以得到你自己可能从他们身上得到的好处。我不为自己索取任何东西。我利用他们是为了我可能为他们所做的事情。那是我惟一的职责和满足。我没有个人目的。我要的是权力。我要的是未来的世界。让所有的人为了所有的人而活着。让所有的人作出牺牲，而没有人从中获得利益。让所有的人遭受痛苦，而没有人享受快乐。阻碍发展的脚步。让一切停滞不前。在停滞与萧条中实现众生平等。所有人都服从所有人意志的支配。全面的奴隶制——甚至连一个主子的尊严都不存在。从奴隶到奴隶。一个巨大的圆圈——和完全的平等。这就是未来的世界。\"\n> \"埃斯沃斯……你……\"\n> \"神经错乱？不敢说出来吗？你坐在那儿，周围是你最后的希望——被你写满了的世界。觉得我神经不正常吗？看看你的周围吧。随便捡起一份报纸，读一读那些标题。它不就来了吗？它不就在你面前了吗？跟我所告诉过你的一模一样？欧洲不是已经被吞没了，而我们不也正在跌跌撞撞地亦步亦趋吗？我所说的一切都包含在一个词里——那就是集体主义。而那不正是我们这个世纪的神灵吗？共同行动。共同思想。共同感受。团结，一致，服从。服从，服务，牺牲。分裂和征服这是第一步。然后——联合和统治。我们终于找到了真理。还记得那位罗马皇帝吗？他说他但愿人类只有一个脖子，那样他就可以一刀将它砍下来。人们嘲笑了他好几百年。不过我们是笑在最后的。我们已经取得了他所没有取得的成就。我们已经教会了人们去团结。这就等于造就了一个脖子，为一条拴狗的皮带作好准备。我们找到了那句咒语。集体主义。看看欧洲吧，你这个傻瓜。难道你就不能透过胡扯和瞎聊看到其中的本质吗？一个国家都信奉这样一种信条：个人没有任何权力，集体高于一切。个人被视做洪水猛兽，而大众则被奉若神明。除了服务于大众，不得有任何动机和任何价值观。那是其中一种版本。这儿还有另一种版本。一个国家致力于个人没有任何权利，政权髙于一切的主张。个人被视做邪恶，而种族被奉若神明。除了服务于种族之外，不得有任何别的动机和美德。是我在说疯话吗？抑或这已经成为两块大陆上存在的冷酷现实？注意观察这一钳形运动。如果你厌倦了一种版本，那我们就把你推到另一种版本里去。我们使你来回运动，你只能二者选一。我们已经把门关上了。我们已安装好了那块硬币——它的正面的头像代表着集体主义，而反面还是代表集体主义。用一种猛烈抨击个人主义的教条去反对那种强烈谴责个人主义的教条。把你的灵魂出卖给一个委员会——或者交给一位领袖。但必须交权、交权、交权。彼得，这是我的方法。以毒攻毒。在婉转的措辞上煞费苦心，可是抱定一个主旨不放。给那些傻瓜们选择的机会，让他们髙兴——可是别忘了那个你必须达到的惟一目的。把那个个人消灭掉。扼杀人类的灵魂。其余的人会自动跟上来。像现在一样对世界局势洞若观火。现在你还认为我是疯子吗？彼得？\"\n> 吉丁伸直了两条腿坐在地板上。他抬起一只手端详着他的指尖，然后把其中一根手指放到嘴里，咬下一根倒刺。不过那动作是下意识的——那人已经只剩下一种单一的感觉，一种听觉，所以托黑心里清楚，他别想指望能得到什么回答。\n> 吉丁顺从地等待着，似乎并没有什么异议。刚才的话音停了下来，而现在他的职责就是等着它们再度响起来。\n> 托黑将双手放在椅子的扶手上，然后从手腕部位抬起他的两掌又重重地落在木制扶手上————-个微笑代表他的话讲完了。\n> \"谢谢你，彼得。\"他严肃地说，\"诚实是一个消除不了的东西。我一生都是在对大批的观众讲话。而这一次却是我永远不会有机会作的一个演讲。\"\n> \"别走，埃斯沃斯。\"\n> 托黑站在地板上面对吉丁，温和地笑起来。\n> \"彼得，这就是答案。这就是我的证明。你认识了我——因为我是这样的人，你知道我对你做过什么，你的灵魂里已经不存在任何价值观的幻象了。可你还是无法离开我，而且永远无法离得开我。你借理想之名而顺从我。你也会继续毫无理想地顺从我的。因为现在你只会这一套本事……晚上睡个好觉，彼得。\"\n\n下一步计划是读读她的《耸肩的阿特拉斯神》"
		},
		{
			"post_id": 11,
			"title": "Choosing a car 我的选车之路",
			"date_published": 1499236045.123,
			"body": "近期考虑买车，网上有好多车评，但听半天都是大量的信息堆积，总感觉哪不靠谱，缺少了最基本的逻辑，好在在一篇个人文章中提到“38侃车”，我找到“38侃车”后进去一听确实有我所认同基本逻辑。他还纠正了大多数人被营销所接受的错误观念。我只从我个人买车的角度进行分析。\n\n* * *\n\n## 用车诉求\n\n我们用车都是有主要诉求的；追求车体流线、美观，一定会损失车内空间，还有后座的舒适度；追求动力强劲和操控感，油耗就不会低；追求豪华，可靠性就会打折扣。\n就像玩游戏时的属性图（雷达图），每个人都想要全属性都最强的，但现实无法做到，如果全属性都最强，价格也最低，世界上就只有一款车了。\n对于现在的我，经济紧张，主要家用，所以属性的取舍是：费用支出少、安全性高、乘坐舒适、空间大、通过性强。\n\n## 如何费用支出少\n\n用车费用上除了买车所用的费用外还有养车费用，是综合的费用。牵扯到折旧、购置税、保险、油耗、保养、易损件更换（刹车盘、轮胎）、过保后的维修、停车等。“38侃车”还举了美国人说用车费用是说：How much per month. 也就是说美国人说车价是折算到每个月的费用，而非买车一次性的费用。当然他说到了美国人的为什么折算每个月的原因如长租等。中国可能买车时问不出来，但可以自己进行大概计算。\n\n*   折旧：这与市场有关，小众的车不容易二手转卖，折旧比较大。我选销量大的车。\n*   购置税：二手车虽然不用购置税，但几千的购置税与中国水深的二手车市场。我选择一手车。\n*   保险：第一年保险可能会被4s店强制上，之后的可以折一半。\n*   油耗：百公里相差2L的油耗，10万公里相差2000L；油耗与车重、发动机和离合器有关，但与发动机排量无关（排量与油耗是碗与饭的关系，小碗多来几碗饭吃的并不少。）；离合器比较了双离合与无级变速，省油我选择无级变速。还有选择轻车。选择轿车而非越野车。\n*   保养与维修：一般故障都是细节使然，比如发动机的活塞环、点火线圈、水泵、管路、管接头等。还是选择合资品牌，有细节标准要求高的流水线生产，统计数据故障率低的车型。\n*   易损件更换：不买小众车，这样更换零件通用，价格实惠。\n*   停车：经验上还是老老实实停车场，一张罚单200够停一个月了。\n\n## 如何安全性高\n\n安全性是撞车时人的安全性，车怎么样无所谓，人要活才有安全的意义。\n\n要安全安全安全：\n\n*   首先是系安全带；因为撞车时唯一能拉住自己的就是安全带。安全气囊的充气冲击力极大，如果没有安全带，安全气囊就是杀手。\n*   其次是车辆内部存储格要多；能不要装饰物件就不要；因为小物件在撞车时就是炸弹的碎片，杀伤力极大。\n*   最后是车体结构；从人向外辐射，是软硬软。与人贴近是软，防止硬物刺伤人。驾驶仓要硬，包括A柱、B柱、C柱、车顶、防火墙等等；需要保证车内空间，防止挤压人体，这是最后一道防线必须硬。最外层要软如发动机仓、后备箱等；有充足的缓冲吸能，增加缓冲距离和时间，根据动量守恒『Ft=mv2-mv1』，冲撞时间越长给到人的力就越小。此外还能看出质量越大的车\n    速度改变所需的力与时间的乘机越大，又根据力的作用是相互的，所以，开车远离大质量的车，大质量的车害人又害己。\n*   最后的最后是，开车要慢，证明公式如上，速度改变量小。\n\n“38侃车 ”提到一个视频，说一路虎与雷诺风景对撞，路虎外部刚硬但驾驶舱变形驾驶员收到挤压，雷诺风景外部软但驾驶舱完好，驾驶员完好。我找到了这个视频：\n[http://v.bitauto.com/vplay/9988.html](http://v.bitauto.com/vplay/9988.html)\n\n## 乘坐舒适、空间大、通过性强\n\n乘坐舒适：\n\n*   这需要座椅是软的，贴合人体工程学。\n*   这需要轴距是长的，后座可以伸开腿。\n*   这需要后座长度是能够到达膝部的，而不是偷视觉空间，是要足够舒适。\n*   这需要后做靠背角度是倾斜的，保证乘坐舒适。\n*   这需要后座中间是平的而非突起\n\n空间大：\n\n*   这恐怕得牺牲设计感，外形中规中矩，保证车内空间。\n*   后备箱空间要平整，突起会使使用率降低。\n*   车内储物空间也需要多。\n\n通过性强：\n\n*   地盘需要提高，不易拖底。\n*   这需要牺牲高速速度，底部乱流会大，速度过快，行驶感觉会变轻。\n\n## 品牌？\n\n品牌是一种对品质特征国别等抽象概念化的象征，但不迷信品牌。需要寻找符合需求的车。\n\n*   品牌不代表唯一：一切看情况。比如大众车柴油机技术强适合在德国畅销；大多数日本车省油与可靠性强，在美国畅销等。\n*   国别不明显1：全球经济一体化的今天，一辆车配件是来自各国的。\n*   国别不明显2：大集团来说，车辆会乱贴标。\n*   国别不明显3：同一国别不代表都是相同特征。比如可靠性普遍日本品牌好，但不是所有日本品牌都好，丰田本田日产好，不代表同样是日本的三菱等不好。\n*   品牌不代表所有车都符合品牌特征：同样品牌的不同车也有不同侧重点，也分不同级别。\n*   观念：大多数人买相机都买日系，是认同日系的技术。买车买日系却说是帮助小日本，或者说日本车不安全。主要是懂车的人少，宣传车的人多，错误宣传让大多数人的观念被带跑偏。反观，懂车的人之间一定也会惺惺相惜。\n\n## 我的选车\n\n经过一系列的试错讨论与学习之后。\n我以价钱、耗油、变速器为主要筛选，对销量、故障率、可靠性、空间、舒适度、为精选。\n车价10万左右，耗油百公里5L左右，无级变速；车轴在2700mm以上，后备箱平整并容积在500L以上，可靠性以J.D.POWER官网为依据：\n\n![84225046.png (1181x635)](data/img/post_11_84225046.png)\n\n同时搜索市内4s店数量，体验4S店服务质量，查询保养优惠等。\n\n看中东风日产轩逸。符合以上我的家庭使用预期。\n\n并且认为那些可以后期加装的如倒车影像等功能，不必要在原车上必须自带，当然具体情况具体分析。\n\n计算了下，购新车成本大约13万；四年折旧4万；油费按百公里5L，4年10万公里，油价7元计算为3.5万；停车费每月300计4年共1.44万；保险平均每年4千计4年共1.6万；保养10万公里保养20次，平均每次500，共1万，维修与易损件更换算0.5万。\n\n四年养车预计8.04万，四年内养车平均每月花费0.17万，四年后13万价值的车剩9万价值。\n\n加上买车花费的钱，四年来共花销21.04万，剩余9万价值的车。"
		},
		{
			"post_id": 10,
			"title": "Travels of Yuntai Mountain. \n2017年6月17-18日云台山游记",
			"date_published": 1497964239.62,
			"body": "2017年6月，公司组织月报编辑组成员独立成团游玩河南省焦作市的云台山，游玩了两天。云台山景点太多，我把景点分为两类，一类是以红石峡、潭瀑峡为主，是山林水瀑交融之美；另一类是以茱萸峰为主，是凌绝顶览众山之美。但这分类确有不妥之处，一是美景看细处处不同，二是观景人关注点也大不相同；我也就随念而写了。\n\n---\n\n###消失的瀑布\n我第一次听到云台山并没什么感觉，被告知是个名山，有着国家5A级旅游景区和全球首批世界地质公园两个响当当的名号。我搜了百度，看着介绍的确不错，属于太行山系；太行山，修仙圣地啊～我又搜了Wikipedia，打上Yuntai Mountain (Henan)，介绍不多，就两小段，看来主要是国内比较火热。\n在Wikipedia上我注意到一句话:“Situated within Yuntai Geo park, with a fall of 314 metres (1,030 ft), Yuntai waterfall is claimed as the tallest waterfall in China.”意思大概是云台山里有个高314米的瀑布，被宣称是中国最高的瀑布。下面还有张2012年7月的图片，是一张水流不大的瀑布图片。这让我想到了导游介绍中说的一个细节：在云台山景区开发时，是将瀑布景点作为最重要的景点。可是由于景区靠近临近省山西，水流上游是在山西省内，山西见下游景区火爆想分一杯羹，后没谈妥，山西就建了一个大坝，水就少了，甚至断了，并且只有雨季看上去才像个瀑布。这个导游很专业，这个预防针打得好。\n听完导游的话后我想到了经济学的“科斯定律”，简单说就是谁对资源利用的好，谁就应该掌握资源。我相信山西兴建大坝是为了保障上游山西的大多数人的利益或避免他们受到季节性的伤害。单是为了减少下游云台山的旅游收入，我是不认同的；还有可能是云台山景观相关人去山西出让利益期望不建大坝，但是大坝是民生工程，景区的利益不足以弥补，当然这只是猜测。所以云台山大瀑布的消失，非常遗憾，但也是一种妥协。当然导游打预防针所用的借口，这个锅，山西是背定了。\n\n\n###美景与意义\n\n虽说没有了大瀑布，但是水景还是很多的。红石峡、潭瀑峡这山水景色宛如置身江南春色之中，但又不同于江南，置身夹于两山之间，身旁是闪着点点亮光的山岩，抬头是与溪水辉映的线天，美不胜收。\n那些景点名字也很有意思，几乎都能找到典故：比如子房湖，是因汉代张良（字子房）曾站在沟谷西侧的山峰上，日夜操练兵马，帮助刘邦成就大业后又隐退到此而得名。不老泉，是在魏晋时有逸人王烈，不食人间烟火，渴饮此泉，饿食黄精，寿至338岁，仍然健步如飞，不减少年。不知是因典故而成景，还是见景而生典故不得而知，但事实是，这些名称确实作用非常。就拿“不老泉”举例，一路走来山泉不少但未有人驻足，直到不老泉处，人头攒动，有在路边接引流出来水的，也有翻入围栏，不惜冒着滑倒的风险去接顺着岩壁留下的泉水。水是非常干净的，在口渴之时饮之异常清凉甘甜，而此地水的意义“不老泉”恐怕是众多人争相接饮的原因。\n我当时就感到：人真的是活在意义之中的动物，意义非常重要，是一种寄托，抑郁症估计就是不知道自己意义的表现罢。想到“混沌大学”中李善有老师所介绍的人们是活在意义的范式之中的。一旦没有了这个范式，没有了一条路，人就好像漂浮在了太空之中，没有方向，没有路径，没有参照，感受不到生存的理由。又说回来，人不就是生于“太空”又归于“太空”，在人世间不停地寻找意义。而这山石、林木、溪水、落瀑处处都有着从古至今人们赋予它的意义，寄托着人们的期望，这么想来，景色更美了。\n\n###商业的价值\n\n我是第一次来到云台山，但这里的商业氛围异常熟悉，不论是小店卖的东西还是小店的外形、材质；甚至爬山时的石阶、木桥都是那么的熟悉。云台山开发的已经非常完善了，有一个细节就是联通的4G信号从峡谷底部到峰顶寺庙，一路上除了山洞隧道的短暂屏蔽外，都是极好的；群里沟通、发图、视频、游戏，顺畅无比。\n商业开发景区对景区的影响是一定的，部分酷爱自然登山观景爱好者一定会有所厌恶，会觉得商业让一个好端端的世外桃源变成了人头攒动的闹区，毫无起初苦行僧登高求法的意境。的确，对于有能力的少数人，商业是一种罪恶。但在科技发展至今的今天，人的能力越来越弱化，并不非常恰当地用王东岳《物演通论》的“递弱代偿”原理解释，商业是对人能力弱化的一种代偿，或许也进一步促进了人的能力弱化。如果没有商业，今天登山的大多数人可能在半山腰就渴死了，更别说汽车绕着盘山公路，穿过大小19个隧道（叠彩洞是云台山通往茱萸峰上的系列隧道。从1977年至1987年，历时十年修成，它由大小19个洞组成，隧洞全长4831米，上下落差912米，洞内均为180度的转弯，车辆在此每走百米，海拔平均上升5米。其中前14个隧洞开凿在相对的山崖上，公路好像鞋带儿一样从中穿过，因此也被戏称为“鞋带儿公路”）到达半山腰。\n我们人类整体已经没有办法走回头路了，想回也没能力回，所以旅游时不妨尽情拥抱商业，享受带来的便利与安全。话说，茱萸峰上卖的现做的一个零嘴非常好吃，叫不出名字，好像是用糖浆在白色的茱萸粉中拉成一簇白色的细丝，包卷住花生或其他果仁，小巧，一口一个，回味无穷。\n\n###登山的意义\n登山的确很累，沿途的上上下下，树木挡不住的太阳，近乎垂直的高阶。在一个岔路口听到别人家的导游说：“体力不行的回去，别上了。”我与同伴笑称“男人哪能体力不行，必须上！”。过了半小时左右，打退堂鼓的苗头出现了，庆幸的是我们相互说说笑笑，扶持帮忙终上峰顶，号称小北顶的茱萸峰顶，海拔1297.6米，当然起步点是千米高的半山腰出发的～\n快要接近山顶的时候是最兴奋的，迫不及待地拿出手机记录将要到达的峰顶-真武大帝庙，但是当我爬完（真的是爬的）大帝庙前近乎垂直而又威武高长的石阶后，却略感失落。\n一切对于终点的执着，对于终点的念想，在到达终点的刹那，消失了。靠着对终点的渴望来到终点，幸福感却不一会就消失殆尽，才发现最美好的原来是沿路的一切。那些在山顶拍照的人们，更多的可能是对登山过程的一种表达，一种充满怀念，充满感激的表达；而晒终点照片呢，就是想让他人知道他们达到终点的不容易，他们所付出的艰辛，和过程中获得的美好。\n所以我觉得登山的意义和价值，是对登山过程的感悟，是一种心怀目标，享受过程的态度。引申开来，是对于一切有终点的任务，抱有享受过程的心念和终点就是下一个起点的心态，不断挑战，不断向前，却又保持快乐和满足。\n\n\n\n"
		},
		{
			"post_id": 9,
			"title": "Crying for Jerry哭泣生命之脆弱—吕明洁",
			"date_published": 1497285578.065,
			"body": "我愿相信这世间的轮回，让生者坚强。\n\n> 2017年6月9日凌晨02：20，位于上虞杭州湾经济技术开发区的浙江林江股份有限公司（832834）发生一起事故，造成2人死亡1人受伤。\n\n我见过很多事故照片，听过很多事故故事，麻木了，无感了，类似的消息看了也只会默默地关掉页面不发一言。而这次，又一次，让我感到悲痛。因为其中有一个人叫吕明洁，是我的大学室友。\n\n* * *\n\n2009年入学那天，我是最后进入宿舍的，宿舍一共四张床柜，床柜上面是床，下面是书桌和衣柜。吕明洁的床柜是在进门后的右侧，在床沿贴着一张小标签，上面写着“1号床”，他坐在标签下方的凳子上，回头向我打招呼并冲我笑。他纤瘦的身材，不算太白的皮肤，带着一副常规的方方的眼镜，露着一口大白牙，头发是短的，但能明显看出是自然卷；略显热情，虽然显得不是那么熟练，但能感受到一种与我相同的纯真，应该和我一样从小是个乖孩子，努力读书，经过了中考、高考来到了浙理，分数应该还不低。这应该是我对他的第一印象了。熟了之后，因为吕明洁名字读音，由四号床沈键发起，后来我们都叫他Jerry。\n我们学校协会特别多，大一期间我们都会报一些协会，可能因为协会是记经历记学分的罢。吕明洁报了2个志愿者协会和一个散打俱乐部。记得刚开始练习散打的时候，吕明洁每天笑嘻嘻地在寝室里对着我们挥拳头；看着他那纤瘦的身材摆起不怎么标准的姿势，煞有其事地出拳；我们其他三个人在床上看着他，都笑得拍起来床边的栏杆。但吕明洁不在乎，他喜欢，他努力；后来，经过他不懈的努力，终于在篮球场上找回了自信～\n有一天晚上，不知是为什么，我们四人居然像女寝一样夜谈了起来；说道我们的梦想是什么，我记不清自己当初说了什么，但我清楚地知道吕明洁说的。他说他要做环保，做废品回收利用。我们探讨了一些“技术细节”和“发展前景”，不知不觉中好像明白了他为什么报了志愿者协会，也许是协会让吕明洁有了做环保的想法，或是因为有了想法而去选择了志愿者协会，我不清楚，但我知道每次协会组织的协会公益活动回来时，他都会带回一顶免费发的公益帽，不知道这些帽子还在不在了。\n吕明洁好像很“崇拜”我？我也不知道，据他说是因为他觉得我对女人很了解，难道是我装B装过了？毕业后吕明洁还带着他老婆，当时的女友来杭州找我；那天我也不知道我在忙些什么，最后就匆匆见了一面，久别重逢似地聊了几句，然后把他们送到了地铁口。没过多久我就去上虞参加了他们的婚礼，并且静静地看着他们闹洞房，快乐，幸福。\n他们家很大，是个三层的小别墅，不过只有他和他爸妈三人，当然后来有了老婆，老婆肚子里的孩子现在算来也有8个月了。我和二号床的孟川之前就来过他们家玩过，那时才刚装修，在他们家二楼借宿过一晚，夜很静，很舒服。后来毕业后孟川和吕明洁一样在上虞开始了工作。作为大学毕业生，一般是作为管理者进入工作岗位的，他们就是。因为我工作与专业不相关，所以也不明白他们的工作细节。但我知道，那里一定很辛苦，因为管人是个艺术，尤其对于每经验的刚毕业的大学生而言，一般都会吃些苦头。但我不知道为什么都过了4年，还需要吃苦头，而且这苦头吃的太大了。\nJerry一直很努力，在我脑子里关于他的画面最清楚的就是两张，一张是他打拳击的时候，还有一张就是在夜间点着台灯努力学习的背影，自然卷的短发，不算白的的皮肤，纤瘦的身材，方方的眼镜。为什么会牵扯到他？“风险无处不在。”“你永远不知道意外和明天哪个先到来。”这些当年做保险时候的声音在我耳边出现，我很反感，特别反感，是因为我当年做了保险才会变成今天这样吗？理性告诉我不是，但我还是带着阵阵隐痛，不愿看到这样的现实。我祈祷上帝耶稣，拜求观世音菩萨、如来佛祖，求王母娘娘、玉皇大帝；让给今生一直在努力的Jerry 吕明洁一个好的来世，或是投胎到自己8月大的孩子上，照顾落寡的妻子，照顾白首的父母，让他们坚强。\n生者因爱而痛，因爱而弱；我愿相信这世上的轮回，让爱延续，让生者坚强。"
		},
		{
			"post_id": 8,
			"title": "Public network access for ZeroNet\n零网的公网访问",
			"date_published": 1496883203.93,
			"body": "感谢Guixiang（[行动派](http://127.0.0.1:43110/guixiang.bit/?Home)）的推荐；\n\n顺利通过[https://bit.surf/](https://bit.surf/) 实现公网访问自己Zeronet站点。\n如我的零网博客：[http://127.0.0.1:43110/qianchen.bit](http://127.0.0.1:43110/qianchen.bit)\n公网访问：[https://bit.surf:43110/qianchen.bit](https://bit.surf:43110/qianchen.bit)\n只要输入最后站点地址就行（就是43110/之后的一串或注册的.bit）。\n\n感谢cundhi 提供的：[http://qianchen.greatzero.net/](http://qianchen.greatzero.net/)\n\n感谢reiki 提供的：[https://fuckcf.cf/qianchen.bit](https://fuckcf.cf/qianchen.bit)\n\n感谢[Zhuce](http://127.0.0.1:43110/Me.ZeroNetwork.bit/?Profile/1White24UrrwQrD86o6Vrc1apgZ1x1o51/1FQfdwki4YxDbLMY4PoxqRpBWT4jLVKnKt/zhuce@zeroid.bit)提供的代理网址与教程：[http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies](http://127.0.0.1:43110/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:proxies)"
		},
		{
			"post_id": 7,
			"title": "My reaction to listen < A Concise Guide to survival in the world of Blockchain >\n听『区块链世界简明生存指南』有感",
			"date_published": 1496810574.157,
			"body": "2017年6月6日晚，在『一块听听』上李笑来分享了他对区块链的理解和投资原则，感受到区块链的发展也是个渐进的过程。\n\n## 区块链是技术\n\n笑来老师从英文Blockchain解释了区块链是个将分账本串联起来的总帐，本质是记账；它结合了加密技术和P2P技术，有着账务公开、保密和去中心化的优势。\n李笑来本人的定义是：区块链指的是一种公开的，由去中心化网络共同维护的账务系统，提供开放的、不可篡改的底层数据服务。见[https://github.com/xiaolai/INB-Principles/blob/master/Chinese.md](https://github.com/xiaolai/INB-Principles/blob/master/Chinese.md)\n\n* * *\n\n联想到我开始接触P2P的场景，那是好几年前我用电驴、迅雷下载电影时，发现有下载速度，也有上传速度；是我在下载资源，同时也在被下载资源。同样的，区块链技术，所有人同步一本账本，帐务公开了，没有中心了，也不容易被篡改。加上保密技术，保密性私密性也具备了。\n\n同样的在『得到』吴军|硅谷来信的一篇名为“机器智能是生产力，区块链是生产关系”文章中表示，TOM Ding认为，区块链改变的是生产关系，有如下好处：1\\. 供需双方减少了交易成本。2\\. 比集中控制数据和交易更安全。3\\. 更可靠，除非整个互联网垮掉。4\\. 避免用户在互联网服务中失去隐私。\n\n## 比特币的四重含义\n\n李笑来对比特币的思考的确更深入，并且很有启发：\n\n1.  是第一个被证明为成功的区块链应用。\n2.  运用去中心化技术去维护的账务公开的名为比特币的世界银行。\n3.  名为比特币的世界银行所发行的货币，为比特币。\n4.  某种意义上也是名为比特币的世界银行的股份。\n\n在这个基础上就让我更明白了比特币在不同场景的属性，也能够一定的扩展理解。特别是前段时间为了注册bit域名而接触的NameCoin。\n首先NameCoin是一个区块链应用，是一个去中心化维护的数据公开的域名管理公司，然后是购买域名或维护域名所花费的货币，最后是该公司的股份。\n从这四个维度去看现有的区块链公司，和其发行的区块链币，清晰无比。感谢李笑来的解释。\n\n## 区块链的投资原则\n\n李笑来开源了他的投资原则：\n\n*   这世界真的需要这东西吗？\n*   它解决了什么原本没有被解决的问题？\n*   去中心化在这件事儿上真的必要吗？\n*   它真的必须账务公开吗？\n*   账务公开的存在真的会提高它的效率吗？\n*   它在多大程度上更接近一个 DAC (Decentralized autonomous corporation， 去中心化自制公司)？\n*   如果我们决定投资，那么我们应该用我们资金的多大比例去投资？\n\n我理解的和一般价值投资一样，本身是对驱动世界进步有价值的，并真的适合使用区块链技术的。像投资股票一样买入其区块链币，等待增值。\n同样联想到『得到』吴军|硅谷来信的文章有说到“三眼美女”概念，和“长期投资”概念；“三眼美女”简单讲是已经过了怀孕和幼儿期，正进入成长期的产品、公司或是时代；“长期投资”简单讲是既然认为长期是发展的，就不必着急赶早，想清楚再进入也不迟，因为是长期增值，长期持有或投入的。\n我决定加入区块链的投资，但我不着急，我量力而行，并真正理解投资对象，尽量全方位地了解。除了李笑来老师所说的因素，我也需要考虑到其他因素；如节目『财经郎眼』郎咸平所说，比特币关注度越高，价格越高；我想这和一个公司的产品被广泛应用公司才能增值的道理一样，区块链应用需要人们的关注。我肯定中国人口聚集城市刚需房产的未来，也肯定李笑来的投资眼光，我购入了李笑来投资的“咔咔买房”虽然资金有限，但是对自己认知的实践。\n复制李笑来提供的咔咔买房介绍及优惠链接：[http://u688035.viewer.maka.im/pcviewer/YV5BYB6C?from=groupmessage&;isappinstalled=0](http://u688035.viewer.maka.im/pcviewer/YV5BYB6C?from=groupmessage&;isappinstalled=0)\n咔咔买房的官网：[https://kakamf.com/](https://kakamf.com/)\n\n咔咔买房我的邀请码（微信扫码）：\n\n![20170609071254.png (200x200)](data/img/post_7_20170609071254.png)​​​​​​​​​​​​​​\n我也正在对公信宝、比特币、域名币、云币网做更深入的了解，适时适合自己地买入。\n\n最后借用李笑来的三张ppt结尾：\n\n![1.jpg (506x900)](data/img/post_7_1.jpg)\n​![2.jpg (506x900)](data/img/post_7_2.jpg)\n![3.jpg (506x900)](data/img/post_7_3.jpg)"
		},
		{
			"post_id": 6,
			"title": "Thousands of miles home to persuade my mother\n千里归家说（shuì）家母",
			"date_published": 1496652525,
			"body": "> 说服并不是什么如洗脑般的超能力，而是一门跨领域的学科，其核心主题无非有两方面：一是如何形成看法；二是人又为什么会改变看法。\n> 前者，使得整个学习说服的过程，几乎等同于一个自省的过程；后者，则让我们在说服中，不只知道了要如何改变别人，更重要的是让我们不害怕改变自己。\n> **——《好好说话》马薇薇、黄执中、周玄毅 等著，中信出版集团2017年2月第1版**\n\n2017年6月2日，我抱着“本”刚下载的《好好说话》电子书，不远千里；虽身无二物，但身怀大任：说服我妈听我爸～这个任务可是艰巨的，古来与女人讲理都是困难的，那人还是母亲，改变其立场是难上加难。\n\n* * *\n\n需要介绍下《好好说话》这本书。出品人马东和作者马薇薇、黄执中、周玄毅等人是之前我和女友超爱看的辩论节目“奇葩说”中的名人。特别是马薇薇，根据我球友、她大学同学的介绍，马薇薇大学期间非常努力，练就了一身本领，口才与辩论就是其中一项。对于从小对语言愚笨不善经营言语的我，平生佩服的就是苏秦、张仪、马薇薇。《好好说话》这本书，教的是讲话的术，正好零时抱佛脚，在路上研习一二。\n\n## 分家与亲情的两难\n\n正值拆迁，房子变现的时候，偏重亲情的父亲与偏重金钱的母亲形成了对立。而母亲带着女人天生的优势，用各有理由说得父亲只能沉默。我的立场是父母和谐，家庭和谐。这并非退让，实则长远之利。这样我就需要说服我的母亲。\n\n分家是个难题，我们民族在强化皇权的路上，为弱化地方势力，法定继承制度都是诸子均分制而非长子继承制。在这个制度规则下，就有这个制度规定的玩法，分家就是其中之一。封建时期是只分给儿子，也就成了习俗规定。现代是追求男女平等，法律也定了继承顺序。在长一辈经历的观念与时代的交替，我们家就是一个案例：\n\n我妈当时房改房时将奶奶的房子买下，并说反正就一个儿子，以后房子肯定是儿子的，为了让子女孝顺，名字就是奶奶的。在接下来的生活中婆媳关系也如同基因一般，继承了矛盾，父亲的姐妹必然站在奶奶这边；我们与其的亲情靠着父亲勉强地维持着。不知不觉几十年过去了，房价涨了，主流观念渐渐变成了男女平等，奶奶过世后，就如没有头狼的狼群，紧紧盯着房子的归属。\n\n我们也都是工薪阶层的人，多些钱必然是一个大的生活品质的提升，问题的所在就是母亲自认不公，自觉委屈，欲力争到底，但在事实和情理面前吃着大亏，显得无依无靠。\n\n平时的我总一副教育者的姿态说，要依靠父亲，这样父亲会一点点变得能够依靠；而母亲总是拿出各种事实证明父亲不可靠，并事事亲历亲为。我还说要维系亲情，真正困难的时候也只有亲人最能够给予帮助；而母亲就又举例各种事实证明亲情靠不住，只有钱靠得住。我说事情是有两面性的，要从另一面看；这时母亲就点开了手机看起了微信～\n\n## 行有不得者，皆反求诸己——孟子\n\n说服不了母亲，也不是一时半会的事了。一直知道个道理：“人是很难被改变的。”“你能改变的只有你自己。”之前说一堆，半字不入母亲耳。拿着《好好说话》的要点：\n\n1.  一切的说服都只是为了找到一个切入点，好让对方能从中为自己找出一个去做的理由。\n2.  所有的说服都有一个基本的道理——不要一直强调我需要什么，而是要想办法找出对方需要什么。甚至有时候，想办法为对方创造一个需求。\n3.  说服，不只是语言，更是一种策略，当情势改变了，人与人之间既有的利益关系与情势、姿态也会随之改变；如同仇敌忾。\n\n联想到『得到』专栏《关系攻略》熊太行的一篇文章《为什么“我是个重感情的人”不要挂在嘴上》详述了要谈论**利益**。\n\n我就从利益入手，结合三个要点试了试。\n\n我分析了母亲注重的利益：我母亲注重我、金钱、回报。\n1. 不怕失去其他亲人，但害怕失去我。\n2. 依靠金钱，期望获得金钱，害怕失去金钱。\n3. 初心极好，但回报预期也高，得不到时会心里不平衡。\n这些都可以理解，毕竟每个人或多或少都会有这类的心理特征，只是不同人的成长经历影响了特性被激发了多少罢了。\n\n同时我妈是个需要被爱的人，她一直在付出着，但一直被轻视着，心生埋怨，自命坚强；而心里是个小姑娘，需要被理解，被照顾，被疼爱。我期望我是个小姑娘，可惜我是个寡言不善沟通的笨男孩。\n\n确定了说服目的：说服母亲不用太过注重金钱，转而专注自己的意义和生活。\n确定营造的情势：时间压力，我现在才是赚钱的时候，母亲你现在是寻找自己意义乐趣的时候。\n确定说服逻辑：点出利益痛点，给出解决方案。\n1. 我是要回来的，但如果无亲无故，更或反目成仇，我可能就很难回来或是回来的概率就降低了。\n2. 虽然在说法上能够占优势，但在法律上不占优势，如果走正常渠道，可能两败俱伤，有更多的人参与分，获得得更少。\n3. 你是个一直在为家庭付出的，理应获得个人的回报，但如果需要回报那一定不是争抢，而是想着如何共好，毕竟每个人都是自私的；一旦争抢，别人不会因为你的好而损害自己的利益，一定会跟你抢。\n4. 方案：在现有状况下最大程度获得自身利益，仅4个人均分，比更多人均分要好；又保留了亲情。在亲情的基础上站在对方角度考虑，大家都不容易，我也不容易，温和地给出理由，让他们只分房产，奖励作为我们多年来的维护和即将要搬迁的费用等。\n5. 最后让我爸支撑起来，扮演成一大家之主。让我妈能够有所依靠，体察我妈心中的小女孩，并保护她。\n\n确定说服方式：以母亲为出发点，疏导式劝阻。（可惜这点我没有做到，最终被习惯所打败，有所争论～）\n\n虽然最终效果不如预期，但至少起了正面的促进效果，让家庭这整个系统能够趋于稳定，因为只有稳定的环境才有获得双方最大利益的基础。\n\n\n"
		},
		{
			"post_id": 5,
			"title": "Welcome linked to each other",
			"date_published": 1496390541.491,
			"body": "每个 ZeroNet 网站都需要 Peer ，访客越多 Peer 也越多，Peer 多了网站越快，访客体验才会越好。欢迎链接本站，欢迎互链（仅限 ZeroNet 网站）。\n\n[http://127.0.0.1:43110/qianchen.bit/](http://127.0.0.1:43110/qianchen.bit/)"
		},
		{
			"post_id": 4,
			"title": "Congratulations！I have successfully got \"qianchen.bit\"",
			"date_published": 1496387646.097,
			"body": "真的值得庆祝一下，对于一个闯入陌生世界的小白，在教程和朋友们的帮助下，开始摸索。用Bitmessages发了邮件，还知道了Namecoin。感谢官方的帮助，在Namecoin中可以管理自己的域名。最后在“漫长”的等待中，在不断地尝试下最终在点开[http://127.0.0.1:43110/qianchen.bit](http://127.0.0.1:43110/qianchen.bit)后看到不是“Not Found”而是自己的博客，那感觉是无比的激动。感谢所有直接或者间接帮助过我的人，感谢。"
		},
		{
			"post_id": 2,
			"title": "Thanks for leading me into the ZeroNet world",
			"date_published": 1496279320.893,
			"body": "从5月22日看了李笑来“学习学习再学习”的微信公众号，了解了ZeroNet，到5月31日得空按文章教程尝试下载软件并点开了网址。看到这ZeroNet与普通网站类似，但又明显不同。我仅知道ZeroNet用的是区块链技术（我并不对区块链十分明白，按我理解比特币体现了金融界的自由，ZeroNet可能就是言论界的自由），它不需要服务器，基本不会消失，因为在所有链接过用户的电脑里，这样它就可以在全球互联网的范围内自由接收和发布言论；好奇的我莫名地激动了起来。\n\n在摸索了一个下午后，在朋友们的帮助下，我感觉我入门了。由于链接数量对网站访问速度会有明显的提升，我会尽我微薄之力进行推广，并持续更新带给我帮助的网站链接。\n\n『专业说法：每个 ZeroNet 网站都需要 Peer ，访客越多 Peer 也越多，Peer 多了网站越快，访客体验才会越好。欢迎链接本站，欢迎互链（仅限 ZeroNet 网站）。』\n\n## 以下是感谢链接：\n\n感谢李笑来老师的推荐：[**http://127.0.0.1:43110/xiaolai.bit**](http://127.0.0.1:43110/xiaolai.bit/)\n\n感谢行动派的入门指导：[http://127.0.0.1:43110/guixiang.bit](http://127.0.0.1:43110/guixiang.bit)\n\n感谢中文论坛的教程：[http://127.0.0.1:43110/NewGFWTalk.bit](http://127.0.0.1:43110/NewGFWTalk.bit)\n\n*   特别是[创建自己博客/论坛/...的超简单方法（包括深入配置教程）](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:18_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)\n*   其中我觉得必看的还有：[提问的智慧](http://127.0.0.1:43110/NewGFWTalk.bit/?Topic:36_13Z7XxTa7JuFat3KzzMWu3onwM6biLuurJ/)\n\n感谢unrealistic world对域名注册教程：[http://127.0.0.1:43110/mcjiffy.bit](http://127.0.0.1:43110/mcjiffy.bit/)\n\n*   [在Zeronet注册并绑定.bit域名全攻略](http://127.0.0.1:43110/mcjiffy.bit/?Post:13:%E5%9C%A8Zeronet%E6%B3%A8%E5%86%8C%E5%B9%B6%E7%BB%91%E5%AE%9A.bit%E5%9F%9F%E5%90%8D%E5%85%A8%E6%94%BB%E7%95%A5)\n*   特别是给予域名注册决定性帮助的官方：[http://127.0.0.1:43110/domains4free.bit](http://127.0.0.1:43110/domains4free.bit)\n\n感谢浮生網志的拓展：[http://127.0.0.1:43110/mosen.bit](http://127.0.0.1:43110/mosen.bit/)\n\n还要感谢[大家一起P2P](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/?Home)做出的努力：[ZeroNet新手用户必看](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/?Post:34:ZeroNet%E6%96%B0%E6%89%8B%E7%94%A8%E6%88%B7%E5%BF%85%E7%9C%8B)\n\n感谢推广渠道：[0list](http://127.0.0.1:43110/0list.bit/)、[ZeroNet网站中文导航](http://127.0.0.1:43110/0cnguide.bit/?Post:20:ZeroNet%E7%BD%91%E7%AB%99%E4%B8%AD%E6%96%87%E5%AF%BC%E8%88%AA)、[ZeroSites](http://127.0.0.1:43110/Sites.ZeroNetwork.bit/?Home)\n\n感谢资源分享：[Resilio Sync个人密钥分享](http://127.0.0.1:43110/123bZqsk4PLCVhfujXJX6ZQjr2TordejtC/?Post:16:Resilio+Sync%E4%B8%AA%E4%BA%BA%E5%AF%86%E9%92%A5%E5%88%86%E4%BA%AB)\n\n感谢朋友们的支持，让我们共同成长。\n\n* * *\n\n## 以下是好文共享：\n\n[编程语言介绍](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/?Post:16:%E7%BC%96%E7%A8%8B%E8%AF%AD%E8%A8%80%E4%BB%8B%E7%BB%8D)\n\n[windows下php开发环境搭建](http://127.0.0.1:43110/1Bm8RDrnitgbh7Nbsbo6T9j5VDLWTGaar4/?Post:17:windows%E4%B8%8Bphp%E5%BC%80%E5%8F%91%E7%8E%AF%E5%A2%83%E6%90%AD%E5%BB%BA)"
		}
	]
}