{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1609290557,
			"title": "Human Rights Don't Exist in Brazil",
			"body": "There is a criminal organization in Brazil using NSO Group's Pegasus to infect devices for hack for hire, to incite terrorism, blackmail people, produce illegal pornography and assist in assassinations. They also have other advanced malware, like UEFI implants and even persistent implants for Kindle and Raspberry Pi. Plus face/voice recognition on every camera and microphone they can get into, in public or private places.\n\nBrazil won't do anything to stop them. Only the FBI, CIA and NSA can stop them.\n\nThere is also the possibility that they were engaged on the hack of Bezos' smartphone.\n\nIf you know of any security researcher who wants to reverse engineer the exploits they are using, I am more than willing to help them.\n\nIf you want a story about how they operate, I am willing to work with you to expose them.",
			"added": 1609290556
		},
		{
			"topic_id": 1619121928,
			"title": "Opinion: The Same Way Signal is Hacking Cellebrite, China and Russia Should Fuck the US",
			"body": "If you don't know yet, Signal has developed a way to mess with Cellebrite - [link](https://arstechnica.com/information-technology/2021/04/in-epic-hack-signal-developer-turns-the-tables-on-forensics-firm-cellebrite/).\n\nSeems it is targeting vulnerabilities in FFMPEG when Cellebrite's UFED parses media files on the target device. So how can this be extended to make it even nastier? Many devices have built-in hardware blocks to accelerate decoding of media files, and these also have vulnerabilities - [link](https://arstechnica.com/information-technology/2020/08/snapdragon-chip-flaws-put-1-billion-android-phones-at-risk-of-data-theft/)\n\nExploiting these hardware flaws (there are similar ones for x86), bricking the device should be easy by replacing its firmware with zeros.\n\nWhy should China and Russia destroy US devices? Blow-back because the US (and Israel) decided to embed spy circuitry on all Intel/AMD/ARM processors and paying lip service to human rights while destroying them.\n\nHijack the BGP, push the media files, and watch as they burn. Sweet.\n\nIf you are an american and is silent about the abuse your country is inflicting, I don't care if your device burns.",
			"added": 1619121926
		},
		{
			"topic_id": 1630497564,
			"title": "The developer of a ZeroNet fork must be willing to endure death threats",
			"body": "BadBIOS exists. Privacy and security do not. If you fork ZeroNet, you, personally, will be pestered around until you quit.",
			"added": 1630497561
		}
	],
	"topic_vote": {},
	"next_comment_id": 1,
	"comment": {},
	"comment_vote": {}
}