{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Criptomoedas | Blockchain",
			"body": "Uma criptomoeda é um meio de troca que se utiliza de criptografia para assegurar transações e para controlar a criação de novas unidades da moeda. Criptomoedas são um subconjunto das moedas digitais. O Bitcoin tornou-se a primeira criptomoeda descentralizada em 2009. Desde então, inúmeras criptomoedas foram criadas.\n\nO blockchain é uma rede que funciona com blocos encadeados muito seguros que sempre carregam um conteúdo junto a uma impressão digital. No caso do bitcoin, esse conteúdo é uma transação financeira. A sacada aqui é que o bloco posterior vai conter a impressão digital do anterior mais seu próprio conteúdo e, com essas duas informações, gerar sua própria impressão digital. E assim por diante.\n\n",
			"added": 1547527262
		}
	],
	"topic_vote": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": 1,
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": 1,
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": 1,
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": 1,
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": 1,
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": 1,
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": 1
	},
	"next_comment_id": 21,
	"comment": {
		"2_1AgJDaExa4WfVc1ca4iCZ2HNAEjeK3G2kZ": [
			{
				"comment_id": 1,
				"body": "#Gugure! Kokkuri-san\nA história gira em torno de uma menina chamada Kohina. Kohina acaba chamando Kokkuri-san (um fantasma de baixo escalão no folclore japonês), que acaba por ser uma jovem e belo homem, de cabelos brancos. No começo, ele apenas tem a intenção de atormentá-la, mas logo fica preocupado com seus hábitos alimentares. Agora ele assombra a fim de protegê-la\n\n\n- https://www.superanimes.site/anime/gugure-kokkuri-san",
				"added": 1547510202
			},
			{
				"comment_id": 10,
				"body": "#Kiseijuu: Sei No Kakuritsu\n\nUm dia, alienígenas chamados Parasitas, que se hospedam em seres vivos e tomam seus corpos, invadem a Terra. Eles atacam os homens entrando por seus narizes e orelhas. Izumi Shinichi é um jovem de 17 anos que mora com os pais num pacato bairro de Tóquio e acaba sendo alvo de um desses alienígenas, mas o indivíduo falha ao tentar dominar seu corpo. Tendo de coexistirem, como serão seus destinos?\n\n\n- https://www.superanimes.site/anime/kiseijuu-sei-no-kakuritsu",
				"added": 1547520632
			}
		],
		"1_13xnBDDrkjbaEzUTSjisx4tcD3xWpu1Fov": [
			{
				"comment_id": 2,
				"body": "#Future Man\nJosh Futterman é um deprimido zelador que se torna o herói improvável da Terra quando é recrutado por misteriosos visitantes para viajar através do tempo a fim de evitar a extinção da humanidade.\n\n\n- https://megaseriehd.com/series/future-man/",
				"added": 1547510312
			},
			{
				"comment_id": 3,
				"body": "#Angie Tribeca\nNa história, Gabriel Black (Holloway) é um ex-fuzileiro naval que atualmente trabalha como oficial da inteligência. Com um microchip implantado em seu cérebro, ele consegue processar as informações como se fosse um computador e acessar internet, WiFi, celulares e satélites. Gabriel realiza missões para a U.S. Cyber Command, unidade que trabalha com segurança tecnológica, sob o comando de Lilian Strand (Marg Helgenberger, de CSI). Para manter Gabriel sob controle, Lilian chama a agente Riley O’Neill (Meghan Ory, de Once Upon a Time), que forma dupla com ele em suas missões de campo.\n\n- https://megaseriehd.com/series/angie-tribeca/",
				"added": 1547510350
			},
			{
				"comment_id": 4,
				"body": "#Project Blue Book\n\nDr. J. Allen Hynek (Aidan Gillen), um astrofísico renomado, é recrutado pelo governo para liderar o Projeto Livro Azul. O objetivo desta missão, que foi patrocinada pela Força Aérea dos Estados Unidos, é investigar fenômenos misteriosos relacionados ao aparecimento de objetos voadores não identificados (OVNI) em território estadunidense entre os anos de 1947 e 1960.\n\n\n- https://megaseriehd.com/series/project-blue-book/",
				"added": 1547510379
			}
		],
		"2_1NMaJwqNto77DVkTCeW7Lyq4LUWNW9ezM9": [
			{
				"comment_id": 5,
				"body": "#PeerTube\nO PeerTube é uma plataforma de vídeo livre, descentralizada e federada desenvolvida como alternativa a outras plataformas que centralizam nossos dados e atenção, como YouTube, Dailymotion ou Vimeo.\n\n- https://github.com/Chocobozzz/PeerTube.git",
				"added": 1547510582
			},
			{
				"comment_id": 9,
				"body": "#Redox: Um sistema operacional Rust\n\n\nO Redox é um Sistema Operacional Unix escrito em Rust, com o objetivo de trazer as inovações do Rust para um moderno microkernel e um conjunto completo de aplicações.\n\n- https://gitlab.redox-os.org/redox-os/redox.git",
				"added": 1547519773
			},
			{
				"comment_id": 12,
				"body": "#Fácil e rápido compartilhamento de arquivos a partir da linha de comando. https://transfer.sh/\n\n- https://github.com/dutchcoders/transfer.sh.git",
				"added": 1547522988
			}
		],
		"2_141M2jPnvzs7nQkCgQp1QzKZF4PHMjs1NK": [
			{
				"comment_id": 6,
				"body": "Aconteceu num sábado que, entrando ele em casa de um dos principais dos fariseus para comer pão, eles o estavam observando.\nE eis que estava ali diante dele um certo homem hidrópico.\nE Jesus, tomando a palavra, falou aos doutores da lei, e aos fariseus, dizendo: É lícito curar no sábado?\nEles, porém, calaram-se. E, tomando-o, o curou e despediu.\nE respondendo-lhes disse: Qual será de vós o que, caindo-lhe num poço, em dia de sábado, o jumento ou o boi, o não tire logo?\nE nada lhe podiam replicar sobre isto.\nE disse aos convidados uma parábola, reparando como escolhiam os primeiros assentos, dizendo-lhes:\nQuando por alguém fores convidado às bodas, não te assentes no primeiro lugar; não aconteça que esteja convidado outro mais digno do que tu;\nE, vindo o que te convidou a ti e a ele, te diga: Dá o lugar a este; e então, com vergonha, tenhas de tomar o derradeiro lugar.\nMas, quando fores convidado, vai, e assenta-te no derradeiro lugar, para que, quando vier o que te convidou, te diga: Amigo, sobe mais para cima. Então terás honra diante dos que estiverem contigo à mesa.\nPorquanto qualquer que a si mesmo se exaltar será humilhado, e aquele que a si mesmo se humilhar será exaltado.\n\n- Lucas 14:1-11\n\n#Jesus cura o homem Hidrópico: https://mega.nz/#!gAcTBYJB!nUYJpeQmvJ0SBtFW9OWHab8wheIH0cftccugwfOCIZw",
				"added": 1547510971
			},
			{
				"comment_id": 7,
				"body": "> [tuber](#comment_6_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd): Aconteceu num sábado que, entrando ele em casa de um dos principais dos fariseus para comer pão, eles o estavam observando.E eis que estava ali diante dele um certo homem hidrópico.E Jesus, tomando a palavra, falou aos doutores da lei, e aos fariseus, dizendo: É lícito curar no sábado?Eles, porém, calaram-se. E, tomando-o, o curou e despediu.E respondendo-lhes disse: Qual será de vós o que, caindo-lhe num poço, em dia de sábado, o jumento ou o boi, o não tire logo?E nada lhe podiam replicar sobre isto.E disse aos convidados uma parábola, reparando como escolhiam os primeiros assentos, dizendo-lhes:Quando por alguém fores convidado às bodas, não te assentes no primeiro lugar; não aconteça que esteja convidado outro mais digno do que tu;E, vindo o que te convidou a ti e a ele, te diga: Dá o lugar a este; e então, com vergonha, tenhas de tomar o derradeiro lugar.Mas, quando fores convidado, vai, e assenta-te no derradeiro lugar, para que, quando vier o que te convidou, te diga: Amigo, sobe mais para cima. Então terás honra diante dos que estiverem contigo à mesa.Porquanto qualquer que a si mesmo se exaltar será humilhado, e aquele que a si mesmo se humilhar será exaltado.\n> \n> Lucas 14:1-11\n\n#Hidropisia\nHidropisia é a acumulação anormal de fluido nas cavidades naturais do corpo ou no tecido celular. O termo pode ser usado como sinônimo de edema. Historicamente, hidropisia, como doença, designava a causa principal dos edemas generalizados, a saber, a insuficiência cardíaca congestiva. Diz-se \"hidrópico\" o indivíduo que sofre da doença.",
				"added": 1547511019
			}
		],
		"3_16UFrdHvyx5zwsMpe3VFTFUJp3X2qEZAZV": [
			{
				"comment_id": 8,
				"body": "#Saiba como remover arquivos permanentemente, sem deixar rastros, no Linux\n\n#Shred\nPresente, nativamente, na maioria das distribuições Linux, o shred sobrescreve um arquivo para ocultar seu conteúdo e, opcionalmente, pode excluí-lo também.\n\n#Por exemplo, você pode usar os parâmetros:\n- shred -zvu -n 5 arquivo\n\n#Onde,\n\n-z – reescreve arquivo adicionando ‘zeros’ ao final do arquivo;\n-v – visualiza progresso da operação;\n-u – trunca e remove arquivo depois de reescrito;\n-n – especifica o número de vezes para sobreescrever o arquivo (padrão são 3)\n\n#Para mais informações sobre o shred:\n\n- man shred",
				"added": 1547516675
			}
		],
		"1_14PUyE66PvCN1rJKcU3fTBzvwJ4mXZa5Rv": [
			{
				"comment_id": 11,
				"body": "#Elon Musk: Como o CEO bilionário da SpaceX e da Tesla está moldando o nosso futuro\n\nElon Musk é o empreendedor mais ousado de nosso tempo. Uma mistura de Thomas Edison, Henry Ford, Howard Hughes e Steve Jobs, ele é o homem por trás dos cobiçados esportivos elétricos da Tesla Motors, dos painéis e baterias de energia solar popularizados pela SolarCity e dos foguetes espaciais da SpaceX, construídos do zero com recursos privados e muito mais baratos que qualquer versão já lançada pelas agências governamentais. Entre as próximas metas de Musk está a colonização de Marte.\n\nNesse livro, o experiente jornalista de tecnologia Ashlee Vance apresenta um olhar inédito sobre a vida e as realizações inacreditáveis do homem mais audacioso do Vale do Silício. Fundamentado em mais de cinquenta horas de conversas com Musk e entrevistas com mais de trezentas pessoas ligadas a ele, Vance investiga em detalhes a trajetória muitas vezes instável e controversa das empresas de Musk e traça um retrato impressionante do personagem complexo que renovou a indústria com uma série de inovações de enorme impacto político e econômico, num vislumbre do que pode vir a ser o futuro encabeçado pelo progresso de seus negócios visionários.\n\nEm uma época como a atual, em que a maioria das empresas prefere o lucro fácil ao risco de desenvolver tecnologias radicalmente novas, Musk se destaca como o único empresário com dinamismo e visão suficientes para comandar — e revolucionar — três indústrias ao mesmo tempo. Se ele é simplesmente um lunático ou a mente mais brilhante a ter posto os pés neste planeta, só o tempo dirá, mas sua biografia, hoje, já é parte relevante da história.\n\n- https://mega.nz/#!I8s1AA6I!Ifd48LEYoqJgPwOUr2vNSU-reb0qPuOg4QC1woPsRPM",
				"added": 1547522804
			}
		],
		"1_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": [
			{
				"comment_id": 13,
				"body": "#Como fazer um ICO Ethereum em 20 minutos\n- https://livecoins.com.br/como-fazer-um-ico-ethereum-em-20-minutos/",
				"added": 1547527298
			},
			{
				"comment_id": 14,
				"body": "#Como criar seu próprio Token Ethereum\n- https://livecoins.com.br/como-criar-seu-proprio-token-ethereum/",
				"added": 1547527348
			},
			{
				"comment_id": 15,
				"body": "#KeepKey - Hardware Wallet\n- https://github.com/keepkey/keepkey-firmware.git",
				"added": 1547527381
			},
			{
				"comment_id": 16,
				"body": "#RaiBlocks: Uma Criptomoeda com Rede Distribuída sem Taxas\n- https://github.com/nanocurrency/nano-node.git",
				"added": 1547527779
			},
			{
				"comment_id": 17,
				"body": "#Protocolo Ethereum - Blockchain\n- https://github.com/ethereum/go-ethereum.git",
				"added": 1547529038
			},
			{
				"comment_id": 18,
				"body": "#twister\ntwister é a plataforma de microblogging P2P totalmente descentralizada que aproveita as implementações de software livre dos protocolos Bitcoin e BitTorrent.\n- http://twister.net.co/\n- https://github.com/miguelfreitas/twister-core.git",
				"added": 1547529433
			},
			{
				"comment_id": 19,
				"body": "#Blockchain no Judiciário – veja o que já é realidade e projetos futuros\n- https://ldsoft-propriedade-intelectual.jusbrasil.com.br/artigos/623255838/blockchain-no-judiciario-veja-o-que-ja-e-realidade-e-projetos-futuros",
				"added": 1547529625
			}
		],
		"5_1Mwd1PDM6P11DjMUC79Tgfbidpk5abA91W": [
			{
				"comment_id": 20,
				"body": "#ENDER'S GAME - O JOGO DO EXTERMINADOR\n\nEm um futuro próximo, extra-terrestres hostis atacaram a Terra. Com muita dificuldade, o combate foi vencido, graças ao heroísmo do comandante Mazer Rackham (Ben Kingsley). Desde então, o respeitado coronel Graff (Harrison Ford) e as forças militares terrestres treinam as crianças mais talentosas do planeta desde pequenas, no intuito de prepará-las para um próximo ataque. Ender Wiggin (Asa Butterfield), um garoto tímido e brilhante, é selecionado para fazer parte da elite. Na Escola da Guerra, ele aprende rapidamente a controlar as técnicas de combate, por causa de seu formidável senso de estratégia. Com isso, logo se torna a principal esperança das forças militares para encerrar de uma vez por todas com a ameaça alienígena.\n\n- https://youtu.be/PjVfyN9GabU",
				"added": 1547533597
			}
		]
	},
	"comment_vote": {
		"8_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"1_1C3HLahKLywoRNABWnKqV6HpeTRUJbhFFv": 1,
		"11_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1,
		"19_14KZK2fi2cfgK14b7XC5sCwTVq58PyqqZd": 1
	}
}