{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"7_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 1,
				"body": "что можно использовать для размещения в зеронете \"тяжелых\" сайтов, кроме ipfs?",
				"added": 1502376276
			},
			{
				"comment_id": 2,
				"body": "> [zalex](#comment_85_1LWuc6JBhUGrKEAh1aPrPU85dEMcKmg3pS): ZeroMux, но недавнее обновление его сломало. Вот как починят - можно будет снова эффективно выкладывать тяжёлые файлы. Эта штука разбивает файлы на мелкие части (как в BitTorrent) и потом склеивает воедино. Даже просмотр видео по мере загрузки работал.\n\nспасибо.\n\nпойду тогда ковырять ipfs.",
				"added": 1502377060
			},
			{
				"comment_id": 3,
				"body": "подскажите, есть проект который работает в клирнетах и имеет бд на sqlite как мне эту бд перенести в зеронетовскую бд моего зайта ?",
				"added": 1502524312
			},
			{
				"comment_id": 4,
				"body": "> [balancer73](#comment_129_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): У любых приложения формат БД свой собственный. Поэтому при переносе требуется конвертировать. И тут уже без разницы, в какой базе оно хранится.\n\nНу про конвертацию эт понятно, меня интересует сам процесс переноса, я хочу добавить в базу начальные данные, но зеронет же сам создает бд и тут я хз что делать.",
				"added": 1502533151
			},
			{
				"comment_id": 5,
				"body": "можно ли вобще в папку с зайтом добавить симлинк на папку с данными ?",
				"added": 1502533413
			},
			{
				"comment_id": 6,
				"body": "> [balancer73](#comment_131_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Не пробовал, так что не знаю, как с файлами работает движок ZeroNet. По идее — ему должно быть всё равно, файл это или симлинк.\n\nя вот попробовал, и оказалось симлинки он не трогает ибо он же копирует все содержимое папки с зайтом и если он скопирует симлинк то на другой машине он будет указывать в никуда.\n\n> Но тут вопрос концептуальный. ZeroNet не предназначен для раздачи больших объёмов информации. А малый объём и скопировать не жалко вместо создания симлинка.\n\nну можно глянуть на GIF Time, на нем довольно большой объем файлов но указаны они как опциональные, так что пока ZeroMUX нету а  IPFS костыль можно поставить более простой костыль с указанием опциониальных файлов.",
				"added": 1502555545
			},
			{
				"comment_id": 7,
				"body": "> [balancer73](#comment_132_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): А такие же файлы? В смысле, они точно подписаны были?\n> \n> В том-то и дело, что через сеть копируются не файлы, а контент. Поэтому не думаю, что для ZeroNet есть разница, откуда этот контент взять.\n> ...\n> Впрочем, я не поленился проверить — файлы по симлинку раздаются отлично. Например, см. каталог data в http://127.0.0.1:43110/16dZEVJ63ZMCRMpkMATt8nmN9QRWA4e89h — там cover.jpg это обычный файл, а mp3 — это симлинк.\n\nЧто с файлами симлинки работают эт очень хорошо).\n\n> Но, повторюсь, раздавать больше файлы через ZN — плохая идея. Вот, положил один .mp3 и уже почти исчерпан дефолтовый лимит :)\n\nнесоглашусь, в content.json: \"optional\": \"(optional_files/.*)\"\n\nподробней тут http://127.0.0.1:43110/1FMeSorqAS8Kq5E5XJpGGBJ8Qb2CxXhaYb/?Post:2:%D0%9D%D0%B5%D0%BC%D0%BD%D0%BE%D0%B3%D0%BE+%D0%B8%D0%BD%D1%81%D0%B0%D0%B9%D1%82%D0%BE%D0%B2",
				"added": 1502560966
			}
		]
	},
	"comment_vote": {}
}