{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Che fate coi siti inutili?",
			"body": "Soprattutto in questa fase iniziale dove si clicca un po' alla cieca senza sapere quali siti meritano e quali no, voi come vi comportate se un sito non vi interessa (o è in una lingua che non conoscete)?\nLo cancellate dal vostro disco, o lo lasciate comunque \"per il bene comune\"?",
			"added": 1457873902
		}
	],
	"topic_vote": {
		"1_1H8oKiRa7fGgUqS1hpUtaSYLvAqkaknbkf": 1
	},
	"next_comment_id": 9,
	"comment": {
		"1_1NbgdUUvruDbj7iiQYtZF7HdsYFH5vvpjm": [
			{
				"comment_id": 1,
				"body": "Buondì",
				"added": 1457873400
			}
		],
		"1_1HqoeFbTuYXgQLYoh9t3ovxY6We44E45ms": [
			{
				"comment_id": 2,
				"body": "> [morrisworm](#comment_1_1FdxKTtZgMT7e49XG5LjutDgw5exxuiUXK): ciao mica, premetto che io non ho apeto la porta del router quindi non contribbuisco, in ogni caso, dipende dallo spazio che hai e quello che puoi dedicare \"per il bene comune\" secondo me dovresti sentirti libero/a di fare un po' come ti pare :D\n\nNon avevo pensato alla faccenda della porta. Sono in una situazione in cui ho sempre le porte chiuse, e nonostante questo torrent riesce comunque a inviare in upload. Pensavo che anche qui fosse un po' la stessa cosa: se hai la porta aperta è meglio, ma anche se l'hai chiusa invii lo stesso. Sbagliavo?\n\nSe effettivamente con la porta chiusa non si contribuisce, allora diventa veramente solo una questione di spazio sul disco.",
				"added": 1457875195
			},
			{
				"comment_id": 3,
				"body": "Se guardo le statistiche dei siti che ho visitato, mi risulta che (giusto per dirne uno) ZeroID mi ha generato 74mb di download e 102mb di upload. ZeroBoard mi da 37mb di download e 15mb di upload. Tutto ciò con la porta chiusa.",
				"added": 1457875630
			}
		],
		"1_1NtonDtFHKWJ1YM1qxjQX8KvrxiEN1xzRj": [
			{
				"comment_id": 4,
				"body": "Bit Cannon richiede 1GB di spazio? Mica poco",
				"added": 1458171443
			},
			{
				"comment_id": 6,
				"body": "> [orangedugongo](#comment_4_17Y76A97fwqtoTXaCedsmzsFL1D2VcwMnL): Prima di conoscere 0Net avevo una piccola pubblicazione su medium.com in cui pubblicavo brevi pareri su serie TV e film, ora o deciso di esportarla anche qui.Non è propriamente un sito utile, ma se vi interessano le serie TV potreste trovarlo interessante. il link è questo: http://127.0.0.1:43110/1CVLcQh8bhYXQ4jQQ6tpiKgk6H9xaEv1tk/\n\ninteressante, quando avrò del tempo libero sicuramente gli darò una lettura",
				"added": 1458390397
			}
		],
		"1_1E6MEyJDTs7evGWhACC7bqLtUho8eSxk1X": [
			{
				"comment_id": 5,
				"body": "Mi pare si possano indicare quali elementi sono supplementari, in tal caso vengono scaricati solo se l'utente li visualizza realmente.",
				"added": 1458171714
			}
		],
		"1_15QtjbVmt2vpP97mKhT9wnzKfgVBM33BJG": [
			{
				"comment_id": 7,
				"body": "> [wolfire](#comment_2_17r7ZJoELUeHjX1jvWbQdBsB2u2tjYa4qa): Magari direttamente un sito ZeroNet\n\nsì non capisco molto l'idea di usare Telegram per parlare di ZeroNet. Ci siamo già dentro, parliamone direttamente qui.",
				"added": 1462010399
			}
		],
		"1_1NNECDmooAnYQUPpAwiqVmzmsbAELYhQTN": [
			{
				"comment_id": 8,
				"body": "> [totolook](#comment_5_15mbQo7qMzz7e2kBiLbkDrYDo2pzzWvCBH): Sarebbe? Non sono sicuro di scaricarlo...\n\nleaked pics… azzardo e ipotizzo che sia un qualche archivio di foto porno/sexy/gore tirate giù da fb. Sinceramente non mi interessa.",
				"added": 1465639663
			}
		]
	},
	"comment_vote": {
		"1_1FdxKTtZgMT7e49XG5LjutDgw5exxuiUXK": 1,
		"2_1NtonDtFHKWJ1YM1qxjQX8KvrxiEN1xzRj": 1,
		"4_17Y76A97fwqtoTXaCedsmzsFL1D2VcwMnL": 1
	}
}