{
	"title": "FREEMLT",
	"description": "Malta's 1st Censorship-Proof Site",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 10,
	"demo": false,
	"modified": 1517396935,
	"post": [
		{
			"post_id": 9,
			"title": "Pilatus Bank wanted jury trial in the US against Daphne Caruana Galizia for millions in damages",
			"date_published": 1517393355.943,
			"body": "When you have tons of money and powerful backers, like Ali Sadr Hasheminejad, the owner of the corrupt Pilatus Bank in Malta that was set up to cater to just around 100 super-rich clients, you have all you need to terrorize the media into silence. Just find a jurisdiction that is willing to entertain your lawsuit for crippling damages and you're good to go.\n\nIf it's a foreign jurisdiction that implies great financial and other hardship for the person you are suing just to defend the case, so much the better. Pilatus Bank and Ali Sadr Hasheminejad chose one of the worst jurisdictions for litigation in order to silence its critics: the United States.\n\n![screen_shot_2017-11-27_at_10.04.11.jpg (684x454)](data/img/post_9_screen_shot_2017-11-27_at_10.04.11.jpg)\n\nShortly after Daphne Caruana Galizia was assassinated, Pilatus Bank was reported to be [threatening the independent media in Malta](https://manueldelia.com/2017/10/pilatus-bank-bullies-local-press-will-not-silenced/) with such lawsuits, as Manuel Delia reported in his blog.\n\n> Lawyers for Pilatus Bank have fallen on the leading independent news organisations here in Malta threatening them with ruinous law suits in the United States unless they remove reams of stories on Pilatus Bank from their archives.\n> \n> I am informed The Times has considered legal advice and has replaced two of its archived, now deleted, reports with a new one and tweaked some other of its archived reports.\n> \n> [Justin Borg Barthet has posted on Facebook a broken link to an archived story on Pilatus published by Malta Today.](https://www.facebook.com/justin.barthet/posts/10159403947270403) Malta Today’s Matthew Vella then confirmed to Justin Borg-Barthet they had removed the story following legal pressure from lawyers acting for Pilatus Bank.\n> \n> I can see the point of view of these organisations. They are responsible for employees, creditors, shareholders. Their lawyers are trained and habitually defend them from law suits on a Maltese scale but when faced with an US law suit that could bring about the newspaper’s complete closure, they have to tread carefully.\n\nSome weeks later, new reports came out that the Malta Independent were forced to purge an interview by Maria Efimova, the whisleblower who worked for Pilatus Bank and who spoke about what she saw there, including that the secret offshore company called Egrant Inc., that was widely believed to belong to Malta's Prime Minister Joseph Muscat actually [belonged to his wife Michelle Muscat](https://daphnecaruanagalizia.com/2017/04/declarations-trust-pilatus-bank-safe-egrant-inc-shares-held-michelle-muscat/). Daphne Caruana Galizia reported on this on 20 April 2017.\n\n> Those documents in the Pilatus Bank kitchen-safe are declarations of trust which show that shares in Egrant Inc are held by Mossack Fonseca nominees for “Mrs Michelle Muscat”.\n> \n> The declarations of trust were provided to the bank by Brian Tonna, as a prerequisite for opening an account for Egrant Inc, for which the identity of the ultimate beneficial owner is required. Mrs Muscat’s name is also given on another document held in the bank’s safe: the account opening form for Egrant Inc.\n> \n> These documents have been scanned and uploaded to the cloud, for security purposes, by third parties so that they cannot be destroyed by the bank.\n\nThe day before that, she reported how a company owned by Leyla Aliyeva, daughter of Azerbaijan's ruling dictator, [made ‘loan payments’](https://daphnecaruanagalizia.com/2017/04/company-owned-leyla-aliyeva-azerbaijan-made-loan-payments-hearnville-egrant-tillgate/) to companies Hearnville Inc., owned by Minister Konrad Mizzi, Tillgate Inc., owned by Malta Government chief of staff Keith Schembri, as well as to Egrant Inc.\n\nAnd the day after, on 21 April 2017, she revealed that the sister of Pilatus Bank owner made another ['loan payment' of $400,000 to Michelle Muscat's business partner](https://daphnecaruanagalizia.com/2017/04/us400000-loan-payment-michelle-muscat-jewellery-business-partner-sister-pilatus-bank-owner/), Michelle Buttigieg, who had been appointed “Malta’s tourism representative” in the United States.\n\nIt now turns out that a just two weeks after these revelations, Pilatus Bank tried to silence Daphne Caruana Galizia by appealing to the United States courts and [claiming millions in damages](http://www.maltatoday.com.mt/news/national/84142/pilatus_wanted_jury_trial_in_the_us_against_caruana_galizia_for_millions_in_damages) from her, as Malta Today reports.\n\n> Court documents obtained by MaltaToday show that Sadr and Pilatus sued Caruana Galizia on 8 May in [the Maricopa County superior court](http://www.superiorcourt.maricopa.gov/docket/CivilCourtCases/caseInfo.asp?caseNumber=CV2017-007457), in the state of Arizona, where GoDaddy.com’s headquarters are located.\n> \n> The lawsuit, with an unspecified claim for damages, was filed at the time Caruana Galizia had alleged that the bank had processed a $1 million transfer from a Dubai company to the wife of the Maltese prime minister Joseph Muscat, at the behest of the daughter of Azerbaijani president Ilham Aliyev.\n\nInterestingly, this lawsuit was voluntarily withdrawn on 17 October 2017, the day after Daphne Caruana Galizia was assassinated by a car bomb, as can be seen at the link above.\n\nThe need to silence her was gone."
		},
		{
			"post_id": 7,
			"title": "Henley & Partners involved in threats to the Maltese free press",
			"date_published": 1514133898.6,
			"body": "Henley & Partners is a [democracy-manipulating and election-campaign-financing](https://daphnecaruanagalizia.com/2014/02/the-point-were-all-missing-henley-partners-now-has-a-vested-commercial-interest-in-keeping-labour-in-power-against-all-odds/) company that uses Prime Minister Joseph Muscat as a salesman and sends him around the world to [sell Maltese passports](http://www.independent.com.mt/articles/2013-10-10/opinions/work-it-out-a-maltese-passport-costs-25000-not-650000-2847801345/) and backdoor access to the EU to the rich and wealthy who can cough up the cash. Henley and Joseph Muscat don't do much to hide the impression they give, which is that they're in cahoots.\n\nToday we learn that Henley & Partners has threatened the Maltese news blog The Shift with crippling legal action in the US and UK unless they delete an article titled [Henley and Partners involved in Grenada diplomatic passports scandal](http://theshiftnews.com/2017/12/20/henley-and-partners-involved-in-grenada-diplomatic-passports-scandal/). This is the same kind of threat they used against Daphne Caruana Galizia and the same kind of threat corrupt [Pilatus Bank](https://daphnecaruanagalizia.com/2017/04/breakingmalta-pilatus-banks-main-client-azerbaijans-minister-emergency-situations/) successfully used against the The Malta Independent [last week](http://www.independent.com.mt/articles/2017-12-17/newspaper-leader/TMIS-Editorial-Pilatus-Bank-Malta-s-media-freedom-SLAPPed-in-the-face-6736182724).\n\n> “If this article is not withdrawn, regrettably, we will have no choice but to consider appropriate next steps, including legal action. We ask you to confirm by 13:00 on 22 December 2017 that this article has been removed in its entirety, including any related social media posts,” Henley and Partners said in its letter to The Shift.\n\nHenley & Partners also insisted in bold caps that their letter was not to be published.\n\n![dle.jpg (763x533)](data/img/post_7_dle.jpg)\n\nThe Shift, which was set up after the murder of journalist [Daphne Caruana Galizia](https://daphnecaruanagalizia.com/) in an attempt to try and fill the void, [has refused to back down](http://theshiftnews.com/2017/12/24/henley-and-partners-threatens-legal-action-against-the-shift/). Instead they published the threatening letter they received from Henley & Partners, as well as their reply. We are reproducing those letters and the original article below with links to the PDFs.\n\nSomebody should show Christian Kalin of Henley & Partners some kindness and tell him about the [Streisand Effect](https://en.wikipedia.org/wiki/Streisand_effect). It's Christmas, after all. Someone should tell Christian Kalin that too.\n\nHappy Christmas. Be free.\n\n[**Henley & Partners' Letter to The Shift**](http://theshiftnews.com/wp-content/uploads/2017/12/Henley-and-Partners-Letter.pdf)\n\n![Henley and Partners letter to The Shift](http://theshiftnews.com/wp-content/uploads/2017/12/Henley-and-Partners.jpg)\n\n[**The Shift's reply to Henley & Partners:**](http://theshiftnews.com/wp-content/uploads/2017/12/The-Shift-reply-to-HP.pdf)\n\n![The Shift's reply to Henley and Partners ](http://theshiftnews.com/wp-content/uploads/2017/12/00001.jpg)\n\n<div class=\"entry-content g1-typography-xl\" itemprop=\"articleBody\">\n\n**Henley and Partners involved in Grenada diplomatic passports scandal**\n<span class=\"entry-meta-wrap\"><span class=\"entry-author\" itemscope=\"\" itemprop=\"author\" itemtype=\"http://schema.org/Person\"><span class=\"entry-meta-label\">by</span> [![](http://2.gravatar.com/avatar/82a8f2075421b2207595d4b1c86ee51b?s=40&d=mm&r=g) **Jurgen Balzan** ](http://theshiftnews.com/author/jurgen-balzan/ \"Posts by Jurgen Balzan\") </span> <time class=\"entry-date\" datetime=\"2017-12-20T17:07:20\" itemprop=\"datePublished\" title=\"December 20, 2017, 5:07 pm\">4 days ago</time></span>\n\n<div class=\"g1-wrapper-with-stickies\">\n\n<div class=\"entry-essentials\"><span class=\"g1-frame\"><span class=\"g1-frame-inner\" style=\"padding-bottom: 56.20052770%;\">![](http://theshiftnews.com/wp-content/uploads/2017/12/christian-kalin-joseph-muscat-keith-schembri.jpg)</span></span>\n\n_Henley and Partner’s Christian Kalin (right) with Joseph Muscat and Keith Schembri in the background_\n\n</div>\n\nHenley and Partners, the private concessionaires awarded a multimillion-euro contract to act as agents of Malta’s cash-for-citizenship scheme, are embroiled in yet another scandal in which a 40-year-old Pakistani national was issued a Grenada diplomatic passport in mysterious circumstances.\n\n</div>\n\nThe man, Fahad Sultan Ahmed, holds no official diplomatic position at the Grenada High Commission in London, nor does he hold any other portfolio or assignment anywhere for Grenada.\n\nAccording to various reports, Ahmed is a wealthy Pakistani businessman residing in the UK, by virtue of a visa reportedly obtained for him by Mishcon De Reya, which is the law firm that represents Henley & Partners.\n\nThis latest revelation follows allegations earlier this year that Henley and Partners, which plays a major role in promoting Grenada’s citizenship by investment (CBI) programme, was involved in an alleged scheme to obtain a Grenadian diplomatic passport for a Ukrainian businessman, in exchange of a US$1 million payment.\n\nIn August, Miami-based blogger Kenneth Rijock reported that a [Ukrainian businessman paid Henley and Partners US$1 million](http://rijock.blogspot.com.mt/2017/08/applicant-for-grenada-diplomatic.html) for a Grenada diplomatic passport that he never received. He was later refunded the money by Grenada’s government.\n\n[Caribbean News Now](http://wp.caribbeannewsnow.com/2017/12/18/yet-another-diplomatic-passport-scandal-unfolds-grenada/) reported that WhatsApp messages purportedly exchanged between Grenada’s Prime Minister Keith Mitchell and the chairperson of Grenada’s CBI Committee, Kaisha Ince showed that the latter was asked to “speak to Chris,” believed to be Christian Kalin, the chairman of Henley and Partners over the report on the Ukrainian businessman.\n\nMitchell reportedly told Ince that the news would damage his chances of getting re-elected in the general elections due in 2018, according to Caribbean News Now.\n\n![](http://theshiftnews.com/wp-content/uploads/2017/12/mitchell-ince-whatsapp.jpg)_The WhatsApp conversation between Mitchell and Ince (Photo: Caribbean News Now)_\n\nIn the messages, which Mitchell claimed were fabricated by the opposition National Democratic Congress, Ince answered that she had spoken to “Chris” and they “will put pressure on this blog writer to take the article down”, something which did not materialise.\n\nMurdered Maltese journalist Daphne Caruana Galizia had reported that in March 2017 she received [“a series of harassing and threatening letters from Mishcon de Reya in London”](https://daphnecaruanagalizia.com/2017/05/november-prime-ministers-chief-staff-instructed-henley-partners-threaten-ruin-financially-suing-london-court/) to remove posts on Henley and Partners.\n\nCaruana Galizia had written that she was threatened of financially ruinous action in a London court and published an email exchange with Kalin in which she was unabashedly told that her posts damaged Malta’s international image.\n\nCaruana Galizia was a harsh critic of the cash-for-passport scheme and investigated the links between [Henley and Partners](http://www.independent.co.uk/news/uk/home-news/passports-for-profit-british-company-to-make-disgusting-amounts-of-money-from-controversial-eu-9094251.html) and the Maltese government. [Prime Minister Joseph Muscat is a regular speaker at Henley and Partners events](http://theshiftnews.com/2017/11/28/us-lawyer-who-praised-malta-passport-programme-not-informed-of-corruption-allegations/) organised in places such as Dubai and Hong Kong to promote the scheme.\n\n[Claims by former Opposition leader Simon Busuttil t](https://www.timesofmalta.com/articles/view/20170425/local/busuttil-claims-corruption-by-keith-schembri-in-sale-of-passports.646262)hat the Prime Minister’s chief of staff Keith Schembri and Nexia BT director Brian Tonna received kickbacks from the controversial cash-for-passports scheme are currently being investigated by Magistrate Natasha Galea Sciberras.\n\nIn one of her emails, Caruana Galizia told Kalin that “Henley & Partners must be the most unpopular outfit in Malta right now after [Pilatus Bank](http://theshiftnews.com/2017/11/08/omerta-our-collusion-in-the-great-corrupt-takeover/) – an outfit owned by somebody who bought a St Kitts & Nevis passport from you – and that other outfit run by Joseph Muscat and Keith Schembri, with whom you signed an agreement decided upon before they came to power.”\n\n</div>"
		},
		{
			"post_id": 6,
			"title": "[Updated] FREEMLT and MALTALK soft launch and reaching out",
			"date_published": 1513853468.6,
			"body": "**Update:** Our ProtonMail account is sorted: voiceofthewind@protonmail.com\n\nIt's been a busy and productive few days on ZeroNet and we're delighted to announce that we have got comments working on this site now. Finally, we can do a soft launch of FREEMLT and start to grow and communicate as a functioning community. A massive thank you goes to **gitcenter** especially and to everyone else who helped or encouraged us in any way. Rock on! If you're new here, you might want to read the [welcome post](http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu/?Post:2:Welcome+to+FREEMLT) to understand why FREEMLT is important for the archipelago nation of [Malta](https://en.wikipedia.org/wiki/Malta) and its around 450,000 inhabitants.\n\n![sunrise-bliss-qbajjar-peter-mohr.jpg (960x640)](data/img/post_6_sunrise-bliss-qbajjar-peter-mohr.jpg)\n\n_Sunrise over Qbajjar salt pans. Credit: [Peter Mohr Photography](https://www.facebook.com/Peter-Mohr-Photography-578020045587563/)_\n\nThe problem with the comments was that the site was not being signed properly every time it was changed. Now we know.\n\nApart from FREEMLT, we have also just launched our [ZeroTalk](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/) forum [MALTALK](http://127.0.0.1:43110/1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe/), where anyone can create and reply to posts. The first time you try and post in the comments or forum, you will be asked to create your [ZeroId](http://127.0.0.1:43110/zeroid.bit/) if you don't have one already. MALTALK is the ideal spot to discuss our thoughts, ideas and suggestions as a community.\n\nWe are also starting to experiment with [ZeroMail](http://127.0.0.1:43110/Mail.ZeroNetwork.bit/), but so far have not managed to send or receive messages to anyone other than our own accounts, not even to the echobot test address. Please try sending me ZeroMail at voiceofthewind@zeroid.bit and I'll reply if I get it. You might want to let me know in the comments when you do this test.\n\n**What next?**\n\nThe plan is now to start spreading the word about these sites among the Maltese people and our friends and allies in free and democratic values.\n\n~~We are trying to create a ProtonMail account in order to be able to communicate anonymously and reach out to those we think could be interested in helping with what we are doing. However we are running into verification problems because receiving the ProtonMail verification SMS on a Maltese number is a risk we are not willing to take and we obviously can't link a credit card to make a donation to ProtonMail, much as we'd like to. Any help with that would be greatly appreciated.~~ **Update:** it's been sorted.\n\nSimilarly, we need help with creating a Twitter account and possibly later any kind of similar account that requires SMS authentication, which most seem to do over Tor.\n\nMeanwhile... help your friends get set up on ZeroTalk and stay tuned."
		},
		{
			"post_id": 5,
			"title": "[Updated] Update on FREEMLT and a request for help",
			"date_published": 1513545896.056,
			"body": "<div class=\"body editable\" data-editable=\"body\">\n[**Update of the update:** Comments are now working on this site and so is our [MALTALK forum](1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe), which is launched and working. The problem was that the site was not being signed properly every time it was changed. A massive thank you to gitcenter especially and to everyone else who helped or encouraged us. Details [here](http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu/?Post:6:FREEMLT+and+MALTALK+soft+launch+and+reaching+out).]\n</div>\n\n<div class=\"body editable\" data-editable=\"body\">FREEMLT is [the first censorship-proof website on the island of Malta](http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu/?Post:2:Welcome+to+FREEMLT), set up [in the wake](http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu/?Post:2:Welcome+to+FREEMLT) of the car-bomb assassination of investigative journalist [Daphne Caruana Galizia](https://daphnecaruanagalizia.com/).\n\nWe've been quiet lately, but busy in the background and still unfortunately making no progress on our issues with comments posted on FREEMLT not propagating. We still have not been able to open any ports on our machines and cannot ask for help in real life without compromising our anonymity, so any help we can get here on ZeroNet is highly appreciated. However we suspect that closed ports is not the cause of our issues because our site updates (such as this blog post) do in fact appear to propagate well thanks to contact with machines that have open ports.\n\nCould the issue with commenting be related to the address_index value in content.json? We did not set that when we changed the site address to our vanity address. Any other ideas or other help with this please? Maybe some ideas for testing?\n\nWe would also like to launch a ZeroTalk site at [1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe](http://127.0.0.1:43110/1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe) in the future but we've also had problems with another test site we had tried and with anything related to the ZeroID and user interaction, which is not propagating across machines on our sites. We can interact on other sites though, so we're not sure where the problem lies. It's strange that this is not working and we're stumped. PLEASE HELP!\n\nIn the meantime, please [comment here](http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1513544848_18zH6Av8AX7XdEW9PNFeb8QCs4QdMTVaYB/Update+on+FREEMLT+Question+on+address+index+and+vanity+addresses) in relation to this post.\nThanks.\n\n</div>"
		},
		{
			"post_id": 3,
			"title": "Students banging on a police car in a mafia state",
			"date_published": 1510443655.114,
			"body": "![junior_college_students.jpg (880x495)](data/img/post_3_junior_college_students.jpg)\n\nNow we have [Junior College students banging on a police car and causing a police woman grievous bodily harm](https://www.timesofmalta.com/articles/view/20171111/local/youths-shove-police-sergeant-outside-junior-college.662805?utm_source=tom&utm_campaign=top5&utm_medium=widget) just because their party Pulse won the college council elections.\n\nThis sort of thing is unfortunately an increasing occurrence in Malta and is one of the side effects of having a puppet Police Commissioner. Among other things, Commissioner Lawrence Cutajar is the last of [a string of police commissioners who failed to act](https://daphnecaruanagalizia.com/2016/08/breaking-financial-intelligence-analysis-unit-chief-resigns/) on the Financial Intelligence Analysis Unit report that uncovered serious allegations of wrongdoing by top government officials Keith Schembri and Konrad Mizzi in the wake of the Panama Papers.\n\nThe authority of the police in Malta is based solely and completely on the people's respect for the Malta Police Force and on their belief in that authority. Once this respect is allowed to crumble because of ineptness, inaction, or corruption, then we reach a dangerous situation where the police start to lose their authority in the eyes of the people. If this is allowed to go on, there will come a time when too many people suddenly think at the same time that they can bang on police cars. And, of course, the result will be absolute chaos. We cannot allow Malta to reach that state.\n\nThey say a team is only as good as its leader. That is as true as ever with the Malta Police Force and Commissioner Lawrence Cutajar who [endangers Malta's institutions by ignoring his duty and the oath he swore](https://daphnecaruanagalizia.com/2017/05/guest-post-institutions-fail-country-fails/). He must resign and be replaced by someone who is the people's choice.\n\nAs fate would have it the Silvio Valletta, who Daphne Caruana Galizia mentioned and criticised in the article above and in several others is the same Deputy Commissioner Silvio Valletta, husband of a Government Minister, who was put in charge of leading the investigation into Caruana Galizia's assassination.\n\nIf that was a TV script, it would be way overwritten.\n\nAnd yet some are still shocked when Malta is called a mafia state. These people see Malta's institutions crumble to the point where students bang on a police car and they don't stop and wonder why did Prime Minister Joseph Muscat appoint [such a weak Police Commissioner](https://www.timesofmalta.com/articles/view/20171021/local/minister-evasive-on-trust-in-police-chief-after-press-conference.660949) and why does he continue to keep him in office even after a series of unsolved gangland car bombs culminated in a journalist and government critic being blown to bits in the peaceful Maltese countryside."
		},
		{
			"post_id": 2,
			"title": "Welcome to FREEMLT",
			"date_published": 1510142986.528,
			"body": "FREEMLT is the first censorship-proof website on the island of Malta. This is part of a pioneer project to establish free speech in Malta as an unassailable right where nobody, no matter how powerful, can stop anyone from saying anything.\n\n![freedom_of_expression.jpg (800x435)](data/img/post_2_freedom_of_expression.jpg)\n\nWe believe that true free speech in Malta should be safeguarded from government interference, and <span class=\"_Tgc\">—</span> more importantly <span class=\"_Tgc\">—</span> it should not depend on the corrupt Maltese Government and failing Maltese institutions for protection. FREEMLT is a decentralised website running on the [ZeroNet](https://en.wikipedia.org/wiki/ZeroNet) peer-to-peer network, which makes it virtually impossible to take down. The more people visit and help host FREEMLT, the more robust the site becomes. Please spread the word.\n\nOur ZeroNet address is:\n[http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu](http://127.0.0.1:43110/1FREEMLT3GSta6TynuAC9EWM5mXCnrxkiu)\n\n**Update:** We also invite you to say hello on MALTALK, our decentralised chatroom: [http://127.0.0.1:43110/1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe/](http://127.0.0.1:43110/1MALTALKxyXgvWSqZkcdjsh4LUqqL2bKFe/)\n\nTo join the ZeroNet network and access these websites, please [download ZeroNet](https://zeronet.io/) on your computer. ZeroNet has built-in [Tor functionality](https://www.torproject.org/about/overview.html.en) that you can enable if you want to hide your IP address and increase your chances of staying anonymous. We strongly insist you do so following [these instructions](https://zeronet.readthedocs.io/en/latest/faq/#how-to-use-zeronet-with-tor), after which you will have to stop and restart the ZeroNet program and ideally [use ZeroNet in Tor Browser](https://zeronet.readthedocs.io/en/latest/faq/#how-to-use-zeronet-in-tor-browser).\n\nWhen you visit a ZeroNet site, you will by default host up to 10 megabytes per site on your computer, though you may be asked to grant more space if required and you can also allocate more space manually. You are not obliged to increase the hosting space and ZeroNet sites will still work if you don't, though larger sites may be slower.\n\nAnd of course, once you download ZeroNet, you will be able to publish your very own censorship-proof websites free of charge too. In fact, that's the best bit!\n\n## Why does Malta need FREEMLT and censorship-resistance?\n\n> There are crooks everywhere you look now. The situation is desperate.\n\n![daphnecarbomb.jpg (800x502)](data/img/post_2_daphnecarbomb.jpg)\n\nThe ongoing erosion of free speech and the systematic dismantling of rule of law in Malta came to a tipping point on 16 October 2017 when a car bomb brutally ended the life of Daphne Caruana Galizia and silenced the voice of the top investigative journalist on this Mediterranean island nation and EU member state. Quoted above, are the very [last words](https://daphnecaruanagalizia.com/2017/10/crook-schembri-court-today-pleading-not-crook/) she published just half an hour before she was assassinated. \"The situation is desperate.\"\n\nDubbed by Politico as a [“one-woman WikiLeaks”](https://www.politico.eu/list/politico-28-class-of-2017-ranking/daphne-caruana-galizia/), Ms Caruana Galizia and her blog [Running Commentary](https://daphnecaruanagalizia.com/) were the go-to source for daily revelations and stories about Malta's corrupt political elite and the mafias they enable, from minor corruption to international affairs such as [EU Commissioner John Dalli's snus scandal](https://lovinmalta.com/news/news-politics/swedish-newspaper-publishes-recording-of-john-dalli-canvasser-offering-10-million) for which he was made to resign and the [Panama Papers](https://daphnecaruanagalizia.com/2016/04/commissioner-police-set-resign/). The New York Times [reports](https://www.nytimes.com/2017/10/21/world/europe/malta-daphne-caruana-galizia.html):\n\n> The list of people whom Ms. Caruana Galizia offended and infuriated as a prolific journalist in this tiny Mediterranean island nation includes many members of Mr. Muscat’s ruling Labour Party as well as the leader of the center-right opposition. Also on the list: the president of Azerbaijan and his family, executives of a Chinese electrical equipment manufacturer, foreign drug barons, an Iranian-born banker and people active in offshore tax havens like Panama and the British Virgin Islands.\n> \n> All of them were the targets at one time or another of Ms. Caruana Galizia’s relentless probing of the underbelly of the European Union’s smallest country, a nation that boasts Europe’s fastest growing economy but has been hit by six car bombings in the past two years, all of them unsolved.\n\nBut Daphne Caruana Galizia was harassed and targetted for her writing long before she was brutally killed. She wrote repeatedly about the constant threats, the frivolous libel suits and the freezing of her bank assets she was subjected to, including in May 2017 when she remarked that the Maltese people should be the ones to sue their politicians, instead of [politicians suing the press](https://daphnecaruanagalizia.com/2017/05/ones-suing-disaster-theyve-brought-malta/).\n\n> Malta must be the only country in the civilised democratic world where politicians do not only think it is normal and acceptable to sue journalists, but they actually think it is a good PR response which improves their image.\n> \n> At this advanced stage, however, it is quite clear that the entire gang and those who make money off it and with it are suing as an intimidation strategy as they retreat under siege.\n> \n> Over the past few weeks I have been hit with around 30 libel suits all filed by members of the crooked clique: Phyllis Muscat, Silvio Debono (19 from him alone), Joseph Muscat, Michelle Muscat, Keith Schembri and Konrad Mizzi. Even Saviour Balzan planned to join in and take a false oath in court saying that Schembri didn’t call him at 1am, when he did. And let’s not forget that brothel-creeper Chris Cardona and his bald person of trust, with their four libel suits and €50,000 precautionary warrants on my bank account.\n> \n> I have also received multiple threatening letters from Henley & Partners and their lawyers in London, with a warning not to publish their letters – what will they do if I _do_ publish them, fly over and bite me? – and an attempt at scaring me by saying that they will sue me in the “UK courts”.\n\nThat last sentence so poignantly captures the indomitable spirit with which Daphne Caruana Galizia fought against corruption: \"What will they do if I _do_ publish them, fly over and bite me?\"\n\nUnfortunately, now we know what some people are capable of in revenge for writings past or on order to prevent anything new from being revealed. The chilling effect of this car bomb assassination is taking hold of the island. The [few people protesting against the government](https://manueldelia.com/2017/11/we-happy-few/) are being hounded and harassed and accused of having an agenda other than that of stamping out the mafia and corruption that has gripped Malta. There is a serious worry that the public backlash against what is now being called [Malta's Mafia State](https://www.timesofmalta.com/articles/view/20171021/local/ex-british-anti-corruption-boss-dubs-malta-mafia-state.660939) will die down and the crooks will get away with everything, even the murder of a journalist. And this desperation is compounded by the fact that trust in the Police Commissioner and other institutions has [reached rock bottom](http://www.independent.com.mt/articles/2017-10-30/local-news/Watch-Home-Affairs-Minister-Michael-Farrugia-continues-to-defend-police-commissioner-6736180854).\n\nThe good news is that we now have the technology to communicate freely and even anonymously if necessary. The first step to returning democracy to Malta is to be able to communicate freely once again. It is high time we build up this censorship-proof infrastructure and learn how to speak our minds without fear.\n\nPlease consider downloading [ZeroNet](https://zeronet.io/) and hosting FREEMLT if you are not doing so already. And don't forget to get experimenting with your own censorship resistant site too!"
		}
	]
}