{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1605514254,
			"title": "Far-fetched Situation",
			"body": "Back before covid-19 had really been a wide-spread thing me and two other friends had some very strange premonitions that bad things were coming. Anyone else get the same feeling right before covid-19 happened?",
			"added": 1605514253
		}
	],
	"topic_vote": {
		"1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 1,
				"body": "> [styromaniac](#comment_2701_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I've called a pandemic long before it happened. [...]\n\nJust out of curiosity, what would you classify as the elite? The rich and wealthy? Or the people who run our countries?",
				"added": 1605515704
			},
			{
				"comment_id": 3,
				"body": "I definitely don't disprove or approve of any theories. They all intrigue me equally. I just found it odd that me and my friends went through some strange almost psychic shit right before this all broke loose. I do think this virus/pandemic was created or influenced by manmade technology though.",
				"added": 1605559857
			},
			{
				"comment_id": 4,
				"body": "> [jeff](#comment_66_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Fauci was conducting research on SARS in this country from ~2014. When it was banned, he used grant money to move the project to Wuhan and continue research. The creation of this monster is all Fauci's doing. He should be imprisoned.Whether or not the release of SARS-COV2 was intentional, Xi and WHO did everything they could to cover up the virus' toxicity and its origin. CCP and WHO should be dismantled for this alone.\n\nVery interesting, I hadn't known about that until you brought it up. Goes to show how much media attention something like that gets. Honestly, this is probably just one of many examples of how were being led towards a dystopian society. A society where everyone must stand in line or face punishment. Essentially, what China is going through but worse. Hopefully America wakes up to what's going on before it's too late.",
				"added": 1605640570
			}
		],
		"1605282602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "Very interesting stuff. I honestly believe AI won't need to feel true emotion, it will be able to replicate our emotions so well that we won't even know the difference.",
				"added": 1605552581
			}
		],
		"1604697444_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX": [
			{
				"comment_id": 5,
				"body": "If you get off to children you belong shot on the side of the road. Illegal or legal doesn't matter, they're fucking kids.",
				"added": 1605678760
			},
			{
				"comment_id": 6,
				"body": "I hope this is a honeypot and the people who click on it are going to fucking prison.",
				"added": 1605678796
			},
			{
				"comment_id": 7,
				"body": "> [anonynous38883](#comment_14_1JMrG6HuqZast8Kn4n4SCjosDVAAY7qtwX): You can think what you want. i am a child lover and i am in Alice in wonderland , and rindex Forum pedo I am a member and i am in another Board forum .. You dont need to reply to this topic Serve to nothing i share the link.\n\nYou are ill. But whatever, nothing I say can stop you.",
				"added": 1605688077
			}
		],
		"1605036890_1HtCCTkHppfVtiHtQ9ef2QXeopTP9wSMyt": [
			{
				"comment_id": 8,
				"body": "> [blkdissident](#comment_12_1NH142U7sEqKGnZXg5VUFp5SPtSjdDaSwN): Oh no, \"One Pissed off American Citizen\" refuses to give his consent to be governed! What will Sleepy Joe and the Demon-rats do now?  [...]\n\nUnfortunately for this narrative it isn't just one pissed off American Citizen. There are plenty of people who are extremely displeased with present day and future circumstances. If enough people get pissed off- Well, we've seen what happens. Riots and other acts of violence. Look back through history and understand that rebellion will happen if enough people get fed up.",
				"added": 1605688365
			}
		],
		"1604659936_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 9,
				"body": "Is there a transcript for this? Unfortunately I don't know any fluent Spanish speakers. I have my doubts about this and would like to see it for myself.",
				"added": 1605688507
			}
		]
	},
	"comment_vote": {
		"2_1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9": 1,
		"3_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": 1,
		"5_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"3_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"4_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"1_1EsY6PtroZ2DyaVt6mTFPtZQqxaJ1hwJG1": 1,
		"14_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": 1,
		"2_1BzSytFDUwQ6UJCdJxsf9QjNdeVq4jt5WX": 1
	}
}