{
	"next_topic_id": 12,
	"topic": [
		{
			"topic_id": 1519466398,
			"title": "如果超级高铁到来，是否说明中国高铁存在决策失误？",
			"body": "超级高铁在建造成本和运营成本上都远远低于现在的高铁，各方面都优于现在高铁，那么中国花巨资建造高铁是否决策失误？\n\n答案中有提到磁悬浮成本的问题，因为超级高铁车体采用永久磁铁以及一系列新技术，所以成本要远远少于现在磁悬浮。\n有人说这是宋“美龄主义”，但是中国高铁刚刚建成其他国家就建出更先进的高铁，这不同于战时装备的采购，战争长的也大多超不过10年，抗日战争从七七事变到胜利8年，这么短的时间技术进步的空间是有限的。但超级高铁是巨大的进步，不在“宋美龄主义”的范围。我指的失误是对这一技术进步没有丝毫反应。\n       还有我的问题的重点是花“巨资”，也就是一下修建很多高铁，我同意建高铁有用，但是重点建这么多里程是否是失误?完全可以先在东部发达地区修一些高铁就好了。\n       还有现在高铁有没有留下技术进步空间?如果印度超级高铁成功，中国高铁是否会成为鸡肋但又没钱建新的超级高铁?\n超级高铁如果成功的话也就是这几年的事，实践是检验真理的唯一标准。",
			"added": 1519466397,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466448,
			"title": "被光速打脸是种怎样的体验？",
			"body": "打脸被打脸均可。\n脸在这里其实代指的是面子。打脸即是落面子，通常就是对某个贴或者某人的言论进行否定，吐槽，揭露真相等等。 比如： 楼主被打脸打得恼羞成怒，开始忍不住骂大街了?",
			"added": 1519466446,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466527,
			"title": "室友哪些行为让全宿舍人笑到爆炸？",
			"body": "",
			"added": 1519466524,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466670,
			"title": "如何评价《舌尖上的中国》第三季？",
			"body": "没开播前可以说说您对《舌尖上的中国》第三季的期待。\n![](http://5b0988e595225.cdn.sohucs.com/images/20170908/b30317898658456ca644a588a5320218.jpeg)",
			"added": 1519466666,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466734,
			"title": "平时养成哪些小习惯，日积月累会带来很大好处？",
			"body": "是否真的有一些小习惯，只要长期坚持就会给健康带来很大好处呢？\n对学生党来说，条件比较有限，培养哪些习惯会有用呢？",
			"added": 1519466729,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466799,
			"title": "中国目前的贫富差距有多大？",
			"body": "",
			"added": 1519466793,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466923,
			"title": "都说冷战的军备竞赛把苏联经济拖垮，那为什么没有把美国经济拖垮？",
			"body": "美国不也参加了军备竞赛，怎么就没有把美国拖垮？",
			"added": 1519466916,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519466994,
			"title": "你有哪些给高中生的建议？",
			"body": "任何方面都可以。\n\n如果能让你重回高一，你希望做什么来让自己将来不后悔？希望做什么来避免已经犯下的错误？\n\n比如说：\n\n学习上，要避免绝对化，保持灵活性；\n\n感情上，不要轻易拒绝喜欢你的妹子、要多孝顺父母；\n\n人生建议方面，要学学心理学，思维科学，哲学，要学学弗洛伊德、荣格、朱建军、武志红…要多看书，对了，有什么书能推荐的吗？比如，《现在全明白了—你我他的自我认识之路》、《少有人走的路》、《荣格自传》等等。\n\n能承载你们的期望，替你们完成你们当初后悔没有做的事情，是我的荣幸和愿望。把我当作你的孩子，我会乖乖听教导的哦~     （吐舌^_-）\n\n           #^_^#",
			"added": 1519466986,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519467107,
			"title": "日本人看了中国拍的抗日剧是什么反应？",
			"body": "",
			"added": 1519467098,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519467199,
			"title": "怎样的人不宜深交？",
			"body": "",
			"added": 1519467189,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		},
		{
			"topic_id": 1519467441,
			"title": "为什么有的人很反感网络语言？",
			"body": "本人，极度恶心、重度反感网络语言以及一些所谓的“梗”，到底是为什么？",
			"added": 1519467430,
			"parent_topic_uri": "1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1519376777_1BbN1xhBnifxrrSLqriYip76y3nqMCGPvK": 1,
		"1519030886_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1518786357_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH": 1,
		"1517727826_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517805548_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1517729130_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1520077183_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": 1,
		"1520240999_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": 1,
		"1519376875_1BbN1xhBnifxrrSLqriYip76y3nqMCGPvK": 1,
		"1519065188_1Ko7622HKggRGbJny5hCS4n9wwMAVVLTSf": 1,
		"1518798717_13G4ZWKJ3fyGfGYrKqtyCownxvxKL5jwo1": 1,
		"1518773623_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH": 1
	},
	"next_comment_id": 22,
	"comment": {
		"1519466398_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 1,
				"body": "是啊，如果美日德甚至印度一两年搞出hyperloop，三四年全自由世界推广，完爆大陆高铁10倍速度，然后对大陆封锁技术，大陆高铁一瞬间变成绿皮车，那就是大陆失误不行，被打脸的很疼呗。\n\n没有什么可解释的，当年苏联就是在玉米、计算机芯片上压错宝了，还有工业错配导致变成了落后生产力，掉进越穷越搞军工的死循环最后玩完的。\n\n国运大计，压错宝，弄错方向，就是会耽误国运，这是必然的。\n如果西方阵营真把hyperloop彻底普及，把成本降低到很低的程度，那光是工业成本降低和运兵运机械化部队辎重就够大陆很难受得了。\n\n当然，现在你们也只是想想而已，满嘴药丸也不是真的相信药丸，那就借点时间造更遥远的药丸呗，反正是可持续崩溃。",
				"added": 1519466421
			}
		],
		"1519466448_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 2,
				"body": "高二，晚自习，班主任把我喊出去。\n班主任: 你是不是谈恋爱了?\n\n我 :没有啊\n\n班主任: 那我昨天中午看见你和一个男生，高高瘦瘦的，不是很白，在××买鞋?\n\n我: 老师你看错了吧，我昨天在家一天都没出门，我一直在写作业 :)\n\n班主任笑着说 :噢…那我可能看错了，有可能是陈xx(我当时同桌)，你俩长得挺像的，\n对了，陈××有男朋友吧?\n\n小黄鸭眉头一皱，发现事情并不简单。\n\n其实班主任根本没有看错，他压根就是编的，想要套我的话，他一定听到了陈的八卦传闻。\n\n我镇定地说: 陈xx有男朋友?不可能吧，没听说啊。\n\n班主任: 你是确定没有，还是不了解情况?(一字一顿)\n\n我: 我百分之99确定!\n同时给他一个笃定的眼神。\n\n班主任什么都没说，我以为他不能全信，也是半信吧，毕竟我这个逼装的是99分。\n\n回到班上，我火速告诉了同桌: 诶呀不得了，班主任不知道怎么知道你和zh了怎么办，他刚刚还说看见我和一个男生昨天买鞋，然后……\n\n同桌打断我: 他炸你呢!\n\n我说: 对啊我知道!我昨天根本没有出门!\n\n同桌: 不是，他昨天看到我和zh了，我们去吃酸辣粉，没看到老班和他女儿也在里面，我和zh 还接吻了……我正准备下晚自习和你说。\n\n明知山有虎，偏向虎山行，兄弟，我为你插刀了× ×\n\n\n◎◎◎◎◎◎◎◎◎◎◎◎◎◎◎◎◎◎◎\n再聊一件我的高中班主任关于 谈恋爱 的事儿吧。\n\n冬天的一个早读。他在班上巡查了一番，走到我桌子前，突然问我: “你的脖子怎么了?” \n 语气十分严厉 八分震惊  三分痛心……\n\n我吓了一跳，还没反应过来。\n他又说:“你是不是谈恋爱了!”\n\n这又是看见谁吃酸辣粉了!我好怨啊！\n\n我说没有啊，班主任看了我两眼然后让我下课去办公室。\n\n我赶忙问同桌我脖子怎么了，她说没什么，就红了，有一条条红印子。\n\n我:“ 他该不会以为我得了什么皮肤病吧……”\n同桌: “嗯，或者以为你爸妈打你了?”\n\n后来到办公室，老师问:“你的脖子是受伤了吗?”\n我说:“ 洗澡抓的呀。昨天去的澡堂，比家里热多了，我感觉抓下了另外一个自己。”\n\n班主任:“哦…………”\n“那好吧，下次小心点。我以为…你…怎么了。”\n\n我心想果然我猜对了! 因为有的皮肤病会传染，所以班主任要严肃对待。\n\n后来大二，一个好朋友和男朋友搬出去住了，我第一次在她脖子上看到“伤”的时候，还以为是同道之人，她和我解释，此处省略50字左右。\n我突然想起了那年冬天的早读，班主任那句你是不是谈恋爱了，原来错过了一辆去幼儿园的车。",
				"added": 1519466462
			}
		],
		"1519466527_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 3,
				"body": "大学班里女同学，大部分行为上特纯洁，但思想都比较污，有天晚上寝室老三又不知道从哪发现了点色情小视频（比较清新的那种），正准备熄灯欣赏，老大听到之后，让老三转发到我寝四人的“二班性感澳门女荷官发牌群”，大家一起观摩一下。\n\n\n“哦”，老三答应了一声，然后就躺下耳机先看上了。\n\n\n过了一小下下，老大不耐烦了，喊老三，“老三你发到群里呀~”\n\n\n老三：“哎呀，我都发到群里啦”。\n\n\n？？？？？没有啊，你发那个群里啦？\n\n\n“卧槽，老三你怎么转发到班级群里了！！！”\n\n\n“快快快，没到两分钟，赶紧撤回！！！”\n\n\n然后，老三用迅雷不及掩耳盗铃速度....\n\n\n点了一个删除。",
				"added": 1519466537
			},
			{
				"comment_id": 4,
				"body": "大家在深夜卧谈，宿舍长要睡觉了。\n\n就喊了一句：“谁说话谁傻逼。”\n\n空气变得凝重起来，此时宿舍长可能是觉得大家有把他当成傻逼的嫌疑，然后又说了一句：“这句话之前谁说话谁傻逼。”\n\n这时候大家已经憋不住了，开始小声笑起来。\n\n宿舍长为了缓解尴尬的气氛又开口了：“我是说，我上一句话之前谁说话谁傻逼。”\n\n从此宿舍流传着宿舍长十秒钟骂自己三次傻逼的故事。\n###########\n更新一个宿舍长唱歌：\n\n“十年之前，你不认识我，我不认识你。”\n###########\n\n最后祝大家新年快乐，凯年大吉",
				"added": 1519466553
			}
		],
		"1519466670_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 5,
				"body": "第一季是真正的大观园，第二季是刘姥姥回村里给大家讲的大观园，第三季是听刘姥姥讲完大观园的村里人回去给家里人讲的大观园。",
				"added": 1519466680
			},
			{
				"comment_id": 6,
				"body": "“从深山老林到悬崖峭壁”\n“多少道工序手工制作”\n“古法”“匠心”“自然”\n“坛子碟子碗充满了生命”\n\n给人的感觉像是罗老师骑着煮饭仙人含着极草腰里别着8848导演的小罐茶广告",
				"added": 1519466691
			}
		],
		"1519466734_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 7,
				"body": "大学时代是培养一个人做事风格的黄金时代，所以我觉得对一个即将走向社会，全面承担起社会以及家庭责任的大学生而言，尽早地形成用统筹方法利用碎片时间的习惯会对以后的工作和生活带来无穷的收益。\n\n前几天有人在知乎问我怎么有那么多时间刷知乎，你很清闲吗？这个问题不仅知乎有人问过，我的同事也问过我，她还天天坐在我对面。她一天到晚除了上课时间其他时候都在电脑前，周末就放一天假回家还要带教材，上个月刚结婚，蜜月里晚上还看书，老公被憋得团团转，被我狠狠嘲笑了一通。\n\n其实，我的工作并不清闲，尤其是今年带高三，每天七点四十上班，有晚自习的话九点半才下课，一周休息一天，而且作为一个主妇，家里里里外外全都是我一个人操持，因为老公工作经常出差，父母也不在身边，尤其是还要照顾孩子。要把这些事安排妥帖并不容易，我曾见过我一个刚生了孩子的同事上班时衣服上沾着孩子的便便，也有同事白天上班晚上看孩子，奔溃到放声大哭，而别人看到的我起码是气定神闲的。\n\n就这我每天还会坚持跑步，所以哪怕是天天跟我面对面坐着的同事都好奇我是怎么做到这一切的，而且我每天上班都是化着淡妆，踩着八厘米的高跟鞋，衣服上永远不会有褶子。\n\n而且在从今年四月开始在知乎码字，到今天为止总共回答了100个问题，大部分答案都在两千字以上，总共写下了将近二十万字，也得到了二十六万赞，十万关注。\n\n其实我能做到这些，秘密就在我对碎片时间的利用，很多人总是想着等我有了大段大段的时间我再做什么，口头禅就是等我有时间了，有的人甚至时常幻想等我退休了再去干啥干啥，相信我，如果这样你很有可能什么都做不成，现在的都市生活不可能有那样大段大段的时间让你专门做什么。\n\n我就以我一天的时间安排来说说怎么统筹规划利用碎片时间的，对，这里面有统筹思想。\n\n我每天是六点五十的闹钟，醒来后先躺在床上刷刷知乎，跟皇帝早朝批奏章一样，看看有什么适合回答的问题，有的话就记下来，这就跟高考考语文一样，卷子发下来先看看作文题目，先构思，构思好了下笔就快了。\n\n七点起床，十分钟穿衣，洗漱，据我所知，很多女生早晨起来在衣柜前搭配衣服就要花半个多小时，甚至穿了脱，脱了穿，最后导致上班迟到，为了避免这个问题，我会在前一晚就把第二天要穿的衣服鞋子搭配好，所以就可以在十分钟内搞定这些。\n\n然后七点四十到学校签到，签到后如果没有第一节课，我们有一个小时吃饭锻炼时间，我就利用这一个小时去公园跑步，跑四十分钟左右回来路过菜市场，用十分钟时间买好菜，有的人又问买菜怎么可能十分钟搞定啊？买菜对有的人来说的确很费时间，因为他没提前想好买什么，所以在菜市场转来转去浪费时间，而我在跑步时已经把要买什么都想好了，所以到了菜市场直奔主题就可以了，不用转来转去浪费时间。\n\n九点之前到学校，然后准备一天的课，因为我在工作前三年备课备得非常扎实，所以以后再备课就不用花太多时间了，然后就是上课，每节课我只讲三十分钟，剩下十分钟学生自我消化，然后我面批作业，对，作业我在课堂上就批改了，从来不会说夜深了老师还在批改作业，夜那么美，干点啥不好，非要改作业，而且我的作业是面批，谁没做，作业质量如何都当面反馈给学生了。\n\n十二点下课，在这块你注意下我的统筹思想，我到楼底下就会掏钥匙，而据我观察这个习惯一些男性有，但有这个习惯的女性非常少，很多女性都是到门口了才从“包含万物”的包里找钥匙，这个过程有时需要几分钟，然后进了电梯如果没人我就会开始脱衣服，尤其是冬天，穿得比较多，大衣，靴子脱起来很麻烦，我会先把扣子解开，拉链拉开，进门的同时鞋也脱了，大衣也拿手里了，然后进门第一件事先煮上米饭，然后再换家居服，准备炒菜，而如果反过来，先换衣服，再煮饭，花的时间就多了，炒菜也是一样，比如今天我要炒醋熘白菜和西红柿炒鸡蛋，怎么炒也是个问题，有人会炒好鸡蛋，再炒西红柿，再把鸡蛋加到炒好的西红柿里，然后洗锅炒白菜，因为炒过西红柿必须洗锅，这样中间就得洗一次锅，浪费时间不说还麻烦，那我怎么炒呢？先把鸡蛋炒出来，炒过鸡蛋的锅没粘什么东西，可以直接炒白菜了，炒过白菜的锅也可以直接炒西红柿，这样就节省了一次洗锅的时间。\n\n有人会问这能节省多少时间啊？你单独看可能觉得节省不了多少，但有对比就很明显了，别人家两口子出门都是老公站在门口不耐烦地等老婆，老婆还气定神闲地画眉描唇，而我们家刚好相反，每次都是我化好妆站在门口吼我老公，你能不能快点？！\n\n然后吃饭，在这过程中看一会电视，我一般都是看看记录频道，我看得那么多纪录片都是就着饭看的。当然这个习惯据说对健康不利，好在我看的时间并不长，一般十二点四十之前我就能吃完饭了，你看我做饭吃饭用了四十分钟，吃完饭保姆洗碗，我会带儿子，他要玩就陪他玩，他要睡觉就陪她睡觉，有时他睡着了我就刷刷知乎，如果有合适的问题就回答一下，因为我在跑步时会想很多东西，所以真正写东西花的时间很少，很多我几千赞的答案都是十几分钟写好的。所以正是我脑子不停的旋转才能保证我身体气定神闲。\n\n下午两点半到五点上课，通常在上班前我会告诉保姆我（评论区很多人纠结这保姆的事，请问谁家有孩子后没有父母或婆婆帮忙带孩子，有婆婆帮忙照样团团转把生活搞成一锅粥的多的是，况且我家的保姆是看孩子的，家务只洗碗）下班前帮我煮好粥，下午回家我做个凉菜就可以吃饭了，晚饭我都吃得很简单，坚持了两年多，再加上跑步，我体重下降了15斤，这也算是另外一个长期坚持获得很好效果的习惯，管住嘴，迈开腿，其实我能做到这些，除了充分利用时间，还依赖好身体，我是那种精力旺盛的人，一般十二点睡了，六点多能自然醒。有的人做一点事就不愿意做了，不是懒，是体力不济，所以趁年轻锻炼身体。\n\n所以，一天对每个人来说都是24小时，但又不是24小时，看你怎么用了，胖子不是一口吃成的，而是一口一口吃成的，每天积累一点，总有一天你会吓别人一跳。",
				"added": 1519466747
			},
			{
				"comment_id": 8,
				"body": "1.坚持吃早餐。因为胆囊炎去了医院，再也不敢不吃早餐了。\n\n2.坚持多喝水。作为每天不是坐就是睡的程序员，缺水很容易疲惫，而且很容易得肾结石，别问我怎么知道。\n\n3.吃东西量力而为。比如不能吃辣的尽量别吃，两次因为肠胃炎的感悟。\n\n4.坚持早上比平时早五到十分钟起床。早起几分钟，洗漱就游刃有余，不赶时间特别爽，心情会很好，上班会比较有精神与效率。\n\n5.坚持早上起床后叠被子。下班回来后一看整齐的床就很愉快，倒在整齐干净的被子上，那个舒爽(这个看个人喜爱，有人喜欢随意点，舒适就好)。\n\n6.坚持看新闻看书。会发现与人交流时会发现不会插不上话了，不至于博学多才，长久下去肚子还是会点料的。\n\n7.工作或者学习时需要问人才知道的东西，用笔记或者文本记下来，坚持下去，会发现以后不需要问别人了，别人反而会过来问你。\n\n8.男生的话坚持隔几天或者一个星期整理一下宿舍卫生，干干净净心情会很好，人也会充满自信。\n\n9.做技术的，或者学习的，学会总结，坚持做积累。过了很久后，会发现自己也做了那么多东西，会比较有成就感，容易形成正反馈。\n\n10.找一个兴趣爱好，坚持下去，可以释放压力，可以拓展自己，会发现一个更美妙的世界。\n\n11.坚持定时打电话跟家人聊聊天，态度要好。我每个周末都会打电话跟爸妈聊聊，对他人好，对家人就应该真的更好，长久下去，跟家人关系会越来越好。\n\n12.坚持少抱怨，无论是对朋友还同事，特别是工作中，会容易留下好点的印象。\n\n13.坚持不要晚睡，容易身心愉悦。我是不大会超过十二点半睡觉(因为我是早上七点五十分的闹钟，住公司宿舍的好处哈哈)，晚睡半小时犯困一上午，还会导致容易赖床、黑眼圈、赶时间、吃早餐匆忙，身心乱糟糟的。\n\n14.坚持注意自己的形象。特别是比较宅、比较随便的，走路注意挺胸收腹收下巴，不高不帅也可能干净清爽是吧，这样比较容易交到朋友。\n\n15.坚持凡事多思考，别人云亦云，别太迷信他人，别高看他人，别低估自己，慢慢就会形成自己的比较理性的主见。\n\n16.对于不喜欢浪的而且还不是很懒的宅男宅女，坚持培养做家务的能力，锻炼自己的厨艺，慢慢就会发现，在这大城市，也有一个舒适的小家了，哪怕是单身狗也能活出人样。\n\n17.坚持尝试新的东西。一个新的编译器，可能会花我不少的时间与精力去熟悉，到熟悉后再也回不去了。时代进步很快，自己不能落下，特别是尝试新的工具，会极大提高学习与工作效率，切记。\n\n18.下软件时尽量到官网下，会很大程度避免各种全家桶各种主页绑定。很多网站下载的软件被修改了，安装时会绑定安装各种东西，一不小心就中招，还是去官网靠谱点，不闹心(有人说官网下也闹心，比如迅雷，确实是这样，但是你去其它渠道下的也差不多，同一个版本而言官网的相对干净点)。\n\n19.尽量做到能不装逼别装逼。你的圈子的人基本都是跟你自己水平差不多的，人家会觉得你傻逼，就像你觉得别人傻逼一样。\n\n20.尽量别说一些绝对的话，能做就别说。有个朋友，有次看到他发朋友圈说朋友圈怎么不好不好，浪费时间，所以他关闭朋友圈怎么个好处法，还拉了一些人开了群交流关了朋友圈后的心得，最近发现他开始发朋友圈了，就感觉有点搞笑了。\n\n21.坚持温水洗脸脸上皮肤会变好。其实我是因为冬天怕冷这样做的，后来发现脸确实比以前干净了。我一般洗漱前装一壶水(我有个烧开水的小壶)，刷完牙就有温水洗脸了，特别方便。\n\n22.买个移动硬盘，重要东西坚持备份，有用的软件也备份一个以后会有惊喜。之前每次搭开发环境差不多搞半天，下载各种东西特别麻烦，后来我把它们备份到移动硬盘去了。前个星期在新电脑上搭环境，不到半个小时搞定了。各种平时用到的比较好用的软件工具什么的都备份一下，下次不用下载了，不用担心有没有广告有没有全家桶，特别爽，这是真的特别好。\n\n23.坚持拒绝诱惑，不要好奇。这个是最近的感悟，有个朋友的朋友，据说一年多前被老司机带去大保健，现在已经成为妥妥的老司机了(老司机别笑我哈)，这货偶尔找个小姐什么的，然而他还有个一起很久了的女票。人性心理本来就是很奇妙的，做过了会有认同感(我认为的，昨天还跟朋友讨论了一下，比如不玩游戏的人会觉得玩游戏的人堕落，他玩了之后就很大可能会改变了这个想法，或许当你变成你讨厌的那类人后，你会变得认同它，觉得好像这样做也没什么的)。所以不能碰的东西不要碰，比如毒品赌博等等，1跟0本来就是对跟错，切记。\n\n24.坚持尽量做到动手前先好好思考。这大概是我工作以后认识最深刻的一点了。从我写代码的体会说一下:对于做开发而言，开发一个系统一般要做系统原理设计，功能流程设计，目的是要想清楚要这个系统要怎么做。新人刚开始一般是这样的，看到需求只想怎么实现这个功能，所以到最后一般后面要改很多，包括功能实现，代码逻辑等。动手敲代码前必须得先思考清楚，整个实现逻辑合理不，代码结构好不，觉得差不多了，就发现代码敲得飞快，bug也比较少。从绘画的体会说一下(我有时会想一下绘画与写代码的共同点哈哈别笑):绘画一般都是先打形，觉得形没问题了再画细节。先整体后局部，跟开发系统一个道理。动手前思考清楚，忽略具体，先思考整体，可以有效避免最后出来的效果出现巨大偏差。\n\n以上，都是一些切身的体会与感悟！\n\n不一定适合每个人，结合自己实际，希望对你有帮助，谢谢支持。",
				"added": 1519466758
			}
		],
		"1519466799_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 9,
				"body": "1\n过年跑去三亚自驾游，人山人海，我爸高速上追尾了一辆路虎。\n开路虎的是一位大爷。我们打了双闪下车协商，据我爹描述，他当时心里想着到底路虎大爷要的赔偿超过多少他会选择走保险……然后大爷瞅了车屁股一眼，又瞪了我们一眼，开车走了。\n我们一家：……\n大概人家急着赶路，真不在乎这点钱。\n\n2\n\n一路上我都在跟我爸说，你可别再追人家路虎了。\n我爹表示科科，前面全是百来万的车，哪个追得起？\n\n3\n\n春节期间，亚龙湾的酒店均价3000/天。\n回北京的机票已经1w4了。\n还是人山人海，遍地都是人。\n\n4\n\n本地人跟我们说，海南人均收入也不高，沿海的房子本地人都买不起，全是外地人来买。\n而这些海景房，淡季的时候都是空着的，基本上只有冬天的一两个月有人住。\n\n5\n\n来买房的，主要还是东北人。\n我们去海边溜达，发现海边还有东北大妈们在跳广场舞，扭秧歌，不亦乐乎。\n走到哪里都能听见东北话。\n别的地方的游客跟我们说了个笑话：国家每次往东北投个几百几千亿振兴经济，海南的房价就要大涨一波。（……）\n这个笑话真的是我听说的，不是我说的……\n\n6\n\n国际免税城同样人挤人。\n关键是我第一次在奢侈品云集的地方看到这么多人……好比小时候元宵节公园的灯会，小孩子走丢了都找不着的那种程度。\n美妆区简直挤爆，柜姐们一个比一个高冷，都懒得搭理你，但依旧阻挡不住各个年龄段的女性往前冲，比挤地铁还凶，买起口红来就跟不要钱似的。\n\n7\n\n最后我啥也没买就走了。\n因为结账的时候，柜姐说必须要出示机票。\n我开始认真思考，这么多全国各地牌照的车子里装的都是买了机票的人吗？\n\n8\n\n想吃大龙虾。\n酒店的餐厅，最便宜的龙虾398/斤，还有1688/斤的，1888/斤的。\n后来我看到了西红柿蛋花汤——68/例。\n望了眼几乎坐满了的餐厅，我开始深思我们这种算不算赤贫阶级。\n\n9\n\n反正最后我没吃大龙虾。\n\n10\n\n闺蜜亲切地给我安利了淘宝8毛钱一碗的冲泡的西红柿蛋花汤，月销1.2w笔。\n火速下单后，感觉自己终于重新回归到了最广大人民群众的行列，内心十分踏实。\n\n11\n\n要说贫富差距有多大？\n在三亚，相当一部分游客，一周的开销是全国居民一年的人均收入。\n还有一部分，去免税店买个包、买块表的钱，够二三线城市的人不吃不喝工作个好几年的。\n国人全世界爆买的时候，我们都感叹国人好有钱。\n可是我们还有那么多同胞在贫困线上挣扎。\n\n12\n\n这些都是中国。我们站立的地方。",
				"added": 1519466866
			},
			{
				"comment_id": 10,
				"body": "看看银行2016年的数据：\n\n招商银行个人客户9016万户，个人金融总资产55305亿（包括存款和理财产品）。其中高级客户191万户（金葵花以上），户均资产238万；普通客户8915万户，户均资产1.1万。高级客户的户均资产是普通客户的大约220倍。大约2%最有钱的客户，占有全部金融资产的82%。\n\n工行个人客户5.30亿户，个人金融总资产12.2万亿，户均资产2.3万元。其中私人银行客户7.01万户，户均金融资产1726万元。高级客户的户均资产是普通客户的大约750倍。\n\n此外农行私人银行客户7万，户均资产1169万元；中行私人银行客户9.54万，户均资产1054万元；建行5.87万，户均资产1339万。\n\n现在大家知道为什么统计局从来只公布平均数，不公布中位数了吧，因为差太远了。",
				"added": 1519466887
			}
		],
		"1519466923_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 11,
				"body": "苏联不是美国用经济战干掉的，是自己政治系统效率低下导致的必然结果。\n\n战略上说，苏联从来都是把它的盟友当成为了自己可以牺牲的棋子。所以苏联加盟国及其盟国里面大多打从心里不喜欢苏联。这样一个联盟不能发挥所有国家的最大力量，严重制约了红色阵营的实力和潜力。（一直觊觎中国的领土）\n\n经济上投入过多资金发展军力，忽视了轻工业和农业，导致人民所需物品无法得到满足。计划经济让经济体失去了创新和活力。科研成果无法直接变现并继续支持科研。（科研转化率只有 25%，明明重工业发达但汽车工业却很萧条，品牌不多）\n\n政治系统无法选择真正的精英带领国家前进，也无法选出真正代表人民利益的领袖。前者导致战略水平不高，后者导致人民与国家的目标不一。（勃烈日列夫爱给自己颁勋章给自己贴金）\n\n军事上由于大清洗导致军队将领害怕被陷害投入监狱，不敢表达自己的意见，不求有功但求无过。（斯大林大清洗连叶若夫都被处死，赫鲁晓夫也清洗自己的反对者，西德青年甚至驾飞机降落在克里姆林宫前）\n\n反观美国，虽然也有资本家过度贪婪导致社会萧条的缺点，忽视老兵利益导致老兵游行等等问题。但是战略上英法德日都是其坚定盟友，经济上北约大幅领先华约且军费占比远低于苏联，政治上就没有过一人独大，军事上麦克阿瑟虽然和艾森豪威尔杜鲁门观点上有很大不同，虽然被解职但是还是得到善终。美国虽在很多问题上也没有做好，但是大方向上还是比苏联要正确得多。\n\n最后，再次重复：苏联解体不是外部导致的，而是内部原因。",
				"added": 1519466931
			}
		],
		"1519466994_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 12,
				"body": "在一个人心智还没有成熟之前，各种感官很容易就被外物给俘获。\n\n尤其是在上学的时候，视觉，味觉，听觉这样的感官系统，经常被他人或者外部环境给攻陷掉。\n\n所以，你可以看到很多同学整天沉迷于网络游戏，各种聊天吹水，暴饮暴食，这样的各种行为举止，给他们带来了强烈而及时的反馈。\n\n而且这种反馈，无需经过大脑的认真思考，比起没日没夜地熬夜，累得半死不活，且还不一定有产出的读书考试，要来得爽快地多。\n\n但你有没有想过，没有任何付出成本，就能轻易得到的东西，其实一点都不酷，一点都不牢靠，随时随地就能被历史的洪流，给瞬间冲垮掉。\n\n这也是我觉得，高中生抽烟喝酒，纹身买醉，到处吹水瞎扯淡，一点都不酷炫的原因。\n\n真正酷炫的人，是那些克服了重重的外部诱惑，依旧可以坚守自己心中的梦想，并且能持续性地投入精力和时间的人。\n\n很多时候，我们总是过于在意眼前即刻能够得到的反馈，却忽视了时间的力量。\n\n爱因斯坦曾经说过，复利 (Compounded Interest）是这个世界上的第八大奇迹，就是说，日复一日持续性地积累，到最后，可以产生惊艳无比的效果。\n\n这不是在开玩笑。\n\n可惜很多人就是在看似无聊的重复之中，一步步走向放弃，退出，以至于抱怨命运的不公，时间的不均等。\n\n可你有没有在你身上找找原因。\n\n自己心浮气躁，自己三天打鱼两天晒网，自己自甘堕落，自己不思进取，自己放弃了自己。\n\n既然选择了平庸，就不要有什么英雄之梦，\n\n既然甘于平凡，就经常给自己灌输生命本该如此的迷汤。\n\n每个人都是在选择自己的生活，自己走哪一条路，自己心中有个数。\n\n认准了，请你死磕，认准了，请你不要后悔。",
				"added": 1519467008
			},
			{
				"comment_id": 13,
				"body": "成绩可以赶超，心理健康却是关乎终生！这几年，我一直有做高中生、大学生的心理辅导，就从心理健康和个人成长的角度，给高中生一些忠言。\n\n1、学会面对成长之痛\n\n在高中阶段，我们极容易肯定自己，也极容易否定自己。我们能够感受到自己与从前的不同，我们对未来充满了希望，同时，我们也不知道未来具体该怎样。\n\n老师、家长，天天都在要求我们好好学习，将来考个好大学。至于考上大学后，具体会怎样，又该怎么做，很少有人给我们讲。\n\n我们对未来有憧憬，同时，也很迷茫。一方面，对父母、老师讲的道理，会有认同，同时，也会产生自己的思考，觉得他们也许并不全对。\n\n正是因为这两种思想的冲突，我们会对父母、老师产生对抗情绪。\n\n这是个人意识的一种成长，应该说是一种好的现象。只要大家能够冷静地去思考自己的想法和行为，不急着与家长、老师对抗，不害怕丢脸，采取恰当的方式表达，勇敢地说出自己的想法，就是一种了不得的成长。\n\n2、学会制定合理的学习目标，正确面对学习压力\n\n很多学生，在家庭和学校的影响下，从一开始就给自己定了很高的学习目标。虽然，高目标能够刺激我们产生学习的动力，但是，不切实际的高目标，会阻碍我们的学习，降低学习效率。\n\n目标过高和过低，对高中生来说都是一种拖累。\n\n我接待过几个有强迫行为的高中生。他们的成绩已经不错，考211，是没有问题的。但是，他们的目标很高，立志考清北。认为除了清北，其他学校即便考上了也没用。\n\n以他们的实力，考清北还是很有难度的。在这种现实和理想有很大差异的情况下，他们给了自己不必要的压力，很容易导致整个人都快感钝化。快感钝化，指的是很难感受到快乐开心。\n\n他们即使考了高分，即使被老师表扬，他们也不快乐。他们依然很担心。因为觉得自己离清北还有很大差距，高分没有用。\n\n他们产生了巨大的焦虑。以致目前都是需要服药加心理辅导，来减轻对痛苦。\n\n还有些高中生，到了大学才会出现心理问题的症状。根源都是在高中时期产生的。\n\n所以，在树立学习目标时，一定要根据自己的实际情况和学校情况，确定一个合理的目标。\n\n通俗的讲，你要选择一个你努力跳起来能够得着的桃子，然后把它摘下来。那些离你很远，即便跳再高，也摘不到的桃子，还是不要多想了。想多了，是给自己造成不必要的压力。\n\n3、要明白人际关系有时不那么重要。\n\n处于高中阶段，对于人际关系的好坏还是很在意的。希望自己鹤立鸡群，又不希望自己很不合群。自己不会把握人际交往的度，对一些同学的看法极其在意。\n\n其实完全没有必要。高中生之间的交往，更多的是以志趣相投为基础的。跟有些人就是聊得来，跟另一些人就是说不到一块去。休息的时间那么宝贵，何必浪费给自己没兴趣的同学呢。\n\n高中三年其实是很短暂的。人际关系没那么重要。你和一些同学终究会变成陌路。\n\n学会筛选你的朋友。对于那些没太多兴趣的同学，泛泛之交即可。没必要在意所有人的感受。\n\n4、把喜欢一个人转化成努力上进的动力\n\n前面那个女生的头发真好看；我一看到那个女生就觉得好开心。那个男生，好帅，好想跟他在一起哦......\n\n高中时期，枯燥的学习环境里，我们更容易情窦初开。你对一个人很有感觉，对他朝思暮想，是极有可能出现的情况。\n\n还是高中生的你，去追求喜欢的那个人，有时是会得不偿失的。\n\n因为，处于高中阶段的你，其实对感情还是很稚嫩的。再加上高压的学习环境，很容易把恋情当成泄压口。\n\n恋爱，是很high的事情，是高刺激度的事情。而学习是很枯燥，无趣的，是低刺激度的。\n\n高刺激度，和低刺激度的事情，让你选择，你肯定选择高快感的事情，本能地拒绝投入过多的精力去学习。\n\n因此，高中时期谈恋爱，大多数人的成绩都会有下降。除非你是那种天资聪颖的学霸，随便学学都能牛逼。\n\n问问你自己是不是天生的学霸，如果不是，还是把喜欢那个人的力气转化成努力上进的动力吧。\n\n记住，你来上高中，不是为了来收获一个女朋友，而是为了获取一个大学、好大学的门票的，是为了获得进入上个阶层的门票的！这些远比早恋重要。\n\n等到高考结束后，成绩有了，时间有了，再去表达情意，是皆大欢喜的事情。\n\n5、要有大局观。\n\n我上高中那会，经常有那么几个同学成天叫唤着自己没好好学，自己没好好复习。我当时真的非常讨厌他们。骗谁呢！他们比任何人都努力，好吧！\n\n他们这么说的原因，无非就是害怕别人也很努力，超过了他们。所以，故意营造出我也是在混日子，你也跟我一起混吧的假象。\n\n这样的同学，是很遭人烦的。这世上傻人不多。能跟你在一个班里上课的同学，智商差异不会太大。\n\n如果，你信了他们的话，那是要交智商税的！\n\n还有些同学，总是害怕其他同学看自己抄的笔记，自己找的资料，唯恐同学超过了自己。这样的做法，也是很蠢的。\n\n现在知识共享的途径那么多，这样的阻挡毫无意义。只会让其他同学觉得你很幼稚，很自私。\n\n要知道，高考不是只考你们一个班，一个学校的同学，而是全国性的考试。你的对手是其他学校的高中生。\n\n所以，为什么不跟自己的同学团结起来呢。大家互通有无，省心省力，效率绝对比你一个人干这件事高啊！\n\n学会跟同学建立信息共享，而不是信息独占。只有这样，才能互惠互利，大家都能取得进步。\n\n6、学习总结和反思，学习情绪管理。\n\n要准备两个记录本。第一个记录本，用来记录错题。第二记录本，用来记录自己的一些不恰当的言行。\n\n有些同学可能为了一件小事，就跟其他同学大吵大闹。有些同学，情绪就像坐过山车一样，一会高兴，一会烦躁。\n\n要知道，处于高中阶段，青春期，学习压力大，生活又很单一，情绪波动比较大是很正常的现象。\n\n把自己做得不好的地方记录下来，进行反思，想想自己为什么会情绪失控，找到失控的理由，下次，通过刻意训练，提高自己发怒的阀值。这样，对你，对同学、家人，都是件好事。\n\n\n【end】",
				"added": 1519467023
			}
		],
		"1519467107_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 14,
				"body": "说说我的朋友吧\n初中就来中国了\n中文普通话说的比一般其他有方言地方人说的都要好\n就手撕鬼子这事儿和他探讨了下\n他说“别这样儿好么，手撕鬼子，虽然我是鬼子，但是也甭给我手撕了啊，这违反常识啊，枪毙，刀砍，炮撸，我都认了，活该我们是侵略者，手撕就是你们不对了，还能愉快的玩耍么。”",
				"added": 1519467103
			}
		],
		"1519467199_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 15,
				"body": "曾国藩有一个交友原则供你参考：讲信用、无官气、有条理、少大话的人，可以结交！”    还 有一个是著名的八交九不交\n八交：胜己者；盛德者；趣味者；肯吃亏者；直言者；志趣广大者；惠在当厄者；体人者。\n九不交：志不同者；谀人者；恩怨颠倒者；全无性情者；不孝不悌者；愚人；落井下石者；德薄者；好占便宜者。",
				"added": 1519467198
			},
			{
				"comment_id": 16,
				"body": "朋友家里有一个上二年级的小朋友，一日小朋友说和xxx绝交了。问其原因，答曰~我见他打C.S，打开了队友伤害，由于一直输，没钱买枪，他竟然伤害队友，就为捡枪。跟电脑都如此，更何况人？见利忘义，背后下刀，此人，不可交。楼主点了根烟出去思考人生了。\n——————————————————————————————————————\n（今天我和我的一个朋友绝交了，TMD我最无法忍受的就是这样的人，他竟然拿着我的充电宝给他的充电宝充电。。。）",
				"added": 1519467220
			}
		],
		"1519467441_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": [
			{
				"comment_id": 17,
				"body": "对比网络上的夸人语言，前两天央视陈滢解说羽生结弦的花样滑冰男单的解说词，获得了大把好评，还火到日本去了，连日本人都表示，中华的语言真是优美啊！\n\n而中国网友表示，陈滢姐姐太会夸人了，我们平时只会说，我cao，太厉害了，牛逼啊，666。\n\n对比可见一斑……\n\n人们对于优美词句有多爱，对网络词汇就有多讨厌，都是网络词汇衬托出来的。\n\n陈滢的冬奥会原解说词：\n>“容颜如玉，身姿如松，翩若惊鸿，婉若游龙，索契冬奥会冠军在平昌周期面对四周小将们的挑战，让我想起了一句话——命运，对勇士低语：你无法抵御风暴。勇士低声回应：我就是风暴。羽生结弦，一位不待扬鞭自奋蹄的选手。他取得今天的成就，值得全场观众全体起立鼓掌的回应”。\n\n英文的引用原文是：\n>Fate whispers to the warrior\n>“You cannot withstand the storm”\n>and the warrior whispers back\n>“I am the storm.”\n\n网络语言会怎么夸：\n\n>太厉害了！\n\n>我曹，牛逼哄哄！\n\n>厉害的不要不要的\n\n>简直是使出了洪荒之力！\n\n>一言不合就放大招\n\n>就问你们服不服？！\n\n>wuli小鲜肉有颜有实力\n\n>可以，这很XXX！\n\n>我哈牛太撩啦\n\n咱们再看看陈滢姐姐短短的解说词，包含了古文引用（洛神赋）、英文翻译引用、比喻等手法，比起只会用网络语说666的夸法，感觉是不是完全不一样？瞬间层次感就出来了！",
				"added": 1519467586
			},
			{
				"comment_id": 18,
				"body": "举个例子，就说说“德国骨科”吧。\n\n不懂的自己先去查一下这个“事”，然后我会告诉你，这个“梗”现在经常是用作表示“兄妹不伦恋”的。\n\n虽然说，这个梗源于一个“好像有点搞笑”的故事，但我觉得使用起来还是稍微严肃点的好，毕竟是触及到了那种不被伦理、道德所接受的感情。\n\n我是觉得，既然是不伦“恋”，那这个词应该用在兄妹双方都对另一方抱有超越亲情的感情时使用。\n\n近几年，因为吃瓜的机会多了，这类事件大家也听得多了，这种禁断之恋好像慢慢的就被一部分人所“接受”了似的，甚至还有些人表达出了“推崇”之意。\n\n我知道现在一些创作里会加点骨科的元素，也有很多人喜欢骨科CP，这个我无所谓。我要说的这些事都是放在现实背景下的，麻烦注意一下。\n\n现实里这类事出现的再多，也不表示能明着拿到面上来“宣传”，更不代表这能用来随便跟人开玩笑。\n\n偏偏有些人，就老喜欢在别人重点讲亲情的时候拿出来用，相当恶心人。\n\n————————\n\n在知乎上看到过几个答案，评论里都出现过这个词。\n\n答主A，有一个和他年纪差了很多的妹妹，幼女的年纪，但是妹妹很可爱很乖，没有想象中的那么熊，于是这位哥哥就很宠自己的妹妹。\n\n评论区里某几个回复：德国骨科了解一下。\n\n幼女，看到没？真特么亏你想得出来，估计和那帮玩坏“三年起步，最高死刑”一路的。\n\n————————\n\n答主B，有个叛逆期的妹妹，还有个令人嫉妒的女神女友。见家长的时候，妹妹和女友很不对头，妹妹不停攻击女友。答主就感慨了一下，以前妹妹很乖巧的，现在怎么脾气变这么差了。然后回忆了一下儿时的事情，满是亲情可贵。\n\n评论区前排：德国骨科！你妹妹肯定是喜欢你，怕你女友把你抢走。\n\n答主：你想多了，我和我妹现在关系也不好了，而且她也只能是我妹妹。\n\n————————\n\n答主C，妹妹被渣男甩了，正为感情的事伤心流泪。当哥哥的岂能坐视不管？！于是他教训了一下渣男。\n\n评论：德国骨科！这就是爱情啊！\n\n————————\n\n别人在讲亲情的时候，某些人脑子里只有乱伦乱伦乱伦。\n\n上面这几个例子里的答主，是有表达对这个词的不满的，但是架不住某些人爱玩梗的心啊。\n\n“德国骨科”就是他们“喜闻乐见”的东西。\n\n当然，有些人在玩梗的时候，或许也并没有多想，也不代表他们自己本身有这种倾向。\n\n但是啊，梗玩得不合时宜，恶心到别人就是你的不对了。\n\n————————\n\n哦，还看到过一个情况。\n\n答主D，小时候被亲哥多次性侵，非常恶心这个亲哥，巴不得他当场暴毙。\n\n评论里一句：哇，德国骨科。\n\n也不知道这位朋友是以怎样的态度回复的，但匿名答主不爽了，回他：德你个大头鬼！\n\n评论君：玩个梗而已，不要生气。\n\n匿名答主还能怎么办，千言万语只能汇成一句：nmb，你真恶心。\n\n我记得“德国骨科”还是个有点。。。CP意味的词，嗯。。。\n\n我不清楚当时匿名答主详细是什么心情，但我看到那个回复的时候，甚至还感觉这话就像是一个局外人在对一个被强奸的人说：“哇！你跟那个强奸你的人在一起吧！”\n\n————————\n\n感觉很多网络用词，刚出来的时候，大家都使用得比较谨慎，对于懂的人来说，也是一种小惊喜。\n\n玩梗有个我觉得挺有趣的地方，就是梗和某件事之间存在着些许联系、甚至有些相似，这时候玩起来就会很有意思。\n\n一旦“流行”起来，就会被过分滥用，出现得防不胜防，使用得越来越不合时宜，甚至有些还偏离了本意，好像只要有一点相似，就可以玩梗。\n\n这就越来越没意思了。\n\n而且有些梗，本来意思就不是特别好，变成梗只是为了表达的隐晦一些。流行起来后，就会变成一种“喜闻乐见”，可并不是大众都能接受这个梗。\n\n这时候，被反感，简直再正常不过了。\n\n————————\n\n说：别人跟你玩梗，只是开了个玩笑，答主你别太严肃的。\n\n那我再举个例子吧。\n\n假如你那交往八年，年底准备结婚的女朋友出轨了，就给你留了一顶绿帽子。\n\n你心里很不是滋味，甚至想过要死。\n\n这时候，我过来，调侃一句：“当然是选择原谅她啦！”\n\n我嘴上是这么说，但我只是在玩梗，我对你和你女朋友之后的发展，毫无兴趣。我甚至都没在可怜你，反正不是我女友，我就只想玩梗。\n\n你听出我那种只为凑热闹的心情，从而散发出了不愉快的气息，还忍不住咬牙切齿起来。\n\n可我只是想玩梗啊！只好连忙解释：“我跟你玩梗呢！只是开了个玩笑，你别太严肃啊。”\n\n问：你此时的心理阴影面积有多大？\n\n——————————\n\n我也没说都是梗的错啊，虽说一些梗看起来都不该出现在大众的视野里，只应该存于小众，但梗的出现和传播都是人的事。\n\n这些梗被反感，自然是人的错多一点。\n\n——————————\n![](https://wx4.sinaimg.cn/wap720/005ulUN1ly1fi4dcsbvorj318g0qon04.jpg =100x100)\n\n\n妈诶，回头一看感觉话有些串了，感觉废话也挺多的。\n\n另外，还是推荐大家去看看别的几个高赞回答，我觉得他们说得也很有道理，也在很认真的分析。\n\n我这就随便聊聊，拿这么赞有点慌。",
				"added": 1519467633
			}
		],
		"1520240999_15vxijofrLcqnmh8RSbxTtbW9ZTfzy57TU": [
			{
				"comment_id": 19,
				"body": "不错，可以 建立一个海盗湾了",
				"added": 1520315320
			}
		],
		"1518773623_1Ddehzu7BzcL9bKYbNQX8TPcFqZHiid9GH": [
			{
				"comment_id": 20,
				"body": "site.json文件",
				"added": 1520315370
			}
		],
		"1517805548_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 21,
				"body": "叼",
				"added": 1520315390
			}
		]
	},
	"comment_vote": {
		"12_12Gb53nqheikBUrZqSWS7h8f6D2xBXSpjn": 1
	}
}