{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 8,
	"comment": {
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 1,
				"body": "> [scotcyguy2](#comment_78_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): I DON'T CARE ANYMORE [...]\n\nI agree completely! We are living on a prison planet, being held captive by a disease that doesn't kill 99% of people, and the people who are dying of it keep dying of it, no matter what is done.  Please don't kill old people.  They are old and they will die of the flu.",
				"added": 1614032129
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 2,
				"body": "It sounds like a bad idea.  Sure, I don't watch those underqualified news anchors, but either way, creating a kill list is not a good.  If anything, we should engage them in the free exercise of debate, not murder.  Minds will not change if people are killed because of the script they are given to read.  Understand the people who write the stories as CNN are not the same people as the eye candy they have on camera.  Even the writers are told what to write by management, which is dictated by the DNC and other left wing extreme organizations in the propaganda machine.",
				"added": 1615238983
			},
			{
				"comment_id": 4,
				"body": "The best thing you can do is cut the cord.  Paying for cable is the #1 way they make money.  Stop watching the crap CNN shovels out and they will not be funded.  By pouring any sort of attention on them as individuals will only make them a victim.",
				"added": 1615404497
			}
		],
		"1614910002_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 3,
				"body": "Have you had children yet?  I would be interested in seeing if you are able to produce offspring after the vaccine.  The Roman Catholic Church in many parts of the world is telling people not to taking for 2 reasons: A) use of aborted children in making the vaccine, B) Possible sterilization.   I don't know what is true, but I'm personally going to wait and see what happens.   I'm in an age group which statistically never dies from COVID19.",
				"added": 1615239253
			}
		],
		"1615441502_1MjYP6RTszD3YQWphEM1tBu8a4d3TaQLjC": [
			{
				"comment_id": 5,
				"body": "I took 6kmg this morning, that seemed to be a lot.. but 30gr...  what?",
				"added": 1615499955
			}
		],
		"1615519854_114GEWEupBzXfggqZEZCXcpYw9Cdg7f9bi": [
			{
				"comment_id": 6,
				"body": "Wow, All my guns just got sank to the bottom of a very deep lake when I was out fishing...  what bad luck!",
				"added": 1615521524
			},
			{
				"comment_id": 7,
				"body": "Wow, All my guns just got sank to the bottom of a very deep lake when I was out fishing...  what bad luck!",
				"added": 1615521553
			}
		]
	},
	"comment_vote": {
		"60_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": 1,
		"78_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"4_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": 1,
		"28_16sZ53MFsJNXQGth1LUAPgbsR9K2ZtYNW2": 1,
		"3008_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}