{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1,
			"title": "Nuevo navegador BEAKER, alojamiento web y red 2P2.",
			"body": "No lo he probado todavía, pero puedes tener web propia como en ZeroNet y compartir el link con tus amigos. Por supuesto es una red 2P2 no abierta a internet.\n(Peligro, link externo) http:///////beakerbrowser.com",
			"added": 1556366972
		},
		{
			"topic_id": 2,
			"title": "Notre Dame de Paris",
			"body": "Hay diferentes teorías para explicar El incendio de Notre Dame de Paris, pero lo que yo he visto es que a madera que ardió no era de roble sino de pino. El roble arde muy lentamente pero la madera de pino arde muy rápidamente.\nCreo que hubo un fraude la última vez que cambiaron las vigas del tejado (año?), vendieron al arzobispado de Paris madera de pino a precio de madera de roble mucho más cara. Los investigadores del incendio ya  habrán descubierto pino en los restos quemados pero el gobierno francés se niega tajantemente a decir la verdad a la gente por el miedo a que Francia sea ridiculizada en el mundo entero.\nEn la grande y majestuosa Francia también hubo y hay estafas; Macrom guarda silencio.",
			"added": 1558099752
		},
		{
			"topic_id": 3,
			"title": "Consejos para luchar contra el coronavirus.",
			"body": "Sin ánimo de asustar a la peña creo necesario empezar a prepararnos ante la llegada de la nueva enfermedad. Quiero enfatizar sobre la necesidad de hacer acopio de alimentos y agua, también de medicinas, papel.\nCreo que también debemos cuidar de nuestra salud y aumentar el nivel de nuestras defensas.\nSi os soy sincero, no creo en el gobierno ni en los médicos, puede estar en marcha una conspiración para liquidar a un montón de gente especialmente jubilados.\nEspero aportaciones de ideas y consejos.",
			"added": 1582378624
		},
		{
			"topic_id": 4,
			"title": "España estado parapolicial.",
			"body": "He perdido mis derechos, no puedo dar un paseo, no puedo viajar, la gente me mira con cara rara como si yo fuese un apestado, el gobierno me persigue por mis opiniones, la policia me controla cuando salgo a la calle. Este gran país se desmorona por momentos y la gente sigue aplaudiendo a las 20:00 en punto como si todo esto les pusiera cachondos; yo nunca he salido a la ventana, me niego a participar  en este engaño.\nHe vivido por décadas en España y nunca he visto que esto fuese una democracia abierta y libre, sino una ocultación diseñada para anestesiar a nuestro pueblo; todo perfectamente llevado a cabo por los medios de información que nos venden la moto que este gobierno lo está haciendo muy bien, ¿lo creeis de verdad?, yo no.\nVa siendo hora de despertarnos especialmente en esta red ZeroNet. Está bien el 2p2, fotos, pelis,  pero necesitamos hablar también con perspectiva de futuro porque nuestra querida España se lo está jugando.",
			"added": 1587211531
		}
	],
	"topic_vote": {},
	"next_comment_id": 19,
	"comment": {
		"1_1KjKGbXe5KwQkmHdtsyhp1TzRieGu3wPBw": [
			{
				"comment_id": 1,
				"body": "En España se silencia bastante las noticias dramáticas de Venezuela. Me enteré de ello estando de visita en Oporto (Portugal), paré en una cafetería a beber un café y quedé sorprendido al ver el despliegue de medios de la tv portuguesa para seguir el éxodo de refugiados venezuelanos hacia los países vecinos.",
				"added": 1543522397
			}
		],
		"2_1PWTu9NnYyjJy5NsqnFt2NvwhQZPSyRV1h": [
			{
				"comment_id": 2,
				"body": "Publicitarlo en los centros de enseñanza; de ESO para arriba; hablar a los amiguetes  y convencerles de las bondades del anonimato usando nuestro dominio @zeroid.",
				"added": 1545342629
			}
		],
		"1_1PD6ADNcGcQkAvVL9dcZVUTMwWSLmDFGmc": [
			{
				"comment_id": 3,
				"body": "Estupendo, aplausos por la iniciativa, debemos crear contenido en lengua española.",
				"added": 1556650971
			}
		],
		"1_12GKd5hKKNsTyxWqE3arbSurnbq6Ek8spk": [
			{
				"comment_id": 4,
				"body": "Estoy de acuerdo contigo. Tiene demasiados fallos y creo que hay poca gente trabajando en su desarrollo; me he acostumbrado a tener copias de seguridad por si acaso. \nUna simples página web puede ser una pesadilla. Te animo a seguir adelante con la esperanza que esto mejore.",
				"added": 1577709525
			}
		],
		"1_1L7SFNiRnmmUycszkjdAc8S9Wt8FjdWPqg": [
			{
				"comment_id": 5,
				"body": "El problema reside en el brutal control mental que la población española y también del mundo están siendo sometidos, solo observo gente en bares y terrazas bebiendo su cervesita o café, pensando en el futbol y en el próximo viaje de vacaciones, verdadera furia hispana.\nTe está pasando lo mismo que a mi, nos escapamos de la \"programación\" y vemos el mundo real y eso es muy doloroso. Solo podemos adaptarnos a esa situación y seguir luchando por ser mejores dia a dia.\nPero ten en cuenta que ésto en cualquier momento va a dar un viraje alucinante y todo cambiará, tú estarás preparado, la mayoria de ellos.",
				"added": 1577710066
			},
			{
				"comment_id": 12,
				"body": "Homenaje laico a las víctimas de la pandemia, no habeis visto la configuración ojo de Horus con el pebetero en el centro. Lo reyes y demás autoridades rindiendo tributo y adoración a los demonios.",
				"added": 1595182144
			}
		],
		"1_1AAt12Xq7AmHr6VzxjUfsb2FBiLfrHGD5Y": [
			{
				"comment_id": 6,
				"body": "Pregunta a un psicoterapeuta, él te ayudará.",
				"added": 1577710309
			}
		],
		"1_1L4Ev3e99ZaMRqaTPUc5ZwHkWa62oGuFUU": [
			{
				"comment_id": 7,
				"body": "Dacia muy mal. KIA va mejor  y SKODA pese a ser buena marca le pasa como al resto del grupo VAG les gusta putear a los clientes.",
				"added": 1577710454
			}
		],
		"1_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": [
			{
				"comment_id": 8,
				"body": "Lengua interesante, sería positivo la creación de un tutorial aprendizaje en ZeroNet.\nTambién sería posible crear un zerotalk esperanto y hasta lograr la traducción de la interfaz.\nSaludos.",
				"added": 1580668759
			}
		],
		"1_14Zkn3U1zMYVvFqV2PaoJEwiELxuq4mZDj": [
			{
				"comment_id": 9,
				"body": "La última entrega de Terminator es feminazismo a tope y descarado.",
				"added": 1580669072
			}
		],
		"1_1PC9v6PXWN9ec4XaBAHRGET679siEEqFUN": [
			{
				"comment_id": 10,
				"body": "Creo que hay un plan deliberado por una élite  y llego a pensar que hay una guerra abierta entre grupos mafiosos. \nTodo indica que hemos entrado en la última temporada que va a ser trepidante y angustiosa pero al final esos demonios y sus adoradores serán barridos por siempre.\nSolo puedo daros ánimos ante la lucha que viene.",
				"added": 1584643014
			}
		],
		"1_19hw8FDJj865AZrvoyhAgMpy58ezhcJBPL": [
			{
				"comment_id": 11,
				"body": "Aguantando como sea este encarcelamiento. Deberiamos dar una patada a este maldito gobierno y por supuesto también a la incompetente oposición.\nÁnimo que vendrán tiempos mejores.",
				"added": 1587210643
			}
		],
		"1_15eTuvZsi1KYGhCNC9ye8zgZMXNBZ1Na42": [
			{
				"comment_id": 13,
				"body": "Yo diría que sí, he encontrado ambiente relajado y hasta saludable, nada que ver con la deep web.\nPero creo que deberiamos ser un poco más cabrones, jajajajajjaja.",
				"added": 1604175033
			}
		],
		"1_1KEsCNSboxPFpP73TVu6XtpFLYv86jnQFj": [
			{
				"comment_id": 14,
				"body": "Ah como las que empleaba la Brigada Roja y el IRA. Pólvora prensada, pero en serio no lo consultes en la web porque de lo contrario quedarás fichado. Usa el navegador TOR y entra en la Deep Web, hay un buscador Tor Search      http://xmh57jrknzkhv6y3ls3ubitzfqnkrwxhopf5aygthi7d6rplyvk3noyd.onion/cgi-bin/omega/omega\nPero ten cuidado esas cosas son muy peligrosas e ilegales aunque sería razonable tener el conocimiento por si estalla una guerra y nos invaden, así actuaríamos como una resistencia más eficiente y letal. \nSaludos.",
				"added": 1607632773
			}
		],
		"2_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 15,
				"body": "En serio, mejor lárgate de aquí para no ensuciar la buena imagen y buen hacer de mis colegas ZERo.",
				"added": 1611576900
			}
		],
		"1_1ADFcv5XufTv9PXUVnKwyEcGGJtHoDkwrH": [
			{
				"comment_id": 16,
				"body": "Lárgate de aquí. no queremos esa clase de basura.",
				"added": 1611577125
			}
		],
		"1_12z9hJGgqrxjh84STcyS4kN4mKVpQJtoU9": [
			{
				"comment_id": 17,
				"body": "Ahora seremos competencia de la DEEP WEB. Cuidado o estaremos bajo el radar del FBI.",
				"added": 1611583278
			}
		],
		"1_1NsZw8qjhYkYLMrJwT9vbha5VVJZQDC9X6": [
			{
				"comment_id": 18,
				"body": "No es un caso aislado, en Alemania y China ya lo hacen, y en Palermo quieren internar a los niños.",
				"added": 1611583401
			}
		]
	},
	"comment_vote": {}
}