{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1555521255,
			"title": "Where to put CBZ files?",
			"body": "I'm currently trying to put some CBZ (zipped jpegs, usually scanned comics) files, but neither IFS nor ZeroUp would let me. The former doesn't allow the extension at all, while the latter only allows files bigger than 10MB - and mine is below that.\n\nWhere should such files be hosted on Zeronet?",
			"added": 1555521254
		}
	],
	"topic_vote": {
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1555521255_1ME9gwj9Exp9cBbuSxxr1mEiySEjmXNA2w": [
			{
				"comment_id": 1,
				"body": "Thank both of you. I'll think about it.",
				"added": 1555528933
			},
			{
				"comment_id": 2,
				"body": "I have a plan. Stay tuned.",
				"added": 1555534127
			},
			{
				"comment_id": 3,
				"body": "Ok, I finally found time to put up something. Little more than a demo, right now. But it's work-ish.\n\nhttp://127.0.0.1:43110/1ZBULLEquJGBAUeRurdg9iXnXsDYQVE4y/",
				"added": 1558072548
			}
		],
		"1558099954_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV": [
			{
				"comment_id": 4,
				"body": "> [upnet](#comment_13_1H8YqnwyoceTwJuGpy6nh3PDkwwii5kYuV): I have experience with the 2 types of woods. This is science, the speed of the fire advancing coincides with the pine wood; With the oak wood I reckon it would take more than 12 hours to burn completely and it would be easy for firefighters to work.\n\nOak wood burns rather efficiently (compared to pine), with a lot more heat (and less light). If you try to burn oak in your backyard, it'll take ages. Myself, I did try to burn an old oaken beam, and after a couple hours of merely smoking it, I let it go.\n\nHere, we're talking of hundreds of such beams, organized in a perfect mix of air and wood. If a burning cigarette gets stuck at the junction of two beams, it could slowly build enough heat to actually ignite the wood. Then, slowly but surely, the whole attic's atmosphere will be hot enough to sustain any fire, as long as there's something left to burn.",
				"added": 1558124846
			}
		]
	},
	"comment_vote": {
		"15_1KF9Use5ra6M9xPq8e53TmVTLB6TdEMZdr": 1
	}
}