{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1598511160,
			"title": "Donald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely.",
			"body": "This is long test post..\nIf he’s NOT prudent enough about his personal relationship with Dictator Xi.\nWith the Special Tactic by the White House , the Propaganda War will be waged by the USA in a very graceful and polite way.\n\nWith the bona fide clarification that\nDonald Trump's respect for CCP leader Xi Jin Ping is mainly triggered by the glorious honor of Xi Jin Ping's father Mr Xi Zhong Xun, who fought bravely against the oppression in the Cultural Revolution, and made great contribution to the Reform and Opening revolution in the 1980's.\nTo keep the Reform and Opening policy will help keep better transparency, and fight better against the Coronavirus. It complies with the glorious history of Xi's family legacy. It deserves nationwide support by the whole Chinese nation.\nThe Global Coronavirus needs global efforts by all countries on the planet. For the emergence of a new civilization, Donald Trump may resume communication with President Xi when necessary.\n\n(The bilingual version will be more powerful, details of which are in below URL:\nhttp://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/?Topic:1_1DXZmTjSE5xjmyx2NiH3jpbKQ3UTCuu9gY/A+Special+Tactic+by+the+White+House )\n\nIt’d help Donald Trump revert the negative influence that damages Trump’s president image due to inappropriate self-boasting of his personal friendship with a vicious dictator.\nIf there’s anything for Donald Trump to apologize, then the White House can make further apologies by stating that\nJust like the mistaken judgement by some Second-generation Red Aristocrats, it’s really unimaginable that the glorious honor of Xi Jin Ping's family legacy left by his father Xi Zhong Xun could be so brutally destroyed!!\nIn order to remediate the severe situation, the White House appeals righteous people all over the world, including\n\nChinese people, Chinese army, and those grassroots CCP members who still admire Xi Zhong Xun’s bravery in fighting against dictatorship,\nto stand up together, restore Constitutional Democracy in China, which was promised and pursued by the first-generation Red Aristocrats, many of whom respect Xi Zhong Xun’s special efforts in fighting against the Cultural Destruction!!\n\nThe above will be enough to launch a special Propaganda War, which will accelerate the collapse of the Atheism Gang of the FAKE CCP.",
			"added": 1598511159
		},
		{
			"topic_id": 1598805501,
			"title": "Feature Requests",
			"body": "Post Your Feature Requests here....",
			"added": 1598805499,
			"type": "group"
		},
		{
			"topic_id": 1598805596,
			"title": "Move Topic to Specific Group.",
			"body": "Add an ability to move posted topic to specific group.",
			"added": 1598805593,
			"parent_topic_uri": "1598805501_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71"
		}
	],
	"topic_vote": {},
	"next_comment_id": 5,
	"comment": {
		"1598511160_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 1,
				"body": "On Mobile Devices, Links displayed out of bounds. see the above link in post for example.",
				"added": 1598511346
			}
		],
		"1549373688_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": [
			{
				"comment_id": 2,
				"body": "Feature Request  : Add Post Last Updated Time Stamp..",
				"added": 1598512000,
				"modified": 1598582867
			},
			{
				"comment_id": 3,
				"body": "Which files i have to override to use it over ZeroTalk.",
				"added": 1598692496
			},
			{
				"comment_id": 4,
				"body": "Bug : Creating New Group makes it New Topic also, which is visible in HelloZeroNet Page.",
				"added": 1598699357,
				"modified": 1599027804
			}
		]
	},
	"comment_vote": {}
}