{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1540326324,
			"title": "Сомали",
			"body": "**Сомали** - одна из немногих стран, которая, фактически, анархична. Это интересный пример государства без центрального правительства. И, относительно других стран Африки, не всё там так уж и плохо. Правительство коррумпированно совсем и является нищим. Поэтому население Сомали живёт даже лучше без правительства чем соседние страны.\nНесколько раз в Сомали пытались ввести власть. Пыталась США, но *священная демократия* не смогла. Пыталась Эфиопия, тоже провал. При каждой попытке население давала отпор.\nГражданская война разрушила всю инфраструктуру, а также часть Сомали стала называться \"Сомалилендом\". Сомалиленд обзавелась демократией, выборами, медициной, образованием, армией, полицией, социальными институтами... но не обзавелось призвания официального государства. В то время как в Сомали на данный момент анархия, безвластие, пиратство, гражданская война, треш, угар и ад, она всё же имеет титул официального государства.\n\nСомали имеет более продолжительный срок жизни, нежели её соседи. Сеть подключают за считанные часы.",
			"added": 1540326323
		},
		{
			"topic_id": 1541101117,
			"title": "OneWeb",
			"body": "OneWeb — глобальный спутниковый Интернет, который разрабатывают в Британии. Идея заключается в том, чтобы Сеть была доступна во всех уголках Земли совершенно бесплатно. Такой проект не новый, похожая идея есть у SpaceX. Но в отличии от Илона, OneWeb уже доступен. Кроме РФ. ФСБ уверено, что такими темпами Британия с США будут контролировать жизнь всех россиян, в том числе и политиков, в Сети. Сам OneWeb не заблокировать, так как это всё-таки сотни спутников, но зато можно просто запретить их сим-карты.\nКак я думаю, ФСБ в чём-то правы, OneWeb в любом случае будет подсматривать. Но.. какой спутник сейчас не мониторит и не ведет бигдаты?",
			"added": 1541101115
		}
	],
	"topic_vote": {},
	"next_comment_id": 3,
	"comment": {
		"1540059449_1GuMwrY73dDra7CzWWTNpVL9d6PVGb31E1": [
			{
				"comment_id": 1,
				"body": "Так, ну во-первых - Windows всегда, как бы ты ухитрялся, будет за тобой следить. Ни отключения в настройках, ни удаление приложений, ни накатывания специального софта не спасут тебя даже на 50%. Она проприетарна и несвободна, это во-вторых. Ну и, раз уж не хочешь перелезать на свободные и открытые операционные системы (но, например, на Ubuntu/Mint перелезания с венды не чувствуется вообще), давай помогу с вопросами:\n1) nCore Windows, ящитаю. А еще лучше XP, она классная, именно ее я ставлю в виртуалку, если захочется в игры поиграть. И да - не подключайся к Сети. Вообще. Имей ноутбук/одноплатник с GNU-системой, оттуда скачивай программы и тому подобное. Диск в ноутбуке/одноплатнике ежедневно форматируй.\n2) Хз, не разбираюсь в вендовом софте для удаления зондов.\n2.1) Какой-нибудь Pale Moon / IceCat отлично сгодится. Второй не знаю, есть ли под венду, но первый уж точно должен быть.\n2.2) Не ставить Origin/Steam/Xbox? У меня лишь стим стоит.\n2.3) Хз.\n2.4) (Я, например). Whatsapp лучше не использовать. Skype тоже.\n2.5) Удалить их? Хз.\nПослушай, ты хочешь анонимности там, где ее быть *не должно* вообще. Ты хочешь анонимности, используя Origin, Skype, WhatsApp. Это невозможно.",
				"added": 1540062767
			},
			{
				"comment_id": 2,
				"body": "> [dude](#comment_1_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): с отключенными обновами (и ручным накатом только важных хотфиксов) никакое шпионство туда не пролезет\n\nlol",
				"added": 1540325186
			}
		]
	},
	"comment_vote": {}
}