{
	"title": "La Bitácora del Diletante",
	"description": "Una bitácora sobre mis avances, aficiones y descubrimientos.",
	"links": "[Índice de Temas](http://127.0.0.1:43110/1828j6WAbwDy7SWhFfrRZDp5qy2sZCmN55/?Post:4:%C3%8Dndice+de+temas)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1566848544,
	"post": [
		{
			"post_id": 5,
			"title": "Probando alternativas libres a redes sociales",
			"date_published": 1566848498.119,
			"body": "Los descubrimientos han sido:\n\nPeertube: Un Youtube federado que funciona con tecnología peer to peer para agilizar la descarga de video. Es un poco técnico el crearse una cuenta y entender su funcionamiento y falta algo de contenido pero tiene buen prospecto. Cuenta con una app no oficial para Android que está en un desarrollo temprano por lo que no deja loguearse.\n\nBitchute: Es un clon Youtube un poco menos técnico que el anterior además de contar con poco más de contenido, no me genera confianza el que toda la información se concentre en un solo servidor y este tienda a crecer de la misma manera que Youtube pero creo que eso también va a ser una ventaja a la hora de su adopción. Cuenta con una app oficial en vías de desarrollo para Android que no permite loguearse todavía.\n\nMastodon: Es como una especie de Twitter, también federado y algo técnico lastimosamente, que permite escribir hasta de 500 caracteres. Tiene un buen desempeño y parece tener una comunidad floreciente aunque tiene un tipo de público mayoritariamente geeky por ahora. Tiene un cliente que para Android llamado Tusky. Me gusta su diseño y desempeño, es bastante sólida.\n\nDiáspora: Básicamente es un Facebook fededaro y técnico (creo que es un mal de las herramientas libres el que requieran un uso responsable por parte de sus usuarios). No tiene límite de caracteres, permite realizar la mayoría de las cosas que se pueden hacer en Facebook. Su desarrollo está en etapa avanzada y es sólido. Su cliente web es cumplidor aunque se basa básicamente en un web browser que carga la versión para móviles de diáspora (eso es un poco cutresillo).\n\nTelegram: Es una alternativa sólida a WhatsApp, permite hacer muchas cosas que hace WhatsApp incluso mejor. Le hace falta las videollamadas pero el resto de cosas funciona de maravilla. Los grupos son la característica más notable de este cliente de mensajería instantánea.\n\nMenciones especiales:\n\nAntox: Cliente de mensajeFriend to Friend para android con un enfoque altamente especializado en la privacidad. No es para todo el mundo pero si necesita comunicación realmente privada este es el cliente.\n\nZeronet: Es una capa de software que permite interconectar a varios computadores a una red descentralizada y sin servidores (Lo cuál se supone era el espíritu de la Internet en sus primero tiempos). Esta red ha dado tres importantes alternativas de servicio a las redes sociales y las cuáles son:\n\n*   ZeroMe: Un Twitter para ZeroNet muy bueno y sin ninguno de los vicios del Twitter tradicional como los son el estar basado en el número de seguidores, la censura y el límite de caracteres.\n\n*   ZeroTalk: Es como un Reddit (foro) para Zeronet. Es un foro simple basado en texto.\n\n*   KopyKate: Es un Youtube para ZeroNet. En teoría tiene todo lo que se espera de un Youtube pero; al parecer, el modelo Youtube no termina de encajar en un entorno tan volátil como lo es ZeroNet, en el que la información no se guarda en un solo punto y cualquier persona pueda, por simplemente aburrimiento, desaparecer."
		},
		{
			"post_id": 4,
			"title": "Índice de temas",
			"date_published": 1556207107.784,
			"body": "## ZeroNet\n\n[¿Cómo firmar mi sitio clonado?](http://127.0.0.1:43110/1828j6WAbwDy7SWhFfrRZDp5qy2sZCmN55/?Post:3:%C2%BFC%C3%B3mo+firmar+mi+sitio+clonado+)"
		},
		{
			"post_id": 3,
			"title": "¿Cómo firmar mi sitio clonado?",
			"date_published": 1556158582.439,
			"body": "Esta sola cosita sin resolver hizo que perdiera mi anterior blog. Ahora que lo sé espero que a nadie más le pase.\n\nLuego de que hayas clonado un zite, por ejemplo este ZeroBlog, debes irte a la carpeta `ZeroBundle/ZeroNet/data` y allí abrir el archivo `users.json`. Si eres la única persona que publica en este blog copia el users.json en el otro computador, en la misma carpeta `ZeroBundle/ZeroNet/data`, ántes de continuar con este proceso. A continuación, en tu editor de texto, haz una búsqueda usando la dirección de tu zite, en mi caso, la dirección de mi zite es `1828j6WAbwDy7SWhFfrRZDp5qy2sZCmN55` pero puedes encontrar la dirección de tu página en la barra de direcciones del navegador: `http://127.0.0.1:43110/1828j6WAbwDy7SWhFfrRZDp5qy2sZCmN55/?Home`\n\n```\n\"1828j6WAbwDy7SWhFfrRZDp5qy2sZCmN55\": {\n        \"auth_address\": \"...\",\n        \"auth_privatekey\": \"...\",\n        \"cert\": \"zeroid.bit\",\n        \"follow\": {\n          \"Publicaciones\": [\n            \"SELECT post_id AS event_uri, 'post' AS type, date_published AS date_added, title AS title, body AS body, '?Post:' || post_id AS url FROM post\",\n            [\n              \"\"\n            ]\n          ],\n          \"Username mentions\": [\n            \"SELECT 'mention' AS type, date_added, post.title AS title, keyvalue.value || ': ' || comment.body AS body, '?Post:' || comment.post_id || '#Comments' AS url FROM comment LEFT JOIN json USING (json_id) LEFT JOIN json AS json_content ON (json_content.directory = json.directory AND json_content.file_name='content.json') LEFT JOIN keyvalue ON (keyvalue.json_id = json_content.json_id AND key = 'cert_user_id') LEFT JOIN post ON (comment.post_id = post.post_id) WHERE comment.body LIKE '%[rcastanonz%' OR comment.body LIKE '%@rcastanonz%'\",\n            [\n              \"\"\n            ]\n          ]\n        },\n        \"privatekey\": \"aquí_se_encuentra_la_clave_que_debes_copiar\"\n      },\n```\n\n`ZeroBundle/ZeroNet/data/users.json`\n\nLa lleva privada que debes que usar es `\"privatekey\"`, **NO USES** `\"auth_privatekey\"`; copia solo el valor de la llave de `\"privatekey\"`.\n\nUna vez hallas copiado la llave, ve a tu zite recién clonado y jala hacia la izquierda el símbolo de ZeroNet que se encuentra en la parte superior derecha de la pantalla. Baja y busca dónde diga **Este es mi sitio**, activa la opción y sigue bajando hasta que encuentres la opción **Publicación del contenido**. Hay un botón que dice **Sign and Publish**, presiónalo y te aparecerá un cuadro en la parte superior en la que tendrás que pegar la clave que acabaste de copiar, presiona \"Sign\" y tu sitio quedará listo y firmado en este computador."
		},
		{
			"post_id": 2,
			"title": "Otro intento más",
			"date_published": 1556156413.507,
			"body": "Este es mi segundo intento de tener un blog decente sobre mis temas de interés ya que perdí mi antiguo blog hace ya algún tiempo.\n\nEl motivo que me vuelve a traer a hacer otro blog no es más que la facultad de poder aprender enseñando y llevar una bitácora de mis actividades, gustos y aprendizajes.\n\nIntentaré ser mas cuidadoso con este nuevo espacio, no lo quiero perder de nuevo."
		}
	]
}