{
	"next_comment_id": 12,
	"user_name": "Nekololi",
	"hub": "1oranGeS2xsKZ4jVsu9SVttzgkYXu4k9v",
	"post_like": {
		"1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7_1539008599": 1539037198,
		"153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k_1548067460": 1548080897
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "can i pay you to say that to me on a daily basis?",
			"post_uri": "1DU9tPfvPkYGX8NQDicBbNDDWUknibHwBT_1489277558",
			"date_added": 1489278070
		},
		{
			"comment_id": 2,
			"body": "i wonder what's so unsafe about my browser though. scary warning is scary.",
			"post_uri": "18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ_1489466676",
			"date_added": 1489509801
		},
		{
			"comment_id": 3,
			"body": "i think request policy is blocking those requests for me. if it isn't, the null proxy i set does.",
			"post_uri": "18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ_1489466676",
			"date_added": 1489510437
		},
		{
			"comment_id": 4,
			"body": "i imagine down the road you'd like to bundle a preconfigured browser with zeronet that can be considered safe for the majority of users who wish to use zeronet with tor?",
			"post_uri": "18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ_1489466676",
			"date_added": 1489510601
		},
		{
			"comment_id": 5,
			"body": "@Jayofthezero: why bundle tor with zerome at all then if they already have tor.exe which comes with tbb?",
			"post_uri": "18DbeZgtVCcLghmtzvg4Uv8uRQAwR8wnDQ_1489466676",
			"date_added": 1489511170
		},
		{
			"comment_id": 6,
			"body": "@Daniell Mesquita: i strongly disagree that everyone's posts being tied to a single certificate they generate when they started using zeronet is not a huge anonymity concern. although this does not mean their online identity can be traced to their real world identity, it still means that it is incredibly trivial to determine that all of these posts across zeronet are tied to this single poster. this does discourage speech when it is difficult or not straightforward how to use multiple certificate identities.",
			"post_uri": "1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7_1539008599",
			"date_added": 1539036801
		},
		{
			"comment_id": 7,
			"body": "i believe there are ideas in the concept/planning stage on how to mitigate the data/user flooding problem, which would require more proof-of-work for every new certificate generated. i don't remember the details. it's always good to consider multiple solutions, of course.",
			"post_uri": "1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7_1539008599",
			"date_added": 1539037188
		},
		{
			"comment_id": 8,
			"body": "i find it frustrating that a number of sites ONLY allow posting with a ZeroID certificate. ZeroID requires clearnet access (or it did last time I tried it), and it encourages everyone to use one and only one certificate everywhere, because ZeroID is accepted everywhere, but CryptoID, KaffieID, et al. are only accepted on like one or two sites who bothered to add those certificate issuers to their site.",
			"post_uri": "1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7_1539008599",
			"date_added": 1539037532
		},
		{
			"comment_id": 9,
			"body": "@Daniell Mesquita: it will not make it \"easier\" for users with strong computers. it by definition makes it harder than it currently is. naturally a spammer will want to use a desktop in this scenario for generating new IDs because a desktop can do the proof of work faster. however, it will still take much more time than the current model.any method which will make it more difficult to get a spammer from getting his hands on a new certificate will ALSO make it harder for a good-faith user from getting one for themselves. we should remember this when we think about ways to mitigate spam.",
			"post_uri": "1b9urVTLtAAZAidg6hchWqhrVtYXUaoj7_1539008599",
			"date_added": 1539043904
		},
		{
			"comment_id": 10,
			"body": "VERY cool!",
			"post_uri": "153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k_1548067460",
			"date_added": 1548080896
		},
		{
			"comment_id": 11,
			"body": "sometimes you can't stop people from using the technology you support to commit evil acts. just remember, anything you can do to censor, de-anonymize, or attack bad actors from within the network can also be done against YOU. zeronet exists as a technology that allows users to publish content that cannot be censored. designing censorship into a backdoor of the technology undermines the very reason the technology has to exist. if you cannot accept that people might use your technology for evil, then you should not write code to begin with. the solution, then, is to immediately cease development of your network, attempt to shut it down, erase all evidence of it, disavow any involvement in it, and find something different to do with your life.",
			"post_uri": "1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK_1585418822",
			"date_added": 1585433122
		}
	]
}