{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1,
			"title": "Можно ли раздавать сайт в Zeronet скрывая ip пира с помощью TOR?",
			"body": "Я создал сайт, но он не доступен в сети (Пиры не найдены).\n\nВходящий порт для раздачи файлов сайта принудительно закрыт ZN клиентом (Good, your port is always closed when using ZeroNet in Tor always mode.)\n\nВопрос в топике.",
			"added": 1537357852
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1_1GewTebNkbfbLPvb4ZJKSmRbuEqcRqJJZ4": [
			{
				"comment_id": 1,
				"body": "> [dude](#comment_64_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): При включенном торе доступность портов не важна - они не используются.Чтоб сайт разошелся по пирам, нужно чтоб люди на него зашли и отзеркалили себе. Ваш кэп.Зайти на него поначалу смогут лишь те кто имеют у себя тор.\n\nВерно. Вчера у другой машины не было доступа к новой странице, сегодня уже есть.\n\nДействительно, открытый порт не нужен, ведь обычные торренты можно скачивать и раздавать через тор без открытых портов.\n\nЗачем нужен открытый порт? Чтобы служить трекером пиров? Если я использую TOR HS с помощью control port, то я служу трекером пиров?",
				"added": 1537367599
			},
			{
				"comment_id": 2,
				"body": "Похоже, что теоретически я могу быть трекером пиров, но пока эта маленькая фича не добавлена (if you have static ip).\n---\nZeronet. Changelog: August 28, 2018\nShared tracker list between users:\n\nNew tracker IPs automatically discovered from other users to reduce centralization and avoid the blocking of the trackers.\n\nTo start new tracker: Enable the Bootstrapper plugin with opened port, then it will automatically share your client's ip with other users as a possible tracker. (It's only recommended to do this if you have static ip and planning to keep your client running 24/7)",
				"added": 1537368501
			},
			{
				"comment_id": 3,
				"body": "Еще вопрос по скрытию ip пира сайта.\n\nВ Zeronet презентации, на 15 странице о MULTI-USER ZERONET SITES ( https://zeronet.io/files/ZeroNet_Presentation.pdf ), написано:\n1 Sending your auth address to site owner - имеется в виду рассылка изменения (поста) всем пирам сайта? Спам, ограничения на размер сайта?",
				"added": 1537369223
			}
		]
	},
	"comment_vote": {}
}