{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Energia Elétrica, Técnologia, Informatica, Inovações.",
			"body": "",
			"added": 1551730582
		}
	],
	"topic_vote": {},
	"next_comment_id": 10,
	"comment": {
		"2_1J7BZnp2xmjByBDG3z9UUtXv22pnQ7akfr": [],
		"1_1AFp2MYuvi2qHgtv5gfZcudgkfHRGuECDR": [
			{
				"comment_id": 2,
				"body": "Grafeno Super Condutividade:\n\nA supercondutividade é um fenômeno no qual elétrons podem se movimentar em certos materiais com zero resistência e expulsão de fluxo magnético nulo (Efeito Meissner). Pelo quadro acima fica claro que os materiais, em sua grande parte, necessitam de baíxissimas   temperaturas para permitirem um comportamento supercondutor dos seus elétrons de livre movimentação, muitas vezes beirando o Zero Absoluto   (0K). Nesse ponto, ainda precisamos ultrapassar essas limitações para permitir o uso desses materiais em tecnologias inovadoras para o   cotidiano das pessoas.\n\nO mecanismo base para a supercondução convencional - onde excetua-se a supercondutividade em materiais orgânicos, por exemplo - é   aquela explicada pela Teoria BCS (Barden, Cooper e Schrieffer, em homenagem aos cientistas responsáveis por desenvolvê-la), na qual os   elétrons em supercondução são emparelhados em uma rede de momento e estado de spin zeros (pares de Cooper) através de fracas interações dos   eletróns  em condução com os modos de grade  (conhecidos como fónons, onde a movimentação elementar vibracional em um arranjo de átomos ou   moléculas oscila uniformemente em uma única frequência) dos íons formadores do sólido metálico. O momento orbital angular do par formado pode   ter um valor de  0\"(\"s-wave\"), 1\"(\"p-wave\"), 2\"(\"d-wave\"), e assim por diante. Para maximizar essa atração, os pares de Cooper na Teoria BCS   aparecem no mais simples canal s-wave.\n\nEm relação às propriedades quânticas, o grafeno traz diversas novidades teóricas. Sua estrutura hexagonal permite que elétrons se   comportem como se não tivessem massa (algo conhecido como férmions de Dirac), onde essas subpartículas se movimentam com 1/300 da velocidade   da luz, abrindo as portas para efeitos relativísticos normalmente só observados em aceleradores de partículas. Outra propriedade quântica   rara é o chamado 'Tunelamento de Klein', onde elétrons podem passar através de uma barreira de grafeno como se esta não estivesse presente.   Além disso, a introdução de impurezas na estrutura do grafeno - como átomos de outros elementos quimicamente incorporados - não aumenta sua   resistência elétrica como observado em condutores como o cobre.\n\n  Na prática podemos ter o grafeno em várias formas, incluindo com modificações químicas em sua estrutura (via oxidação ou redução) e   conjugação com outros materiais, dependendo das propriedades e áreas de aplicação desejadas. O grafeno puro - mono-camada de anéis hexagonais   de carbono - pode ser obtido em suspensão ou aderido a uma superfície. A dimensão dessa mono-camada de grafeno pode variar de vários\n   nanômetros até a macroescala. Também pode ser obtido na forma de multi-camadas - com duas ou mais mono-camadas sobrepostas ('grafite fino')   -, onde à medida que as camadas aumentam, diferentes propriedades são obtidas e o preço de produção é diminuído bastante - já que obter uma   mono-camada (real grafeno) estável é uma tarefa mais custosa. Multi-camadas de até no máximo 10 mono-camadas de grafeno sobrepostas são\n   geralmente consideradas ainda como grafeno. Hoje o grafeno já é utilizado de diversas formas em inúmeras aplicações, desde experimentos   científicos até tecnologias utilizadas no dia-a-dia.\n\n https://www.saberatualizado.com.br/2018/03/supercondutividade-descoberta-no.html",
				"added": 1551731396
			},
			{
				"comment_id": 3,
				"body": "Mátriz Energética.\n\nO brasil segue avançando cada vez mais na diversificação da sua matríz enenrgética, porém com grandes falhas no setor energético, uma vez que área representa uma grande importancia econômica e militar para o país, sendo uma vergonha as políticas energéticas do país.\n\n\n\nCarga e Geração  04/03/2019 17:34\n\n\nCarga: 63517,9 MW\nExportação: 0,0 MW\nGer. Eólica: 3853,6 MW\nGer. Hidráulica: 49817,1 MW\nGer. Térmica: 7718,8 MW\nGer. Nuclear: 1999,7 MW\nGer. Solar: 130,0 MW\nImportação: 0,0 MW",
				"added": 1551732202
			},
			{
				"comment_id": 7,
				"body": "Linha de Trasmissão de Roráima.\n\nAssim nunca seremos primeiro mundo,  adminstração estatal é presa nas intemperies de 1500.....kkkkkkkkkkkk\n\nEu queri viver em um país de desenvolvimento condizente com seu potêncial\n\n\n\n\n\"\"\"\"\"No caso da linha de transmissão de Roraima, ela poderia ser feita na área indígena se passasse dentro da faixa de domínio da rodovia BR-174, que passa nas terras dos Waimiri-Atroari. A concessão do linhão de Manaus a Boa Vista foi licitada há sete anos, mas as obras nunca foram iniciadas por falta de licenciamento ambiental. O consórcio vencedor é formado por Alupar (51%) e Eletrobras (49%).\"\"\"\"\"\n\n\nhttp://www.agenciainfra.com/blog/governo-quer-linha-de-transmissao-de-roraima-no-percurso-da-br-174/",
				"added": 1551768091
			},
			{
				"comment_id": 8,
				"body": "Acelerador de Partículas.\n\nNosos bosques tem mais vida nossa vida em teu ceio mais amores!\n\nEu amo meu país um dia teremos nossa independência economica,  livre dos intereses globalistas.\n\nBrasil ame ou deixe-o............heheh\n\n\n\"\"\"\"\"\"\"\"\"O que pouca gente sabe é que no Brasil já existe um acelerador de partículas em funcionamento, também no CNPEM. O acelerador UVX pertencente ao Laboratório Nacional de Luz Síncrotron (LNLS/CNPEM) foi o primeiro acelerador de partículas do hemisfério sul ao ser inaugurado em 1997, e atende cerca de mil pesquisadores por ano. Agora o UVX vai ser aposentado para dar lugar ao Sirius, um acelerador de quarta geração, com tecnologia mais moderna e avançada que fará em poucos minutos o trabalho que o UVX atualmente leva horas para fazer.\"\"\"\"\"\"\"\"\"\"'\n\n\"\"\"\"\"\"\"\"\"\"A construção do Sirius é uma grande conquista da ciência brasileira! O projeto foi idealizado por pesquisadores brasileiros altamente competentes e produzido com tecnologia também brasileira. Quando entrar em funcionamento vai permitir que nossos cientistas produzam ciência de alto nível competitiva com as pesquisas americanas e europeias! Saiba mais sobre as mentes por trás deste projeto nessa reportagem da BBC. \"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\n\nhttp://profissaobiotec.com.br/novo-acelerador-de-particulas-coloca-o-brasil-na-fronteira-da-ciencia/",
				"added": 1551769132
			},
			{
				"comment_id": 9,
				"body": "MIneração espacial.\n\nMIneração espacial é o futuro da humanidade, buscando recursos na puta que pariu, para suprir a crescente expanção demografica planetária. Não querendo ir de encontro as idéias de controle populacional, infelizmente nosso planeta é uma plataforma de superfície fechada, logo comporta quantidade limitada de seres humanos!\n\n\n\"\"\"\"\"\"\"\"\"\"\"Muitos executivos do setor da tecnologia têm vendido a ideia de Marte como o próximo destino do homem fora da Terra. Mas eles talvez estejam mirando longe demais. A chance mais imediata de nos estabelecermos fora do Planeta Azul está bem mais perto, e esse caminho será provavelmente traçado por empresas pouco conhecidas.\"\"\"\"\"\"\"\"\"\"\"\"\n\n\"\"\"\"\"\"\"\"\"\"\"''Colonizar a Lua servirá como um modelo do que se pretende fazer em Marte, dizem cientistas da agência espacial americana, a Nasa. E aqueles que ocuparão instalações no satélite natural serão, provavelmente, empregadas de pequenas empresas privadas de mineração – e não magnatas de tecnologia.\"\"\"\"\"\"\"\"\"\"\"\"\"\n\n\"\"\"\"\"\"\"\"\"\"\"Muitas dessas companhias estão ligadas à pequena nação europeia de Luxemburgo. E o mais surpreendente é que a Nasa estima um prazo de quatro anos para o início dessa colonização. \"\"\"\"\"\"\"\"\"\"\"\"\"\"''\n\n\nhttps://www.bbc.com/portuguese/vert-fut-45303906",
				"added": 1551771606
			}
		],
		"1_1HTMfq37pK6cZGpVpt22vQTboMNDunoHjY": [
			{
				"comment_id": 4,
				"body": "Git center Add repositorios\nhttp://127.0.0.1:43110/1GitLiXB6t5r8vuU2zC6a8GYj9ME6HMQ4t/",
				"added": 1551734806
			},
			{
				"comment_id": 5,
				"body": "ZeroNet Vulnerability Fix\nhttp://127.0.0.1:43110/1GTVetvjTEriCMzKzWSP9FahYoMPy6BG1P/?/",
				"added": 1551734915
			}
		],
		"2_1AFp2MYuvi2qHgtv5gfZcudgkfHRGuECDR": [
			{
				"comment_id": 6,
				"body": "Nínguem? Seus bagaçeiro me deixaram aqui sozinho!",
				"added": 1551767132
			}
		]
	},
	"comment_vote": {}
}