{
	"next_post_id": 19,
	"next_comment_id": 17,
	"next_follow_id": 3,
	"avatar": "jpg",
	"user_name": "Tulpa",
	"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
	"intro": "Programmer\nOnline games lover.\n\nGender: Feel free to call me any way you want, not bothered by this. \n\n\n\n\n\n(Biologically M, in case anyone is interested!, but in my dreams and games i'm any gender!)",
	"post": [
		{
			"post_id": 1,
			"date_added": 1612928175,
			"body": "Olá, ZeroMe!"
		},
		{
			"post_id": 1612928248,
			"body": "Hello World! ",
			"date_added": 1612928246
		},
		{
			"post_id": 1612950335,
			"body": "I wanna see if ZeroNet \"Twitter\" goes ahead, Seems interesting~ ",
			"date_added": 1612950332
		},
		{
			"post_id": 1613004439,
			"body": "So it makes me wonder, how many users exist on both the ZeroMe and on the ZNet as a whole.",
			"date_added": 1613004435
		},
		{
			"post_id": 1613027872,
			"body": "It's different here from the outisde, and i can't sleep so i'm gonna use this account to share some of my dreams!\nI don't guarantee i'll share one per day, but when i feel bored i shall use this to give you guys some content!\n\nSome dreams are quite lewd, but i'll place a R-18 flag on it if necessary!\n\nLets start with a cool one shall we?\n============//================\nI was a smol neko girl, i had a lot of magic and mana, and was living by training and creating new magic spells (It was a fantasy world/setting). \n\nTwo men from the staff from the school i was gonna give some demonstrations at the magic festival were fighting, so i healed them after that, we were preparing very hard for all the events we were gonna share (Mock fights, magic demonstrations and all), and we from the staff were gonna receive a lot of good and expensive food for the effort, we were very Happy!\n\nDuring the festival, i was participating in the Defensive Magic Demonstration, i was with my casting equipament and attack gloves, placed my best defensive shield, that could absorb 2/3 of all magical power into it, and 1/3 of all physical attacks. \nDuring the demonstration, a robed mage started doing a chanting and not only him, other people too, i absorbed the magic from one of them and throwed them very far. But sadly one caster managed to finish the invocation, the floor started melting and a giant magma monster appeared, i managed to evade it and finish a 3-Dimensional magic formula, and i explode all the mana in front of me. The mages lost their balance so i give them a good beating before throwing them at the lava and making them sink into it.\n\nAfter finishing the monster, a earthquake happens and a giant magical influx happens, i run to the next run, but opening the door i noticed the room changed from a normal room to some kind of ruins. \nI see a giant cyclops girl, attacking the other students with tears, i tell the ogre teacher to get everyone and evacuate while i deal with the cyclops, i change my shielding to 3/4 physical and 1/4 magical, and with that i begin combat. Summoning a familiar to help me, i manage to weaken the giant really well, and her magic flux begins to become unstable. I plan to end that once and for all, but i stopped when she lost her will to fight.\nShe asks me to kill her, i get closer and notice two skeletons, remains of what she once called her children.\n\nShe was in the past a normal cyclops girl, exploring ruins with her team, but after a magical outburst during what we called 50 years ago \"The red Calamity\", she survived, but became stuck in that dimension we were right now. She did not know, but she was pregnant at the time, and her children were born, but they died of hunger. She was unable to die, as she did become a being of pure magic, with the dimension now in contact with the world once again, and our battle, she became vanishing from existence. I give a hug to her head, and she hugs the remains of her two children, and she vanishes into mana.\n\nAll that remains is her weapon, and a memento with a photo.\n\nI go to the next room were everyone that evacuated were waiting, we had a staircase and a misterious ruins to explore so we could find our way out, we decide to go ahead, and find our way into this.\n\n==================///==================\n\nThis is one of the dreams i had, i like this one :D\nIt's from 09/december/2020. Quite a nice one i would say, a little sad but still fun one to remember.\n\nSome dreams i'm a man, some i'm a girl, some i'm something??? I find it funny!\n\n\n",
			"date_added": 1613027867
		},
		{
			"post_id": 1613110201,
			"body": "Dream time!\nI remembered a fun dream when i woke up, gonna post here:\n\nDream Date: 11/02/2021\n\nI was with a girl, friend of mine in that dream walking to our home, when a army of monsters appeared. We tried to run but in front of us a portal appeared and took us.\nWhen we woke up, we had turned into \"living weapons\", summons that could turn themselves into weapons, normally yielded by heroes.\n\nMy user was a nice guy, he wanted to save and protect the others, my friend user was my user sister, also a good person. Both of them were orphaned, so this was a good thing in their lives.\nAfter we were explained what happened,  e what we now are, we changed clothes for a more normal one to that world and we had a tour in the city, it was a big medieval town, with a lot of people. I ask them and they buy to me a small necklace with sphere with space to store something small, was a cute design and i loved it.\nAfter two days, me and my friend transformed (With our permission) into our weapon form, i was a double saber, purple/obsidian like, and she was a lance, quartz-like in color.\nWhen i transformed, my vision became my user vision, and we could talk via telepaty to help in combat.\n\nAfter two more days, i discover that i'm \"breaking\", a part of my body materialized into a crystal and was crumbling a part, and if it broke in its entirety, i could die.\nWe go to the cathedral for an important heroes meeting, and all heroes had legendary weapons, creatures or spirits summoned to help them. Not all of them were from other worlds, some were from that same world.\nI speak with one of the summoners i knew from when i appeared in that world, and he said that i had two options, one is to break my contract with my user, making him surrender being a hero, the other is another vessel (Accessory) for my user, that could store all my power. He opted for the second option, and i was allowed to choose any of them.\n\nAfter a small discussion with my user, i see a quick vision, one heroine and her weapon laughing, and me and my user being eaten by a monster that looked like a dinosaur in the temple.\nI store my stone in my necklace, and i walk up to the door, i see the small loli hero laughing (That bitch), i open the door and see the fucking t-rex coming. I shut the door closed with all my strenght, grab my user by the hand and we RUN from there. It was a 2 meters tall T-rex, not so big, but it still was a fucking monster.\nAfter we found one of his weaknesses (He could not jump easily), we started going around a small river/hole to get away. My user says everything would be alright, he turns me into a weapon, and together we defeat the monster (Using the hit and run tatics until it bleeds out).\n\nAfter that, my crystal was almost entirely broken, and i was getting weak. My weapon form was instable and my user ring was also crumbling apart. We go back to the temple and the summoner appears with a new accessory, a ring that could change form a little. I decide to connect with the ring, and my user does the same, i feel my power and my user powers conecting inside the ring, and my crystal stabilizes, becomes whole again and vanishes inside of me again. \nThe summoner asks for forgiveness, and we say that it was no problem now that it's resolved. \nWe go back to the temple after that to deal with the fucking heroine that tried to kill us aparently.\n",
			"date_added": 1613110195
		},
		{
			"post_id": 1613195626,
			"body": "Let's grab one small dream from my diary, shall we? \nLets seee, got it! \n\n===//===\nDream Date: 16 September 2018\n\nI was in a office building, i was a girl, and i was working there as an assassin with a lot of cool weapons. My weapons were: A Energy Launcher, and a Semi-automatic Rifle. I was entering the building to kill the CEO of that company. I killed two guards that were guarding, after that, i entered the top of the building and could give a good shot on the CEO, he did not die.\nI grabbed him and jumped off the building to try and kill him (Using a grappling hook so i would not die), he hit the ground with all the force, and did not die.\nI had to run away and hide myself in a dormitory nearby, after all the old man CEO and his guards were trying to kill me with all their will.\n===//===\n\nSmall dream, but a adventure packed one~",
			"date_added": 1613195619
		},
		{
			"post_id": 1613267575,
			"body": "Dream Time!\n\nThis one is from 30 November 2016\n\nI was the Demon Lord, and i was in an arena where my rival was the king from that land, that was fighting again with me. The king was fighthing with one of his heroes, and my \"hero\" was a skeleton monster like the boss from Sword Art Online (The Reaper).\nThe hero from the king was a tall woman, black hair, dark eyes and a beautiful body. She was fighting with a sword and a gun.\nI was above a platform watching (This arena fight was something normal for our two contries, as it decided some resources and even tournaments).\nWhen she finished my summon, i entered the arena (as we always do), and helped her as she was getting overwelmed by the enemies. She got angry and got off angry of the arena.\nThe king was confused, i got off the arena and got to her headquarters on the arena, i put my head to see if she was ok, she tossed a sword at me and said she was tired of this all, she knew me as the demon lord, as she was half demon half human. She was sad that i was being casual about the fight, and being gentle with her, i said it was alright and i was doing this for fun and not for glory.\nHer room had a magical window, that showed the starts in the space, even though we are underground, it was a beautiful view. I got closer and we talked a little, after some time she was excited and wanted something more. She liked me, i don't really remember why tho.\nWe kissed, her lips were warm, and her passionate hug and kisses in my mouth were very conforting.\nWhen we were going to the best part i was woken up.\n\nGood and classic, one of the two first dreams i ever wrote up in my diary.",
			"date_added": 1613267567
		},
		{
			"post_id": 1613363780,
			"body": "A small and recent dream lets go!\n\nDream Date: 13 February 2021\n\nI was in a medieval world, where noble and religious entities had the power of the country (Like our medieval era).\nI was a man running with a woman from the nobility and church, i was a nice craftsman, i knew how to work with everything that needed small details, and she was beautiful, and skilled in hand-to-hand combat.\nWe ran from the big city and we tried to hide in a village, but we were found, we had to run even more, and we had to kill soldiers and church officials on our escape.\n\nThey at first thought she was a noble when i gave to her a Crystal collar, she used it with a long dress and free long hair, was quite a nice scene~",
			"date_added": 1613363771
		},
		{
			"post_id": 1613509728,
			"body": "Had not a very good day yesterday, and especially a not very good sleep...\n\nI had some problems and fought someone i hold dear to me, that person hurt themselves because of this, and i got a little heavy in the head.\nEnded up trying to sleep, but could only fall asleep at 8am (4-5 hours trying to sleep), and after that i woke up every one or two hours or so...\n\nSo... dream time i had yesterday to today (16/02/2021)\n\nI was alone at home, and everyone i know blocked me on all social medias i have, i was alone, everyone hated me, i felt sad and cried...\n\nThe reason i did not post yesterday is because of that, i could not even think right.... ",
			"date_added": 1613509718
		},
		{
			"post_id": 1613713725,
			"body": "Still having a not so great time, but hey, lets keep the dreams!\n\nDream date: 18/02/2021\n\nWas going to the medic, and return home by bike, i stopped by to eat lunch on the way back and drink some soda. After i got home my mom called me and asked how i was.\nIt was a very normal dream.\n\n",
			"date_added": 1613713714
		},
		{
			"post_id": 1613864154,
			"body": "Had a dream today (20/02/2021) that i was in college, and i was walking late at night at the wooded areas around it, and i found a baby bear and two adult bears around me.\nI was scared it was over for me, but the bears just wanted a pet and maybe to play a little, so i could to get way easy.\nAfter that i had a fight with the director and it ended up getting into a mess and fighting a bizarre thingy with some collegues of mine that were demi-humans (Elf, Beastman, Arachne people).\n\nWas interesting.",
			"date_added": 1613864142
		},
		{
			"post_id": 1614409198,
			"body": "Took one week but i finally am starting to sleep normally again...\nWas having 3 hours sleep everyday, it was hell.\n\nWell Dream time! This is a Fantasy one Date: 26/02/2021\n\nI was playing a game similar to skyrim, i had entered a cave that got me into a open area with bandits, killing them it lead me to another area with a giant cyclops and some dungeon entrances i needed to break.\nI tried breaking with arrows, but the boulders were resistant, so i had to go melee.\n\nThe cyclops noticed me and we fought, after a lot of combat i won, but, a giant crystal cyclops appeared from the other cave entrance, and that one used magic, a magic sword, and was invencible to normal hits, i got one hit killed and had to restart my save from when i entered the cave.",
			"date_added": 1614409185
		},
		{
			"post_id": 1614516411,
			"body": "Dream time! 8 January 2021!\n\nMe and a girl were reponsable for dealing with paranormal events, Evil Spirits, Monsters, you name it. During a inspection of one place, we found 2 big evil spirits but we managed to deal with them together. I was afraid at night, as the last time we found big spirits we were attacked on our sleep, so i did not sleep. \nMy mom and her mom had gotten diseased with Covid during the time we were off doing inspections, so we decide to get some stuff from the house and go to the Café, where on the basement was our working place.\n\nWe entered the cafe with our stuff, entered the basement, and inside that door, a big room, bigger than it should be appeared in front of us, that was our homebase, it was a clean area, with grass, stones, artificial light, clean water and most important of all, no spirits. It was big, maybe the size of the entire cafe above our heads, but underground.\n\nPlacing our stuff down, we slept on the middle and talked a little, she asked why i said for us to sleep together at the base, and i explained that last time she got attacked on her sleep alone and almost died, and i was worried. She was glad i was worried about her.\n\nShe had long black hair, white skin and a slim body, she was pretty and i liked her, was someone very important to me.\n\nAnd that is the dream~",
			"date_added": 1614516397
		},
		{
			"post_id": 1615341277,
			"body": "Vanished for a while, have been pretty occupied IRL with some stuff, so sorry for not posting for a while >.<\n\nDream time, 09/03/2021, i was a Centaur, or at least a Girl that turned into a centaur some years in the past. My family owned a freaking castle/mansion with walls around, it was huge, like those old mansions.\nThe only people that knew me and my condition were my parents and the people working on the mansion (And of course some doctors that worked for my family).\nThe dream was mostly running around and having fun, and trying to use normal stuff like bathrooms (Even if they were huge, the toilet was still human size and i had a huge stag/raindeer lower half).\nIt was a interesting dream and fun one!",
			"date_added": 1615341262
		},
		{
			"post_id": 1616287924,
			"body": "Vanished again, sometimes i even forgot i exist... But hey... why are humanity so... greedy and ugly...\nPeople don't take care of things that are yours, People don't remember you exist till shit hits the fan, people don't try to contact you to see if you are alright...\nI'm tired of this... I'm really tired of this! If i could i would just enter one of my dreams and vanish from this world...\n\nDream time.I had a spicy one today (20/03/2021) (R-18)!!!\n\nI was in a fantasy world, but it is more right to say i was playing a fantasy game than being in another world. I go to sleep in a INN and on the folowing days i get some quests and finish them, i decided to have sex with the girl that was together with me the whole time. \nAfter that, we get a quest to do something in the wolf-man city. Lots of people with some caracteristics of wolfs (Mostly Ears and tails, but some had paws too, more human than furry.).\nAfter doing a lot of quests, the daughter of the city leader (a beautiful woman and very aggressive in bed) decided to bear my children, something about their beliefs in strong blood or something like that (I did not catch all tbh). That was a lot of fucking and felt good~\nAfter finishing my business in town, i decide to go to another one.\n\n\nThe city i most liked in that dream was the first one, a Magic City, with floating crystals and teleporters.",
			"date_added": 1616287908
		},
		{
			"post_id": 1617769556,
			"body": "I just want to shout everywhere...\n\nAnyway, dream time!\n\n1 April 2021, \nI ate some good food in the streets in the dream and i was with my family on that restaurant. It was tasty!",
			"date_added": 1617769539
		},
		{
			"post_id": 1620003492,
			"body": "Dream time!\n22 April 2021\nI was playing a subscription based MMORPG, and i had found a way to get free subscription defeating some rare monsters. I was playing with some friends, visited the player market, and it was a fun experience overall. \nI was a mage i believe.",
			"date_added": 1620003474
		}
	],
	"post_like": {
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613027872": 1613028313,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613110201": 1613115093,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613267575": 1613267731,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613195626": 1613273778,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1613509728": 1613509724,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1616287924": 1617769449,
		"1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1615341277": 1617769450
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "@Realjohndoe: I find it very amusing, concept-wise this can work, now community-wise... good question x.x\nOnly time will tell for me at least.",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1612950335",
			"date_added": 1612984541
		},
		{
			"comment_id": 2,
			"body": "@Bankruptcy: At least here, you can't exactly be deleted. As everyone is the website owner (almost). \nYou can be muted by everyone i think so that is one thing to keep an eye on.",
			"post_uri": "12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4_1611737460",
			"date_added": 1612984651
		},
		{
			"comment_id": 3,
			"body": "@Realjohndoe: I mean, i can see the problems on this platform on it's concept:\n- It needs someone to be online hosting a website for it to work\n- Also needs to donwload the entire \"database\" of a website and host to others.\n\nWhile for now i can see not so many people uses every site (I think the most i saw is 1000-1200 people hosting a webpage and that was the hello page), lets say 10k people post on this social media like we do on twitter... we would be fucked xD\n\nThe first one is not bad, as it means anyone or anywhere can host the sites, but the second one can be problematic if one website gets too big with text.",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1612950335",
			"date_added": 1613001489
		},
		{
			"comment_id": 4,
			"body": "But i think comunications and news from other countries, or sharing of knowledge without censorship in it's respective places is a good thing",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1612950335",
			"date_added": 1613001585
		},
		{
			"comment_id": 5,
			"body": "Ello",
			"post_uri": "1DkzVVJF3jXJvbwmcJrobxgym5ZD5Azy2S_1613009840",
			"date_added": 1613011936
		},
		{
			"comment_id": 7,
			"body": "For what i can understand, each hub is like a \"database\" of users (Of course, all being p2p), but i think it's only a way to separate the userbase?\nThat way no database is too heavy (or i think so).\nCould be other stuff tho.",
			"post_uri": "1KihcBqcwgH1TKeZtKRnocUr22oUb5Av5A_1613060810",
			"date_added": 1613094732
		},
		{
			"comment_id": 8,
			"body": "A lot, but not much at the same time x.x\nFeel free to look around, you will find some interesting things (Also welcome)~\n",
			"post_uri": "19fX1TtocNa2x75nUeaSc9QR3uXzvWKqjw_1613178603",
			"date_added": 1613187536
		},
		{
			"comment_id": 9,
			"body": "@Jaytkyaw: ello\n",
			"post_uri": "141GSaSgbSzyU7YR1THn3sLDRxn3FtHLNr_1613140055",
			"date_added": 1613187731
		},
		{
			"comment_id": 10,
			"body": "@Ladylight: My ZeroMe is mostly about the dreams i have in my diary, so i just write them here once upon a time. if you wanna have a break feel free to come and take a look~",
			"post_uri": "19fX1TtocNa2x75nUeaSc9QR3uXzvWKqjw_1613178603",
			"date_added": 1613205181
		},
		{
			"comment_id": 11,
			"body": "Ello~",
			"post_uri": "1MeGFauVj6tUFUhpiuNNmn2Pa5htibzZKu_1613255359",
			"date_added": 1613257941
		},
		{
			"comment_id": 12,
			"body": "Ello",
			"post_uri": "1Jub4RYp2a8gebUYe6FpFVp1TuxzHcPZDp_1613295605",
			"date_added": 1613300486
		},
		{
			"comment_id": 13,
			"body": "To vendo isso mesmo produção?",
			"post_uri": "1P81i7aYDLxe9KHCzUgV51aBpqbPW46rdK_1613343240",
			"date_added": 1613351420
		},
		{
			"comment_id": 14,
			"body": "E em outra nota, dormiu por 1 mes? :v",
			"post_uri": "1P81i7aYDLxe9KHCzUgV51aBpqbPW46rdK_1613343240",
			"date_added": 1613351484
		},
		{
			"comment_id": 15,
			"body": "@Faithpacchampion: As in not being able to sleep or just dreams being not good?",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1614409198",
			"date_added": 1614515780
		},
		{
			"comment_id": 16,
			"body": "@mxh69420: Hehe, My family normally has dreams based on real problems, my dreams are just movies/animes most of the time if i think about it >->",
			"post_uri": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93_1615341277",
			"date_added": 1616287415
		}
	],
	"follow": [
		{
			"follow_id": 2,
			"hub": "1MoonP8t4rk9QamBUPh5Aspkwa1Xhf5ux2",
			"auth_address": "1EEmVGHAAgPWTVVMaxjeKTG37KUwzHYU93",
			"user_name": "Tulpa",
			"date_added": 1613195645
		}
	]
}