{
	"next_topic_id": 5,
	"topic": [
		{
			"topic_id": 1560428512,
			"title": "The way for hiding your life: Jameson Lopp",
			"body": "Jameson shared his 15 steps for hiding himself from any list and said he hired detectives for finding him and now they are unsuccessful.\n\nhttps://www.nytimes.com/2019/03/12/technology/how-to-disappear-surveillance-state.html\n\n1. Create a new corporate identity.\n2. Set up new bank accounts and payment cards.\n3. Carry cash.\n4. Get a new phone number.\n5. Stop using the phone for directions.\n6. Move.\n7. Make up a fake name for casual interactions.\n8. Create a V.P.N. for home internet use.\n9. Buy a boring car.\n10. Buy a decoy house to fool the D.M.V.\n11. Set up a private mailbox and remailing service.\n12. Master the art of disguise.\n13. Work remotely.\n14. Encrypt devices when traveling remotely.\n15. Hire private investigators to check your work.\n\nAnyone has anything to contribute to the list?",
			"added": 1560428511
		},
		{
			"topic_id": 1561820909,
			"title": "Why Telegram is not E2E encryption by default",
			"body": "It seems to be simple for Telegram to implement the E2E encryption by default on chats, but why they didn't implement it?\n\nA few weeks ago we did some prototypes user <> bot and user <> user trying to recover files after being deleted by the other peer. \n\n# Test 1\nThe process for the first test was [user <> bot]: \n- Sending a document on a chat with a bot using Telegram's official app.\n- Deleting the file on the open chat\n- Accessing the file through the bot\n\nIt was possible to recover the file after being deleted through id and path, using Telegram API's. However, it could be a strictly internal process on how Telegram handles files and bots.\n\n# Test 2\nThen we did the second test [user <> user]:\n- Sending a document on a chat with another person using Telegram's official app.\n- Deleting the file on the open chat\n- Another peer was using the telegram-cli and successfully recovered the file\n\n*Old files are not available for recovering.* \n\nIf it is possible to recover a file after being deleted, it means that Telegram stores those files. \nIf the file is not accessible after some time, there's no way to prove they deleted it or moved it to another storage.\n\nAs you can follow in this link (https://core.telegram.org/bots/api#deletemessage), Telegram explains how to delete messages, but there's nothing on the whole documentation showing how to delete files. Messages and files have different treatment on their platform.\n\n# Conclusion\n\nHowever, maybe, it is a signal that explains why Telegram doesn't implement E2E encryption by default, because it can turn impossible to read the content of the files shared through peers.\n\nSo, it is plausible to believe that Telegram stores and scans all those files shared on their platform, and it raises many privacy concerns.",
			"added": 1561820907
		},
		{
			"topic_id": 1563791743,
			"title": "bluekeep ocean",
			"body": "http://127.0.0.1:43110/1MgHVPCE1ve6QfKrgsqCURzRj72HrRWioz/?16GG19wZtGAcebcKhf2hEmcf1sETig7DLA_0",
			"added": 1563791740
		},
		{
			"topic_id": 1565968613,
			"title": "Is Amazon's RING a very privacy threat?",
			"body": "Amazon Told Police It Has Partnered With 200 Law Enforcement Agencies\n\nhttps://www.vice.com/en_us/article/j5wyjy/amazon-told-police-it-has-partnered-with-200-law-enforcement-agencies\n\n\"At least 200 law enforcement agencies around the country have entered into partnerships with Amazon’s home surveillance company Ring, according to an email obtained by Motherboard via public record request. \"\n\nMore refs: https://www.eff.org/deeplinks/2019/08/amazons-ring-perfect-storm-privacy-threats",
			"added": 1565968609
		}
	],
	"topic_vote": {
		"1561820909_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1,
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": 1,
		"1560428512_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": 1
	},
	"next_comment_id": 14,
	"comment": {
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 1,
				"body": "4,5,6",
				"added": 1560284699
			}
		],
		"1560284215_1NFEZa8hNrGfpw1EK4yRPWVquQJi59pMV7": [
			{
				"comment_id": 2,
				"body": "> [anonymouslogin](#comment_341_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): It seems to be the case that criminals are the first to adopt and abuse unregulated technology. Unfortunately it often gives the technology a bad reputation in polite society.\n\ndefine criminals",
				"added": 1560285241
			},
			{
				"comment_id": 8,
				"body": "> [daz](#comment_77_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr): who defines what is criminal. when the laws become so stupid as they are in England it becomes very hard to live inside stupid laws so every one becomes a criminal. They may not know it and the police can not enforce it but if you start doing things to upset the people with the power they can find the law to lock you up. or just break you down.\n\nThat's the point. Stupid laws made by stupid people defining mostly what is good for their interests.",
				"added": 1561821393
			}
		],
		"1560002823_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs": [
			{
				"comment_id": 3,
				"body": "> [reeeeeeeeeeeeeee](#comment_6_1MutjWS9dBUHWpg67kCVznJn2uG3z4n8Rr): How does Starwels prevent double spending if transactions are instantaneous?\n\nAnd how it is based on Bitcoin, faster blocks == +orphans",
				"added": 1560286272
			},
			{
				"comment_id": 4,
				"body": "> [bounty](#comment_7_1Fdubdz82XUxNMuaHGYC3uKD95XbnW7JTs): Internet speed and SSD allow using such speed\n\nHas it faster blocks because internet speed and SSD? #OMG\nYour answer does not make any sense and shows you don't know how even Bitcoin works. For a cryptocurrency who cloned BTC code and didn't solve the the equation for having faster blocks, it shows what will happen in a future soon.",
				"added": 1560429342
			}
		],
		"1560428512_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 6,
				"body": "> [randomshits](#comment_22_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY): 00 Become rich to finance your 'hiding yourself' operation. [...]\n\nI don't think it is a socialist thing. Being on a place far from the estate arms don't seem to be socialist.",
				"added": 1560445911
			}
		],
		"1560440259_1BmC9X4qMXSfY449gWipdty6tYvwiJUSFr": [
			{
				"comment_id": 7,
				"body": "> [allelujah](#comment_1_1ErXkEqy2cnpcq7DcLYhW652yM7KHyhApR): I recommend not using NordVPN, from https://news.ycombinator.com/item?id=18609655 [...]\n\nThere's something bizarre about protonmail, but they denied on their blog. Last month someone published an article named: \"ProtonMail voluntarily offers Assistance for Real-Time Surveillance\". Because that, maybe it is interesting being more cautious.\n\nhttps://steigerlegal.ch/2019/05/23/protonmail-real-time-surveillance/",
				"added": 1560446812
			}
		],
		"1561820909_16GG19wZtGAcebcKhf2hEmcf1sETig7DLA": [
			{
				"comment_id": 9,
				"body": "> [ryoichitsukuda](#comment_1_1D7oqjJnnaxiFti8Kk3qQQx76L2v9ne9t4): It is clear they are storing and scanning the content of all files, that's why they don't enable end-to-end encryption by default.\n\nAgreed",
				"added": 1562275789
			}
		],
		"1564978498_16hDLv7wiUVh3cuz6W1C2RWkesxVnqYkKW": [
			{
				"comment_id": 10,
				"body": "oh, no.",
				"added": 1565065200
			},
			{
				"comment_id": 11,
				"body": "> [styromaniac](#comment_832_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): InB4 \"shitting dick nipples\" turns up in your search history.\n\nhahahaha good one, but no.",
				"added": 1565070174
			}
		],
		"1566158607_1D7oqjJnnaxiFti8Kk3qQQx76L2v9ne9t4": [
			{
				"comment_id": 12,
				"body": "> [ryoichitsukuda](#comment_3_1D7oqjJnnaxiFti8Kk3qQQx76L2v9ne9t4): could be hal finney ressurected by AI and enclosed on a simulacro, but...\n\nno signature, no trust... easy like that.\nmkt campaign\nin the end it could appear Craig Wright telling he is the real one, again. LOL",
				"added": 1566175111
			},
			{
				"comment_id": 13,
				"body": "> [genx](#comment_12_1Bov9ZwmSSatH1PkwS2fQ9LGvEJPrvimad): https://www.globenewswire.com/news-release/2019/08/15/1902735/0/en/Satoshi-Nakamoto-Renaissance-Holdings-Retains-Ivy-McLemore-Associates-for-Strategic-Communications.html\n\nThe text is 'copyrighted' by 2 companies. And this Ivy McLemore is a digital mkt company and one of them.\nEasy to believe.\nIt is true as also Craig Wright is Satoshi Nakamoto.",
				"added": 1566210537
			}
		]
	},
	"comment_vote": {
		"9_1MutjWS9dBUHWpg67kCVznJn2uG3z4n8Rr": 1,
		"1_1ErXkEqy2cnpcq7DcLYhW652yM7KHyhApR": 1
	}
}