{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1581642983,
			"title": "戏说武汉新型冠状病毒与美国的关系",
			"body": "（转载于youtube)虽然这只是一个茶余饭后扯淡，但希望大家能将这篇转发出去，同时在疫情的特殊时期能够做到自律，保护好自已，不出去各种浪，不要给奋斗在前线的人们带去麻烦，他们已经很辛苦很辛苦了。\n2019年10月18日到10月27日，世界军运会在武汉举行， 其中：美国名为United States 美方派出了369名酱油兵参赛。\n\n为什么说是酱油兵呢？\n\n因为在为期10天的比赛中，美国酱油兵的表现就连巴林都嫌弃得不要不要的，金牌更是一枚没有，综合成绩更是被朝鲜远远地甩在了后面，一度让墨西哥产生了反攻美国大陆的冲动。\n\n但比赛中的糟糕表现，没有影响了酱油兵游玩武汉的心情。这就很奇怪了，美国已经穷到要饭抢劫，他们的总统动不动伟大的胜利，即使是摔了一跤也是伟大的胜利，嗯属于美国的那种。\n\n他们真的不需要一块奖牌？美国军人就这么任性？世界上最强的军队，竟然只是一群娘炮？\n\n美国人爱奖牌爱到发疯，从小学到开始，哪怕你是个智障，学校也会给一块奖牌。美国真的不需要一块正儿八经的胜利振奋一下人心？一场贸易战下来，多少优质资本家都心理崩溃了。\n\n这次军运会他们两个一群、两个一伙地搭档，在武汉街头四处游玩，留下了不少浪漫事故（嫖娼，身在武汉的浪子们，最近控制一下丁丁，接待你的婊子也接待过美国人，不怕别的，怕要命）。\n需要指出的是，军运会美方招待所所在的位置，就在华南海鲜城不远。\n\n军运会结束，正当人们纳闷，这帮恨不得肌肉练到脸上的彪货，怎么突然娘炮了起来？难道美国大兵的伙食被克扣地只能吃草了吗？还是比赛的时候忘了吃士力架了？\n\n疑团还没有解开，武汉瘟疫爆发了。\n\n有人说美国军队不虚荣，不屑拿这类奖，那么你就错了。\n\n美国的军人包括将领军官，退役后基本没有就业帮扶，在美国退役军人去要饭做流浪汉的比比皆是，胆子大的直接从事黑帮产业。\n\n退一万步来说，在这类比赛中拿奖的人会在退役后有份不错的简历，可以方便他们找到更好的工作（例如保安和健身教练），为什么他们不拿这个奖牌？\n\n12月8日，武汉发现第一例不明原因肺炎；\n\n1月9日，初步确认新型冠状病毒为疫情病源；\n\n1月20日，被新型冠状病毒感染的确诊病例以不可思议的速度上涨；\n\n随后武汉封城、全国30个省份启动重大突发公共卫生事件一级响应，实行最严格的防控措施、全国各地谈武色变、口不离罩，足不离户……\n\n蹊跷的疫情让传统医疗体系感到措手不及，长期被误解、被排斥的中医体系也被请到了抗瘟前线，钟南山甚至希望中医必须在第一时间出来干预。\n\n华南海鲜城被定性为疫源的始发地，野生动物被怀疑是瘟疫传播的初始载体。在沸沸扬扬的争论中，人们甚至把肇事动物精确到了蝙蝠。\n\n随着科学家的努力，新型冠状病毒的编码序列被测出，和2003年肆虐中国的非典病毒具有亲缘性；\n\n《科学》杂志刊文表示，华南海鲜市场未必是新型冠状病毒的源头，且确定首次人类感染病毒发生在11月；\n\n北京化工大学教授童贻刚认为，华南海鲜市场是病毒集散地，而不是第一站。\n\n医学杂志《柳叶刀》则分析，病毒起源除了被感染的动物和进入市场的单个动物外，还有一种可能，就是有人在市场外被感染，然后再将其带到市场。\n\n这不禁让人想到了那群军运会上的TOM们，难道那群酱油兵的瓶子里另有玄机？\n\n我们重新温一下军运会的信息：\n\n第一：首批病患集中在华南海鲜城，即米国酱油兵的招待所附近；\n\n第二：病毒首次感染人类发生在11月，也就是军运会刚结束；\n\n第三：华南海鲜城不是病毒第一站，有可能是被人带到了市场中；\n\n第四：一向强悍的美国大兵，在军运会上的表现连个小区保安都不如。\n\n事出怪异必有妖。\n\n加之在军运会结束后，美国突然收紧中国人赴签美国的签证，如果这些酱油兵是生化兵的话，那么所有的问题都可以迎刃而解了。\n\n我们不妨大胆地揣测一下，美国升级了非典期间的SARS病毒，趁着中国举办军运会的时机，由369名生化兵带到中国，在华南海鲜市场进行了定向投放，造成了瘟疫流行。\n\n当然所有的一切都是假设，假设的东西，必须得有证据才行。\n\n华南海鲜城附近有那么多摄像头，调出来看看这些TOM们有没有去里面转悠，有没有怪异的举动？\n\n运用一些黑科技，核实一下这些TOM们的身份，看看这些酱油兵的到底是什么兵种？\n\nAI一下酱油兵的活动轨迹，看看是否与病毒的传播轨迹高度重合？\n\n了解一下11月左右的初始患病人员，是否与酱油兵有过直接或间接的接触？\n\n……\n\n从各方来看，美国有实力和动机这么操作。\n\n首先，美国在全球拥有超200个军事生物实验室，以及全球最多的P4病毒实验室，加之美国热衷收集流感病毒却不愿意分享的尿性，天知道它们研究这些病毒到底是想造福人类，还是造福医药公司。\n\n其次，中美之间的大国角力还没有结束，贸易谈判依旧进行，中国不太容易输，美国又迫切地想赢。因此，在谈判桌下，使一些非常规的手段让中国就范，则不是新鲜事。比如香港闹剧、贸易上极限施压、举国抵制华为、新年南海自由航行……\n\n最后，比起常规的热战、冷战、经济战、舆论战和文化战而言，生化战的破坏更大，而且隐秘，不容易察觉。\n\n考虑到美国糟糕的财务状况，生化战只需要花很少的钱，就有可以达到杀人毁城的战略威慑，这种效果估计会让抠门的特朗普吃洋葱都能笑出声来。\n\n假设中国对新型冠状病毒束手无策的话，美国又恰好研发出可以治疗肺炎的疫苗，那么中国想要崛起，就得用人命换了。\n\n这两天特朗普又在推特上表示愿意向中国提供必要帮助，美国砖家将发挥其作用。\n\n姑且先认为这头黄鼠狼是好心拜年吧。\n\n如果把感染上新型冠状病毒的患者比作是炸弹客的话，那么传统医疗体系则是健康的治安大队。\n\n炸弹客一方面容易自爆，同时他还会不停地向外送炸弹，见者有份，不接都不行。\n\n传统医疗体系作为常规治安部队，一方面负责阻断炸弹客四处散播炸弹，同时还得拆除炸弹客身上的炸弹，以保证其生命安全。\n\n在中国有举国体制和全民动员的努力下，炸弹客的传播途径被大规模阻断，虽然会有些许漏网的炸弹客，也会被缩小在有限的爆破范围中，很难再起波澜。\n\n接下来，就是考验传统医疗体系的拆弹能力。 西医的思路是疫苗，相当于让体内炸弹哑火；中医的方式是强化身体防御，让炸弹爆炸的危害不足以对人体产生影响，同时，调动身体职能部门自动拆弹。\n\n可喜的是，中医对瘟疫的控制和治疗效果显著，目前已经有多患者被治愈，新华社27日刊文表示中医药对新型冠状病毒的肺炎防止可全程发挥作用。\n\n然而突发的炸弹客究竟是从何而来，这是个必须要回答的战略性问题。因为理论上，不找到疫源，瘟疫很可能会再度爆发。\n\n现在占主流观点的蝙蝠瘟疫说、野生动物疫源说，均为猜测，没有实证。随着时间的推移，又出现果子狸中间寄主说……\n\n基于分子生物进化技术，加入人工代传，逆向进化出来特定的新发流行病病毒，这些建立在西方流行病理论基础上的推导，很可能会陷入南辕北辙的误区，贻误的，将不仅仅是治疫时机。\n\n目前搞病毒逆向进化，技术上最先进的国家，不用说，我们都知道是谁。\n\n既然存在这种可能性，那么狙击疫情，从根源上消灭瘟疫，则需要部队，来实现。\n\n1月26日，中国人民解放军接管了武汉地区担负抢救任务的15家重点医院所有防护用品和医疗器械、设备供应。\n\n几十辆军车从不同方向驶抵武汉。\n\n目前，已有中国人民解放军一个防化团（7000余人）开进武汉城区，原解放军三总部三大医院抽调100多人（陆海空三大军种医院400多人）组成的医疗队也分批次到达武汉；陆续出发的上海、四川、重庆等省市的医疗救援队，也会先后到达武汉。\n\n除了传统医疗体系所不具备的模块化、机动化的医疗设备，军事医疗系统的的“体系性介入”，使得大规模、多变的疫情变得不再可怕。\n\n需要指出的是，此次出征的军种里还包括特殊兵种：应对“NBC War”（核生化战争）的防化兵，其特殊的消洗设备、隔离设备、气密设备……基本上可以让病毒无影遁形。\n\n想想看，机动化医疗系统、防化部队、防生化隔离区、随时可以搭建的千人病床野战医院以及专业化的队伍会战武汉高危疫区，处在高光时刻的新型冠状病毒估计也感受到了森森的寒意，更何况后面的黑手呢？\n\n朝鲜和越南战场上占不到的便宜，更不用想在中国本土上心存侥幸。\n\n而且我们的子弟兵们从没让我们失望过。\n\n98年洪水，他们没让我们失望；08年汶川地震，他们没让我们失望；这次也同样也不会让我们失望。\n\n而我们需要做的其实很简单：\n\n小事不出门，外出带口罩；\n\n手勤洗，会不聚；\n\n不恐慌、不信谣；\n\n发自内心地感激一线医务人员，\n\n以及那些身处疫区的英雄。\n\n同时相信祖国，相信政府，相信中国人民解放军。\n\n然后坐等胜利的消息。",
			"added": 1581642982,
			"parent_topic_uri": "1517728147_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz"
		}
	],
	"topic_vote": {
		"1581642983_187PK2SheoUVx6K9AN1QwXrGB7U73CPiAk": 1
	},
	"next_comment_id": 2,
	"comment": {
		"1581642983_187PK2SheoUVx6K9AN1QwXrGB7U73CPiAk": [
			{
				"comment_id": 1,
				"body": "局座张召忠很早就说过，外国人特别是美国人，在改革初期就大量的收集中国人血液，竟然有大量的官员主动配合，大搞免费捐血活动。当时局座他就警告过这些官员，有可能是针对性的生化武器或基因武器。\n在当时看来太过于玄幻，还被人骂被人笑话呢。",
				"added": 1581643141
			}
		]
	},
	"comment_vote": {}
}