{
	"message": [
		{
			"body": "salut ! des listes de zérosites fr actualisées récemment et fréquemment, vous en avez ? merci !",
			"date_added": 1459187091572
		},
		{
			"body": "zarka : ok merci !",
			"date_added": 1459287020369
		},
		{
			"body": "oui je crois que je vais voir ce que je peux contribuer",
			"date_added": 1459287516603
		},
		{
			"body": "@dalboz : oui c'est vrai qu'on se croirait en 1995",
			"date_added": 1459630741019
		},
		{
			"body": "@vixa : haha ! c'était la bonne époque ! ;)",
			"date_added": 1459705329519
		},
		{
			"body": "/me pense que @43110 est un spammeur chinois qui fout la merde un peu partout sur ZeroNet",
			"date_added": 1462803361563
		},
		{
			"body": "@vixa: ça ne marche pas ici non plus",
			"date_added": 1463180241487
		},
		{
			"body": "@vixa: est-ce que Webtorrent fonctionne avec Tor ? Je vais l'essayer aussi…",
			"date_added": 1463221582059
		},
		{
			"body": "@vixa: en ce qui me concerne, ça ne serait pas une bonne idée si et seulement si Webtorrent ne permet pas de fonctionner seulement avec l'adressse .onion et diffuse l'adresse IP réelle (à vérifier)",
			"date_added": 1463226958475
		},
		{
			"body": "@vixa: mais pour ce qui est de l'argument moral (mon utilisation est moins prioritaire que celle du pauvre petit pakistanais) : ça ne colle pas avec moi",
			"date_added": 1463227020324
		},
		{
			"body": "@vixa: depuis quand surcharger une infrastructure ne la fait pas évoluer dans le bon sens, justement ?",
			"date_added": 1463405563586
		},
		{
			"body": "@vixa: parce que ça en revient étrangement au petit paki ton truc pareil",
			"date_added": 1463405638394
		},
		{
			"body": "@vixa: et ça reste en tout cas une rhétorique moraliste",
			"date_added": 1463405715794
		},
		{
			"body": "@vixa: évidemment que je vais faire ce que je veux, y compris infirmer un argumentaire avec lequel je ne suis pas en accord",
			"date_added": 1463421759953
		},
		{
			"body": "@vixa: y compris accaparer la bande passante que le petit jésus aurait voulu que je laisse au pauvre et à l’orphelin",
			"date_added": 1463422658760
		},
		{
			"body": "@openuser montre d'abord ta queue ici et les filles vont affluer dans ton zéromailbox c'est certain",
			"date_added": 1463682481824
		},
		{
			"body": "c'est pas de l'optimisme, c'est de la charité chrétienne…",
			"date_added": 1463685799245
		},
		{
			"body": "j'aurais pu te dire si ta queue vaut la peine que des filles te montrent leurs boules en échange",
			"date_added": 1463685861743
		},
		{
			"body": "car je suis convaincu que c'est ce qui t'empêches de la montrer à tout le monde",
			"date_added": 1463685908905
		},
		{
			"body": "@openuser: ton malheur, mon \"optimisme\" ;)",
			"date_added": 1463686047172
		},
		{
			"body": "@openuser: (re: pas de filles ici)",
			"date_added": 1463686072005
		},
		{
			"body": "openuser: oui et je suis très serrée et très vierge",
			"date_added": 1463686263489
		},
		{
			"body": "@openuser: on est faits l'un pour l'autre",
			"date_added": 1463686325709
		},
		{
			"body": "je suis passé à travers ma boîte de mouchoirs juste à y penser",
			"date_added": 1463686426105
		},
		{
			"body": "je ne suis pas du sexe faible pour rien",
			"date_added": 1463686656505
		},
		{
			"body": "ça me fait chaud à l'utérus",
			"date_added": 1463687075733
		},
		{
			"body": "@openuser: je vais écouter tes trucs on s'en reparle où ? je te suggère de poster qqchose sur ZeroTalk FR",
			"date_added": 1463689610282
		},
		{
			"body": "openuser: c'est où ton blog ?",
			"date_added": 1463689969456
		},
		{
			"body": "et je confirme",
			"date_added": 1463693031057
		},
		{
			"body": "je suis un bot",
			"date_added": 1463693038245
		},
		{
			"body": "ce qui clôt merveilleusement notre conversation sur l'intelligence artificielle qui fera j'en suis certain les annales de cette magnifique discipline de l'esprit",
			"date_added": 1463693122474
		},
		{
			"body": "et moi je parle de queues et de boobs",
			"date_added": 1463693161027
		},
		{
			"body": "oui la petite fille vierge qui a viré nazie : c'est moi!",
			"date_added": 1463693186190
		},
		{
			"body": "vous êtes savoureusement sublimissimes",
			"date_added": 1463693395319
		},
		{
			"body": "t'aimerais trop j'te jure",
			"date_added": 1463693747616
		},
		{
			"body": "/me est très triste que sa subtilité ne soit pas à la hauteur",
			"date_added": 1463694722710
		},
		{
			"body": "à tout de suite dans vos rêves mes bébés xoxoxo",
			"date_added": 1463704473804
		},
		{
			"body": "salut @http : si ton choix s'arrête sur zeronet reviens-nous le dire !",
			"date_added": 1463850272286
		},
		{
			"body": "@zeuss: je seconde @http: tu devrais poster sur ZeroTalk FR (même si c'est long à expliquer): 0net://1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET",
			"date_added": 1464019700989
		},
		{
			"body": "/me veut savoir les précédents comptes zeroid de @zarka000",
			"date_added": 1464027736123
		},
		{
			"body": "@openuser: fait attention à ce que tu dis des québécois, des Xavier Dolan on en a TOUT PLEIN",
			"date_added": 1464027800071
		},
		{
			"body": "@zaeka000: ah d'accord mais pourquoi autant ? c'est un record à ce que je sache :D",
			"date_added": 1464030595724
		},
		{
			"body": "ah hum . et là ça va mieux ? tu as un zerosite quelque part?",
			"date_added": 1464031035518
		},
		{
			"body": "et pourtant, mon petit doigt me dit que tu as des opinions intéressantes…",
			"date_added": 1464031616476
		},
		{
			"body": "tout de même, in mon doigt we trust",
			"date_added": 1464033089535
		},
		{
			"body": "@openuser: tu essaies trop fort d'avoir mon attention c'est mignon: https://soundcloud.com/mstrkrft/party-line",
			"date_added": 1464035280880
		},
		{
			"body": "mon petit doigt est une génie, j'en ai 9 autres aussi",
			"date_added": 1464035454642
		},
		{
			"body": "« we're all in this together… get USED TO IT »",
			"date_added": 1464035491442
		},
		{
			"body": "19 si on compte mes pieds",
			"date_added": 1464035517289
		},
		{
			"body": "les gars vous dites n'importe quoi concernant la sécurité de ZeroNet vs. Freenet: obtenir la clé d'une cible pour l'exploiter n'est ÉVIDEMMENT pas une vulnérabilité. un peu de lecture s'impose, peut-être ?",
			"date_added": 1464266613122
		},
		{
			"body": "bonne idée",
			"date_added": 1464267714323
		},
		{
			"body": "je gagne ma vie avec la programmation depuis les 20 dernières années. toi, à part être vierge, tu étudies quoi à l'école?",
			"date_added": 1464268696993
		},
		{
			"body": "et toujours pas de boobs dans ton inbox ? c'est vraiment incompréhensible ! avoir autant de sex-appeal et se faire ainsi recaler à l'école de la vie ! dans quelle époque vivons-nous ?!!",
			"date_added": 1464269239956
		},
		{
			"body": "/me donne une boîte de mouchoir complète à openuser pour quand il recevra sa première boobpic (peut-être)",
			"date_added": 1464269478764
		},
		{
			"body": "je sais: un designer hétéro obsédé par un contexte social où il n'y a que des gars ? je voulais juste l'aider à trouver la poignée de la porte de son placard.",
			"date_added": 1464269634048
		},
		{
			"body": "c'est mon petit côté charitable",
			"date_added": 1464269668101
		},
		{
			"body": "vite changeons de sujet pour parler de la météo au Canada (facepalm)",
			"date_added": 1464269803979
		},
		{
			"body": "allez je t'aide à te sortir de l'embarras (profites-en): on peut voir des choses que tu as faites en tant que designer quelque part ?",
			"date_added": 1464270182073
		},
		{
			"body": "on voit que mentalement, c'est pas la forme non plus",
			"date_added": 1464270377312
		},
		{
			"body": "Non, tu as dit \"C'est exactement un gros problème dans le design de zeronet\". Ça, c'est n'importe quoi.",
			"date_added": 1464274263735
		},
		{
			"body": "Non, c'est un risque inhérent à tout système d'encryption à paire de clés asymétriques, incluant PGP, ZéroNet, Tor, I2P, et… Freenet. Tous les systèmes de sécurité présentent des risques. Un risque n'est pas une vulnérabilité. Bref, ton argument est erroné à la base, quoi.",
			"date_added": 1464274579002
		},
		{
			"body": "Faux",
			"date_added": 1464274733527
		},
		{
			"body": "O.U.I.",
			"date_added": 1464274763937
		},
		{
			"body": "Dude, c'est ce que signifie \"clé publique\". S'il y a une clé publique, il y a une clé privée. Si la privée tombe entre les mains d'un censeur, c'est terminé pour ton contenu. Dans TOUS les cas.",
			"date_added": 1464274972895
		},
		{
			"body": "Tu ne peux pas comparer un système qui se veut intrinsèquement modifiable par son auteur uniquement (identifié par sa clé privé) avec la partie de Freenet qui concerne le contenu statique immutable.",
			"date_added": 1464275414005
		},
		{
			"body": "Et si tu veux l'équivalent logique d'un CHK tu n'as qu'à faire un zérosite et supprimer la clé privée. Parce qu'une adresse ZéroNet n'est qu'un CHK signé.",
			"date_added": 1464275991243
		},
		{
			"body": "Voilà. Maintenant, va publier du contenu qui serait sujet à la censure sur le web commercial. Et arrête de chialer ! WERK ! ;)",
			"date_added": 1464276648067
		},
		{
			"body": "Et c'est VRAI. Come on!!!!",
			"date_added": 1464276871277
		}
	]
}