{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Docker",
			"body": "1. Кто им пользуется и в каких целях?\n2. Какие возможности используете?\n3. Как долго вы уже им пользуетесь и почему он вас заинтересовал?\n4. Пользовались вы раньше Vagrant и можете ли вы сравнить проблемы?\n5. На сколько серверов вы максимально разворачивали один образ?\n6. Сколько контейнеров максимально приходилось разворачивать на одной машине?\n7. Храните ли вы отдельно такие вещи как кеш, логи, зависимости проекта (например папка vendor, node_modules)?",
			"added": 1521719020
		},
		{
			"topic_id": 2,
			"title": "Децентрализованные или offline ресурсы для специалистов",
			"body": "Я вот подумал, что надо создавать много зайтов з документацией для каждой группы специалистов. Например для PHP - его документация, документация по Yii2, Laravel, Symfony, Doctrine, CodeIgniter... Но это мало кому интерестно, пока нет проблем доступа к Инету. Еще и проблема в том, что мало иметь документацию, надо еще как-то децентрализовано хранить git-репозитории, в которых есть документация или хотя бы необходимые пакеты с репозиториев (composer, npm, pip).\nПолноценный архив для PHP разрабочика должен занимать не меньше 500 МБ при условии что все архивы/пакеты хранятся сжатыми. Зайт, во время доступа к архиву с документацией будет его распаковывать и делать индекс. Для пакета зависимостей нужно делать какую-то надстройку над менеджером пакетов, чтобы он позволял вытягивать его с зайда.\nА еще для разработчику не нужно все ресурсы на все случае жизни, потому что объем скачаных вполне может превисить 100 ГБ. Дисковое пространство не проблема, если у вас есть внешний HDD на 2-3 ТБ но синхронизация этого - ненужные накладные расходы, а во время действительной нужды в этом проблемы со скоростью инета будут. Поэтому нужно разработка своего менежера архивов, который позволят скачивать и синхронизировать то что нужно.\nТакой менеджер архивов уже где-то разрабатывался навернека. Но здесь в первую очередь интерестен сам формат офлайн-архивов, некий archive.json, аналог или расширения content.json в котом сохранены хеш-суммы не только обычных, но и сжатых файлов при этом одной хеш-суммы недостаточно, нужно однозначно идентифицировать файл используя URL обычного иметь возможность обновить во время доступности",
			"added": 1523845744
		}
	],
	"topic_vote": {},
	"next_comment_id": 42,
	"comment": {
		"1_1J97bEwqapAhZf6vaTevvthB5awi7Fi9vS": [
			{
				"comment_id": 1,
				"body": "Срамеры",
				"added": 1521704616
			},
			{
				"comment_id": 11,
				"body": "Убей себя, поросеночек",
				"added": 1521773234
			}
		],
		"1_1HV141A2vZRjYcjAhoGhnmsdD9mfHAAr5e": [
			{
				"comment_id": 2,
				"body": "А что 2-х процентам есть о чем спорить, пока не решен вопрос сменяемости власти?",
				"added": 1521704687
			}
		],
		"2_1Nyvgpgzk7BEEHs1TeTRwAtEDhF2txevSe": [
			{
				"comment_id": 3,
				"body": "Отключения Интернета в РФ и наплыв пользователей сюда выдержит спокойно",
				"added": 1521704778
			}
		],
		"1_1HbEshxJFfPf1ZEqCxBDTbzWuLLhzxRgF8": [
			{
				"comment_id": 4,
				"body": "Фрии Совок Фаундейшн",
				"added": 1521705591
			}
		],
		"1_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT": [
			{
				"comment_id": 5,
				"body": "Это готовились к переизбранию стабильности",
				"added": 1521705970
			}
		],
		"1_1FPE99DFTjYKHk5naTwhJkWhkfzh22SqaL": [
			{
				"comment_id": 6,
				"body": "Созданием аккаунта соцсети в ZeroNET должно быть создание (специального) зайта иначе соцсеть станеть слишком большой",
				"added": 1521706146
			},
			{
				"comment_id": 10,
				"body": "> [balancer73](#comment_315_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): Ну и ZeroNet не может быть «слишком большой» — никто не заставляет грузить все зайты сети :)\nДа, соглашусь, должна быть какая общая база метаданных на одном сайте для поиска. А фотографии, аудио, видео, файлы, страницы и стили будут хранится на пользовательском зайте. Или статически в IPFS, в этом случае база метаданных будет ссылатся сразу на образы зайтов или разделов в IPFS",
				"added": 1521719219
			},
			{
				"comment_id": 37,
				"body": "> [geekless](#comment_39_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): И адрес 1GooUE19488nDwG3TdkM8seYAHct4gjkq4 я могу использовать как зайт (имею от него приватный ключ). Было бы неплохо иметь какие-то RFC на этот счёт — для чего такие адреса-аккаунты использовать, в каком формате там данные размещать.\nДанные пользователя сайта аккаунта соцсети должен хранить и подписывать он сам у себя. Разработчик или распостранитель соцсети не отвечает за данные пользователя, а лишь предлагает обновления (движка) соцсети. Не знаю как там в ZeroMe реализовано, но я так понимаю, они предлагаю скачивать контент некого профайла как опциональный контент зайта ZeroMe?",
				"added": 1522411219
			}
		],
		"6_1J85NgUTG8Kk72Kqdr5D6NRNDauFQUzzkC": [
			{
				"comment_id": 7,
				"body": "Ой, очепятка случилась. И это речь идет менее чем о 5% пользователей сети. Параноики соцсетями не пользуються",
				"added": 1521707407
			},
			{
				"comment_id": 8,
				"body": "Да ладно, всего 6 миллиардов потерял. Это так, оперативные расходы)",
				"added": 1521718603
			},
			{
				"comment_id": 15,
				"body": "> [numberedpwnz2](#comment_6_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT):\"кому же сдалось то, что я пишу в интернете, мне всё равно нечего скрывать!\"\nЯ вот просто не использую соцсети для передачи и сохранения информации, которая мне может навредить. Для этого есть Telegram. Не знаю насколько безопастно использовать Google Drive или Dropbox но если паранойя повышена то всегда можно сохранять там зашифровав.\nНельзя сказать, что мне нечего скрывать, но информация, которую я не афишируют вряд ли может мне как-то серйозно навредить. Для меня это вопрос скорее совести и честности, чтобы скрывать было нечего.",
				"added": 1521939303
			},
			{
				"comment_id": 16,
				"body": "> [anotherneko](#comment_24_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Представляю что будет когда он протечет.\n\nА что должно быть? Пострадають паро сотен или тысяч, потом это расскроется и те, кому это важно, перелезут на другой меседжер",
				"added": 1521977751
			},
			{
				"comment_id": 36,
				"body": "> [mikaela](#comment_1_18NuT9sGnLwZvVnH8X77CEZioXUUezXVTw): А тут получается что фейсбук во всех грехах виноват, а остальные как-бы непричем.\nНужен же козел отпущения. Если бы \"пострадавших\" было 5-500 тысяч то отмазывалось бы приложения",
				"added": 1522410705
			}
		],
		"1_1Lr8RdHxBpY8EWZ6rwD8CvVAaMkg2yGtXf": [
			{
				"comment_id": 9,
				"body": "macOS два года уже. ElementaryOS, Debian, Ubuntu, OpenSUSE перед этим",
				"added": 1521718694
			},
			{
				"comment_id": 13,
				"body": "Пробую щас сервер на CentOS настроить, ничего сложного, обычный linux nginx postgresql php, хочу еще IPFS там использовать для ресурсов. CentOS раньше настраивал, но сейчас хочу sql бекап настроить через IPFS. Архивы можно шифровать",
				"added": 1521841727
			},
			{
				"comment_id": 38,
				"body": "Вот мне интересно зачем люди используют что-то отличное от самого популярного дистрибутива?\nВозможность настройки, нехватка оперативной памяти, расовый нонконформизм....",
				"added": 1522411402
			},
			{
				"comment_id": 40,
				"body": "> [geekless](#comment_46_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Ответы на оба вопроса будут очень похожи.\nМы говорим о разны вещах. Ты - о несовместимы ОСь, а я об бинарно-совеместимых ОСях",
				"added": 1522507922
			}
		],
		"1_1C8aYoko2ccsGN96xqjCYvWV6jvMWbi7bF": [
			{
				"comment_id": 12,
				"body": "> [bakasuicide](#comment_2_1J97bEwqapAhZf6vaTevvthB5awi7Fi9vS): Что это вообще ?\n\nВиртуальная машина, если грубо. А точнее абстракция (API) над средствами виртуализации",
				"added": 1521800217
			},
			{
				"comment_id": 39,
				"body": "> [paps](#comment_4_141e9kefECcifpcxtoyviANQw4fJRfq4jh): Не пользуюсь, ибо говно.\n\nМожете расшифровать, товарищ эксперт?",
				"added": 1522445667
			}
		],
		"2_1J97bEwqapAhZf6vaTevvthB5awi7Fi9vS": [
			{
				"comment_id": 14,
				"body": "А зачем перекидывать файлы больше 2G? Можно заархивировать в томах",
				"added": 1521852967
			}
		],
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 17,
				"body": "Ґанджа",
				"added": 1521979913
			}
		],
		"1_1Dd32hiiWqzaa3mzA21af2VneXPJdzEbRr": [
			{
				"comment_id": 18,
				"body": "Возможно к 2022 ZeroNet будет поддерживать Chrome) Когда/тогда многие вопросы безопастности порешают",
				"added": 1521980021
			}
		],
		"1_1G8pkNe3Znuc2rE4d8JbwfgHWKrvwz4vfk": [
			{
				"comment_id": 19,
				"body": "> [kryonn](#comment_2_1DKmpN6itS4MfRWqY5gfzThAHQHoz1bPXE): Не приятен он мне, в общем-то, как и пхп.\n\nМне вот только в JS асинхронность не нравиться. Не все должно быть асинхронно, а только там, где нужно. Вместо async/await должно быть что-то типа sync/wait",
				"added": 1522041903
			}
		],
		"2_1EzxEUfU6KEQbkdpVqq63MmFq3teXW8T4u": [
			{
				"comment_id": 20,
				"body": "Каждый должен иметь зайт, на который можно оправлять сообщения.",
				"added": 1522042020
			}
		],
		"1_16TWzbp6fnXHRPyS4UdHJPRRdhxr8t4K36": [
			{
				"comment_id": 21,
				"body": "> [bodqhrohro](#comment_1_1EPZvJuUmcnL1Grz7mos34Qs3fXqMrKVck): Во-первых, плагины закапывают только во всяких мейнстримных недобраузерах.\nТы пользователь Eclipse?",
				"added": 1522042225
			},
			{
				"comment_id": 35,
				"body": "> [hikikomori](#comment_2_1FLQiXhoa56vb91aiVxyAiC8L5YJy4W3Hi): http://127.0.0.1:43110/picrandom.bit\nПопробовал поставить лайк https://ipfs.io/ipfs/QmcFdmc7Qgj3BNizLjqp3q29MB49rpXhWfY7f2L8iKtasn",
				"added": 1522064471
			}
		],
		"1_14kxkh1pLNYuCwCZ161HCQkSjvWW29ybNz": [
			{
				"comment_id": 22,
				"body": "Все шлюзы мертвы",
				"added": 1522042498
			},
			{
				"comment_id": 30,
				"body": "Т.е. первая причина по которой блокируют добавляение новых зайтов - это ЦП?\nЯ вот свой зайт хочу распотранить http://127.0.0.1:43110/15R3rJPiVDGzygCYb4AWfc1QjUbdGTLWYm . Буду там что-то делать, может чат) Пока не знаю",
				"added": 1522051361
			},
			{
				"comment_id": 34,
				"body": "> [hikikomori](#comment_4_1FLQiXhoa56vb91aiVxyAiC8L5YJy4W3Hi): Всё верно, никому не хочется рисковать собственной жопой. В суде не объяснишь, что это не ты добавлял и раздавал эти файлы.\nМожет в Украине с этим как-то попроще. Здесь нужно еще где-то засвитится, что бы кто-то оскорбился и накатал донос. В любом случае нужна модерация, если кто новый сайт добавляет. А здесь я вижу модерации нету даже на ZeroTalk",
				"added": 1522063596
			}
		],
		"2_1KP5SiCqVXbaWv4QaVYLVHfcLu3pt37dBs": [
			{
				"comment_id": 23,
				"body": "Если взять топ самых популярный зайтов то можно получить список пиров и посмотреть ближайшие IP. Если я правильно понял вопрос",
				"added": 1522042648
			},
			{
				"comment_id": 31,
				"body": "> [numberedpwnz2](#comment_8_1483jDvDG4NBbDT3ACg9cHXfFJyUEuUGJT): Так в чём тогда смысл 0net\nВ том, что нету единой точки отказа. У тебя всегда есть копия контента и ты автоматически становишся распотранителем",
				"added": 1522052465
			}
		],
		"1_16AFTG7vdicwJbRQpWc2F9BRHTE5MTftE7": [
			{
				"comment_id": 24,
				"body": "> [snuff](#comment_1_1sAduYG99cFu5yvx5MubX65imDSriY5re): напишу чего мне лично хотелось бы видеть в зеронет\nНо зачем? Это есть и в белой сети навалом. Флибуста могла бы быть полезной на случай ядерной войны или отключения РФ от Интернета",
				"added": 1522042783
			}
		],
		"1_12TrG3aMsHiPAsfJ65vg4TKUnCpFpHMF1b": [
			{
				"comment_id": 25,
				"body": "> [zerro](#comment_36_17eKk6mdR7bth2Fi8f74P5JV8AfHsERT4F): Там в контекстном меню есть пункт Delete\n\nЭто неудобно. Добавили бы крестик чтобы сразу удаляло. Или были бы какие-то настройки, в которых можно было бы указать что редко посещаемые и слишком большие зайты удалять",
				"added": 1522042933
			}
		],
		"1_1FWXtZ9nzxnX4VDFkFzmKik6ptAjMQxbH": [
			{
				"comment_id": 26,
				"body": "Без оригинальной полезной идее за которую готовы платить начить бизнес не вижу смысла не имея возможности вкладывать большие стартовые деньги. В случае с оригинальной идеет инвесторов можно найти",
				"added": 1522043119
			}
		],
		"1_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j": [
			{
				"comment_id": 27,
				"body": "> [zxmaster](#comment_6_1HfVavnWvCfuS2JcZBnw8DaTWckz8QBz5j): PHP - был неплохой технологией пока вдруг на нем не начали пилить всё что мыслимо и не мыслимо.\nЧего? Из него сделали полноценный enterprise-язык. А то что из-за низкого порога вхождения тут водяться всякие недопрограммисты - это уже другая история. С JS же аналогично, только там махин на коленке создают",
				"added": 1522043401
			},
			{
				"comment_id": 41,
				"body": "Посмотрела я на php-ast и понял, что PHP для функционального программирования не годится",
				"added": 1523843908
			}
		],
		"1_12ahUHySC6HRunXXb1egDiT4BYbBDP8tFc": [
			{
				"comment_id": 28,
				"body": "> [balancer73](#comment_229_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw): а вот ссылку на полноразмер ставлю уже в IPFS через свой гейт.\nВот только смысла особо то нет. Один с двухсот пользователей скопирует хеш и загрузит через ipfs add в лучшем случае. Вот если бы ZeroNet из коробки поддерживал загрузку IPFS файлов по хешу - вот тогда другое дело",
				"added": 1522043757
			},
			{
				"comment_id": 29,
				"body": "> [anotherneko](#comment_25_1LvGFs28pbTRSvaM94DNRK1z1Z6CaoAFZ7): Так сделали же в зеронете поддержку опционального контента и больших файлов уже.\n\nА можно ссылку?",
				"added": 1522050739
			},
			{
				"comment_id": 32,
				"body": "> [dude](#comment_50_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): optional/bigfiles умеют дедупликацию?\nЧто это?",
				"added": 1522053005
			},
			{
				"comment_id": 33,
				"body": "> [dude](#comment_52_1APx2pf1wNGFz4mWCN2sFzrtTGzrLKZUQ2): Для нежелающих гуглить\n\nТак зачем новое слово придумывать? Адрес файла создается на основании его хеша",
				"added": 1522053290
			}
		]
	},
	"comment_vote": {}
}