{
	"next_topic_id": 19,
	"topic": [
		{
			"topic_id": 1565933359,
			"title": "Niggers are gay",
			"body": "Niggers like to fuck each other in the ass like their closely related monkey counterparts. They just fuck everything they see in the ass while making monkey noises and not having a functioning brain.",
			"added": 1565933358
		},
		{
			"topic_id": 1565933711,
			"title": "Dear white people",
			"body": "You guys are racist bigots and I cannot believe all of the far right nazi extremism I see on this board. Why do you guys not use proper pronouns for transgender people? I can not stand all of your microaggressions when you talk to people. Why won't you pay a reparations tax to minorities? Minorities have had a difficult struggle and white people are guilty and must pay for their guilt.",
			"added": 1565933709
		},
		{
			"topic_id": 1568561319,
			"title": "Storm the NSA HQ on Area 51 raid",
			"body": "They are going to be focused on guarding area 51 so easy raid and steal their equipment and repurpose it.",
			"added": 1568561316
		},
		{
			"topic_id": 1568745636,
			"title": "How to mute people",
			"body": "Remind me. I forgot.",
			"added": 1568745632
		},
		{
			"topic_id": 1570425422,
			"title": "tor glowing?",
			"body": "What do you guys think?\nhttps://www.documentcloud.org/public/search/projectid:37206-The-Tor-Files-Transparency-for-the-Dark-Web",
			"added": 1570425417
		},
		{
			"topic_id": 1570980089,
			"title": "Does the onionshare board on 08chan have cp",
			"body": "I will blacklist it if it does.",
			"added": 1570980083
		},
		{
			"topic_id": 1573710597,
			"title": "I believe I found a vulnerability to bypass the post limit",
			"body": "I have been gone for a while due to me reaching my posting limit and my messages not going through on zeromail. (Or maybe they did and this thread is pointless and I apologize to nofish for spamming him on zeromail.) I was at 49.9k and I liked a few posts and ended up exceeding my post limit. It was then raised to 100k. I think it may be a cause or it may not be.",
			"added": 1573710590
		},
		{
			"topic_id": 1574129941,
			"title": "For the people that hate niggers",
			"body": "http://www.niggermania.net/forum/\nThis is a forum made for people just like you where you can talk about niggers. It is way better than zerotalk and you should check it out.",
			"added": 1574129933
		},
		{
			"topic_id": 1575691820,
			"title": "Add a persian forum",
			"body": "I see that zerotalk lacks a persian forum.",
			"added": 1575691811
		},
		{
			"topic_id": 1576429351,
			"title": "How do I upload folders to gitcenter and delete files",
			"body": "Does anyone know?",
			"added": 1576429341
		},
		{
			"topic_id": 1578538583,
			"title": "How to get Zeronet working on android without apk",
			"body": "First you have to install a terminal emulator like termux: termux.com\n\nNext you install python by typing: pkg install python3 \n\nThen type: git clone https://github.com/HelloZeroNet/ZeroNet.git\n\nThen: cd /sdcard/ZeroNet\n\nThen: pip3 install requirements.txt\n(Type individually if doesn't work)\n\nThen: python3 zeronet.py",
			"added": 1578538572
		},
		{
			"topic_id": 1586288287,
			"title": "CIA, MOSSAD, ZIONIST ARE GENTICALLY ENGINEERING US TO BE WEAK BEFORE WE ARE BORN",
			"body": "WAKE UP PEOPLE AND REALIZE THE TRUTH. THEY INJECT US WITH DNA ALTERING SUBSTANCES AND CAUSE US TO MUTATE INTO WEAK AND STUPID. THIS IS ALL ORCESTRATED BY CIA, MOSSAD, ZIONIST.\n\n(I may need to make an account called thetruth2)",
			"added": 1586288274
		},
		{
			"topic_id": 1587107506,
			"title": "Controlled Oposition Shills On ZeroNet",
			"body": "I would like to talk about the people on here that buy into controlled opposition narratives like @thetruth. They buy into narratives created by the politically connected and elites of this world so other people see anyone who questions there agendas and narratives as \"conspiracy theorist\", \"lunatic, and you can list the rest. No, you don't have to believe that dinosaurs are fake, the Earth is flat, microwaves control our brains, CIA,MOSSAD,ZIONIST is (fill in some shit here), Jewish reptiles genetically engineered humans to make them slaves, etc. to believe alternative narratives and to try and find the truth. All you guys are doing is supporting the very people you claim to fight against by believing any bullshit you see.",
			"added": 1587107492
		},
		{
			"topic_id": 1597034762,
			"title": "THE TRUTH OF COVID DEATHS",
			"body": "Wake up, the virus and all viruses are FAKE. This is all a plot by MOSSAD. MOSSAD Sneaks to people and controls their minds with 5g waves then injects them with a vaccine that is the REAL cause of deaths. Your brains are being controlled by the 5g waves and you guys must wake up. \n\n(Someone actually take seriously. The secret to detox from the vaccine is to inhale bleach.)\n\n(Natural Selection is a theory that may be seen in action on this post.)",
			"added": 1597034747
		},
		{
			"topic_id": 1603253044,
			"title": "Idea Proposal: Code Library Folder And Standard Zite Translation System",
			"body": "I think having a folder in the ZeroNet directory that would allow zites to share code between each other (example: frameworks that multiple zites may use) and also having a standard comment translation system that can be toggled on and off that will translate comments on sites in other languages to the native language of the user.",
			"added": 1603253028
		},
		{
			"topic_id": 1608100813,
			"title": "How to run tor on zeronet android",
			"body": "No tor config or unknown where it is. Now how would one go about finding a solution for this?",
			"added": 1608100796
		},
		{
			"topic_id": 1612390130,
			"title": "Out of Storage",
			"body": "Can't create id on kxo because libeay32 not found",
			"added": 1612390112
		}
	],
	"topic_vote": {
		"1566570350_1Dssbq2y2JDD14aojGG9RX3d5EPpw6zQxM": 1,
		"1550241221_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1566448853_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": 1,
		"1569339504_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1576265919_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1577754529_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578131377_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"1579113760_1sQE8j9Sb9fc6uqoPqyqgEXJVnVN3xXL8": 1,
		"1581971707_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1584706305_1CpcxT1xWtqTRZTRR1KnH8gGsY2i4rJ7du": 1,
		"1589041690_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": 1,
		"1590376016_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"1598404536_1A67pkZNx64w3sii9TAUCdJhRsFowGpYrY": 1,
		"1600215526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1586632143_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1601641777_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1607556822_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1607775553_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": 1,
		"1608588854_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1610507385_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"1610420274_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1611308558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1611397178_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1611411500_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": 1,
		"1612099044_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1612217578_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1
	},
	"next_comment_id": 814,
	"comment": {
		"1565185775_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": [
			{
				"comment_id": 1,
				"body": "I remember on tor many of the site owners would threaten to castrate and burn pedophiles. There were ant-paedophilia sites and one guy even social engineered a few pedophiles into giving him personally identifying information that he posted on a tor site for everyone to see.",
				"added": 1565324445
			},
			{
				"comment_id": 2,
				"body": "The funny thing was that the FBI was the one that ran a lot of the larger sites.",
				"added": 1565324709
			},
			{
				"comment_id": 3,
				"body": "There were already pedos on 08chan. They had there own forum. I deleted it from my device and never opened it. We should start an anti-pedo action movement.",
				"added": 1565325249
			}
		],
		"1565305639_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 4,
				"body": "I apologize. My experience comes from freenet and tor. I was discussing the ban of 8chan on a matrix server with some people. Some guy linked to 08chan and I knew about the existence of zeronet but only installed it and never used it. I decided it might be a good time to give it a try and now I am here.",
				"added": 1565325993
			},
			{
				"comment_id": 5,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_685_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): how's freenet i heard some good.\n\nIt is just static websites and it has a high latency. It is very secure though and they have an option to only connect to trusted peers. Files that you seed are encrypted on your device.",
				"added": 1565326166
			},
			{
				"comment_id": 6,
				"body": "I understand your frustration though. A lot of these people probably don't even know shit about p2p networks, the internet, or cryptography. They probably installed Google chrome on their windows 10 laptop and go on the internet to blame Jews and the niggers for them being complete failures.",
				"added": 1565326460
			},
			{
				"comment_id": 9,
				"body": "Agreed. A bunch of socialist idiots.",
				"added": 1565326770
			}
		],
		"1565321266_1LT3fcyEShsU9E1H5wiBceWmEpU6LcK7v": [
			{
				"comment_id": 7,
				"body": "Delete the CPU forum from your drive so you don't help the pedo niggers and receive a no knock raid.",
				"added": 1565326643
			},
			{
				"comment_id": 8,
				"body": "cp forum*",
				"added": 1565326666
			},
			{
				"comment_id": 78,
				"body": "What if we built a system like the recaptcha on the clearnet but for this? You could also try setting a post limit that triggers a cooldown for certain ids that happen to be spamming.",
				"added": 1567127967
			},
			{
				"comment_id": 79,
				"body": "Make the captcha decent yoo.",
				"added": 1567128044
			}
		],
		"1565354906_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 10,
				"body": "My ip address was revealed on the surface web anyway.",
				"added": 1565375930
			},
			{
				"comment_id": 22,
				"body": "Let's see those nigger jounos doxx us.",
				"added": 1565484686
			},
			{
				"comment_id": 23,
				"body": "*journos",
				"added": 1565484699
			}
		],
		"1565463652_15SUXePqGofTgevJbv9FAJequ5TxKkBMMM": [
			{
				"comment_id": 11,
				"body": "Clintons",
				"added": 1565475604
			},
			{
				"comment_id": 12,
				"body": "Pizzagate was actually real.",
				"added": 1565475636
			},
			{
				"comment_id": 13,
				"body": "Could have been any politician involved but my bets are on Clintons.",
				"added": 1565475700
			},
			{
				"comment_id": 14,
				"body": "They aren't even able to just call us conspiracy theorists and ignore everything we say this time.",
				"added": 1565475905
			},
			{
				"comment_id": 15,
				"body": "Doubt it",
				"added": 1565476556
			}
		],
		"1565411595_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": [
			{
				"comment_id": 16,
				"body": "Tf2 is better than overwatch",
				"added": 1565477042
			},
			{
				"comment_id": 17,
				"body": "> [manifesto](#comment_1_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT): .\n\nThe Quake Mod?",
				"added": 1565477078
			}
		],
		"1565476547_14E1JL1vsL8CRFjwbrXsXfQ1FFvxp36c1Z": [
			{
				"comment_id": 18,
				"body": "Retard spotted. Click that link if you want to prove you are the larger retard.",
				"added": 1565484407
			},
			{
				"comment_id": 19,
				"body": "Also club seventeen sounds a little cpish",
				"added": 1565484462
			},
			{
				"comment_id": 33,
				"body": "You clicked it?",
				"added": 1565491257
			},
			{
				"comment_id": 34,
				"body": "I say we ddos him but his site is probably still covered by cloudflare.",
				"added": 1565493304
			}
		],
		"1565204231_1AM6ZY48ErJLzU89E7wPVjxoqyWuFnk33o": [
			{
				"comment_id": 20,
				"body": "Because god is an illusion that you believe in.",
				"added": 1565484522
			},
			{
				"comment_id": 21,
				"body": "Lol. Keep getting your information from ancient fanfiction fairytales.",
				"added": 1565484645
			},
			{
				"comment_id": 27,
				"body": "Logic",
				"added": 1565486776
			},
			{
				"comment_id": 28,
				"body": "Objective reality and logic is where math comes from.",
				"added": 1565487003
			},
			{
				"comment_id": 29,
				"body": "Amd then god said 2+2=5 and 2+2=5",
				"added": 1565487147
			},
			{
				"comment_id": 30,
				"body": "I am demonstrating how god didn't create math even if we ignore all other points of god not existing. !! + !! Two sticks can not equal !!!!! Five sticks just because a 'higher power' said. Super naturality is false.",
				"added": 1565487652
			},
			{
				"comment_id": 35,
				"body": "Lie. I never said I had a conception of god in the first place. Quit twisting my words and learn science.",
				"added": 1565495207
			},
			{
				"comment_id": 105,
				"body": "Don't necro this tard",
				"added": 1568339412
			},
			{
				"comment_id": 166,
				"body": "> [aspidochelone](#comment_57_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): But just exactly WHO made it so two sticks and two sticks equal four sticks?  Where did logic come from?  Where did natural law come from?\n\nJust saw this comment. Do you even have a fucking brain? You don't need a higher being to make objective reality exist. I pushed a faggot of two and another faggot of two together so now there is a faggot of four. That is just reality. A higher being doesn't say there are four.",
				"added": 1571001913
			}
		],
		"1565463702_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": [
			{
				"comment_id": 24,
				"body": "I wish I could tell you but I mainly play 1.8",
				"added": 1565484752
			}
		],
		"1565449551_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 25,
				"body": "I know. I kind of arrived with them but still.",
				"added": 1565485041
			},
			{
				"comment_id": 32,
				"body": "You know why they are here, right? Try being nice to the manifesto guy and make hime look foreward to life.",
				"added": 1565491039
			},
			{
				"comment_id": 36,
				"body": "Yeah like wondering why the pseudo-existant skyman punishes us is more important than helping someone find a girlfriend.",
				"added": 1565495444
			},
			{
				"comment_id": 37,
				"body": "Also quit twisting my words",
				"added": 1565495464
			},
			{
				"comment_id": 38,
				"body": "I would rather not have a girlfriend than stick my dick in a creationist.",
				"added": 1565500490
			}
		],
		"1565329400_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": [
			{
				"comment_id": 26,
				"body": "So you glow like the noble gas?",
				"added": 1565485103
			}
		],
		"1565484642_136fTH3F2Y41FnDXJPpThYqi9uFwRzDyeT": [
			{
				"comment_id": 31,
				"body": "think about things that you enjoy in life and if you can't then try to figure out a non-coercive and non-violent hobby that may interest you. You have the choice to decide what that is for yourself. Also try to find a job that you enjoy. :)",
				"added": 1565490229
			}
		],
		"1565493657_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 39,
				"body": "This is the same logic that muzzies have that causes them to start grooming gangs.",
				"added": 1565507475
			}
		],
		"1565507663_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 40,
				"body": "We shall see if you are correct tommorow",
				"added": 1565507741
			},
			{
				"comment_id": 41,
				"body": "Any chance you could link your sources?",
				"added": 1565507798
			},
			{
				"comment_id": 42,
				"body": "I am not saying I don't believe you; I would just like to see for myself.",
				"added": 1565507890
			},
			{
				"comment_id": 46,
				"body": "Nothing has happened.",
				"added": 1565566147
			},
			{
				"comment_id": 47,
				"body": "Gg, so this information came from watching the simpsons and cherry picking numbers?",
				"added": 1565584985
			},
			{
				"comment_id": 49,
				"body": "Want to pick another date?",
				"added": 1565645040
			}
		],
		"1565245850_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn": [
			{
				"comment_id": 43,
				"body": "No, you will have to jailbreak.",
				"added": 1565539609
			},
			{
				"comment_id": 44,
				"body": "> [madiator2011game](#comment_9_1DSKrukt2XkjBwy7bCdqsHpgeSiF8DoaRn): Do you have alternative? Android = Google, iOS = Apple . BTW I'm not Apples fanboy, all systems have their flaws. Only hope is Librem 5 but it's not out yet.\n\nPrivacytools.io lists out some other operating systems.",
				"added": 1565539701
			},
			{
				"comment_id": 45,
				"body": "They don't have much success though.",
				"added": 1565539726
			}
		],
		"1565549694_1GUhkGiS4PmRreV33ddFfEMqfdgjJGpn9Y": [
			{
				"comment_id": 48,
				"body": "> [steeljacket](#comment_15_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a): It might be a poor strategic move for the left and big tech to cause everyone to move to zeronet before the 2020 election. They're lucky this doesn't run on phones...\n\nIt does. I am connecting on my SamSung right now.",
				"added": 1565585677
			}
		],
		"1565638982_1Hb5zuymuNq9rhYhhoYuAPGMXpxsp27Ror": [
			{
				"comment_id": 50,
				"body": "The labor theory of value is false. Value is a subjective decision that is made by the parties involved in the trade. Someone may make less and work harder because their labor or the product they are producing has a lower demand. If they are being underpayed, a competing comapany will appear that will offer them a better wage. The only reason this doesn't happen is due to central planning and government restrictions that make it hard for competitors to appear. What we need is more capitalism, not less.",
				"added": 1565645349
			},
			{
				"comment_id": 51,
				"body": "I recommend shopping at local bussinesses that are able to care more about their employees and customers and that you should avoid shopping at starbucks if you don't like this deal. Starbucks coffee is shit anyway.",
				"added": 1565645475
			},
			{
				"comment_id": 52,
				"body": "Only their cold coffees that you get at gas stations are good.",
				"added": 1565645505
			}
		],
		"1565868212_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 53,
				"body": "> [theosis](#comment_50_149W17bFN1NbQou6iE81Uq2b8wEvyqwUV1): Atheists should be hanged.\n\nHave to hang them because you can't refute them. Lol creationists resort to violence because they can't argue.",
				"added": 1565903529
			}
		],
		"1565913377_17dcwh1uMFnDMZK8X5XHciXFggdxVXqfSD": [
			{
				"comment_id": 54,
				"body": "Get the fuck out of here pedo.",
				"added": 1565931914
			},
			{
				"comment_id": 55,
				"body": "> [xlk](#comment_54_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp): I think the argument is the females shouldn't be the ones deciding their life partners. They should be married off before they begin having sexual relationships to prevent their promiscuity. It's what Muslims do and what our ancestors did. I mean, it works. Is it moral? I don't know. I am pretty selfish and probably am not a going to offer an unbiased response.\n\nYou want involuntary marriages arranged for little kids at a young age. Just because muslims do it does not make it justified. This might as well be considered rape.",
				"added": 1565932191
			}
		],
		"1565920396_1H79P7Dn1eqyVFFhsPux4ZyApMuhzhwXCS": [
			{
				"comment_id": 56,
				"body": "> [joalmo](#comment_24_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL): This post glows in the dark.\n\nHe may be a glow in the dark",
				"added": 1565932726
			}
		],
		"1565933711_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 57,
				"body": "You all are privelaged misoginists.",
				"added": 1565933753
			}
		],
		"1565933359_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 58,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_759_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): feel free to stop spamming your psychotic episodes. Nobody gives a Fuck.\n\nnigger",
				"added": 1565980334
			}
		],
		"1565910085_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": [
			{
				"comment_id": 59,
				"body": "Ok, this is too edgy.",
				"added": 1566010375
			}
		],
		"1550241221_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 60,
				"body": "This is cool",
				"added": 1566713482
			}
		],
		"1566704216_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 61,
				"body": "Sounds like almost every government.",
				"added": 1566714307
			},
			{
				"comment_id": 62,
				"body": "US won't list because it is what they do also.",
				"added": 1566714356
			}
		],
		"1566671185_1GFU4qAMTFnQJ7W7r98Zj2xJWq1evoN7Fz": [
			{
				"comment_id": 63,
				"body": "> [anshorei](#comment_35_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): I haven't been able to read all of it yet, but so far it's been very interesting and I look forward to reading the rest and responding.\n\nDon't bother. Guy is tard.",
				"added": 1566715149
			},
			{
				"comment_id": 64,
				"body": "He is mad at how free software promotes individualism.",
				"added": 1566715194
			}
		],
		"1566434182_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": [
			{
				"comment_id": 65,
				"body": "The government working those networks would be worse. You would be giving power to one entity instead of like 6.",
				"added": 1566715478
			}
		],
		"1566561045_1LY5ktNt4cbk2ofd1X3KLP6gx3MGopPaQH": [
			{
				"comment_id": 66,
				"body": "//I typically \nprint('fuck niggers')\n// Instead of hello world",
				"added": 1566715605
			}
		],
		"1566342722_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn": [
			{
				"comment_id": 67,
				"body": "Most seemed reasonable to me.",
				"added": 1566716364
			}
		],
		"1566012765_1Mn4SpXCYTbc1j1fzSz2YgiXy8ue4XhJ4R": [
			{
				"comment_id": 68,
				"body": "Can the pedos get out of here already?",
				"added": 1566716974
			}
		],
		"1566146346_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": [
			{
				"comment_id": 69,
				"body": "> [bitwolf](#comment_28_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu): Stop bitching on the internet (or ZeroNet, or any net) about me having a drink, it only shows that you can't handle your own shit so you have to make yourself feel good about yourself by getting all up in my shit... seriously, that's psychology 101, those who need to tell others how to live and what to do, only go there because they can't control their own lives so they have to try a weak attempt at controlling others' lives.\n\nFuck yeah! Well said",
				"added": 1566717422
			}
		],
		"1566749586_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 70,
				"body": "http://127.0.0.1:43110/NewGFWTalk.bit\n\nThe Chinese are here",
				"added": 1566760536
			},
			{
				"comment_id": 71,
				"body": "NVM. Forum is dead",
				"added": 1566760572
			},
			{
				"comment_id": 72,
				"body": "They probably won't be here. Not secure enough.",
				"added": 1566760620
			}
		],
		"1566796194_1PeZW92EEP6UvxaSbL3cLMRPSG4agoiFTq": [
			{
				"comment_id": 73,
				"body": "I would buy higher",
				"added": 1566845574
			}
		],
		"1566725876_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": [
			{
				"comment_id": 74,
				"body": "> [znnex](#comment_51_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ): But what if it becomes cheaper than actual toilet paper? :)\n\nThat happened in Venezuela. I don't see it happening in the US or EU becsuse they will probably go digital before then.",
				"added": 1566872469
			}
		],
		"1566919824_1NTzrNqTPmBWChMJhhiPNZFh3FR1Yo7tx5": [
			{
				"comment_id": 75,
				"body": "How do I mute this guy?",
				"added": 1566931062
			}
		],
		"1567079528_17EbpUZgWWK4fHVsp4fPuTphiBkSZ16cZu": [
			{
				"comment_id": 76,
				"body": "Lol! You called for an admin on this site?",
				"added": 1567104443
			},
			{
				"comment_id": 77,
				"body": "Lol! You called for an admin on this site?",
				"added": 1567104461
			}
		],
		"1567114756_1N2qEDMQmLEuDo7QwvPvHMRmS69LMViDUf": [
			{
				"comment_id": 80,
				"body": "\"git push\" doesn't work? Shit",
				"added": 1567132349
			},
			{
				"comment_id": 81,
				"body": "Make sure you are signed in with zero id",
				"added": 1567132377
			}
		],
		"1567252251_13Azsbvu9LH6rFLn5dUE7DEuRTQ59bYt9H": [
			{
				"comment_id": 82,
				"body": "I don't miss him.",
				"added": 1567273218
			},
			{
				"comment_id": 83,
				"body": "He rage quit zeronet",
				"added": 1567273255
			}
		],
		"1567248587_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 84,
				"body": "Now he's a rapist. What the fuck. This is like 1984.",
				"added": 1567273370
			}
		],
		"1567295174_1B8Nj3YZQSgw2aqhrHof5w73RpP6Xk2a7W": [
			{
				"comment_id": 85,
				"body": "> [kidcourageous](#comment_79_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6): The Temple OS guy?\n\nYes MIT nigger. He is the smartest fucking programmer alive.",
				"added": 1567364754
			},
			{
				"comment_id": 87,
				"body": "Having seen enough that suggests he is a glow in the dark.",
				"added": 1567376526
			}
		],
		"1567266468_15rMfe5FVSWwMffJvTpBUq9dFiLQPNxkuU": [
			{
				"comment_id": 86,
				"body": "If anyone accepts this horrible deal then they get what they deserve.",
				"added": 1567367190
			}
		],
		"1567541468_1FgxurbLKzsfP2arYX7xVG4akjCdMs3uEQ": [
			{
				"comment_id": 88,
				"body": "How about you do something that doesn't involve harming someone. Sell drugs or something.",
				"added": 1567622772
			}
		],
		"1567657210_1LMHSz6pwoimKuAr4MC57yhRLAQYFzRVwD": [
			{
				"comment_id": 89,
				"body": "Someone is a fanatic of the cult.",
				"added": 1567743564
			},
			{
				"comment_id": 90,
				"body": "Laws are just nonsense scribbled on a piece of paper by some stupid narcisistic sociopathic boomer who can't get a real job.",
				"added": 1567743663
			}
		],
		"1567571648_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 91,
				"body": "People already have and they won't be targeted. It is an attempt to silence opposition. Not controlled outlets.",
				"added": 1567744087
			}
		],
		"1567661456_1JyZMdd3V3by1dd9xwU1jyUsHgbPKzBxrH": [
			{
				"comment_id": 92,
				"body": "This joke was funny the first time...",
				"added": 1567744300
			}
		],
		"1567646630_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 93,
				"body": "Join fnet@chat.404.city on xmpp.\nIt is a project that is working to completely decentralize the internet. They are even planning on a way to decentralize the isp service which will pretty much allow you to be your own isp. It hasn't been developed yet so you can help with the development if you want.",
				"added": 1567744970
			},
			{
				"comment_id": 94,
				"body": "That is just the discussion board. Not the project.",
				"added": 1567745138
			}
		],
		"1567411647_16RcTW38vqF9GVrVMxJimcmbYRNu1gEgqZ": [
			{
				"comment_id": 95,
				"body": "Definently",
				"added": 1567778949
			}
		],
		"1567774655_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 96,
				"body": "Good to know how to when I start making sites",
				"added": 1567795586
			}
		],
		"1567878918_114mSgWDZpRknb492fpx91DL6jSNgRRXba": [
			{
				"comment_id": 97,
				"body": "Call his cell phone service and pretend to be him and you can social engineer them into loading his phone number onto your phone. You can then probably hack into a lot of his social media accpunts.",
				"added": 1567879708
			},
			{
				"comment_id": 98,
				"body": "Wouldn't recommend it though",
				"added": 1567879747
			}
		],
		"1567750015_12XcKUGvjkDZ5ufLFESyYLYXgELagrHyxz": [
			{
				"comment_id": 99,
				"body": "You know that you can block ids",
				"added": 1567963579
			}
		],
		"1568002955_1D6UcmziWg55aXV6TnCksXpjsFJ4gDK6Kw": [
			{
				"comment_id": 100,
				"body": "Grow it. \n\nhttps://thethirdwave.co/psychedelics/shrooms/grow-psilocybin-mushrooms/",
				"added": 1568004902
			}
		],
		"1568070326_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 101,
				"body": "It uses the same cryptography method with the public and private key.",
				"added": 1568074052
			}
		],
		"1568042910_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 102,
				"body": "https://developer.apple.com/testflight/\n\nThis?",
				"added": 1568074125
			},
			{
				"comment_id": 701,
				"body": "What happened to kidcouragious anyway? I remembered he was discussing having a muslim guy that raped another muslim guys (he obviously didn't pick up that detail or he would say that sand niggers are savages that he doesn't care about him and his girlfriend) girlfriend in germany assassinated and haven't seen him since. Maybe that was a glowie that lured him into giving a bunch of personal information.",
				"added": 1606284265
			}
		],
		"1568062329_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 103,
				"body": "Lol",
				"added": 1568074202
			}
		],
		"1568027367_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 104,
				"body": "I think that we should be a forum or message board for technical conversations.",
				"added": 1568074326
			}
		],
		"1568371604_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 106,
				"body": "It was tax free already.",
				"added": 1568400028
			},
			{
				"comment_id": 107,
				"body": "They can't trace it so don't bother with reporting it in the first place.",
				"added": 1568400090
			}
		],
		"1568342293_1DtDb2LXvnxGVkpuNv9CEeBnpcB6sqTZb1": [
			{
				"comment_id": 108,
				"body": "Please tell me that piracyisacrime glownigger is gone.",
				"added": 1568431365
			}
		],
		"1509649171_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": [
			{
				"comment_id": 109,
				"body": "Private repositories were added? This is a big plus.",
				"added": 1568438392
			}
		],
		"1568403975_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 110,
				"body": "They want a centralized digital currency that they control.",
				"added": 1568438456
			}
		],
		"1568479915_116GwtLxi8HFbD3HTVWHHbW5fa1R7sSRQT": [
			{
				"comment_id": 111,
				"body": "http://127.0.0.1:43110/0play.bit",
				"added": 1568483945
			}
		],
		"1568099157_1Ai5o3Y7Lpn5VZt9thmATzMwqYa1D4qRam": [
			{
				"comment_id": 112,
				"body": "You are going to have to wait.",
				"added": 1568561373
			}
		],
		"1568562647_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 113,
				"body": "Is it open source?",
				"added": 1568562596
			}
		],
		"1568598141_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 114,
				"body": "I tell people that try to convert me to their religions to fuck off.",
				"added": 1568612976
			},
			{
				"comment_id": 120,
				"body": "@littlepaw\nThe fuckers will keep ringing until you answer. You have to tell them to fuck off.",
				"added": 1568917205
			}
		],
		"1568744034_18oN5jkSiB1SLb4Jywb4ZnKiwXqtQN5Fau": [
			{
				"comment_id": 115,
				"body": "What is the cypher for?",
				"added": 1568745483
			},
			{
				"comment_id": 116,
				"body": "How the fuck do I mute this guy?",
				"added": 1568745752
			}
		],
		"1568856272_1MfahbRQx2DvKRccN57nhFZvYmfirQfZeX": [
			{
				"comment_id": 117,
				"body": "Get some people to view the site and download it.",
				"added": 1568865476
			}
		],
		"1568832207_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": [
			{
				"comment_id": 118,
				"body": "They post them on facebook and instagram then other sites the elites don't like are blamed.",
				"added": 1568865604
			}
		],
		"1568748111_149JsPomUWvpfHqaAPPZhdxu24FGnKVnCg": [
			{
				"comment_id": 119,
				"body": "Give me the fucking bitcoin first then we can talk.",
				"added": 1568917135
			}
		],
		"1569015162_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J": [
			{
				"comment_id": 121,
				"body": "A lot of them are on gitcenter",
				"added": 1569024749
			}
		],
		"1568774393_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 122,
				"body": "> [applebrainz](#comment_3_1QKBw5pHsSUokVZXrvLmo4PiPytto86CMu): Kinda freaking out.  found cp by mistake on 0chan porn, and now im terrified.\n\nBlock the users id",
				"added": 1569024901
			}
		],
		"1569089727_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 123,
				"body": "I fucking agree. Fuck light themes. They hurt my fucking eyes.",
				"added": 1569128437
			},
			{
				"comment_id": 124,
				"body": "I fucking agree. Fuck light themes. They hurt my fucking eyes.",
				"added": 1569128478
			},
			{
				"comment_id": 125,
				"body": "> [gitcenter](#comment_1084_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di): Right, the classic white-on-black is awful. Using a bit darker white and a bit lighter (and probably more blue or yellow) black improves the situation. I'd advise you to enable dark theme on ZeroNet and check how ZeroTalk looks.\n\nHow do I do that?",
				"added": 1569163160
			},
			{
				"comment_id": 126,
				"body": "Thank you. This shit was hurting my eyes.",
				"added": 1569165340
			}
		],
		"1569165906_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 127,
				"body": "Tic Tak Toe will allways end in a draw if both players are thinking.",
				"added": 1569261670
			}
		],
		"1569269870_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 128,
				"body": "The fucking suburbs are filled with nutjobs that have no life and they aren't happy unless if other people are miserable like them. They can't worry about themselves and have to be fucking nosy with other people. They are also fucking snitches.",
				"added": 1569523247
			}
		],
		"1569552691_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": [
			{
				"comment_id": 129,
				"body": "Yes",
				"added": 1569633965
			}
		],
		"1569608915_1DYjydooxz1SvF5Dhg9hqKdoYF32thMCM3": [
			{
				"comment_id": 130,
				"body": "High chance. I think I have seen a few people.",
				"added": 1569634123
			}
		],
		"1569697321_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 131,
				"body": "ðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘ŒðŸ‘Œ",
				"added": 1569704655
			}
		],
		"1570070514_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 132,
				"body": "I am guessing op is a troll or a glownigger.",
				"added": 1570077095
			}
		],
		"1570072681_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": [
			{
				"comment_id": 133,
				"body": "Most devs are using python3 anyway",
				"added": 1570077312
			}
		],
		"1569934923_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 134,
				"body": "Almost got those bastards with the molotov.",
				"added": 1570078109
			}
		],
		"1569442712_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": [
			{
				"comment_id": 135,
				"body": "> [communism](#comment_4_1H2vbwfU8uNoJycKemBDgyPdrzE3A36Fkc): Democracy sucks because the right are allowed to have their voices heard. We must prevent the right from ever having their way.\n\nLet's see if you can bait someone.",
				"added": 1570078383
			}
		],
		"1570425422_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 136,
				"body": "Site I linked glowing?",
				"added": 1570425556
			}
		],
		"1570288757_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 137,
				"body": "@noquat \nKeep sucking the tobacco companies dicks that you claim you are fighting against.",
				"added": 1570426290
			}
		],
		"1569594101_14A3LXiT8D3gtRGJSMG3eMbKDtRPdLeU2S": [
			{
				"comment_id": 138,
				"body": "> [xcape2net](#comment_443_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): My STATS page says right now there are 95,507 peers on line.\n\nYour stats page must have some errors.",
				"added": 1570658550
			},
			{
				"comment_id": 141,
				"body": "Ok, someone may or may not fix it.",
				"added": 1570716885
			},
			{
				"comment_id": 142,
				"body": "Ok, someone may or may not fix it.",
				"added": 1570717044
			}
		],
		"1570379712_1P4KkC3wa5xtGD8m2MoBTf5p69G3Xr4aCU": [
			{
				"comment_id": 139,
				"body": "fnet@chat.404.city on xmpp\nThis is the discussion room and they are planning on building a decentralized service similar to this and also removing isps and setting up p2p mesh networks instead.",
				"added": 1570658827
			}
		],
		"1570193822_1D9mg5Mzk96FBLEkjCxabcydfY4Bbp3nmG": [
			{
				"comment_id": 140,
				"body": "Go to 0play",
				"added": 1570684819
			}
		],
		"1570208803_137P7ceKGpm24X9C5mxNmp1bCkQpY8vWAh": [
			{
				"comment_id": 143,
				"body": "Stenonography and hiding secrets in plain site until the way people connect to the internet is decentralized.",
				"added": 1570719679
			},
			{
				"comment_id": 144,
				"body": "Also cover up traffic. I have seen some tools that can make it look like you connectong to something else when you aren't.",
				"added": 1570719740
			},
			{
				"comment_id": 145,
				"body": "I suggest you still encrypt the message in the image.",
				"added": 1570719843
			},
			{
				"comment_id": 146,
				"body": "So email chinese propaganda and hide an encrypted message in the metadata or in an image.",
				"added": 1570729829
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 147,
				"body": "Test",
				"added": 1570732740
			}
		],
		"1570755525_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 148,
				"body": "You probably get the same amount of pussy as me.",
				"added": 1570755745
			}
		],
		"1570755737_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 149,
				"body": "Vagina",
				"added": 1570755764
			},
			{
				"comment_id": 153,
				"body": "Wish I got pussy.",
				"added": 1570764637
			}
		],
		"1570756155_1PY5FP1G6QNSCsA8nM1SjuXiPWZnQhQj9P": [
			{
				"comment_id": 150,
				"body": "Yeah, why? You a god fag?",
				"added": 1570756421
			},
			{
				"comment_id": 151,
				"body": "Ok, good",
				"added": 1570763563
			}
		],
		"1569591354_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 152,
				"body": "> [tadpole256](#comment_1_1LFxZmoGupWuLGi6FMHBL9DeSdgLUCpHBV): I certainly do not trust the Chinese government and their leader that looks like Winnie the Pooh\n\nI certainly don't trust any government.",
				"added": 1570764595
			}
		],
		"1570213999_17QiJ3NPDqUtp9tK2gNJK5AkBEhR5xSoM6": [
			{
				"comment_id": 154,
				"body": "They have a fucking privacy policy.",
				"added": 1570818776
			}
		],
		"1570912555_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 155,
				"body": "> [tawny@kxoid.bit](#comment_1_1A1WGdg2Jiq9Q1u6znsPqctJduMwTjVPAX): Speaking of Julian, anybody knows the latest news about him? He is certainly free?! ... (right?!)\n\nThey are still holding him and will probably execute him in a few years.",
				"added": 1570917034
			}
		],
		"1570935984_149NKX715zpvjyRaoR7ZdVKMDQ9BQ7kj5s": [
			{
				"comment_id": 156,
				"body": "Because they are your rulers so they and their bosses choose the rules.",
				"added": 1570936672
			},
			{
				"comment_id": 157,
				"body": "At least the snitchy neigboor realized they are a fucking nosy snitch who needs to stop trying to control others lives.",
				"added": 1570936816
			},
			{
				"comment_id": 158,
				"body": "It's not often the snitchy neighbor feels bad. Typically they are completely indoctrinated and have nothing to do with their miserable lives.",
				"added": 1570936893
			}
		],
		"1570901775_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 159,
				"body": "Nice work.",
				"added": 1570938824
			},
			{
				"comment_id": 160,
				"body": "I plan to get off the services on that list that I am still on.",
				"added": 1570938853
			},
			{
				"comment_id": 161,
				"body": "I may have to compartmentalize steam but I will get off all the other spyware I use.",
				"added": 1570938971
			}
		],
		"1570980089_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 162,
				"body": "What?",
				"added": 1570982736
			},
			{
				"comment_id": 163,
				"body": "I am wondering if it does before I open that shit.",
				"added": 1570982770
			},
			{
				"comment_id": 164,
				"body": "> [zazzizum](#comment_12_1JyYutdv87sYHdinuhLTzzpJAVsuaAdmvn): Humble bragging?\n\nI assume that means it does but a few users",
				"added": 1570982883
			}
		],
		"1570950363_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm": [
			{
				"comment_id": 165,
				"body": "Why am I not suprised?",
				"added": 1571001114
			}
		],
		"1571091734_1MgxmzHaBwSsM516rsgHsPeLUMQbYKM7hu": [
			{
				"comment_id": 167,
				"body": "http://127.0.0.1:43110/0play.bit\n\nTry this",
				"added": 1571097866
			}
		],
		"1571160843_1JzkAAtaVNqg2E1NRSbwL8tJ6egxnoxyDM": [
			{
				"comment_id": 168,
				"body": "It says he posted it on some anime board. Not here. I would still question the legitamacy of ButtFuck.",
				"added": 1571165460
			},
			{
				"comment_id": 169,
				"body": "ButtFuck squirting the jizz out of their asses still.",
				"added": 1571165644
			}
		],
		"1571246742_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 170,
				"body": "It looks the same as retroshare",
				"added": 1571267158
			}
		],
		"1571275597_15mJzWiShxgyYjrp6uAgRBbme4wWPUjwZn": [
			{
				"comment_id": 171,
				"body": "A vpn from google would be worst than no vpn at all.",
				"added": 1571334415
			}
		],
		"1571339336_16NfWw2hgzGaVcQs35UJySKMf4YP9kZFbr": [
			{
				"comment_id": 172,
				"body": "I think you are a fag if you are constantly thinking about that stuff instead of ignoring it.",
				"added": 1571345640
			}
		],
		"1569889390_1NVmsWAF88eiamogSRiUzzSVKbsakUnn62": [
			{
				"comment_id": 173,
				"body": "They all require you to have an email before making an account \"for recovery\" (spying and tracking you).",
				"added": 1571345890
			},
			{
				"comment_id": 192,
				"body": "> [anonymouslogin](#comment_42_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Protonmail or I2P Bote. More difficult to use, but secure af.\n\nI2p bote isn't email. It is seperate.",
				"added": 1571865045
			}
		],
		"1571440231_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 174,
				"body": "The gas attacks in Syria were hoaxes done by a group called the white helmets that has been involved in other hoaxes.",
				"added": 1571454281
			},
			{
				"comment_id": 177,
				"body": "I would love to see the collapse of the Syrian government but they are a low priority. We must avoid pushing narratives that will result in wars and the deaths of more innocents.",
				"added": 1571454532
			}
		],
		"1571440312_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 175,
				"body": "Yang for $1000 plus the collapse.",
				"added": 1571454346
			},
			{
				"comment_id": 176,
				"body": "Spend the toilet paper quickly before it becomes what it really is.",
				"added": 1571454383
			}
		],
		"1571325375_1LhSwRbe5DT25JGcce1HFRWq75qQDW2YT5": [
			{
				"comment_id": 178,
				"body": "OP is probably a glownigger that is trying to brainwash some dumbass into carrying out an attack to push the glownigger agenda.",
				"added": 1571454718
			},
			{
				"comment_id": 179,
				"body": "Tell me one benefit that this retarded idea would bring?",
				"added": 1571454758
			}
		],
		"1571500913_1KoioT6zYAXhg2NvChNtZvSU7fx5FhRW1w": [
			{
				"comment_id": 180,
				"body": "Try seeing a psycologist",
				"added": 1571515359
			},
			{
				"comment_id": 182,
				"body": "> [gaviscon](#comment_1_1koSUG26DkPTFK23zE8JNnpeVQsCuPJhr): help for what?\n\nHe is a pedophile and he needs help treating his mental problem.",
				"added": 1571524260
			},
			{
				"comment_id": 183,
				"body": "Because kids are unable to consent.",
				"added": 1571548707
			},
			{
				"comment_id": 186,
				"body": "He could also try watching cgi and loli hentai to avoid causing actual harm.",
				"added": 1571553919
			},
			{
				"comment_id": 193,
				"body": "> [nekololi](#comment_401_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): well, for example, in the united states, the average prison sentence for CP possession is significantly greater than the average sentence handed out for sexual abuse of a child.\n\nThat's fucked",
				"added": 1571871426
			}
		],
		"1571518121_18CHPWKcurUUCSSh1UD3MbtfhrzK3hZoML": [
			{
				"comment_id": 181,
				"body": "No",
				"added": 1571518673
			}
		],
		"1570483391_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 184,
				"body": "You can't get money for free; it all comes at a cost. What are you willing to do? Could you give up something? What are your skills? Is something easy for you but not for someone else? Ask yourself these questions.",
				"added": 1571553358
			}
		],
		"1571457668_1EDsNLHRwPW8Ajp4dScjJaBxXK1bLqHx3Z": [
			{
				"comment_id": 185,
				"body": "> [styromaniac](#comment_1140_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I wouldn't click a wild, untrusted magnet link. WB watches IP addresses of peers and contacts their ISPs.\n\nVPNs aren't anonymizers and don't completely protect you but this is one of the things that they are good at preventing.",
				"added": 1571553724
			}
		],
		"1571549623_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5": [
			{
				"comment_id": 187,
				"body": "I like lesbians and watching porn that has three or more girls.",
				"added": 1571554000
			},
			{
				"comment_id": 188,
				"body": "> [justonetry](#comment_6_1JbYWzY92aoLHfoCKnhnEUekcEbbenQHp5): How is that embarrassing?\n\nSome idiots may think it is.",
				"added": 1571684074
			}
		],
		"1571685851_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 189,
				"body": "My bets are on it failing. No difference will be made either way.",
				"added": 1571704978
			}
		],
		"1571752607_1E8JhJj7ukAx8ukr1iwV4Qvgn3UZkai6vP": [
			{
				"comment_id": 190,
				"body": "Try increasing your site storage limit.",
				"added": 1571756939
			}
		],
		"1571844793_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 191,
				"body": "We didn't miss you.",
				"added": 1571856276
			},
			{
				"comment_id": 194,
				"body": "There were some people hoping that you took one of duende's comments seriously. I was only hoping you left for good.",
				"added": 1571871705
			},
			{
				"comment_id": 195,
				"body": "Well, welcome back.",
				"added": 1571871756
			}
		],
		"1571879273_173u2WzfNziqEAAY9WqPzAZSqxfHQqs1FC": [
			{
				"comment_id": 196,
				"body": "So it is a drug site on the clearnet? That is a quick way to get glowers on you (unless if you are one yourself).",
				"added": 1571892212
			},
			{
				"comment_id": 197,
				"body": "I love the site. It looks all professional then it just sells street drugs. This shit is kind of cool but something is glowing brighter than a lightbulb.",
				"added": 1571892352
			}
		],
		"1571939842_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 198,
				"body": "Use a vpn or proxy when you connect to your school network. (You could also try different passwords on their bypass page. My school literaly made their password their username backwards.)",
				"added": 1571944306
			}
		],
		"1571933044_1NBJJWgAdvQkApP8jnD69NiQ5HPNBpmyqU": [
			{
				"comment_id": 199,
				"body": "> [manguz2000](#comment_1_13RModZgXRioEKrcFeL9rPC9JtiGqNvAUi): cp?\n\nChild Pornography",
				"added": 1571944816
			},
			{
				"comment_id": 200,
				"body": "> [merithtk](#comment_29_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): Its super annoying! I mean the other month i was browsing some meme zite, and someone posted CP, WHILE I WAS IN SCHOOL [...]\n\nI haven't seen any yet. I have seen the places where it is.",
				"added": 1572010150
			}
		],
		"1572121659_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 201,
				"body": "> [styromaniac](#comment_1158_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I sound like a prick in the title.\n\nLol, I thought you were kidcouragious until I read the actual post. I was wondering why he didn't say nigger or monkey.",
				"added": 1572163893
			},
			{
				"comment_id": 202,
				"body": "> [styromaniac](#comment_1159_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're only right about half of that. There are black and mulatto people who are told they're not black enough because their skin or personality is \"white.\" These people are seen as a white threat. The culture and politics are a big part of social environmental influence. There's also that \"Uncle Tom's house nigga\" shit being thrown around in there. [...]\n\nYous crackah ass. I gon beat yo ass crackah.",
				"added": 1572200877
			}
		],
		"1572028122_19s3iztHV7i3fBN9wyiMhiXECoZvyNjLhr": [
			{
				"comment_id": 203,
				"body": "Iaracroft is glowing",
				"added": 1572220237
			}
		],
		"1572230967_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": [
			{
				"comment_id": 204,
				"body": "> [styromaniac](#comment_1165_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Avoid those. People are getting sick from black market THC carts containing vitamin E acetate.\n\nYes, this is also what the media is using to push vaping bans. This is how they got their \"vaping related deaths\" number. (Only 6 people died also but others have gotten sick.)",
				"added": 1572236696
			},
			{
				"comment_id": 205,
				"body": "> [pineapples](#comment_84_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): yeah thats why im down for distillate too, i can make my own carts then.\n\nJust make sure you do your research and don't try any stupid shit.",
				"added": 1572236769
			}
		],
		"1572478148_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 206,
				"body": "Who is laracraft? I came up empty.",
				"added": 1572562436
			},
			{
				"comment_id": 207,
				"body": "I mean if she was glowing then she wouldn't make it very far if she is being accused.",
				"added": 1572562520
			},
			{
				"comment_id": 208,
				"body": "She doesn't appear to be glowing in the comments I am seeing.",
				"added": 1572562596
			}
		],
		"1572654143_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 209,
				"body": "An STL sharing site would be cool. I would help you if my programming skills were good enough.",
				"added": 1572670363
			},
			{
				"comment_id": 210,
				"body": "Watch out for that annoying h3 guy (or whamen). She won't like this thread.",
				"added": 1572670501
			}
		],
		"1572739729_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 211,
				"body": "> [lianna](#comment_18_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4): I miss scamming people on Webkinz. :( I still have a ton of rare items I duped out of Deluxe players. I'd get banned in a flash if I tried anything like that today.\n\nYou have to make multiple accounts. Your scamming accounts, your chop shop accounts, then your storage accounts where you can also sell them.",
				"added": 1572801065
			}
		],
		"1572829588_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 212,
				"body": "It ammuses me that your generation hasn't seen the development of the computer. Now you come in thinking you are bringing something.",
				"added": 1572888255
			},
			{
				"comment_id": 215,
				"body": "Your boomer ass will be dead and won't see the development of cooler shit.",
				"added": 1572898952
			},
			{
				"comment_id": 218,
				"body": "> [quantumkitty](#comment_250_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): this is a troll?\n\nNo, this bitch/dude is legit.",
				"added": 1572907668
			}
		],
		"1572807733_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 213,
				"body": "romsmania.cc\nthe-eye.eu",
				"added": 1572888367
			}
		],
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 216,
				"body": "Lost last night.",
				"added": 1572907460
			},
			{
				"comment_id": 217,
				"body": "Or early this morning.",
				"added": 1572907480
			},
			{
				"comment_id": 222,
				"body": "> [merithtk](#comment_53_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8): holy shit, nice [...]\n\nI nutted on november second then didn't nut again until mid january.",
				"added": 1572928198
			},
			{
				"comment_id": 229,
				"body": "3 times already.",
				"added": 1573711577
			},
			{
				"comment_id": 232,
				"body": "> [anonymouslogin](#comment_128_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): I'm confused. Can you ejaculate or not? For your health, at least once a day. Do you want prostate cancer?\n\nWish I could.",
				"added": 1573741731
			},
			{
				"comment_id": 249,
				"body": "> [1bfqutudhtexlka](#comment_40_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): well , we , as men we much like testosteronemany studies showed that lower t levels in males causes too many problems , from infertility to anxiety and depressioni was addicted to porn for some time in my life , and believe me it was horrible , just a few moments of pleasure then it's a living helli suffered from depression for the last 3 or 4 years , since i stopped masturbation since last year , depression is like 80% less , and no suicidal thoughtsand about being horny and angry , all that disappear after the first few months of abstinence , when i become horny i just go out and clear that energy in cycling or running or any sport i like , and my body automatically gets rid of semenmy t levels just skyrocketed since i last measured it , and it gave me a huge boost , my muscle weight and bone weight increased , my sleeping returned normal , my self confidence is very goodi think that 90% of my problems solved it self when stopped fapping  , and i think it was not by chance\n\nIt was probably the exercise that was helping you. I don't think it was the seizure of fapping.",
				"added": 1574223825
			}
		],
		"1572813642_17YQZueJK9KnNhAsURgiVhhFwJVrUb6bYZ": [
			{
				"comment_id": 219,
				"body": "Let's do this motherfucker.",
				"added": 1572907974
			},
			{
				"comment_id": 223,
				"body": "I'm in.",
				"added": 1572928509
			}
		],
		"1572837213_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 220,
				"body": "They legit have the DoD monitoring the traffic on the site.",
				"added": 1572908029
			}
		],
		"1572801227_14cpMzjiF3xnbZNdhBrxjyvJLcJSYkXkSA": [
			{
				"comment_id": 221,
				"body": "Please visit https://niggermania.net",
				"added": 1572908079
			}
		],
		"1572987956_1LPWDoyPyLywNDWafMdS7EU7vKUUHzdJ61": [
			{
				"comment_id": 224,
				"body": "No",
				"added": 1573059767
			}
		],
		"1573438999_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 225,
				"body": "Add a cryptocurrency that is required to connect to the network and that can be mined by providing service to others.",
				"added": 1573710329
			}
		],
		"1573573777_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 226,
				"body": "I wonder if these posts are from trolls, genuine people, or glowers trying to lure people into carrying out actions to push their agendas. (Maybe a mix of all.)",
				"added": 1573710706
			},
			{
				"comment_id": 236,
				"body": "> [mankino](#comment_1_1PYJg11pEc5aFo22x39KnZoETmMc7EHH3b): After being a troll for a long time you start to glow\n\nWho the fuck are you?",
				"added": 1573887746
			},
			{
				"comment_id": 237,
				"body": "Oh, was that an insult to me or were you just answering my question?",
				"added": 1573887805
			},
			{
				"comment_id": 238,
				"body": "> [mankino](#comment_1_1PYJg11pEc5aFo22x39KnZoETmMc7EHH3b): After being a troll for a long time you start to glow\n\nNot always the case.",
				"added": 1573887885
			}
		],
		"1573656884_1BoazbM5hxwjz51eQ8PYHwSTFNFe2a81ec": [
			{
				"comment_id": 227,
				"body": "This has scam written all over it. Allow the stupid people to get double scammed though.",
				"added": 1573711040
			}
		],
		"1573624455_1PHXTFk5zDGQMYwmQ75F8mPhMXUVJzW1sT": [
			{
				"comment_id": 228,
				"body": "Lol, you should at least read the purpose of ZeroNet before making ideas like this.",
				"added": 1573711551
			}
		],
		"1573297973_1BBxotsHK1A6e7uRD6N29qVSMMCSmzMK8d": [
			{
				"comment_id": 230,
				"body": "Where is duende when all of these suicide threads come up?",
				"added": 1573711777
			}
		],
		"1573710597_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 231,
				"body": "I know. I was trying but zeromail wasn't working for me. I liked a few comments and my limit was raised. I decided to post here to make people aware if it is actually a vulnerability.",
				"added": 1573741498
			},
			{
				"comment_id": 233,
				"body": "Ok. It wasn't displaying any messages I sent and gave no confirmation of anything being sent.",
				"added": 1573754808
			},
			{
				"comment_id": 239,
				"body": "I may have spammed nofish then which I have to apologize for.",
				"added": 1573887995
			}
		],
		"1573845173_1MqNGUHk63CGdv7KMZ9br6NvCUcDC5dezp": [
			{
				"comment_id": 234,
				"body": "They work for themselves",
				"added": 1573875779
			}
		],
		"1573864603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 235,
				"body": "Lol",
				"added": 1573876109
			},
			{
				"comment_id": 245,
				"body": "> [brianhanson2nd](#comment_47_1N8yx3zC1YKuam31pUi9eQUruBCEF9u3eE): Ah yes, because the movies 100% accurately represent real life. Keep thinking that way, it will be easier for the government to control you.\n\nYou took his joke comment seriously.",
				"added": 1574127327
			}
		],
		"1573764857_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 240,
				"body": "> [styromaniac](#comment_1253_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Like the seven proxies and VMs meme. [...]\n\nI saw one guy in here that connected through 6-7 vpns and thought he was completely untracable. He probably spent a lot of money, had a slow connection, and payed for the last one with a debit card.",
				"added": 1573888158
			}
		],
		"1573773913_1iACSGsx791Hupm3A2xE9UxPMcENQdv2x": [
			{
				"comment_id": 241,
				"body": "Ok",
				"added": 1573888218
			}
		],
		"1574051253_1JrUPjJmdTq5UsiKefuGTkNMd8MUNvP8Ss": [
			{
				"comment_id": 242,
				"body": "The fuck?",
				"added": 1574106600
			}
		],
		"1573303435_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": [
			{
				"comment_id": 243,
				"body": "Did you choose a method?",
				"added": 1574106739
			}
		],
		"1574102813_1AsCp4pwm5QuZPbZtfHDm3dAyqRWAD2ogF": [
			{
				"comment_id": 244,
				"body": "Lol, lock it up.",
				"added": 1574126772
			}
		],
		"1574129941_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 246,
				"body": "Thet even have a new banner every few days.",
				"added": 1574129990
			},
			{
				"comment_id": 247,
				"body": "> [whitepower](#comment_7_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW): Who said I care about niggers?\n\nThis is just a forum for discussing their animal nature and their early split in evolution.",
				"added": 1574176770
			},
			{
				"comment_id": 248,
				"body": "You can go there and talk to others about their monkey behaviors and them chimping out.",
				"added": 1574176824
			},
			{
				"comment_id": 257,
				"body": "> [pineapples](#comment_129_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i bet Â£10 that edgelord and whitepower are the same person lol\n\nNo, nice try.",
				"added": 1574396932
			},
			{
				"comment_id": 258,
				"body": "Divide up those 10â‚¬",
				"added": 1574396950
			},
			{
				"comment_id": 259,
				"body": "Or pounds",
				"added": 1574396992
			},
			{
				"comment_id": 261,
				"body": "> [muhwaycism](#comment_31_1C6QSjAqcgSv7Mom3e2C9dtLSKXkJrDiJU): Sure thing goy\n\nYou could clone it and make it a nice site on zeronet. You should copy what they did on that site.",
				"added": 1574401755
			},
			{
				"comment_id": 262,
				"body": "> [pineapples](#comment_129_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i bet Â£10 that edgelord and whitepower are the same person lol\n\nI accept payment in dash and monero.",
				"added": 1574401826
			},
			{
				"comment_id": 263,
				"body": "Ask white power how he would like to be payed.",
				"added": 1574401853
			}
		],
		"1574289293_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 250,
				"body": "Ignore it.",
				"added": 1574365340
			},
			{
				"comment_id": 256,
				"body": "Download the videos you like from youtube. (So many. We may have to divide the workload.)",
				"added": 1574393233
			}
		],
		"1574346417_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 251,
				"body": "Good site",
				"added": 1574391001
			},
			{
				"comment_id": 264,
				"body": "Could I download the source code somewhere?",
				"added": 1574401967
			},
			{
				"comment_id": 266,
				"body": "> [testuser3](#comment_30_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): I don't know, maybe you can ask the administrator of these sites.\n\nI just wanted to know for mirroring purposes.",
				"added": 1574441124
			},
			{
				"comment_id": 267,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1225_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): wanker\n\nThis boomer thinks he is funny.",
				"added": 1574449608
			},
			{
				"comment_id": 530,
				"body": "It needs to be quick if it is a higher value target @a2llfd. A higher value target has more security guards and people that can save it.",
				"added": 1589345662
			}
		],
		"1574390939_1AShkCrzACE7Gm6gan8WqQMhBfYVdbdaXW": [
			{
				"comment_id": 252,
				"body": "Yes, I found one on the clearnet a while back.",
				"added": 1574391043
			},
			{
				"comment_id": 253,
				"body": "Just search niggers for sale",
				"added": 1574391065
			},
			{
				"comment_id": 269,
				"body": "https://groups.google.com/d/topic/ga.jobs/UTw6XRdBLcE",
				"added": 1574468473
			}
		],
		"1574368389_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": [
			{
				"comment_id": 254,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1210_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): drop gamingyou're old now\n\nOkay boomer",
				"added": 1574391284
			},
			{
				"comment_id": 255,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1210_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): drop gamingyou're old now\n\nCan you go on another break over a month or two? We all loved when you were gone.",
				"added": 1574391397
			},
			{
				"comment_id": 272,
				"body": "It has been a long time. I can't afford a vr headset currently.",
				"added": 1574662563
			}
		],
		"1574266227_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 260,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1192_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): religous wishfull thinkingyou're mad [...]\n\nAnd you aren't? I remember your older arguments with me.",
				"added": 1574397182
			}
		],
		"1574428465_1Go1gbJtN2dPsRU5vCUeXQfwBSTJwAbaFK": [
			{
				"comment_id": 265,
				"body": "> [pineapples](#comment_133_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): no, so far there has been no market places that i know of since it is hard to create something of that nature within the confines of a decentralized network\n\nI was going to start working on one at some point. I set up the folders but never started.",
				"added": 1574441067
			}
		],
		"1574259710_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 268,
				"body": "> [h3bhkj5gqz4n3pjm](#comment_1208_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11): then come more words\n\nAre you an ai? That or you are mentally retarded. Your responses make no sense and seem automated.",
				"added": 1574453663
			}
		],
		"1574440284_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 270,
				"body": "I have backups off",
				"added": 1574468536
			}
		],
		"1574608306_12wtYTT9hC5Y8a2QMDmVS6bs3gNjeK8z1p": [
			{
				"comment_id": 271,
				"body": "No exploit for me.",
				"added": 1574647443
			}
		],
		"1574566466_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 273,
				"body": "I actually thought this was serious. With the idiots I have been meeting recently.",
				"added": 1574662661
			}
		],
		"1574563424_1EJJc5r6kt7XrSdBCm17zUNCDepe1kdaE9": [
			{
				"comment_id": 274,
				"body": "Plenty of options.",
				"added": 1574662796
			},
			{
				"comment_id": 275,
				"body": "Tox, retroshare, jami, mumble (with plugins), etc.",
				"added": 1574662935
			}
		],
		"1574730236_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 276,
				"body": "> [wiz101](#comment_2_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK): i had to add this because a bunch of SJW faggots treaten to take shun my federation from everyone else and they have already its shit m8\n\nDo you enforce it?",
				"added": 1574750906
			},
			{
				"comment_id": 277,
				"body": "Fediverse is infested with sjws",
				"added": 1574751004
			},
			{
				"comment_id": 278,
				"body": "> [littlepaw](#comment_37_16VcDM9UrXq4VY2MAKJhfuiN1DoG5ktAD3): You mean they took it down or they just talked shit about it? There's a big difference between the two.\n\nThey block his instance from everyone else",
				"added": 1574825235
			},
			{
				"comment_id": 285,
				"body": "> [ratsmack](#comment_103_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5): That's why the Gab folks decided not to use that system and just rolled their own.\n\nThe developers of mastodon added a block of gab into the source code. It can be removed if you set up an instance but there are people that won't know to do this.",
				"added": 1574917664
			},
			{
				"comment_id": 286,
				"body": "Gab is a honeypot though.",
				"added": 1574917702
			},
			{
				"comment_id": 287,
				"body": "I would maybe set up an instance for peertube, pleroma, or gnusocial. Pixelfed looks like a cool concept but I think it might have the sjws infestation. Looking at the domain names and descriptions for pleroma instances says that they don't have too many sjws.",
				"added": 1574918550
			}
		],
		"1574798216_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX": [
			{
				"comment_id": 279,
				"body": "The movement is still going on?",
				"added": 1574829735
			},
			{
				"comment_id": 289,
				"body": "> [ironwoman](#comment_12_1NQXKFTnE1A2rWDm3ohhpUkQ3r9TRF7ETX): yes, still alive, we celebrated the 1st birthday of the movement, November the 18th\n\nSo, what are you guys trying to accomplish now?",
				"added": 1574966291
			}
		],
		"1574812874_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 280,
				"body": "I am in the same position.",
				"added": 1574830128
			},
			{
				"comment_id": 281,
				"body": "I have to go to my grandpa and grandmas house and they don't like my immediate family due to us not being good christians.",
				"added": 1574830256
			},
			{
				"comment_id": 284,
				"body": "I love the polish guy in this thread. Best posts.",
				"added": 1574916179
			},
			{
				"comment_id": 291,
				"body": "After they left, it was fun.",
				"added": 1575011425
			},
			{
				"comment_id": 295,
				"body": "> [z3n5if](#comment_101_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): Ok, you listen here.The English will never be slaves.Remember that before you wag your disrespectful tongue again.\n\nAlready are",
				"added": 1575048472
			}
		],
		"1574812694_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 282,
				"body": "Duende made a kill yourself thread. I thpught he would onpy leave comments.",
				"added": 1574833802
			},
			{
				"comment_id": 290,
				"body": "> [xcape2net](#comment_583_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Do you want everyone dead, or just certain people?\n\nHe wants everyone on this forum to kill themselves.",
				"added": 1574966505
			},
			{
				"comment_id": 292,
				"body": "> [z3n5if](#comment_92_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): Why does it seem like everyone on znet wants to off themselves like it feels better than sex?\n\nMost of us haven't had sex.",
				"added": 1575011774
			},
			{
				"comment_id": 293,
				"body": "Does anyone know if that kear4bears guy killed himself?",
				"added": 1575011929
			},
			{
				"comment_id": 294,
				"body": "I am going to miss duende when he hits his post limit.",
				"added": 1575012174
			},
			{
				"comment_id": 296,
				"body": "> [z3n5if](#comment_99_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD): oof. Don't worry, fam. Unless you have an exceptional woman, it's mainly a means of control.Don't have sex until marriage. Trust me.\n\nI have observed that",
				"added": 1575048594
			}
		],
		"1574848015_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 283,
				"body": "I heard about pinephone which sounds cool. I think there is also a new fairphone model.",
				"added": 1574897753
			}
		],
		"1574929776_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 288,
				"body": "> [1bfqutudhtexlka](#comment_76_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): it depends on two hypothesis , natural selection (im ok with) , and mutationsmutations are literally random , which can't explain the complexity and the precise order in which human (or animal) organ worksi mean look at how heart works , this must be designed , there is no way this came out of random \"mutations\"\n\nThis happens over long periods of time. The mutations are minor at the time they happen but they become larger changes over a long period of time. Just look at how long it took to get from homo erectus to homo sapien.",
				"added": 1574960145
			}
		],
		"1575012427_1PTUiAbYfoN76QFKvwtu818EWaT9AwbYvd": [
			{
				"comment_id": 297,
				"body": "Fuck 12",
				"added": 1575048623
			}
		],
		"1575162021_17UaTuxP639VqVnepbKXm14qsD8FvBv8mK": [
			{
				"comment_id": 298,
				"body": "> [pexo](#comment_176_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC): It looks like the purism laptops are pretty much what you look for.So the librem13(clearnet) and the librem15(clearnet). They are also currently in the process of making a phone.\n\nUses intel. Intel ME included. Problem",
				"added": 1575221331
			},
			{
				"comment_id": 299,
				"body": "> [flyingox](#comment_1_17T2nsH7uiAhVL2RwPQMgeHoaMMT7f3XUX): Simply install Linux, even simple basic installs are fairly secure.   Nearly any distro nowadays will secure you well enough that you do not have to worry too much...  Unless you are contending with hackers who are attacking your computer / system you should be fairly secure.\n\nFirmware and hardware level?",
				"added": 1575222105
			}
		],
		"1575180863_11xvtkLUfeD7brvyLqn93txTVbwFP85bg": [
			{
				"comment_id": 300,
				"body": "driud, You would also need an internet connection.",
				"added": 1575227425
			}
		],
		"1575222678_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 301,
				"body": "Shit",
				"added": 1575241629
			}
		],
		"1575282377_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 302,
				"body": "https://www.invidio.us/watch?v=tb8iHEhfjmY&t=522",
				"added": 1575350251
			}
		],
		"1575385168_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 303,
				"body": "The people that are interested in seeding won't be seeding for very long.",
				"added": 1575425981
			}
		],
		"1575532867_1ApA2iB2ZgqnbhHWsG7XH5QZQkPDqHNKzZ": [
			{
				"comment_id": 304,
				"body": "Do you have any experience in web development?",
				"added": 1575567783
			},
			{
				"comment_id": 316,
				"body": "> [styromaniac](#comment_1398_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): More likely this person went to parties for underage drinking instead of studying English at home.\n\nI never studied english.",
				"added": 1575583945
			},
			{
				"comment_id": 317,
				"body": "> [styromaniac](#comment_1398_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): More likely this person went to parties for underage drinking instead of studying English at home.\n\nOp's name also suggests english isn't his first language. He is probably eastern european.",
				"added": 1575584024
			},
			{
				"comment_id": 318,
				"body": "> [styromaniac](#comment_1399_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You seem to pick up on proper English. I never would have guessed it's your second language, if that's what you're implying.\n\nIt is my first language. I mean I didn't go home and study for english class.",
				"added": 1575588054
			}
		],
		"1575523101_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 305,
				"body": "It is never safe.",
				"added": 1575567844
			},
			{
				"comment_id": 306,
				"body": "Install tox, briar, meshenger, or some other messaging application that is foss",
				"added": 1575567948
			},
			{
				"comment_id": 327,
				"body": "Briar or meshenger might be good for you guys because you can send messages over bluetooth without internet.",
				"added": 1575782149
			}
		],
		"1575485461_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": [
			{
				"comment_id": 307,
				"body": "Fitbit was bought out by google",
				"added": 1575568098
			},
			{
				"comment_id": 308,
				"body": "I would reccomend something offline. I may use garmin once in a while but not often.",
				"added": 1575568149
			},
			{
				"comment_id": 309,
				"body": "Go for a run or whatever then take them off after.",
				"added": 1575568199
			},
			{
				"comment_id": 310,
				"body": "https://www.cnx-software.com/2019/09/15/pinetime-smartwatch-companion-pinephone/",
				"added": 1575568315
			}
		],
		"1575467766_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": [
			{
				"comment_id": 311,
				"body": "I'm muting this idiot. Not worth the bytes of storage it takes up on my phone.",
				"added": 1575569129
			}
		],
		"1575473198_1HFbnmQ8wBoYBNqZy2wVfyLg19v4WWKiK1": [
			{
				"comment_id": 312,
				"body": "> [1bfqutudhtexlka](#comment_97_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): what's your fucking problem ?\n\nJust mute him. Trust me.",
				"added": 1575583572
			},
			{
				"comment_id": 313,
				"body": "> [1bfqutudhtexlka](#comment_93_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY): im new to linux , and i always see people argue about systemd is good or badi want to understand\n\nThe code for systemd is impossible for a single person to audit and is very complex and unorganized.",
				"added": 1575583637
			},
			{
				"comment_id": 314,
				"body": "There are like over a million lines of code.",
				"added": 1575583665
			},
			{
				"comment_id": 315,
				"body": "h3bhkj5gqz4n3pjm, how about you answer his fucking question instead of being a dick?",
				"added": 1575583763
			}
		],
		"1575581906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 319,
				"body": "> [suutus](#comment_1_166uTRSiJyj6QXVFKqaohJQyZ2aFNuGESS): I remember like, oh shit, 10 or so years ago, I used to use a username along the lines of 'Mr. Pedo' (I was 13). I got contacted on Skype one day by a guy asking if i would like any Child Pornography. I jerked him around a bit finding it extremely suspicious since he kept asking what my career path was, how i obtained my Pizza no Toppings, and just other weird stuff. I'm honestly surprised any people get caught by these glow in the darks.\n\nPedos ain't smart",
				"added": 1575588375
			}
		],
		"1575594695_12scJswFc63Bm4gVWHfYQa93mZ1miBQdmG": [
			{
				"comment_id": 320,
				"body": "It works.",
				"added": 1575602436
			}
		],
		"1575651428_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 321,
				"body": "Firefox is open source so it could be easily integrated into other projects.",
				"added": 1575652059
			},
			{
				"comment_id": 322,
				"body": "Language does change so a decentralized online translator would be good.",
				"added": 1575652098
			}
		],
		"1575619462_1Kw7qBvEj31Gf2HtzzoqBqfpekxsJ9cCMx": [
			{
				"comment_id": 323,
				"body": "Does this thing extend bluetooth range?",
				"added": 1575692789
			}
		],
		"1575719026_1J8Z3dnffKkBzmtdNjCUVPa4DWNGPLqn9L": [
			{
				"comment_id": 324,
				"body": "Fuck you H3. They don't have a persian forum. Quit being an asshole to them.",
				"added": 1575736018
			}
		],
		"1575754690_1LWErNVFAu2wJT2XBoVkLDCmY41EX32knU": [
			{
				"comment_id": 325,
				"body": "Can you explain it better?",
				"added": 1575757109
			}
		],
		"1575752736_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": [
			{
				"comment_id": 326,
				"body": "This happened a while ago.",
				"added": 1575757176
			}
		],
		"1575760689_1BwGVP2XMmmfdPEAZAvKmcVBFecxGSpnjY": [
			{
				"comment_id": 328,
				"body": "Seytonic and null byte are my two favorite hacking channels.",
				"added": 1575782421
			},
			{
				"comment_id": 329,
				"body": "Seytonic recently made some videos that go over certain sets of tools in kali linux.",
				"added": 1575782480
			}
		],
		"1575818739_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": [
			{
				"comment_id": 330,
				"body": "ÐÐµÑ‚",
				"added": 1575829239
			},
			{
				"comment_id": 334,
				"body": "You could make a persian forum yourself then",
				"added": 1575856734
			}
		],
		"1575765233_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 331,
				"body": "Does apple let you reset the device in the settings?",
				"added": 1575836336
			}
		],
		"1575692981_1EECPRXzpW95MYpBZUTLd47TofKW9xGC9e": [
			{
				"comment_id": 332,
				"body": "What is it that you are trying to accomplish?",
				"added": 1575836493
			}
		],
		"1575843240_12NY4djX7PmMqibTpyqsaf3Fr3dtcpA7ti": [
			{
				"comment_id": 333,
				"body": "Translator is shit so I will say this in english. It is not a personal chat program. It is a decentralized way of distributing websites over the bittorrent network.",
				"added": 1575843739
			}
		],
		"1575880894_1JszzaxuPyozejWGkm7VyEEkXNCj5ihD6F": [
			{
				"comment_id": 335,
				"body": "I think there was something else you could do if that doesn't work.",
				"added": 1575987791
			}
		],
		"1575997351_1MnNwuGMC3rxUG8QHmgQiBYJ3o4JZf484s": [
			{
				"comment_id": 336,
				"body": "Source code?",
				"added": 1576003051
			},
			{
				"comment_id": 337,
				"body": "Glowing project",
				"added": 1576005738
			},
			{
				"comment_id": 338,
				"body": "authservice is either a glownigger or misinformed.",
				"added": 1576005826
			}
		],
		"1576066471_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": [
			{
				"comment_id": 339,
				"body": "What was on the site?",
				"added": 1576084980
			},
			{
				"comment_id": 340,
				"body": "What was on the site?",
				"added": 1576085019
			}
		],
		"1576120994_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 341,
				"body": "Vanilla",
				"added": 1576160674
			}
		],
		"1576192907_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 342,
				"body": "> [fractalzoomer](#comment_47_1CJc7iRKb8yncAkdF29t1M85mhfYEKgAFj): No, sorry. It runs 16 processes, not 16 threads.\n\nYeah, was going to say that zeronet does not require that.",
				"added": 1576262481
			}
		],
		"1576294690_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": [
			{
				"comment_id": 343,
				"body": "Lineage os looks nice",
				"added": 1576469447
			}
		],
		"1576431661_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 344,
				"body": "I'm sorry mr. Officer but I am not interested.",
				"added": 1576469509
			}
		],
		"1576322123_17ZnSRGrALWLigjaDhkzUM4KAC8c8rv8Eu": [
			{
				"comment_id": 345,
				"body": "> [lezsakdomi1](#comment_2_1JB5eJZypysthDrTSuHMogfWX8czDL4iVf): I didn't but... Anyone tried Freenet? That's even more secure :p\n\nYes, It is very slow though.",
				"added": 1576469860
			}
		],
		"1576282955_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 346,
				"body": "> [bigbadbob](#comment_850_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Is he your new hero?  Does it inspire you?  Does it bring you some happiness?\n\nOf course it inspires him.",
				"added": 1576516202
			}
		],
		"1576584251_1CAT2JUrrveTaNDJSqi7NFfd8vnWUsB2Sf": [
			{
				"comment_id": 347,
				"body": "h3bhkj5gqz4n3pjm is really annoying. I have muted him. Amd to your question, not many here are concerned with that stuff. Ideas are important here.",
				"added": 1576595070
			}
		],
		"1576568035_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 348,
				"body": "> [clearnet15bad](#comment_68_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7): You always stuck as an anti-semite. Do you treat the jews as loved ones?\n\nWhat does this thread have to do with jews?",
				"added": 1576624659
			}
		],
		"1576436753_1K2gWrwEPk1xUKM6Uq8g4AmKq6DQfJ99y6": [
			{
				"comment_id": 349,
				"body": "> [sublime6](#comment_2_152JLSuJAhrKabbvowpHjq5W6TzpxmYW3w): ZeroNet on android!someday..because not everyone has access to a computer.we all do. but normal people often dont.who cares? idk. those people? not really. maybe yes, maybe no\n\nThere already is an app and you could probably run the python version through termux.",
				"added": 1576624803
			}
		],
		"1576347710_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 350,
				"body": "> [draugrdeathlord](#comment_1_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Get AirVPNhttps://airvpn.org\n\nDon't. VPNs don't make you anonymous.",
				"added": 1576708814
			}
		],
		"1576697039_1JorDyDxuLrircDbzzmn4B1ndcbSJahXLH": [
			{
				"comment_id": 351,
				"body": "> [gggff](#comment_1_15D1u4mnaevkiMaJkf8YUXzCPP9pu9J9au): Kill yourself\n\nDid you hit your posting limit and not get it raised duende?",
				"added": 1576769233
			},
			{
				"comment_id": 352,
				"body": "Just find it on pornhub.",
				"added": 1576769260
			}
		],
		"1576246850_1PE7nD7YtXWzNdc1EggdBPaqWTYs6jdkK7": [
			{
				"comment_id": 353,
				"body": "> [nickwa](#comment_487_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj): Pretty much all therapists are in bed with big pharma. It's all a scam too with the way they label anything that is not \"normal\". If this was back when the guy who said the earth revolves around the sun was alive, they would of labeled and drugged him.\n\nGalileo?",
				"added": 1576819286
			},
			{
				"comment_id": 354,
				"body": "They put him on house arrest for the rest of his life",
				"added": 1576819304
			}
		],
		"1576725447_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 355,
				"body": "> [bigbadbob](#comment_861_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Who?\n\nUS Government",
				"added": 1577125125
			},
			{
				"comment_id": 356,
				"body": "> [thetruth](#comment_32_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): It goes deeper than that, look at my title and do your own research...\n\nIsreal and the illuminati then",
				"added": 1577166427
			},
			{
				"comment_id": 357,
				"body": "Novus Ordo Seclorum",
				"added": 1577170958
			}
		],
		"1576213352_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 358,
				"body": "The bible is just a book that a bunch of people scribble nonsense into overtime.",
				"added": 1577208564
			}
		],
		"1576672826_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 359,
				"body": "> [anonymouslogin](#comment_159_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): An armed population would be able to defend themselves against oppression more effectively. I am no advocate of crazy people having access to firearms, but HK would be better off if even some of the citizens had their own firearms.\n\nCrazy people are who the government arbitrarily decides are crazy.",
				"added": 1577255372
			}
		],
		"1577141870_1C3TWkttX6aKrtboutxzVktZzncWyyfyUQ": [
			{
				"comment_id": 360,
				"body": "There is a persian forum now.",
				"added": 1577255407
			}
		],
		"1577287962_1A5tKMypMZW14oHJLbe3rh9Va44MsBnwz1": [
			{
				"comment_id": 361,
				"body": "It is fine because enough people are seeding",
				"added": 1577311453
			}
		],
		"1577283326_1T4nUY5eDwwMk3zFjh27ZQCqkVpPxRYkk": [
			{
				"comment_id": 362,
				"body": "We need to get an international mesh network set up.",
				"added": 1577311553
			}
		],
		"1575930275_1EAAeLMF5R69XJUZc5F4xrr3Ls5twrCTCL": [
			{
				"comment_id": 363,
				"body": "World Star Hip Hop",
				"added": 1577312124
			}
		],
		"1577499241_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 364,
				"body": "testuser3 can tell you. He posts a lot about what is going on.",
				"added": 1577506883
			}
		],
		"1577433117_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 365,
				"body": "> [fib](#comment_32_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): Mobile phones are the computers I'm referring to, as they purposefully have restricted interfaces where background tasks can be easily hidden.\n\nYou should try installing lineageos, graphene, plasma mobile, ubuntu touch, or another foss operating system.",
				"added": 1577588473
			}
		],
		"1577617777_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": [],
		"1577722948_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": [
			{
				"comment_id": 367,
				"body": "I thought you hit your post limit. Now say what you always do.",
				"added": 1577730413
			}
		],
		"1577740713_18F1Ga3hcY5ZSPoD5jeFow6w7uHyRtocdf": [],
		"1577908716_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 372,
				"body": "I got a 2tb ssd for under $200",
				"added": 1577912040
			},
			{
				"comment_id": 373,
				"body": "Get them on sale",
				"added": 1577912072
			}
		],
		"1577916638_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 374,
				"body": "It's impossible to become that rich in a free society.",
				"added": 1577916788
			}
		],
		"1577913264_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 375,
				"body": "By that logic, they should ban arabic letters. There are muslims that use them that are in grooming gangs there.",
				"added": 1577917267
			},
			{
				"comment_id": 377,
				"body": "> [frosthammer](#comment_22_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC): Your hollywood opinion of National Socialists is comical. I suppose you think that the Wolfenstein game series is factual. Maybe all Nazis are actually Zombies. That's right. We won't just murder you, we'll eat your brains. GUTENDAG.\n\nIt's tag in german",
				"added": 1577919002
			},
			{
				"comment_id": 378,
				"body": "It is dag in swedish though",
				"added": 1577919079
			}
		],
		"1577912932_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 376,
				"body": "You only see the rich in chinese. That isn't realistic of the average person.",
				"added": 1577917934
			}
		],
		"1578202687_1JGiVKenWPWgSZpRgNufyk9TAEp67HzaPm": [
			{
				"comment_id": 379,
				"body": "Anyone want to build a site like ebay called Zer0Trade",
				"added": 1578256103
			},
			{
				"comment_id": 380,
				"body": "We also need to allow people to set the regions they trade in.",
				"added": 1578256132
			},
			{
				"comment_id": 381,
				"body": "And add a glow rating",
				"added": 1578256306
			},
			{
				"comment_id": 382,
				"body": "That will help people catch glowniggers faster",
				"added": 1578256343
			},
			{
				"comment_id": 383,
				"body": "> [realiodine](#comment_7_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG): Can you please not quadruple post? The edit button is there for a reason.\n\nDifficult to press everytime I want to leave new comment",
				"added": 1578264323
			}
		],
		"1578268512_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 384,
				"body": "These people asking you to put everything on the line could be glowposters. Remember to think for yourselves and think what these peoples agendas are.\n\nWhat we can do is continue to develop alternative networks for trading and communicating. Also be ready to fight when the glowniggers come knocking at our door (or no knocking).",
				"added": 1578288347
			}
		],
		"1578257018_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 385,
				"body": "> [quantumkitty](#comment_337_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Say what you want about the Yang Gang.. it's the only uncucked political movement in the world. Nothing particularly manly about being a wagie slaving away 40-60 hours a day while never being able to buy property regardless.Â As the saying goes - madness is doing the same thing over and over...\n\n40-60 hours a day isn't possible",
				"added": 1578288787
			}
		],
		"1578305039_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 386,
				"body": "He just wants people to do work so he can exploit them.",
				"added": 1578336407
			}
		],
		"1578439030_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 387,
				"body": "Be careful when buying on aliexpress. The card could be fake.",
				"added": 1578450527
			},
			{
				"comment_id": 388,
				"body": "I bought a 256 gb micro sd recently.",
				"added": 1578450650
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 389,
				"body": "Just mute him.",
				"added": 1578579750
			}
		],
		"1578538583_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [],
		"1578622553_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 391,
				"body": "Just scam people yourself instead of getting scammed. It is really easy to do with retards like you on the internet that are always expecting free money.",
				"added": 1578633301
			}
		],
		"1578686431_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 392,
				"body": "You are dumb",
				"added": 1578690464
			},
			{
				"comment_id": 393,
				"body": "Pay me bitcoin and I will generate random credit card numbers and send you a database. Maybe they will work, maybe they don't. There is a chance they will though so you should pay me.",
				"added": 1578690569
			},
			{
				"comment_id": 394,
				"body": "By the way, all you have to do is a little social engineering if you want a credit card. You are too stupid though and are probably the one that gets social engineered.",
				"added": 1578690673
			},
			{
				"comment_id": 395,
				"body": "Sorry I can't help you mr. Officer",
				"added": 1578690841
			}
		],
		"1578738929_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 396,
				"body": "Eggs aren't good to eat everyday.",
				"added": 1578788839
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 397,
				"body": "Let him let out his anger. Stupid nigger shouldn't be stealing bikes.",
				"added": 1578899301
			},
			{
				"comment_id": 398,
				"body": "700$?! I'd be pissed at that nigger too. It probably has really fucked up teeth that curve outwards, has a head that is shaped like a wide oval going back and just looks like a chimpanzee.",
				"added": 1578899438
			},
			{
				"comment_id": 399,
				"body": "Don't blame the niggers that don't steal bikes.",
				"added": 1578899513
			}
		],
		"1578875146_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 400,
				"body": "You are referring to h3... I assume.",
				"added": 1578899700
			},
			{
				"comment_id": 405,
				"body": "> [draugrdeathlord](#comment_383_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): The person's working who are behind that account. Yes.\n\nI think there are multiple people too. One day he says religion is stupid then the other day he has a debate with me and says god is real because math exists.",
				"added": 1578954436
			}
		],
		"1578699066_1CCh1G3AX8DRk9Fehp28Vevreid7GgLCjj": [
			{
				"comment_id": 401,
				"body": "What is it that you need assistence with?",
				"added": 1578899975
			},
			{
				"comment_id": 406,
				"body": "Is this what the cia thinks we talk like",
				"added": 1579029566
			}
		],
		"1578862459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 402,
				"body": "Americans won't say their thoughts to your face. You will get that anywhere.",
				"added": 1578953453
			},
			{
				"comment_id": 403,
				"body": "> [re4tsf9e](#comment_110_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq): What if cancer is contagious? Does that change your calculation any? [...]\n\nGlowposting.",
				"added": 1578953662
			},
			{
				"comment_id": 404,
				"body": "That guy is an idiot and probably a glownigger trying to convince you to carry out a mass shooting.",
				"added": 1578953730
			}
		],
		"1579112743_1sQE8j9Sb9fc6uqoPqyqgEXJVnVN3xXL8": [
			{
				"comment_id": 407,
				"body": "I had this dumbass muted. Why the fuck am I seeing his messages.",
				"added": 1579131790
			},
			{
				"comment_id": 408,
				"body": "Oh, makes sense",
				"added": 1579131970
			}
		],
		"1578882405_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 409,
				"body": "My paychecks only come a few days late.",
				"added": 1579132300
			}
		],
		"1578111851_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 410,
				"body": "And before you say, CIA, MOSSAD, ZIONIST hide Earth shape and the truth!!!",
				"added": 1579186536
			},
			{
				"comment_id": 411,
				"body": "> [quantumkitty](#comment_379_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Lol. Right.\n\nYeah, just let him post his nonsense.",
				"added": 1579186578
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [
			{
				"comment_id": 412,
				"body": "> [fucktaxes](#comment_2_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic): not at all i am trying to see if anyone would like a tax evasion forum like this http://127.0.0.1:43110/1GSp4VxQkdLDy9uXwjP5tJVrNY4C9evvba/?Home\n\nTo monitor us?",
				"added": 1579186705
			},
			{
				"comment_id": 413,
				"body": "Many of us are interested. We just don't tell IRS agents how we do it.",
				"added": 1579186782
			}
		],
		"1579185629_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 414,
				"body": "Last time I remember, I couldn't use your site because I had an adblocker.",
				"added": 1579203340
			}
		],
		"1579387320_1Ho88wZ1zroWjxVTXFNsQg256LJ2CK16Bd": [
			{
				"comment_id": 415,
				"body": "no way CIA",
				"added": 1579574488
			}
		],
		"1579592713_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": [
			{
				"comment_id": 416,
				"body": "I may still prefer to get my porn on the clearnet. Do you have camgirls, lesbians, threesomes (majority female), foursomes (majority female.)? I also prefer dark blonde or blonde and blue eyes.",
				"added": 1579593184
			},
			{
				"comment_id": 417,
				"body": "18+ could be a lie and I don't know if you're a glownigger or not. You could just be trying to get me to download cp to make some more arrests and be disguising this as a normal porn site.",
				"added": 1579593241
			}
		],
		"1579762565_17U5GzDuhL9qeWAyDZLNB1tguX8xX1hXUe": [
			{
				"comment_id": 418,
				"body": "> [genericuser](#comment_1_17vusKKQZwmtsE8YPupdPqBzcXFD2ouCNv): Maybe throw some oil in the fire before you kill yourself... go on a rampage rape kill destroy stuff. If people dont care make them care. Take some drugs become a problem in the world or just do whatever you want you got nothing to lose anyway.\n\nFuck off glownigger",
				"added": 1579816773
			}
		],
		"1580551703_1G5J3JZZ6SZtdsSAS3etngxaTXjcNg25ge": [
			{
				"comment_id": 419,
				"body": "> [fabcdefgwagon](#comment_3_1AEx7ASy4xvEkpjJKweTVD2hnsKmPgvPX5): anybody else f*ck when making their zeroid or just me :/\n\nSo you were fucking someone when you made your id?",
				"added": 1580600626
			}
		],
		"1579381945_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 420,
				"body": "A few ways to slow it down and even reverse its effects:\nâ€¢ Expose yourself to hotter and colder temperatures\nâ€¢ Avoid Sun Exposure\nâ€¢ Don't eat a lot\nâ€¢ Get your heart rate up\nâ€¢ Don't make protein your primary diet source (I didn't say don't eat it @vegans)",
				"added": 1580786895
			},
			{
				"comment_id": 421,
				"body": "https://m.phys.org/news/2020-01-biological-scientists-pathways-lifespan.html",
				"added": 1580787046
			}
		],
		"1581969527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 422,
				"body": "That was a very bad russian accent",
				"added": 1582000742
			},
			{
				"comment_id": 423,
				"body": "I guess we are apparently members of a Russian mafia.",
				"added": 1582000795
			},
			{
				"comment_id": 424,
				"body": "> [nazmi](#comment_3_182MiECzFBoPjv3gU6tq2k9BXSboKzDVKF): blyat\n\nÐ¢Ñ‹ Ð¿Ð¸Ð´Ð¾Ñ€. Ð¡ÑƒÐºÐ° Ð±Ð»ÑÑ‚ÑŒ.",
				"added": 1582002805
			},
			{
				"comment_id": 425,
				"body": "ÐœÐ°Ñ„Ð¸Ñ",
				"added": 1582002832
			},
			{
				"comment_id": 426,
				"body": "Privet chuvak, I Russian mafia user zeronet. That is shady things we do.",
				"added": 1582002977
			}
		],
		"1582033580_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 427,
				"body": "> [aeldg7pg4b](#comment_28_1NdJyMSqnWWim7ibxBvaNsMgQvqkkTXVnz): Perhaps I'm naive, but I suspect Assange is exactly what he claims. A journalist dedicated in publishing the truth. [...]\n\nThe rapes were false. Even the women admitted they consented.",
				"added": 1582607042
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 428,
				"body": "> [ranshit](#comment_100_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12): In my opinion, VM is just a way to waste resource. Why not just use a dual boot system to allow complete game optimization while performing non-gaming activities on a non-gaming operating system.\n\nEncrypt your non-gaming partition or drive. This is what I have set up currently.",
				"added": 1582685634
			}
		],
		"1583203227_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 429,
				"body": "> [hagen](#comment_5_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX): You're on Zeronet but you think decentralisation is bad?\n\nI believe this is a shitpost",
				"added": 1583301751
			}
		],
		"1583331189_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": [
			{
				"comment_id": 430,
				"body": "It will help but won't finish.",
				"added": 1583351062
			},
			{
				"comment_id": 431,
				"body": "I still want to make a couple purchases and have a decent way of getting utilities before.",
				"added": 1583355862
			}
		],
		"1583360632_19BegAAtfsBfH4Uat6ZZmDR3FPF1wwAcGF": [
			{
				"comment_id": 432,
				"body": "The snap package? Just do a snap install",
				"added": 1583387310
			}
		],
		"1583373754_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 433,
				"body": "And if it is then that adds even further to people overreacting due to brainwashing from the media.",
				"added": 1583387422
			}
		],
		"1583438394_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": [
			{
				"comment_id": 434,
				"body": "This isn't a surprise",
				"added": 1583441934
			}
		],
		"1583438031_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 435,
				"body": "What does this give?",
				"added": 1583441962
			},
			{
				"comment_id": 438,
				"body": "> [mariage](#comment_9_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY): Some programs and serials for this OS, and ISO files also ;)\n\nCan I get the os for free?",
				"added": 1583505127
			}
		],
		"1583450778_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 436,
				"body": "> [buzel](#comment_3_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid): Can you fake it\n\nThere is a camgirl called melody or something how makes herself a vr anime character",
				"added": 1583468403
			}
		],
		"1583495069_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 437,
				"body": "You have a mental problem.",
				"added": 1583504903
			}
		],
		"1583690992_1LzhWqcrjmmkQjaKuse2XQWuQiKSpFZ7Kv": [
			{
				"comment_id": 439,
				"body": "> [styromaniac](#comment_1853_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Ð‘ÑƒÐ´ÑŒ Ð»Ð°ÑÐºÐ°, Ð¾Ð¿ÑƒÐ±Ð»Ñ–ÐºÑƒÐ¹Ñ‚Ðµ Ð½Ð° ÑƒÐºÑ€Ð°Ñ—Ð½ÑÑŒÐºÑ–Ð¹ ZeroTalk. [...]\n\nÐ”Ð°",
				"added": 1583691424
			}
		],
		"1583652466_12cd6EZPPnYus8unwYEjFxKYWps2kNBJKd": [
			{
				"comment_id": 440,
				"body": "Gparted has a data recovery tool in it.",
				"added": 1583777817
			}
		],
		"1583786953_1DyKUa1G8NJMJGq88HWtmwdjuRfpZduKhA": [
			{
				"comment_id": 441,
				"body": "They took that from French students. Give me a study from a non-romantic language and tell me how long it takes to learn.",
				"added": 1583872290
			}
		],
		"1584169815_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 442,
				"body": "I can. What is your id?",
				"added": 1584236699
			}
		],
		"1584570227_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": [
			{
				"comment_id": 443,
				"body": "Let's just say I am an example of how you don't have to be in it to access ZeroNet for what I do as a career.",
				"added": 1584717659
			}
		],
		"1584324810_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 444,
				"body": "Nickname tells me you are Ukrainian, Russian, or something around that area.",
				"added": 1584720431
			}
		],
		"1584475929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 445,
				"body": "Hand sanitizer kills off most germs but then leaves the stronger ones alive. Soap gets rid of all.",
				"added": 1584720551
			}
		],
		"1585772137_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 446,
				"body": "> [bigbadbob](#comment_1069_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Only available for windows?  That's what i just read on their site.\n\nYeah, no thank you then.",
				"added": 1585777284
			}
		],
		"1585732050_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 447,
				"body": "> [bisks](#comment_16_1Pf7ntfCB66Jxn5dkCubd28dB5saz4z9uS): Thank you for your recommendation but the https://lbry.com/privacypolicy worries me a bit.Peertube looks interesting:https://joinpeertube.org/\n\nThe concept of peertube is cool but the main problem is the fact that it has many problems and bugs.",
				"added": 1585777437
			}
		],
		"1585525602_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 448,
				"body": "> [bluesharpie](#comment_4_14iinnXycxzcTZ8rFfP45cvZp9d7AkLdUx): I think the while Q thing is a larp. No matter what the wealthy and powerful will win and we the peasants and chattle will get nothing but scraps. Nothing short of the return of christ will stop them.\n\nYou don't need a divine figure or deity. What you need is yourself, your intellect, and a will. You will find others like you and will realize that in numbers and taking proper precautions, you are more powerful and can make a change.",
				"added": 1585896778
			},
			{
				"comment_id": 451,
				"body": "> [kleio](#comment_47_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY): https://stillnessinthestorm.com/2020/03/benjamin-fulford-march-23rd-2020-project-blue-beam-is-full-steam-ahead-so-sit-back-and-enjoy-the-fake-armageddon-show/\n\nWhat did I just read. I laughed the whole way through that. Annoying thing is that parts of it are true.",
				"added": 1585958436
			},
			{
				"comment_id": 452,
				"body": "> [miraculous](#comment_1_14pK1wobL4w4TicvBf9hytFEieu452iksE): Funny how we're not told when.\n\nLast time it was that the government was going to blow up the golden gate bridge on 8/11/2019 here. It never happened and that thread died off until the next post that they provide no evidence for came up.",
				"added": 1586137889
			},
			{
				"comment_id": 453,
				"body": "He said next week 6 days ago I believe so I assume the date the scizos are predicting is tommorrow.",
				"added": 1586138079
			},
			{
				"comment_id": 454,
				"body": "This thread will die after it doesn't happen then they will make up another event.",
				"added": 1586138212
			},
			{
				"comment_id": 465,
				"body": "So, where is the em pulse that was supposed to happen a few days ago?",
				"added": 1586473170
			}
		],
		"1585882218_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 449,
				"body": "> [thetruth](#comment_127_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): HAVE NO FEAR AND KEEP TELLING THE TRUTH BACKED BY EVIDENCE !\n\nLol, say that when you have evidence.",
				"added": 1585938515
			}
		],
		"1585842700_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 450,
				"body": "> [tajny2z](#comment_4_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): thetruth seems alot like a bot. did it or he/she made a single sophisticated point on the forum with some detail?\n\nA bot that writes nonsense then links it to CIA, MOSSAD, ZIONIST",
				"added": 1585950928
			}
		],
		"1586080503_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 455,
				"body": "> [aassddff](#comment_81_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): The truth: Spoken.Pills: Not taken.\n\nbut pills are mind controlling substances created by CIA, MOSSAD, ZIONIST to help them indoctrinate you.",
				"added": 1586138388
			},
			{
				"comment_id": 456,
				"body": "(Post below is a joke and me writing like @thetruth . I am not being serious)",
				"added": 1586138456
			}
		],
		"1586239205_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 457,
				"body": "He is trolling (maybe)",
				"added": 1586287887
			},
			{
				"comment_id": 458,
				"body": "I think thetruth should start a news website on zeronet.",
				"added": 1586288524
			}
		],
		"1586280679_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 459,
				"body": "I'll check it out.",
				"added": 1586288548
			}
		],
		"1586137241_14pK1wobL4w4TicvBf9hytFEieu452iksE": [
			{
				"comment_id": 460,
				"body": "> [tajny2z](#comment_19_1r7shFDEJySi84CCwZbJv1okuSkkF6dRr): What a story! I can try to help you. My skills are basic image, video and advanced music production and intermediate programming. If it's to do with computer and music I am in.  [...]\n\nWait until they run out of money and can't pay the police.",
				"added": 1586383859
			},
			{
				"comment_id": 461,
				"body": "So you guys are making a zite to share music?",
				"added": 1586384074
			}
		],
		"1586288287_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 462,
				"body": "DO YOU RESEARCH AND FIND THE TRUTH. YOU ARE SHEEP.",
				"added": 1586392218
			}
		],
		"1586348383_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 463,
				"body": "Pretty accurate. I do think we should still be cautious but governments imposing martial law and moving people closer to each other isn't because of the virus and is because of the economic collapse that is coming.",
				"added": 1586393018
			},
			{
				"comment_id": 464,
				"body": "Good advice from those guys and some of the people in the comments section.",
				"added": 1586393102
			}
		],
		"1586627571_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 466,
				"body": "Not ionizing, not harmful.",
				"added": 1586664569
			},
			{
				"comment_id": 467,
				"body": "Around the mid uv rays is where radiation starts to become ionizing.",
				"added": 1586664634
			}
		],
		"1584402406_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 468,
				"body": "Add h3 to the list now",
				"added": 1586747027
			}
		],
		"1586877740_17HcMdT2teKdcnKf9BiXU3UGThS7GbrbyQ": [
			{
				"comment_id": 469,
				"body": "ÐŸÑ€Ð¸Ð²ÐµÑ‚ Ð´Ñ€ÑƒÐ³ÑŒ",
				"added": 1586928380
			},
			{
				"comment_id": 471,
				"body": "> [7657876](#comment_4_17HcMdT2teKdcnKf9BiXU3UGThS7GbrbyQ): ÐŸÑ€Ð¸Ð²ÐµÑ‚ ÑÐ°Ð¼ÑÐ¸Ð½Ð³ Ð±Ñ€Ð¾\n\nÐ¡Ð¿Ð°ÑÐ¸Ð±Ð¾ Ñ‡ÑƒÐ²Ð°Ðº",
				"added": 1587107722
			}
		],
		"1586990520_1Mj79LYD98Up6EBBtETMhWaLUk4uPhGbo2": [
			{
				"comment_id": 470,
				"body": "What the fuck is a trump buck",
				"added": 1586991552
			}
		],
		"1586435262_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 472,
				"body": "Yeah, they are probably going to put a microchip in the vaccine that tracks everything we do.",
				"added": 1587148519
			},
			{
				"comment_id": 473,
				"body": "Bill Gates has been a strong supporter of this. I still wonder how they would keep it powered if it is true.",
				"added": 1587148587
			},
			{
				"comment_id": 483,
				"body": "> [cexy](#comment_6_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL): I honestly don't think they are there yet with the chip micro tech. It's a maybe. Remember this would be first attempt from the NWO to vaccine everybody. If they just braindamage people little more and train them like animals that if you obey you 'get to go out of your house and see friends'.  [...]\n\nI only use linux and the open source bsd based distros now",
				"added": 1587334572
			},
			{
				"comment_id": 484,
				"body": "Yeah, I think they could get there eventually with the microchip. They aren't there just yet I believe.",
				"added": 1587334924
			}
		],
		"1587114042_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 474,
				"body": "Answer is probably not. They will try though.",
				"added": 1587148795
			}
		],
		"1586878140_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT": [
			{
				"comment_id": 475,
				"body": "Someone couls start a crypto exchange.if they wished. It would be hard to verify if they are scamming or not though.",
				"added": 1587149241
			},
			{
				"comment_id": 486,
				"body": "> [tvax](#comment_27_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): I mean if the exchange don't hold any funds and only allow peers to exchange assets it would pretty safe against scamming I suppose.\n\nHow do you confirm the peers are not scamming then?",
				"added": 1587580102
			},
			{
				"comment_id": 489,
				"body": "> [tvax](#comment_28_128dbVaHobAMsFW25rUVyFxwdCvvfkidzT): Bisq uses an escrow and a multisig contract. The contract is not closed until the two peers have successfully validated it by sending each other the crypto. If one on them doesn't validate, the contract is cancelled. Depending on the situation the guy being \"scammed\" get his funds back + the deposit of the other peer.\n\nI may use it then. Want to swap some cryptocurrencies. I also saw that this allows cash trades?",
				"added": 1587709706
			}
		],
		"1587248692_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 476,
				"body": "I would recommend mastodon, diaspora, some other fediverse platform, or skuttlebutt for social media. I would then recommend xmpp, briar, jami, or tox(Use with caution. Encryption protocol not audited.) for private messaging.",
				"added": 1587273100
			},
			{
				"comment_id": 477,
				"body": "Briar and Skuttlebutt are ones I would recommend you convince them to install because they work over bluetooth and local wifi. Everything else will be good also but be ready to use those if you can't access the internet.",
				"added": 1587273224
			},
			{
				"comment_id": 478,
				"body": "Matrix if you like chatrooms",
				"added": 1587273264
			},
			{
				"comment_id": 482,
				"body": "> [styromaniac](#comment_2059_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): SSB doesn't have a very good Android app. Briar is Android-only. [...]\n\nI would probably say diaspora* or Pleroma might be the best for federation. I am not a big user of the fediverse so I couldn't say for sure. Op could always set up his own server for anything though.",
				"added": 1587275052
			},
			{
				"comment_id": 485,
				"body": "> [kanade](#comment_95_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP): Send them to Minds, or something - it's similar enough to facebook but without the bullshit.\n\nMinds is pretty much just Trumpers and truthers now.",
				"added": 1587526496
			},
			{
				"comment_id": 490,
				"body": "> [styromaniac](#comment_2073_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I tried before.\n\nYou tried to bring your family on here? I would not do that myself. They could handle some of the people but probably wouldn't handle some of the more uncommon stuff on here.",
				"added": 1587710016
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 479,
				"body": "> [commandantecero](#comment_1_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Probably very few people are dying OF it. Media created hoax, everybody trying to get their dirty fingers on some of the loot and manipulate the public.\n\nNo, it isn't hoax. It is a real disease and you should be cautious. They are not reacting this way to \"protect us\" though. It is to mask the collapse of their economy.",
				"added": 1587273622
			}
		],
		"1587107506_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 480,
				"body": "> [z0z0z0z0z0z0z0z1](#comment_12_1GGSNB12PSSTBU2AoYyQaEU4jXqjXctVxZ): You are new here. If you put the user name on ZeroHello in search box you can see whole posting history under that account.  [...]\n\nNo, his brain won't turn to garbage. That isn't how weed works.",
				"added": 1587273770
			},
			{
				"comment_id": 481,
				"body": "I would recommend he doesn't smoke weed all the time or he will stop getting any pleasure from it. His decision to make.",
				"added": 1587274090
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 487,
				"body": "Right and left is a false dichotomy.",
				"added": 1587709116
			},
			{
				"comment_id": 501,
				"body": "> [draugrdeathlord](#comment_538_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): truth is we dont need to survey zerotalk.(starts typing into the NSA database and pulls up all your data)\n\nI want to look at one of those databases",
				"added": 1587790365
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [],
		"1587734994_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L": [
			{
				"comment_id": 497,
				"body": "Believing the mainstream media on everything is just as stupid as those people.",
				"added": 1587781784
			},
			{
				"comment_id": 504,
				"body": "> [commandantecero](#comment_9_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): Popular conspiracy theories: Professional wrestling is fake. Politicians are corrupt. The Nigerian prince isn't really going to send me any money, and he's not even a prince. Police lie. Wealthy and influential people engage in some disturbing things to entertain themselves. Which of these do you think are nonsense?\n\nNone of those are.",
				"added": 1587790563
			}
		],
		"1585090638_1nADL2gz5MoAsEjnoARpP4hPTVfBk5ri3": [
			{
				"comment_id": 498,
				"body": "Start to browse around and see what you can find.",
				"added": 1587781938
			}
		],
		"1587761800_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": [
			{
				"comment_id": 499,
				"body": "Matrix, xmpp, mumble, and let me think of some others.",
				"added": 1587782031
			},
			{
				"comment_id": 500,
				"body": "Nextcloud",
				"added": 1587782057
			}
		],
		"1588291956_1KsFe6vgVpNFCNTQDQryrcQYySkAbFLXCV": [
			{
				"comment_id": 506,
				"body": "Is this that site that won't let me do anything because I have an adblocker?",
				"added": 1588308836
			},
			{
				"comment_id": 507,
				"body": "The German one",
				"added": 1588308849
			}
		],
		"1588389325_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 508,
				"body": "He is inmortal",
				"added": 1588401912
			},
			{
				"comment_id": 512,
				"body": "Kim doesn't have to jerk off because he jerked off by god divine",
				"added": 1588651740
			},
			{
				"comment_id": 513,
				"body": "> [styromaniac](#comment_2117_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): KJU can beat up 20 men while masturbating.\n\nIn which way? He is god",
				"added": 1588651785
			}
		],
		"1588557676_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 509,
				"body": "And let me guess. It is proprietary.",
				"added": 1588638292
			}
		],
		"1588505836_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 510,
				"body": "> [randname666](#comment_27_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK): Well, commies are still learning. China is already working on a M0 level (equal to coins and bills) cryptocurrency called DCEP.\n\nIt aint crypto",
				"added": 1588651626
			},
			{
				"comment_id": 511,
				"body": "It is non-crypto digital track currency",
				"added": 1588651676
			},
			{
				"comment_id": 518,
				"body": "All of you have forgotten to ask the question you should have already: @blurhy, what is your definition of communism?",
				"added": 1588784574
			},
			{
				"comment_id": 519,
				"body": "Also explain your political ideology. Everyone has different definitions of terms like communism, socialism, and capitalism. They are really meaningless terms. So I want to hear what you think.",
				"added": 1588784691
			},
			{
				"comment_id": 584,
				"body": "> [destroyer2](#comment_2_1NyQjj3DHz272iRXr7pQzesmNYQ7jgqjTJ): Anarcho-Communism is impossible. Once people learn to trade again it will become Anarcho-Capitalism. The way I see it is that technological progress will render the formation of a state impossible, but that will not happen for a long time.The four technologies needed for this to happen are as follows: [...]\n\nOr you just need people to be able to manufactor on a smaller scale.",
				"added": 1592785994
			},
			{
				"comment_id": 585,
				"body": "2 could come very soon and 1 could be matched with small scale manufacturing.",
				"added": 1592786044
			},
			{
				"comment_id": 595,
				"body": "> [blurhy](#comment_537_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Isn't code a type of resource ?\n\nHe means non-virtual resources.",
				"added": 1593321382
			},
			{
				"comment_id": 600,
				"body": "> [blurhy](#comment_538_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): I mean all types of resource\n\nPlans, technical documents, and manufacturing instructions being open source? Yes. just like code, these can be cloned. The actual resource that someone has to put in labor and resources to manufacture? No.",
				"added": 1593491984
			}
		],
		"1588691349_1Jiwv87WRUY6BjRv7Lt5gocur6nfhEvHBS": [
			{
				"comment_id": 514,
				"body": "His attempt to end polio caused an outbreak.",
				"added": 1588703795
			}
		],
		"1588692906_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 515,
				"body": "Depends on where you discuss it.",
				"added": 1588703901
			}
		],
		"1588757239_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 516,
				"body": "> [nesselon](#comment_3_15wHfknPYGm91ZDyofsrYnhHzW4zH6xpXU): Man you need to either check your medication or rethink/readjust your substance abuse.\n\nYou're an idiot. Just believe everything the Mainstream Media tells you.",
				"added": 1588783594
			},
			{
				"comment_id": 523,
				"body": "> [nesselon](#comment_6_15wHfknPYGm91ZDyofsrYnhHzW4zH6xpXU): Idiot, hm?Is your life so boring that you prefer to believe some random wild shit someone tells you on youtube?Being critical is important, mainstream media or random source. But I don't need some wild ass conspiracy theory to feel alive. [...]\n\nStrawman. I never said to drink or inject disinfectant.",
				"added": 1589150285
			}
		],
		"1588776312_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4": [
			{
				"comment_id": 517,
				"body": "I am not installing that shitty closed source browser.",
				"added": 1588784238
			},
			{
				"comment_id": 541,
				"body": "> [anonops7](#comment_6_1JcwRQXC7dv2FhRNr44Kzm3tEAJjLiPde4): You have to get yourself referrals. You have link in the about section of the app that shows you how.\n\nSo it's a pyramid scheme?",
				"added": 1589950638
			}
		],
		"1588879288_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": [
			{
				"comment_id": 520,
				"body": "> [borys](#comment_6_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P): We need good alternative to Android and IOS. I there any?\n\nUbports, PostMarket OS, Lineage, Graphene...",
				"added": 1588899004
			},
			{
				"comment_id": 521,
				"body": "Any Linux or BSD Distro also",
				"added": 1588899037
			}
		],
		"1589122966_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 522,
				"body": "What if I don't agree with either of the two options?",
				"added": 1589149685
			},
			{
				"comment_id": 525,
				"body": "Whatever this test is supposed to mean and didn't have answers I wanted:\nfanatic federal 90%\nNeutral 50%\nGlobalist 70%\nExtreme pacifist 80%\nFanatic freedom 100%\nFanatic markets 100%\nExtreme Secular 80%\nProgressive 70%\nFanatic multiculturalist 100%",
				"added": 1589218392
			},
			{
				"comment_id": 526,
				"body": "I guess the 80% in secular is because I don't think people should be banned from practicing religion even though I disagree with it?",
				"added": 1589218536
			}
		],
		"1589118404_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw": [
			{
				"comment_id": 524,
				"body": "> [zaron](#comment_86_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): The aliens are coming\n\nHAHAHA you are so funny!",
				"added": 1589175853
			}
		],
		"1589101552_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 527,
				"body": "> [krak3n777777](#comment_3_1Ak954F5JD1uxGvAduUz9YwZFrVGe1L8Cw): There goes the Bill of Rights :(\n\nThere never was a bill of rights to begin with.",
				"added": 1589222517
			}
		],
		"1589343359_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 528,
				"body": "Fuck! I could at least use shapeshift to change the crypto I had from scamming people and marketing companies in the past.",
				"added": 1589345423
			},
			{
				"comment_id": 529,
				"body": "Also nice to see you back",
				"added": 1589345441
			}
		],
		"1589400640_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 531,
				"body": "You got any videos?",
				"added": 1589431620
			},
			{
				"comment_id": 532,
				"body": "That you took personally?",
				"added": 1589432720
			}
		],
		"1588835683_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 533,
				"body": "Cryptocurrency for first",
				"added": 1589432845
			}
		],
		"1589536277_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 534,
				"body": "> [aassddff](#comment_9_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): The body regulates tension on it's own, and sexual tension is a good thing that drives you forward to do better stuff.Rather, people masturbate and waste the energy they could use on something better.\n\nSounds like something straight out of 1984",
				"added": 1589686461
			},
			{
				"comment_id": 535,
				"body": "Did he even post anything good or is it just going to be obese 40 year olds",
				"added": 1589686704
			},
			{
				"comment_id": 536,
				"body": "Oh wow, he is really into rape.",
				"added": 1589686753
			},
			{
				"comment_id": 537,
				"body": "One said young girl so let me make sure zeronet didn't start seeding those automatically.",
				"added": 1589686804
			},
			{
				"comment_id": 538,
				"body": "> [blurhy](#comment_505_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK): Do you mean me ? It does not suit my taste\n\nOP is. Not you",
				"added": 1589691926
			}
		],
		"1589689650_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 539,
				"body": "I just worked today then took a nap shortly after I got home.",
				"added": 1589765869
			}
		],
		"1589899830_18fPUkt6NqUxRtpYgETn1fFmseYek1sJfF": [
			{
				"comment_id": 540,
				"body": "Can you explain why you like rape so much? Now you are uploading that anime game where that guy rapes a girls whole family as revenge for failing a rape on her and getting sent to prison.",
				"added": 1589950210
			}
		],
		"1589664235_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": [
			{
				"comment_id": 542,
				"body": "> [agentrogue](#comment_1_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw): not using windows for anything but normie stuff check, TOR and VPN check, bleachbit check, using nonstream browsers check, RFID protection check, good password generator check, password manager check, lots and P2P communication and darknets check, E2E chats check, hardware switches on phone check.\n\nAgentrogue? Is that you? You may know me from xmpp.",
				"added": 1589951046
			}
		],
		"1587791009_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": [
			{
				"comment_id": 543,
				"body": "Guy submits to the fbi at the end. We all know they are in on this.",
				"added": 1590109191
			}
		],
		"1590345225_14X7YqX1gTpjnnsLEbLfk1V3Wjs8tNztaA": [
			{
				"comment_id": 544,
				"body": "> [nekololi](#comment_464_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB): i can't believe there are people who still use the zeronet 8chan bunker\n\nThere are a few",
				"added": 1590375166
			}
		],
		"1590376016_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 545,
				"body": "Sometimes it is hard to comprehend how stupid some people are.",
				"added": 1590443815
			}
		],
		"1590689346_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 546,
				"body": "Saw this when you sent it on xmpp. I don't care that much about it.",
				"added": 1590705936
			},
			{
				"comment_id": 547,
				"body": "Just Twitter, Google, and Facebook which are already mostly nationalized",
				"added": 1590705973
			},
			{
				"comment_id": 548,
				"body": "We still need to get a global mesh network set up but I already use the decentralized and federated alternatives which would be impossible to nationalize",
				"added": 1590706047
			}
		],
		"1590778185_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": [
			{
				"comment_id": 549,
				"body": "Is this the Bill Gates Ted Talk?",
				"added": 1590878329
			},
			{
				"comment_id": 550,
				"body": "> [styromaniac](#comment_2294_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): It's about what was originally planned for the pandemic.\n\nJust watched it.",
				"added": 1590896553
			}
		],
		"1590898064_1H9xEgESUhfvpYK3SLLqabc1uLT2jsmH2A": [
			{
				"comment_id": 551,
				"body": "People need to blow the cops brains out when they are doing this shit if you want to see change.",
				"added": 1590900927
			}
		],
		"1590978133_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 552,
				"body": "\"Industrial-grade\"\nWell, he doesn't understand encryption.",
				"added": 1590980638
			},
			{
				"comment_id": 553,
				"body": "At least it wasn't \"military-grade\"",
				"added": 1590980663
			}
		],
		"1590981433_19mfoWfh42vCabe3TVkFSXRTJKyFqmiMUA": [
			{
				"comment_id": 554,
				"body": "Nice bait",
				"added": 1590984757
			}
		],
		"1591131478_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 555,
				"body": "What?",
				"added": 1591137848
			}
		],
		"1591199751_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 556,
				"body": "> [test123a](#comment_10_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ): Video on bitchute. Woman says he isn't dead. [...]\n\nI wouldn't go as far to say that.",
				"added": 1591336947
			}
		],
		"1591633616_17kfQsU2wofPg9sM1smPiny9K1yzLc7Pux": [
			{
				"comment_id": 557,
				"body": "Probably just accounts he created.",
				"added": 1591723449
			}
		],
		"1591776814_1EisAdDMyEXWtPiKWM8t4wme5yXX1q9552": [
			{
				"comment_id": 558,
				"body": "I don't give a shit whether it is open or closed.",
				"added": 1591818227
			},
			{
				"comment_id": 562,
				"body": "> [zeroglow](#comment_1_1L2ZwsfRArS2LcgnNbDy8JK3rYVSgATMmz): fuck twitter. How about Gab?\n\nGab is the controlled opposition platform for boomer conservatives.",
				"added": 1592207655
			}
		],
		"1591821395_19ev8HmfPQ2VC8aWDA4Ck7E2vLYDYFgw9P": [
			{
				"comment_id": 559,
				"body": "Grab what you want before it is down.",
				"added": 1591825251
			}
		],
		"1591795514_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26": [
			{
				"comment_id": 560,
				"body": "> [agentrogue](#comment_17_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw): this is honestly a solid indicator of the growing political instability of America. only a matter of time before we see more of these zones pop up or violent suppression of them by the govenment waco/ruby ridge style. either way this situation has little chance of going back to normal. probably a good idea to have a plan in your back pocket incase things really go to shit.\n\nA plan or a few",
				"added": 1592024806
			},
			{
				"comment_id": 566,
				"body": "> [bigbadbob](#comment_1088_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Do people actually have jobs or is this just another tent city?\n\nIt is pretty much slab city you could say but with blm protesters instead of hippies. It is also governed by a sound cloud rapper.",
				"added": 1592279546
			},
			{
				"comment_id": 567,
				"body": "> [0435048ijg](#comment_38_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5): Lol, Gardens don't just spring up over night. I mean, I am not saying it's perfect it's deff got some problems but we've not seen something like this in America for at least 60 years.\n\nExplain that to them when they are trying to grow food with their shit after a few days. It takes 1-2 years before you can use human shit to grow food. They should at least get an emergency supply set up until they have a reliable way of growing food or create a trade network.\n\n The US is slowly dying and the US will reabsorb this commune but I believe more will start to pop up. (If it isn't a psy-op already which is very likely. It will stay if it is.)",
				"added": 1592292663
			},
			{
				"comment_id": 568,
				"body": "Any images of the zone viewed from air?",
				"added": 1592292750
			},
			{
				"comment_id": 576,
				"body": "> [schiz0@kxoid.bit](#comment_35_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): PKAZ was short lived. [...]\n\nLol",
				"added": 1592588081
			},
			{
				"comment_id": 577,
				"body": "So a black antifa member? I haven't seen one of those before.",
				"added": 1592594930
			},
			{
				"comment_id": 578,
				"body": "I liked the video where the cops removed the road block and you guys are thinking of it like a medieval castle siege. You are children.",
				"added": 1592628991
			},
			{
				"comment_id": 579,
				"body": "> [schiz0@kxoid.bit](#comment_42_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): An update on the shooting inside the Seattle's CHOP / Autonomous Zone: [...]\n\nAnd what did you expect? You need to be prepared and have self reliance if you plan on seceding. Having 6 residentential blocks with no resources won't help you be independent and you will be reliant on aid from the outside. This would be like America asking Britian to help aid them during the Revolutionary War.",
				"added": 1592752374
			},
			{
				"comment_id": 580,
				"body": "There are also barricaded streets which hinder them from entering.",
				"added": 1592752436
			},
			{
				"comment_id": 603,
				"body": "> [schiz0@kxoid.bit](#comment_44_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): CHAZ/CHOP has fallen - Seattle Police retake anarchist-held CHAZ [...]\n\nYes it has fallen. Ok, now back to the cold that is going to kill everyone.",
				"added": 1593728517
			},
			{
				"comment_id": 604,
				"body": "There wasn't even a fight in the retaking. I thought at least one cop would be injured.",
				"added": 1593731499
			},
			{
				"comment_id": 607,
				"body": "> [schiz0@kxoid.bit](#comment_45_13i223c4P7HfiKEu9cxEGXptQ77i8JEs26): When CHOP was first built, Seattle Police falsely accused CHOP of setting up ID check points, closing businesses, and terrorizing residents by patrolling the streets. They are now doing all of that and more, and claiming they have the authority to continue doing it for 10 days. [...]\n\nSo CHAZ created it's own police and you guys were fine but when the actual police do something then you are not okay. Same goes for your enemies in reverse.",
				"added": 1593817610
			},
			{
				"comment_id": 608,
				"body": "Fuck, none of us can know what really happened at CHAZ unless we were there. I personally feel it was a psy-op.",
				"added": 1593817713
			}
		],
		"1592133605_1LZUsLPdv5RUx1VVGP81RyKwiHTfSxgSL1": [
			{
				"comment_id": 561,
				"body": "No",
				"added": 1592160082
			}
		],
		"1592177248_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 563,
				"body": "Yeah, this shit will be patented",
				"added": 1592247062
			},
			{
				"comment_id": 564,
				"body": "> [frankwalter](#comment_21_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): yeah, but this is not a problem for an individual, who synthesizes the pharmaceutical for himself.\n\nAnd you are trying to get some people to figure out how to? One thing with patents is that the patent holder has to publish what it is they do to make it and some plans.",
				"added": 1592254084
			},
			{
				"comment_id": 565,
				"body": "Wait for them to get the patent then take the details.",
				"added": 1592254136
			}
		],
		"1592362442_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 569,
				"body": "Sounds like most regions",
				"added": 1592369558
			}
		],
		"1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU": [
			{
				"comment_id": 570,
				"body": "There are zites for games like chess. Having decentralized gaming isn't really a good idea. There would be many latency issues with people in the game having different pings to each user. Gaming would have to work on a federated model.",
				"added": 1592503453
			},
			{
				"comment_id": 571,
				"body": "1v1 games or turn based games could work though.",
				"added": 1592503505
			},
			{
				"comment_id": 572,
				"body": "http://127.0.0.1:43110/1Ag6xidDHiPgWoDKhfSx4xFQr6WC3NqxZg/?/play",
				"added": 1592503718
			},
			{
				"comment_id": 583,
				"body": "> [frankwalter](#comment_28_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Usually multiplayer games work that a peer hosts the game and everyone else who wants to join this session connects to it. Obviously a similar design on zeronet is as possible as on the normal web. Regardless of the latency, also because if so far they have done so, it is not that all the problems come when you have to put on zeronet.\n\nYeah, you need a peer to host. That is what I mean.",
				"added": 1592785831
			},
			{
				"comment_id": 587,
				"body": "> [deplikeunicorn](#comment_1_14jqGS9YxwYjrxw5LmTJUSBZQt7FSDQJ96): Retroarch have a different take on this. It s mostly for emulation but what they does it sync the execution of the game on 2 different device to be like one device. Or like parsec fonctionality where u can join server\n\nBut one device functions as the server I believe. (Btw, we should play f-zero on retroarch maybe?",
				"added": 1592793276
			},
			{
				"comment_id": 588,
				"body": "(N64 racing game if you didn't know. The most popular driver became a meme in SSB on Wii. Falcooon Puuuunch.)",
				"added": 1592793409
			}
		],
		"1592521813_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 573,
				"body": "> [zaron](#comment_144_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU): Would a dino be furry or leathery? Or feathery?\n\nI think you should go leather.",
				"added": 1592535891
			},
			{
				"comment_id": 574,
				"body": "But some dinosaurs have feathers.",
				"added": 1592535924
			},
			{
				"comment_id": 575,
				"body": "Feather cock, leather body.",
				"added": 1592536065
			},
			{
				"comment_id": 582,
				"body": "Can someone just send him a furrysuit so he will go away.",
				"added": 1592767478
			}
		],
		"1592765143_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 581,
				"body": "Still no way to prevent scamming. You would need autonomous middleman wallets that would hold the coins and send them when both parties have deposited.",
				"added": 1592767361
			},
			{
				"comment_id": 586,
				"body": "> [frankwalter](#comment_31_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): I know, the way is obviously there. I'm working on it. I opened the thread to see if there was interest in the zeronet community.\n\nOk, I would be interested then but I am not going to be the first to test and I want to see the source code.",
				"added": 1592786185
			}
		],
		"1579175074_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 589,
				"body": "> [thetruth](#comment_158_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ): A Reminder to TRUTH...\n\nBack again to troll some more?",
				"added": 1592847069
			}
		],
		"1592950813_1PGtPmD5NAWpf4kaEB1qquveCN8S4LUqrq": [
			{
				"comment_id": 590,
				"body": "How did you end up here? This is something I would expect from an 11 year old kid going on tor because they think they are edgy when they do.",
				"added": 1592971046
			}
		],
		"1593159226_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji": [
			{
				"comment_id": 591,
				"body": "Conversations or aTalk",
				"added": 1593177225
			}
		],
		"1593195001_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": [
			{
				"comment_id": 592,
				"body": "I still use android. I may switch over to lineage soon.",
				"added": 1593196162
			},
			{
				"comment_id": 593,
				"body": "> [blahblah69](#comment_100_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): Been using linux for a while now, no more windows or Mac for this guy, next is an OTG phone\n\nLinux for over a year now",
				"added": 1593216191
			},
			{
				"comment_id": 594,
				"body": "> [adxenc73jd](#comment_17_14cTEgRAd2nzUgLHkWNXwJ4E8Ue5mECeji): Don't just use Linux on your computer. Also use: 1. ME-Cleaner 2. Devuan 3. Librem 5.\n\nYou don't have to use a librem laptop. There are other options. As there is also *bsd as an alternative to linux.",
				"added": 1593218584
			},
			{
				"comment_id": 598,
				"body": "> [slondrex](#comment_2_1AMDCwJEDNWWiP3KVp5M9vCCaj91tefBbB): Lineage is Android\n\nA modified version idiot.",
				"added": 1593479666
			},
			{
				"comment_id": 599,
				"body": "> [commandantecero](#comment_58_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): I too would like a phone running Linux, and I don't understand why what you would run on a Raspberry Pi wouldn't run on a phone. Why shouldn't it?\n\nIt could. It is just how the operating system is designed on phones. There are things like post market os, ubports, plasma mobile... that are trying to change that.",
				"added": 1593491258
			}
		],
		"1593359750_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 596,
				"body": "> [scotcyguy2](#comment_41_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX): Bill Gates??   Lets ask other un-qualified random people about stuff...What does Belinda Carlisle think about quantum physics?\n\nI think a pop singer could answer that better.",
				"added": 1593367133
			},
			{
				"comment_id": 597,
				"body": "> [frankwalter](#comment_38_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV): Bill Gates has been studying pandemics for many years, helped by experts in the field.\n\nAnd has caused outbreaks in third world countries and sterilized people.",
				"added": 1593367174
			}
		],
		"1593724956_18FmpbxghV4UBgrjHpwgU1igoAt2gRzApL": [
			{
				"comment_id": 601,
				"body": "https://privacytools.io",
				"added": 1593728290
			},
			{
				"comment_id": 602,
				"body": "That website should show you most of what should be good on a software level.",
				"added": 1593728368
			}
		],
		"1593525780_12vUEi3fE9s7VKn8XtAaRfdEKtgfhuDTmJ": [
			{
				"comment_id": 605,
				"body": "I don't automativally ttust anyone regardless of their race.",
				"added": 1593731780
			},
			{
				"comment_id": 606,
				"body": "> [styromaniac](#comment_2410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): My first employer's (Fremont Community Digester) parent company (Novi Energy) trusted a bank just because they're Indian too. That was a mistake. Indus Bank sunk Fremont Community Digester. No funds released for repairs, nothing, nada, zip. It was a shit hole. This ended in a lawsuit by the USDA.\n\nLol",
				"added": 1593737100
			}
		],
		"1593798901_14EvrR9QiEpqhQyZDFiftdgAXzNQ1x8XH1": [
			{
				"comment_id": 609,
				"body": "He is talking about some bank in BRiD. (Whatever that is)",
				"added": 1593817814
			},
			{
				"comment_id": 610,
				"body": "Or it is a mirror of something I guess. Nvm",
				"added": 1593817979
			}
		],
		"1594185414_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": [
			{
				"comment_id": 611,
				"body": "And what is this post?",
				"added": 1594188492
			}
		],
		"1594305760_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [
			{
				"comment_id": 612,
				"body": "Wait, I think I am 1/128th Indian or something like that. So, no taxes then? That guy should just be executed by the way.",
				"added": 1594317921
			},
			{
				"comment_id": 621,
				"body": "> [zeronetbackups](#comment_9_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): The so called \"Native Americans\" are of the mongoloid race. Mongoloids are native to Asia. They invaded America long after White people migrated there and before jews invaded and established \"America\". People who can look at these mongoloids and not see an obvious asian should be sterilized.\n\nAnd what is you explaination for how South American tribes like the Olmecs, Mayans, Aztecs, Incans... evolved in your revisionist history.",
				"added": 1596044633
			},
			{
				"comment_id": 622,
				"body": "The Native Americans crossed over the Bering Strait during a small ice age long before the first White person entered the Western Hemisphere. Yes, they are relatives of mongolians but white people weren't in America. All humans actually originated in Africa so none of us are native to places with your thinking.",
				"added": 1596044944
			}
		],
		"1594313562_1ETarTu7fyokpgRoBMiGZc8L3FwnDTGstL": [
			{
				"comment_id": 613,
				"body": "Who the fuck says dioxygen? Oxygen gas is the common term",
				"added": 1594352649
			},
			{
				"comment_id": 614,
				"body": "A large wave won't manipulate a molecule.",
				"added": 1594352694
			},
			{
				"comment_id": 615,
				"body": "Please tell me you don't have some crazy theory about how the lizard people are sending out 60 ghz waves to manipulate the oxygen we breath.",
				"added": 1594352828
			}
		],
		"1594250812_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": [
			{
				"comment_id": 616,
				"body": "It is closed source and they require an id to use it.",
				"added": 1594479994
			}
		],
		"1594974805_1G79HnSxfCixN2HD2jP1Zabs1B8xzw298s": [
			{
				"comment_id": 617,
				"body": "I have a feeling that thereset is one of thetruth's other ids.",
				"added": 1595012499
			},
			{
				"comment_id": 618,
				"body": "The twitter hack may be an inside job but what does discrediting bitcoins have to do with any of this.",
				"added": 1595012672
			}
		],
		"1595539570_14DNyAMGhtRAujyha8zv5Gv6WNCEbotvcj": [
			{
				"comment_id": 619,
				"body": "Lxde, xfce are lightweight desktop environments",
				"added": 1595540330
			}
		],
		"1595854660_1BjmA3jeeStMXDjordfpDvk75HaWCUWuVn": [
			{
				"comment_id": 620,
				"body": "> [zeronetbackups](#comment_3_1NnNkUjvgoqCmr2mFkUx8HWJ28Nx1CYP3E): Says the moron who didn't even care to learn something... [...]\n\nYou guys are just too stupid to figure out that you need someone to be seeding the file and hardly anyone is going to want to seed your stupid shit so you need to leave zeronet running if you want the file seeded. You should do this even if it is a document of interest so you give other people time to start seeding.",
				"added": 1596044224
			}
		],
		"1597034762_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 623,
				"body": "Shit, don't actually inhale bleach to all the schizos here.",
				"added": 1597034897
			}
		],
		"1596985537_12BoU1NpWC9niVqBeRueg6Mox5PehgjEU9": [
			{
				"comment_id": 624,
				"body": "Maybe someone in the future will make one.",
				"added": 1597102698
			}
		],
		"1597030160_184rhnxM89SU1gDuPEaQPjynfytkRtSEVd": [
			{
				"comment_id": 625,
				"body": "> [otbtechnologies7](#comment_80_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w): Just got a report from a gentleman in China that this is fake news... So yeah...? Lol [...]\n\nYeah, I have a feeling the US will start saying China is doing this stuff exactly as they are doing it.",
				"added": 1597365016
			},
			{
				"comment_id": 626,
				"body": "Already are",
				"added": 1597365024
			}
		],
		"1597273154_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 627,
				"body": "I'd maybe like to work on something in the future. I need to improve a few skills first though.",
				"added": 1597365261
			},
			{
				"comment_id": 628,
				"body": "> [swashbuckler](#comment_40_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ): Not a good idea for ZeroNet in his current state.Do not make ZN another gaming place - it is not designed for such stuff, imo.Better make it geek/tech community and spread things that are hard to find in clearnet.\n\nMany people are lead into tech communities through gaming and ZeroNet is supposed to be for many diverse communities and not just one. Some people will also have to make the developments and they will need knowledge in tech to do that which will end up attracting more people with tech knowledge.\n\nAlso, don't pretend like there aren't idiots on this site already. (I may have commited 3rd degree genocide against many of them seeing the intelligence spike in the posts since my recent action ;))",
				"added": 1597365563
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 629,
				"body": "Looks like a dead project. I want to see a mesh network project that manages to survive. None of the sheep are interested though.",
				"added": 1597375992
			},
			{
				"comment_id": 630,
				"body": "> [driud](#comment_90_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): Witam; Ciekawy projekt; Pytanie?. Czy sÄ… inne tego typu projekty?. Jak moÅ¼na siÄ™ do tego przyÅ‚Ä…czyÄ‡?. Czy jest coÅ›, na temat po Polsku?. Jak bardzo trudno to zainstalowaÄ‡?. Czy ktoÅ› posiada wiedzÄ™ w tym temacie.JeÅ›li tak; to proszÄ™ o wiÄ™cej informacji na ten temat..Wireless Mesh Networks to Circumvent Internet BlackoutsHello; Interesting project; Question?. Are there other projects of this type?. How can you join this?. Is there anything in Polish?. How hard is it to install?. Does anyone have knowledge in this topic.If so; then I am asking for more information on this.\n\nMaybe you and some of your friends could help make Polish translations on these types of projects.",
				"added": 1597445916
			},
			{
				"comment_id": 634,
				"body": "> [wwg1wga](#comment_8_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): LOL! Look at this here! [...]\n\nAlthea? Was that one created by artists?",
				"added": 1597790724
			}
		],
		"1597634370_1BTSiEMot7LSVFGq9dgyJFDmXVg2v7ev9W": [
			{
				"comment_id": 631,
				"body": "Is it dudes or lesbians",
				"added": 1597636314
			},
			{
				"comment_id": 633,
				"body": "> [styromaniac](#comment_2521_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Dudes\n\nOk, saved me there.",
				"added": 1597711502
			}
		],
		"1597624836_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": [
			{
				"comment_id": 632,
				"body": "Continue seeding for some time so others can help you seed.",
				"added": 1597636346
			}
		],
		"1597850097_18V1ciZXAi5ghNxwQKYP1qoSRZYWv4uFFc": [
			{
				"comment_id": 635,
				"body": "Why use apple in the first place?",
				"added": 1597861193
			}
		],
		"1596824289_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 636,
				"body": "Where is the source for shoutr?",
				"added": 1598031673
			}
		],
		"1598402904_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 637,
				"body": "Lineage os\ngraphene os",
				"added": 1598413054
			},
			{
				"comment_id": 638,
				"body": "Or you root your device and uninstall all the proprietary google services.",
				"added": 1598413084
			}
		],
		"1598474233_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 639,
				"body": "Lol. Why do I need a specialized linux distro to do that instead of a normal one? \"Advertising fees\" lol",
				"added": 1598501114
			}
		],
		"1599173288_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 640,
				"body": "English in the english forum. You can write your comment in both English and French (or whatever you are speaking) so if people misinterpret what you said.",
				"added": 1599282541
			}
		],
		"1599297078_1HMvhRJegHrC92gxZhrPBeATg69tZRjtCj": [
			{
				"comment_id": 641,
				"body": "> [papull](#comment_3_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G): I never could figure out how to use IPFS.\n\nPretty simple. Just follow their documentation.",
				"added": 1599325507
			}
		],
		"1599528409_1CZfuDkX6sVNsQKh4SrF2gKU2Yij1kYeuo": [
			{
				"comment_id": 642,
				"body": "You need to leave zeronet running in order to seed it.",
				"added": 1599538402
			}
		],
		"1599982453_1PUkWFbzkD4dyRZ2vH3G8WeQw4m2UVPA2p": [
			{
				"comment_id": 643,
				"body": "Can you quit making so many accounts? I mute one then another pops up",
				"added": 1600037729
			}
		],
		"1600203501_1PeJFqX7dteyheZUL9asr6yK3fBa45uiqb": [
			{
				"comment_id": 644,
				"body": "http://127.0.0.1:43110/193psz3yGj7EH39nyKb4A2KKBXEHT49Csf",
				"added": 1600205211
			}
		],
		"1600200644_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 645,
				"body": "> [anshorei](#comment_164_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS): The problem is you need a trusted way to store the gamestate. [...]\n\n^^",
				"added": 1600209936
			},
			{
				"comment_id": 646,
				"body": "I made a post about this question in another thread a while back",
				"added": 1600209978
			},
			{
				"comment_id": 647,
				"body": "http://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1592403341_12MBVCw8iNrKvgTrV5NMPtPf6Z5V2WRHYU/Gaming\n\nHere it is",
				"added": 1600210343
			}
		],
		"1600215526_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 648,
				"body": "Nice.",
				"added": 1600317580
			},
			{
				"comment_id": 649,
				"body": "Termux is another option for those of you who don't want apps for these services.",
				"added": 1600317623
			}
		],
		"1600902116_1A2q7qJ8xFsE2p1sdzkN87rQQx5Hdkdppx": [
			{
				"comment_id": 650,
				"body": "You are going to fail.",
				"added": 1600907928
			},
			{
				"comment_id": 651,
				"body": "(I say whatever when drunk)",
				"added": 1600907950
			},
			{
				"comment_id": 653,
				"body": "So a website on zeronet? Get a raspberry pi or some cheap computer that you can leave running 24/7 to continue to seed. You can't just hit and run on zeronet.",
				"added": 1600922431
			}
		],
		"1600910324_1HUJnDBVdBTtNGsr1V5xZJiNLwd6T7jEW5": [
			{
				"comment_id": 652,
				"body": "My coworkers would leave in a second if they had an excuse to.",
				"added": 1600912647
			}
		],
		"1601059958_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 654,
				"body": "> [jeff](#comment_61_1JFfyAT1DysW4LbK6WRd2szDoPjWgb22NT): Sound does not offer a lot of bandwidth. Transfers will be s-l-o-w.\n\nDial up internet work this way. Nothing new. High pitched for 1 and lower pitch for 0 I believe it was.",
				"added": 1601092560
			}
		],
		"1601010152_1JzVFcSHTgVo7B3XWbznqCrooUdMsDgM94": [
			{
				"comment_id": 655,
				"body": "Linux is already way better. How would this make open source development cum?",
				"added": 1601092935
			}
		],
		"1601208895_1D3SuneqYipUHksZp9VuJBjC7ReiAvqYCV": [
			{
				"comment_id": 656,
				"body": "Not you again. One post is enough.",
				"added": 1601245584
			},
			{
				"comment_id": 657,
				"body": "Maybe this helps wine development but that is it.",
				"added": 1601245613
			},
			{
				"comment_id": 658,
				"body": "Maybe some forks of it but I will stick with linux.",
				"added": 1601245653
			}
		],
		"1601418179_15TSdTU5ZrAHXXiMQvMUEEUm17GFt5WqWp": [
			{
				"comment_id": 659,
				"body": "Leave a dedicated computer running until you have enough seeders and maybe keep it running after that.",
				"added": 1601435011
			}
		],
		"1601641777_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [],
		"1602257402_1abBjBW8axFAtcZN11jv527Wi2noBZurv": [
			{
				"comment_id": 662,
				"body": "Go off grid in a remote location.",
				"added": 1602264023
			},
			{
				"comment_id": 663,
				"body": "Start researching construction, farming ...",
				"added": 1602264075
			}
		],
		"1603253044_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 664,
				"body": "Writing this before sleep so probably doesn't make sense.",
				"added": 1603253078
			},
			{
				"comment_id": 665,
				"body": "Idea came from Unix.",
				"added": 1603253129
			},
			{
				"comment_id": 666,
				"body": "I thought about that just before I fell asleep. Storage may be an issue with the translator.",
				"added": 1603289631
			}
		],
		"1602349275_1PZGm95frq3d9vSuQCNWdGbvC3G6TzRGa7": [
			{
				"comment_id": 667,
				"body": "Guy named qarmy. No wonder I am not seeing his posts. He was one of otbtechnologies's alts, yes?",
				"added": 1603289916
			}
		],
		"1603368158_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 668,
				"body": "Well, he is infecting idiots who download cheats. I just think it is funny.",
				"added": 1603411531
			}
		],
		"1603385950_129Djo6fqb7fviR6j7SC25e1m5fE4MbCQU": [
			{
				"comment_id": 669,
				"body": "Homemade weapons tutorials are really easy to find. I know a few websites on tor and the clearnet. The assassinations? You have been watching too many movies.",
				"added": 1603471906
			},
			{
				"comment_id": 730,
				"body": "> [quantumkitty](#comment_496_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu): Good thing you mentioned that. Some people here seem to think that spreading misinformation about coronavirus is some kind of brave revolutionary act.. yet are too pussy to even open up a shop selling weed for bitcoin. (or anything non-illegal)\n\nMy goals are more long term.",
				"added": 1608100953
			}
		],
		"1604109014_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 670,
				"body": "> [styromaniac](#comment_2660_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Pedo Joe's alive in some form.\n\nLike a cyborg ninja like that guy in metal gear solid who helps you destroy metal gear rex? (grey fox was his name I think.)",
				"added": 1604443781
			},
			{
				"comment_id": 671,
				"body": "Or more like Frankenstein's monster?",
				"added": 1604444052
			},
			{
				"comment_id": 672,
				"body": "Frankenjoe",
				"added": 1604444064
			}
		],
		"1605198755_14g2gXnsZdEPShFJkGdh5W3eGXmKzqW6F8": [
			{
				"comment_id": 673,
				"body": "You have the computer detect it as a keyboard then you add a script that runs keystrokes.",
				"added": 1605209675
			}
		],
		"1605531104_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 674,
				"body": "http://127.0.0.1:43110/1DdPHedr5Tz55EtQWxqvsbEXPdc4uCVi9D\n\nDead now though",
				"added": 1605551282
			},
			{
				"comment_id": 675,
				"body": "A few ocasional users",
				"added": 1605551296
			},
			{
				"comment_id": 676,
				"body": "http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/\n\nMillchan, used sometimes.",
				"added": 1605551363
			},
			{
				"comment_id": 682,
				"body": "> [zenanon](#comment_91_14kTJXu4KZSoWSSNcGtXEijf4NqEGimc9J): That is the first time I've seen that zite. But, yes, that one doesn't have a /pol/. I was under the impression that the one in my last reply (beginning 1DdPH...) is the real 08Chan and it does have a /pol/\n\nYou are correct millchan is just another chan. 08chan is the first one.",
				"added": 1605801022
			},
			{
				"comment_id": 683,
				"body": "http://127.0.0.1:43110/1ADQAHsqsie5PBeQhQgjcKmUu3qdPFg6aA/?:users/1AtvCHH1vmbBNeoaKKzWZGZgBKY8SDHYGx:pol:0\n\nThis is the pol board on millchan",
				"added": 1605801218
			}
		],
		"1605294278_1KNkHfHESMzY6Lg7wCVkMzY5a4RenNw9kC": [
			{
				"comment_id": 677,
				"body": "I think having a content feed zite then having people create their own zite that hosts the videos would be a cool solution",
				"added": 1605551492
			}
		],
		"1605282602_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 678,
				"body": "I do think we could see a time where ai is like a human and I do think that would give it human rights.",
				"added": 1605551834
			}
		],
		"1605514254_1KpxpDPkuqhKBbeXNb4v2pnEoPXTTSnYgh": [
			{
				"comment_id": 679,
				"body": "I knew we would be seeing events like this a few years ago and an eventual global economic collapse + the fall of the American Republic + the current governments going hard to maintain power. I had predicted this would happen between 2024 and 2030 when things really go to shit. Hopefully my prediction is accurate so I am prepared.",
				"added": 1605552273
			},
			{
				"comment_id": 680,
				"body": "Just my theory",
				"added": 1605552294
			},
			{
				"comment_id": 684,
				"body": "> [jesuschrist](#comment_14_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW): All I know is that three years prior to the event I gave brutal warnings and a stark choice to my significant others. It appeared to them that I was burning my own bridge but of course paradoxically they had burnt theirs. Most people today are implicit because they were involved in the destruction of the father despite being warned. [...]\n\nWow! YOU HATH RETURNED SON OF THY LORD.",
				"added": 1605841763
			},
			{
				"comment_id": 685,
				"body": "(Plz start a doomsday cult)",
				"added": 1605841812
			}
		],
		"1605762939_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 681,
				"body": "> [sarkozizi](#comment_1_16ANkHsczDJfSc8YeKYG3nGi8uGNzCmmU9): There is also Peertube, a full-decentralized video platform. You can download videos by torrent or direct download ;)\n\n*Federated",
				"added": 1605800910
			}
		],
		"1605755443_1P4NDknh2sxC5bnnnJWj2EFRHVLKMyDJwW": [
			{
				"comment_id": 686,
				"body": "> [styromaniac](#comment_2709_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): There are websites for making/receiving calls and texts, but IDK about privacy. You'll need email to sign up.\n\nMost websites block these numbers. You can bypass mobile verification on yandex and sign up over tor.",
				"added": 1605842012
			}
		],
		"1605890462_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 687,
				"body": "I do think Computing Forever follows some shill narratives but has good intentions. This one seems pretty legit and was something I predicted might happen. It seems like shit is happening a few years earlier than I had predicted and has been throwing my prepping off. I think we need to create a mesh network and sneakernet smuggling system to carry messages across borders and to deliver the true information. Start by making backup plans with each other if this happens soon.",
				"added": 1605999363
			}
		],
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 688,
				"body": "> [claude](#comment_45_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): Telegram isn't going to work if the internet is down...\n\nSome people don't understand networking and the internet.\nReal alternatives:\nGoogle Maps, Bing Maps ... : OSMAnd+\nInstant Messaging : Briar, Jami (I think it work in lan? Haven't tested. Someone confirm)\nSocial Media: Skuttlebutt, Zeronet ...",
				"added": 1606157278
			},
			{
				"comment_id": 689,
				"body": "It is best to have to data you want downloaded.",
				"added": 1606157314
			},
			{
				"comment_id": 690,
				"body": "Check archive.org , b-ok , youtube , LBRY plus others and start downloading information that will be educational and useful to you.",
				"added": 1606157463
			},
			{
				"comment_id": 691,
				"body": "> [radiator](#comment_2_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE): I have briar and no one to use it with. :) can't even get my siblings interested. and I'm the guy with a cabin in the woods - they ought to be asking me for this stuff. oh well.\n\nMaybe we should add each other lol",
				"added": 1606241535
			},
			{
				"comment_id": 714,
				"body": "Die great rezet ist gut for du",
				"added": 1607407752
			},
			{
				"comment_id": 715,
				"body": "> [dv1](#comment_43_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): Sicher, hol dir zuerst den Impfstoff, du Idiot\n\nJa",
				"added": 1607548832
			}
		],
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 692,
				"body": "> [styromaniac](#comment_2719_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Yeah, there can be a problem with search result relevance. For me, personally, it's too late to hide my fetish. I'm not seeking political office, anyway. [...]\n\nSo you think that if we could port these services that people like here then they will use it? (I think it is laziness and not wanting to self host. Freedombox and nextcloud offer things like this but people still don't use them.)",
				"added": 1606283287
			},
			{
				"comment_id": 693,
				"body": "Some sort of account page that lists all their shit they can use.",
				"added": 1606283323
			},
			{
				"comment_id": 694,
				"body": "Maybe. But how ZeroNet operates, their data won't be stored on the \"cloud\" when they turn their devices off. Maybe making an easy way they can attach their zeronet logins to a keychain without them having to think about it?",
				"added": 1606283429
			},
			{
				"comment_id": 695,
				"body": "Make money off their laziness and make the zeronet keychain with a flashdrive. But google is free so they wouldn't do that.",
				"added": 1606283536
			},
			{
				"comment_id": 696,
				"body": "So, what are our options. I say let them learn the hard way.",
				"added": 1606283560
			},
			{
				"comment_id": 697,
				"body": "Or any suggestions or modifications to mine?",
				"added": 1606283614
			}
		],
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 698,
				"body": "The frog will just continue to slowly heat in the pot without noticing.",
				"added": 1606283710
			}
		],
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 699,
				"body": "So, you should be monitored then",
				"added": 1606283741
			}
		],
		"1606242897_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue": [],
		"1606318541_1Avj8hNk6G7MvXw3MEH7qdBZ4XnjMDUDRP": [
			{
				"comment_id": 702,
				"body": "I don't understand",
				"added": 1606322511
			}
		],
		"1606532098_1G6LndVZrdXsunwT6CGRScNkK3Gi2nU6RF": [
			{
				"comment_id": 703,
				"body": "> [bigbadbob](#comment_1204_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): It kinda looks like a flying dick...  and balls.   oh dear.\n\nI remembered there was one of these earlier that was and it appears someone modified that one to look like dog",
				"added": 1606533056
			}
		],
		"1607078514_1EQvG7tmmrK7rvVPaXm9zFeHckdhPEXvWR": [
			{
				"comment_id": 704,
				"body": "> [styromaniac](#comment_2749_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You're probably more likely to find related chat channels on Element (formerly known as Riot.im). I haven't heard of a Python programmers forum here.\n\nYeah, matrix would be better for that. Not enough people on here.",
				"added": 1607106939
			}
		],
		"1606783844_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 705,
				"body": "> [xcape2net](#comment_811_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I think they are just trying to encourage people to have personal websites and find a way to use them instead of centralized platforms.  I think they are limiting their thinking to the open Internet.\n\nIf ZerNet became big enough, we could build more template websites for people to use.",
				"added": 1607107122
			}
		],
		"1607215052_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 706,
				"body": "Just run from source. You can do that with python.",
				"added": 1607219629
			}
		],
		"1607222817_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 707,
				"body": "I think this first vaccine may just be a test for them.It is going to be the vaccine from the next artifical or over exaggerated plandemic.",
				"added": 1607295614
			},
			{
				"comment_id": 708,
				"body": "\"Telepathic mind reading abilities\" \nNow you are just stupid or a psyops glowing strawman.",
				"added": 1607295740
			},
			{
				"comment_id": 710,
				"body": "Maybe the vaccine conspiracies were created by the globalists to start a war between ourselves and the vaccine is just water.",
				"added": 1607310232
			},
			{
				"comment_id": 711,
				"body": "Keep your jizz in the freezer before you take the vaccine if you are worried about being sterilized.",
				"added": 1607310324
			},
			{
				"comment_id": 712,
				"body": "Maybe the vaccine give you ED.",
				"added": 1607310361
			},
			{
				"comment_id": 713,
				"body": "> [sj29msn5kz0ldmn](#comment_32_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4): tech like this is closer then you might think, we will quite soon be able to do google searches with our minds with nanochips on our brain (see: https://duckduckgo.com/?q=elon+musk+chip+cure&t=h_&ia=web)\n\nI ain't getting any nanochips installed in my brain. How could that even be economically worth it for them. They can try but it is going to fail.",
				"added": 1607399576
			}
		],
		"1607300234_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": [
			{
				"comment_id": 709,
				"body": "Honeypot is my thoughts",
				"added": 1607309673
			}
		],
		"1607561475_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt": [
			{
				"comment_id": 716,
				"body": "I'll check it out later.",
				"added": 1607572297
			}
		],
		"1607558436_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 717,
				"body": "Good point.",
				"added": 1607572518
			},
			{
				"comment_id": 718,
				"body": "I remembered an earlier conversation I had where we were talking about having a convenient dashboard where people could access many different services like google has would maybe cause more people to adopt.",
				"added": 1607572607
			},
			{
				"comment_id": 719,
				"body": "(Off topic but did you stop posting because you hit your limit or were you just taking a break?)",
				"added": 1607572742
			},
			{
				"comment_id": 720,
				"body": "I have a few cool ideas for zites I would like to work on in the future. If you wanted I could maybe help you with some of the basic front end shit in the web developing. (Not much but possibly a little)",
				"added": 1607572911
			}
		],
		"1607663597_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 721,
				"body": "Or just have the seeds imported anyway? You don't need permission. Just make sure you aren't ordering from a glownig.",
				"added": 1607699680
			}
		],
		"1607699045_1Np1M1k3BSmiSHmqWrVAcxhvjLiVLmb2CK": [
			{
				"comment_id": 722,
				"body": "Weren't they putting a modified version of hiv in the vaccine? Certainly not sketchy.",
				"added": 1607699821
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 723,
				"body": "> [userofzeronet](#comment_4_1MBqetKY7oWBPVBEJwuppDWkCteFmPSxZJ): It would be nice to setup a board and start discussing methods because killing yourself is actually pretty hard to do.\n\nSomeone mirrored a website here that has a bunch of methods. I don't remember the link and the people who were intrigued by it aren't around anymore for obvious reasons.",
				"added": 1607907400
			},
			{
				"comment_id": 724,
				"body": "> [userofzeronet](#comment_4_1MBqetKY7oWBPVBEJwuppDWkCteFmPSxZJ): It would be nice to setup a board and start discussing methods because killing yourself is actually pretty hard to do.\n\nIt isn't. There are many ways you can kill yourself all around you everyday. It is just that you actually don't want to and you are desperate for help or attention.",
				"added": 1607907553
			}
		],
		"1607948770_19rSc8YfLc5CKq528uKnDuerT2PZoKiegm": [
			{
				"comment_id": 725,
				"body": "Wait, they are already doing cyber covid. Fuck, they are acting way faster than I thought. All this shit they are doing, I was thinking would be spread out over years.",
				"added": 1607964188
			},
			{
				"comment_id": 726,
				"body": "Now they shut off the internet for two weeks. I should have sped up my preparations.",
				"added": 1607964249
			}
		],
		"1608002109_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 727,
				"body": "Some of us may feel like we are in a very bad position right now. But this is what they want us to think. We must share knowledge with each other and possibly set up some networks and connections outside of their control. Having an archive of you own is also going to be very important. Have pdfs, git repositories, linux and *bsd isos, proper tools, and plans.",
				"added": 1608010054
			},
			{
				"comment_id": 728,
				"body": "Many plans. Things change fast and you must be prepared for these rapid changes.",
				"added": 1608010155
			}
		],
		"1608035201_185GTTshXdJKtwsb8pWjobkFwufjR2Z6jb": [
			{
				"comment_id": 729,
				"body": "Or he was involved which is far more likely.",
				"added": 1608090931
			}
		],
		"1608053641_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 731,
				"body": "What even is the point of these posts?",
				"added": 1608101359
			}
		],
		"1608149924_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 732,
				"body": "People will have to be more entrepenuerial",
				"added": 1608182099
			}
		],
		"1608206269_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 733,
				"body": "See if the Trumpers will go to civil war first then try and kill him at a point when they are weak. That is how I would go about it if I wanted him dead that badly.",
				"added": 1608220203
			}
		],
		"1608206719_14Y5YpotfVjQyQfdrW3PFuYDQTfpPAZ4GK": [
			{
				"comment_id": 734,
				"body": "Where do I watch?",
				"added": 1608313097
			}
		],
		"1608100813_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": [
			{
				"comment_id": 735,
				"body": "> [sword000000](#comment_58_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Open ZeroHello > Open Left Side Menu (Little white arrow/button near the page bottom) > Open the menu (3 dots at top right) > Configuration > Tor\n\nIt will just have errors when connecting to peers.",
				"added": 1608313301
			}
		],
		"1608510782_1C6wRvZoviXwxkfoeQemf5LzPfjx9Ri1dm": [
			{
				"comment_id": 736,
				"body": "Go directly to those that want advertisements for their good or service displayed and find one that your viewers would be interested in.",
				"added": 1608653468
			}
		],
		"1608640318_19uAt7evT6ejhbTih1UTvPokD9KrBQ4RnY": [
			{
				"comment_id": 737,
				"body": "It's because of covid-20. Duh",
				"added": 1608661704
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 738,
				"body": "@radiator\nThe people who the media were telling to take care of the Earth who were taking it really seriously are now the people who throw, masks, latex gloves, and disinfectant wipes everywhere and litter all the time.",
				"added": 1608869116
			}
		],
		"1608645993_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 739,
				"body": "http://127.0.0.1:43110/1J1c7eML6uMwDU4uiKbKRxoqxGP6WMFMvb/",
				"added": 1608948045
			},
			{
				"comment_id": 740,
				"body": "Not many users but has been around for a long time.",
				"added": 1608948456
			},
			{
				"comment_id": 741,
				"body": "Fuck, you may have to catch me online to download it.",
				"added": 1608948910
			},
			{
				"comment_id": 744,
				"body": "> [shadowperson](#comment_17_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq): I got it and I'm seeding. Just gotta recruit more people and let them know that if it doesn't show up try adjusting the zoom.\n\nOk, I will continue to seed for a while and hopefully it can get a bigger crowd.",
				"added": 1608957823
			}
		],
		"1608776045_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": [
			{
				"comment_id": 742,
				"body": "I'll seed it for a while by leaving zeronet running then everyone can get it.",
				"added": 1608955142
			}
		],
		"1608952482_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 743,
				"body": "> [deuxzaron](#comment_7_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): The Great Reset is to push capitalism to serving the consumer/customer and not just the elites and investors. Stakeholder Capitalism. Look it up.\n\nNo, making it so the average person owns nothing and is under heavy surveillance doesn't make it that way.",
				"added": 1608956734
			}
		],
		"1609275892_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 745,
				"body": "> [binary1173](#comment_45_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G): $2000 of worthless fiat...hmmm.... I would be more inclined to buy/sell those wheel barrows when the hyperinflation comes.\n\nThey are going to create a new digital currency so wheelbarrows won't be a profitable business.",
				"added": 1609299005
			},
			{
				"comment_id": 746,
				"body": "FedCoin is what it will be refered to as",
				"added": 1609299030
			}
		],
		"1609283387_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 747,
				"body": "And you give away your address.",
				"added": 1609299617
			}
		],
		"1609300485_15K9PA1npTHXojVn5cGqkdM1q1BfpAvDF5": [
			{
				"comment_id": 748,
				"body": "Nice play CIA",
				"added": 1609307399
			},
			{
				"comment_id": 755,
				"body": "> [kingtee](#comment_1_15K9PA1npTHXojVn5cGqkdM1q1BfpAvDF5): BC and usps w/tracking and transmitted with pgp\n\nShit, you encrypt a physical package with pgp? That is a marvel that none us will ever understand how your genius pulled it off!",
				"added": 1609555193
			}
		],
		"1609237597_12fYGWhHCWeiKavtMcRyHppHvH9RJF8ViC": [
			{
				"comment_id": 749,
				"body": "We aren't there yet and probably won't be for a long time but that would be a good impact.",
				"added": 1609307500
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 750,
				"body": "> [calmdownholden](#comment_13_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): What kind of person can't afford a $60 game?I can understand pirating old films and games because who cares and it might be the easiest way to obtain them......but for new games? Pony up the money. Be an adult.\n\nFuck that. $60 for a virtual game that entertains me a little for about three days then I get bored and wait for the next rushed and content lacking $60 game. I just choose to spend my time playing other games that are cheaper or free instead of clicking a glowniggers link so I can play the $60 game for free.",
				"added": 1609345502
			},
			{
				"comment_id": 751,
				"body": "> [tomer](#comment_41_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu): i kida dont remember it....\n\nThat is always the glowy response. I remember one time it was \"this is totally open source but the guy who had the source code left so I don't have it.\"",
				"added": 1609345720
			},
			{
				"comment_id": 752,
				"body": "Even the glownigger thinks your response is stupid @calmdownholden",
				"added": 1609387294
			},
			{
				"comment_id": 753,
				"body": "When it has a massive sale, they fix the bugs, and add a multiplayer mode then I might consider buying it.",
				"added": 1609387451
			}
		],
		"1607730992_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": [
			{
				"comment_id": 754,
				"body": "> [asmdmasd](#comment_6_1Jbcve9XwKT2Ah9TjZ59WFTCHujJENJQPv): There is going to be a revolution, another year of this hoax and watch the entire world go up into flames.\n\nI don't see that happening. Hopefully some groups of people can delay their agendas for enough time for them to go broke and collapse.",
				"added": 1609482410
			}
		],
		"1609617529_1MBvMN1a6WpuVMrbh2RTDeeJk7Mf1LYvUL": [
			{
				"comment_id": 756,
				"body": "I like that too. You won't be finding anything rare here.",
				"added": 1609645203
			}
		],
		"1609856915_1EgNFQT4TxGEw7UpWfaRhEButB3vYqqXQk": [
			{
				"comment_id": 757,
				"body": "There is some japanese porn on the normal video zites",
				"added": 1609866427
			}
		],
		"1610228061_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 758,
				"body": "Governments can't compensate people. All they can do is steal money then give it back or print off more and decrease the value of what people have already.",
				"added": 1610241664
			}
		],
		"1610293445_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 759,
				"body": "> [bigbadbob](#comment_1237_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I think Paler is going down offline tonight.  Amazon servers giving them the boot.\n\nLol",
				"added": 1610320872
			}
		],
		"1610255135_1LWUniEdUPZrEqFD3Yj9tpqkQNnfsAQAMM": [
			{
				"comment_id": 760,
				"body": "> [bimmyql](#comment_24_1yhTF4WKRZsCBdVeh8fwPj14zAiEdtAXW): is there anyway around this? that seems like a fatal problem for long term growth.\n\nCreating your own zites.",
				"added": 1610321063
			}
		],
		"1610273837_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 761,
				"body": "How could china successfully land a man on Mars this year when they haven't even started a mission? Getting to Mars would take a long time.",
				"added": 1610335048
			}
		],
		"1610357675_1m1PsD5gwJ5xa9Rpt8JHr11wu9pqFjWc4": [
			{
				"comment_id": 762,
				"body": "> [yorgos](#comment_1_135rBgRJsz349UMDrZ8xbfoZSB44ic7Wt2): that's why people like trump, because they don't trust the government.\n\nIf I am understanding this correctly, you guys blindly follow a person in government because you don't trust the government?",
				"added": 1610398755
			}
		],
		"1610395383_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 763,
				"body": "No fish didn't intend for us to be using only a few zites. I think he was hoping for us to make clones of zites for separate communities. That one guy made the technology forum where he posts articles he finds.",
				"added": 1610399089
			},
			{
				"comment_id": 764,
				"body": "@bimmyql you can block content from certain ids. You do the moderation yourself.",
				"added": 1610427473
			}
		],
		"1610168765_1QHTwjj9nMpqDE1yb9t9ri6HSCt9MWMSGp": [
			{
				"comment_id": 765,
				"body": "> [anonymouslogin](#comment_221_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X): Shall we spread zeronet to the Parler userbase ?\n\nNo! Let the dumbass boomer conservatives stay on their own honeypot platforms.",
				"added": 1610478592
			}
		],
		"1610394057_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 766,
				"body": "> [transcoder](#comment_11_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH): parler was so stupid that they didn't even scrub metadata from posts people made. so anyone who used it is directly identifiable\n\nSomething tells me that this was by intention and not them being stupid.",
				"added": 1610478991
			}
		],
		"1610594001_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 767,
				"body": "Who do you think is the one who actually earns those \"neetbux?\" It's the \"wagies\" who you make fun of. You better watch your mouth because shit will get real hard for you very soon if you keep that attitude.\n\nI agree that Trump supporters are suckers but having an entitled wellfare mentallity of thinking others should work for you might seem good in the short term but will really fuck you over later.",
				"added": 1610643712
			}
		],
		"1610219039_1KBdrQX71nWaR3P9DmNhJ6HSsBxS12d3AM": [],
		"1610720324_1GuYJ6Jye7Kh4CFnTNPgjsVvf3JEwU1BAz": [
			{
				"comment_id": 769,
				"body": "I feel like all these anti-vax movements right now are controlled opposition created by the world governments to keep people in lockdown so their economies don't crash from all the inflation that has been happening.",
				"added": 1610727891
			},
			{
				"comment_id": 770,
				"body": "Remember those videos that the ccp created that were supposedly leaked showing how the streets of wuhan were lined with bodies? That is what these anti-vax movements are.",
				"added": 1610727994
			}
		],
		"1610984695_1789pQPut6Qwi5VL6aCtpWCMbqaMHgdoZp": [
			{
				"comment_id": 771,
				"body": "They are going this hard to stage that somehow a bunch of wannabe revolutionary war larpers are going to get past 25,000 national guard troops + secret service and assassinate Joe Biden?",
				"added": 1610986975
			}
		],
		"1610676192_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP": [
			{
				"comment_id": 772,
				"body": "> [freemankind](#comment_72_17AwNLQUY1CRAb1U6jVJhvVUnyEdNvkiue): your using bitcoin by using zeronet fyi\n\nJust the cryptography",
				"added": 1611080158
			}
		],
		"1611103567_1LptnpdJA9d6RKrpphEq8Cj8dgKLWmwg7v": [
			{
				"comment_id": 773,
				"body": "> [styromaniac](#comment_2906_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Pretty neat. Maybe Brave will be the last browser to support free speech.\n\nBrave is boomer conservative controlled opposition shit. Modding and tweaking a firefox based browser is the way to go",
				"added": 1611122321
			},
			{
				"comment_id": 776,
				"body": "> [styromaniac](#comment_2907_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Or someone could make some needed packages for LibreWolf. [...]\n\nI know a guy who was doing this a while back for people in some chatroom I was in but never downloaded it. It shouldn't be difficult to learn.",
				"added": 1611123383
			}
		],
		"1611098873_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [],
		"1610754180_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 777,
				"body": "I would personally look at xmpp, matrix, briar, jami, and tox (not for serious stuff though). All open source, most are very well developed, and all but tox use well tested e2e encryption. You also aren't locked into a particular client with all but jami and briar.",
				"added": 1611123763
			}
		],
		"1611126079_157PxxUyhKzAg1PouRT5DcnNABoJFX7Qce": [],
		"1611289983_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": [],
		"1611308558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 781,
				"body": "> [sword000000](#comment_90_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): While you're being a good little girl playing candy crush and growing flowers in the absence of law, the mafia will break down your door, kidnap you, and make you into a slave prostitute. Law enforcement is very similar to the mafia. Except that law enforcement is considered the least reprehensible of mafia's.. usually\n\nThe mafia would become law enforcement then. This is why self defense is important.",
				"added": 1611333267
			}
		],
		"1611793272_19izFP2dRYRZNMHhACisV1HC1mNAPi8Koz": [],
		"1611863378_1B7RVZS2wUTChismz6p5FxN2TmT4qnPZNm": [],
		"1612126358_16HW9UmVm6tcYT4F7yQk2MK9AMKodiWjXy": [
			{
				"comment_id": 788,
				"body": "Dogecoin is shooting up now? A coin named after a dead meme. I thought it would be btc and ethereum then monero, litcoin, and dash as more people learned about cryptocurrencies.",
				"added": 1612135340
			}
		],
		"1612074323_18MUc7bD3LDUQobuKHzmVeDeS4qE7wtoDe": [
			{
				"comment_id": 789,
				"body": "Trying to become Gordan Freeman as a Vault Dweller?",
				"added": 1612135403
			}
		],
		"1612069811_1MSraqjv7AM5qP8YieJsDqtAgzpEoixanY": [],
		"1611968483_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 791,
				"body": "Or you could just get an easy job (white, black, or grey market; I don't give a shit) and not rely on others for money? There are plenty of jobs in the world that require almost no thinking to do and you don't even have to work half the time and you will end up making at least double what a ubi would pay you.",
				"added": 1612136298
			}
		],
		"1611356175_1MnhVCwvyZSAo62TPm5vV4Q9f34iJZt2U8": [],
		"1612161964_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": [
			{
				"comment_id": 793,
				"body": "I guess for cheap and easy you could scam losers, look for gig work, offer some sort of service, or just search this question on the clearnet and look for what you would be interested in while using your brain and not being the loser who gets scammed.",
				"added": 1612204578
			}
		],
		"1612387935_1FwNEGpdNnQE4H83JHLKWLk56H7xwLFSTN": [
			{
				"comment_id": 797,
				"body": "No",
				"added": 1612389445
			}
		],
		"1613185168_19fX1TtocNa2x75nUeaSc9QR3uXzvWKqjw": [
			{
				"comment_id": 798,
				"body": "Dieting on raw meat to detox from the vaccine. Lol",
				"added": 1613401540
			}
		],
		"1613342125_1BudWvimweYZjs7PghDjpd8nbuHH4dR84u": [
			{
				"comment_id": 799,
				"body": "Sounds fake to me.",
				"added": 1613401931
			}
		],
		"1613421453_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": [
			{
				"comment_id": 800,
				"body": "Many of us have wanted to do this but haven't had the time or skills",
				"added": 1613489562
			},
			{
				"comment_id": 801,
				"body": "I had this exact idea.",
				"added": 1613489606
			}
		],
		"1613921922_18V3yAk827Q61WfYormvHGbKgDx3cs3kyu": [
			{
				"comment_id": 802,
				"body": "\"End of the year\" lol, didn't they say we would go back to normal this summer as the most recent goalpost push?",
				"added": 1613959244
			}
		],
		"1615131460_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT": [
			{
				"comment_id": 803,
				"body": "> [testaroo](#comment_1_16CnipWrmQT4vDor6t2G7QRwartbUcDmMg): send them email and ask them for that.. tell them you want to give them some beer  [...]\n\nLike they would do that? These people see everyone else as peasants and would be disgusted if they had to hang out with the people who watch their shit. \n\nKilling them is also high risk and a waste of time. Find a better way to spend your time. I know you guys won't do it and you are just big talkers on the internet anyway but still.",
				"added": 1615185200
			},
			{
				"comment_id": 805,
				"body": "> [frontline]\n\nSo you guys are going to dress up like some kid at the renusance fair and yell cringy slogans in front of their house and you use kill list as an expression? Whatever you want to do with your time I guess instead of finding a job or a decent hobby. \n\nEdit: Yes, I am aware that the governments around the world have caused more people to be unemployed and become political bums but I never said your job has to be legal.",
				"added": 1615271308
			}
		],
		"1614861650_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": [
			{
				"comment_id": 804,
				"body": "> [hyperangrymuppet](#comment_4_1GJGEK5WyPcNoDx6LRy22CRqwB92RzPauT): ercot? where is the most wanted list? ahh no... texans are pussies... they talk big, they drive big, they carry big, but they ain't strong enough for a cold snap... [...]\n\nSelf projection at all? We read your posts.",
				"added": 1615185955
			}
		],
		"1615243619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 806,
				"body": "Well, here comes another article on zeronet. I have viewed the Q forums and most of them probably don't even know who Terry Davis is.",
				"added": 1615272549
			},
			{
				"comment_id": 808,
				"body": "> [styromaniac](#comment_3022_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I swear they're talking about \"me\" when they mention people warning to not attend the inauguration. [...]\n\nI didn't read the whole thing. I don't want to fill my brain with garbage. So they said that it is a bad thing that people were saying to not go to these supposed dates and \"rise up\"?  All they are doing is proving that the glownigs planned this shit.",
				"added": 1615312838
			}
		],
		"1615234594_1HJKoK5icacs175hMpyE5AQDozvmQDF1No": [],
		"1615970209_1JbdNgiHeruxZbhuQgd8QtkhbC2to5r61j": [
			{
				"comment_id": 809,
				"body": "Could you quit making multiple accounts and spamming?",
				"added": 1616026017
			}
		],
		"1616209212_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": [
			{
				"comment_id": 810,
				"body": "> [bats](#comment_96_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp): People with unorthodox views are not really a problem though. Spammers are.\n\nLike that guy who keeps making multiple ids and tries to be edgy saying he will kill peoples children.",
				"added": 1616469183
			}
		],
		"1616864409_1ASw9nbUv8QsYxWggwsMsNZ37STaEo26Di": [
			{
				"comment_id": 811,
				"body": "> [calmdownholden](#comment_36_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): No one clicks on HTTPS links on here. [...]\n\nIt's a social media site. Mostly Trumpers, Boomer Conservatives, Hippies who are high all day on psycedelics, crypto scammers, and flat earthers who can be any of the above. \n\nOne guy on there told me that humans were genetically engineered by the anunakis and Egyptian gods who are actually shape shifting alien reptiles who genetically engineered humans to make them slaves. The pyramids and stonehenge were built by them as beacons for their ships. (I am not trying to strawman him. This is what he wrote. His name was humansarefree or something like that if you want to see for yourself.)",
				"added": 1616970017
			},
			{
				"comment_id": 813,
				"body": "https://humansarefree.com/2016/12/the-anunnaki-the-evidence-supports-sitchins-thesis.html",
				"added": 1617289453
			}
		]
	},
	"comment_vote": {
		"4_18Eg3doTf26uabVuTnryFMUk9cKEz9idu7": 1,
		"7_1NA1GS8pXSCVWDD4ESfGXcfkcBnbV6zJMh": 1,
		"907_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"80_1aaGBN84Cc8VE7iocUxPXiRVhx9qSfXw6": 1,
		"5_1GYTFEyxLQK2TdsHvXUknoqfV3f8xdxR6P": 1,
		"23_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"21_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"305_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"27_1E5GcuKhRw6sujdX3XKosJ54HFJ4pMtr14": 1,
		"23_1FUHVG4DhoXuD8Zrz4D7YuCF7w8JtjYve6": 1,
		"3_1Cx3BTrQckf6v9Hm9KSAJxztGxqoTwAT4m": 1,
		"22_1CBZY3cuYKeHZXEeHVxRFLmsCr3UmELnTX": 1,
		"1_15KqJWMF66JypCYG6hy4MnMJTVcpS29igp": 1,
		"2_15KqJWMF66JypCYG6hy4MnMJTVcpS29igp": 1,
		"9_1FB7wEXbNVmiRnVw9JSCnibwrhYVK4uFaP": 1,
		"24_15ZG53yDqMJyxRy3jfkC4NGeKapAC5CDrL": 1,
		"135_1LdgxNSynzpd5Vyi3Ej12adEuWbo1nWFu9": 1,
		"6_155YW8Qn715edvfqPMrsPscUHqut4JCphb": 1,
		"14_185ieYf6sEZrW5juQmXsp5nfajWYTdwPaD": 1,
		"12_1GQMHdkj67rAzy1uMbq5Smvhg9o4YLLHaV": 1,
		"102_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"400_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"28_1Kq1ox6SsERUFsQjyGCLKf7EuHJuDs3wfu": 1,
		"78_1PA19ZVGt9k6GEX2mYAF6w5zJCPYKWaJEp": 1,
		"1_1KAAapzmQubR3wAZ1brewkZZz3ycBhuTsA": 1,
		"32_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"122_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"1_16dksgRmeAh53BmmfHAN5nxradN6KMAkTR": 1,
		"9_1MgPQAFQwHMiHTouXfUiS98cHrnyLScEQd": 1,
		"51_1GP1GwsgiyybaHxGxfTEbsMCqRS9ogd1nJ": 1,
		"112_194xi8BJsLXhwje1kBJETKo6tjvhHmK73S": 1,
		"554_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"21_1Km1xAn8UkqCT59CfBaSq7rPkPhT3CCvDZ": 1,
		"4_1Qask4M4w4quLZtYRX45FiPvaLBV1LEfm": 1,
		"1_1MTiDbYKVBHvcZRH4AikT2PbpUGBTUsCy": 1,
		"4_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"12_1A3HXsg9nYdffV3gBNDN5NDpdZE1xBq8Ra": 1,
		"251_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"17_1DXjRGbVDrJjUQd4ZzmFF1vvQUvqsgJFkH": 1,
		"211_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"10_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"29_1G9tYawBzteEiLGTqghKrJ96tjm4eTuv6m": 1,
		"4_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"8_1N4DSSHorDvEkDGkQfUhnnryYiTdtUW8hU": 1,
		"1086_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": 1,
		"9_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": 1,
		"47_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": 1,
		"393_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"37_1HQa2NE5CRuVJsvHKLNMNrund5qwAxud9Z": 1,
		"16_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"214_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"17_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"120_13wJrWgzjwKU1zgXJMDCGhkSjsaUvYjZM2": 1,
		"14_1MGP7Q7y11YBjwi2dUkB2Q93KusgxDCqsr": 1,
		"22_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"1083_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_17xMbJPXvnaePZLbYtkWeAoznqRsoTtG4U": 1,
		"97_16BaY5JLzzA8TPe4jzXtp3CfZi3Qks2SU5": 1,
		"13_1JcYRvuupytqgM6LhpeYkhZYJensWk2FVA": 1,
		"1_1Pm1PyezHu8BoDLNT1Qni6jXk25NwujLSR": 1,
		"1239_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"11_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"24_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"1250_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"35_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"72_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"71_17ZzQakCby5cKd1FduZm4DX7SYFZMVWYsD": 1,
		"128_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1173_1CKTRBy9N4RvE3FgeZJpQqFYtLHc37yo11": 1,
		"1309_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1329_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1Aer18xiLtbmyE5e3LcZWc6mwmP8bN9URy": 1,
		"2_1PJ2wj4wqyyssFUciArR1sHXp2nfPfscFL": 1,
		"1323_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1345_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1351_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1348_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1347_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"41_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"40_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"1364_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1374_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"6_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"8_168Ze2ScKyzmQMpGqpwA3VkznNDke9z9s3": 1,
		"188_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"45_1PQ7XjQGyyGgtPjNCRQ82qtupmLPVz89iz": 1,
		"328_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"273_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"4_1C9jgiZHjNk8F6xLbVUaF5PjfYmSvU5W5Z": 1,
		"58_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"1416_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"15_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"37_1DZBbYJmuFQvVTe2X2Enrveziw3vN1JQXz": 1,
		"121_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": 1,
		"487_1EFZ3dYDWVpD4kF5H9PF83HjPAehEEKKJj": 1,
		"853_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"325_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"40_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": 1,
		"10_1btdnzDG8dG58aW9vnKWmCHV59dNTJfn7": 1,
		"299_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"389_1CuFETj5LtyEduzaoAcdv9sMAQtYRqjqDY": 1,
		"184_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"5_152JLSuJAhrKabbvowpHjq5W6TzpxmYW3w": 1,
		"187_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1,
		"304_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1652_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"23_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": 1,
		"390_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"376_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"4_12v2Wp9HpvpGBnqGQbR4Ka3bbbf9jc8B53": 1,
		"379_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"139_1CFQMjPvz8m5BHtMnGyE7tRktdQ69WwUSX": 1,
		"23_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"41_1BdN2jVk4GFXPnGjj4z9GUrFiWDupZpRWG": 1,
		"44_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": 1,
		"56_16m8gAt3tZc2tssxPz2zzuz873Ez8badoP": 1,
		"1748_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"29_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"73_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1752_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"25_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": 1,
		"475_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"76_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"430_1FzZsDQdh8wk71bDLxURPzmAt2FXehoNAB": 1,
		"18_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"504_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"1_1KmgiKWNNV8ACroT3aQzf3JA2E3JtXaQRX": 1,
		"1132_1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh": 1,
		"103_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": 1,
		"47_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1854_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1853_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"194_1DfrA2M9Qra6stqT6tzwNMYNweswY54KAC": 1,
		"77_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": 1,
		"17_1PniNzyi8fygvwyBaLpA9oBDVWZ5fXuJUw": 1,
		"4_15QJDMQutfov1oMp9fF1aCPTGH3ey8NHi4": 1,
		"11_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"81_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"15_15cApprVFcr1skAkWssq5aAXKa7pDwJJve": 1,
		"1_16X9h7ik2RKWnJ3ZMacutgSe7ZevyVraLN": 1,
		"2017_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1071_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"2019_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2028_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"516_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"84_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"12_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": 1,
		"11_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": 1,
		"10_15sV7CLD3U692bxLtoJK5HPPeDZxPJeLD3": 1,
		"88_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"37_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"1075_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"16_182MiECzFBoPjv3gU6tq2k9BXSboKzDVKF": 1,
		"535_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"21_1F87dd49JyvrShxjTz6jszGnxm7bn8if6m": 1,
		"99_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"9_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"144_17XPGJDqy3F7zfV3sa4aMJF2Mhpati6N12": 1,
		"57_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"1_1LhtGmRwMAF6uCWerkiHBbmSpThFZNa4Cg": 1,
		"29_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"25_1BL1pFELvZ58apCLcxogy2W66aC4vKLfY3": 1,
		"4_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"493_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"497_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"499_1JcHMiQxXHX9q3ZK2LF9rZjvg3MUtTpcK": 1,
		"2169_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1L2iye3cir15rbRfp2heMxUiwcAdXwBGdg": 1,
		"43_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"23_1KSMTkAKXzbiXa7d2HWy3rNVSUJDXExpXg": 1,
		"18_15wyZrQv2HaQQD7usbZ6iXTxY7DKAChnGP": 1,
		"2295_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"541_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"36_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"753_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"63_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"17_13gz7jEayVZjubcAGS16kR3Ze4RJSgVFVw": 1,
		"1085_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"4_15g72KYgiV72kHQbS8PgVGPqxh2qqZAgjR": 1,
		"143_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"2352_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"36_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"4_1GESkMhyvAiHWnALjYKhDuTe3mHNMpndeG": 1,
		"2372_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_1NQ7GwEXMq5xX8FVL4hYdpycp3pomCQdUX": 1,
		"2376_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"90_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"4_1BYktGU5CJE8npw2TMaizUC9sekZ6iV2um": 1,
		"41_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"42_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"2410_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"2412_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"47_146FHU77ti4zcQNWbtin8fWNRCLd8XYZkf": 1,
		"10_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"58_18LjTpx4UtPSFfAZi8kfoyWasJq9gZCCkV": 1,
		"42_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"20_1KCaZNP1gDSMcaCJ9o5yW8antSVefNuv7a": 1,
		"11_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": 1,
		"16_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"2521_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"34_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF": 1,
		"121_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"34_1JKZJh2XYF8C6q5p7T7FmiL3JDux2CxWyJ": 1,
		"164_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"130_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH": 1,
		"50_13UJZwpkQASN9unpc9hLhmwyauXzzatQgQ": 1,
		"1_1BTR1SP5uKs6nURymSE4uX74vJ8CmAXyB9": 1,
		"1393_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"42_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": 1,
		"18_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": 1,
		"16_18RoaAqHB6LgsbrRvZuzWrcd33dZkjAfuG": 1,
		"1_14AjS7kmcE51EaTbN3Q7gWFFqPWLALBBP6": 1,
		"32_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"30_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"1_14VrpWixwVj8VKjPF1eFyvtLhCNBg19GY2": 1,
		"5_15q24B3R72uWT1UwtRMdFDmm3VXKcKVSiH": 1,
		"2759_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"43_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": 1,
		"6_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1,
		"47_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"43_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"3_1cLuFbBnM79y6F6tSHkUeiXuqZkENxogh": 1,
		"424_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"17_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"19_1N6Wav6t87EiciuAd4PwKtbPkQw9nRQpoq": 1,
		"45_17MrYppaLZw5RG3iKFSp4JhL3gMznVgB1G": 1,
		"55_16aoHyKbwpvBmgCtNqX1tW9N5bvXGmd1oX": 1,
		"3_1AjDVZkWjXocDcGAapochi8b2M2h7CnGBu": 1,
		"36_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"13_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"29_18YwqjZF3kZjfbWcsvyfzzL8okGn2DRW1a": 1,
		"525_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"19_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"4_1CDMo8F3AQjnZcsXLyf7p4xnNhGDQSUT5E": 1,
		"16_1CtNr38ULvYNaBZfApLSCpJZiMaxzKZeUW": 1,
		"28_13UWQ2EY7X5z4xbTKhzssojJWsLL1t5Sqk": 1,
		"9_19XzssAaDbJ1rbCNCYxDioen1gxGxqiNyh": 1,
		"74_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"34_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"5_12eVhxNAYFPJi5rUnbHwbmKPnqAniJs7SA": 1,
		"51_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"543_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"56_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy": 1,
		"1_1Eh9Nzq2eMP62VExTCTSyPD46aKWqVY8ZP": 1,
		"6_1HrqgzPJJ1JWkUHC7SUrQh2grDpf8Qt9Gg": 1,
		"22_1KUV6GoC4BTwnDeWEGbrYbgJ84G6AG3s7N": 1,
		"558_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"40_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"562_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"64_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"569_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"4_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"73_19M1Unu2z3j9WyiQ1vcgG6yGnPRmTkUkVe": 1,
		"14_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": 1,
		"27_18yzU6FADirNEPhLVyRHBdnfVQaATfTk3S": 1,
		"11_139jrk6GJ36wCNbLqLLv3C71HHajSy4a4C": 1,
		"1_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"5_1MCNYstff4yDsoNktn2MzGbtsCHqnRxHWX": 1,
		"98_17GmcqqqJdfEM4DkRsqvvprifPVwYx575h": 1,
		"36_1PZivKEBF8sdpTRbeb9Wug8HMv3Cfvqo5A": 1,
		"37_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": 1,
		"27_1EFJrmyV7WP3gw71XG1CRCWvVY2TMp4Pna": 1,
		"90_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"7_19CcB8NQHjyzj4TH9vKYm92xNPaUBg7hmv": 1
	}
}