{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1561215507,
			"title": "Who's uploading most of the porn on Millchan and elsewhere?",
			"body": "The Millchan seems to be filled with the same type of cosplay porn",
			"added": 1561215506
		}
	],
	"topic_vote": {
		"1561187203_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD": 1
	},
	"next_comment_id": 4,
	"comment": {
		"1561187203_1FhZQ2CEw9dhnL8VEbojSSmkUXvfkXYMhD": [
			{
				"comment_id": 1,
				"body": "People much too easily succumb to pressure, or possibly blackmail. I know of at least one person who had a Cocoscope though never visited that site myself. Bitchute is controlled as well I've seen channels and videos be deleted on there and they are registered in London, not the best area you can be in. Censorship is everywhere and will get worse and worse, the worst part is that you don't know what's being censored. :'(\n\n>Beware global dumbing-down\n\nThat has been with us for hundreds of years now, most intensely starting from the end of the second world war, I think the psychological war could be labeled as the third world war. It's the mass media, the schooling system, medical system, academia, et cetera, you're being lied to on every front possible. Lying by omission or censorship is I think most commonly used.",
				"added": 1561214760
			}
		],
		"1559881033_1JRYQyzmizvMoyErQBW2qZd5FNiWeKpFdZ": [
			{
				"comment_id": 2,
				"body": "Anybody like [PyPy](https://www.pypy.org/)? A faster interpreter for Python code though not every Python application works out of the box.",
				"added": 1561215019
			}
		],
		"1560995957_1PxcegJ1mKoMHeS73f9MvXeUWDq8BdnSv3": [
			{
				"comment_id": 3,
				"body": "Off-topic, Invidious is a pretty nice web client for YouTube, it doesn't require Javascript and you can easily download videos.\n\nThere are a few more sites you can use to browse YouTube using Invidious in case you don't trust `invidio.us`:\n\nhttps://github.com/omarroth/invidious/wiki/Invidious-Instances",
				"added": 1561215298
			}
		]
	},
	"comment_vote": {}
}