{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1623187560,
			"title": "Did the owner of \"Dead inside blog\" kill himself?",
			"body": "I've been wondering for the last three years whether the owner of [Dead inside blog](http://127.0.0.1:43110/14m2AuzoWetHiJFR8SAee4zCN1SjLD6mEv/), noleafclover1994@zeroid.bit, actually killed himself on May 18, 2018 like he talked about in his last post, or if he simply decided to stop using his blog. Does anyone know or have any thoughts?",
			"added": 1623187559
		}
	],
	"topic_vote": {},
	"next_comment_id": 2,
	"comment": {
		"1545106555_1NPaMdmTDg441cn76DGdUjz5ZXeVTPfWfx": [
			{
				"comment_id": 1,
				"body": "Why not, on submit, use javascript to read all form inputs, format it in JSON or another standarized format and then encrypt it with a public key in the zite's javascript. Then it's submitted as a file uploaded by the user. This way, the zite owner would be the only one able to read the orders. The user would be forced to seed the order file, but it would be an optional file for everyone else. The site owner could then seed all optional files and use his/her/its private key to read through orders.\nFor messages between zite owner and consumers, the order could require the user to submit a private key (as an alternative to an email address). All encrypted messages to and from consumers could be saved in a folder on the zite. Each message's filename or identifier would need to include the consumer's zeroid, or another id. The web interface would search for any messages targeted at the id of the user using the zite, and ask for the private key. The private key would be used to decrypt all messages to that user, and display them nicely.\n\nFor big zites, one might want a system of one hub for each user. This would prevent all users from having to download all private messages.\n\nFor the payment, cryptocurrency would be the best method. Confirming payment might be a challenge, but all information necessary for the seller to confirm the transaction would be part of the order form.",
				"added": 1545143289
			}
		]
	},
	"comment_vote": {}
}