{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1598232523,
			"title": "Introduction: Why Anonymity Matters",
			"body": "\"Give a man a mask and he'll tell you the truth.\" --Oscar Wilde\n\nExcerpt from my book \"The Ultimate Guide to Anonymity\" (Copyright 2019.)\n\nSo, “why is anonymity so important,” some of you may be\nasking. Anonymity is of importance for many reasons, but let’s start\nwith the fact that it is a basic human right. The Supreme Court of\nthe United States of America has actually tied the right to be\nanonymous to the First Amendment right to free speech and\nassociation which reads, “Congress shall make no law respecting an\nestablishment of religion, or prohibiting the free exercise thereof; or\nabridging the freedom of speech, or of the press; or the right of the\npeople peaceably to assemble, and to petition the government for a\nredress of grievances.” You have the right to speak freely which\ncovers speaking anonymously, and freedom of the press means\nreporters are free to do so in anonymous fashion.\nIt is important to protect anonymity under the law as without\nsuch protection individuals who are working toward promoting\nsocial progress may face potential ramifications such as stalking,harassment, difficulty finding employment, and even threats against\ntheir life. Also, the right to privacy is guaranteed as a basic human\nright under international law. This is reflected in Article 12 of the\nUniversal Declaration of Human Rights which states, “No one shall\nbe subjected to arbitrary interference with his privacy, family, home\nor correspondence, nor to attacks upon his honour and reputation.\nEveryone has the right to the protection of the law against such\ninterference or attacks.” Without our right to be anonymous, social\nprogress would stagnate and civilization as a whole would greatly\nsuffer as a result.",
			"added": 1598232522
		},
		{
			"topic_id": 1598405387,
			"title": "Who was talking shit about us again...?",
			"body": "Are all these things related?…\n\nNot sure since apparently according to several of you here on ZeroTalk I am not intelligent…\n\nP.S. I noticed those of you who claimed I am not intelligent have very rapidly stopped talking shit once wwg1wga, qarmy, and the rest of the bois started exposing these things for me… \n\nAgain, thanks for paying attention everybody!!!\n\nSpread the news!! <3 <3 <3\n\n#MakeAmericaFreeAgain\n#SaveTheChildren\n#OTB4PreSid3nT\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598185671_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe/2+2+17\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598242145_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF/So+if+the+CIA+is+now+framing+QAnons+by+manipulating+the+news\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc/Watch+NOW+before+this+is+taken+down+ShadowGate\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598303763_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ/Please+Save+The+Children+Please\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598362059_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF/We+Are+All+Assange+Now\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598404536_1A67pkZNx64w3sii9TAUCdJhRsFowGpYrY/The+4th+Reich+is+being+re+established\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598232523_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb/Introduction+Why+Anonymity+Matters",
			"added": 1598405385
		},
		{
			"topic_id": 1603808436,
			"title": "The Pyramid Code",
			"body": "A friend of mine asked me to help her preserve this content as the work's original publisher feels in may be taken down by YouTube in the future, and so naturally I uploaded a copy of it to KopyKate BIG. I am asking for all of you assistance in seeding this file, and if you are interested please listen and leave a nice review here! Thank you all very much!\n\n\"Imagine living in a world without time and space, without walls, without borders, without wars, without disease, without vaccines, without toxins, without drugs, and without doctors. A world of Love, brotherhood, and harmony. A world of happiness, wealth, eternal abundance and equality. A world without a false religion and a fake book of laws that controls us. A world in which we are the law itself. A world of justice. A world without false rabbis, false priests, or any other corrupt religious leaders. A world without corrupt lawyers, judges or politicians. It is doable. It has already happened and it will happen again!\" --The Pyramid Code\n\nhttp://127.0.0.1:43110/big.kopykate.bit/?Video=1603807040_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb",
			"added": 1603808433
		}
	],
	"topic_vote": {
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"1598703400_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"1598587925_1JF4wvtFwYMrD4uhzLeNwW6SMVS4raXKJJ": 1,
		"1599651874_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1601916032_1nHMqT985W89soMJx1hSwKQgwqkAA4AjR": 1,
		"1602785026_1LAYCTjoLm4WvEvgSgtS2isgsNYfQokkPC": 1,
		"1602768387_191jbK3GNmVritcMymKkFuxyYFXxqv2xpC": 1
	},
	"next_comment_id": 36,
	"comment": {
		"1597510687_12QcU9x7iK1XjguRKQKKhyc6ErguzYMkRc": [
			{
				"comment_id": 1,
				"body": "> [thorburn](#comment_113_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Lmfao, there certainly is such a thing as fact checking and sourcing, but you sure as hell don't bother to do either obviously! ShadowGate provides the Government payments website as a source. That source shows the fact that the companies mentioned were paid by the government. It also shows the data etc. is/was stored and managed outside of the American continent in Germany by a none governmental third-party. [...]\n\nThanks again for having my back thorburn!\n\n(This is the new ZeroID for OTBTechnologies as I have run out of available data on the original profile; once this account's data limit is reached I will likely be going back semi-anonymous. The only reason I was not originally semi-anonymous was because I am still introducing new users to this platform and I wanted them to feel at home. ^_^)",
				"added": 1598102268
			},
			{
				"comment_id": 4,
				"body": "> [wwg1wga](#comment_42_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): I think he was more so refering to the defenders of truth online. Its pretty standard and well known now that many individuals such as ourselves refer to the collective group involved in the movement to expose corruption within the US Government. [...]\n\nThanks for coming in clutch with that response bro!\n\n#QArmy\n#WWG1WGA\n#TheStormIsComing\n#FollowTheWhiteRabbit\n#NothingCanStopWhatsComing",
				"added": 1598111308
			},
			{
				"comment_id": 7,
				"body": "> [dietznuts](#comment_4_1N4DrYgNWGNwYAvzatbyveU1QuMNyteCk1): GoFuckaDuck [...]\n\nHaHaHaHaHa!!!!\n\nI absolutely CANNOT believe you saw that post too! :)\n\n#WWG1WGA\n\nhttps://OTB-Technologies.com\n\n> [qarmy](#comment_2_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe): Tag! You're it! :) [...]\n\nYOU TOTALLY GOT HIM DUDE!!! ^_^",
				"added": 1598232226
			}
		],
		"1596507535_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 2,
				"body": "> [wwg1wga](#comment_40_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): That makes no sense but ok lol :) [...]\n\nPanama is affordable...\nIdk about inviting exactly...\nSome questionable things with regard to their government there too...\n\nCosta Rica is good if you are looking at South America though...\nSwitzerland for Europe...\n\nAnd, in my opinion, Scandinavia looks like heaven on fucking Earth lol :)",
				"added": 1598103613
			}
		],
		"1597908401_1GVfTPghbWnBKbRWpYpkRCKgMi4wFecie2": [
			{
				"comment_id": 3,
				"body": "> [wwg1wga](#comment_43_1M8tVWMfjhezUzmRxrzyBaSiZc3QbHEJjF): I like this idea...\n\nIt does provide the user with the power of choice which seems acceptable to me as well.\n\nThe only concern I have is that it would allow people to live in their own little fishbowl of a world and limit ZeroNet's use as a free speech platform, but if that is what the devs want then so be it as it is their platform not mine.",
				"added": 1598111230
			}
		],
		"1598185671_1V2NizfDpQK4UxTp54zsm9AtkWeSv2BXe": [
			{
				"comment_id": 8,
				"body": "bump! ^_^",
				"added": 1598232572
			}
		],
		"1598404536_1A67pkZNx64w3sii9TAUCdJhRsFowGpYrY": [
			{
				"comment_id": 9,
				"body": "I feel this may be relevant as well...\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb/Who+was+talking+shit+about+us+again",
				"added": 1598405433
			}
		],
		"1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w": [
			{
				"comment_id": 10,
				"body": "> [bigbadbob](#comment_1132_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I think you are going way out on a limb with this one.   A split second of critical though would conclude you lack much evidence.\n\nSee, that is the problem... Anonymity and Information Security prevent the \"unprivileged\" from being able to gain such evidence, and thus conspiracy theories are born... \n\nAnd, what's worse, is that the FBI now wants to label conspiracy theorists as potential domestic threats...\n\nThey are literally trying to tell their citizens that thinking for themselves is almost considered a crime now...",
				"added": 1598562470
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_1134_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I am perfectly ok with people believing what ever they want.  Don't mind me, I am just a skeptic.\n\nI am skeptical of it myself lol\n\nIt was just an interesting thought I had when I was bored at work one day :P",
				"added": 1598589099
			},
			{
				"comment_id": 17,
				"body": "> [robione](#comment_585_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): https://apps.occ.gov/Search/?q=INTOSAI%20&id=&ds=365&st=0&sm=relevancy&sb=check PDF, page 3\n\nWhat does that have to do with anything?",
				"added": 1598635112
			},
			{
				"comment_id": 21,
				"body": "> [anon45672997](#comment_2_1H5Hj9Q9RXFAWXaFvAAMLuQurxUmExxgci): Your precious \"Q\" is currently Jim Watkins, owner of 8chan/8kunIt's already been proven. [...]\n\nProven?\n\nO rly?...",
				"added": 1598805580
			}
		],
		"1598405387_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 11,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'd say you're not very intelligent to majority of us on zeronet. [...]\n\nTL;DR...",
				"added": 1598562524
			},
			{
				"comment_id": 12,
				"body": "> [kapec](#comment_35_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): I'd say you're not very intelligent to majority of us on zeronet. [...]\n\nOh, and by the way, fucks given... Zero...\n\nMy goal is to empower people...\n\nIf you want to \"deanonymize\" me then go ahead... Why should I care... Is this a threat to me?\n\nI've already been hit by a fucking truck for exposing this shit...\n\nMy life has been ruined because I decided that I value my country over my own life...\n\nYou are not proving anything to anyone with your posts dude... If anything, you are strengthening my platform...\n\nP.S. Thanks for the free advertising! That's literally what I was going for bro... :)\n\nP.P.S. You remember when I said humans are easily manipulated?... Yeah... Fuck you... :)",
				"added": 1598562817
			},
			{
				"comment_id": 13,
				"body": "Again, my most valuable works cannot be identified...\n\nI provide people the information required to expose similar corruption within the government and big business...\n\nYour threats to me mean jack shit... \n\nLol :)",
				"added": 1598562921
			}
		],
		"1598581805_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": [
			{
				"comment_id": 14,
				"body": "Wow, this is rather interesting to say the least lmfao!\n\nI am _definitely_ not conspiring with kapec, nofish, zaron, or geekless in any way. There are many aspects of this that seem to interest me from the psychological aspect of how conspiracy theories work and are formed, but I (again) would like to assure the public that this is entirely baseless. I would never side with people who make threats of deanonymizing persons as this goes against my morals, and I would also never side with people who seek censorship of a platform designed for free speech. So, let's get that cleared up first off.\n\nSecond off, let's say some aspects of the conspiracy are true. The same thing has happened with QAnon and Donald Trump which has now successfully resulted in the proper authorities taking action against the underlying injustices emphasized by the QAnon conspiracy theory. So, again, if it is true that I am using alter egos then perhaps that is for the same reason. It draws attention to my cause and it entices people such as Kapec to even further promote it.\n\n\"Propaganda works best when those who are being manipulated are confident they are acting on their own free will.\"  --Joseph Goebbels (Hitler’s Minister of Propaganda)\n\nPeople cannot accept that propaganda works when they cannot accept that propaganda works on them.\n\nTo believe yourself above the influence of propaganda, is to become more susceptible to propaganda.\n\nhttp://127.0.0.1:43110/Talk.ZeroNetwork.bit/?Topic:1596458821_1BULx3pdbqxqTWCSBvSQijujiHhXJT1D3w\n\n#PsychologicalManipulation\n#MakeAmericaFreeAgain\n#OTB4PreSid3nT\n#Trump2020\n#PsyOps\n#CIA\n#MI\n#Q",
				"added": 1598589007
			}
		],
		"1598631792_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 16,
				"body": "https://www.savethechildren.org/us/charity-stories/child-trafficking-awareness\n\n#SaveTheChildren",
				"added": 1598635033
			}
		],
		"1598703400_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 20,
				"body": "THANK YOU!!!!!",
				"added": 1598712667
			}
		],
		"1598711364_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": [
			{
				"comment_id": 19,
				"body": "THANK YOU!!!!!",
				"added": 1598712656
			}
		],
		"1598804751_1EZTWytasXcKdiUFnN4KHqAfvg1nwkTkKv": [
			{
				"comment_id": 22,
				"body": "I spoke with one Belarussian on here when the internet blackout was going on.\n\nSo, yes. \n\nZeroNet is pretty diverse from what I have found.",
				"added": 1598805713
			}
		],
		"1599651874_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 23,
				"body": "Mainstream media is all propaganda now.\nI don't bother reading propaganda.\nWhat's the point?\nWaste of time.",
				"added": 1599665654
			}
		],
		"1597367837_1BaoKFcxVPG6NEagoQhg78Cw3U2njNudd": [
			{
				"comment_id": 24,
				"body": "> [953gwpudtmsxjq4a](#comment_18_1F7Ks3WsZieUtEYgNjZXrhxxLkvgJ1EQtp): Ever hear of Scuttlebutt? Haven't looked at in awhile, but it seemed to have potential. In an emergency, could serve as \"backhaul\" for more limited mesh networks. Scuttlebutt is modernized sneakernet with crypto. More complicated version of the Russian's Samizdats (illegal publications). [...]\n\nThanks!\n\nI was actually planning on developing something along those lines my own self!\n\nYou just made my life so much easier! \n\nNow, I can forget about that project while I work on other more important political endeavors of mine!\n\nThank you! Thank you! Thank you!",
				"added": 1599665847
			}
		],
		"1599847995_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 25,
				"body": "> [krombopulusmike](#comment_29_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e): It would be nice to explain your reasoning here seeing as you are objecting to some pretty well studied methods to obtain complete and total anonymity which are even rumored to be in use by government agencies right now. Lol, just saying.\n\nProbably just a kid who thinks he knows better than the experts lol\n\nHe'll figure it out eventually...\n\nhttps://www.whonix.org/wiki/Documentation",
				"added": 1600628897
			}
		],
		"1601916032_1nHMqT985W89soMJx1hSwKQgwqkAA4AjR": [
			{
				"comment_id": 26,
				"body": "Violates the First Amendment...",
				"added": 1601924976
			},
			{
				"comment_id": 28,
				"body": "> [xeu100](#comment_4_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq): A condemnment doesn't make something illegal\n\nWould set precedence in future court cases where more freedoms can be taken away more easily.\n\nViolates the Constitution anyway, so it won't pass.\n\nIf it does, then we will have to get it repealed to protect the American people from tyranny.",
				"added": 1602074313
			}
		],
		"1601932131_1CU4SJ6J6HJDigi1N1Xryogx6WHWAHD7Ji": [
			{
				"comment_id": 27,
				"body": "> [thorburn](#comment_162_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): As far as I can tell all roads eventually lead back to Rome. The J's/Zionists are part of a much broader issue, not the root cause imho. There appears to be some form of toxic power structure which traverses every culture and belief system through infiltration and corruption. That toxic power doesn't appear to have any direct interest in any particular belief system, nationality/nation or race etc. It's all encompassing and the goal seems to be the enslavement and control of everything earthly. The Roman church and more specifically the Papacy have declared to hold ultimate power and dominion over all life on earth, as evidenced in Papal bulls and originally in the Unam Sanctam. [...]\n\nExplains a lot in only a few words…\n\nLike why there are Tor Exit Nodes being operated within the Vatican…\n\nAnd why they tried to kill me when I spoke out about what I realized had been being done…\n\nThey knew I was on the cusp of figuring it all out which would then result in me becoming capable of gaining the ability to reverse engineer everything they had done and/or sabotage their work… Too damn bad… :)\n\nNow they are trying to make me out to be some kind of a “threat” despite the fact that all I want is my #FirstAmendmentRights and #ForthAmendmentRights to be respected by my government…",
				"added": 1602072157
			}
		],
		"1602677892_114yCZGnUqTUcasBbAKUS6xmhQyDPC1ZXt": [
			{
				"comment_id": 29,
				"body": "Sweet! Thanks! :)",
				"added": 1602681902
			},
			{
				"comment_id": 30,
				"body": "> [kapec](#comment_66_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): \"We have invented nothing\"Is there a torrent available of this archive? Coz in current state it's susceptible to censorship.\n\nI will have one available shortly if not! \n\nThanks for the idea kapec! ^_^",
				"added": 1602695154
			}
		],
		"1602719673_1DxTtidQDLuoPMUtirmLG6qNc1jFrku7X7": [
			{
				"comment_id": 31,
				"body": "> [claude](#comment_24_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1): no you don't\n\nI'm so dead rn!\n\nLMFAO! xD",
				"added": 1602732484
			}
		],
		"1601486791_1G4bDXzgDecBgPWKafP8J9zFGNsPefuBnD": [
			{
				"comment_id": 32,
				"body": "> [centinela](#comment_1_1Bs1cUntgwACXyZq3bhwhquN1hAWxAZtih): hola\n\nHola mi amigo!\n\nBienvenidos a la ZeroNet! :)",
				"added": 1602994580
			}
		],
		"1603738395_1Dr4Ji2TmsvhJW383ukksrobMvEwJnNrxQ": [
			{
				"comment_id": 33,
				"body": "> [bigbadbob](#comment_1176_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Doesn't social media kinda defeat the purpose of TOR?\n\nNot necessarily. Social Network Analysis, Stylometrics, etc can be used to ID the users of social media sites over Tor, but being mindful of such and it would be nearly impossible to positively ID all users of said service.\n\nSocial Networking via Tor allows for elimination of censorship such as that in China, Russia, and the United States for example. It is the reason the United States' Supreme Court ruled that Anonymity is protected under the First Amendment. Anonymity is the only way to speak in the United States sometimes for various reasons for example.",
				"added": 1603808305
			},
			{
				"comment_id": 35,
				"body": "> [kapec](#comment_76_1CQ14MAUEp55ijU6rQLQ9vZdzxCQe9s1SF): same could be said about encryption and knowledge-sharingyet DMCA and Encryption export restrictions still happened1st amendment is a joke at this point\n\nEh, I wouldn't say it is a joke per se. Though you are right about how encryption and knowledge sharing are an infringement upon the people's civil liberties that were once necessary during wartime which no longer serve their intended purpose and are in a sense easily circumvented anyway.\n\nFurther, I do agree with you that very many \"laws\" have been put forth that conflict with the constitutional rights of the American people which is why we have the Supreme Court and Common Law to help protect us here.\n\nThe Supreme Court has made poor judgement calls in the past though, and so there has also recently been an uptick in the number of people interested in an International Court of Laws. These rights are guaranteed under international law and protected by the United Nations. An example of such can be seen here: https://www.commonlawcourt.com/\n\nAlso, here: https://www.itnj.org/\n\nMany more examples can be found here as well: https://www.un.org/securitycouncil/content/repertoire/international-tribunals\n\n#WeThePeople",
				"added": 1603819068
			}
		],
		"1603808436_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": [
			{
				"comment_id": 34,
				"body": "You may also help seed from IFS if you enjoy the content and/or simply want to help us.\nThank you again!\n\nhttp://127.0.0.1:43110/1BLnYeYMYhCQUiCVQKesJwa22Jzpcdd3Y6/index.html?view:item+id:15f1_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb_item_1+type:video",
				"added": 1603809658
			}
		]
	},
	"comment_vote": {
		"1132_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"14_148xLrZAr6Bjyhe6spVxJJbFHtdmwbVSCb": 1,
		"3_12WBPqCPHMsabhcf5zvg4S7Q4LbMA5erKN": 1,
		"29_1BfrmacRWaPSuHVmRdvaMUYykqd2MGRo5e": 1,
		"162_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"40_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"24_1MUCEEtbLUYFpc6vqhp4F5u4ia8MJ9RGK1": 1,
		"24_123mMiSRJ2T5wrMtS9Ub8rKvPTRcTjVSTx": 1,
		"1_1Bs1cUntgwACXyZq3bhwhquN1hAWxAZtih": 1
	}
}