{
	"next_post_id": 2,
	"next_comment_id": 9,
	"next_follow_id": 3,
	"avatar": "generate",
	"user_name": "Tprola",
	"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
	"intro": "Random ZeroNet user",
	"post": [
		{
			"post_id": 1,
			"date_added": 1517273893,
			"body": "Hello ZeroMe!"
		}
	],
	"post_like": {
		"1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517930302": 1519659052
	},
	"comment": [
		{
			"comment_id": 1,
			"body": "I have to say, I had also preferred EmojiOne, however now that I had compared between the two again (and I agree, V3 of EmojiOne isn't as nice as V2), I have to say, Twemoji is just as good as V2 of EmojiOne now.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517987050",
			"date_added": 1518297261
		},
		{
			"comment_id": 2,
			"body": "@Tprola: Although I don't care much about emoji in the first place.  By the way,@Kaffie, I 'm just cerious, however are you using MacOS or Linux? I am using Linux, or to be precise, the Solus disto.  Also, I am sorry about the double post and the disorganization, I'm used to organizing my posts by pressing Enter. Might there be an equivalent here?",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517987050",
			"date_added": 1518297496
		},
		{
			"comment_id": 3,
			"body": "@Kaffie: Thanks, I'll try that out right now.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517987050",
			"date_added": 1518464761
		},
		{
			"comment_id": 4,
			"body": "Sorry, I had accidentally pressed ctrl+enter.\nNow that much better.\n\nBy the way, how are your plans for KopyKate coming along?\nI had gotten into a standstill with my Netgear DM200 unbricking due to my desktop being hit by something (I have no idea what, I wasn't at home at the time), so I am looking for a replacement for my case (it barely got damaged, however it was damaged at the most critical place, bending my motherboard in the process), and hoping that my motherboard still functions (thankfully, it didn't even crack, and I had mostly straightened it out).",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517987050",
			"date_added": 1518465143
		},
		{
			"comment_id": 5,
			"body": "@Kaffie: Oi, All this time I had gotten the two of you mixed up.\nI am extremely sorry about this, I have no idea how this had happened.",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1517987050",
			"date_added": 1518516495
		},
		{
			"comment_id": 6,
			"body": "I remember arguing with a friend over this subject, he wanting to be a vegetarian, but thinking that nutrient-wise, there is no replacement for meat, while I think that there are always plant-based replacements, just that not all are known and/or have been discovered, however that it is not necessary to become a vegetarian.\n\nThe main issue, in my opinion, is the sheer amount of processed foods that have been tampered with too much, and that includes vegetarian foods.\n\nAs to other claims, while I personally think that some of them are definitely valid (such as animal exploitation), I also think that they have been blown out of proportion.\n\nBottom line, my opinion of a person does not change based off whether they are vegetarians or not, but rather on what their ideals are and how they behave.\n\nBy the way, full disclosure here, I am not much of a meat guy (I prefer milk products, despite the fact that I have a slight allergic reaction to cow milk), and having grown up such, I try eating healthy (though I do have a sweet tooth).",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1520250391",
			"date_added": 1520939258
		},
		{
			"comment_id": 7,
			"body": "@leftside: While I do not completely agree with your words, I do agree with their direction.\n\nAnd I am sorry to everyone if I had sounded like a troll, I had meant that whatever @Kaffie decides to do, it won't change my judgment of her, and I am still a fan (building a reliable search engine is no small feat, after all).",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1520250391",
			"date_added": 1521062454
		},
		{
			"comment_id": 8,
			"body": "I have not yet learned enough about how IPFS and ZeroNet function to have a say, but I can say that, it is quite annoying when I cannot open any ports when running a 3rd party firmware (Padavan/OpenWRT/PandoraBox/etc.) on my router (currently the Xiaomi Mi 3G), wheres I can do so without issue on the TP-Link TD-W9970 on stock (I still haven't gotten around to debricking my Netgear DM200).\n\nSorry about my disappearance, not much time, and I had moved to a different part of the house, so horrible reception (~52% on 2.4Ghz to the extender (TP-Link RE200, stock), and ~54% on 2.4Ghz to the router).",
			"post_uri": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh_1549682316",
			"date_added": 1549933197
		}
	],
	"follow": [
		{
			"follow_id": 1,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1MM2oCBAwdyJC1Q1Rv9ufMWTi9PqKWnRcW",
			"user_name": "Tprola",
			"date_added": 1517273903
		},
		{
			"follow_id": 2,
			"hub": "12h51ug6CcntU2aiBjhP8Ns2e5VypbWWtv",
			"auth_address": "1NWh3WAty57FH8at1WtrZigMrdhrDkuPzh",
			"user_name": "Kaffie",
			"date_added": 1517273951
		}
	]
}