{
	"next_topic_id": 4,
	"topic": [
		{
			"topic_id": 1554266804,
			"title": "Point of ZeroNet",
			"body": "Hi All,\n\nI joined the ZeroNet community a few weeks ago and found it to be really intriguing. I like the occasional news stories and the unfiltered, uncensored content, even if it was hard to take, and the interesting conversations. However, as time continues, I find that I struggle to find a use for ZeroNet. I see a lot of talking about ZeroNet, but don't see much more conversation.\n\nWhat are the hopes for ZeroNet as a community? For content? For general usage?",
			"added": 1554266803
		},
		{
			"topic_id": 1554869438,
			"title": "Check out my new post on my blog",
			"body": "I'm talking on ethical issues surrounding computers and technology http://127.0.0.1:43110/12ZcKJmvivo3JBmgjEhkaH1SVbghB4dpN4/?Post:6:New+blog+post",
			"added": 1554869436
		},
		{
			"topic_id": 1555555278,
			"title": "Check out my latest post in my blog",
			"body": "http://127.0.0.1:43110/12ZcKJmvivo3JBmgjEhkaH1SVbghB4dpN4/",
			"added": 1555555275
		}
	],
	"topic_vote": {
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": 1,
		"1554477808_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1551860529_1PfMSesJyDFWRTGAGqmbru27m44GkqjXfj": [
			{
				"comment_id": 1,
				"body": "> [ssdifnskdjfnsdjk](#comment_703_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): I think that war/aggression/attack is/will be very short and lasting - when you consider lifetime of the Earth and people (several millenium). It is good to remind the bright future, amendments, and the love that is going to manifest after the evil will come to an end. Only some people have faith in this, but for those i think to maintain the faith was said to be important to help them overcome difficulties.\n\nThat's hope for our race as humanity. I too hope that we can begin to move away the violence, fighting, and stealing that plagues our race. If any of you have been to a place of oppression or a place of great difficulty, you'll find that there are many grassroots type movements happening. Sadly, but not surprisingly, our governments aren't able to help. They are often too big and too impersonal to be of much affect. These grassroots movements are slowing beginning to have affect and make a difference in our world. It happens one person at a time until we overwhelm those who are negatively affecting humanity. Faith is our biggest asset in this. The effects of these movements are slow and difficult. \n\nHow can we, as individuals help force change?",
				"added": 1552279437
			}
		],
		"1551837029_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": [
			{
				"comment_id": 2,
				"body": "> [viridian](#comment_2_14JaXK2J1AzDXg8wkZsrdw4bRsHZ1YYhRo): Are there not any downsides to decentralization that might warrant considering having some infrastructure at least semi-centralized? Why is it bad if corporations make a blockchain network? Does it preclude anyone else from making a blockchain network? Is 'pirating' a verb or an adjective in this context?\n\nFrom my understanding, centralization means that someone can control the network. The goal of this is to make it so spread out, that it can't really be stopped. Someone might be able to take away or control part of it, not the while thing. It does however make things a bit slower and more dependent on a large network of peers to make the network more useful.",
				"added": 1552279724
			}
		],
		"1552589048_1KKaZQ8JXomKJsjDcfcym4mDyJBKZj9Q5K": [
			{
				"comment_id": 3,
				"body": "There's a possibility that there is life. It may exist in different forms or have different bases (not carbon-based). It's possible that we are looking in the wrong place. Who knows...",
				"added": 1552628538
			}
		],
		"1552644409_1By85xCDz7VyZEq9WjmhtbNaPKimQwhPLp": [
			{
				"comment_id": 4,
				"body": "I think it needs to be seen. Personally it burned my heart to watch this happen, I actually didn't finish watching. However, it is important to see. It's so easy to cut ourselves off from the bad. Regardless of who those people are, they were murdered while praying and were defenseless. They were praying to their god for salvation and a good, peaceful life. No one should ever go into a place of worship and have to worry about getting shot for praying towards their god.\n\nI say get the information out there. Let it hurt when people watch, let them be uncomfortable, make some compassion towards these people. Can you sit and watch this happen? What do we do about it?",
				"added": 1552683350
			}
		],
		"1554266804_1KtR9NFPH7Gh9ksrWEBJ5Dq8H7DsjBBU1A": [
			{
				"comment_id": 5,
				"body": "I just started a blog up that focuses on computer ethics, current issues in technology, and other technology topics. It's titled Computer Ethics.",
				"added": 1554270522
			},
			{
				"comment_id": 6,
				"body": "http://127.0.0.1:43110/12ZcKJmvivo3JBmgjEhkaH1SVbghB4dpN4/",
				"added": 1554338622
			},
			{
				"comment_id": 8,
				"body": "> [crushtorzero](#comment_1_1Lse1TA2cqyGW6KQF9o9gBYATueLqLgPEo): I think ZeroNet is loads easier to use than Tor. The fact it's easy to get up and running is a big plus. I will encourage friends to use it.\n\nFrom my understanding they aren't the same thing. Hence, why it's recommended to use them in tandem. The Tor protocol helps protect anonymity while the zeronet protocol and networking does the P2P work. They don't require each other, but work together.",
				"added": 1554471655
			}
		],
		"1554273632_1HBVHa3TE5NnztRdn1geJmMKTZ7HJsEvLV": [
			{
				"comment_id": 7,
				"body": "The variety of honest content is so interesting and exciting to read. I'm all for it and love the conversations happening. Definitely waiting to get a higher user base.",
				"added": 1554421295
			}
		],
		"1554908088_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 9,
				"body": "Like many things, they are good in moderation. Just like alcohol can be good in moderation. Smartphones help to connect us, make it easier to explore, stay connected with friends, meet new people, and learn. They may harm us now, but I don't think technology as a whole reaches it's full potential. I think we could focus on some of the more positive capabilities and improve those. For example, online education platforms like Udemy and Coursera or language learning apps are very powerful, but not as widely used as they should be.",
				"added": 1554932191
			}
		]
	},
	"comment_vote": {
		"3_1KTmJTXsrtoVM1p4UvshHgXkvdu6exgwX8": 1,
		"4_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"26_1LGApmQZPN49nawg4HQQgf8ToVUPxGe2Zq": 1,
		"357_1AdWXZdPUimpXoGNXUBde2CHR7gLf4onxE": 1,
		"727_12gAes6NzDS9E2q6Q1UXrpUdbPS6nvuBPu": 1
	}
}