{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1572617199,
			"title": "Russia Splinternet",
			"body": "I hear Russia is messing around with creating its own \"Great FireWall\" and today is the first day. Anybody in Russia with some English that can give some first impressions? Have things gone to shit, or is it still mostly business as usual?",
			"added": 1572617198
		}
	],
	"topic_vote": {
		"1573036387_1Kzonk6v6ccFT3adLkCHoKJhGnoW1UhvY5": 1
	},
	"next_comment_id": 7,
	"comment": {
		"1572617199_16nArdxrSaNThNp83kL8E6NLL9WD98iUne": [
			{
				"comment_id": 1,
				"body": "> [pineapples](#comment_91_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T): i would like to add that if this does have the abilities to protect against a cyberattack as they say it can, that it is a necessary advancement in the era of cyber warfare.  i do believe that there are many ways that this system can be used for censorship however it seems to me that a system like zeronet would still be able to function inside of the splinternet and therefore censorship would be weakened.  if an enemy of the motherland is trying to attack the russians via a electronic medium, being able to shut off that pathway is a critical tool.  Imagine that an attacker based in another country gains control of the electrical grid controls, they would be able to potentially shut down the majority of the russians power.  if the russians had a kill switch, they could immediately cut off the attack and restore power.  even though there is potential for abuse i think a system like that is necessary.  Im not quite sure of the technical aspects of the current system but i hope its actually for defense and not just another censorship tool that they are introducing under the disguise of a national defense mechanism.\n\nYeah, I understand it from a National Defense perspective, though I think they should just be isolating critical systems from public networks anyway as it's *relatively* easy to bridge national public networks. It's just, as far as the Russian government is concerned, I can easily see it being abused as they've already shown a willingness to block and censor for political reasons.",
				"added": 1572643662
			}
		],
		"1572705629_1FXFTPnN5etVrX3KURv61vEEbEqayTjiLr": [
			{
				"comment_id": 2,
				"body": "I mean, not really. They avoid the need to share a file in order to share/download a torrent, as you just have a string of text that's no more complicated than a standard URL. But your torrent client still has to eventually download the torrent file, it just does so from other torrent clients, and then it proceeds to download the actual files in the same way as before. In the end you should still be using a VPN if you're worried about government/ISP monitoring you.",
				"added": 1572758377
			}
		],
		"1583557114_129AZxKKZFQAyrSxv8ocZtZzPU1Gy6Ua71": [
			{
				"comment_id": 3,
				"body": "For those wanting a more open option on Android where you have full control over the files and configuration, get Termux and run `pkg install zeronet` and it'll setup everything you need to run the py3 version of ZeroNet. There's no fancy UI as it's basically terminal Linux on your phone, but it works great and you can even get Tor working as well.",
				"added": 1583715793
			},
			{
				"comment_id": 4,
				"body": "> [styromaniac](#comment_1861_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You sure of that? Termux didn't locate the package.\n\nMy bad, I forgot you need to enable the unstable repo first: `pkg install unstable-repo`",
				"added": 1583725679
			},
			{
				"comment_id": 5,
				"body": "> [styromaniac](#comment_1862_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Thank you. I'll try it. Edit: So far, so good.\n\nTo get Tor working I recommend this method:\n\n* `pkg install tor nano`\n* `nano $PREFIX/etc/tor/torrc`\n* Remove the # character from lines `ControlPort 9051` and `CookieAuthentication 1` (line ~57), then CTRL+X to save\n* Now create a script to run Tor together with ZeroNet. You can either save it to the bin directory to run by command, or the shortcut directory if you plan to use the Termux Widget add-on to make a home screen shortcut.\n\n`nano $PREFIX/bin/zn; chmod +x $PREFIX/bin/zn`\nOr\n`nano ~/.shortcuts/zeronet.sh; chmod +x ~/.shortcuts/zeronet.sh`\n\nScript:\n````\n#!/data/data/com.termux/files/usr/bin/bash\n(trap 'kill 0' SIGINT; tor & zeronet $@)````\n\nThis will launch Tor and ZeroNet at the same time, but also allow you to gracefully close both by simply performing a CTRL+C in the Termux terminal.",
				"added": 1583728155
			},
			{
				"comment_id": 6,
				"body": "> [styromaniac](#comment_1862_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd):  Edit 2: It's installed but not working. [...]\n\nWhat's the error?",
				"added": 1583728481
			}
		]
	},
	"comment_vote": {
		"2_1MMpsjj9iNC5JT9usW8tatHvcY8QAAhP6": 1,
		"91_19XCfah7iuo9zYqk7GoTDXVNp4p5BpEH1T": 1,
		"1_1MLPKg9NExpnXsdUjqyRGMd9wZqZoubh3c": 1,
		"99_153dW34Ng5fVUZ5D5NcZRfAbvRQS1jYC1k": 1
	}
}