{
	"title": "// CYPHER\nby \nRadioAngel",
	"description": "<br><img src=\"img/me.png\" size=\"150px\", width=\"150px\"><br>\nLongform Reads from cyberspace...\n\n“When we blindly adopt a religion, a political system, a literary dogma, we become automatons.”\n― Anaïs Nin\n\n<a href=\"http://127.0.0.1:43110/0sh.bit/?Desamber\">Desamber</a>.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 21,
	"demo": false,
	"modified": 1543686003,
	"post": [
		{
			"post_id": 20,
			"title": "On Leaving (Part Two)",
			"date_published": 1543685945.516,
			"body": "In my last post, **\"On Leaving\"** I talked about the sociological aspects of leaving something behind and the five adaptation strategies, or options you have when you've started to question whether or not something is right for you.\n\nThe question you ask yourself before coming to the adaptation strategies can vary. However, they all have one thing in common, you are asking whether or not something still serves you. This can be applied to people (within reason), ideas, software applications, communities, and even entire societies. \n\nHere's some examples.\n\n- A person you've known for a long time no longer is taking your calls and starts acting aggressive. \n\n*Your best options would be retreatism or innovate and find out what is wrong.*\n\n- A social media platform has been run down with advertisements and the algorithms are becoming more aggressive. You feel it is no longer a good space for communication.\n\n*Several options are available.* \n\n- You are forced into poverty and cannot get ahead no matter what you do. The society is no longer serving your needs. \n\n*You can leave. Innovate and make society better for more people. Rebel and start an activist group. Or even leave the society all together and start over somewhere else.*\n\nWhatever you decide, you have to remember that you have just one life to live. Changing your situation for the better is always a better solution than waiting for something to change and doing nothing.  \n\nSometimes that means walking away from someone, something, or someplace. ...\n\n> “living people can sometimes change their situations, while dead ones can’t change a fucking thing.” \n― Cory Doctorow, Walkaway"
		},
		{
			"post_id": 19,
			"title": "On Leaving...",
			"date_published": 1543452276.624,
			"body": "Travis Hirschi created **\"Control Theory\"** or the idea that social control is directly affected by the strength of your social bonds. Put another way, whatever holds you to a platform, location, etc. controls you. ...\n\n**What are these social bonds?:**\n- Attachment (Connection to others).\n     Family, Friends, Co-workers, Community etc.\n- Commitment (Personal Investment in Conventional Behavior).\n     Commitment can be to a social media platform or even a lifestyle.\n- Involvement (Participation in Socially Legitimate Activities).\n     The time you spend with people, on a network, at work etc.\n- Belief (Agreement on Common Values in Society).\n   Are you values the same as those in your society? Do you have different ones?\n\nRobert Merton created **\"Strain Theory\"** or the idea that access to socially acceptable goals (college, a decent paying job, or home ownership etc.) plays a part in determining whether or not a person conforms to society.\n\n**Ask yourself:** Do I have the same access to things as others in my society?\n\nWhen you have a socially acceptable goal but no way to attain it due to inequality you have five options. ...\n\n**5 Adaptation Strategies:**\n- Conformity (Don't deviate)\n     This doesn't solve the problem but allows you to put it off for as long as possible.\n- Innovate (Pursue the goal through other means)\n     Attempts to solve the problem through loop holes, creating something new, bending of the law, or breaking it.\n- Ritualism (Lower your standards)\n    Wait for change to happen.\n- Retreatism\n     Walk away from it and start fresh somewhere else.\n- Rebellion\n     Activist for changing the current social structure and replacing it with a more fair system.\n<code> To be continued. ...</code>"
		},
		{
			"post_id": 18,
			"title": "Unsustainable Systems",
			"date_published": 1543193556.996,
			"body": "Human society is a series of conflicts, Trotsky said, \"Every state is founded on force.\" and if we use ancient Rome as an example, we can see this idea's progression through time. Ancient Rome moved rapidly from warring clans, through kingship, to a revolution that lead to the rise of an aristocratic class that divided their society into one of haves and have nots. Those who were so poor that when they went into debt, they had to sell themselves just to stay alive. They were also the ones who made up the majority of Romes' army and the first to get attacked outside of Romes' walls if they were farmers, which led to the entire army leaving Rome defenseless at least twice in protest. But let's get back to the analysis shall we?\n\nBoth Karl Marx through his creation of Historical Materialism and Conflict Theory, as well as, Aristotle, through book I of \"Politics\" prove that the state and society have formed in this way.\n\nAristotle theorizes that once currency is created, individuals begin to want to accumulate as much as possible, with the fastest ways of doing this being taking advantage of his fellow men through low wages, lending, and interest rates, as well as, through investment (money making money) and commerce. Marx moves this theory further along by saying such economic activity is the very foundation that shapes society and a major driver of inequality and injustice.\n\nThe state then, or its interpretation thereof throughout time has been one of legitimizing authority and power. Currency by it's very definition enables the wielder more power over one who doesn't have as much. Thus, those with the most have the most to loose, if they don't tie their power to that of authority. By making up the rules, they secure their position and that of everyone else.\n\nAristotle said currency was the cause of inequality and greed. Marx says its our domination by the state and economic structure. Moving forward Max Weber states that it's rationalization devoid of values originally found in religion and ethics that causes disparity and dehumanization over time.\n\nIf I was to add to this I would say that they were all correct and noticing different aspects in an unsustainable system. From the moment we as a collective species decided that some people were better than others, by not having a set of ethics in place to prevent it (greed and a lust for power), we have been trapped within an advancing system that reinforces these divisions until it has encapsulated all life; human and non on a planetary level.\n\nPlato said it before in his theory of five regimes that where democracy ends, tyranny begins. Once we hit that limit where we no longer recognize each other as being human beings, we've lost. We are reaching the end of our current systems ability to maintain itself. The only thing left for us to decide is whether or not we want to form a better system or accept imminent collapse. Because unlike all the other times in our history as a species, a habitable environment was never on the line. ..."
		},
		{
			"post_id": 17,
			"title": "Bokashi",
			"date_published": 1541533466.512,
			"body": "A bokashi system is a compost bin that works through fermentation. Unlike other compost systems it can compost the following:\n– Fruits\n– Veggies\n– Meat\n– Dairy\n– Mystery leftovers\n– Cardboard\n– Paper\nand much more. ...\n\n<b>DIY Bokashi Compost Bin</b>\n\nYou can create a two part system, one under your kitchen sink and a larger one in your yard to transfer it to.\n\nFor your kitchen, the simplest method is to use a punch dispenser with a spigot. Add your compostables and cover in a layer of bokashi medium. Every once in a while drain off the liquid through the spigot and dilute with water for a potent fertilizer.\n\nFor an outdoor bin, you can use a plastic container (though I don't personally recommend them), or diy a wooden bin with a sealable lid. Whatever you use, make sure it has holes in the bottom to allow for drainage.\n\n<b>DIY Bokashi Starter</b>\n\n<u>Create the lactobacillus bacteria.</u>\n ½ cup rice\n 1 cup water\nMix vigorously, drain. Leave in a dark space for 5-8 days.\nThen pour into a larger jar and add 10 parts milk. Allow to ferment for two weeks, then strain.\n\n<u>Innoculate your medium.</u>\nYou can use newspaper or wheat bran from an animal feed store. \n\nUse 1 part lactobacillus, 1 part molasses, and 6 parts water. You can freeze this serum for later batches.\n\n\nSoak the medium and drain well. Put into an airtight container two weeks.\n\nAfter two weeks you can use your medium in your bokashi compost."
		},
		{
			"post_id": 16,
			"title": "Some Thoughts On Politics ",
			"date_published": 1541525732.447,
			"body": "In law a man is guilty when he violates the rights of others. In ethics he is guilty if he only thinks of doing so.\n~ Immanuel Kant\n\nFascism is capitalism in decay.\n~ Vladimir Lenin\n\nNonviolence means avoiding not only external physical violence but also internal violence of spirit. You not only refuse to shoot a man, but you refuse to hate him.\n~ Martin Luther King, Jr.\n\nFrom the deepest desires often come the deadliest hate.\n~ Socrates\n\n“All violence is the result of people tricking themselves into believing that their pain derives from other people and that consequently those people deserve to be punished.”\n~ Marshall B. Rosenberg\n\n<b>Plato’s Five Regimes:</b>\nAristocracy\nTimocracy\nOligarchy\nDemocracy\nTyranny\n\n<b>Maslow’s Hierarchy of Needs:</b>\nPhysiological\nSafety\nSocial\nEsteem\nSelf Actualization\n\n<i>There needs to be a better hierarchy of needs created in the future but for now this will be the one referenced.</i>\n\n<b>Game Theory:</b>\n\n\"If there’s a disaster, do you go over to your neighbor’s house with: a) a covered dish or b) a shotgun? It’s game theory. If you believe your neighbor is coming over with a shotgun, you’d be an idiot to pick a); if she believes the same thing about you, you can bet she’s not going to choose a) either. The way to get to a) is to do a) even if you think your neighbor will pick b). Sometimes she’ll point her gun at you and tell you to get off her land, but if she was only holding the gun because she thought you’d have one, then she’ll put on the safety and you can have a potluck.”\n~ Cory Doctorow, Walkaway\n\n<b>Tragedy of the Commons:</b>\n\"“Common land that belongs to no one. Villages had commons where anyone could bring their livestock for a day’s grazing. The tragedy part is that if the land isn’t anyone’s, then someone will come along and let their sheep eat until there’s nothing but mud. Everyone knows that that bastard is on the way, so they might as well be that bastard. Better that sheep belonging to a nice guy like you should fill their bellies than the grass going to some selfish dickhead’s sheep.”\n\n“Sounds like bullshit to me.”\n\n“Oh, it is,” Hubert, Etc said. ... It’s searing, evil, world-changing bullshit.”\"\n~ Cory Doctorow, Walkaway\n\n<hr>\n\n+ Fascism, bigotry, ableism, hate, learned -isms and phobic thought are not conductive to the individual nor society. We must strive to break down these ideological crutches.\n\n+ Inner pain, learned behavior, apathy, greed, fear, and needs not being met (Maslow’s Hierarchy) are the root of cause of cruelty and evil.\n\n+ A system that promotes financial gain at the expense of humanity and ethics is a corrupt system not meant to benefit the entirety of society and therefore cannot solve society’s problems.\n\n+ An economy based on endless growth is unsustainable. In order to give the appearance of stability in such a system, groups of people will be identified as ‘other’ and wars created cyclically. This staves off total collapse temporarily.\n\n+ Believing that a system that has caused catastrophic climate change will somehow create a way to save us from it, is suicide. …\n\n+ If we are a divided people, democracy cannot be sustained. If democracy cannot be sustained, solutions to our current climate and environmental crisis cannot be passed. Divided we all loose.  \n\n<code>This post is a work in progress and may be updated in the future.</code>"
		},
		{
			"post_id": 15,
			"title": "Desiderata by Max Ehrmann",
			"date_published": 1540064043.208,
			"body": "Go placidly amid the noise and haste,\nand remember what peace there may be in silence.\nAs far as possible without surrender\nbe on good terms with all persons.\nSpeak your truth quietly and clearly;\nand listen to others,\neven the dull and the ignorant;\nthey too have their story.\nAvoid loud and aggressive persons,\nthey are vexations to the spirit.\nIf you compare yourself with others,\nyou may become vain and bitter;\nfor always there will be greater and lesser persons than yourself.\nEnjoy your achievements as well as your plans.\nKeep interested in your own career, however humble;\nit is a real possession in the changing fortunes of time.\nExercise caution in your business affairs;\nfor the world is full of trickery.\nBut let this not blind you to what virtue there is;\nmany persons strive for high ideals;\nand everywhere life is full of heroism.\nBe yourself.\nEspecially, do not feign affection.\nNeither be cynical about love;\nfor in the face of all aridity and disenchantment\nit is as perennial as the grass.\nTake kindly the counsel of the years,\ngracefully surrendering the things of youth.\nNurture strength of spirit to shield you in sudden misfortune.\nBut do not distress yourself with dark imaginings.\nMany fears are born of fatigue and loneliness.\nBeyond a wholesome discipline,\nbe gentle with yourself.\nYou are a child of the universe,\nno less than the trees and the stars;\nyou have a right to be here.\nAnd whether or not it is clear to you,\nno doubt the universe is unfolding as it should.\nTherefore be at peace with God,\nwhatever you conceive Him to be,\nand whatever your labors and aspirations,\nin the noisy confusion of life keep peace with your soul.\nWith all its sham, drudgery, and broken dreams,\nit is still a beautiful world.\nBe cheerful.\nStrive to be happy."
		},
		{
			"post_id": 14,
			"title": "Socratic Questioning",
			"date_published": 1540057224.547,
			"body": "The Socratic method is a form of critical thinking that uses six types of questions to expose contradictions in thought or ideas allowing for objective analysis.\n\n<b>The Forms:</b>\n\n- Clarification\n- Assumption \n- Reason / Evidence\n- Perspective\n- Consequence\n- About the question\n\nWith these forms six forms one uses critical analysis to identify bias, false conclusions etc. and work towards a solid usable conclusion.\n\nThe goal of Socratic questioning is not to demean nor to put oneself upon a pedestal but to seek out the truth or best possible conclusion from the information we have. \n\n<b>Questions:</b>\n\n- Can you clarify your position?\n\n- Can you explain it in more detail?\n\n- How is this related?\n\n- Why did you say that?\n\n- What are you assuming in order to answer this?\n\n- Do you have examples of this in real life; historical or current?\n\n- What has caused you to believe this?\n\n- Do you have any evidence?\n\n- Are you operating from a place of bias or discrimination?\n\n- Who benefits or looses from the consequences?\n\n- Can you see this from another point of view?\n\n- Does this relate to previous knowledge?\n\n- How does X affect Y?\n\n- What are the implications?\n\n- What would be an alternative to this?\n\n- What are the strengths and weaknesses of this position?\n\n- What is a counter argument to this?\n\n- What does it mean?\n\n- What is the point of the inquiry?\n\n- Does this apply to every day living?\n\n- Are you being objective? \n\n The one thing that the Athenians didn't understand about Socrates when he was asking questions was that he wasn't doing it to demean them. Instead he saw them as equals in the pursuit of truth."
		},
		{
			"post_id": 13,
			"title": "Information Should Be Free. ...",
			"date_published": 1539911106.555,
			"body": "I recently came across an article from Hacker Noon titled, \"Curating a Virtuous World\" by George Li. In it he talks about <i>\"Rampant spam, attempts to game the system, fake news & inappropriate content all plague the the information economy today.\"</i> and how the only possible way forward towards an objective, less spam filled future may be 'tokenization'. Otherwise known as paying people to post objective content and when someone fails to post objectively initiating a digital court system as a form of punishment. This will solve nothing. ... I want to bring you to your attention a single key phrase that is causing the problem; information economy.\n\nIt is this key phrase that causes the entire system to fail. Information should be free. ... If you are constantly attaching a monetary value to it then there will always be spam bots and fake news  because there is a financial incentive for their very being. Instead of locking down information more in attempt to force objectivity, maybe we should instead be moving away from such systems...\n\n <b>Information should be free and adherence to objectivity should be voluntary.</b>\n\n<hr>\n<b>References:</b>\n\n<a href=\"https://hackernoon.com/curating-a-virtuous-digital-world-b89363e8ab15\">Curating a Virtuous Digital World</a> by George Li"
		},
		{
			"post_id": 12,
			"title": "Beeswax Wraps",
			"date_published": 1539801190.699,
			"body": "How To:\n- 2 tbs of beeswax granules\n- 1 square of fabric\n- 2 binder clips\n- 1 paintbrush (you're ok with destroying)\n- 1 baking sheet\n\nSprinkle the beeswax evenly over the fabric. Heat in the oven for less than five minutes. Pull out and quickly use the brush to coat places that were missed. Then pull it out with the binder clips and wave in the air a few seconds until dry. If it hardens before you pull it out, pop it back in the oven a few seconds and try again.\n\nWhen you're done, take a knife and scrape the hardened wax out of the bottom of the baking sheet and save for later. \n\nTo clean the baking sheet:\n- Scrape it clean\n- Wash with hot water, soap, & steel wool. "
		},
		{
			"post_id": 11,
			"title": "Rules For Thinking, Analysis, & Writing",
			"date_published": 1539465875.183,
			"body": "“We live in a world where unfortunately the distinction between true and false appears to become increasingly blurred by manipulation of facts, by exploitation of uncritical minds, and by the pollution of the language.”\n― Arne Tiselius\n\n“We are approaching a new age of synthesis. Knowledge cannot be merely a degree or a skill… it demands a broader vision, capabilities in critical thinking and logical deduction without which we cannot have constructive progress.” ~ Li Ka-shing\n\n“When we blindly adopt a religion, a political system, a literary dogma, we become automatons.”\n\n― Anaïs Nin, The Diary of Anaïs Nin, Vol. 4: 1944-1947\n<br>\n<hr>\n+ In a world filled with untruth, alternative facts, and misinformation. Think twice before sending any communications. Double check and verify the contents.\n\n+ The internet promotes half-truths do not contribute to them by rushing through a tweet or post.\n\n+ If you are unsure about something. Conduct research before answering.\n\n+ Make sure all of your writing and work are free from bias or fallacies.\n\n+ Be objective in your writing and do not allow transient personal feelings to influence your work.\n\n+ Edit all writing for simplicity and clarity. Increase vocabulary for technical subjects as needed.\n\n+ Memorize and learn to recognize various fallacies, group think, and bias.\n\n+ Make sure all writing is devoid of unconsciously learned discrimination.\n\n+ Never accept anything as an established fact or truth. Question everything. Seek out the answers.\n\n+ Do not promote a certain ideological stance in your writing. However, you are free to give your personal opinions as long as they are clearly labeled as such.\n\n+ Use literary analysis & critical thinking when reading and / or writing. Make sure you know your topic well before discussing it.\n\n+ Learn how to ask questions accurately. \n\n+ Do not use your writing to promote: fight me culture, demands, arguments, character assassination, cyber bullying, or discrimination of any kind.\n\n+ Tokenization or any enforcement of objectivity cannot be condoned. Information is free. Objectivity is voluntary.\n\n<code>This post is a work in progress and may be updated in the future. </code>\n\n<b>Part Two: <a href=\"http://127.0.0.1:43110/1MhRrHfS7d7AimbrPhsNFP7PLJtGTzqjRr/?Post:13:Information+Should+Be+Free.+...\">Information Should Be Free...</a></b>\n<b> Part Three: <a href=\"http://127.0.0.1:43110/1MhRrHfS7d7AimbrPhsNFP7PLJtGTzqjRr/?Post:14:Socratic+Questioning\">Socratic Questioning</a></b>"
		},
		{
			"post_id": 10,
			"title": "Tutmonda Varmiĝo",
			"date_published": 1539309671.577,
			"body": "Ĝi estas la jaro dudek deknaŭ aŭ du mil dek naŭ, Oktobro de la dekunua kaj ni estas alfrontante grandega minaco al homaro. Mi parolante pri tutmonda varmiĝo kaj ni havas tro mallonga tempo fari ion pri ĝin. Kio estas vi fari al preservi la planedo? Kio povas vi fari? Ni bezonas verajn solvojn kaj ni bezonis ilin hieraŭ. Tamen nun, estas kio ni havas, kaj ni bezonos ĉiun momenton al ripari nian mondon.\n\nLa planedo estas varmiĝo rapide kun du gradoj celsiuso pli kalkulis de dudek kvardek. Ni devas labori kune se ni volas konservi nian mondon vivas kaj sana en la estontenco. Nun ne estas la tempo por malespero. Ĝi estas la tempo por tuta ĉiuj homoj havi esperon kaj kunveni al ripari nian mondon. Ni povas fari pli kune ol aparte.\n\nDankon por legante... Mi Esperanto ne estas la plej bona sed mi esperas, ke la mesaĝo estas klara.\n"
		},
		{
			"post_id": 9,
			"title": " Anaïs Nin, The Diary of Anaïs Nin, Vol. 4: 1944-1947 ",
			"date_published": 1539214899.019,
			"body": "“When we blindly adopt a religion, a political system, a literary dogma, we become automatons.”\n"
		},
		{
			"post_id": 8,
			"title": " Adrienne Rich",
			"date_published": 1539214777.943,
			"body": "“Responsibility to yourself means refusing to let others do your thinking, talking, and naming for you; it means learning to respect and use your own brains and instincts; hence, grappling with hard work.”\n "
		},
		{
			"post_id": 6,
			"title": "Elif Shafak",
			"date_published": 1539196942.496,
			"body": "\"The novel matters because, like an alchemist, it turns empathy into resistance. It brings the periphery to the centre, it gives a voice to the voiceless, it makes the invisible visible. And it also distils the deluge of information into drops of wisdom...\"\n\n\n"
		},
		{
			"post_id": 5,
			"title": "Polymathic Thought, Monopathy, Automathy & Neuroplasticity in Learning",
			"date_published": 1539191350.558,
			"body": "\n<b>\"I have been impressed with the urgency of doing. Knowing is not enough; we must apply. Being willing is not enough; we must do.\"</b> \n~ Leonardo da Vinci \n\nToday I was reading, \"Master of many trades\" by Robert Twigger, on the differences between our monopathic society and polymathic thought. Mainly I was wanting to know how I could upgrade my current autodidactism to become a polymath. Here's what I found out. ...\n\nA monopath is a person who has become one-tracked in thought and deed. For example, a business person who's sole goal in life is to constantly become a better business person. This is what society is currently built around and considered the idealized choice for anyone who wants to make it in society.\n\nAn autodidact or automath, however, promotes independent study in various subjects in a formal or informal environment. Whereas, a polymath goes one step further and attempts to master several fields of interest. \n\nDuring the Renaissance, where the term 'Renaissance man' originated, polymathy was the idea that human beings could master anything we put our minds to and indeed during this time many polymaths existed from Leonardo da Vinci to Goethe. \n\nBut what is it that allows polymath's to rapidly learn new things and how do we apply that to our daily lives?\n\n- They do not get caught in the traps of monopathy or over-specialization. By mastering more than one subject or field they keep making new mental connections which allows them to remain curious and retain their neuroplasticity.\n\n- By recording and tracking their progress daily they break large tasks into manageable chunks and keep a consistent learning and productivity schedule. \n\n- By learning how to learn efficiently or complete projects in the most efficient way possible. They cut out learning traps and make rapid associations between seemingly unrelated things. Allowing for better retention over time.\n\n- Never stop learning. Take what you know and use it in some way. Develop projects, speak or write in the language you are learning, teach it to others. Whatever you do, do not stop using what you learn.\n\nIn summary, polymathy is all about recognizing the patterns that make up a specific topic or subject, cutting out the b.s. that makes it difficult to learn, charting the best way forward, keeping it consistent, staying curious, and using what you know.  Or as the old saying goes, \"use it or loose it.\" Because once we stop learning new things, we loose our neuroplasticity and once we loose that? Well, we could loose our ability to learn new things all together. ..."
		},
		{
			"post_id": 2,
			"title": "Time",
			"date_published": 1538840006.491,
			"body": "I've been thinking a lot about time this week. Mainly how it can be used or manipulated into making us more productive. We currently live in a world ruled by ridiculous things like leap years and and have little sayings to help us to remember to move the clock forward or backward during specific seasons, and then there's the time zones... \n\nHow is this helpful? Just because it's the way we've done it for decades, doesn't mean it's the best way. Human beings have been experimenting with time since it's beginning as a concept. During the French Revolution, there was even an experiment that lasted twelve years, where the entire French government (including countries under French rule) adopted the decimalization of time, currency, and metrication. They created a new calendar that started at Year 1 (1792) of the \"Republican Era\", created weeks that were ten days long and added \"complimentary\" days to the end of the calendar to keep it in close approximation with the solar calendar. \n\nWe even have phrases to describe the passage of time depending on where we live such as \"island time\" or Kairos vs Chronos time. *Kairos* meaning the space between time. While *Chronos* is the sequential time we all use daily. So why can't we change it now to eliminate the inconsistencies that cause us such headaches? \n\nThe two main questions we need to answer in order to choose between the plethora of different time measurements available is: Does it eliminate time zones? and Is it more efficient than the current system? \n\nWhile I don't which system is best, it's not going to stop me from experimenting with them. Currently I'm interested specifically in Decimal time, Neralie, and the Desamber calendar by <a href=\"https://wiki.xxiivv.com/#time\">Devine Lu Linvega</a>. I'll be experimenting with these for a while to get a good handle on how they relate to our current system. But if you're interested here's a breakdown on how they work.\n\n**Decimal Time:** Divides the day into fractions of time and is mainly used by astronomers and programmers.\n\n**Munich Decimal Time:** Divides the day into 10 hrs, of 100 minutes, of 100 seconds. MDT does not respect daylight savings time.\n\n**Neralie:** Divides the day into beats and pulses. Every beat is the equivalent of 1,000 pulses.\n\n**Desamber:** Divides the year into 26 months of 14 days each. \n\n**Other Measurements of Time:**\nFrench Republican Calendar\nExcel\nTLE Epoch\nJulian Date\nMars Sol\nSwatch\nSTO Stardate\nKelvin Stardate\nLilian\nRata Die\nANSI\nDecimal Years\nBesselian\nand more. ...\n\n\n\n"
		},
		{
			"post_id": 1,
			"title": "// Reading Recommendations",
			"date_published": null,
			"body": "\n**The Machine Stops** by E.M. Forster\n\n**Fahrenheit 451** by Ray Bradbury\n\n**Walden** by Henry David Thoreau\n\n**The Journals of Henry David Thoreau**\n\n**Animal Farm** by George Orwell\n\n**The Lottery** by Shirley Jackson\n\n**Letters from a Stoic** by Seneca\n\n**Civil Disobedience** by Henry David Thoreau\n\n**Adolfo Kaminsky: A Forger's Life** by Sarah Kaminsky\n\n**An Indigenous Peoples' History of the United States** by Roxanne Dunbar-Ortiz\n\n**A Guide to the Good Life: The Ancient Art of Stoic Joy** by William B. Irvine\n\n**She Unnames Them** by Ursula K. Le Guin\n\n***To Be Continued***\n"
		}
	],
	"tag": [
		{
			"value": "#reads",
			"post_id": 1
		},
		{
			"value": "#decimal",
			"post_id": 2
		},
		{
			"value": "#desamber",
			"post_id": 2
		},
		{
			"value": "#neralie",
			"post_id": 2
		},
		{
			"value": "#kairos",
			"post_id": 2
		},
		{
			"value": "#keiros",
			"post_id": 2
		},
		{
			"value": "#chronos",
			"post_id": 2
		},
		{
			"value": "#french",
			"post_id": 2
		},
		{
			"value": "republican",
			"post_id": 2
		},
		{
			"value": "time",
			"post_id": 2
		},
		{
			"value": "#polymath",
			"post_id": 5
		},
		{
			"value": "#polymathy",
			"post_id": 5
		},
		{
			"value": "#monopath",
			"post_id": 5
		},
		{
			"value": "#automath",
			"post_id": 5
		},
		{
			"value": "#autodidact",
			"post_id": 5
		},
		{
			"value": "#neuroplasticty",
			"post_id": 5
		},
		{
			"value": "#learning",
			"post_id": 5
		},
		{
			"value": "#quote",
			"post_id": 8
		},
		{
			"value": "#philosophy",
			"post_id": 8
		},
		{
			"value": "#quote",
			"post_id": 6
		},
		{
			"value": "#philosophy",
			"post_id": 6
		},
		{
			"value": "#quote",
			"post_id": 9
		},
		{
			"value": "#philosophy",
			"post_id": 9
		},
		{
			"value": "#eo",
			"post_id": 10
		},
		{
			"value": "#esperanto",
			"post_id": 10
		},
		{
			"value": "#tutmonda",
			"post_id": 10
		},
		{
			"value": "varmiĝo",
			"post_id": 10
		},
		{
			"value": "#global",
			"post_id": 10
		},
		{
			"value": "warming",
			"post_id": 10
		},
		{
			"value": "#thought",
			"post_id": 11
		},
		{
			"value": "#analysis",
			"post_id": 11
		},
		{
			"value": "#writing",
			"post_id": 11
		},
		{
			"value": "#quote",
			"post_id": 11
		},
		{
			"value": "#diy",
			"post_id": 12
		},
		{
			"value": "#tutorial",
			"post_id": 12
		},
		{
			"value": "#objectivity",
			"post_id": 13
		},
		{
			"value": "#writing",
			"post_id": 13
		},
		{
			"value": "#digital",
			"post_id": 13
		},
		{
			"value": "#tokenization",
			"post_id": 13
		},
		{
			"value": "#thought",
			"post_id": 13
		},
		{
			"value": "#critical",
			"post_id": 14
		},
		{
			"value": "#socratic",
			"post_id": 14
		},
		{
			"value": "#thought",
			"post_id": 14
		},
		{
			"value": "thinking",
			"post_id": 14
		},
		{
			"value": "#desiderata",
			"post_id": 15
		},
		{
			"value": "#max",
			"post_id": 15
		},
		{
			"value": "ehrmann",
			"post_id": 15
		},
		{
			"value": "#poem",
			"post_id": 15
		},
		{
			"value": "#thought",
			"post_id": 16
		},
		{
			"value": "#politics",
			"post_id": 16
		},
		{
			"value": "#climate",
			"post_id": 16
		},
		{
			"value": "change",
			"post_id": 16
		},
		{
			"value": "#DIY",
			"post_id": 17
		},
		{
			"value": "#bokashi",
			"post_id": 17
		},
		{
			"value": "#compost",
			"post_id": 17
		}
	]
}