{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1626930815_1BpmfrtYDwDy6ERRr8jLb5mavzRuTrVcKv": 1
	},
	"next_comment_id": 5,
	"comment": {
		"1627203485_1KVNaiA8DqgiokCbdUo3HtBKbKc2DmrELJ": [
			{
				"comment_id": 1,
				"body": "Have you wondered why you must message over Zeronet? Why you must use a VPN? They don't want you knowing the truth about what they do. Your government hates you, and if it benefited the Chinese Communist Party they would kill you. They want to make a monster out of anyone who disagrees with the regime. If you don't believe me, enable your VPN and view: https://zh.wikipedia.org/wiki/%E5%85%AD%E5%9B%9B%E6%B8%85%E5%9C%BA",
				"added": 1627221481
			}
		],
		"1616488512_1DpTk4WVehKnzz9bhzRJ1ihCXJhmm3gE31": [
			{
				"comment_id": 2,
				"body": "Personally as an outsider looking in I view Israel as an illegitimate state with land they did not acquire themselves. Israel being created would be like if the United Nations decided they should reinstate Akkad because Mesopotamians were involved in a genocide. Whatever your opinion on Jews I personally find the idea of Israel very unsavory. Israel was taken from the Jews fair and square. It was not theirs anymore.",
				"added": 1627300444
			}
		],
		"1626930815_1BpmfrtYDwDy6ERRr8jLb5mavzRuTrVcKv": [
			{
				"comment_id": 3,
				"body": "i built this lug myself. not portable but mega-powerful. running windows 10, considering getting along with linux. probably arch or something.\n\n> [moriposting](#comment_5_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf): thinkpad t510. i do not need a battery or ac power because it runs off my pure unadulterated autism [...]\nimagine not using parabola gnu linux on your librebooted thinkpad t400s",
				"added": 1627300605
			}
		],
		"1620620160_1FmrBebnM1t99pE6rz9amgdgFSfKagU9Nr": [
			{
				"comment_id": 4,
				"body": "> [atheistamerican](#comment_6_1KkWzuu4z7bv6XpAbp5xSbyJFdYqkDryRH): That's illegal. Stop being a dumb ass and just take it.\n\n> american\n> illegal\ni must have alzheimers cause i must have alzheimers cause i must have alzheimers cause i must have alzheimers cause i must have alzheimers cause i dont remember losing my fucking rights retard",
				"added": 1627665288
			}
		]
	},
	"comment_vote": {
		"1_1B4ktEg3pXXwnTrX7NfkL8AUdhy2puKes2": 1,
		"5_1Gbk3oHccXf2vz6KDh8DPyZya3Kh3m2pHf": 1,
		"9_1BWgyS5ThxyuzEWWj2dats3sgQBppYkXne": 1
	}
}