{
	"next_topic_id": 9,
	"topic": [
		{
			"topic_id": 1606253317,
			"title": "What search engine to use?",
			"body": "DuckDuckGo: based in the US, hosted on amazon servers, reports of some censorhsip arised\nStartpage: owned by ad company\nQwant: bad privacy policy\nEcosia: bad privacy again\nsearx: cool, but not suitable for mission critical work - constant captcha failures and every instance I tried and contrary to what ppl say, results are less accurate than even DDG.\n\nso what options do we have?",
			"added": 1606253315
		},
		{
			"topic_id": 1606253768,
			"title": "What does it take for people to finally care about their privacy?",
			"body": "Even Google doesn't refrain from shoving a privacy policy popup in your face on Youtube and search engine, it already says that your data is collected and yet nobody cares.\n\nEveryone I know still uses Windows 10 which is in every aspect worse than linux , and no, not only because of lack of privacy.\n\nsmart tv malware, intel/amd CPU malware (how is it even possible that there is only one proprietary instruction set controlled by a US corporation available for consumer purchase in the whole fucking world??\n\nWhy do ppl install Tiktok? Like, wtf? It is a chinese malware, I wouldn't touch that with a 10 meter pole. \nWhy use messenger? what kind of outrage of selling your data would be enough for ppl to stop using it?\n\nI think the problem is lack of immediate observable consequences. If you touch a lit candle, you immediately feel pain and try your best to stop touching it. If someone looks over your shoulder on your piece of paper or monitor, ppl would be outraged because of \"privacy\" , but when something much worse is happening in your digital area, nobody cares because you can't see it. People are very uneducated about IT and that's a big problem too.\n\nAt this point, I kinda sometimes wish corpos like google and facebook start weaponizing the sheep's data in a way that is uncomfortable and finally detrimental to their everyday routine, that's the only way for ppl to finally care. The fact they do it so sneakily is working very well for them still.",
			"added": 1606253765
		},
		{
			"topic_id": 1606503160,
			"title": "Why not suicide?",
			"body": "Life is more suffering than pleasure. Life will inevitably end in death. Everything is so corrupted. So, what keeps me going? Dunno, probably animal instinct that keeps me from harming myself. What about you?",
			"added": 1606503155
		},
		{
			"topic_id": 1608830447,
			"title": "What's the point of erotic underwear?",
			"body": "Serious question. If you take it off anyway, why bother?\nBefore you ask, yes I'm a virgin living in my mum's basement.",
			"added": 1608830440
		},
		{
			"topic_id": 1608830774,
			"title": "USA should nuke China while they still stand a chance",
			"body": "Think about it, USA is a waning superpower while China is a rising one. While USA has some democracy, China is a full-blown police state with slave workers and extreme disregard for climate pollution which will probably kill all of us in some decades or even sooner than that.\n\nUSA should destroy them while they still have the chance, to protect their own freedom and delay an authoritarian makeover of the whole world.",
			"added": 1608830766
		}
	],
	"topic_vote": {
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"1608588854_1MUqNCPTZnz9R3c39yWSQesf3gwbCuAoPT": 1
	},
	"next_comment_id": 39,
	"comment": {
		"1606080511_134skDNbvpgm7WpAjiJzbc6dQEfBaDaezV": [
			{
				"comment_id": 1,
				"body": "Maybe that's because we have so little freedom of speech and so much political correctness that you have to go to such lenghts to find place like Zeronet where you can freely vent your anger, which by this point is so large of it that many people here may come off as psychopatic.",
				"added": 1606252825
			}
		],
		"1606099517_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA": [
			{
				"comment_id": 2,
				"body": "would such Reset be a bad thing? For example, every fucking country in the world is indebted for trillions of dollars to others, and somehow everyone keeps loaning money that everyone knows will never be paid off. This is nonsensical at this point, let's just restart with a blank slate.\n\nBut nuke China first, if they replace the US as world's largest superpower then we're more than screwed.",
				"added": 1606252969
			},
			{
				"comment_id": 6,
				"body": "> [dv1](#comment_31_1GvDe5pkKGgM4ZXSge4CwhekmWCjpVsDMA): Lot's of thoughts going on here, from computer software to survival skills in the woods and also China. [...]\n\nIf only any of my family and friends cared instead of watching TV, supporting pedophile church and using google chrome for everyday tasks. hard for me to care about them, actually",
				"added": 1606328184
			}
		],
		"1606253768_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 3,
				"body": "> [mg0](#comment_386_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa): \"People are very uneducated about IT and that's a big problem too.\" [...]\n\nYeah I hear you, I take similar measures and still constantly worry it's not enough...",
				"added": 1606255552
			},
			{
				"comment_id": 4,
				"body": "> [mxh69420](#comment_19_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): theres some people who actually dont care, and im fine with them. even though it hurts those that do care, its their choice. but most people really dont know at all and would care. that leaves the few who wanna get away from google but cant leave behind their favorite youtubers, or youtubers who wanna get away from google but cant leave behind their fanbase. [...]\n\nI keep basically everything except email account offline, and depend on my encrypted PC for everything I care about. Most people don't actually need that access-it-anywhere bullshit, they were conditioned into thinking they do.\n\nThink about how we lived before smartphones and cloud existed. Was it rly that bad and unlivable back then?",
				"added": 1606327689
			}
		],
		"1606253317_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 8,
				"body": "> [tttaevas](#comment_6_18sLokZGvmEqsoVbj8LJkM8NkwJxfUJX3G): Should you really care about a search engine's privacy policy if you use something like Tor?It really just depends if you value your privacy more than your time spent to find a good result, and for me, DDG's enough\n\ni was sometimes wondering this, if I use tor, why not use google? probable reasons:\n- we should support ethical alternatives\n- google may actively discourage you with captchas,. throttling, popups etc.\n- if a bug or fingerprinting flaw is found in Tor, you have lower chance of having your data deanonymized if it's not stored in the first place. Merely using Tor is not enough, you have to be careful with behavioral analysis, for example the style of your writing, timing correlation etc. Sure, you can't verify if anyone does what they say (not collect and store data). But still, better choose the option that is likely better, and not the one which we are 100% sure is bad.",
				"added": 1606503421
			},
			{
				"comment_id": 11,
				"body": "> [bigbadbob](#comment_1205_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): Any thing that is not google is probably ok IMO.   If we always use the underdog there should always be some competition and hopefully avoid monopolies.  Hopefully it's not too late.\n\nno, not everything. Bing, Yahoo, Yandex are examples of  malengines.",
				"added": 1606581142
			}
		],
		"1606040168_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 9,
				"body": "> [sword000000](#comment_11_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Anyone that cared about their freedoms shouldn't be stupid enough to buy an Apple product\n\nThis. I am very against recommending ios as a more private alternative to Android. It's pointless, it's closed source, it's still malware. And apple dont care about privacy.",
				"added": 1606503999
			},
			{
				"comment_id": 10,
				"body": "> [tvpede](#comment_10_14JRtW3jByzZEQeEkG9QMXNi2jTKudcotJ): It is really simple. Just google it. First search result worked ok for me:https://www.techrepublic.com/article/how-to-run-an-ssh-connection-through-tor/\n\nFuck, dont say \"google\", google is malware, just say \"search\"",
				"added": 1606581046
			}
		],
		"1606503160_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": [
			{
				"comment_id": 12,
				"body": "> [pictorsomni](#comment_2_1KnGxS2ij8nfG2qxbrQ6Xz91nBU7XGCYri): You matter in this world, whether you can perceive it or not.If you don't, you should do things that makes you happy as often as you can.Even if it means saying 'no' to others.\n\nwhat if I have severe social anxiety, my job drains the fuck out of me, and my chances of finding a better one are next to zero...",
				"added": 1606581279
			},
			{
				"comment_id": 13,
				"body": "> [sword000000](#comment_18_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): If you're going to kill yourself, then doing it in a densely populated city with a big bang is definitely one way to do it... ðŸ‘\n\ngive me an atom bomb, i will gladly travel to my country's capital city and erase it from its pitiful existence",
				"added": 1606749200
			},
			{
				"comment_id": 14,
				"body": "> [mxh69420](#comment_25_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx): i have stuff to live for. not really pleasure. its just a task god has given me to do through my life on earth.\n\ni dont believe in god, and if you believe you should long for death anyway, because of afterlife paradise.",
				"added": 1607016018
			},
			{
				"comment_id": 15,
				"body": "> [bigbadbob](#comment_1214_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj): I met a guy who was missing a good portion of his face and his hand from an attempt or possibly two.  Also met a guy who drank brake cleaner and lived.  Can't imagine,  Their lives went from seemingly bad to far worst.\n\nI hate this fucking world ethics, it's OK to kill a dog if it suffers but if a human suffers like this, everyone forces them to live",
				"added": 1607016091
			},
			{
				"comment_id": 17,
				"body": "> [calmdownholden](#comment_1_17acbn9sNyYyLJrLfSz3KJxqonKZtgVxCD): Cuz pizza.Cuz tacos.Cuz Indian food.Cuz Chinese food.Cuz snack food.Cuz orgasms.Cuz hot baths.Cuz interesting media.Cuz swimming.Cuz cultural revolutions.Cuz technological revolutions.Cuz justice revolutions.Cuz economic revolutions.Cuz of the Ashoka Principle.Cuz smells.Cuz sights.Cuz warmth.Cuz Oceans.Cuz Jungles and Forests.Cuz Deserts.Cuz reasons.\n\npizza - unhealthy and full of fat\ntacos - same\nindian food - india is a hellhole, dont support their govs by buying food\nchinese food - china is a hellhole, dont support their govs by buying food\nsnack food - unhealthy toxic garbage, dont support corrupted govs and greedy corpos by buying snacks\norgasms - ok, but seem too short to be worth living for, and too difficult to find a gf and avoid pregnancy - in my hell country, good luck having affordable contraception, to say nothing of abortion\nhot baths - i dont have a bath, only shower spot\nmedia - mostly corrupted propaganda\nswimming - in coruna pandemic, no swimming is open\nrevolutions - in a normal healthy world, no revolutions would be needed\ntech revol - oh yeah, great! google, facebook, spyware, mics, surveillance cameras, toxic fumes cars, millions of annual victims of car accidents, and soon bill gates-sanctioned nanochips for remote human control. fuck tech.\njustice - see revolutions\neconomic - horrible inequality, 1% of humans own half the world's money, as sick as can be, and revolutions, well...\nashoka - wut? dont know about it , dont care\nsmells - most often toxic fumes and smelly shit in the toilet, then any actually good smells\nsights - yeah, grey-and-gray dystopian towns with occasional shades of grayish greyment are surely nice to look at, every fucking day on the way to slave work\nwarmth - global warming makes warmth questionable advantage, and now in my place is winter so also no warmth for me.\noceans - dont care, never seen one\njungles - same\nforests - mostly the same, hard to find time and place to go to one, and it's still shit because of ticks, dangerous animals, and rubbish even in forests\ndeserts - wut? fiery hellholes in which almost no animal can survive?\nreasons - not really, as described.",
				"added": 1607016759
			},
			{
				"comment_id": 19,
				"body": "> [styromaniac](#comment_2745_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): If a dog is full of tumors, it gets put down. That's different from depression. [...]\n\nassisted suicide is illegal in my country due to religious retardation. i am an atheist. why should i tolerate that it is illegal in that case?",
				"added": 1607018611
			},
			{
				"comment_id": 38,
				"body": "> [edgelordofdecent](#comment_723_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5): Someone mirrored a website here that has a bunch of methods. I don't remember the link and the people who were intrigued by it aren't around anymore for obvious reasons.\n\nIt was a mirror of this one: https://www.lostallhope.com/\nbut unfortunately I can't find zeronet link",
				"added": 1609593193
			}
		],
		"1606980382_15ikhUiQxJkhNQuDUaR1RuUL45p5wq6Wtz": [
			{
				"comment_id": 16,
				"body": "> [sword000000](#comment_25_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Which operating system?\n\nwhat kind of question is that? Mac and Windows are proprietary malware, so only Linux is worth spending effort and time developing for. Also BSD, but maybe zeronet dont support it yet",
				"added": 1607016159
			},
			{
				"comment_id": 18,
				"body": "> [sword000000](#comment_26_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): I agree, and I run Linux myself, but a lot of people use malware with Zeronet on their computer. Haha\n\nI'm glad some peopel also see this. I think we should stop tolerating normies using privacy services on malware systems, including stock Android and iOs. It is an effort that MUST be made, otherwise your OS compromises everything upstream.\n\nI don't even support Linuxes like Ubuntu, Fedora, Arch - they contains random binary blobs, so they are not free, period.\n\nThe much bigger problem is malware x86 hardware, but freeing that is really hard, and no one affords Talos II",
				"added": 1607017578
			},
			{
				"comment_id": 28,
				"body": "> [sqmnf3ixy2lgfpz7](#comment_2_19ZkyYnsyNaf8RoMf7ZCJWTD6zEqHnTKjq): I'm tired of virtue signalling. It utterly demolishes the value of any critique. First thing which pops into the reader's mind? Buzz off! [...]\n\ni dont understand what u say or mean",
				"added": 1607284276
			},
			{
				"comment_id": 29,
				"body": "> [xcape2net](#comment_812_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): Why haven't we seen a stable release of the ZeroNet bundle in 14 months?\n\nmaybe cuz nofish is just one man wriitng this in his free time for free, if you wanna new features, contribute some code or donate",
				"added": 1607284431
			},
			{
				"comment_id": 31,
				"body": "> [xcape2net](#comment_818_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): I can't think of any new features I want.  But, I'm sure there are still bugs.  That is what updates should be about in my not-so-humble opinion.\n\nok, that makes sense. There should be a different terminology for feature upgrade and security updates, and i think there already is (update/upgrade vs patch/bug fix) but little ppl use them properly",
				"added": 1607373320
			}
		],
		"1607182920_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 20,
				"body": "with weaklings like clown trump and old git like biden, it's bound to happen",
				"added": 1607192090
			}
		],
		"1607188641_12sCaEUFqE6g3JrDqmEA8pn9yrgxwkZQMe": [
			{
				"comment_id": 21,
				"body": "umm... anti-google video on youtube? at least make a reupload on something like peertube or bitchute",
				"added": 1607192244
			}
		],
		"1607087579_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 22,
				"body": "there is no pandemic, it is a weak flu-like virus, and criteria for pandemic were never even met. it's the elderly who mostly die, and that's not even due to virus but general weakness and other illnesses they already have on top of that.\n\ngovernments all over the world are taking advantage of the situation to further restrict our freedoms, which will NOT return in their full form once the \"pandemic\" is \"over\". Liberties once taken must be fought back for.",
				"added": 1607192479
			},
			{
				"comment_id": 23,
				"body": "> [sword000000](#comment_27_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie): Great video! The channel below (VidarReturns) makes philosophical videos on how future generations can escape such Tyranny. Definitely worth following if you have, or plan to have childrenhttps://odysee.com/@vidarreturns\n\nit's sadistic to plan for and have children in such a horrible world we live in, and there is nothing indicating it will get better anytime soon.",
				"added": 1607192575
			}
		],
		"1568753767_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 24,
				"body": "> [nxm9c2wjbjlhjsrc](#comment_4_19mYz8QAzpKevxXrku9vV6WoQN7cPdE6Vt): So far the only thing I've found on ZeroNet that seems to be worthwhile is this forum. If there is more to see, that's similar or just as good, let me know. Seems like most the blogs haven't been updated in 2018. But this place seems active enough for me to do a quick run of ./ZeroNet.sh in the terminal just to check for an update.\n\nyes, sadly I also come here only for ZeroTalk. Play is also sorta useful but you can just search torrents manually.",
				"added": 1607192716
			}
		],
		"1607283206_1GmSP4jfJEvcrTYaDmsfocWCXETGPghSDH": [
			{
				"comment_id": 25,
				"body": "of course they have a cure for their own manufactured controlled epidemic virus since its start, but they dont care about their slave citizens so they wont give it to them soon probably",
				"added": 1607283935
			},
			{
				"comment_id": 30,
				"body": "> [vaccinationation](#comment_2_1GmSP4jfJEvcrTYaDmsfocWCXETGPghSDH): Likely, but I would like some information from those residing in China themselves. [...]\nprobably best to ask them yourself, however chinese dont egnerally speak good english from what I know",
				"added": 1607373201
			}
		],
		"1607271673_1Nz5xXKiiTFGd6big5zcBnaGVH3hUUYv4G": [
			{
				"comment_id": 26,
				"body": "bitcoin is shit, use monero",
				"added": 1607283966
			}
		],
		"1607222817_14H5KfL4SR2RkpxjdQAvqzKBTaA1q4dKf3": [
			{
				"comment_id": 27,
				"body": "the pro-vaccine billy gates with his ID2020 program is obviously gonna do this, if not now then during the next artificial pandemic he releases",
				"added": 1607284106
			},
			{
				"comment_id": 32,
				"body": "> [lethotter](#comment_4_12TkoeBiJMGSPoetH8DhErZExjPvVE4x8B): My point is the vaccine is most probably fake in some regard. For example, it could be a way to attract a lot of money and produce some salt water with no real effect. But believing in nanodust and mind control? Are you for real? This tech doesn't exist yet and even if it did it sounds just crazy to be true. As believable as a Nazi moonbase or some other batshit crazy conspiracy theory.\n\ntech like this is closer then you might think, we will quite soon be able to do google searches with our minds with nanochips on our brain (see: https://duckduckgo.com/?q=elon+musk+chip+cure&t=h_&ia=web)",
				"added": 1607373482
			},
			{
				"comment_id": 33,
				"body": "> [driud](#comment_180_18yZKKFySP5bvmNy14T9vgj3H99AC1PQkH): The nano chip is mounted in the spine between the vertebrae. Why? In order not to be able to remove it.You need a special operating room and a high-class specialist.Dismantling is very risky / paralysis /.\n\nthen i'd rather rip my spine off and die than live like that.",
				"added": 1607453814
			}
		],
		"1607947918_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 34,
				"body": "unfortunatly they fixed it",
				"added": 1607979527
			}
		],
		"1608712796_1AkCd6161a4erMEbe4998aX7Hnpd2iuEMu": [
			{
				"comment_id": 35,
				"body": "fuck you fucking cunt, hope you die or coruna-virus you wanna scam people for some ads",
				"added": 1608830167
			}
		],
		"1608693974_1PwdA37XmcR2pMjL4SfCbmwLnt29zvp4BE": [
			{
				"comment_id": 36,
				"body": "> [styromaniac](#comment_2823_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): The idea of anthropomorphic climate change is promoted by the Rothschilds, so I don't believe it either. [...]\n\nhowever there should probably be littler people in the world. niggers breed dozens of kids without question and make them suffer under regimes and hunger, while even in white world we live on top of each other in building blocks like some ants in a slave quarters. i wanna have my own hut, work for myself and not some fucking corporate billionaire, and dont rely on corrupted govs for most things",
				"added": 1608830371
			}
		],
		"1608604929_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 37,
				"body": "> [deuxzaron](#comment_2_1M1U9ZvF9XJmt4oPY4TLBWHJZWDdRpXFFy): On Stadia it's not bad. It's not great either. Considering it was delayed to iron out the glitches there shouldn't be glitches. I've seen Jackie walk through lockers and ride his bike straight into a pole. Hopefully like No Man's Sky they get shit fixed\n\nStadia is a cancer that has its own cancer on top of it though. When we thought lack of ownership can't go any worse that buying a rented game tied to your Steam account that they can remove without having to explain anything, Stadia went even further in that you don't even have a downloaded copy on your device, you only see single stillshots sent over the internet.",
				"added": 1608830978
			}
		]
	},
	"comment_vote": {
		"1_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"19_1HK2gCWJmrTvacZbHqEC27oVygDjUohzdx": 1,
		"49_1QvU5RXqw5mjgR3BZV5rkc2ju6NHXpGnp": 1,
		"11_114FPBgGTFgsfrHMvQYkJ3aAR8zSmbyjie": 1,
		"1_13mmdCzrmjQfAnqg2MEpbzaVGuqjDzjq8s": 1,
		"17_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1,
		"3_1KTDVd4rtqErz3FcxPx2nTmr4CSR9Q7hcr": 1,
		"37_1H9ZCecP2nbVicgXB77yqodz2xp4CmKxm4": 1
	}
}