{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": 1,
		"1_1J4j9zrg5qitbELP3tpkRiReyDaWQLkG2P": 1
	},
	"next_comment_id": 18,
	"comment": {
		"3_1BLPKyrF2D4ertte6JnAa6oWAMYzZGwKQz": [],
		"1_1GnAPT8ioRWpyqDkKrjLp1woEG3TBQgt87": [
			{
				"comment_id": 5,
				"body": "je suis \"up4\" mais j'ai excédé la limite de contenu sur ce site…\n\n> [weedcoder](#comment_13_151xfrGz3zugtqCT51AStxjJNTHa6harBb): j'ai trahi mes principes?\n\nJe n'ai pas dit que tu as, je t'ai dit que tu _vas_.\n\n(Sous toute réserve statistique.)\n\n> je déteste ce système, autant que toi apparemment ;)\n\nJe ne n'y désobéis pas parce que je le \"déteste\", mais parce que de peine et de misère, je me suis rendu capable d'y désobéir.\n\nEt de par notre désaccord apparent face à la désobéissance sexuelle, j'y désobéis _mieux_ que toi.\n\n> Je renonce pas à mes principes, je vais mettre les mains dans la merde pour déboucher les toilettes.\n\nTu renonces à une hygiène élémentaire en donnant au système un pouvoir direct sur ta vie par cette relation d'emploi.\n\n> Je m’entraîne déjà à faire passer la pilule.\n\nLe système fiscal d'état-nation s'accommode très bien de la pilule qui est déjà _passée_ il y a un bon moment en se transformant en \"communauté internationale\" de surveillance fiscale dans lequel le bitcoin et ses dérivés ne sont que des instruments financiers 100% interopérables avec les marchés et produits existants, même les plus toxiques.\n\nAu mieux tu n'auras aucun impact. \n\nAu pire, tu vas les rendre plus efficaces à jouer dans ce nouvel environnement, selon les nouvelles règles.",
				"added": 1464782658
			}
		],
		"12_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w": [
			{
				"comment_id": 4,
				"body": "je suis d'accord qu'un fork/pull request est la meilleure façon de procéder: https://github.com/HelloZeroNet/ZeroTalk",
				"added": 1464633266
			},
			{
				"comment_id": 6,
				"body": "ici \"@up4\".\n\n> [openuser](#comment_16_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS): \"oui c'est un ronchon mais il est cool\"... rien de méchant en gros, ça veut juste dire que je t'apprécie.\n\nEt c'est ce que j'ai compris. Je n'ai rien à te reprocher d'ailleurs. Cependant, si tu as jugé approprié de répondre à l'autre sous la forme _oui… mais…_ c'est que ce que _LUI_ disait de moi était péjoratif. Mais que ce soit péjoratif n'est pas le problème. Le problème est dans le lien potentiel avec la censure (la pollution de contenu). Et j'ai de la misère à croire que les trois cas*** où elnormand me donne l'impression d'être pro-censure sont _tous_ des malentendus. Et je t'en supplie, évite de me faire des leçons de grammaire. Comme j'ai dit, pour moi, le dossier est clos: je ne suis pas d'accord qu'Elnormand soit l'instigateur et/ou l'administrateur d'un ZeroTalk FR officiel de remplacement. Point final. Je ne répondrai plus aux messages publics ou privés à ce sujet et je ne reviendrai pas sur ma décision. Libre à vous de faire ce que vous voulez.\n\nPour moi, le seul contenu inadmissible dans un forum francophone est du contenu dans une autre langue que le français. Le problème du spam n'est pas assez significatif à ce point-ci pour qu'il en soit question. Et si nous sommes pour élire un nouvel administrateur il faut qu'il soit *irréprochable* de neutralité et de non-interventionnisme. Je ne vois pas en quoi je pourrais être plus clair.\n\n*** Les trois cas sont: #1 retirer la \"merde\" du nouveau wiki, #2: c'est un bon –pollueur de contenu– en son genre, #3 retire ton commentaire \"mensonger\"",
				"added": 1464912409
			}
		],
		"1_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq": [
			{
				"comment_id": 7,
				"body": "Je suis UP4 et j'ai décidé de ne pas priver les lecteurs du [contexte de cette discussion](/1LZQ4jN8mFpfiW3JsUYKua84t1B3wi4fcE/). Je suis d'accord avec la mise à jour de ZeroTalk. Mais je ne suis pas d'accord à ce qu'elnormand aie la clé et ainsi puisse censurer le forum comme il l'a fait déjà avec ce thread et comme il en a démontré le penchant à plusieurs reprises.",
				"added": 1465405588
			},
			{
				"comment_id": 10,
				"body": "> [keton](#comment_3_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): Je réalise un nouveau sondage et tu le pouri.Merci @poubelle. \n\nDe rien.",
				"added": 1465414339
			}
		],
		"3_1FMfUTXxZUWSFeW5LEXkSd4spVTtcq6TZS": [
			{
				"comment_id": 8,
				"body": "ici UP4 : il n'y a pas de souci puisque notre cher elnormand est un peu [prévisible](/1LZQ4jN8mFpfiW3JsUYKua84t1B3wi4fcE/)\n\net… oops… l'inventeur du web qui parle EN CE MOMENT de la censure et des surveillantes et que le meilleur système est un réseau de blogues que se répondent entre eux : https://www.youtube.com/watch?v=Yth7O6yeZRE\n\net le créateur de ZeroNet, nofish, fera une présentation à cette conférence aussi",
				"added": 1465405898
			},
			{
				"comment_id": 9,
				"body": "> [keton](#comment_4_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): Bien entendu, avant une mise en ligne, je le montrerai exclusivement à @poubelle afin qui le valide par un commentaire.\n\nDésolé, mais tu sais, si tu n'avais pas été le censeur que nous savons tous que tu es, tu aurais publié une archive _avant_ de supprimer la conversation. Attends, non, c'est beaucoup plus simple que ça: quand on est contre la censure, ON NE SUPPRIME LE CONTENU DES AUTRES SOUS AUCUN PRÉTEXTE.\n\nTu peux mettre en ligne tout ce que tu veux car contrairement à toi, je suis _pour_ la liberté d'expression, sans réserve, sans condition. Pas besoin de me le montrer en privé. D'ailleurs, comme je l'ai déjà dit, je ne vais plus échanger en privé avec toi. Certainement pas pour authentifier, crédibiliser ni justifier ce que tu dis. Tu peux d'ailleurs tout falsifier, si ça t'excite. En ce qui me concerne, je dirais que la possibilité pour toi de descendre plus bas dans mon estime et encore moins de regagner ma confiance est à peu près nulle. Ceci dit, quoiqu'herculéenne, si tu es pour y mettre un effort honnête et que tu ne te cales pas encore plus, c'est une tâche à laquelle je te conseille de t'atteler.\n\n> Le faite de créer un topic sur le (double pseudo) (renomé en MULTIPLE PSEUDO) vous montre que je suis transparent et que je suis Elnormand\n\nIl me paraît évident que tu ne comprends ni la transparence, ni l'anonymat, ni les aspects techniques des clés de chiffrage et leur lien avec la création d'un site sur ZeroNet. À quoi bon te sert de faire un \"sondage\" si tu n'es pas celui qui créera le site ? Qui va le faire ? Arrête de gueuler que tu \"ne veux pas la clé\" si tu ne réponds pas clairement à ces question dans le message principal de ton \"sondage\", parce que dire que tu \"ne veux pas la clé\" ne signifie absolument rien.",
				"added": 1465413634
			},
			{
				"comment_id": 11,
				"body": "> [keton](#comment_5_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): Encore une fois, je dois répondre car il y a des menssonges..0.\n\nOops. Oh noooooooooon. Pas des mensssssssingesszz ?!?!?\n\n> Je ne t'ai pas censuré, juste supprimé le topic pour recréer le même, afin de relancer le débat.\n\nlèl triple boucle piqué\n\n> De plus, tu va croire à un action manipulatrice mais ce n'est rien\n\nNon, je t'assure, je te crois _sur parole_.\n\n> De plus, je déteste le mensonge conscient..\n\nMoi, je pense que tu devrais faire un blogue dédié aux innombrables raisons qui te font tant aimer la censure. Une raison par billet. Tu en as pour toute la vie. On en connait déjà quelques-unes (mensonge, pédophilie, haine, jugement, choses pas gentilles, sondages qui penchent dans le mauvais sens, etc.). Mais c'est tellement de sagesse à chaque fois qu'on les veut _toutes_.\n\n> Mr ne souhaite pas authentifié. Une question : Pourquoi ?\n\nPrimo: tu m'as déjà exposé comme menteur. Pour nous les menteurs, l'authenticité c'est mèhhh.\n\nDeuxio: tu as démasqué si habilement ma pédophilie que je ne voudrais pas que tu dévoiles à tout le monde nos échanges coquins et du coup les faire bander tellement dur que ça risque d'hypothéquer leur cardiovasculaire beaucoup trop prématurément (pour la plupart).\n\n> tu ne peux pas en trouvé car c'est impossible (sauf erreur de ma part bien sur) :-)\n\n\n😘\n\n> je demande juste à être respecté, surtout de toi\n\nJe sais que je t'impressionne au point d'obnubiler tes fantasmes, mais ce n’est pas juste si ça va seulement dans un sens.\n\n> Pose les questions dans le bon topic et j'y répondrai.\n\nEt si je pose une question qui te gêne dans l'autre topic, tu vas encore le supprimer pour repartir sur de _bonnes bases_? Merci mais non merci.\n\nAlors. Ma question pour ce topic ici c'est: quand est-ce que je t'encule ?",
				"added": 1465424415
			},
			{
				"comment_id": 12,
				"body": "> [keton](#comment_7_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): PS :  Tu as oublié de répondre à cette question :.3.\"Pas besoin de me le montrer en privé. D'ailleurs, comme je l'ai déjà dit, je ne vais plus échanger en privé avec toi.Certainement pas pour authentifier, crédibiliser ni justifier ce que tu dis.\"Tout va être publié, toute la vérité. Mais Mr ne souhaite pas authentifié. Une question : Pourquoi ?\n\nEn fait j'y ai répondu deux fois (primo, deuxio), mais je vais y répondre encore _PLUS_  parce que je sais tout le bien que ça te fait d'entendre le doux son de ma voix. Donc:\n\nTertio: Je ne vais pas authentifier tes affaires parce que je ne sais pas que je ne sais pas tu es qui. Je veux pour ça: une photo de toi à poil qui tient un passeport valide avec ton vrai nom et un écran qui montre clairement cette conversation. Moi j'ai déjà montré mon visage et donné mon vrai nom il y a bien longtemps sur [mon site](/up4.bit/).\n\nQuarto: Toi qui cherche mon approbation tout le temps, c'est cute mais c'est pas assez pour me faire entrer dans ta danse sado-maso de sugar baby pourri gâté qui veut de l'attention.\n\nQuinto: Je n'ai pas à obtempérer à tes ordres ni à répondre à tes questions petit curieux coquin cochon va.\n\nSexto: hihihi, sexto comme dans \"quand est-ce que je t'encule ??!?!?\"\n\n> Sympa ta petite phrase de la fin. Gros looool.\n\nJe savais que ça te ferait de l'effet. Ça fait toujours ça aux puceaux.",
				"added": 1465501180
			},
			{
				"comment_id": 13,
				"body": "> [keton](#comment_8_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): Topic recréer : http://127.0.0.1:43110/1Vp5LH4wegCaqeB72yMw2jgNdVm4aR7ET/?Topic:12_1wsuQQPTH5Ysaryn5d2ZMZJApmv7WwZ3w/+Ne+pas+r+pondre+Pour+cr+er+un+nouveau+ZeroTalk+FR\n\nC'est bien mais c'est trop tard pour que je change d'opinion à ton sujet.\n\n> Je te respect man\n\nJe vais juste faire comme si tu n'avais jamais dit ça tellement c'est grossier de stupidité.\n\n> Je vais juste mettre en ligne sans magouille tout ce qui a été dit en étant NEUTRE.\n\nParfait. Fais ce que tu veux. Ne me demande pas de certifier qu'il n'y a pas de magouille. C'est tout. Si tu ne comprends pas pourquoi, c'est ton problème.\n\n> je n'imagine même pas ce que tu ferai avec mes données personnelles\n\nSi c'est des photos et que tu es à mon goût, je vais sûrement juste me branler dessus. Y'a pas de souci. Je te jure.\n\n> PS : Qu'est ce qui te faut pour que tu arrete de t'acharné sur ma personne ???\n\n1) Tu ne parles pas de moi, même en blague, dans mon dos. Ni ici, ni sur ZeroChat.\n\n2) Sans le supprimer, tu fermes ton sondage sur un ZeroTalk FR de remplacement tant que tu n'as pas une solution/proposition sur qui devrait avoir les clés. Tu n'as pas posé la bonne question. Tout le monde est pour une mise-à-jour. Personne ne fait confiance à personne pour les clés (avec raison). Ça, c'est la situation. Tu sais comment la débloquer? Énonce-le clairement et demande aux gens de se prononcer _là-dessus_.\n\n3) Supprimer, cacher, censurer du contenu même si c'est pour le remettre après, tu ne fais pas ça. Demander à quelqu'un de modifier, supprimer, censurer un commentaire ou un post, tu ne fais pas ça. Tu veux que j'arrête de m'acharner sur toi, ne dis pas des conneries sur la liberté d'expression ou la censure. Si tu dis des conneries (comme tu es parfaitement libre de le faire), je vais te répondre, peut-être avec plus de connerie.\n\n4) Si tu n'as rien à rajouter, ne répond pas à ce commentaire juste pour avoir le dernier mot.\n\n5) Si tu me prouves que tu es laid, c'est absolument certain que je vais arrêter de te faire la cour. Mais j'en ai pas la preuve, alors… Je vais tenter de te séduire jusqu'à la fin des temps.",
				"added": 1465504539
			},
			{
				"comment_id": 14,
				"body": "> [keton](#comment_11_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): J'étais près à ne pas répondre mais certaines phrases appelent à une réponse.Désolé\n\nTant pis pour toi.\n\n> Je n'ai pas que sa à faire de parler de toi partout et quel en serait l'objectif ??\n\nJustement.\n\n> Tu me donne des ordres maintenant!!! On est pas pote, ne l'oublie pas et arrête stp avec tes conneries de branlettes, de je ne sais trop quoi avec moi.\n\nTu sais très bien: _ass up, face down_. C'est un ordre. Comme [Lady Gaga](https://youtu.be/qrO4YZeyl0I?t=230), _I don't wanna be friends_.\n\nTu n'as aucun ami.\n\n> Je fais ce que j'ai envi.\n\nOui et une visite à ton trou noir s'impose de toute urgence.\n\n> Encore une fois, je suis contre le menssonge conscient.\n\nMensssonge, c'est comme [spaïayonge](https://www.youtube.com/watch?v=8g2gAxpdKsk): c'est pas comme ça que ça s'écrit hihi.\n",
				"added": 1465578562
			},
			{
				"comment_id": 15,
				"body": "> [keton](#comment_20_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq) Et au faite, merci d'avoir laisser ses amis prendre position contre moi ??\n\nPour être franc avec toi, je ne connais dans la vraie vie que deux usagers ZeroNet: \"frerepoulet\" et \"laurentbelanger\". Seul \"frerepoulet\" s'est prononcé ici. Donc, \"mon ami\". Au singulier. Mais au moins j'en ai un.\n\n> Pourquoi tu ne me respecte pas ??\n\nParce qu'à chaque fois que tu me réponds je suis obligé de réviser mon estimation de la longueur de ton pénis et ton quotient intellectuel à la baisse. Ça fait un bout que c'est passé en deçà du respectable. On est à 3 centimètres, niveau \"organisme monocellulaire\" en ce moment.\n\nJe ne te respecte pas, mais j'ai pitié de toi. Beaucoup. Je vois bien que tu n'as pas les moyens cognitifs de te défendre contre moi. Ça me fait presque de la peine que malgré tous les signaux de douleur que tu émets, tu continues de me répondre prétentieusement, ce qui justifie que j'en rajoute. Je suis fasciné par la puissance de ton orgueil qui te pousses à t'enfoncer de plus en plus dans l'humiliation. Ton orgueil est ton pire ennemi. Pas moi.\n\n> PS : Et puis non, je ne vais pas le fermé le sondage même si je suis d'accord avec toi.\n\nEt là on tombe à 7µm, niveau \"cuillèrée de soupe prébiotique\".\n",
				"added": 1465591377
			},
			{
				"comment_id": 16,
				"body": "> [keton](#comment_21_1GstETfCML3zqVaQat3nQ46WfiSF9gD7zq): J'ai remarqué que te ne réponds pas à toute mes questions ou tu réponds à côté \n\nOops. J'espère que le plancher était propre au moins.\n\n> Ta vie semble minable et j'ai l'impression que je suis ton objectif N°1\n\nTouché.\n\n> Alors que je n'ai pas et je ne serai pas ton bourreau ? Si c'est le cas, alors tu n'es pas intelligent.\n\nBien vu.\n\n> Tu énerve les gens en prenant un malin plaisir de les rabesser avec menssonge. \n\nAvec mensssaiäâyonge, tu ne rabaïesssssèeras point.\n\n> C'est un fait, un constat et tu ne peux le nié.\n\nAdieu monde cruel.",
				"added": 1465669301
			}
		],
		"1_1KVz2PT2Bni1S2Ti8o3faWC97nhNADM1NS": [
			{
				"comment_id": 17,
				"body": "pourquoi me gênerais-je de [contribuer](/tuetamere.bloccoq.bit/) à cette magnifique conversation pleine d'amour ?",
				"added": 1466120999
			}
		]
	},
	"comment_vote": {}
}