{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1556467817,
			"title": "Hotlinking images from other zites",
			"body": "Hello,\n\nhow can i ensure my zite visitor will see \"embeded\" images on my site while these images address will be other zite address? I mean such embeded images will not load in case the visitor not visited that site on which these are hosted.\n\nIs it sufficient to invite my site visitor to first visit the site from which i will be linking the images? The images are optional on that site, so will not be downloaded upon home page visit. Will ZN download them automaticaly when \"hot-linked\"?\n\nOr other way - can i add an iframe to my zite, which will automatically load also other zite or the image in iframe?",
			"added": 1556467816
		}
	],
	"topic_vote": {
		"1556161291_1DN24iDBCa558BcYjSz17fdXpFnJ694kKA": 1,
		"1556469439_1Jtas1e392Kx9sfvZKnCQR8HMH7gcJ1FpW": 1
	},
	"next_comment_id": 3,
	"comment": {
		"1556299233_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 1,
				"body": "thinking if this is caused by you using different identity and after logging under old identity it will allow you to use zerome, on the top of the [ZeroHello](/) can be button to logout. If there is not, maybe you need to check users.json file and make sure it is using old identity like on your old device. Make backups before modifying important files.",
				"added": 1556304954
			}
		],
		"1556406701_1PTLdvcq9U4wKG1J3Gr4z1wB8LWMypuHAA": [
			{
				"comment_id": 2,
				"body": "better to wait for someone to develop community managed sites, else all zites are doomed to be spammed or wrongly categorized/NSFW videos relying on single person to (sometimes manually) removed bad content. solution? community managed sites:\n[Suggestion - ZeroSite democratically managed #1086](https://github.com/HelloZeroNet/ZeroNet/issues/1086)\n[Antibot/antispam system to help prevent spam and allow community moderated sites #1310](https://github.com/HelloZeroNet/ZeroNet/issues/1310)",
				"added": 1556460478
			}
		]
	},
	"comment_vote": {
		"19_1LiBAqfmPSAEhoFj2fM3iMEZe5uzZnSUse": 1
	}
}