{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {},
	"next_comment_id": 7,
	"comment": {
		"2_15KvPSf8rVYZjNAWsMETCGrBhC6TrLFV3W": [
			{
				"comment_id": 1,
				"body": "Ну я ещё.",
				"added": 1628338625
			},
			{
				"comment_id": 2,
				"body": "> Человек спросил как дела, а ему никто не ответил... Почему? Наверное просто поняли, что он не увидит ответ.\n\nПопробуйте написать ему на почту (ZeroMail).",
				"added": 1628338715
			}
		],
		"1610779568_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 3,
				"body": "Нужно понять один маленький секрет. Вся голливудская фантастика - это не \"фантастика\". Всё, что нам показывают в этих фильмах, есть - реально существующие (но скрытые от Человечества) технологии, а так же ИХ реальные планы в отношении нас и нашего будущего.",
				"added": 1628339063
			}
		],
		"1625018612_1DeV9LYRftf4UtLRPYWWRcSuesmfkuhcRK": [
			{
				"comment_id": 4,
				"body": "> Основа Истинного Знания? Это получить его самостоятельно. \n\nВот только где эти \"истинные знания\" человек может получить в современном обществе? Даже в интернете их крупицы не так просто найти. К сожалению эти знания станут нам доступны ещё не скоро. Главная задача, которая сейчас стоит перед людьми - это пережить тот геноцид, который сейчас происходит.",
				"added": 1628339723
			}
		],
		"1626871884_19U58Sb6WWvP3eYgrSByzW8czvA3CxSXJg": [
			{
				"comment_id": 5,
				"body": "> Есть пара способов поднасрать глобалистам.\n\nГлобалистам вы не \"поднасрёте\". Потому что шланг с говном находится в их руках. А не в ваших. И таких шлангов у них много. И они толстые. \n\nВсё, что было описанно ранее - это не меры сранья глобалистам, а попытки временно оттянуть неизбежный ППЦ, который глобалисты приготовили для всех.\n\nДалее. Диванная (домашняя) безопасность, все эти торы, вэпээны и пр. - это всё хорошо. Вы пока ещё можете настроить свои девайсы и обеспечить себя безопасными каналами обмена информацией.\n\nНо как только вы выходите из дома, вы тут же попадаете под камеры наблюдения. Особенно это касается городских жителей. И тут вся ваша \"анонимность\", шифрование и прочие меры безопасности летят к чёрту. Т.е. становятся совершенно бесполезными. За пределами дома, под камерами, вы абсолютно \"голый\". Ни какой VPN не защитит вас от системы распознавания лица (а теперь уже и походки). А шапку-невидимку пока ещё не изобрели.\n\nДалее. Наличка - штука хорошая и правильная. Но что вы будете делать, когда её отменят?\n\nИ наконец, что вы будете делать, когда власти просто отключат интернет или вырубят электричество?",
				"added": 1628342675
			}
		],
		"1615456715_1Fb5iVeVmyT53woPjVQ4vc86oxYmN6sfTK": [
			{
				"comment_id": 6,
				"body": "Ну смотря, к каким (психически больным) людям. Бывают \"тихие\" и безобидные. А бывают буйные, неадекватные и склонные к опасным для окружающих действиям. Естественно, к последним отношение будет не самым хорошим.",
				"added": 1628353857
			}
		]
	},
	"comment_vote": {}
}