{
	"title": "NEO WEB Blog",
	"description": "A blog about the future of the web as a decentralized platform.",
	"links": "- [Source code](https://github.com/HelloZeroNet)",
	"next_post_id": 6,
	"demo": false,
	"modified": 1458184259,
	"post": [
		{
			"post_id": 5,
			"title": "What a thriving ZeroNet economy might look like.",
			"date_published": 1458162368.961,
			"body": "There are various ways a ZeroNet economy could play out but I think given that content distribution is built into ZeroNet, that if you like something you will continue to host its data to others as a kind of investment, but that leaves out two things, how content will be funded and how the 'roads' will be paid for.\n\n##Funding content\n\nTo say content will be crowdsourced isn't really a novel idea, after all ZeroNet itself is a crowdsourced network! And we already see that in the way that [ZeroNet is funding it's own development](http://zeronet.readthedocs.org/en/latest/help_zeronet/donate/). They even have different projects with their own funding goals.\n\nSo it is not out of place to see software engineers, artists, and musicians work the same way, where they give away work for free and get tips, and for bigger projects ask for funding and depend on the reputation they developed. And crowdsourcing lets them know if they are going the right direction as well, if there is enough desire for a feature, product, and/or service.\n\nBeyond that you might see situations where a project needs a logo for example, and publicly petitions for it, and several artists respond by creating a logo, and test groups respond by debating and talking about each logo design, the petitioner of the logo could then evaluate the test groups results and based on what they say pick a logo and pay the artists and test groups for their work, with bias towards the winners. It could also be an iterative processes where the artists redo their artwork and the test groups re-evaluate. All from their homes without needing to step into an office.\n\n##Funding the 'roads'\n\nDistributed computing will be the way individuals can passively make money on the side, provided that their computer is capable, has the right hardware, web browser, and/or bandwidth.\n\nIdeally you would basically login to a ZeroNet site and through your web browser the site will utilize your system, and when work on a project is done and validated, the owner could then send cryptocurrency out to each peer that contributed computing power. Sites that pay well will of course attract more peers.\n\nOne use would be as a distributed renderer. Take this [webgl path tracer](http://madebyevan.com/webgl-path-tracing/) for example, it progressively renders a scene until there is very little noise, producing a sharp image but of course takes time to do that. Applying this to distributed computing, you can then have peers distributing scene data (models, materials, textures, etc), render different frames in an animation and share the results, and help coordinate which frame to render next, and validating existing frames. As an example outside of ZeroNet there is project trying to do this called [bitwrk](http://bitwrk.net/) but requires the install of special software instead of utilizing web technology.\n\nAnother use might be processing and indexing text for a search engine for other sites. As an example outside of ZeroNet a similar search engine exists for indexing the web called [yacy](https://en.wikipedia.org/wiki/YaCy), though it is dedicated to crawling the web, for ZeroNet the idea would be that peers will be given something to search for in text provided by the site and will then process text and put it into a database to speed up search queries, each peer would be responsible for different parts of the database.\n\nStill more other uses might be for hosting things, like multiplayer games. Multiplayer games usually need a host and for performance reasons its better to have a dedicated host, so through something like WebRTC users may be able to use their computer as a dedicated game host. As a demo of P2P gaming in a web browser, Mozilla added [WebRTC support to their BannaBread game](https://hacks.mozilla.org/2013/03/webrtc-data-channels-for-great-multiplayer). Or another case for games may be to run a bot that interacts with other players in games, like in a ZeroNet casino where you run a dealer bot for a little bit and earn tokens dealing cards to other players, and then can gamble those tokens with other players. This way a site is more decentralized, the site creator can go offline but it is the users that bring life to that site by running bots.\n"
		},
		{
			"post_id": 1,
			"title": "How ZeroNet would have solved 'NetNeutrality' between Netflix and Comcast.",
			"date_published": 1457841660,
			"body": "So the title is somewhat clickbait because there is currently no way for Netflix to use ZeroNet to distribute, but let me explain how the problems between Netflix and Comcast relate.\n\nFirst there are two perspectives that apply to what happened between Netflix and Comcast. The first more common view is that Comcast was trying to censor its competitors, a NetNeutrality issue, in which case something like ZeroNet would have prevented that censorship.\n\nThe second point of view, and I'd argue the most accurate and most important one is that the issue between Netflix and Comcast wasn't about censorship / NetNeutrality, but was about Netflix making a bad decision to centralize its service.\n\nNetflix for its internet used Cogent and there is a lot of information now that Cogent was responsible for the issues between Netflix and Comcast customers, which cleared Comcast as being an unfair competitor. This isn't to say there is not cases of censorship or that there is conflict of interest by TV providers who also provide internet.\n\nAt the same time it makes no sense for Netflix to centralize its service, it is actually more costly to everyone, customers, ISPs and even Netflix. Think about it in terms of if Amazon decided to store all their products in one central warehouse. If Amazon did that, it means they need to burn more fuel and it would take longer for customers that live farther away from their center (latency), and since people don't order in bulk or at the same time, the packages would leave at various intervals. This would also increase traffic on all the highways. Instead it makes sense for Amazon to have lots of warehouses, it would save on shipping costs and it would reduce shipping times.\n\nSo in the end a decentralized way of distribution is superior to how Netflix distributes content, but of course the internet as it is designed today allows for people and businesses to make these bad decisions but ZeroNet changes that by being decentralized by default!\n"
		}
	]
}