{
	"topic": [
		{
			"title": "Revue de presse de l’April pour la semaine 12 de l’année 2019",
			"pubDate": "2019-03-26 07:39:02",
			"link": "https://linuxfr.org/news/revue-de-presse-de-l-april-pour-la-semaine-12-de-l-annee-2019",
			"author": "echarp",
			"body": "\n<div>\n<p>Cette revue de presse sur Internet fait partie du travail de veille mené par l’April dans le cadre de son action de défense et de promotion du logiciel libre. Les positions exposées dans les articles sont celles de leurs auteurs et ne rejoignent pas forcément celles de l’April.</p>\n\n<ul>\n<li><a href=\"https://lvsl.fr/la-bataille-des-lobbies-europeens-autour-de-la-directive-copyright\">[Le Vent Se Lève] La bataille des lobbies européens autour de la Directive Copyright</a></li>\n<li><a href=\"https://www.letemps.ch/sciences/hacker-science-geneve\">[Le Temps] Hacker pour la science à Genève</a></li>\n<li><a href=\"https://www.les-infostrateges.com/actu/le-cese-prone-une-politique-de-souverainete-europeenne-du-numerique\">[les-infostrateges.com] Le CESE prône une politique de souveraineté européenne du numérique</a></li>\n<li><a href=\"https://www.forbes.fr/technologie/bitcoin-un-projet-communiste\">[Forbes France] Bitcoin, Un Projet Communiste ?</a></li>\n<li><a href=\"https://usbeketrica.com/article/darpa-vote-electronique-hacker\">[Usbek &amp; Rica] La Darpa prépare un système de vote électronique impossible à hacker</a></li>\n</ul>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://www.april.org\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103771\">April</a>\n</li>\n<li>lien n°2 : <a title=\"https://www.april.org/revue-de-presse\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103772\">Revue de presse de l’April</a>\n</li>\n<li>lien n°3 : <a title=\"https://linuxfr.org/news/revue-de-presse-de-l-april-pour-la-semaine-11-de-l-annee-2019\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103773\">Revue de presse de la semaine précédente</a>\n</li>\n</ul>\n<div>\n<h2><a href=\"https://lvsl.fr/la-bataille-des-lobbies-europeens-autour-de-la-directive-copyright\">[<em>Le Vent Se Lève</em>] La bataille des lobbies européens autour de la Directive Copyright</a></h2>\n\n<p>Le samedi 23 mars 2019. </p>\n\n<blockquote>\n<p>« La Directive Copyright sort de sa phase de négociation et aborde sa dernière ligne droite. État des lieux des actions de lobbying autour du texte depuis son entrée en négociation dans l’Union européenne en septembre 2018.</p>\n</blockquote>\n\n<p>Et aussi :</p>\n\n<ul>\n<li>\n<a href=\"https://www.lepoint.fr/monde/allemagne-manifestations-contre-la-reforme-du-droit-d-auteur-23-03-2019-2303429_24.php\">[<em>Le Point</em>] Allemagne : manifestations contre la réforme du droit d’auteur</a> ;</li>\n<li>\n<a href=\"https://5minutes.rtl.lu/lifestyle/techworld/a/1324471.html\">[<em>RTL 5minutes</em>] Droit d’Auteur : Manif anti réforme de l’UE au Luxembourg</a> ;</li>\n<li>\n<a href=\"https://culturebox.francetvinfo.fr/culture/ue-la-reforme-du-droit-d-auteur-divise-fortement-en-europe-286956\">[<em>francetv info</em>] UE : la réforme du droit d’auteur divise fortement en Europe</a> ;</li>\n<li>\n<a href=\"https://www.nextinpact.com/news/107724-interview-lhebergeur-larticle-13-et-censure.htm\">[<em>Next INpact</em>] [Interview] L’hébergeur, l’article 13 et la censure</a> ;</li>\n<li>\n<a href=\"https://www.clubic.com/pro/legislation-loi-internet/actualite-852227-directive-copyright-patron-qwant-remunerer-editeurs.html\">[<em>Clubic.com</em>] Directive Copyright : le patron de Qwant prêt à rémunérer les éditeurs dès maintenant</a> ;</li>\n<li>\n<a href=\"https://www.theverge.com/2019/3/21/18275462/eu-copyright-directive-protest-wikipedia-twitch-pornhub-final-vote\">[<em>The Verge</em>] European Wikipedias have been turned off for the day to protest dangerous copyright laws</a> ;</li>\n<li>\n<a href=\"https://business.lesechos.fr/directions-juridiques/partenaire/partenaire-2121-droit-d-auteur-dans-le-marche-unique-numerique-le-controverse-article-13-du-projet-de-directive-visant-les-fournisseurs-de-services-de-partage-de-contenus-en-ligne-327970.php\">[<em>Les Échos</em>] Droit d’auteur dans le marché unique numérique : le controversé article 13 du projet de directive visant les fournisseurs de services de partage de contenus en ligne</a> ;</li>\n<li>\n<a href=\"https://www.lesechos.fr/tech-medias/medias/0600930720982-qwant-va-remunerer-les-editeurs-de-presse-pour-lindexation-de-leurs-articles-dit-son-patron-2253671.php\">[<em>Les Échos</em>] « Qwant va rémunérer les éditeurs de presse pour l’indexation de leurs articles », dit son patron</a> ;</li>\n<li>\n<a href=\"https://copybuzz.com/copyright/article-13-must-go-no-desperate-last-minute-witchcraft-can-turn-it-into-magic-pixie-dust\">[<em>Copybuzz</em>] <em>Article 13 must go: No desperate last-minute witchcraft can turn it into magic pixie dust</em></a>.</li>\n</ul>\n<p>Voir aussi :</p>\n\n<ul>\n<li>\n<a href=\"https://saveyourinternet.eu/\"><em>#SaveYourInternet</em></a>.</li>\n</ul>\n<h2><a href=\"https://www.letemps.ch/sciences/hacker-science-geneve\">[<em>Le Temps</em>] Hacker pour la science à Genève</a></h2>\n\n<p>✍ Florent Hiard, le vendredi 22 mars 2019. </p>\n\n<blockquote>\n<p>« Le hackathon est à l’honneur à Genève. Jusqu’à dimanche, l’Open Geneva Festival met en avant ce marathon de l’innovation collaborative sur de nombreux sites de l’agglomération. »</p>\n</blockquote>\n<h2><a href=\"https://www.les-infostrateges.com/actu/le-cese-prone-une-politique-de-souverainete-europeenne-du-numerique\">[<em>les-infostrateges.com</em>] Le CESE prône une politique de souveraineté européenne du numérique</a></h2>\n\n<p>✍ Fabrice Molinaro, le jeudi 21 mars 2019. </p>\n\n<blockquote>\n<p>« La révolution numérique, par le biais des smartphones, des réseaux sociaux ou encore de l’Internet des objets en pleine croissance, fait profondément évoluer nos pratiques, s’immisçant aussi bien dans la sphère publique que dans l’intimité des personnes. »</p>\n</blockquote>\n\n<p>Voir aussi : </p>\n\n<ul>\n<li>\n<a href=\"https://april.org/le-cese-preconise-l-usage-des-logiciels-libres-pour-une-politique-de-souverainete-europeenne\">Le CESE préconise l’usage des logiciels libres pour une politique de souveraineté européenne</a>.</li>\n</ul>\n<h2><a href=\"https://www.forbes.fr/technologie/bitcoin-un-projet-communiste\">[<em>Forbes France</em>] Bitcoin, Un Projet Communiste ?</a></h2>\n\n<p>✍ Lionel Meneghin, le mercredi 20 mars 2019. </p>\n\n<blockquote>\n<p>« Quoi de plus antagoniste <em>a priori</em> que les cryptomonnaies telles que le Bitcoin et le communisme ? L’un évoque la finance et la spéculation, l’autre leur ennemi historique. Deux mondes étanches et antagonistes. En apparence seulement… »</p>\n</blockquote>\n<h2>\n<a href=\"https://usbeketrica.com/article/darpa-vote-electronique-hacker\">[<em>Usbek &amp; Rica</em>] La Darpa prépare un système de vote électronique impossible à hacker</a>.</h2>\n\n<p>✍ Sophie Kloetzli, le mercredi 20 mars 2019. </p>\n\n<blockquote>\n<p>« L’agence de recherche de l’armée américaine veut mettre au point un système de vote électronique ultra‐sécurisé, notamment en vue de la présidentielle de 2020. »</p>\n</blockquote>\n\n<hr>\n<p>Si cette revue de presse ne s’affiche pas correctement, vous pouvez la consulter ici : <a href=\"https://april.filsdu.net/series/201912/\">https://april.filsdu.net/series/201912/</a></p>\n</div>\n<div><a href=\"https://linuxfr.org/news/revue-de-presse-de-l-april-pour-la-semaine-12-de-l-annee-2019.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116770/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/revue-de-presse-de-l-april-pour-la-semaine-12-de-l-annee-2019#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637977,
			"topic_id": 1553637977,
			"doc": "depeche"
		},
		{
			"title": "Il y a six mois Linus décidait de changer, a‐t‐il réussi ?",
			"pubDate": "2019-03-25 10:53:44",
			"link": "https://linuxfr.org/news/il-y-a-six-mois-linus-decidait-de-changer-a-t-il-reussi",
			"author": "Albert_",
			"body": "\n<div>\n<p>Souvenez‐vous, c’était il y a six mois : Linus présentait ses excuses et décidait de faire une pause. Il semblerait que Linus ait finalement accepté que certains de ses messages et interventions ne soient pas toujours appropriés. Il décidait alors de prendre du recul pour travailler sur lui‐même et apprendre à tenir compte des sentiments de ses interlocuteurs.</p>\n\n<p>À votre avis, vous qui suivez la LKML, est‐ce que Linus a vraiment changé son mode de gouvernance ou est‐ce que ses vieux démons sont revenus ?</p>\n\n<p>Associé à cela, la publication d’un code de conduite pour le développement du noyau — oui, c’est forcément lié, mais ce n’est pas ce code qui pousse Linus vers la sortie, c’est plutôt l’inverse : Linus qui a pris conscience du problème d’où le code de conduite proposé.</p>\n\n<p>Vous trouverez en seconde partie son long message (et sa traduction) envoyé en plein milieu du cycle de développement du noyau 4.19 qui sera terminé par Greg Kroah‐Hartman.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"http://lkml.iu.edu/hypermail/linux/kernel/1809.2/00117.html?print=anz\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/102696\">Message sur la LKML</a>\n</li>\n<li>lien n°2 : <a title=\"https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/commit/?id=8a104f8b5867c682d994ffa7a74093c54469c11f\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/102697\">Commit du Code de conduite du noyau Linux</a>\n</li>\n</ul>\n<div>\n<p>Message de Linus et sa traduction</p>\n\n<blockquote>\n<p>[<em>So this email got a lot longer than I initially thought it would get, but let’s start out with the “regular Sunday release” part</em>]</p>\n</blockquote>\n\n<p>[Bon, ce courriel est un peu plus long que je l’aurais pensé au départ, mais commençons avec la partie « publication dominicale habituelle ».]</p>\n\n<blockquote>\n<p><em>Another week, another rc.</em></p>\n</blockquote>\n\n<p>Une nouvelle semaine, une nouvelle RC.</p>\n\n<blockquote>\n<p><em>Nothing particularly odd stands out on the technical side in the kernel updates for last week — rc4 looks fairly average in size for this stage in the release cycle, and all the other statistics look pretty normal too.</em></p>\n</blockquote>\n\n<p>Rien de particulier  concernant les mises à jour  de la partie technique pour la semaine dernière — la RC4 paraît plutôt normale en taille à cette étape du cycle de publication et toutes les autres statistiques semblent plutôt normales également.</p>\n\n<blockquote>\n<p><em>We’ve got roughly two thirds driver fixes (gpu and networking look to be the bulk of it, but there’s smaller changes all over in various driver subsystems), with the rest being the usual mix: core networking, perf tooling updates, arch updates, Documentation, some filesystem, vm and minor core kernel fixes.</em></p>\n</blockquote>\n\n<p>Nous avons à peu près deux tiers de correctifs de pilotes (le pilotes graphiques et le réseau semblent en être la majorité, mais il y a de petits changements un peu partout dans différents sous‐systèmes des pilotes), le reste étant le mélange habituel : base du réseau, mise à jour d’architectures, documentation, un peu de systèmes de fichiers, la mémoire virtuelle et des mises à jour mineures de la base du noyau.</p>\n\n<blockquote>\n<p><em>So it’s all fairly small and normal for this stage. As usual, I’m appending the shortlog at the bottom for people who want to get an overview of the details without actually having to go dig in the git tree.</em></p>\n</blockquote>\n\n<p>Donc tout est plutôt petit et normal à cette étape. Comme d’habitude, je joins le journal abrégé [N. D. T. : des modifications] en annexe pour les gens qui veulent un aperçu des détails sans avoir à fouiller dans l’arborescence Git.</p>\n\n<blockquote>\n<p><em>The one change that stands out and merits mention is the code of conduct addition…</em></p>\n</blockquote>\n\n<p>Le changement qui ressort et mérite d’être mentionné est l’ajout du code de conduite.</p>\n\n<blockquote>\n<p>[ <em>And here comes the other, much longer, part…</em> ]</p>\n</blockquote>\n\n<p>[Et ici commence l’autre partie, bien plus longue…]</p>\n\n<blockquote>\n<p><em>Which brings me to the <em>NOT</em> normal part of the last week: the discussions (both in public mainly on the kernel summit discussion lists and then a lot in various private communications) about maintainership and the kernel community. Some of that discussion came about because of me screwing up my scheduling for the maintainer summit where these things are supposed to be discussed.</em></p>\n</blockquote>\n\n<p>Ce qui m’amène à la partie <strong>NON</strong> normale de la semaine dernière : les discussions (en public, principalement sur la liste de discussion du <em>kernel summit</em> et beaucoup par divers moyens de communications privées) à propos de <em>maintainership</em> et de la communauté du noyau. Une partie de ces discussions a émergé par ma faute, car je me suis planté dans mon agenda pour le <em>maintainer summit</em>, où ces choses sont censées être discutées.</p>\n\n<blockquote>\n<p><em>And don’t get me wrong. It’s not like that discussion itself is in any way new to this week — we’ve been discussing maintainership and community for years. We’ve had lots of discussions both in private and on mailing lists. We have regular talks at conferences — again, both the “public speaking” kind and the “private hallway track” kind.</em></p>\n</blockquote>\n\n<p>Ne vous méprenez pas. Ce n’est pas que cette discussion soit en elle‐même nouvelle cette semaine — nous avons discuté de <em>maintainership</em> et de communauté depuis des années. Nous avons eu de nombreuses discussions tant en privé que sur les <em>mailing list</em>. Nous avons eu des discussions régulières à des conférences - à nouveau, tant lors de discussions publiques que lors de discussions de couloirs privées.</p>\n\n<blockquote>\n<p><em>No, what was new last week is really my reaction to it, and me being perhaps introspective (you be the judge).</em></p>\n</blockquote>\n\n<p>Non, ce qui est nouveau la semaine passée est vraiment ma réaction à cela et peut‐être un peu d’introspection de ma part (je vous laisse juges).</p>\n\n<blockquote>\n<p><em>There were two parts to that.</em></p>\n</blockquote>\n\n<p>Il y a eu deux volets.</p>\n\n<blockquote>\n<p><em>One was simply my own reaction to having screwed up my scheduling of the maintainership summit: yes, I was somewhat embarrassed about having screwed up my calendar, but honestly, I was mostly hopeful that I wouldn’t have to go to the kernel summit that I have gone to every year for just about the last two decades.</em></p>\n</blockquote>\n\n<p>L’un était ma propre réaction d’avoir bousillé mon planning du <em>maintainership summit</em> : oui, j’étais quelque peu embarrassé d’avoir foutu en l’air mon calendrier, mais honnêtement, j’espérais ne pas avoir à aller au <em>kernel summit</em> auquel je vais chaque année depuis près de vingt ans.</p>\n\n<blockquote>\n<p><em>Yes, we got it rescheduled, and no, my “maybe you can just do it without me there” got overruled. But that whole situation then started a whole different kind of discussion. And kind of incidentally to that one, the second part was that I realized that I had completely mis‐read some of the people involved.</em></p>\n</blockquote>\n\n<p>Oui, nous l’avons reprogrammé, et non, mon « peut‐être que vous pouvez juste faire sans moi » a été rejeté. Mais cette situation a alors généré un tout autre genre de discussion. Et, incidemment, il s’avère que j’avais mal interprété les écrits de certaines des personnes impliquées. [N. D. T. : Syntaxe anglaise pourrie, si quelqu’un fait mieux, je prends.]</p>\n\n<blockquote>\n<p><em>This is where the “look yourself in the mirror” moment comes in.</em></p>\n</blockquote>\n\n<p>C’est là que le moment « regarde‐toi dans le miroir » arrive.</p>\n\n<blockquote>\n<p><em>So here we are, me finally on the one hand realizing that it wasn’t actually funny or a good sign that I was hoping to just skip the yearly kernel summit entirely, and on the other hand realizing that I really had been ignoring some fairly deep‐seated feelings in the community.</em></p>\n</blockquote>\n\n<p>Et nous y voilà, moi, réalisant finalement, d’une part que ce n’était en fait pas drôle, ni un bon signe d’espérer juste sauter le <em>kernel summit</em> annuel et, d’autre part, que j’avais vraiment ignoré certains sentiments assez profonds dans la communauté.</p>\n\n<blockquote>\n<p><em>It’s one thing when you can ignore these issues. Usually it’s just something I didn’t want to deal with.</em></p>\n</blockquote>\n\n<p>C’est une chose lorsque vous pouvez ignorer ces problèmes. Généralement, c’est juste une chose à laquelle je ne voulais pas avoir à me confronter.</p>\n\n<blockquote>\n<p><em>This is my reality. I am not an emotionally empathetic kind of person and that probably doesn’t come as a big surprise to anybody. Least of all me. The fact that I then misread people and don’t realize (for years) how badly I’ve judged a situation and contributed to an unprofessional environment is not good.</em></p>\n</blockquote>\n\n<p>C’est ma réalité, je ne suis pas quelqu’un d’empathique par nature et ce n’est probablement une surprise pour personne. Et certainement pas pour moi. Le fait que j’ai mal compris les gens et que je n’ai pas réalisé (pendant des années) combien j’avais mal jugé la situation et contribué à un environnement non professionnel n’est pas bon.</p>\n\n<blockquote>\n<p><em>This week people in our community confronted me about my lifetime of not understanding emotions. My flippant attacks in emails have been both unprofessional and uncalled for. Especially at times when I made it personal. In my quest for a better patch, this made sense to me. I know now this was not OK and I am truly sorry.</em></p>\n</blockquote>\n\n<p>Cette semaine, les gens dans notre communauté m’ont confronté à ma vie, passée à ne pas comprendre les émotions. Mes attaques désinvoltes dans les courriels ont été à la fois non professionnelles et indues. En particulier les fois où elles furent personnelles. Dans ma quête de meilleurs correctifs, c’était sensé pour moi. Je sais maintenant que ce n’était pas acceptable et je suis sincèrement désolé.</p>\n\n<blockquote>\n<p><em>The above is basically a long‐winded way to get to the somewhat painful personal admission that hey, I need to change some of my behavior, and I want to apologize to the people that my personal behavior hurt and possibly drove away from kernel development entirely.</em></p>\n</blockquote>\n\n<p>Ce qui précède est simplement un long chemin tortueux pour arriver à admettre personnellement de façon quelque peu douloureuse que, eh, je dois changer mon comportement. Et je tiens à présenter mes excuses aux personnes que mon comportement a blessé et potentiellement complètement éloigné du développement du noyau.</p>\n\n<blockquote>\n<p><em>I am going to take time off and get some assistance on how to understand people’s emotions and respond appropriately.</em></p>\n</blockquote>\n\n<p>Je vais prendre un congé et demander de l’aide pour comprendre les émotions des gens et comment répondre de façon adaptée.</p>\n\n<blockquote>\n<p><em>Put another way: When asked at conferences, I occasionally talk about how the pain‐points in kernel development have generally not been about the</em> technical <em>issues, but about the inflection points where development flow and behavior changed.</em></p>\n</blockquote>\n\n<p>En d’autres termes, lorsque je suis interrogé lors de conférences, je parle parfois du fait que les points irritants dans le développement du noyau ne sont généralement pas le fait de problèmes techniques, mais de points d’inflexion où le flot et les pratiques de développement évoluent.</p>\n\n<blockquote>\n<p><em>These pain points have been about managing the flow of patches, and often been associated with big tooling changes — moving from making releases with \"patches and tar‐balls\" (and the</em> very <em>painful discussions about how “Linus doesn’t scale” back 15+ years ago) to using BitKeeper, and then to having to write git in order to get past the point of that no longer working for us.</em></p>\n</blockquote>\n\n<p>Ces points irritants concernent la gestion du flot de correctifs, souvent associées avec de gros changements d’outils — passant de publications « correctifs et <em>tar‐balls</em> » (et la discussion <em>vraiment</em> difficile que « Linus ne délègue pas » il y a plus de 15 ans de cela) à l’utilisation de BitKeeper, puis à avoir à écrire Git pour dépasser le point où ça ne marcherait plus pour nous.</p>\n\n<blockquote>\n<p><em>We haven’t had that kind of pain-point in about a decade. But this week felt like that kind of pain point to me.</em></p>\n</blockquote>\n\n<p>Nous n’avons pas eu de point de douleur en près de dix ans. Mais cette semaine, je l’ai ressentie comme un point de douleur.</p>\n\n<blockquote>\n<p>_ To tie this all back to the actual 4.19-rc4 release (no, really, this_ is <em>related!) I actually think that 4.19 is looking fairly good, things have gotten to the “calm” period of the release cycle, and I’ve talked to Greg to ask him if he’d mind finishing up 4.19 for me, so that I can take a break, and try to at least fix my own behavior.</em></p>\n</blockquote>\n\n<p>Pour rattacher tout cela à la publication du 4.19-rc4 (non, sérieux, c’est vraiment lié), je pense en fait que la 4.19 se présente assez bien, la période « calme » du cycle de publication arrive et j’ai demandé à Greg s’il pouvait s’occuper de terminer la 4.19 pour moi, de sorte que je puisse faire une pause et essayer de corriger mon propre comportement. </p>\n\n<blockquote>\n<p><em>This is not some kind of “I’m burnt out, I need to just go away” break. I’m not feeling like I don’t want to continue maintaining Linux. Quite the reverse. I very much <em>do</em> want to continue to do this project that I’ve been working on for almost three decades.</em></p>\n</blockquote>\n\n<p>Ce n’est pas une espèce de pause « je suis épuisé, il faut que je parte ». Je ne ressens pas de répulsion à continuer à maintenir Linux. Au contraire. Je veux <em>vraiment</em> continuer à mener ce projet sur lequel je travaille depuis près de trente ans.</p>\n\n<blockquote>\n<p><em>This is more like the time I got out of kernel development for a while because I needed to write a little tool called “git”. I need to take a break to get help on how to behave differently and fix some issues in my tooling and workflow.</em></p>\n</blockquote>\n\n<p>C’est plutôt comme la fois où je me suis retiré du développement du noyau quelque temps, parce qu’il fallait que j’écrive un petit outil appelé « git ». J’ai besoin de faire une pause pour trouver de l’aide pour me comporter différemment et corriger quelques problèmes dans mon outillage et mon processus de travail.</p>\n\n<blockquote>\n<p><em>And yes, some of it might be “just” tooling. Maybe I can get an em‐ail filter in place so at when I send e‐mail with curse‐words, they just won’t go out. Because hey, I’m a big believer in tools, and at least</em> some <em>problems going forward might be improved with simple automation.</em></p>\n</blockquote>\n\n<p>Et oui, une partie pourrait n’être « que » de l’outillage. Peut‐être que je peux mettre en place un filtre de sorte que lorsque j’envoie un courriel avec des gros mots, il ne parte simplement pas. Parce que, eh, je crois fermement aux outils et au moins, <em>certains</em> problèmes pourraient être améliorés avec une simple automatisation.</p>\n\n<blockquote>\n<p><em>I know when I really look “myself in the mirror” it will be clear it’s not the only change that has to happen, but hey… You can send me suggestions in e‐mail.</em></p>\n</blockquote>\n\n<p>Je sais, quand « je me regarde vraiment dans le miroir », qu’il est clair que ce n’est pas la seule chose qui doit changer, mais eh… Vous pouvez m’envoyer des suggestions par courriel.</p>\n\n<blockquote>\n<p><em>I look forward to seeing you at the Maintainer Summit.</em></p>\n</blockquote>\n\n<p>J’ai hâte de vous revoir au <em>Maintainer summit</em>.</p>\n\n<blockquote>\n<p><em>Linus</em></p>\n</blockquote>\n</div>\n<div><a href=\"https://linuxfr.org/news/il-y-a-six-mois-linus-decidait-de-changer-a-t-il-reussi.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/115299/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/il-y-a-six-mois-linus-decidait-de-changer-a-t-il-reussi#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637976,
			"topic_id": 1553637976,
			"doc": "depeche"
		},
		{
			"title": "Agenda du Libre pour la semaine 13 de l’année 2019",
			"pubDate": "2019-03-24 20:24:30",
			"link": "https://linuxfr.org/news/agenda-du-libre-pour-la-semaine-13-de-l-annee-2019",
			"author": "Benoît Sibaud",
			"body": "\n<div>\n<p>Calendrier Web, regroupant des événements liés au Libre (logiciel, salon, atelier, <em>install party</em>, conférence), annoncés par leurs organisateurs. Voici un récapitulatif de la semaine à venir. Le détail de chacun de ces 76 événements (France 73, Belgique 3) est en seconde partie de dépêche.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://april.org\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103758\">April</a>\n</li>\n<li>lien n°2 : <a title=\"https://www.agendadulibre.org\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103759\">Agenda du Libre</a>\n</li>\n<li>lien n°3 : <a title=\"https://www.agendadulibre.org/maps?future=false&amp;period%5Bweek%5D=13&amp;period%5Byear%5D=2019\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103760\">Carte des événements</a>\n</li>\n<li>lien n°4 : <a title=\"https://www.agendadulibre.org/events/new\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103761\">Proposer un événement</a>\n</li>\n<li>lien n°5 : <a title=\"https://www.agendadulibre.org/orgas\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103762\">Annuaire des organisations</a>\n</li>\n<li>lien n°6 : <a title=\"https://linuxfr.org/news/agenda-du-libre-pour-la-semaine-12-de-l-annee-2019\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103763\">Agenda de la semaine précédente</a>\n</li>\n<li>lien n°7 : <a title=\"https://agendadulibre.qc.ca\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103764\">Agenda du Libre Québec</a>\n</li>\n</ul>\n<div>\n<h2 class=\"sommaire\">Sommaire</h2>\n<ul class=\"toc\">\n<li>\n<ul>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-limoges-mois-du-logiciel-libre-13%C3%A8me-%C3%A9dition---du-vendredi--1-mars-2019-%C3%A0-10h00-au-samedi-30-mars-2019-%C3%A0-18h00\">[FR Limoges] </a><a href=\"https://www.agendadulibre.org/events/18903\">Mois du Logiciel Libre 13ème édition</a> - Du vendredi  1 mars 2019 à 10h00 au samedi 30 mars 2019 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-villeneuve-dascq-expolibre-pour-d%C3%A9couvrir-le-logiciel-libre---du-vendredi--1-mars-2019-%C3%A0-16h00-au-mardi-16-avril-2019-%C3%A0-16h00\">[FR Villeneuve d'Ascq] </a><a href=\"https://www.agendadulibre.org/events/19028\">Expolibre, pour découvrir le logiciel libre</a> - Du vendredi  1 mars 2019 à 16h00 au mardi 16 avril 2019 à 16h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-nanterre-expo-libre---du-lundi--4-mars-2019-%C3%A0-10h00-au-samedi-30-mars-2019-%C3%A0-18h00\">[FR Nanterre] </a><a href=\"https://www.agendadulibre.org/events/18969\">Expo libre</a> - Du lundi  4 mars 2019 à 10h00 au samedi 30 mars 2019 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-nanterre-s%C3%A9lection-douvrages-sur-la-culture-libre---du-lundi--4-mars-2019-%C3%A0-14h00-au-samedi-30-mars-2019-%C3%A0-18h00\">[FR Nanterre] </a><a href=\"https://www.agendadulibre.org/events/18970\">Sélection d'ouvrages sur la culture libre</a> - Du lundi  4 mars 2019 à 14h00 au samedi 30 mars 2019 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lorient-pr%C3%A9sentation-de-lassociation-framasoft---du-lundi--4-mars-2019-%C3%A0-16h00-au-vendredi-29-mars-2019-%C3%A0-17h00\">[FR Lorient] </a><a href=\"https://www.agendadulibre.org/events/19191\">Présentation de l'association Framasoft</a> - Du lundi  4 mars 2019 à 16h00 au vendredi 29 mars 2019 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-rez%C3%A9-exposition-sur-le-libre---du-lundi-25-mars-2019-%C3%A0-10h00-au-vendredi--5-avril-2019-%C3%A0-18h00\">[FR Rezé] </a><a href=\"https://www.agendadulibre.org/events/19003\">Exposition sur le Libre</a> - Du lundi 25 mars 2019 à 10h00 au vendredi  5 avril 2019 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-atellibre-centre-dexp%C3%A9rimentations-et-dinnovation-sociale---le-lundi-25-mars-2019-de-10h00-%C3%A0-12h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/19188\">Atel’libre Centre d’Expérimentations et d’Innovation Sociale</a> - Le lundi 25 mars 2019 de 10h00 à 12h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-strasbourg-atelier-et-pr%C3%A9sentation-du-r%C3%A9seau-social-libre-communecter---le-lundi-25-mars-2019-de-17h00-%C3%A0-20h00\">[FR Strasbourg] </a><a href=\"https://www.agendadulibre.org/events/19089\">Atelier et présentation du réseau social libre COmmunecter</a> - Le lundi 25 mars 2019 de 17h00 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-paris-esp%C3%A9ranto--langue-libre---le-lundi-25-mars-2019-de-19h00-%C3%A0-20h30\">[FR Paris] </a><a href=\"https://www.agendadulibre.org/events/18657\">Espéranto – langue libre</a> - Le lundi 25 mars 2019 de 19h00 à 20h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-grenoble-atelier-exploration-ludique-de-nodejs---le-lundi-25-mars-2019-de-19h00-%C3%A0-21h30\">[FR Grenoble] </a><a href=\"https://www.agendadulibre.org/events/18994\">Atelier Exploration ludique de Node.js</a> - Le lundi 25 mars 2019 de 19h00 à 21h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-entraide-et-bidouille---le-lundi-25-mars-2019-de-19h30-%C3%A0-21h30\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/18476\">Entraide et bidouille</a> - Le lundi 25 mars 2019 de 19h30 à 21h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-tours-rencontre-osm-tours---le-lundi-25-mars-2019-de-19h30-%C3%A0-22h00\">[FR Tours] </a><a href=\"https://www.agendadulibre.org/events/19030\">Rencontre OSM Tours</a> - Le lundi 25 mars 2019 de 19h30 à 22h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-paris-atelier-hebdomadaire-de-contribution-au-libre---le-mardi-26-mars-2019-de-10h00-%C3%A0-19h00\">[FR Paris] </a><a href=\"https://www.agendadulibre.org/events/17981\">Atelier Hebdomadaire de Contribution au Libre</a> - Le mardi 26 mars 2019 de 10h00 à 19h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-grenoble-information-collective-formation-simplon-d%C3%A9veloppeuse-web---le-mardi-26-mars-2019-de-10h00-%C3%A0-12h00\">[FR Grenoble] </a><a href=\"https://www.agendadulibre.org/events/19165\">Information Collective Formation Simplon développeuse web</a> - Le mardi 26 mars 2019 de 10h00 à 12h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-b%C3%A9ziers-expolibre-april---du-mardi-26-mars-2019-%C3%A0-10h00-au-dimanche-31-mars-2019-%C3%A0-18h00\">[FR Béziers] </a><a href=\"https://www.agendadulibre.org/events/19185\">Expolibre April</a> - Du mardi 26 mars 2019 à 10h00 au dimanche 31 mars 2019 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-sur-la-toile-webinaire-matomo-lanalytics-open-source---le-mardi-26-mars-2019-de-12h30-%C3%A0-13h30\">[FR Sur la Toile] </a><a href=\"https://www.agendadulibre.org/events/19065\">Webinaire Matomo l’analytics open source</a> - Le mardi 26 mars 2019 de 12h30 à 13h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-paris-%C3%89mission-libre-%C3%A0-vous---le-mardi-26-mars-2019-de-15h30-%C3%A0-17h00\">[FR Paris] </a><a href=\"https://www.agendadulibre.org/events/18746\">Émission Libre à vous »</a> - Le mardi 26 mars 2019 de 15h30 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-orthez-d%C3%A9couvrir-et-utiliser-linux---le-mardi-26-mars-2019-de-16h15-%C3%A0-18h00\">[FR Orthez] </a><a href=\"https://www.agendadulibre.org/events/19128\">Découvrir et utiliser Linux</a> - Le mardi 26 mars 2019 de 16h15 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-atellibre-inclusion-num%C3%A9rique---le-mardi-26-mars-2019-de-16h30-%C3%A0-18h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/19150\">Atel’libre Inclusion Numérique</a> - Le mardi 26 mars 2019 de 16h30 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-strasbourg-atelier-et-pr%C3%A9sentation-du-r%C3%A9seau-social-libre-communecter---le-mardi-26-mars-2019-de-17h00-%C3%A0-20h00\">[FR Strasbourg] </a><a href=\"https://www.agendadulibre.org/events/19090\">Atelier et présentation du réseau social libre COmmunecter</a> - Le mardi 26 mars 2019 de 17h00 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-castelnaudary-libre-en-f%C3%AAte-install-party---le-mardi-26-mars-2019-de-18h00-%C3%A0-20h00\">[FR Castelnaudary] </a><a href=\"https://www.agendadulibre.org/events/19248\">Libre en fête Install Party</a> - Le mardi 26 mars 2019 de 18h00 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-tours-permanence-adeti---le-mardi-26-mars-2019-de-18h30-%C3%A0-20h30\">[FR Tours] </a><a href=\"https://www.agendadulibre.org/events/18372\">Permanence ADeTI</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-les-pieux-install-party-gnulinux---le-mardi-26-mars-2019-de-18h30-%C3%A0-20h30\">[FR Les Pieux] </a><a href=\"https://www.agendadulibre.org/events/19083\">Install party GNU/Linux</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-rencontre-wikim%C3%A9dienne---le-mardi-26-mars-2019-de-18h30-%C3%A0-20h30\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/19253\">Rencontre wikimédienne</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-quetigny-soir%C3%A9e-lightning-talks---testons-notre-libert%C3%A9-dexpression---le-mardi-26-mars-2019-de-20h30-%C3%A0-23h30\">[FR Quetigny] </a><a href=\"https://www.agendadulibre.org/events/19174\">Soirée Lightning Talks - Testons notre liberté d'expression</a> - Le mardi 26 mars 2019 de 20h30 à 23h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lille-permanence-associative-autour-du-libre---le-mardi-26-mars-2019-de-20h30-%C3%A0-23h00\">[FR Lille] </a><a href=\"https://www.agendadulibre.org/events/19261\">Permanence associative autour du Libre</a> - Le mardi 26 mars 2019 de 20h30 à 23h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-mourenx-d%C3%A9couvrir-et-utiliser-linux---le-mercredi-27-mars-2019-de-10h00-%C3%A0-11h45\">[FR Mourenx] </a><a href=\"https://www.agendadulibre.org/events/19129\">Découvrir et utiliser Linux</a> - Le mercredi 27 mars 2019 de 10h00 à 11h45.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-b%C3%A9ziers-d%C3%A9couverte-des-distributions-gnulinux---le-mercredi-27-mars-2019-de-10h00-%C3%A0-12h00\">[FR Béziers] </a><a href=\"https://www.agendadulibre.org/events/19186\">Découverte des distributions GNU/Linux</a> - Le mercredi 27 mars 2019 de 10h00 à 12h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-le-mans-permanence-linuxmaine-du-mercredi-apr%C3%A8s-midi---le-mercredi-27-mars-2019-de-12h00-%C3%A0-17h00\">[FR Le Mans] </a><a href=\"https://www.agendadulibre.org/events/19134\">Permanence LinuXMainE du mercredi après-midi</a> - Le mercredi 27 mars 2019 de 12h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-marseille-porte-ouverte-pour-les-ateliers-num%C3%A9riques-pour-enfants---le-mercredi-27-mars-2019-de-13h30-%C3%A0-18h30\">[FR Marseille] </a><a href=\"https://www.agendadulibre.org/events/19078\">Porte ouverte pour les ateliers numériques pour enfants</a> - Le mercredi 27 mars 2019 de 13h30 à 18h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-marseille-ateliers-num%C3%A9riques-pour-enfants---le-mercredi-27-mars-2019-de-13h30-%C3%A0-17h30\">[FR Marseille] </a><a href=\"https://www.agendadulibre.org/events/19163\">Ateliers numériques pour enfants</a> - Le mercredi 27 mars 2019 de 13h30 à 17h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-vand%C5%93uvre-l%C3%A8s-nancy-jouer-%C3%A0-0-ad---empires-ascendant---le-mercredi-27-mars-2019-de-15h00-%C3%A0-17h00\">[FR Vandœuvre-lès-Nancy] </a><a href=\"https://www.agendadulibre.org/events/19099\">Jouer à 0 A.D. - Empires Ascendant</a> - Le mercredi 27 mars 2019 de 15h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lorient-pr%C3%A9sentation-de-chatons---le-mercredi-27-mars-2019-de-15h00-%C3%A0-17h00\">[FR Lorient] </a><a href=\"https://www.agendadulibre.org/events/19189\">Présentation de \"CHATONS\"</a> - Le mercredi 27 mars 2019 de 15h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-vandoeuvre-l%C3%A8s-nancy-atelierrencontre-openstreetmap---le-mercredi-27-mars-2019-de-17h30-%C3%A0-20h00\">[FR Vandoeuvre-lès-Nancy] </a><a href=\"https://www.agendadulibre.org/events/19088\">Atelier/rencontre OpenStreetMap</a> - Le mercredi 27 mars 2019 de 17h30 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-beauvais-atelier-hebdomadaire-de-partage-de-connaissances-autour-des-logiciels-libres---le-mercredi-27-mars-2019-de-18h00-%C3%A0-20h00\">[FR Beauvais] </a><a href=\"https://www.agendadulibre.org/events/17747\">Atelier hebdomadaire de partage de connaissances autour des logiciels libres</a> - Le mercredi 27 mars 2019 de 18h00 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-atellibre-bricolotech-open-bidouille---le-mercredi-27-mars-2019-de-18h30-%C3%A0-20h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/19119\">Atel’libre Bricolotech Open-Bidouille</a> - Le mercredi 27 mars 2019 de 18h30 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-grenoble-atelier-cr%C3%A9er-un-livre-num%C3%A9rique-avec-du-texte-et-un-navigateur-web---le-mercredi-27-mars-2019-de-18h30-%C3%A0-21h00\">[FR Grenoble] </a><a href=\"https://www.agendadulibre.org/events/19166\">Atelier Créer un livre numérique avec du texte et un navigateur web</a> - Le mercredi 27 mars 2019 de 18h30 à 21h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-grenoble-session-hack-du-mercredi---le-mercredi-27-mars-2019-de-19h00-%C3%A0-23h00\">[FR Grenoble] </a><a href=\"https://www.agendadulibre.org/events/19216\">Session Hack du Mercredi</a> - Le mercredi 27 mars 2019 de 19h00 à 23h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-cysoing-install-party-linux---le-mercredi-27-mars-2019-de-19h30-%C3%A0-23h30\">[FR Cysoing] </a><a href=\"https://www.agendadulibre.org/events/19176\">Install Party Linux</a> - Le mercredi 27 mars 2019 de 19h30 à 23h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lile-dyeu-d%C3%A9googlisons-internet---le-mercredi-27-mars-2019-de-20h30-%C3%A0-22h30\">[FR L'Ile d'Yeu] </a><a href=\"https://www.agendadulibre.org/events/18928\">Dégooglisons Internet</a> - Le mercredi 27 mars 2019 de 20h30 à 22h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-mourenx-d%C3%A9couvrir-les-logiciels-libres-pour-pc-et-smartphone---le-jeudi-28-mars-2019-de-14h00-%C3%A0-15h45\">[FR Mourenx] </a><a href=\"https://www.agendadulibre.org/events/19127\">Découvrir les logiciels libres pour PC et smartphone</a> - Le jeudi 28 mars 2019 de 14h00 à 15h45.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-bordeaux-jeudi-giroll---le-jeudi-28-mars-2019-de-18h30-%C3%A0-20h30\">[FR Bordeaux] </a><a href=\"https://www.agendadulibre.org/events/18135\">Jeudi Giroll</a> - Le jeudi 28 mars 2019 de 18h30 à 20h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-a-la-d%C3%A9couverte-de-nextcloud---le-jeudi-28-mars-2019-de-19h00-%C3%A0-21h30\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/17126\">A la découverte de Nextcloud</a> - Le jeudi 28 mars 2019 de 19h00 à 21h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-parcoursup---le-jeudi-28-mars-2019-de-19h00-%C3%A0-21h00\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/18911\">ParcourSup</a> - Le jeudi 28 mars 2019 de 19h00 à 21h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-nanterre-table-ronde-lib%C3%A9rons-la-livraison-%C3%A0-v%C3%A9lo---le-jeudi-28-mars-2019-de-19h00-%C3%A0-21h00\">[FR Nanterre] </a><a href=\"https://www.agendadulibre.org/events/18975\">Table ronde Libérons la livraison à vélo</a> - Le jeudi 28 mars 2019 de 19h00 à 21h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-grenoble-session-hack-du-jeudi---le-jeudi-28-mars-2019-de-19h00-%C3%A0-23h00\">[FR Grenoble] </a><a href=\"https://www.agendadulibre.org/events/19230\">Session Hack du Jeudi</a> - Le jeudi 28 mars 2019 de 19h00 à 23h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-paris-soir%C3%A9e-de-contribution-au-libre-et-contribatelier-de-framasoft---le-jeudi-28-mars-2019-de-19h30-%C3%A0-22h00\">[FR Paris] </a><a href=\"https://www.agendadulibre.org/events/18195\">Soirée de Contribution au Libre et contrib'atelier de Framasoft</a> - Le jeudi 28 mars 2019 de 19h30 à 22h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-mozilla-firefox-pour-les-d%C3%A9butants---le-vendredi-29-mars-2019-de-14h00-%C3%A0-16h00\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/18660\">Mozilla Firefox pour les débutants</a> - Le vendredi 29 mars 2019 de 14h00 à 16h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-clermont-de-loise-atelier-mensuel-de-sensibilisation-et-de-partage-de-connaissances-autour-des-logiciels-libres---le-vendredi-29-mars-2019-de-14h00-%C3%A0-16h30\">[FR Clermont de l'Oise] </a><a href=\"https://www.agendadulibre.org/events/18511\">Atelier mensuel de sensibilisation et de partage de connaissances autour des logiciels libres</a> - Le vendredi 29 mars 2019 de 14h00 à 16h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-rennes-conf%C3%A9rence-le-logiciel-libre-face-%C3%A0-linformatique---richard-stallman---le-vendredi-29-mars-2019-de-16h30-%C3%A0-19h00\">[FR Rennes] </a><a href=\"https://www.agendadulibre.org/events/19246\">Conférence Le logiciel libre face à l'informatique - Richard Stallman</a> - Le vendredi 29 mars 2019 de 16h30 à 19h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-d%C3%A9googlisons-nous---le-vendredi-29-mars-2019-de-17h00-%C3%A0-19h00\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/18666\">Dégooglisons-nous</a> - Le vendredi 29 mars 2019 de 17h00 à 19h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-permanence-les-logiciels-libres-parlons-en---le-vendredi-29-mars-2019-de-17h00-%C3%A0-19h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/19122\">Permanence Les logiciels libres, parlons-en</a> - Le vendredi 29 mars 2019 de 17h00 à 19h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-formation-signature-de-cl%C3%A9s-pgp-key-signing-party---le-vendredi-29-mars-2019-de-17h00-%C3%A0-18h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/19192\">Formation Signature de clés PGP, Key signing party</a> - Le vendredi 29 mars 2019 de 17h00 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-be-antoing-install-party---le-vendredi-29-mars-2019-de-18h00-%C3%A0-20h00\">[BE Antoing] </a><a href=\"https://www.agendadulibre.org/events/19247\">Install-Party</a> - Le vendredi 29 mars 2019 de 18h00 à 20h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-insming-fracture-num%C3%A9rique-et-sociale-recours-aux-logiciels-libres-et-gratuits---le-vendredi-29-mars-2019-de-20h00-%C3%A0-22h00\">[FR Insming] </a><a href=\"https://www.agendadulibre.org/events/19087\">Fracture numérique et sociale recours aux logiciels libres et gratuits</a> - Le vendredi 29 mars 2019 de 20h00 à 22h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-sizun-cartopartie-%C3%A0-sizun---le-samedi-30-mars-2019-de-09h00-%C3%A0-17h00\">[FR Sizun] </a><a href=\"https://www.agendadulibre.org/events/19255\">Cartopartie à Sizun</a> - Le samedi 30 mars 2019 de 09h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-beauvais-les-solutions-alternatives-framasoftorg---le-samedi-30-mars-2019-de-09h30-%C3%A0-10h00\">[FR Beauvais] </a><a href=\"https://www.agendadulibre.org/events/18515\">Les solutions alternatives Framasoft.org</a> - Le samedi 30 mars 2019 de 09h30 à 10h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-kergrist-mo%C3%ABlou-journ%C3%A9e-de-rencontre-le-num%C3%A9rique-%C3%A7a-nous-regarde---le-samedi-30-mars-2019-de-09h30-%C3%A0-16h30\">[FR Kergrist-Moëlou] </a><a href=\"https://www.agendadulibre.org/events/18919\">Journée de rencontre \"Le numérique, ça nous regarde\"</a> - Le samedi 30 mars 2019 de 09h30 à 16h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lyon-technique-de-cartographie-et-d%C3%A9dition---le-samedi-30-mars-2019-de-10h00-%C3%A0-12h00\">[FR Lyon] </a><a href=\"https://www.agendadulibre.org/events/17191\">Technique de cartographie et d’édition</a> - Le samedi 30 mars 2019 de 10h00 à 12h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-nanterre-%C3%89thique-et-philosophie-des-logiciels-libres-en-d%C3%A9mocratie-num%C3%A9rique---le-samedi-30-mars-2019-de-10h00-%C3%A0-12h30\">[FR Nanterre] </a><a href=\"https://www.agendadulibre.org/events/18976\">Éthique et philosophie des logiciels libres en démocratie numérique</a> - Le samedi 30 mars 2019 de 10h00 à 12h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-rouen-journ%C3%A9e-mensuelle-du-logiciel-libre---le-samedi-30-mars-2019-de-14h00-%C3%A0-18h00\">[FR Rouen] </a><a href=\"https://www.agendadulibre.org/events/19044\">Journée Mensuelle du Logiciel Libre</a> - Le samedi 30 mars 2019 de 14h00 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-be-grivegn%C3%A9e-linux-install-party---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[BE Grivegnée] </a><a href=\"https://www.agendadulibre.org/events/17323\">Linux Install Party</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-marseille-install-party-gnulinux---le-samedi-30-mars-2019-de-14h00-%C3%A0-19h00\">[FR Marseille] </a><a href=\"https://www.agendadulibre.org/events/17358\">Install Party GNU/Linux</a> - Le samedi 30 mars 2019 de 14h00 à 19h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-alen%C3%A7on-journ%C3%A9e-du-libre---du-samedi-30-mars-2019-%C3%A0-14h00-au-dimanche-31-mars-2019-%C3%A0-01h00\">[FR Alençon] </a><a href=\"https://www.agendadulibre.org/events/18494\">Journée (du) Libre</a> - Du samedi 30 mars 2019 à 14h00 au dimanche 31 mars 2019 à 01h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-schiltigheim-install-party-linux---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[FR Schiltigheim] </a><a href=\"https://www.agendadulibre.org/events/18775\">Install Party Linux</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-saint-cyr-l%C3%89cole-permanence-root66---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[FR Saint-Cyr-l'École] </a><a href=\"https://www.agendadulibre.org/events/18840\">Permanence Root66</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-caen-install-party-gnulinux---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[FR Caen] </a><a href=\"https://www.agendadulibre.org/events/19025\">Install Party GNU/Linux</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-be-grivegn%C3%A9e-linux-install-party-li%C3%A8ge---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[BE Grivegnée] </a><a href=\"https://www.agendadulibre.org/events/19154\">Linux Install Party Liège</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-lorient-atelier-dinitiation-%C3%A0-wikip%C3%A9dia---le-samedi-30-mars-2019-de-14h00-%C3%A0-18h00\">[FR Lorient] </a><a href=\"https://www.agendadulibre.org/events/19190\">Atelier d'initiation à Wikipédia</a> - Le samedi 30 mars 2019 de 14h00 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-b%C3%A9ziers-atellibre-grappe-de-bureau---le-samedi-30-mars-2019-de-14h00-%C3%A0-17h00\">[FR Béziers] </a><a href=\"https://www.agendadulibre.org/events/19193\">Atel’libre Grappe de bureau</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-ivry-sur-seine-cours-de-lecole-du-logiciel-libre---le-samedi-30-mars-2019-de-14h30-%C3%A0-18h30\">[FR Ivry sur Seine] </a><a href=\"https://www.agendadulibre.org/events/18802\">Cours de l'Ecole du Logiciel Libre</a> - Le samedi 30 mars 2019 de 14h30 à 18h30.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-vand%C5%93uvre-l%C3%A8s-nancy-installer-un-raspberry-pi---le-samedi-30-mars-2019-de-15h00-%C3%A0-17h00\">[FR Vandœuvre-lès-Nancy] </a><a href=\"https://www.agendadulibre.org/events/19094\">Installer un Raspberry Pi</a> - Le samedi 30 mars 2019 de 15h00 à 17h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-assier-libre-en-f%C3%AAte-soir%C3%A9e-sur-les-logiciels-libres---le-samedi-30-mars-2019-de-20h30-%C3%A0-23h59\">[FR Assier] </a><a href=\"https://www.agendadulibre.org/events/19024\">Libre en fête. Soirée sur les logiciels libres.</a> - Le samedi 30 mars 2019 de 20h30 à 23h59.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-montpellier-ateliers-ouverts---le-dimanche-31-mars-2019-de-10h00-%C3%A0-18h00\">[FR Montpellier] </a><a href=\"https://www.agendadulibre.org/events/18733\">Ateliers ouverts</a> - Le dimanche 31 mars 2019 de 10h00 à 18h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-figeac-install-party---le-dimanche-31-mars-2019-de-10h30-%C3%A0-13h00\">[FR Figeac] </a><a href=\"https://www.agendadulibre.org/events/19140\">Install party</a> - Le dimanche 31 mars 2019 de 10h30 à 13h00.</li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-fr-palaiseau-rencontre-monnaie-libre-et-%C4%9E1---le-dimanche-31-mars-2019-de-16h00-%C3%A0-18h00\">[FR Palaiseau] </a><a href=\"https://www.agendadulibre.org/events/19254\">Rencontre Monnaie Libre et Ğ1</a> - Le dimanche 31 mars 2019 de 16h00 à 18h00.</li>\n</ul>\n</li>\n</ul>\n<h3>[FR Limoges] <a href=\"https://www.agendadulibre.org/events/18903\">Mois du Logiciel Libre 13ème édition</a> - Du vendredi  1 mars 2019 à 10h00 au samedi 30 mars 2019 à 18h00.</h3>\n\n<p><a href=\"http://bfm.limoges.fr/sites/default/files/styles/evenement/public/mdll2018.png?itok=xaKJYxRf\"></a>La Bfm vous invite à découvrir <strong><em>Expolibre</em></strong>, une expostion sur la philosophie et les enjeux du logiciel libre, réalisée par l'APRIL.</p>\n\n<p>Un logiciel libre est un logiciel dont l'utilisation, l'étude, la modification et la duplication en vue de sa diffusion sont permises, techniquement et légalement, afin de garantir certaines libertés, dont le contrôle du programme par l'utilisateur et la possibilité de partage entre individus.</p>\n\n<p>En marge de l'exposition et dans le cadre du MOIS DU LOGICIEL LIBRE</p>\n\n<ul>\n<li>samedi 2 mars à 14h30 <a href=\"http://bfm.limoges.fr/evenement/entraide-party-special-logiciels-libres-0\">Entraide Party \"Spécial logiciels libres\"</a>\n</li>\n<li>samedi 9 mars à 14h30 <a href=\"http://bfm.limoges.fr/evenement/vie-privee-et-internet-derriere-les-derniers-scandales\">\"Vie privée et Internet derrière les derniers scandales\",</a> une conférence de Stéphane Bortzmeyer</li>\n<li>samedi 16 mars de 10h à 17h <a href=\"http://bfm.limoges.fr/evenement/install-party\">Install Party</a>\n</li>\n<li><p>samedi 23 mars à 14h <a href=\"http://bfm.limoges.fr/evenement/presentation-darduino-et-raspberry-pi\">Présentation d'Arduino et Raspberry Pi</a></p></li>\n<li><p>Bibliothèque francophone multimédia - Espace multimédia, 2 place Aimé Césaire, Limoges, Nouvelle-Aquitaine, France</p></li>\n<li><p><a href=\"http://bfm.limoges.fr/evenement/expolibre\">http://bfm.limoges.fr/evenement/expolibre</a></p></li>\n<li><p><a href=\"https://www.agendadulibre.org/tags/expolibre\">expolibre</a>, <a href=\"https://www.agendadulibre.org/tags/april\">april</a>, <a href=\"https://www.agendadulibre.org/tags/bfm\">bfm</a>, <a href=\"https://www.agendadulibre.org/tags/exposition\">exposition</a>, <a href=\"https://www.agendadulibre.org/tags/mois-du-logiciel-libre\">mois-du-logiciel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a></p></li>\n</ul>\n<h3>[FR Villeneuve d'Ascq] <a href=\"https://www.agendadulibre.org/events/19028\">Expolibre, pour découvrir le logiciel libre</a> - Du vendredi  1 mars 2019 à 16h00 au mardi 16 avril 2019 à 16h00.</h3>\n\n<p>L’<a href=\"http://www.omjc-info.fr/\">OMJC de Villeneuve-d’Ascq</a> vous propose de découvrir <strong><a href=\"https://www.expolibre.org/\">Expolibre</a></strong>, une exposition sur la philosophie et les enjeux du logiciel libre, réalisée par l'<a href=\"https://www.april.org/\">APRIL</a> et diffusée pour populariser son utilisation par le grand public.</p>\n\n<p>Vous découvrirez qu'un <strong>logiciel libre</strong> est un logiciel dont l’utilisation, l’étude, la modification et la duplication en vue de sa diffusion sont permises, techniquement et légalement, afin de garantir certaines libertés, dont le contrôle du programme par l’utilisateur et la possibilité de partage entre individus.</p>\n\n<ul>\n<li>OMJC Centre d'Infos Jeunes, Ferme Dupire, rue Yves Decugis, Villeneuve d'Ascq, Hauts-de-France, France</li>\n<li><a href=\"http://www.omjc-info.fr/\">http://www.omjc-info.fr/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/omjc\">omjc</a>, <a href=\"https://www.agendadulibre.org/tags/libre-%C3%A0-vous\">libre-à-vous</a>, <a href=\"https://www.agendadulibre.org/tags/cij\">cij</a>, <a href=\"https://www.agendadulibre.org/tags/informatique\">informatique</a>, <a href=\"https://www.agendadulibre.org/tags/medias\">medias</a>, <a href=\"https://www.agendadulibre.org/tags/culture\">culture</a>, <a href=\"https://www.agendadulibre.org/tags/information\">information</a>, <a href=\"https://www.agendadulibre.org/tags/april\">april</a>, <a href=\"https://www.agendadulibre.org/tags/expolibre\">expolibre</a>, <a href=\"https://www.agendadulibre.org/tags/clx\">clx</a>\n</li>\n</ul>\n<h3>[FR Nanterre] <a href=\"https://www.agendadulibre.org/events/18969\">Expo libre</a> - Du lundi  4 mars 2019 à 10h00 au samedi 30 mars 2019 à 18h00.</h3>\n\n<p>Dans le cadre de \"<strong>Libre en fête\"</strong>.</p>\n\n<p>Le centre social et culturel Les Acacias accueille <strong>l'expo Libre</strong> pour sensibiliser les habitants du quartier à l'usage des <strong>logiciels libres</strong>.</p>\n\n<ul>\n<li>Centre social et culturel Les Acacias, 1 bis rue des sorbiers, Nanterre, Île-de-France, France</li>\n<li><a href=\"http://csclesacacias.com/\">http://csclesacacias.com</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/expolibre\">expolibre</a>, <a href=\"https://www.agendadulibre.org/tags/exposition\">exposition</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/les-acacias\">les-acacias</a>\n</li>\n</ul>\n<h3>[FR Nanterre] <a href=\"https://www.agendadulibre.org/events/18970\">Sélection d'ouvrages sur la culture libre</a> - Du lundi  4 mars 2019 à 14h00 au samedi 30 mars 2019 à 18h00.</h3>\n\n<p>Dans le cadre de Libre en fête.</p>\n\n<p>La médiathèque Pierre et Marie Curie proposera une sélection d'ouvrages sur la culture libre, issus de son fonds.</p>\n\n<ul>\n<li>Médiathèque Pierre et Marie Curie, 5 place de l’Hôtel de ville, Nanterre, Île-de-France, France</li>\n<li><a href=\"https://mediatheques-nanterre.fr/iguana/www.main.cls\">https://mediatheques-nanterre.fr/iguana/www.main.cls</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/bibliotheque\">bibliotheque</a>, <a href=\"https://www.agendadulibre.org/tags/livre\">livre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/culture-libre\">culture-libre</a>\n</li>\n</ul>\n<h3>[FR Lorient] <a href=\"https://www.agendadulibre.org/events/19191\">Présentation de l'association Framasoft</a> - Du lundi  4 mars 2019 à 16h00 au vendredi 29 mars 2019 à 17h00.</h3>\n\n<ul>\n<li>Espace multimédia PLL, 80 avenue Général de Gaulle, Lorient, Bretagne, France</li>\n<li><a href=\"https://framasoft.org/fr/\">https://framasoft.org/fr/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/framasoft\">framasoft</a>, <a href=\"https://www.agendadulibre.org/tags/pr%C3%A9sentation\">présentation</a>\n</li>\n</ul>\n<h3>[FR Rezé] <a href=\"https://www.agendadulibre.org/events/19003\">Exposition sur le Libre</a> - Du lundi 25 mars 2019 à 10h00 au vendredi  5 avril 2019 à 18h00.</h3>\n\n<p>Exposition sur le Libre du 25 mars au 5 avril inclut (sauf le dimanche) au sein du local de la Bonneterie, ancienne usine Rezéenne remise à neuf par des acteurs locaux.</p>\n\n<p>L'exposition est organisée par Nâga, association de reconditionnement d'ordinateurs sous Linux et de promotion du Libre.</p>\n\n<p>La localisation trompe de nombreux GPS Retrouvez le plan en bas de page du site <a href=\"https://www.naga44.org/\">https://www.naga44.org</a>.</p>\n\n<ul>\n<li>La bonneterie, 17 chemin Fontaine Launay, Rezé, Pays de la Loire, France</li>\n<li><a href=\"https://www.naga44.org/\">https://www.naga44.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/exposition\">exposition</a>, <a href=\"https://www.agendadulibre.org/tags/naga\">naga</a>, <a href=\"https://www.agendadulibre.org/tags/reconditionnement\">reconditionnement</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/19188\">Atel’libre Centre d’Expérimentations et d’Innovation Sociale</a> - Le lundi 25 mars 2019 de 10h00 à 12h00.</h3>\n\n<p><a href=\"http://montpellibre.fr/spip.php?article2787\"></a>Ces Atel’libres se déroulent au Centre d’Expérimentations et d’Innovation Sociale sur les lieux du Centre Communal d’Action Sociale de Montpellier.</p>\n\n<p><strong>Atel’libre tout public avec des logiciels libres</strong></p>\n\n<ul>\n<li>Lundi 18 mars de 10h à 12h Comment fonctionne mon ordinateur. Comment marche internet.</li>\n<li>Lundi 25 mars de 10h à 12h Naviguer en toute sécurité sur internet</li>\n</ul>\n<p><a href=\"https://montpellibre.fr/\"></a></p>\n\n<p>Entrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie le <a href=\"https://www.montpellier.fr/273-le-centre-communal-d-action-sociale-ccas-.htm\"><strong>CCAS</strong></a>, la <a href=\"https://www.montpellier.fr/\"><strong>Ville de Montpellier</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Lundis 18 et 25 mars 2019 de 10h00 à 12h00<br>\n8, rue Jacques Draparnaud, 34000 Montpellier<br><a href=\"http://montpellibre.fr/spip.php?article2787\">Inscription nécessaire</a></p>\n\n<ul>\n<li>Centre Communal d’Action Sociale de Montpellier, 8 rue Jacques Draparnaud, Montpellier, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/atelibre\">atelibre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Strasbourg] <a href=\"https://www.agendadulibre.org/events/19089\">Atelier et présentation du réseau social libre COmmunecter</a> - Le lundi 25 mars 2019 de 17h00 à 20h00.</h3>\n\n<p>Dans la joie et la bonne humeur nous vous proposons de</p>\n\n<ul>\n<li>DÉCOUVRIR la plateforme contributive éthique <a href=\"https://communecter.org/\">COmmunecter</a>\n</li>\n<li>CONTRIBUER au <a href=\"https://news.defricheurs.fr/carte/\">référencement des acteurs locaux</a>\n</li>\n<li>CRÉER une carte intégrable sur le site de votre association</li>\n<li><p>PARTICIPER à la diffusion de cette carte sur Strasbourg</p></li>\n<li><p>EELV, 7 rue de l'Épine, Strasbourg, Grand Est, France</p></li>\n<li><p><a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/carto-partie\">carto-partie</a>, <a href=\"https://www.agendadulibre.org/tags/cartographie\">cartographie</a>, <a href=\"https://www.agendadulibre.org/tags/r%C3%A9seaux-sociaux\">réseaux-sociaux</a>, <a href=\"https://www.agendadulibre.org/tags/communecter\">communecter</a></p></li>\n</ul>\n<h3>[FR Paris] <a href=\"https://www.agendadulibre.org/events/18657\">Espéranto – langue libre</a> - Le lundi 25 mars 2019 de 19h00 à 20h30.</h3>\n\n<p>L’espéranto dans le monde du libre, son apport pour les communautés et comment les logiciels libres contribuent au développement de l’espéranto.</p>\n\n<p>Venez en discuter et profiter d’un <strong>mini-cours gratuit</strong> pour découvrir la langue.</p>\n\n<p>Lundi 25 mars 2018 à 19h00.</p>\n\n<p>Espéranto Paris Île-de-France<br>\n4bis rue de la Cerisaie<br>\n(entrée à l’angle de la rue Jacques Cœur)<br>\n75004 Paris<br>\n(métro Bastille ou Sully-Morland)</p>\n\n<p>Entrée libre.</p>\n\n<ul>\n<li>Espéranto Paris Île-de-France, 4bis rue de la Cerisaie, Paris, Île-de-France, France</li>\n<li><a href=\"https://esperanto.paris/\">https://esperanto.paris</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/esp%C3%A9ranto\">espéranto</a>, <a href=\"https://www.agendadulibre.org/tags/cours\">cours</a>\n</li>\n</ul>\n<h3>[FR Grenoble] <a href=\"https://www.agendadulibre.org/events/18994\">Atelier Exploration ludique de Node.js</a> - Le lundi 25 mars 2019 de 19h00 à 21h30.</h3>\n\n<p>Avec Node.js, on peut créer des sites web (dynamiques et statiques), partager des données avec API, interroger des bases de données, transformer des fichiers, créer des applications mobile et de bureau (native et desktop), outiller le développement frontend et même développer ses propres outils.</p>\n\n<p>JavaScript est un langage mâture, populaire et versatile. <strong>Node.js est une interface JavaScript avec nos systèmes d’exploitation</strong>. Sa structure flexible et la richesse de l’<a href=\"https://npmjs.com/\">écosystème npm</a> en font un choix intéressant pour mettre en ligne quelque chose rapidement.</p>\n\n<p>Cet événement est un <strong>atelier collaboratif</strong>: le programme est composé sur place avec les souhaits exprimés par les participant·es de l’atelier, à partir des sujets/interrogations qui vous tiennent à cœur.</p>\n\n<p>À la fin de la soirée, tu repars avec de nouvelles connaissances en programmation, des réponses à tes questions, de nouveaux outils, des pistes qui te sortent d’une situation complexe et de quoi nourrir tes réflexions.</p>\n\n<p><strong>A qui ça s’adresse</strong></p>\n\n<ul>\n<li>Des étudiant·e en informatique</li>\n<li>Des développeur·se frontend</li>\n<li>Des web designer</li>\n<li>Des UX designer</li>\n<li>Des personnes qui se sentent pas, peu ou moyennement à l’aise avec JavaScript et/ou Node.js</li>\n</ul>\n<p><a href=\"https://www.eventbrite.fr/e/billets-atelier-exploration-ludique-de-nodejs-56918707386\">Je m'inscris</a></p>\n\n<ul>\n<li>La Coop Infolab, 31 rue Gustave Eiffel, Grenoble, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://www.eventbrite.fr/e/billets-atelier-exploration-ludique-de-nodejs-56918707386\">https://www.eventbrite.fr/e/billets-atelier-exploration-ludique-de-nodejs-56918707386</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/node\">node</a>, <a href=\"https://www.agendadulibre.org/tags/nodejs\">nodejs</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/la-coop\">la-coop</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/18476\">Entraide et bidouille</a> - Le lundi 25 mars 2019 de 19h30 à 21h30.</h3>\n\n<p>Les adhérents de l’ALDIL proposent leur aide pour faciliter votre utilisation des logiciels libres et enrichir leurs connaissances en retour.</p>\n\n<p>Vous pouvez indiquez le but de votre venue par avance à l’ALDIL (problèmes, questions)  via le <a href=\"https://www.aldil.org/agenda-activites/nos-activites/bidouilles/inscriptions-aux-bidouilles/\">formulaire de la rubrique Activités / Bidouilles</a>.</p>\n\n<ul>\n<li>MJC Montchat, 53 rue Charles Richard, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://aldil.org/\">https://aldil.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/aldil\">aldil</a>, <a href=\"https://www.agendadulibre.org/tags/bidouille\">bidouille</a>, <a href=\"https://www.agendadulibre.org/tags/entraide\">entraide</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/mjc-montchat\">mjc-montchat</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Tours] <a href=\"https://www.agendadulibre.org/events/19030\">Rencontre OSM Tours</a> - Le lundi 25 mars 2019 de 19h30 à 22h00.</h3>\n\n<p>Rencontre des utilisateurs et/ou personnes intéressées de Tours et d'Indre-et-Loire de l'outil de cartographie libre et participatif OpenStreetMap.</p>\n\n<p><strong>Venez nombreux-)</strong></p>\n\n<ul>\n<li>Artefacts, pépinière du Sanitas, 30 rue André Theuriet, Tours, Centre-Val de Loire, France</li>\n<li><a href=\"https://wiki.openstreetmap.org/wiki/FR:Tours\">https://wiki.openstreetmap.org/wiki/FR:Tours</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/osm\">osm</a>, <a href=\"https://www.agendadulibre.org/tags/openstreetmap\">openstreetmap</a>, <a href=\"https://www.agendadulibre.org/tags/libre\">libre</a>, <a href=\"https://www.agendadulibre.org/tags/cartographie\">cartographie</a>, <a href=\"https://www.agendadulibre.org/tags/open-data\">open-data</a>\n</li>\n</ul>\n<h3>[FR Paris] <a href=\"https://www.agendadulibre.org/events/17981\">Atelier Hebdomadaire de Contribution au Libre</a> - Le mardi 26 mars 2019 de 10h00 à 19h00.</h3>\n\n<p>Une journée de co-travail sur le thème de la contribution au logiciel libre.</p>\n\n<p>Chacun vient avec son sujet individuel avec l'intention d'y travailler au cotés d'autres contributrices/teurs.</p>\n\n<p>Le prix d'entrée est de 25 euros pour la journée (tarif Narma).</p>\n\n<ul>\n<li>Narma, 34-36 rue du Château d’Eau, Paris, Île-de-France, France</li>\n<li><a href=\"https://www.narmare-coworking.fr/\">https://www.narmare-coworking.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/contribution\">contribution</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>\n</li>\n</ul>\n<h3>[FR Grenoble] <a href=\"https://www.agendadulibre.org/events/19165\">Information Collective Formation Simplon développeuse web</a> - Le mardi 26 mars 2019 de 10h00 à 12h00.</h3>\n\n<p><strong>Une formation simplon développeuse web 100 féminine</strong></p>\n\n<p><strong>Simplon propose des formations aux métiers du numérique</strong> (développeur web, référent digital, e-commerce, webmaster, technicien data, devops…)<strong>, gratuites et intensives pour des personnes peu représentées dans ce secteur</strong>: jeunes peu ou pas diplômés, demandeurs d’emploi de longue durée, allocataires du RSA, personnes en situation de handicap ou encore réfugiés etc…</p>\n\n<p><strong>Une attention toute particulière est portée aux femmes qui représentent moins de 30 des effectifs</strong></p>\n\n<p>En bientôt 6 ans, plus de 3500 personnes ont été formées (dont 35 de femmes), avec un taux de retour à l’emploi proche de 80. Aujourd’hui présent dans plus de 40 villes en France et dans 15 pays, Simplon.co poursuit le développement de son impact social.</p>\n\n<p>A Grenoble, nous ouvrons une nouvelle formation Développeuse Web 100 féminine, financée par la Grande Ecole du Numérique et Opcalia dans le cadre du Plan d’Investissement dans les Compétences.</p>\n\n<p><strong>Venez poser vos questions et vous renseigner lors de notre réunion d’information collective qui aura lieu le mardi 26 mars 2019 à 10h à la Coop Infolab – 31, rue Gustave Eiffel – 38000 Grenoble.</strong></p>\n\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfrr1Oj70VEEqjQeYnd4VlpUbHKEsBipZsnj7Zsy0m8A0qzVQ/viewform\"><strong>Je m’inscris à l’information collective</strong></a></p>\n\n<p><strong>A propos de la formation Simplon développeuse web 100 féminine</strong></p>\n\n<p>Ce que nous proposons des connaissances techniques pour être directement opérationnel en entreprise et un solide accompagnement vers l’emploi pour 20 passionnées de programmation web. La formation aura lieu du du 01 juillet 2019 au 21 février 2020, 8 mois de formation à raison de 35h hebdomadaires dont 4 semaines de stage en entreprise. Lieu Simplon Grenoble – 11 rue Emile Zola – 38000 Grenoble</p>\n\n<ul>\n<li>Voir le<a href=\"https://www.facebook.com/brutofficiel/videos/257338708456109/?v=257338708456109\"> témoignage vidéo </a>d’une femme ayant suivi la formation simplon.</li>\n<li>Télécharger la <a href=\"https://la-coop.net/wp-content/uploads/2019/02/Fiche-candidats-prescripteurs-Hackeuses-1.pdf\">fiche info sur la formation (pdf)</a>\n</li>\n<li>Pour candidater rendez-vous sur <a href=\"https://simplon.co/grenoble/\">https://simplon.co/grenoble/</a> !</li>\n</ul>\n<p><strong>Simplon.co</strong> est une entreprise sociale en forte croissance engagée pour un numérique inclusif et solidaire. Labellisée French Tech, La France s’Engage, Ashoka, EPIC et constituant le plus grand et le plus inclusif des réseaux de la Grande École du Numérique.</p>\n\n<ul>\n<li>La Coop Infolab, 31 rue Gustave Eiffel, Grenoble, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://la-coop.net/evenement/information-coll-formation-simplon-developpeuse/\">https://la-coop.net/evenement/information-coll-formation-simplon-developpeuse/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/simplon\">simplon</a>, <a href=\"https://www.agendadulibre.org/tags/formation\">formation</a>, <a href=\"https://www.agendadulibre.org/tags/la-coop\">la-coop</a>, <a href=\"https://www.agendadulibre.org/tags/web\">web</a>\n</li>\n</ul>\n<h3>[FR Béziers] <a href=\"https://www.agendadulibre.org/events/19185\">Expolibre April</a> - Du mardi 26 mars 2019 à 10h00 au dimanche 31 mars 2019 à 18h00.</h3>\n\n<p><a href=\"http://montpel-libre.fr/spip.php?article2787\"></a>Expolibre par l’April, association de promotion et de défense du logiciel libre, dans les espaces de la MAM.</p>\n\n<p>Tout ce qu’il faut savoir aujourd’hui sur la philosophie du logiciel libre et les enjeux de société liés à cette révolution informatique.</p>\n\n<p>Montpel'libre vous proposera une visite guidée de cette exposition lors de la semaine du Libre de Béziers. Renseignez-vous à l'accueil.</p>\n\n<p>L’<a href=\"http://www.expolibre.org/\"><strong>Expolibre</strong></a> est un outil de sensibilisation aux enjeux du logiciel libre publié sous licence Créative commons BY-SA. Cette exposition consacrée au logiciel libre comporte 10 panneaux. Vous pouvez les télécharger dans différents formats sur le site.</p>\n\n<p><a href=\"http://www.expolibre.org/\"></a></p>\n\n<p>Entrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie la <a href=\"http://www.mediatheque-beziers-agglo.org/\"><strong>Médiathèque de Béziers</strong></a>, <a href=\"https://lagglo.fr/\"><strong>l’Agglo de Béziers</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Mardi 26 mars au dimanche 31 mars 2019 de 10h00 à 18h00<br>\nMédiathèque André Malraux - Place du 14 juillet 34500 Béziers</p>\n\n<ul>\n<li>Médiathèque André Malraux, place du 14 juillet, Béziers, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/expolibre\">expolibre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Sur la Toile] <a href=\"https://www.agendadulibre.org/events/19065\">Webinaire Matomo l’analytics open source</a> - Le mardi 26 mars 2019 de 12h30 à 13h30.</h3>\n\n<p>Matomo, l’alternative open source à Google Analytics, propose une solution complète avec une plateforme ergonomique, les données d’analytics, un tag manager, pas d’échantillonnage, le respect de la vie privée, des données qui vous appartiennent en totalité…</p>\n\n<p>Présentation de cet outil par <a href=\"https://www.linkedin.com/in/ronanchardonneau/\">Ronan Chardonneau, </a>consultant analytics depuis 7 ans, conférencier, auteur de plusieurs livres sur l’analytics… et membre de l'Alliance Libre.</p>\n\n<p>Inscription obligatoire auprès de Webassoc pour participer au webinaire <a href=\"https://docs.google.com/forms/d/e/1FAIpQLSe7V7NPQRf4FGbmZTrfOe3MOohB87Ku61N_IhcN2aGkcA9nzw/viewform\">https://docs.google.com/forms/d/e/1FAIpQLSe7V7NPQRf4FGbmZTrfOe3MOohB87Ku61N_IhcN2aGkcA9nzw/viewform</a></p>\n\n<ul>\n<li>Sur la Toile</li>\n<li><a href=\"https://www.webassoc.org/events/matomo-190326\">https://www.webassoc.org/events/matomo-190326</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/matomo\">matomo</a>, <a href=\"https://www.agendadulibre.org/tags/site-web\">site-web</a>\n</li>\n</ul>\n<h3>[FR Paris] <a href=\"https://www.agendadulibre.org/events/18746\">Émission Libre à vous »</a> - Le mardi 26 mars 2019 de 15h30 à 17h00.</h3>\n\n<p><strong>L'émission <em>Libre à vous</em> de l'April est diffusée chaque mardi de 15 h 30 à 17 h sur radio Cause Commune sur la bande FM en région parisienne (93.1) et sur le <a href=\"https://cause-commune.fm/\">site web de la radio</a>. Et l'émission est rediffusée le soir même de 21 h à 22 h 30. Le podcast est disponible rapidement après la diffusion de l'émission.</strong></p>\n\n<p><strong>Les ambitions de l'émission <em>Libre à vous</em></strong></p>\n\n<p>La radio Cause commune a commencé à émettre fin 2017 sur la bande FM en région parisienne (93.1) et sur Internet.</p>\n\n<p>Sur le site de la radio on lit <em>Radio associative et citoyenne, les missions de Cause Commune sont de fédérer toutes les initiatives autour du partage et de l’échange de savoirs, de cultures et de techniques</em>.</p>\n\n<p>Nous avons alors proposé de tenir une émission April intitulée <em>Libre à Vous</em> d'explications et d'échanges concernant les dossiers politiques et juridiques que l'association traite et les actions qu'elle mène.</p>\n\n<p>Une partie de l'émission est également consacrée aux actualités et actions de type sensibilisation.</p>\n\n<p>L'émission <em>Libre à vous</em> est principalement animée par l'équipe salariée de l'April mais aussi par des membres bénévoles de l'association et des personnes invitées.</p>\n\n<p>Donner à chacun et chacune, de manière simple et accessible, les clefs pour comprendre les enjeux mais aussi proposer des moyens d'action, tel est l'objectif de cette émission mensuelle, qui est diffusée en direct chaque mardi du mois de 15 h 30 à 17 h. Et rediffusée le soir même de 21 h à 22 h 30.</p>\n\n<p>L'émission dispose d'un <a href=\"https://april.org/lav.xml\">flux RSS compatible avec la baladodiffusion</a> ainsi qu'un <a href=\"https://talk.libre-a-toi.org/channel/libreavous\">salon dédié sur le webchat de la radio</a>.</p>\n\n<ul>\n<li>Radio Cause Commune, 22 rue Bernard Dimey, Paris, Île-de-France, France</li>\n<li><a href=\"https://april.org/libre-a-vous\">https://april.org/libre-a-vous</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/april\">april</a>, <a href=\"https://www.agendadulibre.org/tags/radio\">radio</a>, <a href=\"https://www.agendadulibre.org/tags/cause-commune\">cause-commune</a>, <a href=\"https://www.agendadulibre.org/tags/libre-%C3%A0-vous\">libre-à-vous</a>\n</li>\n</ul>\n<h3>[FR Orthez] <a href=\"https://www.agendadulibre.org/events/19128\">Découvrir et utiliser Linux</a> - Le mardi 26 mars 2019 de 16h15 à 18h00.</h3>\n\n<p>Linux est un système qui remplace avantageusement Windows, d’autant qu’il est libre et gratuit Cet atelier permettra de savoir l’utiliser ou d’en avoir un aperçu pour ceux qui ne le connaissent pas encore</p>\n\n<ul>\n<li>Cyber Centre, centre socio culturel, place batcave, Orthez, Nouvelle-Aquitaine, France</li>\n<li><a href=\"http://www.cc-lacqorthez.fr/CYBERBASE\">http://www.cc-lacqorthez.fr/CYBERBASE</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/cybercentre\">cybercentre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/cyberbase\">cyberbase</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/19150\">Atel’libre Inclusion Numérique</a> - Le mardi 26 mars 2019 de 16h30 à 18h00.</h3>\n\n<p><a href=\"http://montpellibre.fr/spip.php?article2787\"></a>Nous initions et formons aux outils et usages numériques tous les publics qui s’en sentent éloignés, voire exclus.</p>\n\n<p>Dans les années à venir le tout numérique va s’accélérer dans nos démarches quotidiennes accès aux soins, à l’emploi, à l’énergie, au services bancaires, caisses de retraite, loisirs, etc.<br>\nUne grande partie de la population n’a pas jugé utile ou eut l’opportunité d’utiliser des outils numériques, ordinateurs fixes, portables, les smartphones ou les tablettes.</p>\n\n<p>Nous considérons que l’inclusion numérique est fondamentale pour réduire la fracture<br>\nnumérique, encore bien réelle, entre les générations et réduire les inégalités sociales, culturelles, d’accès à l’emploi.<br>\nDans un monde ultra-connecté avoir des connaissances numériques de base est devenu indispensable quelque soit son âge.</p>\n\n<p>Nous animons avec bienveillance des ateliers collectifs d’initiation et de pratique des logiciels et des outils numériques libres, en fonction de la demande des utilisateurs.</p>\n\n<p>Les thématiques que nous vous proposerons cette année</p>\n\n<ul>\n<li>Ranger et m’organiser</li>\n<li>Entretenir son ordinateur</li>\n<li>Utiliser une clé USB, un disque dur externe</li>\n<li>Insérer une image</li>\n<li>Mettre en page un courrier</li>\n<li>Créer un tableau simple</li>\n<li>Débuter sur la mise en forme</li>\n<li>Progresser sur la mise en forme de textes</li>\n<li>Classer ses recherches</li>\n<li>Protéger son identité sur l’Internet</li>\n<li>Tchatter avec une webcam</li>\n<li>Utiliser les services administratifs en ligne</li>\n<li>Débuter sur Internet et la messagerie</li>\n<li>Le podcasting</li>\n<li>Transférer et enregistrer sa musique</li>\n<li>Remplir sa déclaration d’impôts</li>\n<li>Faire des rencontres</li>\n<li>Stockez ses données en ligne</li>\n<li>Vendre, acheter, donner ses objets</li>\n<li>Préparer ses vacances</li>\n<li>Débuter sur la messagerie</li>\n<li>Découvrir les réseaux sociaux</li>\n<li>Faire des économies grâce à Internet</li>\n<li>Utiliser les sites / applications pour communiquer</li>\n<li>Débuter avec son téléphone portable</li>\n<li>Transférer les photos de son téléphone</li>\n<li>Utiliser les applications de sa tablette, son téléphone</li>\n<li>Débuter sur sa tablette, son téléphone</li>\n<li>Transférer et classer ses photos</li>\n<li>Créer son livre photo</li>\n<li>Réaliser un diaporama de photos</li>\n<li>Le photomontage</li>\n</ul>\n<p><a href=\"https://montpellibre.fr/\"></a></p>\n\n<p>Entrée libre et gratuite sur <a href=\"https://montpellibre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"https://montpellibre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie la <a href=\"http://www.montpellier.fr/529-maison-pour-tous-albert-camus.htm\"><strong>Mpt Albert Camus</strong></a> de Montpellier et <a href=\"https://montpellibre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Mardis 12, 19 et 26 mars 2019 de 16h30 à 18h00<br>\nMpt Albert Camus - 118, allée Maurice Bonafos 34070 Montpellier<br><a href=\"http://montpellibre.fr/spip.php?article2787\">Inscription nécessaire</a></p>\n\n<ul>\n<li>Mpt Albert Camus, 118 allée Maurice Bonafos, Montpellier, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/formation\">formation</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Strasbourg] <a href=\"https://www.agendadulibre.org/events/19090\">Atelier et présentation du réseau social libre COmmunecter</a> - Le mardi 26 mars 2019 de 17h00 à 20h00.</h3>\n\n<p>Dans la joie et la bonne humeur nous vous proposons de</p>\n\n<ul>\n<li>DÉCOUVRIR la plateforme contributive éthique <a href=\"https://communecter.org/\">COmmunecter</a>\n</li>\n<li>CONTRIBUER au <a href=\"https://news.defricheurs.fr/carte/\">référencement des acteurs locaux</a>\n</li>\n<li>CRÉER une carte intégrable sur le site de votre association</li>\n<li><p>PARTICIPER à la diffusion de cette carte sur Strasbourg</p></li>\n<li><p>EELV, 7 rue de l'Épine, Strasbourg, Grand Est, France</p></li>\n<li><p><a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/carto-partie\">carto-partie</a>, <a href=\"https://www.agendadulibre.org/tags/cartographie\">cartographie</a>, <a href=\"https://www.agendadulibre.org/tags/r%C3%A9seaux-sociaux\">réseaux-sociaux</a>, <a href=\"https://www.agendadulibre.org/tags/communecter\">communecter</a></p></li>\n</ul>\n<h3>[FR Castelnaudary] <a href=\"https://www.agendadulibre.org/events/19248\">Libre en fête Install Party</a> - Le mardi 26 mars 2019 de 18h00 à 20h00.</h3>\n\n<p>Chaque année l'arrivée du printemps est aussi l'occasion de découvrir et mettre en lumière le logiciel libre (et un peu plus encore).</p>\n\n<p>Reposant sur des valeurs de coopération et de bien commun accessible à tous, le logiciel libre est tout simplement un logiciel performant, fiable et accessible… si vous cherchez une alternative aux logiciels propriétaires, Libre en fête est peut-être l'occasion de faire le pas.</p>\n\n<p>Venez avec votre machine ou une clé USB et vous repartirez peut-être avec un système d'exploitation linux ou une suite bureautique libre office… Ou venez tout simplement avec vos questions et votre curiosité pour échanger et apprendre ce que sont les logiciels libres.</p>\n\n<ul>\n<li>Médiathèque Georges Canguilhem Castelnaudary, 8 rue du Commandant Raynal, Castelnaudary, Occitanie, France</li>\n<li><a href=\"http://www.mediatheques-cccla.fr/\">http://www.mediatheques-cccla.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/m%C3%A9diath%C3%A8que\">médiathèque</a>\n</li>\n</ul>\n<h3>[FR Tours] <a href=\"https://www.agendadulibre.org/events/18372\">Permanence ADeTI</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</h3>\n\n<p>La permanence d'ADeTI est un moment d'accueil avec des bénévoles pour apprendre à utiliser un ordinateur sous GNU/Linux (Ubuntu, Linux Mint, Debian,…)  mais aussi</p>\n\n<ul>\n<li>réparer les problèmes de logiciels sur son ordinateur</li>\n<li>prendre des conseils pour choisir des logiciels alternatifs</li>\n<li>différencier les logiciels libres utilisables pour répondre aux besoins</li>\n<li>préserver et réfléchir sur ses usages (vie privée, éthique,…)</li>\n</ul>\n<p>Mais c'est aussi un moment consacré pour</p>\n\n<ul>\n<li>partager des connaissances et échanger des savoirs</li>\n<li>maîtriser les formats ouverts et la pérennité de ses documents</li>\n<li>Confidentialité, intégrité et disponibilité des systèmes d'information</li>\n<li>Diversité des alternatives</li>\n<li>Indépendance</li>\n</ul>\n<p>Nous accueillons également des membres de l'association Touraine Data Network qui peuvent répondre aux questions concernant les réseaux connexion à Internet, alternatives aux \"Box\" et aux opérateurs commerciaux.</p>\n\n<ul>\n<li>Centre Socio-culturel Tours Nord Léo Lagrange Gentiana, 90 avenue André Maginot, Tours, Centre-Val de Loire, France</li>\n<li><a href=\"https://www.adeti.org/\">https://www.adeti.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/adeti-org\">adeti-org</a>, <a href=\"https://www.agendadulibre.org/tags/touraine-data-network\">touraine-data-network</a>, <a href=\"https://www.agendadulibre.org/tags/tdn\">tdn</a>, <a href=\"https://www.agendadulibre.org/tags/ffdn\">ffdn</a>, <a href=\"https://www.agendadulibre.org/tags/permanence\">permanence</a>\n</li>\n</ul>\n<h3>[FR Les Pieux] <a href=\"https://www.agendadulibre.org/events/19083\">Install party GNU/Linux</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</h3>\n\n<p>Vous souhaitez libérer votre ordinateur de Windows en passant à Linux</p>\n\n<p>Recycler un vieux pc Apportez à l'install party.</p>\n\n<p>Curieux, novices ou initiés, vous êtes les bienvenus pour découvrir ou pour aider et partager votre expérience avec Linux.</p>\n\n<p>En 2019 Linux est adapté à 90 des usages pour internet Donc n'hésitez-pas à franchir le pas.</p>\n\n<p>Nous installerons la version 19.04 d'Ubuntu ou la 18.10. Merci de prendre contact avant pour organiser au niveau matériel.</p>\n\n<p>Soirée portes ouvertes gratuite pour tous</p>\n\n<ul>\n<li>Centre multimédia des Pieux, 19 rue des écoles, Les Pieux, Normandie, France</li>\n<li><a href=\"https://centremultimedia.lespieux.fr/\">https://centremultimedia.lespieux.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/ubuntu\">ubuntu</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/cotentin\">cotentin</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/19253\">Rencontre wikimédienne</a> - Le mardi 26 mars 2019 de 18h30 à 20h30.</h3>\n\n<p>Rencontre mensuelle de la cabale de la quenelle (groupe wikimédien lyonnais).</p>\n\n<p>Discussion des projets et collaborations en cours ou à venir autour d’une boisson.</p>\n\n<p>Rejoignez nous</p>\n\n<ul>\n<li>Black Forest Society, 29 rue de l'Arbre Sec, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://fr.wikipedia.org/wiki/Wikip%C3%A9dia:Rencontres/Rh%C3%B4ne-Alpes/Cabale_de_la_quenelle\">https://fr.wikipedia.org/wiki/Wikip%C3%A9dia:Rencontres/Rh%C3%B4ne-Alpes/Cabale_de_la_quenelle</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/wikim%C3%A9dia\">wikimédia</a>, <a href=\"https://www.agendadulibre.org/tags/wikip%C3%A9dia\">wikipédia</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-acces-libre\">rencontre-acces-libre</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>\n</li>\n</ul>\n<h3>[FR Quetigny] <a href=\"https://www.agendadulibre.org/events/19174\">Soirée Lightning Talks - Testons notre liberté d'expression</a> - Le mardi 26 mars 2019 de 20h30 à 23h30.</h3>\n\n<p>Les Lightning talks sont des présentations très courtes où les sujets sont libres et donc très variés.</p>\n\n<p>Toute personne ayant quelque chose d'intéressant à dire en rapport avec l'open source ou de logiciel libre peut prendre la parole.</p>\n\n<p>Ce format est particulièrement approprié pour celles et ceux qui n’ont jamais pris la parole en public et qui souhaitent essayer de prendre la place d’un conférencier l’espace de quelques minutes.</p>\n\n<p>Les intervenants et les intervenantes, s'auto-organisent pour passer les unes et les uns après les autres en respectant une durée maximales de 15 minutes.</p>\n\n<p>Les intervenants et les intervenantes peuvent projeter quelques diapositives ou une vidéo pour s'aider à faire passer leur message.</p>\n\n<p>Comme les présentations s'enchaînent sans pause, les discussions pourront se poursuivre après si les participants le souhaitent.</p>\n\n<p>Venez nombreuses et nombreux avec pourquoi pas une boisson ou de la nourriture à partager</p>\n\n<ul>\n<li>Centre social La Passerelle, 3 allée des Jardins, Quetigny, Bourgogne-Franche-Comté, France</li>\n<li><a href=\"http://coagul.org/drupal/evenement/soiree-lightning-talks-testons-notre-liberte-dexpression\">http://coagul.org/drupal/evenement/soiree-lightning-talks-testons-notre-liberte-dexpression</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/conf%C3%A9rences\">conférences</a>, <a href=\"https://www.agendadulibre.org/tags/lightning-talks\">lightning-talks</a>, <a href=\"https://www.agendadulibre.org/tags/libert%C3%A9\">liberté</a>, <a href=\"https://www.agendadulibre.org/tags/expression\">expression</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Lille] <a href=\"https://www.agendadulibre.org/events/19261\">Permanence associative autour du Libre</a> - Le mardi 26 mars 2019 de 20h30 à 23h00.</h3>\n\n<p>Vous avez décidé de faire le grand ménage de printemps dans votre vie numérique Venez nous rencontrer <strong>ce mardi 26 mars à 20H30 au <a href=\"http://cafecitoyen.org/\">Café Citoyen</a></strong> à Lille</p>\n\n<p>Comme le dernier mardi de chaque mois, Chtinux organise sa permanence associative. Cette manifestation conviviale est ouverte à toutes et tous.</p>\n\n<p>Vous pourrez y discuter joyeusement Logiciel Libre, de données ouvertes (<em>open data</em>), de bidouille sous Linux, chercher de l’aide technique ou proposer vos idées d’évènements… le tout autour de boissons bio/équitables, par exemple les bières « à façon, exclusivités du Café Citoyen</p>\n\n<p>Si vous venez avec votre ordinateur pour obtenir de l'aide, prévenez-nous en envoyant un courrier électronique à l'adresse bonjour CHEZ chtinux POINT org</p>\n\n<p>Accessible en métro (station République - Beaux Arts).<br>\nUne connexion Internet est disponible sur place.</p>\n\n<p>Pour soutenir le Café Citoyen, nous vous demandons d'y acheter au minimum une consommation. Après avoir pris votre boisson au bar, vous pouvez nous rejoindre directement au 2ème étage.</p>\n\n<ul>\n<li>Café Citoyen, 7 place du Vieux Marché aux Chevaux, Lille, Hauts-de-France, France</li>\n<li><a href=\"http://chtinux.org/Permanence%20Chtinux\">http://chtinux.org/Permanence%20Chtinux</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/chtinux\">chtinux</a>, <a href=\"https://www.agendadulibre.org/tags/permanence\">permanence</a>, <a href=\"https://www.agendadulibre.org/tags/logiciel-libre\">logiciel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/entraide\">entraide</a>, <a href=\"https://www.agendadulibre.org/tags/discussion\">discussion</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Mourenx] <a href=\"https://www.agendadulibre.org/events/19129\">Découvrir et utiliser Linux</a> - Le mercredi 27 mars 2019 de 10h00 à 11h45.</h3>\n\n<p>Linux est un système qui remplace avantageusement Windows, d’autant qu’il est libre et gratuit Cet atelier permettra de savoir l’utiliser ou d’en avoir un aperçu pour ceux qui ne le connaissent pas encore</p>\n\n<ul>\n<li>MIX, 2 avenue Charles Moureu, Mourenx, Nouvelle-Aquitaine, France</li>\n<li><a href=\"http://www.cc-lacqorthez.fr/CYBERBASE\">http://www.cc-lacqorthez.fr/CYBERBASE</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/cyber\">cyber</a>, <a href=\"https://www.agendadulibre.org/tags/mix\">mix</a>, <a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/cyberbase\">cyberbase</a>\n</li>\n</ul>\n<h3>[FR Béziers] <a href=\"https://www.agendadulibre.org/events/19186\">Découverte des distributions GNU/Linux</a> - Le mercredi 27 mars 2019 de 10h00 à 12h00.</h3>\n\n<p>Montpel’libre vous présentera les différentes distributions de Linux pour vous permettre de choisir une distribution adaptée à vos usages. Longtemps réservé aux experts, Linux offre aujourd’hui des interfaces graphiques, appelées environnements de bureau ou distributions, une alternative aux systèmes d’exploitation propriétaires et donc privateurs de libertés.</p>\n\n<p>Entrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie la <a href=\"http://www.mediatheque-beziers-agglo.org/\"><strong>Médiathèque de Béziers</strong></a>, <a href=\"https://lagglo.fr/\"><strong>l’Agglo de Béziers</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p><a href=\"http://www.mediatheque-beziers-agglo.org/\"></a></p>\n\n<p>Mercredi 27 mars 2019 de 10h00 à 12h00<br>\nMédiathèque André Malraux - Place du 14 juillet 34500 Béziers</p>\n\n<ul>\n<li>Médiathèque André Malraux, Place du 14 juillet, Béziers, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/d%C3%A9couverte\">découverte</a>, <a href=\"https://www.agendadulibre.org/tags/distributions\">distributions</a>, <a href=\"https://www.agendadulibre.org/tags/m%C3%A9diath%C3%A8que\">médiathèque</a>\n</li>\n</ul>\n<h3>[FR Le Mans] <a href=\"https://www.agendadulibre.org/events/19134\">Permanence LinuXMainE du mercredi après-midi</a> - Le mercredi 27 mars 2019 de 12h00 à 17h00.</h3>\n\n<p>Permanence hebdomadaire du mercredi après-midi</p>\n\n<p>Démonstrations, initiations, assistances et installations des logiciels libres GNU/Linux.</p>\n\n<p>Venez nombreux</p>\n\n<ul>\n<li>Centre Coluche, Pôle associatif Coluche, 31 allée Claude Debussy, Le Mans, Pays de la Loire, France</li>\n<li><a href=\"http://linuxmaine.org/\">http://linuxmaine.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/linuxmaine\">linuxmaine</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/gnu%2Flinux\">gnu/linux</a>, <a href=\"https://www.agendadulibre.org/tags/permanence\">permanence</a>\n</li>\n</ul>\n<h3>[FR Marseille] <a href=\"https://www.agendadulibre.org/events/19078\">Porte ouverte pour les ateliers numériques pour enfants</a> - Le mercredi 27 mars 2019 de 13h30 à 18h30.</h3>\n\n<p>Porte ouverte pour les ateliers numériques pour enfants<br>\nque nous allons organiser tous les mercredis après-midi en période scolaire.</p>\n\n<p>C'est de 13 h 30 à 18 h 30 dans les locaux de Mille Babords au 61 rue Consolat.</p>\n\n<p>N'hésitez pas à venir y faire un saut (ou à envoyer vos enfants), prendre un thé, aider à installer des Linux.</p>\n\n<ul>\n<li>Mille babord, 61 rue Consolat, Marseille, Provence-Alpes-Côte d'Azur, France</li>\n<li><a href=\"https://colibris-wiki.org/revlibre/?AteliersEnfants\">https://colibris-wiki.org/revlibre/?AteliersEnfants</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/revlibre\">revlibre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/numerique\">numerique</a>, <a href=\"https://www.agendadulibre.org/tags/enfants\">enfants</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Marseille] <a href=\"https://www.agendadulibre.org/events/19163\">Ateliers numériques pour enfants</a> - Le mercredi 27 mars 2019 de 13h30 à 17h30.</h3>\n\n<p>Ateliers numériques pour enfants de 6 à 15 ans,<br>\ntous les mercredis après-midi en période scolaire.</p>\n\n<p>C'est de 13 h 30 à 17 h 30 dans les locaux de Mille Babords au 61 rue Consolat.</p>\n\n<p>Entrée sur inscription, contenu et tarifs sur <a href=\"http://revlibre.org/\">http://revlibre.org</a></p>\n\n<ul>\n<li>Mille babords, 61 rue Consolat, Marseille, Provence-Alpes-Côte d'Azur, France</li>\n<li><a href=\"http://revlibre.org/\">http://revlibre.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/revlibre\">revlibre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/num%C3%A9rique\">numérique</a>, <a href=\"https://www.agendadulibre.org/tags/enfants\">enfants</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Vandœuvre-lès-Nancy] <a href=\"https://www.agendadulibre.org/events/19099\">Jouer à 0 A.D. - Empires Ascendant</a> - Le mercredi 27 mars 2019 de 15h00 à 17h00.</h3>\n\n<p>0 A.D. - Empires Ascendant est un jeu vidéo de guerre stratégique dans lequel chaque joueur incarne une civilisation historique.<br>\nLe but du jeu est de se confronter aux autres joueurs, individuellement ou par équipe, en profitant de la richesse apporté par des historiens qui ajoute des spécificités propres à chaque civilisation.</p>\n\n<p><strong>Horaires</strong></p>\n\n<p>Les animations débutent à 15 h pour se terminer vers 17 h, la salle multimédia FCCL ouvre ses portes à partir de 14 h ces jours-là.</p>\n\n<p><strong>Inscription gratuite aux animations</strong></p>\n\n<p>La participation aux animations repose sur un système d’inscriptions préalables qui permet de répondre de façon plus ciblée aux attentes des usagers et de les associer au projet.</p>\n\n<p>L'inscription obligatoire au plus tard 30 min avant l’atelier via les contacts proposés ci-dessous ou en vous présentant dès 14 h dans la salle multimédia FCCL.</p>\n\n<ul>\n<li>Fabrique Collective de la Culture du Libre, médiathèque Jules Verne, 2 rue de Malines, Vandœuvre-lès-Nancy, Grand Est, France</li>\n<li><a href=\"https://fccl-vandoeuvre.fr/\">https://fccl-vandoeuvre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/fccl\">fccl</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/jeu-video\">jeu-video</a>, <a href=\"https://www.agendadulibre.org/tags/0ad\">0ad</a>\n</li>\n</ul>\n<h3>[FR Lorient] <a href=\"https://www.agendadulibre.org/events/19189\">Présentation de \"CHATONS\"</a> - Le mercredi 27 mars 2019 de 15h00 à 17h00.</h3>\n\n<p><a href=\"https://leprette.fr/site/\">Leprette.fr</a>, nouveau membre du Collectif des Hébergeurs Alternatifs, Transparents, Ouverts, Neutres et Solidaires (<a href=\"https://chatons.org/\">CHATONS</a>), initié par l'association <a href=\"https://framasoft.org/fr/\">Framasoft</a>, viendra présenter ce projet qui réunit des acteurs proposant des services en ligne libres, éthiques, décentralisés et solidaires.</p>\n\n<p>Rendez-vous à l'espace multimédia le mercredi 27 mars de 15h à 17h</p>\n\n<ul>\n<li>Espace multimédia PLL, 80 avenue Général de Gaulle, Lorient, Bretagne, France</li>\n<li><a href=\"http://lekiosque.bzh/2019/leprette-fr-contribue-a-linternet-libre-neutre-decentralise-et-solidaire/\">http://lekiosque.bzh/2019/leprette-fr-contribue-a-linternet-libre-neutre-decentralise-et-solidaire/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/chatons\">chatons</a>, <a href=\"https://www.agendadulibre.org/tags/pr%C3%A9sentation\">présentation</a>, <a href=\"https://www.agendadulibre.org/tags/leprette.fr\">leprette.fr</a>\n</li>\n</ul>\n<h3>[FR Vandoeuvre-lès-Nancy] <a href=\"https://www.agendadulibre.org/events/19088\">Atelier/rencontre OpenStreetMap</a> - Le mercredi 27 mars 2019 de 17h30 à 20h00.</h3>\n\n<p>1ère réunion du groupe local nancéen de contributeurs au projet OpenStreetMap.</p>\n\n<p>Nous vous proposons de nous rejoindre pour découvrir et s'initier à la cartographie libre et participative.</p>\n\n<p>Ouvert à tous.</p>\n\n<p>Le lieu de réunion est équipé d'ordinateurs.</p>\n\n<ul>\n<li>Médiathèque Jules Verne, 2 rue de Malines, Vandoeuvre-lès-Nancy, Grand Est, France</li>\n<li><a href=\"http://nancy.osmfr.org/\">http://nancy.osmfr.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/osm\">osm</a>, <a href=\"https://www.agendadulibre.org/tags/openstreetmap\">openstreetmap</a>, <a href=\"https://www.agendadulibre.org/tags/fccl\">fccl</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Beauvais] <a href=\"https://www.agendadulibre.org/events/17747\">Atelier hebdomadaire de partage de connaissances autour des logiciels libres</a> - Le mercredi 27 mars 2019 de 18h00 à 20h00.</h3>\n\n<p>Chaque mercredi soir, l'association propose une rencontre pour partager des connaissances, des savoir-faire, des questions autour de l'utilisation des logiciels libres, que ce soit à propos du système d'exploitation Linux, des applications libres ou des services en ligne libres.</p>\n\n<p>C'est l'occasion aussi de mettre en avant l'action des associations fédératrices telles que l'April ou Framasoft, dont nous sommes adhérents et dont nous soutenons les initiatives avec grande reconnaissance.</p>\n\n<p>L'atelier a lieu dans la salle informatique du Centre Georges Desmarquet géré par l'association Voisinlieu-pour-tous.</p>\n\n<ul>\n<li>Centre Georges Desmarquet, rue de Longue Haie, Beauvais, Hauts-de-France, France</li>\n<li><a href=\"https://oisux.org/\">https://oisux.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/oisux\">oisux</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/voisinlieu-pour-tous\">voisinlieu-pour-tous</a>, <a href=\"https://www.agendadulibre.org/tags/centre-georges-desmarquet\">centre-georges-desmarquet</a>, <a href=\"https://www.agendadulibre.org/tags/april\">april</a>, <a href=\"https://www.agendadulibre.org/tags/framasoft\">framasoft</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/19119\">Atel’libre Bricolotech Open-Bidouille</a> - Le mercredi 27 mars 2019 de 18h30 à 20h00.</h3>\n\n<p><a href=\"http://montpellibre.fr/spip.php?article2787\"></a><strong>Atelier 1 Fabriquer sa miniville connectée - Smart City (semaines impaires)<br>\nAtelier 2 Créer sois-même son PC Grappe de bureau - Desktop Cluster (semaines paires)</strong></p>\n\n<p><strong>GRAPPE DE BUREAU - DESKTOP CLUSTER</strong><br>\nCe projet consiste a créer un cluster à partir de dev board. Rien de nouveau, c’est vrai, encore que… La nouveauté est dans l’utilisation. Nous allons partir de matériel et logiciels entièrement libres afin de créer un PC entièrement libre.</p>\n\n<p><strong>Définition du projet</strong><br>\nL’idée est de dénicher un PC entièrement libre. Peu importe la puissance de l’engin, il faut qu’il soit libre, c’est à dire qu’il n’ai aucun secret. Qu’aucun binaire ne soit indispensable à son fonctionnement, pas d’IME, pas d’AMT, pas de BIOS complexe et fermé. Un PC simple qui permet de naviguer sur le web, faire des travaux multimédia, interfacer avec des périphériques externes et autres composants type microcontrôleurs par exemple. Avec un peu de puissance de calcul pour la compilation. Si nous ne voulons pas de binaire, il nous faut de la puissance nécessaire pour compiler les sources.</p>\n\n<p>Il existe des boards de dev plus ou moins chères et plus ou moins libres en assemblant ces dernières nous pourrons ainsi obtenir mon PC suffisamment puissant et entièrement libre.</p>\n\n<p><strong>Comment faire :</strong><br>\nQuel matériel nous pouvons utiliser :</p>\n\n<ol>\n<li> L’Orange Pi PC (v1) semble un bon candidat pour du lowcost</li>\n<li> La libre computer board, avec 1GB ou 2GB de ram</li>\n<li> L’humming board, parfait pour ceux qui ont les moyens, la board est libre sans bidouille.</li>\n</ol>\n<p><strong>MINIVILLE CONNECTÉE - SMART CITY</strong><br>\nL’idée est de produire une miniville interactive. Ce qui nous intéresse ici c’est surtout la route et la circulation, mais avoir des maisons et commerces en plus peut être sympa. Ce projet implique de la conception 2D/3D, de l’électronique, de l’urbanisme et de la programmation. La réalisation devra être accessible à des enfants, contenir peu d’intelligence au début et évoluer de manière interactive. Les éléments qui composent la ville devront être interdépendant mais capable d’entrer en interaction et interchangeable.</p>\n\n<p><strong>Définition du projet</strong><br>\nQue peut on apprendre avec ce projet</p>\n\n<ul>\n<li>Fonctionnement et utilisation des composants de bases résistance, led, transistor, condensateur</li>\n<li>Conception et miniaturisation via circuits intégré ou mini micro contrôleurs</li>\n<li>Montages électroniques de base branchement d’un moteur, d’un servomoteur, leds, capteurs</li>\n<li>Se documenter en lisant les spécifications du matériel ou en s’inspirant de montage existant</li>\n<li>\n<p>Impressions de circuit imprimé, de décor, de châssis de voiture, de structure de bâtiment à l’aide d’une CNC.</p>\n\n<ul>\n<li>Impressions complémentaires de la CNC via une imprimante 3D</li>\n<li>Réflexion autour de la conception des éléments de base (voiture, route, signalisation)</li>\n<li>Gestion de l’énergie, comment alimenter les feux, les voitures.</li>\n<li>Comment gérer la synchronisation des feux</li>\n<li>Comment gérer les interactions entre les voitures</li>\n<li>Comment fixer les feux à la route. Je rappel que la route est éphémère. C’est une feuille de papier avec des lignes au marqueur.</li>\n<li>Comment associer les plaques de routes (Cela dépend beaucoup de la gestion de l’énergie et de la synchronisation)</li>\n</ul>\n</li>\n<li><p>Programmation de microcontrôleurs.</p></li>\n<li><p>Recyclage de matériel existant avec une reprogrammation de microcontrôleurs ou des assemblages de relais, optocoupleur etc.</p></li>\n</ul>\n<p><strong>Comment faire :</strong><br>\nLe projet se présente sous une forme itérative, afin d’avoir rapidement quelque chose qui fonctionne à chaque itération. C’est pour cela que nous vous donnerons une piste pour commencer, mais rien ne sera imposé</p>\n\n<ul>\n<li>Feux tricolores de signalisation</li>\n<li>Comportement des feux tricolores</li>\n<li>Ajout de feux piétons</li>\n<li>Gestion d’interruption</li>\n</ul>\n<p><strong>POURQUOI LES LOGICIELS LIBRES :</strong><br>\nPourquoi vouloir avec les sources et le logiciel libre Pour</p>\n\n<ol>\n<li> Refuser l’obsolescence programmée</li>\n<li> Pouvoir mettre fin au chantage lié aux données personnelles</li>\n<li> Être capable de s’assurer que le matériels et les logiciels que nous utilisons font bien ce qu’ils sont sensés faire.</li>\n<li> Réduire la fracture technologique en permettant à chacun de s’intéresser au fonctionnement de ce qui inonde notre quotidien.</li>\n<li> Faciliter l’amélioration continue, chacun peut apporter selon son envie, son internet, ses possibilités.</li>\n</ol>\n<p><a href=\"http://montpel-libre.fr/\"></a></p>\n\n<p>Les places à cet atelier sont limitées, il est donc préférable de s’inscrire avant.<br>\nEntrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\"><strong>inscription</strong></a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_adhesion_2018.pdf\"><strong>adhésion</strong></a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie le <a href=\"http://dotank-coworking.fr/\"><strong>DoTank</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Mercredis 6, 13, 20 et 27 mars 2019 de 18h30 à 20h00 (tous les mercredis)<br>\nDoTank au 2, rue du Pavillon, 34000 Montpellier<br><a href=\"http://montpellibre.fr/spip.php?article2787\">Inscription nécessaire</a></p>\n\n<ul>\n<li>DoTank, 2 rue du Pavillon, Montpellier, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/do-tank\">do-tank</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/bidouille\">bidouille</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Grenoble] <a href=\"https://www.agendadulibre.org/events/19166\">Atelier Créer un livre numérique avec du texte et un navigateur web</a> - Le mercredi 27 mars 2019 de 18h30 à 21h00.</h3>\n\n<p><strong>Mercredi 27 mars, Thomas Parisot et Antoine Fauchié organisent à la coop un atelier pour apprendre à constituer un livre numérique en utilisant HTML, CSS et un peu de JavaScript.</strong></p>\n\n<p>Word et OpenOffice sont parmi les outils les plus populaires pour produire des documents imprimables.<br>\nEt si on utilisait des outils plus légers et plus versatiles On pourrait écrire un texte une seule fois et le transformer en page web ou en support paginé imprimable. Sans installer de logiciel, directement dans un navigateur. On pourrait même aller jusqu’à générer un document Word à partir de ce même document texte.</p>\n\n<p><strong>Quel est le format de l’atelier</strong></p>\n\n<p>Le groupe va interagir avec un espace de travail projeté sur le mur avec un vidéo projecteur. Les modifications apportées sur l’espace de travail produiront un résultat imprimable/PDF en temps réel.</p>\n\n<p>Chaque personne aura aussi le loisir de travailler en parallèle, à son rythme, sur son propre ordinateur.</p>\n\n<p><strong>Avec quoi je repars</strong></p>\n\n<p>À la fin du temps, tu repars avec une pratique renforcée de langages de balisage léger (Markdown, AsciiDoc) et des fonctionnalités de mise en forme paginée CSS (@page, Paged.js).</p>\n\n<p><strong>À qui ça s’adresse</strong></p>\n\n<ul>\n<li>Des personnes qui écrivent de longs documents</li>\n<li>Des personnes qui veulent s’affranchir de Word et LibreOffice</li>\n<li>Des personnes qui travaillent ou veulent travailler dans l’édition numérique</li>\n<li>Des développeurs·ses frontend</li>\n<li><p>Des designers UX</p></li>\n<li><p>La Coop Infolab, 31 rue Gustave Eiffel, Grenoble, Auvergne-Rhône-Alpes, France</p></li>\n<li><p><a href=\"https://www.eventbrite.fr/e/billets-atelier-creer-un-livre-numerique-avec-du-texte-et-un-navigateur-web-58070068137\">https://www.eventbrite.fr/e/billets-atelier-creer-un-livre-numerique-avec-du-texte-et-un-navigateur-web-58070068137</a></p></li>\n<li><p><a href=\"https://www.agendadulibre.org/tags/javascript\">javascript</a>, <a href=\"https://www.agendadulibre.org/tags/css\">css</a>, <a href=\"https://www.agendadulibre.org/tags/html\">html</a>, <a href=\"https://www.agendadulibre.org/tags/livre\">livre</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/la-coop\">la-coop</a></p></li>\n</ul>\n<h3>[FR Grenoble] <a href=\"https://www.agendadulibre.org/events/19216\">Session Hack du Mercredi</a> - Le mercredi 27 mars 2019 de 19h00 à 23h00.</h3>\n\n<p>Séance du mercredi soir au LOGal</p>\n\n<p>C'est ouvert à tout le monde, vous êtes les bienvenu.e.s</p>\n\n<p>N'hésitez pas à passer nous voir pour rencontrer nos membres, découvrir leurs projets ou participer</p>\n\n<ul>\n<li>Laboratoire Ouvert Grenoblois, 45 rue Nicolas Chorier, Grenoble, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://www.logre.eu/\">https://www.logre.eu</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/log\">log</a>, <a href=\"https://www.agendadulibre.org/tags/hackerspace\">hackerspace</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-hebdomadaire\">rencontre-hebdomadaire</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-acces-libre\">rencontre-acces-libre</a>, <a href=\"https://www.agendadulibre.org/tags/diy\">diy</a>, <a href=\"https://www.agendadulibre.org/tags/maker\">maker</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>\n</li>\n</ul>\n<h3>[FR Cysoing] <a href=\"https://www.agendadulibre.org/events/19176\">Install Party Linux</a> - Le mercredi 27 mars 2019 de 19h30 à 23h30.</h3>\n\n<p><strong>Microsoft ne maintient plus à jour votre ordinateur</strong><br>\nPassez à Linux sans hésiter pour continuer à l’utiliser en toute sécurité vous bénéficierez d’un système gratuit, libre et bien plus sécurisé.</p>\n\n<p>En effet, pour windows XP, les mises à jour de sécurité ne sont plus effectives depuis le 8 Avril 2014. En ce qui concerne Vista, son développement s’est arrêté en Avril 2017. Pour Windows 7, ce sera l’année prochaine.</p>\n\n<p>Vous souhaitez continuer à l’utiliser en l’état…certes vos ordinateurs ne sont et ne seront pas forcément inutilisables, ils seront toutefois plus vulnérables que jamais. En effet, en plus du système windows, la plupart des logiciels ne seront plus mis à jour, d’autres seront même bloqués et vous devrez trouver des alternatives.</p>\n\n<p>Installer un système Linux va vous permettre d’allonger la durée de vie de votre ordinateur tout en adoptant un système plus rapide, bien plus sécurisé et très proche en apparence et fonctionnement.</p>\n\n<p><strong>De multiples versions pour tout âge</strong></p>\n\n<p>Ne jetez plus vos anciens ordinateurs et faites en profitez à vos enfants et petits enfants Présentée lors de la semaine du Numérique Primtux est une des versions dédiées à la famille et adaptés aux enfants à partir de 3 ans. Riche en logiciels éducatifs, cette version de linux est la plus aboutie pour l’école et continuer à utiliser les anciens postes en fond de classe.<br>\nDécouvrez plusieurs environnements/sessions et de nombreux logiciels adaptés par tranche d’âge</p>\n\n<ul>\n<li>Mini pour les cycle 1 (3-5 ans)</li>\n<li>Super pour les cycles 2 (6-9 ans)</li>\n<li>Maxi pour les cycles 3 (8-10 ans)</li>\n<li>Une session prof ou parent pour administrer l’ordinateur.</li>\n</ul>\n<p>Une version idéale pour toute la famille et à l’école et qui peut fonctionner sans installation à partir d’un DVD ou d’une clé USB. De plus cette version intègre un contrôle parental avec filtrage web.</p>\n\n<p><strong>Vous souhaitez simplement découvrir un système d’exploitation libre, gratuit et qui respecte vos données personnelles</strong></p>\n\n<p>Nous vous proposons d’installer cette alternative à Windows en parallèle ou à la place de celui-ci.<br>\nSi vous avez un système plus récent que Vista (Windows 7/8/8.1 ou 10), il est tout à fait possible d’installer Linux, sans aucune perte de données, en parallèle. Cela vous permettra de découvrir de nombreuses alternatives gratuites et libres aux logiciels propriétaires car ces derniers exploitent le plus souvent vos données personnelles.</p>\n\n<p>Rendez-vous lors de nos mercredis Linux bi-mensuels à partir de 19h30</p>\n\n<ul>\n<li>à la médiathèque de Cappelle-En-Pévèle les 2èmes mercredis de chaque mois (sauf Avril où ce sera le 1er mercredi)</li>\n<li><p>à l’<a href=\"https://www.google.com/maps/place/Espace+Public+Num%C3%A9rique+de+Cysoing+-+Communaut%C3%A9+de+Communes+P%C3%A9v%C3%A8le+Carembault/@50.5707284,3.2133893,17z/data=!3m1!4b1!4m5!3m4!1s0x47c2d99505a8c8b5:0x29c67df516424f33!8m2!3d50.570725!4d3.215578\">Espace Public Numérique de Cysoing</a> le dernier mercredi de chaque mois.</p></li>\n<li><p>Espace Public Numérique de Cysoing, 311 rue Salvador Allende, Cysoing, Hauts-de-France, France</p></li>\n<li><p><a href=\"http://clx.asso.fr/spip\">http://clx.asso.fr/spip</a></p></li>\n<li><p><a href=\"https://www.agendadulibre.org/tags/primtux\">primtux</a>, <a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/mint\">mint</a>, <a href=\"https://www.agendadulibre.org/tags/ubuntu\">ubuntu</a>, <a href=\"https://www.agendadulibre.org/tags/s%C3%A9curit%C3%A9\">sécurité</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/clx\">clx</a>, <a href=\"https://www.agendadulibre.org/tags/mercredi-linux\">mercredi-linux</a></p></li>\n</ul>\n<h3>[FR L'Ile d'Yeu] <a href=\"https://www.agendadulibre.org/events/18928\">Dégooglisons Internet</a> - Le mercredi 27 mars 2019 de 20h30 à 22h30.</h3>\n\n<p>Google search, Gmail, Google Maps, Youtube, Google drive… nous sommes chaque jour des millions à utiliser les applications du géant Google.</p>\n\n<p>Mais connaissons-nous véritablement cette entreprise Sommes-nous conscients et toujours consentants des données collectées</p>\n\n<p>Existe-t-il des alternatives plus respectueuses de la vie privée</p>\n\n<p>L'espace numérique vous propose d'échanger sur ce thème autour d'un café numérique.</p>\n\n<p>Des solutions facilement accessibles, telles que celles développées par Framasoft, vous seront présentées.</p>\n\n<ul>\n<li>Bibliothèque municipale, route des Sicardières, L'Ile d'Yeu, Pays de la Loire, France</li>\n<li><a href=\"http://www.mairie.ile-yeu.fr/espace-numerique/\">http://www.mairie.ile-yeu.fr/espace-numerique/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/sensibilisation\">sensibilisation</a>, <a href=\"https://www.agendadulibre.org/tags/%C3%A9change\">échange</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/degooglisons\">degooglisons</a>\n</li>\n</ul>\n<h3>[FR Mourenx] <a href=\"https://www.agendadulibre.org/events/19127\">Découvrir les logiciels libres pour PC et smartphone</a> - Le jeudi 28 mars 2019 de 14h00 à 15h45.</h3>\n\n<p>Profitez de la simplicité de logiciels libres et gratuits à utiliser au quotidien sur votre ordinateur ou votre smartphone. Rédiger textes ou tableaux, naviguer sur Internet, organiser ses photos, utiliser son téléphone comme GPS…</p>\n\n<ul>\n<li>MIX, 2 avenue Charles Moureu, Mourenx, Nouvelle-Aquitaine, France</li>\n<li><a href=\"http://www.cc-lacqorthez.fr/CYBERBASE\">http://www.cc-lacqorthez.fr/CYBERBASE</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/cyber\">cyber</a>, <a href=\"https://www.agendadulibre.org/tags/mix\">mix</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/cyberbase\">cyberbase</a>\n</li>\n</ul>\n<h3>[FR Bordeaux] <a href=\"https://www.agendadulibre.org/events/18135\">Jeudi Giroll</a> - Le jeudi 28 mars 2019 de 18h30 à 20h30.</h3>\n\n<p>Les membres du collectif Giroll, GIROnde Logiciels Libres, se retrouvent une fois par semaine, pour partager leurs  savoir-faire et expériences autour des logiciels libres.</p>\n\n<p>Le collectif réalise aussi une webradio mensuelle, tous les second jeudis du mois, à retrouver en direct sur le site de Giroll.</p>\n\n<p>Ces rencontres sont ouvertes à tous.</p>\n\n<ul>\n<li>Centre d'animation Saint-Pierre, 4 rue du mulet, Bordeaux, Nouvelle-Aquitaine, France</li>\n<li><a href=\"https://www.giroll.org/\">https://www.giroll.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/giroll\">giroll</a>, <a href=\"https://www.agendadulibre.org/tags/webradio\">webradio</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-hebdomadaire\">rencontre-hebdomadaire</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/17126\">A la découverte de Nextcloud</a> - Le jeudi 28 mars 2019 de 19h00 à 21h30.</h3>\n\n<p>Savez-vous où et comment sont stockées vos données chez DropBox, Microsoft OneDrive, GoogleDrive …?</p>\n\n<p>Ces choses qu’on appelle souvent cloud cachent parfois de lourds secrets qui ne sont pas sans conséquences pour les utilisateurs.</p>\n\n<p>Il existe pourtant des alternatives pour reprendre le contrôle de vos données. Parmi ces solutions, Nextcloud est la plus connue.</p>\n\n<p>Nextcoud est utilisé par le gouvernement fédéral d’Allemagne, l’université de Nantes et Berlin, Siemens … et peut-être utilisé pour un usage personnel.</p>\n\n<p>Cet outil vous permet en effet de stocker en ligne vos fichiers, de les synchroniser et de les partager entre amis ou pour un usage professionnel.</p>\n\n<p>Il permet aussi de gérer ses contacts / agenda et de les synchroniser entre son ordinateur, smartphone ou tablette.</p>\n\n<p>Bien plus encore, on peut lui ajouter des fonctionnalités messagerie, prises de notes, visioconférence, gestionnaire de mot de passe …</p>\n\n<p>Venez découvrir Nextcloud, l’utiliser et l’adopter.</p>\n\n<p>Pensez à prendre votre ordinateur portable / tablette / smartphone. Si besoin, des ordinateurs sont disponibles en libre accès à l’EPN.</p>\n\n<p><strong>Atelier ouvert à tous, tous niveaux.</strong></p>\n\n<p><strong>Venez nombreux</strong></p>\n\n<ul>\n<li>Maison pour tous / salle des Rancy, 249 rue Vendôme, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://epn.salledesrancy.com/les-jeudis-du-numeriques/jeudis-ateliers-decouverte-du-numerique-libre-2\">https://epn.salledesrancy.com/les-jeudis-du-numeriques/jeudis-ateliers-decouverte-du-numerique-libre-2</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/aldil\">aldil</a>, <a href=\"https://www.agendadulibre.org/tags/epn-des-rancy\">epn-des-rancy</a>, <a href=\"https://www.agendadulibre.org/tags/cloud\">cloud</a>, <a href=\"https://www.agendadulibre.org/tags/nextcloud\">nextcloud</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/d%C3%A9couverte\">découverte</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/18911\">ParcourSup</a> - Le jeudi 28 mars 2019 de 19h00 à 21h00.</h3>\n\n<p><strong>Jeudi du Libre ParcourSup</strong></p>\n\n<p>L’affectation des bacheliers dans l’enseignement supérieur en France était régi jusqu’en 2017 par un système appelé APB (Admission Post-Bac). Le ministère de l’enseignement supérieur a choisi de remplacer celui-ci dès 2018 par un nouveau système, appelé Parcoursup.<a href=\"http://epn.salledesrancy.com/\"></a></p>\n\n<p>Déléguer à une machine l’affectation des bacheliers dans le supérieur pose un certain nombre de questions</p>\n\n<ul>\n<li>Quelles règles souhaite-t-on pour l’accès au supérieur</li>\n<li>Quels sont alors les objectifs assignés à la machine</li>\n<li>Quel algorithme permet de les atteindre</li>\n<li>Comment permettre à tous les citoyens de vérifier une exécution de l’algorithme</li>\n</ul>\n<p>On verra rapidement quels faux et vrais problèmes posait APB et pose Parcoursup, comment fonctionne l’algorithme qui les sous-tend (algorithme de Gale-Shapley) et ce qu’il serait possible de faire pour améliorer Parcoursup.</p>\n\n<p><a href=\"http://epn.salledesrancy.com/\"> </a></p>\n\n<ul>\n<li>Maison pour tous , salle des Rancy, 249 rue Vendôme, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://aldil.org/\">https://aldil.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/aldil\">aldil</a>, <a href=\"https://www.agendadulibre.org/tags/conf%C3%A9rence\">conférence</a>, <a href=\"https://www.agendadulibre.org/tags/epn-des-rancy\">epn-des-rancy</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/parcoursup\">parcoursup</a>, <a href=\"https://www.agendadulibre.org/tags/vulgarisation\">vulgarisation</a>\n</li>\n</ul>\n<h3>[FR Nanterre] <a href=\"https://www.agendadulibre.org/events/18975\">Table ronde Libérons la livraison à vélo</a> - Le jeudi 28 mars 2019 de 19h00 à 21h00.</h3>\n\n<p>Dans le cadre de Libre en fête, le PCF Nanterre 92 propose une table ronde \"Libérons la livraison à vélo\".</p>\n\n<p>Depuis 2016, plusieurs collectifs se sont formés pour contrer le monopole des plateformes de livraison à vélo (Deliveroo, Ubereats) et pour assurer un statut digne des livreurs.</p>\n\n<p>Coopcycle présentera un logiciel libre qui a permis de créer sa propre coopérative. Des livreurs témoigneront et expliqueront leurs revendications.</p>\n\n<p>En présence de</p>\n\n<p>Théo Patros et Ana pour Coopcycle et la Ville de Stains.</p>\n\n<p>Jérôme Pimot du CLAP (collectif des livreurs autonomes parisiens)</p>\n\n<p>Barbara Gomez, assistante parlementaire, auteure d’une thèse sur le droit du travail à l’épreuve des plateformes numériques <a href=\"http://www.theses.fr/s37897\">http://www.theses.fr/s37897</a> (sous réserve)</p>\n\n<ul>\n<li>PCF Nanterre 92, 56 rue Sadi Carnot, Nanterre, Île-de-France, France</li>\n<li><a href=\"https://www.pcf92.fr/\">https://www.pcf92.fr/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/table-ronde\">table-ronde</a>, <a href=\"https://www.agendadulibre.org/tags/libre\">libre</a>\n</li>\n</ul>\n<h3>[FR Grenoble] <a href=\"https://www.agendadulibre.org/events/19230\">Session Hack du Jeudi</a> - Le jeudi 28 mars 2019 de 19h00 à 23h00.</h3>\n\n<p>Séance du jeudi soir au LOGal</p>\n\n<p>C'est ouvert à tout le monde, vous êtes les bienvenu.e.s</p>\n\n<p>N'hésitez pas à passer nous voir pour rencontrer nos membres, découvrir leurs projets ou participer</p>\n\n<ul>\n<li>Laboratoire Ouvert Grenoblois, 45 rue Nicolas Chorier, Grenoble, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://www.logre.eu/\">https://www.logre.eu</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/log\">log</a>, <a href=\"https://www.agendadulibre.org/tags/hackerspace\">hackerspace</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-acces-libre\">rencontre-acces-libre</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-hebdomadaire\">rencontre-hebdomadaire</a>, <a href=\"https://www.agendadulibre.org/tags/maker\">maker</a>, <a href=\"https://www.agendadulibre.org/tags/diy\">diy</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>\n</li>\n</ul>\n<h3>[FR Paris] <a href=\"https://www.agendadulibre.org/events/18195\">Soirée de Contribution au Libre et contrib'atelier de Framasoft</a> - Le jeudi 28 mars 2019 de 19h30 à 22h00.</h3>\n\n<p><strong>Parinux</strong> propose aux utilisateurs de <strong>logiciels libres</strong> de se réunir régulièrement afin de <strong>contribuer à des projets libres.</strong> En effet, un <strong>logiciel libre</strong> est souvent porté par une communauté de bénévoles et dépend d'eux pour que le logiciel évolue.</p>\n\n<p>Nous nous réunissons donc tous les <strong>jeudis soirs</strong> dans un environnement propice au travail (pas de facebook, pas de télé, pas de jeux vidéos, pas de zombies).</p>\n\n<p>Vous aurez très probablement besoin d'un ordinateur portable, mais électricité et réseau fournis.</p>\n\n<p>En cas de difficulté, vous pouvez joindre un des responsables de la soirée, Emmanuel Seyman (emmanuel (at) seyman.fr), Paul Marques Mota mota (at) parinux.org, ou Magali Garnero (Bookynette) tresorier (at) parinux.org.</p>\n\n<p>Pour obtenir le code d'entrée de la porte cochère, envoyez un mail au responsable.</p>\n\n<p>On peut amener de quoi se restaurer (Franprix, 8 rue du Chemin Vert, ferme à 22h)</p>\n\n<p><a href=\"https://twitter.com/parinux_asso/status/676481935422701568\">Regazouillez sur Twitter</a> - <a href=\"http://wiki.parinux.org/soireescontrib/index\">Wiki des soirées</a></p>\n\n<p><strong>Programme non exhaustif</strong></p>\n\n<ul>\n<li>Fedora (sa traduction)</li>\n<li>Parinux, ses bugs et son infrastructure</li>\n<li>April,… y a toujours quelque chose à faire</li>\n<li>Open Food Facts/ Open Beauty Facts, sa base de données, ses contributeurs, sa roadmap</li>\n<li>Schema racktables, son code</li>\n<li>Agenda du Libre, mise à jour et amélioration du code</li>\n<li>Ubuntu-Fr, son orga, ses événements</li>\n<li>En vente libre, maintenance et commandes</li>\n<li>Open street map, une fois par mois</li>\n<li>Linux-Fr sait faire</li>\n<li>en vente libre</li>\n<li>…</li>\n</ul>\n<p>tout nouveau projet est le bienvenu.</p>\n\n<p>Tous les <strong>1ers</strong> jeudis =&gt; Les associations Ubuntu-fr et <a href=\"https://ouvre-boite.org/\">ouvre-boite</a> organisent une réunion pour leurs membres.</p>\n\n<p>Tous les <strong>2è</strong> jeudis du mois, l'association Wikimedia France propose de contribuer à ses multiples projets</p>\n\n<p>Tous les <strong>3è</strong> jeudis, dès 18h45, le groupe de travail Sensibilisation de l'April se réunit pour réfléchir à mieux communiquer vers le grand public et à 20h30, le groupe transcriptions prend le relais et transcrit ou relit des transcriptions.</p>\n\n<p>Tous les <strong>4è</strong> jeudis, des membres de Framasoft organisent des contrib'atliers et vous invitent à venir participer, tester ou améliorer des logiciels libres</p>\n\n<ul>\n<li>FPH, 38 rue Saint-Sabin, Paris, Île-de-France, France</li>\n<li><a href=\"http://www.parinux.org/\">http://www.parinux.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/parinux\">parinux</a>, <a href=\"https://www.agendadulibre.org/tags/scl\">scl</a>, <a href=\"https://www.agendadulibre.org/tags/soir%C3%A9e-de-contribution-au-libre\">soirée-de-contribution-au-libre</a>, <a href=\"https://www.agendadulibre.org/tags/fph\">fph</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/framasot\">framasot</a>, <a href=\"https://www.agendadulibre.org/tags/contribateliers\">contribateliers</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/18660\">Mozilla Firefox pour les débutants</a> - Le vendredi 29 mars 2019 de 14h00 à 16h00.</h3>\n\n<p><strong>Apprenez à utiliser et paramétrer Firefox, le célèbre navigateur de la Fondation Mozilla.</strong></p>\n\n<p>Firefox est un navigateur web fiable et facile d'utilisation.</p>\n\n<p>Cet atelier destiné aux débutant-es vous proposera d'apprendre à utiliser les principales commandes de Firefox comme par exemple d'ouvrir plusieurs onglets, de consulter l'historique de navigation, de créer des favoris ou encore de faire une capture d'écran.</p>\n\n<p>Vous verrez comment paramétrer et personnaliser votre page d'accueil mais aussi comment ajouter des modules complémentaires ou synchroniser vos paramètres sur tous vos appareils connectés (smartphone, tablette ou ordinateur).</p>\n\n<p><em>Modalités d'inscription sur le site web de la Bibliothèque municipale de Lyon, rubrique Agenda.</em></p>\n\n<ul>\n<li>Médiathèque du Bachut, 2 place du 11 Novembre 1918, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://www.bm-lyon.fr/spip.php?page=agenda_date_id&amp;source=344&amp;date_id=12521\">https://www.bm-lyon.fr/spip.php?page=agenda_date_id&amp;source=344&amp;date_id=12521</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/firefox\">firefox</a>, <a href=\"https://www.agendadulibre.org/tags/mozilla\">mozilla</a>, <a href=\"https://www.agendadulibre.org/tags/logiciel-libre\">logiciel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/navigateur\">navigateur</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/web\">web</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/bm-lyon\">bm-lyon</a>\n</li>\n</ul>\n<h3>[FR Clermont de l'Oise] <a href=\"https://www.agendadulibre.org/events/18511\">Atelier mensuel de sensibilisation et de partage de connaissances autour des logiciels libres</a> - Le vendredi 29 mars 2019 de 14h00 à 16h30.</h3>\n\n<p>Tous les deniers vendredis après-midi du mois, l'association propose une rencontre pour partager des connaissances, des savoir-faire, des questions autour de l'utilisation des logiciels libres, que ce soit à propos du système d'exploitation Linux, des applications libres ou des services en ligne libres.</p>\n\n<p>C'est l'occasion aussi de mettre en avant l'action des associations fédératrices telles que l'April ou Framasoft, dont nous sommes adhérents et dont nous soutenons les initiatives avec grande reconnaissance.</p>\n\n<p>L'atelier aura lieu dans les locaux de nos amis du CAL (Centre d'Animation et de Loisirs) du Clermontois.</p>\n\n<ul>\n<li>CAL du Clermontois, 12 rue du Général Moulin, Clermont de l'Oise, Hauts-de-France, France</li>\n<li><a href=\"https://www.oisux.org/\">https://www.oisux.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/oisux\">oisux</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/april\">april</a>, <a href=\"https://www.agendadulibre.org/tags/framasoft\">framasoft</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>\n</li>\n</ul>\n<h3>[FR Rennes] <a href=\"https://www.agendadulibre.org/events/19246\">Conférence Le logiciel libre face à l'informatique - Richard Stallman</a> - Le vendredi 29 mars 2019 de 16h30 à 19h00.</h3>\n\n<p>Bonjour,</p>\n\n<p>À l'occasion de sa venue pour InOut (<a href=\"http://inout2019.com/\">http://inout2019.com</a>) à l'invitation de l'IMT Atlantique, l'ISTIC, l'IRISA, l'Université de Rennes 1, et l'association Actux (<a href=\"http://actux.eu.org/\">http://actux.eu.org</a>) ont le plaisir de vous inviter à une conférence, de Richard Stallman, le vendredi 29 Mars, de 16h30 à 19h à l'ISTIC</p>\n\n<p>Le logiciel libre face à l'informatique</p>\n\n<p>The Free Software Movement campaigns for computer users' freedom to cooperate and control their own computing. The Free Software Movement developed the GNU operating system, typically used together with the kernel Linux, specifically to make these freedoms possible.</p>\n\n<p>À propos de l'Intervenant</p>\n\n<p>Dr. Richard Stallman launched the free software movement in 1983 and started the development of the GNU operating system (seewww.gnu.org) in 1984.  GNU is free software everyone has the freedom to copy it and redistribute it, with or without changes.  The GNU/Linux system, basically the GNU operating system with Linux added, is used on tens of millions of computers today.  Stallman has received the ACM Grace Hopper Award and the ACM Software and Systems Award, a MacArthur Foundation fellowship, the Electronic Frontier Foundation's Pioneer Award, and the the Takeda Award for Social/Economic Betterment, as well as several doctorates honoris causa, and has been inducted into the Internet Hall of Fame.</p>\n\n<p>Informations pratiques</p>\n\n<p><strong>Conférence en français</strong>  (malgré l'abstract et la bio en anglais).</p>\n\n<p><strong>inscription fortement conseillée</strong>  :<br><a href=\"https://bibliotheques.univ-rennes1.fr/webform/conference-de-richard-m-stallman-listic-29032019\">https://bibliotheques.univ-rennes1.fr/webform/conference-de-richard-m-stallman-listic-29032019</a></p>\n\n<p>Rendez-vous le <strong>vendredi 29 Mars à partir de 16h30 à l'ISTIC</strong><br>\n(Université de Rennes 1 campus Beaulieu) – Amphi P - Bâtiment 12D<br>\n263, avenue du Général Leclerc, 35042 Rennes</p>\n\n<p>Bus C4/C6(/40/41) ; arrêt \"les préales\" ou \"Tournebride\"<br>\nPlan<a href=\"https://osm.org/go/eri2dpt3A-?m=&amp;way=381248508\">https://osm.org/go/eri2dpt3A-?m=&amp;way=381248508</a></p>\n\n<p>Gratuit accès dans la limite des places disponibles accès PMR</p>\n\n<p>Pour aller plus loin</p>\n\n<p>En prélude à la conférence, et en introduction à ces questions, rendez-vous également pour une projection/débat du film La bataille du libre, la veille, le jeudi 28 Mars à 20h15 à l'Arvor<br><a href=\"http://cineactions.alwaysdata.net/jeudi-28-mars/la-bataille-du-libre/\">http://cineactions.alwaysdata.net/jeudi-28-mars/la-bataille-du-libre/</a><br><a href=\"https://peertube.fr/videos/watch/f47c996f-fdd1-4082-941e-4d6f6737a06e\">https://peertube.fr/videos/watch/f47c996f-fdd1-4082-941e-4d6f6737a06e</a></p>\n\n<p>En espérant vous y voir nombreux-ses,</p>\n\n<p>L'équipe organisatrice.</p>\n\n<ul>\n<li>ISTIC, Université Rennes 1, campus Beaulieu – Amphi P – Bâtiment 12D, 263 avenue du Général Leclerc, Rennes, Bretagne, France</li>\n<li><a href=\"http://actux.eu.org/2019/03/conference-le-logiciel-libre-face-a-linformatique-richard-stallman-vendredi-29-mars-2019-istic/\">http://actux.eu.org/2019/03/conference-le-logiciel-libre-face-a-linformatique-richard-stallman-vendredi-29-mars-2019-istic/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/actux\">actux</a>, <a href=\"https://www.agendadulibre.org/tags/conf%C3%A9rence\">conférence</a>, <a href=\"https://www.agendadulibre.org/tags/richard-stallman\">richard-stallman</a>, <a href=\"https://www.agendadulibre.org/tags/irisa\">irisa</a>, <a href=\"https://www.agendadulibre.org/tags/istic\">istic</a>, <a href=\"https://www.agendadulibre.org/tags/in-out\">in-out</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/18666\">Dégooglisons-nous</a> - Le vendredi 29 mars 2019 de 17h00 à 19h00.</h3>\n\n<p>Face au monopole des géants du numérique (Google, Microsoft, Facebook…) générant des profits colossaux sur le traitement et la vente de nos données personnelles, des associations militent pour un internet plus juste, plus transparent et plus libre.</p>\n\n<p>Parmi elles, <em>Framasoft</em>, dont nous vous invitons à venir découvrir les combats et les alternatives pour naviguer, s'informer et échanger autrement sur internet.</p>\n\n<ul>\n<li>Médiathèque de Vaise, place Valmy, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/degooglisons\">degooglisons</a>, <a href=\"https://www.agendadulibre.org/tags/vie-priv%C3%A9e\">vie-privée</a>, <a href=\"https://www.agendadulibre.org/tags/framasoft\">framasoft</a>, <a href=\"https://www.agendadulibre.org/tags/internet\">internet</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/19122\">Permanence Les logiciels libres, parlons-en</a> - Le vendredi 29 mars 2019 de 17h00 à 19h00.</h3>\n\n<p><a href=\"http://montpel-libre.fr/spip.php?article2787\"></a>Les logiciels libres parlons-en Ouvrons le dialogue sur l’ouverture des données Partageons nos expériences pour une meilleure répartition des connaissances.</p>\n\n<p>Cette permanence vous permet de rencontrer le groupe Montpel’libre, ses activités, d’être orienté vers nos ateliers et permanences techniques et d’être accompagné pour une transition digitale progressive et adaptée vers les logiciels libres.</p>\n\n<p><strong>Proposition de programme</strong></p>\n\n<ul>\n<li>discussions autour de l’organisation d’événements</li>\n<li>gestion des groupes de travail</li>\n<li>propositions diverses</li>\n<li>présentation de l’asso</li>\n</ul>\n<p><strong>Montpel’libre</strong> est un Groupe d’Utilisateurs <strong>GNU/Linux</strong> et <strong>Logiciels Libres</strong> qui promeut les logiciels libres, la culture libre et les biens communs.<br>\nNotre association se situe à la jonction des secteurs d’activités du numérique, des industries culturelles et créatives, de l’économie sociale et solidaire, du développement durable, de la recherche et formation ainsi que de l’éducation populaire et de l’éducation scientifique.<br>\nElle s’adresse à l’informaticien comme au néophyte, au particulier comme au professionnel ou à l’étudiant et à un public de tout âge.</p>\n\n<p>Montpel’libre exerce des activités multiples autour de six pôles</p>\n\n<ol>\n<li> PERMANENCES</li>\n<li> ATELIERS</li>\n<li> CONFÉRENCES / FORMATIONS / EXPERTISE</li>\n<li> ÉVÉNEMENTIEL</li>\n<li> TECHNIQUE / SÉCURITÉ</li>\n<li> PUBLICATION</li>\n</ol>\n<p>Et de plusieurs communautés et groupes de travail.</p>\n\n<p>Ces permanences sont suivies d’un <strong>Apéro refaire le monde</strong> convivial et partagé, de 18h30 à 21h30. Elles ont lieu au Faubourg marché, tous les vendredis de 17h00 à 19h00.<br><strong>Permanences</strong></p>\n\n<ul>\n<li>vendredi 1 mars 2019 de 17h00 à 19h00</li>\n<li>vendredi 8 mars 2019 de 17h00 à 19h00</li>\n<li>vendredi 15 mars 2019 de 17h00 à 19h00</li>\n<li>vendredi 22 mars 2019 de 17h00 à 19h00</li>\n<li>vendredi 29 mars 2019 de 17h00 à 19h00</li>\n</ul>\n<p><a href=\"http://lefaubourg-montpellier.org/\"></a></p>\n\n<p>Entrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie <a href=\"http://lefaubourg-montpellier.org/\"><strong>Le Faubourg Marché</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Vendredis 1, 8, 15, 22 et 29 Mars 2019 de 17h00 à 19h00 (tous les vendredis sauf fériés)<br>\nLe Faubourg - 15, rue du Faubourg de Nîmes, 34000 Montpellier<br><a href=\"http://montpel-libre.fr/spip.php?article2787\">Inscription nécessaire</a></p>\n\n<ul>\n<li>Le Faubourg, 15 rue du Faubourg de Nîmes, Montpellier, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/permanence\">permanence</a>, <a href=\"https://www.agendadulibre.org/tags/faubourg-march%C3%A9\">faubourg-marché</a>, <a href=\"https://www.agendadulibre.org/tags/ap%C3%A9ro\">apéro</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/19192\">Formation Signature de clés PGP, Key signing party</a> - Le vendredi 29 mars 2019 de 17h00 à 18h00.</h3>\n\n<p><a href=\"http://montpel-libre.fr/spip.php?article2787\"></a>Séance de signature collective de clés PGP et partage d’expérience</p>\n\n<p>Une fois par mois, nous vous proposons un rendez-vous collectif de 30 minutes pour signer vos clés PGP.</p>\n\n<p>Votre crédibilité dans toile de confiance PGP sera ainsi renforcée par la signature des autres participants.</p>\n\n<p>Ce rendez-vous vous permettra aussi, après la séance de signature, d’échanger avec des utilisateurs de la technologie PGP et d’améliorer vos compétences dans ce domaine.</p>\n\n<p>En <strong>cryptographie</strong>, une <strong>key signing party</strong> est un événement au cours duquel des internautes s’échangent des informations relatives à leur clé publique <strong>PGP</strong>.</p>\n\n<p>L’échange se fait de visu, de la main à la main. En partant du principe qu’une clé publique appartient réellement à la personne qui le prétend, les participants signent numériquement le certificat contenant cette clé publique, le nom de la personne, et diverses informations avant de passer à la personne suivante</p>\n\n<p>Les questions que vous n’allez pas manquer de vous poser au sujet de ces rencontres</p>\n\n<ul>\n<li>Pourquoi utiliser des clés PGP</li>\n<li>Pourquoi signer les clés PGP</li>\n<li>Comment optimiser la signature de clés PGP</li>\n<li>Mise en place des rencontres de signature de clés PGP</li>\n<li>Communication relative aux rencontres de signature de clés PGP</li>\n</ul>\n<p>Ces rencontres sont destinées aux personnes utilisatrices de clés PGP et qui désirent créer ou élargir leur toile de confiance.</p>\n\n<p>De quoi parlons-nous<br>\nLes clés PGP sont des clés cryptographiques de type publique/privée permettant</p>\n\n<ul>\n<li>De chiffrer les communications et les documents. Seul le destinataire pourra prendre connaissance des données qui lui ont été transmises. Un tiers ayant intercepté les données aura beaucoup de mal à les déchiffrer.</li>\n<li>De s’assurer de l’identité des personnes ou des institutions ayant créé des documents Il est possible de vérifier l’origine des informations en utilisant la signature électronique de l’émetteur. L’usurpation d’identité est rendue très difficile par l’usage de la signature électronique.</li>\n</ul>\n<p>Mise en place des rencontres de signature de clés PGP<br>\nIl est proposé d’organiser une rencontre par mois. Cette rencontre se déroulera en deux parties</p>\n\n<ul>\n<li>30 minutes consacrées au traitement des promesses de signatures de clé PGP</li>\n<li>30 minutes d’information dédiées aux concepts des clés PGP et à leur signature</li>\n</ul>\n<p><strong>Les dates</strong><br>\nLe dernier vendredi de chaque mois sauf vacances, de 17h00 à 18h00</p>\n\n<ul>\n<li>Vendredi 28 septembre 2018 de 17h00 à 18h00</li>\n<li>Vendredi 26 octobre 2018 de 17h00 à 18h00</li>\n<li>Vendredi 30 novembre 2018 de 17h00 à 18h00</li>\n<li>Vendredi 28 décembre 2018 de 17h00 à 18h00</li>\n<li>Vendredi 25 janvier 2018 de 17h00 à 18h00</li>\n<li>Vendredi 22 février 2018 de 17h00 à 18h00</li>\n<li>Vendredi 29 mars 2018 de 17h00 à 18h00</li>\n<li>Vendredi 26 avril 2018 de 17h00 à 18h00</li>\n<li>Vendredi 31 mai 2018 de 17h00 à 18h00</li>\n<li>Vendredi 28 juin 2018 de 17h00 à 18h00</li>\n</ul>\n<p><a href=\"http://montpel-libre.fr/stock/documents/Crypto/rencontres_signatures_cles_pgp.htm\"></a></p>\n\n<p>Vendredi 29 mars 2019 de 17h00 à 18h00 (le dernier vendredi)<br>\nLe Faubourg - 15, rue du Faubourg de Nîmes, 34000 Montpellier<br><a href=\"http://montpel-libre.fr/spip.php?article2787\">Inscription nécessaire</a></p>\n\n<ul>\n<li>Le Faubourg, 15 rue du Faubourg de Nîmes, Montpellier, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/pgp\">pgp</a>, <a href=\"https://www.agendadulibre.org/tags/signature\">signature</a>, <a href=\"https://www.agendadulibre.org/tags/key-signing-party\">key-signing-party</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[BE Antoing] <a href=\"https://www.agendadulibre.org/events/19247\">Install-Party</a> - Le vendredi 29 mars 2019 de 18h00 à 20h00.</h3>\n\n<p>Dans le cadre de la fête du libre, ce vendredi 29 mars nous organisons notre première install-party venez découvrir et/ou installer Linux Mint-)</p>\n\n<p>Vous pouvez apporter votre tour ou votre portable, en ayant pris soin de faire des sauvegardes <strong>avant l'atelier</strong> (nous déclinons toute responsabilité en cas de perte totale des données).</p>\n\n<p>Le nombre de place dans notre salle étant limité à 10, les inscriptions via e-mail sont à effectuer au maximum 24h avant l'atelier)</p>\n\n<ul>\n<li>Foyer Socio Culturel Antoing, rue du Burg, 23, Antoing, Hainaut, Belgique</li>\n<li><a href=\"https://antoinix.frama.site/\">https://antoinix.frama.site</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/linux-mint\">linux-mint</a>, <a href=\"https://www.agendadulibre.org/tags/logiciel-libre\">logiciel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/antoinix\">antoinix</a>\n</li>\n</ul>\n<h3>[FR Insming] <a href=\"https://www.agendadulibre.org/events/19087\">Fracture numérique et sociale recours aux logiciels libres et gratuits</a> - Le vendredi 29 mars 2019 de 20h00 à 22h00.</h3>\n\n<p>Conférence + réponse aux questions</p>\n\n<p>Linux et les logiciels libres Intérêt pour les particuliers. Intérêt pour faire face à la fracture numérique et sociale.</p>\n\n<p>Inscription à un atelier de formation sur Linux pour débutants création d'un diaporama musical</p>\n\n<ul>\n<li>Médiathèque de Insming, 1 rue Saint Jacques, Insming, Grand Est, France</li>\n<li><a href=\"http://www.optim-ordi.com/\">http://www.optim-ordi.com</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/formation\">formation</a>, <a href=\"https://www.agendadulibre.org/tags/conf%C3%A9rence\">conférence</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>\n</li>\n</ul>\n<h3>[FR Sizun] <a href=\"https://www.agendadulibre.org/events/19255\">Cartopartie à Sizun</a> - Le samedi 30 mars 2019 de 09h00 à 17h00.</h3>\n\n<p>Dans la cadre de la <a href=\"https://www.paysdemorlaix.com/la-semaine-des-usages-numeriques-2019/\">semaine des usages numériques</a> au Pays de Morlaix</p>\n\n<p>Vous êtes adepte de la randonnée pédestre ou cycliste,</p>\n\n<p>Vous vous intéressez au patrimoine ou au tourisme,</p>\n\n<p>Vous êtes bretonnant(e),</p>\n\n<p>Vous aimeriez partager vos connaissances sur Sizun,</p>\n\n<p>Vous êtes curieux et toujours prêt à partager un moment convivial et utile à la vie de votre commune,</p>\n\n<p>Vous avez loupé la cartopartie de l'an dernier  Ou vous avez participé et vous avez adoré</p>\n\n<p>On remet ça cette année <em>(</em><em><a href=\"http://carterra.net/w/wakka.php?wiki=OSMSizun\">Voir quelques résultats des productions de l'année dernière</a></em><em>)</em></p>\n\n<p>Venez cartographier, partagez vos connaissances, prendre des photos du patrimoine local, des chemins, des commerces,… en bref venez découvrir les possibilité qu'offre la cartographie collaborative avec les outils OpenStreetMap (OSM).</p>\n\n<p>Que vous ayez une heure, une demi-journée ou une journée, venez nous rejoindre et nous aider à enrichir la connaissance du territoire grâce à OSM.</p>\n\n<p><strong>Au programme </strong></p>\n\n<p><strong>9h- 12h atelier pratique sur inscription</strong> à <a href=\"mailto:contact@pays-de-landivisiau.com\">contact@pays-de-landivisiau.com</a> ou au 02 98 68 42 41</p>\n\n<p> On vous expliquera tout sur OSM, cartographie collaborative. L’atelier vous permettra de voir tout ce qui a été réalisé lors de la 1ère cartopartie et d'apprendre à cartographier, faire vos cartes et utiliser des outils de production d'images pour montrer la commune.</p>\n\n<p>Apportez votre sandwich, on vous offrira le café.</p>\n\n<p><strong>13h – 17h cartopartie ouverte</strong></p>\n\n<p>On ira sur le terrain, faire des relevés des chemins, des éléments du patrimoine, des noms de lieux, … et hop, on mettra en ligne.</p>\n\n<p>17h on fait le point sur les réalisations de la journée autour d'un pot convivial et vous pourrez repartir avec des cartes papier de la commune.</p>\n\n<p>Au plaisir de vous voir dans cette belle commune</p>\n\n<p>organisée par La CdC du Pays de Landivisiau, Pays de Morlaix et Tiriad.</p>\n\n<ul>\n<li>Médiathèque de Sizun,2 rue de Brest, Sizun, Bretagne, France</li>\n<li><a href=\"https://www.paysdemorlaix.com/la-semaine-des-usages-numeriques-2019/\">https://www.paysdemorlaix.com/la-semaine-des-usages-numeriques-2019/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/openstreetmap\">openstreetmap</a>, <a href=\"https://www.agendadulibre.org/tags/osm\">osm</a>, <a href=\"https://www.agendadulibre.org/tags/cartographie\">cartographie</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>\n</li>\n</ul>\n<h3>[FR Beauvais] <a href=\"https://www.agendadulibre.org/events/18515\">Les solutions alternatives Framasoft.org</a> - Le samedi 30 mars 2019 de 09h30 à 10h00.</h3>\n\n<p>\"Le respect des libertés fondamentales des utilisatrices et utilisateurs, garanties par des contrats légaux (les <a href=\"https://fr.wikipedia.org/wiki/Licence_libre\">licences libres</a>), est au cœur du mouvement libriste et permet de s’assurer que l’humain reste en maîtrise de l’outil numérique.</p>\n\n<p>Le but de <a href=\"https://framasoft.org/\"><strong>Frama</strong><strong>soft</strong></a> est de proposer, principalement en ligne, un ensemble d’outils concrets et pratiques visant à faciliter l’adoption</p>\n\n<ul>\n<li>de logiciels libres (annuaire, clés USB, installateur…) ;</li>\n<li>de créations culturelles libres (blog, traduction, maison d’édition…) ;</li>\n<li>de services libres (plus de 30 dans le projet <a href=\"https://degooglisons-internet.org/\"><strong>Dégooglisons</strong> <strong>Internet</strong></a>).\"</li>\n</ul>\n<p>Venez découvrir à l'Ecospace les services en ligne mis en démonstration par Framasoft.</p>\n\n<ul>\n<li>Ecospace, 136 rue de la Mie au Roy, Beauvais, Hauts-de-France, France</li>\n<li><a href=\"https://www.oisux.org/\">https://www.oisux.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/oisux\">oisux</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/framasoft\">framasoft</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/chaton\">chaton</a>\n</li>\n</ul>\n<h3>[FR Kergrist-Moëlou] <a href=\"https://www.agendadulibre.org/events/18919\">Journée de rencontre \"Le numérique, ça nous regarde\"</a> - Le samedi 30 mars 2019 de 09h30 à 16h30.</h3>\n\n<p>Des acteurs et actrices de l’éducation populaire avec des acteurs et actrices d’un numérique libre, éthique, décentralisé et solidaire en Bretagne vous invitent le vendredi 29 mars (soirée conférence gesticulée) et le samedi 30 mars 2019 à Kergrist-Moëlou (22).</p>\n\n<p>Nous, animateurs, gestionnaires, administrateurs, salariés et bénévoles d’associations et de fédérations d’éducation populaire, ne pouvons plus esquiver la question de savoir dans quelles mesures nos <strong>valeurs</strong> et nos <strong>pratiques</strong> sont impactées par la galopante évolution des habitudes et des comportements de nos contemporains.</p>\n\n<p>Quels que soient nos terrains de prédilection <em>(environnement, enfance-jeunesse, sport, insertion, patrimoine, santé, handicap, etc.)</em>, il nous faut adopter un positionnement clair sur les opportunités et les dangers du numérique, de l’échelle locale à l’échelle planétaire, et tenter d’être dans des choix motivés plutôt que devant des faits accomplis.</p>\n\n<ul>\n<li>Salle des fêtes, Kergrist-Moëlou, Bretagne, France</li>\n<li><a href=\"http://www.ubapar.bzh/spip.php?article1272\">http://www.ubapar.bzh/spip.php?article1272</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/acteur-du-libre\">acteur-du-libre</a>, <a href=\"https://www.agendadulibre.org/tags/conf%C3%A9rence\">conférence</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>, <a href=\"https://www.agendadulibre.org/tags/numerique\">numerique</a>, <a href=\"https://www.agendadulibre.org/tags/education-populaire\">education-populaire</a>\n</li>\n</ul>\n<h3>[FR Lyon] <a href=\"https://www.agendadulibre.org/events/17191\">Technique de cartographie et d’édition</a> - Le samedi 30 mars 2019 de 10h00 à 12h00.</h3>\n\n<p><em>Animé conjointement par les associations OSM (OpenStreetMap) et Wikimédia</em></p>\n\n<p><strong>Gratuit (Inscription obligatoire  à <a href=\"mailto:epn@salledesrancy.com\">epn@salledesrancy.com )</a></strong></p>\n\n<p>Les contributeurs OSM (OpenStreetMap) et Wikimedia s’associent pour proposer des ateliers conjoints à la contribution collaborative de la carte OpenStreetMap ou à des projets Wikipedia, Wikidata, Wikisource,…</p>\n\n<p>L’objectif est de découvrir les règles et les usages associés à différents projets de connaissance libre (cartographique, encyclopédique…) pour apprendre à contribuer à leur enrichissement, et à utiliser leurs données.</p>\n\n<p>Créer ses comptes, faire des reports/créations d’informations géographiques sur la carte, contribuer à la Base Adresses Nationale Ouverte (BANO), explorer la richesse de la base de données OSM et des contenus des bases wikipédia, wikidata, wikidictionnaire, wikisource.. Réaliser des cartes personnalisées, éditer des articles encyclopédiques</p>\n\n<p><strong>Venez nombreux</strong></p>\n\n<ul>\n<li>Maison pour Tous / Salle des Rancy, 249 rue Vendôme, Lyon, Auvergne-Rhône-Alpes, France</li>\n<li><a href=\"https://epn.salledesrancy.com/osm-samedi-10h-12h-2/\">https://epn.salledesrancy.com/osm-samedi-10h-12h-2/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/epn-des-rancy\">epn-des-rancy</a>, <a href=\"https://www.agendadulibre.org/tags/osm\">osm</a>, <a href=\"https://www.agendadulibre.org/tags/openstreetmap\">openstreetmap</a>, <a href=\"https://www.agendadulibre.org/tags/wikip%C3%A9dia\">wikipédia</a>, <a href=\"https://www.agendadulibre.org/tags/cartographie\">cartographie</a>, <a href=\"https://www.agendadulibre.org/tags/%C3%A9dition\">édition</a>, <a href=\"https://www.agendadulibre.org/tags/contribution\">contribution</a>, <a href=\"https://www.agendadulibre.org/tags/collaboratif\">collaboratif</a>, <a href=\"https://www.agendadulibre.org/tags/wikimedia\">wikimedia</a>\n</li>\n</ul>\n<h3>[FR Nanterre] <a href=\"https://www.agendadulibre.org/events/18976\">Éthique et philosophie des logiciels libres en démocratie numérique</a> - Le samedi 30 mars 2019 de 10h00 à 12h30.</h3>\n\n<p>Dans le cadre de Libre en fête.</p>\n\n<p>L'Agora propose des échanges avec <a href=\"https://www.opensourcepolitics.eu/\">Open Source Politics</a>, développeurs de plateformes numériques libres et open source qui favorisent la participation des citoyens à la prise de décisions politiques.</p>\n\n<p>Vous pourrez aussi participer à des ateliers contributifs pour découvrir la plateforme collaborative <a href=\"https://participez.nanterre.fr/\">Participez.nanterre.fr</a></p>\n\n<p>Inscription obligatoire  01.71.11.43.54</p>\n\n<ul>\n<li>Agora, Maison des initiatives citoyennes, 20 rue de Stalingrad, Nanterre, Île-de-France, France</li>\n<li><a href=\"https://www.nanterre.fr/247-l-agora-maison-des-initiatives-citoyennes.htm\">https://www.nanterre.fr/247-l-agora-maison-des-initiatives-citoyennes.htm</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/contributeurs\">contributeurs</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>\n</li>\n</ul>\n<h3>[FR Rouen] <a href=\"https://www.agendadulibre.org/events/19044\">Journée Mensuelle du Logiciel Libre</a> - Le samedi 30 mars 2019 de 14h00 à 18h00.</h3>\n\n<p>Le samedi 30 Mars 2019, nous organisons notre <strong>J</strong>ournée <strong>M</strong>ensuelle du <strong>L</strong>ogiciel <strong>L</strong>ibre à la <strong>Maison St Sever</strong> à <strong>Rouen</strong>. (Centre Commercial St Sever, 10-12 rue Saint-Julien 76100 Rouen) de 14h00 à 18h00.</p>\n\n<p>On fera connaissance avec la toute dernière version de openSUSE, la <strong>openSUSE Leap 15</strong>, Gnome 3.26, LibreOffice 6.1 et beaucoup d’autres distributions Linux.</p>\n\n<p>SUSE Linux Enterprise 15 SP1 (beta) sera aussi de la partie et comme vous le savez est la pièce maitresse de openSUSE Leap 15 et qui est aussi maintenue par des ingénieurs SUSE.</p>\n\n<p><strong>Nous distribuerons gracieusement des DVDs openSUSE 15 de 64 Bits à nos visiteurs dans la limite du stock disponible.</strong></p>\n\n<p>Le <strong>Raspberry</strong> Pi 3 ainsi que les <strong>Raspberry</strong> Pi 2 seront aussi à votre disposition pour votre plaisir de coder</p>\n\n<p>On pourra discuter du Noyau 4.20.13 (<a href=\"https://www.google.com/search?num=100&amp;newwindow=1&amp;client=firefox-b&amp;q=22+octobre+2018&amp;stick=H4sIAAAAAAAAAONgVhLQL9E3sjRLtjQrqDTKLTAoAADVz14sFAAAAA&amp;sa=X&amp;ved=2ahUKEwjT9ODF7ODfAhUMeKwKHbfZCAQQmxMoATBzegQIBBAO\">27 février 2019</a>), si le temps le permet.</p>\n\n<p>Voici aussi une liste des démonstrations de logiciels libres (FOSS) que nous vous proposerons<br><a href=\"https://nui.fr/blog/logiciels-libres-a-vous-proposer-comme-installation/\">https://nui.fr/blog/logiciels-libres-a-vous-proposer-comme-installation/</a></p>\n\n<p>Si vous voulez présenter une distribution Linux ou un <strong>logiciel libre</strong>, contactez-moi assez rapidement pour la logistique.</p>\n\n<p>Nous allons axer des sessions sur l’interopérabilité, de sorte de vous orienter vers une migration en douceur vers le logiciel libre. L'interopérabilité a toujours été notre fer de lance.</p>\n\n<p><strong>STOP PRESSE</strong> <em>Nous aurions des magazines à distribuer et couvrant openSUSE Leap 15 Linux..</em></p>\n\n<hr>\n<ul>\n<li>Rez de chaussée, maison Saint Sever, 10-12 rue Saint-Julien, Rouen, Normandie, France</li>\n<li><a href=\"https://www.nui.fr/\">https://www.nui.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/opensuse\">opensuse</a>, <a href=\"https://www.agendadulibre.org/tags/interop%C3%A9rabilit%C3%A9\">interopérabilité</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/github\">github</a>, <a href=\"https://www.agendadulibre.org/tags/suse\">suse</a>, <a href=\"https://www.agendadulibre.org/tags/raspberry-pi\">raspberry-pi</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/wordpress\">wordpress</a>\n</li>\n</ul>\n<h3>[BE Grivegnée] <a href=\"https://www.agendadulibre.org/events/17323\">Linux Install Party</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Venez rencontrer une équipe de passionnés, tous les derniers samedis du mois, de septembre à juin, de 14h00 à 17h00 pour venir installer un Linux sur votre ordinateur.</p>\n\n<p>On y installera ce que vous voulez ou, si vous n’avez pas d’idée, on cherchera avec vous ce qui vous conviendra le mieux.</p>\n\n<ul>\n<li>Espace Cyber Seniors, rue Fraischamps 74b, Grivegnée, Liège, Belgique</li>\n<li><a href=\"https://www.facebook.com/Linux-install-party-%C3%A0-Li%C3%A8ge-734962273314869/\">https://www.facebook.com/Linux-install-party-%C3%A0-Li%C3%A8ge-734962273314869/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/gnu-linux\">gnu-linux</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/installation\">installation</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>\n</li>\n</ul>\n<h3>[FR Marseille] <a href=\"https://www.agendadulibre.org/events/17358\">Install Party GNU/Linux</a> - Le samedi 30 mars 2019 de 14h00 à 19h00.</h3>\n\n<p>L’association <strong><a href=\"https://cercll.wordpress.com/\">CercLL</a></strong> (<strong>CercLL d’Entraide et Réseau Coopératif autour des Logiciels Libres)</strong> vous invite à une install party <strong>GNU/Linux</strong>, le <strong>samedi 30 mars 2019 de 14h00 à 19h00</strong>, dans la salle du <strong><a href=\"https://foyerdupeuple.wordpress.com/\">Foyer du Peuple</a> 50 rue Brandis 13005 Marseille.</strong></p>\n\n<p>Vous avez envie de découvrir un système d’exploitation libre, simple d’utilisation, stable, rapide et sécurisé. Une nouvelle façon d’utiliser votre ordinateur.</p>\n\n<p>Vous vous sentez une affection naissante pour le <strong>Gnou</strong> et le <strong>Manchot</strong>, les mascottes de <strong>GNU/ Linux.</strong></p>\n\n<p>Au programme</p>\n\n<p><strong>DÉCOUVERTE de l’univers des logiciels libres.</strong></p>\n\n<p><strong>INSTALLATION d’un environnement GNU/ Linux</strong>, ainsi que le meilleur des <strong>logiciels libres</strong>.</p>\n\n<p>Venez avec votre ordinateur, nous installerons ensemble une distribution <strong>GNU/Linux</strong> avec un ensemble de <strong>logiciels libres</strong> et <strong>gratuits</strong> pour une utilisation quotidienne.</p>\n\n<p><strong>Ouvert à tous – accessible aux débutant-e-s</strong></p>\n\n<p>Une participation de 2 euros est demandée.</p>\n\n<p>L’adhésion à l’association est de 20 euros annuelle.(L’adhésion n’est pas obligatoire).</p>\n\n<p><a href=\"http://www.openstreetmap.org/way/143299691\">Plan d’accés</a></p>\n\n<ul>\n<li>Foyer du peuple, 50 rue Brandis, Marseille, Provence-Alpes-Côte d'Azur, France</li>\n<li><a href=\"https://cercll.wordpress.com/espace-evenement\">https://cercll.wordpress.com/espace-evenement</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/cercll\">cercll</a>, <a href=\"https://www.agendadulibre.org/tags/foyer-du-peuple\">foyer-du-peuple</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/gnu-linux\">gnu-linux</a>, <a href=\"https://www.agendadulibre.org/tags/ubuntu\">ubuntu</a>, <a href=\"https://www.agendadulibre.org/tags/xubuntu\">xubuntu</a>, <a href=\"https://www.agendadulibre.org/tags/debian\">debian</a>, <a href=\"https://www.agendadulibre.org/tags/mageia\">mageia</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Alençon] <a href=\"https://www.agendadulibre.org/events/18494\">Journée (du) Libre</a> - Du samedi 30 mars 2019 à 14h00 au dimanche 31 mars 2019 à 01h00.</h3>\n\n<p>Organisation d'une journée de sensibilisation au numérique autrement et aux logiciels libres dans le cadre de l'évènement national de l'APRIL <a href=\"https://www.libre-en-fete.net/\">Libre en Fête</a></p>\n\n<p>Au programme, dès 14 h<br>\n- L’<a href=\"https://linuxfr.org/expolibre.org\">Expolibre</a><br>\n- Les formats ouverts<br>\n- LAN libre<br>\n- Logiciels et services libres<br>\n- atelier semences libre par Les Courts Circuits<br>\n- librairie libre sur le libre</p>\n\n<p>Dès 15 h conférences</p>\n\n<p>À 15h, intimité numérique et sécurité des réseaux publics par Damin Quinton et Charles-Edouard Toutain</p>\n\n<p>À 16 h, Libre et Santé Que devient la déontologique médicale à<br>\nl’ère numérique par Nicolas Floquet.</p>\n\n<p>À 17h, les Enjeux du numérique à l'échelle européenne et française. par Dr. Alexandre Schon et M. Victor Abonneau</p>\n\n<p>19 h concerts<br>\nAdieu mes très belles (Domaine publique)<br>\nLDG live machine (Musique pirate)<br>\nRob0y (Musique Libre)<br>\nVous êtes libres de venir à la Journée {du} Libre,<br>\nlibres de comprendre cette journée, libres de la<br>\ncopier et libres d’y contribuer.</p>\n\n<ul>\n<li>Chapêlmêle, 41 chemin des châtelets, Alençon, Normandie, France</li>\n<li><a href=\"http://asso-esthix.org/\">http://asso-esthix.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/numeriques\">numeriques</a>\n</li>\n</ul>\n<h3>[FR Schiltigheim] <a href=\"https://www.agendadulibre.org/events/18775\">Install Party Linux</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Vous avez un ordinateur fixe ou portable avec un Windows Vista, Seven, 10, ou encore XP et celui-ci est lent ou avec des logiciels indésirables Votre utilisation de l’ordinateur se limite à consulter vos mails, stocker vos photos et films de vacances ainsi qu’à faire quelques recherches sur Internet. Vous avez envie d’essayer ou d’adopter un nouveau système plus basé sur une philosophie due partage de connaissances et respectueux de votre vie privée</p>\n\n<p>Pour vous accompagner dans la transition, l’association Desclicks – L’Informatique Solidaire organise le <strong>samedi 30 mars de 14h à 17h</strong> une Install Party Linux dans ses locaux du 3 rue St Paul. Au cours de l’Install Party vous pourrez tester un système Linux directement sur votre ordinateur et apprendre à l’installer avec l’aide des bénévoles engagés dans l’association.</p>\n\n<p>Une distribution Linux – <a href=\"https://www.ubuntu-fr.org/\">Ubuntu</a> ou <a href=\"https://www.linuxmint.com/download.php\">LinuxMint</a> par exemple – est un ensemble de programmes permettant de faire fonctionner rapidement votre ordinateur en utilisant moins de ressources que peuvent le faire les alternatives commerciales comme les systèmes Microsoft. Ces distributions vous permettent de travailler directement avec des outils Libres LibreOffice pour la bureautique, Firefox pour Internet et Thunderbird pour vos mails.</p>\n\n<p>De nombreux programmes sont également installables facilement via une logithèque intégrée. La majeure partie des programmes intégrés et disponibles via la logithèque sont Libres. Cela signifie qu’ils offrent à chacun les libertés d’utiliser, d’étudier, de (re)distribuer et de modifier leur fonctionnement afin de les améliorer.</p>\n\n<p>Quelques conseils pour passer une bonne Install party</p>\n\n<ul>\n<li>\n<strong>Sauvegardez vos données</strong> avant de venir (documents, musiques et films de vacances) sur un support externe</li>\n<li>Défragmentez votre système Windows si vous souhaitez y conserver un accès</li>\n<li>Envoyez-nous un petit message pour nous dire que vous venez  à contact AT desclicks POINT net.</li>\n<li>N’hésitez pas à <a href=\"http://www.desclicks.net/contact/\">nous contacter</a> si vous avez des questions</li>\n</ul>\n<p>Cette édition s’inscrit dans le cadre national de la 18eme édition de <a href=\"http://libre%20en%20f%C3%AAte/\"><strong>Libre En Fête</strong></a> initié par l’<a href=\"https://april.org/\">APRIL</a>. Découvrez les autres événements sur<a href=\"https://linuxfr.org/maps?tag=libre-en-fete-2019&amp;future=false\"> l’agenda la carte</a>.</p>\n\n<ul>\n<li>Desclicks, 3 rue St Paul, Schiltigheim, Grand Est, France</li>\n<li><a href=\"https://desclicks.net/\">https://desclicks.net</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/linux\">linux</a>, <a href=\"https://www.agendadulibre.org/tags/ubuntu\">ubuntu</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/gnu-linux\">gnu-linux</a>, <a href=\"https://www.agendadulibre.org/tags/linux-mint\">linux-mint</a>\n</li>\n</ul>\n<h3>[FR Saint-Cyr-l'École] <a href=\"https://www.agendadulibre.org/events/18840\">Permanence Root66</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Root66 vous propose une permanence Logiciels Libres le samedi 30 mars</p>\n\n<p>La permanence se tiendra au Centre Pierre Semard à Saint-Cyr-l'École (à deux pas de la gare RER C)</p>\n\n<p>Dans cette permanence nous discuterons des logiciels libres, nous vous proposerons un accompagnement technique aux systèmes d’exploitation libres GNU/Linux, et cela afin de vous aider à vous familiariser avec.</p>\n\n<p>Le contenu s’adapte aux problèmes des personnes présentes et permet ainsi l’acquisition de nouvelles compétences au rythme de chacun.</p>\n\n<p><strong>Programme</strong>:</p>\n\n<p>Vous pourrez y aborder plusieurs thèmes</p>\n\n<ul>\n<li>Discussions conviviales entre utilisateurs autour de Linux en général</li>\n<li>Premières explorations du système</li>\n<li>Installations et configurations complémentaires</li>\n<li>Mise à jour et installation de nouveaux logiciels</li>\n<li>Prise en main, découverte et approfondissement du système</li>\n</ul>\n<p>Entrée libre et gratuite</p>\n\n<p>Sur place, l'adhésion à l’association est possible mais non obligatoire</p>\n\n<ul>\n<li>Centre Pierre Semard, 13 place Pierre Semard, Saint-Cyr-l'École, Île-de-France, France</li>\n<li><a href=\"https://root66.net/\">https://root66.net</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/root66\">root66</a>, <a href=\"https://www.agendadulibre.org/tags/permanence\">permanence</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/installation\">installation</a>, <a href=\"https://www.agendadulibre.org/tags/gnu%2Flinux\">gnu/linux</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre-acces-libre\">rencontre-acces-libre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Caen] <a href=\"https://www.agendadulibre.org/events/19025\">Install Party GNU/Linux</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Vous souhaitez installer GNU/Linux</p>\n\n<p>Venez à notre rencontre ce samedi 30 mars à partir de 14h à l'Espace Culturel TANDEM.</p>\n\n<p>Nous répondrons à vos questions et vous aiderons à choisir et installer une distribution GNU/Linux sur votre machine, ou simplement l'essayer.</p>\n\n<p>Attention, pensez à faire une sauvegarde de vos données avant de venir</p>\n\n<ul>\n<li>Espace Culturel Tandem, 8 rue Nicolas Oresme, Caen, Normandie, France</li>\n<li><a href=\"http://www.calvix.org/index.php/contact\">http://www.calvix.org/index.php/contact</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/calvix\">calvix</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/gnu%2Flinux\">gnu/linux</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[BE Grivegnée] <a href=\"https://www.agendadulibre.org/events/19154\">Linux Install Party Liège</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Tous les derniers samedi du mois, de septembre à juin et de janvier à novembre, quelques passionnés vous aident à installer Linux sur votre machine et vous donnent, autant que faire se peut, les réponses aux questions que vous vous posez sur ce système d'exploitation. Il n'y a pas de distribution privilégiée, nous vous aiderons à choisir selon votre usage et, évidemment, le mieux adapté à la machine sur laquelle vous voulez l'installer.</p>\n\n<p>Gratuit et accessible à tous.</p>\n\n<p>Si vous êtes senior, vous pouvez participer aux ateliers libres Eneo (libre dans le sens où il n'y a pas de thème) qui ont lieu tous les mercredis de 9h30 à 12h30 dans le même local.</p>\n\n<p>Il faut être membre d'Eneo et une participation aux frais de 2 est demandée par séance.</p>\n\n<ul>\n<li>Eneo, espace Cybersenior, rue Fraischamps 74b, Grivegnée, Liège, Belgique</li>\n<li><a href=\"https://jhc-info.be/linux-install-party-liege/\">https://jhc-info.be/linux-install-party-liege/</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>\n</li>\n</ul>\n<h3>[FR Lorient] <a href=\"https://www.agendadulibre.org/events/19190\">Atelier d'initiation à Wikipédia</a> - Le samedi 30 mars 2019 de 14h00 à 18h00.</h3>\n\n<p>Dans le cadre du Mois international de la contribution francophone, un atelier de formation à <a href=\"https://fr.wikipedia.org/wiki/Wikip%C3%A9dia:Accueil_principal\">Wikipedia</a> est organisé le samedi 30 mars de 14h à 18h.</p>\n\n<p>L'objectif principal est de permettre aux participants de rencontrer des contributeurs expérimentés, de former les néophytes sur les règles de Wikipédia, puis d'améliorer et de créer des articles.</p>\n\n<p>Entrée libre</p>\n\n<ul>\n<li>Espace multimédia PLL, 80 avenue Général de Gaulle, Lorient, Bretagne, France</li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/wikipedia\">wikipedia</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/initiation\">initiation</a>\n</li>\n</ul>\n<h3>[FR Béziers] <a href=\"https://www.agendadulibre.org/events/19193\">Atel’libre Grappe de bureau</a> - Le samedi 30 mars 2019 de 14h00 à 17h00.</h3>\n\n<p>Atelier de démonstration dans un espace public ouvert.</p>\n\n<p>L’objectif de cet atelier est de comprendre le fonctionnement d’un ordinateur, découvrir des alternatives libres pour s’équiper simplement et à moindre coût</p>\n\n<p>Grappe de bureau consiste à la construction d’un PC libre.</p>\n\n<p>Animé par Montpel’libre, cet atelier aura lieu de 14h00 à 17h00, au pôle actualité, pour tout public.</p>\n\n<p>À partir de matériels et logiciels entièrement libres, Montpel’libre nous montrera comment créer un PC simple et libre qui permettra de naviguer sur le web, faire des travaux multimédia et beaucoup d’autres choses…</p>\n\n<p>Entrée libre et gratuite sur <a href=\"http://montpel-libre.fr/spip.php?article2787\">inscription</a>. Une simple <a href=\"http://montpel-libre.fr/stock/documents/Adhesion/montpellibre_flyer-adhesion_double_2018.pdf\">adhésion</a> à l’association est possible.</p>\n\n<p>Cet événement vous est proposé dans le cadre du partenariat qui lie la <a href=\"http://www.mediatheque-beziers-agglo.org/\"><strong>Médiathèque de Béziers</strong></a>, <a href=\"https://lagglo.fr/\"><strong>l’Agglo de Béziers</strong></a> et <a href=\"http://montpel-libre.fr/\"><strong>Montpel’libre</strong></a>.</p>\n\n<p>Samedi 30 mars 2019 de 14h00 à 17h00<br>\nMédiathèque André Malraux - Place du 14 juillet 34500 Béziers</p>\n\n<ul>\n<li>Médiathèque André Malraux, place du 14 Juillet, Béziers, Occitanie, France</li>\n<li><a href=\"https://montpellibre.fr/\">https://montpellibre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/montpel-libre\">montpel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/m%C3%A9diath%C3%A8que\">médiathèque</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/d%C3%A9monstration\">démonstration</a>, <a href=\"https://www.agendadulibre.org/tags/atelibre\">atelibre</a>\n</li>\n</ul>\n<h3>[FR Ivry sur Seine] <a href=\"https://www.agendadulibre.org/events/18802\">Cours de l'Ecole du Logiciel Libre</a> - Le samedi 30 mars 2019 de 14h30 à 18h30.</h3>\n\n<p><strong>Présentation de l'E2L</strong></p>\n\n<p><strong>Quel est le rôle de l'école du logiciel libre</strong></p>\n\n<p>Tout d'abord, ce n'est pas une école comme les autres. Elle n'a pas d'établissement fixe, pas de cours de récréation, pas de carte d'étudiant, ni de diplôme de fin d'année.</p>\n\n<p>Comme toutes les écoles, son rôle est d'apprendre à ses élèves les logiciels libres, c'est-à-dire</p>\n\n<ul>\n<li>comment en trouver de bons parmi les nombreux sites qui en proposent,</li>\n<li>comment en prendre possession en fonction des licences,</li>\n<li>comment les installer en fonction de ses besoins,</li>\n<li>comment les tester et les utiliser,</li>\n<li>comment en comprendre le fonctionnement pour ensuite les modifier,</li>\n<li>comment écrire ses propres logiciels libres.</li>\n</ul>\n<p>En fait, <strong>l'école du logiciel libre est une université populaire</strong>, comme celles qui ont vu le jour en France à partir du 19 ème siècle, et dont le but est de transmettre des connaissances théoriques ou pratiques à tous ceux qui le souhaitent. Et pour atteindre ce but, sa forme juridique est de type <strong>\" association à but non lucratif \"</strong>.</p>\n\n<p><strong>Comment fonctionne l'école</strong></p>\n\n<p>Cette école étant une association, elle possède, comme toutes les autres, un bureau, élu chaque année en assemblée générale, pour l'administrer. Mais elle a aussi des responsables pédagogiques dont le rôle est essentiel car ce sont eux qui établissent les programmes des cours en fonction des souhaits des adhérents, valident les candidatures des enseignants et affectent les sessions.</p>\n\n<p>Les membres du bureau et les responsables pédagogiques forment \"l'encadrement de l'école \". Tous les membres \"encadrants\" doivent être membres de l'association.</p>\n\n<p>Les locaux où se déroulent les cours seront ceux que l'on veut bien nous prêter une salle des fêtes, un théâtre, une salle de réunion publique, un amphi dans une école publique, ou autre.</p>\n\n<p>Les thèmes des cours sont définis par les adhérents en fonction de leurs envies, de leurs besoins. Les cours sont ensuite décidés par les responsables pédagogiques de l'école en fonction des enseignants disponibles.</p>\n\n<p>Afin de permettre au plus grand nombre de participer et d'assister aux cours, les sessions se tiennent essentiellement le samedi. Une première de 9h à 12h30, et une autre de 14h à 17h30.</p>\n\n<p>Programme détaillé sur le site <a href=\"http://www.e2li.org/rwd.php\">http://e2li.org</a></p>\n\n<ul>\n<li>Salle LCR, 79 avenue Danielle Casanova, Ivry sur Seine, Île-de-France, France</li>\n<li><a href=\"https://e2li.org/\">https://e2li.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/e2l\">e2l</a>, <a href=\"https://www.agendadulibre.org/tags/cours\">cours</a>, <a href=\"https://www.agendadulibre.org/tags/ecole-du-logiciel-libre\">ecole-du-logiciel-libre</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>\n</li>\n</ul>\n<h3>[FR Vandœuvre-lès-Nancy] <a href=\"https://www.agendadulibre.org/events/19094\">Installer un Raspberry Pi</a> - Le samedi 30 mars 2019 de 15h00 à 17h00.</h3>\n\n<p>Est présenté la mise en place des différentes connectiques matériels, ainsi que l’installation d’un système GNU/Linux. Cette dernière s’effectue d’une façon différente que pour les micro-ordinateurs.</p>\n\n<p><strong>Horaires</strong></p>\n\n<p>Les animations débutent à 15 h pour se terminer vers 17 h, la salle multimédia FCCL ouvre ses portes à partir de 14 h ces jours-là.</p>\n\n<p><strong>Inscription gratuite aux animations</strong></p>\n\n<p>La participation aux animations repose sur un système d’inscriptions préalables qui permet de répondre de façon plus ciblée aux attentes des usagers et de les associer au projet.</p>\n\n<p>L'inscription obligatoire au plus tard 30 min avant l’atelier via les contacts proposés ci-dessous ou en vous présentant dès 14 h dans la salle multimédia FCCL.</p>\n\n<ul>\n<li>Fabrique Collective de la Culture du Libre, médiathèque Jules Verne, 2 rue de Malines, Vandœuvre-lès-Nancy, Grand Est, France</li>\n<li><a href=\"https://fccl-vandoeuvre.fr/\">https://fccl-vandoeuvre.fr</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/fccl\">fccl</a>, <a href=\"https://www.agendadulibre.org/tags/atelier\">atelier</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/raspberry-pi\">raspberry-pi</a>, <a href=\"https://www.agendadulibre.org/tags/nano-ordinateur\">nano-ordinateur</a>, <a href=\"https://www.agendadulibre.org/tags/gnu%2Flinux\">gnu/linux</a>\n</li>\n</ul>\n<h3>[FR Assier] <a href=\"https://www.agendadulibre.org/events/19024\">Libre en fête. Soirée sur les logiciels libres.</a> - Le samedi 30 mars 2019 de 20h30 à 23h59.</h3>\n\n<p>Libre en fête. Soirée sur les logiciels libres animée par Patrice.</p>\n\n<p>Venez découvrir tous les avantages des logiciels libres des valeurs d’entraide et de coopération, un bien commun accessible à tous.</p>\n\n<p>Et la découverte d’autres projets libres (Wikipédia, OpenStreetMap, les œuvres sous licence libre…).</p>\n\n<ul>\n<li>Café associatif Le Caf'Causse, Assier, Occitanie, France</li>\n<li><a href=\"https://reissa.jimdo.com/caf-causse-caf%C3%A9-associatif\">https://reissa.jimdo.com/caf-causse-caf%C3%A9-associatif</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/reissa\">reissa</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>, <a href=\"https://www.agendadulibre.org/tags/wikipedia\">wikipedia</a>, <a href=\"https://www.agendadulibre.org/tags/openstreetmap\">openstreetmap</a>, <a href=\"https://www.agendadulibre.org/tags/licence-libre\">licence-libre</a>, <a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>\n</li>\n</ul>\n<h3>[FR Montpellier] <a href=\"https://www.agendadulibre.org/events/18733\">Ateliers ouverts</a> - Le dimanche 31 mars 2019 de 10h00 à 18h00.</h3>\n\n<p>Le Dernier Dimanche du Mois c'est des ateliers ouverts dans un BIB, le hackerspace de Montpellier ouvert de 10h à 18h.</p>\n\n<p>Au cours de chaque dimanche nous proposons une thématique plus ou moins liée à l'actualité mais si tu as envie ou besoin de réparer une machine, discuter d'un sujet, monter un mur, partager une recette, etc. tu es le·a bienvenu·e.</p>\n\n<p>Certains viendront résoudre un problème particulier, d'autres travailleront à améliorer les lieux, d'autres encore viennent simplement partager le repas (tiré du sac).</p>\n\n<p>Si tu veux proposer des sujets, des projets et que tu as des besoins spécifiques tu peux prendre contact avec le BIB à l'avance.</p>\n\n<ul>\n<li>Le Bib, 80 impasse Flouch, Montpellier, Occitanie, France</li>\n<li><a href=\"https://lebib.org/\">https://lebib.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/ateliers\">ateliers</a>, <a href=\"https://www.agendadulibre.org/tags/bricolage\">bricolage</a>, <a href=\"https://www.agendadulibre.org/tags/public\">public</a>, <a href=\"https://www.agendadulibre.org/tags/le-bib\">le-bib</a>\n</li>\n</ul>\n<h3>[FR Figeac] <a href=\"https://www.agendadulibre.org/events/19140\">Install party</a> - Le dimanche 31 mars 2019 de 10h30 à 13h00.</h3>\n\n<p>Install party au café associatif l'Arrosoir à Figeac.</p>\n\n<p>Plus d'info sur le site <a href=\"https://www.larrosoir.org/evenement/get-free-tentez-linstallation-linux/?instance_id=7525\">https://www.larrosoir.org</a></p>\n\n<p>Venez nombreux.</p>\n\n<ul>\n<li>Café associatif l'Arrosoir, 5 rue de Crussol, Figeac, Occitanie, France</li>\n<li><a href=\"https://www.larrosoir.org/\">https://www.larrosoir.org</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/libre-en-fete-2019\">libre-en-fete-2019</a>, <a href=\"https://www.agendadulibre.org/tags/gnu-linux\">gnu-linux</a>, <a href=\"https://www.agendadulibre.org/tags/install-party\">install-party</a>, <a href=\"https://www.agendadulibre.org/tags/logiciels-libres\">logiciels-libres</a>\n</li>\n</ul>\n<h3>[FR Palaiseau] <a href=\"https://www.agendadulibre.org/events/19254\">Rencontre Monnaie Libre et Ğ1</a> - Le dimanche 31 mars 2019 de 16h00 à 18h00.</h3>\n\n<p>Nous organisons des rencontres pour présenter la monnaie libre Ğ1 aux curieux, aux actifs actuel de la monnaie et à ceux qui souhaitent créer leur réseau dans le sud de Paris dans le but de se faire certifier.</p>\n\n<p>Nous avons fixé le rendez-vous de notre deuxième rencontre à Palaiseau au dimanche 31 mars 2019 à 16h au Before After de Palaiseau (12 avenue du 8 Mai 1945).</p>\n\n<p>Nous avons la volonté de créer un groupe en banlieue sud de Paris afin de renforcer notre réseau de proximité et pouvoir à la fois certifier les nouveaux dans la région mais aussi on l’espère pouvoir lancer des services et vendre/acheter des produits en Ğ1 près de chez nous</p>\n\n<p>Plus d’infos sur le forum de la monnaie libre (<a href=\"https://forum.monnaie-libre.fr/t/apero-banlieue-sud-de-paris-31-03-19-a-16h-a-palaiseau/5476\">https://forum.monnaie-libre.fr/t/apero-banlieue-sud-de-paris-31-03-19-a-16h-a-palaiseau/5476)</a>: signalez-vous sur ce fil de discussion si vous pensez venir :)</p>\n\n<ul>\n<li>Before After, 12 avenue du 8 Mai 1945, Palaiseau, Île-de-France, France</li>\n<li><a href=\"https://forum.monnaie-libre.fr/t/apero-banlieue-sud-de-paris-31-03-19-a-16h-a-palaiseau/5476\">https://forum.monnaie-libre.fr/t/apero-banlieue-sud-de-paris-31-03-19-a-16h-a-palaiseau/5476</a></li>\n<li>\n<a href=\"https://www.agendadulibre.org/tags/monnaie-libre\">monnaie-libre</a>, <a href=\"https://www.agendadulibre.org/tags/rencontre\">rencontre</a>, <a href=\"https://www.agendadulibre.org/tags/g1\">g1</a>\n</li>\n</ul>\n</div>\n<div><a href=\"https://linuxfr.org/news/agenda-du-libre-pour-la-semaine-13-de-l-annee-2019.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116759/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/agenda-du-libre-pour-la-semaine-13-de-l-annee-2019#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637975,
			"topic_id": 1553637975,
			"doc": "depeche"
		},
		{
			"title": "Sortie de MATE 1.22",
			"pubDate": "2019-03-24 12:07:00",
			"link": "https://linuxfr.org/news/sortie-de-mate-1-22",
			"author": "Frédéric Massot",
			"body": "\n<div>\n<p>Le 18 mars 2019, après 1 an de développement, l’équipe de MATE Desktop a publié la version 1.22. MATE Desktop Environment est la continuation de GNOME 2, il fournit un environnement de bureau intuitif et attrayant en utilisant les métaphores traditionnelles du bureau. MATE est en cours de développement pour intégrer de nouvelles technologies (systemd, GTK+ 3, Wayland, etc.) tout en préservant un environnement de bureau traditionnel.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://mate-desktop.org/fr/\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103625\">Site officiel de MATE Desktop</a>\n</li>\n<li>lien n°2 : <a title=\"https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103744\">Annonce officielle de la version 1.22 (avec l’impressionnant journal des modifications)</a>\n</li>\n<li>lien n°3 : <a title=\"https://www.phoronix.com/scan.php?page=news_item&amp;px=MATE-1.22-Desktop-Released\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103745\">Article sur Phoronix </a>\n</li>\n</ul>\n<div>\n<h2 class=\"sommaire\">Sommaire</h2>\n<ul class=\"toc\">\n<li><a href=\"https://linuxfr.org/news#toc-wayland-et-mir\">Wayland et Mir</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-les-nouveaut%C3%A9s\">Les nouveautés</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-et-ensuite\">Et ensuite</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-ressources\">Ressources</a></li>\n</ul>\n<p>La version 1.10 sortie en juin 2015 permettait les premières constructions expérimentales de MATE Desktop avec GTK+ 3. La version 1.18 sortie en mars 2017 était le passage complet à GTK+ 3 avec la suppression des options de compilation pour GTK+ 2. La version 1.20 sortie en février 2018 était la stabilisation de l’usage de GTK+ 3 avec la correction de bogues, la suppression de code mort, le remplacement de fonctions et <em>widgets</em> obsolètes, la correction d’alertes du compilateur. La version 1.22 apporte le début de la prise en charge de Wayland en utilisant le compositeur Mir et le début de l’intégration continue avec Travis.</p>\n\n<p>Cette version continue de consolider la prise en charge de GTK 3 avec le remplacement de fonctions et <em>widgets</em> obsolètes.</p>\n<h2>Wayland et Mir</h2>\n\n<p>Les développeurs de Mir ont <a href=\"https://discourse.ubuntu.com/t/mir-2017-end-of-year-review/2891\">depuis fin 2017</a> arrêté de développer Mir et son protocole comme concurrent de Wayland, ils l’ont restructuré pour en faire un compositeur Wayland.</p>\n\n<p>William Wold, développeur de l’équipe Mir chez Canonical, a fusionné les premiers correctifs pour l’intégration de Wayland dans <em>mate-panel</em> le 7 décembre 2018 :</p>\n\n<ul>\n<li>« <a href=\"http://git.mate-desktop.org/mate-panel/commit/?id=0ea564a8fd79ccdf899dd6439eda1b52582faeb9\"><em>Add Layer Shell protocol xml</em></a> » ;</li>\n<li>« <a href=\"http://git.mate-desktop.org/mate-panel/commit/?id=dc37f884350ff35b148d9fd869d9dedbee16c4b9\"><em>Add XDG Shell protocol xml</em></a> ».</li>\n</ul>\n<p>Article de <em>Phoronix</em> sur MATE et Mir : « <a href=\"https://www.phoronix.com/scan.php?page=news_item&amp;px=MATE-Wayland-NVIDIA-Mir\"><em>The MATE Wayland Port Is Moving Along</em></a> ».</p>\n\n<p>Voici une vidéo de William Wold au début du portage du bureau MATE vers Wayland avec Mir comme compositeur : <a href=\"https://www.youtube.com/watch?v=qaezzAGWhOw\"><em>MATE panel on Mir</em></a>.</p>\n\n<p>William Wold a aussi créé le paquet Snap <code>mate-wayland</code> qui permet de tester MATE avec Wayland et Mir :</p>\n\n<ul>\n<li>\n<a href=\"https://discourse.ubuntu.com/t/mir-news-22nd-march-2019/10333\"><em>Mir News: 22nd March 2019</em></a> ;</li>\n<li>\n<a href=\"https://snapcraft.io/mate-wayland\"><em>A prototype for the MATE desktop running on Wayland with Mir</em></a>.</li>\n</ul>\n<h2>Les nouveautés</h2>\n\n<p>Les principales nouveautés de cette version :</p>\n\n<ul>\n<li>Mate-panel : adaptation du code pour pouvoir fonctionner avec X11 ou avec Wayland ;</li>\n<li>l’appliquette de gestion de l’écran permet une meilleure gestion de l’écran à partir du bureau ;</li>\n<li>le poisson Wanda est maintenant correctement dessiné sur les écrans HiDPI ;</li>\n<li>gestionnaire de fenêtres Marco : prise en charge de la version 3 des thèmes <a href=\"https://fr.wikipedia.org/wiki/Metacity\">Metacity</a> ;</li>\n<li>gestionnaire de sessions :\n\n<ul>\n<li>il ferme maintenant correctement tous les processus avec systemd,</li>\n<li>les programmes configurés pour démarrer au chargement de la session peuvent maintenant être lancés après un délai paramétré par l’utilisateur ;</li>\n</ul>\n</li>\n<li>de nombreux programmes (Eye of MATE, python-caja, mate-menus) ont été entièrement portés vers Python 3 ;</li>\n<li>Caja, le gestionnaire de fichiers, peut utiliser le système de notification du bureau pour informer sur les opérations qui prennent du temps ;</li>\n<li>Eye of MATE : la barre latérale a été retravaillée pour mieux afficher les métadonnées ;</li>\n<li>Pluma, l’éditeur de texte, on peut changer d’onglets avec des raccourcis clavier ou avec le défilement de la souris ;</li>\n<li>Calculatrice :\n\n<ul>\n<li>augmentation de la précision jusqu’à quinze caractères,</li>\n<li>amélioration du copier‐coller ;</li>\n</ul>\n</li>\n<li>Engrampa, gestionnaire d’archive :\n\n<ul>\n<li>prise en charge de nouveaux formats de compression,</li>\n<li>ajout de la possibilité de mettre en pause puis reprendre ;</li>\n</ul>\n</li>\n<li>ajout de nouveaux raccourcis clavier et prise en charge des touches multimédias comme Bluetooth, Wi‐Fi, pavé tactile et commutateurs globaux ;</li>\n<li>la plupart des projets ont été migrés de dbus-glib vers GDBus ;</li>\n<li>corrections des fuites de mémoire et des avertissements des compilateurs ;</li>\n<li>suppression et remplacement de code obsolète pour être à jour avec les nouvelles versions de GTK ;</li>\n<li>mise à jour de la documentation ;</li>\n<li>migration de toutes les traductions (aide et guide) vers <a href=\"https://fr.transifex.com/\">Transifex</a> ;</li>\n<li>utilisation de Travis CI pour tous les projets afin de garantir une construction propre sur les distributions majeures.</li>\n</ul>\n<p>Après la publication de la version 1.22, et à la suite de la mise en place de l’intégration continue avec Travis, les développeurs ont ajouté des tests d’analyses statiques avec Clang. Les premiers correctifs arrivent depuis dans le dépôt Git de MATE. Les correctifs pour la prise en charge de Wayland par mate-panel continuent eux aussi d’arriver.</p>\n<h2>Et ensuite</h2>\n\n<p>Pour la version 1.24 :</p>\n\n<ul>\n<li>migrer les projets restants de dbus-glib vers GDBus ;</li>\n<li>améliorer la prise en charge de Metacity ;</li>\n<li>ajout d’une option dans Caja (gestionnaire de fichiers) pour afficher les miniatures dans la vue sous forme de liste [<a href=\"https://github.com/mate-desktop/caja/issues/153\">#153</a>] ;</li>\n<li>pour mate-applets, permettre à l’appliquette de commande de lancer des commandes de façon asynchrone [<a href=\"https://github.com/mate-desktop/mate-applets/issues/163\">#163</a>] ;</li>\n<li>mate-panel : possibilité d’utiliser le tableau de bord en position verticale [<a href=\"https://github.com/mate-desktop/mate-panel/issues/157\">#157</a>] ;</li>\n<li>pluma : portage des greffons Python vers Python 3.</li>\n</ul>\n<p>Pour les prochaines versions :</p>\n\n<ul>\n<li>atril (visionneuse de fichiers PDF) : utilisation du paquet de la bibliothèque synctex fournie par les distributions ;</li>\n<li>caja (gestionnaire de fichiers) :\n\n<ul>\n<li>ajout d’une option pour permettre de créer une nouvelle fenêtre lorsque l’on déplace un onglet [<a href=\"https://github.com/mate-desktop/caja/issues/454\">#454</a>],</li>\n<li>ajout d’une option dans les préférences pour désactiver les icônes génériques dans la vue sous forme de liste [<a href=\"https://github.com/mate-desktop/caja/issues/26\">#26</a>] ;</li>\n</ul>\n</li>\n<li>engrampa : ajout de la prise en charge de la bibliothèque libarchive [<a href=\"https://github.com/mate-desktop/engrampa/issues/52\">#52</a>] ;</li>\n<li>mate-applets :\n\n<ul>\n<li>ajout à l’appliquette <em>drivemount</em> d’une liste noire des points de montage et périphériques [<a href=\"https://github.com/mate-desktop/mate-applets/issues/24\">#24</a>],</li>\n<li>ajout à l’appliquette <em>cpufreq</em> d’une option pour afficher plusieurs cœurs et processeurs dans une seule instance de l’appliquette [<a href=\"https://github.com/mate-desktop/mate-applets/issues/50\">#50</a>],</li>\n<li>ajout à l’appliquette <em>cpufreq</em> de la prise en charge du pilote intel_pstate [<a href=\"https://github.com/mate-desktop/mate-applets/issues/173\">#173</a>] ;</li>\n</ul>\n</li>\n<li>mate-control-center : mise en cache des miniatures des images de fond du bureau dans la gestion des préférences de l’apparence ;</li>\n<li>mate-menus : ajout d’une option pour activer ou désactiver un troisième niveau de sous‐menu dans l’affichage du menu des préférences [<a href=\"https://github.com/mate-desktop/mate-menus/issues/35\">#35</a>] ;</li>\n<li>mate-session-manager : dans la boîte de dialogue des propriétés, affichage des applications actives qui peuvent ou seront enregistrées à la fin de la session [<a href=\"https://github.com/mate-desktop/mate-session-manager/issues/113\">#113</a>] ;</li>\n<li>pluma (éditeur de texte) : ajout d’un greffon pour afficher (et peut‐être changer) le type de fin de ligne [<a href=\"https://github.com/mate-desktop/pluma/issues/50\">#50</a>] ;</li>\n<li>mise à jour de l’intégration de Caja avec le moteur de recherche <a href=\"https://wiki.gnome.org/Projects/Tracker/Documentation\">Tracker</a> ;</li>\n<li>ajout de la prise en charge d’<a href=\"http://www.freedesktop.org/wiki/Software/AccountsService\">AccountsService</a> ;</li>\n<li>finalisation de la prise en charge de <a href=\"http://wiki.mate-desktop.org/systemd-logind\">systemd-logind</a> ;</li>\n<li>ajout de la prise en charge de <a href=\"http://wiki.mate-desktop.org/wayland\">Wayland</a> ;</li>\n<li>remplacement de libmatekbd par libgnomekbd ;</li>\n<li>remplacement de libmateweather par libgweather.</li>\n</ul>\n<p>Vous pouvez participer au projet MATE Desktop ! MATE est développé par une petite équipe de développeurs qui a besoin de vous. Si vous n’êtes pas développeurs, vous pouvez aussi participer aux traductions, à la documentation et la promotion de MATE. Si vous aimez les feuilles de style CSS, le paquet <code>mate-themes</code> est pour vous.</p>\n<h2>Ressources</h2>\n\n<p>Informations sur MATE :</p>\n\n<ul>\n<li>\n<a href=\"http://wiki.mate-desktop.org/roadmap\">feuille de route</a> ;</li>\n<li>\n<a href=\"https://mate-desktop.org/gallery/1.22/english\">captures d’écran</a> ;</li>\n<li>\n<a href=\"http://www.mate-desktop.org/\">site officiel</a> ;</li>\n<li>\n<a href=\"http://wiki.mate-desktop.org/\">wiki</a> ;</li>\n<li>\n<a href=\"http://wiki.mate-desktop.org/university\">MATE University : apprendre à développer pour MATE</a>.</li>\n</ul>\n</div>\n<div><a href=\"https://linuxfr.org/news/sortie-de-mate-1-22.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116044/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/sortie-de-mate-1-22#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637974,
			"topic_id": 1553637974,
			"doc": "depeche"
		},
		{
			"title": "Appel à conférences : mini‐DebConf à Marseille les 25 et 26 mai 2019",
			"pubDate": "2019-03-23 11:01:32",
			"link": "https://linuxfr.org/news/appel-a-conferences-mini-debconf-a-marseille-les-25-et-26-mai-2019",
			"author": "Gregory Colpart",
			"body": "\n<div>\n<p>L’association <a href=\"https://france.debian.net/\">Debian France</a> organise une mini‐DebConf à Marseille le week‐end du 25 et 26 mai 2019.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://minidebconf-mrs.debian.net/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103746\">Site mini‐DebConf Marseille 2019</a>\n</li>\n<li>lien n°2 : <a title=\"https://lists.debian.org/debian-devel-announce/2019/02/msg00003.html\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103747\">Annonce et recherche de speakers sur debian-devel-announce</a>\n</li>\n<li>lien n°3 : <a title=\"https://wiki.debian.org/DebianEvents/fr/2019/Marseille\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103748\">Page wiki pour les inscriptions et renseignements</a>\n</li>\n</ul>\n<div>\n<p>Une « mini‐DebConf » est un évènement communautaire ayant pour but de rassembler les développeurs, mainteneurs, contributeurs, utilisateurs et personnes intéressées par le projet Debian. Cela ressemble aux réunions annuelles DebConf mais en version plus courte et plus simple.</p>\n\n<p>L’événement se tiendra <strong>le samedi 25 et le dimanche 26 mai 2019</strong> dans les locaux de « la Maison du Chant » au 49 rue Chape, dans le 4<sup>e</sup> arrondissement de Marseille. Au programme, des conférences de 20 ou 40 minutes, des ateliers, une session de « <em>Lightning Talks</em> » de 10 minutes et plusieurs moments d’échanges (<em>key signing party</em>, <em>beer event</em>, rencontre avec le Linux User Group local, visite organisée le dimanche après‐midi).</p>\n\n<p>Nous sommes à la recherche de conférenciers et d’idées d’ateliers pour cet événement. Vos propositions seront accueillies jusqu’au 21 avril 2019. Pour plus détails, lire <a href=\"https://lists.debian.org/debian-devel-announce/2019/02/msg00003.html\">l’annonce sur la liste de diffusion <em>debian-devel-announce</em></a>.</p>\n\n<p>Si vous souhaitez y assister, vous pouvez vous inscrire sur <a href=\"https://wiki.debian.org/DebianEvents/fr/2019/Marseille#Participants\">la page dédiée du wiki Debian</a> (une inscription plus formelle sera ouverte sous peu).</p>\n\n<p>Cette mini‐DebConf sera également le parfait moment pour célébrer la sortie imminente de Debian 10 (<em>Buster</em>). ;)</p>\n\n<p><img src=\"https://img.linuxfr.org/img/68747470733a2f2f6d696e69646562636f6e662d6d72732e64656269616e2e6e65742f696d672f62616e6e65722f62616e6e65722e706e67/banner.png\" alt=\"Logo mini-DebConf Marseille 2019\" title=\"Source : https://minidebconf-mrs.debian.net/img/banner/banner.png\"></p>\n</div>\n<div><a href=\"https://linuxfr.org/news/appel-a-conferences-mini-debconf-a-marseille-les-25-et-26-mai-2019.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116742/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/appel-a-conferences-mini-debconf-a-marseille-les-25-et-26-mai-2019#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637973,
			"topic_id": 1553637973,
			"doc": "depeche"
		},
		{
			"title": "Libredi : Réunion trimestrielle des contributeurs LinuxFr.org",
			"pubDate": "2019-03-22 17:37:55",
			"link": "https://linuxfr.org/news/libredi-reunion-trimestrielle-des-contributeurs-linuxfr-org",
			"author": "Nÿco",
			"body": "\n<div>\n<p><em>LinuxFr.org</em> a vingt ans ! Oui, on commence à le savoir… Avec le temps, des foultitudes de lecteurs ont fait leur chemin dans la communauté, en commençant par lire, puis commenter, puis… créer des journaux ou des dépêches… voire plus.</p>\n\n<p>Les contributeurs sont très divers : les commentateurs, rédacteurs, modérateurs, administrateurs, développeurs, designers, membres de l’association. Ne pas oublier les « pertinenteurs » et « inutileurs », autrement appelés les « plusseurs » et les « moinsseurs », qui participent activement à la vie du système d’auto‐modération (« <em>crowd‐moderation</em> » ?). Pour tout ce beau monde, être un actif de <em>LinuxFr.org</em> est souvent un grand plaisir, du partage, moments de découverte et d’échange.</p>\n\n<p>Mais en étant contributeur, on se sent parfois isolé ou débordé, et cela nécessite du temps et de l’investissement. Il est donc difficile de maintenir sa motivation et donc son activité. Par conséquent, la valeur individuelle apportée à la communauté peut devenir moindre ou passer au second plan. On se sent frustré, parfois coupable, et l’on ressent un vrai souhait de pouvoir faire plus. En passant de l’individu à l’échelle du site, le résultat semble être une communauté perçue comme moins active, voire en perte de vitesse, mais cet effet est toutefois compensé par l’arrivée de nouveaux contributeurs.</p>\n\n<p>L’idée est donc de réunir les contributeurs de <em>LinuxFr.org</em>, de manière trimestrielle, et en présentiel. Ce sera à Paris car les initiateurs et organisateurs sont à Paris, c’est aussi simple que cela (les initiatives « déparisiannées » sont encouragées). Le but principal est de soutenir et encourager la dynamique de collaboration, et créer du lien humain, pour plus de bienveillance, un regain d’activité de la communauté et plus de contenus en tous genres. La relance permanente et le rafraîchissement continu des contributeurs permettront de faire tourner la machine de manière mieux huilée.</p>\n\n<p><em>LinuxFr.org</em> devrait pouvoir se maintenir encore vingt ans et rayonner sur le Web libre et <em>open‐source</em> francophone, donnons‐nous les moyens de réussir ! :-)</p>\n</div>\n<ul></ul>\n<div>\n<p>Nous lançons les réunions trimestrielles des contributeurs <em>LinuxFr.org</em>.</p>\n\n<p>Pour le second trimestre, démarrage du Libredi, qui sera limité à vingt personnes maximum (contraintes de locaux). Son but est de lancer et tester la construction, avec collecte d’un maximum de retours d’information, afin d’améliorer les choses de manière itérative.</p>\n\n<p>Libredi chapitre Ⅰ : mardi 23 avril.</p>\n\n<p>Au troisième trimestre, ce sera plus probablement en septembre pour la rentrée, au lieu de de la torpeur de juillet‐août. Au quatrième trimestre, il serait plus judicieux de placer cela en novembre.</p>\n</div>\n<div><a href=\"https://linuxfr.org/news/libredi-reunion-trimestrielle-des-contributeurs-linuxfr-org.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116337/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/libredi-reunion-trimestrielle-des-contributeurs-linuxfr-org#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637972,
			"topic_id": 1553637972,
			"doc": "depeche"
		},
		{
			"title": "Sortie de LLVM, Clang, lld, lldb 8.0.0",
			"pubDate": "2019-03-21 19:19:45",
			"link": "https://linuxfr.org/news/sortie-de-llvm-clang-lld-lldb-8-0-0",
			"author": "serge_sans_paille",
			"body": "\n<div>\n<p>Après cinq versions candidates, l’étiquette finale a été apposée sur la branche 8.0.0 de la famille LLVM.</p>\n\n<p>Cette dépêche reprend les points importants des notes de sortie associées. C’est une sélection totalement biaisée, libre à vous de lire les journaux des modifications respectifs pour avoir tous les détails !</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"http://releases.llvm.org/download.html#8.0.0\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103738\">Page de téléchargement</a>\n</li>\n<li>lien n°2 : <a title=\"http://llvm.org/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103739\">L’infrastructure de compilation</a>\n</li>\n<li>lien n°3 : <a title=\"https://clang.llvm.org/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103740\">Le compilateur C, C++ et ObjC</a>\n</li>\n<li>lien n°4 : <a title=\"http://lld.llvm.org/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103741\">L’éditeur de liens</a>\n</li>\n<li>lien n°5 : <a title=\"http://lldb.llvm.org/\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103742\">Le débogueur</a>\n</li>\n<li>lien n°6 : <a title=\"https://libcxx.llvm.org/\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103743\">Les bibliothèques libc++ et libc++abi</a>\n</li>\n</ul>\n<div>\n<h2>LLVM</h2>\n\n<p>[<a href=\"http://releases.llvm.org/8.0.0/docs/ReleaseNotes.html\"><em>Notes de version</em></a>]</p>\n\n<ul>\n<li>possibilité (sous x86) de fournir un profil d’accès mémoire afin de limiter le nombre de défauts de cache <a href=\"https://lists.llvm.org/pipermail/llvm-dev/2018-November/127461.html\">[RFC]</a> ;</li>\n<li>le <em>back‐end</em> <a href=\"https://webassembly.org/\">Webassembly</a> gagne le statut stable !</li>\n<li>les personnes développant des extensions LLVM doivent maintenant utiliser <code>add_llvm_library</code> au lieu de <code>add_llvm_loadable_module</code> pour enregistrer leurs extensions.</li>\n</ul>\n<h2>Clang</h2>\n\n<p>[<a href=\"http://releases.llvm.org/8.0.0/tools/clang/docs/ReleaseNotes.html\"><em>Notes de version</em></a>]</p>\n\n<ul>\n<li>possibilité de fournir un fichier de renommage pour utiliser les informations de profilage d’une version A d’un binaire pour recompiler une version B <a href=\"http://releases.llvm.org/8.0.0/tools/clang/docs/UsersManual.html#profile-remapping\">[doc]</a> ;</li>\n<li>possibilité de forcer la valeur des variables déclarées sur la pile ou en mises en registre, au lieu de les laisser non initialisées, en utilisant <code>-ftrivial-auto-var-init=pattern</code> ;</li>\n<li>quelques <em>warnings</em> de plus :\n\n<ul>\n<li>\n<code>-Wextra-semi-stmt</code> pour détecter les points virgules inutiles, mais en ignorant certains cas liés à l’expansion de macros,</li>\n<li>\n<code>-Wempty-init-stmt</code> détecte les initialisations vides dans le contexte de conditions/boucles (c’est du C++17, <a href=\"https://en.cppreference.com/w/cpp/language/if\">[spec]</a>) ;</li>\n</ul>\n</li>\n<li>ajout du builtin <code>__builtin_rotateleft32</code> ;</li>\n<li>introduction de <code>-mspeculative-load-hardening</code> pour se prémunir de la famille de failles dite <em>Spectre</em> <a href=\"https://llvm.org/docs/SpeculativeLoadHardening.html\">[rtd]</a> ;</li>\n<li>OpenMP 5 mieux géré, et pas mal d’améliorations du côté d’OpenCL ;</li>\n<li>l’<em>undefined behavior sanitizer</em>, déclenché par <code>-fsanitize=undefined</code>, a gagné plusieurs extensions, dont une qui vérifie les contraintes d’alignement ;</li>\n<li>clang-format voit sa <a href=\"https://reviews.llvm.org/D33440\">gestion des reformatages de macros améliorée</a>.</li>\n</ul>\n<h2>Extra Clang Tools</h2>\n\n<p>[<a href=\"http://releases.llvm.org/8.0.0/tools/clang/tools/extra/docs/ReleaseNotes.html\"><em>Notes de version</em></a>]</p>\n<h3>clangd</h3>\n\n<p><code>clangd</code> est un démon qui fournit un service de type complétion, etc., à ces clients.</p>\n\n<ul>\n<li>meilleure intégration avec le <a href=\"https://microsoft.github.io/language-server-protocol/\"><em>Language Server Protocol</em></a> ;</li>\n<li>plusieurs optimisations (taille et vitesse) pour la gestion des grosses bases de code.</li>\n</ul>\n<h3>clang-tidy</h3>\n\n<p><code>clang-tidy</code> est un outil de vérification de code.</p>\n\n<ul>\n<li>un bon paquet de tests pour l’utilisation de la bibliothèque <a href=\"https://abseil.io/\">abseil</a> ;</li>\n<li>un autre paquet de tests pour la modernisation de code (p. ex. : remplacement de tableaux à taille fixe par des <code>std::array</code>) ;</li>\n<li>quelques tests autour des <a href=\"https://github.com/isocpp/CppCoreGuidelines\">CppCoreGuidelines</a>.</li>\n</ul>\n<h2>lld</h2>\n\n<p>[<a href=\"http://releases.llvm.org/8.0.0/tools/lld/docs/ReleaseNotes.html\"><em>Notes de version</em></a>]</p>\n\n<ul>\n<li>choix de l’adresse de chargement des binaires comme un multiple d’une <em>superpage</em>, pour améliorer la vitesse de chargement dans les cas où le système cible prend en charge les *superpage*s — si comme moi tu ne sais pas ce qu’est une super‐page, <a href=\"https://www.usenix.org/legacy/events/osdi2002/tech/full_papers/navarro/navarro.pdf\">clic clic</a> ;</li>\n<li>autre choix assez amusant : la section <code>.note</code> qui contient de précieuses informations (comme le <a href=\"https://fedoraproject.org/wiki/Releases/FeatureBuildId\"><em>build-id</em></a>) est maintenant placée en début de fichier pour être présente dans les <em>core files</em>, même s’ils sont tronqués ;</li>\n<li>des améliorations pour le format <a href=\"https://en.wikipedia.org/wiki/COFF\">COFF</a> et pour l’environnement <a href=\"http://www.mingw.org/\">MinGW</a>, où l’on voit que Windows n’est pas une plate‐forme laissée de côté par LLD.</li>\n</ul>\n<h2>lldb</h2>\n\n<ul>\n<li>coloration syntaxique (pour C) et complétion de code.</li>\n</ul>\n<h2>Notes de fin</h2>\n\n<p>Cette version de LLVM est la dernière compilable avec GCC 4.8, les versions minimales requises augmentent, pour les raisons évoquées dans <a href=\"http://lists.llvm.org/pipermail/llvm-dev/2017-October/118673.html\">ce fil de discussion</a>.</p>\n\n<p>Et c’est aussi probablement la dernière version sous Subversion, le choix a été fait de passer à un dépôt unique (<em>a.k.a.</em> <em>monorepo</em>) sous Git. Pas mal de doc à ce sujet <a href=\"http://lists.llvm.org/pipermail/llvm-dev/2018-October/thread.html#127068\"><em>ici</em></a>, <a href=\"http://lists.llvm.org/pipermail/llvm-dev/2018-October/thread.html#127055\"><em>là</em></a> ou encore dans <a href=\"http://lists.llvm.org/pipermail/llvm-dev/2018-October/thread.html#126894\"><em>ce coin</em></a>.</p>\n</div>\n<div><a href=\"https://linuxfr.org/news/sortie-de-llvm-clang-lld-lldb-8-0-0.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116730/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/sortie-de-llvm-clang-lld-lldb-8-0-0#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637971,
			"topic_id": 1553637971,
			"doc": "depeche"
		},
		{
			"title": "Les jeunes et la programmation (Atlas toolkit v0.7)",
			"pubDate": "2019-03-21 19:19:19",
			"link": "https://linuxfr.org/news/les-jeunes-et-la-programmation-atlas-toolkit-v0-7",
			"author": "Claude SIMON",
			"body": "\n<div>\n<p>Le <em>toolkit</em> Atlas permet de manipuler des interfaces Web en Java, Node.js, PHP, Python et, avec cette nouvelle version, Ruby. Cette dépêche met l’accent sur les particularités du <em>toolkit</em> Atlas qui contribuerait à rendre l’apprentissage de la programmation plus attrayant.</p>\n</div>\n<ul><li>lien n°1 : <a title=\"https://atlastk.org\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103708\">Le site du toolkit Atlas</a>\n</li></ul>\n<div>\n<h2 class=\"sommaire\">Sommaire</h2>\n<ul class=\"toc\">\n<li><a href=\"https://linuxfr.org/news#toc-long-pr%C3%A9ambule\">(Long) préambule</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-installation\">Installation</a></li>\n<li>\n<a href=\"https://linuxfr.org/news#toc-le-code\">Le code</a><ul>\n<li><a href=\"https://linuxfr.org/news#toc-le-code-html\">Le code HTML</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-le-c%C5%93ur-de-lapplication\">Le cœur de l’application</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-le-code-applicatif\">Le code applicatif</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-version-java\">Version Java</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-version-javascript-pour-nodejs\">Version JavaScript pour Node.js</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-version-php\">Version PHP</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-version-python\">Version Python</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-version-ruby\">Version Ruby</a></li>\n</ul>\n</li>\n<li><a href=\"https://linuxfr.org/news#toc-interaction-avec-lapplication\">Interaction avec l’application</a></li>\n<li><a href=\"https://linuxfr.org/news#toc-le-serveur-dans-le-cloud\">Le serveur dans le <em>cloud</em></a></li>\n<li><a href=\"https://linuxfr.org/news#toc-synth%C3%A8se\">Synthèse</a></li>\n</ul>\n<h2>(Long) préambule</h2>\n\n<p>Certains se souviennent peut‐être de <a href=\"https://linuxfr.org/news/publication-de-l-atlas-toolkit-0-4-avec-demonstrations-en-ligne\">cette dépêche</a> dans laquelle je décrivais la version 0.4 du <em>toolkit</em> Atlas. Je me suis ensuite intéressé au Raspberry <em>Pi</em>, pour lequel j’ai développé quelques applications que j’ai décrites dans <a href=\"https://linuxfr.org/users/epeios/journaux/application-web-de-controle-des-gpios-d-un-raspberry-pi-odroid-c2\">ce journal</a>. À cette occasion, j’ai découvert <a href=\"http://binaire.blog.lemonde.fr/2015/12/28/raspberry-pi-la-petite-histoire-dune-grande-idee/\">cet article</a>, dans lequel on relate que le Raspberry <em>Pi</em>, dont les différentes versions se sont vendues à plus de 12 millions d’exemplaires en cinq ans, a été conçu pour tenter d’enrayer la désintérêt des jeunes pour la programmation.</p>\n\n<p>Par ailleurs, j’ai eu l’occasion d’assister, en tant qu’observateur, à des ateliers d’initiation à la programmation. Il y avait ceux destinés aux plus jeunes, qui s’appuient sur des environnements de développement comme <em>Snap!</em> ou <em>Scratch</em>, dans lesquels les instructions sont représentées par des blocs ou des briques que l’on assemble pour créer un programme. Et, plus rares, il y avait quelques ateliers dont l’objet était l’initiation à des langages comme Java, Python, JavaScript, etc.</p>\n\n<p>Concernant ces derniers, j’ai observé que la plupart des participants, si ce n‘est la totalité, étaient équipés de <em>smartphones</em>. Or, bien que les mobiles soient des ordinateurs avec une puissance plus que respectable, ils n’étaient jamais utilisés dans le cadre de ces ateliers. Le développement d’applications mobiles nécessitant de solides connaissances en programmation, il est clair qu’il ne peut être abordé lors de ces ateliers. Et cela vaut aussi pour le développement d’applications Web, qui sont l’autre type d’applications accessibles depuis un mobile.</p>\n\n<p>L’enthousiasme suscité par une démonstration du <em>toolkit</em> Atlas, avec notamment le pilotage d’un <a href=\"https://www.poppy-project.org/fr/robots/poppy-ergo-jr\"><em>Poppy Ergo Jr</em></a> à l’aide d’un <em>smartphone</em>, me laisse supposer qu’un atelier de programmation qui impliquerait leur mobile aurait du succès auprès des jeunes. Aussi, ai‐je développé une nouvelle version du <em>toolkit</em> Atlas en mettant l’accent sur son utilisation dans ce but.</p>\n\n<p>Pour rappel, le <em>toolkit</em> Atlas implémente en Java, Node.js, PHP, Python, ainsi que Ruby, une interface de programmation (API) permettant de manipuler des interfaces Web. Même si, techniquement, utiliser le <em>toolkit</em> Atlas revient à développer une application Web, le résultat sera plus proche d’une application de bureau, avec la particularité d’avoir une interface Web lui permettant d’être accédée à distance.</p>\n\n<p>Cette dépêche est un état des lieux du <em>toolkit</em> Atlas dans la perspective de son utilisation à des fins éducatives. Le <em>toolkit</em> Atlas est constitué de deux parties, l’une étant installée sur la machine du développeur, l’autre étant située sur un serveur distant. Sauf mention contraire, le terme de <em>toolkit</em> fera dorénavant référence uniquement à la partie installée sur la machine du développeur, à l’exclusion de celle située sur le serveur.</p>\n\n<p>Pour ceux qui voudraient avoir un premier aperçu de ce à quoi ressemble une application faite avec le <em>toolkit</em> Atlas, c’est possible sans avoir à installer quoi que ce soit, grâce aux démonstrations en ligne dont les liens sont donnés ci‐dessous. Ces démonstrations s’appuyant sur <a href=\"https://runkit.com/\">RunKit</a>, elles mettent en œuvre la version pour Node.js du <em>toolkit</em>. À cause d’un délai d’expiration de <em>RunKit</em>, ces démonstrations se coupent au bout de quelques dizaines de secondes. Notez que vous pouvez modifier le code source de ces démonstrations <em>in situ</em> et les relancer dans la foulée pour en voir le résultat.</p>\n\n<p>Les liens vers ces démonstrations :</p>\n\n<ul>\n<li>un exemple très basique : <a href=\"http://q37.info/runkit/Blank\">http://q37.info/runkit/Blank</a> ;</li>\n<li>\n<a href=\"https://fr.wikipedia.org/wiki/Hello_world\">« <em>Hello, World!</em> »</a> : <a href=\"http://q37.info/runkit/Hello\">http://q37.info/runkit/Hello</a> ;</li>\n<li>une application de prise de notes : <a href=\"http://q37.info/runkit/Notes\">http://q37.info/runkit/Notes</a> ;</li>\n<li>\n<a href=\"http://todomvc.com/\"><em>TodoMVC</em></a> : <a href=\"http://q37.info/runkit/TodoMVC\">http://q37.info/runkit/TodoMVC</a> ;</li>\n<li>un salon de discussion : <a href=\"http://q37.info/runkit/Chatroom\">http://q37.info/runkit/Chatroom</a>.</li>\n</ul>\n<h2>Installation</h2>\n\n<p>La procédure d’installation pour tous les langages pris en charge par le <em>toolkit</em> Atlas consiste à cloner un dépôt Git qui, en plus d’exemples d’applications, contient le <em>toolkit</em> Atlas proprement dit. Pour la version Node.js, le dépôt Git ne contient que les exemples, et l’installation du <em>toolkit</em> se fait via le gestionnaire de paquets (NPM). C’est nécessité par l’utilisation de RunKit pour les démonstrations en ligne ci‐dessus.</p>\n\n<p>Le <em>toolkit</em> Atlas en lui‐même ne pèse que quelques dizaines de kilooctets, et peut facilement être mis en œuvre sur des machines de faible puissance, comme dans la vidéo de démonstration ci‐dessous, qui montre la mise en œuvre du <em>toolkit</em> Atlas sur un <a href=\"https://www.raspberrypi.org/products/raspberry-pi-zero-w/\">Raspberry <em>Pi Zero W</em></a> pour en contrôler les ports <a href=\"https://fr.wikipedia.org/wiki/General_Purpose_Input/Output\" title=\"General Purpose Input/Output — entrées-sorties à usage général\">GPIO</a>.</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=C4p2iX6gc-Q\"><img src=\"https://img.linuxfr.org/img/68747470733a2f2f696d672e796f75747562652e636f6d2f76692f4334703269583667632d512f302e6a7067/0.jpg\" alt=\"Vidéo RVB\" title=\"Source : https://img.youtube.com/vi/C4p2iX6gc-Q/0.jpg\"></a></p>\n\n<p>La même vidéo sur <em>PeerTube</em> : <a href=\"https://peertube.video/videos/watch/e7e02356-c9c3-4590-8ec0-8f8da06ff312\">https://peertube.video/videos/watch/e7e02356-c9c3-4590-8ec0-8f8da06ff312</a>.</p>\n<h2>Le code</h2>\n\n<p>À titre d’exemple, on va se pencher sur une sorte de <a href=\"https://fr.wikipedia.org/wiki/Hello_world\">« <em>Hello, World!</em> »</a>, qui ressemble à ça :<br><img src=\"https://img.linuxfr.org/img/687474703a2f2f7133372e696e666f2f646f776e6c6f61642f6173736574732f48656c6c6f2e676966/Hello.gif\" alt=\"Petite démonstration\" title=\"Hello, World! | Source : http://q37.info/download/assets/Hello.gif\"></p>\n\n<p>Démonstration en ligne : <a href=\"http://q37.info/runkit/Hello\">http://q37.info/runkit/Hello</a>.</p>\n\n<p>De manière générale, comme vous le verrez avec cet exemple, une application s’appuyant sur le <em>toolkit</em> Atlas est constituée d’une partie écrite en HTML qui décrit l’interface, et dans laquelle on définit des actions à exécuter suite à certains évènements.</p>\n\n<p>L’autre partie de l’application est écrite dans le langage de son choix parmi ceux disponibles pour le <em>toolkit</em> Atlas, ce dernier mettant à disposition une <a href=\"https://fr.wikipedia.org/wiki/Interface_de_programmation\" title=\"Interface de programmation applicative\">API</a> permettant d’être informé des actions à traiter, d’injecter du code HTML dans l’interface, de récupérer différentes données saisies par l’utilisateur via l’interface, et de modifier l’interface en y ajoutant, retirant ou modifiant certains éléments.</p>\n<h3>Le code HTML</h3>\n\n<p>Voici le code HTML de l’exemple ci‐dessus :</p>\n\n<pre><code class=\"html\"><span class=\"p\">&lt;</span><span class=\"nt\">div</span> <span class=\"na\">style</span><span class=\"o\">=</span><span class=\"s\">\"display: table; margin: 50px auto auto auto;\"</span><span class=\"p\">&gt;</span>\n  <span class=\"p\">&lt;</span><span class=\"nt\">fieldset</span><span class=\"p\">&gt;</span>\n    <span class=\"p\">&lt;</span><span class=\"nt\">input</span> <span class=\"na\">id</span><span class=\"o\">=</span><span class=\"s\">\"input\"</span> <span class=\"na\">maxlength</span><span class=\"o\">=</span><span class=\"s\">\"20\"</span> <span class=\"na\">placeholder</span><span class=\"o\">=</span><span class=\"s\">\"Enter a name here\"</span> <span class=\"na\">type</span><span class=\"o\">=</span><span class=\"s\">\"text\"</span>\n           <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Submit\"</span> <span class=\"na\">value</span><span class=\"o\">=</span><span class=\"s\">\"World\"</span><span class=\"p\">/&gt;</span>\n    <span class=\"p\">&lt;</span><span class=\"nt\">div</span> <span class=\"na\">style</span><span class=\"o\">=</span><span class=\"s\">\"display: flex; justify-content: space-around; margin: 5px auto auto auto;\"</span><span class=\"p\">&gt;</span>\n      <span class=\"p\">&lt;</span><span class=\"nt\">button</span> <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Submit\"</span><span class=\"p\">&gt;</span>Submit<span class=\"p\">&lt;/</span><span class=\"nt\">button</span><span class=\"p\">&gt;</span>\n      <span class=\"p\">&lt;</span><span class=\"nt\">button</span> <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Clear\"</span><span class=\"p\">&gt;</span>Clear<span class=\"p\">&lt;/</span><span class=\"nt\">button</span><span class=\"p\">&gt;</span>\n    <span class=\"p\">&lt;/</span><span class=\"nt\">div</span><span class=\"p\">&gt;</span>\n  <span class=\"p\">&lt;/</span><span class=\"nt\">fieldset</span><span class=\"p\">&gt;</span>\n<span class=\"p\">&lt;/</span><span class=\"nt\">div</span><span class=\"p\">&gt;</span></code></pre>\n\n<p>Et, pour en faciliter la compréhension, l’équivalent expurgé de tout ce qui n’est pas indispensable :</p>\n\n<pre><code class=\"html\"><span class=\"p\">&lt;</span><span class=\"nt\">input</span> <span class=\"na\">id</span><span class=\"o\">=</span><span class=\"s\">\"input\"</span> <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Submit\"</span><span class=\"p\">/&gt;</span>\n<span class=\"p\">&lt;</span><span class=\"nt\">button</span> <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Submit\"</span><span class=\"p\">&gt;</span>Submit<span class=\"p\">&lt;/</span><span class=\"nt\">button</span><span class=\"p\">&gt;</span>\n<span class=\"p\">&lt;</span><span class=\"nt\">button</span> <span class=\"na\">data-xdh-onevent</span><span class=\"o\">=</span><span class=\"s\">\"Clear\"</span><span class=\"p\">&gt;</span>Clear<span class=\"p\">&lt;/</span><span class=\"nt\">button</span><span class=\"p\">&gt;</span></code></pre>\n\n<p>Il est suffisamment bref pour être directement inclus dans le code source de l’application, sachant que le bon usage, surtout pour du code plus long, consisterait à le mettre dans un fichier dédié.</p>\n\n<p>On voit que c’est du HTML tout à fait classique, mis à part l’attribut <code>data-xdh-onevent</code>. Le <code>data-</code> est requis par HTML pour définir des attributs maisons, et le <code>xdh-</code> fait office d’<a href=\"https://fr.wikipedia.org/wiki/Espace_de_noms_(programmation)\">espace de noms</a>, pour éviter un conflit avec d’éventuels autres attributs hors HTML.</p>\n\n<p><code>data-xdh-onevent</code> permet de définir des actions associées à des évènements JavaScript. Son format général est <code>&lt;event&gt;|&lt;action&gt;</code>. <code>&lt;event&gt;</code> peut être n’importe quel évènement JavasScript, sans son prefix <code>on</code> (<code>click</code> pour <code>onclick</code>, <code>mousedown</code> pour <code>onmousedown</code>…), et <code>&lt;action&gt;</code>, un libellé d’action que l’on va retrouver dans le code  de l’application.</p>\n\n<p>Dans l’exemple ci‐dessus, on remarquera qu’il n’y a qu’un libellé d’action comme valeur pour chacun des attributs <code>data-xdh-onevent</code>. Cela signifie que l’évènement associé à cette action sera celui défini par défaut pour l’élément <em>HTML</em> considéré. Pour un champ texte, il s’agit de l’appui sur la touche <code>Entrée</code> ; pour un bouton, son actionnement. On remarquera, en outre, que l’action définie pour le champ texte et le bouton <code>Submit</code> (« Envoyer ») est la même.</p>\n\n<p>Il existe de nombreux tutoriels concernant HTML, pour tous les niveaux, et son initiation pourra se faire en introduction et indépendamment de l’apprentissage de la programmation proprement dite.</p>\n<h3>Le cœur de l’application</h3>\n\n<p>Le cœur de l’application aura pour rôle de réagir aux actions définies dans le code HTML, à savoir, dans notre exemple, <code>Submit</code>, qui provoquera l’ouverture d’une boîte de dialogue affichant la donnée saisie par l’utilisateur dans le champ texte, et <code>Clear</code>, qui provoquera l’ouverture d’une boîte de dialogue demandant confirmation de l’action et, le cas échéant, effacera le contenu du champ texte.</p>\n\n<p>Il y a, en outre, une troisième action à laquelle l’application doit réagir, et dont le libellé est une chaîne de caractères vide. Cette action est lancée lorsqu’une nouvelle session est créée, et, généralement, procède à l’affichage de la page initiale de l’application.</p>\n\n<p>Pour Java et PHP, on définit une <a href=\"https://fr.wikipedia.org/wiki/Fonction_de_rappel\">fonction de rappel</a> (<em>callback</em>) globale (intitulée <code>handle</code>) qui est appelée lorsque survient un évènement pour lequel une action est définie. On y reçoit en paramètre le libellé de l’action ainsi que l’identifiant de l’élément concerné. Pour les autres langages, on définit une fonction de rappel pour chacune des actions définies dans l’interface, cette fonction étant appelée dès qu’un des évènements auxquels cette action est associée survient, avec, entre autres paramètres, l’identifiant de l’élément concerné par cette action.</p>\n\n<p>Le développeur a le moyen de définir un objet dont chaque session aura une instance qui lui sera propre. Quel que soit le langage, lors du traitement d’une action, le développeur aura accès à l’instance, et uniquement à celle‐ci, correspondant à la session qui est à l’origine de l’action. Le <em>toolkit</em> Atlas prend en charge le traitement de plusieurs sessions simultanées de manière totalement transparente pour le développeur, sauf, bien sûr, si certaines ressources sont communes à toutes les applications, comme le montre l’exemple du salon de conversation (nommé <em>Chatroom</em>).</p>\n\n<p>En fait, l’API du <em>toolkit</em> Atlas contient une fonction <code>launch()</code> à laquelle on fournit une fonction de rappel qui est lancée à chaque nouvelle session. C’est cette fonction de rappel qui a la responsabilité de créer une nouvelle instance d’un objet, défini par le développeur, instance qui contiendra les données propres à chaque session.</p>\n<h3>Le code applicatif</h3>\n\n<p>Comme on le verra avec les codes source ci‐dessous, les exemples de programmes donnés dans les tutoriels consacrés à l’apprentissage de certains langages peuvent facilement être modifiés pour utiliser le <em>toolkit</em> Atlas, permettant de les doter d’une véritable interface graphique, au lieu de l’habituelle interface texte, rendant ces exemples beaucoup plus attrayants.</p>\n\n<p>Vous trouverez dans la suite de cet article les différents codes source de l’application pour chacun des langages. Tous suivent le même schéma et utilisent ces fonctions issues de l’API du <em>toolkit</em> Atlas :</p>\n\n<ul>\n<li>\n<code>setLayout()</code> : met en place du code HTML au niveau de l’interface ; le premier paramètre est l’identifiant de la balise HTML dans laquelle le code HTML sera injecté, et si ce paramètre est une chaîne vide, comme c’est la cas dans notre exemple, c’est l’ensemble de la page qui voit son contenu écrasé par le code HTML fourni ;</li>\n<li>\n<code>focus()</code> : donne le focus à l’élément dont l’identifiant est passé en paramètre ;</li>\n<li>\n<code>alert()</code> : affiche une boîte de dialogue contenant la chaîne de caractères passée en paramètre, avec un seul et unique bouton pour l’acquitter ;</li>\n<li>\n<code>confirm()</code> : comme ci‐dessus, mais avec deux boutons, l’un pour l’acceptation, l’autre pour le refus ; un booléen est retourné indiquant le bouton actionné ;</li>\n<li>\n<code>getContent()</code> : retourne le contenu d’un élément dont l’identifiant est passé en paramètre ; dans le cadre de notre exemple, permet de récupérer ce que l’utilisateur a saisi dans le champ texte ;</li>\n<li>\n<code>setContent()</code> : met à jour le contenu d’un élément dont l’identifiant est passé en paramètre avec la chaîne de caractères également passée en paramètre ; dans le cadre de notre exemple, vide le champ texte en le « remplissant » avec une chaîne vide.</li>\n</ul>\n<h3>Version Java</h3>\n\n<pre><code class=\"java\"><span class=\"kn\">import</span> <span class=\"nn\">info.q37.atlas.*</span><span class=\"o\">;</span>\n\n<span class=\"kd\">class</span> <span class=\"nc\">Hello</span> <span class=\"kd\">extends</span> <span class=\"n\">Atlas</span> <span class=\"o\">{</span>\n    <span class=\"kd\">private</span> <span class=\"kd\">static</span> <span class=\"n\">String</span> <span class=\"n\">body</span> <span class=\"o\">=</span>\n        <span class=\"s\">\"&lt;input id=\\\"input\\\" data-xdh-onevent=\\\"Submit\\\"/&gt;\"</span> <span class=\"o\">+</span>\n        <span class=\"s\">\"&lt;button data-xdh-onevent=\\\"Submit\\\"&gt;Submit&lt;/button&gt;\"</span> <span class=\"o\">+</span>\n        <span class=\"s\">\"&lt;button data-xdh-onevent=\\\"Clear\\\"&gt;Clear&lt;/button&gt;\"</span><span class=\"o\">;</span>\n\n    <span class=\"nd\">@Override</span>\n    <span class=\"kd\">public</span> <span class=\"kt\">void</span> <span class=\"nf\">handle</span><span class=\"o\">(</span><span class=\"n\">String</span> <span class=\"n\">action</span><span class=\"o\">,</span> <span class=\"n\">String</span> <span class=\"n\">id</span><span class=\"o\">)</span> <span class=\"o\">{</span>\n        <span class=\"k\">switch</span> <span class=\"o\">(</span><span class=\"n\">action</span><span class=\"o\">)</span> <span class=\"o\">{</span>\n            <span class=\"k\">case</span> <span class=\"s\">\"\"</span><span class=\"o\">:</span>\n                <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">setLayout</span><span class=\"o\">(</span><span class=\"s\">\"\"</span><span class=\"o\">,</span> <span class=\"n\">body</span><span class=\"o\">);</span>\n                <span class=\"k\">break</span><span class=\"o\">;</span>\n            <span class=\"k\">case</span> <span class=\"s\">\"Submit\"</span><span class=\"o\">:</span>\n                <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">alert</span><span class=\"o\">(</span><span class=\"s\">\"Hello, \"</span> <span class=\"o\">+</span> <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">getContent</span><span class=\"o\">(</span><span class=\"s\">\"input\"</span><span class=\"o\">)</span> <span class=\"o\">+</span> <span class=\"s\">\"!\"</span><span class=\"o\">);</span>\n                <span class=\"k\">break</span><span class=\"o\">;</span>\n            <span class=\"k\">case</span> <span class=\"s\">\"Clear\"</span><span class=\"o\">:</span>\n                <span class=\"k\">if</span> <span class=\"o\">(</span><span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">confirm</span><span class=\"o\">(</span><span class=\"s\">\"Are you sure?\"</span><span class=\"o\">))</span> <span class=\"o\">{</span>\n                    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">setContent</span><span class=\"o\">(</span><span class=\"s\">\"input\"</span><span class=\"o\">,</span> <span class=\"s\">\"\"</span><span class=\"o\">);</span>\n                <span class=\"o\">}</span>\n                <span class=\"k\">break</span><span class=\"o\">;</span>\n            <span class=\"o\">}</span>\n            <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"na\">focus</span><span class=\"o\">(</span><span class=\"s\">\"input\"</span><span class=\"o\">);</span>\n        <span class=\"o\">}</span>\n\n    <span class=\"kd\">public</span> <span class=\"kd\">static</span> <span class=\"kt\">void</span> <span class=\"nf\">main</span><span class=\"o\">(</span><span class=\"n\">String</span><span class=\"o\">[]</span> <span class=\"n\">args</span><span class=\"o\">)</span> <span class=\"kd\">throws</span> <span class=\"n\">Exception</span> <span class=\"o\">{</span>\n        <span class=\"n\">launch</span><span class=\"o\">(()</span> <span class=\"o\">-&gt;</span> <span class=\"k\">new</span> <span class=\"n\">Hello</span><span class=\"o\">());</span>\n    <span class=\"o\">}</span>\n<span class=\"o\">}</span></code></pre>\n\n<p>Pour l’exécuter :</p>\n\n<ul>\n<li>\n<code>git clone http://github.com/epeios-q37/atlas-java</code> ;</li>\n<li>\n<code>cd atlas-java</code> ;</li>\n<li>y stocker le code source ci‐dessus dans un fichier nommé <code>Hello.java</code> ;</li>\n<li>\n<code>javac -cp Atlas.jar Hello.java</code> ;</li>\n<li>sous Windows : <code>java -cp .;Atlas.jar Hello</code> ;</li>\n<li>avec les autres système d’exploitation : <code>java -cp .:Atlas.jar Hello</code>.</li>\n</ul>\n<p>Voir également <a href=\"https://github.com/epeios-q37/atlas-java\">https://github.com/epeios-q37/atlas-java</a>.</p>\n<h3>Version JavaScript pour Node.js</h3>\n\n<pre><code class=\"javascript\"><span class=\"kr\">const</span> <span class=\"nx\">atlas</span> <span class=\"o\">=</span> <span class=\"nx\">require</span><span class=\"p\">(</span><span class=\"s1\">'atlastk'</span><span class=\"p\">);</span>\n\n<span class=\"kr\">const</span> <span class=\"nx\">body</span> <span class=\"o\">=</span> <span class=\"sb\">`</span>\n<span class=\"sb\">&lt;input id=\"input\" data-xdh-onevent=\"Submit\"/&gt;</span>\n<span class=\"sb\">&lt;button data-xdh-onevent=\"Submit\"&gt;Submit&lt;/button&gt;</span>\n<span class=\"sb\">&lt;button data-xdh-onevent=\"Clear\"&gt;Clear&lt;/button&gt;</span>\n<span class=\"sb\">`</span><span class=\"p\">;</span>\n\n<span class=\"kr\">const</span> <span class=\"nx\">callbacks</span> <span class=\"o\">=</span> <span class=\"p\">{</span>\n    <span class=\"s2\">\"\"</span><span class=\"o\">:</span> <span class=\"p\">(</span><span class=\"nx\">dom</span><span class=\"p\">,</span> <span class=\"nx\">id</span><span class=\"p\">)</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">setLayout</span><span class=\"p\">(</span><span class=\"s2\">\"\"</span><span class=\"p\">,</span> <span class=\"nx\">body</span><span class=\"p\">,</span> <span class=\"p\">()</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)),</span>\n    <span class=\"s2\">\"Submit\"</span><span class=\"o\">:</span> <span class=\"p\">(</span><span class=\"nx\">dom</span><span class=\"p\">,</span> <span class=\"nx\">id</span><span class=\"p\">)</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">getContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">,</span>\n        <span class=\"p\">(</span><span class=\"nx\">name</span><span class=\"p\">)</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">alert</span><span class=\"p\">(</span><span class=\"s2\">\"Hello, \"</span> <span class=\"o\">+</span> <span class=\"nx\">name</span> <span class=\"o\">+</span> <span class=\"s2\">\"!\"</span><span class=\"p\">,</span> <span class=\"p\">()</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">))),</span>\n    <span class=\"s2\">\"Clear\"</span><span class=\"o\">:</span> <span class=\"p\">(</span><span class=\"nx\">dom</span><span class=\"p\">,</span> <span class=\"nx\">id</span><span class=\"p\">)</span> <span class=\"p\">=&gt;</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">confirm</span><span class=\"p\">(</span><span class=\"s2\">\"Are you sure ?\"</span><span class=\"p\">,</span>\n        <span class=\"p\">(</span><span class=\"nx\">answer</span><span class=\"p\">)</span> <span class=\"p\">=&gt;</span> <span class=\"p\">{</span> <span class=\"k\">if</span> <span class=\"p\">(</span><span class=\"nx\">answer</span><span class=\"p\">)</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">setContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">,</span> <span class=\"s2\">\"\"</span><span class=\"p\">);</span> <span class=\"nx\">dom</span><span class=\"p\">.</span><span class=\"nx\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">);</span> <span class=\"p\">})</span>\n<span class=\"p\">};</span>\n\n<span class=\"nx\">atlas</span><span class=\"p\">.</span><span class=\"nx\">launch</span><span class=\"p\">(()</span> <span class=\"p\">=&gt;</span> <span class=\"k\">new</span> <span class=\"nx\">atlas</span><span class=\"p\">.</span><span class=\"nx\">DOM</span><span class=\"p\">(),</span> <span class=\"nx\">callbacks</span><span class=\"p\">);</span></code></pre>\n\n<p>Pour l’exécuter :</p>\n\n<ul>\n<li>\n<code>git clone http://github.com/epeios-q37/atlas-node</code> ;</li>\n<li>\n<code>cd atlas-node</code> ;</li>\n<li>y stocker le code source ci‐dessus dans un fichier nommé <code>Hello.js</code> ;</li>\n<li>\n<code>npm install</code> ;</li>\n<li>\n<code>node Hello.js</code>.</li>\n</ul>\n<p>Voir également <a href=\"https://github.com/epeios-q37/atlas-node\">https://github.com/epeios-q37/atlas-node</a>.</p>\n<h3>Version PHP</h3>\n\n<pre><code class=\"php\"><span class=\"o\">&lt;?</span><span class=\"nx\">php</span>\n<span class=\"k\">require</span> <span class=\"s2\">\"phar://Atlas.phar/Atlas.php\"</span><span class=\"p\">;</span>\n\n<span class=\"k\">class</span> <span class=\"nc\">Hello</span> <span class=\"k\">extends</span> <span class=\"nx\">Threaded</span> <span class=\"p\">{</span>\n    <span class=\"k\">static</span> <span class=\"nv\">$body</span> <span class=\"o\">=</span> <span class=\"s\">&lt;&lt;&lt;</span><span class=\"dl\">EOT</span><span class=\"s\"></span>\n<span class=\"s\">&lt;input id=\"input\" data-xdh-onevent=\"Submit\"/&gt;</span>\n<span class=\"s\">&lt;button data-xdh-onevent=\"Submit\"&gt;Submit&lt;/button&gt;</span>\n<span class=\"s\">&lt;button data-xdh-onevent=\"Clear\"&gt;Clear&lt;/button&gt;</span>\n<span class=\"dl\">EOT</span><span class=\"p\">;</span>\n\n    <span class=\"k\">public</span> <span class=\"k\">function</span> <span class=\"nf\">handle</span><span class=\"p\">(</span><span class=\"nv\">$dom</span><span class=\"p\">,</span> <span class=\"nv\">$action</span><span class=\"p\">,</span> <span class=\"nv\">$id</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n        <span class=\"k\">switch</span> <span class=\"p\">(</span><span class=\"nv\">$action</span><span class=\"p\">)</span> <span class=\"p\">{</span>\n            <span class=\"k\">case</span> <span class=\"s2\">\"\"</span><span class=\"o\">:</span>\n                <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">setLayout</span><span class=\"p\">(</span><span class=\"s2\">\"\"</span><span class=\"p\">,</span> <span class=\"nx\">self</span><span class=\"o\">::</span><span class=\"nv\">$body</span><span class=\"p\">);</span>\n                <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">);</span>\n                <span class=\"k\">break</span><span class=\"p\">;</span>\n            <span class=\"k\">case</span> <span class=\"s2\">\"Submit\"</span><span class=\"o\">:</span>\n                <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">alert</span><span class=\"p\">(</span><span class=\"s2\">\"Hello, \"</span> <span class=\"o\">.</span> <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">getContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span> <span class=\"o\">.</span> <span class=\"s2\">\"!\"</span><span class=\"p\">);</span>\n                <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">);</span>\n                <span class=\"k\">break</span><span class=\"p\">;</span>\n            <span class=\"k\">case</span> <span class=\"s2\">\"Clear\"</span><span class=\"o\">:</span>\n                <span class=\"k\">if</span> <span class=\"p\">(</span><span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">confirm</span><span class=\"p\">(</span><span class=\"s2\">\"Are you sure?\"</span><span class=\"p\">))</span>\n                    <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">setContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">,</span> <span class=\"s2\">\"\"</span><span class=\"p\">);</span>\n                <span class=\"nv\">$dom</span><span class=\"o\">-&gt;</span><span class=\"na\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">);</span>\n                <span class=\"k\">break</span><span class=\"p\">;</span>\n        <span class=\"p\">}</span>\n    <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n\n<span class=\"k\">function</span> <span class=\"nf\">hello</span><span class=\"p\">()</span> <span class=\"p\">{</span>\n    <span class=\"k\">return</span> <span class=\"k\">new</span> <span class=\"nx\">Hello</span><span class=\"p\">();</span>\n<span class=\"p\">}</span>\n\n<span class=\"nx\">Atlas</span><span class=\"o\">::</span><span class=\"na\">launch</span><span class=\"p\">(</span><span class=\"s1\">'hello'</span><span class=\"p\">);</span>\n<span class=\"cp\">?&gt;</span><span class=\"x\"></span></code></pre>\n\n<p>Pour l’exécuter :</p>\n\n<ul>\n<li>\n<code>git clone http://github.com/epeios-q37/atlas-php</code> ;</li>\n<li>\n<code>cd atlas-php</code> ;</li>\n<li>y stocker le code source ci‐dessus dans un fichier nommé <code>Hello.php</code> ;</li>\n<li>\n<code>php Hello.php</code>.</li>\n</ul>\n<p>À noter que l’extension <a href=\"http://php.net/manual/book.pthreads.php\"><em>pthreads</em></a> doit être installée.</p>\n\n<p>Voir également <a href=\"https://github.com/epeios-q37/atlas-php\">https://github.com/epeios-q37/atlas-php</a>.</p>\n<h3>Version Python</h3>\n\n<pre><code class=\"python\"><span class=\"kn\">import</span> <span class=\"nn\">Atlas</span>\n\n<span class=\"n\">body</span> <span class=\"o\">=</span> <span class=\"s2\">\"\"\"</span>\n<span class=\"s2\">&lt;input id=\"input\" data-xdh-onevent=\"Submit\"/&gt;</span>\n<span class=\"s2\">&lt;button data-xdh-onevent=\"Submit\"&gt;Submit&lt;/button&gt;</span>\n<span class=\"s2\">&lt;button data-xdh-onevent=\"Clear\"&gt;Clear&lt;/button&gt;</span>\n<span class=\"s2\">\"\"\"</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acConnect</span><span class=\"p\">(</span><span class=\"n\">this</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">):</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">setLayout</span><span class=\"p\">(</span><span class=\"s2\">\"\"</span><span class=\"p\">,</span> <span class=\"n\">body</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acSubmit</span><span class=\"p\">(</span><span class=\"n\">this</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">):</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">alert</span><span class=\"p\">(</span><span class=\"s2\">\"Hello, \"</span> <span class=\"o\">+</span> <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">getContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span> <span class=\"o\">+</span> <span class=\"s2\">\"!\"</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acClear</span><span class=\"p\">(</span><span class=\"n\">this</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">):</span>\n    <span class=\"k\">if</span> <span class=\"p\">(</span> <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">confirm</span><span class=\"p\">(</span><span class=\"s2\">\"Are you sure?\"</span><span class=\"p\">)</span> <span class=\"p\">):</span>\n        <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">setContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">,</span> <span class=\"s2\">\"\"</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n\n<span class=\"n\">callbacks</span> <span class=\"o\">=</span> <span class=\"p\">{</span>\n    <span class=\"s2\">\"\"</span><span class=\"p\">:</span> <span class=\"n\">acConnect</span><span class=\"p\">,</span>\n    <span class=\"s2\">\"Submit\"</span><span class=\"p\">:</span> <span class=\"n\">acSubmit</span><span class=\"p\">,</span>\n    <span class=\"s2\">\"Clear\"</span><span class=\"p\">:</span> <span class=\"n\">acClear</span><span class=\"p\">,</span>\n<span class=\"p\">}</span>\n\n<span class=\"n\">Atlas</span><span class=\"o\">.</span><span class=\"n\">launch</span><span class=\"p\">(</span><span class=\"n\">callbacks</span><span class=\"p\">)</span></code></pre>\n\n<p>Pour l’exécuter :</p>\n\n<ul>\n<li>\n<code>git clone http://github.com/epeios-q37/atlas-python</code> ;</li>\n<li>\n<code>cd atlas-python</code> ;</li>\n<li>y stocker le code source ci‐dessus dans un fichier nommé <code>Hello.py</code> ;</li>\n<li>\n<code>python Hello.py</code>.</li>\n</ul>\n<p>Voir également <a href=\"https://github.com/epeios-q37/atlas-python\">https://github.com/epeios-q37/atlas-python</a>.</p>\n<h3>Version Ruby</h3>\n\n<pre><code class=\"ruby\"><span class=\"nb\">require</span> <span class=\"s1\">'Atlas'</span>\n\n<span class=\"vg\">$body</span> <span class=\"o\">=</span>\n<span class=\"o\">&lt;&lt;~</span><span class=\"no\">HEREDOC</span>\n<span class=\"o\">&lt;</span><span class=\"n\">input</span> <span class=\"nb\">id</span><span class=\"o\">=</span><span class=\"s2\">\"input\"</span> <span class=\"n\">data</span><span class=\"o\">-</span><span class=\"n\">xdh</span><span class=\"o\">-</span><span class=\"n\">onevent</span><span class=\"o\">=</span><span class=\"s2\">\"Submit\"</span><span class=\"o\">/&gt;</span>\n<span class=\"o\">&lt;</span><span class=\"n\">button</span> <span class=\"n\">data</span><span class=\"o\">-</span><span class=\"n\">xdh</span><span class=\"o\">-</span><span class=\"n\">onevent</span><span class=\"o\">=</span><span class=\"s2\">\"Submit\"</span><span class=\"o\">&gt;</span><span class=\"no\">Submit</span><span class=\"o\">&lt;</span><span class=\"sr\">/button&gt;</span>\n<span class=\"sr\">&lt;button data-xdh-onevent=\"Clear\"&gt;Clear&lt;/</span><span class=\"n\">button</span><span class=\"o\">&gt;</span>\n<span class=\"no\">HEREDOC</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acConnect</span><span class=\"p\">(</span><span class=\"n\">userObject</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">setLayout</span><span class=\"p\">(</span><span class=\"s2\">\"\"</span><span class=\"p\">,</span> <span class=\"vg\">$body</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n<span class=\"k\">end</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acSubmit</span><span class=\"p\">(</span><span class=\"n\">userObject</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">alert</span><span class=\"p\">(</span><span class=\"s2\">\"Hello, \"</span> <span class=\"o\">+</span> <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">getContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span> <span class=\"o\">+</span> <span class=\"s2\">\"!\"</span><span class=\"p\">)</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n<span class=\"k\">end</span>\n\n<span class=\"k\">def</span> <span class=\"nf\">acClear</span><span class=\"p\">(</span><span class=\"n\">userObject</span><span class=\"p\">,</span> <span class=\"n\">dom</span><span class=\"p\">,</span> <span class=\"nb\">id</span><span class=\"p\">)</span>\n    <span class=\"k\">if</span> <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">confirm?</span><span class=\"p\">(</span><span class=\"s2\">\"Are you sure?\"</span><span class=\"p\">)</span>\n        <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">setContent</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">,</span> <span class=\"s2\">\"\"</span><span class=\"p\">)</span>\n    <span class=\"k\">end</span>\n    <span class=\"n\">dom</span><span class=\"o\">.</span><span class=\"n\">focus</span><span class=\"p\">(</span><span class=\"s2\">\"input\"</span><span class=\"p\">)</span>\n<span class=\"k\">end</span>\n\n<span class=\"n\">callbacks</span> <span class=\"o\">=</span> <span class=\"p\">{</span>\n    <span class=\"s2\">\"\"</span> <span class=\"o\">=&gt;</span> <span class=\"nb\">method</span><span class=\"p\">(</span><span class=\"ss\">:acConnect</span><span class=\"p\">),</span>\n    <span class=\"s2\">\"Submit\"</span> <span class=\"o\">=&gt;</span> <span class=\"nb\">method</span><span class=\"p\">(</span><span class=\"ss\">:acSubmit</span><span class=\"p\">),</span>\n    <span class=\"s2\">\"Clear\"</span> <span class=\"o\">=&gt;</span> <span class=\"nb\">method</span><span class=\"p\">(</span><span class=\"ss\">:acClear</span><span class=\"p\">),</span>\n<span class=\"p\">}</span>\n\n<span class=\"no\">Atlas</span><span class=\"o\">.</span><span class=\"n\">launch</span><span class=\"p\">(</span><span class=\"n\">callbacks</span><span class=\"p\">)</span></code></pre>\n\n<p>Pour l’exécuter :</p>\n\n<ul>\n<li>\n<code>git clone http://github.com/epeios-q37/atlas-ruby</code> ;</li>\n<li>\n<code>cd atlas-ruby</code> ;</li>\n<li>y stocker le code source ci‐dessus dans un fichier nommé <code>Hello.rb</code> ;</li>\n<li>\n<code>ruby Hello.rb</code>.</li>\n</ul>\n<p>Voir également <a href=\"https://github.com/epeios-q37/atlas-ruby\">https://github.com/epeios-q37/atlas-ruby</a>.</p>\n<h2>Interaction avec l’application</h2>\n\n<p>Lorsque l’application est lancée, l’URL permettant d’y accéder est automatiquement ouverte dans le navigateur Web. Cette URL est, par ailleurs, affichée dans la console à partir de laquelle l’application est lancée, au cas où son ouverture automatique échouerait. En outre, au‐dessous de l’application, le code QR correspondant à cette URL est affiché, destiné à être lu par un <em>smartphone</em>, ou tout autre dispositif connecté à Internet et disposant d’un navigateur Web moderne, pour pouvoir y utiliser l’application. Accessoirement, cliquer sur ce code QR ouvre une nouvelle session de l’application.</p>\n\n<p>Cette URL, grâce à une particularité du <em>toolkit</em> Atlas, est valable où que ce soit sur Internet aussi longtemps que l’application s’exécute. Nul besoin de configurer le mobile, ou le dispositif utilisé pour accéder à l’application, pour le connecter au même réseau local que celui auquel est connecté l’ordinateur faisant tourner l’application. Et il n’est pas non plus nécessaire de configurer une « box », ou un quelconque routeur, pour ouvrir un port vers cet ordinateur, ni de déployer l’application sur une machine distante.</p>\n\n<p>Grâce à cela, le développeur en herbe peut facilement donner accès à son application à un ami, un parent, un professeur, etc., juste en lui envoyant un message avec l’adresse URL. Où qu’il soit, il lui suffit de brancher au réseau local l’ordinateur sur lequel tourne son application pour qu’il puisse y donner accès à qui il veut en lui fournissant l’URL.</p>\n\n<p>Le <em>toolkit</em> Atlas pourra ainsi accompagner l’apprenti dès le début de sa formation, lui permettant de doter ses programmes d’une interface Web, à laquelle il aura facilement accès à partir de son mobile, et à laquelle il pourra donner accès à qui il voudra : amis, parents, professeurs, etc., fussent‐ils à l’autre bout du monde.</p>\n<h2>Le serveur dans le <em>cloud</em>\n</h2>\n\n<p>La partie du <em>toolkit</em> installée sur la machine du développeur se connecte par défaut à un serveur situé dans le <em>cloud</em> et gracieusement mis à disposition. Le code s’exécutant sur ce serveur est sous license libre, comme le reste du <em>toolkit</em>, donc il sera possible à qui le veut de l’installer sur le serveur de son choix. On perd l’accessibilité « <em>out of the box</em> », mais cela peut avoir un intérêt pour quelqu’un qui souhaiterait ne pas être à la merci d’une éventuelle défaillance du serveur par défaut, dans le cadre d’un atelier dans lequel le <em>toolkit</em> Atlas serait utilisé, par exemple.</p>\n<h2>Synthèse</h2>\n\n<p>Grâce au <em>toolkit</em> Atlas, un débutant en programmation pourra facilement :</p>\n\n<ul>\n<li>doter ses logiciels d’une interface graphique, plus attrayante que l’interface textuelle dont il aurait dû se contenter sinon ;</li>\n<li>interagir avec ses logiciels via son propre <em>smartphone</em>, à l’instar de la plupart des applications qu’il utilise ;</li>\n<li>montrer ses logiciels en transmettant une simple URL que tout un chacun pourra ouvrir dans le navigateur Web de son smartphone.</li>\n</ul>\n<p>En outre, le <em>toolkit</em> Atlas :</p>\n\n<ul>\n<li>n’est pas lié à un langage en particulier ; il est actuellement disponible en cinq langages et leur nombre devrait croître à l’avenir ;</li>\n<li>rend les logiciels immédiatement accessibles depuis Internet, sans qu’il soit nécessaire de configurer quoi que ce soit ou de disposer d’une infrastructure particulière ;</li>\n<li>s’appuie sur des standards éprouvés et répandus (HTML et <a href=\"https://fr.wikipedia.org/wiki/Document_Object_Model\" title=\"Document Object Model\">DOM</a>), qui font partie de la culture générale de tous développeurs.</li>\n</ul>\n<p>Néanmoins :</p>\n\n<ul>\n<li>il faut quelques notions de HTML, de <a href=\"https://fr.wikipedia.org/wiki/Feuilles_de_style_en_cascade\" title=\"Cascading Style Sheets — Feuilles de style en cascade\">CSS</a> et de <a href=\"https://fr.wikipedia.org/wiki/Document_Object_Model\" title=\"Document Object Model\">DOM</a>, mais ce sont des notions faciles à acquérir, pour lesquelles on peut aisément trouver des tutoriels pour tous les niveaux ;</li>\n<li>pour des raisons techniques, le <em>toolkit</em> nécessite une connexion à un serveur externe, mais :\n\n<ul>\n<li>un tel serveur est gracieusement mis à disposition (c’est le serveur auquel le <em>toolkit</em> se connecte par défaut),</li>\n<li>le code tournant sur ce serveur étant librement disponible, il est possible de le faire tourner un autre serveur et de configurer le <em>toolkit</em> Atlas pour qu’il s’y connecte.</li>\n</ul>\n</li>\n</ul>\n<p>Et, bien sûr, l’ensemble du <em>toolkit</em> est diffusé sous licence libre (<a href=\"https://fr.wikipedia.org/wiki/GNU_Affero_General_Public_License\" title=\"GNU Affero General Public License\">AGPL</a>).</p>\n</div>\n<div><a href=\"https://linuxfr.org/news/les-jeunes-et-la-programmation-atlas-toolkit-v0-7.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116686/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/les-jeunes-et-la-programmation-atlas-toolkit-v0-7#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637970,
			"topic_id": 1553637970,
			"doc": "depeche"
		},
		{
			"title": "Émission « Libre à vous ! » du 19 mars 2019 — Podcasts et références",
			"pubDate": "2019-03-20 22:31:42",
			"link": "https://linuxfr.org/news/emission-libre-a-vous-du-19-mars-2019-podcasts-et-references",
			"author": "Frederic Couchet",
			"body": "\n<div>\n<p>La dix‐septième émission « Libre à vous ! » de l’April a été diffusée sur la <a href=\"https://cause-commune.fm/\">radio Cause commune</a>, mardi 19 mars 2019.</p>\n\n<p>Nous avons commencé par la troisième chronique « Les transcriptions qui redonnent le goût de la lecture » de Marie‐Odile Morandi. Nous avons enchaîné avec notre sujet principal qui portait sur les logiciels libres pour l’image et la vidéo avec Lionel Allorge et Jehan Pagès. Nous avons poursuivi par un point sur la proposition de directive droit d’auteur avec Anne‐Catherine Lorrain, conseillère politique à la commission parlementaire affaires Juridiques (JURI) au Parlement européen pour le groupe des Verts européens. Nous avons terminé par diverses annonces.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://cause-commune.fm/\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103732\">Radio Cause Commune</a>\n</li>\n<li>lien n°2 : <a title=\"https://april.org/libre-a-vous\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103733\">Libre à vous !</a>\n</li>\n<li>lien n°3 : <a title=\"https://media.april.org/audio/radio-cause-commune/libre-a-vous/emissions/20190319/libre-a-vous-20190319.ogg\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103734\">Podcast de la 17ᵉ émission </a>\n</li>\n<li>lien n°4 : <a title=\"https://www.april.org/emission-libre-a-vous-diffusee-mardi-19-mars-2019-sur-radio-cause-commune\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103735\">Les références pour la 17ᵉ émission et les podcasts par sujet</a>\n</li>\n<li>lien n°5 : <a title=\"https://april.org/lav.xml\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103736\">S’abonner au podcast</a>\n</li>\n<li>lien n°6 : <a title=\"https://cause-commune.fm/faire-un-don/\" hreflang=\"fr\" href=\"https://linuxfr.org/redirect/103737\">Soutenir la radio par un don</a>\n</li>\n</ul>\n<div>\n<p>Le <a href=\"https://media.april.org/audio/radio-cause-commune/libre-a-vous/emissions/20190319/libre-a-vous-20190319.ogg\">podcast est disponible</a>, ainsi qu’une <a href=\"https://april.org/emission-libre-a-vous-diffusee-mardi-19-mars-2019-sur-radio-cause-commune\">page qui liste toutes les références citées pendant l’émission</a> (vous trouverez également sur cette page les podcasts par sujet traité). L’émission dispose d’un <a href=\"https://april.org/lav.xml\">flux RSS compatible avec la baladodiffusion</a> auquel vous pouvez vous abonner, ainsi qu’un <a href=\"https://talk.libre-a-toi.org/channel/libreavous\">salon dédié à l’émission sur le <em>webchat</em> de la radio</a>.</p>\n\n<p>L’ambition de « Libre à vous ! » est d’être une émission d’explications, d’échanges et d’actions concernant les dossiers politiques et juridiques que l’April traite et les actions qu’elle mène. Une partie de l’émission sera également consacrée aux actualités et actions de type sensibilisation.</p>\n\n<p>« Libre à vous ! » est devenue en 2019 une émission hebdomadaire qui est diffusée en direct chaque mardi de 15 h 30 à 17 h, et rediffusée le soir même de 21 h à 22 h 30. La prochaine émission sera diffusée en direct sur la bande FM en Île‐de‐France (93,1 MHz) et sur le <a href=\"https://cause-commune.fm/\">site Web de la radio</a> mardi 26 mars 2019, de 15 h 30 à 17 h. Notre sujet principal portera sur les « civic tech » et le logiciel libre.</p>\n\n<p>La radio a besoin de soutien financier pour notamment payer les frais matériels (loyer du studio, diffusion sur la bande FM, serveurs…). Nous vous encourageons à <a href=\"https://cause-commune.fm/faire-un-don/\">aider la radio en faisant un don</a>.</p>\n\n<p>La radio Cause Commune dispose d’une messagerie sur laquelle vous pouvez laisser des messages (annonces, rires, poèmes, coups de gueule, vœux…) destinés à passer à l’antenne sur la radio. Le numéro à appeler est le +33 1 88 32 54 33.</p>\n</div>\n<div><a href=\"https://linuxfr.org/news/emission-libre-a-vous-du-19-mars-2019-podcasts-et-references.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116728/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/emission-libre-a-vous-du-19-mars-2019-podcasts-et-references#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637969,
			"topic_id": 1553637969,
			"doc": "depeche"
		},
		{
			"title": "Agilité et DevOps : mercredi prochain, la TuleapCon est en Suisse",
			"pubDate": "2019-03-20 09:39:55",
			"link": "https://linuxfr.org/news/agilite-et-devops-mercredi-prochain-la-tuleapcon-est-en-suisse",
			"author": "ManonM",
			"body": "\n<div>\n<p>La conférence TuleapCon revient pour sa troisième édition le mercredi <strong>27 mars à Genève‐Carouge</strong>. C’est dans à peine huit jours ! Inscrivez‐vous.</p>\n\n<p>La TuleapCon est une journée de conférences et de partage, <strong>gratuite et ouverte à tous</strong>.</p>\n\n<p>Développement logiciel et agilité, SAFe, DevOps, PLM‐ALM. En une journée, elle a pour objectif de vous apporter des réponses concrètes pour vous aider dans vos défis actuels.</p>\n\n<p><img src=\"https://img.linuxfr.org/img/68747470733a2f2f67616c6c6572792e6d61696c6368696d702e636f6d2f613961666363643762323831616337663739363838613334342f696d616765732f62613264333432332d623466642d343538662d616131322d6538346662336163656132652e706e67/ba2d3423-b4fd-458f-aa12-e84fb3acea2e.png\" alt=\"Bannière TuleapCon2019-FR\" title=\"Source : https://gallery.mailchimp.com/a9afccd7b281ac7f79688a344/images/ba2d3423-b4fd-458f-aa12-e84fb3acea2e.png\"></p>\n\n<p>Chefs de projet, développeurs, IT, cette journée est imaginée pour vous. Des équipes suisses et françaises partagent leurs expériences, leurs apprentissages, en complément d’ateliers plus techniques et de démonstrations d’outils, basés sur Tuleap.</p>\n\n<p>Vous rencontrerez des speakers d’entreprises internationales et industrielles, des experts en ingénierie logicielle, des développeurs de haut niveau, tous réunis autour d’une technologie de pointe 100 % libre.</p>\n\n<p>Utilisateur ou non de Tuleap, vous êtes le bienvenu.</p>\n\n<p>Au programme (conférences en français) :</p>\n\n<ul>\n<li>Tuleap expliqué par les utilisateurs : leur <em>workflow</em> quotidien ;</li>\n<li>partage d’expérience : EMmicro-Groupe Swatch, ST Genève, Thales, Université Grenoble Alpes, HES-SO, JTEKT-Groupe Toyota ;</li>\n<li>ateliers : Kanban <em>vs</em> Scrum, Monitoring et performances, PLM-ALM, SAFe, Traçabilité et tests ;</li>\n<li>démos des nouvelles fonctionnalités Tuleap : <em>baseline</em>, nouvel interface du gestionnaire de documents, nouvelle configuration, facilité des <em>workflows</em>, des <em>trackers</em> ;</li>\n<li>petit déjeuner, déjeuner et dîner offerts par l’équipe Tuleap.</li>\n</ul>\n<p>Au plaisir de vous rencontrer là‐bas.</p>\n</div>\n<ul>\n<li>lien n°1 : <a title=\"https://tuleapcon.tuleap.org/?utm_source=linuxfr&amp;utm_campaign=linuxfr-TC#program\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103725\">Programme de la TuleapCon 2019</a>\n</li>\n<li>lien n°2 : <a title=\"https://tuleapcon.tuleap.org/?utm_source=linuxfr&amp;utm_campaign=linuxfr-TC#register\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103726\">Inscription gratuite</a>\n</li>\n<li>lien n°3 : <a title=\"https://www.tuleap.org/?utm_source=linuxfr&amp;utm_campaign=linuxfr-TC\" hreflang=\"en\" href=\"https://linuxfr.org/redirect/103727\">À propos de Tuleap</a>\n</li>\n</ul>\n<div>\n<h2>À propos de Tuleap</h2>\n\n<p>Tuleap est une solution 100 % lilbre pour la gestion Agile et le développement logiciel.</p>\n\n<p>Avec Tuleap, développeurs, chefs de projets, départements qualité et DSI, collaborent efficacement. Ensemble, ils créent des logiciels plus rapidement, de façon automatisée.</p>\n\n<p>Agilité, <em>Waterfall</em> ou mixte, gestion des exigences, DevOps ; Tuleap permet à chaque équipe d’adopter la méthode la plus efficace pour elle et d’utiliser les outils dont elle a vraiment besoin. </p>\n\n<p><img src=\"https://img.linuxfr.org/img/68747470733a2f2f67616c6c6572792e6d61696c6368696d702e636f6d2f613961666363643762323831616337663739363838613334342f696d616765732f61323263653430652d646336362d343035382d393830372d3531636366663165333465392e706e67/a22ce40e-dc66-4058-9807-51ccff1e34e9.png\" alt=\"Fonctionnalités Tuleap\" title=\"Source : https://gallery.mailchimp.com/a9afccd7b281ac7f79688a344/images/a22ce40e-dc66-4058-9807-51ccff1e34e9.png\"></p>\n</div>\n<div><a href=\"https://linuxfr.org/news/agilite-et-devops-mercredi-prochain-la-tuleapcon-est-en-suisse.epub\">Télécharger ce contenu au format Epub</a></div>    <p>\n      <strong>Commentaires :</strong>\n      <a href=\"https://linuxfr.org/nodes/116720/comments.atom\">voir le flux atom</a>\n      <a href=\"https://linuxfr.org/news/agilite-et-devops-mercredi-prochain-la-tuleapcon-est-en-suisse#comments\">ouvrir dans le navigateur</a>\n    </p>\n",
			"added": 1553637968,
			"topic_id": 1553637968,
			"doc": "depeche"
		}
	],
	"next_topic_id": 11,
	"next_comment_id": 1
}