{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1572051069_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": 1
	},
	"next_comment_id": 10,
	"comment": {
		"1572903433_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 1,
				"body": "This is all bullshit - when you get old, the need disappears and although you long to be able to fap properly (because your wifey has gone frigid) you just end up dreaming about it",
				"added": 1573700676
			}
		],
		"1573864603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 2,
				"body": "glad I don't own a gun - if I get shot (which is unlikely where I live) I'll just be having a good time no matter what",
				"added": 1573969804
			}
		],
		"1577593821_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 3,
				"body": "The climate is changing, but I doubt that humans have affected it as much as they are trying to make out we have.  Maybe some, but not on the cataclysmic scale they are making out itty bitty contribution to be.  It's all for money and power - people are usurping political power and reaping in money because of the \"claims\" - it's all bullshit, the planet is shedding it's virus, and that virus is the human race and a lot of other creatures as well unfortunately for them",
				"added": 1577599754
			}
		],
		"1589480365_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": [
			{
				"comment_id": 4,
				"body": "I would never use NordVPN - just like facebook, sucking your info and feeding it to 17 eyes  3 letter agencies",
				"added": 1589801089
			}
		],
		"2_1J3rJ8ecnwH2EPYa6MrgZttBNc61ACFiCj": [
			{
				"comment_id": 5,
				"body": "yes",
				"added": 1600574640
			}
		],
		"1602100079_1L8aDU3W6ecnjZDQURTV7d5tx9aXjMybrS": [
			{
				"comment_id": 6,
				"body": "What is the hard drive space requirement?  500Mb, 50Gb?  what about intermittant connections - I tried to find that on the page, but nada - did not read the documentation yet though",
				"added": 1602120700
			}
		],
		"1601063471_19dzDaMFcuCusp4anMUPkVc8zRzLJmxo9T": [
			{
				"comment_id": 7,
				"body": "freenet is the best anon platform - FMS in particular for intelligent discussion, Frost for \"anarchy\" style free speech",
				"added": 1602121744
			}
		],
		"1605987642_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q": [
			{
				"comment_id": 8,
				"body": "This is complete bullshit",
				"added": 1606453778
			}
		],
		"1623961112_1ASusrn34PQJr8ipd1LcBamudPHxQEWheA": [
			{
				"comment_id": 9,
				"body": "The only way to see God is through His Son Jesus Christ - you may want to become like God, but if you analyse what some people are saying here - that Lucifer tryed to become God - he was thrown from Heaven to earth, and will be judged by God in the end and thrown into the lake of fire.  If you think you can become \"gods\" you are wrong - no one except God is God and no one else can be Him (or Her if you are that way inclined) You can follow the prophets all you like, but they all (every single one) talked about Jesus and what He means in the grand scheme of things.  There is no one who is perfect enough to be God (I don't have my bible handy or I'd give you a verse)(for everything I say here) and the only way to get into heaven - no matter how you scheme or plan - is through the blood of Jesus Christ.  I know no one likes to admit that, but if you do some real research into heaven and how to get there, Jesus will come up.  He will forgive your sin - we all sin, and fall short of God, so we have to be forgiven of the sin by Jesus' grace - then we can meet God and enjoy Heaven with Him - it's gonna be so cool, Heaven, I can't wait!! But saying that - I have to finish my mission here on earth, and He will call me home to Heaven to be with Him when my time comes, because I believe in Him and trust Him to do what He said He will do :)",
				"added": 1625552118
			}
		]
	},
	"comment_vote": {}
}