{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1624144633,
			"title": "Zeronet Problem ? Seeding",
			"body": "hi is Wird because i have 2 computer that mean 2 Zeronet i have 1 with my site and file approx 90 file less of 1.5 gb and when i Update Sign and i use the other zeronet computer i try to load the site and the file normaly download i can only approx 29 file ... Why with certain site is working to have approx 80 file and on certain site i create i can only have 29 .. The Problem is Update Failled and i see a side of the site on Zerohello i see the number of file failed ! ... \n\na way to solve that ?\n\nbecause even with time ,restart , again an update on the both side on the site.. even again another sign .. and update .. and time is like to change nothing ! .. i have try on the second computer where i try to download the site and file i have try to Delete the site on zerohello and again return .. and do all of that is same to do the same thing and a start is ask me to give 2000 mb on the site is perfect ! ",
			"added": 1624144632
		}
	],
	"topic_vote": {
		"1622827973_17FpvmzYnpNwpzJ9BQDG2eymGCaTRhVasD": 1,
		"1623112333_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": 1
	},
	"next_comment_id": 6,
	"comment": {
		"1622402090_1ATMPS5rPc8as7ywdMTXMHD4bkX2wfuwmE": [
			{
				"comment_id": 1,
				"body": "Fuck the anti pedo",
				"added": 1622420441
			}
		],
		"1622827973_17FpvmzYnpNwpzJ9BQDG2eymGCaTRhVasD": [
			{
				"comment_id": 2,
				"body": "http://127.0.0.1:43110/1G4pF1k82qiTgyywWzzuvQFWPcoBK4MNP8/  Hi .. Our project Under build .. not perfect We are in Tor Too .. We Recommended to all Whonix to install zeronet inside all pass over tor !!!",
				"added": 1622842530
			},
			{
				"comment_id": 3,
				"body": "> [styromaniac](#comment_3107_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): eply\n\nFuck You Fag of Anti pedo",
				"added": 1622842601
			}
		],
		"1622847784_1HKsVQMZ4JucuBTtzpErwhLKMnScUMGvko": [
			{
				"comment_id": 4,
				"body": "Hi .. Use Whonix .. In Whonix All pass Over tor and I use Zeronet to share my Database of CHILD PORN .. The Zona is My project !! \nif you have tor \n\nThis is Our chat (ADMIN in GREEN IS me This Zeronet Acount is my 2rd and Last ! ) I am Not Connected Each Hours or day ! \n\nhttp://dxaz7sohsanrmjogple3pkgg52jnv7g3mi72nqixezpuxkg6vnfq6nid.onion/chat/chat.php\n\nBlock Javascript in tor ! ..",
				"added": 1622855599
			}
		],
		"1624144633_1KhfhSvSnonDqSgVk8B6Cg5WE2u2ZGLqCr": [
			{
				"comment_id": 5,
				"body": "> [ssdifnskdjfnsdjk](#comment_1043_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS): ZN development is idle now.Did you try ZeroHello right sites menu and three dots next to that site, menu option \"Check files\"?, also do Update menu option under that three dots menu. Maybe it will sync. Second thing to try is to restart ZN, third thing is to publish again, fourth thing is to delete incomplete site and let it re-download (if other computer has the full site). [...]\n\nthank you all of that Try and is do the same , and certain site seed only 4 file is wird",
				"added": 1624491379
			}
		]
	},
	"comment_vote": {
		"82_1Fs7oXqGMju27ZzXFFJn4dLt11yrbg5HKs": 1
	}
}