{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1,
			"title": "Протокол Matrix im",
			"body": "https://www.youtube.com/watch?v=jcZ8t2ZTX14",
			"added": 1561009327
		},
		{
			"topic_id": 2,
			"title": "В Россию приезжает отец Free Software, Ричард Столлман. Ищем того, кто готов на пару дней его приюти",
			"body": "Есть интересная проблема, помочь решить которую можете только вы. Вкратце: в августе в Санкт-Петербург на TechTrain приезжает Ричард Столлман, и он не любит жить в гостиницах. У вас появляется уникальная возможность приютить у себя дома на пару дней отца всего Free Software, и под катом мы расскажем — как.\n\n\nНебольшая историческая справка. Доктор Ричард Мэттью Столлман создал движение свободного ПО в 1983 году и начал разработку операционной системы GNU в 1984. GNU действительно свободна: любой имеет право копировать и распространять её, внося изменения, если пожелает. Система GNU/Linux — в основном, операционная система GNU с ядром Linux Линуса Торвальдса — сейчас используется на десятках миллионов компьютеров, их количество сложно точно подсчитать. Столлман получил множество престижных премий: ACM Grace Hopper Award, ACM Software and Systems Award, EFF Pioneer Award, MacArthur Foundation Fellowship и так далее и тому подобное. Ну и конечно, Internet Hall of Fame.\n\n\nКажется невероятным, что такой человек не хочет жить в отличной гостинице (которую мы ему, конечно, предложили). Тут есть и чисто человеческие аспекты, и рациональное зерно.\n\nhttps://habr.com/ru/company/jugru/blog/455936/",
			"added": 1563217802
		}
	],
	"topic_vote": {
		"4_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": 1,
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": 1,
		"4_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": 1,
		"1_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": 1
	},
	"next_comment_id": 12,
	"comment": {
		"1_194QLKdUMMxraK6eEW1YVU6qZjw6Fz71WQ": [
			{
				"comment_id": 1,
				"body": "> [if0](#comment_37_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Протокол Matrix требует серверов, которые кто-то должен поднимать и поддерживать, заодно вести логи (и делиться ими с кем следует ),  поэтому это пример очередного ненужно.\n\nсервера в разных странах",
				"added": 1561053268
			},
			{
				"comment_id": 2,
				"body": "> [if0](#comment_40_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Тем проще ограничить к ним доступ в условиях Чебурнета. А внутри его вряд ли найдутся отчаянные смельчаки отважившиеся хранить на своем публичном сервере сообщения случайных людей, тем более в зашифорованном виде. Вы бы сами рискнули поднять подобный сервер у себя дома?\n> Откуда вы узнаетете, что заграничный сервер не создан тов. майором?\n> Это не отменяет факта сбора метаданных о вас: списка ваших контактов, времени отправки и приема каждого сообщения, их отправители и адресаты. Что может оказаться еще опаснее, чем раскрытие содержимого ваших зашифрованных сообщений.\n\nсогласен но в условиях чебурнета можно ставить сервер в у себя дома и вся россия будет им пользоваться",
				"added": 1561083673
			},
			{
				"comment_id": 3,
				"body": "> [if0](#comment_41_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Это шутка такая? Ставить и не беспокоится о приходе тов. майора который обнаружит на нем переписку членов зпрещенных организций, оскорбления власти и прочие призывы, которые вы лично публично распространяете...\n\nкакой маер его через Tor браузер можно юзать https://riot.im/app/#/welcome",
				"added": 1561180127
			},
			{
				"comment_id": 4,
				"body": "> [if0](#comment_42_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Tor браузер в Чебурнете! Это уже не смешно. После того, как в здесь судят владельцев выходных нод, в результате чего ноды Tor на рунетовских адресах будут с большой вероятностью - майорские. Поэтому, первым делом при настройке клиента запрещается их использование.\n> Это будет работать исключительно при переходе в .onion и полного отказа от клирнета. Указанный вами адресок, как-то не похож на .onion. Другой вопрос: много ли народа (кроме майоров, которым по службе положено) захотят поднимать у себя транзитные ноды Tor? Зарубежные - работать перестанут. Тогда, более логичным видится выбор i2p, а не Tor.\n> И повторюсь еще раз: даже скрытие вашего IP не отменяет сбор информации на сервере о контактах вашего аккаунта, кому и когда вы пишите и кто пишет вам. Если кто-то из списка ваших контактов окажется в разработке, то и к вам резонно возникнут вопросы от органов.\n\nчастичьно согласен",
				"added": 1561204809
			},
			{
				"comment_id": 5,
				"body": "> [if0](#comment_43_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x): Речь, вообще то шла о рисках, сопровождающих поднятие \"у себя дома\" публичного сервера для Matrix, который должен работать постоянно и хранить данные, необходимые для его работы...  А не о безопасности переписки в нем или любом другом мессенджере.\n\nможно анонимно арендовать сервер",
				"added": 1561311722
			},
			{
				"comment_id": 6,
				"body": "Контингент в матриксе не хилый собрался одни линуксоиды продвинутые обычных людей там мало",
				"added": 1561398900
			}
		],
		"4_1Gi18HRMzqfWFmZU3D1wBjESbFxAkmSnEF": [
			{
				"comment_id": 7,
				"body": "Я прросто ухуел на сколько уязвимо было мое жилище наконец Решение проблемы найдено https://www.youtube.com/watch?v=OgMtm2zboJo\nhttps://www.youtube.com/watch?v=ZrR9cWkA4Ps",
				"added": 1562389735
			}
		],
		"1_1Mm1ztyaX85grxg2uu8KUWa8MiJi1dG2GK": [
			{
				"comment_id": 8,
				"body": "LUKS рулет",
				"added": 1563170323
			}
		],
		"3_1Kv1qY79NxZjVaw96WNKVfWPMKTLtcnB3e": [
			{
				"comment_id": 9,
				"body": "постить нужно с левых симок левая симка серый телефон или модем запостил выбросил",
				"added": 1563379264
			}
		],
		"1_1AKGcFU1NJte4TwmXReVAPqNCybV9qvWkV": [
			{
				"comment_id": 10,
				"body": "firefox",
				"added": 1564549234
			}
		],
		"1_1MGvRSZ8W9qJZgrQ6yJmwCfHWdfBA9hYrQ": [
			{
				"comment_id": 11,
				"body": "хахах прикольно",
				"added": 1565094674
			}
		]
	},
	"comment_vote": {
		"42_1HwxLJm2n3oKw7W9jaSAznUvAavLwZo35x": 1,
		"146_1GooUE19488nDwG3TdkM8seYAHct4gjkq4": 1
	}
}