{
	"next_topic_id": 1,
	"topic": [],
	"topic_vote": {
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": 1,
		"1578862459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578781307_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1578947226_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1579155770_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1579209588_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1579271298_1G8B8kPwDH69FMuSPEvNkG8JJy5PxTpQtc": 1,
		"1579235620_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1579335332_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1579444197_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": 1,
		"1579208009_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1557261503_17ArNJgy6YwDKjMSsnx1es2ie5jLHJbD9P": 1,
		"1580247379_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": 1,
		"1580321546_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": 1,
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1580253527_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1580901933_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1575616298_1NHiaCL2VFiEeiQZcaR3LMnJ53tkepwY9T": 1,
		"1584527258_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": 1,
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": 1,
		"1584944443_1PHntD2ruZCta8SpVvFTjvDSKaCZZEaXRG": 1,
		"1584744394_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"1587651983_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": 1,
		"1587581309_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1,
		"1588110604_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": 1
	},
	"next_comment_id": 150,
	"comment": {
		"1578343451_19N49krDPpRvUbPMuHmxJVAXgKXPLQP32w": [
			{
				"comment_id": 1,
				"body": "The three dots seen here on ZeroTalk preforms the same action as going over to ZeroID and typing in that user's name and muting them manually.\n\nSo correct, blocking someone on ZeroID will hide their uploads from ZeroUp.",
				"added": 1578359442
			}
		],
		"1578260544_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 2,
				"body": "> [moor](#comment_360_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH): that what drivers the market is low wage labour to have competitive prices, workers usually strike, form unions but the boss and the state always uses warfare tactics to coerce this people to work for cheap,\n\nThat doesn't explain away automation. Competitive prices can be brought about through the use of no wage labour. (automation) But sure enough, those reduced production costs rarely result in lower priced (more competitive) items.",
				"added": 1578408115
			}
		],
		"1578388821_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 3,
				"body": "Often boomers who say really stupid shit is because they don't live the same lives as the average American.\n\nOften they are old enough to have gotten a post graduate education for a price a summer fast food job could pay for. They often have inheritance of wealth & land. And they will often spend a lifetime of watching Fox News or the Washington Post and believing every word written by them as if it was gospel.\n\nSo they say phrases that support their renter & ownership classes to a generation that has the little potential of possessing either.",
				"added": 1578408522
			}
		],
		"1578303373_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP": [
			{
				"comment_id": 4,
				"body": "> [gadfly](#comment_14_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8): If you're using Mullvad \n\nPlay works just find with my qBittorrent. I click,  client amends a list of the most popular trackers, and downloads quickly.",
				"added": 1578409509
			}
		],
		"1578036046_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 5,
				"body": "I know my LCD has bad color contrast, but the seed button appears as total black on my screen\nLike as if it is not even there.\n\nAlso the 'Show More' at the bottom of the page is the same way.  Maybe a white boarder with white text would be more suitable?",
				"added": 1578409745
			},
			{
				"comment_id": 6,
				"body": "Also the delete and edit buttons are invisible on my screen, but otherwise I enjoy the dark theme with the transparent header bar.",
				"added": 1578411906
			}
		],
		"1578444583_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 7,
				"body": "Thanks for the update",
				"added": 1578444986
			},
			{
				"comment_id": 8,
				"body": "Maybe the US will attempt to solve this with (made in China) automation.\n\nhttps://youtu.be/S2CxkwmrUMo\nFox News Report from a few hours ago about more missile. I picked Fox News for the source because they are the most eager when it comes to blowing the War Horn.",
				"added": 1578450878
			}
		],
		"1578341356_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 9,
				"body": "After giving a mute to barnstokkr and duck0  for their OT spam, here is my view on the matter.\n\nPersonally, I always thought it was dumb that so many people would upload regular porn to a dark network when so much is available on the clearnet. I get that porn is banned in some areas like the Middle East, but there are plenty of special purpose sites on zeronet that are dedicated to specifically that. It doesn't need to be shared everywhere nor does the zeronet community need to be tolerant of it. A user having a right to exercise speech does not mean that user has a right to infringe on the speech of the site owner they are publishing to.\n\nIn the end, KopyKate is qkitty's site so it is pretty much her rules of the playing field. If the user doesn't like it, the are free to  clone the site like the guy who posts Hollywood flicks to [KopyKate2](/15GACn5cumjT2RsN7NjfnUYuM2a96xN5aD) does. I believe he said he is tolerant of everything on his site, so they are free to publish porn there.\n\nTo be fair, these inconsiderate ass hats should be thanking her for giving the community a site that can be cloned in the first place. She could have released it and kept the code encrypted. I suspect those who want to protect their freedom to post whatever they want go on to refuse to start their own sites because nobody wants to hear the garbage that they have to say. But that's just my opinion. Last I checked, TrollTalk.bit has yet to be created.",
				"added": 1578466990
			},
			{
				"comment_id": 10,
				"body": "> [hferbwauif](#comment_56_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): If the owner kept the code for the site encrypted, the site wouldn't work. \n\nI used the wrong term sorry, I meant to use 'obfuscated', so you're technically correct.\n\n> [hferbwauif](#comment_56_16dnrZKRMLhQCjv6nxx7tP5KJ2H2PdqRxP): I'll point out this is the kind of people who is encouraging censorship on a decentralized platform.\n\nI have to disagree, if I develop a platform, it is my choice to release the code obfuscated (which distracts from alterations) or developed with multiple comments in the hopes of assisting alterations. I do hope you realise that there are aspects of zeronet that are just as obfuscated such as the spam filter used by some board owners & ZeroID",
				"added": 1578510860
			},
			{
				"comment_id": 11,
				"body": "> [filips](#comment_406_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY): Your code can't be truly encrypted, because otherwise it won't run unless it is decrypted at some point,\n\nYes, I know, I used the wrong word, hence my switch to the term 'obfuscated'.",
				"added": 1578511288
			},
			{
				"comment_id": 12,
				"body": "I would say ban all porn, but I'm pretty sure that would include that official music video of enish - fiks which is practically impossible to find anymore. I got it from a bandcamp purchase of his digital album many years ago.",
				"added": 1578545310
			},
			{
				"comment_id": 14,
				"body": "> [caropc1v6](#comment_11_14mqeC9JkKTrWmaR1X4LdtdAuB8qaAhbNB): You're worried about the trash of the state, in something that fights ANY censorship,\n\nThe choice to avoid sex & porn and to keep it off of some sites such as ZeroTalk is not censorship, it's called maintaining the direction of the site owner. Ergo the title, \"__I__ personally would ban all porn if __I__ had a file-sharing or video site\"",
				"added": 1578584145
			},
			{
				"comment_id": 16,
				"body": "> [styromaniac](#comment_1668_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): You say I'm pro censorship. ...\n\nWhy even respond to people like that when there is a clear indication that there is no reason or agreement to be negotiated on. It is clear that the user 'caropc1v6' said that porn is allowed on the KopyKate2 clone so it is not as if that material is forsaken. But for some reason they refuse to understand that a site owner deciding to permit or ban what is published on their owned site is somehow interpreted as a infringement of their right to disagree with the views of the site owner. Hence the persistent and repeated \"I don't care if it is YOUR site, it is still censorship!\" argument.\n\nIf barnstokkr gave as many shits as they claim to they would clone these sites as a direct competitor to the supposedly 'projecting censorship' ones.",
				"added": 1578608050
			}
		],
		"1578551830_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 13,
				"body": "If you let her stay with you for over five months without contributing, you are establishing your boundaries and expectations of the relationship. Why would she ever change when you have already accepted her for who she is now?",
				"added": 1578583582
			},
			{
				"comment_id": 22,
				"body": "> [fib](#comment_70_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): said she hasn't helped with the bills because she isn't comfortable, \n\nBut yet comfortable enough to live with you and have you cook for her? If I was worried about someone mishandling my money, they would likely mishandle my food as well. Odd excuse.\n\n> [fib](#comment_70_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): and said I must ask her if I want something from her because she will not know nor will she think of ways to help\n\nYes... having a responsibility of paying your own bills, cleaning up your own house, doing your own chores, managing your own pets, is a hard life for any adult. No wonder there are so many of them who haven't learn the basic expectations of independent living and have found clever ways for others to do these tasks for them.\n\nFrom what I understand of the situation is she likely lived with someone who took care of her the same way you are now because that is her life and her expectations of what is to be contributed to her relationships. This is not all on her though as you have accepted her in these conditions.\n\nIt reminds me of an old saying that I often tell myself. \"We humans are free to gladly serve (and attempt to help) others in our own heavens, or happily forcefully rule over others in our own hell. But your happiness is what you make of it.\"",
				"added": 1578682371
			},
			{
				"comment_id": 33,
				"body": "> [fib](#comment_74_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK): I'm going to miss that woman, even if she is a pain in the ass.\n\nYou're going to have to keep loving yourself before you are able to find someone who loves you for you rather than what you can give or do for them.",
				"added": 1578843364
			}
		],
		"1578583385_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 15,
				"body": "Somebody has to render a supply of obedient young girls to wealthy American & British politicians.",
				"added": 1578585348
			}
		],
		"1578573647_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 17,
				"body": "> [gitcenter](#comment_1204_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di):  there aren't many active users on ZeroTalk unfortunately.\n\nI give month long mutes because I would rather see weeks upon weeks of silence rather than spams of \"Nigger Nigger Nigger! Can I get a nigger to help me set up my \"Why I hate Niggers!\" blog that I plan to abandon in a week! Nigger Please?!?\"",
				"added": 1578608270
			},
			{
				"comment_id": 30,
				"body": "> [z0net](#comment_4_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS): How do you mute this user on ZeroTalk?\n\nZeroWiki: [Muting a zeronet user](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:mute)\n\nEven trolls have a place for them on Zeronet, but that doesn't mean you must be forced to witness it.",
				"added": 1578760226
			}
		],
		"1578622228_1Hrz1rynf2scp9MZ7Abt6FfRgUMCmZ8H2v": [
			{
				"comment_id": 18,
				"body": "He backed down because that is what a Strong American Leader, does.",
				"added": 1578623266
			}
		],
		"1578621444_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 19,
				"body": "One of the reasons as to why I enjoy Zeronet is because it is a network that is made available by technically inclined users who are either willing to stand by the material they share or those who are untraceable with tor. It creates an atmosphere that makes every copyright enthusiasts treat the network as the entity that 'Shall never be given a name.'\n\nHence why this (or any other censorship resistant platform or networks) will never go mainstream because it is obvious as to who controls those mainstream channels.",
				"added": 1578623791
			}
		],
		"1578677853_14giYM2ws7rPBNTE8o9j8QSpkNTPXPUPiE": [
			{
				"comment_id": 20,
				"body": "The US spent decades being a bully to smaller nations while letting the larger ones establish their foothold as global leaders. How are they going to sanction their way out of this one?",
				"added": 1578678374
			}
		],
		"1578677811_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 21,
				"body": "Am I really the one ones who believe that x4 US Predator drones are able to strike with pinpoint accuracy yet Iran missiles not only 'take down the wrong plane' but are unable to land any solid strikes on the targeted US/Iraq military base.\n\nThis situation reminds me of the Stuxnet tactic all over again. Finish the war before it even has a chance to begin with the subtle use of subversion. Just imagine how many leading Iran Nuclear physicists were tried as spies for the equipment destruction at the Iran Uranium enrichment facilities that could not be explained. (It must have been the wind and a .002 input variance inaccuracy that caused those strike missiles to miss...  Don't make your enemy doubt your abilities when they can doubt their own.",
				"added": 1578679187
			},
			{
				"comment_id": 23,
				"body": "I believe this is all just a distraction for the upcoming US election season. There was so much attention of Russia & China attempting to surpass US power status and while very little can be done on that front, a new distraction of a lesser formidable foe such as Iran takes center stage in media & politics. Because the US 'Came, Saw, and the Iran Generals died' while they couldn't even properly retaliate. \"Look how strong and united the American Nation is! Trump for 2020!.\"\n\nBecause that scenario would be far more beneficial for the preservation of the status-quo rather than American citizens uniting behind a more progressive candidate such as Bernie Sanders which would only continue to expose how little of a Democracy is really left in the US.",
				"added": 1578682971
			},
			{
				"comment_id": 24,
				"body": "> [draugrdeathlord](#comment_344_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Sanders could never win, he's not in the club.\n\nBesides the point, if the majority of Americans vote for him and he still lost, it would just cause that many more people to wake up. Not a stable or beneficial situation for a nation that may be on the verge of multiple military & trade wars.",
				"added": 1578683093
			},
			{
				"comment_id": 25,
				"body": "Also The Great Hack explains the social engineering aspect of it.",
				"added": 1578683616
			},
			{
				"comment_id": 28,
				"body": "> [draugrdeathlord](#comment_349_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Now I want to know even more !!\n\ntorrentfreak News site, i was once an avid poster there before i had to ghost because I had a fleet of volunteer copyright trolls censoring anything I touched.",
				"added": 1578684551
			},
			{
				"comment_id": 29,
				"body": "> [draugrdeathlord](#comment_350_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Wtf ! Ugh copyright has fucked up everything\n\nThat's not even the surface of it. For example, some of those documentaries I share only have around 5k views on youtube despite being published multiple years ago and being quite good videos. Is there such a lack of interest to render such low numbers? Nay, I suspect it is Google pushing their bias views in the disinformation of Americans to avoid political descent.\n\nThe same way with deceptive naming. When doing a title search how is anyone going to know that a film like \"The Great Hack\" (while being locked behind a paywall) is about the interference of elections though targeted political messaging.\n\nI'm not even a fan of the guy but another example that is when Alex Jones got deplatformed because he was discussing political views that both US parties were agreeing on. The reason of him causing emotional trama by saying some really stupid shit about some horrible incident had little to do with it. If nobody noticed, Trump says really stupid offensive shit almost daily as well and he has still yet to be deplatformed.\n\nThe agenda is there, and you'll become a target when you begin to make waves.",
				"added": 1578685224
			}
		],
		"1578738929_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 31,
				"body": "Much of it is budgeting as the energy drinks & soda will often cost more than the price of a decent meal. It's like trying to eat healthy when the largest portion of the budget goes to cigarettes. But life's simple pleasures I guess.",
				"added": 1578770979
			}
		],
		"1578817237_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": [
			{
				"comment_id": 32,
				"body": "Well cooked meats are important. I never understood why people enjoy their meat rare. Many parasites can be avoided by proper food preparations.",
				"added": 1578843109
			},
			{
				"comment_id": 48,
				"body": "> [cynyc](#comment_11_1DZMEripELi5Ewz34FYwP1LdGyo5jEgbG5): No sane person eats pork or chicken rare, beef is different. Although this whole story is a Chinese Propaganda hoax\n\nNo.. you're just too daft to realise that food preprared at restaurants or take-outs are often rushed or prepared by amateur cooks or just employees who don't care or have a bad day. Meanwhile, you'll be here making comments as if matters such as 'food poisoning' is a rare occurrence.",
				"added": 1579231635
			}
		],
		"1578854998_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 34,
				"body": "The FBI owns & distributes 90% of the worlds child nudity while crime rings trade young girls for the sale of millionaire clients. Bums or the working middle class are not the ones seeking such services. Meanwhile, Epstein's mistress & recruiter Ghislaine Maxwell, can't be touched.\n\nEven Bill Clinton enjoyed numerous flights to the islands.",
				"added": 1578855318
			}
		],
		"1578899506_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 35,
				"body": "> [robione](#comment_401_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX): Who are we to think we know what the normal parameters for the planet are? \n\nWell one thing is for sure. No where in the planet's history was there so much nuclear waste 'naturally'  produced.  But I'm not complaining, I'm entirely for the next extinction level event because humanity is but a pestilence on this planet.",
				"added": 1578936739
			},
			{
				"comment_id": 37,
				"body": "There should be no question that the planet is warming, while it is a natural cycle it has also been accelerated by industrial activity similar to multiple volcanic eruptions occurring. Ultimately, the planet's polar caps will continue to melt as we near closer to the end of this Ice Age. (The age in which the planet had a portion of it's surface as ice).\n\nThe real question should be, is humanity as a whole taking the steps that will be needed to prepare themselves for their existence in such a new and potentially hostile environment.",
				"added": 1578944453
			}
		],
		"1578888717_144CwRj8eynTUC9DtGHaNHR3wm9P2EhuAY": [
			{
				"comment_id": 36,
				"body": "If it was that easy to steal your bike, imagine how easy it would be to steal your girl!",
				"added": 1578937023
			}
		],
		"1578862459_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 38,
				"body": "> [draugrdeathlord](#comment_389_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): You can't have social programs going to people who never paid into the funding for them\n\nThat's exactly what a socialist program does. When a child with special needs is born and that mother is given additional assistance for that child. should that child be disqualified because \"You can't have social programs going to people who never paid into the funding for them\"?\n\nDid taxing Amazon, Google, Walmart, JP Morgan, Chase, and all the other companies who depend on tax havens ever work it's way into your equation?",
				"added": 1578965534
			},
			{
				"comment_id": 39,
				"body": "Also, as an American my vote is with Bernie as I would rather have my college debts wiped free rather than 1k a month UBI. 1k a month is just enough to cover rent in the US let alone any other expenses like food, utility, and any medical expenses. Meanwhile the rates of homelessness and unemployment will continue to rise as average rent is increased to $2k a month instead of $1k.",
				"added": 1578966099
			}
		],
		"1578995205_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 40,
				"body": "Where I live, Amazon employees are given $12 an hour to fold boxes as automation takes care of the rest.\nOf course they will get fired & rotated before the three month mark before federal benefits requirements kick in.",
				"added": 1579014108
			}
		],
		"1579109122_15iDa4DKRDbUJY12ZoJSfZczbAtMSmNrn2": [
			{
				"comment_id": 41,
				"body": "Most potatoes are salted before it is turned into hash.",
				"added": 1579111299
			}
		],
		"1579175074_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 42,
				"body": "If humanity can't save ourselves, why would some extraterrestrial do it for us? And will it be by force considering humanity will never do anything that they are told.\n\nGood thing to know that humanity is in the clear with that fast approaching extinction level event. If it is not the aliens here to save the human race, it will be God!\n\nNow pardon me, I have a pile of old tires that finally needs burning.",
				"added": 1579187049
			}
		],
		"1579155770_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 43,
				"body": "I only reward Youtube's AI when it treats me with intellectually valuable material. And I have to admit, when using a premium account, it really really wants my likes. \n\nSo much so that the US agenda of disinformation begins to ever so slightly vanish.",
				"added": 1579187502
			}
		],
		"1579175552_16CaQCGzgekVdZA9NiJkDe58QMCZPSU1ic": [],
		"1579209588_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 45,
				"body": "Zeronet command line parameters and config file variables as of rev3864\n\n[/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:args](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:args)",
				"added": 1579209745
			},
			{
				"comment_id": 46,
				"body": "> [draugrdeathlord](#comment_435_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): I found a few commands I'm going to add later\n\nI added the info into a table so the eye rape wasn't so bad and added the main arguments from the rev4937 link.",
				"added": 1579223319
			},
			{
				"comment_id": 47,
				"body": "> [draugrdeathlord](#comment_443_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC): Very nice\n\nThanks, Action arguments are updated as well.",
				"added": 1579226421
			}
		],
		"1579216230_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 49,
				"body": "zeronet needs a fail2ban option for the webUi login ",
				"added": 1579281038
			}
		],
		"1579301889_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 50,
				"body": "The problem with public proxies is that while the ones that are ran off of cheap server hardware is enough to handle a private portal or maybe 5 concurrent users, but any more and the client will begin to slow as seen with 0net.io proxy. Of course the remedy to this is more expensive server space, but expect to foot that cost yourself as nobody is willing to donate to zeronet public proxy admins and implementing a miner gate to cover some visitor usage is frowned upon. (Because most clear net users expect free or want to use their personal details as a form of browsing compensation.)\n\nI pay $5 a month for my server space which is enough to provide a private portal plus space to seed documentaries, but that's about it. It would crash & burn if it was opened up for public usage.",
				"added": 1579360682
			}
		],
		"1579335332_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": [
			{
				"comment_id": 51,
				"body": "I agree",
				"added": 1579362447
			}
		],
		"1579306799_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 52,
				"body": "I would say it would be more hassle than it is worth. While the settings file can be loaded as client specific, if the clients are sharing the same /data/ location, it means each client is going to also share the same users, sites, and cert, json files which will mean a syncing nightmare.\n\nI'm not a developer of zeronet but I'm pretty sure it was not meant to be ran in such a fashion. It would be more beneficial to just have smaller independent zeronet clients that serve special purposes. Like a node just for social media, and another just for seeding larger files, etc.",
				"added": 1579363283
			}
		],
		"1579445364_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W": [
			{
				"comment_id": 53,
				"body": "Much like on The Pirate Bay, there is no way to help those who release media but then decide not to seed it for others who may show interest. Everyone wants to be a hit & run and that causes unseeded content. If you want to find some working titles, check out the documentaries uploaded by [htgozn](/big.kopykate.bit/?Channel=htgozn@zeroid.bit), [htgozn2](/big.kopykate.bit/?Channel=htgozn2@zeroid.bit), and [htgozn Workout Music](/12MVkvYGcRW6u2NYbpfwVad1oQeyG4s9Er/index.html?view:channel+id:15f3_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2) as the material is well seeded.\n\nSome people use Zeronet as a means to protect their communication, while others come to this network strictly looking for free shit.",
				"added": 1579447295
			},
			{
				"comment_id": 54,
				"body": "> [blahblah69](#comment_24_1ErPX9yuZjokdcxUGavdRYRhwynA4j8d6q): i mean with laws constantly changing one could be charged and prosecuted for dam near anything these days, from hate speech to copyrighted or illegal content. [...] However its a tricky process to balance freedom of speech or expression against what governments and law enforcement consider appropriate.\n\nEmphasis on this as you can be imprisoned for the most minor of reasons. So we can either choose to Live for something, or Die for nothing.\n\n> [progi](#comment_14_17KQehVm2u5r4GAjqkC3jRcxepzK6ri51W): on The Pirate Bay or torrenting have no problems.\n\nSharing files on Zeronet is not torrenting, it should not be compared as such. I mentioned TPB because we were discussing seeding. No media will ever be distributed if people are not willing to keep their PCs online and zeronet client running to share the media to other people when there is a lack of a central server. Any decentralised technology will face this obstacle and the easiest way to fix it is with popularity.\n\nA bit of a dilemma when Zeronet provides a space for activity without judgement in a world where the mainstream News outlets are controlled by a handful of billion dollar and euro companies.",
				"added": 1579449583
			},
			{
				"comment_id": 65,
				"body": "Also a main problem is people forget to ['PIN'](/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Files) their smaller files so that their client doesn't auto remove them over time.",
				"added": 1579640863
			}
		],
		"1579444197_1GGwcwi7tW4RZaAfG3xPR4JpoNE4AkvrgC": [
			{
				"comment_id": 55,
				"body": "It seems to work great for mp3s",
				"added": 1579450121
			},
			{
				"comment_id": 62,
				"body": "IFS is a website on the Zeronet network. IPFS is a network protocol used by some websites / clients to provide access to other content hosted on IPFS technology.",
				"added": 1579619676
			}
		],
		"1579404185_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 56,
				"body": "Taxation will only vanish in a state of anarchy. Otherwise there is going to be some entity being government or private taking a tax or a fee on some good or service.\n\nThe largest concern should be is the tax imposed on those who can afford it, or those who can't. In this society, the ones who accumulate the most wealth, also happen to contribute the least to any taxation. \n\nSo it should be of no wonder that the 'average Joe' despise the act. I wonder if these same individuals also plan to ever benefit from social programs like retirement, or medical coverage and plan to be able to pay for their consumption habits for the entirety of their life.",
				"added": 1579450736
			},
			{
				"comment_id": 57,
				"body": "> [robinofdeath](#comment_28_1367VTupfj886Uk39iT4RjiSmrakiDYTga):  the middle class gets fucked the worst. theyre the highest priority targets cos theres lots of them and they have money for the taking.\n\nI agree, there's even a video that breaks it all down. \nYoutube: [Who pays the lowest taxes in the US?](https://youtu.be/kXCGbAv8YPw)\n\nIt would make sense though as the upper class can afford expensive accountants to assist with their tax avoidance while those who reside on the other far end of the scale simply have nothing to take.\n\nThe only logical value remaining is the middle class... and that's just by using the process of eliminations.",
				"added": 1579533878
			}
		],
		"1579517170_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 58,
				"body": "I think this is by design. It is easier to make the best seller of 2020 when there is nothing of quality to compare to it for the past three years.",
				"added": 1579533983
			}
		],
		"1579514127_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 59,
				"body": "Most mechanics will use instructional Youtube videos to help find a solution to a problem on a piece of machinery they haven't worked with before.\n\nI wonder if they carry a guilty conscious for 'Not being the best mechanic they can be' when they are cashing their paychecks. But in my opinion, no normal user would be able to understand the terminology or procedures given to arrive at said solution in the first place, as it is often another skilled mechanic creating the video and providing the advice. \n\n",
				"added": 1579534458
			}
		],
		"1579602906_1JH7GXsReuXYWoJKuREooRvjbWP15sMN2N": [
			{
				"comment_id": 60,
				"body": "There's even a website that let's you monitor & access the Internet of Things",
				"added": 1579619072
			}
		],
		"1579598887_1DnpB2yFpVwyhA29h2rRsifGVEC1sXLzgJ": [
			{
				"comment_id": 61,
				"body": "Typical, people move to some country in an attempt to seek asylum. Country turns around and uses that person as a bargaining chip.",
				"added": 1579619164
			}
		],
		"1579592713_1KFinwDQzcA4q9xzdLRgmZuTDNwz5JSFyY": [],
		"1579558261_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 64,
				"body": "I had the similar problems ordering replacement batteries for my older model smartphone. It was off of Amazon, it was pretty much a reskin of an old/used battery.",
				"added": 1579620758
			}
		],
		"1579733691_1KMFhezc9fqBCbWg8xbu6HimdG5nMSQwBD": [
			{
				"comment_id": 66,
				"body": "ZeroTalk is not 90% of zeronet, farewell hit & run, you won't be missed.",
				"added": 1579744722
			}
		],
		"1579728135_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 67,
				"body": "The extra energy boost is the Loads of B-6 & B-12 that energy drinks are loaded with. It should be a sign that it is more than just caffeine that you are addicted to.  It is the same reason people will crave cigarettes when using nicotine substitutes. It's the 'legal' additives that has purposely enhanced the addiction.",
				"added": 1579744940
			}
		],
		"1579777420_1JYGp4onxvJxFQovjVFrxjC4hpSSDzXEzi": [
			{
				"comment_id": 68,
				"body": "Have you tried selling knock off DVD screeners to local convenience / gas shops.",
				"added": 1579793802
			}
		],
		"1579748438_1JYGp4onxvJxFQovjVFrxjC4hpSSDzXEzi": [
			{
				"comment_id": 69,
				"body": "How about a reddit prostitute as your repetition skills seem top notch.",
				"added": 1579795808
			}
		],
		"1580063953_14waGGyqPBKFdRMxWBKAtg4Ux1b8a16QbK": [
			{
				"comment_id": 70,
				"body": "Unlikely to happen as your client is able to connect to other clients that have the bootstrapper plugin enabled.\n\nIt practically saying your ISP will be able to instantly detect & block any potential PC that I install Zeronet on and communicates with your client to propagate peers. I can read your message from 8 minutes ago just fine so it seems those blocks if any are not being very effective. This is even before bringing TOR into the mix.",
				"added": 1580064636
			}
		],
		"1580122330_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 71,
				"body": "> [meepmeeper](#comment_1_1DVZqsT3TLDkT7rcePuzPG1E7NJ3N9cX72): but i'm not sure how to restrict to a list of certain zites.\n\n--multiuser_no_new_sites    -   \tDenies adding new sites by normal users\n[Zeronet command line & setting arguments on ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:args)",
				"added": 1580138121
			}
		],
		"1580247379_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS": [
			{
				"comment_id": 72,
				"body": "I would highly recommend setting up Fail2Ban ([clearnet link](https://www.techrepublic.com/article/how-to-install-fail2ban-on-ubuntu-server-18-04/)) on the Zeronet server to help protect against the inherent flaws of persistent SSH brute force attacks.",
				"added": 1580249028
			}
		],
		"1580335642_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": [
			{
				"comment_id": 73,
				"body": "I agree that all buttons are way too dark.\n\nWhy not add \n```\n  border: 1px solid;\n  color: red;\n```",
				"added": 1580349336
			},
			{
				"comment_id": 74,
				"body": "> [labor](#comment_2_1BtohSFtgv5SNQ4i6Gu7ox5cYttW8Jkoxk):  What people fear is the illegal porn. \n\nWhat scared poor pitiful souls. \n- If they aren't scared of the illegal porn, it will be the xenophobia and racism.\n- If it's not the xenophobia it will be the copyright infringement. \n- If it's not the copyright infringement it will be the government secrets.\n- If it's not the government secrets, it will be the 'legal' porn.\n\nThe point of the story is people need to learn how to grow a damn backbone otherwise they should learn to be happy with their enslavement as they constantly depend on the decisions of others to keeping them 'safe from harm'.",
				"added": 1580398350
			},
			{
				"comment_id": 75,
				"body": "> [styromaniac](#comment_1773_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I didn't say that,\n\nWhoops, sorry mate, I didn't notice that the reply quoted the wrong highlight. It wasn't on purpsoe",
				"added": 1580398867
			},
			{
				"comment_id": 78,
				"body": "So here's something interesting that I noticed yesterday.\n\n[1580066784-Louis Rossmann and Right to Repair.mp4](/big.kopykate.bit/?Video=1580066784_1Fza2SFyqmiLLUc99fACNkDNPQ7k4V3935) Size: 32.43 MB Uploaded: 3.4 GB\n•••••\nFrom: Jan 26 to Jan 31\n3.4*1024 = (3481.6 MB / 32.42 MB) = 107.3 copies uploaded of a file that is shared with 8 other peers.\n\nAttack attempt or popularity spike? :)",
				"added": 1580590038
			},
			{
				"comment_id": 80,
				"body": "> [qqstejgk77rtkats](#comment_17_15jw9ZPqZMYeM13banimWKeyYD3KnRUgwi): Don't know if SciHub would fit on a drive that size\n\nScihub/Libgen is at 33 terabyte",
				"added": 1580703050
			}
		],
		"1580493730_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 76,
				"body": "Once your assigned publish limit reaches the max file size allowed, signing no longer becomes an option rendering any orphaned files frozen in time.",
				"added": 1580522450
			},
			{
				"comment_id": 77,
				"body": "> [styromaniac](#comment_1778_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): Wow. That's not good.\n\nSimilar to nofish being the only one able to up the limit on Zerotalk, quantumkitty is the only one who can up user limits. Of course the solution to this is to just make another account and discard the old user ID which will also  ensure upload permanency as the original uploader couldn't remove the files even if they wanted to or were forced to. \n\nBut yeah, disaster for orphaned files.",
				"added": 1580523389
			}
		],
		"1580289800_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 81,
				"body": "Peace of the World? No sir! There will be no rest for the majority of wicked. Maybe it is time for the world to bow down to the CCP interests now that decades have been spent in practice bowing down to US interests.",
				"added": 1580828446
			},
			{
				"comment_id": 92,
				"body": "During the time when Mexico was experiencing outbreaks of Yellow Fever, it was clearly obvious that the US and Mexican government was attempting to use the illness as a means of bio-warfare by providing vaccinations exclusively to communities of wealth that were near political areas while refusing to provide access to vaccinations for those who were impoverished or were known El Chapo supporters.\n\nEl Chapo and his militants remedied this by kidnapping medical staffers and under the pretense of physical harm, forcing them to distribute the vaccine to members, sympathizers, and other who were impoverished to prevent an outbreak within their community and the collapse of the resources and supply chains  of the resistance.",
				"added": 1581694488
			}
		],
		"1580849186_1Ev2p6pn33TkPNNrMbNFwSspPzivpKaTKD": [
			{
				"comment_id": 82,
				"body": "> [rannulfr](#comment_33_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51): Check out IFS. It does Video well\n\nI was thinking of porting my video uploads from KopyKate to IFS but I would keep getting instances where the download would refuse to complete so I abandoned the idea.",
				"added": 1580877009
			}
		],
		"1580901933_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": [
			{
				"comment_id": 83,
				"body": "> [aassddff](#comment_26_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Hopefully people will be able to see it somehow.\n\nSome advice when uploading to KopyKate.\n\n - Keep your files seeded with an always online client. It's your stuff, don't expect others to seed it for you. And even if they are interested, if there are no seeds online to upload it to them at that moment, they will chalk the user as another failed uploader which will result in more unseeded content.\n\n - After publishing the file, don't forget to go to your [FILES](/1HeLLo4uzjaLetFx6NH3PMwFP3qbRbTf3D/?Files) tab on ZeroHello and tick the uploaded file and PIN it to ensure the file's persistence so that your client will not auto remove it over time.\n\n - A very large percentage of users who visit KopyKate do so with their mobile device. Storage space and bandwidth matter for these small devices and they are often used by people who live in not so developed areas and likely suffer from slower bandwidth speeds. Be considerate about this. The smaller you can make the file while preserving decent quality the better. You'll save local space, viewers will save their space, and your file will be more easily to distribute. Re-encoding a file is a pain, but it's worth it as nobody is coming to Zeronet to find 4k video.\n\n - Provide good thumbnails, descriptive title for ease of search, and short description. This will attract viewer interests and maybe even someone who's is willing & has space to seed your files with you.\n\n - Make your uploads count. Each user on KopyKate has a hard coded upload limit due to a size limitation of their users.json and data.json files on the site. Once this limit has been reached you won't be able to sign the file anymore meaning no more deletes, edits, or uploads under that username.\n\nHope that helps\n\n> [aassddff](#comment_23_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Now two people have told me they can't see newer videos either.\n\nOne of Zeronet's flaws is it has sync problems in that. An update is pushed, site updates. (second later) someone else uploads a video (publishes an update) and even though their change did propagate the network, the previous update was still being processed by that node and the latest update was never processed on that node.\n\nA remedy is to preform a manual Update / Check files which will update the files for that peer / user and populate their videos with the rest.\n",
				"added": 1580918812
			}
		],
		"1580925973_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 84,
				"body": "As moor stated, you can create a dedicated music channel on IFS to share music.\n\nA word of advice, use something like [mp3tag](www.mp3tag.de/en) to help normalize filenames  of any ! and & characters as it will cause the file to error out and fail to be seeded. (there are likely more invalid characters that are allowed, but those two are the most common.",
				"added": 1580935995
			},
			{
				"comment_id": 85,
				"body": "Oh, don't forget to PIN any files that you share. Small files are not auto-pinned by default and your client will end up auto-deleting them after some time / seed count / ratio trigger.\n\nThey are found under the IFS Cluster you selected.",
				"added": 1580938533
			}
		],
		"1581151955_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": [],
		"1581330554_19WWfebCWifDRTKiapRbErUjEpDDY7s8Bs": [
			{
				"comment_id": 88,
				"body": "There is a command line parameter that can be used to open a specific browser on Zeronet launch\n\n--open_browser [NAME] \tOpen homepage in web browser automatically \t\n\nThis way zeronet will launch the browser of your choice while leaving your default set browser unchanged.",
				"added": 1581352042
			}
		],
		"1581384962_1FmC53ZDqp15korLaKkB5XENMJguuxrzLT": [
			{
				"comment_id": 89,
				"body": "[How to Install and run Zeronet on any Linux server like Raspberry Pi ,zeronet seedbox, public proxy](/16Go5kc2U9Ff4jeaY8kYiDEgpMYdgyboPY/?Topic:2_1L4dZcDF2maSKHDy788yhxpYnBWnXadUtS/How+to+Install+and+run+Zeronet+on+a+Raspberry+Pi+or+any+Linux+computer)",
				"added": 1581387990
			}
		],
		"1581518987_12V9AjYgcFFTD5rF89JUNqYcQTm2knBnq4": [
			{
				"comment_id": 90,
				"body": "In the ancient age, it was women who were considered to be great rulers and labeled as goddesses. It's why many of the old god names are feminine names.  They were seen as the bringers of life while as men stood 'erect' to the heavens whenever we came in the mere presence of their images.",
				"added": 1581519842
			},
			{
				"comment_id": 91,
				"body": "> [aassddff](#comment_46_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS): Am I feminist enough yet?\n\nMaybe not feminist, but surely a Jeffery Epstein.",
				"added": 1581527088
			}
		],
		"1581695503_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 93,
				"body": "If you are watching a youtuber who has a game channel, it is very likely that he uses his 'new high-end' pc for not only gaming, but also for editing his videos which is his profession meaning he would consider the video editing and publishing as 'serious work too'\n\nMillennials know little of privacy because it is in the corporate interests to withhold that civil liberty. And upon a closer examination, a 'right to privacy', is not the only civil liberty that was lost in the transition to the digital era.\n\nIt is comparable to the US youth not being concerned with US wartime because they spent the entirety of their young life in a state of wartime. A person can not desire something they have never experienced such as a decade of peace or a right to digital privacy.",
				"added": 1581695934
			}
		],
		"1582197021_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 94,
				"body": "Source? Surly you didn't do all of that 'research' without taking notes of at least a few references?",
				"added": 1582298923
			}
		],
		"1564701974_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": [
			{
				"comment_id": 95,
				"body": "> [styromaniac](#comment_815_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd): I can combine multiple lists and have duplicates removed. [...] So, if you know a good or constantly updated list, then let me know. Duplicates won't matter.\n\nhttps://newtrackon.com/list - List of stable trackers",
				"added": 1582299226
			}
		],
		"1582366551_17AMQVbBa12XB3xFWKDnP2dCEx92TaiY7X": [
			{
				"comment_id": 96,
				"body": "The internet of today should be called the web of broken links, as anything that is relatively informative and has the ability to challenge the status quo has been falsely DMCA'ed into obscurity.\n\nTry to search for important News articles that was published 10 years ago. Search engines act like the internet didn't exist in 2010 just as the US housing crash never happened in 2007.",
				"added": 1582383170
			}
		],
		"1582025950_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": [
			{
				"comment_id": 97,
				"body": "The open clearnet is like facebook, anything remotely informative has been placed behind some restrictive login or paywall while all the rest has been labeled as rampant acts of piracy and deemed worthy of removal. Even the memes are not an exception.",
				"added": 1582383520
			}
		],
		"1581933903_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": [
			{
				"comment_id": 98,
				"body": "Triple-A gaming is a waste of time & hardware. ",
				"added": 1582383790
			},
			{
				"comment_id": 100,
				"body": "In my opinion, VM is just a way to waste resource. Why not just use a dual boot system to allow complete game optimization while performing non-gaming activities on a non-gaming operating system.",
				"added": 1582644102
			},
			{
				"comment_id": 101,
				"body": "> [broo49664](#comment_5_1BRxJEa4TJ3hk6KcGHYFTGjAb81Vxz2RW3): if while gaming I want to check something unrelated, I end up browsing on a compromised system.\n\nI doubt you would have the need to look up otherwise sensitive material while you are gaming. Most people who I know need to 'look up something unrelated' while mid-gaming often have the habit of using their mobile device as to not interrupt their gameplay.",
				"added": 1582731112
			},
			{
				"comment_id": 102,
				"body": "> [hagen](#comment_2_175PgC2m3jvdQtCdbDtSztPWbgeDguuuNX): Any intelligent [...] person should avoid wasting his or her time with such garbage.\n\nThe same consideration should be given to mainstream television broadcasting.",
				"added": 1582989081
			},
			{
				"comment_id": 103,
				"body": "> [mazanand197609](#comment_1_1Bvfk1BPqEgWdVnhwbVajWgTMyc7j2iMSD): I think computer video games are a great way to sharpen mind.\n\nFor a society that seems to express little control concerning their own downfall and extensive suffering, would give me reason to pause before granting a label of having a  'sharpened mind'.",
				"added": 1583076422
			}
		],
		"1582500655_12GAPJTRmNmDZKBXc1419vhTW4WpPujNuq": [
			{
				"comment_id": 99,
				"body": "It's a bit out of date, but there is page:blocklists on [ZeroWiki](/138R53t3ZW7KDfSfxVpWUsMXgwUnsDNXLP/?Page:blocklists)",
				"added": 1582559337
			}
		],
		"1583563665_1G9k2b4cSRzZSfLQuzxmpJB3LT3GfgTQUQ": [
			{
				"comment_id": 104,
				"body": "And here I thought that climate change was to forever carry the label of being the 'biggest haox of our lifetime\"...",
				"added": 1583596225
			}
		],
		"1584141897_18YbbFYMzM2PLZwPLddxGqRsjbBFHLFhid": [
			{
				"comment_id": 105,
				"body": "If you are not old or injured there is nothing to worry about. \n\nStrange, a little cough comes around and next thing you know countries want to turn into Soviet Russia with bounties of 'socialism'. I say be a proud capitalist. If people want to stay corona free, let them buy their health. \n\nThe remedy can soon be found in the Cold, Flu, & Corona Isle for $79.98 for the 'UN-Corona Complete' package. (Owned by Bayer)",
				"added": 1584194477
			},
			{
				"comment_id": 106,
				"body": "Maybe the planet is attempting to rid itself of the current over infestation of stupid. I suppose it is natural for the stupid to  resist.",
				"added": 1584196503
			},
			{
				"comment_id": 110,
				"body": "> [z0z0z0z0z0z0z0z0](#comment_81_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA): First cases in Africa the entertainment isn't even start yet. \n\nJohns Hopkins University & Medicine - Coronavirus Resource Center -  Live Tracking Map\nhttps://coronavirus.jhu.edu/map.html",
				"added": 1584381529
			}
		],
		"1584244208_1Jgu3kQaBojGnFj82E6Gd3tsyAsKCk5SX6": [
			{
				"comment_id": 107,
				"body": "I have my stats & peerdb plugins disabled just to prevent the discovery of such info in case my zeronet proxy is ever compromised.",
				"added": 1584283709
			}
		],
		"1584271096_1Ju57vNLWKmKJrp3DMy6W39Aq5pz9UUdcY": [
			{
				"comment_id": 108,
				"body": "Be aware that ZeroUp Unlimited vs ZeroUp does not have a search feature.\n\nYou will be regretting the exclusion once the site becomes populated and unsearchable.",
				"added": 1584292330
			},
			{
				"comment_id": 109,
				"body": "> [geekless](#comment_148_1GooUE19488nDwG3TdkM8seYAHct4gjkq4): Everyone complains about missing features, \n\nI wasn't complaining, I was stating a fact.\n\n> but nobody writes the code.\n\nMy skill is in C, not Python, CSS, Javascript, and HTML. . I'm not trying to clone ZeroUp, so I'm not going to learn how to clone it.\n\nPS, other people can contribute in vastly different ways rather than sole contribution of code such as guides, and even exotic media. Nobody would visit IFS or KopyKate if there was nothing on it.",
				"added": 1584292823
			}
		],
		"1584527258_1HeEWnYs69J1BV4P4niDN775yBVqNijhjG": [
			{
				"comment_id": 111,
				"body": "The populous of the planet has been complaining about dwindling resources with no concern over population growth for a long time now. \n\nBe thankful, I hear there are some great deals on some prime real estate that has recently opened up.\n\n> [thorburn](#comment_38_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): stop paying attention to the bs in the media.\n\nJohn's Hobkins University seems to agree with those numbers. https://coronavirus.jhu.edu/map.html",
				"added": 1584540447
			},
			{
				"comment_id": 112,
				"body": "> [epistemic](#comment_2_1GLrPVFs91nhs2HYnxZj8BXL8pYSdKNu4L): The recovery rate is 97% and the most common cause of death is pneumonia related.\n\nDon't forget those lost due to supply shortages due to panic-buying. Supplies that could have been used to prevent the common side infections that occur during the outbreak and by those providing treatment.\n\nIt becomes difficult to perform routine medical procedures when gloves, facemasks, and antiseptics are in short supply. Mortality rates are bound to rise due to said knock-on effects.\n\nHere's a nice documentary to go with CDV19 for those who are not interested in Contagion.\n\n [The Invisible Enemy: Deadly Pathogens and Big Pharma, 2018](/big.kopykate.bit/?Video=1581867197_1Fza2SFyqmiLLUc99fACNkDNPQ7k4V3935)",
				"added": 1584730556
			}
		],
		"1584744394_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 114,
				"body": "> [xcape2net](#comment_706_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The number of reported coronavirus cases is doubling about every two days in the US\n\nYou should keep a more accurate log. I check [this site](https://coronavirus.jhu.edu/map.html) every morning. The worst of the outbreak is in NY, and it is far from 'doubling every two days'...\n\nIt is a rare time to see the busiest streets of NY as being empty, Film artists should capture some footage.\n\nHere, let me be of an assist.\n3//21/2020, 12:13:44 PM: US: 22,043\n\n",
				"added": 1584812332
			},
			{
				"comment_id": 117,
				"body": "https://coronavirus.jhu.edu/map.html Show the US has taken first place for most infected nation. The order is incorrect.\n\n3/26/2020, 4:37:36 PM\n 82,404 US\n 81,782  China\n 80,589  Italy\n\n[Panic ensues](/big.kopykate.bit/?Video=1585343100_1Fza2SFyqmiLLUc99fACNkDNPQ7k4V3935)",
				"added": 1585259789
			}
		],
		"1584885429_1LnUZ9Csee6oXiuNsZXXWvtBTeT3qHFT4y": [
			{
				"comment_id": 115,
				"body": "Use Peername as suggested as .bit domains have been deprecated and are highly susceptible to domain name hijacking upon registration expire.",
				"added": 1584893906
			}
		],
		"1585234073_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": [
			{
				"comment_id": 116,
				"body": "> [xcape2net](#comment_710_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz):  I don't understand the second group. How can people completely ignore this whole situation?\n\nLikely the same way they have been ignoring the melting of the polar ice caps for the past 20+ years. I have watched some interesting Videos that discuss the many Great Filters of Life and why we don't meet intelligent aliens with so many potentially life sustaining planets.\n\nThe true test of being an 'intellect'.",
				"added": 1585243148
			},
			{
				"comment_id": 118,
				"body": "> [thorburn](#comment_41_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): @ranshit do you have any evidence to support the BS aliens (presuming you're referring to the so called extra terrestrial variety), and while you're at it some proof these so called life sustaining planets would be interesting?\n\nFeel free to do a search to educate yourself, I have nothing to prove to someone who believes it is mathematically possible for Planet Earth to be the only inhabitable planet with sentient life as to being the center of the visible universe.\n\n> Where are the piles of corpses predicted by the number crunchers from other ZN fear threads, \n\nIn the US, hospitals are already having to bring out tractor trailers to load & transport the dead away from the hospital, and there is still six weeks to go.",
				"added": 1585322022
			},
			{
				"comment_id": 119,
				"body": "> [thorburn](#comment_43_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): Where is the evidence that they are having to use tractor trailers to haul the dead away? [...] they require for their human farm.\n\nhttps://youtu.be/igC9X1k8rUA?t=121 @ timestamp 2:20\nCOVID-19 is comparable to climate change in that refusal to acknowledge the importance of it will not halt it.",
				"added": 1585328272
			},
			{
				"comment_id": 120,
				"body": "Most people will die from a lack of room / supplies / staff.",
				"added": 1585413677
			},
			{
				"comment_id": 123,
				"body": "> [aspidochelone](#comment_392_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z): with people restraining you from ripping out the breathing tube.\n\nWhat I hear is that in some hospitals in the US, people are pressing their panic button because they are going critical or can't breath and hospital staff can't get to them in time due to swapping into clean PPE and overcrowding / busy treating other patients.",
				"added": 1585537647
			},
			{
				"comment_id": 126,
				"body": "> [xcape2net](#comment_718_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz): The truth is that we're running out of tests, so few people are being tested now.\n\nNot only are they running out of tests, but the hospitals are running out of room and ventilators. Half of the states are in an auction over them while the other half of the states ignore the pandemic. The hospitals staff is over worked and stretched thin to the point where the facilities are asking for out of state workers to come assist. (as if each state won't be needing that support eventually). The staff are running out of Personal Protective Equipment as they are limited to one set every 24 hours proving that the staff are not able to protect themselves, but are then having to risk not only themselves, but their family's health as well due to the likelihood of exposure. The hospital staff are not given any sort of alleviation such as free food coverage / delivery. Or wavered hotel stay at empty hotels, or any sort of financial bonus for their extraordinary efforts.\n\nMeanwhile states that do take it seriously give 'voluntary stay-at home' orders as if the citizenry has any sort of common sense while other states such as Texas and Georgia give statements that the State does not have the 'power' to close any religious gatherings. Now, one could conclude that the federal government should step in because State governors are naturally inept as to take such action on a nationwide level, but sadly nay as the key positions of the US government that were appointed by Trump's financial advisors are off attempting to figure out how they can capitalise from the disaster while safely hiding away in their comfortable holes.\n\nAs for the US president, that entertainment piece wouldn't be allowed to stop traveling and lobbying even if he tried.",
				"added": 1586293433
			},
			{
				"comment_id": 132,
				"body": "> [thorburn](#comment_47_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): I presume you are claiming that Corvid-19 kills 4% of those who supposedly contract it? Provide the evidence to support that outlandish claim.\n\n| Country | Infected | Dead | Cured | Total | Mortality Rate\n| ------------- |:-------------:|:-------------:|:-------------:|:-------------:| -----:|\n| US | 619607 | 27760 | 51056 | 698423 | 3.97% |\n| Spain | 177633 | 18579 | 70853 | 267065 | 6.96% |\n| Italy | 165155 | 21645 | 38092 | 224892 | 9.62% |\n| Germany | 133456 | 3592 | 72600 | 209648 | 1.71% |\n| France | 131365 | 17188 | 31470 | 180023 | 9.55% |\n| United Kingdom | 99459 | 12894 | 365 | 112718 | 11.44% |\n| China | 83356 | 3346 | 78311 | 165013 | 2.03% |\n| Iran | 76389 | 4777 | 49933 | 131099 | 3.64% |\n| Turkey | 69392 | 1518 | 5674 | 76584 | 1.98% |\n| Belgium | 33573 | 4440 | 7107 | 45120 | 9.84% |\n\nAverage Mortality of Top 10 infected countries: 5.68% as of [4/15/2020, 2:34:27 PM](https://coronavirus.jhu.edu/map.html)",
				"added": 1586985194
			},
			{
				"comment_id": 134,
				"body": "> Lmfao...looks legit!\n\nAre you laughing at your inability to validate information?\n\n> Care to explain the disparity between the UK percentage and the others...especially between the UK and Germany? \n\nI was wondering the same thing. Maybe the German government gives a shit about their citizens while UK is just another US proxy. The UK has been trimming their socialized medical coverage for some time now in favor of more private (out of pocket) procedures such as the removal of hemorrhoids and eyelid tags. But otherwise it might have something to do with rainbows and magic puffs of smoke.\n\n> You do understand that there is a difference between dying of Corvid-19 and dying with Corvid-19? \n\nYou don't seem to understand the definition of 'Mortality rate' as many more will perish without even coming into contact with the virus simply due to the over burdened staffing.",
				"added": 1587056947
			},
			{
				"comment_id": 135,
				"body": "I see the fantasy curve created by humanity collide with the reality curve of nature and I can't help but to smile. Expect another update for comparison in a week or so.",
				"added": 1587069330
			},
			{
				"comment_id": 139,
				"body": "| Country | Infected | Dead | Recovered | Total | Mortality Rate\n| ------------- |:-------------:|:-------------:|:-------------:|:-------------:| -----:|\n| US 🏆 | 988,451 | 56,245 | 111,509 | 1,156,205 | 4.86% |\n| Spain | 229,422 | 23,521 | 120,832 | 373,775 | 6.29% |\n| Italy | 199,414 | 26,977 | 66,624 | 293,015 | 9.21% |\n| France | 165,963 | 23,327 | 46,293 | 235,583 | 9.90% |\n| Germany | 158,758 | 6,126 | 114,500 | 279,384 | 2.19% |\n| United Kingdom | 158,348 | 21,157 | 807 | 180,312 | 11.73% |\n| Turkey | 112,261 | 2,900 | 33,791 | 148,952 | 1.95% |\n| Iran | 91,472 | 5,806 | 70,933 | 168,211 | 3.45% |\n| Russia | 87,147 | 794 | 7,346 | 95,287 | 0.83% |\n| China | 83,918 | 4,637 | 78,374 | 166,929 | 2.78% |\n\nAverage Mortality of Top 10 infected countries: 4.83% as of [ 4/27/2020, 9:31:20 PM](https://coronavirus.jhu.edu/map.html)",
				"added": 1588046671
			},
			{
				"comment_id": 140,
				"body": "> [commandantecero](#comment_18_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): 21% of NYC has had it. \n\nThe 2016 census says their are over 8.55 mil people of NY alone, meanwhile JHMU shows there are  291,996 confirmed cases in NY with 111,583 recovered and 22,668 dead. Now ( as of 4/28/2020, 8:31:21 AM)... ~444k people is no where near the 21% infected that you have claimed, more around ~5.19% has been confirmed to have or has it.\n\nMy numbers are at least pulled from a Medical University, where the hell did you get that 21% of NY being infected or recovered figure from?\n\n21% of a 8.55 mil state population is 1.79 million people... I would love to see a source that says there are 1.79 mil New Yorkers who has or had the virus.",
				"added": 1588084741
			},
			{
				"comment_id": 141,
				"body": "> [commandantecero](#comment_20_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro): https://www.foxnews.com...   [...]  Sorry but you've been sheared sheep!\n\nNow that made my day, thanks. :)",
				"added": 1588087494
			},
			{
				"comment_id": 145,
				"body": "| Country | Infected | Dead | Recovered | Total | Mortality Rate\n| ------------- |:-------------:|:-------------:|:-------------:|:-------------:| -----:|\n| US🏆 | 1,134,673 | 66,430 | 175,382 | 1,376,485 | 4.83% |  \n| Spain | 216,582 | 25,100 | 117,248 | 358,930 | 6.99% |  \n| Italy | 209,328 | 28,710 | 79,914 | 317,952 | 9.03% |  \n| United Kingdom | 183,501 | 28,205 | 901 | 212,607 | 13.27% |  \n| France | 168,518 | 24,763 | 50,663 | 243,944 | 10.15% |  \n| Germany | 165,086 | 6,812 | 130,600 | 302,498 | 2.25% |  \n| Russia | 134,687 | 1,280 | 16,639 | 152,606 | 0.84% |  \n| Turkey | 124,375 | 3,336 | 58,259 | 185,970 | 1.79% |  \n| Iran | 97,424 | 6,203 | 78,422 | 182,049 | 3.41% |  \n| Brazil | 97,100 | 6,761 | 40,937 | 144,798 | 4.67% |  \n\nAverage Mortality of Top 10 infected countries: 5.24% as of [ 5/3/2020, 10:32:29 AM](https://coronavirus.jhu.edu/map.html)",
				"added": 1588521922
			},
			{
				"comment_id": 148,
				"body": "| Country | Infected | Dead | Recovered | Total | Mortality Rate\n| ------------- |:-------------:|:-------------:|:-------------:|:-------------:| -----:|\n| US🏆 | 1,228,177 | 73,207 | 189,910 | 1,491,294 | 4.91% | \n| Spain | 220,325 | 25,857 | 126,002 | 372,184 | 6.95% | \n| Italy | 214,457 | 29,684 | 93,245 | 337,386 | 8.80% | \n| United Kingdom | 202,359 | 30,150 | 934 | 233,443 | 12.92% | \n| France | 174,224 | 25,812 | 54,078 | 254,114 | 10.16% | \n| Germany | 168,162 | 7,275 | 137,696 | 313,133 | 2.32% | \n| Russia | 165,929 | 1,537 | 21,327 | 188,793 | 0.81% | \n| Turkey | 131,744 | 3,584 | 78,202 | 213,530 | 1.68% | \n| Brazil | 126,148 | 8,566 | 51,370 | 186,084 | 4.60% | \n| Iran | 101,650 | 6,418 | 81,587 | 189,655 | 3.38% | \n\nAverage Mortality of Top 10 infected countries: 5.16% as of [ 5/3/2020, 10:32:29 AM](https://coronavirus.jhu.edu/map.html)",
				"added": 1588813789
			},
			{
				"comment_id": 149,
				"body": "> [thorburn](#comment_55_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK): It looks like the Corvid-19 was an organised exercise in applied psychology, \n\nIt takes real mental gymnastics to imagine that all scientists around the world who have the ability to detect a novel coronavirus would be plotting some orchestrated conspiracy to overthrow the world's nations as a whole.",
				"added": 1588866120
			}
		],
		"1585431659_17Z8aUjWp2GECRJJUr4NXvE8byWXg68s8A": [
			{
				"comment_id": 121,
				"body": "[Zeronet Update Page](/1uPDaT3uSyWAPdCv1WkMb5hBQjWSNNACf/) Will allow you to update your Zeronet client from within zeronet.",
				"added": 1585491133
			}
		],
		"1585494937_1Ab3JF91st5kW9WUgKdAcCNZp2E1vYALtT": [
			{
				"comment_id": 122,
				"body": "The sad reality is that as Earth continues to warm and turn into a nice incubator for infectious diseases coupled with overcrowding, factory food production, and little to no regulation on waste such as agriculture or manufacture run off (including antibiotics), COVID19 is the first of many diseases that will ravage this planet and the human population.\n\nMaybe a global government is needed after a small percentage of the global population is left. After all, we all do live on the same planet and the geographical boarders are only imaginary. While on the other hand, humans have yet to transport themselves and inhabit extensive distances of the boundaries of space.",
				"added": 1585495344
			}
		],
		"1586435262_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 127,
				"body": "The best advise one can give during this crisis is don't get sick, nor injured.",
				"added": 1586440653
			}
		],
		"1586517971_1MWEiuQMdpFnEMLrRLSxEPJYB55u76WTjY": [
			{
				"comment_id": 129,
				"body": "> [astrav](#comment_27_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8): You are left with dumb 'smartfone' radiating your childs brain. \n\nPerhaps it is a favor to us all. Better to make the little dictator retarded before any excessive social harm can be done.",
				"added": 1586613962
			}
		],
		"1586928602_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": [
			{
				"comment_id": 130,
				"body": "Unlike ZeroID, ID providers that don't provide a means of their created ID to be blocked per user instance are a cancer on the Zeronet network and should be avoided.",
				"added": 1586959950
			}
		],
		"1586599656_12DKigk2DkPNoUCFWcgzeW7CXu6kgX2NaL": [
			{
				"comment_id": 131,
				"body": ">  running trackers (operate by WHO ???)\n\nWith the bootstrapper plugin enabled, they are operated by YOU as your zeronet client becomes a tracker in itself... Pretty ridiculous right?\n\n> which collect and log all info about users of this \"system\"\n\nTry renaming your peerdb and stats plugins to peerdb.disabled and stats.disabled to prevent the preservation of peer IP data.",
				"added": 1586960388
			},
			{
				"comment_id": 133,
				"body": "> [netsd](#comment_1_1AE2tYp2pXa7j1PydeRkPRsc2qpWXwrR49): NSA control entry nodes, so they catch you.\n\nWhy would the NSA hunt for you? Being another idiot on the internet is not unlawful.",
				"added": 1586990730
			}
		],
		"1587305852_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": [
			{
				"comment_id": 136,
				"body": "While I would support a socialist economy, one just doesn't seem possible due to human laziness to ensure the success of socialism or it fails due to the greed of humanity in that some group will attempt to funnel resources solely to themselves. (which will deprive resources away from the socialist community). So while socialism may work in theory, we as a species aren't mature enough for such economic concepts.\n\nIf you think I'm wrong, name one nation that practices the values and ideology of Socialism in the age of today , 2020. It simply doesn't exist because humans constantly fail to implement it one way or another.\n\nHumanity as a whole can't even acknowledge that we all live on the same planet as in my toxic trash will one day become YOUR problem. So how are we going to even care about everyone in some socialist economy.",
				"added": 1587307636
			}
		],
		"1587581309_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 137,
				"body": ":)",
				"added": 1587661072
			}
		],
		"1587670973_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": [
			{
				"comment_id": 138,
				"body": "Being on a side doesn't really matter as views becomes negligible when it comes to getting laws passed.\n\n- A centrist having to negotiate with a far right opponent will result in a central rightist agreement.\n\n- Someone on the far left having to negotiate with someone far right will result in a centrist agreement.\n\n- A leftest having to negotiate with a centrist political party will result in left centrist standpoint.\n\nRarely does any law or bill get passed with bipartisan support. Often a middle ground is settled upon.\n\nIt's why hoping for a centrist politician to swing a rightist government to the favour of leftist ideologies would never happen as the scope of argument will never be expanded past the centrist viewpoints.\n\nme:  Progressive socialist",
				"added": 1587689345
			}
		],
		"1588110604_1Fjz1g7unEcMnTRy7nc9WUBZdA7eHkc7BL": [
			{
				"comment_id": 142,
				"body": "Couldn't agree more! I'm glad to see that you have enjoyed the video as much as I did.\n\nI'm rather sad that people are more interested in 3d printers rather than in-home automated gardens where people can share their best 'grow-recipes' on p2p sites.\n\n[Decentralized open sourced farming , TEDTalk](/big.kopykate.bit/?Video=1516680893_1J58Rie679DVSuKB1iDyFFTbzmaMaY2bt2)",
				"added": 1588179355
			}
		],
		"1587679731_1367VTupfj886Uk39iT4RjiSmrakiDYTga": [
			{
				"comment_id": 143,
				"body": "Many of those links have been removed, maybe it should have been mirrored to nullpaste.bit and ZeroUP",
				"added": 1588258123
			}
		],
		"1588389325_19913irDUyBcw4rBHtdPdsMFW5vkqKBTY6": [
			{
				"comment_id": 144,
				"body": "And some people love the taste of Kim Jong Un testicles as they can never seem to adjust those priorities even during a world wide pandemic.",
				"added": 1588430795
			}
		],
		"1588692906_1CcmrTeqtuoQtUpuxBZ9wFZz1tPaBcKb1g": [
			{
				"comment_id": 147,
				"body": "I've been attempting to discuss matters of Zeronet on the clearnet for the past four years. It should give a hint as to the current levels of information suppression an a variety of other subjects.. \n\n> .Once they saw the link 127.0.0.1 they considered it to be a torjan.\n\nThe local address is the true magic of zeronet as those who attempt to prevent the spread of information become a peer when viewing the network, just as the custodians of copyright can't reference material on zeronet without appearing that they themselves are making said content available. \n\nThis is all without mentioning the redundancy aspects of the network and the parties desire to remove or censor otherwise permanent information.",
				"added": 1588697340
			}
		]
	},
	"comment_vote": {
		"1618_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1619_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1584_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"251_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"366_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"372_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1600_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1603_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1605_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"241_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"361_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"367_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"402_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"1623_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"374_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"313_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1629_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"406_1LFu1BTScmY82HHtg3TY2jAuSrCYNsQWEY": 1,
		"2_14mqeC9JkKTrWmaR1X4LdtdAuB8qaAhbNB": 1,
		"1633_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"403_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1653_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1654_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"12_14mqeC9JkKTrWmaR1X4LdtdAuB8qaAhbNB": 1,
		"407_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"1669_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1675_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"366_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1672_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"10_16Fw7LqBDEgoFYTkiJBsywYJRtoRRTYCd3": 1,
		"24_1Q2noE3qu7ccvEspqWWv4xkMktiqp6mhdK": 1,
		"654_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"6_1DfS5W4f4uaamYXGawCNnG4niUe4ue5MiC": 1,
		"68_1Drej4kKBea1TryGPYfVZgzDxaB71rsKkK": 1,
		"23_15MBFYLT1rsDL4pqRBzg3rvpJCppox8Yd8": 1,
		"389_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"415_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"346_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"421_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"4_1Fct94e4PRpnXyWzFi679369yUL6aKrsej": 1,
		"396_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"867_1CLhLYdMKjXtium9yjuRkSnFvPfdoUTXAj": 1,
		"30_12SMhQYY24LU82PZ4P4VTJg9j3mp6JRB5w": 1,
		"110_17SvvdtU1CMTXxiX6zNNsfmcreKmDvzswq": 1,
		"1_17BYwjP6Ugv94ZazKdGNmx9FmtPiX7cgkB": 1,
		"443_12BRJSQrTETJVZzt2jHdqPywv3SdugSywC": 1,
		"10_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"108_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"107_16ePf6TBgip2eF88AxhnRJdPXyZJK1V2S4": 1,
		"424_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1218_1Cy3ntkN2GN9MH6EaW6eHpi4YoRS2nK5Di": 1,
		"449_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"28_1367VTupfj886Uk39iT4RjiSmrakiDYTga": 1,
		"1743_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"5_1Q7FqoGACdQ6WtpT4bbRCdV6Q2dNpCRhpe": 1,
		"79_145qVnMUHFaHhDNmmd1s2ZPh5FTArtZmjn": 1,
		"328_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"14_1A8k2FFyono2dUQWKaRzsRvbXguVuXQHYS": 1,
		"1_17ThiaUZmUKD2nEKkvUN6iCvaa1F3GBY51": 1,
		"1750_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1751_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"452_1NZftAz9VSawGF5JgMYGFv4ByoKEaQbNZu": 1,
		"29_15DiwKXyByVUtW7hWvTSuTa7FM2uLM7UV5": 1,
		"72_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"331_1PPUrYcZ1E1rGkkE6PH18Qi43LRsKABo1Z": 1,
		"1_18HDixtzvKVUN5q6DmabhcWQKAP8d9dTd3": 1,
		"1758_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"40_12LJsN6FdsNkS8EfiDYFyoPqZUnEibBJvP": 1,
		"446_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"1771_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1773_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1772_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1_17ybuXy41pVtp8PD1FidU2ADmmQLxd5kz5": 1,
		"229_1LbP2cNA6NkvuFJvs7McUmv9qGjkNqVkTa": 1,
		"388_17zoTjVZEBUdo6uAvQvtbih7ibBMHQRsrH": 1,
		"1_16H8PnkKK28GX5NdwsAz6EALB9QuvoY5bU": 1,
		"85_14dsVvztuXjBxWmk4s4HjUnxuN4AeNaVvk": 1,
		"1819_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1821_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"6_1KpsEG8BKkSJPFv8VVbngfC7xToMrYDJfS": 1,
		"1831_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"30_1N2JLPM7vMtsQkPZiatLHyU6shFKP7aZWg": 1,
		"496_1DoVPxFrQCDb3grC8Nsn6aACed9o2oiumX": 1,
		"81_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"82_12zcNM3BD6QwkonPrnCdbWBnGzu9b1rQRA": 1,
		"15_1CQXqzcFLdzbuFCAeBSprGqn8nvZpHyySR": 1,
		"1953_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1955_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"1985_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1,
		"712_1GJc2vm4vJjAKsFoFJ2D3gGmKiRac2kfnz": 1,
		"27_1Cz14BpPcFkhe8R2cEqHuCfEgRymfaSLH8": 1,
		"13_1F87dd49JyvrShxjTz6jszGnxm7bn8if6m": 1,
		"3_1EgS5evb1aJWQuYS9kwn4jXyUgxfiWWoZ8": 1,
		"33_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"34_1e6paNoDoqwCZGNa4o4uX43GrawvJuVB5": 1,
		"5_19y1ZG2DVeRM65kYxKcLz7MLGTfTfoUWSm": 1,
		"25_1HpSHmnQ3cp4oP3hRQsqr1f4U5T7ZL29zK": 1,
		"487_1PGTHAmvu7K2PM7qqfoKyWv69aJsAaJQp5": 1,
		"21_1F87dd49JyvrShxjTz6jszGnxm7bn8if6m": 1,
		"6_1Go1gbJtN2dPsRU5vCUeXQfwBSTJwAbaFK": 1,
		"97_12tcdM86TcZQeHEsSea3kTdTiExBKngWbP": 1,
		"90_1CgdRv2BFaVqNfmK3qGVYDuA7EDmk8dJVS": 1,
		"79_193HCur1fDFo7RoPUnQ1poMMexP4M9tbcU": 1,
		"20_1NG5ezregpGPUFoJuJfVZLW98B2zed5yro": 1,
		"5_13VzYLsme2nhQhPP21jnT2b3WxZbsySzGQ": 1,
		"2117_16NS3rBdW9zpLmLSQoD8nLTtNVsRFtVBhd": 1
	}
}