{
	"next_topic_id": 2,
	"topic": [
		{
			"topic_id": 1521361975,
			"title": "how to translate this article to Korean？",
			"body": "The Chinese government is persecuting his people, in order to transform the domestic economic contradictions, they do not hesitate to poison their people, man-made avian influenza, pneumonia, pulmonary fibrosis, depression all kinds of diseases, in order to let the people into the hospital spend money, do a variety of checks and false treatment, thereby artificially manufacturing consumption, reduce the government economic pressure. The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines. At the same time monitor and monitor their own people, to combat all kinds of people with different ideas. Not waging war, torturing their own people, persecuted their own people, can no longer deceive, unarmed civilians, this approach is more brutal than the Kuomintang 1938.\n\nThis government will be overthrown by foreign governments, China will perish, the people will win.",
			"added": 1521361974
		}
	],
	"topic_vote": {
		"1521297196_1AaTCnhYzavS9UXQge7emdMVNK92rchX7q": 1
	},
	"next_comment_id": 11,
	"comment": {
		"1521299251_1AaTCnhYzavS9UXQge7emdMVNK92rchX7q": [
			{
				"comment_id": 1,
				"body": "how to learn Korean?",
				"added": 1521362073
			}
		],
		"1521361975_1H4rWP8Jxk1PuSNrDc3zXfAc1JMoCoTMKD": [
			{
				"comment_id": 2,
				"body": "> [leftside](#comment_28_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Very interesting article, but without providing its sources or grounds, can't help translate into Korean.\n\nFrom the zeronet,",
				"added": 1521415754
			},
			{
				"comment_id": 5,
				"body": "> [leftside](#comment_30_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): That's not enough. Sorry.  [...]\n\nfake news are played everyday in TV, we just talk the truth. No government's papers will accept such news come from people.",
				"added": 1521448627
			},
			{
				"comment_id": 6,
				"body": "> [leftside](#comment_32_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): I understand situation. But you have to make this article more believable by adding essential information to support it.\n\n“The insurance industry has reduced health insurance this year, and hospitals have limited medication, and pharmaceutical factories have ceased production of specific medicines.”\n\n“The country has ceased production of Penicillamine,and can not be purchased at all pharmacies and hospitals. This is the disaster of patients with hepatolenticular disease, and many patients have no medication for months. The alternative medicines of Penicillamine DMSA were not sold. However, these have to be sold in pharmacies before. Why stop selling, because these medicines can not only cure Wilson disease, but also can be used in treatment of methyl mercury poisoning. There are people in China who are using methyl mercury to harm others, and they don't want the victim to buy the antidote easily. Methyl mercury poisoning can cause depression and anxiety symptoms, you will feel headache, mental decline, insomnia, decreased eyesight and so on. If you suddenly have the above symptom and check out the reason, pay attention to the water you drink and the courier you receive!\n\nIf you see this information, please let more people see.\n\nIf you are a conscientious official, please restore the normal sales of Penicillamine and DMSA.\n”\nCOPY from zeronet",
				"added": 1521452245
			},
			{
				"comment_id": 7,
				"body": "> [leftside](#comment_33_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Thank u for the more details. Can u provide any news URL supporting your article. Not those nameless fake news provider, but a bit publicly well-known major news media, plz.\n\nIf the well-known major news media mean BBC or CNN, or CCTV, we have not. The nameless \"fake\" news provider, are people living in China. Are you living in Korea? If you told us some truth about your life, who could prove it? The BBC or CNN, or SNC?",
				"added": 1521505157
			},
			{
				"comment_id": 8,
				"body": "Another \"fake\" news:  man-made avian influenza, pneumonia, pulmonary fibrosis, depression and ALS are \"social disease\", \"government disease\", \"middile age disease\". ALL of them are made by people of \"ghost\".For some persons, be careful of drink/eat and enviornment of living could help you to be well.For sicked persons, they need best friends could be trusted and guard their sleep for each other. Only these could help you for well from the \"sicked\" situation.",
				"added": 1521853985
			},
			{
				"comment_id": 9,
				"body": "People will decide by themself, what I want to do is to spread this insists more and more populor.Just like broadcast of Bitcoin, every body has a rule to decide whether accept \"this transaction\". Do not need a \"central \"people to decide what is true. We just spread this if we support it is right. God bless American.",
				"added": 1521875489
			},
			{
				"comment_id": 10,
				"body": "> [leftside](#comment_34_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): If the media in China doesn't mention the situation, even well known people's testimonies will be enough. Those people don't need to be celebrities. Reputable people on the net such as @Binchan or @Kaffie also could support your insists. [...]\n\nIf you believe my insists, why not to spread it?",
				"added": 1521875881
			}
		],
		"1521297196_1AaTCnhYzavS9UXQge7emdMVNK92rchX7q": [
			{
				"comment_id": 3,
				"body": "> [leftside](#comment_27_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): 주의사항: Always Enable Tor Mode로 시작할 경우, 인터넷 끊긴 상태에서 같은 공유기 공유하는 내부 컴퓨터들끼리 통신이 안 되는 문제가 있으니 그때는 Disable Tor Mode 선택해서 재시작 해야 함.\n\n선택해서 재시작 해야 함?",
				"added": 1521418694
			},
			{
				"comment_id": 4,
				"body": "> [leftside](#comment_31_16dEowtNbV89NxPcDrAKkmnuXtiJVoVcDm): Disable Tor Mode 선택해서 재시작 해야 함 means Select [Disable Tor Mode], then you have to restart.\n\nDisable Tor Mode 선택해서 재시작 해야 함 means Select [Disable Tor Mode], then you have to restart.",
				"added": 1521448461
			}
		]
	},
	"comment_vote": {}
}