{
	"next_topic_id": 20,
	"topic": [
		{
			"topic_id": 1,
			"title": "上海长城宽带已经断网",
			"body": "任何外国网站都上不去",
			"added": 1508942072,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 2,
			"title": "明鏡訪談劉仲敬（20170626）：何謂中國？",
			"body": "“梁啟超那種又要搞大一統、又要搞文化民族主義的邏輯，不可避免地會使自己陷入自相矛盾的狀況。現在的情況其實仍然是這樣的。”本稿由三馬兄整理。\n時間：2017年6月26日美東時間9:30（北京時間6月26日晚9:30）\n主持人：郭寶勝\n主持人：“中國”這個詞，現在有人認為是指中華人民共和國，有人認為是指中華民國。這個詞在古代指的是什麼，在近代又指的是什麼？你認為“中國”這個概念在歷史上的嚴格定義是什麼？\n劉仲敬：大凡有統戰價值的詞都是模糊性的。就是因為它有模糊的幾個含義，所以才能統戰，如果定義太清楚了，就不好統戰了。從歷史上看，“中國”這個詞其實是有三個階段的。第一個階段大體上是先秦時代，它這個詞的意思就是首都以及首都周圍的地方。最早出現“中國”這個詞，是周武王伐紂以後說了一句話，叫做“宅茲中國”，就是我已經佔據了中國。這個“中國”指的是位於天下之中的洛陽城。我們先看“國”這個字在方塊字中的造詞法，它是周圍一圈城牆，中間一個拿著戈的武士，所以它的意思就是設防城堡，就是相當於封建歐洲的那種設防城堡，一個有城牆、有武士守衛的地方就叫做一個“國”。周人封建諸侯，分國人和野人。國人就是住在城牆裏面的人，就是由周公封某人為某諸侯，他帶著殖民團到東方去建立一個城牆，城牆裏面的人就叫做國人，也就是周人派到東方去的軍事殖民團體；城牆以外呢，那就像美國印第安人一樣，是土族人和原住民，他們就叫做野人。國人和野人的區別就是在那一圈城牆。城牆以內就像是古希臘城邦的公民一樣，他們是這個政治共同體的成員；城牆以外就是野人，他們是土族人和外人。這就是國野之別。“國”就是設防城堡，設防城堡以內的人是封建體系的一部分。所以，“國”就是城堡，而“中國”就是位於天下之中的城堡，具體來說就是洛陽城，頂多再把洛陽周圍那一圈也包括進去，這就是“中國”。除了“中國”以外，其他地方的設防城堡也叫“國”。其他各諸侯或者任何人建立一個城堡，就叫做“建國”。這是“中國”的第一個定義，是最嚴格、最狹義的定義。\n到了先秦以後，特別是漢魏以後，“中國”增加了第二個含義。它跟我們現在所謂的中原是差不多的，就是以現在河南為中心、主要是華北的這一片土地，長江以外的南方或者是關外的北方和西方就不算是“中國”的一部分。比如說在三國時代，“中國”是跟“江表”對立的一個概念。吳人來聘，就叫做“去中國”。魏人說到吳人如何如何，就說是“中國有什麼人才，吳人有什麼人才”。這裏的“中國”就是指的以洛陽、許昌為中心的北方這一塊。“江表”就是長江以外，那就不算是“中國”。這種說法一直維持到南北朝時代，像陳慶之或者其他什麼南朝人士到洛陽或者到北方去，他就會說，“中國人物之盛如何如何，我們江表自永嘉之亂以來一直以為只有江表才有文化，現在看來中國也有文化”，諸如此類的。這就是“中國”的第二個定義，“中國”指的是中原地帶。這兩個定義，其實在中古以後都是一直混用的，一直到近代也沒有消失。\n近代的“中國”這個第三個概念，是隨著清朝和西方的外交展開的。清朝和西方的外交文書當中，從漢文和滿文的文書來看，它寫的都是大清皇帝如何如何，或者是大清皇帝跟大英國國王如何如何，跟俄羅斯皇帝如何如何，這裏面是沒有“中國”這個詞的。但是它還要有一個外文譯本，那麼一般來說，英文譯本中就要出現“Chinese”或者“China”這些詞，於是就出現了一個有別於“大清”的新譯法，就是“中國”這個譯法。嚴格來說，“中國”在這種意義上只是大清的通俗稱呼。因為“達欣”（注：滿洲語勇士之邦，翻譯成大清國）帶有一定部族主義的意義，本身來說只是一個內亞的稱呼，但是西方跟大清簽署條約的時候，例如跟英國和俄國簽署條約，有些是邊界條約，它必須包括整個大清的邊界，例如大清跟英國簽訂一個緬甸邊界條約，那它就不能夠只涉及滿洲或者蒙古的問題了，它就要涉及南方十八省的問題了，雖然南方十八省只是大清的殖民地，但是在英文譯本上就要出現“China”這個詞，因為我們簽署的畢竟不是一個滿洲邊界協定。諸如此類的問題。結果由於外交上的需要，“China”這個詞漸漸地和“大清”這個正式名詞融合在一起，變成大清的一個非正式的稱呼。儘管清國在五大臣留洋的時候還是把“達欣”這個名詞寫在正式的公文書上，但是一般的新聞報紙之類的用“China”這個詞來指大清的話也是可以接受的。\n所以在晚清的時候你就可以開始看到，像榮祿或者翁同龢這樣的大清朝的重臣，在涉及外交的問題上的時候經常用“中國”這個詞來指大清，例如他們自己會說，“如果朝政在某某奸臣的主持下就這麼辦下去，我們中國簡直是要亡給西洋人了”，這個時候他們說“中國”這個詞的時候，等於就指的是大清朝；但是與此同時，出於政治原因，例如為了抵制康有為梁啟超的那種觀點，他們又要強調，從政治上來講，“大清”跟“中國”是不一樣的，如果康有為保中國而不保大清的話，這跟造反是沒有區別的，我們不能上當受騙，我們要強調，大清就是大清，談“中國”就是對大清不忠。這兩種態度是同時存在的，是交錯縱橫的。很像是現在的台灣，什麼叫“台灣”？有的時候“台灣”就指中華民國，有的時候“台灣”指的就不是中華民國。例如在綠派和藍派鬥爭的時候，綠派中間比較極端的派就會說，我們台灣跟中華民國不一樣；但是綠黨即使是執政，在涉及外交場合的時候也經常會說台灣就是中華民國，中華民國就是台灣。清朝末期的情況其實也就是這個樣子。\n同一個人，例如像榮祿這樣的重臣，他對“中國”這個概念就同時有兩種看法：一方面，他本人親筆在日記中寫道，“哎呀，如果讓奸臣橫行的話，我們中國只怕是要亡”，這裏面的“中國”毫無疑問就是指的大清朝，不會是指的當時還不存在的中華民國或者是中華民族；另一方面，他在維護慈禧太后、跟康有為梁啟超他們這些維新黨人作鬥爭的時候，他又要強調，“保中國不保大清”是亂臣賊子的混話，真正的大清朝是絕不會接受這樣的說法的，我們只有“大清”，沒有“中國”。這兩種看上去相互矛盾的話，由榮祿這同一個人說出來，那是什麼意思呢？那就是統戰的意思。他要統戰的時候、要盡可能說“我們大清不僅僅代表滿洲、而且代表了全中國”的時候，他就說“大清”和“中國”是一回事；他不統戰的時候、要堅持維護滿洲貴族特權的時候，他就說“大清”和“中國”不是一回事，“中國”是你們反賊企圖顛覆大清的陰謀。這種做法，大家動一動腦筋就可以看出，其實跟現在的統戰形勢也是非常相似的。也就是在這個時候，“中國”這個詞像現在的“中華民族”、“中華民國”這些詞一樣，變成了具有非常微妙的意義的統戰辭彙。\n就大清這一方面，可以說，比較頑固的宗室大臣就堅持說，只有“大清”，沒有“中國”；那些負責跟西方交涉、比較開明的人士，包括榮祿這樣的現實主義者在內，他就是“大清”和“中國”混著用，需要用“大清”的時候就用“大清”，需要用“中國”的時候就用“中國”。在反賊這一邊那就是，極端派，像是汪精衛或者是孫中山這種人，他就要堅持說，不要說大清絕對是敵人，是征服者，是我們的敵人，就連“中國”這個詞，統戰意味也太強，我們也不能接受，我們就要用“支那”或者是“華夏”這樣的詞。章太炎就講，支那亡國，支那在明朝末年的時候已經亡國了，“滿洲”或者“中國”這些詞都是狄人的代名詞。但是比較溫和的人 — — 像梁啟超就主張，徹底的革命損失太大，把滿蒙的領土搞出來重新獨立建國在外交上也不好安排，我們不如就直接把“大清帝國”改變為“中華帝國”，把“大清臣民”改變為“中華民族”，這一下，無論是滿人還是南人都可以感到滿意，滿人也好，回人也好，蘇人也好，浙人也好，蜀人也好，大家從此以後都是中華民族一家，這樣不是很好嗎？“中華民族”是一個妥協的詞，可以讓各方面都滿意。但這種做法是不能讓孫中山滿意的。\n結果就是，在清朝這一邊出現了“中國”和“清朝”既是一回事又不是一回事的情況，在反賊這一邊又出現了“中國”跟“支那”或“華夏”既是一回事又不是一回事的情況。梁啟超是想把“中國”、“支那”和“華夏”算成是同一個概念的，但是汪精衛或者是章太炎就不接受。清朝這一方面則是，榮祿這些開明派、現實主義者希望把“大清”和“中國”算成一回事，而端王爺這樣的極端派和滿蒙親貴派就要堅持說“大清”和“中國”是敵對概念。這樣一來，“大清”、“中國”、“支那”、“華夏”諸如此類的概念就變成了具有高度政治意義的詞。大家都希望利用它在文化上和語義上的模糊性，一方面爭取盡可能多的支持者，一方面又把這些支持者攏到自己這個比較狹窄的範圍內。這種情況也就跟現在各方面運用“中國”這個詞搞統戰的形勢非常相似。其實我們如果把視野放廣一點就可以看出，這種語義上的混亂其實是全世界各國，包括東歐這些歐洲比較邊緣的地區，在由中古時期那種比較混亂的統治形式轉化到近現代這種比較明確、邊界比較清晰的民族國家統治形式的民族構建過程中，不可避免要發生的爭論。它不是遠東特有的，而是全世界所共有的。\n主持人：在你的理論體系中有一個很重要的理論就是，歷史上的中國源於內亞秩序在上古、中古和近代的三次輸出，這樣的理論是怎樣得出的？\n劉仲敬：應該說我這是沿用了一般歷史教科書的說法，嚴格說來，實際上“中國”這個詞是近代以來才具有國家意義的，在古代頂多是一個城邦或者城市的意思。正確的、嚴謹的說法應該是，東亞歷史上的政治結構是源於內亞輸出和刺激。這一點在考古學和文明史的角度上是很明確的。所有比較嚴肅的學者都知道，人類文明實際上是起源於西亞的。西亞產生文明，至少是在一萬年以前。產生有形態的國家，比起東亞來說要早一千年到兩千年。有很多證據就表明，東亞最早的政權，就是我們現在可以確認的殷、周兩個朝代 — — 其實“朝代”這個詞也是後來唐宋以後追認的，歷史上真實的殷、周其實不是兩個交替的朝代，而是並行的、時間和空間上有一定交錯的兩種不同的文明體系 — — 它們都有深刻的內亞烙印。有比較極端的學者認為，殷、周兩個族群其實都是西來的，像王國維就是這麼認為的，他寫的詠史詩就說，華夏文明的祖先是從昆侖山下來的，這在當時是非常流行的學說。殷人的戰車技術跟兩河平原的戰車技術是一模一樣的，而戰車是殷人的主力。一樣到這個程度，就像是秦始皇書同文車同軌一樣，戰車能不能夠通用要看它輪子的輪距，還有，它的戰鬥力要看在戰車上射箭的武士的高度，結果測量這些高度、輪距之類的，都發現它們跟蘇美爾美索不達米亞文明的原型是相似的，但是時間上晚了一千年到兩千年。所以合理的說法就是，殷商的國家建構，要麼殷商本身就是從西北方向遷移過來的一個種族，要麼它就是在跟內亞方面接觸的過程中吸收了西亞已經產生的很多文明成果，所以組織形態上有了一個很大的進步，才建國的。\n我們都知道，原始部落是很早產生的，但是原始部落產生出國家組織，這就像是鹵水點豆腐一樣，經常是需要外來刺激的。最重要的外來刺激之一就是外來征服。本來我們是一些鬆散的部落聯盟形式，可能就像傳說中的黃帝、炎帝或者三代上古一樣，部落酋長的權力不太大，也是相當民主產生出來的，但是軍事動員能力不強；但是如果被外人一打的話，我們受到這個刺激，就發現我們非有戰鬥力不可了。就像聖經上的以色列人那樣，我們發現我們打不過外邦人，就吵著說，我們也要立一個王，讓王領導我們征戰。這就是國家的一個重要起源。也許殷商是內亞來的征服者，那它當然是在征服的過程中形成了自己比較完善的國家組織；也許它本來不是內亞人，只是在跟內亞征服者接觸的過程中發現自己有必要強化軍事組織，從而產生了自己的王朝組織。這兩種可能性都是殷、商從各種原始部落當中崛起和產生的原因，也是東亞從部落到國家這個變化最可靠、最可能的原因。\n周人的情況就更加明顯了。周人是肇自西北，儘管文字記錄看不出他們的種族和文化來源，但是不僅是西周那個時代，即使是在西周以後的春秋時代和秦國時代，挖掘出的古物都可以看出，凡是今天陝西一帶挖出來的古物，無論時代是屬於西周時期還是春秋秦國時期的，它都有非常突出的斯基泰或者是吐火羅風格。而這兩個文化體，斯基泰是有強烈的雅利安印歐性質的，吐火羅也同樣是有很深刻的東伊朗烙印的，它們都跟內亞文化有著千絲萬縷的聯繫。所以無論是周人的文化還是秦人的文化，它都有很深刻的內亞來源。周人征服殷人，是西土的力量打敗東土的力量。這種模式在後來的歷史中一再重演，可以說每一次都是更接近內亞方向、能夠接受內亞先進技術的族群，打敗了離內亞較遠、軍事技術不太先進的族群。後來戰國時代，趙武靈王胡服騎射。當時的保守派貴族認為，我們自古以來都是穿袍子用戰車的，我們很文明，不應該去騎馬射箭。趙武靈王最後說服了這些保守派貴族，使趙國的戰鬥力迅速增強。但是我們看趙國的位置在哪兒呢？趙國是在兼併了代國 — — 也就是今天鄂爾多斯高原到大同這一帶以後才變得強大了，才變成戰國後期唯一能跟秦國對抗的力量。\n趙、秦兩國都是中原各諸侯國當中能夠接觸內亞輸出的力量。內亞是兩條路線：一條路線是河西走廊這條路線，是由秦國接觸的；一條路線就是所謂的雲中道，也就是《穆天子傳》講的那條路線，從洛陽出發，向北經過邯鄲，到代郡，然後到大夏 — — 也就是到大同、鄂爾多斯一帶，然後順著蒙古高原西行，這也是後來唐朝通過回鶻人西行的路線。這兩條路線是內亞輸出的主要路線，所以戰國後期的仗主要就是它們打。整個先秦時代，即使是我們認為最古老、最正宗的中華文化，也就是所謂孔子時代的華夏文化，它的來源跟內亞文化的輸出都是有不解之緣的。孔子主要是講周禮，周禮就是封建制度，而封建制度根本上就是周人在打敗殷人以後、在東土搞軍事殖民產生出來的。這個格局跟日耳曼人打敗了羅馬人以後搞軍事殖民而產生出歐洲封建的格局是一樣的。如果說西方文明源於日耳曼的話，那麼我們所謂的中華文明和華夏文明主要是源於周人，而周人的內亞性是非常明顯的。這是第一波輸入，從殷商到趙武靈王這個時代，形成了我們所知的秦漢帝國。後來所謂漢朝是第一個盛世，其實是內亞長期輸出的第一個結晶。但是盛世以後，就好像希臘產生羅馬，春秋戰國產生秦漢，統一以後，外來的輸入就衰竭了，內部的競爭也減緩了，所以這個文明就像是歷來的羅馬、巴比倫這樣的大一統文化一樣趨於衰竭，結果就導致了永嘉之亂。\n從永嘉之亂到隋唐，是內亞的第二波輸出，結果就是產生了隋唐，以唐太宗為代表的天可汗。有很多人是漢唐並稱，但是，漢是孔子那個“中國”的直接繼承者，像羅馬繼承希臘一樣，唐繼承的可就不是孔子的“中國”了。孔子的“中國”在魏晉以後滅亡了，遷到南方，南方就相當於是拜占庭帝國，最終被北朝整個消滅了。隋唐是北朝的繼承者，北朝是鮮卑人北魏的繼承者，北魏是五胡亂華的繼承者，五胡亂華是永嘉之亂的繼承者，永嘉之亂的五胡則是漢朝晚期一直到魏晉以來從內亞闌入的新一波蠻族的繼承者。可以說，他們是內亞的第二波輸出。鮮卑武川集團產生的隋唐，是五胡亂華以來從內亞外伊朗地區這一波輸出的總結。\n它跟第一波的古典的中華文明有很多細節上的區別。例如像是天可汗體制，就是外伊朗產生出來的那種王中王體制在東亞的一個複製品。萬國衣冠拜冕旒，也就是像後來我們認為是中國文化的特徵，官員頭頂烏紗帽之類的，這些東西其實都是由伊朗人的服裝所搞來的。我們現在不像日本人那樣席地而坐，而是坐在椅子上，面前有桌子，這些都是外伊朗地區的產物，而不是華夏文化的產物。孔子和漢武帝是像日本人那樣席地而坐，前面放一個很矮的茶几的；我們現在有很高的桌子和很高的椅子，都是從伊朗這些地方來的。無論是唐朝的政治制度 — — 像天可汗、藩鎮制度這樣的政治制度是從外伊朗地區來的，還是人民的日常生活，像是不吃小米，改吃麥餅，不席地而坐，而是改坐椅子，這些也是從外伊朗地區來的。這就是第二個“中國”。我們習以為常認為是“中國”天生的很多東西，都是這個第二個“中國” — — 其實是外伊朗地區第二次輸入的產物。這是第二波輸入。\n第三波輸入就是由遼金元清這一系列所代表的。內亞征服者在以燕京為中心的地區建立王朝，首先是建立遼國，然後再建立金國，然後建立蒙古，征服了整個南宋，最後通過清朝消滅了明朝，塑造了我們近代這個中華民國的版圖。這是第三波輸入。這個第三波輸入更簡單，離得很近，所有人都能看得出。我們都能夠看得出，所謂的中華民國或者所謂的中華人民共和國，它繼承的是誰的國際法實體呢？答案是，它繼承的是大清這個國際法實體。中華民國在國際社會能夠站得住腳，是因為它繼承了大清；中華人民共和國呢，它爭奪的是中華民國在聯合國的席位。所以說，中華人民共和國如果有一個身份的話，這個身份是中華民國給它的；中華民國的身份則是大清國給它的；而大清國的政治體制呢，是蒙古人、女真人、契丹人建立的這個內亞-東亞複合帝國的產物。它不是宋朝的後裔，而是遼國、金國、蒙古國和清朝的後裔。這是從政治層面上。從文化和風俗層面上，受內亞影響的地方那就更多了，就不用一一詳解了。\n現在呢，我們所謂的“中國”其實是一個很複雜、很混合的概念，是包括了這三個“中國”的重疊體。第一個“中國”就是最古老的跟兩河文明有密切關係的殷周那個古典“中國”，孔子的華夏，產生了秦漢帝國；第二個“中國”就是來源於外伊朗地區、萬國衣冠拜冕旒的隋唐帝國；第三個“中國”就是源自蒙古高原的元清帝國，產生了近代的中華民國和中華人民共和國。我們運用“中國”的時候經常是不嚴密的，動不動一會兒說漢唐如何如何，一會兒又說孔子、諸子百家如何如何，一會兒又說近代以來的中國跟帝國主義如何如何，其實就是把這三個“中國”的概念或者說是三個東亞政權的概念混在一起用了。然而這三個東亞政權從歷史發展的順序上來看，它們都是內亞起源的。可以說得不客氣一點，十八省或者說是通俗所謂的漢人在這三個體系中的地位，都像是印度人在大英帝國中的地位一樣，你儘管人口是占多數的，但是你是臣民。政治體系的來源，要麼是莫臥兒帝國的，要麼是大英帝國的，都不是從你這兒來的，都是從內亞方向或西方來的。近代以前，所有的東亞政治體系都是內亞起源的；近代以後，則是西方起源替代了內亞起源。\n主持人：現在中國人的大一統觀念非常強烈，他們可以贊成民主自由人權這些普世價值，但是一提到這個獨那個獨都是痛恨得要命，覺得如果支持台獨和港獨就是不愛國。你的一個很重要的觀點就是，大一統這種觀念來自於蒙古的世界主義，是通過元明清塑造起來的，能否解釋一下？\n劉仲敬：這是“中國”這個概念最矛盾的地方，因為講“大一統”這個概念或者是講“中華如何如何”的概念的人，一般是南人，至少也是所謂的漢人，很少有內亞血統的滿人、蒙人或者是回人去講這些事情的；但是恰好，他們所講的這個概念非但不是為他們自己服務的，反而是內亞征服者為了征服他們而設計的。我們可以粗暴地說一句話：大一統觀念是蒙古帝國為了反對宋獨勢力而設計的意識形態。這一點我們要從宋朝的起源來看。宋人對唐朝和五代有一個很大的不滿，他們認為，宋朝存在的目的和意義就是要撥亂反正，就是要反擊唐朝和五代藩鎮以來的那種不像話的作風。這個不像話的作風有兩個方面，而且這兩方面是有聯繫的。一方面是家風不正，就指的是唐太宗或者是他們的女眷，女性不守清規或者是不遵守中原禮法之類的概念。總之是像魯迅說的一樣，“唐室大有胡氣”。考慮到唐朝自己本身就是鮮卑血統很重的王朝，又是直接繼承了北朝，這一點其實一點兒都不奇怪。\n同時，五代的番將直接繼承殘唐五代的藩鎮，他們基本上跟安祿山一樣，都差不多是胡人。安祿山叛亂，固然安祿山是河中人，也就是外伊朗系統的人，但是打敗安祿山的李光弼、李抱玉這些將領何嘗不是胡人呢。唐玄宗要打安祿山，第一個派出去的就是哥舒翰，哥舒翰也是胡人。後來打敗安祿山的是李光弼，李光弼其實也是胡人。等於是唐朝對付安祿山的辦法也就是用胡人來打胡人，除此之外也沒有別的軍事上可靠的辦法。像杜甫這樣一些人雖然對唐朝這種政策很不滿意，但是你讓他自己去打仗的話，他也沒辦法去打，最後還只能用這種辦法，只能用親唐朝的藩鎮去打那些反唐朝的藩鎮。最後演變出來就是五代十國。五代當中，除了朱全忠那個後樑以外，其他四代都是起源於河東的沙陀王朝。沙陀王朝，歷史記載是很明確的，它是起源於唐朝的處月部落。處月部落是一個白種人的部落，原來居住在天山北路的北庭（別失八裏） — — 也就是今天的昌吉市吉木薩爾附近的地方，在唐朝末年受唐朝人的招募來替唐朝人打仗，包括打別的塞外蠻族和打黃巢這樣的反叛勢力，最後把河東這個地方封給他們。他們首先變成一個割據勢力，最後在征服汴梁以後建立了五代。\n宋儒認為，唐朝這種做法太糟糕了。其實這種看法是從唐朝末期安史之亂以後就開始了。大家都痛恨安史之亂，覺得安史之亂把國家給搞壞了，然後追究責任就說是，都怪唐玄宗不該亂用番將。唐玄宗當年是不用番將的，我們的日子本來過得好好的，用了番將以後搞得天下大亂，民不聊生，所以以後我們要糾正這個錯誤。他們譴責的對象不僅是番將，而且還包括伊朗文化。例如像白居易這樣的人，一方面罵安祿山不忠不義，不該造反，另一方面又罵唐玄宗和楊貴妃，你不該跳什麼伊朗來的胡旋舞，吃什麼胡餅，喝什麼葡萄酒，諸如此類的。總之，你們這樣熱愛胡風不愛華風，在政治上把番將引進來，在文化上搞那些葡萄美酒夜光杯的東西，是我們現在倒楣的根本原因。但是白居易和很多知識份子一樣，他也是一個心口不一的人，所以近代學者考證，儘管他在朝廷上痛罵安祿山，痛罵胡旋舞和唐玄宗的番將政策，但他自己在私下裏面是很喜歡聽龜茲樂而且也照樣看胡旋舞的，所以他自己其實也就是他自己譴責的那個現象的一部分。\n宋儒基本上就是唐朝這些民間反對派的一個繼承者。他們認為，宋朝建立的動機就是要洗清前代的錯誤，以後我們宋朝就要建立一個徹底排除內亞因素的王朝，這叫做尊王攘夷。尊王攘夷跟白居易時代的那些理論一樣，也是有政治和文化兩層的。政治上講，就是說，我們絕對不要像以前的鮮卑人王朝一樣，什麼哥舒翰什麼安祿山都弄來當官，以後我們要完全用科舉制度選出來的儒家學士當官。這一點他們是做到了，宋朝是文臣主導的年代，當官的人都是儒家的文人學士，武將沒有地位。這樣一來就可以消滅胡人藩鎮割據的錯誤。另一方面，在文化上講，我們也要尊王攘夷，也要搞純而又純的中華文化，這就體現於“王者不治夷狄”，不搞唐朝那種黷武主義。唐朝什麼地方都想要，結果國土中間有大量的異民族文化的勢力；我們呢，王者不治夷狄，西亞的土地我們也不要，契丹的土地我們也不要。按照現在的說法講，宋人的文化政策是一種文化民族主義。只有小華夏這個圈子裏面的土地他們才要，出了這個圈子他們就不要了。\n不要說是西北的土地他們不要，連西南的土地都有一句名言叫做“宋揮玉斧”，就是宋太祖用玉斧在地圖上畫了一條線，他沿著大渡河畫了一條線，就是把諸葛亮征南蠻以來就已經控制了的雲南、貴州一帶的土地劃到宋朝以外。因為契丹西夏是我們打不過的，我們還可以這樣做，但是我們打西南這些少數民族，我們總可以打贏吧。但是宋太祖的意思是，即使我們能打贏，我們也不要這些土地，我們只要純粹的華夏民族主義，這些土地不是我們華夏文化的，諸葛亮也好，唐太宗也好，唐玄宗也好，去要這些土地都是犯了錯誤，大渡河以外的土地不是我們宋家的土地，我們宋朝的子孫永遠也不要去要這些土地，不要像唐玄宗那樣“武皇開邊意未已”，我們要吸取唐朝的經驗教訓，以後再也不幹這種事情了。這就是宋朝的意識形態，它是文化民族主義，退縮的，保守的，要求東亞跟內亞劃清界限，我們只要東亞，不要內亞，內亞跟我們不是一回事。當然這樣一來，宋人是不會像唐朝那樣去要什麼西域的土地或者是去要大理的土地了，但是你不要別人的，不見得別人不要你的。遼人、金人和後來的蒙古人還是打過來了，最後是蒙古人把宋朝整個征服了。\n宋朝反對蒙古人的意識形態，不僅是軍事上要反對，在政治上和文化上也要有自己的說法。這個自己的說法當然就是說，你們內亞人是一撥，我們東亞人是一撥，我們華夏衣冠跟你們不一樣。像陸遊那些南宋人就很強調，他們對於唐人很讚賞的北齊、北周都堅決反對。他們說北齊的鮮卑人政權非要念什麼孔子的經，搞什麼華夏衣冠，這簡直就像是狗戴著帽子嘛，你明明是一條狗，幹嘛要戴著人的帽子呢，這太不像話了。如果你回到唐朝去看，唐朝的君臣對北齊還是很讚賞的，因為他們自己也是鮮卑人；但是宋朝就認為這樣是絕對不行的，你們內亞民族，即使你們學孔子的道理，學華風，我們也不要你。這就是宋人的文化民族主義。根據這種文化民族主義，就像是秦檜和宋高宗所謂的那樣，“南自南，北自北”，你們北方人是北方人，我們南方人是南方人，我們不應該合在一起。\n這個立場在蒙古人 — — 特別是在蒙古人贍養的那批儒家知識份子，像姚樞或者史天澤這批人看來，這就跟宋獨勢力差不多了，這就是南蠻頑固之見，按照這種頑固的看法的話，宋人是永遠不會向蒙古帝國臣服的。同時，這樣一來對他們在蒙古帝國內部的政治鬥爭是不利的。因為蒙古帝國是一個世界帝國，在它內部，像姚樞、史天澤這種人是跟著忽必烈混的，他們主張蒙古的主攻方向應該是在東亞這個方向；但是蒙古朝廷中間也有像是剌合蠻、鎮海這些人，鎮海是基督教徒，剌合蠻是伊斯蘭教徒，他們主張蒙古的方向應該是向西發展，向西亞那個方向、向巴格達那個方向發展，汴京這些地方都不重要。他們所擁戴的貴由汗跟姚樞、史天澤這種人擁戴的忽必烈汗是在政治上處於對立狀態，所以後來就爆發了忽必烈和阿裏不哥之間的內戰。\n所以姚樞、史天澤和忽必烈這一派為了加強他們的論據，就特別需要一種意識形態，這種意識形態要粉碎宋人那種頑固的東亞文化民族主義，要論證，普天之下都是一家，所以蒙古人征服你們宋人是很合理的。為什麼呢？因為自古以來儒家都是主張國際主義的，都是主張有教無類的，“有教無類”這個詞怎麼解釋？就是說，無論你是什麼民族或者什麼文化，只要你願意向孔子學習，都是我孔子的門徒，所以你的種族出身或者文化背景不重要。按照這種邏輯你也可以說，儒家也是一種像基督教和伊斯蘭教一樣的國際主義宗教。這樣一來，他們就可以擁戴忽必烈、以儒家為意識形態搞世界帝國了。\n如果搞不出這套意識形態的話，那就只能讓剌合蠻或者鎮海以基督教或者伊斯蘭教為意識形態搞世界帝國了。後來，我們都知道，金帳汗國以伊斯蘭教為意識形態搞世界帝國，伊朗的伊爾汗國首先以基督教為意識形態、後來以伊斯蘭教為意識形態搞世界帝國。這對於忽必烈來說其實是一個很大的壓力，因為基督教和伊斯蘭教在性質上都是世界宗教，都是我們現在所謂的普世宗教，任何種族和文化的人都能夠變成基督教徒或者伊斯蘭教徒，那麼如果你忽必烈搞不出這一套來，你在政治鬥爭中就處於不利地位。所以忽必烈周圍的那些大臣就企圖以儒家為藍本，把儒家世界主義化。宋朝的儒家是不講世界主義的，而是講文化民族主義的，所以元朝的儒家就要反駁宋朝儒家的觀念，就要把儒家和大一統結合起來，產生出我們後來很熟悉的這種概念，就是大一統的儒家觀念。\n其實這在宋儒看來是非常矛盾的，不但非常矛盾，而且是非常漢奸的理論。這種理論就是等於說，只有蒙古人有資格統治東亞，為什麼呢？因為只有蒙古人才有能力建立世界帝國。如果我們把孔子重新解釋為一個世界主義者，把他解釋成為一個像耶穌基督或者穆罕默德那樣不講種族和文化的人，是一個世界主義者，那麼我們就可以合乎邏輯地得出結論：孔子在南宋皇帝和忽必烈汗之間將會選擇忽必烈汗。為什麼呢？因為南宋皇帝只能搞一個割據政權，只能搞一個偏安政權，只能占住南部這一塊地方就行了，他不可能統一天下的，所以他就不符合孔子的理想，因為孔子是要把他的王道推行到全天下去的，而忽必烈汗能夠統治全天下，所以根據孔子的邏輯，忽必烈汗比趙家皇帝更有資格統治整個東亞和全世界。所以如果你按照北朝忽必烈身邊的那些儒生的看法，那就是說，按照我們這樣解釋的孔子將會選擇忽必烈。\n當然南宋那些儒家就不會這麼認為。南宋那些儒家就會主張，孔子也說過，“夷狄之有君，不如諸夏之亡也”，也就是說，無論如何諸夏、華夏的文化都比夷狄文化要高明，所以趙家天子再不成器也是我們自己的人，蒙古天子再厲害也是你們別人的人，你們找這個理由也無非是給你們的叛變找依據，你們本來都應該忠於我們趙家天子，凡是儒生都應該忠於趙家天子，你們現在倒好，你們貪圖富貴，去投靠了蒙古人，那就像是在抗日戰爭時期投靠日本人一樣，為了給自己的行為遮羞，你們就說，“日本人能夠實現大東亞共榮圈，蔣介石實現不了，所以我們忠於日本人不但不是錯誤的，不但不是漢奸，反倒是在道義上比你們更高一層”，你們太卑鄙了。\n宋朝和蒙古人爭奪的時候，雙方的意識形態就是這樣的。像文天祥他們那種人當然就要主張華夏文化至高無上、“崖山以後無中國”之類的邏輯；像姚樞、史天澤他們那種人當然就要主張，孔子不講種族，天下有德者居之。什麼是有德者呢？能夠統一天下蒼生、把和平帶給全世界人民、把全世界的人民從無休止的戰爭中解放出來的人，這種人就是真命天子，他就是孔子選擇的真命天子，忽必烈能夠統一你們，說明忽必烈就是真命天子。最後的結果是，忽必烈是軍事政治雙管齊下，一方面在軍事上打敗了南宋，另一方面在政治上又通過他對儒學的重新解釋，把這種大一統的新儒學變成了蒙古帝國的官學。在蒙古帝國的科舉當中，你再像文天祥他們那樣解釋文化民族主義，你就永遠也做不了官了；你就必須按照大一統的方式重新解釋儒學，重新解釋朱子學，你才能夠做的了蒙古帝國的官。\n最後等到朱元璋推翻蒙古以後，他不能滿足於像宋朝那樣僅僅占住南方的漢地，他還想到滿洲和關外去發展一下，因此他也就在他的歷史體系中把忽必烈也算成是跟唐太宗、漢文帝一樣需要祭祀的先王，也要講華夷秩序。也就是說，他的政治秩序不是繼承南宋的政治秩序，而是繼承蒙古的政治秩序，它是一個華夷秩序。他招募了很多蒙古將領為他服務。同時強調，北元政府已經滅亡，蒙古帝國的全部遺產，不僅是南方的遺產，而是蒙古帝國的全部遺產，理所當然都應該屬於明帝國。所以他的主張實際上是，長城南北的土地都是屬於他的，因此他在政治上和學術上都否定了南宋的儒學。\n這就具體體現在孔子這個家族的繼承上。本來南宋把孔子的家族遷到江西，繼續維持儒學的道統；而金人和蒙古人把留在山東曲阜的那個孔子世家豎起來，所謂的孔子北宗，作為孔子的繼承人。南北分裂的結果是，孔子這一家也分裂了。後來蒙古勝了以後，就把北宗作為孔子的正宗。朱元璋趕走蒙古人以後，他是怎樣選擇的呢？他還是選擇山東那個孔家，也就是蒙古人的孔家，作為孔子的正宗。他選擇的官學，選擇科舉考試的標準題目，仍然是蒙古帝國那個題目。明朝的科舉考試的出題方式是繼承了蒙古帝國的出題方式，而不是繼承南宋的出題方式。明朝的意識形態是繼承了蒙古帝國這個大一統的意識形態，而不是南宋這個文化民族主義的意識形態。明朝皇帝不像宋朝皇帝那樣主張王者不治夷狄，而是主張華夷秩序，無論是華人還是夷人，都是明朝皇帝的臣民，只要你們原先是蒙古皇帝的臣民，現在也要當我明朝皇帝的臣民。\n最後是清兵入關，等於是重新恢復了蒙古的格局。像皇太極就說，明太祖不過是一個百姓，推翻了他原先的主人，就建立了皇朝，他都可以合法，那麼我本來就是貴族出身，我直接繼承成吉思汗的汗位有什麼不可以呢？他的意識形態當然更多地吸收了蒙古那一套，同時他搞科舉也搞的是明朝繼承蒙古的這一套經過大一統思想重新改革過的朱子學，強調把大一統作為正宗。這樣一來，受這種新式的蒙古式儒學薰陶的新一代儒家知識份子，在他們的內心中造成了嚴重的靈魂分裂。像後來的南社這些人，他們即使在政治上是極端反對滿清和蒙古的，但是他們畢竟是受孔子思想教育的，而且教育他們的也就是蒙古產生、清朝發揚光大的這種新式的儒學，所以他們就處在一種像亨廷頓所謂的靈魂分裂的狀態：他們一方面要反對內亞各民族對東亞的征服，一方面在文化上又非要堅持大一統主義。\n但是從政治上來講，自古以來只有內亞統一東亞，就像蒙古征服南宋那樣，從來沒有東亞統一過內亞的情況。朱元璋和他的子孫短暫地企圖逆轉這個內亞征服東亞的傾向，結果很快就被靖難之變扭轉過來了。靖難之變靠的是北平的朱棣勢力，而朱棣靠的也是他周圍的蒙古雇傭兵，結果打敗了建文帝周圍那批想要復古更化的儒臣。這個矛盾是這些人解決不了的。實際上，你如果既要堅持文化民族主義的概念、又要做到邏輯一貫的話，你最後只能回到南宋那種格局去，回到文天祥他們的邏輯去，來一個“王者不治夷狄”，把那些蒙古人之類的統統給我趕出去。要麼呢，你要堅持大一統主義，那你就不可避免地要面臨著矛盾的現象：能夠實現大一統主義的都不是南人，都是內亞人，即使不是蒙古滿清，也是朱棣這樣高度蒙古化、依靠蒙古人支持的人，不可能是什麼江蘇人或者是廣東人能夠搞得成大一統的。江蘇人和廣東人要想自己出頭露面，那你只能搞文化民族主義，或者是搞小民族主義，你不能搞大一統主義。搞大一統主義，就是要滿洲人和蒙古人來征服你。\n但是他們在這兩面都不高興，又不高興滿洲人和蒙古人來征服你 — — 在現在就是不高興共產國際來征服你，另一方面又不肯捨棄大一統的觀念，結果他們的出發點就是自相矛盾的，自然而然很容易被人找到弱點。別人要攻擊他，那就像是汪精衛和孫中山攻擊梁啟超一樣的簡單，因為你自己的立場就是自相矛盾的。立場自相矛盾對你不一定有致命的損害，例如我像忽必烈一樣，我手中拿著槍桿子，我即使是在理論上自相矛盾，我還是可以站得住腳，我不講理，講槍就行了，儘管既有理又有槍是最好的，但是有槍的人可以不講理。但是你這些人呢，你這些民間知識份子，你本來就沒有槍，你只有理，在沒有槍的情況下，你自己的理都講得自相矛盾，那麼你肯定就講不過那些理論比較一貫的人。所以後來梁啟超他們鬥不過汪精衛他們，也就是這個原因。汪精衛那種驅逐滿蒙的邏輯是比較一貫的，梁啟超那種又要搞大一統、又要搞文化民族主義的邏輯，不可避免地會使自己陷入自相矛盾的狀況。現在的情況其實仍然是這樣的。\n大一統的觀念，從好的方向來說就是，我們要講事實，讓人民享受和平的幸福是最重要的，誰當領導人那是次要的，講什麼文化都是次要的，老百姓不都是希望安居樂業嗎？所以天下只有“定於一”才能安居樂業，誰能夠統一天下，把和平送給老百姓，誰就是合法的領袖，這樣做，我們才是真正為老百姓著想。這是從好的方向解釋。從壞的方向解釋，這就叫做寡廉鮮恥，跟漢奸有什麼區別。所謂“忠臣不事二主，烈女不侍二夫”，如果是我們自己的祖國，我們自己的祖國倒了黴也是我們自己的祖國，不能說是別人打了勝仗，他可以統一天下而我統一不了，那我們就認強者了，你這種大一統邏輯跟勝利者萬歲有什麼區別？鮮卑人打了勝仗，那麼鮮卑人萬歲，鮮卑人是大一統帝國，孔子擁護鮮卑人；蒙古人打了勝仗，蒙古人萬歲，殺了多少漢人都沒關係，蒙古人應該統治世界；滿洲人揚州十日沒有關係，他們能夠給我們帶來和平，誰讓你們明朝皇帝或者是李自成帶不來和平呢。這個邏輯看上去很有道理，但是實際上就是，正人君子在這種邏輯下都要倒楣，堅持原則的人都要倒楣，不堅持原則的投機分子和小人都可以飛黃騰達。\n如果到現在那就是，比如說是日本人征服了我們，打敗了蔣介石，搞成了大東亞共榮圈，那麼是不是說日本人也有資格統治我們？那麼共產黨依靠蘇聯的勢力征服了我們，既然共產黨能夠統一中國，那麼是不是共產黨最有理？它殺了多少人沒有關係呀，再怎麼殘暴，它能夠統一天下呀，和平是最大的紅利呀，在所有的暴行當中，最殘酷的暴行莫過於戰爭，人民在暴政之下受到災難，在戰爭中間也受到災難，無論政權多麼殘暴，只要它能夠統一天下，使我們避免戰爭，它不就合法了嗎？大一統觀念只要發展到極致，最後不可避免地就是要毫無原則地為任何暴政做辯護了。一面堅持大一統主義，一面又要堅持民主、華夏民族主義或者小民族主義，不可避免的，最終你就要推到這個矛盾的地步。假如有人能夠像成吉思汗或者帖木兒一樣殘暴，用極其殘暴的手段征服你，按照你的政治邏輯，你還是應該擁護他，就是因為他能夠給你帶來和平。誰能帶來和平？手上有槍的人能夠帶來和平，掌握武力的人才能帶來和平。最後，無論中間的論證步驟多麼複雜而精緻，這種論證最終的結果必然就是這樣。\n主持人：能否把突厥語族群跟大一統的關係闡述一下？\n劉仲敬：廣義的突厥語族群實際上是包括內亞的所有族群，狹義的突厥語族群就只包括帖木兒那一部分。突厥人是內亞入侵者的一部分，但不是全部。像後來的滿洲人，嚴格說來只是文化和語言上相關，他們的文字是突厥語的文字，但是種族上不一樣。但是你如果用比較模糊的說法，用“突厥”來指代內亞的話，那麼你可以說，整個東亞自古以來就是突厥征服者建立的一系列帝國所統治的，因此就產生了相應的大一統意識形態。但是我們要注意，即使是在最正宗的突厥族群當中，在十九世紀以後也出現了傳統的大一統主義（就是所謂的奧斯曼主義，奧斯曼帝國一統天下的主義）、俄羅斯境內像加斯普林斯基(1851~1914)這些新文化運動的知識份子所產生出來的泛突厥主義（文化民族主義）以及像凱末爾這樣的歐洲式分邦建國的小民族主義這三種不同的主義。在突厥語世界當中，最終勝利的還是凱末爾這樣的小民族主義。相當於大一統主義的奧斯曼主義，在長期以來征服東亞的內亞文化當中已經是不占主流地位了。而在東亞文化當中，本來是內亞人為統治東亞提供正當性辯護的這種大一統主義反倒是最流行的。\n這個具體過程大體上是這樣的：在十九世紀中葉，西方文化進入突厥語世界以前，突厥語世界普遍的觀念要麼是大一統主義，要麼是文化民族主義。大一統主義很簡單，就是，像奧斯曼蘇丹那樣的勢力理所當然應該統治天下，這個就產生了近代的奧斯曼主義。文化民族主義就是，即使我們突厥人的領袖不是統治者，而是必須服侍像成吉思汗這樣的統治者，但是我們的文化仍然是最高檔的。例如蒙古人原來沒有文字，他們的文字是誰造的？並不是漢人這些儒家知識份子造的，而是八思巴這樣的人用突厥文字造的。滿洲人的文字，也是用內亞維吾爾字母或者是突厥文字造的。內亞的所有各部族，無論它在種族上或者政治上是哪一方面的，它在文化上都是屬於突厥語文化，用突厥字母造出來的。這就說明，突厥的文化是最高檔的。有突厥文化的地方，我們都應該是一家。突厥人可以不通過軍事征服，而通過教育和文化的方式，把所有的無論種族上和政治上是不是突厥人、但文化上是突厥人的人整合起來。\n這種學說的主要代表人物就是俄羅斯帝國境內的突厥知識份子加斯普林斯基。他們發動的文化運動，在性質上講跟後來在中國北京1910年代發生的新文化運動是非常相似的，但是時間上早了幾十年。這個其實是地理上的原因，因為俄羅斯帝國境內的克裏米亞韃靼人，或者喀山韃靼人，或者奧斯曼帝國的土耳其人，在地理上都比較接近於歐洲，接受歐洲先進思想的薰陶是比較早、比較快的，所以他們的新文化運動也來得比較快。加斯普林斯基是一個代表人物。所以他的新文化運動展開以後，不出幾十年，在大清還沒有滅亡，大概1890年前後，所有突厥語地區都產生了新文化取代舊文化、新教育取代舊教育的變化。也就是說，像過去伊斯蘭經學之類的保守的學校漸漸消失了。由新派的西洋化的知識份子所推廣的新式教育和建立的新式學校，首先在俄羅斯境內的克裏米亞和韃靼推廣，然後在雖然不是土耳其人或者韃靼人、但是文化上比較相近的中亞各民族 — — 例如吉爾吉斯人、哈薩克人、維吾爾人當中推廣，然後又越過邊境，從俄羅斯帝國進入大清帝國，進入今天我們所謂的新疆地區，在新疆辦新式學校。\n如果我們用純粹的現在的歷史教科書來看的話，可能會得出一個很片面的印象，以為我們以前本來都是中古式教育，是五四運動以後我們才有了新式教育的。但是實際上，這是只看東亞的一隅之見。大清帝國境內最早推行新文化運動和新式教育的，並不是胡適之和陳獨秀這些漢人的知識份子，而是加斯普林斯基這些突厥的知識份子。最早用西洋式新式學校來取代中古學校的地方不是在北京，甚至也不是在上海，而是在塔城和伊犁。是由俄羅斯帝國來的、加斯普林斯基在俄羅斯帝國境內培養出來的新文化運動的第一代弟子的再傳弟子進入伊犁和塔城，在新疆地區辦了大清帝國境內的第一批新學，然後他們的再傳弟子發明了我們今天的維吾爾民族。從嚴格的歷史順序來講，東亞的近代化最先是由這一批人搞起來的。他們不僅比起胡適和陳獨秀這一批人更早，而且還要比梁啟超和汪兆銘那批在東京的留學生更早。首先是有這批突厥知識份子搞近代化和新文化運動，然後才是梁啟超和汪精衛他們在東京搞民族發明和新文化運動，最後才是胡適和陳獨秀在北京搞新文化運動。\n歷史發展的順序是這樣的：新式的文化民族主義和小民族主義首先在俄羅斯境內的克裏米亞和喀山產生，他們是歐洲以外第一批搞現代文化的人；然後他們搞出來的文化傳播到奧斯曼帝國境內，產生了近代奧斯曼帝國的維新變法，最後產生了凱末爾主義；再下一步，再過幾十年，傳到了大清帝國的體系內，產生了現代的維吾爾民族；這個刺激傳到東京，已經是二十世紀最初十年，產生了梁啟超和汪精衛這種人；然後進一步傳播到中國本土，才產生了新文化運動。這是歷史發展的基本順序。首先的民族發明是在歐洲展開的，第二步是在俄羅斯帝國境內展開，然後從俄羅斯帝國傳播到奧斯曼帝國境內，最後才傳播到遠東，包括大清帝國和日本境內。發展順序都是一致的：由傳統的大一統主義發展到文化民族主義，最後發展到小民族主義。\n主持人：辛灝年老師寫了一本書叫做《誰是新中國》，認為“新中國”指的是中華民國。但是我們知道，中共一直把中華人民共和國作為“中國”的代表，提出了九二共識與一中各表。中華人民共和國和中華民國具有高度的重合度。你對辛灝年老師的這一觀點是怎麼看的？\n劉仲敬：他認為“新中國”這個詞是共產黨從國民黨那裏剽竊過來的，這是非常正確的。這個歷史脈絡是很容易考證的。“新中國”這個概念是國民黨在抗戰時期進行的文化宣傳，強調的就是我們抗戰建國，抗戰勝利以後要建立一個非常美好的新中國。有非常具體的內容：抗戰以後，還我河山，撥亂反正，各方面要搞全方位的“四個現代化” — — 照現在的話說就是四個現代化建設。這個宣傳在當時是相當有力的。毛澤東就是為了對付國民黨的這種宣傳，所以他很巧妙地把這個詞剽竊過來，發明了我們都知道的那首歌，《沒有共產黨就沒有新中國》。這其實是一個很無恥的剽竊，因為“新中國”是國民黨已經用了十幾年的宣傳。國民黨一直說，在我們國民黨的領導下要怎麼建設新中國，但是毛澤東輕輕飄飄，什麼力氣也不出，他就把“新中國”這個詞安到共產黨頭上了，一下子就變成“沒有共產黨就沒有新中國”了。\n我們要知道，在民國時期的社會輿論，大家都知道中國共產黨是共產國際的一個支部，共產國際的總部設在莫斯科，大家都知道中共包括毛澤東在內都是蘇聯的人，都覺得哪怕是在團結抗戰、搞統一戰線的情況下，我們雖然要團結蘇聯一起對付日本，但是你們共產黨畢竟不是我們自己人，要想搞正宗的中華民族，怎麼也輪不上你們共產黨。沒想到你們共產黨這麼樣輕輕飄飄一搞，很無恥地就把“中國”這個詞蓋在自己頭上了。從宣傳角度來講，可以說是國民黨花了很大力氣來洗米做飯，把飯做熟了，還沒有吃，共產黨一把就把這碗飯給搶去了，硬說這碗飯是他的。\n辛灝年先生是傾向國民黨的，但是即使他不是傾向國民黨的，而是一個不相干的第三者，看到這種情況也會覺得共產黨實在是非常不要臉。你以前一直是講國際主義、反對民族主義的，國民黨講民族主義的時候，你義正辭嚴地說民族主義是地主資產階級的落後意識形態，我們國際主義才是無產階級的先進意識形態；結果等人家講著講著講差不多了，抗戰勝利了，你突然來一個下山摘桃子，不但把江山給搶了過去，連人家發明出來的意識形態都給搶過去了。以前你不是一直說民族主義那麼壞、是剝削階級的武器嗎，既然是剝削階級的武器，你又是打倒剝削階級、解放中國人民的，那你憑什麼還要拿剝削階級的武器，你應該打倒它才對呀，你怎麼這麼不要臉，把罵了這麼多年的中華民族又撿起來，又說是你自己的發明，這個很明顯是不要臉的事情。所以他把這一點考證出來，本身從狹義的歷史考證的角度上是沒問題的。\n但是另一方面，我們現在所說的中國歷史其實是像一個俄羅斯套娃或者是像洋蔥頭那樣的結構。俄羅斯套娃是大套娃打開裏面還有一個小套娃，小套娃打開以後還有更小的套娃。易卜生的《培爾·金特》那部詩劇中講的洋蔥頭也是這樣，剝洋蔥頭，剝了外面一層，裏面還有一層，你以為剝到底了，其實裏面還有很多可剝的東西。他是剝到國民黨這一層了，看到共產黨篡奪了國民黨這些東西，就覺得共產黨很無恥，這種感情上的看法，其實我跟他是差不多的，但是他就到此為止，沒有繼續剝下去了，以為國民黨那個大中華民國就是最底一層了，而我還要繼續往下剝。剝下去的結果就是，其實國民黨的大中華底下還有好幾層呢，可以一直剝下去，一直剝到歷史的源頭。這個歷史的源頭我其實已經講了，哪怕是到孔子那個時代，孔子禮樂所說的那個周人封建制度其實也是跟內亞征服者有非常密切的聯繫的，這就是洋蔥頭一連剝了幾層。\n我可以數一下：第一層就是辛灝年剝開的共產黨篡奪國民黨的這個大中華主義，但是在國民黨這層底下還有一層，是國民黨篡奪的袁世凱的中華民國，因為國民黨原先是主張華夏民族主義、而不是主張中華民族主義的，中華民族主義是袁世凱主張的東西。共產黨固然篡奪了國民黨的意識形態和江山，但是國民黨也篡奪了袁世凱和北洋軍閥的意識形態和江山。“中華民族”這個概念，本來是梁啟超這種改良派和袁世凱這種妥協派創造出來的意識形態。然後在他們所創造的這種“中華民族”之下，背後又有滿洲人和蒙古人打下的這個帝國結構，“中華民族”和“中華民國”都是繼承了這個帝國結構；滿洲人和蒙古人的背後呢，又有北魏、北周、西魏和隋唐打下來的這個鮮卑人的天可汗的世界結構；而這個世界結構的背後呢，又有秦始皇和漢武帝繼承的那個最古老的古典“中國”的帝國結構；這個帝國結構又直接來自於周公東征所建立的這套封建結構。\n一層一層地把東亞的歷史 — — 我不說“中國”的歷史，因為“中國”的歷史概括不了東亞的歷史，東亞的歷史有一半在東亞以外，而且這一半是最重要、最關鍵的一半，是動力所在的一半，所以我經常不說“中國”，而說“東亞” — — 把東亞的歷史從共產黨的“一個中國”剝下去，剝到國民黨的“大中華”，然後剝到袁世凱和梁啟超的“中華民族”，然後再剝到滿洲人和蒙古人的大一統，然後再剝到鮮卑人的天可汗和國際主義，然後再剝到秦漢帝國，最後剝到孔子和周公的封建制度。剝下來就是這樣一個套娃結構。你要瞭解整個歷史的話，不能夠只剝到國民黨這一層，得一直剝到底，一直剝到歷史的黎明 — — 周公和孔子最開始的那個時代才行。\n主持人：你認為東亞文化圈的建構是以日本為中心的，能否解釋一下這個說法？\n劉仲敬：嚴格來說，這就不是一個理論構建，而是一個考據上的事實。近代歷史上的國家建構方式，當然最早是在歐洲產生的，然後從歐洲往外一波一波推廣，時間線是非常明確的。首先就是到俄羅斯帝國，那些俄國人的變法之類的。俄羅斯還算是半歐洲民族。在東方民族當中，越過歐洲的範圍，第一波是奧斯曼帝國和韃靼人，就是在十九世紀中葉的時候的奧斯曼主義（大一統主義）、泛突厥主義（文化民族主義）和小民族主義這三種觀念。在十九世紀中葉和晚期，這三種觀念在奧斯曼帝國境內就已經很完備了；但是在東方，無論是大清還是日本，都還沒有這種觀念。最後西方思想傳到東方，已經是十九世紀最後十年的時候了。但是在兩者之間的反應當中，日本的反應就要比大清帝國快一些。\n如果我們把大清帝國擁有的突厥語那一片 — — 就是新疆那一片忽略不計的話，整個東亞，包括大清帝國的大部分地區 — — 滿洲和十八省，朝鮮、越南、暹羅以及日本本身，當然還包括台灣和南洋，這些地方的近代的民族構建、民主思想或者是任何改革思想，最初都是在日本產生的。奧斯曼帝國和波斯帝國的改革雖然比彼得大帝的改革要晚一些，但是都比東亞要早一些。歷史順序是，西方以外搞近代化改革，首先是彼得大帝在俄羅斯改革，然後是奧斯曼帝國，然後是伊朗帝國，然後就是日本明治維新，最後才輪到清朝再加上泰國和東南亞這些小國 — — 這些就是最後一波了。\n而在東亞這個區間，日本自身是變法最早、引進新思想最早的，結果它就變成了整個東亞，不僅是日本本身，所有先進知識份子聚集的地方。梁啟超要往日本跑，孫中山要往日本跑；像台灣的林獻堂這些人要想解放台灣，使台灣獲得自治權，他們也往日本跑，也跟日本的板垣退助這些思想比較開明的人打交道；泰國和朝鮮的士大夫想要爭取民族獨立，想要爭取近代化，他們也往日本跑。可以說，整個東亞和東南亞的知識份子，凡是在本國混的不得志的，或者是有了什麼先進思想不容於本國的，或者是想要改造本國的現狀、想要把本國變得像歐洲那樣繁榮富強自由民主的，他們最後的前途，可以說是條條大路通羅馬，殊途同歸，最後他們都會跑到日本去。\n這是因為日本有現成的搞近代化的經驗，在各方面都比他們領先一步。這是從思想文化方面。從思想文化方面，日本引進的西方思想最完備。他們可以不用學什麼英語法語，懂點日語，甚至不用完全懂日語，認識幾個漢字，就能夠通過日本文獻看到最先進的西方思想。從現實政治的角度來講，日本人對東亞各民族抱有最大的同情心。很多日本的開明人士覺得，我們不能僅僅是日本搞了明治維新就行了，還要想辦法讓黑暗落後的東亞多多少少也能夠從西方人征服的這個世界當中有一個出人頭地的機會。所以他們可以說是有一些國際主義精神的。孫中山跑到日本，我們都知道是依靠黑龍會的庇護，是依靠犬養毅這些人幫忙；宋教仁在日本，是依靠內田良平幫忙；林獻堂他們跑到日本，也是靠日本的開明人士 — — 板垣退助這些人替他們說話；東南亞，泰國和印尼這些，最先一批想要把本國歐洲化的知識份子跑到日本去，多多少少都能夠找到一些日本保護人。\n從這個角度來講，可以說整個東亞的近代化都是日本的女兒。如果說日本是母親的話，中華民國和東南亞各國都是日本的女兒。像新疆那些突厥語地區的現代化跟中東的關係比較密切，它們在文化上和政治上跟土耳其、伊朗的關係比較密切，跟東亞的關係不太密切，所以對十八省的影響很小。可以說，孫中山、梁啟超或者是以後的人都不是學習加斯普林斯基的結果，但他們毫無疑問都是學習明治維新的結果。從這個意義上來講，日本是廣義的東亞近代化 — — 包括民族構建和民主思想 — — 的母體。所有的思想，即使它們本身是相互矛盾的，其實都是從日本來的。\n（完）",
			"added": 1511965501,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 3,
			"title": "请问有没有整合电驴资源的ZeroNet网站？",
			"body": "一个电驴资源网站，开在ZeroNet上，真正去中心",
			"added": 1511966576,
			"parent_topic_uri": "19_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 4,
			"title": "男儿当杀人",
			"body": "作者：仇 圣,1995-1996年写于山东大学 摘自《血洗小日本》 仇圣 著 \n\n男儿当杀人，杀人不留情。千秋不朽业，尽在杀人中。 \n昔有豪男儿，义气重然诺。睚眦即杀人，身比鸿毛轻。 \n\n又有雄与霸，杀人乱如麻，驰骋走天下，只将刀枪夸。 \n\n今欲觅此类，徒然捞月影。君不见， \n\n竖儒蜂起壮士死，神州从此夸仁义。 \n\n一朝虏夷乱中原，士子豕奔懦民泣。 \n\n我欲学古风，重振雄豪气。名声同粪土，不屑仁者讥。 \n\n身佩削铁剑，一怒即杀人。割股相下酒，谈笑鬼神惊。 \n\n千里杀仇人，愿费十周星。专诸田光俦，与结冥冥情。 \n\n朝出西门去，暮提人头回。神倦唯思睡，战号蓦然吹。 \n\n西门别母去，母悲儿不悲。身许汗青事，男儿长不归。 \n\n杀斗天地间，惨烈惊阴庭。三步杀一人，心停手不停。 \n\n血流万里浪，尸枕千寻山。壮士征战罢，倦枕敌尸眠。 \n\n梦中犹杀人，笑靥映素辉。女儿莫相问，男儿凶何甚？ \n\n古来仁德专害人，道义从来无一真。 \n\n君不见，狮虎猎物获威名，可怜麋鹿有谁怜？ \n\n世间从来强食弱，纵使有理也枉然。 \n\n君休问，男儿自有男儿行。 \n\n男儿行，当暴戾。事与仁，两不立。 \n\n男儿事在杀斗场，胆似熊罴目如狼。 \n\n生若为男即杀人，不教男躯裹女心。 \n\n男儿从来不恤身，纵死敌手笑相承。 \n\n仇场战场一百处，处处愿与野草青。 \n\n男儿莫战栗，有歌与君听： \n\n杀一是为罪，屠万是为雄。 \n\n屠得九百万，即为雄中雄。 \n\n雄中雄，道不同： \n\n看破千年仁义名，但使今生逞雄风。 \n\n美名不爱爱恶名，杀人百万心不惩。 \n\n宁教万人切齿恨，不教无有骂我人。 \n\n放眼世界五千年，何处英雄不杀人？",
			"added": 1511967812,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 5,
			"title": "【东征演义】黑旗军破长安兵围保定，朴圣人遣忠徒使馆送信",
			"body": "且说那八个大大领着黑旗军过了星星峡，打马入长安，一路上威风凛凛；官军皆拱手而降，众汉儿也战战兢兢、立马归了正信。八个大大见中原唾手可得，喜不自胜，召集军中诸将商议继续东征的事宜。一汉卒冒冒失失闯进营帐中，拜倒在地，说道：“八个大大爷爷，众位爷爷，大事不好了！”号称“宁夏之剑”的哈立德·艾哈迈迪·马怒骂道：“你个卡非尔如何这般无礼？有事快报来。”汉卒慌里慌张的一通言语，却惹得营帐之中无人不大惊失色！原来这汉卒口称：“前夜里梵蒂冈下了圣谕，华北大主教在通州坐了龙庭，禁飞区马上要设到长安以东了。”\n\n八个大大听后愁眉不展，原来黑旗军在徐利亚吃了联军禁飞区的不少苦头，才万里长征至此；眼见着联军炮火凶掹， 一时间也无计可施。黑旗军旗下第一智囊、大维齐尔阿不都· 阿米尔· 麦和速木揪住汉卒问道：“汉儿官家现在何处？ ”汉卒应承道：“御前熊胺大将军护着官家驻跸在了陪都保定，负责拱卫的是京师虎头营。”阿不都向八个大大拱手称：“如此 ，可一鼓作气拿下保定，挟官家以令汉儿也，切莫错失良机。”\n\n八个大大颔首道：“我原以为，联军拿下山海关，不过是机枪朝着南面而已，没承想长安以东也入了禁飞区；那里不少人已经纳了天课，吾等定不能弃之不顾。”说完脸色一变， 喊道:“哈立德听命！ ”哈立德· 艾哈迈迪·马立刻上前一步，单膝跪地，“传咍里发钧旨：着哈立德立刻领兵进攻保定， 捉拿汉儿官家，面缚送入长安，不得有误！ ”哈立德领命而去。\n\n东征的黑旗军旌旗招展、热火朝天，沿着沧榆高速一路进至王快水库；水库波光粼粼、甚是喜人。哈立德·艾哈迈迪· 马遥指水面，对手下诸将笑道：“投鞭断流，可耶？ ”众将士齐齐喊道：“大人有魏武之雄姿也！ ”哈立德不由得诗性大发，朗声念道：\n\n长安虽已定，东征马不停；\n旦夕得正信，胜负归有经。\n\n军中原阿剌伯老战士听闻此诗，不由得眼含热泪；新附的汉儿降卒不解诗意，一时摸不着头脑。哈立德· 马 解释道：“吾等将士历经艰难险阻，不远千里来到东土传播正信；此战若与联军交锋，无论谁胜谁负都归有经人。尔等卡非尔本应下火狱，受那万劫不复之苦；如今迷途知返，善莫大焉，因此当 奋力一战，以报八个大大之恩。”汉儿降卒交口赞道：“大人真是文盖李社、势压苏辛也！”于是大军兵围保定、黑旗压城 ，偌大个保定城被铁桶般围个水泄不通，纵是鸟儿也插翅难逃。\n\n话说那吉林主教本是白头山朴氏人家，梵蒂冈祝圣之后 ，世人皆唤其为朴圣人。自汉儿官家失柄以来，各地顺民皆引领而望，如水之从下也；华北大主教通过外交渠道获得了联军首肯，专职抵御八个大大东窜，因此特命朴圣人作为特使前往保定，保全官家和一班要员来稳住大局。朴圣人领命以后一筹莫展，不由得唉声叹气；随行的金执事建言道：“吾等不如从黑旗军降卒中重金悬赏，必有健儿踊跃报名。”朴圣人有心一 试，却被浇了一头凉水，原来从黑旗军出来的降卒一听要他们返回军中，皆惊骇失色道：“吾等卡非尔侥幸纳了天课才能在黑旗军中苟全性命，如若投降，依律当被石刑也，怎敢再回去 ？此事万万不可。“\n\n有道是：山重水复疑无路，柳暗花明又一村；朴圣人无意间竟在降卒中看到了曾在吉林教会中的信徒，立刻拉住此人的手、避开众人，对其喊着教名说道：“扫罗，你怎在此？如何投去了黑旗军？ ”扫罗许久未被叫过教名，不由得浑身一哆嗦，定睛一看原来是吉林主教朴大圣人，失声喊道：“是哪股仙风把天使爷爷您吹了过来？ ”说完便涕泪四流称：“数年前在下与主内兄弟结伴前往京城闯荡，没曾想遇上了清理人口、便又西去了，正好撞上八个大大东征，无奈之下便被裹挟而去 。如今这般处境，无颜面对主内兄弟，更愧见朴圣人您了。”\n\n朴圣人喜极而泣道：“扫罗，此番遇见你，必是为了荣耀我主！现如今汉儿官家已移都保定，各国使馆也按外交惯例随行，皆不知联军已经承认了我主在世间的权柄；还请你返入黑旗军中，潜入保定城内向官家和各国使馆送此信息。如能成功，你将立下盖世奇功，若遇不测，我等也会奏请梵蒂冈，与 你封圣！ ”扫罗答道：“一切任凭朴圣人差遣。”于是朴圣人叮嘱再三，此处按下不表。\n\n扫罗身负重任，穿过高碑店的封锁线，来到了黑旗军营地；此地营內大多为新附汉军，见到扫罗回来也不吃惊，有旧相识者开玩笑道：“为何许久未曾见到你？怎不一走了之。“ 扫罗机灵回应道：“吾等不过是被四处差遣的命，有甚去处？ 之前已经纳了十年的天课，现如今也赖着八个大大老爷活命罢了。”汉卒们无不哀叹道：“活命难矣！不知保定城破之曰， 吾等身家性命还在耶？ ”话音刚落，又一轮攻城令传至营内， 汉卒无不叫苦连天；扫罗当下立刻混进军中，伺机潜入。\n\n眼见保定城内官军防线尽皆失守，唯有使馆区戒备森严 ，官家早已躲入其中。汉卒们蜂拥至使馆区前，一时奈何不得，便向驻守使馆区的联军马润喊道：“英雄，保定城指曰可下，吾主八个大大重视国际关系，不忍伤汝性命；将官家送给吾等，吾主将护送英雄回家！”马润不晓汉语，当即开火，汉卒抱头四窜。“呀呀个呸，这厮不识好歹，大伙一块做了他! ”汉卒们喧嚣不已，但无人上前，待到黑旗军督战队架好机枪后才硬着头皮冲锋，结果又被打退，当日便撤回营内，此处不提。\n\n扫罗在冲锋之时装作中弹，伏在尸堆之中；夜深人静之时悄悄爬至使馆区阵前，被马润发觉，马润正要开抢之际，扫罗喊道：“昂兜嘿斯艾，东特服艾尔（Under this eye, don't fire）！”马润大惊，把扫罗拉了起来；得知扫罗是特派信使后，当即将其送入使馆内。\n\n此时使馆内一片惨淡，官家与大将军借酒消愁、毫无斗志。扫罗进了使馆，正色道：“奉吉林主教朴圣人派遣，特告知陛下：经联合国首肯，禁飞区已扩大至华北地区，此刻联军战机正在福尔摸砂和砍通利亚加油，不日即抵达保定上空；而且出于人道主义考虑联军还将沿着天津至熊胺的运河抵达保定 ，接走被困人员，还望陛下再坚持个些许日子。”\n\n众人听完是一片喜色，喊道：“天不绝吾等性命”只是官家叹道：“国际法庭备好否？”扫罗笑道：“陛下不必担心 ，联军大统领已承诺，将效仿前朝政协故例，并保证陛下出入境无虞。”官家终于喜笑颜开，赞不绝口道：“大统领真乃我国之老朋友也，此番血盟，永世难忘哉！ ”\n\n正当使馆区内人人皆有喜色之时，黑旗军前敌指挥官哈立德·艾哈迈迪·马已如坐针毡：长安传来消息，俄罗斯已经密函八个大大联军战机正在飞抵保定的路上，此刻唯有奋力一搏拿下保定。新附汉军将领尤速服· 塞以德· 张拱手道：“大人可效仿‘ 四面楚歌’故事，命众军士大声礼拜，动揺其军心 。”哈立德一听，当下传令全军上下，将广场舞音响收集起来对着敌人防线，一时间使馆内众人莫不大骇、如临大敌。哈立德一声令下，铁甲自暴车分路进击、摧毁据点，黑旗军战士旋即鱼贯而入，这真是：\n\n长安鼙鼓渔阳惊，黑旗烈烈起战云；\n千里山河响霹雳，天揺地动走雷霆。\n\n使馆即将失陷之际，扫罗不由得拜倒在地，祈祷道：“ 愿天主怜悯保定的迷途羔羊罢！ ”正欲以身茉耀天主之时，空中战机轰然划过，“联军战机来也！”使馆内众人狂呼不已，黑旗军顿时军心大挫，攻势稍止；随后运河上开来数艘艟艨巨舰，有人识出那是联军的提康德罗加，黑旗军将士心中惊惧不已：“苦也，怎从运河上还来了这般杀手锏！ ”提康德罗加顿时火力全开，黑旗军苦撑不过，保定之围遂解。\n\n八个大大在保定折了精锐，知道无力对抗联军空袭，于是命哈立德聚拢残兵，连夜躲入潼关。欲知后事如何，且听下回分解。\n",
			"added": 1512566801,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 6,
			"title": "段子--治疗私处",
			"body": "盛夏，一女私处毛发之地长了痱子。医生说是小毛病，去买点痱子粉撒上，过两天就好了。她去了大药店，一时忘了叫什么粉，着急说成我要毛粉！店老板一听毛粉就来气，顺口骂了句：你傻逼啊？那女急忙说：对对对！毛粉就是撒逼…… by @redfireage\nhttps://twitter.com/redfireage/status/939245661089710080",
			"added": 1512811216,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 7,
			"title": "AV中的衬衫都是什么材质做的？",
			"body": "那种特别透，反光又比较好的衬衫是什么材质或者工艺的？感觉现在的衬衫，要么完全不透明，要么暗淡无光。",
			"added": 1516722997,
			"parent_topic_uri": "13_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 8,
			"title": "流感下的北京中年",
			"body": "女儿：“姥爷怎么这么长时间还不回来？”\n\n\n妈妈：“姥爷生病了，在医院打针。”\n\n\n女儿：“姥爷是我最好的朋友，姥爷给我吃巧克力。”\n\n\n“妈妈怎么哭了？”\n\n\n==========================\n\n全文近2.6万字，与平时巴菲特主题无关，请订阅者见谅。\n\n\n本文逐日记录岳父从流感到肺炎、从门诊到ICU，29天阴阳两隔的经历。涉及就诊、用药、开销、求血、插管、人工肺（ECMO）等信息，希望大家用不上！\n\n\n下列主题，可以搜索标题里的关键字或日期进行查询：\n\n\n1.\t不隔离流感家人，你就是在害孩子：12月28日-31日\n\n\n2.\t病毒阴性、高烧不退，马上去大医院：1月3日-4日\n\n\n3.\t护士不给高热病人挂号，你应该怎么办：1月4日\n\n\n4.\t为何感冒病人要吸氧：1月5日\n\n\n5.\t卧倒、卧倒，别再让重症感冒病人走路了：1月5日\n\n\n6.\t选择住院医院的标准，如果你能选的话：1月5日\n\n\n7.\t从流感到肺炎，不是小病，是生命保卫战：1月5日\n\n\n8.\t如何买达菲：1月5日\n\n\n9.\t心电监护仪，没他真不行：1月7日\n\n\n10.\t救护车费用：1月8日\n\n\n11.\tICU开销：1月8日\n\n\n12.\t人在ICU，你借出的钱能收得回来吗：1月8日\n\n\n13.\t插管前，说出遗言：1月11日\n\n\n14.\t人工肺（ECMO）费用：1月11日\n\n\n15.\t为亲属上人工肺（ECMO），你的决定遗漏了什么？：\n\n1月11日，1月18日\n\n\n16.\t医生不会告诉你的人工肺（ECMO）信息：治愈概率、愈后情况、治疗时间：1月13日\n\n\n17.\t人工肺（ECMO）与脑溢血和血栓：1月13日\n\n\n18.\t人工肺（ECMO）与谵（zhan）妄：1月18日\n\n\n19.\t输血不是花钱就能有，互助献血操作流程：1月13日\n\n\n20.\t大医院转小医院，为什么会这样：1月22日\n\n\n21.\t肺移植：1月22日\n\n\n22.\t远程重症病人救护车运输：1月22日\n\n\n23.\t担架病人搭乘民航班机规定：1月22日\n\n\n24.\t远程重症病人医疗飞机运输（实现小目标后入）：1月22日\n\n\n25.\t民航关于携带骨灰的规定：1月23日\n\n\n26.\t亲人过世，通知殡仪馆，远离太平间：1月23日\n\n\n27.\t开具死亡证明，你需要的证件：1月24日\n\n\n28.\t为遗体穿衣，谁会帮你的第一次：1月24日\n\n\n29.\t火化流程：1月24日\n\n\n==========================",
			"added": 1518439342,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 9,
			"title": "您的限额将要用完，请到站务版块发帖要求增加限额",
			"body": "您的限额将要用完，请到站务版块发帖要求增加限额，站长 p2p 或者超级版主看到会处理，谢谢！\n（超级版主： @nekocross @weakish @lmath @leaflet @polar @yurichard）",
			"added": 1518440947,
			"parent_topic_uri": "14_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 10,
			"title": "洪水學的起源",
			"body": "军机处\n在可以预计的未来，世界需要黑水公司、德纳尔雇佣兵、黑龙会一类组织。#圣殿骑士团##战争的非国家化#\n\n深改组就是军机处，目标只能是未来五到十年。匪谍渗透者与爱国卢布党养兵千日用兵一时，正为红衫军劫持政权准备，指望西方反应迟钝，造成既成事实。2016、2020是最后、最好机会，此后机会之窗关闭。犹如1945-1955窗口关闭，数十年不会再有。决断时刻就是长枪党用武之地，缓则不及。\n\n>删除\n\n2014-03-16 21:50:49 Apollonius\n\nhttps://medium.com/@LiuZhongjing/%E6%B4%AA%E6%B0%B4%E5%AD%B8%E7%9A%84%E8%B5%B7%E6%BA%90-e7c3eb17498f",
			"added": 1519653238,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 11,
			"title": "WebRTC bug 泄漏 VPN 用户的真实 IP",
			"body": "安全研究员 Paolo Stagno 测试显示，23% 的 VPN 方案仍然会受到 2015 年 1 月披露的一个 WebRTC bug 的影响，泄漏客户的真实 IP。WebRTC 是一个为浏览器和移动应用提供实时通信功能的开源方案，被现代浏览器如 Brave、Firefox、Chrome、Opera 和 Vivaldi 等默认启用（Tor 浏览器默认禁用）。他编辑了一个电子表格，记录了约 200 种 VPN 和代理服务的 IP 泄漏情况（许多记录是网友提供的）。他还发布了一个 POC，让用户自己检查 VPN 的 IP 泄漏。他给出的权宜之计是禁用 WebRTC 和 JavaScript（或部分 js 功能）。\nhttps://www.solidot.org/story?sid=55977",
			"added": 1522330909,
			"parent_topic_uri": "10_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 12,
			"title": "ZeroNet最新版本Rev3402，支持传输端口随机化，进一步提高抗封锁能力",
			"body": "ZeroNet最新版本Rev3402，支持传输端口随机化，进一步提高抗封锁能力。下一步会加进流量混淆。\n更新地址：http://127.0.0.1:43110/ZeroUpdate.bit/\nhttps://twitter.com/ZeroNet_Fans",
			"added": 1523098176,
			"parent_topic_uri": "8_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 13,
			"title": "【洪水严肃文学】肉",
			"body": "阿姨：八个大大或Comintern会杀掉百分之五的精英，饿死百分之十到百分之三十三的劳动阶级，但有能力保证残余人口的生物学存在，也就是说比东亚传统秩序强。大洪水会消灭百分之十到百分之五十的精英，饿死或通过吃人肉方式消灭百分之三十至百分之八十劳动阶级。\n\n--------------------------------------------------------------------------------------------\n\n\n少年饥饿的在荒漠中行走，一路向西。\n\n父母一大早就让他快走，告诉他要往西，“想活命！往西去！”被饿的说不出话的父亲挤出几个字，母亲颤颤歪歪的给他背上了包裹，烂的水唧唧地眼里闪着泪花。父亲又挤出几个字“给你，救命的！”\n\n\n饥饿在去年开始就席卷了家乡。莫名其妙的就没有东西吃了。\n\n少年不想离开父母，但是父亲的眼神坚定而决绝。\n\n只是临走，也没和姐姐道别。昨天，姐姐还坚持把不多的糠面和野树皮分给他一半。\n\n他拖着浮肿的腿不停地走，父亲告诉他往西走就能活命，可这这西边是荒漠，荒漠再往西走是巍峨而且不知名的群山。\n\n少年抬起头看看天空。太阳用炙热的光芒烤着大地，阳光刺的人睁不开眼。一群黑色的乌鸦尖叫着向他家乡的方向飞去。\n\n少年走了不知多久。饥饿感缠绕着他。久未正经进食的胃泛起一阵阵酸水，带着酸味的涟漪，顺着神经传到脑子里，引起一阵眩晕。\n\n少年实在是累了，便坐下来休息。 他把包裹从背上取下来，抱着包裹贴着鼻子闻了闻，一股诱惑的肉香味从包裹里暗暗的散出来。他猜到这里面是肉，但是，他不能打开，这不到救命的时候。他只道一旦打开他就会把这肉狼吞虎咽的吃完，这暗暗的肉香目前是他精神的动力，刺激着他的嗅觉和唾液的分泌。每到眩晕的饥饿无法忍受的时候，他就使劲地闻一闻。这能给他一种暗示，他因为有这肉，便还有一线生机。\n\n他想不明白父母让他走的原因。已经吃了两个月树皮的父母今早还能搞到肉。这令他大惑不解，既然父母能搞到肉，那饥饿的境遇应有所好转。但是父母今早又是如此的急迫，以至于连姐姐也没来得及告别。\n\n少年环顾四周，这茫茫的大漠不知何处是尽头。远处有几处羊的头骨，正阴森森的盯着他。\n\n“要是你是一只真的羊就好了，那我就可以吃掉你了，兄弟”，少年有气无力对着羊头骨说。羊头骨没有理他,依然阴森森地盯着他。\n\n他又抱着包裹闻了闻，肉香似乎比刚才来更浓烈了些。也更加诱人。口腔里苦涩的唾液又分泌了一些，他使劲地咽了咽口水。\n\n是什么肉呢？他掂了掂包裹，挺重，肉的分量挺重。\n\n牛肉？绝对不是。少年能分辨出牛肉的特殊香气。他的家乡很少吃牛肉，长这么大，吃牛肉的场景用手指头都能数出来。他记得第一次吃牛肉是2008年，乘着奥运会的东风，打工回家的父亲破天荒地地从外面带了一块美国牛肉。美国牛肉的肉是红色的，软软的，带着一股好闻的土腥味。那味道，真香。与这牛肉一起的还有那年过年的记忆。那年父亲给全家换了闪闪发亮的新家具，还破天荒的给姐姐换了新衣服，其实在少年的记忆里，2008年，每天都是热热闹闹闹的，那时日子有盼头。\n\n猪肉？少年又想。不对，不是猪肉。猪肉有一股骚臭味。因为猪是吃屎长大的。他讨厌猪这种睡了吃吃了睡不但如此吃的还是屎的动物。这种动物的肉油腻而恶心。以前学没上好挨打的时候，他就往猪身上撒气。他用苕竹抽打猪，往猪身上吐口水。但是猪不会理他，依然快乐的哼哼着在泥里打滚，吃着屎。\n\n但是这肉有一股淡淡的香味，绝不是猪肉。这香味自然而又沁人心脾，熟悉而又陌生，让少年觉得亲切。\n\n少年情不自禁的回想起姐姐。他从小和姐姐一块长大，姐姐在某种意义上扮演了母亲的角色。从小父母出去打工，姐姐便又当姐又当妈的。姐姐有一双巧手，给他编织了上学的书包。\n\n姐姐是世界上最漂亮的女人。白皙的皮肤，圆圆的脸，两柳辫子整齐地搭在肩上。人稍微有点胖，丰满而不富态。\n\n姐姐是最辛苦的女人。每天早起干活，喂猪，做饭，还要盯着他做功课。学校里受了欺负，姐姐替他出头。\n\n姐姐是最委屈的女人。少年记得父亲在一个寒冷的冬天从北京失魂落魄地回来以后，脾气就变得特别差，还经常酗酒，赌博。输了后就拿姐姐撒气。\n\n少年回忆起和姐姐在一块的日子，咧开嘴笑了，眼角渗出一点泪花。\n\n那就只可能是羊肉了。少年一辈子也没吃过羊肉，不知道羊肉是什么味道。这种带着清香的肉，说不定是羊肉。\n\n他看着远处的羊头骨说，兄弟，我可能一会儿要吃你兄弟了。\n\n他想起身继续走，确发现自己怎么都站不起来了。想站起来，但是用力就感觉到一阵眩晕。双腿也一点力气都没有。\n\n少年试着站起来几次，双腿好像没有知觉了一样，一动不动。\n\n少年惊恐了起来，走不了路，在这里就只有和那羊骨做伴了。\n\n亲切而熟悉的肉香诱惑着他。\n\n打开吧，他心一横，当鬼也要做饱死鬼。\n\n他颤抖着用手打开包裹，一股浓烈的肉香钻进了鼻孔。包裹里是一条小羊腿，他觉得。他捧起肉块，贪婪着闻着肉香，两眼突然一黑，晕了过去。\n\n--------------------------------------------------------------------------------------------\n\n因布拉欣率领着黑军先锋部队从大漠出发，到大漠另一边去。听说，王皓宸的部队在大漠的那一边，他必须消灭王皓宸。\n\n快要走出沙漠的时候，前方的侦查皮卡报告说，救起了一个晕倒的孩子，手边从打扮和相貌上来看，应该是从王皓宸流民军占领区那边来的。说不定这孩子能知道王皓宸流民军的情况。\n\n因布拉欣下令一定救活这个孩子。\n\n军医不一会儿拿着孩子的包裹跑来见因布拉欣。\n\n军医报告说，孩子已经苏醒，脱离危险了。并且说孩子晕倒是因为饥饿和脱水。\n\n因布拉欣点了点头，我们的情报有报告说那里有饥荒。\n\n“没错，因布拉欣大人，我想您完全正确，那里确实发生了饥荒，而且十分严重。我从孩子的包裹里发现了这个。”军医拿出包裹里的肉，“这是一段女人的大腿，是人肉”。\n\n\n\n",
			"added": 1523376212,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 14,
			"title": "刘仲敬：中国外交的顾维钧时代",
			"body": "https://medium.com/@LiuZhongjing/%E6%96%B0%E6%98%A5%E7%A7%8B%E6%99%82%E4%BB%A3%E7%9A%84%E7%A7%A9%E5%BA%8F%E8%88%87-%E8%AD%98%E6%99%82%E5%8B%99%E8%80%85-%E7%9A%84%E4%B8%96%E7%95%8C-1510c8827ca8\n\n从拿破仑战争到第一次世界大战，大英帝国统治的世界秩序处于最佳竞技状态。威斯敏斯特不喜欢正规帝国及其统治成本，更愿意建立以私有财产和自由贸易为基础的世界体系。皇家海军只需要对极少数秩序破坏者实施重点打击，就能廉价地保障文明和进步。新春秋时代的霸政体现封建遗风，霸主不是唯一和独断的。欧洲维持势力均衡，英国独霸海外。在此期间，挑战者不断涌现。第一次世界大战将军国主义和总体战的恐怖撒向全世界，结束了欧洲的春秋时代。当欧洲导师似乎自身难保的时候，很难指望亚洲学徒持之以恒。中国和日本这两个半心半意的追随者相继抛弃了立宪政体和国际协调的原则，迎接东亚的战国时代。随着民国法统和条约体系的瓦解，旧日的风云人物必须做出选择。有些名士以节操自诩，像章太炎一样自居“中华民国遗民”。识时务者则迅速摇身一变，协助新时代的弄潮儿破坏旧秩序。顾维钧属于后一种人，他的《外交演讲集》就是识时务的证明。\n\n顾维钧是哥伦比亚大学的法学博士，属于那种原本能够融入西方的极少数精英，在中国的地位相当于波罗的海贵族在俄罗斯。如果他的祖国是爱沙尼亚式的边缘小邦，他的努力早已将祖国纳入西方民主大家庭了。在这种情况下，后来的宪法制定者和外交家除了萧规曹随以外，基本上无事可做。然而作为内陆大国的外交家，他的工作注定不会有结果。这不是个人才能的问题，而是形势比人强。他自己并不为此感到遗憾，因为他没有执着的追求目标和坚定的原则性。世界变了，他也会随波逐流。沧浪之水清兮，可以濯吾缨。沧浪之水浊兮，可以濯吾足。\n\n1912年，他在哥伦比亚大学毕业。这时，奠定民国宪制的南北和谈刚刚以妥协收场。老外交家唐绍仪组织举国一致内阁，邀请顾维钧回国。顾维钧下车伊始，就出任袁世凯的英文秘书。如果民初的公府秘书长是小内阁总理，大总统英文秘书就是小外交总长了。袁世凯信任内廷，通常是超过信任阁臣的。顾维钧本来很可能感于知遇之恩，变成袁世凯的私党，然而私人关系改变了这一切。他娶了唐绍仪的女儿，就变成了唐绍仪的党羽，而唐绍仪和袁世凯很快就闹翻了。唐绍仪和袁世凯的冲突与其说是利益问题，不如说是预期错位的心理问题。袁世凯觉得唐绍仪是北洋自己人，应该不分彼此。唐绍仪觉得自己是唯一能够协调全国的人，请示大总统只是形式。双方都觉得对方不仅跋扈，而且不可理喻。多年好友一旦反目，仇恨比原来的敌人更深。在以后的南北和谈中，北洋系宁愿接受伍廷芳主持举国一致内阁，也不愿意唐绍仪复职，因为伍廷芳一直是南方的人，无所谓背叛不背叛，唐绍仪却是自己人，吃里扒外实在难以忍受。顾维钧为人审慎，在回忆录中没有明言自己当时的立场；他的岳父和国民党正在密谋反对袁世凯，而他自己至少在表面上仍然忠于袁大总统。\n\n民国取代大清，主要意义就是抹去庚子之乱和《辛丑条约》造成的恶果，逐步恢复她在文明国家俱乐部内的正常地位。顾维钧和北京的外交官团体都很清楚，日本已经先走了几步，占据了有利地位。甲午战争到日俄战争构成远东体系的第一个窗口期，确定了二十世纪初叶的东亚格局。基本格局具备亚稳态的性质，在下一次大动乱的窗口期来临前，无法通过强度一般的冲击打破。远东体系取代了李鸿章时代的内亚体系，扮演世界体系在东亚的分支。日本在远东体系内扮演大清的核心角色，将大清降低到类似蒙藏在内亚体系中的地位。庚子战争是一次演习，日本向欧洲列强证明自己的文明资格。英日同盟是优等生的奖品，大英帝国认证了日本的东亚盟主资格。日俄战争是一张委任状，因为东亚盟主在当时的使命就是堵死俄国南下的道路。只要大英帝国继续主宰世界，日本就会继续担任英国在远东的代理人，条约体系就会安如磐石。在这种情况下，中国没有行险侥幸的机会。她只能指望日本采取过火行动，激怒大多数列强。在《二十一条》的交涉中，这样的机会似乎出现了。\n\n北京政府内外充满了密谋团体和投机分子，谁都不知道当时的阴谋小道上到底发生了什么。后人只知道顾维钧卷入了泄漏《二十一条》的活动，然而此事并不足以表明他在当时政治斗争中的角色。各方都有可能泄漏谈判内容。唐绍仪和国民党可能希望密约泄漏，促使日本和袁世凯决裂，支持他们讨袁。袁世凯也可能希望密约泄漏，促使列强反对日本。老谋深算的英使朱尔典深知中国人阳奉阴违的手腕和美国人理想主义的冲动，并非不可能不着痕迹地鼓励中国人泄密，刺激美国人跳出来维护中国主权和领土完整。这其实是中国人和英国人都想做，却都不愿意公开得罪日本人而不能做的事情，在顾维钧泄密后不久果然就发生了。接下来的事情即使在弥漫魔幻色彩的东亚，也属于荒腔走板的范围。中国宣布接受《二十一条》的前四部分，美国急忙发表声明：如果中日签署有损于中国合法权益的条款，美国政府一概不予承认。顾维钧不久就奉命出使美国。显然，北京的实力人物认为：他做的事情无论有没有让其他方面满意，至少已经足以让美国人高兴。\n\n巴黎和会是顾维钧外交生涯的高峰，塑造了他以后的外交风格。这种风格与其说体现了他个人的性格，不如说体现了他所代表的国家。他越过国际惯例和外交官俱乐部的默契，诉诸舆论和群众情绪。事实上，他将总体战的原则引入了外交领域，将绅士的交涉变成了群众的斗争，对此后国际体系的崩溃负有极大责任。根据契约和产权至上的十九世纪外交原则，他的要求纯属无理取闹。中国没有能力对德国太平洋舰队构成任何威胁，后者只要高兴就能夷平大沽口。英日联军歼灭了德国舰队，否则后者可能会切断智利硝石的海运线。日军攻陷了青岛，英国人的支持是象征性的。协约国在1915年承诺，战后将青岛和德属太平洋各岛划归日本。中国最后参战时，并没有取得协约国的任何承诺，而且也没有任何值得一打的战争了。日本提供贷款，为中国训练参战军。结果中国既没有出兵，也没有还钱。最后，在瓜分战利品的时候，中国出现了，振振有辞地要求日本交出战利品。\n\n如果协约国是一家私人企业，中日两国是企业的员工，太平洋战争是效绩指标，青岛是年终奖，那么董事会的裁决是没有任何悬念的。十九世纪的外交俱乐部差不多就是奉行这种原则，日本就是从这家学校毕业的。《马关条约》和《辛丑条约》是日本的毕业证书，第一次世界大战是她加入董事会的最后考验。在她看来，威尔逊总统的世界大同和集体安全理论等于要求公司改组为施粥站，将按劳分配改为按需分配，在功臣和无赖之间讲平等，其混账程度已经仅次于布尔什维主义的明火执仗。欧洲列强其实也是这么以为的，但他们没有列宁那种公然赖债的勇气，不敢得罪美国债权人，至少在口头上不敢反对。\n\n对于顾维钧来说，这就足够了。他抓住国民外交和民族自决的新学说，将外交家变成了宣传干事，绕过他的西方和日本同侪，诉诸全世界国民和媒体。他的鼓动虽然成事不足，至少败事有余。他没能迫使日本交出青岛，但至少已经将山东问题从铁案弄成了悬案。这其实就是中国的胜利和日本的失败，因为中国在1915年是连要求的资格都没有的，而日本根本没有谈判的必要。从绅士俱乐部的角度看，这种做法极不费厄泼赖。如果各国外交官都这样做，信用和默契还有什么价值？条约无异于废纸，君子协定就更不用说了。我们不要忘记：在第一次世界大战以前，条约根本不存在监督问题。外交官要么不做承诺，否则就必须维持信用。十九世纪国家的契约精神如果跟一战后的中华民国相同，债权人的舰队就会打进门。埃及和摩洛哥之所以丧失主权，就是因为他们的君主喜欢借债不还。然而因为最大债权人美国反对，这种做法突然行不通了。几百年来，债务人的地位第一次比债权人有利。\n\n威尔逊主义产生了一项长期后果，大概是威尔逊和顾维钧都始料不及的。在二战以后的国际交涉中，监督问题比谈判内容更难解决。原因其实很简单，抵赖比守信更有利。苏联和中国是抵赖外交的始作俑者，也是最大受益者和最终受害者。顾维钧的成功给中日两国发出了错误信息，埋下了卢沟桥、珍珠港和板门店的伏笔。日本人读到的信息是：西方背叛了游戏规则。无论日本如何努力，如何遵守规则，他们都不会允许日本加入董事会。日本如果想要争取平等地位，只能武力推翻整个游戏规则。中国人读到的信息是：公理战胜的时代开始了，也就是说弱者可以零成本分享强者的战利品。不利于自己的条约义务不必遵守，不会付出任何代价。如果这些设想都没有实现，那就说明威尔逊主义和殖民主义一样虚伪。中国如果想要争取平等地位，只能武力推翻整个游戏规则。这些解释将日本驱向二战，将中国驱向二战和冷战。\n\n蒋介石在北伐以后的主要成绩，就是将上述认知付诸实施。顾维钧在在北伐以后的主要成绩，就是为蒋介石收拾残局。革命外交的初衷就是不付代价地废除条约体系，证明北洋政府的审慎是卖国和愚蠢的，证明北伐的合理性，结果却付出了更加惨重的代价。章炳麟以中华民国遗民自居，拒绝承认黎元洪大总统以后的历届政府，称孙文为魏忠贤，视北伐的成功为民国的灭亡，幸灾乐祸地表示国民党一定不会有好下场。因为建设和改革都需要时间，而国民党已经没有时间了。如果退守内地，恐怕再也没有机会回来。汪兆铭承认他的正确性，表示中国自强至少需要三十年时间，然而，他在这里陷入了国民党人不可避免的自相矛盾。如果三十年的和平必不可少，那么打倒帝国主义的革命外交就是错误的，北洋政府的审慎根本不是卖国。北伐本身就是导致远东势力均衡体系瓦解的根源，取消了西方列强在亚洲大陆的条约权利，也就消除了列强干涉远东事务的动机，将东亚留给苏联和日本逐鹿。国民政府破坏了条约体系，也就丧失了条约体系的保护。北洋政府之所以没有遭到侵略，主要不是因为自己强大，而是因为列强的干涉和条约体系的保护。国民党撕毁条约所得的利益，就像蠢人违背法院和警察意志而吞没的赃物，随时可以被其他违法者黑吃黑，因为后者知道警察不会保护他。\n\n顾维钧在国联和西方的游说活动大体上重演了巴黎和会的故事，产生了很大的舆论宣传效果，在国内造成了零成本收回利权的幻想，结果最后完全落空。他的演讲和文件清楚地表明，他在这段时间的工作重点根本不是对外。他积极迎合北伐以后的国族构建主张，打击所有恢复民初五族宪法主体的企图，实际上排除了以和平方式恢复条约体系的一切可能性。以他的才具，不可能不知道自己在做什么。最合理的解释就是：他认为国民党对北洋遗老不大信任，有必要表现尽可能坚定的立场。至于外交，无论怎样都会失败的。中日双方都不愿意恢复条约体系，都想牺牲对方而获得条约体系没有给予的利益。列强不想为秩序破坏者火中取栗，苏联则迫切希望促成中日开战。在这种情况下，任何外交手腕都没有成功希望。只要失败的责任不会落到自己头上，他就满意了。随着抗战的爆发和中苏实质联盟的形成，他的外交活动基本上丧失了意义。他完全清楚这样一来，苏联就占据了渔翁得利的有利地位，着手跟共产党代表邓发秘密接触，但没有达成任何实质性协议。他审慎地删除了密谈的纪录，却忘记了留在哥伦比亚大学的档案。他明显像胡适、汪兆铭、章太炎、宋庆龄、储安平、罗隆基一样，看清了抗战会给蒋介石带来怎样的下场；同时也看清了胡适和汪兆铭明白、储安平和罗隆基却不明白的事情，投靠胜利者比投靠失败者更危险。\n\n汪兆铭觉得和谈可以成功，因为日本人占领内地的动机不比以色列占领加沙的动机更多。问题在于东北。蒋介石无法夺回东北，又不肯像十九世纪的战败国一样承认失败，让东北变成另一个台湾，于是就乞灵于类似巴解组织和真主党的手段，依靠违反战争规则的袭击破坏来骚扰日本。日本于是在华北和东北之间建立隔离地带，犹如以色列在南黎巴嫩建立保护加利利的缓冲区，从《塘沽协定》到卢沟桥事变的一系列冲突都是因此而起，并不是日本贪图贫困而且无法开发的中国内地。中国如果愿意恪守停止袭击骚扰的承诺，日本人根本无需以战迫和，九一八策划者石原甚至主张连缓冲区都放弃。然而蒋介石并不像汪兆铭想象的那样蠢，他知道这样的和平意味着东北的永久丧失。东北亚的经济发展中心在东北，华北只是外围原材料和劳动力基地。时间对蒋介石不利，随着东北的迅速发展，东北的向心力没有增加，华北的离心力反而增加。他只能在东北产生特殊共同体意识以前，抓住最后的机会窗口孤注一掷。他不能指望胜利，只能指望两败俱伤。两败俱伤就是苏联外交的胜利，渔翁得利的第三者继承亚洲大陆。每个人都看清了形势，得到了自己应该得到的，失去了自己不该奢望的。汪兆铭这样的性格，自然不愿意活到亲眼看到结局来临的时刻。然而顾维钧不是汪兆铭，并不在意国民党本身的存亡。他最终决定留在蒋介石一方，只是因为其他的选择对他个人都更危险。\n\n冷战开始后，顾维钧继续为蒋介石政府从事对美交涉。然而，他的黄金时代实际上已经结束了。技术和通讯条约的进步大大削减了外交官的自由裁量权。民主的简单化倾向和冷战的十字军精神剥夺了外交官的大部分政策影响力，日益将他们降格为办事人员。顾维钧主要依靠长期积累的资历和声望，实际负责的工作已经没有什么回旋余地，其实由一般业务人员经办也没有多大区别。他亲身经历了这种变化，早年的成功本身就是促成这种变化的力量之一；但他有足够的明智和审慎，知道怎样区分力所能及的事情和无法抗拒的事情。他很少做出错误的选择，善于掌握必要的分寸，不仅限于外交方面，因而得以享受尊荣体面的晚年。他留下的回忆录犹如他本人：绝少说错什么，却从没有说出他知道的全部真相。",
			"added": 1524229536,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 15,
			"title": "【即时文摘】厉害了，川普的国（陶杰）",
			"body": "总统川普闪电出手摧砸中国的电子企业龙头“中兴”，更行政宣召“华为”，还剑指中国阿里巴巴。因火力猛烈，连“厉害了，我的国”一片也在大陆全线下蔽，此政治宣传片内有大量夸耀中国高科技超越美国的画面唱词，据说为勿让美国人有打中藉口，暂时撤退。\n美中本来夫妻关系，好端端的怎会搞成这样子？四周许多爱国的中国人情绪大受打击，微信群组，喧然激躁。我效法三岁的宣统皇帝上朝登基时大哭、身边劝慰小皇帝的前清太监：不要哭，快完了，快完了，听说“特朗普”最多只做一任，更没有终身制，还有最多三年就下台了……唯无显著成效。\n美国眼红中国强大，如果你爱国，这一点一定要相信。然而中兴被美国抓获，自己也很蠢：违反协议，向美国撒谎，将美国提供的芯片和电子软件共三成，转售伊朗北韩，内部文件传达，直认不讳，还将“伊朗”一词改以YL（汉语“伊朗”拼音简称），以为用密码，美国人看不懂，此不幸其一蠢。\n又出于中国式崇洋，重金聘用了一名美国犹太人做律师。犹太人必终极忠诚以色列，以色列与YL是世仇，用钱可以买到菲律宾总统的谄媚，但犹太人的民族品格不同。香港有大把爱国并美籍的律师，中兴一个也不用，非要以为有一张犹太白人脸孔夹一只手提包跟在炎黄CEO后面，去纽约开会，感到十分的威水，象征中国人民站了起来。岂料犹太律师将文件通报美国，此惜其二蠢，错误极为低级令旁观者感到难过。\n中兴倒下了，华为也吓得不敢声称5G进美国，只剩马云了。马大师很豪气，警告特帝，你不搞我，我可以为你美国制造一百万职位；你坚持不搞，我承诺还可加到一千万，有如当年邓小平承诺“港人治港，高度自治”的“如果五十年不够，还可以加到一百年”之慨。Well，希望川普再相信一次吧。\n不过在电影“功守道”里的马云，一口气击倒了甄子丹、李连杰、吴京，川普仅一纸老虎，马大师一定赢。\n面对此严峻之战，中国有人建议，不妨断绝稀土出口美国，瘫痪全美甚或全球电子产品，绝地反攻。香港也有好事者向中方建议：号召美国唐人街的唐人起来独立自治。\n断绝稀土出口，会将美国人惹毛，川普一怒之下，宣布中国高官低干及其子女在美房地产与现金户口银码总额，即时没收，人即拘押。唐人街自治？美国即可宣布褫夺这等“唐人”的绿卡美籍，驱逐出国，顺便清理低端人口。\n你以为平时收钱去机场挥舞红旗欢迎胡锦涛来访美的这等美加华人，有此胆量？请勿逗我发笑。这个川普，很不靠谱，是个神经佬，玩女人搞中国什么坏事都干得出来。提这两个建议的，都想害我们习主席。\nhttps://hk.lifestyle.appledaily.com/lifestyle/realtime/article/20180421/58096431",
			"added": 1524751056,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 16,
			"title": "兽爷：疫苗之王",
			"body": "2001年，东北一家国有疫苗公司悄无声息进行改制。多年后再回首，人们才明白其中意义。\n那年的9月18日，上市公司长春高新旗下的长生生物迎来了两位新的股东——韩刚君和杜伟民。\n韩刚君用1932万元买下了长生生物30%的股权，成为第二大股东；他和杜伟民的合资公司则成为了长生的小股东。\n杜伟民是长生生物的销售总监。\n这笔交易几乎没人注意到。长生生物被放到聚光灯下，是在两年后了。\n2003年末，长春高新和长生生物的掌门人高俊芳把2000万打进公司账户，要将长生生物私有化。\n算下来，高俊芳的出价是每股2.4元；而当时多位竞标者表示，他们愿意出3元/股的价格。\n高俊芳很感谢他们的出价，然后拒绝了他们。\n这引起了漫天质疑，有人把低价贱卖国有资产的举报信寄到了市政府。但仍然没有阻挡高俊芳成为长生生物第三大股东。\n终于，高俊芳、韩刚君和杜伟民走到一起，他们手中握着长生生物的大半股份。\n2007年，韩刚君把自己的股份卖给了高俊芳，帮助后者成为长生生物的绝对控制人。\n十年后再回首，他们手中已经掌握了中国疫苗的半壁江山——最大的乙肝疫苗企业、最大的流感疫苗企业、第二大水痘疫苗企业、第二和第四大狂犬病疫苗企业……\n他们生产的疫苗，每天都源源不断，注入你和你孩子的身体中。\n1\n就在高俊芳顶着资本市场的唾骂，完成长生生物私有化的时候，韩刚君与杜伟民已经南下，他们盯上了刚刚拿到狂犬病疫苗生产资质的常州延申生物。\n很快，韩刚君与杜伟民以2000万元拿下了常州延申90%的股份，将其改组成为江苏延申，韩刚君担任董事长。\n杜伟民在加拿大远程完成了这一切。他这时已经拿到了加拿大绿卡，只要再待几年，他就能成为中国人民老朋友白求恩大夫的老乡。\n之后不到三年的时间里，韩刚君为江苏延申拿到了流感疫苗、气管炎疫苗、疖病疫苗的生产批文。江苏延申很快成为中国最大的流感疫苗供应商和第四大狂犬病疫苗公司。\n2007年10月，韩刚君和杜伟民已经准备好了上市资料。如果不是一次偶然的发现，江苏延申将会登陆资本市场。\n2009年3月，大连金港迪安狂犬疫苗在抽检中被发现造假，食药监总局马上对狂犬疫苗生产企业进行突击检查，江苏延申被查出五批产品涉嫌造假。\n食药监局发现，延申偷工减料、弄虚作假、逃避监管，疫苗抗原含量低于国家标准，达不到药效。\n北大医学部的专家将注射失效的疫苗总结为两个字——杀人。\n但这时，江苏延申的18万份疫苗已经流入21个省107个疾控中心，全部被注射进了病人体中。\n江苏延申表示，我们无能为力。\n没有召回、没有补偿。案件发生后，江苏延申因为生产、销售伪劣产品罪，被判处罚金三百万元，总经理和五名员工被判刑。\n董事长韩刚君和另一位大股东却毫发无伤。\n更诡异的是，江苏延申很快东山再起，仅仅半年之后，就获得了防疫部门160万人份甲流订单，价格超过亿元；不久又获得了甲流疫苗生产牌照。\n就在调查组的眼皮子底下，杜伟民把这个生产假疫苗企业的股份全部转让出去，套现两亿元，顺利退出延申。\n2\n杜伟民的眼前是一片星辰大海。\n根据一篇人物报道，2007年，杜伟民毅然变卖了加拿大的家产，放弃了入籍，带着妻儿回国了，重新投身疫苗领域。\n中国真是一片化腐朽为神奇的土地。在海外迷失了自己，回国就对了。\n不过，杜先生没有放弃加拿大绿卡和香港身份证。\n2008年开始，杜伟民悄无声息地在产权交易所吃下了深圳老国企康泰生物的大部分股份，控制了这家中国最大的乙肝疫苗生产商。\n深圳康泰的乙肝疫苗技术，来自于美国人的人道主义援助。1989年9月，美国默克公司以微不足道的700万美元向中国转让了全套工艺技术。\n杜伟民把当年重组江苏延申的手法用在了康泰生物的重组上，开始为上市铺路。\n疫苗企业上市，最大的障碍是产品种类单一，康泰多年来上市无功而返，就是因为只有乙肝疫苗这一种产品。\n很快，杜先生通过收购北京民海生物，让康泰的产品多样化。2012年底到2013年，康泰自主研发的三款疫苗——Hib疫苗、麻风疫苗、四联疫苗获准生产，先后上市。\n民海生物是怎么在短时间内获得三款产品的生产许可？\n北京高级法院的一则审判书显示，2010年到2014年间，国家食品药品监督管理局药品审议中心副主任尹红章收受杜伟民47万元，为民海生物的药品申报审批事宜提供帮助。\n除了加快新疫苗上市，杜伟民也让康泰的主打产品乙肝疫苗获得了新生。\n当年杜伟民还在长生生物做销售时，中国的疫苗市场基本被国有七大生物制品公司瓜分，互不侵犯。杜伟民瞅准时机，用拉低价格的方式抢占山头。\n他在康泰复制了这一手段，在政府的招标中，康泰用低价摆平了一切竞争者。\n乙肝疫苗单人份的出厂价格本来在15元左右，康泰直接报价6.9元，迅速拿下了国家免疫规划疫苗项目的大笔订单。对于竞标的研究所来说，这比它们的成本价还低，毕竟国家规定的出厂价都需要9.3元。\n2013年12月，康泰和杜伟民迎来了最大危机。在十天时间里，共有8名新生儿在接种康泰的乙肝疫苗后死亡。\n一个月后，食药总局和卫计委的调查显示，所有的婴儿死亡为偶合性死亡，疫苗质量没有问题，向康泰生物归还了生产证书。\n风波过后，康泰安然上市，市值从杜伟民收购时的6亿元飙升到现在的400亿元。\n3\n高俊芳、韩刚君与杜伟民三位疫苗之王，有太多共同点。\n他们对疫苗企业的控制和改造路径相似。瞄准的都是老牌疫苗企业，长生生物、延申生物和深圳康泰，背后都是中国国有的生物制剂研究所。\n他们以非常低廉的价格迅速入手，实现完全控股，然后在短时间内拿到多个疫苗生产牌照，为将来上市铺路。\n最重要的一点，这些企业所属的有关部门似乎完全没有意识到疫苗生产牌照的价值——疫苗的毛利普遍在80%以上。\n兽爷的好友你包叔说：\n康泰生物上市前的半年内，公司的股权在个人和机构之间进行了20多次倒手。\n深交所曾经质疑其中是否存在利益输送和国资流失，要求公司说明转让的原因及合理性等，但康泰始终没有详细回答这个问题。\n高俊芳则用同样的手法，把自己的儿子、老公、小姑子、外甥和侄女全部变成了长生生物的股东。\n2017胡润百富榜中，杜伟民以73亿元的身价位列第559位，高俊芳家族以51亿位列第820位。\n如果不是江苏延申的狂犬疫苗出了问题，韩刚君也该出现在这个名单上的。\n疫苗之王们都起于草莽，没有人知道他们的钱从哪来的。\n高俊芳入股长生生物的4000多万全部是自筹资金，当时上市公司的公告显示，她的月薪只有6000元。高俊芳说自己掏了200万，其余的钱一会说是亲友凑的，一会说是和银行贷款。\n杜伟民和韩刚君之前分别是江西省卫生防疫站和河南开封龙亭区卫生防疫站的普通员工。下海不过四五年时间，成了疫苗行业最重要的资本推手。\n都是天才。生子当如防疫员。\n4\n世界上最大的军火出口国是美俄英法中，联合国安理会的五个常任理事国。\n中国新闻事件最多的，也是这些疫苗之王们。\n2018年7月11日，长生生物内部的一名员工实名举报疫苗生产存在造假。国家药监局马上对长生生物进行飞行检查，发现狂犬病疫苗生产存在记录造假。\n国家药监局已要求吉林省局收回长春长生的药品GMP证书，长春长生主动召回有效期内所有批次的狂犬病疫苗。\n在对长生生物调查的时候，吉林食药监管局“顺手”对其两年前的违规行为进行了处罚。\n2017年11月，食品药品监管总局接到报告，在抽检中发现长生生物一个批次的百白破疫苗效价指标不符合标准规定，接种后可能会影响接种儿童的白喉、破伤风和百日咳的免疫效果。\n这时25万支疫苗已经全部销往山东，打入25万多名儿童的身体。\n8个月过去，吉林有关部门行动迅速，没收了库存的186支疫苗，对长生生物罚款300多万。\n186支，长生生物的库存真多啊。300万，处罚力度真大呀。\n于是很快有了第二次造假。\n短短三年时间，长生生物狂犬病疫苗的市场占有率，就从不到4%上升到28%，成为中国第二大狂犬病疫苗供应商，正在威胁行业霸主成大生物的市场地位。\n成大生物疫苗的报价是149元，长春长生的报价则是239元，而且还要比成大生物多打一针。\n生物制药行业的朋友说：\n兽爷发现，长生生物2017年销售费用为5.83亿元，也就是说25个销售人员每人的销售费用是2330万元，是康泰生物的4倍，是成大生物的47倍。\n兽爷就是租了个摊位卖煎饼的。这些数字是什么意思，我是一点都看不懂的。对了，城管来了，我要去搞好下关系去了。\n1989年，在默克公司总裁罗伊·瓦杰洛斯的主导下，乙肝疫苗生产技术被以极低的价格送给中国人民。他说，预防医学是最好的医学，对付传染性疾病的最好方法是预防它。\n那时，这位乙肝英雄应该没有想到，传染病可以预防，有些事却无法预防。\n穷病真的是没法治的？",
			"added": 1532253608,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 17,
			"title": "震惊！欧美华盛顿搬石头想砸谁？",
			"body": "文|沉雁\n\n \n\n川普那厮实在有点过分，五月底中美在华盛顿举行了贸易谈判，连一个记者会都不开，不痛不痒赐予了一纸空洞无物的联合声明，最后他还单方面撕毁了。\n\n但是，就在昨天（7月26日），同样在华盛顿，在签署完欧美类似日欧贸易共识声明之后，川普却召开了一个眉飞色舞的记者招待会（看下图张牙舞爪的川普）。川普这种看菜下饭的待客之道，我真是恨得牙痒痒的。\n\n川普神采飞扬地宣称，“自由世界进入了一个合作发展的新时代”。我就觉得奇怪了，没中国参与的合作也能叫合作？中国不承认咋整？你们的合作方案难道不需要中国提供？\n\n欧盟主席容克率队前往华盛顿，那也是两大顶尖经济巨头相见，川普准备了哪些菜系也不公布，难道就川菜？晚上有没有焰火和灯光秀？华盛顿临街的窗能不能开？是否给华盛顿居民发放了出去旅游的安抚费？目前尚没有探马来报道这些消息。\n\n日欧联合声明完了之后就是欧美联合声明，却把第二大经济体晾在一边，没有命运共同体的重要思想指导方向，欧美日的命运十分令人堪忧，前途十分渺茫。华盛顿这块石头刚刚举起，爆竹就响了，是有声警告也是严正抗议。\n\n欧美总共才8.3亿人口，只不过比第二大经济体的一半多一点点，人口红利从何而来？没有廉价劳动力的竞争优势支撑，我就要看看欧美能撑多久。\n\n8.3亿人口的欧美也才创造全球50%的GDP，也好意思拿出来炫？看看我们，我们仅仅14亿人口，其中的大部分中青年基本都是曾经非法出生的黑户，我们就创造了全球15%的GDP。世界看东方，东方看中国，小日本都不好意思与中国搭讪，只好混迹于欧美做提包撑伞的垫脚石。\n\n仔细瞧瞧华盛顿这块大石头，也就是所谓的欧美自由贸易共识的联合声明，前面讲了三段废话，就是磨叽磨叽零关税。这有什么好磨叽的，欧美本来就没有什么民族工业可保护的，还收关税有意思吗？中国是一个有着五千年文化的智慧民族，从四大发明到现在日益涌流的独家自主创新，不保护咋整？想偷我们的鸿茅专利和核心文化就明说，休想用零关税诱惑我们上当，中国人不是吓大了的。\n\n零关税仅仅是华盛顿大石头的一个幌子，这块石头的重心是在第四条，“双方同意共同致力于保护美欧企业，以便更好地避免他们受到不公平的全球贸易行为的伤害”。下面紧接着不指名道姓地说，“我们会与有着类似愿景的伙伴们紧密合作，推动WTO改革，去解决不公平贸易行为，包括知识产权窃取行为、强制性技术转让行为、产业补贴和国有企业造成的扭曲，以及产能过剩问题”。\n\n谁伤害了美欧企业？不妨问问，是谁决定不卖芯片的？是谁决定不买通讯产品的？是谁不卖尖端武器技术的？白花花的银子不赚，自己搬起石头砸自己的脚，最后还要说自己受到了伤害，岂有此理。是谁要逼着提高劳工保障的？是谁逼着降低进口药关税的？好端端的廉价劳动优势和医疗产业新增长点，不配合我们一道共同维护，反而还说自己受伤害了，没这么不讲道理的。\n\n啰哩吧唆一大串“不公平贸易行为”更是不知所云。\n\n“知识产权窃取行为”？我们没有，我们窃书都不算偷，我们这里谁敢侵犯知识产权都会被罚得倾家荡产。\n\n“强制性技术转让”？我们闻所未闻，我们这里上电视认罪都是心甘情愿的。\n\n“产业补贴”？川普刚刚给农民发了120亿的农业补贴，那是不是产业补贴？怎么到了我们这里就成了你们的“不公平贸易行为”？\n\n“国有企业造成的扭曲”？我们更没有，我们这里的国有企业都活得很光鲜，你们有几个国有企业是世界五百强？我们的五百强全是国有，这不正好说明我们的国有比你们还笔直吗？\n\n“产能过剩问题”？我们这里家家都有余粮，过剩不很正常吗？产能过剩说明我们现在生产能力绰绰有余，这是我们工业经济兴旺发达的标志。\n\n说到底，欧美华盛顿搬石头，其实就是嫉妒我们富起来了，自己好吃懒做不发奋努力，总想巡幸姿势来碰瓷，为自己经济不景气找遮羞布。本想搬起石头砸我们，但我们嗤之以鼻，还不是最后自己找绷带缠自己的脚。",
			"added": 1532736296,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 18,
			"title": "[小说连载]重生之我是习近平",
			"body": "来自品葱\n作者： （网名）勃列日涅夫  中央党史研究室 研究员\n\nhttps://pincong.rocks/article/7435\n\n序章-少年平娃的烦恼\n\n2049年10月1日，北京，中华联邦共和国临时最高法院宣读了对前中共中央总书记习近平的一审判决书。法官以“侵犯公民人身权利、民主权利罪”“扰乱市场罪”“侵犯财产罪”“妨碍司法罪”数罪并罚，判处习近平无期徒刑，剥夺政治权利终身。\n被告席上，年过96岁的习近平瘫坐在轮椅上接受了这一审判。即使他内心里绝对是不愿接受的，但他也没有任何余力来向这个判决抗争了。这场世纪审判通过网络在全世界进行了直播，没有一个观看直播的人能把这名满头白发、眼神涣散、表情呆滞且脖子歪向一边，看上去已经命不久矣的老人和当年那个“定于一尊、一锤定音”，被称之为“毛泽东二世”的大独裁者联系起来。庭审结束后，各地举办了庆祝活动，中华大地上，不论是年轻人、中年人还是老人，纷纷扮成小熊维尼、格萨尔王等经典乳包形象，举着写满“庆丰话”的标语上街游行，彻底释放了几十年来心中积攒的怨气。\n此时，在陕北农村梁家河，电视机前观看直播的小学生六年级生平娃并不能理解，为什么大家对这个九十多岁的可怜老人抱有这么大的恨意。平娃所生活的陕北农村梁家河，当年就是因为沾了习近平的光，而成为中国首个村级直辖市外加特色社会主义实验区。这个村的新生儿童名字里往往都有一个平字，平娃这个小名就是这么来的。即使在经济危机最严重的本世纪40年代，这个农村受到的影响也不是那么大。有这层利益关系在，虽然平娃对习近平的六次连任也有微词，但每天用华为7G手机上网的他也明白，中国经济确实已经到了奔溃的边缘，再不改革，离亡国之日不远，但他更不支持北京、上海的大学生占领天安门广场、冲击人民大会堂和市政府、沿街破坏摄像头、“装修”墙上粉刷的标语甚至对一些共产党人进行“私了”的暴力示威行为。平娃依旧认为中国低素质的人实在是太多了，同时还有那么多境外反华势力、分裂势力在蠢蠢欲动，因此西方民主制度并不适合中国，再说了，民主之后就能把民生问题都解决了？平娃看不起这些自暴自弃的“废青”大学生，他的梦想是考上公务员，只要每个人尽自己的一份力，有一分热，发一分光，这个国家未来一定能变得更好。\n但是事态的发展远远超乎了平娃的预期，中共当局没有足够的维稳经费镇压此起彼伏的示威罢工运动，习近平也因为心血管疾病发作而住进了301医院，党内反习势力趁机夺权，为了安抚示威群众，中共下令开始政治体制改革，本意只是装装样子，但中共的“假改革”反而成为了更大规模示威运动的导火索。最终在军队和警察全部倒戈后，中共彻底失去了对中国的控制，34个省级行政单位先后宣布要通过公投进行地区自决。大部分公投独立后的地区组建了大中华自治省联合体，新疆、西藏和台湾宣布独立建国。2049年6月4日，各自治省代表、民主运动人士在在天安门广场，宣布中共为非法政党，中华人民共和国解体，并呼吁各省人民组建中华联邦共和国。同月，各省代表、民运人士于北京召开了第一届中华大陆会议，会议上以刘晓波先生的《零八宪章》为蓝本制定了《中华联邦共和国2049年宪法》，宣告了中华联邦共和国的成立，并对新疆、西藏、台湾的加盟持开放态度。\n根据宪法，新成立的中华联邦共和国立法机构迅速通过了《大中华地区人权与民主问责法案》与《共产党官员财产处理法案》，并和美国等国家展开合作，立即开始清算那些十恶不赦的共产党官员。一桩桩冤假错案被揭露，一个个政治犯、良心犯被平反，那些位极人臣的共产党官员则纷纷沦为阶下囚，等待他们的是全国人民的审判。\n但是目睹这一切的平娃却怎么也高兴不起来，平娃还没有体会过民主自由的好处，他只知道他的生活已经因为这民主、自由而被毁掉了。梁家河因习近平而闻名，也因此被示威者盯上，每天都会有大批示威者冲进村子，对习近平的“遗产”——图书室、知青井、沼气池等进行破坏。平娃的学校也停了课，早就到了该上中学的年龄的平娃的学历依旧停留在小学六年级。在平娃的眼里，这些示威者就如同鬼子进村，是赤裸裸的暴徒，是破坏他岁月静好生活的凶手。\n平娃觉得，这些示威者和他们讨厌的共产党并没有本质的区别，都是一路人，这些人掌权后，肯定会做出和共产党一样的事情。当然这些话，平娃是藏在心里，只有跟村里的玲玲说过。玲玲是村长的女儿也是平娃的同班同学。平娃对玲玲有好感，天天缠着玲玲聊天，玲玲出于礼貌会认真听完，然后总是笑而不语，说一些场面话回应平娃，甚至经常在闺蜜面前讲平娃的坏话，但平娃却总是天真的以为玲玲也对他有好感，对这一切浑然不知。\n于是，有一天，当示威者再次来到村子里破坏的时候，平娃叫来了玲玲，对着她说道“我要成为比习主席更伟大的主席，带领中国人民实现中华民族的伟大复兴”然后不等玲玲回话，便带着一身装备冲进示威者的队伍里，朝着示威者们大喊“我支持习主席，你们可以打我了”，果然被示威者的拳脚相加，最后无力反抗的平娃被丢入沼气池，正好突开了导气管，溅得他满脸全身都是粪。\n围观的示威者们都在狂笑，平娃从没有受过这样的屈辱。平娃从恶臭的沼气池里站起来，环顾四周，发现自己暗恋的玲玲居然也在人群中偷笑，此时的平娃彻底丧失了理智，他只剩下了一个愿望，就是让这些人死，于是他掏出了口袋里的打火机，在导气管破裂处点燃了火焰……\n\n第一章  平的围棋\n\n再次睁开眼的平娃发现自己躺在一间陌生的房间里，一缕阳光穿过窗户打在了平娃的床上，他坐起身，又躺了下去。\n“陌生的天花板。”\n得知自己并没有因为沼气池爆炸而死这件事似乎让平娃有点失落，想着自己马上会被提起刑事诉讼，下半辈子可能要在牢里度过，平娃更不愿意面对现实了，他用被子捂住自己的头，不让阳光照射在他脸上。黑暗之中，平娃又想起了玲玲，不知道当时在围观的玲玲有没有因为沼气池的爆炸而受伤，想到这，平娃忍不住流下悔恨的泪水，把手伸向下体，开始手冲。但没冲一会儿，平娃就感觉自己全身瘙痒，于是他一只手手冲，另一只手忍不住用力抓绕自己的头皮、耳根、阴部。\n这时候，有人推门而入。\n“羊奶来了！” 是一个陌生的中年女人的声音，平娃没想到会有人进屋，连忙放下握着下体的手，提起内裤。\n“这碎娃子在干撒呢，这是要闷死自己不成！”\n看到闷在辈子里的平娃，女人抬高了声音和语调，从声音中能感觉出她非常地着急，她放下手中盛着羊奶的碗，飞快得跑到平娃的床边，用力掀开了辈子。\n“你是谁？”\n完全暴露在陌生女人面前的平娃惊恐地朝着女人喊道。\n“嘿，这瓜娃子，睡了一觉连大姑都不认识了？”\n“大姑？”平娃回忆了一下自己大姑的样貌，和眼前的这个女人似乎并不相似。正当平娃想继续追问的时候，大姑发现了平娃身上新添了许多抓痕。\n“跟你说了多少回了，你身上都是虱子，就算痒也不能挠，越挠越难受。”\n女人强行把平娃从床上拖起，从床边的柜子里翻出药膏来，便往平娃身上的抓痕处抹。在涂药时，平娃才第一次仔细审视了一下这间屋子，家具装潢和梁家河完全不一样，完全可以用简陋、落后来形容，绝对不是2049年的产物，更像是影视剧里经常能看到的，大约是20世纪中期中国民居的样子。同时屋子的墙面上，贴满了毛主席的宣传画。\n难道我穿越了？平娃突然一下子挣脱这个自称是他大姑的女人，冲到墙上挂着的印着毛主席像的日历前。\n眼前的内容让平娃感觉毛骨悚然，因为日历上赫然写着今年是1968年。\n平娃又看向了旁边的镜子，镜子里是一张陌生又有些眼熟的脸。\n“我叫什么名字？”平娃朝女人吼道。\n“这瓜娃子，装神弄鬼的，自己名字都不知道了？”\n“我到底叫什么！”\n“你不叫习近平你叫什么。”\n……\n\n一周后，平娃治好了身上的虱子，大姑习秋英便写信联系了北京的习近平母亲齐心，说明了习近平的情况和一些反常的事情，习秋英担忧习近平是不是中了邪，希望齐心能带他去北京的医院检查一下，看看有没有其他什么疾病。\n过了一段时间，收到信的齐心便派人将习近平接回位于北京的家中。在前往北京的路上，“失了魂”整整一个月的平娃终于开始接受自己重生成习近平这件事。\n这一切不知道是哪位神的恶作剧，但既然让我成为了习近平，我就要利用这幅身躯做一番事业，玲玲，我要向你证明，我能成为一个比习近平更好的国家领导人，我比原来的习近平有更多的知识，我从知乎上学到了很多治国良策，只要利用这些网上学到的知识，未来一定可以突破美帝国主义的封锁，实现让中华民族伟大复兴的中国梦！原本的习近平做不到的事情，我都可以做到！\n抱着这样的觉悟，平娃一路上都在观察、学习这个时代的常识以适应这个时代。\n几经辗转，平娃回到了习近平在北京的家，是一位40多岁的妇人开了门，这就是习仲勋的夫人，齐心。\n齐心见到分别已久的儿子，很是激动，摸着儿子的脸就问了一大通问题。平娃没有习近平的记忆，只能来回说几句车轱辘话应付过去。等到齐心问道自己的精神问题，平娃解释道“这你是听大姑说的吧，我没什么事，好得很，你看我一天一碗羊奶，都吃胖了。”\n“看着是胖了点了，你原来那样子真是吓死我了。总之，没事就好，妈也没空再照顾你了，你是大孩子了，今后要自己保重。”\n“欸，怎么回事？”\n“就因为你爸的原因，妈过几天就要带着你弟弟去河南省的五七干校劳动改造，你的两个姐姐都已经下放到生产建设兵团了。”\n文革时期，习近平的父亲习仲勋被打为反党分子，目前正在北京卫戍区“监护”。因为没有和习仲勋“划清界限”，齐心和习近平的弟弟习远平作为其家属，都要下放到河南省黄泛区的五七干校接受劳动改造，而根据历史记载，习近平也即将接受号召，前往延安市延川县文安驿镇公社梁家河大队，也就是平娃的老家进行“插队”。得知马上就有机会看到过去的家乡是什么样子的，这让平娃很是激动。\n过了几天，在送别齐心和习远平后，平娃回到了北京二十五中上课。\n习近平原先就读的八一学校解散后，本应该上小学六年级的习近平被分配到了北京二十五中继续学业。\n一进学校，平娃就感觉到了一股肃杀之气，比起学校，这里更像是黑社会约架的地方。1968年，正是无产阶级文化大革命进行得如火如荼的时候，而平娃就读的北京二十五中就是北京红卫兵的大本营。平娃走进自己的班级，教室里的同学们没有人跟平娃搭话，都用鄙夷的眼神看着这位“反党分子”的儿子，而平娃甚至不知道自己的座位是哪一个。\n就当平娃不知道怎么办的时候，他突然发现，教室的一角，坐着一个气质和其他人明显不同的少年。少年的课桌上摆着一副围棋棋谱，似乎是在自己和自己下棋。\n“秀策的小角！佐为常用的定式！”\n作为一名日漫爱好者，平娃一眼就看穿了少年用的围棋定式，并脱口而出。\n围棋少年听到声音抬头看了一眼平娃，然后接着低头下棋。\n不好，遇到个高冷的了，正当平娃想撤退，换个人问自己座位在哪的时候，没想到这围棋少年一边下棋一边和平娃聊了起来。\n“你这几个月是回去研究围棋了？秀策的小角都认识，看来进步很大嘛，要不咱们来一局。”\n自己的围棋知识都是《棋魂》里看来的，而且平娃也就懂“秀策的小角”一个定式，面对围棋少年的挑战，平娃不知道如何是好。\n“话说佐为是谁，日本人？”围棋少年又问道\n发现自己刚才不小心说出了一个当年不存在的日本动漫人物的名字，不知道该如何解释的平娃更加慌乱了。\n“哟，是近平啊，好久不见，咱‘三平’时隔数月终于又合体了。”这时候又有一个人凑了过来。\n三平，意思是我们三个的名字都有个平字？似乎这两个同学都是习近平的铁哥们，平娃没有习近平的记忆，只好尽可能表现得自然。\n这时候早操的铃声响了，吵闹的班级马上恢复了秩序，早操开始前，在红卫兵的带领下，二十五中的每个学生都跟着卖力高喊“毛主席万寿无疆，林副主席永远健康”。唯独这“三平”，似乎是这个学校的异类。平娃是因为第一次喊比较懵逼，而身边的两个人，下围棋的那个喊得有气无力，另外一个则只喊“毛主席万寿无疆”不喊“林副主席永远健康”。\n后来，平娃才知道，身边的另外两个“平”，一个是开国上将刘震的儿子刘卫平，因为父亲被林彪迫害，所以他从不喊“林副主席永远健康”。\n而另一个围棋少年，原来就是赫赫有名的\"棋圣\"聂卫平，平娃也是知道这个人物的，没想到能和“棋圣”在学校里称兄道弟，平娃似乎渐渐体会到重生为习近平的好处了。\n\nhttps://pincong.rocks/article/8180\n\n第二章  维尼凶猛\n\n1968年，中学的红卫兵已经分化成好多派，诸如四三派、四四派、联动、逍遥派等等，各派之间经常发生一些“派仗”。而“三平”则因为出身背景的关系，则跟校外的老红卫兵派更为亲近。\n但平娃对老红卫兵派的看法和习近平并不一样。1966年的8月18日，毛主席在天安门广场接见宋彬彬等人后，红卫兵就陷入领袖崇拜的迷醉中无法自拔，随后便开始肆意“倾泻我们无情的暴力，直至掀翻天地。”\n平娃听说过当年红卫兵武斗老师的事，但亲身穿越后他才知道这些老红卫兵仗着其父辈的地位，在一副写着“老子英雄儿好汉，老子反动儿混蛋，基本如此”的对联的指导下，把矛头指向了出身不好的寒门子弟，批死批残了许多人。\n自认为是左翼改良派的平娃觉得这些红卫兵不论派系，每一个人都是彻头彻尾的暴徒，干得都是纳粹的勾当，对于暴徒，平娃是不愿意与之为伍的。“三平”之中，聂卫平本是逍遥派，完全是跟着习近平和刘卫平才将感情转向老红卫兵，但刘卫平因为其干部子弟的身份，却是真心支持老红卫兵的。\n一个阳光灿烂的日子，忽然传来一个消息，说三十八中有地、富、反、坏分子集会造反，号召各校的红卫兵前去和他们辩论。刘卫平听后便叫平娃和聂卫平一同前去。平娃起初并不愿意，但听闻是辩论活动，心想这也许是个机会，能借着这平台表达一点自己的声音。在自己的那个年代，左翼思潮在互联网上是很有市场的，万一能以此当场说服一群人，组建一个不滥用暴力、斗争方向明确的新红卫兵帮派，岂不是可以借此改变无产阶级文化大革命的局势。想到自己可能马上就有机会改写历史了，平娃心里美滋滋的。\n于是在约定的时间，“三平”骑着自行车，来到了三十八中的集会现场，在校园外，就能看到密密麻麻成百上千的红卫兵聚集在里面。有这么多“自己人”，身旁的刘卫平和聂卫平似乎表现得很心潮澎湃，但平娃看着这些人，就仿佛看到了把未来的自己害死的示威者，产生了很强的抗拒心理。\n三人把自行车锁好就跟着进到学校去了，操场上站的全是红卫兵，却没看见一个所谓的地、富、反、坏分子。\n“说好的地、富、反、坏分子的集会呢？”刘卫平向旁边的红卫兵打听。\n“谁知道，估计是看我们这么多人怕了吧。”红卫兵回答道。\n等了很久地、富、反、坏分子也没有出现，闲着无事的红卫兵们开始高声叫喊“破四旧，立四新”“革命无罪，造反有理”“伟大领袖、伟大导师、伟大统帅、伟大舵手毛主席万岁万岁万万岁”等革命口号。\n此时的平娃心想，这是一个好机会，正好可以在这么多红卫兵面前发表一次演说。机不可失，于是平娃径直走上学校的主席团，用最高的分呗朝着喊口号的红卫兵们喊话\n“你们就会喊，就会大吵大闹吗？”\n“当你们没办法跟别人讲道理的时候，你们就尖叫，就大喊。”\n刘卫平和聂卫平看到这一幕，面面相觑，目瞪口呆\n“他是疯了吗？”\n所有红卫兵见状，停止了喊口号，转而开始咒骂这个不知道哪来的平娃\n“CNMB，你是谁啊？”\n“我叫习近平，是习仲勋的儿子！”\n“我知道习仲勋，他是个反党分子！”\n“原来是反革命的儿子。”\n“反动派，滚下台！”\n红卫兵们情绪非常激动，大有要冲上主席团把平娃拖下来“私了”之势。人群中的刘卫平和聂卫平不知所措，他们不知道习近平到底要说什么。\n“毛主席说过，要文斗不要武斗，我是坚决拥护毛主席的。我有一言，请诸位静听。若我说的没有道理，你们再批斗我不迟。”平娃表现得很冷静。\n人群里的刘卫平也跟着附和道：“是啊，先听听他想说什么吧。”\n“好，先听听他怎么说吧。要是敢发表反革命言论，就斗死他。”\n平娃便拿出口袋里昨晚写好的演讲稿，照着稿子读了起来，台下顿时嘘声一片\n“无产阶级文化大革命已经进入第三个年头了，在毛主席的英明领导下，革命的成果越来越大，被揪出来的走资派越来越多，但是……你们这些老红卫兵的势力那可真是一年不如一年了，从原来的京城老大，变成现在这副落魄的样子，你们甘心吗？你们就甘愿以后一直被那些四三派、四四派的所谓“战士”瞧不起吗？你们就只能眼睁睁看着他们篡夺了革命果实吗？”\n平娃这句质问，似乎戳中了红卫兵们的痛点，台下的嘘声小了许多。\n“我知道，在座的各位都是毛主席的红卫兵，是共产主义的接班人，但你们除了毛主席语录，还可曾学过其他流派的共产主义思想？”\n“毛主席的思想是战无不胜的，不许你侮辱毛主席。”\n“他是想替苏修社会帝国主义辩护！”台下有人喊道\n“我没有反对毛主席的意思，也没有支持苏修的意思，我是坚决拥护毛主席的，但毛主席也说过，好好学习，天天向上，我只是想改造一下你们落后的思想，帮助你们战胜四三派、四四派的修正主义，让你们重新夺回文化大革命的主导权，届时把这场运动发扬光大，我想毛主席会很乐于看见的！”\n“那你说说，你有何高见。”\n“你们之所以失败，就是因为你们没有理解毛主席的统战艺术，毛主席告诉我们，要采取又团结又斗争的策略，团结一切该团结的人，你们以前得意，仗着自己的身份批斗寒门弟子，结果现在好了吧，寒门弟子组成四三派、四四派来斗你们了。”\n“所以我建议你们以后批斗别人之前，还是应该先多读书，用思想来武装自己。当然这书肯定得有选择性的读，得用批判的眼光读，藏有西方资本主义大毒草的书万万读不得，但是读毛主席写的书，读共产主义的书，对你们参加革命，肯定是有很大益处的。我知道你们很多人都是高干子弟，哪怕被打倒了，家里面那些反修防修的书还是有的，不如偷出来分享给大家一起读。”\n“我家确实有几本，不过深奥得很，实在看不懂。”台下一个红卫兵对平娃喊道。\n“没关系，不懂的地方，大家可以一起研究。”\n忽然之间，学校礼堂的门大开，有好几百人拿着棍子从里面喊着冲出来，正是那些地、富、反、坏分子，他们见人就打。红卫兵虽然人比他们多，但毕竟是没有准备，也没有组织，没有指挥，在地、富、反、坏分子有组织、有准备的“突然袭击”下，顿时成了乌合之众。聂卫平和刘卫平顾不上台上的习近平，随着其他红卫兵一窝蜂逃出了学校。平娃因为站在主席台上，目标特别明显，被几个地、富、反、坏分子当作了红卫兵头目团团包围。\n“且慢，君子动口不……”平娃还没来得及说完一句话，这些人就操起棍子朝平娃抡过去，一声惨叫后，平娃脑浆被打了出来，失去了意识。\n“完了，这肯定打死人了。”\n“怕什么，公检法都砸烂了，把他拖到看不见的地方埋了就行。到时候你不说，我不说，没人知道。”\n于是几个人便抬起习近平的身体，准备往别处拖，但突然，眼前这具“尸体”发出了巨大的冲击波，震开了身边的所有人，然后摆出了一个打坐的动作悬在了空中，而他的背后似乎显现出来了什么东西。\n“鬼啊！”这几个地、富、反、坏分子哪见过这场面，跟之前的红卫兵一样狼狈得向校外拼命逃窜……\n再次睁开眼睛的时候，平娃发现眼前是刘卫平和聂卫平，他们刚逃脱掉追杀返回学校寻找习近平。\n“你终于醒了，没被他们打成脑震荡吧。”聂卫平问道\n平娃摸了摸自己的头说：“真奇怪，我记得我头都开瓢儿了，怎么摸起来一点伤都没有。”\n这时平娃隐约想起刚才失去意识的时候似乎做了一个梦，梦里有人说了什么，但内容是一点也想不起来了，只记得那人说的东西里有一个法字。\n\nhttps://pincong.rocks/article/9395\n\n第三章 习近平初试云雨情\n\n1968年12月22日，《人民日报》刊载的文章引述了毛主席的指示：“知识青年到农村去，接受贫下中农的再教育，很有必要。”随即，全国范围内便开展了大规模的知识青年“上山下乡”活动。\n思乡心切的平娃，第一时间在学校报名了这个“坚决响应伟大领袖毛主席的号召上山下乡闹革命”的活动，虽然按照规定，还未年满16的他本不必去参加这次“上山下乡”，刘卫平以参军的方式避免了上山下乡，聂卫平则称病留城，至此，北京的“三平”宣告解散。\n1969年1月13日，平娃正式动身，同行的还有20名同校的同学，他们同北京其他学校的同学同乘一趟知青专列奔赴陕北延安农村。在火车站，大部分同行的人都是自己背着行李独自前来，没有家人来送，习近平也是如此，作为“黑帮家族”的一员，他们家除了他，其他人都在进行思想改造，加上平娃对习近平的亲戚本来也没有什么感情，因此也没有尝试联系他们，独自一人来到车站，径直上了火车，只想着能快点回到自己的家乡。这时，有同学对着平娃喊道：“习近平，你姐姐来送你了！”\n平娃往窗外看去，确实有一个年轻女性在窗外望着他，此人是习近平的大姐齐桥桥，这些日子齐桥桥大多时间都在“毛泽东思想学习班”接受教育，因此平娃对她的面孔并不熟悉，不过齐桥桥这个名字，平娃在“巴拿马文件”中看到过，该文件记载了齐桥桥与其夫邓家贵曾经开设离岸公司转移国内资产的事情，一度让提倡反腐的习近平非常难堪。\n齐桥桥把一包水果交给近平，嘱咐他一路小心，到了那边注意搞好生活，自己多照顾自己。平娃点头答应着，但没有说太多的话。他站在车厢里，没有流泪，只是长时间凝视着他的姐姐。周围的人看到这幅离别的场景，触景生情，都哭了出来，但是平娃的心情是非常复杂的。\n车启动了，全车人几乎都哭了，因为车上的都是没出过远门的孩子。只有平娃和他们不一样，他对周围的人并不感兴趣，他盯着窗外流动的风景，构想着心目中那个宏伟的中国梦，想着想着，他咧开嘴露出了笑容。\n“知青专列”从北京出发，经过河南，过黄河大桥，沿着陇海线，一路到了西安。没换车，火车又开到了铜川。抵达铜川的时候，已经是晚上了。\n第二天，天还未亮，知青们就不得不起床了，吃过馒头、咸菜，之后就准备出发了。天亮的时候，有一两百辆大卡车来接他们。平娃和其他二十几人上了其中一辆卡车，车队在黄土高原的公路上缓慢前进，眼前黄土滚滚，铺天盖地，光秃秃的没有一点绿色，视觉上给人的感觉非常震撼。\n到了梁家河的公社和生产队，这里的贫穷让所有的北京知青们震惊了，而最感到震惊的还是从2049年的梁家河来的平娃，他难以相信眼前这个梁家河和未来他生活的那个村级直辖市外加特色社会主义实验区是同一片土地。眼前的现实让平娃的思乡情绪也荡然无存。\n在1969年梁家河生活的艰苦远超过平娃的想象，作为一名2049年一线城市娇生惯养的学生，在北京的生活已经让他很不适应了，现在来到梁家河，就如同回到了原始社会。不论是饮食、生活、劳动还是卫生条件，都是让平娃难以忍受的，但是为了实现自己心目中那个大一统、赶超美帝的“中国梦”，平娃下决心坚持下去。\n但是窑洞里糟糕的卫生条件加上习近平肉体的过敏体质，让平娃的皮肤感染了很严重的皮炎，长期处于一种瘙痒疼痛的状态。加上周围人普遍懒散，平娃在“三板斧”的劲头后，也逐渐丧失了劳动的积极性，甚至早上都不出工了，每天评得的工分也从6.5下降到了5.2。\n由于知青们工作懒散，梁家河当地人对他们也逐渐没了好感，知青和村民经常发生口角冲突，村里每天工分都得10分的壮汉“黑子”不知道为什么最看不惯平娃，每天劳动时都找平娃的茬，时间久了，令平娃很是恼火。终于有一天，平娃忍不了黑子的刁难，放下手中的农具，朝黑子扑过去扭打起来，但习近平这具瘦弱的身躯哪里是黑子的对手，一下就被黑子反过来推倒在地，磕到了脑门，晕了过去。\n“玲玲!”这是再度醒过来的平娃喊得第一句话，他环顾四周，发现自己躺在一间陌生的房间里，看布置似乎很像是医务室。\n房间里还有一个穿着白大褂的女人，看上去是个医生，她双手插着口袋，朝着平娃慢慢走近，用挑逗的语气问道：“习近平，你醒了啊。这‘玲玲’是谁啊？你对象吗？”\n面对女人的问题，平娃没有回答，眼前的女人看上去似乎比平娃大几岁，165cm左右的身高，不是特别漂亮，但却是平娃这一年来见过的最好看的女人了。女人的白大褂很大很宽松，袖子被她撩起来，露出了大截的臂膀，但肤色并不那么白，衣服的下摆下面就是女人的大腿，视觉上看上去全身仿佛只穿了一件白大褂，这种打扮在2049年的中国也属于大胆的了，平娃没想到能在1969年的梁家河也欣赏到这样的美景，许久没见过色图的他眼睛自然停留在女人的身上离不开了。\n女人伸手摸了摸平娃的后脑勺，说道：“你跟那‘黑子’打架，给他摔晕了，脑袋上却没有一点伤口，真奇怪。”\n听到女人的话，平娃想起之前跟地、富、反、坏分子打架时似乎也有这种情况，这究竟是为什么，平娃也很疑惑。\n“还有你刚才睡着的时候，一直在念叨‘什么什么大法的’，那是啥玩意儿？”\n“什么什么大法”，这是之前做梦的时候梦到的那个？面对女人的一连串问题，平娃不知道该如何作答，一直沉默着，但视线从未从女人身上移开。女人似乎也感受到了平娃火热的目光，但她并不介意：“虽然你头上没伤，但身上都是跳蚤咬的包，你躺着别动，我给你涂药。”女人说罢拿出药膏，取了一点，往平娃身上的红肿处抹去。\n“我是这个村的返乡知青，因为我是医学院毕业的，就让我在这做了医生，村里人都叫我‘小红’，你叫我‘红姐’就行。”女人不顾平娃的沉默，继续尝试跟平娃尬聊。\n“你知道‘黑子’为什么这么讨厌你吗？”\n平娃摇摇头。\n“因为上次黑子来我这打针，我们聊起你们这批知青里谁最帅，你猜我说了谁？”\n平娃一脸茫然，红姐却边说边忍不住大笑了起来。\n“没想到吧，就因为我提了你的名字，黑子才看你不爽的。”\n这番话，让平娃联想到未来习近平的夫人彭丽媛在出访韩国时曾指出自己和女儿习明泽都认为习近平年轻时的容貌和饰演《来自星星的你》中外星帅哥都敏俊非常相像，这番话一度引发了网友热议。没想到确实有女人好习近平这一口的，平生从未得到过女生青睐的处男平娃顿时感觉有些得意。\n红姐继续在平娃的身上涂抹药膏，但当她伸到平娃的大腿处，只觉冰冷粘湿的一片，被吓了一跳，忙褪回手来。原来，平娃穿越来后许久都未手冲，所以刚才睡着的时候不受控制梦遗了。\n房内的气氛瞬间有些尴尬。“好姐姐，千万别告诉别人。”是平娃先打破了尴尬的气氛，含羞央求道。\n红姐朝着平娃笑笑，也不言语，直接强行脱下平娃的裤子。\n眼前的景象像极了平娃偷偷看的那些日本小电影里场景，难不成多少男人梦寐以求的事情就要在自己身上实现了，平娃顿时变得呼吸急促，满脸通红。\n“你啊，太年轻了，姐姐是学医的，身经百战，见得多了。”红姐拿了几张纸，给平娃那里清理干净，便把他裤子重新提上，然后招呼他快点离开。\n“好了，现在你也没事了，回去吧，记得把裤子洗洗干净。” 预想中的画面没有实现，平娃很是失望，带着诸多的不舍离开了红姐的医务室。\n\nhttps://pincong.rocks/article/10363\n\n第四章 黄毛风那个吹\n\n话说自从在医务室和红姐一番亲密接触后，平娃对干农活越发没有兴趣了，脑袋里只想着怎么和红姐有进一步的发展，四处跟人打听红姐的情况。红姐是当地人，父亲也是个党的干部，因此她有机会去北京读了几年书，之后回乡做了赤脚医生，至于她的私人生活，梁家河的村民也不太清楚。红姐工作的医务室在文安驿镇，平时住樊家沟，这两个对方离梁家河村都有十里山路的距离，平娃日思夜想也没机会见着红姐一面。\n日子一天天过去，很快平娃就要迎来他在梁家河过的第一个新年，到了2月16日除夕，樊家沟和梁家河两个村要联合举办一场北京知青联欢会。\n平娃对那个年代的表演是一点兴趣也没有，本想称病不去，在窑洞里睡大觉也比听红歌有意思，但他听到周围的男人们在议论联欢会有女知青表演藏族舞蹈时，他还是决定去一下，说不定还能看到红姐的表演。\n很快到了除夕当天，平娃与北京知青们一同来到樊家沟参加联欢会，出发前平娃特地戴了一顶当时很时髦的羊剪绒军帽。联欢会大多节目都看得平娃昏昏欲睡，直到报幕员说下一个节目是由女知青表演的藏族舞蹈时，平娃突然振作精神，眼睛直直的盯着舞台，一同扫视后发现了那个自己日思夜想的面孔，果然红姐也参与了这个节目。\n虽然藏族舞蹈平娃欣赏不来，但红姐的身材平娃还是很享受的。旁边的男知青们也难掩躁动了，纷纷就女知青的身材长相议论起来。但平娃没有参与，一直盯着红姐的舞蹈。\n“近平，你觉得哪个女的最好看？”平娃身旁的“室友”雷平生突然问道\n“都一般吧。”平娃敷衍的回答了一下，表现自己不在乎的样子。\n“听说你喜欢那女医生。”旁边有人突然\n“你这听谁说的？“平娃吃惊的问道\n“看来是真的了。”\n“黑子说的。”\n旁边人纷纷开始起哄，平娃\n“明明是他喜欢，怎么反过来污蔑我。”\n“我说近平，喜欢就承认呗，没什么丢人的\n“这么上纲上线的，看来是真的喜欢了。“\n“要不我们等会儿帮你撮合一下。”\n“还有谁看上谁了，不要怕丢脸，趁现在都说出来，等会儿一块帮你们撮合。”\n在男知青们的怂恿下，平娃半推半就的参与了他们的“英雄救美”计划。\n计划是这样的，等联欢会结束后，先是男知青们主动要求护送女知青们回窑洞，然后派几个人在路上装神弄鬼吓人，接着再由男知青“英雄救美”。\n计划出乎意料的成功，鬼出现的时候，有想法的男知青们果断出击，各自拉着自己“目标”的手四处逃窜，平娃也拉着红姐的手跑到了一个四处无人的地方。\n没有鬼追过来，但平娃也不打算放开红姐的手，两人就默默地看着对方。\n“你今天很美。”是平娃先打破了沉寂。\n“你的帽子也很好看。“\n“我为了今天特地选的。“\n“怎么，你还策划了很久了？“\n“不……不是……我……我只是想借此机会，增进一下我们梁家河和你们樊家沟两个村的伟大友谊。”\n听到伟大友谊四个字，红姐笑出了声。\n“你打算怎么增进呢？”\n平娃支支吾吾，不知道该回答什么\n“就在这荒郊野外增进友谊？有点太大胆了吧。“\n“那去你家？“\n红姐没有说话，只是转身往家的方向走去，平娃松开了手，在后面跟着。很快便到了红姐的住处，跟平娃不一样，红姐是一个人住在窑洞里。\n进屋后，红姐点了一盏煤油灯，对着镜子准备卸妆。\n今晚是平娃第一次在这个时代见到化妆的女人，藏族的服饰更是给她增添了几分异域风情，平娃再也忍受不住心中欲望，从背后抱着红姐，手在红姐身上不安分了起来。\n红姐也没有反抗，只是用嗔怪的语气说了句：“这藏族衣服是问文工团借的，明天要还回去。“\n“我才不管！“\n啪，红姐突然转过身，给了他一个耳光\n“流氓！“\n吃了巴掌，平娃手上的动作反而变本加厉，红姐打算挣脱，但两只手突然都被平娃控制住\n“习近平，你放开！“\n“你不想做江青吗？“\n冷不防听到这么一句话，让红姐一下子懵了，刚准备问这话是什么意思，平娃便用嘴唇堵住了她的嘴……\n云雨过后，赤身裸体的两人在木床上相拥而卧。\n“我厉害吧。”平娃搂着这个刚刚被自己征服的女人，心中充满得意\n“这些花样都是哪学来的……“\n“从日本人那。”\n“又在骗人，日本鬼子哪敢来中国，跟姐姐说实话，你真的是第一次？”\n“千真万确。”\n红姐脑子里充满了疑惑，虽然两人肉体刚刚结合，但她似乎越来越不懂身边这个小男人了。\n“你刚才说的想不想做江青，到底是什么意思？“\n“哈哈，这还不明白吗，等我将来做了主席，你不就是江青了。”\n“你这个反革命的儿子，还想做党主席？”\n“怎么，你不相信我？”\n“我不信。”\n“那我就日到你信。”话音未落，平娃便翻身压在了红姐的身上，开始了第二回合的战斗。\n那个晚上，樊家沟村的窑洞里传来一阵又一阵的，诸如下文这样的反动污言秽语。\n“主席！啊！习主席！啊！我……我是你的亲密战友……啊……和学生！我要深入……深入……啊……贯彻学习……啊……学习习近平新时代中国特色社会主义思想……和……党的二十五届四中全会精神!啊啊啊啊啊啊啊！“\n在黄土高原的尘暴与响天动地的锣鼓声的掩护下，女人忘我地叫着。\n",
			"added": 1577114589,
			"parent_topic_uri": "12_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		},
		{
			"topic_id": 19,
			"title": "上海195万党员名单信息2016",
			"body": "https://www.reddit.com/r/4832/comments/id2ccm/%E4%B8%8A%E6%B5%B7195%E4%B8%87%E5%85%9A%E5%91%98%E5%90%8D%E5%8D%95%E7%96%91%E5%A4%96%E6%B3%84_%E8%AE%B0%E5%BD%95%E8%AF%A6%E7%BB%86%E4%B8%AA%E8%B5%84/\n\nhttps://project-gutenberg.github.io/Pincong/post/501bc2d4a58a8b3cd306d23456b85d8c/\n本办利用已知的46名党员信息对于泄露信息进行分析研判，得到以下结论：\n\n    在43条中找寻到36条符合的记录，未查到记录中2名为2017-2019年入党人员，5名为编内干警人员，3名为编内国保（军警消防系统未收录？） （36/46）\n    找到的记录属实（36/36）\n    所泄露个资应该是内部人员从数据库导出，或者是被黑进服务器后蓄意泄出的\n    所泄露数据应该是2016-2017年的数据版本（考虑到预备党员等的时间）\n    数据库的更新会随着个人的关系的转出转入由接手的党支部进行更新，但是各个支部操作并没有统一，糊弄的党支部不少，其具体表现在个人信息的错误，未更新或错填（填错空）（13/36）\n    我们有理由相信，如果连我们朝鲜都能看到这么多信息，那么实际泄露的，或者说美国掌握的信息远比这个要多（如肖像照片等），那么对于在外的，特别是正在使用化名的情报人员（SPY）将是一个致命的打击 \n\n\n[code]\ned2k://|file|%E4%B8%8A%E6%B5%B7%E5%B8%82%E9%BB%83%E4%BF%84%E9%BB%A8%E9%BB%A8%E5%93%A1%E4%BF%A1%E6%81%AF%E9%9B%86%E5%90%88%E7%AC%AC%E4%B8%80%E9%83%A8%E5%88%86.xlsx|87473918|01C3D8E57DC09BF9AB88FCCA92A160C3|h=7JIVC4VOTFN2LGJ66O32PVAGG2IDY25R|/\n[/code]\n\n[code]\ned2k://|file|%E4%B8%8A%E6%B5%B7%E5%B8%82%E9%BB%83%E4%BF%84%E9%BB%A8%E9%BB%A8%E5%93%A1%E4%BF%A1%E6%81%AF%E9%9B%86%E5%90%88%E7%AC%AC%E4%BA%8C%E9%83%A8%E5%88%86.xlsx|75476832|301267191A9AD62EA4CC572246118BB4|h=RB4HWZLH2QJCYYWV4MMVNVEEGVDC5G6O|/\n[/code]",
			"added": 1598456212,
			"parent_topic_uri": "11_1NV87VmSkezRyz8NbFpdkYJsJUSfXx7LJa"
		}
	],
	"topic_vote": {
		"2_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"5_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"4_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"6_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"18_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"19_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1
	},
	"next_comment_id": 264,
	"comment": {
		"1_1JuJzy7nP1eBDojviCHFZYs36AftHQ5BmE": [
			{
				"comment_id": 1,
				"body": "楼主大惊小怪，本身就说明恋童癖其实并不多见。恋童，冰恋，吃人肉，只是想想看看并没有妨碍到别人。",
				"added": 1508242872
			}
		],
		"1_1DYBwXBMZzGRsCHTBVj5hs5aYoXRhym3pG": [
			{
				"comment_id": 2,
				"body": "还是给电驴链接吧，磁力链接要先下种子。",
				"added": 1508243004
			}
		],
		"1_14p4dsWSAmnRF1RkfcXmyBpiGXCmTMzLEY": [
			{
				"comment_id": 3,
				"body": "你要是每天坚持做直播，就算做魔兽争霸解说也能有他那么大访问量",
				"added": 1508243400
			}
		],
		"223_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 4,
				"body": "戴领带最初是为了吃完饭擦嘴的。后来议会禁止男人奇装异服，这种风气延续到现代行政商务场合，领带逐渐演变为男人发泄穿衣情趣的唯一出口。",
				"added": 1508245218
			}
		],
		"1_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 5,
				"body": "据说上海电信也断网了？",
				"added": 1508942091
			}
		],
		"10_1KoZ6vDCXeDavsQjCToc95SZJu7uVVd9Yi": [
			{
				"comment_id": 6,
				"body": "> [mcloud](#comment_33_1975Z5g8hZhSj8sco2sp5yz8gTV1NDRc4G): 能说得通俗易懂一些不？没看明白。\n> 好多昵称和比喻………… 既然在零网，就不用这样说话吧。\n\n黑话本来就是语言演化的一种形式",
				"added": 1510845867
			}
		],
		"1_1BHcv5eMFiza4gCBXmPXwxMLhF9oodThhD": [
			{
				"comment_id": 7,
				"body": "首先，“中国”是不严谨的叫法，是没有明确边界的统战词汇；支那才是China的同义词\n其次，梁启超孙中山这两轮民族发明运动的失败，证明了中国是伪国，中华民族是伪民族。在满洲利亚爱国者，晋兰爱国者，东突厥斯坦爱国者，湖湘尼亚、荆楚利亚、吴越、闽粤爱国者看来，没有中国爱国者，只有中华帝国沙文主义者。\n每个人都可以通过自己的努力学会中文，英文，证明中文、英文是天赐的，而非什么支那人中国人所有的。",
				"added": 1511965239
			},
			{
				"comment_id": 8,
				"body": "> [3904504358345](#comment_1_1B5anSzndug7wB2Cfkb1ne9b9iS1ihKbpz): 五毛大本营新浪网sina就是支那的拉丁语词汇，为啥你不对这个痛不欲生？用支那代表中国的守旧保守势力，暴发户，既得利益者，匪共贪污流氓通奸犯，太监家奴五毛群体并无不妥。\n\n守旧保守势力，和中国本身就水火不容。春秋封建时代，中国指洛阳城；秦汉以来，中国指中央政权，每一朝代的中国都和地方是相对立的概念。",
				"added": 1511965394
			},
			{
				"comment_id": 12,
				"body": "> [cdxjskhluey](#comment_56_1Ceg5F9KEWkCyTu3r1QBSuiU8C1PYsd8PJ): 前面已经说了，当中国还叫支那的时候，是一个封建专制的国度，现在很多人意识到，专制并没有离开过中国，特别是当年被专制者维护专制者这种奴才现象没有改变，所以他们又把中国叫支那，当你以后有见识了，知道自己跟支那时代那些人一样被专制，你也会叫支那，重新定义自己为支那人。\n\n春秋以后就不是封建国家了。什么是封建？春秋诸国的士，和欧洲的骑士，其实都是一样的，有自己的封地，用武德捍卫领地，与国王对抗。武德是道德之首，政治德性依赖武力，士人一旦失去武装，就堕落为文人，中国也就沦落为帝制国家。老牌封建国家，如果没有经历过20世纪的民族发明浪潮，成为民族民主国家，那么现在还是封建国家，封建国家不是贬义词，反而自诩现代化的民族民主国家，喜欢搞均贫富，搞政治清洗，权力凌驾于真理。\n\n梁启超孙中山的时代，中国就是往民族民主国家上面发展。但是最后中华民族发明失败了，被苏俄特务借尸还魂，搞出个当代中国，民族主义（实为帝国沙文主义）为表，极权主义为里。从歧视链上来说，叫支那其实是抬举了。毕竟日本是个现代化的封建国家。",
				"added": 1512565417
			}
		],
		"2_1BHcv5eMFiza4gCBXmPXwxMLhF9oodThhD": [
			{
				"comment_id": 9,
				"body": "洪水元年",
				"added": 1511965533
			}
		],
		"6_1KzVbVbRqbSxr3VDCU2VbeAqhMUrL1EnRZ": [
			{
				"comment_id": 10,
				"body": "你就想想你爱老婆疼老婆，对于最近老婆被流氓占便宜怎么看",
				"added": 1511966484
			}
		],
		"2_19LcfC7AgJy2RtGJBMKESyCHsunPpsyyaH": [
			{
				"comment_id": 11,
				"body": "建议用BCH等虚拟货币支付",
				"added": 1512473737
			}
		],
		"1_1LXeK8iHk9NvuDtWcoR9MvkjnbGevuvcxa": [
			{
				"comment_id": 13,
				"body": "nginx即可",
				"added": 1512565517
			},
			{
				"comment_id": 16,
				"body": "在有了nginx后，可以参考  http://hi.ktsee.com/616.html 或者 https://github.com/Rixcloudllnll/install_Shadowsocks/wiki/05%E3%80%81%E9%85%8D%E7%BD%AENginx%EF%BC%8C%E6%90%AD%E9%85%8Daria2%EF%BC%8C%E6%8A%8Avps%E5%BD%93%E7%BD%91%E7%9B%98",
				"added": 1512646899
			},
			{
				"comment_id": 73,
				"body": "> [lmath](#comment_760_1958F7oCppj78MP966AfojMQwHg2WUupzq): 因为要经过外网，没个加密还是挺不安全的，除非你说 VPN 连回去用。\n\nNginx是 http server，完全可以进一步部署PHP或者Python的网盘系统",
				"added": 1516722721
			}
		],
		"251_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 14,
				"body": "应该是没人玩了",
				"added": 1512566484
			}
		],
		"3_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 15,
				"body": "1 服务器可以ping通，只是表明你发出的ICMP包有人回。\n如果你ping域名，会有DNS污染把你的ping引导到一个别的服务器\n就算你ping IP，ICMP包过于简单，网路中间的某个设备可能直接伪造一个返回给你\n2 就算你真的能连上服务器，人家可以主动拒绝你访问它的http服务，比如设置防火墙规则，或者在http服务器上设置规则，甚至这个IP根本不提供http服务。也有可能你的http请求被网络上的设备识别和拦截了。\n这个原因是多种多样的，要逐个排除",
				"added": 1512646668
			}
		],
		"7_1HUPjBfWJgsoGfmXbkxHx999oNnP6MdUji": [
			{
				"comment_id": 17,
				"body": "现在网银就能换美元，比特币也可以买。偷渡到金三角也不过罚款50块钱。",
				"added": 1512655666
			},
			{
				"comment_id": 21,
				"body": "> [temp000001](#comment_18_1HUPjBfWJgsoGfmXbkxHx999oNnP6MdUji): 你现在打开网银，去买50万刀，全部提现，看看你有本事提出来不。。。就算你能提出来，提出来的钱你去拿到美国去验，看看是不是真钱。\n\n这个证明不了什么，大多数人不能买50万刀提现，仅仅是因为自己没有50万刀。就大多数人那点身家，买几颗比特币就提出去了，买钻戒十只手都戴不满。",
				"added": 1512731987
			},
			{
				"comment_id": 22,
				"body": "> [temp000001](#comment_19_1HUPjBfWJgsoGfmXbkxHx999oNnP6MdUji): 这个帖子讨论的不是谁有钱没钱,而是不要在颠三倒四的骂来骂去,有本事的都肉身翻墙了,50w刀是肉身翻墙的基本要求\n\n捡来一堆似是而非的小道消息颠三倒四拼凑牢骚帖，是楼主干的好事。有本事的可以身无分文游泳肉翻，可以欠一屁股债肉翻，没本事的人才等着攒够50万。现在EB5门槛已经是100万了。",
				"added": 1512743556
			}
		],
		"11_1CD2KBQ412LcKxvno4T3T18MdD7QgEvt9Z": [
			{
				"comment_id": 18,
				"body": "> [twitch](#comment_2_1Azg1hWjmpRqBHQyXTDepgMSVTqJyL2pd6): 兩個傻逼\n\n没数错，真的就是两个号整天顶来顶去。",
				"added": 1512655713
			}
		],
		"2_17RBRkXkJ3B53JvZb2SPkZqemSjrrd7idP": [
			{
				"comment_id": 19,
				"body": "和发广告的差不多",
				"added": 1512731792
			}
		],
		"8_1HUPjBfWJgsoGfmXbkxHx999oNnP6MdUji": [
			{
				"comment_id": 20,
				"body": "ZeroNet并没有为用户创造价值，既不能用ZeroNet翻墙上网，又不能赚钱，而且招嫖卖药交易枪支的网站非常稀少。",
				"added": 1512731862
			},
			{
				"comment_id": 24,
				"body": "> [rwxy](#comment_57_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): 招嫖找我啊 哈哈.发现了几个经常出现在零网的老哥.\n\n国家就缺少你这种老司机老绅士",
				"added": 1513088206
			},
			{
				"comment_id": 26,
				"body": "> [rwxy](#comment_58_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): 嫖娼的来:http://35nwli65sok6lnqh.onion/shop/product/zlmz.html\n\n可以的",
				"added": 1513527469
			},
			{
				"comment_id": 30,
				"body": "> [rwxy](#comment_59_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): 恩,有些人不会. 而且你看标价巨便宜啊.就为人气而已.其实我的想法是给钱就给做.\n\n那样的姑娘你上哪儿去搞",
				"added": 1513696771
			},
			{
				"comment_id": 31,
				"body": "> [rwxy](#comment_62_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): 联系传统做这个的.\n\n没有选择，没有互评啊",
				"added": 1513775445
			},
			{
				"comment_id": 32,
				"body": "> [rwxy](#comment_63_1G2KAr146veEMjvkrhD3sXMUH1fAuZdswM): 刚做.你可以提提意见\n\n买春应用是刚需，建议从商城独立出来，每个姑娘建一个卖家帐号，树立信誉；应用基于ZeroNet和Tor，重点开发移动端。BTC价格太高零头手续费不划算，建议BCH支付。姑娘们开店，收到BCH就暂时找你兑换法币，你抽一点成。",
				"added": 1513780947
			}
		],
		"2_1J1ajRKr7wbm8ERfhXCnoTjSbZBhds6HRQ": [
			{
				"comment_id": 23,
				"body": "中国人谈及素质，总是厚颜无耻地甩锅给共产党。共产党毫无疑问是中国人素质的天花板。台湾原住民淳朴尚武未受中华文明污染，又成为日本殖民地一夜进入世界先进文明行列，才是当代台湾素质的底子。滞台的国民党痞子试图拉低台湾整体素质，搞了六十多年不伦不类的民族主义，把自己弄得里外不是人。",
				"added": 1513081757
			},
			{
				"comment_id": 54,
				"body": "> [silentsinger](#comment_4_1jWEbPJqL8FJp3BgiqEB4tWJdyePcCbir): 大陆游客坐的旅游车在路边熊熊燃烧，上百辆车辆从边上急驰而过却没有车停下来救人。这就是台湾人进入世界先进文明的高素质。祝你早日享受到台湾人民高素质的照顾。\n\n支那人没有一个是无辜的，台湾如果剿匪不力，只能被排除在世界先进文明之外。",
				"added": 1515156605
			}
		],
		"3_1DmGsXFPPexxcuTRgYZxDRHqGA7CbR3j14": [
			{
				"comment_id": 25,
				"body": "伤害儿童的是暴力（强奸直接毁灭肉体）、暴政（洗脑间接摧残心灵）。观看任何影视作品都不伤害他人。不去抓强奸犯，不去和高端禽兽、邪恶官僚、失心疯强奸犯作斗争的人，你也不必和他争论儿童色情作品的是与非。一个键盘侠能有什么行动力，只会浪费别人的时间精力而已。",
				"added": 1513523650
			},
			{
				"comment_id": 38,
				"body": "> [dasdvc](#comment_207_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL): 主要是   会导致对儿童犯罪变多    你看日本 很多擦边球   犯法的很少了 但也导致了高中援交 av风气   痴汉文化\n\n这是通过AV了解到的日本",
				"added": 1514124488
			}
		],
		"1_17a5mhwnQqpej8rx3MgDvzfRy86Hzw8NMU": [
			{
				"comment_id": 27,
				"body": "政治没学好。“人民”是个政治术语，是人群的阶级属性，不是自然属性。不能说是个人不犯事就算人民，得看阶级成分。",
				"added": 1513597137
			}
		],
		"303_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 28,
				"body": "比特币增长几乎停滞，现存比特币有大约23%因为保管不当永远找不回来了。持币主力是早期比特币爱好者，这些人根本没打算参与高抛低吸，而且上升趋势中抛掉了可能买不回来。所以市场上真正参与交易的比特币其实很少。大资金发现了这一点，趁着比特币期货上市的这股风，发动一轮行情。",
				"added": 1513690073
			}
		],
		"1_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ": [
			{
				"comment_id": 29,
				"body": "安拉 胡克吧！",
				"added": 1513693079
			}
		],
		"3_16LevgM81YcLYVYebEkoLKhAbgmeezzqjb": [
			{
				"comment_id": 33,
				"body": "是经营获利。不过也没差别了。不剿匪就被匪剿。",
				"added": 1513865295
			}
		],
		"4_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 34,
				"body": "> [zeronetimwulv](#comment_23_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ): 比起所谓哀嚎，无数个体安居乐业，柴米油盐的安稳日子在你们眼里都是狗屁。。说到底还是反华。。。扯什么犊子？装哪门子逼？谁还不知道你们啊？\n\n猪圈里的猪，想必一辈子都吃饱睡好，没有烦恼，但我为什么要看在眼里？我只管杀猪吃就行了。\n治国理政的高端人口就是这么想的",
				"added": 1513865501
			}
		],
		"1_1Ki3HYqzaNr3BMKP34wTz9xLnVsAXENw4b": [
			{
				"comment_id": 35,
				"body": "使用最广泛的语言还是英语\n你说的PHP我听都没听说过",
				"added": 1513943080
			}
		],
		"1_1GYCHJSLNgsAQiaLSmmoBrtGRErg7PJrEE": [
			{
				"comment_id": 36,
				"body": "郭文贵好像在和人撕，拿不出像样的爆料，而且被质疑作假。",
				"added": 1513946077
			}
		],
		"16_1FYGNAGGPjzRuubJGmq86t4iyEiMXxpuwL": [
			{
				"comment_id": 37,
				"body": "知道无聊，你还是要理他，这不是受虐么",
				"added": 1514124428
			}
		],
		"1_1vr4cnus1yUJ1Jpf7jm2NhT19hSpMUNvJ": [
			{
				"comment_id": 39,
				"body": "这种广告ban不完啊",
				"added": 1514203690
			}
		],
		"1_16oNA8swy8aqHkj5AK2vAAVRH2TiCymo4j": [
			{
				"comment_id": 40,
				"body": "每个人都可以下载源代码来编译。",
				"added": 1514203715
			}
		],
		"1_1QKPdebD75Xi4abUc82bpK8NpSKJbSe2QS": [
			{
				"comment_id": 41,
				"body": "> [aristotle](#comment_1_1QKPdebD75Xi4abUc82bpK8NpSKJbSe2QS): 国内的安卓生态环境太乌七八糟了，又没钱买iPhone，半年内应该不会考虑换手机\n\n安卓可以自己弄干净",
				"added": 1514245449
			}
		],
		"1_1LZTh6SLdSX6KyJ4LyA3usnN34Sq66ZQVh": [
			{
				"comment_id": 42,
				"body": "团员没什么用的啊",
				"added": 1514296394
			}
		],
		"7_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 43,
				"body": "国家是党的，是500个国民家庭的，以牲口的自由换来国民的稳定生活，有什么不可以。",
				"added": 1514296461
			}
		],
		"1_1jWEbPJqL8FJp3BgiqEB4tWJdyePcCbir": [
			{
				"comment_id": 44,
				"body": "“亲穆”与“反穆”\n\n共产主义搞解构的目的是，每一次被它分化以后，你就会沦落到比原来更差的地步。而诸夏和解体论的目的恰好相反，是为了通过脱亚入欧，使每一个主体在解体以后都能够处在比原先更高的位置，正像明治维新以后的日本从东亚变成欧洲的一部分一样，是让你在歧视链上面升一级。\n\n穆斯林问题按这种原则是可以很简单地判断的：在西方，穆斯林化是一种解构，是使西方文明从它原有的高度上下降了一格，但是在东亚就并非如此。所以你如果在欧洲的话，支持穆斯林是不对的，是降低了它的文明水准，但是在共产主义国家内部的话，支持穆斯林则是对的，因为这等于是提高了核平区原有的文明水准。\n\n共产党会在深圳修清真寺，因为深圳不是传统的穆斯林地区，如果插几个穆斯林社团进来，那么粤东原有的社会组织就要像法国原有的社会组织一样受到损失。同样的道理也适用于杭州，如果在杭州大修清真寺的话，那么吴越的社会组织就要因为伊斯兰化而受到损失。这种事情匪是在不断地干的。另一方面，在传统的穆斯林地区，无论是西安斯坦、宁夏斯坦还是东火鸡斯坦诸如此类的地区，因为这些地方的土豪都是穆斯林商人、穆斯林资本家，他们原有的社会组织和土豪都是伊斯兰的，所以在这些地方，匪恰好不但不会搞伊斯兰化，反而会尽可能地破坏他们，去镇压他们。\n\n如果你是个粗心的观察者，用亲穆和反穆这样的方式来判断的话，那你是永远也搞不清楚的。其实穆斯林本身并不重要，关键是在于，穆斯林是土豪还是无产者。在法国，穆斯林发挥了无产者和解构者的作用，所以共产党会希望把温州人也变成跟法国穆斯林一样的解构者；但是在喀什和宁夏，穆斯林是土豪，而驻马店移民才是解构者，于是在这种情况下，它就会表现出反穆的一面了。\n\n其实“反穆”、“亲穆”根本不重要，重要的是，你是解构还是建构：你是想要使组织变得更简单，还是要使组织变得更复杂。用这个根本原则来判断，你就能够看出谁是站在正典一边的，谁是站在破坏者一边的。共产党永远是站在破坏者一边的。",
				"added": 1514299685
			},
			{
				"comment_id": 45,
				"body": "https://pbs.twimg.com/media/DKxXSAKX0AAU--1.jpg:large\n看看老阿訇的统战技术...咋们怎么就不能学一点呢...",
				"added": 1514299895
			}
		],
		"1_13DthcV9hcoE8uFWHvrHvxhbzNPoJf6DJN": [
			{
				"comment_id": 46,
				"body": "节点太少连不上。另外希望能学习探讨下ZeroNet建站的技巧，不仅限于部署现有的论坛系统博客系统。",
				"added": 1514386093
			}
		],
		"1_1L34dC5CxSsske1B1bCQrak3tBwTWohtYk": [
			{
				"comment_id": 47,
				"body": "> [lvzy](#comment_2_1BdCY9YQADz9gnkY6TzsMhxMLoq79ge8Z7): 这论坛可以下载程序吗\n\nLantern主页就可以下",
				"added": 1514471906
			},
			{
				"comment_id": 48,
				"body": "好友购买两年套餐后，会赠送双方3个月专业版；好友购买一年套餐后，则赠送双方1个月。\n还要花钱买的好伐。Lantern在十九大期间被封锁时间最长，而且托管在阿里云，Play上骂声一片。不推荐购买。",
				"added": 1514472022
			}
		],
		"26_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 49,
				"body": "当然是人民币先崩溃。如果人民币变成废纸，你觉得房价多少钱一平米？",
				"added": 1515022616
			},
			{
				"comment_id": 68,
				"body": "> [pen](#comment_19_1NQLPWMLrNWcrLuZ3sSYLUPsjiYqBLMmST): 人家说的是比特币。。。我觉得房价先崩，比特币崩不崩不一定，说不定以比特币为代表的虚拟货币革命成功了呢\n\n货币、证券的估值是虚高，而且泡沫越来越大，相对的，固定资产、人的劳动价值都是被严重低估的\n未来房价涨上天，不是房子有泡沫，而是法币的泡沫破灭了\n比特币不好说，因为数字货币本身在不断发展，比特币总要进博物馆的，现在只是大家刚接触这一块，比特币品牌效应比较强一些。",
				"added": 1516284639
			}
		],
		"12_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 50,
				"body": "这是贵妇病，得治。开门迎匪的自杀，才是彻底衰弱。",
				"added": 1515154239
			}
		],
		"10_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 51,
				"body": "中国本身就是问题",
				"added": 1515154261
			}
		],
		"4_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 52,
				"body": "点进去，更新，即可",
				"added": 1515154304
			}
		],
		"3_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 53,
				"body": "路由器能开upnp吗？不过不开端口也不要紧",
				"added": 1515154423
			}
		],
		"5_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 55,
				"body": "你可以删掉Data目录下的站点文件",
				"added": 1515245994
			}
		],
		"28_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 56,
				"body": "有剿无类学——不剿匪就被匪剿",
				"added": 1515308682
			}
		],
		"10_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 57,
				"body": "纠结这个干什么。可能文件是有，但是没有足够的用户认证这份文件。",
				"added": 1515308818
			}
		],
		"30_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 58,
				"body": "当你觉得贫富差距是社会的主要问题，并且你穷，说明你被留在猪圈里了。贫富差距扩大从来都是社会高速发展的必然结果，反过来在一定程度上促进社会繁荣。人与人的竞争是多维的，在正常的社会，如果上一代人，或者某个阶层牢牢把握财富，导致年轻人无法翻身，那么年轻人就会掀桌子改规则，那么就会出现各种深居简出，环保主义，文艺青年之类的时髦玩意儿，让人有新的追求，让社会更加多元。",
				"added": 1515421623
			},
			{
				"comment_id": 62,
				"body": "> [flyingpanda](#comment_61_1AztBTbD25eZtkKSsmUjQG8MXKP3KQQSy): 说得太轻巧了。中国历史上很多次改朝换代，常常有损失90%人口的记录。你掀一个我看看？\n\n猪圈里的猪每年都有90%的死亡率。重要的是跳出那个圈",
				"added": 1515599180
			},
			{
				"comment_id": 63,
				"body": "> [asd123](#comment_40_1JmBwcsrovPGXG9c2VHbYHe7WBBF4xuTq6): 你这完全是在曲解基尼系数啊！\n\n允许基尼系数曲解社会经济规律，就不允许我曲解基尼系数？",
				"added": 1515599228
			}
		],
		"1_1Lf9ruA9iMU6fRqAFEhHgVRHyspUo9xvH3": [
			{
				"comment_id": 59,
				"body": "黄赌毒，代购，外汇汇款，政治八卦，各种中国人喜欢但是不好意思用微信QQ交流的东西",
				"added": 1515504830
			}
		],
		"31_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 60,
				"body": "1 手机插两张卡，副卡专门收短信\n2 密码用网站名称构成，比如园圈的密码，就设置成yuanquan888\n3 手势密码分级，如果是不重要的帐号，就画圆圈；支付密码全部用123456即可",
				"added": 1515511482
			}
		],
		"1_1FvNyzBipKed6VtnaSBhvq2J5pLnzVXd38": [
			{
				"comment_id": 61,
				"body": "看过我本初中系列，里面的女模特颜值堪忧，出名看来很艰辛了。这社会，谁都不容易啊。",
				"added": 1515590702
			}
		],
		"19_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 64,
				"body": "社区自治，社群自治的长期压制，造成基层秩序真空，这种真空会被更有生命力的秩序填补。美国退回孤立主义，两亿穆斯林的包袱就甩给了东亚的中国和俄罗斯，而中国恰好有八个大大所需的土壤——物质资料丰富而基层秩序真空。",
				"added": 1516019270
			}
		],
		"1_1EYETZ2c8nCM2kit4KSR3D6rZQJ9SVQo1U": [
			{
				"comment_id": 65,
				"body": "如果你贱卖你的权利，很有可能你这个权利是假货",
				"added": 1516019656
			}
		],
		"7_1M6V4wECbz5e1aUmuij2BB72ensHCYNFmd": [
			{
				"comment_id": 66,
				"body": "局域网搭建网站大家都可以访问，不需要ZeroNet\n如果贵公司正在局域网密码研究区块链准备上市，请告知HR的联系方式",
				"added": 1516031544
			}
		],
		"1_15PkTh9DC2wPmrGrQoYVQ6xJLobdanakd4": [
			{
				"comment_id": 67,
				"body": "一个讨论动漫，艺术，科技和中国人的网站",
				"added": 1516031721
			}
		],
		"447_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 69,
				"body": "连老总都被白完女间谍睡了，还要怎么统战？谍战片都没这么狗血。",
				"added": 1516459320
			}
		],
		"2_1G58PQ7Ena3mARGX2p5mYH7yHcBWRLX2Pa": [
			{
				"comment_id": 70,
				"body": "会占用。连接其他用户获取内容，和BT下载原理一样。",
				"added": 1516459361
			}
		],
		"15_1K7tW4WEbso38uMs4RN3W7GihA6tTqrApz": [
			{
				"comment_id": 71,
				"body": "世上90%以上的知识都是英文和拉丁文的。学英语比翻墙更要紧。",
				"added": 1516626381
			}
		],
		"55_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 72,
				"body": "取决于发帖者的知名度、影响力",
				"added": 1516626491
			}
		],
		"2_1JmBwcsrovPGXG9c2VHbYHe7WBBF4xuTq6": [
			{
				"comment_id": 74,
				"body": "I2P介于Tor和ZeroNet之间，Intetnet出口很小，主要用于去中心化建站",
				"added": 1516722764
			},
			{
				"comment_id": 83,
				"body": "> [beidou](#comment_5_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2): i2p搭建是否非常麻烦？\n\n不麻烦",
				"added": 1517570327
			}
		],
		"1_14T35ZiGRTHgHmTrpaUmoziyGvwdrXb4fi": [
			{
				"comment_id": 75,
				"body": "为什么要更新PAC，哪个浏览器没有代理规则扩展？",
				"added": 1516722795
			}
		],
		"1_12hoUNhQQKj1qtjbqNt6JWpVBjWNok7k2c": [
			{
				"comment_id": 76,
				"body": "> [borber](#comment_15_12hoUNhQQKj1qtjbqNt6JWpVBjWNok7k2c): 好的谢谢 置顶贴很详细 然后看花了眼 等我过两天实践一下 大佬 我还想问一下 安卓下 零网的数据都在哪里？\n\n分布式存储在用户电脑中",
				"added": 1517225763
			}
		],
		"32_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 77,
				"body": "哪个美国巨头被招安，出卖美国公民信息，把美国公民绑架交给中国了？我看是你无法避免阶层掉队，被做成烤人排吧！",
				"added": 1517234994
			}
		],
		"2_1PBMVMMVVtSK6FmMbfz4fhEw5fv6eZs5Dn": [
			{
				"comment_id": 78,
				"body": "> [niba](#comment_23_13BXkTJitXqtj4eL1qxXNgX45Fv5prutc1): bt sync收费？不更新就行了啊。。而且就算要收费也是中继服务器不能连接吧。。只要有机器有公网ip，别人应该就能连\n\nGFW和运营商都会封tracker，协议模糊做得没有电驴好。",
				"added": 1517327048
			},
			{
				"comment_id": 79,
				"body": "建议搞一个ZeroNet网站，分享电驴资源",
				"added": 1517327085
			}
		],
		"3_14XYi3bWZAyZ7nWnicpcGyX3awQTP21DhF": [
			{
				"comment_id": 80,
				"body": "希望能吸引更多开发者，把应用场景拓宽一下",
				"added": 1517493743
			}
		],
		"10_1CqfyVGcK8TzbFTmStufTBCgSAM29DvSPf": [
			{
				"comment_id": 81,
				"body": "就像你的网络不好的时候，BT、电驴也能断断续续下载。ZeroNet不过是加了一层处理，下载多少展示多少，如果网络实在差，可能看到的网站就是没有人发帖回帖。",
				"added": 1517493893
			}
		],
		"12_1CqfyVGcK8TzbFTmStufTBCgSAM29DvSPf": [
			{
				"comment_id": 82,
				"body": "你来做一篇教程",
				"added": 1517493940
			}
		],
		"1_12PQaM9A6eaqpyG8cG8sJ6Y7c3Z456tXTt": [
			{
				"comment_id": 84,
				"body": "居然有声音",
				"added": 1517576113
			}
		],
		"43_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 85,
				"body": "这就是五毛逻辑\n自杀也是死，反抗也是死，这个司机死了，但是没有反抗。楼主编造了“勇于以死来反抗”这一背离事实的表述\n“你们呢？你们的赞反映了你们也对专制不满，却苟活着并盼望着有人牺牲自己去专制抗争”——支那思维的人，你和他谈论一个客观事实，他总想着咬你一口，而不是和你就事论事",
				"added": 1518181100
			},
			{
				"comment_id": 86,
				"body": "> [coolplay](#comment_46_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 国内反抗不起来，被控制的死死的，这届政府只能被外界推翻，灭亡。\n\n效忠八个大大，常念古兰经，自然会等来解放的",
				"added": 1518184923
			},
			{
				"comment_id": 89,
				"body": "> [coolplay](#comment_48_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 谁是八个大大，说不定穆斯林真的会来，不过是带着毁灭来。\n\nhttp://127.0.0.1:43110/GFWtalk.bit/?Topic:5_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV/\n共产党将基层自发组织消灭，造成社会原子化，这是一个秩序的真空，这个真空会由更有生命力的新秩序来填补，也就是八个大大的穆斯林秩序。生活在穆斯林统治的国家，好过大洪水中被张献忠做成烤人排，这已经是中国人最好的归宿了。当然大洪水下多数中国人还是只有吃烤人排和被做成烤人排两个选项，穆斯林秩序都高攀不上。",
				"added": 1518185831
			},
			{
				"comment_id": 90,
				"body": "> [coolplay](#comment_51_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 你信穆斯林？中国人确实没有信仰，但有古老的传统。穆斯林在中国都被压的死死的，新疆都断网了，有什么用？\n\n不要谈到宗教就想到信仰。穆斯林首先是一种社会秩序，和黑社会、大陆法、普通法一样。",
				"added": 1518186832
			},
			{
				"comment_id": 92,
				"body": "> [coolplay](#comment_52_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 好吧，那穆斯林是怎样的一种社会秩序，你跟我说说？\n\n以最大化生存繁衍为目的，等级分明，辅之以严刑峻法，要求放弃相当一部分个人权利，尊重血统和武功的社会秩序。不自由，不平等，不博爱，能不死人就不错。",
				"added": 1518187555
			},
			{
				"comment_id": 94,
				"body": "> [mrc](#comment_14_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 以死来反抗不是和对方打斗至死方休，而是以自杀的方式来反抗这个吃人的体制。\n\n自杀是否让体制受到伤害？自杀是否遏制了体制作恶？\n万一自杀加强了周遭人的无助感，助长了体制的嚣张气焰，说得不好听些，自杀的人不就是用肉身献祭体制的帮凶么？\n\n政治德性依赖武力，杀人显武德，多杀多积德，少杀少积德，不杀最缺德。",
				"added": 1518224785
			},
			{
				"comment_id": 95,
				"body": "> [coolplay](#comment_54_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 自杀不能反抗，然而传播自杀的思想可以反抗，如果所有人宁可自杀也不接受奴役，他们就没有人来奴役。所以我们应该宣传不接受奴役，宁可毁灭也不可。\n\n每个人都可以花钱登广告，然后聪明人登广告可以赚回来，蠢人登广告白花钱。\n每个人都可以自杀，自杀的消息必然会传开。然而有的人自杀成了英烈，成了上帝的儿子，有的人自杀了只会被人嘲笑为精神不正常，家人也会被邻居指指点点。不考虑受众的反应，自杀也是白死的。\n中国人这种脑子过剩德性不足的民族，恰好不适合用杀生成仁来感化和激励。男儿杀一个人，全村都忌惮他的父母，杀十个人，死后村干部逢年过节要送慰问（维稳）津贴上门。要是杀够杀足，一代代的红领巾小朋友就会来敬礼了。",
				"added": 1518236455
			}
		],
		"1_1C1xiK3kkgRaVamhPaeNavS7LxBWxSRvpa": [
			{
				"comment_id": 87,
				"body": "没有英文主页，限制了全球普及；不开源，用来分享私人数据会有些担忧",
				"added": 1518185042
			}
		],
		"46_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 88,
				"body": "你是放不下邪教洗脑。达赖尊者几时教你放下对红尘的牵挂了？",
				"added": 1518185522
			},
			{
				"comment_id": 91,
				"body": "> [0emaneht0](#comment_217_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6): 搜索人皮唐卡\n\n作者 陈涤 （吉林省美术家协会副主席）",
				"added": 1518187334
			}
		],
		"3_1FzBvZNWDYzZ94e4UzvYDrnqB9TsfonS6v": [
			{
				"comment_id": 93,
				"body": "对于你的浏览器来说，它只是和127.0.0.1这台服务器通讯，这台127.0.0.1就是你的本机电脑。",
				"added": 1518188920
			},
			{
				"comment_id": 96,
				"body": "> [tim0net](#comment_18_1FzBvZNWDYzZ94e4UzvYDrnqB9TsfonS6v): 他不是要发五个节点吗，如果只放在本地，一关机就不能下载了\n\n五个节点叫做确认。上传是上传，确认是确认。",
				"added": 1518355166
			},
			{
				"comment_id": 97,
				"body": "> [tim0net](#comment_19_1FzBvZNWDYzZ94e4UzvYDrnqB9TsfonS6v): 也就是其他节点没有下载,如果关机其他人就无法下载了?\n\n是的，和BT电驴一个道理。\n浏览器把文件传给HTTP Server 就算上传完成，ZeroNet的HTTP server就是http://127.0.0.1:43110/，就是本机",
				"added": 1518359622
			},
			{
				"comment_id": 114,
				"body": "> [tim0net](#comment_22_1FzBvZNWDYzZ94e4UzvYDrnqB9TsfonS6v): 但是我看数据上,我的文件有四个节点都保存了又是怎么回事\n\n你把链接发给我们测试一下就好了",
				"added": 1518527826
			}
		],
		"8_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 98,
				"body": "十二、回乡\n\n\n*    *    *     *    *    *\n\n1月24日（星期三）\n\n\nICU外一夜无事，预计还能有2天，于是早上从医院赶回家开车。碰上地铁限流，长长的队伍排不到头。\n\n\n10点到家，把所有衣服扔进洗衣机洗，冲澡还没有2分钟。\n\n\n电话响了。\n\n\n夫人：“爸爸不行了，医生说这次真不行了。你和妈妈赶快到医院。”\n\n\n先给外甥打了个电话，让他去支援。昨天心里还犹豫叫他抬遗体是否合适，紧急关头也顾不上了，只是叮嘱他务必带口罩。\n\n\n开车冲出小区，还没上高速，夫人来电：“人已经没了。你们马上把爸爸的户口本拿过来，开死亡证明。”\n\n\n我问：“爸爸的户口本，还是我们的户口本？医院不强制送太平间吧。”\n\n\n夫人：“爸爸的户口本。死亡证明要四个东西：医生签字、死者身份证、死者户口本、办理人的身份证。其他我都有。\n\n医院这边同意送殡仪馆，我马上叫殡仪馆的车。”\n\n\n赶回去拿了户口本，一上高速匝道就发现上面水泄不通，自己太急了，上匝道前没注意高架桥上一动不动。挪动了半天，发现前面三车连环相撞，每个车主都有理，在那里吵架不挪车。\n\n\n越是着急，越容易堵车。自己当时就不应该相信导航显示的一路畅通，绕点远就好了。\n\n\n30分钟，只开了10公里，夫人又来电话，我正担心女人抓狂哭，夫人却说：“你们也别着急了，我们这边出了些情况。”\n\n\n快到医院时，夫人又来电话：“殡仪馆的棺材到了，你们到哪里了，能抬吗？”\n\n\n近是近，但小车、大车、三轮车、快递摩托、行人挤来挤去，动弹不得。\n\n\n于是只能夫人和外甥下去抬棺材。\n\n\n等我到了，拿了户口本给夫人，她去办手续。岳父的遗体已经穿好衣服放在棺木里，我带上手套，把衣服塞在棺木里，合上棺木，五个男人开始往外抬。\n\n\n遗体非常沉，习俗还要求中间不能落地。我们先是把一电梯的人都请下来，到一层还走错了，找到大厅后门，送上行车。\n\n\n外甥和一位亲戚随车，我们赶忙去在死亡证明上盖章，盖好后急速驰往殡仪馆。\n\n\n在车上，夫人说：“爸爸就是要我办事啊，这一小时，我连悲伤的时间都没有，一秒钟不停：\n\n1）\t大夫通知进去看最后一眼时，真的就是最后一眼了。心跳显示为0，心电图很长时间才有一点点起伏。\n\n2）\t随后就被请出病房，开始办手续。大夫一听家属要求走殡仪馆，一点没迟疑就说可以。\n\n3）\t急电我们取户口本。\n\n4）\t给殡仪馆打电话，向对方保证医院这边没问题，定了木棺。\n\n5）\t一位男子S表示可以帮忙穿寿衣，抬棺木，200元。当然同意。\n\n6）\t再请了ICU一位男性护工H帮忙。\n\n7）\t医生确认病人死亡，撤下人工肺。护士用纱布填塞各处创口。\n\n8）\t遗体消毒。\n\n9）\tS确实专业。让我们给病人剃须。而且寿衣不是一件一件穿的，而是套在一起穿的。而且各种配件的穿戴都有讲究，他很麻利。夫人小送了一口气。\n\n10）意外出现了。腹部的一个创口，护士处理的不够严密，大量流血，寿衣都被浸透了。\n\n11）\t紧急打电话问老家先生，先生表示不能穿带血的衣服走，必须换。\n\n12）本来打算再让亲戚跑一趟，S说可以让人送到医院，马上定了一套。1800元，是亲戚那天买的半价。\n\n13）护士再度处理创口。\n\n14）殡仪馆问：是否需要灵堂、追悼会、给遗体沐浴，回复都不要。\n\n15）衣服送到。再穿衣服，身体已经不热了，很不好穿。\n\n16）殡仪馆行车到。\n\n17）找医院的管理人员，打开后门的锁。\n\n18）去行车抬棺木。行车司机态度很不好，直接冲着夫人吼：“你们为啥不走太平间！”\n\n（司机大哥，没走太平间你拿不到回扣，但至于这样对家属吗？？）\n\n19）把棺木抬上ICU。\n\n20）将遗体放入棺木。”\n\n\n夫人后来对我说：“你选一条堵车的路也好，否则岳母看到遗体上的满身创口，不知道会哭成啥样。她前面埋怨自己没有照顾好爸爸，染上了这怪病；看到这样又会自责给爸爸上了人工肺，让他受了不少苦。尤其是后面创口没处理好，往外涌血。”\n\n\n又说：“S信息真是灵通，大夫通知我后没5分钟，他就出现了。我给了他500元，毕竟穿了2次衣服，第二次挺难的。另外H给了200，谢谢他愿意帮忙送爸爸最后一程。”\n\n\n到了殡仪馆，棺木从行车上移动到特制的推车上，严密吻合，不需要人再抬。\n\n\n问下午是否可以火化。\n\n殡仪馆说：24小时都可以，但习俗最好在天亮时火化。\n\n（太平间的X说火化只能是早上，如果家属不知情，那么下午和晚上过世的病人，自然会到他那里。）\n\n\n老家的先生要求夫人打开棺木，用毛巾沾酒给父亲做一个简单的仪式，还有不少词。我们觉得这没有人教着做，搞不定。还好，殡仪馆旁边就有小店，一说买酒，就有人表示可以指引家属做仪式。\n\n\n选好骨灰盒，殡仪馆经办人严格核对了两遍信息，所有证件所有信息匹配，开始进入火化程序。\n\n\n工作人员两次要求家属向遗体致哀，同时确认遗体为死者本人。然后所有家属随同工作人员到火化炉前，目送棺木缓缓滑向炉膛。\n\n\n我们磕头，岳母和岳父的妹妹哭得无法站立。\n\n\n工作人员随即要求家属离开，到休息区等候。\n\n\n夫人开始通知岳父的兄弟姐妹，我开始定机票。首都航空的APP是我用过的最烂APP，没有之一，提交订单后等了1分钟，显示“请求异常，session获取失败”。再订票，我们4个人，只有3张票了。\n\n\n定不了第二天首都航空去鸡西的票，就开始定国航飞佳木斯的票。到了最后一步，夫人突然大喊别买别买，老家先生要求明天必须在中午12点前结束仪式，明天飞佳木斯来不及。\n\n\n于是定了当天最晚一班飞佳木斯的航班，19点。留下夫人岳母取骨灰，我和二姑父赶去酒店取行李。\n\n\n堵车、堵车、堵车！\n\n\n后来被迫兵分两路，夫人和二姑二姑父先带爸爸骨灰走，确保能赶上飞机。我回家里取衣服，如果赶不上，就第二天一早飞佳木斯。我回家抓上一把衣服塞进行李箱就走，还好赶上飞机。\n\n\n候机时，夫人又哭。她和姥姥取骨灰时放入骨灰盒时，发现岳父骨髓都是黑的。这段时间治疗用药很猛，岳父没少遭罪。\n\n\n临降落时夫人告诉我明天凌晨4点出发赶回老家。\n\n\n我不同意，要求推迟到6点出发：\n\n1）4点从佳木斯出发，意味着亲戚要凌晨2点从老家出发，睡眠严重不足。\n\n2）天黑、雪大、路滑。\n\n\n夫人表示先生已经算好了，早上8点烧纸，必须4点走。路况确实不好，要预留时间。\n\n\n我又再次描述自己黑夜开车经历的种种惊险，雪地本来就不好控制车况，而且风大有严重的风炮（大风把雪刮起，视线受阻）。\n\n\n夫人全家不同意。我只好妥协，但说明我们两人不乘一辆车，万一出问题，还有另一人照顾岳母和孩子。\n\n\n心里还是觉得不安。给大徐发了给消息：如果我有情况，孩子就拜托你了。\n\n大徐大惊：大半夜你吓人玩啊？染上病进ICU了？\n\n\n*    *    *     *    *    *\n\n1月25日（星期四）\n\n\n凌晨出发。零下31度，北风5级。\n\n\n车行到郊区，停下来让夫人“摔盆”。\n\n我们跪下，夫人把泥盆举在头上，随先生说了一段话，然后用力把盆扔向远处摔碎。\n\n\n六道车光在高速公路上疾驰，晨曦初露，唤醒鸟儿在天空飞翔。岳父再也看不到这些了，我们希望他像《寻梦环游记》那样有个美好的生活，更希望他就在身边，看看他的外孙女，再喂她巧克力。\n\n\n进入城区，头车开得极为怪异，不是黄灯加速，就是远远看到红灯就减速。亲戚解释，风俗就是车不能停，红灯也不行，宁可右转绕圈。\n\n\n7:40，车在大道边的空旷处停下，准备“烧纸”。我一下车就被冰封了，脸如刀割，呼出的空气遇到口罩就结冰，冻得鼻子发痛。\n\n\n路边停了七八十辆车，把4条车道占了2条，都是来送岳父的同事和朋友。看了这阵式，我想岳父在家有点脾气也是正常的。寻思自己走的时候，不会有这么多的人。\n\n\n把骨灰盒请下车摆好。道边一辆厢式货车的门突然打开，大家开始往下卸东西。小的有纸手机、纸电脑、纸元宝；大的有纸别墅、纸车子。车子上还特意画了岳父喜爱的路虎车标。特别是一匹红色纸马，如真马大小，风起马毛飘扬，风落马毛带雪。\n\n\n30多分钟，各种仪式做完，开始点火。火光冲天，这“烧纸”可比南方一叠一叠小纸钱烧起来有气势多了，纸房子车子小马化为灰烬，希望岳父能在另一个世界过得潇洒自由。\n\n\n百多位亲朋，和我们一起在东北也难见的寒流中，与岳父道别。\n\n\n*    *    *     *    *    *\n\n1月27日（星期六）\n\n\n“圆坟”后，我和夫人从佳木斯飞回北京。\n\n\n过去一个月，就像在噩梦中奔跑，一刻也不能停。想从梦魇中醒来，却摆脱不了命运。\n\n\n回到家，吃饭时岳母突然问了一句：“你爸真的走了吗？”\n\n\n我愣了一下。衣架上挂着岳父的衣服，家里仿佛还有他的影子；微信里有他的语音，仿佛还嚷嚷着要再去泰国吃榴莲。\n\n\n但又一想，确认是走了。\n\n\n女儿还不能理解死亡，大喊：“我要姥爷给我吃巧克力。”\n\n\n生活就像一盒巧克力，你永远不知道会尝到哪种滋味。\n\n\n========================\n\n\n感谢在这段日子支持我们的亲人、朋友、同事和领导！\n\n\n很幸运此生与你们同行。",
				"added": 1518439425
			},
			{
				"comment_id": 99,
				"body": "十一、弥离\n\n\n*    *    *     *    *    *\n\n1月23日（星期二）\n\n\n回到家不到3个小时，凌晨一点，夫人急电：“大夫说爸爸可能只有2个小时了，你和妈妈抓紧过来，我请二姑去买寿衣了。”\n\n\n人太疲劳了，没有开车，打上首汽奔往医院。\n\n\n车上，夫人又来电：“大夫说如果心脏停止跳动，医学上可以采用电击等抢救手段，问家属的意见。”\n\n\n我说：“算了吧，爸爸已经受了很多苦了。”\n\n\n电影上，病人会睁开眼睛，摸着你的脸庞，说最后一句话，让你照顾好自己。\n\n\n艺术温暖，现实冷酷。病人满头纱布、满脸胡须、全身管线、毫无知觉，只有微弱的心电图，不断报警的血氧和心跳指标。\n\n\n我们自问自答，让爸爸放心，会照顾好妈妈，照顾好宝宝，照顾好自己。\n\n\n虽然已经没有希望，医生还是要进行抢救，很快让我们离开了ICU。\n\n\n和夫人坐在外面等通知。夫人问：“你印象中第一次记得你爸爸的印象是什么？”\n\n答：“不记得了，我总是尽力忘记童年。”\n\n夫人说：“我印象中第一次记得爸爸，是他起床帮我冲奶粉，我应该比女儿现在还小吧。”\n\n\n凌晨三点，二姑帮忙买寿衣回来了，3600。虽然事前在某宝上也看过，但不到最后一分钟，不可能去买。而要用的时候，也不可能等。\n\n\n亲戚告诉寿衣店主，人是因为感冒走的，还以为店主会很惊奇。谁知店主一点都不意外，说感冒已经害死好多人了，从发病到走时间都很急。\n\n\n8小时前，我给航空公司打电话，问携带病人的规定。\n\n8小时后，我给航空公司打电话，问携带骨灰盒的规定。\n\n\n民航规定如下：\n\n1）乘客可以携带骨灰盒登机；\n\n2）骨灰盒的外包装和乘客的举止，应该不引起其他乘客的反感。\n\n\n天色渐亮，但并没有进一步的消息。没有消息就是好消息，医生的抢救延续了生命。\n\n\n早上10点主治大夫和我们谈话，说最新检测表明肾功能衰竭，问是否需要透析。我们回答不必了。\n\n\n谈话后，我去找太平间。凌晨夫人问过大夫，病人走了之后怎么办？大夫回说找太平间，走流程。\n\n\n太平间在医院一个独立小楼，没有任何标志。电梯只能到地下二层，下去后，两侧门紧锁，没有任何工作人员。回到地面，发现门上写了个联系人X的电话，打了过去：\n\n\n我：我们希望人走了之后，尽快火化，请问程序。？\n\nX：病人走了之后，让科室给我打电话就行。是哪个科的？\n\n\n我：请问大概时间？\n\nX：你们要做三天、五天还是七天？\t\n\n\n我：不做。回老家办，是否当天可以送火化？\n\nX：只有早上火化，看你们时间了。\n\n\n我：费用是否从医院押金里扣除？\n\nX：不行，只收现金。\n\n\n我：不走医院的帐？微信支付可以吗？\n\nX：不行，只收现金。\n\n\n不走医院账，只收现金，这也太怪异了。\n\n\n晚上和家人商议，大家都觉得有问题。二姑说前几天看到有人从医院正门直接把棺材抬到行车上的，让我直接联系殡仪馆。\n\n\n马上给殡仪馆打电话，对方表示：只要你能把遗体从医院弄出来，就可以，不需要走太平间的流程。而且殡仪馆是政府定价的，不会漫天要价。至于太平间，大多数都是承包的。\n\n\n我问：“北京还能不让家属搬遗体？”\n\n殡仪馆：“关键是死亡证明，没有死亡证明，我们什么都不能做。”\n\n\n我问：“棺材随车能带过来吗？能派几个人帮我们抬一下吗？”\n\n殡仪馆：“有木棺，有纸棺，随车带。没人给你抬，花钱也没有，自己抬。”\n\n\n挂了电话，想想承包太平间门道不少。不用拦遗体，就说人不在，办不了死亡证明。拖家属几个小时，家属也只能怂。\n\n\n全家讨论了下，觉得戊医院不至于。负责太平间的部门可能有些好处，但医生不会做这种事。万一不让抬遗体或者不开死亡证明，先投诉，再不行就报警。",
				"added": 1518439479
			},
			{
				"comment_id": 100,
				"body": "十、转院\n\n\n*    *    *     *    *    *\n\n1月22日（星期一）\n\n\n早上提交了工作计划，老板让我去上海总部汇报。考虑了岳父的病情，认为这周问题不大，下周比较危险。定了晚上的机票，准备去上海工作一周。\n\n\n下午4点30分，夫人来电：“今天做了CT，结果出来了。大夫让家里能来的人都来。你马上过来，妈妈刚上地铁回家，二姑还在献血车旁，我都让她们赶快回来。”\n\n\n1小时奔到医院，一位此前未谋面的大夫已经在和家人沟通了，话很委婉，事实是我们预料到但不希望出现的：\n\n\n1）会诊认为医学上没有继续治疗必要。\n\n肺部全部被细菌和病毒感染，呼吸衰竭，肾功能衰竭，肝功能衰竭，消化道出血，蛛网膜下腔出血，低蛋白，高钾血症，高钠血症。\n\n\n2）建议病人转院。\n\n留在戊医院当然可以，只是每天费用2万多。\n\n\n让我们转出可以理解，每个医院都不希望增加自己的死亡病例，在各项考核统计上数字都不好看。\n\n\n现在的问题是，没有小医院愿意收。\n\n\n家属一起讨论了会，我又回ICU，和一位男大夫沟通了4个问题：\n\n\n问1：是否可以做肺移植？\n\n答1：肺移植在整个呼吸系统健全，只是肺功能不良的情况下才可行。现在不具备条件。\n\n\n问2：是否可以把病人接回家？\n\n答2：有传染可能，不建议这么做。\n\n\n问3：能否在ICU停止治疗？\n\n答3：违背医学伦理和医生职业道德，不可以。\n\n\n问4：继续用药可能维系多长？\n\n答4：不好说，可能很长，可能很短。\n\n\n家人都没有时间悲伤了，讨论了1小时，决定回老家的医院。老人不喜欢北京，让他从家里走。\n\n\n回老家走要解决两个问题：一是回家，二是当地医院接收。\n\n\n亲戚说，ICU更衣室就有120救护车小卡片，C病房的病人给了我们999的小卡片。我们打电话咨询，信息如下：\n\n\n1）120急救车：10元每公里，药品费用另算。配2名司机轮流驾驶，另有一名大夫。预计2小时内出车。\n\n\n2）999：表示东北地区道路下雪封路（不实），建议用医疗专线飞机运送到临近机场，再上当地救护车。航线预计24小时能够审批完成，预估飞行费用50万、除冰费用10万。我赶忙表示：离小目标还很远。\n\n\n3）民航。需要满足下列条件：\n\n    病人需要有医院开具的“适宜乘坐飞机证明”；\n\n    需要提前72小时申请；\n\n    在有座位情况下，将拆除经济舱后部2排共计12个座位；\n\n    担架病人价格为12个经济舱全价，陪同人员另行购票；\n\n    制氧设备仅限符合某标准的产品，不能携带其他电子医疗系统。\n\n\n民航不满足条件，医疗专线飞机负担不起，只能选救护车。\n\n\n当地医院一开始也不愿意接收，一是增加死亡病例，二是怕家属在本地闹事。我们马上找人，说明家属有心理准备，患者女儿在北京有正式工作，绝对不闹事。\n\n\n有了担保，当地医院可能也想看看人工肺这套系统的实际运用，同意接收。准备出ICU床位，希望我们尽快获得戊医院诊疗方案，他们准备药品和器材。\n\n\n赶忙回到医院，准备办转院手续，但院方不同意带走人工肺设备。\n\n\n我分析说：\n\n1）院方不希望病人在院内死亡；\n\n2）我们感谢院方为减轻我家庭负担的建议，配合院方进行转院；\n\n3）病人离开人工肺系统，活不过5分钟；\n\n4）院方不让带走人工肺系统。\n\n没有人工肺，大家都达不成目标。我们保证在病人离世后，第一时间按医院标准将人工肺设备送回。\n\n\n大夫表示医疗设备属于国有资产，带出医院需要走流程，让我们明天早上再来协商。",
				"added": 1518439507
			},
			{
				"comment_id": 101,
				"body": "九、生机\n\n\n*    *    *     *    *    *\n\n1月15日（星期一） \n\n\n亲戚发来老家的《异地医保报销申请单》，里面有一项是所在地居委会或者派出所盖章，证明申请人在异地居住。\n\n\n先去了居委会，开始一切顺利，但在一处卡住了。\n\n\n《申请单》上写的是“经办人章”，我请经办小姐姐签字。\n\n经办小姐姐表示：“这里写的是章，如果是‘经办人’，或者是‘经办人签字’，我马上给你签。我们按规定就是没有人名章的。我是为你好，你要是拿回去用不了，还不是耽误你的事。”\n\n我反复强调没事的，有样本，经办人就是不同意。\n\n\n磨叽了十分钟，经办人建议去旁边派出所，派出所的人员都有人名章。\n\n\n到了派出所，派出所表示不属职责范围，不盖章，建议去旁边社保中心。\n\n\n到了社保中心，工作人员表示证明居住不属职责范围，建议去旁边街道办事处。\n\n\n街道办事处没说不属职责范围，但要求黑龙江先盖章或者出个申请函。\n\n\n出来吹了会冷风，琢磨下还是居委会难度最小。\n\n\n于是走进居委会，摘下口罩，说明岳父得了SARS般凶猛的流感，在ICU生死未知，然后干咳几声。\n\n屋内一片死寂，然后两位小姐姐突然也开始咳嗽了。\n\n经办小姐姐犹豫了一下，突然也觉得喉咙发痒，咳嗽几声，接过去签了字。\n\n\n*    *    *     *    *    *\n\n1月16日（星期二） 下午\n\n\n夫人打电话，说拍片结果有好转。\n\n从发病以来，每次拍片结果都是恶化，总算看到一点病毒自限的曙光\n\n夫人说住院大夫心情也有好转，探视时她一进去大夫就过来交流，讲了差不多半小时。此前，大夫讲3分钟冰冷的事实，就会主动离开，避开家属绝望的目光。\n\n\n大夫预计明天做CT。由于上了人工肺后，做CT远比拍片复杂，需要将病人移出ICU才能做，我们认为这是一个非常积极的信号，说明有好转迹象，大夫需要做CT验证。\n\n\n*    *    *     *    *    *\n\n1月16日（星期二） 晚上\n\n\n一个重度垂直的呼吸科微信公众号，当晚发了一个长达2小时的视频。点开一看，戊医院的顶级专家分析病例，而病例居然就是岳父。难得有机会，听专家讲家人的病情。\n\n\n父女情深，夫人听了几分钟就听不下去了，叮嘱我不要发给岳母。\n\n\n我们解读，专家不会选一个大概率救不回来的病例。同期送进去几个病人，每人病情都很重。专家把岳父作为病例，很可能是因为岳父虽然病重，但能够救回来。\n\n\n戊医院啥都好，但大夫和家属沟通可以提高。几十万的开销对于医院不算啥，对于一般家庭却不是小数目。作为消费者，我们得到的信息极其有限，就是每天5分钟的交流。夫人经常让我找人打通关系，详细问问情况，但找不到对的路子。只能感慨：不当官，钱有毛用。\n\n\nICU的医生确实很辛苦。岳母是地级市小医院的护士，看了就感慨北京大医院不好干。医生护士从早忙到晚，中午吃盒饭。面对的都是疑难危重病人，家属情绪急切而绝望。如果要把病因、病理、治疗方案每天给家属细致讲一遍，那病床上躺的人怎么办？\n\n\n而且，家属最关心的问题：“人救回来的概率，救回来的状况，救回来的时间”，就像一个投资人问你：“上证指数重回高点的概率，涨到那以后的走势，什么时候涨到那个点位”，不好回答。而且大概率答案是提问者绝对不想听到的。\n\n\n不过，每天交流5分钟实在是太短了。视频显示科室主任、全国知名专家花了很多心血，治疗方案也考虑了多种情况。把这些信息告诉家属，有必要，而且不增加成本。\n\n\n*    *    *     *    *    *\n\n1月17日（星期三） 中午\n\n\n岳父的弟弟和妹妹赶到北京。\n\n我讲了病因病情，提到前几天A病房的病人走了。\n\n他们完全无法理解：“北京就治不好感冒？”\n\n这不是多喝水、多睡觉就能好的病吗？\n\n\n我想起以前看到的“西班牙流感”。\n\n\n1918年大流感，是第一次全球范围的传染，死亡估计超过2000万人。该流感由美国堪萨斯州一个流感疫区的青年人参军带到兵营，先是在美国各兵营传播，然后随着美军参加第一次世界大战，扩散到欧洲。在传染西班牙国王后，该流感有了他的名字：西班牙流感（Spanish Flu）。\n\n\n潜伏在一战各国伤员和轮换士兵身上，流感从欧洲扩散到大洋洲、亚洲、南美洲。在我国，当时重庆是重病区，据说“半个重庆都病倒了”。那场流感的平均致死率约为2.5%-5%，而一般流感“只有”0.1%。\n\n \n\n整整100年，科技发生了翻天覆地的变化，有了原子弹、互联网，现在AI、区块链都出现了，但还是治不好流感。\n\n\n*    *    *     *    *    *\n\n1月17日（星期三） 晚上\n\n\n夫人说B病房的病人突发脑溢血，大夫让转回小医院“静候”，否则每天在ICU也是烧钱。B家属社会能力很强，居然几个小时就找到一位脑科专家到ICU查看了病情。但脑科专家也建议放弃，当天B家就转走了。\n\n\n我心想：“这要是让我们转院，去哪里找关系呢？”\n\n\n*    *    *     *    *    *\n\n1月17日（星期三） 晚上\n\n\n岳母说，如果需要做非常艰难的决定，她去和医生说。\n\n\n我表示自己也可以。\n\n\n夫人偷偷和我说：“妈妈是怕决定不再救治，爸爸会不开心。万一有啥事，她帮我们来承担。”\n\n\n我说：“我知道，但爸爸也不会对我怎么样的。妈妈有心因性心脏不适，在那种极端情况下，她自己能否挺住都不好说。”\n\n\n*    *    *     *    *    *\n\n1月18日（星期四） 中午\n\n\n岳母的两个妹妹赶到北京支援我们，帮我们看孩子。\n\n\n我们非常感谢。也提醒她们在家也要戴口罩，开始她们并不愿意，我反复跟她们讲：“我们天天泡呼吸科ICU，不是怕你们传染给我们，而是怕我们传染给你们！”再配上岳父全身管线图片，她们也就不再坚持了。\n\n\n有她们来好多了。这三周孩子都没有下过楼，天天在家看《小猪佩奇》。以前一天只能看两集，现在一天能把所有剧集看两遍。\n\n\n有一天，女儿突然说：“我看不清了。”\n\n\n我们吓傻了，心想不是近视了吧。还好第二天带她下楼，她还可以看到天上的飞机。\n\n\n*    *    *     *    *    *\n\n1月18日（星期四） 晚上\n\n\n夫人说岳父的弟弟、妹妹下午去ICU探视时，明显感到岳父情绪激动，努力眨眼睛想要和他们说话。监控当即显示心跳加快、呼吸频率飙升，医生赶忙加大的镇静剂量，并让亲属离开病房。\n\n\n我非常诧异，岳父是有知觉的？他镇静后不是应该没知觉吗？\n\n\n夫人说：“你不知道C病房的事？把大家都吓坏了。”\n\n\nC病房上了人工肺之后效果不错，肺部有明显恢复。医生决定“拔管”（把“插管”时深入肺部的呼吸管拔出），同时用人工肺支撑氧气供给。\n\n\n拔管后，病人就可以说话了。一见到亲人，病人就哭诉：开始以为是做了噩梦，后来发现比噩梦还可怕。\n\n\n因为是真的！\n\n\n病人虽然被镇静了，但什么都知道。\n\n知道各种粗细的管子从不同部位插到自己身体里，\n\n知道血液在流出，\n\n知道是外面的机器在供氧，\n\n知道机器、血液有各种问题，医护人员忙来忙去在救她。\n\n\n她一个人躺在病床上，知道自己在生命边缘，想喊喊不出，想动动不了。\n\n\n她已经失去了对自己的控制，只能一分钟一分钟的熬。\n\n\n好不容易熬到拔了管，她滔滔不绝讲了好久，把他丈夫骂的狗血淋头，让他躺在床上来试试。\n\n\n因为太激动了，呼吸频率上升，各项指标恶化。医生加大了镇静剂量，然后又给她“插管”。\n\n\nC病房的家属在ICU外面讨论这些事，旁边“明星护工”大姐见怪不怪：“正常。很多病人出院后，都会打家人。因为实在是太痛苦了！！”\n\n\n而且病人认为：承受这种痛苦不是自己决定的，而是家人决定的。要是让自己决定，宁可死也不受这罪！\n\n\n听完我感到非常内疚。在决定是否上人工肺时，我没有考虑病人的痛苦！\n\n\n我以为病人是毫无知觉的，医生也从未和我们提过病人会有感知。\n\n\n我这时候，才理解昨天专家讲座视频里，大夫们频频提及的“谵(zhan) 妄”。意思是病人幻视幻听，严重的大脑皮质功能出现障碍。\n\n\n我认真的和夫人说：“如果我被传染了，或者以后有意外情况。绝对不允许给我上这个东西！”\n\n\n夫人不能马上说OK，这样显得太没有夫妻感情了，只是让我不要胡思乱想。\n\n\n我坚定表示：“有空了我就写遗嘱，制止花钱给我上刑！”\n\n\n话说的坚决，但心里没底。万一自己被镇静了：\n\n1）亲属想咋整我可没办法；\n\n2）医学上手段太多，不可能穷尽所有“酷刑”；\n\n想来想去，只有减少保险额度，没钱了也就不会有人上刑了。\n\n\n*    *    *     *    *    *\n\n1月19日（星期五） \n\n\n夫人和岳母天天哭，单独坐着哭、抱在一起哭，女儿一提姥爷就哇哇哭。岳母自责当时自己不应该开窗，这样岳父也不会想起来开窗，也就不会感冒，更不会进ICU。夫人说没安排岳父去西藏玩，病好了也不能去了。\n\n\n岳母比我想象得坚强，夫人却不行。虽然岳父很重男轻女，小时候没少收拾她，但她很依恋岳父。\n\n\n有一天夫人跟我说：爸爸救回来身体也很弱了，以后你就是我们家的主心骨了。\n\n\n我说：以前我挣的钱是你、你爸、你妈加起来的两倍，现在自己瞎折腾，也是你们加起来的总和。我不是主心骨？\n\n\n夫人说：不是。家里你说了不算。\n\n\n我认真反思了这个问题。\n\n\n家里生活习惯不是由学历、专业、收入来决定的，而是由脾气决定的，谁脾气大谁说了算。\n\n\n岳母和我们都很注意保养，但没有人想和岳父发生冲突，很多事情由他去。此次光膀子开窗、家人间的传染，我也有责任。如果家里我做主，这事从一开始就不会发生。\n\n\n我挣钱比他们多，但没有做决定的习惯，只会在朋友圈抱怨。一位前同事就直白的告诉我，认为我对孩子不负责任。她家老人感冒不愿意戴口罩，她一小时就收拾好行李把老人送出去住了。\n\n\n听起来很残忍吧，但她家老人孩子都没事！\n\n我很好吧，但家里有人躺在ICU。\n\n而且，只要这病毒传染性稍微强一点，躺在ICU里的就可能是五个人。如果是那种情况，四个大人或多或少都有自己的责任，但女儿确实是无辜的。\n\n\n巴菲特说过：“习惯是如此之轻，以至于无法察觉。又是如此之重，以至于无法挣脱。”\n\n\n岳父如此，我亦如此。\n\n\n*    *    *     *    *    *\n\n1月20日（星期六）\n\n\n预期周三做的CT一直没有做，我们有不好的预感。\n\n\n早上去献血车旁陪同两位无偿献血者，冬日寒风中只有我和发小卡片的人在车下转圈取暖。我感慨用血速度太快，对方不屑一顾，说最多有人用了3万cc，单位组织了一百多人献血。\n\n\n我的姐夫打来电话，表示如果需要周转，他们可以支持一部分。我妈也微信说可以支援一部分钱，我回复：活着抓紧花，别给ICU。这里一天就是你一年紧巴巴过日子的全部开销。\n\n\n下午探视，还没进病房，隔着玻璃我就可以看到岳父在用力呼吸。问护士：“这是因为自主呼吸增强了吗？”\n\n\n护士摇了摇头。住院医师走过来，和我们说：“我们设备已经开到最大转速4000转了，但他的血氧含量还在下降。只能靠肺工作增加氧气供给，所以你会看到他的呼吸增加。我们是不希望这样的，他胸腔已经有积水，压迫其他内脏，心脏功能受到影响。我们抽了两次，但情况还在恶化。”\n\n\n岳母看了5分钟就离开了ICU，心里实在受不了，我们一同匆匆回家。到家，我说明天还是要去医院，把情况和岳父的兄弟姐妹交代清楚，让他们也有个心里准备。理论上岳母讲最合适，但岳母一说就哭，决定由我说。\n\n\n*    *    *     *    *    *\n\n1月21日（星期日）\n\n\n早上到医院，请岳母在ICU外面守着，自己和岳父的两个妹妹，一个弟弟去沟通。\n\n\n首先把昨天医生讲的岳父病情复述了一遍，结合专家的视频信息进行了分析，说明情况不乐观。\n\n\n接下来说了经济情况，按前期费用估算，能够再坚持20多天。如果人工肺肺膜老化，需要6万元换一套设备，就会少支持3天。\n\n\n50多岁的长辈们老泪纵横，老叔（东北把年龄最小的长辈称为“老”，老叔就是最小的叔叔）说：“爷爷奶奶都90了，我怎么和他们说？万一你爸真走了，我怕他们难受，也坚持不了几年。”\n\n\n中午，老叔和老姑赶回东北，周一还要上班。二姑和二姑夫继续支持我们。",
				"added": 1518439536
			},
			{
				"comment_id": 102,
				"body": "八、传染\n\n\n*    *    *     *    *    *\n\n1月14日（星期日） 上午\n\n凌晨，我开始连续咳嗽。\n\n4点，服用蒲地蓝和消炎药后未有缓解。\n\n8点，一阵剧烈咳嗽，感到胸痛。\n\n心想：完蛋了，这不是被传染了吧！？\n\n\n没敢告诉岳母，偷偷和夫人说了一声，匆匆出家门前往己医院。\n\n（为什么不去戊医院？这是个好问题。）\n\n\n常有鸡汤，劝人要像最后一日那样生活。\n\n纯TMD扯蛋，最后一日你只想诅咒这个世界，你只想问老天爷：“为什么是我？？”\n\n\n回想自己的一生，有不少的遗憾，但也算够本。头脑里闪过人生的片段：\n\n1）小时候被打得丧失信念。\n\n2）读金庸小说。\n\n3）少年时一次考试后春风得意。\n\n4）被本科学校录取时的沮丧。\n\n5）研究生被梦想大学录取时的兴奋。\n\n6）领会了理论为什么不真实。\n\n7）研三和BG一伙吃喝玩乐。\n\n8）被拒绝与无心的伤害。\n\n9）工作后和相亲小组打牌消磨。\n\n10）大峡谷、黄石、布莱斯峡谷、纪念碑谷地。\n\n11）\t结婚。\n\n12）工作时看到产品规模从零飙到几百亿。\n\n13）看着女儿出生。\n\n14）一次连续偶然导致的危险驾车。\n\n15）读巴菲特理解复利。\n\n16）这一次ICU经历。\n\n\n回想自己一生胆小，要是因为别人的勇气就这么给挂了，实在心有不甘。\n\n\n想起外甥说过一句：“我觉得妹妹好可怜。”\n\n我一惊：“为啥？”\n\n外甥：“她还没长大，你就老了。”\n\n\n妈妈还有姐姐照顾，最放心不下的还是女儿。夫人买房英明，其他事情都大大咧咧，干啥都是“不当害、不当害”。\n\n\n万一挂了，保险能陪个几百万。委托大徐和朋友们帮孩子理下财，既相信他们的人品，也相信他们的投资能力，免得让钱宝、各种币、高息借贷给祸害了。只要能抵抗通货膨胀，孩子成年就好了。\n\n\n夫人叨叨：“从你到这个小公司后，我们就加买了保险，3百万保额，钱你不用担心。”\n\n\n我很坚决的说：“绝对不要给我上人工肺！！那TMD都不知道是你爱我，还是你恨我。”\n\n\n夫人在后座一边哭，一边说：“我给你买过保险了，买保险的人一般都不会有大病。”\n\n\n我问：“当初为什么没有给爸爸买一份？”\n\n夫人：“他的医保卡给爷爷奶奶开过药，保险公司出险后很可能拒赔，所以就没买。早知道。。。”\n\n\n我想了想：“你给姥姥和宝宝都买份保险吧，现在就买。”\n\n\n*    *    *     *    *    *\n\n1月14日（星期日） 中午\n\n\n挂了急诊，和大夫讲明可能被呼吸科ICU病人传染了。\n\n大夫问：“甲流、乙流？”\n\n我说：“不知道啥病毒。血、肺泡、胸腔积液的所有检查都是阴性，但几天就变成大白肺了。”\n\n大夫把口罩好好稳了稳，确认遮住了鼻子，开下检查：CT胸部平扫、验血、咽拭子。\n\n还好，一切正常。\n\n走出来，冬日的太阳都是那么和煦温柔。",
				"added": 1518439577
			},
			{
				"comment_id": 103,
				"body": "七、求血\n\n\n*    *    *     *    *    *\n\n1月13日（星期六） 中午\n\n\n接大夫通知，要求组织献血。\n\n\n我又是一脸懵逼：献多少、在哪里献、怎么认定是我献的？\n\n\n问ICU护士，护士不知道；去问大夫，大夫也不知道；让我们去问输血科。\n\n\n到了输血科，搞清楚了：\n\n1）\t不是花钱就可以在医院买到血。\n\n2）\t病人需要用血时，需要亲友去献血，以维持血库的血量。\n\n3）\t个人此前的献血证，只能用于直系亲属，即：配偶、父母、子女。也就是说，夫人的献血证可以用于岳父，我作为女婿的献血证不可以。\n\n4）\t血液科开出一页纸的《北京市互助献血申请书》，该申请书上有岳父的名字。\n\n5）\t到指定的献血车献血，不在医院献血。医院推荐了两个献血点，后来又放宽说是通州血液中心的献血车都可以。\n\n6）\t由于缺A型血，献血人必须献A型血，标注“专血专用”。但并不表示你组织的人献的血，就一定用于指定病人，由血液中心同意调度。\n\n7）\t后来几天A型血不缺了，可以献其他血型，标注“血型调配”。\n\n8）\t每200CC献血，只能有100CC血浆。\n\n9）\t献血人需要携带本人的身份证或者驾照、医保卡。\n\n10）献血后，工作人员会提供一个献血证。我们需要将献血证拿回戊医院献血科，献血科盖章表明此证已用，同时为岳父增加用血额度。\n\n11）\t献血证下次还可以用于献血人的直系亲属。\n\n\n*    *    *     *    *    *\n\n1月13日（星期六）  下午\n\n\n看了下我家这几个人，两个高度近视，余下几位都年近60，而且近期人也很疲惫，献血后出现意外更麻烦。\n\n\n病区就有人报价提供血，1000元人民币100cc。一方面觉得贵，另一方面不确定是否靠谱，决定自己求。\n\n\n先问在学校任课的老师，有没有学生愿意献血，200ml我们补贴1500元营养费。老师说：学生都放假回家了。\n\n\n接下来发动各种关系。特别感谢如下人士的支持：\n\n1）\t外甥单位领导。看到外甥发出的消息后，转发全公司，删除了我们补贴营养费的信息，改为公司补贴。而且领导还亲自为我们献血，非常感谢！\n\n2）\t外甥单位的同事。可爱的北京女孩，一听说需要用血，穿着睡衣裹上羽绒服就出门了，自费打车来回，没要我们一分钱。\n\n3）\t同学单位的同事。一听消息，不等孩子爸爸回家，就带着孩子出门来献血，不要钱。\n\n4）\t三位同学。看到夫人在天津读书的堂妹发出的朋友圈后，一位从南城坐车1.5小时，另两位从天津赶到北京献血。\n\n5）\t四面八方前来支援我们的朋友！\n\n\n一半献爱心的朋友都抱怨献血车工作人员态度恶劣。\n\n\n为了我们，你们受委屈了，对不起！\n\n\n我自己的经历也是如此，上了一辆献血车，就想确认献血额度，马上被轰了下去。献血车严禁拍摄朋友签字后的《北京市互助献血申请书》，原因不明。\n\n\n当天拿下2000cc血，心想80公斤的人总共约6400cc血，应该够用了吧。献血证送到血液科后，告知ICU有了额度，马上提走600cc血浆，相当于1200cc血。\n\n\n我和夫人一愣，费了老大劲，不够2天用。\n\n\nICU解释：人工肺在体外氧和过程中，会导致凝血因子的变化。凝血因子用于修补血管上的微小创伤，手指刺破了，血液会凝固堵住出血处，而不会失血过多，就是凝血因子的功劳。凝血因子本身又有多个子因子，用药物不好调整。\n\n如果凝血因子过多，会出现血栓。\n\n如果凝血因子过少，会出现脑溢血。\n\n所以，需要不停的用大量人的血浆调整凝血因子。\n\n\n*    *    *     *    *    *\n\n1月13日（星期六）  傍晚\n\n\n夫人在QQ上输入了“互助献血”，出现互助献血群。加群后，马上有人加好友沟通。\n\n再打了几个电话，给两处献血车旁发小卡片的人。\n\n结果都是：1500元人民币400cc。\n\n这是“物价局”统一定价吗？ \n\n对这些人，献血车工作人员的态度应该不错吧。\n\n\n*    *    *     *    *    *\n\n1月13日（星期六）晚上\n\n回到家，女儿坏笑着走过来，急忙制止她，在我洗完澡洗完衣服前不能和我接触。\n\n“X你妈，哈哈哈”女儿大笑。\n\n我一愣，这是咋回事？\n\n姥姥急忙制止女儿：“不准说，听到没，不准说！”\n\n“X你妈，哈哈哈”\n\n姥姥解释说：“下午她要吃豆沙包，蒸好后又要吃奶黄包。我心急骂了一句，她就记住了。”\n\n我只能苦笑，全家都乱套了。",
				"added": 1518439678
			},
			{
				"comment_id": 104,
				"body": "六、人工肺（ECMO）\n\n\n*    *    *     *    *    *\n\n1月12日（星期五） 上午11点\n\n\n我还在写工作规划，岳母在医院急电：“今早拍片结果还是不行，医生准备上人工肺。我也没啥主意了，你们啥意见？”\n\n\n预计顶72小时的插管治疗方案，只坚持了不到17小时。昨晚受到重大冲击，根本没来得及看人工肺的信息。我问：“大夫有说治愈概率，以及愈后预期恢复情况吗？”\n\n\n岳母说：“没有啊。就说10分钟以后听我们回话。”\n\n\n我从不怀疑戊医院大夫、特别是ICU大夫的仁心仁术；医院在核心地段建的如此豪华，也不会为了钱增加病人开销。但给我的信息太少、决策时间太紧，作为家属确实是难以接受。\n\n\n夫人作为女儿肯定是要上的，我原则上也不反对。但有两个后果要考虑：\n\n\n1）\t家庭抗冲击能力。\n\n如果钱花光，女儿、夫人、岳母和我自己以后就扛不住任何的冲击，再有人生病，ICU的门都进不去。\n\n\n2）\t愈后情况。\n\n如果救回来要卧床吸氧，对岳父的生命意味着什么、对岳母的生活意味着什么、对我们和孩子意味着什么？\n\n\n夫人麻烦了丁医院的朋友，再让他去问呼吸科大夫。回话说：“当时建议转到戊医院，就是为了上人工肺，条件许可情况下最好接受治疗。”\n\n\n我紧急电话一位医疗创业的前同事，虽然久未联系，他作为创始人也非常忙，听了诉求，立马帮助我。首先给出的建议就是：“信息不足的情况下，听医生的。”咨询后，他又发了一个截图给我：人工肺，医学上叫体外膜肺，叶克膜，呼吸科ICU终端救命神器。\n\n\n总共约25分钟，期间岳母又催了一次，说是情况已经很危急了。我尽量让自己不那么冷血的告诉岳母：“再等等。”\n\n\n既然都建议上，经济条件也能接受，我们决定上人工肺进行治疗。\n\n\n其实，我们都没有考虑一个重要的因素：岳父自己是怎么想的？\n\n\n如果有人要给你“刮骨疗毒”，刮骨很疼，疗毒的治愈率很低，你让他刮吗？\n\n\n*    *    *     *    *    *\n\n1月12日（星期五） 下午\n\n\n带着口罩见完客户后，赶在探视时段最后几分钟进了ICU。岳父从小病房移到了大病房，全身上下都是管子。\n\n\n脑后、右手、大腿侧有手指粗的管子导出血液。血浆、营养液、消炎药品等四五个瓶子，通过不同的导管从身体各处不间断的注入。护士在严密的监控各项指标，十几分钟就要加注一些药剂。岳母没有勇气去揭开被子，估计下面也全是管子。\n\n\n岳父已被镇静，任何的自主动作都可能导致血管和人工肺的连接被断开。只有监控仪上的心电图，表明生命的迹象。\n\n\n探视后，我等着医生交流病情。主治大夫开会忙没时间，负责本床的住院医师和我进行了沟通。\n\n\n本人：“请问治愈的概率？”\n\n住院医师：“不好说，看病人情况。如果是做心脏手术，只是术后短期需要人工肺支持的，概率会高些。如果病人体质较好，治愈的概率也大些。”\n\n\n本人：“贵院此前大概做了治愈概率？”\n\n住院医师：“我是轮岗到这个科室的，这个情况不清楚。对病人来说，概率意义不大，关键是个人能不能救回来。”\n\n\n本人：“病人目前情况如何？”\n\n住院医师：“不太好，他前后经历5个医院，现在感染上了医院的一些耐药细菌。我们已经给他上了最强的抗生素——万古霉素，但还是在恶化。”\n\n\n本人：“请问治愈的病人，术后生活基本能自理吗？”\n\n住院医师：“每个病人都不同。有些病人能够生活自理，也有病人需要卧床吸氧，不巧感冒引起感染，又送回ICU的。”\n\n\n*    *    *     *    *    *\n\n1月13日（星期六） 上午\n\n\n从医院得到的信息缺乏数字，只能自己挖掘信息了。\n\n\n人工肺，英文Extra-Corporeal Membrane Oxygenation，缩写为ECMO。顾名思义，就是将血液导出，由机器在体外代替肺的功能，将氧气交换到血液中，然后再输回人体。开始用于心脏手术，非典后我国也逐步开始用于支持危重呼吸病人的生命。\n\n\n现任台北市长柯文哲（柯P）最初名声大噪，就是因为他在台大医学院期间使用ECMO，将心脏功能丧失的病人生命维系了16天，然后进行心脏移植救活。\n\n\nECMO本身并不消灭肺部病毒和细菌。医生的方案是用“焦土政策”与病魔对抗。举例来说，蝗虫扫过农田时寸草不生，但草没了，蝗虫也随之死亡。现在肺部的病毒就像蝗虫，肺部肌体就像农田，治疗战略是让病毒侵蚀，等肺部都被占满了，病毒也就死了，医学上叫“自限”。等病毒死了，ECMO依然维系着患者的生命，然后肺部慢慢恢复，逐渐能够给其他器官供给氧气。\n\n\n接受ECMO治疗的患者，存活概率大约30%。\n\n（数据来源：《名医人文观•侯晓彤|人命到底值多少钱？一位ECMO医生的困惑》，http://www.sohu.com/a/121900683_377350）\n\n\n治愈的患者在ICU最短4天。\n\n（数据来源：《名医人文观•侯晓彤|人命到底值多少钱？一位ECMO医生的困惑》，http://www.sohu.com/a/121900683_377350）。\n\n\n治愈的患者在ICU最长122天。\n\n（数据来源：《记录中日医院百例ECMO时刻，回顾过去，展望2018》，http://www.sohu.com/a/214085311_655772）\n\n\n术后病人有能够生活自理的，但网页上翻来覆去就是那几个案例。我估计在存活病人中约占10-25%。\n\n\n也就是说，活下来且能够生活自理的概率：3-7.5%。\n\n\n晚上梦到一个精灵跳出来和我打赌。\n\n1）\t我下注50万元，输了这50万元归精灵。\n\n2）\t我赢的概率是5%，输的概率是95%。\n\n3）\t精灵问：赢了给你多少万，你才愿意接受这个赌注？\n\n4）\t我回答：如果赢了有1个亿，我马上下注；如果赢了只给100万，你马上滚蛋。\n\n5）\t精灵又问：如果赢了，能把亲人救回来呢？",
				"added": 1518439720
			},
			{
				"comment_id": 105,
				"body": "五、插管\n\n\n*    *    *     *    *    *\n\n1月11日（星期四） 下午\n\n\n下午3点，刚和客户微信组群聊完，夫人急电：“今天拍片结果还是不好。医生决定插管。插管后会注射镇静剂，人就不能说话了，你赶快送姥姥到医院来，我让医生务必等着。”\n\n\n姥姥正陪着沉睡的女儿，马上手忙脚乱的穿衣服，问我说：“你昨天不是说有好转吗，咋要插管了？”我无言以对，只能说：“我开车带你和女儿去医院。到了医院让二姑下来在车里看着女儿。”\n\n\n姥姥：“不行，孩子不能去医院。”\n\n\n于是用首汽约车叫了个车。姥姥跌跌撞撞冲出门时还惦记着孩子：“你给她熬个粥，蒸个鸡蛋。”\n\n\n一进ICU，姥姥哭着对姥爷说：“我没照顾好你，你不怪我吧。”姥爷告诉了手机、银行卡、股票账户的密码，但也不想增加家人的心里负担，没有当做临终时刻来对待。\n\n\n夫人有不好的预感，强忍着悲伤问姥爷：“爸，你还有什么要说的吗？”\n\n\n岳父停了些许，费力的说：“继续治吧”。\n\n\n人的一生，谁会知道自己最后一句说的是什么？\n\n\n（插管说明病已经很重了，但医护人员不会、也不适合提示病人留遗言。万一不幸走到那一步，建议家属和病人珍惜机会，我们希望这不是最后一次，但谁又知道呢？）\n\n\n*    *    *     *    *    *\n\n1月11日（星期四） 晚上\n\n\n插管结束，岳母在医院附近住下，夫人准备挤地铁回家。我觉得她情绪不稳，叫了个首汽接她回来。\n\n\n晚上，夫人先通知了岳父的4位兄弟姐妹，告知病情，让老家人也有个心理准备。再通知了岳母的6位兄弟姐妹，两个姨马上表示到北京支持我们，帮忙看孩子。\n\n\n我们讨论了一直回避的三个问题：\n\n1）\t病情\n\n直到现在，都查不出被什么病菌感染了。体温总体来说不算高，人的精神也不错，就是每次拍片肺部都是急剧恶化，没有一点好转。每个医院都反复问肺部以前是否有过病症，一遍一遍的说没有，医生一遍一遍的问，看来肺部异常恶化，情况很不乐观。\n\n\n2）\t术后\n\n大夫说如果救回来，最坏的情况需要长期卧床吸氧，好的情况能够大小便日常生活自理，但肯定不能做体力劳动，也不能出去玩了。\n\n\n好的情况可以接受。如果需要长期卧床吸氧，岳父自己很痛苦，岳母后半辈子护理的压力很大，我们也不可能做重大的改变。\n\n\n3）\t费用。\n\n插管后ICU的费用直线上升。预计插管能顶72小时，如果还不行，就要上人工肺了。人工肺开机费6万，随后每天2万起。我们估算了下，家里所有的理财（还好没有买30天以上期限的产品）、股票卖掉，再加上岳父岳母留下来养老的钱，理想情况下能撑30-40天。\n\n\n那么40天以后呢？\n\n要准备卖房吗？\n\n夫人沉默良久，说：“先卖东北的房子吧。爸爸恢复了也不能上6楼了。”\n\n我：“老家房子短期卖不掉，卖掉也就撑个十几天。如果在ICU要呆很长时间，只能卖掉北京的房子。”\n\n夫人：“如果ICU住了50天都出不来，可能真就不行了。”\n\n\n说完嚎啕大哭：“他才60岁啊，刚办完退休手续，啥福也没享。要是像爷爷奶奶那样90岁了，我也不给他上这些折磨人的东西了。但一个感冒就走了，我不甘心啊！”",
				"added": 1518440779
			},
			{
				"comment_id": 106,
				"body": "四、ICU\n\n\n*    *    *     *    *    *\n\n1月8日（星期一）下午 戊医院\n\n\n一到戊医院，直接送进ICU。护士一声令下脱光，所有衣服都给扒了扔出ICU。岳父当场没了脾气，乖乖听话。\n\n\nICU不让家属进，每天只有下午半小时探视时间。\n\n\n我晚上赶到的时候，夫人说ICU条件很好，见过的医院只有美国治疗埃博拉患者时用的埃默里大学医学院（Emory University Hospital）能匹敌。每个病人都专门有护士24小时看护，医护人员数大概是患者人数的4倍。无创呼吸机已经上了，血氧量回到90以上。而且有创呼吸机、人工肺（ECMO）都有，万一病情恶化，人应该也能抢救回来。\n\n\n报完喜，自然就该说“但是”了。她签了一大堆文件，各种治疗手段，看了脊柱都发凉。虽然大夫反复表示非必要不使用，但人肯定要遭不少罪。\n\n\n此外，ICU的费用大概是每日8000-20000元，我们要努力挣钱。\n\n\n我马上表决心：白天投资茅台，晚上杠杆炒币。\n\n\n*    *    *     *    *    *\n\n1月8日（星期一）晚上 \n\n\n岳父2年前借给当地“知名土豪”SB哥10万元，当时说好周转一下2周还，然而2年也没见过钱的影子。岳母和我们虽然知道，一直也没敢当着岳父面提，生怕他一激动出问题。\n\n\n现在人已经进ICU了，缺的就是钱，赶紧请对方还款。这个SB听到消息心里面乐开了花，巴不得岳父早点走。回答很干脆：“没钱！”\n\n\n珍爱生命，远离土豪。\n\n\n*    *    *     *    *    *\n\n1月8日（星期一）晚上 \n\n\n从医院回家后，在下面给车充电折腾了会，进门一看夫人正在和孩子玩，竟然没有洗澡。忙问洗手洗脸了吗？答洗手了，没洗脸，因为回来就换了个口罩（在医院用的口罩在家不能用）。我马上要求：先洗澡，才准接触孩子。严格执行！\n\n\n过了一会，孩子忽然开始咳嗽了。\n\n\n我无比紧张，万一传染上可咋办。后来夫人和岳母说她们的压力更大，要是孩子传染上，不知道我会怎样发神经。\n\n\n*    *    *     *    *    *\n\n1月9日（星期二） \n\n\n早上起来，孩子没有发烧，白天也没太咳嗽。大家都松了一口气。\n\n\n夫人脸色不佳。说一晚没睡，身体上很困，心里很焦虑。不知道病啥时候好，不知道要花多少钱，感觉分裂成两个人。我嘻嘻哈哈安慰了会。\n\n\n岳母在下午探视时段进了ICU。岳父精神奕奕，向岳母表示：“我这身板没问题”。岳母表示她代表全家，相信岳父的身体，相信岳父能够在ICU病友中第一个转到普通病房，在所有病友中第一个回家。\n\n\n晚上回到家，岳母问我们：“为啥他现在还那么得瑟？”\n\n\n我马上表态：“得瑟是好事，说明正在全面恢复！”\n\n\n饭后，夫人讲起ICU外面有位大姐，不仅熟悉办饭卡、为陪护租折叠床、隔尿垫品牌等杂务，而且精通北京呼吸科的疑难病例、名医趣事、治疗程序、术后护理等。说是北京知名的呼吸科“明星护工”，肺移植病人常常要等她的档期，才能约上。\n\n\n*    *    *     *    *    *\n\n1月10日（星期三） \n\n\n岳父在ICU的8个病房中，被从较大的病房转移到最小的病房，体温和血氧指标也相对平稳。探视时，岳父还抱怨医院的饭菜不好吃。\n\n\n我晚上很乐观的给岳母解读：“最小的ICU病房空间不大大夫在那里给他做手术很不方便。把他移到那个房间，估计是大夫认为他恢复不错，没有手术必要。”\n\n\n又说了A病房的情况。病人进入ICU时已经插管了，一根管子从嘴里插到肺部，直接提供氧气。今天上午大夫建议A病房上人工肺，由于后续开销大，家属没有马上同意，而是四处打听，得到的信息不乐观：\n\n1）\t效果不好说。当然有治好的，更多是没有治好的。\n\n2）\tICU有位30多岁的大夫，抢救病人时被传染上肺炎。最终上了人工肺也没能救回来。\n\n最终，A病房决定只插管，不上人工肺。\n\n\n夫人说：“如果爸爸真到那一步。即使知道大概率没用，只要有1%的希望，我也得上啊。不花这钱，我余下一辈子都不会心安的。”",
				"added": 1518440817
			},
			{
				"comment_id": 107,
				"body": "三、住院\n\n\n*    *    *     *    *    *\n\n1月5日（星期五）中午 \n\n\n纯电动车已经快没电了，叫了首汽约车前往丁医院。到院后，前一位病人已经办完出院手续，但没有要走的意思，还在和病友聊天。也没办法，继续等待。岳父趴在朋友办公室休息，勉强喝了点粥。\n\n\n下午1点，在朋友帮助下如期躺在了病床上，觉得放心了。呼吸内科心电监护仪全部占满了，朋友帮忙从别的科室借了一台仪器用于监测岳父。我心里还想：“有问题喊一声护士不就行了？”\n\n\n手续办完，护士开始抽血，刚准备抽动脉时，岳父情形激动：“早上刚抽完，化验结果你们都有，怎么又抽动脉血？”把小护士吓傻了，赶忙道歉，说：“我去问问大夫，看是否可以不抽动脉血。”\n\n\n看来，抽动脉血应该是极疼的。\n\n\n都住进三甲医院了，我也安心了，开始继续筹划4天后前往拉斯维加斯参观CES消费电子展。\n\n\n*    *    *     *    *    *\n\n1月5日（星期五）下午 14点30分\n\n\n大夫把我叫出病房面谈。\n\n\n大夫：“从你们的片子来看，肺部病毒扩散很快。如果病情急转直下，变成‘大白肺’，需要上有创呼吸机支持。我们院ICU（重症监护室）只有6个床位，我不能保证你们有床位。”\n\n\n我心里琢磨，这是“股市有风险，投资需谨慎”的惯常风险提示吗？\n\n\n再请教大夫：“感冒这么严重啊？”\n\n\n大夫一听这问题，就知道我是个小白。回答说：“你知道SARS吧，所有人都知道是病毒性肺炎，但没有针对性药品，其他抗生素再怎么加大剂量也无效。现在你岳父也被未知病毒感染了，扩散很快。除了甲流乙流等常见病毒，大部分病毒都没有特效药。最终需要病人自己的免疫系统发挥功能，击败病毒。现在病毒凶猛，如果在病毒自限之前，肺部不能支持呼吸，就需要上呼吸机。”\n\n\n问大夫：“您有啥建议吗？”\n\n\n大夫说：“你们问问，看能否转到朝阳医院或者协和医院吧。”\n\n\n我一听晕倒，早上从朝阳医院出来就是因为挤不上床位。昨晚协和医院也请朋友问过，全国多少政商高层关系在盯着，根本没法安排。\n\n\n厚着脸皮再问：“这两个医院的床位都找过人，没办法。您的意思是预先联系这两个医院的ICU吗？”\n\n\n这又是一个外行的问题，大夫只好说：“大医院的ICU床位比普通床位紧张得多。我只是说了一种可能的情形，我们大夫和家属一样，希望病人迅速好转。但你们和我们都要做好准备。”\n\n\n谈话结束后，和夫人电话沟通。我们偏向于大夫是按惯例进行风险提示，也没太在意，但夫人让我取消美国行程。开始退机票、退酒店、退电话卡、退保险，答应帮朋友办的一些事情也办不到了，一一联系解释。\n\n\n*    *    *     *    *    *\n\n1月5日（星期五）下午 17点\n\n\n大夫给了我一张处方，让我去别的医院买“达菲”。\n\n\n我奇怪了：“三甲医院没有达菲？”\n\n\n大夫说：“我这里没有。周围几个三甲你可以试试，朝阳医院肯定有。你运气还算不错的，北京紧急调了一批货源。前段时间，要是不够级别，全北京你都找不到一盒。”\n\n\n于是先到周边的A医院，急诊药房帅哥一听达菲，说可能开完了。帮我查了急诊药房没有，还电话问了门诊药房，也没有了。最后还给我个电话，说下次可以先打电话问。态度真是好！\n\n\n出来看到一个药房。小哥回答我说：“没这药。我们一直没卖过，不知销量如何。”转头和另一个人说：“最近问这个药的人不少啊，我们进点试试？”\n\n\n下一站直奔朝阳医院。开药先要挂号，但我没发烧，护士不让我挂号。只能又冲进去找大夫，说早上才从朝阳医院转出的，求开一盒。\n\n\n大夫问：“为啥转出？”\n\n我答：“朋友联系了个床位。”\n\n大夫说：“哟，这么快有个床位。去挂号吧”。\n\n\n于是挂号，排队，开药，缴费，取药。220一盒达菲，70元挂号费。想多开些，朝阳医院不同意，自己的病人都不够用。\n\n\n晚9点离开丁医院回家，到通州已近11点。从前一日6点出门，已忙乱了28小时。\n\n\n家里岳母眼睛通红，夫人自己担心不提，又安慰了会岳母。\n\n\n我只问了一个问题：“小孩有没有发烧？”\n\n\n*    *    *     *    *    *\n\n1月6日（星期六）\n\n\n夫人一早赶往医院,让我在家睡觉。10点给我电话，说大量输液情况下高烧不退，最高39度。另一位大夫再次讲述了要做好转院进ICU准备，并要求24小时陪护。\n\n\n于是：\n\n1）从老家请两位亲戚过来照顾。\n\n我们下周还要上班，24小时监护肯定扛不住。\n\n\n定机票时，发现佳木斯飞北京的航班，当天头等舱都没剩，后一天余下2个头等舱，还好鸡西飞北京有经济舱全价。东北富豪的消费能力和惨不忍睹的群众生活形成鲜明对比。\n\n\n2）联系人转朝阳医院、协和医院。\n\n朋友们都很帮忙，但确实没法操作。\n\n\n下午6点，赶到丁医院换班。发现昨晚我整理的东西被动过，充电宝等都从柜子里挪到包里。夫人没有动过，只能是岳父在呼吸困难、动脉被扎了2针的情况下亲自动手了。其难度，相当于在拉萨有高原反应的情况下，用带伤的手抬石头。我把包挪到了岳父够不着的地方，让他有事叫我。\n\n\n大夫安排一小时测一次体温，记录所有“出量”，即大小便量。当晚，岳父的尿量少。一次少只有20ml，多不过50ml，医生担心肾部也感染了。\n\n\n医生又和我谈了一遍。常识认为病毒性肺炎致死率不高，但实际上病毒性肺炎会引起很多并发症，最终死因归于其他病症，病人和家属都不能对病毒性肺炎掉以轻心。\n\n\n21点体温38.5度，医生说病房没有盐水不能输液了，先用些退烧药。服药后，体温降低到37.4度。岳父服药后出汗，不愿意盖被子，被查房医生制止后依然不服气。医生走后，岳父要求脱掉上衣裸睡，被我拒绝。\n\n\n*    *    *     *    *    *\n\n1月7日（星期日）\n\n\n5点，岳父下床洗脸，我们拔了监控仪器，很快大夫就冲了进来，说是系统报警没心跳了。\n\n\n7点，各种外卖都没上班。在医院旁边买了粥和包子，岳父胃口明显好转，体温稳定在37度左右。我们松了一口气。\n\n\n9点，夫人过来换班。岳父和孩子微信视频了会，告诫孩子要听话，多穿衣服不要感冒。孩子问：“姥爷打完吊针就能回家吗？”老家的亲戚也已从东北起飞。我到旁边酒店开了个房，睡了2个小时。\n\n\n11点，回到病房。夫人说：“隔壁病房的刚才心脏骤停，送ICU了。”\n\n\n心头一惊，问出事前病人是否高声喊疼？\n\n\n“没有，又不是拍电影。病人的几个家属一起出去吃饭了。隔壁床忽然发现监控仪上心跳没了，以为是仪器坏了，想和病人说，却发现病人双目紧闭。隔壁床大喊，大夫也从监控中发现了，瞬时一群人冲进病房。昨晚负责岳父病房的大夫，本来9点就可以走，刚准备下班，又进ICU看病人了。”\n\n\n当时就感叹：\n\n1）有朋友还是好，能从别的科室借个心电监控仪。没有监控仪，即使有空床医生都不敢收岳父这样的重病人。\n\n2）不能让孩子学医。\n\n\n二姑二姑父来到达医院，我们万般感谢，交代了相关事宜。特别强调他们自己要24小时带口罩，遮住口鼻，注意轮换休息，吃我们准备的水果和预防性药品，做好持久战的准备。\n\n\n亲戚回答：“不当害”。\n\n\n作为黑龙江女婿，我现在真是怕了东北人说“不当害”。这句话可以翻译为：“没事，看大爷我的。”\n\n于是发挥脸皮厚的特长，又说了两遍。\n\n\n岳父和二姑父很熟，被照顾时很自然。我在照顾时，小便他都挣扎着要站起来。二姑父照顾时，他愿意躺在床上小便。\n\n\n把亲戚拉进了微信“情况检测群”，请他记录尿量、体温等信息，发到群里，例如“22:30，尿20”。我们容易看，医生问情况也能够完备的提供。\n\n\n回到家，根据医生的要求，人洗澡、所有衣服全洗、包等物品全部用消毒液擦一遍。毕竟是呼吸科重症患者，传染上孩子可麻烦了。\n\n\n晚上头晕无力，吃下一片白加黑，心想现在可不能倒下。\n\n\n*    *    *     *    *    *\n\n1月8日（星期一）上午 丁医院\n\n\n睡了一觉，爬起来联系了几个客户。亲戚反馈的消息还不错，一整天没发烧，早上胃口也很好。\n\n\n11点夫人来电话，告知早上彩超的结果很不好。一线抗生素都用了，但病毒没有控制住，继续扩散，整个肺都已经被病毒占据。普通的鼻导管供3升氧量已经不能支撑，开始用面罩吸氧，开到10升的氧量，勉强将血氧量维持在90。丁医院大夫集体讨论后，考虑到昨天隔壁病房心脏骤停的案例，正式建议我们转院，而且要求直接进ICU。\n\n\n丁医院呼吸科主任很尽责，亲自帮忙问了朝阳医院等多个机构，但ICU全满。最后联系上全国知名的戊医院，正好下午能空出2个ICU床位。主任在联系时特别强调了“家属配合”，看来我们在医院的表现还可以。\n\n\n千言万语道不尽谢！\n\n\nICU确定后联系120，说明要带氧气。120来了4位员工，负责人和开车的小哥都是北京人，特别幽默，一路上气氛不那么压抑。6公里，车费、维护费、器材费等共计800元。\n\n\n岳父的情绪开始不稳定。早上他可能自认为没几天就出院了，现在听到要转院，大夫都把家属叫出病房去说情况，预感不好。他拒绝带氧气面罩，要重新换成鼻导管吸氧，好说歹说又给带回去了。",
				"added": 1518440856
			},
			{
				"comment_id": 108,
				"body": "二、急诊\n\n\n*    *    *     *    *    *\n\n1月4日（星期四）19点，乙医院\n\n\n赶到离家最近的乙医院做CT。医院大夫听诊后觉得情况严重，化验的结果让她更为不安：\n\n1）\tCT：肺部大面积感染。对比36小时前的X光片，病毒扩散迅猛。\n\n2）\t咽拭子：甲流、乙流都是阴性。表明没有感染甲流或者乙流。\n\n\n没有阳性，不一定是好事，病人可能感染了未知的强病毒。\n\n\n学医的人一眼就知道这意味着什么，而我要到半个月后，才知道“未知病毒”的残酷。\n\n\n当即要求住院，大夫表示没有床位，而且病情严重，建议去大医院治疗。当时对乙医院还有些意见，现在想起来，识别出严重情况，不耽搁是对的。\n\n\n（事后我们仔细看病历，发现乙医院写的是：“病人自愿要求转院。” 这与事实不符。）\n\n\n于是疯狂的四处打电话，问任何可能和医院有关系的朋友。一通电话打下来，才发现医院不是饭店，出钱也没有床位。流感袭击下，北京呼吸科床位极度紧张，几天能排到就算不错了。一位朋友建议去呼吸科实力很强的朝阳医院看急诊，先把病情稳定住。\n\n\n*    *    *     *    *    *\n\n1月4日（星期四）21点，朝阳医院\n\n\n21点来赶到北京朝阳医院。此前，我一直觉得朝阳医院就是区级医院，没想到这么NB。发热不能直接挂号，要先去护士站。护士一听情况严重，让先去问大夫能不能收治。\n\n\n先到了最靠近心电图间的1号诊室。我们取出CT片，说情况严重，希望他能帮忙安排个床位。\n\n\n这位大夫属于推诿圣手，做医生实在是埋没人才，当年没有考上公务员可惜了。连连摆手说：“我不看片子。不看、不看、我不看！你们今天都输过液了，我也不能给你再输液。明天早上来化验，是否有必要住院等化验结果。”\n\n\n被推诿后很不爽，病人疼的不行，你号都不让挂。我连法院都投诉过，但在医院还是得求着，不能轻举妄动。但也不能听这个混蛋的话回家，坐在急诊区继续给各位朋友打电话找床位。\n\n\n猛然看到2诊室是空的，后一个病人叫号后没有及时进诊室。冲进去又把情况说一遍，2诊室的腾大夫人很好，看了看片子，知道病人情况严重，说：“你们先挂号做心电图吧。”\n\n\n有了腾大夫这句话，松了口气。\n\n\n挂号 — 去护士站量血压 — 量心电图 — 2诊室大夫详细看片问病情 — 开化验单 — 交费 — 抽血。晚上急诊挂号、交费处人之多就不提了。第一次看到抽动脉血，一个细如发丝的针，摸着抽。抽完后24小时不能见水，不能提重物。\n\n\n由于化验结果要2小时候才能取，决定在附近开房睡觉。医院对门就有个宜必思，20平米的房间400多。500米有个酒店，60平米也是400多。我们有车，自然就去了远的那个。后来才理解，近500米的小房间能卖这个价是有原因的。对很多病人来说，多走1米都是负担。\n\n\n*    *    *     *    *    *\n\n1月5日（星期五）凌晨，朝阳医院\n\n\n0点，我和岳父回到朝阳医院。一项检测结果在ICU取，第一次看到ICU，看到门口目光黯淡的家属，没想到隔两天我就成了他们的一员。\n\n\n腾大夫看了化验结果使用莫西沙星、多索茶碱、甲泼尼龙、阿昔洛韦等药品输液，并配合吸氧。\n\n\n我当时对吸氧很不理解：“感冒为啥要吸氧？”\n\n后面才理解：\n\n1）感冒只是个撬锁贼，把人体免疫系统的大门打开。\n\n2）肺炎这个强盗紧跟着冲了进来，把肺部撕的面目全非。\n\n3）肺功能被削弱。呼吸正常的空气，已经不能提供足够的氧气。\n\n4）吸入纯氧，功能受损的肺才能给人体提供最低限度的氧气。\n\n\n原预期3小时输完，我也和岳父说了不要着急，但岳父已经很疲倦了，着急回酒店躺下休息。他自行调节，1小时就输完了。凌晨的输液区还有不少老人孩子在输液，仿佛魔鬼就在这里游荡，人的精气神都被吸干了。\n\n\n准备回酒店时，护士说离开医院需要大夫批准。\n\n夜班值班大夫听了诉求，看了看病历，又看了看我。\n\n我再看了看大夫，大夫再看了看我，啥也没说。\n\n我说了声谢谢，回去和护士说大夫已经同意了。\n\n\n*    *    *     *    *    *\n\n1月5日（星期五）上午，朝阳医院\n\n\n在酒店睡了5个小时，早上7点半起床赶往医院，等待8点钟医生查房并可能安排住院。此时犯了个错误，岳父执意要走过去，我们也按惯性顺从。但都要吸氧的人了，肺部随时可能不能提供足够氧气，走路是非常危险的。病人不能认为没事，亲人也不应该掉以轻心。吃不准的情况下，越保守越好。\n\n\n岳父到了输液区开始吸氧。焦急无奈等到9点，医生开始巡查病区。我们询问是否可能安排住院，大夫表示要10:30左右才能知道是否有床位。\n\n\n岳父坐在椅子上已经很难坚持了。此时朋友帮我们在丁医院（朝阳医院是本文的丙医院）联系上一个床位，预计有病人下午1点出院。我们决定转到丁医院，理由是：\n\n1）丁医院有朋友，一些小事容易协调。\n\n2）朝阳医院床位很紧张，输液区外面还有几个白发苍苍的老人躺在移动病床上等床位，当天估计排不到。\n\n\n当时没有考虑到一个很重要的问题：丁医院虽然也是三级甲等，但呼吸科并不突出。\n\n\n我们对岳父的病症估计还是太乐观了：北京的三甲医院，还治不好感冒？\n\n\n告诉朝阳医院的大夫讲了要转到丁医院，大夫很尽责的问为什么，要我们确定好床位，建议我们使用救护车。我们仍然没有意识到严重性，不但没使用救护车，岳父还和我再走了500米，10点回到酒店。\n\n\n在酒店躺在床上休息，原定休息到12点再去丁医院。但岳父在11点就哼哼，我问岳父感觉如何，岳父表示“还可以”。一个硬老汉说“还可以”，和女人说“你看着办”差不多，都不是什么好消息。",
				"added": 1518440878
			},
			{
				"comment_id": 109,
				"body": "一、流感\n\n\n女儿：“姥爷不听话，光膀子，感冒啦！”\n\n\n*    *    *     *    *    *\n\n12月27日（星期三）\n\n\n下午，阳光灿烂，岳母打开主卧窗子通风。岳父忽然来了个念头，一定要同时打开厨房窗子南北对流通风，并且坚持不穿上衣，吹了半小时。期间岳母两次要他穿衣服，一次让他关窗，均被拒绝。\n\n\n当时我也在家，为了避免矛盾，我没有径直去关窗，故意和岳母打了个招呼：“妈，我把窗关了哈！”\n\n\n岳母还没说话，岳父说：“不得（dei，三声）！”\n\n\n岳父开窗和不穿衣服和他的习惯有关。我们南方人冬天在家都穿羽绒服，我结婚前第一次去黑龙江惊掉了下巴：外面零下20度，屋里零上30度；家家都开窗，人人小背心。\n\n\n但北京不是黑龙江，屋里只有21度。今年又没有下雪，流感肆虐。岳父表态后，我习惯性沉默，检查三岁的孩子已经穿上羽绒服后，自己裹上衣服回屋去了。\n\n\n作为一个能伺候夫人穿袜的南方女婿，和餐桌上动辄骂岳母菜咸了淡了的东北岳父，相处只能说是表面上过得去。双方都是为了孩子，互相忍受。\n\n\n偶尔和天南海北的朋友吐槽，一美国朋友下决心：“我宁可穷三年，也不让老人帮我带孩子。”我心有戚戚焉，但夫人坚决反对：“你去哪里找那么放心的人带孩子？”\n\n\n*    *    *     *    *    *\n\n12月28日（星期四）\n\n\n岳父开始感冒流涕。\n\n\n他懒得一遍一遍去洗手间，拿了孩子的尿不湿放在床边，让鼻涕淌在尿不湿上。我开始尽量让岳父和孩子隔离。但岳父是女儿“最好的朋友”+唯一的巧克力提供者，用东北话说叫岳父是女儿的“仗义”。孩子一发现我们要和她“谈话”，大喊姥爷，流出两滴眼泪，就能迅速反败为胜，绽开胜利的笑容。\n\n\n岳父东北man式喷嚏，瀑布式流鼻涕都是逗孩子的新手段，完全不能制止他们亲密无间。\n\n\n岳母：“吃点感冒药吧”。\n\n岳父：“我这身板，没事”。\n\n岳母：“打喷嚏你挡着点，别喷到孩子”\n\n岳父大怒：“这又没啥病毒”。\n\n\n*    *    *     *    *    *\n\n12月29日（星期五）\n\n\n岳父开始发烧，愿意吃感冒药了。\n\n\n孩子继续跟姥爷粘在一起。我感觉不对了，和夫人商量带孩子出去住酒店。夫人不同意，因为孩子上幼儿园后一直生病，外出怕有病菌。\n\n\n又问能不能岳父岳母出去住。夫人还是不同意，说是爸爸发烧了，需要在家照顾。\n\n\n我问：“感冒会不会传染？\n\n夫人答：“我也担心”。\n\n\n“传染”这个词需要定义概念。有人，比如我，认为接近100%会发生。而另一些人，例如我夫人，认为只有20%的概率，而且自己孩子还绝对不在这20%之中。\n\n\n就像我一贯认为发芽的大蒜有毒，每次扔这种大蒜都会引发矛盾，夫人经常嘲笑：“你家宝都已经吃了好久发芽大蒜做的菜了。”\n\n\n我大怒。\n\n然后洗洗就睡了。\n\n\n*    *    *     *    *    *\n\n12月30日（星期六）\n\n\n岳父挺不住了，去了通州民营医院甲。\n\n\n为啥会到这个医院呢，因为小孩进幼儿园前到这个小医院体检过。老人觉得位置近，不排队，反正异地医保也报不了多少。东北老国企，现在的医保大概只结算到2014年的。即使批下来的报销额度，也得等几年才能拿到现金。\n\n\n医院验血后开了3天输液，消炎药用的是头孢。输液后，岳父有改善。\n\n\n我当时还和朋友开玩笑：“美国感冒，看个大夫150美金，看完让你回去喝水。中国感冒，看个大夫5元人民币，输液1000人民币。继房价之后，医疗价格也在赶超美国。”\n\n\n后来才发现，这只是个零头。\n\n\n当晚，岳母和孩子中招了。\n\n\n小孩下午开始发烧，晚上嚎了一夜。姥姥晚上带着孩子也没睡好，第二天自己也发烧了。\n\n\n*    *    *     *    *    *\n\n12月31日（星期日）\n\n\n我终于克服了不愿引发矛盾的懦弱心理，一早就问孩子：“带你去动物园好不好？” 准备把小孩和岳父隔离，同时岳母也可以好好休息。\n\n\n岳母舍不得孩子出去。表示外面冷，传染源多。\n\n\n岳父当时感觉不错，和岳母说说：“我输完液开车带你去天津，2小时就到了”。岳母拒绝了，但同意就近入住酒店。老人喜欢游泳，我们给定了有泳池的宾馆。\n\n\n送岳父去输液时，医生强调病人和家人要戴口罩，避免交叉感染。这次岳父总算是听了。\n\n\n这非常重要！！\n\n\n不要小看几分钱一个的医用口罩，全家人戴好遮住口鼻，坚持戴，对于阻断流感非常有效。没有这口罩，我很可能就写不了这篇文章了。夫人淘宝买了300个，开玩笑说可以用一辈子，结果我们用、亲戚用，白天用、晚上用，屋里用、屋外用，20天用完了。\n\n\n当晚孩子发烧被控制住，但姥姥继续发烧。酒店泳池等设施也没用，就是睡。\n\n\n*    *    *     *    *    *\n\n1月1日（星期一）\n\n\n姥姥早上决定也去甲医院输液，我赶到医院付款。老人要在家附近的连锁酒店入住。我觉得酒店条件不行，但老人们认为离家近。房间在酒店一层，老人觉得温度不够，开启了空调加热。当晚岳父就睡的不好，到凌晨才睡着。\n\n\n孩子不再发烧了。\n\n\n*    *    *     *    *    *\n\n1月2日（星期二）\n\n\n岳父三天的输液已经结束，但精神状态明显没有12月31日好。\n\n\n孩子的状态也很奇怪，早上从9点睡到下午1点半。这是此前从未发生过的。\n\n\n岳母输液后有好转。\n\n\n*    *    *     *    *    *\n\n1月3日（星期三）\n\n\n岳父承认病情恶化，不再硬挺了，决定再去甲医院拍X光片。这个医院上次没看好，为什么又去？因为岳父怕进城堵车，先去拍片看看，严重再去大医院。\n\n\n这个做法是不对的！！大医院不仅是设备先进，更重要的是医生经验丰富。\n\n（虽然对于岳父这个案例，那时候去大医院也没用。）\n\n\n拍片显示肺部有小部分感染，验血白血球低，心电图基本正常。医院换用阿奇霉素输液。\n\n\n晚上岳父精神略有好转，但继续发烧。不愿意盖被子，裹着大衣躺在床上睡。\n\n\n孩子那天不知咋搞的，非要打一下姥爷再揉揉，被我好好说了一顿。看着嗷嗷大哭的孩子、忧心忡忡的姥姥、吃不下饭的姥爷，我也感到无奈。\n\n\n人到中年，早已没有梦想，只盼着日子简简单单。\n\n\n*    *    *     *    *    *\n\n1月4日（星期四）\n\n\n岳父早上自行驾车去医院输液。\n\n\n晚上我见客户回来，岳母对我说：“你带他去医院做个CT吧，严重就住院。老这样我不放心他，也担心他传染给孩子。”\n\n\n我们匆匆穿衣下楼。\n\n\n女儿还在喊：“姥爷，回来别忘了给我买玉米糖！”\n\n\n回家的路，很短，又很长。",
				"added": 1518440902
			},
			{
				"comment_id": 112,
				"body": "> [coolplay](#comment_68_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L): 这跟伊斯兰有啥关系\n\n没关系。这是卖保险的文章。",
				"added": 1518450654
			}
		],
		"5_18cRWp8EGniDTB1itbx5WXenypdjStLmoh": [
			{
				"comment_id": 110,
				"body": "如果要封，肯定是按照协议来封锁。Tor的协议指纹被发现后已经全部阵亡（目前主要靠meek碰瓷）；ss的混淆做得还可以。你装I2P，墙通过协议指纹，立即发现该VPS提供I2P服务，封锁其IP",
				"added": 1518447995
			},
			{
				"comment_id": 111,
				"body": "建议换个思路，国内买有公网IP的VPS。国外买一大堆没有独立IP，通过NAT上网的廉价主机，通过HTran设置为slave模式，反向连接国内VPS。这样你的通道是SOCKS的，协议指纹完全等同于网页浏览，不可能根据协议封。因为价钱便宜，封IP的话损失很小。",
				"added": 1518448165
			}
		],
		"9_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 113,
				"body": "> [lmath](#comment_770_1958F7oCppj78MP966AfojMQwHg2WUupzq): 尊敬的用户您好！您请求的限额已提升。祝你生活愉快！再见！\n\n谢谢，互联网生活总是很愉快",
				"added": 1518527787
			},
			{
				"comment_id": 121,
				"body": "已用: 193.5k/200k\n好像并没有提升啊",
				"added": 1519312859
			},
			{
				"comment_id": 124,
				"body": "好了。",
				"added": 1519479313
			}
		],
		"6_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 115,
				"body": "你打中文了吧",
				"added": 1519224308
			}
		],
		"50_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 116,
				"body": "国家并不在乎偷看你的隐私。但国家需要让你时刻感受到有一个长长的望远镜伸到你的家里，内衣里，电脑里看着你，培养你自我审查、自我阉割的病态习惯，从而把你对自由的需求压制在和牲口同一水平，使你成为人体电池",
				"added": 1519307457
			}
		],
		"7_1GVM7nNzmYJ3ppPCmDTPLozrJF2Z9mgFpF": [
			{
				"comment_id": 117,
				"body": "鲁炜的问题首先在于执行党的政策不力，删贴封杀不彻底，消极怠工，才有了后面的对中央阳奉阴违，抵抗纪律检查。鲁炜被查抄后，删贴就升级为全网封杀，几个主播因为陈年旧事被全网禁播。",
				"added": 1519307597
			}
		],
		"1_1B8mFJ7QazWvzGE7jkQHv22tEiqDspjyFU": [
			{
				"comment_id": 118,
				"body": "电驴依旧坚挺",
				"added": 1519307671
			}
		],
		"3_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 119,
				"body": "> [nekocross](#comment_357_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz): 电驴自带搜索，要什么网站\n\n只能用文件名搜索，没有好的网页简介，评分系统也没什么用",
				"added": 1519307769
			}
		],
		"1_1M8xQnVhdU3Fq28om5WAXevLQ6Uk5Zt8av": [
			{
				"comment_id": 120,
				"body": "BT协议一直是支持IPv6的，HTTP支持IPv6\nTor也支持",
				"added": 1519312822
			}
		],
		"91_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 122,
				"body": "白左就是这么个奇怪的物种，自己的孩子送进公立学校被人扫射，居然还呼吁学校不要配备武装保安。自己的国家被税收、货币宽松和法律管制扒掉三层皮，中产返贫不抗议，却抗议总统开会时发牢骚对非洲国家不敬。现在川普退回孤立政策，不当国际警察了，要求盟友自己花钱保护自己，这帮白左反过来骂美国流氓，这不是帮着欧猪打劫美国纳税人么？",
				"added": 1519316538
			}
		],
		"80_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 123,
				"body": "五毛是帝国沙文主义吧。民族主义是满洲民族主义，吴越民族主义，湖湘民族主义，巴蜀民族主义这些。五毛不玩民族主义的。",
				"added": 1519479261
			}
		],
		"53_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 125,
				"body": "有没有进步你心里没点逼数？",
				"added": 1519540788
			}
		],
		"33_1N2eNZ5w1dpoBcwatsSuTaeNzHgSLjyrpU": [
			{
				"comment_id": 126,
				"body": "> [bigdeath](#comment_3_12REuwXfjCuNkH3B1pJ6ryo1LyjawrcGuJ): 反对取消连任限制\n\n你反对个毛线！不让他瞎搞八搞，加速政权垮台，居然还给党国开药方，你是不是吃饱了撑的？",
				"added": 1519644180
			},
			{
				"comment_id": 128,
				"body": "> [alobe](#comment_12_1N6vo5xj9SjKSKjrjhuPTtS6RYWRMZb9wG): 都被忽悠了。国家主席就是一虚职，谁都知道党领导一切。国家主席连任N期也得听党的。实际这回大部分修改是为新建国家监察机构开路。所以，当大家都盯着国家主席连任，监察那块儿就悄悄地过了。监察才是重头，因为是国家监察，监管一切，都可以“留置“（相当于以前双规）。这才是最狠的。\n\n江系——技术精英阵营\n习系——红二代权贵阵营\n王系——东厂特务和屌丝公务员阵营",
				"added": 1519653141
			}
		],
		"34_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 127,
				"body": "如果不翻墙，墙内的网关设备可以抓包可以定位真实IP和MAC。如果用SSR翻墙，服务器无论如何不知道你的MAC，如果运营商省IP给你NAT了，服务器可能拿不到你的IP。即使是国家给你的翻墙工具，也比直接用国家给你的网络来得隐秘。",
				"added": 1519645659
			},
			{
				"comment_id": 131,
				"body": "> [riven](#comment_10_1HXrSYhrjDgKyvHmg3bNEr4uVFYpiXvXma): 这一手NAT是真的骚。支付那一道砍不就直接能定位了吗\n\n知道你在翻墙，有一百种方法。要把你和墙外内容对应起来，即使拿到你的SSR服务器也并不变得更容易。",
				"added": 1519739955
			}
		],
		"10_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 129,
				"body": "2014-03-16 22:02:37 Apollonius\n\n看到未来多么黑暗血腥的场景。\n\n在可以预计的未来，世界需要黑水公司、德纳尔雇佣兵、黑龙会一类组织。#圣殿骑士团##战争的非国家化#深改组就是军机处，目标只能是未来五到十年。匪谍渗透者与爱国卢布党养兵千日用兵一时，正为红衫军劫持政权准备，指望西方反应迟钝，造成既成事实。2016、2020是最后、最好机会，此后机会之窗关闭。犹如1945–1955窗口关闭，数十年不会再有。决断时刻就是长枪党用武之地，缓则不及。\n\n西方只会反应迟钝，但国际体系反弹威力超过任何领袖。数十年隔离排斥足以造成食人乐园，非自相残杀不可。侥幸投机，就会发现自己身在夹边沟。没有李鸿章，就得创造黎元洪。否则留在国内，等于坐以待毙。\n\n撕逼格勒学告诉窝们：蒋该死在三十年代严重破坏派系共治原则，只能以抗战为理由。抗战如果不能及时爆发，派系轮流执政一旦恢复，他老必定因为践踏江湖道义而后悔莫及。因此，窝们可以合理推断：他老兼并派系之日，已经决定通过战争保证自己永不退休。\n\n撕逼格勒学还告诉窝们：李登辉在九十年代同样严重破坏派系共治原则，只能以民主为理由。民主如果不能及时兑现，派系轮流执政一旦恢复，他老必定因为践踏江湖道义而后悔莫及。因此，窝们可以合理推断：他老兼并派系之日，已经决定通过民主保证派系共治一去不复返。\n\n撕逼格勒学最后告诉窝们：斯大林在三十年代同样严重破坏派系共治原则，只能以总体战为理由。总体战如果不能及时爆发，派系轮流执政一旦恢复，他老必定因为践踏江湖道义而后悔莫及。因此，窝们可以合理推断：他老兼并派系之日，已经决定通过总体战保证自己永不退休。\n\n正如《阿尔巴特街的儿女》最后的台词：无论即将发生什么，萨沙。我只能肯定一点，黑暗时代就要来临。\n\n#僭主的合法性建构#\n撕逼格勒学告诉窝们：田陈氏废姜代齐，只能发明三皇五帝神话，然后标榜殷商正统。如果田齐不能对殷宋灭国继祀，合法性建构一旦失败，田齐必然面临执政危机。因此，窝们可以合理推断：齐湣王接受“东帝”称号时，统宋之战已经不可避免。\n\n撕逼格勒学还告诉窝们：路易·拿破仑·波拿巴解散国民议会，只能乞灵波拿巴主义，然后以拿破仑继承人自居。如果法兰西第二帝国连阿尔萨斯和洛林都保不住，合法性建构一旦失败，波拿巴家族必然面临执政危机。因此，窝们可以合理推断：拿破仑三世称帝时，普法战争已经不可避免。\n\n撕逼格勒学最后告诉窝们：萨达姆·侯赛因把他表哥贝克尔请下台，只能诉诸大阿拉伯理想，然后把自己塑造成阿拉伯世界的领袖。如果不能把科威特变成伊拉克的一个省，合法性建构一旦失败，他老必然面临执政危机。因此，窝们可以合理推断：他老提出新巴比伦帝国梦以后，海湾战争已经不可避免。",
				"added": 1519653263
			}
		],
		"2_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 130,
				"body": "> [planeti](#comment_7_1BGxRk83uVZncjwwR8STahU35fwn1b48nG): 有没有网盘可以上传,chm，pdf，txt，的电子书？收了很多扫描版。百度网盘一不能用，发现没有可用的了。\n\n自己搭索引网站，大文件电驴",
				"added": 1519656383
			}
		],
		"8_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 132,
				"body": "大概是因为什么信息暴露被人肉的呢",
				"added": 1519823449
			}
		],
		"3_18tQgVR1eb2Y1LSXmzZSMp7K8z8dTGpcAo": [
			{
				"comment_id": 133,
				"body": "> [testuser3](#comment_50_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg): 狗比人金贵的时代，人都成了贱民，不仅被城管、交警、领导欺负还要被畜生欺负\n\n畜生只是行本能。欺负人的只能是人。之所以看到狗主人欺负人比看到城管打人，警察杀人，军队屠城还要愤慨，因为心理上不恰当地把 军队 警察 城管 狗 自己排了三六九等，而这种比较实际是无意义的。被狗咬掉耳朵和被楼上掉下玻璃划毁容没有本质区别，只是人不至于蠢到和碎玻璃争高下，但被狗咬玻璃心却碎了。",
				"added": 1519904341
			}
		],
		"1_1CV1zQjkdRKBd9NNXBpVELvzXDp7puzUmX": [
			{
				"comment_id": 134,
				"body": "无政资主要是奥派和小商人",
				"added": 1519994471
			}
		],
		"109_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 135,
				"body": "长江问题解决了，香港台湾就成为问题。香港问题台湾问题解决了，澳大利亚新加坡就会变成问题。",
				"added": 1520044364
			}
		],
		"7_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 136,
				"body": "这是91视频，普通白领，不是拍片定制的服装\ned2k://|file|%E5%B9%BF%E4%B8%9C%E5%86%85%E8%A3%A4%E5%93%A5%E6%88%98%E6%9E%81%E5%93%81%E9%AB%98%E8%B7%9F%E4%B8%9D%E8%A2%9C%E7%99%BD%E9%A2%86%E7%B2%BE%E6%B6%B2%E5%B0%84%E8%84%9A%E4%B8%8A720P%E5%AE%8C%E6%95%B4%E7%89%88.mp4|411102416|9DA2E5620633289BA2A9726634A9FE43|h=7QPFSBDZPYFRTEUNME3LJ7DJHYYXKLRM|/",
				"added": 1520075710
			},
			{
				"comment_id": 137,
				"body": "HEYZO-0450 还有这个\ned2k://|file|HEYZO-0450-HD.mp4|2162681203|FAE74B4B3EC0253336267817630C4EE2|h=4VZ2C3TCM6FYWYS675L3HHDWRQPKEQDU|/",
				"added": 1520076116
			}
		],
		"2_19AzJi9mcRYJohmYmYooHEBModMimM8R6D": [
			{
				"comment_id": 138,
				"body": "> [aboutblank](#comment_3_19AzJi9mcRYJohmYmYooHEBModMimM8R6D): 我的VPS被GFW禁了几个，所以想找找看有没有能不被GFW检测的代理软件，要不然来回换VPS有点麻烦。另外请教下在大陆使用VPN会有被喝茶的风险吗？另外二楼说的brook和goflyway抗审查能力又如何呢？\n\nVPS被禁不一定是因为SSR协议被识别，完全可能是其他用户被发现导致IP段受牵连，或者客户端和服务器端单线联系的流量特征被发现（全国只有你访问这台VPS，以及你的出国流量都指向这台VPS），以及主机服务商的系统被黑客攻击，客户资料泄漏",
				"added": 1520154405
			},
			{
				"comment_id": 142,
				"body": "> [polar2](#comment_4_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum): 混淆得不像反而更容易檢測到當然是原版 shadowsocks 啊\n\n干脆不混淆，用Socks算了",
				"added": 1520266174
			},
			{
				"comment_id": 148,
				"body": "> [b503](#comment_1_13Z3xHmvbmvJbRYKaTpZ36e3q5WMdDbwv6): 请问一下蓝灯怎么样？值得用不?\n\n不花钱，不涉及私人信息，可以用",
				"added": 1520435965
			},
			{
				"comment_id": 149,
				"body": "> [mrc](#comment_48_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 现在Tor专门开发了能在国内用的新网桥，大家试试看。\n\n请问你是指meek还是其他格式的网桥",
				"added": 1520435982
			}
		],
		"13_1KAKF4nVCWqJbrVPWxFvRNuU1zLkwVtC8L": [
			{
				"comment_id": 139,
				"body": "> [birdvd](#comment_68_1Ko7622HKggRGbJny5hCS4n9wwMAVVLTSf): 表示有VPS，但小白做不到自动转贴:(\n\n修改data.json并调用命令行进行发布",
				"added": 1520154454
			}
		],
		"5_1CoMVWZDiGBYRBfViuCs3d5ECGhP9zaSuw": [
			{
				"comment_id": 140,
				"body": "回复可见这种恶俗的东西还是不要搞了，太支那",
				"added": 1520262566
			}
		],
		"12_1BGxRk83uVZncjwwR8STahU35fwn1b48nG": [
			{
				"comment_id": 141,
				"body": "支那驻马店碰瓷学，我已窥得一招半式，无非是 反日，反穆，颠覆歧视链\n白人大爷家被强拆女儿被强奸，可以开枪为自己讨说法\n穆斯林大爷家被强拆女儿被强奸要砸烂政府讨说法\n支那豚家被强拆女儿被强奸，只能上网讨说法\n歧视链这个东西就是旁观者清，颠覆不得",
				"added": 1520266121
			}
		],
		"123_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 143,
				"body": "http://zeronet.readthedocs.io/en/latest/faq/#how-to-use-zeronet-in-tor-browser",
				"added": 1520339921
			}
		],
		"124_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 144,
				"body": "所以广大有志青年吸取教训，真到了那种时刻，要烧就烧个大的。别以为你只是递个打火机，七个大大就饶你一条狗命。",
				"added": 1520344314
			}
		],
		"5_14ytAKDfNjArMTqGecTi7ginG3aZTsRAum": [
			{
				"comment_id": 145,
				"body": "> [mybowknot1](#comment_5_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm): 美国自己的体育都一个德行，还说别人，都是“合法吃药”的运动员。罗斯福强行低价收购黄金，还连任多次，要脸不？和纳粹有什么区别？\n\n五毛思维混淆视听。列宁主义、纳粹主义和美国不是并列关系，而且本文根本没有在讨论美国体育",
				"added": 1520433015
			}
		],
		"128_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 146,
				"body": "http://127.0.0.1:43110/tgzy.bit/",
				"added": 1520434641
			},
			{
				"comment_id": 147,
				"body": "抗暴报道最好了",
				"added": 1520434662
			}
		],
		"70_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 150,
				"body": "苹果在美国也低下了高贵的头颅，乖乖把钱寄回去了。苹果只是一个商业公司。",
				"added": 1520521856
			}
		],
		"1_1LZWuZzv7fA25pHiWBhJeXjAwXeYasTDrH": [
			{
				"comment_id": 151,
				"body": "买国外手机卡",
				"added": 1520522429
			}
		],
		"115_1DcMmKhgdfkR1GDA6zhWhoFRreaej4wLmW": [
			{
				"comment_id": 152,
				"body": "一方面提倡狼性文化，疯狂加班；另一方面也敢喊出三年买车五年买房。至少给了出身贫苦的青年一个出路，这已经比一直画饼不给高薪还让人加班的大多数企业要靠谱了",
				"added": 1520785373
			},
			{
				"comment_id": 202,
				"body": "> [atheist](#comment_185_12Ugp53jiMdvj1Kxa1w7c2LcXUBdGPs1oK): 华为未来不会发展的很好的。\n\n企业只是个戏台子，企业不好了，一批人在企业辉煌的时候买入了房产，或者实现了移民梦想，把企业的价值榨干，这就行了。相比之下，很多新公司小企业，不问能为股东为员工创造什么样的价值，先把年轻人的青春榨干，这种公司多得去了。",
				"added": 1524837019
			}
		],
		"14_145kg9WZryLeefr2FuGERptM7frEf7ySGH": [
			{
				"comment_id": 153,
				"body": "这些软件没网都不能用的吧",
				"added": 1520867283
			}
		],
		"40_13aB79mzuRLgDYzQthn9wzycjw77WyDXh6": [
			{
				"comment_id": 154,
				"body": "历史中的反面人物没有那么坏，可能还很有抱负\n历史中的伟人可能无恶不作",
				"added": 1520867463
			}
		],
		"10_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 155,
				"body": "> [fatherofgfw](#comment_32_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2): 能不能请大家把这段话转发出去。 [...]\n\n欧美看到中国问题，喜欢和稀泥，不想得罪中国。",
				"added": 1521034263
			}
		],
		"76_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 156,
				"body": "发现这个ID老是问一些似是而非的问题。政府是各种公共服务提供者中比较昂贵和低效的一种，有政府就有贪官。",
				"added": 1521284549
			},
			{
				"comment_id": 157,
				"body": "对贪官问题解决最好的是公共服务由商业企业承包。企业要盈利，要面对其他企业的竞争，不容许内部出现贪腐员工，会较大程度改善贪污问题。不过话说回来，贪官并不是个很严重的社会问题，所有反对贪官的人首先应该反对纳税。",
				"added": 1521284799
			}
		],
		"163_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 158,
				"body": "程序员属于游士阶层，是天生的投机分子，最容易变节。",
				"added": 1521284862
			}
		],
		"1_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7": [
			{
				"comment_id": 159,
				"body": "袁是选举产生的民国大总统，比习特勒不知道高到哪里去了。",
				"added": 1521285077
			}
		],
		"2_1ApUMrYxqSVGS48UEPxsBKQcWfpozBfq98": [
			{
				"comment_id": 160,
				"body": "这是公网，不是ZeroNet吧",
				"added": 1521285845
			},
			{
				"comment_id": 161,
				"body": "不要把自己的ZeroNet地址映射到公网，万一人家拿你的私钥注册帐号去发spam呢",
				"added": 1521285926
			}
		],
		"166_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 162,
				"body": "我：我快40了还没当上大总统，请高人帮忙看一下\n高人：请提供信息\n我：什么信息，就是我去总统府就职，被保安赶出来了啊 现在我该怎么做呢\n\n一个接受过语言和逻辑教育的人，应该知道如何描述问题",
				"added": 1521350307
			},
			{
				"comment_id": 164,
				"body": "1 浏览器通过127.0.0.1:8080 能不能访问到你的 Nginx\n2 你的Tor工作在网桥模式吗？\n3 删掉 /var/lib/tor/hidden_service/hostname 重启服务看看是不是还会生成同样的公开地址\n和防火墙应该没有关系，防火墙默认设置不会阻止127.0.0.1",
				"added": 1521376888
			},
			{
				"comment_id": 165,
				"body": "> [lmath](#comment_809_1958F7oCppj78MP966AfojMQwHg2WUupzq): Nginx 没配置好，鉴定完毕！\n\n人中诸葛！",
				"added": 1521463432
			},
			{
				"comment_id": 169,
				"body": "nginx的httpd进程启动了没\n1 进程可以启动，那么开启日志查找问题\n2 进程没启动，那么看看是不是文件路径错，端口被占用之类",
				"added": 1521556181
			}
		],
		"300_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 163,
				"body": "东南亚也行的",
				"added": 1521365908
			}
		],
		"1_1C5hnD2oKKakz8954jaTdNBFN735dRuKYG": [
			{
				"comment_id": 166,
				"body": "utorrent吧",
				"added": 1521465625
			}
		],
		"2_1G1AE6cp7YJSBfue7Y5yoLQ3eMNaCNwQ6z": [
			{
				"comment_id": 167,
				"body": "这个网站开车为什么还要夹杂段子？",
				"added": 1521470248
			}
		],
		"1_17nvGBiEjkw5BibxSWZvcQvqDWvE4t7UFy": [
			{
				"comment_id": 168,
				"body": "没觉得查不到，但也不觉得言论有什么错。自我审查本身就是一种不健康的心理。",
				"added": 1521556078
			}
		],
		"1_1DonHALGF9orFFoZ4cZiBHAx4Rgogojryx": [
			{
				"comment_id": 170,
				"body": "> [mrc](#comment_97_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 可以自制卫星接收器，国外有人搞成功了，专卖接收器。\n\n卫星目前主要用途是广播，所有人接收一样的内容。通讯的成本很高",
				"added": 1521728341
			}
		],
		"144_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 171,
				"body": "> [zeronetimwulv](#comment_27_1CZg1ExEqw1DqjFD7ssKKHEXt4oY1ne8qJ): 还特么有傻逼相信饿死3000万...我真是服了..\n\n4000万",
				"added": 1521729491
			}
		],
		"2_1MN9ajexS6VndZdKszKhCrV7uzmWbigfE7": [
			{
				"comment_id": 172,
				"body": "比较加税清单，贸易额毫无意义。美国是一个体系，中国是一方国土。美国的商品可以0关税畅销全球，随便到东亚南亚某个国家转个口就进口到中国，中国根本没法反击。反观中国商品出口到全球都是高关税甚至惩罚性关税，美国已经是税率洼地，这一关门，完了。",
				"added": 1521806383
			}
		],
		"1_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr": [
			{
				"comment_id": 173,
				"body": "我要是中共，看到这种傻子，不虐他千百遍我良心过不去",
				"added": 1521864691
			}
		],
		"3_1Kgw38fVSxUaW1CiMQmf2TyR7C57B8z491": [
			{
				"comment_id": 174,
				"body": "喜欢周冬雨的可以去看金高银，裸戏床戏都拍过",
				"added": 1521991138
			}
		],
		"81_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 175,
				"body": "自由之所以宝贵，在于你不能拿他去交换别的东西完了还指望能要回来",
				"added": 1522237239
			}
		],
		"175_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 176,
				"body": "不要歪曲自由的含义。工作开心还能拿钱的人要么是天才要么底子好，要么向社会伸手要福利。大多数怀有这种想法的人都是伸手要福利，最终落入政府的圈套，失去自由。",
				"added": 1522237399
			},
			{
				"comment_id": 177,
				"body": "> [zaraonet](#comment_8_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): 赞同。古人云，没有规矩，不成方圆。自由永远是相对的。完全的自由会导致混乱，适当的规则能让人类社会有秩序。即使是国外，也没有你想象的自由。如果觉得国外的民主国家就很自由的话，你会发现这其中的弊端也有很多。对于国家而言，只有适合的制度，没有最好的制度。生活的压力永远是阻止你想要自由的一个理由。\n\n不要歪曲自由的含义，自由本身就是秩序，完全的自由就是完美的秩序。",
				"added": 1522237449
			},
			{
				"comment_id": 180,
				"body": "> [zaraonet](#comment_9_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): 试问哪个国家拥有完美的自由？如果有这种类型的国家，请列举出来。\n\n欧洲中世纪，近代英国诸殖民地，爱沙尼亚",
				"added": 1522327794
			},
			{
				"comment_id": 182,
				"body": "> [zaraonet](#comment_13_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): 欧洲中世纪从来没有过你说的自由。君主立宪，和中国差不多。英国殖民地就更加不用谈了。印度至今还留有宗教等级制度，曾经的英国殖民地香港在那个时代也是黑帮横行，社会动荡。当时的秩序也并不由自由产生。爱沙尼亚是一个在历史上被反复占领的国家。且不说弹丸之地，易于管理。就今天而言，你可以说他先进，可以说它幸福指数高，但并不代表着就是个完全自由的国家。你依然是在少数人制定的法立法规制下生活。\n\n欧洲中世纪的君主还没有立宪，他们自掏腰包互相攻伐，即使占领了某个领地，当地仍然讲原来的语言，实行当地习惯法。\n种族隔离制度是保障自由的重要制度之一，充分体现了命运自决，自食其果的保守主义精义。只有马列流氓无产者，现代进步主义白左才会污蔑殖民和种族隔离制度。至于你所说的黑帮横行社会动荡，充分暴露了你的进步主义倾向，你已经抛弃习惯法和自治传统选择了政府治理，所以先验地投射到历史观中。\n正因为爱沙尼亚立法者是少数人，所以爱沙尼亚的成文法管制范围没有波及普通人生活的方方面面，国营经济收缩得很小，普通人遵循的是资本主义商业规则。",
				"added": 1522337349
			}
		],
		"4_1G58PQ7Ena3mARGX2p5mYH7yHcBWRLX2Pa": [
			{
				"comment_id": 178,
				"body": "比如呢",
				"added": 1522237587
			}
		],
		"3_1Ktpupt6fQP4sWYv5ZzYuwTW8drzqUL8Nm": [
			{
				"comment_id": 179,
				"body": "被封了你怎么上来的",
				"added": 1522237599
			}
		],
		"11_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 181,
				"body": "网络安全研究员Paolo Stagno测试了70个VPN提供商，发现其中有16个通过WebRTC泄漏了用户的IP（23％）。  你可以检查你的VPN是否泄漏：http://ip.voidsec.com \n\nFirefox禁用WebRTC即可防止IP泄漏，方法是：在浏览器上输入：about:config。之后搜索：media.peerconnection.enabled。找到它后双击，将其改成 false 即可。\n\nChrome禁用WebRTC可防止IP泄漏，方法是：在Chrome应用商店里，安装一个名为WebRTC Leak Prevent的扩展即可。\n\nhttps://twitter.com/williamlong/status/979259939293036544",
				"added": 1522331071
			}
		],
		"177_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 183,
				"body": "只要言论自由，言论在言论市场上接受挑选，就可以让它自生自灭",
				"added": 1522406914
			}
		],
		"1_17pFoZw78XzXQvrprZ4ANVysSetLNNQAu8": [
			{
				"comment_id": 184,
				"body": "反对",
				"added": 1522500708
			}
		],
		"2_1CuFXko1Q3MMRkboFygeu9DxNVAFG67S3q": [
			{
				"comment_id": 185,
				"body": "纸币已经快被电子货币取代了",
				"added": 1522501796
			}
		],
		"16_133isGmcrRR5LNGVmCPrEWjWC287AWDQb2": [
			{
				"comment_id": 186,
				"body": "转帖用点心",
				"added": 1522501819
			}
		],
		"12_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 187,
				"body": "A few days ago the Great Firewall of 🇨🇳started blocking ZeroNet protocol based on port number and deep packet inspection. \nWe added port randomization and made some changes in the protocol to make it work again. \nPlease update your client to avoid connection filtering.\n\nhttps://twitter.com/HelloZeroNet",
				"added": 1523098228
			}
		],
		"4_1FfjVXDUuvM2Y13buGMHYZVUyWKxrUawqJ": [
			{
				"comment_id": 188,
				"body": "http://127.0.0.1:43110/Mail.ZeroNetwork.bit/",
				"added": 1523193383
			}
		],
		"5_1FfjVXDUuvM2Y13buGMHYZVUyWKxrUawqJ": [
			{
				"comment_id": 189,
				"body": "其实编程语言在各个系统中都是方言化的。脚本语言像python可以移植但限制也大\n作为用户并不觉得哪种语言写的特别好用",
				"added": 1523193471
			}
		],
		"196_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 190,
				"body": "天赋零权",
				"added": 1523316546
			}
		],
		"1_159WoHVCiWnZNsoAoP5y7SxCnXgAd29ANC": [
			{
				"comment_id": 191,
				"body": "江系是技术精英的大本营，江去世，技术官僚肯定要被整，然后倒退到反智和反市场的体制中",
				"added": 1523316644
			}
		],
		"3_12eyn7aqnDpzq5WKEZARAt9imQ1sRagAsm": [
			{
				"comment_id": 192,
				"body": "◆eD2k的正统客户端eMule配置复杂，难以上手。\n说法有误，正统客户端eMule不需要配置。或者你用Xtreme之类的第三方mod好了。\n\n　　◆eMule一旦开启，默认会不断上传共享了的文件，这种大流量的上传任务，并不适合中国上传带宽较窄的互联网。一些运营商为了减少上传的压力，甚至直接封杀了KAD协议，让eMule无用武之地。\n说法有误导性，不断上传也得你分享了热门资源或者你的稀缺资源正好被人需要\n另外运营商封BT是有的，封电驴很难，因为去中心化\n\n　　◆eMule封杀迅雷旋风等吸血客户端。迅雷等客户端有吸血机制，从eMule拿数据，但并不回传数据给eD2k网络，这让很多eMule客户端都使用IPFilter封杀了迅雷。不少人发现迅雷下eD2k下不动，渐渐也就不用eD2k的链接了。\n不守规则的客户端当然要封，维护社区秩序是必需的\n\n\n　　◆HighID越来越难以获取。在eMule中，HighID会获得比较快的速度，但这需要公网IP。现在运营商普遍给用户提供内网IP，这限制了eMule的传输效率。\n没有HighID影响不大，连上邻近网段的用户，或者连上很多用户，能获得比较快的速度\n\n\n　　◆一个eD2k链接只能下载一个文件。与之相比，BT一个任务可以下载多个文件。下载资源合辑的时候，一个磁链总比一行行eD2k链接方便。\n但是BT依赖tracker，tracker很好封锁的。别说什么magnet磁力链接，用磁力下不了种子的话白搭",
				"added": 1523376083
			},
			{
				"comment_id": 193,
				"body": "> [digitalworship](#comment_23_15E9C4NmQ5dcRtVVN86Fb2NMWFSgoPEgco): 我现在就用emule，xtreme的，八成以上的新车都能找到。\n\n我从迅雷拖下来热门韩剧也会在电驴分享，这个有长尾，一开始只要热门资源都有很多人下，时间长了还有人来下的肯定是经典，没人下的说明资源质量不高。",
				"added": 1523376144
			}
		],
		"29_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 194,
				"body": "新闻联播说什么了？",
				"added": 1523547588
			}
		],
		"201_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 195,
				"body": "体制是抽象的，人是具体的。没有邪恶的体制，只有一个个作恶的人。不去惩治作恶的人，谈什么反对体制？男儿当杀人，男人杀人，女人生小孩，是天赋的使命，是人类取悦上帝的方式。",
				"added": 1523620983
			}
		],
		"84_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 196,
				"body": "> [zaraonet](#comment_14_1L2fnDSg4AzEFzBYU4jD4Vn9nSf31ZbrGR): 不知道，感觉很扯淡。政府不去管真正辣眼睛的娱乐节目，反而去取缔小众的娱乐网站。\n\n政府不去抓城市的计划生育，反而来抓我们乡下人的超生",
				"added": 1523798615
			},
			{
				"comment_id": 197,
				"body": "> [nisemonobing](#comment_2_146XegS7gzuw8mJstjy8FgCg5pgbiMWsYk): 社会主义建设不需要娱乐。娱乐是麻痹劳动人民神经的毒品。现在的娱乐文化已经受资本主义社会糟粕的污染太深，人民思想涣散（自由思想太强）。否则社会主义建设将毁于一旦。🐶\n\n笑话是对现实的讽刺和解构，笑话是政治工具",
				"added": 1523798672
			}
		],
		"1_16DebU5J4o2BCYePBJvGkwH2WhoU7wtPVG": [
			{
				"comment_id": 198,
				"body": "你先让它三秒内启动再来说服我放弃PHP",
				"added": 1524062902
			}
		],
		"215_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 199,
				"body": "朕已下载，好看的话重重有赏，不好看的话，。。。。",
				"added": 1524394811
			}
		],
		"212_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 200,
				"body": "你应该担心的是你们德国人手中没有枪，被征税不能反抗。当你没有武装又被迫交税的时候，国家怎么样都和你无关了",
				"added": 1524394886
			}
		],
		"315_157kFKiaEbRUds2HCBUpv33t4Unezi6dR6": [
			{
				"comment_id": 201,
				"body": "http://www.politiscales.net/zh_CN/results/?j0=38&j1=36&t0=29&t1=36&p1=88&p0=7&c1=64&c0=5&femi=10&e0=12&e1=64&m1=90&b1=14&b0=48&s1=19&s0=50\n400分，不错了",
				"added": 1524747157
			}
		],
		"3_1AtcGE9VwLNxkhKqQjgiM3LbcJhA6SCjLm": [
			{
				"comment_id": 203,
				"body": "如果你有公网IP，那么别人可以发起到你电脑的连接，这样你连上去中心化的网络应用比如P2P、区块链的机会大大增加，甚至成为一个枢纽。",
				"added": 1524837102
			}
		],
		"223_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 204,
				"body": "没有不值钱的东西，只有不合适的价格。关键是这个币需要我拿多少去换，未来能值几何。",
				"added": 1524837157
			}
		],
		"236_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 205,
				"body": "> [curiousguy](#comment_31_1G9zSma9ku5MpqT26vFf95BEidzudtoSTr): 中国最大的问题还是共产党的邪恶统治，不解决这个核心问题，其他的努力都是白费。解决这个问题的捷径是反抗组织集中全部人力财力专一行刺中共高官。当然在处于邪恶统治下的国家行刺统治者是困难极大的。由于共产党特别邪恶，邪恶到了高官纷纷把家人送去民主国家，自己在国内掠夺。在这种特殊情况下可以用绑架勒索撕票中共高官的海外亲属这种比较容易的方法来代替刺杀中共高官这种极为困难的方法，达到曲线监督独裁政权的目的。\n\n共产党在全世界都失去了市场，在中国能够风生水起，只能说是中国人的德性使然，无法产生自发秩序，只能接受外来统治。",
				"added": 1525268239
			}
		],
		"246_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 206,
				"body": "救赎只针对有罪之人。对于社会愧对的人，我们应该递上一支AK",
				"added": 1525268441
			},
			{
				"comment_id": 207,
				"body": "> [mrc](#comment_157_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 让一个残疾老太太拿着AK能做什么呢？\n\n小青年，你凭什么和拿着AK的残疾老太太斗？靠iPhone么",
				"added": 1525346741
			},
			{
				"comment_id": 209,
				"body": "> [mrc](#comment_158_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 救这位残疾老太太，是对你自己灵魂的救赎，而不是对她的灵魂救赎。看不明白我的原帖吗？另外，三十年前我算得上是一个小青年。现在只能称为小老年。\n\n救个人没什么高大上，我们这代人要救赎的话得去剿匪，要杀好多人的。",
				"added": 1525482847
			}
		],
		"6_17bEVchoz5wXqhDQ5EeXnVjwwNkBzUC1yc": [
			{
				"comment_id": 208,
				"body": "> [nff](#comment_4_17bEVchoz5wXqhDQ5EeXnVjwwNkBzUC1yc): 不能离线安装软件\n\n是因为离线安装无法及时更新所以不推荐。我个人更喜欢离线安装。但是Linux是开源软件，装一个软件可能依赖一堆其他软件，不能保证一个安装包就全部包括。",
				"added": 1525446630
			}
		],
		"264_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 210,
				"body": "虚拟货币对于持有者来说是资产，对于发行者来说要么是负债，要么是股权。发行者否认虚拟货币是债权，也就是不负责还本付息，那么就是股权融资。股权融资需要披露资本结构，请发行者明确，发行者目前负有哪些债务，目前的资本结构，以及持有此虚拟货币，对应着发行者让渡的哪一部分资产，发行总量有多少，对于持币者来说，以什么组织形式进行投票表决、议事、监督等等。\n虚拟货币本身不具有稀缺性，今天比特币，明天莱特币，谁都可以发行狗币、大撒币、逗币。如果说不出此虚拟货币对应的底层资产，那么这个虚拟货币的价值为0，远不及我敲的这么一段话有价值。",
				"added": 1525580642
			}
		],
		"160_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 211,
				"body": "> [amx](#comment_7_1BCayRGffLRPbgEcFtxXj9cnKKBDwL9TE2): 自己买个VPS下载个软件就行，VPS也很便宜。TK域名也免费，自己注册个就行。SSL证书也免费，自己申请个就行。😂\n\n好像用了一阵就开始收费了",
				"added": 1525610563
			}
		],
		"154_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 212,
				"body": "那是以前你刚加入，后来缓存了其他Tor节点",
				"added": 1525610659
			}
		],
		"276_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 213,
				"body": "这和政治讨论有什么关系",
				"added": 1525877064
			},
			{
				"comment_id": 215,
				"body": "> [mrc](#comment_167_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 作为一名平民，在中国用外国的银行卡就是政治问题，你不知道吗？\n\n如果从政治考量，不记名的现钞更值得推广",
				"added": 1526312436
			},
			{
				"comment_id": 216,
				"body": "> [mrc](#comment_168_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 一，你首先要能在外汇管制的情况换到那么多美元或欧元；二，必要时共产党是会挨家挨户掘地三尺收缴外币的。\n\n有点迫害妄想了。情况恶化不是一夜之间的，会有一个梯度。如果今天用现钞，远离电子支付，就已经不属于大数据意义上普通人了，生存概率大大提高。",
				"added": 1526397050
			},
			{
				"comment_id": 217,
				"body": "> [mrc](#comment_169_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 那还不如用虚拟货币。现在工资好像都是打到卡里吧？如果你只取现金却没有消费信息，他们会启用特别方式监视你的。怎么设想共匪的无所不用其极都不为过。他们为了保住自己剥削压迫人民的地位是不惜一切代价不放过一根疑似兵的草木的。\n\n目前只取现金还没有引起注意，因为没有结息流水信息很难贷款，低成本资金还是掌握在银行体系中。",
				"added": 1526476643
			}
		],
		"6_1PBMVMMVVtSK6FmMbfz4fhEw5fv6eZs5Dn": [
			{
				"comment_id": 214,
				"body": "第一轮：色情、政治、猎奇、翻墙\n第二轮：C2C B2C商城以及线下服务",
				"added": 1526312278
			}
		],
		"93_18JGyCjzNniRgg7A6aRyvrvV1VSrpZD5h2": [
			{
				"comment_id": 218,
				"body": "中国网络是充分开放的",
				"added": 1527000005
			}
		],
		"288_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 219,
				"body": "Registrant \tDejun Liu\nRegistrant Country \tDE \n受过迫害蹲过监狱的中国异议人士刘德军目前暂居德国南部城市纽伦堡。他曾在中国为捍卫人权而抗争。",
				"added": 1527165575
			}
		],
		"290_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 220,
				"body": "0.01以太币换100万自由币，需要的联系 Telegram 360BreakingWall",
				"added": 1527259322
			},
			{
				"comment_id": 221,
				"body": "> [rzi](#comment_7_1Mqn1Xp52QURho5ASWVXTFmwza5eEyTLr7): 我要mute你了，拜拜\n\n你要是觉得价钱不合适，可以自己报价，比如你要拿1自由币换多少别的货币，或者拿多少别的货币求购1自由币。\n多一个人收购自由币，相较于没有人收购，对于自由币持币者来说权益是多了还是少了？\n比特币面世之初，1万枚比特币换一块披萨。现在0.01枚以太币价值5.8美元，可以买两块披萨，以自由币现在的知名度，100万自由币能换到披萨吗？",
				"added": 1527323485
			}
		],
		"3_1F77QJqo1JG2kZzHZHTK458nZYNBHYvmFA": [
			{
				"comment_id": 222,
				"body": "货币是资产，价值首先要经受市场的检验，什么自由民主情怀都不顶用。倒是民主以后挂路灯，可以用枪杆子逼着人们用自由币民主币之类的。我担心最后就是这么个结局。",
				"added": 1527349739
			}
		],
		"287_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 223,
				"body": "> [mrc](#comment_181_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC): 是为了防止中国政府水军的匿名攻击。\n\n那样的话给匿名流量限速即可。有的人注重保护个人隐私",
				"added": 1527777329
			}
		],
		"2_1PMuHrGm4GFBBNbvRgr8zvyyRTc3rHpGYz": [
			{
				"comment_id": 224,
				"body": "eMule的官方社区已经被DCMA takedown，各分支客户端已多年没有更新，体验不适合吸引新网民\n说得好像上零网、翻墙体验很好一样。\n体验根本不算事",
				"added": 1528201461
			}
		],
		"310_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 225,
				"body": "Youtube是商业公司的财产，公司有权选择接受哪一些用户。如果一个用户给公司带来的利益小于0，那么这种用户到哪里都不受欢迎。\n发布Youtube视频不是你的基本权利，开设网站发布自己的视频才是你的权利。Youtube不欠你。",
				"added": 1530411618
			}
		],
		"2_1JSYcssLArxHrrU99vTJxVsUcrJDLWPT6K": [
			{
				"comment_id": 226,
				"body": "消消气\n骂小粉红属于教育，教育必须收费。遇到不交钱的小粉红，直接剁了做菜多好",
				"added": 1531567695
			}
		],
		"4_1JSYcssLArxHrrU99vTJxVsUcrJDLWPT6K": [
			{
				"comment_id": 227,
				"body": "中华民族本来就是苏联间谍发明出的词汇，中华民族是假民族",
				"added": 1531632172
			}
		],
		"323_1JMXM9eSCpGAocrYxkfUmwiXeqcJw637vC": [
			{
				"comment_id": 228,
				"body": "只能在文明国家碰瓷的教程就不用发了，咱们这里上次非暴力还算不上抗争，结果吃了枪子和坦克。",
				"added": 1531632764
			}
		],
		"1_12uSKhJAn1Q1RCC2zEQid114fPM4f1UB2n": [
			{
				"comment_id": 229,
				"body": "什么叫不建议购买，你告诉我涨还是跌，我好开仓啊",
				"added": 1531783744
			}
		],
		"1_1DW7uVif7nKJWLKf4qNfVDiBuqz9Lw8AU1": [
			{
				"comment_id": 230,
				"body": "Zeronet去中心化的技术特点本身是一大进步，实现了言论的去中心化传播，为言论自由提供了比门户网站、Web2.0和社交网络更好的技术支持。Zeronet上的内容本身并不太吸引人，也不应该太吸引人。如果一个社会的人们道路以目，不敢或者不能在公共的网站上公开表达观点，而需要这种匿名而且不被任意篡改删除的方式来讨论事情，这个社会本身就是问题很严重了。",
				"added": 1533221681
			}
		],
		"3_17EAtWww26A1GwJsp3tqQvoXS2PG5nmmmo": [
			{
				"comment_id": 231,
				"body": "损害到自己权利就嚷嚷，损害到别人权利就觉得理所当然，这种支那人就和猪圈里的猪一样。\n拥枪权是财产权的一种，无需经过国家授权。美国幸运之处在于，先有武装的人民，后有联邦政府。这和先有菜刀后有中国一个道理。",
				"added": 1533485289
			}
		],
		"1_17EAtWww26A1GwJsp3tqQvoXS2PG5nmmmo": [
			{
				"comment_id": 232,
				"body": "ZeroNet支持数据库，提供了javascript类库用来读写数据库",
				"added": 1533825162
			}
		],
		"13_1FJCJm9PPaL2Lcfv64fSCuXXBHQcE4JdGY": [
			{
				"comment_id": 233,
				"body": "IE这种浏览器还谈不上什么体验吧",
				"added": 1533827387
			}
		],
		"12_1LXSmRHtTjeKqDCSrZ8GLJUPRimrL5gGF5": [
			{
				"comment_id": 234,
				"body": "搜索可以解决的问题，就不要提问了。",
				"added": 1539444644
			}
		],
		"1_1L6dup95MS8WKXGhMJ3tmr1D2taF1FdyM9": [
			{
				"comment_id": 235,
				"body": "读史早知今日事",
				"added": 1541426728
			}
		],
		"2_1Nv9coai3XzgiS8VgetKQF7VXxfZZoJq93": [
			{
				"comment_id": 236,
				"body": "> [nekocross](#comment_392_1FHN4oukAG7zFUpiC9L2iz7QpQVTuT3xkz): 只需要在明网页面里面插入一个框架，引用零网内评论站点就行。就是不知道目前的安全措施允不允许这么干\n\n装扩展可以突破安全措施",
				"added": 1549112021
			},
			{
				"comment_id": 237,
				"body": "disqus不好用么。你做这种服务，上面的内容必然成为眼中钉，搞到最后，内嵌这种评论服务的网站也得下线接受整顿。中国的法律是有权的人可以任意解释的，抖机灵没用。",
				"added": 1562327588
			}
		],
		"1_1JRYCe7ZmABZF7Bak4tA9QzdYoY8z1t1oY": [
			{
				"comment_id": 238,
				"body": "能恰当地使用武力，是一个团体政治成熟的表现。非暴力抗争本身就是碰瓷，遇到流氓当道，自然要吃亏的。香港守土精英还太稚嫩，留给他们的时间已经不多了。",
				"added": 1564760842
			}
		],
		"18_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 239,
				"body": "台湾是一个国家，香港是一个自由城邦，中国大陆是很多伪民族和民族萌芽拼凑的德性洼地。只有形成真民族，真正为自己的前途负责，才有资格成为一个个独立的国家，内部才有民主。",
				"added": 1564760946
			},
			{
				"comment_id": 245,
				"body": "假设楼主发明的“西式选票民主”是指20世纪70年代借助传媒发展起来的大众民主。\n大众民主天生具有让公共部门不断扩张的倾向，终点就是社会主义，只是一党专政换成了轮流执政，土地依然是国有，强拆依然是合法的，封锁互联网依然是全国人民的选择。\n自由产生边界，边界即是秩序。秩序带来繁荣，繁荣产生无主的公共财产，诞生公共利益，这是大众民主所能挥霍的本钱。公私边界不明，抽象的人民利益高于具体的每个个体利益，然后让选票来代表人民的利益，还是文革那一套。",
				"added": 1590336155
			}
		],
		"17_1Q2yjutP8VevpmW5ZuKzNcDUQbUFn3gsVT": [
			{
				"comment_id": 240,
				"body": "逢中必反是洁身自好的表现。",
				"added": 1564761013
			}
		],
		"14_1GDtf6kkYiCtruw42QmAeaHG1HsrWFywkg": [
			{
				"comment_id": 241,
				"body": "只能说郭文贵和匪谍剪不断理还乱",
				"added": 1564761125
			}
		],
		"1_121nbwrxZZz6PJ1WQ324jojCnRE96xUnRr": [
			{
				"comment_id": 242,
				"body": "ShadowSocks 相关技术及软件产品归开源社区以及breakwa11等开发者所有，研发针对 ShadowSocks 的监听技术属于黑客行为。作者发现ShadowSocks 技术漏洞，在未通知开发者修复的情况下，将漏洞卖给间谍机构，同时损害了国家安全、公民通信机密与开发者的著作权，将其身份信息交给欧美司法和情报机构、告知ShadowSocks用户都是正确和必要的做法。",
				"added": 1575214445
			}
		],
		"18_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": [
			{
				"comment_id": 243,
				"body": "https://pincong.rocks/article/10998\n\n第五章  从梁家河到毛泽东思想学习班\n自那一夜后，平娃就不再下地务农了，三天两头跑樊家沟找红姐做那事。\n“习近平，我跟你说清楚，这年头人人都是特务，隔墙有耳，你天天缠着我做那事儿，不务正业，被人瞧见了影响不好。”\n面对习近平这只刚破处的泰迪熊的性欲，红姐感到无所适从，但最后也只能每次都依了他。为了避免别人说闲话，红姐推荐他做了赤脚医生，就这样习近平成了红姐的学徒跟班，每天只需要装模作样的做点医疗卫生工作，大多时间要么躲在窑洞里睡大觉要么跟红姐一起睡大觉。这让黑子这样的单身男性羡慕的要死，渐渐地，梁家河形成了一股“反习势力”，一群单身男知青和农村男青年准备召开针对习近平的批斗大会，罪状就是“一干活就打瞌睡，遇到困难就不做了睡大觉，第二天重新来过。见到女人就来精神，大白天耍流氓，调戏侮辱外村妇女，乱搞男女关系。”\n某日，平娃在红姐那办完正事后返回梁家河，可一踏进村，便感到周围的氛围有点不对劲，村民们看自己的眼神都不一样了，紧接着，就有戴着“造反派”袖标的人大喊：“习近平回来了！”\n平娃意识到情况不对，便撒腿就跑，沿着十里山路一路狂奔，最终又回到了红姐的医务室。\n“咋回事，怎么又回来了？”红姐看着气喘吁吁一副快死的样子的习近平，满脸困惑“我跟你说，今晚我肯定不跟你睡了。”\n“梁家河……呼哧呼哧……我呆不下去了……呼哧呼哧……他们在追杀我……呼哧呼哧……我要回北京……呼哧呼哧……你跟我一起回去。”\n“怎么回事？”红姐完全不清楚状况\n“听我的，跟我走。”\n“你得先解释清楚。”\n“你现在不跟我走，你就是破鞋，要挨批的。”\n红姐听到习近平嘴里冒出“破鞋”一词，二话不说给了他一巴掌。\n“贼你达，贼你妈，你妈才是破鞋！滚出去！”\n气得发疯的红姐将平娃从屋子里赶了出来，平娃担心敌人正在从梁家河一路追杀过来，于是也顾不得红姐了，直接朝着火车站奔去。\n\n……\n\n数天后，平娃乘着火车回到了北京的车站。一下车，平娃便往习近平家的方向一路狂奔。但到了目的地，他却发现他在北京的家已经不复存在。这时候，平娃突然想起当初在去延安的路上，听人说起一旦参加了上山下乡，户籍就自动迁过去了。\n也就是说，习近平的户籍已经在梁家河了，他现在是一个没有北京户籍的“低端人口”，如果遇到公安盘问，他必然要被“遣送原籍”。\n平娃想到了聂卫平，也许他可以暂时帮自己找到个容身之处，但经过打听才知道，聂卫平此时正跟他哥去云水洞探险去了。没有了可以依靠的人，平娃在首都东躲西藏了两三天，最终还是被当作“外地盲流”关进了收容所里。\n平娃在收容所里被关了大约一个礼拜，收容所的条件恶劣，伙食极差，一大堆人睡地铺，晚上亮着灯，白天还要被押着干活。但对住过陕北窑洞的平娃来说，收容所的住宿环境和窑洞也差不了多少，至少比露宿街头要好。收容所里许多都是从各地逃来北京的知青，闲聊时平娃将自己在陕北的艳遇说给他们听，弄得他们很是羡慕。\n终于有一天，“牢门”打开，军管会的人对平娃宣布：“习近平，你的问题已经弄清楚了，你是从延安梁家河村那来的外地盲流，本来应该马上遣送原籍，但由于你身份特殊，是反党分子习仲勋的儿子，组织上决定将你送往“学习班”教育一段时间再遣送原籍。”随后，平娃便被押送至这个“学习班”。\n\"学习班\"是毛泽东思想学习班的简称。1967年12月22日，《人民日报》发表社论《大力办好毛泽东思想学习班》，传达了毛主席的最新指示：\"办学习班是个好办法，很多问题可以在学习班得到解决。\"于是，全国各地五花八门的\"学习班\"纷纷涌现，蔚然成风。\n平娃被关押的这个“学习班”，就是原北京市少管所，现在叫“可教育好的子女学习班”，里面的人似乎都是习近平这样的原红二代，现黑二代。\n该学习班由解放军大校孟驰领导的军宣队接管，学员每天会在张伟与李威两个“军宣队”教官的带领下，读社论，念文件，学习\"最高指示\"，批判自己父母的罪行，致力于和他们划清界限。\n对平娃来说，就是必须每天批斗习仲勋，习仲勋并不是平娃的父亲，平娃也对他不是很了解，只知道他是一个共产党内的开明派，和赵紫阳一样同情六四学生。批判这种人，平娃是最擅长的，只需要使用被共青团中央、观察者网教育出来的炉火纯青的五毛话术就行了。\n听完习近平对其父亲的批斗，张伟和李威都吓得目瞪口呆。\n“你爹还收了美国中央情报局的钱来支持广东独立？”李威用非常怀疑的语气问习近平“据我所知，习仲勋从没去过广东啊。”\n“他还暗中支持北京的学生发动一场意图颠覆我国社会主义制度的颜色革命？”\n“颜色革命”一词，张伟也是头一次听说，他每天学习的毛泽东思想里似乎没有提到过这个词，正当张伟在思考是否该将其写进报告交给上面时，突然传来了女人刺耳的叫声。\n“怎么回事？谁的声音？”张伟问李威。\n“是之前已经宣布结业的那个叫李萌的。”李威在张伟耳边小声回答道“她似乎不想离开这里，孟驰同志就跟她说，留在这可以，但得给足够好处。”\n“啥好处啊？”\n“这你还不懂？”\n“她长得一般啊，还有点神经兮兮的。”\n“孟驰同志他又不挑。”\n“他们那隔音不好，不如今天就暂时停止学习，让学员们回去吧，免得闲言碎语传出去，让首长丢了面子。”\n张伟和李威就在平娃面前讲着悄悄话，全被平娃竖起耳朵听到了，之后两人宣布今天解散，学员们很快离开了教室，平娃想留下来看看到底接下来会发生什么，但还是被张伟和李威赶走了。在回住宿处的路上，平娃听见了远处传来的女人的声音。\n“不要啊，不要强奸我，不要，熙来，救我，熙来！”\n\n\nhttps://pincong.rocks/article/15463\n第六章 伽倪墨得斯如是说\n在“可教育好的子女学习班”，被送进来的干部子弟都是多人合宿，唯独只有一人有一间单人宿舍，宿舍的门上贴着的名条写着“薄熙来”三个字\n“薄熙来？好像听过这个名字。”\n在平娃所在的未来，薄熙来已经在秦城监狱中病重去世了，平娃是在新闻上听到这个人的。\n“不过为什么给他一个单间呢？”住脏乱差的多人间的平娃有些不服气，便和其他舍友聊起这事来。\n“你是刚被抓进来，不知道这里的情况，这薄熙来怪得很。”\n“怎么个怪法？”\n“他刚进来的时候，因为他爹薄一波，是有名的叛徒，他为了表示自己已经和父亲划清界限，发了疯似的拼命学习“老五篇”，表现得特别好。平时在这混的也风生水起，甚至组了个熙来帮。但后来有一天，他就仿佛变了个人似的，一下子变得一言不发，既不学习，也不理原来跟着他混的那些人。”\n“不学习，张伟、李威他们不管吗？”\n“怎么会不管，他不学习毛泽东思想，这里官最大的那个孟驰就拿枪指着他逼他罚抄毛主席语录，但这情况下，他也一句话都不说，一个字也不写。”\n“太强了吧。”平娃不由得赞叹薄熙来的勇气。\n“但怪就怪在这了，那次孟驰气的把他叫进小房间单独训话，训了几个小时，但出来以后，孟驰居然跟我们说，薄熙来其实很用功，已经偷偷把毛主席语录罚抄完了。”\n“真的抄了吗？”平娃问道。\n“孟驰是给我们看了他抄的内容，但总感觉不像薄熙来会做的事情，而且之后薄熙来不学习，孟驰看到了也不再训他了，还批评李威和张伟对薄熙来有意见，弄得李威和张伟火气很大，但面对上级，他们也敢怒不敢言。你说这事诡异不诡异？”\n“是挺奇怪的。”但比起穿越来说真的算不了什么，亲身体验过超自然现象的平娃并没把这件怪谈放在心上，除了薄熙来，他还有一个疑问“那个叫李萌的女人又是谁？”\n“那女人是那个李威在街上捡到的，不知道是什么身份，本来不应该呆在我们这种干部子弟学习班的，但是孟驰强行把她留下来了。”\n“这孟驰可真是个臭流氓啊！”平娃不由得感叹到。\n“但这也挺奇怪的。”\n“奇怪在哪里？”平娃问道\n“不瞒你说啊，我们怀疑孟驰他是屁精！”\n“屁精？”平娃似乎没听说过这个词语\n“就是喜欢操男人屁眼的男人。”\n“原来是基佬啊！”\n“基佬？”\n“啊……这……这是我们陕北那边的方言，形容这种人的。”\n平娃发现自己说出了未来的词汇，连忙编了个谎话来圆场。\n在毛泽东的时代，同性恋、基佬这些词还不存在，同志一词还是中共党员用来称呼革命战友的，民间常用“屁精”、“兔子”、“鸡奸”等词来指代同性恋。\n“你们怎么发现孟驰是屁精的？”\n“你在这呆久了肯定能发现的，你看他平时最喜欢找哪些人去他那单独训话就知道了。”\n“比如？”\n“比如那个肖战，你认识吗？”\n“哦，那个人啊。”平娃虽然才刚来了几天，但对这个肖战有点印象，长得跟平娃那个年代的小鲜肉男爱豆似的。\n“长得是挺好看，第一眼我还以为他是女的呢，难怪被孟驰看上了，天天换着花样刁难他，就是要找借口把他叫去训话。”\n“每次肖战从孟驰那里出来，表情都不太对劲，我们问他，孟驰都对他干了什么，他也不回我们，听他舍友说经常在半夜听到他的哭声。”\n“现在看来这个孟驰是男女通吃，真是个百年难遇的大流氓！”\n平娃想起昨日回宿舍路上听到的李萌的惨叫，有些心疼起了她来，便说道：“这孟驰可真不是东西，不如我们溜出去，找到孟驰的上级，举报他生活作风流氓，是现行反革命犯？”\n“可别，在这偷偷骂骂就得了。孟驰他可是这里的头，你敢跟他作对，你不要命啦。他说你是反革命，你就是反革命。再说了，难道举报了就有用吗，保不准孟驰背后有什么人保他呢，到时候举报不成，自己进牢里去了。”\n“唉，说实话还真羡慕孟驰，我长这么大，还没碰过女人，他倒好，男的女的都日过了。”\n“隔墙有耳，咱不聊这个了，赶紧换个话题。”\n这时突然有人问道：“近平，你有对象吗？”\n“看他这样子，感觉应该有吧。”\n平娃想起自己和红姐的最后一面，也不确定自己现在还有没有对象，便支支吾吾答道“在陕北插队的时候认识的，我丢下她逃回来了，现在应该算分了吧。”\n“果然有啊，羡慕你小子。”\n“已经分了？没事，天底下女人有的是。”\n“等老子出了这个狗日的学习班，老子要日遍天下的女人。”\n之后，平娃这个宿舍的男人们便讨论了一夜有关女人、性的话题，平娃觉得听处男讨论这些实在是无趣，便早早睡下了。\n\n第二天一早，一记响声，把平娃从睡梦中叫醒了，“大清早的，哪个狗娘养的弄出这么大动静”。他看了看四周的舍友，发现他们还睡得很沉，想必是昨晚聊到很久。\n这时平娃突然发觉裤裆里一阵难受，一模，原来是昨晚梦见红姐导致自己梦遗了，平娃便把内裤脱了下来，打算拿出去洗。\n平娃生怕叫醒旁边的舍友，静悄悄、轻手轻脚的走到门口，不想弄出什么动静，但门一开，平娃就见到了令人震撼的一幕——只见一个裸女，从眼前飞快的从自己眼前跑过去。\n平娃顿时怀疑自己是不是还在梦里，便捏了下自己的脸，但这确实是现实。看着裸女消失在走廊的尽头，平娃有了跟上去一探究竟的愿望。但一想自己光着下身，手里拿着内裤，再去追这个裸女，万一被人看到了，可就有理也说不清了，于是便放弃了这个想法，往反方向的洗衣池走去了。\n\n洗完内裤，平娃才意识到湿内裤穿着会更难受，难不成今天要不穿内裤过一天？正当平娃不知道如何是好的时候，他突然瞥见对面那间屋子的房门虚掩着。\n“这好像是孟驰住的那间吧？”\n平娃好奇的往里面一看，发现孟驰正趴在办公桌上，似乎是睡着了。\n“不会是办公到深夜然后趴着睡着了吧，他工作这么认真？”\n而桌子前的椅子上放着一条内裤，看样式似乎是女人穿的。这时平娃产生了一个大胆的想法，他蹑手蹑脚的走进孟驰的屋子，拿起那条内裤，穿上了它。\n第一次穿女人的内裤，平娃不由得脸红心跳，在确认了孟驰似乎没有醒来的迹象后，平娃打算离开了，但一转身，平娃看到的画面比刚才看到裸女还要可怕，几乎让他叫出声来。\n只见薄熙来突然悄无声息地出现在平娃的面前，同时正用悲悯的眼神打量着平娃下身穿着的女式内裤。正当平娃用平生最快的速度转动大脑来组织语言，打算跟薄熙来解释的时候，薄熙来似乎没有跟眼前这位举止打扮都十分可疑的人士交谈的意图，而是径直朝着孟驰走了过去。\n薄熙来走到趴在桌子上的孟驰的跟前，盯着他看了一会儿，摸了摸他的手腕，似乎是发现了什么异样，便俯下身子，把鼻子凑近孟驰的脸闻了一下，然后直起身子，做出沉思状。\n“首长他怎么样了？没什么事吧？”平娃感觉事情似乎有些不对劲，便试探性地问道\n薄熙来看了一眼平娃，沉默了数秒，用非常平静的语气朝着平娃说了一句让他震惊的话\n“孟驰已经死了。”\n“怎……怎么会？”\n“嘴里有杏仁味，是氰化物中毒，肯定没救了。”\n平娃知道这种东西，是名侦探柯南里常见的毒药。\n“你叫什么名字？”\n“习……习近平。”\n“你有看到是谁杀了他吗？”薄熙来皱了皱眉头，继续问道。 ",
				"added": 1577115232
			}
		],
		"3_1DvQJKRFe1BYN3gyctA3BkjuxUQN8bRCof": [
			{
				"comment_id": 244,
				"body": "“想人肉这些人”是说那些想吃人肉的人，还是你本人想人肉搜索“这些虐狗虐猫的人”？",
				"added": 1583673910
			}
		],
		"3_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": [
			{
				"comment_id": 246,
				"body": "按照姨学观点，无产阶级是一系列价值观，方法论和物质现实的总和。无产阶级最显著的特点是没有什么可失去，因此没有必要维持自己的声誉和信用，便宜占尽，人得罪光。\n\n无产阶级世界观：世界大同，全球赤贫才是最稳定的状态，没有什么可失去就没有什么负担，这样的人最快乐\n\n无产阶级方法论：创造，积累和代际传承是不划算的，偷窃，打劫，卖体力赚快钱才是正道，维持自己的声誉和信用自然也是徒劳和愚蠢的\n\n无产阶级现实：一无所有，沦为马克思主义所描述的那种不占有物质生产资料的状态",
				"added": 1590336238
			},
			{
				"comment_id": 249,
				"body": "> [mrv](#comment_5_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv): 无产阶级要反抗剥削\n\n无产阶级从来没有反抗剥削。工作报酬包含不完全契约带来的安全和现金两部分，是因为工作不承担经济波动，产品滞销之类的风险，而不是资本家的剥削。无产阶级真正反对的是财富的积累，他们必须消灭资本家，也就是消灭别人的财富积累，才能实现全球赤贫",
				"added": 1594994726
			}
		],
		"1_1E5AbkLYRbesWTrZTxDjBMjeFkbHBGF5EW": [
			{
				"comment_id": 247,
				"body": "> [12321](#comment_4_1EKvHWKisu4GN67JH1zsRJFGBE5UuGYfoH): 澳门、湾湾：合着我俩不是中国，你争取的都不是我俩的自由是吧\n\n国就是城，中国就是洛阳城，香港不是中国，满洲，巴蜀，上海和吴越都不是中国",
				"added": 1590336516
			}
		],
		"2_1B4HAuapkMBUARLKGgApRuMuf88WiJahVP": [
			{
				"comment_id": 248,
				"body": "我上了20多年网了，什么样的场面我没见过？以前不用翻墙，现在要翻墙，你问我翻墙后最大的感受是什么？当然是墙真TM操蛋，建墙的人早日死妈。",
				"added": 1590336603
			}
		],
		"5_1NnCNCau8QnJDzkZqX9KMdqn4SenArGwRv": [
			{
				"comment_id": 250,
				"body": "资本家的剩余价值来自于承担经营风险，就是张五常所说的不完全契约。",
				"added": 1594994866
			}
		],
		"11_1EAJBzztdkZwT9cMJWCuP1ZqvKW6X8Bc2T": [
			{
				"comment_id": 251,
				"body": "速蛙云，审计开启，迫害法轮功，给爷爬回圈里\n来这里推荐垃圾机场，当ZeroNet用户眼瞎么",
				"added": 1598197100
			}
		],
		"1_1Q9vgKagehDHwvhYF32zpRPuDaBNDQ3PaE": [
			{
				"comment_id": 252,
				"body": "这么快就跑路，估计楼主也是诈骗团伙一员\n建议拉黑楼主。这种人以后就别来ZeroNet混了",
				"added": 1598197302
			}
		],
		"10_1EAJBzztdkZwT9cMJWCuP1ZqvKW6X8Bc2T": [
			{
				"comment_id": 253,
				"body": "这种楼主是多大仇啊，推荐一个网站都打不开的机场。当ZeroNet是垃圾桶吗",
				"added": 1598197387
			},
			{
				"comment_id": 262,
				"body": "注册还限制邮箱后缀，而且居然都是什么163，QQ邮箱之类的。这机场主估计是粉红。\n而且你推荐码也过期了，推荐人不存在",
				"added": 1610196134
			}
		],
		"8_1EAJBzztdkZwT9cMJWCuP1ZqvKW6X8Bc2T": [
			{
				"comment_id": 254,
				"body": "现在搞诈骗都不带脑子的吗？要注册先订购9元套餐，订购尼玛啊\n还3元/月，网站上写着9元/季，楼主嫌商家营销不够吸引眼球，拆成一个月卖啊，你说不是商家一伙的，我猜你是商家的亲爹吧",
				"added": 1598197553
			}
		],
		"3_1NVS5efhaHc2gCETnyXCJiwc1vVvgBvCE9": [
			{
				"comment_id": 255,
				"body": "用QQ联络的机场你也敢用，怕是嫌警察工作不饱和吧",
				"added": 1598197780
			}
		],
		"5_1NUPxZD5kGC1RiuppDV1iRtNukZS5oZqw5": [
			{
				"comment_id": 256,
				"body": "> [cyf](#comment_5_19j1obcsYihhYGVrEqerD8zuataig8TTQP): justmysocks.com建议轮子少看点，共产党的黑历史还行，就不要看那些天天叫嚣着轮子治疗肺炎。\n\n脑残就该少发言，多发言容易吸入武肺病毒",
				"added": 1598197842
			}
		],
		"1_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf": [
			{
				"comment_id": 257,
				"body": "1)到底如何使用比特币？Windows 系统的电脑需要下载什么软件？\n下载比特币钱包软件\n\n2) 网络上有一些人说，比特币有一些缺陷，效率低：\n全互联网每秒钟可以认可的比特币交易只有7笔，炒币火热的那一阵子，真正完成一笔支付需要大约一周时间！！\n既然操作环节需要经过很多节点的确认，请问操作过程中，需要注意哪些事项？\n第一，用安全的方式备份私钥，最好是用不联网的设备拍下来，或者存在卡里，刻在光盘里，不接触电脑；甚至抄在纸上。世界上大多数比特币因为保管不当永远遗失了\n第二，核实好对方收款地址，因为转出去就不能撤回的，转错地址也别想联系到对方\n第三，不要信任任何第三方平台，包括在线钱包、比特币在线购物平台、比特币交易平台。有币就及时转回自己钱包。\n\n全互联网每秒钟可以认可的比特币交易只有7笔\n说法有误。你实际转一下就知道了，也就几分钟就确认了。",
				"added": 1598615952
			},
			{
				"comment_id": 258,
				"body": "> [skytw](#comment_2_1GmnzXHeSi3UXLhbdL92ps2CExH6u46Uyf): 谢谢大侠的专业指导！看来我需要进一步学习……再请教另外一些疑问，细节如下：该如何注册比特币账户，汉字百度搜索，跳出来的是  火币网。海外的比特币用户显然不会去火币网注册。那么，在海外，比较受欢迎的比特币账户注册网站，有哪些？方便时，请进一步指导，谢谢哦。\n\n你投资比特币，用百度搜索，然后大概率是被骗钱，还学到错误的知识。",
				"added": 1598616001
			}
		],
		"1_197jsoB6dvq3kKxENBre1AfZhG5JbhXrRF": [
			{
				"comment_id": 259,
				"body": "你给的链接是两个站点，哪个和主题有关？\n关于HTML排版对齐问题，你先在纸上画好方框，再用代码实现",
				"added": 1598616369
			},
			{
				"comment_id": 260,
				"body": "http://127.0.0.1:43110/1B4vYHwkCywhjs3GMxFSvdCraYj5dh9LTV/\nMake America Great Again\n第一个网站，帖子套在 <div class=\"center topics-list\"> </div>中，center这个class是由专业的程序员提供的，定义在all.css中，我们不要去改它。只要你的主体内容块被包裹在它里面，那就是居中的。",
				"added": 1598616859
			}
		],
		"2_1CXDZSdejmfcUvG1AkCRJDTg1ALK2TiFNw": [
			{
				"comment_id": 261,
				"body": "遇到反法轮功的，嘲笑香港的支那人，应该远离。这种人反共是口是心非，一个武汉肺炎就给染红了。",
				"added": 1610195928
			}
		],
		"1_1HyrFrFXUHZC58qLuFrjAXm2Jjkb3Y6ufX": [
			{
				"comment_id": 263,
				"body": "It gets harder and hard to get access to trackers. I can still find some peers, but not sure where they base.",
				"added": 1616905211
			}
		]
	},
	"comment_vote": {
		"65_1LNpoyKNhp2VFnDzZA6k5uMtj66EZWkjBc": 1,
		"809_1958F7oCppj78MP966AfojMQwHg2WUupzq": 1,
		"231_1Bq97dNgwH1pqVi8XkNNpq9gW4e5zAm3kV": 1,
		"57_1CdwZ24MZhBc2XNT2vAjk2MQjJuEnybP5W": 1
	}
}