{
	"next_topic_id": 3,
	"topic": [
		{
			"topic_id": 1628077482,
			"title": "Is sweden almost free of covid restriction / not making vaccination mandatory, because people already using / businesses require cashless payments everywhere?",
			"body": "no text",
			"added": 1628077481
		},
		{
			"topic_id": 1629402955,
			"title": "Why can't people see the tyranny of the covid hoax?",
			"body": "Please only answer if you are not a stupid sheep who believes all this bullshit.\n\nI just can't take it anymore. Why is it so difficult to say back to normal and fuck all this nonsense?\n\nThey took our freedom. They took everything. Why do people allow this? \nWhy are there everywhere this people who say \"get over it\" or \"it is just two shots\" or \"two more weeks\".\n\nWhat must happen that it stops? Can the vaxxed not be dead already for their utterly stupidity to taken a experimental gene therapy to \"get back their freedoms\"?\n\nHow is it going you stupid fucking sheep? Have your freedoms magically returned back to you? Oh, you have to show your card now everywhere you want to go in. But yes it is fine, right? Oh, you're in lockdown or in quarantine for a few days, weeks or months. Sounds you're totally free by now, right?\n\nNow it is just you have to take the third shot. And of course wear a mask everywhere, because you could spread the deadly virus even if you're vaxxed and tested.Sure now you are free again.\n\nThe world truly now is like 2019, right?\n\nFuck you all and die already.",
			"added": 1629402953
		}
	],
	"topic_vote": {},
	"next_comment_id": 4,
	"comment": {
		"1628077482_19BXHBD1GfYpSpvdHsuHJsJ97mYpxWjUE": [
			{
				"comment_id": 1,
				"body": "Ah I see. People don't understand the question. I meant will the elites be happy when they control all cash flows, so that we can have our lives back? Spoiler alert: The answer is no. But anyway discuss my little slaves.",
				"added": 1628095194
			},
			{
				"comment_id": 2,
				"body": "true. who is unvaxxed here? and who is dying on this hill?",
				"added": 1628112278
			},
			{
				"comment_id": 3,
				"body": "I hope you die from it. Death to Vaxx Shills.",
				"added": 1629403818
			}
		]
	},
	"comment_vote": {}
}